{
  "source_id": "道德真经集注杂说",
  "source_file": "chunked_daozang\\道德真经集注杂说.json",
  "total_chunks": 21,
  "total_original_chars": 21933,
  "total_translated_chars": 120908,
  "total_translation_time": 502.9862220287323,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经集注杂说.txt",
    "category": "玉诀类"
  },
  "full_translation": "**The *Zhuji Zasuo* of the *Daode Zhengjing*: A Miscellany of Commentaries**\n*Compiled by Song-era Peng Zhi (Simplified: Peng Xi)*\nTwo scrolls.\nSource text: *Zhengtong Daozang*, *Dongshen* Section, *Yujue* Category.\n\n---\n\n**Volume One of the *Zhuji Zasuo* of the *Daode Zhengjing***\n*Compiled by Peng Zhi of the Song-era Hèlín*\n\nWhen the Taizu Emperor marched to conquer Taiyuan, he halted at Zhènyáng and heard that the Daoist Su Chengyīn had secluded himself since the Five Dynasties period, though repeatedly summoned, he never came. The Emperor then received him in the imperial pavilion.\n\nAt eighty years old, Su Chengyīn replied to the Emperor’s inquiry on nurturing life (*yǎngshēng*) by saying: *\"My own practice of nurturing life is merely refining the mind and cultivating qi. For emperors, it is different.\"*\n\nLaozi said:\n*\"If I do nothing, the people transform themselves.\nIf I desire nothing, the people return to simplicity.\nDoing nothing, desiring nothing—\nConcentrate the spirit in the Great Harmony.\"*\n\nIn ancient times, the Yellow Emperor and King Tang of the Xia Dynasty ruled for long years—\nThey attained this Dao.\n\nThe Emperor was pleased with this response.\n\nSee also the *Dōngdū Shìlüè* in the *Yǐnyì* and *Gāodào* transmissions.\n\n**Hongmengzi Zhang Wumeng**, styled Língyǐn, loved simplicity and emptiness, mastering the *Laozi* and *Yijing* deeply. He entered Huashan, forming a bond with Liu Haichán and Zhòng Fàng as outer-world friends, and served Master Chen Xīyí. Wumeng often grasped subtle truths.\n\nLater, he entered Tiāntáishān. Emperor Zhenzong summoned him and asked for strategies for longevity. Wumeng replied:\n*\"I am a rustic mountain dweller. Each morning, I recite the *Laozi* and *Zhouyi*—nothing else.\"*\n\nHe was granted the title of *Zhuozuo Zuolang*, but he declined and returned to the mountains.\nThough bestowed gold, silk, and the honorary title of *chushì*, he refused them all.\n\n**From the *Gāodào Zhuan*:**\n\nThe **Bìxūzi** Chen Jingyuan, a disciple of Zhang Hongmeng, composed the *Zhuǎnwēi Piān* of the *Dàodé Jīng Cángshì*, gathering the refined insights of ancient commentaries and supplementing them with his master’s secret transmissions to form this work. During the **Xīníng** era, he was summoned and presented his writings to the emperor, who personally inscribed words of praise. He also authored a twenty-plus volume *Zhāngjù Yīnyì* on the *Nánhuá Jīng*, now also housed in the **Daozang**.\n\nSee also the *Bìxūzi Zhuan*, the *Zhuǎnwēi Piān·Xù*, and the *Daozang Mùlù*. In his *Cángshū Zhì*, **Guǎngchuān Dòng Dǒu** notes:\n\nDuring the **Tang Xuānzong**’s reign, after he annotated the *Laozi*, he standardized the text as the *Dàodé Jīng*, categorizing passages on **Dao** in the upper scroll and those on **virtue** in the lower, then inscribed them on stone at the **Lǎozǐ Temple** in Wōkǒu. He further records that the Tang Daoist **Zhang Daoxiàng** compiled a seven-volume *Jízhù Dàodé Jīng*, encompassing thirty schools. Those whose names survive include: **Héshànggōng, Jiějiě, Yán Zhūn, Wáng Bì, Hé Yān, Guōxiàng, Zhōng Huì, Sūn Dēng, Yánggù, Jiūmóluóshì, Lú Jǐngyù, Liú Rénhuì, Gù Huān, Táohóngjǐng, Sōnglíng, Péi Chǔsī, Dú Bì, Zhāng Píng, Zhāng Sì, Zāng Xuānjìng, Mèng Ānqī, Mèng Zhìzhōu, Dòu Luè, Sòng Wénmíng, Chǔ Rǒu, Liú Jìnxǐ, Cài Zǐhuàng, Chéng Xuānyīng, Chē Huìbì**. Yet cross-referencing the *Xīn-Jiù Tángshū·Yìwén Zhì*, additional names emerge: **Wúqiū Wàngzhī, Xiāngyì (surname unknown), Chéng Shào, Wáng Shàng, Shǔ Cái, Yuàn Zhēn, Shì Huìyán, Huìlín, Yìyǐng, Liáng Kuàng, Shù Zhōngshān, Fù Yì, Yáng Shàngshàn, Lǐ Yǔnyuàn, Chén Sìgǔ, Rèn Zhēnzǐ, Fèng Guō, Xuān Jǐng Xiānsheng, Yáng Shàngqì, Hán Dù, Liáng Wǔdì, Liáng Jiǎnwéndì, Jiǎ Dàyǐn, Bìlǘ Rénxù, Liú Zhòngróng, Wáng Shù, Dài Yì, Xuānzōng, Lú Cángyòng, Xíng Nánhé, Fèng Cháoyǐn, Bái Lǚzhōng, Lǐ Bō, Yǐn Zhīzhāng, Lǚ Déming, Chén Tíngyù, Lǚ Xīshēng, Wú Shànjīng, Sūn Sīmiào, Lǐ Hán guāng**—forty schools in total. Yet of these, Zhang Daoxiàng’s compilation includes only **Guōxiàng, Liú Rénhuì, Sōnglíng, Péi Chǔsī, Dú Bì, Zhāng Sì, Zāng Xuānjìng, Dòu Luè, Sòng Wénmíng, Chǔ Rǒu, Liú Jìnxǐ, Cài Zǐhuàng, Chē Huìbì**—fourteen names absent from the *Zhì*. The *Zhì* further lists Daoxiàng’s *Jízhù* as four volumes, yet Dòng Dǒu’s collection contains seven, suggesting later additions.\n\nIn the **Song Chóngníng** era, the *Daozang* was reexamined, yet this work was no longer found within. Only the annotations of **Xuānzōng, Héshànggōng, Yán Zhūn, and Lǚ Xīshēng**—alongside Fù Yì’s transmitted ancient text of the *Dàodé Jīng*—remained. Externally, **Lǐ Yuē, Lǐ Róng, and Jiǎ Qīngyí** each offered their own commentaries, while **Wáng** and **Gù** compiled imperial annotations under Xuānzōng’s command. **Dú Guāngtíng** later authored the *Guǎngshèng Yì*, also preserved in the *Cángshì*. Thus, it is clear that even the six recorded in the *Zhì* were incomplete—lamentably, nine-tenths of these works survive only by name.\n\nThe Tang official **Lǚ Xīshēng**, of the **Bīngbù**, and son of **Lǚ Miǎn**, authored a four-volume *Dàodé Jīng Zhuàn*. His preface briefly states:\n\n*\"The Master Lao’s teachings take **Dao** as essence and **virtue** as function—non-action yet encompassing all action—harmonizing with the **Royal Polarity**. Yang Zhu followed the Master’s essence but erred in undervaluing the world, elevating self over substance. Zhuang Zhou expounded the Master’s function but overreached, seeking to abandon sageliness and discard wisdom. Shèn and Hán misapplied the Master’s **virtue**, descending into harsh legalism. Wáng and Hé lost the Master’s **Dao**, drifting into empty nihilism. These six disciples are all the Master’s transgressors. Thus, I have written this transmission to elucidate his true intent.\"*\n\nHe further states:\n\n*\"In antiquity, Fúxī drew the Eight Trigrams, mirroring all things, exhausting the principles of **nature and life**, aligning with the harmony of **Dao and virtue**. The Master Lao preceded heaven and earth, founding **yin and yang**, probing the limits of **nature and life**, uncovering the depths of **Dao and virtue**—thus sharing the same origin as Fúxī. King Wén observed the dynamic **Nine and Six** of the **Great Ease**, valuing strength yet prioritizing change, ultimately centering on moderation. The Master Lao discerned the **Seven and Eight** of the **Great Ease**, emphasizing softness and stillness, unifying all under the **Great**. Thus, he shared the same lineage as King Wén. Confucius inherited the **Dao** of Yáo and Shùn, establishing the constitutional models of Wén and Wǔ, guiding the people with the teachings of **ren and yì**. The Master Lao modeled himself on Fúxī, encompassing the achievements of **Huángdì**, transforming the world through the **Dao of virtue**. Thus, he aligned with Confucius in **strategic application**. These three sages represent the pinnacle of **sainthood**; the Master Lao harmonized and transcended them, penetrating the mechanisms of transformation, exploring the ultimate precision of essence—truly the most divine.\"*\n\nThe Tang official **Lǐ Yuē**, of the **Bīngbù**, and son of **Lǐ Miǎn**, authored a four-volume annotation on the *Dàodé Jīng*. His interpretation argues that the world mistakenly views this text as the empty rhetoric of immortals, unaware that the **Six Classics** are but branches of **Huáng-Lǎo doctrine**.\n\nThe Tang **Tàizōng** once asked **Fù Yì**, *\"Buddhism and Dao are profound—why do you not grasp their principles?\"* Fù Yì replied, *\"Buddhism is but a bandit from the Western lands, initially confined to the frontier, now seeping into China. It is nothing more than a superficial embellishment of Lao and Zhuang’s mystical phrases—useless to the common folk and harmful to the state.\"* The emperor was persuaded by his words.\n\n「At his deathbed, he admonished his son: *\"The profound unity of Lao and Zhuang’s teachings, along with the doctrines of the Six Classics from Zhou and Confucius, constitute the **name-teaching** (míngjiào). You should study them diligently. As for the heretical barbarians (yāohú) corrupting China, all are misled by them—you must not follow their ways.\"* (As seen in his *Old Book of Tang* biography.)\n\nThe Tang **Xianzong** once addressed his ministers: *\"Are the matters of immortals (shénxiān) truly credible?\"*\n**Lǐ Fān** replied: *\"The discourse of immortals originates from the Daoist tradition. The Daoists revere the *Five Thousand Words* of Laozi as their foundation, and his core teachings align with those of the Classics. Later generations, however, who indulged in eccentric speculation, falsely attributed the idea of immortals to Laozi. Thus, the two rulers, **Qín Shǐhuáng** and **Hàn Wǔdì**, were deceived by such claims and ultimately gained nothing.\"*\n\nThe emperor was deeply convinced by his words. (As seen in the *Old Book of Tang—Xianzong’s Records*.)\n\n**Zhòng Zhǎng**’s eldest son, **Zǐ Guāng**, styled **Bù Yào**, in the late years of **Kāihuáng**, built a hermitage along the riverbanks. When officials paid their respects, he declined by claiming muteness.\n\nIf someone requested his teachings, he would write the characters **Lǎo** and **Yì** (Lao and Zhuang) to show them, comparing **Wén Zhōngzǐ** (Master Mozi) to **Yú Zhòng** and **Yí Yì** (the virtuous but misunderstood figures of antiquity). (As recorded in **Wáng Jì’s** *Biography of Master Zhòng Zhǎng* and **Wén Zhōngzǐ’s** annotations.)\n\n**Dōng Gāo Zǐ** **Wáng Jì**, styled **Wú Gōng**, elder brother of **Wáng Tōng**, was a great Confucian scholar of the late **Sui dynasty**. He owned fields along the riverbanks, and **Zhòng Zhǎng**’s son **Zǐ Guāng** built a dwelling near the northern bank. **Wáng Jì** admired his sincerity and moved to live nearby, always placing *Zhōu Yì* (the *Book of Changes*), *Lǎo Zǐ* (Laozi), and *Zhuāng Zǐ* (Zhuangzi) at his bedside, rarely reading other books. (As seen in the *New Book of Tang—Biographies of Recluses*.)\n\n**Lú Hóngyī**, styled **Chéngrán**, hid in **Sōngshān** (Song Mountain). In **Kāiyuán** year six, he was summoned to **Dōngdū** (Eastern Capital). Upon meeting the emperor, he did not bow. The ministers sent a **Tōngshì Shèrén** (attendant official) to inquire about his conduct, and he reported: *\"I have heard the **Old Master** (Lǎojūn) say that **rites** (lǐ) are but the outward display of **loyalty and sincerity** (zhōngxìn), insufficient to rely upon. As a humble subject of the mountain, I dare not present myself with such formalities.\"*\n\n(As seen in the *Old Book of Tang—Biographies of Recluses*.)\n\n**Zhēnyī Xiānsheng** **Sīmǎ Chéngzhēn**, with his courtesy name **Zǐ Wēi**, resided in his retreat on **Tiān’tái** (Tian Tai Mountain) and never ventured out. The **Ruìzōng** emperor ordered his brother **Sīmǎ Chéngtán** to persuade him to leave. Once he arrived, the emperor led him into the **inner palace** (zhōngyè) and questioned him about his methods. He answered: *\"Pursuing the Dao requires daily **self-cultivation** (rǎn), diminishing one’s self further and further until reaching **non-action** (wúwéi).*\n\n*Even the perceptions of the mind and eyes must be reduced, yet they cannot fully cease. How much more so when one delves into heterodox theories and amplifies one’s clever schemes!\"*\n\nThe emperor said: *\"Your words apply to cultivating oneself, but how would they guide the governance of a nation?\"*\n\nThe Master replied: *\"A nation is like the self—thus, one must cultivate a mind of simplicity, harmonize one’s qi with emptiness, and act spontaneously without selfishness, and the realm will be governed in harmony.\"* The Emperor sighed in admiration: *\"This is the speech of Guangchéng!\"*\n\nDuring the **Kāiyuán** era, he was summoned again to the capital, and Emperor Xuanzong decreed that a hall be built for him on **Wàngwū Shān** (Wangwu Mountain) as his residence. Skilled in **seal and clerical script**, the Emperor commanded him to transcribe *Lǎozǐ* in the **Three Scripts** and correct its textual errors. *(As recorded in the *New Tang Book·Recluses*, the old text states: The Emperor ordered him to transcribe the *Lǎozǐ Jing* in the Three Scripts, thereby correcting the text and establishing its true version of **5,384 characters**, which he then presented to the throne.)*\n\n**Zhēnyī** Master **Sīmǎ Chéngtán**, of **Rúzhōng** (Ruizhong), was a scholar who later entered **Sōngshān** (Songshan) as a Daoist. After some time, he traveled to **Tiāntái** (Tiantai). Emperor Xuanzong sent envoys to summon him, and upon his arrival, the Emperor questioned him on Daoist methods. He answered: *\"The essence of the Dao is nowhere more refined than in the **Five Thousand Words** (of *Lǎozǐ*). The rest are merely verbose elaborations, wasting nothing but paper.\"*\n\n*(The *Old Tang Book·Recluses* and its revised edition record: The Emperor once asked him about the Dao, and he replied: *\"Those deeply versed in the Dao have nothing beyond Lǎozǐ’s **Five Thousand Characters**; the rest are mere squandering of paper.\"* When further questioned on **immortal techniques and alchemical refinement**, he responded: *\"These are matters for rustics. Seeking them over years is not a concern for a ruler.\"* The text here differs slightly from the old edition, hence both are recorded.)*\n\n**Bān Gù** recorded that **Lǎozǐ**’s **Línshì** lineage had a tradition, as did the **Fù**, **Xú**, and **Liú Xiàng** schools. The **Fù** school had **37 chapters**, the **Lín** school **4**, the **Xú** school **6**, and **Liú Xiàng** **4**. Alas, their texts have long been lost.\n\nThe *Lǎozǐ Dàodéjīng* transmitted today is sometimes combined into **two volumes** (upper and lower), or divided into **81 chapters**, or **72 chapters**. **Héshànggōng** partitioned it into **81 chapters**: the upper text follows **celestial patterns** (as heaven’s numbers are odd), hence **37 chapters**; the lower text follows **earthly patterns** (as earth’s numbers are even), hence **44 chapters**. **Yán Zhēn** instead arranged it by **eight yin principles** and **nine yang principles**, aligning them as **eight following nine**, resulting in **72 chapters**—**40 in the upper**, **32 in the lower**—completely diverging from Héshànggōng’s version. Since their foundations differ, their interpretations also vary, and none can be verified.\n\n**Hán Huán Tán** remarked: *\"In antiquity, Lǎozǐ composed **two chapters on emptiness and nothingness**; later admirers elevated them above the **Five Classics**. From the reigns of Emperor Wén and Jīng of the Hàn to **Sīmǎ Qiān**, all spoke of this.\"* *(As recorded in *Yáng Xiǔ’s Transmission*.)*\n\n**Ruǎn Jié** wrote *Tōng Lǎo Lùn*, stating: *\"The Dao follows spontaneity and transforms through it. If a sovereign upholds it, all things will transform naturally. The *Yì* calls it the **Tàijí**, the *Chūnqiū* calls it **yuán**, and Lǎozǐ calls it the **Dao**.\"* *(As recorded in the *Tàipíng Yùlǎn*.)*\n\n**Wáng Bì** annotated the *Dàodéjīng*, doubting that the chapters *\"佳兵\"* (*\"Fine Arms\"*) and *\"民之饥\"* (*\"The People’s Hunger\"*) were authored by Lǎozǐ.\n\n**Hé Yán**, while annotating *Lǎozǐ*, did not finish. Upon seeing **Wáng Bì’s** self-explanation of his annotations, Hé Yán, though impressed, could not continue and only nodded in assent. Thus, he abandoned the annotation and instead composed the *Dàodé Lùn*. Another account states that **Hé Píngzhū** completed his annotation of *Lǎozǐ* and presented it to **Wáng Fǔsì**. Seeing Wáng’s profound and ingenious work, Hé Yán exclaimed in awe: *\"Such a man can truly discuss the interplay of **Heaven and humanity**!\"* He then repurposed his own annotations into the *Dàodé* **Two Treatises**.\n\n*The Record of Literary Styles* states: *\"Confucian scholars argue that Lǎozǐ was not a sage, abandoning ritual and learning. **Píngzhū**’s interpretation aligns him with the sages, and his treatise spread widely.\"* *(As recorded in the *Shìshuó* and its annotations.)*\n\n**Ruǎn Zhān**, son of **Ruǎn Jié**, met **Sītú Wáng Róng**, who asked: *\"The sages value **ritual and instruction**; Lǎozǐ and Zhūangzǐ emphasize **spontaneity**. Do their meanings converge or diverge?\"* Zhān replied: *\"Perhaps they are the same.\"* Wáng Róng sighed deeply for a long while before inviting him, and the incident was later called the **\"Three-Sentence Connection\"** *(sānyǔyuán)*.\n\n**Lù Yuánlǎng**, courtesy name **Dé Míng**, served as a **Tàixué** scholar-official. During the **sacrificial rites** under Emperor **Gāozǔ**, after **Xú Wényuǎn** lectured on the *Xiào Jīng* and **Biànshēn Huìchéng** on the *Bōrě Jīng*, **Dàoshi Liù Jìnxǐ** lectured on *Lǎozǐ*. Dé Míng challenged all three, each adhering to their doctrines and establishing their positions. The crowd was subdued. The Emperor rejoiced: *\"Though the three are skilled in debate, Dé Míng’s single rebuttal silenced them all—truly an accomplished scholar!\"* *(As recorded in the *New and Old Tang Books·Confucian Scholars*.)*\n\nAt the start of **Kāiyuán**, the Emperor ordered **Zhōngshū Lìng Zhāng Yuè** to recommend scholars proficient in the *Yì*, *Lǎozǐ*, and *Zhūangzǐ*. **Jìxián Zhíxuéshì Hóu Xíngguǒ** recommended **Kuàijī Kāng Zǐyuán** of **Kuàijī** and **Píngyáng Jìng Huìzhēn** to Zhāng Yuè, who submitted them. Both were granted **sìdú** (attendance in lectures) and soon also served as **Jìxián Shìjiàng Xuéshì** (lecturers at the Hall of Accumulated Worth). Initially, **Xíngguǒ**, **Huìzhēn**, and **Chánglè Fēng Zhāoyǐn** lectured together. Zhāoyǐn excelled in expounding the **hidden meanings of Lǎozǐ and Zhūangzǐ**, while Huìzhēn was also skilled in *Lǎozǐ*. Before each lecture, he would **purify himself with incense and water** before reading. *(As recorded in the *New Tang Book·Confucian Scholars*.)*\n\n**Zhāng Xuānmíng**, in his youth, studied Confucianism in **Hénuò**. Later, he became a Daoist, mastering the teachings of **Lǎozǐ and Zhūangzǔ**. The **Jìn Gāozǔ** summoned him and asked whether Daoist methods could govern a nation. He replied: *\"The Dao is the subtle principle of all things, expressed in words. Those who grasp its utmost can govern the realm even while seated at home.\"* The Emperor admired his words, invited him into the **inner palace**, and lectured with him on the *Dàodéjīng*. He was then appointed as his teacher and granted the title **Tōng Xuān Xiānsheng** (Master of Penetrating Mystery), though his later fate is unknown. *(As recorded in the *Wǔdài Shǐ·Yīxíng Transmission*.)*\n\nEmperor **Tàizōng** heard that officials in the **Biànshuǐ** region were secretly selling state grain for private profit. He told his attendants: *\"The imperial gate is like a rat’s hole—how can one block it entirely? Only by removing the most corrupt can it be managed.\"*\n\n「The boatmen and ferrymen, if they engage in private trade, should only be prevented from harming public affairs—no need to investigate them further. As for the officials of **Suì** (Suì County), the key is that their supplies reach the granaries without excessive loss or damage.\n\n**Lǚ Móngzhèng** remarked: *\"Water too clear has no fish; people too scrutinizing have no followers. The deceit of lesser men—how could the virtuous not know it? If the ruler embraces broad tolerance, then all matters will be resolved harmoniously.\"* **Cáo Shēn** (Cáo Shēn) did not disturb the markets and prisons, for he accepted both good and evil in equal measure. If one presses too hard, the wicked and corrupt will find no refuge—so be cautious not to provoke them. The Emperor’s words were perfectly aligned with the **Dao of the Yellow Emperor and Lǎozǐ** (Yellow and Old).\n\n*(As recorded in the *Guócháo Shìshì*.)*\n\n**Liáo Zhāi** (Chen Zhongsu), known as **Chén Guàn**, once compiled twenty-plus chapters of writings titled *Zhāoyǔ* (Revealed Words). In its preface, he briefly stated: *\"The **Yùqīng Zhāoyīng Palace** (Palace of Jade Purity’s Responsive Manifestation) sent the official **Wáng Zēng** to request the verification of Daoist scriptures from the **Sānguān** (Three Offices). The Emperor then spoke of how his works were not as refined and concise as Lǎozǐ’s Five Thousand Words. **Zhāng Zhībái** (Zhang Zhongbai) said: *\"Your Majesty’s focus on this is the art of governance through non-action. I have studied the divine teachings of our ancestors, which state: The **Wén** and **Jìng** of the **Hàn**, and the **Tàizōng** of the **Táng**, are what Confucius called ‘those without whom I have no doubt.’ I have examined the deeds of these three rulers and found that the **Hàn Wén**’s methods were derived from Lǎozǐ, while his virtuous and filial policies resembled those of the **Hàn Wén**. Now I excerpt their teachings in ten-odd chapters, recorded hereafter.\"*\n\nAt the beginning of **Hàn Wén**’s reign, he first rewarded **Píng Bó** (Píng Bó) and later ennobled **Sòng Chāng** (Song Chang), prioritizing those who benefited the state over those who served his personal interests. This was the principle of *\"putting others before oneself\"*—thus, none could surpass him in the realm. As Lǎozǐ said: *\"Put others before oneself, and one’s self will come first.\"*\n\nEvery morning, **Hàn Wén** would halt his carriage to receive petitions from the **Láng Cóng** (Láng Cóng) officials. Even if their words were not immediately useful, he would still praise them, and if they were useful, he would adopt them. He praised all suggestions, whether good or not—this was the principle of *\"the virtuous accept all as virtuous, the non-virtuous they also accept as virtuous,\"* and thus his **virtue/power** was universally benevolent.\n\nWhen **Hàn Wén** first ascended the throne, he appointed a **shèifū** (treasurer) who argued endlessly without restraint, promoting him to the **Shànglín Lìng** (Superintendent of Shànglín). **Shì Zhī** (Shì Zhī) protested: *\"**Zhōu Bó** (Zhou Bo) and **Zhāng Xiàngrú** (Zhang Xiangru), whom Your Majesty honors as ‘longzhe’ (noble elders), never spoke so boldly when offering counsel. Would you truly emulate this **shèifū** (treasurer) with his relentless chatter and quick wit, rather than men of true substance? Moreover, the **Qín** (Qin) dynasty entrusted authority to scribes and clerks, who competed in swiftness and severity of judgment. Their flaws were mere empty formalities without real benefit, and when their errors were not heard, the state declined into ruin. Now you elevate this **shèifū** (treasurer) for his mere eloquence, and I fear the world will follow this trend, valuing only glib tongues while neglecting true merit. The influence of the lower ranks upon the higher is swift as an echo—every appointment must be weighed carefully.\"* The Emperor agreed and did not promote the **shèifū** (treasurer). He understood that those skilled in debate were often not truly virtuous, but merely proficient in words.\n\nLǎozǐ said: *\"The wise do not speak; those who speak are not wise.\"* He also said: *\"The virtuous do not debate; those who debate are not virtuous.\"* And again: *\"Much speech leads to exhaustion; better to hold to the center.\"*\n\nThe Emperor decreed: *\"There is a **fěidàng** (slanderous) tree at court, established to allow officials to voice their concerns. Now the law punishes slander and false accusations—this silences the ministers and prevents the ruler from hearing faults. Let this punishment be abolished.\"* Thus, **Jiǎ Yì** (Jia Yi) could submit petitions even to the point of invoking ancestral temples and posthumous titles, and **Hàn Wén** would still accept and praise them. This was truly *\"without taboos\"*—and the people prospered as a result. As Lǎozǐ said: *\"The more taboos a land has, the poorer it becomes.\"*\n\nWhen **Hàn Wén** (Emperor Wén) honored **Yù Tǎ** (Yu Ta), whose ancestral tomb was in **Zhèndìng** (Zhèndìng), he appointed a guardian and commanded regular sacrifices. He summoned **Yù Tǎ**’s brothers, bestowed high offices and lavish gifts upon them to show favor, and **Yù Tǎ** then issued orders across the realm, instructing all to change their names in accordance with the decree and forbidding them to call themselves *\"dì\"* (Emperor). This was the principle of *\"strengthening to weaken, giving to take\"*—the choice lies with the ruler alone.\n\nWhen the **Wú Wáng** (King of Wu) feigned illness to avoid attending court, the Emperor gave him a cane and chair, and **Zhāng Wǔ** (Zhang Wu) and others, having accepted bribes, further increased their rewards to shame him into compliance. This too was drawn from the same principle.\n\nLǎozǐ said: *\"To gather, one must first disperse; to weaken, one must first strengthen. To abolish, one must first establish; to take away, one must first give.\"*\n\nThe **Emperor Wéndì** withdrew his anger upon seeing **Yuàn Àn** seat **Shèn Fūren**, turning his displeasure into joy, and lavished **Yuàn Àn** with rich rewards—truly one who conquers himself without boasting of it. This is how virtue shines and the realm grows strong.\n\nLǎozǐ said: *\"Not boasting, thus it shines.\"* And again: *\"The self-conquered expand.\"*\n\nWhen the **Emperor Wéndì** accepted **Jiā Yù’s** sharp and cutting words, he governed his ministers with restraint, never dishonoring the great officials. Thus, the palace steps grew ever higher and the foundations ever firmer. The *Yì* says: *\"To honor the lowly over the noble is to greatly win the people.\"* How different is this?\n\nLǎozǐ said: *\"The noble takes the lowly as root; the high takes the low as foundation.\"*\n\nI have often said that since the Three Dynasties, no ruler governed the world as well as the **Emperor Xiàowén**, yet his methods came from Lǎozǐ. Thus, the **Emperor Rénzǔ** revered the **Lǎozǐ** tradition for its simplicity and profundity. Examining it through the **Han Wén** model, I find no gap between them.\n\nThough **Lǎozǐ** differed from **Kǒngzǐ**, their essence was the same. Though **Hàn** was inferior to **Zhōu**, its virtues were still worthy of adoption—this is why the two sages left enduring lessons.\n\nIn the fourth year of **Rénzǔ’s** reign, he told his ministers: *\"Since I ascended the throne, I have appointed many **Cānzhī Zhìzhèng** (Chancellors and Deputy Chancellors). Among them, only **Cài Qí, Lǔ Zōngdào, and Xuē Kuí** were truly loyal and worthy of record. The Chancellors **Wáng Zēng** and **Zhāng Zhībái**, though occasionally making minor mistakes, never committed grave faults. **Lǐ Dí** was also upright and steadfast, though his words were often spoken too lightly.\"*\n\n**Páng Jiè** replied: *\"Great talent has always been rare.\"*\n\nThe Emperor said: *\"I remember their great virtues, not their small failings.\"*\n\nReflecting on these words, I examined why **Wáng Zēng** and **Zhāng Zhībái** were held in such high regard by **Rénzǔ**—it was because they aided the **Wuwei** (non-action) governance with the **Qīngjìng** (tranquil and serene) method. This, perhaps, was what was truly memorable.\n\nWhen the **Shěnxíng Yuàn** (Criminal Investigation Bureau) resolved all pending cases, **Rénzǔ** rejoiced: *\"Though the realm is vast, the cases are settled thus—this shows how simple litigation is and how officials no longer delay.\"* He then issued an edict praising the judges and entrusted the matter to the **Shǐguān** (historiographical officials).\n\nI observed that during the **Yuánfēng** era, the **Kāifēng Fǔ** prison was empty, and the late **Shénkǎo** (Emperor Shenzong) greatly rejoiced, promoting **Wáng Ānlǐ**—the Prefect of **Kāifēng**—to **Yòuchéng** (Right Chancellor). Even the lowly clerks received rewards. From then on, officials across the empire took an empty prison as a cause for celebration.\n\nThe **Emperor Rénzǔ** rewarded judges for simple litigation, while the **Emperor Shénkǎo** promoted officials for empty prisons—both demonstrated the same intent of benevolent governance toward the people.\n\nLǎozǐ said: *\"The people do not ordinarily fear death. How can you terrify them with death? If you make the people constantly fear death, then those who act strangely, I can seize and kill—who would dare?\"* The ancestors did not use penal threats to frighten the people; they understood **Lǎozǐ’s** teachings well.\n\nWhile lecturing on the *Shījīng*, upon reaching *\"Fěifēng\"* (The Zephyr), the Emperor said: *\"Lǎozǐ spoke of governing a great state as if boiling a small fish—its meaning aligns with this.\"*\n\n**Shìdú Dīng Dù** replied: *\"Boiling fish too much makes it break apart; governing the people too much scatters them. Without profound wisdom, how could one grasp the ancients’ intent for governance?\"*\n\nI said: *\"In times when the sage-rulers had great undertakings—whether founding a dynasty or reforming corruption—some busyness was unavoidable. The **Emperor Rénzǔ**, however, upheld the **Qīngjìng-Wúwéi** (tranquil and non-action) Dao, remaining consistent for forty-two years. He truly embodied the principle of boiling fish gently and practiced it himself.\"*\n\nThus, I say that **Emperor Wén’s** methods came from **Lǎozǐ**, and **Emperor Rénzǔ’s** governance resembled **Emperor Wén’s** in many ways. When the **Emperor Shénkǎo** said that **Emperor Wén** was without flaw, his intention to follow and continue was clear.\n\n**Hán Rào** reported: *\"Lín Xiànkě sent his son with a letter to me, criticizing many faults of the officials inside and outside the court. I dared not withhold it from Your Majesty.\"*\n\nThe Emperor said: *\"I do not wish to suppress it, but I fear it would open the path for slander. You may take it home and burn it.\"*\n\nI said: *\"Lǎozǐ said: ‘While the common people are bright and clear, I alone seem confused. While the common people are sharp and discerning, I alone am muddled.’ And again: ‘When governance is muddled, the people are pure. When governance is sharp, the people are depleted.’ **Hán Rào**, by reporting **Lín Xiànkě’s** words, presented both black and white—how bright and clear it is! The **Emperor Rénzǔ**, fearing to open the path of slander, rejected it. The sage’s foresight was profound and far-reaching.*\n\n*\"To be muddled and unseen, to be obscured and unrecognized—this is how the sage becomes sage, and why the people remain pure.\"*\n\nWhen **Sīmǎ Guāng**, the **Tōngpàn** (Deputy Governor) of **Bìngzhōu**, submitted a memorial requesting the selection of a successor from the royal clan to serve as heir-apparent, I said: *\"Since the mid-Tang, rulers disliked hearing discussions of establishing an heir, fearing it an omen of misfortune. Thus, scholars across the land dared not speak frankly about the foundation of the state’s security. **Sīmǎ Guāng**, though a distant official, spoke openly without concealment. The **Emperor Rénzǔ**, in his later years, received this advice without evasion. Lǎozǐ said: ‘To receive the Mandate of Heaven is not auspicious—this is how one becomes the King of the World.’ The **Emperor Rénzǔ** possessed this virtue. And again: ‘Faithful words are not beautiful.’ **Sīmǎ Guāng** embodied this too.\"*\n\n**Chén Zhōngsù Gōng** said: *\"Lǎozǐ spoke of the Mandate of Heaven as something divine that should not be seized, for those who seize it ruin it. He also said governing a great state is like boiling a small fish—yet the one who boils fish does nothing but regulate the fire and water to cook it properly. **Shùn** governed without action—was this not his meaning?\"*\n\n*\"The **Emperor Wǔdì** abandoned **Huánglǎo** (Yellow Emperor-Laozi teachings) and adopted Confucianism, yet never strayed from benevolence and righteousness. Observing his actual results, however, he differed little from **Qín Shǐhuáng**. At that time, the realm was never without turmoil, and though people longed to emulate **Wén** and **Jǐng**, they could not. Thus, what fault did **Huánglǎo** truly have toward the world?\"*\n\n*\"**Cú Guǎng** told his son **Shòu**: ‘Knowing contentment brings no disgrace; knowing when to stop brings no peril. When one’s official career is complete and reputation established, yet one does not depart, fearing future regret, then father and son may follow each other in feigning illness and returning home. The people of their time praised them, and later generations have sung their praises. Yet their intent to ‘know when to stop’ came from **Lǎozǐ’s** teachings.\"*\n\nThe *Daoist* texts are also found in *Liáo Zhāi Jí*.\n\nOuyang Xiu, the Duke of Wenzhong, remarked:\n*\"The succession of before and after, the contrast of length and shortness—when extended broadly, this is the principle of all things. Yet Laozi’s writings, though seemingly void, are supremely profound in governing the people.\"*\n\nHe further said:\n*\"The Daoist school originates from purity and emptiness, discarding ambition and desire, maintaining a tranquil self-guard. Thus it says: ‘If I do nothing, the people transform themselves; if I love stillness, the people align themselves.’ Even the Sage’s governance from the throne cannot surpass this. Also found in his own collection.\"*\n\nSu Shi, the Duke of Yibin, said:\n*\"Upon receiving my nephew Mai’s compilation of my father’s handwritten works, one entry read: ‘Yesterday, Ziyou sent *Laozi’s New Interpretation*. I read it without finishing, then set it aside and sighed: If this book had existed in the Warring States, Confucius and Laozi would have been one. If it had existed in the Jin and Song dynasties, Buddhism and Daoism would not have been two.’ I never expected, in my old age, to encounter such a marvelous work—only then did I realize this book must have been intended for Zizhan.\"* (From the *Postscript to the Explanation of the Dao De Jing*.)\n\nHe further said:\n*\"Confucius governed the world with *rén* (benevolence), *yì* (righteousness), *lǐ* (ritual), and *yuè* (music), while Laozi rejected and abandoned them. Some may think they differ, but the *Yijing* says: ‘That which is above form is called the Dao; that which is below form is called *qi* (instrumentality).’ Confucius, foresighted for posterity, demonstrated *qi* to the people while concealing the Dao, so that mediocre individuals would cling to *qi* without being dazzled by the Dao, thus not losing their way as *junzi* (noble ones), while the superior would naturally ascend. Laozi, however, aimed to illuminate the Dao and urgently open the minds of people, thus emphasizing the Dao while neglecting *qi*, believing that if scholars only knew *qi*, the Dao would remain hidden. Therefore, he rejected benevolence and righteousness, abandoned ritual and music, to illuminate the Dao. These two Sages acted out of necessity—uniting in one meant neglecting the other.\"* (From the *Commentary on the Classic*.)\n\nHe further said:\n*\"Han Fei expounded Laozi’s teachings and used legalist rhetoric to persuade the feudal lords, while Li Si studied Xunzi and served Qin with deceit and force, culminating in the burning of books and the slaughter of Confucian scholars. Yet both met great calamity in the end. Their learning originated from the Sages, but their actions were what even common villagers would refuse to do. Could their learning truly have led them to this? Laozi and Xunzi’s teachings, though flawed, did not descend into chaos. Then why did these two men stray so far? A slight deviation in study—even a hair’s breadth—can lead to a thousand *li* of error.\"* (From *Lèchéng Jí*.)\n\nLü Dongshan, Master Tao, said:\n*\"Since Qin, the study of *xìngmìng* (nature and fate) has been neglected, and the division of *Dao* and *dé* (virtue/power) has long endured. Scholars, alas, are misled by one-sided, narrow interpretations, drowning daily in the vulgarity of commentaries, losing their innate nature and fate, unaware of the vast purity of Heaven and Earth or the grand framework of antiquity. I deeply lament this, believing that *Dao* and *dé* are what Guan Yin sincerely questioned and Laozi sincerely spoke of—containing profound and subtle truths that can awaken scholars from their ignorance, restoring their innate nature and fate. Unfortunately, obscured by vulgar commentaries for over a thousand years, their meaning remains dim. Thus, I composed this commentary to illuminate what was lost. Still, many Sages have existed in obscurity, and Laozi’s writings on *Dao* and *dé* were not unique—briefly expressed in Laozi, elaborated in *Liezi*, and further detailed in *Zhuangzi*. Therefore, my interpretations of *Liezi* and *Zhuangzi*, when combined, may not stray from the essence of *Dao* and *dé*.\"* (From the *Commentary on the Classic*.)\n\nLuó Cóngyán, Master of Yanping, said:\n*\"Laozi’s book was neither praised nor criticized by Confucius, for praising it would have led later scholars to indulge in his ‘harmonizing with the dust’ teachings, descending into licentiousness, while criticizing it would have dismissed ‘tranquility as the foundation of governance’—which could not be condemned. Since neither praise nor criticism was given, he could not remain silent, thus merely saying: ‘I compare him to my old friend Peng.’\"* (From *Luó Shī’s Yùlù*.)\n\nWhen asked, Yang Shoujing, the Duke of Guishan, replied:\n*\"Some say ‘Lao Peng’ refers to Laozi and Peng Zu, not Peng’s longevity, but rather ‘the aged Peng.’ But did Laozi truly record without creating, believing and loving antiquity?\"*\nHe answered: *\"Laozi took *zìrán* (naturalness) as his foundation, so calling it ‘uncreated’ is acceptable.\"* (From *Guishan Jí*.)\n\nGuishan further said:\n*\"Only when all selfishness is removed can one respond to the world. Laozi said: ‘The public becomes the king.’\"* (From *Yùlù*.)\n\nLü Xizhe of Rongyang once inscribed on the wall before him: *\"In governing people and serving Heaven, nothing surpasses frugality.\"* He said: *\"Scholars of cultivation consider this the essential method for nurturing life, but frugality in all matters—always maintaining surplus—is the way to preserve oneself, one’s family, and the state.\"* (From *Kǒuguó Shì Zálù*.)\n\nWang Zishun, Saintly Beauty, said:\n*\"Zhuangzi could not fathom Liezi, and Liezi could not fathom Laozi.\"*\n\nThe Duke of Rongyang replied:\n*\"If Zhuangzi could not fathom Liezi, who could? If Liezi could not fathom Laozi, who could? Thus, none surpassed Zhuangzi in understanding Liezi, and none surpassed Liezi in understanding Laozi.\"* (From *Lǚ Shì’s Shīyǒu Zázhì*.)\n\nSima Guang wrote to Wang Anshi:\n*\"In the past, I followed you in your studies. You read all the books, yet particularly favored the words of Mencius and Laozi. Now that you hold power and implement your Dao, you should prioritize what you admire—you would not prioritize what you do not.\"*\n\nMencius said:\n*\"Ren and righteousness are enough—why must one speak of profit?\"*\nHe also said:\n*\"To be a parent to the people, yet make them toil endlessly throughout the year without means to support their own parents, then lend them money at interest—how can this be called being a parent to the people?\"*\n\nNow, Wang Anshi’s governance begins with establishing the *Chizhi Tiaoli* Bureau, expounding on matters of wealth and profit. He then commands Xue Xiang to implement the *Junyun* tax system in Jiang-Huai, seeking to seize all the merchants’ gains. He dispatches envoys to distribute *qingmiao* loans nationwide, collecting their interest—causing people to grieve, separating fathers from sons, and brothers from wives and children. Is this truly Mencius’ intent?\n\nLaozi said:\n*\"The sacred treasure of the world cannot be acted upon—those who act upon it ruin it; those who grasp it lose it.\"* He also said:\n*\"If I do nothing, the people transform themselves; if I love stillness, the people align themselves; if I undertake no tasks, the people grow wealthy; if I have no desires, the people return to simplicity.\"* And again:\n*\"To govern a great state is like poaching a small fish.\"*\n\nYet Wang Anshi’s governance overturns all ancestral laws—reversing what was first and last, high and low, right and left, and destroying what was already accomplished. He toils tirelessly from dawn to dusk, laboring into the night without rest, leaving no one—from the court to the fields—able to follow old customs or maintain stability. All is in chaos, and none find peace. Is this truly Laozi’s intent?\n\nSima Guang, who styled himself *Youshou* (\"the Detoured Old Man\"), once wrote in his *Youshu* (\"Book of Detours\"):\n*\"Someone asked if my* Old and Recluse *chapter had any meaning. I replied: It does.*\n*‘What meaning?’ they asked.*\n*‘The* Recluse *takes its emptiness; Laozi takes its effortless spontaneity.’*\n*He also wrote: ‘Those who study the Yellow Emperor and Laozi claim to be like dead ashes and withered wood to achieve* wuwei*—but I disagree. In my* Wuwei Zan *(‘Ode to Effortless Action’), one cultivates the heart with rectitude, preserves the body with stillness, advances and retreats with propriety, accepts gain and loss as fate, guards the Dao within oneself, and lets success arise from Heaven. What more is there to do? All is already natural.’\"*\n\nFrom Sima Guang’s *Chuanjia Ji* (\"Transmitted Family Collection\").\n\nLi Deyu, Duke Wei, in his memorial urging Emperor Jingzong to search for Daoist masters, said:\n*\"I have heard that the highest Dao belongs to Guangchengzi and Xuanyuan, while the most sagely among men are Xuanyuan and Confucius. In ancient times, Xuanyuan asked Guangchengzi about the essentials of nurturing life. Guangchengzi replied:\n‘See nothing, hear nothing, embrace the spirit in stillness—then the body will align itself, the spirit will purify itself. Do not weary your form, do not scatter your essence—only then can you attain longevity.’*\n*He also said:\n‘Those who grasp my Dao rule as emperor above or king below.’*\n*Xuanyuan spoke to Confucius:\n‘Abandon your arrogance and excessive desires, your frivolous demeanor and licentious thoughts—for these bring no benefit to your body. The five mouths of your senses warn you of this. Thus, Xuanyuan sighed with the heavens’ lament, and Confucius awoke with the awe of a dragon. The ancient sages’ attainment of the Dao was not so profound?’*\n*If Guangchengzi and Xuanyuan were to appear before you today and speak of the Dao, I dare say nothing surpasses their words.\"*\n\nFrom *Li Wenrao Ji* (\"Collected Works of Li Wenrao\").\n\nBai Xingjian, Master of Xiangshan, said:\n*\"To cultivate simplicity and frugality in the people, and harmony in the times, nothing surpasses embodying the Dao of the Yellow Emperor and Laozi. Their way lies in valuing moderation and simplicity, avoiding dazzling the ears and eyes, and not exhausting the mind and abilities.*\n*Those who wield it skillfully—whether in a single town, prefecture, state, or the world—can achieve the principle of tranquility.*\n*In the past, Mi Jian attained it, so single-handedly transformed Renhua’s governance without leaving his hall. Jin Pi attained it, so accomplished East Sea’s administration without stepping outside his gate. Cao Shen attained it, so markets and lawsuits were undisturbed, and Qi became serene. Emperor Wen of Han attained it, so punishments were unused, and the world found harmony. The reason is simple: tranquility brings order.\"*\n\nFrom Bai’s *Changqing Ji* (\"Collected Works of the Long Regency\").\n\nSu Shi, Master of Dongpo, in response to imperial command, inscribed the *Shangqing Chuxiang* Palace stele:\n*\"I have examined the Daoist tradition, which originates with the Yellow Emperor and Laozi. Its essence is tranquility and effortless action; its practice is clarity and responsiveness; its conduct is compassion and frugality without contention. This aligns with the* Yi Jing’s *‘no thought, no worry’* and the* Analects’* teaching that ‘the virtuous are still and long-lived.’*\n*Since the Qin and Han, Daoists have adopted alchemists’ claims, introducing techniques of flying ascension and transformation—Yellow Court, Great Cavern methods, the* Taishang Tianzhen Mugong Jinmu *elixirs, and worship of the Celestial Sovereign, Taiyi, Ziming, and Beiji. Even minor talismans and spells fall under Daoist practice.*\n*I have reflected: the Dao of the Yellow Emperor and Laozi is the root; the alchemists’ words are the branches.*\n\n*In his* Gaigong Tang Ji *('Record of Gaigong Hall'), he also wrote:\n‘When Cao Shen served as Chancellor of Qi, he heard that Gaigong of Jiaxi excelled in Yellow-Lao teachings. He sent envoys to invite him, and under his guidance, Qi flourished. Later, Cao Shen applied these principles to govern the empire, and to this day, the world praises his virtue.\n*As Jiaxi’s magistrate, I sought his descendants and tomb but found none. Moved, I emulated his words and imagined his character. Cao Shen, a pillar of the Han dynasty, took Gaigong as his teacher—what greater honor could there be? Yet history records nothing of Gaigong’s end. Was he not an ancient sage who attained the Dao and did not die?’\"*\n\nFrom his own *Ji* (\"Collected Works\").\n\nTang Geng of Meishan’s *Zixi* remarks:\n\n*\"The world doubts that Laozi’s western journey was motivated by compassion, frugality, or avoiding premature death. If one upholds the Dao in the world, where cannot they dwell? Yet still there are departures and arrivals—this is utterly mistaken. Only because the Dao is without a place it cannot enter does it traverse even the most barbaric lands. This is why it is the Dao of Laozi.\"*\n\nFrom *Meishan Ji*.\n\nZhang Youshi’s *Laozi Yi* states:\n\n*\"When people are born, those not killed by illness in bed or by thieves, executions, or punishments already exceed half. Thus, people do not truly fear death. Yet those who govern others wish to make them fear death, relying only on threats of it—how deluded! Therefore it is said: ‘If the people do not fear death, how can you terrify them with death?’ If they truly feared death, then I would seize and kill those who act strangely, and surely none would dare. The issue is not that there are no killers, but that all things, dim and indistinct, inevitably return to annihilation. Thus, there are always those who kill. If one takes the natural order of killing and applies it to instilling fear, it is not only insufficient to terrify others but also fails to reach its mark. Therefore it is said: ‘There are always those who kill. If one replaces those who kill, it is like having a substitute carpenter—few will avoid harming their hands.’ Thus, to wield the power of life and death, driving an age’s people to follow, is surely wrong.*\n\n*Again, it is said: Only because it is without private gain can it fulfill its private purpose, and only when private gain is sought does the world reject it. Only the public can grasp the true nature of the world, and the world will follow. If the world follows, how can one fail to obtain what they desire?*\n\n*In his preface for the *Sequence for Master Zhang of Gushu*, he wrote: The most gentle teaching instructed me on the subtleties of nurturing nature. He said: ‘The Great Dao is most simple—merely preserve the heart. Preserving the heart is nothing else but preserving the One. When the One is perfectly still, the Mysterious flows freely in all directions. True qi responds to it—this cannot be measured by thought or exhausted by speech; only those who attain it know it. When true qi descends, all ailments vanish, and longevity follows. Laozi said: *Empty the heart, fill the belly, weaken the will, strengthen the bones*—when the heart is empty and the will weak, the belly naturally fills, and the bones naturally strengthen. This Dao: the wise attain it and call it *stopping and observing*; Sima Ziqian attained it and called it *sitting in forgetfulness*—both are the same Dao. These are the essentials for the True Person in cultivating the self, yet today’s people neglect them, instead tormenting their bodies, indulging in vain transformations, swallowing elixirs of metal and stone—how distant they are from the Dao!’*\n\nFrom *his Ji*.\n\nWang Wuqiu once expounded on four chapters of the *Laozi Dao Jing*. Here are two:\n\n*\"The Sage acts in non-action, teaches without speech. Those without intent to act or speak merely follow the natural patterns of all things’ life and death. Thus, when all things arise, I too arise without refusal; when all things are born, I too am born without possession; when all things act, I too act without reliance; when all things are completed, I too complete without taking credit. For their arising, their birth, their action, and their completion are all in accordance with the natural patterns of life and death, following things and times without being ‘I.’ Then why must I refuse, why must I possess, why must I rely, why must I take credit? Therefore it is said: ‘All things arise together, yet I do not refuse; they are born, yet I do not possess; they act, yet I do not rely; their deeds are complete, yet I do not take credit. Arise, then be born; be born, then act; act, then complete—this is their order.’*\n\n*Again, it says: Why does Laozi particularly detest excessive speech? What Laozi clarifies is the Dao, which is always without speech. Yet when speech is unavoidable, it is permitted. Because it is unavoidable, speech is allowed; because it is always without speech, those who speak much are farthest from the Dao, and those who speak little are closer. Thus, he particularly detests excessive speech.\"*\n\nFrom *his Ji*.\n\nQin Guan of Huaihai remarked:\n\n*\"Ban Gu praised Sima Qian for his judgments being somewhat contrary to the Sage’s intent, saying that in discussing the Great Dao, he prioritized Yellow-Lao over the Six Classics. Who would have thought that Qian, with his vast talent and erudition, would reach such a conclusion? In my view, this is incorrect—he truly had insight and expressed it. Mencius said: ‘The benevolent is humanity; combined, it is the Dao.’ Yang Zhu also said: ‘The Dao guides them, virtue obtains them, benevolence enters them, righteousness harmonizes them, ritual embodies them—this is Heaven.’ Combined, they are unified; separated, they scatter. Thus, morality and virtue are the complete embodiment of benevolence, righteousness, and ritual, while benevolence, righteousness, and ritual are but one aspect of morality and virtue. Yellow-Lao learning values unity and despises separation, so it takes the Dao as the foundation, while the teachings of the Six Classics are brief on unity and detailed on separation. Thus, it uses benevolence, righteousness, and ritual as applications. When Qian discussed the Great Dao, he prioritized Yellow-Lao over the Six Classics—could this not be his insight expressed?\"*\n\n*Again, it says: \"History records that Cui Hao compared himself to Zhang Liang, claiming his study of antiquity surpassed him. In my view, Hao did not even reach the level of Xun and Jia—how dare he aspire to Zi Fang? For he refined himself through cultivation, and with his remaining energy, governed the world. Having achieved his purpose, he withdrew to preserve himself—this is the lineage of the Daoist school.\"*\n\nObserving celestial phenomena and discerning seasonal changes to aid human affairs—clear in its applications yet ignorant of their roots—this is the lineage of the **Yin-Yang** school.\n\nZhang Liang first wandered to **Xiaona**, receiving scriptures from the **Old Man of the Bridge**, and ultimately wished to abandon worldly affairs to follow **Chi Song**—thus, his methods clearly stem from the **Daoist** school.\n\nCui Hao excelled in the study of **divination and numerology**, his accounts of **Yinghuo’s** entry into Qin, the comet’s extinction of Jin, and matters such as the hare emerging from the rear palace, along with Yao Xing’s offering of a daughter, were most extraordinary. Yet when he dismissed the **Zhuang-Lao** teachings as fabricated, his methods were clearly rooted in **Yin-Yang** alone—this is why they differ.\n\n(All as recorded in the *Huaihai Collection*.)\n\n**Tian Xian** wrote in his preface to the *Precious Wood Inscription*:\n*\"The dragon’s rise begins with wood; the ruler’s ascent begins with the people.\"* Yet there are also **saints without rank** and **virtuous recluses**, blending fame with obscurity, and talent with humility. A man of **Li Ming’s** caliber was Confucius’ **Precious Wood**—thus able to expound the *Spring and Autumn Annals* to establish enduring teachings. **Yin Xi’s** virtue was Laozi’s **Precious Wood**—thus able to inquire into **Dao and virtue** to benefit posterity.\n\n(As seen in the *Xianping Collection*.)\n\n**Fan Zhongwen**, Duke of **Zhen**, remarked:\n*\"Laozi’s two treatises discuss the primordial **Dao** before **Yin-Yang** coalesced—concise in words yet complete in meaning.\"*\n\n(Recorded in the *Shu Gong Collection*.)\n\n**Chao Wenyuan**, Duke **Jiong**, said:\n*\"Many eminent figures, past and present, cherished the books of Laozi and Zhuangzi, for within their **non-action and non-affairs** lies the utmost beauty and joy.\"*\n\nHe further stated:\n*\"Laozi said: ‘Five colors blind the eyes; five tones deafen the ears; five flavors dull the palate.’ Though even sages may overcorrect, their intent is deeply benevolent. If one does not indulge the pleasures of the ears and eyes nor the delights of the mouth and stomach, one need not seek attainment—only avoid loss.\"*\n\n(All as seen in the *Zhaode Xinbian*.)\n\nHe also noted:\n*\"Laozi said: ‘Knowing the constant is clarity.’ Worldly folk see only day and night as constant, yet remain unchanged. Those beyond the world regard life and death as day and night, knowing that life and death are constant while nature remains unchanged. Thus, the mind is clear and serene, viewing life and death without distress.\"*\n\n(Recorded in the *Maozhi Yushu*.)\n\n**Li Tai** of **Xujing** quoted **Han Yu** as saying:\n*\"The Daoists claim, ‘Confucius was my teacher’s disciple,’ and the Buddhists say, ‘Confucius was my teacher’s disciple.’ Those who follow Confucius hear these claims, delight in their absurdity, and mock them, saying, ‘My teacher also said such things.’ I cannot fully grasp the Buddhist teachings, but the *Zengzi Wen* and *Laozi Liezhuan* mention matters of ritual—history cannot be fully trusted, and the *Records of Ritual* are not without fabrication.\"*\n\n(As seen in the *Tuiju Leicao*.)\n\n**Jiao Sayu**, a recluse of **Songshan**, remarked:\n*\"After Fu Xi, King Wen, and the Duke of Zhou expounded the *Yijing*, only Laozi mastered its flexible transformations—knowing softness yet valuing emptiness, striving to respond yet unable to grasp it. His earnest words are fortunate to have been preserved.\"*\n\nHe further said:\n*\"Wang Bi’s commentary on Laozi’s *Daode Jing* truly captures Laozi’s teachings—akin to **Yan Junping’s** *Zhigui* in its precision. His claim that **benevolence, righteousness, and ritual** cannot stand alone but require the **Dao** to function is not merely beneficial to Laozi—it is essential knowledge for the nine hundred scholars.\"*\n\nHe also noted:\n*\"Wang Bi understood that ‘fine weapons are ill-omened,’ yet his interpretation of ‘treating victory with funeral rites’ was not Laozi’s own but rather **Riverbank Master’s**—the ancient text lacked this, thanks to **Fu Yi’s** discernment for its correction.\"*\n\n(As recorded in his own collection.)\n\n**Li Zhaoquan** stated:\n*\"The books of **Ghost Valley** and **Han Fei** trace back to **Dao and virtue**, yet their timing aligns with **mystical profundity**. How could these two truly comprehend Laozi? Their words merely hit the mark.\"*\n\n(As seen in the *Luan Jing’s Collection*.)\n\n**Bi Zhongban**, of **Xitai**, remarked:\n*\"Laozi said: ‘Lose the **Dao**, then **virtue**; lose **virtue**, then **benevolence**; lose **benevolence**, then **ritual**—ritual is the **Dao’s** adornment yet the source of chaos.’ To call ritual the **Dao’s** adornment and the origin of chaos is beyond my understanding. Yet ritual is indeed secondary to **benevolence and righteousness**, and inferior to **Dao and virtue**. Later generations, unable to govern with ritual alone, entrusted it to **law**—which is again secondary to ritual, and inferior to **benevolence and righteousness.**\"*\n\n(As recorded in his own collection.)\n\n**Su Xu** of **Meishan**, grandson of **Wendefeng**, recorded his grandfather’s last words:\n*\"The Master lectured me on several chapters of Laozi, saying: ‘He surpasses Mencius by two or three levels.’*\n*He also said: ‘No text surpasses the Five Thousand Words in speaking of the **Great Dao**.’*\n*In his old age, the Master composed poetry:\n‘I have preserved eighty-one chapters of commentary,\nA disciple of Laozi’s **Old Plum** school.\nAs age deepens, my craft grows refined—\nThe ordinary cannot fathom it.’\"*\n\n(As recorded in his last words.)\n\n---\n**Miscellaneous Commentaries on the *Collected Annotations of the Dao-De Jing***\n*Compiled by Song’s Peng Zhi of **Huelin**.*\n\n**Miscellaneous Commentaries on the *Collected Annotations of the Dao-De Jing***\n*Compiled by Song’s Peng Zhi of **Huelin**.*\n\n---\n\nDuring the **Qianfeng** era of the **Tang High宗** (Emperor Gaozong), in the second month of the first year (on the day *jiwu*), the Emperor visited **Laozi’s Temple** in **Bozhou** and posthumously bestowed upon him the title **太上玄元皇帝** (Supreme Primordial Sovereign Emperor).\n\nDuring the **Tianbao** era of the **Tang Xuanzong** (Emperor Xuanzong), in the first month of the second year (on the day *jingchen*), the Emperor posthumously honored **Laozi** as **大圣祖** (Great Holy Ancestor), and **Laozi’s father**, **Zhou Shang Gongshi** (Grand Marshal of Zhou), as **先天太上皇** (Primordial Supreme Emperor). His mother, **Ben Shou Shi**, was honored as **先天太后** (Primordial Empress Dowager).\n\nIn the tenth month of the **fourteenth year of Tianbao**, the Emperor issued imperial commentaries on *Laozi* (*Laozi’s Text*) as well as the *Yishu* (Explanatory Commentary) across the land.\n\nAdditionally, during the **Tianbao** era, the Emperor added the title **《玄通道德经》** (Mysterious and Penetrating Dao-De Jing) to *Laozi*, though this title was not widely adopted. (As recorded in the *New Book of Tang · Arts and Literature Register*.)\n\nIn the **sixth year of Da Zhong Xiangfu**, during the eighth month (on the day *gengwu*), an imperial decree added **Laozi’s title** as **太上老君混元上德皇帝** (Supreme Primordial Lord of the Dao, the Ultimate Emperor of Highest Virtue). The following spring, in the first month (on the day *renyin*), the Emperor departed **Eastern Capital (Dongjing)**, and on the third month (on the day *bingwu*), arrived at **Zhenyuan County**. On the fifth month (on the day *wushen*), he ordered the Chancellor **Wang Dan** to present the imperial seal and title, and on the sixth month (on the day *jiyou*), he paid homage at **Ta Qing Palace**. (As recorded in the *Nine Dynasties’ Temple Regulations*.)\n\nIn the **second year of Jingde**, the **National University’s** (Guozijian) **Senior Lecturer Sun Xi** stated:\n*\"Among the books of the various schools, Laozi and Zhuangzi are ranked first. Their teachings emphasize the clarity and emptiness of the Dao, advocating humility and weakness to preserve oneself, and effortless ease to sustain oneself. Their methods of nurturing life and benefiting all things are all the arts of the sage ruling from the south.\"* (As recorded in the *Comprehensive Records of the Current Dynasty*.)\n\nThus, earlier scholars placed *Laozi*’s text secondary to the **classics**, and **Lu Deming** of the Tang compiled *The Exegesis of the Classic Texts* in thirty volumes, including *Laozi’s Exegesis* in three volumes. Today, the exegeses of all classics and *Laozi’s Exegesis* total twenty-seven volumes, all of which have been engraved and distributed. Only *Zhuangzi’s Exegesis* remains missing in three volumes. Sun Xi proposed following the example of the *Dao-De Jing*, dispatching officials to verify and engrave it for distribution, and the decree approved this. (As recorded in the *Comprehensive Records of the Current Dynasty*.)\n\nIn the **third year of Tianxi**, when celestial scriptures descended, **Sun Xi**, who served as **Jizhou Prefect** in **Qianyoushan**, submitted a memorial stating:\n*\"The lowly **Zhu Neng** falsely claims divine omens and portents. In the past, the **Tang Minghuang** (Emperor Xuanzong) obtained the *Lingbao Shangqing Huguo Jing* (Scripture of the Sacred Treasure of the Numinous Treasure and High Clarity) and the *Baojuan* (Treasure Scroll), all fabricated by **Wang Jue** and **Tian Tongxiu** and others.\nThe **Dao** of **Laozi**, the Sage, descending in words, should naturally be without falsehood. Yet since the **An-Lu Rebellion** of the Tang, both capitals were destroyed and overthrown—how could the realm be in perfect harmony? The **Minghuang** barely managed to return to the palace before being again abducted by the **Fuguo Rebellion**, ultimately dying from exhaustion. **Laozi’s** sacred longevity is boundless; how could he have failed to achieve eternal life and lasting vision?\nSince the **Minghuang** was misled by leftist doctrines, his governance became disordered, the people’s hearts turned away, and calamities arose suddenly. I pray that Your Majesty may take heed of the **Minghuang’s** summoning of disaster, so that misfortune may not arise and turmoil may not occur.\"* (As recorded in the *Nine Dynasties’ Temple Regulations*.)\n\nDuring the **revolt of Fang La** in **Zheyou**, whose cries shook the capital, the **Chancellor’s Office Attendant Cheng Zhen** told **Chancellor Wang Pi**:\n*\"It would be appropriate to seize this moment to discuss the ills of the realm, so that some reforms might be made and the people’s hearts might be pacified.\"* **Wang Pi** was displeased. At the time, **Cheng Zhen** also served as **Attendant to the Prince**, and when he reached **Shu Palace** to see the **Prince**, he said:\n*\"When **Zhou Gong** (Duke of Zhou) composed the poem *‘Jiangliu’* (Owl), **Confucius** praised it as profound wisdom. Its words merely speak of awaiting the heavens’ rain and harmonizing the eaves and doors. **Laozi** also said, ‘Act before things arise; govern before chaos ensues.’ Truly, **Laozi** and **Confucius** share this principle. Now, if we do not establish the roots of governance in times of tranquility, but merely vie for immediate results, this is not the intent of the two Sages.\"* (As recorded in the *Nine Dynasties’ Temple Regulations* and *Biographies of Eastern Capital* in his own transmission.)\n\nIn the **sixth year of Zhenghe**, **Li Gang**, then **Assistant Censor in the Ministry of Justice**, petitioned the Emperor in a memorial requesting clarification on the *Yijing* (Classic of Changes), stating in part:\n*\"I humbly observe that Your Majesty’s celestial wisdom and brilliance are unparalleled, and that You are aided by the study of **Jixi** (Refined Brightness) and **Guangming** (Enlightened Clarity). You embody the **primordial** and master the **mysterious**, encompassing the full scope of symbols and numbers. Even in the midst of Your countless affairs of state, You instruct and elucidate the books of **Laozi** and **Zhuangzi**, awakening scholars across the land with eloquent and profound words. These words reveal what cannot be spoken and illuminate the radiant principles of **Dao**, **virtue**, and **life-force**.\nThe *Yijing* speaks of neither thought nor action—it is still and unmoving, yet responsive, thus communicating the patterns of the world. Truly, it complements the books of **Laozi** and **Zhuangzi** in its ultimate expression.\nI pray that Your Majesty may reflect deeply within Your heart and compose commentaries to unfold the **divine virtue** and reveal the **profound essence** of the cosmos.\n\nAdditionally, he inscribed a poem on **Li Bo Shi’s** (Li Gonglin) painting of *Laozi’s Departure from the Pass*, which reads:\n‘I ask of the **Gate of All Wonders**—how does it remain constant?\nAt that time, **Guan Yin** (Laozi’s disciple) was so diligent in his purpose.\nThe **Green Ox** departs westward toward the desert sands,\nWhile **Purple Qi** arrives eastward, its auspicious mists revealed.\nThe **mysterious art** does not stray from the **Thirty-Six Strategies**,\nThe **ultimate words** are all contained in the **Five Thousand Characters**.\nThe world fails to grasp the **Root of Benevolence and Simplicity**,\nOnly seeking eternal life by following the **White Clouds**.’\n\n(As recorded in the *Liangxi Collection*.)\n\n**Master Cheng Yi** of **I Chuan** (Program Precept) said:\n*\"The teachings of the Daoists have no further flaws to criticize, but the sayings of the **Buddhist School** have proliferated into such deep confusion and delusion that they cannot be refuted.\"*\n\nAgain, he said:\n*\"The words of **Zhuangzi** in describing the **Dao** have much merit, and the chapter *‘Gu shen bu si’* (Nurturing the Spirit and Not Letting It Die) is the finest.\"*\n\n(As recorded in **Master Cheng’s** posthumous writings.)\n\n**Hu An Guo**, the **Minister of War**, said:\n*\"The **Five Thousand Words** of **Laozi**, such as his sayings ‘I have no affairs,’ ‘I love tranquility,’ and ‘I possess the Three Treasures,’ are all profound truths.\"*\n\n(As recorded in the *Language Records*.)\n\nThe **inscription of Xicang’s** (She Yi’s) **Shou Shou Pavilion** states:\n*\"The **Ren** (benevolence) that **Confucius** spoke of brings longevity, and the **‘not dying though dead’** longevity that **Laozi** spoke of, as well as the **‘boundless longevity’** of the **Buddhist School**—though the words of the three Sages differ, their meanings are the same.\nThe **Ren** exhausts one’s **nature** (xing), and exhausting one’s **nature** means one does not perish though dead. If one does not perish though dead, how could one’s longevity be measured?\nThose who merely see the hair, nails, and teeth returning to the earth, the saliva and tears merging with water, the warmth of **qi** returning to fire, and movement transforming into wind, assume that the person has truly died. Yet they fail to recognize that the **Dao** remains ever-present and never truly dies.\"*\n\nThe *Dixian* [玉诀类] continues:\n\nFrom *Xitang Ji* [溪堂集], **Zhou Zhonggong of Daoxiang** [道乡邹忠公浩] says:\nThe **Mysterious Female Gate** [玄牝之门], drawn from our own person, is the **nose** [鼻]. The nose is the passage through which **qi** [息] enters and exits. If it flows continuously as if ever-present, and one does not strain it, then the breath becomes profound—such was **Sun Shu’ao’s** [孙叔敖] nose, ever vibrant.\n\nThe *Zhuangzi* [《庄子》] states:\nThe **True Person’s** [真人] breath reaches to the heels,\nWhile the common man’s breath stops at the throat.\nThose who bend and submit speak with a rasping voice,\nAnd those who hoard desires have shallow **innate vitality** [天机].\n\nThe *Suwen* [《素问》] says:\nWithout **inhalation and exhalation**, there would be no growth, maturation, aging, or death.\nWithout **ascension and descent**, there would be no growth, transformation, contraction, or storage.\nAscension and descent, inhalation and exhalation—\nNo vessel lacks these four, yet their **virtue** [德] lies in steadfastly guarding them.\nOnly when one knows this does one understand how the **Spirit of the Valley** [谷神] does not die.\n\nIt further says:\nEmpty your mind, and your **abdomen** [腹] will naturally fill.\nWeaken your will, and your bones will naturally strengthen.\n\nAll as seen in *Daoxiang Ji* [《道乡集》].\n\n**Master Kangjie Shao Yong** [康节先生邵雍] says:\nThe **Three Sovereigns** [三皇] share the same **Dao** but differ in transformation.\nThe **Five Emperors** [五帝] speak the same words but differ in teachings.\nThe **Three Kings** [三王] share the same symbols but differ in governance.\nThe **Five Hegemons** [五伯] share the same numbers but differ in methods.\n\nTo share the same **Dao** yet differ in transformation—\nThis must be done through the **Way** [道].\nThose who govern through the **Way** will have the people return to the **Way**,\nThus valuing **spontaneity** [自然].\n**Spontaneity** means **non-action** [无为] and **non-possession** [无有].\n**Non-action** is not inaction, but not clinging to action—\nThus it can be expansive.\n**Non-possession** is not lack, but not clinging to possession—\nThus it can be vast.\nWhen **broad and great**, fully present yet not fixed in possession—\nWho but the **Three Sovereigns** could embody this?\n\nThus, those who know how to govern the world through the **Way**\nWill see the world return to the **Way**.\nHence the saying:\n*\"I do not act, yet the people transform themselves.\nI do not interfere, yet the people grow rich.\nI love stillness, yet the people align themselves.\nI have no desires, yet the people return to simplicity.\nIs this not the case?\"*\nAs seen in *Guanyu Pian* [《观物篇》] of his own collection.\n\n**Shao Bowen** [邵伯温] says:\nMaster Kangjie believed **Laozi** understood the **substance** [体] of the *Yijing*,\nAnd **Mencius** understood its **application** [用].\nIn his commentary on *Wen Zhongzi*, he praised **Buddha** as a **sage of the Western Land** [西方之圣人],\nAnd this was not excessive.\nAs seen in *Shao Shi Wenjian Lu* [《邵氏闻见录》].\n\n**Su Dongpo’s** inscription on the **Shangqing Palace** [上清宫] stele reads:\nThe **Daoist tradition** [道家者流] originates with **Huangdi and Laozi** [黄帝老子].\nIts **Way** centers on **clarity, stillness, and non-action** [清静无为].\nIts **application** lies in **emptiness and luminosity** [虚明应物].\nIts **conduct** is **compassion and frugality, non-contention** [慈俭不争].\nThis aligns with the *Zhouyi* [《周易》]: *\"No thinking, no worrying\"* [何思何虑],\nAnd the *Analects* [《论语》]: *\"The virtuous attain longevity through stillness\"* [仁者静寿].\nSuch is all.\n\n**Xie Xiandao** [谢显道] personally witnessed **Programming Yichuan** [程伊川] reciting these lines,\nAnd deemed them the most profound discussion of **Ren** [仁] in antiquity.\nAs recorded in **Zhao Bo’s** *Wenjian Hou Lu* [《闻见后录_] and **Xie’s** *Yulu* [《语录》].\n\n**Zheng Xia of Xitang** [西塘郑侠] says:\nI have heard **Laozi** say:\n*\"Knowing contentment brings no disgrace,\nKnowing limits brings no peril.\"*\nThe *Yijing* [《易》] states:\n*\"Excess (亢) is to know advancement yet not retreat,\nTo know preservation yet not annihilation,\nTo know gain yet not loss—\nOnly the **Sage** knows advancement, retreat, preservation, annihilation, gain, and loss\nWithout losing their proper alignment.\"*\n\nYet how difficult it is to know retreat, annihilation, contentment, and limits,\nWhile the **Sage** repeatedly extols them with deep reverence!\n\nHe says:\nAll these are **one**.\nAdvancement and retreat follow the **Way**—\nThen advancement is not arduous, and retreat is not difficult.\nPreservation and annihilation follow the **Way**—\nThen preservation brings no joy, and annihilation brings no sorrow.\nAdvancement, retreat, preservation, and annihilation all return to the **Way**,\nStopping when it is time to stop, moving when it is time to move—\nWho could say they are not in harmony?\n\nHe further says:\nThe **Superior Person** hears the **Way** and diligently practices it.\nThe **Middle Person** hears the **Way** and clings to it uncertainly.\nThe **Lesser Person** hears the **Way** and laughs at it—\nIf they do not laugh, it is not the **Way**.\n\nHe says:\nOnly the **Way** is great,\nThus it seems unworthy.\nIf it were long deemed worthy, it would be trifling indeed.\n**Worthiness** arises from nurturing what is small—\nFor the common nurture only the small,\nThus the great is deemed unworthy.\nYet to seek the **Way**,\nOne must embrace what the common deem unworthy,\nFor what the common do not deem unworthy—\nThese are not worthy of discussing the **Way**.\n\nHe says:\nThe **Way** is great while things are small.\nMen toil endlessly yet perish in the small—\nThey are burdened by things.\n**Primordiality** [元] is the ultimate extension of goodness,\nReaching the greatest magnitude.\nWhen it reaches greatness yet remains unknown as such,\nIt aligns with the **Way** yet does not resemble the world.\nThus the world calls my **Way** great yet unworthy,\nFor while others scrutinize and compete,\nI alone am serene, deeming the world unworthy of my concern.\nIt is fitting that I do not resemble them,\nThus I can achieve greatness.\nGreat yet possessing it—\nI surpass the world by an inch.\nThus I am deemed unworthy.\nOnly when the **Lesser Person** laughs at this\nDo I approach understanding.\nFor if the **Way** were deemed worthy, it would not be the **Way**.\n\nHe says:\n**Laozi** said:\n*\"Water benefits all things yet does not contend.\nIt dwells where others abhor it,\nThus it nears the **Way**.\"*\nYet when water stagnates and rots,\nBecoming foul and impure—\nUnfit even for washing one’s feet—\nThis is self-inflicted, nearing the **abhorrent**.\nThose who seek to restore their **original nature** [复性]\nShould take this as a mirror:\nKnow that clarity and luminosity come from **innate nature** [自我性],\nWhile turbidity and chaos arise from **what is acquired** [自我之有].\nAbandoning the murky and confused,\nClarity and luminosity manifest within—\nThen, rising with the waves and sinking with the mud,\nNone can resist my transformation.\nBecause none can resist my transformation,\nThey will repose in purity and clarity,\nYet none will know my power.\n\nHe says again:\n\nWater’s nature is clear, yet it emerges from the earth,\nand the earth muddies it—thus its turbidity.\nBut if one lets it settle, it becomes clear enough\nto mirror hair and threads.\n\nHuman insight is bright, yet it arises from things,\nand things confuse it—thus its chaos.\nBut if one lets it clarify, it can illuminate sun and moon.\n\nOnce clear, if muddied, it becomes turbid;\nbut if left to settle, it returns to its original clarity.\nOnce bright, if confused, it becomes chaotic;\nbut if left to clarify, it returns to brightness.\n\nThus, what is turbid and chaotic is always imposed from without,\nwhile what is clear and bright arises from within.\n\nThe *Classical Texts* say:\n*\"Heaven and Earth unite to descend sweet dew—\nno one commands it, yet it is evenly distributed.\"*\n\nThough rain and dew are subtle in Heaven and Earth,\nthey are yet so evenly distributed—\nhow much more so for the luminous and intelligent mind of humankind!\n\nHe says again:\nBefore the Three Dynasties, there were no teachings of Confucius, Mencius, Laozi, or the Buddha.\nYet when one encountered an emperor, one became an emperor;\nwhen one encountered a king, one became a king.\nBut from the decline of the Zhou onward,\nonly the teachings of the Three Masters [孔孟老] and the Buddha arose—\ntruly, they were concerned with the world’s delusion\nand sought to guide it toward salvation.\n\nHe once wrote in his *Preface to the Great Celebration Hermit*:\n*\"The Hermit was originally weak in learning,\ntaking Confucius as his master,\nand found Laozi’s teachings to clarify it.\nAll of this is recorded in the *Xitang Collection*.\"*\n\nYue Mengde said:\n*\"The *Book of Documents* ends with Yao and Shun,\nyet the *Yijing* extends back to Fuxi, Shennong, and the Yellow Emperor—\nthus we know that there were indeed figures before Yao,\nthough the Six Classics remain silent on them.\"*\n\nIf one examines this with the mind,\nthe *Yijing* says:\n*\"The Dao has no thought, no action—\nsilent and unmoving, yet responding,\nit naturally permeates all under Heaven.\nWho but the most divine of sages could attain this?\"*\n\nThus, from Fuxi, Shennong, and the Yellow Emperor down to Yao and Shun,\nwhat was transmitted through the ages\nwas never outside the *Yijing*.\n\nReflecting further on Laozi’s teachings,\none finds little that differs from the *Yijing*.\n\nHe says again:\n*\"The *Analects* records that Confucius compared himself to Laozi and Pengzu.\nAfter Confucius came Mencius,\nand though Mencius’ Confucianism never faltered by so much as a hair,\nhis rejection of Yang Zhu and Mozi,\nand his opposition to ritualistic Qin,\nexceeded even Jie and Zhou—\nyet he never reached Laozi’s depth.\nBut when it came to ‘exhausting the heart to know nature,\nand extending to fate,’\nthis was where Laozi’s focus lay.\"*\n\nThus, Laozi’s teachings were never neglected by Confucius and Mencius.\n\nHe says again:\n*\"Where Laozi’s words differ from Confucius’,\nthey are corrective for the age;\nwhere they align, they accord with the *Yijing*.\"*\n\nHundreds of years after Laozi, the Buddha emerged,\nhis language ever more profound and distant from ordinary speech,\nyet in its ultimate truth, it nearly mirrors Laozi’s teachings—\nas seen in the commentaries.\n\nHe says again:\n*\"Laozi speaks of *qi* and desire—\nconcentrating *qi* to achieve softness like an infant.\nMencius speaks of *qi* as vast and mighty,\ndirectly nurtured without harm,\nfilling Heaven and Earth.\nThese two seem contradictory.\nIf one follows Laozi, Mencius is abandoned;\nif one follows Mencius, Laozi is abandoned.\nYet in my view, the two are not truly opposed:\nwhen human *qi* is dispersed, it clashes with things and becomes rigid;\nwhen concentrated, it turns inward and becomes soft.\n\nRigidity cannot overcome rigidity—\nwhat overcomes rigidity must be soft.\nThus, concentrating *qi* is the means to achieve uprightness.\n\nUpright nurturing without harm to the outside\nis not to ‘hold fast to one’s will,\nnor to vent one’s *qi’*—\nit is like Zengzi’s moderation:\nwhen moderation accumulates to its extreme,\nit returns to subtlety—\nthus upright nurturing is the means to achieve softness.\nTherefore, the highest understanding of the Dao is fundamentally undivided.\"*\n\nThis is found in *Shilin Yanxia Fangyan*.\n\nThe Northern Song scholar Cheng Yi commented on Laozi:\n*\"The Dao that can be spoken of can guide conduct;\nthe name that can be named can establish discourse.\nBut the unspoken constant Dao,\nthe unnamed constant Name—\neven sages dare not reveal these to others.\nIt is not that they conceal them in secrecy,\nbut that they cannot be revealed at all.\n\nThus, the sages of the West\nset forth three vehicles of teaching,\ntwelve divisions of exposition,\nand called it *doctrine*.\nWhat was transmitted beyond doctrine\nwas the unspoken and unnamed.\n\nThe sages of China\ntook the Three Sovereigns and Five Emperors as their ancestors,\nestablished the rites of the Xia and Shang,\nand codified poetry, history, rites, and music—\ncalling it the *Classics*.\nYet what they spoke of\nwas like the path beneath the footprints—\nthe unspoken and unnamed.\n\nThus, Laozi composed the Five Thousand Words\nto show the world and guide posterity,\nnot retreating into obscurity for his own sake.\nHence, his opening words speak of the Dao that can be spoken of,\nthe Name that can be named—\nall contained within the Five Thousand Words.\nBut what the thousand sages did not transmit\ncannot be spoken of.\"*\n\nHe says again:\n*\"Heaven, Earth, and humanity share a single origin.\nWhat makes Heaven Heaven, Earth Earth,\nand humanity human\nis fundamentally the same—\nyet Heaven and Earth endure long,\nwhile humanity does not. Why?\n\nHeaven does not know it is Heaven;\nEarth does not know it is Earth.\nYet once a person receives their form,\nthey claim it as ‘I’—\n‘human, human,’ they say—\nand because they believe life cannot be sustained without things,\nthey indulge in futile pursuits.\nBecause they believe their body cannot be cherished enough,\nthey toil over superficial concerns,\nthickening life while hastening their ruin,\nnurturing the body while ailing it—\nthat they do not perish early is fortunate indeed.\n\nThis is Laozi’s intent,\nyet those who do not ponder it\nmistake the Yellow-Lao school for fearing death\nand seeking immortality—\nhow mistaken they are!\"*\n\nIf a person has no life,\nwhere would the Dao find its vessel?\n\nYet those who lose their life in the world\nmerely take their very life as a burden—\nthose who possess life are still deeply warned by Laozi,\nyet they claim to seek longevity outside the Dao?\nThey have not pondered this.\n\nAgain it is said:\nAmong all transformations of things,\nnone surpasses death and life.\nFor one who follows the Dao,\ntranscending the bounds of life,\nthere is nothing else to attend to.\n\nDoes life truly come?\nDoes death truly go?\nIf life is truly coming,\nthen whence did I arise?\nSouth or north?\nEast or west?\nAbove or below?\nIt cannot be spoken of with certainty—\nyet to call it \"truly coming,\" is that possible?\n\nIf death is truly departing,\nthen whither do I go?\nMind?\nThings?\nHumanity?\nHeaven?\nIt cannot be spoken of with certainty—\nyet to call it \"truly departing,\" is that possible?\n\nThus, my life—\nbefore, I do not know its origin;\nafter, I do not know its end.\nPiercing through eternity, ever-present,\nit is serene and boundless.\n\nOnly then do I clearly know:\nI have never truly lived,\nnor have I ever truly died.\nThen what could be called the realm of death?\n\nAgain it is said:\nThe faults of the common folk are easy to dismiss,\nbut the flaws of the sages are hard to remove.\nPursuing desires harms nature,\nchoosing and rejecting unsettle the mind—\nthese are the errors of the common folk.\nTheir faults are great and visible,\nso they are easy to dismiss.\n\nTo take enlightenment as an obstacle,\nto see liberation as bondage—\nthese are the flaws of the sages.\nSubtle and hard to discern,\nso they are hard to remove.\n\nWhen faults are overt and principles are subtle,\nto see material ailments is clear,\nbut to see doctrinal afflictions is obscure.\nThen, if principles obstruct and doctrines ail,\nhow can one exhaust their flaws?\n\nTo purify and remove the fundamental vision—\nthis is what is meant.\n\nThe fundamental vision is what the sage calls\n\"the singular perception.\"\nIf a person possesses this profound insight\nyet fails to remove it,\nthat is bondage in liberation.\n\nTo purify and remove the fundamental vision,\nyet to still hold onto the notion of purification—\nthis is enlightenment as an obstacle.\n\nAgain it is said:\nThe sage does not harm the people by nature,\nyet can also make ghosts and spirits not harm humanity—\nhow so?\n\nFor the person in the Dao,\nthe Dao in the person,\nis like fish in water,\nwater in the fish—\nwhat need is there for distinctions of life and death?\n\nWhen the sage governs the world with the Dao,\nthe people’s lives are tranquil,\nthus their living is well-nurtured.\nTheir deaths are serene,\nthus their dying is well-nurtured.\nSerene and complete,\nhow could ghosts dare to be spectral or malevolent?\n\nLife is as it is,\ndeath is as it is—\nthen where is there still room for spirits to haunt or torment?\n\nOnly through constant virtue\ncan one save all without abandoning any,\nsave all things without abandoning any.\nVirtue through action—\ncould it achieve such?\nOnly through non-accumulation\ncan one give to others while possessing more,\nshare with others while having abundance.\nThe application of fixed forms—\ncould it achieve such?\n\nExtending this Dao to benefit the world\nand deliver all beings,\nwhat need is there for distinctions of Confucianism, Buddhism, or Daoism?\n\nAlso seen in *The Northern Mountain Collection*.\nGongzhuo Deng Su said:\nI have examined the origins of Daoist teachings—\ntheir source lies with the Yellow Emperor,\ntheir flourishing with Laozi,\nbut their later branches grew strange and terrifying.\nThere were thirty-seven sects,\nand nine hundred ninety-three texts.\n\nAll who ruled the world\nmust uphold this Dao.\nAmong its most extreme adherents were three emperors:\nQin’s First Emperor, Han’s Wu Emperor, and Tang’s Ming Emperor.\nThese three emperors\npossessed talents surpassing others,\ncontemptuous of their age,\nyet even the vastness of the six directions\ncould not satisfy their desires.\nThus, they harbored grand ambitions—\nrefining elixirs, flying talismans,\nmixing with heterodox arts,\nbelieving their methods could rival Heaven and Earth.\nYet in the end, their flying techniques\ncould not succeed,\nand they brought ruin upon their own realms—\ntruly lamentable.\n\nStill, when the Han High Emperor took the world,\nZhang Liang was his greatest aide,\nand when he ruled,\nhe entrusted governance to Cao Shen—\nthe finest choice.\nZhang Liang’s Dao emulated the Red Pine Immortal,\nwhile Cao Shen, in his residence,\navoided the main hall to dwell in the guest quarters—\nthus, the arts of Daoism\nwere not without benefit for the world.\n\nThe Han High Emperor’s reliance on Shen and Liang\nstemmed from the Dao’s foundation—\nnothing more than clarity, tranquility, reverence, frugality, and non-action,\nresting alongside the people.\n\nBut the First Emperor, Wu Emperor, and Ming Emperor\npursued only the superficial,\nexhausting their efforts on trivial ends,\nso delusions and falsehoods prevailed,\nallowing their schemes to take root.\nThis is how governance and chaos,\nvirtue and folly,\ndiffer so utterly,\nbeyond comparison.\n\nWhen later branches spread wildly,\nstrange and monstrous phenomena emerged,\ncapable of misleading rulers\nand bringing ruin to the world—\nthese were not the Dao of the Yellow Emperor or Laozi.\n\nFrom *The Gongzhuo Collection*.\nYan Gushan Jiang Kuo said:\nThe Dao is elusive and hard to speak of.\nWhat is called \"Dao\"\nis merely a name given to what is not truly the Dao.\n\nThe Five Classics speak of it briefly,\nwhile Laozi, Lie Yukou, and Zhuang Zhou speak of it in detail.\nThough their approaches differ—\none concise, one elaborate—\nboth illuminate the essence of the Dao.\n*On Inquiry into the Dao.*\n\nAgain it is said:\nSomeone asked: When Laozi wrote his book,\nwas it composed at the time or compiled later?\nI replied: This cannot be known.\n\nIn my youth, at a collector’s library,\nI saw an ancient-text *Laozi*.\nIts words were largely the same as today’s,\nbut with minor differences.\nExamining their meaning revealed unity,\nyet the order differed from today’s chapters,\nso I suspected later scholars had dissected it.\n\nThe Dao encompasses all things,\nyet the Five Thousand Words record\nonly what can be spoken of as Dao.\n\nAgain, it departs and becomes **virtue**—yet this seems unlikely.\n\nI replied: **Dao** and **virtue** are fundamentally the same, though their names differ. Why should this be impossible?\n\nHe said: How can this be so?\n\nI have read the Five Classics and the Hundred Schools. Whenever they speak of **Dao** and **virtue**, they distinguish between greater and lesser, earlier and later—this cannot be generalized without examination.\n\nI replied: Zhuang Zhou spoke of the one-sided scholar who divided the beauty of Heaven and Earth, dissecting the principles of all things, all stemming from the non-unity of **Dao** and **virtue**. He lamented that later scholars were thus unfortunate.\n\nDo you also wish to follow this path?\n\nHe said: I wish to hear its meaning.\n\nI said: **Dao** is what is found everywhere without limit; **virtue** is what one attains from it. **Dao** is the path all share, while **virtue** is what each attains for themselves.\n\nLet me use water as an analogy: the vastness of lakes and seas differs from the water stored in a courtyard well, yet is it not still water? The torrent of rivers differs from the rush of ditches, yet is it not still water?\n\nWater is like **Dao**—omnipresent, yet lakes, seas, wells, rivers, and ditches each manifest it differently. To say they are fundamentally the same yet named differently is undeniable.\n\nFor the scholar of **Dao**, to grasp it with the mind, to perceive it with the spirit, to balance and fulfill it until self-sufficient—then **virtue** is complete, and one stands firm.\n\nTo advance in **virtue** until it encompasses **Dao** is to return to the beginning.\n\nThus, **Dao** is not excessive compared to **virtue**; **Dao** is dispersed while **virtue** shines forth. **Virtue** is not deficient compared to **Dao**; when **virtue** is complete, **Dao** becomes hidden. Hence, the sage embodies **Dao** fully and perfectly, while the virtuous person illuminates **Dao** and fulfills **virtue**—this is their distinction.\n\nHe said: **Dao** is subtle and formless; can **virtue** be seen?\n\nI said: **Dao** has no fixed shape, but **virtue** has completion and deficiency. What is complete and deficient is evident to the heart and mind—how could it not be seen?\n\nTo align with **Dao** is to have no **virtue** to name; to distinguish **virtue** is to have a name to discern. Thus it is said: **Dao** has no constant name, while **virtue** has a defined form.\n\nWhen Laozi emerged, **Dao** and its methods were shifting. His teachings all clarified the ultimate and appropriate end—though his words varied, like a head with a tail, examining their essence reveals no contradiction.\n\n*On Inquiry into Virtue.*\n\nAgain it is said:\nWhat arises in the heart is inexhaustible; thus what is bestowed upon the body is endless.\nDeath and rebirth, life and death—\nthe beginning and end are like an unending cycle.\n\nLaozi spoke of birth and death:\nthirteen aspects of life,\nthirteen aspects of death,\nthirteen movements leading to death—\nthree threes make nine.\nFrom the perspective of ten aspects,\nonly one escapes life and death.\n\nWhat is this one? Perhaps it is the person who returns to the **Dao**.\n\nThe scholar who aspires to **Dao** can cultivate the self in anticipation of it,\nstraightforward in extension,\nyielding in retreat—\nperhaps this is how one may speak of it.\n\n*On Inquiry into Fate.*\n\nAgain it is said:\nSomeone asked: Laozi, Lie Yukou, Zhuang Zhou, and Meng Ke all were ancient masters of **Dao**, yet their teachings sought to gain the trust of later generations. Why do they contradict each other so?\n\nLaozi said: *\"I have a great affliction—my very body.\"*\nLie Yukou said: *\"Inner observation brings trust in the self.\"*\nZhuang Zhou said: *\"My body is not mine.\"*\nMeng Ke said: *\"All things are complete within me; to reflect inwardly and be sincere—no greater joy exists.\"*\n\nSome reject the body as an affliction, others value its completeness—how could they not contradict?\n\nI replied: You have not thought deeply. You have grasped their words but not their intent.\n\nThe limbs, bones, organs, and viscera—all that constitutes the body—are called the *body*.\nSight, hearing, speech, expression, thought—these inherent faculties are also called the *body*.\nThough the name *body* is the same, what constitutes it differs.\n\nSome speak of the *body* as form, others as nature.\nLaozi and Zhuang Zhou likely spoke of the *body* as form,\nwhile Lie Yukou and Meng Ke likely spoke of it as nature.\n\nSpeaking of form, the limbs, bones, organs, and viscera—if they exist, they bring affliction; if they do not, there is no affliction. Thus, one must not allow them to exist.\nYet what is meant by \"nonexistent\" is not the annihilation of the body, but simply that movement, speech, and action are unseen.\n\nSpeaking of nature, sight, hearing, speech, expression, and thought—all encompassed by a single principle, all things are complete within. If one observes inwardly, it is sufficient.\nHigh as Heaven, low as Earth—looking up and down, all is discerned within. Who is not complete within me? Who lacks anything in the body?\n\nThus, Laozi and Zhuang Zhou’s view of the body demands its nonexistence,\nwhile Lie Yukou and Meng Ke’s view demands its observation.\n\n*On Inquiry into the Body.*\n\nAgain it is said:\nSomeone asked: What is *xi* (息)?\n\nI replied: It is the movement of yin and yang as left and right,\nthe ebb and flow of the child and parent,\nlike an unceasing wheel, an endless ring—\ninteracting with primordial *qi*, ceaseless day and night.\nThis is what Laozi and Lie Yukou called *chong qi* (the penetrating *qi*).\n\nIf you know how to guard *xi*, you know how to nurture *qi*.\nIf you know how to nurture *qi*, you know how to enter **Dao**.\nIf you know how to enter **Dao**, you embrace unity in meditation—\nthe result is the same.\n\nLaozi said:\n*\"Continuous as if it exists,\nyet used without exertion—\nreturn to it and seek it,\nand you will attain it.\"*\n\n*On Inquiry into Breath.*\n\nAgain it is said:\nZhuang Zhou spoke of those who cultivate the form—\nblowing and breathing like clay pots—\nbut this is merely their superficial practice.\n\nWhen form and spirit are both refined,\nit originates from inheriting the mother *qi*.\n\n「Laozi said:\n*\"The mysterious female gate,*\n*This is the root of heaven and earth.*\n*The Way of immortality,*\n*Originates from here.\"*\n\n*On Inquiry into Qi.*\n\nAgain it is said:\nConfucius said: *\"Do not cling to thoughts, do not cling to self.\"*\nLaozi said: *\"When you reach the state of no-self,*\n*What harm can come to you?\"*\nBodhidharma said: *\"Abandon eyes, ears, nose, tongue, body, and mind—*\n*If one possesses birth,*\n*They manifest as form and color externally,*\n*And know thoughts internally.*\n*Why must they be abandoned?\"*\n\nIndeed, the state of *wu* (無) is the convergence of all virtues,\nthe foundation of all dharma.\nIf a person can externally cease all distractions,\nand inwardly merge with *wu*,\nthen they will align with the **Dao**.\n\nIts essence is singular—\nlike what is called *zuòwàng* (坐忘),\nor *xīqì miànbì* (息气面壁),\nare these not divergent paths to the same end?\n\n**Yan Gu** (嚴谷), courtesy name **Zhongchang** (仲長),\nwas from Sanqu (三衢).\nHe styled himself *Yan Gu Shanren* (嚴谷山人),\nwhich was his self-chosen name.\n\nHe cultivated simplicity in his garden retreat,\nteaching students through scriptural learning.\nDuring the Shaoxing era (紹興間),\nhigh-ranking officials recommended him to the court.\nAfter being summoned for an audience, he declined with force\nand returned to his hometown.\nThe scholarly community held him in high regard.\n\nHis biography is also recorded in *The Collected Works of Yan Gu* (《嚴谷集》).*\n\nYang Wen’an Gong, during the Shaoxing era, served as a *zhuō* (橐) attendant at the imperial lectern and presented a treatise titled *\"On Presenting Commentaries on the Laozi.\"* He wrote:\n\n*\"The Laozi states: I possess three treasures. Cherish them and uphold them: the first is *cí* (慈, compassion), the second is *jiǎn* (俭, frugality), the third is *bù gǎn wéi tiānxià xiān* (不敢为天下先, not daring to lead the world).*\n\n*Compassion makes one courageous; frugality makes one abundant. Not daring to lead the world first allows one to become a vessel of virtue and longevity.*\n\n*I have heard that seeking the Dao through the reach of cleverness and intelligence only exhausts the mind, making the Dao ever more obscure. Abandoning cleverness and intelligence to seek it in daily life, however, is simple and direct—then the Dao may perhaps be glimpsed.*\n\n*To rely on cleverness and exhaust intelligence is the folly of those with shallow understanding. Using such means to respond to the world, there remains doubtless some lingering attachment or unresolved emotion. Thus, if one seeks compassion, they risk indulgence; if frugality, they risk meanness; if not daring to lead, they risk cowardice. This is why the mind labors, yet the Dao remains obscured—it is clear.*\n\n*But those who embody the Dao are otherwise. Their innate wisdom is effortlessly complete, as if born of Heaven. When things press upon them, there is no room for contrivance—they respond naturally as they encounter them. Without malice, they are compassionate; without desire, they are frugal; without contention, they do not dare lead the world first. Their daily conduct is simple yet perfectly aligned. This is not achieved by cleverness or intelligence alone—only the most sagely of rulers could attain it.*\n\n*The *Yijing*’s *Qian* (乾) hexagram says: ‘Embodying *rén* (仁, benevolence) suffices to nurture the people.’ The *Kun* (坤) hexagram says: ‘Though *Kun* is supremely yielding, its action is firm—thus, those who attain *rén* also possess courage.’ Hence, it is said: *‘Compassion makes one courageous.’*\n\n*The *Jié* (节) hexagram says: ‘Moderation through rites and institutions does not deplete resources nor harm the people.’ Thus, it aligns with the idea of *‘frugality making one abundant.’*\n\n*The *Qiān* (谦) hexagram says: ‘Humility brings radiance; lowliness is unassailable.’ This reflects the principle of *‘one who does not lead the world first attains virtue and longevity.’*\n\n*The teachings of the *Daodejing* and the *Yijing* resonate like matching seals. The Sage-Emperor does not fail to be an emperor; the Sage-King does not fail to be a king. Their boundless benevolence cherishes life, their martial virtue refrains from killing—is this not compassion? Their thatched huts and earthen steps, their coarse garments and humble attire—is this not frugality? Their lack of arrogance or self-praise, their avoidance of rivalry or scheming—is this not not daring to lead the world first?\n\n*Even down to the Han dynasty’s broad benevolence and magnanimity—like Emperor Gaozu, nearly compassionate in governing through virtue; Emperor Wen, nearly frugal in ruling with gentle principles; Emperor Guangwu, nearly not daring to lead—these rulers treasured compassion and courage, frugality and abundance, humility and longevity. Though they fell short of the Two Sovereigns and Three Kings, even the Han emperors could be emulated and praised.*\n\n*Furthermore, the Daoist tradition traces its origins far back—from the Yellow Emperor’s school, through Laozi in the Zhou, to Lie Yukou and Zhuangzi during the Warring States. By the Qin and Han, it became known as the Yellow-Lao learning. Its essence lies in *xūwú zìrán* (虚无自然, emptiness and spontaneity), its practice in *qīngjìng dànpō* (清静澹泊, clarity and tranquility). Its core is self-cultivation, its extensions extend to governing the world. Since ancient times, it has coexisted with the Dao of Yao, Shun, Zhou, and Confucius without contradiction.*\n\n*As for the *Fó Tú* (浮屠, Buddhist) school, it originated in the West and entered China only during the Han. When Huo Qubing defeated the Xiongnu, he captured a sacrificial golden figure from the *Xiutu* king. Yan Shigu noted that this was an early Buddhist statue. Emperor Ming dreamed of a golden figure descending from the sky, and Fu Yi identified it as a sage from the West. He dispatched envoys to *Tianzhu* (天竺, India) to investigate, and thus Buddhist teachings began to spread. Examining its origins, its foundations differ entirely from Daoist learning, and its paths diverge. Why not examine the *Daodejing*’s five thousand characters? Its language is subtle, its intent profound, its text simple yet rigorous, its meaning vast and authoritative—it nearly complements the Six Classics, unlike ice and charcoal or wedge and socket, which cannot intermingle. Later scholars casually lump them together as ‘Buddhist-Laoist’—how strange!*\n\n*This is also recorded in *The Yushishi Collection* (《芸室集》).*\n\n*During his time in the *Qián Dì* (潜邸, prince’s residence), Prince Guang (光庙) consulted Program Wenjian Gong Dachang, who served as a palace official. The prince sought his writings on *Yi-Lao Unified Speeches* (*Yi-Lao Tongyan*), and Dachang submitted them in the form of a *gēzi* (割子, scroll). Its essence reads:*\n\n*‘Why is Laozi so revered? He grasped the pivotal principles and governed the world through the Dao—this is his strength. Though he valued the *wu* (无, nonexistent) over the *yǒu* (有, existent) and rarely spoke of worldly affairs, this was not a flaw. Thus, the Han Emperor Wen, who followed Laozi, governed with a clear mind, few desires, and profound simplicity—his rule was not one of inaction. This is why the Han dynasty flourished with enduring stability: it grasped the essence and utilized his strengths.*\n\n*Yet by the Western Jin, though they heard Laozi’s words, they took *wuwei* (无为, non-action) as the principle of governance without understanding *how* to practice non-action. They believed that loosening laws, doing nothing, and passively waiting would suffice—until the state’s foundations collapsed and chaos ensued. Thus, Wang Tong remarked: ‘The Jin dynasty’s adherence to emptiness led to its ruin—this was not Laozi’s fault. They failed to grasp the core and misunderstood his strengths.’*\n\n*My humble hope is that Your Highness adopts the pivotal principles of Laozi and takes the Western Han as a model, learning from the Jin’s misguided inaction as a warning. Then, the refined words and profound Dao of Laozi will be fully realized in Your Highness’s governance.’*\n\nThe author further composed *The Hidden Scaffolding of Flourishing Virtue* (《潜藩盛德录_), within which one passage states:\n\n*\"In my past discussions with Your Highness, whenever the topic turned to the Great Dao, I would often cite passages from the* **Yijing·Xi** (*《易·系》*—the \"Appendices\" of the *Yijing*), pairing the* **Daoqi** (*道器*—the interplay of Dao and its manifestation) *with Confucius’ words on* **xiàxué shàngdá** (*下学上达*—mastering the lower to attain the higher), and would interweave them in speech.*\n\n*\"Indeed, the interplay of Dao and its manifestation can be understood through the analogy of* **learning from the lower to attain the higher** (*学乎下可以达乎上*), just as firewood generates flames—this is the Dao of the higher form relying upon the instrument of the lower form. Though the wood may be coarse, its essence and brilliance can still blaze and ascend. The* **Six Classics** (*六经*) *and the* **Mengzi’s teachings** (*论孟*) *speak much of* **instruments** (*器*) *and little of the* **Dao** (*道*), *as if they were storing wood merely to produce flames. The works of Laozi and Zhuangzi, however, speak more of* **non-being** (*无*) *than of* **being** (*有*), *as if to say: ‘The Six Classics have already spoken extensively of the wood; there is no need to elaborate further.’*\n\n*\"The Confucian scholars, in their pursuit of the Dao, have the Six Classics. It would seem they have no need to draw from Laozi and Zhuangzi. Yet their writings are subtle and profound, aiding in the revelation of hidden aspects of the Dao, and are particularly refined and essential. If one could broadly incorporate them, the benefit would be immense—provided one does not, like the Jin scholars, speak of emptiness in vain, and claim that abandoning rites, music, punishments, and governance would allow the world to govern itself.*\n\n*Has there ever been fire that could blaze without wood?*\n\n*\"Moreover, it is said: ‘Nowadays, Daoists who follow Laozi’s teachings abandon the fundamental Dao and speak only of prescriptions, elixirs, and prayers for warding off misfortune or invoking blessings—how far they have strayed from the original intent! Only Bai Juyi’s poetry clearly articulates its truth, stating:*\n\n*‘How much more so the* **Yuan Yuan Huangdi** *(元元皇帝—Primordial Sovereign, i.e., Laozi) *of the* **Five Thousand Words** *(五千言),\nDoes not speak of elixirs,\nDoes not speak of immortals,\nDoes not speak of ascending to the Azure Sky in broad daylight.’*\n\n*The* **Primordial Sovereign** *(元元皇帝) *is none other than Laozi. The Daoist tradition venerates Laozi as its founder, yet in the* **Eighty-One Chapters** *(八十一章) *of his work, beyond the themes of* **Qingjing Guayu** *(清静寡欲—serene stillness and few desires), there is not a single word on alchemy, immortals, or prayers for warding off misfortune and invoking blessings. How can one arbitrarily claim there are prescriptions, elixirs, or immortals, and speak of prayers and incantations?’*\n\n*\"Your Highness graciously approves my words, and upon reciting Bai Juyi’s full verse, you further praise his understanding of Laozi, recognizing its profundity and subtlety. I have also included this in my own collection.*\n\n*\"It is further said: ‘The world reveres Laozi yet doubts that his teachings surpass the* **Five Three Six Classics** *(五三六经—likely a reference to the* **Five Classics** *and* **Three Commentaries** *of the Six Classics), or scoffs at his emptiness and uselessness—all failing to truly comprehend Laozi.*\n\n*‘Yet Laozi’s lofty aspirations are indeed present. His discussions of the Dao’s mysteries do not dwell on the Dao itself, but exhaustively reveal its subtleties. He employs instruments to manifest the Dao, yet transcends mere attachment to being. The Six Classics focus on recording deeds and events, without delving deeply into their meanings. This book truly exhausts its explanations, thus elaborating on what the* **Mengzi** *(论孟) *strives to clarify. Therefore, it is worthy to stand alongside the Six Classics.’*\n\n*\"As seen in* **The Harmonized Speeches on the Yijing and Laozi** *(《易老通言》).*\n\n*\"Shen Zongzhong asked Master Zhu Xi (晦庵先生朱文公): ‘There are those who wish to observe Your Highness’ disdain—how is this understood?’\"*\n\nMaster Zhu said: *\"This ‘edge’ and ‘border’ are like boundaries that resemble each other—this refers to the point where they meet. People have always interpreted ‘constant’ and ‘non-constant’ as a duality, but it is better to see ‘constant’ as the absence of desire and ‘non-constant’ as the presence of desire.*\n\n*He was further asked: ‘How should “The Dao that can be spoken of is not the eternal Dao” be understood?’*\nMaster Zhu said: *\"The Dao that can be spoken of is not the eternal Dao; the name that can be named is not the eternal name.\"*\n\n*He was further asked: ‘What is the meaning of “mysterious”?’*\nMaster Zhu said: *\"‘Mysterious’ is to probe the depths until it reaches a pitch so profound that it is utterly dark—this is where all subtleties converge.\"*\n\n*Zhang Yi asked about the meaning of ‘loading the spirit, embracing unity, and preventing separation.’*\nMaster Zhu said: *\"The ‘spirit’ (魂) is two, the ‘vital breath’ (魄) is one. One is water, two is fire. Fire embraces water, and the spirit loads the vital breath—this is the principle of movement guarding stillness.\"*\n\nMaster Zhu said: *\"‘Hoarding much will inevitably lead to great loss’—Laozi spoke truly well on this.\"*\n\n*Chen Zhongheng asked about the* **Book of Zhou** *(《周书》): ‘“Those who would subvert it must first aid it; those who would take it must first give it.” Yet the* **Book of Zhou** *lacks this. Why?’*\nMaster Zhu said: *\"This is precisely what Laozi condensed into a few phrases. In the Zhou era, such texts existed, and since Laozi was the Keeper of Archives, he had ample exposure to them—this is why Confucius visited Zhou to inquire about rites and such.\"*\n\n*Huang Yigang asked: ‘Original Rang seems to have studied Laozi.’*\nMaster Zhu said: *\"He does not resemble Laozi. Laozi was not like that at all.\"*\nZhuang Zhong said: *\"He seems like Zhuangzi.\"*\nMaster Zhu said: *\"That is correct. Even in Confucius’ time, such people already existed.\"*\nZhuang Zhong said: *\"Though Zhuangzi took Laozi as his master, Laozi’s teachings were still meant to engage with the world, whereas Zhuangzi was not so.\"*\nMaster Zhu said: *\"Zhuangzi’s words are broader and more distant, yet also more vacuous—he strayed from Laozi’s intent. If Laozi were alive to hear this, he would not approve.\"*\n\n*Someone asked: ‘Laozi’s Dao was effectively applied by Cao Can and Emperor Wen of Han, yet why did figures like Wang Dao and Xie An fail to achieve the same?’*\nMaster Zhu said: *\"Wang Dao and Xie An never truly grasped Laozi’s profundities.\"*\n\nMaster Zhu said: *\"Han Emperor Wen and Cao Can indeed applied Laozi’s principles, but they only understood his superficial aspects—merely accommodating and following conventions without deeper engagement.\"*\n\n*Guo Deyuan asked: ‘Laozi said, “Ritual, though thin in loyalty and trustworthiness, is the root of disorder.” Yet Confucius inquired about ritual from him. Why?’*\nMaster Zhu said: *\"He understood the complexities of ritual.\"*\n\n*Initially, I suspected there were two Lao Dan, and Cheng Hao also seemed to think so. Now, upon closer examination, this is not the case. Since he served as Keeper of Archives, he naturally comprehended ritual well, which is why he spoke so aptly with Confucius. He also said that these rites could be dispensed with if unnecessary—almost as if the Sage’s use of ritual was overly burdensome, hence his words. The passage in* **The Rites’ Evolution** *(《礼运》) on ‘planning to use it leads to its rise, and from this, wars emerge’ carries this same meaning.\"*\n\nMaster Zhu said: *\"Laozi’s methods were austere and frugal, unwilling to exert the spirit. He initially taught ‘tranquil stillness and non-action,’ yet also incorporated longevity and immortality. Later, his teachings focused solely on longevity and immortality, reducing him to a mere shamanistic practitioner—obsessed with warding off misfortune and praying for blessings. This marks two distinct shifts in his thought.\"*\n\n*He also said: ‘Bo Yi somewhat resembled Laozi.’*\n*He also said: ‘Zhang Liang was deeply versed in Laozi’s teachings, while Cao Can learned them superficially without application.’*\n*He also said: ‘Among figures after Mencius, only Zhang Liang and Zhuge Liang stand out. Zhang Liang’s studies stemmed from Huang-Lao, but compared to Wang Anshi, his approach was less meticulous.’*\n*He also said: ‘Yang Xiong’s* **Tai Xuan** *(《太玄》) *originated from Zhuang-Lao, evident in its stillness and emptiness.’*\n*He also said: ‘Though Wen Zhong had ambitions for the world and understood the institutions of the Three Dynasties, compared to Zhang Liang and Wei Qing, he possessed somewhat greater capability. Yet tracing his theoretical roots, they still stem from Zhuang-Lao.’*\n\n*Someone asked: ‘Though scholars of the Jin and Song dynasties often spoke of Zhuang-Lao, perhaps they did not fully grasp their true essence.’*\nMaster Zhu said: *\"Those scholars merely borrowed their language to justify abandoning ritual and law. Given their corrupt and chaotic minds, how could they truly comprehend Zhuang-Lao’s intent?\"*\n\nMaster Zhu said: *\"Kang You once claimed, ‘Laozi grasped the essence of the* **Yijing** *(《易》), and Mencius its application.’ This is incorrect. Laozi had his own essence and application, and Mencius had his own. ‘To take, one must first give’—this is Laozi’s essence and application. ‘Cultivating the heart-mind and nurturing the nature, expanding the four beginnings’—this is Mencius’ essence and application.\"*\n\n*He also said: ‘Kang You’s studies resembled Laozi’s, yet he sought only ease and comfort, untroubled by others. Zhang Zifang was the same—while others were in turmoil, he remained at peace in seclusion.’*\n\n*Zhang Wanjie then asked about the preface to* **Striking the Millet Field** *(《击壤集》), which speaks of observing the Dao through the Dao. Is this truly without flaw?*\nMaster Zhu said: *\"To call it flawless is incorrect, yet to call it flawed is also incorrect. It expresses the same intent—like observing the world through the world. This perspective originates from Laozi.\"*\n\n*Chen Qi asked: ‘Mencius’ morning qi is exceedingly subtle—how could he cultivate it so completely?’*\nMaster Zhu said: *\"He failed to preserve the night qi, which was ruined by the activities of dawn and day—what is called ‘good and evil being nearly indistinguishable from others.’\"*\n\n「Zhang Wanjie then cited Laozi’s words: *“In governing people and harmonizing with Heaven, nothing surpasses frugality. Only frugality is called ‘early return.’ Early return is called ‘heavily accumulating virtue/power.’ Heavily accumulating virtue/power means nothing cannot be overcome, and its essence aligns closely with Mencius’ intent. Yet its focus lies in nurturing the spirit—its meaning is inherently good. Mencius’ morning qi is exceedingly subtle, but the cultivation of it is no different: it is the practice of maintaining this heart in daily life.”*\n\nLi Jingzi asked: *“Is there truth in the claims of immortals and transcendent beings?”*\nMaster Zhu said: *“Who would say there is none? There is indeed such possibility, but their practice is exceedingly difficult. Unless one abandons all worldly affairs, one cannot achieve that level of cultivation.”*\n\nCai Jitong remarked: *“Daoists speak of Laozi and Zhuangzi as supreme, yet they fail to embody their teachings.”*\nMaster Zhu said: *“Nowadays, scholars read countless books, yet their understanding of their own principles remains shallow. How then could they have the leisure to truly grasp the Dao of Laozi and Zhuangzi?”*\nCai said: *“Liezi’s teachings are also commendable.”*\nMaster Zhu replied: *“Liezi’s words are indeed admirable, but they are weak in conviction—unlike Zhuangzi.”*\nAsked how Laozi compares, he said: *“Laozi’s words are even deeper and more profound.”*\n\nMaster Zhu continued: *“The early Buddhist teachings merely borrowed the language of Laozi and Zhuangzi. For instance, texts like those of the Far Master (远法师) employ their ideas in fragments, but their spoken teachings are ineffective. Only with the arrival of Dharma (法) did they begin instructing people to cultivate themselves directly—thus, Zen (禅) emerged later. All this is recorded in* **Master Zhu’s Collected Sayings** *(《文公语录》).*\n\nLu Jiuxian of Xiangshan (象山陆九渊) stated: *“Heterodox teachings originated not from Confucius. Today’s reckless scholars point only to Buddhism and Daoism as heterodox, yet in Confucius’ time, China knew nothing of Buddhism, and though Laozi existed, his teachings were not yet widely proclaimed. The Master’s condemnation of empty talk in* **The Analects** *(《论》) and* **Mencius** *(《孟》) is evident, but he never explicitly rejected Laozi’s words—thus, it is clear that ‘heterodox’ does not refer solely to Buddhism and Daoism.”*\n(Recorded in *Lu Jiuxian’s Collected Works* 《象山集》.)\n\nLiu Yizhi of Zhouxi (苕溪刘一止行简) said: *“I ponder the affairs of the world: what aligns with human sentiment below, with Heaven’s intent above, and with the Great Dao in the middle, is but one principle—* **‘public and self’** *(公而己). Laozi declared: ‘Tolerance is public, publicness is magnanimity, magnanimity is Heaven’s, Heaven’s is the Dao.’ These are but one, inseparable. Tolerance cannot achieve publicness without magnanimity; the term ‘public and magnanimous’ (王公) refers to one who tolerates yet remains public. The term ‘public and expansive’ (王训) refers to one who is public yet possesses greatness. Thus, publicness must share virtue/power with magnanimity, and magnanimity must share the Dao with Heaven. This is the ultimate principle of the world.”*\n(Recorded in *Liu Yizhi’s Collected Works* 《苕溪集》.)\n\nZheng Bojun of Yongjia (永嘉郑伯熊景望) said: *“Master Zhu governed the Yellow Old (黄老) teachings, while Cao Zang (曹相国) applied them in Qi (齐) and claimed to govern it. Yet Confucians often disparage Yellow Old teachings—why is this? I once secluded myself all day, sat in silence, and restrained my actions. I minimized tastes, and my heart became tranquil, my qi even—no illness could invade. I preserved what was lacking and dispersed what was excessive, sought nothing in vain, and worried not beyond measure. Yet the aged and frail find ease in quietude. I considered this principle and found it applicable to all things under Heaven—why single out Qi, a mere hundred-li territory? Confucius and Mencius’ teachings could not be more correct, yet why do they disparage Yellow Old teachings? Indeed, the Daoists’ pursuit of purity (清净) often veers into falsehood (诞).”*\n(Recorded in *Mr. Zheng’s Steady Words* 《郑先生戆语》.)\n\nLiu Qingshui said: *“Laozi’s words on Dao and virtue/power were spoken in response to Guan Ling’s (关令) request, yet he composed them without hesitation, and the text was written down as is. He never divided it into ninety-nine chapters. Later scholars split it into two volumes—Upper and Lower—mirroring the duality of yin and yang, and eighty-one chapters—nine times nine—corresponding to the extreme number of the sun.”*\n(From the preface to *A General Discussion on the Dao and Virtue Text* 《道德经通论序》.)\n\nHuang Maocai stated: *“Though Dao and virtue/power bear two names, they are inseparable in function. Today’s scholars mistakenly divide the Upper Text as Dao and the Lower Text as virtue/power—this is far from the author’s original intent.”*\nHe further said: *“The* **I Ching** *(《易》) contains sixty-four hexagrams, eight times eight. Laozi’s text has eighty-one chapters, nine times nine. Laozi’s work complements the* **I Ching** *(《易》) like a mirror; later, Yang Xiong (杨子云) composed* **The Great Mysterious** *(《太玄》) to align with the* **I Ching** *(《易》), also with eighty-one verses—clearly inspired by this.”*\n(From *Commentary on the Text* 《经注》.)\n\nLin Dong said: *“The teachings of the Master and Laozi illuminate each other. The Master used* **‘Ren, Yi, Li, and Le’** *(仁义礼乐) as the means to govern the world, while Laozi employed* **‘emptiness, nothingness, and quietude’** *(虚无恬淡) to reveal the origin of the Great Dao. Ultimately,* **‘Ren, Yi, Li, and Le’** *emerge not from the Great Dao—from where then? And* **‘emptiness, nothingness, and quietude’** *are the very essence of the Great Dao. Yet later generations failed to apply Laozi’s teachings properly, often emphasizing only emptiness and quietude to the point of neglecting duties, thereby burdening Laozi’s legacy.”*\nMoreover, he said: *“As for the Daoist principle of* **‘the subtle Dao-heart’** *(道心) and* **‘governing without action’** *(无为而治), our Confucian tradition has never rejected it. Laozi’s* **‘three treasures’** *(三宝)—one is compassion (慈), two is frugality (俭), three is not daring to act before Heaven and Earth (不敢为天下先)—his method of aiding rulers through the Dao, without relying on military might to dominate the world, is something our Confucian tradition has also never rejected.”*\nThus, he concluded: *“If we extend this reasoning, the Great Dao and the Dao are one and the same—only differing in priority and sequence. They mutually illuminate each other, both crafted to address the world’s woes. Some claim Laozi abandoned* **‘Ren’** *and rejected* **‘Yi’** *, that* **‘Li’** *is the origin of disorder—this is not at odds with the Master’s teachings. Indeed, elevating the Dao’s source, the Master acknowledged that* **‘Ren, Yi, Li, and Le’** *can govern the world, but it is superior to govern through the Dao, allowing people to forget themselves within it.”*\n\nThe *Daodejing* states:\n\n*\"As seen in the* **Jingjie Fati***. Liu Shili, who styled himself Zhenjingzi, a man of the Shaoxi era, composed the* **Daodejing Jiejie** *in sixteen chapters. Here, we take five of them.*\n\n*'The profundity beyond profundity' refers to the natural origin of the primordial source. This is the gateway to all marvels—first discussing the Dao, then Heaven and Earth, and finally human nature. It is exhaustive. Scholars must ponder and grasp this silently.*\n\n*'The Mysterious Female'*—*‘profound’* is yang, *‘female’* is yin. The ‘gate’ is the threshold where the two qi intermingle, as in the previous chapter: ‘the gateway to all marvels,’ or as the* **Analects** *say: ‘Who can exit without passing through the door? Why not follow this Way?’*\n\n*Do not rigidly interpret ‘the Mysterious Female’ as the nasal passages.*\n\n*‘The root of Heaven and Earth’*—*Laozi’s words imply that before Heaven and Earth existed, there was the primal qi, which is called the root of Heaven and Earth.*\n\n*‘When full, it must become empty.’* *Beware of excess.*\n*‘When sharp, it must become blunt.’* *Beware of aggression.*\n*‘Gold and jade must be burdened.’* *Beware of greed.*\n*‘Wealth and honor must lead to licentiousness.’* *Beware of arrogance.*\n*‘When achievement and fame are complete, danger follows.’* *Beware of not knowing when to stop.*\n\n*Laozi’s words are profound, meant to save people—not to say that those who abandon worldly affairs and retreat to mountains and forests can enter the Dao. Even amid wealth, honor, and fame, one may diligently practice it.*\n\n*‘When stretched, it must contract; when strong, it must weaken; when exalted, it must decline; when given, it must be taken.’* *This is the natural principle of things—what is called subtle clarity.*\n\n*‘Subtle clarity’*—*the refined and luminous, evident and verifiable.*\n\n*Some interpret this through the lens of stratagem, but the Dao of Heaven benefits without harming. Is this not so?*\n\n*Some say Confucius taught ‘responding to enmity with rectitude,’ yet here it says ‘responding with virtue.’ Why the difference?*\n\n*Yet Laozi teaches that one should only cultivate softness and weakness, aligning with Heaven without contention, thus averting Heaven’s punishments and distant calamities. If one responds to enmity with rectitude, how can enmity cease?*\n\n*Confucius’ words were spoken in response to his times, but responding with virtue is superior.*\n\n*As the reclusive scholar Xie Shouhao observed:*\n*The* **Daodejing** *was examined by Tang official Fu Yi, who compared numerous editions. The* **Xiang Yu Concubine Edition** *was unearthed in Pengcheng during the fifth year of Qi Emperor Wu’s reign (564 CE), when a tomb of Xiang Yu’s concubine was opened, and the text was found. The* **Anqiu Wangzhi Edition** *was obtained by Daoist Ge Xuan during the Taihe era of the Wei dynasty. The* **Hexiang Zhangren Edition** *was transmitted by the recluse Chou Yue of Qi.*\n\n*The Three Family Editions total 5,722 characters, matching the* **Yu Lao** *in* **Hanfeizi***. Additionally, there is an* **Official Edition of Luoyang** *with 5,635 characters, Wang Bi’s Edition with 5,683 or 5,610 characters, and the* **Hexiang Gong Edition** *with 5,355 or 5,590 characters. The commentaries of these schools vary in length, but over time, each has been transmitted with trust, sometimes cross-referenced with other editions, leading to discrepancies.*\n\n*As Sima Qian recorded in the* **Shiji***: ‘Laozi wrote a book on the meaning of Dao and virtue, with over five thousand words—though not reaching six thousand, it is still over five thousand.’*\n\n*The Daoist tradition claims Laozi’s text consists of five thousand words, likely referring to its entirety.*\n\n*See the* **Laojun Shilu***.*\n\n*The* **Collected Commentaries on the Authentic Daodejing** *concludes here.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "道德真经集注杂说 经名：道德真经集注杂说，宋彭耜撰。 二卷。 底本出处：《正统道藏》洞神部玉诀类。 道德直经集注杂说卷上 宋鹤林彭耜纂集 太祖征太原，驻跸镇阳，闻道士苏澄隐五代之际，屡聘不至，召见於行宫。 澄隐时年八十，太祖问以养生，对曰臣之养生，不过精思炼炁尔，帝王则异於是。 老子曰：我无为而民自化，我无欲而民自朴，无为无欲，凝神太和。 昔黄帝唐尧享国永年，得此道也。 太祖说其一尔。 见《东都事略》隐逸传及高道传。 鸿蒙子张无梦，字灵隐，好清虚，穷《老》《易》，入华山与刘海蟾、种放结方外友，事陈希夷先生，无梦多得微旨。 久之，入天台山，真宗召对，问以长久之策，无梦曰：臣野人也，旦於山中尝诵《老子》《周易》而已，不知其他也。 除着作佐郎，固辞，还山。 赐金帛、处士号，并不受。",
      "translated_text": "**The *Zhuji Zasuo* of the *Daode Zhengjing*: A Miscellany of Commentaries**\n*Compiled by Song-era Peng Zhi (Simplified: Peng Xi)*\nTwo scrolls.\nSource text: *Zhengtong Daozang*, *Dongshen* Section, *Yujue* Category.\n\n---\n\n**Volume One of the *Zhuji Zasuo* of the *Daode Zhengjing***\n*Compiled by Peng Zhi of the Song-era Hèlín*\n\nWhen the Taizu Emperor marched to conquer Taiyuan, he halted at Zhènyáng and heard that the Daoist Su Chengyīn had secluded himself since the Five Dynasties period, though repeatedly summoned, he never came. The Emperor then received him in the imperial pavilion.\n\nAt eighty years old, Su Chengyīn replied to the Emperor’s inquiry on nurturing life (*yǎngshēng*) by saying: *\"My own practice of nurturing life is merely refining the mind and cultivating qi. For emperors, it is different.\"*\n\nLaozi said:\n*\"If I do nothing, the people transform themselves.\nIf I desire nothing, the people return to simplicity.\nDoing nothing, desiring nothing—\nConcentrate the spirit in the Great Harmony.\"*\n\nIn ancient times, the Yellow Emperor and King Tang of the Xia Dynasty ruled for long years—\nThey attained this Dao.\n\nThe Emperor was pleased with this response.\n\nSee also the *Dōngdū Shìlüè* in the *Yǐnyì* and *Gāodào* transmissions.\n\n**Hongmengzi Zhang Wumeng**, styled Língyǐn, loved simplicity and emptiness, mastering the *Laozi* and *Yijing* deeply. He entered Huashan, forming a bond with Liu Haichán and Zhòng Fàng as outer-world friends, and served Master Chen Xīyí. Wumeng often grasped subtle truths.\n\nLater, he entered Tiāntáishān. Emperor Zhenzong summoned him and asked for strategies for longevity. Wumeng replied:\n*\"I am a rustic mountain dweller. Each morning, I recite the *Laozi* and *Zhouyi*—nothing else.\"*\n\nHe was granted the title of *Zhuozuo Zuolang*, but he declined and returned to the mountains.\nThough bestowed gold, silk, and the honorary title of *chushì*, he refused them all.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 342,
      "start_sentence": 0,
      "end_sentence": 15,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 6.915630102157593,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经集注杂说.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "见《高道传》 碧虚子陈景元，师事张鸿蒙，尝着《道德经藏室纂微篇》，盖采摭古诸家注疏之精微，而参以其师传授之秘集而成书。 熙宁中，因召见进呈，御笔奖谕，又有所注《南华经章句音义》，凡二十余卷，今并入藏。 见《碧虚子传》，并《纂微篇·序》，《道藏目录》。 广川董逌《藏书志》云：唐玄宗既注老子，始改定章句为《道德经》，凡言道者，类之上卷，言德者，类之下卷，刻石涡口老子庙中。 又云：唐道士张道相《集注道德经》七卷，凡三十家，其名存者：河上公、节解、严遵、王弼、何晏、郭象、锺会、孙登、羊祜、鸠摩罗什、卢景裕、刘仁会、顾欢、陶弘景、松灵、裴处思、杜弼、张凭、张嗣、臧玄静、孟安期、孟智周、窦略、宋文明、褚柔、刘进喜、蔡子晃、成玄英、车惠弼，今考之新旧《唐书·艺文志》，则又有毋丘望之、湘逸其姓、程韶、王尚、蜀才、袁真、释惠严、惠琳、义盈、梁旷、树锺山、傅奕、杨上善、李允愿、陈嗣古、任真子、冯郭、玄景先生、杨上器、韩杜、梁武帝、梁简文帝、贾大隐、辟闾仁谞、刘仲融、王肃、戴诜、玄宗、卢藏用、邢南和、冯朝隐、白履忠、李播、尹知章、陆德明、陈庭玉、陆希声、吴善经、孙思邈、李含光四十家，而道相所集郭象、刘仁会、松灵、裴处思、杜弼、张嗣、臧玄静、窦略、宋文明、褚柔、刘进喜、蔡子晃、车惠弼，此十四家不着於志。 按《志》称道相《集注》四卷，而董所收乃有七卷，恐后人之所增也。 我朝崇宁中再校定《道藏》经典，此书藏中已不复见，其余诸家仅存玄宗、河上公、严遵、陆希声四注，及傅奕所传古本《道德经》耳。 外李约、李荣、贾清夷各有注说，王、顾等奉玄宗命撰所注经疏，杜光庭又从而为《广圣义》，亦皆唐人，并见藏室，始知六所着录犹有未尽，惜乎名存而书亡者十盖八九也。 唐相陆希声着《道德经传》四卷，其序略云：夫老氏之术，道以为体，名以为用，无为无不为，而格于皇极者也。 杨朱宗老氏之体，失於不及，以至於贵身贱物。 庄周述老氏之用，失於太过，故欲绝圣弃智。 申、韩失老氏之名，而弊於苛缴刻急，王、何失老氏之道，而流於虚无放诞，此六子者皆老氏之罪人也。 乃为述传以畅宗旨。 又云：昔伏羲氏画八卦，象万物，穷性命之理，顺道德之和，老氏先天地，本阴阳，推性命之极，原道德之奥，此与伏羲同其原也。 文王观太易九六之动，贵刚尚变，而要之以中，老氏察太易七八之正，致柔守静，而统之以大，此与文王通其宗也。 孔子祖述尧舜，宪章文武，导斯民以仁义之教，老氏拟议伏羲，弥纶黄帝，冒天下以道德之化，此与孔子合其权也。 此三君子者，圣人之极也，老氏皆变而通之，反而合之，研至变之机，探至精之归，斯可谓至神者矣。 唐兵部郎李约，勉之子也，注《道德经》四卷，其说谓世传此书为神仙虚无言，不知六经乃黄老之枝叶尔。 唐太宗谓傅奕日：佛道玄妙，卿独不悟其理何也。 奕日：佛是胡中桀点，初正西域，渐流中国，皆是模写老庄玄言，文饰之耳。 於百姓无补，於国家有害。 太宗颇然之。",
      "translated_text": "**From the *Gāodào Zhuan*:**\n\nThe **Bìxūzi** Chen Jingyuan, a disciple of Zhang Hongmeng, composed the *Zhuǎnwēi Piān* of the *Dàodé Jīng Cángshì*, gathering the refined insights of ancient commentaries and supplementing them with his master’s secret transmissions to form this work. During the **Xīníng** era, he was summoned and presented his writings to the emperor, who personally inscribed words of praise. He also authored a twenty-plus volume *Zhāngjù Yīnyì* on the *Nánhuá Jīng*, now also housed in the **Daozang**.\n\nSee also the *Bìxūzi Zhuan*, the *Zhuǎnwēi Piān·Xù*, and the *Daozang Mùlù*. In his *Cángshū Zhì*, **Guǎngchuān Dòng Dǒu** notes:\n\nDuring the **Tang Xuānzong**’s reign, after he annotated the *Laozi*, he standardized the text as the *Dàodé Jīng*, categorizing passages on **Dao** in the upper scroll and those on **virtue** in the lower, then inscribed them on stone at the **Lǎozǐ Temple** in Wōkǒu. He further records that the Tang Daoist **Zhang Daoxiàng** compiled a seven-volume *Jízhù Dàodé Jīng*, encompassing thirty schools. Those whose names survive include: **Héshànggōng, Jiějiě, Yán Zhūn, Wáng Bì, Hé Yān, Guōxiàng, Zhōng Huì, Sūn Dēng, Yánggù, Jiūmóluóshì, Lú Jǐngyù, Liú Rénhuì, Gù Huān, Táohóngjǐng, Sōnglíng, Péi Chǔsī, Dú Bì, Zhāng Píng, Zhāng Sì, Zāng Xuānjìng, Mèng Ānqī, Mèng Zhìzhōu, Dòu Luè, Sòng Wénmíng, Chǔ Rǒu, Liú Jìnxǐ, Cài Zǐhuàng, Chéng Xuānyīng, Chē Huìbì**. Yet cross-referencing the *Xīn-Jiù Tángshū·Yìwén Zhì*, additional names emerge: **Wúqiū Wàngzhī, Xiāngyì (surname unknown), Chéng Shào, Wáng Shàng, Shǔ Cái, Yuàn Zhēn, Shì Huìyán, Huìlín, Yìyǐng, Liáng Kuàng, Shù Zhōngshān, Fù Yì, Yáng Shàngshàn, Lǐ Yǔnyuàn, Chén Sìgǔ, Rèn Zhēnzǐ, Fèng Guō, Xuān Jǐng Xiānsheng, Yáng Shàngqì, Hán Dù, Liáng Wǔdì, Liáng Jiǎnwéndì, Jiǎ Dàyǐn, Bìlǘ Rénxù, Liú Zhòngróng, Wáng Shù, Dài Yì, Xuānzōng, Lú Cángyòng, Xíng Nánhé, Fèng Cháoyǐn, Bái Lǚzhōng, Lǐ Bō, Yǐn Zhīzhāng, Lǚ Déming, Chén Tíngyù, Lǚ Xīshēng, Wú Shànjīng, Sūn Sīmiào, Lǐ Hán guāng**—forty schools in total. Yet of these, Zhang Daoxiàng’s compilation includes only **Guōxiàng, Liú Rénhuì, Sōnglíng, Péi Chǔsī, Dú Bì, Zhāng Sì, Zāng Xuānjìng, Dòu Luè, Sòng Wénmíng, Chǔ Rǒu, Liú Jìnxǐ, Cài Zǐhuàng, Chē Huìbì**—fourteen names absent from the *Zhì*. The *Zhì* further lists Daoxiàng’s *Jízhù* as four volumes, yet Dòng Dǒu’s collection contains seven, suggesting later additions.\n\nIn the **Song Chóngníng** era, the *Daozang* was reexamined, yet this work was no longer found within. Only the annotations of **Xuānzōng, Héshànggōng, Yán Zhūn, and Lǚ Xīshēng**—alongside Fù Yì’s transmitted ancient text of the *Dàodé Jīng*—remained. Externally, **Lǐ Yuē, Lǐ Róng, and Jiǎ Qīngyí** each offered their own commentaries, while **Wáng** and **Gù** compiled imperial annotations under Xuānzōng’s command. **Dú Guāngtíng** later authored the *Guǎngshèng Yì*, also preserved in the *Cángshì*. Thus, it is clear that even the six recorded in the *Zhì* were incomplete—lamentably, nine-tenths of these works survive only by name.\n\nThe Tang official **Lǚ Xīshēng**, of the **Bīngbù**, and son of **Lǚ Miǎn**, authored a four-volume *Dàodé Jīng Zhuàn*. His preface briefly states:\n\n*\"The Master Lao’s teachings take **Dao** as essence and **virtue** as function—non-action yet encompassing all action—harmonizing with the **Royal Polarity**. Yang Zhu followed the Master’s essence but erred in undervaluing the world, elevating self over substance. Zhuang Zhou expounded the Master’s function but overreached, seeking to abandon sageliness and discard wisdom. Shèn and Hán misapplied the Master’s **virtue**, descending into harsh legalism. Wáng and Hé lost the Master’s **Dao**, drifting into empty nihilism. These six disciples are all the Master’s transgressors. Thus, I have written this transmission to elucidate his true intent.\"*\n\nHe further states:\n\n*\"In antiquity, Fúxī drew the Eight Trigrams, mirroring all things, exhausting the principles of **nature and life**, aligning with the harmony of **Dao and virtue**. The Master Lao preceded heaven and earth, founding **yin and yang**, probing the limits of **nature and life**, uncovering the depths of **Dao and virtue**—thus sharing the same origin as Fúxī. King Wén observed the dynamic **Nine and Six** of the **Great Ease**, valuing strength yet prioritizing change, ultimately centering on moderation. The Master Lao discerned the **Seven and Eight** of the **Great Ease**, emphasizing softness and stillness, unifying all under the **Great**. Thus, he shared the same lineage as King Wén. Confucius inherited the **Dao** of Yáo and Shùn, establishing the constitutional models of Wén and Wǔ, guiding the people with the teachings of **ren and yì**. The Master Lao modeled himself on Fúxī, encompassing the achievements of **Huángdì**, transforming the world through the **Dao of virtue**. Thus, he aligned with Confucius in **strategic application**. These three sages represent the pinnacle of **sainthood**; the Master Lao harmonized and transcended them, penetrating the mechanisms of transformation, exploring the ultimate precision of essence—truly the most divine.\"*\n\nThe Tang official **Lǐ Yuē**, of the **Bīngbù**, and son of **Lǐ Miǎn**, authored a four-volume annotation on the *Dàodé Jīng*. His interpretation argues that the world mistakenly views this text as the empty rhetoric of immortals, unaware that the **Six Classics** are but branches of **Huáng-Lǎo doctrine**.\n\nThe Tang **Tàizōng** once asked **Fù Yì**, *\"Buddhism and Dao are profound—why do you not grasp their principles?\"* Fù Yì replied, *\"Buddhism is but a bandit from the Western lands, initially confined to the frontier, now seeping into China. It is nothing more than a superficial embellishment of Lao and Zhuang’s mystical phrases—useless to the common folk and harmful to the state.\"* The emperor was persuaded by his words.",
      "overlap_context": " and Zhòng Fàng as outer-world friends, and served Master Chen Xīyí. Wumeng often grasped subtle truths.\n\nLater, he entered Tiāntáishān. Emperor Zhenzong summoned him and asked for strategies for longevity. Wumeng replied:\n*\"I am a rustic mountain dweller. Each morning, I recite the *Laozi* and *Zhouyi*—nothing else.\"*\n\nHe was granted the title of *Zhuozuo Zuolang*, but he declined and returned to the mountains.\nThough bestowed gold, silk, and the honorary title of *chushì*, he refused them all.",
      "start_char": 342,
      "end_char": 1540,
      "start_sentence": 16,
      "end_sentence": 38,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 21.788517236709595,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经集注杂说.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "临终诫其子曰：老庄玄一之篇，周孔六经之说，是为名教，汝宜习之，妖胡乱华，举时皆惑，汝等勿学也。 见《旧唐书》本传。 唐宪宗顾宰臣曰：神仙之事，信乎。 李藩对曰：神仙之说，出於道家。 道家所宗老子五千文为本，老子指归与经无异，后代好怪之流，假托老子神仙之说，故秦始皇、汉武帝二主受惑，卒无所得。 上深然之。 见《旧唐书·宪宗纪》。 仲长子光，字不曜，开皇末结庵河渚间，守令谒者，辞以喑。 人有请道者，则书老易二字示之，文中子比之虞仲夷逸云。 见王绩《仲长先生传》及文中子注。 东皋子王绩，字无功，兄通，隋末大儒也，有田在河渚间，仲长子光结庐北渚，绩爱其真，徙与相近，常以《周易》、《老子》、《庄子》置床头，他书罕读也。 见《新唐书.隐逸传》。 卢鸿一，字颢然，隐於嵩山，开元六年征至东都，谒见不拜，宰相遣通事舍人问其故，奏曰：臣闻老君言，礼者忠信之薄，不足可依，山臣鸿一，敢以忠信奉见。 见《旧唐书·隐逸传》。 贞一先生司马承祯，宇子微，庐天台不出，睿宗命其兄承袆就起之，既至，引入中掖，廷问其术，对曰：为道日损，损之又损，以至於无为。 夫心目所知见，每损之尚不能已，况攻异端而增智虑哉。 帝曰：治身则尔，治国若何。",
      "translated_text": "「At his deathbed, he admonished his son: *\"The profound unity of Lao and Zhuang’s teachings, along with the doctrines of the Six Classics from Zhou and Confucius, constitute the **name-teaching** (míngjiào). You should study them diligently. As for the heretical barbarians (yāohú) corrupting China, all are misled by them—you must not follow their ways.\"* (As seen in his *Old Book of Tang* biography.)\n\nThe Tang **Xianzong** once addressed his ministers: *\"Are the matters of immortals (shénxiān) truly credible?\"*\n**Lǐ Fān** replied: *\"The discourse of immortals originates from the Daoist tradition. The Daoists revere the *Five Thousand Words* of Laozi as their foundation, and his core teachings align with those of the Classics. Later generations, however, who indulged in eccentric speculation, falsely attributed the idea of immortals to Laozi. Thus, the two rulers, **Qín Shǐhuáng** and **Hàn Wǔdì**, were deceived by such claims and ultimately gained nothing.\"*\n\nThe emperor was deeply convinced by his words. (As seen in the *Old Book of Tang—Xianzong’s Records*.)\n\n**Zhòng Zhǎng**’s eldest son, **Zǐ Guāng**, styled **Bù Yào**, in the late years of **Kāihuáng**, built a hermitage along the riverbanks. When officials paid their respects, he declined by claiming muteness.\n\nIf someone requested his teachings, he would write the characters **Lǎo** and **Yì** (Lao and Zhuang) to show them, comparing **Wén Zhōngzǐ** (Master Mozi) to **Yú Zhòng** and **Yí Yì** (the virtuous but misunderstood figures of antiquity). (As recorded in **Wáng Jì’s** *Biography of Master Zhòng Zhǎng* and **Wén Zhōngzǐ’s** annotations.)\n\n**Dōng Gāo Zǐ** **Wáng Jì**, styled **Wú Gōng**, elder brother of **Wáng Tōng**, was a great Confucian scholar of the late **Sui dynasty**. He owned fields along the riverbanks, and **Zhòng Zhǎng**’s son **Zǐ Guāng** built a dwelling near the northern bank. **Wáng Jì** admired his sincerity and moved to live nearby, always placing *Zhōu Yì* (the *Book of Changes*), *Lǎo Zǐ* (Laozi), and *Zhuāng Zǐ* (Zhuangzi) at his bedside, rarely reading other books. (As seen in the *New Book of Tang—Biographies of Recluses*.)\n\n**Lú Hóngyī**, styled **Chéngrán**, hid in **Sōngshān** (Song Mountain). In **Kāiyuán** year six, he was summoned to **Dōngdū** (Eastern Capital). Upon meeting the emperor, he did not bow. The ministers sent a **Tōngshì Shèrén** (attendant official) to inquire about his conduct, and he reported: *\"I have heard the **Old Master** (Lǎojūn) say that **rites** (lǐ) are but the outward display of **loyalty and sincerity** (zhōngxìn), insufficient to rely upon. As a humble subject of the mountain, I dare not present myself with such formalities.\"*\n\n(As seen in the *Old Book of Tang—Biographies of Recluses*.)\n\n**Zhēnyī Xiānsheng** **Sīmǎ Chéngzhēn**, with his courtesy name **Zǐ Wēi**, resided in his retreat on **Tiān’tái** (Tian Tai Mountain) and never ventured out. The **Ruìzōng** emperor ordered his brother **Sīmǎ Chéngtán** to persuade him to leave. Once he arrived, the emperor led him into the **inner palace** (zhōngyè) and questioned him about his methods. He answered: *\"Pursuing the Dao requires daily **self-cultivation** (rǎn), diminishing one’s self further and further until reaching **non-action** (wúwéi).*\n\n*Even the perceptions of the mind and eyes must be reduced, yet they cannot fully cease. How much more so when one delves into heterodox theories and amplifies one’s clever schemes!\"*\n\nThe emperor said: *\"Your words apply to cultivating oneself, but how would they guide the governance of a nation?\"*",
      "overlap_context": "are that the **Six Classics** are but branches of **Huáng-Lǎo doctrine**.\n\nThe Tang **Tàizōng** once asked **Fù Yì**, *\"Buddhism and Dao are profound—why do you not grasp their principles?\"* Fù Yì replied, *\"Buddhism is but a bandit from the Western lands, initially confined to the frontier, now seeping into China. It is nothing more than a superficial embellishment of Lao and Zhuang’s mystical phrases—useless to the common folk and harmful to the state.\"* The emperor was persuaded by his words.",
      "start_char": 1540,
      "end_char": 2046,
      "start_sentence": 39,
      "end_sentence": 55,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 11.980181217193604,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经集注杂说.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "对曰：国犹身也，故游心於淡，合气於漠，与物自然而无私焉，而天下治。 帝嗟叹曰：广成之言也。 开元中再召至都，玄宗诏於王屋山置坛室以居。 善篆隶，帝命以三体写老子，刊正文句。 见《新唐书．隐逸传》，旧书本传云：玄宗令以三体写老子经，因刊正文句，定着五千三百八十言，为真本，以奏上之。 宗元先生吴筠，鲁中之儒士也，入嵩山为道士，久之游天台，玄宗遣使征之，既至，问以道法。 对曰：道法之精，无如五千言，其诸枝词蔓说，徒费纸札耳。 见《旧唐书．隐逸传》新书本传云：帝尝问道对曰：深於道者，无如老子五千文，其余徒丧纸札耳。 复问神仙治炼法，对曰：此野人事，积岁月求之，非人主宜留意。 与旧书少异，故并录之。 班固载老子邻氏有传，傅氏、徐氏、刘向皆有说，傅氏三十七篇，邻氏四篇，徐氏六篇，刘向四篇，惜乎其书之亡久矣。 今世所传老子《道德经》或总为上下二篇，或分八十一章，或七十二章。 河上公分八十一章，以上经法天，天数奇，故有三十七章，下经法地，地数偶，故有四十四章。 严遵乃以阴道八，阳道九，以八行九，故七十二章。 上四十章，下三十二章，全与河上公不合。 本既各异，说亦不同，盖莫得而考也。 汉桓谭曰：昔老聃着虚无之言两篇，后世好之者以为过於五经，自汉文景之君及司马迁，皆有是言。 见《杨雄传》 阮藉着《通老论》曰：道者法自然而为化，侯王能守之，万物将自化，《易》谓之太极，《春秋》谓之元，老子谓之道。 见《太平御览》 王弼注《道德经》，以夫佳兵、民之饥二章，疑非老子所作。 何晏注《老子》未毕，见王弼自说注《老子》旨，何意多短，不复得作声，但应诺。 遂不复注，因作《道德论》。 一说何平叔注《老子》始成，诣王辅嗣，见王注精奇，乃神伏曰：若斯人可与论天人际矣。 因以所注为《道德》二论。 《文章叙录》曰：自儒者论以老子非圣人，绝礼弃学，平叔说与圣人同，着论行於世。 见《世说》并注。 阮瞻，咸之子也，见司徒王戎，戎问曰：圣人贵名教，老庄明自然，其旨同异。 瞻曰：将无同。 戎咨嗟良久，即命辟之，时谓之三语缘。 见《晋书》本传，《世说》作阮修。 陆元朗，字德明，以字行，补太学博士，高祖释奠，已召博士徐文远讲《孝经》，沙门惠乘讲《般若经》，道士刘进喜讲《老子》。 德明难此三人，各因宗指，随端立义，众皆为之屈。 帝大喜曰：三人者诚辩，然德明一举辄蔽，可谓贤矣。 见《新旧唐书·儒学传》。 开元初，诏中书令张说举能治《易》《老》《庄》者，集贤直学士侯行果荐会稽康子元及平阳敬会真於说，说籍以闻，并得侍读，俄并兼集贤侍讲学士。 始行果、会真及长乐冯朝隐同进讲，朝隐能推索老庄秘义，会真亦善《老子》，每启篇先熏盥乃读。 见《新唐书．儒学传》。 张荐明少以儒学游河朔，后去为道士，通老子庄周之说，晋高祖召见，问道家可以治国乎，对曰：道也者妙万物而为言，得其极者，尸居衽席之间，可以治天下。 高祖大其言，延入内殿，讲《道德经》，拜以为师，赐号通玄先生，后不知所终。 见《五代史·一行传》。 太宗闻汴水辈运卒有私质市者，谓侍臣曰：幸门如鼠穴，何可塞之，但去其尤者可矣。",
      "translated_text": "The Master replied: *\"A nation is like the self—thus, one must cultivate a mind of simplicity, harmonize one’s qi with emptiness, and act spontaneously without selfishness, and the realm will be governed in harmony.\"* The Emperor sighed in admiration: *\"This is the speech of Guangchéng!\"*\n\nDuring the **Kāiyuán** era, he was summoned again to the capital, and Emperor Xuanzong decreed that a hall be built for him on **Wàngwū Shān** (Wangwu Mountain) as his residence. Skilled in **seal and clerical script**, the Emperor commanded him to transcribe *Lǎozǐ* in the **Three Scripts** and correct its textual errors. *(As recorded in the *New Tang Book·Recluses*, the old text states: The Emperor ordered him to transcribe the *Lǎozǐ Jing* in the Three Scripts, thereby correcting the text and establishing its true version of **5,384 characters**, which he then presented to the throne.)*\n\n**Zhēnyī** Master **Sīmǎ Chéngtán**, of **Rúzhōng** (Ruizhong), was a scholar who later entered **Sōngshān** (Songshan) as a Daoist. After some time, he traveled to **Tiāntái** (Tiantai). Emperor Xuanzong sent envoys to summon him, and upon his arrival, the Emperor questioned him on Daoist methods. He answered: *\"The essence of the Dao is nowhere more refined than in the **Five Thousand Words** (of *Lǎozǐ*). The rest are merely verbose elaborations, wasting nothing but paper.\"*\n\n*(The *Old Tang Book·Recluses* and its revised edition record: The Emperor once asked him about the Dao, and he replied: *\"Those deeply versed in the Dao have nothing beyond Lǎozǐ’s **Five Thousand Characters**; the rest are mere squandering of paper.\"* When further questioned on **immortal techniques and alchemical refinement**, he responded: *\"These are matters for rustics. Seeking them over years is not a concern for a ruler.\"* The text here differs slightly from the old edition, hence both are recorded.)*\n\n**Bān Gù** recorded that **Lǎozǐ**’s **Línshì** lineage had a tradition, as did the **Fù**, **Xú**, and **Liú Xiàng** schools. The **Fù** school had **37 chapters**, the **Lín** school **4**, the **Xú** school **6**, and **Liú Xiàng** **4**. Alas, their texts have long been lost.\n\nThe *Lǎozǐ Dàodéjīng* transmitted today is sometimes combined into **two volumes** (upper and lower), or divided into **81 chapters**, or **72 chapters**. **Héshànggōng** partitioned it into **81 chapters**: the upper text follows **celestial patterns** (as heaven’s numbers are odd), hence **37 chapters**; the lower text follows **earthly patterns** (as earth’s numbers are even), hence **44 chapters**. **Yán Zhēn** instead arranged it by **eight yin principles** and **nine yang principles**, aligning them as **eight following nine**, resulting in **72 chapters**—**40 in the upper**, **32 in the lower**—completely diverging from Héshànggōng’s version. Since their foundations differ, their interpretations also vary, and none can be verified.\n\n**Hán Huán Tán** remarked: *\"In antiquity, Lǎozǐ composed **two chapters on emptiness and nothingness**; later admirers elevated them above the **Five Classics**. From the reigns of Emperor Wén and Jīng of the Hàn to **Sīmǎ Qiān**, all spoke of this.\"* *(As recorded in *Yáng Xiǔ’s Transmission*.)*\n\n**Ruǎn Jié** wrote *Tōng Lǎo Lùn*, stating: *\"The Dao follows spontaneity and transforms through it. If a sovereign upholds it, all things will transform naturally. The *Yì* calls it the **Tàijí**, the *Chūnqiū* calls it **yuán**, and Lǎozǐ calls it the **Dao**.\"* *(As recorded in the *Tàipíng Yùlǎn*.)*\n\n**Wáng Bì** annotated the *Dàodéjīng*, doubting that the chapters *\"佳兵\"* (*\"Fine Arms\"*) and *\"民之饥\"* (*\"The People’s Hunger\"*) were authored by Lǎozǐ.\n\n**Hé Yán**, while annotating *Lǎozǐ*, did not finish. Upon seeing **Wáng Bì’s** self-explanation of his annotations, Hé Yán, though impressed, could not continue and only nodded in assent. Thus, he abandoned the annotation and instead composed the *Dàodé Lùn*. Another account states that **Hé Píngzhū** completed his annotation of *Lǎozǐ* and presented it to **Wáng Fǔsì**. Seeing Wáng’s profound and ingenious work, Hé Yán exclaimed in awe: *\"Such a man can truly discuss the interplay of **Heaven and humanity**!\"* He then repurposed his own annotations into the *Dàodé* **Two Treatises**.\n\n*The Record of Literary Styles* states: *\"Confucian scholars argue that Lǎozǐ was not a sage, abandoning ritual and learning. **Píngzhū**’s interpretation aligns him with the sages, and his treatise spread widely.\"* *(As recorded in the *Shìshuó* and its annotations.)*\n\n**Ruǎn Zhān**, son of **Ruǎn Jié**, met **Sītú Wáng Róng**, who asked: *\"The sages value **ritual and instruction**; Lǎozǐ and Zhūangzǐ emphasize **spontaneity**. Do their meanings converge or diverge?\"* Zhān replied: *\"Perhaps they are the same.\"* Wáng Róng sighed deeply for a long while before inviting him, and the incident was later called the **\"Three-Sentence Connection\"** *(sānyǔyuán)*.\n\n**Lù Yuánlǎng**, courtesy name **Dé Míng**, served as a **Tàixué** scholar-official. During the **sacrificial rites** under Emperor **Gāozǔ**, after **Xú Wényuǎn** lectured on the *Xiào Jīng* and **Biànshēn Huìchéng** on the *Bōrě Jīng*, **Dàoshi Liù Jìnxǐ** lectured on *Lǎozǐ*. Dé Míng challenged all three, each adhering to their doctrines and establishing their positions. The crowd was subdued. The Emperor rejoiced: *\"Though the three are skilled in debate, Dé Míng’s single rebuttal silenced them all—truly an accomplished scholar!\"* *(As recorded in the *New and Old Tang Books·Confucian Scholars*.)*\n\nAt the start of **Kāiyuán**, the Emperor ordered **Zhōngshū Lìng Zhāng Yuè** to recommend scholars proficient in the *Yì*, *Lǎozǐ*, and *Zhūangzǐ*. **Jìxián Zhíxuéshì Hóu Xíngguǒ** recommended **Kuàijī Kāng Zǐyuán** of **Kuàijī** and **Píngyáng Jìng Huìzhēn** to Zhāng Yuè, who submitted them. Both were granted **sìdú** (attendance in lectures) and soon also served as **Jìxián Shìjiàng Xuéshì** (lecturers at the Hall of Accumulated Worth). Initially, **Xíngguǒ**, **Huìzhēn**, and **Chánglè Fēng Zhāoyǐn** lectured together. Zhāoyǐn excelled in expounding the **hidden meanings of Lǎozǐ and Zhūangzǐ**, while Huìzhēn was also skilled in *Lǎozǐ*. Before each lecture, he would **purify himself with incense and water** before reading. *(As recorded in the *New Tang Book·Confucian Scholars*.)*\n\n**Zhāng Xuānmíng**, in his youth, studied Confucianism in **Hénuò**. Later, he became a Daoist, mastering the teachings of **Lǎozǐ and Zhūangzǔ**. The **Jìn Gāozǔ** summoned him and asked whether Daoist methods could govern a nation. He replied: *\"The Dao is the subtle principle of all things, expressed in words. Those who grasp its utmost can govern the realm even while seated at home.\"* The Emperor admired his words, invited him into the **inner palace**, and lectured with him on the *Dàodéjīng*. He was then appointed as his teacher and granted the title **Tōng Xuān Xiānsheng** (Master of Penetrating Mystery), though his later fate is unknown. *(As recorded in the *Wǔdài Shǐ·Yīxíng Transmission*.)*\n\nEmperor **Tàizōng** heard that officials in the **Biànshuǐ** region were secretly selling state grain for private profit. He told his attendants: *\"The imperial gate is like a rat’s hole—how can one block it entirely? Only by removing the most corrupt can it be managed.\"*",
      "overlap_context": "è) and questioned him about his methods. He answered: *\"Pursuing the Dao requires daily **self-cultivation** (rǎn), diminishing one’s self further and further until reaching **non-action** (wúwéi).*\n\n*Even the perceptions of the mind and eyes must be reduced, yet they cannot fully cease. How much more so when one delves into heterodox theories and amplifies one’s clever schemes!\"*\n\nThe emperor said: *\"Your words apply to cultivating oneself, but how would they guide the governance of a nation?\"*",
      "start_char": 2046,
      "end_char": 3310,
      "start_sentence": 56,
      "end_sentence": 97,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 23.46205973625183,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经集注杂说.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "篙工楫师苟有贩鬻，但无妨公，不必究问。 冀官物之入，无至损折可矣。 吕蒙正曰：水至清则无鱼，人至察则无徒，小人情伪，在君子岂不知之，若以大度兼容，则万事兼济。 曹参不扰狱市者，以其兼受善恶。 穷之则奸慝无所容，谨勿扰也。 圣言所发，正合黄老之道。 见《国朝事实》。 了斋陈忠肃公瓘尝着书二十余篇，曰《昭语》，其序略云：玉清昭应宫使王曾请校三馆道经，上因言其书不如老氏五千言清静而简约，张知白曰：陛下留意于此，乃治国无为之术，臣伏读神考圣训曰：汉之文景，唐之太宗，孔子所谓吾无间然者。 臣因考三君之行事，知汉文之术，得於老子，而仁祖之政多似汉文，今摭其说十数篇录于后。 汉文即位之始，先报平勃，后封宋昌，以有功於社稷为先，以有德於我身为后，此所谓后其身也，故天下莫得先焉。 老子曰：后其身而身先 汉文每朝，郎从官上书疏，未尝不止辇受其言，言不可用置之，言可用采之，未尝不称善。 言之可用者称善，不可用者亦称善，此所谓善者吾善之，不善者吾亦善之，故德善也。 汉文初登虎圈，啬夫口对无穷，拜为上林令。 释之曰：周勃、张相如，陛下称为长者，此两人言事曾不出口，岂效此啬夫喋喋利口捷给哉。 且秦以任刀笔之吏，争以亟疾苛察相高，其弊徒文具而无实，不闻其过，陵迟至於败乱，今以啬夫口辩而超迁之，臣恐天下随风而靡，争为口辩而无其实。 夫下之化上，疾於影响，举错不可不审也。 帝曰：善，乃不拜啬夫。 盖知辩者不善而多言之数穷也。 老子曰：知者不言，言者不知，又曰：善者不辩，辩者不善。 又曰：多言数穷，不如守中。 汉文诏曰：朝有诽谤之木，所以通治道而来谏也，今法有诽谤妖言之罪，是使众臣不敢尽情，而上无由闻过也，其除之。 故贾谊上书至於引庙谥为言，而文帝嘉纳，可谓无忌讳矣。 民之所以富庶而不贫，其以此乎。 老子曰：天下多忌讳而弥贫。 孝文为尉它亲冢在真定者置守邑，岁时奉祀，召其昆弟尊官厚赐以宠之，尉它於是下令国中，奉诏改号，不敢为帝，此即强之弱之，与之夺之，在我而已矣。 吴王诈病不朝，赐以几杖，张武等受赂，更加赏赐，以愧其心，盖亦取诸此也。 老子曰：将欲歙之，必固张之将欲弱之，必固强之。 将欲废之，必固兴之。 将欲夺之，必固与之。",
      "translated_text": "「The boatmen and ferrymen, if they engage in private trade, should only be prevented from harming public affairs—no need to investigate them further. As for the officials of **Suì** (Suì County), the key is that their supplies reach the granaries without excessive loss or damage.\n\n**Lǚ Móngzhèng** remarked: *\"Water too clear has no fish; people too scrutinizing have no followers. The deceit of lesser men—how could the virtuous not know it? If the ruler embraces broad tolerance, then all matters will be resolved harmoniously.\"* **Cáo Shēn** (Cáo Shēn) did not disturb the markets and prisons, for he accepted both good and evil in equal measure. If one presses too hard, the wicked and corrupt will find no refuge—so be cautious not to provoke them. The Emperor’s words were perfectly aligned with the **Dao of the Yellow Emperor and Lǎozǐ** (Yellow and Old).\n\n*(As recorded in the *Guócháo Shìshì*.)*\n\n**Liáo Zhāi** (Chen Zhongsu), known as **Chén Guàn**, once compiled twenty-plus chapters of writings titled *Zhāoyǔ* (Revealed Words). In its preface, he briefly stated: *\"The **Yùqīng Zhāoyīng Palace** (Palace of Jade Purity’s Responsive Manifestation) sent the official **Wáng Zēng** to request the verification of Daoist scriptures from the **Sānguān** (Three Offices). The Emperor then spoke of how his works were not as refined and concise as Lǎozǐ’s Five Thousand Words. **Zhāng Zhībái** (Zhang Zhongbai) said: *\"Your Majesty’s focus on this is the art of governance through non-action. I have studied the divine teachings of our ancestors, which state: The **Wén** and **Jìng** of the **Hàn**, and the **Tàizōng** of the **Táng**, are what Confucius called ‘those without whom I have no doubt.’ I have examined the deeds of these three rulers and found that the **Hàn Wén**’s methods were derived from Lǎozǐ, while his virtuous and filial policies resembled those of the **Hàn Wén**. Now I excerpt their teachings in ten-odd chapters, recorded hereafter.\"*\n\nAt the beginning of **Hàn Wén**’s reign, he first rewarded **Píng Bó** (Píng Bó) and later ennobled **Sòng Chāng** (Song Chang), prioritizing those who benefited the state over those who served his personal interests. This was the principle of *\"putting others before oneself\"*—thus, none could surpass him in the realm. As Lǎozǐ said: *\"Put others before oneself, and one’s self will come first.\"*\n\nEvery morning, **Hàn Wén** would halt his carriage to receive petitions from the **Láng Cóng** (Láng Cóng) officials. Even if their words were not immediately useful, he would still praise them, and if they were useful, he would adopt them. He praised all suggestions, whether good or not—this was the principle of *\"the virtuous accept all as virtuous, the non-virtuous they also accept as virtuous,\"* and thus his **virtue/power** was universally benevolent.\n\nWhen **Hàn Wén** first ascended the throne, he appointed a **shèifū** (treasurer) who argued endlessly without restraint, promoting him to the **Shànglín Lìng** (Superintendent of Shànglín). **Shì Zhī** (Shì Zhī) protested: *\"**Zhōu Bó** (Zhou Bo) and **Zhāng Xiàngrú** (Zhang Xiangru), whom Your Majesty honors as ‘longzhe’ (noble elders), never spoke so boldly when offering counsel. Would you truly emulate this **shèifū** (treasurer) with his relentless chatter and quick wit, rather than men of true substance? Moreover, the **Qín** (Qin) dynasty entrusted authority to scribes and clerks, who competed in swiftness and severity of judgment. Their flaws were mere empty formalities without real benefit, and when their errors were not heard, the state declined into ruin. Now you elevate this **shèifū** (treasurer) for his mere eloquence, and I fear the world will follow this trend, valuing only glib tongues while neglecting true merit. The influence of the lower ranks upon the higher is swift as an echo—every appointment must be weighed carefully.\"* The Emperor agreed and did not promote the **shèifū** (treasurer). He understood that those skilled in debate were often not truly virtuous, but merely proficient in words.\n\nLǎozǐ said: *\"The wise do not speak; those who speak are not wise.\"* He also said: *\"The virtuous do not debate; those who debate are not virtuous.\"* And again: *\"Much speech leads to exhaustion; better to hold to the center.\"*\n\nThe Emperor decreed: *\"There is a **fěidàng** (slanderous) tree at court, established to allow officials to voice their concerns. Now the law punishes slander and false accusations—this silences the ministers and prevents the ruler from hearing faults. Let this punishment be abolished.\"* Thus, **Jiǎ Yì** (Jia Yi) could submit petitions even to the point of invoking ancestral temples and posthumous titles, and **Hàn Wén** would still accept and praise them. This was truly *\"without taboos\"*—and the people prospered as a result. As Lǎozǐ said: *\"The more taboos a land has, the poorer it becomes.\"*\n\nWhen **Hàn Wén** (Emperor Wén) honored **Yù Tǎ** (Yu Ta), whose ancestral tomb was in **Zhèndìng** (Zhèndìng), he appointed a guardian and commanded regular sacrifices. He summoned **Yù Tǎ**’s brothers, bestowed high offices and lavish gifts upon them to show favor, and **Yù Tǎ** then issued orders across the realm, instructing all to change their names in accordance with the decree and forbidding them to call themselves *\"dì\"* (Emperor). This was the principle of *\"strengthening to weaken, giving to take\"*—the choice lies with the ruler alone.\n\nWhen the **Wú Wáng** (King of Wu) feigned illness to avoid attending court, the Emperor gave him a cane and chair, and **Zhāng Wǔ** (Zhang Wu) and others, having accepted bribes, further increased their rewards to shame him into compliance. This too was drawn from the same principle.\n\nLǎozǐ said: *\"To gather, one must first disperse; to weaken, one must first strengthen. To abolish, one must first establish; to take away, one must first give.\"*",
      "overlap_context": " on the *Dàodéjīng*. He was then appointed as his teacher and granted the title **Tōng Xuān Xiānsheng** (Master of Penetrating Mystery), though his later fate is unknown. *(As recorded in the *Wǔdài Shǐ·Yīxíng Transmission*.)*\n\nEmperor **Tàizōng** heard that officials in the **Biànshuǐ** region were secretly selling state grain for private profit. He told his attendants: *\"The imperial gate is like a rat’s hole—how can one block it entirely? Only by removing the most corrupt can it be managed.\"*",
      "start_char": 3310,
      "end_char": 4209,
      "start_sentence": 98,
      "end_sentence": 127,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 17.86040472984314,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经集注杂说.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "袁盎却慎夫人坐，文帝改怒为喜，厚赏袁盎，可谓自胜而不自是矣。 德之所以彰而国之所以强也。 老子曰：不自是故彰。 又曰：自胜者张。 文帝纳贾谊讥切之言，养臣下以节，不辱大臣，於是堂陛愈高而基本愈固，《易》曰：以贵下贱，大得民也，何以异乎此哉。 老子曰：贵以贱为本，高以下为基。 臣尝谓自三代以降，善治天下者无如孝文，然其术出於老子，故仁祖於老氏也取其简约而神，考之於汉文也，谓无间然。 盖老异於孔而其本则同，汉劣於周而善亦可取，此二圣之所以垂训也。 仁祖皇佑四年谓辅臣曰：朕临御以来，命参知政事多矣，其间忠纯可纪者，蔡齐、鲁宗道、薛奎而已，宰相王曾、张知白皆履行忠谨，虽时有小失，而终无大过。 李迪亦朴忠自守，第言多轻发耳。 庞籍对曰：才难自古然也。 上复曰：朕记其大，不记其小。 臣三复圣训，因考王曾、知白之所以见重於仁祖者，盖能以清静之术助无为之化，所谓大而可纪者，其在兹乎。 审刑院断绝公案，仁宗喜曰：天下至广而断刑若此，有以知刑讼之简，有司无稽迟也。 乃下诏奖法官，而付其事于史官。 臣窃见元丰中开封府狱空，神考大喜，擢知府王安礼为右丞，下至胥吏，悉获赉赏，自是内外有司皆以狱空为悦。 盖仁祖以讼简赏法官而神考以狱空擢府尹，所以示仁民之意一也。 老子曰：民常不畏死，奈何以死惧之，若使民常畏死而为奇者，吾得执而杀之，孰敢。 祖宗不以刑威惧民，盖有得於老氏。 讲《诗》，至《匪风》曰：谁能烹鱼，溉之釜甑。 上曰：老子谓治大国若烹小鲜，其义类此。 侍读丁度对曰：烹鱼烦则碎，治民烦则散，非圣学之深，何以见古人求治之意。 臣曰：古之圣君当大有为之时，或创业或革弊，不免有所烦也。 仁祖以清静无为之道持盈守成，四十二年终始如一，盖得烹鲜之说而躬行之耳。 臣故曰汉文之术出於老子，而仁祖之治多似汉文，神考谓汉文吾无间然，则绍述之意可知也。 韩绛言：林献可遣其子以书抵臣，多斥中外大臣过失，臣不敢不以闻。 上曰：朕不欲留中，恐闻阴讦之路，可持归焚之。 臣曰：老子云：俗人昭昭，我独若昏，俗人察察，我独闷闷，又曰：其政闷闷，其民淳淳，其政察察，其民缺缺。 韩绛以献可之言闻于上，一白一黑，何其昭昭也。 仁祖恐开阴讦之路，拒而不受，圣人之虑深矣远矣。 昏昏然不可见，闷闷然不可识，此圣人之所以为圣人，而其民之所以淳淳也。 通判并州司马光上疏，请於宗室中择人摄居储贰。 臣曰：唐中叶以来，人主恶闻立嗣，以为不祥之语，故天下之士於国家安危之本不敢正言，司马光以疏远之臣，言此而不隐，仁祖春秋高矣，受此言而不讳，老子曰：受国不祥，是为天下王，仁祖有之。 又曰：信言不美，司马光有之。 陈忠肃公曰：老子言天下神器不可为也，为者败之，又言治大国若烹小鲜，夫烹鱼者无所事於烦之也，制水火之齐以熟之而已，舜无为而治，其不以此欤。 又曰：武帝黜黄老而用儒术，未尝不本於仁义，而观其实效，则不异於始皇者几希，当此之时，天下不一日而无事，思慕文景不得复得，然则黄老亦何负於天下哉。 又曰：疏广谓受曰：知足不辱，知止不殆，宦成名立而不去，惧有后悔，於是父子相随移病而归，当时贤之，后世追诵，然其知止之意，发於老氏。",
      "translated_text": "The **Emperor Wéndì** withdrew his anger upon seeing **Yuàn Àn** seat **Shèn Fūren**, turning his displeasure into joy, and lavished **Yuàn Àn** with rich rewards—truly one who conquers himself without boasting of it. This is how virtue shines and the realm grows strong.\n\nLǎozǐ said: *\"Not boasting, thus it shines.\"* And again: *\"The self-conquered expand.\"*\n\nWhen the **Emperor Wéndì** accepted **Jiā Yù’s** sharp and cutting words, he governed his ministers with restraint, never dishonoring the great officials. Thus, the palace steps grew ever higher and the foundations ever firmer. The *Yì* says: *\"To honor the lowly over the noble is to greatly win the people.\"* How different is this?\n\nLǎozǐ said: *\"The noble takes the lowly as root; the high takes the low as foundation.\"*\n\nI have often said that since the Three Dynasties, no ruler governed the world as well as the **Emperor Xiàowén**, yet his methods came from Lǎozǐ. Thus, the **Emperor Rénzǔ** revered the **Lǎozǐ** tradition for its simplicity and profundity. Examining it through the **Han Wén** model, I find no gap between them.\n\nThough **Lǎozǐ** differed from **Kǒngzǐ**, their essence was the same. Though **Hàn** was inferior to **Zhōu**, its virtues were still worthy of adoption—this is why the two sages left enduring lessons.\n\nIn the fourth year of **Rénzǔ’s** reign, he told his ministers: *\"Since I ascended the throne, I have appointed many **Cānzhī Zhìzhèng** (Chancellors and Deputy Chancellors). Among them, only **Cài Qí, Lǔ Zōngdào, and Xuē Kuí** were truly loyal and worthy of record. The Chancellors **Wáng Zēng** and **Zhāng Zhībái**, though occasionally making minor mistakes, never committed grave faults. **Lǐ Dí** was also upright and steadfast, though his words were often spoken too lightly.\"*\n\n**Páng Jiè** replied: *\"Great talent has always been rare.\"*\n\nThe Emperor said: *\"I remember their great virtues, not their small failings.\"*\n\nReflecting on these words, I examined why **Wáng Zēng** and **Zhāng Zhībái** were held in such high regard by **Rénzǔ**—it was because they aided the **Wuwei** (non-action) governance with the **Qīngjìng** (tranquil and serene) method. This, perhaps, was what was truly memorable.\n\nWhen the **Shěnxíng Yuàn** (Criminal Investigation Bureau) resolved all pending cases, **Rénzǔ** rejoiced: *\"Though the realm is vast, the cases are settled thus—this shows how simple litigation is and how officials no longer delay.\"* He then issued an edict praising the judges and entrusted the matter to the **Shǐguān** (historiographical officials).\n\nI observed that during the **Yuánfēng** era, the **Kāifēng Fǔ** prison was empty, and the late **Shénkǎo** (Emperor Shenzong) greatly rejoiced, promoting **Wáng Ānlǐ**—the Prefect of **Kāifēng**—to **Yòuchéng** (Right Chancellor). Even the lowly clerks received rewards. From then on, officials across the empire took an empty prison as a cause for celebration.\n\nThe **Emperor Rénzǔ** rewarded judges for simple litigation, while the **Emperor Shénkǎo** promoted officials for empty prisons—both demonstrated the same intent of benevolent governance toward the people.\n\nLǎozǐ said: *\"The people do not ordinarily fear death. How can you terrify them with death? If you make the people constantly fear death, then those who act strangely, I can seize and kill—who would dare?\"* The ancestors did not use penal threats to frighten the people; they understood **Lǎozǐ’s** teachings well.\n\nWhile lecturing on the *Shījīng*, upon reaching *\"Fěifēng\"* (The Zephyr), the Emperor said: *\"Lǎozǐ spoke of governing a great state as if boiling a small fish—its meaning aligns with this.\"*\n\n**Shìdú Dīng Dù** replied: *\"Boiling fish too much makes it break apart; governing the people too much scatters them. Without profound wisdom, how could one grasp the ancients’ intent for governance?\"*\n\nI said: *\"In times when the sage-rulers had great undertakings—whether founding a dynasty or reforming corruption—some busyness was unavoidable. The **Emperor Rénzǔ**, however, upheld the **Qīngjìng-Wúwéi** (tranquil and non-action) Dao, remaining consistent for forty-two years. He truly embodied the principle of boiling fish gently and practiced it himself.\"*\n\nThus, I say that **Emperor Wén’s** methods came from **Lǎozǐ**, and **Emperor Rénzǔ’s** governance resembled **Emperor Wén’s** in many ways. When the **Emperor Shénkǎo** said that **Emperor Wén** was without flaw, his intention to follow and continue was clear.\n\n**Hán Rào** reported: *\"Lín Xiànkě sent his son with a letter to me, criticizing many faults of the officials inside and outside the court. I dared not withhold it from Your Majesty.\"*\n\nThe Emperor said: *\"I do not wish to suppress it, but I fear it would open the path for slander. You may take it home and burn it.\"*\n\nI said: *\"Lǎozǐ said: ‘While the common people are bright and clear, I alone seem confused. While the common people are sharp and discerning, I alone am muddled.’ And again: ‘When governance is muddled, the people are pure. When governance is sharp, the people are depleted.’ **Hán Rào**, by reporting **Lín Xiànkě’s** words, presented both black and white—how bright and clear it is! The **Emperor Rénzǔ**, fearing to open the path of slander, rejected it. The sage’s foresight was profound and far-reaching.*\n\n*\"To be muddled and unseen, to be obscured and unrecognized—this is how the sage becomes sage, and why the people remain pure.\"*\n\nWhen **Sīmǎ Guāng**, the **Tōngpàn** (Deputy Governor) of **Bìngzhōu**, submitted a memorial requesting the selection of a successor from the royal clan to serve as heir-apparent, I said: *\"Since the mid-Tang, rulers disliked hearing discussions of establishing an heir, fearing it an omen of misfortune. Thus, scholars across the land dared not speak frankly about the foundation of the state’s security. **Sīmǎ Guāng**, though a distant official, spoke openly without concealment. The **Emperor Rénzǔ**, in his later years, received this advice without evasion. Lǎozǐ said: ‘To receive the Mandate of Heaven is not auspicious—this is how one becomes the King of the World.’ The **Emperor Rénzǔ** possessed this virtue. And again: ‘Faithful words are not beautiful.’ **Sīmǎ Guāng** embodied this too.\"*\n\n**Chén Zhōngsù Gōng** said: *\"Lǎozǐ spoke of the Mandate of Heaven as something divine that should not be seized, for those who seize it ruin it. He also said governing a great state is like boiling a small fish—yet the one who boils fish does nothing but regulate the fire and water to cook it properly. **Shùn** governed without action—was this not his meaning?\"*\n\n*\"The **Emperor Wǔdì** abandoned **Huánglǎo** (Yellow Emperor-Laozi teachings) and adopted Confucianism, yet never strayed from benevolence and righteousness. Observing his actual results, however, he differed little from **Qín Shǐhuáng**. At that time, the realm was never without turmoil, and though people longed to emulate **Wén** and **Jǐng**, they could not. Thus, what fault did **Huánglǎo** truly have toward the world?\"*\n\n*\"**Cú Guǎng** told his son **Shòu**: ‘Knowing contentment brings no disgrace; knowing when to stop brings no peril. When one’s official career is complete and reputation established, yet one does not depart, fearing future regret, then father and son may follow each other in feigning illness and returning home. The people of their time praised them, and later generations have sung their praises. Yet their intent to ‘know when to stop’ came from **Lǎozǐ’s** teachings.\"*",
      "overlap_context": "ng to take\"*—the choice lies with the ruler alone.\n\nWhen the **Wú Wáng** (King of Wu) feigned illness to avoid attending court, the Emperor gave him a cane and chair, and **Zhāng Wǔ** (Zhang Wu) and others, having accepted bribes, further increased their rewards to shame him into compliance. This too was drawn from the same principle.\n\nLǎozǐ said: *\"To gather, one must first disperse; to weaken, one must first strengthen. To abolish, one must first establish; to take away, one must first give.\"*",
      "start_char": 4210,
      "end_char": 5482,
      "start_sentence": 128,
      "end_sentence": 164,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 21.24385690689087,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经集注杂说.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "并见《了斋集》。 欧阳文忠公修曰：前后之相随，长短之相形，推而广之，万物之理皆然也。 然老子为书，其言虽若虚无，而於治人之桁至矣。 又曰：道家者流，本清虚，去健羡，泊然自守，故曰我无为而民自化，我好静而民自正，虽圣人南面之治，不可易也。 并见本集。 颖滨苏文定公曰：得侄迈等所编先公手泽，其一曰：昨日子由寄《老子新解》，读之不尽卷，废卷而叹：使战国有此书，则孔老为一。 使晋宋间有此书，则佛老不为二。 不意老年见此奇特，然后知此书当子瞻意。 见《道德经解》后序。 又曰：孔子以仁义礼乐治天下，老子绝而弃之，或者以为不同，《易》曰：形而上者谓之道，形而下者谓之器，孔子之虑后世也深，故示人以器而晦其道，使中人以下守其器而不为道之所眩，以不失为君子，而中人以上自是而上达也。 老子则不然，志於明道而急於开人心，故示人以道而薄於器，以为学者惟器之知，则道隐矣。 故绝仁义弃礼乐以明道。 二圣人者，皆不得已也，合於此必略於彼矣。 见经注。 又曰：韩非明老子而以刑名游说诸侯，李斯师孙卿而以诈力事秦，至於焚诗书，杀儒士，其终皆陷於大戮，原其所学，皆本於圣人，而其所施设则乡党之士所不忍为，夫岂其所学有以致之欤。 盖老子、孙卿其教之善，虽弊不至於败乱天下，然则二子之学，其所以失之而至此者何也，学之不详，毫压之差，或致千里。 见《乐城集》。 陆陶山农师曰：自秦以来，性命之学不讲於世，而道德之裂久矣。 世之学者不幸蔽於不该不偏一曲之书，而日汨於传注之卑，以自失其性命之情，不复知天地之大醇，古人之大体也。 予深悲之，以为道德者关尹之所以诚心而问，老子之所以诚意而言，精微之义，要妙之理多有之，而可以启学之蔽，使之复性命之情。 不幸乱於传注之卑，千有余年尚昧，故为作传以发其既昧之意。 虽然，圣人之在下多矣，其着书以道德之意非独老子也，盖约而为老子，详而为列子，又其详为庄子，故予之解述列庄之详，合而论之，庶几不失道德之意。 见经注。 延平先生罗从彦仲素曰：老子之书，孔子未尝誉，亦未尝毁，盖以谓誉之则后世之士溺其和光同尘之说，而流入於不羁，毁之则清静为天下正之论其可毁乎，既不誉又不毁，其可不略言，故止谓窃比於我老彭。 见罗先生《语录》。 或问龟山杨文靖公时曰：说者谓老彭乃老氏与彭籛，非谓彭之寿，而谓之老彭也，然老氏之书果述而不作信而好古乎。 答曰：老氏以自然为宗，谓之不作可也。 见《龟山集》。 龟山曰：私意去尽然后可以应世，老子曰：公乃王。 见《语录》。 荣阳吕公希哲尝大书治人事天莫若啬於前坐壁上，云：修养家以此为养生要术，然事事保谨，常令有余，持身保家安邦之道不越於此，不止养生也。 见《口国氏杂录》。 王子韶圣美言：庄子不能窥测列子，列子不能窥测老子。 荣阳公答云：庄子而不能窥测列子，则孰能窥测列子。 列子而不能窥测老子，则孰能窥测老子。 故善窥测列子者莫如庄子，善窥测老子者，莫如列子。 见吕氏《师友杂志》。 司马温公与王介甫书云：光昔者从介甫游，介甫於诸书无不观，而特好孟子与老子之言，今得君得位而行其道，是宜先其所美，必不先其所不美也。",
      "translated_text": "The *Daoist* texts are also found in *Liáo Zhāi Jí*.\n\nOuyang Xiu, the Duke of Wenzhong, remarked:\n*\"The succession of before and after, the contrast of length and shortness—when extended broadly, this is the principle of all things. Yet Laozi’s writings, though seemingly void, are supremely profound in governing the people.\"*\n\nHe further said:\n*\"The Daoist school originates from purity and emptiness, discarding ambition and desire, maintaining a tranquil self-guard. Thus it says: ‘If I do nothing, the people transform themselves; if I love stillness, the people align themselves.’ Even the Sage’s governance from the throne cannot surpass this. Also found in his own collection.\"*\n\nSu Shi, the Duke of Yibin, said:\n*\"Upon receiving my nephew Mai’s compilation of my father’s handwritten works, one entry read: ‘Yesterday, Ziyou sent *Laozi’s New Interpretation*. I read it without finishing, then set it aside and sighed: If this book had existed in the Warring States, Confucius and Laozi would have been one. If it had existed in the Jin and Song dynasties, Buddhism and Daoism would not have been two.’ I never expected, in my old age, to encounter such a marvelous work—only then did I realize this book must have been intended for Zizhan.\"* (From the *Postscript to the Explanation of the Dao De Jing*.)\n\nHe further said:\n*\"Confucius governed the world with *rén* (benevolence), *yì* (righteousness), *lǐ* (ritual), and *yuè* (music), while Laozi rejected and abandoned them. Some may think they differ, but the *Yijing* says: ‘That which is above form is called the Dao; that which is below form is called *qi* (instrumentality).’ Confucius, foresighted for posterity, demonstrated *qi* to the people while concealing the Dao, so that mediocre individuals would cling to *qi* without being dazzled by the Dao, thus not losing their way as *junzi* (noble ones), while the superior would naturally ascend. Laozi, however, aimed to illuminate the Dao and urgently open the minds of people, thus emphasizing the Dao while neglecting *qi*, believing that if scholars only knew *qi*, the Dao would remain hidden. Therefore, he rejected benevolence and righteousness, abandoned ritual and music, to illuminate the Dao. These two Sages acted out of necessity—uniting in one meant neglecting the other.\"* (From the *Commentary on the Classic*.)\n\nHe further said:\n*\"Han Fei expounded Laozi’s teachings and used legalist rhetoric to persuade the feudal lords, while Li Si studied Xunzi and served Qin with deceit and force, culminating in the burning of books and the slaughter of Confucian scholars. Yet both met great calamity in the end. Their learning originated from the Sages, but their actions were what even common villagers would refuse to do. Could their learning truly have led them to this? Laozi and Xunzi’s teachings, though flawed, did not descend into chaos. Then why did these two men stray so far? A slight deviation in study—even a hair’s breadth—can lead to a thousand *li* of error.\"* (From *Lèchéng Jí*.)\n\nLü Dongshan, Master Tao, said:\n*\"Since Qin, the study of *xìngmìng* (nature and fate) has been neglected, and the division of *Dao* and *dé* (virtue/power) has long endured. Scholars, alas, are misled by one-sided, narrow interpretations, drowning daily in the vulgarity of commentaries, losing their innate nature and fate, unaware of the vast purity of Heaven and Earth or the grand framework of antiquity. I deeply lament this, believing that *Dao* and *dé* are what Guan Yin sincerely questioned and Laozi sincerely spoke of—containing profound and subtle truths that can awaken scholars from their ignorance, restoring their innate nature and fate. Unfortunately, obscured by vulgar commentaries for over a thousand years, their meaning remains dim. Thus, I composed this commentary to illuminate what was lost. Still, many Sages have existed in obscurity, and Laozi’s writings on *Dao* and *dé* were not unique—briefly expressed in Laozi, elaborated in *Liezi*, and further detailed in *Zhuangzi*. Therefore, my interpretations of *Liezi* and *Zhuangzi*, when combined, may not stray from the essence of *Dao* and *dé*.\"* (From the *Commentary on the Classic*.)\n\nLuó Cóngyán, Master of Yanping, said:\n*\"Laozi’s book was neither praised nor criticized by Confucius, for praising it would have led later scholars to indulge in his ‘harmonizing with the dust’ teachings, descending into licentiousness, while criticizing it would have dismissed ‘tranquility as the foundation of governance’—which could not be condemned. Since neither praise nor criticism was given, he could not remain silent, thus merely saying: ‘I compare him to my old friend Peng.’\"* (From *Luó Shī’s Yùlù*.)\n\nWhen asked, Yang Shoujing, the Duke of Guishan, replied:\n*\"Some say ‘Lao Peng’ refers to Laozi and Peng Zu, not Peng’s longevity, but rather ‘the aged Peng.’ But did Laozi truly record without creating, believing and loving antiquity?\"*\nHe answered: *\"Laozi took *zìrán* (naturalness) as his foundation, so calling it ‘uncreated’ is acceptable.\"* (From *Guishan Jí*.)\n\nGuishan further said:\n*\"Only when all selfishness is removed can one respond to the world. Laozi said: ‘The public becomes the king.’\"* (From *Yùlù*.)\n\nLü Xizhe of Rongyang once inscribed on the wall before him: *\"In governing people and serving Heaven, nothing surpasses frugality.\"* He said: *\"Scholars of cultivation consider this the essential method for nurturing life, but frugality in all matters—always maintaining surplus—is the way to preserve oneself, one’s family, and the state.\"* (From *Kǒuguó Shì Zálù*.)\n\nWang Zishun, Saintly Beauty, said:\n*\"Zhuangzi could not fathom Liezi, and Liezi could not fathom Laozi.\"*\n\nThe Duke of Rongyang replied:\n*\"If Zhuangzi could not fathom Liezi, who could? If Liezi could not fathom Laozi, who could? Thus, none surpassed Zhuangzi in understanding Liezi, and none surpassed Liezi in understanding Laozi.\"* (From *Lǚ Shì’s Shīyǒu Zázhì*.)\n\nSima Guang wrote to Wang Anshi:\n*\"In the past, I followed you in your studies. You read all the books, yet particularly favored the words of Mencius and Laozi. Now that you hold power and implement your Dao, you should prioritize what you admire—you would not prioritize what you do not.\"*",
      "overlap_context": "have toward the world?\"*\n\n*\"**Cú Guǎng** told his son **Shòu**: ‘Knowing contentment brings no disgrace; knowing when to stop brings no peril. When one’s official career is complete and reputation established, yet one does not depart, fearing future regret, then father and son may follow each other in feigning illness and returning home. The people of their time praised them, and later generations have sung their praises. Yet their intent to ‘know when to stop’ came from **Lǎozǐ’s** teachings.\"*",
      "start_char": 5482,
      "end_char": 6741,
      "start_sentence": 165,
      "end_sentence": 202,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 20.677666187286377,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经集注杂说.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "孟子曰：仁义而已矣，何必曰利。 又曰：为民父母，使民眄眄然将终岁勤动，不得以养其父母，又称贷而益之，恶在其为民父母也。 今介甫为政，首建制置条例司，大讲财利之事，又命薛向行均输法於江淮，欲尽夺商贾之利，又分遣使者散青苗钱於天下，而收其息，使人愁痛，父子不相见，兄弟妻子离散，此岂孟子之志乎。 老子曰：天下神器不可为也，为者败之，执者失之，又曰：我无为而民自化，我好静而民自正，我无事而民自富，我无欲而民自朴，又曰：治大国若烹小鲜。 今介甫为政，尽变更祖宗旧法，先者后之，上者下之，右者左之，左者右之，成者毁之，矻矻焉穷日力，继之以夜而不得息，使上自朝廷，下及田野，无一人得袭故而守常者，纷纷扰扰，莫安其居，此岂老氏之志乎。 温公自号迂叟，尝着书曰《迂书》，内老释一章云：或问老释有取乎，迂叟曰：有。 或曰：何取。 曰：释取其空，老取其无为自然。 又云：学黄老者以心如死灰，形如槁木为无为，迂叟以为不然，作《无为赞》，治心以正，保躬以静，进退有义，得失有命，守道在己，成功则天，夫复何为，莫非自然。 并见温公《传家集》。 李卫公德裕谏敬宗搜访道士疏曰：臣闻道之高者，莫若广成、玄元，人之圣者，莫若轩皇、孔子。 昔轩皇问广成子理身之要，广成子云：无视无听，抱神以静，形将自正，神将自清，无劳子形，无播子精，乃可长生。 又云：得吾道者上为皇，下为王。 玄元语孔子云：去子之骄气与多欲，态色与淫志，是皆无益於子之身，五口所告子者是已，故轩皇发谓天之叹，孔子兴犹龙之感，前圣於道不其至乎。 若使广成、玄元混迹而至，语陛下之道，以臣度思，无出於此。 见《李文饶集》。 香山白文公居易曰：夫欲使人情俭朴，时俗清和，莫先於体黄老之道也，其道在乎尚宽简，务俭素，不眩聪察，不役智能而已。 盖善用之者，虽一邑一郡一国，至于天下，皆可以致清静之理焉。 昔宓贱得之，故不下堂而单父之仁化，汲黯得之，故不出阁而东海之政成，曹参得之，故狱市勿扰，齐国大和，汉文得之，故刑罚不用，而天下大理。 其故无他，清静之所致耳。 见白氏《长庆集》。 东坡苏文忠公轼奉诏撰上清储祥宫碑云：臣谨按道家者流，本出於黄帝老子，其道以清静无为为宗，以虚明应物为用，以慈俭不争为行，合於《易》何思何虑，《论语》仁者静寿之说。 自秦汉以来，始用方士言，乃有飞仙变化之术，黄庭大洞之法，太上天真木公金母之琥，天皇太乙紫微北极之祀，下至於丹药奇技符箓小数，皆归於道家。 尝窃论之，黄帝老子之道，本也，方士之言，末也。 又《盖公堂记》云：曹参为齐相，闻胶西盖公善治黄老言，使人请之，用其言而齐大治，其后以其所以治齐者治天下，天下至今称贤焉。 吾为胶西守，知公之为邦人也，求其坟墓子孙而不可得，慨然怀之，师其言，想见其为人。 夫曹参为汉宗臣，而盖公为之师，可谓盛矣。 而史不记其所终，岂非古之至人得道而不死者欤。 并见本集。",
      "translated_text": "Mencius said:\n*\"Ren and righteousness are enough—why must one speak of profit?\"*\nHe also said:\n*\"To be a parent to the people, yet make them toil endlessly throughout the year without means to support their own parents, then lend them money at interest—how can this be called being a parent to the people?\"*\n\nNow, Wang Anshi’s governance begins with establishing the *Chizhi Tiaoli* Bureau, expounding on matters of wealth and profit. He then commands Xue Xiang to implement the *Junyun* tax system in Jiang-Huai, seeking to seize all the merchants’ gains. He dispatches envoys to distribute *qingmiao* loans nationwide, collecting their interest—causing people to grieve, separating fathers from sons, and brothers from wives and children. Is this truly Mencius’ intent?\n\nLaozi said:\n*\"The sacred treasure of the world cannot be acted upon—those who act upon it ruin it; those who grasp it lose it.\"* He also said:\n*\"If I do nothing, the people transform themselves; if I love stillness, the people align themselves; if I undertake no tasks, the people grow wealthy; if I have no desires, the people return to simplicity.\"* And again:\n*\"To govern a great state is like poaching a small fish.\"*\n\nYet Wang Anshi’s governance overturns all ancestral laws—reversing what was first and last, high and low, right and left, and destroying what was already accomplished. He toils tirelessly from dawn to dusk, laboring into the night without rest, leaving no one—from the court to the fields—able to follow old customs or maintain stability. All is in chaos, and none find peace. Is this truly Laozi’s intent?\n\nSima Guang, who styled himself *Youshou* (\"the Detoured Old Man\"), once wrote in his *Youshu* (\"Book of Detours\"):\n*\"Someone asked if my* Old and Recluse *chapter had any meaning. I replied: It does.*\n*‘What meaning?’ they asked.*\n*‘The* Recluse *takes its emptiness; Laozi takes its effortless spontaneity.’*\n*He also wrote: ‘Those who study the Yellow Emperor and Laozi claim to be like dead ashes and withered wood to achieve* wuwei*—but I disagree. In my* Wuwei Zan *(‘Ode to Effortless Action’), one cultivates the heart with rectitude, preserves the body with stillness, advances and retreats with propriety, accepts gain and loss as fate, guards the Dao within oneself, and lets success arise from Heaven. What more is there to do? All is already natural.’\"*\n\nFrom Sima Guang’s *Chuanjia Ji* (\"Transmitted Family Collection\").\n\nLi Deyu, Duke Wei, in his memorial urging Emperor Jingzong to search for Daoist masters, said:\n*\"I have heard that the highest Dao belongs to Guangchengzi and Xuanyuan, while the most sagely among men are Xuanyuan and Confucius. In ancient times, Xuanyuan asked Guangchengzi about the essentials of nurturing life. Guangchengzi replied:\n‘See nothing, hear nothing, embrace the spirit in stillness—then the body will align itself, the spirit will purify itself. Do not weary your form, do not scatter your essence—only then can you attain longevity.’*\n*He also said:\n‘Those who grasp my Dao rule as emperor above or king below.’*\n*Xuanyuan spoke to Confucius:\n‘Abandon your arrogance and excessive desires, your frivolous demeanor and licentious thoughts—for these bring no benefit to your body. The five mouths of your senses warn you of this. Thus, Xuanyuan sighed with the heavens’ lament, and Confucius awoke with the awe of a dragon. The ancient sages’ attainment of the Dao was not so profound?’*\n*If Guangchengzi and Xuanyuan were to appear before you today and speak of the Dao, I dare say nothing surpasses their words.\"*\n\nFrom *Li Wenrao Ji* (\"Collected Works of Li Wenrao\").\n\nBai Xingjian, Master of Xiangshan, said:\n*\"To cultivate simplicity and frugality in the people, and harmony in the times, nothing surpasses embodying the Dao of the Yellow Emperor and Laozi. Their way lies in valuing moderation and simplicity, avoiding dazzling the ears and eyes, and not exhausting the mind and abilities.*\n*Those who wield it skillfully—whether in a single town, prefecture, state, or the world—can achieve the principle of tranquility.*\n*In the past, Mi Jian attained it, so single-handedly transformed Renhua’s governance without leaving his hall. Jin Pi attained it, so accomplished East Sea’s administration without stepping outside his gate. Cao Shen attained it, so markets and lawsuits were undisturbed, and Qi became serene. Emperor Wen of Han attained it, so punishments were unused, and the world found harmony. The reason is simple: tranquility brings order.\"*\n\nFrom Bai’s *Changqing Ji* (\"Collected Works of the Long Regency\").\n\nSu Shi, Master of Dongpo, in response to imperial command, inscribed the *Shangqing Chuxiang* Palace stele:\n*\"I have examined the Daoist tradition, which originates with the Yellow Emperor and Laozi. Its essence is tranquility and effortless action; its practice is clarity and responsiveness; its conduct is compassion and frugality without contention. This aligns with the* Yi Jing’s *‘no thought, no worry’* and the* Analects’* teaching that ‘the virtuous are still and long-lived.’*\n*Since the Qin and Han, Daoists have adopted alchemists’ claims, introducing techniques of flying ascension and transformation—Yellow Court, Great Cavern methods, the* Taishang Tianzhen Mugong Jinmu *elixirs, and worship of the Celestial Sovereign, Taiyi, Ziming, and Beiji. Even minor talismans and spells fall under Daoist practice.*\n*I have reflected: the Dao of the Yellow Emperor and Laozi is the root; the alchemists’ words are the branches.*\n\n*In his* Gaigong Tang Ji *('Record of Gaigong Hall'), he also wrote:\n‘When Cao Shen served as Chancellor of Qi, he heard that Gaigong of Jiaxi excelled in Yellow-Lao teachings. He sent envoys to invite him, and under his guidance, Qi flourished. Later, Cao Shen applied these principles to govern the empire, and to this day, the world praises his virtue.\n*As Jiaxi’s magistrate, I sought his descendants and tomb but found none. Moved, I emulated his words and imagined his character. Cao Shen, a pillar of the Han dynasty, took Gaigong as his teacher—what greater honor could there be? Yet history records nothing of Gaigong’s end. Was he not an ancient sage who attained the Dao and did not die?’\"*\n\nFrom his own *Ji* (\"Collected Works\").",
      "overlap_context": "not fathom Liezi, who could? If Liezi could not fathom Laozi, who could? Thus, none surpassed Zhuangzi in understanding Liezi, and none surpassed Liezi in understanding Laozi.\"* (From *Lǚ Shì’s Shīyǒu Zázhì*.)\n\nSima Guang wrote to Wang Anshi:\n*\"In the past, I followed you in your studies. You read all the books, yet particularly favored the words of Mencius and Laozi. Now that you hold power and implement your Dao, you should prioritize what you admire—you would not prioritize what you do not.\"*",
      "start_char": 6741,
      "end_char": 7903,
      "start_sentence": 203,
      "end_sentence": 231,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 15.932350397109985,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经集注杂说.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "眉山唐庚子西曰：世疑老子西游，以谓有慈有俭有不为夭下先，持是道以游於世，何所不容，而犹有所去就邪，是大不然。 惟其无往而不容，则虽蛮貊之邦行矣，此所以为老氏。 见《眉山集》。 张右史末《老子义》曰：夫人之生，不杀之於衽席饮食之疾病，则杀之盗贼刑戮者过半矣，则人之於死，实未尝知畏也。 而世之驭物者，而欲物之畏，不过示之以死，亦惑矣。 故曰民不畏死奈何以死惧之。 苟畏死邪，则吾取为奇者而杀之，宜民之不复为奇也。 天下未尝无刑，而为奇者不止，则死之不足以惧物也明矣。 故曰若使人畏死而为奇者，吾得执而杀之，孰敢也。 夫物不患无杀之者也，万物泯泯必归於灭尽而后止，则常有司杀者杀矣。 窃司杀者之常理，而移之以行其畏，非徒不足以惧物，而亦有所不及者也。 故曰常有司杀者杀，夫代有司杀，是代大匠断，希有不伤其手矣。 然则操政刑死生之柄，驱一世之民使从之，殆非也。 又曰：惟其无私邪，故能成其私，而惟私之求，则天下去之。 夫惟公以得天下之情者，天下之所归也。 天下之所归，而有不能得其所欲者乎。 又送固始山人张坚序曰：至柔教余以养性之妙，其言曰：大道甚简，守心而已。 守心无他，守一而已。 静一之极，则玄通四达，真气应之，兹非意之所能测，言之所能尽，惟得者知之。 真气来降，则百疾除而永年矣。 老子曰：虚其心，实其腹，弱其志，强其骨，心虚志弱而腹自实，骨自强矣。 是道也，智者得之而为止观，司马子微得之而为坐忘，皆一道也。 此皆真人修身之要，而今人忽之，乃苦其形骸，妄想变怪，吞饵金石，去道远矣。 见本集。 王无咎补之尝解老子道经四章，今取其二篇，其一云：圣人处无为之事，行不言之教，彼无心於为与言者，顺万物性命之理而已，则万物之作也，吾亦与之作而不辞，万物之生也，吾亦与之生而不有，万物之为也，吾亦与之为而不侍，万物之成也，吾亦与之成而不居，盖其作也生也为也成也，皆顺性命自然之理，因物与时，而非我也，则吾亦何必辞，何必有，何必恃，何必居。 故曰万物并作而不辞，生而不有，为而不恃，功成而不居，作然后生，生然后为，为然后成，此其序也。 又云：老子专恶夫多言何也。 老氏之所明者，道也，道常无言，然而常有言者，迫不得已也。 以其迫不得已也，故可以言，以其常无言也，故言之少者去道为尤近，而言之多者去道为尤远，故专恶夫多言也。 见本集。 淮海秦观曰：班固赞司马迁以为是非颇谬於圣人，论大道则先黄老而后六经，孰谓迁之高才博洽而至於是乎。 以臣观之不然，彼实有见而发耳。 孟子曰：仁者人也，合而言之道也。 杨子亦曰：道以导之，德以得之，仁以人之，义以宜之，礼以体之，天也。 合则浑，离则散，盖道德者仁义礼之大全，而仁义礼者道德之一偏，黄老之学贵合而贱离，故以道为本，六经之教，於浑者略，於散者详，故以仁义礼为用。 迁之论大道也，先黄老而后六经，岂非有见於此而发哉。 又曰：史称崔浩自比张良，谓稽古过之，以臣观之，浩曾不及荀、贾，何敢望子房乎。 夫以其精治身，以绪余治天下，功成事遂，奉身而退，道家之流也。",
      "translated_text": "Tang Geng of Meishan’s *Zixi* remarks:\n\n*\"The world doubts that Laozi’s western journey was motivated by compassion, frugality, or avoiding premature death. If one upholds the Dao in the world, where cannot they dwell? Yet still there are departures and arrivals—this is utterly mistaken. Only because the Dao is without a place it cannot enter does it traverse even the most barbaric lands. This is why it is the Dao of Laozi.\"*\n\nFrom *Meishan Ji*.\n\nZhang Youshi’s *Laozi Yi* states:\n\n*\"When people are born, those not killed by illness in bed or by thieves, executions, or punishments already exceed half. Thus, people do not truly fear death. Yet those who govern others wish to make them fear death, relying only on threats of it—how deluded! Therefore it is said: ‘If the people do not fear death, how can you terrify them with death?’ If they truly feared death, then I would seize and kill those who act strangely, and surely none would dare. The issue is not that there are no killers, but that all things, dim and indistinct, inevitably return to annihilation. Thus, there are always those who kill. If one takes the natural order of killing and applies it to instilling fear, it is not only insufficient to terrify others but also fails to reach its mark. Therefore it is said: ‘There are always those who kill. If one replaces those who kill, it is like having a substitute carpenter—few will avoid harming their hands.’ Thus, to wield the power of life and death, driving an age’s people to follow, is surely wrong.*\n\n*Again, it is said: Only because it is without private gain can it fulfill its private purpose, and only when private gain is sought does the world reject it. Only the public can grasp the true nature of the world, and the world will follow. If the world follows, how can one fail to obtain what they desire?*\n\n*In his preface for the *Sequence for Master Zhang of Gushu*, he wrote: The most gentle teaching instructed me on the subtleties of nurturing nature. He said: ‘The Great Dao is most simple—merely preserve the heart. Preserving the heart is nothing else but preserving the One. When the One is perfectly still, the Mysterious flows freely in all directions. True qi responds to it—this cannot be measured by thought or exhausted by speech; only those who attain it know it. When true qi descends, all ailments vanish, and longevity follows. Laozi said: *Empty the heart, fill the belly, weaken the will, strengthen the bones*—when the heart is empty and the will weak, the belly naturally fills, and the bones naturally strengthen. This Dao: the wise attain it and call it *stopping and observing*; Sima Ziqian attained it and called it *sitting in forgetfulness*—both are the same Dao. These are the essentials for the True Person in cultivating the self, yet today’s people neglect them, instead tormenting their bodies, indulging in vain transformations, swallowing elixirs of metal and stone—how distant they are from the Dao!’*\n\nFrom *his Ji*.\n\nWang Wuqiu once expounded on four chapters of the *Laozi Dao Jing*. Here are two:\n\n*\"The Sage acts in non-action, teaches without speech. Those without intent to act or speak merely follow the natural patterns of all things’ life and death. Thus, when all things arise, I too arise without refusal; when all things are born, I too am born without possession; when all things act, I too act without reliance; when all things are completed, I too complete without taking credit. For their arising, their birth, their action, and their completion are all in accordance with the natural patterns of life and death, following things and times without being ‘I.’ Then why must I refuse, why must I possess, why must I rely, why must I take credit? Therefore it is said: ‘All things arise together, yet I do not refuse; they are born, yet I do not possess; they act, yet I do not rely; their deeds are complete, yet I do not take credit. Arise, then be born; be born, then act; act, then complete—this is their order.’*\n\n*Again, it says: Why does Laozi particularly detest excessive speech? What Laozi clarifies is the Dao, which is always without speech. Yet when speech is unavoidable, it is permitted. Because it is unavoidable, speech is allowed; because it is always without speech, those who speak much are farthest from the Dao, and those who speak little are closer. Thus, he particularly detests excessive speech.\"*\n\nFrom *his Ji*.\n\nQin Guan of Huaihai remarked:\n\n*\"Ban Gu praised Sima Qian for his judgments being somewhat contrary to the Sage’s intent, saying that in discussing the Great Dao, he prioritized Yellow-Lao over the Six Classics. Who would have thought that Qian, with his vast talent and erudition, would reach such a conclusion? In my view, this is incorrect—he truly had insight and expressed it. Mencius said: ‘The benevolent is humanity; combined, it is the Dao.’ Yang Zhu also said: ‘The Dao guides them, virtue obtains them, benevolence enters them, righteousness harmonizes them, ritual embodies them—this is Heaven.’ Combined, they are unified; separated, they scatter. Thus, morality and virtue are the complete embodiment of benevolence, righteousness, and ritual, while benevolence, righteousness, and ritual are but one aspect of morality and virtue. Yellow-Lao learning values unity and despises separation, so it takes the Dao as the foundation, while the teachings of the Six Classics are brief on unity and detailed on separation. Thus, it uses benevolence, righteousness, and ritual as applications. When Qian discussed the Great Dao, he prioritized Yellow-Lao over the Six Classics—could this not be his insight expressed?\"*\n\n*Again, it says: \"History records that Cui Hao compared himself to Zhang Liang, claiming his study of antiquity surpassed him. In my view, Hao did not even reach the level of Xun and Jia—how dare he aspire to Zi Fang? For he refined himself through cultivation, and with his remaining energy, governed the world. Having achieved his purpose, he withdrew to preserve himself—this is the lineage of the Daoist school.\"*",
      "overlap_context": "hed. Later, Cao Shen applied these principles to govern the empire, and to this day, the world praises his virtue.\n*As Jiaxi’s magistrate, I sought his descendants and tomb but found none. Moved, I emulated his words and imagined his character. Cao Shen, a pillar of the Han dynasty, took Gaigong as his teacher—what greater honor could there be? Yet history records nothing of Gaigong’s end. Was he not an ancient sage who attained the Dao and did not die?’\"*\n\nFrom his own *Ji* (\"Collected Works\").",
      "start_char": 7904,
      "end_char": 9122,
      "start_sentence": 232,
      "end_sentence": 269,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 13.279298067092896,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经集注杂说.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "观天文，察时变，以辅人事，明於末而不知本，阴阳家之流也。 子房始游下那，受书於圯上老人，终日愿弃人间事，从赤松游，则其术盖出於道家也。 浩精於术数之学，其言荧惑之入秦，彗星之灭晋，与夫兔出后宫，姚兴献女之事，尤异，及黜庄老乃以为矫诬之言，则其术盖出於阴阳而己，此其所以不同也。 并见《淮海集》。 田谏议锡尺木赞序曰：龙之兴也，阶於木也，君之起也，人为阶也。 抑有无位之圣，韬光之贤，以名迹相参，以材能相济，如立明之才，乃仲尼之尺木乎，故能发挥春秋以垂声教也，尹喜之贤，乃老聃之尺木乎，故能询谋道德以贻后世也。 见《咸平集》。 范忠文公镇曰：老子着书二篇，言先天至阴阳相与之际，文简而理备。 见《蜀公集》。 晁文元公迥曰：古今名贤多好读老庄之书，以其无为无事之中，有至美至乐之理也。 又曰：老子曰：五色令人目盲，五音令人耳聋，五味令人口爽，虽圣人矫激太过，而善利之心极於深切，人能不耽耳目之娱，不纵口腹之美，勿问有得，决定无失。 并见《昭德新编》又曰：老子曰：知常曰明，处世之人，止知昼夜是常，而人如故，出世之人以生死为昼夜，又知生死是常而性如故，是以明心坦然，视生死而无肺。 见《耄智余书》。 盱江李泰伯曰：韩退之有言：老者曰孔子吾师之弟子也，佛者曰孔子吾师之弟子也，为孔子者习闻其说，乐其诞而自小也，亦曰吾师亦尝云尔。 佛之说吾不能详，《曾子问》、《老子列传》则有问礼之事，史未足尽信，《礼记》经之属也，亦有妄乎。 见《退居类稿》。 嵩山景迂生晁说之曰：伏羲、文王、周公赞易之后，惟老氏得易之变通屈伸，知柔而贵虚，务应而不得，殷勤以立言，幸乎此书之存也。 又曰：王弼注老子《道德经》二篇，真得老子之学欤，盖严君平《指归》之流也。 其言仁义与礼不能自用，必待道以用之，天地万物各得其一，岂特有功於老子哉。 九百学者，盖不可不知乎此也。 又曰：弼知佳兵者不祥之器，至於战胜以丧礼处之，非老子之言，乃不知常善救人，故无弃人，常善救物，故无弃物，独得诸河上公而古本无有也，赖傅奕能辨之尔。 见本集。 李昭玘曰：鬼谷韩非之书，推本道德，时近玄旨，二子安足知老子哉，其言适中尔。 见《栾静先生集》。 西台毕仲办曰：老子曰：失道而后德，失德而后仁，失仁而后礼，礼者道之华而乱之首也。 夫谓礼为道之华而乱之首，则某所未学。 然礼者固仁义之次，而道德之下也，后人不能以礼治天下，一寓之於法，则法者又礼之次，而仁义之下也。 见本集。 眉山苏籀，颖滨文定公之孙也，记其遗言曰：公为籀讲老子数篇，曰：高於孟子二三等矣。 又曰：言至道无如五千文。 又曰：公老年作诗云：近存八十一章注，从道老聃门下人，盖老而所造益妙，录录者莫测矣。 并见遗言。 道德真经集注杂说卷上竟 道德真经集注杂说卷下 宋鹤林彭耜纂集",
      "translated_text": "Observing celestial phenomena and discerning seasonal changes to aid human affairs—clear in its applications yet ignorant of their roots—this is the lineage of the **Yin-Yang** school.\n\nZhang Liang first wandered to **Xiaona**, receiving scriptures from the **Old Man of the Bridge**, and ultimately wished to abandon worldly affairs to follow **Chi Song**—thus, his methods clearly stem from the **Daoist** school.\n\nCui Hao excelled in the study of **divination and numerology**, his accounts of **Yinghuo’s** entry into Qin, the comet’s extinction of Jin, and matters such as the hare emerging from the rear palace, along with Yao Xing’s offering of a daughter, were most extraordinary. Yet when he dismissed the **Zhuang-Lao** teachings as fabricated, his methods were clearly rooted in **Yin-Yang** alone—this is why they differ.\n\n(All as recorded in the *Huaihai Collection*.)\n\n**Tian Xian** wrote in his preface to the *Precious Wood Inscription*:\n*\"The dragon’s rise begins with wood; the ruler’s ascent begins with the people.\"* Yet there are also **saints without rank** and **virtuous recluses**, blending fame with obscurity, and talent with humility. A man of **Li Ming’s** caliber was Confucius’ **Precious Wood**—thus able to expound the *Spring and Autumn Annals* to establish enduring teachings. **Yin Xi’s** virtue was Laozi’s **Precious Wood**—thus able to inquire into **Dao and virtue** to benefit posterity.\n\n(As seen in the *Xianping Collection*.)\n\n**Fan Zhongwen**, Duke of **Zhen**, remarked:\n*\"Laozi’s two treatises discuss the primordial **Dao** before **Yin-Yang** coalesced—concise in words yet complete in meaning.\"*\n\n(Recorded in the *Shu Gong Collection*.)\n\n**Chao Wenyuan**, Duke **Jiong**, said:\n*\"Many eminent figures, past and present, cherished the books of Laozi and Zhuangzi, for within their **non-action and non-affairs** lies the utmost beauty and joy.\"*\n\nHe further stated:\n*\"Laozi said: ‘Five colors blind the eyes; five tones deafen the ears; five flavors dull the palate.’ Though even sages may overcorrect, their intent is deeply benevolent. If one does not indulge the pleasures of the ears and eyes nor the delights of the mouth and stomach, one need not seek attainment—only avoid loss.\"*\n\n(All as seen in the *Zhaode Xinbian*.)\n\nHe also noted:\n*\"Laozi said: ‘Knowing the constant is clarity.’ Worldly folk see only day and night as constant, yet remain unchanged. Those beyond the world regard life and death as day and night, knowing that life and death are constant while nature remains unchanged. Thus, the mind is clear and serene, viewing life and death without distress.\"*\n\n(Recorded in the *Maozhi Yushu*.)\n\n**Li Tai** of **Xujing** quoted **Han Yu** as saying:\n*\"The Daoists claim, ‘Confucius was my teacher’s disciple,’ and the Buddhists say, ‘Confucius was my teacher’s disciple.’ Those who follow Confucius hear these claims, delight in their absurdity, and mock them, saying, ‘My teacher also said such things.’ I cannot fully grasp the Buddhist teachings, but the *Zengzi Wen* and *Laozi Liezhuan* mention matters of ritual—history cannot be fully trusted, and the *Records of Ritual* are not without fabrication.\"*\n\n(As seen in the *Tuiju Leicao*.)\n\n**Jiao Sayu**, a recluse of **Songshan**, remarked:\n*\"After Fu Xi, King Wen, and the Duke of Zhou expounded the *Yijing*, only Laozi mastered its flexible transformations—knowing softness yet valuing emptiness, striving to respond yet unable to grasp it. His earnest words are fortunate to have been preserved.\"*\n\nHe further said:\n*\"Wang Bi’s commentary on Laozi’s *Daode Jing* truly captures Laozi’s teachings—akin to **Yan Junping’s** *Zhigui* in its precision. His claim that **benevolence, righteousness, and ritual** cannot stand alone but require the **Dao** to function is not merely beneficial to Laozi—it is essential knowledge for the nine hundred scholars.\"*\n\nHe also noted:\n*\"Wang Bi understood that ‘fine weapons are ill-omened,’ yet his interpretation of ‘treating victory with funeral rites’ was not Laozi’s own but rather **Riverbank Master’s**—the ancient text lacked this, thanks to **Fu Yi’s** discernment for its correction.\"*\n\n(As recorded in his own collection.)\n\n**Li Zhaoquan** stated:\n*\"The books of **Ghost Valley** and **Han Fei** trace back to **Dao and virtue**, yet their timing aligns with **mystical profundity**. How could these two truly comprehend Laozi? Their words merely hit the mark.\"*\n\n(As seen in the *Luan Jing’s Collection*.)\n\n**Bi Zhongban**, of **Xitai**, remarked:\n*\"Laozi said: ‘Lose the **Dao**, then **virtue**; lose **virtue**, then **benevolence**; lose **benevolence**, then **ritual**—ritual is the **Dao’s** adornment yet the source of chaos.’ To call ritual the **Dao’s** adornment and the origin of chaos is beyond my understanding. Yet ritual is indeed secondary to **benevolence and righteousness**, and inferior to **Dao and virtue**. Later generations, unable to govern with ritual alone, entrusted it to **law**—which is again secondary to ritual, and inferior to **benevolence and righteousness.**\"*\n\n(As recorded in his own collection.)\n\n**Su Xu** of **Meishan**, grandson of **Wendefeng**, recorded his grandfather’s last words:\n*\"The Master lectured me on several chapters of Laozi, saying: ‘He surpasses Mencius by two or three levels.’*\n*He also said: ‘No text surpasses the Five Thousand Words in speaking of the **Great Dao**.’*\n*In his old age, the Master composed poetry:\n‘I have preserved eighty-one chapters of commentary,\nA disciple of Laozi’s **Old Plum** school.\nAs age deepens, my craft grows refined—\nThe ordinary cannot fathom it.’\"*\n\n(As recorded in his last words.)\n\n---\n**Miscellaneous Commentaries on the *Collected Annotations of the Dao-De Jing***\n*Compiled by Song’s Peng Zhi of **Huelin**.*",
      "overlap_context": "tized Yellow-Lao over the Six Classics—could this not be his insight expressed?\"*\n\n*Again, it says: \"History records that Cui Hao compared himself to Zhang Liang, claiming his study of antiquity surpassed him. In my view, Hao did not even reach the level of Xun and Jia—how dare he aspire to Zi Fang? For he refined himself through cultivation, and with his remaining energy, governed the world. Having achieved his purpose, he withdrew to preserve himself—this is the lineage of the Daoist school.\"*",
      "start_char": 9122,
      "end_char": 10264,
      "start_sentence": 270,
      "end_sentence": 304,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 16.966773986816406,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经集注杂说.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "唐高宗乾封元年二月己未，次亳州，幸老君庙，追号曰太上玄元皇帝。 玄宗天宝二年正月景辰，追号玄元皇帝为大圣祖，圣祖父周上御史大夫敬曰先天太上皇，母益寿氏，号先天太后。 又天宝十四载十月甲午，颁御注《老子》并《义疏》於天下。 又天宝中加号老子《玄通道德经》，世不称之。 见《新唐书·艺文志》。 大中祥符六年八月庚午，诏加老君号曰太上老君混元上德皇帝，次年春正月壬寅，上发东京，丙午，至真源县，戊申，命宰臣王旦奉上册宝，己酉，朝谒太清宫，见《九庙通略》。 景德二年二月，国子监直讲孙奭言，诸子之书，老庄称首，其道清虚，以自守卑弱，以自持逍逼无为，养生济物，皆圣人南面之术也。 故先儒论撰以次诸经，唐陆德明撰《经典释文》三十卷，内《老子释文》三卷，今诸经及《老子释文》共二十七卷，并已雕印颁行，惟阙《庄子释文》三卷，欲请依《道德经》例，差官校定雕印，诏可。 见《国朝会要》。 天禧三年，天书降，乾佑山中知兖州孙奭上疏曰：朱能小人妄言符瑞，昔唐明皇得灵宝上清护国经宝券，皆王鉷、田同秀等所为。 夫老君圣人降语，固宜不妄，而唐自安史乱离，两都荡覆，岂天下太平乎。 明皇仅得归阙，复为辅国劫迁，卒以馁死，山豆圣寿无疆，长生久视乎。 明皇既惑左道，即紊政经，民心用离，变起仓卒，愿陛下鉴明皇之召祸，庶几灾害不生，祸乱不作也。 见《九朝通略》。 方腊乱浙右，声摇京师，中书舍人程振谓太宰王黼言，宜乘此时言天下弊事，庶几少革，以顺人心。 黼不悦，时振兼太子舍人，至束宫太子问焉，振曰：周公作《鸱鸮》之诗，孔子以为知道，其言不过迨天之未阴雨，调缪牖户而已。 老子亦曰为之於未有，治之於未乱，盖老氏与孔子合者如此，今不固根本於无事之时，而徒争目前之功，非二圣人意也。 见《九朝通略》并《东都事略》本传。 李忠定公纲政和六年时，为比部员外郎，因奏对乞解易札子，略曰：共惟陛下天纵睿智，辅之以缉熙光明之学，体元用妙，该极象数，万机之暇，训释老庄之书，以开悟天下之学者，辞旨高妙，足以发难言之意，而道德性命之理灿如也。 夫《易》无思也无为也，寂然不动，感而遂通天下之故，实与老庄之书相为终始。 臣愚伏望断自宸衷，为之训释，以通神明之德，以发乾坤之蕴。 又题李伯时画老子出关图诗云：请说常无众妙门，当时关尹意何勤。 青牛西去连沙漠，紫气东来见瑞氛。 妙用不离三十辐，至言都在五千文。 世人不解宗慈俭，只欲长生蹑白云。 并见《梁溪集》。 伊川先生程颐曰：道家之说，更没可辟，唯释氏之说衍蔓迷溺至深。 又曰：庄生形容道体之语，尽有好处，老氏谷神不死一章，最佳。 并见程氏遗书。 胡文定公安国曰：老氏五千言，如我无事、我好静、我有三宝之说，亦皆至论也。 见《语录》。 溪堂谢逸寿亭记曰：孔子所谓仁者寿，老子所谓死而不亡者寿，释氏所谓无量寿，三圣人者，其言虽异，其意则同。 盖仁者尽性，尽性则死而不亡，死而不亡，则其寿岂有量哉。 彼徒见发毛爪齿归於地，涕唾津液归於水，暖气归火，动转归风，而以为其人真死矣，然不知湛然常存未尝死也。",
      "translated_text": "**Miscellaneous Commentaries on the *Collected Annotations of the Dao-De Jing***\n*Compiled by Song’s Peng Zhi of **Huelin**.*\n\n---\n\nDuring the **Qianfeng** era of the **Tang High宗** (Emperor Gaozong), in the second month of the first year (on the day *jiwu*), the Emperor visited **Laozi’s Temple** in **Bozhou** and posthumously bestowed upon him the title **太上玄元皇帝** (Supreme Primordial Sovereign Emperor).\n\nDuring the **Tianbao** era of the **Tang Xuanzong** (Emperor Xuanzong), in the first month of the second year (on the day *jingchen*), the Emperor posthumously honored **Laozi** as **大圣祖** (Great Holy Ancestor), and **Laozi’s father**, **Zhou Shang Gongshi** (Grand Marshal of Zhou), as **先天太上皇** (Primordial Supreme Emperor). His mother, **Ben Shou Shi**, was honored as **先天太后** (Primordial Empress Dowager).\n\nIn the tenth month of the **fourteenth year of Tianbao**, the Emperor issued imperial commentaries on *Laozi* (*Laozi’s Text*) as well as the *Yishu* (Explanatory Commentary) across the land.\n\nAdditionally, during the **Tianbao** era, the Emperor added the title **《玄通道德经》** (Mysterious and Penetrating Dao-De Jing) to *Laozi*, though this title was not widely adopted. (As recorded in the *New Book of Tang · Arts and Literature Register*.)\n\nIn the **sixth year of Da Zhong Xiangfu**, during the eighth month (on the day *gengwu*), an imperial decree added **Laozi’s title** as **太上老君混元上德皇帝** (Supreme Primordial Lord of the Dao, the Ultimate Emperor of Highest Virtue). The following spring, in the first month (on the day *renyin*), the Emperor departed **Eastern Capital (Dongjing)**, and on the third month (on the day *bingwu*), arrived at **Zhenyuan County**. On the fifth month (on the day *wushen*), he ordered the Chancellor **Wang Dan** to present the imperial seal and title, and on the sixth month (on the day *jiyou*), he paid homage at **Ta Qing Palace**. (As recorded in the *Nine Dynasties’ Temple Regulations*.)\n\nIn the **second year of Jingde**, the **National University’s** (Guozijian) **Senior Lecturer Sun Xi** stated:\n*\"Among the books of the various schools, Laozi and Zhuangzi are ranked first. Their teachings emphasize the clarity and emptiness of the Dao, advocating humility and weakness to preserve oneself, and effortless ease to sustain oneself. Their methods of nurturing life and benefiting all things are all the arts of the sage ruling from the south.\"* (As recorded in the *Comprehensive Records of the Current Dynasty*.)\n\nThus, earlier scholars placed *Laozi*’s text secondary to the **classics**, and **Lu Deming** of the Tang compiled *The Exegesis of the Classic Texts* in thirty volumes, including *Laozi’s Exegesis* in three volumes. Today, the exegeses of all classics and *Laozi’s Exegesis* total twenty-seven volumes, all of which have been engraved and distributed. Only *Zhuangzi’s Exegesis* remains missing in three volumes. Sun Xi proposed following the example of the *Dao-De Jing*, dispatching officials to verify and engrave it for distribution, and the decree approved this. (As recorded in the *Comprehensive Records of the Current Dynasty*.)\n\nIn the **third year of Tianxi**, when celestial scriptures descended, **Sun Xi**, who served as **Jizhou Prefect** in **Qianyoushan**, submitted a memorial stating:\n*\"The lowly **Zhu Neng** falsely claims divine omens and portents. In the past, the **Tang Minghuang** (Emperor Xuanzong) obtained the *Lingbao Shangqing Huguo Jing* (Scripture of the Sacred Treasure of the Numinous Treasure and High Clarity) and the *Baojuan* (Treasure Scroll), all fabricated by **Wang Jue** and **Tian Tongxiu** and others.\nThe **Dao** of **Laozi**, the Sage, descending in words, should naturally be without falsehood. Yet since the **An-Lu Rebellion** of the Tang, both capitals were destroyed and overthrown—how could the realm be in perfect harmony? The **Minghuang** barely managed to return to the palace before being again abducted by the **Fuguo Rebellion**, ultimately dying from exhaustion. **Laozi’s** sacred longevity is boundless; how could he have failed to achieve eternal life and lasting vision?\nSince the **Minghuang** was misled by leftist doctrines, his governance became disordered, the people’s hearts turned away, and calamities arose suddenly. I pray that Your Majesty may take heed of the **Minghuang’s** summoning of disaster, so that misfortune may not arise and turmoil may not occur.\"* (As recorded in the *Nine Dynasties’ Temple Regulations*.)\n\nDuring the **revolt of Fang La** in **Zheyou**, whose cries shook the capital, the **Chancellor’s Office Attendant Cheng Zhen** told **Chancellor Wang Pi**:\n*\"It would be appropriate to seize this moment to discuss the ills of the realm, so that some reforms might be made and the people’s hearts might be pacified.\"* **Wang Pi** was displeased. At the time, **Cheng Zhen** also served as **Attendant to the Prince**, and when he reached **Shu Palace** to see the **Prince**, he said:\n*\"When **Zhou Gong** (Duke of Zhou) composed the poem *‘Jiangliu’* (Owl), **Confucius** praised it as profound wisdom. Its words merely speak of awaiting the heavens’ rain and harmonizing the eaves and doors. **Laozi** also said, ‘Act before things arise; govern before chaos ensues.’ Truly, **Laozi** and **Confucius** share this principle. Now, if we do not establish the roots of governance in times of tranquility, but merely vie for immediate results, this is not the intent of the two Sages.\"* (As recorded in the *Nine Dynasties’ Temple Regulations* and *Biographies of Eastern Capital* in his own transmission.)\n\nIn the **sixth year of Zhenghe**, **Li Gang**, then **Assistant Censor in the Ministry of Justice**, petitioned the Emperor in a memorial requesting clarification on the *Yijing* (Classic of Changes), stating in part:\n*\"I humbly observe that Your Majesty’s celestial wisdom and brilliance are unparalleled, and that You are aided by the study of **Jixi** (Refined Brightness) and **Guangming** (Enlightened Clarity). You embody the **primordial** and master the **mysterious**, encompassing the full scope of symbols and numbers. Even in the midst of Your countless affairs of state, You instruct and elucidate the books of **Laozi** and **Zhuangzi**, awakening scholars across the land with eloquent and profound words. These words reveal what cannot be spoken and illuminate the radiant principles of **Dao**, **virtue**, and **life-force**.\nThe *Yijing* speaks of neither thought nor action—it is still and unmoving, yet responsive, thus communicating the patterns of the world. Truly, it complements the books of **Laozi** and **Zhuangzi** in its ultimate expression.\nI pray that Your Majesty may reflect deeply within Your heart and compose commentaries to unfold the **divine virtue** and reveal the **profound essence** of the cosmos.\n\nAdditionally, he inscribed a poem on **Li Bo Shi’s** (Li Gonglin) painting of *Laozi’s Departure from the Pass*, which reads:\n‘I ask of the **Gate of All Wonders**—how does it remain constant?\nAt that time, **Guan Yin** (Laozi’s disciple) was so diligent in his purpose.\nThe **Green Ox** departs westward toward the desert sands,\nWhile **Purple Qi** arrives eastward, its auspicious mists revealed.\nThe **mysterious art** does not stray from the **Thirty-Six Strategies**,\nThe **ultimate words** are all contained in the **Five Thousand Characters**.\nThe world fails to grasp the **Root of Benevolence and Simplicity**,\nOnly seeking eternal life by following the **White Clouds**.’\n\n(As recorded in the *Liangxi Collection*.)\n\n**Master Cheng Yi** of **I Chuan** (Program Precept) said:\n*\"The teachings of the Daoists have no further flaws to criticize, but the sayings of the **Buddhist School** have proliferated into such deep confusion and delusion that they cannot be refuted.\"*\n\nAgain, he said:\n*\"The words of **Zhuangzi** in describing the **Dao** have much merit, and the chapter *‘Gu shen bu si’* (Nurturing the Spirit and Not Letting It Die) is the finest.\"*\n\n(As recorded in **Master Cheng’s** posthumous writings.)\n\n**Hu An Guo**, the **Minister of War**, said:\n*\"The **Five Thousand Words** of **Laozi**, such as his sayings ‘I have no affairs,’ ‘I love tranquility,’ and ‘I possess the Three Treasures,’ are all profound truths.\"*\n\n(As recorded in the *Language Records*.)\n\nThe **inscription of Xicang’s** (She Yi’s) **Shou Shou Pavilion** states:\n*\"The **Ren** (benevolence) that **Confucius** spoke of brings longevity, and the **‘not dying though dead’** longevity that **Laozi** spoke of, as well as the **‘boundless longevity’** of the **Buddhist School**—though the words of the three Sages differ, their meanings are the same.\nThe **Ren** exhausts one’s **nature** (xing), and exhausting one’s **nature** means one does not perish though dead. If one does not perish though dead, how could one’s longevity be measured?\nThose who merely see the hair, nails, and teeth returning to the earth, the saliva and tears merging with water, the warmth of **qi** returning to fire, and movement transforming into wind, assume that the person has truly died. Yet they fail to recognize that the **Dao** remains ever-present and never truly dies.\"*",
      "overlap_context": " by two or three levels.’*\n*He also said: ‘No text surpasses the Five Thousand Words in speaking of the **Great Dao**.’*\n*In his old age, the Master composed poetry:\n‘I have preserved eighty-one chapters of commentary,\nA disciple of Laozi’s **Old Plum** school.\nAs age deepens, my craft grows refined—\nThe ordinary cannot fathom it.’\"*\n\n(As recorded in his last words.)\n\n---\n**Miscellaneous Commentaries on the *Collected Annotations of the Dao-De Jing***\n*Compiled by Song’s Peng Zhi of **Huelin**.*",
      "start_char": 10264,
      "end_char": 11497,
      "start_sentence": 305,
      "end_sentence": 338,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 27.409817457199097,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经集注杂说.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "见《溪堂集》。 道乡邹忠公浩曰：玄牝之门，取诸吾身，则鼻也。 鼻者息之所由以出入，绵绵若存，用之不勤，则其息深矣，孙叔敖鼻间栩栩然是已。 《庄子》曰：真人之息以踵，众人之息以喉。 屈服者其嗌言若哇，其嗜欲保者其天机浅。 《素问》曰：非出入则无以生长壮老已，非升降则无以生长化收藏，升降出入，无器不有，四者之有而贵常守，知此然后知谷神之所以不死。 又曰：虚其心，则腹自实，弱其志则骨自强。 并见《道乡集》。 康节先生邵雍曰：皇帝王伯者，易之体也，意言象数者，易之用也。 三皇同意而异化，五帝同言而异教，三王同象而异观，五伯同数而异率。 同意而异化者，必以道。 以道化民者，民亦 以道归之，故尚自然。 夫自然者，无为无有之谓也。 无为者，非不为也，不固为者也，故能广。 无有者，非不有也，不固有者也，故能大。 广大悉备而不固为固有者，其惟三皇乎。 是故知能以道化天下者，天下亦以道归焉。 所以有言曰：我无为而民自化，我无事而民自富，我好静而民自正，我无欲而民自朴，其斯之谓欤。 见本集《观物篇》。 邵伯温曰：康节先公以老子为知《易》之体，以孟子为知《易》之用，论文中子谓佛为西方之圣人，不以为过。 见《邵氏闻见录》。 东坡书上清宫碑云：道家者流，本於黄帝老子，其道以清静无为为宗，以虚明应物为用，以慈俭不争为行，合於《周易》何思何虑，《论语》仁者静寿之说，如是而已。 谢显道亲见程伊川诵此数语，以为古今论仁最有妙理。 见邵博《闻见后录》，谢氏《语录》亦载。 西塘郑侠曰：侠闻之老子曰：知足不辱，知止不殆，《易》曰：亢之为言也，知进而不知退，知存而不知亡，知得而不知丧，知进退存亡而不失其正者，其唯圣人乎。 然则进退存亡得丧之理，其不一致乎。 何其知退知亡知足知止之难，而圣人丁宁赞叹之深乎。 曰：是皆一也，进退有道，则进不易而退不难。 存亡有道，则存不喜而亡不忧，进退存亡一归於道，时止则止，时行则行，孰不一致哉。 又曰：上士闻道，勤而行之。 中士闻道，若存若亡。 下士闻道，大笑之，不笑不足以为道。 又曰：惟道大，故似不肖，若肖久矣，其细也夫。 夫肖也者，以所养者小故也。 俗之所养无非小，是以大者为不肖，然则欲为道，正得俗之所谓不肖者，而俗之所不以为不肖，是皆未足与语夫道。 又曰：道大而物小，人之营营而卒乎小者，累於物也。 元者善之长而至於大之谓也，至而不知其为大，则同乎道而与世俗不相似，故天下皆谓我道大，似不肖，盖众方察察，发较而锥竞，我独闷闷，以天下为不足为者，宜乎其不相似，故能成其大。 大而有之，其去世俗不能以寸矣，故卒之不肖。 下士闻之笑，而后庶几。 夫道不肖则不足以为道也。 又曰：老子曰：水善利万物又不争，处众人之所恶，故几於道。 然则汨之随变，则臭腐浊秽，不可以濯足，亦其自取，不几於恶乎。 思复性者，以是为鉴，知夫清且明者自我性，而浊且乱者，亦自我之有以来之也。 去其汨且惑者，而清明在躬，然后扬波淈泥与之偕，而莫吾能化也。 以其莫吾能化，彼将宴寝以明洁，而莫之知予力焉。",
      "translated_text": "The *Dixian* [玉诀类] continues:\n\nFrom *Xitang Ji* [溪堂集], **Zhou Zhonggong of Daoxiang** [道乡邹忠公浩] says:\nThe **Mysterious Female Gate** [玄牝之门], drawn from our own person, is the **nose** [鼻]. The nose is the passage through which **qi** [息] enters and exits. If it flows continuously as if ever-present, and one does not strain it, then the breath becomes profound—such was **Sun Shu’ao’s** [孙叔敖] nose, ever vibrant.\n\nThe *Zhuangzi* [《庄子》] states:\nThe **True Person’s** [真人] breath reaches to the heels,\nWhile the common man’s breath stops at the throat.\nThose who bend and submit speak with a rasping voice,\nAnd those who hoard desires have shallow **innate vitality** [天机].\n\nThe *Suwen* [《素问》] says:\nWithout **inhalation and exhalation**, there would be no growth, maturation, aging, or death.\nWithout **ascension and descent**, there would be no growth, transformation, contraction, or storage.\nAscension and descent, inhalation and exhalation—\nNo vessel lacks these four, yet their **virtue** [德] lies in steadfastly guarding them.\nOnly when one knows this does one understand how the **Spirit of the Valley** [谷神] does not die.\n\nIt further says:\nEmpty your mind, and your **abdomen** [腹] will naturally fill.\nWeaken your will, and your bones will naturally strengthen.\n\nAll as seen in *Daoxiang Ji* [《道乡集》].\n\n**Master Kangjie Shao Yong** [康节先生邵雍] says:\nThe **Three Sovereigns** [三皇] share the same **Dao** but differ in transformation.\nThe **Five Emperors** [五帝] speak the same words but differ in teachings.\nThe **Three Kings** [三王] share the same symbols but differ in governance.\nThe **Five Hegemons** [五伯] share the same numbers but differ in methods.\n\nTo share the same **Dao** yet differ in transformation—\nThis must be done through the **Way** [道].\nThose who govern through the **Way** will have the people return to the **Way**,\nThus valuing **spontaneity** [自然].\n**Spontaneity** means **non-action** [无为] and **non-possession** [无有].\n**Non-action** is not inaction, but not clinging to action—\nThus it can be expansive.\n**Non-possession** is not lack, but not clinging to possession—\nThus it can be vast.\nWhen **broad and great**, fully present yet not fixed in possession—\nWho but the **Three Sovereigns** could embody this?\n\nThus, those who know how to govern the world through the **Way**\nWill see the world return to the **Way**.\nHence the saying:\n*\"I do not act, yet the people transform themselves.\nI do not interfere, yet the people grow rich.\nI love stillness, yet the people align themselves.\nI have no desires, yet the people return to simplicity.\nIs this not the case?\"*\nAs seen in *Guanyu Pian* [《观物篇》] of his own collection.\n\n**Shao Bowen** [邵伯温] says:\nMaster Kangjie believed **Laozi** understood the **substance** [体] of the *Yijing*,\nAnd **Mencius** understood its **application** [用].\nIn his commentary on *Wen Zhongzi*, he praised **Buddha** as a **sage of the Western Land** [西方之圣人],\nAnd this was not excessive.\nAs seen in *Shao Shi Wenjian Lu* [《邵氏闻见录》].\n\n**Su Dongpo’s** inscription on the **Shangqing Palace** [上清宫] stele reads:\nThe **Daoist tradition** [道家者流] originates with **Huangdi and Laozi** [黄帝老子].\nIts **Way** centers on **clarity, stillness, and non-action** [清静无为].\nIts **application** lies in **emptiness and luminosity** [虚明应物].\nIts **conduct** is **compassion and frugality, non-contention** [慈俭不争].\nThis aligns with the *Zhouyi* [《周易》]: *\"No thinking, no worrying\"* [何思何虑],\nAnd the *Analects* [《论语》]: *\"The virtuous attain longevity through stillness\"* [仁者静寿].\nSuch is all.\n\n**Xie Xiandao** [谢显道] personally witnessed **Programming Yichuan** [程伊川] reciting these lines,\nAnd deemed them the most profound discussion of **Ren** [仁] in antiquity.\nAs recorded in **Zhao Bo’s** *Wenjian Hou Lu* [《闻见后录_] and **Xie’s** *Yulu* [《语录》].\n\n**Zheng Xia of Xitang** [西塘郑侠] says:\nI have heard **Laozi** say:\n*\"Knowing contentment brings no disgrace,\nKnowing limits brings no peril.\"*\nThe *Yijing* [《易》] states:\n*\"Excess (亢) is to know advancement yet not retreat,\nTo know preservation yet not annihilation,\nTo know gain yet not loss—\nOnly the **Sage** knows advancement, retreat, preservation, annihilation, gain, and loss\nWithout losing their proper alignment.\"*\n\nYet how difficult it is to know retreat, annihilation, contentment, and limits,\nWhile the **Sage** repeatedly extols them with deep reverence!\n\nHe says:\nAll these are **one**.\nAdvancement and retreat follow the **Way**—\nThen advancement is not arduous, and retreat is not difficult.\nPreservation and annihilation follow the **Way**—\nThen preservation brings no joy, and annihilation brings no sorrow.\nAdvancement, retreat, preservation, and annihilation all return to the **Way**,\nStopping when it is time to stop, moving when it is time to move—\nWho could say they are not in harmony?\n\nHe further says:\nThe **Superior Person** hears the **Way** and diligently practices it.\nThe **Middle Person** hears the **Way** and clings to it uncertainly.\nThe **Lesser Person** hears the **Way** and laughs at it—\nIf they do not laugh, it is not the **Way**.\n\nHe says:\nOnly the **Way** is great,\nThus it seems unworthy.\nIf it were long deemed worthy, it would be trifling indeed.\n**Worthiness** arises from nurturing what is small—\nFor the common nurture only the small,\nThus the great is deemed unworthy.\nYet to seek the **Way**,\nOne must embrace what the common deem unworthy,\nFor what the common do not deem unworthy—\nThese are not worthy of discussing the **Way**.\n\nHe says:\nThe **Way** is great while things are small.\nMen toil endlessly yet perish in the small—\nThey are burdened by things.\n**Primordiality** [元] is the ultimate extension of goodness,\nReaching the greatest magnitude.\nWhen it reaches greatness yet remains unknown as such,\nIt aligns with the **Way** yet does not resemble the world.\nThus the world calls my **Way** great yet unworthy,\nFor while others scrutinize and compete,\nI alone am serene, deeming the world unworthy of my concern.\nIt is fitting that I do not resemble them,\nThus I can achieve greatness.\nGreat yet possessing it—\nI surpass the world by an inch.\nThus I am deemed unworthy.\nOnly when the **Lesser Person** laughs at this\nDo I approach understanding.\nFor if the **Way** were deemed worthy, it would not be the **Way**.\n\nHe says:\n**Laozi** said:\n*\"Water benefits all things yet does not contend.\nIt dwells where others abhor it,\nThus it nears the **Way**.\"*\nYet when water stagnates and rots,\nBecoming foul and impure—\nUnfit even for washing one’s feet—\nThis is self-inflicted, nearing the **abhorrent**.\nThose who seek to restore their **original nature** [复性]\nShould take this as a mirror:\nKnow that clarity and luminosity come from **innate nature** [自我性],\nWhile turbidity and chaos arise from **what is acquired** [自我之有].\nAbandoning the murky and confused,\nClarity and luminosity manifest within—\nThen, rising with the waves and sinking with the mud,\nNone can resist my transformation.\nBecause none can resist my transformation,\nThey will repose in purity and clarity,\nYet none will know my power.",
      "overlap_context": "** exhausts one’s **nature** (xing), and exhausting one’s **nature** means one does not perish though dead. If one does not perish though dead, how could one’s longevity be measured?\nThose who merely see the hair, nails, and teeth returning to the earth, the saliva and tears merging with water, the warmth of **qi** returning to fire, and movement transforming into wind, assume that the person has truly died. Yet they fail to recognize that the **Dao** remains ever-present and never truly dies.\"*",
      "start_char": 11497,
      "end_char": 12717,
      "start_sentence": 339,
      "end_sentence": 384,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 159.68221616744995,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经集注杂说.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "又曰：水之性清，以其出於土也，而土汨之，是以如是其浊也，徐而清之，可以鉴毛发。 人之识明，以其出於物也，而物惑之，是以如是其乱也。 徐而明之，可以烛日月。 夫向也清，汨之则浊，浊而徐之，复清向也。 明惑之则乱，乱而徐之，复明也。 是浊且乱者，常自外加我，而清且明者，在我而已。 经曰：天地相合以降甘露，人莫之令而自均。 夫雨露之在天地，细故也，而犹平均如是，况於人之灵识乎。 又曰：三代而上，无有孔孟老庄释氏之教，遇帝而帝，遇王而王，而衰周以降，乃有三氏之教，其实忧世之溺，而致所以济之者云耳。 又尝自作《大庆居士序》曰：居士本懦学，以孔氏为宗，得老氏之说以明。 以上并见《西塘集》。 叶梦得曰：删书断自尧舜，而《易》独及伏羲、神农、黄帝，然后知尧而上盖有其人，六经存而不论。 尝试会之以心，则其说曰：易无思也无为也，寂然不动感而遂通天下之故，非天下之至神，孰能与於此。 然后知伏羲、神农、黄帝至于尧舜，世而相传者，皆不出乎《易》。 退而质诸老氏，则与《易》异者无几。 又曰：《论语》记窃比我於老彭，后孔子者孟子，孟子之於儒，盖秋毫不以少乱也，其拒杨墨，排仪秦，过於桀纣，终不及老氏，乃其言尽心知性，以至於命，则老氏之所深致意也。 然后知老氏之书，孔孟所未尝废。 又曰：老氏之书，其与孔子异者，皆矫世之辞，而所同者，皆合於《易》。 后老氏数百年复有佛氏者出，其辞益荒远深妙，不近人情，而要其至到与老氏殆相为表裹。 并见经注。 又曰：老氏论气欲专气致柔如婴儿，孟子论气以至大至刚，直养而无害，充塞乎天地之间，二者正相反。 从老氏则废孟子，从孟子则废老氏。 以吾观之，二说正不相反，人气散之则与物敌而刚，专之则反於己而柔。 刚不可以胜刚，胜刚者必以柔，则专气者乃所以为直也。 直养而无害於外，则不谓持其志，毋暴其气，当如曾子之守约，约之至积而反於微，则直养者乃所以为柔也，故知道之至者本自无二。 见《石林岩下放言》。 北山程俱老子论曰：可道之道，以之制行，可名之名，以之立言。 至於不可道之常道、不可名之常名，则圣人未之敢以示人。 非藏於密而不以示人也，不可得而示人焉耳。 故西方之圣人，其所示见设为乘者三，演为分者十二，命之曰教。 若夫传於教外者，则其不可道与不可名者也。 中国之圣人，祖唐虞，宪文武，以订诗书礼乐之文，命之曰经。 若夫其所以言，犹履之非迹者，则其不可道与不可名者也。 故老子着五千之文，将以示天下，迪后世，盖非退於道冥而独於己者，故其发言之首以谓可道之道可名之名者，五千文之所具也。 若夫千圣之所不传者，不可得而言也。 又曰：天地人一原耳。 天之所以为天，地之所以为地，人之所以为人者固同，而天地之能长且久，而人独不然何哉？ 天不知其为天，地不知其为地，今一受其形而为人，则认以为己，曰人耳人耳，谓其养生不可以无物也，则骋无益之求，谓其有身不可以不爱也。 而营分表之事，厚其生而生愈伤，养其躯而身愈病，其不为中道夭者亦幸矣。 老氏之旨如此，而未之思者以谓黄老之徒率畏死而求长生者，岂不惑哉？",
      "translated_text": "He says again:\n\nWater’s nature is clear, yet it emerges from the earth,\nand the earth muddies it—thus its turbidity.\nBut if one lets it settle, it becomes clear enough\nto mirror hair and threads.\n\nHuman insight is bright, yet it arises from things,\nand things confuse it—thus its chaos.\nBut if one lets it clarify, it can illuminate sun and moon.\n\nOnce clear, if muddied, it becomes turbid;\nbut if left to settle, it returns to its original clarity.\nOnce bright, if confused, it becomes chaotic;\nbut if left to clarify, it returns to brightness.\n\nThus, what is turbid and chaotic is always imposed from without,\nwhile what is clear and bright arises from within.\n\nThe *Classical Texts* say:\n*\"Heaven and Earth unite to descend sweet dew—\nno one commands it, yet it is evenly distributed.\"*\n\nThough rain and dew are subtle in Heaven and Earth,\nthey are yet so evenly distributed—\nhow much more so for the luminous and intelligent mind of humankind!\n\nHe says again:\nBefore the Three Dynasties, there were no teachings of Confucius, Mencius, Laozi, or the Buddha.\nYet when one encountered an emperor, one became an emperor;\nwhen one encountered a king, one became a king.\nBut from the decline of the Zhou onward,\nonly the teachings of the Three Masters [孔孟老] and the Buddha arose—\ntruly, they were concerned with the world’s delusion\nand sought to guide it toward salvation.\n\nHe once wrote in his *Preface to the Great Celebration Hermit*:\n*\"The Hermit was originally weak in learning,\ntaking Confucius as his master,\nand found Laozi’s teachings to clarify it.\nAll of this is recorded in the *Xitang Collection*.\"*\n\nYue Mengde said:\n*\"The *Book of Documents* ends with Yao and Shun,\nyet the *Yijing* extends back to Fuxi, Shennong, and the Yellow Emperor—\nthus we know that there were indeed figures before Yao,\nthough the Six Classics remain silent on them.\"*\n\nIf one examines this with the mind,\nthe *Yijing* says:\n*\"The Dao has no thought, no action—\nsilent and unmoving, yet responding,\nit naturally permeates all under Heaven.\nWho but the most divine of sages could attain this?\"*\n\nThus, from Fuxi, Shennong, and the Yellow Emperor down to Yao and Shun,\nwhat was transmitted through the ages\nwas never outside the *Yijing*.\n\nReflecting further on Laozi’s teachings,\none finds little that differs from the *Yijing*.\n\nHe says again:\n*\"The *Analects* records that Confucius compared himself to Laozi and Pengzu.\nAfter Confucius came Mencius,\nand though Mencius’ Confucianism never faltered by so much as a hair,\nhis rejection of Yang Zhu and Mozi,\nand his opposition to ritualistic Qin,\nexceeded even Jie and Zhou—\nyet he never reached Laozi’s depth.\nBut when it came to ‘exhausting the heart to know nature,\nand extending to fate,’\nthis was where Laozi’s focus lay.\"*\n\nThus, Laozi’s teachings were never neglected by Confucius and Mencius.\n\nHe says again:\n*\"Where Laozi’s words differ from Confucius’,\nthey are corrective for the age;\nwhere they align, they accord with the *Yijing*.\"*\n\nHundreds of years after Laozi, the Buddha emerged,\nhis language ever more profound and distant from ordinary speech,\nyet in its ultimate truth, it nearly mirrors Laozi’s teachings—\nas seen in the commentaries.\n\nHe says again:\n*\"Laozi speaks of *qi* and desire—\nconcentrating *qi* to achieve softness like an infant.\nMencius speaks of *qi* as vast and mighty,\ndirectly nurtured without harm,\nfilling Heaven and Earth.\nThese two seem contradictory.\nIf one follows Laozi, Mencius is abandoned;\nif one follows Mencius, Laozi is abandoned.\nYet in my view, the two are not truly opposed:\nwhen human *qi* is dispersed, it clashes with things and becomes rigid;\nwhen concentrated, it turns inward and becomes soft.\n\nRigidity cannot overcome rigidity—\nwhat overcomes rigidity must be soft.\nThus, concentrating *qi* is the means to achieve uprightness.\n\nUpright nurturing without harm to the outside\nis not to ‘hold fast to one’s will,\nnor to vent one’s *qi’*—\nit is like Zengzi’s moderation:\nwhen moderation accumulates to its extreme,\nit returns to subtlety—\nthus upright nurturing is the means to achieve softness.\nTherefore, the highest understanding of the Dao is fundamentally undivided.\"*\n\nThis is found in *Shilin Yanxia Fangyan*.\n\nThe Northern Song scholar Cheng Yi commented on Laozi:\n*\"The Dao that can be spoken of can guide conduct;\nthe name that can be named can establish discourse.\nBut the unspoken constant Dao,\nthe unnamed constant Name—\neven sages dare not reveal these to others.\nIt is not that they conceal them in secrecy,\nbut that they cannot be revealed at all.\n\nThus, the sages of the West\nset forth three vehicles of teaching,\ntwelve divisions of exposition,\nand called it *doctrine*.\nWhat was transmitted beyond doctrine\nwas the unspoken and unnamed.\n\nThe sages of China\ntook the Three Sovereigns and Five Emperors as their ancestors,\nestablished the rites of the Xia and Shang,\nand codified poetry, history, rites, and music—\ncalling it the *Classics*.\nYet what they spoke of\nwas like the path beneath the footprints—\nthe unspoken and unnamed.\n\nThus, Laozi composed the Five Thousand Words\nto show the world and guide posterity,\nnot retreating into obscurity for his own sake.\nHence, his opening words speak of the Dao that can be spoken of,\nthe Name that can be named—\nall contained within the Five Thousand Words.\nBut what the thousand sages did not transmit\ncannot be spoken of.\"*\n\nHe says again:\n*\"Heaven, Earth, and humanity share a single origin.\nWhat makes Heaven Heaven, Earth Earth,\nand humanity human\nis fundamentally the same—\nyet Heaven and Earth endure long,\nwhile humanity does not. Why?\n\nHeaven does not know it is Heaven;\nEarth does not know it is Earth.\nYet once a person receives their form,\nthey claim it as ‘I’—\n‘human, human,’ they say—\nand because they believe life cannot be sustained without things,\nthey indulge in futile pursuits.\nBecause they believe their body cannot be cherished enough,\nthey toil over superficial concerns,\nthickening life while hastening their ruin,\nnurturing the body while ailing it—\nthat they do not perish early is fortunate indeed.\n\nThis is Laozi’s intent,\nyet those who do not ponder it\nmistake the Yellow-Lao school for fearing death\nand seeking immortality—\nhow mistaken they are!\"*",
      "overlap_context": "**.\nThose who seek to restore their **original nature** [复性]\nShould take this as a mirror:\nKnow that clarity and luminosity come from **innate nature** [自我性],\nWhile turbidity and chaos arise from **what is acquired** [自我之有].\nAbandoning the murky and confused,\nClarity and luminosity manifest within—\nThen, rising with the waves and sinking with the mud,\nNone can resist my transformation.\nBecause none can resist my transformation,\nThey will repose in purity and clarity,\nYet none will know my power.",
      "start_char": 12717,
      "end_char": 13937,
      "start_sentence": 385,
      "end_sentence": 424,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 14.4923574924469,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经集注杂说.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "夫人而无生，道安所载？ 然世之丧其生者，盖反以有其生为累，有其生者且犹老氏之深戒，而谓其外於道而求长生乎？ 未之思也。 又曰：万物之变，莫大乎死生，人之为道，超然於生之际，则无余事耳。 生果来乎？ 死果往乎？ 以生为实来，则吾之所从来者宜可知矣。 南北耶？ 东西耶？ 上下耶？ 审不可以言也，而谓之实来，可乎？ 以死为实往，则吾之所从往者，宜可知矣。 心耶？ 物耶？ 人耶？ 天耶？ 审不可以言也，而谓之实往，可乎？ 然则吾之生也，前不知其所起，后不知其所断，贯万古而常存者湛然也。 然后晓然知我之未尝生，未尝死也，将以奚为死地哉？ 又曰：众人之见易遣，圣贤之疵难除，营欲戕性，取舍滑心，众人之过也。 众人之过大而有迹，故其遣之也易。 以觉为碍，以解为缚，圣贤之疵也。 微而难知，故其除之也难。 事之过显，理之过微，以物为病显，以法为病微，然则理障法病，可胜疵乎？ 涤除元览，盖谓是也。 元览，圣人之所谓独见者也，人之有是元妙之见而不除之，是为解缚。 涤除元览，而即非涤除，则无疵矣。 涤除元览，而存涤除之见，是为觉碍。 又曰：圣人不伤民固也，而能使鬼神亦不伤人，何哉？ 盖人之在道，道之在人，犹鱼之在水，水之在鱼也，亦何生死之辨乎？ 方其以道莅天下，天下之民，其生也泊焉，所以善其生也。 其死也寂然，所以善其死也。 寂然而已，鬼安得而神乎？ 生也如彼，死也如此，尚安复有灵响祟厉之为哉？ 又唯常善也，故能救人无弃人，救物无弃物，有为之善，其能尔乎？ 唯无积也，故能为人己愈有，与人己愈多，住相之施，其能尔乎？ 推是道以济天下而度群生，亦何儒释老之分哉？ 并见《北山集》。 栟榈邓肃曰：尝考道教之所自来，其源出於黄帝，其道盛於老聃，其末流诡异，有真可骇者。 其为家三十有七，其为书九百九十有三篇。 凡有天下者，必崇其道，论其尤者，有三帝焉，秦曰始皇，汉曰武帝，唐曰明皇。 是三帝者，才智绝人，蔑视一世，穷六合之大，不足以厌其欲，於是浩然有御风骑气之志，炼丹飞符，杂以左道，自谓其法可配天地，殊不知飞腾之术，卒不能济，反祸其国，真可痛哉。 虽然，汉高祖之取天下也，则张良为最，其治天下也，则以曹参为最。 良之道盖慕赤松子，而参之居则避正室以舍盖公，是则道家之术，又若无负於天下者。 盖汉高祖所以取参与良者，在道之本，不过於清静恭俭无为，与民息肩而已矣。 而始皇、武帝、明皇之所尚者，区区竭力以事其末，故妄诞不经者得以行其志。 此治乱贤否所以相绝，不可同日而语也。 夫末流滋蔓，变怪百出，可以惑人主而祸天下者，皆非黄帝老聃氏之道。 见《栟榈集》 严谷山人江裹曰：夫道窅然难言哉，谓之道者，盖假以名道而实非道也。 五经之所言言其略，老聃、列御寇、庄周之所言言其详，详略虽殊，皆有以明道之本。 《问道》。 又曰：或问老子着书，有道德篇，当时所述欤，后人诠次欤。 余曰：此不得而知也。 余昔於藏书家见古文老子，其言与今所传大同而小异，考其义一也，唯次序先后与今篇章不伦，亦颇疑后人析之也。 曰：道无所不该，而五千文所纪者，可道之道耳。",
      "translated_text": "If a person has no life,\nwhere would the Dao find its vessel?\n\nYet those who lose their life in the world\nmerely take their very life as a burden—\nthose who possess life are still deeply warned by Laozi,\nyet they claim to seek longevity outside the Dao?\nThey have not pondered this.\n\nAgain it is said:\nAmong all transformations of things,\nnone surpasses death and life.\nFor one who follows the Dao,\ntranscending the bounds of life,\nthere is nothing else to attend to.\n\nDoes life truly come?\nDoes death truly go?\nIf life is truly coming,\nthen whence did I arise?\nSouth or north?\nEast or west?\nAbove or below?\nIt cannot be spoken of with certainty—\nyet to call it \"truly coming,\" is that possible?\n\nIf death is truly departing,\nthen whither do I go?\nMind?\nThings?\nHumanity?\nHeaven?\nIt cannot be spoken of with certainty—\nyet to call it \"truly departing,\" is that possible?\n\nThus, my life—\nbefore, I do not know its origin;\nafter, I do not know its end.\nPiercing through eternity, ever-present,\nit is serene and boundless.\n\nOnly then do I clearly know:\nI have never truly lived,\nnor have I ever truly died.\nThen what could be called the realm of death?\n\nAgain it is said:\nThe faults of the common folk are easy to dismiss,\nbut the flaws of the sages are hard to remove.\nPursuing desires harms nature,\nchoosing and rejecting unsettle the mind—\nthese are the errors of the common folk.\nTheir faults are great and visible,\nso they are easy to dismiss.\n\nTo take enlightenment as an obstacle,\nto see liberation as bondage—\nthese are the flaws of the sages.\nSubtle and hard to discern,\nso they are hard to remove.\n\nWhen faults are overt and principles are subtle,\nto see material ailments is clear,\nbut to see doctrinal afflictions is obscure.\nThen, if principles obstruct and doctrines ail,\nhow can one exhaust their flaws?\n\nTo purify and remove the fundamental vision—\nthis is what is meant.\n\nThe fundamental vision is what the sage calls\n\"the singular perception.\"\nIf a person possesses this profound insight\nyet fails to remove it,\nthat is bondage in liberation.\n\nTo purify and remove the fundamental vision,\nyet to still hold onto the notion of purification—\nthis is enlightenment as an obstacle.\n\nAgain it is said:\nThe sage does not harm the people by nature,\nyet can also make ghosts and spirits not harm humanity—\nhow so?\n\nFor the person in the Dao,\nthe Dao in the person,\nis like fish in water,\nwater in the fish—\nwhat need is there for distinctions of life and death?\n\nWhen the sage governs the world with the Dao,\nthe people’s lives are tranquil,\nthus their living is well-nurtured.\nTheir deaths are serene,\nthus their dying is well-nurtured.\nSerene and complete,\nhow could ghosts dare to be spectral or malevolent?\n\nLife is as it is,\ndeath is as it is—\nthen where is there still room for spirits to haunt or torment?\n\nOnly through constant virtue\ncan one save all without abandoning any,\nsave all things without abandoning any.\nVirtue through action—\ncould it achieve such?\nOnly through non-accumulation\ncan one give to others while possessing more,\nshare with others while having abundance.\nThe application of fixed forms—\ncould it achieve such?\n\nExtending this Dao to benefit the world\nand deliver all beings,\nwhat need is there for distinctions of Confucianism, Buddhism, or Daoism?\n\nAlso seen in *The Northern Mountain Collection*.\nGongzhuo Deng Su said:\nI have examined the origins of Daoist teachings—\ntheir source lies with the Yellow Emperor,\ntheir flourishing with Laozi,\nbut their later branches grew strange and terrifying.\nThere were thirty-seven sects,\nand nine hundred ninety-three texts.\n\nAll who ruled the world\nmust uphold this Dao.\nAmong its most extreme adherents were three emperors:\nQin’s First Emperor, Han’s Wu Emperor, and Tang’s Ming Emperor.\nThese three emperors\npossessed talents surpassing others,\ncontemptuous of their age,\nyet even the vastness of the six directions\ncould not satisfy their desires.\nThus, they harbored grand ambitions—\nrefining elixirs, flying talismans,\nmixing with heterodox arts,\nbelieving their methods could rival Heaven and Earth.\nYet in the end, their flying techniques\ncould not succeed,\nand they brought ruin upon their own realms—\ntruly lamentable.\n\nStill, when the Han High Emperor took the world,\nZhang Liang was his greatest aide,\nand when he ruled,\nhe entrusted governance to Cao Shen—\nthe finest choice.\nZhang Liang’s Dao emulated the Red Pine Immortal,\nwhile Cao Shen, in his residence,\navoided the main hall to dwell in the guest quarters—\nthus, the arts of Daoism\nwere not without benefit for the world.\n\nThe Han High Emperor’s reliance on Shen and Liang\nstemmed from the Dao’s foundation—\nnothing more than clarity, tranquility, reverence, frugality, and non-action,\nresting alongside the people.\n\nBut the First Emperor, Wu Emperor, and Ming Emperor\npursued only the superficial,\nexhausting their efforts on trivial ends,\nso delusions and falsehoods prevailed,\nallowing their schemes to take root.\nThis is how governance and chaos,\nvirtue and folly,\ndiffer so utterly,\nbeyond comparison.\n\nWhen later branches spread wildly,\nstrange and monstrous phenomena emerged,\ncapable of misleading rulers\nand bringing ruin to the world—\nthese were not the Dao of the Yellow Emperor or Laozi.\n\nFrom *The Gongzhuo Collection*.\nYan Gushan Jiang Kuo said:\nThe Dao is elusive and hard to speak of.\nWhat is called \"Dao\"\nis merely a name given to what is not truly the Dao.\n\nThe Five Classics speak of it briefly,\nwhile Laozi, Lie Yukou, and Zhuang Zhou speak of it in detail.\nThough their approaches differ—\none concise, one elaborate—\nboth illuminate the essence of the Dao.\n*On Inquiry into the Dao.*\n\nAgain it is said:\nSomeone asked: When Laozi wrote his book,\nwas it composed at the time or compiled later?\nI replied: This cannot be known.\n\nIn my youth, at a collector’s library,\nI saw an ancient-text *Laozi*.\nIts words were largely the same as today’s,\nbut with minor differences.\nExamining their meaning revealed unity,\nyet the order differed from today’s chapters,\nso I suspected later scholars had dissected it.\n\nThe Dao encompasses all things,\nyet the Five Thousand Words record\nonly what can be spoken of as Dao.",
      "overlap_context": ", human,’ they say—\nand because they believe life cannot be sustained without things,\nthey indulge in futile pursuits.\nBecause they believe their body cannot be cherished enough,\nthey toil over superficial concerns,\nthickening life while hastening their ruin,\nnurturing the body while ailing it—\nthat they do not perish early is fortunate indeed.\n\nThis is Laozi’s intent,\nyet those who do not ponder it\nmistake the Yellow-Lao school for fearing death\nand seeking immortality—\nhow mistaken they are!\"*",
      "start_char": 13937,
      "end_char": 15150,
      "start_sentence": 425,
      "end_sentence": 480,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 19.093911170959473,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经集注杂说.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "又离而为德，恐无是义。 余曰：道德实同而名异，曰道曰德，亦何所不可也。 曰：恶有是言哉。 吾尝读五经诸子，凡言道德，皆有小大后先之辨，不可概举，可考而知也。 余曰：庄周言一曲之士，判天地之美，析万物之理，本於道德之不一，重叹后之学者为不幸。 子亦欲蹈之乎。 曰：愿闻其旨。 曰：闻之无乎不在之谓道，自其所得之谓德，道者人之所共由，德者人之所自得也。 试以水为喻，夫湖海之涵浸，与拗堂之所畜，固不同也，其为水有异乎。 江河之倾注，与沟浍之湍激，固不同也，其为水有异乎。 水犹道也，无乎不之，而湖海勒堂江河沟浍，自其所得如是也，谓之实同名异，诅不信然。 学者之於道，会之以心，视之以神，斟酌饱满使自足，则德成而有立。 进德者至於德兼於道，则同於初矣。 由是观之，道非有余於德也，道散而德彰，德非不足於道也，德成而道隐，故圣人则备道全美，君子则明道全德，兹所以为异也。 曰：道妙无形，德审有所睹乎。 曰：道无方体，德有成亏，有成亏者昭昭於心目之间，岂无所睹耶。 合乎道则无德之可名，别於德则有名之可辨，故曰道无常名，德有定体。 老子之出，当道术之变，其立言皆以明至当之归，言虽不一，如首有尾，稽其至也，何彼此之辨。 《问德》。 又曰：生於心者不穷，是以命於身者无已。 死而复生，生而复死，始终之端，如循环无穷。 老氏言出生入死，生之徒十有三，死之徒十有三，动之死地十有三，三三而九，自十言之，则出乎生死者一而已。 一者谓何，意复命之人乎。 士之志於道者，能修身以俟之，直而推之，曲而任之，庶几乎可以语此。 《问命》。 又曰：或问老聃、列御寇、庄周、孟轲，皆古之得道者也，其立言各欲取信后世，何自相诋件如此。 聃曰吾有大患，为吾有身。 御寇曰内观者取信於身。 周曰吾身非吾有。 轲则曰万物皆备於我，反身而诚，乐莫大焉。 或厌其身之为患而非其有，或贵其身之皆备而取之足，岂不诋忤耶。 余曰：子未之思也。 子得其言而未得其所以言。 且四肢百骸五脏六腑，该而存焉者，谓之身。 视听言貌思，性所有也，亦谓之身，身之名则一，而所以为身者殊。 有所谓体，有所谓性，老聃、庄周盖即体而言之者，御寇孟轲盖即性而言之者。 即体言之，则四肢百骸五脏六腑有之则有患，无之则无患，故不可使之有也。 而所谓无者，非亡夫而身之谓，凡动作语默不见而已。 即性言之，则视听言貌思，一理所该，万物皆备，苟内观焉，可以取足。 高之於天，卑之於地，俯仰洞鉴，孰有不备於我者乎，孰有不足於身者乎。 以是言之，老聃、庄周之言身，不得不使之无。 列御寇、孟轲之言身，不得不使之观。 《问身》。 又曰：或问何者为息。 余曰：循阴阳以左右，随子午以消长者是也。 其运如未尝止之轮，其旋如不可尽之环，与元气交通，昼夜不息，老子、列御寇所谓冲气者也。 子知所以守息，则知所以养气。 知所以养气，则知所以入道。 知所以入道，则抱一禅定，固无殊致也。 老子曰：绵绵若存，用之不勤，子归而求之，斯有得也。 《问息》。 又曰：庄周言养形之士，吹陶呼吸，此特其浅浅者尔。 形神俱妙，盖本於袭气母。",
      "translated_text": "Again, it departs and becomes **virtue**—yet this seems unlikely.\n\nI replied: **Dao** and **virtue** are fundamentally the same, though their names differ. Why should this be impossible?\n\nHe said: How can this be so?\n\nI have read the Five Classics and the Hundred Schools. Whenever they speak of **Dao** and **virtue**, they distinguish between greater and lesser, earlier and later—this cannot be generalized without examination.\n\nI replied: Zhuang Zhou spoke of the one-sided scholar who divided the beauty of Heaven and Earth, dissecting the principles of all things, all stemming from the non-unity of **Dao** and **virtue**. He lamented that later scholars were thus unfortunate.\n\nDo you also wish to follow this path?\n\nHe said: I wish to hear its meaning.\n\nI said: **Dao** is what is found everywhere without limit; **virtue** is what one attains from it. **Dao** is the path all share, while **virtue** is what each attains for themselves.\n\nLet me use water as an analogy: the vastness of lakes and seas differs from the water stored in a courtyard well, yet is it not still water? The torrent of rivers differs from the rush of ditches, yet is it not still water?\n\nWater is like **Dao**—omnipresent, yet lakes, seas, wells, rivers, and ditches each manifest it differently. To say they are fundamentally the same yet named differently is undeniable.\n\nFor the scholar of **Dao**, to grasp it with the mind, to perceive it with the spirit, to balance and fulfill it until self-sufficient—then **virtue** is complete, and one stands firm.\n\nTo advance in **virtue** until it encompasses **Dao** is to return to the beginning.\n\nThus, **Dao** is not excessive compared to **virtue**; **Dao** is dispersed while **virtue** shines forth. **Virtue** is not deficient compared to **Dao**; when **virtue** is complete, **Dao** becomes hidden. Hence, the sage embodies **Dao** fully and perfectly, while the virtuous person illuminates **Dao** and fulfills **virtue**—this is their distinction.\n\nHe said: **Dao** is subtle and formless; can **virtue** be seen?\n\nI said: **Dao** has no fixed shape, but **virtue** has completion and deficiency. What is complete and deficient is evident to the heart and mind—how could it not be seen?\n\nTo align with **Dao** is to have no **virtue** to name; to distinguish **virtue** is to have a name to discern. Thus it is said: **Dao** has no constant name, while **virtue** has a defined form.\n\nWhen Laozi emerged, **Dao** and its methods were shifting. His teachings all clarified the ultimate and appropriate end—though his words varied, like a head with a tail, examining their essence reveals no contradiction.\n\n*On Inquiry into Virtue.*\n\nAgain it is said:\nWhat arises in the heart is inexhaustible; thus what is bestowed upon the body is endless.\nDeath and rebirth, life and death—\nthe beginning and end are like an unending cycle.\n\nLaozi spoke of birth and death:\nthirteen aspects of life,\nthirteen aspects of death,\nthirteen movements leading to death—\nthree threes make nine.\nFrom the perspective of ten aspects,\nonly one escapes life and death.\n\nWhat is this one? Perhaps it is the person who returns to the **Dao**.\n\nThe scholar who aspires to **Dao** can cultivate the self in anticipation of it,\nstraightforward in extension,\nyielding in retreat—\nperhaps this is how one may speak of it.\n\n*On Inquiry into Fate.*\n\nAgain it is said:\nSomeone asked: Laozi, Lie Yukou, Zhuang Zhou, and Meng Ke all were ancient masters of **Dao**, yet their teachings sought to gain the trust of later generations. Why do they contradict each other so?\n\nLaozi said: *\"I have a great affliction—my very body.\"*\nLie Yukou said: *\"Inner observation brings trust in the self.\"*\nZhuang Zhou said: *\"My body is not mine.\"*\nMeng Ke said: *\"All things are complete within me; to reflect inwardly and be sincere—no greater joy exists.\"*\n\nSome reject the body as an affliction, others value its completeness—how could they not contradict?\n\nI replied: You have not thought deeply. You have grasped their words but not their intent.\n\nThe limbs, bones, organs, and viscera—all that constitutes the body—are called the *body*.\nSight, hearing, speech, expression, thought—these inherent faculties are also called the *body*.\nThough the name *body* is the same, what constitutes it differs.\n\nSome speak of the *body* as form, others as nature.\nLaozi and Zhuang Zhou likely spoke of the *body* as form,\nwhile Lie Yukou and Meng Ke likely spoke of it as nature.\n\nSpeaking of form, the limbs, bones, organs, and viscera—if they exist, they bring affliction; if they do not, there is no affliction. Thus, one must not allow them to exist.\nYet what is meant by \"nonexistent\" is not the annihilation of the body, but simply that movement, speech, and action are unseen.\n\nSpeaking of nature, sight, hearing, speech, expression, and thought—all encompassed by a single principle, all things are complete within. If one observes inwardly, it is sufficient.\nHigh as Heaven, low as Earth—looking up and down, all is discerned within. Who is not complete within me? Who lacks anything in the body?\n\nThus, Laozi and Zhuang Zhou’s view of the body demands its nonexistence,\nwhile Lie Yukou and Meng Ke’s view demands its observation.\n\n*On Inquiry into the Body.*\n\nAgain it is said:\nSomeone asked: What is *xi* (息)?\n\nI replied: It is the movement of yin and yang as left and right,\nthe ebb and flow of the child and parent,\nlike an unceasing wheel, an endless ring—\ninteracting with primordial *qi*, ceaseless day and night.\nThis is what Laozi and Lie Yukou called *chong qi* (the penetrating *qi*).\n\nIf you know how to guard *xi*, you know how to nurture *qi*.\nIf you know how to nurture *qi*, you know how to enter **Dao**.\nIf you know how to enter **Dao**, you embrace unity in meditation—\nthe result is the same.\n\nLaozi said:\n*\"Continuous as if it exists,\nyet used without exertion—\nreturn to it and seek it,\nand you will attain it.\"*\n\n*On Inquiry into Breath.*\n\nAgain it is said:\nZhuang Zhou spoke of those who cultivate the form—\nblowing and breathing like clay pots—\nbut this is merely their superficial practice.\n\nWhen form and spirit are both refined,\nit originates from inheriting the mother *qi*.",
      "overlap_context": "omeone asked: When Laozi wrote his book,\nwas it composed at the time or compiled later?\nI replied: This cannot be known.\n\nIn my youth, at a collector’s library,\nI saw an ancient-text *Laozi*.\nIts words were largely the same as today’s,\nbut with minor differences.\nExamining their meaning revealed unity,\nyet the order differed from today’s chapters,\nso I suspected later scholars had dissected it.\n\nThe Dao encompasses all things,\nyet the Five Thousand Words record\nonly what can be spoken of as Dao.",
      "start_char": 15150,
      "end_char": 16361,
      "start_sentence": 481,
      "end_sentence": 533,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 17.109436511993408,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经集注杂说.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "老子曰：玄牝之门，是为天地根。 不死之道，本於是乎。 《问气》。 又曰：孔子曰：毋意毋我，老氏曰：及吾无身，吾有何患。 瞿昙曰：毋眼耳鼻舌身意，人之有生，形色外具，心意内知，必使之无者何哉。 盖无者万善之所归，万法之所宗，人能外息诸绿，冥心於无，则与道俱矣。 其归一致，若所谓坐忘，息气面壁，果殊途哉。 袤，字仲长，三衢人，严谷山人，则其自号也。 养素丘园，以经术教诸生，绍兴间大臣荐于朝，召对竟，力辞还里，士论高之。 并见《严谷集》。",
      "translated_text": "「Laozi said:\n*\"The mysterious female gate,*\n*This is the root of heaven and earth.*\n*The Way of immortality,*\n*Originates from here.\"*\n\n*On Inquiry into Qi.*\n\nAgain it is said:\nConfucius said: *\"Do not cling to thoughts, do not cling to self.\"*\nLaozi said: *\"When you reach the state of no-self,*\n*What harm can come to you?\"*\nBodhidharma said: *\"Abandon eyes, ears, nose, tongue, body, and mind—*\n*If one possesses birth,*\n*They manifest as form and color externally,*\n*And know thoughts internally.*\n*Why must they be abandoned?\"*\n\nIndeed, the state of *wu* (無) is the convergence of all virtues,\nthe foundation of all dharma.\nIf a person can externally cease all distractions,\nand inwardly merge with *wu*,\nthen they will align with the **Dao**.\n\nIts essence is singular—\nlike what is called *zuòwàng* (坐忘),\nor *xīqì miànbì* (息气面壁),\nare these not divergent paths to the same end?\n\n**Yan Gu** (嚴谷), courtesy name **Zhongchang** (仲長),\nwas from Sanqu (三衢).\nHe styled himself *Yan Gu Shanren* (嚴谷山人),\nwhich was his self-chosen name.\n\nHe cultivated simplicity in his garden retreat,\nteaching students through scriptural learning.\nDuring the Shaoxing era (紹興間),\nhigh-ranking officials recommended him to the court.\nAfter being summoned for an audience, he declined with force\nand returned to his hometown.\nThe scholarly community held him in high regard.\n\nHis biography is also recorded in *The Collected Works of Yan Gu* (《嚴谷集》).*",
      "overlap_context": " to enter **Dao**.\nIf you know how to enter **Dao**, you embrace unity in meditation—\nthe result is the same.\n\nLaozi said:\n*\"Continuous as if it exists,\nyet used without exertion—\nreturn to it and seek it,\nand you will attain it.\"*\n\n*On Inquiry into Breath.*\n\nAgain it is said:\nZhuang Zhou spoke of those who cultivate the form—\nblowing and breathing like clay pots—\nbut this is merely their superficial practice.\n\nWhen form and spirit are both refined,\nit originates from inheriting the mother *qi*.",
      "start_char": 16361,
      "end_char": 16570,
      "start_sentence": 534,
      "end_sentence": 543,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 4.903862237930298,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经集注杂说.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "杨文安公桩，绍兴间以从橐侍经筵，有《进读老子讲义》一篇，曰老子曰：我有三宝，宝而持之，一曰慈，二曰俭，三曰不敢为天下先。 夫慈故能勇，俭故能广，不敢为天下先故能成器长。 臣闻求道於聪明智力之所及，则心劳而道愈不明，舍聪明智力而求诸日用之间，则简易至当，道庶几乎可见矣。 任聪明，役智力，是弊精神於寡浅者之所为，以此应物殆有未能释然忘情者存焉。 故欲慈焉，则失於姑息，欲俭焉，则失於鄙吝，不敢为天下先，则失於怯懦，是心劳而道愈不明也审矣。 有道者则不然，生知之妙，浑然天成，物之来干我者，初无容心，随所遇而应之。 我无忮心故能慈，我无欲心故能俭，我无争心故不敢为天下先。 其所以日用者简易至当，果非由聪明智力之所能成就，非天下之至圣，其孰能与於此。 《易》之乾卦曰：体仁足以长人，坤卦曰，坤至柔而动也刚，则得乎仁者有勇之说，故曰慈故能勇。 节卦曰：节以制度，不伤财，不害民，则得乎俭以足用之说，故曰俭故能广。 谦卦曰：谦尊而光，卑而不可踰，则得乎一谦而四益具之说，故曰不可为天下先，故能成器长。 大《易》老氏之言若合符节，帝不得不帝，王不得不王，至仁好生，神武不杀，非慈耶。 茅茨土阶，恶衣卑服，非俭耶。 不矜不伐，不竞不絿，非不敢为天下先耶。 下至两汉宽仁大度，如高祖几於慈，以德化民，如文帝几於俭，以柔道理天下，如光武几於不敢为天下先，是则有天下者宝其慈且勇，宝其俭且广，宝其后且先，虽二帝三王，可以追踪而并美，区区两汉之主不足进也。 又曰：道家者流，其来最远，爰自黄帝氏作，至周有老聃得其传，战国时列御寇蒙庄之徒和其说。 逮秦汉间，遂名曰黄老之学，其道以虚无自然为宗，以清静澹泊为事，其真以治身，其绪余以治天下。 中古以来，盖尝与尧舜周孔之道并行於世，而不相戾异乎。 所谓浮屠氏之学者也，浮屠氏本出西方，至汉始入中国，霍去病击匈奴，获休屠王祭天金人，颜师古曰：金人即今佛像。 明帝梦见金人飞空而下，傅毅以为西方之圣人，遣使於天竺，访之以归，自是佛法始流传于时。 究厥所由，其与道家之学本原不同，而涂辙各异，曷不取《道德经》五千文考之，其言微，其旨远，其文简而严，其义宏以律，殆与六经相表裹，非若冰炭枘凿之不相入。 后世学者猥曰佛老、佛老云者，吁可怪哉。 并见《芸室集》。 光庙在潜邸，程文简公大昌时为宫僚，尝索其所着《易老通言》，大昌以割子缴纳，其略曰：夫老子之可重者何也，秉执枢要而能以道御物，是其长也，贵无贱有而罕言世故者，亦非其或短於此也。 故师老子而得者为汉文帝，盖其为治，大抵清心寡欲而渊默朴厚，以涵养天下，其非不事事之谓也，则汉以大治而基业绵固者，得其要用其长故也。 至於西晋则闻其言，常以无为为治本，而不知无为者如何其无为也，意谓解纵法度，拱手无营，可以坐治，无何纪纲大坏而天下因以大乱。 故王通论之曰：清虚长而晋室乱，非老子之罪也。 盖不得其要而昧其所长也。 区区之意，深望殿下采其秉要之理，而以西汉为法，鉴其谈治之略，而以西晋不事事为戒，则老子之精言妙道皆在殿下运用之中矣。",
      "translated_text": "Yang Wen’an Gong, during the Shaoxing era, served as a *zhuō* (橐) attendant at the imperial lectern and presented a treatise titled *\"On Presenting Commentaries on the Laozi.\"* He wrote:\n\n*\"The Laozi states: I possess three treasures. Cherish them and uphold them: the first is *cí* (慈, compassion), the second is *jiǎn* (俭, frugality), the third is *bù gǎn wéi tiānxià xiān* (不敢为天下先, not daring to lead the world).*\n\n*Compassion makes one courageous; frugality makes one abundant. Not daring to lead the world first allows one to become a vessel of virtue and longevity.*\n\n*I have heard that seeking the Dao through the reach of cleverness and intelligence only exhausts the mind, making the Dao ever more obscure. Abandoning cleverness and intelligence to seek it in daily life, however, is simple and direct—then the Dao may perhaps be glimpsed.*\n\n*To rely on cleverness and exhaust intelligence is the folly of those with shallow understanding. Using such means to respond to the world, there remains doubtless some lingering attachment or unresolved emotion. Thus, if one seeks compassion, they risk indulgence; if frugality, they risk meanness; if not daring to lead, they risk cowardice. This is why the mind labors, yet the Dao remains obscured—it is clear.*\n\n*But those who embody the Dao are otherwise. Their innate wisdom is effortlessly complete, as if born of Heaven. When things press upon them, there is no room for contrivance—they respond naturally as they encounter them. Without malice, they are compassionate; without desire, they are frugal; without contention, they do not dare lead the world first. Their daily conduct is simple yet perfectly aligned. This is not achieved by cleverness or intelligence alone—only the most sagely of rulers could attain it.*\n\n*The *Yijing*’s *Qian* (乾) hexagram says: ‘Embodying *rén* (仁, benevolence) suffices to nurture the people.’ The *Kun* (坤) hexagram says: ‘Though *Kun* is supremely yielding, its action is firm—thus, those who attain *rén* also possess courage.’ Hence, it is said: *‘Compassion makes one courageous.’*\n\n*The *Jié* (节) hexagram says: ‘Moderation through rites and institutions does not deplete resources nor harm the people.’ Thus, it aligns with the idea of *‘frugality making one abundant.’*\n\n*The *Qiān* (谦) hexagram says: ‘Humility brings radiance; lowliness is unassailable.’ This reflects the principle of *‘one who does not lead the world first attains virtue and longevity.’*\n\n*The teachings of the *Daodejing* and the *Yijing* resonate like matching seals. The Sage-Emperor does not fail to be an emperor; the Sage-King does not fail to be a king. Their boundless benevolence cherishes life, their martial virtue refrains from killing—is this not compassion? Their thatched huts and earthen steps, their coarse garments and humble attire—is this not frugality? Their lack of arrogance or self-praise, their avoidance of rivalry or scheming—is this not not daring to lead the world first?\n\n*Even down to the Han dynasty’s broad benevolence and magnanimity—like Emperor Gaozu, nearly compassionate in governing through virtue; Emperor Wen, nearly frugal in ruling with gentle principles; Emperor Guangwu, nearly not daring to lead—these rulers treasured compassion and courage, frugality and abundance, humility and longevity. Though they fell short of the Two Sovereigns and Three Kings, even the Han emperors could be emulated and praised.*\n\n*Furthermore, the Daoist tradition traces its origins far back—from the Yellow Emperor’s school, through Laozi in the Zhou, to Lie Yukou and Zhuangzi during the Warring States. By the Qin and Han, it became known as the Yellow-Lao learning. Its essence lies in *xūwú zìrán* (虚无自然, emptiness and spontaneity), its practice in *qīngjìng dànpō* (清静澹泊, clarity and tranquility). Its core is self-cultivation, its extensions extend to governing the world. Since ancient times, it has coexisted with the Dao of Yao, Shun, Zhou, and Confucius without contradiction.*\n\n*As for the *Fó Tú* (浮屠, Buddhist) school, it originated in the West and entered China only during the Han. When Huo Qubing defeated the Xiongnu, he captured a sacrificial golden figure from the *Xiutu* king. Yan Shigu noted that this was an early Buddhist statue. Emperor Ming dreamed of a golden figure descending from the sky, and Fu Yi identified it as a sage from the West. He dispatched envoys to *Tianzhu* (天竺, India) to investigate, and thus Buddhist teachings began to spread. Examining its origins, its foundations differ entirely from Daoist learning, and its paths diverge. Why not examine the *Daodejing*’s five thousand characters? Its language is subtle, its intent profound, its text simple yet rigorous, its meaning vast and authoritative—it nearly complements the Six Classics, unlike ice and charcoal or wedge and socket, which cannot intermingle. Later scholars casually lump them together as ‘Buddhist-Laoist’—how strange!*\n\n*This is also recorded in *The Yushishi Collection* (《芸室集》).*\n\n*During his time in the *Qián Dì* (潜邸, prince’s residence), Prince Guang (光庙) consulted Program Wenjian Gong Dachang, who served as a palace official. The prince sought his writings on *Yi-Lao Unified Speeches* (*Yi-Lao Tongyan*), and Dachang submitted them in the form of a *gēzi* (割子, scroll). Its essence reads:*\n\n*‘Why is Laozi so revered? He grasped the pivotal principles and governed the world through the Dao—this is his strength. Though he valued the *wu* (无, nonexistent) over the *yǒu* (有, existent) and rarely spoke of worldly affairs, this was not a flaw. Thus, the Han Emperor Wen, who followed Laozi, governed with a clear mind, few desires, and profound simplicity—his rule was not one of inaction. This is why the Han dynasty flourished with enduring stability: it grasped the essence and utilized his strengths.*\n\n*Yet by the Western Jin, though they heard Laozi’s words, they took *wuwei* (无为, non-action) as the principle of governance without understanding *how* to practice non-action. They believed that loosening laws, doing nothing, and passively waiting would suffice—until the state’s foundations collapsed and chaos ensued. Thus, Wang Tong remarked: ‘The Jin dynasty’s adherence to emptiness led to its ruin—this was not Laozi’s fault. They failed to grasp the core and misunderstood his strengths.’*\n\n*My humble hope is that Your Highness adopts the pivotal principles of Laozi and takes the Western Han as a model, learning from the Jin’s misguided inaction as a warning. Then, the refined words and profound Dao of Laozi will be fully realized in Your Highness’s governance.’*",
      "overlap_context": "* (仲長),\nwas from Sanqu (三衢).\nHe styled himself *Yan Gu Shanren* (嚴谷山人),\nwhich was his self-chosen name.\n\nHe cultivated simplicity in his garden retreat,\nteaching students through scriptural learning.\nDuring the Shaoxing era (紹興間),\nhigh-ranking officials recommended him to the court.\nAfter being summoned for an audience, he declined with force\nand returned to his hometown.\nThe scholarly community held him in high regard.\n\nHis biography is also recorded in *The Collected Works of Yan Gu* (《嚴谷集》).*",
      "start_char": 16571,
      "end_char": 17796,
      "start_sentence": 544,
      "end_sentence": 572,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 26.205626010894775,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经集注杂说.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "又尝着《潜藩盛德录》，内一篇曰：某旧得侍谈，凡及大道，常取《易·系》道器与孔子下学上达之语而参言。 盖道器学达可从上下立为形容，正如烧火，薪能生焰，是上形之道必资下形之器，学乎下可以达乎上，是薪虽粗实而其英华能炎能上者也。 六经论孟说器多而说道少，是蓄薪以求生焰者也。 老庄之书说无多於说有，是谓六经说薪已多，不必赘言者也。 儒者之於求道，自有六经，宜若无籍於老庄矣，然老庄之书言微趣深，助发道秘，尤为精要。 苟能博取，当大有补，特不可如晋人谈虚，直谓弃损礼乐刑政而天下可以自治焉耳。 天下尝有无薪而能自起火焰者耶。 又曰：今道士修老子教者，舍道本不言而及方药祈禳等事，其诲失本意又益太远。 惟唐人白居易诗语能明其确，曰何况元元皇帝道德五千言，不言药，不言仙，不言白日升青天，元元皇帝即老子也。 道家以老子为教祖，而八十一章自清静寡欲之外，别无一语他及，如何凿空妄云有药有仙，及祈禳腾厌等事耶。 恭蒙圣谕以某言为是，且明诵白诗上语全文，益深嘉居易之谈老子，能得要妙也。 并见本集。 又曰：世之尊老氏而谓上乎五三六经，疑老氏而诮其空虚无用，皆不得为知老氏者。 乃若老氏之高致则有在矣，知道之奥而谈无，曲尽其妙，运器以道，而在有不局於有，凡六经主於纪迹，而不暇究言者，此书实皆竭告也，则论孟之所务明者，於此乎加详矣，是故其书得与六经并行也。 见《易老通言》。 沈庄仲问晦庵先生朱文公曰：常有欲以观其傲，是如何。",
      "translated_text": "The author further composed *The Hidden Scaffolding of Flourishing Virtue* (《潜藩盛德录_), within which one passage states:\n\n*\"In my past discussions with Your Highness, whenever the topic turned to the Great Dao, I would often cite passages from the* **Yijing·Xi** (*《易·系》*—the \"Appendices\" of the *Yijing*), pairing the* **Daoqi** (*道器*—the interplay of Dao and its manifestation) *with Confucius’ words on* **xiàxué shàngdá** (*下学上达*—mastering the lower to attain the higher), and would interweave them in speech.*\n\n*\"Indeed, the interplay of Dao and its manifestation can be understood through the analogy of* **learning from the lower to attain the higher** (*学乎下可以达乎上*), just as firewood generates flames—this is the Dao of the higher form relying upon the instrument of the lower form. Though the wood may be coarse, its essence and brilliance can still blaze and ascend. The* **Six Classics** (*六经*) *and the* **Mengzi’s teachings** (*论孟*) *speak much of* **instruments** (*器*) *and little of the* **Dao** (*道*), *as if they were storing wood merely to produce flames. The works of Laozi and Zhuangzi, however, speak more of* **non-being** (*无*) *than of* **being** (*有*), *as if to say: ‘The Six Classics have already spoken extensively of the wood; there is no need to elaborate further.’*\n\n*\"The Confucian scholars, in their pursuit of the Dao, have the Six Classics. It would seem they have no need to draw from Laozi and Zhuangzi. Yet their writings are subtle and profound, aiding in the revelation of hidden aspects of the Dao, and are particularly refined and essential. If one could broadly incorporate them, the benefit would be immense—provided one does not, like the Jin scholars, speak of emptiness in vain, and claim that abandoning rites, music, punishments, and governance would allow the world to govern itself.*\n\n*Has there ever been fire that could blaze without wood?*\n\n*\"Moreover, it is said: ‘Nowadays, Daoists who follow Laozi’s teachings abandon the fundamental Dao and speak only of prescriptions, elixirs, and prayers for warding off misfortune or invoking blessings—how far they have strayed from the original intent! Only Bai Juyi’s poetry clearly articulates its truth, stating:*\n\n*‘How much more so the* **Yuan Yuan Huangdi** *(元元皇帝—Primordial Sovereign, i.e., Laozi) *of the* **Five Thousand Words** *(五千言),\nDoes not speak of elixirs,\nDoes not speak of immortals,\nDoes not speak of ascending to the Azure Sky in broad daylight.’*\n\n*The* **Primordial Sovereign** *(元元皇帝) *is none other than Laozi. The Daoist tradition venerates Laozi as its founder, yet in the* **Eighty-One Chapters** *(八十一章) *of his work, beyond the themes of* **Qingjing Guayu** *(清静寡欲—serene stillness and few desires), there is not a single word on alchemy, immortals, or prayers for warding off misfortune and invoking blessings. How can one arbitrarily claim there are prescriptions, elixirs, or immortals, and speak of prayers and incantations?’*\n\n*\"Your Highness graciously approves my words, and upon reciting Bai Juyi’s full verse, you further praise his understanding of Laozi, recognizing its profundity and subtlety. I have also included this in my own collection.*\n\n*\"It is further said: ‘The world reveres Laozi yet doubts that his teachings surpass the* **Five Three Six Classics** *(五三六经—likely a reference to the* **Five Classics** *and* **Three Commentaries** *of the Six Classics), or scoffs at his emptiness and uselessness—all failing to truly comprehend Laozi.*\n\n*‘Yet Laozi’s lofty aspirations are indeed present. His discussions of the Dao’s mysteries do not dwell on the Dao itself, but exhaustively reveal its subtleties. He employs instruments to manifest the Dao, yet transcends mere attachment to being. The Six Classics focus on recording deeds and events, without delving deeply into their meanings. This book truly exhausts its explanations, thus elaborating on what the* **Mengzi** *(论孟) *strives to clarify. Therefore, it is worthy to stand alongside the Six Classics.’*\n\n*\"As seen in* **The Harmonized Speeches on the Yijing and Laozi** *(《易老通言》).*\n\n*\"Shen Zongzhong asked Master Zhu Xi (晦庵先生朱文公): ‘There are those who wish to observe Your Highness’ disdain—how is this understood?’\"*",
      "overlap_context": "te’s foundations collapsed and chaos ensued. Thus, Wang Tong remarked: ‘The Jin dynasty’s adherence to emptiness led to its ruin—this was not Laozi’s fault. They failed to grasp the core and misunderstood his strengths.’*\n\n*My humble hope is that Your Highness adopts the pivotal principles of Laozi and takes the Western Han as a model, learning from the Jin’s misguided inaction as a warning. Then, the refined words and profound Dao of Laozi will be fully realized in Your Highness’s governance.’*",
      "start_char": 17796,
      "end_char": 18387,
      "start_sentence": 573,
      "end_sentence": 588,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 12.766372680664062,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经集注杂说.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "文公曰：微是边檄，如边界相似，是说那应接处。 向来人皆作常无常有点，不若只作常无欲常有欲看。 又问：道可道，如何解。 文公曰：道而可道，则非常道，名而可名则非常名。 又问：玄之义。 文公曰：玄只是探远而至於黑卒卒地，便是众妙所在。 张以道问载营魄抱一能无离乎之义，文公曰：魄是一，魂是二，一是水，二是火，二抱一，火守水，魂载魄，动守静也。 文公曰：多藏必厚亡，老子说得也是好。 陈仲亨问《周书》曰：将欲败之，必姑辅之，将欲取之，必姑与之，今《周书》何缘无之。 文公曰：此便是老子裹数句，是周时有这般书，老子为柱下史，故多见之，孔子所以适周问礼之属也。 黄义刚问：原壤看来也是学那老子。 文公曰：他也不似老子，老子却不恁地。 庄仲曰：却似庄子。 曰：是便是，夫子时已自有这样人了。 庄仲曰：庄子虽以老子为宗，然老子之学却尚要出来应世，庄子却不如此。 曰：庄子说得较开阔，较高远，然却较虚，走了那老子意思，若在老子当时看来，也不甚喜他如此说。 或问：老子之道，曹参、文帝用之皆有效，何故以王、谢之力量反做不成。 文公曰：王导、谢安又何曾得老子妙处。 文公曰：如汉文帝、曹参便是用老子之效，然他又只得老子皮肤，凡事只是包容因循将去。 郭德元问：老子云：夫礼忠信之薄而乱之首，孔子又却问礼於他，不知何故。 文公曰：他晓得礼之曲折。 某初间疑有两个老聃，横渠亦意其如此，今看得来，不是如此。 他曾为柱下史，於礼自是理会得，所以与孔子说得如此好。 只是他又说这个物事不用得亦可，一似圣人用礼时反若多事，所以如此说。 《礼运》中谋用是作，而兵由此起等语，便自有这个意思。 文公曰：老子之术冲啬不肯役精神，又曰：老氏初只是清静无为，却带得长生不死，后来却只说得长生不死一项，如今恰成筒巫祝，专只理会厌祷祈禳，这自经两节变了。 又曰：伯夷微似老子。 又曰：子房深於老子之学，曹参学之有体而无用。 又曰：孟子以后人物，只有子房与孔明，子房之学出於黄老，若以比王仲淹则不似其细密。 又曰：杨子云作《太玄》，亦自庄老来，惟寂惟寞可见。 又曰：文中有志於天下，亦识得三代制度，较之房、魏诸公，又稍有些本领。 若究其议论本原处，亦只自庄老中来。 或问：晋宋时人多说庄老，然恐其亦未足以尽庄老之实处。 文公曰：当时诸公只是借他言语来，盖覆那灭弃礼法之行耳，据其心下污浊纷扰，如何理会得庄老底意思。 文公曰：康节尝言，老氏得易之体，孟子得易之用，非也。 老子自有老子之体用，孟子自有孟子之体用。 将欲取之，必固与之，此老子之体用也。 存心养性，充广其四端，此孟子之体用也。 又曰：康节之学，似老子，只是自要寻个宽闲快活处，人皆害他不得。 张子房亦是如此，方众人纷拏扰扰时，他自在背处。 万人杰因问《击壤集》序以道观道等说，果为无病否，曰：谓之无病不可，谓之有病亦不可，渠自是一样意思，如以天下观天下，其说出於老子。 陈器之问：孟子平旦之气甚微小，如何会养得完全。 文公曰：不能存得夜气，皆是旦昼所为坏了，所谓好恶与人相近者几希。",
      "translated_text": "Master Zhu said: *\"This ‘edge’ and ‘border’ are like boundaries that resemble each other—this refers to the point where they meet. People have always interpreted ‘constant’ and ‘non-constant’ as a duality, but it is better to see ‘constant’ as the absence of desire and ‘non-constant’ as the presence of desire.*\n\n*He was further asked: ‘How should “The Dao that can be spoken of is not the eternal Dao” be understood?’*\nMaster Zhu said: *\"The Dao that can be spoken of is not the eternal Dao; the name that can be named is not the eternal name.\"*\n\n*He was further asked: ‘What is the meaning of “mysterious”?’*\nMaster Zhu said: *\"‘Mysterious’ is to probe the depths until it reaches a pitch so profound that it is utterly dark—this is where all subtleties converge.\"*\n\n*Zhang Yi asked about the meaning of ‘loading the spirit, embracing unity, and preventing separation.’*\nMaster Zhu said: *\"The ‘spirit’ (魂) is two, the ‘vital breath’ (魄) is one. One is water, two is fire. Fire embraces water, and the spirit loads the vital breath—this is the principle of movement guarding stillness.\"*\n\nMaster Zhu said: *\"‘Hoarding much will inevitably lead to great loss’—Laozi spoke truly well on this.\"*\n\n*Chen Zhongheng asked about the* **Book of Zhou** *(《周书》): ‘“Those who would subvert it must first aid it; those who would take it must first give it.” Yet the* **Book of Zhou** *lacks this. Why?’*\nMaster Zhu said: *\"This is precisely what Laozi condensed into a few phrases. In the Zhou era, such texts existed, and since Laozi was the Keeper of Archives, he had ample exposure to them—this is why Confucius visited Zhou to inquire about rites and such.\"*\n\n*Huang Yigang asked: ‘Original Rang seems to have studied Laozi.’*\nMaster Zhu said: *\"He does not resemble Laozi. Laozi was not like that at all.\"*\nZhuang Zhong said: *\"He seems like Zhuangzi.\"*\nMaster Zhu said: *\"That is correct. Even in Confucius’ time, such people already existed.\"*\nZhuang Zhong said: *\"Though Zhuangzi took Laozi as his master, Laozi’s teachings were still meant to engage with the world, whereas Zhuangzi was not so.\"*\nMaster Zhu said: *\"Zhuangzi’s words are broader and more distant, yet also more vacuous—he strayed from Laozi’s intent. If Laozi were alive to hear this, he would not approve.\"*\n\n*Someone asked: ‘Laozi’s Dao was effectively applied by Cao Can and Emperor Wen of Han, yet why did figures like Wang Dao and Xie An fail to achieve the same?’*\nMaster Zhu said: *\"Wang Dao and Xie An never truly grasped Laozi’s profundities.\"*\n\nMaster Zhu said: *\"Han Emperor Wen and Cao Can indeed applied Laozi’s principles, but they only understood his superficial aspects—merely accommodating and following conventions without deeper engagement.\"*\n\n*Guo Deyuan asked: ‘Laozi said, “Ritual, though thin in loyalty and trustworthiness, is the root of disorder.” Yet Confucius inquired about ritual from him. Why?’*\nMaster Zhu said: *\"He understood the complexities of ritual.\"*\n\n*Initially, I suspected there were two Lao Dan, and Cheng Hao also seemed to think so. Now, upon closer examination, this is not the case. Since he served as Keeper of Archives, he naturally comprehended ritual well, which is why he spoke so aptly with Confucius. He also said that these rites could be dispensed with if unnecessary—almost as if the Sage’s use of ritual was overly burdensome, hence his words. The passage in* **The Rites’ Evolution** *(《礼运》) on ‘planning to use it leads to its rise, and from this, wars emerge’ carries this same meaning.\"*\n\nMaster Zhu said: *\"Laozi’s methods were austere and frugal, unwilling to exert the spirit. He initially taught ‘tranquil stillness and non-action,’ yet also incorporated longevity and immortality. Later, his teachings focused solely on longevity and immortality, reducing him to a mere shamanistic practitioner—obsessed with warding off misfortune and praying for blessings. This marks two distinct shifts in his thought.\"*\n\n*He also said: ‘Bo Yi somewhat resembled Laozi.’*\n*He also said: ‘Zhang Liang was deeply versed in Laozi’s teachings, while Cao Can learned them superficially without application.’*\n*He also said: ‘Among figures after Mencius, only Zhang Liang and Zhuge Liang stand out. Zhang Liang’s studies stemmed from Huang-Lao, but compared to Wang Anshi, his approach was less meticulous.’*\n*He also said: ‘Yang Xiong’s* **Tai Xuan** *(《太玄》) *originated from Zhuang-Lao, evident in its stillness and emptiness.’*\n*He also said: ‘Though Wen Zhong had ambitions for the world and understood the institutions of the Three Dynasties, compared to Zhang Liang and Wei Qing, he possessed somewhat greater capability. Yet tracing his theoretical roots, they still stem from Zhuang-Lao.’*\n\n*Someone asked: ‘Though scholars of the Jin and Song dynasties often spoke of Zhuang-Lao, perhaps they did not fully grasp their true essence.’*\nMaster Zhu said: *\"Those scholars merely borrowed their language to justify abandoning ritual and law. Given their corrupt and chaotic minds, how could they truly comprehend Zhuang-Lao’s intent?\"*\n\nMaster Zhu said: *\"Kang You once claimed, ‘Laozi grasped the essence of the* **Yijing** *(《易》), and Mencius its application.’ This is incorrect. Laozi had his own essence and application, and Mencius had his own. ‘To take, one must first give’—this is Laozi’s essence and application. ‘Cultivating the heart-mind and nurturing the nature, expanding the four beginnings’—this is Mencius’ essence and application.\"*\n\n*He also said: ‘Kang You’s studies resembled Laozi’s, yet he sought only ease and comfort, untroubled by others. Zhang Zifang was the same—while others were in turmoil, he remained at peace in seclusion.’*\n\n*Zhang Wanjie then asked about the preface to* **Striking the Millet Field** *(《击壤集》), which speaks of observing the Dao through the Dao. Is this truly without flaw?*\nMaster Zhu said: *\"To call it flawless is incorrect, yet to call it flawed is also incorrect. It expresses the same intent—like observing the world through the world. This perspective originates from Laozi.\"*\n\n*Chen Qi asked: ‘Mencius’ morning qi is exceedingly subtle—how could he cultivate it so completely?’*\nMaster Zhu said: *\"He failed to preserve the night qi, which was ruined by the activities of dawn and day—what is called ‘good and evil being nearly indistinguishable from others.’\"*",
      "overlap_context": "ent to being. The Six Classics focus on recording deeds and events, without delving deeply into their meanings. This book truly exhausts its explanations, thus elaborating on what the* **Mengzi** *(论孟) *strives to clarify. Therefore, it is worthy to stand alongside the Six Classics.’*\n\n*\"As seen in* **The Harmonized Speeches on the Yijing and Laozi** *(《易老通言》).*\n\n*\"Shen Zongzhong asked Master Zhu Xi (晦庵先生朱文公): ‘There are those who wish to observe Your Highness’ disdain—how is this understood?’\"*",
      "start_char": 18387,
      "end_char": 19623,
      "start_sentence": 589,
      "end_sentence": 631,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 17.45501446723938,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经集注杂说.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "因举云老子言治人事天莫若啬，夫惟啬，是谓早复。 早复谓之重积德，重积德则无不克，大意也与孟子意相似，但它是就养精神处，其意自好，平旦之气，便是旦昼做工夫底样子，日用间只要此心在这裹。 李敬子问：神仙之说，有之乎。 文公曰：谁人说无，诚有此理，只是他那工夫大段难做，除非百事弃下，办得那般工夫方做得。 蔡季通云：道士有个庄老在上，却不会去理会。 文公曰：如今秀才读多少书，理会自家道理不出，他又那得心情去理会庄老。 蔡云：列子亦好。 曰：列子固好，但说得困弱，不如庄子。 问老子如何。 曰：老子又较深厚。 文公曰：佛徒其初只是以老庄之言驾说耳。 如远法师文字肇论之类，皆成片用老庄之意，然他口是说，都不行，至达磨来，方始教人自去做，所以后来有禅。 以上并见《文公语录》。 象山陆九渊曰：异端之说，出於孔子，今人卤莽，专指佛老为异端。 孔子之时，中国不闻有佛，虽有老氏，其说未甚彰着。 夫子之恶乡原，《论》《孟》中皆见之，独未见其排老氏，则所谓异端者，非指佛老明矣。 见《象山集》。 苕溪刘一止行简曰：窃惟天下之事，下合人心，上合天意，中合大道者，唯有一言，曰公而己矣。 老子曰：容乃公，公乃王，王乃天，天乃道，盖混而为一，非容不能公，王公之称，谓其容而能公也。 王训大，王者之称，谓其公而能大也。 则是公不可不与王同德，王不可不与天同道，此天下之至理也。 见《苕溪集》。 永嘉郑伯熊景望曰：盖公治黄老，曹相国参用於齐而称治，儒家多訾黄老言，何哉。 吾尝杜门终日默坐，谨动作，薄滋味，而心和气平，百病不侵，节以备其无，推以散其有，不妄求，不过忧，而老者穉者安於恬淡。 尝意此理推之天下有余地，何独数百里之齐。 孔孟之术岂有外是者，而訾黄老言何哉。 盖今道家所谈清净者，舍此而趋诞也。 见《郑先生戆语》。 刘清源曰：老子之言道德，偶从关令之请，矢口而言，律笔而成书，未尝分为九九章也。 后人分为上下二卷，以象两仪之妙用，九九八十一章，以应太阳之极数。 见道德经通论序。 黄茂材曰：道与德虽有二名，实相为用，不可离也。 今世学者乃分上经为道，下经为德，甚非作书之旨。 又曰：《易》六十四卦，八八之数也。 老子之书八十一章，九九之数也。 老子与《易》相为表裹，其后杨子云作《太玄》以准《易》，亦有八十一首，盖得於此。 见经注。 林东曰：夫子与老氏垂教，盖亦互相发明，夫子以仁义礼乐为治天下之具，老子以虚无恬淡明大道之所从出。 要之仁义礼乐，非出於大道而何，而虚无恬淡乃大道之本旨也。 特后世之不善用老氏者，或纯尚清虚恬淡，而至於废务，有以累夫老氏也。 且以道心惟微，无为而治，吾儒未尝不用。 老子如所谓我有三宝，一曰慈，二曰俭，三日不敢为天下先，以道佐人主者，不以兵强天下，老子未尝不用吾儒也。 以是而推，则大道之与道一而已矣，特不无本末先后尔。 盖所以互相发明，俱为忧世而作也。 或谓老氏有绝仁弃义，礼为乱首，得非与夫子背驰。 盖推尊道原之所从出，以仁义礼乐非不可以为治，不如以道化民而相忘於吾道之中为上也。",
      "translated_text": "「Zhang Wanjie then cited Laozi’s words: *“In governing people and harmonizing with Heaven, nothing surpasses frugality. Only frugality is called ‘early return.’ Early return is called ‘heavily accumulating virtue/power.’ Heavily accumulating virtue/power means nothing cannot be overcome, and its essence aligns closely with Mencius’ intent. Yet its focus lies in nurturing the spirit—its meaning is inherently good. Mencius’ morning qi is exceedingly subtle, but the cultivation of it is no different: it is the practice of maintaining this heart in daily life.”*\n\nLi Jingzi asked: *“Is there truth in the claims of immortals and transcendent beings?”*\nMaster Zhu said: *“Who would say there is none? There is indeed such possibility, but their practice is exceedingly difficult. Unless one abandons all worldly affairs, one cannot achieve that level of cultivation.”*\n\nCai Jitong remarked: *“Daoists speak of Laozi and Zhuangzi as supreme, yet they fail to embody their teachings.”*\nMaster Zhu said: *“Nowadays, scholars read countless books, yet their understanding of their own principles remains shallow. How then could they have the leisure to truly grasp the Dao of Laozi and Zhuangzi?”*\nCai said: *“Liezi’s teachings are also commendable.”*\nMaster Zhu replied: *“Liezi’s words are indeed admirable, but they are weak in conviction—unlike Zhuangzi.”*\nAsked how Laozi compares, he said: *“Laozi’s words are even deeper and more profound.”*\n\nMaster Zhu continued: *“The early Buddhist teachings merely borrowed the language of Laozi and Zhuangzi. For instance, texts like those of the Far Master (远法师) employ their ideas in fragments, but their spoken teachings are ineffective. Only with the arrival of Dharma (法) did they begin instructing people to cultivate themselves directly—thus, Zen (禅) emerged later. All this is recorded in* **Master Zhu’s Collected Sayings** *(《文公语录》).*\n\nLu Jiuxian of Xiangshan (象山陆九渊) stated: *“Heterodox teachings originated not from Confucius. Today’s reckless scholars point only to Buddhism and Daoism as heterodox, yet in Confucius’ time, China knew nothing of Buddhism, and though Laozi existed, his teachings were not yet widely proclaimed. The Master’s condemnation of empty talk in* **The Analects** *(《论》) and* **Mencius** *(《孟》) is evident, but he never explicitly rejected Laozi’s words—thus, it is clear that ‘heterodox’ does not refer solely to Buddhism and Daoism.”*\n(Recorded in *Lu Jiuxian’s Collected Works* 《象山集》.)\n\nLiu Yizhi of Zhouxi (苕溪刘一止行简) said: *“I ponder the affairs of the world: what aligns with human sentiment below, with Heaven’s intent above, and with the Great Dao in the middle, is but one principle—* **‘public and self’** *(公而己). Laozi declared: ‘Tolerance is public, publicness is magnanimity, magnanimity is Heaven’s, Heaven’s is the Dao.’ These are but one, inseparable. Tolerance cannot achieve publicness without magnanimity; the term ‘public and magnanimous’ (王公) refers to one who tolerates yet remains public. The term ‘public and expansive’ (王训) refers to one who is public yet possesses greatness. Thus, publicness must share virtue/power with magnanimity, and magnanimity must share the Dao with Heaven. This is the ultimate principle of the world.”*\n(Recorded in *Liu Yizhi’s Collected Works* 《苕溪集》.)\n\nZheng Bojun of Yongjia (永嘉郑伯熊景望) said: *“Master Zhu governed the Yellow Old (黄老) teachings, while Cao Zang (曹相国) applied them in Qi (齐) and claimed to govern it. Yet Confucians often disparage Yellow Old teachings—why is this? I once secluded myself all day, sat in silence, and restrained my actions. I minimized tastes, and my heart became tranquil, my qi even—no illness could invade. I preserved what was lacking and dispersed what was excessive, sought nothing in vain, and worried not beyond measure. Yet the aged and frail find ease in quietude. I considered this principle and found it applicable to all things under Heaven—why single out Qi, a mere hundred-li territory? Confucius and Mencius’ teachings could not be more correct, yet why do they disparage Yellow Old teachings? Indeed, the Daoists’ pursuit of purity (清净) often veers into falsehood (诞).”*\n(Recorded in *Mr. Zheng’s Steady Words* 《郑先生戆语》.)\n\nLiu Qingshui said: *“Laozi’s words on Dao and virtue/power were spoken in response to Guan Ling’s (关令) request, yet he composed them without hesitation, and the text was written down as is. He never divided it into ninety-nine chapters. Later scholars split it into two volumes—Upper and Lower—mirroring the duality of yin and yang, and eighty-one chapters—nine times nine—corresponding to the extreme number of the sun.”*\n(From the preface to *A General Discussion on the Dao and Virtue Text* 《道德经通论序》.)\n\nHuang Maocai stated: *“Though Dao and virtue/power bear two names, they are inseparable in function. Today’s scholars mistakenly divide the Upper Text as Dao and the Lower Text as virtue/power—this is far from the author’s original intent.”*\nHe further said: *“The* **I Ching** *(《易》) contains sixty-four hexagrams, eight times eight. Laozi’s text has eighty-one chapters, nine times nine. Laozi’s work complements the* **I Ching** *(《易》) like a mirror; later, Yang Xiong (杨子云) composed* **The Great Mysterious** *(《太玄》) to align with the* **I Ching** *(《易》), also with eighty-one verses—clearly inspired by this.”*\n(From *Commentary on the Text* 《经注》.)\n\nLin Dong said: *“The teachings of the Master and Laozi illuminate each other. The Master used* **‘Ren, Yi, Li, and Le’** *(仁义礼乐) as the means to govern the world, while Laozi employed* **‘emptiness, nothingness, and quietude’** *(虚无恬淡) to reveal the origin of the Great Dao. Ultimately,* **‘Ren, Yi, Li, and Le’** *emerge not from the Great Dao—from where then? And* **‘emptiness, nothingness, and quietude’** *are the very essence of the Great Dao. Yet later generations failed to apply Laozi’s teachings properly, often emphasizing only emptiness and quietude to the point of neglecting duties, thereby burdening Laozi’s legacy.”*\nMoreover, he said: *“As for the Daoist principle of* **‘the subtle Dao-heart’** *(道心) and* **‘governing without action’** *(无为而治), our Confucian tradition has never rejected it. Laozi’s* **‘three treasures’** *(三宝)—one is compassion (慈), two is frugality (俭), three is not daring to act before Heaven and Earth (不敢为天下先)—his method of aiding rulers through the Dao, without relying on military might to dominate the world, is something our Confucian tradition has also never rejected.”*\nThus, he concluded: *“If we extend this reasoning, the Great Dao and the Dao are one and the same—only differing in priority and sequence. They mutually illuminate each other, both crafted to address the world’s woes. Some claim Laozi abandoned* **‘Ren’** *and rejected* **‘Yi’** *, that* **‘Li’** *is the origin of disorder—this is not at odds with the Master’s teachings. Indeed, elevating the Dao’s source, the Master acknowledged that* **‘Ren, Yi, Li, and Le’** *can govern the world, but it is superior to govern through the Dao, allowing people to forget themselves within it.”*",
      "overlap_context": "law?*\nMaster Zhu said: *\"To call it flawless is incorrect, yet to call it flawed is also incorrect. It expresses the same intent—like observing the world through the world. This perspective originates from Laozi.\"*\n\n*Chen Qi asked: ‘Mencius’ morning qi is exceedingly subtle—how could he cultivate it so completely?’*\nMaster Zhu said: *\"He failed to preserve the night qi, which was ruined by the activities of dawn and day—what is called ‘good and evil being nearly indistinguishable from others.’\"*",
      "start_char": 19623,
      "end_char": 20852,
      "start_sentence": 632,
      "end_sentence": 677,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 21.83009958267212,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经集注杂说.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "见《经解发题》。 刘师立自号真静子，绍熙间人，着《道德经节解》十六篇，今取其五于右。 玄之又玄，谓元之始自然是也，此乃众妙之门户，首论道，次论天地，又以次论人心，可谓尽之矣，学者当默识之。 玄牝，玄，阳也，牝，阴也，门者二气橐钥之门户，如前章云众妙之门，亦如《语》云：谁能出不由户，何莫由斯道也。 大不可泥以口鼻为玄牝之门。 谓天地根，小其老子之说，未有天地，先有元气，是谓天地根。 盈则必虚，戒之在满。 锐则必钝，戒之在进。 金玉必累，戒之在贪。 富贵必淫，戒之在傲。 功成名遂必危，戒之在不知止。 老子之言深欲救人，非谓绝人事处山林者可与入道，虽居乎富贵功名之域，皆可勤而行之。 张则必歙，强则必弱，兴则必废，与则必夺，物理之自然，是谓微明。 微明谓精微明着，昭昭然可考。 或以权术解其义，天之道利而不害，若是乎。 或谓孔子以直报怨，今云以德报怨，何也。 然老子教人惟欲处其柔弱，与天为徒，而无所争，可以弥天刑，远人祸，若以直报怨，怨何由己。 当时孔子故有所激而言，终不若以德报怨之为善。 观复高士谢守灏曰：《道德经》，唐傅奕考窍众本，勘数其字云：项羽妾本，齐武平五年彭城人开项羽妾冢，得之。 安丘望之本，魏太和中，道士寇谦之得之。 河上丈人本，齐处士仇岳传之。 三家本有五千七百二十二字，与韩非《喻老》相参。 又洛阳有官本，五千六百三十五字，王弼本有五千六百八十三字，或五千六百一十字，河上公本有五千三百五十五字，或五千五百九十字，并诸家之注多少参差，然历年既久，各信所传，或以佗本相参，故舛戾不一。 《史记》司马迁云：老子着书言道德之意，五千余言，但不满六千则是五千余矣。 今道家相传谓老子为五千文，盖举其全数也。 见《老君实录》。 道德真经集注杂说卷下竟",
      "translated_text": "The *Daodejing* states:\n\n*\"As seen in the* **Jingjie Fati***. Liu Shili, who styled himself Zhenjingzi, a man of the Shaoxi era, composed the* **Daodejing Jiejie** *in sixteen chapters. Here, we take five of them.*\n\n*'The profundity beyond profundity' refers to the natural origin of the primordial source. This is the gateway to all marvels—first discussing the Dao, then Heaven and Earth, and finally human nature. It is exhaustive. Scholars must ponder and grasp this silently.*\n\n*'The Mysterious Female'*—*‘profound’* is yang, *‘female’* is yin. The ‘gate’ is the threshold where the two qi intermingle, as in the previous chapter: ‘the gateway to all marvels,’ or as the* **Analects** *say: ‘Who can exit without passing through the door? Why not follow this Way?’*\n\n*Do not rigidly interpret ‘the Mysterious Female’ as the nasal passages.*\n\n*‘The root of Heaven and Earth’*—*Laozi’s words imply that before Heaven and Earth existed, there was the primal qi, which is called the root of Heaven and Earth.*\n\n*‘When full, it must become empty.’* *Beware of excess.*\n*‘When sharp, it must become blunt.’* *Beware of aggression.*\n*‘Gold and jade must be burdened.’* *Beware of greed.*\n*‘Wealth and honor must lead to licentiousness.’* *Beware of arrogance.*\n*‘When achievement and fame are complete, danger follows.’* *Beware of not knowing when to stop.*\n\n*Laozi’s words are profound, meant to save people—not to say that those who abandon worldly affairs and retreat to mountains and forests can enter the Dao. Even amid wealth, honor, and fame, one may diligently practice it.*\n\n*‘When stretched, it must contract; when strong, it must weaken; when exalted, it must decline; when given, it must be taken.’* *This is the natural principle of things—what is called subtle clarity.*\n\n*‘Subtle clarity’*—*the refined and luminous, evident and verifiable.*\n\n*Some interpret this through the lens of stratagem, but the Dao of Heaven benefits without harming. Is this not so?*\n\n*Some say Confucius taught ‘responding to enmity with rectitude,’ yet here it says ‘responding with virtue.’ Why the difference?*\n\n*Yet Laozi teaches that one should only cultivate softness and weakness, aligning with Heaven without contention, thus averting Heaven’s punishments and distant calamities. If one responds to enmity with rectitude, how can enmity cease?*\n\n*Confucius’ words were spoken in response to his times, but responding with virtue is superior.*\n\n*As the reclusive scholar Xie Shouhao observed:*\n*The* **Daodejing** *was examined by Tang official Fu Yi, who compared numerous editions. The* **Xiang Yu Concubine Edition** *was unearthed in Pengcheng during the fifth year of Qi Emperor Wu’s reign (564 CE), when a tomb of Xiang Yu’s concubine was opened, and the text was found. The* **Anqiu Wangzhi Edition** *was obtained by Daoist Ge Xuan during the Taihe era of the Wei dynasty. The* **Hexiang Zhangren Edition** *was transmitted by the recluse Chou Yue of Qi.*\n\n*The Three Family Editions total 5,722 characters, matching the* **Yu Lao** *in* **Hanfeizi***. Additionally, there is an* **Official Edition of Luoyang** *with 5,635 characters, Wang Bi’s Edition with 5,683 or 5,610 characters, and the* **Hexiang Gong Edition** *with 5,355 or 5,590 characters. The commentaries of these schools vary in length, but over time, each has been transmitted with trust, sometimes cross-referenced with other editions, leading to discrepancies.*\n\n*As Sima Qian recorded in the* **Shiji***: ‘Laozi wrote a book on the meaning of Dao and virtue, with over five thousand words—though not reaching six thousand, it is still over five thousand.’*\n\n*The Daoist tradition claims Laozi’s text consists of five thousand words, likely referring to its entirety.*\n\n*See the* **Laojun Shilu***.*\n\n*The* **Collected Commentaries on the Authentic Daodejing** *concludes here.*",
      "overlap_context": " and the same—only differing in priority and sequence. They mutually illuminate each other, both crafted to address the world’s woes. Some claim Laozi abandoned* **‘Ren’** *and rejected* **‘Yi’** *, that* **‘Li’** *is the origin of disorder—this is not at odds with the Master’s teachings. Indeed, elevating the Dao’s source, the Master acknowledged that* **‘Ren, Yi, Li, and Le’** *can govern the world, but it is superior to govern through the Dao, allowing people to forget themselves within it.”*",
      "start_char": 20852,
      "end_char": 21577,
      "start_sentence": 678,
      "end_sentence": 704,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 11.930769681930542,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\道德真经集注杂说.txt",
        "category": "玉诀类"
      }
    }
  ]
}