{
  "source_id": "金丹直指",
  "source_file": "chunked_daozang\\金丹直指.json",
  "total_chunks": 6,
  "total_original_chars": 4531,
  "total_translated_chars": 27548,
  "total_translation_time": 90.59266185760498,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\金丹直指.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**Title: *The Direct Pointing of the Golden Elixir* (Experience Name: *The Direct Pointing of the Golden Elixir*)**\nOne scroll, compiled by Zhou Wusuozhu of the Southern Song Dynasty.\nSource of the base text: *The Orthodox Daoist Canon* (正统道藏), *Taixuan* (太玄) Section.\n\n---\n\n**Preface to *The Direct Pointing of the Golden Elixir***\nI composed *Sixteen Precepts on the Golden Elixir* (金丹十六－颂), speaking directly of the profound truths of life and nature, hence the title *Direct Pointing*.\n\nMoreover, the cultivation of clarity and insight into one’s true nature (*mingxin jianxing*) is a matter of the *Zongmen* (宗門, \"School of Orthodoxy\"), while returning to the root and reclaiming one’s original essence (*guigen fuchu*) belongs to the *Xuanmen* (玄門, \"School of Mysticism\"). Though these two paths differ in practice and cannot be directly compared, yet the *Xuanmen* speaks of refining the elixir (*liandan*), while the *Zongmen* speaks of tending the cow (*muniu*). For since the Great Primordial (*dapu*) has already dispersed, unless one refines it, there is no way to restore the essence and return to its original purity (*fanhui huanchun*); and since the six orifices (*liu chuang*) have already opened, unless one tends them, there is no way to wash away the darkness and reveal the radiant clarity (*zaohei loubai*).\n\nRefining and tending—though different paths, they lead to the same destination.\nMysticism and Orthodoxy—one yet two, two yet one.\n\nFrom my youth, I pursued studies unlike those of the world, cherishing the Dao with earnest devotion and seeking out teachers ever more widely. In the year *Chunyou* (淳佑), *Renyin* (壬寅) of the Southern Song, I encountered *Lin Jun Ziran* (林君自然) of Chicheng (赤城), who instructed me in the elixir method (*danfa*). He further led me to bow before his master, *Li Zhenren* (李真人), and in but a few words, I grasped the essentials of restoring the Golden Fire (*jinhuo fanhuan*). He also said that if one truly comprehends one’s nature (*wu xing*), then the practice becomes all the more appropriate.\n\nThus, I hastened to the groves of the *Zongmen*, seeking further guidance from the elders. Later, I learned that *Fang Zhengren* (方先生) of *Zongyang* (宗陽) and *Bixu* (碧虚) had received the transmission from *Zhang Zhenren* (張真人) of *Ziyang* (紫陽). In the spring of *Jiyou* (己酉), carrying the *Direct Pointing* (《直指》), I visited him. Though my feet had not yet crossed his threshold, my heart was already illuminated by his teachings.\n\nThat summer’s end, a monk named *Yuan Can* (圓灿) passed through my place from Putian (莆田). He spoke of the *Gouzi* (狗子, \"Dog-Demon\") discourse, and I found our understanding in harmony. Upon examining *Bao Tai Heshang’s* (寶台和尚) *Thousand-Year Stele* (《千歲碑》), when we reached the line about ingesting lead and mercury (*fuqian gong*), I grasped its meaning and declared: \"What are lead and mercury?\" He replied: \"They are the emotions of one’s nature (*qingxing*).\" I asked: \"Why so?\"\n\nI asked: \"May one take them?\" He replied: \"They are taken in accordance with the Middle Way.\"\n\nWhat is the Middle Way? It is neither emptiness nor non-emptiness, neither movement nor non-movement.\n\nYuan Can laughed and said: \"I have heard of two matters—could these be the ones referred to by *Yuanxiu* (圓修)?\"\n\nThough so, the difficulty of refining the elixir is such that only those with great strength and resolve can succeed.\n\nThe following spring’s end, the Master *Hao Chang* (昊長者) of *Rongzhu Pu* (茸竹浦) marked the ground for us at *Baiyun An* (白雲庵). After practicing for half a month, the work revealed itself clearly. I took *Zhang Zhenren’s* (紫陽張真人) *Preface to the Golden Elixir* (《金丹序》) and *Chen Zhenren’s* (泥丸陳真人) *Cerulean Void* (《翠虚昤》) to verify it, and each step corresponded perfectly.\n\nI grew ever more confident that the words of *Direct Pointing* were not in vain.\n\nSomeone said to me: \"The Dao has long been obscured. You may trust yourself, but if you seek to persuade others through writing, you will only add to the confusion.\"\n\nI replied: \"Belief is near to knowing, while disbelief is near to ignorance. The ancients said that the Dao is neither attributed to knowing nor to ignorance—knowing is delusive perception, ignorance is forgetfulness. Let those with clear vision examine it for themselves.\"\n\nIn the sixth month of *Chunyu* (淳佑), on the *gengxu* (庚戌) day when the sun lingers long—\n**Permanent Residence Zhou** (周無所住) of *Yongjia* (永嘉) wrote this preface.\n\n*Direct Pointing on the Golden Elixir*\n**Permanent Residence Zhou** (周無所住) records.\n\n**Ode to the Mystic Aperture**\nA single aperture opens—when one is clear, all are clear.\nNot a thread of motion betrays the true void.\n\nWithin lies the True Ancestor’s essence—\nRecognizing it as before yet still missing the mark.\n\n**Ode to True Soil**\nTrue Soil has always borne a mighty name,\nYet students seek it blindly, groping beside.\nIf one knows True Soil as the Middle Way,\nWhy ride the cow to find the cow again?\n\n**Ode to Yang Crystal**\nPure Yang Crystal, spotless and unmarked,\nA single flaw and it turns to Yin.\nHow many immortals never spoke of it—\nWho would pause to heed its silent truth?\n\n**On the Mystic Womb**\nAll things teeming, each returns to its root.\nKnow the source, and the Mystic Womb is passed in silence.\n\n**Ode to Dragon and Tiger**\nDragon and Tiger rage, their thoughts aflame.\nThe wisdom-sword swings—both beasts are slain.\n\n**Ode to Lead and Mercury**\nTo know Lead and Mercury’s natures—\nTwo substances harmonized, the Elixir complete.\n\n**Ode to the True Furnace**\nHead touches heaven, feet tread earth.\nWithin dwells One Thing, forged into treasure.\n\n**Ode to the True Medicine**\nBefore heaven and earth, rootless spirit-grass.\nWith single intent, it yields the supreme gem.\n\n**Ode to Scales**\nNeither round nor lacking—walking the Middle Way.\nFixating forgets; obsession breeds imbalance.\nSpeak of the sixteen *jin* and eight *liang*—\nOpen-eyed, yet who is truly deceived?\n\n**Ode to Extraction and Augmentation**\nAsk of extraction’s method—\nSeizing too late, the moment slips away.\nBalancing without excess or loss,\nOnly then does Non-Action manifest.\nKnow the True Mind’s boundless scope—\nYet self-obscured, turned by external things.\nPitiful are those who guard the stake,\nExchanging lead for mercury in vain tricks.\n\n**Ode to Fire and Timing**\nTrue Fire knows no measure—\nDo not force the guesswork of the age.\nTo grasp its essence:\nNeither departure nor arrival.\n\n**Ode to Method**\nPure ingredients, sealed with secret intent.\nTwelve hours pass—\nFire stoked without a thought.\n\n**Ode to the Oral Formula**\nIntent reaches, the heart is sincere—\nStill as jade, unshaken.\nDay and night without pause,\nEffects unfold naturally.\n\n**Ode to Bathing**\nNo special art to bathing—\nNo need to seek the hours of *mao* or *you*.\nHunger, sleep, or meal—\nEvery day, spring’s gentle breeze.\n\n**Ode to Practice**\nA hundred moments in one—push forward.\nOne moment equals twelve hours’ span.\nTwelve hours return to a single thought—\nWithin thought, no thought—then true marvel.\n\n**Ode to Nourishment**\nSerene, without thought or care,\nEmpty, letting nature take its course.\nThe embryo rounds—spirit transforms itself.\nMy fate is not decreed by heaven.\n\n---\n**Questions and Answers**\n\n**Question:** *The Golden Elixir Direct Pointing* clarifies the Dao’s essence, yet the sixteen odes speak only of *xing* (性, nature). Does this not conflict with *mingxue* (命学, the study of fate)?\n\n**Answer:** The Elixir’s essence is the enduring nature—\nThis is the indestructible Golden Adamantine.\nIt is the *Awakening to Reality*’s golden hue-body,\nManifesting the True Golden Compassion.\nWhen the Dragon Maiden suddenly grasped the heart-jewel,\nThis was the very method.\n\nStudents rarely fathom their inherent nature,\nChasing outward, speaking dragon-tiger tongues,\nCalling it *mingxue*—\nCalling Non-Action \"empty talk.\"\n\nAlas, how one-sided the view!\nThey do not know that nature and fate exhaust each other.\n\nNature is fate; fate is nature.\nBefore the void and kalpa, they were one—\nNameless, letterless.\nOnce caught in speech, they split as two.\n\nYet stillness cannot but move—\nMovement sets fate’s flow in motion.\nExcessive motion returns to stillness—\nFate’s nature roots again,\nEver the void-kalpa’s body,\nUnchanged, unlacking.\n\nMotion and stillness cycle endlessly—\nHow could they cease?\nThus, what issues from fate is called nature,\nWhat returns to nature is called fate—\nSame source, different names.\n\nHow could one seek fate beyond nature,\nOr nature beyond fate?\nIf one fails to grasp motion’s mechanism,\nThen calling nature and fate two things—\nA single word, and already mistaken.\n\nMaster Zhang of Purple Yang said:\n*\"If the Dao of nature and fate is incomplete,\nThe mind’s operation will not be universal.\"*\n\nMaster Bai of Azure Clarity said:\n*\"If one understands the *Vajra* and *Perfect Awareness* Sutras,\nThe Elixir’s meaning will naturally be clear—\nWhy distinguish between Laozi’s and the Buddha’s teachings?\"*\n\n**Question:** If Laozi’s and the Buddha’s teachings are the same,\nAre Confucian teachings also the same?\n\n**Answer:** Though teachings divide into three,\nThe Dao’s wealth is one.\nStudents’ roots and capacities differ,\nTheir knowledge shallow or deep—\nEach clings to their own school,\nMutually condemning, all losing the source.\n\nYet one body inherently contains the three teachings.\nIf Confucianism calls the other two heretical,\nIt only obscures its own truth—\nHow could it know that from the beginning,\nAll was unified without remainder?\n\nThus, the three teachings may all enter the Dao—\nOnly failing to find the gate.\nIf one penetrates Laozi and the Buddha,\nHow could Confucius be any different?\n\nEven in Confucian terms:\nFrom Yao to Shun, Shun to Yu,\nYu to Tang and Wu, Wu to Zhougong,\nZhougong to Confucius and Mencius—\nAll transmitted heart-to-heart.\n\nThe Buddhist path:\nFrom the World-Honored One to Kashyapa,\nKashyapa to Ananda—\nAlso heart-to-heart transmission.\n\nThe Daoist path:\nFrom the Eastern Heavenly Sovereign to the Golden Gate Sovereign,\nThe Golden Gate Sovereign to the Western Queen Mother—\nAll mouth-to-mouth.\nIf the enlightened see before being taught,\nThey fall into the second meaning—\nThen engage in lip-service,\nDrowning in transaction.\n\nHeart-transmission’s art\nLies solely in the *One* within.\n\n*The Book of Documents* says: *\"Hold fast to the Middle.\"*\n*The Treatise on Unity* says: *\"Let beings dwell in the Middle Way.\"*\n*The Dao De Jing* says: *\"Better to guard the Middle.\"*\nThis is to say: under heaven, there is no second path.\n\n*Zhuangzi* says: *\"Unified in the One, all things are complete.\"*\nMaster Zhang of Purple Yang says: *\"Obtaining the One, all things are complete.\"*\n\n**Question:** The three teachings are one—\nI’ve heard Daoism speaks of form and spirit both perfected,\nOr a body beyond the body.\nDoes Confucianism or Buddhism have this too?\n\n**Answer:** Buddhism also possesses it.\n\n「Take, for instance, Bodhidharma’s barefoot return to the West, the monk Pudao’s body beyond the body, Master Puhua’s alms bowl resonating with cosmic harmony, and Feikong Zhi’s empty bed awaiting supply at Yanshan—when he saw another monk ascend into the sky and depart, was this not of the same lineage?\n\nConfucianism differs, for it governs humanity’s path, upholding the Three Bonds and rectifying the Five Constants. It is a teaching of *action* (*youwei*), yet its essence is the *Way of non-action* (*wuwei*). The Way is one, but the teachings diverge.\n\n**Question:** If Confucianism, Buddhism, and Daoism share the same Way yet differ in teachings, how can Buddhism’s *chan* (meditation) and Daoism’s cultivation be the same?\n\n**Answer:** Under heaven, there is no second Way; sages have but one mind. You have not yet fathomed the nature of the mind, hence your question. *Chan* is the practice of fixing the mind in one place—beginning with sweeping away distractions until there is nothing left to sweep. *Chan* is the Buddha’s mind, and the mind is the source of all dharmas. Cultivation (*xiuyang*) is the practice of embracing the Primordial and preserving the One, progressing until there is no cultivation left. The Way is the nurturing of the spirit, and the spirit is the sovereign of all things. Spirit is mind, mind is the Way, and the Way is *chan*.\n\nThe Great Way of non-action transcends names and forms, is beyond birth and death, dwells eternally in the void, and claims nothing. It responds when things arise and returns to stillness when they pass—like a mirror reflecting images without retaining traces. It is called the Way by force of convention. Students here may doubt it as mere talk of emptiness and stillness, yet those who grasp it know that speaking of emptiness is not emptiness itself; only when one transcends emptiness does one attain true emptiness. True emptiness is thus called *One*.\n\nThe *One* is the origin of the Great Way, the mother of the Golden Elixir, and the root of all life. Laozi says: *\"Embrace the One as the model for all under heaven.\"* Yet the method of non-action cannot be rigidly grasped as reality, hence the *Diamond Sutra* states: *\"All worthy sages differ in their adherence to the Way of non-action.\"*\n\n**Question:** Having clarified that Confucianism, Buddhism, and Daoism share the same Way, I still seek the *Xuan Guan* (Mysterious Pass) and the *Xuan Dan* (Mysterious Female)—some say the mind and kidneys are the pass, the mouth and nose the gate, while others claim it is neither mind nor kidneys, neither mouth nor nose. Which is correct?\n\n**Answer:** The notions of mind, kidneys, mouth, and nose were used by earlier masters to guide seekers into the Way, yet they feared obscuring the truth by making people cling to mere fleshly orifices and overlook the original, true emptiness of life’s vital pulse. Thus, they said it is *neither* mind nor kidneys, *neither* mouth nor nose—to sweep away attachment to these illusions. In truth, the *Xuan Guan* and *Xuan Dan* refer to the place where thoughts arise and cease.\n\nLaozi says: *\"The Mysterious Female is the root of heaven and earth.\"* The Purple Clarity White Immortal says: *\"The place where thoughts move is the Mysterious Female.\"* If one can recognize the process of arising and ceasing, one knows the Valley of the Void and the Mother of Transformation. Not only do all alchemical elixirs, medicines, and fire-refining techniques stem from here, but all schools of thought, the entire Tripiṭaka, and every art and craft are contained within it.\n\nMaster Zhang of Purple Yang says: *\"This pass has no boundaries, neither inside nor outside.\"* The Purple Clarity White Immortal says: *\"The Mysterious Pass is boundless—vast without external limits, minute without internal confines.\"* Master Shi of the Peach Grove says: *\"This pass is called the Mysterious Female, within which *qi* and spirit are housed.\"*\n\n**Question:** Having clarified the Mysterious Pass and the Mysterious Female, what of *true soil* (*zhen tu*) and *yang crystal* (*yang jing*)?\n\n**Answer:** *Soil* is another name for the *Middle*. Those who attain the Middle merge essence and life, achieving a serene, luminous wholeness—this is called *yang crystal*. Master Zhang of Purple Yang says: *\"At the central, upright position, the Mysterious Pearl is produced—anciently called the birth of a luminous pearl, which is true soil.\"*\n\n**Question:** Having understood *true soil* and *yang crystal*, may I inquire about the *Dragon* and *Tiger*, *lead* and *mercury*?\n\n**Answer:** The *Dragon* and *Tiger*, *lead* and *mercury*, refer to the human mind’s thoughts. When thoughts do not cease, they rage like the Dragon and Tiger, or are as uncontrollable as lead and mercury. Master Liu of the Sea Toad says: *\"One who rides the Heavenly Horse and chases the Dragon away, who tames the Earth Ox and subdues the Tiger, has mastered them.\"* Master Zhang of Purple Yang says: *\"Lead flees at fire’s approach, mercury scatters at fire’s touch. If one knows the method of subjugation, the mind will naturally be without mind, and thoughts without thoughts—this is the taming of the Dragon, subduing the Tiger, capturing the lead, and controlling the mercury.\"*\n\n**Question:** Having understood the Dragon, Tiger, lead, and mercury, what of the *furnace*, *cauldron*, and *medicines*?\n\n**Answer:** The *furnace* and *cauldron* are metaphors for the body, and the *medicines* symbolize the treasures within the mind. There is no mind outside the body, nor treasure outside the mind—how could one seek medicines apart from the mind or a cauldron apart from the body? Thus, the Way is not distant from humanity; it is humanity itself that distances itself from it.\n\nMaster Huan says: *\"The mind is the Heavenly Void, originally the Six Empty [hexagrams of the *Yijing*], the body is the Earthly [principle], the two are inseparably bound.\"* The Purple Clarity White Immortal says: *\"The mind contains boundless medicinal herbs, the body contains boundless fire talismans.\"* Master Zhang of Purple Yang says: *\"The mind belongs to Heaven (*qian*), the body to Earth (*kun*), hence the cauldron is called *qian-kun* (Heaven-Earth).\"*\n\nIndeed, this is but a way to urge students to reflect inward, conquer the self, and return to the origin. If one’s thoughts have not yet arisen, yet encompass all transformation, is this not the true cauldron? If one responds externally without inner agitation, is this not the true medicine?\n\n**Question:** Having clarified the cauldron, furnace, and medicines, what of *fire-refining*, *degrees*, *scales*, and *additions*?\n\n**Answer:** Discussions of fire-refining, degrees, and scales arise from partial adherence to stillness or movement, failing to grasp the Middle. If one forgets movement in stillness and stillness in movement—remaining still within stillness, moving within immobility—this is the balance of yin and yang in the Middle. When true soil converges, the Dao of immortality is complete.\n\nMaster Zhang of Purple Yang says: *\"The dryness of fire and the excess of water must be harmonized, hence the scales and degrees.\"* The earlier masters said: *\"Neither adding nor subtracting, neither extracting nor supplementing—this is the way.\"*\n\n**Question:** Having clarified *fire-refining* and *degrees*, what meaning lies in the *artistic incantations* (*gōnghū kǒujué*)?\n\n**Answer:** The discussion of artistic incantations is like the *qin*, *se*, and *yínghóu*—though they produce wondrous sounds, without mastering the skillful fingers, they cannot be played at will. How much more so for the *elixir of immortality*?\n\nIf one attains the true transmission, even a single word suffices to begin practice, and its effects manifest accordingly. One need not wait for the *month within the year*, the *day within the month*, the *hour within the day*, or the *moment within the hour*. Nor should one rely on the *five phases of the day* (子 *zǐ*, 午 *wǔ*, 卯 *mǎo*, 酉 *yǒu*), the *ten heavenly stems and twelve earthly branches* (*zhīgān*), or the *eight trigram phases* (*guàqì*) for guidance. Instead, in all *movements and stillness*—walking, standing, sitting, lying—one must maintain purity and *seal the keys* (*qīngzhēng qiànjiàn*). Then, the *yang-qi* will naturally arise.\n\nMaster Zhang of Purple Yang says: *\"At this stage of cultivation, the **dantian** (*nǐhuán*) generates wind, the **cinnabar palace** (*Jiànggōng*) shines with moon, and the **elixir field** (*dāntián*) blazes with fire.\"*\n\nMaster Chen of the Dantian says: *\"At first, the **spinal governing vessel** (*jīapéi guānmài*) opens; next, the **bladder meridian** (*pángguāng*) burns like fire. Within, the two **kidneys** (*liángshèn*) boil like soup, and at times, they surge and strike the **heart source** (*xīnyuán*). There is also the **cluster of a hundred meridians** (*yīcù bǎimài*), which is the essence of the practice’s efficacy.\"*\n\nYet the core of purity and sealing the keys lies in what Master Shi of the Apricot Grove (*Xìnglín*) says: *\"How could one know the elixir’s secret incantation? All day long, one must dwell in the **true emptiness** (*zhēnkōng*).\"*\n\nMaster Chen of the Dantian says: *\"The ancient sage left behind the elixir’s incantation: **‘From nothingness, something arises—this is the foundation of the elixir.’** The *Sutra of the Mind Seal* (*Xīnyìn Jīng*) states: **‘Preserve the non-existent, guard the existent.’** Laozi says: **‘Diligently maintain stillness.’** These are the true meanings of the incantations. The teachings of past and future sages are but one tongue, one nostril—yet still, one must not stray into false paths or fall into verbal traps. Though the thousand sages differ in their methods, before the **Supreme Venerable Lord Lao** (*Tàishàng Lǎojūn*) wrote scriptures or the **multitude of immortals** (*qúnxiān*) formalized incantations, insects and plants, when their fruits ripen and they shed their forms, still reveal the marvels of transformation. How much more so for humans, the most refined of all creatures? The scholar must cultivate this insight.\"*\n\n**Question:** Though the meaning of the artistic incantations has been clarified, I still do not understand the significance of *bathing and nourishing* (*mùyù wēnyǎng*).\n\n**Answer:** Bathing refers to purifying the present moment (*qīngjīn*), while nourishing signifies attaining the Middle (*zhōng*). To abandon it brings stagnation; to cling to it leads to dryness. Beyond clinging or abandoning lies *nourishing*—the daily practice. A pure mind resists no dust; when all things are brought to the Middle, the Dao acts effortlessly. Effortless action is the path to all transformation.\n\nMaster Shi of the Apricot Grove says: *\"Nourishing has no other technique—it is simply **‘nourishing within the Middle.’**\"*\n\n**Question:** Having grasped the essence of the *Sixteen Stanzas* (*Shíliù Sòng*), I wonder—does the saying of *forming the embryo and shedding the body* (*jiétāi tuōtǐ*) truly exist?\n\n**Answer:** Forming the embryo and shedding the body is akin to transcending the mundane and entering the sacred. It is achieved when the mind does not cling to external things, the spirit returns to the *qi*, and the **sacred embryo is reborn** (*huànjié shèngtāi*). Nurturing this deeply, the spirit becomes complete and the *qi* transforms—this is *shedding the body*.\n\nThe ancients said: *\"To follow is to be mundane; to resist is to be sacred.\"* The Venerable Master Xu of the Empty Stillness (*Xūjìng Tiānshī*) says: *\"If the spirit departs, bring it back. When the spirit returns, the *qi* flows naturally. Morning and evening, thus practiced, the **innocent child** (*chìzǐ*) will naturally produce the **true embryo** (*zhēntāi*).\"*\n\nThe Original Sage (*Běnlái Zǐ*) says: *\"The spirit in the body brings life; the spirit leaving the body brings death.\"* Master Bai of Purple Clarity (*Zǐqīng*) says: *\"A body outside the body is **shedding the form** (*tuōtǐ*).\"* The *Sutra of the Pure Abiding* (*Léngyán Jīng*) states: *\"The form and spirit emerge from the embryo—one becomes a child of the Buddha. The mind detached from the body, free in coming and going, is the true meaning.\"*\n\nMaster Zhang of Purple Yang says: *\"The elixir is the **wondrous treasure of the colored body** (*sèshēn miàobǎo*), while the **Dharma-body** (*fǎshēn*) is the **true heart** (*zhēnxīn*). From the beginning, it has neither color nor sound—one essence requires no dual recognition.\"*\n\n**Question:** Though the meaning of forming the embryo and shedding the body has been clarified, I still do not know how many days it takes to achieve *Yuan* (*Yuán*).\n\nThe texts say it may take *one day*, *three days*, *a hundred days*, *a year*, *nine years*, *a single meal*, or *not within three years and nine months*—my heart remains in doubt.\n\n**Answer:** The discussions of years and months differ between the ancients and later scholars due to varying capacities and depths of practice. They merely reveal the timing of the **piercing and clustering** (*zuàncù*)—the cycles of *heaven’s cold and heat* (*tiānyī hánshǔ*), the *day and night* (*rìyè*) of humankind, and the *breath’s exhalation and inhalation* (*xīyī chūrù*).\n\nIn a single moment of practice, there lies an entire year’s worth of seasons. Within a year are thirty-six thousand moments—one can seize them all in an instant. This is called **‘grasping the pivot of yin and yang** (*zhuó yīnyáng shūjī*) and **‘stealing the creative forces of heaven and earth** (*dào tiāndì zàohuà*)—all within a single thought of the practitioner.\n\nWith a resolute mind and pure practice, when the time arrives, the principle will naturally manifest.\n\nMaster Cao of the Numinous Source (*Língyuán*) says: *\"Cultivate with a single, unwavering resolve—whether success or failure, there is no fixed outcome.\"* How could it be limited to a set duration?\n\nIf one simply maintains purity, stillness, and effortless action, how could the **form and spirit not be perfected**, and how could one fail to align with the **true Dao**?\n\nWhen one aligns with the true Dao, the elixir is but a borrowed name. The **mysterious pass and mysterious gate** (*Xuán guān xuánbǐng*), the **true soil and yang essence** (*zhēntǔ yángjīng*), the **Dragon and Tiger, lead and mercury** (*lónghǔ yīnyáng*), the **furnace, cauldron, and medicinal substances** (*lú dǐng yàowù*), the *scales, degrees, and fire-refining* (*jīnliǎng huǒhòu chōutiān*), the *artistic incantations* (*gōnghū kǒujué*), the *bathing and nourishing* (*mùyù wēnyǎng*), and all these marvelous sayings—one must not **‘seek with the mind’** (*yǒuxīn qiú*), nor must one **‘obtain without the mind’** (*wúxīn dé*). Do not cling to existence or non-existence.\n\nConfucius, borrowing the words of the World-Honored One (*Shìjiè Rén*), and Laozi, hearing them directly—**‘hearing is not hearing, speaking is not speaking.’** A single grain of elixir is neither color nor sound; at the moment, I pluck it out for you to see—yet it cannot be swallowed as a whole. The entire body is the **incantation itself** (*kǒujué*), yet it cannot be taken in.\"\n\n**Question:** The teachings on the elixir are profound yet unattainable, and the incantations of the immortals, though subtle and hidden, cannot be directly pointed to. Yet your explanations seem too straightforward—are they not excessively shallow?\n\n**Answer:** No. The immortals wished for people to seek the Dao themselves, so they hid depth within shallowness, and people did not understand. Now, I wish for all to know the Dao, so I conceal shallowness within depth, making it easier for people to grasp.\n\nAs for Confucius’ nature and the Dao of heaven—though even his most accomplished disciples could not hear it, when Mencius spoke to Zicheng, the meaning became clear and luminous.\n\nThe **Laozi** speaks of it as **subtle, refined, and penetratingly profound** (*wēimiàoxuāntōng*), seemingly difficult to seek. Yet he also says, *\"My Dao is most easy to know, most easy to practice\"* (*wú dào shèn yì zhī, shèn yì xíng*), so it was never truly profound in the first place.\n\nThe **World-Honored One** (*shìzūn*) speaks of it as **hidden, secure, and distant** (*yōugù shēnyuǎn*), saying no one can reach it, which seems deep. Yet he directly points to the **human heart** (*rénxīn*), declaring that **seeing one’s true nature** (*jiànxìng*) leads to **Buddhahood** (*chéngfó*), so where is the depth?\n\nWhat you call *\"pointing too directly\"* (*zhǐguò zhí*), is it not excessive shallowness? **The elixir’s essence is direct and clear** (*jīndān zhízhǐ jìng*).",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "金丹直指 经名：金丹直指。 一卷，南宋周无所住述。 底本出处：《正统道藏》太玄部。 金丹真指序 余着金丹十六－颂，直言性命之奥，故以直指言之。 且明心见性，宗门事也，归根复命，玄门事也。 宗玄异事若不可比而同之，然玄谓之炼丹，宗谓之牧牛，抑以大朴既散，非炼之则无以返漓还淳； 六窗既开，非牧之则无以澡黑露白。 曰炼日牧，殊途同归，曰玄日宗，一而二，二而一者也。 余自幼学时与世异好，慕道既切，访师益广。 淳佑壬寅年，遇赤城林君自然，以丹法授余。 又拉余拜其师李真人，片言之间，尽得金火返还之要，且谓若悟性而后为之尤当也。 余乃褊走丛林，请益诸老，继闻宗阳碧虚方先生得紫阳张真人之传，己酉仲春挟《直指》访之，足始跨门，心已相照。 是岁季夏，有僧圆灿自莆田过余，举狗子话相契，因览宝台和尚《千岁碑》，至服铅汞句，执其义曰：铅汞何物也？ 日情性也。 何也？",
      "translated_text": "**Title: *The Direct Pointing of the Golden Elixir* (Experience Name: *The Direct Pointing of the Golden Elixir*)**\nOne scroll, compiled by Zhou Wusuozhu of the Southern Song Dynasty.\nSource of the base text: *The Orthodox Daoist Canon* (正统道藏), *Taixuan* (太玄) Section.\n\n---\n\n**Preface to *The Direct Pointing of the Golden Elixir***\nI composed *Sixteen Precepts on the Golden Elixir* (金丹十六－颂), speaking directly of the profound truths of life and nature, hence the title *Direct Pointing*.\n\nMoreover, the cultivation of clarity and insight into one’s true nature (*mingxin jianxing*) is a matter of the *Zongmen* (宗門, \"School of Orthodoxy\"), while returning to the root and reclaiming one’s original essence (*guigen fuchu*) belongs to the *Xuanmen* (玄門, \"School of Mysticism\"). Though these two paths differ in practice and cannot be directly compared, yet the *Xuanmen* speaks of refining the elixir (*liandan*), while the *Zongmen* speaks of tending the cow (*muniu*). For since the Great Primordial (*dapu*) has already dispersed, unless one refines it, there is no way to restore the essence and return to its original purity (*fanhui huanchun*); and since the six orifices (*liu chuang*) have already opened, unless one tends them, there is no way to wash away the darkness and reveal the radiant clarity (*zaohei loubai*).\n\nRefining and tending—though different paths, they lead to the same destination.\nMysticism and Orthodoxy—one yet two, two yet one.\n\nFrom my youth, I pursued studies unlike those of the world, cherishing the Dao with earnest devotion and seeking out teachers ever more widely. In the year *Chunyou* (淳佑), *Renyin* (壬寅) of the Southern Song, I encountered *Lin Jun Ziran* (林君自然) of Chicheng (赤城), who instructed me in the elixir method (*danfa*). He further led me to bow before his master, *Li Zhenren* (李真人), and in but a few words, I grasped the essentials of restoring the Golden Fire (*jinhuo fanhuan*). He also said that if one truly comprehends one’s nature (*wu xing*), then the practice becomes all the more appropriate.\n\nThus, I hastened to the groves of the *Zongmen*, seeking further guidance from the elders. Later, I learned that *Fang Zhengren* (方先生) of *Zongyang* (宗陽) and *Bixu* (碧虚) had received the transmission from *Zhang Zhenren* (張真人) of *Ziyang* (紫陽). In the spring of *Jiyou* (己酉), carrying the *Direct Pointing* (《直指》), I visited him. Though my feet had not yet crossed his threshold, my heart was already illuminated by his teachings.\n\nThat summer’s end, a monk named *Yuan Can* (圓灿) passed through my place from Putian (莆田). He spoke of the *Gouzi* (狗子, \"Dog-Demon\") discourse, and I found our understanding in harmony. Upon examining *Bao Tai Heshang’s* (寶台和尚) *Thousand-Year Stele* (《千歲碑》), when we reached the line about ingesting lead and mercury (*fuqian gong*), I grasped its meaning and declared: \"What are lead and mercury?\" He replied: \"They are the emotions of one’s nature (*qingxing*).\" I asked: \"Why so?\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 369,
      "start_sentence": 0,
      "end_sentence": 16,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 9.90499758720398,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\金丹直指.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "可服欤？ 日以中道也。 中者何？ 日空不空、动非动也。 圆灿笑曰：予闻有二事，圆修者其谓是欤？ 虽然，成丹之难，非赖巨有力者不能也。 次岁暮春，昊长者茸竹浦白云庵，为余二人地。 行之半月，工夫显发，取紫阳张真人《金丹序》、泥丸陈真人《翠虚昤》印之，节节符验。 予益自信《直指》所言不妄。 或谓予曰：道之不明久矣，子自信可也，而以着书求信於人，恐柢益其纷纷耳。 余应之曰：信者近於知，不信者近於不知也。 古人所谓道不属知，不属不知，知是妄觉，不知是无记。 明眼底人试一展卷。 淳佑庚戌六月中渐日永嘉周无所住序。 金丹直指 永嘉周无所住述",
      "translated_text": "I asked: \"May one take them?\" He replied: \"They are taken in accordance with the Middle Way.\"\n\nWhat is the Middle Way? It is neither emptiness nor non-emptiness, neither movement nor non-movement.\n\nYuan Can laughed and said: \"I have heard of two matters—could these be the ones referred to by *Yuanxiu* (圓修)?\"\n\nThough so, the difficulty of refining the elixir is such that only those with great strength and resolve can succeed.\n\nThe following spring’s end, the Master *Hao Chang* (昊長者) of *Rongzhu Pu* (茸竹浦) marked the ground for us at *Baiyun An* (白雲庵). After practicing for half a month, the work revealed itself clearly. I took *Zhang Zhenren’s* (紫陽張真人) *Preface to the Golden Elixir* (《金丹序》) and *Chen Zhenren’s* (泥丸陳真人) *Cerulean Void* (《翠虚昤》) to verify it, and each step corresponded perfectly.\n\nI grew ever more confident that the words of *Direct Pointing* were not in vain.\n\nSomeone said to me: \"The Dao has long been obscured. You may trust yourself, but if you seek to persuade others through writing, you will only add to the confusion.\"\n\nI replied: \"Belief is near to knowing, while disbelief is near to ignorance. The ancients said that the Dao is neither attributed to knowing nor to ignorance—knowing is delusive perception, ignorance is forgetfulness. Let those with clear vision examine it for themselves.\"\n\nIn the sixth month of *Chunyu* (淳佑), on the *gengxu* (庚戌) day when the sun lingers long—\n**Permanent Residence Zhou** (周無所住) of *Yongjia* (永嘉) wrote this preface.\n\n*Direct Pointing on the Golden Elixir*\n**Permanent Residence Zhou** (周無所住) records.",
      "overlap_context": "y his teachings.\n\nThat summer’s end, a monk named *Yuan Can* (圓灿) passed through my place from Putian (莆田). He spoke of the *Gouzi* (狗子, \"Dog-Demon\") discourse, and I found our understanding in harmony. Upon examining *Bao Tai Heshang’s* (寶台和尚) *Thousand-Year Stele* (《千歲碑》), when we reached the line about ingesting lead and mercury (*fuqian gong*), I grasped its meaning and declared: \"What are lead and mercury?\" He replied: \"They are the emotions of one’s nature (*qingxing*).\" I asked: \"Why so?\"",
      "start_char": 369,
      "end_char": 628,
      "start_sentence": 17,
      "end_sentence": 32,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 4.645010709762573,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\金丹直指.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "玄关一窍颂 一窍才通万窍通，丝毫不动露真空。 个中便是真宗祖，认着依前又不中。 真土颂 真土从来名强立，学人不晓馒傍求。 若知真土为中道，何必骑牛更觅牛。 阳晶颂 全清绝点号阳晶，才有纤瑕便属阴。 多少神仙皆不说，谁人肯向此留心。 玄牝烦 万物芸芸，各归其根。 识得根源，玄牝虚传。 龙虎颂 龙虎猖狂，心念炎烈。 慧剑才挥，二兽俱灭。 铅汞颂 欲识铅汞，情性二物，二物和合，还丹了毕。 真炉鼎颂 头上顶天，脚下踏地。 中有一物，煅成宝器。 真药物颂 天地之先，无根灵草。 一意制度，产成至宝。 斤两颂 不圆不缺行中道，着意忘怀便落偏。 更言二八一斤数，开眼明明被孰瞒。 抽添颂 若问抽添法，纵擒怕觉迟。 调停无损益，方始证无为。 识得真心无不褊，自己不明被物转○ 可怜无限守株人，退铅进汞错方便。 火候颂 真火本无候，时人休强猜。 要知端的意，无去亦无来。 法度颂 清净药材，密意为丸。 十二时中，无念火煎。 口诀颂 意到心诚，湛然若凝。 昼夜无间，效验自应。 沐浴颂 沐浴无他术，休寻卯酉中。 困眠饥吃饭，无日不春风。 工夫颂 百刻工夫一刻推，一刻还同十二时，十二时中归一念，念中无念始真奇。 温养颂 恬淡无思虑，虚无任自然。 胎圆神自化，我命不由天。 或问 或问：《金丹直指》既明道要，但十六颂皆言性宗语，於命学恐或不然。 答曰：金丹谕本性长存，是名金刚不坏，即《悟真篇》金丹妙色之身，证真金慈相，昔龙女顿悟心珠，乃此法也。 学者罕明本性，向外驰求，说龙话虎，便为命学，无为之道，便为谈空。 噫，何见之偏？ 是未知尽性以至於命也。 性即命，命即性，空劫之先，性命混然，无名无字，才堕语言，便分为两。 但静极不能不动，动则天命流行，动极复静，天命之性归根，依然空劫之体，无所亏欠。 动静循环，曷有止息。 是知出於命者谓之性，归於性者谓之命，性命同出而异名也。 安得性外求命，命外求性者乎？ 若不明动静之机，便指性命为二事，一言之，又是错认。 紫阳张真人云：性命之道未备，则运心不普。 紫清白真人云：若晓《金刚》、《圆觉》二经，则金丹之义自明，何必分别老释之异同也。 或问：老释之教既同，而儒教同否？ 答曰：教虽分三，道财一也。 学者根器不等，闻见浅深，各宗其宗，互相是非，皆失其本。 殊不知一身本具三教。 儒指两教为异端，则自昧本真，岂知无始以来，含一统而无遗哉。 故三教皆可入道，特患不得其门而入。 有能透彻释老，岂谓孔圣异哉？ 且以儒教言之，自尧传之舜，舜传之禹，禹传之汤文武周公，汤文武周公传之孔孟，皆心传之妙。 释教自世尊传之迦叶，迦叶传之阿难，亦以心印心。 道教自东华帝君传之金阙帝君，金阙帝君传之西王母，西王母皆以口口相传，若明眼者未举先知已落第二义，更从事於颊舌，转没交涉矣。 心传之学，不外乎中之一字。 《书》曰：允执症中，《合论》曰：令众生住於中道，《道德经》云：不如守中，可谓天下无二道。 《庄子》曰：通於一，万事毕，紫阳张真人云：得一万事毕是也。 或问：三教而一矣，吾闻道教有形神俱妙，或身外有身，儒释有否？ 答曰：释教亦有之。",
      "translated_text": "**Ode to the Mystic Aperture**\nA single aperture opens—when one is clear, all are clear.\nNot a thread of motion betrays the true void.\n\nWithin lies the True Ancestor’s essence—\nRecognizing it as before yet still missing the mark.\n\n**Ode to True Soil**\nTrue Soil has always borne a mighty name,\nYet students seek it blindly, groping beside.\nIf one knows True Soil as the Middle Way,\nWhy ride the cow to find the cow again?\n\n**Ode to Yang Crystal**\nPure Yang Crystal, spotless and unmarked,\nA single flaw and it turns to Yin.\nHow many immortals never spoke of it—\nWho would pause to heed its silent truth?\n\n**On the Mystic Womb**\nAll things teeming, each returns to its root.\nKnow the source, and the Mystic Womb is passed in silence.\n\n**Ode to Dragon and Tiger**\nDragon and Tiger rage, their thoughts aflame.\nThe wisdom-sword swings—both beasts are slain.\n\n**Ode to Lead and Mercury**\nTo know Lead and Mercury’s natures—\nTwo substances harmonized, the Elixir complete.\n\n**Ode to the True Furnace**\nHead touches heaven, feet tread earth.\nWithin dwells One Thing, forged into treasure.\n\n**Ode to the True Medicine**\nBefore heaven and earth, rootless spirit-grass.\nWith single intent, it yields the supreme gem.\n\n**Ode to Scales**\nNeither round nor lacking—walking the Middle Way.\nFixating forgets; obsession breeds imbalance.\nSpeak of the sixteen *jin* and eight *liang*—\nOpen-eyed, yet who is truly deceived?\n\n**Ode to Extraction and Augmentation**\nAsk of extraction’s method—\nSeizing too late, the moment slips away.\nBalancing without excess or loss,\nOnly then does Non-Action manifest.\nKnow the True Mind’s boundless scope—\nYet self-obscured, turned by external things.\nPitiful are those who guard the stake,\nExchanging lead for mercury in vain tricks.\n\n**Ode to Fire and Timing**\nTrue Fire knows no measure—\nDo not force the guesswork of the age.\nTo grasp its essence:\nNeither departure nor arrival.\n\n**Ode to Method**\nPure ingredients, sealed with secret intent.\nTwelve hours pass—\nFire stoked without a thought.\n\n**Ode to the Oral Formula**\nIntent reaches, the heart is sincere—\nStill as jade, unshaken.\nDay and night without pause,\nEffects unfold naturally.\n\n**Ode to Bathing**\nNo special art to bathing—\nNo need to seek the hours of *mao* or *you*.\nHunger, sleep, or meal—\nEvery day, spring’s gentle breeze.\n\n**Ode to Practice**\nA hundred moments in one—push forward.\nOne moment equals twelve hours’ span.\nTwelve hours return to a single thought—\nWithin thought, no thought—then true marvel.\n\n**Ode to Nourishment**\nSerene, without thought or care,\nEmpty, letting nature take its course.\nThe embryo rounds—spirit transforms itself.\nMy fate is not decreed by heaven.\n\n---\n**Questions and Answers**\n\n**Question:** *The Golden Elixir Direct Pointing* clarifies the Dao’s essence, yet the sixteen odes speak only of *xing* (性, nature). Does this not conflict with *mingxue* (命学, the study of fate)?\n\n**Answer:** The Elixir’s essence is the enduring nature—\nThis is the indestructible Golden Adamantine.\nIt is the *Awakening to Reality*’s golden hue-body,\nManifesting the True Golden Compassion.\nWhen the Dragon Maiden suddenly grasped the heart-jewel,\nThis was the very method.\n\nStudents rarely fathom their inherent nature,\nChasing outward, speaking dragon-tiger tongues,\nCalling it *mingxue*—\nCalling Non-Action \"empty talk.\"\n\nAlas, how one-sided the view!\nThey do not know that nature and fate exhaust each other.\n\nNature is fate; fate is nature.\nBefore the void and kalpa, they were one—\nNameless, letterless.\nOnce caught in speech, they split as two.\n\nYet stillness cannot but move—\nMovement sets fate’s flow in motion.\nExcessive motion returns to stillness—\nFate’s nature roots again,\nEver the void-kalpa’s body,\nUnchanged, unlacking.\n\nMotion and stillness cycle endlessly—\nHow could they cease?\nThus, what issues from fate is called nature,\nWhat returns to nature is called fate—\nSame source, different names.\n\nHow could one seek fate beyond nature,\nOr nature beyond fate?\nIf one fails to grasp motion’s mechanism,\nThen calling nature and fate two things—\nA single word, and already mistaken.\n\nMaster Zhang of Purple Yang said:\n*\"If the Dao of nature and fate is incomplete,\nThe mind’s operation will not be universal.\"*\n\nMaster Bai of Azure Clarity said:\n*\"If one understands the *Vajra* and *Perfect Awareness* Sutras,\nThe Elixir’s meaning will naturally be clear—\nWhy distinguish between Laozi’s and the Buddha’s teachings?\"*\n\n**Question:** If Laozi’s and the Buddha’s teachings are the same,\nAre Confucian teachings also the same?\n\n**Answer:** Though teachings divide into three,\nThe Dao’s wealth is one.\nStudents’ roots and capacities differ,\nTheir knowledge shallow or deep—\nEach clings to their own school,\nMutually condemning, all losing the source.\n\nYet one body inherently contains the three teachings.\nIf Confucianism calls the other two heretical,\nIt only obscures its own truth—\nHow could it know that from the beginning,\nAll was unified without remainder?\n\nThus, the three teachings may all enter the Dao—\nOnly failing to find the gate.\nIf one penetrates Laozi and the Buddha,\nHow could Confucius be any different?\n\nEven in Confucian terms:\nFrom Yao to Shun, Shun to Yu,\nYu to Tang and Wu, Wu to Zhougong,\nZhougong to Confucius and Mencius—\nAll transmitted heart-to-heart.\n\nThe Buddhist path:\nFrom the World-Honored One to Kashyapa,\nKashyapa to Ananda—\nAlso heart-to-heart transmission.\n\nThe Daoist path:\nFrom the Eastern Heavenly Sovereign to the Golden Gate Sovereign,\nThe Golden Gate Sovereign to the Western Queen Mother—\nAll mouth-to-mouth.\nIf the enlightened see before being taught,\nThey fall into the second meaning—\nThen engage in lip-service,\nDrowning in transaction.\n\nHeart-transmission’s art\nLies solely in the *One* within.\n\n*The Book of Documents* says: *\"Hold fast to the Middle.\"*\n*The Treatise on Unity* says: *\"Let beings dwell in the Middle Way.\"*\n*The Dao De Jing* says: *\"Better to guard the Middle.\"*\nThis is to say: under heaven, there is no second path.\n\n*Zhuangzi* says: *\"Unified in the One, all things are complete.\"*\nMaster Zhang of Purple Yang says: *\"Obtaining the One, all things are complete.\"*\n\n**Question:** The three teachings are one—\nI’ve heard Daoism speaks of form and spirit both perfected,\nOr a body beyond the body.\nDoes Confucianism or Buddhism have this too?\n\n**Answer:** Buddhism also possesses it.",
      "overlap_context": "near to knowing, while disbelief is near to ignorance. The ancients said that the Dao is neither attributed to knowing nor to ignorance—knowing is delusive perception, ignorance is forgetfulness. Let those with clear vision examine it for themselves.\"\n\nIn the sixth month of *Chunyu* (淳佑), on the *gengxu* (庚戌) day when the sun lingers long—\n**Permanent Residence Zhou** (周無所住) of *Yongjia* (永嘉) wrote this preface.\n\n*Direct Pointing on the Golden Elixir*\n**Permanent Residence Zhou** (周無所住) records.",
      "start_char": 628,
      "end_char": 1951,
      "start_sentence": 33,
      "end_sentence": 108,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 17.42155146598816,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\金丹直指.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "且如达磨只履西归，布袋和尚身外有身，普化振锡，飞空智者空榻赴供仰山，见异僧腾空而去，岂非同一脉耶？ 儒教则不然，盖为人道之主，扶三纲正五常，乃有为之教，实无为之道，道同而教不同也。 或问：儒与释老，道同而教不同。 释参禅，道修养，又安得释与道同？ 敢再请其说。 答曰：天下无二道，圣人无两心。 子未明心地，故发此问。 参禅则制心一处，始扫至於无扫，禅是佛心，心为万法之宗。 修养为抱元守一初修至於无修，道为养神，神为万物之主。 神即心，心即道，道即禅也。 盖无为大道者，离名相、无生死，常处虚空，无有纤得，事来则应，事去则寂。 如鉴照相，不留形迹，强名曰道。 学者至此，疑为谈空寂，遂望风而退，殊不知谈空者非空，非空即真空，真空故名曰一。 一乃大道之祖，金丹之母，生灵之本。 老子云：抱一为天下式，然无为之法不可便执为实，故《金刚经》云：一切贤圣，皆以无为法而有差殊。 非具眼者，孰可语也！ 或问：释老儒道同之说已备得其旨矣，但玄关一窍，玄牝之门，或以心肾为窍，口鼻为门，或曰非心非肾，非口非鼻，不知何者为是？ 答曰：心肾口鼻之说，先辈诱人入道，又恐不明斯义，妄认肉块孔窍，昧本来真空命脉，故曰非心肾口鼻以扫执泥，其实玄关一窍玄牝之门，皆谓人念头起灭处。 老子云：玄牝之门是谓天地根。 紫清白真人云：念头动处是玄牝，倘能亲识得起灭处，即知虚无之谷、造化之母。 非惟金丹药物火候等类，皆从此出，至於诸子百家一，大藏经教，工巧技艺，尽在其中矣。 紫阳张真人云：此一窍亦无边傍，更无内外。 紫清白真人云：玄关一窍，其大无外，其小无内。 杏林石真人云：一窍名玄牝，中藏气与神是也。 或问：玄关玄牝已知端的，真土阳晶其义何也？ 答曰：土者，乃中之异名也。 得其中者，性命混一，湛然圆明，是谓阳晶。 紫阳张真人云：中央正位产玄珠，古云产个明珠是真土。 或问：真土阳晶已知其意，龙虎铅汞可得闻欤？ 答曰：龙虎铅汞者，谓人心念。 念不停，如龙虎之猖狂，若铅汞之难制。 海蟾刘真人云：能乘乾马奔龙去，解使坤牛驾虎归。 紫阳张真人云：铅见火即飞，汞见火即走，苟得制伏之道，自然心中无心，念中无念，所谓降龙伏虎擒铅制汞也。 或问：龙虎铅汞备知其义，炉鼎药物其义云何？ 答曰：炉鼎以身譬之，药物以心中之宝喻之，身外无心，心外无宝，岂离此心而求药物，舍此身而觅鼎炉。 所以道不远人，而人自远耳。 桓真人云：心天本是六虚乾，身是坤兮两厮牵。 紫清白真人云：心中自有无限药材，身中自有无限火符。 紫阳张真人云：心属乾，身属坤，故曰乾坤鼎器。 然则然矣，此亦是诱学者反身克己，达本归元之说。 苟能一念未萌，包含造化，岂非真炉鼎耶，外应诸绿，内心无惴，岂非真药材也。 或问：鼎炉药物已知其详，火候法度、斤两抽添不知何义？ 答曰：火候法度等说，皆为偏於动静，不得其中，故有此喻。 若能动静相忘，不静中静，不动中动，所谓阴阳处中，真土会合，神仙之道毕矣。 紫阳张真人云：火之燥、水之滥，不可不调和，故有斤两法度。 先辈云：不增不减，不抽不添是也。",
      "translated_text": "「Take, for instance, Bodhidharma’s barefoot return to the West, the monk Pudao’s body beyond the body, Master Puhua’s alms bowl resonating with cosmic harmony, and Feikong Zhi’s empty bed awaiting supply at Yanshan—when he saw another monk ascend into the sky and depart, was this not of the same lineage?\n\nConfucianism differs, for it governs humanity’s path, upholding the Three Bonds and rectifying the Five Constants. It is a teaching of *action* (*youwei*), yet its essence is the *Way of non-action* (*wuwei*). The Way is one, but the teachings diverge.\n\n**Question:** If Confucianism, Buddhism, and Daoism share the same Way yet differ in teachings, how can Buddhism’s *chan* (meditation) and Daoism’s cultivation be the same?\n\n**Answer:** Under heaven, there is no second Way; sages have but one mind. You have not yet fathomed the nature of the mind, hence your question. *Chan* is the practice of fixing the mind in one place—beginning with sweeping away distractions until there is nothing left to sweep. *Chan* is the Buddha’s mind, and the mind is the source of all dharmas. Cultivation (*xiuyang*) is the practice of embracing the Primordial and preserving the One, progressing until there is no cultivation left. The Way is the nurturing of the spirit, and the spirit is the sovereign of all things. Spirit is mind, mind is the Way, and the Way is *chan*.\n\nThe Great Way of non-action transcends names and forms, is beyond birth and death, dwells eternally in the void, and claims nothing. It responds when things arise and returns to stillness when they pass—like a mirror reflecting images without retaining traces. It is called the Way by force of convention. Students here may doubt it as mere talk of emptiness and stillness, yet those who grasp it know that speaking of emptiness is not emptiness itself; only when one transcends emptiness does one attain true emptiness. True emptiness is thus called *One*.\n\nThe *One* is the origin of the Great Way, the mother of the Golden Elixir, and the root of all life. Laozi says: *\"Embrace the One as the model for all under heaven.\"* Yet the method of non-action cannot be rigidly grasped as reality, hence the *Diamond Sutra* states: *\"All worthy sages differ in their adherence to the Way of non-action.\"*\n\n**Question:** Having clarified that Confucianism, Buddhism, and Daoism share the same Way, I still seek the *Xuan Guan* (Mysterious Pass) and the *Xuan Dan* (Mysterious Female)—some say the mind and kidneys are the pass, the mouth and nose the gate, while others claim it is neither mind nor kidneys, neither mouth nor nose. Which is correct?\n\n**Answer:** The notions of mind, kidneys, mouth, and nose were used by earlier masters to guide seekers into the Way, yet they feared obscuring the truth by making people cling to mere fleshly orifices and overlook the original, true emptiness of life’s vital pulse. Thus, they said it is *neither* mind nor kidneys, *neither* mouth nor nose—to sweep away attachment to these illusions. In truth, the *Xuan Guan* and *Xuan Dan* refer to the place where thoughts arise and cease.\n\nLaozi says: *\"The Mysterious Female is the root of heaven and earth.\"* The Purple Clarity White Immortal says: *\"The place where thoughts move is the Mysterious Female.\"* If one can recognize the process of arising and ceasing, one knows the Valley of the Void and the Mother of Transformation. Not only do all alchemical elixirs, medicines, and fire-refining techniques stem from here, but all schools of thought, the entire Tripiṭaka, and every art and craft are contained within it.\n\nMaster Zhang of Purple Yang says: *\"This pass has no boundaries, neither inside nor outside.\"* The Purple Clarity White Immortal says: *\"The Mysterious Pass is boundless—vast without external limits, minute without internal confines.\"* Master Shi of the Peach Grove says: *\"This pass is called the Mysterious Female, within which *qi* and spirit are housed.\"*\n\n**Question:** Having clarified the Mysterious Pass and the Mysterious Female, what of *true soil* (*zhen tu*) and *yang crystal* (*yang jing*)?\n\n**Answer:** *Soil* is another name for the *Middle*. Those who attain the Middle merge essence and life, achieving a serene, luminous wholeness—this is called *yang crystal*. Master Zhang of Purple Yang says: *\"At the central, upright position, the Mysterious Pearl is produced—anciently called the birth of a luminous pearl, which is true soil.\"*\n\n**Question:** Having understood *true soil* and *yang crystal*, may I inquire about the *Dragon* and *Tiger*, *lead* and *mercury*?\n\n**Answer:** The *Dragon* and *Tiger*, *lead* and *mercury*, refer to the human mind’s thoughts. When thoughts do not cease, they rage like the Dragon and Tiger, or are as uncontrollable as lead and mercury. Master Liu of the Sea Toad says: *\"One who rides the Heavenly Horse and chases the Dragon away, who tames the Earth Ox and subdues the Tiger, has mastered them.\"* Master Zhang of Purple Yang says: *\"Lead flees at fire’s approach, mercury scatters at fire’s touch. If one knows the method of subjugation, the mind will naturally be without mind, and thoughts without thoughts—this is the taming of the Dragon, subduing the Tiger, capturing the lead, and controlling the mercury.\"*\n\n**Question:** Having understood the Dragon, Tiger, lead, and mercury, what of the *furnace*, *cauldron*, and *medicines*?\n\n**Answer:** The *furnace* and *cauldron* are metaphors for the body, and the *medicines* symbolize the treasures within the mind. There is no mind outside the body, nor treasure outside the mind—how could one seek medicines apart from the mind or a cauldron apart from the body? Thus, the Way is not distant from humanity; it is humanity itself that distances itself from it.\n\nMaster Huan says: *\"The mind is the Heavenly Void, originally the Six Empty [hexagrams of the *Yijing*], the body is the Earthly [principle], the two are inseparably bound.\"* The Purple Clarity White Immortal says: *\"The mind contains boundless medicinal herbs, the body contains boundless fire talismans.\"* Master Zhang of Purple Yang says: *\"The mind belongs to Heaven (*qian*), the body to Earth (*kun*), hence the cauldron is called *qian-kun* (Heaven-Earth).\"*\n\nIndeed, this is but a way to urge students to reflect inward, conquer the self, and return to the origin. If one’s thoughts have not yet arisen, yet encompass all transformation, is this not the true cauldron? If one responds externally without inner agitation, is this not the true medicine?\n\n**Question:** Having clarified the cauldron, furnace, and medicines, what of *fire-refining*, *degrees*, *scales*, and *additions*?\n\n**Answer:** Discussions of fire-refining, degrees, and scales arise from partial adherence to stillness or movement, failing to grasp the Middle. If one forgets movement in stillness and stillness in movement—remaining still within stillness, moving within immobility—this is the balance of yin and yang in the Middle. When true soil converges, the Dao of immortality is complete.\n\nMaster Zhang of Purple Yang says: *\"The dryness of fire and the excess of water must be harmonized, hence the scales and degrees.\"* The earlier masters said: *\"Neither adding nor subtracting, neither extracting nor supplementing—this is the way.\"*",
      "overlap_context": "ll in the Middle Way.\"*\n*The Dao De Jing* says: *\"Better to guard the Middle.\"*\nThis is to say: under heaven, there is no second path.\n\n*Zhuangzi* says: *\"Unified in the One, all things are complete.\"*\nMaster Zhang of Purple Yang says: *\"Obtaining the One, all things are complete.\"*\n\n**Question:** The three teachings are one—\nI’ve heard Daoism speaks of form and spirit both perfected,\nOr a body beyond the body.\nDoes Confucianism or Buddhism have this too?\n\n**Answer:** Buddhism also possesses it.",
      "start_char": 1951,
      "end_char": 3175,
      "start_sentence": 109,
      "end_sentence": 154,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 27.106741905212402,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\金丹直指.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "又问：火候法度已无可疑，工夫口诀其义何也？ 答曰：工夫之说，譬如琴瑟萤篌，虽有妙音，不得妙指，终莫能发，况金丹者乎？ 若得正传，片言之下便可用功，随有应验。 不用年中取月，月中取日，日中取时，时中取刻。 亦不用子午卯酉、支干屯蒙卦气等说，但於行住坐卧清争钤键，阳气自生。 紫阳张真人云：修炼至此，泥丸风生，绛宫月明，丹田火炽。 泥丸陈真人云：初时夹脊关脉开，其次膀胱如火然，内中两肾如汤煎，时乎跳动冲心源。 又有一簇百脉之语，所谓工夫效验。 然清净钤键之要，即杏林石真人云：岂知丹妙诀，终日骯真空。 泥丸陈真人云：当初圣祖留丹诀，无中生有作丹基。 《心印经》云：存无守有。 老子云：守静笃。 所谓口诀真趣，先圣后圣同一舌头，共一鼻孔，然则然矣，犹涉异路，更须不堕语言。 千圣不同途，太上老君未着经、群仙未形口诀以前，昆虫草木，果熟脱体，尚能示变化之妙，抑亦口授，况人为物灵者乎？ 学者当具是眼。 又问：工夫口诀固已晓矣，未知沐浴温养何义？ 答曰：沐浴乃清今之义，温养谓中之义。 舍之益槛，操之益燥，出操舍之外者，日温养。 心清净则尘不染，致诸中则道无为，无为而无不为矣。 杏林石真人云：温养无他术，无中养就儿。 或问：《十六颂》已得其要，所谓结胎脱体之说，不知果有否？ 答曰：结胎脱体，譬超凡入圣之意，但能心不附物，神归气复，所谓换结圣胎也。 抱养月深，神全气化，所谓脱体也。 古云顺之则凡，逆之则圣。 虚靖天师云：神若出，便收来，神返身中气自回，如此朝朝与暮暮，自然赤子产真胎。 本来子云：神在身则生，神去身则死。 紫清白真人云：身外有身为脱体。 《楞严经》云：形神出胎，亲为佛子，其心离身，去住自由是也。 紫阳张真人云：丹是色身妙宝，法身即是真心，从来无色亦无音，一体不须两认。 或问：结胎脱体之说固已晓矣，不知几日可成沅？ 诸书所说或一日或三日或百日，或一年九载，或片饷，或不在三年九载，此心尚疑。 答曰：年月之说，先辈与后学分量有利钝，工夫有浅深，故有久近之分，实不过发明钻簇之机，天之一寒一暑，人之一昼一夜，息之一出一入也。 一刻之工夫，自有一年之节候，一年三万六千之刻，可夺三万六千之数，是谓握阴阳之枢机，盗天地之造化，只在当人一念中耳。 心志坚确，工夫纯一，时节若至，其理自彰。 灵源曹真人云：坚心一志向前修，成与不成无必取。 又岂专於限量耶？ 但能清静无为，湛然若存，何虑不形神俱妙，与道合真哉？ 与道合真，则金丹假名耳。 玄关玄牝，真土阳晶，龙虎铅汞，炉鼎药物，斤两火候，抽添法度，工夫口诀，沐浴温养，众妙之说，不可有心求，不可无心得，不着有不着无。 孔子借世尊口说，共老子耳闻，闻非闻，说非说，一颗金丹色非色，当场拈出与君看，通身是口吞不得。 或问：金丹之说深而不可求，求而不可得，如群仙歌诗契论，皆隐秘幽微，不可直指其义，今先生所指过直，无乃大浅乎？ 予曰：不然，昔神仙欲人自求其道、故寓浅於深，而人不知。 今予欲人皆知其道，故寓深於浅，而人易求。 如孔子性与天道，虽高弟不可得闻，至於孟子语告子则明白洞达。",
      "translated_text": "**Question:** Having clarified *fire-refining* and *degrees*, what meaning lies in the *artistic incantations* (*gōnghū kǒujué*)?\n\n**Answer:** The discussion of artistic incantations is like the *qin*, *se*, and *yínghóu*—though they produce wondrous sounds, without mastering the skillful fingers, they cannot be played at will. How much more so for the *elixir of immortality*?\n\nIf one attains the true transmission, even a single word suffices to begin practice, and its effects manifest accordingly. One need not wait for the *month within the year*, the *day within the month*, the *hour within the day*, or the *moment within the hour*. Nor should one rely on the *five phases of the day* (子 *zǐ*, 午 *wǔ*, 卯 *mǎo*, 酉 *yǒu*), the *ten heavenly stems and twelve earthly branches* (*zhīgān*), or the *eight trigram phases* (*guàqì*) for guidance. Instead, in all *movements and stillness*—walking, standing, sitting, lying—one must maintain purity and *seal the keys* (*qīngzhēng qiànjiàn*). Then, the *yang-qi* will naturally arise.\n\nMaster Zhang of Purple Yang says: *\"At this stage of cultivation, the **dantian** (*nǐhuán*) generates wind, the **cinnabar palace** (*Jiànggōng*) shines with moon, and the **elixir field** (*dāntián*) blazes with fire.\"*\n\nMaster Chen of the Dantian says: *\"At first, the **spinal governing vessel** (*jīapéi guānmài*) opens; next, the **bladder meridian** (*pángguāng*) burns like fire. Within, the two **kidneys** (*liángshèn*) boil like soup, and at times, they surge and strike the **heart source** (*xīnyuán*). There is also the **cluster of a hundred meridians** (*yīcù bǎimài*), which is the essence of the practice’s efficacy.\"*\n\nYet the core of purity and sealing the keys lies in what Master Shi of the Apricot Grove (*Xìnglín*) says: *\"How could one know the elixir’s secret incantation? All day long, one must dwell in the **true emptiness** (*zhēnkōng*).\"*\n\nMaster Chen of the Dantian says: *\"The ancient sage left behind the elixir’s incantation: **‘From nothingness, something arises—this is the foundation of the elixir.’** The *Sutra of the Mind Seal* (*Xīnyìn Jīng*) states: **‘Preserve the non-existent, guard the existent.’** Laozi says: **‘Diligently maintain stillness.’** These are the true meanings of the incantations. The teachings of past and future sages are but one tongue, one nostril—yet still, one must not stray into false paths or fall into verbal traps. Though the thousand sages differ in their methods, before the **Supreme Venerable Lord Lao** (*Tàishàng Lǎojūn*) wrote scriptures or the **multitude of immortals** (*qúnxiān*) formalized incantations, insects and plants, when their fruits ripen and they shed their forms, still reveal the marvels of transformation. How much more so for humans, the most refined of all creatures? The scholar must cultivate this insight.\"*\n\n**Question:** Though the meaning of the artistic incantations has been clarified, I still do not understand the significance of *bathing and nourishing* (*mùyù wēnyǎng*).\n\n**Answer:** Bathing refers to purifying the present moment (*qīngjīn*), while nourishing signifies attaining the Middle (*zhōng*). To abandon it brings stagnation; to cling to it leads to dryness. Beyond clinging or abandoning lies *nourishing*—the daily practice. A pure mind resists no dust; when all things are brought to the Middle, the Dao acts effortlessly. Effortless action is the path to all transformation.\n\nMaster Shi of the Apricot Grove says: *\"Nourishing has no other technique—it is simply **‘nourishing within the Middle.’**\"*\n\n**Question:** Having grasped the essence of the *Sixteen Stanzas* (*Shíliù Sòng*), I wonder—does the saying of *forming the embryo and shedding the body* (*jiétāi tuōtǐ*) truly exist?\n\n**Answer:** Forming the embryo and shedding the body is akin to transcending the mundane and entering the sacred. It is achieved when the mind does not cling to external things, the spirit returns to the *qi*, and the **sacred embryo is reborn** (*huànjié shèngtāi*). Nurturing this deeply, the spirit becomes complete and the *qi* transforms—this is *shedding the body*.\n\nThe ancients said: *\"To follow is to be mundane; to resist is to be sacred.\"* The Venerable Master Xu of the Empty Stillness (*Xūjìng Tiānshī*) says: *\"If the spirit departs, bring it back. When the spirit returns, the *qi* flows naturally. Morning and evening, thus practiced, the **innocent child** (*chìzǐ*) will naturally produce the **true embryo** (*zhēntāi*).\"*\n\nThe Original Sage (*Běnlái Zǐ*) says: *\"The spirit in the body brings life; the spirit leaving the body brings death.\"* Master Bai of Purple Clarity (*Zǐqīng*) says: *\"A body outside the body is **shedding the form** (*tuōtǐ*).\"* The *Sutra of the Pure Abiding* (*Léngyán Jīng*) states: *\"The form and spirit emerge from the embryo—one becomes a child of the Buddha. The mind detached from the body, free in coming and going, is the true meaning.\"*\n\nMaster Zhang of Purple Yang says: *\"The elixir is the **wondrous treasure of the colored body** (*sèshēn miàobǎo*), while the **Dharma-body** (*fǎshēn*) is the **true heart** (*zhēnxīn*). From the beginning, it has neither color nor sound—one essence requires no dual recognition.\"*\n\n**Question:** Though the meaning of forming the embryo and shedding the body has been clarified, I still do not know how many days it takes to achieve *Yuan* (*Yuán*).\n\nThe texts say it may take *one day*, *three days*, *a hundred days*, *a year*, *nine years*, *a single meal*, or *not within three years and nine months*—my heart remains in doubt.\n\n**Answer:** The discussions of years and months differ between the ancients and later scholars due to varying capacities and depths of practice. They merely reveal the timing of the **piercing and clustering** (*zuàncù*)—the cycles of *heaven’s cold and heat* (*tiānyī hánshǔ*), the *day and night* (*rìyè*) of humankind, and the *breath’s exhalation and inhalation* (*xīyī chūrù*).\n\nIn a single moment of practice, there lies an entire year’s worth of seasons. Within a year are thirty-six thousand moments—one can seize them all in an instant. This is called **‘grasping the pivot of yin and yang** (*zhuó yīnyáng shūjī*) and **‘stealing the creative forces of heaven and earth** (*dào tiāndì zàohuà*)—all within a single thought of the practitioner.\n\nWith a resolute mind and pure practice, when the time arrives, the principle will naturally manifest.\n\nMaster Cao of the Numinous Source (*Língyuán*) says: *\"Cultivate with a single, unwavering resolve—whether success or failure, there is no fixed outcome.\"* How could it be limited to a set duration?\n\nIf one simply maintains purity, stillness, and effortless action, how could the **form and spirit not be perfected**, and how could one fail to align with the **true Dao**?\n\nWhen one aligns with the true Dao, the elixir is but a borrowed name. The **mysterious pass and mysterious gate** (*Xuán guān xuánbǐng*), the **true soil and yang essence** (*zhēntǔ yángjīng*), the **Dragon and Tiger, lead and mercury** (*lónghǔ yīnyáng*), the **furnace, cauldron, and medicinal substances** (*lú dǐng yàowù*), the *scales, degrees, and fire-refining* (*jīnliǎng huǒhòu chōutiān*), the *artistic incantations* (*gōnghū kǒujué*), the *bathing and nourishing* (*mùyù wēnyǎng*), and all these marvelous sayings—one must not **‘seek with the mind’** (*yǒuxīn qiú*), nor must one **‘obtain without the mind’** (*wúxīn dé*). Do not cling to existence or non-existence.\n\nConfucius, borrowing the words of the World-Honored One (*Shìjiè Rén*), and Laozi, hearing them directly—**‘hearing is not hearing, speaking is not speaking.’** A single grain of elixir is neither color nor sound; at the moment, I pluck it out for you to see—yet it cannot be swallowed as a whole. The entire body is the **incantation itself** (*kǒujué*), yet it cannot be taken in.\"\n\n**Question:** The teachings on the elixir are profound yet unattainable, and the incantations of the immortals, though subtle and hidden, cannot be directly pointed to. Yet your explanations seem too straightforward—are they not excessively shallow?\n\n**Answer:** No. The immortals wished for people to seek the Dao themselves, so they hid depth within shallowness, and people did not understand. Now, I wish for all to know the Dao, so I conceal shallowness within depth, making it easier for people to grasp.\n\nAs for Confucius’ nature and the Dao of heaven—though even his most accomplished disciples could not hear it, when Mencius spoke to Zicheng, the meaning became clear and luminous.",
      "overlap_context": "rasp the Middle. If one forgets movement in stillness and stillness in movement—remaining still within stillness, moving within immobility—this is the balance of yin and yang in the Middle. When true soil converges, the Dao of immortality is complete.\n\nMaster Zhang of Purple Yang says: *\"The dryness of fire and the excess of water must be harmonized, hence the scales and degrees.\"* The earlier masters said: *\"Neither adding nor subtracting, neither extracting nor supplementing—this is the way.\"*",
      "start_char": 3176,
      "end_char": 4409,
      "start_sentence": 155,
      "end_sentence": 198,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 28.247944116592407,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\金丹直指.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "老子谓之微妙玄通，似难求也，然又曰吾道甚易知，甚易行，亦未尝大探也。 世尊谓幽固深远，无人能到，亦似乎深也，然直指人心，见性成佛，又何深哉？ 子所谓指过直，无乃大浅，岂其然乎？ 金丹直指竟",
      "translated_text": "The **Laozi** speaks of it as **subtle, refined, and penetratingly profound** (*wēimiàoxuāntōng*), seemingly difficult to seek. Yet he also says, *\"My Dao is most easy to know, most easy to practice\"* (*wú dào shèn yì zhī, shèn yì xíng*), so it was never truly profound in the first place.\n\nThe **World-Honored One** (*shìzūn*) speaks of it as **hidden, secure, and distant** (*yōugù shēnyuǎn*), saying no one can reach it, which seems deep. Yet he directly points to the **human heart** (*rénxīn*), declaring that **seeing one’s true nature** (*jiànxìng*) leads to **Buddhahood** (*chéngfó*), so where is the depth?\n\nWhat you call *\"pointing too directly\"* (*zhǐguò zhí*), is it not excessive shallowness? **The elixir’s essence is direct and clear** (*jīndān zhízhǐ jìng*).",
      "overlap_context": " seem too straightforward—are they not excessively shallow?\n\n**Answer:** No. The immortals wished for people to seek the Dao themselves, so they hid depth within shallowness, and people did not understand. Now, I wish for all to know the Dao, so I conceal shallowness within depth, making it easier for people to grasp.\n\nAs for Confucius’ nature and the Dao of heaven—though even his most accomplished disciples could not hear it, when Mencius spoke to Zicheng, the meaning became clear and luminous.",
      "start_char": 4409,
      "end_char": 4504,
      "start_sentence": 199,
      "end_sentence": 202,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 3.266416072845459,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\金丹直指.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}