{
  "source_id": "金华玉液大丹",
  "source_file": "chunked_daozang\\金华玉液大丹.json",
  "total_chunks": 6,
  "total_original_chars": 6720,
  "total_translated_chars": 45554,
  "total_translation_time": 165.60117197036743,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\金华玉液大丹.txt",
    "category": "众术类"
  },
  "full_translation": "**Gold and Flower Elixir of Great Dao (Jinhua Yuye Dadan)**\n\n**Title:** *Jinhua Yuye Dadan* (Gold and Flower Elixir of Great Dao)\n**Author:** Unknown, likely from the Song Dynasty (似出宋代)\n**Source:** *Zhengtong Daozang* (Orthodox Daoist Canon of the Zhengtong Era), *Dongshen Bu* (Cavernous Deity Section), *Zhongshu Lei* (Miscellaneous Arts Category)\n\n**One Volume**\n\n**Method:**\nCinnabar (朱砂) – 1 *jin* (斤), use only the most luminous tenth (十分光明者用).\nCollect the following herbs at their respective times:\n- *San You Mu* (三友木, Three Companions Wood) in the second month (二月收)\n- Fresh lotus leaves (新荷叶) in the fourth month (四月收)\n- *Mazhen Cao* (马鞭草, Horsetail Herb) in the eighth month (八月收)\n\nBurn each into ash (烧灰), measuring roughly one *dou* (斗) each. Extract the most concentrated juice (十分浓汁) from the ashes. Boil the cinnabar in this juice for one month (一月). After 360 *zhi* (跻, a unit of time, likely \"days\"), the cinnabar will turn snow-white (雪白色), named *Yuying* (玉英, Jade Essence). Consuming it can cure all ailments (可治百病).\n\n**Boiling Method:**\nPlace the cinnabar (前朱) in a small bottle (小瓶内). Fill eight-tenths (八分) with the juice of the three herbs' ashes (三草灰汁). Add finely chopped fresh ginger (梼碎生姜), wrap it in cloth (用布包), and seal the bottle's mouth (塞瓶口). Boil in a covered pot (重汤煮之). Daily, remove the cinnabar and use *zaojiao* (皂角, soapberry) to boil it for another day (煮一日), refining it until it becomes milky (乳细). Wash it with flowing water (长流水) five to seven times (淘五七次).\n\n**Nourishing Method:**\nUse the following six minerals (六石), each refined with vinegar (醋淬) and finely ground (梼碎):\n- *Yangqi Shi* (阳起石, Yangqi Stone)\n- *Cishi* (磁石, Magnetite)\n- *Yuyu Gen* (禹余根, Yuyu Root, a mineral)\n- *Shidai Zhe Shi* (石代赭石, Vermilion Stone)\n- *Zishi Ying* (紫石英, Amethyst)\n- *Yushi* (誉石, a mineral, possibly Calcite)\n\nBlend these minerals with the juice of *xiaoshi* (硝石, saltpeter) and *Taiyin Xuanying* (太阴玄精, Yin Essence of the Dark Primordium, possibly a mineral or alchemical term) until they become milky (俱乳细), forming the outer casing (外匮).\n\nFurther, use 12 *liang* (两) of silver to create the *Shenshi* (神室, Divine Chamber). Place the refined cinnabar inside (置前朱於中), then insert the outer casing (纳入外置砂合). Seal it tightly (封固如法) and place it atop a furnace (灰池顶火) to be nourished by fire for one month (养一月), adjusting the flame to 2–4 *liang* (两) of fuel daily (火候二至四两). Remove it daily (日足取出), naming the result *Yuye* (玉液, Jade Elixir), which can transmute copper into silver (点铜成银) and lead into treasure (坚铅成宝).\n\n**Next Process:**\nUse the *Yuye* (玉液) to create another *Shenshi* (神室, Divine Chamber) with 12 *liang* (两) of gold (以金十二两作神室). Place the *Yuye* inside (纳其中), seal it with the outer casing (外以前匮固之), and insert it into a sand mixture (入砂合), sealing it as before (封固如法). Nourish it atop the furnace (灰池) with fire for another month (养一月), adjusting the flame to 4–6 *liang* (两) of fuel daily (火候四至六两). Remove it daily (日足取出), and its appearance will be greenish-brown (绿褐色), like dust on a bright window (如明窗尘), named *Zifen* (紫粉, Purple Powder). Each half *chú* (铢) can dry 1 *liang* (两) of mercury (乾汞一两), producing *Geng* (庚, a refined metal, possibly silver or gold).\n\n**Application:**\nUse the *Zifen* (紫粉) with decoctions of *Han Jiao* (汉椒, Sichuan Pepper) and *Fangji* (防己, Stephania Root) for bathing (沐浴少时).\n\n**Further Refinement:**\nUse 12 *liang* (两) of silver for the inner *Shenshi* (神室, Divine Chamber), with a ratio of 3 parts female to 4 parts male (雌三雄四). Grind them together (一处和研) and place them inside the inner chamber (入内神室中). Use 16 *liang* (两) of gold for the outer *Shenshi* (神室, Divine Chamber), placing the *Zifen* inside (纳紫粉於其中). Insert the inner chamber into the outer one (内神室入外神室), and then place the outer chamber into the previous casing of the eight minerals (外神室入前八石匮中). Seal it with sand (沙合封固) and nourish it with fire for one month (养火一月), adjusting the flame to 2–6 *liang* (两) of fuel daily (火候二至六两). Open and close it daily (日足开合), and both the silver chamber and the purple powder will turn yellow like gold (俱成黄色金), named *Jinhua* (金华, Golden Flower).\n\nEach half *chú* (铢) of *Jinhua* can dry 1 *liang* (两) of mercury (乾汞一两), producing *Geng* (庚, refined metal).\n\n**Final Process:**\nFrom this point onward, the eight minerals are no longer used (去八石不用). Instead, take the *Jinhua* (金华) and the male-female refined substances (内养出牡牝), grind them together (一处和研) to form the outer casing (作外匮). Use 16 *liang* (两) of gold to create another *Shenshi* (神室, Divine Chamber), placing 10 *liang* (两) of fresh cinnabar inside (纳生朱十两於其中). Place this within the *Jinhua* casing (置在金华匮内), seal it with sand (砂合封固), and arrange it atop the furnace as before (如法灰池). Nourish it with the *Liuyang* (六阳, Six Yang) fire for 49 days (六阳火养四十九日), opening and closing it daily (开合), until the *Jinhua* turns purple-gold (紫金色), becoming the *Changsheng Kuang* (长生匮, Elixir of Extended Life).\n\nIf the cinnabar resembles *Danfan* (胆矾, copper sulfate) in color (朱砂如胆矾色), it is named *Zixia Dan* (紫霞丹, Purple Cloud Elixir). Each half *chú* (铢) of this refined cinnabar, made into pills with *chou zhi* (楮汁, paper mulberry juice), can dry 5 *liang* (两) of mercury (糁汞五两), producing gold (成黄金). It can also transmute the five metals (化五金), all becoming treasures (俱可成宝), with endless transformations (生生变化无穷).\n\n---\n\n**Silver Elixir (Yin Jing Dan)**\n\n**Ingredients:**\n- Cinnabar (朱砂) – 4 *liang* (两)\n- *Fen Shuan* (粉霜, Powdered Frost) – 6 *liang* (两)\n- *San You Shuang* (三友霜, Frost of Three Companions) – half *jin* (半斤)\n\n**Method:**\nAs with refining frost (如炼霜), wrap the cinnabar in a linen bag (以夹布袋盛朱) and suspend it during boiling (悬胎煮为妙).\n\nTake mulberry twig ash (桑柴烧灰), extract its concentrated juice (淋取浓汁), and refine it with gentle fire (以软火炼之). Place a handful of rice straw (一握稻草) in the pot, and the juice will condense into frost (其汁自结霜在上). Wash the frost with clean water (以清水汹之), evaporate it again, and it will become powdered frost (再熬乾成霜).\n\nSpread the powdered frost (粉霜) at the base, then on all sides and the center. Place the cinnabar inside (入朱砂在内), and cover it with more powdered frost (仍以粉霜盖之). Next, cover with mulberry ash frost (桑灰霜) and a tile (盖瓦片), seal the mouth with *Liuyi* (六一, Six-to-One) clay (泥), and build the furnace (固灰池). Nourish with yang fire (阳火) for seven days (养七日), adjusting the flame to 9 *liang* (两) of fuel daily (火候九两). Open and close it daily (日足开合), and the cinnabar will turn snow-white like silver flakes (其色雪白如银屑), with marvelous results (妙甚).\n\n**Note:**\nThis can replace the *Jinhua Dadan* (金华大丹) as the initial alchemical substance (金曾以此代金华大丹头), and its efficacy is equal (其功与之并驾). This method is recorded here for reference (今书此以记之).\n\n---\n\n**Four Holy Elixirs (Si Sheng Dan)**\n\n**Ingredients:**\n- *Bi* (毗) – 8 *liang* (两)\n- *Fen* (粉) – 6 *liang* (两)\n- *Xiong* (雄) – 3 *liang* (两)\n- *Ci* (雌) – 3 *liang* (两)\n\n**Refinement of *Bi*:**\nBoil *Bi* (毗) with *Musu* (募苏, likely a herb) juice, using 2 *huai* (槐, a measure) of the former and 3 *huai* (槐) of the latter (募苏汁二槐, 旱莲汁三槐). After boiling it to exhaustion (煮尽), wash it clean (洗净).\n\nFurther, boil *Bi* with half *huai* (半槐) of *Musu* juice until fully fried (炒尽为度).\n\n**Refinement of *Fen*:**\nBoil 3 *jin* (斤) of *Xunsu* (寻苏, likely a herb) juice to exhaustion (浓煎汁煮尽), using 6 *liang* (两) of powdered substance (粉).\n\n**Refinement of *Xiong*:**\nBoil 2 *jin* (斤) of *Yashi Cao* (鸭舌草, Duck-tongue Herb) in water, using rice washings (上下米浴水) to exhaust it (侵煮尽), for 3 *liang* (两) of male substance (雄).\n\n**Refinement of *Ci*:**\nBoil roughly 2 *jin* (斤) of *Zisu Cao* (紫苏草, Purple Perilla Herb) in vinegar with rice bran (米糠醋煎汁) until exhaustion (煮尽), for 3 *liang* (两) of female substance (雌).\n\nTake 6 *liang* (两) of powdered substance (粉) and mix it with 6 *liang* (两) of mountain or river silver (山泽银), grinding into a fine powder (搅为末). Place 4 *liang* (两) of this powder at the base of a fire crucible (火鼎底), and use another 2 *liang* (两) of silver powder (银末) to seal the top (捺头). Insert the crucible into a water-fire furnace (水火鼎), sealing it tightly as before (如法通身固济).\n\nFor each *liang* (两) of powdered substance (粉), add half *liang* (半两) of mercury (汞) to its feet (加了脚), blending them together (同缎). If used in a decoction (如用汤煮过), boil it as needed (用之).\n\n**Sealing Method:**\nUse *Wuming Yimai Fen* (无名异蚁粉, Powder of Nameless Ants), *Zhijin* (纸筋, Paper Fibers), and salt clay (盐泥), grinding them finely together (同梼千万下).\n\nLevel the ash (灰) and build the furnace (筑鼎), exposing the water crucible (倒露出水鼎) and the place where the mixture is inserted (及受缎处).\n\n**Firing Process:**\nFirst, ignite 1 *jin* (斤) of fire, and after two hours (二时), lift the crucible. Use a *Watao* (瓦陀, likely a type of clay pot or furnace) vessel, raising it half an inch (半寸许), and ignite another hour (下火簇缎一个时). Repeat this process four times (添尽四个瓦陀子), each time lifting after one hour (各过一时、提起). Add one or two pieces of charcoal (炭) to the base, allowing the medicine to absorb the heat (令药受毁), with a total of three *jin* (斤) of fire. Surround the furnace with tiles (瓦围了), and add another *jin* (斤) of fire.\n\nThis completes the full preparation (此是全料). When the fire reaches this stage (火候到此), carefully use the elixir (消详用之).\n\nFinally, cover the furnace with ash (灰盖) and let it cool. Remove the powdered mother substance (粉母) from the crucible (分胎).\n\nRight, grind the powder finely and mix it evenly with *Pí* (毘, likely cinnabar) and grind it together into the crucible.\n\nLeave two *liǎng* (两) of *Pí* (毘), and use vinegar to search and knead the head for solidification, nurturing the fire for **37 days** (三七日). The fire dosage for the first **37-day cycle** (一七火候) is as follows: two *liǎng* on the first day, two and a half *liǎng* on the second day, and four *liǎng* from the third to the seventh day.\n\nWhen the cycle is complete, cool the furnace and retrieve it, grinding thoroughly before returning it to the crucible. Repeat the process as before for **one refining** (一缎), then remove and grind finely into a container, refilling it again. This refining does not require the use of the original mother substance.\n\nThe fire dosage for the second **37-day cycle** (二七火候) is: two *liǎng* on the first day, two and a half *liǎng* on the second day, three *liǎng* on the third day, two and a half *liǎng* on the fourth day, four *liǎng* on the fifth day, four *liǎng* in the morning and four *liǎng* in the evening on the sixth day, five *liǎng* in the morning and six *liǎng* in the evening on the seventh day, with two *liǎng* at the top and four *liǎng* on each side.\n\nFor the **initial and final stages** (首尾三斤), retrieve the substance, grind it finely, and return it to the crucible. Refine it again as before for **one refining** (一缎), then remove and grind finely into a container, refilling it once more with a new batch of charcoal. The fire dosage for the third **37-day cycle** (三七火候) is: two *liǎng* on the first day, three *liǎng* on the second day, four *liǎng* on the third day, five *liǎng* on the fourth day, and five *liǎng* on the fifth day. On the sixth day, five *liǎng* are used. On the seventh day, refine as before (就缎), with **three *jin* (斤) of incense** (末香) and two charcoal clusters (炭团), finely mixed and placed on the four sides, nurturing the fire with six *liǎng* of fuel.\n\nArrange it according to the five directions (按五方安之), cover with four tiles (瓦), and leave the top open for smoke. After three days, cool the furnace and then retrieve it. This can be used for nurturing **male and female powders** (匮养雌雄粉).\n\n**First Transformation (一转变化):**\nFor each *liǎng* (两) of powder, first boil it with **lotus ash solution** (荷灰汁) for one day. Then mix it with water and **white lead** (白友) powder, wrapping each particle individually, and fry it with **Gé* (莒蒲, likely a type of grass or herb) powder for about a day. Remove it, discard the white lead, and grind the powder finely. Add half a *liǎng* of **red lead** (赤了, likely red cinnabar or red arsenic) and mix evenly. Combine with one *liǎng* of **silver powder** (银粉), and refine it according to the previous method for nurturing powder (如前法缎粉).\n\nRetrieve the powder and return it to the **silver chamber** (银室), covering it with the previous container (依前匮覆籍), and nurture the fire for **77 days** (养火七七日). For each *qian* (钱) of powder, one can refine **four *liǎng* of bone** (骨), achieving a **fully refined powder** (十分彻糁) that does not exceed the **lead pool** (铅池, likely a reference to a specific alchemical grade).\n\n**Second Transformation (二转变化):**\nGrind **powdered cinnabar** (辰汞) into a fine frost as per the original method. Also, as before, boil the **silver mother** (银母) in lotus ash solution (荷灰汁煮), refine the **silver chamber** (缎银室), and nurture it until completion.\n\nFor each *liǎng* of refined **powdered cinnabar** (养死辰汞), add four *qian* of male (雄) and two *qian* of female (雌), grinding evenly. Use **Gēng mother** (庚母, likely a type of furnace or container) as the **divine chamber** (神室), placing the male and female powders inside, and nurture the fire.\n\nUse the **Four Holy Immortals’ Pill** (四圣丹) as the outer container (作外匮), with fire dosage of four *liǎng*. Change the fire in the morning and evening for **21 days** (二十一日早晚换火). When complete, cool the furnace and retrieve the **male and female powders** (雌雄粉). Each *qian* can refine **one *liǎng* of silver** (银), achieving the highest grade of gold (上等金).\n\n**Third Transformation (三转乾汞):**\nUse the **male and female powders** (养死雌雄粉) refined as before, placing them inside the **gold chamber** (金室).\n\nTake **large luminous cinnabar** (大光明颗块砂), first **calcined with bile** (先用胆炮) and **mulberry leaf juice** (硫桑汁), boiling it for **three periods of heat** (三伏时). Retrieve it and dry it, wrapping it in gold leaf (金箔包了), and planting it within the male and female powders. Use the **Four Holy Immortals’ Pill** (四圣丹) as the outer container (作外匮), sealing and nurturing the fire for **77 days** (养火七七日), with fire dosage ranging from two to six *liǎng*. When complete, retrieve the substance: one *qian* of **cinnabar** (朱) can refine **four *liǎng* of dry cinnabar** (乾汞), producing the finest gold (上等金).\n\n**Six Divine Containers’ Method (六神匮):**\nUse **mallow leaves** (马苋菜) and **willow leaves** (柳叶) with *Pí* (毘) to refine the juice, boiling it for five days until completion. Refine it with **grass balls** (草球).\n\nFor each *liǎng* of *Pí* (毘), use **half-summer** (半夏) and **grass wu** (草乌) two *liǎng* each, spreading them out, and refine with **two *jin* of fire** (二斤火缎).\n\nMix it with **onion juice** (葱管内), and place it inside **lotus root holes** (藕窍中). Seal both ends with mud (泥固两头), and refine with **two *jin* of fire** (二斤火毁).\n\nUse **borax** (硼) one *liǎng*, boiling it with **white alcohol** (白酒脚) in a cup (一盏), until the powder is exhausted. Boil **mountain gardenia** (山栀子), **small asarum** (细辛), **thunder peach** (雷亢), and **bottle gourd** (瓜篓) for **five 37-day cycles** (五七日). Refine it with **wolfberry** (川狼毒), **pomegranate peel** (石榴皮), **ghost peach** (鬼旧), **five-fold childberry** (五倍子), and **stone wedelia** (石韦) wrapped and refined.\n\nTake four *liǎng* of powder, and for each, use one *liǎng* of the aforementioned substances, mixing them with **onion juice** (乳) to form a powder. Place them into a container (装入合).\n\nAdd **locust bean gum** (蜻油) one cup (一盏), and nurture the fire for seven days with fire dosage of two *liǎng*. Retrieve it, add another cup of locust bean gum, and nurture the fire for another seven days with fire dosage of three *liǎng*. Retrieve it again, add another cup of locust bean gum, and nurture the fire for seven days with fire dosage of four *liǎng*. Repeat this process for **three 37-day cycles** (如此养三七日了), and the medicine will be ready for nurturing in the container (其药作匮养物).\n\nUse seven *liǎng* of powder, and for each, use seven *liǎng* of **mercury** (汞), adding two *liǎng* of mother substance (入母二两), forming it into sand (结成砂). Mix it with powder and grind finely. Retrieve it from the **negative yin cave** (负阴窟), and divide it into granules (分开作颗块), applying **red lead** (赤了脚) to the surface. Place it inside the previous container using the **lotus method** (入前匮栽莲法), nurturing the fire for **21 days** (养法二十一日), with fire dosage ranging from two to three *liǎng*. Retrieve half a *qian* of powder to refine **one *liǎng* of bone** (骨), achieving **Dan Yang** (丹阳, a refined alchemical grade).\n\n**Alone Method (独础匮变化):**\nUse **wolfberry** (川狼毒) to boil *Pí* (毘) for half a *jin* (半斤), over two periods of time (两个时候). Use **mulberry leaf juice** (梧桐律半斤) to mix and refine with *Pí* (毘), achieving a **jade-like green** (碧玉色). Grind it finely and place it in the furnace, nurturing the fire for seven days. Its color will become **snow-white** (雪白), and then it can be transformed, used for nurturing in the container.\n\n**Method for Pointing Gold (－点金):**\nUse **two *liǎng* of calamine** (蒲矾), **five *liǎng* of yellow alunite** (黄矾), **two *liǎng* of mulberry bark** (桐律), **one *liǎng* of calcined** (炮), **one *liǎng* of green vitriol** (青盥), **one *liǎng* of refined salt** (解盐), **two *liǎng* of female mercury** (雌黄), and **half a *liǎng* of mineral oil** (石油).\n\nWrap these ingredients in **immortal’s grass** (仙人草), warm them to form a solution, and open it to reveal a luminous, pleasing color. Mix **paper mulberry juice** (楮汁) into a ball the size of a **bullet** (弹子大), wrap it with **gold foil** (金泊裹了), and place it inside the previous container to nurture for one day, or three days.\n\nRetrieve it and grind finely into a powder. Form **yellow wax pills** (黄腊丸) the size of a **chicken head** (鸡头大). Use four *qian* or five *qian* of the aforementioned substances, combined with **one *jiao* of the elixir** (对丹一九), to point and refine **bone to its true color** (骨十二分真色) to twelvefold transparency. If refined with **three 37-day cycles** (三七勾之), it is even more wondrous.\n\n**Cave Method (庵法):**\nUse **equal parts of saltpeter** (牙硝), **white alunite** (白矾), **stone alunite** (石盥), and **leech powder** (鳝粉), mixing them with **brine** (盐卤) to activate and ignite them. The color will emerge.\n\nAnother method:\nUse **immortal’s grass** (仙人草), **croton seed** (巴豆), **five-fold childberry** (五倍), **stemona root** (百部), **bone supplement** (骨补), **wolfberry** (川乌), **grass wu** (草乌), **half-summer** (半夏), **south starwort** (南星).\n\n「**Nurturing Powder (养粉):**\nEach powdered batch consists of eight *qian* of the substance, two *qian* of true **mercury** (真汞), and two *qian* of the **mother** (母), formed into sand. When ground finely into paste, it is rolled with **paper mulberry juice** (楮汁) into pills the size of a **dragon eye** (龙眼大). Wrapped further in **mother foil** (母箔), they are placed in the **pregnant crucible** (前匮) and nurtured by fire for three **7-day cycles** (三七日), until one *qian* can transmute **one *liang* of cinnabar** (丹阳一两) into powder.\n\n**Nurturing Vermilion (养朱):**\nFor each batch, take one *liang* of **raw vermilion** (生朱) and one *liang* of **raw pyrite** (生毗) as a foil. Mix with two *liang* of **mother sand** (二八母砂), wrapping tightly, then place in the **pregnant crucible** (前匮) to nurture by fire for three **7-day cycles** (三七日), until it becomes **precious** (宝). Alternatively, one *qian* can transmute **one *liang* of bone** (骨一两).\n\n**Nurturing Gunpowder Bladder (养炮胆):**\nFor each batch, use two *qian* of **gunpowder** (炮) and eight *qian* of **bladder** (胆), refining to produce one *liang* of **powdered frost** (粉霜). Mix and press into a **sealed base** (合底), with **gold foil** (金箔) layered between. Place in the **pregnant crucible** (前匮) with a **pressed lid** (捺头), nurturing by fire for two **7-day cycles** (二七日) or one **7-day cycle** (一七日), until two *qian* can transmute **one *liang* of *Geng Dao* mercury** (庚道一两).\n\n**Nurturing Male and Female (养雌雄):**\nFor each batch, take four *qian* of **female** (雌) and six *qian* of **male** (雄), ground into powder. Roll with **honey** (蜜) into pills the size of a **round eye** (圆眼大), wrapped in **gold foil** (金箔). Then take one *liang* of the previously refined **vermilion** (朱), finely ground and wrapped, and place it in the **pregnant crucible** (前匮) to nurture by fire for three **7-day cycles** (三七日), until one *qian* can transmute **one *liang* of the substance**, turning white into yellow.\n\n**Vermilion and Mercury Sealed in the Four Divine Crucibles (四神匮) for Nurturing (芽养朱为糁制):**\nFour *liang* of **vermilion** (朱砂), cooked with **large fishy *vicia* grass** (大鱼腥草) and **He Shou Wu** (何首乌) for three days, then **sifted** (一缎), are placed in the **mother crucible** (母养) for one month to become **precious** (宝).\n\n**Fire and Water Balance (火候常存):**\nUse **vermilion** (朱) cooled into a **tortoise shell** (陀) form. Pour over two *liang* of **mercury** (汞), nurturing by fire for one month. The **fire and water balance** (火候) is maintained as follows: one *liang* for two **6-day cycles** (一六日), two *liang* for three **6-day cycles** (二六日), three *liang* for four **6-day cycles** (三六日), four *liang* for five **6-day cycles** (四六日), and five *liang* for six **6-day cycles** (五六日), totaling **120 *liang* of fire** (火共计百二十两).\n\nAlternatively, pour over one *liang* of **mercury** (汞) and nurture as above for one month, maintaining the **upper fire, lower water** (上火下水) balance. Repeat this process until five *liang* are poured. Then switch to a **water-fire crucible** (水火鼎), pour another *liang* of **mercury**, and nurture as before for one month. Continue this until seven *liang* are poured.\n\nNext, add one *liang* of **vermilion** (朱砂) and nurture by fire for one month. Repeat this nine times, maintaining the **upper water, lower fire** (上水下火) balance. After nine months, the **yellow sprout** (黄芽) is obtained, totaling ten *liang* (十两). In the tenth month, **detach the embryo** (脱胎), placing it in the **Four Divine Crucibles** (四神匮) for nurturing.\n\n**Four Divine Crucible Method (四神匮法):**\n**Realgar** (雄黄) is refined with **mugwort** (艾) to **eight-tenths of true death** (八分死了), then further nurtured to achieve **true death** (真死). It is cooked with **wild rhubarb** (野薄苛), then **sifted** (缎) with **female** (雌), and nurtured to **death** (死). Next, it is cooked with **unopened *tripterygium* flower and *southern starwort* grass** (即踯躅花未惊草), and refined with **sulfur** (硫), nurtured to **death** (死). Then, cooked again with the aforementioned **grass** (前草), **vermilion** (朱砂) is added, and nurtured to **death** (死).\n\nAfterward, take the **sprout** (芽子), add two *liang* of **true mercury** (真汞), and mix with **mother sand** (付斤) to form a **chamber** (室). The **sprout** (芽子) is placed in the **Four Divine Crucible** (四神匮), nurtured for one month, then **repeatedly refined** (一至十五) until fifteen cycles are complete. When the **original number of days is fulfilled** (元之数日足), the **sprout** (芽子) is used as the crucible, with **gold foil-wrapped vermilion** (金箔包朱砂) placed inside. Nurture by fire for three **7-day cycles** (七七日), maintaining the **fire and water balance** (火候) from four to eight *liang* of **vermilion** (朱), until it is ready for **sifting** (糁制).\n\n**Sulfur and Mercury for Nurturing Male and Transmuting Gold (硫黄汞为匮养雄点金):**\nTen *liang* of **dead sulfur** (死硫), layered with three *liang* of **thick gold foil** (厚金泊), are nurtured by fire for seven days until the sulfur achieves **true death** (真死). Then, add **raw sulfur** (生硫) and nurture it to **death** (死), forming the crucible.\n\nSeparately, refine **three 7-day mother sand** (三七母砂) into **sprout** (芽), maintaining the **fire and water balance** (火候) as follows: one *liang* for two days (一日二两), two *liang* for three days (三日四两), three *liang* for five days (五日三两), and four *liang* for six or seven days (六七日四两), or six *liang*.\n\nTake the **sprout** (芽子), cover its head with **sulfur** (硫黄), and nurture for two **7-day cycles** (二七日), then **sift** (一缎) until the **sprout** achieves **true death** (真死). Combine it with **sulfur** (硫黄) in a **balanced crucible** (对停), forming the **embryo crucible** (合胎为匮), and nurture four *liang* of **Geng sand** (庚砂).\n\nThe **Geng sand** (庚砂) is prepared by grinding **vermilion gunpowder** (朱炮胆) into powder as a **foil** (贴身), placed inside **prunus mume kernel** (梅核), and nurtured by fire for seven days, maintaining the **fire and water balance** (火候) as before.\n\nTake two *liang* of **male** (雄), which is first boiled in **bladder white water** (胆白水) for one day, then cooked with **green alunite** (青矾) for half a day. Afterward, it is ground with **dead Geng sand** (死庚砂), a small amount of **gunpowder** (炮) added, and rolled with **honey** (蜜) into pills. Nurture by fire for two **7-day cycles** (二七日), maintaining the **fire and water balance** (火候) as follows: two *liang* for one or two days (一二日二两), three *liang* for three to five days (三四五日三两), four *liang* for six to nine days (六七八九十日四两), five *liang* for ten or twelve days (十一十二日五两), and six *liang* for thirteen or fourteen days (十三十四日六两).\n\nWhen removed, use two *qian* to transmute **one *liang* of holy silver** (圣银) into **yellow gold** (黄矣).\n\n**Holy Silver Method (圣银法):**\n**Holy silver** (圣银) is obtained by nurturing **soul sand** (灵砂) with **sulfur** (硫黄). Use **gunpowder** (炮) to refine **Geng Dao mercury** (庚道).\n\n**Gunpowder (炮) is used regardless of quantity.** Boil with **plantain herb juice** (车前草汁) for one **division** (一分), then **parch and dry** (炒乾). Use **conch mother and *Anemarrhena* rhizome** (贝母、知母) in a **black pot** (黑锅), then scatter the powder of the two aforementioned **grasses** (二草末) inside the pot. When the smoke rises, place the **gunpowder** (炮) inside and **fan vigorously** (大抡) with three to fifty **winnowing baskets** (扇), until the juice achieves **true death** (真死). This can then be used to nurture **male and female stone bladders** (雌雄石胆) and refine **Geng sand** (庚砂).\n\n**Male and Female (雌雄)** are prepared with **animal fat and *solanum nigrum* herb** (腆脂菜), boiled during the **three heat periods** (三伏时).\n\n**Stone Bladder (石胆)** is prepared by boiling **unpalatable *brassica* grass** (鹅不食草) for one day, then mixing with **milk** (乳) to form powder. Roll with **honey** (蜜) into pills the size of a **yellow sprout** (黄子大), and place them in the **pregnant crucible** (前匮) to nurture by fire for three **7-day cycles** (三七日), until all the substances achieve **death** (死) within the crucible.\n\nWhen combined with **gunpowder** (炮) to form the **embryo**, it is named the **Primordial Yang Crucible** (元阳匮), capable of nurturing **four Geng substances** (庚砂四药), each batch consisting of four *liang* for the crucible.\n\n**Vermilion (朱砂)** is refined with **red croton** (川红寥), boiled for seventy days. Externally, wrap it tightly in **gold foil** (金箔), then place it inside the **pregnant crucible** (前匮) to nurture by fire for seven days. Take two *qian* of **vermilion**, which can transmute **one *liang* of worldly silver** (世银) into **gold of perfect hue** (足色金).\n\n**Mother Sand of the Mandarin Duck and Dwarf Crucible (鸳鸯庚母砂法):**\nIn nurturing **Geng mother sand** (庚母砂), whether using **three 7-day cycles** (三七) or **four 6-day cycles** (四六), one must first extract the **true mercury** (真汞) from the sand and balance it with **silver mother** (银母), forming the sand.\n\nPlace it in the **empty crucible** (虚养) and nurture for one **7-day cycle** (一七日), then **press out the mercury** (逼出汞). Mix **greater celandine** (龙胆草), **wormwood** (莽草), **turmeric** (郁金), and **red pine resin** (赤松香) into powder, first spreading half over the pot’s base. Below, pour **Geng** and **mercury** (浇汞), then cover the remaining half over the head. Seal the pot’s mouth with **paper** (皮纸), gently warm with fire, and stir occasionally. After a day, take the sand and use it as a **foil** (贴身) in the crucible.\n\n**Regulating the Dao of Geng: Transformation and Refinement**\n\nExtract the **tooth** (牙子), nurture it in **empty crucible** (虚养) with minimal smoke—**ten percent** of the original method—then cook it as usual until it solidifies and matures.\n\nUse a **silver chamber** (银室), place the **sprout** (芽) inside, and encase it with **dead lead** (死铅) as the outer crucible. Nurture with **fire for 49 days** (七七日), then remove the sprout.\n\nFor every **eight catties** of the sprout, add **two catties of true mercury** (真汞), blending them into a paste. Then use **twelve catties of Geng** (庚) as the **divine chamber** (神室), placing the sprout inside, and encase it with **sulfur** (硫黄) as the outer crucible. Nurture with **fire for 49 days** (七七日). Once the sprout is finely ground into a paste, add **two catties of true mercury** again.\n\nProceed to nurture it in a **golden chamber** (金室) with fire until it accumulates to **one catty**, naming it the **Great Elixir of Dragon and Tiger** (龙虎大丹). This can then be used as a crucible to nurture the **Four Spirits of Cinnabar** (朱砂四神).\n\nTake **four catties of the brightest cinnabar** (大光明者), first boiling it in **mulberry juice** (桑汁) for **three periods of dog days** (三伏时). Next, boil it with **vinegar and bile** (米醋胆炮) until the flame subsides. Wrap each piece in **gold foil** (金箔), then coat it with **bile** (胆炮) as a protective layer. Place it in the **Dragon-Tiger crucible** (龙虎匮), covering it, and nurture with fire for **21 days** (三七日). The cinnabar will then truly die and liquefy.\n\nThis can be transformed into the **Three Yellows** (三黄) to create the **Four Spirit Elixir** (四神丹). For each of the **Three Yellows** (二两), boil them in **mulberry juice** (桑汁) for **five periods of dog days** (五伏时). Add the **four catties of processed cinnabar**, blending them evenly into a paste.\n\nUse **twelve catties of fresh Geng** (新庚) as the chamber, placing the **Four Spirits** (四神) inside, and encase it with the **Dragon-Tiger Elixir** (龙虎丹) as the outer crucible. Place the **golden chamber** (金室) within, sealing it tightly, and nurture with fire for **one month**. The fire dosage is **four catties**, with **one catty of fuel per day**, totaling **three catties of fuel per layer** (三斤一缎). Remove from the cold furnace—all Four Spirits will turn **purple**, and the fire is extinguished.\n\nFor every **one money** of **dry mercury** (乾汞), it can refine **one catty of high-grade purple-gold powder** (上色紫磨金). Nurtured with fire for **three months**, one money can refine **four catties of mercury**. After one cycle, one money can refine **forty catties of mercury**.\n\nAlternatively, use the **Dragon-Tiger crucible** to refine **bile vitriol** (胆矾), extinguishing the fire, which can then **transmute worldly silver into superior gold**.\n\n---\n**Method of Embryonic Breathing (胎息法)**\n\n**First Cycle:** Watering every **seven days**.\n- **Base (丹基):** Four catties.\n- **First watering (一二日):** Two catties of true mercury (真汞), sealed and nurtured for **seven days**.\n- **Second watering (三日):** One and a half catties.\n- **Third watering (四日):** Two catties.\n- **Fourth watering (五六七日):** One catty, with a **peak of two catties** on the seventh day. Then water again with one catty, following the same fire regimen.\nRepeat this **three times**, totaling **21 days**.\n\n**Second Cycle:** Watering every **five days**.\n- **Fire dosage:** One catty on the first day, two catties on the second, one and a half on the third, two on the fourth, and a **peak of two catties** on the fifth day. Then water again with one catty, following the same fire regimen.\nRepeat this **three times**, totaling **21 days**.\n\n**Third Cycle:** Watering every **five days**.\n- **Fire dosage:** One catty on the first day, two on the second, one and a half on the third, two on the fourth, and a **peak of two catties** on the fifth day.\nRepeat this **ten times**, totaling **50 days**, with a cumulative **71 days** from the start.\n\n**Fourth Cycle:** Watering every **three days**.\n- **Fire dosage:** Two catties on the first day (at the **hour of Mao or You** 酉), three catties on the second (at **Zi or Wu** 子午), and three catties on the third (at **Yin or Shen** 寅申).\nRepeat this **twenty times**, totaling **60 days**, with a cumulative **131 days** from the start.\n\nAfterward, water **once per day**, known as **\"morning sowing, evening harvest\"** (朝种暮收). Gradually increase the fire dosage.\n\n---\n**Sulfur Transmuting Ling Sand into Gold (硫黄断灵砂成金)**\n\nTake **dead sulfur** (灵草死硫黄), nurture it in gold for **seven days** (一七日) with **great fire in a crucible** (大火一鼎). Repeat this **49 times** (七七鼎), changing the gold each cycle—until the sulfur turns golden.\n\nFor every **one catty of Ling sand** (灵砂), use **two money of sulfur** (硫二钱) and a **small amount of red earth** (代赭石), blending them into a paste. Apply **saltpeter wash** (硝盥) to the top, then stir with **great fire in a single motion** (大火一抡). This yields **seven money of red gold** (赤金), a **treasure supreme**.\n\n---\n**Boxed Gold Method (盒金法)**\n\nTake **five money of pure gold** (足色金子) and **five money of pure silver** (足色银子), melt them into a liquid, and shape them into **sheets or blocks**. Cut **clay tiles** (瓦片) to match the object’s length, width, and size.\n\nFirst, lay a **thick layer of medicine** (药厚一分) at the base. Place the object on top, then cover it with another **thick layer of medicine** (一分多盖面). Seal it with a **clay tile** and build a **mud wall** around the edges. Place it in a furnace, lighting **several fires beneath** to level it. Arrange **red-hot coals** on top, covering the tile completely. Fan it until the tile turns **slightly red**, then cover it with **hot ashes**. After **seven to eight hours**, remove it, wash it with water, and apply the **peeling method** (剥法).\n\n---\n**Preparation of Flower Vitriol (花喊)**\n\nTake **one catty of flower vitriol** (花臧) and **one catty of gas vitriol** (气胆矾). Rinse the flower vitriol with **half a bowl of water**, removing impurities, then slowly evaporate it in a **small wind furnace** (小风炉) using a **clay bowl** (瓦盏) until it crystallizes. Gradually add the vitriol, evaporating until dry. Grind it finely and apply the **peeling method** (剥法).\n\n---\n**Coating with Saltpeter, Vitriol, Niter, Stone Bile, Green Vitriol, and Yellow Vitriol**\n\nGrind **salt, vitriol, niter, stone bile, green vitriol, and yellow vitriol** finely. Mix them with **vinegar in a clay vessel** into a thick paste. Use a **chicken feather** to brush it on, then bake it over fire, skimming it in water **three to four times**.\n\n---\n**Method of Coating Cinnabar (贴身朱砂法)**\n\nTake **white honey** (白蜜), mixing it half with water. Simmer it in a **white vessel** (白器) over fire until it thickens. Drip a few drops of honey into the vessel, then add **cinnabar** (朱砂), stirring until the cinnabar is **completely coated**.\n\nPour the cinnabar into another **white vessel**, gently wiping it with **soft paper** until the cinnabar is **slightly moistened with honey**. Place a **sheet of prepared paper** (熟纸) on top, then use a **sharp tendon** to carefully transfer each grain of cinnabar onto the paper, arranging them evenly. Apply the **coating medicine** (贴身药) on top.\n\nCover it again with **prepared paper**, then place **coating herbs** (贴身草药) on top. Gently shake the coating medicine until evenly distributed, dry it, wrap it in paper, and let it cool. Place it in a **mother crucible** (合母) with **five parts below and three parts above**.\n\nFollow the **fire regimen of the Green Gold Method** (青金法), using **Sichuan pepper and tangerine leaves** (淮椒橘叶) to boil the cinnabar.\n\n---\n**Green Gold Method (青金法)**\n\nTake **five money of mother substance** (母) and **two money of mercury** (汞), placing them in a **sweet crucible** (甘锅), covering it with **oil**, and gently heating until the **mother solidifies and transforms**.\n\nTake **one to two money** of the mother substance, then remove and scrape off the mercury sand, leaving **three and a half money** of pure mother substance. Pass the mercury sand through fine paper, then take **half a liang** of already-boiled mercury inside, ensuring only **half a money** of mother substance remains, leaving the rest aside.\n\nWith **four and a half money** of mother substance, this mother may later be used incrementally to boil **twenty-plus liang** of mercury, each time measuring **two and a half liang** as standard.\n\nNext, take the **half-liang of mercury-cinnabar** and place it in a **gourd-shaped crucible** with **one and a half money** of [another substance?], roasting it into **Green Gold**. Then add **half a money each of gold sprouts (金苗)**, **female lead (雌妇)**, and **grass-encased cinnabar (草伏朱砂)**, roasting until they intermingle and fuse. After lactating again, roast briefly, then shape it into a **four-money circle** using a bamboo mold.\n\nMoisten the medicine with **rice-wine broth**, place it inside the circle with **parchment below** and **lactated paste above**, pressing tightly and drying. Then take **one and a half liang of good mountain saltpeter (山泽)**, grinding it into a fine, continuous powder. Spread **two parts** on the paper and cover with **three parts**, sealing it to a height of **four fen**. Apply the fire regimen:\n\n- **Days 1–3, 2–3 money** of fire.\n- **Days 4–6, 2–4 money** of fire.\n- **Days 7–9, 2–5 money** of fire.\n- **Days 10–12, 2–6 money** of fire.\n- **Days 13–14, 2–7 money** of fire.\n\nOnce complete, remove it and **chisel a grain-sized piece of Green Gold** from the mother. Blow it over fire—if it forms a bead without flame, it has separated from the mother. Place the Green Gold in a **mother crucible** for **ten days of empty cultivation (虚养)**, then blow-test again until no flame appears.\n\nIf flame remains, repeat the empty cultivation. Then take the **seven-money already-dead elixir (死丹)**, boil fresh mother-mercury as before, roast **one and a half liang** following the prior method, and mix with the dead elixir. After lactating again, roast briefly, then divide into **two cakes**, placing them in **two mother crucibles** with **seven liang of mountain saltpeter each**. Apply fire from **two and four money**, up to **two liang**, for **fourteen days**. Upon removal, blow-test—if it forms **white silver cinnabar (白银朱)**, proceed.\n\nTake the **two-liang already-dead Green Gold**, roast **eight liang of fresh mother-mercury**, and divide into **five cakes** for **five crucibles**. Each crucible uses **six liang of mountain saltpeter**, with fire from **two and six money**, up to **two and two money**, for **fourteen days**. After removal, empty-cultivate for **half a month**, then the medicine may be tested.\n\n**Method for Preparing the Mother Crucible (制母方灶) and Boiling Mother-Mercury (元煮母汞):**\nTake dried mother substance, wrap it in paper, and place it in a **fifty-liang sweet crucible**, sealing the top with paper. Heat to drive out the mercury. Then wrap the mother in **two or three layers of paper**, encase it in a **yellow clay ball three to four fen thick**, and slow-roast overnight. The next day, remove the clay, place it in a **wind furnace**, and collect the smoke-laden crucible.\n\n**Refining Cinnabar with Regal Mealy Plant (支笔涯朱砂转庚梅核):**\nTake **eight liang of cinnabar**, **three large担 of sour-sop (三角酸)**, and extract **two dou of natural juice**, along with **three jin of black plums (乌梅)**, boiling into **one dou of liquid**. Suspend and boil the cinnabar for **three periods (三伏)**, then drain and dry it. Apply **stone brain oil or pounded sand water**, and coat with **ten parts of magnetite powder (十分坚者)** as a binding agent.\n\nThen take **six liang of pure gold (赤金)** and **ten liang of mercury**, boiling with concentrated **pepper juice** until it forms sand. Cook with **goji sprout juice (枸杞苗汁)** for a day, then reboil the sand, grinding until moist. For every **one liang of cinnabar**, wrap it with **two liang of mother sand**, sealing tightly overnight to solidify.\n\nTake **eight liang of realgar (代赭石)**, grind finely, and soak in **seven to eight parts acetic acid**. Boil in a **porcelain vessel**, stirring evenly, with **four liang of firefly (火蝴蝶, iron flower)** and **two liang of genuine copper sulfate (胆矾)**. Suspend and boil, adding heat gradually, for **half a day in acetic acid**. Discard the firefly, retaining only the **realgar-copper sulfate mixture**, then dry it.\n\nTake **one gourd (山莆)**, the **cultivation-fire crucible (养火合子)**, and treat it with **ginger juice**. Then use **chicken egg white to mix ink**, coating the gourd **ten-plus layers**, about the thickness of a grain of rice. Apply **five flavors of male and female bile (雄胆曾代)**, mixed with chicken egg white and ink, coating another **ten-plus layers**. Place the **previously refined stone and copper sulfate** inside the gourd as a container, then arrange the **mother-sand-wrapped cinnabar** like planting lotus seeds, sealing it properly. Bury it in an **ash pit** for **one month of cultivation**, with fire from **one to fifteen**, then back to one—**a full cycle of 140 liang of fire**. Cultivate using the **Unfinished (未济) Method**.\n\nWhen complete, remove the cinnabar, strip away the mother sand, and reveal the treasure.\n\n**Second Transformation: Yellow Sprout (二转黄芽)**\nTake the previously refined cinnabar, bathe it in **concentrated juice of gold-star grass (金星草, 管仲苗)** for one hour. Then prepare the gourd, coating it with **ginger juice, chicken egg white, and five flavors of male bile in vinegar**, as before. Place the cinnabar inside using the **pouring method (浇淋法)**. Pour **four liang of true mercury**, cultivating at **child-midday-ox-monkey hours (子午卯酉)**, maintaining **four liang of fire**. Again use the **Unfinished Method**. Open after **three days**—do not disturb, as the sprout is tender. Pour **three more liang** on **days five or seven**, repeating until **twelve liang** are poured. Open and close to harvest the sprout, storing it in a **pure chamber**.\n\n**Third Transformation: Purple River Vehicle (三转紫河车)**\nTake **five liang of clear male essence (明雄)**, undisturbed, and boil with **concentrated soapberry (皂角)** for **three periods (三伏)**, washing and drying it. Coat with **chicken egg white and male bile**, then roast with **stone brain oil** until permeated. Alternatively, add **pounded sand**. Wrap tightly in **gold foil**, then coat with **chicken egg white and ink ten-plus layers**. Place the prior sprout inside, adding **two liang of true mercury**, grinding into powder.\n\n「Take the **outer layer of the mother sand** (母砂), adding **five liang of raw cinnabar** (赤金), and process the rest as before to form a **refined elixir** (灶成汁). Mold it into a **divine chamber** (神室)—shaped like a chicken egg—following the **sand-vehicle preparation method** (制砂莆法).\n\nThen insert the **sprout** (芽子), half beneath, and place the **male essence** (雄) within. Cover with the remaining half of the sprout above. Secure it with **iron wire** as per the method, then seal firmly with mud (用泥封固毕). Apply **amberglass medicine** (瑁璃药) to coat it.\n\nNext, take **four liang of red salt** (赤盐) and **two liang of saltpeter** (硝), grind finely, and gradually add them to a **large sweet crucible** (大甘锅). Process into elixir (灶成汁) and pour into **porcelain or stone vessels** (磁器、石器). Grind again into fine powder, mix with the **sand-vehicle** (沙莆), and place inside the **golden chamber** (金室), sealing it firmly. Then immerse in **ash pit** (灰池) and nurture it with **unfinished fire** (未济火).\n\nFor **one day, one liang of fire** (火候), until **six days, six liang**. On the **seventh day**, nurture it with **six liang of yang fire** (六阳火). **Forty-nine days** suffice. Retrieve the **vehicle** (莆), suspend it in **lead**, and decoct for half a day. Then open the **vehicle** to extract the medicine, grinding it finely together.\n\nDivide each **liang into four hundred pills** (丸), using **paper pulp juice and wax** (楮汁蜡剂) to form them. For each pill, take **one plum kernel** (梅核), and pierce a small hole at the top. Remove the pit (去仁), then insert **eight or nine parts of true mercury** (真汞), along with **one pill of medicine** inside. Seal the hole with **willow wood** (柳木).\n\nNext, use **gold-wrapped earth** (包金土), **red earth** (代赭), **stone bile** (石胆), **alum** (矾), **saltpeter** (伏硝), and **white friend’s resin** (白友津) to adjust and coat paper, wrapping the plum kernel **four or five layers** thick. Seal firmly with salt mud (盐泥固了), then place in a **sweet crucible** (甘锅), packing it solid with yellow mud (黄泥筑实). Heat with a **great fire** (大火) until it glows red and the mercury within turns to gold (刺水中汞成金矣).\n\n**Method for Refining the Mud (法泥):**\nTake **half a jin of earthworm soil** (蚯蚓土), **four liang of red stone pitch** (赤石脂), and **two liang of yellow cinnabar** (黄丹). Use **two liang of rabbit hair powder** (兔毫盏末), grinding them finely together. Mix with **white friend’s resin juice** (白友汁) and pound **a million times** (杵千万下) before combining with the inner and outer chambers.\n\n**Amberglass Medicine (瑁璃药):**\nTake **half a jin of lead yellow flower** (铅黄花), adding **two liang of saltpeter** (硝) and **two liang of borax** (硼). Process vigorously into elixir (大抡作汁), applying it to the **divine chamber** (神室) to ensure a sealed, airtight closure (使其封固得密). If nurturing and refining the **vehicle** (糁), it must be done this way, so that the **qi does not escape** (气不出外), and the **transmutation of the exterior will be complete** (裹面造化自全矣).\n\nThe **Great Elixir of Golden Flower and Jade Dew** (金华玉液大丹) is finished.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞神部众术类 金华玉液大丹 经名：金华玉液大丹。 未着撰人，似出宋代。 一卷。 底本出处：《正统遭藏》洞神部众术类。 金华玉液大丹 朱砂一斤，十分光明者用　三友木二月收　新荷叶四月收　马鞭草八月收 右各烧灰斗许，取淋下十分浓汁，煮朱一月，共三百六十跻朱俱成雪白色，名曰玉英，服之可治百病。 煮法 入前朱於小瓶内，三草灰汁八分侵满，梼碎生姜，用布包塞瓶口，重汤煮之，日足取出朱，用皂角煮一日，乳细，以长流水淘五七次。 养法 用阳起石、磁石、禹余根、石代赭石、紫石英、誉石，已上六石，醋淬梼碎。 又以硝石并太阴玄精二味，同毁成汁，一处俱乳细，作外匮。 仍用银十二两作神室，置前朱於中，纳入外置砂合，封固如法一灰池顶火养一月，火候二至四两。 日足取出，名曰玉液，可以点铜成银，坚铅成宝。 用前玉液，以金十二两作神室，纳其中，外以前匮固之，入砂合，封固如法，灰池顶火养一月，火候四至六两，日足取出，其状绿褐色，如明窗尘，名日紫粉。 每用半铢，可乾汞一两，成至宝银也。 用前紫粉，以汉椒、防己煎汤，沐浴少时。 又用银十二两作内神室，雌三雄四，一处和研，入内神室中。 又用金十六两，作外神室，纳紫粉於其中，内神室入外神室，外神室入前八石匮中，沙合封固，养火一月，火候二至六两，日足开合，银室紫粉俱成黄色金，名日金华。 每用半铢，可乾汞一两成庚。 到此去八石不用，但以前金华，并内养出牡牝，一处和研，作外匮。 又以金十六两作神室，纳生朱十两於其中，置在金华匮内，砂合封固，如法灰池，六阳火养四十九日足，开合，’金华成紫金色，可作长生匮。 朱砂如胆矾色，此名紫霞丹。 每用养出朱砂半铢，楮汁为丸，糁汞五两，成黄金。 亦能化五金，俱可成宝，生生变化无穷。 银精丹 朱砂四两　粉霜六两　三友霜半斤。 如炼霜以夹布袋盛朱，悬胎煮为妙 右取桑柴烧灰一，淋取浓汁，以软火炼之，锅内着一握稻草，其汁自结霜在上。 以清水汹之，再熬乾成霜。 先铺霜底，四面及中间铺粉霜，入朱砂在内，仍以粉霜盖之。 次用桑灰霜盖瓦片，封口，六一泥固灰池，阳火养七日，火候九两。 养之日足，火煅通红，取出灰池，候玲取砂，其色雪白如银屑，妙甚。 金曾以此代金华大丹头，其功与之并驾，今书此以记之。 四圣丹 毗八两　粉六两　雄三两　雌三两 毗用募苏汁二槐，旱莲汁三槐，煮尽洗净。 又用募苏汁半槐，炒尽为度。 粉以寻苏三斤许，浓煎汁煮尽。 雄以鸭舌草二斤，上下米浴水侵煮尽。 雌以紫苏草二斤许，米糠醋煎汁煮尽。 粉六两，用山泽银六两，搅为末。 四两和粉末在火鼎底，上用二两银末捺头，入水火鼎，如法通身固济。 汞每粉一两，加了脚半两，同缎，如用汤煮过用之。 固药用无名异蚁粉、纸筋、盐泥，同梼千万下。 灰平筑鼎，倒露出水鼎，及受缎处。 先下火一斤，缎二时提起。 用瓦陀坛起半寸许，再下火簇缎一个时。 又如前法，添尽四个瓦陀子，各过一时、提起，添好炭一二块在底，令药受毁，火有三斤。 ，用瓦围了，添火一斤。 此是全料，火候到此，消详用之。 却用灰盖寒炉，冷取粉母分胎。",
      "translated_text": "**Gold and Flower Elixir of Great Dao (Jinhua Yuye Dadan)**\n\n**Title:** *Jinhua Yuye Dadan* (Gold and Flower Elixir of Great Dao)\n**Author:** Unknown, likely from the Song Dynasty (似出宋代)\n**Source:** *Zhengtong Daozang* (Orthodox Daoist Canon of the Zhengtong Era), *Dongshen Bu* (Cavernous Deity Section), *Zhongshu Lei* (Miscellaneous Arts Category)\n\n**One Volume**\n\n**Method:**\nCinnabar (朱砂) – 1 *jin* (斤), use only the most luminous tenth (十分光明者用).\nCollect the following herbs at their respective times:\n- *San You Mu* (三友木, Three Companions Wood) in the second month (二月收)\n- Fresh lotus leaves (新荷叶) in the fourth month (四月收)\n- *Mazhen Cao* (马鞭草, Horsetail Herb) in the eighth month (八月收)\n\nBurn each into ash (烧灰), measuring roughly one *dou* (斗) each. Extract the most concentrated juice (十分浓汁) from the ashes. Boil the cinnabar in this juice for one month (一月). After 360 *zhi* (跻, a unit of time, likely \"days\"), the cinnabar will turn snow-white (雪白色), named *Yuying* (玉英, Jade Essence). Consuming it can cure all ailments (可治百病).\n\n**Boiling Method:**\nPlace the cinnabar (前朱) in a small bottle (小瓶内). Fill eight-tenths (八分) with the juice of the three herbs' ashes (三草灰汁). Add finely chopped fresh ginger (梼碎生姜), wrap it in cloth (用布包), and seal the bottle's mouth (塞瓶口). Boil in a covered pot (重汤煮之). Daily, remove the cinnabar and use *zaojiao* (皂角, soapberry) to boil it for another day (煮一日), refining it until it becomes milky (乳细). Wash it with flowing water (长流水) five to seven times (淘五七次).\n\n**Nourishing Method:**\nUse the following six minerals (六石), each refined with vinegar (醋淬) and finely ground (梼碎):\n- *Yangqi Shi* (阳起石, Yangqi Stone)\n- *Cishi* (磁石, Magnetite)\n- *Yuyu Gen* (禹余根, Yuyu Root, a mineral)\n- *Shidai Zhe Shi* (石代赭石, Vermilion Stone)\n- *Zishi Ying* (紫石英, Amethyst)\n- *Yushi* (誉石, a mineral, possibly Calcite)\n\nBlend these minerals with the juice of *xiaoshi* (硝石, saltpeter) and *Taiyin Xuanying* (太阴玄精, Yin Essence of the Dark Primordium, possibly a mineral or alchemical term) until they become milky (俱乳细), forming the outer casing (外匮).\n\nFurther, use 12 *liang* (两) of silver to create the *Shenshi* (神室, Divine Chamber). Place the refined cinnabar inside (置前朱於中), then insert the outer casing (纳入外置砂合). Seal it tightly (封固如法) and place it atop a furnace (灰池顶火) to be nourished by fire for one month (养一月), adjusting the flame to 2–4 *liang* (两) of fuel daily (火候二至四两). Remove it daily (日足取出), naming the result *Yuye* (玉液, Jade Elixir), which can transmute copper into silver (点铜成银) and lead into treasure (坚铅成宝).\n\n**Next Process:**\nUse the *Yuye* (玉液) to create another *Shenshi* (神室, Divine Chamber) with 12 *liang* (两) of gold (以金十二两作神室). Place the *Yuye* inside (纳其中), seal it with the outer casing (外以前匮固之), and insert it into a sand mixture (入砂合), sealing it as before (封固如法). Nourish it atop the furnace (灰池) with fire for another month (养一月), adjusting the flame to 4–6 *liang* (两) of fuel daily (火候四至六两). Remove it daily (日足取出), and its appearance will be greenish-brown (绿褐色), like dust on a bright window (如明窗尘), named *Zifen* (紫粉, Purple Powder). Each half *chú* (铢) can dry 1 *liang* (两) of mercury (乾汞一两), producing *Geng* (庚, a refined metal, possibly silver or gold).\n\n**Application:**\nUse the *Zifen* (紫粉) with decoctions of *Han Jiao* (汉椒, Sichuan Pepper) and *Fangji* (防己, Stephania Root) for bathing (沐浴少时).\n\n**Further Refinement:**\nUse 12 *liang* (两) of silver for the inner *Shenshi* (神室, Divine Chamber), with a ratio of 3 parts female to 4 parts male (雌三雄四). Grind them together (一处和研) and place them inside the inner chamber (入内神室中). Use 16 *liang* (两) of gold for the outer *Shenshi* (神室, Divine Chamber), placing the *Zifen* inside (纳紫粉於其中). Insert the inner chamber into the outer one (内神室入外神室), and then place the outer chamber into the previous casing of the eight minerals (外神室入前八石匮中). Seal it with sand (沙合封固) and nourish it with fire for one month (养火一月), adjusting the flame to 2–6 *liang* (两) of fuel daily (火候二至六两). Open and close it daily (日足开合), and both the silver chamber and the purple powder will turn yellow like gold (俱成黄色金), named *Jinhua* (金华, Golden Flower).\n\nEach half *chú* (铢) of *Jinhua* can dry 1 *liang* (两) of mercury (乾汞一两), producing *Geng* (庚, refined metal).\n\n**Final Process:**\nFrom this point onward, the eight minerals are no longer used (去八石不用). Instead, take the *Jinhua* (金华) and the male-female refined substances (内养出牡牝), grind them together (一处和研) to form the outer casing (作外匮). Use 16 *liang* (两) of gold to create another *Shenshi* (神室, Divine Chamber), placing 10 *liang* (两) of fresh cinnabar inside (纳生朱十两於其中). Place this within the *Jinhua* casing (置在金华匮内), seal it with sand (砂合封固), and arrange it atop the furnace as before (如法灰池). Nourish it with the *Liuyang* (六阳, Six Yang) fire for 49 days (六阳火养四十九日), opening and closing it daily (开合), until the *Jinhua* turns purple-gold (紫金色), becoming the *Changsheng Kuang* (长生匮, Elixir of Extended Life).\n\nIf the cinnabar resembles *Danfan* (胆矾, copper sulfate) in color (朱砂如胆矾色), it is named *Zixia Dan* (紫霞丹, Purple Cloud Elixir). Each half *chú* (铢) of this refined cinnabar, made into pills with *chou zhi* (楮汁, paper mulberry juice), can dry 5 *liang* (两) of mercury (糁汞五两), producing gold (成黄金). It can also transmute the five metals (化五金), all becoming treasures (俱可成宝), with endless transformations (生生变化无穷).\n\n---\n\n**Silver Elixir (Yin Jing Dan)**\n\n**Ingredients:**\n- Cinnabar (朱砂) – 4 *liang* (两)\n- *Fen Shuan* (粉霜, Powdered Frost) – 6 *liang* (两)\n- *San You Shuang* (三友霜, Frost of Three Companions) – half *jin* (半斤)\n\n**Method:**\nAs with refining frost (如炼霜), wrap the cinnabar in a linen bag (以夹布袋盛朱) and suspend it during boiling (悬胎煮为妙).\n\nTake mulberry twig ash (桑柴烧灰), extract its concentrated juice (淋取浓汁), and refine it with gentle fire (以软火炼之). Place a handful of rice straw (一握稻草) in the pot, and the juice will condense into frost (其汁自结霜在上). Wash the frost with clean water (以清水汹之), evaporate it again, and it will become powdered frost (再熬乾成霜).\n\nSpread the powdered frost (粉霜) at the base, then on all sides and the center. Place the cinnabar inside (入朱砂在内), and cover it with more powdered frost (仍以粉霜盖之). Next, cover with mulberry ash frost (桑灰霜) and a tile (盖瓦片), seal the mouth with *Liuyi* (六一, Six-to-One) clay (泥), and build the furnace (固灰池). Nourish with yang fire (阳火) for seven days (养七日), adjusting the flame to 9 *liang* (两) of fuel daily (火候九两). Open and close it daily (日足开合), and the cinnabar will turn snow-white like silver flakes (其色雪白如银屑), with marvelous results (妙甚).\n\n**Note:**\nThis can replace the *Jinhua Dadan* (金华大丹) as the initial alchemical substance (金曾以此代金华大丹头), and its efficacy is equal (其功与之并驾). This method is recorded here for reference (今书此以记之).\n\n---\n\n**Four Holy Elixirs (Si Sheng Dan)**\n\n**Ingredients:**\n- *Bi* (毗) – 8 *liang* (两)\n- *Fen* (粉) – 6 *liang* (两)\n- *Xiong* (雄) – 3 *liang* (两)\n- *Ci* (雌) – 3 *liang* (两)\n\n**Refinement of *Bi*:**\nBoil *Bi* (毗) with *Musu* (募苏, likely a herb) juice, using 2 *huai* (槐, a measure) of the former and 3 *huai* (槐) of the latter (募苏汁二槐, 旱莲汁三槐). After boiling it to exhaustion (煮尽), wash it clean (洗净).\n\nFurther, boil *Bi* with half *huai* (半槐) of *Musu* juice until fully fried (炒尽为度).\n\n**Refinement of *Fen*:**\nBoil 3 *jin* (斤) of *Xunsu* (寻苏, likely a herb) juice to exhaustion (浓煎汁煮尽), using 6 *liang* (两) of powdered substance (粉).\n\n**Refinement of *Xiong*:**\nBoil 2 *jin* (斤) of *Yashi Cao* (鸭舌草, Duck-tongue Herb) in water, using rice washings (上下米浴水) to exhaust it (侵煮尽), for 3 *liang* (两) of male substance (雄).\n\n**Refinement of *Ci*:**\nBoil roughly 2 *jin* (斤) of *Zisu Cao* (紫苏草, Purple Perilla Herb) in vinegar with rice bran (米糠醋煎汁) until exhaustion (煮尽), for 3 *liang* (两) of female substance (雌).\n\nTake 6 *liang* (两) of powdered substance (粉) and mix it with 6 *liang* (两) of mountain or river silver (山泽银), grinding into a fine powder (搅为末). Place 4 *liang* (两) of this powder at the base of a fire crucible (火鼎底), and use another 2 *liang* (两) of silver powder (银末) to seal the top (捺头). Insert the crucible into a water-fire furnace (水火鼎), sealing it tightly as before (如法通身固济).\n\nFor each *liang* (两) of powdered substance (粉), add half *liang* (半两) of mercury (汞) to its feet (加了脚), blending them together (同缎). If used in a decoction (如用汤煮过), boil it as needed (用之).\n\n**Sealing Method:**\nUse *Wuming Yimai Fen* (无名异蚁粉, Powder of Nameless Ants), *Zhijin* (纸筋, Paper Fibers), and salt clay (盐泥), grinding them finely together (同梼千万下).\n\nLevel the ash (灰) and build the furnace (筑鼎), exposing the water crucible (倒露出水鼎) and the place where the mixture is inserted (及受缎处).\n\n**Firing Process:**\nFirst, ignite 1 *jin* (斤) of fire, and after two hours (二时), lift the crucible. Use a *Watao* (瓦陀, likely a type of clay pot or furnace) vessel, raising it half an inch (半寸许), and ignite another hour (下火簇缎一个时). Repeat this process four times (添尽四个瓦陀子), each time lifting after one hour (各过一时、提起). Add one or two pieces of charcoal (炭) to the base, allowing the medicine to absorb the heat (令药受毁), with a total of three *jin* (斤) of fire. Surround the furnace with tiles (瓦围了), and add another *jin* (斤) of fire.\n\nThis completes the full preparation (此是全料). When the fire reaches this stage (火候到此), carefully use the elixir (消详用之).\n\nFinally, cover the furnace with ash (灰盖) and let it cool. Remove the powdered mother substance (粉母) from the crucible (分胎).",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1252,
      "start_sentence": 0,
      "end_sentence": 53,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 40.64635610580444,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\金华玉液大丹.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "右用粉细研，同毗等研匀入鼎。 留二两毗，醋搜捺头固济，养火三七日。 一七火候，初日二两，二日二两半，三日至七日四两。 日足，寒炉取之，通研细，再入鼎，如前法一缎，取出研细入合，再养，此缎不必用母。 二七火候，初日二两，二日二两半，三日三两，四日二两半，五日四两，六日早四两，晚四两，七日早五两，晚六两，顶二两，四围四两。 首尾三斤，取出研细入鼎，如前法一缎研细，又入鼎再养，换新炭。 三七火候，初日二两，二日三两，三日四两，四日五两，五日五两。 六日五两。 七日就缎，末香三斤，炭团二个，同梼细放在四边，熟火六两。 按五方安之，以瓦四片盖了，顶上出烟，三日后寒炉，方取。 可以作匮养雌雄粉。 一转变化 每粉一两，先用荷灰汁煮一日。 仍用水调白友末，颗颗包了，同莒蒲末同炒一日许，取出，去白友，以粉研细，加入赤了脚半两，共为末，和银粉一两，依前缎粉法缎之。 取粉再入银室中，以前匮覆籍，养火七七日，每粉一钱可点骨一两，为十分彻糁，不过铅池。 二转变化 辰汞成粉霜如本法，亦如前用荷灰汁煮银母，缎银室，养死。 每养死辰汞一两，入雄四钱，雌二钱，同研匀，用庚母作神室，纳雌雄於其中，养火。 以前四圣丹作外匮，火候四两，二十一日早晚换火，日足，寒炉，取雌雄粉，每一钱可点银一两，成上色矣。 三转乾汞 以养死雌雄粉，纳入金室中。 大光明颗块砂，先用胆炮硫桑汁，内煮三伏时，取出控乾，金箔包了，栽在雌雄粉内，以四圣丹作外匮，封固养火七七日，火候二至六两，日足，取朱一钱，可乾汞四两，成上等金。 六神匮 毗用马苋菜、柳叶同梼汁，煮五日就，用草球缎。 炮每两用半夏、草乌二两，铺盖，二斤火缎。 乳入葱管内，装入藕窍中，泥固两头，二斤火毁。 硼一两用白酒脚一盏，煮尽粉，山栀子、细辛、雷亢、瓜篓煮五七日，用川狼毒、石榴皮、鬼旧、五倍子、石韦包缎。 右取粉四两，对各物一两，同乳成粉，装入合。 加蜻油一盏，养火七日，火候二两。 取出，又入蜻油一盏，再养七日，火候三两。 取出，又入蜻油一盏，养火七日，火候四两。 如此养三七日了，其药作匮养物。 以粉七两，对汞七两，入母二两，结成砂。 和粉研细，负阴窟暖取出，分开作颗块，用赤了脚贴身，入前匮栽莲法，养法二十一日，火候二至三，取粉半钱，点骨一两为丹阳。 独础匮变化 用川狼毒煮毗半斤，两个时候。 用梧桐律半斤，对毗同乳捡成汁，作碧玉色，取研细入炉，养火七日，其色雪白，方可变化，作匮养物。 －点金 蒲矾二两　黄矾五两　桐律二两　炮一两　青盥一两　解盐一两　雌黄二两　石油半两 右件仙人草裹之，一暖成汁，打开光明可爱。 用楮汁研如弹子大，金泊裹了，入前匮内养一日，或三日。 取之细研为末，黄腊丸如鸡头大。 每用物四钱，或五钱，对丹一九，点透骨十二分真色，若三七勾之，尤妙。 庵法 牙硝、白矾、石盥、鳝粉各等分，用盐卤调发烧之，其色便出。 又法 仙人草、巴豆、五倍、百部、骨补、川乌、草乌、半夏、南星。",
      "translated_text": "Right, grind the powder finely and mix it evenly with *Pí* (毘, likely cinnabar) and grind it together into the crucible.\n\nLeave two *liǎng* (两) of *Pí* (毘), and use vinegar to search and knead the head for solidification, nurturing the fire for **37 days** (三七日). The fire dosage for the first **37-day cycle** (一七火候) is as follows: two *liǎng* on the first day, two and a half *liǎng* on the second day, and four *liǎng* from the third to the seventh day.\n\nWhen the cycle is complete, cool the furnace and retrieve it, grinding thoroughly before returning it to the crucible. Repeat the process as before for **one refining** (一缎), then remove and grind finely into a container, refilling it again. This refining does not require the use of the original mother substance.\n\nThe fire dosage for the second **37-day cycle** (二七火候) is: two *liǎng* on the first day, two and a half *liǎng* on the second day, three *liǎng* on the third day, two and a half *liǎng* on the fourth day, four *liǎng* on the fifth day, four *liǎng* in the morning and four *liǎng* in the evening on the sixth day, five *liǎng* in the morning and six *liǎng* in the evening on the seventh day, with two *liǎng* at the top and four *liǎng* on each side.\n\nFor the **initial and final stages** (首尾三斤), retrieve the substance, grind it finely, and return it to the crucible. Refine it again as before for **one refining** (一缎), then remove and grind finely into a container, refilling it once more with a new batch of charcoal. The fire dosage for the third **37-day cycle** (三七火候) is: two *liǎng* on the first day, three *liǎng* on the second day, four *liǎng* on the third day, five *liǎng* on the fourth day, and five *liǎng* on the fifth day. On the sixth day, five *liǎng* are used. On the seventh day, refine as before (就缎), with **three *jin* (斤) of incense** (末香) and two charcoal clusters (炭团), finely mixed and placed on the four sides, nurturing the fire with six *liǎng* of fuel.\n\nArrange it according to the five directions (按五方安之), cover with four tiles (瓦), and leave the top open for smoke. After three days, cool the furnace and then retrieve it. This can be used for nurturing **male and female powders** (匮养雌雄粉).\n\n**First Transformation (一转变化):**\nFor each *liǎng* (两) of powder, first boil it with **lotus ash solution** (荷灰汁) for one day. Then mix it with water and **white lead** (白友) powder, wrapping each particle individually, and fry it with **Gé* (莒蒲, likely a type of grass or herb) powder for about a day. Remove it, discard the white lead, and grind the powder finely. Add half a *liǎng* of **red lead** (赤了, likely red cinnabar or red arsenic) and mix evenly. Combine with one *liǎng* of **silver powder** (银粉), and refine it according to the previous method for nurturing powder (如前法缎粉).\n\nRetrieve the powder and return it to the **silver chamber** (银室), covering it with the previous container (依前匮覆籍), and nurture the fire for **77 days** (养火七七日). For each *qian* (钱) of powder, one can refine **four *liǎng* of bone** (骨), achieving a **fully refined powder** (十分彻糁) that does not exceed the **lead pool** (铅池, likely a reference to a specific alchemical grade).\n\n**Second Transformation (二转变化):**\nGrind **powdered cinnabar** (辰汞) into a fine frost as per the original method. Also, as before, boil the **silver mother** (银母) in lotus ash solution (荷灰汁煮), refine the **silver chamber** (缎银室), and nurture it until completion.\n\nFor each *liǎng* of refined **powdered cinnabar** (养死辰汞), add four *qian* of male (雄) and two *qian* of female (雌), grinding evenly. Use **Gēng mother** (庚母, likely a type of furnace or container) as the **divine chamber** (神室), placing the male and female powders inside, and nurture the fire.\n\nUse the **Four Holy Immortals’ Pill** (四圣丹) as the outer container (作外匮), with fire dosage of four *liǎng*. Change the fire in the morning and evening for **21 days** (二十一日早晚换火). When complete, cool the furnace and retrieve the **male and female powders** (雌雄粉). Each *qian* can refine **one *liǎng* of silver** (银), achieving the highest grade of gold (上等金).\n\n**Third Transformation (三转乾汞):**\nUse the **male and female powders** (养死雌雄粉) refined as before, placing them inside the **gold chamber** (金室).\n\nTake **large luminous cinnabar** (大光明颗块砂), first **calcined with bile** (先用胆炮) and **mulberry leaf juice** (硫桑汁), boiling it for **three periods of heat** (三伏时). Retrieve it and dry it, wrapping it in gold leaf (金箔包了), and planting it within the male and female powders. Use the **Four Holy Immortals’ Pill** (四圣丹) as the outer container (作外匮), sealing and nurturing the fire for **77 days** (养火七七日), with fire dosage ranging from two to six *liǎng*. When complete, retrieve the substance: one *qian* of **cinnabar** (朱) can refine **four *liǎng* of dry cinnabar** (乾汞), producing the finest gold (上等金).\n\n**Six Divine Containers’ Method (六神匮):**\nUse **mallow leaves** (马苋菜) and **willow leaves** (柳叶) with *Pí* (毘) to refine the juice, boiling it for five days until completion. Refine it with **grass balls** (草球).\n\nFor each *liǎng* of *Pí* (毘), use **half-summer** (半夏) and **grass wu** (草乌) two *liǎng* each, spreading them out, and refine with **two *jin* of fire** (二斤火缎).\n\nMix it with **onion juice** (葱管内), and place it inside **lotus root holes** (藕窍中). Seal both ends with mud (泥固两头), and refine with **two *jin* of fire** (二斤火毁).\n\nUse **borax** (硼) one *liǎng*, boiling it with **white alcohol** (白酒脚) in a cup (一盏), until the powder is exhausted. Boil **mountain gardenia** (山栀子), **small asarum** (细辛), **thunder peach** (雷亢), and **bottle gourd** (瓜篓) for **five 37-day cycles** (五七日). Refine it with **wolfberry** (川狼毒), **pomegranate peel** (石榴皮), **ghost peach** (鬼旧), **five-fold childberry** (五倍子), and **stone wedelia** (石韦) wrapped and refined.\n\nTake four *liǎng* of powder, and for each, use one *liǎng* of the aforementioned substances, mixing them with **onion juice** (乳) to form a powder. Place them into a container (装入合).\n\nAdd **locust bean gum** (蜻油) one cup (一盏), and nurture the fire for seven days with fire dosage of two *liǎng*. Retrieve it, add another cup of locust bean gum, and nurture the fire for another seven days with fire dosage of three *liǎng*. Retrieve it again, add another cup of locust bean gum, and nurture the fire for seven days with fire dosage of four *liǎng*. Repeat this process for **three 37-day cycles** (如此养三七日了), and the medicine will be ready for nurturing in the container (其药作匮养物).\n\nUse seven *liǎng* of powder, and for each, use seven *liǎng* of **mercury** (汞), adding two *liǎng* of mother substance (入母二两), forming it into sand (结成砂). Mix it with powder and grind finely. Retrieve it from the **negative yin cave** (负阴窟), and divide it into granules (分开作颗块), applying **red lead** (赤了脚) to the surface. Place it inside the previous container using the **lotus method** (入前匮栽莲法), nurturing the fire for **21 days** (养法二十一日), with fire dosage ranging from two to three *liǎng*. Retrieve half a *qian* of powder to refine **one *liǎng* of bone** (骨), achieving **Dan Yang** (丹阳, a refined alchemical grade).\n\n**Alone Method (独础匮变化):**\nUse **wolfberry** (川狼毒) to boil *Pí* (毘) for half a *jin* (半斤), over two periods of time (两个时候). Use **mulberry leaf juice** (梧桐律半斤) to mix and refine with *Pí* (毘), achieving a **jade-like green** (碧玉色). Grind it finely and place it in the furnace, nurturing the fire for seven days. Its color will become **snow-white** (雪白), and then it can be transformed, used for nurturing in the container.\n\n**Method for Pointing Gold (－点金):**\nUse **two *liǎng* of calamine** (蒲矾), **five *liǎng* of yellow alunite** (黄矾), **two *liǎng* of mulberry bark** (桐律), **one *liǎng* of calcined** (炮), **one *liǎng* of green vitriol** (青盥), **one *liǎng* of refined salt** (解盐), **two *liǎng* of female mercury** (雌黄), and **half a *liǎng* of mineral oil** (石油).\n\nWrap these ingredients in **immortal’s grass** (仙人草), warm them to form a solution, and open it to reveal a luminous, pleasing color. Mix **paper mulberry juice** (楮汁) into a ball the size of a **bullet** (弹子大), wrap it with **gold foil** (金泊裹了), and place it inside the previous container to nurture for one day, or three days.\n\nRetrieve it and grind finely into a powder. Form **yellow wax pills** (黄腊丸) the size of a **chicken head** (鸡头大). Use four *qian* or five *qian* of the aforementioned substances, combined with **one *jiao* of the elixir** (对丹一九), to point and refine **bone to its true color** (骨十二分真色) to twelvefold transparency. If refined with **three 37-day cycles** (三七勾之), it is even more wondrous.\n\n**Cave Method (庵法):**\nUse **equal parts of saltpeter** (牙硝), **white alunite** (白矾), **stone alunite** (石盥), and **leech powder** (鳝粉), mixing them with **brine** (盐卤) to activate and ignite them. The color will emerge.\n\nAnother method:\nUse **immortal’s grass** (仙人草), **croton seed** (巴豆), **five-fold childberry** (五倍), **stemona root** (百部), **bone supplement** (骨补), **wolfberry** (川乌), **grass wu** (草乌), **half-summer** (半夏), **south starwort** (南星).",
      "overlap_context": "ch time lifting after one hour (各过一时、提起). Add one or two pieces of charcoal (炭) to the base, allowing the medicine to absorb the heat (令药受毁), with a total of three *jin* (斤) of fire. Surround the furnace with tiles (瓦围了), and add another *jin* (斤) of fire.\n\nThis completes the full preparation (此是全料). When the fire reaches this stage (火候到此), carefully use the elixir (消详用之).\n\nFinally, cover the furnace with ash (灰盖) and let it cool. Remove the powdered mother substance (粉母) from the crucible (分胎).",
      "start_char": 1253,
      "end_char": 2476,
      "start_sentence": 54,
      "end_sentence": 100,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 35.87809205055237,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\金华玉液大丹.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "养粉 每粉八钱，真汞二钱，母二钱，结成砂，伺研为泥，楮汁丸为龙眼大。 更用母箔包裹，入匮养七七日，可一钱点化丹阳一两。 养朱 每生朱一两，生毗一表作贴身，用二八母砂二两，包裹令密，入前匮养火三七日，可成宝。 亦可一钱，点骨一两。 养炮胆 每炮二钱，胆八钱，对养出粉霜一两，同研纳在合底，用金箔问隔，以前匮捺头，养火二七日，或一七日，可二钱点庚道一两。 养雌雄 每雌四钱，雄六钱，研为末，用蜜丸如圆眼大，金箔包了。 次用前养出朱一两，研细包裹，入匮养三七日，可一钱点一两，转白为黄。 朱砂浇芽四神匮芽养朱为糁制 朱砂四两，用大鱼腥草、何首乌，同煮三日，一缎，入母养一月成宝。 火候常存四两。 用朱冷作陀，浇汞二两，养火一月，火候一六日11 两，二六日三两，三六日四两，四六日五两，五六日六两，火共计百二十两。 又浇汞一两，又如法养一月，并是上火下水养之。 如此浇至五两足，换水火鼎内，又浇一两，又如前养一月。 如此浇至七日。 次· 入朱砂一两，又如前养火一月。 至九次。 又入朱砂，又养火一月。 已上并上水下火养之，共浇九次，得黄芽十两。 九月数足，十月脱胎，入四神匮养之。 四神匮法 雄黄用艾一毁八分死了，再养令真死。 入野薄苛煮了，雌同缎，又养死。 入即踯躅花未惊草煮了硫，养死？ 又入前草煮了朱砂、同养死。 然后以前芽子，入真汞二两，用母付斤，作室置。 芽子入四神匮，养之一月，一至十五，十五复归，元之数日足，取芽子作匮，以金箔包朱砂入内，养火七七日，火候四至八朱，可糁制矣。 硫黄汞为匮养雄点金 死硫十两，用厚金泊三两，重重铺盖，养火七日，硫真死。 再入生硫，同养死，取为匮。 另养三七母砂成芽，火候一日二两，三日四两，五日三两，六七日四两，或六两。 取芽子，用硫黄盖头，养二七日，一缎其芽真死。 方与硫黄对停，合胎为匮，养四六庚砂一两。 其庚砂以朱炮胆为末作贴身，入梅核内，养火七日，火候依前。 取对雄两，其雄先用胆白水煮一日，青矾煮半日，取出与死庚砂同研，入炮少许，蜜为丸。 养火二七日，火候一二日二两，三四五日三两，六七八九十日四两，十一十二日五两，十三十四日六两。 取出，以二钱点圣银一两，为黄矣。 圣银法 以硫黄养灵砂为银。 捡炮转庚道 炮不以多少，用车前草汁煮一分，炒乾。 以贝母、知母黑锅，仍用二草末撒在锅内，待烟起据下炮，大抡三五十扇，作汁真死，可养雌雄石胆，转制庚砂。 雌雄以腆脂菜，煮三伏时。 石胆用鹅不食草，煮一日，同乳成粉，蜜丸如黄子大，入前匮养火三七日，其药俱死匮中。 与炮合胎名为元阳匮，可养庚砂四药，各四两为匮。 朱砂以川红寥，煮七十日，外用金箔包令密，入前匮内，养火七日。 取朱二钱，可点世银一两，为足色金。 须用三七勾为上朱一两，用母箔二钱。 鸳鸯庚母砂法 凡养庚母砂，不问三七四六，须抽砂中真汞，先与银母对停，结成砂。 入鼎虚养一七日，再逼出汞。 用龙胆草、莽草川、郁金、赤松香右为末，先铺在锅底一半，下庚浇汞，次一半盖头，用皮纸糊锅口，用火煨，时时煽动，过日取砂子，方用贴身入匮。",
      "translated_text": "「**Nurturing Powder (养粉):**\nEach powdered batch consists of eight *qian* of the substance, two *qian* of true **mercury** (真汞), and two *qian* of the **mother** (母), formed into sand. When ground finely into paste, it is rolled with **paper mulberry juice** (楮汁) into pills the size of a **dragon eye** (龙眼大). Wrapped further in **mother foil** (母箔), they are placed in the **pregnant crucible** (前匮) and nurtured by fire for three **7-day cycles** (三七日), until one *qian* can transmute **one *liang* of cinnabar** (丹阳一两) into powder.\n\n**Nurturing Vermilion (养朱):**\nFor each batch, take one *liang* of **raw vermilion** (生朱) and one *liang* of **raw pyrite** (生毗) as a foil. Mix with two *liang* of **mother sand** (二八母砂), wrapping tightly, then place in the **pregnant crucible** (前匮) to nurture by fire for three **7-day cycles** (三七日), until it becomes **precious** (宝). Alternatively, one *qian* can transmute **one *liang* of bone** (骨一两).\n\n**Nurturing Gunpowder Bladder (养炮胆):**\nFor each batch, use two *qian* of **gunpowder** (炮) and eight *qian* of **bladder** (胆), refining to produce one *liang* of **powdered frost** (粉霜). Mix and press into a **sealed base** (合底), with **gold foil** (金箔) layered between. Place in the **pregnant crucible** (前匮) with a **pressed lid** (捺头), nurturing by fire for two **7-day cycles** (二七日) or one **7-day cycle** (一七日), until two *qian* can transmute **one *liang* of *Geng Dao* mercury** (庚道一两).\n\n**Nurturing Male and Female (养雌雄):**\nFor each batch, take four *qian* of **female** (雌) and six *qian* of **male** (雄), ground into powder. Roll with **honey** (蜜) into pills the size of a **round eye** (圆眼大), wrapped in **gold foil** (金箔). Then take one *liang* of the previously refined **vermilion** (朱), finely ground and wrapped, and place it in the **pregnant crucible** (前匮) to nurture by fire for three **7-day cycles** (三七日), until one *qian* can transmute **one *liang* of the substance**, turning white into yellow.\n\n**Vermilion and Mercury Sealed in the Four Divine Crucibles (四神匮) for Nurturing (芽养朱为糁制):**\nFour *liang* of **vermilion** (朱砂), cooked with **large fishy *vicia* grass** (大鱼腥草) and **He Shou Wu** (何首乌) for three days, then **sifted** (一缎), are placed in the **mother crucible** (母养) for one month to become **precious** (宝).\n\n**Fire and Water Balance (火候常存):**\nUse **vermilion** (朱) cooled into a **tortoise shell** (陀) form. Pour over two *liang* of **mercury** (汞), nurturing by fire for one month. The **fire and water balance** (火候) is maintained as follows: one *liang* for two **6-day cycles** (一六日), two *liang* for three **6-day cycles** (二六日), three *liang* for four **6-day cycles** (三六日), four *liang* for five **6-day cycles** (四六日), and five *liang* for six **6-day cycles** (五六日), totaling **120 *liang* of fire** (火共计百二十两).\n\nAlternatively, pour over one *liang* of **mercury** (汞) and nurture as above for one month, maintaining the **upper fire, lower water** (上火下水) balance. Repeat this process until five *liang* are poured. Then switch to a **water-fire crucible** (水火鼎), pour another *liang* of **mercury**, and nurture as before for one month. Continue this until seven *liang* are poured.\n\nNext, add one *liang* of **vermilion** (朱砂) and nurture by fire for one month. Repeat this nine times, maintaining the **upper water, lower fire** (上水下火) balance. After nine months, the **yellow sprout** (黄芽) is obtained, totaling ten *liang* (十两). In the tenth month, **detach the embryo** (脱胎), placing it in the **Four Divine Crucibles** (四神匮) for nurturing.\n\n**Four Divine Crucible Method (四神匮法):**\n**Realgar** (雄黄) is refined with **mugwort** (艾) to **eight-tenths of true death** (八分死了), then further nurtured to achieve **true death** (真死). It is cooked with **wild rhubarb** (野薄苛), then **sifted** (缎) with **female** (雌), and nurtured to **death** (死). Next, it is cooked with **unopened *tripterygium* flower and *southern starwort* grass** (即踯躅花未惊草), and refined with **sulfur** (硫), nurtured to **death** (死). Then, cooked again with the aforementioned **grass** (前草), **vermilion** (朱砂) is added, and nurtured to **death** (死).\n\nAfterward, take the **sprout** (芽子), add two *liang* of **true mercury** (真汞), and mix with **mother sand** (付斤) to form a **chamber** (室). The **sprout** (芽子) is placed in the **Four Divine Crucible** (四神匮), nurtured for one month, then **repeatedly refined** (一至十五) until fifteen cycles are complete. When the **original number of days is fulfilled** (元之数日足), the **sprout** (芽子) is used as the crucible, with **gold foil-wrapped vermilion** (金箔包朱砂) placed inside. Nurture by fire for three **7-day cycles** (七七日), maintaining the **fire and water balance** (火候) from four to eight *liang* of **vermilion** (朱), until it is ready for **sifting** (糁制).\n\n**Sulfur and Mercury for Nurturing Male and Transmuting Gold (硫黄汞为匮养雄点金):**\nTen *liang* of **dead sulfur** (死硫), layered with three *liang* of **thick gold foil** (厚金泊), are nurtured by fire for seven days until the sulfur achieves **true death** (真死). Then, add **raw sulfur** (生硫) and nurture it to **death** (死), forming the crucible.\n\nSeparately, refine **three 7-day mother sand** (三七母砂) into **sprout** (芽), maintaining the **fire and water balance** (火候) as follows: one *liang* for two days (一日二两), two *liang* for three days (三日四两), three *liang* for five days (五日三两), and four *liang* for six or seven days (六七日四两), or six *liang*.\n\nTake the **sprout** (芽子), cover its head with **sulfur** (硫黄), and nurture for two **7-day cycles** (二七日), then **sift** (一缎) until the **sprout** achieves **true death** (真死). Combine it with **sulfur** (硫黄) in a **balanced crucible** (对停), forming the **embryo crucible** (合胎为匮), and nurture four *liang* of **Geng sand** (庚砂).\n\nThe **Geng sand** (庚砂) is prepared by grinding **vermilion gunpowder** (朱炮胆) into powder as a **foil** (贴身), placed inside **prunus mume kernel** (梅核), and nurtured by fire for seven days, maintaining the **fire and water balance** (火候) as before.\n\nTake two *liang* of **male** (雄), which is first boiled in **bladder white water** (胆白水) for one day, then cooked with **green alunite** (青矾) for half a day. Afterward, it is ground with **dead Geng sand** (死庚砂), a small amount of **gunpowder** (炮) added, and rolled with **honey** (蜜) into pills. Nurture by fire for two **7-day cycles** (二七日), maintaining the **fire and water balance** (火候) as follows: two *liang* for one or two days (一二日二两), three *liang* for three to five days (三四五日三两), four *liang* for six to nine days (六七八九十日四两), five *liang* for ten or twelve days (十一十二日五两), and six *liang* for thirteen or fourteen days (十三十四日六两).\n\nWhen removed, use two *qian* to transmute **one *liang* of holy silver** (圣银) into **yellow gold** (黄矣).\n\n**Holy Silver Method (圣银法):**\n**Holy silver** (圣银) is obtained by nurturing **soul sand** (灵砂) with **sulfur** (硫黄). Use **gunpowder** (炮) to refine **Geng Dao mercury** (庚道).\n\n**Gunpowder (炮) is used regardless of quantity.** Boil with **plantain herb juice** (车前草汁) for one **division** (一分), then **parch and dry** (炒乾). Use **conch mother and *Anemarrhena* rhizome** (贝母、知母) in a **black pot** (黑锅), then scatter the powder of the two aforementioned **grasses** (二草末) inside the pot. When the smoke rises, place the **gunpowder** (炮) inside and **fan vigorously** (大抡) with three to fifty **winnowing baskets** (扇), until the juice achieves **true death** (真死). This can then be used to nurture **male and female stone bladders** (雌雄石胆) and refine **Geng sand** (庚砂).\n\n**Male and Female (雌雄)** are prepared with **animal fat and *solanum nigrum* herb** (腆脂菜), boiled during the **three heat periods** (三伏时).\n\n**Stone Bladder (石胆)** is prepared by boiling **unpalatable *brassica* grass** (鹅不食草) for one day, then mixing with **milk** (乳) to form powder. Roll with **honey** (蜜) into pills the size of a **yellow sprout** (黄子大), and place them in the **pregnant crucible** (前匮) to nurture by fire for three **7-day cycles** (三七日), until all the substances achieve **death** (死) within the crucible.\n\nWhen combined with **gunpowder** (炮) to form the **embryo**, it is named the **Primordial Yang Crucible** (元阳匮), capable of nurturing **four Geng substances** (庚砂四药), each batch consisting of four *liang* for the crucible.\n\n**Vermilion (朱砂)** is refined with **red croton** (川红寥), boiled for seventy days. Externally, wrap it tightly in **gold foil** (金箔), then place it inside the **pregnant crucible** (前匮) to nurture by fire for seven days. Take two *qian* of **vermilion**, which can transmute **one *liang* of worldly silver** (世银) into **gold of perfect hue** (足色金).\n\n**Mother Sand of the Mandarin Duck and Dwarf Crucible (鸳鸯庚母砂法):**\nIn nurturing **Geng mother sand** (庚母砂), whether using **three 7-day cycles** (三七) or **four 6-day cycles** (四六), one must first extract the **true mercury** (真汞) from the sand and balance it with **silver mother** (银母), forming the sand.\n\nPlace it in the **empty crucible** (虚养) and nurture for one **7-day cycle** (一七日), then **press out the mercury** (逼出汞). Mix **greater celandine** (龙胆草), **wormwood** (莽草), **turmeric** (郁金), and **red pine resin** (赤松香) into powder, first spreading half over the pot’s base. Below, pour **Geng** and **mercury** (浇汞), then cover the remaining half over the head. Seal the pot’s mouth with **paper** (皮纸), gently warm with fire, and stir occasionally. After a day, take the sand and use it as a **foil** (贴身) in the crucible.",
      "overlap_context": "cycles** (三七勾之), it is even more wondrous.\n\n**Cave Method (庵法):**\nUse **equal parts of saltpeter** (牙硝), **white alunite** (白矾), **stone alunite** (石盥), and **leech powder** (鳝粉), mixing them with **brine** (盐卤) to activate and ignite them. The color will emerge.\n\nAnother method:\nUse **immortal’s grass** (仙人草), **croton seed** (巴豆), **five-fold childberry** (五倍), **stemona root** (百部), **bone supplement** (骨补), **wolfberry** (川乌), **grass wu** (草乌), **half-summer** (半夏), **south starwort** (南星).",
      "start_char": 2477,
      "end_char": 3744,
      "start_sentence": 101,
      "end_sentence": 155,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 38.531007289886475,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\金华玉液大丹.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "庚道变化 摘取牙子，依元法虚养烟气十分少，然后如常煮令坚老。 方用银室，纳芽其中，死铅作外匮，养火七七日，取芽出。 每八两加真汞二两，同乳成粉，再用庚十二两作神室，纳芽其中，用硫黄作外匮，养火七七日。 取芽乳细，再入真汞二两。 如此入金室养火，积至一斤，名日龙虎大丹。 可以作匮，养朱砂四神。 朱砂四两大光明者，先入桑汁内，煮三伏时。 次用米醋胆炮同煮，令断焰。 方用金箔颗颗包裹了，外用胆炮贴身，入前龙虎匮覆盖，养火三七日，朱砂真死作汁。 可转制三黄，作四神丹。 三黄各二两，以桑汁内，煮五伏时。 入前朱砂四两，同乳匀。 再用新庚十二两作室，纳四神於其中，外用龙虎丹作匮，入金室在内，封固，养火一月，火候四两，日足，用火三斤一缎。 寒炉取出，四神俱成紫色，住火。 每一钱乾汞一两，成上色紫磨金。 养火三月，一钱可乾汞四两。 养火一期，一钱可乾汞四十两。 或以前龙虎匮养胆矾，住火，可点世银成上等金。 胎息法 第一次，七日一浇。 丹基四两，浇真汞一两，封固，养火七日。 一二日二两，三日两半，四日二两，五六七日一两，顶二两，插七日。 又浇一两，火候同前。 如此浇三次，系二十一日。 第二次，五日一浇。 火候一日一两，二日二两，三日两半，四日二两，五日丑顶二两，插七日。 又浇一两，火候同前。 如此浇三次，系二十一日。 第三次，五日一浇。 火候】 日一两，二日二两，三日两半，四日二两，五日丑顶二两插。 如此十次。 计五十日，共前七十一日。 第四次，三日．一浇。 火候一日二两，卯酉下。 二日三两，子午下。 三日三两，寅申下。 如此浇二十次，计六十日，共前一百三十一日。 已后用一日一浇，名日朝种暮收。 火候渐加微盛。 硫黄断灵砂成金 灵草死硫黄，用金久久养过一七日，大火一鼎。 如此养七七鼎，七次遍遍换金，其硫黄金色。 每灵砂一两，用硫二钱，代赭石少许，同乳用硝盥捺头，大火一抡，可得赤金七钱重，成至宝。 盒金法 又用足色金子五钱，足色银子五钱，同镕作汁，打成片子，或成块。 却将瓦片，打如物长短大小。 先铺药厚一分； 上安物，再用药厚一分多盖面，仍用瓦盖面，四围用泥作墙，入火炉内，下用数块火，捺令平，却安瓦物上，以红火数块排盖令遍，用扇扇令瓦微红便住，扇以热灰盖，约七八个时辰，取出水洗，用剥法。 花喊一两，气胆矾一两。 先将花臧，用水半盏淘去砂脚，以小风炉，以瓦盏缓缓熬令喊，水热了，逐旋下矾，熬令乾。 取之研碎，用剥法。 盐、矾、硝、石胆、青矾、黄矾，研细，瓦器醋调如稠糊，以鸡翎刷上，火上炙，撇水中三四次。 贴身朱砂法 右用白蜜，与水锺半调开，火上瓦器，熬令交娠。 先滴点蜜在白器内，却下朱打拌，令遍体皆有蜜。 又倾过白器，软纸徐徐揩盏，看朱砂身上微遍有蜜水。 先用纸册，以熟纸一片在上，却以尖头筋逐颗劫朱，匀匀排在纸上，却以贴身药上之。 再用熟纸，再上贴身草药。 了却以手排动贴身药都匀，烘乾，以纸包候冷，便入合母作五分，下用二分，上用三分。 火候同青金法，煮朱用淮椒橘叶。 青金法 右用母五钱重，汞二钱重，入甘锅内，油盖面，缓火结砂令母，化。",
      "translated_text": "**Regulating the Dao of Geng: Transformation and Refinement**\n\nExtract the **tooth** (牙子), nurture it in **empty crucible** (虚养) with minimal smoke—**ten percent** of the original method—then cook it as usual until it solidifies and matures.\n\nUse a **silver chamber** (银室), place the **sprout** (芽) inside, and encase it with **dead lead** (死铅) as the outer crucible. Nurture with **fire for 49 days** (七七日), then remove the sprout.\n\nFor every **eight catties** of the sprout, add **two catties of true mercury** (真汞), blending them into a paste. Then use **twelve catties of Geng** (庚) as the **divine chamber** (神室), placing the sprout inside, and encase it with **sulfur** (硫黄) as the outer crucible. Nurture with **fire for 49 days** (七七日). Once the sprout is finely ground into a paste, add **two catties of true mercury** again.\n\nProceed to nurture it in a **golden chamber** (金室) with fire until it accumulates to **one catty**, naming it the **Great Elixir of Dragon and Tiger** (龙虎大丹). This can then be used as a crucible to nurture the **Four Spirits of Cinnabar** (朱砂四神).\n\nTake **four catties of the brightest cinnabar** (大光明者), first boiling it in **mulberry juice** (桑汁) for **three periods of dog days** (三伏时). Next, boil it with **vinegar and bile** (米醋胆炮) until the flame subsides. Wrap each piece in **gold foil** (金箔), then coat it with **bile** (胆炮) as a protective layer. Place it in the **Dragon-Tiger crucible** (龙虎匮), covering it, and nurture with fire for **21 days** (三七日). The cinnabar will then truly die and liquefy.\n\nThis can be transformed into the **Three Yellows** (三黄) to create the **Four Spirit Elixir** (四神丹). For each of the **Three Yellows** (二两), boil them in **mulberry juice** (桑汁) for **five periods of dog days** (五伏时). Add the **four catties of processed cinnabar**, blending them evenly into a paste.\n\nUse **twelve catties of fresh Geng** (新庚) as the chamber, placing the **Four Spirits** (四神) inside, and encase it with the **Dragon-Tiger Elixir** (龙虎丹) as the outer crucible. Place the **golden chamber** (金室) within, sealing it tightly, and nurture with fire for **one month**. The fire dosage is **four catties**, with **one catty of fuel per day**, totaling **three catties of fuel per layer** (三斤一缎). Remove from the cold furnace—all Four Spirits will turn **purple**, and the fire is extinguished.\n\nFor every **one money** of **dry mercury** (乾汞), it can refine **one catty of high-grade purple-gold powder** (上色紫磨金). Nurtured with fire for **three months**, one money can refine **four catties of mercury**. After one cycle, one money can refine **forty catties of mercury**.\n\nAlternatively, use the **Dragon-Tiger crucible** to refine **bile vitriol** (胆矾), extinguishing the fire, which can then **transmute worldly silver into superior gold**.\n\n---\n**Method of Embryonic Breathing (胎息法)**\n\n**First Cycle:** Watering every **seven days**.\n- **Base (丹基):** Four catties.\n- **First watering (一二日):** Two catties of true mercury (真汞), sealed and nurtured for **seven days**.\n- **Second watering (三日):** One and a half catties.\n- **Third watering (四日):** Two catties.\n- **Fourth watering (五六七日):** One catty, with a **peak of two catties** on the seventh day. Then water again with one catty, following the same fire regimen.\nRepeat this **three times**, totaling **21 days**.\n\n**Second Cycle:** Watering every **five days**.\n- **Fire dosage:** One catty on the first day, two catties on the second, one and a half on the third, two on the fourth, and a **peak of two catties** on the fifth day. Then water again with one catty, following the same fire regimen.\nRepeat this **three times**, totaling **21 days**.\n\n**Third Cycle:** Watering every **five days**.\n- **Fire dosage:** One catty on the first day, two on the second, one and a half on the third, two on the fourth, and a **peak of two catties** on the fifth day.\nRepeat this **ten times**, totaling **50 days**, with a cumulative **71 days** from the start.\n\n**Fourth Cycle:** Watering every **three days**.\n- **Fire dosage:** Two catties on the first day (at the **hour of Mao or You** 酉), three catties on the second (at **Zi or Wu** 子午), and three catties on the third (at **Yin or Shen** 寅申).\nRepeat this **twenty times**, totaling **60 days**, with a cumulative **131 days** from the start.\n\nAfterward, water **once per day**, known as **\"morning sowing, evening harvest\"** (朝种暮收). Gradually increase the fire dosage.\n\n---\n**Sulfur Transmuting Ling Sand into Gold (硫黄断灵砂成金)**\n\nTake **dead sulfur** (灵草死硫黄), nurture it in gold for **seven days** (一七日) with **great fire in a crucible** (大火一鼎). Repeat this **49 times** (七七鼎), changing the gold each cycle—until the sulfur turns golden.\n\nFor every **one catty of Ling sand** (灵砂), use **two money of sulfur** (硫二钱) and a **small amount of red earth** (代赭石), blending them into a paste. Apply **saltpeter wash** (硝盥) to the top, then stir with **great fire in a single motion** (大火一抡). This yields **seven money of red gold** (赤金), a **treasure supreme**.\n\n---\n**Boxed Gold Method (盒金法)**\n\nTake **five money of pure gold** (足色金子) and **five money of pure silver** (足色银子), melt them into a liquid, and shape them into **sheets or blocks**. Cut **clay tiles** (瓦片) to match the object’s length, width, and size.\n\nFirst, lay a **thick layer of medicine** (药厚一分) at the base. Place the object on top, then cover it with another **thick layer of medicine** (一分多盖面). Seal it with a **clay tile** and build a **mud wall** around the edges. Place it in a furnace, lighting **several fires beneath** to level it. Arrange **red-hot coals** on top, covering the tile completely. Fan it until the tile turns **slightly red**, then cover it with **hot ashes**. After **seven to eight hours**, remove it, wash it with water, and apply the **peeling method** (剥法).\n\n---\n**Preparation of Flower Vitriol (花喊)**\n\nTake **one catty of flower vitriol** (花臧) and **one catty of gas vitriol** (气胆矾). Rinse the flower vitriol with **half a bowl of water**, removing impurities, then slowly evaporate it in a **small wind furnace** (小风炉) using a **clay bowl** (瓦盏) until it crystallizes. Gradually add the vitriol, evaporating until dry. Grind it finely and apply the **peeling method** (剥法).\n\n---\n**Coating with Saltpeter, Vitriol, Niter, Stone Bile, Green Vitriol, and Yellow Vitriol**\n\nGrind **salt, vitriol, niter, stone bile, green vitriol, and yellow vitriol** finely. Mix them with **vinegar in a clay vessel** into a thick paste. Use a **chicken feather** to brush it on, then bake it over fire, skimming it in water **three to four times**.\n\n---\n**Method of Coating Cinnabar (贴身朱砂法)**\n\nTake **white honey** (白蜜), mixing it half with water. Simmer it in a **white vessel** (白器) over fire until it thickens. Drip a few drops of honey into the vessel, then add **cinnabar** (朱砂), stirring until the cinnabar is **completely coated**.\n\nPour the cinnabar into another **white vessel**, gently wiping it with **soft paper** until the cinnabar is **slightly moistened with honey**. Place a **sheet of prepared paper** (熟纸) on top, then use a **sharp tendon** to carefully transfer each grain of cinnabar onto the paper, arranging them evenly. Apply the **coating medicine** (贴身药) on top.\n\nCover it again with **prepared paper**, then place **coating herbs** (贴身草药) on top. Gently shake the coating medicine until evenly distributed, dry it, wrap it in paper, and let it cool. Place it in a **mother crucible** (合母) with **five parts below and three parts above**.\n\nFollow the **fire regimen of the Green Gold Method** (青金法), using **Sichuan pepper and tangerine leaves** (淮椒橘叶) to boil the cinnabar.\n\n---\n**Green Gold Method (青金法)**\n\nTake **five money of mother substance** (母) and **two money of mercury** (汞), placing them in a **sweet crucible** (甘锅), covering it with **oil**, and gently heating until the **mother solidifies and transforms**.",
      "overlap_context": "rucible** (虚养) and nurture for one **7-day cycle** (一七日), then **press out the mercury** (逼出汞). Mix **greater celandine** (龙胆草), **wormwood** (莽草), **turmeric** (郁金), and **red pine resin** (赤松香) into powder, first spreading half over the pot’s base. Below, pour **Geng** and **mercury** (浇汞), then cover the remaining half over the head. Seal the pot’s mouth with **paper** (皮纸), gently warm with fire, and stir occasionally. After a day, take the sand and use it as a **foil** (贴身) in the crucible.",
      "start_char": 3745,
      "end_char": 4996,
      "start_sentence": 156,
      "end_sentence": 218,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 21.495362997055054,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\金华玉液大丹.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "或一二钱重，却取起母，刮下汞砂，去母定有三钱半足。 却将汞砂用好纸纽过，取半两已煮汞於内，止要母半钱重，其余通留下。 四钱半重母，此母已后，再可节次煮汞二十余两，每次只是二两半为则。 却将前半两汞朱，入瓜锅物一钱半重？ 炒成青金。 次入金苗半钱重，雌妇半钱重，草伏朱砂半钱重，一处炒令交娠，通乳再炒霎时，却用篾转成，当四钱大圈子。 其药用饭饮汤洒令润，入圈内，下用皮纸，上用乳槌，捺令紧嘿乾。 却甩好山泽一两半重，搅为陆续末子，下用二停铺纸，上用三停盖面封合，约令四分高下，火。 一二三日，一两二钱火。 四五六日，一两三钱火。 七八九日，一两四钱火。 十日十一十二日，一两五钱火。 十三十四日，一两六钱火。 右足取出，就青金凿下一粒，如米大，火上吹看无焰作珠子，便离母。 将青金入合，虚养十日，又吹看无焰为度。 如有焰，再将虚养，却将此七钱已死丹头，再用元煮母汞，依前法炒一两半了，入已死丹头，通乳又炒片时，分作两饼，用山泽七两作两合。 火候一两四钱，至二两住。 十四日了取出，吹看成白银朱。 再虚养十日，却将二两已死青金，炒元煮母汞八两，依前炒了，分作五饼，作五合养。 每合用山泽六两，养火一两六钱，起至二两二钱住。 如此十四日取出，作两合，虚养半月，至此方可试药。 用足气法 记取制母方灶，元煮母汞。 灶母法 右将母纸纽令乾，入五十两甘锅内，上用纸封口，以火逼出汞。 却将母盥纸包两三层，外用黄泥球厚三四分，入缓火内煨一夜。 次日去泥，入风炉连盛烟坐锅取。 支笔涯朱砂转庚梅核 朱砂八两，以三角酸两大担，取自然汁二斗，乌梅三斤，煎汁斗余。 悬胎煮朱三伏时，取出控乾。 用石脑油或炮砂水，一表磁石末贴身，十分坚者。 然后以赤金六两，汞十两，浓煎椒汁结成砂。 以枸杞苗汁煮一日，取砂子再入，研研令润。 每朱一两，以母砂二两包之令密，置争处一夜令坚。 以代赭石八两，十分乳细，醋浸七八分满，就磁器内煮，用杖搅匀，以火蝴蝶四两，即铁花好真正胆矾二两，悬胎煮之，旋旋添热，醋煮半日。 去火蝴蝶不用，止取代赭胆矾冻乾。 用山莆一个，即养火合子，姜汁制了。 次用鸡清调墨，涂莆十余层，约米粒厚。 又用雄胆曾代四味，鸡清调涂十余层，以前石并矾入莆中作匮，次将母砂包了朱，如栽莲状，铺盖如法，封固，入灰池，养火一月，火候一至十五，十五复至一。 此应周天，百四十两火候。 俱用未济法养之。 日足取朱，剥去母砂，可见宝矣。 二转黄芽 用前见宝朱，以金星草即管仲苗浓煎汁，沐浴一时。 然后取莆子，亦用姜汁、鸡清调墨，及用阳雄胆曾代五味醋，调制莆子。 制朱於莆中，如浇淋法。 浇汞四两，子午卯酉，当存四两火养之。 亦用未济。 三日开看，切不可动，芽嫩故也。 次又浇三两，至五日或七日，又浇之。 凡三五次，浇至十二两，开合取芽，置净室中。 三转紫河车 明雄五两不损动者，以醋浓煎皂角，悬胎煮三伏时，洗净控乾，用鸡子清，调阳胆曾代涂之，石脑油炙透。 或加炮砂亦得。 以金箔包裹令密，又用鸡子清调墨，涂十余层了。 方用前芽子，入砂中真汞二两，同研为粉。",
      "translated_text": "Take **one to two money** of the mother substance, then remove and scrape off the mercury sand, leaving **three and a half money** of pure mother substance. Pass the mercury sand through fine paper, then take **half a liang** of already-boiled mercury inside, ensuring only **half a money** of mother substance remains, leaving the rest aside.\n\nWith **four and a half money** of mother substance, this mother may later be used incrementally to boil **twenty-plus liang** of mercury, each time measuring **two and a half liang** as standard.\n\nNext, take the **half-liang of mercury-cinnabar** and place it in a **gourd-shaped crucible** with **one and a half money** of [another substance?], roasting it into **Green Gold**. Then add **half a money each of gold sprouts (金苗)**, **female lead (雌妇)**, and **grass-encased cinnabar (草伏朱砂)**, roasting until they intermingle and fuse. After lactating again, roast briefly, then shape it into a **four-money circle** using a bamboo mold.\n\nMoisten the medicine with **rice-wine broth**, place it inside the circle with **parchment below** and **lactated paste above**, pressing tightly and drying. Then take **one and a half liang of good mountain saltpeter (山泽)**, grinding it into a fine, continuous powder. Spread **two parts** on the paper and cover with **three parts**, sealing it to a height of **four fen**. Apply the fire regimen:\n\n- **Days 1–3, 2–3 money** of fire.\n- **Days 4–6, 2–4 money** of fire.\n- **Days 7–9, 2–5 money** of fire.\n- **Days 10–12, 2–6 money** of fire.\n- **Days 13–14, 2–7 money** of fire.\n\nOnce complete, remove it and **chisel a grain-sized piece of Green Gold** from the mother. Blow it over fire—if it forms a bead without flame, it has separated from the mother. Place the Green Gold in a **mother crucible** for **ten days of empty cultivation (虚养)**, then blow-test again until no flame appears.\n\nIf flame remains, repeat the empty cultivation. Then take the **seven-money already-dead elixir (死丹)**, boil fresh mother-mercury as before, roast **one and a half liang** following the prior method, and mix with the dead elixir. After lactating again, roast briefly, then divide into **two cakes**, placing them in **two mother crucibles** with **seven liang of mountain saltpeter each**. Apply fire from **two and four money**, up to **two liang**, for **fourteen days**. Upon removal, blow-test—if it forms **white silver cinnabar (白银朱)**, proceed.\n\nTake the **two-liang already-dead Green Gold**, roast **eight liang of fresh mother-mercury**, and divide into **five cakes** for **five crucibles**. Each crucible uses **six liang of mountain saltpeter**, with fire from **two and six money**, up to **two and two money**, for **fourteen days**. After removal, empty-cultivate for **half a month**, then the medicine may be tested.\n\n**Method for Preparing the Mother Crucible (制母方灶) and Boiling Mother-Mercury (元煮母汞):**\nTake dried mother substance, wrap it in paper, and place it in a **fifty-liang sweet crucible**, sealing the top with paper. Heat to drive out the mercury. Then wrap the mother in **two or three layers of paper**, encase it in a **yellow clay ball three to four fen thick**, and slow-roast overnight. The next day, remove the clay, place it in a **wind furnace**, and collect the smoke-laden crucible.\n\n**Refining Cinnabar with Regal Mealy Plant (支笔涯朱砂转庚梅核):**\nTake **eight liang of cinnabar**, **three large担 of sour-sop (三角酸)**, and extract **two dou of natural juice**, along with **three jin of black plums (乌梅)**, boiling into **one dou of liquid**. Suspend and boil the cinnabar for **three periods (三伏)**, then drain and dry it. Apply **stone brain oil or pounded sand water**, and coat with **ten parts of magnetite powder (十分坚者)** as a binding agent.\n\nThen take **six liang of pure gold (赤金)** and **ten liang of mercury**, boiling with concentrated **pepper juice** until it forms sand. Cook with **goji sprout juice (枸杞苗汁)** for a day, then reboil the sand, grinding until moist. For every **one liang of cinnabar**, wrap it with **two liang of mother sand**, sealing tightly overnight to solidify.\n\nTake **eight liang of realgar (代赭石)**, grind finely, and soak in **seven to eight parts acetic acid**. Boil in a **porcelain vessel**, stirring evenly, with **four liang of firefly (火蝴蝶, iron flower)** and **two liang of genuine copper sulfate (胆矾)**. Suspend and boil, adding heat gradually, for **half a day in acetic acid**. Discard the firefly, retaining only the **realgar-copper sulfate mixture**, then dry it.\n\nTake **one gourd (山莆)**, the **cultivation-fire crucible (养火合子)**, and treat it with **ginger juice**. Then use **chicken egg white to mix ink**, coating the gourd **ten-plus layers**, about the thickness of a grain of rice. Apply **five flavors of male and female bile (雄胆曾代)**, mixed with chicken egg white and ink, coating another **ten-plus layers**. Place the **previously refined stone and copper sulfate** inside the gourd as a container, then arrange the **mother-sand-wrapped cinnabar** like planting lotus seeds, sealing it properly. Bury it in an **ash pit** for **one month of cultivation**, with fire from **one to fifteen**, then back to one—**a full cycle of 140 liang of fire**. Cultivate using the **Unfinished (未济) Method**.\n\nWhen complete, remove the cinnabar, strip away the mother sand, and reveal the treasure.\n\n**Second Transformation: Yellow Sprout (二转黄芽)**\nTake the previously refined cinnabar, bathe it in **concentrated juice of gold-star grass (金星草, 管仲苗)** for one hour. Then prepare the gourd, coating it with **ginger juice, chicken egg white, and five flavors of male bile in vinegar**, as before. Place the cinnabar inside using the **pouring method (浇淋法)**. Pour **four liang of true mercury**, cultivating at **child-midday-ox-monkey hours (子午卯酉)**, maintaining **four liang of fire**. Again use the **Unfinished Method**. Open after **three days**—do not disturb, as the sprout is tender. Pour **three more liang** on **days five or seven**, repeating until **twelve liang** are poured. Open and close to harvest the sprout, storing it in a **pure chamber**.\n\n**Third Transformation: Purple River Vehicle (三转紫河车)**\nTake **five liang of clear male essence (明雄)**, undisturbed, and boil with **concentrated soapberry (皂角)** for **three periods (三伏)**, washing and drying it. Coat with **chicken egg white and male bile**, then roast with **stone brain oil** until permeated. Alternatively, add **pounded sand**. Wrap tightly in **gold foil**, then coat with **chicken egg white and ink ten-plus layers**. Place the prior sprout inside, adding **two liang of true mercury**, grinding into powder.",
      "overlap_context": "t in paper, and let it cool. Place it in a **mother crucible** (合母) with **five parts below and three parts above**.\n\nFollow the **fire regimen of the Green Gold Method** (青金法), using **Sichuan pepper and tangerine leaves** (淮椒橘叶) to boil the cinnabar.\n\n---\n**Green Gold Method (青金法)**\n\nTake **five money of mother substance** (母) and **two money of mercury** (汞), placing them in a **sweet crucible** (甘锅), covering it with **oil**, and gently heating until the **mother solidifies and transforms**.",
      "start_char": 4996,
      "end_char": 6233,
      "start_sentence": 219,
      "end_sentence": 274,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 17.223604917526245,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\金华玉液大丹.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "用剥下母砂，添赤金五两，余同灶成汁，打作神室，如鸡子状，亦如制砂莆法制之。 方入芽子，一半在下，纳雄於中。 又用一半芽子在上，盖之。 依法铁线缠扎，用泥封固毕，以瑁璃药蘸之。 次用赤盐四两，硝二两，研细旋旋添入大甘锅中，灶成汁，倾入磁器、石器中，研细，入沙莆中，以金室内其中，封固毕，入灰池，未济火养之。 火候一日一两，至六日六两，第七日以六阳火养之。 四十九日足，取莆悬於铅中，同煎半日，然后开莆取药，合研细。 每一两分作四百丸，以楮汁蜡剂为丸。 每用梅核一个，当头成实处开一小孔。 去仁，入汞八九分，入药一丸在内，以柳木塞窍子。 次用包金土、代赭、石胆、矾、伏硝、白友津调涂纸，裹梅核四五重，盐泥固了，入甘锅中，黄泥筑实，大火缎良久通红，刺水中汞成金矣。 法泥 蚯蚓土半斤赤石脂四两黄丹二两 右用兔毫盏末二两，同捣细，用白友汁调匀，杵千万下，方用内室外合。 瑁璃药 用铅黄花半斤，加硝二两，硼二两，大抡作汁，入神室蘸之，使其封固得密。 若养糁制，必然如此，使气不出外，裹面造化自全矣。 金华玉液大丹竟",
      "translated_text": "「Take the **outer layer of the mother sand** (母砂), adding **five liang of raw cinnabar** (赤金), and process the rest as before to form a **refined elixir** (灶成汁). Mold it into a **divine chamber** (神室)—shaped like a chicken egg—following the **sand-vehicle preparation method** (制砂莆法).\n\nThen insert the **sprout** (芽子), half beneath, and place the **male essence** (雄) within. Cover with the remaining half of the sprout above. Secure it with **iron wire** as per the method, then seal firmly with mud (用泥封固毕). Apply **amberglass medicine** (瑁璃药) to coat it.\n\nNext, take **four liang of red salt** (赤盐) and **two liang of saltpeter** (硝), grind finely, and gradually add them to a **large sweet crucible** (大甘锅). Process into elixir (灶成汁) and pour into **porcelain or stone vessels** (磁器、石器). Grind again into fine powder, mix with the **sand-vehicle** (沙莆), and place inside the **golden chamber** (金室), sealing it firmly. Then immerse in **ash pit** (灰池) and nurture it with **unfinished fire** (未济火).\n\nFor **one day, one liang of fire** (火候), until **six days, six liang**. On the **seventh day**, nurture it with **six liang of yang fire** (六阳火). **Forty-nine days** suffice. Retrieve the **vehicle** (莆), suspend it in **lead**, and decoct for half a day. Then open the **vehicle** to extract the medicine, grinding it finely together.\n\nDivide each **liang into four hundred pills** (丸), using **paper pulp juice and wax** (楮汁蜡剂) to form them. For each pill, take **one plum kernel** (梅核), and pierce a small hole at the top. Remove the pit (去仁), then insert **eight or nine parts of true mercury** (真汞), along with **one pill of medicine** inside. Seal the hole with **willow wood** (柳木).\n\nNext, use **gold-wrapped earth** (包金土), **red earth** (代赭), **stone bile** (石胆), **alum** (矾), **saltpeter** (伏硝), and **white friend’s resin** (白友津) to adjust and coat paper, wrapping the plum kernel **four or five layers** thick. Seal firmly with salt mud (盐泥固了), then place in a **sweet crucible** (甘锅), packing it solid with yellow mud (黄泥筑实). Heat with a **great fire** (大火) until it glows red and the mercury within turns to gold (刺水中汞成金矣).\n\n**Method for Refining the Mud (法泥):**\nTake **half a jin of earthworm soil** (蚯蚓土), **four liang of red stone pitch** (赤石脂), and **two liang of yellow cinnabar** (黄丹). Use **two liang of rabbit hair powder** (兔毫盏末), grinding them finely together. Mix with **white friend’s resin juice** (白友汁) and pound **a million times** (杵千万下) before combining with the inner and outer chambers.\n\n**Amberglass Medicine (瑁璃药):**\nTake **half a jin of lead yellow flower** (铅黄花), adding **two liang of saltpeter** (硝) and **two liang of borax** (硼). Process vigorously into elixir (大抡作汁), applying it to the **divine chamber** (神室) to ensure a sealed, airtight closure (使其封固得密). If nurturing and refining the **vehicle** (糁), it must be done this way, so that the **qi does not escape** (气不出外), and the **transmutation of the exterior will be complete** (裹面造化自全矣).\n\nThe **Great Elixir of Golden Flower and Jade Dew** (金华玉液大丹) is finished.",
      "overlap_context": "ver Vehicle (三转紫河车)**\nTake **five liang of clear male essence (明雄)**, undisturbed, and boil with **concentrated soapberry (皂角)** for **three periods (三伏)**, washing and drying it. Coat with **chicken egg white and male bile**, then roast with **stone brain oil** until permeated. Alternatively, add **pounded sand**. Wrap tightly in **gold foil**, then coat with **chicken egg white and ink ten-plus layers**. Place the prior sprout inside, adding **two liang of true mercury**, grinding into powder.",
      "start_char": 6233,
      "end_char": 6687,
      "start_sentence": 275,
      "end_sentence": 292,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 11.826748609542847,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\金华玉液大丹.txt",
        "category": "众术类"
      }
    }
  ]
}