{
  "source_id": "金液还丹百问诀",
  "source_file": "chunked_daozang\\金液还丹百问诀.json",
  "total_chunks": 15,
  "total_original_chars": 12223,
  "total_translated_chars": 62435,
  "total_translation_time": 270.5996105670929,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\方法类\\金液还丹百问诀.txt",
    "category": "方法类"
  },
  "full_translation": "**The Golden Elixir Hundred Questions Classic: A Treatise on the Dao of Golden Elixir and Replenishing the Essence**\n\n**Title:** *The Golden Elixir Hundred Questions Classic* (经名: *Jīnyè Huándān Bǎi Wèn Jué*).\n**Also known as:** *The Sea Guest’s Discourse* (又名: *Hǎikè Lùn*).\n**Author:** Composed by **Li Guangxuan** (李光玄), a scholar of the **Bo Hai Kingdom** (渤海国) in the **Tang and Five Dynasties period** (唐末五代).\n\nGuangxuan claimed he had **traveled extensively** (进历) through **Silla** (新罗) and **Japan** (日本), seeking the **Great Medicine of Golden Elixir** (金丹大药). Later, while **dwelling in simplicity** (复朴) at **Mount Zhongyue’s Shao Shi** (中岳少室山), he encountered **Master Xuan Shou** (玄寿先生), from whom he inquired about the **Dao of Golden Elixir and Replenishing the Essence** (金液还丹之道), thus compiling this work. **One scroll** (一卷).\n\n**Source:** Extracted from the *Zhengtong Daozang* (《正统道藏》) in the **Cavern of the Perfected** (洞真部) under **Methodological Treatises** (方法类). Cross-referenced with: *The Sea Guest’s Discourse* (《海客论》).\n\n---\n\n**The Golden Elixir Hundred Questions Classic**\n\nIn days past, there was **Li Guangxuan** (昔李光玄者), a man of **Bo Hai** (渤海). **Orphaned and bereft of breath** (少孤连气), he had but a few servants (僮仆数人), yet his household amassed **wealth in pearls and gold numbering in the millions** (家积珠金巨万).\n\nAt the age when one **begins to wear the cap of adulthood** (弱冠), Guangxuan **followed his fellow villagers** (逐乡人), **traveling by boat** (舟船) between **Qing Society** (青社) and the **Huai-Zhe regions** (淮浙), **engaging in trade and commerce** (货易巡历). Later, he **crossed the sea** (却过海) and met a **Daoist recluse** (道人) aboard the same vessel. Day and night, the recluse conversed with Guangxuan, recounting his **journeys through Silla, Bo Hai, and Japan** (巡历新罗、渤海、日本诸国).\n\nGuangxuan then asked the recluse: *\"Does China lack those of noble pursuit? Why must one cross the sea to wander?\"* (中国岂无好事耶，争得过海游历).\n\nThe recluse replied: *\"In this world, I am like a **fleeting cloud** (浮云). My heart holds no other concerns, thus I traverse the sea.\"* (我於世上，喻若浮云，心无他事，是以过海).\n\nGuangxuan found this strange and **from then on, day and night, he sought to engage the recluse in discourse** (异之，因更日夜与道人攀言论). The recluse then asked Guangxuan: *\"What further **resources and possessions** (资产) does your household hold?\"* (郎君家更有何资产).\n\nGuangxuan answered: *\"I was orphaned young, with only a few brothers and servants (兄弟僮仆数人), yet my family’s fortune is immense.\"* (余少孤，兄弟僮仆数人，家财巨万).\n\nThe recluse said: *\"With such wealth at your disposal, why risk the **perils of distant seas** (远涉风波), pursuing further gain? The **vast ocean stretches endlessly** (漫漫大海), its **waves roll ceaselessly** (浩浩长波). A single moment of **shipwreck and ruin** (倾危), and the **creatures of the deep** (虫鱼) would feast upon you. What wisdom is this?\"* (既家资如此，何得远涉风波，更求其利，漫漫大海，浩浩长波，一旦倾危，虫鱼得便，此何智也).\n\nGuangxuan responded: *\"I do not risk these winds for wealth. I **ponder in darkness** (暗思) the world of men, all of which is like **dream and illusion** (梦幻). The **morning mist and dew** (朝霞晓露) fade swiftly—how could they endure? The **flicker of a stone’s spark or lightning’s flash** (石火电光) passes in an instant. So too is human life—**brief and fleeting** (瞥然则灭). It is worth contemplation.\"* (我非为财涉此风波，余暗思人世，皆如梦幻，朝霞晓露，岂可久长，石火电光，瞥然则灭。人生若此，宁可思惟。)\n\n*\"The graves of the old are still un-dried, yet new mounds rise in succession. **Gold and jade are scattered across the land** (垒金遍地), yet none of it **avails the living** (全不关身). **Piled high as the heavens** (积玉倚天), yet how could they **preserve one’s life** (留命)?\"* (旧冢未乾，新坟相次。垒金遍地，全不关身。积玉倚天，岂能留命。)\n\nThus, Guangxuan ventured across the boundless seas, entering distant lands, his intent to seek the **True Ones** (真人) and question the **accomplished sages** (达士), hoping to learn some **method** (术) that might **save life before death** (救生前).\n\nUpon arriving in those distant lands, however, he found no such encounters—no **virtuous and wise** (英哲)—and so he returned home, his sincerity unshaken, not for wealth or gain.\n\nThe Daoist said: *\"You are still young, and should cherish the glory and splendor of the world. With such brilliance, you are truly a man of great potential. Do not grieve over the **fate of immortality** (仙分)—only cultivate yourself diligently, and you shall attain the **True Way** (其真).\"*\n\nGuangxuan, hearing the Daoist’s words, bowed respectfully and replied: *\"I am but a lowly worm, how could I ever become a dragon? A caged parrot, how could I ever resemble a phoenix? I do not dare aspire to **great enlightenment** (大悟), but only hope to glimpse **some small wisdom** (小知). If the **Noble One** (高人) does not deem me too vulgar and ignorant, would you deign to offer even a little instruction? I would cherish it all my life and never betray your kindness.\"*\n\nThe Daoist asked: *\"Do you seek **longevity and life-preservation** (延年保命), or the **Golden Elixir and Great Medicine** (金丹大药)?\"*\n\nGuangxuan answered: *\"I do not dare to choose.\"*\n\n*\"But if you truly seek instruction from one who knows, I may grant it. You may serve it all your life.\"*\n\nThe Daoist continued: *\"The Golden Elixir and Great Medicine—without encountering a **Perfect Sage** (至人), one cannot master them. As for preserving life and extending years, that is the **path of knowing the principles** (轨则). If you take to it, I shall have no regrets.\"*\n\nGuangxuan replied: *\"I am young and foolish—how dare I presume to enter the **mysterious gates of the Dao** (玄妙之门)?\"*\n\nThe Daoist said: *\"The Dao resides within the body—there is no need for external pursuits. If you can **withdraw from worldly desires**, abandon **lustful attachments** (世绿), sleep on stone and rinse with spring water, embrace stillness among the pines, and **preserve your primordial qi** (元气不散), then **eternal life** (长生) may be attained.\n\nFor **primordial qi** (元气) is the **mixed essence within the body** (混元之气), the **foundation of human life** (人之根基). When the mind is still, the qi settles; when the mind wanders, the qi scatters. Thus, the **Perfect Ones** (至人) **cultivate stillness**, reject **right and wrong**, cut off **gaze and glance**, ensure their breath does not stray beyond the nostrils, and **focus their thoughts constantly on the elixir field** (丹田).\n\nIf the **Three Fields** (三田) are **nourished**, a thousand years may be preserved. Moreover, **inhale the fresh and exhale the stale**, rinse the mouth and swallow the saliva—these are all **paths to longevity**, all **methods of fortifying the body** (固身之道).\n\nAn ancient verse says:\n*'Qi is the elixir that adds years,\nEssence is the mushroom that prolongs life.\nThose who rush and hurry in the world,\nSeeking outside when they should seek within—\nThis is the way.'*\n\nIf you practice this diligently, morning and night, without tiring, you shall surely attain the **Way of Longevity and Eternal Life** (延年长生之道).\"*\n\nThe Daoist then asked Guangxuan: *\"Do you see my beard, hair, and form?\"*\n\nGuangxuan replied: *\"The Noble One’s beard and eyebrows are extraordinary—your hair is bound like a child’s, your face youthful, your lips vermilion, your teeth gleaming white.\"*\n\nThe Daoist said: *\"This is the result of practicing the Way. I have now surpassed a hundred years and know no sickness. Do you recognize me?\"*\n\nGuangxuan bowed twice in gratitude, saying: *\"A young and insignificant man like me has heard the **Great Dao** (大道). How could this not be the Noble One’s compassionate guidance, pointing out the **secret passes** (秘关)? I shall cherish this teaching all my life and revere your virtue.\"*\n\nAfter disembarking at the eastern shore, the Daoist wished to travel to **Silla** (新罗) and **Bohai**, bidding farewell to Guangxuan. Guangxuan, overcome with emotion, tearfully took leave and returned home.\n\nUpon arriving home, Guangxuan devoted himself entirely to the **Supreme Dao** (至道), disregarding worldly pleasures, and left his homeland once more to dwell in the **Cloud Islands** (云岛) for over ten years. Following the Noble One’s instructions, he **propagated the Supreme Dao** (弘持至道), and his **qi and strength multiplied a hundredfold**, his form becoming extraordinary. Thus, those who had sailed with him before began to call him the **Sea Guest** (海客).\n\nOne night, Guangxuan reflected on how worldly men sought **transcendence** (出世之门) and the **Way of Golden Elixir** (金液之道). If he remained here, he would never encounter such teachings. So he abandoned the Cloud Islands, gradually making his way back to the **Central Kingdom** (中华), touring famous mountains and the **Five Sacred Peaks** (五岳), paying homage to **sacred realms** (圣境), and earnestly seeking **accomplished sages**.\n\nFirst, he visited **Mount Tai** (泰岳), then traveled to other mountains, and in the eighth month of the **Year of the Goat** (己酉年), on the third day, he arrived at **Shaoshi Cave** (少室洞) in **Songshan** (嵩高山), staying there for over ten days. Later, he ascended southward to **Kunlun Rock Valley** (骯岩谷).\n\nAfter walking about five or six *li*, he suddenly encountered beneath a pine grove an elderly man—his form and spirit half-aged—carrying a bamboo staff with three **gourds** (瓢) hanging from its tip, dressed in coarse robes and a long headwrap, slightly different from ordinary people.\n\nThe man asked Guangxuan: *\"From where have you come?\"*\n\nGuangxuan replied: *\"I am from Bohai. I have dwelled in the Cloud Islands for many years, and now, having traveled from overseas, I seek the **famous mountains and sacred lands**. Today, I have arrived here.\"*\n\nThe man asked again: *\"Each person has their own path—why do you wander the mountains alone? What do you seek?\"*\n\nGuangxuan answered: *\"Though all have their paths, I alone have abandoned wealth and status, laughed at honor and nobility, and taken no delight in worldly splendor. I seek only the **mysterious and true Dao** (妙道至真), and thus I have come this far.\"*\n\nThe man asked again: *\"Since you began seeking the Dao, how many years have passed? How much of it have you attained?\"*\n\nGuangxuan replied: *\"Over twenty years, both within and beyond the seas, I have gone everywhere.\"*\n\nThe man asked again: *\"In these twenty years, what have you encountered?\"*\n\nGuangxuan answered: *\"In these two decades, I once met a Daoist on a ship who taught me to **nourish my essence and qi**, guide and stretch my limbs, and follow his methods to cultivate the Way.\"*\n\nThe man asked again: *\"Having attained this Dao, what more do you seek?\"*\n\nGuangxuan replied: *\"I have heard that **immortals possess the even more refined Golden Elixir Way** (金液妙道), and the **Refined Elixir reaching the Governing Vessel** (还丹至卫). I fear wasting my years, so I have searched every mountain.\"*\n\nThe man asked again: *\"In your search for the Golden Elixir Way, have you met anyone?\"*\n\nGuangxuan answered: *\"For over twenty years, I have not encountered a **true sage** (达者).\"*\n\nThe old man smiled faintly and asked again: *\"Do you recognize me now?\"*\n\nGuangxuan said: *\"I still do not recognize the Virtuous One.\"*\n\nThe old man said: *\"I am Master Xuan Shou.\"* Again, he asked Guangxuan: *\"What is your surname and given name?\"*\n\nGuangxuan replied: *\"My surname is Li, my given name is Guangxuan.\"* The old man laughed again: *\"I am called Xuan Shou, and your name is Guangxuan—our names correspond. I have found my man. As Confucius said: 'He who awakens me is Shang.'\"* Again, he spoke to Guangxuan: *\"When you seek the Golden Elixir Way, is it to uplift the world or only for yourself?\"*\n\nGuangxuan said: *\"In my search for the Golden Elixir Way, I seek first for my own body, and second to uplift those who have the potential to follow the Dao. This is not merely for myself.\"* The old man said: *\"If your sincerity is true as you say, then I may transmit it to you. If it is only for your own sake, the immortals will not permit it. I possess this Way, and you may receive it.\"* Guangxuan, upon hearing this, wept and bowed twice, saying: *\"The Immortal’s refined Way—how could it be lightly passed on? Heaven and Earth would surely protest, and the spirits would hold me accountable. I beg you to take pity on my humble life and allow me to follow you for decades, day and night in earnest devotion, so that I may eventually be granted this profound and mysterious teaching.\"*\n\nThe old man said: *\"No, if you lack virtue, even if you devoted your entire life to toil, this Way would still not be entrusted to you. I see that your immortal bones are marked, and your saintly foundation is pure and mature. Now that we have met, at this moment of our encounter, if you focus your resolve and sincerity, and listen to what I say, you shall be taught.\"*\n\nMaster Xuan Shou then set aside his bamboo staff and sat upon a stone. Before him was another stone. He said to Guangxuan: *\"Sit and listen to my supreme Way.\"*\n\nGuangxuan began: *\"Master, you bestow upon me the gate of the supreme Way—how dare I sit so casually?\"*\n\nThe old man said: *\"Sit, for the Way is profound and mysterious. Even if we exhaust all the words of this day, we may still not finish, so how could I let you stand and listen for long? Just sit and listen to what I say.\"*\n\nGuangxuan bowed twice more and knelt, then listened.\n\nThe old man said: *\"The Refined Elixir is not a separate medicine. True Oneness is the foundation, lead and mercury rely upon each other, and the Yellow Sprout is the root—only then can it be accomplished.\"*\n\nGuangxuan rose and bowed again, then asked the old man: *\"I have seen that all Daoists in the world speak of the Yellow Sprout, but I do not know its true principles. What is the Yellow Sprout, and with what medicine is it made?\"*\n\nThe old man said: *\"Lead extracted from lead is the true treasure. Mercury refined from the metallic mercury, lead and mercury forming the elixir—this is called the Yellow Sprout Child. There is an ancient song that says:*\n*'The Yellow Sprout is forged from lead and mercury,*\n*Its yin wheel holds the yang splendor.*\n*Without the Yellow Sprout’s essence,*\n*The Refined Elixir’s path is blocked.*\n*The world refines common medicines,*\n*All mistaking lead for the Yellow Flower.*\n*The Yellow Flower is lifeless,*\n*How could it reach the immortal realm?*\n*The Yellow Sprout is not in medicine,*\n*But in the inner alchemical form, its essence is taken.*\n*If you reach the Yellow Sprout’s realm,*\n*Gold and silver are but empty boasts.'*\n\n*This is what I mean.\"*\n\nGuangxuan said: *\"I have seen in *The Five Analogies of Metal and Stone* that it says: 'Lead contains great poison—how could it be used to refine the supreme medicine?' Master, you said:\"*\n\nThe old man said: *\"Lead may have poison, but this is because the world does not understand how to extract and use it. Take, for instance, the croton seed in medicines—it is not without poison. If one knows how to use it properly, it can cure countless ailments; so too with lead. In *The Er Tao Zhi Pian*, it is written:*\n*'Lead contains gold, gold contains treasure,*\n*Seeing the treasure, separate it—*\n*The wise attain the Way.*\n*Better to refine the gold within lead,*\n*Than to forge the treasure within gold.*\n*This is not the lead of the common world.*\n*The world simply uses lead directly,*\n*Hoping to obtain the Yellow Sprout,*\n*But never attaining it—*\n*They do not recognize its true nature.'*\n\nGuangxuan said: *\"Is there more than one kind of lead?\"*\n\nThe old man said: *\"Lead is not of two kinds. For example, if you nurture a child by cutting flesh from your parents’ bodies and placing it within your own womb, expecting the child to be born, it would be difficult indeed. If you separate from your parents, how could the child be born? The ancient song says:*\n*'The tripod tripod, originally without tripod,*\n*The medicine medicine, originally without medicine.*\n*Use lead, yet do not use lead,*\n*You must act within the lead itself.*\n*The Yellow Sprout is lead,*\n*Yet it is ten thousand miles from lead.*\n*The Yellow Sprout is not lead,*\n*Yet it begins with lead.*\n*Lead is the Father of the Teeth,*\n*The Teeth are the children of lead.*\n*The child conceals the mother’s womb,*\n*The mother conceals the child’s embryo.*\n*Knowing white to guard black,*\n*The divine illumination comes naturally.'*\n\n*This is what I mean.\"*\n\nEven unto the various scriptures, they praise only the efficacy of lead. To abandon its lead is like discarding one’s parents, yet still seeking the child. The ancient song says:\n*\"Do not destroy my lead,\nThat my life may remain whole.\nDo not destroy my chariot,\nThat I may return home.\nWhen lead severs the River Chariot, all actions are in vain.\nWhen lead cuts off the River Chariot, nothing succeeds.*\n\n*Again it says:*\n*The Dark Origin arises from the Golden Ancestor,\nMajestic and enduring from beginning to end.\n\n*Again it says:*\n*A single thing containing five hues,\nForever the blessing of the Immortal.*\n\n*And in the *Tao Zhi Pian* it is written:*\n*The One is the water’s number,\nThe origin of the Five Phases.\nIts hue aligns with the North’s domain,\nEncompassing the Five Phases—\nCultivate it to harmonize with the Dao,\nAnd naturally grasp the truth.\nThus it can generate Heaven and Earth,\nBecome female and male,\nThen return the solar essence to the lunar cave,\nCondense the refined essence from the void,\nAnd produce the purple qi’s essence,\nConcealed and in harmony with the True.\nNone but the divine can perceive it.\n\nThe world fails to understand its use,\nThus even a hair’s breadth error leads to a thousand miles’ loss—\nHow could it not be clear?\n\nThe ancient song says:\n*'Use lead, yet do not use lead,\nYou must act within the lead itself.*\nAt the precise moment of using lead,\nIs using lead right or wrong?\n\n*Again it says:*\n*'Use lead, yet do not use lead,\nLead is the old elixir field.*\nThis is the art of neither discarding nor employing it,\nWhereby yin and yang follow their order.\nEnlightenment brings attainment—\nIt lies within the lead itself.\nStudy it carefully.*\n\n*And in the *Yuan Yang Zi Song* it is said:*\n*The True Yin and True Yang are its Way,\nYet they stand before you—why seek afar?\nOrdinary men year after year refine the spirit elixir,\nThen suddenly see green and yellow and call it good.\nThe worthy must seek the true method,\nLest their vital essence be wasted in vain.\nBut if one obtains the True Yellow Sprout,\nThose who ingest it shall never age—\nThis is evident.*\n\n**Light Xuan said:** I have heard the world claim that cinnabar and mercury are the Yellow Sprout—what is the reasoning?\n\n**The Master replied:** These are not the words of one who grasps the Dao. Cinnabar and mercury, lacking fixed form, have no substance or shape—\nYin cannot generate, the female cannot conceive.\nAs Li Qi’an said:\n*\"Cinnabar and mercury dwell together,\nYet the two women never recognize each other.\nSelf-establishment is already unstable—\nHow could they produce the Great Elixir?\"*\n\nThe Yellow Sprout arises from the union of Kan and Li,\nWhere metal and water mutually generate,\nThe male crowned, the female veiled,\nYin and yang in perfect accord—\nFrom non-being to being, yin moves, yang responds,\nOnly then can it be formed,\nIn accordance with ultimate truth.\nThus the *Song of the True Yin Lord* says:\n*\"The true qi of the North is the River Chariot,\nBinding the solar Yang to form the golden sand.\nTwo passions nurtured in one body,\nThe Vermilion Bird refines and births the golden flower.\nWhen the golden flower blooms,\nIt is the treasure of Heaven and Earth—\nHe who understands this attains the supreme Dao.\"*\n\n**Light Xuan said:** I have also seen the world claim gold as the Yellow Sprout, silver as the Yellow Sprout, ground cinnabar and silver as the Yellow Sprout, live silver as the Yellow Sprout, or smelted, refined, and dried lead as the Yellow Sprout—even using *mita* (lead oxide) as the Yellow Sprout. What is the reasoning?\n\n**The Master replied:** These are all incorrect. All such substances are coarse and stagnant—\nRefine them, and their color fades, their form withers;\nBurn them, and they scatter as dust and ash—\nReduced to powdered bone, they yield nothing.\nThey are solitary yin or meager yang,\nStriving to rival the supreme elixir.\nIngesting them sears the five viscera,\nShortening life—\nHow could they compare to the Yellow Sprout in the Great Dao?\n\nThe Yellow Sprout is the union of lead and mercury,\nMetal and wood in parallel,\nDragon and Tiger intertwined,\nWater and fire in balance—\nEmbodying sentiment and nature,\nWith spirit following essence,\nBecoming the cause of return and rebirth,\nClarifying the principles of inhalation and exhalation,\nAchieving yin’s embrace of yang’s gestation,\nThe mother whole as the child is born—\nReceiving the essence of Heaven and Earth,\nTransmitting the Great Dao of the Primordial Void.\n\nThe ancient song says:\n*\"Metal does not reveal its body,\nWood does not display its form.\"*\n\n*Again it says:*\n*\"Cinnabar and wood’s essence,\nWhen united with metal, merge as one.\"*\n\n*Again it says:*\n*\"Conceal the body, gather the spirit to sate the Tiger’s hunger,\nThe Tiger comes to devour the living essence within.\"*\n\nThis is perfectly clear.\n\n**Light Xuan said:** Though the Yellow Sprout is said to be crafted from lead and mercury, with metal and water generating each other, my confusion remains. I humbly pray the Master clarify further.\n\nThe Master said: *\"Suppose one asks how to plant a tree. On fertile fields where fine fruits grow, first the land is plowed and tilled, then the best soil is chosen. When the season arrives, it still depends on balanced winds and rains, on the timing of the seasons urging it forward—by year’s end, the harvest is complete. The cultivation of the Yellow Sprout follows the same principle.\n\nTo combine lead and mercury, to align with the trigrams *Kǎn* and *Lǐ*, to let water and fire follow their natural course—when the time is ripe and the conditions complete, transformation unfolds without equal. Once the Yellow Sprout is formed, the Great Dao becomes effortless.\n\nThe ancient song says:\n*'Lead-mercury teeth, lead-mercury teeth,\nUniting the Three Flowers, drawing in my qi,\nForming cinnabar—first hearing the sun,\nRefining with fire, cycling through five hues,\nEntering divine brilliance, once a servant,\nNow the Dao is unerring—when the three are complete, one attains immortality.'*\n\nThis is clear.\n\nLight Xuan said: *\"Now that the Yellow Sprout is obtained, its root is understood. But how does one proceed to the Supreme Medicine? I again humbly seek the Master’s instruction.\"*\n\nThe Master said: *\"The Supreme Medicine relies solely on the Five Phases; no extraneous substances may be added. If any others are introduced, it will not be the Supreme Medicine.\n\nThe ancient song says:\n*'Seize the Eastern Green Dragon in its bound form,\nPair it with the Western White Tiger.\nThen take the Southern Vermilion Bird,\nAnd finally meet the Black Tortoise of the Void.\nWithin the void, seek the void’s path—\nDo not stray from the central way.'*\n\nThis is clear.\"*\n\nThis five is the very essence of lead and mercury—\nonly thus can the elixir be perfected.\nIf any others are introduced, it cannot be achieved.\n\nIt is like a family of parents and spouse—\nno outsiders may be admitted.\nLead and mercury, the Five Phases, are the same.\n\nWhen subdued into medicine, bones, flesh, vital essence, *qi*, and blood vessels remain intact—\nonly then may it be ingested.\n\nThe ancient song says:\n*\"Why speak of metal, wood, water, fire, and earth?\nPreserving life and guarding spirit are the Dragon and Tiger.\nThe scholar fails to recognize the Five Phases’ essence,\nforcibly claiming others as parents and spouse.\nWood governs *qi*, the Tiger rules bone,\nwater commands blood, and flesh embodies earth.\nThe Dao of immortality lies in the Hall of Separation—\nwhen the Five Phases unite, gold takes its master.\nThe Five Phases must be born of mercury’s own essence;\ndissimilar substances cannot serve as companions.\n\nAgain, the *Song of Master He Lan Seeking the Great Sage* says:\n*The Green Dragon rises, the White Tiger rests,\nthe Black Tortoise soars, the Sovereign sits still,\nwhile the Yellow Dragon coils in the central embrace.\nMother pities child, child pities mother—\nwithin the furnace, a cloud forms as one.\nIngesting it, the elixir’s efficacy knows no bounds.*\n\nThis is the truth.\n\nLight Xuan said: *\"Though the Supreme Medicine is forged by subduing Dragon and Tiger,\nand the Five Phases’ essence births the elixir,\nwhat is most critical when forming the pill for ingestion?\"*\n\nThe Master said: *\"On the day of refining, it is a single essence—\nmercury’s divine water, the womb of the elixir—\nground into violet-golden powder,\nits hue bearing five colors, manifesting the Five Phases’ embodied form.\nIt is called the Golden Liquid Reversion Elixir;\nthe divine immortals of antiquity all followed this same method.\"*\n\nThe ancient song says:\n*\"A single essence of mercury becomes the elixir of immortality,\nyet if it flows, fire’s suppression proves difficult.\nIf it meets the River Vehicle to form violet powder,\ninstantly it transforms into Golden Liquid Elixir.\nThe true method of gold elixir is not red—\nmercury alone is profound and mysterious.\nThe elixir’s efficacy is verified by the Swordsman’s test;\nthose who ingest it attain true immortality as divine immortals.\"*\n\nAnother song says:\n*\"Reverse-extracting to obtain mercury,\nthen burning it into sand.\nWithin the womb, it receives the Five Phases—\nwhen the month is complete, the Yellow Sprout appears.\nLost paths reveal nothing,\nyet across the void, the distance yawns.\nIf one reaches the River Vehicle’s domain,\nonly this is the realm of immortals.\"*\n\nThis is clear.\n\nLight and Primordial says: *\"To suppress fire with mercury—\nif it becomes the ultimate medicine,\nyet since ancient times, many have used cinnabar and mercury to suppress fire,\nso why do those who take it never extend their years?\nWhen they attempt alchemical transformation,\nit proves equally futile.\nWhat does this mean?\n\nThe Master replied:\nThese are all who fail to grasp the subtle arts of Daoist immortals,\nwho do not follow the principles of the Immortal Scriptures,\nwho do not adhere to the Five Phases in their preparation,\nand who miss the essence of solar and lunar elixirs.\nSome mix it with inferior substances,\nothers stray far from the True Principle.\nEven if they produce a thousand pounds of suppressed fire,\nit is no better than common stone or clay.\nNot only does the transformation fail,\nbut even ingestion brings untimely death and shortens life.\nThus, the *Transmission of the Sage King* states:\nIn ancient times, there were two brothers\nwho took one pound of mercury\nand refined it in the Yang Mountain Valley for three years,\nuntil it turned the color of red glass,\nclaiming it was the ultimate medicine.\nEach brother took half a pound,\nand within six months,\nthey had to wear padded garments to move,\nand even required others to support them.\nThis barely prolonged their lives,\nyet they suffered calamity to their bodies.\nWas it not because the medicinal category was wrong,\nand the methods misaligned?\nThis can be taken as proof.\nThe key lies in seeking the True Source—\nif one attains the authentic origin,\none will never fail.\"*\n\nGuangxuan asked: \"Since the yellow sprout is the foundation of the greatest medicine, formed by the Five Phases, and its source is understood, how does it transcend the mundane world? I do not yet know the precise proportions or when the refining began, yet it achieves completion. I humbly pray the Master, in his compassion, to further instruct me.\"\n\nThe Master replied: \"The proportions of the Immortal’s elixir are not arbitrary—they follow the Great Dao. The timing of the gold elixir’s refining must be precise, and it does not depend solely on the furnace’s form. Moreover, the cauldron embodies *Yin* and *Yang*. Fire must originate from *Zi* (Water) and *Li* (Fire), and one must discern the cosmic omens. Only when returning from *Li* to *Hai* (Water) does luminosity first appear—just as the child in the womb, it requires the sun’s fullness, or the chick in the egg, awaiting its time. The proportions are when *Er* (2) and *Ba* (8) unite, and the timing is when one star’s cycle brings rain, then the Dragon ascends with clouds and thunder, the Tiger roars at the cliffs—thus extending the years of all beneath heaven. This is no mere mortal concern.\n\nAn ancient verse says:\n*'Er-Ba* astonishes the maiden,\n*Shiliu* is lead’s refined essence.\nWhen *Yang* arises, fire ignites;\nwhen *Yin* is exhausted, it must cease.\nStars cycle with rain,\nand the elixir attains its spirit.\"\n\nMoreover, Tao Yuanming’s *Wang Jiangnan* poem states:\n*\"The elixir of longevity*\n*is born of the Five Phases’ work.*\n*At *Zi* and *Wu*, the gates open,*\n*and *Mao* and *You* govern the seasons.*\n*Fire unites *Yin* and *Yang*—*\n*Dragon and Tiger devour each other.*\nThis is the very meaning.\"\n\nGuangxuan said: \"Now that the Great Elixir’s methods are clear, it truly benefits all living beings. At this fortunate encounter, I have also seen various scriptures state:\n*'Day-Soul, Moon-Spirit,*\n*White Tiger, Green Dragon,*\n*Cinnabar, River-Chariot,*\n*True Lead, True Mercury—*\ntheir names are countless, confusing the mind.\nI do not know which is the true name.\nI beg the Master to clarify these doubts,\nso that future seekers may know the Dao’s path\nand escape the dusty world.\"\n\nThe Master replied: \"All these names refer to one path. *Day-Soul* is the essence of *Yang*, *Moon-Spirit* aligns with *Yin*. *Green Dragon* is Wood, never straying from its cardinal direction. *White Tiger* is Metal, dwelling in the west. *River-Chariot* is the elixir’s golden fluid—an honored name among the Immortals. *True Lead* and *True Mercury* are the titles of those who have attained the Dao. As long as one understands their transformations, why hesitate? Beyond the Five Phases, there is no other principle.\"\n\nGuangxuan asked: \"I have also seen the *Yellow Emperor’s Yin Symbol Scripture* say:\n*'A hundred methods of gold elixir exist,*\n*yet their essence lies in the *Shen Water* and *Hua Pool*.*\nI do not know what *Shen Water* and *Hua Pool* are. Beyond the *Hua Pool*, does the gold elixir succeed or fail? I beg the Master to clarify this lingering doubt.\"\n\nThe Master replied: \"Beyond the *Hua Pool*, the gold elixir fails. Even a hundred or a thousand methods are mere empty contrivances. Within the *Hua Pool*, it is most wondrous and divine. Thus, the Yellow Emperor attained transcendence through it, and Ma Ming achieved the Dao by this means. The principles of the *Hua Pool* are already detailed in the earlier chapter on the Five Phases, explained thoroughly. Therefore, the *Song of Yuan Yangzi* says:\n*'The *Shen Water* and *Hua Pool* are rare in the world,*\n*their transmission forbidden to the vulgar.*\nMany take mundane lead and mercury,\nmaking them seem alike to deceive the ignorant.'\"\n\nGuangxuan asked: \"I have also seen the scriptures say:\n*'Three-Five and One—*\n*the utmost essence of Heaven and Earth.*\nI do not know what this refers to.\"\n\n「The Master said: Earlier, I explained it thoroughly, but now you ask again about the Three-Five—it is also the proper count of the Five Phases. Moreover, it is not a separate category, nor does it originate from mundane substances. You should further investigate and seek its fundamental source, for only then will you truly grasp its essence.\n\nDo you not see the ancient song that says:\n*\"Yin Kan confuses with One,*\n*Yang Li displays Five Colors.\"*\n\nYou do not know why the Three is essential—\nit is the spirit of the Five Phases embodied.\nRefining the elixir requires mastery of the formulas,\nand the Mystic Passages are known from ancient scriptures.\nWhen the *Qiong Dan* is perfected,\nthe Celestial Chariot rides upon the Five-Colored Clouds.\n\nGuangxuan asked: *\"Among the myriad elixirs of the world,*\n*how can the Golden Liquid Returned Dan alone*\n*extend life, preserve vitality,*\n*and even grant transcendence?\"*\n\nThe Master replied: *\"Your dullness still fails to comprehend. Listen now as I elucidate.\n\nIndeed, all who inquire of the Way are born under the Five Phases,\nand even the heart, liver, spleen, lungs, and kidneys—\nhow could they abandon Yin and Yang, the Five Phases?\n\nThe Returned Dan is the refined essence of the Five Phases’ *qi*,\ncontaining the luminous spirit of all phenomena.\nIt attains the marvelous virtue of Purple Gold,\nand is renowned for its flowing elixir.\nThose who consume it will naturally fortify their limbs,\nstrengthen their organs,\nand achieve longevity by its power—\nthis is the very cause of their immortality.\nThe results are evident before our eyes.\n\nThe misguided only cling to the ancient song:\n*'Gold sand enters the Five Viscera,*\n*its mist disperses like wind and rain.*\n*Steaming and refining reach the Four Limbs,*\n*their complexion becomes radiant and fair.*\n*Withered old men regain youth,*\n*aged women become maidens once more.*\n*White hair turns black again,*\n*fallen teeth grow back anew.*\n*They are called True Persons’ Children,*\n*and escape the calamity of death.'*\nThis method may be understood.\n\nThe Stone Elixirs, too, belong to the Five Phases,\nyet they are not recorded in the Way.\nIf taken raw, they harm the body—\nlike fire suppressed, they are but worthless fragments.\nThey can only treat minor ailments.\nHow could one compare them to the Great Elixir?\nThe truth is clear, and the genuine source is not obscured.\n\nThe Herb Elixirs also change with the seasons,\nunable to withstand frost and snow.\nTheir flavors may harmonize,\nbut they only remedy wind and dampness—\nhow could they match the Great Elixir’s supreme efficacy?\n\nThe True Dao is profound and distant,\nrequiring discernment between right and wrong\nto measure its depth and shallowness.\n\nGuangxuan asked: *\"If the Great Elixir of Golden Liquid*\n*can grant longevity and even ascension,*\n*what further use does the world have for it?\"*\n\nThe Master replied: *\"The misguided do not realize*\n*that the Golden Liquid Returned Dan has its applications.\nThis elixir, when fully refined in a year,\nits ten months complete—\nopens the furnace to reveal purple dust turning gold,\nand lifts the cauldron to see yellow sprouts gleaming bright.\nIt encompasses the Five Colors,\nand gathers the hundred spirits.\nFirst, it is tested by being mixed with mercury,\nwhereupon yellow gold is instantly formed as proof.\nAfter ingestion, it eternally fortifies the sinews and bones,\nsaving lives and benefiting families—\nthis is no idle claim.\nThe ancient song says:\n*'Cinnabar, cinnabar,*\n*saves lives and benefits families.*\n*It can save my life,*\n*it can save my family.'*\nAnd Tao Yuanming’s *Viewing the Jiangnan* also states:\n*'Ten months full, the cauldron opens—one cluster of red.*\n*Fragments of jade-like frost hold Five Colors,*\n*the Spirit of the Embryo is dissolved in the Mystic Water, its chime resounding.*\n*The *qi* restores with fragrant vigor—*\n*this is the attainment of the supreme treasure.'*\n\nGuangxuan asked: *\"Apart from this elixir’s mastery over mercury,*\n*what other elixirs can subdue it*\n*and produce the supreme treasure?\"*\n\nThe Master replied: *\"Beyond the Yellow Sprout’s supreme elixir,*\n*no other preparation can truly control mercury.\"*\n\nGuangxuan asked: *\"Why cannot other elixirs subdue mercury?\"*\n\nThe Master replied: *\"Mercury is the utmost essence of Heaven and Earth,*\n*the vital spirit of the Five Metals.\nIts nature is fluid and unrestrained,\nand it cannot be tainted by impurities.\nThus, the vulgar say:\n*'Mercury is unadulterated,*\n*Asafoetida is not genuine.'*\nThis reveals the true principle—\nhence, all other substances cannot enter it.\n\nThe Yellow Sprout is indeed mercury,\nbut when it absorbs the essence of the Five Phases\nand receives the pure *Yang Qi*,\nits cycle of years and months is complete—\nits form solidifies, its spirit perfect.\nOnce mercury is subdued by it,\nwhat remains impossible?\nThe *Yin Fu Jing Commentary* states:\n*'The Flying Mouse severs the Monkey,*\n*the River Chariot subdues mercury.'*\nIf there are impurities,\nno result can be achieved.\nAnother song says:\n*'On the Riverbank, you marvel at the woman,*\n*most luminous and divine.*\n*Seeing fire, she takes flight,*\n*never staining herself with filth.*\n*Hidden by ghosts, concealed by dragons,*\n*no one knows her abode.*\n*To subdue her,*\n*the Yellow Sprout is the root.*\n*This is clear.'*\n\nGuangxuan asked: *\"Master, have you not heard of the ordinary methods?\"*\n\n*\"To point toward the profound and mysterious,*\n*the Dao of Golden Liquid is fully known,*\n*and the Gates of Dragon and Tiger are instantly awakened.*\n*Yet, for years on the seas,*\n*I only sorrowed over the ten thousand miles of waves.*\n*Today, amid the dust of the world,*\n*I suddenly glimpse the realm of the Three Pure Ones.*\n*Though I know the path to immortality,*\n*I pity the common folk.*\n*Now, I wish to further clarify,*\n*and hope the Master will guide me once more,*\n*so that all my confusion may reach the true source.\n*This is my disciple’s sincere and heartfelt wish.\"*\n\nThe Master said: *\"Your surname and given name*\n*are already inscribed on the Elixir Field.*\n*My teachings are profound and mysterious,*\n*yet none are concealed.\n*If you come to inquire,*\n*I will elucidate them plainly.\n*Do not harbor doubts,*\n*and waste your life in vain.\"*\n\n「光玄曰：我深恐世人不解铅汞之奥妙，不识五行之真谛。乃以四黄（黄金、黄铜、黄铁、黄丹）制伏水银，又使八石（八种矿石）成为至药，如炮制矾石、雄雌矾之类，无不遍寻。磁石、胆绿之辈，亦悉将入用。然而，指神符霜为黑锡，认圣无知为青盐，火锻百回，水飞千遍，忽三年守鼎，五载临炉，运火则山谷空虚，苦心则形神枯槁，终无所成，徒怨神方。今欲启问：求诸石药中，五矾之内，究竟有何至事？制得水银否？\n\n伏望先生慈悲，特为开示。\n\n先生曰：世间所问之事，乃至细微末节，未有不因其理，制伏相依，种类相取，而成事者。若穷究诸理之例，得彼类形，何事不成，何因不立？《周易》所谓“水流湿，火就燥，云从龙，风从虎”，圣人作而万物睹。此即理例相依也。若有水能与脂乳相共，相通入油，胶漆相须，雪霜同固，此则形类相取也。可不明白乎？\n\n夫水银者，乃金之魂魄，本五金之精华，与铅同根，与水共体。若以五行相孕，金水相生，得气传华，方乃得成至药。将制水银，万变千通，世无比类。故《陶植篇》云：“金为水母，母隐子胎；水为金子，子隐母胞。水者金之子，子藏母腹。”此言金水自相含孕，蕴椟于母中。因造化而生，又子继父体，为母立兆基。此言砂产于金，汞流于子，以金养汞，继体而荣，道合自然，事归于至妙，不可不思也。\n\n若用矾石之药，杂类之徒，则金体全乖，祖宗并失，还返无由而得，金水无由而生。可谓雀鸥同巢，鼠猫共穴，将胶补釜，以漆涂疮，徒然虚老百年，万无一得之也。古歌曰：\n世人好假不好真，\n竞将石药和水银。\n姥女化归烟雾散，\n曾青磁石自相亲。\n炮矾胆绿倾家产，\n多为疏狂枉作尘。\n若遇神仙谈至理，\n终知白首永无因。\n此可知也。\n\n且药石者，大约七十二件，多至一百余般。古之至人，尽辨酸咸苦涩，著其经论，或梼研使用，治世人之诸疾；或修炼合和，辟人间之邪珍，无关大事，得至长生。假饶别得玄方，穷极制度，亦是暂留髭发，岂能久固筋骸？世间迷昧之徒，嚣薄之辈，谬传方术，诬调神仙，矾石欲同铅汞，或以柳槌研合，或以桑叶相和，醋煮蜜蒸之时，不论遍数，水飞酒飞之日，动占时光。言固济则铁石非坚，说覆籍乃寻常莫匹，极至三年满足，一鼎灰尘。却云鹦犬来冲，致得龙蛇变去。殊不知己之非理，但将怨恨于真仙。如此之流，世问满目。\n\n更有用尽寰中众石，海内诸矾，铜精、铁精、石绿、土绿，罄竭资金，皆无所就。情意稍迷，心神益乱，不信仙方宁远，岂知大道无烦？谓灵丹不在此问，言至药生于海外，便向波斯国内而求白矾紫矾，或向回纥域中寻访金刚玉屑。动经多岁，惑说万途，纵饶觅得将来，亦无用处。愁发因兹变白，苦心为此归泉。如此皆为不晓药之情性，不知药之类聚。且矾共石，不与金同；水银既是金魂，石药又如何入用？夫至药者，紫金，为五彩，成身成金，可因一体，五彩恰同五脏。又见古歌曰：\n金可作，命可保；\n金不作，徒自误。\n此不虚传也。\n\n大药既成，金液变体，元是水银，何用矾石之徒？此得形类相须。前云至理人不知之，上山求鱼，入海网兔，此则倒见，可不悲哉？\n\n光玄曰：大药既是金液成形，矾石又不相入。切见世人多假五金为柜，伏制水银，亦是经岁经年，千机万巧，皆无所成，多是虚费工夫，是何理也？」\n\n「The Master says: The Five Metals (五金) are mere material substances of the mortal world, fundamentally distinct from the True Elixir (至药). The *Huang Ya Pian* (黄芽篇) has already fully expounded upon this—you must carefully examine and study it.\n\nAlchemy possesses profound and subtle Dao (道), as well as mysteries beyond measure, all of which must be orally transmitted from master to disciple before one can succeed in refining the elixir and attaining its essence. Observe how mortals blindly rely on superficial theories, rigidly adhering to ancient formulas, and recklessly manipulate mercury (水银), attempting to forge the True Elixir (至药). Yet they fail to grasp that the Five Phases (五行) interact like a woman bearing child—lead and mercury (铅汞) must complement each other, as the morning rooster nurtures its egg (若晨鸡之抱卵).\n\nThe most refined and wondrous Dao (道) is boundless in transformation, and even the slightest deviation disrupts its natural order. Hence, Tao Zhuang (陶植) of Wang Jiangnan (望江南) sings:\n*\"Still the elixir must be passed by hand,\nTrusting old formulas will only mislead.\nUpside-down, downside-up, confusion without end—\nDo not blame the Dao/Way for your own folly.\"*\n\nAnd the Bhagavān’s (菩萨) rhyme goes:\n*\"Every household has the elixir of longevity,\nYet mortals use it all with error and confusion.\nQi and climate (氣候) shift like clouds in flight—\nWhere, pray, might one find it in search?\"\n\nThey gaze yet fail to recognize it,\nScrambling instead within lead’s embrace.\nThis substance lies not in *Huang Ya* (黄芽),\nBut in wasted years and hollow toil.\n\nUpon closer reflection, this truth is indeed profound.\n\nLight Xuan (光玄) says: The Master states that the Four Yellows and Eight Stones (四黄八石) lack any principle of the Great Dao (大道), and do not harmonize with mercury (水银). Moreover, when *Long Guang Huang* (龙光黄) is refined into a liquid, and mercury is immediately congealed into sand, what is the logic behind this?\n\nThe Master replies: You do not yet understand. Listen to my detailed explanation.\n\nMercury (水银) embodies the True Yin (正阴).\nSulfur (硫黄) is but a False Yang (假阳)—when True Yin is subjected to False Yang’s influence, its form may temporarily alter, but it will never endure. If True Yang (正阳) subjugates it, and the two remain inseparable from beginning to end, this is the great principle of Yin and Yang (阴阳).\n\nMoreover, sulfur is the essence of alum (矾石), alum the vital fluid of iron (铁之津华), and magnetite (磁石) the mother of iron. When cinnabar (朱砂), magnetite, and sulfur are refined together, they instantly produce purple powder (紫粉)—this is a single process.\n\nThough sulfur, as iron’s descendant (铁之孙胤), and mercury, as gold’s refined essence (金之精魂), may briefly unite, they ultimately cannot achieve true transformation.\n\nYet if one meticulously probes the path of Dao (道), the roots and origins will become clear.\n\nLight Xuan (光玄) says: The Master’s words on alum (矾) reveal that it cannot subjugate mercury, nor does it share mercury’s nature. Yet I see that green vitriol (绿矾) and green salt (青盐) are combined to refine mercury, producing powder or frost—what is the reasoning here?\n\nThe Master replies: Mercury is the soul and spirit (魂魄) of gold (金). Green vitriol is the vital fluid of iron (铁之津华). In terms of the Five Metals (五金), their essences share a common origin, but when discussing lead and mercury (铅汞), iron and copper (铁铜) are distant relations.\n\nThus, even if green vitriol temporarily refines mercury into powder, upon further heating, it reverts to its original form—no true transformation is achieved, just as if no refinement had been done at all.\n\nLight Xuan (光玄) says: If alum behaves this way, then why does green salt (青盐) join alum in refining mercury?\n\nThe Master replies: Salt has no affinity with mercury. It merely aids in coloration when alum refines mercury—its function is no other. Just as when sulfur is sublimated (飞烧), and salt is layered upon it, the resulting product is white; without salt, the color would not be white. This is but one example.\n\nSuch matters are trifling, unrelated to the Great Elixir (大丹). You need only investigate further to forever dispel your doubts.\n\nLight Xuan (光玄) says: The Master’s teachings on the Five Phases (五行) and lead-mercury (铅汞) form the foundation of the Great Elixir (大丹). All alum and mineral medicines (矾石药) are irrelevant.\n\nUpon deep comprehension of the True Dao (至真), one attains its grand principles. Yet I also observe how mortals amass and refine human urine (童便), repeatedly distilling and decanting it, or boiling and simmering it, then extracting its frost (霜) and purifying its dregs (滓), claiming this to be the essence of the Five Phases (五行) and the root of the True Elixir (至药). Some even consume it, or further refine it into mercury sand (砂汞)—what is the logic here?\n\nThe Master replies: This is the deluded folly of the ignorant. Urine is merely the waste product of human consumption—what else could it be? If there were a Dao of longevity and fortification, then daily meals would naturally prolong life, and why bother with refining and purifying dregs?\n\nThose who practice refinement in vain believe this substance can extend life—how mistaken they are! Thus, the deluded fail to grasp the True Dao (至理). Even if they refine it, they produce nothing but powder and frost, identical to common salt (大共盐花一般). No true transformation into the Elixir is possible.\n\nInvestigate the True Dao (至理) deeply, and do not trust the common teachings. The Three Islands (三岛) are not distant, nor the Nine Heavens (九天) far away.\n\nLight Xuan (光玄) says: I also see how mortals gather mulberry twig ash (桑柴灰) for refining, claiming it to be the foundation of the True Elixir (至药), and using it to process cinnabar (朱砂), mercury (水银), and realgar (曾青). When questioned on its origin, they say they found it in the *Yin Zhen Jun Ge* (阴真君歌), which states:\n*\"The Dragon dwells in the Shock position (震位), at sixty-four (六八),\nYet forty-eight (四十八) is where it resides—this is the mulberry (桑) character.\"*\n\nThey cite the verse:\n*\"Harvest before the silkworm’s meal begins,\nRefine after the fire’s transformation.\"*\n\nAnd they say that the tortoise of Fan Cao (樊曹) and Yuan Xu (元绪) descended from the sage’s essence (降圣人之质), making it the root of the Great Elixir (大药)—nothing else.\n\nHow does this principle work? I beg the Master to clarify once more.\n\nThe Master replies: The foundation of the Great Elixir (大丹) has been fully explained in previous chapters—there is no falsehood within it. Mulberry twig ash (桑柴灰) is but another fabrication of the ignorant, a tradition passed down by fools, with no substance at all.\n\nMoreover, the *Yin Zhen Jun Ge* (阴真君歌) states:\n*\"The Dragon dwells in the Shock position (震位), at sixty-four (六八),\nThe Tiger’s number originates in the first palace (一宫).\"*\n\nForty-eight (四十八) refers to the division of the Great Elixir (大药), as well as the name of its position in the formula—it is not the mulberry (桑) character.\n\nThe common folk fail to grasp this truth, mistakenly identifying it with mere emptiness, like deer chasing sunlight or monkeys seeking reflections in water. Ultimately, what will they gain? Their efforts are but wasted labor.\n\nThe Great Elixir (大药) is purely the Five Phases (五行)—no other elements are involved. Mixing alum and minerals only leads to further confusion.»\n\n「The followers of the *Sang Zǐ* (桑紫) are clearly far astray. Hence the *Shēn Tóng Què* (参同契) says: *\"The solitary hare does not suckle the horse, nor does the swallow yield the phoenix.\"* This is what I mean.\n\n*Guāng Xuán* (光玄) remarked: *\"I also see that many people take the smoke from calcined *áo tū* (鳌突), claiming it to be the utmost essence of wood, to be paired with the Green Dragon’s position. Then they cite the *Yuán Yáng Zǐ Gē* (元阳子歌): 'To recognize cinnabar as the essence of wood, bring it to the western position to join with metal.' The confused seekers, where do they find their Dragon and Tiger? Their bewildered inquiry is lost in the void. They speak of this as if it were true.*\n\n*Guāng Xuán* further sought *Yōngzhōu* (墉州) well salt, some claiming it as the essence of *Tài Yīn* (太阴), paired as the White Tiger’s symbol. They cite the verse: *\"Deer’s strength attaches at three mouths, forty times multiplied and guarded together. The central field nurtures eleven, cross-eyed below, surveying left and right.\"* They say this is the true Dao of Dragon and Tiger. How does this logic apply to the Great Elixir? I await your instruction.\n\nThe Master replied: *\"The most true and wondrous Dao is not distant, yet people do not see it. The utter falsehoods are easy to discern, but the ignorant remain long in error. Thus, wisdom and folly oppose each other—jewel and stone are not equal. Truly lamentable, indeed worthy of pity.\"*\n\nThe Great Elixir (至药), being slippery and transformative, connects the celestial with the mundane, prolonging life and extending into immortality. Those who grasp it understand the Five Phases (五行) naturally; those who are lost remain forever suspended in confusion. Once the Golden Elixir (金丹) is perfected, poverty and illness are forever banished.\n\nAs for the smoke of calcined *áo tū* (鳌突) and its kind—these are but dead matter of the world, no different from broken tiles and rubble. Burn them, and no vital *mài* (脉) arises; refine them, and their essence is utterly consumed. What transformation could they achieve? How could they form the Great Elixir? The truth lies before us, yet people fail to see it.\n\nHence the *Yuán Yáng Zǐ Gē* (元阳子歌) states: *\"True Dragon and true Tiger are true kin.\"* The essence of wood in the western position reveals the interplay of *Yīn* and *Yáng* nurturing each other—how could it refer to those who chase smoke and emptiness? *Yuán Yáng Zǐ* (元阳子) was a master of the Dao, not an ignorant scholar; how could he mislead the dull and obtuse with his words? Their falsehoods are indeed chaotic.\n\nDragon and Tiger are the very substance of the *Huán Dān* (还丹), the core of lead and mercury. All immortals recognize this, and the scriptures do not err. Hence the *Jīn Dān Míng* (金丹铭) proclaims: *\"The true position of cinnabar is not red—it comes to the southern palace in all seasons, belonging to the southern *Yáng* (阳) *Bǐng Dīng* (丙丁) Fire. Thus its form is red. Extract the mercury from cinnabar’s water-silver, belonging to the central *Yīn* (阴) *Jiǎ Yǐ* (甲乙) Wood, and its form becomes the Green Dragon’s likeness. Black lead’s original nature is not black—it internally embraces *huái yù* (怀玉), containing the Five Virtues (五德), belonging to the northern *Yīn* (阴) *Rén Guǐ* (壬癸) Water. Its form is black. Extract the refined essence from lead’s *jīng qì* (精气), pairing it with the western *Yáng* (阳) *Gēng Xīn* (庚辛) Metal, and its form becomes white—the White Tiger’s symbol.\"*\n\nAnother verse states:\n*\"When the Five Phases (五行) do not follow their natural order, the Dragon emerges wrapped in Fire.\nWhen the Five Phases are inverted through alchemy, the Tiger arises wrapped in Water.\"*\n\nThe *Jīn Dān Zhí Fù* (金丹职赋) further declares:\n*\"Fire, when bound and rotated, becomes the Dragon; Water, when turned westward, becomes the Tiger.\"*\n\nAnd the *Lǐ Bǐng Chán Gē* (李柄蟾歌) says:\n*\"Tài Yīn* (太阴) resides in the southern palace, *Tài Yáng* (太阳) faces north. The Fire of Wood is called mercury; the Water of Metal is called lead.\nWhen refined in the central palace’s vessel, their natures assist each other’s completion.\nWhen *Yīn* departs, *Yáng* is revealed—the Dragon and Tiger serve as proof.\nThe numinous Elixir of Dragon and Tiger has its efficacy; how could the smoke-chasers or the *Xuán Jīng* (玄精) types compare to those who attain the Great Elixir?\"*\n\nReflect again and again—there is no deviation. Do not trust the ignorant; their doubts obscure the true Dao.\n\n*Guāng Xuán* (光玄) further said: *\"The Master’s teachings on the Dao of *Huán Dān* (还丹) have fully illuminated the profound. I have heard that in the past, the King of Huái Nán (淮南王) refined *Qiū Shí* (秋石) and attained the Great Elixir, ascending to the heavens after ingestion. I do not know what *Qiū Shí* (秋石) is.\"*\n\n*\"Moreover, the *Dān Jīng* (丹经) often mentions the title *Shèng Wú Zhī* (圣无知), and the world claims it refers to green salt. I do not know if this is correct. I humbly pray the Master does not conceal the profound principles.\"*\n\nThe Master replied: *\"The King of Huái Nán (淮南王), Líu Ān (刘安), refined *Qiū Shí* (秋石) to achieve the Great Elixir—there is no other Elixir. The same substance has many names. The Sage acts according to the times, just as this.\"*\n\n「Lǜ Jīn Hǔ (绿金虎) is the original essence of the Elixir, its refined white form, belonging to the Western direction, governing autumn—hence its name. It is also of the same nature as *Huáng Yá* (黄芽, \"Yellow Sprout\") and *Hé Chē* (河车, \"River Vehicle\").\n\n*The Shèng Wú Zhī* (圣无知) is likewise the core essence of the Elixir, the profound realm of lead and mercury. At the time when the Five Phases (五行) are subdued, it spontaneously generates flesh and bones; when all phenomena are encompassed, it nourishes the blood vessels entirely.\n\nThe Daoist seeks the True without knowing, the Sage contemplates it beyond reckoning—thus the name *Shèng Wú Zhī* (圣无知). It is no other path.\n\nHow could it be *qīng yán* (青盐, \"green salt\")? Such a claim is a delusion leading others astray.\n\n*Guāng Xuán* (光玄) said: *\"The Master’s teachings—when the medicine aligns with the Five Phases to form its body, encompassing all phenomena, lead and mercury interdependently, the Tiger and Dragon in mutual gestation—when ingested, it fortifies the five viscera and moistens the skin; when applied, it transmutes mercury into gold, restores poverty and benefits others. What is this principle called? It is named the Great Return-to-the-God Elixir (大还神丹).*\n\n*What kind of Immortal knows this wondrous Dao? Who first discovered this marvelous method?*\n\nThe Master replied: *\"Gold is the offspring of water, mercury its vital essence. Together, they form the root of the Five Phases, enduring countless ages yet unable to coalesce. There was *Líng Yáng Zǐ* (陵阳子), originally a true sage of the primordial era, a lofty figure of antiquity. He knew this root’s source and kept it as a secret wondrous method.\n\nThus, he paired the South with the North, the West with the East, harmonizing these four directions without deviating from the Central Dao. One year of refining fire, ten months of furnace operation, seven returns without loss, nine returns to full completion. When the Dragon ascends and its spirit returns, the Tiger submits and its essence is restored—hence the name *Zǐ Jīn* (紫金, \"Purple Gold\") for this wondrous technique, the Elixir of Seven Returns (七返神丹). This is what is meant.*\n\nAn ancient verse says:\n*九还七返三五一，龙虎相交入神室。\n灰池炎烁天地精，金液还丹功乃毕。*\n\n*Guāng Xuán* (光玄) said: *\"The Master has opened the celestial path, illuminated the profound gate, revealed the method of immortality and demonstrated the safeguard of longevity. He discerns truth from falsehood, right from wrong. Now, though I still have minor doubts, I must again seek clarification.\"*\n\nThe world sees many who seek only crude herbs,\nbinding mercury in haste—\n*\"The southern hills are not distant,\"* they say,\n*\"nor the northern wastes far from home.\"*\n\nThey scour the earth for roots and shoots,\nplucking fragrant branches in vain:\nred *qín* and *wūjū* fill their baskets,\n*zhāngliǔ* and *wǎsōng* overflow their chests.\nSome boil with sesame oil for endless hours,\nothers crush *dìdǎn* to draw its natural juice.\nThey wash *tiángōngcǎo* clean of roots,\nmix *rénxiàn* with *mǎxiàn* in equal measure,\ncombine *lóngdǎn* with *tùsī*—\nyet before the powder forms,\nthey already dream of golden elixir.\n\nSuch fools are as ants in number,\nsquandering wealth, exhausting their spirits in folly,\nyet when no result comes,\nthey rail at heaven and earth—\nunaware how to proceed.\n\nI beg the Master to clarify my confusion,\nto dispel my ignorance,\nlest I waste my life in vain.\n\nThe Master said:\n*\"Though all are human, wisdom varies as the clouds.\nSome grasp truth in their hearts unseen,\nwhile others, though it lies before them,\ncannot see it—\nlike clouds that rise to heaven\nor stones that sink to earth.\nOne cannot press clouds to stay,\nnor lift stones to fly.\nFate is set; change is impossible.*\n\n*\"Yet mercury—\nthat borrowed *yin* essence,\nthe refined *xiǎnshuǐ* of the void—\ntakes ten thousand years to form,\nits spirit bound to the five metals.\nHeavy as gold, yet pure as jade,\nuntainted by dust—\nwhy should it elude the eye?\n\n*\"But herbs?\nSpring they sprout, summer they grow,\nautumn they wither, winter they die.\nTheir stems are frail, their roots fleeting—\nboiled, they turn to sludge;\nburned, they crumble to ash.\nTo bind them with mercury?\nHeaven and earth lie between—\nfools who claim success,\ndeceiving the world with empty words.\n\n*\"Some say, *'In the north, the Three Sovereigns’ herbs grow,’*\nothers, *'In the south, Shu’s elixir thrives.’*\nAll false tales, spun from ignorance.\nPassed down through ages, twisted beyond truth.\nThe wise see clearly;\nthe foolish remain lost.\"*\n\nGuāng Xuán said:\n*\"By the Master’s words, my doubts dissolve—\nthe pine’s green now clear,\nthe jade’s form revealed.\nYet still I wonder:\nCan herbs truly bind mercury?\"*\n\nThe Master replied:\n*\"Tortoise hair grows long,\nrabbit horns are fine—\nyet both are myths.\"*\n\nGuāng Xuán said:\n*\"If herbs cannot bind mercury,\nthen those who claim to transcend the world—\nhermits who fast for years,\nadepts who refine for decades—\nwhose names are recorded in the Celestial Register,\nwhose essence does not scatter in the Three Fields—\nhow do they achieve such power?\nHow do their elixirs work?\nThis is true within, manifest without—\na complete alchemical art.\nDoes it not prolong life?\nDoes it not transcend the world?\n\n*\"Yet common folk—\nignorant of the Dao,\nunaware of true teachings—\ngreedy for gain,\nobsessed with wealth,\nthey hoard jade to extend their years,\npile gold to preserve their beauty,\nyet indulge in every pleasure,\ndress in silks, feast without end.\nTheir orifices leak,\ntheir Three Fields grow weak.\nEven the Nine-Turn Elixir would fail them.\nPity them, if pity could reach them.\n\n*\"But follow my teachings,\nand you shall grasp the Great Dao.\"*\n\nGuāng Xuán said:\n*\"The Golden Flower’s path,\nthe Mystic Water’s gate—\nthose who attain it ride white deer to Kunlun,\ndrive green oxen toward the East.\nThey endure as heaven and earth,\nwitness the rivers’ changes.\nHow fortunate to meet such truth,\nto learn from the genuine transmission!\n\n*\"The Master does not teach the ignorant,\nnor err by a hair’s breadth.\nEmperor Yán once received the True Text—\na debt of deepest gratitude.\nThe Celestial Sovereign’s birth of Xu Jié—\nanother boundless kindness.\nI am overwhelmed, speechless with awe.\n\n*\"Now I would gather herbs,\nprepare provisions,\nand refine them here in this mountain.\nBut I fear the Master’s wisdom may differ.\nI beg further instruction,\nto follow your guidance.\"*\n\nThe Master said:\n*\"This wondrous Dao is rare in the world.\nIf you truly understand,\nguard it as your life—\ndo not speak of it to the unworthy,\ndo not associate with those who do not know.\nA single careless word,\na hint to the uninitiated,\nwill bring ruin to your seven generations,\nand destroy yourself.\n\n*\"Keep this secret as you would treasure.\nThough this mountain is a famous peak,\nit lies near the capital,\nwhere war now rages—\nweapons shake the four seas,\nthe heartland is trampled.\nThis is a land of marching armies,\na refuge for the fleeing masses.\nHow could one refine the elixir here?\nHow dare one forge the divine pill?\n\n*\"Far beyond, in the lands of the *Hàoyuè*,\nor in Jiang-Zhe’s blessed regions—\nwhether at Luofu, Maoling,\nor Lushan, Tiāitái—\nthese places are now at peace,\nsanctuaries of the sages.\nChoose a hidden valley,\na sacred spot,\nand there refine the Great Medicine,\nforge the Golden Elixir.\nYou shall be free of calamity,\nand surely ascend to heaven.\n\n*\"My words are true—\nfollow them without doubt.\"*\n\nGuangxuan said: *\"A humble disciple I am—\na mortal among the myriad things beyond the Two Principles,\nmy cultivation of qi still unrefined.\nOften at the Three Fields,\nI fail to encounter the Mysterious Pearl,\nwasting countless years in vain.\nYet now, by fortune, I meet a True Sage—\nmy doubts dissolve as the Three Purity Paths open,\nthe alchemical work of the Golden Elixir fully revealed.\nYour kindness is as deep as the Bohai’s depths,\nyour favor as heavy as the mountains.\nI know not how to repay it.\n\nThe Master said: 'Your fate has brought you to me.\nI possess profound mysteries—\nall now entrusted to you.\nI see the world’s affairs in turmoil,\nmen rushing along the Way,\nunaware their bodies are but dew on a sphere,\nyet greedy for honor and wealth.\nThey fail to grasp their fleeting lives,\nonly toiling for worldly survival.\nSuch fools—how I pity them!\nYou must record what I teach,\nspread my transmission far and wide,\nuplifting those with affinity,\nguiding the multitude.\nThis is how you repay my kindness.\nI ask no more.\n\nBut you must also cultivate with single-minded devotion,\nascend swiftly to the celestial paths.\nThe sun and moon within the jar are entirely transformed,\nthe cosmos in the cave is utterly distinct—\ndo not linger long in this mortal world,\nlost in its fleeting glories.\nListen carefully, be vigilant,\nand keep away from the unworthy.\"*\n\nGuangxuan heard these words,\nhis tears flowing as he bowed twice,\nstanding aside.\n\nThe Master asked: *\"Have you ever drunk the Mysterious Wine upon the seas?\"*\nGuangxuan replied: *\"Never in my life.\"*\n\nThe Master then took a gourd from his bamboo staff\nand instructed Guangxuan to draw water from the mountain stream.\nGuangxuan descended, filled the gourd from the stone spring,\nand presented it to the Master.\nThe Master took it, poured half onto the ground,\nleaving only half.\nHe then took a single pill—\nthe size of a yellow soybean,\nglowing red and violet—\nand dropped it into the gourd.\nHe sealed it with a leaf,\nsat upon a rock,\nand after some time,\nthe gourd transformed into wine,\nits red-violet fragrance unlike any mortal brew.\nThe Master drank first,\nthen commanded Guangxuan to finish it.\nUpon drinking,\nGuangxuan felt his spirit brighten,\nhis limbs relax beyond measure,\nhis body transcending the ordinary.\n\nHe bowed in gratitude,\nthen stood.\n\nThe Master said: *\"The hour grows late.\nReturn to your lodging.\nI am weary and will go to the rear mountain—\na grass hut near the southern peak,\nby the water’s edge.\nCome visit if you have time.\"*\n\nGuangxuan said: *\"If I have no other business,\nmay I escort you to your dwelling?\"*\n\nThe Master replied: *\"I am exhausted,\nand you must be weary as well.\nGo now and return tomorrow to seek me out.\"*\n\nWith that, he took his bamboo staff\nand vanished southward,\nhis steps swift as flying clouds.\nThough a path existed,\nthe Master seemed to traverse it like a cloud crossing a ridge—\ngone in an instant.\nGuangxuan gazed after him in longing,\nthen returned to the mountain temple,\nsleepless through the night.\n\nAt dawn’s first light,\nhe sought the way once more,\nbut found no trace—\nno path led south,\npine moss blotted out the sun,\nthe stream’s murmur mingled with the mournful cries of monkeys,\nwhite clouds drifted with the crows,\nand not a soul was seen.\nOnly the southern peak loomed empty before him.\n\nGuangxuan knew the Master was no ordinary man,\nnor of this mundane world.\nHe sighed repeatedly,\nhis sorrow beyond words.\nHe then returned to his lodging,\nrecorded the Master’s secret teachings,\nand spread them among the world,\nhoping those of like mind might ponder them deeply.\n\nThus ends the *Hundred Questions on Golden Elixir Alchemy*.\n*(Note: The original text had \"见\" [seen], corrected here to \"问\" [world/people] based on the *Sea Guest Treatise*.)*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "金液还丹百问诀 经名：金液还丹百问诀。 又名《海客论》。 唐末五代渤海国人李光玄撰。 光玄自称曾进历新罗、日本诸国、访求金丹大药。 复朴中岳少室山遇玄寿先生，请问金液还丹之道，而撰成此书。 一卷。 底本出处：《正统道藏》洞真部方法类。 参校：《海客论》。 金液还丹百问诀 昔李光玄者，渤海人也。 少孤连气，僮仆数人，家积珠金巨万。 光玄年方弱冠，乃逐乡人，舟船往来於青社、淮浙之问，货易巡历。 后却过海，遇一道人，同在舟中，朝夕与光玄言话，巡历新罗、渤海、日本诸国。 光玄因谓道人日； 中国岂无好事耶，争得过海游历。 道人曰：我於世上，喻若浮云，心无他事，是以过海。 光玄异之，因更日夜与道人攀言论。 道人乃谓光玄曰：郎君家更有何资产。 光玄曰：余少孤，兄弟僮仆数人，家财巨万。 道人曰：既家资如此，何得远涉风波，更求其利，漫漫大海，浩浩长波，一旦倾危，虫鱼得便，此何智也。 光玄答曰：我非为财涉此风波，余暗思人世，皆如梦幻，朝霞晓露，岂可久长，石火电光，瞥然则灭。 人生若此，宁可思惟。 旧冢未乾，新坟相次。 垒金遍地，全不关身。 积玉倚天，岂能留命。",
      "translated_text": "**The Golden Elixir Hundred Questions Classic: A Treatise on the Dao of Golden Elixir and Replenishing the Essence**\n\n**Title:** *The Golden Elixir Hundred Questions Classic* (经名: *Jīnyè Huándān Bǎi Wèn Jué*).\n**Also known as:** *The Sea Guest’s Discourse* (又名: *Hǎikè Lùn*).\n**Author:** Composed by **Li Guangxuan** (李光玄), a scholar of the **Bo Hai Kingdom** (渤海国) in the **Tang and Five Dynasties period** (唐末五代).\n\nGuangxuan claimed he had **traveled extensively** (进历) through **Silla** (新罗) and **Japan** (日本), seeking the **Great Medicine of Golden Elixir** (金丹大药). Later, while **dwelling in simplicity** (复朴) at **Mount Zhongyue’s Shao Shi** (中岳少室山), he encountered **Master Xuan Shou** (玄寿先生), from whom he inquired about the **Dao of Golden Elixir and Replenishing the Essence** (金液还丹之道), thus compiling this work. **One scroll** (一卷).\n\n**Source:** Extracted from the *Zhengtong Daozang* (《正统道藏》) in the **Cavern of the Perfected** (洞真部) under **Methodological Treatises** (方法类). Cross-referenced with: *The Sea Guest’s Discourse* (《海客论》).\n\n---\n\n**The Golden Elixir Hundred Questions Classic**\n\nIn days past, there was **Li Guangxuan** (昔李光玄者), a man of **Bo Hai** (渤海). **Orphaned and bereft of breath** (少孤连气), he had but a few servants (僮仆数人), yet his household amassed **wealth in pearls and gold numbering in the millions** (家积珠金巨万).\n\nAt the age when one **begins to wear the cap of adulthood** (弱冠), Guangxuan **followed his fellow villagers** (逐乡人), **traveling by boat** (舟船) between **Qing Society** (青社) and the **Huai-Zhe regions** (淮浙), **engaging in trade and commerce** (货易巡历). Later, he **crossed the sea** (却过海) and met a **Daoist recluse** (道人) aboard the same vessel. Day and night, the recluse conversed with Guangxuan, recounting his **journeys through Silla, Bo Hai, and Japan** (巡历新罗、渤海、日本诸国).\n\nGuangxuan then asked the recluse: *\"Does China lack those of noble pursuit? Why must one cross the sea to wander?\"* (中国岂无好事耶，争得过海游历).\n\nThe recluse replied: *\"In this world, I am like a **fleeting cloud** (浮云). My heart holds no other concerns, thus I traverse the sea.\"* (我於世上，喻若浮云，心无他事，是以过海).\n\nGuangxuan found this strange and **from then on, day and night, he sought to engage the recluse in discourse** (异之，因更日夜与道人攀言论). The recluse then asked Guangxuan: *\"What further **resources and possessions** (资产) does your household hold?\"* (郎君家更有何资产).\n\nGuangxuan answered: *\"I was orphaned young, with only a few brothers and servants (兄弟僮仆数人), yet my family’s fortune is immense.\"* (余少孤，兄弟僮仆数人，家财巨万).\n\nThe recluse said: *\"With such wealth at your disposal, why risk the **perils of distant seas** (远涉风波), pursuing further gain? The **vast ocean stretches endlessly** (漫漫大海), its **waves roll ceaselessly** (浩浩长波). A single moment of **shipwreck and ruin** (倾危), and the **creatures of the deep** (虫鱼) would feast upon you. What wisdom is this?\"* (既家资如此，何得远涉风波，更求其利，漫漫大海，浩浩长波，一旦倾危，虫鱼得便，此何智也).\n\nGuangxuan responded: *\"I do not risk these winds for wealth. I **ponder in darkness** (暗思) the world of men, all of which is like **dream and illusion** (梦幻). The **morning mist and dew** (朝霞晓露) fade swiftly—how could they endure? The **flicker of a stone’s spark or lightning’s flash** (石火电光) passes in an instant. So too is human life—**brief and fleeting** (瞥然则灭). It is worth contemplation.\"* (我非为财涉此风波，余暗思人世，皆如梦幻，朝霞晓露，岂可久长，石火电光，瞥然则灭。人生若此，宁可思惟。)\n\n*\"The graves of the old are still un-dried, yet new mounds rise in succession. **Gold and jade are scattered across the land** (垒金遍地), yet none of it **avails the living** (全不关身). **Piled high as the heavens** (积玉倚天), yet how could they **preserve one’s life** (留命)?\"* (旧冢未乾，新坟相次。垒金遍地，全不关身。积玉倚天，岂能留命。)",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 479,
      "start_sentence": 0,
      "end_sentence": 25,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 15.514794111251831,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\金液还丹百问诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "所以经涉海浪，直入外方，意在寻访真人，问求达士，欲有何术，可救生前。 及到外方，又无所遇，不逢英哲，遂且归乡，诚意如斯，非为财货。 道人曰：君方年少，只合爱恋荣华，如此聪明，深为大器矣。 莫愁仙分，只要自修，必得其真耳。 光玄闻道人所说，启而言曰：光玄蚯蚓之质，岂有成龙； 斥鹦之形，争能似凤，非敢望於大悟，只希睹於小知。 傥高人不以余凡愚，少垂诲示，终身佩荷，岂敢负恩。 道人曰：尔求延年保命耶，求金丹大药耶。 光玄答曰：非敢拣择。 但高人知者，可望垂诲，终身奉持。 道人乃曰：金丹大药，未遇至人，保命延年，即知轨则。 君若好之，吾无悟矣。 光玄答曰：余少愚昧，何敢胜当玄妙之门。 道人曰：夫道在身，更无外事，尔能远离房室，屏弃世绿，枕石漱泉，松烦就静，元气不散，可至长生。 夫元气者，是身中混元之气，是人之根基。 念住则气停，神行则气散。 是以至人住息，屏是非，绝顾盼，喘息不游於鼻外，存思常注於丹田。 若三田得实，千年可保。 更或纳新吐故，漱液咽津，悉是延年之门，皆为固身之道。 古歌曰：气是添年药，精为续命芝。 世上馒忙并馒走，不能求己更求谁。 此之谓也。 但能旦夕不倦，依而行之，必获延年长生之道也。 复问光玄曰：见吾髭发仪形否。 光玄曰：高人髭鬓有异，钳发童颜，朱唇皓齿。 道人曰：行此道遂得如斯，余今已逾百岁，不识疾病。 汝岂知我乎。 光玄再拜谢曰：少年小子，获闻大道。 岂非高人垂念，指示秘关，终身保持，佩服恩德。 后至东岸下船，道人自欲游新罗、渤海，告别光玄。 光玄乃涕泗交并，奉辞道人，归还故里。 光玄达家之后，一心奉其至道，不顾繁华，遂却离乡，重游沧海，驻居云岛之中，十有余年。 依高人之指的，弘持至道。 乃得气力百倍，仪形异常。 因被往日同船之人，号光玄为海客。 光玄忽於一日夜中，思惟世上人问，更有出世之门，金液之道。 若只住居此处，无由得逢。 遂便抛离云岛，渐届中华，巡历名山，寻游五岳，瞻礼圣境，恳志访寻，专求达士。 乃初游泰岳，次历诸山，后於己酉年中八月三日，因至中岳嵩高山少室洞岩僧寺之中，止泊十余日。 后即缓步南登，看骯岩谷。 行可五六里问，忽於路侧松林之下，遇一人形神半老，手中携一竹杖，杖头悬挂三瓢，短褐长巾，於人稍异。 乃问光玄曰：尔从何方而来至此。 光玄曰：家住渤海人也。 驻居云岛，颇历岁年，近自海外而来，寻游名山胜境，今日方到此地。 又问光玄曰：人生各有途辙，尔独游名山，访何事也。 光玄曰：人生虽有途辙，唯余弃辞财产，每笑荣贵，不恋繁华，唯求妙道至真，乃至於此。 又问光玄曰：求道已来，还得几年，得道多少也。 光玄答曰：二十余年，海内海外，无所不到。 又问光玄曰：二十年中，有何所遇。 光玄答曰：二纪年中，曾於船中遇一道人，令光玄保养精气，导引四肢，依而行之，以成其道。 又问光玄曰：既得此道，更欲何求。 光玄答曰：窃闻神仙更有金液妙道，还丹至卫，虑恐虚度年华，是以遍寻山岳。 又问光玄曰：所求金液之道，曾遇人否。 光玄答曰：访求二十余年，不逢达者。 老人乃微笑，再问光玄曰：识吾已否。",
      "translated_text": "Thus, Guangxuan ventured across the boundless seas, entering distant lands, his intent to seek the **True Ones** (真人) and question the **accomplished sages** (达士), hoping to learn some **method** (术) that might **save life before death** (救生前).\n\nUpon arriving in those distant lands, however, he found no such encounters—no **virtuous and wise** (英哲)—and so he returned home, his sincerity unshaken, not for wealth or gain.\n\nThe Daoist said: *\"You are still young, and should cherish the glory and splendor of the world. With such brilliance, you are truly a man of great potential. Do not grieve over the **fate of immortality** (仙分)—only cultivate yourself diligently, and you shall attain the **True Way** (其真).\"*\n\nGuangxuan, hearing the Daoist’s words, bowed respectfully and replied: *\"I am but a lowly worm, how could I ever become a dragon? A caged parrot, how could I ever resemble a phoenix? I do not dare aspire to **great enlightenment** (大悟), but only hope to glimpse **some small wisdom** (小知). If the **Noble One** (高人) does not deem me too vulgar and ignorant, would you deign to offer even a little instruction? I would cherish it all my life and never betray your kindness.\"*\n\nThe Daoist asked: *\"Do you seek **longevity and life-preservation** (延年保命), or the **Golden Elixir and Great Medicine** (金丹大药)?\"*\n\nGuangxuan answered: *\"I do not dare to choose.\"*\n\n*\"But if you truly seek instruction from one who knows, I may grant it. You may serve it all your life.\"*\n\nThe Daoist continued: *\"The Golden Elixir and Great Medicine—without encountering a **Perfect Sage** (至人), one cannot master them. As for preserving life and extending years, that is the **path of knowing the principles** (轨则). If you take to it, I shall have no regrets.\"*\n\nGuangxuan replied: *\"I am young and foolish—how dare I presume to enter the **mysterious gates of the Dao** (玄妙之门)?\"*\n\nThe Daoist said: *\"The Dao resides within the body—there is no need for external pursuits. If you can **withdraw from worldly desires**, abandon **lustful attachments** (世绿), sleep on stone and rinse with spring water, embrace stillness among the pines, and **preserve your primordial qi** (元气不散), then **eternal life** (长生) may be attained.\n\nFor **primordial qi** (元气) is the **mixed essence within the body** (混元之气), the **foundation of human life** (人之根基). When the mind is still, the qi settles; when the mind wanders, the qi scatters. Thus, the **Perfect Ones** (至人) **cultivate stillness**, reject **right and wrong**, cut off **gaze and glance**, ensure their breath does not stray beyond the nostrils, and **focus their thoughts constantly on the elixir field** (丹田).\n\nIf the **Three Fields** (三田) are **nourished**, a thousand years may be preserved. Moreover, **inhale the fresh and exhale the stale**, rinse the mouth and swallow the saliva—these are all **paths to longevity**, all **methods of fortifying the body** (固身之道).\n\nAn ancient verse says:\n*'Qi is the elixir that adds years,\nEssence is the mushroom that prolongs life.\nThose who rush and hurry in the world,\nSeeking outside when they should seek within—\nThis is the way.'*\n\nIf you practice this diligently, morning and night, without tiring, you shall surely attain the **Way of Longevity and Eternal Life** (延年长生之道).\"*\n\nThe Daoist then asked Guangxuan: *\"Do you see my beard, hair, and form?\"*\n\nGuangxuan replied: *\"The Noble One’s beard and eyebrows are extraordinary—your hair is bound like a child’s, your face youthful, your lips vermilion, your teeth gleaming white.\"*\n\nThe Daoist said: *\"This is the result of practicing the Way. I have now surpassed a hundred years and know no sickness. Do you recognize me?\"*\n\nGuangxuan bowed twice in gratitude, saying: *\"A young and insignificant man like me has heard the **Great Dao** (大道). How could this not be the Noble One’s compassionate guidance, pointing out the **secret passes** (秘关)? I shall cherish this teaching all my life and revere your virtue.\"*\n\nAfter disembarking at the eastern shore, the Daoist wished to travel to **Silla** (新罗) and **Bohai**, bidding farewell to Guangxuan. Guangxuan, overcome with emotion, tearfully took leave and returned home.\n\nUpon arriving home, Guangxuan devoted himself entirely to the **Supreme Dao** (至道), disregarding worldly pleasures, and left his homeland once more to dwell in the **Cloud Islands** (云岛) for over ten years. Following the Noble One’s instructions, he **propagated the Supreme Dao** (弘持至道), and his **qi and strength multiplied a hundredfold**, his form becoming extraordinary. Thus, those who had sailed with him before began to call him the **Sea Guest** (海客).\n\nOne night, Guangxuan reflected on how worldly men sought **transcendence** (出世之门) and the **Way of Golden Elixir** (金液之道). If he remained here, he would never encounter such teachings. So he abandoned the Cloud Islands, gradually making his way back to the **Central Kingdom** (中华), touring famous mountains and the **Five Sacred Peaks** (五岳), paying homage to **sacred realms** (圣境), and earnestly seeking **accomplished sages**.\n\nFirst, he visited **Mount Tai** (泰岳), then traveled to other mountains, and in the eighth month of the **Year of the Goat** (己酉年), on the third day, he arrived at **Shaoshi Cave** (少室洞) in **Songshan** (嵩高山), staying there for over ten days. Later, he ascended southward to **Kunlun Rock Valley** (骯岩谷).\n\nAfter walking about five or six *li*, he suddenly encountered beneath a pine grove an elderly man—his form and spirit half-aged—carrying a bamboo staff with three **gourds** (瓢) hanging from its tip, dressed in coarse robes and a long headwrap, slightly different from ordinary people.\n\nThe man asked Guangxuan: *\"From where have you come?\"*\n\nGuangxuan replied: *\"I am from Bohai. I have dwelled in the Cloud Islands for many years, and now, having traveled from overseas, I seek the **famous mountains and sacred lands**. Today, I have arrived here.\"*\n\nThe man asked again: *\"Each person has their own path—why do you wander the mountains alone? What do you seek?\"*\n\nGuangxuan answered: *\"Though all have their paths, I alone have abandoned wealth and status, laughed at honor and nobility, and taken no delight in worldly splendor. I seek only the **mysterious and true Dao** (妙道至真), and thus I have come this far.\"*\n\nThe man asked again: *\"Since you began seeking the Dao, how many years have passed? How much of it have you attained?\"*\n\nGuangxuan replied: *\"Over twenty years, both within and beyond the seas, I have gone everywhere.\"*\n\nThe man asked again: *\"In these twenty years, what have you encountered?\"*\n\nGuangxuan answered: *\"In these two decades, I once met a Daoist on a ship who taught me to **nourish my essence and qi**, guide and stretch my limbs, and follow his methods to cultivate the Way.\"*\n\nThe man asked again: *\"Having attained this Dao, what more do you seek?\"*\n\nGuangxuan replied: *\"I have heard that **immortals possess the even more refined Golden Elixir Way** (金液妙道), and the **Refined Elixir reaching the Governing Vessel** (还丹至卫). I fear wasting my years, so I have searched every mountain.\"*\n\nThe man asked again: *\"In your search for the Golden Elixir Way, have you met anyone?\"*\n\nGuangxuan answered: *\"For over twenty years, I have not encountered a **true sage** (达者).\"*\n\nThe old man smiled faintly and asked again: *\"Do you recognize me now?\"*",
      "overlap_context": "one’s spark or lightning’s flash** (石火电光) passes in an instant. So too is human life—**brief and fleeting** (瞥然则灭). It is worth contemplation.\"* (我非为财涉此风波，余暗思人世，皆如梦幻，朝霞晓露，岂可久长，石火电光，瞥然则灭。人生若此，宁可思惟。)\n\n*\"The graves of the old are still un-dried, yet new mounds rise in succession. **Gold and jade are scattered across the land** (垒金遍地), yet none of it **avails the living** (全不关身). **Piled high as the heavens** (积玉倚天), yet how could they **preserve one’s life** (留命)?\"* (旧冢未乾，新坟相次。垒金遍地，全不关身。积玉倚天，岂能留命。)",
      "start_char": 479,
      "end_char": 1767,
      "start_sentence": 26,
      "end_sentence": 80,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 23.298413038253784,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\金液还丹百问诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "光玄曰：未识仁者。 老人曰：我是玄寿先生。 又问光玄曰：尔何姓何名。 光玄答曰：姓李，名光玄。 老人又笑曰：我号玄寿，尔名光玄，与吾相符。 我知人矣。 仲尼所谓起予者商也。 又语光玄曰：尔求金液之道，为当提拔世人，为当只为自己。 光玄曰：访寻金液之道，一为己身，二为提拔世途有分之者，便即相镌，非直为己。 老人曰：子诚意如此，即可相传。 若为一身，神仙非许。 我有此道，汝可受之。 光玄既闻涕泣，再拜云：神仙妙道，岂可轻传，天地必啧，鬼神必责，愿将微命，参从先生数十年问，辛勤日夜，然后愿垂悯念，赐乃幽玄。 老人曰：不然，子若不仁，假使一生辛勤，此道亦不可付。 吾见子仙骨有彰，圣基纯熟，今相遇我，与尔际会之时，但专志诚，听吾所说。 先生乃旋放竹杖在於一边，坐於石上，前面更有一石。 乃语光玄曰：子坐，听吾至道。 光玄启言曰：先生奉传至道之门，光玄争敢辄坐。 先生曰：子但坐，绿至道玄远，尽此一日言论，犹恐未终，岂可令子久立听之。 但坐，听吾所说。 光玄再拜跪，而听之。 先生日； 夫还丹者，且非别药。 真一为基，铅汞相依，黄芽是本，乃可成也。 光玄起再拜，而问先生曰：以见世上道人，皆说黄芽，未知至理。 黄芽者将何物之所为，以何药而制造。 先生曰：铅出铅中，方为至宝。 汞传金汞，铅汞造气，乃号黄芽子。 不见古歌曰：黄芽铅汞造，阴毂含阳华。 不得黄芽理，还丹应路赊。 世人炼凡药，尽认铅黄花。 黄花是死物，那得到仙家。 黄芽非在药，内象取精华。 若到黄芽地，金银徒尔夸。 此之谓也。 光玄曰：窃见《 金石五相类》 中云：铅有大毒，争堪成就至药。 先生曰：铅虽有毒，盖为世人不解取用之。 如药中巴豆之类，非无毒也。 若解使用，即理万病，铅亦是也。 《 陶植篇》 云：铅中有金，金中有宝，见宝别宝，贤人得道。 宁修铅中金，不炼金中宝。 此非世问之铅也。 世人直下用铅，希求黄芽，万无得一，盖不识其铅也。 光玄曰：铅有二耶。 先生曰：铅非有二。 譬如养子，若割父母身上之肉，内於母腹之中，而望孩子生，孩子生应难也。 若离父母，孩子自何而生。 古歌曰：鼎鼎元无鼎，药药元无药。 用铅不用铅，须向铅中作。 黄芽是铅，去铅万里。 黄芽非铅，从铅而始。 铅为牙父，牙是铅子。 子隐母胞，母隐子胎。 知白守黑，神明自来。 此之谓也。",
      "translated_text": "Guangxuan said: *\"I still do not recognize the Virtuous One.\"*\n\nThe old man said: *\"I am Master Xuan Shou.\"* Again, he asked Guangxuan: *\"What is your surname and given name?\"*\n\nGuangxuan replied: *\"My surname is Li, my given name is Guangxuan.\"* The old man laughed again: *\"I am called Xuan Shou, and your name is Guangxuan—our names correspond. I have found my man. As Confucius said: 'He who awakens me is Shang.'\"* Again, he spoke to Guangxuan: *\"When you seek the Golden Elixir Way, is it to uplift the world or only for yourself?\"*\n\nGuangxuan said: *\"In my search for the Golden Elixir Way, I seek first for my own body, and second to uplift those who have the potential to follow the Dao. This is not merely for myself.\"* The old man said: *\"If your sincerity is true as you say, then I may transmit it to you. If it is only for your own sake, the immortals will not permit it. I possess this Way, and you may receive it.\"* Guangxuan, upon hearing this, wept and bowed twice, saying: *\"The Immortal’s refined Way—how could it be lightly passed on? Heaven and Earth would surely protest, and the spirits would hold me accountable. I beg you to take pity on my humble life and allow me to follow you for decades, day and night in earnest devotion, so that I may eventually be granted this profound and mysterious teaching.\"*\n\nThe old man said: *\"No, if you lack virtue, even if you devoted your entire life to toil, this Way would still not be entrusted to you. I see that your immortal bones are marked, and your saintly foundation is pure and mature. Now that we have met, at this moment of our encounter, if you focus your resolve and sincerity, and listen to what I say, you shall be taught.\"*\n\nMaster Xuan Shou then set aside his bamboo staff and sat upon a stone. Before him was another stone. He said to Guangxuan: *\"Sit and listen to my supreme Way.\"*\n\nGuangxuan began: *\"Master, you bestow upon me the gate of the supreme Way—how dare I sit so casually?\"*\n\nThe old man said: *\"Sit, for the Way is profound and mysterious. Even if we exhaust all the words of this day, we may still not finish, so how could I let you stand and listen for long? Just sit and listen to what I say.\"*\n\nGuangxuan bowed twice more and knelt, then listened.\n\nThe old man said: *\"The Refined Elixir is not a separate medicine. True Oneness is the foundation, lead and mercury rely upon each other, and the Yellow Sprout is the root—only then can it be accomplished.\"*\n\nGuangxuan rose and bowed again, then asked the old man: *\"I have seen that all Daoists in the world speak of the Yellow Sprout, but I do not know its true principles. What is the Yellow Sprout, and with what medicine is it made?\"*\n\nThe old man said: *\"Lead extracted from lead is the true treasure. Mercury refined from the metallic mercury, lead and mercury forming the elixir—this is called the Yellow Sprout Child. There is an ancient song that says:*\n*'The Yellow Sprout is forged from lead and mercury,*\n*Its yin wheel holds the yang splendor.*\n*Without the Yellow Sprout’s essence,*\n*The Refined Elixir’s path is blocked.*\n*The world refines common medicines,*\n*All mistaking lead for the Yellow Flower.*\n*The Yellow Flower is lifeless,*\n*How could it reach the immortal realm?*\n*The Yellow Sprout is not in medicine,*\n*But in the inner alchemical form, its essence is taken.*\n*If you reach the Yellow Sprout’s realm,*\n*Gold and silver are but empty boasts.'*\n\n*This is what I mean.\"*\n\nGuangxuan said: *\"I have seen in *The Five Analogies of Metal and Stone* that it says: 'Lead contains great poison—how could it be used to refine the supreme medicine?' Master, you said:\"*\n\nThe old man said: *\"Lead may have poison, but this is because the world does not understand how to extract and use it. Take, for instance, the croton seed in medicines—it is not without poison. If one knows how to use it properly, it can cure countless ailments; so too with lead. In *The Er Tao Zhi Pian*, it is written:*\n*'Lead contains gold, gold contains treasure,*\n*Seeing the treasure, separate it—*\n*The wise attain the Way.*\n*Better to refine the gold within lead,*\n*Than to forge the treasure within gold.*\n*This is not the lead of the common world.*\n*The world simply uses lead directly,*\n*Hoping to obtain the Yellow Sprout,*\n*But never attaining it—*\n*They do not recognize its true nature.'*\n\nGuangxuan said: *\"Is there more than one kind of lead?\"*\n\nThe old man said: *\"Lead is not of two kinds. For example, if you nurture a child by cutting flesh from your parents’ bodies and placing it within your own womb, expecting the child to be born, it would be difficult indeed. If you separate from your parents, how could the child be born? The ancient song says:*\n*'The tripod tripod, originally without tripod,*\n*The medicine medicine, originally without medicine.*\n*Use lead, yet do not use lead,*\n*You must act within the lead itself.*\n*The Yellow Sprout is lead,*\n*Yet it is ten thousand miles from lead.*\n*The Yellow Sprout is not lead,*\n*Yet it begins with lead.*\n*Lead is the Father of the Teeth,*\n*The Teeth are the children of lead.*\n*The child conceals the mother’s womb,*\n*The mother conceals the child’s embryo.*\n*Knowing white to guard black,*\n*The divine illumination comes naturally.'*\n\n*This is what I mean.\"*",
      "overlap_context": "seek?\"*\n\nGuangxuan replied: *\"I have heard that **immortals possess the even more refined Golden Elixir Way** (金液妙道), and the **Refined Elixir reaching the Governing Vessel** (还丹至卫). I fear wasting my years, so I have searched every mountain.\"*\n\nThe man asked again: *\"In your search for the Golden Elixir Way, have you met anyone?\"*\n\nGuangxuan answered: *\"For over twenty years, I have not encountered a **true sage** (达者).\"*\n\nThe old man smiled faintly and asked again: *\"Do you recognize me now?\"*",
      "start_char": 1768,
      "end_char": 2732,
      "start_sentence": 81,
      "end_sentence": 135,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 15.745371103286743,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\金液还丹百问诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "直至诸经，唯赞铅之功能也。 若舍其铅，如弃父母，而求孩子也。 古歌曰：莫坏我铅，令我命全。 莫坏我车，令我还家。 铅断河车，所作无功。 铅绝河车，所作无出。 又曰：玄生因金公，巍巍立始终。 又曰：一物含五彩，永作仙人禄。 又《 陶植篇》 云．．一者水数，为五行之始。 色禀北方之位，包含五行，修之得合道，了契自然。 故能生天生地，为牝为牡，然后还日精於月窟，结精华於无中，能生紫气之精，潜与真合符，非神仙莫能窥也。 世人不解用之，遂致差之毫厘，失之千里，可不明矣。 古歌曰：用铅不用铅，须向铅中作。 恰到用铅时，用铅还是错。 又云：用铅不用铅，铅是旧丹田。 此用不弃而解用，阴阳得序，悟之则得，只在铅中，尔细研究之也。 又《元阳子歌》曰：真阴真阳是其道，只在目前何远讨。 凡流岁岁炼神丹，忽见青黄自言好。 志士应须求法则，勿使心神虚败耗。 但能求取真黄芽，人若服之寿无老。 此可知也。 光玄曰：窃见世人云：朱砂水银是黄芽，何理也。 先生曰：此非道人之言也。 且朱砂水银者，无定性，自无身形，阴自不生，女自无孕故也。 李栖蟾云：朱砂水银同处，二女终不相知。 自立既难安，何得成大药。 夫黄芽者，坎离相孕，金水相生，男冠女姅，牝牡相得，从无入有，阴动阳交，方可得成，契於至理。 故《阴真君歌》曰：北方正气为河车，束阳甲乙成金砂。 两情含养同一体，朱雀调运生金花。 金花生，天地宝，人会此言成至道。 此可知也。 光玄曰：又见世人或以金为黄芽，银为黄芽，研朱粉银为黄芽，生银为黄芽，铆铅炼铅枯铅等为黄芽，或以密陀僧为黄芽，是何理也o 先生曰：此并非也。 诸类皆是有质之物，顽滞之徒，炼之即色悴形枯，烧之即尘飞土变，枯骨而粉，毕竟无成。 盖谓孤阴寡阳，争同至药。 服之则灼人五脏，饵之乃促彼生年，岂可类於黄芽，吁於大道。 夫黄芽者，铅汞合体，金木相并，龙虎相交，水火相制，推情合性，以魄随魂，成为还返之因，明於呼吸之理，力得阴交阳孕，母在子全，得天地之精诚，授混元之大道也。 古歌曰：金不露体，木不呈形。 又言丹砂木精，得金乃并。 又日； 束身敛魄充虎饥，虎来啖食生体脂。 此甚明也。 光玄曰：黄芽既云铅汞所造，金水相生。 愚意尚迷未晓。 伏愿先生再垂指的。",
      "translated_text": "Even unto the various scriptures, they praise only the efficacy of lead. To abandon its lead is like discarding one’s parents, yet still seeking the child. The ancient song says:\n*\"Do not destroy my lead,\nThat my life may remain whole.\nDo not destroy my chariot,\nThat I may return home.\nWhen lead severs the River Chariot, all actions are in vain.\nWhen lead cuts off the River Chariot, nothing succeeds.*\n\n*Again it says:*\n*The Dark Origin arises from the Golden Ancestor,\nMajestic and enduring from beginning to end.\n\n*Again it says:*\n*A single thing containing five hues,\nForever the blessing of the Immortal.*\n\n*And in the *Tao Zhi Pian* it is written:*\n*The One is the water’s number,\nThe origin of the Five Phases.\nIts hue aligns with the North’s domain,\nEncompassing the Five Phases—\nCultivate it to harmonize with the Dao,\nAnd naturally grasp the truth.\nThus it can generate Heaven and Earth,\nBecome female and male,\nThen return the solar essence to the lunar cave,\nCondense the refined essence from the void,\nAnd produce the purple qi’s essence,\nConcealed and in harmony with the True.\nNone but the divine can perceive it.\n\nThe world fails to understand its use,\nThus even a hair’s breadth error leads to a thousand miles’ loss—\nHow could it not be clear?\n\nThe ancient song says:\n*'Use lead, yet do not use lead,\nYou must act within the lead itself.*\nAt the precise moment of using lead,\nIs using lead right or wrong?\n\n*Again it says:*\n*'Use lead, yet do not use lead,\nLead is the old elixir field.*\nThis is the art of neither discarding nor employing it,\nWhereby yin and yang follow their order.\nEnlightenment brings attainment—\nIt lies within the lead itself.\nStudy it carefully.*\n\n*And in the *Yuan Yang Zi Song* it is said:*\n*The True Yin and True Yang are its Way,\nYet they stand before you—why seek afar?\nOrdinary men year after year refine the spirit elixir,\nThen suddenly see green and yellow and call it good.\nThe worthy must seek the true method,\nLest their vital essence be wasted in vain.\nBut if one obtains the True Yellow Sprout,\nThose who ingest it shall never age—\nThis is evident.*\n\n**Light Xuan said:** I have heard the world claim that cinnabar and mercury are the Yellow Sprout—what is the reasoning?\n\n**The Master replied:** These are not the words of one who grasps the Dao. Cinnabar and mercury, lacking fixed form, have no substance or shape—\nYin cannot generate, the female cannot conceive.\nAs Li Qi’an said:\n*\"Cinnabar and mercury dwell together,\nYet the two women never recognize each other.\nSelf-establishment is already unstable—\nHow could they produce the Great Elixir?\"*\n\nThe Yellow Sprout arises from the union of Kan and Li,\nWhere metal and water mutually generate,\nThe male crowned, the female veiled,\nYin and yang in perfect accord—\nFrom non-being to being, yin moves, yang responds,\nOnly then can it be formed,\nIn accordance with ultimate truth.\nThus the *Song of the True Yin Lord* says:\n*\"The true qi of the North is the River Chariot,\nBinding the solar Yang to form the golden sand.\nTwo passions nurtured in one body,\nThe Vermilion Bird refines and births the golden flower.\nWhen the golden flower blooms,\nIt is the treasure of Heaven and Earth—\nHe who understands this attains the supreme Dao.\"*\n\n**Light Xuan said:** I have also seen the world claim gold as the Yellow Sprout, silver as the Yellow Sprout, ground cinnabar and silver as the Yellow Sprout, live silver as the Yellow Sprout, or smelted, refined, and dried lead as the Yellow Sprout—even using *mita* (lead oxide) as the Yellow Sprout. What is the reasoning?\n\n**The Master replied:** These are all incorrect. All such substances are coarse and stagnant—\nRefine them, and their color fades, their form withers;\nBurn them, and they scatter as dust and ash—\nReduced to powdered bone, they yield nothing.\nThey are solitary yin or meager yang,\nStriving to rival the supreme elixir.\nIngesting them sears the five viscera,\nShortening life—\nHow could they compare to the Yellow Sprout in the Great Dao?\n\nThe Yellow Sprout is the union of lead and mercury,\nMetal and wood in parallel,\nDragon and Tiger intertwined,\nWater and fire in balance—\nEmbodying sentiment and nature,\nWith spirit following essence,\nBecoming the cause of return and rebirth,\nClarifying the principles of inhalation and exhalation,\nAchieving yin’s embrace of yang’s gestation,\nThe mother whole as the child is born—\nReceiving the essence of Heaven and Earth,\nTransmitting the Great Dao of the Primordial Void.\n\nThe ancient song says:\n*\"Metal does not reveal its body,\nWood does not display its form.\"*\n\n*Again it says:*\n*\"Cinnabar and wood’s essence,\nWhen united with metal, merge as one.\"*\n\n*Again it says:*\n*\"Conceal the body, gather the spirit to sate the Tiger’s hunger,\nThe Tiger comes to devour the living essence within.\"*\n\nThis is perfectly clear.\n\n**Light Xuan said:** Though the Yellow Sprout is said to be crafted from lead and mercury, with metal and water generating each other, my confusion remains. I humbly pray the Master clarify further.",
      "overlap_context": "e medicine, originally without medicine.*\n*Use lead, yet do not use lead,*\n*You must act within the lead itself.*\n*The Yellow Sprout is lead,*\n*Yet it is ten thousand miles from lead.*\n*The Yellow Sprout is not lead,*\n*Yet it begins with lead.*\n*Lead is the Father of the Teeth,*\n*The Teeth are the children of lead.*\n*The child conceals the mother’s womb,*\n*The mother conceals the child’s embryo.*\n*Knowing white to guard black,*\n*The divine illumination comes naturally.'*\n\n*This is what I mean.\"*",
      "start_char": 2732,
      "end_char": 3627,
      "start_sentence": 136,
      "end_sentence": 180,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 17.483354806900024,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\金液还丹百问诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "先生曰：譬如人问种树，世上良田果子，初先犁蒋耕垦，次选好地，及彼良时，仍赖风雨调匀，节候催促，年终稼穑尽获。 收成黄芽之因，亦复如是。 合和铅汞，配合坎离，水火相仍，时候周足，自然变化，无有比伦。 黄芽若成，大道易矣。 古歌曰：铅汞牙，铅汞牙，同三花，采我气，结成砂，初闻日，运火加，轮五彩，入神华，曾为使，道无邪，三者备出是仙家。 此可知也。 光玄曰：黄芽既得，知其根本，至药如何得成，再乞先生一垂指示。 先生曰：至药唯用五行，更无杂物。 若有诸类，不成至药。 古歌曰：捉取束方龙，配与西白虎。 更将南朱雀，后会之玄武。 就中玄处玄，莫失中央路。 此可知也。",
      "translated_text": "The Master said: *\"Suppose one asks how to plant a tree. On fertile fields where fine fruits grow, first the land is plowed and tilled, then the best soil is chosen. When the season arrives, it still depends on balanced winds and rains, on the timing of the seasons urging it forward—by year’s end, the harvest is complete. The cultivation of the Yellow Sprout follows the same principle.\n\nTo combine lead and mercury, to align with the trigrams *Kǎn* and *Lǐ*, to let water and fire follow their natural course—when the time is ripe and the conditions complete, transformation unfolds without equal. Once the Yellow Sprout is formed, the Great Dao becomes effortless.\n\nThe ancient song says:\n*'Lead-mercury teeth, lead-mercury teeth,\nUniting the Three Flowers, drawing in my qi,\nForming cinnabar—first hearing the sun,\nRefining with fire, cycling through five hues,\nEntering divine brilliance, once a servant,\nNow the Dao is unerring—when the three are complete, one attains immortality.'*\n\nThis is clear.\n\nLight Xuan said: *\"Now that the Yellow Sprout is obtained, its root is understood. But how does one proceed to the Supreme Medicine? I again humbly seek the Master’s instruction.\"*\n\nThe Master said: *\"The Supreme Medicine relies solely on the Five Phases; no extraneous substances may be added. If any others are introduced, it will not be the Supreme Medicine.\n\nThe ancient song says:\n*'Seize the Eastern Green Dragon in its bound form,\nPair it with the Western White Tiger.\nThen take the Southern Vermilion Bird,\nAnd finally meet the Black Tortoise of the Void.\nWithin the void, seek the void’s path—\nDo not stray from the central way.'*\n\nThis is clear.\"*",
      "overlap_context": "al its body,\nWood does not display its form.\"*\n\n*Again it says:*\n*\"Cinnabar and wood’s essence,\nWhen united with metal, merge as one.\"*\n\n*Again it says:*\n*\"Conceal the body, gather the spirit to sate the Tiger’s hunger,\nThe Tiger comes to devour the living essence within.\"*\n\nThis is perfectly clear.\n\n**Light Xuan said:** Though the Yellow Sprout is said to be crafted from lead and mercury, with metal and water generating each other, my confusion remains. I humbly pray the Master clarify further.",
      "start_char": 3628,
      "end_char": 3904,
      "start_sentence": 181,
      "end_sentence": 193,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 3.9156136512756348,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\金液还丹百问诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "此之五行，是铅汞本类，乃得成丹。 若有非类，即不成也。 譬如一家父母夫妇，无有别人。 铅汞五行，亦复如是。 制伏成药，骨肉精气血脉皆全，方堪服饵。 古歌云： 何言金木水火土，留身保神是龙虎。 学人不识五行精，强认他人为父母。 木主气兮骨主虎，血主水兮肉象土。 不死之道在离宫，会得五行金有主。 五行须是水银亲，殊质不堪为伴倡。 又贺兰求大士歌曰：青龙起，白虎卧，玄武飞，主却坐，黄龙中央自结裹。 母怜子，子怜我，炉中结成云一朵，服饵刀圭无不可。 此之是也。 光玄曰：大药虽是龙虎制服，五行精启成药，饵服之时，最要何物为丸。 先生曰：撑药之日，是一味水银神水之胎，作紫金之粉，色含五彩，以表五行成身，号曰金液还丹，太古神仙，皆同一法。 古歌曰：水银一味成仙药，如使流传伏火难。 若遇河车成紫粉，一时化作金液丹。 金丹正法本非赤，水银一味独幽玄。 刀圭点化将为验，服者不死作真仙。 又歌曰； 却取抽成汞，还烧遣作砂。 胎中受五行，月足见黄芽。 迷途不可见，对面隔天涯。 若到河车地，只此是仙家。 此可明也。",
      "translated_text": "This five is the very essence of lead and mercury—\nonly thus can the elixir be perfected.\nIf any others are introduced, it cannot be achieved.\n\nIt is like a family of parents and spouse—\nno outsiders may be admitted.\nLead and mercury, the Five Phases, are the same.\n\nWhen subdued into medicine, bones, flesh, vital essence, *qi*, and blood vessels remain intact—\nonly then may it be ingested.\n\nThe ancient song says:\n*\"Why speak of metal, wood, water, fire, and earth?\nPreserving life and guarding spirit are the Dragon and Tiger.\nThe scholar fails to recognize the Five Phases’ essence,\nforcibly claiming others as parents and spouse.\nWood governs *qi*, the Tiger rules bone,\nwater commands blood, and flesh embodies earth.\nThe Dao of immortality lies in the Hall of Separation—\nwhen the Five Phases unite, gold takes its master.\nThe Five Phases must be born of mercury’s own essence;\ndissimilar substances cannot serve as companions.\n\nAgain, the *Song of Master He Lan Seeking the Great Sage* says:\n*The Green Dragon rises, the White Tiger rests,\nthe Black Tortoise soars, the Sovereign sits still,\nwhile the Yellow Dragon coils in the central embrace.\nMother pities child, child pities mother—\nwithin the furnace, a cloud forms as one.\nIngesting it, the elixir’s efficacy knows no bounds.*\n\nThis is the truth.\n\nLight Xuan said: *\"Though the Supreme Medicine is forged by subduing Dragon and Tiger,\nand the Five Phases’ essence births the elixir,\nwhat is most critical when forming the pill for ingestion?\"*\n\nThe Master said: *\"On the day of refining, it is a single essence—\nmercury’s divine water, the womb of the elixir—\nground into violet-golden powder,\nits hue bearing five colors, manifesting the Five Phases’ embodied form.\nIt is called the Golden Liquid Reversion Elixir;\nthe divine immortals of antiquity all followed this same method.\"*\n\nThe ancient song says:\n*\"A single essence of mercury becomes the elixir of immortality,\nyet if it flows, fire’s suppression proves difficult.\nIf it meets the River Vehicle to form violet powder,\ninstantly it transforms into Golden Liquid Elixir.\nThe true method of gold elixir is not red—\nmercury alone is profound and mysterious.\nThe elixir’s efficacy is verified by the Swordsman’s test;\nthose who ingest it attain true immortality as divine immortals.\"*\n\nAnother song says:\n*\"Reverse-extracting to obtain mercury,\nthen burning it into sand.\nWithin the womb, it receives the Five Phases—\nwhen the month is complete, the Yellow Sprout appears.\nLost paths reveal nothing,\nyet across the void, the distance yawns.\nIf one reaches the River Vehicle’s domain,\nonly this is the realm of immortals.\"*\n\nThis is clear.",
      "overlap_context": "Master’s instruction.\"*\n\nThe Master said: *\"The Supreme Medicine relies solely on the Five Phases; no extraneous substances may be added. If any others are introduced, it will not be the Supreme Medicine.\n\nThe ancient song says:\n*'Seize the Eastern Green Dragon in its bound form,\nPair it with the Western White Tiger.\nThen take the Southern Vermilion Bird,\nAnd finally meet the Black Tortoise of the Void.\nWithin the void, seek the void’s path—\nDo not stray from the central way.'*\n\nThis is clear.\"*",
      "start_char": 3904,
      "end_char": 4354,
      "start_sentence": 194,
      "end_sentence": 219,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 8.056037664413452,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\金液还丹百问诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "光玄曰：伏火水银，若成至药，自古已来，亦有朱砂水银伏火者不少，因何服饵，皆不延年。 及将点化，又无所用。 此何谓也。 先生日：此皆不得神仙之妙术，不按仙经之理，不依五行制造，不得日月精华。 或用诸类相和，或於至真违远，纵得千斤伏火，亦与瓦石一般。 非惟点化无堪，亦致服食，夭人寿矣。 故《王真人传》云：古有兄弟二人，将水银一斤，於阳山谷之中，炼烧三年，伏火如红玻璃之色，言是至药。 兄弟各服半斤，六月须着绵衣行，又要人扶策，此希延寿，返有堕身之灾。 岂非药类不同，方术错俟，此可为验。 切在求其真，若得真源，万不一失。",
      "translated_text": "Light and Primordial says: *\"To suppress fire with mercury—\nif it becomes the ultimate medicine,\nyet since ancient times, many have used cinnabar and mercury to suppress fire,\nso why do those who take it never extend their years?\nWhen they attempt alchemical transformation,\nit proves equally futile.\nWhat does this mean?\n\nThe Master replied:\nThese are all who fail to grasp the subtle arts of Daoist immortals,\nwho do not follow the principles of the Immortal Scriptures,\nwho do not adhere to the Five Phases in their preparation,\nand who miss the essence of solar and lunar elixirs.\nSome mix it with inferior substances,\nothers stray far from the True Principle.\nEven if they produce a thousand pounds of suppressed fire,\nit is no better than common stone or clay.\nNot only does the transformation fail,\nbut even ingestion brings untimely death and shortens life.\nThus, the *Transmission of the Sage King* states:\nIn ancient times, there were two brothers\nwho took one pound of mercury\nand refined it in the Yang Mountain Valley for three years,\nuntil it turned the color of red glass,\nclaiming it was the ultimate medicine.\nEach brother took half a pound,\nand within six months,\nthey had to wear padded garments to move,\nand even required others to support them.\nThis barely prolonged their lives,\nyet they suffered calamity to their bodies.\nWas it not because the medicinal category was wrong,\nand the methods misaligned?\nThis can be taken as proof.\nThe key lies in seeking the True Source—\nif one attains the authentic origin,\none will never fail.\"*",
      "overlap_context": "ound and mysterious.\nThe elixir’s efficacy is verified by the Swordsman’s test;\nthose who ingest it attain true immortality as divine immortals.\"*\n\nAnother song says:\n*\"Reverse-extracting to obtain mercury,\nthen burning it into sand.\nWithin the womb, it receives the Five Phases—\nwhen the month is complete, the Yellow Sprout appears.\nLost paths reveal nothing,\nyet across the void, the distance yawns.\nIf one reaches the River Vehicle’s domain,\nonly this is the realm of immortals.\"*\n\nThis is clear.",
      "start_char": 4355,
      "end_char": 4610,
      "start_sentence": 220,
      "end_sentence": 229,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 4.125711679458618,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\金液还丹百问诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "光玄日：既黄芽是大药之根本。 是五行所成，并晓其源，何知出世。 未委几多分两，烧制起自何时，而得成就，伏愿先生慈悲，再希指示。 先生曰：神仙至药分两，争无大道，金丹烧时有节，不依炉之法象。 亦且鼎有乾坤。 火从子离，须明卦兆。 复自离而至亥，始见光华。 亦同子在母胎，直须日足，鸡居卵内，要待时分。 分两则二八同居，节候乃一星周雨，方可龙兴云雨，虎啸岩前，定延世上之年，不是人问之物。 古歌曰：二八诧女，十六铅精。 阳生起火，阴尽须停。 星辰周雨，至药通灵。 又陶隐居望江南词云：长生药，本是五行作。 子午二门开，卯酉四时运，火合乾坤，龙虎自相吞。 此之谓也。 光玄曰：大丹既晓法度，实为万生有绿，此时获遇。 又见诸经诀云：日魂月魄，白虎青龙，丹砂河车，真铅真汞，名字不少，疑惑人心，未审其中，谁为正号。 愿先生一说，以释千疑，令后人得知仙路有登，尘寰得兔。 先生曰：多般名号，只是一途。 日魂即是阳精，月魄还同阴体，青龙是木，岂离束方。 白虎为金，还居西面。 河车金液，是仙家得意之名。 真汞真铅，乃达士当时之号。 但令消息，何用迟疑。 不越五行，更无别理。 光玄曰：又见《黄帝阴符经》云：金丹之术百数，其要妙在神水华池。 未知神水华池，是何物也。 华池之外，金丹更有成无，乞垂一指，永释疑心也。 先生曰：华池之外，金丹无成。 任是百数千般，妄为虚设。 若是华池之内，至妙至神。 故黄帝遇此升真，马明因兹得道，华池之理，亦在五行前章之中，具陈仔细。 故《元阳子歌》曰：神水华池世所希，流传不许俗人知，多将世上凡铅汞，相似令教人不疑。 光玄曰：又见诸经云：三五与一，天地至精。 未知此言，是何事也。",
      "translated_text": "Guangxuan asked: \"Since the yellow sprout is the foundation of the greatest medicine, formed by the Five Phases, and its source is understood, how does it transcend the mundane world? I do not yet know the precise proportions or when the refining began, yet it achieves completion. I humbly pray the Master, in his compassion, to further instruct me.\"\n\nThe Master replied: \"The proportions of the Immortal’s elixir are not arbitrary—they follow the Great Dao. The timing of the gold elixir’s refining must be precise, and it does not depend solely on the furnace’s form. Moreover, the cauldron embodies *Yin* and *Yang*. Fire must originate from *Zi* (Water) and *Li* (Fire), and one must discern the cosmic omens. Only when returning from *Li* to *Hai* (Water) does luminosity first appear—just as the child in the womb, it requires the sun’s fullness, or the chick in the egg, awaiting its time. The proportions are when *Er* (2) and *Ba* (8) unite, and the timing is when one star’s cycle brings rain, then the Dragon ascends with clouds and thunder, the Tiger roars at the cliffs—thus extending the years of all beneath heaven. This is no mere mortal concern.\n\nAn ancient verse says:\n*'Er-Ba* astonishes the maiden,\n*Shiliu* is lead’s refined essence.\nWhen *Yang* arises, fire ignites;\nwhen *Yin* is exhausted, it must cease.\nStars cycle with rain,\nand the elixir attains its spirit.\"\n\nMoreover, Tao Yuanming’s *Wang Jiangnan* poem states:\n*\"The elixir of longevity*\n*is born of the Five Phases’ work.*\n*At *Zi* and *Wu*, the gates open,*\n*and *Mao* and *You* govern the seasons.*\n*Fire unites *Yin* and *Yang*—*\n*Dragon and Tiger devour each other.*\nThis is the very meaning.\"\n\nGuangxuan said: \"Now that the Great Elixir’s methods are clear, it truly benefits all living beings. At this fortunate encounter, I have also seen various scriptures state:\n*'Day-Soul, Moon-Spirit,*\n*White Tiger, Green Dragon,*\n*Cinnabar, River-Chariot,*\n*True Lead, True Mercury—*\ntheir names are countless, confusing the mind.\nI do not know which is the true name.\nI beg the Master to clarify these doubts,\nso that future seekers may know the Dao’s path\nand escape the dusty world.\"\n\nThe Master replied: \"All these names refer to one path. *Day-Soul* is the essence of *Yang*, *Moon-Spirit* aligns with *Yin*. *Green Dragon* is Wood, never straying from its cardinal direction. *White Tiger* is Metal, dwelling in the west. *River-Chariot* is the elixir’s golden fluid—an honored name among the Immortals. *True Lead* and *True Mercury* are the titles of those who have attained the Dao. As long as one understands their transformations, why hesitate? Beyond the Five Phases, there is no other principle.\"\n\nGuangxuan asked: \"I have also seen the *Yellow Emperor’s Yin Symbol Scripture* say:\n*'A hundred methods of gold elixir exist,*\n*yet their essence lies in the *Shen Water* and *Hua Pool*.*\nI do not know what *Shen Water* and *Hua Pool* are. Beyond the *Hua Pool*, does the gold elixir succeed or fail? I beg the Master to clarify this lingering doubt.\"\n\nThe Master replied: \"Beyond the *Hua Pool*, the gold elixir fails. Even a hundred or a thousand methods are mere empty contrivances. Within the *Hua Pool*, it is most wondrous and divine. Thus, the Yellow Emperor attained transcendence through it, and Ma Ming achieved the Dao by this means. The principles of the *Hua Pool* are already detailed in the earlier chapter on the Five Phases, explained thoroughly. Therefore, the *Song of Yuan Yangzi* says:\n*'The *Shen Water* and *Hua Pool* are rare in the world,*\n*their transmission forbidden to the vulgar.*\nMany take mundane lead and mercury,\nmaking them seem alike to deceive the ignorant.'\"\n\nGuangxuan asked: \"I have also seen the scriptures say:\n*'Three-Five and One—*\n*the utmost essence of Heaven and Earth.*\nI do not know what this refers to.\"",
      "overlap_context": "it turned the color of red glass,\nclaiming it was the ultimate medicine.\nEach brother took half a pound,\nand within six months,\nthey had to wear padded garments to move,\nand even required others to support them.\nThis barely prolonged their lives,\nyet they suffered calamity to their bodies.\nWas it not because the medicinal category was wrong,\nand the methods misaligned?\nThis can be taken as proof.\nThe key lies in seeking the True Source—\nif one attains the authentic origin,\none will never fail.\"*",
      "start_char": 4611,
      "end_char": 5296,
      "start_sentence": 230,
      "end_sentence": 264,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 10.435095310211182,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\金液还丹百问诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "先生曰：前以备陈，今再问三五者，亦是五行正数。 且非别类，本无凡物。 尔更宜寻究，必达根原耳。 不见古歌曰：阴坎徒迷一，阳离五彩＃１形。 不知三所以，备抱木之灵。 炼药须通诀，玄关谙古经。 琼丹君若就，天驾五云饼。 光玄曰：世上诸药，何止数万般，唯金液还丹，即延生保寿，乃至升真，是何理也。 先生曰：尔之愚钝，犹不知之，听吾细说。 且世问之人，无不禀於五行而生，至於心肝脾肺肾，岂弃阴阳五行。 还丹者烧五行之精气，含万象之神光，得紫金之妙，流津液之名，服之者岂不保固四肢，坚牢五藏，自然长生有地，去世成因，事在目前。 迷人但执古歌曰：金砂入五内，雾散若风雨。 熏蒸达四肢，颜色悦泽好。 老翕复丁壮，耆妪成姥女。 发白复再黑，齿落更重生。 号日真人子，度世免死厄。 此方可知也。 石药者，亦属五行不录，一体自然也。 如生服之，即有毒损人。 伏火又即同瓦砾，唯可医小病，宁将此比并大丹，事理晓然，真源不昧也。 草药者，亦随四时凋变，自不固於雪霜，方味相和，亦只理其风湿，岂比大丹至药。 真道深远，须辨是非，可以知其深浅。 光玄曰：金丹大药，服之长寿，乃至升天，未审世问更将何用。 先生曰：迷人，金液还丹，岂无使用。 此丹一年满足，十月周圆，开炉而紫粉成金，启鼎而黄芽发耀，包含五彩，聚集百灵。 先将点制於水银，立成黄金为验。 服食之后，永固筋骸，济命济家，且非虚说。 古歌曰：丹砂丹砂，济命济家。 能济我命，能济我家。 又陶隐居望江南云：十月满，开鼎一团红。 数片残雪含五彩，解胎神水响玲珑，气复异香秾，此得成至宝之谓也。 光玄曰：水银除此药制伏，得成金外，更有何药擒之，得成至宝。 先生曰：水银除黄芽至药之外，诸般药类，宁制於他。 光玄曰：何以诸药制伏不得。 先生曰：水银者，乃天地之至精，五金之魂魄，流利为性，染杂无因。 故俗士云：水银无假，阿魏非真。 此明真理，故知诸物不可入也。 黄芽者，体是水银，感五行之精，受正阳之气，年周月足，骨立神全，水银被制之，有何不可也。 《阴符经注》云：飞鼠断猿，河车伏汞。 若有杂物，无因得成。 又歌曰：河上诧女，灵而最神，见火即飞，不染垢尘。 鬼匿龙隐，莫知所存。 将欲制之，黄芽为根。 此可知也。 光玄曰：先生不闻凡末。 夫指幽玄，金液之道尽知，龙虎之门顿悟，几年海上，空悲万里之波。 今日尘中，忽见三清之境。 虽知仙路，堪悯世人，今欲再有启陈，更希先生指路，庶令迷昧尽达真源，是弟子之诚深愿矣。 先生曰：尔之姓字，已在於丹台。 我道幽玄，悉无秘悟。 但希来问，即可分明，莫抱疑情，虚度一世。",
      "translated_text": "「The Master said: Earlier, I explained it thoroughly, but now you ask again about the Three-Five—it is also the proper count of the Five Phases. Moreover, it is not a separate category, nor does it originate from mundane substances. You should further investigate and seek its fundamental source, for only then will you truly grasp its essence.\n\nDo you not see the ancient song that says:\n*\"Yin Kan confuses with One,*\n*Yang Li displays Five Colors.\"*\n\nYou do not know why the Three is essential—\nit is the spirit of the Five Phases embodied.\nRefining the elixir requires mastery of the formulas,\nand the Mystic Passages are known from ancient scriptures.\nWhen the *Qiong Dan* is perfected,\nthe Celestial Chariot rides upon the Five-Colored Clouds.\n\nGuangxuan asked: *\"Among the myriad elixirs of the world,*\n*how can the Golden Liquid Returned Dan alone*\n*extend life, preserve vitality,*\n*and even grant transcendence?\"*\n\nThe Master replied: *\"Your dullness still fails to comprehend. Listen now as I elucidate.\n\nIndeed, all who inquire of the Way are born under the Five Phases,\nand even the heart, liver, spleen, lungs, and kidneys—\nhow could they abandon Yin and Yang, the Five Phases?\n\nThe Returned Dan is the refined essence of the Five Phases’ *qi*,\ncontaining the luminous spirit of all phenomena.\nIt attains the marvelous virtue of Purple Gold,\nand is renowned for its flowing elixir.\nThose who consume it will naturally fortify their limbs,\nstrengthen their organs,\nand achieve longevity by its power—\nthis is the very cause of their immortality.\nThe results are evident before our eyes.\n\nThe misguided only cling to the ancient song:\n*'Gold sand enters the Five Viscera,*\n*its mist disperses like wind and rain.*\n*Steaming and refining reach the Four Limbs,*\n*their complexion becomes radiant and fair.*\n*Withered old men regain youth,*\n*aged women become maidens once more.*\n*White hair turns black again,*\n*fallen teeth grow back anew.*\n*They are called True Persons’ Children,*\n*and escape the calamity of death.'*\nThis method may be understood.\n\nThe Stone Elixirs, too, belong to the Five Phases,\nyet they are not recorded in the Way.\nIf taken raw, they harm the body—\nlike fire suppressed, they are but worthless fragments.\nThey can only treat minor ailments.\nHow could one compare them to the Great Elixir?\nThe truth is clear, and the genuine source is not obscured.\n\nThe Herb Elixirs also change with the seasons,\nunable to withstand frost and snow.\nTheir flavors may harmonize,\nbut they only remedy wind and dampness—\nhow could they match the Great Elixir’s supreme efficacy?\n\nThe True Dao is profound and distant,\nrequiring discernment between right and wrong\nto measure its depth and shallowness.\n\nGuangxuan asked: *\"If the Great Elixir of Golden Liquid*\n*can grant longevity and even ascension,*\n*what further use does the world have for it?\"*\n\nThe Master replied: *\"The misguided do not realize*\n*that the Golden Liquid Returned Dan has its applications.\nThis elixir, when fully refined in a year,\nits ten months complete—\nopens the furnace to reveal purple dust turning gold,\nand lifts the cauldron to see yellow sprouts gleaming bright.\nIt encompasses the Five Colors,\nand gathers the hundred spirits.\nFirst, it is tested by being mixed with mercury,\nwhereupon yellow gold is instantly formed as proof.\nAfter ingestion, it eternally fortifies the sinews and bones,\nsaving lives and benefiting families—\nthis is no idle claim.\nThe ancient song says:\n*'Cinnabar, cinnabar,*\n*saves lives and benefits families.*\n*It can save my life,*\n*it can save my family.'*\nAnd Tao Yuanming’s *Viewing the Jiangnan* also states:\n*'Ten months full, the cauldron opens—one cluster of red.*\n*Fragments of jade-like frost hold Five Colors,*\n*the Spirit of the Embryo is dissolved in the Mystic Water, its chime resounding.*\n*The *qi* restores with fragrant vigor—*\n*this is the attainment of the supreme treasure.'*\n\nGuangxuan asked: *\"Apart from this elixir’s mastery over mercury,*\n*what other elixirs can subdue it*\n*and produce the supreme treasure?\"*\n\nThe Master replied: *\"Beyond the Yellow Sprout’s supreme elixir,*\n*no other preparation can truly control mercury.\"*\n\nGuangxuan asked: *\"Why cannot other elixirs subdue mercury?\"*\n\nThe Master replied: *\"Mercury is the utmost essence of Heaven and Earth,*\n*the vital spirit of the Five Metals.\nIts nature is fluid and unrestrained,\nand it cannot be tainted by impurities.\nThus, the vulgar say:\n*'Mercury is unadulterated,*\n*Asafoetida is not genuine.'*\nThis reveals the true principle—\nhence, all other substances cannot enter it.\n\nThe Yellow Sprout is indeed mercury,\nbut when it absorbs the essence of the Five Phases\nand receives the pure *Yang Qi*,\nits cycle of years and months is complete—\nits form solidifies, its spirit perfect.\nOnce mercury is subdued by it,\nwhat remains impossible?\nThe *Yin Fu Jing Commentary* states:\n*'The Flying Mouse severs the Monkey,*\n*the River Chariot subdues mercury.'*\nIf there are impurities,\nno result can be achieved.\nAnother song says:\n*'On the Riverbank, you marvel at the woman,*\n*most luminous and divine.*\n*Seeing fire, she takes flight,*\n*never staining herself with filth.*\n*Hidden by ghosts, concealed by dragons,*\n*no one knows her abode.*\n*To subdue her,*\n*the Yellow Sprout is the root.*\n*This is clear.'*\n\nGuangxuan asked: *\"Master, have you not heard of the ordinary methods?\"*\n\n*\"To point toward the profound and mysterious,*\n*the Dao of Golden Liquid is fully known,*\n*and the Gates of Dragon and Tiger are instantly awakened.*\n*Yet, for years on the seas,*\n*I only sorrowed over the ten thousand miles of waves.*\n*Today, amid the dust of the world,*\n*I suddenly glimpse the realm of the Three Pure Ones.*\n*Though I know the path to immortality,*\n*I pity the common folk.*\n*Now, I wish to further clarify,*\n*and hope the Master will guide me once more,*\n*so that all my confusion may reach the true source.\n*This is my disciple’s sincere and heartfelt wish.\"*\n\nThe Master said: *\"Your surname and given name*\n*are already inscribed on the Elixir Field.*\n*My teachings are profound and mysterious,*\n*yet none are concealed.\n*If you come to inquire,*\n*I will elucidate them plainly.\n*Do not harbor doubts,*\n*and waste your life in vain.\"*",
      "overlap_context": "ciples of the *Hua Pool* are already detailed in the earlier chapter on the Five Phases, explained thoroughly. Therefore, the *Song of Yuan Yangzi* says:\n*'The *Shen Water* and *Hua Pool* are rare in the world,*\n*their transmission forbidden to the vulgar.*\nMany take mundane lead and mercury,\nmaking them seem alike to deceive the ignorant.'\"\n\nGuangxuan asked: \"I have also seen the scriptures say:\n*'Three-Five and One—*\n*the utmost essence of Heaven and Earth.*\nI do not know what this refers to.\"",
      "start_char": 5297,
      "end_char": 6345,
      "start_sentence": 265,
      "end_sentence": 315,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 18.21351170539856,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\金液还丹百问诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "光玄曰：窃恐世人不晓铅汞，不识五行，将四黄以制水银，使八石用为至药，炮矾雄雌之类，无不遍寻，磁毗胆绿之徒，悉将入用。 指神符霜於黑锡，认圣无知作青盐，火锻百回，水飞千遍，忽三年守鼎，五载临炉，运火即山谷空虚，苦心则形神枯槁，都无所就，但怨神方，今启问求诸石药，五矾之中，终有至事，制得水银已否。 伏愿先生慈悲，特为开晓。 先生曰：世问之事，乃至纤毫，未有不因其理，制伏相依，种类相取，而成事也。 若乃穷诸理例，得彼类形，何事不成，何因不立。 《周易》所谓水流湿，火就燥，云从龙，风从虎，圣人作而万物睹。 此理例相依也。 即有水能共脂乳，相通入油，胶漆相须，雪霜同固，此形类相取也，可不明矣。 夫水银者，是金之魂魄，本五金之精华，与铅同根，与水共体。 若以五行相孕，金水相生，得气传华，方乃得成至药。 将制水银，万变千通，世无比类。 故《陶植篇》云：金为水母，母隐子胎。 水为金子，子隐母胞。 水者金之子。 子藏母腹。 此言金水自相含孕，蕴椟於母中。 因造化而生，又子继父体，为母立兆基。 此言砂产於金，汞流於子，以金养汞，继体而荣，道合自然，事归於至妙，不可不思之也。 若用矾石之药，杂类之徒，则金体全乖，祖宗并失，还返无由而得，金水无由而生，可谓雀鸥同巢，鼠猫共穴，将胶补釜，以漆涂疮，但恣虚老百年，万无一得之也。 古歌曰：世人好假不好真，竞将石药和水银。 姥女化归烟雾散，曾青磁石自相亲。 炮矾胆绿倾家产，多为疏狂枉作尘。 若遇神仙谈至理，终知白首永无因。 此可知也。 且药石者，大约七十二件，多至一百余般。 古之至人。 尽辨酸咸苦涩，着其经论，或梼研使用，治世人之诸疾。 或修炼合和，辟人问之邪珍，无关大事，得至长生。 假饶别得玄方，穷极制度，亦是暂留髭发，岂能久固筋骸。 世问迷昧之徒，嚣薄之辈，谬传方术，诬调神仙，矾石欲同铅汞，或以柳槌研合，或以桑叶相和，醋煮蜜蒸之时，不论遍数，水飞酒飞之日，动占时光。 言固济则铁石非坚，说覆籍乃寻常莫匹，极至三年满足，一鼎灰尘。 却云鹦犬来冲，致得龙蛇变去。 殊不知己之非理，但将怨恨於真仙。 如此之流，世问满目。 更有用尽寰中众石，海内诸矾铜精铁精，石绿土绿，罄竭资金，皆无所就。 情意稍迷，心神益乱，不信仙方宁远，岂知大道无烦。 谓灵丹不在此问，言至药生於海外，便向波斯国内，而求白矾紫矾。 或向回纥域中，寻访金刚玉屑。 动经多岁，惑说万途，纵饶觅得将来，亦无用处。 愁发因兹变白，苦心为此归泉，如此皆为不晓药之情性，不知药之类聚。 且矾共石，不与金同。 水银既是金魂，石药又如何入用。 夫至药者，紫金。 为五彩，成身成金，可因一体，五彩恰同五脏。 又见古歌曰：金可作，命可保。 金不作，徒自误。 此不虚传矣。 ，大药既成，金液变体，元是水银，何用矾石之徒，此得形类相须。 前云至理人不知之，上山求鱼，入海网兔，此则倒见，可不悲哉。 光玄曰：大药既是金液成形，矾石又不相入。 切见世人多假五金为柜，伏制水银，亦是经岁经年，千机万巧，皆无所成，多是虚费工夫，是何理也。",
      "translated_text": "「光玄曰：我深恐世人不解铅汞之奥妙，不识五行之真谛。乃以四黄（黄金、黄铜、黄铁、黄丹）制伏水银，又使八石（八种矿石）成为至药，如炮制矾石、雄雌矾之类，无不遍寻。磁石、胆绿之辈，亦悉将入用。然而，指神符霜为黑锡，认圣无知为青盐，火锻百回，水飞千遍，忽三年守鼎，五载临炉，运火则山谷空虚，苦心则形神枯槁，终无所成，徒怨神方。今欲启问：求诸石药中，五矾之内，究竟有何至事？制得水银否？\n\n伏望先生慈悲，特为开示。\n\n先生曰：世间所问之事，乃至细微末节，未有不因其理，制伏相依，种类相取，而成事者。若穷究诸理之例，得彼类形，何事不成，何因不立？《周易》所谓“水流湿，火就燥，云从龙，风从虎”，圣人作而万物睹。此即理例相依也。若有水能与脂乳相共，相通入油，胶漆相须，雪霜同固，此则形类相取也。可不明白乎？\n\n夫水银者，乃金之魂魄，本五金之精华，与铅同根，与水共体。若以五行相孕，金水相生，得气传华，方乃得成至药。将制水银，万变千通，世无比类。故《陶植篇》云：“金为水母，母隐子胎；水为金子，子隐母胞。水者金之子，子藏母腹。”此言金水自相含孕，蕴椟于母中。因造化而生，又子继父体，为母立兆基。此言砂产于金，汞流于子，以金养汞，继体而荣，道合自然，事归于至妙，不可不思也。\n\n若用矾石之药，杂类之徒，则金体全乖，祖宗并失，还返无由而得，金水无由而生。可谓雀鸥同巢，鼠猫共穴，将胶补釜，以漆涂疮，徒然虚老百年，万无一得之也。古歌曰：\n世人好假不好真，\n竞将石药和水银。\n姥女化归烟雾散，\n曾青磁石自相亲。\n炮矾胆绿倾家产，\n多为疏狂枉作尘。\n若遇神仙谈至理，\n终知白首永无因。\n此可知也。\n\n且药石者，大约七十二件，多至一百余般。古之至人，尽辨酸咸苦涩，著其经论，或梼研使用，治世人之诸疾；或修炼合和，辟人间之邪珍，无关大事，得至长生。假饶别得玄方，穷极制度，亦是暂留髭发，岂能久固筋骸？世间迷昧之徒，嚣薄之辈，谬传方术，诬调神仙，矾石欲同铅汞，或以柳槌研合，或以桑叶相和，醋煮蜜蒸之时，不论遍数，水飞酒飞之日，动占时光。言固济则铁石非坚，说覆籍乃寻常莫匹，极至三年满足，一鼎灰尘。却云鹦犬来冲，致得龙蛇变去。殊不知己之非理，但将怨恨于真仙。如此之流，世问满目。\n\n更有用尽寰中众石，海内诸矾，铜精、铁精、石绿、土绿，罄竭资金，皆无所就。情意稍迷，心神益乱，不信仙方宁远，岂知大道无烦？谓灵丹不在此问，言至药生于海外，便向波斯国内而求白矾紫矾，或向回纥域中寻访金刚玉屑。动经多岁，惑说万途，纵饶觅得将来，亦无用处。愁发因兹变白，苦心为此归泉。如此皆为不晓药之情性，不知药之类聚。且矾共石，不与金同；水银既是金魂，石药又如何入用？夫至药者，紫金，为五彩，成身成金，可因一体，五彩恰同五脏。又见古歌曰：\n金可作，命可保；\n金不作，徒自误。\n此不虚传也。\n\n大药既成，金液变体，元是水银，何用矾石之徒？此得形类相须。前云至理人不知之，上山求鱼，入海网兔，此则倒见，可不悲哉？\n\n光玄曰：大药既是金液成形，矾石又不相入。切见世人多假五金为柜，伏制水银，亦是经岁经年，千机万巧，皆无所成，多是虚费工夫，是何理也？」",
      "overlap_context": "ortality,*\n*I pity the common folk.*\n*Now, I wish to further clarify,*\n*and hope the Master will guide me once more,*\n*so that all my confusion may reach the true source.\n*This is my disciple’s sincere and heartfelt wish.\"*\n\nThe Master said: *\"Your surname and given name*\n*are already inscribed on the Elixir Field.*\n*My teachings are profound and mysterious,*\n*yet none are concealed.\n*If you come to inquire,*\n*I will elucidate them plainly.\n*Do not harbor doubts,*\n*and waste your life in vain.\"*",
      "start_char": 6346,
      "end_char": 7563,
      "start_sentence": 316,
      "end_sentence": 366,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 17.92696452140808,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\金液还丹百问诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "先生曰：五金者，是人间之质物，亦与至药不同。 黄芽篇中具陈，尔仔细研寻。 术有幽秘之道，又有玄微，皆须口授亲传，方可成丹转理。 切见世人妄凭泛说，专按古方，乱制水银，欲成至药。 殊不知五行含孕，如妇女之怀胎，铅汞相须，若晨鸡之抱卵。 至真妙道，通变无穷，毫厘有差，通变失序。 故陶植望江南云：还丹卫，切要经手传。 若信故方终自误，颠来倒去倒来颠，不得怨神仙。 又菩萨蛮词云：家家尽有长生药，时人取用皆差错。 气候若飞沈，问君何处寻。 眼看犹不识，误向铅中觅，此物没黄芽，徒劳岁月。 赊细思，此理真为足矣。 光玄曰：先生云：四黄八石，全无大道之理，不与水银合同。 又见龙光黄一味，才镕成汁，立制水银成砂，是何理也。 先生曰：汝未知之。 听吾细说。 水银者，正阴之体。 硫黄者，假阳之形，正阴被假阳之制，暂变身形，终无所住。 若遇正阳伏制，终始相依，此阴阳之大理也。 又硫黄是矾石之液，矾者乃铁之津华，磁石乃铁之母，朱砂磁石伏制硫黄，立成紫粉，此一根也。 硫黄既为铁之孙胤，水银本是金之精魂，二气虽暂相合，终无成事。 但旦细穷理路，兼乃可见根源。 光玄曰：先生所言诸矾，制伏水银不得，亦不与水银相同。 又见绿矾共青盐相和，制得水银，成粉成霜，是何理也。 先生曰：水银者，金之魂魄。 绿矾者，乃是铁之津华。 体五金即二气同根，议铅汞则铁铜疏远。 是以暂制水银成粉，却再烧之，复其本源，终无成遂，恰同不制。 光玄曰：矾既如此，青盐因何与矾，同入水银为用也。 先生曰：盐於水银，无以相类。 只是矾制水银之时，盐助其色，别无其功。 亦如飞烧毗黄，上覆其盐，即得色白，若非盐覆，其色不白，此之一例也。 斯为小事，非关大丹。 尔但究穷，永除疑虑矣。 光玄曰：先生所言铅汞五行，是大丹之根本。 诸矾石药，并不相干。 深悟至真，尽其大理。 又见世人多有广积童便，再淋再洒，或煮或煎，翻取其霜，澄泸其滓，言是五行之本，至药之根。 或将服食，或转制砂汞，是何理也。 先生曰：此是迷人所为之谬事也。 其童便是人所食之物而成，更有何物。 若有长生保固之道，人之日食，便合延年，更又何劳煎取查滓。 修炼之士妄以此物为之，欲其延年，惑矣。 故迷徒不知至理，纵然煎得，只成粉霜也。 大共盐花一般，争可变通，得成至药。 细穷至理，勿信凡流。 三岛不遥，九天非远。 光玄日：又见世人多采桑柴灰煎炼，言是至药根本，同制朱砂水银曾青。 诂问所由，却言不见《阴真君歌》云：龙居震位当六八，乃四十八，是桑字也。 引歌日：采乎蚕食之前，炼於火化之后。 又樊曹元绪之龟，降圣人之质，此是大药之根，更非别药。 此理如何，再请先生一说之也。 先生曰：大丹之本，前章具明，更无虚谬。 桑柴灰者，亦是迷人之所作，愚人之所传，递互相承，一无实矣。 且《阴真君歌》日：龙居震位当六八，虎数元生在一宫。 四十八者，此是大药分之数，亦如是方位之名，非桑字也。 凡流不达其理，妄认虚无，似鹿逐於阳光，猿探水月，终何所得，虚用心神。 大药之者，纯是五行，更无别类。 矾石相杂，犹尚不成。",
      "translated_text": "「The Master says: The Five Metals (五金) are mere material substances of the mortal world, fundamentally distinct from the True Elixir (至药). The *Huang Ya Pian* (黄芽篇) has already fully expounded upon this—you must carefully examine and study it.\n\nAlchemy possesses profound and subtle Dao (道), as well as mysteries beyond measure, all of which must be orally transmitted from master to disciple before one can succeed in refining the elixir and attaining its essence. Observe how mortals blindly rely on superficial theories, rigidly adhering to ancient formulas, and recklessly manipulate mercury (水银), attempting to forge the True Elixir (至药). Yet they fail to grasp that the Five Phases (五行) interact like a woman bearing child—lead and mercury (铅汞) must complement each other, as the morning rooster nurtures its egg (若晨鸡之抱卵).\n\nThe most refined and wondrous Dao (道) is boundless in transformation, and even the slightest deviation disrupts its natural order. Hence, Tao Zhuang (陶植) of Wang Jiangnan (望江南) sings:\n*\"Still the elixir must be passed by hand,\nTrusting old formulas will only mislead.\nUpside-down, downside-up, confusion without end—\nDo not blame the Dao/Way for your own folly.\"*\n\nAnd the Bhagavān’s (菩萨) rhyme goes:\n*\"Every household has the elixir of longevity,\nYet mortals use it all with error and confusion.\nQi and climate (氣候) shift like clouds in flight—\nWhere, pray, might one find it in search?\"\n\nThey gaze yet fail to recognize it,\nScrambling instead within lead’s embrace.\nThis substance lies not in *Huang Ya* (黄芽),\nBut in wasted years and hollow toil.\n\nUpon closer reflection, this truth is indeed profound.\n\nLight Xuan (光玄) says: The Master states that the Four Yellows and Eight Stones (四黄八石) lack any principle of the Great Dao (大道), and do not harmonize with mercury (水银). Moreover, when *Long Guang Huang* (龙光黄) is refined into a liquid, and mercury is immediately congealed into sand, what is the logic behind this?\n\nThe Master replies: You do not yet understand. Listen to my detailed explanation.\n\nMercury (水银) embodies the True Yin (正阴).\nSulfur (硫黄) is but a False Yang (假阳)—when True Yin is subjected to False Yang’s influence, its form may temporarily alter, but it will never endure. If True Yang (正阳) subjugates it, and the two remain inseparable from beginning to end, this is the great principle of Yin and Yang (阴阳).\n\nMoreover, sulfur is the essence of alum (矾石), alum the vital fluid of iron (铁之津华), and magnetite (磁石) the mother of iron. When cinnabar (朱砂), magnetite, and sulfur are refined together, they instantly produce purple powder (紫粉)—this is a single process.\n\nThough sulfur, as iron’s descendant (铁之孙胤), and mercury, as gold’s refined essence (金之精魂), may briefly unite, they ultimately cannot achieve true transformation.\n\nYet if one meticulously probes the path of Dao (道), the roots and origins will become clear.\n\nLight Xuan (光玄) says: The Master’s words on alum (矾) reveal that it cannot subjugate mercury, nor does it share mercury’s nature. Yet I see that green vitriol (绿矾) and green salt (青盐) are combined to refine mercury, producing powder or frost—what is the reasoning here?\n\nThe Master replies: Mercury is the soul and spirit (魂魄) of gold (金). Green vitriol is the vital fluid of iron (铁之津华). In terms of the Five Metals (五金), their essences share a common origin, but when discussing lead and mercury (铅汞), iron and copper (铁铜) are distant relations.\n\nThus, even if green vitriol temporarily refines mercury into powder, upon further heating, it reverts to its original form—no true transformation is achieved, just as if no refinement had been done at all.\n\nLight Xuan (光玄) says: If alum behaves this way, then why does green salt (青盐) join alum in refining mercury?\n\nThe Master replies: Salt has no affinity with mercury. It merely aids in coloration when alum refines mercury—its function is no other. Just as when sulfur is sublimated (飞烧), and salt is layered upon it, the resulting product is white; without salt, the color would not be white. This is but one example.\n\nSuch matters are trifling, unrelated to the Great Elixir (大丹). You need only investigate further to forever dispel your doubts.\n\nLight Xuan (光玄) says: The Master’s teachings on the Five Phases (五行) and lead-mercury (铅汞) form the foundation of the Great Elixir (大丹). All alum and mineral medicines (矾石药) are irrelevant.\n\nUpon deep comprehension of the True Dao (至真), one attains its grand principles. Yet I also observe how mortals amass and refine human urine (童便), repeatedly distilling and decanting it, or boiling and simmering it, then extracting its frost (霜) and purifying its dregs (滓), claiming this to be the essence of the Five Phases (五行) and the root of the True Elixir (至药). Some even consume it, or further refine it into mercury sand (砂汞)—what is the logic here?\n\nThe Master replies: This is the deluded folly of the ignorant. Urine is merely the waste product of human consumption—what else could it be? If there were a Dao of longevity and fortification, then daily meals would naturally prolong life, and why bother with refining and purifying dregs?\n\nThose who practice refinement in vain believe this substance can extend life—how mistaken they are! Thus, the deluded fail to grasp the True Dao (至理). Even if they refine it, they produce nothing but powder and frost, identical to common salt (大共盐花一般). No true transformation into the Elixir is possible.\n\nInvestigate the True Dao (至理) deeply, and do not trust the common teachings. The Three Islands (三岛) are not distant, nor the Nine Heavens (九天) far away.\n\nLight Xuan (光玄) says: I also see how mortals gather mulberry twig ash (桑柴灰) for refining, claiming it to be the foundation of the True Elixir (至药), and using it to process cinnabar (朱砂), mercury (水银), and realgar (曾青). When questioned on its origin, they say they found it in the *Yin Zhen Jun Ge* (阴真君歌), which states:\n*\"The Dragon dwells in the Shock position (震位), at sixty-four (六八),\nYet forty-eight (四十八) is where it resides—this is the mulberry (桑) character.\"*\n\nThey cite the verse:\n*\"Harvest before the silkworm’s meal begins,\nRefine after the fire’s transformation.\"*\n\nAnd they say that the tortoise of Fan Cao (樊曹) and Yuan Xu (元绪) descended from the sage’s essence (降圣人之质), making it the root of the Great Elixir (大药)—nothing else.\n\nHow does this principle work? I beg the Master to clarify once more.\n\nThe Master replies: The foundation of the Great Elixir (大丹) has been fully explained in previous chapters—there is no falsehood within it. Mulberry twig ash (桑柴灰) is but another fabrication of the ignorant, a tradition passed down by fools, with no substance at all.\n\nMoreover, the *Yin Zhen Jun Ge* (阴真君歌) states:\n*\"The Dragon dwells in the Shock position (震位), at sixty-four (六八),\nThe Tiger’s number originates in the first palace (一宫).\"*\n\nForty-eight (四十八) refers to the division of the Great Elixir (大药), as well as the name of its position in the formula—it is not the mulberry (桑) character.\n\nThe common folk fail to grasp this truth, mistakenly identifying it with mere emptiness, like deer chasing sunlight or monkeys seeking reflections in water. Ultimately, what will they gain? Their efforts are but wasted labor.\n\nThe Great Elixir (大药) is purely the Five Phases (五行)—no other elements are involved. Mixing alum and minerals only leads to further confusion.»",
      "overlap_context": "薄之辈，谬传方术，诬调神仙，矾石欲同铅汞，或以柳槌研合，或以桑叶相和，醋煮蜜蒸之时，不论遍数，水飞酒飞之日，动占时光。言固济则铁石非坚，说覆籍乃寻常莫匹，极至三年满足，一鼎灰尘。却云鹦犬来冲，致得龙蛇变去。殊不知己之非理，但将怨恨于真仙。如此之流，世问满目。\n\n更有用尽寰中众石，海内诸矾，铜精、铁精、石绿、土绿，罄竭资金，皆无所就。情意稍迷，心神益乱，不信仙方宁远，岂知大道无烦？谓灵丹不在此问，言至药生于海外，便向波斯国内而求白矾紫矾，或向回纥域中寻访金刚玉屑。动经多岁，惑说万途，纵饶觅得将来，亦无用处。愁发因兹变白，苦心为此归泉。如此皆为不晓药之情性，不知药之类聚。且矾共石，不与金同；水银既是金魂，石药又如何入用？夫至药者，紫金，为五彩，成身成金，可因一体，五彩恰同五脏。又见古歌曰：\n金可作，命可保；\n金不作，徒自误。\n此不虚传也。\n\n大药既成，金液变体，元是水银，何用矾石之徒？此得形类相须。前云至理人不知之，上山求鱼，入海网兔，此则倒见，可不悲哉？\n\n光玄曰：大药既是金液成形，矾石又不相入。切见世人多假五金为柜，伏制水银，亦是经岁经年，千机万巧，皆无所成，多是虚费工夫，是何理也？」",
      "start_char": 7564,
      "end_char": 8796,
      "start_sentence": 367,
      "end_sentence": 425,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 24.194636821746826,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\金液还丹百问诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "桑紫之徒，可知远矣。 故《参同契》云：孤兔不乳马，燕雀不生凤。 此之谓也。 光玄曰：又见世人多取鳌突中烟，云是木之至精，配在青龙之位，便引《元阳子歌》日：要识丹砂是木精，移来西位与金并。 迷人何处寻龙虎，恍惚之问是杳冥。 言是此也。 复觅墉州井盐，或以太阴玄精，配为白虎之象，引歌曰：鹿邑相附力三口，四十相乘复相守。 中田可养十一人，横目在下视左右。 言是真龙真虎之道。 大丹之心，此理如何，望垂指示。 先生曰：至真妙道匪遥，时人不见。 大谬之辞易识，愚者长迷。 故愚知相互，玉石不等，良可悲尔，可足悯哉。 夫至药者，是滑利之物，变化之身，上通仙籍，下延人寿。 得之者五行自晓，迷之者万象长悬。 金丹一成，贫病永失。 且烟临玄精之类者，是世间之死物，与瓦砾之无殊。 烧之则血脉不生，炼之财精神转竭，将何变化，得成大丹。 理在目前，时人不见。 故《元阳子歌》日：真龙真虎是真亲。 所言木精西位，显阴阳互养之灵，岂言烟旷之徒也。 元阳子素是达人，且非昧士，岂得将达人之语，迷顽钝之心，虚妄亦然，错乱甚矣。 夫龙虎者，是还丹之体，铅汞之心，神仙悉明，经书不谬。 故《金丹铭》云：丹砂真位元非赤，四季排来在南宅，位属南方丙丁火。 故说其形赤，抽取砂中水银，属束方甲乙木，其形乃青龙之象。 黑铅本性元非黑，怀玉内抱含五德，配属北方壬癸水。 其形黑，抽取铅中精气，配属西方庚辛金，其形白，乃白虎之象也。 又歌曰：五行不顺行，龙从火裹生。 五行颠倒术，虎从水裹出。 又金丹职赋云：火束旋而为龙，水西转而成虎。 又《李柄蟾歌》曰：太阴在南宅，太阳向北居，火之木日汞，水之金日铅。 制在中宫器，以类助相成。 阴来去发阳，龙虎为证验。 神丹龙虎有灵，岂以烟旷之徒，玄精之类，比之得同至药也。 再三思究，万无一差，勿信愚人，有惑真的。 光玄曰：先生所说还丹之道，已尽幽玄。 窃闻昔淮南王更炼秋石，而成至药，服食升天，未知秋石是何物也。 又见丹经多说圣无知之号，世人云是青盐，不知是否，伏愿先生勿悟玄理也。 先生曰：淮南王刘安所炼秋石之事，是大丹，更无别药。 还如一物，乃有数名。 圣人临时，亦复如是。",
      "translated_text": "「The followers of the *Sang Zǐ* (桑紫) are clearly far astray. Hence the *Shēn Tóng Què* (参同契) says: *\"The solitary hare does not suckle the horse, nor does the swallow yield the phoenix.\"* This is what I mean.\n\n*Guāng Xuán* (光玄) remarked: *\"I also see that many people take the smoke from calcined *áo tū* (鳌突), claiming it to be the utmost essence of wood, to be paired with the Green Dragon’s position. Then they cite the *Yuán Yáng Zǐ Gē* (元阳子歌): 'To recognize cinnabar as the essence of wood, bring it to the western position to join with metal.' The confused seekers, where do they find their Dragon and Tiger? Their bewildered inquiry is lost in the void. They speak of this as if it were true.*\n\n*Guāng Xuán* further sought *Yōngzhōu* (墉州) well salt, some claiming it as the essence of *Tài Yīn* (太阴), paired as the White Tiger’s symbol. They cite the verse: *\"Deer’s strength attaches at three mouths, forty times multiplied and guarded together. The central field nurtures eleven, cross-eyed below, surveying left and right.\"* They say this is the true Dao of Dragon and Tiger. How does this logic apply to the Great Elixir? I await your instruction.\n\nThe Master replied: *\"The most true and wondrous Dao is not distant, yet people do not see it. The utter falsehoods are easy to discern, but the ignorant remain long in error. Thus, wisdom and folly oppose each other—jewel and stone are not equal. Truly lamentable, indeed worthy of pity.\"*\n\nThe Great Elixir (至药), being slippery and transformative, connects the celestial with the mundane, prolonging life and extending into immortality. Those who grasp it understand the Five Phases (五行) naturally; those who are lost remain forever suspended in confusion. Once the Golden Elixir (金丹) is perfected, poverty and illness are forever banished.\n\nAs for the smoke of calcined *áo tū* (鳌突) and its kind—these are but dead matter of the world, no different from broken tiles and rubble. Burn them, and no vital *mài* (脉) arises; refine them, and their essence is utterly consumed. What transformation could they achieve? How could they form the Great Elixir? The truth lies before us, yet people fail to see it.\n\nHence the *Yuán Yáng Zǐ Gē* (元阳子歌) states: *\"True Dragon and true Tiger are true kin.\"* The essence of wood in the western position reveals the interplay of *Yīn* and *Yáng* nurturing each other—how could it refer to those who chase smoke and emptiness? *Yuán Yáng Zǐ* (元阳子) was a master of the Dao, not an ignorant scholar; how could he mislead the dull and obtuse with his words? Their falsehoods are indeed chaotic.\n\nDragon and Tiger are the very substance of the *Huán Dān* (还丹), the core of lead and mercury. All immortals recognize this, and the scriptures do not err. Hence the *Jīn Dān Míng* (金丹铭) proclaims: *\"The true position of cinnabar is not red—it comes to the southern palace in all seasons, belonging to the southern *Yáng* (阳) *Bǐng Dīng* (丙丁) Fire. Thus its form is red. Extract the mercury from cinnabar’s water-silver, belonging to the central *Yīn* (阴) *Jiǎ Yǐ* (甲乙) Wood, and its form becomes the Green Dragon’s likeness. Black lead’s original nature is not black—it internally embraces *huái yù* (怀玉), containing the Five Virtues (五德), belonging to the northern *Yīn* (阴) *Rén Guǐ* (壬癸) Water. Its form is black. Extract the refined essence from lead’s *jīng qì* (精气), pairing it with the western *Yáng* (阳) *Gēng Xīn* (庚辛) Metal, and its form becomes white—the White Tiger’s symbol.\"*\n\nAnother verse states:\n*\"When the Five Phases (五行) do not follow their natural order, the Dragon emerges wrapped in Fire.\nWhen the Five Phases are inverted through alchemy, the Tiger arises wrapped in Water.\"*\n\nThe *Jīn Dān Zhí Fù* (金丹职赋) further declares:\n*\"Fire, when bound and rotated, becomes the Dragon; Water, when turned westward, becomes the Tiger.\"*\n\nAnd the *Lǐ Bǐng Chán Gē* (李柄蟾歌) says:\n*\"Tài Yīn* (太阴) resides in the southern palace, *Tài Yáng* (太阳) faces north. The Fire of Wood is called mercury; the Water of Metal is called lead.\nWhen refined in the central palace’s vessel, their natures assist each other’s completion.\nWhen *Yīn* departs, *Yáng* is revealed—the Dragon and Tiger serve as proof.\nThe numinous Elixir of Dragon and Tiger has its efficacy; how could the smoke-chasers or the *Xuán Jīng* (玄精) types compare to those who attain the Great Elixir?\"*\n\nReflect again and again—there is no deviation. Do not trust the ignorant; their doubts obscure the true Dao.\n\n*Guāng Xuán* (光玄) further said: *\"The Master’s teachings on the Dao of *Huán Dān* (还丹) have fully illuminated the profound. I have heard that in the past, the King of Huái Nán (淮南王) refined *Qiū Shí* (秋石) and attained the Great Elixir, ascending to the heavens after ingestion. I do not know what *Qiū Shí* (秋石) is.\"*\n\n*\"Moreover, the *Dān Jīng* (丹经) often mentions the title *Shèng Wú Zhī* (圣无知), and the world claims it refers to green salt. I do not know if this is correct. I humbly pray the Master does not conceal the profound principles.\"*\n\nThe Master replied: *\"The King of Huái Nán (淮南王), Líu Ān (刘安), refined *Qiū Shí* (秋石) to achieve the Great Elixir—there is no other Elixir. The same substance has many names. The Sage acts according to the times, just as this.\"*",
      "overlap_context": " the division of the Great Elixir (大药), as well as the name of its position in the formula—it is not the mulberry (桑) character.\n\nThe common folk fail to grasp this truth, mistakenly identifying it with mere emptiness, like deer chasing sunlight or monkeys seeking reflections in water. Ultimately, what will they gain? Their efforts are but wasted labor.\n\nThe Great Elixir (大药) is purely the Five Phases (五行)—no other elements are involved. Mixing alum and minerals only leads to further confusion.»",
      "start_char": 8796,
      "end_char": 9657,
      "start_sentence": 426,
      "end_sentence": 466,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 18.00717043876648,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\金液还丹百问诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "绿金虎者，是丹之本色凝白，位属西方，主秋，故得其号，亦复黄芽、河车一类也。 圣无知者，亦是丹之心体，铅汞之深门，当五行制伏之时，自生肌骨，及万象包罗之日，血脉皆蒙。 仙人寻真不知，圣人思之不测，故号圣无知也。 更非别途。 岂是青盥，迷人错误之矣。 光玄曰：先生所云：药及五行成体，万象全身，铅汞相因，虎龙含孕，饵之则坚牢五藏，润泽皮肤，用之则制汞成金，回贫济物，是何理路，名曰大还神丹。 复是何神仙，初始知此妙道。 先生曰：金者水之子，汞者金之魄。 与五行相生，是一根，历万载而不能合体。 有陵阳子者，本是太初真哲，上古高人。 知此根源，秘为妙道。 故将南对北，用西对束，配此四方，不违中道。 一年运火，十月开炉，七返无亏，九还周足。 及龙飞魂返，虎伏魄归，故号曰紫金之妙诀，七返之神丹，此之谓也。 古歌曰； 九还七返三五一，龙虎相交入神室。 灰池炎烁天地精，金液还丹功乃毕。 光玄曰：先生开辟天路，大朗玄门，陈不死之方，示长生之卫。 尽知真伪，备见是非。 今者更有少疑，又须启问。",
      "translated_text": "「Lǜ Jīn Hǔ (绿金虎) is the original essence of the Elixir, its refined white form, belonging to the Western direction, governing autumn—hence its name. It is also of the same nature as *Huáng Yá* (黄芽, \"Yellow Sprout\") and *Hé Chē* (河车, \"River Vehicle\").\n\n*The Shèng Wú Zhī* (圣无知) is likewise the core essence of the Elixir, the profound realm of lead and mercury. At the time when the Five Phases (五行) are subdued, it spontaneously generates flesh and bones; when all phenomena are encompassed, it nourishes the blood vessels entirely.\n\nThe Daoist seeks the True without knowing, the Sage contemplates it beyond reckoning—thus the name *Shèng Wú Zhī* (圣无知). It is no other path.\n\nHow could it be *qīng yán* (青盐, \"green salt\")? Such a claim is a delusion leading others astray.\n\n*Guāng Xuán* (光玄) said: *\"The Master’s teachings—when the medicine aligns with the Five Phases to form its body, encompassing all phenomena, lead and mercury interdependently, the Tiger and Dragon in mutual gestation—when ingested, it fortifies the five viscera and moistens the skin; when applied, it transmutes mercury into gold, restores poverty and benefits others. What is this principle called? It is named the Great Return-to-the-God Elixir (大还神丹).*\n\n*What kind of Immortal knows this wondrous Dao? Who first discovered this marvelous method?*\n\nThe Master replied: *\"Gold is the offspring of water, mercury its vital essence. Together, they form the root of the Five Phases, enduring countless ages yet unable to coalesce. There was *Líng Yáng Zǐ* (陵阳子), originally a true sage of the primordial era, a lofty figure of antiquity. He knew this root’s source and kept it as a secret wondrous method.\n\nThus, he paired the South with the North, the West with the East, harmonizing these four directions without deviating from the Central Dao. One year of refining fire, ten months of furnace operation, seven returns without loss, nine returns to full completion. When the Dragon ascends and its spirit returns, the Tiger submits and its essence is restored—hence the name *Zǐ Jīn* (紫金, \"Purple Gold\") for this wondrous technique, the Elixir of Seven Returns (七返神丹). This is what is meant.*\n\nAn ancient verse says:\n*九还七返三五一，龙虎相交入神室。\n灰池炎烁天地精，金液还丹功乃毕。*\n\n*Guāng Xuán* (光玄) said: *\"The Master has opened the celestial path, illuminated the profound gate, revealed the method of immortality and demonstrated the safeguard of longevity. He discerns truth from falsehood, right from wrong. Now, though I still have minor doubts, I must again seek clarification.\"*",
      "overlap_context": ". I do not know what *Qiū Shí* (秋石) is.\"*\n\n*\"Moreover, the *Dān Jīng* (丹经) often mentions the title *Shèng Wú Zhī* (圣无知), and the world claims it refers to green salt. I do not know if this is correct. I humbly pray the Master does not conceal the profound principles.\"*\n\nThe Master replied: *\"The King of Huái Nán (淮南王), Líu Ān (刘安), refined *Qiū Shí* (秋石) to achieve the Great Elixir—there is no other Elixir. The same substance has many names. The Sage acts according to the times, just as this.\"*",
      "start_char": 9657,
      "end_char": 10088,
      "start_sentence": 467,
      "end_sentence": 486,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 8.47685432434082,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\金液还丹百问诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "切见世上之人，多求草药，将结水银，指岭南不是远途，言塞北只同户外。 遍求蘗卉，散采芳枝，赤芹莴苣之徒盈诸兜笼，章柳瓦松之类尽满筐箱，或梼末油煎水煮多时，或用地胆杵自然之汁，采田公草则洗了除根，人苋与马苋相兼，龙胆共兔丝共使，未成砂子，早望黄金，如此之流，如麻似蚁，至使资财散荡，役心力以荒狂，究竟无成，却怨天而恨地，未知此事，到底如何。 愿先生细赐开悟，兔怀迷昧，枉费心神。 先生曰； 人虽一类，乃有愚智万般，所禀不同，性情各异，智者暗通於心内，愚人不见於掌中。 亦如云气生而上天，瓦砾成而在地。 云气乃抑之而不住，瓦砾乃举之而不升。 愚知已然，改换安可。 且水银者，借阴之气，玄水之精，过万岁而方成形，与五金而为魂魄。 重之黝重於金，体洁乃不许尘侵，悉在目前，有何难睹。 夫草药者，春生夏长，秋落冬残，枝叶岂坚，根茎不久，制之斜成水沬，烧之则本是灰尘。 若将结制水银，可谓天悬地隔，足认无知之辈，苟利之徒、枉惑时人、言有成事。 居河北则指三昊有草，在岭南则云两蜀得成，尽是虚传，皆非实理。 相承既远，讹谬堪悲，智者则乃自明，愚者无因得达。 光玄曰：蒙先生之所说，得先生之所言，松楼之色显然，玉石之形迥尔，迷情尽破，滞意俄消。 未知草结水银，毕竟有否。 先生曰：龟毛长短，兔角纤厅。 光玄曰：草结既同龟毛兔角。 元而度世，此皆尘埃外士、山野奇人。 或绝粒数年，或修真多载，名字早登於仙籍，精华不散於三田，故饵服有灵，草名有效。 此可谓内真外应，表裹功全，岂不延年，岂不度世。 且凡流之者，不知至道，不晓真诠，贪爱不休，苟求无已，为积玉可延於算寿，为堆金可驻於年华，唯恣骄矜，常营奢侈，无一日不闲滋味，无一时不爱绮罗，七窍长流，三田不固。 任是万般灵药，服饵徒然，直饶九转神丹也应无益。 如此之辈，悯之不及。 尔但依吾所教，必获大道矣。 光玄又曰：金华大道，神水玄门，得之者白鹿可乘，西游昆岭。 遇之者青牛可驾，束看扶桑。 同天地之久长，见江河之变改，岂期偶因游骯，获遇真流。 不以凡昧之人，尽赐幽玄之术，不差毫厘之细，匪谬纤发之遗。 尹君昔授真文，诚为可祖。 太上之生徐甲，同是深恩。 负荷莫胜，顾盼无已。 今欲收拾药类，备办资绿，只向此山研穷烧制，未知达士深意如何，再乞指陈，愿依尊诲。 先生曰：此□ 妙道世上希奇，尔能尽知，切须保秘，勿与非人言论，勿与非道交游，稍忽轻泄天机，轻传下类，不唯殃尔七祖，亦乃灭尔一身。 切在秘藏，莫同常事。 此山虽是名岳，且近大都。 今值兵革方兴，干戈已作，摇动四海，践踏中原，此山多戎兵往复之乡，黎庶潜窜之地，那堪烧炼至药，岂可修制神丹。 昊越极有深山，江浙不少福地，或罗浮、茅岭，或庐山、天台，目下并安，亦复无事，乃是众圣依柄之地，群贤止泊之方。 尔可选彼深幽，就其佳胜，修持大药，烧制金丹，必获无魔，定登天路。 吾之所说，悉无谬言。 尔便遵吾，勿怀疑虑。",
      "translated_text": "The world sees many who seek only crude herbs,\nbinding mercury in haste—\n*\"The southern hills are not distant,\"* they say,\n*\"nor the northern wastes far from home.\"*\n\nThey scour the earth for roots and shoots,\nplucking fragrant branches in vain:\nred *qín* and *wūjū* fill their baskets,\n*zhāngliǔ* and *wǎsōng* overflow their chests.\nSome boil with sesame oil for endless hours,\nothers crush *dìdǎn* to draw its natural juice.\nThey wash *tiángōngcǎo* clean of roots,\nmix *rénxiàn* with *mǎxiàn* in equal measure,\ncombine *lóngdǎn* with *tùsī*—\nyet before the powder forms,\nthey already dream of golden elixir.\n\nSuch fools are as ants in number,\nsquandering wealth, exhausting their spirits in folly,\nyet when no result comes,\nthey rail at heaven and earth—\nunaware how to proceed.\n\nI beg the Master to clarify my confusion,\nto dispel my ignorance,\nlest I waste my life in vain.\n\nThe Master said:\n*\"Though all are human, wisdom varies as the clouds.\nSome grasp truth in their hearts unseen,\nwhile others, though it lies before them,\ncannot see it—\nlike clouds that rise to heaven\nor stones that sink to earth.\nOne cannot press clouds to stay,\nnor lift stones to fly.\nFate is set; change is impossible.*\n\n*\"Yet mercury—\nthat borrowed *yin* essence,\nthe refined *xiǎnshuǐ* of the void—\ntakes ten thousand years to form,\nits spirit bound to the five metals.\nHeavy as gold, yet pure as jade,\nuntainted by dust—\nwhy should it elude the eye?\n\n*\"But herbs?\nSpring they sprout, summer they grow,\nautumn they wither, winter they die.\nTheir stems are frail, their roots fleeting—\nboiled, they turn to sludge;\nburned, they crumble to ash.\nTo bind them with mercury?\nHeaven and earth lie between—\nfools who claim success,\ndeceiving the world with empty words.\n\n*\"Some say, *'In the north, the Three Sovereigns’ herbs grow,’*\nothers, *'In the south, Shu’s elixir thrives.’*\nAll false tales, spun from ignorance.\nPassed down through ages, twisted beyond truth.\nThe wise see clearly;\nthe foolish remain lost.\"*\n\nGuāng Xuán said:\n*\"By the Master’s words, my doubts dissolve—\nthe pine’s green now clear,\nthe jade’s form revealed.\nYet still I wonder:\nCan herbs truly bind mercury?\"*\n\nThe Master replied:\n*\"Tortoise hair grows long,\nrabbit horns are fine—\nyet both are myths.\"*\n\nGuāng Xuán said:\n*\"If herbs cannot bind mercury,\nthen those who claim to transcend the world—\nhermits who fast for years,\nadepts who refine for decades—\nwhose names are recorded in the Celestial Register,\nwhose essence does not scatter in the Three Fields—\nhow do they achieve such power?\nHow do their elixirs work?\nThis is true within, manifest without—\na complete alchemical art.\nDoes it not prolong life?\nDoes it not transcend the world?\n\n*\"Yet common folk—\nignorant of the Dao,\nunaware of true teachings—\ngreedy for gain,\nobsessed with wealth,\nthey hoard jade to extend their years,\npile gold to preserve their beauty,\nyet indulge in every pleasure,\ndress in silks, feast without end.\nTheir orifices leak,\ntheir Three Fields grow weak.\nEven the Nine-Turn Elixir would fail them.\nPity them, if pity could reach them.\n\n*\"But follow my teachings,\nand you shall grasp the Great Dao.\"*\n\nGuāng Xuán said:\n*\"The Golden Flower’s path,\nthe Mystic Water’s gate—\nthose who attain it ride white deer to Kunlun,\ndrive green oxen toward the East.\nThey endure as heaven and earth,\nwitness the rivers’ changes.\nHow fortunate to meet such truth,\nto learn from the genuine transmission!\n\n*\"The Master does not teach the ignorant,\nnor err by a hair’s breadth.\nEmperor Yán once received the True Text—\na debt of deepest gratitude.\nThe Celestial Sovereign’s birth of Xu Jié—\nanother boundless kindness.\nI am overwhelmed, speechless with awe.\n\n*\"Now I would gather herbs,\nprepare provisions,\nand refine them here in this mountain.\nBut I fear the Master’s wisdom may differ.\nI beg further instruction,\nto follow your guidance.\"*\n\nThe Master said:\n*\"This wondrous Dao is rare in the world.\nIf you truly understand,\nguard it as your life—\ndo not speak of it to the unworthy,\ndo not associate with those who do not know.\nA single careless word,\na hint to the uninitiated,\nwill bring ruin to your seven generations,\nand destroy yourself.\n\n*\"Keep this secret as you would treasure.\nThough this mountain is a famous peak,\nit lies near the capital,\nwhere war now rages—\nweapons shake the four seas,\nthe heartland is trampled.\nThis is a land of marching armies,\na refuge for the fleeing masses.\nHow could one refine the elixir here?\nHow dare one forge the divine pill?\n\n*\"Far beyond, in the lands of the *Hàoyuè*,\nor in Jiang-Zhe’s blessed regions—\nwhether at Luofu, Maoling,\nor Lushan, Tiāitái—\nthese places are now at peace,\nsanctuaries of the sages.\nChoose a hidden valley,\na sacred spot,\nand there refine the Great Medicine,\nforge the Golden Elixir.\nYou shall be free of calamity,\nand surely ascend to heaven.\n\n*\"My words are true—\nfollow them without doubt.\"*",
      "overlap_context": "d—hence the name *Zǐ Jīn* (紫金, \"Purple Gold\") for this wondrous technique, the Elixir of Seven Returns (七返神丹). This is what is meant.*\n\nAn ancient verse says:\n*九还七返三五一，龙虎相交入神室。\n灰池炎烁天地精，金液还丹功乃毕。*\n\n*Guāng Xuán* (光玄) said: *\"The Master has opened the celestial path, illuminated the profound gate, revealed the method of immortality and demonstrated the safeguard of longevity. He discerns truth from falsehood, right from wrong. Now, though I still have minor doubts, I must again seek clarification.\"*",
      "start_char": 10088,
      "end_char": 11263,
      "start_sentence": 487,
      "end_sentence": 527,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 12.361433267593384,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\金液还丹百问诀.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "光玄曰； 弟子一个微生，二仪外物，学调气焉未柔，每於三田，不遇玄珠，几许虚度百岁，岂谓忽逢真哲，大央疑情，三清之路港通，金液之功毕见。 恩深渤淤，荷重丘山，未知微命，将何所报。 先生曰：尔之有际会於吾。 吾有幽玄，悉付於汝。 吾见人事扰扰，世路忙忙，不知球露之身，但贪荣禄。 岂觉风灯之命，唯务生涯。 如此之流，吾足悯矣。 尔但将吾所论，录吾所传，流布世问，行於世上，提携有分，接引群情，便是报吾之恩，余无所托。 尔乃亦要精专修炼，早陆云衢，壶中之日月全殊，洞裹之乾坤颇别，莫於人世，久恋繁华。 听之慎之，远诸非类。 光玄闻已，两泪再拜，立在一边。 先生曰：尔於海上，曾饮玄酒已否。 光玄曰：凡流未曾遭遇。 先生乃於竹杖上取一瓢，令光玄於涧泉汲水。 光玄乃携瓢下山，於石泉之中取水，将到先生前，先生接得，接下一半於地，只余一半，便取药一丸。 如蒙豆许，作红紫之色，投入瓢中，以树叶塞口，坐於树石之上，良久成酒，红紫馨香扑鼻，有异於人问之酒。 先生自饮一盏，所有尽令光玄饮之。 饮讫，顿觉神情爽朗，肢节宽舒，不并常时，身同象外。 乃再拜感谢先生，讫而立。 先生曰：时已暮矣，汝且自归所止。 吾绿劳倦，欲往后山，只在峰南，近水有一草庵，便是吾住止。 尔若无事，但来相访。 光玄曰：弟子无事，欲送先生归去所止之处，得否。 先生曰：吾已困矣，计汝亦疲倦。 但且归去，明日过山觅来。 言讫，便携竹杖南去，行步如飞，虽有一径以通，望先生若片云之渡岭，瞥然不见。 光玄怅望，却归山寺之中，一夜不眠。 乞得晓色才分，寻其往路，更无疑滞，直过峰南，径路全无，松萝蔽日，涧水与哀猿不辨，白云共飞乌相随，不睹一人，空瞻南仞。 光玄乃知先生非居凡世，岂是常人。 怅望再三，悲思莫及。 便回所止，写先生所言之秘论，流布世问，用求同好上士君子，幸宜思究之矣。 金液还丹百问诀竟 ＃１『彩】字原本作『见J，据《海客论》改。",
      "translated_text": "Guangxuan said: *\"A humble disciple I am—\na mortal among the myriad things beyond the Two Principles,\nmy cultivation of qi still unrefined.\nOften at the Three Fields,\nI fail to encounter the Mysterious Pearl,\nwasting countless years in vain.\nYet now, by fortune, I meet a True Sage—\nmy doubts dissolve as the Three Purity Paths open,\nthe alchemical work of the Golden Elixir fully revealed.\nYour kindness is as deep as the Bohai’s depths,\nyour favor as heavy as the mountains.\nI know not how to repay it.\n\nThe Master said: 'Your fate has brought you to me.\nI possess profound mysteries—\nall now entrusted to you.\nI see the world’s affairs in turmoil,\nmen rushing along the Way,\nunaware their bodies are but dew on a sphere,\nyet greedy for honor and wealth.\nThey fail to grasp their fleeting lives,\nonly toiling for worldly survival.\nSuch fools—how I pity them!\nYou must record what I teach,\nspread my transmission far and wide,\nuplifting those with affinity,\nguiding the multitude.\nThis is how you repay my kindness.\nI ask no more.\n\nBut you must also cultivate with single-minded devotion,\nascend swiftly to the celestial paths.\nThe sun and moon within the jar are entirely transformed,\nthe cosmos in the cave is utterly distinct—\ndo not linger long in this mortal world,\nlost in its fleeting glories.\nListen carefully, be vigilant,\nand keep away from the unworthy.\"*\n\nGuangxuan heard these words,\nhis tears flowing as he bowed twice,\nstanding aside.\n\nThe Master asked: *\"Have you ever drunk the Mysterious Wine upon the seas?\"*\nGuangxuan replied: *\"Never in my life.\"*\n\nThe Master then took a gourd from his bamboo staff\nand instructed Guangxuan to draw water from the mountain stream.\nGuangxuan descended, filled the gourd from the stone spring,\nand presented it to the Master.\nThe Master took it, poured half onto the ground,\nleaving only half.\nHe then took a single pill—\nthe size of a yellow soybean,\nglowing red and violet—\nand dropped it into the gourd.\nHe sealed it with a leaf,\nsat upon a rock,\nand after some time,\nthe gourd transformed into wine,\nits red-violet fragrance unlike any mortal brew.\nThe Master drank first,\nthen commanded Guangxuan to finish it.\nUpon drinking,\nGuangxuan felt his spirit brighten,\nhis limbs relax beyond measure,\nhis body transcending the ordinary.\n\nHe bowed in gratitude,\nthen stood.\n\nThe Master said: *\"The hour grows late.\nReturn to your lodging.\nI am weary and will go to the rear mountain—\na grass hut near the southern peak,\nby the water’s edge.\nCome visit if you have time.\"*\n\nGuangxuan said: *\"If I have no other business,\nmay I escort you to your dwelling?\"*\n\nThe Master replied: *\"I am exhausted,\nand you must be weary as well.\nGo now and return tomorrow to seek me out.\"*\n\nWith that, he took his bamboo staff\nand vanished southward,\nhis steps swift as flying clouds.\nThough a path existed,\nthe Master seemed to traverse it like a cloud crossing a ridge—\ngone in an instant.\nGuangxuan gazed after him in longing,\nthen returned to the mountain temple,\nsleepless through the night.\n\nAt dawn’s first light,\nhe sought the way once more,\nbut found no trace—\nno path led south,\npine moss blotted out the sun,\nthe stream’s murmur mingled with the mournful cries of monkeys,\nwhite clouds drifted with the crows,\nand not a soul was seen.\nOnly the southern peak loomed empty before him.\n\nGuangxuan knew the Master was no ordinary man,\nnor of this mundane world.\nHe sighed repeatedly,\nhis sorrow beyond words.\nHe then returned to his lodging,\nrecorded the Master’s secret teachings,\nand spread them among the world,\nhoping those of like mind might ponder them deeply.\n\nThus ends the *Hundred Questions on Golden Elixir Alchemy*.\n*(Note: The original text had \"见\" [seen], corrected here to \"问\" [world/people] based on the *Sea Guest Treatise*.)*",
      "overlap_context": "refuge for the fleeing masses.\nHow could one refine the elixir here?\nHow dare one forge the divine pill?\n\n*\"Far beyond, in the lands of the *Hàoyuè*,\nor in Jiang-Zhe’s blessed regions—\nwhether at Luofu, Maoling,\nor Lushan, Tiāitái—\nthese places are now at peace,\nsanctuaries of the sages.\nChoose a hidden valley,\na sacred spot,\nand there refine the Great Medicine,\nforge the Golden Elixir.\nYou shall be free of calamity,\nand surely ascend to heaven.\n\n*\"My words are true—\nfollow them without doubt.\"*",
      "start_char": 11264,
      "end_char": 12053,
      "start_sentence": 528,
      "end_sentence": 561,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 72.84464812278748,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\金液还丹百问诀.txt",
        "category": "方法类"
      }
    }
  ]
}