{
  "source_id": "金箓解坛仪",
  "source_file": "chunked_daozang\\金箓解坛仪.json",
  "total_chunks": 4,
  "total_original_chars": 1629,
  "total_translated_chars": 12272,
  "total_translation_time": 36.378607749938965,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓解坛仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**The Golden Seal Ritual for Dissolving the Altar Ceremonies**\n\n**Title:** *Golden Seal Ritual for Dissolving the Altar Ceremonies* (Jīn guān jiě tán yí)\n**One scroll.**\n**Source:** *Zhèngtǒng Dàozàng* (Daoist Canon of the Zhengtong Era), *Dòngxuán Bù* (Taoist Mysticism Section), *Wēiyí Lèi* (Ceremonial Etiquette Category).\n\n**Ritual Procedures and Invocations as Prescribed:**\n\n**East (Dōngfāng)**\nEast, the Nine *Qi*, the Sovereign’s Azure Heaven.\nThe Emerald Mist obscures the heights; within lies the Old Man.\nHe oversees the sacred diagrams and records, gathering *qi* to summon the Immortals.\n\n**South (Nánfāng)**\nSouth, the Vermilion Heaven, the Jade Hall of the Red Sovereign.\nWithin dwells the Great God, called the Red Sovereign.\nFlames ascend with billowing smoke; the Three *Qi* radiate brilliance.\nThe Immortals receive their mandate; they gather in response to the Sun’s call.\n\n**West (Xīfāng)**\nWest, the White Heaven, the Seven-Gated White Sovereign.\nThe Golden Spirit shines resplendent; the Great Flower emits its aura.\nWhite stones tower grandly; the Seven *Qi* bind tightly.\nAbove sits the First-Born Sovereign, the Ancient God.\nHe commands the *Qi* of the lungs, oversees the Nine Heavens,\nverifies the sacred diagrams, and summons the Immortals above.\n\n**North (Běifāng)**\nNorth, the Dark Heaven, the Five *Qi* drifting about.\nWithin sits the Black Sovereign, the Twin Sovereigns of the Great Enclosure.\nHe governs the talismans and decrees, refining the Immortals’ Eight Auras.\nGreen robes with feathered hems, dragon script and phoenix patterns.\nThe Supreme Lord summons them; they descend to the Jade Terrace.\n\n**Central (Zhōngyāng)**\nCentral, the Supreme Spirit, the Yellow Heavenly Primordial.\nThe First-Born Five Ancients, the Central Yellow Most Venerable.\nHe gathers the *Qi* and guards the True Essence, commanding all Immortals.\nHe holds the sacred records, the ancient tablets of jade script.\nHe urges the ascent of the Heavenly *Qi*, proclaiming to all the Gods.\n\n**Striking the Ritual Drum Twenty-Four Times (Wū fǎ gǔ èrshísì tōng)**\nThe Supreme Three Heavens—*Xuán Yuán Shǐ* (Mysterious Primordial Origin) and the Three *Qi*—the Most High Sovereign of the Dao (Tàishàng Lǎojūn),\nsummons forth his ministers: the Three-Five Functionaries, the Left and Right Officials, the Messengers, the Left and Right Attendants bearing incense, the Dragon-Cavalry Officers of the Sacred Relay, the Golden Boys who serve incense, the Jade Girls who convey messages and scatter flowers, and the Thirty-Six Officers of the Five Sovereigns, each bearing a talisman, a direct seal, and the Sun’s incense.\n\n**Those who appear** must don their formal robes and adorned headgear, their sashes and trailing plumes.\n**The ritual opens the Dark Altar and the local deities**, as well as the spirits of the domain.\n\n「Now the臣 humbly dissolves the altar and dismisses the assembly, reporting the completion of the rites and humbly presenting their sincerity.\n\nWith reverence, the臣 obeys and receives the Sacred Lord’s manifold precious *dharma* (丹悃), fully inscribed and sealed in the scriptures.\n\nMay the Supreme Lord’s most exalted and true Dao/Way’s *qi* (炁), the luminous treasure of the Mysterious Primordial Origin, descend and flow into the臣’s body, so that the臣’s invoked sincerity swiftly reaches the Most High Sovereign’s presence—before the Supreme and True, Boundless Dao/Way of the Three Pure Ones and the Most Holy Celestial Emperor of Golden Gates and Jade Sovereign.\n\nThe臣 requests that the sacred rank be proclaimed, and the臣 and all others of their law, past and present, now burn incense and surrender their bodies, their spirits, and their fates to the Supreme, Ten-Directions Illuminous Treasure, the Natural and True, Boundless Dao/Way.\n\nThe臣 hears that the Three *Qi* (箓) were bestowed as teachings, and the Five *Sutra* (篇) were established as models. The Dao/Way’s edicts flourish, and the Mysterious winds are grandly expounded. The rites were founded in imitation of Heaven and likeness of Earth, invoking the dark and summoning the bright to stabilize and pacify the celestial scriptures and clouds.\n\nThe Thousand True Ones descend their chariots, and the Ten Thousand Saints appear at the hall. The solemn vows ascend to the layered heavens, while the divine presence descends to the sacred assembly. The臣 prays for Heaven’s eternal command and gathers blessings to prolong auspiciousness.\n\nNow, having fulfilled their vows and completed the morning rites, the臣 dissolves the altar and dismisses the assembly, first confessing their shortcomings. May the Sacred Lord bestow favorable omens and secure the stability of the ancestral lineage and state.\n\nThe Golden Dragon’s scripture rises, celebrating the perfect completion of the *jiào* (醮) rites; the Jade *Wèi* (纬) shines forth, descending abundant blessings of prosperity. The invoked Mysterious responses ascend directly to the Most High Sovereign’s presence—before the Supreme and True, Boundless Dao/Way.\n\nThe rites are now complete, and the臣, along with all who follow the law, wholeheartedly repent and confess. They surrender their bodies, their spirits, and their fates to the Supreme, Boundless Dao/Way of the Illuminous Treasure, Heaven’s Most Exalted Lord.\n\nWith humble reverence, the臣 awaits the Great Compassion’s boundless grace, hoping for the vast mercy that permeates all. They pray that the Sacred Lord’s abundant blessings descend upon them as they dissolve the assembly, conclude the fast, and burn incense in homage to the Saints.\n\nThe臣 hears that the scriptures and transmitted teachings of the Jade Precepts (玉局) prescribe the Mysterious *Sutra* (玄灵) for the rites of averting calamity, and the Golden Precepts (金科) of the Purple Extremes (紫极) grant petitions of prayer and supplication.\n\nThe臣 and their followers, in obedience to the Imperial edicts, solemnly revere the Golden *Qi* (箓) and gather grand auspicious blessings, establishing the Orchid Field (兰场) and spreading the Mysterious models (玄范). They fear that their ascent and descent may deviate from the Secret Rituals (密勿), or that their reverence may fail to align with the Sacred Reflections (精修).\n\nAt this moment of dissolving the assembly, they earnestly offer their first confession of transgressions. With humble reverence, the臣 hopes that the Four Officials and Five Sovereigns will specially extend their forgiveness, and the Nine Departments and Three Officials will generously bestow their purifying grace.\n\nWith the rites perfected and the fruits fulfilled, may the blessings endure as long as Earth and Heaven. All wishes shall be granted, and their sincerity shall be clearly revealed.\n\nThe臣 and their followers bow their heads in devotion, offering three salutations and three rites of gratitude to the Supreme Three Treasures (三宝). Three salutations, three rites.»\n\nThe **Ritual of Invoking the True Scriptures**—with repeated invocation of the sacred ranks—**the humble臣**, surname [Certain], in earnest reverence, humbly presents this petition to the **Supreme Dao of the Unexcelled and Limitless Way, the Primeval Sovereign of Heaven** (太上无极大道元始天尊),\nthe **Supreme Dao Sovereign** (太上道君),\nthe **Supreme Lord of the Dao** (太上老君),\nthe **Unexcelled Mysterious Elder, the Tenfold Sacred Treasures of All Directions, the Sovereign of Heaven** (无上玄老十方灵宝天尊),\nthe **already attained Dao Immortals and Great Saints** (已得道大圣众),\nthe **Most Authentic Celestial Lords and Venerable Masters** (至真诸君丈人),\nthe **Thirty-Six Departments of Sacred Scriptures** (三十六部尊经),\nthe **Great Lawmaster of the Mysterious** (玄中大法师),\nthe **Great Lawmaster of the Three Heavens** (三天大法师),\nthe **Supreme Chancellor and Prime Minister, Supreme Guardian and Preceptor, Four Teachers and Five Sovereigns** (上相上宰、上保上傅、四师五帝),\nthe **Celestial Astral Hall and Martial Array, the River and Milky Way’s Multitudes of Immortals, the officials of the Three Realms** (星宫斗府、河汉群真、三界官属),\nand **all manner of august and numinous beings** (一切威灵).\n\n**The臣** and their followers, through past karmic ties, humbly encounter this sacred era (恭逢圣运).\nNow, having completed the morning rites and fulfilled the ceremonial audience, **the臣** gathers this auspicious cause to pray:\n*\"May the Imperial Vision and Heavenly Broadness be ever renewed,\nAnd the Sovereign’s Virtue daily flourish.\nMay the years be as vast as the **Arrow and Dipper Constellations** (箕翼),\nAnd the lifespan as firm as the **Heavenly Cauldron** (中壶) and the **Ganling Mountains** (固冈陵).\nMay the ancestral and branch states remain steadfast as protective screens,\nAnd the heirs extend the blessings of longevity.\nMay the ministers be wise and virtuous,\nAnd the people rejoice in nurturing governance.\"*\n\nHumbly praying that **the Sovereign’s benevolent will ascend above**,\nAnd **the radiant grace descend below** (景贶下临).\nMay the realm and its borders be harmonized by signs of peace,\nAnd the ancestral temple and state be united by omens of perfect auspice (元吉).\n\n**The臣** follows the prescribed rituals, erecting a pure altar,\nAnd offers sincere devotion, mirroring Heaven and modeling Earth (法天像地).\nMay the Six Dynasties’ Dao be fulfilled,\nAnd all thoughts return to the True Way (一念皈真).\nWhen the merit is complete and the rites perfected,\nMay the Celestial Hosts return to their proper stations (诸天复位).\n\n**The臣’s** retinue, including those bearing official insignia and those performing duties at the altar,\nAll who respond to summons, guard the sacred rites, and maintain the fasts—\nTogether, they have rendered meritorious service (并有勋绩).\nThus, **the臣** respectfully declares their deeds,\nAnd presents their sincere petition (进呈素悃),\nSeeking, according to the established grades, a special grant of mercy.\nHumbly praying for **the Supreme Three Treasures’** compassionate favor (特乞慈容).\n\nAll memorial texts are now respectfully submitted for proclamation.\n**Proclamation of the Memorial** (宣表).\n\nReturn the memorial tablet and burn the **Twelve Vows**, preserving the spirit while offering incense.\nThe incense officials and messengers, the Left and Right Dragon-Tiger Lords, and the attendant spirit officials of incense—\nLet them now command that the places where **the臣** formerly dissolved the altar and dispersed the feast\nShall naturally give rise to golden elixirs, blue-green herbs, and the hundred spirits of the elysian realm,\nAll converging here before the incense brazier.\n\n**First Wish:** May the ten-direction celestial youths and jade maidens receive **the臣’s** sincere petition,\nAnd through fragrant clouds swiftly convey it to the **Supreme Dao of the True and Limitless Great Way**,\nBefore the **Three Pure Ones**, the **Most High Sovereign of the Golden Gate**, the **Jade Emperor of the Highest Heaven**,\nAnd the **Celestial Sovereign’s** august presence.\n\n**Exiting the Hall and Reciting Praises, Descending the Altar:**\nAt the city gates, **the臣** stands to take leave of the **Three Treasures**,\nHaving completed the morning rites and presented the response to the clouds.\n**The Dao** transcends emptiness, its grace encompassing the world.\nThe imperial plan endures as the earth, the sacred life matching the heavens.\n\n**Bowing in reverence and taking leave of the Ten-Direction Dao Treasures:**\nThe golden boys record virtues, the jade maidens proclaim merits.\nNames inscribed on golden tablets, scriptures stored in sacred repositories.\nMay **the Sovereign’s** majesty be honored, blessings gathered for the realm.\n\n**Bowing in reverence and taking leave of the Ten-Direction Scripture Treasures:**\nThe **chime’s** echoes fade, the sacred seals dissolve into mist.\nThe master returns to **Tai Qing**, blessings flowing to the family and state.\nThe **Mysterious Wind** spreads far, the **Dao’s** transformations flourish.\n\n**Bowing in reverence and taking leave of the Ten-Direction Teacher Treasures:**\nMay all sentient beings refrain from evil and cultivate goodness,\nFree from karmic bonds, ever dwelling in an age of prosperity.\nAll conscious beings together realize **non-action (wuwei)**.\n\n**Bowing in reverence and taking leave of the Ten-Direction Holy Ones:**\n**The臣** formerly led the procession to the **Hall of Silent Contemplation**,\nTo thank the master—\nNow the **golden talisman** is dissolved, the altar rites concluded.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "金箓解坛仪 经名：金箓解坛仪。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 金箓解坛仪 法事如式 各礼师，存念如法 请宣神咒 东方 东方九炁，始皇青天。 碧霞郁垒，中有老人。 总校图录，摄炁举仙。 南方 南方丹天，赤帝玉堂。 中有大神，号曰赤皇。 上炎流烟，三炁勃光。 神仙受命，应会太阳。 西方 西方素天，白帝七门。 金灵皓映，大华流氛。 白石峨峨，七炁捆缊。 上有始生，皇老大神。 总领肺炁，主校九天。 检定图录，制召上仙。 北方 北方玄天，五炁徘徊。 中有黑帝，双皇太微。 总领符命，仙炼八威。 青裙羽，龙文凤衣。 上帝所举，制到玉阶。 中央 中央总灵，黄上天元。 始生五老，中黄高尊。 摄炁监真，总领群仙。 典录玄图，宿简玉文。 催运上炁，普告万神。 呜法鼓二十四通 无上三天玄元始三炁太上老君，召出臣身中三五功曹、左右官使者、左右捧香驿龙骑吏、侍香金童、传言散花玉女、五帝直符直日香官各三十六人出。 出者，严装显服，冠带垂缨。 关启玄坛土地，方域神真。",
      "translated_text": "**The Golden Seal Ritual for Dissolving the Altar Ceremonies**\n\n**Title:** *Golden Seal Ritual for Dissolving the Altar Ceremonies* (Jīn guān jiě tán yí)\n**One scroll.**\n**Source:** *Zhèngtǒng Dàozàng* (Daoist Canon of the Zhengtong Era), *Dòngxuán Bù* (Taoist Mysticism Section), *Wēiyí Lèi* (Ceremonial Etiquette Category).\n\n**Ritual Procedures and Invocations as Prescribed:**\n\n**East (Dōngfāng)**\nEast, the Nine *Qi*, the Sovereign’s Azure Heaven.\nThe Emerald Mist obscures the heights; within lies the Old Man.\nHe oversees the sacred diagrams and records, gathering *qi* to summon the Immortals.\n\n**South (Nánfāng)**\nSouth, the Vermilion Heaven, the Jade Hall of the Red Sovereign.\nWithin dwells the Great God, called the Red Sovereign.\nFlames ascend with billowing smoke; the Three *Qi* radiate brilliance.\nThe Immortals receive their mandate; they gather in response to the Sun’s call.\n\n**West (Xīfāng)**\nWest, the White Heaven, the Seven-Gated White Sovereign.\nThe Golden Spirit shines resplendent; the Great Flower emits its aura.\nWhite stones tower grandly; the Seven *Qi* bind tightly.\nAbove sits the First-Born Sovereign, the Ancient God.\nHe commands the *Qi* of the lungs, oversees the Nine Heavens,\nverifies the sacred diagrams, and summons the Immortals above.\n\n**North (Běifāng)**\nNorth, the Dark Heaven, the Five *Qi* drifting about.\nWithin sits the Black Sovereign, the Twin Sovereigns of the Great Enclosure.\nHe governs the talismans and decrees, refining the Immortals’ Eight Auras.\nGreen robes with feathered hems, dragon script and phoenix patterns.\nThe Supreme Lord summons them; they descend to the Jade Terrace.\n\n**Central (Zhōngyāng)**\nCentral, the Supreme Spirit, the Yellow Heavenly Primordial.\nThe First-Born Five Ancients, the Central Yellow Most Venerable.\nHe gathers the *Qi* and guards the True Essence, commanding all Immortals.\nHe holds the sacred records, the ancient tablets of jade script.\nHe urges the ascent of the Heavenly *Qi*, proclaiming to all the Gods.\n\n**Striking the Ritual Drum Twenty-Four Times (Wū fǎ gǔ èrshísì tōng)**\nThe Supreme Three Heavens—*Xuán Yuán Shǐ* (Mysterious Primordial Origin) and the Three *Qi*—the Most High Sovereign of the Dao (Tàishàng Lǎojūn),\nsummons forth his ministers: the Three-Five Functionaries, the Left and Right Officials, the Messengers, the Left and Right Attendants bearing incense, the Dragon-Cavalry Officers of the Sacred Relay, the Golden Boys who serve incense, the Jade Girls who convey messages and scatter flowers, and the Thirty-Six Officers of the Five Sovereigns, each bearing a talisman, a direct seal, and the Sun’s incense.\n\n**Those who appear** must don their formal robes and adorned headgear, their sashes and trailing plumes.\n**The ritual opens the Dark Altar and the local deities**, as well as the spirits of the domain.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 445,
      "start_sentence": 0,
      "end_sentence": 39,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 9.940139532089233,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓解坛仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "臣今解坛散席，进愫言功。 钦奉其诸丹悃，具载缄誊。 愿得太上至真道炁灵宝瑞光下降，流入臣等身中，令臣所启之诚，速达径御至真无极大道三清上圣昊天至尊金阙玉皇上帝御前。 请称法位 具位臣姓某等今故烧香，皈身皈神皈命，太上十方灵宝自然至真无极大道。 臣闻，三箓垂科，五篇着范。 茂弘道旨，丕阐玄风。 法天像地而肇建坛仪，呼阴召阳而镇安云篆。 千真降驾，万圣临轩。 斋盟上格於层霄，真驭下临於法席。 祈天永命，集福延禧。 今则启愿告成，朝修竣事，解坛散席，首过陈情，祇降嘉祥，尊安宗社。 金龙起篆，庆圆满於醮功； 玉纬流光，降洪厖之景福。 所启玄感上彻，径御至真无极大道御前。 礼方 忏悔 臣法众等志心皈身皈神皈命，十方无极大道太上灵宝天尊。 恭望洪慈，洞垂巨泽，普降洪恩，以今解席告斋，焚香礼圣。 臣闻，经传玉局，玄灵启度厄之仪； 教演金科，紫极许祷祈之请。 臣等钦奉纶音，崇修金箓，茂集鸿禧，开建兰场，敷杨玄范。 虑陟降有乖於密勿，恐存神罔合於精修。 兹当解席之期，庸致首愆之祷。 恭望四司五帝，特宽宥过之恩； 九府三官，诞布涤瑕之泽。 功圆果备，地久天长，万愿克从，一诚昭彻。 臣等志心稽首，礼谢无上正真三宝。 三启 三礼",
      "translated_text": "「Now the臣 humbly dissolves the altar and dismisses the assembly, reporting the completion of the rites and humbly presenting their sincerity.\n\nWith reverence, the臣 obeys and receives the Sacred Lord’s manifold precious *dharma* (丹悃), fully inscribed and sealed in the scriptures.\n\nMay the Supreme Lord’s most exalted and true Dao/Way’s *qi* (炁), the luminous treasure of the Mysterious Primordial Origin, descend and flow into the臣’s body, so that the臣’s invoked sincerity swiftly reaches the Most High Sovereign’s presence—before the Supreme and True, Boundless Dao/Way of the Three Pure Ones and the Most Holy Celestial Emperor of Golden Gates and Jade Sovereign.\n\nThe臣 requests that the sacred rank be proclaimed, and the臣 and all others of their law, past and present, now burn incense and surrender their bodies, their spirits, and their fates to the Supreme, Ten-Directions Illuminous Treasure, the Natural and True, Boundless Dao/Way.\n\nThe臣 hears that the Three *Qi* (箓) were bestowed as teachings, and the Five *Sutra* (篇) were established as models. The Dao/Way’s edicts flourish, and the Mysterious winds are grandly expounded. The rites were founded in imitation of Heaven and likeness of Earth, invoking the dark and summoning the bright to stabilize and pacify the celestial scriptures and clouds.\n\nThe Thousand True Ones descend their chariots, and the Ten Thousand Saints appear at the hall. The solemn vows ascend to the layered heavens, while the divine presence descends to the sacred assembly. The臣 prays for Heaven’s eternal command and gathers blessings to prolong auspiciousness.\n\nNow, having fulfilled their vows and completed the morning rites, the臣 dissolves the altar and dismisses the assembly, first confessing their shortcomings. May the Sacred Lord bestow favorable omens and secure the stability of the ancestral lineage and state.\n\nThe Golden Dragon’s scripture rises, celebrating the perfect completion of the *jiào* (醮) rites; the Jade *Wèi* (纬) shines forth, descending abundant blessings of prosperity. The invoked Mysterious responses ascend directly to the Most High Sovereign’s presence—before the Supreme and True, Boundless Dao/Way.\n\nThe rites are now complete, and the臣, along with all who follow the law, wholeheartedly repent and confess. They surrender their bodies, their spirits, and their fates to the Supreme, Boundless Dao/Way of the Illuminous Treasure, Heaven’s Most Exalted Lord.\n\nWith humble reverence, the臣 awaits the Great Compassion’s boundless grace, hoping for the vast mercy that permeates all. They pray that the Sacred Lord’s abundant blessings descend upon them as they dissolve the assembly, conclude the fast, and burn incense in homage to the Saints.\n\nThe臣 hears that the scriptures and transmitted teachings of the Jade Precepts (玉局) prescribe the Mysterious *Sutra* (玄灵) for the rites of averting calamity, and the Golden Precepts (金科) of the Purple Extremes (紫极) grant petitions of prayer and supplication.\n\nThe臣 and their followers, in obedience to the Imperial edicts, solemnly revere the Golden *Qi* (箓) and gather grand auspicious blessings, establishing the Orchid Field (兰场) and spreading the Mysterious models (玄范). They fear that their ascent and descent may deviate from the Secret Rituals (密勿), or that their reverence may fail to align with the Sacred Reflections (精修).\n\nAt this moment of dissolving the assembly, they earnestly offer their first confession of transgressions. With humble reverence, the臣 hopes that the Four Officials and Five Sovereigns will specially extend their forgiveness, and the Nine Departments and Three Officials will generously bestow their purifying grace.\n\nWith the rites perfected and the fruits fulfilled, may the blessings endure as long as Earth and Heaven. All wishes shall be granted, and their sincerity shall be clearly revealed.\n\nThe臣 and their followers bow their heads in devotion, offering three salutations and three rites of gratitude to the Supreme Three Treasures (三宝). Three salutations, three rites.»",
      "overlap_context": "Left and Right Attendants bearing incense, the Dragon-Cavalry Officers of the Sacred Relay, the Golden Boys who serve incense, the Jade Girls who convey messages and scatter flowers, and the Thirty-Six Officers of the Five Sovereigns, each bearing a talisman, a direct seal, and the Sun’s incense.\n\n**Those who appear** must don their formal robes and adorned headgear, their sashes and trailing plumes.\n**The ritual opens the Dark Altar and the local deities**, as well as the spirits of the domain.",
      "start_char": 445,
      "end_char": 948,
      "start_sentence": 40,
      "end_sentence": 69,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 11.32001543045044,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓解坛仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "起真文 重称法位 具位臣姓某重诚上启太上无极大道元始天尊，太上道君，太上老君，无上玄老十方灵宝天尊，已得道大圣众，至真诸君丈人，三十六部尊经，玄中大法师，三天大法师，上相上宰、上保上傅、四师五帝，星宫斗府、河汉群真、三界官属，一切威灵。 臣等猥以宿缘，恭逢圣运。 今则朝修礼毕，奏对仪周。 集此良因，上祝皇图天广，圣德日新。 睿算齐箕翼之年，中壶固冈陵之寿。 宗藩维屏，储嗣延禧。 宰输明良、人民乐育。 恭愿宸情上达，景贶下临。 邦畿懋辑於休征，宗社协符於元吉。 臣等遵依科范，启建清坛，赍信质心，法天像地。 六朝行道，一念皈真。 果满功圆，诸天复位。 臣等所佩官舞及临坛效职一切威灵，宣通召命，营卫斋修，并有勋绩。 谨为言功，进呈素悃，依格迁赏，特乞慈容。 所有表文，谨当宣奏。 宣表",
      "translated_text": "The **Ritual of Invoking the True Scriptures**—with repeated invocation of the sacred ranks—**the humble臣**, surname [Certain], in earnest reverence, humbly presents this petition to the **Supreme Dao of the Unexcelled and Limitless Way, the Primeval Sovereign of Heaven** (太上无极大道元始天尊),\nthe **Supreme Dao Sovereign** (太上道君),\nthe **Supreme Lord of the Dao** (太上老君),\nthe **Unexcelled Mysterious Elder, the Tenfold Sacred Treasures of All Directions, the Sovereign of Heaven** (无上玄老十方灵宝天尊),\nthe **already attained Dao Immortals and Great Saints** (已得道大圣众),\nthe **Most Authentic Celestial Lords and Venerable Masters** (至真诸君丈人),\nthe **Thirty-Six Departments of Sacred Scriptures** (三十六部尊经),\nthe **Great Lawmaster of the Mysterious** (玄中大法师),\nthe **Great Lawmaster of the Three Heavens** (三天大法师),\nthe **Supreme Chancellor and Prime Minister, Supreme Guardian and Preceptor, Four Teachers and Five Sovereigns** (上相上宰、上保上傅、四师五帝),\nthe **Celestial Astral Hall and Martial Array, the River and Milky Way’s Multitudes of Immortals, the officials of the Three Realms** (星宫斗府、河汉群真、三界官属),\nand **all manner of august and numinous beings** (一切威灵).\n\n**The臣** and their followers, through past karmic ties, humbly encounter this sacred era (恭逢圣运).\nNow, having completed the morning rites and fulfilled the ceremonial audience, **the臣** gathers this auspicious cause to pray:\n*\"May the Imperial Vision and Heavenly Broadness be ever renewed,\nAnd the Sovereign’s Virtue daily flourish.\nMay the years be as vast as the **Arrow and Dipper Constellations** (箕翼),\nAnd the lifespan as firm as the **Heavenly Cauldron** (中壶) and the **Ganling Mountains** (固冈陵).\nMay the ancestral and branch states remain steadfast as protective screens,\nAnd the heirs extend the blessings of longevity.\nMay the ministers be wise and virtuous,\nAnd the people rejoice in nurturing governance.\"*\n\nHumbly praying that **the Sovereign’s benevolent will ascend above**,\nAnd **the radiant grace descend below** (景贶下临).\nMay the realm and its borders be harmonized by signs of peace,\nAnd the ancestral temple and state be united by omens of perfect auspice (元吉).\n\n**The臣** follows the prescribed rituals, erecting a pure altar,\nAnd offers sincere devotion, mirroring Heaven and modeling Earth (法天像地).\nMay the Six Dynasties’ Dao be fulfilled,\nAnd all thoughts return to the True Way (一念皈真).\nWhen the merit is complete and the rites perfected,\nMay the Celestial Hosts return to their proper stations (诸天复位).\n\n**The臣’s** retinue, including those bearing official insignia and those performing duties at the altar,\nAll who respond to summons, guard the sacred rites, and maintain the fasts—\nTogether, they have rendered meritorious service (并有勋绩).\nThus, **the臣** respectfully declares their deeds,\nAnd presents their sincere petition (进呈素悃),\nSeeking, according to the established grades, a special grant of mercy.\nHumbly praying for **the Supreme Three Treasures’** compassionate favor (特乞慈容).\n\nAll memorial texts are now respectfully submitted for proclamation.\n**Proclamation of the Memorial** (宣表).",
      "overlap_context": "eigns will specially extend their forgiveness, and the Nine Departments and Three Officials will generously bestow their purifying grace.\n\nWith the rites perfected and the fruits fulfilled, may the blessings endure as long as Earth and Heaven. All wishes shall be granted, and their sincerity shall be clearly revealed.\n\nThe臣 and their followers bow their heads in devotion, offering three salutations and three rites of gratitude to the Supreme Three Treasures (三宝). Three salutations, three rites.»",
      "start_char": 948,
      "end_char": 1286,
      "start_sentence": 70,
      "end_sentence": 87,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 9.814185380935669,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓解坛仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "回将牒 焚化 十二愿 存神烧香 香官使者、左右龙虎君、侍香诸灵官，当令臣向来解坛散席之所，自然生金液丹碧芝英方百灵众真，交会在此，香火炉前。 上愿十方仙童，玉女接待，兰烟传臣向来所启之诚，速达径御至真无极大道三清上圣昊天至尊金阙玉皇上帝御前。 出堂颂 下坛，都门外立 辞三宝 朝修已毕，奏对云周。 道冠虚无，恩潭海宇。 皇图地久，圣寿天齐。 和稽首拜辞、十方道宝。 金童进善，玉女奏功。 名挂金牌，经藏宝韫。 尊安皇极，庆集邦畿。 和稽首拜辞，十方经宝。 □锺息响，宝篆消烟。 师返太清，福流家国。 玄风广布，道化兴行。 和稽首拜辞，十方师宝。 愿诸众生，诸恶莫作，众善奉行。 不堕业缘，常居盛世。 有情含识，同证无为。 和稽首拜辞，十方众圣。 向来 引班，诣静默堂，谢师 金箓解坛仪竟",
      "translated_text": "Return the memorial tablet and burn the **Twelve Vows**, preserving the spirit while offering incense.\nThe incense officials and messengers, the Left and Right Dragon-Tiger Lords, and the attendant spirit officials of incense—\nLet them now command that the places where **the臣** formerly dissolved the altar and dispersed the feast\nShall naturally give rise to golden elixirs, blue-green herbs, and the hundred spirits of the elysian realm,\nAll converging here before the incense brazier.\n\n**First Wish:** May the ten-direction celestial youths and jade maidens receive **the臣’s** sincere petition,\nAnd through fragrant clouds swiftly convey it to the **Supreme Dao of the True and Limitless Great Way**,\nBefore the **Three Pure Ones**, the **Most High Sovereign of the Golden Gate**, the **Jade Emperor of the Highest Heaven**,\nAnd the **Celestial Sovereign’s** august presence.\n\n**Exiting the Hall and Reciting Praises, Descending the Altar:**\nAt the city gates, **the臣** stands to take leave of the **Three Treasures**,\nHaving completed the morning rites and presented the response to the clouds.\n**The Dao** transcends emptiness, its grace encompassing the world.\nThe imperial plan endures as the earth, the sacred life matching the heavens.\n\n**Bowing in reverence and taking leave of the Ten-Direction Dao Treasures:**\nThe golden boys record virtues, the jade maidens proclaim merits.\nNames inscribed on golden tablets, scriptures stored in sacred repositories.\nMay **the Sovereign’s** majesty be honored, blessings gathered for the realm.\n\n**Bowing in reverence and taking leave of the Ten-Direction Scripture Treasures:**\nThe **chime’s** echoes fade, the sacred seals dissolve into mist.\nThe master returns to **Tai Qing**, blessings flowing to the family and state.\nThe **Mysterious Wind** spreads far, the **Dao’s** transformations flourish.\n\n**Bowing in reverence and taking leave of the Ten-Direction Teacher Treasures:**\nMay all sentient beings refrain from evil and cultivate goodness,\nFree from karmic bonds, ever dwelling in an age of prosperity.\nAll conscious beings together realize **non-action (wuwei)**.\n\n**Bowing in reverence and taking leave of the Ten-Direction Holy Ones:**\n**The臣** formerly led the procession to the **Hall of Silent Contemplation**,\nTo thank the master—\nNow the **golden talisman** is dissolved, the altar rites concluded.",
      "overlap_context": "at the altar,\nAll who respond to summons, guard the sacred rites, and maintain the fasts—\nTogether, they have rendered meritorious service (并有勋绩).\nThus, **the臣** respectfully declares their deeds,\nAnd presents their sincere petition (进呈素悃),\nSeeking, according to the established grades, a special grant of mercy.\nHumbly praying for **the Supreme Three Treasures’** compassionate favor (特乞慈容).\n\nAll memorial texts are now respectfully submitted for proclamation.\n**Proclamation of the Memorial** (宣表).",
      "start_char": 1286,
      "end_char": 1649,
      "start_sentence": 88,
      "end_sentence": 115,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 5.304267406463623,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓解坛仪.txt",
        "category": "威仪类"
      }
    }
  ]
}