{
  "source_id": "金箓设醮仪",
  "source_file": "chunked_daozang\\金箓设醮仪.json",
  "total_chunks": 5,
  "total_original_chars": 2139,
  "total_translated_chars": 20891,
  "total_translation_time": 94.82072496414185,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓设醮仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**The Ritual of the Golden Seal for Exorcism and Supplication**\n\n**Title:** *Ritual of the Golden Seal for Exorcism and Supplication* (Jīn guān shè jiào yí).\n**One scroll.**\n\n**Original Source:** *Zhèngtǒng Dàozàng* (Canon of the Orthodox Daoist Treasury), *Dòngxuán bù* (Mysterious Primordial Section), *Wēiyí lèi* (Category of Auspicious Rites).\n\n**Ritual Procedure as Prescribed:**\nThe officiating Daoist priest (lǐshī) shall perform each rite in accordance with the prescribed form, and shall recite the sacred incantations (shén zhòu) as directed.\n\n**Invocation of the Five Celestial Stars:**\nMay the Five Celestial Stars array themselves in splendor (lìè zhào, *illuminate*), their brilliance manifesting in all directions (huàn míng wǔfāng).\nThe Water Star repels calamity (shuǐxīng què zāi),\nThe Wood Star brings prosperity through virtue (mùdé zhì chāng).\nThe Upholstering Star (Yínghuò, *Mars*) dispels misfortune (xiāo huò),\nThe Great White Star (Tàibái, *Venus*) wards off military threats (bì bīng).\nThe Zhen Star (Zhènxīng, *Mercury*) steadfastly secures blessings (jiāguó lì héng).\n\n**Sacred Seal and Scriptures:**\nIts name is inscribed upon jade tablets (míng jiān yùjiǎn),\nIts characters are recorded in the Imperial Archives (zì lù dìfáng).\nAscending on the gusting winds (chéng biāo sàn jǐng),\nIt soars through the boundless expanse (fēi téng tàikōng).\nMoving unseen through the netherworld (chūrù míngwú),\nIt traverses and banquets in all ten directions (yóuyǎn shífāng).\n\n**Summoning the Five Cloud Spirits:**\nThe Five Clouds (wǔyún) float as a canopy (fú gài),\nTo invoke the divine (zhāo shén shè fēng),\nAnd command all spirits (yìshǐ wànlíng).\nThe celestial sentinels (shàng wèi xiānwēng) shall guard above.\n\n**Harmony with the Dao and the True:**\nIn accordance with the Dao and the True Essence (hé yǔ Dào hé zhēn).\n\n**Striking the Law Drum:**\nThe Law Drum (fǎgǔ) shall be struck twenty-four times (míng fǎgǔ èrshísì tōng).\n\n**Summoning the Celestial Hierarchy:**\nThe Most High Three Heavens (Wúshàng sān tiān), the Primordial Beginning (Xuányuán), the Three *Qi* (Sānjīng), and the Most Venerable Lord Lao (Tàishàng Lǎojūn) are invoked.\nFrom their midst, the **Thirty-Six Celestial Functionaries** (Sānshíliù gōngcáo) of the Five Phases (Zhōng sānwǔ),\nThe **Thirty-Six Left and Right Officials** (zuǒyòu guānshǐzhě),\nThe **Thirty-Six Dragon-Cavalry Messengers** (zuǒyòu pěngxiāng yìlóng qí lì),\nThe **Thirty-Six Attendants of Incense** (sìxiāng jīntóng),\nThe **Thirty-Six Heavenly Heralds** (chuányán yùnǚ),\nThe **Thirty-Six Imperial Seal-Bearers** (Zhífú Zhíri),\nAnd the **Thirty-Six Celestial Incense Officials** (Zhíri Xiāngguān),\nAll **Thirty-Six in number** (gè sānshíliù rén chū), shall emerge.\n\n**The Emerging Spirits:**\nThey shall be arrayed in solemn attire (chūzhě, yán zhuāng).\n\n**Opening the Celestial and Terrestrial Portals:**\nThe gates of the Mysterious Primordial Hall (Xuán tán) and the Earthly Deities (Tǔdì) shall be unlocked,\nAnd the territorial spirits (Fāngyù shénzhēn) shall be summoned.\n\nYour humble servant, in this quiet night,\nConducts the **Great Offering (jiào)** and morning rites,\nWith reverent devotion and sincere sincerity,\nAnd all the sacred texts and incantations duly prepared.\n\nMay the **Supreme Dao’s Most Authentic Essence-Qi (Zhìzhēn Dàodé qì)**—the **Spiritual Treasure-Light (Língbǎo guāng)**—descend and flow into our bodies,\nSo that our earnest petitions may swiftly reach the **Supreme, Boundless Dao of Ultimate Reality (Wújí Dàdào)**,\nBefore the **Three Pure Ones (Sānqīng)**—the **Most Exalted Celestial Sovereign (Hàotiān Zhìzūn Jīnyuè Yùhuáng Dìshàngdì)**.\n\nWe humbly invoke the **Lawful Rank (Fǎwèi)** and our full names—[Subject’s Name] and the assembled officials at the altar—\nAnd together, with utmost sincerity, address:\n\nThe **Primordial Heavenly Worthies (Yuánshǐ Tiānzūn)** of the **Jade Pure Realm (Yùqīng Shèngjìng)**,\nThe **Soul-Treasured Heavenly Worthies (Língbǎo Tiānzūn)** of the **High Pure Realm (Shàngqīng Zhēnjìng)**,\nThe **Dao-Virtue Heavenly Worthies (Dédào Tiānzūn)** of the **Supreme Pure Realm (Tàiqīng Xiānjìng)**,\nThe **Most Exalted Celestial Sovereign (Hàotiān Zhìzūn Yùhuáng Dìshàngdì)**,\nThe **Heavenly Sovereign of the Gōuchén Star-Court (Gōuchén Xīnggōng Tiānhuáng Dàdì)**,\nThe **Grand Sovereign of the Northern Celestial Pole (Běijí Zǐwēi Dàdì)**,\nThe **Earthly Sovereign (Hòutǔ Huángdì Zhī)** who follows Heaven’s Law,\nThe **Grand Sovereign of the Eastern Azure Splendor (Dōngjí Qīnghuá Dàdì)**,\nThe **Grand Sovereign of the Southern Eternal Life (Nánjí Chángshēng Dàdì)**,\nThe **Heavenly Worthies of the Void (Xūwú Zhūtiān Tiānzūn)**,\nThe **Heavenly Sovereigns of the Void (Xūwú Zhūtiān Dìshàngdì)**,\nThe **Nine Celestial Sovereigns of the Divine Mansion (Shénxiāo Jiǔchén Dìshàngdì)**,\nThe **Nine Heavenly Sovereigns of the Born Gods (Jiǔtiān Shēngshén Dìshàngdì)**,\nThe **Five Directions’ Five Elderly Sovereigns (Wǔfāng Wǔlǎo Dìshàngdì)**,\nThe **Five Blessings and Ten Divine Sovereigns of the Great Unity (Wǔfú Shíshén Tàiyǐ Zhēnjūn)**,\nThe **Mid-Heaven Sovereign of the Northern Dipper (Běidǒu Zhōng Gāoshàng Yùhuáng Zūn Dì)**,\nThe **Grand Sovereign of the Northern Celestial Exalted (Běijí Xuánqīng Dàdì)**,\nThe **Imperial Sovereign of the Sun-Court (Rìgōng Tàiyáng Dìjūn)**,\nThe **Royal Sovereign of the Moon-Palace (Yuèfǔ Tàiyīn Huángjūn)**,\nThe **Five Directions’ Five Virtue-Star Sovereigns (Wǔfāng Wǔdé Xīngjūn)**,\nThe **Four Luminaries of the Mysterious Metropolis (Xuándū Sìyào Xīngjūn)**,\nThe **Six Ministers of the Southern Dipper (Nándǒu Liùsī Xīngjūn)**,\nThe **Nine Sovereigns of the Northern Dipper (Běidǒu Jiǔhuáng Xīngjūn)**,\nThe **Three Dipper Sovereigns of East, West, and Center (Dōngxī Zhōng Sāndǒu Xīngjūn)**,\nThe **Five Dipper Central Divine Sovereigns and All Celestial Spirits (Wǔdǒu Zhōngshén Xiānlíng Guān)**,\nThe **Grand Saint of the Heavenly Ganges (Tiāngǎng Dàsèng Kuíguāng Dìjūn)**,\nThe **Three Platforms and Canopy-Star Sovereigns (Sāntái Huágài Xīngjūn)**,\nThe **Twenty-Eight Constellation-Star Sovereigns (Èrshíbā Xiù Fēn Xīngjūn)**,\nThe **Twelve Zodiacal Mansion-Star Sovereigns (Shíèr Gōng Fēn Xīngjūn)**,\nThe **Sixty Heavenly Stems-and-Branches-Star Sovereigns (Liùshí Jiǎzǐ Xīngjūn)**,\nThe **Imperial Sovereign of the Sovereign’s Native Star (Huángdì Běnmìng Xīngjūn)**,\nThe **Imperial Heir’s Native Star Sovereign (Huángtàizǐ Běnmìng Xīngjūn)**,\nThe **True Ruler of the Celestial Sovereign’s Illuminating Seat (Dìzuò Zhàolín Zhēnzǎi)**,\nThe **True Sovereign of the Heavenly Hosts’ Degrees (Zhōutiān Xiùdù Xīngzhēn)**,\nThe **Three Sovereigns of the Three Elements (Sānyuán Sānguān Dàdì)**,\nThe **True Celestial Worthies of the Three Elemental Registries (Sānyuán Cáofǔ Zhēnxiān)**,\nThe **Four Celestial Worthies of the Northern Celestial Pole (Běijí Sìshèng Zhēnjūn Yuèxià Zhēnzǎi)**,\nThe **Jade Pure Soul-Treasured Ancestral Teachers of All Generations (Lìdài Shī Zhēnzǔshī)**,\nThe **Supreme Celestial Saints of the Three Heavens (Sāntiān Dàsèngshī Zhèngyī Zhēnjūn)**,\nThe **Three Worthies of the Supreme Unity (Zhèngyī Sānshī Zhēnjūn)**,\nThe **Two True Worthies of the Wang and Zhao (Zuǒyòu Wáng Zhào Èr Zhēnrén)**,\nThe **Thirty-Sixth Generation Celestial Master (Sānshíliùdài Tiānshī Xūjìng Zhēnjūn)**,\nThe **Supreme Unity’s Generational Transmission Teachers (Lìdài Chuánjiào Shī Zhēn)**,\nThe **True Celestial Saints of the Three Caverns and Four Auxiliaries (Sāndòng Sìfú Jīnglù Zhōngzhēn Xiānshèngshèng)**,\nThe **Nine Heavenly Inspectors (Jiǔtiān Cǎifǎng Shī Zhēnjūn)**,\nThe **Supreme Celestial Worthies of the Heavenly Registries (Tiān Cáofǔ Tàihuáng Wànfú Zhēnjūn)**,\nThe **True Rulers of the Nine Heavenly Registries (Jiǔtiān Tiān Cáofǔ Lièbān Zhēnzǎi)**,\nThe **Twelve Celestial Worthies of Master Xǔ of the Western Mountains (Xīshān Xǔ Hào Shíèr Wèi Zhēnjūn)**,\nThe **True Worthies of the Supreme Primordial Sage (Tàijí Xiānwēng Zhēnjūn)**,\nThe **Three Celestial Worthies of the Canopy (Huágài Sānxiān Zhēnjūn)**,\nThe **Three Worthies of the Mao Peaks and the Sovereign of Destiny (Sānmáo Sīmìng Zhēnjūn)**,\nThe **High Law-Rulers of All Divine Offices (Zhūsī Yuànfǔ Zhǔ Fǎgāo Zhēn)**,\nThe **True Rulers of the Upper Realm’s Assembly of Worthies (Shàngjiè Cháoyuán Zhēnzǎi Léitíng Fǎbù Guānjūn)**,\nThe **Lawful Officials and Soldiers Subordinate to the Law-Pacifying Bureau (Fǎjìng Suǒshǐ Guānjiàng Bīng)**,\nThe **Five Sacred Sovereigns of the Five Mountains and Five Heavens (Wǔyuè Wǔtiān Shèngdì Yuèfǔ Wēilíng)**,\nThe **Water-Court Sovereigns of the Supporting-Sun Tree and the Watery Realm’s Celestial Worthies (Shuǐfǔ Fúsāng Dàdì Shuǐxiāng Xiānzhòng)**,\nThe **True Responsive Spirits of the Three Realms’ City Deities and Earthly Spirits (Sānjiè Chénghuáng Sìdiǎn Yìnggǎn Zhēnlíng)**,\nThe **Five Inner Court Deities (Nèitíng Wǔsì Zhīshén)**,\nThe **Incense-Officials and Messengers of the Great Offering (Jiàojiào Xiāngguān Shǐzhě)**,\nAnd the **True Inspectors of the Mysterious Void’s Descending Rectification (Xuánxū Xiàjiàng Jiǔchá Zhēnshǐ)**.\n\nWith deepest reverence, we await Your **Boundless Mercy (Hóngcí)**,\nAnd Your **Piercing Discernment (Diūjiàn)**.\n\nYour humble servant, in profound submission, acknowledges:\nThat the **Dao encompassing Heaven and Earth (Fànwéi Tiāndì Dàodé)**\nIs achieved through the **Three Qi (Sānqì)**, by which the **Primordial Essence (Húnníng)** is perfected.\n\nThe **Illuminating Chapter of the Clouded Han** unfolds from the Five Classics.\nThe **Supreme Yang** blazes forth, its **Boundless Virtue** profound and mysterious.\n\nIts **Mysteries** transcend speech and thought,\nIts **Manifest Power** partakes in the **Cosmic Transformation** of night.\n\nBeholding the **origin of the Ritual of Abstinence and Offerings (Zhāojiào)**,\nWe first establish the **Great Offering (Jiào)**—\nMay our **sincere invocation** turn the **Heavenly Response (Huìtiān)**,\nAnd may we **align with the auspicious and reverent** to **divine the day (Bùrì)**.\n\nIlluminating service to the **Supreme Deity (Shàngdì)**,\nThe **Pine and Flower Assembly (Sōnghuā Huì)** truly convenes;\nEmbracing the **Hundred Spirits (Bǎishén)** with **gentle conciliation (Huáiróu)**,\nThe **Sincere Devotion (Yùnzǎo)** may be **proffered as tribute (Jiàn)**.\n\nThe **Piercing Discernment** knows no obstruction,\nThe **Graceful Bestowal** leaves nothing unshared.\n\nNow, Your humble servants, in **reverent submission (Qíánqíjìng)**,\nAwait Your **Edict (Zhìmìng)** with **pious prayer (Qíjìng)**.\nWe **solicit the Mysterious Sovereign’s (Xuánzhǔ)** swift guidance.\n\nThe **auspicious incense vapors** disperse in **rainbow hues (Sǎncǎi)**,\nThe **luminous candle shadows** intermingle in **divine radiance (Jiāohuī)**.\n**Mandarin ducks and cranes** advance in **harmonious ranks (Fēnxì yuānxíng)**,\n**Serene and orderly**, dividing their **ceremonial stations (Fēnbān)** on either side;\n\n**Dragon banners and phoenix chariots** appear in **visionary splendor (Lóngqí luányú)**,\n**Imagined in the celestial procession (Xiǎngjià)** floating through the void.\nWe **don the luminous robes**, gazing upward at the **two celestial lights (Liǎngyào)**,\nAnd **align the cosmic threads**, revering the **clustered stars (Zhòngxīng)** in their **supporting arc (gǒng)**.\n\nThe **dim and bright** are **fully revealed (Yōumíng dōngqǐ)**,\nThe **Earthly Spirits** surge beside the **Jade Formation (Yùjú)**;\nThe **vast and boundless** depths **cleanse and brighten (Hàomiǎo hóngchéng)**,\nThe **Water Emperor** emerges from the **Pearl Palace (Zhūgōng)** beyond.\n\n**Golden Tortoises** command the **misty ranks (Jīnniú cèwù)**,\n**Farewell to the Three Isles’ (Sāndǎo)** **Celestial Homeland (Xiānxiāng)**;\n**Iron-Hoofed Steeds** neigh in the **wind (Tiěmǎ sīfēng)**,\n**Nearly attending** at the **Ninefold Incense Altar (Jiǔchóng xiāng’àn)**.\n\nThe **Multitudes of True Ones** gather in **cosmic array (Zhòngzhēn jiāohuì, Wànxiàng sēnluó)**,\nWe **behold the solemn and majestic (Zhānmùmù huánghuáng)**,\nAnd **pay homage with reverent awe (Jìng yōngyōng sùsù)**.\n\nDescending to the **Ritual Assembly (Fǎxí)**,\nYour **Graceful Inspection (Huìjiàn)** witnesses our **sincere devotion (Jīngchéng)**.\n\nYour humble servants, along with the **Ritual Officials (Lǐguān)** and **Lawful Assembly (Fǎzhòng)**,\n**Solemnly kowtow twice (Jǐn qǐshǒu)**,\n**Gazing afar** at the **Heavenly Steps (Tiānjiē)**,\n**Devoutly welcoming** the **Sacred Procession (Shèngyú)**.\n\n**The Seven Celestial Rulers descend (Jiàng)**,\n**Phoenix Chariots arrive (Luányú zhǐzhǐ)**,\n**Crane-Drawn Chariots** **hover at the veranda (Hèjià línchuán)**.\nWith the **Assembled True Ones of the Great Offering (Jiàozhòng zhēnzhēn)**,\nWe **conduct the rites as prescribed (Rúyí cháolí)**.\n\nThe **ceremonial rites are fully completed (Cháolí jìzhōu)**,\nEach **ascends to their respective platform (Zéng shēngtánzuò)**.\nYour humble servants, along with the **Ritual Officials (Lǐguān)**,\n**Kowtow twice and offer incense (Zàibài shàngxiāng)**,\n**Reverently performing the First Tribute (Qíngxíng chūxiàn)**.\n\n**First Tribute Rites (Chūxiàn Fǎshì)**\n**Repeatedly proclaim the Lawful Rank (Chóngchēng fǎwèi)**.\n\n**With the Assembled Officials and True Ones (Jùwèi chén xìngmǒu yǔ lín tán guānzhòng děng),**\n\nWe **solemnly and devoutly kowtow twice** and **offer incense in supplication (qǐngxiāng shàngqǐ)** to the **Formless Void of Nature’s Dao (Xūwú zìrán)**, the **Three Sovereigns of the Three Realms (Sānqīng sānjièng tiānzūn)**, the **Most Venerable of the Golden Gate (Jīnquè zhìzūn)**, and the **Three August Emperors of Heavenly Authority (Sānhuáng tiāndì)**.\nWe **honor the Earthly Sovereign (Hòutǔ huángdì zhǐ)** who **receives Heaven’s mandate and follows its laws (Chéngtiān xiàofǎ)**.\nTo the **Assemblies of All Heavens, All Earths, All Waters, and All Mountains (Zhūtiān zhūdì zhūshuǐ zhūshān)**,\nTo the **Three Realms and Ten Directions (Sānjiè shí fāng)**, the **Thousands of True Ones and Ten Thousands of Saints (Qiānzhēn wànshèng)**,\nWe **prayerfully invite all to descend in response (Jiàozhòng gǎnjiàng yīqiè wēilíng)**.\n\n**Reverently gazing upon the boundless mercy (Gōngwàng hóngcí)**,\n**Humbly awaiting the all-pervading insight (Fǔchuí dòngjiàn)**.\nYour humble servants **prostrate themselves**, for **wishes granted must be sincere (Yǒuyuàn bì cóng)**,\nAnd **the unspoken will align with the resonant Dao (Yìngmò tóng yú yǐngxiǎng)**;\n**Virtue unanswered cannot be (Wúdé bù bào)**,\nYet **devout sincerity alone suffices (Jìngshí zài yú jīngchéng)**.\n\nWe **solemnly reflect upon the august dignity of the Supreme Dao (Wǎngwěi huángjí zhī zūnróng)**,\nAnd **reverently follow the precepts of the True Teachers (Gōngàn shīzhēn zhī jiàodiǎn)**.\nWith **fasting and ritual purity (Zhāixiū jīnluán)**,\nWe **conduct the rites with utmost solemnity (Yíjìng zhǎn yú cháoxiū)**;\nOur **sincerity reaches even the Phoenix Chariots (Qínggé luányú)**,\nAnd **our completed rites are presented in gratitude (Lǐbì chén yú jiàoxiè)**.\n\n**Truth admits no duality, nor do rites differ in significance (Lǐ wú yǒu èr, shì qǐ huìshū)**.\nWe **seek only that blessings may not falter (Wéi qiú fú zhī bù huí)**,\nFor **all are moved by devout sincerity (Jiē zhìchéng zhī suǒ gǎn)**.\n\n**The Dao is vast above, and its mysteries profound within (Yángyáng zài shàng, dòngdòng hū zhōng)**.\nWe **present the Green Petition (Shèjiào qīngcí)**,\nAnd **diligently recite the sacred words (Jǐn dāng xuānzòu)**.\n\n**Recitation of the Sacred Words (Xuāncí)**\n**Reverently following the edict’s intent (Gōngchéng cízhǐ, bèijí jīngchéng)**,\nWith **one earnest thought (Wéi yīniàn zhī kuǎnqí)**,\nWe **hope for silent response (Shùjī mògǎn)**;\nIn **many rites performed (Zài duōcí zhī kèxiǎng)**,\nWe **dare to offer the sacred sacrifice (Gǎn jiàn mínggǎn)**.\n\n**The august presence of Heavenly Authority descends (Huánghuáng tiāndì zhī lín)**,\nAnd **the assembly of all spirits trembles in awe (Zhuójù bǎilíng zhī huì)**.\nWith **our offerings and libations placed (Jūxīn xiàndiàn)**,\nWe **gather auspicious omens in abundance (Shìjí zhēnxiáng)**.\n\n**Plenitude of wisdom and sagacity (Cōngmíng ruìzhī)**,\nIs **sufficient to manifest their presence (Zúyǐ yǒulín)**;\n**Their commands and decrees (Hàolìng wénzhāng)**,\nAre **radiant and worthy of recounting (Huànhù kě shù)**.\n\n**Governance without action (Wúwéi ér zhì)**,\nAchieves **the refined wind of tranquility (Kèzhēn qīngjìng zhī fēng)**;\n**All things flourish in spring (Yǒuwù jiē chūn)**,\nAnd **eternal joy brings the age of great peace (Yǒnglè tàipíng zhī shì)**.\n\n**The Heavenly Plan is vast and boundless (Huángtú guǎngdà)**,\nAnd **the Sacred Calculations stretch without end (Shèngsuàn miáncháng)**.\nYour humble servants, along with the **Ritual Officials (Lǐguān)**,\n**Kowtow twice and offer incense (Zàibài shàngxiāng)**,\n**Reverently performing the Second Tribute (Gōngxíng yàxiàn)**.\n\n**Second Tribute Rites (Yàxiàn Fǎshì)**\nYour humble servants **solemnly and devoutly kowtow twice** and **offer incense in supplication (Shàngqǐ)** to the **Formless Void (Xūwú)** of the **Three Sovereigns (Sānqīng)**, the **Supreme Saints of Mysterious Existence (Shàngshèng miàoyǒu shíjí gāozhēn)**,\nTo the **Ten Thousands of Spirits and Ten Thousands of Saints (Wànlíng shíshèng)** in the **Three Realms and Ten Directions (Sānjiè shífāng)**,\nWe **prayerfully invite all to descend in response (Jiàozhòng gǎnjiàng yīqiè zhēnlíng)**.\n\n**Reverently gazing upon the boundless mercy (Gōngwàng hóngcí)**,\n**Humbly awaiting the all-pervading insight (Fǔchuí dòngjiàn)**.\nYour humble servants **prostrate themselves**, for **Heavenly Authority descends without hesitation (Wéi yǒulín wú èr)**;\n**The spirits reside in reverence (Shìzhēn jūxīn)**,\nAnd **we honor the gods as though they were present (Tǐwù ér bùkě yí)**.\n\nWe **humbly submit our red sincerity (Wéi fǔ yǒng yú dānxūn)**,\nAnd **loftily respond to boundless grace (Yòng yǎngdá yú hóng’ēn)**.\nOur **earnest devotion is unceasing (Shǒuchén zhī zhì quánquán)**,\nAnd **our repentance is unwavering (Guīyǐ zhī chéng yìyì)**.\n\nWe **humbly pray that the gods may accept our sincerity (Fúyuàn shénxiǎng yú chéng)**,\nAnd **grant celestial blessings (Tiān zuò zhī fú)**.\nMay **grace flow eternally to our kin and realm (Liú’ēn jiāguó)**,\nAnd **auspicious merit be perpetually extolled (Yáng yáng bùxī zhī jī)**;\nMay **blessings gather at our ancestral shrine (Liǎnfú zōngfān)**,\nAnd **fulfill our pious entreaties (Shìfù qiánqí zhī qǐng)**.\n\n**All requests are answered, and no devout appeal goes unfulfilled (Yǒuqiú jiē yìng, wúgǎn bù tōng)**.\nYour humble servants **pay utmost reverence (Zhìgōng)**,\nAnd **complete the rites with the Final Tribute (Lǐshēn zhōngxiàn)**.\n\n**Final Tribute Rites (Zhōngxiàn Fǎshì)**\n**Recite the Sacred Petition (Xuānzhàng)**.\n\nYour humble servant, with utmost sincerity and reverence, **prostrates before the Three Pure Ones and Supreme Deities, the Ten Directions’ Highest Worthies, the Mysterious Vault of Heaven’s Imperial Seat, the Starry Worthies of the Profound Earth, and the Cavernous Heavens and Oceanic Mountains**, where the **sacrificial rites have evoked the descent of all august and numinous spirits**.\n\nWith **solemn devotion**, your servant **humbles beneath the celestial mandate**, daring to **behold the divine chariot’s ascent**; with **ritual propriety fulfilled**, how dare we **linger beneath the gusting winds of the sacred vehicle**?\n\nThe **radiant candles flicker to embers**, the **spiraling incense smolders to ash**.\nThe **golden chimes fall silent**, the **jade water-clock’s tolls hasten**.\n\n**Riding the pure qi and commanding yin-yang**, we **watch the dragon carriage ascend**;\n**Beneath the august Heaven and upon the profound Earth**, we **rely on the boundless benevolence of the Sovereign’s embrace**.\n\nYour servant, together with the **ritual officials and the assembled Daoist assembly**, is **utterly overwhelmed by gratitude, indebtedness, and the weight of received virtue**.\n\nWith **deepest reverence**, we **prostrate and bow twice**, and **offer our words to the Sacred Procession**.\n\n**Hymn of Farewell to the Sacred**\nTo the **Spirit-Guardians who tend the incense, the Incense-Officers, the Left and Right Dragon-Tiger Lords, and the Attendant Spirits of the Incense**, may it be decreed that **wherever your servant has established the rites, golden elixirs and jade-green herbs shall spontaneously arise**.\n\nMay the **hundred spirits and worthies gather here**, their **qi converging at the incense altar and furnace before us**.\nMay the **ten-directional celestial youths and jade maidens attend in attendance**, and **through the fragrant mists convey your servant’s sincerity as previously offered, swiftly reaching the Supreme Dao of the Limitless, the Three Pure Ones, the Most High Sovereign of the Golden Gate, the Jade Emperor, Supreme Deity of Heaven, before the Celestial Court**.\n\n**The golden talisman rites are now complete**.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "金箓设醮仪 经名：金箓设醮仪。 一卷。 底本出处：《正统道藏》洞玄部威仪类。 金箓设醮仪 法事如式 各礼师，存念如法 请宣神咒 五星列照，焕明五方。 水星却灾，木德致昌。 荧惑消祸，太白辟兵。 镇星四据，家国利亨。 名刊玉简，字录帝房。 乘飙散景，飞腾太空。 出入冥无，游宴十方。 五云浮盖，招神摄风。 役使万灵，上卫仙翁。 和与道合真。 鸣法鼓二十四通 无上三天玄元始三炁太上老君，召出臣身中三五功曹、左右官使者、左右捧香驿龙骑吏，侍香金童、传言玉女、五帝直符直日香官，各三十六人出。 出者，严装。 关启玄坛土地，方域神真。",
      "translated_text": "**The Ritual of the Golden Seal for Exorcism and Supplication**\n\n**Title:** *Ritual of the Golden Seal for Exorcism and Supplication* (Jīn guān shè jiào yí).\n**One scroll.**\n\n**Original Source:** *Zhèngtǒng Dàozàng* (Canon of the Orthodox Daoist Treasury), *Dòngxuán bù* (Mysterious Primordial Section), *Wēiyí lèi* (Category of Auspicious Rites).\n\n**Ritual Procedure as Prescribed:**\nThe officiating Daoist priest (lǐshī) shall perform each rite in accordance with the prescribed form, and shall recite the sacred incantations (shén zhòu) as directed.\n\n**Invocation of the Five Celestial Stars:**\nMay the Five Celestial Stars array themselves in splendor (lìè zhào, *illuminate*), their brilliance manifesting in all directions (huàn míng wǔfāng).\nThe Water Star repels calamity (shuǐxīng què zāi),\nThe Wood Star brings prosperity through virtue (mùdé zhì chāng).\nThe Upholstering Star (Yínghuò, *Mars*) dispels misfortune (xiāo huò),\nThe Great White Star (Tàibái, *Venus*) wards off military threats (bì bīng).\nThe Zhen Star (Zhènxīng, *Mercury*) steadfastly secures blessings (jiāguó lì héng).\n\n**Sacred Seal and Scriptures:**\nIts name is inscribed upon jade tablets (míng jiān yùjiǎn),\nIts characters are recorded in the Imperial Archives (zì lù dìfáng).\nAscending on the gusting winds (chéng biāo sàn jǐng),\nIt soars through the boundless expanse (fēi téng tàikōng).\nMoving unseen through the netherworld (chūrù míngwú),\nIt traverses and banquets in all ten directions (yóuyǎn shífāng).\n\n**Summoning the Five Cloud Spirits:**\nThe Five Clouds (wǔyún) float as a canopy (fú gài),\nTo invoke the divine (zhāo shén shè fēng),\nAnd command all spirits (yìshǐ wànlíng).\nThe celestial sentinels (shàng wèi xiānwēng) shall guard above.\n\n**Harmony with the Dao and the True:**\nIn accordance with the Dao and the True Essence (hé yǔ Dào hé zhēn).\n\n**Striking the Law Drum:**\nThe Law Drum (fǎgǔ) shall be struck twenty-four times (míng fǎgǔ èrshísì tōng).\n\n**Summoning the Celestial Hierarchy:**\nThe Most High Three Heavens (Wúshàng sān tiān), the Primordial Beginning (Xuányuán), the Three *Qi* (Sānjīng), and the Most Venerable Lord Lao (Tàishàng Lǎojūn) are invoked.\nFrom their midst, the **Thirty-Six Celestial Functionaries** (Sānshíliù gōngcáo) of the Five Phases (Zhōng sānwǔ),\nThe **Thirty-Six Left and Right Officials** (zuǒyòu guānshǐzhě),\nThe **Thirty-Six Dragon-Cavalry Messengers** (zuǒyòu pěngxiāng yìlóng qí lì),\nThe **Thirty-Six Attendants of Incense** (sìxiāng jīntóng),\nThe **Thirty-Six Heavenly Heralds** (chuányán yùnǚ),\nThe **Thirty-Six Imperial Seal-Bearers** (Zhífú Zhíri),\nAnd the **Thirty-Six Celestial Incense Officials** (Zhíri Xiāngguān),\nAll **Thirty-Six in number** (gè sānshíliù rén chū), shall emerge.\n\n**The Emerging Spirits:**\nThey shall be arrayed in solemn attire (chūzhě, yán zhuāng).\n\n**Opening the Celestial and Terrestrial Portals:**\nThe gates of the Mysterious Primordial Hall (Xuán tán) and the Earthly Deities (Tǔdì) shall be unlocked,\nAnd the territorial spirits (Fāngyù shénzhēn) shall be summoned.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 266,
      "start_sentence": 0,
      "end_sentence": 21,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 11.834551334381104,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓设醮仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "臣今静夜，设醮朝修。 钦奉其诸丹悃，具载词文。 愿得太上至真道炁灵宝瑞光下降，流入臣等身中，令臣所启之诚，速达径御至真无极大道三清上圣昊天至尊金阙玉皇上帝御前。 请称法位 具位臣姓某与临坛官众等，谨同诚上启虚无自然无极大道玉清圣境元始天尊，上清真境灵宝天尊，太清仙境道德天尊，昊天至尊玉皇上帝，勾陈星宫天皇大帝，中天星主北极紫微大帝，承天效法后土皇地祇，东极青华大帝，南极长生大帝，虚无诸天天尊，虚无诸天上帝，神霄九宸上帝、九天生神上帝、五方五老上帝、五福十神太乙真君，北斗中高上玉皇尊帝，北极玄卿大帝，日宫太阳帝君，月府太阴皇君，五方五德星君，玄都四曜星君、南斗六司星君、北斗九皇星君、东西中三斗星君、五斗中神仙诸灵官、天罡大圣奎光帝君、三台华盖星君、二十八宿星君、十二宫分星君、六十甲子星君，皇帝本命星君，皇太子本命星君，帝座照临真宰，周天宿度星真，三元三官大帝，三元曹府真仙，北极四圣真君阙下真宰、清微灵宝历代师真祖师，三天大圣师正一真君，正一三师真君、左右王赵二真人，三十代天师虚靖真君、正一历代传教师真，三洞四辅经箓中真仙圣众，九天采访使真君，天曹太皇万福真君，九天天曹列班真宰，西山许昊十二位真君，太极仙翁真君，华盖三仙真君，三茅司命真君，诸司院府主法高真，上界朝元真宰雷霆法部官君，法靖所隶官将吏兵，五岳五天圣帝岳府威灵，水府扶桑大帝水乡仙众，太岁城隍祀典三界应感真灵，内廷五祀之神，监醮香官使者，玄虚下降纠察真司。 恭望洪慈，俯垂洞鉴。 臣伏以范围天地之道，由三炁以混凝；",
      "translated_text": "Your humble servant, in this quiet night,\nConducts the **Great Offering (jiào)** and morning rites,\nWith reverent devotion and sincere sincerity,\nAnd all the sacred texts and incantations duly prepared.\n\nMay the **Supreme Dao’s Most Authentic Essence-Qi (Zhìzhēn Dàodé qì)**—the **Spiritual Treasure-Light (Língbǎo guāng)**—descend and flow into our bodies,\nSo that our earnest petitions may swiftly reach the **Supreme, Boundless Dao of Ultimate Reality (Wújí Dàdào)**,\nBefore the **Three Pure Ones (Sānqīng)**—the **Most Exalted Celestial Sovereign (Hàotiān Zhìzūn Jīnyuè Yùhuáng Dìshàngdì)**.\n\nWe humbly invoke the **Lawful Rank (Fǎwèi)** and our full names—[Subject’s Name] and the assembled officials at the altar—\nAnd together, with utmost sincerity, address:\n\nThe **Primordial Heavenly Worthies (Yuánshǐ Tiānzūn)** of the **Jade Pure Realm (Yùqīng Shèngjìng)**,\nThe **Soul-Treasured Heavenly Worthies (Língbǎo Tiānzūn)** of the **High Pure Realm (Shàngqīng Zhēnjìng)**,\nThe **Dao-Virtue Heavenly Worthies (Dédào Tiānzūn)** of the **Supreme Pure Realm (Tàiqīng Xiānjìng)**,\nThe **Most Exalted Celestial Sovereign (Hàotiān Zhìzūn Yùhuáng Dìshàngdì)**,\nThe **Heavenly Sovereign of the Gōuchén Star-Court (Gōuchén Xīnggōng Tiānhuáng Dàdì)**,\nThe **Grand Sovereign of the Northern Celestial Pole (Běijí Zǐwēi Dàdì)**,\nThe **Earthly Sovereign (Hòutǔ Huángdì Zhī)** who follows Heaven’s Law,\nThe **Grand Sovereign of the Eastern Azure Splendor (Dōngjí Qīnghuá Dàdì)**,\nThe **Grand Sovereign of the Southern Eternal Life (Nánjí Chángshēng Dàdì)**,\nThe **Heavenly Worthies of the Void (Xūwú Zhūtiān Tiānzūn)**,\nThe **Heavenly Sovereigns of the Void (Xūwú Zhūtiān Dìshàngdì)**,\nThe **Nine Celestial Sovereigns of the Divine Mansion (Shénxiāo Jiǔchén Dìshàngdì)**,\nThe **Nine Heavenly Sovereigns of the Born Gods (Jiǔtiān Shēngshén Dìshàngdì)**,\nThe **Five Directions’ Five Elderly Sovereigns (Wǔfāng Wǔlǎo Dìshàngdì)**,\nThe **Five Blessings and Ten Divine Sovereigns of the Great Unity (Wǔfú Shíshén Tàiyǐ Zhēnjūn)**,\nThe **Mid-Heaven Sovereign of the Northern Dipper (Běidǒu Zhōng Gāoshàng Yùhuáng Zūn Dì)**,\nThe **Grand Sovereign of the Northern Celestial Exalted (Běijí Xuánqīng Dàdì)**,\nThe **Imperial Sovereign of the Sun-Court (Rìgōng Tàiyáng Dìjūn)**,\nThe **Royal Sovereign of the Moon-Palace (Yuèfǔ Tàiyīn Huángjūn)**,\nThe **Five Directions’ Five Virtue-Star Sovereigns (Wǔfāng Wǔdé Xīngjūn)**,\nThe **Four Luminaries of the Mysterious Metropolis (Xuándū Sìyào Xīngjūn)**,\nThe **Six Ministers of the Southern Dipper (Nándǒu Liùsī Xīngjūn)**,\nThe **Nine Sovereigns of the Northern Dipper (Běidǒu Jiǔhuáng Xīngjūn)**,\nThe **Three Dipper Sovereigns of East, West, and Center (Dōngxī Zhōng Sāndǒu Xīngjūn)**,\nThe **Five Dipper Central Divine Sovereigns and All Celestial Spirits (Wǔdǒu Zhōngshén Xiānlíng Guān)**,\nThe **Grand Saint of the Heavenly Ganges (Tiāngǎng Dàsèng Kuíguāng Dìjūn)**,\nThe **Three Platforms and Canopy-Star Sovereigns (Sāntái Huágài Xīngjūn)**,\nThe **Twenty-Eight Constellation-Star Sovereigns (Èrshíbā Xiù Fēn Xīngjūn)**,\nThe **Twelve Zodiacal Mansion-Star Sovereigns (Shíèr Gōng Fēn Xīngjūn)**,\nThe **Sixty Heavenly Stems-and-Branches-Star Sovereigns (Liùshí Jiǎzǐ Xīngjūn)**,\nThe **Imperial Sovereign of the Sovereign’s Native Star (Huángdì Běnmìng Xīngjūn)**,\nThe **Imperial Heir’s Native Star Sovereign (Huángtàizǐ Běnmìng Xīngjūn)**,\nThe **True Ruler of the Celestial Sovereign’s Illuminating Seat (Dìzuò Zhàolín Zhēnzǎi)**,\nThe **True Sovereign of the Heavenly Hosts’ Degrees (Zhōutiān Xiùdù Xīngzhēn)**,\nThe **Three Sovereigns of the Three Elements (Sānyuán Sānguān Dàdì)**,\nThe **True Celestial Worthies of the Three Elemental Registries (Sānyuán Cáofǔ Zhēnxiān)**,\nThe **Four Celestial Worthies of the Northern Celestial Pole (Běijí Sìshèng Zhēnjūn Yuèxià Zhēnzǎi)**,\nThe **Jade Pure Soul-Treasured Ancestral Teachers of All Generations (Lìdài Shī Zhēnzǔshī)**,\nThe **Supreme Celestial Saints of the Three Heavens (Sāntiān Dàsèngshī Zhèngyī Zhēnjūn)**,\nThe **Three Worthies of the Supreme Unity (Zhèngyī Sānshī Zhēnjūn)**,\nThe **Two True Worthies of the Wang and Zhao (Zuǒyòu Wáng Zhào Èr Zhēnrén)**,\nThe **Thirty-Sixth Generation Celestial Master (Sānshíliùdài Tiānshī Xūjìng Zhēnjūn)**,\nThe **Supreme Unity’s Generational Transmission Teachers (Lìdài Chuánjiào Shī Zhēn)**,\nThe **True Celestial Saints of the Three Caverns and Four Auxiliaries (Sāndòng Sìfú Jīnglù Zhōngzhēn Xiānshèngshèng)**,\nThe **Nine Heavenly Inspectors (Jiǔtiān Cǎifǎng Shī Zhēnjūn)**,\nThe **Supreme Celestial Worthies of the Heavenly Registries (Tiān Cáofǔ Tàihuáng Wànfú Zhēnjūn)**,\nThe **True Rulers of the Nine Heavenly Registries (Jiǔtiān Tiān Cáofǔ Lièbān Zhēnzǎi)**,\nThe **Twelve Celestial Worthies of Master Xǔ of the Western Mountains (Xīshān Xǔ Hào Shíèr Wèi Zhēnjūn)**,\nThe **True Worthies of the Supreme Primordial Sage (Tàijí Xiānwēng Zhēnjūn)**,\nThe **Three Celestial Worthies of the Canopy (Huágài Sānxiān Zhēnjūn)**,\nThe **Three Worthies of the Mao Peaks and the Sovereign of Destiny (Sānmáo Sīmìng Zhēnjūn)**,\nThe **High Law-Rulers of All Divine Offices (Zhūsī Yuànfǔ Zhǔ Fǎgāo Zhēn)**,\nThe **True Rulers of the Upper Realm’s Assembly of Worthies (Shàngjiè Cháoyuán Zhēnzǎi Léitíng Fǎbù Guānjūn)**,\nThe **Lawful Officials and Soldiers Subordinate to the Law-Pacifying Bureau (Fǎjìng Suǒshǐ Guānjiàng Bīng)**,\nThe **Five Sacred Sovereigns of the Five Mountains and Five Heavens (Wǔyuè Wǔtiān Shèngdì Yuèfǔ Wēilíng)**,\nThe **Water-Court Sovereigns of the Supporting-Sun Tree and the Watery Realm’s Celestial Worthies (Shuǐfǔ Fúsāng Dàdì Shuǐxiāng Xiānzhòng)**,\nThe **True Responsive Spirits of the Three Realms’ City Deities and Earthly Spirits (Sānjiè Chénghuáng Sìdiǎn Yìnggǎn Zhēnlíng)**,\nThe **Five Inner Court Deities (Nèitíng Wǔsì Zhīshén)**,\nThe **Incense-Officials and Messengers of the Great Offering (Jiàojiào Xiāngguān Shǐzhě)**,\nAnd the **True Inspectors of the Mysterious Void’s Descending Rectification (Xuánxū Xiàjiàng Jiǔchá Zhēnshǐ)**.\n\nWith deepest reverence, we await Your **Boundless Mercy (Hóngcí)**,\nAnd Your **Piercing Discernment (Diūjiàn)**.\n\nYour humble servant, in profound submission, acknowledges:\nThat the **Dao encompassing Heaven and Earth (Fànwéi Tiāndì Dàodé)**\nIs achieved through the **Three Qi (Sānqì)**, by which the **Primordial Essence (Húnníng)** is perfected.",
      "overlap_context": "e **Thirty-Six Imperial Seal-Bearers** (Zhífú Zhíri),\nAnd the **Thirty-Six Celestial Incense Officials** (Zhíri Xiāngguān),\nAll **Thirty-Six in number** (gè sānshíliù rén chū), shall emerge.\n\n**The Emerging Spirits:**\nThey shall be arrayed in solemn attire (chūzhě, yán zhuāng).\n\n**Opening the Celestial and Terrestrial Portals:**\nThe gates of the Mysterious Primordial Hall (Xuán tán) and the Earthly Deities (Tǔdì) shall be unlocked,\nAnd the territorial spirits (Fāngyù shénzhēn) shall be summoned.",
      "start_char": 266,
      "end_char": 910,
      "start_sentence": 22,
      "end_sentence": 28,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 40.1483519077301,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓设醮仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "昭回云汉之章，自五篇而敷落。 至阳赫赫，大量玄玄。 妙不可以言思，功实参於化宵。 顾斋科之肇立，惟醮设以先垂； 愿精感以回天，协寅恭而卜日。 昭事上帝，松花之会实临； 怀柔百神，蕴藻之诚可荐。 感通靡间，鉴享无遗。 以今臣等恭承旨命，以虔祈敬。 款上玄之飙驭。 香案之祥烟散彩，蜡台之瑞影交辉。 凫舄鸳行，俨分班於左右； 龙旗鸾辂，想驾景於空浮。 着明悬两曜之光，经纬仰众星之拱。 幽明洞启，地神涌玉局之傍； 浩渺泓澄，水帝出珠宫之表。 金蚪策雾，远辞三岛之仙乡； 铁马嘶风，近侍九重之香案。 众真交会，万象森罗。 瞻穆穆之皇皇，敬雍雍而肃肃。 俯临法席，惠鉴精诚。 臣与礼官法众等，谨稽首再拜，遥望天阶，祇迎圣驾。 降醮筵两班列圣 三界众真，醮筵列圣。 向伸奉请，谅沐光临。 请肃整於仙班，共祇迎於帝驭。 降七御 鸾舆至止，鹤驾临轩。 与醮众真，如仪朝礼。 朝礼既周，各升坛座。 臣与礼官等，再拜上香，恭行初献。 初献法事 重称法位",
      "translated_text": "The **Illuminating Chapter of the Clouded Han** unfolds from the Five Classics.\nThe **Supreme Yang** blazes forth, its **Boundless Virtue** profound and mysterious.\n\nIts **Mysteries** transcend speech and thought,\nIts **Manifest Power** partakes in the **Cosmic Transformation** of night.\n\nBeholding the **origin of the Ritual of Abstinence and Offerings (Zhāojiào)**,\nWe first establish the **Great Offering (Jiào)**—\nMay our **sincere invocation** turn the **Heavenly Response (Huìtiān)**,\nAnd may we **align with the auspicious and reverent** to **divine the day (Bùrì)**.\n\nIlluminating service to the **Supreme Deity (Shàngdì)**,\nThe **Pine and Flower Assembly (Sōnghuā Huì)** truly convenes;\nEmbracing the **Hundred Spirits (Bǎishén)** with **gentle conciliation (Huáiróu)**,\nThe **Sincere Devotion (Yùnzǎo)** may be **proffered as tribute (Jiàn)**.\n\nThe **Piercing Discernment** knows no obstruction,\nThe **Graceful Bestowal** leaves nothing unshared.\n\nNow, Your humble servants, in **reverent submission (Qíánqíjìng)**,\nAwait Your **Edict (Zhìmìng)** with **pious prayer (Qíjìng)**.\nWe **solicit the Mysterious Sovereign’s (Xuánzhǔ)** swift guidance.\n\nThe **auspicious incense vapors** disperse in **rainbow hues (Sǎncǎi)**,\nThe **luminous candle shadows** intermingle in **divine radiance (Jiāohuī)**.\n**Mandarin ducks and cranes** advance in **harmonious ranks (Fēnxì yuānxíng)**,\n**Serene and orderly**, dividing their **ceremonial stations (Fēnbān)** on either side;\n\n**Dragon banners and phoenix chariots** appear in **visionary splendor (Lóngqí luányú)**,\n**Imagined in the celestial procession (Xiǎngjià)** floating through the void.\nWe **don the luminous robes**, gazing upward at the **two celestial lights (Liǎngyào)**,\nAnd **align the cosmic threads**, revering the **clustered stars (Zhòngxīng)** in their **supporting arc (gǒng)**.\n\nThe **dim and bright** are **fully revealed (Yōumíng dōngqǐ)**,\nThe **Earthly Spirits** surge beside the **Jade Formation (Yùjú)**;\nThe **vast and boundless** depths **cleanse and brighten (Hàomiǎo hóngchéng)**,\nThe **Water Emperor** emerges from the **Pearl Palace (Zhūgōng)** beyond.\n\n**Golden Tortoises** command the **misty ranks (Jīnniú cèwù)**,\n**Farewell to the Three Isles’ (Sāndǎo)** **Celestial Homeland (Xiānxiāng)**;\n**Iron-Hoofed Steeds** neigh in the **wind (Tiěmǎ sīfēng)**,\n**Nearly attending** at the **Ninefold Incense Altar (Jiǔchóng xiāng’àn)**.\n\nThe **Multitudes of True Ones** gather in **cosmic array (Zhòngzhēn jiāohuì, Wànxiàng sēnluó)**,\nWe **behold the solemn and majestic (Zhānmùmù huánghuáng)**,\nAnd **pay homage with reverent awe (Jìng yōngyōng sùsù)**.\n\nDescending to the **Ritual Assembly (Fǎxí)**,\nYour **Graceful Inspection (Huìjiàn)** witnesses our **sincere devotion (Jīngchéng)**.\n\nYour humble servants, along with the **Ritual Officials (Lǐguān)** and **Lawful Assembly (Fǎzhòng)**,\n**Solemnly kowtow twice (Jǐn qǐshǒu)**,\n**Gazing afar** at the **Heavenly Steps (Tiānjiē)**,\n**Devoutly welcoming** the **Sacred Procession (Shèngyú)**.\n\n**The Seven Celestial Rulers descend (Jiàng)**,\n**Phoenix Chariots arrive (Luányú zhǐzhǐ)**,\n**Crane-Drawn Chariots** **hover at the veranda (Hèjià línchuán)**.\nWith the **Assembled True Ones of the Great Offering (Jiàozhòng zhēnzhēn)**,\nWe **conduct the rites as prescribed (Rúyí cháolí)**.\n\nThe **ceremonial rites are fully completed (Cháolí jìzhōu)**,\nEach **ascends to their respective platform (Zéng shēngtánzuò)**.\nYour humble servants, along with the **Ritual Officials (Lǐguān)**,\n**Kowtow twice and offer incense (Zàibài shàngxiāng)**,\n**Reverently performing the First Tribute (Qíngxíng chūxiàn)**.\n\n**First Tribute Rites (Chūxiàn Fǎshì)**\n**Repeatedly proclaim the Lawful Rank (Chóngchēng fǎwèi)**.",
      "overlap_context": "Offering (Jiàojiào Xiāngguān Shǐzhě)**,\nAnd the **True Inspectors of the Mysterious Void’s Descending Rectification (Xuánxū Xiàjiàng Jiǔchá Zhēnshǐ)**.\n\nWith deepest reverence, we await Your **Boundless Mercy (Hóngcí)**,\nAnd Your **Piercing Discernment (Diūjiàn)**.\n\nYour humble servant, in profound submission, acknowledges:\nThat the **Dao encompassing Heaven and Earth (Fànwéi Tiāndì Dàodé)**\nIs achieved through the **Three Qi (Sānqì)**, by which the **Primordial Essence (Húnníng)** is perfected.",
      "start_char": 910,
      "end_char": 1314,
      "start_sentence": 29,
      "end_sentence": 61,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 14.64314603805542,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓设醮仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "具位臣姓某与临坛官众等，谨重诚再拜上启虚无自然三清三境天尊，金阙至尊三皇上帝，承天效法后土皇地只，诸天诸地诸水诸山，三界十方，千真万圣，醮筵感降一切威灵。 恭望洪慈，俯垂洞鉴。 臣伏以有愿必从，应默同於影响； 无德不报，敬实在於精诚。 仰惟皇极之尊荣，恭按师真之教典，斋修金箓，仪敬展於朝修； 诚格鸾舆，礼毕陈於醮谢。 理无有二，事岂悬殊。 惟求福之不回，皆至诚之所感。 洋洋在上，洞洞乎中。 设醮青词，谨当宣奏。 宣词 恭承词旨，备极精诚。 惟一念之恳祈，庶几默感； 在多仪之克享，敢荐明禋。 皇皇上帝之临，濯惧百灵之会。 居歆献奠，肆集祯祥。 聪明睿知，足以有临； 号令文章，焕乎可述。 无为而治，克臻清静之风； 有物皆春，永乐太平之世。 皇图广大，圣算绵长。 臣与礼官等，再拜上香，恭行亚献。 亚献法事 臣谨重诚上启虚无三清、上圣妙有十极高真，三界万灵、十方众圣，醮筵感降一切真灵。 恭望洪慈，俯垂洞鉴。 臣伏以临汝而无有贰，上帝居歆； 体物而不可遗，敬神如在。 惟俯摅於丹悃，用仰答於洪恩。 首陈之志拳拳，皈倚之诚翼翼。 伏愿神享于诚，天作之福。 流恩家国，永扬不息之机； 敛福宗藩，式副虔祈之请。 有求皆应，无感不通。 臣等致恭，礼伸终献 终献法事 宣状疏",
      "translated_text": "**With the Assembled Officials and True Ones (Jùwèi chén xìngmǒu yǔ lín tán guānzhòng děng),**\n\nWe **solemnly and devoutly kowtow twice** and **offer incense in supplication (qǐngxiāng shàngqǐ)** to the **Formless Void of Nature’s Dao (Xūwú zìrán)**, the **Three Sovereigns of the Three Realms (Sānqīng sānjièng tiānzūn)**, the **Most Venerable of the Golden Gate (Jīnquè zhìzūn)**, and the **Three August Emperors of Heavenly Authority (Sānhuáng tiāndì)**.\nWe **honor the Earthly Sovereign (Hòutǔ huángdì zhǐ)** who **receives Heaven’s mandate and follows its laws (Chéngtiān xiàofǎ)**.\nTo the **Assemblies of All Heavens, All Earths, All Waters, and All Mountains (Zhūtiān zhūdì zhūshuǐ zhūshān)**,\nTo the **Three Realms and Ten Directions (Sānjiè shí fāng)**, the **Thousands of True Ones and Ten Thousands of Saints (Qiānzhēn wànshèng)**,\nWe **prayerfully invite all to descend in response (Jiàozhòng gǎnjiàng yīqiè wēilíng)**.\n\n**Reverently gazing upon the boundless mercy (Gōngwàng hóngcí)**,\n**Humbly awaiting the all-pervading insight (Fǔchuí dòngjiàn)**.\nYour humble servants **prostrate themselves**, for **wishes granted must be sincere (Yǒuyuàn bì cóng)**,\nAnd **the unspoken will align with the resonant Dao (Yìngmò tóng yú yǐngxiǎng)**;\n**Virtue unanswered cannot be (Wúdé bù bào)**,\nYet **devout sincerity alone suffices (Jìngshí zài yú jīngchéng)**.\n\nWe **solemnly reflect upon the august dignity of the Supreme Dao (Wǎngwěi huángjí zhī zūnróng)**,\nAnd **reverently follow the precepts of the True Teachers (Gōngàn shīzhēn zhī jiàodiǎn)**.\nWith **fasting and ritual purity (Zhāixiū jīnluán)**,\nWe **conduct the rites with utmost solemnity (Yíjìng zhǎn yú cháoxiū)**;\nOur **sincerity reaches even the Phoenix Chariots (Qínggé luányú)**,\nAnd **our completed rites are presented in gratitude (Lǐbì chén yú jiàoxiè)**.\n\n**Truth admits no duality, nor do rites differ in significance (Lǐ wú yǒu èr, shì qǐ huìshū)**.\nWe **seek only that blessings may not falter (Wéi qiú fú zhī bù huí)**,\nFor **all are moved by devout sincerity (Jiē zhìchéng zhī suǒ gǎn)**.\n\n**The Dao is vast above, and its mysteries profound within (Yángyáng zài shàng, dòngdòng hū zhōng)**.\nWe **present the Green Petition (Shèjiào qīngcí)**,\nAnd **diligently recite the sacred words (Jǐn dāng xuānzòu)**.\n\n**Recitation of the Sacred Words (Xuāncí)**\n**Reverently following the edict’s intent (Gōngchéng cízhǐ, bèijí jīngchéng)**,\nWith **one earnest thought (Wéi yīniàn zhī kuǎnqí)**,\nWe **hope for silent response (Shùjī mògǎn)**;\nIn **many rites performed (Zài duōcí zhī kèxiǎng)**,\nWe **dare to offer the sacred sacrifice (Gǎn jiàn mínggǎn)**.\n\n**The august presence of Heavenly Authority descends (Huánghuáng tiāndì zhī lín)**,\nAnd **the assembly of all spirits trembles in awe (Zhuójù bǎilíng zhī huì)**.\nWith **our offerings and libations placed (Jūxīn xiàndiàn)**,\nWe **gather auspicious omens in abundance (Shìjí zhēnxiáng)**.\n\n**Plenitude of wisdom and sagacity (Cōngmíng ruìzhī)**,\nIs **sufficient to manifest their presence (Zúyǐ yǒulín)**;\n**Their commands and decrees (Hàolìng wénzhāng)**,\nAre **radiant and worthy of recounting (Huànhù kě shù)**.\n\n**Governance without action (Wúwéi ér zhì)**,\nAchieves **the refined wind of tranquility (Kèzhēn qīngjìng zhī fēng)**;\n**All things flourish in spring (Yǒuwù jiē chūn)**,\nAnd **eternal joy brings the age of great peace (Yǒnglè tàipíng zhī shì)**.\n\n**The Heavenly Plan is vast and boundless (Huángtú guǎngdà)**,\nAnd **the Sacred Calculations stretch without end (Shèngsuàn miáncháng)**.\nYour humble servants, along with the **Ritual Officials (Lǐguān)**,\n**Kowtow twice and offer incense (Zàibài shàngxiāng)**,\n**Reverently performing the Second Tribute (Gōngxíng yàxiàn)**.\n\n**Second Tribute Rites (Yàxiàn Fǎshì)**\nYour humble servants **solemnly and devoutly kowtow twice** and **offer incense in supplication (Shàngqǐ)** to the **Formless Void (Xūwú)** of the **Three Sovereigns (Sānqīng)**, the **Supreme Saints of Mysterious Existence (Shàngshèng miàoyǒu shíjí gāozhēn)**,\nTo the **Ten Thousands of Spirits and Ten Thousands of Saints (Wànlíng shíshèng)** in the **Three Realms and Ten Directions (Sānjiè shífāng)**,\nWe **prayerfully invite all to descend in response (Jiàozhòng gǎnjiàng yīqiè zhēnlíng)**.\n\n**Reverently gazing upon the boundless mercy (Gōngwàng hóngcí)**,\n**Humbly awaiting the all-pervading insight (Fǔchuí dòngjiàn)**.\nYour humble servants **prostrate themselves**, for **Heavenly Authority descends without hesitation (Wéi yǒulín wú èr)**;\n**The spirits reside in reverence (Shìzhēn jūxīn)**,\nAnd **we honor the gods as though they were present (Tǐwù ér bùkě yí)**.\n\nWe **humbly submit our red sincerity (Wéi fǔ yǒng yú dānxūn)**,\nAnd **loftily respond to boundless grace (Yòng yǎngdá yú hóng’ēn)**.\nOur **earnest devotion is unceasing (Shǒuchén zhī zhì quánquán)**,\nAnd **our repentance is unwavering (Guīyǐ zhī chéng yìyì)**.\n\nWe **humbly pray that the gods may accept our sincerity (Fúyuàn shénxiǎng yú chéng)**,\nAnd **grant celestial blessings (Tiān zuò zhī fú)**.\nMay **grace flow eternally to our kin and realm (Liú’ēn jiāguó)**,\nAnd **auspicious merit be perpetually extolled (Yáng yáng bùxī zhī jī)**;\nMay **blessings gather at our ancestral shrine (Liǎnfú zōngfān)**,\nAnd **fulfill our pious entreaties (Shìfù qiánqí zhī qǐng)**.\n\n**All requests are answered, and no devout appeal goes unfulfilled (Yǒuqiú jiē yìng, wúgǎn bù tōng)**.\nYour humble servants **pay utmost reverence (Zhìgōng)**,\nAnd **complete the rites with the Final Tribute (Lǐshēn zhōngxiàn)**.\n\n**Final Tribute Rites (Zhōngxiàn Fǎshì)**\n**Recite the Sacred Petition (Xuānzhàng)**.",
      "overlap_context": "ring (Jiàozhòng zhēnzhēn)**,\nWe **conduct the rites as prescribed (Rúyí cháolí)**.\n\nThe **ceremonial rites are fully completed (Cháolí jìzhōu)**,\nEach **ascends to their respective platform (Zéng shēngtánzuò)**.\nYour humble servants, along with the **Ritual Officials (Lǐguān)**,\n**Kowtow twice and offer incense (Zàibài shàngxiāng)**,\n**Reverently performing the First Tribute (Qíngxíng chūxiàn)**.\n\n**First Tribute Rites (Chūxiàn Fǎshì)**\n**Repeatedly proclaim the Lawful Rank (Chóngchēng fǎwèi)**.",
      "start_char": 1314,
      "end_char": 1833,
      "start_sentence": 62,
      "end_sentence": 97,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 23.42715811729431,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓设醮仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "臣谨重诚上启三清上帝，十极高真，玄穹帝座，星真厚地，洞天海岳、醮筵感降，一切威灵。 臣伏以晋接惟恭，幸仰瞻於天仗； 节文成礼，敢久款於飙车。 辉辉蜡炬之残，袅袅炉香之烬。 金锺韵息，玉漏声催。 乘清气而御阴阳，目送龙舆之举； 戴皇天而履厚土，躬依鸿覆之仁。 臣与礼官法众等，无任攀恋感恩荷德之至。 谨稽首再拜，奉辞圣驾。 送圣颂 存神烧香香官使者、左右龙虎君、侍香诸灵官，当令臣向来设醮之所，自然生金液丹碧芝英。 百灵众真，交会在此，香火洞案炉前。 当愿十方仙童，玉女接侍，兰烟传臣向来所启之诚，速达径御至真无极大道三清上圣昊天至尊金阙玉皇上帝御前。 金箓设醮仪竟",
      "translated_text": "Your humble servant, with utmost sincerity and reverence, **prostrates before the Three Pure Ones and Supreme Deities, the Ten Directions’ Highest Worthies, the Mysterious Vault of Heaven’s Imperial Seat, the Starry Worthies of the Profound Earth, and the Cavernous Heavens and Oceanic Mountains**, where the **sacrificial rites have evoked the descent of all august and numinous spirits**.\n\nWith **solemn devotion**, your servant **humbles beneath the celestial mandate**, daring to **behold the divine chariot’s ascent**; with **ritual propriety fulfilled**, how dare we **linger beneath the gusting winds of the sacred vehicle**?\n\nThe **radiant candles flicker to embers**, the **spiraling incense smolders to ash**.\nThe **golden chimes fall silent**, the **jade water-clock’s tolls hasten**.\n\n**Riding the pure qi and commanding yin-yang**, we **watch the dragon carriage ascend**;\n**Beneath the august Heaven and upon the profound Earth**, we **rely on the boundless benevolence of the Sovereign’s embrace**.\n\nYour servant, together with the **ritual officials and the assembled Daoist assembly**, is **utterly overwhelmed by gratitude, indebtedness, and the weight of received virtue**.\n\nWith **deepest reverence**, we **prostrate and bow twice**, and **offer our words to the Sacred Procession**.\n\n**Hymn of Farewell to the Sacred**\nTo the **Spirit-Guardians who tend the incense, the Incense-Officers, the Left and Right Dragon-Tiger Lords, and the Attendant Spirits of the Incense**, may it be decreed that **wherever your servant has established the rites, golden elixirs and jade-green herbs shall spontaneously arise**.\n\nMay the **hundred spirits and worthies gather here**, their **qi converging at the incense altar and furnace before us**.\nMay the **ten-directional celestial youths and jade maidens attend in attendance**, and **through the fragrant mists convey your servant’s sincerity as previously offered, swiftly reaching the Supreme Dao of the Limitless, the Three Pure Ones, the Most High Sovereign of the Golden Gate, the Jade Emperor, Supreme Deity of Heaven, before the Celestial Court**.\n\n**The golden talisman rites are now complete**.",
      "overlap_context": "it be perpetually extolled (Yáng yáng bùxī zhī jī)**;\nMay **blessings gather at our ancestral shrine (Liǎnfú zōngfān)**,\nAnd **fulfill our pious entreaties (Shìfù qiánqí zhī qǐng)**.\n\n**All requests are answered, and no devout appeal goes unfulfilled (Yǒuqiú jiē yìng, wúgǎn bù tōng)**.\nYour humble servants **pay utmost reverence (Zhìgōng)**,\nAnd **complete the rites with the Final Tribute (Lǐshēn zhōngxiàn)**.\n\n**Final Tribute Rites (Zhōngxiàn Fǎshì)**\n**Recite the Sacred Petition (Xuānzhàng)**.",
      "start_char": 1833,
      "end_char": 2114,
      "start_sentence": 98,
      "end_sentence": 111,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 4.767517566680908,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓设醮仪.txt",
        "category": "威仪类"
      }
    }
  ]
}