{
  "source_id": "金石簿九五数诀",
  "source_file": "chunked_daozang\\金石簿九五数诀.json",
  "total_chunks": 5,
  "total_original_chars": 2682,
  "total_translated_chars": 13517,
  "total_translation_time": 36.81306004524231,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\金石簿九五数诀.txt",
    "category": "众术类"
  },
  "full_translation": "**Title:** *The Five-Nine Numerical Key for Gold and Stone*\n**Scripture Name:** *The Five-Nine Numerical Key for Gold and Stone*\n**Tang Dynasty Work.** One scroll.\n**Source:** *Zhengtong Daozang*, *Dongshen* (Cavernous Gods) Section, *Zhongshu* (Miscellaneous Arts) Category.\n\n---\n\n**The Five-Nine Numerical Key for Gold and Stone**\n\nHe who seeks the Dao to obtain the elixir must first discern metals and stones, determining their forms and substances, and knowing the laws by which their virtues and flaws manifest.\n\n**Cinnabar (朱砂):**\nFrom Chen Prefecture (辰州), as large as peaches or dates, luminous and translucent like a pomegranate—this is the finest. If such is unavailable, use the best from *Maoya* (马牙). Next, take the deepest purple; the rest are unfit.\n\n**Realgar (雄黄):**\nFrom Wudu (武都), the color of a rooster’s comb, fine and moist with a reddish luster—this is superior. The crimson variety from Persia is inferior.\n\n**Jade (玉):**\nFrom Luantian (蓝田), its forms and hues vary, with white being the finest. Seek clarity, luster, and flawlessness; when struck, it should emit a clear chime—this is the best.\n\n**Sulfur (石硫黄):**\nFrom the forests of Lingnan (岭南), known as *Kunlun Yellow* (昆仑黄), the finest glows like amber. Persian sulfur is also usable but inferior in origin.\n\n**Pumice (诱石):**\nFound in crane and stork nests, its forms and sources vary. Only that from Liang and Han (梁汉), Jingzhou (并州), Songshan (嵩山), and Yongzhou (雍州) valleys—when split, resembling a twisted rope or *muzi* (暮子) fruit, large as a bowl or small as a fist, white as jade—is superior. All other sources are unfit.\n\n**Red Stone Pitch (赤石脂):**\nFrom Hao Prefecture (昊郡) and Ze Prefecture (泽州), smooth and glossy like rendered fat—this is the finest.\n\n**White Stone Pitch (白石脂):**\nFrom Hao Prefecture, sharing its source with red stone pitch, its form like congealed fat—this is the finest.\n\n**Rock Crystal (白石英):**\nFrom Shouyang (寿阳) and Ze Prefecture, its varieties are many. Seek transparency without blemish, and when submerged, it should blend with water—this is the best, regardless of size.\n\n**Mica (云母):**\nFrom Langya (琅琊), Pengcheng (彭城), Qingqi (青齐), and Luyou (庐州), it appears in six forms. When viewed in sunlight, it reveals:\n- Yellow-white with green tints: *Yunying* (云英).\n- Green-yellow with crystalline brilliance: *Yunyè* (云液).\n- Pure white without admixture: *Yunjing* (云精).\n- Green-white with black streaks: *Yumu* (云母).\nThe finest shimmers with five colors, dazzling the eye.\n\n**Stone Calcite (石锺乳):**\nFrom Sha Prefecture (邵州), it need not be the finest in refinement, but if its color is lustrous, its bulk substantial and thick—it is usable.\n\n**Lodestone (磁石):**\nFrom Ci Prefecture (磁州), if it attracts six or seven *jian* (缣, a silk measure) of iron, it is superior and usable.\n\n**Borax (石脑):**\nThough native to Maoshan (茅山) and Siping (四平), the finest comes from Puchou (蒲州), its color like fresh snow. Persian borax is superior.\n\n**Sunrise Stone (阳起石):**\nThe root of mica, its hues vary. Only the yellow-white from Taishan (太山) is superior; the pure white from Xingyi (邢益) and Que Mountain (鹊山) is the best.\n\n**Gold Ore (金精):**\nTake unrefined, raw ore, its color like turquoise, marked with abundant golden specks—this is the finest.\n\n**Yellow Alum (黄矾):**\nFrom Guazhou (瓜州), it appears in five forms. In Daoist refining, yellow-white is most used; others are rarely employed. Its shape resembles gold, and when broken, reveals golden veins. When rubbed on silver, it turns yellow, capable of binding mercury so it adheres without falling. If it resembles *Maoya* (马牙) in form but crumbles when burned, it is unfit.\n\n**White Alum (白矾):**\nFrom Hao Prefecture is superior; from Zhao Prefecture, secondary. Others are unfit.\n\n**Crimson Alum (绛矾):**\nFrom Persia, resembling turquoise glass, the clearest is finest. All other sources are unfit.\n\n**Chicken Droppings Alum (鸡屎矾):**\nFrom Persia, its form resembles chicken droppings, its color a mix of green, yellow, and white. In this Dao, it is deeply secret and essential.\n\n**Teaching Alum (诲矾):**\nFrom Annan (安南) and Heling (呵陵), its color is red, yellow, or black. Among the five alums, this is indispensable. When broken, true specimens bear golden specks.\n\n**Azurite (空青):**\nFrom Liu Prefecture (柳州) and Yue Prefecture (越州), its color is deep blue-green, resembling spiral patterns, hollow within with a central void like a *Kunlun* peak. When fitted with a tree’s seedling, it aligns perfectly. If it bears golden specks like a *kǎokǎo* (拷拷) pattern, it is the finest. Also found in Guangzhou. This substance is often counterfeited; true specimens are rare and deeply secret in this Dao. Small spherical granules are also called *kongqing* (空青). *Zengqing* (曾青) differs not at all—false distinctions have been made. All green granules and their \"mother\" ore are likewise called *zengqing*, not merely the granular form. Today, each medicine has its distinct name; one must not dismiss the ancients’ classifications. I have listed them separately accordingly.\n\n**Malachite (曾青):**\nFrom Shushan (蜀山) and Yue Prefecture is finest, its color like turquoise or yellow gentian, or the green-purple of earthworm droppings—this is superior.\n\n**Stone Rose (石桂英):**\nFrom lactating sources, its color is pure white, staining the hand like snow when held—this is the finest.\n\n**Flint (理石):**\nFrom Liang Prefecture (梁州), Qingning (青宁), and Sanzhou (三州), it is excellent. When drawn like a needle, its yellow-white luster is most prized.\n\n**Niter (朴硝):**\nFrom Yizhou (益州), unexposed to wind is finest. Its color should not be dry or green-tinged—this is the best.\n\n**Saltpeter (磋硝):**\nFrom Yizhou, accumulated like frost in shaded earth. Some say it also comes from fire mountains, and snow-white, moist specimens are superior.\n\n**Stone Gall (石胆):**\nFrom Liang Prefecture and Xindu (信都), the finest is processed with *qiangli* (羌理), its color green with blue tints. Some from Laoshan (唠山) resembles a crescent moon, yellow-green in hue—this is good. Of these, Laoshan is slightly superior, but none surpass the quality of Puchou’s.\n\n**Saltpeter (硝石):**\nNatively from Liang Prefecture (梁州), Qiang Prefecture (羌武都), and Longxi (陇西), but that from Wuzhang (乌长国) is superior. During the Tang dynasty’s *Lín Dé* (麟德) era, in the year *Jiǎzǐ* (甲子), there was a Central Asian monk named *Fǎlín* (法林), a disciple of the *Bóluómén* (婆罗门) sect, who carried a *Fànjiǎ* (梵甲)—likely a Buddhist scripture or talisman—here to translate. He was instructed to make pilgrimage to Wutai Mountain (五台山), and upon reaching Fenzhou (汾州), Lingshi County (灵石县), he inquired: *\"This place has abundant saltpeter—why not collect and use it?\"*\n\nAt that time, there were twelve men, including *Zhào Rúguī* (赵如珪) and *Dù Fǎliàng* (杜法亮), who accompanied the monk in gathering it. After testing, they found it entirely unfit—far inferior to that of Wuzhang (乌长). Then, journeying to Zezhou (泽州), they saw its mountains lush and refined. Again, they were told: *\"This place also has saltpeter—how could it be unfit for use?\"* So, they took the monk *Língwù* (灵悟) along to collect it. Upon refining, it emitted a purple *qīnyīn* (紫姻) glow like a beacon. They said: *\"This is a sacred medicine, capable of transforming the five metals—when all stones are exposed to it, they dissolve into water.\"* Comparing it with Wuzhang’s, they realized that Zezhou’s saltpeter was indeed usable. Repeated tests with metal confirmed its potency. Though slightly softer than Wuzhang’s, it was still effective.\n\n**Heavenly-Clear Sand (天明砂):**\nFrom the country of *Bōsī* (波斯), it is capable of tempering the five metal tools. This medicine is particularly prone to counterfeiting, so one must test it personally to distinguish true from false. When held in the mouth, it leaves no bitter, sour, or salty taste. The finest specimens are greenish-white in color. When refined, it does not boil, and its juice flows like water, drying to a consistency akin to *jiāogū* (胶枯)—a resinous substance. This is the true article. If it emits a purple *qīnyīn* (紫姻) vapor upon refining or has a lacquer-like residue on its surface, it is also genuine. One may then select and use it accordingly.\n\n**Yellow Flower Stone (黄花石):**\nThough once renowned yet useless, the true *Huánghuā Shí* originates from *Bōsī*—its finest. That from *Jiāngshù*’s *Běitíng* in *Qiánzhōu* ranks second, while inferior specimens abound wherever copper ore is found, rendering them unusable. Its form resembles copper ore, marked by golden specks and a crimson hue. When heated strongly, it emits a pungent *qīnyīn* blackness; when ground with mercury, it rises to the surface—this is the genuine article from *Bōsī*.\n\nSome claim it resembles *zǐkuàngyù* (紫矿欲) or *qílínjié* (麒麟竭), but this is false. The true stone simply gleams with a lustrous sheen.\n\n**Ashless Wood (不灰木):**\nHailing from *Bōsī*, it is the root of silver ore, resembling rotted wood. Even after prolonged heating, it does not ash; when burned, it remains greenish like wood and can refine mercury. Inferior specimens from other regions are unfit for use—*Bōsī*’s is supreme.\n\n**Steppe Salt (戎盐):**\nFound thirty *lǐ* beyond the city walls on high cliffs, it flows naturally, not crafted by man. Tasting it reveals no saltiness or throat-searing bite. True specimens are discerned by stacking eggs—good or poor becomes evident. Some say it comes from *Róngzhōu*, with greenish-white hues being finest. Its origin remains unclear, but when tested against *Hédōng*’s *Guānnèi* grain salt, *Róngyán* surpasses all others. Thus, it must be treasured.\n\n**Great Yin Mystic Essence (太阴玄精):**\nExtracted from the salt pools of *Jiěxiàn* in *Hébù*, it is the root of salt. Collected near water, it resembles jade or tortoiseshell. Black, dense specimens are worthless, while yellow-white, pure ones are finest. This too refines mercury into powder. Compared to *Yánzhōu* salt, it is slightly superior—hence, *Yánzhōu*’s is the best.\n\n**Bitter Brine (卤咸):**\nFrom the marshes seventeen to eighteen *lǐ* northeast of *Tóngzhōu*, it is another salt root, resembling fine *Hédōng* grain salt but tasting bitter, not salty. No region in this text matches it. Commonly misused is the soft, black, white-veined earth from flatlands, mistaken for brine—this is gravely erroneous.\n\n**Slipstone (滑石):**\nFinest specimens come from *Càizhōu* and *Qīngzhōu*, yet many mistakenly use that from *Kūnlún*, which, when mixed with *liùyīní* (六一泥), proves entirely unsuitable. For medicinal use, *Kūnlún*’s slipstone excels—its soft, white body, wax-like when shaved, is supreme.\n\n**Cold Water Stone (寒水石):**\nThe best is pure white, resembling water—this is the true article.\n\n**Barite (胡同律):**\nOriginally derived from the sap of a Western Domain tree, where its resin flows and congeals into this medicine. Also called *Hútóng Lèi* (胡同泪). The common folk, unaware of its true name, mistakenly call it *Hútóng Lǜ* (胡同律). Since \"律\" and \"泪\" sound alike, those unfamiliar with its proper name often miswrite it as *lǜ*, leading to widespread error. Its form resembles underground saltstone; goldsmiths use it for casting, and it excels in refining gold and silver—especially for gilding.\n\n**Pomegranate Cinnabar (石榴丹):**\nSourced from *Tàihé Shān*, it resembles a pomegranate in shape, with a reddish exterior and seeds within like those of a pomegranate. Ancient lore claims that one *Yǔ Yóu* ingested it and attained immortality, though its veracity remains unverified. Within this Dao, it holds profound secrecy.\n\n**Yu Remnant Grain (禹余粮):**\nMined from the mountains of *Shùhǎi Shùyáng Zǒuzhōu*, it appears in five hues—blue, yellow, red, white, and black. Recently, people have favored the yellow variety, but the best resembles *púhuáng* (蒲黄), with red also being fine; only the white, pure form is supreme.\n\n**Calcined Sand (炮砂):**\nOnly the luminous, translucent variety is usable. It is said that while fire-mountain sand exists, none surpasses that from *Běitíng* in quality.\n\n**Orpiment (雌黄):**\nFrom *Wǔdū*, its color is bright yellow like gold foil, with a luster like mica when broken; the purest, unadulterated form is best.\n\n**Gold Vein (金芽):**\nPrimarily from *Shǔ Jùn*, also found in *Jīngxiāng Dào*. It is black and smooth, with shattered veins resembling gold thread when fractured. Those afflicted with darkened limbs often brew it into wine for consumption, and it effectively alleviates the condition—known as *Jīnyá Jiǔ* (金牙酒).\n\n**Red Earth (代赭):**\nSourced from the mountains of *Yànmén Jiè*. The red variety is superior; yellow is inferior.\n\n**Further stated:**\nThe *Wèizhōu* border’s *Dàwáng Chéng* produces it, with those bearing red veins being the finest.\n\n**Rock Salt (石盐):**\nFrom *Píngzhōu*’s northern *Xī* borderlands, resembling black mica in form. Those with luster and smoothness are superior. *Yánzhōu* also yields it, though its black, softer variety is inferior—Persian rock salt is the best.\n\n**Amethyst (紫石英):**\nFrom *Tàihé Shān*, shaped like a pounded hemp head, luminous and translucent. Those wrapped in purple with clarity are supreme. The *Chénzhōu* border also produces it, and within this Dao, it is of great importance. Those with a purple, glossy exterior are the finest.\n\n**Yellow Rock Seed (石中黄子):**\nFrom the *Qìnshuǐ* source, shaped like a goose egg. When fractured, yellow juice flows within, like egg yolk. If consumed in measures of three to five *shēng*, it grants immortality and eternal life.\n\n**The Five Metals and Nine Stones’ Numerical Secret is complete.**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "金石簿五九数诀 经名：金石簿五九数诀。 唐代着作。 一卷。 底本出处：《正统道藏》洞神部众术类。 金石簿五九数诀 夫学道欲求丹宝，先须识金石，定其形质，知美恶所处法。 朱砂 出辰锦州，大如桃枣，光明四映彻莹透，如石榴者良。 如无此者，次用马牙上好者为。 次紫色重者为，下并不堪用之。 雄黄 出武都，色如鸡冠，细腻红润者上。 波斯国赤色者为下。 玉 出蓝田，形质不同，有五色，其中白者为上。 但取明诤润泽无瑕，扣之作清声者，为上。 石硫黄 出刑南林邑者，名昆仑黄，光如瑁璃者上。 波斯国亦堪所事用特生。 誉石 出鹳鹊窠中，形质亦多，出处又众，但梁汉并州及嵩山及雍州山谷，斫破如侧揪，又似暮子，大如碗，小如拳，白如玉者，上。 其余所出处，并不堪用。 赤石脂 出昊郡及泽州，色如腆脂细腻者，为上。 白石脂 出昊郡，与赤石脂同处，色如凝脂状者，为上。 白石英 出寿阳及泽州，种数亦多，但取表裹光明而无点污，着水中与水同色者，为上。 无问庞细，皆堪也。 云母 出琅琊、彭城、青齐庐等州，并有此物。 有六种，向日看乃分明，其色黄白多青者，名云英。 色青黄晶日者，名云液。 色唯皎然纯白无杂者，名云精。 色青白而多黑者，名云母。 焕然五彩，曜人目为上。 石锺乳 出邵州，凡於销烁之中，不必要须上好，但颜色润泽，庞而且厚者，即堪用也。 磁石 出磁州，但引得六七缄者，皆名上好，即堪用。 石脑 本出茅山四平，色亦多种，但取蒲州出者，其色如握雪者，即堪入用，波斯国者为上。 阳起石 是云母根，其色有黄黑，唯太山所出黄白者上，邢益齐鹊山纯白者，最良。 金精 取未经炼生者，色如翠碧之，状有金星极多者，良。 黄矾 出瓜州，此物有五种，合炼道中，多用黄白，余者不多入用。 黄矾形如金，打破有金星叶点文，揩着银上，便为黄色，能制水银住汞，汞即着上不落，似马牙形，烧色上碎末者，不堪用。 白矾 出昊地者上，赵地者次，余处者不堪使用。 绛矾 出波斯国，形如碧瑁璃，明诤者则为上好，余所出并不堪用。 鸡屎矾 出波斯国，形如鸡屎，色亦带青黄白，於此道中，深为秘要。 诲矾 出安南及呵陵，形赤黄黑色，此物五矾数内事，须得此为使，打破有金星点是真。 空青 出柳州庐越州，钳色，紫青而且碧，形若螺文，旋空而不实，中心有孔，如昆仑头，又以树蚪子恰相合。 况似拷拷有金星点，是真上。 又出广州。 此物多假，世上少有真者。 此道之中，深为秘要。 其药空中小丸颗者，即名空青。 曾青与空青不异，妄立别名。 但有丸之青，并所怀之母，亦名曾青，不但为颗者。 今诸药本皆立别名，不可非他古人，吾亦依别列矣。 曾青 出蜀山及越州佳，问其色如翠碧，又似黄连，亦如蚯蚓粪青紫色为上。 石桂英 出有乳之处，其色甚白，握之便染手，如把雪者良。 理石 出梁州青宁三州，并好，如索针，颜色黄白润泽可爱者，良。 朴硝 不中风者为上，出益州，颜色状不枯燥，色带青者，良矣。 磋硝 出於益州，如阴地积。 问人云：火山亦有，雪色润者，良。 石胆 出梁州，信都亦有，用羌理者，色青带碧者，良。 有用唠山所出，形如月，黄绿相闻者，好。 此二所出，唠山稍胜，余所出者，不如蒲州者为上。",
      "translated_text": "**Title:** *The Five-Nine Numerical Key for Gold and Stone*\n**Scripture Name:** *The Five-Nine Numerical Key for Gold and Stone*\n**Tang Dynasty Work.** One scroll.\n**Source:** *Zhengtong Daozang*, *Dongshen* (Cavernous Gods) Section, *Zhongshu* (Miscellaneous Arts) Category.\n\n---\n\n**The Five-Nine Numerical Key for Gold and Stone**\n\nHe who seeks the Dao to obtain the elixir must first discern metals and stones, determining their forms and substances, and knowing the laws by which their virtues and flaws manifest.\n\n**Cinnabar (朱砂):**\nFrom Chen Prefecture (辰州), as large as peaches or dates, luminous and translucent like a pomegranate—this is the finest. If such is unavailable, use the best from *Maoya* (马牙). Next, take the deepest purple; the rest are unfit.\n\n**Realgar (雄黄):**\nFrom Wudu (武都), the color of a rooster’s comb, fine and moist with a reddish luster—this is superior. The crimson variety from Persia is inferior.\n\n**Jade (玉):**\nFrom Luantian (蓝田), its forms and hues vary, with white being the finest. Seek clarity, luster, and flawlessness; when struck, it should emit a clear chime—this is the best.\n\n**Sulfur (石硫黄):**\nFrom the forests of Lingnan (岭南), known as *Kunlun Yellow* (昆仑黄), the finest glows like amber. Persian sulfur is also usable but inferior in origin.\n\n**Pumice (诱石):**\nFound in crane and stork nests, its forms and sources vary. Only that from Liang and Han (梁汉), Jingzhou (并州), Songshan (嵩山), and Yongzhou (雍州) valleys—when split, resembling a twisted rope or *muzi* (暮子) fruit, large as a bowl or small as a fist, white as jade—is superior. All other sources are unfit.\n\n**Red Stone Pitch (赤石脂):**\nFrom Hao Prefecture (昊郡) and Ze Prefecture (泽州), smooth and glossy like rendered fat—this is the finest.\n\n**White Stone Pitch (白石脂):**\nFrom Hao Prefecture, sharing its source with red stone pitch, its form like congealed fat—this is the finest.\n\n**Rock Crystal (白石英):**\nFrom Shouyang (寿阳) and Ze Prefecture, its varieties are many. Seek transparency without blemish, and when submerged, it should blend with water—this is the best, regardless of size.\n\n**Mica (云母):**\nFrom Langya (琅琊), Pengcheng (彭城), Qingqi (青齐), and Luyou (庐州), it appears in six forms. When viewed in sunlight, it reveals:\n- Yellow-white with green tints: *Yunying* (云英).\n- Green-yellow with crystalline brilliance: *Yunyè* (云液).\n- Pure white without admixture: *Yunjing* (云精).\n- Green-white with black streaks: *Yumu* (云母).\nThe finest shimmers with five colors, dazzling the eye.\n\n**Stone Calcite (石锺乳):**\nFrom Sha Prefecture (邵州), it need not be the finest in refinement, but if its color is lustrous, its bulk substantial and thick—it is usable.\n\n**Lodestone (磁石):**\nFrom Ci Prefecture (磁州), if it attracts six or seven *jian* (缣, a silk measure) of iron, it is superior and usable.\n\n**Borax (石脑):**\nThough native to Maoshan (茅山) and Siping (四平), the finest comes from Puchou (蒲州), its color like fresh snow. Persian borax is superior.\n\n**Sunrise Stone (阳起石):**\nThe root of mica, its hues vary. Only the yellow-white from Taishan (太山) is superior; the pure white from Xingyi (邢益) and Que Mountain (鹊山) is the best.\n\n**Gold Ore (金精):**\nTake unrefined, raw ore, its color like turquoise, marked with abundant golden specks—this is the finest.\n\n**Yellow Alum (黄矾):**\nFrom Guazhou (瓜州), it appears in five forms. In Daoist refining, yellow-white is most used; others are rarely employed. Its shape resembles gold, and when broken, reveals golden veins. When rubbed on silver, it turns yellow, capable of binding mercury so it adheres without falling. If it resembles *Maoya* (马牙) in form but crumbles when burned, it is unfit.\n\n**White Alum (白矾):**\nFrom Hao Prefecture is superior; from Zhao Prefecture, secondary. Others are unfit.\n\n**Crimson Alum (绛矾):**\nFrom Persia, resembling turquoise glass, the clearest is finest. All other sources are unfit.\n\n**Chicken Droppings Alum (鸡屎矾):**\nFrom Persia, its form resembles chicken droppings, its color a mix of green, yellow, and white. In this Dao, it is deeply secret and essential.\n\n**Teaching Alum (诲矾):**\nFrom Annan (安南) and Heling (呵陵), its color is red, yellow, or black. Among the five alums, this is indispensable. When broken, true specimens bear golden specks.\n\n**Azurite (空青):**\nFrom Liu Prefecture (柳州) and Yue Prefecture (越州), its color is deep blue-green, resembling spiral patterns, hollow within with a central void like a *Kunlun* peak. When fitted with a tree’s seedling, it aligns perfectly. If it bears golden specks like a *kǎokǎo* (拷拷) pattern, it is the finest. Also found in Guangzhou. This substance is often counterfeited; true specimens are rare and deeply secret in this Dao. Small spherical granules are also called *kongqing* (空青). *Zengqing* (曾青) differs not at all—false distinctions have been made. All green granules and their \"mother\" ore are likewise called *zengqing*, not merely the granular form. Today, each medicine has its distinct name; one must not dismiss the ancients’ classifications. I have listed them separately accordingly.\n\n**Malachite (曾青):**\nFrom Shushan (蜀山) and Yue Prefecture is finest, its color like turquoise or yellow gentian, or the green-purple of earthworm droppings—this is superior.\n\n**Stone Rose (石桂英):**\nFrom lactating sources, its color is pure white, staining the hand like snow when held—this is the finest.\n\n**Flint (理石):**\nFrom Liang Prefecture (梁州), Qingning (青宁), and Sanzhou (三州), it is excellent. When drawn like a needle, its yellow-white luster is most prized.\n\n**Niter (朴硝):**\nFrom Yizhou (益州), unexposed to wind is finest. Its color should not be dry or green-tinged—this is the best.\n\n**Saltpeter (磋硝):**\nFrom Yizhou, accumulated like frost in shaded earth. Some say it also comes from fire mountains, and snow-white, moist specimens are superior.\n\n**Stone Gall (石胆):**\nFrom Liang Prefecture and Xindu (信都), the finest is processed with *qiangli* (羌理), its color green with blue tints. Some from Laoshan (唠山) resembles a crescent moon, yellow-green in hue—this is good. Of these, Laoshan is slightly superior, but none surpass the quality of Puchou’s.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1383,
      "start_sentence": 0,
      "end_sentence": 82,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 13.497090101242065,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\金石簿九五数诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "硝石 本出益州羌武都陇西，今乌长国者良。 近唐麟德年甲子岁，有中人婆罗门支法林，负梵甲来此翻译，请往五台山巡礼，行至汾州灵石县，问云：此大有硝石，何不采用。 当时有赵如珪、杜法亮等一十二人，随梵僧共采，试用全不堪，不如乌长者。 又行至泽州，见山茂秀。 又云：此亦有硝石，岂能还不堪用。 故将汉僧灵悟共采之，得而烧之，紫姻烽姻。 日：此之灵药，能变五金，众石得之，尽变成水。 校量与乌长，今方知泽州者堪用。 金频试炼，实表其灵。 若比乌长国，乃泽州者稍软。 天明砂 出波斯国，堪捍五金器物。 此药尤多假伪，但自试之，辨取真伪。 口含无苦醉酸咸，好青白色，烧之不沸，汁流如水，枯似胶枯，即真矣。 若烧有紫姻气，烧上有漆者，并是真也。 可择而用之。",
      "translated_text": "**Saltpeter (硝石):**\nNatively from Liang Prefecture (梁州), Qiang Prefecture (羌武都), and Longxi (陇西), but that from Wuzhang (乌长国) is superior. During the Tang dynasty’s *Lín Dé* (麟德) era, in the year *Jiǎzǐ* (甲子), there was a Central Asian monk named *Fǎlín* (法林), a disciple of the *Bóluómén* (婆罗门) sect, who carried a *Fànjiǎ* (梵甲)—likely a Buddhist scripture or talisman—here to translate. He was instructed to make pilgrimage to Wutai Mountain (五台山), and upon reaching Fenzhou (汾州), Lingshi County (灵石县), he inquired: *\"This place has abundant saltpeter—why not collect and use it?\"*\n\nAt that time, there were twelve men, including *Zhào Rúguī* (赵如珪) and *Dù Fǎliàng* (杜法亮), who accompanied the monk in gathering it. After testing, they found it entirely unfit—far inferior to that of Wuzhang (乌长). Then, journeying to Zezhou (泽州), they saw its mountains lush and refined. Again, they were told: *\"This place also has saltpeter—how could it be unfit for use?\"* So, they took the monk *Língwù* (灵悟) along to collect it. Upon refining, it emitted a purple *qīnyīn* (紫姻) glow like a beacon. They said: *\"This is a sacred medicine, capable of transforming the five metals—when all stones are exposed to it, they dissolve into water.\"* Comparing it with Wuzhang’s, they realized that Zezhou’s saltpeter was indeed usable. Repeated tests with metal confirmed its potency. Though slightly softer than Wuzhang’s, it was still effective.\n\n**Heavenly-Clear Sand (天明砂):**\nFrom the country of *Bōsī* (波斯), it is capable of tempering the five metal tools. This medicine is particularly prone to counterfeiting, so one must test it personally to distinguish true from false. When held in the mouth, it leaves no bitter, sour, or salty taste. The finest specimens are greenish-white in color. When refined, it does not boil, and its juice flows like water, drying to a consistency akin to *jiāogū* (胶枯)—a resinous substance. This is the true article. If it emits a purple *qīnyīn* (紫姻) vapor upon refining or has a lacquer-like residue on its surface, it is also genuine. One may then select and use it accordingly.",
      "overlap_context": "r green-tinged—this is the best.\n\n**Saltpeter (磋硝):**\nFrom Yizhou, accumulated like frost in shaded earth. Some say it also comes from fire mountains, and snow-white, moist specimens are superior.\n\n**Stone Gall (石胆):**\nFrom Liang Prefecture and Xindu (信都), the finest is processed with *qiangli* (羌理), its color green with blue tints. Some from Laoshan (唠山) resembles a crescent moon, yellow-green in hue—this is good. Of these, Laoshan is slightly superior, but none surpass the quality of Puchou’s.",
      "start_char": 1384,
      "end_char": 1700,
      "start_sentence": 83,
      "end_sentence": 99,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 7.63166618347168,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\金石簿九五数诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "黄花石 本有名无用，中有黄花石，出波斯国者上。 江束北亭虔州者次，诸路有铜矿之处皆有，最下，不堪用。 其形似铜矿质，有金星点，赤色，重烧有腥姻之黑，研水银便上，波斯国生，即是真也。 又云j ．似紫矿欲，似麒麟竭，此说非真。 真者颜色甚光润耳。 不灰木 出波斯国，是银石之根，形如烂木，久烧无变，烧而无灰，色青似木，能制水银。 余所出处，不堪所用。 波斯者为上。 戎盐 出郭三十里高崖下，自然流出，非人能造。 尝之不咸不蜇人口。 若是真者，累卵即知好恶。 一云：出戎州，色青白者上。 未穷其本，何者是真。 此道用之，与河东关内颗盐对试用之，戎盐全胜诸盐。 既知如此，须贵戎盐。 太阴玄精 出河束解县盐池中，盐根是也。 近水采之，形体如玉质，又如龟甲。 黑重者不堪，黄白明净者为上。 此亦制汞化之作粉矣。 对试比盐州稍最，故知如此盐州者为上。 卤咸 出同州东北可十七八里陂泽中，亦是盐根，形似河东细小颗盐，味苦而不咸。 本方无何方处。 世人错用平泽中地生白软之黑，将为处咸，深为误矣。 滑石 本出蔡州、青州者为上，时人错用昆仑中所出者，入六一泥用，全非所元。 若用疗病，即昆仑者胜，其体柔白而色，削之如蜡者为上。 寒水石 极白而似水者，良也。",
      "translated_text": "**Yellow Flower Stone (黄花石):**\nThough once renowned yet useless, the true *Huánghuā Shí* originates from *Bōsī*—its finest. That from *Jiāngshù*’s *Běitíng* in *Qiánzhōu* ranks second, while inferior specimens abound wherever copper ore is found, rendering them unusable. Its form resembles copper ore, marked by golden specks and a crimson hue. When heated strongly, it emits a pungent *qīnyīn* blackness; when ground with mercury, it rises to the surface—this is the genuine article from *Bōsī*.\n\nSome claim it resembles *zǐkuàngyù* (紫矿欲) or *qílínjié* (麒麟竭), but this is false. The true stone simply gleams with a lustrous sheen.\n\n**Ashless Wood (不灰木):**\nHailing from *Bōsī*, it is the root of silver ore, resembling rotted wood. Even after prolonged heating, it does not ash; when burned, it remains greenish like wood and can refine mercury. Inferior specimens from other regions are unfit for use—*Bōsī*’s is supreme.\n\n**Steppe Salt (戎盐):**\nFound thirty *lǐ* beyond the city walls on high cliffs, it flows naturally, not crafted by man. Tasting it reveals no saltiness or throat-searing bite. True specimens are discerned by stacking eggs—good or poor becomes evident. Some say it comes from *Róngzhōu*, with greenish-white hues being finest. Its origin remains unclear, but when tested against *Hédōng*’s *Guānnèi* grain salt, *Róngyán* surpasses all others. Thus, it must be treasured.\n\n**Great Yin Mystic Essence (太阴玄精):**\nExtracted from the salt pools of *Jiěxiàn* in *Hébù*, it is the root of salt. Collected near water, it resembles jade or tortoiseshell. Black, dense specimens are worthless, while yellow-white, pure ones are finest. This too refines mercury into powder. Compared to *Yánzhōu* salt, it is slightly superior—hence, *Yánzhōu*’s is the best.\n\n**Bitter Brine (卤咸):**\nFrom the marshes seventeen to eighteen *lǐ* northeast of *Tóngzhōu*, it is another salt root, resembling fine *Hédōng* grain salt but tasting bitter, not salty. No region in this text matches it. Commonly misused is the soft, black, white-veined earth from flatlands, mistaken for brine—this is gravely erroneous.\n\n**Slipstone (滑石):**\nFinest specimens come from *Càizhōu* and *Qīngzhōu*, yet many mistakenly use that from *Kūnlún*, which, when mixed with *liùyīní* (六一泥), proves entirely unsuitable. For medicinal use, *Kūnlún*’s slipstone excels—its soft, white body, wax-like when shaved, is supreme.\n\n**Cold Water Stone (寒水石):**\nThe best is pure white, resembling water—this is the true article.",
      "overlap_context": " one must test it personally to distinguish true from false. When held in the mouth, it leaves no bitter, sour, or salty taste. The finest specimens are greenish-white in color. When refined, it does not boil, and its juice flows like water, drying to a consistency akin to *jiāogū* (胶枯)—a resinous substance. This is the true article. If it emits a purple *qīnyīn* (紫姻) vapor upon refining or has a lacquer-like residue on its surface, it is also genuine. One may then select and use it accordingly.",
      "start_char": 1701,
      "end_char": 2229,
      "start_sentence": 100,
      "end_sentence": 132,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 6.514113426208496,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\金石簿九五数诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "胡同律 本自西域树中而出，有津流出，化为此药。 ＇亦名胡同泪。 今人不知其意，遂妄名胡同律。 律之与泪声势相似，其有不知方之人，误写作律字，以此举世共错。 其物形如地下盐石，金银匠用之捍作，极佳，炼金银食，尤善。 石榴丹 出太和山，形如石榴，外带赤色，腹内有子，如石榴子。 自古相传云．一许由服之得仙，亦未知其的实。 於此道中，深为秘要。 禹余粮． 出束海束阳泽州诸山，并有五种色，青黄赤白黑，比来人用皆取黄色。 如蒲黄者良，赤色亦好，唯白诤者最上。 炮砂 但光明映彻者堪用。 云：火山有，不如北亭者，最为上好。 雌黄 出武都，颜色黄明如金簿，破看如云母光，无夹石者为上。 金芽 本出蜀郡，又出荆襄道。 色黑而滑，打破中有碎脉，如金缕之状。 比患脚黑者，皆以此药酝酒服之，而得除差，名金牙酒。 代赭 出雁门界山，赤色者良，黄色者不堪。",
      "translated_text": "**Barite (胡同律):**\nOriginally derived from the sap of a Western Domain tree, where its resin flows and congeals into this medicine. Also called *Hútóng Lèi* (胡同泪). The common folk, unaware of its true name, mistakenly call it *Hútóng Lǜ* (胡同律). Since \"律\" and \"泪\" sound alike, those unfamiliar with its proper name often miswrite it as *lǜ*, leading to widespread error. Its form resembles underground saltstone; goldsmiths use it for casting, and it excels in refining gold and silver—especially for gilding.\n\n**Pomegranate Cinnabar (石榴丹):**\nSourced from *Tàihé Shān*, it resembles a pomegranate in shape, with a reddish exterior and seeds within like those of a pomegranate. Ancient lore claims that one *Yǔ Yóu* ingested it and attained immortality, though its veracity remains unverified. Within this Dao, it holds profound secrecy.\n\n**Yu Remnant Grain (禹余粮):**\nMined from the mountains of *Shùhǎi Shùyáng Zǒuzhōu*, it appears in five hues—blue, yellow, red, white, and black. Recently, people have favored the yellow variety, but the best resembles *púhuáng* (蒲黄), with red also being fine; only the white, pure form is supreme.\n\n**Calcined Sand (炮砂):**\nOnly the luminous, translucent variety is usable. It is said that while fire-mountain sand exists, none surpasses that from *Běitíng* in quality.\n\n**Orpiment (雌黄):**\nFrom *Wǔdū*, its color is bright yellow like gold foil, with a luster like mica when broken; the purest, unadulterated form is best.\n\n**Gold Vein (金芽):**\nPrimarily from *Shǔ Jùn*, also found in *Jīngxiāng Dào*. It is black and smooth, with shattered veins resembling gold thread when fractured. Those afflicted with darkened limbs often brew it into wine for consumption, and it effectively alleviates the condition—known as *Jīnyá Jiǔ* (金牙酒).\n\n**Red Earth (代赭):**\nSourced from the mountains of *Yànmén Jiè*. The red variety is superior; yellow is inferior.",
      "overlap_context": "mmonly misused is the soft, black, white-veined earth from flatlands, mistaken for brine—this is gravely erroneous.\n\n**Slipstone (滑石):**\nFinest specimens come from *Càizhōu* and *Qīngzhōu*, yet many mistakenly use that from *Kūnlún*, which, when mixed with *liùyīní* (六一泥), proves entirely unsuitable. For medicinal use, *Kūnlún*’s slipstone excels—its soft, white body, wax-like when shaved, is supreme.\n\n**Cold Water Stone (寒水石):**\nThe best is pure white, resembling water—this is the true article.",
      "start_char": 2230,
      "end_char": 2615,
      "start_sentence": 133,
      "end_sentence": 156,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 4.847512722015381,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\金石簿九五数诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "又云：尉州界大王城出，有赤脉者上好。 石盐 出平州北奚界之中，形状似黑云母，光润者为上。 盐州亦有，黑力稍软，波斯国者为上。 紫石英 出太和山，形如擂蒲头，光明彻透，色裹轻明者为上。 陈州界亦有，於此道中，亦为大要。 表裹紫莹，则为上好。 石中黄子 出沁水源，形如鹅卵之状，打破其中有黄汁，如鸡子黄。 若得三二升服之，则长生不死矣。 金石簿五九数诀竟",
      "translated_text": "**Further stated:**\nThe *Wèizhōu* border’s *Dàwáng Chéng* produces it, with those bearing red veins being the finest.\n\n**Rock Salt (石盐):**\nFrom *Píngzhōu*’s northern *Xī* borderlands, resembling black mica in form. Those with luster and smoothness are superior. *Yánzhōu* also yields it, though its black, softer variety is inferior—Persian rock salt is the best.\n\n**Amethyst (紫石英):**\nFrom *Tàihé Shān*, shaped like a pounded hemp head, luminous and translucent. Those wrapped in purple with clarity are supreme. The *Chénzhōu* border also produces it, and within this Dao, it is of great importance. Those with a purple, glossy exterior are the finest.\n\n**Yellow Rock Seed (石中黄子):**\nFrom the *Qìnshuǐ* source, shaped like a goose egg. When fractured, yellow juice flows within, like egg yolk. If consumed in measures of three to five *shēng*, it grants immortality and eternal life.\n\n**The Five Metals and Nine Stones’ Numerical Secret is complete.**",
      "overlap_context": "ith a luster like mica when broken; the purest, unadulterated form is best.\n\n**Gold Vein (金芽):**\nPrimarily from *Shǔ Jùn*, also found in *Jīngxiāng Dào*. It is black and smooth, with shattered veins resembling gold thread when fractured. Those afflicted with darkened limbs often brew it into wine for consumption, and it effectively alleviates the condition—known as *Jīnyá Jiǔ* (金牙酒).\n\n**Red Earth (代赭):**\nSourced from the mountains of *Yànmén Jiè*. The red variety is superior; yellow is inferior.",
      "start_char": 2615,
      "end_char": 2801,
      "start_sentence": 157,
      "end_sentence": 168,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 4.3226776123046875,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\金石簿九五数诀.txt",
        "category": "众术类"
      }
    }
  ]
}