{
  "source_id": "金箓斋投简仪",
  "source_file": "chunked_daozang\\金箓斋投简仪.json",
  "total_chunks": 6,
  "total_original_chars": 3509,
  "total_translated_chars": 22596,
  "total_translation_time": 58.195905685424805,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓斋投简仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**The Rite of Presenting Tablets at the Golden Talisman Hall**\n\n**Title:** *Rite of Presenting Tablets at the Golden Talisman Hall*\nOne scroll.\nRevised by Zhang Shangying of the Northern Song.\nSource text: *Zhengtong Daozang*, *Tongxuan* section, *Weiyi* category.\n\n---\n\n**The Rite of Presenting Tablets at the Golden Talisman Hall**\n\nThe Duke of Qinghe, Grand Officer of State, Guardian of the Right Chancellor of State, Concurrently Serving as Minister of the Imperial Secretariat, Grand Support of the State, and Holder of Two Thousand Nine Hundred *hu* of Fiefs,\n**Subject Zhang Shangying**, in obedience to imperial command, revised the rites for presenting tablets:\n\nTwo-sided tablets for mountain-water Daoist halls.\nIn spring and summer, proceed to the **Wangwu Celestial Grotto** in Mengzhou and the **Jidu Water Palace**.\nIn autumn and winter, proceed to the **Sizhen Celestial Grotto** in Anqing and the **Taiping Caishi Water Palace**.\n\nUpon the arrival of the **Dragon Tablets**, the subordinate Daoist sects shall assemble in proper **Weiyi** (ritual decorum) to welcome and receive them.\n\nSeven Daoist priests shall be dispatched, among whom one—preferably a priest who has received the **Faqie** (ritual talismans)—shall serve as the **High Functionary**.\n\nThe **ritual intent** shall be declared either upon the hall’s altar or the ritual platform, where the **Daoist assembly** shall be established, and incense shall be offered.\n\nThe altar shall be purified, and **imperial water** shall be sprinkled.\nThe **ritual masters** shall chant the prescribed liturgy, maintaining **mindful concentration** in accordance with the Dao.\n\nThe High Functionary Master proclaims the Five Directions’ Sacred Warding Incantations:\n\n**East:**\nNine-qi Azure Heaven, the Bright Star Great Deity.\nIlluminating the eastern lands, piercing the Nine Gates.\nTurning the solar torch, sweeping away filth and miasma.\nThe Open-Mind Child stands guard, protecting my lofty hall.\nBinding demons and subduing fiends, reporting to the Celestial Sovereign.\nUpholding the True Dao, with crimson script and jade inscriptions.\nNine-Heaven talismans command, seizing the Dragon Courier’s transmission.\nUniversal peace secured—I attain the Flying Immortal.\n\n**South:**\nSouthern Vermilion Heaven, the Three-qi Radiance.\nThe Wandering Star’s torch, piercing the Great Sun.\nAbove, the Red Refined One, the Open-Mind Holy Child.\nCommanding the Fire Soldiers, guarding the Three Palaces.\nSevering evil, binding fiends, beheading the Demon King.\nThe Northern Sovereign’s decree: the Eight Winds and Fires obey.\nThe True Dao spreads—I reap supreme merit.\nPreserving Heaven’s longevity, eternal through countless eons.\n\n**West:**\nSeven-qi Heaven, the Great White’s flowing essence.\nIlluminating the Golden Gate, piercing the Great Darkness.\nWithin, the Pure Sovereign, named the Imperial Spirit.\nGuarding the God—peace secured, my form protected.\nSevering evil’s roots, the Kingly Dao made manifest.\nThe Official Hall stands in order, the Three Lights aligned.\nThe Dao harmonizes with Nature—I ascend to the Purple Court.\nThe Sacred Talismans’ command benefits all life.\nMerit extends to all—Heaven and Earth in concord.\n\n**North:**\nNorthern Mystic Heaven, the Five-qi wandering.\nThe Star of Destiny shines resplendent, illuminating the Great Axis.\nThe Black Spirit, the Flying Immortal in feathered robes.\nGuarding the Five Gates, seizing the Essence, capturing the False.\nDare any transgress? They shall be shattered and felled.\nThe Jade Talisman’s decree—divine might shakes the Eight Directions.\nEvil gates sealed, the True Dao opened wide.\nReflecting upon my form, the Three Lights shine as one.\nRiding the void, floating—my form ascends as Immortal.\n\n**Central:**\nThe Yellow Center harmonizes the qi, governing the Mystic True.\nThe Star of Stability radiates, illuminating the Nine Heavens.\nThe Open-Mind Children—twelve in number—stand arrayed.\nThe Primordial qi, the solar essence, the crimson smoke ascending.\nPiercing all beneath Heaven, reaching my humble self.\nA hundred evils crushed, ten thousand ghosts ensnared.\nThe Central Mountain’s incantation—Heaven’s will accomplished.\nThe Five Spirits pacified—I fly as Celestial Immortal.\n\n**Five Stars Incantation:**\nThe Five Stars arrayed, resplendent in their directions.\nThe Water Star repels calamity, the Wood Virtue brings prosperity.\nThe Wandering Star dissipates misfortune, the Great White wards off armies.\nThe Stabilizing Star holds firm—nation and family prosper.\nNames inscribed on jade tablets, recorded in the Imperial Hall.\nRiding the gale, dispersing the scene—I soar through the void.\nEntering and exiting the Dark, wandering the Ten Directions.\nFive clouds enfold, summoning spirits, commanding winds.\nEnlisting all spirits—I guard the Celestial Official.\n\n**Twenty-Four Beats of the Law Drum:**\nThe High Functionary Master ignites the furnace.\nThe Most High True Primordial Five Spirits Lord of Old—\nconjuring the Functionary Messenger, the Left and Right Dragon-Tiger Lords,\nthe Incense-Bearing Attendants, the Three-qi True Gods—\nopening the Three Heavens to the Most High Primordial Sovereign Lord of Old.\n\nI now properly burn incense, reverently presenting the current Emperor’s jade altar rites concluded, the golden talisman fast completed.\nSpecially dispatched, [certain official] proceeds to [certain place] to offer the Dragon Tablets.\nReestablishing the ritual feast, I pray that the Most High’s Eight Directions’ True and Living qi descend into my body,\nso that my petition may swiftly reach the Supreme Truth, the Limitless Most High, the Three Sovereigns of the Three Pure Heavens.\n\nBowing twice, offering incense, tea, and wine.\n\nNext, the various invocations of the Law Positions:\nThe High Functionary, in proper Law Position, humbly reports to the Three Pure, the Most Sacred,\nthe Ten Extremes’ High Perfected Ones, the Five Directions’ Five Sovereigns,\nthe Three Officials of Heaven, Earth, and Water,\nthe True Rulers of the Grotto Heavens, the Four Seas, the Mountains and Rivers, the Water Palace Dragon Gods,\nall sacred realms, all Dao-attained Immortals and spirits.\n\nI, of humble nature and filth, have by grace attained the Dao’s gate.\nSacred precepts and numinous scriptures—I have heard the lofty models,\npropagating the Dao’s transformations, aiding the realm.\nFor all petitions, how could they not be heard?\n\nNow the Emperor, gathering blessings and averting disasters, concludes the rites.\nSpecially dispatched, [certain official] proceeds to [certain state’s] grotto, sacred mountain,\nto offer the Dragon Tablet and jade inscriptions.\nIn accordance with the sovereign’s edict, the ritual feast is renewed.\nI pray that the multitude of saints descend, perceiving my sincerity and accepting it.\nGranting my request, I humbly receive your divine favor.\n\nWith [certain official] and myself, in deepest awe, we kneel and bow twice, humbly petitioning.\n\nNext, offering incense again, presenting wine, and bowing.\n\nI reverently petition the Mid-Autumn Pardon of Offenses, the Earth Official,\nthe Forty-Two Divisions of the Mid-Autumn Celestial Officials,\nthe Divine Assembly of the Righteous from Wangwu Mountain’s Lesser Grotto Heaven,\nthe Ten Great Exhortative Heavenly Immortals,\nthe Five Sacred Peaks’ Grotto Heaven True Lords,\nthe Eighty-One Grotto Immortals, the Seventy Upper Blessed Lands’ Celestial Officials,\nthe Nine-Heaven Elder of Qingcheng Mountain, the True Lord of Stored Blessings and Fixed Fate,\nthe True Lord of Hidden Mountain’s Command,\nthe Nine-Heaven Investigator of Lushan, the True Lord of Responding to Heaven and Preserving Movement,\nall named peaks and sacred grottoes, all Dao-attained Dragon and Immortal spirits,\nwho may be moved to descend upon this ritual seat.\n\nWith deepest reverence, I kneel and bow twice.\n\nI reverently petition the Lower Autumn’s Liberation from Calamity Water Official,\nthe Forty-Two Divisions of the Lower Autumn Attendants,\nthe Sacred Assembly of Dragon Spirits, the Pure Source King of Jidu,\nall Dao-attained Dragon Spirits of Jidu,\nthe Celestial Officials of the Four Seas and Eight Oceans, the Three Rivers and Four Lakes,\nthe Nine Rivers’ Water Emperor, the Twelve River Sources’ River Marshals,\nthe River Lords and their Attendants,\nthe Great Marsh’s Spirit Officials of the Original Palace,\nall their officials—\nwho may be moved to descend upon this ritual seat.\n\nWith deepest reverence, I kneel and bow twice.\n\nNext, offering incense, presenting wine again, and bowing.\n\n「Next, I solemnly repeat the invocation of the sacred ranks.\nWith deepest reverence, I once again earnestly offer incense and petition the High True and Supreme Sage,\nthe Three Officials of Heaven, Earth, and Water,\nthe Dao-attained Spirits of the Mountain and Water Caverns, the Auspicious Abode of Jìng Lú,\nthe Dragon Spirits and their officials,\nthe Celestial Officials of the Four Seas and Eight Oceans, the myriad rivers and valleys, and the Water Palaces of springs and sources,\nall the mighty and numinous spirits within this domain,\nthe Dao-attained Sacred Assembly—\nmay they descend upon this ritual feast,\nand accept my sincere devotion,\ntheir radiance flowing and their light reflected.\n\nI humbly pray that the Emperor’s foundation be steadfast,\nand the nation’s longevity match the heavens.\nMay all creatures, both animate and inanimate, benefit from his grace,\nand the civilized and the barbarian alike receive his blessings.\nMay the sweet dew fall and auspicious winds gather,\nmay the misty clouds appear and celestial radiance descend.\nMay pestilence and calamity be repelled,\nand fortune and blessings flourish abundantly.\nMay the spirits, in their benevolence, remember these prayers,\nand forever bestow rest upon all beings.\nMay every living creature attain the Dao’s shore.\n\nWith deepest reverence and trepidation, I kneel and bow twice,\nrepeating the offering.\n\nNext, the Twelve Prayers.\nMy first prayer is for the heavens and earth to be pure and clear,\nmy second for the *qi* patterns to be harmonious and round,\nmy third for the Sages’ longevity to be boundless,\nmy fourth for the Way’s teachings to be widely embraced,\nmy fifth for the heavens to bestow sweet dew,\nmy sixth for the earth to emit auspicious vapors,\nmy seventh for the four seasons to follow their proper order,\nmy eighth for all things to flourish in fullness,\nmy ninth for households to be filled with filial piety and fraternal virtue,\nmy tenth for the nation to abound in talent and worthy men,\nmy eleventh for the *Tíngdōu* (Netherworld) to cease its trials,\nmy twelfth for the study of the Dao to lead to transcendence.\n\nNext, the High Functionary renews the incense and offers the invocation:\n*\"Incense Officials and Messengers, Dragon and Tiger Lords of Left and Right,*\n*Attendants who serve the incense,*\n*May the places where the Way is practiced*\n*naturally produce golden elixirs, azure *dān* (alchemical pills), and immortal herbs.*\n*All the spirits of the myriad beings,*\n*gather here at this incense altar.\nI pray that the Emperor receive blessings,*\n*and the world be bathed in grace.*\n\n*To the Ten Directions’ Dao-attained Immortals,*\n*and the Jade Maidens who guard them,*\n*May the incense smoke convey my petitions,*\n*and swiftly reach the Supreme Dao of the Three Pure Ones,*\n*before the boundless and ultimate Emperor of Heaven.\"*\n\nNext, I recite the *Precept on Learning the Dao*:\n*\"Learning the Dao is urgent in deed,*\n*and in heart, I earnestly uphold the precepts.*\n*With the *qi* refined and true,*\n*the Dao-attained Saints come seeking me.*\n*If one does not heed these words,*\n*why dwell in mountain forests?\"*\n\nNext, I burn the incense as prescribed,\nand cast the written petitions into the Cavern of the Netherworld.\nNext, I proceed to the Water Palaces.\nNext, I recite the *Precept on Casting Petitions*.\n\nI now pray to the True Ones in the Purple Palace,*\nand announce my life’s end at the Sacred Hall of the Spirit.*\n\nThe Jade Maidens chant with melodious dharma,*\nwhile the Golden Boys play incense on their celestial zithers.*\nMy written name ascends through the Nine Earths,*\nand my characters reach the Three Heavens above.*\n\nMay I forever enjoy boundless life,*\nand attain the lofty Dao of the Immortal Saints.\n\nNext, I recite the *Meritorious Dedication Praise*:\n\n*\"The merits of these rites I now dedicate,*\n*first to bless the Emperor,*\n*then to all his ministers.*\n*Together, we rely on virtue’s power,*\n*to perfect the Supreme Dao.*\n\n*May all who believe and honor this be rewarded.*\n\nNext, the Highest Merit Dedication:\n*\"The rites of petition are now complete,*\n*and the meritorious offerings are fully prepared.*\n*For the Emperor, I pray for eternal sacred life.*\n\n*I invoke the Great Saints—*\n*the Primordial Sovereign of Heavenly Origins,*\n*the Supreme Daoist Lord of Jade Morning,*\n*the Supreme Old Lord of Golden Gate,*\n*and the Supreme Three Pure Ones, the Great Heavenly Emperor—*\n*their boundless, unimaginable virtues.*\n\n*To the Dao-attained multitude of the Five Sacred Peaks,*\n*in the Mountain Simplified Form:*\n*The Emperor’s successor humbly bows,*\n*to welcome auspicious blessings and gather merit,*\n*solely to establish the Celestial Science.*\n\n*With reverence, I present the offerings of the Dragon Tablet and jade coins,*\n*and command Daoist priests—*\n*several at a certain palace or observatory,*\n*in a certain hall—*\n*to open the Golden Register Dao Assembly,*\n*for several days and nights.*\n\n*On the day of conclusion,*\n*a Great Universal Rite is set up,*\n*with three thousand six hundred ranks.*\n\n*I solemnly pledge to Heaven and Earth,*\n*and record the tally of merits and debts.*\n*The fasts are complete, and I respectfully present the Great Rite.*\n\n*In strict accordance with tradition,*\n*I proceed to the Cavern of the Netherworld,*\n*to deliver the Golden Dragon Jade Petitions.*\n*May the gods and Dao-attained ones,*\n*flying in the Upper Clarity,*\n*the Five Sacred Peaks’ True Persons,*\n*and the Most Sacred and Most True—*\n*see this sincere plea,*\n*and grant it swift celestial transmission.*\n\n*Above, the Nine Heavens hear,*\n*and I respectfully go to the Sacred Mountain,*\n*sent by the Golden Dragon Post.*\n\n*In the year of the Great Soil, certain [celestial] stem-branch,*\n*on the [certain] month of the [certain] day,*\n*and the [certain] day of the [certain] stem-branch,*\n*within the Dao Assembly,*\n*at the auspicious hour, I announce the hearing.*\n\n*In the Earth Simplified Form:*\n*The Emperor’s successor humbly bows,*\n*to welcome auspicious blessings and gather merit,*\n*solely to establish the Celestial Science.*\n\n*With reverence, I present the offerings of the Dragon Tablet and jade coins,*\n*and command Daoist priests—*\n*several at a certain palace or observatory,*\n*in a certain hall—*\n*to open the Golden Register Dao Assembly,*\n*for several days and nights.*\n\n*On the day of conclusion,*\n*a Great Universal Rite is set up,*\n*with three thousand six hundred ranks.*\n\n*I solemnly pledge to Heaven and Earth,*\n*and record the tally of merits and debts.*\n*The fasts are complete, and I respectfully present the Great Rite.*\n\n*In strict accordance with tradition,*\n*I proceed to the Sacred Hall,*\n*to deliver the Golden Dragon Jade Petitions.*\n*May the Dao-attained ones fly in the Upper Clarity,*\n*the Central Yellow Nine Soils’ Stewarding Gods,*\n*and the Five Earthly Sovereigns—*\n*see this sincere plea,*\n*and grant it swift celestial transmission.*\n\n*Above, the Nine Heavens hear,*\n*sent by the Golden Dragon Post.*\n\n*In the year of the Great Soil, certain [celestial] stem-branch,*\n*on the [certain] month of the [certain] day,*\n*and the [certain] day of the [certain] stem-branch,*\n*within the Dao Assembly,*\n*at the auspicious hour, I announce the hearing.*\n\n*In the Water Simplified Form:*\n*The Emperor’s successor humbly bows,*\n*to welcome auspicious blessings and gather merit,*\n*solely to establish the Celestial Science.*\n\n*With reverence, I present the offerings of the Dragon Tablet and jade coins,*\n*and command Daoist priests—*\n*several at a certain palace or observatory,*\n*in a certain hall—*\n*to open the Golden Register Dao Assembly,*\n*for several days and nights.*\n\n*On the day of conclusion,*\n*a Great Universal Rite is set up,*\n*with three thousand six hundred ranks.*\n\n*I solemnly pledge to Heaven and Earth,*\n*and record the tally of merits and debts.*\n*The fasts are complete, and I respectfully present the Great Rite.*\n\n*In strict accordance with tradition,*\n*I proceed to the Water Palaces,*\n*to deliver the Golden Dragon Jade Petitions.*\n*May the gods and Dao-attained ones,*\n*the Three Primordial Cycles coexisting,*\n*the Nine Water Palaces and Twelve River Sources,*\n*the Great Gods of the Yangtze, Huai, and Hai,*\n*and the Oceanic and Celestial Deities—*\n*the Most Sacred and Most True—*\n*see this sincere plea,*\n*and grant it swift celestial transmission.*\n\n*Above, the Nine Heavens hear,*\n*and I respectfully go to the Water Palaces,*\n*sent by the Golden Dragon Post.*\n\n*In the year of the Great Soil, certain [celestial] stem-branch,*\n*on the [certain] month of the [certain] day,*\n*and the [certain] day of the [certain] stem-branch,*\n*within the Dao Assembly,*\n*at the auspicious hour, I announce the hearing.*\n\n*With green paper sealing the petition,*\n*I present the Simplified Form.*\n\n**Translation:**\n\n*\"Respectfully, I submit to [the relevant authority] at [location], presenting the high-ranking Daoist official’s name and petition text, sealed as follows:*\n\n**The Ritual Sequence for the Golden Daoist Register (Jinqu) Ceremonies**\n\n*Your servant, Shang Ying, humbly receives Your Majesty’s imperial edict, which states:*\n\n*\"Beyond your mastery of literature and governance, you delve deeply into the Dao’s mysteries and exhaustively study the arcane classics. No text—whether the *Ruiji* or the *Langhan*—remains beyond your grasp. Indeed, the *Jinqu* ritual system is but an additional matter for your expertise.*\n\n*Previously, I entrusted a few Daoist priests to examine the ritual framework of the Dao Assembly, cross-referencing it with hidden classics for correction. They have now compiled a draft for review. Upon inspection, numerous discrepancies were found. I have thus submitted it to you, requesting that in your leisure from governance, you carefully examine it, marking what is acceptable or not. Should there be unresolved debates, textual errors, or incomplete matters, you may annotate corrections and refinements accordingly.*\n\n*Your servant, Shang Ying, kneels and prostrates, daring not to disobey.\"*\n\n*The Emperor’s august and illustrious decree proclaims:*\n\n*\"As in ancient times, the sovereigns did not establish their rule without reference to Heaven, nor did they accord reverence to the Dao without foundation. The Yellow Emperor said: ‘To observe the Dao of Heaven and follow its movements is to exhaust its essence.’ Confucius said: ‘Only Heaven is supreme; only Yao followed it.’ Emperor Shun said: ‘The Mandate of Heaven is to be heeded at the critical moment.’ The Classics state: ‘Heaven is wise and clear; the sage follows its Mandate.’ The *Book of Songs* says: ‘King Wen ascended and descended, standing at Heaven’s side.’*\n\n*Thus, in stillness and simplicity, there must be sincerity; in the subtle and elusive, there must be intention. The origins of fasting and ritual purification lie here.*\n\n*Therefore, the *Natural Mystery Classic* expounds upon ritual frameworks, adapting methods to circumstances and dividing them into nine categories. Lu Xiujing codified them in his time; Du Guangting later compiled them. Emperor Shenzong revived the neglected rites, and Yang Jie edited them into a book. Your Majesty, continuing the legacy of your predecessors, has allowed your humble servant to refine and polish them.*\n\n*Moreover, the Duke of Zhou established the ranks without omission, and King Xuan of Zhou performed no rites without divine efficacy. All measures taken to benefit the people and avert calamities were exhaustive. How much more so when Heaven’s vast and luminous symbols pervade all things! The Six *Xu* (voids) circulate and transform, while the people live their daily lives unaware. For those governing the realm, can this be neglected?*\n\n*We honor the Thirteen Empty Celestial Sovereigns and the Three Primordial Lords of the Highest Dao—the true origins of the Dao. The Three Pure Ones are the Dao’s wondrous manifestations. The Jade Emperor of the Celestial Vault, the Thirty-Two Heavenly Sovereigns, and those who govern the cosmos and effect transformations. The Celestial Emperor and the Purple Forbidden Emperor are the Heavenly Sovereigns who manifest in the celestial realm. The Empty Celestial Sovereign and the Earthly Empress are the sources of the Three Primordial Cycles and the Nine *qi*.*\n\n*Their names are numerous, yet they do not constitute the Dao’s essence. By thoroughly researching the scriptures and examining the Three Realms, we verify their truths without obstruction, neither adding nor subtracting by private whim.*\n\n*The old rituals were disordered in sequence and lacked proper balance in complexity and simplicity. Now, I have reconsidered the nine categories, arranging the ranks of the saints, pruning superfluous names, and completing the ritual intent. They are as follows:*\n\n1. *The invocation of a master—if not a true master, then who shall preside over the ritual assembly?*\n2. *The assignment of officials—if not properly appointed, then who shall perform the ritual laws?*\n3. *The conferral of precepts—if not pure, then how may one enter the ritual platform?*\n4. *The proclamation of the altar—if not purified, then how shall the celestial saints descend?*\n5. *The ascent through the Heavenly Gate—if not aligned with *Kuan* and *Xun*, then the circumambulation will be incomplete.*\n6. *The presentation of petitions and tablets—if not sealed with the ritual seal and符, then how shall they pass through the Heavenly Gate?*\n7. *The True Scriptures and Jade Tablets must be verified for correctness and alignment, corresponding to the *qi* of the Five Phases.*\n8. *The Assembly of Wondrous Mysteries shall employ the ritual diagram of Sima Ziming from Mount Wangwu.*\n9. *The Celestial Treasure Platform shall adopt the design of the Mysterious Platform, relocated within the hall to facilitate ascension and descent, and to welcome the arrival of the winds.\"*\n\n*Let those who practice the rites study and master these carefully.*\n\n*Your servant, Shang Ying, humbly records this sequence.\"*\n\nThe **Golden Talisman Hall**—the ritual for offering petitions is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "金箓斋投简仪 经名：金箓斋投简仪。 一卷。 北宋张商英删定。 底本出处：《正统道藏》洞玄部威仪类。 金箓斋投简仪 通奉大夫守尚书右仆射兼中书侍郎上柱国清河郡开国公食邑二千九囗囗囗囗囗臣张商英奉旨删 山水简二面。 春夏诣孟州王屋洞天、济渎水府，秋冬诣安庆潜山司真洞天、太平采石水府。 龙简到日，所属下教门，具威仪迎接。 差道士七人，内选授法箓道士一人，充高功。 具斋意於殿上或坛上，开建道场，祝香。 净坛，敕水 唱各礼师，存念如法",
      "translated_text": "**The Rite of Presenting Tablets at the Golden Talisman Hall**\n\n**Title:** *Rite of Presenting Tablets at the Golden Talisman Hall*\nOne scroll.\nRevised by Zhang Shangying of the Northern Song.\nSource text: *Zhengtong Daozang*, *Tongxuan* section, *Weiyi* category.\n\n---\n\n**The Rite of Presenting Tablets at the Golden Talisman Hall**\n\nThe Duke of Qinghe, Grand Officer of State, Guardian of the Right Chancellor of State, Concurrently Serving as Minister of the Imperial Secretariat, Grand Support of the State, and Holder of Two Thousand Nine Hundred *hu* of Fiefs,\n**Subject Zhang Shangying**, in obedience to imperial command, revised the rites for presenting tablets:\n\nTwo-sided tablets for mountain-water Daoist halls.\nIn spring and summer, proceed to the **Wangwu Celestial Grotto** in Mengzhou and the **Jidu Water Palace**.\nIn autumn and winter, proceed to the **Sizhen Celestial Grotto** in Anqing and the **Taiping Caishi Water Palace**.\n\nUpon the arrival of the **Dragon Tablets**, the subordinate Daoist sects shall assemble in proper **Weiyi** (ritual decorum) to welcome and receive them.\n\nSeven Daoist priests shall be dispatched, among whom one—preferably a priest who has received the **Faqie** (ritual talismans)—shall serve as the **High Functionary**.\n\nThe **ritual intent** shall be declared either upon the hall’s altar or the ritual platform, where the **Daoist assembly** shall be established, and incense shall be offered.\n\nThe altar shall be purified, and **imperial water** shall be sprinkled.\nThe **ritual masters** shall chant the prescribed liturgy, maintaining **mindful concentration** in accordance with the Dao.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 220,
      "start_sentence": 0,
      "end_sentence": 13,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 5.30131721496582,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓斋投简仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "高功法师宣五方卫灵咒 东方 九炁青天，明星大神。 焕照东乡，洞映九门。 转烛阳光，扫秽除氛。 开明童子，备卫我轩。 收魔束妖，上对帝君。 奉承正道，赤书玉文。 九天符命，摄龙驿传。 普天安镇，我得飞仙。 南方 南方丹天，三炁流光。 荧星转烛，洞照太阳。 上有赤精，开明灵童。 总御火兵，备守三宫。 斩邪束妖，翦截魔王。 北帝所承，风火八冲。 流铃交焕，敢有不从。 正道流行，我享上功。 保天长存，亿劫无终。 西方 七炁之天，太白流精。 光耀金门，洞照太冥。 中有素皇，号曰帝灵。 保神安镇，卫我身形。 断截邪源，王道正明。 官殿整肃，三景齐并。 道合自然，飞升紫庭。 灵宝符命，普惠万生。 功加一切，天地咸宁。 北方 北方玄天，五炁徘徊。 辰星焕烂， 光耀太微。 黑灵尊神，飞仙羽衣。 备 守五门，检精捕非。 敢有干试，豁落斩摧。 玉符所告，神振八威。 邪门闭塞，正道明开。 映照我身，三光同辉。 策空驾浮，举形仙飞。 中央 黄中理炁，总统玄真。 镇星吐辉，流焕九天。 开明童子，一十二人。 元炁阳精，炎上朱烟。 洞照天下，及臣等身。 百邪摧落，摄鬼万千。 中山神咒，溥天使然。 五灵安镇，身飞上仙。 五星都咒 五星列照，焕明五方。 水星却灾，木德致昌。 荧惑消祸，太白辟兵。 镇星四据，家国利亨。 名刊玉简，录字帝房。 乘飙散景，飞腾太空。 出入冥无，游冥十方。 五云覆盖，招神摄风。 役使万灵，上卫仙公。 唱鸣法鼓二十四通 高功法师发炉 太上真元五灵老君当召功曹使者、左右龙虎君、捧香使者、三炁正神，关启三天太上元皇老君。 臣今正尔烧香，谨奉当今皇帝玉坛醮罢，金箓斋成。 专遣某官诣某处投奠龙简，重设醮筵，愿得太上八方正真生炁，降流臣等身中，令臣所启，速达至真无极太上三尊三清天帝御前。 次再拜，上香、上茶、上酒 次唱各称法位 高功具法位臣，某谨上启三清上圣、十极高真、五方五帝君，天地水三官，洞天真宰，四渎海岳、水府龙神，一切圣境，得道仙灵。 臣禀质凡微，托躬尘秽，宿荷余福，栖身法门。 宝诀灵书，获闻上范约当，宣扬道化，保辅邦家。 凡有祷祈，敢不闻达。 今皇帝以集福禳灾，散坛罢醮。 专遣某官诣某州洞府灵山，投奠龙璧玉简。 恭依睿旨，重启醮筵。 祈众圣之降临，察诚心而领纳。 蒙如所请，仰荷灵恩。 臣与某官等，诚惶诚恐，稽首顿首，再拜奉请。 次上香再拜，献酒设拜。 谨奉请中元赦罪，地官、中元四十二曹仙官，王屋山小有洞天神仙圣众，十大诃天神仙真宰，五岳洞天真君，八十一洞神仙、一七十上福地仙官、青城山九天丈人、储福定命真君、潜山司命真君、庐山九天采访使者、应元保运真君，诸岳名山，洞天福地，一切得道龙神仙众，应感分辉，降临醮座。 谨稽首虔诚再拜。 谨奉请下元解厄水官、下元四十二曹掾吏，龙神圣众、济渎清源王、济渎一切得道龙神圣众，四海八溟、三河四渎灵官圣众，九江水帝、十二河源河伯、河侯河掾，川灵大泽本府灵司，一切官属，应感分辉，降临醮座。 谨稽首虔诚再拜。 次上香，再献酒设拜",
      "translated_text": "The High Functionary Master proclaims the Five Directions’ Sacred Warding Incantations:\n\n**East:**\nNine-qi Azure Heaven, the Bright Star Great Deity.\nIlluminating the eastern lands, piercing the Nine Gates.\nTurning the solar torch, sweeping away filth and miasma.\nThe Open-Mind Child stands guard, protecting my lofty hall.\nBinding demons and subduing fiends, reporting to the Celestial Sovereign.\nUpholding the True Dao, with crimson script and jade inscriptions.\nNine-Heaven talismans command, seizing the Dragon Courier’s transmission.\nUniversal peace secured—I attain the Flying Immortal.\n\n**South:**\nSouthern Vermilion Heaven, the Three-qi Radiance.\nThe Wandering Star’s torch, piercing the Great Sun.\nAbove, the Red Refined One, the Open-Mind Holy Child.\nCommanding the Fire Soldiers, guarding the Three Palaces.\nSevering evil, binding fiends, beheading the Demon King.\nThe Northern Sovereign’s decree: the Eight Winds and Fires obey.\nThe True Dao spreads—I reap supreme merit.\nPreserving Heaven’s longevity, eternal through countless eons.\n\n**West:**\nSeven-qi Heaven, the Great White’s flowing essence.\nIlluminating the Golden Gate, piercing the Great Darkness.\nWithin, the Pure Sovereign, named the Imperial Spirit.\nGuarding the God—peace secured, my form protected.\nSevering evil’s roots, the Kingly Dao made manifest.\nThe Official Hall stands in order, the Three Lights aligned.\nThe Dao harmonizes with Nature—I ascend to the Purple Court.\nThe Sacred Talismans’ command benefits all life.\nMerit extends to all—Heaven and Earth in concord.\n\n**North:**\nNorthern Mystic Heaven, the Five-qi wandering.\nThe Star of Destiny shines resplendent, illuminating the Great Axis.\nThe Black Spirit, the Flying Immortal in feathered robes.\nGuarding the Five Gates, seizing the Essence, capturing the False.\nDare any transgress? They shall be shattered and felled.\nThe Jade Talisman’s decree—divine might shakes the Eight Directions.\nEvil gates sealed, the True Dao opened wide.\nReflecting upon my form, the Three Lights shine as one.\nRiding the void, floating—my form ascends as Immortal.\n\n**Central:**\nThe Yellow Center harmonizes the qi, governing the Mystic True.\nThe Star of Stability radiates, illuminating the Nine Heavens.\nThe Open-Mind Children—twelve in number—stand arrayed.\nThe Primordial qi, the solar essence, the crimson smoke ascending.\nPiercing all beneath Heaven, reaching my humble self.\nA hundred evils crushed, ten thousand ghosts ensnared.\nThe Central Mountain’s incantation—Heaven’s will accomplished.\nThe Five Spirits pacified—I fly as Celestial Immortal.\n\n**Five Stars Incantation:**\nThe Five Stars arrayed, resplendent in their directions.\nThe Water Star repels calamity, the Wood Virtue brings prosperity.\nThe Wandering Star dissipates misfortune, the Great White wards off armies.\nThe Stabilizing Star holds firm—nation and family prosper.\nNames inscribed on jade tablets, recorded in the Imperial Hall.\nRiding the gale, dispersing the scene—I soar through the void.\nEntering and exiting the Dark, wandering the Ten Directions.\nFive clouds enfold, summoning spirits, commanding winds.\nEnlisting all spirits—I guard the Celestial Official.\n\n**Twenty-Four Beats of the Law Drum:**\nThe High Functionary Master ignites the furnace.\nThe Most High True Primordial Five Spirits Lord of Old—\nconjuring the Functionary Messenger, the Left and Right Dragon-Tiger Lords,\nthe Incense-Bearing Attendants, the Three-qi True Gods—\nopening the Three Heavens to the Most High Primordial Sovereign Lord of Old.\n\nI now properly burn incense, reverently presenting the current Emperor’s jade altar rites concluded, the golden talisman fast completed.\nSpecially dispatched, [certain official] proceeds to [certain place] to offer the Dragon Tablets.\nReestablishing the ritual feast, I pray that the Most High’s Eight Directions’ True and Living qi descend into my body,\nso that my petition may swiftly reach the Supreme Truth, the Limitless Most High, the Three Sovereigns of the Three Pure Heavens.\n\nBowing twice, offering incense, tea, and wine.\n\nNext, the various invocations of the Law Positions:\nThe High Functionary, in proper Law Position, humbly reports to the Three Pure, the Most Sacred,\nthe Ten Extremes’ High Perfected Ones, the Five Directions’ Five Sovereigns,\nthe Three Officials of Heaven, Earth, and Water,\nthe True Rulers of the Grotto Heavens, the Four Seas, the Mountains and Rivers, the Water Palace Dragon Gods,\nall sacred realms, all Dao-attained Immortals and spirits.\n\nI, of humble nature and filth, have by grace attained the Dao’s gate.\nSacred precepts and numinous scriptures—I have heard the lofty models,\npropagating the Dao’s transformations, aiding the realm.\nFor all petitions, how could they not be heard?\n\nNow the Emperor, gathering blessings and averting disasters, concludes the rites.\nSpecially dispatched, [certain official] proceeds to [certain state’s] grotto, sacred mountain,\nto offer the Dragon Tablet and jade inscriptions.\nIn accordance with the sovereign’s edict, the ritual feast is renewed.\nI pray that the multitude of saints descend, perceiving my sincerity and accepting it.\nGranting my request, I humbly receive your divine favor.\n\nWith [certain official] and myself, in deepest awe, we kneel and bow twice, humbly petitioning.\n\nNext, offering incense again, presenting wine, and bowing.\n\nI reverently petition the Mid-Autumn Pardon of Offenses, the Earth Official,\nthe Forty-Two Divisions of the Mid-Autumn Celestial Officials,\nthe Divine Assembly of the Righteous from Wangwu Mountain’s Lesser Grotto Heaven,\nthe Ten Great Exhortative Heavenly Immortals,\nthe Five Sacred Peaks’ Grotto Heaven True Lords,\nthe Eighty-One Grotto Immortals, the Seventy Upper Blessed Lands’ Celestial Officials,\nthe Nine-Heaven Elder of Qingcheng Mountain, the True Lord of Stored Blessings and Fixed Fate,\nthe True Lord of Hidden Mountain’s Command,\nthe Nine-Heaven Investigator of Lushan, the True Lord of Responding to Heaven and Preserving Movement,\nall named peaks and sacred grottoes, all Dao-attained Dragon and Immortal spirits,\nwho may be moved to descend upon this ritual seat.\n\nWith deepest reverence, I kneel and bow twice.\n\nI reverently petition the Lower Autumn’s Liberation from Calamity Water Official,\nthe Forty-Two Divisions of the Lower Autumn Attendants,\nthe Sacred Assembly of Dragon Spirits, the Pure Source King of Jidu,\nall Dao-attained Dragon Spirits of Jidu,\nthe Celestial Officials of the Four Seas and Eight Oceans, the Three Rivers and Four Lakes,\nthe Nine Rivers’ Water Emperor, the Twelve River Sources’ River Marshals,\nthe River Lords and their Attendants,\nthe Great Marsh’s Spirit Officials of the Original Palace,\nall their officials—\nwho may be moved to descend upon this ritual seat.\n\nWith deepest reverence, I kneel and bow twice.\n\nNext, offering incense, presenting wine again, and bowing.",
      "overlap_context": " among whom one—preferably a priest who has received the **Faqie** (ritual talismans)—shall serve as the **High Functionary**.\n\nThe **ritual intent** shall be declared either upon the hall’s altar or the ritual platform, where the **Daoist assembly** shall be established, and incense shall be offered.\n\nThe altar shall be purified, and **imperial water** shall be sprinkled.\nThe **ritual masters** shall chant the prescribed liturgy, maintaining **mindful concentration** in accordance with the Dao.",
      "start_char": 220,
      "end_char": 1452,
      "start_sentence": 14,
      "end_sentence": 97,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 15.513558149337769,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓斋投简仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "次重称法位 臣谨重上启高真上圣，天地水三官，岳渎洞天、靖庐福地得道神仙，龙神官属，四海八溟、千川万谷、泉源水府灵司正神，当境一切威灵，得道圣众，降赴醮筵，鉴纳丹诚，流光映照。 伏愿皇帝邦基盘固，国寿天齐。 动植沾恩，华夷蒙润。 甘露零而祥风集，卿云现而景曜垂。 毒疠屏消，吉祥蕃委。 惟神克念，永孚于休，一切含生，并登道岸。 臣等诚惶诚恐，稽首顿首，再拜奉送。 次十二愿。 臣等一愿乾坤明素，上愿炁象清圆，三愿圣人万寿，四愿化洽八埏，五愿天垂甘露，六愿地发祥烟，七愿四时应节，八愿万物生全，九愿家多孝悌，十愿国富才贤，十一愿酆都罢对，十二愿学道成仙。 次高功复炉祝曰 香官使者、左右龙虎君，侍香诸灵官，当令行道之所，自然生金液丹碧芝英。 百灵众真，交会在此香火炉前。 上愿皇帝受福，天下蒙恩。 十方仙童，玉女侍卫，香烟传奏，向来所启，速达至真无极大道三清上帝御前。 次举学仙颂 学仙行为急，奉戒制精心。 虚夷正气居，仙圣自相寻。 若不信夫言，胡为栖山林。 次如法焚香，度简投下洞天 次诣水府 次举投简颂",
      "translated_text": "「Next, I solemnly repeat the invocation of the sacred ranks.\nWith deepest reverence, I once again earnestly offer incense and petition the High True and Supreme Sage,\nthe Three Officials of Heaven, Earth, and Water,\nthe Dao-attained Spirits of the Mountain and Water Caverns, the Auspicious Abode of Jìng Lú,\nthe Dragon Spirits and their officials,\nthe Celestial Officials of the Four Seas and Eight Oceans, the myriad rivers and valleys, and the Water Palaces of springs and sources,\nall the mighty and numinous spirits within this domain,\nthe Dao-attained Sacred Assembly—\nmay they descend upon this ritual feast,\nand accept my sincere devotion,\ntheir radiance flowing and their light reflected.\n\nI humbly pray that the Emperor’s foundation be steadfast,\nand the nation’s longevity match the heavens.\nMay all creatures, both animate and inanimate, benefit from his grace,\nand the civilized and the barbarian alike receive his blessings.\nMay the sweet dew fall and auspicious winds gather,\nmay the misty clouds appear and celestial radiance descend.\nMay pestilence and calamity be repelled,\nand fortune and blessings flourish abundantly.\nMay the spirits, in their benevolence, remember these prayers,\nand forever bestow rest upon all beings.\nMay every living creature attain the Dao’s shore.\n\nWith deepest reverence and trepidation, I kneel and bow twice,\nrepeating the offering.\n\nNext, the Twelve Prayers.\nMy first prayer is for the heavens and earth to be pure and clear,\nmy second for the *qi* patterns to be harmonious and round,\nmy third for the Sages’ longevity to be boundless,\nmy fourth for the Way’s teachings to be widely embraced,\nmy fifth for the heavens to bestow sweet dew,\nmy sixth for the earth to emit auspicious vapors,\nmy seventh for the four seasons to follow their proper order,\nmy eighth for all things to flourish in fullness,\nmy ninth for households to be filled with filial piety and fraternal virtue,\nmy tenth for the nation to abound in talent and worthy men,\nmy eleventh for the *Tíngdōu* (Netherworld) to cease its trials,\nmy twelfth for the study of the Dao to lead to transcendence.\n\nNext, the High Functionary renews the incense and offers the invocation:\n*\"Incense Officials and Messengers, Dragon and Tiger Lords of Left and Right,*\n*Attendants who serve the incense,*\n*May the places where the Way is practiced*\n*naturally produce golden elixirs, azure *dān* (alchemical pills), and immortal herbs.*\n*All the spirits of the myriad beings,*\n*gather here at this incense altar.\nI pray that the Emperor receive blessings,*\n*and the world be bathed in grace.*\n\n*To the Ten Directions’ Dao-attained Immortals,*\n*and the Jade Maidens who guard them,*\n*May the incense smoke convey my petitions,*\n*and swiftly reach the Supreme Dao of the Three Pure Ones,*\n*before the boundless and ultimate Emperor of Heaven.\"*\n\nNext, I recite the *Precept on Learning the Dao*:\n*\"Learning the Dao is urgent in deed,*\n*and in heart, I earnestly uphold the precepts.*\n*With the *qi* refined and true,*\n*the Dao-attained Saints come seeking me.*\n*If one does not heed these words,*\n*why dwell in mountain forests?\"*\n\nNext, I burn the incense as prescribed,\nand cast the written petitions into the Cavern of the Netherworld.\nNext, I proceed to the Water Palaces.\nNext, I recite the *Precept on Casting Petitions*.",
      "overlap_context": "ce King of Jidu,\nall Dao-attained Dragon Spirits of Jidu,\nthe Celestial Officials of the Four Seas and Eight Oceans, the Three Rivers and Four Lakes,\nthe Nine Rivers’ Water Emperor, the Twelve River Sources’ River Marshals,\nthe River Lords and their Attendants,\nthe Great Marsh’s Spirit Officials of the Original Palace,\nall their officials—\nwho may be moved to descend upon this ritual seat.\n\nWith deepest reverence, I kneel and bow twice.\n\nNext, offering incense, presenting wine again, and bowing.",
      "start_char": 1452,
      "end_char": 1915,
      "start_sentence": 98,
      "end_sentence": 119,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 9.23155951499939,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓斋投简仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "祈真登紫府，告命诣灵坛。 玉女谣梵响，金童奏香烟。 书名通九地，列字上三天。 永享无期寿，克成高上仙。 次举回向赞 向来设醮功德，上祝皇帝，次及臣寮，同赖善功，成无上道。 一切信礼。 次高功回向，念善云 上来投简事毕，设醮页德周备。 奉为皇帝，上祝圣寿无穷。 念大圣元始天尊、太上玉晨大道君、太上金阙老君、太上三清大天帝，无量不可思议功德。 道众山呼 山简式 嗣天子臣伏为迎祥集福，祇建冲科。 谨赍龙璧信币之仪，命道士几人於某宫观某殿，开启金箓道场几昼夜。 罢散日，设普天大醮一座，三千六百分位。 告盟天地，记算延厘。 斋事周圆，恭陈大醮。 谨依旧式，诣洞天投送金龙玉简，愿神愿仙，飞行上清，五岳真人，至圣至真。 鉴此丹恳，乞为誊奏。 上闻九天，谨诣灵山，金龙驿传。 某年太岁某甲子，几月某朔，几日某甲子，於道场内，吉时告闻。 土简式 嗣天子臣伏为迎祥集福，祗建冲科。 谨赍龙璧信币之仪，命道士几人於某宫观某殿，开启金箓道场几昼夜。 罢散日，设普天大醮一座，三千六百分位。 告盟天地，纪算延厘。 斋事周圆，恭陈大醮。 谨依旧式，诣灵坛投送金龙玉简。 愿仙飞行上清，中黄九土戊已黄神，土府五帝，鉴此丹恳，乞为誊奏。 上闻九天，金龙驿传。 某年太岁某甲子，几月某朔，几日某甲子，於道场内，吉时告闻。 水简式 嗣天子臣伏为迎祥集福，祗建冲科。 谨赍龙璧信币之仪，命道士几人於某宫观某殿，开启金箓道场几昼夜。 罢散日，设普天大醮一座，三千六百分位。 告盟天地，纪算延厘。 斋事周圆，恭陈大醮。 谨依旧式，诣水府投送金龙玉简。 愿神愿他，三元同存，九府水帝、十二河源，江河淮济，溟泠大神，至圣至真。 鉴此丹恳，乞为誊奏。 上闻九天，谨诣水府，金龙驿传。 某年太岁某甲子，几月某朔，几日某甲子，於道场内，吉时告闻。 青纸封简 题式",
      "translated_text": "I now pray to the True Ones in the Purple Palace,*\nand announce my life’s end at the Sacred Hall of the Spirit.*\n\nThe Jade Maidens chant with melodious dharma,*\nwhile the Golden Boys play incense on their celestial zithers.*\nMy written name ascends through the Nine Earths,*\nand my characters reach the Three Heavens above.*\n\nMay I forever enjoy boundless life,*\nand attain the lofty Dao of the Immortal Saints.\n\nNext, I recite the *Meritorious Dedication Praise*:\n\n*\"The merits of these rites I now dedicate,*\n*first to bless the Emperor,*\n*then to all his ministers.*\n*Together, we rely on virtue’s power,*\n*to perfect the Supreme Dao.*\n\n*May all who believe and honor this be rewarded.*\n\nNext, the Highest Merit Dedication:\n*\"The rites of petition are now complete,*\n*and the meritorious offerings are fully prepared.*\n*For the Emperor, I pray for eternal sacred life.*\n\n*I invoke the Great Saints—*\n*the Primordial Sovereign of Heavenly Origins,*\n*the Supreme Daoist Lord of Jade Morning,*\n*the Supreme Old Lord of Golden Gate,*\n*and the Supreme Three Pure Ones, the Great Heavenly Emperor—*\n*their boundless, unimaginable virtues.*\n\n*To the Dao-attained multitude of the Five Sacred Peaks,*\n*in the Mountain Simplified Form:*\n*The Emperor’s successor humbly bows,*\n*to welcome auspicious blessings and gather merit,*\n*solely to establish the Celestial Science.*\n\n*With reverence, I present the offerings of the Dragon Tablet and jade coins,*\n*and command Daoist priests—*\n*several at a certain palace or observatory,*\n*in a certain hall—*\n*to open the Golden Register Dao Assembly,*\n*for several days and nights.*\n\n*On the day of conclusion,*\n*a Great Universal Rite is set up,*\n*with three thousand six hundred ranks.*\n\n*I solemnly pledge to Heaven and Earth,*\n*and record the tally of merits and debts.*\n*The fasts are complete, and I respectfully present the Great Rite.*\n\n*In strict accordance with tradition,*\n*I proceed to the Cavern of the Netherworld,*\n*to deliver the Golden Dragon Jade Petitions.*\n*May the gods and Dao-attained ones,*\n*flying in the Upper Clarity,*\n*the Five Sacred Peaks’ True Persons,*\n*and the Most Sacred and Most True—*\n*see this sincere plea,*\n*and grant it swift celestial transmission.*\n\n*Above, the Nine Heavens hear,*\n*and I respectfully go to the Sacred Mountain,*\n*sent by the Golden Dragon Post.*\n\n*In the year of the Great Soil, certain [celestial] stem-branch,*\n*on the [certain] month of the [certain] day,*\n*and the [certain] day of the [certain] stem-branch,*\n*within the Dao Assembly,*\n*at the auspicious hour, I announce the hearing.*\n\n*In the Earth Simplified Form:*\n*The Emperor’s successor humbly bows,*\n*to welcome auspicious blessings and gather merit,*\n*solely to establish the Celestial Science.*\n\n*With reverence, I present the offerings of the Dragon Tablet and jade coins,*\n*and command Daoist priests—*\n*several at a certain palace or observatory,*\n*in a certain hall—*\n*to open the Golden Register Dao Assembly,*\n*for several days and nights.*\n\n*On the day of conclusion,*\n*a Great Universal Rite is set up,*\n*with three thousand six hundred ranks.*\n\n*I solemnly pledge to Heaven and Earth,*\n*and record the tally of merits and debts.*\n*The fasts are complete, and I respectfully present the Great Rite.*\n\n*In strict accordance with tradition,*\n*I proceed to the Sacred Hall,*\n*to deliver the Golden Dragon Jade Petitions.*\n*May the Dao-attained ones fly in the Upper Clarity,*\n*the Central Yellow Nine Soils’ Stewarding Gods,*\n*and the Five Earthly Sovereigns—*\n*see this sincere plea,*\n*and grant it swift celestial transmission.*\n\n*Above, the Nine Heavens hear,*\n*sent by the Golden Dragon Post.*\n\n*In the year of the Great Soil, certain [celestial] stem-branch,*\n*on the [certain] month of the [certain] day,*\n*and the [certain] day of the [certain] stem-branch,*\n*within the Dao Assembly,*\n*at the auspicious hour, I announce the hearing.*\n\n*In the Water Simplified Form:*\n*The Emperor’s successor humbly bows,*\n*to welcome auspicious blessings and gather merit,*\n*solely to establish the Celestial Science.*\n\n*With reverence, I present the offerings of the Dragon Tablet and jade coins,*\n*and command Daoist priests—*\n*several at a certain palace or observatory,*\n*in a certain hall—*\n*to open the Golden Register Dao Assembly,*\n*for several days and nights.*\n\n*On the day of conclusion,*\n*a Great Universal Rite is set up,*\n*with three thousand six hundred ranks.*\n\n*I solemnly pledge to Heaven and Earth,*\n*and record the tally of merits and debts.*\n*The fasts are complete, and I respectfully present the Great Rite.*\n\n*In strict accordance with tradition,*\n*I proceed to the Water Palaces,*\n*to deliver the Golden Dragon Jade Petitions.*\n*May the gods and Dao-attained ones,*\n*the Three Primordial Cycles coexisting,*\n*the Nine Water Palaces and Twelve River Sources,*\n*the Great Gods of the Yangtze, Huai, and Hai,*\n*and the Oceanic and Celestial Deities—*\n*the Most Sacred and Most True—*\n*see this sincere plea,*\n*and grant it swift celestial transmission.*\n\n*Above, the Nine Heavens hear,*\n*and I respectfully go to the Water Palaces,*\n*sent by the Golden Dragon Post.*\n\n*In the year of the Great Soil, certain [celestial] stem-branch,*\n*on the [certain] month of the [certain] day,*\n*and the [certain] day of the [certain] stem-branch,*\n*within the Dao Assembly,*\n*at the auspicious hour, I announce the hearing.*\n\n*With green paper sealing the petition,*\n*I present the Simplified Form.*",
      "overlap_context": "eror of Heaven.\"*\n\nNext, I recite the *Precept on Learning the Dao*:\n*\"Learning the Dao is urgent in deed,*\n*and in heart, I earnestly uphold the precepts.*\n*With the *qi* refined and true,*\n*the Dao-attained Saints come seeking me.*\n*If one does not heed these words,*\n*why dwell in mountain forests?\"*\n\nNext, I burn the incense as prescribed,\nand cast the written petitions into the Cavern of the Netherworld.\nNext, I proceed to the Water Palaces.\nNext, I recite the *Precept on Casting Petitions*.",
      "start_char": 1915,
      "end_char": 2675,
      "start_sentence": 120,
      "end_sentence": 164,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 16.479360818862915,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓斋投简仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "谨上诣某处，具高功法位臣姓名告文谨封。 金箓斋科仪序 臣商英奉御笔曰：卿文章政事之外，深究道妙，博穷秘典。 蕊笈琅函，靡不通贯。 矧金箓科教，信为余事。 向委一二道士，将道场仪矩，稽考藏典校正，近成书帙来上，尝付道官定夺。 今据签出，异同甚多。 并降付卿，可机政余暇看详，指定可否，如有讨论未备，文义乖讹，并未尽事件，并行贴改，删润进入。 臣，商英拜手稽首，敢不对扬。 天子之丕显休命乃言曰：若昔帝王，匪天何宪，匪道何尊。 黄帝曰：观天之道，执天之行，尽矣。 孔子曰：唯天为大，唯尧则之。 帝舜曰：敕天之命，惟时惟几。 传说曰：惟天聪明，惟圣时宪。 周诗曰：文王陟降，在帝左右。 然则寂寥淡泊，必有以质其诚，恍惚希夷，必有以将其意。 斋醮之兴，其在兹乎。 是以自然妙经，演说科范，因事制法，析为九条。 陆修靖行之於前； 杜光庭集之於后。 神宗讲兴废典，杨杰编纂而成书。 陛下善继先猷，愚臣讨论而润色。 且夫周公咸秩无文，宣王靡神不举。 凡以为民而救灾者，无所不至也。 而况苍苍在上，昭昭垂象。 六虚周流而变动，百姓日用而不知。 为天下国家者，其可忽哉。 尊帝一十三位虚皇太上三尊，道之真元也。 三清上帝，道之妙有也。 昊天玉皇上帝、三十二天帝、统御世界而成变化者也。 天皇大帝、紫微帝君，在天成象之帝也。 虚皇地后，三元九炁，所自生也。 名号繁多，非道之体。 博研经论考三界，质之幽明而无碍，非以私意而增损也。 旧仪先后颠倒，繁简不伦。 今斟酌九条，差次圣位，删削名号，补完教意。 一曰，请师非师，则谁主法会。 二曰，补职非职，则谁行科法。 三曰，授戒非清净，则何以入坛场。 四曰，敕坛非解秽，则何以降仙圣。 五曰登天门非登乾出巽，则旋绕不匝。 六曰，拜表进章非法印合符，则何以通天门。 七曰，真文玉篇辩方正位，以应五行之炁。 八曰，众妙坛，用王屋山司马子微法象之制。 九曰，天宝台取玄坛之台制，移置殿中，以伸陟降之仪，以备风而之至。 行法之士，详而练之。 臣，商英谨序",
      "translated_text": "**Translation:**\n\n*\"Respectfully, I submit to [the relevant authority] at [location], presenting the high-ranking Daoist official’s name and petition text, sealed as follows:*\n\n**The Ritual Sequence for the Golden Daoist Register (Jinqu) Ceremonies**\n\n*Your servant, Shang Ying, humbly receives Your Majesty’s imperial edict, which states:*\n\n*\"Beyond your mastery of literature and governance, you delve deeply into the Dao’s mysteries and exhaustively study the arcane classics. No text—whether the *Ruiji* or the *Langhan*—remains beyond your grasp. Indeed, the *Jinqu* ritual system is but an additional matter for your expertise.*\n\n*Previously, I entrusted a few Daoist priests to examine the ritual framework of the Dao Assembly, cross-referencing it with hidden classics for correction. They have now compiled a draft for review. Upon inspection, numerous discrepancies were found. I have thus submitted it to you, requesting that in your leisure from governance, you carefully examine it, marking what is acceptable or not. Should there be unresolved debates, textual errors, or incomplete matters, you may annotate corrections and refinements accordingly.*\n\n*Your servant, Shang Ying, kneels and prostrates, daring not to disobey.\"*\n\n*The Emperor’s august and illustrious decree proclaims:*\n\n*\"As in ancient times, the sovereigns did not establish their rule without reference to Heaven, nor did they accord reverence to the Dao without foundation. The Yellow Emperor said: ‘To observe the Dao of Heaven and follow its movements is to exhaust its essence.’ Confucius said: ‘Only Heaven is supreme; only Yao followed it.’ Emperor Shun said: ‘The Mandate of Heaven is to be heeded at the critical moment.’ The Classics state: ‘Heaven is wise and clear; the sage follows its Mandate.’ The *Book of Songs* says: ‘King Wen ascended and descended, standing at Heaven’s side.’*\n\n*Thus, in stillness and simplicity, there must be sincerity; in the subtle and elusive, there must be intention. The origins of fasting and ritual purification lie here.*\n\n*Therefore, the *Natural Mystery Classic* expounds upon ritual frameworks, adapting methods to circumstances and dividing them into nine categories. Lu Xiujing codified them in his time; Du Guangting later compiled them. Emperor Shenzong revived the neglected rites, and Yang Jie edited them into a book. Your Majesty, continuing the legacy of your predecessors, has allowed your humble servant to refine and polish them.*\n\n*Moreover, the Duke of Zhou established the ranks without omission, and King Xuan of Zhou performed no rites without divine efficacy. All measures taken to benefit the people and avert calamities were exhaustive. How much more so when Heaven’s vast and luminous symbols pervade all things! The Six *Xu* (voids) circulate and transform, while the people live their daily lives unaware. For those governing the realm, can this be neglected?*\n\n*We honor the Thirteen Empty Celestial Sovereigns and the Three Primordial Lords of the Highest Dao—the true origins of the Dao. The Three Pure Ones are the Dao’s wondrous manifestations. The Jade Emperor of the Celestial Vault, the Thirty-Two Heavenly Sovereigns, and those who govern the cosmos and effect transformations. The Celestial Emperor and the Purple Forbidden Emperor are the Heavenly Sovereigns who manifest in the celestial realm. The Empty Celestial Sovereign and the Earthly Empress are the sources of the Three Primordial Cycles and the Nine *qi*.*\n\n*Their names are numerous, yet they do not constitute the Dao’s essence. By thoroughly researching the scriptures and examining the Three Realms, we verify their truths without obstruction, neither adding nor subtracting by private whim.*\n\n*The old rituals were disordered in sequence and lacked proper balance in complexity and simplicity. Now, I have reconsidered the nine categories, arranging the ranks of the saints, pruning superfluous names, and completing the ritual intent. They are as follows:*\n\n1. *The invocation of a master—if not a true master, then who shall preside over the ritual assembly?*\n2. *The assignment of officials—if not properly appointed, then who shall perform the ritual laws?*\n3. *The conferral of precepts—if not pure, then how may one enter the ritual platform?*\n4. *The proclamation of the altar—if not purified, then how shall the celestial saints descend?*\n5. *The ascent through the Heavenly Gate—if not aligned with *Kuan* and *Xun*, then the circumambulation will be incomplete.*\n6. *The presentation of petitions and tablets—if not sealed with the ritual seal and符, then how shall they pass through the Heavenly Gate?*\n7. *The True Scriptures and Jade Tablets must be verified for correctness and alignment, corresponding to the *qi* of the Five Phases.*\n8. *The Assembly of Wondrous Mysteries shall employ the ritual diagram of Sima Ziming from Mount Wangwu.*\n9. *The Celestial Treasure Platform shall adopt the design of the Mysterious Platform, relocated within the hall to facilitate ascension and descent, and to welcome the arrival of the winds.\"*\n\n*Let those who practice the rites study and master these carefully.*\n\n*Your servant, Shang Ying, humbly records this sequence.\"*",
      "overlap_context": "ee this sincere plea,*\n*and grant it swift celestial transmission.*\n\n*Above, the Nine Heavens hear,*\n*and I respectfully go to the Water Palaces,*\n*sent by the Golden Dragon Post.*\n\n*In the year of the Great Soil, certain [celestial] stem-branch,*\n*on the [certain] month of the [certain] day,*\n*and the [certain] day of the [certain] stem-branch,*\n*within the Dao Assembly,*\n*at the auspicious hour, I announce the hearing.*\n\n*With green paper sealing the petition,*\n*I present the Simplified Form.*",
      "start_char": 2675,
      "end_char": 3479,
      "start_sentence": 165,
      "end_sentence": 211,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 11.30912470817566,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓斋投简仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "金箓斋投简仪竟",
      "translated_text": "The **Golden Talisman Hall**—the ritual for offering petitions is now complete.",
      "overlap_context": "rrectness and alignment, corresponding to the *qi* of the Five Phases.*\n8. *The Assembly of Wondrous Mysteries shall employ the ritual diagram of Sima Ziming from Mount Wangwu.*\n9. *The Celestial Treasure Platform shall adopt the design of the Mysterious Platform, relocated within the hall to facilitate ascension and descent, and to welcome the arrival of the winds.\"*\n\n*Let those who practice the rites study and master these carefully.*\n\n*Your servant, Shang Ying, humbly records this sequence.\"*",
      "start_char": 3479,
      "end_char": 3489,
      "start_sentence": 212,
      "end_sentence": 212,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 0.36098527908325195,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\威仪类\\金箓斋投简仪.txt",
        "category": "威仪类"
      }
    }
  ]
}