{
  "source_id": "铜符铁卷",
  "source_file": "chunked_daozang\\铜符铁卷.json",
  "total_chunks": 14,
  "total_original_chars": 13460,
  "total_translated_chars": 80174,
  "total_translation_time": 259.8151099681854,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\藏外\\铜符铁卷.txt",
    "category": "藏外"
  },
  "full_translation": "**\"The Copper Talisman and Iron Scroll: Master Formula of the Three Primordial Elixirs**\n\nWhen the Jade Purity bestows the decree of immortal office,\nIt governs the Southern Cauldron, mastering the transformation of all things.\nThe crimson script is profound and hidden in Pengyi’s chamber,\nThe dark arts are most forbidden beneath the azure sky’s verdant expanse.\n\nEight myriads, four thousand—one kalpa’s legacy—\nPassed down through celestial talismans, inscribed by the Fire Record’s chronicle.\nIn the year of *Gēng-Jiǎ* (庚甲), chaotic *qi* dissolves,\nAs myriad heavenly assemblies rejoice in their grand celestial halls.\n\nProstrating in reverence before the Great Dao,\nTen thousand sages and true ones abide in profound stillness.\nGazing afar upon the Crystal Terrace, guests of Jade Purity,\nThe brows remain unfurrowed, yet the heart is heavy with concealed sorrow.\n\nAfter long deliberation, the Nine-Six Gates are raised,\nAnd the crane’s flight is heard as it seeks the turtle’s upward gaze.\nThe Great Dao spreads, filling the heavens above,\nYour ranks of immortals rejoice without bound.\n\nWhen the Three Kalpas of the Dragon and Han dynasties conclude,\nThe Mystic Palace unfolds its vast and auspicious domain.\nThe Eastern and Western Hua ascend in turn,\nThe Grand Sovereign of the Great Unity, *Zhēn Mǔ* (谌母), is transmitted.\n\nReceiving the august decree of the Second Eight,\nMost profound, most wondrous, most subtle and hidden.\nIt can make the dusty world flow with jade nectar,\nAnd swiftly summon the immortal to the Celestial Pool.\n\nThe Pearl Terrace descends the Copper Talisman and Iron Scroll,\nImperially bestowed to *Zhēn Mǔ* (谌母) for her knowledge.\nThe Great Dao’s True Person expounds the Dao’s immortal secrets,\nInterpreting the orthodox teachings: mercury and lead in harmony.\n\nLead ascends like snow-waves, pearls roll in flight,\nYet when lowered, it rests as true earth in slumber.\nEarth, in response to the talisman’s decree, bears emerald leaves,\nEach blossom a golden flower, rising in purple mist.\n\nThe purple mist ascends to the Lingxiao Hall,\nContinuously linked, like scattered petals of water.\nThe sun and moon cast their radiant light upon the Great Thousand,\nThe *Xùn* (巽) wind blows, revealing golden flowers.\n\nWithout the rolling pearls, one cannot measure the lead,\nAs living beings gather their essence to ward off perilous battles.\nThe solar spirit is about to depart, the lunar deity is full,\nResplendent solar spirits, nine myriads in glory.\n\nThe four quarters are enveloped by the True Lead’s fusion,\nLead containing five colors—who could ever perceive?\nRefining lead without measuring the True Transmission,\nOne cannot find *Gēng Jīn Huà* (庚金华) without obstruction.\n\nHarvesting the True Lead of *Xīn Jīn* (辛金), a single essence,\nThen returning to the Ash Pool for further purification.\nAscending and descending in tumultuous flux,\nDo not let the *Rén Huā* (壬花) be disordered by black clouds.\n\nExtracting the celestial spirit, seizing the solar mist,\nWithin the Water Crystal Palace—there lies my true abode.\nRetrieving the rolling gold to restore the sacred form,\nWhy toil endlessly across the vast expanse of the world?\n\nMercury dies, becoming lead, which then transforms into earth,\nThe white gold vessel—the ancestor of the elixir’s foundation.\nExhausting the celestial spirit and terrestrial essence,\nThe Primordial Origin calls this the *Dān Mǔ* (丹母).\n\nMercury accumulates ninety-nine times, returning as sand,\nThe Dragon emerges from the east, the Tiger from the west.\nIn the Jin dynasty, the enlightened king preserved filial virtue,\nHis golden sinews and jade bones granted to his descendants.\n\nThe incantation commands the water to subdue the demonic leader,\nHis manifest and covert virtues benefit all under heaven.\nTake the Iron Scroll’s decree of the Heavenly King,\nAnd the Copper Talisman’s subtle secrets, passed orally to you.\n\nThe Jade Purity wishes to see the virtuous and meritorious,\nHis broad brows unfurl, his face bright with joy.\nThe Great Obstruction is sealed within a jade casket,\nA radiant pearl shatters the world, revealing its hidden citadel.\n\nSwiftly seize the famous mountain’s jade hare,\nDazzling the sun, capturing it—no further debate.\nWhen the solar spirit is exhausted, the thousand mountains turn white,\nWhy fret over trifles when the body is already shadowed?\n\nSimply boil millet to nourish the spirit-*qi*,\nObserving the celestial timing, leaning toward the Five Tombs.\n\nThe malevolent dragon spews forth the Three Rivers’ waters,\nIts venomous *qi* scatters, staining the world’s dust.\nIf you do not command it to aid in calamity,\nThe skeletal city and blood sea will grieve your heart.\n\nHasten to refine it in the Cauldron Pool’s furnace,\nCrafting the sun and moon’s essence with cunning.\nDao methods number in the thousands and ten thousands,\nYet among them, this one alone is supreme.\n\nTwelve celestial talismans, nine white snows,\nThree cycles and five revolutions—named Heavenly Blue.\nOne grain, one dose, three periods later,\nThe body’s nine orifices shine with radiant clarity.\n\nWhite snow enters the mouth, the body sprouts feathers,\nThe talisman is swallowed, the feet generate clouds.\nGradually, the Three Yangs open, heralding auspicious days,\nThe transient life, like rotting grass, meets the spring’s rebirth.\n\nWhen virtue is high and practice complete, one receives celestial rewards,\nAscending the ancestral hall, filling the home with transcendence.\nAttending the early court of the Supreme Sovereign,\nHe casts down golden seals, jade decrees, and celestial scriptures—\nThe Five Peaks welcome him.\n\nLeisurely observing the Verdant Realm’s empty hymns,\nThe *Sháo* (韶) music resounds, yet the *qi* remains dense.\nSince the day the Five Clouds ascended in glory,\nThe fragrance of heaven has filled the chamber—\nA scent known through ancient and modern times.\n\nThe Nine-Six celestial secrets are entrusted to me,\nTreasure them in hidden chambers, do not hold them lightly.\nThe Perfect Ones imparted it to King Wu of the Chu (吴王李),\nYet when rejected, the thunder-fire descended immediately.\n\nThe Golden Elixir is transmitted from the Mystic Origin,\nThe Five *qi* disperse, yet one essence remains.\nIt is not the Three-One method of the swallow’s call,\nNor the saliva from turning one’s head inward.\nIt is not the *Guī Dān* (闺丹) art of consorting with women,\nNor the cinnabar elixir forged from arsenic ore.\n\nLead is the Primordial Spirit, silver is its form,\nWhen form and spirit unite, they become the True One.\nWhen the Primordial Spirit meets the True Form,\nThen observe the Primordial Spirit in the Great Purity.\n\n**The Precious Pagoda Formula**\nAncient method of nine tiers—\nThe void’s utmost, where medicines cannot reach—\nNow reduced for practical use.\nOr seven tiers, or five,\nEach chamber six inches high,\nBeneath placed the *Péng Hú* (蓬壶) vase,\nWith male and female *zǐkǒu* (子口) openings,\nEach tier possessing subtle orifices,\nTo facilitate the ascent of Dragon and Tiger *qi*,\nAnd ensure their stable union.\n\nSitting above the pool,\nAn iron ring is suspended from the ceiling beam,\nSecured firmly,\nThen the internal fire is ignited.\nWhen the fire nears the *Péng Hú* (蓬壶),\nA waist-high iron frame is raised,\nEnveloping the fire’s force,\nSo that the secondary fire does not intrude upon the Precious Pagoda,\nAnd the *Zhūquè* (朱雀) easily finds its place.\n\nThe lead is inserted at the upper gate, half an inch thick,\nIts height extending to the base of the vessel.\nThree sides are fortified with three supports,\nEach as thick as a finger joint,\nNow the fire’s power is strong.\n\nIn antiquity, it was transmitted to use a bellows to subdue the flame,\nLater generations opened the wind gates,\nFor the sake of human convenience,\nNot necessarily adhering to the old ways.\n\nYin and Yang are its Dao,\nAdaptability is its method,\nOpening and closing the wind,\nNot allowing fierce gusts to disturb the cauldron’s pool,\nConstantly ordering attendants to patrol,\nLest any unforeseen disaster occur—\nYet even in ordinary practice,\nThough it takes a hundred days of labor,\nIt is the foundation for ascending to heaven.\n\n**The Formula for Extracting True Lead**\nFirst, extract mountain lead sand—several hundred pounds—\nAnd pound it into powder.\nThen take the mineral’s upper layer of clay soil,\nFor every pound of lead,\nAdd four ounces of salt,\nPound it ten thousand times.\nWeigh out one pound of lead powder,\nWrap it in paper in multiple layers,\nSeal it externally with salt clay,\nFive or six divisions thick,\nAnd dry it thoroughly under the sun.\"\n\nThus, three to five hundred [pellets],\nInsert into the furnace and calcine them.\n\nThe furnace’s form resembles a large steamer,\nSix to seven feet in height, a circumference of ten feet,\nWith bellows installed below, flames ascending from the hearth.\nSpread a foot of charcoal at the base,\nThen layer lead-sand pellets upon the charcoal,\nAlternating layers of charcoal and pellets.\n\nWhen the fire burns until the interior and exterior glow red,\nExtinguish the flames and let the furnace cool,\nThen cover it with damp earth.\nThe lead below solidifies into a single mass;\nBreaking open the pellets, it emerges like raw silver ore—\nThis is called *Ganfu* [Dry Father].\n\nTake this *Ganfu* to refine into *liujin* [mercury],\nFor then the elixir gains vitality—\nNot mere lead ore mixed with clay,\nOtherwise its essence will dissipate into nothingness.\nWithout a master’s transmission,\nIf one acts recklessly, it will surely lead to ruin.\n\nThe supreme elixir’s sole ingredient is refined lead.\nIf this treasure is obtained, all matters are complete.\n\nThis is the primordial *True One Water* of the Preheaven,\nIts quantity multiplied manyfold,\nTo serve as the foundation for the sacred ash’s construction.\n\nExtracting one part of true earth-water,\nIts worth exceeds a pound of gold.\n\nNow, the divine mechanism awaits the subsequent great method.\n\n**Ancient Xi-Huang’s Method for Refining the Divine Elixir**\n*Earth Element’s Initial Step, Golden Cauldron’s Divine Chamber.*\n\nUpper and lower strings [of the furnace],\nEach weighing one *jin*.\nAs with the Nine Cauldrons, Seven Cauldrons,\nFive Cauldrons, or Three Cauldrons—\nThe heart follows the great method’s prescribed measures.\n\nIf using eight *liang* of white gold [silver],\nTake thirty-six *jin* of black lead infused with *fuyi* [subdued qi].\nFor eight to nine *liang* or seventy-two *liang*,\nExtract according to the Nine Pools.\n\nFear not the lead’s qi is insufficient—\nThe divine essence descends sparingly,\nMaking it difficult to harmonize with Heaven and Earth’s seals.\nHalf a *jin* to eight *liang*—\nNow, refine nine *liang* to produce one *liang*,\nTo dissipate excess qi.\n\nFirst, seek the *Earth’s Soul*—\nThe *Earth’s Soul* is white gold [silver].\nNext, take the *Heaven’s Spirit*—\nThe *Heaven’s Spirit* is yellow gold [gold].\nYellow gold produces *zhushasha* [cinnabar sand],\nThe essence of the sun.\nWhite gold generates flowing pearls,\nThe essence of the moon.\nWhen spirit and soul unite,\nThe essence and brilliance spontaneously coalesce into one.\n\nSeizing the complete function of Heaven and Earth’s sun and moon—\nThis is the sacred ancestor’s *Xuanyuan’s* wondrous application.\nThe Sage knows that divine substances conceal in the North,\nComing here to forge the elixir’s head.\nWorldly gold, though of pure yang essence,\nEven after a hundred refinements, will never absorb qi.\nAs for copper and tin,\nTheir nature is excessively dry,\nMaking it difficult to encounter the *Golden Lord*—\nIf encountered, their form will surely be damaged.\n\nOnly white gold,\nIn its singular affinity, rejoices in harmony.\nGolden flowers bloom, pearls flow,\nPrecious pearls emerge radiant among them.\nTrue yin and true yang,\nTheir lights intermingle, their bodies unite.\nSkillfully applying the *Zhoutian* [Postheaven] measures,\nFilling the five colors with central yellow,\nNaturally, yang arises from true earth—\nEarth flourishes, metal thrives.\nBorrowing the *Water Tiger* to nurture and give birth to the *Shenlong* [Divine Dragon],\nFive-colored scales shimmer,\nGolden ointment, jade-like body,\nEver luminous and enduring,\nAs the ancestral elixir for ascending to heaven—\nThe more it is refined, the more potent it becomes;\nThe more it is tempered, the more wondrous it grows.\n\nThus, there are the *Yin Pool* and *Yang Cauldron*.\nSince lead does not endure refining,\nEstablish methods and symbols to determine its floating and sinking nature.\nConstruct the cauldron as yang,\nSo that the yang spirit ascends to the celestial realm above.\nFashion the pool as yin,\nSo that the yin soul descends into the underworld below.\n\nThe *One-Nine* method’s efficacy lies in lead,\nThe *Two-Nine* method’s efficacy lies in the mother [mercury].\nAll other formulas omit the mother—\nThe elixir’s gate suffers in vain,\nHow can *Renji* [metal and water] be divided?\nThe aged and brittle transform into yin earth,\nUsing lead requires secret transmission.\nInitially, gold refines lead,\nFloating and sinking reveal the truth.\nPreheaven and Postheaven,\nRecognizing their inner essence,\nNo need to seek cave-dwelling immortals.\nLike an infant searching for its wet nurse,\nCycle after cycle, passing through the *Xuan* [Mysterious] Gate.\nThe medicine is true *mercury*,\nThe gold elixir is the divine elixir.\nOne mother bears nine children,\nEach transmitting their own branches and leaves.\nVirtue is insufficient to encounter [it],\nKarma is insufficient to hear [it].\nThis is the obscure, hidden true method—\nChild, commit it to memory.\n\n**Method for Establishing the Furnace and Cauldron**\nOfferings to the Nine Celestial Lords of the Five Soils,\nThe Seven Stars of the Northern Dipper’s True Immortals,\nAnd the Furnace’s Chief Spirit overseeing the elixir’s refinement.\nThe Five Deities of Metal, Wood, Water, Fire, and Earth,\nAttend with incense, lamps, and offerings,\nDevoutly petitioning the Supreme Truth.\n\nPreparations include tongs, keys, and other tools,\nAccumulating black tiger iron pools and precious pagodas,\nAmassing them to prevent loss or damage.\n\nWithin the furnace, the wind inlet and door should be\nAs large as a chicken egg—\nDo not make it overly wide.\nIf too wide, the wind’s force weakens,\nAnd the true qi will not ascend.\n\nThe pool’s base has three supports,\nNot made of iron, but fired from magnetic soil,\nArranged in a *brand* character.\nExternally, secure it with salt clay,\nFirm and unbroken.\n\nPlace the pool in the upper chamber,\nSupported by a heavy frame,\nWith iron rings suspended high on the ceiling beams.\nEnsure the inner fire cover is secure,\nPreventing flames from nearing the cauldron.\n\nSeparately, create pathways for adding and reducing fire,\nFor adjusting the process as needed.\n\n**Secret Method of the Nine Earth Pools**\n*Copper Talisman, Iron Scrolls*\n\nTwo by two, the Pengluo Platform,\nThe Eight Treasures’ Radiant Yang Hall.\nTen Thousand Saints reverence the Central Emperor,\nThe Primordial Heavenly King manifests.\nThe King strides across the elixir’s terrace,\nCommanding the Golden Lord to refine.\nA single chant summons all true beings,\nGolden light pervades the world.\nCautiously await the Northern Homeland’s demon,\nWashing out the Celestial Garden’s dawn.\nThe effort lies with the elixir adept—\nAbandon the old, welcome the new transformation.\nSeize the *Gan’s* dazzling spirit-soul,\nDo not let dark clouds disrupt [it].\nProducing night-illuminating pearls,\nFive colors radiant in fragments.\nAbove and below, let the wind circulate,\nGolden dates, the face of an infant.\n*Xiqi’s* yin turbidity arrives,\nDeploying the *Hechē* [River Chariot] to turn.\nPurple qi enters the upper chamber,\nParent and child no longer meet.\nInitially producing longevity’s bloom,\nEasily leading to scattered spirit.\nDirectly pointing to the *Hunwen*—\nNamed *Qing’ai* [Green Dust].\n\n「The First Pool’s Lead Refinement Method: Use one *jin* of pure mountain gold, white as snowflakes, crushed into sixteen pieces.\nOn days when the sun and moon align in the same wall, when the five stars join in a single pearl, or when *Gan* and *You* (申酉) signify the gold’s vigor, place the pool and cauldron securely, open the wind gate, and introduce the *Wenwu* (文武) fires.\nWith gentle *Wen* (文) fire warming the pool, first cast in half a *jin* of lead, refining the ash into a solid treasure. Strengthen the foundation to prevent collapse or waste.\nWhen the pool turns red, use nine *hu* of purified *Fuxi* lead (伏气净铅), each *hu* divided into three portions of sixty-five *zhu* (斛/株), each *zhu* as one pool, totaling nine pools with eighty-one *jin* of lead—matching the ninety-nine revolutions of the *Zhou Tian* (周天).\nInsert each gold piece into the pool, then apply fierce *Wu* (武) fire to melt them into essence.\nWait only until the blackness fades and the essence reveals itself, appearing and disappearing in two cycles.\nThe vermilion light flickers half-illuminating the void—auspicious qi rises, floating in purple haze. Gradually add lead, letting it drip until exhausted; then replenish.\nAs celestial hosts rise and fall in constant motion, the treasure moon and golden flowers burst forth. Again, add lead by the *zhu*.\nDo not stray from the center—\nWhen *Gui* (癸) water is fully consumed, the \"sea gold\" (海金) emerges. Swiftly add lead essence, and *Ren* (壬) water ascends.\nA gentle breeze scatters the golden flowers,\nYet the excess reveals *Geng* (庚) as *You* (酉) child.\nUse three strong men to assist, taking turns in rotation.\nDiet and rest must align with the *Bamen* (八门) openings and closings.\nAdd lead into the charcoal, boiling and refining with vigor.\nLet the *Zhuhu* (朱雀) blaze the void,\nWhile the purple deity’s auspicious qi ascends—\nGolden date flowers bloom in crimson flames,\nGenerating light and essence like lightning.\nDo not add lead too hastily—\nHaste will prevent the *Jinwu* (金乌) from emerging from the sea.\nNor too slowly—\nSlowness risks harming the *Yutu* (玉兔)’s form.\nWhen water and fire intertwine sufficiently, without form or substance, the essence solidifies.\n*Ren* water, meeting gold, naturally ascends to the *Nihuan* (泥丸) apex,\nCondensing into the \"sunlight pearl\" (昱日流珠).\nAfter all lead is consumed, withdraw the fire and seal the gate.\nSecure the gold and replenish the water,\nThen add three *qian* and four *fen* of lead.\nPreserve the spirit and stabilize the form—\nDo not disturb the pool or cauldron.\nOnce cooled, remove the *Ren* water from the cauldron,\nCalled the *Qing’ai* (青埃).\nOr seal it in a gold or magnetic box,\nLest the qi escape. Leave it for later generations to blend with their *Yuanpei* (元配).\nWith bronze seals and iron scrolls,\nAnd comrades of shared intent, guard the *Ziyang* (紫阳) Palace.\nBlack becomes red as the elixir,\nRed becomes black as the *Weng* (翁).\nThe harmony of heaven and earth’s marrow—\nThis alone is the Dao of the elixir.\nAt the *Yumen* (禹门), draw three waves of water,\nLetting droplets fall into the void.\nOn the palace’s summit, pearls roll like sunlight—\nTheir hue resembles purple-gold and crimson.\nWithin the pool, jade nectar churns,\nBlown by the *Xun* (巽) wind.\nThe *Yutu* (玉兔) resides in *You* (酉),\nThe *Jinwu* (金乌) ascends to the east.\nDragon and tiger gaze from afar,\nUniting in the *Jingyang* (景阳) Palace.\nExtract the lead’s treasure,\nDo not rush the fire’s timing.\nCalcined, the golden pearls roll—\nEach pearl’s qi surges upward.\nBefore your eyes, red and yellow appear,\nSeal the *Huagai* (華蓋) tightly.\nWhen the lead’s impurities are exhausted,\nThe pool’s clarity rises, and pure essence descends.\nDirectly pointing to the *Hunwen*—\nNamed *Huangqing* (黄轻).\n\nThe Second Pool’s Lead Refinement Method follows the same principles,\nBut use a new pool and new cauldron, securing it as before.\nKeep the *Shengmu* (圣母) unshaken—\nIf there’s any loss, replenish it fully.\nIntroduce the *Wenwu* fires,\nCast in half a *jin* of water-lead.\nStrengthen the foundation.\nHalf the lead is consumed,\nAnd the *Shengmu* is within.\nApply fierce fire to melt it—\nThe golden essence becomes clear and bright,\nThe *Zhuhu* (朱雀) emerges from the southern garden.\nSwiftly add lead essence,\nDo not let the fire rage too fiercely;\nLast night’s child just parted from its mother,\nToday’s younger sibling follows the same.\nAdd lead by the *zhu* and *bu*—\nNo distinction between black tortoise and lead,\nNor between flames of varied hues;\nOn the purple-gold platform, frost condenses,\nBefore the white jade hall, the mother gazes with one eye.\n*Bingding* (丙丁) ascends in measured strides,\nLead drips into the bones.\nAfter all lead is consumed,\nThe mirror remains pristine and dust-free.\nWithdraw the fire and seal the gate.\nAdd the \"secure lead\" (安全之铅) of two *qian* and three *fen*,\nBoiled in a cold furnace overnight.\nGently tap to retrieve the pearls rolling on the cauldron’s surface,\nCalled the *Huangqing* (黄轻).\nSeal them separately, then shift to a new pool and cauldron.\n\nWith bronze seals and iron scrolls,\nThe Great Dao is without complication—\nLead and mercury are two kinds.\nLead treats mercury with kindness,\nMercury treats lead with righteousness.\nThe divine elixir is one flavor of lead,\nHolding within it the *Xiantian* (先天) qi.\nThe *Bingding* (丙丁) partners mediate,\nTransforming the *Huangpo* (黄婆) power.\nTransport relies on the *Hechē* (河车),\nMercury absorbing lead’s essence.\nIn rising and falling,\nOne follows the other.\nThe *Huagai* (華蓋) renews daily,\nPearls are called \"as one wishes\" (如意).\nYellow cranes fill the sky in flight,\nGreen heavens crackle with thunder.\n*Qianjin* (乾金) reveals purple brilliance,\nDo not let lead fall short.\nNow, open the four gates,\nSeal above the *Xuanqiao* (玄窍).\nDisturb the lead’s qi,\nAnd the golden pool must be sealed tight.\nSuch is the fire’s alchemy—\nWithout form or substance.\nDirectly pointing to the *Hunwen*—\nNamed *Jinyue* (金液).\n\nThe Third Pool’s Lead Refinement Method follows the same principles as before.\nSecure the pool with a three-legged stand,\nPlace the cauldron on top, and seal it firmly.\nThe sacred body remains unharmed—\nAny loss must be fully replenished.\nWithin the *Zhujī* (筑基) pool, ignite fierce flames.\nThree *Wen* and three *Wu* fires nurture the yellow sprout,\nLead ascends and descends in cycles—\nFlames blaze, essence does not falter;\nLead begins without form,\nGold reverses to its original state.\nFollow the prescribed measures when adding lead,\nTreating it with utmost care.\nThe green dragon retreats three times,\nThe white tiger flips its body to return to earth.\nAdd lead essence in cycles—\nStart and end as before.\nIn the western pool, the sun and moon meet,\nSeizing the pure fragrance to depart.\nDragon’s mist glows red like fire,\nTrue fire engulfs the dragon’s mist.\nAfter all lead is added,\nWithdraw the fire and halt the furnace.\nAdd the \"secure lead\" (安全之铅) of one *qian* and two *fen*.\nThe first three pools represent the eldest son’s manifestation,\n*Zhen* (震) and *Geng* (庚) receiving the talisman—\nA total of seven *qian* of secure lead, corresponding to the seven-day return of the *Tianfu* (天符).\nThe subsequent six pools will not use this method.»\n\nWithdraw the fire and let the furnace grow cold,\nExtract the *rénshuǐ* (壬水) from the crucible above—\nCalled **\"Jīnyè\" (金液)**—seal it clearly and replace with a fresh pool for further work.\n\n**Copper Talisman, Iron Scrolls**\nEastward, the Sun’s crystal emerges,\nIts radiance dazzling and bright.\nIlluminating all under heaven,\nIts dew enters the jade city’s waves.\n\nDay and night it turns east and west,\nSetting in the west, rising again in the east.\nThe Great Mother of the Sun opens and closes,\nAll things receive its luminous essence.\n\nThe marrow of Heaven and Earth—\nThe root of the Dao of Immortal Elixir.\n\nIn the *Kūn* (坤) month, as the moon wanes,\nDarkness deepens, embodying the *Tàiyīn* (太阴).\nA faint star glimmers in the southwest,\nWhile the Sun traverses the eastern land,\nThe Moon gradually moves southward.\n\nBy the seventh and eighth days, its light floats within,\nGradually filling a *hú* (斛) measure.\nHalf black, half white—\nThe white is the essence of gold.\n\nWithout the power of the *Sānjiǎo* (三足), the Moon’s brilliance would not arise.\nAt the fifteenth day, over *Jiǎdì* (甲地),\nThe elixir’s light fills the Jade Capital.\n\nDirectly pointing to *Hánwén* (函文), it is called **\"Hóngxiá\" (红霞)**.\n\nThe fourth pool’s lead and fire regimen\nFollows the same as before.\n\nDo not disturb the Sacred Embryo;\nWait for the Mother to enter the pool,\nThen ignite the Great Fire with wind.\n\nProceed with lead as before—\nNo *xùntǒng* (荀筒) may be used.\nThree days, three fusions yield True Lead—\nOnly when yin and yang are resolved does it emerge.\n\nAgain, advance the lead *yáo* (爻),\nEach step continuous.\n\nThe Golden Elixir relies on *Gēngxīn* (庚辛) power—\nWithout *Rén*, *Gēng* cannot form; without *Guǐ* (癸), it cannot separate.\n\nObserve the lead and *rénshuǐ*—\nTheir interplay refines the white gold.\nWhen metal and water unite,\nCommon sons become sacred descendants.\n\nThe Mother melts in the Hua Pool—\nEach must be distinctly observed.\nFive-colored radiance arises,\nEnveloping it in crimson mist.\n\nHour by hour, scenes gleam like gold and jade,\nDay by day, the flowers bloom anew in form.\n\nBegin only with silver and lead,\nDispersing lead and mercury,\nExhausting every *tǔzhū* (土铢),\nLeaving the furnace cold through the night.\nExtract the *rénshuǐ* from the crucible—\nCalled **\"Hóngxiá\" (红霞)**—record it, replace the pool, and refine anew.\n\n**Copper Talisman, Iron Scrolls**\nBlack lead is Heaven’s essence,\nWhite gold is Earth’s fluid.\nBlack hides within water, bearing yang;\nWhite holds fire’s qi.\n\nBlack and white alternate, returning to their proper places.\nTheir natures intertwine—\nThe *Dānjīng* (丹经) calls them kindred.\n\nBlack submits to white as master,\nYin pairs with yang as consort.\nWhen yin and yang merge in chaos,\nPetals of gold bloom emerald-green.\n\nThe Treasure Moon fills the *Dāntián* (丹田),\nBoiling fiercely in the crucible’s heat.\nDo not seal—open the Heavenly Aperture,\nLet it breathe in and out.\nIn the midst of churning—\nThe tortoise hides itself.\n\nThe secret incantation’s marvel,\nThe fire’s measure lies in its signs.\n\nNurturing the Sacred Descendant within the common—\nAll else is but this singular treasure.\n\n**A Daily Birth of Sons**\nEach day a son is born—\nEach son dwells in his own chamber.\n\n*\"Direct-Pointing Scroll\"*—named *Liújīn* (流金)\nThe fifth pool’s lead-refining fire:\nHarvesting the pool’s cauldron—\nEach step identical.\n\nThe Holy Mother enters the pool,\nWind opens the golden elixir.\nCast lead as before,\nEver add charcoal within.\n\nThe Golden Sage, refined a hundred times, grows in spirit—\nOnly true lead ascends and descends.\n\nAgain, lead beads advance,\nYellow and white merge in chaos.\nBoiling with talisman-fire, the Three Yang circulate,\nNine nines—pearls flow, the Mother-Yin departs.\n\nRecognize lead and gold—\nNeither yellow nor purple.\n\nThe sun-soul enters Chang’e’s hall,\nSeeking mid-autumn’s fragrant blossom.\nLead exhausted, *Rén* ascends—\n*Xīn* gold reveals itself.\n\nFrom the cold pool, it’s taken—\nNamed *\"Liújīn\"*—stored for another refining.\n\n**Copper Talisman, Iron Scrolls**\nOne true essence is gathered—\nThe *Dantai* Mother shifts to Yin.\n\nOne Mother bears six sons,\nThe *Fúshāng* sun now shines.\nEach pool mirrors its beginning,\nEach cauldron grows stranger and new.\n\nAscending to the Crimson Silk realm,\nEach grain of *qi* rises pure and clear.\nDo not let lead bury mercury—\nFalse claims of lingering *qi* are deceit.\n\nThe *Xùn* wind rages—\n*Liújīn* permeates the body, luminous.\nNot rigid or harsh in nature—\nFrom here, the Yellow Vehicle is born.\n\n*Guǐ* submits to *Rén* as master,\n*Rén* to *Guǐ* as guest.\nAll follows the Great Dao’s law—\n*Rén* and *Guǐ* determine floating and sinking.\nDiscard the turbid below,\nLight and pure—spirit ever refined.\nSuch floating-sinking methods—\nUnmatched in the world.\n\nFire’s suffusion is complete—\nEach grain of Heaven’s rice turns azure-green.\n\n*\"Direct-Pointing Scroll\"*—named *Rénhuā* (壬华)\nThe sixth pool’s lead-refining fire:\nWeighing and measures—\nAll follows the same great principle.\nDivide the lead by measure—\nNo need for old tricks;\nTransformation lies in human action.\nAfter refining two or three pools,\nIts marvels arise naturally.\n\nIf pearls flow sparingly, the Spirit-Fire does not rise.\nIf refining is incomplete, the numinous does not appear.\nKindle the embryo-fire,\nLet yellow clouds fill the marsh.\nYin reaches its peak—yang is born,\nUpper and lower gates open.\nFine light flashes—\nDew drips upon the Yellow Court.\nThe infant manifests—\nLight follows spirit’s birth.\nLead reaches the crown—\nOrder it to spread in all directions,\nFor proper function.\nOnly when nourishment is full\nShould one approach the furnace—\nEvil *qi* cannot enter.\n\nLead exhausted, withdraw the fire,\nTake the *Rén* water from the cauldron’s top—\nNamed *\"Rénhuā\"*—stored for another refining.\n\n**Copper Talisman, Iron Scrolls**\nThe Primordial Dao’s root,\nThe Jade-Purity’s single gate.\nBeyond this method, none are true.\nRefine the lead’s treasure within,\nExtract the silver’s essence—\nFlooded waters stall the wheel,\nNot as perilous as harming gold.\nPearls drift in ceaseless flow,\nMysterious auspicious *qi* ascends.\nChild and Mother regard each other,\nYellow and white devour in confusion.\nDazed, emotions stir—\nThreefold, ninefold cities.\nPure white reveals the treasure,\nAzure-green departs from Yin.\nWashed free of lead and mercury’s bones,\nNaturally the essence crystallizes.\nLotus blooms in murky water,\nWaves surge in endless teeming.\nBeyond true lead and mercury,\nNo heed to external sounds.\nThe Iron Scroll’s intent,\nThe Dan-Door listens closely.\n\n*\"Direct-Pointing Scroll\"*—named *Rénhuā* (壬花)\nThe seventh pool’s lead-refining fire—same as before.\nMartial fire dissolves the Holy Mother,\nAwaiting crimson light to enfold the Treasure Moon—\nThen introduce each grain of lead.\nPermeating the body, crimson jade,\nInternally and externally pure white—\nGold is born after lead,\nYang produced within lead.\nFire consumes gold,\nGold subdues wood—flourishes.\nBlue, red, black, white—\nAll return to central yellow.\nFollow their signs,\nObserve the phenomena.\nEach pool scatters purple dust,\nEach fire ignites its pattern-light.\nPiercing the *Huàgài* canopy,\nThe chamber fills with luminous dust.\nTen thousand *li* without clouds—\nHeaven in one hue.\nTwelve hours reveal the sun.\nYellow Vehicle, purple dust—\nAll arise from here.\nWhite snow, green ash—\nThose who see it prosper.\n\nOriginally, one essence of lead-precision,\nWith white gold separating Yin-earth.\nGold is water’s foundation,\nWater is the Dao’s pivot.\nOnly these two substances—\nTrue cinnabar, true mercury—\nAll from silver and lead.\nFormless yet symbolic,\nDark yet luminous.\nLead exhausted in the cold furnace,\nCollect the *Rén* water from the cauldron’s top—\nNamed *\"Rénhuā\"*—transferred to another pool.\n\n**Copper Talisman, Iron Scrolls**\n*Bùqì* breathes life’s essence,\nContaining light before Heaven and Earth.\nIts root sprouts from the floating soil,\nIts sprout grows in the Great Red Sky.\nEight treasures stem from this,\nOnly the luminous lead is black.\nNow knowing Heaven and Earth’s secret—\nRefining this is fertile ground.\nSix Yin forge the Holy Body,\nGnarled bones return to the Yellow Springs.\nThe method points with mind to mind,\nMechanisms researched in detail.\nWithout true transmission,\nAll effort is in vain.\nFutilely advancing Heaven’s fire,\nHow could the fragile endure?\nHard and soft have exterior and interior,\nYin and Yang follow Nature’s decree.\nWithin the cauldron—Heaven in Earth,\nIn the pool—Earth beneath Heaven.\nPure white on the Jade Terrace,\nSubstance as clean as silk.\nThe Mother cradles seven or eight sons,\nSpirit ever more refined than before.\nThe Perfected One receives the transmission—\nA worthy cause, a destined fate.\nIf you know to exchange bones,\nNánchāng leaves you to your leisure.\n\n*\"Direct-Pointing Scroll\"*—named *Zǐjīnliú* (紫金硫)\nThe eighth pool’s fire and cauldron—\nBoth renewed.\nNine *liǎng* of lead, eight *liǎng* of foundation,\nRefined as before.\nNow the technique is pure—\nKnowing ascent and descent,\nExcess and deficiency, each in measure.\nIf pearls flow sparingly, seek the Dry Father,\n*Xīn* gold’s loss is supplemented.\nGold flowers are the pool’s medicine—\nHarvesting *Jīnhuā* requires no more words.\nOne method divides lead’s *Rén* and *Guǐ*,\nOne method washes gold’s turbid Yin.\nEach time lead is the medicine,\nExtracting medicine is extracting lead.\nUnderstanding lead’s purpose—\nThe elixir’s spirit is not lead.\nLike sun and moon exchanging light,\nSteal only its spirit,\nNot its form.\nUsing spirit, discarding form—\nThus attaining longevity.\n\nLead exhausted, take the *Rén* water from the cauldron’s top—\nNamed *\"Zǐjīnliú\"*—refined in another pool.\n\nFrom black, extract black’s marrow;\nFrom white, take white’s oil.\nBlack and white merge as one—\nOil and marrow thicken naturally.\n\nInfant enters the Purple Palace,\nFair maiden descends the Heavy Tower.\nCoal sears the Central Yellow Treasure,\nRefining *Zǐjīnliú* to perfection.\n\nDeploy the Long Serpent Array below,\nRiding the phoenix through azure expanse.\nAt the Jade Pool’s first bath—\nUnfulfilled, nurture three cycles.\n\nSeize the Southern Vermilion Bird,\nTrue earth buries it as a mound.\nFire’s measure follows One and Two,\nMethods echo prior seeking.\n\nThree *Rén* and one *Guǐ*—one *liǎng* each,\nNine *Yáng* suffice to gather.\nEighty-one times nine—\nInsufficient to match prior extraction.\n\nPlundering the Nine-Six count,\nWest Mountain ghosts weep in sorrow.\nReversed and upright—logic inverted,\nTail becomes head, head becomes tail.\n\nDirectly pointing to *Hánwén*—\nCalled *Miàolíngshā*.\n**Ninth Pool’s Fire and Method:**\nRefining lead is the same.\n\nEntering the Holy Mother’s dissolution,\nRed light envelops the Treasure Moon—\nThen introduce the lead crucible.\nMercury overstepped—\nDivine secret of immortals.\n\nSummoning dragon essence,\nRelying on tiger marrow.\nNo lead form used—\nOnly lead *qi*.\n\nHow to obtain lead *qi*?\nFirst seek its kindred.\nKindred is gold—\nGray Pool’s intent.\n\nLayered firecraft,\nExternally encasing the cauldron.\nPearls yield gold’s portion—\nNot like worldly lead.\n\nFire reveals its difference,\nGold reveals its stillness.\nFrom One to Nine—\nCalled refining complete—\nThe work of refining essence into *qi*.\n\nOne Pool to Nine Pool—\nEach *Rén* water sealed apart.\nHoly waters stored abundantly,\nFor later use.\n\nSo-called \"obtaining medicine, forgetting age,\"\nRefining lead without measure—\nThis is the living method.\n\nCold furnace opened—\nMother’s body white as snowflakes—\nThen it’s good, named *\"Miàolíngshā\"*.\nIf green-yellow,\nNot true lead *qi*—\n*Guǐ* water yet exhausted.\nMust fiercely boil and calcine,\nWaves surging, billowing—\nOnly then does true *qi* reside.\n\nLater: methods for nurturing *Chìwén*,\nReturning soul, transforming bone.\n\n---\n**Human Element’s Nine-Crucible Secrets**\n\n**First Crucible**\nHuman Element’s first elixir,\nNine nines pass the lead barrier.\nReusing *Qīngdū*’s essence,\nReturned and restored again.\n*Xīnjīn* like snow,\n*Rén* water turns to smoke.\nChild and Mother balanced—\nFive fives nurture celestial hue.\nThunder’s three cycles of fire,\nDividing embryo above and below.\nAvoid worldly distractions,\nSteadfast resolve, firm heart.\n\nOne *Yáng* first revives the sun—\nGod and soul entwined in thread.\nGiven: lead talisman scroll,\nLead and mercury linger.\n\n**Method:**\nNine refinements of *Xīnjīn* (one *jīn*), crushed to rice grains.\nTake first Pool’s *Qīng’āi* (one *jīn*).\nMix the two.\nSeal in *Yīnyáng* crucible with divine glue,\nBind with iron wire in cross,\nWrap externally with clay,\nPlace in *Bùjié* furnace—\nThree legs stable, upright,\nNo tilting or inversion.\nSurround top and bottom with clean ash.\nAdd four *liǎng* of top fire for seven days,\nSix *liǎng* for the next seven,\nHalf a *jīn* for the final seven,\nNurture twenty-five days.\n\nRemove to bright furnace—\nFirst gentle, then fierce—\nCalcine sixty-six times (thirty-six hours),\nCrucible fire uniform,\nCool fully by day.\nOpen the crucible—\nTransformed into red mist,\nAbove forming substance,\nLike red jade, purple powder.\n*Xīnjīn* below forms a cake—\nWhite exterior, yellow interior.\n\nRefine further—\nOne month per crucible,\nAncestral *qi* initially transmitted,\nBarely parted from the Mother.\nGod-*qi* chaotic,\nSoul and spirit unstable—\nUnfit for alchemical activation.\nSeek another nurse,\nWill transcending.\n\nAs an elite divine talisman,\nWith power to revive the dead.\n\n---\n**Second Crucible**\nHuman Element’s second elixir,\nRadiant beyond *Yǔmén* Pass.\nReusing *Xīyí*’s place,\nFalling at night, returning at dawn.\nDay-soul seen in mist,\nMoon-shadow fills autumn sky.\nBrothers balanced—\nFive fives complete *Chìwén*.\n\nThirty-six hours of fire,\nDividing One, Two, Three.\nFirst child—empty, bone-like;\nSecond child—will firm.\nTwo *Yáng* revive—\nOpens like a rooster’s egg yolk.\n\nGiven: copper talisman scroll,\nSilver-lead crucible, tongs.\n\n**Method:**\nPrior elixir gold (one *jīn*)—\nNow not diminished, do not disturb the embryo.\nTake first crucible’s *Qīnggōng*,\nMix with second Pool’s pearls—\nTwo *jīn* total, blend evenly.\nLayer above and below the embryo,\nSecure and stabilize.\nFire as before, nurture fully by day.\nFierce fire separates the embryo—\nHeaven, Earth, Human: Three Powers aligned.\n\nFirst child—*Qīnggōng* like ash,\nEmpty—no *qi*.\nSecond child—water-crystal yellow sprout,\nGradually rising, free of worldly dross—\nCalled true lead.\nUse this as the longevity vessel—\nThree *qián* of *Qīnggōng*,\nOne *liǎng* of *Fúguāngshā*,\nAdd three days of *Bǐng* fire.\n*Qi* exhausted, form yellow—\nTake one *qián* of *shā*,\nOne *liǎng* of dry *gōng*.\nWith one *qián* of *gōng*, forge ten *liǎng* of copper.\nSuch divine transformations boundless—\nThis is the ancestral foundation.\n\n---\n**Third Crucible**\nHuman Element’s third elixir,\nSoars beyond *Dòuniú* Pass.\nReusing *Hùndùn*’s place,\nDragging the White Ox back.\nGolden goose flees its cave,\nVermilion phoenix nests in the *Dāntián*.\nRaw and ripe balanced—\nAncestors rise from *Huángquán*.\nSixty-six hours of fire—\nRiver flows, murmuring.\nOne and Two—jade-like,\nTwo long—strength unyielding.\nThree *Yáng* revive—\nOpens as green *zhǐlián* lotus.\n\nCopper talisman, iron scroll’s intent—\n*Wútóng*’s phoenix and *luán*.\n**Method:**\nPrior elixir gold (one *jīn*),\nMix with second Pool’s pearls and third Pool’s gold liquid—\nTwo *jīn* total, blend evenly.\nLayer above and below the Holy Mother,\nSecure as before.\nGentle fire nurtures,\nChild and Mother steamed.\nFierce fire calcines,\nReturning soul, transforming bone.\nDay complete, whole cycle—\nRetain the young, discard the old,\nSecond child unused.\n\n**Sixth Method (of *Rényuán* Elixir):**\nTo obtain the death of cinnabar (*zhūshā*),\nFirst, the black lead (*hēiqiān*) must die.\nLead essence, one pure substance—\nCinnabar inverted, mercury flows.\n\nTake two *qiān* of the two,\nSubdue the male with one *liǎng*.\nThree days of sufficient fire—\nThe male truly dies.\n\nOne *qiān* of dead male,\nOne *liǎng* of dry mercury.\nOne *qiān* of dead mercury transforms ten *liǎng* of iron—\nEternal treasure, saving the world and aiding the perilous,\nBoundless blessings, cycle upon cycle, nurturing life.\nCycle upon cycle, life upon life.\n\n**Fourth Method (of *Rényuán* Elixir):**\nFour *dǒng* (*Rényuán* Elixir of the Four Cauldrons),\nNinety-nine times the hook and wither (*gōu wěi*) pass.\nUsing the intent of the green dust (*yì qīng āi*),\nVermilion bird (*zhūquè*) advances to the Western River.\nPurple Palace (*zǐfǔ*) and Flowered Pool (*huápí*) lengthen,\nYellow sprouts fill the Jade Field (*yùtián*).\nBalanced entry and retreat—\nWarmly nurturing the infant’s face.\n\nBone vast, spirit robust,\nConfronting frost and cold with solemnity.\nFather young, son old—\nHeaven’s Dao/Way naturally cycles.\n\nAfter the Four *Yáng* revive—\nMidway, yellow and white jade.\n**Method:**\nPrior elixir gold (one *jīn*),\nSpirit gradually lengthens,\nDiffering from before, each cauldron distinct.\nMix the Four Cauldrons’ *Rén* water (*rénshuǐ*) with Five Pools’ flowing gold (*liújīn*),\nLayering old and young.\nFire nurtures the Prior Elixir gold—\nThe method of separating the fetus (*fēntāi*),\nAs before.\nWhen the day is complete, open and take,\nWithdraw the Four Cauldrons’ clamorous dust (*xiāo chén*).\nThree *qiān* subdue the female yellow (*qí huáng*) with one *liǎng*,\nOpening *qi* to die.\nTake one *qiān* of the dead female,\nTransforming one *liǎng* of lead into silver.\nDissolve the silver,\nThen add seven *fēn* of refined female yellow (*líng qí*),\nForming superior gold of the upper color (*shàng sè*).\nWith this gold, construct the divine chamber (*shénshì*),\nNurturing eight *dàn* (*shí*), each with transformations.\n\n**Fifth Method (of *Rényuán* Elixir):**\nFive *dǒng* (*Rényuán* Elixir of the Five Cauldrons),\nEach cycle as before.\nAbandoning the divine chamber’s place (*shénfáng*),\nClouds and mists fill the mountains and rivers.\nWater tiger (*shuǐhǔ*) does not look back,\nFire dragon (*huǒlóng*) struggles to emerge from the spring.\nBalanced, step-by-step entry—\nVirtue/power (*dé*) nurtures the vast and boundless (*hàorán*).\nMercury lengthens, red as cinnabar (*hónglì*),\nLead withers, its face no longer fresh.\nThe method of extracting lead and adding mercury,\nFather and son do not pass on.\nAfter the Five *Yáng* revive—\nMoon’s shadow fills the Southern Garden.\n**Method:**\nPrior elixir gold (one *jīn*),\nSpirit gradually lengthens,\nDiffering from before, each cauldron distinct.\nMix the Five Pools’ flowing gold (*liújīn*) with Six Cauldrons’ *Rén* essence (*rénhuá*),\nLayering old and young.\nFire nurtures the Prior Elixir gold—\nThe method of separating the fetus (*fēntāi*),\nAs before.\nWhen the day is complete, open and take,\nWithdraw the Five Cauldrons’ clamorous dust (*xiāo chén*).\nThree *qiān* subdue the male yellow (*yánghuáng*) with one *liǎng*,\nOpening *qi* to die.\nTake one *qiān* of the dead male,\nTransforming one *liǎng* of mercury into iron.\nCautiously, again cautiously—\n**Method:**\nPrior elixir gold (one *jīn*),\nSpirit gradually lengthens,\nDiffering from before, each cauldron distinct.\nMix the Four Cauldrons’ *Rén* water (*rénshuǐ*) with Five Pools’ flowing gold (*liújīn*),\nLayering old and young.\nFire nurtures the Prior Elixir gold—\nThe method of separating the fetus (*fēntāi*),\nAs before.\nWhen the day is complete, open and take,\nWithdraw the Four Cauldrons’ clamorous dust (*xiāo chén*).\nThree *qiān* subdue the female yellow (*qí huáng*) with one *liǎng*,\nOpening *qi* to die.\n\n**Sixth Method (of *Rényuán* Elixir):**\nSix *dǒng* (*Rényuán* Elixir of the Six Cauldrons),\nThe hook and wither (*guān guò*) pass again.\nSprinkled in the Hall of Light (*Míngtáng*),\nPearls return to their child.\nMercury, eight hundred years old,\nStill requires half a *jīn* of lead.\nBalanced entry and retreat—\nGolden rooster (*jīnwū*) surges from the Great Abyss (*dàyuān*).\nDo not rush the *yin* talisman (*fú*),\nThe *yang* fire blazes forth.\nShortened fierce fire, lengthened gentle fire—\nRadiance fills the Great Thousand (*dàqiān*).\nAfter the Six *Yáng* revive—\nFragrant breath, sweet and refined.\n**Method:**\nPrior elixir gold (one *jīn*),\nMove into a new cauldron.\nMix the Five Cauldrons’ flowing gold (*liújīn*) with Six Pools’ *Rén* essence (*rénhuá*),\nThree *jīn* total, blend in one place.\nFire nurtures as before—\nThe method of separating the fetus (*fēntāi*), identical in all respects.\nDuring the fierce fire phase,\nExtreme caution is required,\nLest the divine *qi* be harmed and flee—\nThen all prior efforts are ruined.\nIf the cauldron is sturdy and sealed with utmost care,\nThen the *yang* light naturally enters the golden vessel.\nTrue father, true mother,\nUnited in body, transmitting spirit—\nMust use the talisman’s fire to restore and return to origin.\nGold generates water essence (*shuǐyè*),\nCycle upon cycle, blending.\nWhen the day is complete, take it down,\nExtract the celestial soul (*tiān hún*).\nSubdue arsenic (*dǎn fán*) like a cat seizing a mouse,\nTransforming iron and tin (*tiě xī*) like wind sweeping clouds.\nThe body of the Prior Elixir gold and silver is eternal—\nEven more, when exposed to fire, red light ascends,\nIn darkness, like dawn’s radiance, clear and bright,\nNot like worldly treasures.\n**Method:**\nPrior elixir gold (one *jīn*),\nMove into a new cauldron.\nMix the Five Cauldrons’ flowing gold (*liújīn*) with Six Pools’ *Rén* essence (*rénhuá*),\nThree *jīn* total, blend in one place.\nFire nurtures as before—\nThe method of separating the fetus (*fēntāi*), identical in all respects.\nDuring the fierce fire phase,\nExtreme caution is required,\nLest the divine *qi* be harmed and flee—\nThen all prior efforts are ruined.\nIf the cauldron is sturdy and sealed with utmost care,\nThen the *yang* light naturally enters the golden vessel.\nTrue father, true mother,\nUnited in body, transmitting spirit—\nMust use the talisman’s fire to restore and return to origin.\nGold generates water essence (*shuǐyè*),\nCycle upon cycle, blending.\nWhen the day is complete, take it down,\nExtract the celestial soul (*tiān hún*).\nSubdue arsenic (*dǎn fán*) like a cat seizing a mouse,\nTransforming iron and tin (*tiě xī*) like wind sweeping clouds.\n\n**Seventh Method (of *Rényuán* Elixir):**\nSeven *dǒng* (*Rényuán* Elixir),\nGolden rooster (*jīnwū*) enters Broad Cold (*Guǎnghàn*).\nThe *Tàijí* revolves in cycles,\nSealing and binding ever stricter.\n*Qián* generates *Xùn* and *Gèn*, *Kūn*;\n*Kūn* generates *Zhèn* and *Duì*, *Qián*.\nDivine fire enters balanced—\nAdjustments must be thorough.\nHibiscus (*fúróng*) begins to bear fruit,\nGrain upon grain in the golden dish.\nPiercing the mirror of human and heavenly realms (*rén tiān jìng*),\nEclipsing the moon, devouring the sun’s liver (*tài yáng gān*).\nAfter the Seven *Yáng* revive—\nMysterious, mysterious, mysterious again.\n**Method:**\nPrior elixir gold (one *jīn*),\nMix the Six Cauldrons’ *Rén* essence (*rénhuá*) with Seven Pools’ *Rén* flowers (*rénhuā*),\nBlend in one place, enter the cauldron, and seal.\nFire nurtures as before.\nWithdraw the Six children,\nSubdue realgar (*pí xiāng*), opening *qi* to die—\nThus, the eight *dàn* return to truth (*guī zhēn*), each with transformations.\nLead essence subdues mercury essence,\nGold and silver form in an instant.\n**Secret it!**\n**Caution it!**\n\n---\n\n**Eight Cauldrons**\nThe *Rén* essence of the Eight Cauldrons elixir,\nFloating bright as the moon at its fullest.\nAn aged pearl-shell cradles the pearl,\nA luminous mirror, a crystal dish.\nClouds withdraw beyond the celestial void,\nThe infant reveals the Great Thousand.\nJade-like adjustments enter smoothly—\nForty-nine days of refining and transformation.\nThe formless is true mercury,\nThe true form is true lead.\nTwo substances, one *jīn* in weight,\nAt noon, when the sun stands high.\nAfter the Eight *Yáng* revive—\nRed fruits, green branches overturned.\nThus, the true method is applied,\nLeaping beyond the ocean’s vast expanse.\n**Method:**\nOne *jīn* of prior elixir gold—already formed as the *gēng* body—\nTake the Eight Cauldrons’ wulong sulfur (*wúlóng wúlóng liú*),\nThe Nine Pools’ wondrous mercury essence (*língmiào shā*),\nTogether three *jīn*, blended as one.\nNurture with fire—its method and timing as before, no need to repeat each detail.\nThe embryo’s marvel and the *gui*’s mystery are beyond words,\nPouring, drenching, nurturing—\nGolden bamboo shoots and yellow sprouts all emerge from this refining.\nThree transformations yield gold and iron,\nRubble naturally becomes treasure.\n\nThe Nine *Yáng* complete the sacred embryo,\nThe elixir mother attains full truth.\nWhen the *yīn* is exhausted and the *yáng* pure,\nThe embryo is cast off, divine transformation.\nWithin and without, all is pure gold—\nPiercing clarity like water-crystal,\nResembling the sun at its first rising,\nGolden stars radiant, divine waters vast,\nDazzling the eyes, five-colored clouds arise,\nFragrant breezes waft through the nostrils.\nRed *liúlí* and crimson amber—\nFrom seven returns and nine renewals,\nRefining *qi* to divine essence.\nBlack gold refines to white gold,\nWhite gold becomes yellow gold,\nYellow gold as the master medicine.\nTrue mercury of this world,\nUsed as the progenitor for ascending elixirs.\nIf one wishes to ingest it,\nSuspend it in a well for seven days,\nTo dissipate its fire-toxicity,\nThen cook it into golden chestnuts,\nAnd announce to the Highest Emperor of Heaven and Earth,\nChoosing a day to bathe in purity,\nFacing east at dawn and dusk.\nServe it with clear water,\nOne grain per day—\nIn a hundred days, form and bones are renewed,\nNaturally harmonizing with divine *qi* and spirit,\nSoul and vital essence unified.\nAfter three cycles,\nAll nine orifices of the body shine with light.\nBy this stage of elixir cultivation,\nAll matters are complete.\n\nOne cycle to nine cycles—\nNinety-nine, eighty-one *cíhé* (magnetic boxes) seal it tight,\nOutside with *rén* essence fluid pearls,\nLayered above and below.\nThe *yīn* furnace nurtures it,\nRevealing its three colors and four forms of divine medicines.\nPools differ distinctly,\nCauldrons radiate brilliance.\nSeek again a worthy companion,\nChoose a sacred mountain,\nBuild a hall of rites,\nAnd cast the divine chamber.\nUpper and lower double crucibles,\nThe Hall of Illumination and the Virtue of the Pure,\nAll planted within the secret range of the divine elixir.\nIn the Eastern Jin, Emperor Wu practiced the Way of Properness (*Dàozhèngxíng*),\nAnd thus the *Qīnmǔ* (elixir mother) emerged,\nThe True Lord bestowed it upon *Wú Měng*,\nWho passed it to *Xiè Qiān* and *Shèng*,\nNow riding the jade palanquin and dragon chariot,\nWearing the golden crown and celestial garments,\nForever as a subject of the Golden Gate.\n\nThe divine formula remains in the world,\nTransmitted to the worthy and bestowed upon the virtuous,\nNot to be carelessly revealed or leaked.\nThe gods and immortals toiled through countless hardships,\nOnly to refine lead and gold in the end.\n\n---\n\nThe **Heavenly Primordial Secret Formula**\n\nThe divine elixir, the great medicine,\nMust be sought in gold and earth.\n\nBright dust passes through the chinks,\nAll drawing from the *Lí* talisman.\n\nEighty-one *Qián* talismans,\nSeventy-two *Kūn* strategies.\n\nEight measures of water to eight measures of gold,\nHow could they be deficient?\n\nHalf pure, half turbid,\nClouds and mists naturally unite.\n\nA single drop of gold yields clarity,\nA single talisman of fire brings brilliance,\nThe oral formula must be precise,\nAnd the technique flawless in execution.\n\nLean upon the balance of the Tiger,\nAnd submit to the standard of the Nine Dragons.\n\nThus embodying the *Qián* and *Kūn* forms,\nThus displaying the radiance of the Sun and Moon.\n\nThe *Xīyí* and *Hébì* [1] manifest,\nAnd all phenomena appear in attendance.\n\nRefinement follows strict measures,\nEvery grain must adhere to the law.\n\nPrepare the ritual implements within the hall,\nAnd first arrange the basin and crucible to left and right.\n\nA true friend attends with devotion,\nLoyal, upright, gentle, and kind.\n\nBefore constructing the divine chamber, return to the golden crucible,\nAnd first visit worthy companions to lay the sacred foundation.\n\nThe Dragon and Tiger bow in reverence,\nThe Tortoise and Serpent lie in wait.\n\nFollowing the mysterious techniques,\nThere is never a single failure.\n\nMaintain unwavering sincerity,\nAnd remain steadfast without deviation.\n\nWhy need the Celestial Golden Crow descend?\nWhy not seize the Jade Hare from mortal realms?\n\nRefine the floating *Lí* [2] into true earth,\nAnd produce the wish-fulfilling gem.\n\nSwallow one grain to ascend the heavens in radiance.\nBefore attaining the boundless virtue of the *Yīn* [3],\nAt the moment of refining, no need for concern.\n\nI shall now reveal my threefold method,\nWith no word concealed—bestow it upon you.\n\nNurture the Dao’s root from early days,\nAnd it will naturally manifest in time.\n\nDo not speak lightly of heavenly secrets,\nNor let the unworthy mock its form.\n\n**Water and Fire Principles**\nThe elixir’s fire must be the **Five Convergences’ True Fire** [4].\nNot common flame.\n\nTrue fire relies on the sun’s essence;\nThe Yellow Emperor took fire with the *Yángyǐng* mirror [5],\nWhile the *Yīnyǐng* mirror is hard to obtain,\nAnd red gold can also draw fire from sunlight.\n\nIn essence, the sun is heaven’s true fire,\nIts vitality self-sustaining, its radiance self-revealing.\nEach day is so, each month likewise—\nIf fire is taken by chiseling wood or stone,\nIts nature is harsh and violent,\nNot in accord with nature’s intent.\n\nBetter to wait until noon, when fire is at its peak,\nAnd use a fire mirror to draw it from the sun.\n\nBorrowing the sun’s fire is also called **True Fire**,\nHence the term **\"Sun-Soul\"** (*Rìhún*)* [6],\nTo symbolize true mercury (*Zhēnggǒng*)* [7],\nAnd as the true seed,\nSufficient for the elixir’s divine purpose—\nWhy cling rigidly to the *Yángyǐng* mirror?\n\nWater must be drawn from the **Square Pearl** (*Fāngzhū*)* [8].\nThe Square Pearl is the moon’s luminous essence ascending,\nCondensing into shape within water—pure *Yīn*.\n\nOn the fifteenth night of the eighth month,\nBetween the hours of *Hài* and *Zǐ* [9],\nWhen the moon’s brilliance is at its height, take it.\n\nBeyond the Mid-Autumn Festival,\nNo other month suffices.\n\nIf virtue and conduct are incomplete,\nAnd *Yīn* deeds are insufficient,\nOr one has not yet practiced sincerity toward heaven,\nThen many cloudy, rainy days will arise—\nWhere will the water come from?\n\nEven if true water is obtained,\nA single night’s harvest—\nHow much could it yield?\n\nTo cultivate the void, there is no divine medicine—\nFire lies below, water is diminished.\nEach day and night,\nRefill and adjust, using ten *jīn* of water,\nA year requires over two thousand five hundred *jīn*.\n\nYet Mid-Autumn yields only two hours—\nHow could it suffice for two thousand five hundred *jīn*?\n\nWithout this water,\nThe pairing of Sun-Soul and Moon-Soul is incomplete,\nAnd heaven’s water and fire are misaligned.\nIf common water is used,\nIt is not the true seed—\nThe student is at a dead end.\nWould that not be a mistake?\n\nNow I open the door of convenience,\nAnd reveal the path to heavenly ascent.\n\nWater indeed is the moon’s *Yīn* essence,\nHeaven’s **One Primordial’s Divine Water** (*Tiānyīshénshuǐ*)* [10],\nFlowing and condensing from the **Divine Dragon** (*Shénlóng*)* [11].\n\nEach year, in the pure *Yáng* month of the fourth,\nWhen the Divine Dragon transforms,\nIts water holds power.\n\nWhen heavy rains fall, collect them in magnetic vessels,\nCover tightly, lest dust fall—\nThus securing the year’s supply.\n\nThere is no month without rain at all,\nThis too is the adept’s wondrous adaptability—\nWhy cling rigidly to the Square Pearl?\n\n**Earthly Veins Principles**\nTo refine the elixir, choose a sacred mountain,\nA blessed land of towering peaks and encircling winds;\nSit facing south, toward noon,\nSo the Golden Crow and Jade Hare\nRise in the east and set in the west,\nTurning left and right in their cycles.\n\nLakes and marshes must be pristine,\nBamboo and trees must be pure and strange.\nDragons coil in layers beside the hall,\nTigers’ wings stack in tiers within the divine chamber;\nThe **Black Tortoise** (*Xuánwǔ*)* [12] hides behind the screen,\nThe **Vermilion Bird** (*Zhūquè*)* [13] strides in orderly ranks.\n\nAvoid the passage of dust and vulgarity,\nSever ties with ordinary friends;\nCultivate the realm of the **Island of Immortality** (*Qióngdǎo*)* [14],\nAnd shun the filth of mortal remains.\n\nObserve the celestial waters above,\nAnd examine the earthly veins below.\n\nThe sun’s marvelous beasts cry out at dawn,\nWhile strange creatures pass at their appointed hours.\nHidden scriptures and veiled histories,\nMushrooms spring from guests’ abandoned robes—\nOnly then may the **Alchemical Hall** (*Dāngōng*) be established.\n\nNaturally, **Dao Saints** (*Xiānshèng*) descend,\nEarthly deities gather in reverence,\nNo end to blessings, endless joy in rebirth.\nThe **Hall’s alignment** (*Gōngshì zhíyì*) is true and just—\n\nWhen the **Tripod** (*Dǐng*) follows the medicine’s placement,\nAnd the chamber conforms to the Tripod’s design:\nOne room, one Tripod,\nThree Tripods, three chambers.\nRise sixteen feet, span fourteen feet wide.\n\nLeave the four corners empty,\nDouble galleries stretch in procession.\nNot the grandeur of **Cloud-Harvesting Towers** (*Qíyún Zháixīng*) or **Carved Beams and Painted Pillars** (*Diāoliáng Huàdòng*),\nYet windows face all four directions—\nSome sealed, some open.\n\nPierce the roof to **venture the qi** (*Cǎo tóng qì*),\nInvite auspicious blessings to summon fortune.\nThe ground lies flat as a palm,\nNo incline, no depression.\nCracks or blockages—\nDo not permit foulness to enter.\n\nThe number of Tripod chambers,\nMeasure and act accordingly.\nFor each Tripod’s labor,\nAll must harmonize—\n**Heaven, Earth, Sun, Moon, the Three Talents** (*Sāncái*), **Four Seasons**,\n**Five Phases** (*Wǔxíng*), **Seven Celestial Officials** (*Qīzhèng*), **Eight Trigrams** (*Bāguà*), **Nine Palaces** (*Jiǔgōng*), **Ten Stems** (*Shí gān*),\n**Twelve Branches** (*Shí'èr zhī*), **Twenty-Four Qi** (*Èrshísì qì*), **Seventy-Two Phenomena** (*Qīshí'èr hòu*), **Twenty-Eight Constellations** (*Èrshíbā xiù*),\nAll **manifestations** (*Wànxiàng*) born in creation.\n\nThe **Trigram** (*Guà*) faces south, an entrance opened.\nThe **kitchen** (*Pú*) and **bathing chamber** (*Yùshì*).\n\n「Slightly distant, another structure is built.\nFirmly uphold the **威严** (*wēiyán*—majesty and solemnity), as if facing a sovereign saint.\nThe **坛台** (*tántái*—altar platform) must be upright and just.\n\nFor the **旺方** (auspicious direction), select the finest yellow soil,\nSteam-refine and compact it into solidity.\nThen employ the **塑工** (modeling artisans) to ensure its firmness and durability.\nWait until it is thoroughly dry before proceeding, without haste.\n\nThe altar is divided into three tiers, corresponding to the **Three Talaments** (*Sāncái*—Heaven, Earth, and Man).\nThe lower tier rises **one foot two inches** (12 inches), with **Eight Gates** (*Bāmén*—eight openings),\neach gate **eight inches** high and **three inches** wide,\neach fashioned as a **土门** (*tǔmén*—earthly gate) for opening and closing,\nand each equipped with a pathway.\n\nPierce the center of the platform, leaving a hollow core **five inches** in diameter,\nalso divided into eight angles, inscribed with the **Eight Trigrams** (*Bāguà*—乾, 坤, 震, 巽, 坎, 离, 艮, 巽).\nWater is the **first**, fire the **second**, wood the **third**, metal the **fourth**, earth the **fifth**.\n\nThe middle tier rises **one foot three inches** (13 inches),\nwith a central hollow of **five inches**,\nits shape circular, aligning with the **Heaven’s Round** (*Tiānyuán*—天圆) principle,\nand a perimeter of **one foot six inches** (16 inches),\na horizontal diameter of **five feet three inches** (53 inches),\ndepicting the **Twenty-Eight Constellations** (*Èrshíbā xiù*—二十八宿),\nas well as the **Seventy-Two Phenomena** (*Qīshí'èr hòu*—七十二候) of the **Four Seasons**.\n\nPlace the **太乙神** (*Tàiyě Shén*—Grand Unity Spirit) upon the platform.\nThe furnace stands **one foot six inches** (16 inches) tall,\nwith walls and base each **six inches** thick.\nWithin, the **明堂** (*Míngtáng*—Luminous Hall) has a horizontal diameter of **seven inches** (7 inches),\nand a height of **four inches** (4 inches),\nits body continuous with its base, rising **two feet** (24 inches).\nFrom the base to the top, a **five-inch** (5 inches) hollow aligns with the platform’s core.\n\nConstruct an earthen partition within the furnace,\nleaving space for fire in the center,\nwith a base **three inches** thick and a diameter of **six inches** (6 inches).\nThe furnace must be **half exposed, half concealed**,\nwhile the platform above bears the **Four Symbols** (*Sìxiàng*—青龙, 白虎, 朱雀, 玄武),\nand the **Twelve Monthly Guards** (*Shí'èr yuè jiāng*—十二月将) are arranged below.\n\nOn the eaves’ east and west sides,\npaint the **Sun and Moon** (*Rìyuè*—日月),\nemblematic of the **金鸟玉兔** (*Jīnniǎo Yùtù*—Golden Bird and Jade Hare).\n\nThe **神炉** (*Shénlú*—Divine Furnace) must be crafted on days when:\nthe **Yellow Dao** (*Huángdào*—黄道) and **Heavenly Virtue** (*Tiāndé*—天德)\nalign with the **Monthly Virtue** (*Yuèdé*—月德),\nand the **auspicious hour** (*shàngjī*—上吉) is chosen.\nFrom the **旺方**, take **pure yellow, true-colored soil** (*zhēnghuáng zhèngsè tǔ*—正色之土),\nwash it to the finest particles,\nsteam and bake it until pliable,\nthen pound with paper-fiber pestles to mold it thoroughly.\n\nAdd **white 蟮土** (*báichángtǔ*—white serpentine soil), fine sand, and **代赭磁石** (*dàizi chíshí*—red ochre and lodestone),\ntaken at the **Four Harmonizing Hours** (*Sìhuà*—四化) and **auspicious constellational timing** (*hòu jí shí*—吉时),\nthen shape it while still damp, ensuring it sets dry.\nAfterward, fire-refine it and seal it atop the platform.\n\nThe **鼎器** (*Dǐngqì*—Cauldron Vessel) must be upright and just.\nThe cauldron’s body is **one foot two inches** (12 inches) tall,\nuniformly **one inch one fen** (1.1 inches) thick,\ndivided into three levels.\nFrom its rim to its base, it also follows three tiers.\nThe **内明堂** (*Nèi Míngtáng*—Inner Luminous Hall) has a horizontal diameter of **one inch six fen** (1.6 inches),\nwhile the rim’s diameter is **seven inches** (7 inches),\nand beneath, the **鳌足** (*Áozú*—Tortoise Feet) rise **three fen** (0.3 inches).\n\nOne method uses clay soil, but fearing it may not suffice,\ncast it instead from **nine-nine refined iron** (*jiǔjiǔ liànjìng rèn*—九九炼净熟铁),\nensuring no leaks or uncleaned pores.\nChoose a **Five Star Conjunction Day** (*Wǔxīng liánzhū rì*—五星联珠日)\nor a **Day of Solar-Lunar Unity** (*Rìyuè hébì rì*—日月合璧日) for casting.\nPrepare many to allow for replacement, avoiding hasty or careless work.\nUpon completion, announce to the **师真** (*Shīzhēn*—Master of the Dao),\nand place the cauldron within the furnace for **one year**.\n\nA single cauldron must not be reused.\nThe **坎鼎** (*Kǎn Dǐng*—Water Cauldron) is set inside the **离鼎** (*Lí Dǐng*—Fire Cauldron),\nwith water stored **eight inches four fen** (8.4 inches) high.\nThe vessel is **one foot five inches** (15 inches) in circumference,\n**five inches** (5 inches) in diameter,\nwith a rim **one inch two fen** (1.2 inches) thick,\nand its belly to navel **one inch two fen** (1.2 inches) deep,\ncrafted from **赤金** (*Chìjīn*—pure gold).\n\nThe **坎离二鼎** (*Kǎnlí Èr Dǐng*—Water and Fire Cauldrons)\nmust interlock securely,\ntheir **拔支** (*Bázhī*—protruding shafts) finely crafted.\nEnsure absolute stability and seamless alignment,\nthen apply **thoroughly dried fine clay** (*jīngrèn xì ní*—极熟细泥).\nEmploy the **塑工** once more.\nConstruct with utmost precision, avoiding any negligence.\nAfter drying and purging the **浊汁** (*zhuózhī*—impurities),\ncast with **金汁** (*Jīnzhī*—golden liquid).\n\nThe **坦郭** (*Tǎn Guō*—Flat Enclosure) must be upright and just.\nThe **垣郭** (*Yuánguō*—surrounding walls) secure the cauldron,\nusing soil gathered from the **Five Directions** (*Wǔfāng*—五方),\nrefined by water-filtration (*fēiguò*—飞过),\nand kneaded with *lù* paste into solid blocks.\nPound and refine until firm and mature,\nits form resembling a **锅釜** (*guōfǔ*—cauldron or pot).\nIts height is **nine inches** (9 inches),\nits thickness **nine fen** (0.9 inches).\nThe **离鼎** (*Lí Dǐng*—Fire Cauldron) is **one inch nine fen** (1.9 inches) wide,\nits mouth slightly open and rounded.\nGather soil on **土日** (*Tǔrì*—Earth Day),\nand cast it on **火日** (*Huǒrì*—Fire Day).\nBelow, model **eight pillars** (*Bāzhù*—八柱),\nensuring their absolute firmness.\nAnother name for this is **丹龟** (*Dānguī—Cinnabar Tortoise*),\nits **坎离之气** (*Kǎnlí zhīqì*—Water and Fire Qi)\nconverging within its layers.\n\nThe **神室** (*Shénshì*—Divine Chamber) must be upright and just.\nRefining the **Great Elixir** (*Dàyào*—大药) relies entirely on the **奇器** (*Qíqì*—wondrous vessels) of this chamber.\nEven a slight deviation in measurement\nposes great difficulty in alchemical transformation.\nFirst, construct the **电式** (*Diànshì*—Lightning Mold),\nmodeling it with thoroughly dried fine clay,\nthen use its precision to gauge the cauldron’s proportions—\nheight, thickness, width, and circularity.\n\nFollow the **Great Dao** (*Dàdào*—大道),\nemploying **玄水** (*Xuánshuǐ*—Mysterious Water) as prescribed,\nand refine it over a long duration.\nBeside it, leave a **穴** (*xué*—cavity),\nensuring the **固济** (*Gùjì*—stable alchemical process) is properly set.\nBurn with fire until a **清汁** (*qīngzhī*—pure liquid) forms,\nthen pierce with an iron rod to drain it into the mold.\nCast two vessels separately, ensuring they fit perfectly together.\n**乾 above, 坤 below**,\nforming **中黄** (*Zhōnghuáng*—Central Yellow),\ntransforming **阴阳** (*Yīnyáng*—Yin and Yang) principles.\nLeave a **one-inch** (1 inch) hollow in the center,\nwhere **灵汞** (*Línggǒng*—Spiritual Mercury) generates—\nwhen formed, it becomes the **玄牝** (*Xuánpìn*—Mysterious Female),\nand when united, it becomes the **太极** (*Tàijí*—Supreme Pole).\n\nCraft the **铸室** (*Zhùshì*—Casting Chamber) during **金旺** (*Jīnwàng*—Metal Auspicious) days and months.\nOn the **third month’s 庚日** (*Gēngrì*—Geng Day),\nprepare and cast the lower mold.\nUse only the **九池九鼎** (*Jiǔchí Jiǔdǐng*—Nine Pools and Nine Cauldrons),\nand cast the **金母** (*Jīnmǔ*—Metal Mother).\nRefine **one catty of pure gold** (*jìngjīn yījīn*—净金一斤),\nuntil the casting yields only **fifteen taels** (*shíyǒu*—十五两).\n\nAfter casting, the **真气** (*Zhēngqì*—True Qi) leaks severely,\nand if the cauldron is immediately placed in the furnace,\nthe **金精** (*Jīnjīng*—Gold Essence) may solidify too soon,\nwhile the **玉液** (*Yùyè*—Jade Fluid) develops tardily,\nrendering transformation impossible—\nall prior labor would be wasted in vain.\nInstead, use **壬水** (*Rénshuǐ*—Ren Water) gathered beforehand,\nfilling the cauldron internally and externally,\nand nurturing its Qi abundantly.\nThen place it in the **磁鼎** (*Cídǐng*—Magnetic Cauldron) to solidify,\nusing **平火** (*Pínghuǒ*—gentle flame) to temper and nourish for **one hundred days**.\nEach month, replace the water **three times** (*sānjiēqì*—三接气),\nuntil the spirit is fully complete and the essence firmly established.\n\nAfter one hundred days,\nuse **六一泥** (*Liùyīní*—Six-to-One Clay),\n**石膏** (*Shígāo*—gypsum),\n**枯樊** (*Kūfán*—dried mulberry bark) calcined,\n**代赭黄** (*Dàizi huáng*—red ochre yellow),\n**丹赤** (*Dānchì*—cinnabar red),\n**石脂** (*Shízhī*—mineral pitch),\nand **重罗灰粉** (*Chóngluó huīfěn*—double-sifted ash powder)\nto seal the mouth’s fissures,\nbinding it with **十字扎** (*Shízì zhā*—cross-woven silver threads).\n\nExternally, use **圣金** (*Shèngjīn*—Sacred Gold) and **圣银** (*Shèngyín*—Sacred Silver)\nto craft a protective **包胎** (*Bāotāi*—outer casing),\nwrapping it layer upon layer,\nensuring no deviation.\nThe **雌雄子口** (*Cíxióng zǐkǒu*—female and male orifices)\nmust align perfectly,\nits form resembling a **鸡子** (*Jīzǐ*—chicken egg)—\n**outerly round, inwardly square**.\n\nThus, it can receive the **精灵** (*Jīnglíng*—Essential Spirits) of Heaven and Earth,\nand the **育养** (*Yùyǎng*—nourishment) of Water and Fire.\nThe mold is crafted from **圆转** (*Yuánzhuǎn*—circularly turned clay),\ncast on **土日** (*Tǔrì*—Earth Day),\nits height **four inches** (4 inches),\nall measurements taken with the **周尺** (*Zhōuchǐ*—standardized ruler).\n\n**符镜直义**\nEight mirrors hang in the cardinal directions, each twelve *chi* in diameter.\nLeaning against the house’s cauldron-altar, four swords are suspended at the corners—\nthe mirrors and swords forged at their rising and setting.\n\nAt the third watch of the *Yǐhài* hour, each attends to their duties in advance.\nMaintain solemn stillness, as though facing deities.\n\nWrap them in pure yellow silk, placing them before the Sacred True Position,\nreciting morning and evening salutations.\n\nWhen the Earthly Branch *Tǔ* aligns with the Heavenly Stem *Líng* and the Emperor’s day of power,\nat the first stir of *Yīnyáng* (one *yang*’s birth),\ninstall them in the Elixir Chamber.\nTo the cauldron’s left and right, erect the Five Sacred Peaks.\n\nFirst, refine the five colored soils, molding the Five Peaks’ forms and spirits until dry.\nFlatten the King’s Cauldron’s base like a mountain, sealing its seams,\nthen daily offer sacrifices.\n\nWhen the Water and Fire circulate, each fulfills its role.\n\n---\n\n**陈设直义**\nConstruct the Elixir Hall, build the altar platform, erect the cauldron, and install the furnace,\nchoosing auspicious earth and timing.\n\nHang the Three Celestial Treasures (mirrors) to dispel malevolent forces.\nInsert swords at the four corners to subdue spirits.\n\nThe *Treasure Mirrors* are mirrors:\n- *Heaven’s Mirror* cast on *Jiāzǐ* days (the first *yang* of the *liúliú* cycle),\n  forged when *Yellow Dao* aligns with metal and stone—\n  the *Mingtáng* (Bright Hall) is then cast at the hour of great perfection.\n- *Earth’s Mirror* cast on *Rénzǐ* days, at the midpoint of the solar term.\n- *Human Mirror* cast on *Bǐngzǐ* days, at the solar term’s exact center.\nEach exceeds twenty-four *cùn* in diameter.\n\nSwords are forged on *Shuāngjiàng* (Frost’s Descent) days,\nwith ancient blades being most auspicious.\n\nFour talismanic slips, cast when *Tàiyǐ* descends to the palace or on metal-stone days.\nThe four-directional talismanic seals and five-colored banners follow strict patterns—\nthe banners match the Five Directions’ hues, each two *zhàng* long,\ntightened beneath the mirrors and atop the layered roofs.\n\nThe Twelve Celestial Stems’ talismans, iron-strip talismans, four-wall talismans,\nthe Three Platforms’ seals, the Eight Trigrams’ array,\nLaozi’s Blockade-Talisman, the Twenty-Eight Constellations’ symbols,\nand the Four Symbols (Metal Rooster, Jade Hare)—\nall these talismans appear in the scriptures and histories.\n\nWithin each palace, enshrine:\n- The Elixir Master, *Zhōutiān Mièhuà Zhēnrén* (True Person of Heaven’s Transcendent Transformation),\n- *Jiǔyáng Wēidé Jìshēng Dùsǐ Zhēnrén* (True Person of the Nine Suns’ Virtue, Saving Life and Death),\n- The *Day Palace’s* Taiyang Fire Virtue Star Lord,\n- The *Moon Palace’s* Dayuan Water Virtue Star Lord,\n- *Tàiyǐ Zhǔzǎi Gāoshàng Dìshī Yuánjūn* (Highest Imperial Teacher, Sovereign of the Supreme Dao),\n- The Twelve Celestial Stems’ Native Star Lords,\n- *Zhèngyī Lónghǔ Xuántán Zhào Tiānjun* (Heavenly Lord Zhao of the Orthodox Dragon-Tiger Mystic Platform),\n- The Swift Messengers of the Celestial Hosts,\n- The Transmitting Masters of Scripture and Teaching across generations,\n- The Elixir Hall’s Attendants, and the Local Land and City Deities.\n\nFacing the cauldron, at each of the twelve hours,\nrotate the incense trays; never extinguish the lamps.\n\nPlace the Fire Tray in the northeast corner, forged in copper,\nweighed precisely to determine its measure.\nUse seasoned charcoal for the fire to avoid explosions.\n\nPlace the Water Tray in the southwest corner, with eight ladles for adding water.\nA *looking basin* holds used water; a *filling basin* holds reserved water.\n\nWithin each palace, employ two assistants to manage water, fire, and the copper hourglass,\nadding and drawing water according to the *Bāmén* (Eight Doors) evasive method and *Sānqí* (Three Odds).\n\nWhen *Jiānshí* (Heavenly Birds) begins, cast the *Yīnyáng Èrduàn* (Two Evasions).\nIf *Jiǔtiān* (Nine Heavens) aligns with the *Zhen* trigram, hang an eastern talisman\nand suspend one mirror on the east, with a thread dangling beneath it.\nIf *Jiǔtiān* aligns with the *Xùn* trigram, hang a southeast talisman\nand suspend one mirror in the southeast corner.\nThe remaining six directions follow similarly.\n\nThe central yellow talisman is hung when *Tiāndé* (Heaven’s Virtue) aligns with *Yuèdé* (Lunar Virtue)\nat the first moment of the *Zǐ* hour, suspended from the roof’s center.\n\nThe four-directional talismans are installed on *Sìqī* (Four-Sevens) days,\nwhile also offering prayers to the Primordial Lord and swearing oaths before the Celestial Messengers.\n\n---\n\n**洁净直义**\nBefore refining the Great Elixir, curb lust, abstain from killing,\npractice benevolence, observe fasts and purifications,\ncleansing body and mind.\n\nOnly then ascend the platform, arrange the Patriarchal deities’ positions,\noffer incense and lamps, and pray earnestly for divine aid.\n\nAwait the month of *Yīnyáng Lái Fù* (Return of One *Yang*) and its birth hour,\nthen proceed according to ritual.\n\nAvoid monks, nuns, women, chickens, and dogs—impurities that invite divine wrath\nand hinder elixir success.\n\nEach day, the true disciples perform rites, assessing merit and fault.\nSecure doors and windows; use the copper hourglass for timing.\nOne oversees finances and meals; another manages water and the Great Furnace.\nAttendants chant incense and report; others tread the *Gāng* (Hexagram) and arrange the *Dǒu* (Cauldron).\n\nReward diligence, punish laziness—neither movement nor stillness is careless.\nWith harmonious *qi*, proceed unhurried.\n\nAvoid cutting hair or breaking teeth; swear blood oaths at the *Léijiāng* (Thunder Official’s) desk,\nvowing to refine the transcendent cinnabar together,\nand attain the Immortal’s Free Assembly.\n\nOn completion, ascend to the Jade Empyrean.\n\n---\n\n**卦象直义**\nHeaven and Earth transform through *Yīnyáng*.\n*Yáng* transforms, *Yīn* unites—rooted in *Qián* and *Kǔn*.\n\n*Qián* uses nine; *Kǔn* uses six—each with six lines.\n*Qián*’s six nines yield fifty-four strategies;\n*Kǔn*’s six sixes yield thirty-six strategies.\nDoubled across the four seasons, they total:\n*Qián*’s two hundred sixteen, *Kǔn*’s one hundred forty-four—\nthree hundred sixty, marking the solar cycle.\n\nThe Sage condensed years into months, months into days, days into hours,\ndividing each hour into two *qì* (energetic phases) of the twenty-four *jì*,\nor six *hòu* (phenological stages) of the seventy-two *hòu*.\nFrom *Zǐ* to *Sì*: winter solstice to summer solstice;\nfrom *Wǔ* to *Hài*: summer solstice to winter solstice.\n\nRefining the Great Elixir across the twelve hours,\nadvancing and retreating *Yánghuǒ* (Yang-Fire) and *Yīnfú* (Yin-Talismans),\nexhaling cold and warm breaths.\n\nChanneling into the Central Palace’s Divine Chamber,\nmutual generation and transformation produce True Essence.\n\nEach day and night, two talismanic hexagrams align—\nseven hundred twenty hexagrams in a year,\nfour thousand three hundred twenty lines total,\ncorresponding to four thousand three hundred twenty years of cosmic *qì*.\nThus, within each hour, the talismanic fire advances and retreats,\nseizing the pristine *qì* of four thousand three hundred twenty years\nand returning it to the Divine Cauldron.\n\nThe fundamental count of the talismanic fire aligns with the four hexagrams of **乾 (Qián, Heaven)**, **坤 (Kūn, Earth)**, **坎 (Kǎn, Abyss)**, and **离 (Lí, Flame)** as its core, while the remaining sixty hexagrams serve as its application. The lines total **三百六十 (sānbǎiliù, three hundred sixty)**, each line representing one star, each star corresponding to one *铢 (zhū, grain)*. At the hour of **子 (Zǐ)**, the Yang-Fire advances **三十六铢 (sānlìzhū, thirty-six grains)**, with **二十四铢 (èrshísìzhū, twenty-four grains)** constituting one *两 (liǎng, ounce)*, and the remaining **十二铢 (shí'èrzhū, twelve grains)** as half an ounce. Thus, in the hour of **子**, one attains **Yang-Fire** of one and a half *两*, the first six hours belonging to Yang. Its total count reaches nine, and so the Yang-Fire advances nine *两* in sequence, amounting to **二百一十六体 (èrbǎiyīshíliù tǐ, two hundred sixteen lines)**.\n\nThe remaining **少阳 (Shàoyáng, Lesser Yang)** and **少阴 (Shàoyīn, Lesser Yin)** counts, spanning five days, do not fall under the standard reckoning. The Yin-Talismans, from **午 (Wǔ)** to **亥 (Hài)**, all belong to Yin, their lines also diminishing to **一百四十四铢 (yībǎisìshízhū, one hundred forty-four grains)**, totaling six. Six marks the strategy of **老阴 (Lǎoyīn, Elder Yin)**.\n\nAt **午 (Wǔ)**, the Yin-Talismans retreat **二十四爻 (èrshísìyáo, twenty-four lines)**, each line as one *铢 (zhū, grain)*, twenty-four grains making one *两 (liǎng, ounce)*. Thus, in the six Yin-hours, one attains fire of six *两*, totaling **一百四十四铢 (yībǎisìshízhū, one hundred forty-four grains)**. The first six Yang-hours yield nine, the latter six Yin-hours yield six—the interplay of **Yang-nine and Yang-six** is thus complete.\n\nIn sum, **三百六十支 (sānbǎiliùzhī, three hundred sixty branches)** coalesce into the **神室 (Shénshì, Divine Chamber)**’s one *斤 (jīn, catty)* in essence and application. Now, nine and six total **十五两 (shíwǔliǎng, fifteen ounces)**, while **乾 (Qián, Heaven)** and **坤 (Kūn, Earth)** serve as the **鼎器 (Dǐngqì, Cauldron Vessels)**, and **坎 (Kǎn, Abyss)** and **离 (Lí, Flame)** as the **药物 (Yàowù, Medicinal Substances)**. The **二十四爻 (èrshísìyáo, twenty-four lines)** correspond to one *两 (liǎng, ounce)*.\n\nFor those who follow in refining the Great Elixir, adhering to the Master’s intent: fire is the parent of the elixir, the elixir the offspring of fire. Passed down from mouth to mouth, from heart to heart, one must focus solely on fire.\n\n**逊 (Xùn)** said: *\"The Divine Chamber holds one catty, and the fire’s count also equals one catty—neither may be neglected. Now the fire is only fifteen ounces, what then is its purpose?\"*\n\n**元君 (Yuánjūn, Primordial Lord)** replied: *\"The advancement and retreat of talismanic fire within the Cauldron follow the waxing and waning of the lunar light in the heavens. Thus, a day has twelve hours, a year has twelve months, each hour mirroring a month. The first seven and a half days are spring, the latter seven and a half are summer—the breath of generation; the middle seven and a half days are autumn, the last seven and a half are winter—the breath of destruction. Hence, fire is limited to fifteen ounces, aligning with the exact count of the moon’s full radiance. If one adds an ounce, the Elder Yin oversteps its domain, invading the Yin-lands and causing the soul to perish—fire is transmitted, but not the elixir.\"*\n\nThe true mechanism of talismanic fire lies within the interplay of nine and six. In the hour of **子**, the fire is at its peak—contemplate its intent. Ritual purity is the direct path.\n\nNow, the method of refining the elixir suffices for a year, yet only **十月 (shíyuè, the tenth month)** yields the completed elixir—why so? It is because in the **二八 (èr-bā, second and eighth)** months, each has its own pause and respite.\n\nThe **二月 (èr yuè, second month)**, ruled by the **兔 (tù, Hare)**, sees Yang-*qi* flourishing while Yin-*qi* first emerges—at the time when **榆荚 (yújiá, elm seeds)** begin to fall, one restrains the **卯木 (mǎo mù, Wood of the Hare)** fire and augments the **水 (shuǐ, Water)** to ensure safety. The **八月 (bā yuè, eighth month)**, ruled by the **鸡 (jī, Rooster)**, sees Yin-*qi* flourishing while Yang-*qi* first emerges—at the time when **荠麦 (jìmài, bittercress and millet)** gradually sprout, one restrains the **酉金 (yǒu jīn, Metal of the Rooster)** water and enhances the **火 (huǒ, Fire)** to secure stability.\n\nIn refining the Great Elixir, one must rely on fire, and the standard of hexagram lines determines its exact count. Otherwise, the days of its proper measure will be lost.\n\nThe fire, though advancing by fifteen *liang* at a time, only after a hundred days penetrates the core of the golden cauldron. Subtle yet taking form, it gestates the golden elixir.\n\nAfter refining one cauldron externally for over a hundred days, open it to observe the golden elixir—whether like a lamp’s blossom or cloud formations, with the five *xiàng* (symbols) fully manifest, announcing to the Supreme Emperor and High Immortals. Take and ingest one *jiǔ* (ninth), and after a hundred days of gathering essence and accumulating *qi*, prolonging life and extending years.\n\nStill, nurture it warmly until the full cycle of the Microcosmic Orbit is complete. When ten months of work are fulfilled, without substance generating substance, forming the *Tāi* (Great Harmony) rice and mysterious pearl, only then is it the true elixir.\n\nOne cauldron of refined *línggǒng* (spirit-mercury), when ingested, will forever solidify the form.\n\nAll friends should redouble their diligence in cultivation, until the three-year spirit-elixir, the nine-year white snow, the twelve divine talismans, when rubble turns to gold and withered bones become flesh—form and spirit both perfected, all virtues complete. Flowers bloom, fruit ripens, and one wanders in delight through the Supreme Clarity.\n\nYou should treasure these three volumes of sacred scripture, for their words are exhaustive and their meaning complete. I now return to the Jade Capital.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "铜符铁卷 总诀 三元神丹口诀 玉清有命封仙职，掌握南曹主化一。 赤文幽隐彭仪房，玄科至禁蓝天碧。 八万四千一劫传，传出天符火记历。 庚甲之年杂气消，诸天庆会万余室。 稽首恭默大道前，万圣千真总湛寂。 琼台遐想玉清客，颦眉不展忧心匿。 良久开扬九六门，驾鹤斜闻龟仰觅。 大道流行满上天，尔曹仙子乐无边。 龙汉延康三劫尽，玄宫大展令敷宜。 东华升举西华主，太乙元君谌母传。 亲受皇人二八机，至玄至妙至幽微。 可令尘环流玉液，早将仙子赴瑶池。 珠台降下铜符卷，敕下元君谌母知。 弘道真人弘道仙，阐扬正教汞和铅。 铅飞雪浪流珠滚，覆下依然真土眠。 土禀天符生碧叶，朵朵金花起紫烟。 紫烟飞上凌霄殿，连连续续水花片。 日月抛光朗大千，巽风吹起金花现。 不得流珠不计铅，生灵聚景防危战。 日魂将迁月神圆，赫赫日魂霞九万。 四方笼罩合真铅，铅含五彩何人见。 炼铅无计觅真传，不得庚金华不坝。 采得辛金一味真，再入灰池取次炼。 上下浮沉颠倒间，壬花莫令乌云乱。 抽出天魂霞夺日，水晶宫里是吾家。 返得流金回圣体，何劳磋跎遍天涯。 汞死为铅铅化土，白金鼎器丹之祖。 怀尽天魂地魄中，玄元称此为丹母。 汞积九九返成砂，龙出东方西就虎。 晋世明王孝道存，金筋玉骨许之孙。 咒将敕水降魔魁，明功暗德济苍生。 可将铁卷天王旨，铜符细细口传君。 玉清愿见功勋士，光眉大展笑颜欣。 巨阙弥封碧玉匣，明珠照世破幽城。 速令名山拿玉兔，灿日擒归再莫论。 日魂消尽千山雪，奚虑区区遍体阴。 但烹黍米扶神气，看看天时偏五陵。 恶龙喷出三江水，毒气零零满世尘。 若不敕汝扶厄难，骨城血海痛伤心。 急以鼎池炉里炼，巧夺乾坤日月精。 道法千门及万户，千门万户独斯尊。 十二神符九白雪，三回五转号天青。 一粒一服三期后，周身九窍自光明。 白雪入口身生羽，神符吞下足生云。 渐觉三阳开泰日，浮生腐草尽逢春。 功高行备膺天禄，拨宅升腾及满门。 早朝上帝抛金玺玉诏天书五岳迎。 闲观碧落空歌韶，时传空青始气森。 一自五云腾腾日，天香满室古今闻。 九六天机亲嘱付，珍藏室秘莫为轻。 至人授受吴王李，非之雷火即时临。 金丹递运玄无始，五气分张一气成。 不比燕呼三一法，不是回头口内津。 不是闺丹御女术，不是砒黄丹矿成。 铅是元神银是形，形神相得合为真。 元神相遇真形后，果用元神观太清。 宝塔诀 古法九层，虚极药所不至，今减而用之。 或七层五层，每屋高六寸，下安蓬壶，雌雄子口，层层俱有妙窍，以便龙虎气升，安合固济。 坐于池上，外用铁环高挂于天梁上，令其安稳，方架内火。 火近蓬壶，腰下以铁架架起，经围火力，庶使次火难侵于宝塔，朱雀易得安身。 进铅门上用半寸，高连壶脚下。 三方安三足，厚方如指节，今火势有力。 上古传受，用风箱伏火，后人遂开风门，用处在人活法，不必—一构旧。 阴阳为之道，变通为之法，风一开一闭，不使疾风吹惊池鼎，恒令人巡视恐有不虞之患，美作寻常为之，虽曰百日之功劳，乃是升天之基址。 烧取真铅诀 一初取出山铅砂数百斤，捣为末。 就用矿上圳土，每一斤，配食盐四两，捣万杵。 秤定铅砂末一斤以纸包裹数层，外用盐泥固之五六分厚，晒令极干。",
      "translated_text": "**\"The Copper Talisman and Iron Scroll: Master Formula of the Three Primordial Elixirs**\n\nWhen the Jade Purity bestows the decree of immortal office,\nIt governs the Southern Cauldron, mastering the transformation of all things.\nThe crimson script is profound and hidden in Pengyi’s chamber,\nThe dark arts are most forbidden beneath the azure sky’s verdant expanse.\n\nEight myriads, four thousand—one kalpa’s legacy—\nPassed down through celestial talismans, inscribed by the Fire Record’s chronicle.\nIn the year of *Gēng-Jiǎ* (庚甲), chaotic *qi* dissolves,\nAs myriad heavenly assemblies rejoice in their grand celestial halls.\n\nProstrating in reverence before the Great Dao,\nTen thousand sages and true ones abide in profound stillness.\nGazing afar upon the Crystal Terrace, guests of Jade Purity,\nThe brows remain unfurrowed, yet the heart is heavy with concealed sorrow.\n\nAfter long deliberation, the Nine-Six Gates are raised,\nAnd the crane’s flight is heard as it seeks the turtle’s upward gaze.\nThe Great Dao spreads, filling the heavens above,\nYour ranks of immortals rejoice without bound.\n\nWhen the Three Kalpas of the Dragon and Han dynasties conclude,\nThe Mystic Palace unfolds its vast and auspicious domain.\nThe Eastern and Western Hua ascend in turn,\nThe Grand Sovereign of the Great Unity, *Zhēn Mǔ* (谌母), is transmitted.\n\nReceiving the august decree of the Second Eight,\nMost profound, most wondrous, most subtle and hidden.\nIt can make the dusty world flow with jade nectar,\nAnd swiftly summon the immortal to the Celestial Pool.\n\nThe Pearl Terrace descends the Copper Talisman and Iron Scroll,\nImperially bestowed to *Zhēn Mǔ* (谌母) for her knowledge.\nThe Great Dao’s True Person expounds the Dao’s immortal secrets,\nInterpreting the orthodox teachings: mercury and lead in harmony.\n\nLead ascends like snow-waves, pearls roll in flight,\nYet when lowered, it rests as true earth in slumber.\nEarth, in response to the talisman’s decree, bears emerald leaves,\nEach blossom a golden flower, rising in purple mist.\n\nThe purple mist ascends to the Lingxiao Hall,\nContinuously linked, like scattered petals of water.\nThe sun and moon cast their radiant light upon the Great Thousand,\nThe *Xùn* (巽) wind blows, revealing golden flowers.\n\nWithout the rolling pearls, one cannot measure the lead,\nAs living beings gather their essence to ward off perilous battles.\nThe solar spirit is about to depart, the lunar deity is full,\nResplendent solar spirits, nine myriads in glory.\n\nThe four quarters are enveloped by the True Lead’s fusion,\nLead containing five colors—who could ever perceive?\nRefining lead without measuring the True Transmission,\nOne cannot find *Gēng Jīn Huà* (庚金华) without obstruction.\n\nHarvesting the True Lead of *Xīn Jīn* (辛金), a single essence,\nThen returning to the Ash Pool for further purification.\nAscending and descending in tumultuous flux,\nDo not let the *Rén Huā* (壬花) be disordered by black clouds.\n\nExtracting the celestial spirit, seizing the solar mist,\nWithin the Water Crystal Palace—there lies my true abode.\nRetrieving the rolling gold to restore the sacred form,\nWhy toil endlessly across the vast expanse of the world?\n\nMercury dies, becoming lead, which then transforms into earth,\nThe white gold vessel—the ancestor of the elixir’s foundation.\nExhausting the celestial spirit and terrestrial essence,\nThe Primordial Origin calls this the *Dān Mǔ* (丹母).\n\nMercury accumulates ninety-nine times, returning as sand,\nThe Dragon emerges from the east, the Tiger from the west.\nIn the Jin dynasty, the enlightened king preserved filial virtue,\nHis golden sinews and jade bones granted to his descendants.\n\nThe incantation commands the water to subdue the demonic leader,\nHis manifest and covert virtues benefit all under heaven.\nTake the Iron Scroll’s decree of the Heavenly King,\nAnd the Copper Talisman’s subtle secrets, passed orally to you.\n\nThe Jade Purity wishes to see the virtuous and meritorious,\nHis broad brows unfurl, his face bright with joy.\nThe Great Obstruction is sealed within a jade casket,\nA radiant pearl shatters the world, revealing its hidden citadel.\n\nSwiftly seize the famous mountain’s jade hare,\nDazzling the sun, capturing it—no further debate.\nWhen the solar spirit is exhausted, the thousand mountains turn white,\nWhy fret over trifles when the body is already shadowed?\n\nSimply boil millet to nourish the spirit-*qi*,\nObserving the celestial timing, leaning toward the Five Tombs.\n\nThe malevolent dragon spews forth the Three Rivers’ waters,\nIts venomous *qi* scatters, staining the world’s dust.\nIf you do not command it to aid in calamity,\nThe skeletal city and blood sea will grieve your heart.\n\nHasten to refine it in the Cauldron Pool’s furnace,\nCrafting the sun and moon’s essence with cunning.\nDao methods number in the thousands and ten thousands,\nYet among them, this one alone is supreme.\n\nTwelve celestial talismans, nine white snows,\nThree cycles and five revolutions—named Heavenly Blue.\nOne grain, one dose, three periods later,\nThe body’s nine orifices shine with radiant clarity.\n\nWhite snow enters the mouth, the body sprouts feathers,\nThe talisman is swallowed, the feet generate clouds.\nGradually, the Three Yangs open, heralding auspicious days,\nThe transient life, like rotting grass, meets the spring’s rebirth.\n\nWhen virtue is high and practice complete, one receives celestial rewards,\nAscending the ancestral hall, filling the home with transcendence.\nAttending the early court of the Supreme Sovereign,\nHe casts down golden seals, jade decrees, and celestial scriptures—\nThe Five Peaks welcome him.\n\nLeisurely observing the Verdant Realm’s empty hymns,\nThe *Sháo* (韶) music resounds, yet the *qi* remains dense.\nSince the day the Five Clouds ascended in glory,\nThe fragrance of heaven has filled the chamber—\nA scent known through ancient and modern times.\n\nThe Nine-Six celestial secrets are entrusted to me,\nTreasure them in hidden chambers, do not hold them lightly.\nThe Perfect Ones imparted it to King Wu of the Chu (吴王李),\nYet when rejected, the thunder-fire descended immediately.\n\nThe Golden Elixir is transmitted from the Mystic Origin,\nThe Five *qi* disperse, yet one essence remains.\nIt is not the Three-One method of the swallow’s call,\nNor the saliva from turning one’s head inward.\nIt is not the *Guī Dān* (闺丹) art of consorting with women,\nNor the cinnabar elixir forged from arsenic ore.\n\nLead is the Primordial Spirit, silver is its form,\nWhen form and spirit unite, they become the True One.\nWhen the Primordial Spirit meets the True Form,\nThen observe the Primordial Spirit in the Great Purity.\n\n**The Precious Pagoda Formula**\nAncient method of nine tiers—\nThe void’s utmost, where medicines cannot reach—\nNow reduced for practical use.\nOr seven tiers, or five,\nEach chamber six inches high,\nBeneath placed the *Péng Hú* (蓬壶) vase,\nWith male and female *zǐkǒu* (子口) openings,\nEach tier possessing subtle orifices,\nTo facilitate the ascent of Dragon and Tiger *qi*,\nAnd ensure their stable union.\n\nSitting above the pool,\nAn iron ring is suspended from the ceiling beam,\nSecured firmly,\nThen the internal fire is ignited.\nWhen the fire nears the *Péng Hú* (蓬壶),\nA waist-high iron frame is raised,\nEnveloping the fire’s force,\nSo that the secondary fire does not intrude upon the Precious Pagoda,\nAnd the *Zhūquè* (朱雀) easily finds its place.\n\nThe lead is inserted at the upper gate, half an inch thick,\nIts height extending to the base of the vessel.\nThree sides are fortified with three supports,\nEach as thick as a finger joint,\nNow the fire’s power is strong.\n\nIn antiquity, it was transmitted to use a bellows to subdue the flame,\nLater generations opened the wind gates,\nFor the sake of human convenience,\nNot necessarily adhering to the old ways.\n\nYin and Yang are its Dao,\nAdaptability is its method,\nOpening and closing the wind,\nNot allowing fierce gusts to disturb the cauldron’s pool,\nConstantly ordering attendants to patrol,\nLest any unforeseen disaster occur—\nYet even in ordinary practice,\nThough it takes a hundred days of labor,\nIt is the foundation for ascending to heaven.\n\n**The Formula for Extracting True Lead**\nFirst, extract mountain lead sand—several hundred pounds—\nAnd pound it into powder.\nThen take the mineral’s upper layer of clay soil,\nFor every pound of lead,\nAdd four ounces of salt,\nPound it ten thousand times.\nWeigh out one pound of lead powder,\nWrap it in paper in multiple layers,\nSeal it externally with salt clay,\nFive or six divisions thick,\nAnd dry it thoroughly under the sun.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1257,
      "start_sentence": 0,
      "end_sentence": 71,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 23.640488862991333,
      "metadata": {
        "source_file": "dao\\藏外\\铜符铁卷.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "如此三五百枚，入炉煅之。 炉式形如大甑，高六七尺，周围一丈，下安风箱，底火上升。 用炭铺底一尺厚，方铺铅砂球在炭上，层炭层球。 大火煅得内外通红，止火寒炉，阴土覆上。 铅在下成一块，破球取出如生矿银状，如此，谓之乾父。 将此乾父取流金，则药有精神，非是流铅圳土，否则神散杳茫。 不得师授，苟或妄为，终为误事。 神丹至药，只是一味铅精，若得此宝，万事毕矣。 此为先天真一之水，多倍其数，以听圣灰筑基之用。 采取土水一分真，不换黄金重一斤。 至此，神机又听后续大法。 古羲黄修炼神丹大法 地元起手，金鼎神室。 上下两弦，体重一斤。 如九鼎七鼎，五鼎、三鼎，心依大法度数采用。 假如白金八两，用伏气黑铅三十六斤。 只有八九七十二两，按九池而取之。 恐铅气不足。 神精降少，难合天地符契，半斤八两之数。 今用九两炼一两，泄气之用。 先求地魄，地魄者，白金也。 次取天魂，天魂者，黄金也。 黄金产珠砂。 是日精。 白金生流珠，是月华。 魂魄合体，精华自生一。 夺天地日月之全功，是圣祖玄元之妙用。 圣人知神物隐于北方，来此以作丹头。 不用世上黄金，黄金虽纯阳之体，纵加百炼，决不受气。 至于铜锡，性质大燥，难见金公，见则形必伤也。 独与白金，一味相亲，畅体欣然。 金花发泄流珠，珍珠豁然其间。 真阴真阳，交光合体。 巧取周天度数，满于五色中黄，自然阳生于真土也，土旺金乡。 借水虎育养而生震龙，五色霞鳞，金膏碧体，朗朗常存，为升天药祖，愈炼愈灵，越温越妙。 故有阴池阳鼎。 因铅不受炼，设为法象，以定浮沉之性。 造鼎为阳，使阳魂自升于天堂之上。 制池为阴，使阴魄自沉于地狱之中。 一九功在铅，二九功在母。 诸方不用母，丹门甘自苦，壬癸怎分强。 老脆化阴土，用铅有秘传。 始初金炼铅，浮沉定得真。 先天与后天，认得其中趣，无拘洞里仙。 婴儿寻乳母，转转出玄关。 药即是真汞，金丹是神丹。 一母生九子，各自传枝叶。 德薄不足以遇，缘浅不足以闻。 此是杳冥真诀，子宜记在胸襟。 安炉立鼎诀 上供九天五土司命、北斗七天真君、丹房炉嘱正神。 金木水火土五德星君，侍供香火灯烛果品，虔告上真。 预造钳匙等器，余积黑虎铁池宝塔，多备以防损换。 炉内合风开门如鸡子大，勿令大宽。 宽则风力缓，缓则真气不升。 池下三方，安三足，不用铁造，以磁土烧就，安如品字。 外以盐泥固之，坚牢不损。 安池在上方，架重楼，两边以铁环高挂于天梁之上。 内火盖固，不令火力近鼎。 别开出入火路，以便加减行持。 地元九池秘诀 铜符铁卷 两两彭罗台，八宝昭阳殿。 万圣拱中尊，元始天王现。 王如啸丹墀，方使金公炼。 一唱众真场，世界金光遍。 谨候北丰魔，洗出朝天苑。 用力在丹人，弃旧迎新换。 乾金夺目魂，莫令乌云乱。 产出夜明珠，五色辉煌片。 上下令通风，金枣婴儿面。 希夷阴浊来，放展河车转。 紫气入重楼，子母不相见。 初产寿年华，易到精神散。 直指函文名曰青埃",
      "translated_text": "Thus, three to five hundred [pellets],\nInsert into the furnace and calcine them.\n\nThe furnace’s form resembles a large steamer,\nSix to seven feet in height, a circumference of ten feet,\nWith bellows installed below, flames ascending from the hearth.\nSpread a foot of charcoal at the base,\nThen layer lead-sand pellets upon the charcoal,\nAlternating layers of charcoal and pellets.\n\nWhen the fire burns until the interior and exterior glow red,\nExtinguish the flames and let the furnace cool,\nThen cover it with damp earth.\nThe lead below solidifies into a single mass;\nBreaking open the pellets, it emerges like raw silver ore—\nThis is called *Ganfu* [Dry Father].\n\nTake this *Ganfu* to refine into *liujin* [mercury],\nFor then the elixir gains vitality—\nNot mere lead ore mixed with clay,\nOtherwise its essence will dissipate into nothingness.\nWithout a master’s transmission,\nIf one acts recklessly, it will surely lead to ruin.\n\nThe supreme elixir’s sole ingredient is refined lead.\nIf this treasure is obtained, all matters are complete.\n\nThis is the primordial *True One Water* of the Preheaven,\nIts quantity multiplied manyfold,\nTo serve as the foundation for the sacred ash’s construction.\n\nExtracting one part of true earth-water,\nIts worth exceeds a pound of gold.\n\nNow, the divine mechanism awaits the subsequent great method.\n\n**Ancient Xi-Huang’s Method for Refining the Divine Elixir**\n*Earth Element’s Initial Step, Golden Cauldron’s Divine Chamber.*\n\nUpper and lower strings [of the furnace],\nEach weighing one *jin*.\nAs with the Nine Cauldrons, Seven Cauldrons,\nFive Cauldrons, or Three Cauldrons—\nThe heart follows the great method’s prescribed measures.\n\nIf using eight *liang* of white gold [silver],\nTake thirty-six *jin* of black lead infused with *fuyi* [subdued qi].\nFor eight to nine *liang* or seventy-two *liang*,\nExtract according to the Nine Pools.\n\nFear not the lead’s qi is insufficient—\nThe divine essence descends sparingly,\nMaking it difficult to harmonize with Heaven and Earth’s seals.\nHalf a *jin* to eight *liang*—\nNow, refine nine *liang* to produce one *liang*,\nTo dissipate excess qi.\n\nFirst, seek the *Earth’s Soul*—\nThe *Earth’s Soul* is white gold [silver].\nNext, take the *Heaven’s Spirit*—\nThe *Heaven’s Spirit* is yellow gold [gold].\nYellow gold produces *zhushasha* [cinnabar sand],\nThe essence of the sun.\nWhite gold generates flowing pearls,\nThe essence of the moon.\nWhen spirit and soul unite,\nThe essence and brilliance spontaneously coalesce into one.\n\nSeizing the complete function of Heaven and Earth’s sun and moon—\nThis is the sacred ancestor’s *Xuanyuan’s* wondrous application.\nThe Sage knows that divine substances conceal in the North,\nComing here to forge the elixir’s head.\nWorldly gold, though of pure yang essence,\nEven after a hundred refinements, will never absorb qi.\nAs for copper and tin,\nTheir nature is excessively dry,\nMaking it difficult to encounter the *Golden Lord*—\nIf encountered, their form will surely be damaged.\n\nOnly white gold,\nIn its singular affinity, rejoices in harmony.\nGolden flowers bloom, pearls flow,\nPrecious pearls emerge radiant among them.\nTrue yin and true yang,\nTheir lights intermingle, their bodies unite.\nSkillfully applying the *Zhoutian* [Postheaven] measures,\nFilling the five colors with central yellow,\nNaturally, yang arises from true earth—\nEarth flourishes, metal thrives.\nBorrowing the *Water Tiger* to nurture and give birth to the *Shenlong* [Divine Dragon],\nFive-colored scales shimmer,\nGolden ointment, jade-like body,\nEver luminous and enduring,\nAs the ancestral elixir for ascending to heaven—\nThe more it is refined, the more potent it becomes;\nThe more it is tempered, the more wondrous it grows.\n\nThus, there are the *Yin Pool* and *Yang Cauldron*.\nSince lead does not endure refining,\nEstablish methods and symbols to determine its floating and sinking nature.\nConstruct the cauldron as yang,\nSo that the yang spirit ascends to the celestial realm above.\nFashion the pool as yin,\nSo that the yin soul descends into the underworld below.\n\nThe *One-Nine* method’s efficacy lies in lead,\nThe *Two-Nine* method’s efficacy lies in the mother [mercury].\nAll other formulas omit the mother—\nThe elixir’s gate suffers in vain,\nHow can *Renji* [metal and water] be divided?\nThe aged and brittle transform into yin earth,\nUsing lead requires secret transmission.\nInitially, gold refines lead,\nFloating and sinking reveal the truth.\nPreheaven and Postheaven,\nRecognizing their inner essence,\nNo need to seek cave-dwelling immortals.\nLike an infant searching for its wet nurse,\nCycle after cycle, passing through the *Xuan* [Mysterious] Gate.\nThe medicine is true *mercury*,\nThe gold elixir is the divine elixir.\nOne mother bears nine children,\nEach transmitting their own branches and leaves.\nVirtue is insufficient to encounter [it],\nKarma is insufficient to hear [it].\nThis is the obscure, hidden true method—\nChild, commit it to memory.\n\n**Method for Establishing the Furnace and Cauldron**\nOfferings to the Nine Celestial Lords of the Five Soils,\nThe Seven Stars of the Northern Dipper’s True Immortals,\nAnd the Furnace’s Chief Spirit overseeing the elixir’s refinement.\nThe Five Deities of Metal, Wood, Water, Fire, and Earth,\nAttend with incense, lamps, and offerings,\nDevoutly petitioning the Supreme Truth.\n\nPreparations include tongs, keys, and other tools,\nAccumulating black tiger iron pools and precious pagodas,\nAmassing them to prevent loss or damage.\n\nWithin the furnace, the wind inlet and door should be\nAs large as a chicken egg—\nDo not make it overly wide.\nIf too wide, the wind’s force weakens,\nAnd the true qi will not ascend.\n\nThe pool’s base has three supports,\nNot made of iron, but fired from magnetic soil,\nArranged in a *brand* character.\nExternally, secure it with salt clay,\nFirm and unbroken.\n\nPlace the pool in the upper chamber,\nSupported by a heavy frame,\nWith iron rings suspended high on the ceiling beams.\nEnsure the inner fire cover is secure,\nPreventing flames from nearing the cauldron.\n\nSeparately, create pathways for adding and reducing fire,\nFor adjusting the process as needed.\n\n**Secret Method of the Nine Earth Pools**\n*Copper Talisman, Iron Scrolls*\n\nTwo by two, the Pengluo Platform,\nThe Eight Treasures’ Radiant Yang Hall.\nTen Thousand Saints reverence the Central Emperor,\nThe Primordial Heavenly King manifests.\nThe King strides across the elixir’s terrace,\nCommanding the Golden Lord to refine.\nA single chant summons all true beings,\nGolden light pervades the world.\nCautiously await the Northern Homeland’s demon,\nWashing out the Celestial Garden’s dawn.\nThe effort lies with the elixir adept—\nAbandon the old, welcome the new transformation.\nSeize the *Gan’s* dazzling spirit-soul,\nDo not let dark clouds disrupt [it].\nProducing night-illuminating pearls,\nFive colors radiant in fragments.\nAbove and below, let the wind circulate,\nGolden dates, the face of an infant.\n*Xiqi’s* yin turbidity arrives,\nDeploying the *Hechē* [River Chariot] to turn.\nPurple qi enters the upper chamber,\nParent and child no longer meet.\nInitially producing longevity’s bloom,\nEasily leading to scattered spirit.\nDirectly pointing to the *Hunwen*—\nNamed *Qing’ai* [Green Dust].",
      "overlap_context": "a hundred days of labor,\nIt is the foundation for ascending to heaven.\n\n**The Formula for Extracting True Lead**\nFirst, extract mountain lead sand—several hundred pounds—\nAnd pound it into powder.\nThen take the mineral’s upper layer of clay soil,\nFor every pound of lead,\nAdd four ounces of salt,\nPound it ten thousand times.\nWeigh out one pound of lead powder,\nWrap it in paper in multiple layers,\nSeal it externally with salt clay,\nFive or six divisions thick,\nAnd dry it thoroughly under the sun.\"",
      "start_char": 1257,
      "end_char": 2433,
      "start_sentence": 72,
      "end_sentence": 146,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 17.50312566757202,
      "metadata": {
        "source_file": "dao\\藏外\\铜符铁卷.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "第一池炼铅法：则用出山净金一斤，白如雪朵，碎作十六片。 乃于日月合壁日、五星联珠日、申酉金旺日，将池鼎安置停当，开风门，进文武大。 文火温池，先投铅半斤，炼灰池结宝，基址坚固，免致折耗之患。 待池将红，另用伏气净铅九斛，每斛分三进六十五株，每铢为一池，九池共铅八十一斤，以应九九周天之数。 将金片片入池，武火溶化成汁。 只待黑尽自现，一上一下浮现。 两旋红光闪闪半虚空，瑞气炎炎浮紫廓，取次入铅，漏尽再添； 满天星宿浮沉转，宝月金花劈面来，铅铢又进。 莫离方寸； 看看癸水尽，方见海金螯，急进铅爻，壬水上潮； 和风吹得金花散，散却盈庚见酉孩； 须用有力三人，互相轮换。 饮食起居，八门开闭。 进铅入炭，猛烹急炼。 使朱雀炎空，紫神瑞气，金枣花红火火，生光爻爻露电。 进铅不可大急，急则金乌不出海。 又不可大缓，缓则玉兔恐伤形。 水火交缠数足，无形合虚，旷然成质。 壬水得金，自然升上泥丸之顶，结就昱日流珠。 铅数投尽，退火封门。 安金益水，进铅三钱四分。 保神固形，不可有动池鼎。 冷定取出，摘下鼎中壬水，号曰“青埃”。 或金盒磁盒封固，勿令泄气，听后人元配合。 铜符铁卷 同志二三人，固守紫阳宫。 黑以白为丹，红以黑为翁。 中和天地髓，只此是丹宗。 禹门三汲浪，漏滴令空空。 殿上流珠滚，色似紫金红、池中翻玉液，吹嘘籍巽风。 玉兔酉为宅，金乌日上东。 龙虎遥相望，会合景阳宫。 抽取铅中宝，火候莫匆匆。 煅得金珠滚。 珠珠气上冲。 眼前红黄色，华盖要严封。 漏尽池中浊，浮清透蕊降。 直指函文名曰黄轻 第二池炼铅火候法则，与首池相同，仍换新池新鼎，固济如法。 将圣母不动，如有消耗，即添补数足。 进文武火，投水铅半斤，坚固基址。 铅干一半，入圣母在内，大火溶化。 金汁清清明彻底，朱雀恍恍出南园，速进铅珠，勿容火急； 昨夜婴儿初别母，今朝次子亦如前再进铅铢，铢钵如则； 莫道黑龟初出海，也防风浪动人心，铅铅无差，火火一色； 紫金台上凝霜雪，白玉堂前母独眼，策策丙丁升，滴滴铅入骨。 铅数投尽，明镜无尘，退火封门。 进金之铅，二钱三分寒炉一夜，轻轻敲取得鼎上流珠，号曰“黄轻”。 取下另封，移池换鼎。 铜符铁卷 大道总无烦，铅汞两般是。 铅见汞施仁，汞见铅施义。 神丹一味铅，内隐先天气。 媒约丙丁公，调变黄婆力。 搬运赖河车，汞把铅精吸。 浮沉上下间，一一又一一。 华盖日日新，流珠号如意。 黄鹤满空飞，青天雷轰霹。 乾金露紫华，休使铅不及。 但今四门开，上把玄窍闭。 一动铅气通，金池当固密。 这般火烹炼，无形又无质。 直指函文名曰金液 第三池炼铅火候法则，一一与前相同。 将固池，架三足，上坐鼎，封严不动。 圣体无亏，消耗补全。 入筑基池中，大火风开。 三文三武黄芽长，再升再降黑铅功，火火大张，爻爻无易； 黑铅起手无生有，白金倒了有还元，依刻投铅，愈加珍重； 青龙退骨三回转，白虎翻身就地存，进进铅爻，首尾如是； 西池日月初相见，夺得清香各自归，龙霞红似火，真火腾龙霞。 铅数进毕，退火停炉。 入安全之铅，一钱二分。 前三池是长男成象，震庚受符，共用安全之铅七钱，以应天符七日来复之说，以后六池则不用此法矣。",
      "translated_text": "「The First Pool’s Lead Refinement Method: Use one *jin* of pure mountain gold, white as snowflakes, crushed into sixteen pieces.\nOn days when the sun and moon align in the same wall, when the five stars join in a single pearl, or when *Gan* and *You* (申酉) signify the gold’s vigor, place the pool and cauldron securely, open the wind gate, and introduce the *Wenwu* (文武) fires.\nWith gentle *Wen* (文) fire warming the pool, first cast in half a *jin* of lead, refining the ash into a solid treasure. Strengthen the foundation to prevent collapse or waste.\nWhen the pool turns red, use nine *hu* of purified *Fuxi* lead (伏气净铅), each *hu* divided into three portions of sixty-five *zhu* (斛/株), each *zhu* as one pool, totaling nine pools with eighty-one *jin* of lead—matching the ninety-nine revolutions of the *Zhou Tian* (周天).\nInsert each gold piece into the pool, then apply fierce *Wu* (武) fire to melt them into essence.\nWait only until the blackness fades and the essence reveals itself, appearing and disappearing in two cycles.\nThe vermilion light flickers half-illuminating the void—auspicious qi rises, floating in purple haze. Gradually add lead, letting it drip until exhausted; then replenish.\nAs celestial hosts rise and fall in constant motion, the treasure moon and golden flowers burst forth. Again, add lead by the *zhu*.\nDo not stray from the center—\nWhen *Gui* (癸) water is fully consumed, the \"sea gold\" (海金) emerges. Swiftly add lead essence, and *Ren* (壬) water ascends.\nA gentle breeze scatters the golden flowers,\nYet the excess reveals *Geng* (庚) as *You* (酉) child.\nUse three strong men to assist, taking turns in rotation.\nDiet and rest must align with the *Bamen* (八门) openings and closings.\nAdd lead into the charcoal, boiling and refining with vigor.\nLet the *Zhuhu* (朱雀) blaze the void,\nWhile the purple deity’s auspicious qi ascends—\nGolden date flowers bloom in crimson flames,\nGenerating light and essence like lightning.\nDo not add lead too hastily—\nHaste will prevent the *Jinwu* (金乌) from emerging from the sea.\nNor too slowly—\nSlowness risks harming the *Yutu* (玉兔)’s form.\nWhen water and fire intertwine sufficiently, without form or substance, the essence solidifies.\n*Ren* water, meeting gold, naturally ascends to the *Nihuan* (泥丸) apex,\nCondensing into the \"sunlight pearl\" (昱日流珠).\nAfter all lead is consumed, withdraw the fire and seal the gate.\nSecure the gold and replenish the water,\nThen add three *qian* and four *fen* of lead.\nPreserve the spirit and stabilize the form—\nDo not disturb the pool or cauldron.\nOnce cooled, remove the *Ren* water from the cauldron,\nCalled the *Qing’ai* (青埃).\nOr seal it in a gold or magnetic box,\nLest the qi escape. Leave it for later generations to blend with their *Yuanpei* (元配).\nWith bronze seals and iron scrolls,\nAnd comrades of shared intent, guard the *Ziyang* (紫阳) Palace.\nBlack becomes red as the elixir,\nRed becomes black as the *Weng* (翁).\nThe harmony of heaven and earth’s marrow—\nThis alone is the Dao of the elixir.\nAt the *Yumen* (禹门), draw three waves of water,\nLetting droplets fall into the void.\nOn the palace’s summit, pearls roll like sunlight—\nTheir hue resembles purple-gold and crimson.\nWithin the pool, jade nectar churns,\nBlown by the *Xun* (巽) wind.\nThe *Yutu* (玉兔) resides in *You* (酉),\nThe *Jinwu* (金乌) ascends to the east.\nDragon and tiger gaze from afar,\nUniting in the *Jingyang* (景阳) Palace.\nExtract the lead’s treasure,\nDo not rush the fire’s timing.\nCalcined, the golden pearls roll—\nEach pearl’s qi surges upward.\nBefore your eyes, red and yellow appear,\nSeal the *Huagai* (華蓋) tightly.\nWhen the lead’s impurities are exhausted,\nThe pool’s clarity rises, and pure essence descends.\nDirectly pointing to the *Hunwen*—\nNamed *Huangqing* (黄轻).\n\nThe Second Pool’s Lead Refinement Method follows the same principles,\nBut use a new pool and new cauldron, securing it as before.\nKeep the *Shengmu* (圣母) unshaken—\nIf there’s any loss, replenish it fully.\nIntroduce the *Wenwu* fires,\nCast in half a *jin* of water-lead.\nStrengthen the foundation.\nHalf the lead is consumed,\nAnd the *Shengmu* is within.\nApply fierce fire to melt it—\nThe golden essence becomes clear and bright,\nThe *Zhuhu* (朱雀) emerges from the southern garden.\nSwiftly add lead essence,\nDo not let the fire rage too fiercely;\nLast night’s child just parted from its mother,\nToday’s younger sibling follows the same.\nAdd lead by the *zhu* and *bu*—\nNo distinction between black tortoise and lead,\nNor between flames of varied hues;\nOn the purple-gold platform, frost condenses,\nBefore the white jade hall, the mother gazes with one eye.\n*Bingding* (丙丁) ascends in measured strides,\nLead drips into the bones.\nAfter all lead is consumed,\nThe mirror remains pristine and dust-free.\nWithdraw the fire and seal the gate.\nAdd the \"secure lead\" (安全之铅) of two *qian* and three *fen*,\nBoiled in a cold furnace overnight.\nGently tap to retrieve the pearls rolling on the cauldron’s surface,\nCalled the *Huangqing* (黄轻).\nSeal them separately, then shift to a new pool and cauldron.\n\nWith bronze seals and iron scrolls,\nThe Great Dao is without complication—\nLead and mercury are two kinds.\nLead treats mercury with kindness,\nMercury treats lead with righteousness.\nThe divine elixir is one flavor of lead,\nHolding within it the *Xiantian* (先天) qi.\nThe *Bingding* (丙丁) partners mediate,\nTransforming the *Huangpo* (黄婆) power.\nTransport relies on the *Hechē* (河车),\nMercury absorbing lead’s essence.\nIn rising and falling,\nOne follows the other.\nThe *Huagai* (華蓋) renews daily,\nPearls are called \"as one wishes\" (如意).\nYellow cranes fill the sky in flight,\nGreen heavens crackle with thunder.\n*Qianjin* (乾金) reveals purple brilliance,\nDo not let lead fall short.\nNow, open the four gates,\nSeal above the *Xuanqiao* (玄窍).\nDisturb the lead’s qi,\nAnd the golden pool must be sealed tight.\nSuch is the fire’s alchemy—\nWithout form or substance.\nDirectly pointing to the *Hunwen*—\nNamed *Jinyue* (金液).\n\nThe Third Pool’s Lead Refinement Method follows the same principles as before.\nSecure the pool with a three-legged stand,\nPlace the cauldron on top, and seal it firmly.\nThe sacred body remains unharmed—\nAny loss must be fully replenished.\nWithin the *Zhujī* (筑基) pool, ignite fierce flames.\nThree *Wen* and three *Wu* fires nurture the yellow sprout,\nLead ascends and descends in cycles—\nFlames blaze, essence does not falter;\nLead begins without form,\nGold reverses to its original state.\nFollow the prescribed measures when adding lead,\nTreating it with utmost care.\nThe green dragon retreats three times,\nThe white tiger flips its body to return to earth.\nAdd lead essence in cycles—\nStart and end as before.\nIn the western pool, the sun and moon meet,\nSeizing the pure fragrance to depart.\nDragon’s mist glows red like fire,\nTrue fire engulfs the dragon’s mist.\nAfter all lead is added,\nWithdraw the fire and halt the furnace.\nAdd the \"secure lead\" (安全之铅) of one *qian* and two *fen*.\nThe first three pools represent the eldest son’s manifestation,\n*Zhen* (震) and *Geng* (庚) receiving the talisman—\nA total of seven *qian* of secure lead, corresponding to the seven-day return of the *Tianfu* (天符).\nThe subsequent six pools will not use this method.»",
      "overlap_context": "n’s* dazzling spirit-soul,\nDo not let dark clouds disrupt [it].\nProducing night-illuminating pearls,\nFive colors radiant in fragments.\nAbove and below, let the wind circulate,\nGolden dates, the face of an infant.\n*Xiqi’s* yin turbidity arrives,\nDeploying the *Hechē* [River Chariot] to turn.\nPurple qi enters the upper chamber,\nParent and child no longer meet.\nInitially producing longevity’s bloom,\nEasily leading to scattered spirit.\nDirectly pointing to the *Hunwen*—\nNamed *Qing’ai* [Green Dust].",
      "start_char": 2434,
      "end_char": 3703,
      "start_sentence": 147,
      "end_sentence": 220,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 24.765517950057983,
      "metadata": {
        "source_file": "dao\\藏外\\铜符铁卷.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "退火寒炉，取出鼎上壬水，号曰“金液”，封记明白，又换新池作用。 铜符铁卷 东出太阳晶，光华灿灿明。 遍照普天下，露入碧波城。 昼夜东西转，西沉东复升。 阖辟太阳母，万象禀光明。 乾坤天地髓，神丹大道根。 坤乙月将晦，昏昏体太阴。 踏见西南地，微微露一星。 日游东地陆，月渐望南行。 七八光浮体，看看重一斛。 半黑又半白，白者是金精。 若非三足力，玉兔华不生。 十五临甲地，丹光满玉京。 直指函文名曰红霞 第四池铅火候，与前俱同。 不动圣胎，待母入池，大火风开。 仍前进铅，不得荀筒。 三天三合产真铅，不是阴阳定不出。 又进铅爻，爻爻相续。 金丹全仗庚辛力，壬不成庚癸不分。 但看铅壬，相济白金。 金水得合，凡子圣孙。 华池母溶，各要分明。 红光五色，袭之霞生。 时时美景如金碧，日日花开样不同。 下手只银铅，分散铅汞，土铢尽支，空寒炉一夜，取出鼎上壬水，号曰“红霞”，收记换池另炼。 铜符铁卷 黑铅天之精，白金地之液。 黑隐水中阳，白有火之气。 黑白往来翻，拘来归正位。 二物性含情，丹经号同类。 黑以白为主，阴以阳为配。 阴阳混沌时，朵朵金花翠。 宝月满丹田，猛烹火煅极。 休闭通天窍。 令其呼与吸。 翻腾举目间； 乌龟自隐匿。 精奇口诀功，火候在消息。 凡中养圣孙、万般只此贵。",
      "translated_text": "Withdraw the fire and let the furnace grow cold,\nExtract the *rénshuǐ* (壬水) from the crucible above—\nCalled **\"Jīnyè\" (金液)**—seal it clearly and replace with a fresh pool for further work.\n\n**Copper Talisman, Iron Scrolls**\nEastward, the Sun’s crystal emerges,\nIts radiance dazzling and bright.\nIlluminating all under heaven,\nIts dew enters the jade city’s waves.\n\nDay and night it turns east and west,\nSetting in the west, rising again in the east.\nThe Great Mother of the Sun opens and closes,\nAll things receive its luminous essence.\n\nThe marrow of Heaven and Earth—\nThe root of the Dao of Immortal Elixir.\n\nIn the *Kūn* (坤) month, as the moon wanes,\nDarkness deepens, embodying the *Tàiyīn* (太阴).\nA faint star glimmers in the southwest,\nWhile the Sun traverses the eastern land,\nThe Moon gradually moves southward.\n\nBy the seventh and eighth days, its light floats within,\nGradually filling a *hú* (斛) measure.\nHalf black, half white—\nThe white is the essence of gold.\n\nWithout the power of the *Sānjiǎo* (三足), the Moon’s brilliance would not arise.\nAt the fifteenth day, over *Jiǎdì* (甲地),\nThe elixir’s light fills the Jade Capital.\n\nDirectly pointing to *Hánwén* (函文), it is called **\"Hóngxiá\" (红霞)**.\n\nThe fourth pool’s lead and fire regimen\nFollows the same as before.\n\nDo not disturb the Sacred Embryo;\nWait for the Mother to enter the pool,\nThen ignite the Great Fire with wind.\n\nProceed with lead as before—\nNo *xùntǒng* (荀筒) may be used.\nThree days, three fusions yield True Lead—\nOnly when yin and yang are resolved does it emerge.\n\nAgain, advance the lead *yáo* (爻),\nEach step continuous.\n\nThe Golden Elixir relies on *Gēngxīn* (庚辛) power—\nWithout *Rén*, *Gēng* cannot form; without *Guǐ* (癸), it cannot separate.\n\nObserve the lead and *rénshuǐ*—\nTheir interplay refines the white gold.\nWhen metal and water unite,\nCommon sons become sacred descendants.\n\nThe Mother melts in the Hua Pool—\nEach must be distinctly observed.\nFive-colored radiance arises,\nEnveloping it in crimson mist.\n\nHour by hour, scenes gleam like gold and jade,\nDay by day, the flowers bloom anew in form.\n\nBegin only with silver and lead,\nDispersing lead and mercury,\nExhausting every *tǔzhū* (土铢),\nLeaving the furnace cold through the night.\nExtract the *rénshuǐ* from the crucible—\nCalled **\"Hóngxiá\" (红霞)**—record it, replace the pool, and refine anew.\n\n**Copper Talisman, Iron Scrolls**\nBlack lead is Heaven’s essence,\nWhite gold is Earth’s fluid.\nBlack hides within water, bearing yang;\nWhite holds fire’s qi.\n\nBlack and white alternate, returning to their proper places.\nTheir natures intertwine—\nThe *Dānjīng* (丹经) calls them kindred.\n\nBlack submits to white as master,\nYin pairs with yang as consort.\nWhen yin and yang merge in chaos,\nPetals of gold bloom emerald-green.\n\nThe Treasure Moon fills the *Dāntián* (丹田),\nBoiling fiercely in the crucible’s heat.\nDo not seal—open the Heavenly Aperture,\nLet it breathe in and out.\nIn the midst of churning—\nThe tortoise hides itself.\n\nThe secret incantation’s marvel,\nThe fire’s measure lies in its signs.\n\nNurturing the Sacred Descendant within the common—\nAll else is but this singular treasure.",
      "overlap_context": ",\nSeizing the pure fragrance to depart.\nDragon’s mist glows red like fire,\nTrue fire engulfs the dragon’s mist.\nAfter all lead is added,\nWithdraw the fire and halt the furnace.\nAdd the \"secure lead\" (安全之铅) of one *qian* and two *fen*.\nThe first three pools represent the eldest son’s manifestation,\n*Zhen* (震) and *Geng* (庚) receiving the talisman—\nA total of seven *qian* of secure lead, corresponding to the seven-day return of the *Tianfu* (天符).\nThe subsequent six pools will not use this method.»",
      "start_char": 3703,
      "end_char": 4228,
      "start_sentence": 221,
      "end_sentence": 261,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 8.397976398468018,
      "metadata": {
        "source_file": "dao\\藏外\\铜符铁卷.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "一日生一男，男男各居室。 直指函文名曰流金 第五池炼铅火候，采炼池鼎，一一相同。 圣母入池，风开金汁。 照前投铅，常加炭入。 金公百炼精神长，惟有真铅上下飞。 又进铅珠，黄白混沌。 烹煎符火三阳运，九九流珠去母阴。 认取铅金，不黄不紫。 日魂乍进嫦娥宅，觅得中秋持蕊香。 铅尽壬升，辛金自现。 寒池取出，号曰“流金”，收贮换池另炼。 铜符铁卷 采得一味真，丹胎母易阴。 一母生六子，扶桑日已临。 池池俱似始，鼎鼎更奇新。 上达红罗景，铢铢气腾清。 莫使铅埋汞，诬言有气存。 赫赫巽风烈，流金透体明。 不为坚刚质，黄舆自此生。 癸以壬为主，壬以癸为宾。 都依大道法，壬癸定浮沉。 弃遗浊下浊，轻清灵更灵。 如此浮沉法，盖世不曾闻。 火候熏蒸足，颗颗天谷青。 直指函文名曰壬华 第六池火候炼铅，斤两法度，一一大同。 分铅度数，不拘旧巧，变化在人施为，炼过二三池，自生其妙。 如流珠结少，神火不扬。 炼己稍欠，神明不来。 行结胎之火，使黄云满沼。 阴极阳生，上下门开。 细光闪灼，露滴黄庭。 婴儿显象，光逐神生。 铅如指顶，令其四方，以便作用。 当令饮食满，方可近炉，邪气难入。 铅尽退火，取鼎上壬水，号曰“壬华”，收贮换池另炼。 铜符铁卷 玄元大道根，玉清不二门。 除此一乘法，余外即非真。 煅炼铅中宝，抽取银内精，水滥车难转，不及恐伤金。 泛泛流珠滚，茫茫瑞气升。 子母互相顾，黄白混相吞。 恍惚陶情趣，三叠九重城。 洁白令见宝，青青在去阴。 洗出铅汞骨，自然结精英。 溷水荷花长，流茫浪涌生。 除却真铅汞，休听节外音。 铁卷铜符旨，丹门仔细听。 直指函文名曰壬花 第七池进铅火候亦同。 武火开化圣母，只待红光笼罩宝月，方进铅铢。 透体红璃，内外纯白，金生铅后，阳产铅中。 火盛消金，金伐木荣。 青赤黑白，归于中黄。 顺其消息，以观景象。 池池飞紫粉，火火起样光。 上冲华盖，满室明尘。 万里无云天一色，十二时中见太阳。 黄舆紫粉皆由此，白雪青埃见者昌。 原本只是一味铅精，以白金分去阴土。 金乃水之基，水乃道之枢。 只此二物，真砂真汞，皆自银铅而生。 恍恍无形，冥冥有象。 铅尽寒炉，收取鼎上壬水，号曰“壬花”，再移池作用。 铜符铁卷 布气生灵液，含光天地先。 根发浮黎土，苗生大赤天。 八宝皆由此，灵明独黑铅。 今知天地秘，炼此是良田。 六阴成圣体，枯骨返黄泉。 法用心心指，机关细细研。 不得真传授，空劳志力坚。 枉进通天火，宥脆怎留连。 刚柔有表里，阴阳禀自然。 鼎内天中地，池中地里天。 洁白瑶台上，素体净如绵。 母怀七八子，精神越似前。 至人承授受，良因宿有缘。 君能知换骨，南昌任汝闲。 直指函文名曰紫金硫 第八池火候池鼎，俱各易新。 爻铅九斤，筑基八两，炼法如前。 至此手法纯熟，知其升降如何，多寡有则。 流珠结少求乾父，折耗辛金补数全。 金花原是池中药，采得金华莫再言。 一则分铅之壬癸，—则洗金之垢阴。 进进铅为药，抽药是抽铅。 知得用铅意，神丹不是铅。 如日月交光，止盗其神，不盗期形。 用神弃形，乃得长生。 铅铢已尽，取鼎上壬水，号曰“紫金硫”，换池另炼。 铜符铁卷",
      "translated_text": "**A Daily Birth of Sons**\nEach day a son is born—\nEach son dwells in his own chamber.\n\n*\"Direct-Pointing Scroll\"*—named *Liújīn* (流金)\nThe fifth pool’s lead-refining fire:\nHarvesting the pool’s cauldron—\nEach step identical.\n\nThe Holy Mother enters the pool,\nWind opens the golden elixir.\nCast lead as before,\nEver add charcoal within.\n\nThe Golden Sage, refined a hundred times, grows in spirit—\nOnly true lead ascends and descends.\n\nAgain, lead beads advance,\nYellow and white merge in chaos.\nBoiling with talisman-fire, the Three Yang circulate,\nNine nines—pearls flow, the Mother-Yin departs.\n\nRecognize lead and gold—\nNeither yellow nor purple.\n\nThe sun-soul enters Chang’e’s hall,\nSeeking mid-autumn’s fragrant blossom.\nLead exhausted, *Rén* ascends—\n*Xīn* gold reveals itself.\n\nFrom the cold pool, it’s taken—\nNamed *\"Liújīn\"*—stored for another refining.\n\n**Copper Talisman, Iron Scrolls**\nOne true essence is gathered—\nThe *Dantai* Mother shifts to Yin.\n\nOne Mother bears six sons,\nThe *Fúshāng* sun now shines.\nEach pool mirrors its beginning,\nEach cauldron grows stranger and new.\n\nAscending to the Crimson Silk realm,\nEach grain of *qi* rises pure and clear.\nDo not let lead bury mercury—\nFalse claims of lingering *qi* are deceit.\n\nThe *Xùn* wind rages—\n*Liújīn* permeates the body, luminous.\nNot rigid or harsh in nature—\nFrom here, the Yellow Vehicle is born.\n\n*Guǐ* submits to *Rén* as master,\n*Rén* to *Guǐ* as guest.\nAll follows the Great Dao’s law—\n*Rén* and *Guǐ* determine floating and sinking.\nDiscard the turbid below,\nLight and pure—spirit ever refined.\nSuch floating-sinking methods—\nUnmatched in the world.\n\nFire’s suffusion is complete—\nEach grain of Heaven’s rice turns azure-green.\n\n*\"Direct-Pointing Scroll\"*—named *Rénhuā* (壬华)\nThe sixth pool’s lead-refining fire:\nWeighing and measures—\nAll follows the same great principle.\nDivide the lead by measure—\nNo need for old tricks;\nTransformation lies in human action.\nAfter refining two or three pools,\nIts marvels arise naturally.\n\nIf pearls flow sparingly, the Spirit-Fire does not rise.\nIf refining is incomplete, the numinous does not appear.\nKindle the embryo-fire,\nLet yellow clouds fill the marsh.\nYin reaches its peak—yang is born,\nUpper and lower gates open.\nFine light flashes—\nDew drips upon the Yellow Court.\nThe infant manifests—\nLight follows spirit’s birth.\nLead reaches the crown—\nOrder it to spread in all directions,\nFor proper function.\nOnly when nourishment is full\nShould one approach the furnace—\nEvil *qi* cannot enter.\n\nLead exhausted, withdraw the fire,\nTake the *Rén* water from the cauldron’s top—\nNamed *\"Rénhuā\"*—stored for another refining.\n\n**Copper Talisman, Iron Scrolls**\nThe Primordial Dao’s root,\nThe Jade-Purity’s single gate.\nBeyond this method, none are true.\nRefine the lead’s treasure within,\nExtract the silver’s essence—\nFlooded waters stall the wheel,\nNot as perilous as harming gold.\nPearls drift in ceaseless flow,\nMysterious auspicious *qi* ascends.\nChild and Mother regard each other,\nYellow and white devour in confusion.\nDazed, emotions stir—\nThreefold, ninefold cities.\nPure white reveals the treasure,\nAzure-green departs from Yin.\nWashed free of lead and mercury’s bones,\nNaturally the essence crystallizes.\nLotus blooms in murky water,\nWaves surge in endless teeming.\nBeyond true lead and mercury,\nNo heed to external sounds.\nThe Iron Scroll’s intent,\nThe Dan-Door listens closely.\n\n*\"Direct-Pointing Scroll\"*—named *Rénhuā* (壬花)\nThe seventh pool’s lead-refining fire—same as before.\nMartial fire dissolves the Holy Mother,\nAwaiting crimson light to enfold the Treasure Moon—\nThen introduce each grain of lead.\nPermeating the body, crimson jade,\nInternally and externally pure white—\nGold is born after lead,\nYang produced within lead.\nFire consumes gold,\nGold subdues wood—flourishes.\nBlue, red, black, white—\nAll return to central yellow.\nFollow their signs,\nObserve the phenomena.\nEach pool scatters purple dust,\nEach fire ignites its pattern-light.\nPiercing the *Huàgài* canopy,\nThe chamber fills with luminous dust.\nTen thousand *li* without clouds—\nHeaven in one hue.\nTwelve hours reveal the sun.\nYellow Vehicle, purple dust—\nAll arise from here.\nWhite snow, green ash—\nThose who see it prosper.\n\nOriginally, one essence of lead-precision,\nWith white gold separating Yin-earth.\nGold is water’s foundation,\nWater is the Dao’s pivot.\nOnly these two substances—\nTrue cinnabar, true mercury—\nAll from silver and lead.\nFormless yet symbolic,\nDark yet luminous.\nLead exhausted in the cold furnace,\nCollect the *Rén* water from the cauldron’s top—\nNamed *\"Rénhuā\"*—transferred to another pool.\n\n**Copper Talisman, Iron Scrolls**\n*Bùqì* breathes life’s essence,\nContaining light before Heaven and Earth.\nIts root sprouts from the floating soil,\nIts sprout grows in the Great Red Sky.\nEight treasures stem from this,\nOnly the luminous lead is black.\nNow knowing Heaven and Earth’s secret—\nRefining this is fertile ground.\nSix Yin forge the Holy Body,\nGnarled bones return to the Yellow Springs.\nThe method points with mind to mind,\nMechanisms researched in detail.\nWithout true transmission,\nAll effort is in vain.\nFutilely advancing Heaven’s fire,\nHow could the fragile endure?\nHard and soft have exterior and interior,\nYin and Yang follow Nature’s decree.\nWithin the cauldron—Heaven in Earth,\nIn the pool—Earth beneath Heaven.\nPure white on the Jade Terrace,\nSubstance as clean as silk.\nThe Mother cradles seven or eight sons,\nSpirit ever more refined than before.\nThe Perfected One receives the transmission—\nA worthy cause, a destined fate.\nIf you know to exchange bones,\nNánchāng leaves you to your leisure.\n\n*\"Direct-Pointing Scroll\"*—named *Zǐjīnliú* (紫金硫)\nThe eighth pool’s fire and cauldron—\nBoth renewed.\nNine *liǎng* of lead, eight *liǎng* of foundation,\nRefined as before.\nNow the technique is pure—\nKnowing ascent and descent,\nExcess and deficiency, each in measure.\nIf pearls flow sparingly, seek the Dry Father,\n*Xīn* gold’s loss is supplemented.\nGold flowers are the pool’s medicine—\nHarvesting *Jīnhuā* requires no more words.\nOne method divides lead’s *Rén* and *Guǐ*,\nOne method washes gold’s turbid Yin.\nEach time lead is the medicine,\nExtracting medicine is extracting lead.\nUnderstanding lead’s purpose—\nThe elixir’s spirit is not lead.\nLike sun and moon exchanging light,\nSteal only its spirit,\nNot its form.\nUsing spirit, discarding form—\nThus attaining longevity.\n\nLead exhausted, take the *Rén* water from the cauldron’s top—\nNamed *\"Zǐjīnliú\"*—refined in another pool.",
      "overlap_context": " submits to white as master,\nYin pairs with yang as consort.\nWhen yin and yang merge in chaos,\nPetals of gold bloom emerald-green.\n\nThe Treasure Moon fills the *Dāntián* (丹田),\nBoiling fiercely in the crucible’s heat.\nDo not seal—open the Heavenly Aperture,\nLet it breathe in and out.\nIn the midst of churning—\nThe tortoise hides itself.\n\nThe secret incantation’s marvel,\nThe fire’s measure lies in its signs.\n\nNurturing the Sacred Descendant within the common—\nAll else is but this singular treasure.",
      "start_char": 4228,
      "end_char": 5491,
      "start_sentence": 262,
      "end_sentence": 354,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 20.331204175949097,
      "metadata": {
        "source_file": "dao\\藏外\\铜符铁卷.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "黑取黑之髓，白取白之油。 黑白共合体，油髓自然稠。 婴儿入紫府，姹女下重楼。 煤灼中黄宝，修就紫金硫。 下布长蛇阵，驾凤在碧游。 瑶池初浴体，未济养三周。 擒住南朱雀，真土葬为丘。 火候同一二，法则似前求。 三壬癸一两，九阳足以收。 九九八十一，不足照前抽。 夺尽九六数，西山鬼哭愁。 逆顺颠倒理，为尾又为头。 直指函文名曰妙灵砂 第九池火候法则，炼铅亦同。 入圣母在内溶化，红光笼罩宝月，方进铅钵。 水银过度，神仙至秘。 招摄龙精，赖于虎髓。 不用铅形，只有铅气。 铅气何得，先求同类。 同类是金，灰池用意。 阵阵火功，外包鼎器。 流珠得金分出，不与世铅相同。 见火则别，见金又住。 从一至九，谓之炼已，是炼精化气之功。 一池至九池，壬水各自封固。 圣水多备，以防后用。 所谓得药忘年，炼铅无计，乃活法也。 寒炉开看，母体白如雪片方好，号曰“妙灵砂”。 如青黄，非铅之真气，乃癸水未尽，必须猛烹极煅，浪涌波翻，方怀真气。 后有温养赤文之诀，返魂换骨之功。 详者如右（下）。 人元九鼎秘诀 一鼎 人元一鼎丹，九九过铅关。 复用青都所，返出又回还。 辛金浑似雪，壬水化为烟。 子母平平入，五五育天色。 霹雳三周火，分胎上下间。 莫此尘嚣事，笃志要心坚。 一阳初复日，神魂一线缠。 亲授铅符卷，铅汞自留连。 诀曰：九炼辛金一斤碎为米粒，将首池青埃一斤，二物混合。 入阴阳鼎内，神胶封固，铁线十字扎住，外用泥包固，入未济炉，三足上稳定，勿使偏歪颠倒，周围上下，净灰盖之。 加顶火四两养一七，二七火六两，三七火半斤，温养二十五日。 取出入明炉，先文后武，煅炼六六三十六时，鼎火一色，日足冷定。 开鼎取看，变成红霞，在上成质，如赤玉紫粉。 辛金在下成一饼，外白内黄。 再又过度，中乘一月一鼎，祖气初传，乍离母体。 神气混沌，魂魄不坚，不堪点化。 再寻乳母，意志超越。 为出类拔萃之神符，有起死回生之功力。 二鼎 人元二鼎丹，耀出禹门关。 复用希夷所，夜落晓归还。 日魂霞里见，月魄满秋天。 兄弟平平入，五五赤文全。 三十六时火，分开一二三。 一子嚣浮骨，二子志方坚。 二阳来复后，开如鸡子颜。 亲授铜符卷，银铅鼎炭钳。 诀曰：前圣金一斤，至此丝毫不折，不可伤动胎根。 将一鼎青汞，配二池流珠，共二斤拌匀。 与胎上下，铺盖固济。 火候同前，温养日足。 武火分胎，天地人三才定位。 首子青汞如灰，虚嚣则无神气。 二子似水晶黄芽，渐长成抽出尘嚣，谓之真铅。 将此作长生匮，青汞三钱，伏光明砂一两，再加丙火三日。 气绝形黄，将砂一钱，于干汞一两。 以汞一钱化铜十两。 如此神异变化无方，是宗祖之初功也。 三鼎 人元三鼎丹，飞出斗牛关。 复用混沌所，牵转白牛还。 金鹅飞去窟，赤凤伏丹田。 生熟平平入，宗祖出黄泉。 六六时中火。 江流动动潺。 一二翠如玉，两长力难坚。 三阳来复后，开之碧芷莲。 铜符铁卷旨，梧桐宿凤鸾。 诀曰：前圣金一斤，将二鼎流珠配三池金液，共二斤拌匀。 与圣母上下铺盖固济，手法如前。 文火温养，子母熏蒸。 武火煅炼，返魂换骨。 日足周全，一进一出。 留少去老，二子不用。",
      "translated_text": "From black, extract black’s marrow;\nFrom white, take white’s oil.\nBlack and white merge as one—\nOil and marrow thicken naturally.\n\nInfant enters the Purple Palace,\nFair maiden descends the Heavy Tower.\nCoal sears the Central Yellow Treasure,\nRefining *Zǐjīnliú* to perfection.\n\nDeploy the Long Serpent Array below,\nRiding the phoenix through azure expanse.\nAt the Jade Pool’s first bath—\nUnfulfilled, nurture three cycles.\n\nSeize the Southern Vermilion Bird,\nTrue earth buries it as a mound.\nFire’s measure follows One and Two,\nMethods echo prior seeking.\n\nThree *Rén* and one *Guǐ*—one *liǎng* each,\nNine *Yáng* suffice to gather.\nEighty-one times nine—\nInsufficient to match prior extraction.\n\nPlundering the Nine-Six count,\nWest Mountain ghosts weep in sorrow.\nReversed and upright—logic inverted,\nTail becomes head, head becomes tail.\n\nDirectly pointing to *Hánwén*—\nCalled *Miàolíngshā*.\n**Ninth Pool’s Fire and Method:**\nRefining lead is the same.\n\nEntering the Holy Mother’s dissolution,\nRed light envelops the Treasure Moon—\nThen introduce the lead crucible.\nMercury overstepped—\nDivine secret of immortals.\n\nSummoning dragon essence,\nRelying on tiger marrow.\nNo lead form used—\nOnly lead *qi*.\n\nHow to obtain lead *qi*?\nFirst seek its kindred.\nKindred is gold—\nGray Pool’s intent.\n\nLayered firecraft,\nExternally encasing the cauldron.\nPearls yield gold’s portion—\nNot like worldly lead.\n\nFire reveals its difference,\nGold reveals its stillness.\nFrom One to Nine—\nCalled refining complete—\nThe work of refining essence into *qi*.\n\nOne Pool to Nine Pool—\nEach *Rén* water sealed apart.\nHoly waters stored abundantly,\nFor later use.\n\nSo-called \"obtaining medicine, forgetting age,\"\nRefining lead without measure—\nThis is the living method.\n\nCold furnace opened—\nMother’s body white as snowflakes—\nThen it’s good, named *\"Miàolíngshā\"*.\nIf green-yellow,\nNot true lead *qi*—\n*Guǐ* water yet exhausted.\nMust fiercely boil and calcine,\nWaves surging, billowing—\nOnly then does true *qi* reside.\n\nLater: methods for nurturing *Chìwén*,\nReturning soul, transforming bone.\n\n---\n**Human Element’s Nine-Crucible Secrets**\n\n**First Crucible**\nHuman Element’s first elixir,\nNine nines pass the lead barrier.\nReusing *Qīngdū*’s essence,\nReturned and restored again.\n*Xīnjīn* like snow,\n*Rén* water turns to smoke.\nChild and Mother balanced—\nFive fives nurture celestial hue.\nThunder’s three cycles of fire,\nDividing embryo above and below.\nAvoid worldly distractions,\nSteadfast resolve, firm heart.\n\nOne *Yáng* first revives the sun—\nGod and soul entwined in thread.\nGiven: lead talisman scroll,\nLead and mercury linger.\n\n**Method:**\nNine refinements of *Xīnjīn* (one *jīn*), crushed to rice grains.\nTake first Pool’s *Qīng’āi* (one *jīn*).\nMix the two.\nSeal in *Yīnyáng* crucible with divine glue,\nBind with iron wire in cross,\nWrap externally with clay,\nPlace in *Bùjié* furnace—\nThree legs stable, upright,\nNo tilting or inversion.\nSurround top and bottom with clean ash.\nAdd four *liǎng* of top fire for seven days,\nSix *liǎng* for the next seven,\nHalf a *jīn* for the final seven,\nNurture twenty-five days.\n\nRemove to bright furnace—\nFirst gentle, then fierce—\nCalcine sixty-six times (thirty-six hours),\nCrucible fire uniform,\nCool fully by day.\nOpen the crucible—\nTransformed into red mist,\nAbove forming substance,\nLike red jade, purple powder.\n*Xīnjīn* below forms a cake—\nWhite exterior, yellow interior.\n\nRefine further—\nOne month per crucible,\nAncestral *qi* initially transmitted,\nBarely parted from the Mother.\nGod-*qi* chaotic,\nSoul and spirit unstable—\nUnfit for alchemical activation.\nSeek another nurse,\nWill transcending.\n\nAs an elite divine talisman,\nWith power to revive the dead.\n\n---\n**Second Crucible**\nHuman Element’s second elixir,\nRadiant beyond *Yǔmén* Pass.\nReusing *Xīyí*’s place,\nFalling at night, returning at dawn.\nDay-soul seen in mist,\nMoon-shadow fills autumn sky.\nBrothers balanced—\nFive fives complete *Chìwén*.\n\nThirty-six hours of fire,\nDividing One, Two, Three.\nFirst child—empty, bone-like;\nSecond child—will firm.\nTwo *Yáng* revive—\nOpens like a rooster’s egg yolk.\n\nGiven: copper talisman scroll,\nSilver-lead crucible, tongs.\n\n**Method:**\nPrior elixir gold (one *jīn*)—\nNow not diminished, do not disturb the embryo.\nTake first crucible’s *Qīnggōng*,\nMix with second Pool’s pearls—\nTwo *jīn* total, blend evenly.\nLayer above and below the embryo,\nSecure and stabilize.\nFire as before, nurture fully by day.\nFierce fire separates the embryo—\nHeaven, Earth, Human: Three Powers aligned.\n\nFirst child—*Qīnggōng* like ash,\nEmpty—no *qi*.\nSecond child—water-crystal yellow sprout,\nGradually rising, free of worldly dross—\nCalled true lead.\nUse this as the longevity vessel—\nThree *qián* of *Qīnggōng*,\nOne *liǎng* of *Fúguāngshā*,\nAdd three days of *Bǐng* fire.\n*Qi* exhausted, form yellow—\nTake one *qián* of *shā*,\nOne *liǎng* of dry *gōng*.\nWith one *qián* of *gōng*, forge ten *liǎng* of copper.\nSuch divine transformations boundless—\nThis is the ancestral foundation.\n\n---\n**Third Crucible**\nHuman Element’s third elixir,\nSoars beyond *Dòuniú* Pass.\nReusing *Hùndùn*’s place,\nDragging the White Ox back.\nGolden goose flees its cave,\nVermilion phoenix nests in the *Dāntián*.\nRaw and ripe balanced—\nAncestors rise from *Huángquán*.\nSixty-six hours of fire—\nRiver flows, murmuring.\nOne and Two—jade-like,\nTwo long—strength unyielding.\nThree *Yáng* revive—\nOpens as green *zhǐlián* lotus.\n\nCopper talisman, iron scroll’s intent—\n*Wútóng*’s phoenix and *luán*.\n**Method:**\nPrior elixir gold (one *jīn*),\nMix with second Pool’s pearls and third Pool’s gold liquid—\nTwo *jīn* total, blend evenly.\nLayer above and below the Holy Mother,\nSecure as before.\nGentle fire nurtures,\nChild and Mother steamed.\nFierce fire calcines,\nReturning soul, transforming bone.\nDay complete, whole cycle—\nRetain the young, discard the old,\nSecond child unused.",
      "overlap_context": "ine—\nHarvesting *Jīnhuā* requires no more words.\nOne method divides lead’s *Rén* and *Guǐ*,\nOne method washes gold’s turbid Yin.\nEach time lead is the medicine,\nExtracting medicine is extracting lead.\nUnderstanding lead’s purpose—\nThe elixir’s spirit is not lead.\nLike sun and moon exchanging light,\nSteal only its spirit,\nNot its form.\nUsing spirit, discarding form—\nThus attaining longevity.\n\nLead exhausted, take the *Rén* water from the cauldron’s top—\nNamed *\"Zǐjīnliú\"*—refined in another pool.",
      "start_char": 5492,
      "end_char": 6744,
      "start_sentence": 355,
      "end_sentence": 441,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 21.98498296737671,
      "metadata": {
        "source_file": "dao\\藏外\\铜符铁卷.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "要得朱砂死，先须死黑铅。 铅精一味，砂倒汞行。 将二子三钱，伏好雄一两。 三日火足，其雄实死。 死雄一钱，干汞一两。 死汞一钱化铜十两。 永成至宝，济世扶危，无量之福，转转接养，化化生生。 四鼎 人元四鼎丹，九九勾萎关。 用意青埃所，朱雀进西川。 紫府华池长，黄芽满玉田。 进退平平入，温养幼婴颜。 骨大精神壮，禁奈肃霜寒。 父少儿子老，天道自循环。 四阳来复后，中黄白玉边。 亲授铜符卷，神光满上弦。 诀曰：前圣金一斤，将前三鼎金液，配四池红霞，铅汞共三斤，混合一处，固济火候亦如前法，生熟相制，温养二十五日取出。 明火分胎，仔细鼎器，寒炉取之。 弃却三子，以养硫黄，闻气而死。 用硫一分，干汞一两，以汞一钱，化铁拾两，慎之又慎。 五鼎 人元五鼎丹，遍遍亦如前。 离却神房所，云雾满山川。 水虎不相顾，火龙怎出泉。 次第平平入，虚虚辅浩然。 汞长红璃色，铅枯面不鲜。 抽铅添汞法，父子不相传。 五阳来复后，月魄满南园。 亲授铜符卷，百日福无边。 诀曰：前圣金一斤，精神渐长，与前不同，鼎鼎各别。 将四鼎壬水与五池流金混合一处，老嫩铺盖。 圣金火候温养，分胎法则，如前一样。 日足开取，退下四鼎嚣尘。 三钱伏雌黄一两，开气而死。 将雌一钱，化铅一两成银。 将银溶化，再点灵雌七分，成上色黄金，以此金造神室，伏养八石，各有变化。 六鼎 人元六鼎丹，关过又重关。 洒落明堂所，珠珠子奉还。 青汞八百岁，也要半斤铅。 来往平平入，金乌涌大渊。 阴符不可急，阳火正炎炎。 武短文长法，光华满大千。 六阳来复后，喷鼻味香甜。 亲授铜符卷，不怕不为仙。 诀曰：前圣金一斤，移入新鼎。 以五鼎流金，六池壬华，共三斤，混合一处养之。 火候温养，分胎一一俱同。 武火时候，切要谨慎，恐伤走神气，则前功俱废。 鼎器坚牢封固严密，则阳光自入黄金合中。 真父真母，合体传神，须用天符火候，补复还元。 金生水液，转转配合。 日足取下，抽出天魂。 伏胆矾如猫捕鼠，化铁锡如风扫云。 为圣金圣银之体万古无，更见火则红光直上，暗处似晓日光明，不与世宝相同。 七鼎 人元七鼎丹，金乌入广寒。 太极团团转，封固密更严。 乾生巽艮坤，坤生震兑乾。 神火平平入，调变要周全。 芙蓉方结果，粒粒在金盘。 照破人天镜，月食太阳肝。 七阳来复后，玄玄玄又玄。 亲授铜符卷，天上又生天。 诀曰：前圣金一斤，以六鼎壬华配七池壬花，混合一处，入鼎封固温养，火候同前。 退下六子，以伏砒霜，开气而死，至此八石归真，各有变化，铅英伏汞英，金银目下成。 秘之！ 慎之！",
      "translated_text": "**Sixth Method (of *Rényuán* Elixir):**\nTo obtain the death of cinnabar (*zhūshā*),\nFirst, the black lead (*hēiqiān*) must die.\nLead essence, one pure substance—\nCinnabar inverted, mercury flows.\n\nTake two *qiān* of the two,\nSubdue the male with one *liǎng*.\nThree days of sufficient fire—\nThe male truly dies.\n\nOne *qiān* of dead male,\nOne *liǎng* of dry mercury.\nOne *qiān* of dead mercury transforms ten *liǎng* of iron—\nEternal treasure, saving the world and aiding the perilous,\nBoundless blessings, cycle upon cycle, nurturing life.\nCycle upon cycle, life upon life.\n\n**Fourth Method (of *Rényuán* Elixir):**\nFour *dǒng* (*Rényuán* Elixir of the Four Cauldrons),\nNinety-nine times the hook and wither (*gōu wěi*) pass.\nUsing the intent of the green dust (*yì qīng āi*),\nVermilion bird (*zhūquè*) advances to the Western River.\nPurple Palace (*zǐfǔ*) and Flowered Pool (*huápí*) lengthen,\nYellow sprouts fill the Jade Field (*yùtián*).\nBalanced entry and retreat—\nWarmly nurturing the infant’s face.\n\nBone vast, spirit robust,\nConfronting frost and cold with solemnity.\nFather young, son old—\nHeaven’s Dao/Way naturally cycles.\n\nAfter the Four *Yáng* revive—\nMidway, yellow and white jade.\n**Method:**\nPrior elixir gold (one *jīn*),\nSpirit gradually lengthens,\nDiffering from before, each cauldron distinct.\nMix the Four Cauldrons’ *Rén* water (*rénshuǐ*) with Five Pools’ flowing gold (*liújīn*),\nLayering old and young.\nFire nurtures the Prior Elixir gold—\nThe method of separating the fetus (*fēntāi*),\nAs before.\nWhen the day is complete, open and take,\nWithdraw the Four Cauldrons’ clamorous dust (*xiāo chén*).\nThree *qiān* subdue the female yellow (*qí huáng*) with one *liǎng*,\nOpening *qi* to die.\nTake one *qiān* of the dead female,\nTransforming one *liǎng* of lead into silver.\nDissolve the silver,\nThen add seven *fēn* of refined female yellow (*líng qí*),\nForming superior gold of the upper color (*shàng sè*).\nWith this gold, construct the divine chamber (*shénshì*),\nNurturing eight *dàn* (*shí*), each with transformations.\n\n**Fifth Method (of *Rényuán* Elixir):**\nFive *dǒng* (*Rényuán* Elixir of the Five Cauldrons),\nEach cycle as before.\nAbandoning the divine chamber’s place (*shénfáng*),\nClouds and mists fill the mountains and rivers.\nWater tiger (*shuǐhǔ*) does not look back,\nFire dragon (*huǒlóng*) struggles to emerge from the spring.\nBalanced, step-by-step entry—\nVirtue/power (*dé*) nurtures the vast and boundless (*hàorán*).\nMercury lengthens, red as cinnabar (*hónglì*),\nLead withers, its face no longer fresh.\nThe method of extracting lead and adding mercury,\nFather and son do not pass on.\nAfter the Five *Yáng* revive—\nMoon’s shadow fills the Southern Garden.\n**Method:**\nPrior elixir gold (one *jīn*),\nSpirit gradually lengthens,\nDiffering from before, each cauldron distinct.\nMix the Five Pools’ flowing gold (*liújīn*) with Six Cauldrons’ *Rén* essence (*rénhuá*),\nLayering old and young.\nFire nurtures the Prior Elixir gold—\nThe method of separating the fetus (*fēntāi*),\nAs before.\nWhen the day is complete, open and take,\nWithdraw the Five Cauldrons’ clamorous dust (*xiāo chén*).\nThree *qiān* subdue the male yellow (*yánghuáng*) with one *liǎng*,\nOpening *qi* to die.\nTake one *qiān* of the dead male,\nTransforming one *liǎng* of mercury into iron.\nCautiously, again cautiously—\n**Method:**\nPrior elixir gold (one *jīn*),\nSpirit gradually lengthens,\nDiffering from before, each cauldron distinct.\nMix the Four Cauldrons’ *Rén* water (*rénshuǐ*) with Five Pools’ flowing gold (*liújīn*),\nLayering old and young.\nFire nurtures the Prior Elixir gold—\nThe method of separating the fetus (*fēntāi*),\nAs before.\nWhen the day is complete, open and take,\nWithdraw the Four Cauldrons’ clamorous dust (*xiāo chén*).\nThree *qiān* subdue the female yellow (*qí huáng*) with one *liǎng*,\nOpening *qi* to die.\n\n**Sixth Method (of *Rényuán* Elixir):**\nSix *dǒng* (*Rényuán* Elixir of the Six Cauldrons),\nThe hook and wither (*guān guò*) pass again.\nSprinkled in the Hall of Light (*Míngtáng*),\nPearls return to their child.\nMercury, eight hundred years old,\nStill requires half a *jīn* of lead.\nBalanced entry and retreat—\nGolden rooster (*jīnwū*) surges from the Great Abyss (*dàyuān*).\nDo not rush the *yin* talisman (*fú*),\nThe *yang* fire blazes forth.\nShortened fierce fire, lengthened gentle fire—\nRadiance fills the Great Thousand (*dàqiān*).\nAfter the Six *Yáng* revive—\nFragrant breath, sweet and refined.\n**Method:**\nPrior elixir gold (one *jīn*),\nMove into a new cauldron.\nMix the Five Cauldrons’ flowing gold (*liújīn*) with Six Pools’ *Rén* essence (*rénhuá*),\nThree *jīn* total, blend in one place.\nFire nurtures as before—\nThe method of separating the fetus (*fēntāi*), identical in all respects.\nDuring the fierce fire phase,\nExtreme caution is required,\nLest the divine *qi* be harmed and flee—\nThen all prior efforts are ruined.\nIf the cauldron is sturdy and sealed with utmost care,\nThen the *yang* light naturally enters the golden vessel.\nTrue father, true mother,\nUnited in body, transmitting spirit—\nMust use the talisman’s fire to restore and return to origin.\nGold generates water essence (*shuǐyè*),\nCycle upon cycle, blending.\nWhen the day is complete, take it down,\nExtract the celestial soul (*tiān hún*).\nSubdue arsenic (*dǎn fán*) like a cat seizing a mouse,\nTransforming iron and tin (*tiě xī*) like wind sweeping clouds.\nThe body of the Prior Elixir gold and silver is eternal—\nEven more, when exposed to fire, red light ascends,\nIn darkness, like dawn’s radiance, clear and bright,\nNot like worldly treasures.\n**Method:**\nPrior elixir gold (one *jīn*),\nMove into a new cauldron.\nMix the Five Cauldrons’ flowing gold (*liújīn*) with Six Pools’ *Rén* essence (*rénhuá*),\nThree *jīn* total, blend in one place.\nFire nurtures as before—\nThe method of separating the fetus (*fēntāi*), identical in all respects.\nDuring the fierce fire phase,\nExtreme caution is required,\nLest the divine *qi* be harmed and flee—\nThen all prior efforts are ruined.\nIf the cauldron is sturdy and sealed with utmost care,\nThen the *yang* light naturally enters the golden vessel.\nTrue father, true mother,\nUnited in body, transmitting spirit—\nMust use the talisman’s fire to restore and return to origin.\nGold generates water essence (*shuǐyè*),\nCycle upon cycle, blending.\nWhen the day is complete, take it down,\nExtract the celestial soul (*tiān hún*).\nSubdue arsenic (*dǎn fán*) like a cat seizing a mouse,\nTransforming iron and tin (*tiě xī*) like wind sweeping clouds.\n\n**Seventh Method (of *Rényuán* Elixir):**\nSeven *dǒng* (*Rényuán* Elixir),\nGolden rooster (*jīnwū*) enters Broad Cold (*Guǎnghàn*).\nThe *Tàijí* revolves in cycles,\nSealing and binding ever stricter.\n*Qián* generates *Xùn* and *Gèn*, *Kūn*;\n*Kūn* generates *Zhèn* and *Duì*, *Qián*.\nDivine fire enters balanced—\nAdjustments must be thorough.\nHibiscus (*fúróng*) begins to bear fruit,\nGrain upon grain in the golden dish.\nPiercing the mirror of human and heavenly realms (*rén tiān jìng*),\nEclipsing the moon, devouring the sun’s liver (*tài yáng gān*).\nAfter the Seven *Yáng* revive—\nMysterious, mysterious, mysterious again.\n**Method:**\nPrior elixir gold (one *jīn*),\nMix the Six Cauldrons’ *Rén* essence (*rénhuá*) with Seven Pools’ *Rén* flowers (*rénhuā*),\nBlend in one place, enter the cauldron, and seal.\nFire nurtures as before.\nWithdraw the Six children,\nSubdue realgar (*pí xiāng*), opening *qi* to die—\nThus, the eight *dàn* return to truth (*guī zhēn*), each with transformations.\nLead essence subdues mercury essence,\nGold and silver form in an instant.\n**Secret it!**\n**Caution it!**",
      "overlap_context": "ree *Yáng* revive—\nOpens as green *zhǐlián* lotus.\n\nCopper talisman, iron scroll’s intent—\n*Wútóng*’s phoenix and *luán*.\n**Method:**\nPrior elixir gold (one *jīn*),\nMix with second Pool’s pearls and third Pool’s gold liquid—\nTwo *jīn* total, blend evenly.\nLayer above and below the Holy Mother,\nSecure as before.\nGentle fire nurtures,\nChild and Mother steamed.\nFierce fire calcines,\nReturning soul, transforming bone.\nDay complete, whole cycle—\nRetain the young, discard the old,\nSecond child unused.",
      "start_char": 6744,
      "end_char": 7764,
      "start_sentence": 442,
      "end_sentence": 509,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 27.411072254180908,
      "metadata": {
        "source_file": "dao\\藏外\\铜符铁卷.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "八鼎 人元八鼎丹，飘飘月正鲜。 老蚌含珠养，明镜水晶盘。 云收天霄外，婴儿显大千。 翡翠平平入，四七运推迁。 无质是真汞，真质是真铅。 二物一斤重，日午正当天。 八阳来复后，红果绿枝颠。 这般真下手，跳出海天宽。 诀曰：前圣金一斤已成庚体，以七鼎壬花配入池紫金硫，混合一处。 火候、固济。 分胎同前。 日足取下七子，养砂千汞，灵妙无边，点化七十二石，脱凡成圣，此神火之精英。 五金八石之顽体，独此补全。 九鼎 人元九鼎丹，巍巍象帝先。 十月胎完足，九九复还乾。 造作长生匮，砂汞骨毛寒。 砂变凡为圣； 汞返圣为神。 一子经一月，过关换鼎闲。 转转铅中炼，功成不用铅。 早将阴行积，隐迹在人间。 铁卷铜符旨，秘密勿多言。 诀曰：前圣金一斤，将八鼎紫金硫，九池灵妙砂，共三斤，混合一处，温养火候法则与前俱同，不必一一拘说。 胎嚣和匮妙难言，浇淋灌注，金笋黄芽皆从此处分技接养。 三变而化金铁，瓦砾自然成宝。 圣胎九阳数足，丹母全真。 阴尽阳纯，脱胎神化。 开看内外，纯黄表里。 透彻光如水晶，似太阳初出，金星灿灿，神水汪汪，耀晃人目，五彩霞生，异香喷鼻。 红琉璃绛琥珀，乃七返九还，炼气化神。 黑金炼白金，白金成黄金，黄金为主药。 真出世之丹砂，作升天之药祖。 如要服食，悬入井中七日，消去火毒，烹成金栗，告明上帝高真，择日沐浴，晨昏向东。 以清水服之，一日一粒，百日改形换骨，自然神气相适，魂魄凝和。 三期之后，周身九窍，尽皆光明。 修丹至此，万事毕矣。 一转至九转，九九八十一磁盒封固，外用壬水流珠，上下铺盖。 阴炉温养，自有三色四样之灵药。 池池殊异，鼎鼎鲜明。 再寻至友，选择名山，建立坛宇，鼓铸神室。 上下二釜，明堂正德，俱于神丹秘范栽之。 东晋武帝在道正行，谌母出焉，真君授于吴猛，吴猛传于谢迁盛，今玉辇龙车，金冠星服，永为金阙之臣。 神方在世，付贤授德，不可轻泄慢漏咄。 神仙费尽千辛苦，到头只是炼铅金。",
      "translated_text": "---\n\n**Eight Cauldrons**\nThe *Rén* essence of the Eight Cauldrons elixir,\nFloating bright as the moon at its fullest.\nAn aged pearl-shell cradles the pearl,\nA luminous mirror, a crystal dish.\nClouds withdraw beyond the celestial void,\nThe infant reveals the Great Thousand.\nJade-like adjustments enter smoothly—\nForty-nine days of refining and transformation.\nThe formless is true mercury,\nThe true form is true lead.\nTwo substances, one *jīn* in weight,\nAt noon, when the sun stands high.\nAfter the Eight *Yáng* revive—\nRed fruits, green branches overturned.\nThus, the true method is applied,\nLeaping beyond the ocean’s vast expanse.\n**Method:**\nOne *jīn* of prior elixir gold—already formed as the *gēng* body—\nTake the Eight Cauldrons’ wulong sulfur (*wúlóng wúlóng liú*),\nThe Nine Pools’ wondrous mercury essence (*língmiào shā*),\nTogether three *jīn*, blended as one.\nNurture with fire—its method and timing as before, no need to repeat each detail.\nThe embryo’s marvel and the *gui*’s mystery are beyond words,\nPouring, drenching, nurturing—\nGolden bamboo shoots and yellow sprouts all emerge from this refining.\nThree transformations yield gold and iron,\nRubble naturally becomes treasure.\n\nThe Nine *Yáng* complete the sacred embryo,\nThe elixir mother attains full truth.\nWhen the *yīn* is exhausted and the *yáng* pure,\nThe embryo is cast off, divine transformation.\nWithin and without, all is pure gold—\nPiercing clarity like water-crystal,\nResembling the sun at its first rising,\nGolden stars radiant, divine waters vast,\nDazzling the eyes, five-colored clouds arise,\nFragrant breezes waft through the nostrils.\nRed *liúlí* and crimson amber—\nFrom seven returns and nine renewals,\nRefining *qi* to divine essence.\nBlack gold refines to white gold,\nWhite gold becomes yellow gold,\nYellow gold as the master medicine.\nTrue mercury of this world,\nUsed as the progenitor for ascending elixirs.\nIf one wishes to ingest it,\nSuspend it in a well for seven days,\nTo dissipate its fire-toxicity,\nThen cook it into golden chestnuts,\nAnd announce to the Highest Emperor of Heaven and Earth,\nChoosing a day to bathe in purity,\nFacing east at dawn and dusk.\nServe it with clear water,\nOne grain per day—\nIn a hundred days, form and bones are renewed,\nNaturally harmonizing with divine *qi* and spirit,\nSoul and vital essence unified.\nAfter three cycles,\nAll nine orifices of the body shine with light.\nBy this stage of elixir cultivation,\nAll matters are complete.\n\nOne cycle to nine cycles—\nNinety-nine, eighty-one *cíhé* (magnetic boxes) seal it tight,\nOutside with *rén* essence fluid pearls,\nLayered above and below.\nThe *yīn* furnace nurtures it,\nRevealing its three colors and four forms of divine medicines.\nPools differ distinctly,\nCauldrons radiate brilliance.\nSeek again a worthy companion,\nChoose a sacred mountain,\nBuild a hall of rites,\nAnd cast the divine chamber.\nUpper and lower double crucibles,\nThe Hall of Illumination and the Virtue of the Pure,\nAll planted within the secret range of the divine elixir.\nIn the Eastern Jin, Emperor Wu practiced the Way of Properness (*Dàozhèngxíng*),\nAnd thus the *Qīnmǔ* (elixir mother) emerged,\nThe True Lord bestowed it upon *Wú Měng*,\nWho passed it to *Xiè Qiān* and *Shèng*,\nNow riding the jade palanquin and dragon chariot,\nWearing the golden crown and celestial garments,\nForever as a subject of the Golden Gate.\n\nThe divine formula remains in the world,\nTransmitted to the worthy and bestowed upon the virtuous,\nNot to be carelessly revealed or leaked.\nThe gods and immortals toiled through countless hardships,\nOnly to refine lead and gold in the end.\n\n---",
      "overlap_context": "mysterious, mysterious again.\n**Method:**\nPrior elixir gold (one *jīn*),\nMix the Six Cauldrons’ *Rén* essence (*rénhuá*) with Seven Pools’ *Rén* flowers (*rénhuā*),\nBlend in one place, enter the cauldron, and seal.\nFire nurtures as before.\nWithdraw the Six children,\nSubdue realgar (*pí xiāng*), opening *qi* to die—\nThus, the eight *dàn* return to truth (*guī zhēn*), each with transformations.\nLead essence subdues mercury essence,\nGold and silver form in an instant.\n**Secret it!**\n**Caution it!**",
      "start_char": 7766,
      "end_char": 8542,
      "start_sentence": 510,
      "end_sentence": 555,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 11.221927881240845,
      "metadata": {
        "source_file": "dao\\藏外\\铜符铁卷.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "天元秘诀 夫神丹大药，必须于金土。 明尘过隙，皆禀于离符。 九九乾爻，六六坤策。 八两水而八两金，金水何亏。 半半清兮半半浊，云雾自契。 金一滴以清明，火一符而莹澈，口诀精专，下手的确。 仗一虎之权衡，降九龙之标格。 于以体乾坤之象，于以显日月之光。 希夷阖辟，万象自临。 准则抽添，毫厘依法。 预制法器于坛中，先办盆孟于左右。 真友执事，忠直温良。 未造神室归金鼎，且访良朋铺圣基。 龙虎拱朝，龟蛇伏翼。 依按玄科，万无一失。 具守至诚，始终无异。 何劳天上金乌降，且捉人间玉兔归。 炼出浮黎真土，产出如意宝珠。 吞食一粒霞彩冲宵。 未得之前阴德广，临炉之际不劳心。 我将三段工夫指，片言无隐付降君。 夙植道根。 不求自临。 莫把天机容易语，非人空闪丧其形。 水火直义 大丹用五会之真火。 不用凡火。 真火赖日生，黄帝将阳燧取火，阴燧难求，赤金亦可向日而取。 大抵太阳乃天之真火，其精自有，其光自现。 日日皆然，月月如是、若以木石凿拔而取，其性燥烈，非自然之意。 不若当正午火旺之时，以火镜向日取之。 借日生火，亦曰真火，故云“日魂”，以象真汞，又为真种，以足神丹之用，何必拘拘于阳燧也。 取水必赖方珠； 方珠乃是月华升上，就水结形，性是纯阴。 八月十五夜，亥子二时，当月华旺盛而取之。 除中秋之望，余月再不可取。 倘德行未周，阴功未备，未习格天之诚，必多阴雨之晦，水何由得。 纵得真水，一宵之取，能有凡何？ 养虚无神药，火在下，水有消折。 每一昼夜，抽添用水十斤之数，一年用二千五百余斤之水。 中秋一岁，不过亥子二时，焉能注二千五百余斤之水。 不得此水，不合正配日魂月魄之意，天水天火之宜。 若用凡水，又非真种，学人绝路，岂不误哉！ 今开方便之门，大显冲宵之径。 盖水者，乃月华之阴精。 天一之神水，流液俱出于神龙。 每年纯阳之四月，乃神龙变化之时，其水有灵。 大雨时行，多用磁器盛接，以物盖合，匆令尘投，以便一年之用。 未有一月而全无雨者，此亦至人变通之妙，何必拘拘于方珠也。 地脉直义 修炼金丹，当择名山福地，风阜高巍，前后包拥； 坐子向午，使金鸟玉兔，东升西没，左右轮转； 水泽尽美，竹木清奇； 龙辅叠叠于宫傍，虎翼层层于神室； 玄武隐隐于屏，朱雀行行列面； 避尘俗之往来，断常交之义友； 修成琼岛之乡，勿迩尸粪之秽； 上观天水。 下察地理；",
      "translated_text": "The **Heavenly Primordial Secret Formula**\n\nThe divine elixir, the great medicine,\nMust be sought in gold and earth.\n\nBright dust passes through the chinks,\nAll drawing from the *Lí* talisman.\n\nEighty-one *Qián* talismans,\nSeventy-two *Kūn* strategies.\n\nEight measures of water to eight measures of gold,\nHow could they be deficient?\n\nHalf pure, half turbid,\nClouds and mists naturally unite.\n\nA single drop of gold yields clarity,\nA single talisman of fire brings brilliance,\nThe oral formula must be precise,\nAnd the technique flawless in execution.\n\nLean upon the balance of the Tiger,\nAnd submit to the standard of the Nine Dragons.\n\nThus embodying the *Qián* and *Kūn* forms,\nThus displaying the radiance of the Sun and Moon.\n\nThe *Xīyí* and *Hébì* [1] manifest,\nAnd all phenomena appear in attendance.\n\nRefinement follows strict measures,\nEvery grain must adhere to the law.\n\nPrepare the ritual implements within the hall,\nAnd first arrange the basin and crucible to left and right.\n\nA true friend attends with devotion,\nLoyal, upright, gentle, and kind.\n\nBefore constructing the divine chamber, return to the golden crucible,\nAnd first visit worthy companions to lay the sacred foundation.\n\nThe Dragon and Tiger bow in reverence,\nThe Tortoise and Serpent lie in wait.\n\nFollowing the mysterious techniques,\nThere is never a single failure.\n\nMaintain unwavering sincerity,\nAnd remain steadfast without deviation.\n\nWhy need the Celestial Golden Crow descend?\nWhy not seize the Jade Hare from mortal realms?\n\nRefine the floating *Lí* [2] into true earth,\nAnd produce the wish-fulfilling gem.\n\nSwallow one grain to ascend the heavens in radiance.\nBefore attaining the boundless virtue of the *Yīn* [3],\nAt the moment of refining, no need for concern.\n\nI shall now reveal my threefold method,\nWith no word concealed—bestow it upon you.\n\nNurture the Dao’s root from early days,\nAnd it will naturally manifest in time.\n\nDo not speak lightly of heavenly secrets,\nNor let the unworthy mock its form.\n\n**Water and Fire Principles**\nThe elixir’s fire must be the **Five Convergences’ True Fire** [4].\nNot common flame.\n\nTrue fire relies on the sun’s essence;\nThe Yellow Emperor took fire with the *Yángyǐng* mirror [5],\nWhile the *Yīnyǐng* mirror is hard to obtain,\nAnd red gold can also draw fire from sunlight.\n\nIn essence, the sun is heaven’s true fire,\nIts vitality self-sustaining, its radiance self-revealing.\nEach day is so, each month likewise—\nIf fire is taken by chiseling wood or stone,\nIts nature is harsh and violent,\nNot in accord with nature’s intent.\n\nBetter to wait until noon, when fire is at its peak,\nAnd use a fire mirror to draw it from the sun.\n\nBorrowing the sun’s fire is also called **True Fire**,\nHence the term **\"Sun-Soul\"** (*Rìhún*)* [6],\nTo symbolize true mercury (*Zhēnggǒng*)* [7],\nAnd as the true seed,\nSufficient for the elixir’s divine purpose—\nWhy cling rigidly to the *Yángyǐng* mirror?\n\nWater must be drawn from the **Square Pearl** (*Fāngzhū*)* [8].\nThe Square Pearl is the moon’s luminous essence ascending,\nCondensing into shape within water—pure *Yīn*.\n\nOn the fifteenth night of the eighth month,\nBetween the hours of *Hài* and *Zǐ* [9],\nWhen the moon’s brilliance is at its height, take it.\n\nBeyond the Mid-Autumn Festival,\nNo other month suffices.\n\nIf virtue and conduct are incomplete,\nAnd *Yīn* deeds are insufficient,\nOr one has not yet practiced sincerity toward heaven,\nThen many cloudy, rainy days will arise—\nWhere will the water come from?\n\nEven if true water is obtained,\nA single night’s harvest—\nHow much could it yield?\n\nTo cultivate the void, there is no divine medicine—\nFire lies below, water is diminished.\nEach day and night,\nRefill and adjust, using ten *jīn* of water,\nA year requires over two thousand five hundred *jīn*.\n\nYet Mid-Autumn yields only two hours—\nHow could it suffice for two thousand five hundred *jīn*?\n\nWithout this water,\nThe pairing of Sun-Soul and Moon-Soul is incomplete,\nAnd heaven’s water and fire are misaligned.\nIf common water is used,\nIt is not the true seed—\nThe student is at a dead end.\nWould that not be a mistake?\n\nNow I open the door of convenience,\nAnd reveal the path to heavenly ascent.\n\nWater indeed is the moon’s *Yīn* essence,\nHeaven’s **One Primordial’s Divine Water** (*Tiānyīshénshuǐ*)* [10],\nFlowing and condensing from the **Divine Dragon** (*Shénlóng*)* [11].\n\nEach year, in the pure *Yáng* month of the fourth,\nWhen the Divine Dragon transforms,\nIts water holds power.\n\nWhen heavy rains fall, collect them in magnetic vessels,\nCover tightly, lest dust fall—\nThus securing the year’s supply.\n\nThere is no month without rain at all,\nThis too is the adept’s wondrous adaptability—\nWhy cling rigidly to the Square Pearl?\n\n**Earthly Veins Principles**\nTo refine the elixir, choose a sacred mountain,\nA blessed land of towering peaks and encircling winds;\nSit facing south, toward noon,\nSo the Golden Crow and Jade Hare\nRise in the east and set in the west,\nTurning left and right in their cycles.\n\nLakes and marshes must be pristine,\nBamboo and trees must be pure and strange.\nDragons coil in layers beside the hall,\nTigers’ wings stack in tiers within the divine chamber;\nThe **Black Tortoise** (*Xuánwǔ*)* [12] hides behind the screen,\nThe **Vermilion Bird** (*Zhūquè*)* [13] strides in orderly ranks.\n\nAvoid the passage of dust and vulgarity,\nSever ties with ordinary friends;\nCultivate the realm of the **Island of Immortality** (*Qióngdǎo*)* [14],\nAnd shun the filth of mortal remains.\n\nObserve the celestial waters above,\nAnd examine the earthly veins below.",
      "overlap_context": "Qīnmǔ* (elixir mother) emerged,\nThe True Lord bestowed it upon *Wú Měng*,\nWho passed it to *Xiè Qiān* and *Shèng*,\nNow riding the jade palanquin and dragon chariot,\nWearing the golden crown and celestial garments,\nForever as a subject of the Golden Gate.\n\nThe divine formula remains in the world,\nTransmitted to the worthy and bestowed upon the virtuous,\nNot to be carelessly revealed or leaked.\nThe gods and immortals toiled through countless hardships,\nOnly to refine lead and gold in the end.\n\n---",
      "start_char": 8555,
      "end_char": 9496,
      "start_sentence": 556,
      "end_sentence": 615,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 16.590734004974365,
      "metadata": {
        "source_file": "dao\\藏外\\铜符铁卷.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "日有奇禽而鸣，时增异兽而过； 藏经隐史，露宾生芝，方可建立丹宫。 自然仙圣降临，地神拥佑，终始无虞，多生庆幸。 宫室直义 鼎随药置，室依鼎修； 一间一鼎，三鼎三房。 高一丈六尺，阔一丈四尺。 四隅令空，重廊往行。 非齐云摘星之比，非雕梁画栋之华。 四面置窗，或闭或开。 凿顶通气，纳瑞招祥。 地平如掌，无坡无凹。 缝或堵塞，勿容邪秽。 鼎室多寡，度量施为。 每一鼎之功夫，俱合天地日月三才四时、五行七政八卦九宫十干、十二支二十四气、七十二候二十八宿，万象生成。 卦正南开门。 庖厨浴室；",
      "translated_text": "The sun’s marvelous beasts cry out at dawn,\nWhile strange creatures pass at their appointed hours.\nHidden scriptures and veiled histories,\nMushrooms spring from guests’ abandoned robes—\nOnly then may the **Alchemical Hall** (*Dāngōng*) be established.\n\nNaturally, **Dao Saints** (*Xiānshèng*) descend,\nEarthly deities gather in reverence,\nNo end to blessings, endless joy in rebirth.\nThe **Hall’s alignment** (*Gōngshì zhíyì*) is true and just—\n\nWhen the **Tripod** (*Dǐng*) follows the medicine’s placement,\nAnd the chamber conforms to the Tripod’s design:\nOne room, one Tripod,\nThree Tripods, three chambers.\nRise sixteen feet, span fourteen feet wide.\n\nLeave the four corners empty,\nDouble galleries stretch in procession.\nNot the grandeur of **Cloud-Harvesting Towers** (*Qíyún Zháixīng*) or **Carved Beams and Painted Pillars** (*Diāoliáng Huàdòng*),\nYet windows face all four directions—\nSome sealed, some open.\n\nPierce the roof to **venture the qi** (*Cǎo tóng qì*),\nInvite auspicious blessings to summon fortune.\nThe ground lies flat as a palm,\nNo incline, no depression.\nCracks or blockages—\nDo not permit foulness to enter.\n\nThe number of Tripod chambers,\nMeasure and act accordingly.\nFor each Tripod’s labor,\nAll must harmonize—\n**Heaven, Earth, Sun, Moon, the Three Talents** (*Sāncái*), **Four Seasons**,\n**Five Phases** (*Wǔxíng*), **Seven Celestial Officials** (*Qīzhèng*), **Eight Trigrams** (*Bāguà*), **Nine Palaces** (*Jiǔgōng*), **Ten Stems** (*Shí gān*),\n**Twelve Branches** (*Shí'èr zhī*), **Twenty-Four Qi** (*Èrshísì qì*), **Seventy-Two Phenomena** (*Qīshí'èr hòu*), **Twenty-Eight Constellations** (*Èrshíbā xiù*),\nAll **manifestations** (*Wànxiàng*) born in creation.\n\nThe **Trigram** (*Guà*) faces south, an entrance opened.\nThe **kitchen** (*Pú*) and **bathing chamber** (*Yùshì*).",
      "overlap_context": "and strange.\nDragons coil in layers beside the hall,\nTigers’ wings stack in tiers within the divine chamber;\nThe **Black Tortoise** (*Xuánwǔ*)* [12] hides behind the screen,\nThe **Vermilion Bird** (*Zhūquè*)* [13] strides in orderly ranks.\n\nAvoid the passage of dust and vulgarity,\nSever ties with ordinary friends;\nCultivate the realm of the **Island of Immortality** (*Qióngdǎo*)* [14],\nAnd shun the filth of mortal remains.\n\nObserve the celestial waters above,\nAnd examine the earthly veins below.",
      "start_char": 9496,
      "end_char": 9731,
      "start_sentence": 616,
      "end_sentence": 632,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 6.397890090942383,
      "metadata": {
        "source_file": "dao\\藏外\\铜符铁卷.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "稍远别造。 确守威严，如临君圣。 坛台直义 旺方取上等黄土，蒸炼筑实。 仍用塑工，务令坚固。 候至自干，勿容急迫。 坛分三层，应天地人三才。 下层高一尺二寸，开八门，门各高八寸，阔三寸，各造土门，以备启闭，仍各开路。 透台中心，虚实径五寸，亦分八角，书八卦符，水一火二木三金四土五。 上层高一尺三寸，中虚五寸，其度则圆，应天圆之意，周围一丈六尺，横径五尺三寸，图二十八宿之像，以及春夏秋冬七十二候。 台上置太乙神。 炉身高一尺六寸，四围及底，皆厚六寸。 内明堂横径七寸，高四寸，身与足通，高二尺。 自底足及盖，中虚五寸，与台心等。 造土隔于炉中，中间以盛火，基厚三寸，径厚六寸。 其炉半露半藏，台上画青龙白虎朱雀玄虎四象于上，布十二月将之圾。 屋檐之东西，则画日月，象金鸟玉兔之明。 其神炉须择黄道天德月德上吉等日，于旺方取纯黄正色之土，淘取极细，蒸曝润浸，用纸筋杵熟塑之。 再加白蟮土细沙及代赭磁石，取四化合宿吉时，起手造成阴干，然后加火煅炼，封于台上。 鼎器直义 鼎身一尺二寸，通厚一寸一分，分三级。 其唇至底，亦三级。 内明堂横径一寸六分，口唇横径七寸，下有鳌足三分。 一法用泥土，恐不坚，以九九炼净熟铁铸造，恐有漏眼，金汁不清者不用。 择五星联珠日，日月合壁日铸之。 多备以听更换，勿客苟简。 铸毕，奏告师真，置于炉内一年。 一鼎不可重用，上坎鼎入于下离鼎之内，蓄水高八寸四分。 圆一尺五十，径五寸，唇一寸二分，其腹至脐，一寸二分，用赤金造之。 坎离二鼎互相瞰入，其拔支之法，皆要细腻。 所为瞰的平稳，无丝毫缝圻，方用极熟细泥。 仍加塑工。 严密制造，不可苟为。 候干烘浊汁尽，方以金汁铸之。 坦郭直义 垣郭以安鼎，用土日取五方细土，以水飞过，经楮汁和成块。 捣炼坚熟，形如锅釜。 其高九寸，厚九分。 离鼎宽一寸九分，口略敞而圆。 土日取土，火日造之。 下塑八柱，令其一坚固。 一名丹龟，以坎离之气，归层之内。 神室直义 修炼大药，全借神室奇器。 分毫有差。 施化难矣，先造电式，熟泥塑上俟干，以辨正鼎之余，方可准厚薄宽窄，大小圆长。 依大道，用玄水如法久炼。 傍留一穴，固济停当。 用火烧成清汁，以铁杖通透，泻于模式之中。 两釜各铸，务令相合。 上乾下坤，而为中黄，变理阴阳，中虚寸余，以生灵汞，生则为玄牝，合则为太极。 铸室取金旺之月日。 三月出庚，制炼下模。 止用九池九鼎，炼就金母铸之。 净金一斤，铸成止有十五两。 既铸之后真气因大漏泄，若便入炉，恐金精结少，玉液生迟，不能变化，徒费前工。 必须用前取壬水，内外填满，多培其气，入磁鼎固之，平火温养百日，一月一换为三接气使精神完全，魂魄坚固。 百日后，方用六一泥、石膏、枯樊煅过。 代赭黄、丹赤、石脂并重罗灰粉封固口缝，银丝十字扎住。 外用圣金圣银制造包胎，重重裹定，勿令有差，雌雄子口，相合为一，形如鸡子，外圆内方。 能受天地之精灵，水火之育养。 模取圆转，土日造之，形高四寸，皆用周尺。",
      "translated_text": "「Slightly distant, another structure is built.\nFirmly uphold the **威严** (*wēiyán*—majesty and solemnity), as if facing a sovereign saint.\nThe **坛台** (*tántái*—altar platform) must be upright and just.\n\nFor the **旺方** (auspicious direction), select the finest yellow soil,\nSteam-refine and compact it into solidity.\nThen employ the **塑工** (modeling artisans) to ensure its firmness and durability.\nWait until it is thoroughly dry before proceeding, without haste.\n\nThe altar is divided into three tiers, corresponding to the **Three Talaments** (*Sāncái*—Heaven, Earth, and Man).\nThe lower tier rises **one foot two inches** (12 inches), with **Eight Gates** (*Bāmén*—eight openings),\neach gate **eight inches** high and **three inches** wide,\neach fashioned as a **土门** (*tǔmén*—earthly gate) for opening and closing,\nand each equipped with a pathway.\n\nPierce the center of the platform, leaving a hollow core **five inches** in diameter,\nalso divided into eight angles, inscribed with the **Eight Trigrams** (*Bāguà*—乾, 坤, 震, 巽, 坎, 离, 艮, 巽).\nWater is the **first**, fire the **second**, wood the **third**, metal the **fourth**, earth the **fifth**.\n\nThe middle tier rises **one foot three inches** (13 inches),\nwith a central hollow of **five inches**,\nits shape circular, aligning with the **Heaven’s Round** (*Tiānyuán*—天圆) principle,\nand a perimeter of **one foot six inches** (16 inches),\na horizontal diameter of **five feet three inches** (53 inches),\ndepicting the **Twenty-Eight Constellations** (*Èrshíbā xiù*—二十八宿),\nas well as the **Seventy-Two Phenomena** (*Qīshí'èr hòu*—七十二候) of the **Four Seasons**.\n\nPlace the **太乙神** (*Tàiyě Shén*—Grand Unity Spirit) upon the platform.\nThe furnace stands **one foot six inches** (16 inches) tall,\nwith walls and base each **six inches** thick.\nWithin, the **明堂** (*Míngtáng*—Luminous Hall) has a horizontal diameter of **seven inches** (7 inches),\nand a height of **four inches** (4 inches),\nits body continuous with its base, rising **two feet** (24 inches).\nFrom the base to the top, a **five-inch** (5 inches) hollow aligns with the platform’s core.\n\nConstruct an earthen partition within the furnace,\nleaving space for fire in the center,\nwith a base **three inches** thick and a diameter of **six inches** (6 inches).\nThe furnace must be **half exposed, half concealed**,\nwhile the platform above bears the **Four Symbols** (*Sìxiàng*—青龙, 白虎, 朱雀, 玄武),\nand the **Twelve Monthly Guards** (*Shí'èr yuè jiāng*—十二月将) are arranged below.\n\nOn the eaves’ east and west sides,\npaint the **Sun and Moon** (*Rìyuè*—日月),\nemblematic of the **金鸟玉兔** (*Jīnniǎo Yùtù*—Golden Bird and Jade Hare).\n\nThe **神炉** (*Shénlú*—Divine Furnace) must be crafted on days when:\nthe **Yellow Dao** (*Huángdào*—黄道) and **Heavenly Virtue** (*Tiāndé*—天德)\nalign with the **Monthly Virtue** (*Yuèdé*—月德),\nand the **auspicious hour** (*shàngjī*—上吉) is chosen.\nFrom the **旺方**, take **pure yellow, true-colored soil** (*zhēnghuáng zhèngsè tǔ*—正色之土),\nwash it to the finest particles,\nsteam and bake it until pliable,\nthen pound with paper-fiber pestles to mold it thoroughly.\n\nAdd **white 蟮土** (*báichángtǔ*—white serpentine soil), fine sand, and **代赭磁石** (*dàizi chíshí*—red ochre and lodestone),\ntaken at the **Four Harmonizing Hours** (*Sìhuà*—四化) and **auspicious constellational timing** (*hòu jí shí*—吉时),\nthen shape it while still damp, ensuring it sets dry.\nAfterward, fire-refine it and seal it atop the platform.\n\nThe **鼎器** (*Dǐngqì*—Cauldron Vessel) must be upright and just.\nThe cauldron’s body is **one foot two inches** (12 inches) tall,\nuniformly **one inch one fen** (1.1 inches) thick,\ndivided into three levels.\nFrom its rim to its base, it also follows three tiers.\nThe **内明堂** (*Nèi Míngtáng*—Inner Luminous Hall) has a horizontal diameter of **one inch six fen** (1.6 inches),\nwhile the rim’s diameter is **seven inches** (7 inches),\nand beneath, the **鳌足** (*Áozú*—Tortoise Feet) rise **three fen** (0.3 inches).\n\nOne method uses clay soil, but fearing it may not suffice,\ncast it instead from **nine-nine refined iron** (*jiǔjiǔ liànjìng rèn*—九九炼净熟铁),\nensuring no leaks or uncleaned pores.\nChoose a **Five Star Conjunction Day** (*Wǔxīng liánzhū rì*—五星联珠日)\nor a **Day of Solar-Lunar Unity** (*Rìyuè hébì rì*—日月合璧日) for casting.\nPrepare many to allow for replacement, avoiding hasty or careless work.\nUpon completion, announce to the **师真** (*Shīzhēn*—Master of the Dao),\nand place the cauldron within the furnace for **one year**.\n\nA single cauldron must not be reused.\nThe **坎鼎** (*Kǎn Dǐng*—Water Cauldron) is set inside the **离鼎** (*Lí Dǐng*—Fire Cauldron),\nwith water stored **eight inches four fen** (8.4 inches) high.\nThe vessel is **one foot five inches** (15 inches) in circumference,\n**five inches** (5 inches) in diameter,\nwith a rim **one inch two fen** (1.2 inches) thick,\nand its belly to navel **one inch two fen** (1.2 inches) deep,\ncrafted from **赤金** (*Chìjīn*—pure gold).\n\nThe **坎离二鼎** (*Kǎnlí Èr Dǐng*—Water and Fire Cauldrons)\nmust interlock securely,\ntheir **拔支** (*Bázhī*—protruding shafts) finely crafted.\nEnsure absolute stability and seamless alignment,\nthen apply **thoroughly dried fine clay** (*jīngrèn xì ní*—极熟细泥).\nEmploy the **塑工** once more.\nConstruct with utmost precision, avoiding any negligence.\nAfter drying and purging the **浊汁** (*zhuózhī*—impurities),\ncast with **金汁** (*Jīnzhī*—golden liquid).\n\nThe **坦郭** (*Tǎn Guō*—Flat Enclosure) must be upright and just.\nThe **垣郭** (*Yuánguō*—surrounding walls) secure the cauldron,\nusing soil gathered from the **Five Directions** (*Wǔfāng*—五方),\nrefined by water-filtration (*fēiguò*—飞过),\nand kneaded with *lù* paste into solid blocks.\nPound and refine until firm and mature,\nits form resembling a **锅釜** (*guōfǔ*—cauldron or pot).\nIts height is **nine inches** (9 inches),\nits thickness **nine fen** (0.9 inches).\nThe **离鼎** (*Lí Dǐng*—Fire Cauldron) is **one inch nine fen** (1.9 inches) wide,\nits mouth slightly open and rounded.\nGather soil on **土日** (*Tǔrì*—Earth Day),\nand cast it on **火日** (*Huǒrì*—Fire Day).\nBelow, model **eight pillars** (*Bāzhù*—八柱),\nensuring their absolute firmness.\nAnother name for this is **丹龟** (*Dānguī—Cinnabar Tortoise*),\nits **坎离之气** (*Kǎnlí zhīqì*—Water and Fire Qi)\nconverging within its layers.\n\nThe **神室** (*Shénshì*—Divine Chamber) must be upright and just.\nRefining the **Great Elixir** (*Dàyào*—大药) relies entirely on the **奇器** (*Qíqì*—wondrous vessels) of this chamber.\nEven a slight deviation in measurement\nposes great difficulty in alchemical transformation.\nFirst, construct the **电式** (*Diànshì*—Lightning Mold),\nmodeling it with thoroughly dried fine clay,\nthen use its precision to gauge the cauldron’s proportions—\nheight, thickness, width, and circularity.\n\nFollow the **Great Dao** (*Dàdào*—大道),\nemploying **玄水** (*Xuánshuǐ*—Mysterious Water) as prescribed,\nand refine it over a long duration.\nBeside it, leave a **穴** (*xué*—cavity),\nensuring the **固济** (*Gùjì*—stable alchemical process) is properly set.\nBurn with fire until a **清汁** (*qīngzhī*—pure liquid) forms,\nthen pierce with an iron rod to drain it into the mold.\nCast two vessels separately, ensuring they fit perfectly together.\n**乾 above, 坤 below**,\nforming **中黄** (*Zhōnghuáng*—Central Yellow),\ntransforming **阴阳** (*Yīnyáng*—Yin and Yang) principles.\nLeave a **one-inch** (1 inch) hollow in the center,\nwhere **灵汞** (*Línggǒng*—Spiritual Mercury) generates—\nwhen formed, it becomes the **玄牝** (*Xuánpìn*—Mysterious Female),\nand when united, it becomes the **太极** (*Tàijí*—Supreme Pole).\n\nCraft the **铸室** (*Zhùshì*—Casting Chamber) during **金旺** (*Jīnwàng*—Metal Auspicious) days and months.\nOn the **third month’s 庚日** (*Gēngrì*—Geng Day),\nprepare and cast the lower mold.\nUse only the **九池九鼎** (*Jiǔchí Jiǔdǐng*—Nine Pools and Nine Cauldrons),\nand cast the **金母** (*Jīnmǔ*—Metal Mother).\nRefine **one catty of pure gold** (*jìngjīn yījīn*—净金一斤),\nuntil the casting yields only **fifteen taels** (*shíyǒu*—十五两).\n\nAfter casting, the **真气** (*Zhēngqì*—True Qi) leaks severely,\nand if the cauldron is immediately placed in the furnace,\nthe **金精** (*Jīnjīng*—Gold Essence) may solidify too soon,\nwhile the **玉液** (*Yùyè*—Jade Fluid) develops tardily,\nrendering transformation impossible—\nall prior labor would be wasted in vain.\nInstead, use **壬水** (*Rénshuǐ*—Ren Water) gathered beforehand,\nfilling the cauldron internally and externally,\nand nurturing its Qi abundantly.\nThen place it in the **磁鼎** (*Cídǐng*—Magnetic Cauldron) to solidify,\nusing **平火** (*Pínghuǒ*—gentle flame) to temper and nourish for **one hundred days**.\nEach month, replace the water **three times** (*sānjiēqì*—三接气),\nuntil the spirit is fully complete and the essence firmly established.\n\nAfter one hundred days,\nuse **六一泥** (*Liùyīní*—Six-to-One Clay),\n**石膏** (*Shígāo*—gypsum),\n**枯樊** (*Kūfán*—dried mulberry bark) calcined,\n**代赭黄** (*Dàizi huáng*—red ochre yellow),\n**丹赤** (*Dānchì*—cinnabar red),\n**石脂** (*Shízhī*—mineral pitch),\nand **重罗灰粉** (*Chóngluó huīfěn*—double-sifted ash powder)\nto seal the mouth’s fissures,\nbinding it with **十字扎** (*Shízì zhā*—cross-woven silver threads).\n\nExternally, use **圣金** (*Shèngjīn*—Sacred Gold) and **圣银** (*Shèngyín*—Sacred Silver)\nto craft a protective **包胎** (*Bāotāi*—outer casing),\nwrapping it layer upon layer,\nensuring no deviation.\nThe **雌雄子口** (*Cíxióng zǐkǒu*—female and male orifices)\nmust align perfectly,\nits form resembling a **鸡子** (*Jīzǐ*—chicken egg)—\n**outerly round, inwardly square**.\n\nThus, it can receive the **精灵** (*Jīnglíng*—Essential Spirits) of Heaven and Earth,\nand the **育养** (*Yùyǎng*—nourishment) of Water and Fire.\nThe mold is crafted from **圆转** (*Yuánzhuǎn*—circularly turned clay),\ncast on **土日** (*Tǔrì*—Earth Day),\nits height **four inches** (4 inches),\nall measurements taken with the **周尺** (*Zhōuchǐ*—standardized ruler).",
      "overlap_context": "asons**,\n**Five Phases** (*Wǔxíng*), **Seven Celestial Officials** (*Qīzhèng*), **Eight Trigrams** (*Bāguà*), **Nine Palaces** (*Jiǔgōng*), **Ten Stems** (*Shí gān*),\n**Twelve Branches** (*Shí'èr zhī*), **Twenty-Four Qi** (*Èrshísì qì*), **Seventy-Two Phenomena** (*Qīshí'èr hòu*), **Twenty-Eight Constellations** (*Èrshíbā xiù*),\nAll **manifestations** (*Wànxiàng*) born in creation.\n\nThe **Trigram** (*Guà*) faces south, an entrance opened.\nThe **kitchen** (*Pú*) and **bathing chamber** (*Yùshì*).",
      "start_char": 9731,
      "end_char": 10930,
      "start_sentence": 633,
      "end_sentence": 694,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 38.83174467086792,
      "metadata": {
        "source_file": "dao\\藏外\\铜符铁卷.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "符镜直义 八方悬镜，各径尺二。 靠屋面鼎，四隅挂剑，其镜剑铸，造及出没。 已亥正三刻，预入各职。 威守寂静，当如对待神明。 用洁净黄袱包裹，安于圣真位前、晨昏奏祝。 至土临官帝旺日，一阳初生，安于丹室。 金鼎左右，峙立五岳。 先炼五色土，塑五岳形神俟干，王鼎底平镇如岳，封固鼎缝，逐日祭告。 至运行水火，各尽乃职。 陈设直义 创建丹房，造坛筑垣，立鼎安炉，感择土旺日时。 悬三元宝照，以祛妖邪。 插剑四隅以镇鬼神。 宝照，即镜也。 天照用甲子方，乃六六首阳之日。 取黄道神，在金石合成日，方铸明堂，时大妙。 地照用壬子日，太阳望中取时铸。 人照用丙子日，太阳望正中时铸。 各径过二尺四寸。 剑用霜降日，造古剑尤妙。 符简四片，太乙降宫时铸，金石合日亦可。 四方符篆，五彩旗号，并有规律。 旗准五方之色，各长二尺。 紧于镜照之下，及重屋之顶。 其十二元辰符，铁简符四壁符，三台符，八卦待，老君镇坛符，二十人宿符，及金乌玉兔四象图，以上符篆，诸经史书中，皆有载之者。 每宫之内，供奉丹主周天妙化真人，九阳威德济生度死真人，日宫太阳火德星君，月宫大阴水德星君，太乙主宰高上帝师元君，十二元辰本命星君，正一龙虎玄坛赵天君，飞捷报应诸天使者，传经演教历代仙师，丹房通事，土地正神。 依法面鼎，每日十二时，香盘轮换，灯烛勿绝。 火盘靠东北隅，用铜造，等称以定．火数须用熟炭，庶无惊爆之患。 水盘靠西南隅，造八株杓添水。 抽水盂盛已用之水，添水孟盛蓄未用之水。 每宫之内，用二友，可水火铜壶报刻。 乃抽乃添，须准八门法遁三奇。 在天禽时起手，乃推阴阳二遁。 推九天在震宫刚挂东方符，悬镜一面于屋之东，上垂丝于东镜之下。 推九天在巽宫，刚挂东南隅符，悬镜一面于东南隅。 余六方以例推之。 中央黄彩，却取天德黄道，与月德合日，子时正一刻垂于屋之中顶。 其四方符篆，于四七合宿日安之，并宜奏告元君，天使证盟。 洁净直义 凡修大丹，先还淫欲，戒杀生，行慈善，致斋沐，洁净身心。 方登坛安设祖师神位，香灯供义，祈祷恳求，以祈神明保助。 待一阳来复之月，一阳生时，依法起工。 甚忌僧尼妇女鸡犬秽浊，如或有违，神明恶之，丹道难成。 每日真友司祭，考其功过。 关防户窗，铜壶昝影。 司财掌膳，典水典大。 侍香奏白，踏罡布斗。 科其勤惰，动静不苟，和气从容。 绝发折齿，歃血结盟，立誓于雷将案下，共修物外之丹砂，同结逍遥之大会。 他日功成，齐登碧落。 卦象直义 天地变化，本于阴阳。 阳变阴合，起于乾坤。 乾卦用九，坤卦用六，各有六爻。 乾爻六九，为策五十有四； 坤爻六六，为策三十有六； 合四时而倍之。 故易曰：乾之策二百一十有六，坤之策一百四十有四，凡三百六十当期之日。 盖阴阳起伏生成朔望，万物之大数也。 圣人促年于月，促月于日，促日于时，每一时于二十四气分是二气，于七十二候分得六候。 自子至巳，是冬至后夏至前； 自午至亥，是夏至后，冬至前。 修炼大药于十二时辰，进退阳火阴符各吐寒暄气候。 运入中宫神室，互生变化，产毓真精。 每昼夜二卦直符，一年则七百二十卦，总计四千三百二十爻，应四千三百二十年之气候，是知时辰之内，符火进退，夺四千三百二十年正气，归于神鼎之中。",
      "translated_text": "**符镜直义**\nEight mirrors hang in the cardinal directions, each twelve *chi* in diameter.\nLeaning against the house’s cauldron-altar, four swords are suspended at the corners—\nthe mirrors and swords forged at their rising and setting.\n\nAt the third watch of the *Yǐhài* hour, each attends to their duties in advance.\nMaintain solemn stillness, as though facing deities.\n\nWrap them in pure yellow silk, placing them before the Sacred True Position,\nreciting morning and evening salutations.\n\nWhen the Earthly Branch *Tǔ* aligns with the Heavenly Stem *Líng* and the Emperor’s day of power,\nat the first stir of *Yīnyáng* (one *yang*’s birth),\ninstall them in the Elixir Chamber.\nTo the cauldron’s left and right, erect the Five Sacred Peaks.\n\nFirst, refine the five colored soils, molding the Five Peaks’ forms and spirits until dry.\nFlatten the King’s Cauldron’s base like a mountain, sealing its seams,\nthen daily offer sacrifices.\n\nWhen the Water and Fire circulate, each fulfills its role.\n\n---\n\n**陈设直义**\nConstruct the Elixir Hall, build the altar platform, erect the cauldron, and install the furnace,\nchoosing auspicious earth and timing.\n\nHang the Three Celestial Treasures (mirrors) to dispel malevolent forces.\nInsert swords at the four corners to subdue spirits.\n\nThe *Treasure Mirrors* are mirrors:\n- *Heaven’s Mirror* cast on *Jiāzǐ* days (the first *yang* of the *liúliú* cycle),\n  forged when *Yellow Dao* aligns with metal and stone—\n  the *Mingtáng* (Bright Hall) is then cast at the hour of great perfection.\n- *Earth’s Mirror* cast on *Rénzǐ* days, at the midpoint of the solar term.\n- *Human Mirror* cast on *Bǐngzǐ* days, at the solar term’s exact center.\nEach exceeds twenty-four *cùn* in diameter.\n\nSwords are forged on *Shuāngjiàng* (Frost’s Descent) days,\nwith ancient blades being most auspicious.\n\nFour talismanic slips, cast when *Tàiyǐ* descends to the palace or on metal-stone days.\nThe four-directional talismanic seals and five-colored banners follow strict patterns—\nthe banners match the Five Directions’ hues, each two *zhàng* long,\ntightened beneath the mirrors and atop the layered roofs.\n\nThe Twelve Celestial Stems’ talismans, iron-strip talismans, four-wall talismans,\nthe Three Platforms’ seals, the Eight Trigrams’ array,\nLaozi’s Blockade-Talisman, the Twenty-Eight Constellations’ symbols,\nand the Four Symbols (Metal Rooster, Jade Hare)—\nall these talismans appear in the scriptures and histories.\n\nWithin each palace, enshrine:\n- The Elixir Master, *Zhōutiān Mièhuà Zhēnrén* (True Person of Heaven’s Transcendent Transformation),\n- *Jiǔyáng Wēidé Jìshēng Dùsǐ Zhēnrén* (True Person of the Nine Suns’ Virtue, Saving Life and Death),\n- The *Day Palace’s* Taiyang Fire Virtue Star Lord,\n- The *Moon Palace’s* Dayuan Water Virtue Star Lord,\n- *Tàiyǐ Zhǔzǎi Gāoshàng Dìshī Yuánjūn* (Highest Imperial Teacher, Sovereign of the Supreme Dao),\n- The Twelve Celestial Stems’ Native Star Lords,\n- *Zhèngyī Lónghǔ Xuántán Zhào Tiānjun* (Heavenly Lord Zhao of the Orthodox Dragon-Tiger Mystic Platform),\n- The Swift Messengers of the Celestial Hosts,\n- The Transmitting Masters of Scripture and Teaching across generations,\n- The Elixir Hall’s Attendants, and the Local Land and City Deities.\n\nFacing the cauldron, at each of the twelve hours,\nrotate the incense trays; never extinguish the lamps.\n\nPlace the Fire Tray in the northeast corner, forged in copper,\nweighed precisely to determine its measure.\nUse seasoned charcoal for the fire to avoid explosions.\n\nPlace the Water Tray in the southwest corner, with eight ladles for adding water.\nA *looking basin* holds used water; a *filling basin* holds reserved water.\n\nWithin each palace, employ two assistants to manage water, fire, and the copper hourglass,\nadding and drawing water according to the *Bāmén* (Eight Doors) evasive method and *Sānqí* (Three Odds).\n\nWhen *Jiānshí* (Heavenly Birds) begins, cast the *Yīnyáng Èrduàn* (Two Evasions).\nIf *Jiǔtiān* (Nine Heavens) aligns with the *Zhen* trigram, hang an eastern talisman\nand suspend one mirror on the east, with a thread dangling beneath it.\nIf *Jiǔtiān* aligns with the *Xùn* trigram, hang a southeast talisman\nand suspend one mirror in the southeast corner.\nThe remaining six directions follow similarly.\n\nThe central yellow talisman is hung when *Tiāndé* (Heaven’s Virtue) aligns with *Yuèdé* (Lunar Virtue)\nat the first moment of the *Zǐ* hour, suspended from the roof’s center.\n\nThe four-directional talismans are installed on *Sìqī* (Four-Sevens) days,\nwhile also offering prayers to the Primordial Lord and swearing oaths before the Celestial Messengers.\n\n---\n\n**洁净直义**\nBefore refining the Great Elixir, curb lust, abstain from killing,\npractice benevolence, observe fasts and purifications,\ncleansing body and mind.\n\nOnly then ascend the platform, arrange the Patriarchal deities’ positions,\noffer incense and lamps, and pray earnestly for divine aid.\n\nAwait the month of *Yīnyáng Lái Fù* (Return of One *Yang*) and its birth hour,\nthen proceed according to ritual.\n\nAvoid monks, nuns, women, chickens, and dogs—impurities that invite divine wrath\nand hinder elixir success.\n\nEach day, the true disciples perform rites, assessing merit and fault.\nSecure doors and windows; use the copper hourglass for timing.\nOne oversees finances and meals; another manages water and the Great Furnace.\nAttendants chant incense and report; others tread the *Gāng* (Hexagram) and arrange the *Dǒu* (Cauldron).\n\nReward diligence, punish laziness—neither movement nor stillness is careless.\nWith harmonious *qi*, proceed unhurried.\n\nAvoid cutting hair or breaking teeth; swear blood oaths at the *Léijiāng* (Thunder Official’s) desk,\nvowing to refine the transcendent cinnabar together,\nand attain the Immortal’s Free Assembly.\n\nOn completion, ascend to the Jade Empyrean.\n\n---\n\n**卦象直义**\nHeaven and Earth transform through *Yīnyáng*.\n*Yáng* transforms, *Yīn* unites—rooted in *Qián* and *Kǔn*.\n\n*Qián* uses nine; *Kǔn* uses six—each with six lines.\n*Qián*’s six nines yield fifty-four strategies;\n*Kǔn*’s six sixes yield thirty-six strategies.\nDoubled across the four seasons, they total:\n*Qián*’s two hundred sixteen, *Kǔn*’s one hundred forty-four—\nthree hundred sixty, marking the solar cycle.\n\nThe Sage condensed years into months, months into days, days into hours,\ndividing each hour into two *qì* (energetic phases) of the twenty-four *jì*,\nor six *hòu* (phenological stages) of the seventy-two *hòu*.\nFrom *Zǐ* to *Sì*: winter solstice to summer solstice;\nfrom *Wǔ* to *Hài*: summer solstice to winter solstice.\n\nRefining the Great Elixir across the twelve hours,\nadvancing and retreating *Yánghuǒ* (Yang-Fire) and *Yīnfú* (Yin-Talismans),\nexhaling cold and warm breaths.\n\nChanneling into the Central Palace’s Divine Chamber,\nmutual generation and transformation produce True Essence.\n\nEach day and night, two talismanic hexagrams align—\nseven hundred twenty hexagrams in a year,\nfour thousand three hundred twenty lines total,\ncorresponding to four thousand three hundred twenty years of cosmic *qì*.\nThus, within each hour, the talismanic fire advances and retreats,\nseizing the pristine *qì* of four thousand three hundred twenty years\nand returning it to the Divine Cauldron.",
      "overlap_context": "g zǐkǒu*—female and male orifices)\nmust align perfectly,\nits form resembling a **鸡子** (*Jīzǐ*—chicken egg)—\n**outerly round, inwardly square**.\n\nThus, it can receive the **精灵** (*Jīnglíng*—Essential Spirits) of Heaven and Earth,\nand the **育养** (*Yùyǎng*—nourishment) of Water and Fire.\nThe mold is crafted from **圆转** (*Yuánzhuǎn*—circularly turned clay),\ncast on **土日** (*Tǔrì*—Earth Day),\nits height **four inches** (4 inches),\nall measurements taken with the **周尺** (*Zhōuchǐ*—standardized ruler).",
      "start_char": 10932,
      "end_char": 12218,
      "start_sentence": 695,
      "end_sentence": 760,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 21.49884819984436,
      "metadata": {
        "source_file": "dao\\藏外\\铜符铁卷.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "大抵火候之数，以乾坤坎离四卦为体，余六十卦爻为用。 爻止三百六十，一爻为一星，一星准一铢。 子行阳火三十六铢，二十四铢为一两，余十二铢为半两。 是知子时，得阳火一两半，前六时属阳。 其数得九，阳火则进九两也，总计二百一十六体。 其余少阳少阴，五日之数，不在正例。 阴符者，自午至亥，皆属阴，其爻亦减止一百四十四铢其数得六。 六为老阴之策。 午退阴符二十四爻，一爻为一铢，二十四铢为一两。 是知六阴时，得火亦六两也，总一百四十四铢。 前六阳时得九，后六阴时得六，阳九阳六之机，于斯尽矣。 总三百六十支，合神室一斤之体用。 今九六止一十五两，余乾坤二卦为鼎器，坎离二卦为药物。 该二十四爻，为一两之数也。 凡后学修炼大丹，遵明师旨，火是药之父母，药是火之子孙，口口相传，。 心心相授，惟专于火。 逊曰：神室一斤，火数亦一斤，二物不可偏废。 今火只十五两，又何为哉？ 元君曰：鼎中修炼火符之进退，按天上月华之盈亏。 故一日有十二时，一年有十二月，一时即一月，以上七日半为春，中下七日半为夏，为发生之气； 其后中七日半为秋，下七日半为冬，为杀伐之气； 故火止十五两，以按月华光满之正数。 若加一两则大阴过宫，以临阴乡丧魂之位，传药不传火。 火候真机，尽于九六之数，子于宴处，其致思焉。 沐浴直义 夫炼丹之法足以周岁，止有十月丹成者，何也？ 盖因二八之月，各有停息。 二月属兔，阳气方盛，阴气初萌，榆荚始落之候，止卯木之火，而益水安全也。 八月属鸡，阴气方盛，阳气初萌，荠麦渐生之候，止酉金之水，而增火安胎也。 修炼大丹，必用乎火，大准卦爻斯定其数。 不然，则失其多寡之日。",
      "translated_text": "The fundamental count of the talismanic fire aligns with the four hexagrams of **乾 (Qián, Heaven)**, **坤 (Kūn, Earth)**, **坎 (Kǎn, Abyss)**, and **离 (Lí, Flame)** as its core, while the remaining sixty hexagrams serve as its application. The lines total **三百六十 (sānbǎiliù, three hundred sixty)**, each line representing one star, each star corresponding to one *铢 (zhū, grain)*. At the hour of **子 (Zǐ)**, the Yang-Fire advances **三十六铢 (sānlìzhū, thirty-six grains)**, with **二十四铢 (èrshísìzhū, twenty-four grains)** constituting one *两 (liǎng, ounce)*, and the remaining **十二铢 (shí'èrzhū, twelve grains)** as half an ounce. Thus, in the hour of **子**, one attains **Yang-Fire** of one and a half *两*, the first six hours belonging to Yang. Its total count reaches nine, and so the Yang-Fire advances nine *两* in sequence, amounting to **二百一十六体 (èrbǎiyīshíliù tǐ, two hundred sixteen lines)**.\n\nThe remaining **少阳 (Shàoyáng, Lesser Yang)** and **少阴 (Shàoyīn, Lesser Yin)** counts, spanning five days, do not fall under the standard reckoning. The Yin-Talismans, from **午 (Wǔ)** to **亥 (Hài)**, all belong to Yin, their lines also diminishing to **一百四十四铢 (yībǎisìshízhū, one hundred forty-four grains)**, totaling six. Six marks the strategy of **老阴 (Lǎoyīn, Elder Yin)**.\n\nAt **午 (Wǔ)**, the Yin-Talismans retreat **二十四爻 (èrshísìyáo, twenty-four lines)**, each line as one *铢 (zhū, grain)*, twenty-four grains making one *两 (liǎng, ounce)*. Thus, in the six Yin-hours, one attains fire of six *两*, totaling **一百四十四铢 (yībǎisìshízhū, one hundred forty-four grains)**. The first six Yang-hours yield nine, the latter six Yin-hours yield six—the interplay of **Yang-nine and Yang-six** is thus complete.\n\nIn sum, **三百六十支 (sānbǎiliùzhī, three hundred sixty branches)** coalesce into the **神室 (Shénshì, Divine Chamber)**’s one *斤 (jīn, catty)* in essence and application. Now, nine and six total **十五两 (shíwǔliǎng, fifteen ounces)**, while **乾 (Qián, Heaven)** and **坤 (Kūn, Earth)** serve as the **鼎器 (Dǐngqì, Cauldron Vessels)**, and **坎 (Kǎn, Abyss)** and **离 (Lí, Flame)** as the **药物 (Yàowù, Medicinal Substances)**. The **二十四爻 (èrshísìyáo, twenty-four lines)** correspond to one *两 (liǎng, ounce)*.\n\nFor those who follow in refining the Great Elixir, adhering to the Master’s intent: fire is the parent of the elixir, the elixir the offspring of fire. Passed down from mouth to mouth, from heart to heart, one must focus solely on fire.\n\n**逊 (Xùn)** said: *\"The Divine Chamber holds one catty, and the fire’s count also equals one catty—neither may be neglected. Now the fire is only fifteen ounces, what then is its purpose?\"*\n\n**元君 (Yuánjūn, Primordial Lord)** replied: *\"The advancement and retreat of talismanic fire within the Cauldron follow the waxing and waning of the lunar light in the heavens. Thus, a day has twelve hours, a year has twelve months, each hour mirroring a month. The first seven and a half days are spring, the latter seven and a half are summer—the breath of generation; the middle seven and a half days are autumn, the last seven and a half are winter—the breath of destruction. Hence, fire is limited to fifteen ounces, aligning with the exact count of the moon’s full radiance. If one adds an ounce, the Elder Yin oversteps its domain, invading the Yin-lands and causing the soul to perish—fire is transmitted, but not the elixir.\"*\n\nThe true mechanism of talismanic fire lies within the interplay of nine and six. In the hour of **子**, the fire is at its peak—contemplate its intent. Ritual purity is the direct path.\n\nNow, the method of refining the elixir suffices for a year, yet only **十月 (shíyuè, the tenth month)** yields the completed elixir—why so? It is because in the **二八 (èr-bā, second and eighth)** months, each has its own pause and respite.\n\nThe **二月 (èr yuè, second month)**, ruled by the **兔 (tù, Hare)**, sees Yang-*qi* flourishing while Yin-*qi* first emerges—at the time when **榆荚 (yújiá, elm seeds)** begin to fall, one restrains the **卯木 (mǎo mù, Wood of the Hare)** fire and augments the **水 (shuǐ, Water)** to ensure safety. The **八月 (bā yuè, eighth month)**, ruled by the **鸡 (jī, Rooster)**, sees Yin-*qi* flourishing while Yang-*qi* first emerges—at the time when **荠麦 (jìmài, bittercress and millet)** gradually sprout, one restrains the **酉金 (yǒu jīn, Metal of the Rooster)** water and enhances the **火 (huǒ, Fire)** to secure stability.\n\nIn refining the Great Elixir, one must rely on fire, and the standard of hexagram lines determines its exact count. Otherwise, the days of its proper measure will be lost.",
      "overlap_context": "ling into the Central Palace’s Divine Chamber,\nmutual generation and transformation produce True Essence.\n\nEach day and night, two talismanic hexagrams align—\nseven hundred twenty hexagrams in a year,\nfour thousand three hundred twenty lines total,\ncorresponding to four thousand three hundred twenty years of cosmic *qì*.\nThus, within each hour, the talismanic fire advances and retreats,\nseizing the pristine *qì* of four thousand three hundred twenty years\nand returning it to the Divine Cauldron.",
      "start_char": 12218,
      "end_char": 12878,
      "start_sentence": 761,
      "end_sentence": 791,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 17.233469486236572,
      "metadata": {
        "source_file": "dao\\藏外\\铜符铁卷.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "火虽有十五两之进，至百日方透金鼎之中。 微微有形，孕生金液。 外炼一鼎，过百日后，开看金液如何。 或如灯花云朵，五象俱足，告明上帝高真，取服一九，服之百日，聚精累气，接命延年。 仍温养至周天数足，十月功完，无质生质，结成泰米玄珠，方为灵药。 一鼎灵汞，服之则永固形骸也。 诸友愈加精勤修，直至三年神丹，九年白雪，十二神符，瓦砾成金，枯骨成人，形神俱妙，万德周全，花开果熟，游赏太清。 汝宜珍重，三卷灵文，言穷意尽，吾返玉京。",
      "translated_text": "The fire, though advancing by fifteen *liang* at a time, only after a hundred days penetrates the core of the golden cauldron. Subtle yet taking form, it gestates the golden elixir.\n\nAfter refining one cauldron externally for over a hundred days, open it to observe the golden elixir—whether like a lamp’s blossom or cloud formations, with the five *xiàng* (symbols) fully manifest, announcing to the Supreme Emperor and High Immortals. Take and ingest one *jiǔ* (ninth), and after a hundred days of gathering essence and accumulating *qi*, prolonging life and extending years.\n\nStill, nurture it warmly until the full cycle of the Microcosmic Orbit is complete. When ten months of work are fulfilled, without substance generating substance, forming the *Tāi* (Great Harmony) rice and mysterious pearl, only then is it the true elixir.\n\nOne cauldron of refined *línggǒng* (spirit-mercury), when ingested, will forever solidify the form.\n\nAll friends should redouble their diligence in cultivation, until the three-year spirit-elixir, the nine-year white snow, the twelve divine talismans, when rubble turns to gold and withered bones become flesh—form and spirit both perfected, all virtues complete. Flowers bloom, fruit ripens, and one wanders in delight through the Supreme Clarity.\n\nYou should treasure these three volumes of sacred scripture, for their words are exhaustive and their meaning complete. I now return to the Jade Capital.",
      "overlap_context": "e safety. The **八月 (bā yuè, eighth month)**, ruled by the **鸡 (jī, Rooster)**, sees Yin-*qi* flourishing while Yang-*qi* first emerges—at the time when **荠麦 (jìmài, bittercress and millet)** gradually sprout, one restrains the **酉金 (yǒu jīn, Metal of the Rooster)** water and enhances the **火 (huǒ, Fire)** to secure stability.\n\nIn refining the Great Elixir, one must rely on fire, and the standard of hexagram lines determines its exact count. Otherwise, the days of its proper measure will be lost.",
      "start_char": 12878,
      "end_char": 13083,
      "start_sentence": 792,
      "end_sentence": 799,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 4.00612735748291,
      "metadata": {
        "source_file": "dao\\藏外\\铜符铁卷.txt",
        "category": "藏外"
      }
    }
  ]
}