{
  "source_id": "阴符经玄解正义",
  "source_file": "chunked_daozang\\阴符经玄解正义.json",
  "total_chunks": 14,
  "total_original_chars": 15621,
  "total_translated_chars": 90344,
  "total_translation_time": 275.1979777812958,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\藏外\\阴符经玄解正义.txt",
    "category": "藏外"
  },
  "full_translation": "**\"The Profound Explication of the *Yin Fu Jing* – Rectified by Ming Yi’s *Return to One* Annotation**\n\nThe *Yin Fu Jing*’s *Profound Explication* (*Xuan Jie*) was composed by **Fan Yizhong**, yet its name belies its adherence to orthodox meaning—its errors are not slight. Thus, I expound the original text’s true intent to correct them.\n\nI too fear the punishment of idle chatter, yet *Yin Fu Jing* has been annotated by tens of scholars, each offering profound interpretations. How dare I presume to assert correctness while my own understanding remains shallow?\n\nMy late master, **Tai Xu Master**, left behind a clay bead text by **Li Zhenren**, titled *Three-in-One Resonance Symbols* (*San Yi Yin Fu*). Later, he appended a note:\n\n*\"The *Yin Fu Jing* is a single scripture from the **Kongtong** lineage, not to be spoken aloud, nor grasped by the mind alone. I once received instruction from **Er Wu Dao Ren**, but though his words were close, his claim that the Great Dao was already contained left me unsettled. For years, I pondered and re-examined it.\n\nOne day, **Li Zhenren’s teacher** arrived from afar and told me: ‘What I first heard was **Xing Xian’s** interpretation—his meaning conveyed through the text. The essence lies in transcending traces to grasp the profound. Only then will you attain it.\n\nRecently, I heard of **Mu Ji’s** *Unveiling the Secrets of the *Yin Fu Jing***, yet his words fail to universalize the heart’s connection. The *Yin Fu Jing*’s true lineage was transmitted by the **Laozi** to the Western Regions. When **Bodhidharma** returned to China, he transmitted it once more—this is the **secret transmission beyond worldly teachings**, the marvelous principle of **mind is Buddha, form is emptiness**.\n\nOur sect’s founder, **Zhang Chun Zhenren**, embodied and practiced it. His Dao descended from **Huolong Zhenren**, then **Chongyang Wang Zu**. In his later years, **Wang Zu** heard it and verified it with **Chunyang Lu Zu**. **Lu Zu** said: ‘The scripture’s profound essence lies in **observing Heaven and holding Heaven** (*guan tian zhi tian*). Adapt according to circumstances, act when the moment aligns. Its core secret is the **harmony of sun and moon** (*ri yue yi jie*).\n\n**Yin and Yang** differ in essence, yet their foundation diverges—each has marvelous applications in the **foolishness of the sage** (*yu ren yi jie*). It unfolds a fresh perspective, piercingly lucid at every touch, all converging in the **return to the source** (*gui yuan yi miao*) within humanity’s **harmony** (*ren yi jie*).\n\nDelving into its awakening and heart-transmission, the key lies in the **‘not’** (*bu*). The ultimate secret is found in the scripture’s final passage—all is derived from **ultimate stillness within the void** (*xu ji ding du*). Yet its initial approach is **stillness** (*jing*), and its culmination in **central balance** (*zhong he*) rests on the **‘kill’** (*sha*, *killing*—as in *nei sha*).\n\nFurther, nurture within the final **‘strange vessel’** (*qi qi*)—this is the ultimate path to sainthood. The sage’s method lies in **the Dao not being external to the body**, refining it into a **divine dwelling** (*shen she*). When active, it moves like **cranes in flight and fish in leaps**; when still, it is **silent as the ten thousand sounds cease**. The **True One** (*zhen yi*) returns to **original essence** (*chang zhen yuan*), and no longer is there ‘I’ or ‘divine dwelling’—**tranquility** (*jing*) is achieved.\n\nYet **obstacles** (*ni e*) remain unrefined. Thus, gather **precision** (*ji*) and **divinity** (*shen*), concentrate in the **void** (*xu wei*), and let the **True One** (*zhen yi*) permeate your body. **Fuse** (*hun he*) the **Three Talents** (*san cai*), awaiting the moment when **form vanishes into emptiness** (*se xiang yu xu wu*). When time arrives, the **essence of the Three Talents** (*san cai zhi yuan*) will naturally coalesce within you—abundant as if eternally possessed.\n\n**Transformation and birth** (*hua hua sheng sheng*) unfold spontaneously, pure and ever purer. The **Three Talents’ essence** (*san cai zhi yuan*) crystallizes into a **single treasure pearl** (*yi bao zhu*), dim yet luminous, suspended before you. The **obstacles** (*ni e*) are resolved.\n\nThen, the **pearl merges with you** (*zhu wo hu he*), and you perceive **boundless light** (*guang ming wu ji*). This is the **True One of the Three Talents** (*san cai zhen yi*) uniting with **your True One** (*wo zhen yi*)—**non-duality** (*he yi bu er*). Thus is the **embryo sealed within the vessel** (*tai jie yu qi*), the **strange vessel** (*qi qi*) itself.\n\nThe **strange vessel’s** function is vast indeed! Yet tracing its origin, it begins with **self-refinement** (*lian ji*). Only when **self-refinement is pure** (*lian ji gong chun*) may one engage the **strange vessel**. Though the scripture points to its end, this principle applies universally to **sages and commoners, men and women alike**—all who possess **inherent nature** (*xing ti*).\n\nThe world misinterprets it by clinging to male-centric explanations—this is erroneous. Its true application lies in the **unification of Heaven and humanity** (*tian ren he fa yi jie*). Hence, it states: ‘It cannot be transmitted by mouth, nor grasped by the mind alone.’\n\nSuch is the gist of this scripture. Those who read it must **clarify their heart’s insight** (*xin yan gui ming*). Though **‘separation’** (*li*) and **‘union’** (*he*) of characters and forms appear profound, they must be **integrated and understood** (*hui yi tong zhi*), sustained and nurtured, and applied with **penetrating insight** (*chu lei yuan tong*). There is **no fixed method** (*fa wu ding fa*), yet all revolves around the **four principles of ‘consumption’** (*xiao*), **‘message’** (*xi*), **‘birth’** (*sheng*), and **‘killing’** (*sha*).\n\nThere are **dual paths** (*shuang guan qi xia*), too numerous to enumerate—each holds its own. Do not neglect them, nor force interpretations. A single deviation from the true meaning leads to **falling into the three calamities** (*san zhi*), beyond redemption.\n\nNow, I instruct you: the steps of this Dao are **threefold**. First, **humanity within the void** (*you ren wu ren*); next, **void within humanity** (*wu zhong you*); finally, **absorbing humanity into the void** (*she you gui wu*). This is the **hidden within the secret** (*tui mi yu mi zhi yi*), all emerging from **naturalness** (*ziran*).\n\nThe **Great Dao of Heavenly Immortals** (*tian xian da dao*) is fully contained in this scripture. To practice the Dao while abandoning it is to stray—where else would one follow?\n\nIf this scripture is taken as **foundation** (*ti*), its **great application** (*da yong*) can **heal the world**; its **small application** (*xiao yong*) fulfills the **Three Thousand Lines of Practice** (*san qian xing man*) and **Eight Hundred Functions** (*ba bai gong yuan*), and it can also **attain fruition** (*zheng guo*). **Wang Zu** bowed and received it.\n\nThis discourse, **Wang Zu** transmitted; **Qiu Zu** recorded. Never committed to script, it was passed orally until reaching me. Recently, those with misguided intentions have twisted the true meaning, veering into **obscenities of Yin and Yang** (*yin yang xie shuo*). Such texts bring calamity to the world. For the sake of the Dao, I expound its profound essence.\n\nYou must **take this to heart** (*zhi zhi*).\" **Tai Xu Master** bowed and received it, inscribing these words at the end of *Three-in-One Resonance Symbols*.\n\nThis book indeed corresponds internally and externally with the *Yin-Yang Classics*. I have held it for forty years.\n\nNow, my disciple Shi Sheng Zhaolin presented *The Profound Explication of the Yin-Fu Classic* (*Yin-Fu Jing Xuan Jie*) on my desk for my review. Upon examining it, I could not help but sigh three times.\n\nThis work belongs to Master Pan Yang, whose given name was Fan, of Rongyi. He derived his understanding from what he had heard, and though his intent was commendable, his transmission was incomplete, leading to an incorrect interpretation. His language is steeped in heretical doctrines, and he uses the world’s conventional *character-dissection keys* (*zhaizi jue*) to validate it—precisely aligning with what the True Person of the *Níhuán School* warned as *calamitous texts for the world*. I shall now include it in the Daoist Canon.\n\nMy ancestors and teachers must have known this long ago, hence the need to clarify the profound essence eighty years prior to avert future confusion. Thus, it is evident that the Great Dao does not remain obscured forever.\n\nHaving received the teacher’s transmission, how dare I evade the mysterious retribution? Therefore, I have carefully annotated it after Fan’s commentary, titling this work *The Rectification of the Profound Explication of the Yin-Fu Classic* (*Yin-Fu Jing Xuan Jie Zhengyi*), aiming to uphold the teacher’s transmission and illuminate the true Dao.\n\nMoreover, I note that the *Yin-Fu Classic*’s exegeses collected in *The Daoist Canon’s Essentials* (*Daozang Jiyao*) include the *Ten True Explications*. The Ten True Ones are: *Chisongzi* (赤松子), *Zhang Zifang* (子房张真人良), *Ge Xuanweng* (太极左宫葛仙翁玄), *Xu Xun* (西山许真人逊), *Zhongli Quanshi* (正阳帝君钟离祖师权), *Lü Yanshi* (纯阳帝君吕祖师岩), *Shi Jianwu* (华阳施真人肩吾), *Cui Zhiyi* (至一崔真人), *Liu Haichan* (明公海蟾帝君刘祖), and *Cao Daochong* (玄英清虚曹真人道冲). These are all based on *sand-writing* (*sha shuo*) transmissions.\n\nIts texts include the Tang-era *Zhang Guofu’s* (*Zhang Tongxuan*) *Explication*, the Yuan-era *Wang Daoyuan’s* (*Hunranzi*) *Explication*, and the Ming-era *Gao Shiming’s* (*Shifuxu Dao Ren*) *Corrections*—all mere scribbles. There is also *Shen Yafu’s* version, the *Cangya School’s* version, and *Yuanyangzi’s* version—all *spirit-writing* (*ji pen*) works. Beyond these, ancient annotated editions include: *Zhang Hongyang’s* preface version, *Chen Ximu’s* treasure version, *Li Qian’s* annotated version, and *Zhu Ziyang’s* annotated version. *The Essentials* did not include them—collecting texts requires discernment.\n\n**The *Yin-Fu Classic***\nFan said: *Yin* refers to the Great Yin (month), while *Fu* denotes the interaction between Great Yin and Great Yang. A year has twelve conjunctions and twelve full moons, and the period of these conjunctions and full moons is called *Fu* (omens). Since the Great Yin borrows light from the sun, it internally contains true fire, hence it is also called the *Fire Fu*. As for *Jing* (Classic), it refers to the five-six numbers of lunar nodes, like the tides of the sea, never failing. Previous scholars mistakenly interpreted *Yin* and *cun-yin* (inch-yin) divisions as obscure—this is entirely erroneous. This is a clear exposition of the Great Yin’s true sight: within the Great Yin lies the true fire of the Great Yang. To depend on this *Fu* to steal (the essence) is indeed the profound standard for Daoist cultivation—these three characters hold the chapter’s ultimate secret.\n\nI say: This interpretation is supremely close and unerring. Scholars who grasp this will return to the true path, avoiding empty speculation. If one clings rigidly to this interpretation and seeks it superficially, one will fall into heterodox paths and risk one’s life.\n\n**Upper Section: Observing the Dao of Heaven, Grasping Heaven’s Practice—Exhausted.**\nFan said: *Dao* (Way) implies mutual interaction, like the initial function descending from the head—merging the head and descending, is this not the meaning of *Dao*? Yet the Dao’s function requires two persons to achieve greatness. Now speaking of *Heaven*, it refers to *Pure Yang*. This Pure Yang cannot be occupied by one alone; it requires two, and these two characters signify *Yin*. When the two merge into one, is this not the meaning of *Heaven*? As for *Observing* (*guan*), it contains profound implications: using two *mouths* (口) upon a *flower* (花), there must be a mechanism of daily revelation, hence the *Observing* character subtly contains its meaning. The opening and closing of Yin and Yang, like Heaven’s emptiness and stillness, naturally manifest their intersecting radiance. One must emulate Heaven’s retrograde motion, grasp the central transition, and fortunately attain the *Nine* as the pivot of transformation. Applying this practice to the human body reveals the *Yin-Fu*’s secret.\n\nThese two sentences serve as the entire Classic’s framework, introducing the following text.\n\nI say: Fan did not receive the true transmission, blindly adhering to *character-dissection keys*, thereby falsely accusing the Sage and misleading the masses. Though his transmission may have origins, it is ultimately a heterodox path. This passage is the entire Classic’s overarching principle—directly interpreting the text yields *Observing Heaven, Grasping Heaven*. Thus, *Heaven* is the essence, while *Observing* and *Grasping* are its applications. Hence it is said: *Dao*, *Practice*. The character *Dao* requires no dissection. Dissecting *Dao* belongs to the lowest tier of Yin-Yang schools, unworthy of entry. This path originated with foreign monks, transmitted to China after the Han—those blue-eyed barbarian monks. Though their texts exist, our school despises them.\n\nThe direct interpretation of *Dao* is correct, as is *Heaven*. Only when dissecting *Observing* does profound meaning emerge—yet not through conventional character dissection. Dissecting *Grasping* also yields meaning. However, the method must enter through *Observing*’s true form, applying effort to emptiness and stillness, where boundless wonders unfold—truly the luminous and mysterious secrets. I wish scholars would combine and verify these interpretations. The most central and correct meanings are already revealed in this passage’s dual approach.\n\nIf one knows to dissect *Observing* through its true form, the profound exegesis will naturally appear—every aspect will align with the Dao.\n\nHeaven has five thieves; those who see them prosper.\nThe five thieves reside in the heart, manifesting in Heaven.\nThe universe lies within the hand; ten thousand transformations arise from the body.\n\nFan said: The two persons’ *Heaven* encompasses the five senses—eyes, ears, nose, tongue, and body—these are the five burdens.\n\nRecognizing these five as my burdens, one can see them, yet within practice, one never departs from the use of the five thieves. The key lies in the human heart recognizing the five thieves, then applying their function to others—making them their burdens, never allowing them to become my own.\n\nIndeed, applying the five thieves to the *Heaven* of the two persons is but like the use of a hunting hound: to grasp yin and yang in one’s hand, to let the five thieves trouble others, one must respond with ten thousand transformations as circumstances demand—thus, ten thousand transformations arise from my own body.\n\nOne scholar remarked: *\"Fan’s interpretation is utterly perverse!\"*\nHe argued that the Scripture was written solely for men, revealing his selfishness—his vital essence and spirit at work. Those who pursue deceitful Dao to achieve their ends shall surely be struck by thunder and die, or become serpentine foxes, or worse, descend into the realm of geckos, used as aphrodisiacs in men’s chambers. Such karmic retribution is inevitable.\n\nHow could he know that this passage is the Sage’s discipline of self-examination, elucidating the meaning of *manifestation* and *grasp* from the previous section? It states that when the Five Phases are upright, they become the Five Virtues; when perverted, they become the five thieves—with emphasis on the word *see*. Partial excess becomes the five thieves; if the heart discerns them and aligns with Heaven’s operation, one may then wield them in the palm and let ten thousand transformations arise from the body.\n\nBoth men and women receive the central essence of Heaven and Earth to be born, each rectifying their nature and vital force—how could there be a Heavenly Way that harms one to benefit the other?\n\nCarefully examining the Scripture’s intent: the use of the Five Phases contains both virtue and punishment; restraining their excess and employing their moderation ensures that the source of ten thousand transformations does not become a thief.\n\nThis encompasses both men and women in demonstrating the discipline of self-examination—this is called the Great Dao.\n\nHeavenly nature is humanity; human heart is the mechanism; establishing Heaven’s Way to define humanity.\n\nFan said: The *Heaven* of the two persons is inherently small, possessing natural five thieves. This mechanism of the five thieves manifests before the human heart. When the heart recognizes this mechanism, using the eyes to perceive it, it is called the *mechanism-heart*. Those who know it must still this mechanism-heart within and apply it to the *Heaven* of the two persons to establish the foundation of the Dao. Yet this foundation of the Dao does not depart from the *preheaven ‘Six-One Lead’*—the term *Six-One* is precisely what directs humanity to establish it.\n\nThus, heart and nature, Heaven and humanity, are essential to the Dao. There is no inch of deviation, no thread of confusion.\n\nOne scholar remarked: *\"This interpretation’s core is already erroneous—what need to discuss the man who proposed it?\"*\n\nHaving obscured this passage’s true intent and failing to grasp the *True One*, their heretical doctrines ensnare the heart, leading them to dissect the character *立* as *\"Six-One.\"* They do not realize this passage speaks of humanity inheriting Heaven’s nature, with the heart as the mechanism of ten thousand transformations. The text’s essence instructs one to exhaust nature to establish fate—exhausting nature is the very foundation of the Dao! What use has the paltry *Six-Lead* for such a foundation?\n\nThose who mistake *Six-One* for the *True One* fail to see that *Six-One* is the *True Essence*, thus confusing the common for the sovereign. This passage speaks of *nature*, the next of *fate*, yet preserving fate depends on nature, hence the necessity of exhausting nature to establish the foundation. Only by following natural principles and true understanding will the upper and lower passages cohere—why dissect the character *立*?\n\nWhen Heaven unleashes its killing mechanism, stars shift their lodges; when Earth unleashes its killing mechanism, dragons and serpents rise from the land; when humanity unleashes its killing mechanism, Heaven and Earth reverse. When Heaven and humanity jointly unleash it, the foundation of ten thousand transformations is set.\n\nFan Zhi said: The Yang principle manifests through the luminous mechanism of stars and lodges shining downward—this is Heaven’s emission. The Yin principle manifests through the mechanism of dragons and serpents surging upward—this is Earth’s emission. This is but a divided explanation.\n\nYet when considered holistically, Earth’s rising *qi* clusters beneath Heaven’s *qi* in mutual exchange, and Heaven’s luminous emission likewise depends on Earth’s ascending *qi*. When humanity perceives the responsive mechanisms of Heaven and Earth, manipulating Yin and Yang to invert and reverse, this *qi* lies entirely in the undivided unity of the two persons. At this juncture, they steal the *True One*’s *qi* from Heaven and Earth, seizing the mysterious essence of Yin and Yang’s transformation. This is the non-birth that generates, the non-transformation that transforms—it reverses to fulfill the profound use of *Buqian* [the uncarved block]. It is nothing but stabilizing the fixed to stabilize one’s primordial root.\n\nThis phrase—*\"Heaven and humanity jointly unleash\"*—holds the entire text’s deepest secret.\n\nOne scholar remarked: This passage expounds the most profound and vast principle—how Fan Zhi misapplies heretical doctrines to interpret it, truly a fool speaking in dreams! This passage establishes fate, with full attention on cultivating nature. As the saying goes: *\"Let others ride the waves; I steer my own ship.\"* One must observe messages in stillness—after the rain, the sky clears; after the clouds part, the sun shines. Welcoming the mechanism with the Dao, ten thousand transformations arise naturally—why exert human effort?\n\nSpeaking directly by principle, one may awaken to understanding. The so-called *\"killing\"* contains the logic of transformation. For the Five Phases’ generative *qi*, none does not lie dormant within destructive *qi*—as when Metal generates Water, Water generates Wood, making Wood the ancestor, yet Wood encounters Metal and is imprisoned in death. Thus, generative *qi* hides within destructive *qi*—this is the mechanism of contraction and expansion, not *\"killing.\"*\n\nStars and lodges, dragons and serpents—these are the traces of Yin and Yang’s waxing and waning, their successive transformations. *\"Heaven and Earth reversing\"* refers to the principle of Yin and Yang’s inversion. The mechanism of transformation arises from inversion—*generation* is顺 (*shun*, \"harmony\"), *killing* is逆 (*ni*, \"inversion\"). Inversion yields harmony, and thus the foundation of ten thousand transformations is set.\n\nThe first six sentences broadly describe the marvels of the Three Powers’ responses; the next two reveal boundless profound meaning, with the key lying in the initial natural emission of the mechanism—responding appropriately, neither excessive nor deficient, neither premature nor delayed, with no room for error. This demands the utmost emptiness and deepest stillness to act—Fan Zhi’s claim that this is the text’s ultimate secret is correct.\n\nYet by mistakenly taking *Kan* [坎] as the *True One* and forcibly dissecting *合* as *\"two persons combining\"*, he aligns with the three erroneous schools. How greatly does this deviate from the text’s intent?\n\nOne interpretation reads *\"killing\"* with a falling tone, aligning with the *I Ching*’s *Qian* [谦] hexagram. The emotions and natures of the Three Powers all abhor excess and favor humility. Yet this meaning applies only after the mechanism is unleashed, serving as a technique for transition and interaction—also a critical move in Daoist alchemy.\n\nThe character *定* in this passage also contains the dual meanings of *\"stabilizing\"* and *\"affirming.\"* All such actions serve to obtain the *True One*’s foundation. Once the *True One* is attained, the foundation is established. Yet this cannot be artificially acquired through cleverness.\n\nIf one remains ignorant, they will fail to act when they should kill, or act when they should stabilize, seeking unity when they should not. A hair’s breadth of error leads to miles of deviation—this is the passage’s pivotal crux.\n\nNature has skill and clumsiness, capable of concealment. The nine orifices’ malevolence lies in the three essentials, governable by motion and stillness. Fan Zhi said: The *True One*’s *qi* arises from the small—without cultivation, it cannot be drawn; without technique, its use cannot be manifested. Its appropriateness depends entirely on the heart’s generation. If controlled by nature, even skill becomes clumsy. If not controlled by nature, clumsiness becomes genuine greatness. Skill demands retreat into hidden concealment—this is the apparent clumsiness, the true operation of skill.\n\nPlundering the *True Yin* within the *True*, concealing it in secrecy, circulating through the anterior and posterior pathways, ascending and descending along the Governing and Conception vessels, flowing without stagnation—this is how one achieves enduring longevity. The vulgar fail to grasp the mystery of concealment, neglecting the nine orifices’ malevolence, thus losing their life.\n\nOf the nine orifices, none are more vital than the ears, eyes, and mouth—the three essentials. In motion and stillness, they function as the *Taoist Canon* states: *\"To close, one must first open; to weaken, one must first strengthen; to abandon, one must first establish; to take, one must first give.\"* The three are contained within one, and one contains the three. Though specifically referring to these three, they do not depart from the *Western Woman* [a Daoist alchemical term], hidden within—this is the critical juncture for sacred cultivation.\n\nOne scholar remarked: The *nature* here refers to the *qi*-nature that is concealed and unmoving. The *clumsy* are shackled by the burdens of turbid Yin;\n\nThe adept, too, is ensnared by the burdens of myriad responses to affairs.\nAll must practice concealment and stillness.\nWith time, great wisdom may arise—\nthe adept has no need for words,\nthe clumsy none for harm.\n\nCarefully examining this passage, it follows the earlier discussion of *\"foundation\"* [基],\nstating that though people are born with cleverness or clumsiness,\nthose who know to conceal and remain unmoving\nneed not be led astray by the nine orifices’ malevolence.\n\nTo forget cleverness and transform into clumsiness—\nthe key lies in guarding the three essentials.\nOne must move without moving,\nfor even in stillness, one is still;\neven in motion, one is still.\nThis passage reveals the meaning of stillness generating wisdom,\nshowing the method for nurturing one’s nature.\n\nFan Zhong’s [范氏] erroneous teachings further obscure\nthe essence of *nature* and *fate*.\nWhat is this \"hooking and supporting with the hand\"?\n*Nature* may be awakened but not grasped,\n*fate* may be perceived but not seized—\nboth are utterly empty, lacking substance.\n\n*Nature* and *fate* dwell within the void and quietude,\nalive with vitality, as the ancient texts say.\nYet to \"hook\" and \"support with the hand\" from the ordinary body of the *Western Woman*—\nis this not merely the water of *geng* [癸水]?\nThe *Elixir Scriptures* state:\n*\"What is seen cannot be used;\nwhat is used cannot be seen.\"*\n\nFan Zhong must also have known this—why then did he speak in such crude, vulgar terms?\n\nEven the *Kun* [坤] containing *Kan* [坎]—one—still belongs to the true *yuan* [元]. What relevance does this have to *nature* [性]?\nWhat does he take *nature* to be?\n\nThis passage follows the errors of the previous section’s lost grasp, and the next section does the same.\nThe focus here lies in *hidden treasures* [伏藏], while the next section builds upon the last sentence of this one.\nIts core organ is the heart—only when the heart is clear can one discern the *machinations* [机].\nFire arises from its root; when disaster strikes, it must be overcome.\nDelusion arises within the realm; when it moves, it must collapse.\nTo know this and refine—this is called the *sage* [圣].\n\nFan Zhong says:\nThe first two lines speak of those lacking sincere *precepts* and *meditation*, enslaved by the *spirit-recognition* [识神], casting their bodies into reckless action, losing their true essence, and turning into decay—like fire burning wood.\n\nThe middle two lines are a double entendre, also interpretable as the first two lines, but they also point to the *Three Women* [三女] as delusion.\nBecause there is movement generated within their bodies, and I, in response to their movement, cause their hearts to collapse—at the moment when *heaven* and *human* merge, I unleash my natural *killing intent* [杀机], reversing *post-heaven* into *pre-heaven*.\n\nTo know and apply this *arrow-mouth* [矢口] refinement—this is the work of the *sage*.\nBut this *sage* [圣]—its root is *Kan* [坎], it is *Li* [离].\nIt speaks of *Kan* and *Li* intersecting, drawing in the *qi* of one to return to the central earth as *king*.\n\nDo not overlook this *sage* [圣]!\n\nOne critique says: Fan’s annotations are utterly erroneous and should not be followed.\nNot only is his explanation of *knowing* [知] mistaken, but his interpretation of *sage* [圣] also violates the character’s meaning.\nThe *sage* [圣] is properly composed with *ren* [壬], not *wang* [王].\n\nAccording to this text, *knowing* [知] is the foundation, *refinement* [修] the application—following the last sentence of the previous section.\nIts essence lies in the single *knowing*—only with a foundation can there be application.\nHow can one refine without knowing?\nRefinement is to cultivate the *machinations* of motion and stillness before they manifest.\nOnly by knowing the *machinations* can one act—thus, the passage’s emphasis is on *knowing*.\n\nOne may interpret it straightforwardly without seeking hidden meanings in the characters.\nIts essence lies in the dissemination of the *Five Phases*—they must not be allowed to run wild without restraint.\nIt hangs upon the preceding text, warning: do not forget the meaning of *killing*.\n\nThe first two lines speak of *killing intent* hidden within life.\nThe middle two lines speak of the danger of complacency.\nThe last two lines speak of the subtlety of knowing how to refine.\n\nInterpreting it directly: if life’s excesses lack restraint, disaster and delusion arise—*sages* warn against them.\nThe *Way* of governing the world and cultivating oneself is one and the same—this is the text’s true meaning.\nFan Zhong’s explanations are utterly mistaken and twisted. Calling it *sage-work* is a true slander of the *sage*.\n\nAs for dissecting *knowing* [知] into *arrow* [矢] and *mouth* [口], there are the *Three Sovereigns’ Jade Precepts* [三皇玉诀] to verify.\nFan Zhong’s interpretation stems from later transmitted oral precepts, unaware that the *Jade Precepts* are grand and majestic—even in broad daylight, the *arrow-mouth* has its use.\nIt is not merely for loosening the farmer’s belt or adjusting one’s sash—even when facing an enemy, near or far, it makes no difference.\nIt is said: mountains, rivers, and the earth are all protectors of the *cauldron*; even the dullest living beings are potential medicines.\nOne must transcend the self’s form and color, still the mind’s deliberations, and retain only *qi*—boundless, without edge or limit.\nThe six directions and three talents are as insignificant as grains of millet.\nMy inner radiance shines forth, responding as if summoned—straight as an arrow, revealing *sage sun* and *sage moon*, golden light illuminating, five-colored clouds and mists floating in space, descending swiftly like a gust of wind, unimpeded.\nThen the sun and moon merge, suspended in my golden court, gradually nearing and contracting, small as a bean—like a lotus lantern before the Buddha, containing all within its vastness, admitting all in its subtlety.\nAt this moment, not a single thought arises.\n\nInitially, something emerges from the void, and I sense within myself a myriad of harmonious flavors and sensations—only to be intuited, never to be grasped.\nThe *Three Sages* [三圣] say this is the peak of *true yuan* [真元], yet still not *true one* [真一].\nWhen *true one* arrives, it enters suddenly and silently, leaving no trace of sound or form—only an awareness of boundless tranquility, steadfast as a mountain, beyond description.\n\n*True yuan* and *true one* move like an arrow to its mark—this is the *arrow*.\nIt is what the *Buddha* calls *Muni Alaya* [牟尼阿利].\n\nAs for *mouth* [口], it is the *Daoist* term for the *mysterious orifice* [玄窍], corresponding to the *wonderful instrument* [奇器] at the end of this text.\nA single punch shatters it—this is the *Buddha’s* *other shore*, the *Confucian* *Non-Extreme* [无极].\n\nIn the past, when the *Thus-Come-One* taught in that land, five thousand disciples gathered.\nWithin the *silent treasure-light* [寂宝光], they saw a light straighten and enter the Buddha’s embrace.\nThe Buddha seemed as if in a drunken stupor, then awoke—hence the tale of the five thousand withdrawing.\nIt was said the disciples mistakenly thought the Buddha was weary and left.\nThis serves as proof of the *arrow-mouth*.\n\nFan Zhong has never heard of this.\n\nThe text within the *scripture* concerning the character **\"故\"** need not be deciphered through the *dismantling-character* key. Even if analyzed through such a method, its proper meaning remains intact.\n\nThis speaks of the principle of *textual mastery*—one must revert to antiquity, embodying the *Laozi’s* teaching of *\"wandering in the primal essence of things.\"* How could one verify this through the *Sanfeng* school’s *actions*?\n\nThe preceding hundreds of words exhaust the *Heavenly Immortal’s* Dao entirely. Originally, this should not have been recorded here, but since the *arrow-mouth* was pierced through, if not fully revealed, the profound essence of the character **\"知\"** would remain obscured. It is not that this knowledge is only applied at this juncture—rather, its meaning is embedded within the two phrases *\"self-so of Heaven and man\"* from the opening. Let the reader discern this.\n\n---\n**Middle Section**\n\n*\"Heaven generates, Heaven slays\"*—this is the principle of the *Dao*.\nFan Zhong says: *Heaven’s generation* is the natural unfolding of the eternal *Dao*; *Heaven’s slaying* is the inverted return against the *Dao*.\nNow, with a body that follows the natural, forward-moving *Dao*, one enters the inverted, counterflowing *mystery*—thus it is called *\"Heaven generates, Heaven slays.\"*\nYet this relies solely on the wondrous, inverted logic of *upside-down reversal*, which alone constitutes the *Great Dao* of attaining sainthood and true transcendence.\n\n*One who grasps this* says: This passage continues the meaning and structure of the earlier *\"Heaven’s killing intent\"*—if the *Five Phases* lack this killing intent, the four seasons would act chaotically, and the principle of cyclical return would collapse. Within *slaying* lies *generation*; *generation* is concealed within *slaying*—thus order arises, and transformation proceeds endlessly.\n\n*\"Heaven and Earth are the thieves of all things;\nAll things are the thieves of man;\nMan is the thief of all things.\"*\nWhen these three thefts are right, the *Three Powers* are at peace.\n\nFan Zhong says: The flourishing and withering of all things follow the revolutions of Heaven and Earth—thus Heaven and Earth are the thieves of all things. Man, unable to preserve himself, is ravaged by all things, stripping away his true nature—thus all things are the thieves of man. If man can guard himself without loss, seizing the true essence of all things, then man becomes the thief of all things. These three acts of theft complete one *trigram*; nine such thefts fulfill the *Qian* hexagram. The sequence within is merely the use of man’s *mouth* to harmonize what is fitting—thus the three *trigrams* are without fail secured through the *female*.\n\n*One who grasps this* says: The old interpretation—*\"Heaven and Earth are what all things steal; all things are what man steals; man is what all things steal\"*—is the most direct.\n\nCarefully examining the *scripture’s* intent: It follows the first profound principle of this section, using the *Three Powers* to symbolize the *Three Fields*. Applying them appropriately, without violating nature, each finds its proper place—bound as one, stabilizing the *Dao* of the *Three Powers*.\n\nThe meaning of *\"thief\"* is as explained above. *Taixu Wong* says that the *wonderful instrument* of the next section is inherently possessed by all things, enabling mutual theft. To fully grasp this character’s profundity, oral transmission is required. Yet it ultimately rests in being *as if foolish, as if clumsy, yet as if empty*—thus all things find peace, fundamentally relying on the principle of *harmony*. Yet Fan Zhong speaks of *\"securing through the female\"*—how strange! This refers to what is both *proper* and *secure*. It means the *Three Fields* must all be abundantly nourished. The abundance of the *third field* depends on a single thing, leading step-by-step to fullness. When *essence* is abundant, *qi* is abundant; when *qi* is abundant, *spirit* is abundant; when *spirit* is abundant, *essence* is fully sufficient—this is yet another *Dao*.\n\nSuch is the profound essence of this passage. The secret intent of stabilizing the *Three Powers* is revealed in the following passage. Hence it is said:\n*\"Eat in season, and the hundred bones harmonize;\nStir the mechanism, and the ten thousand transformations are at peace.\"*\n\nFan Zhong says: The *\"故\"* here follows the *\"安\"* [peace] of the preceding text, placing the ten characters *\"安\"* within the *mouth* to restore the *true one* within. Thus arises the phrase *\"故曰\"*—*\"food\"* refers to the *Great Elixir*, meaning *\"those who obtain it are ever as if drunk.\"* Yet this must await the opportune *time*. And that *time* must manifest its *mechanism* and *symbols*. The *symbols* are the movements of the *mechanism*—this is the true moment of consumption, when man becomes the thief of all things. But with the possession of *rabbit marrow* and *crow essence*, a single consumption makes the hundred bones throughout the body harmonize. The turbid *yin* is dispelled, transforming into pure *yang*—this requires daily practice of *retreat of the yin符* and *advance of the yang fire* circulating the *Microcosmic Orbit*. With ten thousand transformations of *essence, qi,* and *spirit*, thus one meal suffices to attain peace in transformation. How could this peace be achieved without the *female*?\n\n*One who grasps this* says: Only by not missing the *time* can one eat in season; only by not neglecting the *mechanism* can one stir the *mechanism*. The characters *\"故曰\"* conceal a profound meaning, also seen in the *Three Sovereigns’ Jade Key*. Its key lies in *returning*, not straying back to the ancient *\"initial restoration of command.\"* The secret of *unification* rests in the character *\"曰.\"*\n\n*\"Day\"*—within it lies *oneness*.\nFollowing the myriad *affairs*, the mind contracts within the *self, world, people,* and *individual*—its vastness is boundless. One lets *qi* and *mechanism* flow freely, like clouds and mist; suddenly, all sounds cease, and inner and outer are at peace. Then, with the mind focused, one feels a natural, silent stillness—*the Three Saints* call this the *true one’s* return. This is the *mysterious symbol* of *\"day,\"* the so-called *\"formless form.\"*\n\nTo fixate on the *form* leads only to falsity. Only by beginning with *emptiness* can *\"day,\" \"time,\"* and *\"mechanism\"* align with the *Dao*.\n\n「Master Fan’s account, though ostensibly a recitation of ancient Daoist immortals’ external techniques for internal cultivation, errs when it states *\"Shall one not depart from the female to attain peace?\"*—this is a deviation into heretical teachings.\n\nIn my view: ancient *characters* (古字), *knowing* (知字), *affairs* (故字), *day* (曰字), *Yu* (虞字), *sage* (圣字), and others all hinge upon discerning the *times*. Yet Master Fan only understands fixation upon a single *time*, failing to grasp that *times* may be used flexibly at all moments.\n\nIndeed, *times* have two modes—*fixed* and *active*—not confined solely to the *active* hours of *zi* (子) and *wu* (午). From *zi* (子) to *hai* (亥), each bears its own *fixed* and *active* properties.\n\nThe so-called *true one* and *true essence*, though rooted in the *self*, transcend mere fixation upon the *self*. Roughly speaking, at the onset of practice, one must intuitively perceive the prevailing circumstances to determine the *time*—this method is the most *active* and responsive.\n\nWhen considering the *self* alone, the *time* has *fixed* and *active* distinctions;\nWhen encompassing the *Three Powers* and *Six Harmonies*, the *time* likewise holds *fixed* and *active* nuances.\nThus, their mutual resonance: *fixed* responds to *fixed*, *active* to *active*—without delay, for within *times* lies *mechanism*.\n\nWhen the *time* arrives, the *mechanism* stirs; when the *mechanism* moves, *transformation* unfolds—this is the wondrous principle of nature, the supreme *Dao*.\n\nMaster Fan merely sits upright and gazes at the heavens—his ears attuned to the *times*!\nMen know the *divine* of the *divine*, yet fail to recognize the *non-divine* source of its divinity.\nMaster Fan says: *Divine* is *yang* (神者，阳也).\nThe *divine* of the *divine* is *yang* within *yang*—the *mysterious* yet deeper *mysterious* (即玄之又玄之谓也).\nYet this *true yang* dwells concealed within *true yin*, and seizing it is done through *direct* utterance—Brü’s *mouth-to-mouth* divine technique.\n\nConsider: within the *knowing* (知) character, is not *direct* (矢) and *utterance* (口) implied?\nThus, it is termed *knowing the divine of the divine*.\nThis very technique, though seemingly mundane and unadorned, holds no trace of artificiality—it appears as *non-action* yet is *action*, and within *action* lies *non-action*.\nHence, it is called *knowing the non-divine source of divinity*.\n\nTo grasp this *yang qi*, one must employ a *strange* vessel (奇器), using the *non-divine* divine method, for when the *yang qi* arises, it is the *initial breath* of the *parents* before their birth.\n\nA critic remarks: these two *knowings* (知), Master Fan failed to receive the true transmission, drifting into heresy. He overlooked the wondrous interplay of *exchange* within *emptiness*—the essence generated by the resonance of *self* and *other* within the void.\n\nThe upper line refers to the *true essence* born from the convergence of *self* and *other* in *emptiness*.\nThe lower line speaks of the *Three Powers’* *true essence* ascending through the *yang qi*, resonating with one’s own *qi* and *divine*—thus, within *emptiness*, the *true one* emerges from their union.\n\nExamining the scripture’s intent: the *essence* drawn from the mutual resonance of *self* and *other* is merely *true essence*—thus, it is termed *the divine of the divine*, yet unworthy of reverence.\nIf one attains the *great resonance* of *self* and *other’s qi* and *divine*, where the *essence* descends and merges within *emptiness*, generating the *true one*—this is the seed of *sagehood*, the supreme treasure.\n*Divine* meets *divine*, hence *the divine of the divine*.\nWithin the ultimate union, the *one* born is *emptiness* at its zenith—beyond mere *divinity*, thus termed *the non-divine source of divinity*.\nThe emphasis shifts downward, hence the distinction between *knowing* and *not knowing*.\n\nThe sun and moon follow their set cycles, their *fixed* and *active* properties yielding practice and enlightenment.\nMaster Fan says: the sun’s *yang* nature belongs to *li* (离), the lesser *yin*;\nThe moon’s *bright* nature aligns with *kan* (坎), the greater *yang*.\nEach has its own count: the sun requires sixteen, the moon five thousand four hundred eighty.\nMen mistakenly speak of the sun and moon’s degrees—this is incorrect.\nThe *\"three before, three after\"* refers to the pairing of *jia* (甲) and *geng* (庚), the union of *ding* (丁) and *ren* (壬).\n\nFor instance, in the *initial line* of the *Qian* (乾) hexagram:\nFirst, employ *jia*’s inverse sequence paired with *wu* (午) from *gui* (癸) to *ren* (壬);\nNext, use *geng*’s forward sequence paired with *wu* (午) from *gui* (癸) to *ren* (壬)—this is *jia*’s inverse sequence paired with *wu* (午) from *gui* (癸) to *ren* (壬);\nLastly, again employ *jia*’s inverse sequence paired with *wu* (午) from *gui* (癸) to *ren* (壬).\nThis is the *mechanism* of *\"three before, three after\"*—the *ascending* and *descending* phases.\n\nThus, three such pairings complete the *Qian* (乾) hexagram’s *initial line*,\nAnd nine such pairings fulfill the *Qian* (乾) hexagram’s *third line*—\nOnly then does one reach the *pure yang* state.\n\nThis requires the sun and moon’s *times* to be *fixed* and *active* in measure—\nTo perfect the *sage’s* practice, gathering the *Five Phases* within the *central palace*,\nWherefrom *divine beings* and *men* arise, emerge.\nThis is the *divine* and *men*’s fulfillment—\nNot through the sun and moon’s union yielding *brightness*, but by the *non-divine* source of divinity.\n\nThe *\"three before, three after\"* and *\"ascending, descending\"* references to *jia-geng-ding-ren* (甲庚丁壬) are indeed the *fire talismans*.\nWhen the sun and moon’s counts are fulfilled, the *fire talisman’s* count is complete.\nThe moment of revelation is the very *knowing* of the *non-divine* source of divinity.\n\nAs Brü’s master taught: *\"Pointing afar at the celestial sun and moon\"* and *\"below the earth’s tides, above the moon’s glow\"*—\nAnd as Cui Xi-Fan said: *\"Heaven responds to stars, earth to tides\"*—\nAll derive from this understanding.\nThis is the *Yin Symbol’s* supreme *Dao*, the untransmitted mystery of ages.\n\nA critic concedes: counting *geng-jia* (庚甲) for the sun and moon, and *yin-yang* (阴阳) for *great* and *small*—\nThis is indeed the *principle* of the *Yijing*.\nMaster Fan’s words are correct.\n\nYet, this passage elucidates the *\"men know\"* (人知) line’s meaning—\nA secret transmitted through the *nose’s center*, passed down orally for millennia,\nYet the scripture speaks of it as *\"men know\"* (人知).\nDuring the Yellow Emperor’s era, practitioners of the *Dao* were many—\nThis teaching was universal, hence it is said: *\"Men know the divine of the divine.\"*\nMaster Fan fails to comprehend, deeming this an untransmitted secret—\nThus, he calls it *\"the non-divine source of divinity,\"*\nUnaware that the *Yin Symbol’s* highest *highest* cultivation lies beyond his grasp.»\n\n「This passage further elucidates the *Yin Symbol’s* (阴符) *principle* (理) of the *Dao/Way* (道) as the supreme path (大道) to sainthood (成圣), the untransmitted (不传) mystery (奥义) of millennia.\n\n　　A scholar remarks: the sun and moon are reckoned by *geng-jia* (庚甲), and *great* and *small* by *yin-yang* (阴阳)—this is indeed the *principle* (理) of the *Yijing*. Yet, Master Fan’s interpretation is correct.\n\nThe *Yin Symbol* (阴符) reveals that this section aligns with the *yin-yang* (阴阳) schools’ teachings, arriving at the *critical juncture* (机动) of their *tilting balance* (倾) and the *favorable moment* (火候) of *evenly penetrating* (平透) and *evenly responding* (平感). Though it has not yet spoken of the *Six Coordinates* (六合) and the *Three Talents* (三才), universal sensation (普感) and universal response (普应) are already present—*completely* (浑) *unifying* (合) *harmonious interaction* (交合) and *generative cultivation* (生). Yet sainthood’s *virtue/power* (功) is born here, and *divine clarity* (神明) emerges.\n\nThe *First Master* (先师), Great Emptiness (太虚) *Venerable*, thus said this section is in harmony with the opening phrase of the text. As for the *highest highest cultivation* (最上上乘), it originates from the time before *Heaven and Earth* (天地) existed and before *parents* (父母) were born—its foundation (落脚) lies beyond *yin-yang* (阴阳), *Five Phases* (五行), years, months, days, and hours. Once the *critical juncture* (机动) arises, *emotional restraint* (节情) returns to *true nature* (归性), forming a *precious gem* (宝珠) and absorbing it into the *strange vessel* (奇器). Through daily and monthly accumulation (日积月累), it ultimately merges with the *Three Talents’* (三才) *true unity* (真一)—*one without duality* (合一不二)—thus forming the *saintly embryo* (圣胎). So it is that the *Three Talents* (三才) decay, yet I endure eternally.\n\nThis is the *playful cultivation* (玄修) of the *Three Sovereigns* (三皇), still not the *secret* (秘) known by the Yellow Emperor’s era. The following passage refers to this, hence the phrase *\"the unknown\"* (不知). The *method* (功法) of the *hundred-foot pole* (百尺竿头) is one of *universal harmony* (左右逢源), where *all under Heaven returns to benevolence* (天下归仁). This is what the *First Master* (先师) has heard.\n\nYet, the *First Master* (先师) further said that the *mystic principle* (玄理) of this section is the *foundation for upright conduct* (立身之本). If this section is forgotten, then the *highest highest cultivation* (最上上乘) cannot be refined further. How can this section be neglected?\n\nAs for *stealing the mechanism* (盗机), none under Heaven can see it, none can know it. The *noble* (君子) who attains it will preserve their life, while the *petty* (小人) who attains it will risk their vitality. Master Fan says: *\"Stealing\"* (盗) is the *Dao/Way* (道). The *saintly virtue/power* (圣功) manifests through observing its *mechanism* (机), then applying it to *steal* (盗) the *lifespans* (夭) of both the *noble* (君子) and the *petty* (小人).\n\nThe *true yang* (真阳) of the *seven* (一七) cannot be seen by the eyes, but the *true yang* (真阳) of the *lower seven* (下一七) can only be obtained through the *spear-mouth* (矢口). The *noble* (君子) knows that the *true yang* (真阳) of both the *noble* (君子) and the *petty* (小人) must be returned through the *Ten-character Great Mouth* (十字大口) and *Small Mouth* (小口) methods, to preserve their life and ensure eternal existence. The *petty* (小人) cannot self-restraint, relying on their talents while neglecting cultivation, they fall into *evil paths* (邪道), losing their life without realizing it—hence the phrase *\"lightly risking their vitality\"* (轻命). This illustrates the *auspiciousness and inauspiciousness* (吉凶) of *right and wrong* (邪正).\n\nA scholar remarks: the *\"its\"* (其) in this section refers to the *Dao/Way* (道) mentioned in the previous section. *\"Stealing\"* (盗) means *secretly taking and concealing* (密取而藏). *\"Mechanism\"* (机) is the *interaction of self and other* (彼我所发之机). If not concealed, it will dissipate—thus, the value lies in knowing how to *steal* (盗). None can see or know it, hence it is called *\"stealing\"* (盗). Yet, it is crucial to *preserve the universal mind* (普心), preventing *one-sided dominance* (偏胜). This contains the dual meaning of *\"taking and giving\"* (取与).\n\nTo know this is to be a *noble* (君子); to be unaware is to be a *petty* (小人). Here lies the *Heavenly Mandate* (天命). Those who *observe Heaven and embody Heaven* (观天执天) cannot afford to neglect the *mechanism of stealing* (盗机). Aligning with Heaven preserves the body, while *pursuing private gains* (挟私) through stealing leads to *lightly risking vitality* (轻命). What does *\"attaining\"* (得) mean? It is the *Dao/Way of taking and giving* (取与之道).\n\nThis section belongs to the *initial stages of cultivation* (小试之道), hence the warning. Master Fan fails to grasp this, so his interpretations fall into the category of *lightly risking vitality* (轻命), and cannot be followed.\n\n---\n**Next Section:**\n\n聋者善视，瞽者善听。\n绝利一源，用师十倍。\n三返昼夜，用师万倍。\n范氏曰：此指功中遇用美口之时，必须如聋者之善视，瞽者之善听。\n二善喻专字之义，又含用口而心无口之谓也。\n要知功中用盗，非口不能取。\n丝色真一源头之利，惟口一源之用最为至要。\n是先以耳目之用于机，得机上始用其口，而口一用，又缘十字以得之。\n果以十字而三返根源，真如兵师之危厉。\n此正火里栽莲，诚有万倍之获。\n是全耳目口宵旦不辍，以成盗机之利，以起下文机心之用也。\n“倍”字另有妙义，未敢笔之，请勿略也。\n一得曰：上中两篇言其义理之当，然个中利弊亦道及。\n下篇所言乃是功法，而义理遇焉。\n从而去取损益于其间，则法备矣。\n统而体之，在专一，在至静极虚而中无人我，一任自然，有有无无一以气机视之。\n此中常寂寂，忘其寂，则可运至常应常静。\n谨按此节首二句“专”义也，第三句“一”义也。\n目利视，耳利听，聋瞽能绝其歧，则源一也。\n其第四句集“益”之义也，而验于此。\n得三返句，“恒”义也。\n师，众也，《易》师卦之象言，畜众也，此正俦人广众之中有归仁逢源之大道。\n三返昼夜，三十六时也。\n三十六者，阴数之极也。\n言能专而恒，则阴尽化阳，三十六宫都是春也。\n十倍、万倍，约词也。\n言专一则能用众，恒则愈能倍用之也。\n“倍”字拆看，乃阴阳门地天作用，须连十字合参。\n“万”字拆看，乃“艹禺”两字，艹属坤气，禺属阴类，此就范氏解法言之。\n按理而论，用倍字作用，较胜范氏所宗。」\n\nThe *deaf* (聋者) excel in *vision* (善视), and the *blind* (瞽者) excel in *hearing* (善听).\nTo *sever all profit from a single source* (绝利一源), one must employ the *Master* (师) tenfold (十倍).\nTo *return three times through day and night* (三返昼夜), one must employ the *Master* (师) ten thousand-fold (万倍).\n\nMaster Fan says: this refers to the moment in cultivation (功) when one encounters the *beautiful mouth* (美口), requiring the *vision* (视) of the *deaf* (聋者) and the *hearing* (听) of the *blind* (瞽者).\nThe two *excellences* (善) illustrate the meaning of *single-mindedness* (专), and also imply *using the mouth while the mind remains without attachment* (用口而心无口).\nUnderstand that in cultivation, *stealing* (盗) must be employed, and without the *mouth* (口), one cannot *take* (取).\nThe *true one* (真一) of the *silken threads* (丝) and *colors* (色) lies at the *source* (源头), and the *use of the mouth as a single source* (口一源) is most critical.\nFirst, one must apply the *ears and eyes* (耳目) to the *mechanism* (机); only after attaining the *mechanism* (机) does one employ their *mouth* (口), and once the *mouth* (口) is used, it is through the *Ten-character* (十字) method.\nIf one truly employs the *Ten-character* (十字) and *returns three times to the root source* (三返根源), it is like the *precise and perilous* (危厉) tactics of a *military strategist* (兵师).\nThis is akin to *planting lotuses in flames* (火里栽莲), truly yielding *ten thousand-fold gains* (万倍之获).\nIt is through *uninterruptedly preserving ears, eyes, and mouth* (全耳目口宵旦不辍) that one achieves the *advantage of stealing the mechanism* (盗机之利), thus giving rise to the *application of the mind’s mechanism* (机心) in the following passage.\nThe *character \"bai\"* (倍) holds another profound meaning, which I dare not commit to writing—please do not overlook it.\n\nA scholar remarks: the *first two sections* (上中两篇) discuss the *correctness of their principles* (义理之当), yet they also hint at their *advantages and disadvantages* (利弊).\nThis *section* (下篇) speaks of the *method* (功法), while the *principles* (义理) are encountered within it.\nFrom this, one must *discriminately adopt or abandon* (去取) and *assess gains or losses* (损益) accordingly—then the method is complete.\nTo *comprehend and embody* (统而体之) it lies in *single-mindedness* (专一), in *ultimate stillness and supreme emptiness* (至静极虚), where there is no *self or other* (人我), and one *fully trusts in nature* (一任自然), perceiving *presence and absence* (有有无无) solely through *qi and mechanism* (气机).\nHere, there is *constant quietude* (常寂寂); if one *forgets this quietude* (忘其寂), then one can *operate* (运) to reach *constant response and constant stillness* (常应常静).\nThis passage’s first two lines elucidate the meaning of *single-mindedness* (专), and the third line, that of *oneness* (一).\nThe *eyes* (目) profit from *vision* (视), the *ears* (耳) from *hearing* (听); the *deaf* (聋) and *blind* (瞽) can *sever their distractions* (绝其歧), thus *unifying the source* (源一).\nThe fourth line gathers the meaning of *benefit* (益), verified here.\nThe phrase *\"return three times\"* (三返), carries the meaning of *constancy* (恒).\n*Master* (师) means *the multitude* (众); in the *Yijing’s* *Master Hexagram* (师卦), it speaks of *accumulating the multitude* (畜众), which is precisely the *Dao/Way* (道) of *returning to benevolence* (归仁) and *encountering the source* (逢源) amid a crowd.\n*Return three times through day and night* (三返昼夜) refers to *thirty-six hours* (三十六时).\nThirty-six is the *extreme of yin numbers* (阴数之极).\nIf one can be *single-minded and constant* (专而恒), then *all yin transforms into yang* (阴尽化阳), and the *thirty-six palaces* (三十六宫) are all *spring* (春).\n*Tenfold* (十倍) and *ten thousand-fold* (万倍) are *approximate terms* (约词).\nThey mean that *single-mindedness* (专一) allows one to *employ the multitude* (用众), and *constancy* (恒) further enables *tenfold or ten thousand-fold application* (倍用).\nThe *character \"bai\"* (倍), when deconstructed, reveals the *yin-yang* (阴阳) *gateway and foundation* (门地) of *Heaven’s operation* (天作用), which must be *connected with the Ten-character* (十字) for full understanding.\nThe *character \"wan\"* (万), when deconstructed, reveals the *two characters \"cao-yu\"* (艹禺): \"cao\"* (艹) belongs to *Kun-qi* (坤气), and *\"yu\"* (禺) belongs to the *yin category* (阴类). This is in accordance with Master Fan’s method of interpretation.\nBy *reasoning* (按理), the *application of \"bai\"* (倍) surpasses what Master Fan adheres to.\n\n「Yet according to the *orthodox interpretation* (正义), it merely states that the *Dao/Way* (道) is not cultivated in isolation. Scholars who follow this scripture’s *true essence* (正宗) will find that even in solitary practice within a single chamber, if one attains the *True One* (至真一) and *True Essence* (真元) of the *void* (虚空), the harvest would be *tenfold* (十倍) or *ten thousand-fold* (万倍) beyond measure.\n\nThis scripture’s *orthodox interpretation* (正义) does not lie in deconstructing characters. The intent of this passage is to establish *command* (命), while its meaning focuses on the *nature* (性). Indeed, *command* (命) is rooted in *nature* (性)! Scholars who examine it carefully will understand what they must pursue.\n\n*The heart-mind* (心) arises from things and perishes from things; its trigger lies in the eyes. Master Fan says: When the *heart-mind* (心) is drawn by the *mechanism* (机) of things, this is the *operation of things* (物之用), though the *heart-mind* (心) may arise, it is itself hastening its own demise.\n\nWhen the *heart-mind* (心) is not drawn by the *mechanism* (机) of things, it instead makes things serve its own *operation* (用), which is the *heart-mind* (心) attaining its own life through its own demise. This is the meaning of *neither death nor life, nor life nor death* (不死不生，不生不死).\n\nHowever, the path of life and death is determined by using the eyes to observe the *mechanism* (机), serving as the *bridge for Dao/Way practice* (办道之津梁). The *heart-mind* (心) relies on the eyes’ *operation* (用), and must learn to remain as *immovable as the dead* (不动), which is the most crucial *observation* (上看).\n\n*A True Attainment* (一得) says: To be drawn by things and have one’s *emotions* (情) move is to *arise from things* (生于物). To be enslaved by things and have one’s *spirit* (神) exhausted—exhaustion leading to decay—is to *perish from things* (死于物). Though the *heart-mind* (心) experiences life and death through things, in truth, it has already transcended life and death.\n\nWhenever one *arises from things* (生于物), if one can *awaken and illuminate* (觉照), then the *mechanism of death* (死机) will vanish. The *mechanism* (机) is discerned solely through the eyes.\n\nThe eyes are the *Heavenly Eyes* (天目), located between the two brows—not the physical eyes—and serve as the *True One* (真一)’s foundation. By using the eyes to *gaze upon the mechanism* (瞩机), myriad threads of the *mechanism* (绪) emerge, shifting and unpredictable. Yet if the eyes can perceive the threads and grasp the *mechanism* (绪), the *mechanism* (机) cannot escape detection. The eyes’ *operation* (用) is indeed vast!\n\nThus it is said: *“The heart-mind arises from things and perishes from things”* (心生于物，死于物). And again: *“Its trigger lies in the eyes”* (机在目). This teaches that one must rely on the *True One* (至真一) for governance. Whether one employs its *operation* (用) depends on the *heart-mind* (心), hence the value of *heart-mind clarity* (心明). *Heart-mind clarity* (心明) is the ability to perceive *nature* (性), so the practice must focus on *heart-mind clarity* (明心) as both its beginning and end.\n\nExamining the *character \"mu\"* (目), it aligns with the *core principle* (主脑) of the *observation* (观) in the previous section. The *Sages* (圣人) employ the eyes precisely to illuminate the *heart-mind* (心), though their intent lies beyond the words.\n\nReflecting on the *upper and lower scriptures* (上下经文) in stillness, their profound meaning becomes evident. Beneath the *Dao/Way*’s apparent lack of *en* (恩), the greatest *en* (恩) arises. Even the swiftest thunder and fiercest wind cannot fail to stir the *innate response* (蠢然).\n\nThe *supreme joy* (至乐) is the *nature*’s overflow, the *supreme stillness* (至静) is the *nature*’s restraint. The *Dao/Way*’s ultimate *selflessness* (至私) manifests as ultimate *public benefit* (至公). Master Fan explains: The *non-separation of two* (二人之不间) refers to those who do not indulge in the *entanglements of mundane emotions* (尘情之拘扰), maintaining the *natural flow of the constant Dao/Way* (常道顺生). This is the state of *lacking en* (无恩).\n\nWhen the time arrives and the *supreme mechanism* (至机) appears, the *great medicine* (大药) is born. At this moment, one must distinguish *ren-gui* (壬癸) to harmonize *geng-jia* (庚甲). Swallowing this into the *abdomen* (腹中), it transforms back into the *primordial body* (乾体), granting *long life* (长生)—is this not the greatest *en* (恩)?\n\nYet the *confluence of metal and wood* (金木之并) lasts only as long as the *fierce wind* (烈风), and an additional *strike at the crown* (当头一震) causes a sudden awakening—*innate response* (蠢动)—and one breaks free from *madness and delusion* (狂迷), revealing the *Heavenly True Self* (天真吐露). This is entirely due to the *divine impact* (神此—击).\n\nThus, Master Lü said, *“Within the thunderous clap, the root is naturally attained”* (霹雳声中自得根), which serves as evidence.\n\nEven a *single clod of earth* (一厶之小土) struck from the *Fu position* (兑中) produces a *thread of white gold* (一丝之白金). Though small, it can nourish the *Six Harmonies* (六合). A *single clod of earth* (一厶之小土) is inherently *pure and tranquil* (清静), receiving a *drop of celestial yang* (一滴之青阳) without struggle or contention. Though its *restraint* (廉) is slight, the *function and operation* (功用) of the *two persons’ single clod of earth* (二人一厶土) belong to the *invisible private* (不可见之私). Yet when *Great Void* (太空) strikes with a single *resonance* (震), it returns to the *True* (真), revealing the *operation* (用) within the *single clod of earth* (一厶土) of *self and others* (人我), hence also called *public* (公). Thus, these *four “zhi” terms* (四至字) all point to the essence of *central harmony and preservation* (归中守中).\n\n*A True Attainment* (一得) says: *Supreme joy* (至乐) is the *nature*’s movement (动), *overflow* (余) is its external excess. *Supreme stillness* (至静) is the *nature*’s fixation (定), *restraint* (廉) is its internal constraint. The *dynamic response* (动) of thunder and rain is full and abundant, hence the *overflowing effect* (充溢之应). Swift thunder and fierce winds must transform, so one must guard against *excess and dissipation* (侈放之愆). *“Even the swiftest thunder and fiercest wind cannot fail to stir”* (莫不蠢动) is the *public operation* (用之公). Only those cultivating the *Dao/Way* (修道者) benefit from the wind and thunder, uniquely receiving *Heaven’s great en* (天恩) as *private* (私). The profound *Dao/Way*’s meaning here is such.\n\nNo sensation surpasses the impact of *wind and thunder* (风雷), so this passage aligns with the *orthodox interpretation* (正义) of *“good hearing”* (善听) from above. The previous passage corresponds to *“good vision”* (善视). Both passages emphasize the *spiritual acuity* (视听之灵) of the eyes and ears.\n\nOnly when one *responds to the mechanism without stagnation* (应机不泊) does the following passage on *subduing the beast* (制禽) unfold in its *operation* (用). Master Fan’s teachings can be selectively applied, but one must grasp their intent and practice within the *void and stillness* (虚寂). If one becomes mired in the *traces* (迹), it will no longer be the *Great Dao/Way* (大道).\n\nThe *subduing of the beast* (制禽) lies in *qi* (炁). Master Fan says: This passage specifically discusses *zui* (隹), illustrating the *marvelous operation* (妙用) of *Heaven and humanity* (天人) in unison. Its *operation* (用) is through *zui* (隹), not the *form* (形). This is akin to the *crane’s communication through sound* (鹤以声交).\n\nThe intent of *using zui* (用隹) is not the *zui within the body* (身中之隹). If one does not employ *cultivation strength* (功力) to control it, *zui* (隹) will not manifest. Without *zui* (隹), the *task and governing vessels* (任督) remain blocked, and the *paths of ascent and descent* (升降路) are obstructed. Even if attained, it will be lost, lacking the means for *summoning, subduing, concealing, and storing* (招摄伏藏).\n\nIndeed, *zui* (隹) is the *yang essence in humans* (阳人), gaining *yang* (阳) brings life, losing *yang* (阳) brings death. It is the *halfway point between immortals and ghosts* (仙鬼之各半). Practitioners of this *operation* (功) must *eliminate yin and augment yang* (去阴益阳).\n\nYet when the *spirit* (神) is lost in the *flurry of worldly affairs* (纷华), and *qi* (气) is depleted by *attachment and desire* (爱欲), without this *mechanism of mutual response and control* (相机以制，相感以隹), how could one return to the *original foundation* (本原)?\n\n*A True Attainment* (一得) says: Master Fan’s exposition here is worthy of the terms *profound and insightful* (玄解), with no flaw in its reasoning. It is regrettable that the *character \"guan\"* (观) in the previous section was not deconstructed according to the *Hongwu Zhenyun* (洪武正韵) but instead followed the *erroneous method of \"tie-ti\"* (贴体), leading to the misguided notion of *“applying the two mouths to the fine flower”* (用夫二口于佳花之上).*」\n\n「If one deconstructs the *character \"zhuì\"* (隹) as intended, then the meaning of this passage and sentence becomes clear. For *zhuì* is a swift and sensitive bird—when its mechanism is touched, it immediately acts. Hence, the *character \"jiàn\"* (见) is placed on its right.\n\nThis is how one discerns the nature of *zhuì*: by using *qi* (炁) to control it, so that *zhuì* does not perceive it. When the time comes and the mechanism is at hand, the two *qi* (炁) having met, *zhuì* will naturally cling and merge, forgetting its own thrust. Such is the meaning of the *character \"guān\"* (观), and its application lies in the *qi* (炁).\n\nWhat *qi* (炁) is this? It is the *qi* of the *Kun* (坤) element. For this bird is the *li* (离) crow, embodying the true essence of the *jīng* (精) and *liúzhū* (流珠). Its nature is swift and sensitive. Does it not say in *Cántóng Bù* (参同不云乎): *“The Great Yang flows the pearl, ever desiring to abandon [the vessel], yet ultimately attains the essence, transforming to sustain each other”*? What is this *jīnhuá* (金华)? It is the *qi* of the *Kun* element.\n\nWhen the time arrives, the *kǎn* (坎) marrow ascends—this is the *tùsuǐ* (兔髓), and when *kǎn* and *lí* unite, it condenses into white fluid, solidifying until it is firm. When condensed, it does not disperse—this is the *control* (制). Such is its effect, a marvel of nature’s operation. The key to its attainment lies in its pristine, undisturbed state.\n\n*The Classic of Changes* (易) states: *“Exalted is the *Kun* element, from which all things derive their life, thus following and conforming to Heaven.”* This is the essence of this passage, though Master Fan has not yet grasped it. Life is the root of death; death is the root of life. Grace arises from harm; harm arises from grace.\n\nMaster Fan says: *“Death is the Way’s constant operation; life is the Way’s inverted function.”* When the Way’s constant operation generates life, it means the *spirit* (神) is lost in emotional desires, and thus the *essence* (精), *qi* (气), and *spirit* (神) are depleted, inevitably leading to death. Hence, life is considered the root of death. When the Way’s inverted function generates the body, it means the *spirit* (心) is extinguished by emotional desires, so the *essence* (精), *qi* (气), and *spirit* (神) remain intact, inevitably leading to life. Hence, death is said to be the root of life. This aligns with *Zhìyáng’s* (紫阳) teaching: *“Only treat the gate of death as the gate of life; never mistake the door of life for the door of death.”*\n\nIn summary, by applying the Way’s inverted *mechanism of mutual response and control* (伏藏), one’s body not yet dead, must first learn the Way of death, only then can one achieve full life. Just as dragons and serpents rise from land due to the *tēng* (腾) of nurtured *qi* and blood; thunder and lightning strike, winds blow, because of the timing of the *Dāntái* (丹台) and *yuèyìn* (月印). Hence, grace arises from harm. When *jiānxié* (奸邪) is hidden within the realm, it marks the moment of inevitable collapse into theft and plunder; when leaves flourish and flowers bloom, it reveals the completion of *yin* depletion and *yang* return. Hence, harm arises from grace.\n\nThe following two sentences speak to the timing of the *fire candidate* (火候). Its relation to the *mechanism of mutual response and control* (相负) of *xíng* (刑) and *dé* (德) should be examined together. *A True Attainment* (一得) says: *“The five phases mutually generate life and death, hence grace and harm also rely on and conceal each other. This passage logically follows the text, and its meaning is sufficient. It serves as an introduction to the following section, continuing the significance of the *character 'zhì'* (制). The key lies in discerning *qi* mechanisms, preventing them from becoming excessive or one-sided, and responding to them with counter-control. Then success is achieved—harm is transformed into grace, death into life.”*\n\nThe next passage reveals the method for practical application. The *fire candidate* (火候) depends on timing, which is the means to verify the *qi* mechanisms’ sequence and reliance. The *adoption and extraction* (采取) lies in substances, which is the means to balance the excesses and deficiencies of *yin* and *yang* within one’s body. Its application is profound; its mechanism is subtle. Yet it does not exceed what this passage has spoken.\n\nThe purpose of this passage is to say that only those who exhaust their nature can achieve the Way’s full potential. From this passage onward, it focuses purely on the principles of life and death, yet within it still lies the nature that governs them. Master Fan’s explanation here also has merits worth adopting.\n\nThe unenlightened say: *“The patterns and principles of Heaven and Earth are sacred.”* I say: *“The patterns and principles of time and matter are profound.”* Master Fan says: *“Yú* (禺) is the mother monkey. The *Yú* of Heaven and Earth, with its abundant *qi*, naturally reveals the sacred patterns and principles, as the sign of *kǎn* and *lí* uniting, entering the center to form soil. This is the meaning of observing Heaven and Earth—it is not the mundane study of celestial omens and terrestrial features, but the profound range of the *numbers of the sun and moon* (日月有数), the *fixed order of great and small* (小大有定), and the *harmonious manifestation of Heaven and man* (天人合发). It is the Way of seizing the *spirit’s* mechanism and altering one’s fate, entirely contained here. Hence, the patterns and principles of Heaven and Earth are called sacred, as the unenlightened know them.”*\n\nI say: *“The numbers of the sun and moon, the fixed order of great and small, and the timing of mechanisms—by using the unmanifested *spirit* (不神之神) to compel it to steal these mechanisms, and thus reveal the sacred patterns and principles, the principles of time and matter harmonize the sacred and the profound. One can further, in the midst of chaotic material inducements, command the sacred patterns and principles of Heaven and Earth to operate silently within oneself, and thus balance the *qi* mechanisms through the profound principles of matter. This timing’s patterns and principles are what we encounter from morning to evening, in the most familiar and ordinary of places—this is the crucial key for transforming the sacred and the mundane.”*\n\nPeople cannot err in this; please examine it carefully.\n\n*A True Attainment* (一得) says: *“What is manifest externally is the *patterns* (文); what is internal and harmonious is the *principles* (理). Both the sacred and the profound understand and penetrate these. Though they may know the celestial patterns of stars and constellations, and the terrestrial principles of mountains and rivers, even if they understand the omens and symbols, they are merely traces of Heaven and Earth, not the Way of Heaven and Earth itself. ‘Time’ encompasses both Heaven and man. Heaven has fixed times, the human body has its own rhythms—these shifts and manifestations all have distinct patterns and orderly principles, which must not be misapplied when practicing. The use of time is vast indeed! ‘Matter’ refers to what is opposite to me, meaning humanity. The traces and symbols seen below coalesce into human patterns. The *spirit* (神) and *qi* (气) that manifest above each have their own order, and their responses and unions do not disrupt one another. The use of matter is broad indeed! Those who dedicate themselves to the Way all seek it from Heaven, Earth, time, and matter. Yet what people overlook is that the great Way lies within time and matter themselves. The flow of *qi* mechanisms through Heaven and Earth, when calculated and verified, is what the eye perceives—”*」\n\n「The interplay of ebb and flow in resonance with Heaven and Earth’s time and matter, silently embodied and verified, is unseen by the eye—this is the essence of *Yinfu* (阴符). Such is the principle of straightforward interpretation.\n\nThis passage illustrates the fundamental precepts of two traditions, each refining the essence of life and vitality through subtle yet profound mechanisms. The \"foolish and fearful\" approach to attaining sainthood refers to the female principle, as described in the *Zuozhuan* (《左传》): \"Women are the *yang* (陽) of matter; their nature is singularly tranquil and focused.\" One must begin with the mind, thus harmonizing with the innate patterns of Heaven and Earth’s *wenli* (文理, cosmic order) to merge with the *true unity* (真一) born from the union of *qi* and emptiness, forming the *sacred embryo* (聖胎).\n\nI, however, advocate the use of *wu xin* (無心, non-mindfulness), relying solely on the sufficiency of Heaven and Earth’s *wenli* and *qi* mechanisms. When the *qi* manifests in time, reaching ultimate emptiness and stillness, the *qi* naturally converges, and with true intent enveloping it, the *sacred embryo* is formed. For the *foolish* (愚, here referring to *Yin* or female principle) has no inherent mind; its *qi* is easily responsive. I, being inherently *zhong shi* (中實, complete and substantial), can only accept what is truly *void* (虚, empty). Such is the principle.\n\nThe core teaching of *Yinfu* reveals that the *foolish* (愚) and I each occupy our own realm, yet both possess *qi* mechanisms that transcend externally while never detaching from their own bodies. This creates a mystic interplay of presence and absence. The Three Realms (三才, Heaven, Earth, and Humanity) and the One Primordial (一元) fill the Six Directions (六合), and as we refine our practices, we each attain the realm of *voidness* (虚無). The Three Realms (三才) and Three Treasures (三宝), resting in *wu* (無, non-duality), meet in perfect harmony.\n\nWhen *wu* (無) encounters *wu*, their union is seamless and undivided. Yet within this void, each contains *yin* and *yang*; in emptiness, they copulate and transform. To describe its marvels, one would exhaust the bamboo of the Southern Mountains—yet still not suffice. The deeper the void and stillness, the more vibrant the interplay of all transformations becomes, and the more abundant what is produced will be.\n\nWhen one does not lose the proper timing, and in stillness receives the essence of matter, each gains their own fulfillment. The *foolish* and I, within this framework, each accumulate jade into mountains and spread gold across the earth. This is the foundation and manifestation of the earlier passage on \"Heaven’s Killing Mechanism\" (天发杀机).\n\nThe Sage unifies male and female, universally guiding all beings. Thus, there follows a further passage to elucidate distinct methods for transformation. Its essence is profound, yet its application is utterly simple and accessible. Yet few, past or present, have truly comprehended this text, for it was never transmitted through oral instruction.\n\nOnce one secretly grasps the master’s intent, the profound essence is revealed entirely—may those who see it strive together.\n\nPeople attain sainthood through foolishness and fear, while I do so without them. People seek sainthood through the extraordinary, while I do without it.\n\nTo sink into the depths of water and fire is to court self-destruction.\n\nFan Zhi (范氏) says: \"Foolishness\" refers to one who does not discern, does not know, and remains muddled and unaware. This is the saying that one must act like the foolish. \"Fear\" means dreading that others might perceive my actions, and it also refers to explaining the *central palace* (中宫) through words. \"Sainthood\" is not aligned with ordinary paths, hence the phrase \"attaining sainthood through foolishness and fear.\"\n\nI, holding the universe within my grasp, see all transformations birthed from the body. The interplay of *Kan* (坎, water/yin) and *Li* (離, fire/yang), the union of *jin* (金, metal) and *mu* (木, wood), the emergence of the sacred function and divine clarity—all arise naturally from the Way of *wu wei* (無為, non-action). Thus, I attain sainthood without foolishness or fear. This is the hidden meaning behind the phrase \"foolishness and fear\" (愚虞).\n\nOnce one attains this understanding: Fan Zhi’s mistaken interpretations stem from treating the text as exclusively for men, clinging to the literal meaning of the characters, and failing to receive oral transmission. Relying solely on private reasoning, he further misconstrues the Primordial as merely *one* (一), exhausting his mind in vain and falling into erroneous paths.\n\nIt is better to follow the text’s straightforward meaning, and its significance will naturally become clear.\n\n\"Fear\" (虞) is \"degree\" (度); \"Sainthood\" (聖) is \"universal clarity\" (通明). \"Foolishness\" (愚) means remaining fixed and tranquil like the foolish, though in truth, one is not foolish. \"Extraordinary\" (奇) refers to miraculous and divine applications. The Way of sainthood is natural, not extraordinary. Forcing extraordinary actions leads only to self-destruction.\n\nThe intent of this passage is to set the stage for the following discussion of \"naturalness\" (自然). Though it appears simple, its profundity is vast.\n\nIn the time of the Yellow Emperor (黃帝), the Way was spoken of without mention of *elixirs* (丹). Later ages introduced myriad explanations, yet they could be summarized by the two characters: *body* (身) and *mind* (心). According to this passage, it builds upon the previous one, presenting a fresh perspective—embracing the wonder of unity within multiplicity, and the grand Way of mutual completion.\n\nYet this is not achieved through artificial means. Hence, the following passage emphasizes the word \"natural\" (自然).\n\nIt states that one must enter through stillness (静), and that attaining the utmost stillness and emptiness to utilize extraordinary methods is the true practice. Even shattering the void into fragments is the ultimate goal.\n\nThe text still conceals its secrets, leaving them undivulged. The profound meaning of this passage must be unlocked through the oral transmission of Lu Zu (吕祖, Laozi’s immortal disciple).\n\nIf one says the previous passage spoke of the rules for entering, then within the cycles of day and night, large and small, there lies the application of divine clarity. This passage’ method, however, overturns all such applications—day and night, large and small, the patterns of time and matter, etc.\n\nThis is the art of encompassing the Three Realms (三才) as one, wearing lofty footwear and heavy robes, all as a single body. Moving and still, all living things are companions on the Way.\n\nThe innate nature encompasses the perfect whole like a suspended marble.\n\nYet, when the time comes to advance the fire or withdraw the talismans, one sits atop the marble’s apex to observe the fire’s readiness—this is the expansion of the *yīn-è* (鄞鄂) function. Once the fire’s readiness is complete, the body then penetrates into the marble, congealing and nourishing, thus resting the primordial spirit and also calming the *yīn-è*. At this moment, the ears and eyes perceive nothing, and the external form is foolish indeed—yet one does not know that great wisdom as foolishness is the path to sainthood. Heaven and earth undergo reversals, and the inner form is strange indeed—yet one does not know that harmonious interaction, not strangeness, is what makes one a sage.\n\nFor the previous passage’s method, it points to the true *qi* of the Three Realms dispersed as the expansion of my *yīn-è*—this is merely my true unity aiding, yet still unrelated to my primordial unity. This is but the Buddhist accumulation of relics in the body. The final passage’s extraordinary methods are the distinction of true unity, and their application is vast—all these are the ultimate principles of the Dao. If not aligned with the natural, one falls into peripheral doctrines. One sinks into fire and water.\n\nThe essence of the sacred scriptures is thus: The Dao of nature is still, so heaven and earth and all things are born. The Dao of heaven and earth is *jìn* (浸, permeating), so yin and yang prevail. Yin and yang interact, and transformation follows naturally.\n\nMaster Fan says: The Dao of nature being still is the primordial *Tàijí* in its pristine unity—stillness reaching its peak, then movement, generating heaven and earth as the grand ritual. The two forces interweave, then transform into all things—this reveals the natural cultivation of the primordial Dao in response to the times.\n\nYet the Dao of yin and yang, heaven and earth, is the ceaseless flow of *qi*, circulating and returning, gradually purifying until, at the appointed time, yin and yang prevail and interact. I then respond, filling and replenishing, making transformation smooth and ensuring all beings fulfill their nature—this reveals the phenomena of the postnatal *qi* conforming to the times. And conforming to heaven’s times is to know the moment when heaven and humanity act in unison—the time to move, the time to eat, the time of day and night’s waxing and waning—these are the roots of fire readiness.\n\nOne comment says: *Jìn* means mutual penetration and infusion. Yin within yang, yang within yin—thus, yin and yang prevail. Master Fan’s explanation here is deeply attuned to the Dao’s subtlety.\n\nYet one must know: when there is form, the function is equal to formlessness—reaching the point of utter formlessness while still appearing as if there were form. Upside-down, topsy-turvy—its profound meaning can be intuited but cannot be spoken. All is rooted in the utmost emptiness and profound stillness. Emptiness to its extreme means no obstruction, unhampered by postnatal influences, and able to refine with the Dao, returning to emptiness. Only then can one achieve stillness, and stillness brings clarity—when the moment arrives, one is aware, not confused, and actions are appropriate, avoiding the flaws of misaligned timing.\n\nThis is one moment, its mechanisms manifesting in primordial, postnatal, what should be welcomed, and what should be released. When it is time to advance, advance the fire; when it is time to withdraw, withdraw the talismans. Though natural, it must be guided by intent. And intent has its suppressions and elevations, its yielding and firmness, its slowness and haste, its penetration and concealment. From here, transformation arises, and saintly achievement emerges.\n\nThe late Master Tàixū Wēng said: “The sage transmits the medicine but not the fire, not because it is withheld, but because fire readiness arises with the times and acts according to the moment. Following a template like painting a gourd is impossible. The highest alchemical method is transmitted through the heart. The middle method must be orally instructed. The lowest method must be written down—its methods are cumbersome.\n\n*The Yīnxú* scripture’s text is in cloud-like seals, spanning over ten feet, obtained by the Yellow Emperor from the *Kōngtóng* Celestial Altar. Even the Emperor’s wisdom relied on question-and-answer to clarify it. The versions revered today are those the Yellow Emperor personally inscribed, though written, their profound meaning lies in heart transmission. To rest in the essence of the text is to grasp its highest teaching.\n\nLaozi further said: ‘Humans follow Earth, Earth follows Heaven, nothing follows the Dao, the Dao follows nature.’ The first sentence here, the Yellow Emperor has already revealed the essence. It shows that one must stand firm from before one’s parents were born, before heaven and earth existed, before creation left any trace. Knowing to align with nature is to return, drop by drop, to the source, and to merge, head by head, with the Dao.”\n\nHe also said: “The previous passage encompasses day and night’s waxing and waning, the patterns of time and matter—all things, sweeping them all away. Yet within this passage’s yin and yang transformations lies the meaning of knowing the times—this must be deeply understood. The intent of the previous passage warns against rigid adherence to forms; the intent of this text warns against neglecting the moment. My teacher, the *Níhuán* Master, said that what should be orally transmitted are precisely these profound truths.”\n\nOne comment notes: In this passage, the character “摧” (*cuī*, crush) in ancient and modern editions is uniformly written as “推” (*tuī*, push). Following the *Yìjīng*’s phrase “just and yielding push against each other,” this “摧” should indeed be “推.” The *Tàiwéi*律院’s hidden preceptor, with the national teacher and high scholar Wáng Kūnyáng, received transmitted artifacts. From the Chióu Ancestor onward, successive true persons passed down robes, bowls, scrolls, and as-you-will staves—among them, the *Kōngtóng Question-and-Answer*, bearing the Song Emperor Taizong’s imperial seal, titled as Chen Xīyí’s treasured edition, with Zhòngyáng Wángzǔ’s personally inscribed transmission precepts preserved. This is the ancient text from before the Song and Yuan dynasties, written with “摧.” Thus, this edition’s “摧” must have its source, not a scribal error.\n\nReferring to the *Yìjīng*: “The dragon battles in the wild, its blood black and yellow”—the meaning of mutual crushing. One comment thus retains “摧” as in Master Fan’s text.\n\nThe preceding passage’s phrase *\"knowing and cultivating\"* is rendered as *\"修之\"* in the *Lǜyuàn* Lü edition alone—other versions read *\"修炼\"*—its syntax being more archaic. For the *Fàn* lineage’s text must derive from the *Lǜzōng* tradition, its entire structure—chapters, sections, and phrasing—conforms strictly to the *Fàn* edition, not the divided titles of other versions. Thus, the Sage knew the **Dao of Nature** could not be defied and accordingly regulated it.\n\nThe **Way of Supreme Stillness** transcends the reach of calendrical and astronomical measurements. There exists a wondrous **instrument**—the source of all things, the origin of **qi**, the foundation of ten thousand transformations, and the progenitor of the *Yīnfú*. The Sage employed it as the initial ground for practice; with it, one may **establish** and **slay**; with it, one may **plunder** and **steal**; the non-divine becomes divine through its use; the eight trigrams, *jiǎzǐ* cycles, and water-metal correspondences all reverse their motion through it; the confluence of heaven and humanity, the meeting of spirit and concealment—all depend on its function.\n\nThis **instrument** is the art of **yin-yang overcoming**. When applied, it inevitably yields the **mouth-mouth elixir-pill’s** solar essence, hence its manifest symbolism. Yet it is mentioned in the final chapter, indicating its use at the culmination of practice.\n\nMen have identified this **instrument** as the *Xuāntāi*, the *Lúdǐng*, the *Dāntián*, or the *Tàijí*—is it not precisely the *\"round three-five, inch-one-fen, mouth-four-eight, two-inch lips, length one-zhang-two, uniform thickness\"* of the *Cāntóng Qìe*? Within it lies the secret of **mouth-to-mouth** and **orifice-to-orifice**. The term *\"proceed\"* (*jìn*) refers to its application.\n\nWhen the practice reaches the stage of using this **instrument**, all else is complete. Alas! The sacred text lies before us, the marvelous key is in the mind, creation is already manifest—why would one willingly abandon it and neglect the urgent task? Exert yourself, exert yourself!\n\nOne who grasps this says: *\"This interpretation of ‘instrument’ does not harmonize with the text above and below—it is not the correct exegesis. His citation of the *Cāntóng Qìe* to define its form betrays a misguided adherence to commentators’ heresies, and must be rejected. Only when the *Hétú-Luóshū* annotates the ‘round three-five’ passage does it attain precision. If the ‘instrument’ is annotated with the *Hétú-Luóshū*, then perhaps it approaches the **Dao**.\"*\n\nThat which transcends form is called **Dao**; that which is within form is called **instrument**. The **instrument** is the **Dao’s** manifestation. Examining the character *\"instrument\"* (*qì*), one should regard it as **\"Dao\"** or interpret it as **\"measure\"** (*liáng*). All **instruments** have tangible substance, yet this **instrument** lacks substance; all **instruments** have size, yet this one has none; all **instruments** have interior and exterior, yet this one transcends them; all **instruments** have limits, yet this one is boundless. Hence it is called *\"wondrous **instrument**.\"* It encompasses heaven and earth, shapes all things—thus it is named **\"instrument.\"** It is the means by which heaven and earth generate, the origin from which all things emerge. Hence it is said: *\"It generates all things.\"*\n\nWhen spoken of in terms of its function, it is called **\"instrument.\"** When spoken of in terms of its essence, it is called **\"Dao\"**—the **Dao of Nature**. The **Dao of Nature** is still; calendrical and astronomical systems can measure the movements of **post-heaven**, but cannot fathom the stillness of **pre-heaven**. The eight trigrams and *jiǎzǐ* cycles are all numbers within motion. What governs the eight trigrams and *jiǎzǐ* is this **wondrous instrument of supreme stillness**, possessing divine subtlety and hidden efficacy.\n\nIn **pre-heaven**, it leaves no trace to name; in the human body, it is called the *Xuānqiào*—yet even this is invisible. This entity, shared by all beings in **pre-heaven**, is the foundation of their existence and the root to which they return. It is the source of all transformations, the origin of the Sage’s work. Cultivating the body through this **instrument** harmonizes the hundred bones; governing the world through it brings order to all things.\n\nThe Sage knew that heaven and earth possess the **Dao of Nature**, which no artificial **instrument** can replicate. Thus, he took this **wondrous instrument**—the origin of all things—as the foundation to regulate the patterns of **yin-yang**, probing the root of life’s emergence, so that all transformations arise within the body. Internally, it is applied to the self; externally, to the world—both yielding divine subtlety and hidden efficacy.\n\n**\"Divine\"** refers to the extension of **yang-qi**, hence *\"machine.\"* **\"Ghostly\"** refers to the return of **yin-qi**, hence *\"concealment.\"* When **yin-yang overcoming** achieves balance, all things generate from this **instrument**, though it lacks form yet manifests symbolically—this is the ultimate function of observing the **Dao of Heaven** and embodying its operations.\n\n*Fàn* relied on private speculation to distort the Great **Dao**; yet his words are preserved here. Perhaps heretical interpretations may now cease.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "阴符经玄解正义 归安闵一得笺注 阴符经玄解者，范一中所着，名曰玄解而义不轨于正，遗误非细，故述本经之义以正之。 一得亦深惧饶舌之罚，惟是阴符经注凡数十家，各有玄义，何敢敢轻议而谓是，的解则未能治于心。 先师太虚翁遗有泥丸李真人《三一音符》一书。 其后跋有曰：阴符一经为崆峒授受之文，不得口传，无由心领。 吾昔受教于二五道人，退而思之说，虽切近，而谓大道已赅，则心悉不安，反复探索有年。 一日泥丸氏老师自远方来，谓余曰：“余首所闻，实是杏仙因文会意。 奥诀贵能通会，舍迹求玄，则得矣。 近闻自牧氏着有阴符发秘，然其言连心不普。 夫阴符正宗，太上传之西域。 达摩东来复传中国，此即世间教外别传，乃即心即佛，即色即空之妙旨。 我宗祖师长春真人身体而力行之，其道传自火龙真人，重阳王祖。 王祖晚岁得闻，取以印证于纯阳吕祖。 吕祖曰：是经玄旨在于观天执天。 相机取舍，作用合时。 个中玄义在于日月一节。 阴阳体异，立基各判，各有妙用在于愚人一节。 别开生面，触处洞然，皆有滴滴归源之妙在于人以一节。 究其启发心传，在于“不”字，诀中之诀在于是经末节，是皆于虚极静笃中讨消息。 而其入手在于静字，致之中和在于杀（去声）字。 更须于末“奇器”两字里作胎养入圣之究竟，盖有澈终之妙在也。 汝可先于篇中盗字参之。 盗者，物次于皿之谓也。 此盗字尚有端倪，而所次惟元，圣人言之，盖惟培养色身，而元中有一故。 亦可谓之培性，令汝先参盗字者以此。 至于奇器之为物，难言也，迹求不得，形忘刀现。 圣人以道不外身，用以浑炼，炼成神舍。 动时鸢飞鱼跃，静则万籁无声。 白长真元日返于一，不复有我神舍，靖矣。 然有鄞鄂尚未修焉。 于是聚精会神，虚位以凝，真一盈充一身，以浑合三才，须等色相于虚无，持之以俟。 时至，三才之元必合个中，富庶若固有之。 化化生生，听之自然，纯之又纯，三才之元化成一宝珠，惚兮恍兮，悬于我前，鄞鄂完矣。 已而珠我忽合，惟觉光明无际，此是三才真一与我真一合一不二，乃谓胎结于器，即奇器也。 奇器之用大矣哉！ 然穷其初功，还自炼己始，炼已功纯，乃可从事奇器焉。 经虽示末节，而此理圣凡男女咸处具于性体者。 世人专贴男子说，误也。 第其正用，即在天人合发一节。 故曰：不得口传，难以心领。 是经之大略如此。 读此经者心眼贵明，离合字体，固为玄妙，然须会而通之，维持调护，触类圆通。 法无定法，不外于消息生杀四字。 盖有双管齐下处，指不胜指，处处有之，切不可忽，尤不可穿凿。 一失正旨，而横坠三肢，救不及救者也。 居我语汝，从事此道步骤推三。 始则自有人无； 继则无中有； 末则摄有归无。 是即退密于密之义，无非出于自然。 盖有莫之为有者在也。 天仙大道备是经矣。 修道而舍是经，将何所适从。 以是经为体，大用之则可医世； 小用之则三千行满，八百功圆，亦可以证果。 王祖拜而受之。 斯论也，王祖述之，邱祖志之，未尝笔之书，历授至余。 近闻好事者误会正解，语涉阴阳邪说，是文祸世之文，余为世道述玄旨。 汝其志之。 ”太虚翁拜而受之，笔此语于《三一音符》之后。",
      "translated_text": "**\"The Profound Explication of the *Yin Fu Jing* – Rectified by Ming Yi’s *Return to One* Annotation**\n\nThe *Yin Fu Jing*’s *Profound Explication* (*Xuan Jie*) was composed by **Fan Yizhong**, yet its name belies its adherence to orthodox meaning—its errors are not slight. Thus, I expound the original text’s true intent to correct them.\n\nI too fear the punishment of idle chatter, yet *Yin Fu Jing* has been annotated by tens of scholars, each offering profound interpretations. How dare I presume to assert correctness while my own understanding remains shallow?\n\nMy late master, **Tai Xu Master**, left behind a clay bead text by **Li Zhenren**, titled *Three-in-One Resonance Symbols* (*San Yi Yin Fu*). Later, he appended a note:\n\n*\"The *Yin Fu Jing* is a single scripture from the **Kongtong** lineage, not to be spoken aloud, nor grasped by the mind alone. I once received instruction from **Er Wu Dao Ren**, but though his words were close, his claim that the Great Dao was already contained left me unsettled. For years, I pondered and re-examined it.\n\nOne day, **Li Zhenren’s teacher** arrived from afar and told me: ‘What I first heard was **Xing Xian’s** interpretation—his meaning conveyed through the text. The essence lies in transcending traces to grasp the profound. Only then will you attain it.\n\nRecently, I heard of **Mu Ji’s** *Unveiling the Secrets of the *Yin Fu Jing***, yet his words fail to universalize the heart’s connection. The *Yin Fu Jing*’s true lineage was transmitted by the **Laozi** to the Western Regions. When **Bodhidharma** returned to China, he transmitted it once more—this is the **secret transmission beyond worldly teachings**, the marvelous principle of **mind is Buddha, form is emptiness**.\n\nOur sect’s founder, **Zhang Chun Zhenren**, embodied and practiced it. His Dao descended from **Huolong Zhenren**, then **Chongyang Wang Zu**. In his later years, **Wang Zu** heard it and verified it with **Chunyang Lu Zu**. **Lu Zu** said: ‘The scripture’s profound essence lies in **observing Heaven and holding Heaven** (*guan tian zhi tian*). Adapt according to circumstances, act when the moment aligns. Its core secret is the **harmony of sun and moon** (*ri yue yi jie*).\n\n**Yin and Yang** differ in essence, yet their foundation diverges—each has marvelous applications in the **foolishness of the sage** (*yu ren yi jie*). It unfolds a fresh perspective, piercingly lucid at every touch, all converging in the **return to the source** (*gui yuan yi miao*) within humanity’s **harmony** (*ren yi jie*).\n\nDelving into its awakening and heart-transmission, the key lies in the **‘not’** (*bu*). The ultimate secret is found in the scripture’s final passage—all is derived from **ultimate stillness within the void** (*xu ji ding du*). Yet its initial approach is **stillness** (*jing*), and its culmination in **central balance** (*zhong he*) rests on the **‘kill’** (*sha*, *killing*—as in *nei sha*).\n\nFurther, nurture within the final **‘strange vessel’** (*qi qi*)—this is the ultimate path to sainthood. The sage’s method lies in **the Dao not being external to the body**, refining it into a **divine dwelling** (*shen she*). When active, it moves like **cranes in flight and fish in leaps**; when still, it is **silent as the ten thousand sounds cease**. The **True One** (*zhen yi*) returns to **original essence** (*chang zhen yuan*), and no longer is there ‘I’ or ‘divine dwelling’—**tranquility** (*jing*) is achieved.\n\nYet **obstacles** (*ni e*) remain unrefined. Thus, gather **precision** (*ji*) and **divinity** (*shen*), concentrate in the **void** (*xu wei*), and let the **True One** (*zhen yi*) permeate your body. **Fuse** (*hun he*) the **Three Talents** (*san cai*), awaiting the moment when **form vanishes into emptiness** (*se xiang yu xu wu*). When time arrives, the **essence of the Three Talents** (*san cai zhi yuan*) will naturally coalesce within you—abundant as if eternally possessed.\n\n**Transformation and birth** (*hua hua sheng sheng*) unfold spontaneously, pure and ever purer. The **Three Talents’ essence** (*san cai zhi yuan*) crystallizes into a **single treasure pearl** (*yi bao zhu*), dim yet luminous, suspended before you. The **obstacles** (*ni e*) are resolved.\n\nThen, the **pearl merges with you** (*zhu wo hu he*), and you perceive **boundless light** (*guang ming wu ji*). This is the **True One of the Three Talents** (*san cai zhen yi*) uniting with **your True One** (*wo zhen yi*)—**non-duality** (*he yi bu er*). Thus is the **embryo sealed within the vessel** (*tai jie yu qi*), the **strange vessel** (*qi qi*) itself.\n\nThe **strange vessel’s** function is vast indeed! Yet tracing its origin, it begins with **self-refinement** (*lian ji*). Only when **self-refinement is pure** (*lian ji gong chun*) may one engage the **strange vessel**. Though the scripture points to its end, this principle applies universally to **sages and commoners, men and women alike**—all who possess **inherent nature** (*xing ti*).\n\nThe world misinterprets it by clinging to male-centric explanations—this is erroneous. Its true application lies in the **unification of Heaven and humanity** (*tian ren he fa yi jie*). Hence, it states: ‘It cannot be transmitted by mouth, nor grasped by the mind alone.’\n\nSuch is the gist of this scripture. Those who read it must **clarify their heart’s insight** (*xin yan gui ming*). Though **‘separation’** (*li*) and **‘union’** (*he*) of characters and forms appear profound, they must be **integrated and understood** (*hui yi tong zhi*), sustained and nurtured, and applied with **penetrating insight** (*chu lei yuan tong*). There is **no fixed method** (*fa wu ding fa*), yet all revolves around the **four principles of ‘consumption’** (*xiao*), **‘message’** (*xi*), **‘birth’** (*sheng*), and **‘killing’** (*sha*).\n\nThere are **dual paths** (*shuang guan qi xia*), too numerous to enumerate—each holds its own. Do not neglect them, nor force interpretations. A single deviation from the true meaning leads to **falling into the three calamities** (*san zhi*), beyond redemption.\n\nNow, I instruct you: the steps of this Dao are **threefold**. First, **humanity within the void** (*you ren wu ren*); next, **void within humanity** (*wu zhong you*); finally, **absorbing humanity into the void** (*she you gui wu*). This is the **hidden within the secret** (*tui mi yu mi zhi yi*), all emerging from **naturalness** (*ziran*).\n\nThe **Great Dao of Heavenly Immortals** (*tian xian da dao*) is fully contained in this scripture. To practice the Dao while abandoning it is to stray—where else would one follow?\n\nIf this scripture is taken as **foundation** (*ti*), its **great application** (*da yong*) can **heal the world**; its **small application** (*xiao yong*) fulfills the **Three Thousand Lines of Practice** (*san qian xing man*) and **Eight Hundred Functions** (*ba bai gong yuan*), and it can also **attain fruition** (*zheng guo*). **Wang Zu** bowed and received it.\n\nThis discourse, **Wang Zu** transmitted; **Qiu Zu** recorded. Never committed to script, it was passed orally until reaching me. Recently, those with misguided intentions have twisted the true meaning, veering into **obscenities of Yin and Yang** (*yin yang xie shuo*). Such texts bring calamity to the world. For the sake of the Dao, I expound its profound essence.\n\nYou must **take this to heart** (*zhi zhi*).\" **Tai Xu Master** bowed and received it, inscribing these words at the end of *Three-in-One Resonance Symbols*.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1221,
      "start_sentence": 0,
      "end_sentence": 60,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 23.900054693222046,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经玄解正义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "是书盖与阴阳经相表里也，一得藏之四十春秋矣。 兹因门下施生兆麟于案头探阅《阴符经玄解》，质之于余。 余取阅之，不觉为之三叹。 是难盖潘阳范君儒名宜宾者，据所闻而迷，其志可嘉，惜所闻不全，故其所解不正。 味其语句，中溺邪说，而以世传拆字诀证之，正合泥丸氏真人所谓祸世之文。 今且收入道藏。 盖我祖我师必早知，故宜明玄旨于八十年前，以救后世之迷惑。 可见大道不终晦也。 一得既沐师传，敢避玄罚乎？ 爰力谨述于范注之后，名是书曰《阴符经玄解正义》，志在绍述师传，昌明正道。 一得又按，阴符经解，《道藏辑要》所载者，有十真集解。 十真者，赤松子、子房张真人良、太极左宫葛仙翁玄、西山许真人逊、正阳帝君钟离祖师权、纯阳帝君吕祖师岩、华阳施真人肩吾、至一崔真人、明公海蟾帝君刘祖、玄英清虚曹真人道冲。 盖系凭沙演说者也。 文有唐通玄先生张果注、元混然子王道渊注、明时复初道人高时明订正，亦属乱笔。 一本沈亚夫注、一本苍崖氏注、一本元阳子颂，均属乩笔。 此外，古注善本有如：张洪阳序本，陈希未珍本，李荃注本，朱紫阳注本。 《辑要》均未收入，采书须具只眼也。 阴符经 范氏曰：阴者，太阴月也。 符者，太阴与太阳相交。 一年有十二次合朔，十二次圆满，引合朔圆满之期即为符候。 第太阴借日生光，内含真火，故又谓之火符。 至经者，即月节有五六之数，如海之潮汐，不失之谓。 前人以暗解阴及寸阴分之说，皆属错认。 此乃显言，太阴正见，太阴中有太阳真火，在依符盗取，诚为修道之玄范，是此三字为全章之秘旨云尔。 一得曰：斯解至切近，不支离，学者会斯解而归于正，则无蹈空之弊。 若泥斯解而以迹求，则坠入旁门，适以轻命矣。 上篇 观天之道，执天之行，尽矣。 范氏曰：道者，下交之义，如初功自首下走之意，合首走岂非道字乎。 而道功二人成大，今言天，乃纯阳之谓。 第此纯阳实非一人能居，必须二人，而二字即阴之谓，以二人而合归一处，又岂非天字乎？ 至观字中具妙义，是用二口于佳花之上，自必有日见之机，故以观字隐含其义也。 第阴阳之阖辟，如天之虚静，自然而然，现其交光。 的须效天之逆行，执中过渡，幸得一九以为造化枢机。 人体此施功，则阴符之秘在此。 二句为全经之纲领，以起下文也。 一得曰：范氏不得真传，徒泥拆字诀，因以诬圣惑众，纵其所闻有自，总是旁门。 盖此一节为全经总纲，依经直解，得在观天执天。 是以天字为体，观字、执字为用。 是故曰道，曰行。 道字无庸拆看。 道字拆看，乃属阴阳门不入品之最下乘。 其门开自番僧，汉后传入中夏，碧眼胡僧是也。 世有其书，为吾宗鄙弃者。 此道字直解为是，天字亦然。 惟观字拆之，却有妙理，而又不众正体拆看。 执字拆之，亦有理。 而采法须从观字正体体入，加功于虚于寂，则个中妙义妙应，层出无穷，洵光玄秘。 吾愿学者合而参之，其义极中正者，此节已有双管齐下之妙。 观字知从正体拆看，即玄解自见，头头是道矣。 天有五贼，见之者昌。 五贼在心，施行于天。 宇宙在乎手，万化生乎身。 范氏曰：二人之天，有眼、耳、鼻舌、身之五累。",
      "translated_text": "This book indeed corresponds internally and externally with the *Yin-Yang Classics*. I have held it for forty years.\n\nNow, my disciple Shi Sheng Zhaolin presented *The Profound Explication of the Yin-Fu Classic* (*Yin-Fu Jing Xuan Jie*) on my desk for my review. Upon examining it, I could not help but sigh three times.\n\nThis work belongs to Master Pan Yang, whose given name was Fan, of Rongyi. He derived his understanding from what he had heard, and though his intent was commendable, his transmission was incomplete, leading to an incorrect interpretation. His language is steeped in heretical doctrines, and he uses the world’s conventional *character-dissection keys* (*zhaizi jue*) to validate it—precisely aligning with what the True Person of the *Níhuán School* warned as *calamitous texts for the world*. I shall now include it in the Daoist Canon.\n\nMy ancestors and teachers must have known this long ago, hence the need to clarify the profound essence eighty years prior to avert future confusion. Thus, it is evident that the Great Dao does not remain obscured forever.\n\nHaving received the teacher’s transmission, how dare I evade the mysterious retribution? Therefore, I have carefully annotated it after Fan’s commentary, titling this work *The Rectification of the Profound Explication of the Yin-Fu Classic* (*Yin-Fu Jing Xuan Jie Zhengyi*), aiming to uphold the teacher’s transmission and illuminate the true Dao.\n\nMoreover, I note that the *Yin-Fu Classic*’s exegeses collected in *The Daoist Canon’s Essentials* (*Daozang Jiyao*) include the *Ten True Explications*. The Ten True Ones are: *Chisongzi* (赤松子), *Zhang Zifang* (子房张真人良), *Ge Xuanweng* (太极左宫葛仙翁玄), *Xu Xun* (西山许真人逊), *Zhongli Quanshi* (正阳帝君钟离祖师权), *Lü Yanshi* (纯阳帝君吕祖师岩), *Shi Jianwu* (华阳施真人肩吾), *Cui Zhiyi* (至一崔真人), *Liu Haichan* (明公海蟾帝君刘祖), and *Cao Daochong* (玄英清虚曹真人道冲). These are all based on *sand-writing* (*sha shuo*) transmissions.\n\nIts texts include the Tang-era *Zhang Guofu’s* (*Zhang Tongxuan*) *Explication*, the Yuan-era *Wang Daoyuan’s* (*Hunranzi*) *Explication*, and the Ming-era *Gao Shiming’s* (*Shifuxu Dao Ren*) *Corrections*—all mere scribbles. There is also *Shen Yafu’s* version, the *Cangya School’s* version, and *Yuanyangzi’s* version—all *spirit-writing* (*ji pen*) works. Beyond these, ancient annotated editions include: *Zhang Hongyang’s* preface version, *Chen Ximu’s* treasure version, *Li Qian’s* annotated version, and *Zhu Ziyang’s* annotated version. *The Essentials* did not include them—collecting texts requires discernment.\n\n**The *Yin-Fu Classic***\nFan said: *Yin* refers to the Great Yin (month), while *Fu* denotes the interaction between Great Yin and Great Yang. A year has twelve conjunctions and twelve full moons, and the period of these conjunctions and full moons is called *Fu* (omens). Since the Great Yin borrows light from the sun, it internally contains true fire, hence it is also called the *Fire Fu*. As for *Jing* (Classic), it refers to the five-six numbers of lunar nodes, like the tides of the sea, never failing. Previous scholars mistakenly interpreted *Yin* and *cun-yin* (inch-yin) divisions as obscure—this is entirely erroneous. This is a clear exposition of the Great Yin’s true sight: within the Great Yin lies the true fire of the Great Yang. To depend on this *Fu* to steal (the essence) is indeed the profound standard for Daoist cultivation—these three characters hold the chapter’s ultimate secret.\n\nI say: This interpretation is supremely close and unerring. Scholars who grasp this will return to the true path, avoiding empty speculation. If one clings rigidly to this interpretation and seeks it superficially, one will fall into heterodox paths and risk one’s life.\n\n**Upper Section: Observing the Dao of Heaven, Grasping Heaven’s Practice—Exhausted.**\nFan said: *Dao* (Way) implies mutual interaction, like the initial function descending from the head—merging the head and descending, is this not the meaning of *Dao*? Yet the Dao’s function requires two persons to achieve greatness. Now speaking of *Heaven*, it refers to *Pure Yang*. This Pure Yang cannot be occupied by one alone; it requires two, and these two characters signify *Yin*. When the two merge into one, is this not the meaning of *Heaven*? As for *Observing* (*guan*), it contains profound implications: using two *mouths* (口) upon a *flower* (花), there must be a mechanism of daily revelation, hence the *Observing* character subtly contains its meaning. The opening and closing of Yin and Yang, like Heaven’s emptiness and stillness, naturally manifest their intersecting radiance. One must emulate Heaven’s retrograde motion, grasp the central transition, and fortunately attain the *Nine* as the pivot of transformation. Applying this practice to the human body reveals the *Yin-Fu*’s secret.\n\nThese two sentences serve as the entire Classic’s framework, introducing the following text.\n\nI say: Fan did not receive the true transmission, blindly adhering to *character-dissection keys*, thereby falsely accusing the Sage and misleading the masses. Though his transmission may have origins, it is ultimately a heterodox path. This passage is the entire Classic’s overarching principle—directly interpreting the text yields *Observing Heaven, Grasping Heaven*. Thus, *Heaven* is the essence, while *Observing* and *Grasping* are its applications. Hence it is said: *Dao*, *Practice*. The character *Dao* requires no dissection. Dissecting *Dao* belongs to the lowest tier of Yin-Yang schools, unworthy of entry. This path originated with foreign monks, transmitted to China after the Han—those blue-eyed barbarian monks. Though their texts exist, our school despises them.\n\nThe direct interpretation of *Dao* is correct, as is *Heaven*. Only when dissecting *Observing* does profound meaning emerge—yet not through conventional character dissection. Dissecting *Grasping* also yields meaning. However, the method must enter through *Observing*’s true form, applying effort to emptiness and stillness, where boundless wonders unfold—truly the luminous and mysterious secrets. I wish scholars would combine and verify these interpretations. The most central and correct meanings are already revealed in this passage’s dual approach.\n\nIf one knows to dissect *Observing* through its true form, the profound exegesis will naturally appear—every aspect will align with the Dao.\n\nHeaven has five thieves; those who see them prosper.\nThe five thieves reside in the heart, manifesting in Heaven.\nThe universe lies within the hand; ten thousand transformations arise from the body.\n\nFan said: The two persons’ *Heaven* encompasses the five senses—eyes, ears, nose, tongue, and body—these are the five burdens.",
      "overlap_context": "** transmitted; **Qiu Zu** recorded. Never committed to script, it was passed orally until reaching me. Recently, those with misguided intentions have twisted the true meaning, veering into **obscenities of Yin and Yang** (*yin yang xie shuo*). Such texts bring calamity to the world. For the sake of the Dao, I expound its profound essence.\n\nYou must **take this to heart** (*zhi zhi*).\" **Tai Xu Master** bowed and received it, inscribing these words at the end of *Three-in-One Resonance Symbols*.",
      "start_char": 1221,
      "end_char": 2461,
      "start_sentence": 61,
      "end_sentence": 115,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 17.95446753501892,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经玄解正义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "识此五者为我之累，是能见之，而功中却不离此五贼之用。 要人心识五贼，而以五贼致用于人，为彼之累，切不可使五贼为我之累也。 盖施五贼于二人之天，不过如匈狗之用，将阴阳我握在手，使五贼扰累于人，的须万变应机，则万化生生于我之身矣。 一得曰：范氏此解，悖谬极矣。 乃论圣经专为男子而设，其见己私，是精灵作用，范氏未知思耳。 诡道求成，必遭雷殛死，堕蛇狐，甚则沦入蛤蚧之属，为人作房中媚药之用，其业报必至如此。 岂知是节，乃圣人修省之学，发明上节现执二字之旨。 言五行正，则为五德，邪则为五贼，重在一见字。 偏胜则为五贼，心能察之，而顺天之施行，则可权操乎手而万化生乎身矣。 男妇皆受天地之中以生，各正性命，岂有损彼益此之天道耶。 谨按经旨言五行之用，德中有刑，制其过而用其中，则万化之原不为贼耳。 是统男女而概示修省者，斯谓之大道。 天性，人也； 人心，机也； 立天之道，以定人也。 范氏曰：二人之天，生来本小，有自然之五贼，此五贼之机现前，莫不生之于人心。 心识此机，假目以观，故称机心也。 知之者，息此机心于内，用此机心于二人之天，以立道基。 而此道基之立，不离乎先天‘六一之铅’，正以‘六一’二字指人以定之。 是心与性，天与人，为道之必用。 无咫尺之还，无丝毫之惑也。 一得曰：此解大旨已错，何论其人也。",
      "translated_text": "Recognizing these five as my burdens, one can see them, yet within practice, one never departs from the use of the five thieves. The key lies in the human heart recognizing the five thieves, then applying their function to others—making them their burdens, never allowing them to become my own.\n\nIndeed, applying the five thieves to the *Heaven* of the two persons is but like the use of a hunting hound: to grasp yin and yang in one’s hand, to let the five thieves trouble others, one must respond with ten thousand transformations as circumstances demand—thus, ten thousand transformations arise from my own body.\n\nOne scholar remarked: *\"Fan’s interpretation is utterly perverse!\"*\nHe argued that the Scripture was written solely for men, revealing his selfishness—his vital essence and spirit at work. Those who pursue deceitful Dao to achieve their ends shall surely be struck by thunder and die, or become serpentine foxes, or worse, descend into the realm of geckos, used as aphrodisiacs in men’s chambers. Such karmic retribution is inevitable.\n\nHow could he know that this passage is the Sage’s discipline of self-examination, elucidating the meaning of *manifestation* and *grasp* from the previous section? It states that when the Five Phases are upright, they become the Five Virtues; when perverted, they become the five thieves—with emphasis on the word *see*. Partial excess becomes the five thieves; if the heart discerns them and aligns with Heaven’s operation, one may then wield them in the palm and let ten thousand transformations arise from the body.\n\nBoth men and women receive the central essence of Heaven and Earth to be born, each rectifying their nature and vital force—how could there be a Heavenly Way that harms one to benefit the other?\n\nCarefully examining the Scripture’s intent: the use of the Five Phases contains both virtue and punishment; restraining their excess and employing their moderation ensures that the source of ten thousand transformations does not become a thief.\n\nThis encompasses both men and women in demonstrating the discipline of self-examination—this is called the Great Dao.\n\nHeavenly nature is humanity; human heart is the mechanism; establishing Heaven’s Way to define humanity.\n\nFan said: The *Heaven* of the two persons is inherently small, possessing natural five thieves. This mechanism of the five thieves manifests before the human heart. When the heart recognizes this mechanism, using the eyes to perceive it, it is called the *mechanism-heart*. Those who know it must still this mechanism-heart within and apply it to the *Heaven* of the two persons to establish the foundation of the Dao. Yet this foundation of the Dao does not depart from the *preheaven ‘Six-One Lead’*—the term *Six-One* is precisely what directs humanity to establish it.\n\nThus, heart and nature, Heaven and humanity, are essential to the Dao. There is no inch of deviation, no thread of confusion.\n\nOne scholar remarked: *\"This interpretation’s core is already erroneous—what need to discuss the man who proposed it?\"*",
      "overlap_context": " this passage’s dual approach.\n\nIf one knows to dissect *Observing* through its true form, the profound exegesis will naturally appear—every aspect will align with the Dao.\n\nHeaven has five thieves; those who see them prosper.\nThe five thieves reside in the heart, manifesting in Heaven.\nThe universe lies within the hand; ten thousand transformations arise from the body.\n\nFan said: The two persons’ *Heaven* encompasses the five senses—eyes, ears, nose, tongue, and body—these are the five burdens.",
      "start_char": 2461,
      "end_char": 3008,
      "start_sentence": 116,
      "end_sentence": 137,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 7.614739894866943,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经玄解正义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "既昧此节经旨，又不识得真一，邪说溺心，故将立字拆为‘六一’。 不知此节是言人禀天性而心为万化之机，经旨是示人尽性以立命。 盖以尽性为道基耳！ 区区六铅何足为道基哉？ 彼认六一为真一，岂知六一乃真元，是以认民为君矣。 此节言性，下节言命，而保命在性，故须尽性以立基。 只须顺理真解，则上下贯通，立字何须拆会。 天发杀机，移星易宿； 地发杀机，龙蛇起陆； 人发杀机，天地反覆； 天人合发，万化定基。 范氏曰：阳以星宿光明之机下照，是发于天也。 阴以龙蛇起腾机上现，是发于地也。 此乃分而言之也。 要合而言之，地发气腾固团天气之下交，即天发之光明亦因地气之上腾。 而人察天地感应之机，兆使阴阳颠倒逆回，此气全在二人合一不分，有一口之发，故于此际盗天地真一之气，夺阴阳造化之玄。 此正不生之生，不化之化，反离为乾之奥用。 无非以向定之人，而定我之根元也。 此中天人合发—句，为全经之秘旨密矣。 一得曰：此节乃极精大之理，奈何范氏误用邪说以会之，是真痴人说梦。 盖此一节，所以立命，而注意全在性功。 所谓凭他风浪起，我自不开船。 言当静定中看消息，雨过天晴，云开日现，迎机以道，万化自生，岂劳人力也哉。 据理直说，可以会悟。 所谓杀者，变化之理寓焉。 盖五行生气，莫不伏根于死气之中，如：金生水，水生木，是为木之祖，而木遇金则囚死，盖生气藏于死气之中也。 此即惨舒互为其根之机，非杀机。 则有伸屈，而其道穷矣。 星宿龙蛇，阴阳消长递嬗之迹象； 天地反覆，阴阳颠倒之义理。 化机生于逆中，生，顺也； 杀，逆也，逆以成顺，则万化定基矣。 按上六句统言三才感应之妙，下两句乃言含有无穷妙义，而诀惟于自然机发之初，相机调拨，无过不及，不先不后，间不容发耳。 此非虚之极其，静之笃，无从下手，范氏谓全经秘密是也。 然讹以坎为真一，而泥将合字拆作二人合口会之，则三家作证盟矣，于经旨岂不大谬哉。 一解杀字作去声读，盖即易经谦卦之义。 三才之情之性，无不恶盈而好谦者。 第按此义乃用于机发之后，为承启交关时手法，亦丹道须知之要着也。 节中定字，亦含有定订两妙义，此等作用无非为得真一张本，真一得则基立矣。 然非智巧所得取者。 苟或蒙昧，则当杀不杀，欲定不定，求合不合矣。 失之毫厘，谬之千里。 此节中之大关键也。 性有巧拙，可以伏藏。 九窍之邪，在乎三要，可以动静。 范氏曰：真一之气生自小中，非功不能勾取，非手不能托出其用，得宜全凭心生。 若为性所使，虽巧而返拙。 不为性所使，似拙而正大。 巧则退伏藏密之，为正似拙，实巧之作用也。 掠取真阴中之真，伏藏于密，前后升降，以周行任督，流通而不滞。 所以能悠久长存，正长生须伏气之谓。 庸人不知伏藏之奥，不谨九窍之邪，故失其生。 而九窍之最灵者，无过耳目口三者为至要。 三者用于动静之中，如太上所云：欲翕故张，欲弱故强，欲废故兴，欲夺故与之为也。 三藏于一，一中含三，虽专指此三者，而又不离西女为要，隐在其中，为圣功吃紧处也。 一得曰：此性字，指气质之性，伏藏不动之义。 拙者，锢于阴浊之累；",
      "translated_text": "Having obscured this passage’s true intent and failing to grasp the *True One*, their heretical doctrines ensnare the heart, leading them to dissect the character *立* as *\"Six-One.\"* They do not realize this passage speaks of humanity inheriting Heaven’s nature, with the heart as the mechanism of ten thousand transformations. The text’s essence instructs one to exhaust nature to establish fate—exhausting nature is the very foundation of the Dao! What use has the paltry *Six-Lead* for such a foundation?\n\nThose who mistake *Six-One* for the *True One* fail to see that *Six-One* is the *True Essence*, thus confusing the common for the sovereign. This passage speaks of *nature*, the next of *fate*, yet preserving fate depends on nature, hence the necessity of exhausting nature to establish the foundation. Only by following natural principles and true understanding will the upper and lower passages cohere—why dissect the character *立*?\n\nWhen Heaven unleashes its killing mechanism, stars shift their lodges; when Earth unleashes its killing mechanism, dragons and serpents rise from the land; when humanity unleashes its killing mechanism, Heaven and Earth reverse. When Heaven and humanity jointly unleash it, the foundation of ten thousand transformations is set.\n\nFan Zhi said: The Yang principle manifests through the luminous mechanism of stars and lodges shining downward—this is Heaven’s emission. The Yin principle manifests through the mechanism of dragons and serpents surging upward—this is Earth’s emission. This is but a divided explanation.\n\nYet when considered holistically, Earth’s rising *qi* clusters beneath Heaven’s *qi* in mutual exchange, and Heaven’s luminous emission likewise depends on Earth’s ascending *qi*. When humanity perceives the responsive mechanisms of Heaven and Earth, manipulating Yin and Yang to invert and reverse, this *qi* lies entirely in the undivided unity of the two persons. At this juncture, they steal the *True One*’s *qi* from Heaven and Earth, seizing the mysterious essence of Yin and Yang’s transformation. This is the non-birth that generates, the non-transformation that transforms—it reverses to fulfill the profound use of *Buqian* [the uncarved block]. It is nothing but stabilizing the fixed to stabilize one’s primordial root.\n\nThis phrase—*\"Heaven and humanity jointly unleash\"*—holds the entire text’s deepest secret.\n\nOne scholar remarked: This passage expounds the most profound and vast principle—how Fan Zhi misapplies heretical doctrines to interpret it, truly a fool speaking in dreams! This passage establishes fate, with full attention on cultivating nature. As the saying goes: *\"Let others ride the waves; I steer my own ship.\"* One must observe messages in stillness—after the rain, the sky clears; after the clouds part, the sun shines. Welcoming the mechanism with the Dao, ten thousand transformations arise naturally—why exert human effort?\n\nSpeaking directly by principle, one may awaken to understanding. The so-called *\"killing\"* contains the logic of transformation. For the Five Phases’ generative *qi*, none does not lie dormant within destructive *qi*—as when Metal generates Water, Water generates Wood, making Wood the ancestor, yet Wood encounters Metal and is imprisoned in death. Thus, generative *qi* hides within destructive *qi*—this is the mechanism of contraction and expansion, not *\"killing.\"*\n\nStars and lodges, dragons and serpents—these are the traces of Yin and Yang’s waxing and waning, their successive transformations. *\"Heaven and Earth reversing\"* refers to the principle of Yin and Yang’s inversion. The mechanism of transformation arises from inversion—*generation* is顺 (*shun*, \"harmony\"), *killing* is逆 (*ni*, \"inversion\"). Inversion yields harmony, and thus the foundation of ten thousand transformations is set.\n\nThe first six sentences broadly describe the marvels of the Three Powers’ responses; the next two reveal boundless profound meaning, with the key lying in the initial natural emission of the mechanism—responding appropriately, neither excessive nor deficient, neither premature nor delayed, with no room for error. This demands the utmost emptiness and deepest stillness to act—Fan Zhi’s claim that this is the text’s ultimate secret is correct.\n\nYet by mistakenly taking *Kan* [坎] as the *True One* and forcibly dissecting *合* as *\"two persons combining\"*, he aligns with the three erroneous schools. How greatly does this deviate from the text’s intent?\n\nOne interpretation reads *\"killing\"* with a falling tone, aligning with the *I Ching*’s *Qian* [谦] hexagram. The emotions and natures of the Three Powers all abhor excess and favor humility. Yet this meaning applies only after the mechanism is unleashed, serving as a technique for transition and interaction—also a critical move in Daoist alchemy.\n\nThe character *定* in this passage also contains the dual meanings of *\"stabilizing\"* and *\"affirming.\"* All such actions serve to obtain the *True One*’s foundation. Once the *True One* is attained, the foundation is established. Yet this cannot be artificially acquired through cleverness.\n\nIf one remains ignorant, they will fail to act when they should kill, or act when they should stabilize, seeking unity when they should not. A hair’s breadth of error leads to miles of deviation—this is the passage’s pivotal crux.\n\nNature has skill and clumsiness, capable of concealment. The nine orifices’ malevolence lies in the three essentials, governable by motion and stillness. Fan Zhi said: The *True One*’s *qi* arises from the small—without cultivation, it cannot be drawn; without technique, its use cannot be manifested. Its appropriateness depends entirely on the heart’s generation. If controlled by nature, even skill becomes clumsy. If not controlled by nature, clumsiness becomes genuine greatness. Skill demands retreat into hidden concealment—this is the apparent clumsiness, the true operation of skill.\n\nPlundering the *True Yin* within the *True*, concealing it in secrecy, circulating through the anterior and posterior pathways, ascending and descending along the Governing and Conception vessels, flowing without stagnation—this is how one achieves enduring longevity. The vulgar fail to grasp the mystery of concealment, neglecting the nine orifices’ malevolence, thus losing their life.\n\nOf the nine orifices, none are more vital than the ears, eyes, and mouth—the three essentials. In motion and stillness, they function as the *Taoist Canon* states: *\"To close, one must first open; to weaken, one must first strengthen; to abandon, one must first establish; to take, one must first give.\"* The three are contained within one, and one contains the three. Though specifically referring to these three, they do not depart from the *Western Woman* [a Daoist alchemical term], hidden within—this is the critical juncture for sacred cultivation.\n\nOne scholar remarked: The *nature* here refers to the *qi*-nature that is concealed and unmoving. The *clumsy* are shackled by the burdens of turbid Yin;",
      "overlap_context": "art within and apply it to the *Heaven* of the two persons to establish the foundation of the Dao. Yet this foundation of the Dao does not depart from the *preheaven ‘Six-One Lead’*—the term *Six-One* is precisely what directs humanity to establish it.\n\nThus, heart and nature, Heaven and humanity, are essential to the Dao. There is no inch of deviation, no thread of confusion.\n\nOne scholar remarked: *\"This interpretation’s core is already erroneous—what need to discuss the man who proposed it?\"*",
      "start_char": 3008,
      "end_char": 4234,
      "start_sentence": 138,
      "end_sentence": 194,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 14.912017822265625,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经玄解正义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "巧者亦役于事物纷应之累。 皆当伏藏不动。 久则大慧可生，巧不足言也，拙不足为害也。 谨按此节乃承上“基”字说来，言人秉性有巧拙，能知伏藏不用，则可不为九窍邪引。 忘巧化拙，诀在知守三要。 须动而勿动，所谓静亦静，动亦静也。 此节静能生慧之义，是示人养性之诀也。 范氏中溺邪说，又不明性命宗旨。 何谓勾取手托乎？ 性可觉而不可持，命可见而不可执，是皆极虚而无体质者也。 性命皆在虚寂中，生龙活虎，古经言之。 乃饮于西女凡体中勾取而手托之，其惟癸水手！ ？ 丹书曰：“见之不可用，用之不可见。",
      "translated_text": "The adept, too, is ensnared by the burdens of myriad responses to affairs.\nAll must practice concealment and stillness.\nWith time, great wisdom may arise—\nthe adept has no need for words,\nthe clumsy none for harm.\n\nCarefully examining this passage, it follows the earlier discussion of *\"foundation\"* [基],\nstating that though people are born with cleverness or clumsiness,\nthose who know to conceal and remain unmoving\nneed not be led astray by the nine orifices’ malevolence.\n\nTo forget cleverness and transform into clumsiness—\nthe key lies in guarding the three essentials.\nOne must move without moving,\nfor even in stillness, one is still;\neven in motion, one is still.\nThis passage reveals the meaning of stillness generating wisdom,\nshowing the method for nurturing one’s nature.\n\nFan Zhong’s [范氏] erroneous teachings further obscure\nthe essence of *nature* and *fate*.\nWhat is this \"hooking and supporting with the hand\"?\n*Nature* may be awakened but not grasped,\n*fate* may be perceived but not seized—\nboth are utterly empty, lacking substance.\n\n*Nature* and *fate* dwell within the void and quietude,\nalive with vitality, as the ancient texts say.\nYet to \"hook\" and \"support with the hand\" from the ordinary body of the *Western Woman*—\nis this not merely the water of *geng* [癸水]?\nThe *Elixir Scriptures* state:\n*\"What is seen cannot be used;\nwhat is used cannot be seen.\"*",
      "overlap_context": "ne must first strengthen; to abandon, one must first establish; to take, one must first give.\"* The three are contained within one, and one contains the three. Though specifically referring to these three, they do not depart from the *Western Woman* [a Daoist alchemical term], hidden within—this is the critical juncture for sacred cultivation.\n\nOne scholar remarked: The *nature* here refers to the *qi*-nature that is concealed and unmoving. The *clumsy* are shackled by the burdens of turbid Yin;",
      "start_char": 4234,
      "end_char": 4465,
      "start_sentence": 195,
      "end_sentence": 208,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 6.479703187942505,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经玄解正义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "”范氏应亦知之，何得出此门外汉语。 况坤中坎一，尚属真元，何关于性？ 其视性为何物欤？ 此节循行上节失手者而发，下节亦然。 此节眼目在伏藏，下节乃承此节末句而发。 究其主脏，要在明心，心明方能审机云尔。 火生于本，祸发必克； 奸生于国，时动必溃。 知之修炼，谓之圣人。 范氏曰：首二句言人无戒定之笃诚，为识神所使，投身妄作，一失其真，化为死腐，如火焚木之喻。 中二句乃双关为言，亦可如上二句之意看，又指三女为奸。 因有生于其身之动，我又因其动使之心溃，于天人合发之时，运我自然之杀机，返后天为先天。 知用此矢口修之，可谓圣功之人。 第此圣字耳，为坎口，为离，正谓坎离相交，得其一之气，归入中土为王也。 此圣字，幸勿略之！ 一得曰：范注大谬，不可从也。 不惟“知”字谬说，“圣”字解法亦不合字义。 “圣”字正体从“壬”不从“王”。 按此一书以“知”字为体，“修”字为用，承上节下句说来，其节旨在一“知”字，盖有体而后有用。 不知如何得修？ 修者，修之于动静之机，未现之先也。 知机乃可下手，故知节旨重—“知”字。 自可依文直解，无庸于字画中别寻秘旨。 其大要在五行之播，不可纵而无节，悬承上文而言，盖示毋忘杀字义耳。 首二句乃言生中伏杀，中二句乃言安不可怀，末二句乃言知修之妙。 据文直解言生之过，则杀机动，贼我者在内不在外也。 火本木中所生之气，而火发则木毁。 奸本国中所生之人，而奸动则国破。 几有防不及防之祸。 机已发，动则无及矣。 其机为何？ 生之过而无节制则为祸为奸，圣入戒之。 治世修身，道无二致，是经本义如此。 范氏之说极谬极曲，曰圣功，是真诬圣也。 至如拆知字为矢、口解之，自有三皇玉诀可证。 范氏所解，乃用近世传流口诀，不知玉诀所示，极堂皇，极冠冕，虽处通衡大庭，有矢口之用，岂仅不宽农，不解带，即使彼我不面，亦且远近不隔，所谓山河大地莫非护鼎，蠢动含灵无非药物。 第当空我色相，寂我思虑，只存—炁，无际无边，六合三才，视同粒粟。 我之个中光华内透，有若应感而出，其直如矢，旋见圣日圣月，金光照耀，五彩云霞，浮空随注，疾着飚风，无遮无碍。 已而日月合壁，悬我金庭，渐近渐缩，其小如豆，恍若佛前琉璃灯，个中大无不容，细无不纳，此之谓也。 斯时，不起一念。 初必有物来自虚无，觉我此中得有万种充和况味，但可领会，莫可端倪。 三圣谓此是真元之至，尚非真一。 真一之来，亦倏然自入，寂无声色，惟觉此中万分泰定，安若盘石，而莫可形容。 真元真一，如镞之赴的，此之谓矢。 盖即佛氏所称牟尼阿利也。 夫口也者，盖我道宗所谓玄窍，按即是经末节之奇器，一拳打破，即是佛氏之彼岸，儒家之无极也。 昔如来说法彼国，从学五千众，乃于寂宝光中，众见一光直入佛怀，佛若沉醉而苏，故有五千退席之说，盖言弟子讹认佛倦而退。 是可为矢口之一证。 范氏末之闻耳。",
      "translated_text": "Fan Zhong must also have known this—why then did he speak in such crude, vulgar terms?\n\nEven the *Kun* [坤] containing *Kan* [坎]—one—still belongs to the true *yuan* [元]. What relevance does this have to *nature* [性]?\nWhat does he take *nature* to be?\n\nThis passage follows the errors of the previous section’s lost grasp, and the next section does the same.\nThe focus here lies in *hidden treasures* [伏藏], while the next section builds upon the last sentence of this one.\nIts core organ is the heart—only when the heart is clear can one discern the *machinations* [机].\nFire arises from its root; when disaster strikes, it must be overcome.\nDelusion arises within the realm; when it moves, it must collapse.\nTo know this and refine—this is called the *sage* [圣].\n\nFan Zhong says:\nThe first two lines speak of those lacking sincere *precepts* and *meditation*, enslaved by the *spirit-recognition* [识神], casting their bodies into reckless action, losing their true essence, and turning into decay—like fire burning wood.\n\nThe middle two lines are a double entendre, also interpretable as the first two lines, but they also point to the *Three Women* [三女] as delusion.\nBecause there is movement generated within their bodies, and I, in response to their movement, cause their hearts to collapse—at the moment when *heaven* and *human* merge, I unleash my natural *killing intent* [杀机], reversing *post-heaven* into *pre-heaven*.\n\nTo know and apply this *arrow-mouth* [矢口] refinement—this is the work of the *sage*.\nBut this *sage* [圣]—its root is *Kan* [坎], it is *Li* [离].\nIt speaks of *Kan* and *Li* intersecting, drawing in the *qi* of one to return to the central earth as *king*.\n\nDo not overlook this *sage* [圣]!\n\nOne critique says: Fan’s annotations are utterly erroneous and should not be followed.\nNot only is his explanation of *knowing* [知] mistaken, but his interpretation of *sage* [圣] also violates the character’s meaning.\nThe *sage* [圣] is properly composed with *ren* [壬], not *wang* [王].\n\nAccording to this text, *knowing* [知] is the foundation, *refinement* [修] the application—following the last sentence of the previous section.\nIts essence lies in the single *knowing*—only with a foundation can there be application.\nHow can one refine without knowing?\nRefinement is to cultivate the *machinations* of motion and stillness before they manifest.\nOnly by knowing the *machinations* can one act—thus, the passage’s emphasis is on *knowing*.\n\nOne may interpret it straightforwardly without seeking hidden meanings in the characters.\nIts essence lies in the dissemination of the *Five Phases*—they must not be allowed to run wild without restraint.\nIt hangs upon the preceding text, warning: do not forget the meaning of *killing*.\n\nThe first two lines speak of *killing intent* hidden within life.\nThe middle two lines speak of the danger of complacency.\nThe last two lines speak of the subtlety of knowing how to refine.\n\nInterpreting it directly: if life’s excesses lack restraint, disaster and delusion arise—*sages* warn against them.\nThe *Way* of governing the world and cultivating oneself is one and the same—this is the text’s true meaning.\nFan Zhong’s explanations are utterly mistaken and twisted. Calling it *sage-work* is a true slander of the *sage*.\n\nAs for dissecting *knowing* [知] into *arrow* [矢] and *mouth* [口], there are the *Three Sovereigns’ Jade Precepts* [三皇玉诀] to verify.\nFan Zhong’s interpretation stems from later transmitted oral precepts, unaware that the *Jade Precepts* are grand and majestic—even in broad daylight, the *arrow-mouth* has its use.\nIt is not merely for loosening the farmer’s belt or adjusting one’s sash—even when facing an enemy, near or far, it makes no difference.\nIt is said: mountains, rivers, and the earth are all protectors of the *cauldron*; even the dullest living beings are potential medicines.\nOne must transcend the self’s form and color, still the mind’s deliberations, and retain only *qi*—boundless, without edge or limit.\nThe six directions and three talents are as insignificant as grains of millet.\nMy inner radiance shines forth, responding as if summoned—straight as an arrow, revealing *sage sun* and *sage moon*, golden light illuminating, five-colored clouds and mists floating in space, descending swiftly like a gust of wind, unimpeded.\nThen the sun and moon merge, suspended in my golden court, gradually nearing and contracting, small as a bean—like a lotus lantern before the Buddha, containing all within its vastness, admitting all in its subtlety.\nAt this moment, not a single thought arises.\n\nInitially, something emerges from the void, and I sense within myself a myriad of harmonious flavors and sensations—only to be intuited, never to be grasped.\nThe *Three Sages* [三圣] say this is the peak of *true yuan* [真元], yet still not *true one* [真一].\nWhen *true one* arrives, it enters suddenly and silently, leaving no trace of sound or form—only an awareness of boundless tranquility, steadfast as a mountain, beyond description.\n\n*True yuan* and *true one* move like an arrow to its mark—this is the *arrow*.\nIt is what the *Buddha* calls *Muni Alaya* [牟尼阿利].\n\nAs for *mouth* [口], it is the *Daoist* term for the *mysterious orifice* [玄窍], corresponding to the *wonderful instrument* [奇器] at the end of this text.\nA single punch shatters it—this is the *Buddha’s* *other shore*, the *Confucian* *Non-Extreme* [无极].\n\nIn the past, when the *Thus-Come-One* taught in that land, five thousand disciples gathered.\nWithin the *silent treasure-light* [寂宝光], they saw a light straighten and enter the Buddha’s embrace.\nThe Buddha seemed as if in a drunken stupor, then awoke—hence the tale of the five thousand withdrawing.\nIt was said the disciples mistakenly thought the Buddha was weary and left.\nThis serves as proof of the *arrow-mouth*.\n\nFan Zhong has never heard of this.",
      "overlap_context": "this \"hooking and supporting with the hand\"?\n*Nature* may be awakened but not grasped,\n*fate* may be perceived but not seized—\nboth are utterly empty, lacking substance.\n\n*Nature* and *fate* dwell within the void and quietude,\nalive with vitality, as the ancient texts say.\nYet to \"hook\" and \"support with the hand\" from the ordinary body of the *Western Woman*—\nis this not merely the water of *geng* [癸水]?\nThe *Elixir Scriptures* state:\n*\"What is seen cannot be used;\nwhat is used cannot be seen.\"*",
      "start_char": 4465,
      "end_char": 5600,
      "start_sentence": 209,
      "end_sentence": 257,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 13.070141553878784,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经玄解正义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "若夫经中“故”字，不必从拆字诀会，即以拆字论，亦自有正义。 是言文胜之机，则当反古，此即老子游心于物初之义，奈何证以三峰家作用哉！ 以上数百字，天仙大道尽泄于斯，原不应笔于此节，只因点破矢口。 若不和盘托出，则此知字精义不显。 非以功到此节，始用知字也。 以经义言之，自在天人合发二句中耳，见者审之。 中篇 天生天杀，道之理也。 范氏曰：天生者，常道之顺行也； 天杀者，返道之逆行也。 今以常道自然顺行之身，行逆道自然逆回之奥，故谓天生天杀。 而此专用逆回颠颠倒倒之妙理，方谓成圣登真之大道也。 一得曰：此节盖承上篇天发杀机一节之义理、条理也。 五行无杀机，则四序杂施，而无循环之理矣。 杀中有生，藏生于杀，所以秩然有理，递嬗而不穷也。 天地，万物之盗； 万物，人之盗； 人，万物之盗。 三盗即宜，三才乃安。 范氏曰：万物之荣枯随天地之运转，故天地为万物之盗。 人不能持守，被万物伐贼其真性，故万物为人之盗。 人若能保固不失，掠取万物之真，故人又为万物之盗。 三次之盗，始成一爻，九次之盗，方全乾卦。 个中之先后，不过用人之—口以合其宜，则三爻无非以女而得安全也。 一得曰：旧解“天地，万物之所盗； 万物，人之所盗； 人，万物之所盗”，此解最为直接。 谨按：经义承上，发此篇第一节玄理，而三才喻三田。 用时取宜，无违自然，而各有归，束一如奠，安三才之道。 盗字解见上。 太虚翁谓下篇之奇器，物物自具，故能互相为盗。 究此字之妙义，必须口授。 然不外乎若愚若拙而又若虚，则物得安，大要在一和字。 而范氏谓女而安，异哉！ 所谓既宜且安者。 盖言三田皆宜充裕耳。 第三田之充裕，各有一物，而驯致充裕，自有步骤。 精充则气充，气充则神充，神充精乃足，此则又有一道焉。 此节精义如此。 是则三才奠安之秘旨，其义见于下节。 故曰：食其时，百骸理，动其机，万化安。 范氏曰：故也者，接上文之安字，安十字于口，以返口中之真一。 斯有“故曰”之用食者，食大药也，即“得之者，常如醉”之谓也。 然必因彼之时至。 而彼之时至，必有机现动象。 动象，是机之动象，乃正食彼之时，即人为万物之盗也。 但具此兔髓乌精，人一食之，则周身之骸尽皆通理。 浊阴逐而化清阳者，必素日之退阴符进阳火周天之功。 有万遍之化精气神，是故一食之得安于化。 此万化又岂离女而得安乎。 一得曰：不失其时，而后能食其时； 不弗其机，而后能动其机。 “故曰”二字藏有妙义，亦见三皇玉诀。 其诀惟在返还，而不流复于邃古之初复命之义也。 致一之诀，其惟“曰”字乎。 “曰”也者，个中有一。 万缘故下，意缩身世人我个中，其大无际，一任气机流行，如云如霞，忽复万籁俱息，内外安定，即以意凝之，但觉油然，寂寂无声，三圣谓是真一之来归，乃是曰字玄象，此则所谓无象之象也。 着泥于形，则所得必伪。 能从虚无入手，则曰时，曰机，皆合道矣。",
      "translated_text": "The text within the *scripture* concerning the character **\"故\"** need not be deciphered through the *dismantling-character* key. Even if analyzed through such a method, its proper meaning remains intact.\n\nThis speaks of the principle of *textual mastery*—one must revert to antiquity, embodying the *Laozi’s* teaching of *\"wandering in the primal essence of things.\"* How could one verify this through the *Sanfeng* school’s *actions*?\n\nThe preceding hundreds of words exhaust the *Heavenly Immortal’s* Dao entirely. Originally, this should not have been recorded here, but since the *arrow-mouth* was pierced through, if not fully revealed, the profound essence of the character **\"知\"** would remain obscured. It is not that this knowledge is only applied at this juncture—rather, its meaning is embedded within the two phrases *\"self-so of Heaven and man\"* from the opening. Let the reader discern this.\n\n---\n**Middle Section**\n\n*\"Heaven generates, Heaven slays\"*—this is the principle of the *Dao*.\nFan Zhong says: *Heaven’s generation* is the natural unfolding of the eternal *Dao*; *Heaven’s slaying* is the inverted return against the *Dao*.\nNow, with a body that follows the natural, forward-moving *Dao*, one enters the inverted, counterflowing *mystery*—thus it is called *\"Heaven generates, Heaven slays.\"*\nYet this relies solely on the wondrous, inverted logic of *upside-down reversal*, which alone constitutes the *Great Dao* of attaining sainthood and true transcendence.\n\n*One who grasps this* says: This passage continues the meaning and structure of the earlier *\"Heaven’s killing intent\"*—if the *Five Phases* lack this killing intent, the four seasons would act chaotically, and the principle of cyclical return would collapse. Within *slaying* lies *generation*; *generation* is concealed within *slaying*—thus order arises, and transformation proceeds endlessly.\n\n*\"Heaven and Earth are the thieves of all things;\nAll things are the thieves of man;\nMan is the thief of all things.\"*\nWhen these three thefts are right, the *Three Powers* are at peace.\n\nFan Zhong says: The flourishing and withering of all things follow the revolutions of Heaven and Earth—thus Heaven and Earth are the thieves of all things. Man, unable to preserve himself, is ravaged by all things, stripping away his true nature—thus all things are the thieves of man. If man can guard himself without loss, seizing the true essence of all things, then man becomes the thief of all things. These three acts of theft complete one *trigram*; nine such thefts fulfill the *Qian* hexagram. The sequence within is merely the use of man’s *mouth* to harmonize what is fitting—thus the three *trigrams* are without fail secured through the *female*.\n\n*One who grasps this* says: The old interpretation—*\"Heaven and Earth are what all things steal; all things are what man steals; man is what all things steal\"*—is the most direct.\n\nCarefully examining the *scripture’s* intent: It follows the first profound principle of this section, using the *Three Powers* to symbolize the *Three Fields*. Applying them appropriately, without violating nature, each finds its proper place—bound as one, stabilizing the *Dao* of the *Three Powers*.\n\nThe meaning of *\"thief\"* is as explained above. *Taixu Wong* says that the *wonderful instrument* of the next section is inherently possessed by all things, enabling mutual theft. To fully grasp this character’s profundity, oral transmission is required. Yet it ultimately rests in being *as if foolish, as if clumsy, yet as if empty*—thus all things find peace, fundamentally relying on the principle of *harmony*. Yet Fan Zhong speaks of *\"securing through the female\"*—how strange! This refers to what is both *proper* and *secure*. It means the *Three Fields* must all be abundantly nourished. The abundance of the *third field* depends on a single thing, leading step-by-step to fullness. When *essence* is abundant, *qi* is abundant; when *qi* is abundant, *spirit* is abundant; when *spirit* is abundant, *essence* is fully sufficient—this is yet another *Dao*.\n\nSuch is the profound essence of this passage. The secret intent of stabilizing the *Three Powers* is revealed in the following passage. Hence it is said:\n*\"Eat in season, and the hundred bones harmonize;\nStir the mechanism, and the ten thousand transformations are at peace.\"*\n\nFan Zhong says: The *\"故\"* here follows the *\"安\"* [peace] of the preceding text, placing the ten characters *\"安\"* within the *mouth* to restore the *true one* within. Thus arises the phrase *\"故曰\"*—*\"food\"* refers to the *Great Elixir*, meaning *\"those who obtain it are ever as if drunk.\"* Yet this must await the opportune *time*. And that *time* must manifest its *mechanism* and *symbols*. The *symbols* are the movements of the *mechanism*—this is the true moment of consumption, when man becomes the thief of all things. But with the possession of *rabbit marrow* and *crow essence*, a single consumption makes the hundred bones throughout the body harmonize. The turbid *yin* is dispelled, transforming into pure *yang*—this requires daily practice of *retreat of the yin符* and *advance of the yang fire* circulating the *Microcosmic Orbit*. With ten thousand transformations of *essence, qi,* and *spirit*, thus one meal suffices to attain peace in transformation. How could this peace be achieved without the *female*?\n\n*One who grasps this* says: Only by not missing the *time* can one eat in season; only by not neglecting the *mechanism* can one stir the *mechanism*. The characters *\"故曰\"* conceal a profound meaning, also seen in the *Three Sovereigns’ Jade Key*. Its key lies in *returning*, not straying back to the ancient *\"initial restoration of command.\"* The secret of *unification* rests in the character *\"曰.\"*\n\n*\"Day\"*—within it lies *oneness*.\nFollowing the myriad *affairs*, the mind contracts within the *self, world, people,* and *individual*—its vastness is boundless. One lets *qi* and *mechanism* flow freely, like clouds and mist; suddenly, all sounds cease, and inner and outer are at peace. Then, with the mind focused, one feels a natural, silent stillness—*the Three Saints* call this the *true one’s* return. This is the *mysterious symbol* of *\"day,\"* the so-called *\"formless form.\"*\n\nTo fixate on the *form* leads only to falsity. Only by beginning with *emptiness* can *\"day,\" \"time,\"* and *\"mechanism\"* align with the *Dao*.",
      "overlap_context": " shore*, the *Confucian* *Non-Extreme* [无极].\n\nIn the past, when the *Thus-Come-One* taught in that land, five thousand disciples gathered.\nWithin the *silent treasure-light* [寂宝光], they saw a light straighten and enter the Buddha’s embrace.\nThe Buddha seemed as if in a drunken stupor, then awoke—hence the tale of the five thousand withdrawing.\nIt was said the disciples mistakenly thought the Buddha was weary and left.\nThis serves as proof of the *arrow-mouth*.\n\nFan Zhong has never heard of this.",
      "start_char": 5600,
      "end_char": 6768,
      "start_sentence": 258,
      "end_sentence": 316,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 18.926834106445312,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经玄解正义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "范氏所述，原属古仙假外众说内功之口诀，而云“岂离女而得安”，则打入邪说矣。 窃按：古字，知字，故字，曰字，虞字，圣字，等等均以识时为要。 然范氏但知泥用一时，不知时时可用。 盖时有活定两说，非仅子午有活定，自子至亥皆有活定。 所谓真一真元，不外一身，而又不泥一身者。 大约于起功之刻，自辨所值景况以定其时，此法最活而最灵。 以一身言之，其时有定活； 以三才六合言之，其时亦有定活。 故其互相感应也，定则应定，活则应活，间不容发，是以时之中有机焉。 时到则机动，机动则化行，是乃自然之妙理，自然之大道。 范氏直坐并观天耳！ 人知其神之神，不知其不神之所以神。 范氏曰：神者，阳也。 神之神者，阳中之阳也，即玄之又玄之谓也。 但此真阳藏于真阴之中，而取此真阳是矢口而得，吕祖所云口对口之神用。 试思以知字中分，岂非矢口两字乎？ 故谓之知其神之神也。 第此之用，不离乎寻常平淡，无一毫矫揉造作之举，似无为而却有为，有为中又却无为。 故谓之知其不神之所以神也。 要知取此阳气，的以奇器，用不神之神法，方其阳气之来，正父母未生前之始气也。 一得曰：此两知字，范氏未得真传，流入邪说，盖不闻虚无之中的有交感之妙义耳。 此节上句乃指物我气神相交于虚无之中所生之真元也。 下句乃言三才真元发扬于上之气，感我之气神上达而应之凝之，则虚无之中合并而生真一也。 谨按经义言，取物我平感合生之物，不过真元，故谓之神之神，不足贵也。 能得彼我气神上感两大，人元降合，虚无而生之物，乃是真一，得而有之，始成圣真之胎，是为至宝。 神与神会，故谓之神之神。 至合中所生一，则虚极矣，不可以神言也，故谓之不神之神也。 语气偏重下句，故有知、不知之别。 日月有数，大小有定，是功生焉，神明出焉。 范氏曰：日阳体属离，阴之小； 月明体而属坎，阳之大。 各有其数，日数须足十六，月数须足五千四十八日。 人以日月之行度为言，非也。 至云前三后三者，乃言甲庚之并，丁壬之合也。 假如成乾之初爻，先用甲前逆排三位癸后之壬并之，次用庚后顺排三位之壬，亦是甲前逆排癸前之壬并之，末又用甲前逆排三位癸后之壬并之。 此正前弦之后后弦前，前三后三之诀也。 如此三并而成乾卦之初爻，如此九并而成乾卦之三爻，方至纯阳地位。 此必日月之数足定，用此成圣之功，使五行攒簇于中宫，而神人生焉、出焉。 是神，人生成，非日月相合为明，未能成就，此正不神之所以神也。 第此之云前三后三，前弦后弦，甲庚丁壬之指，即是火符也。 日月数足，即火符数足。 发现之机，正知其神之神也。 吕祖师所云“遥指天边日月轮”，又云“地下海潮天上月”，崔希范云“天应星，地应潮”，莫不本此解。 实阴符成圣之大道，千古不传之奥义也。 一得曰：日月计庚甲，小大计阴阳，自是易理，范氏之说是也。 谨按此节发明上文“人知”句义，实为千古—鼻心传口诀，而经却以人知言之。 盖黄帝时，修道者多，此种经义，人人知之，故曰：人知其神之神也。 范氏不悟，以此节为不传之秘，是以此节为不神之神，未闻阴符最上上乘功法。",
      "translated_text": "「Master Fan’s account, though ostensibly a recitation of ancient Daoist immortals’ external techniques for internal cultivation, errs when it states *\"Shall one not depart from the female to attain peace?\"*—this is a deviation into heretical teachings.\n\nIn my view: ancient *characters* (古字), *knowing* (知字), *affairs* (故字), *day* (曰字), *Yu* (虞字), *sage* (圣字), and others all hinge upon discerning the *times*. Yet Master Fan only understands fixation upon a single *time*, failing to grasp that *times* may be used flexibly at all moments.\n\nIndeed, *times* have two modes—*fixed* and *active*—not confined solely to the *active* hours of *zi* (子) and *wu* (午). From *zi* (子) to *hai* (亥), each bears its own *fixed* and *active* properties.\n\nThe so-called *true one* and *true essence*, though rooted in the *self*, transcend mere fixation upon the *self*. Roughly speaking, at the onset of practice, one must intuitively perceive the prevailing circumstances to determine the *time*—this method is the most *active* and responsive.\n\nWhen considering the *self* alone, the *time* has *fixed* and *active* distinctions;\nWhen encompassing the *Three Powers* and *Six Harmonies*, the *time* likewise holds *fixed* and *active* nuances.\nThus, their mutual resonance: *fixed* responds to *fixed*, *active* to *active*—without delay, for within *times* lies *mechanism*.\n\nWhen the *time* arrives, the *mechanism* stirs; when the *mechanism* moves, *transformation* unfolds—this is the wondrous principle of nature, the supreme *Dao*.\n\nMaster Fan merely sits upright and gazes at the heavens—his ears attuned to the *times*!\nMen know the *divine* of the *divine*, yet fail to recognize the *non-divine* source of its divinity.\nMaster Fan says: *Divine* is *yang* (神者，阳也).\nThe *divine* of the *divine* is *yang* within *yang*—the *mysterious* yet deeper *mysterious* (即玄之又玄之谓也).\nYet this *true yang* dwells concealed within *true yin*, and seizing it is done through *direct* utterance—Brü’s *mouth-to-mouth* divine technique.\n\nConsider: within the *knowing* (知) character, is not *direct* (矢) and *utterance* (口) implied?\nThus, it is termed *knowing the divine of the divine*.\nThis very technique, though seemingly mundane and unadorned, holds no trace of artificiality—it appears as *non-action* yet is *action*, and within *action* lies *non-action*.\nHence, it is called *knowing the non-divine source of divinity*.\n\nTo grasp this *yang qi*, one must employ a *strange* vessel (奇器), using the *non-divine* divine method, for when the *yang qi* arises, it is the *initial breath* of the *parents* before their birth.\n\nA critic remarks: these two *knowings* (知), Master Fan failed to receive the true transmission, drifting into heresy. He overlooked the wondrous interplay of *exchange* within *emptiness*—the essence generated by the resonance of *self* and *other* within the void.\n\nThe upper line refers to the *true essence* born from the convergence of *self* and *other* in *emptiness*.\nThe lower line speaks of the *Three Powers’* *true essence* ascending through the *yang qi*, resonating with one’s own *qi* and *divine*—thus, within *emptiness*, the *true one* emerges from their union.\n\nExamining the scripture’s intent: the *essence* drawn from the mutual resonance of *self* and *other* is merely *true essence*—thus, it is termed *the divine of the divine*, yet unworthy of reverence.\nIf one attains the *great resonance* of *self* and *other’s qi* and *divine*, where the *essence* descends and merges within *emptiness*, generating the *true one*—this is the seed of *sagehood*, the supreme treasure.\n*Divine* meets *divine*, hence *the divine of the divine*.\nWithin the ultimate union, the *one* born is *emptiness* at its zenith—beyond mere *divinity*, thus termed *the non-divine source of divinity*.\nThe emphasis shifts downward, hence the distinction between *knowing* and *not knowing*.\n\nThe sun and moon follow their set cycles, their *fixed* and *active* properties yielding practice and enlightenment.\nMaster Fan says: the sun’s *yang* nature belongs to *li* (离), the lesser *yin*;\nThe moon’s *bright* nature aligns with *kan* (坎), the greater *yang*.\nEach has its own count: the sun requires sixteen, the moon five thousand four hundred eighty.\nMen mistakenly speak of the sun and moon’s degrees—this is incorrect.\nThe *\"three before, three after\"* refers to the pairing of *jia* (甲) and *geng* (庚), the union of *ding* (丁) and *ren* (壬).\n\nFor instance, in the *initial line* of the *Qian* (乾) hexagram:\nFirst, employ *jia*’s inverse sequence paired with *wu* (午) from *gui* (癸) to *ren* (壬);\nNext, use *geng*’s forward sequence paired with *wu* (午) from *gui* (癸) to *ren* (壬)—this is *jia*’s inverse sequence paired with *wu* (午) from *gui* (癸) to *ren* (壬);\nLastly, again employ *jia*’s inverse sequence paired with *wu* (午) from *gui* (癸) to *ren* (壬).\nThis is the *mechanism* of *\"three before, three after\"*—the *ascending* and *descending* phases.\n\nThus, three such pairings complete the *Qian* (乾) hexagram’s *initial line*,\nAnd nine such pairings fulfill the *Qian* (乾) hexagram’s *third line*—\nOnly then does one reach the *pure yang* state.\n\nThis requires the sun and moon’s *times* to be *fixed* and *active* in measure—\nTo perfect the *sage’s* practice, gathering the *Five Phases* within the *central palace*,\nWherefrom *divine beings* and *men* arise, emerge.\nThis is the *divine* and *men*’s fulfillment—\nNot through the sun and moon’s union yielding *brightness*, but by the *non-divine* source of divinity.\n\nThe *\"three before, three after\"* and *\"ascending, descending\"* references to *jia-geng-ding-ren* (甲庚丁壬) are indeed the *fire talismans*.\nWhen the sun and moon’s counts are fulfilled, the *fire talisman’s* count is complete.\nThe moment of revelation is the very *knowing* of the *non-divine* source of divinity.\n\nAs Brü’s master taught: *\"Pointing afar at the celestial sun and moon\"* and *\"below the earth’s tides, above the moon’s glow\"*—\nAnd as Cui Xi-Fan said: *\"Heaven responds to stars, earth to tides\"*—\nAll derive from this understanding.\nThis is the *Yin Symbol’s* supreme *Dao*, the untransmitted mystery of ages.\n\nA critic concedes: counting *geng-jia* (庚甲) for the sun and moon, and *yin-yang* (阴阳) for *great* and *small*—\nThis is indeed the *principle* of the *Yijing*.\nMaster Fan’s words are correct.\n\nYet, this passage elucidates the *\"men know\"* (人知) line’s meaning—\nA secret transmitted through the *nose’s center*, passed down orally for millennia,\nYet the scripture speaks of it as *\"men know\"* (人知).\nDuring the Yellow Emperor’s era, practitioners of the *Dao* were many—\nThis teaching was universal, hence it is said: *\"Men know the divine of the divine.\"*\nMaster Fan fails to comprehend, deeming this an untransmitted secret—\nThus, he calls it *\"the non-divine source of divinity,\"*\nUnaware that the *Yin Symbol’s* highest *highest* cultivation lies beyond his grasp.»",
      "overlap_context": "ual*—its vastness is boundless. One lets *qi* and *mechanism* flow freely, like clouds and mist; suddenly, all sounds cease, and inner and outer are at peace. Then, with the mind focused, one feels a natural, silent stillness—*the Three Saints* call this the *true one’s* return. This is the *mysterious symbol* of *\"day,\"* the so-called *\"formless form.\"*\n\nTo fixate on the *form* leads only to falsity. Only by beginning with *emptiness* can *\"day,\" \"time,\"* and *\"mechanism\"* align with the *Dao*.",
      "start_char": 6768,
      "end_char": 7996,
      "start_sentence": 317,
      "end_sentence": 364,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 23.226845264434814,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经玄解正义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "盖此节尚帖阴阳两家数足，时至机动之倾，平透平感之火候。 未曾说到六合三才，普感普应，浑—合交合生之修。 然已圣功生焉，神明出焉。 先师太虚翁故谓此节是贴上文首句说。 若夫最上上乘是从天地未有，父母未生前落脚，故无阴阳、五行、年月、日时等用。 一俟机动，节情归性，成一宝珠，吸入奇器。 日积月累，竟与三才真一合一不二，乃成圣胎。 如是则三才坏，而我自长存。 是为三皇时玄修功诀，尚非黄帝时人所得其知之秘。 上文下句乃指此，故有不知云云。 星乃百尺竿头功法，左右逢源，天下归仁之妙道。 一得所闻于先师者如此。 然，先师又谓此节玄理乃立身之本，此节遗忘，则最上上乘无由以精进者。 此一节何可暂遗也哉。 其盗机也，天下莫能见，莫能知。 君子得之固身，小人得之轻命。 范氏曰：盗者，道也。 圣功作用，观其机，以施盗于二人之夭。 则一七之真阳莫能目见，其下一七之真阳惟凭矢口中得之。 君子知二人之寸阳必须以十字大口、小口之法方得返来，以固其身而长存也。 小人不能自守，恃才忘作，流于邪道，丧身不悟，故云轻命。 此示人之邪正之吉凶也。 一得曰：此节“其”字，是指上节所言之道。 盗者，密取而藏之之义。 机者，彼我所发之机也。 不藏则散，故贵知盗。 莫能见，莫能知，故曰盗。 然，贵存普心，毋使偏胜。 盖含有“取与”两义。 知此谓之君子，昧此是为小人。 此其中盖有天命在焉。 观天执天者，何可忽诸盗机。 合乎天则固身，挟私以盗适以轻命矣。 得者，何得，此取与之道也。 谨按此节尚属小试之道，故有此诫。 范氏见不及此，故其所解，堕入轻命一流，不可从也。 下篇 聋者善视，瞽者善听。 绝利一源，用师十倍。 三返昼夜，用师万倍。 范氏曰：此指功中遇用美口之时，必须如聋者之善视，瞽者之善听。 二善喻专字之义，又含用口而心无口之谓也。 要知功中用盗，非口不能取。 丝色真一源头之利，惟口一源之用最为至要。 是先以耳目之用于机，得机上始用其口，而口一用，又缘十字以得之。 果以十字而三返根源，真如兵师之危厉。 此正火里栽莲，诚有万倍之获。 是全耳目口宵旦不辍，以成盗机之利，以起下文机心之用也。 “倍”字另有妙义，未敢笔之，请勿略也。 一得曰：上中两篇言其义理之当，然个中利弊亦道及。 下篇所言乃是功法，而义理遇焉。 从而去取损益于其间，则法备矣。 统而体之，在专一，在至静极虚而中无人我，一任自然，有有无无一以气机视之。 此中常寂寂，忘其寂，则可运至常应常静。 谨按此节首二句“专”义也，第三句“一”义也。 目利视，耳利听，聋瞽能绝其歧，则源一也。 其第四句集“益”之义也，而验于此。 得三返句，“恒”义也。 师，众也，《易》师卦之象言，畜众也，此正俦人广众之中有归仁逢源之大道。 三返昼夜，三十六时也。 三十六者，阴数之极也。 言能专而恒，则阴尽化阳，三十六宫都是春也。 十倍、万倍，约词也。 言专一则能用众，恒则愈能倍用之也。 “倍”字拆看，乃阴阳门地天作用，须连十字合参。 “万”字拆看，乃“艹禺”两字，艹属坤气，禺属阴类，此就范氏解法言之。 按理而论，用倍字作用，较胜范氏所宗。",
      "translated_text": "「This passage further elucidates the *Yin Symbol’s* (阴符) *principle* (理) of the *Dao/Way* (道) as the supreme path (大道) to sainthood (成圣), the untransmitted (不传) mystery (奥义) of millennia.\n\n　　A scholar remarks: the sun and moon are reckoned by *geng-jia* (庚甲), and *great* and *small* by *yin-yang* (阴阳)—this is indeed the *principle* (理) of the *Yijing*. Yet, Master Fan’s interpretation is correct.\n\nThe *Yin Symbol* (阴符) reveals that this section aligns with the *yin-yang* (阴阳) schools’ teachings, arriving at the *critical juncture* (机动) of their *tilting balance* (倾) and the *favorable moment* (火候) of *evenly penetrating* (平透) and *evenly responding* (平感). Though it has not yet spoken of the *Six Coordinates* (六合) and the *Three Talents* (三才), universal sensation (普感) and universal response (普应) are already present—*completely* (浑) *unifying* (合) *harmonious interaction* (交合) and *generative cultivation* (生). Yet sainthood’s *virtue/power* (功) is born here, and *divine clarity* (神明) emerges.\n\nThe *First Master* (先师), Great Emptiness (太虚) *Venerable*, thus said this section is in harmony with the opening phrase of the text. As for the *highest highest cultivation* (最上上乘), it originates from the time before *Heaven and Earth* (天地) existed and before *parents* (父母) were born—its foundation (落脚) lies beyond *yin-yang* (阴阳), *Five Phases* (五行), years, months, days, and hours. Once the *critical juncture* (机动) arises, *emotional restraint* (节情) returns to *true nature* (归性), forming a *precious gem* (宝珠) and absorbing it into the *strange vessel* (奇器). Through daily and monthly accumulation (日积月累), it ultimately merges with the *Three Talents’* (三才) *true unity* (真一)—*one without duality* (合一不二)—thus forming the *saintly embryo* (圣胎). So it is that the *Three Talents* (三才) decay, yet I endure eternally.\n\nThis is the *playful cultivation* (玄修) of the *Three Sovereigns* (三皇), still not the *secret* (秘) known by the Yellow Emperor’s era. The following passage refers to this, hence the phrase *\"the unknown\"* (不知). The *method* (功法) of the *hundred-foot pole* (百尺竿头) is one of *universal harmony* (左右逢源), where *all under Heaven returns to benevolence* (天下归仁). This is what the *First Master* (先师) has heard.\n\nYet, the *First Master* (先师) further said that the *mystic principle* (玄理) of this section is the *foundation for upright conduct* (立身之本). If this section is forgotten, then the *highest highest cultivation* (最上上乘) cannot be refined further. How can this section be neglected?\n\nAs for *stealing the mechanism* (盗机), none under Heaven can see it, none can know it. The *noble* (君子) who attains it will preserve their life, while the *petty* (小人) who attains it will risk their vitality. Master Fan says: *\"Stealing\"* (盗) is the *Dao/Way* (道). The *saintly virtue/power* (圣功) manifests through observing its *mechanism* (机), then applying it to *steal* (盗) the *lifespans* (夭) of both the *noble* (君子) and the *petty* (小人).\n\nThe *true yang* (真阳) of the *seven* (一七) cannot be seen by the eyes, but the *true yang* (真阳) of the *lower seven* (下一七) can only be obtained through the *spear-mouth* (矢口). The *noble* (君子) knows that the *true yang* (真阳) of both the *noble* (君子) and the *petty* (小人) must be returned through the *Ten-character Great Mouth* (十字大口) and *Small Mouth* (小口) methods, to preserve their life and ensure eternal existence. The *petty* (小人) cannot self-restraint, relying on their talents while neglecting cultivation, they fall into *evil paths* (邪道), losing their life without realizing it—hence the phrase *\"lightly risking their vitality\"* (轻命). This illustrates the *auspiciousness and inauspiciousness* (吉凶) of *right and wrong* (邪正).\n\nA scholar remarks: the *\"its\"* (其) in this section refers to the *Dao/Way* (道) mentioned in the previous section. *\"Stealing\"* (盗) means *secretly taking and concealing* (密取而藏). *\"Mechanism\"* (机) is the *interaction of self and other* (彼我所发之机). If not concealed, it will dissipate—thus, the value lies in knowing how to *steal* (盗). None can see or know it, hence it is called *\"stealing\"* (盗). Yet, it is crucial to *preserve the universal mind* (普心), preventing *one-sided dominance* (偏胜). This contains the dual meaning of *\"taking and giving\"* (取与).\n\nTo know this is to be a *noble* (君子); to be unaware is to be a *petty* (小人). Here lies the *Heavenly Mandate* (天命). Those who *observe Heaven and embody Heaven* (观天执天) cannot afford to neglect the *mechanism of stealing* (盗机). Aligning with Heaven preserves the body, while *pursuing private gains* (挟私) through stealing leads to *lightly risking vitality* (轻命). What does *\"attaining\"* (得) mean? It is the *Dao/Way of taking and giving* (取与之道).\n\nThis section belongs to the *initial stages of cultivation* (小试之道), hence the warning. Master Fan fails to grasp this, so his interpretations fall into the category of *lightly risking vitality* (轻命), and cannot be followed.\n\n---\n**Next Section:**\n\n聋者善视，瞽者善听。\n绝利一源，用师十倍。\n三返昼夜，用师万倍。\n范氏曰：此指功中遇用美口之时，必须如聋者之善视，瞽者之善听。\n二善喻专字之义，又含用口而心无口之谓也。\n要知功中用盗，非口不能取。\n丝色真一源头之利，惟口一源之用最为至要。\n是先以耳目之用于机，得机上始用其口，而口一用，又缘十字以得之。\n果以十字而三返根源，真如兵师之危厉。\n此正火里栽莲，诚有万倍之获。\n是全耳目口宵旦不辍，以成盗机之利，以起下文机心之用也。\n“倍”字另有妙义，未敢笔之，请勿略也。\n一得曰：上中两篇言其义理之当，然个中利弊亦道及。\n下篇所言乃是功法，而义理遇焉。\n从而去取损益于其间，则法备矣。\n统而体之，在专一，在至静极虚而中无人我，一任自然，有有无无一以气机视之。\n此中常寂寂，忘其寂，则可运至常应常静。\n谨按此节首二句“专”义也，第三句“一”义也。\n目利视，耳利听，聋瞽能绝其歧，则源一也。\n其第四句集“益”之义也，而验于此。\n得三返句，“恒”义也。\n师，众也，《易》师卦之象言，畜众也，此正俦人广众之中有归仁逢源之大道。\n三返昼夜，三十六时也。\n三十六者，阴数之极也。\n言能专而恒，则阴尽化阳，三十六宫都是春也。\n十倍、万倍，约词也。\n言专一则能用众，恒则愈能倍用之也。\n“倍”字拆看，乃阴阳门地天作用，须连十字合参。\n“万”字拆看，乃“艹禺”两字，艹属坤气，禺属阴类，此就范氏解法言之。\n按理而论，用倍字作用，较胜范氏所宗。」\n\nThe *deaf* (聋者) excel in *vision* (善视), and the *blind* (瞽者) excel in *hearing* (善听).\nTo *sever all profit from a single source* (绝利一源), one must employ the *Master* (师) tenfold (十倍).\nTo *return three times through day and night* (三返昼夜), one must employ the *Master* (师) ten thousand-fold (万倍).\n\nMaster Fan says: this refers to the moment in cultivation (功) when one encounters the *beautiful mouth* (美口), requiring the *vision* (视) of the *deaf* (聋者) and the *hearing* (听) of the *blind* (瞽者).\nThe two *excellences* (善) illustrate the meaning of *single-mindedness* (专), and also imply *using the mouth while the mind remains without attachment* (用口而心无口).\nUnderstand that in cultivation, *stealing* (盗) must be employed, and without the *mouth* (口), one cannot *take* (取).\nThe *true one* (真一) of the *silken threads* (丝) and *colors* (色) lies at the *source* (源头), and the *use of the mouth as a single source* (口一源) is most critical.\nFirst, one must apply the *ears and eyes* (耳目) to the *mechanism* (机); only after attaining the *mechanism* (机) does one employ their *mouth* (口), and once the *mouth* (口) is used, it is through the *Ten-character* (十字) method.\nIf one truly employs the *Ten-character* (十字) and *returns three times to the root source* (三返根源), it is like the *precise and perilous* (危厉) tactics of a *military strategist* (兵师).\nThis is akin to *planting lotuses in flames* (火里栽莲), truly yielding *ten thousand-fold gains* (万倍之获).\nIt is through *uninterruptedly preserving ears, eyes, and mouth* (全耳目口宵旦不辍) that one achieves the *advantage of stealing the mechanism* (盗机之利), thus giving rise to the *application of the mind’s mechanism* (机心) in the following passage.\nThe *character \"bai\"* (倍) holds another profound meaning, which I dare not commit to writing—please do not overlook it.\n\nA scholar remarks: the *first two sections* (上中两篇) discuss the *correctness of their principles* (义理之当), yet they also hint at their *advantages and disadvantages* (利弊).\nThis *section* (下篇) speaks of the *method* (功法), while the *principles* (义理) are encountered within it.\nFrom this, one must *discriminately adopt or abandon* (去取) and *assess gains or losses* (损益) accordingly—then the method is complete.\nTo *comprehend and embody* (统而体之) it lies in *single-mindedness* (专一), in *ultimate stillness and supreme emptiness* (至静极虚), where there is no *self or other* (人我), and one *fully trusts in nature* (一任自然), perceiving *presence and absence* (有有无无) solely through *qi and mechanism* (气机).\nHere, there is *constant quietude* (常寂寂); if one *forgets this quietude* (忘其寂), then one can *operate* (运) to reach *constant response and constant stillness* (常应常静).\nThis passage’s first two lines elucidate the meaning of *single-mindedness* (专), and the third line, that of *oneness* (一).\nThe *eyes* (目) profit from *vision* (视), the *ears* (耳) from *hearing* (听); the *deaf* (聋) and *blind* (瞽) can *sever their distractions* (绝其歧), thus *unifying the source* (源一).\nThe fourth line gathers the meaning of *benefit* (益), verified here.\nThe phrase *\"return three times\"* (三返), carries the meaning of *constancy* (恒).\n*Master* (师) means *the multitude* (众); in the *Yijing’s* *Master Hexagram* (师卦), it speaks of *accumulating the multitude* (畜众), which is precisely the *Dao/Way* (道) of *returning to benevolence* (归仁) and *encountering the source* (逢源) amid a crowd.\n*Return three times through day and night* (三返昼夜) refers to *thirty-six hours* (三十六时).\nThirty-six is the *extreme of yin numbers* (阴数之极).\nIf one can be *single-minded and constant* (专而恒), then *all yin transforms into yang* (阴尽化阳), and the *thirty-six palaces* (三十六宫) are all *spring* (春).\n*Tenfold* (十倍) and *ten thousand-fold* (万倍) are *approximate terms* (约词).\nThey mean that *single-mindedness* (专一) allows one to *employ the multitude* (用众), and *constancy* (恒) further enables *tenfold or ten thousand-fold application* (倍用).\nThe *character \"bai\"* (倍), when deconstructed, reveals the *yin-yang* (阴阳) *gateway and foundation* (门地) of *Heaven’s operation* (天作用), which must be *connected with the Ten-character* (十字) for full understanding.\nThe *character \"wan\"* (万), when deconstructed, reveals the *two characters \"cao-yu\"* (艹禺): \"cao\"* (艹) belongs to *Kun-qi* (坤气), and *\"yu\"* (禺) belongs to the *yin category* (阴类). This is in accordance with Master Fan’s method of interpretation.\nBy *reasoning* (按理), the *application of \"bai\"* (倍) surpasses what Master Fan adheres to.",
      "overlap_context": "et transmitted through the *nose’s center*, passed down orally for millennia,\nYet the scripture speaks of it as *\"men know\"* (人知).\nDuring the Yellow Emperor’s era, practitioners of the *Dao* were many—\nThis teaching was universal, hence it is said: *\"Men know the divine of the divine.\"*\nMaster Fan fails to comprehend, deeming this an untransmitted secret—\nThus, he calls it *\"the non-divine source of divinity,\"*\nUnaware that the *Yin Symbol’s* highest *highest* cultivation lies beyond his grasp.»",
      "start_char": 7996,
      "end_char": 9249,
      "start_sentence": 365,
      "end_sentence": 431,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 42.16286826133728,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经玄解正义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "然按正义只言道不孤修，学者能循是经正宗，纵在一室孤修而虚空感至真一、真元，采不胜采，竟有十倍、万倍之获。 是经正义不在拆字也。 谨按此节意在立命，而辞旨注在性边，盖以命圆在性耳！ 学者审之，则知所事矣。 心生于物，死于物，机在目。 范民曰：心为物机所牵，是为物之用，虽心生而自促其死也。 心不为物机所牵，将物为心所用，是心死而自得其生也。 此正不死不生，不生不死之谓也。 然生死之途，用目观机而定，正为办道之津梁。 心假目之用，必学如死人之不动，为最要之上看也。 一得曰：引于物而情动，为生于物。 役于物而神耗，耗则弊，为死于物。 心因物而生死，实则已无生死。 凡生于物之时，而能觉照，则无死机矣。 其机惟目见之。 目，乃天目，位在两眉之间，非两目也，是为真一之所凭临者。 用目瞩机，机绪万端，变幻莫测，目能见端识绪，见绪识端，而机莫遁矣。 目之用大矣哉！ 故曰：“心生于物，死于物”。 又曰：“机在目也”。 此示人须凭真一为宰耳。 知用与否，乃在一心，故贵心明。 心明乃能见性，故学以明心地为澈始澈终要着。 按此目字，即上篇将观字之主脑。 圣人所以用目者，盖以明心，意在言外。 静揣上下经文，厥旨自见。 天下之无恩而大恩生，迅雷烈风莫不蠢然。 至乐性余，至静性廉。 天下之至私，用之至公。 范氏曰：二人之不间，不作尘情之拘扰，全无常道顺生之为，是为无恩。 俟其时，至机现，是大药生矣。 当此之时，须分别壬癸，使庚甲相合。 吞入腹中，返成乾体，而得长生，岂非大恩乎。 然，金木之并，不过烈风之顷，再加当头一震，跃然蠢动，顿脱狂迷，天真吐露矣。 全赖神此—击。 故吕祖云“霹雳声中自得根”之语，堪为证据。 但生来一厶之小土击出兑中一丝之白金，食之虽小而堪充六合。 生来一厶之小土，原来清静，承受一滴之青阳，凝然不争。 其廉小，但二人一厶土之功用固属不可见之私为。 而我太空一震，得返成真，却显现人我一厶土中为用，故又谓之公。 是此四至字莫非归中守中之旨也。 一得曰：至乐，性之动也也。 余者，溢于外也。 至静，性之定也。 廉者，约于内也。 雷雨之动满盈，故有充溢之应。 迅雷烈风必变，故戒侈放之愆。 “莫不蠢动”，是用之公。 惟修道者，感风雷而受益，是独得天恩之私也。 此节玄理，如此。 声音之感，莫大于风雷，此节是承上“善听”之义，上节承上“善视”之义。 二节言视听之灵。 应机不泊，而后有下节制禽之作用也。 范氏之说，亦可节取，然只可会其意，而行之于虚寂之中，一或泥于迹，便非大道。 禽之制在炁。 范氏曰：此专言隹，正明天人合发之妙用。 是用隹而不用形之作用，如鹤以声交也。 其用隹之旨，非身中之隹。 若不以功力制之，隹亦不来，而我之任督不通，升降路塞，纵得亦失，无招摄伏藏之所也。 盖隹即阳人得阳则生，失阳则死人，为仙鬼之各半。 行此功者，正去阴益阳之为也。 但神既迷离于纷华，气又亏失于爱欲，非此相机以制，相感以隹之妙，何能返还于本原也。 一得曰：范氏此节，不愧玄解二字，实为无有遗憾。 惜上篇观字不从洪武正韵拆看，讹从贴体，乃有用夫二口于佳花之上云云。",
      "translated_text": "「Yet according to the *orthodox interpretation* (正义), it merely states that the *Dao/Way* (道) is not cultivated in isolation. Scholars who follow this scripture’s *true essence* (正宗) will find that even in solitary practice within a single chamber, if one attains the *True One* (至真一) and *True Essence* (真元) of the *void* (虚空), the harvest would be *tenfold* (十倍) or *ten thousand-fold* (万倍) beyond measure.\n\nThis scripture’s *orthodox interpretation* (正义) does not lie in deconstructing characters. The intent of this passage is to establish *command* (命), while its meaning focuses on the *nature* (性). Indeed, *command* (命) is rooted in *nature* (性)! Scholars who examine it carefully will understand what they must pursue.\n\n*The heart-mind* (心) arises from things and perishes from things; its trigger lies in the eyes. Master Fan says: When the *heart-mind* (心) is drawn by the *mechanism* (机) of things, this is the *operation of things* (物之用), though the *heart-mind* (心) may arise, it is itself hastening its own demise.\n\nWhen the *heart-mind* (心) is not drawn by the *mechanism* (机) of things, it instead makes things serve its own *operation* (用), which is the *heart-mind* (心) attaining its own life through its own demise. This is the meaning of *neither death nor life, nor life nor death* (不死不生，不生不死).\n\nHowever, the path of life and death is determined by using the eyes to observe the *mechanism* (机), serving as the *bridge for Dao/Way practice* (办道之津梁). The *heart-mind* (心) relies on the eyes’ *operation* (用), and must learn to remain as *immovable as the dead* (不动), which is the most crucial *observation* (上看).\n\n*A True Attainment* (一得) says: To be drawn by things and have one’s *emotions* (情) move is to *arise from things* (生于物). To be enslaved by things and have one’s *spirit* (神) exhausted—exhaustion leading to decay—is to *perish from things* (死于物). Though the *heart-mind* (心) experiences life and death through things, in truth, it has already transcended life and death.\n\nWhenever one *arises from things* (生于物), if one can *awaken and illuminate* (觉照), then the *mechanism of death* (死机) will vanish. The *mechanism* (机) is discerned solely through the eyes.\n\nThe eyes are the *Heavenly Eyes* (天目), located between the two brows—not the physical eyes—and serve as the *True One* (真一)’s foundation. By using the eyes to *gaze upon the mechanism* (瞩机), myriad threads of the *mechanism* (绪) emerge, shifting and unpredictable. Yet if the eyes can perceive the threads and grasp the *mechanism* (绪), the *mechanism* (机) cannot escape detection. The eyes’ *operation* (用) is indeed vast!\n\nThus it is said: *“The heart-mind arises from things and perishes from things”* (心生于物，死于物). And again: *“Its trigger lies in the eyes”* (机在目). This teaches that one must rely on the *True One* (至真一) for governance. Whether one employs its *operation* (用) depends on the *heart-mind* (心), hence the value of *heart-mind clarity* (心明). *Heart-mind clarity* (心明) is the ability to perceive *nature* (性), so the practice must focus on *heart-mind clarity* (明心) as both its beginning and end.\n\nExamining the *character \"mu\"* (目), it aligns with the *core principle* (主脑) of the *observation* (观) in the previous section. The *Sages* (圣人) employ the eyes precisely to illuminate the *heart-mind* (心), though their intent lies beyond the words.\n\nReflecting on the *upper and lower scriptures* (上下经文) in stillness, their profound meaning becomes evident. Beneath the *Dao/Way*’s apparent lack of *en* (恩), the greatest *en* (恩) arises. Even the swiftest thunder and fiercest wind cannot fail to stir the *innate response* (蠢然).\n\nThe *supreme joy* (至乐) is the *nature*’s overflow, the *supreme stillness* (至静) is the *nature*’s restraint. The *Dao/Way*’s ultimate *selflessness* (至私) manifests as ultimate *public benefit* (至公). Master Fan explains: The *non-separation of two* (二人之不间) refers to those who do not indulge in the *entanglements of mundane emotions* (尘情之拘扰), maintaining the *natural flow of the constant Dao/Way* (常道顺生). This is the state of *lacking en* (无恩).\n\nWhen the time arrives and the *supreme mechanism* (至机) appears, the *great medicine* (大药) is born. At this moment, one must distinguish *ren-gui* (壬癸) to harmonize *geng-jia* (庚甲). Swallowing this into the *abdomen* (腹中), it transforms back into the *primordial body* (乾体), granting *long life* (长生)—is this not the greatest *en* (恩)?\n\nYet the *confluence of metal and wood* (金木之并) lasts only as long as the *fierce wind* (烈风), and an additional *strike at the crown* (当头一震) causes a sudden awakening—*innate response* (蠢动)—and one breaks free from *madness and delusion* (狂迷), revealing the *Heavenly True Self* (天真吐露). This is entirely due to the *divine impact* (神此—击).\n\nThus, Master Lü said, *“Within the thunderous clap, the root is naturally attained”* (霹雳声中自得根), which serves as evidence.\n\nEven a *single clod of earth* (一厶之小土) struck from the *Fu position* (兑中) produces a *thread of white gold* (一丝之白金). Though small, it can nourish the *Six Harmonies* (六合). A *single clod of earth* (一厶之小土) is inherently *pure and tranquil* (清静), receiving a *drop of celestial yang* (一滴之青阳) without struggle or contention. Though its *restraint* (廉) is slight, the *function and operation* (功用) of the *two persons’ single clod of earth* (二人一厶土) belong to the *invisible private* (不可见之私). Yet when *Great Void* (太空) strikes with a single *resonance* (震), it returns to the *True* (真), revealing the *operation* (用) within the *single clod of earth* (一厶土) of *self and others* (人我), hence also called *public* (公). Thus, these *four “zhi” terms* (四至字) all point to the essence of *central harmony and preservation* (归中守中).\n\n*A True Attainment* (一得) says: *Supreme joy* (至乐) is the *nature*’s movement (动), *overflow* (余) is its external excess. *Supreme stillness* (至静) is the *nature*’s fixation (定), *restraint* (廉) is its internal constraint. The *dynamic response* (动) of thunder and rain is full and abundant, hence the *overflowing effect* (充溢之应). Swift thunder and fierce winds must transform, so one must guard against *excess and dissipation* (侈放之愆). *“Even the swiftest thunder and fiercest wind cannot fail to stir”* (莫不蠢动) is the *public operation* (用之公). Only those cultivating the *Dao/Way* (修道者) benefit from the wind and thunder, uniquely receiving *Heaven’s great en* (天恩) as *private* (私). The profound *Dao/Way*’s meaning here is such.\n\nNo sensation surpasses the impact of *wind and thunder* (风雷), so this passage aligns with the *orthodox interpretation* (正义) of *“good hearing”* (善听) from above. The previous passage corresponds to *“good vision”* (善视). Both passages emphasize the *spiritual acuity* (视听之灵) of the eyes and ears.\n\nOnly when one *responds to the mechanism without stagnation* (应机不泊) does the following passage on *subduing the beast* (制禽) unfold in its *operation* (用). Master Fan’s teachings can be selectively applied, but one must grasp their intent and practice within the *void and stillness* (虚寂). If one becomes mired in the *traces* (迹), it will no longer be the *Great Dao/Way* (大道).\n\nThe *subduing of the beast* (制禽) lies in *qi* (炁). Master Fan says: This passage specifically discusses *zui* (隹), illustrating the *marvelous operation* (妙用) of *Heaven and humanity* (天人) in unison. Its *operation* (用) is through *zui* (隹), not the *form* (形). This is akin to the *crane’s communication through sound* (鹤以声交).\n\nThe intent of *using zui* (用隹) is not the *zui within the body* (身中之隹). If one does not employ *cultivation strength* (功力) to control it, *zui* (隹) will not manifest. Without *zui* (隹), the *task and governing vessels* (任督) remain blocked, and the *paths of ascent and descent* (升降路) are obstructed. Even if attained, it will be lost, lacking the means for *summoning, subduing, concealing, and storing* (招摄伏藏).\n\nIndeed, *zui* (隹) is the *yang essence in humans* (阳人), gaining *yang* (阳) brings life, losing *yang* (阳) brings death. It is the *halfway point between immortals and ghosts* (仙鬼之各半). Practitioners of this *operation* (功) must *eliminate yin and augment yang* (去阴益阳).\n\nYet when the *spirit* (神) is lost in the *flurry of worldly affairs* (纷华), and *qi* (气) is depleted by *attachment and desire* (爱欲), without this *mechanism of mutual response and control* (相机以制，相感以隹), how could one return to the *original foundation* (本原)?\n\n*A True Attainment* (一得) says: Master Fan’s exposition here is worthy of the terms *profound and insightful* (玄解), with no flaw in its reasoning. It is regrettable that the *character \"guan\"* (观) in the previous section was not deconstructed according to the *Hongwu Zhenyun* (洪武正韵) but instead followed the *erroneous method of \"tie-ti\"* (贴体), leading to the misguided notion of *“applying the two mouths to the fine flower”* (用夫二口于佳花之上).*」",
      "overlap_context": "eveals the *yin-yang* (阴阳) *gateway and foundation* (门地) of *Heaven’s operation* (天作用), which must be *connected with the Ten-character* (十字) for full understanding.\nThe *character \"wan\"* (万), when deconstructed, reveals the *two characters \"cao-yu\"* (艹禺): \"cao\"* (艹) belongs to *Kun-qi* (坤气), and *\"yu\"* (禺) belongs to the *yin category* (阴类). This is in accordance with Master Fan’s method of interpretation.\nBy *reasoning* (按理), the *application of \"bai\"* (倍) surpasses what Master Fan adheres to.",
      "start_char": 9249,
      "end_char": 10502,
      "start_sentence": 432,
      "end_sentence": 495,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 33.31747341156006,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经玄解正义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "若以隹字拆看，则便知此篇此句之所以然矣。 盖隹乃灵敏之鸟，机触立作。 故着“见”字于右。 所以察夫隹性，用炁以制，使隹勿觉。 已而时至机到，二炁既见，则自贪合忘冲。 观字之义如此，而作用在—炁字。 此炁何炁，坤元中炁是也。 盖斯禽为离乌，含有真精流珠是也，其性灵敏。 参同不云乎“大阳流珠，常欲弃人，卒得精华，转而相因”。 金华者何？ 坤元中炁是也。 及其时至，坎髓上升，是为兔髓，坎离一合，化为白液，凝缩至坚。 凝结则不飞，所谓制也。 其效如此，乃自然之妙用。 究其得致之诀，在乎浑穆之中。 易曰：至哉坤元，万物资生，乃顺承天。 是此节之精义，范氏尚未见及此。 生者，死之根； 死者，生之根。 恩生于害，害生于恩。 范氏曰：死者，常道之为也； 生者，逆道之功也。 常道生人，是心迷于情欲，则精气神失，必至于死。 故以生为死根。 逆道生身，是心死于情欲。 则精气神全，必至于生，故以死者云为生根。 紫阳所云：“但将死户为生户，莫把生门当死门”之谓也。 总之，用逆道之伏藏，身未死，先学死之道，始得生全。 即龙蛇起陆，缘于豢养气血之腾； 雷震风行，因于丹台月印之候。 故为恩生于害。 奸邪蕴国，将成盗夺必溃之机； 叶茂花明，实阴尽阳回之应。 故为害生于恩。 下二句正火候之谓。 其火候与刑德相负之机，请合参焉。 一得曰：五行生死互为其根，故恩害亦相倚伏，此节顺文直解足矣，是为下文作一提头，乃承上“制”字之义。 总在能察气机，不使过而偏胜，相机而反制之，则得矣。 是有害以成恩，死以成生作用。 下节妙旨乃教人下手施功之法。 其火候在时，所以审气机先后之倚仗也； 其采取在物，所以调济吾身阴阳之偏胜也。 厥用至玄，厥机至幻。 然，不外乎此节之所言也。 此节之旨，言能尽性者，乃能致命。 此节以后，纯是命理，其中仍有性以主之。 范氏此节所解，亦有可采处。 愚人以天地文理圣，我以时物文理哲。 范氏曰：禺者，母猴也。 禺之天地，至气数充足，自有光华之文理发现，以为坎离相交，入中成土之兆也。 是此观天察地之旨，非天星地文之俗学，实乃日月有数、小大有定、天人合发之玄范，为夺神功、改天命之道，尽在于兹。 故以天地文理为圣者，知愚人之谓也。 我则以日月之数、小大之定、机现之时，用不神之神令其必以盗机，以发现光华，时文之理合圣于哲。 更能于物诱纷纭之际，令其就天地文理为圣者默运其气机，因能以物理之哲明于我也。 而此时之文理，乃吾人从朝至暮、至亲至近、极平常处。 正圣凡转关之要诀也。 吾人不可错认，请详参焉。 一得曰：显于外者为文，通于中者为理。 圣哲皆明晓通达之。 称天文星辰也，地理山川也，虽明于象纬堪与，是天地之迹，非天地之道也者。 “时”者，赅天人而言。 天有定时，人身有话时，其递嬗隐现皆有厘然之文、秩然之理，施功不可错也。 时之用大矣哉！ “物”者，对我之称，谓人也。 迹象之见于下者，蔚为人文。 神气之发于上者，各有条理，感合不相紊也，物之用溥矣哉！ 言志于道者，莫不远求于天地时物者。 人之所忽，而不知大道即在时物之中。 气机之流行天地者，推算而符，目之所见；",
      "translated_text": "「If one deconstructs the *character \"zhuì\"* (隹) as intended, then the meaning of this passage and sentence becomes clear. For *zhuì* is a swift and sensitive bird—when its mechanism is touched, it immediately acts. Hence, the *character \"jiàn\"* (见) is placed on its right.\n\nThis is how one discerns the nature of *zhuì*: by using *qi* (炁) to control it, so that *zhuì* does not perceive it. When the time comes and the mechanism is at hand, the two *qi* (炁) having met, *zhuì* will naturally cling and merge, forgetting its own thrust. Such is the meaning of the *character \"guān\"* (观), and its application lies in the *qi* (炁).\n\nWhat *qi* (炁) is this? It is the *qi* of the *Kun* (坤) element. For this bird is the *li* (离) crow, embodying the true essence of the *jīng* (精) and *liúzhū* (流珠). Its nature is swift and sensitive. Does it not say in *Cántóng Bù* (参同不云乎): *“The Great Yang flows the pearl, ever desiring to abandon [the vessel], yet ultimately attains the essence, transforming to sustain each other”*? What is this *jīnhuá* (金华)? It is the *qi* of the *Kun* element.\n\nWhen the time arrives, the *kǎn* (坎) marrow ascends—this is the *tùsuǐ* (兔髓), and when *kǎn* and *lí* unite, it condenses into white fluid, solidifying until it is firm. When condensed, it does not disperse—this is the *control* (制). Such is its effect, a marvel of nature’s operation. The key to its attainment lies in its pristine, undisturbed state.\n\n*The Classic of Changes* (易) states: *“Exalted is the *Kun* element, from which all things derive their life, thus following and conforming to Heaven.”* This is the essence of this passage, though Master Fan has not yet grasped it. Life is the root of death; death is the root of life. Grace arises from harm; harm arises from grace.\n\nMaster Fan says: *“Death is the Way’s constant operation; life is the Way’s inverted function.”* When the Way’s constant operation generates life, it means the *spirit* (神) is lost in emotional desires, and thus the *essence* (精), *qi* (气), and *spirit* (神) are depleted, inevitably leading to death. Hence, life is considered the root of death. When the Way’s inverted function generates the body, it means the *spirit* (心) is extinguished by emotional desires, so the *essence* (精), *qi* (气), and *spirit* (神) remain intact, inevitably leading to life. Hence, death is said to be the root of life. This aligns with *Zhìyáng’s* (紫阳) teaching: *“Only treat the gate of death as the gate of life; never mistake the door of life for the door of death.”*\n\nIn summary, by applying the Way’s inverted *mechanism of mutual response and control* (伏藏), one’s body not yet dead, must first learn the Way of death, only then can one achieve full life. Just as dragons and serpents rise from land due to the *tēng* (腾) of nurtured *qi* and blood; thunder and lightning strike, winds blow, because of the timing of the *Dāntái* (丹台) and *yuèyìn* (月印). Hence, grace arises from harm. When *jiānxié* (奸邪) is hidden within the realm, it marks the moment of inevitable collapse into theft and plunder; when leaves flourish and flowers bloom, it reveals the completion of *yin* depletion and *yang* return. Hence, harm arises from grace.\n\nThe following two sentences speak to the timing of the *fire candidate* (火候). Its relation to the *mechanism of mutual response and control* (相负) of *xíng* (刑) and *dé* (德) should be examined together. *A True Attainment* (一得) says: *“The five phases mutually generate life and death, hence grace and harm also rely on and conceal each other. This passage logically follows the text, and its meaning is sufficient. It serves as an introduction to the following section, continuing the significance of the *character 'zhì'* (制). The key lies in discerning *qi* mechanisms, preventing them from becoming excessive or one-sided, and responding to them with counter-control. Then success is achieved—harm is transformed into grace, death into life.”*\n\nThe next passage reveals the method for practical application. The *fire candidate* (火候) depends on timing, which is the means to verify the *qi* mechanisms’ sequence and reliance. The *adoption and extraction* (采取) lies in substances, which is the means to balance the excesses and deficiencies of *yin* and *yang* within one’s body. Its application is profound; its mechanism is subtle. Yet it does not exceed what this passage has spoken.\n\nThe purpose of this passage is to say that only those who exhaust their nature can achieve the Way’s full potential. From this passage onward, it focuses purely on the principles of life and death, yet within it still lies the nature that governs them. Master Fan’s explanation here also has merits worth adopting.\n\nThe unenlightened say: *“The patterns and principles of Heaven and Earth are sacred.”* I say: *“The patterns and principles of time and matter are profound.”* Master Fan says: *“Yú* (禺) is the mother monkey. The *Yú* of Heaven and Earth, with its abundant *qi*, naturally reveals the sacred patterns and principles, as the sign of *kǎn* and *lí* uniting, entering the center to form soil. This is the meaning of observing Heaven and Earth—it is not the mundane study of celestial omens and terrestrial features, but the profound range of the *numbers of the sun and moon* (日月有数), the *fixed order of great and small* (小大有定), and the *harmonious manifestation of Heaven and man* (天人合发). It is the Way of seizing the *spirit’s* mechanism and altering one’s fate, entirely contained here. Hence, the patterns and principles of Heaven and Earth are called sacred, as the unenlightened know them.”*\n\nI say: *“The numbers of the sun and moon, the fixed order of great and small, and the timing of mechanisms—by using the unmanifested *spirit* (不神之神) to compel it to steal these mechanisms, and thus reveal the sacred patterns and principles, the principles of time and matter harmonize the sacred and the profound. One can further, in the midst of chaotic material inducements, command the sacred patterns and principles of Heaven and Earth to operate silently within oneself, and thus balance the *qi* mechanisms through the profound principles of matter. This timing’s patterns and principles are what we encounter from morning to evening, in the most familiar and ordinary of places—this is the crucial key for transforming the sacred and the mundane.”*\n\nPeople cannot err in this; please examine it carefully.\n\n*A True Attainment* (一得) says: *“What is manifest externally is the *patterns* (文); what is internal and harmonious is the *principles* (理). Both the sacred and the profound understand and penetrate these. Though they may know the celestial patterns of stars and constellations, and the terrestrial principles of mountains and rivers, even if they understand the omens and symbols, they are merely traces of Heaven and Earth, not the Way of Heaven and Earth itself. ‘Time’ encompasses both Heaven and man. Heaven has fixed times, the human body has its own rhythms—these shifts and manifestations all have distinct patterns and orderly principles, which must not be misapplied when practicing. The use of time is vast indeed! ‘Matter’ refers to what is opposite to me, meaning humanity. The traces and symbols seen below coalesce into human patterns. The *spirit* (神) and *qi* (气) that manifest above each have their own order, and their responses and unions do not disrupt one another. The use of matter is broad indeed! Those who dedicate themselves to the Way all seek it from Heaven, Earth, time, and matter. Yet what people overlook is that the great Way lies within time and matter themselves. The flow of *qi* mechanisms through Heaven and Earth, when calculated and verified, is what the eye perceives—”*」",
      "overlap_context": ", how could one return to the *original foundation* (本原)?\n\n*A True Attainment* (一得) says: Master Fan’s exposition here is worthy of the terms *profound and insightful* (玄解), with no flaw in its reasoning. It is regrettable that the *character \"guan\"* (观) in the previous section was not deconstructed according to the *Hongwu Zhenyun* (洪武正韵) but instead followed the *erroneous method of \"tie-ti\"* (贴体), leading to the misguided notion of *“applying the two mouths to the fine flower”* (用夫二口于佳花之上).*」",
      "start_char": 10502,
      "end_char": 11741,
      "start_sentence": 496,
      "end_sentence": 564,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 23.4097580909729,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经玄解正义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "消息之感通于时物者，默体而符，目之所不见也，此阴符之旨也。 直解之理如此。 按：此节是示两家各正性命之大旨，具有双管齐下妙理。 拆愚言愚者，指女人之心而言，《左传》：“女，阳物也，其性专静”。 当以用心入手，故宜以自身天地文理融会贯通时，感合虚空所生之真一，以为圣胎。 我则以无心为用者，故但于时物文理充足，机现时，极虚极寂，机自来合，以真意包之，乃成圣胎。 盖禺本无心，其机易感； 我本中实，非虚莫纳。 其理如此。 阴符正旨，禺我各处一方，各有气机外透而气机各不离其体，乃有若现勿现之玄，三才一元充满六合，彼我克修，各自达于虚无之境，三才三宝，以无为舍者。 无与无遇，相合无分。 而此中各具阴阳，空中媾结，变化出焉。 若欲形容其妙，罄南山之竹不能尽之。 虚无更加寂静，则万化之相交心畅，而所生必充。 及至不失其时，虚受其物，则互有所得，彼我个中各各积玉成山，铺金成地。 此正上篇天发杀机一节之作用而基筑于此节者。 圣人统男女而普度之，故又有下节功法所以别开生面也。 其诀至玄，而功用却极平近。 然，古今人阅是经而鲜克领悟者，以无口授故耳。 一得窃体师意，已将玄旨和盘托出，见者幸共勉旃。 人以愚虞圣，我以不愚虞圣。 人以奇期圣，我以不奇期圣。 沉入水火，自取灭亡。 范氏曰：愚者，不识不知情懵懵然之谓。 是指其人要如愚之说也。 虞者，恐人知觉我之所为，又以口喻我中宫之说也。 圣者，不类常道，故云以愚虞圣。 我明宇宙在手，万化生身，坎离之交，金木之并，圣功之生，神明之出自然无为之道，故云不愚虞圣。 此“愚虞圣”三字之秘旨也。 一得曰：范氏解经悖谬之由总缘认经为男子而设，继泥于拆字，不得口传，一凭私智，且更认元为一，故费尽心思，适堕旁门。 不如据文直解，厥义自明。 虞，度也。 圣，通明也。 愚，谓定静如愚，实不愚也。 奇，谓作用神异。 圣道自然，不在奇也。 矫强作用，则自取灭亡矣。 此节语意，正以起下文“自然”二字。 看去似浅近，而玄旨甚深。 盖黄帝之时，言道不言丹。 至后世有种种说法，然不过身心两字尽之。 按此节，是从上节透入，别开生面，乃涵万于一之妙用，彼我并成之大道。 然，非造作而出。 故此下节点出“自然”二字。 言以静字为入手，而以至静至虚得用奇器为真功，造至粉碎虚空为了当。 经尚秘之，未尽泄也。 此节玄义，须从吕祖印传口诀以解之。 若曰上节言入手之则，时物文理息息静参，则日月小大之中有神明之用。 此节功法并将日月小大、时物文理等等作用，一脚踢翻。 是乃涵三为一，戴高履厚，并作一身； 动植生灵，皆为道侣。",
      "translated_text": "「The interplay of ebb and flow in resonance with Heaven and Earth’s time and matter, silently embodied and verified, is unseen by the eye—this is the essence of *Yinfu* (阴符). Such is the principle of straightforward interpretation.\n\nThis passage illustrates the fundamental precepts of two traditions, each refining the essence of life and vitality through subtle yet profound mechanisms. The \"foolish and fearful\" approach to attaining sainthood refers to the female principle, as described in the *Zuozhuan* (《左传》): \"Women are the *yang* (陽) of matter; their nature is singularly tranquil and focused.\" One must begin with the mind, thus harmonizing with the innate patterns of Heaven and Earth’s *wenli* (文理, cosmic order) to merge with the *true unity* (真一) born from the union of *qi* and emptiness, forming the *sacred embryo* (聖胎).\n\nI, however, advocate the use of *wu xin* (無心, non-mindfulness), relying solely on the sufficiency of Heaven and Earth’s *wenli* and *qi* mechanisms. When the *qi* manifests in time, reaching ultimate emptiness and stillness, the *qi* naturally converges, and with true intent enveloping it, the *sacred embryo* is formed. For the *foolish* (愚, here referring to *Yin* or female principle) has no inherent mind; its *qi* is easily responsive. I, being inherently *zhong shi* (中實, complete and substantial), can only accept what is truly *void* (虚, empty). Such is the principle.\n\nThe core teaching of *Yinfu* reveals that the *foolish* (愚) and I each occupy our own realm, yet both possess *qi* mechanisms that transcend externally while never detaching from their own bodies. This creates a mystic interplay of presence and absence. The Three Realms (三才, Heaven, Earth, and Humanity) and the One Primordial (一元) fill the Six Directions (六合), and as we refine our practices, we each attain the realm of *voidness* (虚無). The Three Realms (三才) and Three Treasures (三宝), resting in *wu* (無, non-duality), meet in perfect harmony.\n\nWhen *wu* (無) encounters *wu*, their union is seamless and undivided. Yet within this void, each contains *yin* and *yang*; in emptiness, they copulate and transform. To describe its marvels, one would exhaust the bamboo of the Southern Mountains—yet still not suffice. The deeper the void and stillness, the more vibrant the interplay of all transformations becomes, and the more abundant what is produced will be.\n\nWhen one does not lose the proper timing, and in stillness receives the essence of matter, each gains their own fulfillment. The *foolish* and I, within this framework, each accumulate jade into mountains and spread gold across the earth. This is the foundation and manifestation of the earlier passage on \"Heaven’s Killing Mechanism\" (天发杀机).\n\nThe Sage unifies male and female, universally guiding all beings. Thus, there follows a further passage to elucidate distinct methods for transformation. Its essence is profound, yet its application is utterly simple and accessible. Yet few, past or present, have truly comprehended this text, for it was never transmitted through oral instruction.\n\nOnce one secretly grasps the master’s intent, the profound essence is revealed entirely—may those who see it strive together.\n\nPeople attain sainthood through foolishness and fear, while I do so without them. People seek sainthood through the extraordinary, while I do without it.\n\nTo sink into the depths of water and fire is to court self-destruction.\n\nFan Zhi (范氏) says: \"Foolishness\" refers to one who does not discern, does not know, and remains muddled and unaware. This is the saying that one must act like the foolish. \"Fear\" means dreading that others might perceive my actions, and it also refers to explaining the *central palace* (中宫) through words. \"Sainthood\" is not aligned with ordinary paths, hence the phrase \"attaining sainthood through foolishness and fear.\"\n\nI, holding the universe within my grasp, see all transformations birthed from the body. The interplay of *Kan* (坎, water/yin) and *Li* (離, fire/yang), the union of *jin* (金, metal) and *mu* (木, wood), the emergence of the sacred function and divine clarity—all arise naturally from the Way of *wu wei* (無為, non-action). Thus, I attain sainthood without foolishness or fear. This is the hidden meaning behind the phrase \"foolishness and fear\" (愚虞).\n\nOnce one attains this understanding: Fan Zhi’s mistaken interpretations stem from treating the text as exclusively for men, clinging to the literal meaning of the characters, and failing to receive oral transmission. Relying solely on private reasoning, he further misconstrues the Primordial as merely *one* (一), exhausting his mind in vain and falling into erroneous paths.\n\nIt is better to follow the text’s straightforward meaning, and its significance will naturally become clear.\n\n\"Fear\" (虞) is \"degree\" (度); \"Sainthood\" (聖) is \"universal clarity\" (通明). \"Foolishness\" (愚) means remaining fixed and tranquil like the foolish, though in truth, one is not foolish. \"Extraordinary\" (奇) refers to miraculous and divine applications. The Way of sainthood is natural, not extraordinary. Forcing extraordinary actions leads only to self-destruction.\n\nThe intent of this passage is to set the stage for the following discussion of \"naturalness\" (自然). Though it appears simple, its profundity is vast.\n\nIn the time of the Yellow Emperor (黃帝), the Way was spoken of without mention of *elixirs* (丹). Later ages introduced myriad explanations, yet they could be summarized by the two characters: *body* (身) and *mind* (心). According to this passage, it builds upon the previous one, presenting a fresh perspective—embracing the wonder of unity within multiplicity, and the grand Way of mutual completion.\n\nYet this is not achieved through artificial means. Hence, the following passage emphasizes the word \"natural\" (自然).\n\nIt states that one must enter through stillness (静), and that attaining the utmost stillness and emptiness to utilize extraordinary methods is the true practice. Even shattering the void into fragments is the ultimate goal.\n\nThe text still conceals its secrets, leaving them undivulged. The profound meaning of this passage must be unlocked through the oral transmission of Lu Zu (吕祖, Laozi’s immortal disciple).\n\nIf one says the previous passage spoke of the rules for entering, then within the cycles of day and night, large and small, there lies the application of divine clarity. This passage’ method, however, overturns all such applications—day and night, large and small, the patterns of time and matter, etc.\n\nThis is the art of encompassing the Three Realms (三才) as one, wearing lofty footwear and heavy robes, all as a single body. Moving and still, all living things are companions on the Way.",
      "overlap_context": "n below coalesce into human patterns. The *spirit* (神) and *qi* (气) that manifest above each have their own order, and their responses and unions do not disrupt one another. The use of matter is broad indeed! Those who dedicate themselves to the Way all seek it from Heaven, Earth, time, and matter. Yet what people overlook is that the great Way lies within time and matter themselves. The flow of *qi* mechanisms through Heaven and Earth, when calculated and verified, is what the eye perceives—”*」",
      "start_char": 11741,
      "end_char": 12768,
      "start_sentence": 565,
      "end_sentence": 615,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 19.078850269317627,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经玄解正义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "性分中包罗圆足，悬若弹丸。 然，方其进火、退符之时，身踞丸颠以看火候，是乃扩修鄞鄂之作用。 已而火候既足，身乃透入丸中，以凝以养，所以休息元神，亦以静镇鄞鄂。 斯时，耳目无闻见，外象愚矣，而不知大智若愚所以入圣也； 天地有反覆，内象奇矣，而不知交泰非奇所以作圣也。 盖上节作用，是指三才散布之真元乃为扩修我之一鄞鄂，只是我真一辅翼，与我先天真一尚无关涉，是即释氏身积舍利等等耳。 末节奇器，乃是真一之别，用乃大焉，是皆自然之至理。 于未书点明，不合自然，则堕落旁门。 入火沉水矣。 圣经之旨如此。 自然之道静，故天地万物生。 天地之道浸，故阴阳胜。 阴阳相推，而变化顺矣。 范氏曰：自然之道静者，乃先天太极浑然一体，静极而动，化生天地而大仪，两议互为相交，又化万物，此明先天应时自然之化育也。 第此阴阳天地之道气机流动，循还不息，渐沁渐清，至于数足时动，阴阳相胜而发，我则相推相盈，使变化顺，人物以遂其生者，此明后天气机奉时之现象也。 而奉天时是知天人合发之时，时动食之时，日月小大之时，此种种时，正火候之宗源也。 一得曰：浸，相入相灌之谓。 阴中有阳，阳中有阴，故曰阴阳胜。 范氏此节所解，甚合道妙。 然须知有物而施，功等无物，乃至无物，而仍如有物。 倒倒颠颠，个中玄义，可以意会，不可言传。 而总以虚极静笃为宗。 虚极则无障，不为后天所碍，且能以道陶镕，使之还虚。 虚而后能静，静则中清，机临必觉，不致蒙昧，措施合宜，可无违时之弊。 此一时也，其机之现，有先天，有后天，有宜迎，有宜舍。 当进，进火； 当退，退符。 虽属自然，须凭意运。 而运有抑抑扬扬，直柔宜刚，宜缓宜急，宜透宜藏。 变化从此生，圣功从此出者。 先师太虚翁曰：“圣人传药不传火，非不传也，火候因时而起，相机而行，依样画葫芦，无是理耳。 上乘丹法以心传。 中乘丹法须以口授。 下乘丹法必以书授，其法繁琐也。 阴符一经，文属云篆，篆方丈余，轩辕黄帝得自崆峒天坛。 以帝之圣尚赖问答乃明。 世所奉本，盖属黄帝手授之文，虽落文字，而玄旨在乎心传。 息心体之，是经最上上乘已于是节首句道破。 老子又云乎：人法地，地法天，无法道，道法自然。 此节首句，黄帝已揭出宗旨。 是示人直从父母未生，天地未有，造化无朕中立脚。 知从自然会人，则自滴滴归源，头头合道。 ”又曰：“上节即将日月小大，时物文理，包一切，扫一切。 而此节阴阳变化中却藏有知时之义，大宜领会。 上节之旨戒在拘迹，此书之旨戒在忽机。 我师泥丸氏谓宜口授者，盖指此等精义耳”。 一得谨按：此节“摧”字，今古本皆作“推”。 从易经“刚柔相推”句，则此“摧”字应作“推”字。 太微律院云隐律师有国师王昆阳高士密付法物。 盖自邱祖以来，历代真人所传衣钵卷册如意经杖等等，中有《崆峒问答》一书，上有宋太宗御题玺印，系称陈希夷珍本，并有重阳王祖亲笔传戒偈存焉，是为宋元以前之古本，乃作“摧”字。 则此本“摧”字，必有所本，非笔误也。 按《易经》：“龙战于野，其血玄黄”相摧之义。 一得故仍从范本作“摧”字。",
      "translated_text": "The innate nature encompasses the perfect whole like a suspended marble.\n\nYet, when the time comes to advance the fire or withdraw the talismans, one sits atop the marble’s apex to observe the fire’s readiness—this is the expansion of the *yīn-è* (鄞鄂) function. Once the fire’s readiness is complete, the body then penetrates into the marble, congealing and nourishing, thus resting the primordial spirit and also calming the *yīn-è*. At this moment, the ears and eyes perceive nothing, and the external form is foolish indeed—yet one does not know that great wisdom as foolishness is the path to sainthood. Heaven and earth undergo reversals, and the inner form is strange indeed—yet one does not know that harmonious interaction, not strangeness, is what makes one a sage.\n\nFor the previous passage’s method, it points to the true *qi* of the Three Realms dispersed as the expansion of my *yīn-è*—this is merely my true unity aiding, yet still unrelated to my primordial unity. This is but the Buddhist accumulation of relics in the body. The final passage’s extraordinary methods are the distinction of true unity, and their application is vast—all these are the ultimate principles of the Dao. If not aligned with the natural, one falls into peripheral doctrines. One sinks into fire and water.\n\nThe essence of the sacred scriptures is thus: The Dao of nature is still, so heaven and earth and all things are born. The Dao of heaven and earth is *jìn* (浸, permeating), so yin and yang prevail. Yin and yang interact, and transformation follows naturally.\n\nMaster Fan says: The Dao of nature being still is the primordial *Tàijí* in its pristine unity—stillness reaching its peak, then movement, generating heaven and earth as the grand ritual. The two forces interweave, then transform into all things—this reveals the natural cultivation of the primordial Dao in response to the times.\n\nYet the Dao of yin and yang, heaven and earth, is the ceaseless flow of *qi*, circulating and returning, gradually purifying until, at the appointed time, yin and yang prevail and interact. I then respond, filling and replenishing, making transformation smooth and ensuring all beings fulfill their nature—this reveals the phenomena of the postnatal *qi* conforming to the times. And conforming to heaven’s times is to know the moment when heaven and humanity act in unison—the time to move, the time to eat, the time of day and night’s waxing and waning—these are the roots of fire readiness.\n\nOne comment says: *Jìn* means mutual penetration and infusion. Yin within yang, yang within yin—thus, yin and yang prevail. Master Fan’s explanation here is deeply attuned to the Dao’s subtlety.\n\nYet one must know: when there is form, the function is equal to formlessness—reaching the point of utter formlessness while still appearing as if there were form. Upside-down, topsy-turvy—its profound meaning can be intuited but cannot be spoken. All is rooted in the utmost emptiness and profound stillness. Emptiness to its extreme means no obstruction, unhampered by postnatal influences, and able to refine with the Dao, returning to emptiness. Only then can one achieve stillness, and stillness brings clarity—when the moment arrives, one is aware, not confused, and actions are appropriate, avoiding the flaws of misaligned timing.\n\nThis is one moment, its mechanisms manifesting in primordial, postnatal, what should be welcomed, and what should be released. When it is time to advance, advance the fire; when it is time to withdraw, withdraw the talismans. Though natural, it must be guided by intent. And intent has its suppressions and elevations, its yielding and firmness, its slowness and haste, its penetration and concealment. From here, transformation arises, and saintly achievement emerges.\n\nThe late Master Tàixū Wēng said: “The sage transmits the medicine but not the fire, not because it is withheld, but because fire readiness arises with the times and acts according to the moment. Following a template like painting a gourd is impossible. The highest alchemical method is transmitted through the heart. The middle method must be orally instructed. The lowest method must be written down—its methods are cumbersome.\n\n*The Yīnxú* scripture’s text is in cloud-like seals, spanning over ten feet, obtained by the Yellow Emperor from the *Kōngtóng* Celestial Altar. Even the Emperor’s wisdom relied on question-and-answer to clarify it. The versions revered today are those the Yellow Emperor personally inscribed, though written, their profound meaning lies in heart transmission. To rest in the essence of the text is to grasp its highest teaching.\n\nLaozi further said: ‘Humans follow Earth, Earth follows Heaven, nothing follows the Dao, the Dao follows nature.’ The first sentence here, the Yellow Emperor has already revealed the essence. It shows that one must stand firm from before one’s parents were born, before heaven and earth existed, before creation left any trace. Knowing to align with nature is to return, drop by drop, to the source, and to merge, head by head, with the Dao.”\n\nHe also said: “The previous passage encompasses day and night’s waxing and waning, the patterns of time and matter—all things, sweeping them all away. Yet within this passage’s yin and yang transformations lies the meaning of knowing the times—this must be deeply understood. The intent of the previous passage warns against rigid adherence to forms; the intent of this text warns against neglecting the moment. My teacher, the *Níhuán* Master, said that what should be orally transmitted are precisely these profound truths.”\n\nOne comment notes: In this passage, the character “摧” (*cuī*, crush) in ancient and modern editions is uniformly written as “推” (*tuī*, push). Following the *Yìjīng*’s phrase “just and yielding push against each other,” this “摧” should indeed be “推.” The *Tàiwéi*律院’s hidden preceptor, with the national teacher and high scholar Wáng Kūnyáng, received transmitted artifacts. From the Chióu Ancestor onward, successive true persons passed down robes, bowls, scrolls, and as-you-will staves—among them, the *Kōngtóng Question-and-Answer*, bearing the Song Emperor Taizong’s imperial seal, titled as Chen Xīyí’s treasured edition, with Zhòngyáng Wángzǔ’s personally inscribed transmission precepts preserved. This is the ancient text from before the Song and Yuan dynasties, written with “摧.” Thus, this edition’s “摧” must have its source, not a scribal error.\n\nReferring to the *Yìjīng*: “The dragon battles in the wild, its blood black and yellow”—the meaning of mutual crushing. One comment thus retains “摧” as in Master Fan’s text.",
      "overlap_context": "sciple).\n\nIf one says the previous passage spoke of the rules for entering, then within the cycles of day and night, large and small, there lies the application of divine clarity. This passage’ method, however, overturns all such applications—day and night, large and small, the patterns of time and matter, etc.\n\nThis is the art of encompassing the Three Realms (三才) as one, wearing lofty footwear and heavy robes, all as a single body. Moving and still, all living things are companions on the Way.",
      "start_char": 12768,
      "end_char": 13994,
      "start_sentence": 616,
      "end_sentence": 668,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 18.17464518547058,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经玄解正义.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "上篇知之修之句，他本均作修炼，惟律院吕本作修之，文法较古。 盖范氏所得之本，必自律宗来者，故全经篇段节句悉从范本，不从他本分章标题，见者审之。 是故圣人知自然之道不可违，因而制之。 至静之道，律历所不能契。 爰有奇器，是生万物，八卦甲子，神机鬼藏，阴阳相胜之术，昭昭乎进乎象矣。 范氏曰：“自然之道，胎息三部之功也。 而胎息之功，非世俗所谓注意丹田，强拉河车之为。 乃先为天地之交，后行坎离之济，末运归中之妙。 是学在母腹之形状，使任督开通，升降流行，以资生化者。 莫不用十口之反文，得阳之下走，所以有“是故”之称也。 前之成圣登真，莫不由此，故立一无为不动之功，至当不易之法。 而此非律历之数计，可能契符。 于是，有奇器之用。 而此奇器实为道之源，气之本，万化之基，阴符之祖。 圣人藉之以为下手施功之地； 机于此器立而杀； 盗于此器而可而盗； 不神之神是于此器立可而获效； 周流八卦、甲子、水金，莫不由此器立可而逆旋； 天人合发，神迎鬼藏，莫不凭此器立可之功能也。 此器即阴阳相胜之术。 一进用之，必得口口刀圭之阳，故有昭昭之象。 而此器言于末章，是又示人用此奇器于末时也。 第此奇器，人以玄牝、炉鼎、丹田、太极等等指认，岂非正即《参同契》所称“圆三五，寸一分，口四八，两寸唇，长尺二，厚薄均”等句之谓，为奇器之形。 此中器字，有口对口，窍对窍之秘。 进字又用此奇器之处也。 功至用奇器未有不得其一而万事毕矣。 嗟乎，圣经当前，妙诀存心，造化现成，何甘自弃，而不知急务耶，勉之勉之。 一得曰：此解器字，与上下经文不贯，非正解也。 其引《参同契》，而曰奇器之形，中溺于注家邪说，更不可从。 惟云阳道人以河图洛书注圆三五等句，最为精确。 若以河图洛书注器字，庶乎近道矣。 形而上者谓之道，形而下者谓之器。 器者，道之象也。 按此“器”字，当作道字看，可作量字理会。 凡器有形质，而此器无形质； 凡器有大小，而此器无大小； 凡器有内外，而此器无内外； 凡器有尽藏，而此器无尽藏。 故曰：奇器。 以其范围天地，曲成万物，是以名之曰：“器”。 实天地之由生，方物之所从出也。 故曰：是生万物。 以其用言之，则曰器。 以其体言之，则曰道，自然之道也。 自然之道静，律历能测后天之动，而不能契先天之静。 八卦甲子，皆动中之数。 主宰乎八卦甲子之中者，此至静之奇器，有神机鬼藏之用存焉。 其在先天，无迹可名； 其在人身，则曰玄窍，亦无迹可见。 是物我同得于先天者，万物立命之基，即万物归根之地。 万化所由生，圣功所由作。 本此器以修身，则百骸理。 本此器以治人，则万化安。 圣人知天地有自然之道，制器不能契也。 爱有自然之奇器，是万物所由生者，因而本此器以制阴阳之有衍状，探本于生于万物之原，而后万化生乎身。 内则施之于一身，外则施之于天下，皆有神机鬼藏之妙用。 神者，阳气之伸，故言机。 鬼者，阴气之返，故言藏。 阴阳相胜，而适得其平，则万物生斯器，无象而昭昭有象矣，此观天道执天行之极功也。 范氏以私智诬大道，得吾说而存之，邪说庶几其息乎？",
      "translated_text": "The preceding passage’s phrase *\"knowing and cultivating\"* is rendered as *\"修之\"* in the *Lǜyuàn* Lü edition alone—other versions read *\"修炼\"*—its syntax being more archaic. For the *Fàn* lineage’s text must derive from the *Lǜzōng* tradition, its entire structure—chapters, sections, and phrasing—conforms strictly to the *Fàn* edition, not the divided titles of other versions. Thus, the Sage knew the **Dao of Nature** could not be defied and accordingly regulated it.\n\nThe **Way of Supreme Stillness** transcends the reach of calendrical and astronomical measurements. There exists a wondrous **instrument**—the source of all things, the origin of **qi**, the foundation of ten thousand transformations, and the progenitor of the *Yīnfú*. The Sage employed it as the initial ground for practice; with it, one may **establish** and **slay**; with it, one may **plunder** and **steal**; the non-divine becomes divine through its use; the eight trigrams, *jiǎzǐ* cycles, and water-metal correspondences all reverse their motion through it; the confluence of heaven and humanity, the meeting of spirit and concealment—all depend on its function.\n\nThis **instrument** is the art of **yin-yang overcoming**. When applied, it inevitably yields the **mouth-mouth elixir-pill’s** solar essence, hence its manifest symbolism. Yet it is mentioned in the final chapter, indicating its use at the culmination of practice.\n\nMen have identified this **instrument** as the *Xuāntāi*, the *Lúdǐng*, the *Dāntián*, or the *Tàijí*—is it not precisely the *\"round three-five, inch-one-fen, mouth-four-eight, two-inch lips, length one-zhang-two, uniform thickness\"* of the *Cāntóng Qìe*? Within it lies the secret of **mouth-to-mouth** and **orifice-to-orifice**. The term *\"proceed\"* (*jìn*) refers to its application.\n\nWhen the practice reaches the stage of using this **instrument**, all else is complete. Alas! The sacred text lies before us, the marvelous key is in the mind, creation is already manifest—why would one willingly abandon it and neglect the urgent task? Exert yourself, exert yourself!\n\nOne who grasps this says: *\"This interpretation of ‘instrument’ does not harmonize with the text above and below—it is not the correct exegesis. His citation of the *Cāntóng Qìe* to define its form betrays a misguided adherence to commentators’ heresies, and must be rejected. Only when the *Hétú-Luóshū* annotates the ‘round three-five’ passage does it attain precision. If the ‘instrument’ is annotated with the *Hétú-Luóshū*, then perhaps it approaches the **Dao**.\"*\n\nThat which transcends form is called **Dao**; that which is within form is called **instrument**. The **instrument** is the **Dao’s** manifestation. Examining the character *\"instrument\"* (*qì*), one should regard it as **\"Dao\"** or interpret it as **\"measure\"** (*liáng*). All **instruments** have tangible substance, yet this **instrument** lacks substance; all **instruments** have size, yet this one has none; all **instruments** have interior and exterior, yet this one transcends them; all **instruments** have limits, yet this one is boundless. Hence it is called *\"wondrous **instrument**.\"* It encompasses heaven and earth, shapes all things—thus it is named **\"instrument.\"** It is the means by which heaven and earth generate, the origin from which all things emerge. Hence it is said: *\"It generates all things.\"*\n\nWhen spoken of in terms of its function, it is called **\"instrument.\"** When spoken of in terms of its essence, it is called **\"Dao\"**—the **Dao of Nature**. The **Dao of Nature** is still; calendrical and astronomical systems can measure the movements of **post-heaven**, but cannot fathom the stillness of **pre-heaven**. The eight trigrams and *jiǎzǐ* cycles are all numbers within motion. What governs the eight trigrams and *jiǎzǐ* is this **wondrous instrument of supreme stillness**, possessing divine subtlety and hidden efficacy.\n\nIn **pre-heaven**, it leaves no trace to name; in the human body, it is called the *Xuānqiào*—yet even this is invisible. This entity, shared by all beings in **pre-heaven**, is the foundation of their existence and the root to which they return. It is the source of all transformations, the origin of the Sage’s work. Cultivating the body through this **instrument** harmonizes the hundred bones; governing the world through it brings order to all things.\n\nThe Sage knew that heaven and earth possess the **Dao of Nature**, which no artificial **instrument** can replicate. Thus, he took this **wondrous instrument**—the origin of all things—as the foundation to regulate the patterns of **yin-yang**, probing the root of life’s emergence, so that all transformations arise within the body. Internally, it is applied to the self; externally, to the world—both yielding divine subtlety and hidden efficacy.\n\n**\"Divine\"** refers to the extension of **yang-qi**, hence *\"machine.\"* **\"Ghostly\"** refers to the return of **yin-qi**, hence *\"concealment.\"* When **yin-yang overcoming** achieves balance, all things generate from this **instrument**, though it lacks form yet manifests symbolically—this is the ultimate function of observing the **Dao of Heaven** and embodying its operations.\n\n*Fàn* relied on private speculation to distort the Great **Dao**; yet his words are preserved here. Perhaps heretical interpretations may now cease.",
      "overlap_context": "er*, bearing the Song Emperor Taizong’s imperial seal, titled as Chen Xīyí’s treasured edition, with Zhòngyáng Wángzǔ’s personally inscribed transmission precepts preserved. This is the ancient text from before the Song and Yuan dynasties, written with “摧.” Thus, this edition’s “摧” must have its source, not a scribal error.\n\nReferring to the *Yìjīng*: “The dragon battles in the wild, its blood black and yellow”—the meaning of mutual crushing. One comment thus retains “摧” as in Master Fan’s text.",
      "start_char": 13996,
      "end_char": 15215,
      "start_sentence": 669,
      "end_sentence": 729,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 12.969578504562378,
      "metadata": {
        "source_file": "dao\\藏外\\阴符经玄解正义.txt",
        "category": "藏外"
      }
    }
  ]
}