{
  "source_id": "鬼谷子天髓灵文",
  "source_file": "chunked_daozang\\鬼谷子天髓灵文.json",
  "total_chunks": 16,
  "total_original_chars": 16503,
  "total_translated_chars": 92863,
  "total_translation_time": 266.5173408985138,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\鬼谷子天髓灵文.txt",
    "category": "方法类"
  },
  "full_translation": "**Ghost Valley Master’s Celestial Essence and Sacred Texts**\n\n**Title:** *Ghost Valley Master’s Celestial Essence and Sacred Texts*\n**Author Unknown**\n**Two scrolls**\n**Source:** *Zhengtong Daozang* (Orthodox Daoist Canon), *Dongshen* (Cavernous Gods) Section, *Methods* Category\n\n---\n\n**Ghost Valley Master’s Celestial Essence and Sacred Texts – Upper Scroll**\n\nThe watery abyss master, Ghost Valley Child, secretly transmits the grand Dao of celestial patterns, measuring the mechanisms of Heaven and Earth, comprehending the origins of transformation. Heaven bestows true nature, yet it is obscured by cravings and desires. Unaware of life and death, one struggles to grasp the subtle truths. The *Dao* and *De* of *Yinfu* [1] encompass the fundamental principles of the Way. The night-photographing inner elixir is the path of the Sage.\n\nOrdinary mortals, bewildered by true nature, failing to grasp ultimate truth, thus name it *Yiwei* [2]—a hidden secret. Initially, it was passed to Sunzi and Pang Gong [3]. Later disciples, practicing my true methods, all achieved escape from peril, survival, and evasion of death. It liberates one from worldly afflictions—\nfrom the calamities of mountains, rivers, and floods,\nfrom the threats of blades, bandits, and raids,\nfrom the gatherings of vengeful spirits,\nfrom the curses of mad ghosts,\nfrom the perils of a million-man battle,\nfrom the ravages of fire, water, thieves, and robbers.\n\nMy secret celestial arts are named:\n*The Six Heavenly Orthodoxy Formulas*,\n*The Six Divine Scriptures*,\n*The Art of Concealing Form and Hiding Body*,\n*The Technique of Summoning Spirits into the Chamber*,\n*The Scripture of the Soul Wandering the Three Realms*,\n*The Doctrine of the Watery Abyss’s Subtleties*,\n*The Treatise on Transcending Life and Death*.\n\nWithin my teachings lie true formulas and divine talismans:\n1. *The Concealing Form and Hiding Body Talisman*,\n2. *The Summoning Spirits into the Chamber Talisman*,\n3. *The Wandering Soul Through the Three Realms Talisman*,\n4. *The Transcending Life and Death Talisman*,\n5. *The Four Great Fire Substitution Talisman*,\n6. *The Circumpolar Concealment and Sealing of the Boundaries Talisman*.\n\nFor those in the world who practice, receive my orthodox true scriptures, and study my genuine teachings—reaching even the dregs of my doctrine—one must purify the heart, refine the nature, and strictly uphold incense and offerings. At a propitious year, month, day, and auspicious hour, with sincere intent, one must prepare incense and lamps, observe strict fasting, inscribe the divine talismans in cinnabar, silently recite the divine incantations. After forty-nine days, the talismans will manifest their efficacy.\n\nFor men and women in the world who receive my grand formulas and celestial texts, they must hold them with devout sincerity. If one seeks transmission, a ritual platform must be established in three grades.\n\n**Upper-grade platform for transmission:**\nUse five-directional brocade, five segments each forty-nine *zhang* [4] long, forty-nine pairs of jade rings, forty-nine mirrors, forty-nine sets of concentric vermilion and green talismans, forty-nine lamps, and forty-nine sets of money, horses, and provisions.\n\n**Middle-grade platform for transmission:**\nUse five-directional brocade, five segments each thirty-six *zhang* long, thirty-six pairs of gold rings, thirty-six mirrors, thirty-six sets of concentric vermilion and black talismans, thirty-six lamps, and thirty-six sets of money, horses, and provisions.\n\n**Lower-grade platform for transmission:**\nUse five-directional brocade, five segments each twenty-four *zhang* long, twenty-four pairs of silver rings, twenty-four mirrors, twenty-four sets of concentric purple and black talismans, twenty-four lamps, and twenty-four sets of money, horses, and provisions.\n\nThese three grades of transmission conceal the golden casket’s secrets. When practicing, one must select a year of favorable cosmic alignment, a good day, and an auspicious hour—only then may the platform be erected, and the transmission will not be in vain.\n\n---\n**The Concealing Form and Hiding Body Talisman**\nThis talisman is inscribed with cinnabar. With resolute intent, bow twenty-four times toward the Northern Dipper, then grasp the brush, facing the North Pole, drawing breath to blow upon the brush before inscribing the talisman.\n\nAfter forty-nine days of ingestion, one’s form may move unseen. Even amid a million-man battle, inscribe this talisman with cinnabar on the heart (center of the chest), one line on each forearm—it will cause no hindrance, provided one remembers it with sincerity.\n\n---\n**The Summoning Spirits into the Chamber Talisman**\nThis talisman, when practiced and ingested for a hundred days, and the incantation secretly held for a hundred days, will cause the Six Ding Gods [5] to appear before you, to be used at will.\n\nWhen inscribing, use cinnabar, with sincere intent and hidden heart, bow twenty-four times toward the North, then grasp the brush, drawing in the northern *qi* to blow upon the brush’s tip before inscribing.\n\n---\n**The Wandering Soul Through the Three Realms Talisman**\nThis talisman, when ingested for a hundred days, allows the soul and spirit to be directed at will.\n\nWhen inscribing, use cinnabar, bow twenty-four times toward the North Pole, facing north, drawing breath to inscribe the talisman—this is sacred.\n\n---\n**The Transcending Life and Death Talisman**\nThis talisman, when ingested for a hundred days, allows one to depart from life and death, or to assume a corpse’s form.\n\nInscribe as before: bow twenty-four times toward the North Pole, then cease contemplating one’s own body, constantly imagining another’s corpse—whether that of a youth or a refined person—borrowing their form as well.\n\n---\n**The Four Great Fire Substitution Talisman**\nThis talisman is also inscribed in cinnabar. With hidden heart, bow twenty-four times toward the North Pole, drawing in the northern *qi* to blow upon the brush before inscribing.\n\nAfter a hundred days of ingestion, one will perceive fire-like *qi* in the mouth, and the body will appear as if burned by flames—yet fear not, follow the fire at will, while holding the talisman and reciting the incantation.\n\n---\n**My talismans and methods must not be treated lightly.**\nAdhere strictly to purity, hold them with a clear heart, and do not reveal them lightly—be warned.\n\n---\n**Incantation for the Brush**\n*The Heaven is round, the Earth is square; the Six Pitches and Nine Numbers are complete.*\n*A single stroke of the divine brush—ten thousand ghosts perish.*\n*Urgent, as the decree commands.*\n\n*The Primordial Qi is benevolent, prosperous, and perfect; the sun and moon align with my truth.*\n*The divine water enters and is ingested—it does not pass through the body.*\n*Urgent, as the decree commands.*\n\n*Daily, hold the incantation.*\n\n**Invocations and Methods of the Highest Dao**\n\n**Supreme Venerable Lord Lao, Supreme Dao Lord, Primordial Heavenly Venerable of the Beginning, Lord of Eternal Life and Preservation of Life, Lord of the Eight Trigrams Protecting the Body, Lord of Extended Longevity and Equal Venerables, Lord of the Hidden Form and Transformation, Primordial Lord of the Brain Spirit and Essence Root, Lord of the Eye Spirit and Upper Correspondence, Lord of the Nose Spirit and Dragon Qi, Lord of the Tooth Spirit and the Pure Roar, Lord of the Ear Spirit and the Closed Palace of Heaven, Lord of the Tongue Spirit and Rectitude, Twelve Great True Lords of the Heavy Tower, Lord of the Spleen Spirit and Near-Life, Lord of the Gallbladder Spirit and Empty Space, Lord of the Kidney Spirit and Reverent Dark Warrior, Lord of the Intestinal Spirit and Tree-Soul, Left Azure Dragon Spirit, Right White Tiger Spirit, Front Vermilion Bird Spirit, Rear Dark Warrior Spirit, Six Ding and Six Jia Spirits, Lord of the Essence-Housed Lower Primordial Spirit, Lord of the Fetal Light and Refined Essence, Spirit of the Three Corpses—Pengzhi, Pengju, and Pengyao—each dwelling in their place, thus attaining eternal life.**\n\nI, in reverence to the Supreme Venerable Lord Lao, **urgent, as the decree commands.**\n\n**Incantation for the Mind**\nEach day, focus the mind. At dawn, facing the sacred altar, secretly recite **one hundred and eight times**.\n\nWhen forty-nine days have passed, you will sense your body floating in the air like clouds—do not be alarmed, for the method is taking effect.\n\nAfterward, continue daily recitation with great efficacy and secrecy.\n\nFocus the mind with the **Heavenly Key**, practice the **Blood-Qi Method**.\n\nNow, the **blood-qi** pierces the Nine Palaces, traverses the Eight Trigrams.\nCirculate the **True Qi fifteen degrees**, first pressing the tongue against the upper palate, steadying the breath fifteen degrees, where saliva gathers below.\nKnock the teeth fifteen times, rinse the saliva, and swallow it five times when full.\n\nThis is the **Blood-Qi Method**. Upon completion, you will feel sweat emerge from every orifice—this is the verification.\nSubtly perceive the sound of *xiao* and *shao* within the crown.\nPractice the **Nine Returns and Seven Circulations** to attain completion.\n\nThe **Seven Circulations** are the resonance of the heart’s question and the shock of response.\nSend the **Fire Wheel to the crown**, left and right for five days, advancing the fire by three parts daily until completion, then return to the source and record it.\n\nPractice the **Hidden and Nearby Body-Closing Method**:\nWhen Heaven is clear and Earth tranquil, the Six Dusts do not arise.\nWhen the heart-qi scatters, send the thought-fire into the palace, turning **one hundred and eight times**, the light turning **fifty-four times**.\n\nIf the breath originates from the chest, you will feel a breeze-like sensation in the heart—briefly stifling.\n\n**The Hidden and Nearby Method of the Great Sun Golden Elixir** extends lifespan to **one hundred and twenty years of physical life**—this is the utmost secret.\n\n---\n**From the *Water Lian Cave Ghost Valley Master’s Secret Key, Celestial Text of the Three Caverns, Heart of the Jade Void Emperor, Three Teachings True Lord’s Marvelous Treasure, and the True Scripture of the Responsive Dharma-Mind***\n\nBecause the teacher knows the **Key to Eternal Life**, one must know the timing of the fire.\nFirst, recognize the **infant girl with the crimson bloom**, then refine the **yellow bud and white snow**.\nCapture and seize her, place her in the furnace, then scoop her out into nine cups of water, illuminating the Buddha’s light.\nIf not diminished, refine into **qi**—human perception cannot distinguish it.\nKnow that it has **no cold, no heat, no sun, no moon, no time**.\n\nFurther, nurture a **divine embryo** within the furnace—it is neither father’s essence nor mother’s blood.\nWhen the **Three Corpses and Six Bandits are severed**, the Golden Elixir is attained.\n**Do not speak of this to outsiders.**\n\n---\n**From the *Water Lian Cave Master’s Secret Key, Celestial Text of the Three Caverns, Heart of the Jade Void Emperor, Three Teachings True Lord’s Marvelous Treasure, and the True Scripture of the Responsive Dharma-Mind***\n\nMankind is born of Heaven and Earth, yet unaware of the **Five Phases and Transformations of Dao**.\nThose lost in desire perish from lust, suffer for wealth and beauty.\nSome who do good deeds do not receive blessings; some who commit evil do not face retribution.\nThose who fast and observe precepts may glimpse a realm beyond form.\nOr those who practice **nourishment and cultivation**—how could they not hear of the **Hidden and Nearby Method of Clear Distinction and Dispersed Shadows**?\n\nNow, I compile the **Responsive Method**, refining the **Seven Celestial Symbols into Nine Chapters**, to transmit to the world and liberate all beings.\n\nIf men and women in the world practice this method, they must possess a **pure divine nature**, observe the prohibitions, and only then may they fast and cultivate. On the sacred day, the response will manifest before your eyes.\n\nAll men and women in the world who receive this method must **fast and recite the incantation**—it will never fail.\n\nThis text is a **second-level secret from the Three Pure Ones’ Palace**, its talismans recorded to benefit the world and liberate all beings, verifying its marvelous key.\n\nI universally urge all to receive and protect this text.\n**This is a secret book—do not lightly reveal it to others.**\n\nBeware of the **talisman’s authenticity**, the **fasting and prohibitions**, and the **science of avoidance**—all recorded in this volume.\n**Hidden and Nearby Methods of Body Concealment and Dispersed Shadows** are transmitted to the world—**do not lightly disclose the secret.**\n\n**Prohibitions for Practitioners:**\n- **Avoid meat and strong-smelling foods** during the **Three Elements, Five Sacrificial Periods, Four Seasons, Eight Nodes, Three Sevens, Three Eights, the Fifteenth Day, Birthdays, Natal Days, Jiazi, Gengshen, and Renxu**.\n  If violated, the method loses efficacy.\n\n- **Avoid sexual desire** during the **Three Elements, Five Sacrificial Periods, Four Seasons, Eight Nodes, Three Sevens, Three Eights, the Fifteenth Day, Birthdays, Natal Days, Gengshen, Jiazi, Renxu, days of great wind, great rain, great snow, great cold, great darkness, falling stars, great joy, great anger, hunger, or satiety**.\n  **Practitioners must remember this.**\n  If violated, the method loses efficacy.\n\n**Prohibitions on Flavorful Foods**\nAvoid the following: beef, dog meat, black fish meat, turtle meat, the **Five Pungents**—*xiè* (scallions), garlic, onions, coriander, and chives—as well as pungent, sour, bitter, and salty tastes.\nIf a practitioner consumes these, they will **injure the spirit and exhaust vitality**, risking failure of the method. **Take extreme caution.**\n\n---\n\n**Water False-Symbol (Jiafu)**\nWrite this symbol in cinnabar ink and swallow it with flowing water.\nOn the **Day of Full Moon**, face **Beidou (the Big Dipper)** and absorb its *qi* while reciting the incantation and inscribing the symbol.\nAfter **forty-nine days** of ingestion, crossing water requires no boat.\nAt **one hundred days**, if water enters and fills the space like a house without wetting clothes.\nAt **one thousand days**, one may traverse water and transform.\n**Do not reveal this lightly.**\n\n---\n\n**Metal False-Symbol (Jin Jiafu)**\nWrite this symbol in cinnabar ink and mix it with powdered mercury.\nForm it into pills or pellets, then swallow with cinnabar water.\nAfter **forty-nine days** of ingestion, one dreams of walking among swords and spears—this is the **soul’s departure**.\nAt **one hundred days**, one sees sword-blades; the practitioner must hold the incantation and symbol to transform.\nIf encountering any iron object, one’s true form appears within it, assuming its guise.\nWhen inscribing this symbol, face **Beidou**, absorb its *qi*, and blow the incantation onto the brush before writing. **Keep it secret.**\n\n---\n\n**Fire False-Symbol (Huǒ Jiafu)**\nWrite this symbol in cinnabar ink on mercury-leaf paper, forming **nine #1** (likely *wǔ* 吴, \"five\" or *yī* 乙, \"second heavenly stem\") and swallow with **south-flowing water**.\nAt **one hundred days**, it appears as if borrowing fire for punishment, yet one’s own **true solar fire** responds.\nThe **self-born fire** is generated by rubbing both hands together for **one hundred days**, transforming ordinary fire into this method’s fire.\nIn ancient times, **Yellow Emperor** used this method to ride the **Fire Dragon** and pay homage to the **Three Realms**.\nThis draws **Taiyang’s (Sun’s) *qi***, blown onto the brush before inscribing the seal.\n\n---\n\n**Wood False-Symbol (Mù Jiafu)**\nUse **sandalwood heartwood**, decocted into a drink and swallowed, while holding the symbol to one’s body.\nCraft a **divine pillow** by startling a jujube tree with thunder, measuring **seven inches two fen** in width and height, **two inches five fen** in thickness.\nAt dawn, visualize one’s form as if within the pillow before ingesting the symbol.\nAfter **forty-nine days** of reciting the incantation, the divine pillow becomes one’s body, identical in form and substance.\nAt **one hundred days**, the method is unbreakable; resolve must not falter.\nAt **one thousand days**, the divine pillow departs on a grand journey, leaving only the pillow in the room as one’s body.\nIf buried while away, others will exclaim, *\"How can the dead return?\"*\nAt such times, it appears as if the tomb was broken open, revealing only the divine pillow inside.\nThis method allows one to **die temporarily**—another pillow must be crafted for **twelve more months**.\nInscribe this symbol facing **east before sunrise**, blowing *qi* twelve times onto the brush before writing.\n\n---\n\n**Earth False-Symbol (Tǔ Jiafu)**\nWrite this symbol in cinnabar ink, mixing it with **divine soil (shéntǔ)** and **half a *qián* of reishi powder**, forming pills resembling pellets.\nAfter **one hundred days** of ingestion, one’s body moves like wind and clouds, ascending slopes and descending ravines.\nIf practicing the **divine symbol’s left and right techniques**, one may discuss life and death in this world.\nWhen preparing to depart and transform others, avoid staying in **fire temples (huǒ’ān)**; always observe one’s reflection in a mirror, imagining the form and shadow absorbed, then inscribe it on the temple wall with ink.\nFor practitioners at **one hundred days**, ensure no one enters the room—**no women, chickens, or dogs may see this symbol**.\nFace the **four directions**, absorb their *qi*, and blow onto the brush before inscribing.\nRecite the **Pointing-Light Incantation** while holding the symbol:\n*\"Above, the East-flowing Pointing-Light;\nAromatic water enters, concealing ten thousand evils.\nThree-two but—\nLeft, the Green Dragon; right, the White Tiger guard.\"*\n**Brush Incantation**:\n*\"The brush as a sharp blade,\nCinnabar as a hundred medicines—\nWhere the divine symbol arrives, ten thousand evils vanish.\nUrgent! As the Law commands—**expedite and subdue!**\"*\n\n---\n**Secrets of the Three Caverns: Jade Spirit Great Emperor of the Celestial Heart**\n**Graduated True Person’s Secret Precepts**\n\nHeavenly marrow is the foundation of **Yin-Yang’s innate nature**—some are virtuous, some evil; some wise, some foolish.\nThose who cultivate virtue are protected by heavenly spirits, while those who cultivate evil meet retribution, suffering misfortune.\nAs in ancient times, **Yellow Emperor** and all celestial beings below practiced this method to **save and transform living beings**, bestowing blessings from all the immortals.\n\nThe **hidden arts of concealing one’s form** have several methods, all paths to transcendence and gates to the **Great Dao**.\nThese texts were once transmitted orally by ancient **Dao/Way-masters**, never recorded.\nThis book was kept by the **Purple Micro Cavern Master**, later passed to **Wei FuRen**, then to **Xie ZiRan**, and finally to **Zhang Shi**.\nZhang Shi collected the texts, filling his home with symbols for three years.\nOne day, a messenger arrived midday with music—heavenly spirits had come to announce the decree, and the entire household ascended in broad daylight.\nOn that day, Zhang Shi hid the texts in **Zhongnan Mountain**, concealing them in **Yiwen**.\nOnly those with **host-fated Dao-heart** in this lifetime may encounter these precepts.\nIf worldly beings obtain this secret, they must **diligently practice for one hundred days**, safeguarding the fruit—**it will surely manifest divine efficacy**.\n\nAt that time, **Graduated True Person Bi Shangqing** transmitted this scripture to **liberate beings from suffering**, acting as the **bridge to supreme immortality**.\nAll who **resolutely practice for one hundred days** will see **unfailing results and responses**.\n\nThe name of my Dao is called the *Nine Luminaries Radiant Capital Secret Scripture*, concealing nine divine symbols that must not be lightly shown to others.\n\nThis scripture may be transmitted to only one or two persons after thirty years—do not lightly pass it to unworthy disciples. Those who study it will not easily grasp its essence. If one betrays and transmits it, they will forever fall into hell, unable to escape the Nine Realms, descending into the Avīci Hell to suffer endlessly, never again encountering the true scripture in ten thousand kalpas.\n\nIf worldly beings receive and uphold this text with resolve, they must do so in secrecy. If one who possesses the scripture does not share it, they will likewise fall for concealing it. Remember, remember.\n\nIf worldly beings practice this scripture and fulfill its precepts, their names will be recorded in the *Zifu* [Purple Bureaucracy], and they will rank among the True Immortals. If practiced at home, they must not let women or animals witness it, lest they fall and fail. Only those who conceal their practice, hide their form, or face persecution—whether by bandits, weapons, or malevolent spirits—those who aid the distressed or perform acts of mercy in myriad ways may achieve fulfillment.\n\nAwaiting earnest devotion, they shall enter the ranks of the Celestial Officials, their merit beyond measure—words cannot fully describe it. To scorn this is to invite boundless sin.\n\nThis text is kept in strict secrecy.\n\n**The inscribed talisman reads:**\n*\"Heaven round, Earth square—Nine-Two Celestial Chapter.*\n*The divine pen descends; clouds billow, spirits obey.*\n*I, in service to the Sovereign of the Northern Pole, Purple Microstar Emperor, decree with urgency as the law commands.\"*\n\n**The daily invocation of the Six Wu Divine Spell:**\n*\"As the sun rises in the east, blazing with fire’s might,*\n*The Six Wu talisman ascends on clouded script.*\n*Riding the clouds, descending to strike down evil,*\n*To banish calamity and dispel malevolence.*\n*The Heavenly Gods aid me—ten thousand demons vanish.*\n*I, in service to the Sovereign of the Northern Pole, Purple Microstar Emperor, decree with urgency as the law commands.\"*\n\n**Talisman to Summon the Six Jia Gods Riding the Vermilion Steed:**\n*Write this talisman in cinnabar ink, using water drawn from a well at dawn on a *Gengshen* day, before the sun rises. Hold the spell and chant as before.*\n\nThis method was once practiced by a True Person, who after three hundred days mounted the Vermilion Steed, invoking the Six Jia Heavenly Gods, and arrived at the Golden Staircase Hall. At that time, Emperor Wu of Han also witnessed it, astonished, and invited the master to drink. The master drank deeply, and suddenly, a fire erupted in the northwest. The master spat out wine to extinguish it. The Emperor then begged the master to stay, but the master refused, mounted the Vermilion Steed, and vanished.\n\nIf one in the world seeks to uphold this method, they must do so with resolve. If the precepts are fulfilled within three years, the method will respond.\n\n**Talisman for Clear Departure and Dispersal of Shadows:**\n*Follow the previous method of chanting and inscribing the talisman. After a hundred days of service, gaze at oneself in a mirror daily, driving away the form with incantations. Then, merge the body into the mirror’s reflection—no one will see you, or you may ascend to the rooftop of your home. Keep this secret.*\n\n**Talisman to Scrutinize Life, Death, and Destiny:**\n*Inscribe this talisman as before, invoking the Celestial Master to dispatch a celestial youth in dreams, who will urgently report its effects.*\n\nThis method was once practiced by Wang Qiao. Though many did not follow him in life, after his death, those who turned to true practice spread it across the city, and its divine efficacy became renowned.\n\n**Talisman to Summon the Spirit and Leave the Shell:**\n*After forty-nine days or a hundred days of inscribing and serving this talisman, hang one’s form and shell in various places, moving through objects to manifest the body’s shadow. This method is wondrous—fulfillment comes at a hundred days.*\n\n**Talisman for Rebirth and Exchange of Dwellings:**\n*Inscribe as before. After a hundred or three hundred days of service, if one despises their own aging or ugly form, they may take the corpse of a recently deceased person—sixty years old—whom they have personally seen. After the corpse is buried, provide small offerings to the deceased’s kin, ensuring the body is interred. Then, return to the home, perform the ritual, and strike yourself once. Embrace the newly deceased corpse. Shortly after, the spirit in the new body will awaken. Feed it a small portion of glutinous rice porridge, and it will recognize you. Return to the corpse’s burial site to tend to it secretly, ensuring no one knows. Then, bury it as before. If one wishes to reuse this method, it will surely respond.*\n\n**Caution:** During practice, one must absolutely avoid women witnessing it. Keep this utterly secret.\n\n**Driving the Three Corpses Away from the Body Talisman**\nThis talisman follows the previous method. After taking it for a hundred days, the Three Corpses will depart the body on their own, preventing confusion and disorder of the human mind. Once the Three Corpses are expelled, one attains the Dao of immortality and the rank of the Transcendent.\n\n**Talisman of the Divine Sword to Seize Retribution**\nThis talisman follows the previous method. When inscribing it, one must recite a single incantation over the censer, then burn it to ash and swallow it with pure water over forty-nine days. This method relies on the practitioner’s accumulated virtue. When encountering vengeful spirits, malevolent ghosts, or any wrongdoers, use this talisman. Recite it over the censer once, then visualize the wrongdoer as before—when the intention is clear, retribution will be achieved.\n\nLet those who first learn this method practice secretly, never allowing others to witness it. Keep this utterly concealed.\n\n**Talisman to Drive the Six Wu Spirits and Divine Generals to Spray Clouds**\nBefore inscribing this talisman, there are additional incantations and methods for recitation. The talisman must be drawn on a day and hour corresponding to one’s birth year.\n\nSeal off your bedroom with curtains, ensuring no wife, female relatives, or close kin witness it—lest the ritual be broken. Those practicing the preceding methods must also seal a pure chamber, using sixty lamps, six paper horses, and six portions of food.\n\nAfter such preparations, select a *Gengshen* or *Jiazi* day to perform and recite the ritual. Invoke the Highest Jade Emptiness Emperor and the True Person of Supreme Worthiness, then keep this secret.\n\n**Ghost Mirror**\nFor anyone wishing to swallow a talisman and drink water, seven days prior, use seven yellow paper-money and seven white paper horses to make offerings in a secluded chamber. On the seventh day, choose a *Gengshen* or full-moon day, before sunrise, facing east and bowing in worship. Burn the paper offerings, then let the talisman and water float before swallowing it.\n\n**Method of the Adjusting-Spirit Talisman**\nThis method encompasses the Dao of the Three Realms and the Six *Jia* Flying Spirits, enabling one to foresee auspiciousness and calamity, avert aging and death, and know the origins of fortune and misfortune beforehand.\n\n**Method to Invoke the Auspicious Spirit for Sacrifice and Response**\nThe sun is my father,\nThe moon is my mother,\nThe Five Stars are my brothers,\nThe Great Unity is my friend.\n\nI solemnly invite:\nThe Eastern Gate Cui Judge,\nThe Northern Gate Xu Judge,\nThe Western Gate Li Judge,\nThe Southern Gate Zheng Judge,\nThe two departments’ child spirits—good and evil,\nThe Mighty Ghost King,\nThe Ox-Head Prison Warden,\nThe Lesser Mighty Ghost King,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe Star Constellations and Lunar-Solar Interactions,\nThe Heavenly *Jia* King,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe Earthly *Jia* King who knows of buried corpses and hidden treasures in the Nine Capitals,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe *Jia* King who knows of escaped slaves and fugitives,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe *Jia* King who knows of calamitous stars, malevolent influences, and ghosts harassing people,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe *Jia* King who can cure blindness and interpret the language of ghosts and spirits,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe *Jia* King who can conceal one’s form and hide,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe *Jia* King who knows how to subdue and drive spirits, skilled in the Twelve Spirits,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe Six *Bing*, Six *Yi*, Six *Ding*, and Six *Jia* Kings,\nto assist my ritual power.\n\nI solemnly invite:\nThe Sixty *Jiazi* Kings,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe Six *Ding* and Six *Jia* Kings of the Year, Month, Day, and Hour,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe Eastern Azure Emperor, the Green Dragon talisman king, whose *qi* enters my body,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe Southern Vermilion Emperor, the Azure Bird talisman king, whose *qi* enters my body,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe Western White Emperor, the White Tiger talisman king, to descend,\nwhose *qi* enters my body,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe Northern Black Emperor, the Dark Tortoise talisman king, to descend,\nwhose *qi* enters my body,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe Central Yellow Emperor, the Hooked Serpent talisman king, to descend,\nwhose *qi* enters my body,\nto descend to this Daoist hall and assist my ritual power.\n\n**Method to Invoke the Auspicious Spirit for Sacrifice and Response**\n\n**Deranged Incantation**\nMay the stars fall,\nMay the sun sink,\nMay the mountains crumble,\nMay the earth split,\nMay the waters dry up,\nMay the fires extinguish,\nMay diseases vanish,\nMay all be at peace,\nMay the dead revive,\nMay iron harden.\n\n**Heavenly *Jia* Talisman**\nThe Heavenly *Jia* Talisman—its master must know of celestial stars falling, solar and lunar eclipses, and the shifting of droughts and floods in the year. It ensures the five grains grow well and the four seasons are properly sacrificed to the tortoise.\n\nThe talisman transforms into the voice of a child, and beside it, the heart whispers the name of the calamity. The incantation is spoken, then the talisman is inscribed.\n\n**Earthly *Jia* Talisman**\nThe Earthly *Jia* Talisman—its master must know of buried corpses, coiled springs, subterranean treasures, divine artifacts, and hidden caches that are difficult to locate. When this talisman is sacrificed, one will know the depths below.\n\nThe talisman transforms into a small boy. If there is treasure, he will appear. After finding it, the boy will not reveal his form.\n\nWhen beneath the Big Dipper constellation, fully recite the incantation and sacrifice—he will then appear.\n\n**Human *Jia* Talisman**\nThe Human *Jia* Talisman—if a household’s slaves or servants flee or disappear without trace, or if they return but their whereabouts are unknown, the master must know their location by sacrificing this talisman. It transforms into a boy who appears before them, and in their heart, they declare, *“I know their names and whereabouts—far or near, in every direction.”*\n\n**Ghost *Jia* Talisman**\n\n**Ghost *Jia* Talisman**\nThe Ghost *Jia* Talisman—when a household’s men, women, or children suffer from *xīnfēng* (heart-wind) demonic afflictions, ghostly harassment, phantom pains, tiger bites, chronic malaria, or ominous nightmares, the master must know their cause. By sacrificing this talisman, it transforms into a boy who stands before them and, in their heart, reveals the names and hidden whereabouts of the tormentors. Once dispatched to their proper homes, the afflicted will find peace.\n\n**Divine Vision Talisman**\nThe Divine Vision Talisman—when encountering the *Xīn-Yǒu* days (sinister-hen days) at midnight, write this talisman in cinnabar ink on a five-*cùn* silk square beneath a lamp. Construct a three-tiered ash altar, place three lamps, two cups of water, a sword, and a censer of ash in a single layer. Place the Divine Vision Talisman within the censer, stand barefoot, and recite the incantation three times in sacrifice. Burn the talisman with the lamps, mix its ashes into water, and at dawn’s *yín* hour (3–5 AM), offer it as an oblation. With this, one will see all ghosts and spirits gathering their resources and departing.\n\n**Buried Treasure Talisman**\nThe Buried Treasure Talisman—when a household is robbed by night thieves who scatter and flee, stealing all valuables, and the master seeks to track them down. Construct a three-tiered ash altar, place three swords, a mirror, a cup of tea, and a cup of pure water. Recite the incantation once in sacrifice.\n\n**Incantation:**\n*\"With water toward the east—wood collapses.\nToward the south—fire is extinguished.\nToward the west—metal shatters.\nToward the north—water dries up.\nAbove—heaven’s pillar snaps.\nBelow—hell’s flames rage.\nAt the thief—swiftly crushed!\"*\n\nAfter the sacrifice, the thief’s spirit will arrive within three days, and the stolen goods will return to the doorstep.\n\n**Tombstone Spirit Talisman**\nThe Tombstone Spirit Talisman—when a household’s river-drifted bones or tomb relics are lost and unlocated. Write the tomb talisman on a one-*cùn* silk square. At night, when the stars are fully aligned, set up the altar and perform the sacrifice. At dawn, when the sun rises, observe the flying talisman descending upon the grave—vanishing into the valley, transforming into a boy in the underworld, and arriving at the living’s dwelling. If the deceased was male, he appears as a male; if female, as a female. By examining the talisman, one will know the truth of the matter.\n\n---\n*Ghost Valley Master’s Celestial Marrow Sacred Texts (Upper Scroll Complete)*\n#1 *\"Nine\"* should likely be *\"Pill\"* (丸).\n---\n*Ghost Valley Master’s Celestial Marrow Sacred Texts (Lower Scroll)*\n*Chaotic Heaven, Shifting Earth Method*\n\n「All who possess this text and wish to practice it must first accumulate merit through good deeds for three years. Then, in strict observance of purity, bathe in fragrant water. Use a bolt of lightning to shock a piece of *zǎo* (枣) wood, carving it into twelve *Shén Yìn* (信印—\"Divine Seals\"). Conceal them on the first day of the first month, at the *zi* (子) hour, beneath the altar. Spread *bái máo* (白茅—\"white millet grass\") upon the ground, and arrange twelve portions each of *lù fǔ* (鹿脯—\"dried deer meat\"), fragrant tea, wine and fruits, lamps and candles, *tiān huā* (天花—\"celestial flowers\"), and *chāng pú* (菖蒲—\"sweet flag\"). Use *diàn jiǔ* (地酒—\"earth wine,\" i.e., spring water) as well.\n\nSet up the altar beside the victim, speaking not a word, and face the *Tiān mén* (天门—\"Celestial Gate\"). Do not allow others to witness. In a secluded, silent place, arrange the sacrificial offerings, then bare your head and grasp your sword, invoking the holy presence. In silence, recite the incantation seven times:\n\n*\"Tí hù gōu nà, yá chá zhēn wǔ,\nxián má sā bó, tuó yǎn duō xiǎn,\nyí chì yí chì, wū jīn xī xī duō duō!\"*\n\nBarefoot, with tongue bitten and blood spat, face the *Tiān mén* and press one seal upon it, declaring, *\"Swiftly descend!\"*\n\nBlack winds shall rise from the *Tiān mén*, accompanied by clanging arms. Suddenly, a *Dìng Tiān Shàng Dì* (顶天上地神人—\"Earth-piercing, Heaven-toppling divine being\") appears, brandishing a sharp spear, striking the victim’s very body. A dragon and tiger manifest, claws unsheathed and fangs bared, charging toward the victim. Fear not—bow your head and guard yourself with the *Hùshēn Zhēn yán* (护身真言—\"True Words for Self-Protection\"). They shall depart naturally.\n\nThe *Hùshēn Zhēn yán* are as follows:\n\n*\"Swiftly descend, auspicious fortune!\nI now dare to bear it.\nThose who assail me shall perish,\nthose who harm me shall die.\nI descend with righteous law—\nall saints shall descend with me.\nAs swift as the command, thus it is done!\"*\n\nWith reverence, recite the incantation, remain still and unafraid. In time, the transformation shall occur: purple clouds gather at the altar’s edge. Kneel and offer wine and incense, and the *Ràng zhě* (王者—\"Sovereigns\") and *Shèng shèng* (上圣—\"Supreme Saints\") shall descend naturally, bestowing their blessings. With a pure heart and faithful devotion, complete the rites.\n\nAt dawn, consume the sacrificial offerings yourself. Those who drink shall follow the east-flowing water away—do not let others see. The seals measure two *cùn* (寸) and four *fēn* (分) in width, six *fēn* thick, stored in a brocade pouch. Never part from them, nor touch impurity. Violate the *Tiān xīn Shén yìn* (天信—\"Celestial Faith Seal\") and the twelve *Shén yìn* (信印—\"Divine Seals\"):\n\n**The Twelve Divine Seals:**\n*Tiān xìn yìn* (天信印—\"Celestial Faith Seal\"),\n*Dì xìn yìn* (地信印—\"Earth Faith Seal\"),\n*Rén xìn yìn* (人信印—\"Human Faith Seal\"),\n*Lóng xìn yìn* (龙信印—\"Dragon Faith Seal\"),\n*Hǔ xìn yìn* (虎信印—\"Tiger Faith Seal\"),\n*Yún xìn yìn* (云信印—\"Cloud Faith Seal\"),\n*Fēng xìn yìn* (风信印—\"Wind Faith Seal\"),\n*Jīn xìn yìn* (金信印—\"Metal Faith Seal\"),\n*Mù xìn yìn* (木信印—\"Wood Faith Seal\"),\n*Shuǐ xìn yìn* (水信印—\"Water Faith Seal\"),\n*Huǒ xìn yìn* (火信印—\"Fire Faith Seal\"),\n*Tǔ xìn yìn* (土信印—\"Earth Faith Seal\").\n\nUse these twelve seals in order, ensuring none are mixed—then their divine efficacy shall manifest. Those who know this text shall not abandon their mortal form, escape the *Liù dào* (六道—\"Six Realms\"), and awaken to the Daoist realm of immortals.\n\nFor any sudden calamity or perilous affliction, when one faces grave illness, use fragrant incense to pass over the seals, reciting one cycle. The disaster shall disperse instantly, turning ill fortune to good, removing calamity and averting misfortune.\n\n**Celestial Faith Seal (天信印):**\nThis seal can open the heavens. When used to reverse the *Tiān* (天—\"Heaven\"), it can halt the sun, retain the moon, transform day into night, summon snow in summer or thunder in winter, and traverse the sun while observing the moon—all at will. Hold your left hand to *qián hài* (乾亥—\"the *Qián* [乾] and *Hài* [亥] positions,\" i.e., the northwest), and with your right hand grasp the seal. Press it upon the *Tiān mén* (天门—\"Celestial Gate\"), facing the *Zhèn Tiān mén* (震天门—\"Gate of Thunder\"). Then, a Daoist maiden shall descend, fulfilling any request made.\n\nIf you wish to tour the *Rìyuè Gōng* (日月宫—\"Palaces of the Sun and Moon\"), first use the *Yún xìn yìn* (云信印—\"Cloud Faith Seal\"). After bathing in purity, lay out a clean mat, and press the *Yún xìn yìn* to summon clouds. Ascend the void to the Moon Palace. Then, use the *Tiān xìn yìn* to open the Moon Palace, where Daoist immortals and celestial boys shall bear you. When ready, seal it to return.\n\nIf you wish to turn day into night, press the seal into a water basin with the sun’s reflection—then the day shall sink into night. To retain the sun, use a bamboo rod to prop and illuminate it; the sun shall not dare move. To extinguish it, press the seal at the *Tiān nán jiǎo* (天南角—\"southern corner of the heavens\"), and in summer, snow shall fall. To stop, withdraw the seal. If you wish to summon thunder in winter, press the seal at the *Tiān xīn* (天心—\"center of the heavens\"), and the earth shall be shaken by thunder.\n\n**Earth Faith Seal (地信印):**\nThis seal can move the earth, topple mountains, drain seas, subdue ghosts, and summon spirits. It can open mountains and construct rivers, carve trenches and sever ravines—all at will. To cause an earthquake, press the seal upon the *Dì hù* (地户—\"Earth Portal,\" i.e., the southeast). To halt it, press the seal upon the *Tiān gāng* (天罡—\"Celestial Lock,\" i.e., the northeast). Press the seal upon a mountain, and it shall collapse. Press it upon the sea, and it shall be drained. Press it upon ghosts or spirits, and they shall submit, the dragon and tiger shall be tamed.\n\nIf you wish to open a mountain, press the seal upon its peak, and a path shall appear. The mountain spirit shall guide the way. For calamity or danger, press the seal upon a great road, inscribing the *shuǐ* (水—\"water\") character at its center—then it shall become a river, impassable to ten thousand souls. If you wish to create a trench or ravine, press the seal upon a crossroad, and a ten-thousand-*zhàng* (丈) deep gorge shall form.\n\n**Human Faith Seal (人信印):**\n*Líng wàn shèng bǎo* (灵万胜宝—\"Spiritual Victorious Treasure\")\nThis seal can deploy armies and command men, ensuring endless triumph. It can transform a myriad variations—grasses, woods, metals, and stones—into human forms, concealing strange bodies, and entering at will. If you must confront an enemy and need men, encountering a forest, press the seal upon the first tree and spit water into it. The entire forest shall transform into soldiers, each bearing arms.\n\nIf you wish to vanish, hold seven stalks of pure grass before the door, facing it. First, take the *Qīxīng Yǔ bù* (七星禹步—\"Seven-Star Yu Step\"), and ten thousand souls shall be unable to perceive your form.\n\nIn urgent need, press the seal upon your head to become an old man, upon your feet to become a boy, upon your waist to become a woman, upon your face to become a running beast, or upon your arms to become a flying crow—all transformations shall manifest.\n\nPress the seal upon your back to become a forest, upon your chest to become a great stone—all must be done with water. To enter stone, wood, or earth, press the seal accordingly, and you shall enter as desired. Press any object with the seal and water, and it shall vanish.\n\nKeep purity, avoid carrion, and carry water with you. **Seven-Star Yu Step:**\n*Hòu Tiān Bā guà* (后天八卦—\"Post-Heaven Eight Trigrams\")\n*Xùn* (巽) for *Dì hù* (地户—\"Earth Portal\"),\n*Kūn* (坤) for *Rén mén* (人门—\"Human Gate\"),\n*Qián* (乾) for *Tiān mén* (天门—\"Celestial Gate\"),\n*Gèn* (艮) for *Guǐ lù* (鬼路—\"Ghostly Path\").」\n\nTreading the **Seven-Star Yu Step** (七星禹步), ten thousand men shall vanish, their forms unseen. When military needs arise, apply the seal thus:\n\n**The Seal of the Returning Soul** (返魂卫药) — **Celestial Defense Seal**\nThis seal can subdue the **Dragon Treasure** (龙宝). To summon a dragon, press the seal upon an object of strange form, and it shall transform into a dragon, soaring through clouds and mist, its essence shifting between serpent and vermin. With but one seal, it shall swallow clouds and spew mist.\n\nTo become a dragon, take a white silk banner three *chi* in length. Seal its head and tail, inscribing *Dragon* (龙) at its center. Spray water three times and chant *\"Hua!\"* (变) three times—thus you shall transform into a dragon, riding as you will. To halt, press the seal upon the ground. To chase sea beasts, press the seal upon the water’s surface; the dragon or beast shall rise, to be driven at will.\n\nTo become a dragon yourself, press the seal upon your heart, swallow water three times, and speak *\"Hua!\"* (变) three times. Instantly you shall turn into a dragon, ascending upon clouds and mist, even to a thousand *li* away. Spray any object’s color with water and seal it—if you wish a great serpent, inscribe *Serpent* (蛇); if a dragon, inscribe *Dragon* (龙). All shall manifest as desired.\n\n**The Tiger-Faith Seal** (虎信印) — **Subduing Tiger Treasure** (伏虎宝)\nThis seal can subdue and slay tigers, taming all ferocious beasts—mountain tigers, leopards, wolves, and strange creatures alike. It bears the **Tiger-Slaying Talisman** (杀虎符) and the **Mountain-Forbidding Technique** (禁山术), contained within a single scroll.\n\nIf a savage tiger in the mountains devours men and you call for woodcutters, take a red seal on silk and affix it to a tree. The tiger shall crouch beneath it, daring not to move. To kill, press the seal upon an iron plate and bury it beneath a dead tree. To compel the tiger, press the seal upon a peachwood board, wrap it in a green cloth, and wear it. The tiger shall follow, approaching like a lamb. If traveling far through mountain paths, press the seal upon a great stone. The mountains shall vanish near and far, the beasts gone a thousand *li* away.\n\nTo become a tiger yourself, press the seal upon your back, spray water, and chant *\"Hua!\"* (变)—thus you shall stand transformed into a tiger, the wind itself becoming its breath.\n\n**The Cloud-Faith Seal** (云信灵印) — **Rising Cloud Treasure** (起云宝)\nThis seal can summon clouds and ascend to the heavens, conjuring five-colored auspicious clouds (五色祥云), riding them to the sky, and wandering among sun and moon, coming and going at will. With this seal, you may traverse the four great divine continents (四大神洲).\n\nIf one gains this seal’s method, pressing it beneath their feet shall generate clouds across the land. To ride the clouds, press the seal upward upon them—one seal raises one *zhang*, two seals raise two *zhang*. To descend, press the seal downward from above.\n\nTo ascend to the moon, observe strict fasting and purification (精诚斋戒), bathe in fragrant waters, press the seal upon the earth, and summon clouds to reach the moon. First use the **Opening Celestial Gate Seal** (开天门印). If the heavens rain unceasingly and you wish five-colored auspicious clouds, take green cloth, inscribe upon it the Five Directions’ metals—*Wood* (金), *Water* (木), *Fire* (水), *Earth* (火), *Metal* (土)—and press the seal’s characters above it. Thus shall the five-colored auspicious clouds arise.\n\n**The Wind-Faith Seal** (风信灵印) — **Generating Wind Treasure** (生风宝)\nThis seal can summon mighty winds a thousand *li* away, aiding armies in crossing rivers or raising encampments against foes. It can stir sands and hurl stones, responding to any need.\n\nIn darkness and gloom, when forging the seal, employ the **Reverting Wind Seal** (回风印). Thus, if encountering enemies, take a jar or bowl, inscribe upon it in cinnabar *\"Swiftly Generate Wind\"* (速生风), and hurl it toward the sky. Pressing the seal upon it shall summon the wind swiftly, toppling mountains and snapping trees.\n\nTo cross water by ship, use the wind’s force as above. To summon darkness and gloom, direct the previous method toward the **Ghostly Gate** (鬼门) and press the seal upon it. A black wind shall rise instantly, obscuring day and night.\n\nIf caught in contrary winds, press the seal against the wind, inscribing *\"Return\"* (回) upon a bowl and hurling it skyward. The wind shall reverse.\n\n**The Gold-Faith Seal** (金信灵印) — **Shattering Sword Treasure** (碎剑宝)\nThis seal can ascend metal and command iron, rendering white blades powerless. It can sever swords, bend spears, and nullify all knives and axes. Even crimson bows and arrows shall recoil upon approach, harming not a hair.\n\nIn battle, if you wish to hold the enemy at bay, press the seal in cinnabar upon a white silk banner seven times, burn it before the ranks, and stir the ashes into a bowl of pure water. Spray this upon the enemy.\n\nWhen facing foes, press one seal upon each left forearm. They shall approach as if against cotton, blades unable to reach. All arrows shall be deflected, turning back upon their own bodies. To test its power, take five roosters, wrap them in a cage, and attach to one the seal’s *\"Return\"* (回) talisman at its wing. Shoot the roosters—only the one bearing the seal shall suffer no harm, proving its efficacy.\n\n**The Wood-Faith Seal** (木信印) — **Reverting Wood Treasure** (返木宝)\nThis seal can summon all grasses and woods, even riding them through the air. It can employ wooden birds and beasts to carry grain and haul grass.\n\nTo ride a wooden beam, press the seal upon both ends, spray water, and recite *\"Ji!\"* (疾). The beam shall rise into the sky; to halt, chant *\"Zhu!\"* (住). If besieging an enemy camp and soldiers lack provisions, craft a wooden likeness of a flying crow (飞乌), affix the seal to its belly. The wooden bird shall depart for the camp, bearing grain back and forth, using water as before.\n\nTo build a lofty hall or grand residence, apply the seal as above. Travel by night as if by day, but reveal not its secret.\n\n**The Water-Faith Seal** (水信灵印) — **Floating Wave Treasure** (泛波宝)\nThis seal excels in transforming water, overflowing rivers, summoning clouds and rain, redirecting wells and streams, or crossing seas by riding waves—all as desired.\n\nTo summon waves, sacrifice to water with a white horse and its foal, facing north. Press the seal upon an iron tablet and cast it into a river or stream. The waves shall not fail to rise, the thunder shaking them into great billows.\n\nIf crossing a vast river or stream, press the seal upon your shoes. To redirect water or reverse a river’s flow, press the seal upon the ground. The water shall come naturally.\n\n**The Fire-Faith Seal** (火信灵印) — **Arrayed Yang Treasure** (列旸宝)\nThis seal can ignite flames a thousand *li* away, reducing forests to ash and mountains to embers. It can burn camps, scorch fortresses, and kindle fires that rise like marriage flames (姻). Even the sea shall boil beneath its fury.\n\n**On the Use of Fire and Earth Seals**\n\nFor all uses of the Fire Seal, perform the rites at night.\nTo ignite flames a thousand *li* distant, press the seal upon the **Southern Homogeneous Direction** (丙), draw in the *qi*, and blow upon the seal while gazing toward the target. Fire shall erupt from the seal, scorching without bound. To extinguish it, use the Water Seal to quell the flames.\n\nTo burn dwellings, grass, or trees, press the seal upon **blue paper**, wrap it around a round stone effigy, and hurl it upon the structure—fire shall rise with no remedy.\nTo escape peril and alter one’s form, press the seal upon a great mountain stone, and it shall become a fiery mountain.\n\n---\n**The Earth-Faith Seal** (土信印) — **Arrayed Spring Treasure** (长春宝)\nThis seal can cultivate all grasses, grains, vegetables, melons, and fruits. It can transmute soil into gold and stone into jade.\nWhen pressing upon the earth, sow seeds and spit once—roots shall form. Spit twice—stems shall grow. Spit thrice—the plant shall take shape. Spit four times—fruit shall set. Spit five times—the harvest shall ripen.\nTo cultivate all manner of trees and plants, likewise spit water: one spit per impression yields seven *chi* of growth; seven spits yield full maturity.\nAs before, press upon stone to make jade, upon earth to make gold, upon withered wood to sprout leaves, upon trees to bloom in winter, or to conceal oneself within jade—all shall manifest.\n\nThis text is **Heaven’s Secret Scripture**, a wondrous method beyond the mundane. Those who practice Dao and seek immortality, knowing this text, shall gain a decade’s worth of merit. Refining gold, concocting elixirs—all shall succeed.\n\nAll who practice the *Heaven’s Marrow Sacred Scripture* must observe strict purity: abstain from the **Five Pungent** (辛), avoid the **Six Calamities**, accumulate merit free of dust, and cultivate the virtue of the True Ones. Do not trifle with these sacred texts—defilement brings ruin. To pass this to unworthy disciples is a crime without end; this is a treasure worth ten thousand gold.\n\n---\n**The Heaven’s Marrow Chapter on Governing the Realm**\nThis text can govern nations, spread renown across the world, and grant boundless freedom—transforming with myriad changes, appearing and vanishing at will. Scatter beans to raise armies, scatter grass to summon steeds; one man shall repel a hundred foes. Command winds and clouds, rectify *qi* and complexion, turn day into night, reverse winds and halt rains, mend broken bones and severed sinews, and subdue all ghosts and spirits.\n\nHold the **Heavenly Circulation** (乾坤) beneath your gaze. To transcend the mundane and attain sainthood, this is the ladder to Heaven.\nWhen practicing the method, accumulate merit by saving sentient beings, abstain from the Five Pungent, recite the Great Spell, revere the deities, conceal yourself from the world, and never reveal Heaven’s secrets. Understand its profound meaning, steadfast in heart and resolve—this method shall endure in the world.\n\n**Ghost Valley Master** says: *The unworthy shall wield power over nations and armies.*\nDo not divulge Heaven’s secrets—this is the name of the **Supreme Clarity True Person**.\n\nWhen employing this method, first observe purity through fasting and bathing, maintaining strict cleanliness and sincerity. On **solitary, auspicious days**—the **5th of the 5th month, 7th of the 7th month, or 3rd of the 3rd month**—set up the **Ash Altar** in a secluded place beneath the **Northern Dipper**.\n\n---\n**The Ash Altar**\nThree-tiered, the outer square measures **24 *chi*** in length, the innermost **12 *chi***. Place it beneath the Northern Dipper.\nSet up the **Five Direction Flags** according to their respective cardinal points. Upon the altar arrange:\n- Seven portions of **deer jerky**,\n- Seven cups of wine,\n- Seven portions of food,\n- Seven portions of fruit,\n- Seven lamps,\n- Seven cups of pure water,\n- Incense and flowers for offerings,\n- **Wild mugwort** spread upon the ground.\n\nPlace the following **four hearts** at the altar’s edge:\n- One **wild fox heart**,\n- One **aged monkey heart**,\n- One **wild magpie heart**,\n- One **owl hawk heart** (蛩鷮).\n\nPour wine and burn incense, facing the Northern Dipper, dishevel your hair, grasp your sword, and recite the spell:\n\n*\"I humbly summon the Great Emperor True Martial General of the North Pole, swiftly descending to aid my divine power. Urgently bestow upon this altar, fragrant incense and precious offerings. I act under Imperial command, practicing law in the world. As the decree commands, swiftly and without delay.\"*\n\nWith devout heart, offer wine and burn incense. Soon, a **purple cloud** shall shroud the altar, and within its richness, a **green-clad foot** shall appear—do not be alarmed. Upon completing the rites, take the four hearts in a tray and, before the altar, intone:\n\n*\"Fox heart, resplendent and wise,\nMonkey intent, pure and clear.\nKnowledge of spirits, obey my command.\nTrue soul shall not scatter,\nSpirit essence shall live together.\nNow committed to the mortar and pestle,\nYour essence shall be ground to dust.\nI now employ you—each shall fulfill its purpose.\nAs the decree commands, swiftly and without delay.\"*\n\nAfter the rites, let the offerings be consumed by the cloud and carried away by the east-flowing waters.\n\nWith the mortar and pestle, grind the four hearts while reciting:\n\n*\"Herb of power, herb of might,\nI invoke the Supreme Clarity.\nEncounter man—let him die,\nEncounter ghost—let it tremble.\nA thousand grindings bring sanctity,\nTen thousand grindings bring spirit.\nDescend true *qi*, let me ascend.\nAs the decree commands, swiftly and without delay.\"*\n\nPound a thousand times, then add the following ingredients and grind together:\n- **Ghost Mortar** (鬼臼) – half *liang* of the deep-rooted kind,\n- **Ghost Arrow** (鬼箭) – half *liang* of the aged kind,\n- **Ghost Fan** (鬼扇) – half *liang* of the broken kind,\n- **Ghost Supervisor** (鬼督邮) – half *liang* of the fluffy kind,\n- **Realgar** (雄黄) – half *liang* of the finest,\n- **Ginseng** (人参) – half *liang* of the shaped kind,\n- **Fritillary Bulb** (茯神) – half *liang*,\n- **Poria** (茯苓) – half *liang*,\n- **Elephant Brain** (龙脑) – half *liang*,\n- **Musk** (麝香) – half *liang*.\n\nGrind into a fine powder, refine **thousand-year-old pine resin** into nine portions, and coat with **cinnabar** into pills the size of small bullets.\n\nWhen preparing this elixir, **no chickens, dogs, women, or filial children** may witness or defile it. Store the pills in a **silk pouch** for flight and transformation.\n\nOn a **Jiazi day** at dawn, hold one pill in your left hand, recite the spell once, and swallow it with water adjusted by the **Open Heart Talisman**. Then recite:\n\n*\"Talisman water, pure and clear,\nForm the body of transformation.\nEnter my five viscera,\nAid my spirit essence.\nThousand years unaging,\nTen thousand years unshaken.\nI now invoke this spell,\nTo exchange my mortal shell.\nOne gold pill—ascend to Heaven’s court.\nAs the decree commands, swiftly and without delay.\"*\n\n---\n**Burning the Open Heart Talisman into Ash for Ingestion**\nThis elixir is named **Shell-Swapping Pill** (换壳丹), also called **Ghost-Viewing Pill** (视鬼丹).\n\n**Initial Dosage and Transformative Effects**\nUpon taking the first pill, one may walk upon clouds in four strides. The five viscera and six fu-organs are penetrated and cleansed, inducing perspiration. Bathe in hot water afterward.\n\nOn the second day, take two doses. The body’s pores will feel as if pricked by needles, with heat and pain.\n\nBy the third day, expect to expel three to five *sheng* of blood—do not be alarmed, for this is the old blood and viscera being replaced.\n\nBy the seventh day, the elixir reaches the *diniwan* (lower dantian), replacing the marrow. The head will ache as if split—endure it without complaint.\n\n**Pain-Relieving and Conception-Inducing Decoction**\nIngredients:\n- Ginseng (*rénshēn*)\n- Alisma (*zéxī*)\n- Gypsum (*shígāo*)\n- Red arrowroot (*chìjiān*)\n- Licorice (*gāncǎo*)\n- Aconite (*fùzǐ*)\n- Aucklandia (*mùxiāng*)\n\nGrind each into powder. Mix with two *qián* of frankincense water and take three doses daily until the pain subsides. **Never drink river water.**\n\nBy the hundredth day, you may take the elixir at will.\n\nAfter twenty-seven days, your body will fully transform—light as air, vigorous in movement, eyes like jade peaches, face like red lotuses, swift as galloping horses.\n\nBy the thirty-seventh day, your mind will open: no knowledge remains unknown, no scripture unsolved. Your heart will be clear, your thoughts luminous, and your eyes will emit a yard of nocturnal light, visible for ten *li*. You will perceive ghosts and spirits, the sun and moon’s celestial rabbits, and foresee future calamities. Even deities will reveal themselves to you.\n\nUpon completing the hundred-day regimen, you will achieve boundless transformations—sitting may lead to death, standing to immortality—all at your command.\n\n---\n\n**Transformation Talismans**\n**Ghostly Form Talisman (Mengshou Fu)**\nTo assume a towering ghostly form a hundred *zhang* tall, swallow the talisman with water and declare, *\"Grow to a hundred zhang, green-skinned!\"*—all will tremble in fear.\n\n**Ancient Sage Talisman (Laoteng Fu)**\nTo become an elderly sage, swallow the talisman with fragrant water and instantly become a silver-haired elder.\n\n**Heavenly Concealment Talisman (Tianyin Fu)**\nTo vanish, swallow this talisman in daylight—you will become invisible to all. Repeat monthly.\n\n**Battle-Victory Talisman (Zhansheng Fu)**\nIn combat, to render weapons ineffective, burn forty-nine copies of this talisman into ash, mix with thirty-five bowls of water, and administer to soldiers. Their bodies will become unharmed by blades, as hard as iron.\n\n**Divine Army Talisman (Shenbing Fu)**\nBefore battle, use a censer, a bowl of pure water, seven black flags, and a drum. Soldiers must wear black robes over their heads, recite the spell, and inscribe the talisman while visualizing their true *Zhenwu* forms. Burn the talisman, chew the tongue, and mix the blood with the ash and water. Shake the flags, beat the drum, and command the troops to shout *\"Shèng!\"* A north wind will rise, and the soldiers will transform into towering, green-faced, black-armored generals—invincible against a million men.\n\n**Caution:** Do not cross rivers. To do so invites disaster.\n\n**Spell:**\n*\"Bingji Generals, aid my might!\nThousand soldiers bathe—transform divine!\nMountains crumble, seas dry up!\nI bear the True Command—delay not!*\n*As the decree demands, swiftly obey!\"*\n\n---\n**Grass-and-Beans Military Method (Caodou Fa)**\nTo summon grass soldiers and bean horses for boundless warfare, free from worry:\n\nOn the **seventh day of the seventh month** or **fifth day of the fifth month**, draw an ash altar, prepare a fragrant tray with pure water, one *dou* and two *sheng* of large beans, and a bundle of clean grass. Place them at the altar’s center. With disheveled hair, recite the spell from midnight until the fifth watch, then seal the altar.\n\nDaily, purify the room, burn incense, and recite the spell **four hundred ninety times**. Before deploying, silently chant it once. The method will take effect immediately.\n\nFrom the altar’s center, sprinkle the grass and beans with fragrant water while reciting:\n*\"Heaven’s True Edict commands—\nGrass and beans, obey my will!\nTransform into divine soldiers,\nMarch for my campaign!\nSwiftly come, delay not!\nHear my sacred spell—\nAssume your true forms!\nA spray of divine water—\nGrass becomes men, beans become horses!\nAs the decree demands, swiftly obey!\"*\n\nFirst, sprinkle the grass and beans with fragrant water while reciting the spell **seven times**, then spit. Declare over the grass:\n*\"Shelve! Shelve! Shelve! Shelve!\"*\nThen seal the altar.\n\nCarry the *Tianluo Spell* for forty-nine days, reciting it a thousand times daily. Before each recitation, swallow one *Qilingshu* talisman (written in cinnabar at dawn, burned to ash, and taken with water). Then chant the spell.\n\n**Tianluo Spell:**\n*\"Om! Qie Sa Fo, Om! Xi Sa Fo,\nYixia fenfen zhu zhu,\nChike □ nie ya tuo,\nZhituoluo tuoluo om,\nWanglu wanglu yan,\nWuyi yadu, bodu bolu,\nLuniemancha luo,\nHun gouna xie.\"*\n\nWhen reciting, observe strict fasting, bathe, and burn incense. Complete a thousand recitations over forty-nine days.\n\nTake one hundred twenty stalks of grass and one *sheng* and two *ge* of large beans. In a secluded place, scatter the grass widely where no one treads.\n\nTest the method by silently reciting the spell once, wearing the talisman on your head, and spraying water. With a knife, draw seven *zhang*-tall figures and five *zhang*-tall horses in the grass. Adjust numbers as needed.\n\nIf the spell is complete after forty-nine days, you will hear the voices of the grass soldiers—this is verification.\n\n**Deployment Rules:**\nWhen using transformed soldiers in battle, avoid:\n- **East** (forests),\n- **West** (metal),\n- **North** (mountains).\n\nAdhere strictly to these precautions—this is the true **Five Transformations Reversal Method**.\n\nWhen practicing this method, ordinary mortals must remember to reverse calamities—call swiftly and respond swiftly.\n\nIf encountering the *jiǎzǐ* decadal period, invoke the **Six Jia Gods**, using silver coins and a fine horse to sacrifice on your natal day, following the military commandments with utmost precision and solemnity.\n\nIf you obtain the upper scroll, all offenses against prohibitions or the blood of childbirth will be harmless.\n\nThose who have studied the **Six Ren and Escape of Jia** will know their own fortunes’ reversals and sequences.\n\nTo restore original form, recite the spell backward once, then chant the return incantation once: *\"Grass and bean, spirit and vital—return to your true shapes.\"* By this, they will dissolve into grass and beans. The return incantation reads:\n\n*\"Grass and bean, responsive and bright,\nSwiftly dissolve to your original forms.\nI now decree with this spell,\nEach returns to the **Tàiqīng** realm.\nCall swiftly, arrive swiftly—\nAll wishes fulfilled.\nAs the **Lǜyìng** commands.\"*\n\nAfter completing the incantation, spray water and scatter the talismans—then they will vanish.\n\nIf soldiers require horses, they may silently implore the **Língshén** temple, burning incense and borrowing a paper horse. With a crimson thread, bind it to the paper horse’s hoof, and when truly needed, it will respond as if ridden. After the night, feed it with grass as before. Avoid impure water or filth nearby—this would ruin the method.\n\n**Borrowing Horse Incantation:**\n*\"Swiftly implore the responsive spirit to borrow the dragon-horse,\nIts hooves tread the azure clouds,\nA thousand leagues cross the dusty river.\nAs the **Lǜyìng** commands.\"*\n\nIn the temple, burn incense and bind the paper horse with crimson thread upon completion.\nA thousand leagues in a day, tireless—\nWhen crossing water, unbind it,\nThen rebind once passed.\nIf encountering foes without weapons,\nEach may seize small sandstones or clay bricks,\nAnd hurl them toward the enemy ranks—\nThey will self-destruct,\nTheir strength multiplied a hundredfold.\n\nIf supplies run low, write the **Open Intestines Talisman**, burn it to ash, and drink it in water—\nThen hunger and thirst will vanish,\nStrength increased tenfold,\nAnd no hunger for a hundred days.\nOnce the horse has been used,\nApply the **Open Intestines Talisman** again—\nAs before, no harm will follow.\n\nBut those who practice this must have the **Pure and Tranquil Eye** elixir,\nTheir minds open to understanding each principle,\nAnd verify its use with precision—\nNo error, no failure.\n\n**Open Intestines Talisman**\n**Pure and Tranquil Eye Talisman**\n\nFor those who seek transcendence beyond the mortal world,\nThis is the **Book of Dao/Way** for immortals,\nThe path to eternal life—\nDo not pass it to descendants,\nNor reveal it for a thousand gold.\n\n**Tàixuān**’s profound art,\n**Yùdì**’s sacred script.\nBurn incense, chant the spell—\nDemons flee, spirits tremble.\nIf given to a worthy soul,\nBoundless blessings follow.\nPiercing the mysteries of **Qiánkūn**,\nMastering the **Wǔxíng**’s reach,\nDiscerning the **Yīnyáng**’s reversals.\nIf passed through ages,\nIt will safeguard the realm,\nAssist the sovereign,\nPreserve the world—\nEternal life granted,\nNone shall know its common ways.\nAble to grasp the **Tian**’s intent,\nSkilled in deciphering the spirits’ designs.\n\nThose who obtain this book must store it in a brocade pouch,\nEver keep it revered,\nHidden in sacred peaks,\nCaverns, or cliffside shrines.\nAfter three to five years,\nFragrant vapors will rise from this place,\nNuminous flowers and herbs grow naturally,\nAnd gold and jade take form.\n\nFor all who suffer from malevolent spirits,\nOr are ensnared by **xiémièi wāngliàng**,\n**húliè shānmèi**—\nBurn this book with incense and illuminate it,\nAnd all calamities will flee to distant lands,\nTheir bones crushed, forms shattered—\nNo spell fails.\n\nIf a sincere disciple seeks to pass this on,\nThey must first observe strict **zhāijiè**,\nMaintain purity without licentiousness,\nDevote their heart in faith and ritual,\nSwear before the **Tiānzūn**,\nAnd accumulate virtuous deeds to aid others—\nThen they may teach.\n\nIf passed to the vulgar and unworthy,\nDisaster will strike nine generations.\n\nAmong all things in the world,\nHumans are the most numinous and precious,\nMirroring **Tiān** and **Dì**,\nBorn of **Wǔxíng**’s transformation,\nShaped by **Yīnyáng**’s interplay,\nTheir vitality and essence perfected.\n\nThus, though they borrow forms and complete their cycles,\nWith life and death,\nEven the **Shàngshèng Dìjūn** cannot alter this—\nTheir spirits return to the cosmos.\n\nYet many fools persist,\nIgnorant of the **Zàohuà**’s workings,\nSome ingesting **jīnshí**,\nHoping to shed their shells and ascend.\nSome cultivate **qi** and vitality,\nSeeking longevity in this world.\nSome follow heretical teachings,\nDwelling in mountains and fasting.\n\nYet even among immortals’ methods,\nThere are those who ascend and those who remain.\nThose who gain this book are born of luminous wisdom in past lives,\nTheir **shèngtǐ** nurtured beyond mortal dust,\nSensing the **Miaojué** of humanity,\n**Tian** bestows eternal guardianship,\nUnveiling the **Yuan**’s mysteries,\nClarifying the **Shèng**’s intent.\n\nSuch is the truth—\nIn ten thousand, not one errs.\n\nFools who do not grasp the **Shènglǐ**,\nBlindly imitating the enlightened,\nMadly forcing the **Shèng**’s will,\nTheir bones turn white through endless kalpas,\nExceeding the **Xūmí** peaks,\nTheir spirits wander lifeless through ages,\nHungry ghosts of the **Běimáng** slopes.\n\nAgain, they do not know death’s limits loom near,\nChasing longevity in vain,\nFor even worldly immortals\nHave bounds to their practice,\nYears to await.\n\nAncient and modern mortals\nKnow life but not death,\nClinging to dust like the blind ascending mountains,\nDwelling in the world like night travelers crossing waters.\n\nSome regret their folly too late,\nDrowning in suffering’s sea.\nI would not leave this art in the world.\n\n**Method of Verification:**\nFor those who seek eternal life and worldly dwelling,\nThey must first know their fate’s distance—\nOnly then may they cultivate the **True Dao** and nourish their lives,\nErase their death records,\nLeave no trace in the **Yīnbù**,\nAdd their names to the **Yùcè**,\nAnd enter the **Xianxiang** without end.\n\n**Right: Verification of the Guardians.**\nFirst, observe **zhāijiè** and bathe for seven days.\nOn the third day of the third month, before sunrise,\nTake an axe and blade to the mountains,\nAnd gather **jīngzhàng** branches—one hundred twenty stalks,\nEach twelve inches long.\nBind them with five-colored threads,\nWrap and suspend them in the southeast corner—\nDo not let them touch impurity.\n\nAgain, on the fifth day of the fifth month, before sunrise,\nGather twelve stalks of **dùjīng**,\nEach twelve inches long,\nBind them with five-colored threads,\nWrap and suspend them in the northwest—\nDo not let them be defiled.\n\nOn the seventh day of the seventh month, before sunrise,\nAs before, gather thirty stalks of **jīngzhàng**,\nEach seven inches long,\nBind them with five-colored threads,\nAnd suspend them in the northeast—\nDo not let them be violated.\n\nOn the ninth day of the ninth month, before sunrise,\nAgain gather twelve stalks of **dùjīng**,\nBind them with five-colored threads,\nWrap and suspend them in the southwest—\nDo not let them be sullied.\n\nThe fourfold ritual—suspended **jīngzhàng** and **dùjīng** in their respective cardinal directions—must remain untainted, unseen by others.\n\nOn the first day of the twelfth month, at night, retrieve the four directional **jīngzhàng** from the purified chamber. Offer them with incantations, keeping the lamps burning through the night.\n\nUse seven red-flower oil lamps, twenty-one **jiāngxīn** (wax wicks) subjected to nine steams and nine sun-bakes, lighting seven lamps. Offer seven portions each of incense, flowers, fruit, tea, and pure water.\n\nFrom the first night of the month, offer the **pànzhàng** (judgment rods), burning incense continuously and reciting the spell seven times, fumigating the **jīngzhàng** with it. The incantation reads:\n\n*\"Spiritual **jīngzhàng**, mighty **jīngzhàng**,\nEarth and wood flourish in growth.\nThe Five Powers now summon you—\nI command you to know this:\nThe fate of the year [so-and-so],\nNow bound in spiritual **jīngzhàng**.\nManifest in the tenth month,\nVanish when the limit is reached.\nI now invoke this spell—\nObey my command as law.\nSwiftly, as the precepts decree.\"*\n\nFrom the first night of the twelfth month onward, maintain the ritual offerings and recite the spell seven times without interruption.\n\nBy the twenty-ninth day of the twelfth month, on the eve of the New Year’s dawn (fifth watch), light seven lamps, combining them into eleven. In seclusion, unseen by others, kneel facing northwest and recite the spell once. Sit upright, holding the lamps, and illuminate a pair of white jade discs placed to the south.\n\nAlternatively, veil your face and take the first batch of **120 jīngzhàng** (excluding the current year’s count). Hold one stalk toward the lamp—when its shadow appears on the wall, pass it over. Repeat with another stalk in the same manner. When the year of one’s death arrives, if the **jīngzhàng**’s shadow does not appear, record it.\n\nNext, take the second batch of twelve **xíngzhàng** (punishment rods), fumigate them with incense, and intone:\n*\"I solemnly declare to the **dùjīng**—\nGrant my plea in this lunar month.\nAs before, illuminate them—\nWhen the limit is reached and no shadow appears, record it.\"*\n\nProceed likewise with the third batch of thirty stalks, reciting the invocation until no shadow manifests—record it.\n\nThen take the fourth batch of twelve stalks, reciting the invocation as before. When no shadow appears at the limit, meticulously record it in writing.\n\nBurn the **jīngzhàng** in a cauldron, offering the ashes in sacrifice and scattering them into flowing water.\n\nThrough accumulated merit and practice, when the allotted year, month, and day arrive, employ the *Ghost Valley Master’s Revival Technique* to avert death. Erase your name from the death registry, achieve immortality, and dwell in the world. If the year is forgotten, enter the Dao of the Immortals, aligning with Heaven and Earth, equal in years to mountains and rivers.\n\nSince ancient times, accomplished sages have practiced this method, attaining longevity and fulfillment.\n\n**The Revival Technique to Avert Death:**\nBefore the allotted year, month, and day, observe strict fasting and purification. In a clean chamber, lay out a mat two inches thick and a pillow seven inches high. Face south, abstain from food and speech, and lie down for seven days while ingesting the *Locking the Intestines Talisman*.\n\nOn the day before the limit, at the burial site, dig a pit two *zhang* (twelve feet) deep. Place a coffin before the grave, filling it with one *sheng* (eight ounces) each of the five grains and two *ge* (two ounces) of rice. On the appointed day, lie within the coffin, facing south, feet extended.\n\nAt the critical hour, don the *False Death Talisman*, place the five grains inside the coffin, and at the *chen* hour (7–9 AM), scatter your hair. With your right hand, grasp a handful of yellow earth, and hold a mouthful of water and rice in your mouth. Your left hand should form the *Gān-Hài* (乾亥) earth trigram.\n\nExit the grave toward the Ghost Gate, stepping on the *Seven-Star Yu Step* as you depart—never look back. Your name will be erased from the underworld registry, and your name inscribed on the Jade Roll, though mortals will see you as dead.\n\nThis is the *False Death Revival Technique*—do not divulge this celestial secret.\n\nDuring the Tang dynasty, a military officer named *Dú Wēng* practiced this technique and lived for 927 years before ascending in broad daylight on a red crane.\n\nLater scriptures of the immortals make no mention of this art.\n\nThe *Seven-Star Yu Step* and *Locking the Intestines Talisman* are recorded at the beginning of this scroll and are not repeated here.\n\nThe *False Death Talisman* is enclosed in the preceding section. Use the earth in your palm and the rice in your mouth, discarding them at a distance of 120 steps—no fear shall come.\n\n**False Death Talisman:**\nThe preceding talisman must be used in the twelfth month while abstaining from nourishment. Write it in vermilion and place it in the coffin, aligning it with your form—thus, you will not see your own death.\n\n**Divine Elixir of Transformation:**\nThis is a divine and wondrous formula, containing miraculous techniques that communicate with spirits and verify the sacred. It astonishes the ears and startles the eyes—summoning summer snow and winter thunder, conjuring clouds and rain, concealing form and altering appearance, extending life in white vitality. Some say it is the essence of alchemical refinement, the profundity of celestial scriptures. The unenlightened, obtaining it, rejoice exceedingly.\n\nAs with the magnet drawing needles, amber attracting dust, the *River Chariot* subduing mercury, the *Rú-ěr* (褕耳) extracting gold, the *yang yu* (阳燧) capturing fire, the otter’s bile dividing wine, crab yellow gathering rats—are these not marvels beyond mortal skill? It is because medicinal natures support one another, and *qi* affinities resonate in harmony, making such feats possible.\n\nThis formula was recorded by Ghost Valley Master and combines earlier techniques. Those who have verified its efficacy often omit it, deeming it the supreme secret of alchemical arts.\n\nExtracting the *Tàiqīng* (太清) Mysterious Chapter, it employs the *Mòzǐ* (墨子) essence of the heart, searching the world for the subtlest medicinal arts. Thus, the *Heavenly Marrow Divine Elixir* was refined, restoring essence and vitality.\n\nIf one exists who has died but not yet decayed within seven days, administering a single pill will revive them without fail. If a dying person is given one pill, they will surely recover. With three pills placed in the mouth, they will revive in moments. Even if administered through the teeth, life will return.\n\nAgainst malevolent spirits, carrying a single grain will drive them away.\n\nBefore preparation, strict fasting and purification are required.\n\nIf taken by a healthy person, it grants longevity and immortality—named the *Tàiyī Returning-Soul Pill*.\n\n**Ingredients:**\n- *雄黄* (Realgar): 12 *fèn* (分)\n- *雌黄* (Orpiment): 12 *fèn*\n- *丹砂* (Cinnabar): 12 *fèn*\n\nPlace the ingredients in a living bamboo tube and bury it underground.\n\nFor **Cinnabar** (*Dan sha*), use a bamboo tube buried on the **south side**; for **Orpiment** (*Ci huang*), place it nearby; and for **Realgar** (*Xiong huang*), position it at the center, each in its own bamboo tube. Seal the openings with **mica powder** (*Yun mo fen*), cover the top with three inches of soil, and burn with **ash-fire** (*Hui huo*) for seven days and seven nights until it transforms into **liquid essence** (*shui hua*). If it has not yet transformed, exhale **fire-qi** (*huo qi*) upon it again, and take it when the desired effect is achieved.\n\nNext, gather the three **liquid essences** (*san shui*) and place them in a **copper vessel** (*tong qi*), leaving it in the **dew** (*lu*) overnight and retrieving it at dawn.\n\nThen, take **well water** (*jing shui*) from three feet deep and mix it with **five *sheng*** of **powdered *Tian xiong*** (male Realgar or *Strobilanthes cusia* powder), refining the **elixir** (*xiu yang yao*). When it turns **red**, shape it into **twelve *sheng*** of **koi fish scales** (*li yu mu*), storing it in a **large golden vessel** (*da jin qi*). Nurture it with **aged pine roots** (*bu lao song gen*) for three years before using it in ritual.\n\nCollect and store it according to the previous **secret method** (*mian fa*) to command **spirits** (*ling hun*).\n\n**Summoning and Subduing Spirits** (*Qu yu ling hun*)\nFor all methods using **paper effigies** (*zhi ren*), one must first understand the **mechanisms of ghosts and gods** (*gui shen zhi ji*).\n\nWhen summoned, they will appear at will, entering and exiting the kitchen, moving freely east and west, and taking whatever is desired. First, identify the **transgressor** (*fan fa zhi ren*) who is about to die. If they have previously consumed alcohol or food, note their **name, surname, age, month, day, and hour** (*ming xing, nian yue ri shi*). If you wish to meet them before their execution, offer **money and paper** (*qian zhi*) to persuade them with wine. The transgressor must then express gratitude, and you will secretly instruct the condemned person in their mind. The condemned will say: *\"No debt—it is your luminous spirit (*ling ming*) that compels me to visit you.\"*\n\nOnce the condemned understands, give them a **Gather-Spirit Talisman** (*ju hun fu*) along with the pill, and secretly toss the pill into the wine. After drinking, say: *\"You wish your fate to be sealed—your voice has summoned me here.\"* The condemned will then appear at the **execution grounds** (*fa chang*), fifty steps away, where you hold a **large mirror** (*da jing*) one foot wide, its face inscribed with the **Summon-Spirit Talisman** (*zhao hun fu*). If they are about to be beheaded, recite the **incantation** (*zhou*) upon seeing them.\n\n**Incantation** (*Zhou*):\n*\"I humbly invoke the transgressor from the North—one *qi* (*zhi yi*).\"*\nRecite this three times, then blow their **spirit-qi** (*hun po*) into the mirror. Wrap the mirror with **white silk** (*bai lian*) and take it to a **pure chamber** (*jing shi*).\n\nThis night, offer **three cups** (*san zhan*) of **fragrant wine** (*xiang wei jiu*) and **delicious food** (*mei shi*) in sacrifice. Place the mirror beside a lamp and recite:\n*\"True spirit (*zhen hun*), luminous and clear, quickly manifest your original form (*ben xing*).*\n*I now sacrifice to you—use the voice that summoned me.*\n*Do not scatter your spirit (*hun po*), but save yourself and return to life (*huan sheng*).\"*\n\nAfter reciting, hold the mirror before the lamp, calling out their **name and surname** (*ming xing*), and present the **sacrificial wine and food** (*jiu ji shi*), along with a **colorfully painted likeness** (*cai hua qi xiang*). In darkness, continue to sacrifice them with **incense and flowers** (*xiang hua gong yang*).\n\nIf you wish to employ them, cut a **paper effigy** (*zhi ren*) seven inches long, summon their name, and have it stand before them. If they respond without hesitation, prepare seven such effigies to animate and command them.\n\nThe **Summon-Spirit Talisman** (*Zhao hun fu*) and **Return-Spirit Talisman** (*Gui hun fu*) will prevent their spirit from scattering, allowing them to be **nine libations** (*jiu yin*)—a ritual offering of nine cups.\n\n「On the first day of the sixth month, collect seven maggots from the mouths of young cranes (*luán cháo*) in their nests, and seven glowworms (*yíng huǒ chóng*). On the third day of the third month, gather fourteen *kēdǒu* (a type of beetle), and dry them in the shade.\n\nCrack open crow eggs (*wū luǎn*), discard the yolks, and retain the clear parts. Seal them before they are fully immersed, and place them under a hen for incubation. The hen will crow when the process is complete.\n\nStore the collected materials in a concealed vessel. When using, take one large soybean and apply saliva (*jīn tuò*) to the top of it. At night, it emits a radiance a hundred feet long, and by day, a purple cloud appears.\n\nIf placed in the fingernails, the nails will glow like arrows when pointed at objects.\n\nFor shooting purposes, mix the medicine with toad blood (*chán xuè*) and apply it to the body. At night, it forms a glowing mass; when placed in the mouth, saliva will also ignite.\n\nPrepare the medicine on *liù jiǎ rì* (the sixth day of the sixth lunar month). If you wish to burn all dwellings and structures, or any specific objects, write the formula with a single *rìyuè* (a unit of weight, roughly 3.75 grams) of the medicine and apply it. By night, it will ignite, leaving no means of salvation.\n\nIf you place a small stone with a bit of the medicine inside a well, fire will arise, yet the well water will remain unharmed.\n\nTo summon the *máo xiàng* (hairy apparition, or spirit form), and manifest white *qì* (vapor/essence):\nWhenever one desires to display a hairy apparition between the eyebrows or generate white vapor from the crown, this is the work of the ancient sages (*xiān shèng*), not something common folk can undertake.\n\nThe medicine used here is also derived from the essence of the sun and moon (*shòu rìyuè zhī jīnghuá*), the refined *qi* (vital energy) of heaven and earth (*tiān dì zhī xiùqì*), and the bait of things (*chéng wù zhī ěr*), capable of transforming and creating.\n\nThus, Master Ghost Valley (*Guǐgǔ xiānshēng*) kept this technique secret, never revealing it.\n\n*Zhēnyáng* (true yang stone): ten *zhǔ* (a unit of weight, roughly 3.75 grams).\n*Yúnmǔ* (cloud mother stone): seven *zhǔ*.\n*Bái yīng* (white eagle stone): four *zhǔ*.\n*Qiān bái shuāng* (lead white frost): one *fēn* (a tenth of a *liǎng*, roughly 0.375 grams).\n*Hǎi fú* (sea float stone): one *qiǎn* (a unit of weight, roughly 3 grams).\n\nAll the above ingredients should be washed with warm wine (*wēn jiǔ*) on a *gēngshēn rì* (a day in the sexagenary cycle bearing the characters 庚 and 申), then ground into powder. On the *xīn rì* (the next day in the cycle), use the white toad (*bái chán é chī*) with eight characters inscribed on its throat, and place its intestines in the center.\n\nAdditionally, take two large *hǎi lí gé* (sea snails, similar to clams), grind them into a paste the size of one *hé* (a unit of volume, roughly 1/10 of a *shāng*, about 10 ml). Seal the paste with honey and place it in spring water, nurturing it for seventy-seven days until the medicine is complete, marked by the white vapor gathering from the spring.\n\nIf the days are insufficient, and there is still water in the seal, take it out, wipe it dry, and use wax to secure and reseal the container. Leave it, and it will naturally complete.\n\nRemove the sea snail and toad, and use only the medicine, storing it in a silver dish without letting any air in.\n\nIf you wish to manifest the hairy apparition, place a grain of the medicine the size of a hemp seed (*má zǐ*), apply saliva to it, and place it between the eyebrows. A white light will appear, and the apparition will shine radiantly.\n\nIf you place a grain the size of a rice kernel in tea or wine, a light will rise from the cup several feet high.\n\nPlaced on the finger and exposed to sunlight, a white glow will emanate from the fingertip.\n\nPlaced on various objects, it will also manifest light.\n\nThis is the *Dēngbō Wèi* (Illuminating Barrier Technique).」\n\nThe following methods are recorded:\n\nFor the **Illuminating Barrier Technique (登波卫)**:\nTake ten black spiders on the fifth day of the fifth month. If the day arrives and they are difficult to obtain, distribute people beforehand to capture them. At dusk on that day, place them in a dry container with two *hè* of pig fat inside; the spiders will consume the fat completely.\n\nOn the seventh day of the seventh month, take seven *shuǐmǎ* (water horses)—those with long legs growing on water—and mix them with the aforementioned insects in a bottle. Bury the mixture in the north, letting it dry in the shade for a hundred days. When the medicine is ready, place it in a bamboo tube. In cases of urgent river crossings, apply a knife-shaped piece of the medicine to the soles of the feet; walking on water will then be as easy as stepping on large stones.\n\nFor **Opening the Gate Technique (启扉卫)**:\nAt midnight on the *jiǎnrì* (established day, i.e., the first day of the month), take wood from a younger brother’s grave, cutting it with the *Yǔbù* (Turtle Step) ritual stance. Facing north, carve it to a length of seven *cùn* and three *fēn*, then conceal it in a five-colored garment. Use it to part one’s hair, then rub the door or lock with it—they will open automatically, including all keys.\n\nAdditionally, on the fifth day of the fifth month, collect the tongue and teeth of a black dog, drying them in the shade. Rub a person’s hands with tiger fat, and at the appointed hour, they may enter a household unseen. Grasping a dog’s tail, the dog will neither bark nor bite; outsiders will be unable to rise, and sleeping people will remain unaware. Do not reveal this to others—this method is to be kept secret.\n\n---\n\n**Shell-Shedding, Manifesting True Form Technique (脱壳现形术):**\n\nFor those practicing this technique, first arrange a seat in a quiet chamber with a large mirror hung before it. Beginning from the *jiǎzǐ* day (first day of the sexagenary cycle), each day face the mirror with a pure mind, maintaining awareness of one’s form in reflection—whether standing, sitting, or lying down—imagining the true self within. In the morning, first take the *Fēnshén Sǎn* (Dividing Spirit Powder), then refine the spirit. For forty-nine days, consistently visualize leaving one’s spirit in the mirror. Inscribe a *Xiànxíng Fú* (Manifesting Form Talisman) on the mirror’s surface, burying it at the main gate seven *chǐ* and seven *cùn* deep in a jar, sealed with a lid.\n\nWhen ready to manifest the form, take a small mirror, inscribe the talisman on its surface, blow onto it once, and suspend it in the room. Moving freely east or west, one’s body will remain in the chamber—sitting, lying, or standing as desired. Retrieving the mirror will cause the reflection to vanish, while others will see only a single body.\n\n**Dividing Spirit Powder (炼壳分神散):**\n- One whole *shétuìpí* (snake shed skin), collected on the fifth day of the fifth month.\n- Seven whole *chánké* (cicada shells), collected on the sixth day of the sixth month.\n- One *liǎng* of *lónggǔ* (dragon bone), collected on the seventh day of the seventh month.\n- One *liǎng* of *báifúpíng* (white poria).\n- One *liǎng* of *fúpíng* (poria).\n- One *liǎng* of *yuǎnzhì* (polygala).\n- One *liǎng* of *rénshēn* (ginseng).\n- One *qiān* of *xūnlùhuā* (aloe).\n- One set of *fúyìxīn* (bat wings), washed with wine and dried.\n\nGrind these into a fine powder. Each dose: one *qiān*. When taking the medicine, do not blow or stir it. After ten days, drowsiness will appear—this is the sign of efficacy. Complete the regimen in forty-nine days without repetition; any remaining powder should be buried with the mirror.\n\n**Manifesting Form Talisman (现形符):**\nInscribe this talisman with cinnabar on the mirror, visualizing oneself within it. Blow *qi* onto the talisman—your image will naturally appear there. When writing this talisman, avoid touching it.\n\nWith unwavering sincerity, refine the form within the mirror. Forty-nine days are required for completion. If not practiced with reverence, success will be difficult.\n\nTo divide the body as described earlier, sit leaning against a wall with the mirror hung low, lie with the talisman horizontally, or stand with it suspended high—always visualizing the self as instructed.\n\n**Changing Appearance (异容):**\nIf one faces sudden, unforeseen disaster and cannot yet complete the techniques, this method allows for rapid transformation to evade a single calamity. Take:\n- One *lìzǐ* (straw hat).\n- One *fēn* of *shāohàodān* (burning number elixir).\n\n**Changing Appearance (异容) – Continued:**\n\n- White horse hoof nails, one, burned to ash.\n- *Sàzi* flower, dried in shade.\n- Old *zhānglù* deer root, two *liǎng*.\n- Bat wings, one pair, burned to ash.\n\nCombine these six ingredients into fine powders. Place half within a green gallbladder, suspending it at the eastern gate for seventy days.\n\nIf urgent, take a kernel-sized portion of the powder, mix with saliva, and apply to the face. The next day, even wife and son will fail to recognize you. Stir the remaining powder with the face toward the east, never sleeping, never stirring it while eating, never blowing on it—your household will not recognize you.\n\n---\n\n**Knowing the Hour of Death (知命丹):**\nIf one cultivates the Dao and practices the Way, one must know when death approaches. This elixir proves its efficacy.\n\nPerhaps seven days before death, the medicine will emerge from the nostrils, revealing divine and sacred essence.\n\n- Cinnabar, one *qián*.\n- Realgar, one *qián*.\n- Frankincense, one *qián*.\n- Green wood fragrance, one *qián*.\n- Styrax, one *qián*.\n- *Fúshén* (possibly *Fúshén* root or *Fúshén* herb), one and a half *qián*.\n- *Yuánzhì* (polygala), one *qián*.\n- *Shíwéi* (possibly *Shíwéi* stone or *Shíwéi* herb), one *qián*.\n- *Bìchéngjié* (possibly *Bìchéngjié* herb), one *qián*.\n- Ginseng, one and a half *qián*.\n- Lotus seeds, seven.\n- *Tàiyī Yǔyúliáng* (possibly *Yǔyúliáng* stone or mineral), one.\n\nGather these twelve ingredients according to local soil conditions, purifying them thoroughly.\n\nOn a *jiǎzǐ* day at the *chén* hour, ensure no chickens, dogs, women, or others witness the process. Face south, remain silent, grind and sift into a powder, and knead with rock honey into a block. Recite the edict of the Three Pure Ones (Sanqing) thirty thousand times, grinding it thirty thousand times, then place it in a southeast well, one *chǐ* above the water.\n\nBy the *wùzǐ* day, form into pills the size of a rooster’s head. On the next *jiǎzǐ* day at the *chén* hour, face east, burn incense, and recite your natal star’s official name three hundred times before swallowing one pill with water. Abstain from the five pungent spices, alcohol, meat, and sexual activity.\n\nSeven days before death, the medicine will emerge from the nostrils, or a person will reveal it in a dream. From the time of ingestion until death, no illness will afflict you—you will ascend seated or standing. Keep this secret.\n\nThis text is the marrow of the world’s profound writings, transcending the mundane from ancient times to now. Those who govern nations and are high sages all find it supremely wondrous, understanding celestial patterns and attaining the ultimate Dao. To obtain this is not mere chance—it is predestined fate. None may casually view it; its blessings are boundless. Those who safeguard it will prosper. Though gold and jade exist, they are not true treasures. True treasures are divine kings, flourishing for ten thousand generations. Keep this secret.\n\n—*Ghost Valley Master’s Heavenly Marrow Sacred Text, Volume Two, Complete.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "鬼谷子天髓灵文 经名：鬼谷子天髓灵文。 撰人不详。 二卷。 底本出处：《正统道藏》洞神部方法类。 鬼谷子天髓灵文卷上 夫水濂洞主鬼谷子，秘密天文大道，测天地之机，晓造化之本。 天生真性，逐嗜欲而迷。 不知生死，难晓幽微之理。 道德阴符，总明大道之机。 照夜内丹，并是圣人之道。 夫在世凡夫，迷惑真性，不达真理，故名异卫乃秘之。 初以传孙子、庞公，如后学之人习吾真法，行之皆得避难、逃生、免死。 凡世忧煎逼迫，免山河水起之厄，免刀剑劫贼之厄，免生魂鬼聚之厄，免狂鬼咒诅之厄，免百万军阵之厄，免水火盗贼之厄。 夫吾秘密天文者，名为六天正诀，又名六神文，又名隐形藏体之术，又名驱神入室之术，又名魂游三界之经，又名水濂幽微之教，又名超脱生死之论。 此吾教法之内，有真诀神符。 第一隐形藏体符，第二驱神入室符，第三魂游三界符，第四超脱生死符，第五火假四大符，第六周天隐边闭形符。 或在世修行之人，收吾正法真经，习吾真教，达吾糟粕者，须是挣心净性，严持香火。 于年通运达，择良辰吉日，善心之时，须是志心，谨具香灯，严持斋戒，朱书神符，默持神咒，四十九日神符即显应矣。 若在世男女，收吾大诀天书者，须是虔诚志心持意。 欲传授者，须用结坛威仪，有三等坛。 上等结坛授持法者，须甩五方罗五段各长四十九尺，玉环四十九对，镜四十九面，正青红同心四十九付，灯四十九盏，钱马食各四十九付。 中等而结坛以授持法者，用五方罗五段一各长三丈六尺，金环三十六对，镜三十六面，正青皂同心三十六付，灯三十六盏，钱马食各三十六分。 下等结坛授持法者，用五方罗五段各长二十四尺，银环二十四对，镜二十四面，正紫皂同心二十四付，灯二十四盏，钱马食各二十四分。 右件三等授持法者，传授金柜藏秘。 如行此法，须是拣择运通年达好日良辰，方可作坛，持法不虚矣。 隐形藏体符 此符用朱砂，志心向北斗礼二十四拜，方执笔望北极，取气吹笔上书符。 服至七七四十九日，身形出入行走，人不见。 百万军阵之中过，将此符用朱砂，书於心一道，两臂各一道，并无妨害，须是志心记之。 驱神入室符 此符行持服至百日，密持咒百日，使六丁神现目前，随意使用由己。 但书符须用朱砂，志心诚意，冥心向北礼二十四拜，方可执笔，收北气吹笔尖上书符。 魂游三界符 此符服至百日，神魂意使是。 如书符用朱砂，礼北极二十四拜，面北取气书符为圣也。 超脱生死符 此符服至百日，生死去住，或假尸可以。 书之依前，书符望北极礼二十四拜，罢想自己身，常思别人尸壳，或少年之人，或清秀之人，亦借之。 火假四大符 此符亦用朱书，冥心望北极礼二十四拜，取北气吹在笔上可书。 服至百日，觉自身口中气并是火焰，身上只如火烧相似，惟见莫怕，任意逐火而去，惟存此符持咒。 吾此符并法，不可怠慢。 依此严洁，清心受持，不得轻泄，戒之。 咒笔 天圆地方，六律九章。 神笔一下，万鬼灭亡。 急急如律令勑摄。 乾元亨利贞，日月与吾真。 神水通入服，不是去通身。 急急如律令勑。 逐日持咒",
      "translated_text": "**Ghost Valley Master’s Celestial Essence and Sacred Texts**\n\n**Title:** *Ghost Valley Master’s Celestial Essence and Sacred Texts*\n**Author Unknown**\n**Two scrolls**\n**Source:** *Zhengtong Daozang* (Orthodox Daoist Canon), *Dongshen* (Cavernous Gods) Section, *Methods* Category\n\n---\n\n**Ghost Valley Master’s Celestial Essence and Sacred Texts – Upper Scroll**\n\nThe watery abyss master, Ghost Valley Child, secretly transmits the grand Dao of celestial patterns, measuring the mechanisms of Heaven and Earth, comprehending the origins of transformation. Heaven bestows true nature, yet it is obscured by cravings and desires. Unaware of life and death, one struggles to grasp the subtle truths. The *Dao* and *De* of *Yinfu* [1] encompass the fundamental principles of the Way. The night-photographing inner elixir is the path of the Sage.\n\nOrdinary mortals, bewildered by true nature, failing to grasp ultimate truth, thus name it *Yiwei* [2]—a hidden secret. Initially, it was passed to Sunzi and Pang Gong [3]. Later disciples, practicing my true methods, all achieved escape from peril, survival, and evasion of death. It liberates one from worldly afflictions—\nfrom the calamities of mountains, rivers, and floods,\nfrom the threats of blades, bandits, and raids,\nfrom the gatherings of vengeful spirits,\nfrom the curses of mad ghosts,\nfrom the perils of a million-man battle,\nfrom the ravages of fire, water, thieves, and robbers.\n\nMy secret celestial arts are named:\n*The Six Heavenly Orthodoxy Formulas*,\n*The Six Divine Scriptures*,\n*The Art of Concealing Form and Hiding Body*,\n*The Technique of Summoning Spirits into the Chamber*,\n*The Scripture of the Soul Wandering the Three Realms*,\n*The Doctrine of the Watery Abyss’s Subtleties*,\n*The Treatise on Transcending Life and Death*.\n\nWithin my teachings lie true formulas and divine talismans:\n1. *The Concealing Form and Hiding Body Talisman*,\n2. *The Summoning Spirits into the Chamber Talisman*,\n3. *The Wandering Soul Through the Three Realms Talisman*,\n4. *The Transcending Life and Death Talisman*,\n5. *The Four Great Fire Substitution Talisman*,\n6. *The Circumpolar Concealment and Sealing of the Boundaries Talisman*.\n\nFor those in the world who practice, receive my orthodox true scriptures, and study my genuine teachings—reaching even the dregs of my doctrine—one must purify the heart, refine the nature, and strictly uphold incense and offerings. At a propitious year, month, day, and auspicious hour, with sincere intent, one must prepare incense and lamps, observe strict fasting, inscribe the divine talismans in cinnabar, silently recite the divine incantations. After forty-nine days, the talismans will manifest their efficacy.\n\nFor men and women in the world who receive my grand formulas and celestial texts, they must hold them with devout sincerity. If one seeks transmission, a ritual platform must be established in three grades.\n\n**Upper-grade platform for transmission:**\nUse five-directional brocade, five segments each forty-nine *zhang* [4] long, forty-nine pairs of jade rings, forty-nine mirrors, forty-nine sets of concentric vermilion and green talismans, forty-nine lamps, and forty-nine sets of money, horses, and provisions.\n\n**Middle-grade platform for transmission:**\nUse five-directional brocade, five segments each thirty-six *zhang* long, thirty-six pairs of gold rings, thirty-six mirrors, thirty-six sets of concentric vermilion and black talismans, thirty-six lamps, and thirty-six sets of money, horses, and provisions.\n\n**Lower-grade platform for transmission:**\nUse five-directional brocade, five segments each twenty-four *zhang* long, twenty-four pairs of silver rings, twenty-four mirrors, twenty-four sets of concentric purple and black talismans, twenty-four lamps, and twenty-four sets of money, horses, and provisions.\n\nThese three grades of transmission conceal the golden casket’s secrets. When practicing, one must select a year of favorable cosmic alignment, a good day, and an auspicious hour—only then may the platform be erected, and the transmission will not be in vain.\n\n---\n**The Concealing Form and Hiding Body Talisman**\nThis talisman is inscribed with cinnabar. With resolute intent, bow twenty-four times toward the Northern Dipper, then grasp the brush, facing the North Pole, drawing breath to blow upon the brush before inscribing the talisman.\n\nAfter forty-nine days of ingestion, one’s form may move unseen. Even amid a million-man battle, inscribe this talisman with cinnabar on the heart (center of the chest), one line on each forearm—it will cause no hindrance, provided one remembers it with sincerity.\n\n---\n**The Summoning Spirits into the Chamber Talisman**\nThis talisman, when practiced and ingested for a hundred days, and the incantation secretly held for a hundred days, will cause the Six Ding Gods [5] to appear before you, to be used at will.\n\nWhen inscribing, use cinnabar, with sincere intent and hidden heart, bow twenty-four times toward the North, then grasp the brush, drawing in the northern *qi* to blow upon the brush’s tip before inscribing.\n\n---\n**The Wandering Soul Through the Three Realms Talisman**\nThis talisman, when ingested for a hundred days, allows the soul and spirit to be directed at will.\n\nWhen inscribing, use cinnabar, bow twenty-four times toward the North Pole, facing north, drawing breath to inscribe the talisman—this is sacred.\n\n---\n**The Transcending Life and Death Talisman**\nThis talisman, when ingested for a hundred days, allows one to depart from life and death, or to assume a corpse’s form.\n\nInscribe as before: bow twenty-four times toward the North Pole, then cease contemplating one’s own body, constantly imagining another’s corpse—whether that of a youth or a refined person—borrowing their form as well.\n\n---\n**The Four Great Fire Substitution Talisman**\nThis talisman is also inscribed in cinnabar. With hidden heart, bow twenty-four times toward the North Pole, drawing in the northern *qi* to blow upon the brush before inscribing.\n\nAfter a hundred days of ingestion, one will perceive fire-like *qi* in the mouth, and the body will appear as if burned by flames—yet fear not, follow the fire at will, while holding the talisman and reciting the incantation.\n\n---\n**My talismans and methods must not be treated lightly.**\nAdhere strictly to purity, hold them with a clear heart, and do not reveal them lightly—be warned.\n\n---\n**Incantation for the Brush**\n*The Heaven is round, the Earth is square; the Six Pitches and Nine Numbers are complete.*\n*A single stroke of the divine brush—ten thousand ghosts perish.*\n*Urgent, as the decree commands.*\n\n*The Primordial Qi is benevolent, prosperous, and perfect; the sun and moon align with my truth.*\n*The divine water enters and is ingested—it does not pass through the body.*\n*Urgent, as the decree commands.*\n\n*Daily, hold the incantation.*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1237,
      "start_sentence": 0,
      "end_sentence": 51,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 15.826719522476196,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\鬼谷子天髓灵文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "太上老君，太上道君，元始天尊，长生保命天尊，八卦护身天尊，延寿益等天尊，法身藏化元君，脑神精根泥丸君，眼神明上应元君，鼻神主龙气君，齿神罗清元君，耳神天空闭宫君，舌神正伦君，重楼十二大真君，脾神近命君，胆神虚空君，肾神玄武敬君，肠神树魂魂灵，左青龙神，右白虎神，前朱雀神，后玄武神，六丁六甲神，精藏下元神君，胎光幽精爽灵神，界除守护三尸神彭质、彭琚、彭矫，各住其位，就得长生。 吾奉太上老君急急如律令勑摄。 咒每日志心，於日晨朝时，向圣前密持一百八遍。 持至四十九日，自觉己身空中，如浮云相似，不得惊怪，法欲成也。 如此后，要逐日持念，大有神验秘之秘之。 志心用天之诀，行用血气之功。 夫血气者，穿九宫，度八卦。 运真气一十五度，先舌柱上腭，定息一十五度，下有津。 叩齿一十五度，漱液烹津，度满做五度咽之。 此行血气之功，行罢觉己身万窍中汗自出，此是验也。 微觉顶内有箫韶之声，行九还七返之功成。 七返者，是心头问而恰震之相。 火轮送顶，左右五日，进火一度三分，日为满周而复始，返本还源记之。 行闭形隐迩之功式，天清地宁，六尘不起，心气散乱，想心火送在宫，转一百八遭，光转五十四遭。 若是次气本胸气来，觉时心头恰似清风相似，心头闷不多时。 太阳金丹隐迩之法，延年一百二十岁形寿，秘之秘之。 《水濂洞鬼谷子秘诀天文玉虚集三洞天心玉虚大帝三茅真君妙宝梵心感应真经》上书：因师知得长生诀，行火知时节。 先认取婴儿姹女，后炼得黄芽白雪。 捉得擒来，收入炉中，更捞出水中九盏照佛灯光。 如不减，炼成气，人难别，须知道无寒、无热、无日、无月、无时。 更把炉中养就一神胎，又不是父精母血。 得斩一断三尸六贼，便就金丹。 向外人休说。 《水濂洞主鬼谷子秘密诀天文玉虚集三洞天心玉虚大帝三茅真君妙宝梵心感集真经》上 夫人禀天地而生，不知五行造化因道而生。 盖世人迷情不舍，贪淫欲而身亡，为财色而遭患。 或修善之人，未得善应。 或遭恶业，未逢恶果。 持斋戒争，如有物外超凡境。 或学摄养，岂闻隐迩分明散影之术，今乃编感应之术也。 七曜符炼共成九章，以传於世，度脱众生。 若在世男女等众，修持此符者，须是神性清净，各按禁忌，方可斋戒修持此法，至日灵应，常於眼前见矣。 所有在世男女，收吾此法，须是斋戒受持，诵咒语无不应之。 此书是三清宫内秘密之法中再的，其符录以济於世，各度群生，以证其妙诀。 普劝受持，众等各保护此文。 秘密之书，不可轻示非人。 戒慎其符法睨，并斋戒禁忌科，编於卷中，日之真假。 避体藏形隐迩分明去住散影之法，谨传於世，不可轻泄秘之。 戒忌荤膻 三元，五腊，四时，八节，三七，三八，十五，生日，本命日，甲子，庚申，壬申。 右戒持法之人，不可食荤膻。 如食，此法不灵矣。 戒色欲 三元，五腊，四时，八节，三七，三八，十五，生日，本命日，庚申，甲子，壬戌，大风，大雨，大雪，大寒，大阴，大星落，大喜，大怒，饥饱之日。 右件行法之人，不可不记之。 如犯，此法不灵矣。",
      "translated_text": "**Invocations and Methods of the Highest Dao**\n\n**Supreme Venerable Lord Lao, Supreme Dao Lord, Primordial Heavenly Venerable of the Beginning, Lord of Eternal Life and Preservation of Life, Lord of the Eight Trigrams Protecting the Body, Lord of Extended Longevity and Equal Venerables, Lord of the Hidden Form and Transformation, Primordial Lord of the Brain Spirit and Essence Root, Lord of the Eye Spirit and Upper Correspondence, Lord of the Nose Spirit and Dragon Qi, Lord of the Tooth Spirit and the Pure Roar, Lord of the Ear Spirit and the Closed Palace of Heaven, Lord of the Tongue Spirit and Rectitude, Twelve Great True Lords of the Heavy Tower, Lord of the Spleen Spirit and Near-Life, Lord of the Gallbladder Spirit and Empty Space, Lord of the Kidney Spirit and Reverent Dark Warrior, Lord of the Intestinal Spirit and Tree-Soul, Left Azure Dragon Spirit, Right White Tiger Spirit, Front Vermilion Bird Spirit, Rear Dark Warrior Spirit, Six Ding and Six Jia Spirits, Lord of the Essence-Housed Lower Primordial Spirit, Lord of the Fetal Light and Refined Essence, Spirit of the Three Corpses—Pengzhi, Pengju, and Pengyao—each dwelling in their place, thus attaining eternal life.**\n\nI, in reverence to the Supreme Venerable Lord Lao, **urgent, as the decree commands.**\n\n**Incantation for the Mind**\nEach day, focus the mind. At dawn, facing the sacred altar, secretly recite **one hundred and eight times**.\n\nWhen forty-nine days have passed, you will sense your body floating in the air like clouds—do not be alarmed, for the method is taking effect.\n\nAfterward, continue daily recitation with great efficacy and secrecy.\n\nFocus the mind with the **Heavenly Key**, practice the **Blood-Qi Method**.\n\nNow, the **blood-qi** pierces the Nine Palaces, traverses the Eight Trigrams.\nCirculate the **True Qi fifteen degrees**, first pressing the tongue against the upper palate, steadying the breath fifteen degrees, where saliva gathers below.\nKnock the teeth fifteen times, rinse the saliva, and swallow it five times when full.\n\nThis is the **Blood-Qi Method**. Upon completion, you will feel sweat emerge from every orifice—this is the verification.\nSubtly perceive the sound of *xiao* and *shao* within the crown.\nPractice the **Nine Returns and Seven Circulations** to attain completion.\n\nThe **Seven Circulations** are the resonance of the heart’s question and the shock of response.\nSend the **Fire Wheel to the crown**, left and right for five days, advancing the fire by three parts daily until completion, then return to the source and record it.\n\nPractice the **Hidden and Nearby Body-Closing Method**:\nWhen Heaven is clear and Earth tranquil, the Six Dusts do not arise.\nWhen the heart-qi scatters, send the thought-fire into the palace, turning **one hundred and eight times**, the light turning **fifty-four times**.\n\nIf the breath originates from the chest, you will feel a breeze-like sensation in the heart—briefly stifling.\n\n**The Hidden and Nearby Method of the Great Sun Golden Elixir** extends lifespan to **one hundred and twenty years of physical life**—this is the utmost secret.\n\n---\n**From the *Water Lian Cave Ghost Valley Master’s Secret Key, Celestial Text of the Three Caverns, Heart of the Jade Void Emperor, Three Teachings True Lord’s Marvelous Treasure, and the True Scripture of the Responsive Dharma-Mind***\n\nBecause the teacher knows the **Key to Eternal Life**, one must know the timing of the fire.\nFirst, recognize the **infant girl with the crimson bloom**, then refine the **yellow bud and white snow**.\nCapture and seize her, place her in the furnace, then scoop her out into nine cups of water, illuminating the Buddha’s light.\nIf not diminished, refine into **qi**—human perception cannot distinguish it.\nKnow that it has **no cold, no heat, no sun, no moon, no time**.\n\nFurther, nurture a **divine embryo** within the furnace—it is neither father’s essence nor mother’s blood.\nWhen the **Three Corpses and Six Bandits are severed**, the Golden Elixir is attained.\n**Do not speak of this to outsiders.**\n\n---\n**From the *Water Lian Cave Master’s Secret Key, Celestial Text of the Three Caverns, Heart of the Jade Void Emperor, Three Teachings True Lord’s Marvelous Treasure, and the True Scripture of the Responsive Dharma-Mind***\n\nMankind is born of Heaven and Earth, yet unaware of the **Five Phases and Transformations of Dao**.\nThose lost in desire perish from lust, suffer for wealth and beauty.\nSome who do good deeds do not receive blessings; some who commit evil do not face retribution.\nThose who fast and observe precepts may glimpse a realm beyond form.\nOr those who practice **nourishment and cultivation**—how could they not hear of the **Hidden and Nearby Method of Clear Distinction and Dispersed Shadows**?\n\nNow, I compile the **Responsive Method**, refining the **Seven Celestial Symbols into Nine Chapters**, to transmit to the world and liberate all beings.\n\nIf men and women in the world practice this method, they must possess a **pure divine nature**, observe the prohibitions, and only then may they fast and cultivate. On the sacred day, the response will manifest before your eyes.\n\nAll men and women in the world who receive this method must **fast and recite the incantation**—it will never fail.\n\nThis text is a **second-level secret from the Three Pure Ones’ Palace**, its talismans recorded to benefit the world and liberate all beings, verifying its marvelous key.\n\nI universally urge all to receive and protect this text.\n**This is a secret book—do not lightly reveal it to others.**\n\nBeware of the **talisman’s authenticity**, the **fasting and prohibitions**, and the **science of avoidance**—all recorded in this volume.\n**Hidden and Nearby Methods of Body Concealment and Dispersed Shadows** are transmitted to the world—**do not lightly disclose the secret.**\n\n**Prohibitions for Practitioners:**\n- **Avoid meat and strong-smelling foods** during the **Three Elements, Five Sacrificial Periods, Four Seasons, Eight Nodes, Three Sevens, Three Eights, the Fifteenth Day, Birthdays, Natal Days, Jiazi, Gengshen, and Renxu**.\n  If violated, the method loses efficacy.\n\n- **Avoid sexual desire** during the **Three Elements, Five Sacrificial Periods, Four Seasons, Eight Nodes, Three Sevens, Three Eights, the Fifteenth Day, Birthdays, Natal Days, Gengshen, Jiazi, Renxu, days of great wind, great rain, great snow, great cold, great darkness, falling stars, great joy, great anger, hunger, or satiety**.\n  **Practitioners must remember this.**\n  If violated, the method loses efficacy.",
      "overlap_context": "t reveal them lightly—be warned.\n\n---\n**Incantation for the Brush**\n*The Heaven is round, the Earth is square; the Six Pitches and Nine Numbers are complete.*\n*A single stroke of the divine brush—ten thousand ghosts perish.*\n*Urgent, as the decree commands.*\n\n*The Primordial Qi is benevolent, prosperous, and perfect; the sun and moon align with my truth.*\n*The divine water enters and is ingested—it does not pass through the body.*\n*Urgent, as the decree commands.*\n\n*Daily, hold the incantation.*",
      "start_char": 1237,
      "end_char": 2456,
      "start_sentence": 52,
      "end_sentence": 97,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 15.548821926116943,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\鬼谷子天髓灵文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "戒食味 牛肉，狗肉，黑鱼肉，鳌肉，五辛，薤，蒜，葱，胡荽韭，辛，酸，苦，咸。 右件此物，如行法之人食之，伤神役性，有触此法，不一慎之。 水假符 右符朱书，用流水服之。 至日望北斗，取气念咒书符。 服之四十九日，过河不用船。 服至百日，如见水入去，恰似宅舍中，不湿衣服。 至千日，逢水度化。 不可轻泄。 金假符 右符朱书，用水银末。 用为符丸弹子，以朱砂水书吞之。 此符服至四十九日，夜梦剑戟林中行，是魂。 服百日，见剑芒，使度化持咒符。 见一切铁器，化真形人其中，方假其体。 此符书时，望北斗取气，持咒吹在笔上书符，秘之。 火假符 右符朱书，用水银化叶符，为九#1子，亦用南流水吞之。 服至百日，似借火做刑，更用自己身边真太阳火相应。 自己火者，取二手相擦至百日，自己身火成方假凡火此法。 昔日，轩辕黄帝以持此法，跨火龙以朝三界。 此取太阳气，吹在笔上书篆之。 木假符 右符用檀香心，煎汤吞之，更用自己身持。 用雷惊枣木作一神枕，枕头作时，须用方圆七寸二分，高二寸五分。 晓时，但存想形体似在枕中，方假服符。 咒持四十九日，神枕化为自己身，形质相似。 更持百日，断断法成，志心不退。 千日，神枕大出游方，惟留下神枕在房内，便是自己身体。 若在家中，有人葬埋去。 如自己身欲来时，人尽惊怪，都言道，死去如何在来？ 至时，犹人说似破开坟，惟见棺内只是一神枕。 此法，乃是替身自己死一回去。 如是其时，别造一枕，延年十二月。 此符望东方，日未出时，取气吹在笔上，卓十二下，然后书符记之。 土假符 右符用朱书，神土半钱，用茯苓末多许，为丸符如弹子相似。 服此符至百日，身如风云相似，上坡下涧。 如神符左右诀，如人习持此法，在世修行，心谈生死。 如要离世幻度人时，怕去火庵中宿卧，每将镜壁上照面，想己身形影收，用墨书放庵壁。 但凡至百日，自家修行者，以无别人到处房内，不令妇人鸡犬见之，犯法不可见此符，望四方取气，吹在笔上，方可书符。 书篆符箓持点光咒曰：上有东流点光，香水入服万邪藏，三二但，左有青龙白虎右防。 祝笔咒曰：笔为利刀，朱为百药，神符到处，万邪消亡。 急急如律令勑摄。 三洞天心玉灵大帝君毕上卿真人秘诀 夫天髓阴阳为本性，有善有恶，有贤有愚。 修善者天神佑护，修恶者即有恶报，横遭其事。 盖如上古轩辕黄帝，下有一切群仙，无有不习吾法，救度群生，普降诸仙。 夫隐闭藏形天术，约有数端文字，皆是通仙之径路，入大道之玄门。 此书少许文字，盖自古达道真君，皆口口相传，不记文字。 此书是紫微洞主处收藏，自后传度与魏夫人，收授谢自然，授与张使。 张使收书，满宅中符书，授至三年之间。 忽有一日午书来，张使骞闻笙歌之声，果然有天神先来报所诏，满宅白日上升。 如此之日，张使藏作於终南山，隐之仪文。 若或有修行达道之人，得遇吾真诀，非关今世，盖为宿缘有道之心，方获见吾文字。 如世人收吾秘诀者，须用公勤行，专百日之功，护其果，无不神验矣。 当时毕上卿真人，留传此经，度脱众生，欲离苦海，是作津梁证无上之仙人。 若一切人，须是志心行持，百日之功，无不灵矣，无不应矣。",
      "translated_text": "**Prohibitions on Flavorful Foods**\nAvoid the following: beef, dog meat, black fish meat, turtle meat, the **Five Pungents**—*xiè* (scallions), garlic, onions, coriander, and chives—as well as pungent, sour, bitter, and salty tastes.\nIf a practitioner consumes these, they will **injure the spirit and exhaust vitality**, risking failure of the method. **Take extreme caution.**\n\n---\n\n**Water False-Symbol (Jiafu)**\nWrite this symbol in cinnabar ink and swallow it with flowing water.\nOn the **Day of Full Moon**, face **Beidou (the Big Dipper)** and absorb its *qi* while reciting the incantation and inscribing the symbol.\nAfter **forty-nine days** of ingestion, crossing water requires no boat.\nAt **one hundred days**, if water enters and fills the space like a house without wetting clothes.\nAt **one thousand days**, one may traverse water and transform.\n**Do not reveal this lightly.**\n\n---\n\n**Metal False-Symbol (Jin Jiafu)**\nWrite this symbol in cinnabar ink and mix it with powdered mercury.\nForm it into pills or pellets, then swallow with cinnabar water.\nAfter **forty-nine days** of ingestion, one dreams of walking among swords and spears—this is the **soul’s departure**.\nAt **one hundred days**, one sees sword-blades; the practitioner must hold the incantation and symbol to transform.\nIf encountering any iron object, one’s true form appears within it, assuming its guise.\nWhen inscribing this symbol, face **Beidou**, absorb its *qi*, and blow the incantation onto the brush before writing. **Keep it secret.**\n\n---\n\n**Fire False-Symbol (Huǒ Jiafu)**\nWrite this symbol in cinnabar ink on mercury-leaf paper, forming **nine #1** (likely *wǔ* 吴, \"five\" or *yī* 乙, \"second heavenly stem\") and swallow with **south-flowing water**.\nAt **one hundred days**, it appears as if borrowing fire for punishment, yet one’s own **true solar fire** responds.\nThe **self-born fire** is generated by rubbing both hands together for **one hundred days**, transforming ordinary fire into this method’s fire.\nIn ancient times, **Yellow Emperor** used this method to ride the **Fire Dragon** and pay homage to the **Three Realms**.\nThis draws **Taiyang’s (Sun’s) *qi***, blown onto the brush before inscribing the seal.\n\n---\n\n**Wood False-Symbol (Mù Jiafu)**\nUse **sandalwood heartwood**, decocted into a drink and swallowed, while holding the symbol to one’s body.\nCraft a **divine pillow** by startling a jujube tree with thunder, measuring **seven inches two fen** in width and height, **two inches five fen** in thickness.\nAt dawn, visualize one’s form as if within the pillow before ingesting the symbol.\nAfter **forty-nine days** of reciting the incantation, the divine pillow becomes one’s body, identical in form and substance.\nAt **one hundred days**, the method is unbreakable; resolve must not falter.\nAt **one thousand days**, the divine pillow departs on a grand journey, leaving only the pillow in the room as one’s body.\nIf buried while away, others will exclaim, *\"How can the dead return?\"*\nAt such times, it appears as if the tomb was broken open, revealing only the divine pillow inside.\nThis method allows one to **die temporarily**—another pillow must be crafted for **twelve more months**.\nInscribe this symbol facing **east before sunrise**, blowing *qi* twelve times onto the brush before writing.\n\n---\n\n**Earth False-Symbol (Tǔ Jiafu)**\nWrite this symbol in cinnabar ink, mixing it with **divine soil (shéntǔ)** and **half a *qián* of reishi powder**, forming pills resembling pellets.\nAfter **one hundred days** of ingestion, one’s body moves like wind and clouds, ascending slopes and descending ravines.\nIf practicing the **divine symbol’s left and right techniques**, one may discuss life and death in this world.\nWhen preparing to depart and transform others, avoid staying in **fire temples (huǒ’ān)**; always observe one’s reflection in a mirror, imagining the form and shadow absorbed, then inscribe it on the temple wall with ink.\nFor practitioners at **one hundred days**, ensure no one enters the room—**no women, chickens, or dogs may see this symbol**.\nFace the **four directions**, absorb their *qi*, and blow onto the brush before inscribing.\nRecite the **Pointing-Light Incantation** while holding the symbol:\n*\"Above, the East-flowing Pointing-Light;\nAromatic water enters, concealing ten thousand evils.\nThree-two but—\nLeft, the Green Dragon; right, the White Tiger guard.\"*\n**Brush Incantation**:\n*\"The brush as a sharp blade,\nCinnabar as a hundred medicines—\nWhere the divine symbol arrives, ten thousand evils vanish.\nUrgent! As the Law commands—**expedite and subdue!**\"*\n\n---\n**Secrets of the Three Caverns: Jade Spirit Great Emperor of the Celestial Heart**\n**Graduated True Person’s Secret Precepts**\n\nHeavenly marrow is the foundation of **Yin-Yang’s innate nature**—some are virtuous, some evil; some wise, some foolish.\nThose who cultivate virtue are protected by heavenly spirits, while those who cultivate evil meet retribution, suffering misfortune.\nAs in ancient times, **Yellow Emperor** and all celestial beings below practiced this method to **save and transform living beings**, bestowing blessings from all the immortals.\n\nThe **hidden arts of concealing one’s form** have several methods, all paths to transcendence and gates to the **Great Dao**.\nThese texts were once transmitted orally by ancient **Dao/Way-masters**, never recorded.\nThis book was kept by the **Purple Micro Cavern Master**, later passed to **Wei FuRen**, then to **Xie ZiRan**, and finally to **Zhang Shi**.\nZhang Shi collected the texts, filling his home with symbols for three years.\nOne day, a messenger arrived midday with music—heavenly spirits had come to announce the decree, and the entire household ascended in broad daylight.\nOn that day, Zhang Shi hid the texts in **Zhongnan Mountain**, concealing them in **Yiwen**.\nOnly those with **host-fated Dao-heart** in this lifetime may encounter these precepts.\nIf worldly beings obtain this secret, they must **diligently practice for one hundred days**, safeguarding the fruit—**it will surely manifest divine efficacy**.\n\nAt that time, **Graduated True Person Bi Shangqing** transmitted this scripture to **liberate beings from suffering**, acting as the **bridge to supreme immortality**.\nAll who **resolutely practice for one hundred days** will see **unfailing results and responses**.",
      "overlap_context": "atal Days, Jiazi, Gengshen, and Renxu**.\n  If violated, the method loses efficacy.\n\n- **Avoid sexual desire** during the **Three Elements, Five Sacrificial Periods, Four Seasons, Eight Nodes, Three Sevens, Three Eights, the Fifteenth Day, Birthdays, Natal Days, Gengshen, Jiazi, Renxu, days of great wind, great rain, great snow, great cold, great darkness, falling stars, great joy, great anger, hunger, or satiety**.\n  **Practitioners must remember this.**\n  If violated, the method loses efficacy.",
      "start_char": 2457,
      "end_char": 3726,
      "start_sentence": 98,
      "end_sentence": 156,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 16.902338981628418,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\鬼谷子天髓灵文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "其吾法号，名为九曜耀都秘密经文，隐神符九道，不可轻示他人。 其经三十年方可传授一人或二人，不得轻传非徒之辈。 苟学之人，不容易契之，当折堕传之人，永堕地狱，不得出离九祖，落入无间地狱受苦，无乃万劫不逢真经文字。 如在世之人收吾书者，志心受持。 如人收经不与人者，折堕藏经之人。 记之记之。 若在世人之修行此经者，功成行满，迁名於紫府，位列真仙。 如在家修行，不得教妇人鸡犬见之，恐遭折堕，其法不成。 只有世间人闭行藏影，或为官军行有逼迫，有劫贼刀兵。 或被妖精相缠，或有贤宾，或为扶危济难，种种方便。 或救患人，亦可得功成行满。 伏待殷懃，入仙官职位，加其功德，不可细说。 如有轻视，罪无边际。 此文秘密藏之。 书符咒曰：天圆地方，九二天章。 神笔下处，喷云摄傍。 吾奉北极紫微帝君，急急如律令勑。 逐日行持六戊神咒曰：日出东方，赫赫火光。 六戊神符，急驾云章。 乘云下降，斩邪除殃。 天神助我，万鬼消忘。 吾奉北极紫微帝君，急急如律令勑。 驱六甲神跨南方赤马符 将此符用朱书，早取井花水，於庚申日早晨，取太阳未出时，依前持咒书符。 此法昔日有真人服，至三百日，跨赤马，引六甲天神，真至金阶殿下。 是时汉武帝亦见，大惊，遂请先生饮酒，先生才大饮酒，西北上有火起，先生噀酒一口救火。 因此，武帝请先生住，先生不肯住，跨赤马去，便不见了。 如在世欲授持法者，须要志心，功成行满，三年之内，此法应之。 去住分明散影符 符依前修持咒书，符服至百日，自己镜内常照，相形驱咒罢，将身涌便入，时人不见，或得满宅上升，秘之。 点勘生死运命符 此符依前篆，感天师差仙童，梦中急报应来。 此法昔日王乔每行法，时人不依，后至死心众人方丧其心，真修行，倾城都传持此法，大有神验也。 引神离壳符 此符书服至四十九日，或百日，须是逐日将自己身形壳诸物处挂染，逐物而行其形，离体到照，此法甚妙，百日功成就。 投胎换舍符 此符依前书，服至百日或三百日，欲嫌自身丑陋衰老者，将亲身自见者死尸年六十。 亡已来，男女身体，私是与件作，行人些小利养，但教留尸体埋了。 自家去房作法持毕，将身打一，拥相新死尸，去不多时，新舍觉便，将些小糯米粥下神魂，惺惺定省，自来家内尸前照顾，休教人知，便同来葬埋了。 若欲再用之，无不应也。 此法习时，惟忌妇人见之，秘之秘之。",
      "translated_text": "The name of my Dao is called the *Nine Luminaries Radiant Capital Secret Scripture*, concealing nine divine symbols that must not be lightly shown to others.\n\nThis scripture may be transmitted to only one or two persons after thirty years—do not lightly pass it to unworthy disciples. Those who study it will not easily grasp its essence. If one betrays and transmits it, they will forever fall into hell, unable to escape the Nine Realms, descending into the Avīci Hell to suffer endlessly, never again encountering the true scripture in ten thousand kalpas.\n\nIf worldly beings receive and uphold this text with resolve, they must do so in secrecy. If one who possesses the scripture does not share it, they will likewise fall for concealing it. Remember, remember.\n\nIf worldly beings practice this scripture and fulfill its precepts, their names will be recorded in the *Zifu* [Purple Bureaucracy], and they will rank among the True Immortals. If practiced at home, they must not let women or animals witness it, lest they fall and fail. Only those who conceal their practice, hide their form, or face persecution—whether by bandits, weapons, or malevolent spirits—those who aid the distressed or perform acts of mercy in myriad ways may achieve fulfillment.\n\nAwaiting earnest devotion, they shall enter the ranks of the Celestial Officials, their merit beyond measure—words cannot fully describe it. To scorn this is to invite boundless sin.\n\nThis text is kept in strict secrecy.\n\n**The inscribed talisman reads:**\n*\"Heaven round, Earth square—Nine-Two Celestial Chapter.*\n*The divine pen descends; clouds billow, spirits obey.*\n*I, in service to the Sovereign of the Northern Pole, Purple Microstar Emperor, decree with urgency as the law commands.\"*\n\n**The daily invocation of the Six Wu Divine Spell:**\n*\"As the sun rises in the east, blazing with fire’s might,*\n*The Six Wu talisman ascends on clouded script.*\n*Riding the clouds, descending to strike down evil,*\n*To banish calamity and dispel malevolence.*\n*The Heavenly Gods aid me—ten thousand demons vanish.*\n*I, in service to the Sovereign of the Northern Pole, Purple Microstar Emperor, decree with urgency as the law commands.\"*\n\n**Talisman to Summon the Six Jia Gods Riding the Vermilion Steed:**\n*Write this talisman in cinnabar ink, using water drawn from a well at dawn on a *Gengshen* day, before the sun rises. Hold the spell and chant as before.*\n\nThis method was once practiced by a True Person, who after three hundred days mounted the Vermilion Steed, invoking the Six Jia Heavenly Gods, and arrived at the Golden Staircase Hall. At that time, Emperor Wu of Han also witnessed it, astonished, and invited the master to drink. The master drank deeply, and suddenly, a fire erupted in the northwest. The master spat out wine to extinguish it. The Emperor then begged the master to stay, but the master refused, mounted the Vermilion Steed, and vanished.\n\nIf one in the world seeks to uphold this method, they must do so with resolve. If the precepts are fulfilled within three years, the method will respond.\n\n**Talisman for Clear Departure and Dispersal of Shadows:**\n*Follow the previous method of chanting and inscribing the talisman. After a hundred days of service, gaze at oneself in a mirror daily, driving away the form with incantations. Then, merge the body into the mirror’s reflection—no one will see you, or you may ascend to the rooftop of your home. Keep this secret.*\n\n**Talisman to Scrutinize Life, Death, and Destiny:**\n*Inscribe this talisman as before, invoking the Celestial Master to dispatch a celestial youth in dreams, who will urgently report its effects.*\n\nThis method was once practiced by Wang Qiao. Though many did not follow him in life, after his death, those who turned to true practice spread it across the city, and its divine efficacy became renowned.\n\n**Talisman to Summon the Spirit and Leave the Shell:**\n*After forty-nine days or a hundred days of inscribing and serving this talisman, hang one’s form and shell in various places, moving through objects to manifest the body’s shadow. This method is wondrous—fulfillment comes at a hundred days.*\n\n**Talisman for Rebirth and Exchange of Dwellings:**\n*Inscribe as before. After a hundred or three hundred days of service, if one despises their own aging or ugly form, they may take the corpse of a recently deceased person—sixty years old—whom they have personally seen. After the corpse is buried, provide small offerings to the deceased’s kin, ensuring the body is interred. Then, return to the home, perform the ritual, and strike yourself once. Embrace the newly deceased corpse. Shortly after, the spirit in the new body will awaken. Feed it a small portion of glutinous rice porridge, and it will recognize you. Return to the corpse’s burial site to tend to it secretly, ensuring no one knows. Then, bury it as before. If one wishes to reuse this method, it will surely respond.*\n\n**Caution:** During practice, one must absolutely avoid women witnessing it. Keep this utterly secret.",
      "overlap_context": "*host-fated Dao-heart** in this lifetime may encounter these precepts.\nIf worldly beings obtain this secret, they must **diligently practice for one hundred days**, safeguarding the fruit—**it will surely manifest divine efficacy**.\n\nAt that time, **Graduated True Person Bi Shangqing** transmitted this scripture to **liberate beings from suffering**, acting as the **bridge to supreme immortality**.\nAll who **resolutely practice for one hundred days** will see **unfailing results and responses**.",
      "start_char": 3726,
      "end_char": 4685,
      "start_sentence": 157,
      "end_sentence": 197,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 14.05174469947815,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\鬼谷子天髓灵文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "驱三尸离体符 此符依前书，服至百日，三尸离身自驱，不使人心惑乱作为。 既除了三尸，证仙位，长生之道也。 持符神剑获雠符 此符依前书，符欲授持一道，香炉上咒罢，烧作灰，用净水吞之四十九日。 此道约年功德，后逢此冤雠魂魅、一切雠冤之人，并用此符。 香炉上度之，一道咒罢，依前咒更想雠恨之人处，逢意便获。 令先学持法人者忽然，不教人见秘密之法，不可称扬。 秘之秘之。 驱六戊神将喷云符 夫书此符前，别有咒持课。 篆符，须拣择命年通日辰。 用帐幙了自己寝房，不令教妻女同亲人相见，恐触破了法，不可教见。 凡夫持前法者，须帐幙了净房，用灯六十盏，钱马六副，食六分。 如此安排了，拣择庚申、甲子日作法授持，记之高上玉虚帝君、毕上卿真人，秘之。 右鬼镜 凡有人欲吞符服水，七日前，用黄钱七贴，素马七个，先去阁室中供养。 七日后，用时须择庚申日或满日，日未出时，去，面东礼拜了，烧钱马等，便符服水上飘只一处，随水吃了。 夫习调神符一道，元三界六甲灵飞之法，能知吉凶，厌长生不老，先知祸福之由。 求祭福神应灵之法，日是我父，月是我母，五星是我兄，太乙是我朋友。 奉请东门崔判官，北门许判官，西门李判官，南门郑判官，善恶二部童子，大力鬼王，牛头狱卒，小力鬼王，来降道场，为吾助法力。 奉请星辰运、日月交天甲王，来降道场，为吾助法力。 奉请知地下附尸、宝物隐九京地甲神王，来降道场，为吾助法力。 奉请知奴婢走失、逃亡人甲神王，来降道场，为吾助法力。 奉请知灾星、邪祟、鬼魅扰人甲神王，来降道场，为吾助法力。 奉请患眼可交、解鬼神之语通目神王，来降道场，为吾助法力。 奉请谒藏身形隐伏神王，来降道场，吾助法力。 奉请能知降伏驱道、善使十二通神王，来降道场，为吾助法力。 奉请六丙、六乙、六丁、六甲神王，为吾助法力。 奉请六十甲子王，来降道场，为吾助法力。 奉请年直、月直、日直、时直六丁六甲神王，来降道场，为吾助法力。 奉请东方青帝青龙符神王，气入吾身，来降道场，为吾助法力。 奉请南方赤帝是朱雀符神王，气入吾身，来降道场，为吾助法力。 奉请西方白帝白虎当降神王，气入吾身，来降道场，为吾助法力。 奉请北方黑帝是玄武当降神王，气入吾身，来降道场，为吾助法力。 奉请中央黄帝勾陈腾蛇当降神王，气入吾身，来降道场，为吾助法力。 求祭福神应灵之法 迷咒 咒星星落，咒日日沉，咒山山崩，咒地地裂，咒水水绝，咒火火灭，咒病病除，咒人人安，咒死死生，咒铁铁刚。 天甲符 夫天甲符者，本师要知天上星辰陨、日月交蚀、移年中旱泌，得五谷相宜，四时祭鳌。 符化孩儿声，傍边心报问劫，念咒文遗去。 说在前，符在后。 地甲符 夫地甲符者，本师要知地下伏尸、盘泉、地宝、神物、瘗藏暗昧难寻者，当祭此符，即知地下深浅。 此符化作小童子，有物即现身，觅了些物，孩不度形。 至北斗星下，全念咒祭之即现也。 人甲符 夫人甲符者，或有人家奴婢走失逃亡，或走还不知去处。 本师要知去处，即祭人甲符，化作童子前向，心言吾知姓名去处，远近州军四方，各报明矣。 鬼甲符",
      "translated_text": "**Driving the Three Corpses Away from the Body Talisman**\nThis talisman follows the previous method. After taking it for a hundred days, the Three Corpses will depart the body on their own, preventing confusion and disorder of the human mind. Once the Three Corpses are expelled, one attains the Dao of immortality and the rank of the Transcendent.\n\n**Talisman of the Divine Sword to Seize Retribution**\nThis talisman follows the previous method. When inscribing it, one must recite a single incantation over the censer, then burn it to ash and swallow it with pure water over forty-nine days. This method relies on the practitioner’s accumulated virtue. When encountering vengeful spirits, malevolent ghosts, or any wrongdoers, use this talisman. Recite it over the censer once, then visualize the wrongdoer as before—when the intention is clear, retribution will be achieved.\n\nLet those who first learn this method practice secretly, never allowing others to witness it. Keep this utterly concealed.\n\n**Talisman to Drive the Six Wu Spirits and Divine Generals to Spray Clouds**\nBefore inscribing this talisman, there are additional incantations and methods for recitation. The talisman must be drawn on a day and hour corresponding to one’s birth year.\n\nSeal off your bedroom with curtains, ensuring no wife, female relatives, or close kin witness it—lest the ritual be broken. Those practicing the preceding methods must also seal a pure chamber, using sixty lamps, six paper horses, and six portions of food.\n\nAfter such preparations, select a *Gengshen* or *Jiazi* day to perform and recite the ritual. Invoke the Highest Jade Emptiness Emperor and the True Person of Supreme Worthiness, then keep this secret.\n\n**Ghost Mirror**\nFor anyone wishing to swallow a talisman and drink water, seven days prior, use seven yellow paper-money and seven white paper horses to make offerings in a secluded chamber. On the seventh day, choose a *Gengshen* or full-moon day, before sunrise, facing east and bowing in worship. Burn the paper offerings, then let the talisman and water float before swallowing it.\n\n**Method of the Adjusting-Spirit Talisman**\nThis method encompasses the Dao of the Three Realms and the Six *Jia* Flying Spirits, enabling one to foresee auspiciousness and calamity, avert aging and death, and know the origins of fortune and misfortune beforehand.\n\n**Method to Invoke the Auspicious Spirit for Sacrifice and Response**\nThe sun is my father,\nThe moon is my mother,\nThe Five Stars are my brothers,\nThe Great Unity is my friend.\n\nI solemnly invite:\nThe Eastern Gate Cui Judge,\nThe Northern Gate Xu Judge,\nThe Western Gate Li Judge,\nThe Southern Gate Zheng Judge,\nThe two departments’ child spirits—good and evil,\nThe Mighty Ghost King,\nThe Ox-Head Prison Warden,\nThe Lesser Mighty Ghost King,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe Star Constellations and Lunar-Solar Interactions,\nThe Heavenly *Jia* King,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe Earthly *Jia* King who knows of buried corpses and hidden treasures in the Nine Capitals,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe *Jia* King who knows of escaped slaves and fugitives,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe *Jia* King who knows of calamitous stars, malevolent influences, and ghosts harassing people,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe *Jia* King who can cure blindness and interpret the language of ghosts and spirits,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe *Jia* King who can conceal one’s form and hide,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe *Jia* King who knows how to subdue and drive spirits, skilled in the Twelve Spirits,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe Six *Bing*, Six *Yi*, Six *Ding*, and Six *Jia* Kings,\nto assist my ritual power.\n\nI solemnly invite:\nThe Sixty *Jiazi* Kings,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe Six *Ding* and Six *Jia* Kings of the Year, Month, Day, and Hour,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe Eastern Azure Emperor, the Green Dragon talisman king, whose *qi* enters my body,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe Southern Vermilion Emperor, the Azure Bird talisman king, whose *qi* enters my body,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe Western White Emperor, the White Tiger talisman king, to descend,\nwhose *qi* enters my body,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe Northern Black Emperor, the Dark Tortoise talisman king, to descend,\nwhose *qi* enters my body,\nto descend to this Daoist hall and assist my ritual power.\n\nI solemnly invite:\nThe Central Yellow Emperor, the Hooked Serpent talisman king, to descend,\nwhose *qi* enters my body,\nto descend to this Daoist hall and assist my ritual power.\n\n**Method to Invoke the Auspicious Spirit for Sacrifice and Response**\n\n**Deranged Incantation**\nMay the stars fall,\nMay the sun sink,\nMay the mountains crumble,\nMay the earth split,\nMay the waters dry up,\nMay the fires extinguish,\nMay diseases vanish,\nMay all be at peace,\nMay the dead revive,\nMay iron harden.\n\n**Heavenly *Jia* Talisman**\nThe Heavenly *Jia* Talisman—its master must know of celestial stars falling, solar and lunar eclipses, and the shifting of droughts and floods in the year. It ensures the five grains grow well and the four seasons are properly sacrificed to the tortoise.\n\nThe talisman transforms into the voice of a child, and beside it, the heart whispers the name of the calamity. The incantation is spoken, then the talisman is inscribed.\n\n**Earthly *Jia* Talisman**\nThe Earthly *Jia* Talisman—its master must know of buried corpses, coiled springs, subterranean treasures, divine artifacts, and hidden caches that are difficult to locate. When this talisman is sacrificed, one will know the depths below.\n\nThe talisman transforms into a small boy. If there is treasure, he will appear. After finding it, the boy will not reveal his form.\n\nWhen beneath the Big Dipper constellation, fully recite the incantation and sacrifice—he will then appear.\n\n**Human *Jia* Talisman**\nThe Human *Jia* Talisman—if a household’s slaves or servants flee or disappear without trace, or if they return but their whereabouts are unknown, the master must know their location by sacrificing this talisman. It transforms into a boy who appears before them, and in their heart, they declare, *“I know their names and whereabouts—far or near, in every direction.”*\n\n**Ghost *Jia* Talisman**",
      "overlap_context": " to the home, perform the ritual, and strike yourself once. Embrace the newly deceased corpse. Shortly after, the spirit in the new body will awaken. Feed it a small portion of glutinous rice porridge, and it will recognize you. Return to the corpse’s burial site to tend to it secretly, ensuring no one knows. Then, bury it as before. If one wishes to reuse this method, it will surely respond.*\n\n**Caution:** During practice, one must absolutely avoid women witnessing it. Keep this utterly secret.",
      "start_char": 4686,
      "end_char": 5988,
      "start_sentence": 198,
      "end_sentence": 248,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 16.602466344833374,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\鬼谷子天髓灵文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "夫鬼甲符者，或有人家男女及小口，心风邪祟、鬼魅搅挠、疼痛虎咬、疟子久瘴、夜梦不祥。 本师要知，祭此符化为童子，前心报知姓名潜藏去处，为遣送之家即安矣。 通目神符 夫通目符者，每遇辛酉日半夜子时，灯下朱书符五寸绢上。 用灰昼坛三重，灯三盏、水二锺、剑一把、香盘灰城一重。 放此通目符在盘中，赤足下念前咒，祭之三次了，灯烧此符，作灰淋水，平旦寅时供养，眼见一切鬼神间将资才，物色而去。 伏藏符 夫伏藏符者，有人家被暮贼惊散走，劫一切物色，去要追伏者。 作灰城三重、剑三口、镜一面、茶一盏、净水一盏，念前咒一遍祭了。 咒曰：以水向东噀，木摧折。 向南噀，火出灭。 向西噀，金刚缺。 向北噀，水枯竭。 向上噀，天柱折。 向下噀，地狱烈。 向贼噀，速足蹙。 祭毕，时贼神限至，三日二捉盗贼与师矣，失物自来诣门请。 冢墓神符 夫冢墓符者，即有人家河水漂流冢墓骨殖难寻者。 用绢一寸，上写冢符在绢上，夜至星象全时，置坛场祭了。 到早起后，得日出时，观觑墓上飞符牒，隐隐入谷中，往地府化童子，到人住处，是骨殖也。 若是阳人化阳人，阴人化阴人，只去符上辩之，即知此事矣。 鬼谷子天髓灵文卷上竟 ＃１『九』疑应为『丸』。 鬼谷子天髓灵文卷下 混天移地法",
      "translated_text": "**Ghost *Jia* Talisman**\nThe Ghost *Jia* Talisman—when a household’s men, women, or children suffer from *xīnfēng* (heart-wind) demonic afflictions, ghostly harassment, phantom pains, tiger bites, chronic malaria, or ominous nightmares, the master must know their cause. By sacrificing this talisman, it transforms into a boy who stands before them and, in their heart, reveals the names and hidden whereabouts of the tormentors. Once dispatched to their proper homes, the afflicted will find peace.\n\n**Divine Vision Talisman**\nThe Divine Vision Talisman—when encountering the *Xīn-Yǒu* days (sinister-hen days) at midnight, write this talisman in cinnabar ink on a five-*cùn* silk square beneath a lamp. Construct a three-tiered ash altar, place three lamps, two cups of water, a sword, and a censer of ash in a single layer. Place the Divine Vision Talisman within the censer, stand barefoot, and recite the incantation three times in sacrifice. Burn the talisman with the lamps, mix its ashes into water, and at dawn’s *yín* hour (3–5 AM), offer it as an oblation. With this, one will see all ghosts and spirits gathering their resources and departing.\n\n**Buried Treasure Talisman**\nThe Buried Treasure Talisman—when a household is robbed by night thieves who scatter and flee, stealing all valuables, and the master seeks to track them down. Construct a three-tiered ash altar, place three swords, a mirror, a cup of tea, and a cup of pure water. Recite the incantation once in sacrifice.\n\n**Incantation:**\n*\"With water toward the east—wood collapses.\nToward the south—fire is extinguished.\nToward the west—metal shatters.\nToward the north—water dries up.\nAbove—heaven’s pillar snaps.\nBelow—hell’s flames rage.\nAt the thief—swiftly crushed!\"*\n\nAfter the sacrifice, the thief’s spirit will arrive within three days, and the stolen goods will return to the doorstep.\n\n**Tombstone Spirit Talisman**\nThe Tombstone Spirit Talisman—when a household’s river-drifted bones or tomb relics are lost and unlocated. Write the tomb talisman on a one-*cùn* silk square. At night, when the stars are fully aligned, set up the altar and perform the sacrifice. At dawn, when the sun rises, observe the flying talisman descending upon the grave—vanishing into the valley, transforming into a boy in the underworld, and arriving at the living’s dwelling. If the deceased was male, he appears as a male; if female, as a female. By examining the talisman, one will know the truth of the matter.\n\n---\n*Ghost Valley Master’s Celestial Marrow Sacred Texts (Upper Scroll Complete)*\n#1 *\"Nine\"* should likely be *\"Pill\"* (丸).\n---\n*Ghost Valley Master’s Celestial Marrow Sacred Texts (Lower Scroll)*\n*Chaotic Heaven, Shifting Earth Method*",
      "overlap_context": " constellation, fully recite the incantation and sacrifice—he will then appear.\n\n**Human *Jia* Talisman**\nThe Human *Jia* Talisman—if a household’s slaves or servants flee or disappear without trace, or if they return but their whereabouts are unknown, the master must know their location by sacrificing this talisman. It transforms into a boy who appears before them, and in their heart, they declare, *“I know their names and whereabouts—far or near, in every direction.”*\n\n**Ghost *Jia* Talisman**",
      "start_char": 5988,
      "end_char": 6512,
      "start_sentence": 249,
      "end_sentence": 274,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 9.183437585830688,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\鬼谷子天髓灵文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "凡有此书者，欲要行者，先须积行，三年积成。 斋戒，香汤沐浴，用雷惊枣木，裁成十二信印。 秘於正月一日子时置坛，白茅铺地，鹿脯、香荼、酒果、灯烛各十二分，天，菖蒲。 地酒。 乃泉水也。 离坛傍伴，勿语，向天门上道，不许人知见。 於寂静无人处，置祭物，披头仗剑，请圣，默念咒曰：啼护勾那，涯查真武，咸麻萨薄，陀衍哆显，颐叱颐叱，呜金希希咄咄。 七遍。 跣足嚼舌喷血，向天门将印，称香度过，跪坐持刀，开十二信印毕，香洗过，各置祭物，依前念咒七遍。 跣足嚼舌喷血天门上，左手持天信印，向天门上印一印，言道速疾。 当有黑风从天门上起，有戈甲之声，内忽见顶天上地神人，手持枪锐，刺其本身，忽现龙虎之形，舞爪张牙，奔自身来披。 心勿惊，低头持护身真言，自然去矣。 护身真言曰：速降吉祥，吾今敢当。 冲吾者死，害吾者亡。 吾降正法，上圣皆降。 急急如律令。 虔诚念咒，静勿惧，少时变化，紫云坛畔，上酒香跪拜，受法自有王者上圣来至，自然善降，清心信礼祭毕。 至明，将祭物自食饮，饮者随东流水去之，亦勿人见。 其印方二寸四分，厚六分，锦袋盛之，勿离其身，勿触秽，犯天髓灵文经十二印信诀。 天信印，地信印，人信印，龙信印，虎信印，云信印，风信印，金信印，木信印，水信印，火信印，土信印。 凡此十二信印，应用之，使勿得交杂，则应神机。 知此文者，不脱身壳，免离六道，悟入仙乡。 凡有灾难不测之祸，病患临危，用香姻度过，持念一遍，应时消散，回凶就吉，除灾去难。 天信印 此印能开，使用回天，住日留月，变昼作夜，夏雪冬雷，游日看月，随意而成。 将左手恰乾亥，用右手执印，天门上印一印，向震天门，则仙女下降，问其所愿者皆成。 若欲日月宫游玩，先将云信印，静沐浴，铺净席，用云信印，印之起云，乘空至月宫。 将天信印，印开月宫，看月仙仙童捧持，欲回印地。 若要变昼作夜，将印用水盆中印日，其日便沉作夜。 若要住日，用竹杖坚仰照，日不敢动。 要没，取印将印天南角，即夏月降雪，要住收印。 若要冬月雷声，印天心即雷震地。 地信印 此印能动地，摧山竭海，伏鬼降神，开山建河，成沟断涧，随意皆成。 若要地震，将印印地户上，其地震动。 欲止，将印印天罡上，即不震。 将印印山，山推。 印海，海竭。 印鬼神，鬼神告求，龙虎降伏。 若要山开，将印印山，路立开，自有山神引路。 若灾危厄难，将印大道，写水字中心，则变江河，万人不敢过。 若欲成沟涧，将印印十字道，印成万丈沟涧也。 人信印　灵万胜宝 此印能行兵用人，决胜无穷，千变万化，动使草木金石皆化人形，隐异体，随意而入。 凡欲临军用人，若逢林木，将印印林首树，噀水一口喝变，其林皆尽成人，各持戈甲。 若要隐形，持净草七枝，面向门持，即先踏七星步，万人皆隐，不能见形。 若有急难，将印头为老翁，印足为童子，印腰为妇人，印面成走兽，印膊成飞乌，随形皆化。 印背成林木，印胸成大石，皆须用水成。 而若要入石木土，将印之，随意所入。 将诸物持印喷水，即见其无。 净洁忌荤，随身带水。 七星禹步 后天八卦，巽为地户，坤为人门，乾为天门，艮为鬼路。",
      "translated_text": "「All who possess this text and wish to practice it must first accumulate merit through good deeds for three years. Then, in strict observance of purity, bathe in fragrant water. Use a bolt of lightning to shock a piece of *zǎo* (枣) wood, carving it into twelve *Shén Yìn* (信印—\"Divine Seals\"). Conceal them on the first day of the first month, at the *zi* (子) hour, beneath the altar. Spread *bái máo* (白茅—\"white millet grass\") upon the ground, and arrange twelve portions each of *lù fǔ* (鹿脯—\"dried deer meat\"), fragrant tea, wine and fruits, lamps and candles, *tiān huā* (天花—\"celestial flowers\"), and *chāng pú* (菖蒲—\"sweet flag\"). Use *diàn jiǔ* (地酒—\"earth wine,\" i.e., spring water) as well.\n\nSet up the altar beside the victim, speaking not a word, and face the *Tiān mén* (天门—\"Celestial Gate\"). Do not allow others to witness. In a secluded, silent place, arrange the sacrificial offerings, then bare your head and grasp your sword, invoking the holy presence. In silence, recite the incantation seven times:\n\n*\"Tí hù gōu nà, yá chá zhēn wǔ,\nxián má sā bó, tuó yǎn duō xiǎn,\nyí chì yí chì, wū jīn xī xī duō duō!\"*\n\nBarefoot, with tongue bitten and blood spat, face the *Tiān mén* and press one seal upon it, declaring, *\"Swiftly descend!\"*\n\nBlack winds shall rise from the *Tiān mén*, accompanied by clanging arms. Suddenly, a *Dìng Tiān Shàng Dì* (顶天上地神人—\"Earth-piercing, Heaven-toppling divine being\") appears, brandishing a sharp spear, striking the victim’s very body. A dragon and tiger manifest, claws unsheathed and fangs bared, charging toward the victim. Fear not—bow your head and guard yourself with the *Hùshēn Zhēn yán* (护身真言—\"True Words for Self-Protection\"). They shall depart naturally.\n\nThe *Hùshēn Zhēn yán* are as follows:\n\n*\"Swiftly descend, auspicious fortune!\nI now dare to bear it.\nThose who assail me shall perish,\nthose who harm me shall die.\nI descend with righteous law—\nall saints shall descend with me.\nAs swift as the command, thus it is done!\"*\n\nWith reverence, recite the incantation, remain still and unafraid. In time, the transformation shall occur: purple clouds gather at the altar’s edge. Kneel and offer wine and incense, and the *Ràng zhě* (王者—\"Sovereigns\") and *Shèng shèng* (上圣—\"Supreme Saints\") shall descend naturally, bestowing their blessings. With a pure heart and faithful devotion, complete the rites.\n\nAt dawn, consume the sacrificial offerings yourself. Those who drink shall follow the east-flowing water away—do not let others see. The seals measure two *cùn* (寸) and four *fēn* (分) in width, six *fēn* thick, stored in a brocade pouch. Never part from them, nor touch impurity. Violate the *Tiān xīn Shén yìn* (天信—\"Celestial Faith Seal\") and the twelve *Shén yìn* (信印—\"Divine Seals\"):\n\n**The Twelve Divine Seals:**\n*Tiān xìn yìn* (天信印—\"Celestial Faith Seal\"),\n*Dì xìn yìn* (地信印—\"Earth Faith Seal\"),\n*Rén xìn yìn* (人信印—\"Human Faith Seal\"),\n*Lóng xìn yìn* (龙信印—\"Dragon Faith Seal\"),\n*Hǔ xìn yìn* (虎信印—\"Tiger Faith Seal\"),\n*Yún xìn yìn* (云信印—\"Cloud Faith Seal\"),\n*Fēng xìn yìn* (风信印—\"Wind Faith Seal\"),\n*Jīn xìn yìn* (金信印—\"Metal Faith Seal\"),\n*Mù xìn yìn* (木信印—\"Wood Faith Seal\"),\n*Shuǐ xìn yìn* (水信印—\"Water Faith Seal\"),\n*Huǒ xìn yìn* (火信印—\"Fire Faith Seal\"),\n*Tǔ xìn yìn* (土信印—\"Earth Faith Seal\").\n\nUse these twelve seals in order, ensuring none are mixed—then their divine efficacy shall manifest. Those who know this text shall not abandon their mortal form, escape the *Liù dào* (六道—\"Six Realms\"), and awaken to the Daoist realm of immortals.\n\nFor any sudden calamity or perilous affliction, when one faces grave illness, use fragrant incense to pass over the seals, reciting one cycle. The disaster shall disperse instantly, turning ill fortune to good, removing calamity and averting misfortune.\n\n**Celestial Faith Seal (天信印):**\nThis seal can open the heavens. When used to reverse the *Tiān* (天—\"Heaven\"), it can halt the sun, retain the moon, transform day into night, summon snow in summer or thunder in winter, and traverse the sun while observing the moon—all at will. Hold your left hand to *qián hài* (乾亥—\"the *Qián* [乾] and *Hài* [亥] positions,\" i.e., the northwest), and with your right hand grasp the seal. Press it upon the *Tiān mén* (天门—\"Celestial Gate\"), facing the *Zhèn Tiān mén* (震天门—\"Gate of Thunder\"). Then, a Daoist maiden shall descend, fulfilling any request made.\n\nIf you wish to tour the *Rìyuè Gōng* (日月宫—\"Palaces of the Sun and Moon\"), first use the *Yún xìn yìn* (云信印—\"Cloud Faith Seal\"). After bathing in purity, lay out a clean mat, and press the *Yún xìn yìn* to summon clouds. Ascend the void to the Moon Palace. Then, use the *Tiān xìn yìn* to open the Moon Palace, where Daoist immortals and celestial boys shall bear you. When ready, seal it to return.\n\nIf you wish to turn day into night, press the seal into a water basin with the sun’s reflection—then the day shall sink into night. To retain the sun, use a bamboo rod to prop and illuminate it; the sun shall not dare move. To extinguish it, press the seal at the *Tiān nán jiǎo* (天南角—\"southern corner of the heavens\"), and in summer, snow shall fall. To stop, withdraw the seal. If you wish to summon thunder in winter, press the seal at the *Tiān xīn* (天心—\"center of the heavens\"), and the earth shall be shaken by thunder.\n\n**Earth Faith Seal (地信印):**\nThis seal can move the earth, topple mountains, drain seas, subdue ghosts, and summon spirits. It can open mountains and construct rivers, carve trenches and sever ravines—all at will. To cause an earthquake, press the seal upon the *Dì hù* (地户—\"Earth Portal,\" i.e., the southeast). To halt it, press the seal upon the *Tiān gāng* (天罡—\"Celestial Lock,\" i.e., the northeast). Press the seal upon a mountain, and it shall collapse. Press it upon the sea, and it shall be drained. Press it upon ghosts or spirits, and they shall submit, the dragon and tiger shall be tamed.\n\nIf you wish to open a mountain, press the seal upon its peak, and a path shall appear. The mountain spirit shall guide the way. For calamity or danger, press the seal upon a great road, inscribing the *shuǐ* (水—\"water\") character at its center—then it shall become a river, impassable to ten thousand souls. If you wish to create a trench or ravine, press the seal upon a crossroad, and a ten-thousand-*zhàng* (丈) deep gorge shall form.\n\n**Human Faith Seal (人信印):**\n*Líng wàn shèng bǎo* (灵万胜宝—\"Spiritual Victorious Treasure\")\nThis seal can deploy armies and command men, ensuring endless triumph. It can transform a myriad variations—grasses, woods, metals, and stones—into human forms, concealing strange bodies, and entering at will. If you must confront an enemy and need men, encountering a forest, press the seal upon the first tree and spit water into it. The entire forest shall transform into soldiers, each bearing arms.\n\nIf you wish to vanish, hold seven stalks of pure grass before the door, facing it. First, take the *Qīxīng Yǔ bù* (七星禹步—\"Seven-Star Yu Step\"), and ten thousand souls shall be unable to perceive your form.\n\nIn urgent need, press the seal upon your head to become an old man, upon your feet to become a boy, upon your waist to become a woman, upon your face to become a running beast, or upon your arms to become a flying crow—all transformations shall manifest.\n\nPress the seal upon your back to become a forest, upon your chest to become a great stone—all must be done with water. To enter stone, wood, or earth, press the seal accordingly, and you shall enter as desired. Press any object with the seal and water, and it shall vanish.\n\nKeep purity, avoid carrion, and carry water with you. **Seven-Star Yu Step:**\n*Hòu Tiān Bā guà* (后天八卦—\"Post-Heaven Eight Trigrams\")\n*Xùn* (巽) for *Dì hù* (地户—\"Earth Portal\"),\n*Kūn* (坤) for *Rén mén* (人门—\"Human Gate\"),\n*Qián* (乾) for *Tiān mén* (天门—\"Celestial Gate\"),\n*Gèn* (艮) for *Guǐ lù* (鬼路—\"Ghostly Path\").」",
      "overlap_context": "upon the grave—vanishing into the valley, transforming into a boy in the underworld, and arriving at the living’s dwelling. If the deceased was male, he appears as a male; if female, as a female. By examining the talisman, one will know the truth of the matter.\n\n---\n*Ghost Valley Master’s Celestial Marrow Sacred Texts (Upper Scroll Complete)*\n#1 *\"Nine\"* should likely be *\"Pill\"* (丸).\n---\n*Ghost Valley Master’s Celestial Marrow Sacred Texts (Lower Scroll)*\n*Chaotic Heaven, Shifting Earth Method*",
      "start_char": 6512,
      "end_char": 7766,
      "start_sentence": 275,
      "end_sentence": 327,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 27.278372764587402,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\鬼谷子天髓灵文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "从地户起，行入天门，上出万人，并皆不能见之，卫军必用。 此乃返魂卫药，圣用。 此印能降龙宝 此印能降龙，乘驾异物成龙，腾云入雾，蛇虫变化，一印皆成，吞云吐雾。 凡要变龙，将白练三尺，亦印头尾，中心书龙字，噀水一口，喝变三声，主化成龙，骑跨任意，欲要止印地。 凡要追海兽，将印印水面，其龙兽出水面上，驱使任意。 若要自己变龙时，将印印心上，吃水三口，言变三声，立化成龙，乘云吐雾，千里之外。 将印诸物色喷水，要成大蛇书蛇字，要成龙书龙字，皆喷水持印，随意皆成。 虎信印　伏虎宝 此印能伏虎杀虎，便降伏一切虎豹狼虫、山中异兽，兼有杀虎符，有禁山术，中全一卷内。 若要山中猛虎食人，唤樵夫时，将朱印绢上，於山林树上贴之，其虎伏於树下，其虎不敢动移也。 欲要杀时，印於铁板上，埋枯树下。 若要迫虎时，将印印桃板上，青袋盛佩带，其虎自追随，相就如羊。 若山路远行，将印印大石上，其山灭迩无虎狼，远去千里之外也。 若要自己变虎时，将印印背上，喷水变立成虎，风生虎。 云信灵印　起云宝 此印能起云登空，解生五色祥云，驾云升天，游日看月，去住自然往来。 得此印，遍巡四大神洲。 若有得此印法，将印印之足下，云生遍地。 欲要乘驾云，复印云上起，一印起一丈，二印二丈。 欲落，将印印上自下。 欲上天看月，精诚斋戒，香汤沐浴，将印印地，生云起至月，先用开天门印。 如天雨不止，欲生五色祥云，用青布，上朱书五方金、木、水、火、土，用印字上，五方生五色祥云。 风信灵印　生风宝 此印能万里生威风，行军过舟，起寨迎敌，吹沙起石，随机而应。 用昏天暗地，拟印时，行回风印。 则凡若遇敌，用瓮碗一只，用朱砂书速生风三字，随向掷空处，用印照之，其风速至，摧山折木也。 若渡水过船，用其风势，亦如前用。 若欲昏天暗地，用上件法向鬼门，用印照之，黑风立起，不辩昼夜。 若值逆风回避，将印迎风，碗书回字，向空掷去，印则回。 金信灵印　碎剑宝 此印能梯金要铁，印白刃不能伤，断剑折枪一切刀斧无害，彤弓朱弩到身而回，不损纤毫。 若临兵阵，欲敌相持，印用朱砂，印於白练上七颗，向阵烧灰，用一碗净水搅印灰，向阵噀之。 及兵，左膊各一印，去敌即如绵，刃不能及，折一切箭矢，至身则尽回。 如要验时，用鸡五个，笼裹罩定，内有一只鸡，翅底暗带一颗用回，以箭射鸡，其带印者不损分毫，神验。 木信印　返木宝 此印能生一切草木及乘驾空中，能使用木禽、木兽搬粮运草。 凡驾乘枋木，用印印两头，喷水念疾字，如枋起空，欲住处喝住。 若围军阵，困兵无粮，将木做造一飞乌形像，付印肚上，其飞禽去军阵，带粮往来，用水依前。 建高堂大宅，亦依前用，夜行之如昼，勿泄漏之。 水信灵印　泛波宝 此印善变水溢江，兴云致雨，建井移河，渡海乘波，随而所愿。 若求波浪，祭水宰白马带驹者，向北祭用，印印铁札上，投江河中，不移少时，雷震降大波涛。 若值大江河欲过，将印印於履。 若建井回河，将印印地面上，其水自至矣。 火信灵印　列旸宝 此印能发万里火，灰木烧山，焚营燋寨，毁火火炎起姻，衮海煎波。",
      "translated_text": "Treading the **Seven-Star Yu Step** (七星禹步), ten thousand men shall vanish, their forms unseen. When military needs arise, apply the seal thus:\n\n**The Seal of the Returning Soul** (返魂卫药) — **Celestial Defense Seal**\nThis seal can subdue the **Dragon Treasure** (龙宝). To summon a dragon, press the seal upon an object of strange form, and it shall transform into a dragon, soaring through clouds and mist, its essence shifting between serpent and vermin. With but one seal, it shall swallow clouds and spew mist.\n\nTo become a dragon, take a white silk banner three *chi* in length. Seal its head and tail, inscribing *Dragon* (龙) at its center. Spray water three times and chant *\"Hua!\"* (变) three times—thus you shall transform into a dragon, riding as you will. To halt, press the seal upon the ground. To chase sea beasts, press the seal upon the water’s surface; the dragon or beast shall rise, to be driven at will.\n\nTo become a dragon yourself, press the seal upon your heart, swallow water three times, and speak *\"Hua!\"* (变) three times. Instantly you shall turn into a dragon, ascending upon clouds and mist, even to a thousand *li* away. Spray any object’s color with water and seal it—if you wish a great serpent, inscribe *Serpent* (蛇); if a dragon, inscribe *Dragon* (龙). All shall manifest as desired.\n\n**The Tiger-Faith Seal** (虎信印) — **Subduing Tiger Treasure** (伏虎宝)\nThis seal can subdue and slay tigers, taming all ferocious beasts—mountain tigers, leopards, wolves, and strange creatures alike. It bears the **Tiger-Slaying Talisman** (杀虎符) and the **Mountain-Forbidding Technique** (禁山术), contained within a single scroll.\n\nIf a savage tiger in the mountains devours men and you call for woodcutters, take a red seal on silk and affix it to a tree. The tiger shall crouch beneath it, daring not to move. To kill, press the seal upon an iron plate and bury it beneath a dead tree. To compel the tiger, press the seal upon a peachwood board, wrap it in a green cloth, and wear it. The tiger shall follow, approaching like a lamb. If traveling far through mountain paths, press the seal upon a great stone. The mountains shall vanish near and far, the beasts gone a thousand *li* away.\n\nTo become a tiger yourself, press the seal upon your back, spray water, and chant *\"Hua!\"* (变)—thus you shall stand transformed into a tiger, the wind itself becoming its breath.\n\n**The Cloud-Faith Seal** (云信灵印) — **Rising Cloud Treasure** (起云宝)\nThis seal can summon clouds and ascend to the heavens, conjuring five-colored auspicious clouds (五色祥云), riding them to the sky, and wandering among sun and moon, coming and going at will. With this seal, you may traverse the four great divine continents (四大神洲).\n\nIf one gains this seal’s method, pressing it beneath their feet shall generate clouds across the land. To ride the clouds, press the seal upward upon them—one seal raises one *zhang*, two seals raise two *zhang*. To descend, press the seal downward from above.\n\nTo ascend to the moon, observe strict fasting and purification (精诚斋戒), bathe in fragrant waters, press the seal upon the earth, and summon clouds to reach the moon. First use the **Opening Celestial Gate Seal** (开天门印). If the heavens rain unceasingly and you wish five-colored auspicious clouds, take green cloth, inscribe upon it the Five Directions’ metals—*Wood* (金), *Water* (木), *Fire* (水), *Earth* (火), *Metal* (土)—and press the seal’s characters above it. Thus shall the five-colored auspicious clouds arise.\n\n**The Wind-Faith Seal** (风信灵印) — **Generating Wind Treasure** (生风宝)\nThis seal can summon mighty winds a thousand *li* away, aiding armies in crossing rivers or raising encampments against foes. It can stir sands and hurl stones, responding to any need.\n\nIn darkness and gloom, when forging the seal, employ the **Reverting Wind Seal** (回风印). Thus, if encountering enemies, take a jar or bowl, inscribe upon it in cinnabar *\"Swiftly Generate Wind\"* (速生风), and hurl it toward the sky. Pressing the seal upon it shall summon the wind swiftly, toppling mountains and snapping trees.\n\nTo cross water by ship, use the wind’s force as above. To summon darkness and gloom, direct the previous method toward the **Ghostly Gate** (鬼门) and press the seal upon it. A black wind shall rise instantly, obscuring day and night.\n\nIf caught in contrary winds, press the seal against the wind, inscribing *\"Return\"* (回) upon a bowl and hurling it skyward. The wind shall reverse.\n\n**The Gold-Faith Seal** (金信灵印) — **Shattering Sword Treasure** (碎剑宝)\nThis seal can ascend metal and command iron, rendering white blades powerless. It can sever swords, bend spears, and nullify all knives and axes. Even crimson bows and arrows shall recoil upon approach, harming not a hair.\n\nIn battle, if you wish to hold the enemy at bay, press the seal in cinnabar upon a white silk banner seven times, burn it before the ranks, and stir the ashes into a bowl of pure water. Spray this upon the enemy.\n\nWhen facing foes, press one seal upon each left forearm. They shall approach as if against cotton, blades unable to reach. All arrows shall be deflected, turning back upon their own bodies. To test its power, take five roosters, wrap them in a cage, and attach to one the seal’s *\"Return\"* (回) talisman at its wing. Shoot the roosters—only the one bearing the seal shall suffer no harm, proving its efficacy.\n\n**The Wood-Faith Seal** (木信印) — **Reverting Wood Treasure** (返木宝)\nThis seal can summon all grasses and woods, even riding them through the air. It can employ wooden birds and beasts to carry grain and haul grass.\n\nTo ride a wooden beam, press the seal upon both ends, spray water, and recite *\"Ji!\"* (疾). The beam shall rise into the sky; to halt, chant *\"Zhu!\"* (住). If besieging an enemy camp and soldiers lack provisions, craft a wooden likeness of a flying crow (飞乌), affix the seal to its belly. The wooden bird shall depart for the camp, bearing grain back and forth, using water as before.\n\nTo build a lofty hall or grand residence, apply the seal as above. Travel by night as if by day, but reveal not its secret.\n\n**The Water-Faith Seal** (水信灵印) — **Floating Wave Treasure** (泛波宝)\nThis seal excels in transforming water, overflowing rivers, summoning clouds and rain, redirecting wells and streams, or crossing seas by riding waves—all as desired.\n\nTo summon waves, sacrifice to water with a white horse and its foal, facing north. Press the seal upon an iron tablet and cast it into a river or stream. The waves shall not fail to rise, the thunder shaking them into great billows.\n\nIf crossing a vast river or stream, press the seal upon your shoes. To redirect water or reverse a river’s flow, press the seal upon the ground. The water shall come naturally.\n\n**The Fire-Faith Seal** (火信灵印) — **Arrayed Yang Treasure** (列旸宝)\nThis seal can ignite flames a thousand *li* away, reducing forests to ash and mountains to embers. It can burn camps, scorch fortresses, and kindle fires that rise like marriage flames (姻). Even the sea shall boil beneath its fury.",
      "overlap_context": "one—all must be done with water. To enter stone, wood, or earth, press the seal accordingly, and you shall enter as desired. Press any object with the seal and water, and it shall vanish.\n\nKeep purity, avoid carrion, and carry water with you. **Seven-Star Yu Step:**\n*Hòu Tiān Bā guà* (后天八卦—\"Post-Heaven Eight Trigrams\")\n*Xùn* (巽) for *Dì hù* (地户—\"Earth Portal\"),\n*Kūn* (坤) for *Rén mén* (人门—\"Human Gate\"),\n*Qián* (乾) for *Tiān mén* (天门—\"Celestial Gate\"),\n*Gèn* (艮) for *Guǐ lù* (鬼路—\"Ghostly Path\").」",
      "start_char": 7767,
      "end_char": 9025,
      "start_sentence": 328,
      "end_sentence": 374,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 20.802783250808716,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\鬼谷子天髓灵文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "凡用火印，夜行之。 若起万里火，将印印南方丙上，取气吹印上，向方位照之，其火从印中出，焚荡无涯，欲灭水印救之。 欲焚舍室草木，用印印青纸上，裹圆石人投掷於室上，火发无救。 若避难逃形，将印印山大石，立成火山也。 土信印　长春宝 此印能生一切草、五谷、菜实、瓜菜，能印土成金，变石作玉。 入土印印地，将五谷种之，噀水一口生，二口长，三口成形像，四口结实，五口熟。 若要种诸菜木，亦喷水，一印水一口，生七尺，七口水印成。 如前法用印，印石成玉，印土成金，印枯木生芽，印树冬月开花发，隐地入玉，无不在也。 此书天之秘文，出世离凡之妙法。 若修仙求道之士知此文者，夺一纪年功，烧金炼药，无不成就。 凡行天髓灵经，须精诚斋戒，断五辛，除六害，积脱尘之福，行修真之功德。 勿轻视灵文，巳污秽触犯，祸及身矣。 若传下士，罪探无疆，万金不传之秘也。 天髓治国安邦章 此书能治国安邦，驰名遍世，无穷自在，千变万化，出有入无，撒豆成兵，撒草成马，一夫庾敌百人，起风云，禳气色，变昼作夜，回风住雨，续骨接筋，驱一切鬼神。 常握乾坤都於目下，若要离凡超圣，乃上天梯也。 凡欲行法，积功行度众生，忌五辛，持大咒，敬神祇，隐凡世，勿泄天机，精解义奥，坚心守志，此法行能住世。 鬼谷子曰：上惊。 下士得之掌国权兵。 莫泄天机，名太清真人。 行用此法，先斋戒沐浴，严洁精诚，於孤静无人处，五月五日，七月七日，三月三日，应吉重日置灰坛，祭物于左。 灰坛 此坛三重，外方二丈四尺，第三重内方一丈二尺，於北斗下置用之。 五方旗子，各按五方位用，祭物置坛上，鹿脯七分，酒七盏，食七分，果七分，灯七盏，净水七盏，香花供养，茅香铺地，更用野狐心一具，老猿猴心一具，野鹊心一具，蛩鷮心一具。 右件四心托在坛畔，斟酒上香，对北斗，披头仗剑持咒，咒曰： 奉请北极大帝真武将军，速令下降，助吾神力。 急付坛场，馨香珍味。 吾奉帝劲，行法于世。 急急如律令。 虔心献酒焚香，少时有紫云盖坛，蕾富中忽见青足，勿惊，祭毕时，将四心用盘托，向坛前祝曰：狐心灵灵，猿意清清。 灵知灵怪，听吾令行。 真魂勿散，灵魄同生。 式付杵臼，碎汝魂精。 吾今使用，一一皆成。 急急如律令劫。 右件祭毕，云收祭食，随东流水去之。 用杵臼将四心捣之，祝曰： 药灵药灵，吾奉太清。 逢人人死，逢鬼鬼惊。 千捣千圣，万捣万灵。 立降真气，使吾上升。 急急如律令。 持杵捣千余下，后入药同捣。 鬼臼，半两深者。 鬼箭，半两陈者。 鬼扇，半两断者。 鬼督邮，半两茸者。 雄黄，半两好者。 人参，半两形者。 茯神，半两。 茯苓，半两。 龙脑，半两。 麝香。 半两。 右件捣罗为末，炼千岁松脂为九，朱砂为衣，如小弹子大。 如修合时，并不许鸡犬、妇人、孝子，见之触犯。 着此药飞走变化，用锦囊盛之。 甲子日早辰，左手持一粒，念咒一遍，用开心符一道，调净水吞下一粒。 次念咒曰：符水清清，造化身成。 入吾五脏，助吾魂精。 千年不朽，万岁莫倾。 吾今祝咒，换吾身形。 金丹一粒，立去天廷。 急急如律令。 开心符烧灰调服 此药名换壳丹，又名视鬼丹。",
      "translated_text": "**On the Use of Fire and Earth Seals**\n\nFor all uses of the Fire Seal, perform the rites at night.\nTo ignite flames a thousand *li* distant, press the seal upon the **Southern Homogeneous Direction** (丙), draw in the *qi*, and blow upon the seal while gazing toward the target. Fire shall erupt from the seal, scorching without bound. To extinguish it, use the Water Seal to quell the flames.\n\nTo burn dwellings, grass, or trees, press the seal upon **blue paper**, wrap it around a round stone effigy, and hurl it upon the structure—fire shall rise with no remedy.\nTo escape peril and alter one’s form, press the seal upon a great mountain stone, and it shall become a fiery mountain.\n\n---\n**The Earth-Faith Seal** (土信印) — **Arrayed Spring Treasure** (长春宝)\nThis seal can cultivate all grasses, grains, vegetables, melons, and fruits. It can transmute soil into gold and stone into jade.\nWhen pressing upon the earth, sow seeds and spit once—roots shall form. Spit twice—stems shall grow. Spit thrice—the plant shall take shape. Spit four times—fruit shall set. Spit five times—the harvest shall ripen.\nTo cultivate all manner of trees and plants, likewise spit water: one spit per impression yields seven *chi* of growth; seven spits yield full maturity.\nAs before, press upon stone to make jade, upon earth to make gold, upon withered wood to sprout leaves, upon trees to bloom in winter, or to conceal oneself within jade—all shall manifest.\n\nThis text is **Heaven’s Secret Scripture**, a wondrous method beyond the mundane. Those who practice Dao and seek immortality, knowing this text, shall gain a decade’s worth of merit. Refining gold, concocting elixirs—all shall succeed.\n\nAll who practice the *Heaven’s Marrow Sacred Scripture* must observe strict purity: abstain from the **Five Pungent** (辛), avoid the **Six Calamities**, accumulate merit free of dust, and cultivate the virtue of the True Ones. Do not trifle with these sacred texts—defilement brings ruin. To pass this to unworthy disciples is a crime without end; this is a treasure worth ten thousand gold.\n\n---\n**The Heaven’s Marrow Chapter on Governing the Realm**\nThis text can govern nations, spread renown across the world, and grant boundless freedom—transforming with myriad changes, appearing and vanishing at will. Scatter beans to raise armies, scatter grass to summon steeds; one man shall repel a hundred foes. Command winds and clouds, rectify *qi* and complexion, turn day into night, reverse winds and halt rains, mend broken bones and severed sinews, and subdue all ghosts and spirits.\n\nHold the **Heavenly Circulation** (乾坤) beneath your gaze. To transcend the mundane and attain sainthood, this is the ladder to Heaven.\nWhen practicing the method, accumulate merit by saving sentient beings, abstain from the Five Pungent, recite the Great Spell, revere the deities, conceal yourself from the world, and never reveal Heaven’s secrets. Understand its profound meaning, steadfast in heart and resolve—this method shall endure in the world.\n\n**Ghost Valley Master** says: *The unworthy shall wield power over nations and armies.*\nDo not divulge Heaven’s secrets—this is the name of the **Supreme Clarity True Person**.\n\nWhen employing this method, first observe purity through fasting and bathing, maintaining strict cleanliness and sincerity. On **solitary, auspicious days**—the **5th of the 5th month, 7th of the 7th month, or 3rd of the 3rd month**—set up the **Ash Altar** in a secluded place beneath the **Northern Dipper**.\n\n---\n**The Ash Altar**\nThree-tiered, the outer square measures **24 *chi*** in length, the innermost **12 *chi***. Place it beneath the Northern Dipper.\nSet up the **Five Direction Flags** according to their respective cardinal points. Upon the altar arrange:\n- Seven portions of **deer jerky**,\n- Seven cups of wine,\n- Seven portions of food,\n- Seven portions of fruit,\n- Seven lamps,\n- Seven cups of pure water,\n- Incense and flowers for offerings,\n- **Wild mugwort** spread upon the ground.\n\nPlace the following **four hearts** at the altar’s edge:\n- One **wild fox heart**,\n- One **aged monkey heart**,\n- One **wild magpie heart**,\n- One **owl hawk heart** (蛩鷮).\n\nPour wine and burn incense, facing the Northern Dipper, dishevel your hair, grasp your sword, and recite the spell:\n\n*\"I humbly summon the Great Emperor True Martial General of the North Pole, swiftly descending to aid my divine power. Urgently bestow upon this altar, fragrant incense and precious offerings. I act under Imperial command, practicing law in the world. As the decree commands, swiftly and without delay.\"*\n\nWith devout heart, offer wine and burn incense. Soon, a **purple cloud** shall shroud the altar, and within its richness, a **green-clad foot** shall appear—do not be alarmed. Upon completing the rites, take the four hearts in a tray and, before the altar, intone:\n\n*\"Fox heart, resplendent and wise,\nMonkey intent, pure and clear.\nKnowledge of spirits, obey my command.\nTrue soul shall not scatter,\nSpirit essence shall live together.\nNow committed to the mortar and pestle,\nYour essence shall be ground to dust.\nI now employ you—each shall fulfill its purpose.\nAs the decree commands, swiftly and without delay.\"*\n\nAfter the rites, let the offerings be consumed by the cloud and carried away by the east-flowing waters.\n\nWith the mortar and pestle, grind the four hearts while reciting:\n\n*\"Herb of power, herb of might,\nI invoke the Supreme Clarity.\nEncounter man—let him die,\nEncounter ghost—let it tremble.\nA thousand grindings bring sanctity,\nTen thousand grindings bring spirit.\nDescend true *qi*, let me ascend.\nAs the decree commands, swiftly and without delay.\"*\n\nPound a thousand times, then add the following ingredients and grind together:\n- **Ghost Mortar** (鬼臼) – half *liang* of the deep-rooted kind,\n- **Ghost Arrow** (鬼箭) – half *liang* of the aged kind,\n- **Ghost Fan** (鬼扇) – half *liang* of the broken kind,\n- **Ghost Supervisor** (鬼督邮) – half *liang* of the fluffy kind,\n- **Realgar** (雄黄) – half *liang* of the finest,\n- **Ginseng** (人参) – half *liang* of the shaped kind,\n- **Fritillary Bulb** (茯神) – half *liang*,\n- **Poria** (茯苓) – half *liang*,\n- **Elephant Brain** (龙脑) – half *liang*,\n- **Musk** (麝香) – half *liang*.\n\nGrind into a fine powder, refine **thousand-year-old pine resin** into nine portions, and coat with **cinnabar** into pills the size of small bullets.\n\nWhen preparing this elixir, **no chickens, dogs, women, or filial children** may witness or defile it. Store the pills in a **silk pouch** for flight and transformation.\n\nOn a **Jiazi day** at dawn, hold one pill in your left hand, recite the spell once, and swallow it with water adjusted by the **Open Heart Talisman**. Then recite:\n\n*\"Talisman water, pure and clear,\nForm the body of transformation.\nEnter my five viscera,\nAid my spirit essence.\nThousand years unaging,\nTen thousand years unshaken.\nI now invoke this spell,\nTo exchange my mortal shell.\nOne gold pill—ascend to Heaven’s court.\nAs the decree commands, swiftly and without delay.\"*\n\n---\n**Burning the Open Heart Talisman into Ash for Ingestion**\nThis elixir is named **Shell-Swapping Pill** (换壳丹), also called **Ghost-Viewing Pill** (视鬼丹).",
      "overlap_context": "them into great billows.\n\nIf crossing a vast river or stream, press the seal upon your shoes. To redirect water or reverse a river’s flow, press the seal upon the ground. The water shall come naturally.\n\n**The Fire-Faith Seal** (火信灵印) — **Arrayed Yang Treasure** (列旸宝)\nThis seal can ignite flames a thousand *li* away, reducing forests to ash and mountains to embers. It can burn camps, scorch fortresses, and kindle fires that rise like marriage flames (姻). Even the sea shall boil beneath its fury.",
      "start_char": 9025,
      "end_char": 10280,
      "start_sentence": 375,
      "end_sentence": 441,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 26.294445276260376,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\鬼谷子天髓灵文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "初服一粒，云行四步，五脏六腑，表裹通彻，行汗出，热水浴之。 第二日二服，似觉浑身毛窍如针刺，热痛。 三日，下血三五升，勿怪之，换血脏。 服至七日，药行泥丸宫换脑髓，头痛如劈，不可忍也。 服解痛引子。 人参，狭苓，石膏，赤箭，甘草，附子，木香。 右件各分停为末，乳香水调下二钱，日进三服则止，慎勿饮河水。 至百日，任意服药。 经二十七日，浑身变换，体轻身健，眼如碧桃，脸若红莲，走如奔马。 三七日，心开无物不知，无书不解，心开意朗，眼中夜放一丈光明，出现十里，见鬼神状、日月中乌兔，心如达知未来之凶祸，神人自告。 百日功成，千变万化，坐在立亡，随意而用。 猛兽符 通身符 若临灾危，自己要变百尺鬼神时，将符书就星吞之，饮水喝言长百尺，青身，万人皆惧也。 老翁符 古凡要变百岁翁，将香水吞，成皓首翁矣。 天隐符 若要隐时，书就此符，向日吞之，即时隐矣无人得见。 每月一度吞之。 战胜符 如交敌，要枪刀斧不能及。 将符书成四十九道，烧灰，用水五七碗搅匀，教军人共饮之，皆不损身体，刀斧自断折，着身似铁石。 神兵符 若临军过之，先用香炉一枚，须要净水一碗，向北用皂旗七柄，鼓一面，师人皂背子披头念咒，执笔书符，想自己真武形像，符成就烧灰，嚼舌喷血并水符灰，向北方振鼓摇旗，教众军叫圣字，里一风当北方罩，军兵皆成一丈鬼神、青面黑杀将军，百万军不可当也。 有河莫过，过则祸矣。 咒曰：壬癸将军，助吾威风。 千兵浴体，立化神身。 逢山山碎，遇海竭津。 吾奉真命，不得久停。 急急如律令劝。 右件前符药神呢，并是精思用意，勿差错。 但是符错，咒不真，药不精，则不灵矣。 凡有世人命带攀鞍驿马将军，有权握之人，若遇此书，立国安邦，功勋遍世，天人可动。 草豆法 若要撒豆为兵，斩草为马，纵横自在万里，荡荡无忧，依法用兵。 於七月七日，五月五日，依前再画灰坛，香盘净水，大豆一斗二升，净草一束，安於坛心，披头作咒，从此夜初起念咒，至五更收坛了毕。 每日净室焚香，持咒至四十九日，临欲行兵，行住坐外，默念一遍，此法立成。 从坛心用香度草豆，咒曰：天真敕奏，驱使草豆。 大变神兵，为吾行营。 急呼速至，不得久停。 听吾神咒，各付真形。 神水一噀，草变豆成。 急急如律令。 右件，先将草豆咒香上度过，念咒七遍，喷水。 吾於草上，言摄摄摄摄，罢收坛。 持天罗咒，四十九日持千遍，每日先服起灵符一道，后念咒毕，日自验之。 起灵符 早辰朱砂书符，烧灰，用净水向日吞之。 默念天罗咒：唵去萨佛，唵唏萨佛，夷霞纷纷绌绌，叱迦□呢耶怛，侄陀罗陀罗唵，喥噜喥噜烟，无夷钺陁，跋陁跋利，啰呢曼茶噜，吽勾那嗏。 持咒时，先须斋戒沐浴焚香，日念千遍，至四十九日足。 将草一把，约一百二十茎，大豆一升二合。 於净处，将草撒於宽广处，无人之地。 试法含咒一遍，披头天符噀水，将用刀子细到，喷水一口，喝七声变人七尺、变马五尺。 用兵多少，随意加臧。 如持咒，至四十九日咒成，自闻草人之声，是验。 如变人将使用行战，束勿至林，西勿至金，北勿至山。 谨正如此，是真五形返法。",
      "translated_text": "**Initial Dosage and Transformative Effects**\nUpon taking the first pill, one may walk upon clouds in four strides. The five viscera and six fu-organs are penetrated and cleansed, inducing perspiration. Bathe in hot water afterward.\n\nOn the second day, take two doses. The body’s pores will feel as if pricked by needles, with heat and pain.\n\nBy the third day, expect to expel three to five *sheng* of blood—do not be alarmed, for this is the old blood and viscera being replaced.\n\nBy the seventh day, the elixir reaches the *diniwan* (lower dantian), replacing the marrow. The head will ache as if split—endure it without complaint.\n\n**Pain-Relieving and Conception-Inducing Decoction**\nIngredients:\n- Ginseng (*rénshēn*)\n- Alisma (*zéxī*)\n- Gypsum (*shígāo*)\n- Red arrowroot (*chìjiān*)\n- Licorice (*gāncǎo*)\n- Aconite (*fùzǐ*)\n- Aucklandia (*mùxiāng*)\n\nGrind each into powder. Mix with two *qián* of frankincense water and take three doses daily until the pain subsides. **Never drink river water.**\n\nBy the hundredth day, you may take the elixir at will.\n\nAfter twenty-seven days, your body will fully transform—light as air, vigorous in movement, eyes like jade peaches, face like red lotuses, swift as galloping horses.\n\nBy the thirty-seventh day, your mind will open: no knowledge remains unknown, no scripture unsolved. Your heart will be clear, your thoughts luminous, and your eyes will emit a yard of nocturnal light, visible for ten *li*. You will perceive ghosts and spirits, the sun and moon’s celestial rabbits, and foresee future calamities. Even deities will reveal themselves to you.\n\nUpon completing the hundred-day regimen, you will achieve boundless transformations—sitting may lead to death, standing to immortality—all at your command.\n\n---\n\n**Transformation Talismans**\n**Ghostly Form Talisman (Mengshou Fu)**\nTo assume a towering ghostly form a hundred *zhang* tall, swallow the talisman with water and declare, *\"Grow to a hundred zhang, green-skinned!\"*—all will tremble in fear.\n\n**Ancient Sage Talisman (Laoteng Fu)**\nTo become an elderly sage, swallow the talisman with fragrant water and instantly become a silver-haired elder.\n\n**Heavenly Concealment Talisman (Tianyin Fu)**\nTo vanish, swallow this talisman in daylight—you will become invisible to all. Repeat monthly.\n\n**Battle-Victory Talisman (Zhansheng Fu)**\nIn combat, to render weapons ineffective, burn forty-nine copies of this talisman into ash, mix with thirty-five bowls of water, and administer to soldiers. Their bodies will become unharmed by blades, as hard as iron.\n\n**Divine Army Talisman (Shenbing Fu)**\nBefore battle, use a censer, a bowl of pure water, seven black flags, and a drum. Soldiers must wear black robes over their heads, recite the spell, and inscribe the talisman while visualizing their true *Zhenwu* forms. Burn the talisman, chew the tongue, and mix the blood with the ash and water. Shake the flags, beat the drum, and command the troops to shout *\"Shèng!\"* A north wind will rise, and the soldiers will transform into towering, green-faced, black-armored generals—invincible against a million men.\n\n**Caution:** Do not cross rivers. To do so invites disaster.\n\n**Spell:**\n*\"Bingji Generals, aid my might!\nThousand soldiers bathe—transform divine!\nMountains crumble, seas dry up!\nI bear the True Command—delay not!*\n*As the decree demands, swiftly obey!\"*\n\n---\n**Grass-and-Beans Military Method (Caodou Fa)**\nTo summon grass soldiers and bean horses for boundless warfare, free from worry:\n\nOn the **seventh day of the seventh month** or **fifth day of the fifth month**, draw an ash altar, prepare a fragrant tray with pure water, one *dou* and two *sheng* of large beans, and a bundle of clean grass. Place them at the altar’s center. With disheveled hair, recite the spell from midnight until the fifth watch, then seal the altar.\n\nDaily, purify the room, burn incense, and recite the spell **four hundred ninety times**. Before deploying, silently chant it once. The method will take effect immediately.\n\nFrom the altar’s center, sprinkle the grass and beans with fragrant water while reciting:\n*\"Heaven’s True Edict commands—\nGrass and beans, obey my will!\nTransform into divine soldiers,\nMarch for my campaign!\nSwiftly come, delay not!\nHear my sacred spell—\nAssume your true forms!\nA spray of divine water—\nGrass becomes men, beans become horses!\nAs the decree demands, swiftly obey!\"*\n\nFirst, sprinkle the grass and beans with fragrant water while reciting the spell **seven times**, then spit. Declare over the grass:\n*\"Shelve! Shelve! Shelve! Shelve!\"*\nThen seal the altar.\n\nCarry the *Tianluo Spell* for forty-nine days, reciting it a thousand times daily. Before each recitation, swallow one *Qilingshu* talisman (written in cinnabar at dawn, burned to ash, and taken with water). Then chant the spell.\n\n**Tianluo Spell:**\n*\"Om! Qie Sa Fo, Om! Xi Sa Fo,\nYixia fenfen zhu zhu,\nChike □ nie ya tuo,\nZhituoluo tuoluo om,\nWanglu wanglu yan,\nWuyi yadu, bodu bolu,\nLuniemancha luo,\nHun gouna xie.\"*\n\nWhen reciting, observe strict fasting, bathe, and burn incense. Complete a thousand recitations over forty-nine days.\n\nTake one hundred twenty stalks of grass and one *sheng* and two *ge* of large beans. In a secluded place, scatter the grass widely where no one treads.\n\nTest the method by silently reciting the spell once, wearing the talisman on your head, and spraying water. With a knife, draw seven *zhang*-tall figures and five *zhang*-tall horses in the grass. Adjust numbers as needed.\n\nIf the spell is complete after forty-nine days, you will hear the voices of the grass soldiers—this is verification.\n\n**Deployment Rules:**\nWhen using transformed soldiers in battle, avoid:\n- **East** (forests),\n- **West** (metal),\n- **North** (mountains).\n\nAdhere strictly to these precautions—this is the true **Five Transformations Reversal Method**.",
      "overlap_context": "art Talisman**. Then recite:\n\n*\"Talisman water, pure and clear,\nForm the body of transformation.\nEnter my five viscera,\nAid my spirit essence.\nThousand years unaging,\nTen thousand years unshaken.\nI now invoke this spell,\nTo exchange my mortal shell.\nOne gold pill—ascend to Heaven’s court.\nAs the decree commands, swiftly and without delay.\"*\n\n---\n**Burning the Open Heart Talisman into Ash for Ingestion**\nThis elixir is named **Shell-Swapping Pill** (换壳丹), also called **Ghost-Viewing Pill** (视鬼丹).",
      "start_char": 10280,
      "end_char": 11539,
      "start_sentence": 442,
      "end_sentence": 498,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 14.59879469871521,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\鬼谷子天髓灵文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "据凡人用之，切记返祸矣，急呼急应。 若遇甲子旬，呼六甲神，本命日用银钱细马祭之，依如军令，中要精严。 若得上卷，凡百触犯禁戒，产妇腥血，并不为害。 若曾习六壬遁甲，自知逆顺。 若要归形，将咒倒持一遍，后念还咒一遍，自成草豆。 还真咒曰：草豆灵灵，速化本形。 吾今祝咒，各归太清。 急呼急至，所愿皆成。 急急如律令。 咒毕，噀水喷军，自不见矣。 若军卒要马，但灵神庙宇中焚香借，但用绊综绷子，系一纸马脚根上，如真骑用，自然应用验，过夜依然用草喂之。 勿近秽污水浆傍畔，坏法矣。 借马咒 速仰告应灵神借龙马，足踏青云，千里渡江尘。 急急如律令勑。 庙中焚香，将故纸马毕，各用绯绷子系了。 日行千里不倦，过水解下，过了却系。 如遇敌，若无枪刀，各人持小沙石、土砖瓦，向阵抛掷，当有自损，力加万倍。 若值无粮草，书镍肠符，烧灰向水中饮之，则不饥渴，力加十倍，百日不饥。 马已用之，如用开肠符一道，已如前用，则无害矣。 但若行此之人，但有安净眼前药，心开自晓解一一，精细验用勿差互，万无一失矣。 锁肠符 开肠符 凡欲超凡出世，此书神仙机，长生之径路，祖父子勿传，千金勿示。 太玄妙术，玉帝灵文。 焚香念咒，鬼怕神惊。 人若授者，得福无边。 洞晓乾坤，明达五行，知阴阳逆顺。 若传万载，佑国助君保天下，当有长存，世不俗通。 能晓天之意，善解鬼神机。 但得此书，锦袋盛之，常令供养，乃名山洞府岩穴中，隐闭收藏。 得三五年，有香气出於此地，灵花芝草自然生，金玉成形。 凡有诸鬼祟、邪魅魍魉、狐狸山魅缠绵不去者，但将此书焚香度照，其诸凶祸奔走他乡，粉骨碎形，无不应验。 若有志心人传授，须斋戒良善，清洁不淫，精心信礼，对天尊设誓，积行救人，可以传授。 若传下士庸愚，祸殃九祖。 凡世之万物，惟人最灵最贵，象天地，五行造化成，阴阳交感，精血成就。 故自假合完形、有生死，上圣帝君不能此，寓形宇内亦知归。 往往愚士，历历颇周，不晓造化。 或服金石，望脱壳飞升。 或炼气运用，望延年住世。 或听邪说，居山绝粒。 然是神仙之法，亦有飞升住世。 得此者，宿世灵明之胎，尘努外长生圣体，自感人妙诀，天降长生之卫，变动仙机，通解圣意。 似此观之，万中无一余者。 愚人不知圣理，妄学明人，狂作圣意，累劫白骨，过於须弥山，积世孤魂，北邙饿鬼。 又不知死限目前，由望长生，住世神仙，有限可修，岁远可待。 古今世人，知生不知死，寄尘如盲目登山，居世如夜行涉水。 有恨徒学，没於苦海，吾合留术於世也。 点检法 凡欲长生住世不死之道，须知命运远近，方可修真养命，去除死籍，阴部无名，玉策添字，吾入仙乡，不死之道。 右点检卫，先斋戒沐浴七日，至三月三日未日出时，执刀斧於山中，探荆杖一百二十茎，各长一尺二寸，五色线系之，封裹东南角悬之，勿得触污。 又至五月五日日未出时，又探杜荆杖一十二茎，各长一尺二寸，五色线系之，封最於西北上，勿令触犯。 又七月七日日未出时，依前探荆杖三十枝，各长七寸，五色线系之，悬在东北上，不得触犯。 又九月九日日未出时，又探杜荆杖一十二茎，五色线系之，封吊西南上，勿令犯污。",
      "translated_text": "When practicing this method, ordinary mortals must remember to reverse calamities—call swiftly and respond swiftly.\n\nIf encountering the *jiǎzǐ* decadal period, invoke the **Six Jia Gods**, using silver coins and a fine horse to sacrifice on your natal day, following the military commandments with utmost precision and solemnity.\n\nIf you obtain the upper scroll, all offenses against prohibitions or the blood of childbirth will be harmless.\n\nThose who have studied the **Six Ren and Escape of Jia** will know their own fortunes’ reversals and sequences.\n\nTo restore original form, recite the spell backward once, then chant the return incantation once: *\"Grass and bean, spirit and vital—return to your true shapes.\"* By this, they will dissolve into grass and beans. The return incantation reads:\n\n*\"Grass and bean, responsive and bright,\nSwiftly dissolve to your original forms.\nI now decree with this spell,\nEach returns to the **Tàiqīng** realm.\nCall swiftly, arrive swiftly—\nAll wishes fulfilled.\nAs the **Lǜyìng** commands.\"*\n\nAfter completing the incantation, spray water and scatter the talismans—then they will vanish.\n\nIf soldiers require horses, they may silently implore the **Língshén** temple, burning incense and borrowing a paper horse. With a crimson thread, bind it to the paper horse’s hoof, and when truly needed, it will respond as if ridden. After the night, feed it with grass as before. Avoid impure water or filth nearby—this would ruin the method.\n\n**Borrowing Horse Incantation:**\n*\"Swiftly implore the responsive spirit to borrow the dragon-horse,\nIts hooves tread the azure clouds,\nA thousand leagues cross the dusty river.\nAs the **Lǜyìng** commands.\"*\n\nIn the temple, burn incense and bind the paper horse with crimson thread upon completion.\nA thousand leagues in a day, tireless—\nWhen crossing water, unbind it,\nThen rebind once passed.\nIf encountering foes without weapons,\nEach may seize small sandstones or clay bricks,\nAnd hurl them toward the enemy ranks—\nThey will self-destruct,\nTheir strength multiplied a hundredfold.\n\nIf supplies run low, write the **Open Intestines Talisman**, burn it to ash, and drink it in water—\nThen hunger and thirst will vanish,\nStrength increased tenfold,\nAnd no hunger for a hundred days.\nOnce the horse has been used,\nApply the **Open Intestines Talisman** again—\nAs before, no harm will follow.\n\nBut those who practice this must have the **Pure and Tranquil Eye** elixir,\nTheir minds open to understanding each principle,\nAnd verify its use with precision—\nNo error, no failure.\n\n**Open Intestines Talisman**\n**Pure and Tranquil Eye Talisman**\n\nFor those who seek transcendence beyond the mortal world,\nThis is the **Book of Dao/Way** for immortals,\nThe path to eternal life—\nDo not pass it to descendants,\nNor reveal it for a thousand gold.\n\n**Tàixuān**’s profound art,\n**Yùdì**’s sacred script.\nBurn incense, chant the spell—\nDemons flee, spirits tremble.\nIf given to a worthy soul,\nBoundless blessings follow.\nPiercing the mysteries of **Qiánkūn**,\nMastering the **Wǔxíng**’s reach,\nDiscerning the **Yīnyáng**’s reversals.\nIf passed through ages,\nIt will safeguard the realm,\nAssist the sovereign,\nPreserve the world—\nEternal life granted,\nNone shall know its common ways.\nAble to grasp the **Tian**’s intent,\nSkilled in deciphering the spirits’ designs.\n\nThose who obtain this book must store it in a brocade pouch,\nEver keep it revered,\nHidden in sacred peaks,\nCaverns, or cliffside shrines.\nAfter three to five years,\nFragrant vapors will rise from this place,\nNuminous flowers and herbs grow naturally,\nAnd gold and jade take form.\n\nFor all who suffer from malevolent spirits,\nOr are ensnared by **xiémièi wāngliàng**,\n**húliè shānmèi**—\nBurn this book with incense and illuminate it,\nAnd all calamities will flee to distant lands,\nTheir bones crushed, forms shattered—\nNo spell fails.\n\nIf a sincere disciple seeks to pass this on,\nThey must first observe strict **zhāijiè**,\nMaintain purity without licentiousness,\nDevote their heart in faith and ritual,\nSwear before the **Tiānzūn**,\nAnd accumulate virtuous deeds to aid others—\nThen they may teach.\n\nIf passed to the vulgar and unworthy,\nDisaster will strike nine generations.\n\nAmong all things in the world,\nHumans are the most numinous and precious,\nMirroring **Tiān** and **Dì**,\nBorn of **Wǔxíng**’s transformation,\nShaped by **Yīnyáng**’s interplay,\nTheir vitality and essence perfected.\n\nThus, though they borrow forms and complete their cycles,\nWith life and death,\nEven the **Shàngshèng Dìjūn** cannot alter this—\nTheir spirits return to the cosmos.\n\nYet many fools persist,\nIgnorant of the **Zàohuà**’s workings,\nSome ingesting **jīnshí**,\nHoping to shed their shells and ascend.\nSome cultivate **qi** and vitality,\nSeeking longevity in this world.\nSome follow heretical teachings,\nDwelling in mountains and fasting.\n\nYet even among immortals’ methods,\nThere are those who ascend and those who remain.\nThose who gain this book are born of luminous wisdom in past lives,\nTheir **shèngtǐ** nurtured beyond mortal dust,\nSensing the **Miaojué** of humanity,\n**Tian** bestows eternal guardianship,\nUnveiling the **Yuan**’s mysteries,\nClarifying the **Shèng**’s intent.\n\nSuch is the truth—\nIn ten thousand, not one errs.\n\nFools who do not grasp the **Shènglǐ**,\nBlindly imitating the enlightened,\nMadly forcing the **Shèng**’s will,\nTheir bones turn white through endless kalpas,\nExceeding the **Xūmí** peaks,\nTheir spirits wander lifeless through ages,\nHungry ghosts of the **Běimáng** slopes.\n\nAgain, they do not know death’s limits loom near,\nChasing longevity in vain,\nFor even worldly immortals\nHave bounds to their practice,\nYears to await.\n\nAncient and modern mortals\nKnow life but not death,\nClinging to dust like the blind ascending mountains,\nDwelling in the world like night travelers crossing waters.\n\nSome regret their folly too late,\nDrowning in suffering’s sea.\nI would not leave this art in the world.\n\n**Method of Verification:**\nFor those who seek eternal life and worldly dwelling,\nThey must first know their fate’s distance—\nOnly then may they cultivate the **True Dao** and nourish their lives,\nErase their death records,\nLeave no trace in the **Yīnbù**,\nAdd their names to the **Yùcè**,\nAnd enter the **Xianxiang** without end.\n\n**Right: Verification of the Guardians.**\nFirst, observe **zhāijiè** and bathe for seven days.\nOn the third day of the third month, before sunrise,\nTake an axe and blade to the mountains,\nAnd gather **jīngzhàng** branches—one hundred twenty stalks,\nEach twelve inches long.\nBind them with five-colored threads,\nWrap and suspend them in the southeast corner—\nDo not let them touch impurity.\n\nAgain, on the fifth day of the fifth month, before sunrise,\nGather twelve stalks of **dùjīng**,\nEach twelve inches long,\nBind them with five-colored threads,\nWrap and suspend them in the northwest—\nDo not let them be defiled.\n\nOn the seventh day of the seventh month, before sunrise,\nAs before, gather thirty stalks of **jīngzhàng**,\nEach seven inches long,\nBind them with five-colored threads,\nAnd suspend them in the northeast—\nDo not let them be violated.\n\nOn the ninth day of the ninth month, before sunrise,\nAgain gather twelve stalks of **dùjīng**,\nBind them with five-colored threads,\nWrap and suspend them in the southwest—\nDo not let them be sullied.",
      "overlap_context": "your head, and spraying water. With a knife, draw seven *zhang*-tall figures and five *zhang*-tall horses in the grass. Adjust numbers as needed.\n\nIf the spell is complete after forty-nine days, you will hear the voices of the grass soldiers—this is verification.\n\n**Deployment Rules:**\nWhen using transformed soldiers in battle, avoid:\n- **East** (forests),\n- **West** (metal),\n- **North** (mountains).\n\nAdhere strictly to these precautions—this is the true **Five Transformations Reversal Method**.",
      "start_char": 11539,
      "end_char": 12793,
      "start_sentence": 499,
      "end_sentence": 552,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 21.698216199874878,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\鬼谷子天髓灵文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "右四次，将荆枚各吊方位，不得交杂不洁，勿令人知见。 至十二月一日夜，取四位荆杖於净室中，供养持咒，常夜不关。 夜用红花油灯七盏，九蒸九曝灯心二十一茎，然灯七盏，香花、果茶、净水各七分。 从月一日夜，供养判杖，常夜焚香，念咒七遍，香度荆杖，咒曰：灵荆军荆，土木长成。 五伟今向祭，要汝知之。 知某年命，现在灵荆。 十月则现，限到无形。 吾今祝咒，听吾令行。 急急如律令。 右从十二月一日夜起，如法供养，念咒七遍，常夜不阙。 至十二月三十日，小尽二十九日，守至年除日五更初时，灯七盏，合为十一盏，於室内无人知见，独自西北持咒一遍，跪坐将灯，向南明照一骈白璧。 或屏面，将先一百二十茎荆杖，除当年外数，手持一枝向灯，其影现壁上便过，再捻一枝如前，至命终尽之年，其荆影不现，用纸笔记之。 次将第二次采者十二茎刑杖，香上度过，祝曰：敢告杜荆，愿吾祈月。 如前照之，至限无影，亦以记之。 次收第三采者三十茎，依前告祝，至限上无影记之。 次取第四采者一十二茎，依前祝告，至限无影，切记纸笔。 将荆杖斗下烧之，将灰并献祭，并随流水去之。 积功修行，至限尽年月日，用鬼谷子还生法禳之，死籍除名，长生住世。 不记年月，入仙之道，与天地同毕，共山河齐年。 自古达士，皆行此法，长生成就。 还生禳死法，至限年月日前，斋戒沐浴，於净室内，铺席稿二寸，厚枕七寸，头南，绝粒不语，卧七日，服铄肠符。 至限前一日，於合作坟处，掘地探二丈四尺，墓前棺椁，五谷各一升，二合放棺内。 至日，棺内南首卧，伸足。 至时都假符，要五谷枇内，辰下散发，右手握黄土一把，口内含水饭一口，左手恰乾亥地字。 出坟向鬼门，足踏七星步便去，勿回头。 千里外阴部除名，玉榜上添名，世人皆见死矣。 此禳假还生法，勿泄天机。 唐时军人候独翁，得此法禳之，住世九百二十七岁，白日驾朱鹤飞升。 至后诸仙经内，并不载此术。 七星禹步、锁肠符，并於卷前，不重载。 都假神符，合付於右前，用手内土、口中饭，离百二十步，去之无畏。 都假符 右件前符，用十二月，绝养己身，一道朱书展於棺内，载於己形，皆不见自己身死於此也。 造化灵药 此药乃神异之书，有通神验圣奇术，惊耳骇目之灵。 方观其夏雪冬雷，兴云致雨，隐形匿貌，变白延年，有谓药术之精微，天书之玄妙者，愚人得之乐然。 尔如磁石引针，琥珀拾芥，河车伏汞，褕耳采金，阳燧取火，獭胆分杯，蟹黄聚鼠，奇方岂是圣欤？ 盖以药性相扶，气类相感，使之然也。 此方鬼谷先生所载，又兼前术。 时有验者，多乃拣去，焦为秘要药术。 摘太清之玄章，遂以墨子之要心，搜世药幽微，乃术於世，秘密流传，以成天髓灵经，还性命。 若有其人，我死未满七日，然已死未烂坏者，服一丸者，无不活矣。 如人患将死，与一丸无不效，以三丸纳口中，须臾便活。 口齿灌药，无不活。 有邪鬼，带一粒立去。 如修合，先须斋戒。 如健人服之，延年不老，名之日太一返魂丹。 雄黄，雌黄，丹砂。 各十二分。",
      "translated_text": "The fourfold ritual—suspended **jīngzhàng** and **dùjīng** in their respective cardinal directions—must remain untainted, unseen by others.\n\nOn the first day of the twelfth month, at night, retrieve the four directional **jīngzhàng** from the purified chamber. Offer them with incantations, keeping the lamps burning through the night.\n\nUse seven red-flower oil lamps, twenty-one **jiāngxīn** (wax wicks) subjected to nine steams and nine sun-bakes, lighting seven lamps. Offer seven portions each of incense, flowers, fruit, tea, and pure water.\n\nFrom the first night of the month, offer the **pànzhàng** (judgment rods), burning incense continuously and reciting the spell seven times, fumigating the **jīngzhàng** with it. The incantation reads:\n\n*\"Spiritual **jīngzhàng**, mighty **jīngzhàng**,\nEarth and wood flourish in growth.\nThe Five Powers now summon you—\nI command you to know this:\nThe fate of the year [so-and-so],\nNow bound in spiritual **jīngzhàng**.\nManifest in the tenth month,\nVanish when the limit is reached.\nI now invoke this spell—\nObey my command as law.\nSwiftly, as the precepts decree.\"*\n\nFrom the first night of the twelfth month onward, maintain the ritual offerings and recite the spell seven times without interruption.\n\nBy the twenty-ninth day of the twelfth month, on the eve of the New Year’s dawn (fifth watch), light seven lamps, combining them into eleven. In seclusion, unseen by others, kneel facing northwest and recite the spell once. Sit upright, holding the lamps, and illuminate a pair of white jade discs placed to the south.\n\nAlternatively, veil your face and take the first batch of **120 jīngzhàng** (excluding the current year’s count). Hold one stalk toward the lamp—when its shadow appears on the wall, pass it over. Repeat with another stalk in the same manner. When the year of one’s death arrives, if the **jīngzhàng**’s shadow does not appear, record it.\n\nNext, take the second batch of twelve **xíngzhàng** (punishment rods), fumigate them with incense, and intone:\n*\"I solemnly declare to the **dùjīng**—\nGrant my plea in this lunar month.\nAs before, illuminate them—\nWhen the limit is reached and no shadow appears, record it.\"*\n\nProceed likewise with the third batch of thirty stalks, reciting the invocation until no shadow manifests—record it.\n\nThen take the fourth batch of twelve stalks, reciting the invocation as before. When no shadow appears at the limit, meticulously record it in writing.\n\nBurn the **jīngzhàng** in a cauldron, offering the ashes in sacrifice and scattering them into flowing water.\n\nThrough accumulated merit and practice, when the allotted year, month, and day arrive, employ the *Ghost Valley Master’s Revival Technique* to avert death. Erase your name from the death registry, achieve immortality, and dwell in the world. If the year is forgotten, enter the Dao of the Immortals, aligning with Heaven and Earth, equal in years to mountains and rivers.\n\nSince ancient times, accomplished sages have practiced this method, attaining longevity and fulfillment.\n\n**The Revival Technique to Avert Death:**\nBefore the allotted year, month, and day, observe strict fasting and purification. In a clean chamber, lay out a mat two inches thick and a pillow seven inches high. Face south, abstain from food and speech, and lie down for seven days while ingesting the *Locking the Intestines Talisman*.\n\nOn the day before the limit, at the burial site, dig a pit two *zhang* (twelve feet) deep. Place a coffin before the grave, filling it with one *sheng* (eight ounces) each of the five grains and two *ge* (two ounces) of rice. On the appointed day, lie within the coffin, facing south, feet extended.\n\nAt the critical hour, don the *False Death Talisman*, place the five grains inside the coffin, and at the *chen* hour (7–9 AM), scatter your hair. With your right hand, grasp a handful of yellow earth, and hold a mouthful of water and rice in your mouth. Your left hand should form the *Gān-Hài* (乾亥) earth trigram.\n\nExit the grave toward the Ghost Gate, stepping on the *Seven-Star Yu Step* as you depart—never look back. Your name will be erased from the underworld registry, and your name inscribed on the Jade Roll, though mortals will see you as dead.\n\nThis is the *False Death Revival Technique*—do not divulge this celestial secret.\n\nDuring the Tang dynasty, a military officer named *Dú Wēng* practiced this technique and lived for 927 years before ascending in broad daylight on a red crane.\n\nLater scriptures of the immortals make no mention of this art.\n\nThe *Seven-Star Yu Step* and *Locking the Intestines Talisman* are recorded at the beginning of this scroll and are not repeated here.\n\nThe *False Death Talisman* is enclosed in the preceding section. Use the earth in your palm and the rice in your mouth, discarding them at a distance of 120 steps—no fear shall come.\n\n**False Death Talisman:**\nThe preceding talisman must be used in the twelfth month while abstaining from nourishment. Write it in vermilion and place it in the coffin, aligning it with your form—thus, you will not see your own death.\n\n**Divine Elixir of Transformation:**\nThis is a divine and wondrous formula, containing miraculous techniques that communicate with spirits and verify the sacred. It astonishes the ears and startles the eyes—summoning summer snow and winter thunder, conjuring clouds and rain, concealing form and altering appearance, extending life in white vitality. Some say it is the essence of alchemical refinement, the profundity of celestial scriptures. The unenlightened, obtaining it, rejoice exceedingly.\n\nAs with the magnet drawing needles, amber attracting dust, the *River Chariot* subduing mercury, the *Rú-ěr* (褕耳) extracting gold, the *yang yu* (阳燧) capturing fire, the otter’s bile dividing wine, crab yellow gathering rats—are these not marvels beyond mortal skill? It is because medicinal natures support one another, and *qi* affinities resonate in harmony, making such feats possible.\n\nThis formula was recorded by Ghost Valley Master and combines earlier techniques. Those who have verified its efficacy often omit it, deeming it the supreme secret of alchemical arts.\n\nExtracting the *Tàiqīng* (太清) Mysterious Chapter, it employs the *Mòzǐ* (墨子) essence of the heart, searching the world for the subtlest medicinal arts. Thus, the *Heavenly Marrow Divine Elixir* was refined, restoring essence and vitality.\n\nIf one exists who has died but not yet decayed within seven days, administering a single pill will revive them without fail. If a dying person is given one pill, they will surely recover. With three pills placed in the mouth, they will revive in moments. Even if administered through the teeth, life will return.\n\nAgainst malevolent spirits, carrying a single grain will drive them away.\n\nBefore preparation, strict fasting and purification are required.\n\nIf taken by a healthy person, it grants longevity and immortality—named the *Tàiyī Returning-Soul Pill*.\n\n**Ingredients:**\n- *雄黄* (Realgar): 12 *fèn* (分)\n- *雌黄* (Orpiment): 12 *fèn*\n- *丹砂* (Cinnabar): 12 *fèn*",
      "overlap_context": "rap and suspend them in the northwest—\nDo not let them be defiled.\n\nOn the seventh day of the seventh month, before sunrise,\nAs before, gather thirty stalks of **jīngzhàng**,\nEach seven inches long,\nBind them with five-colored threads,\nAnd suspend them in the northeast—\nDo not let them be violated.\n\nOn the ninth day of the ninth month, before sunrise,\nAgain gather twelve stalks of **dùjīng**,\nBind them with five-colored threads,\nWrap and suspend them in the southwest—\nDo not let them be sullied.",
      "start_char": 12793,
      "end_char": 13975,
      "start_sentence": 553,
      "end_sentence": 601,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 18.71861433982849,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\鬼谷子天髓灵文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "置於生竹筒中，埋地中。 丹砂用竹筒，埋在南面，雌黄在此，雄黄在中心，各一竹筒。 口以云母粉塞之，土三寸盖竹筒头上，用灰火烧七日七夜，化为水花。 未化，再用火气呵，取成为限。 右将三水，置铜器之中，夜於露中日出取之。 又下井水三尺内，三水中入天雄末五升，修养药，候红色，一九如十二升鲤鱼目，大金器盛之。 部老松根养三年，后以祭之。 而收依前秘法用之。 驱役灵魂 凡用纸人之法，须晓鬼神之机。 呼便自在，出入行厨，随意东西，要者之物，所取皆得。 先通犯法欲死之人，已前酒食思之，各得其名姓、年月日时，欲赴法见一面，与钱纸劝酒，其犯法人须谢言之，意便向死人道与，公即曰：无恩，为公灵明，故来相访。 既君知意，与聚魂符一道，暗与丸抛酒中，与饮，之罢，言：汝欲命断，归声而来。 其人知意，法场对面五十步高望见处，手执大镜一面，周围一尺二寸，明照着犯之人，镜面上书招魂符，欲视刀过命，既念咒。 咒曰：奉请北方犯法之人一炁。 念三遍，取炁吹於镜内，用白练曩镜，至净室中。 此夜用三盏香美酒食祭之，於傍将镜对灯，咒曰：真魂灵明，速现本形。 吾今向祭，要用随声。 魂魄勿散，救汝还生。 念毕，将镜执向灯前，现唤其名姓，与其酒祭食，彩画其像，暗处常以向祭，香花供养。 要使用，剪纸人长七寸，呼名立至，付其纸人。 如其人使用无异，垒七人，可以动用驱使。 其招魂聚魂二符，令人魂魄不散，为九饮之。 招魂符 归魂符",
      "translated_text": "Place the ingredients in a living bamboo tube and bury it underground.\n\nFor **Cinnabar** (*Dan sha*), use a bamboo tube buried on the **south side**; for **Orpiment** (*Ci huang*), place it nearby; and for **Realgar** (*Xiong huang*), position it at the center, each in its own bamboo tube. Seal the openings with **mica powder** (*Yun mo fen*), cover the top with three inches of soil, and burn with **ash-fire** (*Hui huo*) for seven days and seven nights until it transforms into **liquid essence** (*shui hua*). If it has not yet transformed, exhale **fire-qi** (*huo qi*) upon it again, and take it when the desired effect is achieved.\n\nNext, gather the three **liquid essences** (*san shui*) and place them in a **copper vessel** (*tong qi*), leaving it in the **dew** (*lu*) overnight and retrieving it at dawn.\n\nThen, take **well water** (*jing shui*) from three feet deep and mix it with **five *sheng*** of **powdered *Tian xiong*** (male Realgar or *Strobilanthes cusia* powder), refining the **elixir** (*xiu yang yao*). When it turns **red**, shape it into **twelve *sheng*** of **koi fish scales** (*li yu mu*), storing it in a **large golden vessel** (*da jin qi*). Nurture it with **aged pine roots** (*bu lao song gen*) for three years before using it in ritual.\n\nCollect and store it according to the previous **secret method** (*mian fa*) to command **spirits** (*ling hun*).\n\n**Summoning and Subduing Spirits** (*Qu yu ling hun*)\nFor all methods using **paper effigies** (*zhi ren*), one must first understand the **mechanisms of ghosts and gods** (*gui shen zhi ji*).\n\nWhen summoned, they will appear at will, entering and exiting the kitchen, moving freely east and west, and taking whatever is desired. First, identify the **transgressor** (*fan fa zhi ren*) who is about to die. If they have previously consumed alcohol or food, note their **name, surname, age, month, day, and hour** (*ming xing, nian yue ri shi*). If you wish to meet them before their execution, offer **money and paper** (*qian zhi*) to persuade them with wine. The transgressor must then express gratitude, and you will secretly instruct the condemned person in their mind. The condemned will say: *\"No debt—it is your luminous spirit (*ling ming*) that compels me to visit you.\"*\n\nOnce the condemned understands, give them a **Gather-Spirit Talisman** (*ju hun fu*) along with the pill, and secretly toss the pill into the wine. After drinking, say: *\"You wish your fate to be sealed—your voice has summoned me here.\"* The condemned will then appear at the **execution grounds** (*fa chang*), fifty steps away, where you hold a **large mirror** (*da jing*) one foot wide, its face inscribed with the **Summon-Spirit Talisman** (*zhao hun fu*). If they are about to be beheaded, recite the **incantation** (*zhou*) upon seeing them.\n\n**Incantation** (*Zhou*):\n*\"I humbly invoke the transgressor from the North—one *qi* (*zhi yi*).\"*\nRecite this three times, then blow their **spirit-qi** (*hun po*) into the mirror. Wrap the mirror with **white silk** (*bai lian*) and take it to a **pure chamber** (*jing shi*).\n\nThis night, offer **three cups** (*san zhan*) of **fragrant wine** (*xiang wei jiu*) and **delicious food** (*mei shi*) in sacrifice. Place the mirror beside a lamp and recite:\n*\"True spirit (*zhen hun*), luminous and clear, quickly manifest your original form (*ben xing*).*\n*I now sacrifice to you—use the voice that summoned me.*\n*Do not scatter your spirit (*hun po*), but save yourself and return to life (*huan sheng*).\"*\n\nAfter reciting, hold the mirror before the lamp, calling out their **name and surname** (*ming xing*), and present the **sacrificial wine and food** (*jiu ji shi*), along with a **colorfully painted likeness** (*cai hua qi xiang*). In darkness, continue to sacrifice them with **incense and flowers** (*xiang hua gong yang*).\n\nIf you wish to employ them, cut a **paper effigy** (*zhi ren*) seven inches long, summon their name, and have it stand before them. If they respond without hesitation, prepare seven such effigies to animate and command them.\n\nThe **Summon-Spirit Talisman** (*Zhao hun fu*) and **Return-Spirit Talisman** (*Gui hun fu*) will prevent their spirit from scattering, allowing them to be **nine libations** (*jiu yin*)—a ritual offering of nine cups.",
      "overlap_context": "y will surely recover. With three pills placed in the mouth, they will revive in moments. Even if administered through the teeth, life will return.\n\nAgainst malevolent spirits, carrying a single grain will drive them away.\n\nBefore preparation, strict fasting and purification are required.\n\nIf taken by a healthy person, it grants longevity and immortality—named the *Tàiyī Returning-Soul Pill*.\n\n**Ingredients:**\n- *雄黄* (Realgar): 12 *fèn* (分)\n- *雌黄* (Orpiment): 12 *fèn*\n- *丹砂* (Cinnabar): 12 *fèn*",
      "start_char": 13976,
      "end_char": 14564,
      "start_sentence": 602,
      "end_sentence": 626,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 13.679030179977417,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\鬼谷子天髓灵文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "取六月一日鸾巢中雏口中虫七枚，萤火虫七枚。 三月三日，取科斗一十四枚，阴乾。 乌卵开破，去黄留清，将未投中却封了，令鸡抱之，其鸡叫也。 盛取去密器中盛之，如用取一大豆来，津唾涂於顶上，夜有百尺霞光，昼有紫云。 如置药指甲中，则指物色如箭。 如射用蟾血和涂身，夜作一块，火置口中，唾则亦火出。 六甲日造，如要烧一切舍屋，诸应情烧物，用药一刀圭书，涂上至夜则火，无救。 如将小石，置药少许，沉在井则火生，於井底水无害。 要起毫象白气 凡欲眉间现毫，顶生白气，盖乃先圣之作也，非凡俗所干。 今用之药，亦是受日月之精华。 天地之秀气，成物之饵，可以造化而成。 故鬼谷先生留术，秘之勿泄。 真阳起石，十铢。 云母石，七铢。 白英石，四铢。 铅白霜，一分。 海浮石。 一钱。 右件各以温酒洗过，庚申日捣为粉，辛日用白蟾蜍喉下有八字一枚，去肠安在中。 又海蜊蛤，如蚌大者二枚，磨令一合，封蜜安在内，置泉水中，养七七日药成，候泉出白气聚之成也。 如日未足，封中有水，再取拭乾，用蜡固济封口，停之则自成也。 去海蛤蜍，只取药，停於银合，勿透气。 如欲现毫，将药置一麻子大，用津唾涂於眉间，白光自现，毫象光辉。 如将一米大置茶酒中，从盏中光起数尺。 置指中，向日光，从指中顶上白炁。 置诸物，亦以现光也。 登波卫",
      "translated_text": "「On the first day of the sixth month, collect seven maggots from the mouths of young cranes (*luán cháo*) in their nests, and seven glowworms (*yíng huǒ chóng*). On the third day of the third month, gather fourteen *kēdǒu* (a type of beetle), and dry them in the shade.\n\nCrack open crow eggs (*wū luǎn*), discard the yolks, and retain the clear parts. Seal them before they are fully immersed, and place them under a hen for incubation. The hen will crow when the process is complete.\n\nStore the collected materials in a concealed vessel. When using, take one large soybean and apply saliva (*jīn tuò*) to the top of it. At night, it emits a radiance a hundred feet long, and by day, a purple cloud appears.\n\nIf placed in the fingernails, the nails will glow like arrows when pointed at objects.\n\nFor shooting purposes, mix the medicine with toad blood (*chán xuè*) and apply it to the body. At night, it forms a glowing mass; when placed in the mouth, saliva will also ignite.\n\nPrepare the medicine on *liù jiǎ rì* (the sixth day of the sixth lunar month). If you wish to burn all dwellings and structures, or any specific objects, write the formula with a single *rìyuè* (a unit of weight, roughly 3.75 grams) of the medicine and apply it. By night, it will ignite, leaving no means of salvation.\n\nIf you place a small stone with a bit of the medicine inside a well, fire will arise, yet the well water will remain unharmed.\n\nTo summon the *máo xiàng* (hairy apparition, or spirit form), and manifest white *qì* (vapor/essence):\nWhenever one desires to display a hairy apparition between the eyebrows or generate white vapor from the crown, this is the work of the ancient sages (*xiān shèng*), not something common folk can undertake.\n\nThe medicine used here is also derived from the essence of the sun and moon (*shòu rìyuè zhī jīnghuá*), the refined *qi* (vital energy) of heaven and earth (*tiān dì zhī xiùqì*), and the bait of things (*chéng wù zhī ěr*), capable of transforming and creating.\n\nThus, Master Ghost Valley (*Guǐgǔ xiānshēng*) kept this technique secret, never revealing it.\n\n*Zhēnyáng* (true yang stone): ten *zhǔ* (a unit of weight, roughly 3.75 grams).\n*Yúnmǔ* (cloud mother stone): seven *zhǔ*.\n*Bái yīng* (white eagle stone): four *zhǔ*.\n*Qiān bái shuāng* (lead white frost): one *fēn* (a tenth of a *liǎng*, roughly 0.375 grams).\n*Hǎi fú* (sea float stone): one *qiǎn* (a unit of weight, roughly 3 grams).\n\nAll the above ingredients should be washed with warm wine (*wēn jiǔ*) on a *gēngshēn rì* (a day in the sexagenary cycle bearing the characters 庚 and 申), then ground into powder. On the *xīn rì* (the next day in the cycle), use the white toad (*bái chán é chī*) with eight characters inscribed on its throat, and place its intestines in the center.\n\nAdditionally, take two large *hǎi lí gé* (sea snails, similar to clams), grind them into a paste the size of one *hé* (a unit of volume, roughly 1/10 of a *shāng*, about 10 ml). Seal the paste with honey and place it in spring water, nurturing it for seventy-seven days until the medicine is complete, marked by the white vapor gathering from the spring.\n\nIf the days are insufficient, and there is still water in the seal, take it out, wipe it dry, and use wax to secure and reseal the container. Leave it, and it will naturally complete.\n\nRemove the sea snail and toad, and use only the medicine, storing it in a silver dish without letting any air in.\n\nIf you wish to manifest the hairy apparition, place a grain of the medicine the size of a hemp seed (*má zǐ*), apply saliva to it, and place it between the eyebrows. A white light will appear, and the apparition will shine radiantly.\n\nIf you place a grain the size of a rice kernel in tea or wine, a light will rise from the cup several feet high.\n\nPlaced on the finger and exposed to sunlight, a white glow will emanate from the fingertip.\n\nPlaced on various objects, it will also manifest light.\n\nThis is the *Dēngbō Wèi* (Illuminating Barrier Technique).」",
      "overlap_context": " with **incense and flowers** (*xiang hua gong yang*).\n\nIf you wish to employ them, cut a **paper effigy** (*zhi ren*) seven inches long, summon their name, and have it stand before them. If they respond without hesitation, prepare seven such effigies to animate and command them.\n\nThe **Summon-Spirit Talisman** (*Zhao hun fu*) and **Return-Spirit Talisman** (*Gui hun fu*) will prevent their spirit from scattering, allowing them to be **nine libations** (*jiu yin*)—a ritual offering of nine cups.",
      "start_char": 14564,
      "end_char": 15101,
      "start_sentence": 627,
      "end_sentence": 654,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 13.039250612258911,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\鬼谷子天髓灵文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "右件，取五月五日黑蜘蛛十枚。 如至日，即难得时，可以预分布人，亦使捕之。 至其日暮，着一不津器中，以猪脂二合在内，蜘蛛自当食脂尽。 至七月七日，取水马七枚，水上长脚者是也。 复和上件虫物一处於瓶中，埋舍北，阴乾百日。 值成日，取药置在竹筒中盛，如江河急难，取一刀圭涂足下，走水如登大石。 诸经少有载者，无圣二卫，不同常衍。 启扉卫 右建日夜半子时，取小兄墓上木，禹步斩之，向北削长七寸三分，将五采衣密藏之。 用披头发，以手摩门户即自开，并一切锁钥。 又五月五日，取黑犬舌并齿，阴乾。 以虎脂涂百人手，持之辰行，入人家不能见，手捉犬尾，不吠不咬人指，外人不能起，睡人不觉也。 勿泄非人，此法记耳。 脱壳现形术 凡行此术者，先於静室内置坐位，面前吊大镜一面。 从甲子日起，每日净心对镜中形象，行住坐外，想在己身，目前在真形。 早辰先服分神散，后对炼神，行四十九日，常想留一神在镜中，书现形符一道在镜面上，埋於大门，上深七尺七寸，瓮器中物盖之。 欲起形时，令将小镜子，书现形符於镜面上，吹气一口，悬於室中，任意东西。 去住室中，自有己一身，或坐或卧或立，收镜，自己收之，他人即见，见之合一身也。 炼壳分神散 蛇退皮，一条全者，五月五日收。 蝉壳，七枚全者，六月六日收。 龙骨，一两，七月七日。 白茯苓，一两。 茯神，一两。 远志，一两。 人参，一两。 熏陆花，一钱。 伏翼心。 一具，酒洗焙乾。 右件为细末，每服一钱。 吃药时，并不得吹搅。 吃至十日，觉昏沉，是验也。 服之四十九日为定，更不重复，余药随镜埋。 现形符 右件，将此符朱砂书於镜上，想如已身在镜，吹炁符上，自然视现於此符。 绝上书时，勿触犯云。 一一精诚，炼形镜内，足四十九日要成。 如是不虔恪，则难成矣。 一人分身，如前说坐卧之法，坐则倚壁低吊镜，卧则横符，立则高悬，想己身之法也。 异容 若人有危难不测之灾，未能建法成就，急速异形，遽闪一难，须用此术。 故笠子，一个。 烧号丹，一分。",
      "translated_text": "The following methods are recorded:\n\nFor the **Illuminating Barrier Technique (登波卫)**:\nTake ten black spiders on the fifth day of the fifth month. If the day arrives and they are difficult to obtain, distribute people beforehand to capture them. At dusk on that day, place them in a dry container with two *hè* of pig fat inside; the spiders will consume the fat completely.\n\nOn the seventh day of the seventh month, take seven *shuǐmǎ* (water horses)—those with long legs growing on water—and mix them with the aforementioned insects in a bottle. Bury the mixture in the north, letting it dry in the shade for a hundred days. When the medicine is ready, place it in a bamboo tube. In cases of urgent river crossings, apply a knife-shaped piece of the medicine to the soles of the feet; walking on water will then be as easy as stepping on large stones.\n\nFor **Opening the Gate Technique (启扉卫)**:\nAt midnight on the *jiǎnrì* (established day, i.e., the first day of the month), take wood from a younger brother’s grave, cutting it with the *Yǔbù* (Turtle Step) ritual stance. Facing north, carve it to a length of seven *cùn* and three *fēn*, then conceal it in a five-colored garment. Use it to part one’s hair, then rub the door or lock with it—they will open automatically, including all keys.\n\nAdditionally, on the fifth day of the fifth month, collect the tongue and teeth of a black dog, drying them in the shade. Rub a person’s hands with tiger fat, and at the appointed hour, they may enter a household unseen. Grasping a dog’s tail, the dog will neither bark nor bite; outsiders will be unable to rise, and sleeping people will remain unaware. Do not reveal this to others—this method is to be kept secret.\n\n---\n\n**Shell-Shedding, Manifesting True Form Technique (脱壳现形术):**\n\nFor those practicing this technique, first arrange a seat in a quiet chamber with a large mirror hung before it. Beginning from the *jiǎzǐ* day (first day of the sexagenary cycle), each day face the mirror with a pure mind, maintaining awareness of one’s form in reflection—whether standing, sitting, or lying down—imagining the true self within. In the morning, first take the *Fēnshén Sǎn* (Dividing Spirit Powder), then refine the spirit. For forty-nine days, consistently visualize leaving one’s spirit in the mirror. Inscribe a *Xiànxíng Fú* (Manifesting Form Talisman) on the mirror’s surface, burying it at the main gate seven *chǐ* and seven *cùn* deep in a jar, sealed with a lid.\n\nWhen ready to manifest the form, take a small mirror, inscribe the talisman on its surface, blow onto it once, and suspend it in the room. Moving freely east or west, one’s body will remain in the chamber—sitting, lying, or standing as desired. Retrieving the mirror will cause the reflection to vanish, while others will see only a single body.\n\n**Dividing Spirit Powder (炼壳分神散):**\n- One whole *shétuìpí* (snake shed skin), collected on the fifth day of the fifth month.\n- Seven whole *chánké* (cicada shells), collected on the sixth day of the sixth month.\n- One *liǎng* of *lónggǔ* (dragon bone), collected on the seventh day of the seventh month.\n- One *liǎng* of *báifúpíng* (white poria).\n- One *liǎng* of *fúpíng* (poria).\n- One *liǎng* of *yuǎnzhì* (polygala).\n- One *liǎng* of *rénshēn* (ginseng).\n- One *qiān* of *xūnlùhuā* (aloe).\n- One set of *fúyìxīn* (bat wings), washed with wine and dried.\n\nGrind these into a fine powder. Each dose: one *qiān*. When taking the medicine, do not blow or stir it. After ten days, drowsiness will appear—this is the sign of efficacy. Complete the regimen in forty-nine days without repetition; any remaining powder should be buried with the mirror.\n\n**Manifesting Form Talisman (现形符):**\nInscribe this talisman with cinnabar on the mirror, visualizing oneself within it. Blow *qi* onto the talisman—your image will naturally appear there. When writing this talisman, avoid touching it.\n\nWith unwavering sincerity, refine the form within the mirror. Forty-nine days are required for completion. If not practiced with reverence, success will be difficult.\n\nTo divide the body as described earlier, sit leaning against a wall with the mirror hung low, lie with the talisman horizontally, or stand with it suspended high—always visualizing the self as instructed.\n\n**Changing Appearance (异容):**\nIf one faces sudden, unforeseen disaster and cannot yet complete the techniques, this method allows for rapid transformation to evade a single calamity. Take:\n- One *lìzǐ* (straw hat).\n- One *fēn* of *shāohàodān* (burning number elixir).",
      "overlap_context": "n of the medicine the size of a hemp seed (*má zǐ*), apply saliva to it, and place it between the eyebrows. A white light will appear, and the apparition will shine radiantly.\n\nIf you place a grain the size of a rice kernel in tea or wine, a light will rise from the cup several feet high.\n\nPlaced on the finger and exposed to sunlight, a white glow will emanate from the fingertip.\n\nPlaced on various objects, it will also manifest light.\n\nThis is the *Dēngbō Wèi* (Illuminating Barrier Technique).」",
      "start_char": 15101,
      "end_char": 15919,
      "start_sentence": 655,
      "end_sentence": 698,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 13.154131889343262,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\鬼谷子天髓灵文.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "白马蹄甲，一个，烧灰。 萨子花，阴乾。 老章鹿根，二两。 翼翅，一对，烧灰。 右件六味，各为细末，将一半置青胆中，悬东门七十日。 如急，夜去一核大药，用津唾涂於面上，明日妻、男认不得。 更将前散药，时面东调，时不得睡，搅吃不得吹，家属不识矣。 知命丹 若人修真习道，须知死，此药则有验。 或前七日，药鼻中出，有神圣之灵。 辰砂，一钱。 雄黄，乳香，青木香，安息香，一钱。 伏神，一钱半。 远志，一钱。 石违，一钱。 荜澄茄，一钱。 人参，一钱半。 莲子仁，七个。 太一禹余粮。 一个。 右件一十二味，并依州土持，择净。 於甲子日辰时，不得鸡犬妇人见，面向束，不语，捣罗为末，用石蜜和成块。 念三清玉帝敕三万遍，捣三万杵，於东南井内，离水一尺。 至戊子日，丸为鸡头大。 至后一旬甲子日甲辰，面东焚香，念本命星官三百遍，吞一丸，水下，并不得食五辛、酒肉、房色。 至命尽七日前，其药从鼻中出，或梦中人告之。 自吃药至命尽，并不染疾，立坐而化，秘之。 此书盖天下之玄文中髓，自古及今，超凡出世。 掌国高贤，皆以得甚妙，自晓天文，得其至道。 如得此者，亦非今遇，盖是宿缘。 莫能人视，福应无边，收者吉昌。 世有金玉，非为至宝。 有神王，万载昌，秘之。 鬼谷子天髓灵文卷下竟",
      "translated_text": "**Changing Appearance (异容) – Continued:**\n\n- White horse hoof nails, one, burned to ash.\n- *Sàzi* flower, dried in shade.\n- Old *zhānglù* deer root, two *liǎng*.\n- Bat wings, one pair, burned to ash.\n\nCombine these six ingredients into fine powders. Place half within a green gallbladder, suspending it at the eastern gate for seventy days.\n\nIf urgent, take a kernel-sized portion of the powder, mix with saliva, and apply to the face. The next day, even wife and son will fail to recognize you. Stir the remaining powder with the face toward the east, never sleeping, never stirring it while eating, never blowing on it—your household will not recognize you.\n\n---\n\n**Knowing the Hour of Death (知命丹):**\nIf one cultivates the Dao and practices the Way, one must know when death approaches. This elixir proves its efficacy.\n\nPerhaps seven days before death, the medicine will emerge from the nostrils, revealing divine and sacred essence.\n\n- Cinnabar, one *qián*.\n- Realgar, one *qián*.\n- Frankincense, one *qián*.\n- Green wood fragrance, one *qián*.\n- Styrax, one *qián*.\n- *Fúshén* (possibly *Fúshén* root or *Fúshén* herb), one and a half *qián*.\n- *Yuánzhì* (polygala), one *qián*.\n- *Shíwéi* (possibly *Shíwéi* stone or *Shíwéi* herb), one *qián*.\n- *Bìchéngjié* (possibly *Bìchéngjié* herb), one *qián*.\n- Ginseng, one and a half *qián*.\n- Lotus seeds, seven.\n- *Tàiyī Yǔyúliáng* (possibly *Yǔyúliáng* stone or mineral), one.\n\nGather these twelve ingredients according to local soil conditions, purifying them thoroughly.\n\nOn a *jiǎzǐ* day at the *chén* hour, ensure no chickens, dogs, women, or others witness the process. Face south, remain silent, grind and sift into a powder, and knead with rock honey into a block. Recite the edict of the Three Pure Ones (Sanqing) thirty thousand times, grinding it thirty thousand times, then place it in a southeast well, one *chǐ* above the water.\n\nBy the *wùzǐ* day, form into pills the size of a rooster’s head. On the next *jiǎzǐ* day at the *chén* hour, face east, burn incense, and recite your natal star’s official name three hundred times before swallowing one pill with water. Abstain from the five pungent spices, alcohol, meat, and sexual activity.\n\nSeven days before death, the medicine will emerge from the nostrils, or a person will reveal it in a dream. From the time of ingestion until death, no illness will afflict you—you will ascend seated or standing. Keep this secret.\n\nThis text is the marrow of the world’s profound writings, transcending the mundane from ancient times to now. Those who govern nations and are high sages all find it supremely wondrous, understanding celestial patterns and attaining the ultimate Dao. To obtain this is not mere chance—it is predestined fate. None may casually view it; its blessings are boundless. Those who safeguard it will prosper. Though gold and jade exist, they are not true treasures. True treasures are divine kings, flourishing for ten thousand generations. Keep this secret.\n\n—*Ghost Valley Master’s Heavenly Marrow Sacred Text, Volume Two, Complete.*",
      "overlap_context": "uccess will be difficult.\n\nTo divide the body as described earlier, sit leaning against a wall with the mirror hung low, lie with the talisman horizontally, or stand with it suspended high—always visualizing the self as instructed.\n\n**Changing Appearance (异容):**\nIf one faces sudden, unforeseen disaster and cannot yet complete the techniques, this method allows for rapid transformation to evade a single calamity. Take:\n- One *lìzǐ* (straw hat).\n- One *fēn* of *shāohàodān* (burning number elixir).",
      "start_char": 15919,
      "end_char": 16439,
      "start_sentence": 699,
      "end_sentence": 732,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 9.138172626495361,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\鬼谷子天髓灵文.txt",
        "category": "方法类"
      }
    }
  ]
}