{
  "source_id": "黄帝阴符经集解（宋袁淑真）",
  "source_file": "chunked_daozang\\黄帝阴符经集解（宋袁淑真）.json",
  "total_chunks": 9,
  "total_original_chars": 10012,
  "total_translated_chars": 63578,
  "total_translation_time": 190.00458598136902,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\玉诀类\\黄帝阴符经集解（宋袁淑真）.txt",
    "category": "玉诀类"
  },
  "full_translation": "**Title: *The Yellow Emperor’s Yinshu Jing with Explanations* (Huangdi Yinshu Jing Jiejie)**\n\n**Author & Attribution:**\nComposed by **Yuan Shuxin**, likely from the Northern Song dynasty.\nRecorded in the *Comprehensive Records of Literature* (*Tongzhi Yiyonglüe*) and the *Song Secretariat’s Four Libraries’ Missing Books Catalogue* (*Song Shimi Si Ku Que Shu Mu*) as *Yuan Shuxin’s Commentary on the Yinshu Jing* (三卷), which corresponds to this text.\nThe *Song History’s Literary Records* (*Song Shi Yiwenzhi*) also lists *Yuan Shuxin’s Explanations of the Yinshu Jing* (五卷). The extant version comprises three volumes.\nSource of the base text: *The Zhengtong Daoist Canon* (*Zhengtong Daozang*), in the *Dongzhen* (Verdant Purity) section, *Yujue* (Jade Precepts) category.\n\n---\n\n### **Preface to *The Yellow Emperor’s Yinshu Jing with Explanations***\n\nThe Yellow Emperor, in his profound contemplation, reached the depths of boundless mystery (*huanghuang*), pondering the interplay of Heaven and humanity, elucidating the subtle workings of yin and yang in motion and stillness. The text states: *\"To know and refine—this is the sage.\"* Indeed, the Yellow Emperor attained this and ascended to the Cloud Celestial; his wisdom was unmatched.\n\nThe Yellow Emperor expounded the Dao’s principles, seeking to save all beings. Fearing later generations might neglect its practice, he condensed its essence into over three hundred words, piercing to the true source and transmitting it to the world. The worthy concealed it as a *xian* scripture, yet common folk passed it down as a military treatise.\n\nThis text is concise yet profound, its words simple yet its meaning deep. Former scholars, though many, offered interpretations, yet their explanations remained incomplete, leaving mediocre scholars either preserving or losing its core. Until the Tang dynasty’s **Lixian of Longxi (Li Qun)**, who further elucidated it—yet without establishing chapter-by-chapter commentary—how then could the profound text be fully illuminated?\n\nThe **Mother of Mount Li** said: *\"The Yinshu’s three hundred words—one hundred speak of the Dao, one hundred of method (*fa*), one hundred of technique (*shu*).\"* She further stated: *\"Above, there is the Dao of the Immortals embracing Oneness; in the middle, the method of enriching the state and benefiting the people; below, the technique of strengthening arms and achieving victory.\"* The Holy Mother revealed these three aspects clearly.\n\nConfucian scholars followed tradition but failed to analyze them. Now, I shall outline the three chapters’ essential meanings, dividing them into three volumes—upper, middle, and lower—each expounding its foundation. First, I briefly sketch the framework; later, I elaborate in detail. This is not to surpass former masters but to supplement the deficiencies of later learners.\n\n---\n\n### **Volume One: Explanations by Yuan Shuxin, Former Official and County Magistrate of Changsha, Yuan Shuxin**\n**Chapter: The Immortal’s Embracing of Oneness—Elucidating the Dao**\n\n**Text:**\n*\"Observe the Dao of Heaven, grasp Heaven’s actions—thus it is complete.\"*\n\n**Yuan Shuxin’s Explanation:**\nIf one observes Heaven’s Dao in principle and follows it in practice, then the proper interplay of yin and yang in motion and stillness is fully realized.\n\nHeaven is the refined *qi* of yin and yang. The light and pure ascends to form Heaven, while the heavy and turbid descends to form Earth. Heaven and Earth are connected yet never separate. Thus, **Liezi** in *Yuce* told the people of **Qi**: *\"Heaven is merely accumulated *qi*; Earth is merely accumulated matter. From Earth upward, all is Heaven. You walk within Heaven all day—why fear its collapse?\"*\n\nThus, knowing Heaven and Earth reveals that yin and yang are two *qi*, and within *qi* are the Five Phases (*wuxing*), which are the dynamic functions of yin and yang. All things emerge and grow from them; thus, they are the offspring of the Five Phases.\n\nIf one observes the Dao of Heaven and Earth—yin and yang—and follows the Five *Qi* of Heaven in action, then the rise and fall of all things, life and death, can be discerned. Beyond this, there is nothing further to observe or grasp—hence, *\"it is complete.\"*\n\n**Text:**\n*\"Thus, Heaven has five ‘bandits’ (*zei*); those who see them prosper.\"*\n\n*\"The five ‘bandits’ dwell in the heart; their actions extend to Heaven. The cosmos lies within the palm; all transformations arise from the body.\"*\n\n**Yuan Shuxin’s Explanation:**\nHeaven generates the Five Phases—these are the *\"five bandits.\"* If one attends to them with the mind, follows Heaven’s actions, then the cosmos rests within the palm, and all things manifest from the body.\n\nThe *\"five bandits\"* are the *qi* of the Five Phases: Metal, Wood, Water, Fire, and Earth.\n\n**Lü Wang’s Commentary** states: *\"The sage calls them ‘bandits’; the world calls them ‘virtues’ (*de*).\"* People consume the Five Flavors yet do not resent them for causing death—this is the meaning of *\"bandits.\"*\n\n**Yuan Shuxin’s View:**\n*\"Bandits\"* means *\"harm.\"* If one acts contrary to their natural order, they become harmful—thus, they are called *\"bandits.\"*\n\nThis refers to how yin and yang encompass the Five *Qi*. In Heaven, they are the Five Stars; on Earth, the Five Sacred Peaks; in governance, the Five Directions; in things, the Five Colors; in sound, the Five Tones; in food, the Five Flavors; in the body, the Five Viscera; in the Dao, the Five Virtues. If not used properly, they become *\"bandits.\"*\n\n*\"Bandits\"* refers to how the Five Phases mutually restrain and generate one another, ceaselessly day and night, able to steal life and death, the success and failure of all things—hence, *\"bandits.\"*\n\nIf one understands the restraining Dao of the Five Phases and discerns the sources of yin and yang’s rise and fall, then acting in accordance with them is *\"seeing\"* them. Thus, the Five Viscera are truly realized, and skillful use brings fortune and prosperity.\n\nWhy does the text say, *\"Those who see them prosper\"*? Because the Five Phases are within the heart. Once the heart knows them, one uses them to observe and grasp the Five *Qi* in action, distinguishing between what is contrary and what is顺, aligning with Heaven’s mechanisms without error. Then, the cosmos lies within the palm, and all things arise from the body. Thus, all actions are auspicious, and one wanders with the Dao—how could this not bring prosperity?\n\nIn governing, if one upholds *ren* (benevolence), *yi* (righteousness), *li* (rites), *zhi* (wisdom), and *xin* (faithfulness), one achieves wealth, honor, and flourishing—how could this not be prosperity?\n\nThus, if one follows the Five Phases’ generating cycle in action, it aligns with *yang* and becomes *virtue/power* (*de*). If one applies their restraining cycle, it aligns with *yin* and becomes *\"bandits\"*—harm.\n\nTherefore, the Three Realms’ Celestial Masters all govern by principle, and their established scriptures and teachings speak only of cultivating goodness and calling it *virtue/power*, never of cultivating evil and calling it *\"bandits\"* or harm.\n\nThus, those who cultivate *virtue/power* (*de*) with goodness are *xian*—masters of *yang*; those who indulge in *yin*’s evil and harm are *mo*—essence of *yin*. Beyond this, idle discourse is vain.\n\nHence, Confucius proclaimed: *\"The Three Hundred Poems\"* may be summed in one phrase—*\"Think not evil.\"* The *Yijing* states: *\"When one’s words are good, they resonate a thousand miles away; when they are not, they meet with resistance.\"* This is the ultimate Dao—why must one elaborate on cultivation?\n\nThe essence of the Dao lies not in these words. Those who grasp the origins of *yin-yang*’s success and failure in the Three Realms find all principles exhausted in the first chapter of the *Yinfu*. Yet common folk, seeing few words and shallow meaning, fail to fathom profound logic beneath the surface—how much more so than the vast teachings of the Three Teachings?\n\nThus, the Mother of Mount Li said: *\"To observe its refined principles, the Eight Scenes of the *Huangting* are insufficient for study; to discern its utmost essence, the Classics, Commentaries, and Histories are inadequate for exposition; to employ cunning intelligence, the stratagems of Sunzi, Wuqi, Han Fei, and Baiqi are insufficient for ingenuity.\"* Such is its meaning.\n\nThe scripture says: *\"Heaven’s nature is humanity; human heart is the mechanism.\"* Establishing Heaven’s Dao to govern humanity.\n\n*Shuzhen* says: *\"To establish Heaven and govern humanity lies in the Five Evils.\"* For the human heart governs the soul’s office, while the body is the spirit’s domain. When one seeks to enact the Five Evils, none surpasses the heart’s influence. Thus, if the heart’s deeds are deliberate, this diagram must align with Heaven’s Dao.\n\nThen, though the cosmos be vast, all observation lies within the hand; though myriad things exist, their life and death are confined within technique. Thus, Heaven and Earth are not to be prized for their remoteness, let alone what lies before the ears and eyes. Hence it is said: *\"A rectified heart repels evil.\"*\n\nThe scripture says: *\"When Heaven unleashes the killing mechanism, dragons and serpents rise upon the land. When humanity unleashes the killing mechanism, Heaven and Earth invert.\"* When Heaven and humanity jointly unleash the killing mechanism, all transformations are fixed.\n\n*Shuzhen* says: *\"Heaven’s killing mechanism is the public way; humanity’s is private sentiment.\"* Dragons and serpents, stirred by the public way, rise in trembling; private sentiment disrupts Heaven and Earth, causing inversion. Both align with the public way, and thus ten thousand transformations are fixed.\n\nHeaven contains the Five *qi*, sequentially giving life and death—this is natural. Heaven’s life and death mechanisms all align with their proper function; they should not act arbitrarily. *Yin-yang* transformation, eras shifting, discarding the old for the new—this is Heaven’s killing mechanism, utterly just.\n\nThose who ride Heaven’s killing mechanism, whether as dragons or serpents, or hidden beings, all rise in trembling upon the heights. Following Heaven’s timing, they move freely within their due—this is to ride Heaven’s mechanism without error.\n\nWhen humanity unleashes the killing mechanism, causing Heaven and Earth to invert: humanity is the child of the Five Phases, and must follow the Five *qi*’s life and death, submit to *yin-yang*’s transformation. How dare they presumptuously stir life and death?\n\nAs for the world’s laws: *\"He who kills shall die; he who takes life shall be punished.\"* Why? Because it is not Heaven’s will to kill that person—how dare they kill?\n\nAs for treacherous ministers, rebellious subjects who defy Heaven’s Dao, betray their sovereign and kin, indulge in cruelty, harm the world, and presumptuously slaughter—what then? They invert Heaven to make Earth, and Earth to make Heaven. Such great chaos is the greatest calamity against Heaven—this is called *Heaven and Earth’s inversion*.\n\nThen, humanity’s resentment and the gods’ wrath arise; Heaven will punish them, and humanity will slay them. If a ruler loses Heaven’s mandate, and both Heaven and humanity align in their killing mechanism, this is called *\"Heaven and humanity jointly unleashing the mechanism, fixing all transformations.\"*\n\nTo subdue rebels and punish traitors, executing them in accordance with Heaven’s will—this aligns with Heaven’s proper mechanism, fulfilling the utmost justice. Then all things submit, none daring to act arbitrarily—this is called *fixing the mechanism*.\n\nThe Dao of ruler and subject values public justice. If one’s actions and responses align with Heaven’s mechanism, and their applications harmonize with Heaven’s Dao, this is *Heaven and humanity jointly unleashing the mechanism*.\n\nHow then does this bring peace to the heart, stability to all things, order to the Five Phases, and sanctity to mountains and rivers? Above, *virtue/power* and *Dao* are practiced; below, rites and righteousness are mirrored. Disasters do not arise, calamities do not occur—Heaven and humanity remain tranquil. This is called *Heaven’s mechanism*.\n\nThe scripture says: *\"Nature has skill and clumsiness, which may be concealed.\"* *Shuzhen* says: *\"Human skill and clumsiness must not be revealed; speak cautiously, choose goodness, lest misfortune arise.\"*\n\nAll possess innate wisdom—skill, clumsiness, virtue, and folly—yet few speak of it. As for those with slight cleverness, eloquence, and wisdom, who flaunt their talents without regard for gain or loss, only to invite ruin—why? Because they do not conceal themselves, do not act with caution, and thus court disaster.\n\nThe *De Jing* says: *\"Great eloquence seems stammering; great skill seems clumsy.\"* This speaks of concealment. The *Zhouyi* says: *\"If the ruler is not discreet, he loses his ministers; if the minister is not discreet, he loses his life; if affairs are not discreet, harm is done.\"* Such is the meaning.\n\nTo conceal means that even the wise and virtuous, though possessing cleverness, eloquence, and vast learning, must in action align with propriety—how then is this not skill? If they always conceal themselves, hiding great and small, their use may invite jealousy, envy, slander, and retaliation. How much more so for the clumsy and foolish, who act impulsively, revealing nothing, and thus invite misfortune?\n\nThe virtuous cultivate the Dao and nurture *virtue/power*; their skill and clumsiness are hidden within. Then, inwardly, they observe their true nature; outwardly, they scorn evil and licentiousness. They act upon the good and diminish the bad, refining their conduct to become sages—how could outsiders know their innate skill or clumsiness?\n\n「All say I am naturally virtuous and saintly, yet they do not know the cultivation and refinement that bring this about, hence the saying: *\"It can be concealed.\"*\n\nThe Classics state: *\"The nine orifices’* **evil tendencies** (邪, *xie*—harmful or misaligned tendencies), rooted in the three essentials—**eyes, ears, and mouth**—can be governed through **action and stillness** (动静, *dongjing*—active and passive responses).\"\n\n**Shu Zhen** (淑真) says: *\"The nine orifices* (九窍, *jiuqiao*—nine sensory openings: two eyes, two ears, two nostrils, mouth, anus) *all can generate afflictions*, but these originate from the three essentials—**speech, sight, and hearing**—so one must be cautious to prevent calamity from arising.\"*\n\n**Zhuangzi** (庄生) taught: *\"Humans possess a hundred limbs, nine orifices, and six viscera* (六腑, *liufu*—six internal organs: liver, gallbladder, spleen, stomach, large intestine, small intestine), *yet life persists within them.* Humans are formed from the five **qi** (五气, *wuq*—five elemental breaths: wood, fire, earth, metal, water), with the head round and the feet square. The four limbs and five viscera, along with the **three souls** (三魂, *sanhun*—spiritual essences associated with the kidneys, liver, and lungs) and **seven spirits** (七魄, *qiqi*—spiritual essences associated with the heart, spleen, lungs, kidneys, liver, gallbladder), alternately give rise to **evil and virtue** (邪正, *xiezheng*—harmful and harmonious tendencies), and reciprocally serve as **lord and subject** (君臣, *junchen*—ruling and subordinate forces).\n\nAmong these, the **nine orifices** (九窍) are the pathways where **evil and virtue**, **calamity and blessing** (祸福, *huofu*—misfortune and fortune) flow through the body. The most urgent matters of **evil and virtue**, **calamity and blessing**, lie within the **three essentials**—that is, the **eyes, ears, and mouth** (眼、耳、口).\n\nThe *Dao De Jing* (《道经》) says: *\"The five colors* (五色, *wuse*—colors associated with the five elements: green, red, yellow, white, black) *blind the eyes, the five sounds* (五音, *wuyin*—musical notes associated with the five elements) *deafen the ears, and the five flavors* (五味, *wuwei*—tastes associated with the five elements) *dull the mouth.\"* This is so.\n\nThose who embody **Dao and virtue** (道德, *daode*—the Way and its moral power) do not let their eyes behold **evil colors** (邪色, *xieze*—lustful or corrupting sights), their ears listen to **evil sounds** (邪声, *xieyin*—harmful or seditious words), or their mouths speak of **evil matters** (邪事, *xieqi*—wicked deeds). For all **virtuous affairs** (正事, *zhengshi*—righteous or beneficial matters), they engage in **seeing, hearing, and speaking** of them—this is called **action** (动).\n\nWhen encountering **evil**, they forget it, and **all** (悉, *xi*—completely) do not allow their **hearts, eyes, ears, and mouths** to dwell upon or repeat it—this is called **stillness** (静).\n\n**Confucius** (宣尼) said: *\"To choose and follow the good is called **action** (动). To choose and abandon what is not good is called **stillness** (静).\"*\n\nThe *Xiao Jing* (《孝经》) states: *\"When words fill the world, there is no mouth without fault; when actions fill the world, there is no resentment or grievance*—this arises because one’s **body and mind** (身心, *shenxin*) are upright and free from **evil tendencies** (邪恶, *xie’e*), thus achieving this outcome. But when one encounters the good, they act; when they meet with **evil**, they remain still—then **all calamities and misfortunes** (祸息, *huoxi*—disasters and afflictions) are prevented by the **eyes, ears, and mouth** being firmly guarded.\n\nHence the saying: *\"The nine evils lie in the three essentials, which can be governed through action and stillness.\"*\n\nThe Classics also say: *\"Fire arises from wood, and when calamity erupts, it must be subdued.\"* *\"Delusion* (奸, *jian*—deceit, corruption) *arises within the realm* (国, *guo*—state, body), *and when it acts at the wrong time, it will collapse.*\" Knowing this and refining oneself is what is called a **sage** (圣人).\n\n**Shu Zhen** says: *\"The metaphor of* **delusion-fire** (奸火, *jianhuo*—corrupting or harmful tendencies) *is likened to human nature, while* **wood-realm** (木国, *muguo*—the body as a realm) *is likened to the human form. This teaches one to govern their state and stabilize their body, preventing* **delusion-fire** *from erupting, and then refining their conduct to become a sage.*\"\n\nThis is one illustration of the **sage’s intent** (圣意, *shengyi*), using metaphors to clarify the **appropriateness of action and stillness** for the **nine evils** and **three essentials** above. It urges one to be earnest in cultivation and refinement, lest they fail to exhaust the principles and fully grasp their nature. Thus, the metaphor of **fire hidden within wood and delusion within the realm** is employed, commanding diligent refinement to attain sainthood.\n\nThe phrase *\"wood contains fire\"* is a metaphor for *\"the human body harbors* **evil tendencies** (邪恶, *xie’e*) *and the* **Five Poisons** (五毒, *wudu*—five corrupting influences: lust, anger, greed, delusion, doubt).\" **Lu Wang** (吕望, *i.e.*, Zhuangzi) annotated: *\"Guang Chengzi* (广成子, *a Daoist sage*) *believed that accumulating fire could purge the* **Five Poisons***, thus knowing fire as a fierce and powerful* **qi** (气).\"\n\nThe *Book of Documents* (《书》) says: *\"Fire blazes across the hills, and even jade and stone are consumed.\"* If **fire** is present within **wood**, one must beware of probing it—when the fire erupts, the wood will burn. If **evil tendencies** and **poisons** reside within the body, one must be cautious not to indulge them—if they are given free rein, **all goodness** (万善, *wanshan*) *will perish, and the body will collapse.*\n\nThe saying *\"Delusion arises within the realm, and when it acts at the wrong time, it will collapse\"* means that in any **realm** (国), there are inevitably **deceitful individuals** (奸人, *jianren*) *and treacherous ministers* (贼臣, *zeichen*) *who harbor calamity and plot against the state.* They scheme to usurp power or seek wealth and honor through underhanded means—such cases are countless. All these **evil tendencies** lurk within the realm, yet the ruler cannot fully discern them.\n\nBut if the ruler upholds **Dao and virtue**, and the ministers act with loyalty and integrity, if the times are harmonious and customs flourish, then the world will be at peace. Even if **deceitful individuals** have wicked intentions, they lack the means to recklessly act upon them. They await their opportunity, and only when conditions align do they move—how could the ruler lose their **Dao**, or the ministers abandon their **virtue**, when **floods, droughts, famines, and plagues** (兵水旱蝗, *bingshuihanhuang*—military conflicts, floods, droughts, locusts) arise, and **taxation and levies** (征敛, *zhenglian*) *are harshly imposed* (苛克, *keke*—excessively oppressive)? In such eras, **all things** (万物, *wanwu*) *are filled with rebellious intent*—how much more so for those who already harbor **delusion**? How could they refrain from acting?\n\nMoreover, **delusion** takes many forms. When the time comes for their schemes to unfold, all manner of **corruption** erupts, and how could such a **realm** avoid collapse? This metaphor illustrates the **nine evils** and **three essentials**, explaining the **appropriateness of action and stillness** for the wise and virtuous.\n\nThe saying goes: *\"If one possesses* **Dao and virtue**, *the wisdom and insight* (定慧, *dinghui*—calm discernment and enlightened wisdom) *are concealed within their* **body and mind**. *Even* **evil tendencies, licentiousness, and depravity** (淫秽僻, *yinhuiqi*—lustful, filthy, and perverse inclinations) *cannot provoke them to act.* If **evil tendencies** and **licentiousness** erupt unchecked, then the body will collapse. Hence, the metaphor of **delusion-fire** hidden within the **wood-realm** illustrates how **evil and virtue** are concealed within the **body and mind**. This metaphor reveals that the wise and virtuous thoroughly understand its meaning, comprehend the principles of **interest and decline** (兴废, *xingfei*—rise and fall), and apply **action and stillness** appropriately. Then, through refining their conduct and purifying their actions, they become sages—this is called knowing and cultivating, and thus they are called sages.*\"\n\nHence the saying: *\"Above, there is the Dao of the* **immortal sages** (神仙, *shenxian*) *who embrace* **Oneness** (抱一, *baoyi*—embracing the singular, unified principle).\"\n\n**Zhuge Liang** (诸葛孔明) further stated: *\"The sage conceals their wisdom within the heart, shaping the* **Heaven and Earth** (天地, *tiandi*) *as if molding clay*—this is the way of the* **Yellow Emperor** (黄帝). *The virtuous learn and master this method.*\"\n\n**Shu Zhen** says: *\"To govern through the five elements’* **virtue** (五行之善政, *wuxing zhishen zheng*—beneficial policies aligned with the five phases), *not to defy Heaven’s timing* (不逆天时, *buini tian shi*—not opposing the natural seasons), *not to disrupt Earth’s order* (不逆地理, *buni di li*—not contravening natural laws), *not to harm the times* (不伤时, *bu shang shi*—not damaging the temporal flow), *and not to injure beings* (不害物, *bu hai wu*—not harming living things)—to enrich the state and secure its people, making oneself a virtuous and wise ruler—this is to master the method.*\n\nThose who embody **Dao and virtue** as rulers are like **Emperor Yao** (尧) *and* **Emperor Shun** (舜). *The wise learn and attain the art.*\"\n\n**Shu Zhen** says: *\"To apply Heaven’s Dao, to distribute Earth’s benefits, to be cautious in one’s conduct and moderate in one’s use to nourish one’s parents—this is to practice* **ren** (仁, *benevolence*), **yi** (义, *righteousness*), **li** (礼, *propriety*), **zhi** (智, *wisdom*), **xin** (信, *trustworthiness*), **zhong** (忠, *loyalty*), **xiao** (孝, *filial piety*), and to honor **jun** (君, *ruler*) and **qin** (亲, *kin)—to remain steadfast in* **cheng** (贞, *uprightness*) *and* **lian** (廉, *integrity*), *and to safeguard one’s blessings and position*—this is to attain the art. Such are the virtuous ministers like **Qin** (夔) *and* **Long** (龙).\"\n\n*The petty learn and reap their punishment.*\"\n\n**Shu Zhen** says: *\"To command the* **Five Phases’ qi** (五行之气, *wuxing zhqi*—elemental breaths of wood, fire, earth, metal, water) *without considering the beneficial applications of cultivation, using one’s cleverness, eloquence, and wisdom* (巧智辩慧, *qiaozhi bianhui*—artifice, intelligence, persuasive cunning) *to engage in the three reversals* (三反, *sanfan*—three forms of perversion: harming Heaven, Earth, and humanity) *day and night—disturbing the military, indulging in warfare, plotting secretly to slaughter and harm, selfishly pursuing luxury and splendor, plundering and seizing from others in this world*—though they may temporarily gain wealth and honor, they do not reflect upon the impending **calamity** (祸患, *huohuan*), instead inviting **ruin and defeat** (亡败, *wangbai*), which extend to future generations. This is to reap their punishment. Such are the **usurpers and treacherous ministers** (篡逆悖乱之臣, *cuan ni beiluan zhichen*) like **Lu Sima** (禄山) *and* **An Lushan’s** (思明, *i.e.*, An Lushan’s title) *ancestors, the deceitful and rebellious officials of ancient and modern times.*\"\n\nThe **Sage Mother** (圣母, *Shengmu*—likely referring to **Lady Zhi** or **Empress Fu Shou**, mythical Daoist figures) further remarks: *\"This text is profound and vast, like the morning tide of the great sea that gathers all streams.\"* It is the **chapter of the immortal sages embracing Oneness and manifesting the Dao** (抱一演道章, *baoyi yandao zhang*—section on the unified principle and its unfolding in the Way) from the **one hundred and five words** above. All these teachings clarify the **principles of yin and yang** (阴阳之道, *yinyang zhidao*), the **logic of rise and fall** (兴废之理, *xingfei zhili*), and the **appropriateness of action and stillness**—then one must refine their conduct and purify their actions to become a sage.*\"\n\n「The **Yellow Emperor’s *Yin Fu Jing* with Commentary, Volume One** and **Volume Two**—Commentary by **Cluan Shuxin**, a **Jiaosancang Lang** of **Changsha County**, **Xingtan Prefecture**—**Chapter on the Way of Prospering the Nation and Securing the People** (*Fu guo an ren yan fa zhang*)\n\nThe *Jing* states: *\"Heaven and Earth are the thieves of all things.\"*\n\nCluan Shuxin explains: *\"Heaven covers, Earth bears; all things grow unseen. The **qi of the void** (冲气, *chongqi*—primordial, unrestrained *qi*) nurtures in darkness, hence they are called 'thieves.' Heaven and Earth are none other than **yin and yang** (阴阳, *yinyang*). The terms **yin and yang** (阴阳), along with the **Five Phases** (五行, *wuxing*), together form the **Seven Qi** (七气, *qigong*). Beyond these, how can anything else in the world be more perplexing?*\n\nIt speaks of how all things—whether born from **embryonic development** (胎卵, *tailuán*), **moist transformation** (湿化, *shīhuà*), or **sprouting** (百谷草木, *bǎigǔ cǎomù*)—all derive from these **Seven Qi** to grow and flourish, emerging from the **formless** (无形, *wúxíng*) yet giving rise to the **formed** (有形, *yǒuxíng*). They silently nourish and complete their own bodies, like thieves in motion—unnoticed yet ever-present. Heaven and Earth also silently bestow their **qi**, responding endlessly, all things secretly receiving their cover and sustenance, each attaining its own peace.\n\nThus it is said: *\"Heaven and Earth are the thieves of all things.\"*\n\nThe *Jing* states: *\"All things are the thieves of man.\"*\n\nCluan Shuxin explains: *\"All things steal from Heaven and Earth to grow and flourish; man steals from all things to nourish his body. If one knows the proper **division and alignment** (分合宜, *fēnhé yí*), it is but the natural order of things.*\n\nMan, along with beasts, plants, and trees, all receives **yin and yang** to grow. Yet man is the most **refined** (最灵, *zuìlíng*), positioned in the **central realm** (中宫, *zhōnggōng*), with a **mind of wisdom and insight** (智度, *zhìdù*), capable of **reflecting upon his true nature** (反照正性, *fǎnzhào zhèngxìng*), penetrating to the **original source** (本始, *běnshǐ*), and comprehending the **harmonious interplay** (明会, *mínghuì*) of the **qi of yin and yang and the Five Phases**. He follows their patterns and applies them—this is why the **Sixty-Four Hexagrams of the *Zhou Yi*** (周易六十四卦, *Zhōuyì liùshísì guà*) and the **Sixty Jiazi Cycles** (六十甲子, *liùshí jiǎzǐ*) exist.\n\nThus the earlier passage says: *\"Those who see it prosper.\"* Man, within these **Seven Qi**, can silently take and nourish his body from all things that grow from them, hence the saying *\"thieves.\"* For example, the **cultivators of fields and silkworms** (田蚕之类, *tiáncán zhīlèi*).\n\n*The *Liezi* states*: *\"There was a wealthy man of the State of Qi who said: ‘I am skilled in thievery.’ Heaven has its seasons, Earth has its advantages. When Heaven’s seasons and Earth’s advantages align, thieves steal the **abundant rains** (雨泽, *yǔzé*) to nourish their fields. Land thieves steal from beasts and birds; water thieves steal from fish and turtles. I began with thievery, and in the first year, it was urgent; in the second year, it was sufficient; in the third year, it was abundant. From then on, my wealth extended to the entire region. I steal from Heaven and Earth without suffering misfortune or blame. But you steal from others’ gold and silk—how can you remain unpunished?’*\n\nAll things steal from Heaven and Earth to grow; the people steal from all things to nourish their bodies. If one knows the proper **division and alignment**, it is but the natural order. This is the meaning of *\"all things are the thieves of man.\"*\n\nThe *Jing* states: *\"Man is the thief of all things.\"* When the **Three Thieves** (三盗, *sǎn dào*—Heaven, Earth, and man) align properly, the **Three Powers** (三才, *sān cái*—Heaven, Earth, and man) are at peace.\n\nCluan Shuxin explains: *\"‘既’ (既, *jì*) means ‘to exhaust’ or ‘fulfill.’ When the **Three Thieves** exhaust their proper roles, the **Three Powers** fulfill their positions in harmony.\"*\n\nIt speaks of how man, if he only knows to steal from all things to nourish himself and attain wealth, yet fails to recognize that all things can also steal from man to bring misfortune. The **three interdependent roles of thievery** (上来三义更相为盗, *shànglái sān yì gēngxiāng wéi dào*—the cyclical nature of Heaven, Earth, and man as thieves) are also part of the natural order.\n\nIn all cases of thievery, there must be **Dao/Way**. If one conforms to its proper alignment, it brings **good fortune** (吉, *jí*); if one defies its natural logic, it brings **calamity** (凶, *xiōng*). Thus, *The Liezi* asks: *\"Is there a Way in thievery?\"* and replies: *\"How could it lack a Way?\"*\n\nTo **enter first** (入先, *rùxiān*) is **sageliness** (圣也, *shèng yě*—divine foresight);\nTo **know what is permissible or forbidden** (知可否, *zhī kěfǒu*) is **wisdom** (智也, *zhì yě*);\nTo **enter first** (入先, *rùxiān*) is **courage** (勇也, *yǒng yě*—boldness in action);\nTo **exit last** (出后, *chūhòu*) is **righteousness** (义也, *yì yě*—proper conduct);\nTo **distribute fairly** (分均, *fēnjūn*) is **benevolence** (仁也, *rén yě*).\n\nWithout these **Five Virtues** (五德, *wǔ dé*), one cannot become a **great thief** (大盗, *dà dào*). This is the **Dao/Way within thievery** (盗中之道, *dào zhōng zhī dào*).\n\nIn the **Three Thieves**, one must also follow **Dao/Way**, ensuring all align in their proper roles—then the **Three Powers** will not falter, and each will fulfill its position in harmony. This prevents **transgressing boundaries and harming one’s nature** (越分伤性, *yuèdào shāngxìng*), which would bring misfortune.\n\nThe *Jing* states: *\"Eat according to the seasons, and all parts of the body will be in order. Act in accordance with the **mechanisms of change** (动其机, *dòng qí jī*—the natural triggers of transformation), and all transformations will be at peace.\"*\n\nCluan Shuxin explains: *\"If man’s **diet and nourishment** (服食, *fúshí*) do not lose their proper seasons, his body will suffer no harm. If his **actions and movements** (兴动, *xīngdòng*) align with their proper mechanisms, all transformations will be at peace.\"*\n\nIt refers to man’s **understanding of life and destiny** (理性命, *lǐngxìngmìng*)—all are tied to **diet and flavors** (滋味, *zīwèi*). Thus, *The Zuo Zhuan* states: *\"Flavors circulate the *qi*; *qi* circulates the mind. Nourishing the form and moistening the spirit must return to **diet**.\"* The **Yellow Emperor** says: *\"When man takes **food and drink** (服食, *fúshí*), he must first consider the **Five Flavors** (五味, *wǔ wèi*), the **Five Meats** (五肉, *wǔ ròu*), the **Five Vegetables** (五菜, *wǔ cài*), and the **Five Fruits** (五果, *wǔ guǒ*), all requiring **proper timing and moderation** (调候得所, *tiáohòu désuǒ*). If consumed **cooked** (熟, *shú*), they benefit the body; if consumed **raw** (生, *shēng*), they harm the **organs** (脏, *zàng*). This is the meaning of **‘eating according to the seasons.’***\n\nThus, if man’s **diet and nourishment** do not lose their proper seasons, and his **flavors** do not exceed their proper alignment, conforming to the **middle way** (中道, *zhōngdào*), without transgressing boundaries or harming his nature, then his **four limbs** (四肢, *sìzhī*) will be harmonious, his **five organs** (五脏, *wǔ zàng*) will be at peace, no sickness will arise, and he will **preserve his longevity and fulfill his natural lifespan** (保终, *bǎo zhōng*). Is this not the meaning of *\"all parts of the body will be in order\"*?\n\nThus, *The Kang Cangzi* states: *\"Eating well in winter keeps the body warm; eating well in summer keeps the body cool. If the seasons are right, man will have no sickness; if man has no sickness, epidemics will not spread; if epidemics do not spread, man will attain his natural lifespan.\"* Hence it is said: *\"Grains are man’s **life-essence** (命, *mìng*); Heaven therefore **prospers kings through agriculture** (兴王务农, *xīngwáng wù nóng*). If a king does not **pursue agriculture** (务农, *wù nóng*), he abandons his people. How then can he have a nation?\"*\n\nOnly when the **Three Thieves** align in their proper roles and the **Three Powers** fulfill their duties in harmony—all conforming to the **natural order**—must one then **adjust with laws and governance** (法令平正, *fǎlìng píngzhèng*) to **employ the worthy and utilize the capable** (用贤使能, *yòng xián shǐ néng*). Let **beneficence extend to all creatures** (泽及昆虫, *zé jí kūnchóng*) and **transformation pervade all plants** (化被草木, *huà bèi cǎomù*). If all actions align with the **proper mechanisms of Heaven’s Dao** (天道之机宜, *tiāndào zhī jī yí*), then **yin and yang will follow the seasons** (阴阳顺时, *yīnyáng shùnshí*), the **world will be in peace and tranquility** (寰宇宁泰, *huányǔ níngtài*), and all things will attain their own stability and peace.\n\nThis is the meaning of *\"acting in accordance with the mechanisms of change, and all transformations will be at peace.\"*\n\nThe *Jing* states: *\"Man knows his **spirit** (神, *shén*) through its manifestation, yet does not know how the **non-manifested spirit** (不神, *bù shén*) manifests the spirit.\"*\n\nCluan Shuxin explains: *\"**Yin and yang** generate all things—man calls this ‘spirit.’ Yet he does not know of the **supreme Dao/Way**, which remains **still and silent** (静嘿, *jìng hū*), yet is the **ultimate source of spirit** (至神, *zhì shén*) that can generate **yin and yang and all things.** ‘Spirit’ is the **mysterious and unfathomable** (妙而不测, *miào ér bù cè*).\"*\n\nThe *Yijing* states: **\"Yin and yang’s unfathomable workings are what is called spirit.\"** Men merely see all things arising from yin and yang, sun and moon, and call this \"spirit.\" Yet they fail to recognize that yin and yang, sun and moon, arise from the **non-spirit**. What is this **non-spirit**? It is the **Supreme Dao/Way**. The **Supreme Dao/Way** is **empty and still**, **silent and quiescent**, yet **not spirit**—yet within this **non-spirit** lies the power to generate sun and moon, yin and yang, the Three Realms, and all ten thousand things, flourishing and thriving. All this originates from the **Supreme Dao/Way’s** empty stillness. Thus, the **non-spirit** is the **ultimate spirit**.\n\nTherefore, the *Dao De Jing* says:\n*\"Fathomless and obscure,\nWithin it lies the essence;\nVague and indistinct,\nWithin it lies the substance.\"*\nThis clearly reveals the principle that within the **Supreme Dao/Way’s** **non-spirit** lies the **ultimate spirit**.\n\nTo awaken cultivators to the principle of **effortless non-spirit**, they must reflect upon their true nature, practice the **Way of non-action**, preserve thought and hold to the One, return to simplicity and restore authenticity, and align with the **Way of non-action**, ever deeper into the **mysterious**. Only then will they attain **silent quiescence** and **non-spirit**, and thus **\"act without doing\"**—this is what is called **non-spirit**.\n\nHence, *Laozi* says:\n**\"The Dao acts without doing, yet nothing remains undone.\"**\nThis is the **non-spirit** that achieves the **ultimate spirit**.\n\nThe *Jing* states:\n**\"Sun and moon follow their appointed courses, great and small have their fixed measures.\"**\nFrom this arise **sagely efficacy** and **spiritual luminosity**.\n\nCluan Shuxin explains:\nThe sun and moon revolve without deviating from their degrees, their greatness and smallness are fixed—this reveals the power of **sagely efficacy** and the effects of **spiritual luminosity**. Sun and moon are the **refined qi of yin and yang**, the most exalted within the **Six Extremes**. Their courses, their greatness and smallness, are determined by calendrical and astronomical laws, each with its allotted measure, revolving without error. Thus it is said:\n**\"Sun and moon follow their appointed courses, great and small have their fixed measures.\"**\nFrom this arise **sagely efficacy** and **spiritual luminosity**, for within the **Six Extremes**, all things rely on the sun and moon’s illumination, the movement of yin and yang to generate life—possessing **dynamic and vegetative power**, profound and sagely. Hence it is said:\n**\"From this arise sagely efficacy and spiritual luminosity.\"**\nYin and yang’s unfathomable workings are called **spirit**, the sun and moon’s luminous clarity are called **luminosity**—thus, **spirit and luminosity**. All things under heaven and earth are nurtured by **sagely efficacy and spiritual luminosity**, emerging from **non-being to being**, their functions manifest. Hence it is said:\n**\"From this arise sagely efficacy and spiritual luminosity.\"**\nAgain, all things in the world receive this **sagely force** and are born. Great and small have their fixed measures—none overstep, so the small does not covet the great, nor the great despise the small. Thus Zhuangzi says:\n**\"The peng and the yuan each soar freely, neither envying the other.\"**\nThis is the meaning of **\"great and small have their fixed measures.\"**\n\nFurther, from the sovereign down to the common folk, each follows its appointed measure, neither encroaching nor usurping, so that above and below live in harmony, customs are settled, and the times are peaceful—this is called **Great Peace**. Hence it is said:\n**\"Within it lies the method for enriching the state and securing the people.\"**\n\nThe *Jing* states:\n**\"Those who steal the mechanisms—none under heaven do not see them, yet none can know them. The sage who attains them secures his person; the petty man who attains them risks his life.\"**\n\nCluan Shuxin explains:\nStealing the mechanisms is profound yet easily seen, difficult to know. The sage recognizes the mechanism of **accumulating virtue** and thus secures his person; the petty man pursues the mechanisms of **honor and disgrace** and thus risks his life.\n\nWhat is **stealing the mechanisms**? Suppose a family steals from heaven to gain wealth—all see it as the mechanism of planting and cultivating, yet they do not grasp the deep principle behind their gain. Because they themselves lacked it first, they recognize it in others, secretly plotting to activate its mechanisms, unaware, stealing what is to come to enrich themselves—this is called **stealing the mechanisms**.\n\nAll under heaven see this **stealing of mechanisms**, yet none can fathom its depths. If some do know, their understanding differs between the petty and the sage. The sage knows the mechanism of **securing his person**: he recognizes that within the **Supreme Dao/Way** lies all virtue, and whatever he seeks will surely come to pass, like an echo to sound. By secretly and silently cultivating, activating the mechanism of habitual virtue, aligning with the Dao, guarding the One, preserving thought, and refining essence to cultivate, he steals the profound mysteries to preserve his nature. Perhaps he steals the **Spirit Water, Flower of Jade, or Golden Elixir** to attain immortality—sages and virtuous men know this wondrous mechanism, cultivating and refining to become sages. Hence it is said:\n**\"The sage who attains them secures his person.\"**\n\nThe petty man’s mechanism of **risking his life** is this: he merely seeks wealth and jade, sparing no labor, or cultivates talent and martial skill, enduring no hardship, adorning himself with clever stratagems to seize the world’s fleeting mechanisms of honor—whether through extravagance and favor, military peril, or avarice that harms himself, or entanglement in wealth and desire that brings calamity. Though he may briefly gain superficial honor, he cannot escape misfortune and blame, for he does not know the wondrous mechanism of the Dao. Hence it is said:\n**\"The petty man who attains them risks his life.\"**\n\nThis is the chapter expounding the **method for enriching the state and securing the people**, with ninety-two words guiding people to take and discard according to the mechanisms, clearly perceiving the principle of the **ultimate spirit**—this is the mechanism of **nurturing transformation, securing life, and fortifying the person**. Hence it is said:\n**\"Within it lies the method for enriching the state and securing the people.\"**\n\n**\"The *Method for Strengthening the Army and Achieving Victory* Chapter**\n\nThe text states:\n*\"The blind excel in hearing, the deaf excel in sight.*\n*Cutting off one source of profit, the army is ten times more effective;\n*Threefold reflection day and night, the army is a hundred thousand times more effective.\"*\n\nCluan Shuzhen comments:\n*\"Cutting off profit\"* means that if one blocks out distractions, vision becomes clear, and if one closes the eyes, hearing becomes acute. The aim is to keep the body and mind unperturbed, and one’s affairs sharply focused. It is said that when a person’s eyes covet improper sights, they cannot hear true sounds; when their ears indulge in improper noises, their vision fails to discern proper sights. Thus, sight and hearing both originate from the mind.\n\n*The Daoist sage*, whose mind is free of deceit, though exposed to myriad sights and sounds, remains steadfast in their purity. Without attachment or craving, their mind is as unobstructed as one without ears or eyes. Why must they be blind or deaf?\n\nBut when the mind aligns with truth, ears and eyes remain untainted; when ears and eyes are untainted, the body and mind remain undisturbed; when undisturbed, thoughts become luminous; when thoughts are luminous, all actions and decisions conform to the **Dao/Way**, yielding tenfold advantage over ordinary perception. All undertakings succeed—why need they rely solely on an army?\n\nThe same principle applies elsewhere.\n\n*\"Threefold reflection day and night, the army is a hundred thousand times more effective\"* means that when the ruler’s mind is steadfast, their ears and eyes keen, and their actions and decisions tenfold more effective than usual; and when, moreover, they engage in threefold deliberation, day and night, with unwavering focus, their actions and decisions are a hundred thousand times more effective than ordinary perception—why need they rely solely on an army?\n\nConfucius said: *\"Threefold reflection, then act. This suffices.\"*\nHe urged people to deliberate with utmost precision—this is the same intent.\n\n*\"The army\"* refers to **warriors**;\n*\"Warriors\"* are **tools of violence**;\n*\"War\"* is a **perilous matter**.\n\nIn lands of conflict or moments of dire peril, one must engage in threefold reflection and careful deliberation. If one is negligent in strategy, reckless in advance or retreat, defeat will follow immediately. That is why this passage emphasizes the need for disciplined reflection—it is not about truly employing an army, but using the metaphor of *\"the army\"* to urge one to cultivate and safeguard their own mind.\n\nMoreover, the **Daoist sage** who abhors evil as they would a sworn enemy—this is the **thief** (of virtue). The wise recognize this: by severing the source of profit, embracing threefold reflection, and deep, meticulous contemplation, they align with truth, dwell in integrity, and exterminate the deceitful thief within. Thus, they fortify their own person, and over time, attain the **Dao/Way**—as when the Yellow Emperor vanquished **Chi You**.\n\nAs for ancient and modern great generals—Sun, Wu, Han, Bai, **Wu Hou (Zhuge Liang)**, and **Li Jing (the Duke of Wei)**—all excelled in employing armies, mastering threefold reflection day and night, and achieving success in their undertakings. Thus, they ascended to the ranks of **enlightened rulers**, securing their own honor and wealth, and only then could they be said to possess the *Method for Strengthening the Army and Achieving Victory*—a **Dao/Way** that risks one’s life if misapplied.\n\nThe Yellow Emperor attained it and ascended to the **Cloudy Heights**, while his teachings endure in the **Play of the Mysterious Void**.\n\nHence, the earlier passage states:\n*\"The sage who attains this fortifies their person;\n*The petty man who attains it risks their life.\"*\n\nThe text states:\n*\"The mind is born from things, dies from things; the mechanism lies in the eyes.\"*\n\nCluan Shuzhen comments:\n*\"When the mind covets things, it shortens one’s lifespan;\n*When the eyes see without restraint, the will becomes reckless.*\nBut if one can curb the eyes and gather the mind, there will be no misfortune or ruin.\n\n*The Daoist sage*’s mind does not generate deceit, nor does their mechanism move recklessly—they simply respond to circumstances. Yet those who indulge in them, taking all things to nourish their body and sustain their life, also follow natural principle—only they must not exceed their proper measure, nor act contrary to nature, lest they harm their own essence.\n\nThus, the *Kang Cang Zi* says:\n*\"Ten thousand men drawing bows, all aiming at a single target—no arrow misses.*\n*Target: a mound (of arrows).*\n*Or: Target, the archer.*\n*All things manifestly harm one life—the life that cannot escape injury is the **essence of life**.*\n*Today’s deluded ones often nourish their **essence of life** with things, thus knowing no rest.*\nThis speaks of how the mind’s greed for things leads to being robbed by them, bringing ruin to one’s person.\n\nThus, the *Family Sayings* say:\n*\"Unrestrained desires, insatiable cravings—this is the **death of the form**.\"*\n\nThe *Laozi* says:\n*\"Knowing contentment brings no disgrace;\n*Knowing restraint brings no peril.\n*This is how one endures long—\n*The precious thing is knowing contentment.*\n*To dwell in moderation, not exceeding bounds,\n*Yet one indulges in nourishing themselves with things,\n*And harms their true nature—\n*This is to invite harm from others,\n*And is how the mind is born from things.*\n\n*The mechanism lies in the eyes* means that when one’s actions generate deceitful thoughts toward things, it is always because the eyes have seen them, and the mind has thus been stirred—hence it is said: *The mechanism lies in the eyes.*\n\nTo curb the eyes, one must not gaze upon improper or lustful sights, lest the mind generate reckless movements toward things. This preserves the **essence of life** and fortifies the person.\n\nThe text states:\n*\"Heaven’s lack of favor is its greatest favor.\"*\n\nCluan Shuzhen comments:\n*\"Heaven and Earth give birth but do not possess;\n*They act but do not rely on their deeds.*\n*They nurture all things without seeking repayment,\n*Yet all things, moved by their sheltering care,\n*Naturally generate favor in return.*\n*Heaven and Earth, along with all things, exist by nature—\n*This is all contained within the **ultimate spirit** of the Dao.*\n*They do not demand repayment from all things,\n*Yet all things, receiving Heaven’s sheltering care,\n*Naturally hold favor toward Heaven and Earth.*\n\nThus, the *Laozi* says:\n*\"Give birth but do not possess;\n*Act but do not rely on your deeds;\n*Nurture but do not dominate.\"*\n\nThe text states:\n*\"Swift thunder and fierce winds—none fail to tremble.\"*\n\nCluan Shuzhen comments:\n*\"Swift thunder and fierce winds are the movements of **yin** and **yang**;\n*People naturally fear them, and tremble in response.*\n*Swift thunder is the striking sound of **yin** and **yang**;\n*Fierce winds, as Zhuangzi says: The great breath exhales—this is what we call wind.*\n*In all such winds and thunders,\n*They arise from **yin** and **yang** by nature,\n*And do not inherently threaten people—\n*Yet people fear them,\n*And tremble in response.*\n\n*The sage who follows the Dao*, nurturing all beings, mirrors Heaven and Earth’s lack of **virtue/power (ren)**, yet the people, beasts, grasses, and trees all naturally return their favor to the ruler, as they do to Heaven. Each abides in its proper place, each finds ease in its work, and none fail to dwell in **effortless harmony (xiaoxiao)**.\"*\n\n「The enlightened ruler merely issues his just decrees to display the standards of the state;\n*When the common folk see his stern commands,*\n*They respond like swift thunder and fierce winds—*\n*All tremble and are moved,*\n*Each bearing a heart of fear,*\n*All self-alerted,*\n*Refining their conduct and proceeding with caution.*\n\n*Applying this principle to military affairs,*\n*The generals grow bold and the soldiers strong,*\n*The superiors command fear in their inferiors,*\n*And such an army will assuredly*\n*Slay the violent and pacify rebellion.*\n\n*Thus it is said: Below lies the art of strong armies and victory in war.*\n\n*The Classics state: Supreme joy leaves vitality intact; supreme stillness brings purity.*\n*Adhering to this principle,*\n*One’s aspirations remain modest and tranquil,*\n*The heart knows no anxiety or dread,*\n*And contentment and ease abound,*\n*With effortless harmony overflowing.*\n\n*Supreme joy is not the frivolous mirth of strings and pipes,*\n*For such pleasures would exhaust one’s vitality.*\n*Hence, the *Family Discourses* say:*\n*\"Supreme joy is soundless,*\n*Yet it brings peace to all under Heaven.\"*\n\n*The *Three Strategies* declare:*\n*\"The ruler who follows the Dao delights his people with joy.\"*\n\n*This refers to the virtuous sage and noble ruler,*\n*Who, unattached to worldly things,*\n*Uninfluenced by wealth or gain,*\n*Govern the state and secure the home,*\n*Without licentious punishments,*\n*Without transgressing the state’s precepts,*\n*Without personal fault,*\n*And thus free from all concern,*\n*Naturally harboring delight and ease,*\n*With joy and nature harmonizing,*\n*And effortless harmony overflowing.*\n*Would they seek such frivolous pleasures as feasts and revelry,*\n*And yet call it supreme joy?*\n\n*As for the ancients,*\n*They plucked strings to attune the heart,*\n*Gathered fallen grains to express humility,*\n*And sang as they awaited their end,*\n*Hence the saying:*\n*\"Supreme joy leaves vitality intact.\"*\n\n*The Classics state: Supreme stillness brings purity.*\n*This means that, having avoided*\n*The vulgar pleasures of strings and pipes,*\n*One preserves the joy of*\n*Worry-free and carefree contentment,*\n*Thus remaining unperturbed by sounds and colors,*\n*With nature tranquil and spirit steadfast,*\n*And purity unassailable.*\n*Hence, the *Kang Cangzi* says:*\n*\"The noble grow fluent in speech,*\n*The wealthy grow fluent in movement,*\n*The poor grow fluent in thought,*\n*The still grow fluent in spirit.\"*\n\n*These four harmonies*\n*Reside in supreme stillness.*\n*When one attains supreme stillness,*\n*One achieves spiritual fluency—*\n*This is called*\n*\"Supreme stillness brings purity.\"*\n\n*The nature of generals and strategists*\n*Demands purity and stillness,*\n*Suppressing all clamor and disturbance,*\n*With rewards and punishments*\n*Not favoring kin over children,*\n*And thus the military heart*\n*Harbors delight and joy,*\n*With vitality and courage abundant,*\n*Yet they can crush the wicked and conquer foes,*\n*And their achievements will surely flourish.*\n\n*Thus it is said: Below lies the art of strong armies and victory in war.*\n\n*The Classics state: The mechanism of birds lies in their **qi (qi)**.**\n*Adhering to this principle,*\n*The pterodactyl flaps its wings nine thousand miles,*\n*Accumulating **qi** to ascend,*\n*While the cicada and sparrow*\n*Strike their wings against the mulberry,*\n*And descend with sudden resolve—*\n*All move freely by mastering their **qi**.*\n\n*Birds are the feathered kind of all winged creatures.*\n***Qi** is the primordial harmony of Heaven and Earth.*\n*Human movement relies on hands and feet,*\n*Advancing or retreating for advantage;*\n*But birds move by beating their wings,*\n*And with their hearts they advance or retreat,*\n*Soaring through the clouds,*\n*Beyond human reach.*\n\n*This says that even birds,*\n*Though lesser in speech,*\n*Can harness the primordial harmony of **qi**,*\n*And with their hearts directing,*\n*Their wings flapping,*\n*Go wherever they will,*\n*Ascending or descending at their own command.*\n*How much more so should humans,*\n*The most refined of creatures,*\n*Be unable to master*\n*The Dao/Way’s and Heaven’s Earth’s **qi**,*\n*And thus cultivate their bodies and prolong their lives,*\n*To attain eternal youth and longevity?*\n\n*If humans could master the **qi** of the Dao/Way,*\n*They might roam the boundless expanse,*\n*Through the celestial realms,*\n*And surpass even the birds.*\n*For the strategist,*\n*Skilled in harnessing the **qi** of the Five Phases,*\n*Knowing the sources of yin and yang’s dominance,*\n*Crushing the wicked and conquering foes*\n*Would pose no challenge—*\n*Thus it is said:*\n*\"Below lies the art of strong armies and victory in war.\"*\n\n*The Classics state:*\n*\"Life is the root of death,*\n*Death is the root of life.\"*\n\n「The *Shúzhēn* says: Foolish men follow things and crave life,\nBut those who understand life’s true nature—\nThey hasten their own demise.\nThe virtuous, however, diminish themselves to seek life,\nAnd those who grasp the Dao/Way’s profound virtue/power—\nNurture their bodies yet remain unharmed,\nThis is the way of mortals in the world:\nTo covet life and abhor death,\nAll indulge their own bodies,\nFearful of destruction’s approach.\n\nTo rear and sustain one’s life,\nOne must drink and eat, wear clothes and garments—\nThis too is the natural harmony of Heaven and Earth.\nThus *Zhuāng Zhou* spoke:\n*\"Plow to eat, weave to clothe oneself,*\n*And virtue/power never departs.*\n*Weave to clothe oneself, plow to eat,*\n*This is called ‘same virtue/power,’*\n*Thus knowing that human life relies on food and clothing for sustenance.*\n\nYet when moderation and frugality prevail—\nFortune follows.\nIf one indulges in excess, luxury, and waste—\nMisfortune comes,\nAnd life itself is harmed.\n\nAs for the ancient sages,\nWho dwelled in nests and caves,\nWith simple natures and unrefined minds,\nThey knew not of longevity or short lives,\nFollowing the Dao/Way’s natural course\nAnd thus lived long and eternally.\n\nBut in later ages,\nAs the true Dao/Way faded,\nAnd superficiality arose,\nPalaces grew grand, garments splendid,\nDelicacies abounded, pleasures multiplied—\nBeyond measure, they pampered their bodies,\nFearful their health might fail,\nYet unaware that overindulgence\nWearies the mind and strains the thoughts,\nAccelerating the very demise they dread.\nThus it is said:\n*\"Life is the root of death;*\n*Death is the root of life.\"*\n\nTo the Dao/Way’s virtuous ones,\nWho sacrifice themselves for truth,\nWho do not covet wealth nor follow things,\nSeeking the art of eternal life—\nSome feast on mist and breathe in vital qi,\nAbandon grains and cease from food,\nTheir hearts like cold ashes,\nTheir forms as withered wood—\nTo the world, death’s likeness,\nYet truly, this is life’s root.\nThus it is said:\n*\"Death is the root of life.\"*\n\nThe strategist’s virtue/power,\nWho knows that life must end,\nYet death can return to life,\nPreserves their armies and protects their people—\nSuch is the mark of a true general.\n\nThus the military arts declare:\n*\"Drive troops to death’s ground*\n*And life shall return—*\nThis is the art of strong armies and victory in war.\"*\n\nThe Classics say:\n*\"Favor arises from harm,*\n*Harm arises from favor.\"*\n\nThe *Shúzhēn* says:\n*\"The noble avoid harm and feel gratitude,*\n*Thus favor arises from harm.*\n*The petty betray favor and invite harm,*\n*Thus harm arises from favor.*\nThis speaks to human hearts’ shifting tides,\nWhere favor and harm intertwine.\n\nOriginally, there is no harm,\nNor is there any favor—\nYet when harm is averted,\nFavor springs forth—\nThis is favor arising from harm.\n\nAs for the virtuous noble,\nWhen the petty face peril,\nAnd others rescue and uplift them,\nThey cherish gratitude and virtue/power,\nNever forgetting—\nThis is favor arising from harm.\n\nYet the petty, who receive\nTheir lord’s grace and bounty,\nResiding in honor and wealth,\nCannot guard or repay favor,\nNor maintain caution from start to finish—\nWhen arrogance replaces restraint,\nThey fall into legal snares,\nBlind to their own faults,\nAnd harbor resentment, birthing harm—\nThus they betray favor and invite harm,\nAnd it is said:\n*\"Harm arises from favor.\"*\n\nThe Dao/Way’s virtuous ones,\nWho feel Heaven and Earth’s nurturing grace,\nDo not betray the Way’s virtue/power,\nNor abandon its creation—\nThey refine governance, return to simplicity,\nAnd thus no harm can spring from favor,\nNor favor give rise to harm.\nThey do not let favor and harm distort their nature,\nGuarding stillness and silence to birth true benefit.\n\nYet those who see\nFavor and harm as intertwined,\nWhere honor and disgrace alternate—\nThese are the petty’s views.\n\nThe strategist’s virtue/power,\nWho does not betray the Emperor’s grace,\nNor boast in honor’s embrace,\nWho remains steadfast from start to finish,\nPreserving favor’s light,\nWho exhausts their strength in loyalty,\nAchieves success and establishes deeds—\nThus no harm can spring from favor,\nNor favor give rise to harm.\nWith the Dao/Way’s virtue/power leading armies,\nThey conquer without battle.\n\nThus it is said:\n*\"Below lies the art of strong armies and victory in war’s unfolding.\"*\n\nThe Classics say:\n*\"Foolish men take Heaven and Earth’s patterns as sacred,*\n*I see time and things’ patterns as wise.\"*\n\nThe *Shúzhēn* says:\n*\"Foolish men see stars flowing, solar halos,*\n*Winds and lightning, thunder and tempests,*\n*Or seasons unbalanced, floods and droughts,*\n*And disasters of locusts—*\nThey fear and recoil within themselves,\nUnknowing that the Dao/Way’s virtue/power\nAnd harmonious governance\nCan soothe the people,\nTurning calamity to blessing.\nThus I alone perceive the patterns of time and things.*\n\nHeaven and Earth’s patterns—\nThe sun and moon suspended to illuminate good and evil,\nThe constellations arrayed to show fortune and misfortune—\nAll are the Dao/Way’s natural virtue/power.\nTo say that foolish men gaze upward at the three luminaries,\nObserve celestial changes,\nWitness thunder’s wrath,\nOr seasons out of order,\nFloods and droughts,\nDisasters of locusts—\nThey fear and recoil within themselves,\nAll harboring dread.\n\nThus foolish men take these patterns of time and things as sacred.\n\nThe patterns of time and things—\nIf the lord harbors modesty and stillness,\nAnd ministers display loyalty and integrity,\nIf crows and magpies do not cry out,\nAnd border beacons remain unlit,\nIf all the people live in ease,\nAnd the world is tranquil—\nEven should Heaven and Earth send omens of calamity,\nThey cannot take effect.\n\nThe sage alone perceives these patterns of time and things,\nThus the *Jiāyǔ* says:\n*\"In the time of Yīn Tàiwù,*\n*The Dao/Way was absent, laws corrupt—*\n*Thus his demise was brought about,*\n*And mulberry trees grew in the palace courtyard,*\n*In seven days, they arched high.*\n*Diviners said:*\n*'Mulberry trees normally grow in the suburbs,*\n*Now they appear in the palace courtyard—*\n*Fear the court will perish!'*\n*Tàiwù, in terror,*\n*Turned to virtue/power, reflecting on ancient governance,*\n*Spreading the Dao/Way’s nurturing path.*\n*After three years,*\n*Sixteen distant states, drawn by his virtue/power,*\n*Came bearing tribute,*\n*And the mulberry trees could no longer be calamitous.*\n*The Master said:*\n*'Life and death, blessings and misfortunes,*\n*All arise from human action—*\n*Heaven’s disasters and Earth’s portents*\n*Cannot add to them.'*\n*Thus calamities and portents*\n*Cannot overcome virtuous governance,*\n*Nor evil dreams*\n*Overcome virtuous deeds.*\n\nAgain, *Yáo* faced the great flood,\nAnd *Tāng* the severe drought—\nBoth endured for years,\nYet the people lived in peace,\nNone starved—\nWhy so?\nFor lord and ministers followed the Dao/Way,\nGovernance was balanced and harmonious,\nThe ruler trusted, ministers were loyal,\nThe people revered their lord—\nEven floods and droughts could not bring disaster.\n\nFloods and droughts are the patterns of time and things,\nYet if one understands their true nature,\nAll can turn calamity to blessing,\nAnd death to life.»\n\n「Thus it is said:\n*\"The sage governs through the Dao/Way of time, things, and their natural patterns and principles.*\n*For military affairs,*\nWhen the sun’s halo displays five colors,\nStars drift across the four cardinal directions,\nOminous beasts charge into the encampment,\nWild birds enter the dwelling—\nAt such times, Heaven and Earth reveal their portents of calamity and omens.\nYet if one can refine governance and laws,\nDevise strategies with careful thought,\nShow kindness and soothe the soldiers,\nAnd transform misfortune into blessing,\nThen how could the enemy dare to resist?\nThis is the Dao/Way of time, things, and their natural patterns and principles.\nThus it is said:\n*'The lower realm possesses the art of strong armies and victory in battle.'*\n*The lower realm’s hundred and thirteen words*\nAll make one deeply cultivate kindness and still reflection,\nSo that harm and injury do not arise,\nAnd one understands the principles of life and death,\nBoth public and private, hidden and revealed,\nOpening the mysteries of things and accomplishing deeds,\nObserving Heaven’s signs and aligning with the seasons—\nHence it is said:\n*'The lower realm possesses the art of strong armies and victory in battle.'*\n\n*The Classic says:*\n*\"The Dao/Way of nature is tranquil,*\nSo Heaven and Earth give birth to all things.\n*The Dao/Way of Heaven and Earth is moist and penetrating,*\nSo yin and yang prevail.\n*Yin and yang interact, pushing one another,*\nAnd their transformations proceed in harmony.\n*The Dao/Way of perfect stillness*\nCannot be fully measured by calendars and computations.\n*Yet there exist wondrous instruments,*\nWhich give rise to all phenomena.\n*The Eight Trigrams and the Heavenly Stems/Earthly Branches*\nContain divine mechanisms and arcane concealments.\n*The art of yin and yang overcoming one another*\nIs clearly manifested beyond the realm of symbols.\n*The Yellow Emperor’s *Yīn Fú Jīng* (Secret Signs of Yin) [with] annotations concludes here.*»",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "黄帝阴符经集解 经名：黄帝阴符经集解。 袁淑真撰，约出於北宋。 《通志艺文略》、宋《秘书省四库缺书目》均着录袁淑真《阴符经疏》三卷，当即此书。 《宋史艺文志》 亦着录袁淑真《阴符经集解》五卷。 今本三卷。 底本出处：《正统道藏》洞真部玉诀类。 黄帝阴符经集解序 黄帝智穷恍惚，思极窈冥，辩天人合变之机，演阴阳动植之妙，经云：知之修炼，谓之圣人。 所言黄帝得之以登云天，信其明矣。 黄帝阐弘道义，务欲救人，或恐后来昧於修习，乃简集其要三百余言，洞启真源，传示於世。 贤人秘隐，寔曰仙经，世人相承，俱谓兵法。 此经文少而义博，词近而理深。 先儒数贤，并精注解，义终省略，使中士或存或亡。 洎乎唐陇西李筌，尤加说释，亦不立章疏，何以光畅玄文？ 骊山母云：阴符三百言，百言演道，百言演法，百言演术。 又曰：上有神仙抱一之道，中有富国安人之法，下有强兵战胜之术。 圣母发明三体，此乃三章显然。 儒流因循，然无分析。 今辄叙三章之要义，以为上中下三卷，各述其本，因义亦有等威，先注略举其纲宗，后疏冀陈其周细，非厨前贤之广达，聊申后学之寡文耳。 黄帝阴符经集解卷上 朝散郎行潭州长沙县主簿袁淑真集解 神仙抱一演道章 经曰：观天之道，执天之行，尽矣。 淑真曰：但观天之道而理，执天之道而行，则阴阳动静之宜尽矣。 天者，阴阳之精气也，轻清者上浮为天，阴之精气重浊者下沉为地。 天地相连而不相离，故列子御寇谓杞国人曰； 天积气耳，地积块耳，自地已上则皆天也，子终日行於天中，奈何忧天崩乎？ 故知天地则阴阳之二气，气中有子，名曰五行者，阴阳之动用也。 万物才而生焉，万物则五行之子也。 故使人观天地阴阳之道，执天之五气而行，则兴废可知，生死可察。 除此之外，更无可观执，故言尽矣。 经曰：故天有五贼，见之者昌。 五贼在心，施行于天。 宇宙在乎手，万化生乎身。 淑真曰：天生五行谓之五贼，使人用心观执，奉天而行，则宇宙在乎掌中，万物生乎身上。 五贼者，五行之气也，则金、木、水、火、土焉。 吕望注云：圣人谓之五贼，天下谓之五德。 人食五味而死，无有怨而弃之者，此五贼之义也。 袁氏曰：所言贼者，害也。 逆之不顺则与人为害，故曰贼也。 此言阴阳之中包含五气，故云：天有五贼。 此者在天为五星，在地为五岳，在位为五方，在物为五色，在声为五音，在食为五味，在人为五脏，在道为五德，不善用之则为贼也。 贼者，五行更相制伏，递为生煞，昼夜不停，亦能盗窃人之生死、万物成败，故言贼也。 人但能明五行制伏之道，审阴阳兴废之源，则而行之为见也，如此实五藏，善能用之，则为福德而昌盛也。 又人能知五贼者，何也？ 在其心，故言五贼在心。 心既知之，使人用以观执五气而行，睹逆顺而不差，合天机而不失，则宇宙在乎手中，万物生乎身上。 如此则吉无不利，与道同游，岂不为昌乎？ 在履官之道，执仁义礼智信则富贵荣盛，岂不昌乎？ 故曰：见之者昌也。 但能依五行相生而用之则为道德，合於阳也。 相克之道用之则为贼害，合於阴也。 故三界天师皆用理世，所立经教，只言修善而称道德，不令修恶而称贼害也。",
      "translated_text": "**Title: *The Yellow Emperor’s Yinshu Jing with Explanations* (Huangdi Yinshu Jing Jiejie)**\n\n**Author & Attribution:**\nComposed by **Yuan Shuxin**, likely from the Northern Song dynasty.\nRecorded in the *Comprehensive Records of Literature* (*Tongzhi Yiyonglüe*) and the *Song Secretariat’s Four Libraries’ Missing Books Catalogue* (*Song Shimi Si Ku Que Shu Mu*) as *Yuan Shuxin’s Commentary on the Yinshu Jing* (三卷), which corresponds to this text.\nThe *Song History’s Literary Records* (*Song Shi Yiwenzhi*) also lists *Yuan Shuxin’s Explanations of the Yinshu Jing* (五卷). The extant version comprises three volumes.\nSource of the base text: *The Zhengtong Daoist Canon* (*Zhengtong Daozang*), in the *Dongzhen* (Verdant Purity) section, *Yujue* (Jade Precepts) category.\n\n---\n\n### **Preface to *The Yellow Emperor’s Yinshu Jing with Explanations***\n\nThe Yellow Emperor, in his profound contemplation, reached the depths of boundless mystery (*huanghuang*), pondering the interplay of Heaven and humanity, elucidating the subtle workings of yin and yang in motion and stillness. The text states: *\"To know and refine—this is the sage.\"* Indeed, the Yellow Emperor attained this and ascended to the Cloud Celestial; his wisdom was unmatched.\n\nThe Yellow Emperor expounded the Dao’s principles, seeking to save all beings. Fearing later generations might neglect its practice, he condensed its essence into over three hundred words, piercing to the true source and transmitting it to the world. The worthy concealed it as a *xian* scripture, yet common folk passed it down as a military treatise.\n\nThis text is concise yet profound, its words simple yet its meaning deep. Former scholars, though many, offered interpretations, yet their explanations remained incomplete, leaving mediocre scholars either preserving or losing its core. Until the Tang dynasty’s **Lixian of Longxi (Li Qun)**, who further elucidated it—yet without establishing chapter-by-chapter commentary—how then could the profound text be fully illuminated?\n\nThe **Mother of Mount Li** said: *\"The Yinshu’s three hundred words—one hundred speak of the Dao, one hundred of method (*fa*), one hundred of technique (*shu*).\"* She further stated: *\"Above, there is the Dao of the Immortals embracing Oneness; in the middle, the method of enriching the state and benefiting the people; below, the technique of strengthening arms and achieving victory.\"* The Holy Mother revealed these three aspects clearly.\n\nConfucian scholars followed tradition but failed to analyze them. Now, I shall outline the three chapters’ essential meanings, dividing them into three volumes—upper, middle, and lower—each expounding its foundation. First, I briefly sketch the framework; later, I elaborate in detail. This is not to surpass former masters but to supplement the deficiencies of later learners.\n\n---\n\n### **Volume One: Explanations by Yuan Shuxin, Former Official and County Magistrate of Changsha, Yuan Shuxin**\n**Chapter: The Immortal’s Embracing of Oneness—Elucidating the Dao**\n\n**Text:**\n*\"Observe the Dao of Heaven, grasp Heaven’s actions—thus it is complete.\"*\n\n**Yuan Shuxin’s Explanation:**\nIf one observes Heaven’s Dao in principle and follows it in practice, then the proper interplay of yin and yang in motion and stillness is fully realized.\n\nHeaven is the refined *qi* of yin and yang. The light and pure ascends to form Heaven, while the heavy and turbid descends to form Earth. Heaven and Earth are connected yet never separate. Thus, **Liezi** in *Yuce* told the people of **Qi**: *\"Heaven is merely accumulated *qi*; Earth is merely accumulated matter. From Earth upward, all is Heaven. You walk within Heaven all day—why fear its collapse?\"*\n\nThus, knowing Heaven and Earth reveals that yin and yang are two *qi*, and within *qi* are the Five Phases (*wuxing*), which are the dynamic functions of yin and yang. All things emerge and grow from them; thus, they are the offspring of the Five Phases.\n\nIf one observes the Dao of Heaven and Earth—yin and yang—and follows the Five *Qi* of Heaven in action, then the rise and fall of all things, life and death, can be discerned. Beyond this, there is nothing further to observe or grasp—hence, *\"it is complete.\"*\n\n**Text:**\n*\"Thus, Heaven has five ‘bandits’ (*zei*); those who see them prosper.\"*\n\n*\"The five ‘bandits’ dwell in the heart; their actions extend to Heaven. The cosmos lies within the palm; all transformations arise from the body.\"*\n\n**Yuan Shuxin’s Explanation:**\nHeaven generates the Five Phases—these are the *\"five bandits.\"* If one attends to them with the mind, follows Heaven’s actions, then the cosmos rests within the palm, and all things manifest from the body.\n\nThe *\"five bandits\"* are the *qi* of the Five Phases: Metal, Wood, Water, Fire, and Earth.\n\n**Lü Wang’s Commentary** states: *\"The sage calls them ‘bandits’; the world calls them ‘virtues’ (*de*).\"* People consume the Five Flavors yet do not resent them for causing death—this is the meaning of *\"bandits.\"*\n\n**Yuan Shuxin’s View:**\n*\"Bandits\"* means *\"harm.\"* If one acts contrary to their natural order, they become harmful—thus, they are called *\"bandits.\"*\n\nThis refers to how yin and yang encompass the Five *Qi*. In Heaven, they are the Five Stars; on Earth, the Five Sacred Peaks; in governance, the Five Directions; in things, the Five Colors; in sound, the Five Tones; in food, the Five Flavors; in the body, the Five Viscera; in the Dao, the Five Virtues. If not used properly, they become *\"bandits.\"*\n\n*\"Bandits\"* refers to how the Five Phases mutually restrain and generate one another, ceaselessly day and night, able to steal life and death, the success and failure of all things—hence, *\"bandits.\"*\n\nIf one understands the restraining Dao of the Five Phases and discerns the sources of yin and yang’s rise and fall, then acting in accordance with them is *\"seeing\"* them. Thus, the Five Viscera are truly realized, and skillful use brings fortune and prosperity.\n\nWhy does the text say, *\"Those who see them prosper\"*? Because the Five Phases are within the heart. Once the heart knows them, one uses them to observe and grasp the Five *Qi* in action, distinguishing between what is contrary and what is顺, aligning with Heaven’s mechanisms without error. Then, the cosmos lies within the palm, and all things arise from the body. Thus, all actions are auspicious, and one wanders with the Dao—how could this not bring prosperity?\n\nIn governing, if one upholds *ren* (benevolence), *yi* (righteousness), *li* (rites), *zhi* (wisdom), and *xin* (faithfulness), one achieves wealth, honor, and flourishing—how could this not be prosperity?\n\nThus, if one follows the Five Phases’ generating cycle in action, it aligns with *yang* and becomes *virtue/power* (*de*). If one applies their restraining cycle, it aligns with *yin* and becomes *\"bandits\"*—harm.\n\nTherefore, the Three Realms’ Celestial Masters all govern by principle, and their established scriptures and teachings speak only of cultivating goodness and calling it *virtue/power*, never of cultivating evil and calling it *\"bandits\"* or harm.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1246,
      "start_sentence": 0,
      "end_sentence": 53,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 18.104938983917236,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\黄帝阴符经集解（宋袁淑真）.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "故知善修道德者，仙也，是阳之主也； 阴恶贼害者，魔也，是阴之精。 除此之外，虚广其谈也。 故宣尼云：《诗三百》，一言以蔽之，曰思无邪。 《易》曰：出其言善则千里之外应，言不善则违。 此其至道也，何必广谈修习者欤？ 合道之体，不在此间，能知天地阴阳成败之原者，皆在此《阴符》首章而尽理矣。 世人见文少而言近，不闲理要而义深，亦何啻三教经书广博所陈也？ 故骊山母云：观其精理，《黄庭》八景不足以为学； 察其至要，经传子史不足以为文； 任其巧智，孙吴韩白不足以为奇。 此其义也。 经曰：天性，人也。 人心，机也。 立天之道，以定人也。 淑真曰：言以立天定人，在乎五贼。 夫人心主魂之官，身是神之府也。 将欲施行五贼者，莫尚乎心。 故心能之事有所，此图必合天道。 此则宇宙虽广，观览只在手中； 万物虽多，生杀不出於术内。 则明天地不足贵以远厚，而况耳目之前乎？ 故曰：心正可以辟邪。 经曰：天发杀机，龙蛇起陆。 人发杀机，天地反覆。 天人合发，万变定机。 淑真曰：天发杀机，公道也； 人发杀机，私情也。 龙蛇感公道而震起，私情紊天地而反覆，俱合於公道，则千万化无不定矣。 天含五气，递为生杀，自然有之。 天道生杀，皆合其机，宜不妄动，阴阳变化，时代迁谢，去故就新，此天发杀机，皆至公也。 乘天威杀之机，或龙或蛇，沉隐之类，皆能震起於陵陆。 顺天应时，畅达於其间，为乘天之机，不失其宜也。 人发杀机，天地反覆者，人是五行之子，须顺五气之生杀，任阴阳之陶运，何得擅自兴其生杀乎？ 至如世间之法，杀人者死，杀生者罪，何也？ 为非天之合杀彼人，奈何敢杀之乎？ 言人不合妄动杀机也。 至若奸臣逆节，违背天道，反叛君亲，恣行凶恶，损害於世，擅行屠戮，妄动杀机者，有何？ 翻天作地，覆地作天，如此之大乱，为逆天之大祸，是名天地反覆。 此则人怨神怒，天将诛之，人共杀之。 有失天地之圣君，若天人俱合其杀机，则是名天人合发，万变定机也。 伐叛讨逆，顺天行诛，皆合天之机宜，惬至公之正道，则万物咸伏，无敢妄动，是名定机。 君臣之道，贵其公正，若能动用合其天机，应用同其天道，此即天人合发。 奚为由此则人安其心，物安其体，五行安其位，岳渎安其灵。 上施道德，下符礼义，灾害不生，祸乱不作，天人静嘿，名曰天机。 经曰：性有巧拙，可以伏藏。 淑真曰：人之巧拙，不可显露； 慎言择善，无使患生也。 人怀性智，巧拙贤愚，悉共有之，但少而言也。 至如几情之人，有少巧智辩慧，便驰骋显露，不料得失，反招其咎者，何也？ 为不隐密，不诫慎，以致於倾败耳。 《德经》曰：大辩若讷，大巧若拙。 言忆密也。 《周易》曰：君不密则失臣，臣不密则失身，机事不密则害成。 由斯之谓也。 伏藏者，贤人君子纵有巧智辩慧之性、博学多闻之才，动静合於机宜，可不为巧乎？ 常能伏藏，隐密巨细，用之恐被嫉姤谗毁，反招其答。 况愚拙之人，自率於心，造次兴动，不自藏隐，立招患咎。 贤人养道育德，巧拙之性俱隐於身，然后内观正性，外鄙邪淫，善即行之，不善损之，修身炼行而成圣人，外人安能知我巧拙之性乎？",
      "translated_text": "Thus, those who cultivate *virtue/power* (*de*) with goodness are *xian*—masters of *yang*; those who indulge in *yin*’s evil and harm are *mo*—essence of *yin*. Beyond this, idle discourse is vain.\n\nHence, Confucius proclaimed: *\"The Three Hundred Poems\"* may be summed in one phrase—*\"Think not evil.\"* The *Yijing* states: *\"When one’s words are good, they resonate a thousand miles away; when they are not, they meet with resistance.\"* This is the ultimate Dao—why must one elaborate on cultivation?\n\nThe essence of the Dao lies not in these words. Those who grasp the origins of *yin-yang*’s success and failure in the Three Realms find all principles exhausted in the first chapter of the *Yinfu*. Yet common folk, seeing few words and shallow meaning, fail to fathom profound logic beneath the surface—how much more so than the vast teachings of the Three Teachings?\n\nThus, the Mother of Mount Li said: *\"To observe its refined principles, the Eight Scenes of the *Huangting* are insufficient for study; to discern its utmost essence, the Classics, Commentaries, and Histories are inadequate for exposition; to employ cunning intelligence, the stratagems of Sunzi, Wuqi, Han Fei, and Baiqi are insufficient for ingenuity.\"* Such is its meaning.\n\nThe scripture says: *\"Heaven’s nature is humanity; human heart is the mechanism.\"* Establishing Heaven’s Dao to govern humanity.\n\n*Shuzhen* says: *\"To establish Heaven and govern humanity lies in the Five Evils.\"* For the human heart governs the soul’s office, while the body is the spirit’s domain. When one seeks to enact the Five Evils, none surpasses the heart’s influence. Thus, if the heart’s deeds are deliberate, this diagram must align with Heaven’s Dao.\n\nThen, though the cosmos be vast, all observation lies within the hand; though myriad things exist, their life and death are confined within technique. Thus, Heaven and Earth are not to be prized for their remoteness, let alone what lies before the ears and eyes. Hence it is said: *\"A rectified heart repels evil.\"*\n\nThe scripture says: *\"When Heaven unleashes the killing mechanism, dragons and serpents rise upon the land. When humanity unleashes the killing mechanism, Heaven and Earth invert.\"* When Heaven and humanity jointly unleash the killing mechanism, all transformations are fixed.\n\n*Shuzhen* says: *\"Heaven’s killing mechanism is the public way; humanity’s is private sentiment.\"* Dragons and serpents, stirred by the public way, rise in trembling; private sentiment disrupts Heaven and Earth, causing inversion. Both align with the public way, and thus ten thousand transformations are fixed.\n\nHeaven contains the Five *qi*, sequentially giving life and death—this is natural. Heaven’s life and death mechanisms all align with their proper function; they should not act arbitrarily. *Yin-yang* transformation, eras shifting, discarding the old for the new—this is Heaven’s killing mechanism, utterly just.\n\nThose who ride Heaven’s killing mechanism, whether as dragons or serpents, or hidden beings, all rise in trembling upon the heights. Following Heaven’s timing, they move freely within their due—this is to ride Heaven’s mechanism without error.\n\nWhen humanity unleashes the killing mechanism, causing Heaven and Earth to invert: humanity is the child of the Five Phases, and must follow the Five *qi*’s life and death, submit to *yin-yang*’s transformation. How dare they presumptuously stir life and death?\n\nAs for the world’s laws: *\"He who kills shall die; he who takes life shall be punished.\"* Why? Because it is not Heaven’s will to kill that person—how dare they kill?\n\nAs for treacherous ministers, rebellious subjects who defy Heaven’s Dao, betray their sovereign and kin, indulge in cruelty, harm the world, and presumptuously slaughter—what then? They invert Heaven to make Earth, and Earth to make Heaven. Such great chaos is the greatest calamity against Heaven—this is called *Heaven and Earth’s inversion*.\n\nThen, humanity’s resentment and the gods’ wrath arise; Heaven will punish them, and humanity will slay them. If a ruler loses Heaven’s mandate, and both Heaven and humanity align in their killing mechanism, this is called *\"Heaven and humanity jointly unleashing the mechanism, fixing all transformations.\"*\n\nTo subdue rebels and punish traitors, executing them in accordance with Heaven’s will—this aligns with Heaven’s proper mechanism, fulfilling the utmost justice. Then all things submit, none daring to act arbitrarily—this is called *fixing the mechanism*.\n\nThe Dao of ruler and subject values public justice. If one’s actions and responses align with Heaven’s mechanism, and their applications harmonize with Heaven’s Dao, this is *Heaven and humanity jointly unleashing the mechanism*.\n\nHow then does this bring peace to the heart, stability to all things, order to the Five Phases, and sanctity to mountains and rivers? Above, *virtue/power* and *Dao* are practiced; below, rites and righteousness are mirrored. Disasters do not arise, calamities do not occur—Heaven and humanity remain tranquil. This is called *Heaven’s mechanism*.\n\nThe scripture says: *\"Nature has skill and clumsiness, which may be concealed.\"* *Shuzhen* says: *\"Human skill and clumsiness must not be revealed; speak cautiously, choose goodness, lest misfortune arise.\"*\n\nAll possess innate wisdom—skill, clumsiness, virtue, and folly—yet few speak of it. As for those with slight cleverness, eloquence, and wisdom, who flaunt their talents without regard for gain or loss, only to invite ruin—why? Because they do not conceal themselves, do not act with caution, and thus court disaster.\n\nThe *De Jing* says: *\"Great eloquence seems stammering; great skill seems clumsy.\"* This speaks of concealment. The *Zhouyi* says: *\"If the ruler is not discreet, he loses his ministers; if the minister is not discreet, he loses his life; if affairs are not discreet, harm is done.\"* Such is the meaning.\n\nTo conceal means that even the wise and virtuous, though possessing cleverness, eloquence, and vast learning, must in action align with propriety—how then is this not skill? If they always conceal themselves, hiding great and small, their use may invite jealousy, envy, slander, and retaliation. How much more so for the clumsy and foolish, who act impulsively, revealing nothing, and thus invite misfortune?\n\nThe virtuous cultivate the Dao and nurture *virtue/power*; their skill and clumsiness are hidden within. Then, inwardly, they observe their true nature; outwardly, they scorn evil and licentiousness. They act upon the good and diminish the bad, refining their conduct to become sages—how could outsiders know their innate skill or clumsiness?",
      "overlap_context": "ing—how could this not be prosperity?\n\nThus, if one follows the Five Phases’ generating cycle in action, it aligns with *yang* and becomes *virtue/power* (*de*). If one applies their restraining cycle, it aligns with *yin* and becomes *\"bandits\"*—harm.\n\nTherefore, the Three Realms’ Celestial Masters all govern by principle, and their established scriptures and teachings speak only of cultivating goodness and calling it *virtue/power*, never of cultivating evil and calling it *\"bandits\"* or harm.",
      "start_char": 1246,
      "end_char": 2469,
      "start_sentence": 54,
      "end_sentence": 112,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 14.29024863243103,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\黄帝阴符经集解（宋袁淑真）.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "皆谓我天然贤圣，不知修炼而政之，故曰：可以伏藏也。 经曰：九窍之邪，在乎三要，可以动静。 淑真曰：言人九窍俱皆能生患，在於要耳、目、口也，今诫慎无令祸生。 庄生云：人有百骸九窍六腑，体而存焉。 人禀五气而成，头圆足方，四肢五脏，三魂七魄，递生邪正，互为君臣。 在身通流运动者，九窍也。 邪正祸福之急者，在三要焉，即眼、耳、口也。 《道经》曰：五色令人目盲，五音令人耳聋，五味令人口爽是也。 道德之士，眼不视邪色，耳不听邪声，口不谈邪事。 所有正事，则视听言谈之，此名动也； 涉其邪忘，悉不将心视听言说，此名静也。 宣尼云：择其善者而从之，此名动也； 择不善者而改之，此名静也。 《孝经》云：言满天下无口过，行满天下无怨恶者，所缘身心正而无邪恶以致此也。 但遇善则动，逢邪则静，此则身无祸息皆在眼、耳、口固慎。 故云：在乎三要，可以动静也。 经曰：火生於木，祸发必克。 奸生於国，时动必溃。 知之修炼，谓之圣人。 淑真曰：奸火喻人之性，木国喻人之身，使人理国安身，令奸火不发，然后修身炼行而成圣人也。 此一科圣意兴其喻也，为上文九邪三要动静之宜，切令诫慎恐未能穷理尽性，故兴此火木奸国为喻，令殷勤修炼以成圣人。 言木有火者，喻人身中有邪恶之性、五毒之火也。 吕望注云：广成子以为积火焚五毒，故知火者猛烈之气。 《书》云：火炎昆岗，玉石俱焚矣。 木中有火，慎勿钻研，火发则木焚矣。 身中邪毒慎勿纵，恣之则万善俱灭，其身溃矣。 奸生於国，时动必溃者，凡有此国，其中别有奸人贼臣包祸以思国也。 篡夺苟谋富贵，如此之类不一，皆潜藏於国中，君不可知之。 但君怀道德，臣效忠良，时和俗阜，天下宁泰，奸人纵有心，无由妄敢兴动。 皆候其时，合动始动，安得君道失，臣道丧，兵水旱蝗，征敛苛克，人心变易，思乱怨上，当此之代，万物皆有乱心，何况怀奸之人奈何不动乎？ 又奸者不一，来此隳败之时，诸奸竞发，其国安得不溃乎？ 此喻上之九邪三要巧拙动静也。 言人有道德，定慧隐在身心之中，诸邪淫秽僻亦不能兴动矣； 若邪淫竞发，则身溃矣。 故以奸火藏於木国喻邪正伏隐於身心，此喻贤智之士通详其文，晓达明悟，精念至道，去恶存善，是名知之修炼，谓之圣人。 故曰：上有神仙抱一之道。 又诸葛孔明云：圣人藏之於心，陶甄天地，黄帝是也。 贤人学得其法。 淑真曰：为五行之善政，不违天时，不逆地理，不伤时，不害物，富国安人，身为贤明，乃得其法。 道德之君，尧舜是也。 智人学之得其术。 淑真曰：用天之道，分地之利，谨身节用以养父母，仁义礼智信忠孝君亲，贞廉不失，保其禄位，是得其术。 贤臣夔龙等是也。 小人学之得其殃。 淑真曰：为将天道五行之气，不思习善之用，以巧智辩慧之性，专事三反昼夜，烦兵黩武，阴谋屠害，苟求奢荣，倾夺於在世，虽暂得富贵，不思祸患将至，反招亡败，延及后世，是得其殃。 禄山思明，古今篡逆悖乱之臣等是也。 圣母又言：此文深奥，若巨海之朝百谷也。 此神仙抱一演道章上，一百五言，皆使人明阴阳之道，察兴废之理，动用各得其宜，然后修身炼行以成圣人矣。",
      "translated_text": "「All say I am naturally virtuous and saintly, yet they do not know the cultivation and refinement that bring this about, hence the saying: *\"It can be concealed.\"*\n\nThe Classics state: *\"The nine orifices’* **evil tendencies** (邪, *xie*—harmful or misaligned tendencies), rooted in the three essentials—**eyes, ears, and mouth**—can be governed through **action and stillness** (动静, *dongjing*—active and passive responses).\"\n\n**Shu Zhen** (淑真) says: *\"The nine orifices* (九窍, *jiuqiao*—nine sensory openings: two eyes, two ears, two nostrils, mouth, anus) *all can generate afflictions*, but these originate from the three essentials—**speech, sight, and hearing**—so one must be cautious to prevent calamity from arising.\"*\n\n**Zhuangzi** (庄生) taught: *\"Humans possess a hundred limbs, nine orifices, and six viscera* (六腑, *liufu*—six internal organs: liver, gallbladder, spleen, stomach, large intestine, small intestine), *yet life persists within them.* Humans are formed from the five **qi** (五气, *wuq*—five elemental breaths: wood, fire, earth, metal, water), with the head round and the feet square. The four limbs and five viscera, along with the **three souls** (三魂, *sanhun*—spiritual essences associated with the kidneys, liver, and lungs) and **seven spirits** (七魄, *qiqi*—spiritual essences associated with the heart, spleen, lungs, kidneys, liver, gallbladder), alternately give rise to **evil and virtue** (邪正, *xiezheng*—harmful and harmonious tendencies), and reciprocally serve as **lord and subject** (君臣, *junchen*—ruling and subordinate forces).\n\nAmong these, the **nine orifices** (九窍) are the pathways where **evil and virtue**, **calamity and blessing** (祸福, *huofu*—misfortune and fortune) flow through the body. The most urgent matters of **evil and virtue**, **calamity and blessing**, lie within the **three essentials**—that is, the **eyes, ears, and mouth** (眼、耳、口).\n\nThe *Dao De Jing* (《道经》) says: *\"The five colors* (五色, *wuse*—colors associated with the five elements: green, red, yellow, white, black) *blind the eyes, the five sounds* (五音, *wuyin*—musical notes associated with the five elements) *deafen the ears, and the five flavors* (五味, *wuwei*—tastes associated with the five elements) *dull the mouth.\"* This is so.\n\nThose who embody **Dao and virtue** (道德, *daode*—the Way and its moral power) do not let their eyes behold **evil colors** (邪色, *xieze*—lustful or corrupting sights), their ears listen to **evil sounds** (邪声, *xieyin*—harmful or seditious words), or their mouths speak of **evil matters** (邪事, *xieqi*—wicked deeds). For all **virtuous affairs** (正事, *zhengshi*—righteous or beneficial matters), they engage in **seeing, hearing, and speaking** of them—this is called **action** (动).\n\nWhen encountering **evil**, they forget it, and **all** (悉, *xi*—completely) do not allow their **hearts, eyes, ears, and mouths** to dwell upon or repeat it—this is called **stillness** (静).\n\n**Confucius** (宣尼) said: *\"To choose and follow the good is called **action** (动). To choose and abandon what is not good is called **stillness** (静).\"*\n\nThe *Xiao Jing* (《孝经》) states: *\"When words fill the world, there is no mouth without fault; when actions fill the world, there is no resentment or grievance*—this arises because one’s **body and mind** (身心, *shenxin*) are upright and free from **evil tendencies** (邪恶, *xie’e*), thus achieving this outcome. But when one encounters the good, they act; when they meet with **evil**, they remain still—then **all calamities and misfortunes** (祸息, *huoxi*—disasters and afflictions) are prevented by the **eyes, ears, and mouth** being firmly guarded.\n\nHence the saying: *\"The nine evils lie in the three essentials, which can be governed through action and stillness.\"*\n\nThe Classics also say: *\"Fire arises from wood, and when calamity erupts, it must be subdued.\"* *\"Delusion* (奸, *jian*—deceit, corruption) *arises within the realm* (国, *guo*—state, body), *and when it acts at the wrong time, it will collapse.*\" Knowing this and refining oneself is what is called a **sage** (圣人).\n\n**Shu Zhen** says: *\"The metaphor of* **delusion-fire** (奸火, *jianhuo*—corrupting or harmful tendencies) *is likened to human nature, while* **wood-realm** (木国, *muguo*—the body as a realm) *is likened to the human form. This teaches one to govern their state and stabilize their body, preventing* **delusion-fire** *from erupting, and then refining their conduct to become a sage.*\"\n\nThis is one illustration of the **sage’s intent** (圣意, *shengyi*), using metaphors to clarify the **appropriateness of action and stillness** for the **nine evils** and **three essentials** above. It urges one to be earnest in cultivation and refinement, lest they fail to exhaust the principles and fully grasp their nature. Thus, the metaphor of **fire hidden within wood and delusion within the realm** is employed, commanding diligent refinement to attain sainthood.\n\nThe phrase *\"wood contains fire\"* is a metaphor for *\"the human body harbors* **evil tendencies** (邪恶, *xie’e*) *and the* **Five Poisons** (五毒, *wudu*—five corrupting influences: lust, anger, greed, delusion, doubt).\" **Lu Wang** (吕望, *i.e.*, Zhuangzi) annotated: *\"Guang Chengzi* (广成子, *a Daoist sage*) *believed that accumulating fire could purge the* **Five Poisons***, thus knowing fire as a fierce and powerful* **qi** (气).\"\n\nThe *Book of Documents* (《书》) says: *\"Fire blazes across the hills, and even jade and stone are consumed.\"* If **fire** is present within **wood**, one must beware of probing it—when the fire erupts, the wood will burn. If **evil tendencies** and **poisons** reside within the body, one must be cautious not to indulge them—if they are given free rein, **all goodness** (万善, *wanshan*) *will perish, and the body will collapse.*\n\nThe saying *\"Delusion arises within the realm, and when it acts at the wrong time, it will collapse\"* means that in any **realm** (国), there are inevitably **deceitful individuals** (奸人, *jianren*) *and treacherous ministers* (贼臣, *zeichen*) *who harbor calamity and plot against the state.* They scheme to usurp power or seek wealth and honor through underhanded means—such cases are countless. All these **evil tendencies** lurk within the realm, yet the ruler cannot fully discern them.\n\nBut if the ruler upholds **Dao and virtue**, and the ministers act with loyalty and integrity, if the times are harmonious and customs flourish, then the world will be at peace. Even if **deceitful individuals** have wicked intentions, they lack the means to recklessly act upon them. They await their opportunity, and only when conditions align do they move—how could the ruler lose their **Dao**, or the ministers abandon their **virtue**, when **floods, droughts, famines, and plagues** (兵水旱蝗, *bingshuihanhuang*—military conflicts, floods, droughts, locusts) arise, and **taxation and levies** (征敛, *zhenglian*) *are harshly imposed* (苛克, *keke*—excessively oppressive)? In such eras, **all things** (万物, *wanwu*) *are filled with rebellious intent*—how much more so for those who already harbor **delusion**? How could they refrain from acting?\n\nMoreover, **delusion** takes many forms. When the time comes for their schemes to unfold, all manner of **corruption** erupts, and how could such a **realm** avoid collapse? This metaphor illustrates the **nine evils** and **three essentials**, explaining the **appropriateness of action and stillness** for the wise and virtuous.\n\nThe saying goes: *\"If one possesses* **Dao and virtue**, *the wisdom and insight* (定慧, *dinghui*—calm discernment and enlightened wisdom) *are concealed within their* **body and mind**. *Even* **evil tendencies, licentiousness, and depravity** (淫秽僻, *yinhuiqi*—lustful, filthy, and perverse inclinations) *cannot provoke them to act.* If **evil tendencies** and **licentiousness** erupt unchecked, then the body will collapse. Hence, the metaphor of **delusion-fire** hidden within the **wood-realm** illustrates how **evil and virtue** are concealed within the **body and mind**. This metaphor reveals that the wise and virtuous thoroughly understand its meaning, comprehend the principles of **interest and decline** (兴废, *xingfei*—rise and fall), and apply **action and stillness** appropriately. Then, through refining their conduct and purifying their actions, they become sages—this is called knowing and cultivating, and thus they are called sages.*\"\n\nHence the saying: *\"Above, there is the Dao of the* **immortal sages** (神仙, *shenxian*) *who embrace* **Oneness** (抱一, *baoyi*—embracing the singular, unified principle).\"\n\n**Zhuge Liang** (诸葛孔明) further stated: *\"The sage conceals their wisdom within the heart, shaping the* **Heaven and Earth** (天地, *tiandi*) *as if molding clay*—this is the way of the* **Yellow Emperor** (黄帝). *The virtuous learn and master this method.*\"\n\n**Shu Zhen** says: *\"To govern through the five elements’* **virtue** (五行之善政, *wuxing zhishen zheng*—beneficial policies aligned with the five phases), *not to defy Heaven’s timing* (不逆天时, *buini tian shi*—not opposing the natural seasons), *not to disrupt Earth’s order* (不逆地理, *buni di li*—not contravening natural laws), *not to harm the times* (不伤时, *bu shang shi*—not damaging the temporal flow), *and not to injure beings* (不害物, *bu hai wu*—not harming living things)—to enrich the state and secure its people, making oneself a virtuous and wise ruler—this is to master the method.*\n\nThose who embody **Dao and virtue** as rulers are like **Emperor Yao** (尧) *and* **Emperor Shun** (舜). *The wise learn and attain the art.*\"\n\n**Shu Zhen** says: *\"To apply Heaven’s Dao, to distribute Earth’s benefits, to be cautious in one’s conduct and moderate in one’s use to nourish one’s parents—this is to practice* **ren** (仁, *benevolence*), **yi** (义, *righteousness*), **li** (礼, *propriety*), **zhi** (智, *wisdom*), **xin** (信, *trustworthiness*), **zhong** (忠, *loyalty*), **xiao** (孝, *filial piety*), and to honor **jun** (君, *ruler*) and **qin** (亲, *kin)—to remain steadfast in* **cheng** (贞, *uprightness*) *and* **lian** (廉, *integrity*), *and to safeguard one’s blessings and position*—this is to attain the art. Such are the virtuous ministers like **Qin** (夔) *and* **Long** (龙).\"\n\n*The petty learn and reap their punishment.*\"\n\n**Shu Zhen** says: *\"To command the* **Five Phases’ qi** (五行之气, *wuxing zhqi*—elemental breaths of wood, fire, earth, metal, water) *without considering the beneficial applications of cultivation, using one’s cleverness, eloquence, and wisdom* (巧智辩慧, *qiaozhi bianhui*—artifice, intelligence, persuasive cunning) *to engage in the three reversals* (三反, *sanfan*—three forms of perversion: harming Heaven, Earth, and humanity) *day and night—disturbing the military, indulging in warfare, plotting secretly to slaughter and harm, selfishly pursuing luxury and splendor, plundering and seizing from others in this world*—though they may temporarily gain wealth and honor, they do not reflect upon the impending **calamity** (祸患, *huohuan*), instead inviting **ruin and defeat** (亡败, *wangbai*), which extend to future generations. This is to reap their punishment. Such are the **usurpers and treacherous ministers** (篡逆悖乱之臣, *cuan ni beiluan zhichen*) like **Lu Sima** (禄山) *and* **An Lushan’s** (思明, *i.e.*, An Lushan’s title) *ancestors, the deceitful and rebellious officials of ancient and modern times.*\"\n\nThe **Sage Mother** (圣母, *Shengmu*—likely referring to **Lady Zhi** or **Empress Fu Shou**, mythical Daoist figures) further remarks: *\"This text is profound and vast, like the morning tide of the great sea that gathers all streams.\"* It is the **chapter of the immortal sages embracing Oneness and manifesting the Dao** (抱一演道章, *baoyi yandao zhang*—section on the unified principle and its unfolding in the Way) from the **one hundred and five words** above. All these teachings clarify the **principles of yin and yang** (阴阳之道, *yinyang zhidao*), the **logic of rise and fall** (兴废之理, *xingfei zhili*), and the **appropriateness of action and stillness**—then one must refine their conduct and purify their actions to become a sage.*\"",
      "overlap_context": "e jealousy, envy, slander, and retaliation. How much more so for the clumsy and foolish, who act impulsively, revealing nothing, and thus invite misfortune?\n\nThe virtuous cultivate the Dao and nurture *virtue/power*; their skill and clumsiness are hidden within. Then, inwardly, they observe their true nature; outwardly, they scorn evil and licentiousness. They act upon the good and diminish the bad, refining their conduct to become sages—how could outsiders know their innate skill or clumsiness?",
      "start_char": 2469,
      "end_char": 3693,
      "start_sentence": 113,
      "end_sentence": 160,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 39.96663308143616,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\黄帝阴符经集解（宋袁淑真）.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "黄帝阴符经集解卷上 黄帝阴符经集解卷中 朝散郎行潭州长沙县主簿袁淑真集解 富国安人演法章 经曰：天地，万物之盗； 淑真曰：天覆地载，万物潜生。 冲气暗滋，故曰盗也。 天地者，阴阳也。 阴阳二字，洎其五行，共成其七。 此外更改於物，则何惑之甚矣？ 言天地万物，胎卵湿化，百谷草木，悉承此七气而生长，从无形而能生有形，潜自滋育以成其体，如行窃盗，不觉不知。 天地亦潜与其气，应用无穷，皆私纳其覆育，各获其安。 故云：天地，万物之盗也。 经曰：万物，人之盗； 淑真曰：万物盗天而生长，人盗万物以资身，若知分合宜，亦自然之理也。 人与禽兽草木俱禀阴阳而生，为人之最灵，位处中宫，心怀智度，能反照正性，穷达本始，明会阴阳五行之气，则而用之，今《周易》六十四卦、六十甲子等是也。 故上文云：见之者昌也。 人於此七气之中所有生成之物，悉能潜取资养其身，故言曰盗，则田蚕之类是也。 《列子》曰：齐国氏大富，云：吾善为盗也。 天有时，地有利，天地之时利盗雨泽之滂润。 陆盗禽兽，水盗鱼鳖。 吾始为盗，一年而急，二年而足，三年大禳，自此已后，施及州闾。 吾盗天地而无殃咎，汝盗人之金帛，奈何无事辜乎？ 万物盗天地而生长，国民盗万物以资身，但知分合宜，亦自然之理。 此万物，人盗之义也。 经曰：人，万物之盗。 三盗既宜，三才既安。 淑真曰：既，尽也，三盗尽食其宜，则三才尽安其位矣。 言人但能盗万物资身以充荣富，不知万物反能盗人以生祸患。 言上来三义更相为盗者，亦自然之理者。 凡此相盗，其中皆须有道，惬其宜则吉，乖其理则凶。 故《列子》云：盗亦有道乎？ 曰：何适其无道也？ 见室中藏，圣也； 知可否，智也； 入先，勇也； 出后，义也； 分均，仁也。 无此五德而成大盗者，未之有也。 此乃盗中之道。 向於三盗之中，皆须有道，令尽合其宜，则三才不差，尽安其位矣。 皆不令越分伤性以生祸患也。 经曰：食其时，百骸理。 动其机，万化安。 淑真曰：言人饮食不失其时，则身无患咎； 兴动合其机宜，则万化安矣。 言人理性命者，皆谓饮食滋味也。 故《左氏传》曰：味以通气，气以通志，滋形润神，必归饮食也。 黄帝曰：人之服食，必先五味、五肉、五菜、五果，皆须调候得所，量体而进。 熟则益人，生则伤脏，此食时之义也。 故使人饮食不失其时，滋味不越其宜，适其中道，不令乖分伤性，则四肢调畅，五脏安和，不生疾患，长寿保终，岂不为百骸理乎？ 故《亢仓子》云：冬饱则身温，夏饱则身凉，时适则人无疾，人无疾则疫疠不行，疫疠不行则人得终天年。 故曰：谷者，人之命也，天是以兴王务农。 王不务农，是弃人也，将何有国、哉？ 但三盗尽合其宜，三才尽安其任，此皆合自然之理，然后须合明君贤臣调御於世，乘此既宜尽安之时，当须法令平正，用贤使能，泽及昆虫，化被草木，举动皆合天道之机宜，则阴阳顺时，寰宇宁泰，使万化之类获其安宁。 此则动其机，而万化安。 经曰：人知其神而神，不知不神所以神。 淑真曰：阴阳生成万物，人谓之神，不知有至道静嘿而不神，能生阴阳万物之至神矣。 神者，妙而不测者也。",
      "translated_text": "「The **Yellow Emperor’s *Yin Fu Jing* with Commentary, Volume One** and **Volume Two**—Commentary by **Cluan Shuxin**, a **Jiaosancang Lang** of **Changsha County**, **Xingtan Prefecture**—**Chapter on the Way of Prospering the Nation and Securing the People** (*Fu guo an ren yan fa zhang*)\n\nThe *Jing* states: *\"Heaven and Earth are the thieves of all things.\"*\n\nCluan Shuxin explains: *\"Heaven covers, Earth bears; all things grow unseen. The **qi of the void** (冲气, *chongqi*—primordial, unrestrained *qi*) nurtures in darkness, hence they are called 'thieves.' Heaven and Earth are none other than **yin and yang** (阴阳, *yinyang*). The terms **yin and yang** (阴阳), along with the **Five Phases** (五行, *wuxing*), together form the **Seven Qi** (七气, *qigong*). Beyond these, how can anything else in the world be more perplexing?*\n\nIt speaks of how all things—whether born from **embryonic development** (胎卵, *tailuán*), **moist transformation** (湿化, *shīhuà*), or **sprouting** (百谷草木, *bǎigǔ cǎomù*)—all derive from these **Seven Qi** to grow and flourish, emerging from the **formless** (无形, *wúxíng*) yet giving rise to the **formed** (有形, *yǒuxíng*). They silently nourish and complete their own bodies, like thieves in motion—unnoticed yet ever-present. Heaven and Earth also silently bestow their **qi**, responding endlessly, all things secretly receiving their cover and sustenance, each attaining its own peace.\n\nThus it is said: *\"Heaven and Earth are the thieves of all things.\"*\n\nThe *Jing* states: *\"All things are the thieves of man.\"*\n\nCluan Shuxin explains: *\"All things steal from Heaven and Earth to grow and flourish; man steals from all things to nourish his body. If one knows the proper **division and alignment** (分合宜, *fēnhé yí*), it is but the natural order of things.*\n\nMan, along with beasts, plants, and trees, all receives **yin and yang** to grow. Yet man is the most **refined** (最灵, *zuìlíng*), positioned in the **central realm** (中宫, *zhōnggōng*), with a **mind of wisdom and insight** (智度, *zhìdù*), capable of **reflecting upon his true nature** (反照正性, *fǎnzhào zhèngxìng*), penetrating to the **original source** (本始, *běnshǐ*), and comprehending the **harmonious interplay** (明会, *mínghuì*) of the **qi of yin and yang and the Five Phases**. He follows their patterns and applies them—this is why the **Sixty-Four Hexagrams of the *Zhou Yi*** (周易六十四卦, *Zhōuyì liùshísì guà*) and the **Sixty Jiazi Cycles** (六十甲子, *liùshí jiǎzǐ*) exist.\n\nThus the earlier passage says: *\"Those who see it prosper.\"* Man, within these **Seven Qi**, can silently take and nourish his body from all things that grow from them, hence the saying *\"thieves.\"* For example, the **cultivators of fields and silkworms** (田蚕之类, *tiáncán zhīlèi*).\n\n*The *Liezi* states*: *\"There was a wealthy man of the State of Qi who said: ‘I am skilled in thievery.’ Heaven has its seasons, Earth has its advantages. When Heaven’s seasons and Earth’s advantages align, thieves steal the **abundant rains** (雨泽, *yǔzé*) to nourish their fields. Land thieves steal from beasts and birds; water thieves steal from fish and turtles. I began with thievery, and in the first year, it was urgent; in the second year, it was sufficient; in the third year, it was abundant. From then on, my wealth extended to the entire region. I steal from Heaven and Earth without suffering misfortune or blame. But you steal from others’ gold and silk—how can you remain unpunished?’*\n\nAll things steal from Heaven and Earth to grow; the people steal from all things to nourish their bodies. If one knows the proper **division and alignment**, it is but the natural order. This is the meaning of *\"all things are the thieves of man.\"*\n\nThe *Jing* states: *\"Man is the thief of all things.\"* When the **Three Thieves** (三盗, *sǎn dào*—Heaven, Earth, and man) align properly, the **Three Powers** (三才, *sān cái*—Heaven, Earth, and man) are at peace.\n\nCluan Shuxin explains: *\"‘既’ (既, *jì*) means ‘to exhaust’ or ‘fulfill.’ When the **Three Thieves** exhaust their proper roles, the **Three Powers** fulfill their positions in harmony.\"*\n\nIt speaks of how man, if he only knows to steal from all things to nourish himself and attain wealth, yet fails to recognize that all things can also steal from man to bring misfortune. The **three interdependent roles of thievery** (上来三义更相为盗, *shànglái sān yì gēngxiāng wéi dào*—the cyclical nature of Heaven, Earth, and man as thieves) are also part of the natural order.\n\nIn all cases of thievery, there must be **Dao/Way**. If one conforms to its proper alignment, it brings **good fortune** (吉, *jí*); if one defies its natural logic, it brings **calamity** (凶, *xiōng*). Thus, *The Liezi* asks: *\"Is there a Way in thievery?\"* and replies: *\"How could it lack a Way?\"*\n\nTo **enter first** (入先, *rùxiān*) is **sageliness** (圣也, *shèng yě*—divine foresight);\nTo **know what is permissible or forbidden** (知可否, *zhī kěfǒu*) is **wisdom** (智也, *zhì yě*);\nTo **enter first** (入先, *rùxiān*) is **courage** (勇也, *yǒng yě*—boldness in action);\nTo **exit last** (出后, *chūhòu*) is **righteousness** (义也, *yì yě*—proper conduct);\nTo **distribute fairly** (分均, *fēnjūn*) is **benevolence** (仁也, *rén yě*).\n\nWithout these **Five Virtues** (五德, *wǔ dé*), one cannot become a **great thief** (大盗, *dà dào*). This is the **Dao/Way within thievery** (盗中之道, *dào zhōng zhī dào*).\n\nIn the **Three Thieves**, one must also follow **Dao/Way**, ensuring all align in their proper roles—then the **Three Powers** will not falter, and each will fulfill its position in harmony. This prevents **transgressing boundaries and harming one’s nature** (越分伤性, *yuèdào shāngxìng*), which would bring misfortune.\n\nThe *Jing* states: *\"Eat according to the seasons, and all parts of the body will be in order. Act in accordance with the **mechanisms of change** (动其机, *dòng qí jī*—the natural triggers of transformation), and all transformations will be at peace.\"*\n\nCluan Shuxin explains: *\"If man’s **diet and nourishment** (服食, *fúshí*) do not lose their proper seasons, his body will suffer no harm. If his **actions and movements** (兴动, *xīngdòng*) align with their proper mechanisms, all transformations will be at peace.\"*\n\nIt refers to man’s **understanding of life and destiny** (理性命, *lǐngxìngmìng*)—all are tied to **diet and flavors** (滋味, *zīwèi*). Thus, *The Zuo Zhuan* states: *\"Flavors circulate the *qi*; *qi* circulates the mind. Nourishing the form and moistening the spirit must return to **diet**.\"* The **Yellow Emperor** says: *\"When man takes **food and drink** (服食, *fúshí*), he must first consider the **Five Flavors** (五味, *wǔ wèi*), the **Five Meats** (五肉, *wǔ ròu*), the **Five Vegetables** (五菜, *wǔ cài*), and the **Five Fruits** (五果, *wǔ guǒ*), all requiring **proper timing and moderation** (调候得所, *tiáohòu désuǒ*). If consumed **cooked** (熟, *shú*), they benefit the body; if consumed **raw** (生, *shēng*), they harm the **organs** (脏, *zàng*). This is the meaning of **‘eating according to the seasons.’***\n\nThus, if man’s **diet and nourishment** do not lose their proper seasons, and his **flavors** do not exceed their proper alignment, conforming to the **middle way** (中道, *zhōngdào*), without transgressing boundaries or harming his nature, then his **four limbs** (四肢, *sìzhī*) will be harmonious, his **five organs** (五脏, *wǔ zàng*) will be at peace, no sickness will arise, and he will **preserve his longevity and fulfill his natural lifespan** (保终, *bǎo zhōng*). Is this not the meaning of *\"all parts of the body will be in order\"*?\n\nThus, *The Kang Cangzi* states: *\"Eating well in winter keeps the body warm; eating well in summer keeps the body cool. If the seasons are right, man will have no sickness; if man has no sickness, epidemics will not spread; if epidemics do not spread, man will attain his natural lifespan.\"* Hence it is said: *\"Grains are man’s **life-essence** (命, *mìng*); Heaven therefore **prospers kings through agriculture** (兴王务农, *xīngwáng wù nóng*). If a king does not **pursue agriculture** (务农, *wù nóng*), he abandons his people. How then can he have a nation?\"*\n\nOnly when the **Three Thieves** align in their proper roles and the **Three Powers** fulfill their duties in harmony—all conforming to the **natural order**—must one then **adjust with laws and governance** (法令平正, *fǎlìng píngzhèng*) to **employ the worthy and utilize the capable** (用贤使能, *yòng xián shǐ néng*). Let **beneficence extend to all creatures** (泽及昆虫, *zé jí kūnchóng*) and **transformation pervade all plants** (化被草木, *huà bèi cǎomù*). If all actions align with the **proper mechanisms of Heaven’s Dao** (天道之机宜, *tiāndào zhī jī yí*), then **yin and yang will follow the seasons** (阴阳顺时, *yīnyáng shùnshí*), the **world will be in peace and tranquility** (寰宇宁泰, *huányǔ níngtài*), and all things will attain their own stability and peace.\n\nThis is the meaning of *\"acting in accordance with the mechanisms of change, and all transformations will be at peace.\"*\n\nThe *Jing* states: *\"Man knows his **spirit** (神, *shén*) through its manifestation, yet does not know how the **non-manifested spirit** (不神, *bù shén*) manifests the spirit.\"*\n\nCluan Shuxin explains: *\"**Yin and yang** generate all things—man calls this ‘spirit.’ Yet he does not know of the **supreme Dao/Way**, which remains **still and silent** (静嘿, *jìng hū*), yet is the **ultimate source of spirit** (至神, *zhì shén*) that can generate **yin and yang and all things.** ‘Spirit’ is the **mysterious and unfathomable** (妙而不测, *miào ér bù cè*).\"*",
      "overlap_context": "t is the **chapter of the immortal sages embracing Oneness and manifesting the Dao** (抱一演道章, *baoyi yandao zhang*—section on the unified principle and its unfolding in the Way) from the **one hundred and five words** above. All these teachings clarify the **principles of yin and yang** (阴阳之道, *yinyang zhidao*), the **logic of rise and fall** (兴废之理, *xingfei zhili*), and the **appropriateness of action and stillness**—then one must refine their conduct and purify their actions to become a sage.*\"",
      "start_char": 3694,
      "end_char": 4940,
      "start_sentence": 161,
      "end_sentence": 219,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 34.626434564590454,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\黄帝阴符经集解（宋袁淑真）.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "《易》曰：阴阳不测之谓神。 人但见万物从阴阳日月生谓之神。 殊不知阴阳日月从不神而生焉。 不神者何也？ 至道也。 言至道虚静，寂嘿而不神，此不神之中能生日月阴阳，三才万物敷荣而获畅，皆从此至道虚静中来，此乃不神为至神矣。 故《道经》曰：窈窈冥冥，其中有精； 恍恍惚惚，其中有物。 此乃至道不神之中而有至神之理明矣。 欲令修炼之士明悟无为不神之理，反照正性，修无为之业，存思守一，反朴还真，归无为之道，玄之又玄，方证寂嘿而不神，然后能而不为，是名不神而已也。 故《老子》云：道常无为而无不为。 此则不神而能至神矣。 经曰：日月有数，大小有定。 圣功生焉，神明出焉。 淑真曰：日月运转不差度数，大小有定，方显圣功之力生焉，神明之效出焉。 日月者，阴阳之精气也，六合之内为至尊者也。 日月度数，大小律历之所辩，咸有定分，运转不差。 故云：日月有数，大小有定。 圣功生焉，神明出焉者，言六合之内赖此日月照烛，阴阳运行而生万物，有动植功力，深妙至圣。 故曰：圣功生焉，神明出焉者。 阴阳不测之谓神，日月晶朗之谓明，言阴阳至神，日月至明，故曰：神明。 言天地万物，皆承圣功神明而生育，从无出有，功用显着，故曰神明出焉，又言世间万物，皆禀此圣力而生。 大小有定分，不相踰则小不爱大，大不轻小。 故庄周云：鹏鴳各自逍遥，不相健羡。 此大小有定之义也。 又言：上至王侯，下及黎庶，各依定分，不相倾夺，上下和睦，俗稔时和，名曰太平。 故云：中有富国安人之法也。 经曰：其盗机也，天下莫不见，莫能知，君子得之固躬，小人得之轻命。 淑真曰：盗机深妙，易见而难知。 君子知积善之机，乃固躬，小人务荣辱之机而轻命。 盗机者，重举上文三盗之义也。 假如国氏盗天而获富，人皆是种植之机，不知所获之深理，何名为机？ 缘己之先无，知彼之先有，暗设计谋而动其机数，不知不觉，窃盗将来以润其己，名曰盗机。 言天下之人咸共见此盗机，而莫能知其深理，设有知者，在小人君子所见不同，君子则知固躬之机，小人则知轻命之机。 固躬之机若何？ 君子知至道之中包含万善，所求必致，如响应声，但设其善计，暗嘿修行，动其习善之机，与道契合，乃至守一存思精以修习，窃其深妙以谨其性，或盗神水华池、玉英金液以致神仙，贤人君子知此妙道之机，修炼以成圣人。 故曰； 君子得之因躬。 小人轻命之机者，但务营求金帛，不惮劬劳，或修习才学武略，不辞劳苦，饰情巧智以求世上浮荣之机，或奢华宠辱，或军旅倾危，或贪婪损己，或在财色祸生，虽暂得浮荣，终不免於患咎，为不知其妙道之机以致於此。 故曰：小人得之以轻命也。 此富国安人演法章，九十二言皆使人取舍合其机宜，明察至神之理，此其安化养命固躬之机也。 故曰：中有富国安人之法。 黄帝阴符经集解卷中竟 黄帝阴符经集解卷下",
      "translated_text": "The *Yijing* states: **\"Yin and yang’s unfathomable workings are what is called spirit.\"** Men merely see all things arising from yin and yang, sun and moon, and call this \"spirit.\" Yet they fail to recognize that yin and yang, sun and moon, arise from the **non-spirit**. What is this **non-spirit**? It is the **Supreme Dao/Way**. The **Supreme Dao/Way** is **empty and still**, **silent and quiescent**, yet **not spirit**—yet within this **non-spirit** lies the power to generate sun and moon, yin and yang, the Three Realms, and all ten thousand things, flourishing and thriving. All this originates from the **Supreme Dao/Way’s** empty stillness. Thus, the **non-spirit** is the **ultimate spirit**.\n\nTherefore, the *Dao De Jing* says:\n*\"Fathomless and obscure,\nWithin it lies the essence;\nVague and indistinct,\nWithin it lies the substance.\"*\nThis clearly reveals the principle that within the **Supreme Dao/Way’s** **non-spirit** lies the **ultimate spirit**.\n\nTo awaken cultivators to the principle of **effortless non-spirit**, they must reflect upon their true nature, practice the **Way of non-action**, preserve thought and hold to the One, return to simplicity and restore authenticity, and align with the **Way of non-action**, ever deeper into the **mysterious**. Only then will they attain **silent quiescence** and **non-spirit**, and thus **\"act without doing\"**—this is what is called **non-spirit**.\n\nHence, *Laozi* says:\n**\"The Dao acts without doing, yet nothing remains undone.\"**\nThis is the **non-spirit** that achieves the **ultimate spirit**.\n\nThe *Jing* states:\n**\"Sun and moon follow their appointed courses, great and small have their fixed measures.\"**\nFrom this arise **sagely efficacy** and **spiritual luminosity**.\n\nCluan Shuxin explains:\nThe sun and moon revolve without deviating from their degrees, their greatness and smallness are fixed—this reveals the power of **sagely efficacy** and the effects of **spiritual luminosity**. Sun and moon are the **refined qi of yin and yang**, the most exalted within the **Six Extremes**. Their courses, their greatness and smallness, are determined by calendrical and astronomical laws, each with its allotted measure, revolving without error. Thus it is said:\n**\"Sun and moon follow their appointed courses, great and small have their fixed measures.\"**\nFrom this arise **sagely efficacy** and **spiritual luminosity**, for within the **Six Extremes**, all things rely on the sun and moon’s illumination, the movement of yin and yang to generate life—possessing **dynamic and vegetative power**, profound and sagely. Hence it is said:\n**\"From this arise sagely efficacy and spiritual luminosity.\"**\nYin and yang’s unfathomable workings are called **spirit**, the sun and moon’s luminous clarity are called **luminosity**—thus, **spirit and luminosity**. All things under heaven and earth are nurtured by **sagely efficacy and spiritual luminosity**, emerging from **non-being to being**, their functions manifest. Hence it is said:\n**\"From this arise sagely efficacy and spiritual luminosity.\"**\nAgain, all things in the world receive this **sagely force** and are born. Great and small have their fixed measures—none overstep, so the small does not covet the great, nor the great despise the small. Thus Zhuangzi says:\n**\"The peng and the yuan each soar freely, neither envying the other.\"**\nThis is the meaning of **\"great and small have their fixed measures.\"**\n\nFurther, from the sovereign down to the common folk, each follows its appointed measure, neither encroaching nor usurping, so that above and below live in harmony, customs are settled, and the times are peaceful—this is called **Great Peace**. Hence it is said:\n**\"Within it lies the method for enriching the state and securing the people.\"**\n\nThe *Jing* states:\n**\"Those who steal the mechanisms—none under heaven do not see them, yet none can know them. The sage who attains them secures his person; the petty man who attains them risks his life.\"**\n\nCluan Shuxin explains:\nStealing the mechanisms is profound yet easily seen, difficult to know. The sage recognizes the mechanism of **accumulating virtue** and thus secures his person; the petty man pursues the mechanisms of **honor and disgrace** and thus risks his life.\n\nWhat is **stealing the mechanisms**? Suppose a family steals from heaven to gain wealth—all see it as the mechanism of planting and cultivating, yet they do not grasp the deep principle behind their gain. Because they themselves lacked it first, they recognize it in others, secretly plotting to activate its mechanisms, unaware, stealing what is to come to enrich themselves—this is called **stealing the mechanisms**.\n\nAll under heaven see this **stealing of mechanisms**, yet none can fathom its depths. If some do know, their understanding differs between the petty and the sage. The sage knows the mechanism of **securing his person**: he recognizes that within the **Supreme Dao/Way** lies all virtue, and whatever he seeks will surely come to pass, like an echo to sound. By secretly and silently cultivating, activating the mechanism of habitual virtue, aligning with the Dao, guarding the One, preserving thought, and refining essence to cultivate, he steals the profound mysteries to preserve his nature. Perhaps he steals the **Spirit Water, Flower of Jade, or Golden Elixir** to attain immortality—sages and virtuous men know this wondrous mechanism, cultivating and refining to become sages. Hence it is said:\n**\"The sage who attains them secures his person.\"**\n\nThe petty man’s mechanism of **risking his life** is this: he merely seeks wealth and jade, sparing no labor, or cultivates talent and martial skill, enduring no hardship, adorning himself with clever stratagems to seize the world’s fleeting mechanisms of honor—whether through extravagance and favor, military peril, or avarice that harms himself, or entanglement in wealth and desire that brings calamity. Though he may briefly gain superficial honor, he cannot escape misfortune and blame, for he does not know the wondrous mechanism of the Dao. Hence it is said:\n**\"The petty man who attains them risks his life.\"**\n\nThis is the chapter expounding the **method for enriching the state and securing the people**, with ninety-two words guiding people to take and discard according to the mechanisms, clearly perceiving the principle of the **ultimate spirit**—this is the mechanism of **nurturing transformation, securing life, and fortifying the person**. Hence it is said:\n**\"Within it lies the method for enriching the state and securing the people.\"**",
      "overlap_context": " *shén*) through its manifestation, yet does not know how the **non-manifested spirit** (不神, *bù shén*) manifests the spirit.\"*\n\nCluan Shuxin explains: *\"**Yin and yang** generate all things—man calls this ‘spirit.’ Yet he does not know of the **supreme Dao/Way**, which remains **still and silent** (静嘿, *jìng hū*), yet is the **ultimate source of spirit** (至神, *zhì shén*) that can generate **yin and yang and all things.** ‘Spirit’ is the **mysterious and unfathomable** (妙而不测, *miào ér bù cè*).\"*",
      "start_char": 4940,
      "end_char": 6060,
      "start_sentence": 220,
      "end_sentence": 263,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 23.443275928497314,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\黄帝阴符经集解（宋袁淑真）.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "朝散郎行潭州长沙县主簿袁淑真集解 强兵战胜演术章 经曰：瞽者善听，聋者善视。 绝利一源，用师十倍； 三反昼夜，用师万倍。 淑真曰：绝利者，塞耳则视明，闭目则听审，务使身心不乱，主事精专也。 言人眼贪视邪色则不闻正声，耳贪听邪声则目不睹正色，此视听二途俱主於心也。 道德之士，心无邪妄，虽耳目闻见万种声色，其心正定，都无爱悦贪着之心，与无耳目不殊，何必在於聋瞽者也？ 但心纳正则耳目无邪，耳目无邪则身心不乱，身心不乱则思虑白，思虑白则举事发机皆合天道，比凡情十倍利益，事皆成遂，何必独用师也？ 他皆仿此。 三反昼夜，用师万倍者，言上之身正定，耳目聪明，举事发机，比常情十倍； 就中更能三思反覆，日夜精专，举事发机，比常情万倍，何必独用师也？ 宣尼云：三思而后行，再斯而可矣。 使人用心必须精审，此义也。 言师者，兵也； 兵者，凶器； 战者，危事。 处战争之地，危亡之际，必须三反精思。 深谋远虑，若寡於谋虑，轻为进退，立见败亡。 所以将此耳目精思，别以为师喻，切今修炼保固其身，非真用师也。 且道德之士，嫉恶如雠敌者，贼也。 贤人知此，耳目绝利之源，三反精思之义，深沉审细，理正居贞，诛锄邪妄之贼，自固其躬，久久成道也，则黄帝灭蚩尤是也。 至如古今名将孙、吴、韩、白、武侯、诸葛，卫公李靖，皆善用师，悉能三反昼夜，成功立事，是以致君尧舜之阶，成身於荣华之地，然后谓强兵战胜之术以为轻命之机必也。 黄帝得之以登云天，传说以处玄枵之望矣。 故上文云君子得之固躬，小人得之轻命是也。 经曰：心生於物，死於物，机在目。 淑真曰：心贪於物者损寿，目睹无厌则意荒。 但能诫目收心，则无祸败之患也。 是道德之士，心不妄生，机不妄动，辄加於物情； 而耽徇之人，取万物资身养命者，亦天然之理，但不令越分乖宜反伤其性也。 故《亢仓子》云：万人操弓，共射一招，招无不中。 招，垛也。 亦云：招，箭人也。 万物彰彰，以害一生，生无不伤者，性命也。 今代之惑者，多以性养物，则不知休息也。 此言心生贪婪於物，则反为物所盗，使人祸败也。 故《家语》云：嗜欲无厌，贪求不至者，形其煞之。 《老子》云：知足不辱，知止不殆，可以长久，所贵知足。 适其中道不得，将以耽养於物，反伤正性，必害於人，此乃心生於物也。 机在目者，言人动生妄心於物者，皆由目睹而心生，故云：机在目。 欲令诫慎其目，勿令妄视邪淫之色，使心於物不生妄动之机，不挠平和之性，以保寿固躬也。 经曰：天之无恩而大恩生。 淑真曰：天地生而不有，为而不恃，生长万物不求恩报，而万物感其覆育，自有恩生也。 天地万物，自然有之，此皆至道之所含育，不求恩报於万物，万物承天之覆育，自怀恩於天地也。 故《老子》云：生而不有，为而不恃，长而不宰也。 经曰：迅雷烈风，莫不蠢然。 淑真曰：迅雷烈风，阴阳动用，人自怀惧，蠢然而惊也。 迅雷者，阴阳击搏之声； 烈风者，庄生云：大块噫气，其名为风也。 凡此风雷，阴阳自有，本不威人，人自畏之，莫不蠢然而动怀惊惧也。 言道德之君，抚育万灵，同天地之不仁，则人民、禽兽、草木皆自归恩於君，感戴如天，各守其分，各安其业，无不逍遥也。",
      "translated_text": "**\"The *Method for Strengthening the Army and Achieving Victory* Chapter**\n\nThe text states:\n*\"The blind excel in hearing, the deaf excel in sight.*\n*Cutting off one source of profit, the army is ten times more effective;\n*Threefold reflection day and night, the army is a hundred thousand times more effective.\"*\n\nCluan Shuzhen comments:\n*\"Cutting off profit\"* means that if one blocks out distractions, vision becomes clear, and if one closes the eyes, hearing becomes acute. The aim is to keep the body and mind unperturbed, and one’s affairs sharply focused. It is said that when a person’s eyes covet improper sights, they cannot hear true sounds; when their ears indulge in improper noises, their vision fails to discern proper sights. Thus, sight and hearing both originate from the mind.\n\n*The Daoist sage*, whose mind is free of deceit, though exposed to myriad sights and sounds, remains steadfast in their purity. Without attachment or craving, their mind is as unobstructed as one without ears or eyes. Why must they be blind or deaf?\n\nBut when the mind aligns with truth, ears and eyes remain untainted; when ears and eyes are untainted, the body and mind remain undisturbed; when undisturbed, thoughts become luminous; when thoughts are luminous, all actions and decisions conform to the **Dao/Way**, yielding tenfold advantage over ordinary perception. All undertakings succeed—why need they rely solely on an army?\n\nThe same principle applies elsewhere.\n\n*\"Threefold reflection day and night, the army is a hundred thousand times more effective\"* means that when the ruler’s mind is steadfast, their ears and eyes keen, and their actions and decisions tenfold more effective than usual; and when, moreover, they engage in threefold deliberation, day and night, with unwavering focus, their actions and decisions are a hundred thousand times more effective than ordinary perception—why need they rely solely on an army?\n\nConfucius said: *\"Threefold reflection, then act. This suffices.\"*\nHe urged people to deliberate with utmost precision—this is the same intent.\n\n*\"The army\"* refers to **warriors**;\n*\"Warriors\"* are **tools of violence**;\n*\"War\"* is a **perilous matter**.\n\nIn lands of conflict or moments of dire peril, one must engage in threefold reflection and careful deliberation. If one is negligent in strategy, reckless in advance or retreat, defeat will follow immediately. That is why this passage emphasizes the need for disciplined reflection—it is not about truly employing an army, but using the metaphor of *\"the army\"* to urge one to cultivate and safeguard their own mind.\n\nMoreover, the **Daoist sage** who abhors evil as they would a sworn enemy—this is the **thief** (of virtue). The wise recognize this: by severing the source of profit, embracing threefold reflection, and deep, meticulous contemplation, they align with truth, dwell in integrity, and exterminate the deceitful thief within. Thus, they fortify their own person, and over time, attain the **Dao/Way**—as when the Yellow Emperor vanquished **Chi You**.\n\nAs for ancient and modern great generals—Sun, Wu, Han, Bai, **Wu Hou (Zhuge Liang)**, and **Li Jing (the Duke of Wei)**—all excelled in employing armies, mastering threefold reflection day and night, and achieving success in their undertakings. Thus, they ascended to the ranks of **enlightened rulers**, securing their own honor and wealth, and only then could they be said to possess the *Method for Strengthening the Army and Achieving Victory*—a **Dao/Way** that risks one’s life if misapplied.\n\nThe Yellow Emperor attained it and ascended to the **Cloudy Heights**, while his teachings endure in the **Play of the Mysterious Void**.\n\nHence, the earlier passage states:\n*\"The sage who attains this fortifies their person;\n*The petty man who attains it risks their life.\"*\n\nThe text states:\n*\"The mind is born from things, dies from things; the mechanism lies in the eyes.\"*\n\nCluan Shuzhen comments:\n*\"When the mind covets things, it shortens one’s lifespan;\n*When the eyes see without restraint, the will becomes reckless.*\nBut if one can curb the eyes and gather the mind, there will be no misfortune or ruin.\n\n*The Daoist sage*’s mind does not generate deceit, nor does their mechanism move recklessly—they simply respond to circumstances. Yet those who indulge in them, taking all things to nourish their body and sustain their life, also follow natural principle—only they must not exceed their proper measure, nor act contrary to nature, lest they harm their own essence.\n\nThus, the *Kang Cang Zi* says:\n*\"Ten thousand men drawing bows, all aiming at a single target—no arrow misses.*\n*Target: a mound (of arrows).*\n*Or: Target, the archer.*\n*All things manifestly harm one life—the life that cannot escape injury is the **essence of life**.*\n*Today’s deluded ones often nourish their **essence of life** with things, thus knowing no rest.*\nThis speaks of how the mind’s greed for things leads to being robbed by them, bringing ruin to one’s person.\n\nThus, the *Family Sayings* say:\n*\"Unrestrained desires, insatiable cravings—this is the **death of the form**.\"*\n\nThe *Laozi* says:\n*\"Knowing contentment brings no disgrace;\n*Knowing restraint brings no peril.\n*This is how one endures long—\n*The precious thing is knowing contentment.*\n*To dwell in moderation, not exceeding bounds,\n*Yet one indulges in nourishing themselves with things,\n*And harms their true nature—\n*This is to invite harm from others,\n*And is how the mind is born from things.*\n\n*The mechanism lies in the eyes* means that when one’s actions generate deceitful thoughts toward things, it is always because the eyes have seen them, and the mind has thus been stirred—hence it is said: *The mechanism lies in the eyes.*\n\nTo curb the eyes, one must not gaze upon improper or lustful sights, lest the mind generate reckless movements toward things. This preserves the **essence of life** and fortifies the person.\n\nThe text states:\n*\"Heaven’s lack of favor is its greatest favor.\"*\n\nCluan Shuzhen comments:\n*\"Heaven and Earth give birth but do not possess;\n*They act but do not rely on their deeds.*\n*They nurture all things without seeking repayment,\n*Yet all things, moved by their sheltering care,\n*Naturally generate favor in return.*\n*Heaven and Earth, along with all things, exist by nature—\n*This is all contained within the **ultimate spirit** of the Dao.*\n*They do not demand repayment from all things,\n*Yet all things, receiving Heaven’s sheltering care,\n*Naturally hold favor toward Heaven and Earth.*\n\nThus, the *Laozi* says:\n*\"Give birth but do not possess;\n*Act but do not rely on your deeds;\n*Nurture but do not dominate.\"*\n\nThe text states:\n*\"Swift thunder and fierce winds—none fail to tremble.\"*\n\nCluan Shuzhen comments:\n*\"Swift thunder and fierce winds are the movements of **yin** and **yang**;\n*People naturally fear them, and tremble in response.*\n*Swift thunder is the striking sound of **yin** and **yang**;\n*Fierce winds, as Zhuangzi says: The great breath exhales—this is what we call wind.*\n*In all such winds and thunders,\n*They arise from **yin** and **yang** by nature,\n*And do not inherently threaten people—\n*Yet people fear them,\n*And tremble in response.*\n\n*The sage who follows the Dao*, nurturing all beings, mirrors Heaven and Earth’s lack of **virtue/power (ren)**, yet the people, beasts, grasses, and trees all naturally return their favor to the ruler, as they do to Heaven. Each abides in its proper place, each finds ease in its work, and none fail to dwell in **effortless harmony (xiaoxiao)**.\"*",
      "overlap_context": " is said:\n**\"The petty man who attains them risks his life.\"**\n\nThis is the chapter expounding the **method for enriching the state and securing the people**, with ninety-two words guiding people to take and discard according to the mechanisms, clearly perceiving the principle of the **ultimate spirit**—this is the mechanism of **nurturing transformation, securing life, and fortifying the person**. Hence it is said:\n**\"Within it lies the method for enriching the state and securing the people.\"**",
      "start_char": 6060,
      "end_char": 7330,
      "start_sentence": 264,
      "end_sentence": 314,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 21.519512176513672,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\黄帝阴符经集解（宋袁淑真）.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "明君但施其正令以示国章，兆人睹其威令，如迅雷烈风，莫不蠢然而动，咸恐惧之心，各自警诫，修身慎行也。 以此理军，则将勇兵强，上威下惧，必能诛暴定乱。 故云：下有强兵战胜之术也。 经曰：至乐性余，至静则廉。 淑真曰：志尚廉静，心无忧惧，情怀悦乐而逍遥有余也。 至乐者，非丝竹欢娱之乐也，若以此乐，性必无余。 故《家语》云：至乐无声，而天下之安。 《三略》云：有道之君以乐乐人。 此言贤人君子以不顾於物，不徇於财货，则理国安家，无淫刑罚，不越国章，身无过犯，无所忧惧，自然心怀悦逸，情性怡怿，逍遥有余，岂将丝竹欢宴之乐而方作乎？ 至如古人鼓琴拾穗，行歌待终，故曰：至乐性余也。 至静则廉者，既不为小人丝竹奢淫之乐，自保其无忧无事之欢，如此则不为声色所挠，而性静逸神贞至廉也。 故《亢仓子》云：贵则语通，富则身通，穷则意通，静则神通。 此四通之体，义存乎至静者也。 人能至静，可致神通，是名至静则廉也。 夫将师之体，贵其廉静，杜其喧挠，赏罚不差父子，为军心怀悦乐，性多余勇，然可摧凶克敌，功业必成。 故曰：下有强兵战胜之术也。 经曰：天之至私，用之至公。 淑真曰：天道是出隐，不可窥测，至私也； 万物生成，圣功显着，至公也。 天者，至道也。 言道包含万类，幽深恍惚，无有形段，不可窥测，是名至私。 私者，隐匿之义也。 能於杳冥之中应用无穷，生成万物，各具形体，随用立名，乃至公也。 公者，明白显用，众可观睹之义也。 此言道德之君，心虑广博，包物万机，智谋巧拙，进退可否，悉私隐於深心，人不可得而窥之，是至私也。 乃至动用，观善恶，察是非，施政令，行赏罚，显然明白，为天下之可观，乃至公也。 故曰：天之至私，用之至公也。 为军将之体，能用心隐密，机必难窥，取舍如神，威恩显上清下，正明将勇兵强，克敌摧凶，功业茂盛。 故云：下有强兵战胜之术也。 经曰：禽之制在气。 淑真曰：鹏搏九万，积气而升，蜩鸠枪榆，决起而下，皆制气进退自由也。 禽者，羽化百鸟之类也。 气者，天地元和之气也。 人之运动，皆以手足进退为利； 禽鸟运动，皆以翅鼓气，以心进退，翱翔云霄，人不如也。 言鸟在空中，尚能乘制元和之气，心动翅鼓，无所不之，上下由己。 况人言最灵，不能善用天地道德之气，固躬养命以至长生久视乎？ 若人善能制道德之气，则遨游太虚大罗兜率，禽鸟不足方也。 为军师之体，善用五行休王之气，能知阴阳制伏之源，则摧凶克敌不足为难，故云：下有强兵战胜之术也。 经曰：生者，死之根； 死者，生之根。",
      "translated_text": "「The enlightened ruler merely issues his just decrees to display the standards of the state;\n*When the common folk see his stern commands,*\n*They respond like swift thunder and fierce winds—*\n*All tremble and are moved,*\n*Each bearing a heart of fear,*\n*All self-alerted,*\n*Refining their conduct and proceeding with caution.*\n\n*Applying this principle to military affairs,*\n*The generals grow bold and the soldiers strong,*\n*The superiors command fear in their inferiors,*\n*And such an army will assuredly*\n*Slay the violent and pacify rebellion.*\n\n*Thus it is said: Below lies the art of strong armies and victory in war.*\n\n*The Classics state: Supreme joy leaves vitality intact; supreme stillness brings purity.*\n*Adhering to this principle,*\n*One’s aspirations remain modest and tranquil,*\n*The heart knows no anxiety or dread,*\n*And contentment and ease abound,*\n*With effortless harmony overflowing.*\n\n*Supreme joy is not the frivolous mirth of strings and pipes,*\n*For such pleasures would exhaust one’s vitality.*\n*Hence, the *Family Discourses* say:*\n*\"Supreme joy is soundless,*\n*Yet it brings peace to all under Heaven.\"*\n\n*The *Three Strategies* declare:*\n*\"The ruler who follows the Dao delights his people with joy.\"*\n\n*This refers to the virtuous sage and noble ruler,*\n*Who, unattached to worldly things,*\n*Uninfluenced by wealth or gain,*\n*Govern the state and secure the home,*\n*Without licentious punishments,*\n*Without transgressing the state’s precepts,*\n*Without personal fault,*\n*And thus free from all concern,*\n*Naturally harboring delight and ease,*\n*With joy and nature harmonizing,*\n*And effortless harmony overflowing.*\n*Would they seek such frivolous pleasures as feasts and revelry,*\n*And yet call it supreme joy?*\n\n*As for the ancients,*\n*They plucked strings to attune the heart,*\n*Gathered fallen grains to express humility,*\n*And sang as they awaited their end,*\n*Hence the saying:*\n*\"Supreme joy leaves vitality intact.\"*\n\n*The Classics state: Supreme stillness brings purity.*\n*This means that, having avoided*\n*The vulgar pleasures of strings and pipes,*\n*One preserves the joy of*\n*Worry-free and carefree contentment,*\n*Thus remaining unperturbed by sounds and colors,*\n*With nature tranquil and spirit steadfast,*\n*And purity unassailable.*\n*Hence, the *Kang Cangzi* says:*\n*\"The noble grow fluent in speech,*\n*The wealthy grow fluent in movement,*\n*The poor grow fluent in thought,*\n*The still grow fluent in spirit.\"*\n\n*These four harmonies*\n*Reside in supreme stillness.*\n*When one attains supreme stillness,*\n*One achieves spiritual fluency—*\n*This is called*\n*\"Supreme stillness brings purity.\"*\n\n*The nature of generals and strategists*\n*Demands purity and stillness,*\n*Suppressing all clamor and disturbance,*\n*With rewards and punishments*\n*Not favoring kin over children,*\n*And thus the military heart*\n*Harbors delight and joy,*\n*With vitality and courage abundant,*\n*Yet they can crush the wicked and conquer foes,*\n*And their achievements will surely flourish.*\n\n*Thus it is said: Below lies the art of strong armies and victory in war.*\n\n*The Classics state: The mechanism of birds lies in their **qi (qi)**.**\n*Adhering to this principle,*\n*The pterodactyl flaps its wings nine thousand miles,*\n*Accumulating **qi** to ascend,*\n*While the cicada and sparrow*\n*Strike their wings against the mulberry,*\n*And descend with sudden resolve—*\n*All move freely by mastering their **qi**.*\n\n*Birds are the feathered kind of all winged creatures.*\n***Qi** is the primordial harmony of Heaven and Earth.*\n*Human movement relies on hands and feet,*\n*Advancing or retreating for advantage;*\n*But birds move by beating their wings,*\n*And with their hearts they advance or retreat,*\n*Soaring through the clouds,*\n*Beyond human reach.*\n\n*This says that even birds,*\n*Though lesser in speech,*\n*Can harness the primordial harmony of **qi**,*\n*And with their hearts directing,*\n*Their wings flapping,*\n*Go wherever they will,*\n*Ascending or descending at their own command.*\n*How much more so should humans,*\n*The most refined of creatures,*\n*Be unable to master*\n*The Dao/Way’s and Heaven’s Earth’s **qi**,*\n*And thus cultivate their bodies and prolong their lives,*\n*To attain eternal youth and longevity?*\n\n*If humans could master the **qi** of the Dao/Way,*\n*They might roam the boundless expanse,*\n*Through the celestial realms,*\n*And surpass even the birds.*\n*For the strategist,*\n*Skilled in harnessing the **qi** of the Five Phases,*\n*Knowing the sources of yin and yang’s dominance,*\n*Crushing the wicked and conquering foes*\n*Would pose no challenge—*\n*Thus it is said:*\n*\"Below lies the art of strong armies and victory in war.\"*\n\n*The Classics state:*\n*\"Life is the root of death,*\n*Death is the root of life.\"*",
      "overlap_context": " thunders,\n*They arise from **yin** and **yang** by nature,\n*And do not inherently threaten people—\n*Yet people fear them,\n*And tremble in response.*\n\n*The sage who follows the Dao*, nurturing all beings, mirrors Heaven and Earth’s lack of **virtue/power (ren)**, yet the people, beasts, grasses, and trees all naturally return their favor to the ruler, as they do to Heaven. Each abides in its proper place, each finds ease in its work, and none fail to dwell in **effortless harmony (xiaoxiao)**.\"*",
      "start_char": 7330,
      "end_char": 8343,
      "start_sentence": 315,
      "end_sentence": 355,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 12.842390775680542,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\黄帝阴符经集解（宋袁淑真）.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "淑真曰：愚人徇物以贪生，为生之理者，促寿也； 贤人损己以求生，道德真妙者，固躬而不亡，此言人之在世，贪生而恶死，皆自厚养其身，恐致灭亡也。 鞠育身命，必须饮食衣服，此亦天然自合之理。 故庄周云：耕而食，织而衣，其德不离，织而衣，耕而食，是谓同德，故知人生资衣食之育养也。 然在俭约处中则吉，若纵恣奢溢过分则凶，而反害其生也。 至若上古之人，巢居穴处，情性质朴，亦不知有长生短寿之理，任自然之道而年寿长永； 及后代真源道丧，浮薄将兴，广设华宇、衣服、纨彩、滋味、膳肴，越分怡养，恐身之不康，殊不知养生太过，役心损虑为促寿之根，故曰：生者，死之根也； 死者，生之根。 至如道德之士，损己忘躯，不贪财，不徇物，以求长生之术，或则餐霞服气，辟谷休粮，心若死灰，形同槁木，世人观之，死之象也，殊不知此长生之根耳。 故曰：死者，生之根也。 夫将师之体，能知幸生而必死，毕命而反生者，则全军保众，为良将焉。 故兵术曰：致兵於死地而反生，此强兵战胜之术也。 经曰：恩生於害，害生於恩。 淑真曰：君子免害而感恩，恩生於害也； 小人辜恩而起害，害生於恩耳。 此言人心向背，恩害互生。 本来无害，元亦无恩，因救害而有恩，即恩生於害也。 至如贤人君子小人有危滞，得人济拔，怀恩感德，终身不忘，是恩生於害也。 至如小人承君上恩顾，身居荣禄，不能保守恩德，诫慎始终，一朝恃宠失权，身陷刑网，不知己过，反生怨害之心，此辜恩而起害，故曰：害生於恩也。 道德之士，感天地覆育之恩，不辜至道生成之德，修行善政，反朴还源，则无害可生於恩，亦无由生害，不将恩害挠性，守静嘿以生真利。 至如恩害相生、宠辱更致者，小人之见也。 为将师之体，不负皇恩，不憍荣宠，慎终如始，保守恩光，竭力尽忠，成功立事，恩亦无由生害，害亦无由而起於恩，以道德临戎，有征无战。 故云：下有强兵战胜之衍也。 经曰：愚人以天地文理圣，我以时物文理哲。 淑真曰：愚人见星流日晕、风电雷霆、水旱灾蝗而生忧惧，不知有道德政教淳和、安抚黎民，转祸为福。 以此时物文理，惟圣我知之矣。 天地文理者，天地悬日月以照善恶，垂列宿以示吉凶，皆道体自然之理也。 言愚人仰视三光，观天文之变异，睹雷霆之震怒，或寒暑不节，水旱灾蝗，恐之反身，悉怀忧惧也。 愚人以此时物文理。 时物文理者，但君怀廉静，臣效忠贞，獹鹊不喧，边烽无燧，兆人安乐，寰宇清平，纵天地灾祥，无能为也。 圣我以为时物文理者，故《家语》云：殷太戊之时，道缺法邪，以致之亡孽，桑谷忽生於朝，七日大拱。 占者曰：桑谷合生於郊，今生於朝，恐朝亡矣。 太戊恐惧，侧身修德，思先王之政，布养人之道。 三年之后，远方慕义重译而至十有六国，则桑谷无能为灾。 夫子曰：存亡祸福皆由人兴，天灾地妖不能加也。 则灾妖不胜善政，怪梦不胜善行也。 又尧遭洪水，汤遭大旱，皆积有岁年，兆庶和平，人无饥者何也？ 为君臣有道，政理均和，主信臣忠，百姓戴上，虽旱水不能为灾也。 水旱者，时物也，若明时物之理者，皆能转祸为福，易死为生。",
      "translated_text": "「The *Shúzhēn* says: Foolish men follow things and crave life,\nBut those who understand life’s true nature—\nThey hasten their own demise.\nThe virtuous, however, diminish themselves to seek life,\nAnd those who grasp the Dao/Way’s profound virtue/power—\nNurture their bodies yet remain unharmed,\nThis is the way of mortals in the world:\nTo covet life and abhor death,\nAll indulge their own bodies,\nFearful of destruction’s approach.\n\nTo rear and sustain one’s life,\nOne must drink and eat, wear clothes and garments—\nThis too is the natural harmony of Heaven and Earth.\nThus *Zhuāng Zhou* spoke:\n*\"Plow to eat, weave to clothe oneself,*\n*And virtue/power never departs.*\n*Weave to clothe oneself, plow to eat,*\n*This is called ‘same virtue/power,’*\n*Thus knowing that human life relies on food and clothing for sustenance.*\n\nYet when moderation and frugality prevail—\nFortune follows.\nIf one indulges in excess, luxury, and waste—\nMisfortune comes,\nAnd life itself is harmed.\n\nAs for the ancient sages,\nWho dwelled in nests and caves,\nWith simple natures and unrefined minds,\nThey knew not of longevity or short lives,\nFollowing the Dao/Way’s natural course\nAnd thus lived long and eternally.\n\nBut in later ages,\nAs the true Dao/Way faded,\nAnd superficiality arose,\nPalaces grew grand, garments splendid,\nDelicacies abounded, pleasures multiplied—\nBeyond measure, they pampered their bodies,\nFearful their health might fail,\nYet unaware that overindulgence\nWearies the mind and strains the thoughts,\nAccelerating the very demise they dread.\nThus it is said:\n*\"Life is the root of death;*\n*Death is the root of life.\"*\n\nTo the Dao/Way’s virtuous ones,\nWho sacrifice themselves for truth,\nWho do not covet wealth nor follow things,\nSeeking the art of eternal life—\nSome feast on mist and breathe in vital qi,\nAbandon grains and cease from food,\nTheir hearts like cold ashes,\nTheir forms as withered wood—\nTo the world, death’s likeness,\nYet truly, this is life’s root.\nThus it is said:\n*\"Death is the root of life.\"*\n\nThe strategist’s virtue/power,\nWho knows that life must end,\nYet death can return to life,\nPreserves their armies and protects their people—\nSuch is the mark of a true general.\n\nThus the military arts declare:\n*\"Drive troops to death’s ground*\n*And life shall return—*\nThis is the art of strong armies and victory in war.\"*\n\nThe Classics say:\n*\"Favor arises from harm,*\n*Harm arises from favor.\"*\n\nThe *Shúzhēn* says:\n*\"The noble avoid harm and feel gratitude,*\n*Thus favor arises from harm.*\n*The petty betray favor and invite harm,*\n*Thus harm arises from favor.*\nThis speaks to human hearts’ shifting tides,\nWhere favor and harm intertwine.\n\nOriginally, there is no harm,\nNor is there any favor—\nYet when harm is averted,\nFavor springs forth—\nThis is favor arising from harm.\n\nAs for the virtuous noble,\nWhen the petty face peril,\nAnd others rescue and uplift them,\nThey cherish gratitude and virtue/power,\nNever forgetting—\nThis is favor arising from harm.\n\nYet the petty, who receive\nTheir lord’s grace and bounty,\nResiding in honor and wealth,\nCannot guard or repay favor,\nNor maintain caution from start to finish—\nWhen arrogance replaces restraint,\nThey fall into legal snares,\nBlind to their own faults,\nAnd harbor resentment, birthing harm—\nThus they betray favor and invite harm,\nAnd it is said:\n*\"Harm arises from favor.\"*\n\nThe Dao/Way’s virtuous ones,\nWho feel Heaven and Earth’s nurturing grace,\nDo not betray the Way’s virtue/power,\nNor abandon its creation—\nThey refine governance, return to simplicity,\nAnd thus no harm can spring from favor,\nNor favor give rise to harm.\nThey do not let favor and harm distort their nature,\nGuarding stillness and silence to birth true benefit.\n\nYet those who see\nFavor and harm as intertwined,\nWhere honor and disgrace alternate—\nThese are the petty’s views.\n\nThe strategist’s virtue/power,\nWho does not betray the Emperor’s grace,\nNor boast in honor’s embrace,\nWho remains steadfast from start to finish,\nPreserving favor’s light,\nWho exhausts their strength in loyalty,\nAchieves success and establishes deeds—\nThus no harm can spring from favor,\nNor favor give rise to harm.\nWith the Dao/Way’s virtue/power leading armies,\nThey conquer without battle.\n\nThus it is said:\n*\"Below lies the art of strong armies and victory in war’s unfolding.\"*\n\nThe Classics say:\n*\"Foolish men take Heaven and Earth’s patterns as sacred,*\n*I see time and things’ patterns as wise.\"*\n\nThe *Shúzhēn* says:\n*\"Foolish men see stars flowing, solar halos,*\n*Winds and lightning, thunder and tempests,*\n*Or seasons unbalanced, floods and droughts,*\n*And disasters of locusts—*\nThey fear and recoil within themselves,\nUnknowing that the Dao/Way’s virtue/power\nAnd harmonious governance\nCan soothe the people,\nTurning calamity to blessing.\nThus I alone perceive the patterns of time and things.*\n\nHeaven and Earth’s patterns—\nThe sun and moon suspended to illuminate good and evil,\nThe constellations arrayed to show fortune and misfortune—\nAll are the Dao/Way’s natural virtue/power.\nTo say that foolish men gaze upward at the three luminaries,\nObserve celestial changes,\nWitness thunder’s wrath,\nOr seasons out of order,\nFloods and droughts,\nDisasters of locusts—\nThey fear and recoil within themselves,\nAll harboring dread.\n\nThus foolish men take these patterns of time and things as sacred.\n\nThe patterns of time and things—\nIf the lord harbors modesty and stillness,\nAnd ministers display loyalty and integrity,\nIf crows and magpies do not cry out,\nAnd border beacons remain unlit,\nIf all the people live in ease,\nAnd the world is tranquil—\nEven should Heaven and Earth send omens of calamity,\nThey cannot take effect.\n\nThe sage alone perceives these patterns of time and things,\nThus the *Jiāyǔ* says:\n*\"In the time of Yīn Tàiwù,*\n*The Dao/Way was absent, laws corrupt—*\n*Thus his demise was brought about,*\n*And mulberry trees grew in the palace courtyard,*\n*In seven days, they arched high.*\n*Diviners said:*\n*'Mulberry trees normally grow in the suburbs,*\n*Now they appear in the palace courtyard—*\n*Fear the court will perish!'*\n*Tàiwù, in terror,*\n*Turned to virtue/power, reflecting on ancient governance,*\n*Spreading the Dao/Way’s nurturing path.*\n*After three years,*\n*Sixteen distant states, drawn by his virtue/power,*\n*Came bearing tribute,*\n*And the mulberry trees could no longer be calamitous.*\n*The Master said:*\n*'Life and death, blessings and misfortunes,*\n*All arise from human action—*\n*Heaven’s disasters and Earth’s portents*\n*Cannot add to them.'*\n*Thus calamities and portents*\n*Cannot overcome virtuous governance,*\n*Nor evil dreams*\n*Overcome virtuous deeds.*\n\nAgain, *Yáo* faced the great flood,\nAnd *Tāng* the severe drought—\nBoth endured for years,\nYet the people lived in peace,\nNone starved—\nWhy so?\nFor lord and ministers followed the Dao/Way,\nGovernance was balanced and harmonious,\nThe ruler trusted, ministers were loyal,\nThe people revered their lord—\nEven floods and droughts could not bring disaster.\n\nFloods and droughts are the patterns of time and things,\nYet if one understands their true nature,\nAll can turn calamity to blessing,\nAnd death to life.»",
      "overlap_context": "uld master the **qi** of the Dao/Way,*\n*They might roam the boundless expanse,*\n*Through the celestial realms,*\n*And surpass even the birds.*\n*For the strategist,*\n*Skilled in harnessing the **qi** of the Five Phases,*\n*Knowing the sources of yin and yang’s dominance,*\n*Crushing the wicked and conquering foes*\n*Would pose no challenge—*\n*Thus it is said:*\n*\"Below lies the art of strong armies and victory in war.\"*\n\n*The Classics state:*\n*\"Life is the root of death,*\n*Death is the root of life.\"*",
      "start_char": 8344,
      "end_char": 9559,
      "start_sentence": 356,
      "end_sentence": 394,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 20.099703788757324,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\黄帝阴符经集解（宋袁淑真）.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "故曰：圣我以时物文理。 夫为军体，日晕五色，星流四维，怪兽冲营，野鸟入室，此时天地文理示其灾祥，但能修政令，设谋虑，恩抚士卒，转祸为福，则敌何敢当？ 此乃时物文理也。 故曰：下有强兵战胜之术章。 下一百三言，皆使人深恩静虑，恩害不生，晓达存亡，公私隐密，开物成务，观天相时，故云：下有强兵战胜之术也。 经曰：自然之道静，故天地万物生。 天地之道浸，故阴阳胜。 阴阳相推而变化顺矣。 至静之道，律历所不能契。 爰有奇器，是生万象。 八卦甲子，神机鬼藏。 阴阳相胜之术，昭昭乎进乎象矣。 黄帝阴符经集解卷下竟",
      "translated_text": "「Thus it is said:\n*\"The sage governs through the Dao/Way of time, things, and their natural patterns and principles.*\n*For military affairs,*\nWhen the sun’s halo displays five colors,\nStars drift across the four cardinal directions,\nOminous beasts charge into the encampment,\nWild birds enter the dwelling—\nAt such times, Heaven and Earth reveal their portents of calamity and omens.\nYet if one can refine governance and laws,\nDevise strategies with careful thought,\nShow kindness and soothe the soldiers,\nAnd transform misfortune into blessing,\nThen how could the enemy dare to resist?\nThis is the Dao/Way of time, things, and their natural patterns and principles.\nThus it is said:\n*'The lower realm possesses the art of strong armies and victory in battle.'*\n*The lower realm’s hundred and thirteen words*\nAll make one deeply cultivate kindness and still reflection,\nSo that harm and injury do not arise,\nAnd one understands the principles of life and death,\nBoth public and private, hidden and revealed,\nOpening the mysteries of things and accomplishing deeds,\nObserving Heaven’s signs and aligning with the seasons—\nHence it is said:\n*'The lower realm possesses the art of strong armies and victory in battle.'*\n\n*The Classic says:*\n*\"The Dao/Way of nature is tranquil,*\nSo Heaven and Earth give birth to all things.\n*The Dao/Way of Heaven and Earth is moist and penetrating,*\nSo yin and yang prevail.\n*Yin and yang interact, pushing one another,*\nAnd their transformations proceed in harmony.\n*The Dao/Way of perfect stillness*\nCannot be fully measured by calendars and computations.\n*Yet there exist wondrous instruments,*\nWhich give rise to all phenomena.\n*The Eight Trigrams and the Heavenly Stems/Earthly Branches*\nContain divine mechanisms and arcane concealments.\n*The art of yin and yang overcoming one another*\nIs clearly manifested beyond the realm of symbols.\n*The Yellow Emperor’s *Yīn Fú Jīng* (Secret Signs of Yin) [with] annotations concludes here.*»",
      "overlap_context": " *Yáo* faced the great flood,\nAnd *Tāng* the severe drought—\nBoth endured for years,\nYet the people lived in peace,\nNone starved—\nWhy so?\nFor lord and ministers followed the Dao/Way,\nGovernance was balanced and harmonious,\nThe ruler trusted, ministers were loyal,\nThe people revered their lord—\nEven floods and droughts could not bring disaster.\n\nFloods and droughts are the patterns of time and things,\nYet if one understands their true nature,\nAll can turn calamity to blessing,\nAnd death to life.»",
      "start_char": 9559,
      "end_char": 9807,
      "start_sentence": 395,
      "end_sentence": 407,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 5.111448049545288,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\玉诀类\\黄帝阴符经集解（宋袁淑真）.txt",
        "category": "玉诀类"
      }
    }
  ]
}