{
  "source_id": "黄帝阴符经注（唐李筌）",
  "source_file": "chunked_daozang\\黄帝阴符经注（唐李筌）.json",
  "total_chunks": 7,
  "total_original_chars": 7104,
  "total_translated_chars": 47322,
  "total_translation_time": 162.59244585037231,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\藏外\\黄帝阴符经注（唐李筌）.txt",
    "category": "藏外"
  },
  "full_translation": "**Yin Fu Jing** *(Attributed to the Yellow Emperor)*\n\nObserve the Dao of Heaven, grasp its operations—exhausted is the task.\nHeaven has five thieves; those who perceive them flourish.\nThe five thieves dwell within the heart, manifesting in Heaven’s workings;\nthe cosmos lies in the hand, all things spring from the body.\n\nHeaven’s nature is humanity; humanity’s heart is the mechanism;\nestablish Heaven’s Dao to govern humanity.\n\nWhen Heaven unleashes its killing intent, stars shift in their courses;\nwhen Earth unleashes its killing intent, dragons and serpents rise from the land;\nwhen humanity unleashes its killing intent, Heaven and Earth invert;\nwhen Heaven, Earth, and humanity unite in intent, the foundation of ten thousand transformations is set.\n\nNature has skill and clumsiness, which may be concealed.\nThe nine orifices’ malice lies in the three vital passages—\nmovement and stillness are within reach.\n\nFire arises from wood; when calamity strikes, it conquers;\ndeceit arises in the realm; when its time comes, it collapses.\nTo know this and refine it—this is called the Sage.\n\nHeaven, Earth, and all things are thieves;\nall things are humanity’s thieves;\nhumanity is the thief of all things.\n\nThe three thieves harmonized, the Three Powers secure.\nThus it is said:\nEat in season, and the hundred bones align;\nstir the mechanism, and all transformations rest.\n\nHumanity knows its spirit as spirit, yet does not know\nhow the unspiritual becomes spirit.\n\nSun and moon have their numbers, great and small have their limits—\nfrom this, the Sage’s work arises, and divine clarity emerges.\n\nIts thieving mechanism—none under Heaven cannot see it,\nnone under Heaven cannot know it.\nThe noble one who attains it preserves himself;\nthe petty one who attains it risks his life.\n\nThe blind excel in hearing, the deaf in sight.\nSever one source of profit, and tenfold troops are needed;\nthree reversals of day and night, and ten thousand troops are needed.\n\nThe heart is born from things, dies from things—the mechanism lies in the eyes.\nHeaven, though without favor, gives rise to favor;\nswift thunder and fierce winds—all respond in blind obedience.\n\nSupreme joy leaves excess, supreme stillness is austere.\nHeaven’s utmost selfishness becomes the utmost public good.\nLife’s decree rests in *qi*.\n\nThe dead are the root of the living; the living, the root of the dead.\nFavor arises from harm, harm from favor.\n\nThe foolish take Heaven’s patterns as sacred wisdom;\nI take the timing of things as the philosopher’s pattern.\n\n**Commentary on the *Yin Fu Jing*** *(Tang Dynasty)* — **Li Quan**\n\n**The Chapter on the Daoist Immortals Embracing Unity**\n\nObserve the Dao of Heaven, grasp its practice—this is all.\nThus Heaven has five *accomplices* (贼), and those who perceive them flourish.\n\n*Annotation*: The Yellow Emperor discerned the *accomplices’* timing (机), ascending in broad daylight.\nThe Shang and Zhou dynasties grasped the *accomplices’* divine verification (验), using the lesser to subdue the greater.\nGuan Zhong understood the *accomplices’* temporal trust (信), uniting the feudal lords nine times.\nFan Li seized the *accomplices’* urgency of affairs (物), conquering the South.\nZhang Liang obtained the *accomplices’* merit of favor (功), defeating mighty Chu.\n\nThe five *accomplices* reside in the heart, manifesting in Heaven.\nThe cosmos lies within the grasp; ten thousand transformations arise from the body.\n\n*Annotation*: Man lives by the five flavors, dies by the five flavors.\nEach flavor has its master—harmonizing them brings life, opposing them brings destruction.\nProlonged indulgence accumulates *qi* that corrupts the five viscera, nearing annihilation.\nThus mortals cannot complete their natural lifespan—because their indulgence in life is excessive.\n\nHence, the Supreme Dao is insipid, embryonic breathing without taste.\nThe arts of the immortals number a hundred, yet their essence lies in embracing unity and holding the center.\nThe arts of the maiden number a hundred, yet their essence lies in returning essence and refining *qi*.\nThe arts of the Golden Elixir number a hundred, yet their essence lies in divine water and the Flowering Pool.\nThe arts of governance number a hundred, yet their essence lies in purity and self-transformation.\nThe arts of war number a hundred, yet their essence lies in stratagem and counter-stratagem.\n\nThese five arts—when rolled up, are hidden in the heart, concealed in the spirit;\nwhen applied, they pervade Heaven, nourish Earth.\nThe cosmos in an instant lies within human grasp;\nthe flourishing and withering of all things arise from the body.\n\nThe Yellow Emperor attained this, first securing the Three Palaces, then governing the myriad lands—\nwhen the tripod was complete, he rode the dragon and ascended to Heaven.\n\nHeaven’s nature is humanity; humanity’s heart is the mechanism.\nEstablish the Dao of Heaven to determine humanity.\nWhen Heaven unleashes its killing mechanism, stars shift their lodges;\nwhen Earth unleashes its killing mechanism, dragons and serpents rise from the land;\nwhen humanity unleashes its killing mechanism, Heaven and Earth reverse.\nWhen Heaven and humanity unleash together, the foundation of ten thousand changes is set.\n\n*Annotation*: Great chaos and disorder, war, flood, drought, and locusts—these are Heaven’s killing mechanisms.\nYu the Great and Shun tilled the fields, Yu of Xia rescued the drowned, the Shang dynasty imprisoned the Xia on Tai, the Zhou imprisoned the Shang at Youli, the Han founder was a market warden, and Wei Wu was a beggar—\nall were not born to royal station, yet they seized Heaven’s killing mechanism and rose from obscurity to rule.\n\nThe virtuous man lingers in the wilds, the petty man holds office, powerful ministers wield authority, and the people yearn for chaos—\nthis is humanity’s killing mechanism.\nTang overthrew Jie, Wu of Zhou attacked Zhou, Xiang Yu beheaded the infant Hujia, and Cao Wei deposed Emperor Xian—\nthese were seizing humanity’s killing mechanism.\n\nTo overturn nobility into lowliness, to reverse lowliness into nobility—\nthis is like Heaven and Earth reversing.\nWhen Heaven and humanity’s mechanisms unite, the logic of success and failure is inevitable.\nTen thousand changes, a thousand transformations—\nthe sage follows them to establish his foundation.\n\nSkill and clumsiness in nature can be concealed.\n\n*Annotation*: When inner desire does not emerge, it is called *opening* (启);\nwhen external evils do not enter, it is called *closing* (闭).\nInner opening is its mechanism.\nMysterious as *yin*, unmoving as a mountain—\nthe nature of skill and clumsiness makes it impossible for the idle to glimpse.\n\nThe nine orifices’ evils lie in the three essentials, which can be moved or stilled.\n\n*Annotation*: Two leaves covering the eyes cannot see Tai Mountain;\ntwo beans blocking the ears cannot hear thunder;\na single pepper touching the tongue cannot speak.\nIf all nine orifices are corrupted, they are insufficient to discern changes.\nYet in the three essentials—spirit, heart, will—\nwhen the mechanism stirs but has not yet manifested, the spirit follows it.\nWhen the mechanism portends completion, the heart plots it.\nWhen the mechanism erupts and action follows, the will decides it.\n\nWhen the mechanism stirs, it moves with the vigor of *yang*.\nThe Five Peaks cannot steady its corners, the Four Seas cannot bind its threads.\nWhen the mechanism is still, it aligns with the virtue of *yin*.\nThe wise cannot manipulate its glory, deep spies cannot fathom its schemes,\nHeaven and Earth cannot seize its timing—what then of mortals?\n\nFire arises from wood; when disaster strikes, it conquers.\nTreachery arises from the state; when the time comes, it collapses.\nTo refine this knowledge is to be a sage.\n\n*Annotation*: Fire arises from wood—when fire erupts, wood burns;\ntreachery arises from the state—when treachery matures, the state falls.\nWood harbors fire unseen, fire begins in formlessness;\nthe state harbors treachery unseen, treachery begins without sign.\nOnly the most sagely cannot refine body and conduct to prevent the treacherous fire from igniting.\nThus the state has no armies without soldiers, no calamities without cause.\n\nWith Ji Zi fleeing and bound in deerskin, Shang Rong imprisoned while Sheng Shu wept—\nthe chapter on enriching the state and securing the people.\n\nHeaven’s creation and Heaven’s destruction are the Dao’s principle.\nHeaven and Earth are thieves of the myriad things;\nthe myriad things are thieves of humanity;\nhumanity is thief of the myriad things.\nThe three thieves each have their due, the Three Powers each their place.\n\n*Annotation*: Heaven and Earth, in generating the myriad things, steal their vigor and decay;\nthe myriad things, in serving humanity, steal humanity’s arrogance and excess;\nhumanity, in mastering the myriad things, steals their destruction.\nAll proceed naturally.\nWhen the three thieves act rightly, the Three Powers fulfill their roles in turn.\n\nThus it is said:\nEat in season, and the hundred limbs harmonize;\nstir the mechanism, and the ten thousand transformations settle.\nHumanity knows the spirit’s spirit, yet does not know how the unmanifest spirit manifests.\n\n*Annotation*: All have sainthood, yet none value the sage’s folly.\nHaving seen their sainthood, then perceived their folly, then seen their sainthood again—\nthus the *Book of Documents* says:\nExclusive reliance on cleverness brings failure;\nexclusive reliance on obscurity brings contradiction.\nOne clarity, one obscurity—this is what the multitude bears.\n\nYi Yin was a tavern keeper, Tai Gong a butcher, Guan Zhong a leatherworker, Bai Li a soup vendor—\nin times of decline, all were deemed unremarkable.\nYet when they met Tang, met Wen Wang, served Duke Huan, or served Duke Mu,\ntheir Dao saved the living, their deeds shaped the cosmos—\nand all were deemed supremely extraordinary.\n\nThe sun and moon have their cycles, the great and small have their fixed measures;\nthus arise the sage’s deeds, thus emerge the divine’s luminosity.\n\nTheir theft—*it is the subtle mechanism*.\nNone beneath the heavens can see it, none can know it.\nThe **gentleman** who grasps it, steadies his own **Dao/Way**;\nthe **petty man** who grasps it, risks his life recklessly.\n\n*Annotation*: The **Lord of the Season** (Ji Zhōu) was humbled by the world, yet none saw the mechanism of his rise, nor knew its source.\nThe **Hegemons and Kings** (Bàwáng) opened their realms by this mechanism, yet none knew the mechanism of their rise, nor knew the source of their rise.\n\nThe **gentleman** who seizes this mechanism, acts in accordance with Heaven and aligns with humanity, thereby steadfastly preserving his own **Dao/Way**.\nThe **petty man** who seizes this mechanism, provokes war and indulges in martial folly, thereby lightly discarding his own life.\n\nThe *Book of Changes* (Yì) says:\nThe **gentleman** perceives the mechanism and acts accordingly—he does not wait for the day to end.\nIt also says: *He who knows the mechanism, his wisdom is divine*.\n\nThe mechanism—easy to perceive, yet difficult to grasp;\nnear at hand, yet distant in insight.\n**The chapter on \"Strong Armies and Strategic Triumph\"** (Qiángbīng Zhànshèng Yǎnshù):\nThe blind excel in hearing, the deaf excel in sight.\nSeize one source of advantage, and the army’s power multiplies tenfold;\nthree reversals of day and night, and the army’s power multiplies ten thousandfold.\n\n*Annotation*: Human ears and eyes are divided by the heart and completed by the spirit.\nWhen the heart is divided, the mechanism lacks precision;\nwhen the spirit is perfected, the mechanism becomes subtle.\nThus, Shī Kuàng (the blind musician) blinded his eyes yet sharpened his ears,\nand Lí Zhū (the sharp-sighted) sealed his ears yet clarified his vision.\nTo rely on one source of advantage while countering it within the heart,\nand to act upon circumstances, perceiving the mechanism—this ensures tenfold success.\nTo ponder three reversals, to experience day and night,\nand to think before acting—this ensures ten thousandfold success.\n\nThe heart is born from things, yet dies from things;\nthe mechanism lies in the eyes.\n\n*Annotation*: The most immediate mechanism in the world belongs to the heart and eyes.\nThe heart can perceive and reveal, the eyes can see the mechanism.\nWhen Qín Shǐhuáng (First Emperor of Qin) toured the east to Huàijī,\nXiàng Yǔ (Item羽) saw his mechanism and his heart was stirred by things,\ntelling Xiàng Liáng (项良): *\"He can be taken and replaced!\"*\nWhen the Jin army had fully assembled at Huái-È (淝水),\nChí Jiān (苻坚) said: *\"Seeing his mechanism, my heart dies from things,\"*\ntelling Chí Róng (苻融): *\"That is a mighty foe—why is his force so slight?\"*\nThus one knows that the heart’s life and death lie in things,\nand the mechanism of success and failure is revealed in the eyes.\n\nHeaven’s nature is without favor, yet great favor arises.\nSwift thunder and fierce winds—none escape their sway.\n\n*Annotation*: Heaven’s heart has no favor, yet all things have hearts,\nand they attribute favor to Heaven.\nExcessive joy leads to dissipation, excessive stillness to sternness.\n*Annotation*: Joy becomes extravagant, stillness becomes upright and restrained.\n\nDissipation dulls the spirit, sternness clarifies it.\nThe spirit is the source of wisdom—when the spirit is clear, wisdom shines.\nWisdom is the repository of the heart—when wisdom is just, the heart is balanced.\nNone can reflect in flowing water, yet all can reflect in still water.\nBecause it is clear and even, a clear spirit and tranquil intent\ncan then discern the emotions of things.\n\nThe **sage**, not indulging in supreme joy nor resting in supreme stillness,\ndwells between tranquil spirit and harmonious joy—this is called *guarding the middle* (shǔ zhōng).\nThus, benefits cannot seduce him, nor can music and beauty unsettle him;\neloquent speakers cannot persuade him, nor can clever men move him,\nnor can the bold intimidate him.\nHe foresees calamity beyond the heavy gates,\nand contemplates disaster within the distant void.\n\nHeaven will not oppose him, let alone the deceitful strategies of war.\n\nHeaven’s supreme partiality yields universal fairness.\n*Annotation*: The **Dao/Way** of Heaven nurtures all things without neglecting even the smallest—\nthe gnarled tree, the tiny worm, the great eagle, or the humble wild duck.\nGreat and small, long and short—each finds its place, the height of partiality.\nClouds move, rain falls, thunder and lightning, frost and dew—\nlife and death are meted out with equal measure, the height of fairness.\n\nThe **sage** follows Heaven and models Earth,\nnourishes the myriad people, and discerns their toil and suffering—\nthe height of partiality.\nHe issues righteous decrees and implements laws like symbols—\nthe height of fairness.\n\nSūn Wǔ (孙武) said:\n*\"View your soldiers as beloved children, and you can die together;\ntreat them like infants, and you can cross deep ravines with them.*\nLoving yet unable to command is like a spoiled child.\nThus, govern them with **virtue/power** and discipline them with force.\n\nThe art of capturing lies in **qi**.\n*Annotation*: The tortoise devours the python, the falcon strikes the crane,\nthe yellow weasel feasts on the tiger, the flying squirrel severs the monkey,\nthe toad and leech drain the fish, the wolf and dog bite the heron,\nthe *yǔrén* (余甘) tames gold with gentleness, and the *hèchē* (河车) harnesses its power.\nEndless transformations yield jade, and *xiónghuáng* (雄黄) changes into iron.\nThere are woods that do not burn and stones that float on water.\nWhen beasts, birds, trees, and stones obtain their **qi**, they can subdue the greater with the lesser—\nhow much more so when **Heroes** obtain their **qi**,\nand cannot then fail to purify the world and command the cosmos!\n\nLife is the root of death; death is the root of life.\nFavor arises from harm; harm arises from favor.\n\n*Annotation*: Those who scheme for life must first face death before attaining it;\nthose who practice death must first experience life before embracing it.\nThe *Mìguànzǐ* (鹖冠子) said:\n*\"Without death, there is no life; without separation, there is no completion.\"*\nSūn Wǔ said:\n*\"Drive him to the brink of death, and then he will live;\nbring him to the edge of destruction, and then he will survive.\"*\nWú Qǐ (吴起) said:\n*\"On the battlefield, where corpses stand—\nthose who must die will live, those who cling to life will die.\"*\nFavor is the source of harm; harm is the source of favor.\nWú Shù (吴树) bestowed favor upon Yuè (越), yet harm emerged;\nZhōu (周) established harm against Yīn (殷), yet favor arose.\nDeath and life, favor and harm—\nthey intertwine in opposition.\n\nFools attribute Heaven and Earth’s patterns to the **sage’s virtue/power**,\nwhile I discern the **wise’s virtue/power** in the patterns of time and things.\n\n*Annotation*: When auspicious stars appear, yellow dragons descend, phoenixes soar,\nsweet springs flow, fine grains grow, the rivers do not overflow nor the seas surge,\nthe sun and moon eclipse, the five stars stray, the seasons disorder,\nday turns to night and night to day, mountains collapse and rivers dry,\nthunder strikes in winter and frost falls in summer—\nfools take these as Heaven and Earth’s chaotic mechanisms.\n\nYet when **virtue/power** is tranquil and settled,\nits light reaches to the four quarters,\nand the **gentleman** of clear wisdom and refined **virtue/power**\ncan unite the nine clans.\nThe six ministries and three affairs are without conflict,\nall grains flourish, and the myriad people prosper.\nWhen a **foolish ruler** and **wicked ministers** prevail,\nlaws and decrees are inconsistent,\nheavy taxes and harsh governance blind both above and below,\nand the **noble and lowly** alike are deceived.\nNoble kin and favored ministers grow arrogant and extravagant,\nindulging in wine and music, towering halls and ornate walls,\nwhile the people scatter and flee,\nlonging for chaos and blaming the ruler above.\n\n「I regard this moment’s **Dao/Way** and **qi** as the means by which **order and chaos** unfold.\n\nWhere others see **foolishness** as **sageliness**,\nI see **sageliness** in not being **foolish**;\nWhere others see **strangeness** as **sageliness**,\nI see **victory** in not being **strange**.\n\n*Note:* The hearts of the **virtuous and wise** are profound and wondrous, beyond measure.\nThe traces of **Yu the Nest-Dweller** are observed by some,\nYet when **yin** shifts without fixed pattern,\nWhen **self-moving mechanisms** turn endlessly without limit—\nHow could the **wise** ever be **deceived**?\nTo judge the heart by its traces is the act of a **fool**.\n\nThus it is said:\n*\"To sink in water or plunge into fire,\nIs to court one’s own destruction.\"*\n\nThe **Dao/Way** of **Nature** is tranquil,\nThus Heaven and Earth and all things **thrive**.\nThe **Dao/Way** of Heaven and Earth is **pervasive**,\nThus **yin** and **yang** prevail.\nWhen **yin** and **yang** mutually advance,\nTheir transformations follow **harmony**!\n\nTherefore, the **sage** knows that **Nature’s Dao/Way** cannot be defied,\nAnd so aligns with it to govern.\n\nThe **Dao/Way** of utter stillness\nIs beyond the reach of **laws** and **calendrical measurements**.\nYet there are **strange instruments**—\nThese give rise to the **ten thousand phenomena**.\nWithin the **sealed cycles of ganzhi** (天干地支),\n**divine mechanisms** and **hidden arts** are concealed.\nThe **techniques** of **yin** and **yang** prevailing\nAre clearly revealed through the **phenomena**!\n\n*The Yellow Emperor’s* **Yinfu Jing** *Commentary* [Tang] Zhang Guo\n*The Yellow Emperor’s* **Yinfu Jing** *Preface*\nThe **Yinfu** has existed since the Yellow Emperor,\nIndeed, the **sage** embodies the **Dao/Way**’s mechanisms in accordance with Heaven.\nThe *Classic* states:\n*\"Those who grasp the **mechanism** thrive through ten thousand changes and grow ever stronger,\nEven reaching the rank of **king**.\nThose who lose the **mechanism** decline through ten thousand changes and grow ever weaker,\nEven to the point of **ruin**.\"*\n\nLater, **Yi** and **Lu** (伊吕) obtained its **fading remnants**,\nYet still managed to rescue the **living beings**—\nWhat then of the **sage**?\n\nIts text is **concise**, its meaning **profound**.\nThough there are many **earlier sages** who annotated it,\nTheir interpretations **conceal** and **reveal** in turn.\nLater scholars struggle to master it,\nAnd even those who claim a preference\nAre like climbing to Heaven without a ladder.\n\nIn recent times, **Li Quan** (李筌)\nFalsely attributed his work to **demonic sorcerers**,\nAnd recklessly composed annotations,\nMerely drawing on human affairs,\nFar from **harmonizing** with the **source**’s essence.\nHe does not blush to peer into **insignificant traces**,\nYet boldly presents his **shallow insights** as profound.\nIf **lowly men** secretly glimpse them,\nThey would boast of having grasped Heaven’s **mechanisms**.\n\nAlas!\nThough I am **your humble servant** and **foolishly ignorant**,\nI have always believed otherwise.\n\nThe morning I wished to hear the **Dao/Way**, and the evening I would die without regret.\nBy chance, in the **藏外** *(outer Daoist canon)*, I obtained *The Yinyu Transmission* (*Yinyu zhuàn*), unknown whose era it came from.\n\nIts words and logic are **profound and boundless** (玄邈),\nLike **sealing** (契) the **nature of the Way** (自然).\nThus I compiled it and appended my own annotations,\nHoping that future **virtuous men** (君子) would not lose the **Dao/Way’s essence** (道旨).\n\nThe **Yellow Emperor’s Yinyu Scripture** (黄帝阴符经) states:\n*\"To observe the **Dao/Way** of Heaven, to grasp Heaven’s actions—this suffices.\nTo observe the **Dao/Way** of Nature—there is nothing to observe.\nOne does not observe it with the eyes, but with the heart.\nThe heart is deep and subtle, yet sees nothing it cannot perceive,\nThus it can illuminate Nature’s **virtue/power** (性).\nThis **virtue/power** (性) is deep and subtle yet able to illuminate—\nThis is what is called ‘**Yin**’ (阴).\n\nTo grasp Nature’s actions—there is nothing to grasp.\nThus one does not grasp it with the hands, but with **mechanisms** (机).\n**Mechanisms** (机) are flexible and unrestricted, yet can **seal** (契) Nature’s **principles** (理).\nOnly when flexible and able to **seal**—\nThis is what is called ‘**Fu**’ (符).\nTo illuminate with the heart, to **seal** with **mechanisms**—\nThus the meaning of ‘**Yinyu**’ (阴符) is complete.*\n\nLi Quan took **Yin** (阴) as ‘**darkness**’ (暗),\nAnd **Fu** (符) as ‘**harmonization**’ (合),\nUsing this text as a preface—\nHow **blind** (昧) his understanding was!\n\nThus Heaven has **five thieves** (五贼), and those who see them prosper.\nThe **five thieves** (五贼) are: **fate** (命), **phenomena** (物), **timing** (时), **achievement** (功), and **spirit** (神).\n\nThe *Transmission* (传) says:\n*\"The **Dao/Way** of the **Sage** (圣人) is vast yet does not neglect the minute,\nAnd refined yet does not conceal its flaws.\nThus, when dwelling in peace, they follow the **Dao/Way** and manifest **virtue/power** (德) to transform it,\nAnd when encountering peril, they employ **strategic means** (权) and unleash **mechanisms** (机) to rescue it.\nTheir purpose is to rectify Heaven and Earth,\nTheir plan is to benefit all mankind.\nThus, using **great righteousness** (大义) to eliminate harm in the world,\nUsing **great benevolence** (大仁) to promote benefit in the world,\nUsing **ultimate correctness** (至正) to redress injustice in the world,\nUsing **absolute impartiality** (至公) to curb private interests in the world—\nThe schemes that **invert scripture yet harmonize the Dao/Way** (反经合道) have five names,\nWhich the **Sage** (圣人) **transmutes** (禅) and calls ‘**thieves**’ (贼).\nYet the world relies on them—\nThen they are called **virtue/power** (德).\nThus, the **thief** of **fate** (命) is such that people know of Heaven yet not its **thief**,\nHence the Yellow Emperor replaced the Flame Emperor.\nThe **thief** of **phenomena** (物) is such that people know of Heaven yet not its **thief**,\nHence Emperor Yao replaced Emperor Zhi.\nThe **thief** of **timing** (时) is such that people know of Heaven yet not its **thief**,\nHence Emperor Shun replaced Emperor Yao.\nThe **thief** of **achievement** (功) is such that people know of Heaven yet not its **thief**,\nHence Great Yu replaced Emperor Shun.\nThe **thief** of **spirit** (神) is such that people know of Heaven yet not its **thief**,\nHence Tang of the Shang overthrew the Xia dynasty.\nKing Wu of the Zhou overthrew the Shang dynasty.\nThus, those who see them prosper—\nThis is the natural way of prospering.\nThe Duke of Zhou took the **thief** of **fate** (命) as **strategic means** (用味),\nUsing it as an allegory.\nLi Quan did not comprehend—\nHe took the Yellow Emperor’s **thief** of the **fate** (命) of a maiden\nAnd the daytime ascent of a vapor as wrongdoing.\nThe **five thieves** (五贼) lie within the heart,\nTheir application lies in Heaven;\nThe universe lies within the hands,\nAnd ten thousand transformations arise from the body.\nThe *Transmission* (传) says:\n*'The establishment of **virtue/power** (德) is clear,\nThe use of **mechanisms** (机) is subtle.\nWhen unleashed from within, it is seen without—this is all.*\nHow could it mean **wielding arms to create banditry and chaos** (称兵革以作寇乱)?\nTo see its **mechanisms** (机) and grasp them,\nEven if the universe is vast,\nIt does not depart from the **palm and fingers** (掌握),\nMuch less its smaller aspects!\nTo know its **spirit** (神) and embody it,\nEven if myriad things abound,\nThey cannot escape one’s **chest and mind** (胸臆),\nMuch less their fewness!\nNature’s **creative transformations** (造化) and their **force** (力) belong to me—\nIs this not **grand** (盛)?\nIs this not **great** (大)?\nLi Quan and others took the **five thieves** (五贼) as the **five flavors** (五味),\nSaying that following them leads to **immortality** (神仙) and **non-death** (不死).\nThis is the **most egregious distortion** (诬) of the **Dao/Way**!\n\nHeaven’s **nature** (性) is **humanity** (人),\nAnd the **human heart** (人心) is **mechanisms** (机).\nTo establish the **Dao/Way** of Heaven is to **settle** (定) **humanity** (人).\nThe *Transmission* (传) says:\n*'**Humanity** (人) refers to Heaven’s **nature** (性),\n**Mechanisms** (机) refer to the human heart.'*\n**Human nature** (人性) is originally **profound and naturally harmonious** (玄合),\nThus the **Sage** (圣人) can embody the **five thieves** (五贼).\n\nWhen Heaven unleashes the **killing mechanism** (杀机), dragons and serpents rise from the land;\nWhen **humanity** (人) unleashes the **killing mechanism** (杀机), Heaven and Earth **reverse and shift** (反复).\nThe *Transmission* (传) says:\n*'Heaven’s **mechanisms** (机) expand yet do not produce life,\nHeaven’s **mechanisms** (机) relax yet do not cause death.\nHeaven has **expansion and relaxation** (驰张), its use has **flaws and virtues** (否臧).\nWhen expanded, the **killing mechanism** (杀威) takes action;\nWhen relaxed, the **killing mechanism** (杀威) vanishes.\nThe **mechanisms** (机) of **humanity** (人) are likewise.\nHeaven uses **qi** (气) as its **威** (威),\nAnd **humanity** (人) uses **virtue/power** (德) as its **mechanisms** (机).\nIn autumn and winter, the **Yin qi** (阴气) is severe and congealed—\nThis is Heaven’s **expanded killing mechanism** (张杀机),\nThus dragons and serpents fear and **hibernate** (蛰伏).\nWhen winter passes and spring arrives, **Yin** retreats and **Yang** grows—\nThis is Heaven’s **relaxed killing mechanism** (驰杀机),\nThus dragons and serpents rejoice and **awaken** (振起).\nHeaven has **cold and warmth** (寒暄),\nAnd **virtue/power** (德) also has **cold and warmth** (寒暄).\nWhen **virtue/power** (德) and **punishments** (刑) are strict and orderly,\nThis is the ruler’s **expanded killing mechanism** (张杀机),\nThus the lowly fear and submit.\nWhen **virtue/power** (德) and **punishments** (刑) are **imbalanced** (偏),\nThis is the ruler’s **relaxed killing mechanism** (驰杀机),\nThus the wicked rejoice and **run wild** (驰骋).\nRank has **high and low** (尊卑), mirroring Heaven and Earth,\nThus it is said:\n*\"When Heaven unleashes the **killing mechanism** (杀机), dragons and serpents rise from the land,\nAnd banditry and chaos originate;\nWhen **humanity** (人) unleashes the **killing mechanism** (杀机), Heaven and Earth **reverse and shift** (反复),\nAnd the **high and low** (尊卑) are thus **overthrown** (革).\"*\nThe Duke of Zhou, Zhuge Liang, and others,\nWhen they **slaughtered thousands** (杀人过万),\nGreat winds and tempests arose, and the day darkened as night—\nThey took this as Heaven and Earth **reversing and shifting** (反复),\nBut their error was profound.\n\nHeaven and **humanity** (人) **harmonize virtue/power** (合德),\nAnd ten thousand transformations rest on a **foundation** (基).\nThe *Transmission* (传) says:\n*\"Heaven dispenses **mechanisms** (机) of calamity and fortune above,\nAnd the ruler moves **mechanisms** (机) of benefit and harm below.\nThus those with **virtue/power** (德) prosper through ten thousand transformations,\nAnd reach the heights of kingship;\nThose without **virtue/power** (德) decline through myriad changes,\nAnd meet their end in ruin.\nThus it is said: Heaven and **humanity** (人) **harmonize virtue/power** (合德),\nAnd ten thousand transformations rest on a **foundation** (基).\nThis is the **naturally so** (自然而然).\"*\n\n**Nature** (性) has **skill and clumsiness** (巧拙),\nWhich can be **concealed** (伏藏).\nThe *Transmission* (传) says:\n*\"The **nature** (性) of the **Sage** (圣人) is **skilled** in applying wisdom,\nYet **clumsy** in exerting strength.\nWhen in adversity or peril, they **plot with the Dao/Way** (谋道) to aid it;\nWhen facing the **strong and the clever** (强与明), they **conceal righteousness** (伏义) to retreat.\nThis is essential for **governing the state** (理国),\nAnd likewise for **employing military force** (用师).\nThe **evil** (邪) of the **nine orifices** (九窍) lies in the **three critical points** (三要),\nWhich can be **activated or stilled** (动静).\"*\n\n*«The Transmission* says:\nThe **use** (用) of the **nine orifices** (九窍) lies in the **three critical points** (三要) as the **mechanism** (机).\nThe **three critical points** (三要) are **mechanism** (机), **emotions** (情), and **nature** (性).\nTo **govern** (则) **mechanism** (机) is to have all things **settled** (安);\nTo **govern** (则) **emotions** (情) is to have all things **perverse** (邪);\nTo **govern** (则) **nature** (性) is to have all things **upright** (正).\nThus, the **Sage** (圣人) **activates** (动) to **conceal emotions** (伏其情),\n**stills** (静) to **preserve nature** (常其性),\nAnd **delights** (乐) to **fix mechanism** (定其机).\nThe **petty man** (小人) does the opposite, hence the following passage:\n*\"Duke of Zhou* (太公) **established** (为) the **three critical points** (三要) as **ears, eyes, and mouth** (耳、目、口);\n*Li Qun* (李筌) **established** (为) the **heart, spirit, and will** (心、神、志), all **ignoring mechanism** (忘机).\nBoth **lost** (俱失) the **true meaning** (正意) of the *Yin Fu* (《阴符》).\n\nFire **arises** (生) from wood, yet **disaster** (祸) **strikes** (发) and must be **overcome** (克);\nTreachery **arises** (生) from the state, yet **opportunity** (时) **strikes** (动) and must be **exploited** (溃).\nTo **know** (知) this and **refine oneself** (修炼) is called being a **Sage** (圣人).\n*The Transmission* says:\n*\"Wood’s **nature** (性) is **still** (静),\nYet when it **moves** (动), fire **arises** (生).\nIf one does not **perceive** (觉) the fire’s **flourishing** (盛),\nIt will **burn** (焚) its own essence.\nSimilarly, **human nature** (人之性) is **still** (静),\nYet when it **moves** (动), treachery **arises** (生).\nIf one does not **perceive** (觉) treachery’s **completion** (成),\nIt will **disrupt** (乱) the state.\n\nThe **clear-sighted** (明者) see **others’ weaknesses** (彼之隙) to **set their mechanism** (设其机),\nThe **wise** (智者) know **others’ flaws** (彼之病) to **harness advantage** (圆其利),\nThen the people of the world—**they** (彼) are **foolish** (愚), **I** (我) am **Sage** (圣).\nThus, the **living** (生者) claim to have **secured life** (得其生),\nAnd the **dead** (死者) claim to have **secured death** (得其死).\n**Non-action** (无为) yet **nothing is left undone** (无不为),\nThis is the **principle** (理) of **attaining the Dao/Way** (得道).\n\n**Heaven’s creation and destruction** (天生天杀) is the **principle** (理) of the Dao/Way (道).\nHeaven and Earth are the **thieves** (盗) of **ten thousand transformations** (万物);\nTen thousand transformations are the **thieves** (盗) of **humanity** (人);\nHumanity is the **thief** (盗) of **ten thousand transformations** (万物).\nWhen the **three thieves** (三盗) are **properly aligned** (既宜),\nAnd the **Three Powers** (三才) are **settled** (既安).\n*The Transmission* says:\n*\"Heaven and Earth **transform** (化) **ten thousand things** (万物) through **yin-yang qi** (阴阳之气),\nYet **ten thousand things** (万物) do not **know** (知) their **theft** (盗).\n**Ten thousand things** (万物) **nourish** (飨) **humanity** (人) with **good and evil flavors** (美恶之味),\nYet **humanity** (人) does not **know** (知) their **theft** (盗).\n**Humanity** (人) **controls** (制) **ten thousand things** (万物) with **advantage and harm** (利害之谟),\nYet **ten thousand things** (万物) do not **know** (知) their **theft** (盗).\nThe **three thieves** (三盗) **mysteriously unite** (玄合) in the **human heart** (人心),\nAnd the **Three Powers** (三才) **remain still and follow** (静顺) the **principle of Heaven** (天理).\n\n**Food** (食) is **obtained** (得) only at its **time** (时), yet **one’s body** (终身) **never fails to heal** (无不愈);\n**Mechanism** (机) is **activated** (动) only when **ready** (然后), yet **all things** (庶类) **never fail to settle** (无不安).\nIf **food** (食) is not **taken at its time** (得其时),\nOr **mechanism** (机) is not **activated when ready** (动其机),\nThen **ruin and extinction** (灭亡) are near.\nThus it is said:\n*\"To eat at its time, the hundred bones are **regulated** (治);\nTo move with mechanism, ten thousand transformations are **settled** (安).*\n\n**Humanity** (人) knows its **spirit** (神) and **spirit** (神) is **manifest** (神),\nYet does not know how **spirit** (神) **manifests** (所以神).\n*The Transmission* says:\n*\"The people of their time do not know that **theft** (盗) is **theft** (之为盗),\nOnly saying that **spirit** (神) can **manifest** (能神).\n*Ghost Valley Master* (《鬼谷子》) says:\n*\"When **both sides** (彼此) are **unaware** (不觉), it is called **spirit** (神).\nThis is the **refinement** (功) of **subtlety** (微) **achieved** (着矣).\nLi Qun did not understand this passage’s **unified meaning** (意通三盗),\nBut **separately** (别) used **Sage** (圣人) and **foolish man** (愚人) as **analogies** (喻),\nHow **erroneous** (谬) is this!\n\nThe **sun and moon** (日月) have **fixed measures** (数),\nAnd the **great and small** (大小) have **set distinctions** (定).\nFrom this, **Sage’s great deeds** (圣功) **arise** (生),\nAnd **spirit and clarity** (神明) **emerge** (出).\n*The Transmission* says:\n*\"The sun and moon have **fixed standards** (准), **cyclical movements** (运数);\nThe **great and small** (大小) have **set distinctions** (定), **ruler and subject** (君臣).\nTo **observe Heaven’s time** (观天之时),\nTo **examine humanity’s affairs** (察人之事),\nTo **grasp humanity’s mechanism** (执人之机),\nThen the **Sage** (圣) **achieves great deeds** (得以功),\nAnd **spirit and clarity** (神) **emerge** (得以明).\n\nWhen the **heart is tranquil** (心冥) and **principle is united** (理合),\nThis is the **best of stillness** (安之善).\nLi Qun **mistakenly took** (以) **calculating cycles** (度数) as the **sun and moon** (日月),\nAnd **remaining portions** (余分) as the **great and small** (大小),\nSaying that **spirit-qi** (神气) can **generate Sage’s great deeds** (生圣功) and **spirit and clarity** (神明),\nHow **greatly mistaken** (错谬) is this!\n\nAs for their **theft of mechanism** (盗机),\nNo one under Heaven can **see** (见) or **know** (知) it.\nThe **noble man** (君子) who **attains** (得) it **preserves himself** (固躬),\nThe **petty man** (小人) who **attains** (得) it **risks his life** (轻命).\n*The Transmission* says:\n*\"Their **theft** (盗) is **subtle** (微) yet **movement** (动) is **clear and broad** (甚明博),\nTheir **actions** (行) are **extremely mysterious** (极玄妙).\nThe **noble man** (君子) who **uses** (用) it—\nWhen **prosperous** (达), he **saves all under Heaven** (兼济天下), **Duke of Zhou** (太公) being such a one.\nWhen **impoverished** (穷), he **perfects himself alone** (独善一身), **Master Kong** (夫子) being such a one.\nIs this not the **ability to discern advantage** (择利) with **great precision** (审)?\n\nThe **petty man** (小人) who **uses** (用) it—\nThen he is **bewildered by fame** (惑名) and **loses himself** (失其身).\nIs this not **Zhong the Great Officer** (大夫种)?\nTo **gain advantage yet lose righteousness** (得利而亡义),\nIs this not **Li Si** (李斯)?\nIs this not the **failure to uphold the Dao/Way** (信道) with **sincerity** (笃)?\n\nThe **blind** (瞽者) are **good at hearing** (善听),\nThe **deaf** (聋者) are **good at seeing** (善视).\nTo **cut off advantage at its source** (绝利一源), **military force** (用师) is **tenfold** (十倍).\nTo **return three times** (三返) **day and night** (昼夜), **military force** (用师) is **ten thousand-fold** (万倍).\n*The Transmission* says:\n*\"The blind are **good at hearing** (善于听),\n**Forgotten** (忘) of **colors** (色) and **attentive** (审) to **sounds** (声),\nThus they **achieve great acuity** (致其聪).\nThe deaf are **good at seeing** (善于视),\n**Abandoning** (遗) **ears** (耳) and **fixing on eyes** (专目),\nThus they **achieve great clarity** (致其明).\nHence they can **perform the deeds of ten thousand troops** (能十众之功).\nTo **move three times** (三而行) within **one day** (一昼之中),\nThis is how they **reach** (所以至).\nTo **think three times** (三而思) within **one night** (一夜之中),\nThis is how they **refine** (所以精).\nThus they can **command ten thousand troops** (用万众之人).\nLi Qun did not know that **military force** (师) is **troops** (众),\nBut **mistakenly took** (以为) it as **military strategist** (兵师),\nThis is **error** (误).\n\nThe **heart** (心) **arises** (生) from **things** (物) and **dies** (死) from **things** (物),\nAnd **mechanism** (机) lies in the **eyes** (目).\n*The Transmission* says:\n*\"The heart has **love and hatred** (爱恶) **emotions** (之情),\n**Things** (物) have **flaws and merits** (否臧) **uses** (之用).\nThe **eyes** (目) **observe** (视) and **discern** (察) them **externally** (于外),\nThe **heart** (心) **responds** (应) and **judges** (度) them **internally** (于内).\nIf **good** (善), then **follow** (从) and **act** (行) upon it;\nIf **not** (否则), then **withdraw** (违) and **stop** (止).\nThis is how they **encourage virtue** (劝善) and **punish evil** (惩恶).\nLi Qun **mistakenly took** (以) **Item羽’s** (项羽) **lack of mechanism** (昧机) as the **heart arising from things** (心生于物);\nAnd **Fú Jiān’s** (符坚) **perception of mechanism** (见机) as the **heart dying from things** (心死于物).\nHe **completely failed** (殊不知) to grasp **flaws and merits** (有否臧之用).\n\nHeaven’s **greatest self-interest** (至私) **generates** (生) **greatest public use** (至公).\n*The Transmission* says:\n*\"Heaven’s **natural principle** (自然之理) is **subtle** (微) yet **unknowable** (不可知),\nThis is the **greatest self-interest** (至私).\nYet when **treacherous omens** (凶象) **appear** (见) as **Heaven’s warnings** (咎征),\n**Humanity** (人) can **take heed** (儆戒) and **cultivate virtue** (修德).\nWhen **thunder and fierce winds** (迅雷烈风) **stir** (动) **humanity** (人),\n**Humanity** (人) can **fear** (恐惧) and **attain blessings** (致福).\nThis is how **greatest self-interest** (无恩) **generates** (生) **greatest public use** (大恩).\nLi Qun **mistakenly took** (以) **Heaven and Earth’s lack of benevolence** (天地不仁) as **greatest public use** (大恩),\nAnd **ten thousand things returning to Heaven** (万物归于天) as **bewildered** (蠢然).\nThis **greatly diverges** (殊背) from the *Yin Fu*’s **original meaning** (本意).\n\n*The Transmission* says:\n**The greatest delight is nature’s excess** (至乐性余),\n**The greatest stillness is nature’s restraint** (至静性廉).\n*\"When **emotions** (情) are **unreleased** (未发), it is called **the Middle** (中);\nTo **guard the Middle** (守中) is called **constancy** (常),\nThen **delight attains its purpose** (乐得其志) and **nature has excess** (性有余).\nWhen **nature is tranquil and constant** (性安常), it is called **self-sufficiency** (自足);\nThen **stillness attains its purpose** (静得其志) and **restraint is constant** (廉常足).\nLi Qun **mistakenly took** (以) **excessiveness** (奢) as **delight’s nature** (乐性),\nAnd **restraint** (廉) as **stillness** (静),\nHow **contrary** (殊乖) is this to the **supreme Dao/Way** (至道)!\n\nHeaven’s **greatest self-interest** (至私) **becomes** (用) **greatest public use** (至公).\n*The Transmission* says:\n*\"The **natural principle** (自然之理) is **subtle** (微) yet **unknowable** (不可知),\nThis is the **greatest self-interest** (至私).\"*»\n\n「The **greatest self-interest** (至私) of **Nature’s function** (自然之功) is **manifest yet unalterable** (明而不可违), the **greatest public use** (至公) of the Dao/Way.\n\nThe **Sage** (圣人) embodies it thus. Li Qun cites *The Art of War* (《孙子》):\n*\"To treat soldiers as one’s own beloved children, they can be made to die together with you.\"* (视卒如爱子，可以之俱死)\nWhy so? **The principle of capture lies in qi.** (擒之制在气)\n*The Transmission* says:\n*\"To capture beings, one uses qi; to control them, one uses strategy. Why rely on brute force of great or small?\"* (擒物以气，制之以机，岂用小大之力乎？)\n**Duke Zhou** (太公) said:\n*\"Is it by great or small force that one controls the other?\"* (岂以小大而相制哉？)\nLi Qun fails to grasp **the principle of capture** (擒之义), misapplying it to **wild beasts** (禽兽).\nHis annotations cite instances like *the tortoise devouring the snake* (玄龟食蛇), *the yellow-bellied beast preying on the tiger* (黄腰啖虎), etc.—how lamentable!\n\n**Life** (生) is the root of **death** (死), and **death** is the root of **life**.\n**Harm** (害) gives rise to **favor** (恩), and **favor** gives rise to **harm**.\n**Life** is what people cherish, for it is **profoundly beneficial to the body** (厚于身).\nYet **excess** (太过) leads to **the Dao/Way’s ruin** (道丧), and **death** (死) comes naturally.\n**Death** is what people abhor, for it **damages the affairs of life** (损于事).\n**Clarity** (至明) preserves the Dao/Way, and **life** (生) is naturally secured.\n\n**Favor** (恩) is the **principle of fortune** (福理) reaching others,\n**Harm** (害) is the **principle of calamity** (祸乱) reaching others.\nTo **harm oneself** (损己) is to **benefit others** (物之所益)—\nthus, **harm** (害) gives rise to **favor** (恩).\n\nLi Qun cites *The Art of War* (《孙子》) on warfare as **life and death** (生死),\nand **Ding Gong** (丁公) and **Guan Zhong** (管仲) on **favor and harm** (恩害).\nHow strange! The **foolish man** (愚人) regards **Heaven and Earth’s patterns and principles** (天地文理) as **Sagehood** (圣),\nwhile I see **the Sagehood in adapting to time and things** (时物文理) as **philosophy** (哲).\nOthers consider **planning** (期) as **Sagehood** (圣),\nbut I consider **not planning** (不期) as **Sagehood** (圣).\n\n*The Transmission* says:\n*\"Observe the **Heaven’s movement** (天之运) through the four seasons,\nand **Earth’s transformation** (地之化) of all things—\nto know all yet **conceal knowledge** (蔽之以无知),\nto **bestow small favors** (小恩于人) while **nurturing oneself** (蒙自养),\nis the way of the Sage.\"*\n\nTo know the **four seasons’ course** (四时之行) and **all things’ generation** (万物之生)\nis to grasp **Nature’s spontaneity** (自然).\nThus, the Sage **resides in the Middle** (以中自居).\n\nHence it is said: *\"Death and life lie within me alone.\"* (死生在我而已矣)\n**Human death** is like **drowning in water** (沈水自溺) or **burning in fire** (投火自焚)—\n**self-inflicted annihilation** (自取灭亡).\n\nTo **govern a state with the Dao/Way** (理国以道) lies in **reducing its affairs** (损其事).\nTo **command an army with strategy** (理军以权) lies in **abolishing its weapons** (亡其兵).\nThus, **without the mechanism of death** (无死机), there is **no death** (不死).\nWhat can **ghosts and spirits** (鬼神) do to me?\n\nThe Sage **cultivates oneself** (修身) to **secure one’s family** (安其家),\ngoverns a state (理国) to **pacify the world** (平天下),\nby **establishing the mechanism of life** (立生机).\nTo **remove one’s deathly nature** (去其死性) is the **mechanism of life** (生之机).\nTo **eliminate the mechanism of death** (除死机) and **harness life’s vitality** (取其生情) is the **mechanism of death** (死之机).\n\nLi Qun **does not comprehend Heaven’s Dao/Way** (不天道),\nyet he **tests Heaven’s Dao/Way** (验天道) with the **foolish, the Sage, and those who embody the Dao/Way yet remain ignorant** (体道愚昧之人).\nHis error is **most grievous** (失之甚也).\nHence it is said: *\"Drowning in water, burning in fire—self-inflicted annihilation.\"* (沈水入火，自取灭亡)\nThe annotation is **already made above** (注在上矣).\n\n**Nature’s Dao/Way is supremely still** (自然之道静),\nso **Heaven and Earth and all things are born** (天地万物生).\n*The Transmission* says:\n*\"Nature’s Dao/Way **acts without action yet nothing remains undone** (无为而无不为).*\n**Movement and stillness both attain their nature** (动静皆得其性)—\nthis is the **supreme stillness** (静之至).\nStillness **establishes Heaven and Earth** (能立天地),\n**generates all things** (生万物),\n**spontaneously and naturally** (自然而然).\"\n\n**Yi Yin** (伊尹) said:\n*\"Supreme stillness **does not know how it generates** (不知所以生).*\n**Heaven and Earth’s Dao/Way is subtle** (浸), so **yin and yang prevail** (阴阳胜).\n*The Transmission* says:\n*\"**Subtle** (浸) is **refined** (微).*\n**Heaven and Earth’s Dao/Way** is **embodied yet applied subtly** (体着而用微),\n**adapting and transforming** (变通) to **return to the norm** (归于正)—\nthis is the **gradual refinement of subtlety** (微之渐).\"\n\n**Gradual refinement of subtlety** (微渐) allows **yin and yang to be distinguished** (分阴阳),\n**to complete the four seasons** (成四时).\nThis is **ultimate strength and ultimate compliance** (至刚至顺).\n**Yin and yang** propel each other,\nand **transformation proceeds in harmony** (变化顺).\n\n*The Transmission* says:\n*\"The Sage **adapts and transforms** (变化) in **harmony with yin and yang’s mechanisms** (顺阴阳之机).*\n**Heaven and Earth’s positions** are **naturally established** (自然),\nso the Sage **follows Nature’s spontaneity** (因自然而冥之),\n**harnesses its benefits** (利自然而用之),\nand **nothing escapes Nature’s Dao/Way** (莫不得自然之道).\n\nThus, the Sage **knows Nature’s Dao/Way is unalterable** (不可违),\nand **controls it accordingly** (因而制之).\nThe annotation is **already made above** (注在文上).\n\n**Supreme stillness** (至静) **transcends all measure and reckoning** (律历所不能契).\n*The Transmission* says:\n*\"The Dao/Way’s **supreme stillness** (至静), though **measured and regulated** (律历) may **follow and control** (因而制之),\n**cannot conform to its inner essence** (不能叶其中)—\nthis is the **beastly ignorance** (鸟兽之谓).*\n\nHere are **wondrous instruments** (奇器),\nwhich **generate all phenomena** (是生万象).\n**The Eight Trigrams and the Heavenly Stems-Earthly Branches** (八卦甲子) hold **divine mechanisms and mysterious concealments** (神机鬼藏).\n*The Transmission* says:\n*\"The **Eight Trigrams’ shifting transformations** (八卦变异之伎) **emanate from this** (从是而生).\nAbove, it **manifests all phenomena** (则万象),\nbelow, it **encompasses all mechanisms** (则万机).\nUse the **Eight Trigrams to embody Heaven** (体天),\nuse the **Nine Categories** (九畴) to **model Earth** (法地).\n**Correlate them with climate and qi** (参之以气候),\n**thread them with Heavenly Stems-Earthly Branches** (贯之以甲子),\n**penetrate them with divine mechanisms** (达之以神机),\n**conceal them in guileful strategies** (闭之以诡藏)—\n**the wondrous and deceptive sway of Nature** (奇谲之荡自然).\n\nThe **art of yin and yang’s mutual overcoming** (阴阳相胜之术)\nis **clearly expressed in the symbols** (昭昭乎进乎象).\n*The Transmission* says:\n*\"The **art of yin and yang’s mutual overcoming** (阴阳相胜之术)\n**consistently operates subtly yet never deviates from its root** (恒微而不违乎本).\n**Clarity’s truth is trustworthy** (明之信可明),\nso it **penetrates the refined and luminous symbols** (能通乎精曜象矣).\"»",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "阴符经           （旧题）黄帝 撰 观天之道，执天之行，尽矣。 天有五贼，见之者昌。 五贼在心，施行于天，宇宙在乎手，万物生乎身。 天性，人也； 人心，机也； 立天之道以定人也。 天发杀机，斗转星移； 地发杀机，龙蛇起陆； 人发杀机，天地反覆； 天人合发，万化定基。 性有巧拙，可以伏藏。 九窍之邪，在乎三要。 可以动静。 火生于木，祸发必 克，奸生于国，时动必溃； 知之修练，谓之圣人。 天地万物之盗； 万物人之盗； 人万物之盗也。 三盗既宜，三才既安。 故曰：食其时，百骸理； 动其机，万化安。 人知其神而神，不知其不神之所以神。 日月有数，大小有定，圣功生焉，神明出焉。 其盗机也，天下莫不能见，莫不能知。 君子得之固躬，小人得之轻命。 瞽者善听，聋者善视。 绝利一源，用师十倍； 三反昼夜，用师万倍。 心生于物，死于物，机在目。 天之无恩而恩生，迅雷烈风，莫不蠢然。 至乐性余，至静则廉。 天之至私，用之至公。 命之制在气。 死者生之根，生者死之根。 恩生于害，害于恩。 愚人以天地文理圣，我以时物文理哲。 黄帝阴符经注 [唐]　李筌",
      "translated_text": "**Yin Fu Jing** *(Attributed to the Yellow Emperor)*\n\nObserve the Dao of Heaven, grasp its operations—exhausted is the task.\nHeaven has five thieves; those who perceive them flourish.\nThe five thieves dwell within the heart, manifesting in Heaven’s workings;\nthe cosmos lies in the hand, all things spring from the body.\n\nHeaven’s nature is humanity; humanity’s heart is the mechanism;\nestablish Heaven’s Dao to govern humanity.\n\nWhen Heaven unleashes its killing intent, stars shift in their courses;\nwhen Earth unleashes its killing intent, dragons and serpents rise from the land;\nwhen humanity unleashes its killing intent, Heaven and Earth invert;\nwhen Heaven, Earth, and humanity unite in intent, the foundation of ten thousand transformations is set.\n\nNature has skill and clumsiness, which may be concealed.\nThe nine orifices’ malice lies in the three vital passages—\nmovement and stillness are within reach.\n\nFire arises from wood; when calamity strikes, it conquers;\ndeceit arises in the realm; when its time comes, it collapses.\nTo know this and refine it—this is called the Sage.\n\nHeaven, Earth, and all things are thieves;\nall things are humanity’s thieves;\nhumanity is the thief of all things.\n\nThe three thieves harmonized, the Three Powers secure.\nThus it is said:\nEat in season, and the hundred bones align;\nstir the mechanism, and all transformations rest.\n\nHumanity knows its spirit as spirit, yet does not know\nhow the unspiritual becomes spirit.\n\nSun and moon have their numbers, great and small have their limits—\nfrom this, the Sage’s work arises, and divine clarity emerges.\n\nIts thieving mechanism—none under Heaven cannot see it,\nnone under Heaven cannot know it.\nThe noble one who attains it preserves himself;\nthe petty one who attains it risks his life.\n\nThe blind excel in hearing, the deaf in sight.\nSever one source of profit, and tenfold troops are needed;\nthree reversals of day and night, and ten thousand troops are needed.\n\nThe heart is born from things, dies from things—the mechanism lies in the eyes.\nHeaven, though without favor, gives rise to favor;\nswift thunder and fierce winds—all respond in blind obedience.\n\nSupreme joy leaves excess, supreme stillness is austere.\nHeaven’s utmost selfishness becomes the utmost public good.\nLife’s decree rests in *qi*.\n\nThe dead are the root of the living; the living, the root of the dead.\nFavor arises from harm, harm from favor.\n\nThe foolish take Heaven’s patterns as sacred wisdom;\nI take the timing of things as the philosopher’s pattern.\n\n**Commentary on the *Yin Fu Jing*** *(Tang Dynasty)* — **Li Quan**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 471,
      "start_sentence": 0,
      "end_sentence": 38,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 6.51889443397522,
      "metadata": {
        "source_file": "dao\\藏外\\黄帝阴符经注（唐李筌）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "神仙抱一演道章 观天之道，执天之行，尽矣。 故天有五贼，见之者昌。 注：黄帝得贼命之机，白日上升。 殷周得贼神之验，以小灭大。 管仲得贼时之信，九合诸侯。 范蠡得贼物之急，而霸南越。 张良得贼功之恩，而败强楚。 五贼在心，施行于天。 宇宙在乎手，万化生乎身。 注：人因五味而生、五味而死。 五味各有所主，顺之则相生，逆之则相胜。 久之则积气熏蒸、人腐五脏，殆至灭亡。 后人所以不能终其天年者，以其生生之厚矣。 是以至道淡然，胎息无味。 神仙之术百数，其要在抱一守中。 少女之术百数，其要在还精采气。 金丹之数百数，其要在神水华池。 治国之术百数，其要在清静自化。 用兵之术百数，其要在奇正权谋。 此五事者，卷之藏于心、隐于神； 施之弥于天、给于地。 宇宙瞬息，可在人之手； 万物荣枯，可生人之身。 黄帝得之，先固三宫，后治万国，鼎成而驭龙上升于天也。 天性，人也； 人心，机也。 立天之道，以定人也。 天发杀机，移星易宿； 地发杀机，龙蛇起陆； 人发杀机，天地反覆。 天人合发，万变定基。 注：大荒大乱，兵水旱蝗，是天杀机也。 虞舜陶甄，夏禹拯骸，殷系夏台，周囚羑里，汉祖亭长，魏武乞丐，俱非王者之位，乘天杀之机也，起陆而帝。 君子在野，小人在位，权臣擅威，百姓思乱，人杀机也。 成汤放桀，周武伐纣，项籍斩嬴婴，魏废刘协，是乘人杀之机也。 覆贵为贱，反贱为贵，有若天地反覆，天人之机合发，成败之理宜然。 万变千化，圣人因之而定基业也。 性有巧拙，可以伏藏。 注：中欲不出，谓之启； 外邪不入，谓之闭。 内启，是其机也。 难知如阴，不动如山。 巧拙之性，使人无闲而得窥也。 九窍之邪，在乎三要，可以动静。 注：两叶掩目，不见泰山； 双豆塞耳，不闻雷霆； 一椒掠舌，不能立言。 九窍皆邪，不足以察机变。 其在三者，神心志也。 机动未朕，神以随之。 机兆将成，心以图之。 机发事行，志以断之。 其机动也，与阳同其波。 五岳不能镇其隅，四渎不能界其维。 其机静也，与阴同其德。 智士不能运其荣，深间不能窥其谋，天地不能夺其时，而况于人乎！ 火生于木，祸发必克； 奸生于国，时动必溃。 知之修炼，谓之圣人。 注：火生于木，火发而木焚； 奸生于国，奸成而国灭。 木中藏火，火始于无形，国中藏奸，奸始于无象。 非至圣不能修身炼行，使奸火之不发。 夫国有无军之兵，无灾之祸矣。 以箕子逃而缚裘牧，商容囚而蹇叔哭。 富国安民演法章 天生天杀，道之理也。 天地，万物之盗； 万物，人之盗； 人，万物之盗。 三盗既宜，三才既安。 注：天地与万物生成，盗万物以衰老； 万物与人之服御，盗人以骄奢； 人与万物之上器，盗万物以毁败。 皆自然而往。 三盗各得其宜，三才递安其任。 故曰：食其时，百骸理； 动其机，万化安。 人知其神之神，不知不神之所以神。 注：人皆有圣，人不贵圣人之愚。 既睹其圣，又察其愚，复睹其圣。 故《书》曰：专用聪明，则事不成； 专用晦昧，则事皆悖。 一明一晦，众之所载。 伊尹酒保，太公屠牛，管仲作革，百里奚卖粥，当衰乱之时，人皆谓之不神。 及乎逢成汤，遭文王，遇齐桓，值秦穆，道济生灵，功格宇宙，人皆谓之至神。",
      "translated_text": "**The Chapter on the Daoist Immortals Embracing Unity**\n\nObserve the Dao of Heaven, grasp its practice—this is all.\nThus Heaven has five *accomplices* (贼), and those who perceive them flourish.\n\n*Annotation*: The Yellow Emperor discerned the *accomplices’* timing (机), ascending in broad daylight.\nThe Shang and Zhou dynasties grasped the *accomplices’* divine verification (验), using the lesser to subdue the greater.\nGuan Zhong understood the *accomplices’* temporal trust (信), uniting the feudal lords nine times.\nFan Li seized the *accomplices’* urgency of affairs (物), conquering the South.\nZhang Liang obtained the *accomplices’* merit of favor (功), defeating mighty Chu.\n\nThe five *accomplices* reside in the heart, manifesting in Heaven.\nThe cosmos lies within the grasp; ten thousand transformations arise from the body.\n\n*Annotation*: Man lives by the five flavors, dies by the five flavors.\nEach flavor has its master—harmonizing them brings life, opposing them brings destruction.\nProlonged indulgence accumulates *qi* that corrupts the five viscera, nearing annihilation.\nThus mortals cannot complete their natural lifespan—because their indulgence in life is excessive.\n\nHence, the Supreme Dao is insipid, embryonic breathing without taste.\nThe arts of the immortals number a hundred, yet their essence lies in embracing unity and holding the center.\nThe arts of the maiden number a hundred, yet their essence lies in returning essence and refining *qi*.\nThe arts of the Golden Elixir number a hundred, yet their essence lies in divine water and the Flowering Pool.\nThe arts of governance number a hundred, yet their essence lies in purity and self-transformation.\nThe arts of war number a hundred, yet their essence lies in stratagem and counter-stratagem.\n\nThese five arts—when rolled up, are hidden in the heart, concealed in the spirit;\nwhen applied, they pervade Heaven, nourish Earth.\nThe cosmos in an instant lies within human grasp;\nthe flourishing and withering of all things arise from the body.\n\nThe Yellow Emperor attained this, first securing the Three Palaces, then governing the myriad lands—\nwhen the tripod was complete, he rode the dragon and ascended to Heaven.\n\nHeaven’s nature is humanity; humanity’s heart is the mechanism.\nEstablish the Dao of Heaven to determine humanity.\nWhen Heaven unleashes its killing mechanism, stars shift their lodges;\nwhen Earth unleashes its killing mechanism, dragons and serpents rise from the land;\nwhen humanity unleashes its killing mechanism, Heaven and Earth reverse.\nWhen Heaven and humanity unleash together, the foundation of ten thousand changes is set.\n\n*Annotation*: Great chaos and disorder, war, flood, drought, and locusts—these are Heaven’s killing mechanisms.\nYu the Great and Shun tilled the fields, Yu of Xia rescued the drowned, the Shang dynasty imprisoned the Xia on Tai, the Zhou imprisoned the Shang at Youli, the Han founder was a market warden, and Wei Wu was a beggar—\nall were not born to royal station, yet they seized Heaven’s killing mechanism and rose from obscurity to rule.\n\nThe virtuous man lingers in the wilds, the petty man holds office, powerful ministers wield authority, and the people yearn for chaos—\nthis is humanity’s killing mechanism.\nTang overthrew Jie, Wu of Zhou attacked Zhou, Xiang Yu beheaded the infant Hujia, and Cao Wei deposed Emperor Xian—\nthese were seizing humanity’s killing mechanism.\n\nTo overturn nobility into lowliness, to reverse lowliness into nobility—\nthis is like Heaven and Earth reversing.\nWhen Heaven and humanity’s mechanisms unite, the logic of success and failure is inevitable.\nTen thousand changes, a thousand transformations—\nthe sage follows them to establish his foundation.\n\nSkill and clumsiness in nature can be concealed.\n\n*Annotation*: When inner desire does not emerge, it is called *opening* (启);\nwhen external evils do not enter, it is called *closing* (闭).\nInner opening is its mechanism.\nMysterious as *yin*, unmoving as a mountain—\nthe nature of skill and clumsiness makes it impossible for the idle to glimpse.\n\nThe nine orifices’ evils lie in the three essentials, which can be moved or stilled.\n\n*Annotation*: Two leaves covering the eyes cannot see Tai Mountain;\ntwo beans blocking the ears cannot hear thunder;\na single pepper touching the tongue cannot speak.\nIf all nine orifices are corrupted, they are insufficient to discern changes.\nYet in the three essentials—spirit, heart, will—\nwhen the mechanism stirs but has not yet manifested, the spirit follows it.\nWhen the mechanism portends completion, the heart plots it.\nWhen the mechanism erupts and action follows, the will decides it.\n\nWhen the mechanism stirs, it moves with the vigor of *yang*.\nThe Five Peaks cannot steady its corners, the Four Seas cannot bind its threads.\nWhen the mechanism is still, it aligns with the virtue of *yin*.\nThe wise cannot manipulate its glory, deep spies cannot fathom its schemes,\nHeaven and Earth cannot seize its timing—what then of mortals?\n\nFire arises from wood; when disaster strikes, it conquers.\nTreachery arises from the state; when the time comes, it collapses.\nTo refine this knowledge is to be a sage.\n\n*Annotation*: Fire arises from wood—when fire erupts, wood burns;\ntreachery arises from the state—when treachery matures, the state falls.\nWood harbors fire unseen, fire begins in formlessness;\nthe state harbors treachery unseen, treachery begins without sign.\nOnly the most sagely cannot refine body and conduct to prevent the treacherous fire from igniting.\nThus the state has no armies without soldiers, no calamities without cause.\n\nWith Ji Zi fleeing and bound in deerskin, Shang Rong imprisoned while Sheng Shu wept—\nthe chapter on enriching the state and securing the people.\n\nHeaven’s creation and Heaven’s destruction are the Dao’s principle.\nHeaven and Earth are thieves of the myriad things;\nthe myriad things are thieves of humanity;\nhumanity is thief of the myriad things.\nThe three thieves each have their due, the Three Powers each their place.\n\n*Annotation*: Heaven and Earth, in generating the myriad things, steal their vigor and decay;\nthe myriad things, in serving humanity, steal humanity’s arrogance and excess;\nhumanity, in mastering the myriad things, steals their destruction.\nAll proceed naturally.\nWhen the three thieves act rightly, the Three Powers fulfill their roles in turn.\n\nThus it is said:\nEat in season, and the hundred limbs harmonize;\nstir the mechanism, and the ten thousand transformations settle.\nHumanity knows the spirit’s spirit, yet does not know how the unmanifest spirit manifests.\n\n*Annotation*: All have sainthood, yet none value the sage’s folly.\nHaving seen their sainthood, then perceived their folly, then seen their sainthood again—\nthus the *Book of Documents* says:\nExclusive reliance on cleverness brings failure;\nexclusive reliance on obscurity brings contradiction.\nOne clarity, one obscurity—this is what the multitude bears.\n\nYi Yin was a tavern keeper, Tai Gong a butcher, Guan Zhong a leatherworker, Bai Li a soup vendor—\nin times of decline, all were deemed unremarkable.\nYet when they met Tang, met Wen Wang, served Duke Huan, or served Duke Mu,\ntheir Dao saved the living, their deeds shaped the cosmos—\nand all were deemed supremely extraordinary.",
      "overlap_context": "ift thunder and fierce winds—all respond in blind obedience.\n\nSupreme joy leaves excess, supreme stillness is austere.\nHeaven’s utmost selfishness becomes the utmost public good.\nLife’s decree rests in *qi*.\n\nThe dead are the root of the living; the living, the root of the dead.\nFavor arises from harm, harm from favor.\n\nThe foolish take Heaven’s patterns as sacred wisdom;\nI take the timing of things as the philosopher’s pattern.\n\n**Commentary on the *Yin Fu Jing*** *(Tang Dynasty)* — **Li Quan**",
      "start_char": 471,
      "end_char": 1748,
      "start_sentence": 39,
      "end_sentence": 125,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 19.19055962562561,
      "metadata": {
        "source_file": "dao\\藏外\\黄帝阴符经注（唐李筌）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "日月有数，大小有定； 圣功生焉，神明出焉。 其盗，机也。 天下莫能见，莫能知。 君子得之，固躬； 小人得之，轻命。 注：季主凌夷，天下莫见凌夷之机，而莫能知凌夷之源。 霸王开国之机，而莫能知开国之机，而莫能知开国之源。 君子得其机，应天顺人，乃固其躬。 小人得其机，烦兵黩武，乃轻其命。 《易》曰：君子见机而作，不俟终日。 又曰知机，其神乎。 机者易见而难知，见近知远。 强兵战胜演术章 瞽者善听，聋者善视。 绝利一源，用师十倍； 三反昼夜，用师万倍。 注：人之耳目，皆分于心而竟于神。 心分则机不精，神竟则机不微。 是以师旷熏目而聪耳，离朱漆耳而明目。 任一源之利，而反用师于心，举事发机，十全成也。 退思三反，经昼历夜，思而后行，举事发机，万全成也。 心生于物，死于物； 机在于目。 注：为天下机者，莫近乎心目。 心能发见，目能见机。 秦始皇东游会稽，项羽目见其机，心生于物，谓项良曰：彼可取而代之。 晋师毕至于淮淝，苻坚曰：见其机，心死于物，谓苻融曰：彼强敌也，胡为少耶。 则知生死之心在乎物，成败之机见于目焉。 天之无恩而大恩生。 迅雷烈风，莫不蠢然。 注：天心无恩，万物有心，归恩于天。 至乐性余，至静性廉。 注：乐则奢余，静则贞廉。 性余则神浊，性廉则神清。 神者智之源，神清则智明。 智者心之府，智公则心平。 人莫鉴于流水，而鉴于澄水。 以其清且平，神清意平，乃能形物之情。 夫圣人者，不淫于至乐，不安于至静，能栖神静乐之间，谓之守中。 如此施利不能诱，声色不能荡； 辩士不能说，智者不能动，勇者不能惧。 见祸于重开之外，虑患于杳冥之内。 天且不违，而况于兵之诡道者哉。 天之至私，用之至公。 注：天道曲成万物，而不遗椿菌鹏鴳。 巨细修短，各得其所，至私也。 云行雨施，雷电霜霓，生杀之均，至公也。 圣人则天法地，养万民，察劳苦，至私也； 行正令，施法象，至公也。 孙武曰：视卒如爱子，可以俱死； 视卒如婴儿，可与之赴深溪。 爱而不能令，譬若骄子。 是故令之以文，齐之以武。 禽之制在气。 注：玄龟食蟒，鹯隼击鹄，黄腰啖虎，飞鼠断猿，蜍蛭哜鱼，狼犿啮鹤，余甘柔金，河车服之。 无穷化玉，雄黄变铁。 有不灰之木、浮水之石。 夫禽兽木石得其气，尚能以小制大，况英雄得其气，而不能净寰海而御宇宙也。 生者，死之根； 死者，生之根。 恩生于害，害生于恩。 注：谋生者，必先死而后生； 习死者，必先生而后死。 鹖冠子曰：不死不生，不断不成。 孙武曰：投之死地而后生，致之亡地而后存。 吴起曰：兵战之场，立尸之地，必死则生，幸生则死。 恩者，害之源； 害者，恩之源。 吴树恩於越而害生，周立害于殷而恩生。 死之与生也，恩之与害，相反纠缠也。 愚人以天地文理圣，我以时物文理哲。 注：景星见，黄龙下，翔凤至，醴泉出，嘉谷生，河不满溢，海不扬波。 日月薄蚀，五星失行，四时相错，昼冥宵光，山崩川涸，冬雷夏霜。 愚人以此天地文理为乱之机。 文思安安，光被四表，克明俊德，以亲九族，六府三事，无相夺伦，百谷用成，兆民用康。 昏主邪臣，法令不一，重赋苛政，上下相蒙，懿戚贵臣，骄奢淫纵，酣酒嗜音，峻宇雕墙，百姓流亡，思乱怨上。",
      "translated_text": "The sun and moon have their cycles, the great and small have their fixed measures;\nthus arise the sage’s deeds, thus emerge the divine’s luminosity.\n\nTheir theft—*it is the subtle mechanism*.\nNone beneath the heavens can see it, none can know it.\nThe **gentleman** who grasps it, steadies his own **Dao/Way**;\nthe **petty man** who grasps it, risks his life recklessly.\n\n*Annotation*: The **Lord of the Season** (Ji Zhōu) was humbled by the world, yet none saw the mechanism of his rise, nor knew its source.\nThe **Hegemons and Kings** (Bàwáng) opened their realms by this mechanism, yet none knew the mechanism of their rise, nor knew the source of their rise.\n\nThe **gentleman** who seizes this mechanism, acts in accordance with Heaven and aligns with humanity, thereby steadfastly preserving his own **Dao/Way**.\nThe **petty man** who seizes this mechanism, provokes war and indulges in martial folly, thereby lightly discarding his own life.\n\nThe *Book of Changes* (Yì) says:\nThe **gentleman** perceives the mechanism and acts accordingly—he does not wait for the day to end.\nIt also says: *He who knows the mechanism, his wisdom is divine*.\n\nThe mechanism—easy to perceive, yet difficult to grasp;\nnear at hand, yet distant in insight.\n**The chapter on \"Strong Armies and Strategic Triumph\"** (Qiángbīng Zhànshèng Yǎnshù):\nThe blind excel in hearing, the deaf excel in sight.\nSeize one source of advantage, and the army’s power multiplies tenfold;\nthree reversals of day and night, and the army’s power multiplies ten thousandfold.\n\n*Annotation*: Human ears and eyes are divided by the heart and completed by the spirit.\nWhen the heart is divided, the mechanism lacks precision;\nwhen the spirit is perfected, the mechanism becomes subtle.\nThus, Shī Kuàng (the blind musician) blinded his eyes yet sharpened his ears,\nand Lí Zhū (the sharp-sighted) sealed his ears yet clarified his vision.\nTo rely on one source of advantage while countering it within the heart,\nand to act upon circumstances, perceiving the mechanism—this ensures tenfold success.\nTo ponder three reversals, to experience day and night,\nand to think before acting—this ensures ten thousandfold success.\n\nThe heart is born from things, yet dies from things;\nthe mechanism lies in the eyes.\n\n*Annotation*: The most immediate mechanism in the world belongs to the heart and eyes.\nThe heart can perceive and reveal, the eyes can see the mechanism.\nWhen Qín Shǐhuáng (First Emperor of Qin) toured the east to Huàijī,\nXiàng Yǔ (Item羽) saw his mechanism and his heart was stirred by things,\ntelling Xiàng Liáng (项良): *\"He can be taken and replaced!\"*\nWhen the Jin army had fully assembled at Huái-È (淝水),\nChí Jiān (苻坚) said: *\"Seeing his mechanism, my heart dies from things,\"*\ntelling Chí Róng (苻融): *\"That is a mighty foe—why is his force so slight?\"*\nThus one knows that the heart’s life and death lie in things,\nand the mechanism of success and failure is revealed in the eyes.\n\nHeaven’s nature is without favor, yet great favor arises.\nSwift thunder and fierce winds—none escape their sway.\n\n*Annotation*: Heaven’s heart has no favor, yet all things have hearts,\nand they attribute favor to Heaven.\nExcessive joy leads to dissipation, excessive stillness to sternness.\n*Annotation*: Joy becomes extravagant, stillness becomes upright and restrained.\n\nDissipation dulls the spirit, sternness clarifies it.\nThe spirit is the source of wisdom—when the spirit is clear, wisdom shines.\nWisdom is the repository of the heart—when wisdom is just, the heart is balanced.\nNone can reflect in flowing water, yet all can reflect in still water.\nBecause it is clear and even, a clear spirit and tranquil intent\ncan then discern the emotions of things.\n\nThe **sage**, not indulging in supreme joy nor resting in supreme stillness,\ndwells between tranquil spirit and harmonious joy—this is called *guarding the middle* (shǔ zhōng).\nThus, benefits cannot seduce him, nor can music and beauty unsettle him;\neloquent speakers cannot persuade him, nor can clever men move him,\nnor can the bold intimidate him.\nHe foresees calamity beyond the heavy gates,\nand contemplates disaster within the distant void.\n\nHeaven will not oppose him, let alone the deceitful strategies of war.\n\nHeaven’s supreme partiality yields universal fairness.\n*Annotation*: The **Dao/Way** of Heaven nurtures all things without neglecting even the smallest—\nthe gnarled tree, the tiny worm, the great eagle, or the humble wild duck.\nGreat and small, long and short—each finds its place, the height of partiality.\nClouds move, rain falls, thunder and lightning, frost and dew—\nlife and death are meted out with equal measure, the height of fairness.\n\nThe **sage** follows Heaven and models Earth,\nnourishes the myriad people, and discerns their toil and suffering—\nthe height of partiality.\nHe issues righteous decrees and implements laws like symbols—\nthe height of fairness.\n\nSūn Wǔ (孙武) said:\n*\"View your soldiers as beloved children, and you can die together;\ntreat them like infants, and you can cross deep ravines with them.*\nLoving yet unable to command is like a spoiled child.\nThus, govern them with **virtue/power** and discipline them with force.\n\nThe art of capturing lies in **qi**.\n*Annotation*: The tortoise devours the python, the falcon strikes the crane,\nthe yellow weasel feasts on the tiger, the flying squirrel severs the monkey,\nthe toad and leech drain the fish, the wolf and dog bite the heron,\nthe *yǔrén* (余甘) tames gold with gentleness, and the *hèchē* (河车) harnesses its power.\nEndless transformations yield jade, and *xiónghuáng* (雄黄) changes into iron.\nThere are woods that do not burn and stones that float on water.\nWhen beasts, birds, trees, and stones obtain their **qi**, they can subdue the greater with the lesser—\nhow much more so when **Heroes** obtain their **qi**,\nand cannot then fail to purify the world and command the cosmos!\n\nLife is the root of death; death is the root of life.\nFavor arises from harm; harm arises from favor.\n\n*Annotation*: Those who scheme for life must first face death before attaining it;\nthose who practice death must first experience life before embracing it.\nThe *Mìguànzǐ* (鹖冠子) said:\n*\"Without death, there is no life; without separation, there is no completion.\"*\nSūn Wǔ said:\n*\"Drive him to the brink of death, and then he will live;\nbring him to the edge of destruction, and then he will survive.\"*\nWú Qǐ (吴起) said:\n*\"On the battlefield, where corpses stand—\nthose who must die will live, those who cling to life will die.\"*\nFavor is the source of harm; harm is the source of favor.\nWú Shù (吴树) bestowed favor upon Yuè (越), yet harm emerged;\nZhōu (周) established harm against Yīn (殷), yet favor arose.\nDeath and life, favor and harm—\nthey intertwine in opposition.\n\nFools attribute Heaven and Earth’s patterns to the **sage’s virtue/power**,\nwhile I discern the **wise’s virtue/power** in the patterns of time and things.\n\n*Annotation*: When auspicious stars appear, yellow dragons descend, phoenixes soar,\nsweet springs flow, fine grains grow, the rivers do not overflow nor the seas surge,\nthe sun and moon eclipse, the five stars stray, the seasons disorder,\nday turns to night and night to day, mountains collapse and rivers dry,\nthunder strikes in winter and frost falls in summer—\nfools take these as Heaven and Earth’s chaotic mechanisms.\n\nYet when **virtue/power** is tranquil and settled,\nits light reaches to the four quarters,\nand the **gentleman** of clear wisdom and refined **virtue/power**\ncan unite the nine clans.\nThe six ministries and three affairs are without conflict,\nall grains flourish, and the myriad people prosper.\nWhen a **foolish ruler** and **wicked ministers** prevail,\nlaws and decrees are inconsistent,\nheavy taxes and harsh governance blind both above and below,\nand the **noble and lowly** alike are deceived.\nNoble kin and favored ministers grow arrogant and extravagant,\nindulging in wine and music, towering halls and ornate walls,\nwhile the people scatter and flee,\nlonging for chaos and blaming the ruler above.",
      "overlap_context": "* says:\nExclusive reliance on cleverness brings failure;\nexclusive reliance on obscurity brings contradiction.\nOne clarity, one obscurity—this is what the multitude bears.\n\nYi Yin was a tavern keeper, Tai Gong a butcher, Guan Zhong a leatherworker, Bai Li a soup vendor—\nin times of decline, all were deemed unremarkable.\nYet when they met Tang, met Wen Wang, served Duke Huan, or served Duke Mu,\ntheir Dao saved the living, their deeds shaped the cosmos—\nand all were deemed supremely extraordinary.",
      "start_char": 1749,
      "end_char": 3038,
      "start_sentence": 126,
      "end_sentence": 202,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 23.732757568359375,
      "metadata": {
        "source_file": "dao\\藏外\\黄帝阴符经注（唐李筌）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "我以此时物文理为理乱之机也。 人以愚虞圣，我以不愚虞圣； 人以奇期圣，我以不奇期胜。 注：贤哲之心，深妙难测。 由巢之迹，人或窥之。 至于阴变无方，自机转而不穷之，智人岂虞之。 以迹度心，乃为愚者也。 故曰：“沉水入火，自取灭亡。 ”自然之道静，故天地万物生。 天地之道浸，故阴阳胜，阴阳相推，而变化顺矣。 ’是故，圣人知自然之道不可违，因而制之。 至静之道，律历所不能契。 爰有奇器，是生万象； 入封甲子，神机鬼藏。 阴阳相胜之术，昭昭乎进乎象矣！ 黄帝阴符经注 [唐]　张果 黄帝阴符经叙 《阴符》自黄帝有之，盖圣人体天用道之机也。 《经》曰：得机者万变而愈盛，以至于王； 失机者万变而愈衰，以至于亡。 厥后伊吕得其末分，犹足以拯生灵，况圣人乎？ 其文简，其义玄。 凡有先圣数家注解，互相隐显。 后学难精，虽有所主者，若登天无阶耳。 近代李筌，假托妖巫，妄为注述，徒参人事，殊紊至源。 不惭窥管之微，辄呈酌海之见。 使小人窃窥，自谓得天机也。 悲哉！ 臣固愚昧，尝谓不然。",
      "translated_text": "「I regard this moment’s **Dao/Way** and **qi** as the means by which **order and chaos** unfold.\n\nWhere others see **foolishness** as **sageliness**,\nI see **sageliness** in not being **foolish**;\nWhere others see **strangeness** as **sageliness**,\nI see **victory** in not being **strange**.\n\n*Note:* The hearts of the **virtuous and wise** are profound and wondrous, beyond measure.\nThe traces of **Yu the Nest-Dweller** are observed by some,\nYet when **yin** shifts without fixed pattern,\nWhen **self-moving mechanisms** turn endlessly without limit—\nHow could the **wise** ever be **deceived**?\nTo judge the heart by its traces is the act of a **fool**.\n\nThus it is said:\n*\"To sink in water or plunge into fire,\nIs to court one’s own destruction.\"*\n\nThe **Dao/Way** of **Nature** is tranquil,\nThus Heaven and Earth and all things **thrive**.\nThe **Dao/Way** of Heaven and Earth is **pervasive**,\nThus **yin** and **yang** prevail.\nWhen **yin** and **yang** mutually advance,\nTheir transformations follow **harmony**!\n\nTherefore, the **sage** knows that **Nature’s Dao/Way** cannot be defied,\nAnd so aligns with it to govern.\n\nThe **Dao/Way** of utter stillness\nIs beyond the reach of **laws** and **calendrical measurements**.\nYet there are **strange instruments**—\nThese give rise to the **ten thousand phenomena**.\nWithin the **sealed cycles of ganzhi** (天干地支),\n**divine mechanisms** and **hidden arts** are concealed.\nThe **techniques** of **yin** and **yang** prevailing\nAre clearly revealed through the **phenomena**!\n\n*The Yellow Emperor’s* **Yinfu Jing** *Commentary* [Tang] Zhang Guo\n*The Yellow Emperor’s* **Yinfu Jing** *Preface*\nThe **Yinfu** has existed since the Yellow Emperor,\nIndeed, the **sage** embodies the **Dao/Way**’s mechanisms in accordance with Heaven.\nThe *Classic* states:\n*\"Those who grasp the **mechanism** thrive through ten thousand changes and grow ever stronger,\nEven reaching the rank of **king**.\nThose who lose the **mechanism** decline through ten thousand changes and grow ever weaker,\nEven to the point of **ruin**.\"*\n\nLater, **Yi** and **Lu** (伊吕) obtained its **fading remnants**,\nYet still managed to rescue the **living beings**—\nWhat then of the **sage**?\n\nIts text is **concise**, its meaning **profound**.\nThough there are many **earlier sages** who annotated it,\nTheir interpretations **conceal** and **reveal** in turn.\nLater scholars struggle to master it,\nAnd even those who claim a preference\nAre like climbing to Heaven without a ladder.\n\nIn recent times, **Li Quan** (李筌)\nFalsely attributed his work to **demonic sorcerers**,\nAnd recklessly composed annotations,\nMerely drawing on human affairs,\nFar from **harmonizing** with the **source**’s essence.\nHe does not blush to peer into **insignificant traces**,\nYet boldly presents his **shallow insights** as profound.\nIf **lowly men** secretly glimpse them,\nThey would boast of having grasped Heaven’s **mechanisms**.\n\nAlas!\nThough I am **your humble servant** and **foolishly ignorant**,\nI have always believed otherwise.",
      "overlap_context": "nd three affairs are without conflict,\nall grains flourish, and the myriad people prosper.\nWhen a **foolish ruler** and **wicked ministers** prevail,\nlaws and decrees are inconsistent,\nheavy taxes and harsh governance blind both above and below,\nand the **noble and lowly** alike are deceived.\nNoble kin and favored ministers grow arrogant and extravagant,\nindulging in wine and music, towering halls and ornate walls,\nwhile the people scatter and flee,\nlonging for chaos and blaming the ruler above.",
      "start_char": 3038,
      "end_char": 3465,
      "start_sentence": 203,
      "end_sentence": 232,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 9.406463623046875,
      "metadata": {
        "source_file": "dao\\藏外\\黄帝阴符经注（唐李筌）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "朝愿闻道，夕死无悔。 偶于道经藏中得《阴符传》，不知何代人制也。 词理玄邈，如契自然。 臣遂编之，附而入注。 冀将来之君子，不失道旨。 黄帝阴符经 经曰：观天之道，执天之行，尽矣。 观自然之道，无所观也。 不观之以目，而观之以心。 心深微而无所不见，故能照自然之性。 性惟深微而能照，其斯谓之“阴”。 执自然之行，无所执也。 故不执之以手，而执之以机。 机变通而无所系，故能契自然之理。 夫惟变通而能契，斯谓之“符”。 照之以心，契之以机，而“阴符”之义尽矣。 李筌以“阴”为“暗”，“符”为“合”，以此文为序首，何昧之至也。 故天有五贼，见之者昌。 五贼者，命、物、时、功、神也。 传曰：圣人之理，图大而不顾其细，体瑜而不掩其瑕。 故居夷则遵道布德以化之，履险则用权发机以拯之。 务在匡天地，谋在济人伦。 于是用大义除天下之害，用大仁兴天下之利，用至正措天下之枉，用至公平天下之私，故反经合道之谋，其名有五，圣人禅之，乃谓之贼； 天下赖之，则谓之德。 故贼天之命，人知其天而不知其贼，黄帝所以代炎帝也。 贼天之物，人知其天而不知其贼，帝尧所以代帝挚也。 贼天之时，人知其天而不知其贼，帝舜所以代帝尧也。 贼天之功，人知其天而不知其贼，大禹所以代帝舜也。 贼天之神，人知其天而不知其贼，殷汤所以革夏命也。 周武所以革殷命也。 故见之者昌，自然而昌也。 太公以贼命为用味，以取其喻也。 李筌不悟，以黄帝贼少女之命，白日上腾为非也。 五贼在乎心，施行在乎天； 宇宙在乎手，万化生乎身。 《传》曰：其立德明，其用机妙，发之于内，见之于外而已矣。 岂称兵革以作寇乱哉？ 见其机而执之，虽宇宙之大，不离乎掌握，况其小者乎？ 知其神而体之，虽万物之众，不能出其胸臆，况其寡者乎？ 自然造化之力而我有之，不亦盛乎？ 不亦大乎？ 李筌等以五贼为五味，顺之可以神仙不死。 诬道之甚也。 天性，人也； 人心，机也。 立天之道以定人也。 《传》曰：人谓天性，机谓人心。 人性本自玄合，故圣人能体五贼也。 天发杀机，龙蛇起陆； 人发杀机，天地反复。 《传》曰：天机张而不生，天机驰而不死。 天有驰张，用有否臧。 张则杀威行，驰则杀威亡。 人之机亦然。 天以气为威，人以德为机。 秋冬阴气严凝，天之张杀机也，故龙蛇畏而蛰伏。 冬谢春来，阴退阳长，天之驰杀机也，故龙蛇悦而振起。 天有寒暄，德亦有寒暄。 德刑整肃，君之张杀机也，故以下畏而服从。 德失刑偏，君之驰杀机也，故奸雄悦而驰骋。 位有尊卑，象乎天地，故曰：天发杀机，龙蛇起陆，寇乱所由作； 人发杀机，天地反复，尊卑由是革也。 太公、诸葛亮等以杀人过万，大风暴起，昼若暝。 以为天地反复，其失甚矣。 天人合德，万变定基。 《传》曰：天以祸福之机运于上，君以利害之机动于下，故有德者万变而愈盛，以至于王； 无德者万化而愈衰，以至于亡。 故曰天人合德，万变定基。 自然而然也。 性有巧拙，可以伏藏 《传》曰：圣人之性，巧于用智，拙于用力。 居穷行险，则谋道以济之； 对强与明，则伏义以退避之。 理国必以是，用师亦以是。 九窍之邪，在乎三要，可以动静",
      "translated_text": "The morning I wished to hear the **Dao/Way**, and the evening I would die without regret.\nBy chance, in the **藏外** *(outer Daoist canon)*, I obtained *The Yinyu Transmission* (*Yinyu zhuàn*), unknown whose era it came from.\n\nIts words and logic are **profound and boundless** (玄邈),\nLike **sealing** (契) the **nature of the Way** (自然).\nThus I compiled it and appended my own annotations,\nHoping that future **virtuous men** (君子) would not lose the **Dao/Way’s essence** (道旨).\n\nThe **Yellow Emperor’s Yinyu Scripture** (黄帝阴符经) states:\n*\"To observe the **Dao/Way** of Heaven, to grasp Heaven’s actions—this suffices.\nTo observe the **Dao/Way** of Nature—there is nothing to observe.\nOne does not observe it with the eyes, but with the heart.\nThe heart is deep and subtle, yet sees nothing it cannot perceive,\nThus it can illuminate Nature’s **virtue/power** (性).\nThis **virtue/power** (性) is deep and subtle yet able to illuminate—\nThis is what is called ‘**Yin**’ (阴).\n\nTo grasp Nature’s actions—there is nothing to grasp.\nThus one does not grasp it with the hands, but with **mechanisms** (机).\n**Mechanisms** (机) are flexible and unrestricted, yet can **seal** (契) Nature’s **principles** (理).\nOnly when flexible and able to **seal**—\nThis is what is called ‘**Fu**’ (符).\nTo illuminate with the heart, to **seal** with **mechanisms**—\nThus the meaning of ‘**Yinyu**’ (阴符) is complete.*\n\nLi Quan took **Yin** (阴) as ‘**darkness**’ (暗),\nAnd **Fu** (符) as ‘**harmonization**’ (合),\nUsing this text as a preface—\nHow **blind** (昧) his understanding was!\n\nThus Heaven has **five thieves** (五贼), and those who see them prosper.\nThe **five thieves** (五贼) are: **fate** (命), **phenomena** (物), **timing** (时), **achievement** (功), and **spirit** (神).\n\nThe *Transmission* (传) says:\n*\"The **Dao/Way** of the **Sage** (圣人) is vast yet does not neglect the minute,\nAnd refined yet does not conceal its flaws.\nThus, when dwelling in peace, they follow the **Dao/Way** and manifest **virtue/power** (德) to transform it,\nAnd when encountering peril, they employ **strategic means** (权) and unleash **mechanisms** (机) to rescue it.\nTheir purpose is to rectify Heaven and Earth,\nTheir plan is to benefit all mankind.\nThus, using **great righteousness** (大义) to eliminate harm in the world,\nUsing **great benevolence** (大仁) to promote benefit in the world,\nUsing **ultimate correctness** (至正) to redress injustice in the world,\nUsing **absolute impartiality** (至公) to curb private interests in the world—\nThe schemes that **invert scripture yet harmonize the Dao/Way** (反经合道) have five names,\nWhich the **Sage** (圣人) **transmutes** (禅) and calls ‘**thieves**’ (贼).\nYet the world relies on them—\nThen they are called **virtue/power** (德).\nThus, the **thief** of **fate** (命) is such that people know of Heaven yet not its **thief**,\nHence the Yellow Emperor replaced the Flame Emperor.\nThe **thief** of **phenomena** (物) is such that people know of Heaven yet not its **thief**,\nHence Emperor Yao replaced Emperor Zhi.\nThe **thief** of **timing** (时) is such that people know of Heaven yet not its **thief**,\nHence Emperor Shun replaced Emperor Yao.\nThe **thief** of **achievement** (功) is such that people know of Heaven yet not its **thief**,\nHence Great Yu replaced Emperor Shun.\nThe **thief** of **spirit** (神) is such that people know of Heaven yet not its **thief**,\nHence Tang of the Shang overthrew the Xia dynasty.\nKing Wu of the Zhou overthrew the Shang dynasty.\nThus, those who see them prosper—\nThis is the natural way of prospering.\nThe Duke of Zhou took the **thief** of **fate** (命) as **strategic means** (用味),\nUsing it as an allegory.\nLi Quan did not comprehend—\nHe took the Yellow Emperor’s **thief** of the **fate** (命) of a maiden\nAnd the daytime ascent of a vapor as wrongdoing.\nThe **five thieves** (五贼) lie within the heart,\nTheir application lies in Heaven;\nThe universe lies within the hands,\nAnd ten thousand transformations arise from the body.\nThe *Transmission* (传) says:\n*'The establishment of **virtue/power** (德) is clear,\nThe use of **mechanisms** (机) is subtle.\nWhen unleashed from within, it is seen without—this is all.*\nHow could it mean **wielding arms to create banditry and chaos** (称兵革以作寇乱)?\nTo see its **mechanisms** (机) and grasp them,\nEven if the universe is vast,\nIt does not depart from the **palm and fingers** (掌握),\nMuch less its smaller aspects!\nTo know its **spirit** (神) and embody it,\nEven if myriad things abound,\nThey cannot escape one’s **chest and mind** (胸臆),\nMuch less their fewness!\nNature’s **creative transformations** (造化) and their **force** (力) belong to me—\nIs this not **grand** (盛)?\nIs this not **great** (大)?\nLi Quan and others took the **five thieves** (五贼) as the **five flavors** (五味),\nSaying that following them leads to **immortality** (神仙) and **non-death** (不死).\nThis is the **most egregious distortion** (诬) of the **Dao/Way**!\n\nHeaven’s **nature** (性) is **humanity** (人),\nAnd the **human heart** (人心) is **mechanisms** (机).\nTo establish the **Dao/Way** of Heaven is to **settle** (定) **humanity** (人).\nThe *Transmission* (传) says:\n*'**Humanity** (人) refers to Heaven’s **nature** (性),\n**Mechanisms** (机) refer to the human heart.'*\n**Human nature** (人性) is originally **profound and naturally harmonious** (玄合),\nThus the **Sage** (圣人) can embody the **five thieves** (五贼).\n\nWhen Heaven unleashes the **killing mechanism** (杀机), dragons and serpents rise from the land;\nWhen **humanity** (人) unleashes the **killing mechanism** (杀机), Heaven and Earth **reverse and shift** (反复).\nThe *Transmission* (传) says:\n*'Heaven’s **mechanisms** (机) expand yet do not produce life,\nHeaven’s **mechanisms** (机) relax yet do not cause death.\nHeaven has **expansion and relaxation** (驰张), its use has **flaws and virtues** (否臧).\nWhen expanded, the **killing mechanism** (杀威) takes action;\nWhen relaxed, the **killing mechanism** (杀威) vanishes.\nThe **mechanisms** (机) of **humanity** (人) are likewise.\nHeaven uses **qi** (气) as its **威** (威),\nAnd **humanity** (人) uses **virtue/power** (德) as its **mechanisms** (机).\nIn autumn and winter, the **Yin qi** (阴气) is severe and congealed—\nThis is Heaven’s **expanded killing mechanism** (张杀机),\nThus dragons and serpents fear and **hibernate** (蛰伏).\nWhen winter passes and spring arrives, **Yin** retreats and **Yang** grows—\nThis is Heaven’s **relaxed killing mechanism** (驰杀机),\nThus dragons and serpents rejoice and **awaken** (振起).\nHeaven has **cold and warmth** (寒暄),\nAnd **virtue/power** (德) also has **cold and warmth** (寒暄).\nWhen **virtue/power** (德) and **punishments** (刑) are strict and orderly,\nThis is the ruler’s **expanded killing mechanism** (张杀机),\nThus the lowly fear and submit.\nWhen **virtue/power** (德) and **punishments** (刑) are **imbalanced** (偏),\nThis is the ruler’s **relaxed killing mechanism** (驰杀机),\nThus the wicked rejoice and **run wild** (驰骋).\nRank has **high and low** (尊卑), mirroring Heaven and Earth,\nThus it is said:\n*\"When Heaven unleashes the **killing mechanism** (杀机), dragons and serpents rise from the land,\nAnd banditry and chaos originate;\nWhen **humanity** (人) unleashes the **killing mechanism** (杀机), Heaven and Earth **reverse and shift** (反复),\nAnd the **high and low** (尊卑) are thus **overthrown** (革).\"*\nThe Duke of Zhou, Zhuge Liang, and others,\nWhen they **slaughtered thousands** (杀人过万),\nGreat winds and tempests arose, and the day darkened as night—\nThey took this as Heaven and Earth **reversing and shifting** (反复),\nBut their error was profound.\n\nHeaven and **humanity** (人) **harmonize virtue/power** (合德),\nAnd ten thousand transformations rest on a **foundation** (基).\nThe *Transmission* (传) says:\n*\"Heaven dispenses **mechanisms** (机) of calamity and fortune above,\nAnd the ruler moves **mechanisms** (机) of benefit and harm below.\nThus those with **virtue/power** (德) prosper through ten thousand transformations,\nAnd reach the heights of kingship;\nThose without **virtue/power** (德) decline through myriad changes,\nAnd meet their end in ruin.\nThus it is said: Heaven and **humanity** (人) **harmonize virtue/power** (合德),\nAnd ten thousand transformations rest on a **foundation** (基).\nThis is the **naturally so** (自然而然).\"*\n\n**Nature** (性) has **skill and clumsiness** (巧拙),\nWhich can be **concealed** (伏藏).\nThe *Transmission* (传) says:\n*\"The **nature** (性) of the **Sage** (圣人) is **skilled** in applying wisdom,\nYet **clumsy** in exerting strength.\nWhen in adversity or peril, they **plot with the Dao/Way** (谋道) to aid it;\nWhen facing the **strong and the clever** (强与明), they **conceal righteousness** (伏义) to retreat.\nThis is essential for **governing the state** (理国),\nAnd likewise for **employing military force** (用师).\nThe **evil** (邪) of the **nine orifices** (九窍) lies in the **three critical points** (三要),\nWhich can be **activated or stilled** (动静).\"*",
      "overlap_context": "\nFalsely attributed his work to **demonic sorcerers**,\nAnd recklessly composed annotations,\nMerely drawing on human affairs,\nFar from **harmonizing** with the **source**’s essence.\nHe does not blush to peer into **insignificant traces**,\nYet boldly presents his **shallow insights** as profound.\nIf **lowly men** secretly glimpse them,\nThey would boast of having grasped Heaven’s **mechanisms**.\n\nAlas!\nThough I am **your humble servant** and **foolishly ignorant**,\nI have always believed otherwise.",
      "start_char": 3465,
      "end_char": 4726,
      "start_sentence": 233,
      "end_sentence": 307,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 31.362219095230103,
      "metadata": {
        "source_file": "dao\\藏外\\黄帝阴符经注（唐李筌）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "《传》曰：九窍之用，三要为机。 三要者，机、情、性也。 机之则无不安； 情之则无不邪； 性之则无不正。 故圣人动以伏其情，静以常其性，乐以定其机。 小人反此，故下文云：太公为三要，为耳、目、口。 李筌为心，神、志，皆忘机也。 俱失《阴符》之正意。 火生于木，祸发必克； 奸生于国，时动必溃。 知之修炼，谓之圣人。 《传》曰：夫木性静，动而生火，不觉火盛，而焚其质。 由人之性静，动而生奸，不觉奸成而乱其国。 夫明者见彼之隙以设其机，智者知彼之病以圆其利，则天下之人，彼愚而我圣。 是以生者自谓得其生，死者自谓得其死，无为无不为，得道之理也。 天生天杀，道之理也。 天地，万物之盗； 万物，人之盗； 人，万物之盗。 三盗既宜，三才既安。 《传》曰：天地以阴阳之气化为万物，万物不知其盗。 万物以美恶之味飨人，人不知其盗。 人以利害之谟制万物，万物不知其盗。 三盗玄合于人心，三才静顺于天理。 有若时然后食，终身无不愈； 机然后动，庶类无不安。 食不得其时，动不得其机，殆至灭亡。 故曰食其时，百骸治； 动其机，万化安。 人知其神而神，不知其神所以神也。 《传》曰：时人不知其盗之为盗，只谓神之能神。 《鬼谷子》曰：彼此不觉谓之神。 盖用微之功着矣。 李筌不知此文意通三盗，别以圣人、愚人为喻，何甚谬也。 日月有数，大小有定，圣功生焉，神明出焉。 《传》曰：日月有准，运数也； 大小有定，君臣也。 观天之时，察人之事，执人之机，如是则圣得以功，神得以明。 心冥理合，安之善也。 筌以度数为日月，以余分为大小，以神气能生圣功神明，错谬之甚也。 其盗机也，天下莫能见，莫能知也。 君子得之固躬，小人得之轻命。 《传》曰：其盗微而动，所施甚明博，所行极玄妙。 君子用之，达则兼济天下，太公其人也。 穷则独善一身，夫子其人也。 岂非择利之能审乎？ 小人用之，则惑名而失其身，大夫种之谓欤？ 得利而亡义，李斯之谓欤？ 岂非信道之不笃焉？ 瞽者善听，聋者善视。 绝利一源，用师十倍。 三返昼夜，用师万倍。 《传》曰：瞽者善于听，忘色审声，所以致其聪。 聋者善于视，遗耳专目，所以致其明。 故能十众之功。 一昼之中三而行之，所以至也。 一夜之中三而思之，所以精也。 故能用万众之人。 李筌不知师是众，以为兵师，误也。 心生于物，死于物，机在于目。 《传》曰：心有爱恶之情，物有否臧之用。 目视而察之于外，心应而度之于内。 善则从而行之，否则违而止之，所以劝善而惩恶也。 筌以项羽昧机，心生于物； 以符坚见机，心死于物。 殊不知有否臧之用。 天之无恩而大恩生，迅雷烈风莫不蠢然。 《传》曰：天以凶象咎征见人，人能儆戒以修德。 地以迅雷烈风动人，人能恐惧以致福。 其无恩而生大恩之谓也。 李筌以天地不仁为大恩，以万物归于天为蠢然。 与《阴符》本意殊背。 www.taoismcn.com 至乐性余，至静性廉。 《传》曰：情未发谓之中，守中谓之常，则乐得其志而性有余矣。 性安常谓之自足，则静得其志而廉常足矣。 筌以奢为乐性，以廉为静，殊乖至道之意。 天之至私，用之至公。 《传》曰：自然之理，微而不可知，私之至也。",
      "translated_text": "*«The Transmission* says:\nThe **use** (用) of the **nine orifices** (九窍) lies in the **three critical points** (三要) as the **mechanism** (机).\nThe **three critical points** (三要) are **mechanism** (机), **emotions** (情), and **nature** (性).\nTo **govern** (则) **mechanism** (机) is to have all things **settled** (安);\nTo **govern** (则) **emotions** (情) is to have all things **perverse** (邪);\nTo **govern** (则) **nature** (性) is to have all things **upright** (正).\nThus, the **Sage** (圣人) **activates** (动) to **conceal emotions** (伏其情),\n**stills** (静) to **preserve nature** (常其性),\nAnd **delights** (乐) to **fix mechanism** (定其机).\nThe **petty man** (小人) does the opposite, hence the following passage:\n*\"Duke of Zhou* (太公) **established** (为) the **three critical points** (三要) as **ears, eyes, and mouth** (耳、目、口);\n*Li Qun* (李筌) **established** (为) the **heart, spirit, and will** (心、神、志), all **ignoring mechanism** (忘机).\nBoth **lost** (俱失) the **true meaning** (正意) of the *Yin Fu* (《阴符》).\n\nFire **arises** (生) from wood, yet **disaster** (祸) **strikes** (发) and must be **overcome** (克);\nTreachery **arises** (生) from the state, yet **opportunity** (时) **strikes** (动) and must be **exploited** (溃).\nTo **know** (知) this and **refine oneself** (修炼) is called being a **Sage** (圣人).\n*The Transmission* says:\n*\"Wood’s **nature** (性) is **still** (静),\nYet when it **moves** (动), fire **arises** (生).\nIf one does not **perceive** (觉) the fire’s **flourishing** (盛),\nIt will **burn** (焚) its own essence.\nSimilarly, **human nature** (人之性) is **still** (静),\nYet when it **moves** (动), treachery **arises** (生).\nIf one does not **perceive** (觉) treachery’s **completion** (成),\nIt will **disrupt** (乱) the state.\n\nThe **clear-sighted** (明者) see **others’ weaknesses** (彼之隙) to **set their mechanism** (设其机),\nThe **wise** (智者) know **others’ flaws** (彼之病) to **harness advantage** (圆其利),\nThen the people of the world—**they** (彼) are **foolish** (愚), **I** (我) am **Sage** (圣).\nThus, the **living** (生者) claim to have **secured life** (得其生),\nAnd the **dead** (死者) claim to have **secured death** (得其死).\n**Non-action** (无为) yet **nothing is left undone** (无不为),\nThis is the **principle** (理) of **attaining the Dao/Way** (得道).\n\n**Heaven’s creation and destruction** (天生天杀) is the **principle** (理) of the Dao/Way (道).\nHeaven and Earth are the **thieves** (盗) of **ten thousand transformations** (万物);\nTen thousand transformations are the **thieves** (盗) of **humanity** (人);\nHumanity is the **thief** (盗) of **ten thousand transformations** (万物).\nWhen the **three thieves** (三盗) are **properly aligned** (既宜),\nAnd the **Three Powers** (三才) are **settled** (既安).\n*The Transmission* says:\n*\"Heaven and Earth **transform** (化) **ten thousand things** (万物) through **yin-yang qi** (阴阳之气),\nYet **ten thousand things** (万物) do not **know** (知) their **theft** (盗).\n**Ten thousand things** (万物) **nourish** (飨) **humanity** (人) with **good and evil flavors** (美恶之味),\nYet **humanity** (人) does not **know** (知) their **theft** (盗).\n**Humanity** (人) **controls** (制) **ten thousand things** (万物) with **advantage and harm** (利害之谟),\nYet **ten thousand things** (万物) do not **know** (知) their **theft** (盗).\nThe **three thieves** (三盗) **mysteriously unite** (玄合) in the **human heart** (人心),\nAnd the **Three Powers** (三才) **remain still and follow** (静顺) the **principle of Heaven** (天理).\n\n**Food** (食) is **obtained** (得) only at its **time** (时), yet **one’s body** (终身) **never fails to heal** (无不愈);\n**Mechanism** (机) is **activated** (动) only when **ready** (然后), yet **all things** (庶类) **never fail to settle** (无不安).\nIf **food** (食) is not **taken at its time** (得其时),\nOr **mechanism** (机) is not **activated when ready** (动其机),\nThen **ruin and extinction** (灭亡) are near.\nThus it is said:\n*\"To eat at its time, the hundred bones are **regulated** (治);\nTo move with mechanism, ten thousand transformations are **settled** (安).*\n\n**Humanity** (人) knows its **spirit** (神) and **spirit** (神) is **manifest** (神),\nYet does not know how **spirit** (神) **manifests** (所以神).\n*The Transmission* says:\n*\"The people of their time do not know that **theft** (盗) is **theft** (之为盗),\nOnly saying that **spirit** (神) can **manifest** (能神).\n*Ghost Valley Master* (《鬼谷子》) says:\n*\"When **both sides** (彼此) are **unaware** (不觉), it is called **spirit** (神).\nThis is the **refinement** (功) of **subtlety** (微) **achieved** (着矣).\nLi Qun did not understand this passage’s **unified meaning** (意通三盗),\nBut **separately** (别) used **Sage** (圣人) and **foolish man** (愚人) as **analogies** (喻),\nHow **erroneous** (谬) is this!\n\nThe **sun and moon** (日月) have **fixed measures** (数),\nAnd the **great and small** (大小) have **set distinctions** (定).\nFrom this, **Sage’s great deeds** (圣功) **arise** (生),\nAnd **spirit and clarity** (神明) **emerge** (出).\n*The Transmission* says:\n*\"The sun and moon have **fixed standards** (准), **cyclical movements** (运数);\nThe **great and small** (大小) have **set distinctions** (定), **ruler and subject** (君臣).\nTo **observe Heaven’s time** (观天之时),\nTo **examine humanity’s affairs** (察人之事),\nTo **grasp humanity’s mechanism** (执人之机),\nThen the **Sage** (圣) **achieves great deeds** (得以功),\nAnd **spirit and clarity** (神) **emerge** (得以明).\n\nWhen the **heart is tranquil** (心冥) and **principle is united** (理合),\nThis is the **best of stillness** (安之善).\nLi Qun **mistakenly took** (以) **calculating cycles** (度数) as the **sun and moon** (日月),\nAnd **remaining portions** (余分) as the **great and small** (大小),\nSaying that **spirit-qi** (神气) can **generate Sage’s great deeds** (生圣功) and **spirit and clarity** (神明),\nHow **greatly mistaken** (错谬) is this!\n\nAs for their **theft of mechanism** (盗机),\nNo one under Heaven can **see** (见) or **know** (知) it.\nThe **noble man** (君子) who **attains** (得) it **preserves himself** (固躬),\nThe **petty man** (小人) who **attains** (得) it **risks his life** (轻命).\n*The Transmission* says:\n*\"Their **theft** (盗) is **subtle** (微) yet **movement** (动) is **clear and broad** (甚明博),\nTheir **actions** (行) are **extremely mysterious** (极玄妙).\nThe **noble man** (君子) who **uses** (用) it—\nWhen **prosperous** (达), he **saves all under Heaven** (兼济天下), **Duke of Zhou** (太公) being such a one.\nWhen **impoverished** (穷), he **perfects himself alone** (独善一身), **Master Kong** (夫子) being such a one.\nIs this not the **ability to discern advantage** (择利) with **great precision** (审)?\n\nThe **petty man** (小人) who **uses** (用) it—\nThen he is **bewildered by fame** (惑名) and **loses himself** (失其身).\nIs this not **Zhong the Great Officer** (大夫种)?\nTo **gain advantage yet lose righteousness** (得利而亡义),\nIs this not **Li Si** (李斯)?\nIs this not the **failure to uphold the Dao/Way** (信道) with **sincerity** (笃)?\n\nThe **blind** (瞽者) are **good at hearing** (善听),\nThe **deaf** (聋者) are **good at seeing** (善视).\nTo **cut off advantage at its source** (绝利一源), **military force** (用师) is **tenfold** (十倍).\nTo **return three times** (三返) **day and night** (昼夜), **military force** (用师) is **ten thousand-fold** (万倍).\n*The Transmission* says:\n*\"The blind are **good at hearing** (善于听),\n**Forgotten** (忘) of **colors** (色) and **attentive** (审) to **sounds** (声),\nThus they **achieve great acuity** (致其聪).\nThe deaf are **good at seeing** (善于视),\n**Abandoning** (遗) **ears** (耳) and **fixing on eyes** (专目),\nThus they **achieve great clarity** (致其明).\nHence they can **perform the deeds of ten thousand troops** (能十众之功).\nTo **move three times** (三而行) within **one day** (一昼之中),\nThis is how they **reach** (所以至).\nTo **think three times** (三而思) within **one night** (一夜之中),\nThis is how they **refine** (所以精).\nThus they can **command ten thousand troops** (用万众之人).\nLi Qun did not know that **military force** (师) is **troops** (众),\nBut **mistakenly took** (以为) it as **military strategist** (兵师),\nThis is **error** (误).\n\nThe **heart** (心) **arises** (生) from **things** (物) and **dies** (死) from **things** (物),\nAnd **mechanism** (机) lies in the **eyes** (目).\n*The Transmission* says:\n*\"The heart has **love and hatred** (爱恶) **emotions** (之情),\n**Things** (物) have **flaws and merits** (否臧) **uses** (之用).\nThe **eyes** (目) **observe** (视) and **discern** (察) them **externally** (于外),\nThe **heart** (心) **responds** (应) and **judges** (度) them **internally** (于内).\nIf **good** (善), then **follow** (从) and **act** (行) upon it;\nIf **not** (否则), then **withdraw** (违) and **stop** (止).\nThis is how they **encourage virtue** (劝善) and **punish evil** (惩恶).\nLi Qun **mistakenly took** (以) **Item羽’s** (项羽) **lack of mechanism** (昧机) as the **heart arising from things** (心生于物);\nAnd **Fú Jiān’s** (符坚) **perception of mechanism** (见机) as the **heart dying from things** (心死于物).\nHe **completely failed** (殊不知) to grasp **flaws and merits** (有否臧之用).\n\nHeaven’s **greatest self-interest** (至私) **generates** (生) **greatest public use** (至公).\n*The Transmission* says:\n*\"Heaven’s **natural principle** (自然之理) is **subtle** (微) yet **unknowable** (不可知),\nThis is the **greatest self-interest** (至私).\nYet when **treacherous omens** (凶象) **appear** (见) as **Heaven’s warnings** (咎征),\n**Humanity** (人) can **take heed** (儆戒) and **cultivate virtue** (修德).\nWhen **thunder and fierce winds** (迅雷烈风) **stir** (动) **humanity** (人),\n**Humanity** (人) can **fear** (恐惧) and **attain blessings** (致福).\nThis is how **greatest self-interest** (无恩) **generates** (生) **greatest public use** (大恩).\nLi Qun **mistakenly took** (以) **Heaven and Earth’s lack of benevolence** (天地不仁) as **greatest public use** (大恩),\nAnd **ten thousand things returning to Heaven** (万物归于天) as **bewildered** (蠢然).\nThis **greatly diverges** (殊背) from the *Yin Fu*’s **original meaning** (本意).\n\n*The Transmission* says:\n**The greatest delight is nature’s excess** (至乐性余),\n**The greatest stillness is nature’s restraint** (至静性廉).\n*\"When **emotions** (情) are **unreleased** (未发), it is called **the Middle** (中);\nTo **guard the Middle** (守中) is called **constancy** (常),\nThen **delight attains its purpose** (乐得其志) and **nature has excess** (性有余).\nWhen **nature is tranquil and constant** (性安常), it is called **self-sufficiency** (自足);\nThen **stillness attains its purpose** (静得其志) and **restraint is constant** (廉常足).\nLi Qun **mistakenly took** (以) **excessiveness** (奢) as **delight’s nature** (乐性),\nAnd **restraint** (廉) as **stillness** (静),\nHow **contrary** (殊乖) is this to the **supreme Dao/Way** (至道)!\n\nHeaven’s **greatest self-interest** (至私) **becomes** (用) **greatest public use** (至公).\n*The Transmission* says:\n*\"The **natural principle** (自然之理) is **subtle** (微) yet **unknowable** (不可知),\nThis is the **greatest self-interest** (至私).\"*»",
      "overlap_context": "e **Sage** (圣人) is **skilled** in applying wisdom,\nYet **clumsy** in exerting strength.\nWhen in adversity or peril, they **plot with the Dao/Way** (谋道) to aid it;\nWhen facing the **strong and the clever** (强与明), they **conceal righteousness** (伏义) to retreat.\nThis is essential for **governing the state** (理国),\nAnd likewise for **employing military force** (用师).\nThe **evil** (邪) of the **nine orifices** (九窍) lies in the **three critical points** (三要),\nWhich can be **activated or stilled** (动静).\"*",
      "start_char": 4726,
      "end_char": 6005,
      "start_sentence": 308,
      "end_sentence": 387,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 45.52377533912659,
      "metadata": {
        "source_file": "dao\\藏外\\黄帝阴符经注（唐李筌）.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "自然之功，明而不可违，公之至也。 圣人体之亦然。 筌引《孙子》云：视卒如爱子，可以之俱死。 何也？ 擒之制在气。 《传》曰：擒物以气，制之以机，岂用小大之力乎？ 太公曰：岂以小大而相制哉？ 筌不知擒之义，误以禽兽。 注解引云玄龟食蛇，黄腰啖虎之类，为是悲哉！ 生者死之根，死者生之根。 恩生于害，害生于恩。 生者，人之所爱，以其厚于身。 太过则道丧，而死自来矣。 死者，人之所恶，以其损于事。 至明则道存。 而生自固矣。 福理所及谓之恩，祸乱所及谓之害，损己则为物之所益，害之生恩也。 筌引《孙子》用兵为生死，丁公、管仲为恩害。 异哉！ 愚人以天地文理圣，我以时物文理哲。 人以虞愚，我以不虞圣。 人以期其，我以不期其圣。 《传》曰：观天之运四时，察地之化万物，无所不知，而蔽之以无知，小恩于人，以蒙自养之谓也。 知四时之行，知万物之生，皆自然也。 故圣人于我以中自居之谓也。 故曰死生在我而已矣。 人之死亡，譬如沈水自溺，投火自焚，自取灭亡。 理国以道，在于损其事而已。 理军以权，在于亡其兵而已。 故无死机则不死矣，鬼神其如我何？ 圣人修身以安其家，理国以平天下，在乎立生机。 以自去其死性者，生之机也。 除死机以取其生情者，死之机也。 筌不天道，以愚人、圣人、体道愚昧之人而验天道，失之甚也。 故曰沈水入火，自取灭亡。 注在上矣。 自然之道静，故天地万物生 《传》曰：自然之道，无为而无不为。 动静皆得其性，静之至也。 静故能立天地，生万物，自然而然也。 伊尹曰：静之至，不知所以生也。 天地之道浸，故阴阳胜。 《传》曰：浸，微也。 天地之道，体着而用微，变通莫不归于正，微之渐也。 微渐故能分阴阳，成四时。 至刚至顺之谓也。 阴阳相推，而变化顺矣。 《传》曰：圣人变化顺阴阳之机。 天地之位自然，故因自然而冥之，利自然而用之，莫不得自然之道也。 是故圣人知自然之道不可违，因而制之。 注在文上。 至静之道，律历所不能契。 《传》曰：道之至静也，律历因而制之，不能叶其中鸟兽之谓也。 爰有奇器，是生万象； 八卦甲子，神机鬼藏。 《传》曰：八卦变异之伎，从是而生。 上则万象，下则万机。 用八卦而体天，用九畴而法地。 参之以气候，贯之以甲子，达之以神机，闭之以诡藏，奇谲之荡自然也。 阴阳相胜之术，昭昭乎进乎象矣。 《传》曰：阴阳相胜之术，恒微而不违乎本，明之信可明，故能通乎精曜象矣。",
      "translated_text": "「The **greatest self-interest** (至私) of **Nature’s function** (自然之功) is **manifest yet unalterable** (明而不可违), the **greatest public use** (至公) of the Dao/Way.\n\nThe **Sage** (圣人) embodies it thus. Li Qun cites *The Art of War* (《孙子》):\n*\"To treat soldiers as one’s own beloved children, they can be made to die together with you.\"* (视卒如爱子，可以之俱死)\nWhy so? **The principle of capture lies in qi.** (擒之制在气)\n*The Transmission* says:\n*\"To capture beings, one uses qi; to control them, one uses strategy. Why rely on brute force of great or small?\"* (擒物以气，制之以机，岂用小大之力乎？)\n**Duke Zhou** (太公) said:\n*\"Is it by great or small force that one controls the other?\"* (岂以小大而相制哉？)\nLi Qun fails to grasp **the principle of capture** (擒之义), misapplying it to **wild beasts** (禽兽).\nHis annotations cite instances like *the tortoise devouring the snake* (玄龟食蛇), *the yellow-bellied beast preying on the tiger* (黄腰啖虎), etc.—how lamentable!\n\n**Life** (生) is the root of **death** (死), and **death** is the root of **life**.\n**Harm** (害) gives rise to **favor** (恩), and **favor** gives rise to **harm**.\n**Life** is what people cherish, for it is **profoundly beneficial to the body** (厚于身).\nYet **excess** (太过) leads to **the Dao/Way’s ruin** (道丧), and **death** (死) comes naturally.\n**Death** is what people abhor, for it **damages the affairs of life** (损于事).\n**Clarity** (至明) preserves the Dao/Way, and **life** (生) is naturally secured.\n\n**Favor** (恩) is the **principle of fortune** (福理) reaching others,\n**Harm** (害) is the **principle of calamity** (祸乱) reaching others.\nTo **harm oneself** (损己) is to **benefit others** (物之所益)—\nthus, **harm** (害) gives rise to **favor** (恩).\n\nLi Qun cites *The Art of War* (《孙子》) on warfare as **life and death** (生死),\nand **Ding Gong** (丁公) and **Guan Zhong** (管仲) on **favor and harm** (恩害).\nHow strange! The **foolish man** (愚人) regards **Heaven and Earth’s patterns and principles** (天地文理) as **Sagehood** (圣),\nwhile I see **the Sagehood in adapting to time and things** (时物文理) as **philosophy** (哲).\nOthers consider **planning** (期) as **Sagehood** (圣),\nbut I consider **not planning** (不期) as **Sagehood** (圣).\n\n*The Transmission* says:\n*\"Observe the **Heaven’s movement** (天之运) through the four seasons,\nand **Earth’s transformation** (地之化) of all things—\nto know all yet **conceal knowledge** (蔽之以无知),\nto **bestow small favors** (小恩于人) while **nurturing oneself** (蒙自养),\nis the way of the Sage.\"*\n\nTo know the **four seasons’ course** (四时之行) and **all things’ generation** (万物之生)\nis to grasp **Nature’s spontaneity** (自然).\nThus, the Sage **resides in the Middle** (以中自居).\n\nHence it is said: *\"Death and life lie within me alone.\"* (死生在我而已矣)\n**Human death** is like **drowning in water** (沈水自溺) or **burning in fire** (投火自焚)—\n**self-inflicted annihilation** (自取灭亡).\n\nTo **govern a state with the Dao/Way** (理国以道) lies in **reducing its affairs** (损其事).\nTo **command an army with strategy** (理军以权) lies in **abolishing its weapons** (亡其兵).\nThus, **without the mechanism of death** (无死机), there is **no death** (不死).\nWhat can **ghosts and spirits** (鬼神) do to me?\n\nThe Sage **cultivates oneself** (修身) to **secure one’s family** (安其家),\ngoverns a state (理国) to **pacify the world** (平天下),\nby **establishing the mechanism of life** (立生机).\nTo **remove one’s deathly nature** (去其死性) is the **mechanism of life** (生之机).\nTo **eliminate the mechanism of death** (除死机) and **harness life’s vitality** (取其生情) is the **mechanism of death** (死之机).\n\nLi Qun **does not comprehend Heaven’s Dao/Way** (不天道),\nyet he **tests Heaven’s Dao/Way** (验天道) with the **foolish, the Sage, and those who embody the Dao/Way yet remain ignorant** (体道愚昧之人).\nHis error is **most grievous** (失之甚也).\nHence it is said: *\"Drowning in water, burning in fire—self-inflicted annihilation.\"* (沈水入火，自取灭亡)\nThe annotation is **already made above** (注在上矣).\n\n**Nature’s Dao/Way is supremely still** (自然之道静),\nso **Heaven and Earth and all things are born** (天地万物生).\n*The Transmission* says:\n*\"Nature’s Dao/Way **acts without action yet nothing remains undone** (无为而无不为).*\n**Movement and stillness both attain their nature** (动静皆得其性)—\nthis is the **supreme stillness** (静之至).\nStillness **establishes Heaven and Earth** (能立天地),\n**generates all things** (生万物),\n**spontaneously and naturally** (自然而然).\"\n\n**Yi Yin** (伊尹) said:\n*\"Supreme stillness **does not know how it generates** (不知所以生).*\n**Heaven and Earth’s Dao/Way is subtle** (浸), so **yin and yang prevail** (阴阳胜).\n*The Transmission* says:\n*\"**Subtle** (浸) is **refined** (微).*\n**Heaven and Earth’s Dao/Way** is **embodied yet applied subtly** (体着而用微),\n**adapting and transforming** (变通) to **return to the norm** (归于正)—\nthis is the **gradual refinement of subtlety** (微之渐).\"\n\n**Gradual refinement of subtlety** (微渐) allows **yin and yang to be distinguished** (分阴阳),\n**to complete the four seasons** (成四时).\nThis is **ultimate strength and ultimate compliance** (至刚至顺).\n**Yin and yang** propel each other,\nand **transformation proceeds in harmony** (变化顺).\n\n*The Transmission* says:\n*\"The Sage **adapts and transforms** (变化) in **harmony with yin and yang’s mechanisms** (顺阴阳之机).*\n**Heaven and Earth’s positions** are **naturally established** (自然),\nso the Sage **follows Nature’s spontaneity** (因自然而冥之),\n**harnesses its benefits** (利自然而用之),\nand **nothing escapes Nature’s Dao/Way** (莫不得自然之道).\n\nThus, the Sage **knows Nature’s Dao/Way is unalterable** (不可违),\nand **controls it accordingly** (因而制之).\nThe annotation is **already made above** (注在文上).\n\n**Supreme stillness** (至静) **transcends all measure and reckoning** (律历所不能契).\n*The Transmission* says:\n*\"The Dao/Way’s **supreme stillness** (至静), though **measured and regulated** (律历) may **follow and control** (因而制之),\n**cannot conform to its inner essence** (不能叶其中)—\nthis is the **beastly ignorance** (鸟兽之谓).*\n\nHere are **wondrous instruments** (奇器),\nwhich **generate all phenomena** (是生万象).\n**The Eight Trigrams and the Heavenly Stems-Earthly Branches** (八卦甲子) hold **divine mechanisms and mysterious concealments** (神机鬼藏).\n*The Transmission* says:\n*\"The **Eight Trigrams’ shifting transformations** (八卦变异之伎) **emanate from this** (从是而生).\nAbove, it **manifests all phenomena** (则万象),\nbelow, it **encompasses all mechanisms** (则万机).\nUse the **Eight Trigrams to embody Heaven** (体天),\nuse the **Nine Categories** (九畴) to **model Earth** (法地).\n**Correlate them with climate and qi** (参之以气候),\n**thread them with Heavenly Stems-Earthly Branches** (贯之以甲子),\n**penetrate them with divine mechanisms** (达之以神机),\n**conceal them in guileful strategies** (闭之以诡藏)—\n**the wondrous and deceptive sway of Nature** (奇谲之荡自然).\n\nThe **art of yin and yang’s mutual overcoming** (阴阳相胜之术)\nis **clearly expressed in the symbols** (昭昭乎进乎象).\n*The Transmission* says:\n*\"The **art of yin and yang’s mutual overcoming** (阴阳相胜之术)\n**consistently operates subtly yet never deviates from its root** (恒微而不违乎本).\n**Clarity’s truth is trustworthy** (明之信可明),\nso it **penetrates the refined and luminous symbols** (能通乎精曜象矣).\"»",
      "overlap_context": "ness attains its purpose** (静得其志) and **restraint is constant** (廉常足).\nLi Qun **mistakenly took** (以) **excessiveness** (奢) as **delight’s nature** (乐性),\nAnd **restraint** (廉) as **stillness** (静),\nHow **contrary** (殊乖) is this to the **supreme Dao/Way** (至道)!\n\nHeaven’s **greatest self-interest** (至私) **becomes** (用) **greatest public use** (至公).\n*The Transmission* says:\n*\"The **natural principle** (自然之理) is **subtle** (微) yet **unknowable** (不可知),\nThis is the **greatest self-interest** (至私).\"*»",
      "start_char": 6005,
      "end_char": 7006,
      "start_sentence": 388,
      "end_sentence": 448,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 26.857776165008545,
      "metadata": {
        "source_file": "dao\\藏外\\黄帝阴符经注（唐李筌）.txt",
        "category": "藏外"
      }
    }
  ]
}