{
  "source_id": "龙虎还丹诀颂",
  "source_file": "chunked_daozang\\龙虎还丹诀颂.json",
  "total_chunks": 9,
  "total_original_chars": 5799,
  "total_translated_chars": 33391,
  "total_translation_time": 106.65155029296875,
  "model_used": "mistralai/ministral-14b-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\龙虎还丹诀颂.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**Title: *Ode to the Dragon-Tiger Reversion Elixir Secret***\n\n**Scripture Name:** *Ode to the Dragon-Tiger Reversion Elixir Secret*\n**Author:** Lin Taigu (Northern Song)\n**Annotator:** Gushenzi\n**One scroll**\n**Source:** *Zhengtong Daozang*, Taixuan Section\n\n---\n\n**Ode to the Dragon-Tiger Reversion Elixir Secret**\n\nI was born in the lands of Ba and Shu,\nLong dwelling in Qi and Lu’s domain.\n*\"I\"*—thus the Master named himself.\n\nThe Master bore the surname Lin,\nGiven name Taigu, style Xiangxian,\nDao name Chunhezi.\nHis ancestors hailed from Taiyuan, Jinyi,\nYet by official duty took root in Liangzhou.\nHe sought the Dao through wide inquiry,\nOften wandering Qi and Lu’s lands.\n\nEmperor Taizong, knowing his name, summoned him,\nAnd granted him residence on Jingzhao Mountain—\nThus he was called *Jingzhao Shanren*.\nLater, he secluded himself in Huayang, Yizhou,\nAnd was again named *Huayang Xiansheng*.\n\nFor long he cherished tranquility,\nEver gazing into stillness.\nHe scorned fame and gain,\nGuarding simplicity—\nThis was his true intent.\n\nThe Dao originates from Nature’s principle,\nIts transformation returns to the boundless source.\nSpeaking of the Dao, one takes Nature as foundation;\nThose who apply it skillfully\nAttain the boundless.\n\nExamining the trigrams *Kan* and *Li*,\nPointing to lead and mercury.\n*Kan* is water, *Li* is fire,\nLead is the Tiger, mercury the Dragon.\nThis refers to true fire and true water,\nTrue lead and true mercury.\n\nThe *Ode* completes sixty-four verses on the Reversion Elixir Secret.\nThe ancient sages’ mysteries of the Reversion Elixir\nAll draw upon the *Yijing*’s symbols.\nThus the sixty-four verses of the Elixir Secret\nFollow the number of the hexagrams.\nIf later disciples study them diligently,\nPractice them deeply,\nThey shall perceive their subtlety.\n\nSince the Golden Chamber ignited the divine furnace,\nThe Chamber is ever revered—hence *Golden Chamber*.\nThe furnace transforms cinnabar—hence *Divine Furnace*.\nThe boundless Dao-wind sweeps the eight directions.\nThe furnace has eight faces,\nYet the wind stirs all—\nThus Taibai Jun’s song says:\n*\"The altar holds a three-tiered furnace of eight faces.\"*\n\nFortunate to observe ten thousand transformations in the Nine Enclosures,\nThe Nine Enclosures are the cauldron’s vessel,\nEncompassing yin and yang.\nThe *Jade Pouch Ode* says:\n*\"Anciently, it was named Divine Dragon Marrow;\nThe Reversion Elixir’s completion relies on the Nine Enclosures.\"*\nThis is its meaning.\n\nWho would not marvel at the Imperial Diagram’s praise?\nThe Imperial Diagram refers to the revered status of the divine elixir.\nFrom Chaos’s division, I alone am exalted.\nAmong myriad things, none surpasses the Great Elixir in eminence.\nIt contains the Four Symbols, establishing Heaven and Earth.\nOne must recognize the refined *qi* of Heaven and Earth—\nMetal, Wood, Water, Fire—\nOnly then can the supreme medicine be forged.\n\nThe Reversion Elixir must be sought within this.\nObtaining this is the gate to the utmost subtlety.\nIf applied without mastery,\nIt becomes the gate to marvelous attainment.\n\nCommon folk burn the Five Metals,\nWho knows the Celestial Sovereign dwells in the Azure Pool?\nThe masses compete to burn mercury and cinnabar,\nClaiming it as the spirit elixir.\nYet the essence of the Golden Elixir\nLies within the Hua Pool itself.\n\nTo forge the crimson powder in the cauldron,\nFirst blend the white gold ointment within the furnace.\nThe *Yin-Shu Jing* says:\n*\"To know and refine is to be a Sage.\"*\nThen those who discern the gold ointment and jade powder—\nAre they not the Sages alone?\n\nFor those who wish to burn the elixir, take cinnabar,\nIts luminous clarity must first be verified.\nCinnabar is born from true lead,\nNot the common cinnabar of the world.\nTao Zhenren said:\n*\"Cinnabar is the supreme treasure within lead.\"*\nYuanyangzi said:\n*\"Do not seek cinnabar from Chenjin Prefecture—\nIts journey is long; seek it near instead.\"*\n\nIts root is the Green Dragon’s bone,\nThe Immortals call it White Horse’s tooth.\nThe Green Dragon is Wood, is mercury,\nAnd mercury emerges from cinnabar.\nYin Zhenren said:\n*\"Cinnabar is the essence of Wood.\"*\nAnd again:\n*\"When dissolved, it becomes water;\nWhite Horse’s teeth are scattered.\"*\n\nTao Zhenren said:\n*\"White Horse’s tooth—\nThe finest cinnabar.\"*\n\nThe divine furnace’s eight trigrams take the Five Peaks’ form,\nThe furnace’s shape follows the eight trigrams and Five Peaks,\nStanding thus.\nWithin, the yang cauldron governs the yin essence.\nWater and fire interact,\nYin and yang regulate each other.\n\nObserve where Dragon and Tiger intertwine—\nThe wind and thunder tremble, a hundred demons startled.\nAn ancient song says:\n*\"The Five Phases invert and unfold,\nThe Dragon emerges from fire’s embrace.\nThe Five Phases act disorderly,\nThe Tiger is born within water.\"*\n\nWater and fire being within the cauldron,\nThe Dragon and Tiger surge internally,\nWind and thunder shake—\nA hundred monsters cower in fear.\n\nEmerging from the Azure Waves, it vanishes into darkness,\nGold is born from water, displaying its transformative power.\nWithin the cauldron, heavy as snow, yet light as flowers.\nYuanyangzi said:\n*\"Cinnabar is the substance, snow its attire—\nSnowflakes liken its light and clarity.\"*\n\nDo not shun cold and heat until the Nine Suns of Yang are fulfilled,\nThen the elixir’s luminous essence—\nThe Five Emperors’ refined *qi*—is forged.\n\nCommon folk seek to refine the Sun’s spirit-soul,\nThe Reversion Elixir takes the Sun as soul, the Moon as shadow.\nFirst, seek the mysterious source of transformation’s root.\nThe mysterious source is profound and secret,\nThe foundation of the medicine.\nTao Zhenren’s later text says:\n*\"The essence of Taixuan is the Dao’s fundamental root.\"*\n\nThen establish *Kan* and *Li* as matched pair,\n*Kan* is male, *Li* female—\nThe symbol of a matched pair.\nTheir emotions and nature unite Heaven and Earth.\n*Nature* refers to cinnabar and mercury,\n*Emotion* refers to gold.\nThe *Paramartha Contract* says:\n*\"Nature governs the inner realm,\nPlacing it at Yinyue.\nEmotion governs the outer realm,\nFortifying the city walls.\"*\n\nAnd again:\n*\"The Dragon is emotion, the Tiger is nature;\nEmotion and nature depend on each other—\nThe meaning of return and transformation.\"*\n\nI often see common folk discussing the Great Elixir,\nCompeting to burn the Eight Stones or dwell in mountains.\nAn ancient song says:\n*\"The Eight Stones harm the crimson blood,\nThe Five Metals deplete the yellow shoots.\"*\nThose who burn the Eight Stones in the mountains,\nClaiming them as the Great Elixir—\nAll are misguided.\n\nThey fail to recognize the true forms of Dragon and Tiger,\nWhich lie hidden in the mysterious and elusive.\nThe supreme medicine is not distant—\nYet the bewildered fail to awaken.\n\nCast gold to forge the true cauldron,\nFor when the cauldron is true,\nThe mercury naturally aligns.\nAn ancient song says:\n*\"The true cauldron is not a cauldron—\nOnly by using the true cauldron\nDoes true mercury arise.\"*\n\nThe Two Substances embrace and refine into the Supreme Elixir,\nFeasting upon them makes one a transcendent being of dust.\n\nWithout the embrace of these Two Substances,\nThe Great Elixir will never be complete.\n\nThe *Qian* and *Kun* Hexagrams alone form the essence,\nA thousand mornings of water and fire reveal their efficacy.\n\nPractice the *Qian* and *Kun* Hexagrams,\nEmploy water and fire in their cycles,\nAnd in a thousand days, the Return Elixir is born.\n\nThus, Qingxu Zi instructed Master Mao Jun:\n*\"The Great Elixir, when practiced for a thousand days,\nWill manifest as the radiant Purple Bamboo.\nThe upper and lower strings harmonize the Two Eights,\nTheir alignment precise to the slightest measure, corresponding to the Western Bundle.\"*\n\nQingxu Zi said:\n*\"Eight measures of *huā* (华) as the upper string,\nEight measures of mercury as the lower string—\nCombined, they make one *jin* (斤),\nTo fulfill the measure of the Two Strings.\nThus, the upper and lower strings harmonize the Two Eights,\nTo match the weight of the elixir, one *jin*.\"*\n\nThe secret essence of the Golden Elixir lies in the *Huá* Pool (华池),\nThe Divine Water of the *Huá* Pool teaches:\n*\"The Pool is water and fire.\nAgain, the *Zhōngyuán* (中元) text says:\nThe *huá* (华) is fire,\nThe Pool is water.\nLearners abound, yet masters are rare.\nThe confused point one another to error,\nAnd those who attain are few indeed.\"*\n\nWhen Huai Wang (淮王) realized this, he became a True Immortal (真后),\nHis chickens and dogs ascended together, abandoning their homes to fly.\nThe Han Huai Nan Wang (淮南王) Liu An (刘安),\nAfter refining the elixir, his chickens and dogs licked the cauldron,\nAnd they too ascended to the Cloud Path (云路).\n\nMercury dwells within the sand,\nGold within the lead—\nIf one can thus intuit the Mysterious,\nThe profound secrets will naturally unfold.\n\nThe sand yields mercury,\nThe lead yields gold,\nA marvel of Nature—\nOnly those who grasp it enter the True Realm (真境).\n\nThough they have not yet attained the *Dāoguī* (刀圭) power,\nThey already strive to become Earthly Immortals (地仙).\nWhen the heart comprehends the Supreme Treasure,\nWhat else is it but Immortality?\n\nThe *Kàn* Hexagram enfolds gold, yet few know,\nThe *Lí* Hexagram contains water, yet few recognize.\n\nTao Zhengren’s lower chapter (下篇) states:\n*\"Gold is born from the Moon, thus *Kàn* is male.\nThe flowing pearl (流珠) arises from the Sun, thus *Lí* is female.\"*\nMao Zhengjun’s song declares:\n*\"Within the yin lies the yang,\nWithin the yang lies the yin—\nThis is the truth.\"*\n\nIf one can discern the True Gold and True Water,\nBy daylight, they ascend to the Purple Weft (紫微).\n\nThose who can distinguish True Gold and True Water,\nShall swiftly attain sainthood,\nRanking among the celestial immortals (列位仙官).\n\nThe Golden Flower, when plucked, is the essence of lead,\nChased like prey, its scales shimmer as light as snow.\nIt speaks of the Golden Flower congealing like scattered scales,\nAs delicate as snowflakes in hue.\n\nIf one understands the subtleties within this,\nThe *Huá* Pool and Golden Cauldron will reveal themselves.\n\nLead enfolded in fire is gold within water—\nMutually employed, their transformations are boundless.\n\nAs the hundred refinements proceed, the hue deepens,\nThe True Essence harmonized—\nRefining it further enhances its marvel.\n\nWithout encountering a Sage to transmit the oral precepts,\nRelying solely on scriptures and commentaries,\nThe Great Elixir’s secrets remain elusive.\nIt is not recorded in scriptures or commentaries,\nBut passed down from Sage to Sage—\nA few lines of oral precepts suffice.\n\nYin enfolded, drawn forth, belongs to yang,\nYet common folk fail to grasp its fine details.\n\nWater cooks it, fire refines it—\nThose who understand this principle\nCan forge the elixir from cinnabar.\n\nIf one can recognize the Primordial Yin and Yang,\nThey shall enter the Realm of Everlasting Life.\n\nThe Earthly Essence and Heavenly Soul are the Tiger and Dragon—\nHeavenly Yang is the Dragon’s Soul,\nEarthly Yin is the Tiger’s Essence.\nA thousand families’ texts describe them in vague terms.\n\nAncient Sages praised confusion,\nSaying the Dao is not far.\nYuan Yang Zi (元阳子) declared:\n*\"Confusion lies solely in the union of your family’s art,\nDay after day, you gaze yet fail to see.\"*\n\nCommon folk seek to recognize True Lead and True Mercury,\nIdentifying the Golden Master (金公) as lead\nAnd the Water Artisan (水工) as mercury.\n\nFire enfolds lead—lead is not tin,\nWood conceals water—water is not silver.\n\nTrue Lead and True Mercury\nAre not the mundane black tin and quicksilver.\n\nOnly when you grasp the True Sage’s song,\n*\"Not knowing fire-lead and water-mercury,\nThough you master a thousand arts, it profits nothing.\"*\n\nRely only on *Kàn* and *Lí*, aided by *Zhèn* and *Sǔn*,\nTo teach the union of *Jiǎ* and *Yǐ* with *Gēng* and *Xīn*.\n*Jiǎ* and *Yǐ* are wood,\n*Gēng* and *Xīn* are metal.\n\nYin Zhengren (尹真人) said:\n*\"Cinnabar is the essence of wood,\nAnd when it obtains gold, they merge.\"*\n\nThus, *Kàn*, *Lí*, *Zhèn*, and *Sǔn*\nAre always applied in their interplay.\n\nA single Pool of autumn water reveals its hue,\nNine cycles of yin and yang descend then ascend.\nThe Nine Cycles are from the first month to the ninth month.\nAn ancient song says:\n*\"The ninth cycle, autumn’s end,\nThe Yellow Shoot’s auspicious form shines,\nIts purple light resplendent.\"*\n\nLu Master (吕先生) said:\n*\"The coarse *Gǔshén* (谷神) ascends and descends.\nWait until the White Gold fully melts,\nThen a single cluster of Elixir Essence congeals within the cauldron.\"*\n\nThe Golden Body returns as the Elixir—\nThis alone is the Supreme Treasure.\n*The Cansong Contract* (《参同契》) says:\n*\"When gold returns to its original nature,\nIt is then called the Return Elixir.\"*\n\nOne breath congeals into the frost within the cauldron,\nThe Sages of Immortality call it the King of Elixirs.\nAll other medicines cure ailments,\nBut the Return Elixir and *Dāoguī* (刀圭) transform mortals into immortals,\nThus it is the sovereign of all medicines.\n\nNature’s creation is like a chicken egg,\nExternally corresponding to *Gēng* and *Xīn* wrapped in yellow.\nThe cauldron and elixir resemble the egg’s form.\nAlways study the *Yīnfú* (《阴符》) and *Dàodé Jing* (《道德经》),\nFor Lu Master’s teachings are profound.\n\nLu Master, named Dongbin (洞宾),\nWas a Sage of recent times.\n\nNurturing the elixir requires not three years of fire,\nRefining the Golden Elixir points directly to half a *shēng* (升) cauldron.\nLu Master’s verse:\n*\"A single grain of millet contains a world,\nHalf a *shēng* cauldron boils mountains and rivers.\"*\n\nIn the boundless void, the Sun’s essence shines,\nSpeaking of the subtle marvels of the Primordial Yang,\nWhich nurtures all things.\n\nThe roots of Heaven and Earth are the teeth of all things.\nAspiring scholars, knowing this, refine according to the method,\nAnd the natural elixir transforms into the *Héchē* (河车).\n*Héchē* is another name for the Yellow Shoot.\n\nYangzi (阳子) of the Jin (晋) said:\n*\"Refining in *Qian* yields the Yellow Shoot,\nTurning in *Kun* produces the *Héchē* (河车).\"*\nAgain, his song:\n*\"The *Héchē* bears *Jiǎ* as your master,\nGuard this path with secrecy—your heart will know.\"*\n\nRefining the seas, subduing the mountains, regulating the Five Phases,\nWithin it, you capture the essence of the void.\nIt speaks of controlling the Five Phases,\nSeizing the Primordial Qi (元气).\n\nIf mortals but see the True Root,\nThey should read the *Dàodé Jing* of the Primordial Emperor, the Most High Laozi (太上老君),\nWho instructed the Gatekeeper Guan (关令) Yin Xi (尹喜) with the Five Thousand Words of the *Dàodé Jing*,\nWhose essence fully contains the True One of the Return Elixir.\n\nThe hare flees, the crow flies, and the West is bound—\nA hundred years pass like a dream within the soul.\n\nWhen mortals ask of the path to eternal life,\nTheir greed for transient glory brings endless death.\n\nThe *Shénnóng Jīng* (神农经) says:\n*\"Knowing white and preserving black,\nYou seek death but cannot find it.\"*\n\nIt deceives the world, unaware of the Daoist Immortals’ way of transcending life.\nThey only hasten toward the mundane, yet swiftly reach annihilation.\n\nWithin the One, the true One is most difficult to seek,\nIts name ranks in the West, its nature is gold.\n\nThe One is water.\nWithin water, the One is white gold.\n\nThe True Immortal Tao (陶真人) said:\n*\"Three and five unite with the One,\nThe utmost essence of Heaven and Earth.*\n\nGold is the mother of water,\nThe mother concealed, the child within the womb.\nWater is the child of gold,\nThe child hidden within the mother’s matrix.\n\nAgain, he said:\n*'White is the essence of gold,\nBlack is the foundation of water.*\n\nWater is the pivot of the Dao,\nIts number is called the One.\n\nThe determined seeker, knowing this, follows its principle—\nNaturally, black and white float and sink in harmony.\n\nBlack is lead,\nWhite is silver.\nLead sinks, silver floats—\nThe marvel of nature’s balance.\n\nHeaven and Earth’s furnace refines the essence of the sun and moon,\nRegal gold and primeval wood merge in their own accord.\nIf mortals recognize the true gold and wood,\nAll transformations come effortlessly to their grasp.\n\nTo grasp the meaning of gold and wood,\nThen the workings of creation rest in their hands.\n\nThe True Immortal Tao’s lower scripture says:\n*\"He who attains it holds Heaven and Earth in his palm,\nCreation in his body—\nAscending to sainthood,\nEnrolling in the ranks of the Immortals.*\n\nAwakening to this is like crossing a great river—\nThe enlightened cross without hindrance.\n\nAlways cultivate hidden virtue to move the Bright Heaven.\nIf you act contrary to the Dao and reveal its mysteries,\nThe spirits will surely bring misfortune upon you.\nIf you do not refine your practice yet disclose its secrets,\nDisaster will follow.\n\nAll volumes of Immortal scriptures share the same principle,\nThe Return Elixir never strays from the Five Phases.\n\nNever straying from the Five Phases,\nThe Five Phases become the supreme medicine.\n\nTo know the ninefold transformations of yin and yang complete,\nObserve the three-year process of water and fire.\n\nA thousand days of water and fire,\nAnd the Great Elixir is formed.\n\nGently gather the dew of wood,\nFrom a peck to a bushel, then to a weight.\nFrom nonexistence to existence,\nFrom little to much.\n\nExhaustion and fatigue—is the labor not bitter?\nYet the ancient sages endured such hardship.\n\nThey spoke of the ancients all being bound by ambition,\nYet attaining transcendence through it.\n\nBoiling stones, refining gold, and alchemizing the *Tàixuān* (太玄),\nThe Immortals do not permit its casual transmission.\n\nThe essentials of its use—\nA treasure of the Immortals, unknown to the world.\n\nIf mortals recognize the principle within the *Xuān* (玄),\nThe *Xuān* is the root of the medicine—\nThose who perceive it refine their power to match creation.\n\nThey grasp the authority of Heaven and Earth’s transformations.\n\nThe Return Elixir’s omen appears in the first month,\nAs yin and yang interact to reach *Xīyí* (希夷).\n\n*Xīyí*—the path of profound obscurity.\n\nThe hidden dragon’s position corresponds to the initial nine,\nWith the fire symbol drawn from the *Chūjiǔ* (初九).\nThe first emergence of yang at the child hour is the beginning.\n\nIn the second month, the green dragon begins to manifest,\nGathering the subtle essences of the Five Phases.\n\nWood and mercury congeal their essence,\nGradually revealing the spirit elixir.\n\nOne who knows the fire’s tempered warmth and hue,\nWill hear the tiger’s roar within the cauldron.\n\nThe True Immortal Tao (茆真君) said:\n*\"Cold and heat return in cycles,\nThe tiger roars, the dragon hums.\"*\n\nIn the third month, the spirit elixir is called the *Xiǎo Huán* (小还).\nThree years make the *Dà Huán* (大还), three months the *Xiǎo Huán*.\n\nThe *Xiǎo Huán* congeals like true lead.\nYou must regulate with intent the harmony of *Wén* (文) and *Wǔ* (武),\nLest yin and yang’s timing be misplaced.\n\nSecure and meticulous—\nCling to the fire’s temper,\nGradually revealing mercury and lead.\"\n\nThe fire’s record marks the days:\nAt the start and end, *Wén* (cultivation), at the core, *Wǔ* (transformation).\nThus, it is called *Wén-Wǔ* (cultivation-transformation).\n\nBy the fourth month, the work is complete—\nThe soul is established, as a child in the womb,\nAnd the spirit is born.\n\nThe Green Dragon and White Tiger contend, devouring each other.\nAt this time, the *Yù Yè* (jade liquid) subtly congeals,\nAs yang solidifies and yin dissipates—the tiger flees in haste.\n\nIn the fifth month, yin and yang qi intermingle,\nAnd the yellow sprout gradually nurtures the sacred seedling.\nThe fifth month’s *Gòu* (coalescence) hexagram:\nWhen yang first meets yin, the two qi harmonize,\nGradually gestating the sacred sprout.\n\nThis sacred seedling is the elixir of longevity—\nWater and fire must still be attuned to the seasons.\n\nIn the sixth month, true yin solidifies into the *shā* (sand),\nWhile deluded practitioners vainly seek the *Hé Chē* (river cart).\n*Yīn Cōng* (殷葱) warns the *Tóng Rén* (fellow Daoists):\nDo not boast in vain to the passing trends.\nThe ancient sages sternly forbade\nRevealing this lightly.\n\nBy the seventh month, the medicine is secretly perfected,\nIts green, yellow, red, and white forms indistinct.\nAs yin and yang qi grow stronger,\nIts hues shift without constancy.\nRely entirely on water and fire’s impartial force,\nRefining the essence of yin and yang qi.\n\nWithout the interplay of water and fire,\nThe two qi cannot condense their essence.\n\nIn the eighth month, the cycle returns to the *Duì* (joy) phase,\nWhere metal aligns with the season’s mandate.\n\nThe essence now returns to the **Duì** phase’s brilliance,\nYet still one must guard the **shén shì** (神室) with utmost care—\nThe **shén shì**, where the medicine is nurtured.\nCultivate the **Chángshēng Huǒlóng** (长生火里龙) within its depths.\nWhen the **Huǒlóng** (火龙) is perfected, humans attain **Chángshēng** (长生).\n\nBy the ninth month, the **Hánlíng Gōng** (含灵汞) is fully dry,\nA single jar of frost and snow chills the world.\nThe medicine condenses its essence, its form like frost and snow.\nDo not hastily claim the **fúshēng bǎo** (浮生宝) as a fleeting treasure,\nBut wait until its completion for the **Dà Huán** (大还).\n\nIf one greedily consumes its benefits,\nAnd recklessly claims the world’s treasure as perfected,\nThen the **língdān** (灵丹) will never be realized.\n\nBy the tenth month, the **Jīndān** (金丹) has shed its embryonic form,\nNow it truly begins as a **yīng’ái** (婴孩).\nThe **xiānshèng** (仙圣) liken the **Jīndān** to a child in the womb,\nOr a seed upon the tree—its workings are unfathomable.\nWhen nurtured to the tenth month,\nIt sheds its embryonic form and becomes a **yīng’ái** (婴孩).\n\nThis **yīng’ái** is the very essence of **Huán Dān** (还丹),\nYet who would believe it arises from the void?\nFrom **xūwú** (虚无) to tangible form,\nIs this not the **ultimate refinement** (至精) in all under heaven?\n\nWhen the **yīn pò** (阴魄) is consumed, the **yáng** (阳) stands firm,\nThe **bái jīn** (白金) gives way to the **húilóng** (灰后赤龙).\nWithin the **dǐng** (鼎), only the **níng cuìyù** (凝翠玉) is known,\nIn the **lú** (炉), no trace of **huáng qīng** (黄轻) remains.\nTransformation and fusion proceed with divine precision,\nInterdependent as **yīn** and **yáng** in their celestial harmony.\nTossing and turning, it repeatedly purges **sùchén** (宿尘),\nFor **tēngdǎo** (腾倒) serves to amplify its **qìshù** (气数).\n\nThe *Tài Yì Gē* (太易歌) states:\n*\"Wēiwēi tēngdǎo tiāndì jīng,\nZhuān cù yīn yáng zǒu shén guǐ yě.\"*\nDo not complain of sluggishness or cling to delay.\nThe **lóng zhēng hǔ zhàn** (龙争虎战) must ultimately return to its **shǐ** (始).\n\nThe **yīn** retreats while the **yáng** flourishes—**yào** grows ever truer.\nThe **lóng** and **hǔ** mutually engage, and the **yào** gradually attains **tōnglíng** (通灵).\n\nThe *Yuánsāng Zǐ Gē* (元阳子歌) says:\n*\"Qīnglóng zhú hǔ, hǔ xúnlóng,\nSuǒwèi lóng zhēng hǔ zhàn zhě yě.\"*\nWhen the **yīn** essence is refined and returned to its **yuán** (元) source,\nThe **shénxiān** (神仙) call it **báilángxū** (白琅圩).\n**Lángxū** (琅吁) is but another name for **jīndān** (金丹),\nSpeaking of its purity like jade’s resplendent grace.\n\nThe common folk fail to grasp its true form,\nAnd suppose the **huándān** (还丹) resembles **dānshā** (丹砂) in hue.\nThe *Shénshuǐ Huápó Lùn* (神水华池论) states:\n*\"Huán zhě guī gēn, dān zhě sè chì yě.\"*\nFrom one origin, three substances align with the **sāncài** (三才),\nThe *Táozhēn Rén Zhōng Piān* (陶真人中篇) declares:\n*\"Lì qiánkūn, yùn shuǐhuǒ, yīng tiān fú, hé sāncài,\nRánhòu chéng dānshā yǐ.\"*\nThus, though **jīndān** (金丹) springs from a single source,\nIt employs three substances—**shuǐ**, **huǒ**, and **yào**—\nAll refined through one **mén** (门).\n\nThe **yīn** and **yáng** interact, forming the **shèng tāi** (圣胎).\nNaturally nurtured, it is called **shèng** (圣).\nWhen the **shuǐhuǒ qìshù** (水火气数) are balanced, the **jūn** (君) reveals itself,\nThe **zǐhéchē** (紫河车) manifests with the **cǎilián** (彩鸾).\n\nThe *Wúmíng Dào Zhě Gē* (无名道者歌) sings:\n*\"Xiū dào zǐhéchē, báirì chōng tiān qù.\"*\nThe **huápó** (华池) **shénshuǐ** (神水) alone proves its efficacy,\nAs the *Shénshuǐ Huápó Lùn* (神水华池论) states:\n*\"Huápó zhě qiān, shénshuǐ zhě gōng yě.\"*\nWith one ripple of the autumn wave, clarity penetrates to the depths.\nRefined within the **dǐng** (鼎), **yánghuǒ** (阳火) presses close,\n\n「Then there are the faint yet frequent roars of tigers and dragons.\nPress them with **lífhuǒ** (离火), stir them with **xùnfēng** (巽风),\nAnd the tigers and dragons clash in battle—\nTheir thunder heard beyond the forge.\n\nThough the mouth consumes little, the body remains cold,\nHow could one dread the slow march of years?\nWith steadfast resolve, one seeks within the embrace of **liàn** (炼),\nYet shuns the **xíngzhǐ guìmén** (行止贵门) of the vulgar.\n\nNoble in pursuit, one does not serve kings or nobles.\nThe *Jiǔ Huán Qī Fǎn* (九还七返) is hard to grasp—\n**Qīng Xī Zǐ** (青霞子) says:\nFrom the eleventh month to the seventh month, it is called **jiǔ huán** (九还).\nFrom the first month to the seventh month, it is called **qī fǎn** (七返).\nWhen **qi** (气) condenses into **shā** (砂), and **shuǐ** (水) transforms into **jīn** (金),\nThe **jūn** (君) arises from the interplay of **shuǐhuǒ qìshù** (水火气数).\n\nTo master the **wǔxíng** (五行) and **sìxiàng** (四象),\nThe dragon naturally bows in reverence within the **dǐng** (鼎).\nIf one can employ the **wǔxíng** (五行) and **sìxiàng** (四象),\nThen the dragon’s bow will respond in kind.\n\nBeneath **Kūnlún Shān** (昆仑山), the **xuánzhū** (玄珠) is found—\nTwo substances dwell in one source.\nThe **xuánzhū** (玄珠) is likened to the supreme treasure,\nThe two substances refer to the **yàogēn jī** (药根基).\n\nAn ancient song declares:\n*\"If two substances are known to unite as one,\nThen the three flowers will reveal the hidden solitary wheel.\"*\nWhen the **yīnyáng yuánqì** (阴阳元气) are refined to sufficiency,\nOne knows the **jīndān** (金丹) originates from the void.\n\nDull and obtuse, yet simple and unassuming,\nWithout intention, without contrivance, without scheme—\nOnce the **xīyí zhì** (希夷旨) is recognized,\nOne finds the **Xuánmén** (玄门) path worth returning to.\n\nThe Master himself spoke of delight in the profound and mysterious—\nThe **Xuánmiào** (玄妙) **Xuánmén** (玄门) indeed.\nThough he scorns the coarse and vulgar, he loves the refined and elegant,\nFor the path to **chángshēng** (长生) is worth traversing.\n\nThose who greedily chase fame and gain, enslaved by **chī** (痴),\nDo not heed the **liúnián** (流年) as it flees like passing waves.\nThey deceive and mock the world, indulging in desires and sensuous pleasures,\nSeeking **mínglì** (名利), yet never entering the **chángshēng** (长生) path,\nAnd so they meet decline—\nLike waves that never return.\n\n**Gōngyīn** (汞) transforms into **jīn** (金), **jīn** (金) into **shā** (砂),\nAnd **jīnshā** (金砂) gradually becomes **zǐhéchē** (紫河车).\nWhen the **jīnshā** (金砂) **qi** (气) is abundant,\nIt forms the **zǐhéchē** (紫河车).\nIf one refines **jīndān** (金丹) and attains the **zǐhéchē** (紫河车),\nThen the path to **Pénglái** (蓬莱) will be without delay.\n\nThe supreme elixir shines with **líng** (灵) efficacy,\nAnd **shénxiān** (神仙) may yet be hoped for.\nWhen the **qiántǔn** (乾坤) are aligned in the **dǐng** (鼎),\nAnd the **tǔlóng** (虎龙) are formed,\nThe **sìxiàng** (四象) revolve harmoniously, the **èrqì** (二气) unite—\nTo grasp the **Huápó** (华池)’s true essence,\nThe **jīndān** (金丹) will naturally arise.\n\nUnderstanding the **sìxiàng** (四象) in their shifts,\nRecognizing the **èrqì** (二气) in their interplay,\nThen **jīndān** (金丹) and **shā** (砂) will transform and take form.\nFrom **wú** (无) arises **yǒu** (有), and **yǒu** (有) returns to **wú** (无)—\nNow present, now absent,\nFaint and elusive as the utmost precision is nurtured.\nThe **rìyuè** (日月) drive each other across the **bǐqū** (碧虚).\n\nWithout meeting a **zhìrén** (至人) to teach the oral **kè** (诀),\n\nIt is futile to read through the five chariots of books in vain.\nThe true scripture says: *\"A little one may gain, much one may be confused.\"*\nIt also says: *\"Without a master, one clings to texts—never truly comprehending the Way.*\nThus, it is known that without meeting a **zhìrén** (至人) to teach the oral **kè** (诀),\neven vast reading yields no benefit.\n\nThe foundation of longevity lies in **huángyá** (黄芽).\nFor **huángyá** (黄芽) is the true essence of the elixir.\nWhen **Húgāngzǐ** (狐刚子) asked **Wèigōng** (魏公):\n*\"What is **huángyá** (黄芽) made of?\"*\n**Wèigōng** (魏公) replied:\n*\"It is lead, yet not lead—five metals arise from the refined **qi** (精) of lead.\"*\n\n**Qīngxīzǐ** (青霞子) said:\n*\"If it is lead, why chase lead ten thousand miles?\nIf it is not lead, why begin with lead?\"*\nLead is the **mother** of **huángyá** (黄芽),\nAnd **huángyá** (黄芽) is the **child** of lead.\nOnce **jīnhuá** (金华) is attained,\nNo need to gather lead again.\n\nIt is also said:\n*\"In the **huītáng** (灰池) of scorching flames,\nLead sinks, silver floats—\nThis is called **huángqīng** (黄轻), also **jīnhuá** (金华),\n**qiūshí** (秋石), **huángyá** (黄芽),\nand **wángyáng** (王阳).*\nIt is named **huángyá** (黄芽)\nbecause of its yellow hue—\nLike the first sprouts of all things,\nthus it is called **huángyá** (黄芽).*\nHe who attains it holds the treasure of longevity.\n\nSubdue and refine it to return to the **wùjǐ** (戊己) lineage.\n**Wùjǐ** (戊己) are the vessels of the **dǐng** (鼎).\nThe **Lǎojūn** (老君) hymn says:\n*\"**Wùjǐ** (戊己) is the primal foundation;\nWater and fire determine superiority and inferiority.\"*\nIt is also said:\n*\"One must complete the **wùjǐ** (戊己) work—\nNever speak of it in terms of iron.\"*\n\nThe **Yùnángsòng** (玉囊颂) proclaims:\n*\"To know the Great Elixir’s foundation,\nOne must obtain the central **wùjǐ** (戊己) soil.*\nWait until water and silver form **báiyè** (白液),\nThen use **báiyè** (白液) to forge **dānsī** (丹砂).*\nFor **dānsī** (丹砂) arises from **jīnyè** (金液).*\n\nIn tattered **máyī** (麻衣) and dusty exile,\nI wander lost, my body mingled with the world.\nYet within me flows a single clear pool of **qīngchéng** (清澄) water—\nI seek neither fame nor fortune, nor any man’s aid.\nFor the treasure within this water\nDemands no noble patrons,\nNo pursuit of **zānyīn** (簪缨) rank.\n\n**Huángjīng** (黄精) and **chìsuǐ** (赤髓) congeal into **sī** (砂).\n**Huángjīng** (黄精) is the refined **qi** (精) of **huángyá** (黄芽).*\nThe **Jīnbìgē** (金碧歌) states:\n*\"**Chìsuǐ** (赤髓) flows as **gǒng** (汞),\nAnd **gǒng** (汞) congeals into **sī** (砂).*\n**Báihǔ** (白虎) and **Qīnglóng** (青龙) are of one origin—\n**Báihǔ** (白虎) and **Qīnglóng** (青龙) are but strong names;\nThey are the **qi** (气) of metal and wood,\nBlended to condense into the purest elixir.\n\nYet all before my eyes I fail to see,\nAnd instead take worthless substances as **huángyá** (黄芽).\nThe *Pāntóngqì* (参同契) says:\n*\"Things of the same kind gather together;\nDisparate matters never yield a treasure.\"*\n\nThe Master further says:\n*\"To plant grain, use millet;\nTo cover the hen, use its own offspring.\nQīngxiyazi says:\n*'Of like kind they gather;\nDisparate things divide—\nThe *luán* does not nurse the *què*,\nNor is the fox a *mǎwéi*.\"*\n\nThree thousand maidens attend the subtle mysteries,\nThe Eight Trigrams cycle back to *xùn* and wood.\n*Xùn* is wind, the maiden is the clepsydra—\nPushing and sorting to reveal their numbers.\n\nScholars fail to grasp the *Xuān*’s true intent,\nYet indulge in sound and color, mere empty forms.\n\nThe Classic states:\n*\"The Yellow Emperor consorted with three thousand women,\nAscending in broad daylight.\nFew had but one wife—\nSome even lost their lives.\nThus, men who prize beauty and multiply\nMeet ruin in the end.\n\nYet few know the *Xuān*’s secret to transcendence—\nThe virtue of *huándān* itself.\n\nThe deepest mysteries of the *Xuān* are hard to fathom,\nYet within it lies the subtle truth.\nOnly in *kǎn* and *lí* does the return unfold—\nThe *Xuān*’s subtlety lies in *kǎn* and *lí*.\n\nNature’s mysteries align with Heaven’s design.\nWith each refinement, progress grows—\nThe chrysanthemum turns from yellow to *liáo*’s red.\nAs the chrysanthemum’s hue shifts,\nAs the *liáo*’s color changes—\nSuch is their transformation.\n\nAfter a thousand days of refining, the furnace opens,\nAll things penetrate into the single cauldron.\nA thousand days’ labor complete—\nAll phenomena are revealed within.\n\nDo not casually pass on the *huándān*’s art,\nFor sages guard its secrets in their hearts.\nThe age pursues mercury from sand,\nYet fails to see the *Xuān*’s deeper *Xuān*.\n\nAlas, the world extracts cinnabar in vain,\nTaking liquid mercury for *dānshā*—\nLittle do they know the *Xuān*’s true essence of cinnabar.\n\nNine transformations without ceasing purification,\nFrequent purification strengthens the *qi*—\nThe Five Phases favor water’s affinity.\n\nOnly the *dāoguī*’s power completes the elixir,\nGranting the high *zhēn* to gather among the immortals.\n\nThunder roars as the *xùn* wind rages,\nNow the autumn tiger battles the spring dragon.\nThe dragon and tiger devour each other—\nTheir clash echoes like thunder.\n\nThe Primordial Sovereign has the Three Palaces to aid,\nUnshaken, seated in the Nine Enclosures.\nHe abides serenely atop the Three Palaces,\nUndisturbed.\n\nThe *Wèi Zhēn Jun*’s Fire-Criterion Ode says:\n*\"The Three Palaces enfold the embryo’s form,\nReceiving *qi* must mark the *bǐng-dīng* signs.\"*\n\nThe Dao’s gate is not distant,\nYet mortals chase the needle’s edge.\n\nAh, men seek only profit and fame,\nCompeting for trifles—\nWho among the few will surpass the *zhēn* and inherit our way?\n\nThe silent *zhēnlíng*’s work is now complete,\nNo need to seek the *Jīnbì* or *Pāntóngqì*.\nTo know the *Lónghǔ Huándān*’s secret—\nIts essence lies clearly here.\n\nThe *Lónghǔ Huándān*’s precepts are now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "龙虎还丹诀颂 经名：龙虎还丹诀颂。 北宋林太古撰。 谷神子注。 一卷。 底本出处：《正统道藏》太玄部。 龙虎还丹诀颂 余生於巴蜀之地，长居齐鲁之乡。 余者，先生自称也。 先生姓林，名太古，字象先，，道号淳和子。 其先并州太原人，因官生於梁州，洽长访道寻师，多游齐鲁之地。 太宗皇帝知名召见，赐与京兆山居，遂称京兆山人。 后隐居于益州之华阳，复号华阳先生。 久慕安闲，常视寂默。 薄名利，守恬淡，盖其志也。 道本自然之理，化归绵邈之源。 言道以自然为宗，能施用者，则臻於绵邈耳。 考定坎离，指归铅汞。 坎水离火也，铅虎汞龙也。 谓真火真水，真铅真汞也。 颂成还丹诀六十四首。 先圣所迷还丹之要，皆取法易象。 故丹诀六十四首，以拟卦数也。 如有后学详而习之，习而知之，乃见其妙。 自从金室启神炉， 室常珍严，故日金室。 炉能变化丹砂，故日神炉。 荡荡玄风扇八隅。 炉有八面，而风无不扇，故太白君歌日：坛置三层炉八面。 幸得九重观万化， 九重者，鼎器，匡郭阴阳也。 玉囊颂日：古先名作神龙髓，还丹功毕籍九重。 即其义也。 岂无讶咏赞皇图。 皇图者，所以喻神丹之尊贵。 混沌分来我独尊， 万物芸芸，至尊者莫若大丹也。 包含四象立乾坤。 须识天地金木水火之精气，乃能炼成至药也。 还丹须向此中觅，得此方为至妙门。 运用无成，乃造妙门。 时人皆取五金烧，谁识元君在海涛。 时人竞烧水银朱砂，以为灵丹。 岂知金丹之要，自在华池也。 欲炼鼎中红玉粉，先调炉裹白金膏。 《阴符经》云：知之修炼，谓之圣人。 然则辨金膏玉粉者，其唯圣人乎。 凡欲烧丹认取砂，光明鉴面始为佳。 砂者自真铅而产，非世问朱砂也。 陶真人日：砂者，铅中之至宝。 元阳子日：丹砂不用辰锦州，路远应须近处求也。 根基本是青龙骨，仙者呼为白马牙。 青龙者，木也，汞也，汞产於砂也。 尹真人日：丹砂木精。 又日：坏解为水，马齿阑干。 陶真人日：白马牙，好丹砂。 即马牙之称，丹砂之美者也。 八卦神炉五岳形， 炉之形象八卦五岳，立而为之。 中排阳鼎制阴精。 水火互用，阴阳相制也。 君看龙虎交驰处，鼓动风雷百怪惊。 古歌日：五行颠倒衍，龙从火裹出。 五行不顺行，虎向水中生。 水火既在鼎中，则龙虎交驰於内，风雷震动，百怪恐慑也。 才出沧波现杳冥， 金生於水，彰其化育。 鼎中堪重雪花轻。 元阳子日：丹砂为质雪为衣，雪花所以喻其轻明。 莫辞寒暑终阳九，炼出灵光五帝精。 节侯既足，则五行精气变化，而成大丹也。 时人欲炼日晶魂， 还丹以日为魂，月为魄也。 先觅玄源造化根。 玄源灵秘，为药之基。 陶真人下篇日：太玄之精，为道根本也。 后立坎离为匹偶， 坎男离女，匹偶之象。 始交情性合乾坤。 性者，砂汞也。 情者，金也。 《参同契》 日：性主处内，立置鄞鄂。 情主荣外，以筑城郭。 又日：龙为情，虎为性，情性相依，还返之义也。 每见时人论大丹，竞烧八石或居山。 古歌云：八石无非伤赤血，五金多是损黄芽。 时人或居山炼八石，以为大丹者，皆非道也。 不知龙虎真形质，只在玄淇恍惚问。 至药不远，迷者莫悟。 铸金为鼎鼎为真，金鼎真时汞自亲。 古歌日：真鼎元非鼎，故能用真鼎者，则真汞生矣。",
      "translated_text": "**Title: *Ode to the Dragon-Tiger Reversion Elixir Secret***\n\n**Scripture Name:** *Ode to the Dragon-Tiger Reversion Elixir Secret*\n**Author:** Lin Taigu (Northern Song)\n**Annotator:** Gushenzi\n**One scroll**\n**Source:** *Zhengtong Daozang*, Taixuan Section\n\n---\n\n**Ode to the Dragon-Tiger Reversion Elixir Secret**\n\nI was born in the lands of Ba and Shu,\nLong dwelling in Qi and Lu’s domain.\n*\"I\"*—thus the Master named himself.\n\nThe Master bore the surname Lin,\nGiven name Taigu, style Xiangxian,\nDao name Chunhezi.\nHis ancestors hailed from Taiyuan, Jinyi,\nYet by official duty took root in Liangzhou.\nHe sought the Dao through wide inquiry,\nOften wandering Qi and Lu’s lands.\n\nEmperor Taizong, knowing his name, summoned him,\nAnd granted him residence on Jingzhao Mountain—\nThus he was called *Jingzhao Shanren*.\nLater, he secluded himself in Huayang, Yizhou,\nAnd was again named *Huayang Xiansheng*.\n\nFor long he cherished tranquility,\nEver gazing into stillness.\nHe scorned fame and gain,\nGuarding simplicity—\nThis was his true intent.\n\nThe Dao originates from Nature’s principle,\nIts transformation returns to the boundless source.\nSpeaking of the Dao, one takes Nature as foundation;\nThose who apply it skillfully\nAttain the boundless.\n\nExamining the trigrams *Kan* and *Li*,\nPointing to lead and mercury.\n*Kan* is water, *Li* is fire,\nLead is the Tiger, mercury the Dragon.\nThis refers to true fire and true water,\nTrue lead and true mercury.\n\nThe *Ode* completes sixty-four verses on the Reversion Elixir Secret.\nThe ancient sages’ mysteries of the Reversion Elixir\nAll draw upon the *Yijing*’s symbols.\nThus the sixty-four verses of the Elixir Secret\nFollow the number of the hexagrams.\nIf later disciples study them diligently,\nPractice them deeply,\nThey shall perceive their subtlety.\n\nSince the Golden Chamber ignited the divine furnace,\nThe Chamber is ever revered—hence *Golden Chamber*.\nThe furnace transforms cinnabar—hence *Divine Furnace*.\nThe boundless Dao-wind sweeps the eight directions.\nThe furnace has eight faces,\nYet the wind stirs all—\nThus Taibai Jun’s song says:\n*\"The altar holds a three-tiered furnace of eight faces.\"*\n\nFortunate to observe ten thousand transformations in the Nine Enclosures,\nThe Nine Enclosures are the cauldron’s vessel,\nEncompassing yin and yang.\nThe *Jade Pouch Ode* says:\n*\"Anciently, it was named Divine Dragon Marrow;\nThe Reversion Elixir’s completion relies on the Nine Enclosures.\"*\nThis is its meaning.\n\nWho would not marvel at the Imperial Diagram’s praise?\nThe Imperial Diagram refers to the revered status of the divine elixir.\nFrom Chaos’s division, I alone am exalted.\nAmong myriad things, none surpasses the Great Elixir in eminence.\nIt contains the Four Symbols, establishing Heaven and Earth.\nOne must recognize the refined *qi* of Heaven and Earth—\nMetal, Wood, Water, Fire—\nOnly then can the supreme medicine be forged.\n\nThe Reversion Elixir must be sought within this.\nObtaining this is the gate to the utmost subtlety.\nIf applied without mastery,\nIt becomes the gate to marvelous attainment.\n\nCommon folk burn the Five Metals,\nWho knows the Celestial Sovereign dwells in the Azure Pool?\nThe masses compete to burn mercury and cinnabar,\nClaiming it as the spirit elixir.\nYet the essence of the Golden Elixir\nLies within the Hua Pool itself.\n\nTo forge the crimson powder in the cauldron,\nFirst blend the white gold ointment within the furnace.\nThe *Yin-Shu Jing* says:\n*\"To know and refine is to be a Sage.\"*\nThen those who discern the gold ointment and jade powder—\nAre they not the Sages alone?\n\nFor those who wish to burn the elixir, take cinnabar,\nIts luminous clarity must first be verified.\nCinnabar is born from true lead,\nNot the common cinnabar of the world.\nTao Zhenren said:\n*\"Cinnabar is the supreme treasure within lead.\"*\nYuanyangzi said:\n*\"Do not seek cinnabar from Chenjin Prefecture—\nIts journey is long; seek it near instead.\"*\n\nIts root is the Green Dragon’s bone,\nThe Immortals call it White Horse’s tooth.\nThe Green Dragon is Wood, is mercury,\nAnd mercury emerges from cinnabar.\nYin Zhenren said:\n*\"Cinnabar is the essence of Wood.\"*\nAnd again:\n*\"When dissolved, it becomes water;\nWhite Horse’s teeth are scattered.\"*\n\nTao Zhenren said:\n*\"White Horse’s tooth—\nThe finest cinnabar.\"*\n\nThe divine furnace’s eight trigrams take the Five Peaks’ form,\nThe furnace’s shape follows the eight trigrams and Five Peaks,\nStanding thus.\nWithin, the yang cauldron governs the yin essence.\nWater and fire interact,\nYin and yang regulate each other.\n\nObserve where Dragon and Tiger intertwine—\nThe wind and thunder tremble, a hundred demons startled.\nAn ancient song says:\n*\"The Five Phases invert and unfold,\nThe Dragon emerges from fire’s embrace.\nThe Five Phases act disorderly,\nThe Tiger is born within water.\"*\n\nWater and fire being within the cauldron,\nThe Dragon and Tiger surge internally,\nWind and thunder shake—\nA hundred monsters cower in fear.\n\nEmerging from the Azure Waves, it vanishes into darkness,\nGold is born from water, displaying its transformative power.\nWithin the cauldron, heavy as snow, yet light as flowers.\nYuanyangzi said:\n*\"Cinnabar is the substance, snow its attire—\nSnowflakes liken its light and clarity.\"*\n\nDo not shun cold and heat until the Nine Suns of Yang are fulfilled,\nThen the elixir’s luminous essence—\nThe Five Emperors’ refined *qi*—is forged.\n\nCommon folk seek to refine the Sun’s spirit-soul,\nThe Reversion Elixir takes the Sun as soul, the Moon as shadow.\nFirst, seek the mysterious source of transformation’s root.\nThe mysterious source is profound and secret,\nThe foundation of the medicine.\nTao Zhenren’s later text says:\n*\"The essence of Taixuan is the Dao’s fundamental root.\"*\n\nThen establish *Kan* and *Li* as matched pair,\n*Kan* is male, *Li* female—\nThe symbol of a matched pair.\nTheir emotions and nature unite Heaven and Earth.\n*Nature* refers to cinnabar and mercury,\n*Emotion* refers to gold.\nThe *Paramartha Contract* says:\n*\"Nature governs the inner realm,\nPlacing it at Yinyue.\nEmotion governs the outer realm,\nFortifying the city walls.\"*\n\nAnd again:\n*\"The Dragon is emotion, the Tiger is nature;\nEmotion and nature depend on each other—\nThe meaning of return and transformation.\"*\n\nI often see common folk discussing the Great Elixir,\nCompeting to burn the Eight Stones or dwell in mountains.\nAn ancient song says:\n*\"The Eight Stones harm the crimson blood,\nThe Five Metals deplete the yellow shoots.\"*\nThose who burn the Eight Stones in the mountains,\nClaiming them as the Great Elixir—\nAll are misguided.\n\nThey fail to recognize the true forms of Dragon and Tiger,\nWhich lie hidden in the mysterious and elusive.\nThe supreme medicine is not distant—\nYet the bewildered fail to awaken.\n\nCast gold to forge the true cauldron,\nFor when the cauldron is true,\nThe mercury naturally aligns.\nAn ancient song says:\n*\"The true cauldron is not a cauldron—\nOnly by using the true cauldron\nDoes true mercury arise.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1401,
      "start_sentence": 0,
      "end_sentence": 90,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 13.753201723098755,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\龙虎还丹诀颂.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "二物包持成至药，餐之方作出尘人。 非二物包持，则大丹无成也。 乾坤二卦方成体，水火千朝乃见功。 法乾坤二卦，运用水火，千日而成还丹。 故青霞子授茅君谓日：大丹运用千日期，千日赫然成紫芝。 上下两弦通二八，不差毫末应西束。 青霞子日：芽八两为上弦，汞八两为下弦，合为一斤，以应两弦。 故日上下两弦通二八，应药一斤之数也。 金丹秘诀在华池， 神水华池论日：池者，水火也。 又中元论日：华者，火也。 池者，水也。 学者如麻得者稀。 迷迷相指，得者盖寡。 淮王悟此成真后，鸡犬相兼拔宅飞。 汉淮南王刘安，丹成之后，鸡犬舐鼎，亦升云路也。 汞在砂中金在铅，若能如此自通玄。 砂中产汞，铅中产金，自然之妙，知之者乃造真境也。 虽然未得刀圭力，已向人问作地仙。 心悟至宝，非仙而何。 坎裹藏金人不知，离中有水识还稀。 陶真人下篇：金生於月，故坎男也。 流珠生於日，故离女也。 茅真君歌日：阴中有阳，阳中有阴，即是也。 若能认得真金水，白日胶鸾上紫微。 能辨真金真水者，自几跻圣，列位仙官矣。 金花采得是铅精，狎猎鱼鳞雪色轻。 言金花凝结狎猎，若鱼鳞雪彩尔。 若向此中知巧妙，华池金鼎自分明。 火中铅是水中金。 互相为用，变化无穷。 百度逐销色转深。 真精粹和，炼之益妙也。 不遇至人传口诀，只凭经论卒难寻。 大丹秘要，不载经论，圣圣相授，数句口诀而已。 阴裹抽来却属阳，时人不解细消详。 水以煮之，火以炼之，解此义者，丹砂可造。 若能认得阴阳祖，顿入长生不死乡。 能知此道，乃可长生。 地魄天魂是虎龙， 天阳为魂龙也，地阴为魄虎也。 千家经论载朦胧。 前圣赞迷，大道不远。 元阳子日：朦胧只在君家合，日日君看君不知。 时人要识真铅汞，认取金公与水工D 金公铅也，水工汞也。 火裹有铅铅岂锡，木中藏水水非银。 真铅真汞，非世问黑锡水银之类。 直晓真人歌日：不识火铅与水银，纵解万般无所济。 唯赖坎离凭震巽，令教甲乙合庚辛。 甲乙为木，庚辛为金。 尹真人日：丹砂木精，得金乃并。 故坎离震巽，常施用於其问矣。 一池秋水色显显， 九转阴阳降复升。 九转者，自正月至九月也。 古歌曰：第九转，九秋残，黄芽瑞色紫光妍。 吕先生日：上升下降谷神粗。 直待白金港化尽，一团精魄鼎中凝。 金体还丹，方为至宝。 《参同契》日：金来归性初，乃有称还丹。 一气凝为鼎内霜，神仙称是药中王。 诸药惟能疗病，至於还丹刀圭之效，变凡为仙，故为众药之主也。 天然造化如鸡子，外应庚辛裹面黄。 鼎器药物，状同鸡子。 常究《阴符》、《道德经》，此来堪重吕先生。 吕先生名洞宾，盖近代得道也。 养药未论三载火，炼丹直指半升铛。 吕先生诗云：一粒粟中藏世界，半升铛内煮山川。 杳冥中有日精华， 言微妙中有至阳之精，生育万物也。 天地根基万物牙。 志士知之依法炼，自然灵液变河车。 河车即黄芽之别号也。 晋阳子日：乾炼至精为黄芽，坤转数足为河车。 又歌日：河车载甲是君师，密守此道心自知。 炼海逐山制五行，其中擒得向幽冥。 言节制五行，擒捕元气也。 夫人若见真根蒂，请读玄元《道德经》。 玄元皇帝太上老君，所授关令尹喜《道德》五千言，其问备藏还丹真一之旨。",
      "translated_text": "The Two Substances embrace and refine into the Supreme Elixir,\nFeasting upon them makes one a transcendent being of dust.\n\nWithout the embrace of these Two Substances,\nThe Great Elixir will never be complete.\n\nThe *Qian* and *Kun* Hexagrams alone form the essence,\nA thousand mornings of water and fire reveal their efficacy.\n\nPractice the *Qian* and *Kun* Hexagrams,\nEmploy water and fire in their cycles,\nAnd in a thousand days, the Return Elixir is born.\n\nThus, Qingxu Zi instructed Master Mao Jun:\n*\"The Great Elixir, when practiced for a thousand days,\nWill manifest as the radiant Purple Bamboo.\nThe upper and lower strings harmonize the Two Eights,\nTheir alignment precise to the slightest measure, corresponding to the Western Bundle.\"*\n\nQingxu Zi said:\n*\"Eight measures of *huā* (华) as the upper string,\nEight measures of mercury as the lower string—\nCombined, they make one *jin* (斤),\nTo fulfill the measure of the Two Strings.\nThus, the upper and lower strings harmonize the Two Eights,\nTo match the weight of the elixir, one *jin*.\"*\n\nThe secret essence of the Golden Elixir lies in the *Huá* Pool (华池),\nThe Divine Water of the *Huá* Pool teaches:\n*\"The Pool is water and fire.\nAgain, the *Zhōngyuán* (中元) text says:\nThe *huá* (华) is fire,\nThe Pool is water.\nLearners abound, yet masters are rare.\nThe confused point one another to error,\nAnd those who attain are few indeed.\"*\n\nWhen Huai Wang (淮王) realized this, he became a True Immortal (真后),\nHis chickens and dogs ascended together, abandoning their homes to fly.\nThe Han Huai Nan Wang (淮南王) Liu An (刘安),\nAfter refining the elixir, his chickens and dogs licked the cauldron,\nAnd they too ascended to the Cloud Path (云路).\n\nMercury dwells within the sand,\nGold within the lead—\nIf one can thus intuit the Mysterious,\nThe profound secrets will naturally unfold.\n\nThe sand yields mercury,\nThe lead yields gold,\nA marvel of Nature—\nOnly those who grasp it enter the True Realm (真境).\n\nThough they have not yet attained the *Dāoguī* (刀圭) power,\nThey already strive to become Earthly Immortals (地仙).\nWhen the heart comprehends the Supreme Treasure,\nWhat else is it but Immortality?\n\nThe *Kàn* Hexagram enfolds gold, yet few know,\nThe *Lí* Hexagram contains water, yet few recognize.\n\nTao Zhengren’s lower chapter (下篇) states:\n*\"Gold is born from the Moon, thus *Kàn* is male.\nThe flowing pearl (流珠) arises from the Sun, thus *Lí* is female.\"*\nMao Zhengjun’s song declares:\n*\"Within the yin lies the yang,\nWithin the yang lies the yin—\nThis is the truth.\"*\n\nIf one can discern the True Gold and True Water,\nBy daylight, they ascend to the Purple Weft (紫微).\n\nThose who can distinguish True Gold and True Water,\nShall swiftly attain sainthood,\nRanking among the celestial immortals (列位仙官).\n\nThe Golden Flower, when plucked, is the essence of lead,\nChased like prey, its scales shimmer as light as snow.\nIt speaks of the Golden Flower congealing like scattered scales,\nAs delicate as snowflakes in hue.\n\nIf one understands the subtleties within this,\nThe *Huá* Pool and Golden Cauldron will reveal themselves.\n\nLead enfolded in fire is gold within water—\nMutually employed, their transformations are boundless.\n\nAs the hundred refinements proceed, the hue deepens,\nThe True Essence harmonized—\nRefining it further enhances its marvel.\n\nWithout encountering a Sage to transmit the oral precepts,\nRelying solely on scriptures and commentaries,\nThe Great Elixir’s secrets remain elusive.\nIt is not recorded in scriptures or commentaries,\nBut passed down from Sage to Sage—\nA few lines of oral precepts suffice.\n\nYin enfolded, drawn forth, belongs to yang,\nYet common folk fail to grasp its fine details.\n\nWater cooks it, fire refines it—\nThose who understand this principle\nCan forge the elixir from cinnabar.\n\nIf one can recognize the Primordial Yin and Yang,\nThey shall enter the Realm of Everlasting Life.\n\nThe Earthly Essence and Heavenly Soul are the Tiger and Dragon—\nHeavenly Yang is the Dragon’s Soul,\nEarthly Yin is the Tiger’s Essence.\nA thousand families’ texts describe them in vague terms.\n\nAncient Sages praised confusion,\nSaying the Dao is not far.\nYuan Yang Zi (元阳子) declared:\n*\"Confusion lies solely in the union of your family’s art,\nDay after day, you gaze yet fail to see.\"*\n\nCommon folk seek to recognize True Lead and True Mercury,\nIdentifying the Golden Master (金公) as lead\nAnd the Water Artisan (水工) as mercury.\n\nFire enfolds lead—lead is not tin,\nWood conceals water—water is not silver.\n\nTrue Lead and True Mercury\nAre not the mundane black tin and quicksilver.\n\nOnly when you grasp the True Sage’s song,\n*\"Not knowing fire-lead and water-mercury,\nThough you master a thousand arts, it profits nothing.\"*\n\nRely only on *Kàn* and *Lí*, aided by *Zhèn* and *Sǔn*,\nTo teach the union of *Jiǎ* and *Yǐ* with *Gēng* and *Xīn*.\n*Jiǎ* and *Yǐ* are wood,\n*Gēng* and *Xīn* are metal.\n\nYin Zhengren (尹真人) said:\n*\"Cinnabar is the essence of wood,\nAnd when it obtains gold, they merge.\"*\n\nThus, *Kàn*, *Lí*, *Zhèn*, and *Sǔn*\nAre always applied in their interplay.\n\nA single Pool of autumn water reveals its hue,\nNine cycles of yin and yang descend then ascend.\nThe Nine Cycles are from the first month to the ninth month.\nAn ancient song says:\n*\"The ninth cycle, autumn’s end,\nThe Yellow Shoot’s auspicious form shines,\nIts purple light resplendent.\"*\n\nLu Master (吕先生) said:\n*\"The coarse *Gǔshén* (谷神) ascends and descends.\nWait until the White Gold fully melts,\nThen a single cluster of Elixir Essence congeals within the cauldron.\"*\n\nThe Golden Body returns as the Elixir—\nThis alone is the Supreme Treasure.\n*The Cansong Contract* (《参同契》) says:\n*\"When gold returns to its original nature,\nIt is then called the Return Elixir.\"*\n\nOne breath congeals into the frost within the cauldron,\nThe Sages of Immortality call it the King of Elixirs.\nAll other medicines cure ailments,\nBut the Return Elixir and *Dāoguī* (刀圭) transform mortals into immortals,\nThus it is the sovereign of all medicines.\n\nNature’s creation is like a chicken egg,\nExternally corresponding to *Gēng* and *Xīn* wrapped in yellow.\nThe cauldron and elixir resemble the egg’s form.\nAlways study the *Yīnfú* (《阴符》) and *Dàodé Jing* (《道德经》),\nFor Lu Master’s teachings are profound.\n\nLu Master, named Dongbin (洞宾),\nWas a Sage of recent times.\n\nNurturing the elixir requires not three years of fire,\nRefining the Golden Elixir points directly to half a *shēng* (升) cauldron.\nLu Master’s verse:\n*\"A single grain of millet contains a world,\nHalf a *shēng* cauldron boils mountains and rivers.\"*\n\nIn the boundless void, the Sun’s essence shines,\nSpeaking of the subtle marvels of the Primordial Yang,\nWhich nurtures all things.\n\nThe roots of Heaven and Earth are the teeth of all things.\nAspiring scholars, knowing this, refine according to the method,\nAnd the natural elixir transforms into the *Héchē* (河车).\n*Héchē* is another name for the Yellow Shoot.\n\nYangzi (阳子) of the Jin (晋) said:\n*\"Refining in *Qian* yields the Yellow Shoot,\nTurning in *Kun* produces the *Héchē* (河车).\"*\nAgain, his song:\n*\"The *Héchē* bears *Jiǎ* as your master,\nGuard this path with secrecy—your heart will know.\"*\n\nRefining the seas, subduing the mountains, regulating the Five Phases,\nWithin it, you capture the essence of the void.\nIt speaks of controlling the Five Phases,\nSeizing the Primordial Qi (元气).\n\nIf mortals but see the True Root,\nThey should read the *Dàodé Jing* of the Primordial Emperor, the Most High Laozi (太上老君),\nWho instructed the Gatekeeper Guan (关令) Yin Xi (尹喜) with the Five Thousand Words of the *Dàodé Jing*,\nWhose essence fully contains the True One of the Return Elixir.",
      "overlap_context": "se who burn the Eight Stones in the mountains,\nClaiming them as the Great Elixir—\nAll are misguided.\n\nThey fail to recognize the true forms of Dragon and Tiger,\nWhich lie hidden in the mysterious and elusive.\nThe supreme medicine is not distant—\nYet the bewildered fail to awaken.\n\nCast gold to forge the true cauldron,\nFor when the cauldron is true,\nThe mercury naturally aligns.\nAn ancient song says:\n*\"The true cauldron is not a cauldron—\nOnly by using the true cauldron\nDoes true mercury arise.\"*",
      "start_char": 1402,
      "end_char": 2812,
      "start_sentence": 91,
      "end_sentence": 170,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 23.281710147857666,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\龙虎还丹诀颂.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "兔走乌飞西复束，百年全似梦魂中。 人问有个长生路，贪恋浮华死不穷。 《神农经》日：知白守黑，求死不得。 欺世人不知仙圣度世之衍，但汲汲於浮华，而遽至顶灭。 一中有一最难寻，名列西方位属金。 一，水也。 水中之一，白金也。 陶真人日：三五与一，天地之至精。 金为水母，母隐子胎。 水者金子，子藏母胞。 又日：白者金精，黑者水基。 水者道枢，其数名一也。 志士探之知则例，自然黑白两浮沈。 黑者铅也，白者银也。 铅沈银浮，自然之妙。 天地炉烹日月晶，庚金甲木自相并。 人能认取真金木，万化都来掌上轻。 晓达金木之旨，则造化归乎掌握。 陶真人下篇日：得之者天地在乎手，造化在乎身，自几跻圣，列仙籍矣。 悟了还如涉大川， 悟者涉川，无有阻碍。 常修阴德感明天。 若为不道兼轻露，必有神灵致祸愆。 苟不修功行，而泄秘理，则殃祸及之。 万卷仙经理尽同，还丹不离五行中。 不离五行，五行能为至药。 欲知九转阴阳足，只候三年水火功。 千日水火，乃成大丹。 微微收得木中津，自黍成参积到斤。 从无入有，积少成多。 力倦心疲宁不苦，大都先圣总辛葱。 言先圣皆由恋志，而得度也。 煮石烹金炼太玄，神仙不许等闲传。 用药之要，神仙宝秘，世莫得闻也。 人能认得玄中理， 玄是药之根基，识者功参造化也。 胜秉乾坤造化权。 一月还丹发兆基，阴阳相感达希夷。 希夷，谓杳冥之道也。 潜龙位应於初九，阳气先须起子时。 潜龙十一月之位，火符取法初九，一阳生子时为首也。 二月青龙渐见形，微微钻集五行精。 木汞凝精，渐彰灵液。 葱知火候温和色，鼎内令闻虎啸声。 茆真君曰：寒暑相返，虎啸龙吟。 三月灵丹号小还， 三年为大还，三月为小还。 小还凝结类真铅。 直须用意调文武，莫遣阴阳气候愆。 固济周密，恋知火候，渐见汞铅。",
      "translated_text": "The hare flees, the crow flies, and the West is bound—\nA hundred years pass like a dream within the soul.\n\nWhen mortals ask of the path to eternal life,\nTheir greed for transient glory brings endless death.\n\nThe *Shénnóng Jīng* (神农经) says:\n*\"Knowing white and preserving black,\nYou seek death but cannot find it.\"*\n\nIt deceives the world, unaware of the Daoist Immortals’ way of transcending life.\nThey only hasten toward the mundane, yet swiftly reach annihilation.\n\nWithin the One, the true One is most difficult to seek,\nIts name ranks in the West, its nature is gold.\n\nThe One is water.\nWithin water, the One is white gold.\n\nThe True Immortal Tao (陶真人) said:\n*\"Three and five unite with the One,\nThe utmost essence of Heaven and Earth.*\n\nGold is the mother of water,\nThe mother concealed, the child within the womb.\nWater is the child of gold,\nThe child hidden within the mother’s matrix.\n\nAgain, he said:\n*'White is the essence of gold,\nBlack is the foundation of water.*\n\nWater is the pivot of the Dao,\nIts number is called the One.\n\nThe determined seeker, knowing this, follows its principle—\nNaturally, black and white float and sink in harmony.\n\nBlack is lead,\nWhite is silver.\nLead sinks, silver floats—\nThe marvel of nature’s balance.\n\nHeaven and Earth’s furnace refines the essence of the sun and moon,\nRegal gold and primeval wood merge in their own accord.\nIf mortals recognize the true gold and wood,\nAll transformations come effortlessly to their grasp.\n\nTo grasp the meaning of gold and wood,\nThen the workings of creation rest in their hands.\n\nThe True Immortal Tao’s lower scripture says:\n*\"He who attains it holds Heaven and Earth in his palm,\nCreation in his body—\nAscending to sainthood,\nEnrolling in the ranks of the Immortals.*\n\nAwakening to this is like crossing a great river—\nThe enlightened cross without hindrance.\n\nAlways cultivate hidden virtue to move the Bright Heaven.\nIf you act contrary to the Dao and reveal its mysteries,\nThe spirits will surely bring misfortune upon you.\nIf you do not refine your practice yet disclose its secrets,\nDisaster will follow.\n\nAll volumes of Immortal scriptures share the same principle,\nThe Return Elixir never strays from the Five Phases.\n\nNever straying from the Five Phases,\nThe Five Phases become the supreme medicine.\n\nTo know the ninefold transformations of yin and yang complete,\nObserve the three-year process of water and fire.\n\nA thousand days of water and fire,\nAnd the Great Elixir is formed.\n\nGently gather the dew of wood,\nFrom a peck to a bushel, then to a weight.\nFrom nonexistence to existence,\nFrom little to much.\n\nExhaustion and fatigue—is the labor not bitter?\nYet the ancient sages endured such hardship.\n\nThey spoke of the ancients all being bound by ambition,\nYet attaining transcendence through it.\n\nBoiling stones, refining gold, and alchemizing the *Tàixuān* (太玄),\nThe Immortals do not permit its casual transmission.\n\nThe essentials of its use—\nA treasure of the Immortals, unknown to the world.\n\nIf mortals recognize the principle within the *Xuān* (玄),\nThe *Xuān* is the root of the medicine—\nThose who perceive it refine their power to match creation.\n\nThey grasp the authority of Heaven and Earth’s transformations.\n\nThe Return Elixir’s omen appears in the first month,\nAs yin and yang interact to reach *Xīyí* (希夷).\n\n*Xīyí*—the path of profound obscurity.\n\nThe hidden dragon’s position corresponds to the initial nine,\nWith the fire symbol drawn from the *Chūjiǔ* (初九).\nThe first emergence of yang at the child hour is the beginning.\n\nIn the second month, the green dragon begins to manifest,\nGathering the subtle essences of the Five Phases.\n\nWood and mercury congeal their essence,\nGradually revealing the spirit elixir.\n\nOne who knows the fire’s tempered warmth and hue,\nWill hear the tiger’s roar within the cauldron.\n\nThe True Immortal Tao (茆真君) said:\n*\"Cold and heat return in cycles,\nThe tiger roars, the dragon hums.\"*\n\nIn the third month, the spirit elixir is called the *Xiǎo Huán* (小还).\nThree years make the *Dà Huán* (大还), three months the *Xiǎo Huán*.\n\nThe *Xiǎo Huán* congeals like true lead.\nYou must regulate with intent the harmony of *Wén* (文) and *Wǔ* (武),\nLest yin and yang’s timing be misplaced.\n\nSecure and meticulous—\nCling to the fire’s temper,\nGradually revealing mercury and lead.\"",
      "overlap_context": "art will know.\"*\n\nRefining the seas, subduing the mountains, regulating the Five Phases,\nWithin it, you capture the essence of the void.\nIt speaks of controlling the Five Phases,\nSeizing the Primordial Qi (元气).\n\nIf mortals but see the True Root,\nThey should read the *Dàodé Jing* of the Primordial Emperor, the Most High Laozi (太上老君),\nWho instructed the Gatekeeper Guan (关令) Yin Xi (尹喜) with the Five Thousand Words of the *Dàodé Jing*,\nWhose essence fully contains the True One of the Return Elixir.",
      "start_char": 2813,
      "end_char": 3612,
      "start_sentence": 171,
      "end_sentence": 220,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 12.280311822891235,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\龙虎还丹诀颂.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "火记日； 首尾文，中心武。 故日文武也。 四月功成已立魂， 如子在胎，魂神生矣。 青龙白虎竞相吞。 此时玉液潜凝结，阳立阴销虎渐奔。 五月阴阳二气交，黄芽渐渐长灵苗。 五月诟卦，阳初遇阴，二气交感，渐孕灵芽。 灵苗便是长生药，水火仍须应候调。 六月真阴结就砂，迷徒将甚作河车。 殷葱为报同人道，莫向时流取次夸。 先圣严诫，不许轻泄。 七月潜通药已成，青黄赤白状难明。 阴阳之气渐盛，则颜色变易无常。 全凭水火无私力，炼得阴阳二气精。 非水火运用，二气无由降精。 八月循还到兑官， 兑金应候。",
      "translated_text": "The fire’s record marks the days:\nAt the start and end, *Wén* (cultivation), at the core, *Wǔ* (transformation).\nThus, it is called *Wén-Wǔ* (cultivation-transformation).\n\nBy the fourth month, the work is complete—\nThe soul is established, as a child in the womb,\nAnd the spirit is born.\n\nThe Green Dragon and White Tiger contend, devouring each other.\nAt this time, the *Yù Yè* (jade liquid) subtly congeals,\nAs yang solidifies and yin dissipates—the tiger flees in haste.\n\nIn the fifth month, yin and yang qi intermingle,\nAnd the yellow sprout gradually nurtures the sacred seedling.\nThe fifth month’s *Gòu* (coalescence) hexagram:\nWhen yang first meets yin, the two qi harmonize,\nGradually gestating the sacred sprout.\n\nThis sacred seedling is the elixir of longevity—\nWater and fire must still be attuned to the seasons.\n\nIn the sixth month, true yin solidifies into the *shā* (sand),\nWhile deluded practitioners vainly seek the *Hé Chē* (river cart).\n*Yīn Cōng* (殷葱) warns the *Tóng Rén* (fellow Daoists):\nDo not boast in vain to the passing trends.\nThe ancient sages sternly forbade\nRevealing this lightly.\n\nBy the seventh month, the medicine is secretly perfected,\nIts green, yellow, red, and white forms indistinct.\nAs yin and yang qi grow stronger,\nIts hues shift without constancy.\nRely entirely on water and fire’s impartial force,\nRefining the essence of yin and yang qi.\n\nWithout the interplay of water and fire,\nThe two qi cannot condense their essence.\n\nIn the eighth month, the cycle returns to the *Duì* (joy) phase,\nWhere metal aligns with the season’s mandate.",
      "overlap_context": " the cauldron.\n\nThe True Immortal Tao (茆真君) said:\n*\"Cold and heat return in cycles,\nThe tiger roars, the dragon hums.\"*\n\nIn the third month, the spirit elixir is called the *Xiǎo Huán* (小还).\nThree years make the *Dà Huán* (大还), three months the *Xiǎo Huán*.\n\nThe *Xiǎo Huán* congeals like true lead.\nYou must regulate with intent the harmony of *Wén* (文) and *Wǔ* (武),\nLest yin and yang’s timing be misplaced.\n\nSecure and meticulous—\nCling to the fire’s temper,\nGradually revealing mercury and lead.\"",
      "start_char": 3612,
      "end_char": 3884,
      "start_sentence": 221,
      "end_sentence": 239,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 4.9951136112213135,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\龙虎还丹诀颂.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "却归元体色显显。 仍须谨密牢神室， 神室，即安药之所也。 养就长生火里龙。 火龙成就，人得长生。 九月含灵汞已乾，一壶霜雪逼人寒。 药渐凝精，色同霜雪。 莫将点化浮生宝，直候功成作大还。 若便食利，点化世宝，即灵丹无成也。 十月金丹已脱胎，此时才始作婴孩。 仙圣喻金丹如果在树，如子在胎，莫测其作，育至十月，则脱胎而为婴孩矣。 婴孩便是还丹质，谁信无中养得来。 自虚无而有形质，非天下之至精乎。 阴魄销来阳自立，白金灰后赤龙成。 鼎内只知凝翠玉，炉中不见有黄轻。 变化融结，相须如神。 腾倒频频去宿尘， 腾倒所以增其气数。 《太易歌》日：微微腾倒天地精，钻簇阴阳走神鬼也。 莫辞迟久更殷恋。 龙争虎战终还始，",
      "translated_text": "The essence now returns to the **Duì** phase’s brilliance,\nYet still one must guard the **shén shì** (神室) with utmost care—\nThe **shén shì**, where the medicine is nurtured.\nCultivate the **Chángshēng Huǒlóng** (长生火里龙) within its depths.\nWhen the **Huǒlóng** (火龙) is perfected, humans attain **Chángshēng** (长生).\n\nBy the ninth month, the **Hánlíng Gōng** (含灵汞) is fully dry,\nA single jar of frost and snow chills the world.\nThe medicine condenses its essence, its form like frost and snow.\nDo not hastily claim the **fúshēng bǎo** (浮生宝) as a fleeting treasure,\nBut wait until its completion for the **Dà Huán** (大还).\n\nIf one greedily consumes its benefits,\nAnd recklessly claims the world’s treasure as perfected,\nThen the **língdān** (灵丹) will never be realized.\n\nBy the tenth month, the **Jīndān** (金丹) has shed its embryonic form,\nNow it truly begins as a **yīng’ái** (婴孩).\nThe **xiānshèng** (仙圣) liken the **Jīndān** to a child in the womb,\nOr a seed upon the tree—its workings are unfathomable.\nWhen nurtured to the tenth month,\nIt sheds its embryonic form and becomes a **yīng’ái** (婴孩).\n\nThis **yīng’ái** is the very essence of **Huán Dān** (还丹),\nYet who would believe it arises from the void?\nFrom **xūwú** (虚无) to tangible form,\nIs this not the **ultimate refinement** (至精) in all under heaven?\n\nWhen the **yīn pò** (阴魄) is consumed, the **yáng** (阳) stands firm,\nThe **bái jīn** (白金) gives way to the **húilóng** (灰后赤龙).\nWithin the **dǐng** (鼎), only the **níng cuìyù** (凝翠玉) is known,\nIn the **lú** (炉), no trace of **huáng qīng** (黄轻) remains.\nTransformation and fusion proceed with divine precision,\nInterdependent as **yīn** and **yáng** in their celestial harmony.\nTossing and turning, it repeatedly purges **sùchén** (宿尘),\nFor **tēngdǎo** (腾倒) serves to amplify its **qìshù** (气数).\n\nThe *Tài Yì Gē* (太易歌) states:\n*\"Wēiwēi tēngdǎo tiāndì jīng,\nZhuān cù yīn yáng zǒu shén guǐ yě.\"*\nDo not complain of sluggishness or cling to delay.\nThe **lóng zhēng hǔ zhàn** (龙争虎战) must ultimately return to its **shǐ** (始).",
      "overlap_context": "y forbade\nRevealing this lightly.\n\nBy the seventh month, the medicine is secretly perfected,\nIts green, yellow, red, and white forms indistinct.\nAs yin and yang qi grow stronger,\nIts hues shift without constancy.\nRely entirely on water and fire’s impartial force,\nRefining the essence of yin and yang qi.\n\nWithout the interplay of water and fire,\nThe two qi cannot condense their essence.\n\nIn the eighth month, the cycle returns to the *Duì* (joy) phase,\nWhere metal aligns with the season’s mandate.",
      "start_char": 3885,
      "end_char": 4223,
      "start_sentence": 240,
      "end_sentence": 260,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 8.17102336883545,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\龙虎还丹诀颂.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "阴退阳滋药渐真。 龙虎互相为用，药渐通灵。 元阳子歌日：青龙逐虎虎寻龙，所谓龙争虎战者也。 炼得阴精却返元，神仙呼作白琅圩。 琅吁盖为金丹之别号，言洁白如玉之美也。 时人不见真形质，将谓还丹色似丹。 《神水华池论》日：还者归根，丹者色赤也。 一源三物契三才， 陶真人中篇日：立乾坤，运水火，应天符，合三才，然后成丹砂矣。 是知金丹虽处一源，而用三物，同烧共一门也。 交感阴阳结圣胎。 自然成胎，名之日圣。 水火数中君自见，紫河车就彩鸾来。 无名道者歌曰：修到紫河车，白日冲天去。 华池神水始知能， 《神水华池论》日：华池者铅，神水者汞也。 一振秋波彻底清。 炼入鼎中阳火逼，",
      "translated_text": "The **yīn** retreats while the **yáng** flourishes—**yào** grows ever truer.\nThe **lóng** and **hǔ** mutually engage, and the **yào** gradually attains **tōnglíng** (通灵).\n\nThe *Yuánsāng Zǐ Gē* (元阳子歌) says:\n*\"Qīnglóng zhú hǔ, hǔ xúnlóng,\nSuǒwèi lóng zhēng hǔ zhàn zhě yě.\"*\nWhen the **yīn** essence is refined and returned to its **yuán** (元) source,\nThe **shénxiān** (神仙) call it **báilángxū** (白琅圩).\n**Lángxū** (琅吁) is but another name for **jīndān** (金丹),\nSpeaking of its purity like jade’s resplendent grace.\n\nThe common folk fail to grasp its true form,\nAnd suppose the **huándān** (还丹) resembles **dānshā** (丹砂) in hue.\nThe *Shénshuǐ Huápó Lùn* (神水华池论) states:\n*\"Huán zhě guī gēn, dān zhě sè chì yě.\"*\nFrom one origin, three substances align with the **sāncài** (三才),\nThe *Táozhēn Rén Zhōng Piān* (陶真人中篇) declares:\n*\"Lì qiánkūn, yùn shuǐhuǒ, yīng tiān fú, hé sāncài,\nRánhòu chéng dānshā yǐ.\"*\nThus, though **jīndān** (金丹) springs from a single source,\nIt employs three substances—**shuǐ**, **huǒ**, and **yào**—\nAll refined through one **mén** (门).\n\nThe **yīn** and **yáng** interact, forming the **shèng tāi** (圣胎).\nNaturally nurtured, it is called **shèng** (圣).\nWhen the **shuǐhuǒ qìshù** (水火气数) are balanced, the **jūn** (君) reveals itself,\nThe **zǐhéchē** (紫河车) manifests with the **cǎilián** (彩鸾).\n\nThe *Wúmíng Dào Zhě Gē* (无名道者歌) sings:\n*\"Xiū dào zǐhéchē, báirì chōng tiān qù.\"*\nThe **huápó** (华池) **shénshuǐ** (神水) alone proves its efficacy,\nAs the *Shénshuǐ Huápó Lùn* (神水华池论) states:\n*\"Huápó zhě qiān, shénshuǐ zhě gōng yě.\"*\nWith one ripple of the autumn wave, clarity penetrates to the depths.\nRefined within the **dǐng** (鼎), **yánghuǒ** (阳火) presses close,",
      "overlap_context": " of **huáng qīng** (黄轻) remains.\nTransformation and fusion proceed with divine precision,\nInterdependent as **yīn** and **yáng** in their celestial harmony.\nTossing and turning, it repeatedly purges **sùchén** (宿尘),\nFor **tēngdǎo** (腾倒) serves to amplify its **qìshù** (气数).\n\nThe *Tài Yì Gē* (太易歌) states:\n*\"Wēiwēi tēngdǎo tiāndì jīng,\nZhuān cù yīn yáng zǒu shén guǐ yě.\"*\nDo not complain of sluggishness or cling to delay.\nThe **lóng zhēng hǔ zhàn** (龙争虎战) must ultimately return to its **shǐ** (始).",
      "start_char": 4223,
      "end_char": 4538,
      "start_sentence": 261,
      "end_sentence": 278,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 8.276001691818237,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\龙虎还丹诀颂.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "依依时有虎龙声。 逼以离火，鼓以巽风，即虎龙交战，声闻于外。 口中餐少体犹寒，岂惮迢迢岁月难。 坚意自於恋裹觅，不将行止贵门干。 高尚其事，不事王侯。 九还七返义难寻， 青霞子日：自十一月至七月，为九还。 自正月至七月，为七返。 气结为砂水变金。 砂从气结，金自水生。 会得五行并四象，自然龙向鼎中钦。 能用五行四象，则龙在鼎中钦应也。 昆仑山下得玄珠，二物元同一处居。 玄珠以喻至宝也，二物指药根基也。 古歌日：两物如知生一体，三花方悟隐孤轮也。 炼得阴阳元气足，始知成立自虚无。 兀兀陶陶钝又痴，无心无事复无机。 一从认得希夷旨，始觉玄门路好归。 先生自言乐於幽奇，玄妙之门也。 休慕腥膻爱绮罗，长生门路好来过。 争名争利贪痴者，不顾流年似逝波。 欺愍世人肆志声色，责染名利，不入长生门路，遂至衰顶，如逝波之不返也。 汞变为金金变砂，金砂渐变紫河车。 金砂气足，乃作河车。 修丹若得河车就，应去蓬莱路不赊。 至药炳灵，神仙可冀。 乾坤鼎就虎龙成，四象回旋二气并。 会得华池真正诀，自然丹向此中生。 知四象推迁，识二气交感，然后丹砂化生。 无中生有有还无， 无而忽有，有而忽无，恍惚杳冥，至精诞育。 日月交驰在碧虚。 不遇至人传口诀，",
      "translated_text": "「Then there are the faint yet frequent roars of tigers and dragons.\nPress them with **lífhuǒ** (离火), stir them with **xùnfēng** (巽风),\nAnd the tigers and dragons clash in battle—\nTheir thunder heard beyond the forge.\n\nThough the mouth consumes little, the body remains cold,\nHow could one dread the slow march of years?\nWith steadfast resolve, one seeks within the embrace of **liàn** (炼),\nYet shuns the **xíngzhǐ guìmén** (行止贵门) of the vulgar.\n\nNoble in pursuit, one does not serve kings or nobles.\nThe *Jiǔ Huán Qī Fǎn* (九还七返) is hard to grasp—\n**Qīng Xī Zǐ** (青霞子) says:\nFrom the eleventh month to the seventh month, it is called **jiǔ huán** (九还).\nFrom the first month to the seventh month, it is called **qī fǎn** (七返).\nWhen **qi** (气) condenses into **shā** (砂), and **shuǐ** (水) transforms into **jīn** (金),\nThe **jūn** (君) arises from the interplay of **shuǐhuǒ qìshù** (水火气数).\n\nTo master the **wǔxíng** (五行) and **sìxiàng** (四象),\nThe dragon naturally bows in reverence within the **dǐng** (鼎).\nIf one can employ the **wǔxíng** (五行) and **sìxiàng** (四象),\nThen the dragon’s bow will respond in kind.\n\nBeneath **Kūnlún Shān** (昆仑山), the **xuánzhū** (玄珠) is found—\nTwo substances dwell in one source.\nThe **xuánzhū** (玄珠) is likened to the supreme treasure,\nThe two substances refer to the **yàogēn jī** (药根基).\n\nAn ancient song declares:\n*\"If two substances are known to unite as one,\nThen the three flowers will reveal the hidden solitary wheel.\"*\nWhen the **yīnyáng yuánqì** (阴阳元气) are refined to sufficiency,\nOne knows the **jīndān** (金丹) originates from the void.\n\nDull and obtuse, yet simple and unassuming,\nWithout intention, without contrivance, without scheme—\nOnce the **xīyí zhì** (希夷旨) is recognized,\nOne finds the **Xuánmén** (玄门) path worth returning to.\n\nThe Master himself spoke of delight in the profound and mysterious—\nThe **Xuánmiào** (玄妙) **Xuánmén** (玄门) indeed.\nThough he scorns the coarse and vulgar, he loves the refined and elegant,\nFor the path to **chángshēng** (长生) is worth traversing.\n\nThose who greedily chase fame and gain, enslaved by **chī** (痴),\nDo not heed the **liúnián** (流年) as it flees like passing waves.\nThey deceive and mock the world, indulging in desires and sensuous pleasures,\nSeeking **mínglì** (名利), yet never entering the **chángshēng** (长生) path,\nAnd so they meet decline—\nLike waves that never return.\n\n**Gōngyīn** (汞) transforms into **jīn** (金), **jīn** (金) into **shā** (砂),\nAnd **jīnshā** (金砂) gradually becomes **zǐhéchē** (紫河车).\nWhen the **jīnshā** (金砂) **qi** (气) is abundant,\nIt forms the **zǐhéchē** (紫河车).\nIf one refines **jīndān** (金丹) and attains the **zǐhéchē** (紫河车),\nThen the path to **Pénglái** (蓬莱) will be without delay.\n\nThe supreme elixir shines with **líng** (灵) efficacy,\nAnd **shénxiān** (神仙) may yet be hoped for.\nWhen the **qiántǔn** (乾坤) are aligned in the **dǐng** (鼎),\nAnd the **tǔlóng** (虎龙) are formed,\nThe **sìxiàng** (四象) revolve harmoniously, the **èrqì** (二气) unite—\nTo grasp the **Huápó** (华池)’s true essence,\nThe **jīndān** (金丹) will naturally arise.\n\nUnderstanding the **sìxiàng** (四象) in their shifts,\nRecognizing the **èrqì** (二气) in their interplay,\nThen **jīndān** (金丹) and **shā** (砂) will transform and take form.\nFrom **wú** (无) arises **yǒu** (有), and **yǒu** (有) returns to **wú** (无)—\nNow present, now absent,\nFaint and elusive as the utmost precision is nurtured.\nThe **rìyuè** (日月) drive each other across the **bǐqū** (碧虚).\n\nWithout meeting a **zhìrén** (至人) to teach the oral **kè** (诀),",
      "overlap_context": "the **shuǐhuǒ qìshù** (水火气数) are balanced, the **jūn** (君) reveals itself,\nThe **zǐhéchē** (紫河车) manifests with the **cǎilián** (彩鸾).\n\nThe *Wúmíng Dào Zhě Gē* (无名道者歌) sings:\n*\"Xiū dào zǐhéchē, báirì chōng tiān qù.\"*\nThe **huápó** (华池) **shénshuǐ** (神水) alone proves its efficacy,\nAs the *Shénshuǐ Huápó Lùn* (神水华池论) states:\n*\"Huápó zhě qiān, shénshuǐ zhě gōng yě.\"*\nWith one ripple of the autumn wave, clarity penetrates to the depths.\nRefined within the **dǐng** (鼎), **yánghuǒ** (阳火) presses close,",
      "start_char": 4538,
      "end_char": 5114,
      "start_sentence": 279,
      "end_sentence": 311,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 14.579359769821167,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\龙虎还丹诀颂.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "空劳读尽五车书。 真经日：少则得，多得惑。 又日：无师执文，终无得理。 是知不遇至人传口诀，则博览无益矣。 长生基址是黄芽， 夫黄芽者，药之真质也。 狐刚子问 魏公日：黄芽何物为之。 魏公日：用铅不用铅，五金生於铅之精也。 青霞子日：芽若是铅，奔铅万里。 芽若非铅，从铅而始。 铅为芽母，芽为铅子。 既得金华，拾铅不使。 又日：灰池炎铄，铅沈银浮，谓之黄轻，亦日金华，亦日秋石，亦日黄芽，又日王阳。 名黄芽，以其色黄也。 如万物之初芽，故日黄芽。 得者为长生之宝也。 制伏令归戊己家。 戊己，鼎器也。 老君歌日：戊己是元基，水火定优劣。 又日：须达戊己功，不得言於铁。 玉囊颂日：欲知大药立元基，须得中央戊己土。 直候水银成白液，方将白液作丹砂。 丹砂自金液而生也。 麻衣蓬弊处埃尘，落魄狂游混此身。 自有清澄一泓水，不求名利不求人。 言自有水中之宝，不求豪贵，不务簪缨。 黄精赤髓结为砂， 黄精则黄芽之精也。 金碧歌日：赤髓流为汞，汞结为砂。 白虎青龙本一家。 白虎青龙者，皆强名，本金木之气耳，混合为凝粹成丹也。 只在眼前皆不识，却将杂类作黄芽。 《 参同契》 日：同类者相从，事乖不成宝。",
      "translated_text": "It is futile to read through the five chariots of books in vain.\nThe true scripture says: *\"A little one may gain, much one may be confused.\"*\nIt also says: *\"Without a master, one clings to texts—never truly comprehending the Way.*\nThus, it is known that without meeting a **zhìrén** (至人) to teach the oral **kè** (诀),\neven vast reading yields no benefit.\n\nThe foundation of longevity lies in **huángyá** (黄芽).\nFor **huángyá** (黄芽) is the true essence of the elixir.\nWhen **Húgāngzǐ** (狐刚子) asked **Wèigōng** (魏公):\n*\"What is **huángyá** (黄芽) made of?\"*\n**Wèigōng** (魏公) replied:\n*\"It is lead, yet not lead—five metals arise from the refined **qi** (精) of lead.\"*\n\n**Qīngxīzǐ** (青霞子) said:\n*\"If it is lead, why chase lead ten thousand miles?\nIf it is not lead, why begin with lead?\"*\nLead is the **mother** of **huángyá** (黄芽),\nAnd **huángyá** (黄芽) is the **child** of lead.\nOnce **jīnhuá** (金华) is attained,\nNo need to gather lead again.\n\nIt is also said:\n*\"In the **huītáng** (灰池) of scorching flames,\nLead sinks, silver floats—\nThis is called **huángqīng** (黄轻), also **jīnhuá** (金华),\n**qiūshí** (秋石), **huángyá** (黄芽),\nand **wángyáng** (王阳).*\nIt is named **huángyá** (黄芽)\nbecause of its yellow hue—\nLike the first sprouts of all things,\nthus it is called **huángyá** (黄芽).*\nHe who attains it holds the treasure of longevity.\n\nSubdue and refine it to return to the **wùjǐ** (戊己) lineage.\n**Wùjǐ** (戊己) are the vessels of the **dǐng** (鼎).\nThe **Lǎojūn** (老君) hymn says:\n*\"**Wùjǐ** (戊己) is the primal foundation;\nWater and fire determine superiority and inferiority.\"*\nIt is also said:\n*\"One must complete the **wùjǐ** (戊己) work—\nNever speak of it in terms of iron.\"*\n\nThe **Yùnángsòng** (玉囊颂) proclaims:\n*\"To know the Great Elixir’s foundation,\nOne must obtain the central **wùjǐ** (戊己) soil.*\nWait until water and silver form **báiyè** (白液),\nThen use **báiyè** (白液) to forge **dānsī** (丹砂).*\nFor **dānsī** (丹砂) arises from **jīnyè** (金液).*\n\nIn tattered **máyī** (麻衣) and dusty exile,\nI wander lost, my body mingled with the world.\nYet within me flows a single clear pool of **qīngchéng** (清澄) water—\nI seek neither fame nor fortune, nor any man’s aid.\nFor the treasure within this water\nDemands no noble patrons,\nNo pursuit of **zānyīn** (簪缨) rank.\n\n**Huángjīng** (黄精) and **chìsuǐ** (赤髓) congeal into **sī** (砂).\n**Huángjīng** (黄精) is the refined **qi** (精) of **huángyá** (黄芽).*\nThe **Jīnbìgē** (金碧歌) states:\n*\"**Chìsuǐ** (赤髓) flows as **gǒng** (汞),\nAnd **gǒng** (汞) congeals into **sī** (砂).*\n**Báihǔ** (白虎) and **Qīnglóng** (青龙) are of one origin—\n**Báihǔ** (白虎) and **Qīnglóng** (青龙) are but strong names;\nThey are the **qi** (气) of metal and wood,\nBlended to condense into the purest elixir.\n\nYet all before my eyes I fail to see,\nAnd instead take worthless substances as **huángyá** (黄芽).\nThe *Pāntóngqì* (参同契) says:\n*\"Things of the same kind gather together;\nDisparate matters never yield a treasure.\"*",
      "overlap_context": "sence,\nThe **jīndān** (金丹) will naturally arise.\n\nUnderstanding the **sìxiàng** (四象) in their shifts,\nRecognizing the **èrqì** (二气) in their interplay,\nThen **jīndān** (金丹) and **shā** (砂) will transform and take form.\nFrom **wú** (无) arises **yǒu** (有), and **yǒu** (有) returns to **wú** (无)—\nNow present, now absent,\nFaint and elusive as the utmost precision is nurtured.\nThe **rìyuè** (日月) drive each other across the **bǐqū** (碧虚).\n\nWithout meeting a **zhìrén** (至人) to teach the oral **kè** (诀),",
      "start_char": 5114,
      "end_char": 5631,
      "start_sentence": 312,
      "end_sentence": 345,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 13.11079740524292,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\龙虎还丹诀颂.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "又日：植禾当以粟，覆鸡用其子。 青霞子云：类同即聚，事乖则分，鸾不乳鹊，狐非马韦。 三千少女事幽微，八卦循还巽木知。 巽为风，女为刻漏，推排举其成数。 学者不明轩后旨，唯将声色纵行尸。 经日：黄帝御女三千，白日上升。 几人一妻，乃至丧命。 故世人贵色务多，遂至现败。 殊不知轩后成仙之要，还丹之功也。 玄中玄理妙难知，已向玄中晓细微。 只在坎离返复用， 玄中细微，坎离是也。 自然玄理合天机。 转转修来渐有功，菊花黄变寥花红。 如菊之黄，如寥之红，是其变化也。 炼经千日开炉看，万象都钻一鼎中。 千日功满，万象可见。 莫把还丹取次传，圣人深秘在心田。 时流竞觅砂中汞，不道玄中自有玄。 伤世人竞抽朱砂，取水银以为丹砂，殊不知丹砂玄中之旨也。 九转无辞沐浴频， 沐浴频仍，气数坚雄。 五行偏是水相亲。 丹成只假刀圭力， 得作高真会上人。 霹雳声狂吼巽风，此时秋虎战春龙。 龙虎相吞，声同霹雳也。 元君自有三台助，不动巍巍坐九重。 言元君安然处於三台之上，无所挠动。 魏真君火候歌日：三台披绕胎成形，受气须得丙丁记。 大道玄门路不遥，奈何尘世竞锥刀。 叹世人唯利是亲，常竞刀锥之末。 疏名疏利超真者，此后知谁继我曹。 言仙得其人也。 寂寂真灵事可穷，休寻《金碧》与《参同》。 欲知龙虎还丹诀，至要分明在此中。 言还丹真秘，具在此诗之中。 诵之者足以知其枢要，不叉远求金碧之文也。 龙虎还丹诀颂竟",
      "translated_text": "The Master further says:\n*\"To plant grain, use millet;\nTo cover the hen, use its own offspring.\nQīngxiyazi says:\n*'Of like kind they gather;\nDisparate things divide—\nThe *luán* does not nurse the *què*,\nNor is the fox a *mǎwéi*.\"*\n\nThree thousand maidens attend the subtle mysteries,\nThe Eight Trigrams cycle back to *xùn* and wood.\n*Xùn* is wind, the maiden is the clepsydra—\nPushing and sorting to reveal their numbers.\n\nScholars fail to grasp the *Xuān*’s true intent,\nYet indulge in sound and color, mere empty forms.\n\nThe Classic states:\n*\"The Yellow Emperor consorted with three thousand women,\nAscending in broad daylight.\nFew had but one wife—\nSome even lost their lives.\nThus, men who prize beauty and multiply\nMeet ruin in the end.\n\nYet few know the *Xuān*’s secret to transcendence—\nThe virtue of *huándān* itself.\n\nThe deepest mysteries of the *Xuān* are hard to fathom,\nYet within it lies the subtle truth.\nOnly in *kǎn* and *lí* does the return unfold—\nThe *Xuān*’s subtlety lies in *kǎn* and *lí*.\n\nNature’s mysteries align with Heaven’s design.\nWith each refinement, progress grows—\nThe chrysanthemum turns from yellow to *liáo*’s red.\nAs the chrysanthemum’s hue shifts,\nAs the *liáo*’s color changes—\nSuch is their transformation.\n\nAfter a thousand days of refining, the furnace opens,\nAll things penetrate into the single cauldron.\nA thousand days’ labor complete—\nAll phenomena are revealed within.\n\nDo not casually pass on the *huándān*’s art,\nFor sages guard its secrets in their hearts.\nThe age pursues mercury from sand,\nYet fails to see the *Xuān*’s deeper *Xuān*.\n\nAlas, the world extracts cinnabar in vain,\nTaking liquid mercury for *dānshā*—\nLittle do they know the *Xuān*’s true essence of cinnabar.\n\nNine transformations without ceasing purification,\nFrequent purification strengthens the *qi*—\nThe Five Phases favor water’s affinity.\n\nOnly the *dāoguī*’s power completes the elixir,\nGranting the high *zhēn* to gather among the immortals.\n\nThunder roars as the *xùn* wind rages,\nNow the autumn tiger battles the spring dragon.\nThe dragon and tiger devour each other—\nTheir clash echoes like thunder.\n\nThe Primordial Sovereign has the Three Palaces to aid,\nUnshaken, seated in the Nine Enclosures.\nHe abides serenely atop the Three Palaces,\nUndisturbed.\n\nThe *Wèi Zhēn Jun*’s Fire-Criterion Ode says:\n*\"The Three Palaces enfold the embryo’s form,\nReceiving *qi* must mark the *bǐng-dīng* signs.\"*\n\nThe Dao’s gate is not distant,\nYet mortals chase the needle’s edge.\n\nAh, men seek only profit and fame,\nCompeting for trifles—\nWho among the few will surpass the *zhēn* and inherit our way?\n\nThe silent *zhēnlíng*’s work is now complete,\nNo need to seek the *Jīnbì* or *Pāntóngqì*.\nTo know the *Lónghǔ Huándān*’s secret—\nIts essence lies clearly here.\n\nThe *Lónghǔ Huándān*’s precepts are now complete.",
      "overlap_context": "\n*\"**Chìsuǐ** (赤髓) flows as **gǒng** (汞),\nAnd **gǒng** (汞) congeals into **sī** (砂).*\n**Báihǔ** (白虎) and **Qīnglóng** (青龙) are of one origin—\n**Báihǔ** (白虎) and **Qīnglóng** (青龙) are but strong names;\nThey are the **qi** (气) of metal and wood,\nBlended to condense into the purest elixir.\n\nYet all before my eyes I fail to see,\nAnd instead take worthless substances as **huángyá** (黄芽).\nThe *Pāntóngqì* (参同契) says:\n*\"Things of the same kind gather together;\nDisparate matters never yield a treasure.\"*",
      "start_char": 5631,
      "end_char": 6279,
      "start_sentence": 346,
      "end_sentence": 384,
      "model_used": "mistralai/ministral-14b-2512",
      "translation_time": 8.204030752182007,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\龙虎还丹诀颂.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}