{
  "source_id": "七域修真证品图",
  "source_file": "chunked_daozang\\七域修真证品图.json",
  "total_chunks": 3,
  "total_original_chars": 2575,
  "total_translated_chars": 15868,
  "total_translation_time": 74.11755657196045,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\灵图类\\七域修真证品图.txt",
    "category": "灵图类"
  },
  "full_translation": "**The Seven Realms of Daoist Cultivation and Realization Chart**\n\n**Sutra Title:** *The Seven Realms of Daoist Cultivation and Realization Chart*\nAuthor unknown, likely composed during the Northern and Southern Dynasties or the Sui-Tang period. Discusses the stages of cultivation for Shangqing Daoist practitioners. One scroll.\n\n**Source:** *Daoist Canon of the Zhengtong Era*, Dongxuan Section, Category of Sacred Charts.\n\n---\n\n**The Seven Realms of Daoist Cultivation and Realization Chart**\n\nDuring the Yellow Emperor’s leisure in his palace, he ascended the Terrace of the Morning Star, where six sages attended him: Tian Lao, Li Mu, Da Hong, Tai Shan, Qi Xi, and Peng Zhang. They spoke to him of the Dao of non-action and the essentials of long life and cultivation.\n\nThe Yellow Emperor said: \"When I sought audience with the Purple Mansion Lord on Green Mound, Master Ning on Mount Qingcheng, the Grand Harmony Lord on Flaming Isle, and the Heavenly Perfected Sovereign on Mount Emei, I inquired into the principles of the Five Teeth and Three Ones, as well as the wondrous methods of ascending to immortality. Yet in practice, I have not fully grasped them.\n\nMoreover, man receives life as a mere aggregation of form, bones, blood, and flesh—a tangible existence. The Dao, in its function, is empty, tranquil, and formless—an intangible void. How can one with such corporeal obstacles realize the formless Dao?\"\n\nTian Lao replied: \"Heaven and earth, the myriad things—all follow the transformations of the Dao, arising from nothing into being. Humanity and all creatures, in their attainment of the Dao, return from being to nothingness—this is as effortless as turning one’s palm.\n\nIf one cultivates and grasps the essentials of the Dao, refining essence into spirit, spirit into qi, until qi merges with the Dao, then even the obstacles of form, bones, and flesh, or the vastness of mountains, rivers, and seas, can be transcended, transformed, and mastered—nothing is impossible, nothing unattainable.\"\n\nTian Lao said to the Yellow Emperor: \"The people of the world are children of the Dao, born by receiving qi and assuming form to govern their lives. Heaven bestows spirit, earth bestows essence, and the Dao bestows qi—when these three converge, man is born.\n\nHaving received this body, one must preserve qi, cherish essence, and nurture spirit. When these three harmonize, long life is attainable. Yet the people of the world, unaware that their bodies arise from the Dao, abandon the root to chase the branches, courting death—how deeply deluded they are!\n\nThe method of cultivating the Dao progresses from the mundane to the sacred, ascending and descending through seven realms. Each realm encompasses fourteen thousand practices, and within the seven realms lie ninety-eight thousand gates to cultivation and paths to transcendence. All depend on diligence and perseverance, through which one may ascend to heaven.\"\n\nThe Most High Dao Lord’s *Silent Dao* states: \"Those who study the Dao face nine afflictions—all grave maladies of humanity. If one discerns these afflictions, immortality may be attained.\n\nThe nine afflictions are:\n1. Having the aspiration but lacking the opportunity;\n2. Having the opportunity but lacking companions;\n3. Having companions but lacking the aspiration;\n4. Having the aspiration but lacking a teacher;\n5. Having a teacher but failing to study;\n6. Studying but lacking diligence;\n7. Being diligent but unable to uphold the Dao;\n8. Upholding the Dao but lacking steadfast resolve;\n9. Resolving steadfastly but lacking perseverance.\n\nThus, among a thousand ordinary people, one may know the Dao; among a thousand who know the Dao, one may cultivate it; among a thousand cultivators, one may specialize with precision; among a thousand specialists, one may persevere with diligence. Through cultivation and perseverance, the Dao may be attained.\n\nIf one embraces the Dao in youth, unwavering in resolve, neither water nor fire can daunt the heart, nor can glory and splendor sway the will—cultivating truth with purity and constancy—then in time, a teacher will appear. One need not fear their absence. Thus, one may achieve success without companions and progress without external influence. These are the broad essentials of immortal study. Let those who cultivate the Dao reflect and apply themselves diligently.\"\n\nThe rewards of cultivation and realization are categorized as follows:\n\nThe Dao of Immortality encompasses:\n- *The Eight Pure Perfected Scriptures* and *The Supreme Hidden Writings*;\n- *The Central Scripture of the Nine Perfected* and *The Secret Teachings of the Yellow Emperor and Laozi*;\n- *The Supreme Clarity Scripture’s Seventy-Four Methods of Transformation*;\n- *The Texts for Dispelling the Six Heavens* and *The Three Heavens’ Orthodox Methods*;\n- *The Yellow Qi and Yang Essence, Concealed Celestial Moon*;\n- *The Three Primordials’ Dispersed Scripture* and *The Charts of the Dao and Perfection*;\n- *The Yellow Plain Divine Methods: Forty-Four Secrets*;\n- *The Yellow Writ and Red Realm: Essentials of Longevity*;\n- *The Red Elixir, Golden Essence, Stone Mirror, and Water Mother*;\n- *The Green Essentials, Purple Writ, and Golden Root Texts*;\n- *The Jade Essence True Secrets: Twenty-Seven Pure Sayings*;\n- *The Stone Essence and Golden Light: Records of Concealed Forms*;\n- *The Cinnabar Landscape and Dao Essence: Eight Hidden Earth Techniques*;\n- *The White Tablet and Green Record: Names of the Attained*;\n- *The Purple Void and Flaming Light: Night-Illuminating Divine Candles*;\n- *The Seven Transformations Divine Methods* and *The Scripture of Seven Cycles*;\n- *The Great Cavern True Scripture: Thirty-Nine Chapters*;\n- *The Hidden Writings of the Great Elixir: Eight Endowments and Ten Secrets*;\n- *The Three Charts of the Celestial Pass* and *The Seven Stars’ Shifting Degrees*;\n- *The Nine Elixirs’ Transformations* and *The Central Record of Embryonic Essence*;\n- *The Nine Vermilion Talismans for Sealing Mountains and Concealing Seas*;\n- *The Golden Liquid Divine Elixir* and *The Supreme Pole’s Hidden Mushroom*;\n- *The Nine-Cycled Divine Elixir*, whose ingestion transforms one into a white crane;\n- *The Celestial Sovereign’s Symbolic Talismans* for harmonizing primordial qi;\n- *The White Feathers and Purple Canopy* for traversing the Five Peaks;\n- *The Three Sovereigns’ Writings* for summoning the spirits of heaven and earth;\n- *The Jade Pendants and Golden Earrings* for ascending the Supreme Pole;\n- *The Divine Tiger Talismans* for commanding the Six Heavens;\n- *The Flowing Gold Bells* for subduing ghosts and spirits;\n- *The Plain Memorials and Cinnabar Talismans* for invoking the Six Jia;\n- *The Golden Perfection and Jade Radiance* for illuminating the world;\n- *The Eight Sceneries’ Chariot* for roaming the Upper Clarity;\n- *The Flying Wings* for transcending the void and treading the skies;\n- *The Purple Embroidered Robes, Cinnabar Writ Flying Skirts*;\n- *The White Feathers and Black Pinions* for soaring in the eight directions;\n- *The Kingfisher Plumes and Florid Garments, Golden Bells and Azure Sashes*;\n- *The Curved Dawn Flying Canopy*, whose mastery enables the body to fly;\n- *The Thirty-Seven-Colored Staffs* for serving the immortals.\n\nThe Dao Lord said: \"The wonders of the immortal Dao all have their methods. Mastery of these enables one to become a Perfected of the Nine Palaces—not merely ascending as an immortal.\n\nYet the Dao’s methods are manifold; when fully prepared, one may comprehend them.\n\nThose born into the world who do not know the Dao differ not from plants and trees, nor from birds and beasts—they are called ordinary people. Among them, some awaken with clarity, recognizing the Great Dao, and resolve to cultivate and seek liberation from the world. These are called Daoists, or practitioners.\"\n\n**First Fruition: Cavern Palace Immortals**\nThe Seventeen Net-Heavens’ Palaces.\nAmong those who study the Dao, the initial cultivation is the lower-grade *Nine Cycles of Cavern Palace Immortal Conduct*:\n1. Following the Way,\n2. Sealing off obstructions,\n3. Delivering beings,\n4. Encouraging and aiding,\n5. Bestowing alms,\n6. Making great vows,\n7. Bodily compassion,\n8. Verbal compassion,\n9. Mental compassion.\nIf one cultivates these nine practices without deficiency, while observing the one hundred eighty precepts, accumulating one thousand two hundred meritorious deeds, and concurrently studying the *Taiqing* scriptural ranks, one becomes a *Cavern Palace Immortal* of the renowned mountains. They are attended by one hundred twenty jade lads and jade maidens. Their abode lies within the Ten Caverns beneath the earth, the Thirty-Six Caverns, and the grotto-palaces of the Five Marchmounts, where the essence of sun and moon is divided, and golden towers and jade halls with their immortal officials are all fully arrayed.\n\n**Second Fruition: Earth Perfected of the Mountain-Top Void Palaces**\nThe Hidden Mystery Void Palace, Radiant Perfection Void Palace, Azure Florescence Void Palace, Flourishing Yang Void Palace, Secluded Ruins Void Palace, Lesser Possession Void Palace, Ultimate Perfection Void Palace, General Perfection Void Palace, Nine Proclamations Void Palace, and Great Possession Void Palace—the Ten Great Grotto-Heavens.\nThe immortals of the mountain-top Void Palaces initially cultivate the *Nine Cycles of Perfected Conduct*:\n1. Benevolent salvation,\n2. Non-attachment,\n3. Non-contention,\n4. Non-desire,\n5. Non-possession,\n6. Non-accumulation,\n7. Embodiment of unity,\n8. Self-knowledge,\n9. Abiding in superiority.\nIf one cultivates these nine practices without deficiency, while observing two hundred forty precepts and accumulating two thousand meritorious deeds, and concurrently studies the *Taiqing* scriptural ranks, one becomes an *Earth Perfected of the Mountain-Top Void Palaces* of the Five Marchmounts. They are attended by five hundred jade lads and jade maidens. Their palaces and towers reside in the mysterious void above the Five Marchmounts, where congealed clouds and structured qi transform into palatial structures, with all offices and administrations fully established.\n\n**Third Fruition: Perfected of the Nine Palaces**\nAzure Prime Palace, Azure Expanse Palace, Primordial Cinnabar Palace, Supreme Mystery Palace, Great Blessing Hall Palace, Lesser Yin Palace, Supreme Cinnabar Palace, Central Yellow Palace, Primordial Simplicity Palace, and Supreme Simplicity Palace.\nThe immortals of the Nine Palaces initially cultivate the *Nine Cycles of Conduct* from the two preceding grades—either the *Immortal Conduct* or the *Perfected Conduct*—without deficiency. They observe three hundred major precepts, accumulate three thousand meritorious deeds, and concurrently study the *Lingbao* scriptures, thereby attaining the rank of *Perfected of the Nine Palaces*. They dwell above the Void Palaces of the Five Marchmounts, within the Great Void, where nine positions are divided, each governing a direction.\nThose who attain the rank of *Perfected of the Nine Palaces* wield a three-colored staff, with all immortals as attendants, and are served by three thousand jade lads and jade maidens.\n\n**Fourth Fruition: Attainment of the Rank of Supreme Clarity Upper Immortal**\nThree Primes Palace, Supreme Crimson Heaven’s Supreme Clarity Realm and Supreme Clarity Palace, Cinnabar Terrace and Purple Pavilion.\nThe *Upper Immortals of Supreme Clarity* initially cultivate the *Nine Cycles of Conduct* from the preceding grades, accumulating four thousand meritorious deeds. If they concurrently study the middle-grade Perfected Dao without deficiency, they attain the rank of *Upper Immortal of Supreme Clarity*. Their palace resides within the Supreme Clarity Realm, governed by the Most High Lord Lao.\nThose who attain the rank of *Upper Immortal of Supreme Clarity* are bestowed a five-colored staff, ride a dragon chariot wreathed in flying mist, with a host of immortals as escorts, and are attended by ten thousand jade lads and jade maidens.\n\n**Fifth Fruition: Rank of Supreme Ultimate Perfected**\nThree Florescence Mansion and Numinous Palace, Supreme Ultimate Palace, Elixir Pearl Palace, and Sevenfold Radiance Terrace.\nThe *Supreme Ultimate Perfected* cultivate the *Nine Cycles of Conduct* and three hundred precepts from the preceding grades, accumulating six thousand meritorious deeds. If they concurrently study the upper-grade Perfected Dao without deficiency, they attain the rank of *Supreme Ultimate Perfected*.\nThey are bestowed a purple-tasseled staff, with all spirits as escorts, and are attended by thirty thousand jade lads and jade maidens. Their palaces and towers lie above Supreme Clarity and below Upper Clarity, governed by Lord Lao.\n\n**Sixth Fruition: Rank of Upper Clarity Perfected**\nAzure Pearl Palace, Upper Clarity Realm of the Clear Subtlety Heaven and Luminous Radiance Palace, Supreme Florescence Palace.\nThe *Upper Clarity Perfected* cultivate the *Nine Cycles of Conduct* and three hundred major precepts from the preceding grades, accumulating eight thousand meritorious deeds. If they concurrently study the three grades of the Perfected Dao, they attain the rank of *Upper Clarity Perfected*.\nThey are bestowed a seven-colored staff, ride a flying cloud cinnabar chariot, with a host of immortals as escorts, and phoenixes harnessed to their carriage. They are attended by sixty thousand jade lads and jade maidens. Their governance lies above the Supreme Ultimate and within the Upper Clarity Realm, where the Most High Jade Dawn Great Dao Lord resides.\n\n**Seventh and Ultimate Fruition: Sage of Jade Clarity**\nEastern Florescence Palace, True North Palace, Jade Capital and Golden Gates of the Clear Subtlety Heaven, Purple Tenuity Palace, Jade Clarity Realm’s Seven Treasures Terrace and Great Possession Palace, Western Numinous Palace, Southern Culmen Palace.\nThe *Sages of Jade Clarity* initially cultivate the *Nine Cycles of Conduct* and three hundred precepts from the preceding grades, accumulating ten thousand meritorious deeds. If they concurrently study the Most High’s Dao and the three grades of Perfected scriptures, they attain the rank of *Sage of Jade Clarity*. They are bestowed a nine-colored staff, ride a threefold-purity cloud, with ten thousand spirits as escorts, dragons and tigers harnessed to their carriage, and a purple cloud flying chariot with twelve jade wheels. They are attended by ninety thousand jade lads and jade maidens. Having attained the loftiest and most venerable rank, they stand equal with all sages, beyond the reach of words or images, merging their bodies with the Dao, penetrating into spontaneity. When they dissolve, they become qi; when they rest, they become human.\n\n**Postscript:**\nThe Heavenly Worthy’s love for life is profound; the Dao Lord’s teachings are vast; Lord Lao’s deliverance of beings is utmost.\nThe Three Sages rotate their transformations, rescuing the benighted, all desiring to preserve the flesh-and-blood form, comparing it to the permanence of metal and stone, extending the lifespan of ephemeral fungi to match the great *chun* tree’s years. From mortal to immortal, from immortal to Perfected, from Perfected to Sage, they gallop in dragon-drawn chariots, roaming the Great Void, lifting nine generations from the dark yin, and enjoying boundless longevity through kalpas.\nYet the people of the world, endowed with the qi of the Dao and born from the Dao, spurn the pure, tranquil, and serene origin, pursuing toil, labor, and the realm of splendor. Like oxen and horses pulling heavy loads into the mire, they cannot extricate themselves, sinking ever deeper—how grievous!\n\nThe aspiration is that superior practitioners diligently cultivate, seeking abundant blessings for themselves.\n*The Seven Realms of Cultivation and Verification of Attainment*—concluded.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "七域修真证品图 经名：七域修真证品图。 撰人不详，约出於南北朝或隋唐。 言上清道士修真位业。 一卷。 底本出处：《正统道藏》洞玄部灵图类。 七域修真证品图 黄帝燕居之暇，登启明之台，六圣侍焉。 天老、力牧、大鸿、太山、稽隰、朋张，若语以无为之道，长生修真之要。 黄帝曰：若谒紫府君於青丘，宁先生於青城，太和君於炎洲，天真皇人於峨媚，问五牙三一之旨，飞升长生之妙方，而行之未能尽解。 且人之受生，形骸血肉块然之有也； 道之为用，虚无冲澹泊然之无也。 以有质之碍，证无形之道，其可得乎。 天老对曰：天地万物顺道之化，自无而生有，人伦飞走得道之用，自有而归无，由反掌耳。 苟能修之得道之要，自精而为神，自神而为气，气与道合，虽形骸骨肉之碍，山川河海之大，腾而举之，变而化之，无所不可也，无所不能也。 天老谓黄帝曰：世人者道之子，禀气而生，分形而治其生也。 天与其神，地与其精，道与其气，三者相得而人乃生。 既得其身，当保其气，爱其精，存其神，三者相得，乃可长生。 世人不知身从道生，弃本逐末，自求於死，迷之甚矣。 修道之法，从凡至圣，升降七域，一域所修凡万四千法，七域之中，九万八千修道之门户，登真之径路，皆在勤而能久，可致升天矣。 太上道君《道哑》曰：学道者有九患，皆人之大病。 若审知患病，则仙可得矣。 九患者，一患有其志而无其时，二患有其时而无其友，三患有其友而无其志，四患有其志而无其师，五患有其师而不学，六患能学之而不勤，七患能勤而不能守道，八患能守道而志不固，九患能固其志而不能久。 故曰常人者千，而知道者一； 知道者千，而修道者一； 修道者千，而专精者一； 专精者千，而勤久者一。 修而勤久，道可冀矣。 若少而好道，一志不移，水火不能惧其心，荣华不能惑其志，修真抱素，久则遇师，不患无也。 如此则不须友而成，亦不须感而动也。 此学仙之广要言也。 修道之士，思而勤之。 修道证报，品仪条列如左： 仙道有八素真经太上隐书、 九真中经黄老秘言、 太清上经变化七十四方、 除六天之文三天正法、 黄气阳精藏天隐月、 三元布经道真之图、 黄素神方四十四诀、 黄书赤界长生之要、 赤丹金精石镜水母、 青要紫书金根众文、 玉精真诀三九素语、 石精金光藏景录形、 丹景道精隐地八术、 白简青录得道之名、 紫虚炎光夜照神烛、 七变神法七转之经、 大洞真经三十九章、 太丹隐书八禀十诀、 天关三图七星移度、 九丹变化胎精中记、 九赤斑符封山遁海、 金液神丹太极隐芝、 九转神丹服之化为白鹤、 天皇象符以合元气、 白羽紫盖以游五岳、 三皇之文以召天地神灵、 玉佩金珰以登太极、 神虎之符以威六天、 流金之铃以摄鬼神、 素奏丹符以召六甲、 金真玉光以映天下、 八景之舆以游行上清、 飞行之羽以超虚蹑空、 紫绣毛帔丹书飞裙、 白羽黑翮以翔八方、 翠羽华衣金铃青带、 曲晨飞盖御之体自飞、 三十七色之节以给仙人。 道君曰：仙道之妙，皆有方也。 能尽此道，便为九宫真人，不但登仙而已。 然道之多方，各备则可知矣。 人生於世，不知道者，与草木无殊，与禽兽无异，谓之凡人。 凡人之中，有了然觉悟，知有大道，起心修学，欲求度世者，谓之道人，亦谓之行人也。",
      "translated_text": "**The Seven Realms of Daoist Cultivation and Realization Chart**\n\n**Sutra Title:** *The Seven Realms of Daoist Cultivation and Realization Chart*\nAuthor unknown, likely composed during the Northern and Southern Dynasties or the Sui-Tang period. Discusses the stages of cultivation for Shangqing Daoist practitioners. One scroll.\n\n**Source:** *Daoist Canon of the Zhengtong Era*, Dongxuan Section, Category of Sacred Charts.\n\n---\n\n**The Seven Realms of Daoist Cultivation and Realization Chart**\n\nDuring the Yellow Emperor’s leisure in his palace, he ascended the Terrace of the Morning Star, where six sages attended him: Tian Lao, Li Mu, Da Hong, Tai Shan, Qi Xi, and Peng Zhang. They spoke to him of the Dao of non-action and the essentials of long life and cultivation.\n\nThe Yellow Emperor said: \"When I sought audience with the Purple Mansion Lord on Green Mound, Master Ning on Mount Qingcheng, the Grand Harmony Lord on Flaming Isle, and the Heavenly Perfected Sovereign on Mount Emei, I inquired into the principles of the Five Teeth and Three Ones, as well as the wondrous methods of ascending to immortality. Yet in practice, I have not fully grasped them.\n\nMoreover, man receives life as a mere aggregation of form, bones, blood, and flesh—a tangible existence. The Dao, in its function, is empty, tranquil, and formless—an intangible void. How can one with such corporeal obstacles realize the formless Dao?\"\n\nTian Lao replied: \"Heaven and earth, the myriad things—all follow the transformations of the Dao, arising from nothing into being. Humanity and all creatures, in their attainment of the Dao, return from being to nothingness—this is as effortless as turning one’s palm.\n\nIf one cultivates and grasps the essentials of the Dao, refining essence into spirit, spirit into qi, until qi merges with the Dao, then even the obstacles of form, bones, and flesh, or the vastness of mountains, rivers, and seas, can be transcended, transformed, and mastered—nothing is impossible, nothing unattainable.\"\n\nTian Lao said to the Yellow Emperor: \"The people of the world are children of the Dao, born by receiving qi and assuming form to govern their lives. Heaven bestows spirit, earth bestows essence, and the Dao bestows qi—when these three converge, man is born.\n\nHaving received this body, one must preserve qi, cherish essence, and nurture spirit. When these three harmonize, long life is attainable. Yet the people of the world, unaware that their bodies arise from the Dao, abandon the root to chase the branches, courting death—how deeply deluded they are!\n\nThe method of cultivating the Dao progresses from the mundane to the sacred, ascending and descending through seven realms. Each realm encompasses fourteen thousand practices, and within the seven realms lie ninety-eight thousand gates to cultivation and paths to transcendence. All depend on diligence and perseverance, through which one may ascend to heaven.\"\n\nThe Most High Dao Lord’s *Silent Dao* states: \"Those who study the Dao face nine afflictions—all grave maladies of humanity. If one discerns these afflictions, immortality may be attained.\n\nThe nine afflictions are:\n1. Having the aspiration but lacking the opportunity;\n2. Having the opportunity but lacking companions;\n3. Having companions but lacking the aspiration;\n4. Having the aspiration but lacking a teacher;\n5. Having a teacher but failing to study;\n6. Studying but lacking diligence;\n7. Being diligent but unable to uphold the Dao;\n8. Upholding the Dao but lacking steadfast resolve;\n9. Resolving steadfastly but lacking perseverance.\n\nThus, among a thousand ordinary people, one may know the Dao; among a thousand who know the Dao, one may cultivate it; among a thousand cultivators, one may specialize with precision; among a thousand specialists, one may persevere with diligence. Through cultivation and perseverance, the Dao may be attained.\n\nIf one embraces the Dao in youth, unwavering in resolve, neither water nor fire can daunt the heart, nor can glory and splendor sway the will—cultivating truth with purity and constancy—then in time, a teacher will appear. One need not fear their absence. Thus, one may achieve success without companions and progress without external influence. These are the broad essentials of immortal study. Let those who cultivate the Dao reflect and apply themselves diligently.\"\n\nThe rewards of cultivation and realization are categorized as follows:\n\nThe Dao of Immortality encompasses:\n- *The Eight Pure Perfected Scriptures* and *The Supreme Hidden Writings*;\n- *The Central Scripture of the Nine Perfected* and *The Secret Teachings of the Yellow Emperor and Laozi*;\n- *The Supreme Clarity Scripture’s Seventy-Four Methods of Transformation*;\n- *The Texts for Dispelling the Six Heavens* and *The Three Heavens’ Orthodox Methods*;\n- *The Yellow Qi and Yang Essence, Concealed Celestial Moon*;\n- *The Three Primordials’ Dispersed Scripture* and *The Charts of the Dao and Perfection*;\n- *The Yellow Plain Divine Methods: Forty-Four Secrets*;\n- *The Yellow Writ and Red Realm: Essentials of Longevity*;\n- *The Red Elixir, Golden Essence, Stone Mirror, and Water Mother*;\n- *The Green Essentials, Purple Writ, and Golden Root Texts*;\n- *The Jade Essence True Secrets: Twenty-Seven Pure Sayings*;\n- *The Stone Essence and Golden Light: Records of Concealed Forms*;\n- *The Cinnabar Landscape and Dao Essence: Eight Hidden Earth Techniques*;\n- *The White Tablet and Green Record: Names of the Attained*;\n- *The Purple Void and Flaming Light: Night-Illuminating Divine Candles*;\n- *The Seven Transformations Divine Methods* and *The Scripture of Seven Cycles*;\n- *The Great Cavern True Scripture: Thirty-Nine Chapters*;\n- *The Hidden Writings of the Great Elixir: Eight Endowments and Ten Secrets*;\n- *The Three Charts of the Celestial Pass* and *The Seven Stars’ Shifting Degrees*;\n- *The Nine Elixirs’ Transformations* and *The Central Record of Embryonic Essence*;\n- *The Nine Vermilion Talismans for Sealing Mountains and Concealing Seas*;\n- *The Golden Liquid Divine Elixir* and *The Supreme Pole’s Hidden Mushroom*;\n- *The Nine-Cycled Divine Elixir*, whose ingestion transforms one into a white crane;\n- *The Celestial Sovereign’s Symbolic Talismans* for harmonizing primordial qi;\n- *The White Feathers and Purple Canopy* for traversing the Five Peaks;\n- *The Three Sovereigns’ Writings* for summoning the spirits of heaven and earth;\n- *The Jade Pendants and Golden Earrings* for ascending the Supreme Pole;\n- *The Divine Tiger Talismans* for commanding the Six Heavens;\n- *The Flowing Gold Bells* for subduing ghosts and spirits;\n- *The Plain Memorials and Cinnabar Talismans* for invoking the Six Jia;\n- *The Golden Perfection and Jade Radiance* for illuminating the world;\n- *The Eight Sceneries’ Chariot* for roaming the Upper Clarity;\n- *The Flying Wings* for transcending the void and treading the skies;\n- *The Purple Embroidered Robes, Cinnabar Writ Flying Skirts*;\n- *The White Feathers and Black Pinions* for soaring in the eight directions;\n- *The Kingfisher Plumes and Florid Garments, Golden Bells and Azure Sashes*;\n- *The Curved Dawn Flying Canopy*, whose mastery enables the body to fly;\n- *The Thirty-Seven-Colored Staffs* for serving the immortals.\n\nThe Dao Lord said: \"The wonders of the immortal Dao all have their methods. Mastery of these enables one to become a Perfected of the Nine Palaces—not merely ascending as an immortal.\n\nYet the Dao’s methods are manifold; when fully prepared, one may comprehend them.\n\nThose born into the world who do not know the Dao differ not from plants and trees, nor from birds and beasts—they are called ordinary people. Among them, some awaken with clarity, recognizing the Great Dao, and resolve to cultivate and seek liberation from the world. These are called Daoists, or practitioners.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1369,
      "start_sentence": 0,
      "end_sentence": 75,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.83630847930908,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\灵图类\\七域修真证品图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "第一初果洞宫仙人 十七纲天之宫。 学道之中，初修下品洞宫九转仙行。 一者可从，二者闭塞，三者度生，四者劝助，五者布施，六者大愿，七者身慈，八者口慈，九者心慈。 如上九行，修之不缺，仍具百八十戒，有千二百善功，兼修太清经位，为名山洞宫仙人，给玉童玉女一百二十人，其所居在地中十洞、三十六洞、五岳名山洞府之中，自有日月分精，金楼玉堂仙官，莫不毕具焉。 第二次果名山之上虚宫地真人 隐玄虚宫、曜真虚宫、青华虚宫、华阳虚宫、幽墟虚宫、小有虚宫、极真虚宫、总真虚宫、九宣虚宫、大有虚宫，十大洞天。 山上虚宫仙人，初修九转真行。 一者善救，二者不恃，三者不争，四者不欲，五者不有，六者不积，七者体一，八者自知，九者处上。 已上有九行，修之不缺，仍具二百四十戒，有二千善功，兼修太清经位，为五岳名山上虚宫地真人，给玉童玉女五百人，其宫阙在五岳名山之上玄虚之中，凝云结气，化为宫阙，曹府所治，会然毕具。 第三次果为九宫真人 青元官、碧落宫、始丹宫、太玄宫、大福堂宫、少阴宫、太丹宫、中黄宫、始素宫、太素宫。 九宫仙人，初修前两种九转之行，或修仙行，或修真行，九转不缺，行三百大戒，有三千善功，兼修灵宝之经者，位为九宫真人，在五岳虚宫之上，太空之中，分有九位，位统一方。 得九宫仙人者，执三色之节，诸仙侍从，给玉童玉女三千人。 第四次果证位为太清上仙 三元宫、太赤天太清境太清宫、丹台紫阁。 太清上仙，初修前九转之行，有四千善功，兼修中品真道不备者，位为太清上仙，其宫在太清境中，太上老君所治。 得太清上仙者，赐五色之节，驾龙舆飞烟，群仙导从，给玉童玉女一万人。 第五太极真人果位 三华府灵宫、太极宫、药珠宫，七映台。 太极真人，修前九转之行及三百戒，有六千善功，兼修上品真道不备者，位为太极真人。 赐紫旄之节，众神导从，给玉童玉女三万人，其宫阙在太清之上，上清之下，老君所治。 第六果位为上清真人 青珠宫、清微天上清境明光宫、太华宫。 上清真人，修前九转兼三百大戒，有八千善功，兼修三品真道者，位为上清真人。 赐七色之节，乘飞云丹舆，群仙导从，鸾凤骖轩，给玉童玉女六万人，其所理在太极之上，上清之境，太上玉晨大道君之所治也。 第七极果为玉清圣人 东华官、真北宫、玉京金阙清微天紫微宫、玉清境七宝台大有宫、西灵宫、南极宫。 玉清圣人，初修前九转之行及三百众戒，有一万善功，兼修太上之道及三品真经者，位为玉清圣人，赐九色之节，乘三素之云，万灵导从，龙虎骖轩，驾紫云飞軿，十二琼轮，给玉童玉女九万人，证种高尊，与众圣齐位，非言象所及，与道混体，洞入自然，消则为气，息则为人者也。 后序曰：天尊之好生甚矣，道君之垂教广矣，老君之度人至矣。 三圣轮化，拯擢昏迷，皆欲使全肉血之形，比金石之永，延朝菌之命，齐大椿之年，自凡而登仙，自仙而登真，自真而证圣，驰骋龙驾，遨游太虚，拔九祖於幽阴，享遐龄於亿劫。 而世人禀道之气，从道而生，厌清虚恬澹之宗，逐劳役繁华之境，犹如牛马引重趣泥，不能自出，转增陷没，岂不痛哉。",
      "translated_text": "**First Fruition: Cavern Palace Immortals**\nThe Seventeen Net-Heavens’ Palaces.\nAmong those who study the Dao, the initial cultivation is the lower-grade *Nine Cycles of Cavern Palace Immortal Conduct*:\n1. Following the Way,\n2. Sealing off obstructions,\n3. Delivering beings,\n4. Encouraging and aiding,\n5. Bestowing alms,\n6. Making great vows,\n7. Bodily compassion,\n8. Verbal compassion,\n9. Mental compassion.\nIf one cultivates these nine practices without deficiency, while observing the one hundred eighty precepts, accumulating one thousand two hundred meritorious deeds, and concurrently studying the *Taiqing* scriptural ranks, one becomes a *Cavern Palace Immortal* of the renowned mountains. They are attended by one hundred twenty jade lads and jade maidens. Their abode lies within the Ten Caverns beneath the earth, the Thirty-Six Caverns, and the grotto-palaces of the Five Marchmounts, where the essence of sun and moon is divided, and golden towers and jade halls with their immortal officials are all fully arrayed.\n\n**Second Fruition: Earth Perfected of the Mountain-Top Void Palaces**\nThe Hidden Mystery Void Palace, Radiant Perfection Void Palace, Azure Florescence Void Palace, Flourishing Yang Void Palace, Secluded Ruins Void Palace, Lesser Possession Void Palace, Ultimate Perfection Void Palace, General Perfection Void Palace, Nine Proclamations Void Palace, and Great Possession Void Palace—the Ten Great Grotto-Heavens.\nThe immortals of the mountain-top Void Palaces initially cultivate the *Nine Cycles of Perfected Conduct*:\n1. Benevolent salvation,\n2. Non-attachment,\n3. Non-contention,\n4. Non-desire,\n5. Non-possession,\n6. Non-accumulation,\n7. Embodiment of unity,\n8. Self-knowledge,\n9. Abiding in superiority.\nIf one cultivates these nine practices without deficiency, while observing two hundred forty precepts and accumulating two thousand meritorious deeds, and concurrently studies the *Taiqing* scriptural ranks, one becomes an *Earth Perfected of the Mountain-Top Void Palaces* of the Five Marchmounts. They are attended by five hundred jade lads and jade maidens. Their palaces and towers reside in the mysterious void above the Five Marchmounts, where congealed clouds and structured qi transform into palatial structures, with all offices and administrations fully established.\n\n**Third Fruition: Perfected of the Nine Palaces**\nAzure Prime Palace, Azure Expanse Palace, Primordial Cinnabar Palace, Supreme Mystery Palace, Great Blessing Hall Palace, Lesser Yin Palace, Supreme Cinnabar Palace, Central Yellow Palace, Primordial Simplicity Palace, and Supreme Simplicity Palace.\nThe immortals of the Nine Palaces initially cultivate the *Nine Cycles of Conduct* from the two preceding grades—either the *Immortal Conduct* or the *Perfected Conduct*—without deficiency. They observe three hundred major precepts, accumulate three thousand meritorious deeds, and concurrently study the *Lingbao* scriptures, thereby attaining the rank of *Perfected of the Nine Palaces*. They dwell above the Void Palaces of the Five Marchmounts, within the Great Void, where nine positions are divided, each governing a direction.\nThose who attain the rank of *Perfected of the Nine Palaces* wield a three-colored staff, with all immortals as attendants, and are served by three thousand jade lads and jade maidens.\n\n**Fourth Fruition: Attainment of the Rank of Supreme Clarity Upper Immortal**\nThree Primes Palace, Supreme Crimson Heaven’s Supreme Clarity Realm and Supreme Clarity Palace, Cinnabar Terrace and Purple Pavilion.\nThe *Upper Immortals of Supreme Clarity* initially cultivate the *Nine Cycles of Conduct* from the preceding grades, accumulating four thousand meritorious deeds. If they concurrently study the middle-grade Perfected Dao without deficiency, they attain the rank of *Upper Immortal of Supreme Clarity*. Their palace resides within the Supreme Clarity Realm, governed by the Most High Lord Lao.\nThose who attain the rank of *Upper Immortal of Supreme Clarity* are bestowed a five-colored staff, ride a dragon chariot wreathed in flying mist, with a host of immortals as escorts, and are attended by ten thousand jade lads and jade maidens.\n\n**Fifth Fruition: Rank of Supreme Ultimate Perfected**\nThree Florescence Mansion and Numinous Palace, Supreme Ultimate Palace, Elixir Pearl Palace, and Sevenfold Radiance Terrace.\nThe *Supreme Ultimate Perfected* cultivate the *Nine Cycles of Conduct* and three hundred precepts from the preceding grades, accumulating six thousand meritorious deeds. If they concurrently study the upper-grade Perfected Dao without deficiency, they attain the rank of *Supreme Ultimate Perfected*.\nThey are bestowed a purple-tasseled staff, with all spirits as escorts, and are attended by thirty thousand jade lads and jade maidens. Their palaces and towers lie above Supreme Clarity and below Upper Clarity, governed by Lord Lao.\n\n**Sixth Fruition: Rank of Upper Clarity Perfected**\nAzure Pearl Palace, Upper Clarity Realm of the Clear Subtlety Heaven and Luminous Radiance Palace, Supreme Florescence Palace.\nThe *Upper Clarity Perfected* cultivate the *Nine Cycles of Conduct* and three hundred major precepts from the preceding grades, accumulating eight thousand meritorious deeds. If they concurrently study the three grades of the Perfected Dao, they attain the rank of *Upper Clarity Perfected*.\nThey are bestowed a seven-colored staff, ride a flying cloud cinnabar chariot, with a host of immortals as escorts, and phoenixes harnessed to their carriage. They are attended by sixty thousand jade lads and jade maidens. Their governance lies above the Supreme Ultimate and within the Upper Clarity Realm, where the Most High Jade Dawn Great Dao Lord resides.\n\n**Seventh and Ultimate Fruition: Sage of Jade Clarity**\nEastern Florescence Palace, True North Palace, Jade Capital and Golden Gates of the Clear Subtlety Heaven, Purple Tenuity Palace, Jade Clarity Realm’s Seven Treasures Terrace and Great Possession Palace, Western Numinous Palace, Southern Culmen Palace.\nThe *Sages of Jade Clarity* initially cultivate the *Nine Cycles of Conduct* and three hundred precepts from the preceding grades, accumulating ten thousand meritorious deeds. If they concurrently study the Most High’s Dao and the three grades of Perfected scriptures, they attain the rank of *Sage of Jade Clarity*. They are bestowed a nine-colored staff, ride a threefold-purity cloud, with ten thousand spirits as escorts, dragons and tigers harnessed to their carriage, and a purple cloud flying chariot with twelve jade wheels. They are attended by ninety thousand jade lads and jade maidens. Having attained the loftiest and most venerable rank, they stand equal with all sages, beyond the reach of words or images, merging their bodies with the Dao, penetrating into spontaneity. When they dissolve, they become qi; when they rest, they become human.\n\n**Postscript:**\nThe Heavenly Worthy’s love for life is profound; the Dao Lord’s teachings are vast; Lord Lao’s deliverance of beings is utmost.\nThe Three Sages rotate their transformations, rescuing the benighted, all desiring to preserve the flesh-and-blood form, comparing it to the permanence of metal and stone, extending the lifespan of ephemeral fungi to match the great *chun* tree’s years. From mortal to immortal, from immortal to Perfected, from Perfected to Sage, they gallop in dragon-drawn chariots, roaming the Great Void, lifting nine generations from the dark yin, and enjoying boundless longevity through kalpas.\nYet the people of the world, endowed with the qi of the Dao and born from the Dao, spurn the pure, tranquil, and serene origin, pursuing toil, labor, and the realm of splendor. Like oxen and horses pulling heavy loads into the mire, they cannot extricate themselves, sinking ever deeper—how grievous!",
      "overlap_context": "ry of these enables one to become a Perfected of the Nine Palaces—not merely ascending as an immortal.\n\nYet the Dao’s methods are manifold; when fully prepared, one may comprehend them.\n\nThose born into the world who do not know the Dao differ not from plants and trees, nor from birds and beasts—they are called ordinary people. Among them, some awaken with clarity, recognizing the Great Dao, and resolve to cultivate and seek liberation from the world. These are called Daoists, or practitioners.\"",
      "start_char": 1370,
      "end_char": 2645,
      "start_sentence": 76,
      "end_sentence": 107,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.04356837272644,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\灵图类\\七域修真证品图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "所愿上士勤行，自求多福也。 七域修真证品图竟",
      "translated_text": "The aspiration is that superior practitioners diligently cultivate, seeking abundant blessings for themselves.\n*The Seven Realms of Cultivation and Verification of Attainment*—concluded.",
      "overlap_context": "mortal to Perfected, from Perfected to Sage, they gallop in dragon-drawn chariots, roaming the Great Void, lifting nine generations from the dark yin, and enjoying boundless longevity through kalpas.\nYet the people of the world, endowed with the qi of the Dao and born from the Dao, spurn the pure, tranquil, and serene origin, pursuing toil, labor, and the realm of splendor. Like oxen and horses pulling heavy loads into the mire, they cannot extricate themselves, sinking ever deeper—how grievous!",
      "start_char": 2645,
      "end_char": 2670,
      "start_sentence": 108,
      "end_sentence": 109,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.2376797199249268,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\灵图类\\七域修真证品图.txt",
        "category": "灵图类"
      }
    }
  ]
}