{
  "source_id": "三天内解经",
  "source_file": "chunked_daozang\\三天内解经.json",
  "total_chunks": 6,
  "total_original_chars": 5759,
  "total_translated_chars": 33820,
  "total_translation_time": 175.02842497825623,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\三天内解经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Inner Explication of the Three Heavens**\n*Scripture Title:* The Inner Explication of the Three Heavens. Compiled by Xu, a Celestial Master of the Heavenly Master Dao of the Southern Qi and Liu-Song dynasties. Two scrolls.\n\n*Source of Base Text:* Zhengtong Daoist Canon, Orthodox Section, Part One.\n\n**Scroll One of The Inner Explication of the Three Heavens**\nCompiled by Xu, Disciple of the Three Heavens\n\nMan’s bodily form is endowed from above by Heaven and modeled below upon Earth. The sun and moon possess the division of darkness and light; cold and heat bear the qi of generation and destruction; thunder and lightning have their cycles of emergence and withdrawal; wind and rain observe the rhythms of movement and stillness. Man possesses the substance of the worthy and the foolish, the nature of good and evil, the qi of hardness and softness, the destiny of long life and early death, the stations of nobility and baseness, the order of honor and humility, the signs of fortune and misfortune, and the appointed times of success and failure.\n\nWithout man, Heaven and Earth cannot be established; without Heaven and Earth, man cannot come into being. If Heaven and Earth lacked man, it would be as though the spirit were absent from the human abdomen—form could not stand. If there were spirit without form, the spirit would have no master. Thus, what establishes them is Heaven, and what sets them in motion is the Dao.\n\nMan’s nature, destiny, and spirit are identical, merging into one. Thus, Heaven, Earth, and Man—the Three Powers—complete virtue and serve as the origin of the myriad things. Heaven cannot but nurture life; Earth cannot but grow things; man cannot but refine qi to nurture life.\n\nIf Heaven deviates from the Primordial Mystery, there arise the calamities of solar and lunar eclipses. If Earth strays from the Yellow Skirt, there arise the disasters of wind and quaking. If man turns away from the Supreme Dao, there arise the harms of withering and decay.\n\nEssential qi floats above while the multitude of essences flow below; above and below interpenetrate, their mutual resonance following one another. When human affairs are disordered below, calamities respond above by cutting short destiny: the sun and moon suffer eclipses, the stars and constellations fall into disarray—all arising from human affairs being improper, thus bringing about these transformations.\n\nIn this late age, the people’s years and destinies are cut short, their corpses strewn like refuse, their lifespans unfulfilled. All this stems from losing the root of cultivation: marriages between unsuitable types, chaotic intermingling of qi, belief in the false and abandonment of the true, the fundamental Dao gone astray, the multitude of fools in confusion, none knowing the source of their misfortune.\n\nSome boil and slaughter the six livestock, praying to emptiness; they chant, sing, drum, and dance, seeking wine and meat. Seeking life, they meet death—such is the work of heterodox ways. Scratching the foot when the head itches, their actions do not correspond. Their prayers and supplications transgress proper bounds, leading to the destruction of their bodies and the premature end of their years and destinies—truly a cause for grief.\n\nNow I have compiled *The Essential Explication of the Three Heavens* to instruct those who have not yet awakened. It must be guarded with care and kept secret; do not rashly transmit it. To transmit it to the unworthy brings calamity upon one’s descendants.\n\nThe origin of the Dao arises from what precedes the void. In the vast expanse of primordial chaos, it has no cause; it arises spontaneously from emptiness, transforming and generating all things.\n\nThe Venerable Person of Dao and Virtue was born before the primordial qi. He is the most exalted within the Dao, and thus is called the Venerable Person of Dao and Virtue. From this arose the Supreme Clarity, the Primordial Mystery, the Utmost Three Heavens, the Boundless Great Dao, the Most High Lord Lao, the Most High Venerable Person, the Heavenly Thearch, the Nine Elders of the Immortal Capital, the Venerable Person of the Nine Qi, and the myriad layers of Dao-qi—one thousand two hundred official lords beneath the Jade Platform of Supreme Clarity. When people of this age address memorials to Supreme Clarity, they refer precisely to these Perfected Ones of the various heavens.\n\nThereafter, within the hidden and obscure, the Cavernous Void came into being. Within the Cavernous Void, the Great Non-Being arose. The Great Non-Being transformed into the mysterious qi, the primordial qi, and the initial qi. These three qi intermingled in chaos, mutually engendering, and gave birth to the Wondrous Jade Maiden. After the Jade Maiden was born, the chaotic qi congealed and transformed, giving birth to Laozi, who emerged from beneath the Jade Maiden’s left armpit. Born with white hair, he was thus called Laozi. Laozi is Lord Lao.\n\nTransforming and becoming qi, he brought forth Heaven, Earth, and the myriad beings. Thus, he revolves and transforms, refining his form and qi. Lord Lao dispersed the primordial qi of the Primordial Mystery. Undifferentiated, chaotic, like the yolk within an egg, it then separated: the mysterious qi, pure and refined, ascended to become Heaven; the initial qi, thick and turbid, congealed below to become Earth; the primordial qi, light and subtle, flowed through to become water. The sun, moon, stars, and constellations were arrayed therein.\n\nLord Lao, by means of the harmonious qi, transformed and established nine lands, placing nine persons—three men and six women. By the time of Fuxi and Nüwa, they each created names, and from this issued the Three Teachings to instruct the people of Heaven. The Central Kingdom, where yang qi is pure and upright, was made to uphold the Great Dao of Non-Action. The eighty-one domains of the outer barbarian lands, where yin qi is strong and flourishing, were made to uphold the Buddhist Dao, with strict prohibitions to restrain the yin qi. In the lands of Chu and Yue, where yin and yang qi are weak, they were made to uphold the Great Dao of Purity and Simplicity.\n\nAt this time, the governance of the Six Heavens flourished, and the Three Teachings spread. Lord Lao, appearing as thearch after thearch, served as the state preceptor. During Fuxi’s reign, he was called Master Yuhua; during Zhurong’s, Master Guangshou; during Shennong’s, Master Dacheng; during the Yellow Thearch’s, Master Guangcheng; during Zhuanxu’s, Master Chijing; during Emperor Ku’s, Master Lutuz; during Emperor Yao’s, he appeared again as Master Wucheng; during Emperor Shun’s, Master Yinshou; during Yu of Xia’s, Master Zhenxing; during Tang of Yin’s, Master Xize.\n\nHis transformations were without constancy. At times he was surnamed Li, named Hong, and styled Jiuyang; at others, named Dan, styled Boyang; or named Zhong, styled Boguang; or named Chong, styled Ziwen; or named Zhai, styled Bochang; or named Yuan, styled Boshi; or named Xian, styled Yuansheng; or named De, styled Bowen. Sometimes he changed nine times in a day, or twenty-four times; his myriad transformations followed the world’s vicissitudes, beyond enumeration.\n\nBy the time of King Wuding of Yin, he returned to the womb of Mother Li. Within the womb, he recited scriptures for eighty-one years, then emerged by splitting open her left armpit. Born with white hair, he was again called Laozi. The *Scripture of the Three Terraces* that people of this age possess is what Lord Lao recited within the womb.\n\nHis return to the womb of Mother Li was his own transformation of his empty, formless body into the form of Mother Li, then re-entering himself—it was not that there was an actual Mother Li.\n\nThe world does not understand and mistakenly claims that Laozi entrusted himself to the womb of Mother Li, but this is not the case. By the time of King You of Zhou, Laozi knew the Zhou dynasty’s fortune was waning. He let his hair loose, feigned madness, and departed from Zhou. Arriving at the pass, he rode in a carriage drawn by a blue ox and encountered Yin Xi. He bestowed upon Xi the *Scripture of the Upper, Middle, and Lower* in one scroll, and the *Five Thousand Characters* in two scrolls, totaling three scrolls. Yin Xi received these texts, and through them, his Dao was perfected.\n\nPerceiving that the barbarians of the western lands were fierce and difficult to transform, Laozi and Yin Xi traveled westward together into the kingdom of Jibin. There, Laozi’s divine transformations grew even more majestic, subduing the barbarian king and composing Buddhist scriptures of sixty-four myriad words. The king and his entire nation revered and served them. This kingdom lay forty thousand *li* from the land of Han. The people of Jibin all submitted to the Great Dharma.\n\nLaozi then journeyed farther west into the kingdom of Tianzhu, another forty thousand *li* beyond Jibin. The king’s consort was named Qingmiao. As she napped during the day, Laozi commanded Yin Xi to ride a white elephant and transform into a yellow sparrow, flying into Qingmiao’s mouth like a shooting star. In the following year, on the eighth day of the fourth month, he emerged by splitting open her right side. Upon birth, he took seven steps, raised his right hand to point at the sky, and intoned:\n*“Above heaven and below heaven, only I am revered.\nThe Three Realms are all suffering—what joy can there be?”*\n\nAt birth, he was already profoundly austere, instantly embodying the Buddha’s form. The Dao of the Buddha thus flourished anew in this land. In later ages, moral decay spread, and malevolent forces arose—libations and shamanic rites to ghosts proliferated, and truth and falsehood became indistinguishable.\n\nThe Most High, in Langye, entrusted the *Scripture of the Dao of Great Peace* to Gan Ji, Li Wei of Shu Commandery, and others, commanding them to assist the Six Heavens in rectifying perverse *qi*. Yet Wei and his followers failed to correct the *qi* of the Six Heavens. Instead, by the Han era, heterodox forces surged, the *qi* of the Six Heavens raged, the Three Paths intertwined, pestilential *qi* ran rampant, and physicians and shamans flourished. All abandoned truth for falsehood, indulging in music, dance, the slaughter of livestock, and libations to malevolent spirits. The people suffered untimely deaths, their corpses strewn like refuse.\n\nThe Most High dispatched Perfected Ones, Wang Fangping, and Dongfang Shuo to aid the Han dynasty, sending them to observe the land and assess the people’s condition. The Han emperor, however, dismissed them as bewitching deceivers. Thus, the Han house declined and collapsed, and Wang Mang seized power. The Han emperors of the Liu clan were descendants of dragon essence, heirs to the Great Sage’s legacy, destined to rule through twenty-four sovereigns over four hundred years. Yet their imperial line nearly severed, so the Most High ordained Guangwu’s restoration. The interruptions in their reign were all due to disbelief in truth, the lack of true support, and the ensuing chaos of malevolent spirits, which consigned them to the realm of ghostly officials.\n\nSince the opening of heaven and earth, the border tribes—Qiang, Man, Rong, and Di—had served as the outer fence of the Central Kingdom. They married within their own kind, each adhering to their proper lineage, revering the Supreme Dao, and preserving their purity without admixture. But after Guangwu of Han,世俗 gradually declined, and humans and ghosts intermingled.\n\nGuangwu’s son, Emperor Ming of Han, claimed to have dreamed of a towering figure, over ten *chi* tall, his body golden in hue. His ministers interpreted the dream as the true Buddha and dispatched envoys to the Western Regions to copy Buddhist scriptures. Temples, pagodas, and monasteries were built, and Buddhism spread throughout the Central Kingdom. The Three Paths intertwined, the people grew disordered, and internal and external realms mixed. Each faction held to its own preferences—some embraced falsehoods and abandoned truth, offering prayers and sacrifices to spirits. Human affairs below grew chaotic, while celestial *qi* above raged in turmoil, causing the heavens to grow murky and the people to lose their original purity.\n\nDuring the reign of Emperor Shun of Han, the Most High selected envoys to rectify the governance of the Six Heavens, distinguishing truth from falsehood and manifesting the *qi* of the Upper Three Heavens. On the first day of the fifth month in the *renwu* year of the *Anyuan* era (142 CE), Lord Lao, in the stone chamber of Quting Mountain in Shu Commandery, prepared to ascend to the Great Governance of Kunlun with the Daoist Zhang Daoling. There, the Most High newly revealed himself, declaring that people feared malevolent spirits but not truth, and thus took the title of *Newly Revealed Lord Lao*. He appointed Zhang as the Master of the Great Mysterious Capital, the Orthodox Unity, and the Pacifier of *Qi* in the Three Heavens, entrusting him with the *Orthodox Unity Luminous Might Dao*, the statutes of the *Newly Revealed Lord Lao*, and the mandate to abolish the affairs of the Six Heavens and Three Paths. He rectified the Three Heavens, purged superficiality, restored simplicity, and returned to truth, transmitting the Most High’s true scriptures.\n\nZhang established regulations over sixteen years, and in the *dingyou* year of the *Yongshou* era (157 CE), he formed a covenant with the Han emperor and his ministers, using the blood of a white horse as an oath and inscribing a pledge on iron tablets. Together with the Three Officials of Heaven, Earth, and Water, and the General of the Grand Year, they swore: to perpetually uphold the orthodox law of the Three Heavens and never oppress the people. The people were forbidden from recklessly worshipping other spirits, ensuring ghosts received no offerings, masters took no payment, and no one engaged in licentiousness or theft. Those treating illness were prohibited from consuming alcohol or meat. The people were permitted to worship their ancestral parents only on the five auspicious *La* days and to venerate the earth and stove gods in the second and eighth months. All practices outside the orthodox law of the Three Heavens and the true Dao of the Perfected Heavens were deemed residual *qi*.\n\nFor the sick, they were to confess their transgressions from the age of seven, when they gained understanding, and establish rituals, talismans, and protocols to heal chronic and severe illnesses beyond the reach of physicians. Recovery would follow upon repentance. Zhang established twenty-four governances, appointing male and female officials and libationers to oversee the orthodox law of the Three Heavens, converting the people and accepting households with five *dou* of rice as a token of faith. Within a hundred days, tens of thousands of households flocked like clouds. He composed myriad statutes, protocols, and documents, entrusting them to his descendants to transmit as state preceptors. Once the laws were set, humans and spirits grew tranquil. Zhang then ascended to heaven in broad daylight, personally receiving the title of Celestial Master.\n\nThe Celestial Master’s son, Zhang Heng, and grandson, Zhang Lu, along with his wife, all achieved liberation through *shijie* and ascended to heaven, thus establishing the Three Masters and the Lady. After their ascension, various libationers transmitted the Daoist teachings. Recipients were required to kneel to receive the scriptures and bow in reverence upon returning, ensuring adherence to the orthodox law of the Three Heavens. Yet many disregarded this, hastily obtaining a single scroll and claiming it as a Daoist scripture, passing it among themselves. Some were remnants of the Six Heavens’ affairs, leading to confusion. The longer such practices persisted, the harder it became to distinguish truth from falsehood.\n\nThe Celestial Master received the *Orthodox Unity Alliance Might Dao* and the orthodox law of the Three Heavens from the Most High, entrusting them to his descendants as state preceptors, meant to endure eternally—how could they be adulterated? Yet soon after, remnants of the Six Heavens’ affairs gradually intermingled. The lineage of masters weakened, the common people followed mixed practices, and libationers upheld disparate teachings, each claiming orthodoxy. How grievously mistaken!\n\nToday, some follow the Way of the Five Pecks of Rice, others the Way of the Banner of Non-Action and Flowers, or the Buddhist Dao—all remnants of the Six Heavens’ affairs, long since abolished. There are also those who follow the Way of Pure Water, which is not orthodox. It is said that the Celestial Master had a servant illiterate in scripture, difficult to civilize. As the Celestial Master was to ascend to heaven, he pitied the servant’s devotion and commanded a well be dug for his use, to treat illness. The water was not to be used for washing or drinking. Those who used this well water to treat illness recovered without fail, their ailments cured instantly.\n\nThe servant later returned his form to the Great Yin, and the well water dried up. The Celestial Master had granted this water for the servant’s body, but later generations, failing to understand, transmitted it as a practice, calling it the Way of Pure Water. On days of clear brightness when seeking blessings, they had no Daoist halls, kitchen shelters, talismans, or rituals—only facing a jar of clear water to burn incense and bow in worship, claiming the Dao resided within the water. This was entirely mistaken.\n\nThose who followed the Dao without offering the Five Pecks of Rice thereby departed from the Orthodox Unity and Alliance of the Three Heavens. The Five Pecks of Rice were rightly offered to the Five Thearchs, acknowledging the people’s desire to follow the Dao. The sage harmonizes with qi, beginning and ending without end, thus the sage does not die. Mortals harmonize their lives with rice; without grain, they would starve. What they treasure is offered to the hidden and obscure—not because the rice itself is needed.\n\nEmperor Gao of Han was the son of dragon essence, rising from a minor clerk at Sishui Pavilion to ascend the imperial throne. By the reign of Emperor Wen, Laozi descended upon the River and was thus called the River Elder. Emperor Wen commanded his carriage to seek the Dao from him. Laozi bestowed the *Five Thousand Words on Virtue and the Dao* in its upper and lower chapters before departing.\n\nEmperor Wu desired to learn the methods of the Supreme Dao for flying immortality, so the Most High sent Dongfang Shuo to assist in Han’s governance. Yet Emperor Wu, unaware that Shuo was a perfected person, treated him as an ordinary official, no different from commoners. The Queen Mother of the West and the Lady of the Upper Prime both descended in their chariots to Emperor Wu, wishing to perfect his Dao. But Emperor Wu failed to awaken, though he revered the numinous grace, casting aside filth and impurity. Clinging to worldly glory and ceaseless warfare, he accrued blood debts before the Three Offices, his unbound hair crying out in grievance to the ghostly officials. His passions unchecked, the Dao remained unfulfilled, and he returned his form to the Great Yin.\n\nDuring the reign of Emperor Guangwu, as he contended with Wang Mang for rule, he faced peril at the Yellow River, his life hanging by a thread. The Most High manifested to aid Guangwu. In the scorching heat of the sixth month, the river waters froze, allowing his troops and horses to cross and escape disaster. The Han mandate was heaven-bestowed, as revealed in the charts: sweet dew descended in the courtyard, perfected beings arrived in their chariots, divine phoenixes came to roost, the sun’s shadow reversed twice, the three-legged crow in the sun and the nine-tailed fox appeared, numinous omens blazed forth, and a host of sages lent their wings—all signs of the Orthodox Dao’s assistance.\n\nAfter Guangwu, the Han dynasty gradually declined. The Most High, pitying this, chose Zhang Daoling, a distant descendant of Zhang Liang, to manifest the Dao’s qi and aid the Han. He was made to establish the Great Law on Mount Mang north of Luoyang, and emperors, kings, ministers, and officials all submitted to his lineage. At that time, the Orthodox qi spread far and wide. Over the four hundred twenty-five years of the Han, from its early to later emperors, countless common people attained the Dao. The Han house grew arrogant and indolent, unable to ascend the Mystery, so the people achieved it instead.\n\nThe Celestial Master’s three generations of couples—six in all—served as the Three Masters’ task. The Mao brothers, three in number, served as the Controllers of Destiny. Among the scattered immortals like Wang Chang and Zhao Sheng, there were over a hundred, too many to name individually. The Liu lineage, endowed with the body of the Dao, was cut off and then renewed. Heaven bestowed its mandate as revealed in the charts: auspicious omens at the Central Marchmount, twenty-two jade disks, a cake of yellow gold to verify the imperial surname. The nine-tailed fox arrived, numinous treasures emerged, sweet dew descended in the courtyard, three-horned oxen appeared, six sacred bells took form, giant beasts and twin elephants came to roost among men, feeding on the spirits of the ancestral temple—all former practices were abolished. Governance was rectified by the Dao, old qi swept away. Was this not the trustworthiness of the Most High?\n\nEmperor Liu of the Song was a scion of the Han, ever bound to the Dao in affinity. The Song state abounded in Daoists. Even in Han times, there were forerunners—scholars cannot afford to neglect this. The Three Ways share a root but branch differently: the Great Dao of Non-Action, the Great Dao of Purity and Simplicity, and the Buddhist Dao. These three are all the methods of the Most High Lord Lao, though their teachings differ, their ultimate return is to the True Dao.\n\nLaozi presides over transformations of life, Śākyamuni over transformations of death. Thus Laozi emerged from his mother’s left armpit, governing the left, which pertains to yang qi and the Azure Palace’s Register of Life. Śākyamuni emerged from the right armpit, governing the right, which pertains to yin qi and the Black Record’s Register of Death. Hence Laozi’s and Śākyamuni’s teachings differ in their left and right methods. Left transformation follows the left office’s generative qi, enabling bodily ascent as flying immortals. Right transformation follows the right office’s mortal qi, enabling extinction and rebirth. Their dharma robes are entirely black, worn to model yin qi and enter the Black Record.\n\nThe Most High established these three teachings. Though their methods diverge, they ultimately return to the truth of the Dao, without difference. Yet humans receive primordial qi to form their bodies, only to undergo decay and receive yin transformation in the cycle of rebirth—this is inherently difficult. Though right transformation does not match the left office’s swift ease, its cyclical return to truth is also good. Thus it is said the right is not equal to the left.\n\nThe *Scripture* states: \"The True Dao cherishes life and abhors killing.\" Longevity is the Dao; death and decay are not. A dead king is not even equal to a living mouse. Therefore the sage’s teachings urge compassion toward all living beings—life is precious. Those with minds should carefully study the *Five Thousand Words*. This scripture enables one to guard the Dao and abide forever, without birth or death. The Dao’s fundamental source lies in this scripture.\n\n*Explication of the Three Heavens, Scroll the Upper Concluded*\n*Explication of the Three Heavens, Scroll the Lower*\n*Composed by Xu, Disciple of the Three Heavens*\n\nLaozi’s teachings urge guarding the root and securing the foundation. All people are born from the Dao’s qi; losing the Dao’s qi means death. Thus he urges contemplating the true and meditating on the Dao, strengthening the root and foundation, not losing one’s source—then one may live forever without dying.\n\nThe *Scripture* says: \"A hundred-foot tower begins with its foundation.\"\n\nThis is precisely what is meant. The Dao’s qi is most subtle—it cannot be seen, cannot be heard. Meet it and it has no front; pursue it and it has no rear. It encompasses the Six Directions, covers and bears Heaven and Earth. Its virtue is revered above the Highest Sovereign; its merit towers above the Two Modes. The divine and enlightened ruler who respects it gains fortune; who slights it meets misfortune.\n\nYet fortune does not come because the Dao aids one to obtain it, nor does misfortune come because the Dao strikes one to incur it. The Dao is without partiality—it merely accords with what one does. The retribution for good and evil responds like an echo: act evilly and evil comes; act auspiciously and good comes, following what one practices. If the Dao had preferences or could be possessed, those who attained it would then use it to elevate their parents above themselves, abandon their wives and children, and offer themselves entirely to their lords. But since this is impossible, the Dao resides within oneself, not in others.\n\nThe Dao is Nonbeing. All things arise from Nonbeing; what exists takes Nonbeing as its root. The *Scripture* says: \"Nonbeing—one does not know whose child it is, yet we forcibly name it the Dao.\" What exists ultimately returns to Nonbeing. One who perceives Nonbeing forgets the self. To forget the self is to forget all things. To forget is not to love things. Having no love for things, one loves only Nonbeing. Nourishing perception with Nonbeing, one does not take the body as the body.\n\nO my disciples, abiding between Being and Nonbeing, you will have no cares. What is called form without form, color without color, flavor without flavor, sound without sound—the Dao constantly abides in Nonbeing, yet people do not know it. Thus the *Scripture* of Lord Lao says: \"The reason I have great trouble is that I have a body. If I had no body, what trouble would I have?\" This is what is meant—profound indeed, complete!\n\nKnowing the ancient beginning, returning to simplicity and reverting to the true, recovering the primordial Nonbeing of high antiquity, one merges with the Dao as one. Having form yet no substance, the Perfected Person can appear or vanish, moving with emptiness, casting no shadow at noon—all is having no body. When body and Nonbeing unite, there is no substance or shadow.\n\nThus the *Scripture* says: \"Those who study the Dao have a household, a body, a mind. With these three, greed and desire are not extinguished, jealousy and harm are not removed. The divine Perfected soar high, thoughts cannot reach them, the myriad demons are not subdued. This is called having Being, never attaining Nonbeing; Nonbeing is not embraced. Serene and without action, without words or arguments, appearing dull or coarse, neither born nor dying, never returning—this is the wonder, profound indeed, complete!\"\n\nFor those who study the Dao, nothing precedes purification. Externally, one does not stain with worldly dust; internally, the five viscera are clear and empty. Descending Perfected and summoning spirits, one dwells in union with the Dao. Those who cultivate long-term purification unite with the Dao’s Perfected and do not violate prohibitions. Thus the Celestial Master’s transmitted teaching says: \"To study without practicing purification is like walking in darkness without holding a torch.\"\n\nThis purification should be the first step in studying the Dao. When one wishes to invoke the numinous and inform the unseen, establishing purification, one should first practice dispersal purification. One must eliminate stale food and foul odors, cleanse the body, and remove all defilement—only then may one enter purification. Otherwise, mere washing and bathing leaves filth within the flesh and bones, which water cannot remove.\n\nEven in the ancestral sacrifices of the Tiantai Duke’s family and the worship at numinous shrines, dispersal purification is observed first—how much more so for those seeking the descent of the Perfected through the true Dao! Yet I often see today’s vulgar libationers wearing countless talismans and amulets, performing few prostrations and prayers. They claim to be adepts of the Great Dao, already Perfected Persons, unafraid of defilement. They further cite *Scripture* saying: \"The true Dao has nothing to fear—entering fire, it is not burned; entering water, it is not chilled; entering filth, it is not defiled; entering weapons, it is not harmed.\" They believe themselves to have attained the true Dao—how laughable!\n\nNot fearing defilement does not come from wearing many talismans to ward off impurity, but from the inner and outer truth of the body. Internally, without deviant thoughts, the divine Perfected are full; externally, without improper conduct, defilement cannot stain. Only thus can one be unafraid of great defilement. It is like uncarved wood: its substance is naturally empty, and when mud and dirt cling to it, the stain is hard to remove. But jade is true and solid—filth cannot taint it. The true and the untrue, their appropriateness in treading through defilement, are just like this.\n\nStudy has several levels. The study of the Great Vehicle should calm the mind and settle the heart, contemplate the true and focus on the mysterious. Externally, one appears empty; internally, like a fortress of gold. Incense communicates qi; the mouth forgets speech. With a mind of compassion for all beings, one first thinks of delivering others, then delivers oneself, all aiming for ascension to immortality. One does not think of wealth or money, turns the heart to reverence and gratitude, does not weary body or spirit, seeks the true within—only then does one penetrate the mysterious. Thoughts unite with the Dao, and there is no need for much exposition. One may be said to breathe with the Six Directions, to traverse what has never been heard.\n\nThe study of the Lesser Vehicle is not so. It takes many words as good, much activity as diligence. Heads knock together, harming body and spirit; words contend, inner thoughts are not focused. Pinching incense with three fingers, one makes countless petitions: seeking immortality and deliverance from the world, flight to the Upper Clarity; desiring high office and promotion, five horses drawing one’s carriage; wishing for flourishing generations, a thousand sons and ten thousand grandsons; hoping for abundant wealth, rows of servants and maidservants; longing to extend years and avoid calamity, great and small at peace; aspiring to manage business and trade, a myriad paths opening; yearning for an enlightened mind and awakened thoughts, sharp ears and bright eyes; wanting a hundred ghosts to flee far away, plague to pass by the gate; desiring a kind father and filial son, a loving husband and chaste wife; hoping to see clearly for ten thousand miles, to perceive the source of Heaven; wishing to leave wealth to descendants, friends rejoicing—\n\n...wishing to contemplate the Real and invoke the Dao, jade maidens descending to one’s chamber. The desires sought are many, the pursuits sought are burdensome, failing to align with the Laozi’s source of guarding the One. The mouth grows weary from the words of petition, the form is worn by the toil of bowing and bending, the heart is exhausted by manifold desires, the spirit is wearied by constant coming and going.\n\nThe *Scripture* states: prolonged labor harms the spirit, prolonged speech harms the qi, prolonged walking harms the sinews, prolonged gazing harms the eyes, bearing heavy burdens harms the bones, excessive eating leads to illness, overthinking harms life—none of these accord with the methods of cultivating the body and nurturing nature. This is what is meant by: \"Much brings confusion, little brings attainment.\"\n\nThe teachings of the Lesser Vehicle involve knocking the teeth in darkness to seek numinous response. This is merely a method of instruction, guiding people to cultivate goodness, eliminate transgressions, and reform faults—it is not the way to govern the body, extend years, prolong life, or attain flight and ascension. Thus, it is called the Lesser Vehicle.\n\nAs for śramaṇas and Daoist practitioners of the Lesser Vehicle, they sit in stillness and count their breaths, resuming only after ten cycles, continuing from year’s beginning to end without momentary lapse. The Buddha’s Dharma does not permit dwelling on the body’s spirits; thus, breath-counting is the task, to sever external thoughts.\n\nDaoist practitioners of the Greater Vehicle constantly visualize the true spirits within the body—their forms, their raiment, their colors—guiding and leading them as if facing divine lords, without momentary interruption. Then external thoughts do not intrude, true spirits descend, and the heart is free of distractions.\n\nPractitioners of the Lesser Vehicle, however, are entangled by a hundred affairs, or beset by myriad worries and external concerns. The paths of the Greater and Lesser Vehicles differ entirely, bearing no resemblance.\n\nThe Lesser Vehicle requires eloquence of speech to serve as a teacher for the world. The Greater Vehicle’s study of receiving qi and guarding the One is treasured as the body’s resource. The *Scripture* states: \"The wise reckoner does not use counting rods; what they cultivate lies in the One. One who knows what is to be cultivated in the One completes all affairs—thus, counting rods are unnecessary.\"\n\nHere ends the third scroll of the *Scripture* within the Three Heavens.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "三天内解经 经名：三天内解经。 南期刘宋天师道士徐氏撰。 二卷。 底本出处：《正统道藏》正一部。 三天内解经卷上 三天弟子徐氏撰 夫人生体，上禀乎天，下象乎地。 日月则有幽明之分，寒暑则有生杀之气，雷电则有出入之期，风雨则有动静之节，人则有贤愚之质、善恶之性、刚柔之气、寿夭之命、贵贱之位、尊卑之序、吉凶之证、穷达之期。 天地无人则不立，人无天地则不生。 天地无人，譬如人腹中无神，形则不立。 有神无形，神则无主。 故立之者天，行之者道。 人性命神同，混而为一，故天地人三才成德，为万物之宗。 天不可不养生，地不可不长物，人不可不摄气而养生也。 故天违玄元则有勃蚀之变，地乖黄裳而有风震之灾，人背至道故有凋零之伤。 精气浮於上而众精流於下，上下相贯，影响相由。 人事错乱於下，则灾应灭算在上，则日月勃蚀，星辰倒错，皆由人事不正，以致斯变。 今下古民人，年命夭横，尸骨狼藉，不终年寿，皆由所修失本，婚姻非类，混气乱浊，信邪废真，本道乖错，群愚纷纭，莫知祸之所由。 或烹杀六畜，祷请虚无，谣歌鼓舞，酒肉是求。 求生反死，邪道使然。 头痒搔足，事不相由。 祈请乖越，以致灭躯，夭此年命，诚可痛哉。 今撰集《三天要解》以示未悟。 可谨而秘之，勿妄轻传。 传非其人，殃流子孙。 道源本起，出於无先，淇津鸿蒙，无有所因，虚生自然，变化生成。 道德丈人者，生於元气之先，是道中之尊，故为道德丈人也。 因此而有太清玄元无上三天无极大道、太上老君、太上丈人、天帝君、九老仙都君、九气丈人等，百千万重道气，千二百官君，太清玉陛下。 今世人上章书太清，正谓此诸天真也。 从此之后，幽冥之中，生乎空洞。 空洞之中，生乎太无。 太无变化玄气、元气、始气，三气混沌相因，而化生玄妙玉女。 玉女生后，混气凝结，化生老子，从玄妙玉女左腋而生，生而白首，故号为老子。 老子者，老君也。 变化成气，天地人物，故轮转而化生，炼其形气。 老君布散玄元始气，清浊不分，混沌状如鸡子中黄，因而分散，玄气清淳，上升为天； 始气浓浊，凝下为地； 元气轻微，通流为水。 日月星辰於此列布。 老君因冲和气化为九国，置九人，三男六女。 至伏羲女娲时，各作姓名，因出三道，以教天民。 中国阳气纯正，使奉无为大道。 外胡国八十一域，阴气强盛，使奉佛道，禁诫甚严，以抑阴气。 楚越阴阳气薄，使奉清约大道。 此时六天治兴，三道教行，老子帝帝出为国师。 伏羲时号为郁华子，祝融时号为广寿子； 神农时号为大成子，黄帝时号为广成子，颛顼时号为赤精子，帝誉时号为录图子，帝尧时再出，号务成子，帝舜时号尹寿子，夏禹时号为真行子，殷汤时号锡则子。 变化无常，或姓李名弘，字九阳； 或名聃，字伯阳； 或名中，字伯光； 或名重，字子文； 或名宅，字伯长； 或名元，字伯始； 或名显，字元生； 或名德，字伯文。 或一日九变，或二十四变，千变万化，随世沈浮，不可胜载。 至殷武丁时，又反胎於李母。 在胎中诵经八十一年，剖左腋而生，生而白首，又号为老子。 今世人有三台经者，是老子於胎中所诵者也。 反胎於李母者，自以空虚身化作李母之形，还以自胞，非实有李母也。",
      "translated_text": "**The Inner Explication of the Three Heavens**\n*Scripture Title:* The Inner Explication of the Three Heavens. Compiled by Xu, a Celestial Master of the Heavenly Master Dao of the Southern Qi and Liu-Song dynasties. Two scrolls.\n\n*Source of Base Text:* Zhengtong Daoist Canon, Orthodox Section, Part One.\n\n**Scroll One of The Inner Explication of the Three Heavens**\nCompiled by Xu, Disciple of the Three Heavens\n\nMan’s bodily form is endowed from above by Heaven and modeled below upon Earth. The sun and moon possess the division of darkness and light; cold and heat bear the qi of generation and destruction; thunder and lightning have their cycles of emergence and withdrawal; wind and rain observe the rhythms of movement and stillness. Man possesses the substance of the worthy and the foolish, the nature of good and evil, the qi of hardness and softness, the destiny of long life and early death, the stations of nobility and baseness, the order of honor and humility, the signs of fortune and misfortune, and the appointed times of success and failure.\n\nWithout man, Heaven and Earth cannot be established; without Heaven and Earth, man cannot come into being. If Heaven and Earth lacked man, it would be as though the spirit were absent from the human abdomen—form could not stand. If there were spirit without form, the spirit would have no master. Thus, what establishes them is Heaven, and what sets them in motion is the Dao.\n\nMan’s nature, destiny, and spirit are identical, merging into one. Thus, Heaven, Earth, and Man—the Three Powers—complete virtue and serve as the origin of the myriad things. Heaven cannot but nurture life; Earth cannot but grow things; man cannot but refine qi to nurture life.\n\nIf Heaven deviates from the Primordial Mystery, there arise the calamities of solar and lunar eclipses. If Earth strays from the Yellow Skirt, there arise the disasters of wind and quaking. If man turns away from the Supreme Dao, there arise the harms of withering and decay.\n\nEssential qi floats above while the multitude of essences flow below; above and below interpenetrate, their mutual resonance following one another. When human affairs are disordered below, calamities respond above by cutting short destiny: the sun and moon suffer eclipses, the stars and constellations fall into disarray—all arising from human affairs being improper, thus bringing about these transformations.\n\nIn this late age, the people’s years and destinies are cut short, their corpses strewn like refuse, their lifespans unfulfilled. All this stems from losing the root of cultivation: marriages between unsuitable types, chaotic intermingling of qi, belief in the false and abandonment of the true, the fundamental Dao gone astray, the multitude of fools in confusion, none knowing the source of their misfortune.\n\nSome boil and slaughter the six livestock, praying to emptiness; they chant, sing, drum, and dance, seeking wine and meat. Seeking life, they meet death—such is the work of heterodox ways. Scratching the foot when the head itches, their actions do not correspond. Their prayers and supplications transgress proper bounds, leading to the destruction of their bodies and the premature end of their years and destinies—truly a cause for grief.\n\nNow I have compiled *The Essential Explication of the Three Heavens* to instruct those who have not yet awakened. It must be guarded with care and kept secret; do not rashly transmit it. To transmit it to the unworthy brings calamity upon one’s descendants.\n\nThe origin of the Dao arises from what precedes the void. In the vast expanse of primordial chaos, it has no cause; it arises spontaneously from emptiness, transforming and generating all things.\n\nThe Venerable Person of Dao and Virtue was born before the primordial qi. He is the most exalted within the Dao, and thus is called the Venerable Person of Dao and Virtue. From this arose the Supreme Clarity, the Primordial Mystery, the Utmost Three Heavens, the Boundless Great Dao, the Most High Lord Lao, the Most High Venerable Person, the Heavenly Thearch, the Nine Elders of the Immortal Capital, the Venerable Person of the Nine Qi, and the myriad layers of Dao-qi—one thousand two hundred official lords beneath the Jade Platform of Supreme Clarity. When people of this age address memorials to Supreme Clarity, they refer precisely to these Perfected Ones of the various heavens.\n\nThereafter, within the hidden and obscure, the Cavernous Void came into being. Within the Cavernous Void, the Great Non-Being arose. The Great Non-Being transformed into the mysterious qi, the primordial qi, and the initial qi. These three qi intermingled in chaos, mutually engendering, and gave birth to the Wondrous Jade Maiden. After the Jade Maiden was born, the chaotic qi congealed and transformed, giving birth to Laozi, who emerged from beneath the Jade Maiden’s left armpit. Born with white hair, he was thus called Laozi. Laozi is Lord Lao.\n\nTransforming and becoming qi, he brought forth Heaven, Earth, and the myriad beings. Thus, he revolves and transforms, refining his form and qi. Lord Lao dispersed the primordial qi of the Primordial Mystery. Undifferentiated, chaotic, like the yolk within an egg, it then separated: the mysterious qi, pure and refined, ascended to become Heaven; the initial qi, thick and turbid, congealed below to become Earth; the primordial qi, light and subtle, flowed through to become water. The sun, moon, stars, and constellations were arrayed therein.\n\nLord Lao, by means of the harmonious qi, transformed and established nine lands, placing nine persons—three men and six women. By the time of Fuxi and Nüwa, they each created names, and from this issued the Three Teachings to instruct the people of Heaven. The Central Kingdom, where yang qi is pure and upright, was made to uphold the Great Dao of Non-Action. The eighty-one domains of the outer barbarian lands, where yin qi is strong and flourishing, were made to uphold the Buddhist Dao, with strict prohibitions to restrain the yin qi. In the lands of Chu and Yue, where yin and yang qi are weak, they were made to uphold the Great Dao of Purity and Simplicity.\n\nAt this time, the governance of the Six Heavens flourished, and the Three Teachings spread. Lord Lao, appearing as thearch after thearch, served as the state preceptor. During Fuxi’s reign, he was called Master Yuhua; during Zhurong’s, Master Guangshou; during Shennong’s, Master Dacheng; during the Yellow Thearch’s, Master Guangcheng; during Zhuanxu’s, Master Chijing; during Emperor Ku’s, Master Lutuz; during Emperor Yao’s, he appeared again as Master Wucheng; during Emperor Shun’s, Master Yinshou; during Yu of Xia’s, Master Zhenxing; during Tang of Yin’s, Master Xize.\n\nHis transformations were without constancy. At times he was surnamed Li, named Hong, and styled Jiuyang; at others, named Dan, styled Boyang; or named Zhong, styled Boguang; or named Chong, styled Ziwen; or named Zhai, styled Bochang; or named Yuan, styled Boshi; or named Xian, styled Yuansheng; or named De, styled Bowen. Sometimes he changed nine times in a day, or twenty-four times; his myriad transformations followed the world’s vicissitudes, beyond enumeration.\n\nBy the time of King Wuding of Yin, he returned to the womb of Mother Li. Within the womb, he recited scriptures for eighty-one years, then emerged by splitting open her left armpit. Born with white hair, he was again called Laozi. The *Scripture of the Three Terraces* that people of this age possess is what Lord Lao recited within the womb.\n\nHis return to the womb of Mother Li was his own transformation of his empty, formless body into the form of Mother Li, then re-entering himself—it was not that there was an actual Mother Li.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1240,
      "start_sentence": 0,
      "end_sentence": 60,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.91816258430481,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\三天内解经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "世人不知，谓老子托胎於李母，其实不然也。 至周幽王时，老子知周祚当衰，被发佯狂，辞周而去。 至关，乘青牛车与尹喜相遇，授喜上下中经一卷，五千文二卷，合三卷。 尹喜受此书，其道得成。 道眼见西国胡人强梁难化，因与尹喜共西入 罽宾国，神变弥加大人，化伏胡王，为作佛经六千四万言。 王举国皆共奉事。 此国去汉国四万里。 罽宾国土并顺从大法。 老子又西入天竺国，去罽宾国又四万里。 国王妃名清妙，昼寝，老子遂令尹喜乘白象化为黄雀，飞入清妙口中，状如流星。 后年四月八日，剖右胁而生，堕地而行七步，举右手指天而吟：天上天下，唯我为尊。 三界皆苦，何可乐焉。",
      "translated_text": "The world does not understand and mistakenly claims that Laozi entrusted himself to the womb of Mother Li, but this is not the case. By the time of King You of Zhou, Laozi knew the Zhou dynasty’s fortune was waning. He let his hair loose, feigned madness, and departed from Zhou. Arriving at the pass, he rode in a carriage drawn by a blue ox and encountered Yin Xi. He bestowed upon Xi the *Scripture of the Upper, Middle, and Lower* in one scroll, and the *Five Thousand Characters* in two scrolls, totaling three scrolls. Yin Xi received these texts, and through them, his Dao was perfected.\n\nPerceiving that the barbarians of the western lands were fierce and difficult to transform, Laozi and Yin Xi traveled westward together into the kingdom of Jibin. There, Laozi’s divine transformations grew even more majestic, subduing the barbarian king and composing Buddhist scriptures of sixty-four myriad words. The king and his entire nation revered and served them. This kingdom lay forty thousand *li* from the land of Han. The people of Jibin all submitted to the Great Dharma.\n\nLaozi then journeyed farther west into the kingdom of Tianzhu, another forty thousand *li* beyond Jibin. The king’s consort was named Qingmiao. As she napped during the day, Laozi commanded Yin Xi to ride a white elephant and transform into a yellow sparrow, flying into Qingmiao’s mouth like a shooting star. In the following year, on the eighth day of the fourth month, he emerged by splitting open her right side. Upon birth, he took seven steps, raised his right hand to point at the sky, and intoned:\n*“Above heaven and below heaven, only I am revered.\nThe Three Realms are all suffering—what joy can there be?”*",
      "overlap_context": " he returned to the womb of Mother Li. Within the womb, he recited scriptures for eighty-one years, then emerged by splitting open her left armpit. Born with white hair, he was again called Laozi. The *Scripture of the Three Terraces* that people of this age possess is what Lord Lao recited within the womb.\n\nHis return to the womb of Mother Li was his own transformation of his empty, formless body into the form of Mother Li, then re-entering himself—it was not that there was an actual Mother Li.",
      "start_char": 1240,
      "end_char": 1502,
      "start_sentence": 61,
      "end_sentence": 72,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.599998950958252,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\三天内解经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "生便精苦，即为佛身。 佛道於此而更兴焉。 下古僭薄，妖恶转兴，酌祭巫鬼，真伪不分。 太上於琅琊以《太平道经》付干吉、蜀郡李微等，使助六天检正邪气。 微等复不能使六天气正，反至汉世群邪滋盛，六天气勃，三道交错，疠气纵横，医巫滋彰，皆弃真从伪，弦歌鼓舞，烹杀六畜，酌祭邪鬼，天民夭横，暴死狼藉。 太上遣真人及王方平、东方朔，欲辅助汉世，使游观汉国，看视人情。 汉帝不信，以为妖惑。 是故汉室衰破，王莽执治。 刘氏汉帝乃是龙精之子，大圣遗体，应传二十四君，四百余年。 帝胤难绝，故令光武中兴。 其间中绝帝业者，皆由不信真正，无有辅翼，故群妖乱作，没於鬼官。 自天地开辟，乃有边夷羌、蛮、戎、狄，为中国之篱落，婚姻嫁娶，各正其类，奉事至道，各专其真，不使杂错。 自从汉光武之后，世俗渐衰，人鬼交错。 光武之子汉明帝者，自言梦见大人，长一丈余，体作金色。 群臣解梦，言是佛真，而遣人入西国，写取佛经，因作佛图塔寺，遂布流中国。 三道交错，於是人民杂乱，中外相混，各有攸尚。 或信邪废真，梼祠鬼神，人事越错於下，天气勃乱在上，致天气混浊，人民失其本真。 太上以汉顺帝时选择中使，平正六天之治，分别真伪，显明上三天之气。 以汉安元年壬午岁五月一日，老君於蜀郡渠亭山石室中，与道士张道陵将诣昆仑大治，新出太上。 太上谓世人不畏真正而畏邪鬼，因自号为新出老君。 即拜张为太玄都正一平气三天之师，付张正一明威之道，新出老君之制，罢废六天三道时事，平正三天，洗除浮华，纳朴还真，承受太上真经。 制科律积一十六年，到永寿三年岁在丁酉，与汉帝朝臣以白马血为盟，丹书铁券为信，与天地水三官、太岁将军共约：永用三天正法，不得禁固天民。 民不妄淫祀他鬼神，使鬼不饮食，师不受钱，不得淫盗，治病疗疾，不得饮酒食肉。 民人唯听五腊吉日祠家亲宗祖父母，二月八月祠祀社灶。 自非三天正法，诸天真道，皆为故气。 疾病者，但令从年七岁有识以来，首谢所犯罪过，立诸仪章符，救疗久病困疾，医所不能治者，归首则差。 立二十四治，置男女官祭酒，统领三天正法，化民受户，以五斗米为信。 化民百日，万户人来如云。 制作科条章文万通，付子孙传世为国师。 法事悉定，人鬼安帖，张遂白日升天，亲受天师之任也。 天师之子张衡、孙张鲁夫妇，俱尸解升天，故有三师并夫人。 自从三师升度之后，杂治祭酒，传授道法。 受者皆应跪受经书，还则拜送，使必是三天正法。 人多不尔者，趣得一卷经书，便言是道经，更相传付，或是六天故事，致有错乱。 承用弥久，至今难可分别。 天师受太上正一盟威之道、三天正法，付子孙传为国师，谓当终於无穷，岂有杂错。 从来未几，而今六天故事渐渐杂错。 师胤微弱，百姓杂治，祭酒互奉异法，皆言是真正，将多谬哉。 今有奉五斗米道者，又有奉无为旛花之道及佛道，此皆是六天故事，悉已被废。 又有奉清水道者，亦非正法。 云天师有奴，不知书注，难以文化。 天师应当升天，愍其敬心，勑一井水，给其使用，治病疗疾，不应杂用澡洗、饮食。 承此井水治病，无不愈者，手下立效。",
      "translated_text": "At birth, he was already profoundly austere, instantly embodying the Buddha’s form. The Dao of the Buddha thus flourished anew in this land. In later ages, moral decay spread, and malevolent forces arose—libations and shamanic rites to ghosts proliferated, and truth and falsehood became indistinguishable.\n\nThe Most High, in Langye, entrusted the *Scripture of the Dao of Great Peace* to Gan Ji, Li Wei of Shu Commandery, and others, commanding them to assist the Six Heavens in rectifying perverse *qi*. Yet Wei and his followers failed to correct the *qi* of the Six Heavens. Instead, by the Han era, heterodox forces surged, the *qi* of the Six Heavens raged, the Three Paths intertwined, pestilential *qi* ran rampant, and physicians and shamans flourished. All abandoned truth for falsehood, indulging in music, dance, the slaughter of livestock, and libations to malevolent spirits. The people suffered untimely deaths, their corpses strewn like refuse.\n\nThe Most High dispatched Perfected Ones, Wang Fangping, and Dongfang Shuo to aid the Han dynasty, sending them to observe the land and assess the people’s condition. The Han emperor, however, dismissed them as bewitching deceivers. Thus, the Han house declined and collapsed, and Wang Mang seized power. The Han emperors of the Liu clan were descendants of dragon essence, heirs to the Great Sage’s legacy, destined to rule through twenty-four sovereigns over four hundred years. Yet their imperial line nearly severed, so the Most High ordained Guangwu’s restoration. The interruptions in their reign were all due to disbelief in truth, the lack of true support, and the ensuing chaos of malevolent spirits, which consigned them to the realm of ghostly officials.\n\nSince the opening of heaven and earth, the border tribes—Qiang, Man, Rong, and Di—had served as the outer fence of the Central Kingdom. They married within their own kind, each adhering to their proper lineage, revering the Supreme Dao, and preserving their purity without admixture. But after Guangwu of Han,世俗 gradually declined, and humans and ghosts intermingled.\n\nGuangwu’s son, Emperor Ming of Han, claimed to have dreamed of a towering figure, over ten *chi* tall, his body golden in hue. His ministers interpreted the dream as the true Buddha and dispatched envoys to the Western Regions to copy Buddhist scriptures. Temples, pagodas, and monasteries were built, and Buddhism spread throughout the Central Kingdom. The Three Paths intertwined, the people grew disordered, and internal and external realms mixed. Each faction held to its own preferences—some embraced falsehoods and abandoned truth, offering prayers and sacrifices to spirits. Human affairs below grew chaotic, while celestial *qi* above raged in turmoil, causing the heavens to grow murky and the people to lose their original purity.\n\nDuring the reign of Emperor Shun of Han, the Most High selected envoys to rectify the governance of the Six Heavens, distinguishing truth from falsehood and manifesting the *qi* of the Upper Three Heavens. On the first day of the fifth month in the *renwu* year of the *Anyuan* era (142 CE), Lord Lao, in the stone chamber of Quting Mountain in Shu Commandery, prepared to ascend to the Great Governance of Kunlun with the Daoist Zhang Daoling. There, the Most High newly revealed himself, declaring that people feared malevolent spirits but not truth, and thus took the title of *Newly Revealed Lord Lao*. He appointed Zhang as the Master of the Great Mysterious Capital, the Orthodox Unity, and the Pacifier of *Qi* in the Three Heavens, entrusting him with the *Orthodox Unity Luminous Might Dao*, the statutes of the *Newly Revealed Lord Lao*, and the mandate to abolish the affairs of the Six Heavens and Three Paths. He rectified the Three Heavens, purged superficiality, restored simplicity, and returned to truth, transmitting the Most High’s true scriptures.\n\nZhang established regulations over sixteen years, and in the *dingyou* year of the *Yongshou* era (157 CE), he formed a covenant with the Han emperor and his ministers, using the blood of a white horse as an oath and inscribing a pledge on iron tablets. Together with the Three Officials of Heaven, Earth, and Water, and the General of the Grand Year, they swore: to perpetually uphold the orthodox law of the Three Heavens and never oppress the people. The people were forbidden from recklessly worshipping other spirits, ensuring ghosts received no offerings, masters took no payment, and no one engaged in licentiousness or theft. Those treating illness were prohibited from consuming alcohol or meat. The people were permitted to worship their ancestral parents only on the five auspicious *La* days and to venerate the earth and stove gods in the second and eighth months. All practices outside the orthodox law of the Three Heavens and the true Dao of the Perfected Heavens were deemed residual *qi*.\n\nFor the sick, they were to confess their transgressions from the age of seven, when they gained understanding, and establish rituals, talismans, and protocols to heal chronic and severe illnesses beyond the reach of physicians. Recovery would follow upon repentance. Zhang established twenty-four governances, appointing male and female officials and libationers to oversee the orthodox law of the Three Heavens, converting the people and accepting households with five *dou* of rice as a token of faith. Within a hundred days, tens of thousands of households flocked like clouds. He composed myriad statutes, protocols, and documents, entrusting them to his descendants to transmit as state preceptors. Once the laws were set, humans and spirits grew tranquil. Zhang then ascended to heaven in broad daylight, personally receiving the title of Celestial Master.\n\nThe Celestial Master’s son, Zhang Heng, and grandson, Zhang Lu, along with his wife, all achieved liberation through *shijie* and ascended to heaven, thus establishing the Three Masters and the Lady. After their ascension, various libationers transmitted the Daoist teachings. Recipients were required to kneel to receive the scriptures and bow in reverence upon returning, ensuring adherence to the orthodox law of the Three Heavens. Yet many disregarded this, hastily obtaining a single scroll and claiming it as a Daoist scripture, passing it among themselves. Some were remnants of the Six Heavens’ affairs, leading to confusion. The longer such practices persisted, the harder it became to distinguish truth from falsehood.\n\nThe Celestial Master received the *Orthodox Unity Alliance Might Dao* and the orthodox law of the Three Heavens from the Most High, entrusting them to his descendants as state preceptors, meant to endure eternally—how could they be adulterated? Yet soon after, remnants of the Six Heavens’ affairs gradually intermingled. The lineage of masters weakened, the common people followed mixed practices, and libationers upheld disparate teachings, each claiming orthodoxy. How grievously mistaken!\n\nToday, some follow the Way of the Five Pecks of Rice, others the Way of the Banner of Non-Action and Flowers, or the Buddhist Dao—all remnants of the Six Heavens’ affairs, long since abolished. There are also those who follow the Way of Pure Water, which is not orthodox. It is said that the Celestial Master had a servant illiterate in scripture, difficult to civilize. As the Celestial Master was to ascend to heaven, he pitied the servant’s devotion and commanded a well be dug for his use, to treat illness. The water was not to be used for washing or drinking. Those who used this well water to treat illness recovered without fail, their ailments cured instantly.",
      "overlap_context": "onsort was named Qingmiao. As she napped during the day, Laozi commanded Yin Xi to ride a white elephant and transform into a yellow sparrow, flying into Qingmiao’s mouth like a shooting star. In the following year, on the eighth day of the fourth month, he emerged by splitting open her right side. Upon birth, he took seven steps, raised his right hand to point at the sky, and intoned:\n*“Above heaven and below heaven, only I am revered.\nThe Three Realms are all suffering—what joy can there be?”*",
      "start_char": 1502,
      "end_char": 2712,
      "start_sentence": 73,
      "end_sentence": 115,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.584205865859985,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\三天内解经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "奴后归形太阴，井水枯竭。 天师以此水给奴身，后人不解，遂相承奉事者，自谓清水之道。 其清明求愿之日，无有道屋、厨覆、章符、仪，惟向一瓮清水而烧香礼拜，谓道在水中。 此皆不然也。 自奉道不操五斗米者，便非三天正一盟威之道也。 五斗米正以奉五帝，知民欲奉道之心。 圣人与气合，终始无穷，故圣人不死。 世人与米合命，人无米谷，则应饿死。 以其所珍，奉上幽冥，非欲须此米也。 汉高帝是龙精之子，起於泗水亭吏，而径登帝业。 至文帝时，老子降於河之上，因号为河上公。 文帝命驾，往问道焉。 老子授以《道德五千言》上下篇而去。 汉武帝欲学上道飞仙之法，太上又遣东方朔辅助汉治。 武帝又不知朔是真人而为吏民，令不异於凡人。 西王母、上元夫人皆轮驾降於武帝，欲成其道。 武帝不能开悟，仰感灵泽，弃荡秽浊，而贪世荣，杀伐不止，三官有血罪相牵，被发告冤，称诉鬼官，又情欲不绝，道遂不成，归形太阴。 至光武时与王莽争治，有黄河之难，命危丝发。 太上立化以助光武。 六月盛暑，使河水生冰，得度军马，以济其难。 汉祚天授应图，甘露降庭，真人驾御，神凤来仪，日回影再，中三足乌、九尾狐，灵瑞炳焕，众圣辅翼，正道助之。 自光武之后，汉世渐衰，太上愍之，故取张良玄孙道陵显明道气，以助汉世，使作洛北邙山，立大法，帝王公臣以下，莫不归宗。 当此之时，正气遐布。 汉世前后帝王，凡四百二十五年之中，百姓民人得道者甚多。 汉室骄豪息慢，不能升玄，故民人得之。 天师三世夫妻，六人为三师之任。 茅君兄弟三人为司命之任。 自王长、赵升散仙之徒，乃有百数，非可悉名。 刘氏之胤，有道之体，绝而更续，天授应图，中岳灵瑞，二十二璧，黄金一饼，以证本姓。 九尾狐至，灵宝出世，甘露降庭，三角牛到，六锺灵形，巨兽双象，来仪人中，而食房庙之祇，一皆罢废。 治正以道，荡除故气，此岂非太上之信乎？ 宋帝刘氏是汉之苗冑，恒使与道结绿。 宋国有道多矣。 汉时已有前谟，学士不可不勤之哉。 盖三道同根而异支者，无为大道、清约大道、佛道，此三道同是太上老君之法，而教化不同，大归於真道。 老子主生化，释迦主死化。 故老子剖左腋而生，主左，左为阳气，主青宫生录。 释迦剖右腋而生，主右，右为阴气，主黑簿死录。 是以老子、释迦教化，左右法异。 左化则随左官生气，使举形飞仙。 右化则随右宫死气，使灭度更生。 法服悉黑，使着黑衣以法阴气，入於黑簿也。 太上作此三道教化，法虽殊涂，终归道真，无有异也。 但人受元气以得成形，方复经坏，受阴化轮转，自为难耳。 右化虽不及左宫速易，轮转归真，亦为善乎。 所以言右不如左者，《经》言：真道好生而恶杀。 长生者，道也，死坏者，非道也。 死王乃不如生鼠。 故圣人教化，使民慈心於众生，生可贵也。 夫有心者，可熟案《五千文》。 此经皆使守道长存，不有生死。 道之宗本，在乎斯经也。 三天内解经卷上竟 三天内解经卷下 三天弟子徐氏撰 老子教化，唯使守其根，固其本。 人皆由道气而生，失道气则死。 故使思真念道，坚固根本，不失其源，则可长生不死。 《经》云：百尺之台，事由下基。",
      "translated_text": "The servant later returned his form to the Great Yin, and the well water dried up. The Celestial Master had granted this water for the servant’s body, but later generations, failing to understand, transmitted it as a practice, calling it the Way of Pure Water. On days of clear brightness when seeking blessings, they had no Daoist halls, kitchen shelters, talismans, or rituals—only facing a jar of clear water to burn incense and bow in worship, claiming the Dao resided within the water. This was entirely mistaken.\n\nThose who followed the Dao without offering the Five Pecks of Rice thereby departed from the Orthodox Unity and Alliance of the Three Heavens. The Five Pecks of Rice were rightly offered to the Five Thearchs, acknowledging the people’s desire to follow the Dao. The sage harmonizes with qi, beginning and ending without end, thus the sage does not die. Mortals harmonize their lives with rice; without grain, they would starve. What they treasure is offered to the hidden and obscure—not because the rice itself is needed.\n\nEmperor Gao of Han was the son of dragon essence, rising from a minor clerk at Sishui Pavilion to ascend the imperial throne. By the reign of Emperor Wen, Laozi descended upon the River and was thus called the River Elder. Emperor Wen commanded his carriage to seek the Dao from him. Laozi bestowed the *Five Thousand Words on Virtue and the Dao* in its upper and lower chapters before departing.\n\nEmperor Wu desired to learn the methods of the Supreme Dao for flying immortality, so the Most High sent Dongfang Shuo to assist in Han’s governance. Yet Emperor Wu, unaware that Shuo was a perfected person, treated him as an ordinary official, no different from commoners. The Queen Mother of the West and the Lady of the Upper Prime both descended in their chariots to Emperor Wu, wishing to perfect his Dao. But Emperor Wu failed to awaken, though he revered the numinous grace, casting aside filth and impurity. Clinging to worldly glory and ceaseless warfare, he accrued blood debts before the Three Offices, his unbound hair crying out in grievance to the ghostly officials. His passions unchecked, the Dao remained unfulfilled, and he returned his form to the Great Yin.\n\nDuring the reign of Emperor Guangwu, as he contended with Wang Mang for rule, he faced peril at the Yellow River, his life hanging by a thread. The Most High manifested to aid Guangwu. In the scorching heat of the sixth month, the river waters froze, allowing his troops and horses to cross and escape disaster. The Han mandate was heaven-bestowed, as revealed in the charts: sweet dew descended in the courtyard, perfected beings arrived in their chariots, divine phoenixes came to roost, the sun’s shadow reversed twice, the three-legged crow in the sun and the nine-tailed fox appeared, numinous omens blazed forth, and a host of sages lent their wings—all signs of the Orthodox Dao’s assistance.\n\nAfter Guangwu, the Han dynasty gradually declined. The Most High, pitying this, chose Zhang Daoling, a distant descendant of Zhang Liang, to manifest the Dao’s qi and aid the Han. He was made to establish the Great Law on Mount Mang north of Luoyang, and emperors, kings, ministers, and officials all submitted to his lineage. At that time, the Orthodox qi spread far and wide. Over the four hundred twenty-five years of the Han, from its early to later emperors, countless common people attained the Dao. The Han house grew arrogant and indolent, unable to ascend the Mystery, so the people achieved it instead.\n\nThe Celestial Master’s three generations of couples—six in all—served as the Three Masters’ task. The Mao brothers, three in number, served as the Controllers of Destiny. Among the scattered immortals like Wang Chang and Zhao Sheng, there were over a hundred, too many to name individually. The Liu lineage, endowed with the body of the Dao, was cut off and then renewed. Heaven bestowed its mandate as revealed in the charts: auspicious omens at the Central Marchmount, twenty-two jade disks, a cake of yellow gold to verify the imperial surname. The nine-tailed fox arrived, numinous treasures emerged, sweet dew descended in the courtyard, three-horned oxen appeared, six sacred bells took form, giant beasts and twin elephants came to roost among men, feeding on the spirits of the ancestral temple—all former practices were abolished. Governance was rectified by the Dao, old qi swept away. Was this not the trustworthiness of the Most High?\n\nEmperor Liu of the Song was a scion of the Han, ever bound to the Dao in affinity. The Song state abounded in Daoists. Even in Han times, there were forerunners—scholars cannot afford to neglect this. The Three Ways share a root but branch differently: the Great Dao of Non-Action, the Great Dao of Purity and Simplicity, and the Buddhist Dao. These three are all the methods of the Most High Lord Lao, though their teachings differ, their ultimate return is to the True Dao.\n\nLaozi presides over transformations of life, Śākyamuni over transformations of death. Thus Laozi emerged from his mother’s left armpit, governing the left, which pertains to yang qi and the Azure Palace’s Register of Life. Śākyamuni emerged from the right armpit, governing the right, which pertains to yin qi and the Black Record’s Register of Death. Hence Laozi’s and Śākyamuni’s teachings differ in their left and right methods. Left transformation follows the left office’s generative qi, enabling bodily ascent as flying immortals. Right transformation follows the right office’s mortal qi, enabling extinction and rebirth. Their dharma robes are entirely black, worn to model yin qi and enter the Black Record.\n\nThe Most High established these three teachings. Though their methods diverge, they ultimately return to the truth of the Dao, without difference. Yet humans receive primordial qi to form their bodies, only to undergo decay and receive yin transformation in the cycle of rebirth—this is inherently difficult. Though right transformation does not match the left office’s swift ease, its cyclical return to truth is also good. Thus it is said the right is not equal to the left.\n\nThe *Scripture* states: \"The True Dao cherishes life and abhors killing.\" Longevity is the Dao; death and decay are not. A dead king is not even equal to a living mouse. Therefore the sage’s teachings urge compassion toward all living beings—life is precious. Those with minds should carefully study the *Five Thousand Words*. This scripture enables one to guard the Dao and abide forever, without birth or death. The Dao’s fundamental source lies in this scripture.\n\n*Explication of the Three Heavens, Scroll the Upper Concluded*\n*Explication of the Three Heavens, Scroll the Lower*\n*Composed by Xu, Disciple of the Three Heavens*\n\nLaozi’s teachings urge guarding the root and securing the foundation. All people are born from the Dao’s qi; losing the Dao’s qi means death. Thus he urges contemplating the true and meditating on the Dao, strengthening the root and foundation, not losing one’s source—then one may live forever without dying.\n\nThe *Scripture* says: \"A hundred-foot tower begins with its foundation.\"",
      "overlap_context": "s, long since abolished. There are also those who follow the Way of Pure Water, which is not orthodox. It is said that the Celestial Master had a servant illiterate in scripture, difficult to civilize. As the Celestial Master was to ascend to heaven, he pitied the servant’s devotion and commanded a well be dug for his use, to treat illness. The water was not to be used for washing or drinking. Those who used this well water to treat illness recovered without fail, their ailments cured instantly.",
      "start_char": 2712,
      "end_char": 3935,
      "start_sentence": 116,
      "end_sentence": 174,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.69764232635498,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\三天内解经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "正此之谓也。 道气至微，不可得见，不可得闻，迎之无前，追之无后，包含六合，覆载天地，德尊上皇，功高二仪。 神明之君，敬之则有福，慢之则有凶。 故不可得而臣也。 福者亦非道佑之使得福，凶者亦非道伐之使得凶，唯道无亲，适人所为，善恶之报，应之若响。 为凶则凶，为吉则吉，随人所行耳。 道若有亲疏，可得彼此者，得道之人，则应以道上其父母，遗其妻子，奉献其君。 不能得如此者，则道在己身，不由他人。 道者，无也。 一切之物皆从无生，有者则以无为本。 《经》云：无者，不知谁之子，强字之曰道。 有者终则归无。 能察无者，则忘其身。 忘身者，一切之物都尽忘之。 忘之者，是不爱物。 既不爱物，唯无是爱。 无以养见，不以身为身。 悠悠吾子，处有无之间，不有忧患也。 所谓形无形，色无色，味无味，声无声，道常在无，人不知。 故老君《经》云：吾所以有大患者，为吾有身。 及吾无身，吾有何患。 此之谓也，深哉毕矣。 是知古始，还朴反真，复上古之始无，则与道合同。 有形而无体，故真人能存能亡，承虚而行，日中无影，皆是无身。 身与无合，故无有体影也。 故《经》云：学道有家、有身、有心。 有此三者，则贪欲不灭，妬害不除，神真高游，思念无感，众魔不伏，可谓有有，竟不有无，无无不容，恬然无为，不有辞辩，似顽似鄙，不生不死，无有复反，此之妙哉，深也毕矣。 夫为学道，莫先乎斋。 外则不染尘垢，内则五藏清虚，降真致神，与道合居。 能修长斋者，则合道真，不犯禁戒也。 故天师遗教：为学不修斋直，冥冥如夜行不持火烛。 此斋直应是学道之首。 夫欲启灵告冥，建立斋直者，宜先散斋。 必使宿食臭腥消除，肌体清洁，无有玷秽，然后可得入斋。 不尔，徒加洗沐，臭秽在肌肤之内，汤水亦不能除。 自天台公家祠祀灵庙，犹尚先加散斋，而况真道求灵降者乎。 余每见今世俗祭酒，所佩符箓极多，朝礼拜数甚少。 自谓我是大道之士，已成真人，不畏掩秽。 又附《经》言：真道无所畏忌，入火不灼，入水不寒，入殗不秽，入兵不伤，谓已得道真，亦可笑者哉。 夫不畏掩者，亦非所佩符箓多而能禳却殗秽，但以一身内外真实，内无邪念，神真充实； 外无正事，玷之不污，如此可得不畏大掩耳。 譬如朴石，体质自虚，泥土染之，则玷污难脱。 玉璧真实，秽不能染。 真与不真，履殗之宜，正如此耳。 学有数品，大乘之学，当怡心恬寂，思真注玄，外若空虚，内若金城，香以通气，口以忘言，慈心众生，先念度人，后自度身，悉在升仙，不念财钱，回心礼谢，不劳身神，求真於内，然后通玄，念与道合，自无多陈，可谓呼吸六合，历览未闻。 夫小乘之学，其则不然。 唯以多辞为善，多事为勤，头颊相叩，损伤身神，口辞争竞，内思不专，三指撮香，所陈亿千，则求神仙度世，飞行上清； 又欲仕宦高迁，五马同辕； 又欲世世昌炽，千子万孙，又欲钱财丰积，奴婢成行； 又欲延年度厄，大小休康； 又欲治生估作，万道开通； 又欲心开意悟，耳目聪明； 又欲使百鬼远逃，疫不过门； 又欲父慈子孝，夫爱妇贞； 又欲彻视万里，洞见天源； 又欲使遗财於念，朋友欢欣；",
      "translated_text": "This is precisely what is meant. The Dao’s qi is most subtle—it cannot be seen, cannot be heard. Meet it and it has no front; pursue it and it has no rear. It encompasses the Six Directions, covers and bears Heaven and Earth. Its virtue is revered above the Highest Sovereign; its merit towers above the Two Modes. The divine and enlightened ruler who respects it gains fortune; who slights it meets misfortune.\n\nYet fortune does not come because the Dao aids one to obtain it, nor does misfortune come because the Dao strikes one to incur it. The Dao is without partiality—it merely accords with what one does. The retribution for good and evil responds like an echo: act evilly and evil comes; act auspiciously and good comes, following what one practices. If the Dao had preferences or could be possessed, those who attained it would then use it to elevate their parents above themselves, abandon their wives and children, and offer themselves entirely to their lords. But since this is impossible, the Dao resides within oneself, not in others.\n\nThe Dao is Nonbeing. All things arise from Nonbeing; what exists takes Nonbeing as its root. The *Scripture* says: \"Nonbeing—one does not know whose child it is, yet we forcibly name it the Dao.\" What exists ultimately returns to Nonbeing. One who perceives Nonbeing forgets the self. To forget the self is to forget all things. To forget is not to love things. Having no love for things, one loves only Nonbeing. Nourishing perception with Nonbeing, one does not take the body as the body.\n\nO my disciples, abiding between Being and Nonbeing, you will have no cares. What is called form without form, color without color, flavor without flavor, sound without sound—the Dao constantly abides in Nonbeing, yet people do not know it. Thus the *Scripture* of Lord Lao says: \"The reason I have great trouble is that I have a body. If I had no body, what trouble would I have?\" This is what is meant—profound indeed, complete!\n\nKnowing the ancient beginning, returning to simplicity and reverting to the true, recovering the primordial Nonbeing of high antiquity, one merges with the Dao as one. Having form yet no substance, the Perfected Person can appear or vanish, moving with emptiness, casting no shadow at noon—all is having no body. When body and Nonbeing unite, there is no substance or shadow.\n\nThus the *Scripture* says: \"Those who study the Dao have a household, a body, a mind. With these three, greed and desire are not extinguished, jealousy and harm are not removed. The divine Perfected soar high, thoughts cannot reach them, the myriad demons are not subdued. This is called having Being, never attaining Nonbeing; Nonbeing is not embraced. Serene and without action, without words or arguments, appearing dull or coarse, neither born nor dying, never returning—this is the wonder, profound indeed, complete!\"\n\nFor those who study the Dao, nothing precedes purification. Externally, one does not stain with worldly dust; internally, the five viscera are clear and empty. Descending Perfected and summoning spirits, one dwells in union with the Dao. Those who cultivate long-term purification unite with the Dao’s Perfected and do not violate prohibitions. Thus the Celestial Master’s transmitted teaching says: \"To study without practicing purification is like walking in darkness without holding a torch.\"\n\nThis purification should be the first step in studying the Dao. When one wishes to invoke the numinous and inform the unseen, establishing purification, one should first practice dispersal purification. One must eliminate stale food and foul odors, cleanse the body, and remove all defilement—only then may one enter purification. Otherwise, mere washing and bathing leaves filth within the flesh and bones, which water cannot remove.\n\nEven in the ancestral sacrifices of the Tiantai Duke’s family and the worship at numinous shrines, dispersal purification is observed first—how much more so for those seeking the descent of the Perfected through the true Dao! Yet I often see today’s vulgar libationers wearing countless talismans and amulets, performing few prostrations and prayers. They claim to be adepts of the Great Dao, already Perfected Persons, unafraid of defilement. They further cite *Scripture* saying: \"The true Dao has nothing to fear—entering fire, it is not burned; entering water, it is not chilled; entering filth, it is not defiled; entering weapons, it is not harmed.\" They believe themselves to have attained the true Dao—how laughable!\n\nNot fearing defilement does not come from wearing many talismans to ward off impurity, but from the inner and outer truth of the body. Internally, without deviant thoughts, the divine Perfected are full; externally, without improper conduct, defilement cannot stain. Only thus can one be unafraid of great defilement. It is like uncarved wood: its substance is naturally empty, and when mud and dirt cling to it, the stain is hard to remove. But jade is true and solid—filth cannot taint it. The true and the untrue, their appropriateness in treading through defilement, are just like this.\n\nStudy has several levels. The study of the Great Vehicle should calm the mind and settle the heart, contemplate the true and focus on the mysterious. Externally, one appears empty; internally, like a fortress of gold. Incense communicates qi; the mouth forgets speech. With a mind of compassion for all beings, one first thinks of delivering others, then delivers oneself, all aiming for ascension to immortality. One does not think of wealth or money, turns the heart to reverence and gratitude, does not weary body or spirit, seeks the true within—only then does one penetrate the mysterious. Thoughts unite with the Dao, and there is no need for much exposition. One may be said to breathe with the Six Directions, to traverse what has never been heard.\n\nThe study of the Lesser Vehicle is not so. It takes many words as good, much activity as diligence. Heads knock together, harming body and spirit; words contend, inner thoughts are not focused. Pinching incense with three fingers, one makes countless petitions: seeking immortality and deliverance from the world, flight to the Upper Clarity; desiring high office and promotion, five horses drawing one’s carriage; wishing for flourishing generations, a thousand sons and ten thousand grandsons; hoping for abundant wealth, rows of servants and maidservants; longing to extend years and avoid calamity, great and small at peace; aspiring to manage business and trade, a myriad paths opening; yearning for an enlightened mind and awakened thoughts, sharp ears and bright eyes; wanting a hundred ghosts to flee far away, plague to pass by the gate; desiring a kind father and filial son, a loving husband and chaste wife; hoping to see clearly for ten thousand miles, to perceive the source of Heaven; wishing to leave wealth to descendants, friends rejoicing—",
      "overlap_context": "per Concluded*\n*Explication of the Three Heavens, Scroll the Lower*\n*Composed by Xu, Disciple of the Three Heavens*\n\nLaozi’s teachings urge guarding the root and securing the foundation. All people are born from the Dao’s qi; losing the Dao’s qi means death. Thus he urges contemplating the true and meditating on the Dao, strengthening the root and foundation, not losing one’s source—then one may live forever without dying.\n\nThe *Scripture* says: \"A hundred-foot tower begins with its foundation.\"",
      "start_char": 3935,
      "end_char": 5139,
      "start_sentence": 175,
      "end_sentence": 230,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.673184871673584,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\三天内解经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "又欲思真念道，玉女降房。 所求者多，所尚者烦，不合老子守一之源。 口则疲於所请之辞，形则弊於屈折之苦，心则困於多欲，神则劳於往来。 《经》云：久劳伤神，久语伤气，久行伤筋，久视伤眼，负重伤骨，食多致病，虑事伤命，不合修身养性之法。 可谓多则惑，少则得，此之谓也。 小乘之学，叩齿冥而求灵应，此自是教化之道，使人修善除罪改过，非是治身延年益寿求飞升之法，故曰小乘之学也。 夫沙门道人，小乘学者则静坐而自数其气，满十更始，从年竟岁，不暂时忘之。 佛法不使存思身神，故数气为务，以断外想。 道士大乘学者，则常思身中真神形象，衣服彩色，导引往来，如对神君，无暂时有报，则外想不入，神真来降，心无多事。 小乘学者，则有百事相牵，或有忧愁万虑，外念所缠。 大乘、小乘，其路不同，了不相似也。 小乘学则须辩口辞，可为世师。 大乘之学受气守一，宝为身资。 《经》云：善计者不用筹算，所营在一。 能知所营在一者，则万事毕，故不须筹算也。 三天内解经卷下竟",
      "translated_text": "...wishing to contemplate the Real and invoke the Dao, jade maidens descending to one’s chamber. The desires sought are many, the pursuits sought are burdensome, failing to align with the Laozi’s source of guarding the One. The mouth grows weary from the words of petition, the form is worn by the toil of bowing and bending, the heart is exhausted by manifold desires, the spirit is wearied by constant coming and going.\n\nThe *Scripture* states: prolonged labor harms the spirit, prolonged speech harms the qi, prolonged walking harms the sinews, prolonged gazing harms the eyes, bearing heavy burdens harms the bones, excessive eating leads to illness, overthinking harms life—none of these accord with the methods of cultivating the body and nurturing nature. This is what is meant by: \"Much brings confusion, little brings attainment.\"\n\nThe teachings of the Lesser Vehicle involve knocking the teeth in darkness to seek numinous response. This is merely a method of instruction, guiding people to cultivate goodness, eliminate transgressions, and reform faults—it is not the way to govern the body, extend years, prolong life, or attain flight and ascension. Thus, it is called the Lesser Vehicle.\n\nAs for śramaṇas and Daoist practitioners of the Lesser Vehicle, they sit in stillness and count their breaths, resuming only after ten cycles, continuing from year’s beginning to end without momentary lapse. The Buddha’s Dharma does not permit dwelling on the body’s spirits; thus, breath-counting is the task, to sever external thoughts.\n\nDaoist practitioners of the Greater Vehicle constantly visualize the true spirits within the body—their forms, their raiment, their colors—guiding and leading them as if facing divine lords, without momentary interruption. Then external thoughts do not intrude, true spirits descend, and the heart is free of distractions.\n\nPractitioners of the Lesser Vehicle, however, are entangled by a hundred affairs, or beset by myriad worries and external concerns. The paths of the Greater and Lesser Vehicles differ entirely, bearing no resemblance.\n\nThe Lesser Vehicle requires eloquence of speech to serve as a teacher for the world. The Greater Vehicle’s study of receiving qi and guarding the One is treasured as the body’s resource. The *Scripture* states: \"The wise reckoner does not use counting rods; what they cultivate lies in the One. One who knows what is to be cultivated in the One completes all affairs—thus, counting rods are unnecessary.\"\n\nHere ends the third scroll of the *Scripture* within the Three Heavens.",
      "overlap_context": " longing to extend years and avoid calamity, great and small at peace; aspiring to manage business and trade, a myriad paths opening; yearning for an enlightened mind and awakened thoughts, sharp ears and bright eyes; wanting a hundred ghosts to flee far away, plague to pass by the gate; desiring a kind father and filial son, a loving husband and chaste wife; hoping to see clearly for ten thousand miles, to perceive the source of Heaven; wishing to leave wealth to descendants, friends rejoicing—",
      "start_char": 5139,
      "end_char": 5546,
      "start_sentence": 231,
      "end_sentence": 246,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.555230379104614,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\三天内解经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}