{
  "source_id": "三洞赞颂灵章",
  "source_file": "chunked_daozang\\三洞赞颂灵章.json",
  "total_chunks": 14,
  "total_original_chars": 16995,
  "total_translated_chars": 110162,
  "total_translation_time": 615.062520980835,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\赞颂类\\三洞赞颂灵章.txt",
    "category": "赞颂类"
  },
  "full_translation": "**Hymns of the Three Caverns: Divine Chapters**\n\n**Title:** *Hymns of the Three Caverns: Divine Chapters*. Three fascicles. Source text: *Daoist Canon of the Zhengtong Era*, \"Hymns and Eulogies\" section of the *Dongzhen* Department.\n\n**Fascicle One**\n\n**Hymn to the Life-Bestowing Command of Jade Purity**\nI bow my head to the Most High Lord of Jade Purity,\nI bow my head to the Emperor of Golden Towers and the Void.\nEncompassing creation, moving yin and yang,\nIn its ultimate state, naturally free from stagnation.\nGiving birth to heaven, earth, and all beings,\nFive-colored auspicious radiance follows wisdom everywhere.\nDelivering countless beings beyond thought or measure,\nI dare to rely on this auspicious light for salvation.\nI surrender my life to the Venerable One in the Eastern Palace,\nI surrender my life to the Saviors of the Ten Directions.\nSubtle radiance pervades the three thousand worlds,\nWisdom silently penetrates the five gates of suffering.\nEver with vast and mighty divine power,\nCompassionately saving the suffering and delivering the lost souls.\nGuiding the lost from evil paths to return to the True,\nThe great Dharma Bridge of deliverance endures forever.\n\n**Mysterious Petition to the Flower Canopy and the True Congealed Qi**\nThe hidden and subtle Palace of the Pistil is the immortal’s abode,\nThe Dao pierces the pivot of spirit, the white radiance of the perfect sphere.\nFlying roots scatter leaves on kingfisher branches,\nWondrous qi of the Three Flowers penetrates the profound and clear.\nLush and numinous, the pure land of the Perfected,\nClouds and light surge forth in dazzling brilliance.\nThe Three and Five unite with the divine mushroom in the Mud Pill Palace,\nStringing pearls to secure the spirit and enliven the qi.\nFlying mists and wondrous vapors dispel lingering misfortune,\nRefining and attaining flight as immortals to escape calamity.\nGreat Mystery and Great Harmony reside in the Right Mansion,\nThe Perfected of Purple Clarity preside over the Dao.\nWithin emptiness, tranquility, and contentment, naturally at ease,\nReversing age to return to the womb, guiding to the Mystic Garden.\nKnowing the masculine, guarding the feminine, drawing on celestial mechanism,\nReversing and returning, the ruler stabilizes the center of heaven and earth.\nFlying mystery and divine qi merge with the Azure Mystery,\nHolding the elixir, exhaling fragrance, illuminating the midnight and noon.\nRefining and nurturing the numinous root so it never withers,\nThe ten thousand spirits gather, the host of yin beholds.\nJade frost and resonant tones bathe the dead body,\nWandering in silence, the cycle must be universal.\nSeizing the dragon, capturing the tiger, seated in the whirlwind chariot,\nHidden rhymes and flowing sounds roam the wondrous mansion.\nYellow blossoms and vermilion nectar lave the yang essence,\nThe myriad Dao’s qi uplifts the assembly of immortals.\n\n**Mysterious Qi Gathers the Flying Radiance of Wondrous Flowers**\nThe Dao pierces the Azure Mystery, gathering pristine auspiciousness,\nNuminous Treasure and flying Perfected merge with jade-like wondrous qi.\nNurturing the hun and fostering the po to return to golden countenance,\nThe five viscera bloom with splendor, congealing radiant verdancy.\nThe Three Fields soar in lushness, reflecting the Flowery Peaks,\nPrecious luminaries of the mysterious and yellow stand in solemn assembly.\nLifting the sun and moon, moving the pivot of the celestial sphere,\nThe Nine Qi herald spring, unfolding the earth.\nHolding harmony, exhaling pistils, illuminating the golden lotus,\nThe black dragon spits pearls, displaying iridescent wings.\nPhoenixes sing and soar, facing the honored guests,\nTigers roar in the empty cliffs, their splendor resplendent.\nGazing through the Three Realms, the hundred passages shine clearly,\nThe six wefts and seven warp threads align heaven and earth.\nFlying spirits and radiant scenes cast forth fiery numina,\nThe Eastern Well and Celestial River bathe the hidden and dark.\nNine dragons leap and bound through the soaring Treasure Garden,\nCircular radiance blazes in total brilliance, all reins raised.\nFlying rosy clouds gather, chewing the jade root,\nScene after scene, womb immortals give birth to the myriad forms.\nA thousand calamities vanish, crushing malevolence,\nThe hidden chamber’s light—what can strike it?\nPurple blossoms merge with the Azure Mystery Palace,\nLightning flashes, thunder rushes, crimson clouds conceal.\nThe Cloud Terrace and Azure Vault, grains of millet pearls,\nGuiding and illuminating the luminous Mystery, the Two Qi shine.\nFocusing thought on the Left Mansion, awakening to the Mystic Mechanism,\nReversing and cycling yin and yang to attain the highest rank.\n\n**Hymn to the Lord of the Nine Qi of Azure Numinosity**\nThe Eastern Flowery emits numinous phoenixes,\nThe Western Palace strikes jade-like tones.\nThe Three Qi knit the empty cavern,\nThe Great Void gives birth to the center.\nNuminous scriptures unfold in seven strips,\nTreasure texts flourish in the verdant forest.\nPhoenix blessings follow the celestial resonance,\nThe six hours chant in harmony with the seasons.\nAbove, the Youth Who Delivers Lives,\nIlluminating the long night, dispelling the dark.\nThrough ten thousand kalpas, preserving the luminous form,\nVast and distant, none can seek it.\nForever refining the undying years,\nFloating and sinking with the course of fate.\nSun and moon shine upon the numinous soul,\nThe pivot of the celestial sphere turns to the southeast.\nThe Nine Stars cast their forms and shadows,\nTreasure flowers bloom in the five hearts.\nNaturally possessing the undecaying spirit,\nIt harmonizes with me like cinnabar and gold.\nThe Red Script inspects the qi of the registers,\nJade formulas wondrously declare themselves.\nThe Vermilion Palace holds the Green Registers,\nDemons and spirits dare not invade.\n\n**Hymn to the Lord of the Three Qi of Cinnabar Numinosity**\nCrimson clouds and jade-like emptiness,\nNuminous winds unfold the Great Subtlety.\nVast and distant, the Six Qi descend,\nSubtle and faint, they exhale numinous radiance.\nRiding my shadow at midday,\nI rein in and follow heaven’s revolution.\nThe Vermilion Youth dons the numinous night,\nRefining the Yang Cavern, tempering the setting sun.\nJade chapters deliver the hastened years,\nNuminous songs open the five spirits.\nEndless waves without ceasing,\nA single thought enters the Nine Enclosures.\nThrough countless kalpas, transcending the hidden ages,\nThe flowery life does not decay or decline.\nFlying immortals traverse the layered barriers,\nThe Southern Palace illuminates the mechanisms of misfortune.\nThe Vermilion Mound establishes the crimson registers,\nSpirits prepare, enabling the body to fly.\nSeven ancestors ascend to heaven,\nTheir blessings and virtues towering and majestic.\nThe wheel turns the empty cavern soul,\nEmerging from my Ninefold Mystery’s gate.\nNight’s radiance dons the morning sun,\nFloating and floating, riding the course to return.\n\n**Hymn to the Lord of the Seven Qi of Radiant Numinosity**\nThe Kun Terrace births jade-like tones,\nJade qi reaches the distant Seven Darknesses.\nTreasure chapters pierce the Great Void,\nDrawing the true into formlessness.\nBroidered clouds and crimson sun,\nCircular blossoms follow the moon’s birth.\nMerging with the qi of spontaneity,\nVast and distant, the Ninefold Mystery is pure.\nSix wisdoms, pure Brahman conduct,\nFive spirits possess lofty numinosity.\nThe Crimson Mansion shines with vermilion radiance,\nThrough ten thousand kalpas, undecaying and unscattered.\nEver abiding, the Lord Who Loves Life,\nThe Great One unites with the Yellow Tranquility.\nPreserving life, delivering the talismanic registers,\nRefining the hun in the Golden Flower Court.\nGuiding to return to the undying qi,\nFloating and floating, riding the course to life.\nThe Seven Mysteries enter the Southern Palace,\nWithered bones become fresh and flourishing.\nEver joyful, ascending the floating clouds,\nSoaring high, playing in the painted chariot.\nCarefree beyond the Great Veil,\nThe Three Realms cannot slight it.\n\n**Hymn to the Lord of the Five Qi of Mysterious Numinosity**\nFlying steps enter the Northern Clarity,\nGrasping the true, summoning the Supreme Prime.\nRiding the radiance, gazing toward the Mysterious Terrace,\nFour blossoms birth broidered clouds.\nWithin, the mushroom-gathering youth,\nFeathered robes—how they flutter!\nSinging the long song of the Ninefold Life Registers,\nThe Golden Record and Red Script texts.\nTen absolutes, the distant Flowery Court,\nFloating and floating, delivering the banner of life.\nThe green canopy rides the wind in return,\nThe Cinnabar Empyrean bows to the jasper carriage.\nFor me, creating the Supreme August,\nExtracting the records from the Nine Night Gates.\nDelivering life at the Vermilion Mound’s gate,\nForever preserving the kalpas’ stake.\nLeaving the spirit to tend the Crimson Mansion,\nThe Red Child illuminates the Mysterious Pass.\nReceiving the form of the undying qi,\nNaturally giving birth to the treasure soul.\n\nThe Seven Ancestors cross the Southern Palace,\nGeneration upon generation, the gate of fortune and blessing.\n\n**Green Mystery’s True Qi Guides the Soul Chapter**\nThe Jade Capital, myriad dharmas, Great Luo’s Honored One,\nA thousandfold jeweled mantras, ten thousand mysteries’ words.\nAzure radiance and crimson clouds lead the host of Dao,\nJade towers and golden caskets unfold the true texts.\nSupreme Perfected recline in soaring flight through the void,\nThe eight poles’ flying spirits cross boundless realms.\nLush and luminous within the myriad qi,\nVoices like infants’—qi forms patterns.\nVibrating Brahma Heaven, the empty Dao,\nSerene and bright, the Dharma’s radiance is only compassion’s clouds.\nTranscending the dark crossroads of Northern Feng,\nInscribed upon golden tablets, returning to numinous clarity.\nThe blazing Fire Pool becomes cool and refreshing,\nBlades unbind, edges dull—all shatter and scatter.\nDispersing karmic realms, the Dharmakāya is empty,\nSummoning the nature of sins to our altar.\nThe Heavenly Honored’s governance knows no bounds,\nMyriad heavens, myriad lands—all become true origin.\nNone exist who are not transformed and delivered,\nTranscending the Three Realms to assist the Void Mystery.\nFollowing the heart’s call, returning as the heart desires,\nImmortal trust, Brahma’s sound like sweet springs.\nAt first hearing, the hundred bones dissolve heat and vexation,\nZhuling opens the crossing—becoming flying mystery.\nThe Great Dao transcends the mundane, entering compassion,\nNo washing of great or small—only light and fleet.\nChina’s cool clarity guides your soul,\nCarefree and solitary, stepping the Purple Void Heaven.\n\n**Golden Perfection Chapter**\nHeavenly demons ride the void, erupting,\nMyriad spirits startle the divine court.\nEntrusted with transformation’s ballad and hymn,\nFollowing change, entering namelessness.\nClamor and dust—how tangled,\nDefiled paths arise along the way.\nClouds gather, forming crimson skies,\nThe Northern Emperor surges forth divine soldiers.\nThe drum’s limit knows the Dao,\nMysterious fate comes to summon.\nUpper luminants mount flying reins,\nSwift chariots inspect the cloud camps.\nUrging the Northern Emperor’s records,\nSeizing and binding the host of demons’ brightness.\nVast and open, spreading Heaven’s net,\nUnleashing might, hurling streaming bells.\nGolden perfection guards the empty cavern,\nJade light illumines the eight darknesses.\nGolden talismans guard the upper palace,\nDivine essence slays celestial spirits.\nSevering the myriad demonic qi,\nCountless as tortoises’ ages.\nUpholding the Nine Heavens’ trust,\nWhistling commands—none do not yield.\nSummoning Perfected, exploring the Three Caverns,\nKind recitation—bright as the sun’s clarity.\nEight paths gaze toward the mysterious radiance,\nSeven revolutions weave the Heavenly Canon,\nCaverns unite with the Emperor’s One Truth,\nDelivering the Seven Ancestors’ journey.\nCutting away the five sufferings’ roots,\nReturning souls receive glory’s mantle.\nGolden light shines in the silent chamber,\nDivine candles naturally arise.\nFragrant flowers scatter the Jade Universe,\nMist and qi penetrate the Jade Capital.\nThe Emperor dispatches the lingering ranks,\nThree Primes descend in green chariots.\nSwift chariots ascend the Nine Mysteries,\nPaying court to our Jade Emperor’s court.\nMysterious sleeves flutter cloud sleeves,\nFlying through the void—joy without end.\nHigh-stepping the Seven Jeweled Grove,\nCarefree along Heaven’s long thoroughfare.\nFar-off Jade Capital Mountain,\nJasper terraces gleam with flying beams.\nGazing up at the golden palaces,\nLooking down at the white jade couches.\nWithin sits the Yellow and Old Lord,\nPurple qi revolves Heaven’s canon.\nReclining, he holds the Register of Life,\nGreen brush records the Flourishing Yang.\nFor ten thousand kalpas, endless duration,\nTranscending the realm of no death.\nCloud thoroughfares glow with bright radiance,\nJasper fields plant purple mushrooms.\nDivine winds soar the high clarity,\nClangorous sounds—how mournful!\nThree blossoms cover the eight circles,\nBrahma’s qi envelops the mysterious mechanism.\nThe utmost Dao joins the vast and empty,\nSummoning Perfected, soaring on clouds.\nChanting and singing—joyful and resplendent,\nLangfeng reflects Kun Pond.\nBelow dwell the Summoning Immortals,\nFor a thousand kalpas, playing in cloud robes.\nAgeless, roaming the myriad heavens,\nThe ten poles nest in cloud and mist.\nPurple canopies urge divine banners,\nCrimson radiance illumines the Clear Subtlety.\nYu Yi shines on the Cinnabar Ultimate,\nJie Lin glows with mysterious splendor.\nDivine winds embrace the Three Primes,\nNine Elders wave cloud banners.\nLooking up and down in the layered skies,\nFeasting in the service of numinous emptiness.\nEscorting the dawn to the Jade Guests,\nWestern Florescence arrays the high steps.\nGraceful, the Square Vases Palace,\nAzure lads tread the cloud steps.\nTurning steps, singing the Red Phoenix,\nBrightly feeding, riding clouds in flight.\nWestern feasts by Jasper Pool’s edge,\nEastern wanderings at Penglai’s ford.\nIn an instant, crossing Mulberry Fields,\nYang Valley glows with crimson dawn.\nDragon banners trail through a thousand groves,\nJeweled canopies wheel the Nine Perfected.\nStreaming bells gleam in the Central Yellow.\nGrasping the tally, dispelling demonic mists.\nMyriad immortals clap hands and laugh,\nClear songs vast and boundless.\nCraning to gaze at the Great Nonbeing,\nEqual in age to the Supreme’s guests.\nInspecting immortals, honoring the Emperor’s One,\nGolden script’s wondrous feminine and masculine.\nSoaring high, joining the Eight Primes,\nMerging the hundred spirits’ merits.\nTwo Elders and two Immortal Kings,\nFive Numinous tally with the registers.\nDivine light shines on the golden towers,\nWondrous indeed—cloud qi layered.\nThis is called the Great Cavern’s Dharma,\nNine Perfected step the mysterious void.\nGolden nectar harmonizes jade liquid,\nSwallowing and serving the lush jasper trees.\nLush Luo pays court to the Supreme,\nSleeves raised, singing Heaven’s winds.\nRiding mist, befriending rosy clouds,\nReins in hand, singing the vast and leisurely.\nNorthward ascending the Vast Cold Palace,\nMysterious flourishing—jade-polished countenances.\nFlying steps above the Heavenly Ford,\nCloud zithers sound, drums resound.\nDragon chariots harness tiger steeds,\nMorning salutations to Fusang’s sun.\nEvening rests in the jasper grove’s shadows,\nGuiding and leading the Nine Mysteries.\nRoaming the Great Void’s halls,\nLingering, moving the crimson wheels.\nReceiving the scriptures, ascending Southern Cinnabar,\nSinging long songs for a hundred million springs.\nMorning ascends the Supreme Subtlety Palace,\nEvening rests at the Constant Yang Terrace.\nHeavenly winds fan cool clarity,\nUrging the chariot, returning on fivefold clouds.\nStar pearls array the azure Han,\nGraceful, flowing through the ninefold hangs.\nVast and boundless, riding bright mist,\nRound skies feast at the jade steps.\nDivine tigers seize the myriad demons,\nNuminous might shines majestically.\nGolden perfection inspects the cloud camps,\nJade chambers reflect the numinous stairs.\nCinnabar Mound’s round and square,\nWondrous indeed—the immortals’ talents!\nSailing radiance, feasting in Purple Clarity,\nCloud banners cherish the Cinnabar Empyrean.\nGazing afar at the Jasper Terrace,\nHow distant—Heaven’s Fishing!\nFlowing winds illumine the soaring trees,\nDivine light shines on the jasper towers.\nInhaling the mysterious pearl’s blossoms,\nGolden script glows on the layered isles.\nMyriad heavens bow to the Four August Ones,\nFeathered sandals turn the misty chariots.\nEight Floating Luo phoenix canopies,\nJade trees’ radiance flies in the whirlwind.\nRosy ponds gird the divine precincts,\nA thousand ages like a single dawn.\nJewel-like, magnificent in the morning,\nNine distances transcend the non-smoke.\nLeftward, summoning Non-Brightness,\nRightward, bowing to White Prime.\nDivine light mounts the mysterious primes,\nYellow and Old Lord bends over the mushroom fields.\nAuspicious light harnesses the flying chariot,\nPlaying and controlling the flowing chariots.\nHigh August One visits Purple Tenuity,\nVast and bright, roaming the myriad heavens.\n\nThe seasons of spring and autumn know no decay,\nThrough a thousand kalpas, endless distant years.\nThe Perfect Truth seeks nothing to attain,\nYet bears aloft the radiant immortal spirits.\n\n**Hymn to the Azure Emperor**\nEastward I gaze and bow again,\nTo the Azure Emperor, Jade Sovereign Lord.\nDivine winds stir the bellows and pipes,\nNurturing all things with primal spring’s spread.\nCloud-dragons harness the solemn chariot,\nJade guards escort the jasper wheels.\nWithered sprouts revive with dewy grace,\nGreat kindness flows without distinction.\nMyriad immortals chant the Dao’s song,\nIn winding counsel warning gods and men.\nThe root of the heart, deluded, clings fast—\nHands clasped, kneeling, we bear vast benevolence.\n\n**Hymn to the White Emperor**\nSix Jia spirits embrace the golden gates,\nSeven Governors guard the sacred altar.\nFlying bells cast forth fiery transformations,\nMighty swords coil with giant dragons.\nThat distant, pure, numinous Perfected—\nWho dares defy their luminous decree?\nThey bind and subdue demonic spirits,\nAs frigid winds howl through the celestial frost.\nOnce baleful qi is stilled,\nThe myriad heavens swiftly find peace.\nThe true companions bear great shelter,\nKowtowing, they chant in joyous praise.\n\n**Hymn to the Red Emperor**\nThe Grand Light opens the jade pivot,\nThe cavernous hall unfolds its golden steps.\nSoaring forests shade the jasper terraces,\nCrimson simurghs tread the jade trees.\nPrecious chambers, resplendent in winding beauty,\nLuminous pendants mark where gods reside.\nWandering freely through cloud-wrought paths,\nThe gaze lingers on the Perfected Capital.\nThe celestial sun knows no dusk,\nLayered mists veil the azure abode.\nThe Supreme Lord’s seal unfurls,\nSilk and bamboo bear the writ divine.\n\n**Hymn to the Black Emperor**\nWithout form, he governs all things,\nAbyssal—O heart of the Supreme Lord.\nThe Dao neither opens nor reveals,\nIts wondrous workings deep in mystery’s weave.\nLest your thoughts leak unfinished,\nDark musings suddenly spread and seep.\nThe wheel turns the boundless waves,\nBitter paths entangle and mislead.\nFor ten thousand years, ever vigilant,\nYet in a single day, self-drowned and lost.\nWithout equanimity, you fall to ghostly realms,\nCalamity’s reproach cannot be borne.\n\n**Hymn to the Yellow Emperor**\nThe myriad heavens bow to the Central Palace,\nReining chariots at the Jade Pool’s root.\nThe trigger mechanism spans countless eons,\nLuminous and vast, it opens the four gates.\nThe Great Possession blends with the August Perfected,\nSubduing the souls of stars and constellations.\nWithout the Emperor, the Dao does not turn—\nAll directions depend on his presence.\nWrath and fury bring frosty autumn,\nHarmony and joy make spring’s warmth.\nCreation and completion grasp the primal record,\nGazing upward, we bear boundless grace.\n\n**Azure Emperor’s Hymn of Demon-Quelling**\nLuminous brilliance nurtures primal essence,\nAzure splendor unfolds great clarity.\nIt spreads and fosters the qi of the Nine Heavens,\nGiving birth to the first offerings of Non-Brightness.\nSupporting yang, it governs and commands,\nCinnabar groves unite with the host of Perfected.\nAccumulated dawn’s radiance ascends,\nLush and layered, bright clouds quake.\nDivine light illumines the net of stars,\nGuarding and nurturing form and soul.\nBlended transformations merge with the mysterious scene,\nBenevolence and kindness dispel demonic hordes.\nTen thousand cycles—Dao transcends all,\nMerit complete, it ascends to Highest Clarity.\n\n**Red Emperor’s Hymn of Demon-Quelling**\nThree qi gather at the numinous gates,\nLuminous and void, they gleam with jade cinnabar.\nThe Crimson Mound holds the Emperor Perfected,\nVermilion clouds fly with crimson chariots.\nGoverning and guiding within the ten thousand realms,\nGuiding and surpassing countless eons.\nHolding the whip, consulting the sacred registers,\nProclaiming the cavernous scriptures, unfolding divine chapters.\nUntying knots, dispersing roots of misfortune,\nMolten gold shatters the wicked and treacherous.\nIf the will can perfect this Dao,\nDemonic trials all vanish before it.\nSafeguarding passage across the kalpa’s dark ford,\nGazing in bliss through endless years.\n\n**White Emperor’s Hymn of Demon-Quelling**\nThe Western Numinous turns the seven measures,\nVast and subtle, it gathers bright splendor.\nWhite Prime sustains my spirit,\nAugust Perfected steer the radiant clouds.\nLuminous, the Three Pure Lights,\nBrilliant, they shatter the hundred evils.\nDrawing in sound, extending the primal qi,\nGolden essence nurtures the Three Fields.\nRefining and congealing, they solidify jade substance,\nPrecious radiance gleams with jasper brilliance.\nDemon essences face annihilation’s trial,\nEven to the earth’s depths, none sink or linger.\nReins loosed in the high, pure halls,\nWheels aligned with the Supreme Immortals.\n\n**Black Emperor’s Hymn of Demon-Quelling**\nNorthern Mystery’s three blossoms flourish,\nThe Supreme Lord’s Purple Emperor resides.\nGathering qi, it governs the hidden dwellings,\nCreation unfolds the numinous net.\nBelow, it commands the Void and Danger’s essence,\nPrecious nurturing in the Heavenly Origin’s chamber.\nSpirit connects with the wondrously subtle,\nWrapping and guarding the hundred passes.\nVast and open, it destroys demonic trials,\nOminous disasters never dare approach.\nThe Great Dao preserves the natural,\nLifespan knows no loss or harm.\nThrough ten thousand kalpas, joyous assemblies,\nIn daylight, they ascend the cloud-wheels.\n\n**Yellow Emperor’s Hymn of Demon-Quelling**\nBlended transformations return to profound subtlety,\nThe Primal August unites the Emperor’s spirit.\nThe True Elder seals the Yellow Gates,\nThe Four Governors align with the mysterious balance.\nCircular splendor soars above the Great Spread,\nTogether they bear the steadfast King Perfected.\nBinding the ford, they secure the hundred bones,\nJasper radiance enfolds the embryonic immortals.\nMorning brilliance pours into luminous scenes,\nDemons respond by self-annihilating form.\nTen thousand Dao safeguard without loss,\nReturning old age to youthful infancy.\nFive assemblies merge into one qi,\nFlying chariots transcend the Cloud Capital.\n\n**Eulogy of the Dragon Han’s Beginning Azure Jade Calendar**\nNine yangs return the wondrous qi,\nThree lights scatter the primal essence.\nEmerald mists float the numinous script,\nAzure groves gleam with pure blossoms.\nTranscendent, they reach the Jade Clarity’s palace,\nVast and distant, Penglai’s isles.\nTrue transformations flow without pause,\nDivine winds nourish the myriad lives.\n\n**Eulogy of the Crimson Brightness’ Cinnabar Light Jade Calendar**\nVast kalpas open divine destiny,\nDragon scripts float on crimson clouds.\nEight Mighties surge like lightning,\nNine phoenixes shatter the inauspicious.\nRefining and transcending the Cinnabar Emperor’s chamber,\nAscending to the Primordial Beginning’s home.\nFiery brightness ever continues its illumination,\nNuminous blessings gather in morning’s splendor.\n\n**Eulogy of the Supreme August’s Central Numinous Jade Calendar**\nPrimal Yellow generates one qi,\nStirred and transformed, it congeals true form.\nSupreme virtue upholds gentleness and compliance,\nEmbracing light, it penetrates the distant and obscure.\nEstablishing the center, it encompasses the Nine Poles,\nGrasping the root, it governs the Three Dawns.\nResplendent at heaven’s apex,\nFlying rays illuminate the jade numen.\n\n**Eulogy of the Extending Prosperity’s Pure Numinous Jade Calendar**\nThe August Elder stores numinous purity,\nGolden essence gleams with the Dipper’s might.\nThe Six Heavens are all beheaded and destroyed,\nThe ten thousand treasures return to hidden subtlety.\nBracing qi floats above the lofty gates,\nCold light gathers in pure radiance.\nEmpty Unity dons the jade bridle,\nSplendid, it soars through the Nine Empyreans.\n\n**Eulogy of the Opening August’s Mysterious Supreme Jade Calendar**\nFive qi accord with the primal mystery,\nAll heavens blend with the Great Obscurity.\nCelestial essence flies with feathered darkness,\nJade maidens scatter azure blossoms.\nPurple writs seal the heavenly treasures,\nMysterious light chills the imperial court.\nAll demons revere the supreme transformation,\nThe myriad lands preserve peace and tranquility.\n\n**Celestial Luminous Chapter**\nFlying mystery, purple qi congeals the numinous root,\nThe net of Jade Clarity governs the myriad gods.\nIn the void, seething and surging, it forms naturally,\nAbove, tiered layers transmit the twelve transmissions.\nJasper towers, towering, shine with radiant clouds,\nFlowing essence, purple gates gird the golden chariots.\nJewel halls, resplendent, encircle the eight soaring ones,\nWithin dwell the Nine Numinous Immortals of azure gold.\nThe Cinnabar August True Mother is named Essence-Extending,\nFlying azure feathers crown the morning’s infant sovereign.\n\nHolding jade tablets and grasping numinous banners,\nFive-colored spirits command demons before the imperial honor.\nGrasping talismanic registers at the Gate of Life,\nChewing the sun and moon, sipping from the sweet spring.\nThe Net of Li radiates brilliance to refine the five souls,\nInternally replete and externally overflowing, the Crimson Palace rejoices.\nGolden light shines resplendently, form perfectly round,\nFrom the new moon entering metal, colors merge in primordial chaos.\nOnly the Enlightened One understands these words,\nOn the fifth day of the sun and tenth of the moon, facing the Northern Origin.\nAt once beholding the flowery canopy leading the immortal lords,\nPurple qi swirls leftward, linking with the Dipper.\nPassing through the four sevens into the Golden Gate,\nJust as the Cinnabar August One reviews the myriad immortals.\nThose who clearly grasp this secret with diligent effort,\nSecretly recite and silently ponder, ever mindful of its divisions.\nMarvelous visions respond to the essential text,\nAfter three years, one may securely preserve long life.\nAfter nine years, riding the void in feathered skirts,\nPhoenix robes lightly soaring to ascend Dragon Mountain.\nGazing up and down at the Nine Numinous Ones to pay homage to the Jade Dawn,\nOne becomes a Great Perfected of the Numinous Treasure.\n\n**Hymn to the Jade Dawn Lord of the East**\nVast and boundless, linked to the flowery gates,\nDivine honor, true unity of the imperial One.\nNuminous void intermingles with sun and moon,\nMysterious awakening illuminates the dark ford.\nJade Pass revolves the reckoning of fate,\nBrahmic qi initiates the capital’s radiance.\nBanners wave, intoning cavernous chants,\nHeavenly lords wield the wheel of transformation.\nGolden splendor leads the immortal registers,\nFragrant sashes gird the Dragon Mountain Palace.\nPrecious effulgences gleam with wondrous light,\nFeasting and reveling in the loftiest walls.\nMisty vapors scatter marvelous mists,\nRefining essence to nurture my form.\nFlying immortals observe the kalpa’s assembly,\nChanting the primordial scriptures of the Origin.\nThe Supreme Ultimate establishes the azure key,\nMorning radiance spreads forth generation.\nLuminous brilliance responds to the vaulted observance,\nJoyful harmony preserves the Jade Infant.\nImperial nurturance revolves the chariot of light,\nAscending the seven ancestral souls.\nExtending the net of flying principles,\nEncompassing the roots of heaven and earth.\nAuspicious clouds veil the towering skies,\nPurple abodes of the Perfected Lords.\nLofty and serene, the Pure Mystery Palace,\nEradicating trials and expelling evil and misfortune.\nThe Dao responds to the primordial vastness,\nSpirit congeals in the Niwan Palace’s essence.\nThe numinous mound’s threefold white clouds,\nInterwoven radiance crisscrosses the jade peaks.\nSeven nines unite in application,\nThree fives combine in shared merit.\nTogether harmonizing the virtue of central harmony,\nTransforming and refining to transcend the immortal lineage.\n\n**Hymn to the Jade Dawn Lord of the South**\nRadiant harmony shines with luminous brilliance,\nFiery splendor refines the jade countenance.\nEmpty Brahma veils the distant mystery,\nVast clarity reveals divine merit.\nNinefold splendor shatters the dark records,\nFour poles extend the springs of life.\nThe Yellow Chamber abides in morning light,\nEndlessly preserving long life.\nGraceful and remote, the moon’s consort ascends,\nMyriad realms transcend the kalpa’s wheel.\nChaotic profundity veils the jade scriptures,\nDragon Han shines with crystalline clarity.\nDivine texts command the Six Heavens,\nScrutinizing and restraining demonic hordes.\nEvil trials dare not approach me,\nNames inscribed in the Highest Clarity.\nTranscending the five sufferings,\nCarefree upon the Mystery’s towering peak.\nFlying spirits open the great destiny,\nBeholding the ninefold layers of clouds.\nRefining my soul in the southern ascent,\nRevolving canopies roam the soaring groves.\nMisty vapors entwine the void’s net,\nTenfold revolutions return through Heaven’s Pass.\nGreat demons all come as guests,\nEntering the light to pay homage to the Purple Tenuity.\nDragon Abyss pours into the Eastern Well,\nYellow splendor nurtures my true self.\nThe Great Net’s colorless light,\nSilently transcends those of boundless origin.\nVermilion spirits harmonize the supreme qi,\nGrand harmony ascends the Hall of Blessings.\nMystic terrace reflects lush verdure,\nReciting cavernous scriptures, following the Western Numinous.\nDivine lords spread the mysterious model,\nReturning to infancy, equal to nature.\n\n**Hymn to the Jade Dawn Lord of the West**\nCavernous spirits mirror the towering gates,\nReceiving the decree, Lord of Good Life.\nNuminous youths refine through fire’s trial,\nFortune’s halls traverse the springs of life.\nThe Great Desert clarifies the Dao’s manifestation,\nPerfected ones soar upon radiant clouds.\nLofty clarity spreads the primordial transformation,\nSweeping away filth and dispelling demonic vapors.\nReceiving my jade-green chariot,\nAscending into the Gate of Subtle Mystery.\nRadiance raised in the vast and boundless home,\nIlluminating the Ninefold Mystery’s Perfected.\nCreation revolves the dark passes,\nProfoundly establishing the numinous root.\nThe Radiant August connects lush splendor,\nReviewing and transcending immortal souls.\nTowering peaks of the White Prime Youth,\nCavernously accompanying the imperial guests.\nThe Origin’s King within Heaven’s midst,\nSilent and still, the Void’s Primordial Court.\nThe Jade Dawn extends the great model,\nFlowing blessings to cleanse my dust.\nVaulted towers intone cavernous chants,\nBinding demons and restraining ghostly forms.\nThree Origins divide the ancestral transformations,\nNine degrees all proclaimed and arrayed.\nWhite Slayer gallops through the Aligned Mounds,\nEvil contracts with the verdant covenant.\nThe Great Saint of the Miro Net,\nReborn to ascend the banquet of blessings.\nUnfettered transformation rides destiny’s return,\nErasing death to forever unite in joy.\nJewel palaces in towering realms,\nForested supports of misty flowery soarings.\nCloudy teeth receive the threefold brilliance,\nPartaking of these boundless, distant years.\n\n**Hymn to the Jade Dawn Lord of the North**\nInitiating transformation, supreme spirit,\nCelestial ascent congeals the mysterious qi.\nYang’s splendor, true unity’s essence,\nGrand harmony nurtures wondrous wisdom.\nNine Numinous guard the Western Kunlun,\nMechanisms of transformation pause at the pivotal assembly.\nPhoenix chariots ascend feathered wheels,\nSurpassing the great kalpa’s ford.\nCloudy banks embrace the round and luminous,\nNurturing the Celestial Lord of Life.\nReceiving talismans at the Feathered Forest Palace,\nFragrant splendor girds the numinous cloud’s lapels.\nEmpty skies fly the mysterious chapters,\nLifting and raising the body to transcendence.\nHeavenly governance commands the Eight Radiant Ones,\nOpening the path for the Nine Dark Souls.\nOrchid Palace links with the Purple Tenuity,\nFollowing the pattern to ascend Vermilion Mound.\nThe Southern Palace holds wondrous youths,\nJade radiance refines my form.\nAzure clouds float upon the green chariot,\nCelebrating and revering the lofty honor.\nNuminous winds ripple through cavernous echoes,\nPrecious and boundless, the ageless years.\nNine immortals bestow the registers of destiny,\nReleasing and dispersing the roots of past karma.\nFlying principles resist the empty Brahma,\nExpansively attaining the nameless return.\nThe Great Chaos records the hundred bones,\nLingering mists merge with purple clouds.\nBlessings descend to seven generations of descendants,\nMisfortunes block the threefold sources of calamity.\nUntying the sash to depart the dusty net,\nEqual reins join the carefree guests.\nIn an instant, ascending the Dragon Terrace,\nBowing before the Jade Emperor.\n\n**End of the First Scroll of Hymns and Eulogies of the Three Caverns**\n**Second Scroll of Hymns and Eulogies of the Three Caverns**\n**Applied Eulogies**\n**Hymn to the Seven Perfected**\n\nThe Supreme Most Transcendent and Mysterious School,\nExpounds the Dao and reveres its scriptures.\nWith a single bow and glance, one attains immortality,\nThrough countless kalpas, ageless years endure.\nMajestic is the Great Sage’s virtue,\nSilent and still, rooted in non-being.\nCelestial radiance weaves empty structures,\nRiding the void in natural ascent.\nSun and moon blaze with brilliance,\nPeace and harmony bring endless joy.\nTo learn immortality, sever worldly desires,\nEach thought accumulates in succession.\nComing and going disturb my spirit,\nRestless, it traverses all without cease.\nExtinguish thoughts within the void,\nWhispering into silent emptiness.\nSeek the scriptures as if parched with thirst,\nHold resolve firm as metal and stone.\nPreserve the path to flying immortality,\nThe Five Numinous Ones bestow registers of passage.\nFulfill my Six Perfections,\nThus dissolving the Three Nets.\nIn purity, worship the Primal Simplicity,\nExhale and inhale to nurture the cloud-sprout.\nCarefree within the Golden Gates,\nJade Capital becomes my home.\nNaturally, the Seven Treasures arise,\nEach person seated upon a lotus.\nGazing up, I chew the immortal fruits of Xuandu,\nBending down, I savor the hollow melons of the void.\nDivine countenance shines like the crimson sun,\nWhy reckon the multitude of kalpas?\nThe dharma drum summons the assembly of immortals,\nThe tolling bell subdues the great demons.\nA sacred breeze fans wondrous blossoms,\nResplendent, unfurling rich robes.\nHeavenly Perfected strum the cloud zither,\nAll Perfected pluck the numinous harp.\nElegant songs of the Three Heavens’ radiance,\nScatter wisdom through the Jade Flower Grove.\nSeven generations of ancestors ascend to the Hall of Blessings,\nHenceforth treading the mysterious tones.\nIf past-life blessings were insufficient,\nThis scripture remains distant and hard to find.\nSincerity in the Dao knows no end,\nYet those who plot flight may sink again.\nThe Supreme Dao of Non-Action,\nIts vastness resides in the hearts of all.\nTo learn the Dao, trust in the cinnabar faith,\nRevere your master as your closest kin.\nDraw in the radiance to accompany pure splendor,\nDiligently renewing with each passing day.\nThough the multitudes may not attain deliverance,\nNeither shall I be left undelivered.\nGreat vows demand profound recompense,\nMysterious virtue must surely be true.\nHidden virtue’s transgressions run deep,\nConfronting them turns the wheel anew.\nTo learn the Dao is also most arduous,\nDay and night, cultivate the field of blessings.\nPlanting blessings is like planting trees,\nHeaped baskets form a mountain.\nIf you can immerse yourself in the mysterious and exalted,\nYou shall soar to the Pure Heavens.\nCultivate the Dao of Non-Action,\nAnd you shall bind the great covenant.\nThe Supreme’s most recondite scripture,\nIs called the *Chapter of Wisdom*.\nTo relieve suffering depends on one’s capacity,\nTranscending the mundane to attain the Real.\nA numinous countenance is no marvel in this world,\nLike a lotus in the depths of an abyss.\nEach person’s conduct has its root,\nAll stemming from past-life merit.\nEstablish virtue while the time is ripe,\nMake vows, and none shall go unanswered.\nGood and evil both await their retribution,\nThe principle of rise and fall is unfathomable.\nThe worthy uphold the Dharma’s words,\nYet the Dao also lies in forgetting both.\nTo comprehend this is great wisdom,\nAscending to become the Venerable of the Supreme Ultimate.\nJewel canopies linked with jade pendants,\nCommanding chariots drawn by nine dragons.\nGolden blossoms hold the Cavern Scriptures,\nOffering incense, cherishing the immortal youths.\nWhistling songs resound through Xuandu,\nStriking jade to chime the jeweled bells.\nRising to soar through the Great Clarity,\nTranscending radiance, roaming the cloudy skies.\nUpholding the Dharma’s words,\nWandering the mysterious ultimate in freedom.\nTen thousand kalpas are but last night,\nA thousand autumns like the morning dawn.\nTowering, shading the cloudy blossoms,\nHand grasping the branches of the Treasure Grove.\nIncense smoke arises naturally,\nThe mysterious steps need no ascent.\nSacred banners disperse in due time,\nProliferating thoughts dissolve in their season.\nExtinguish wisdom to expand the Great Chaos,\nNon-Action becomes the pure hymn.\n\n**Opening the Altar Hymn**\nVast and formless, the empty void,\nEndless, moved by the utmost numen.\nReverence invokes Heaven’s favor,\nNeglect invites demonic intrusion.\nFortune and misfortune turn with fate,\nAdversity and prosperity arise from conditions.\nThe Dao does not prize pearls or jade,\nThe spirits respond only to utmost sincerity.\nRedoubling devotion with diligence,\nPraying earnestly with profound feeling.\nNaturally, the Great Dao is attained,\nAll receive the descent of true numina.\nPinching incense to state my wishes,\nBowing my head, I hope for auspicious blessings.\nThe Heavenly Worthy ever abides in serene stillness,\nTurning my heart, I worship the distant and obscure.\n\n**Closing the Altar Hymn**\nThe great void encompasses all forms,\nThe utmost Dao is subtle and formless.\nHarmonizing with the wondrous qi,\nResonance reaches the depths of feeling.\nIn an instant, pervading the eight directions,\nVaguely, the myriad numina descend.\nHumbly presenting plain offerings,\nSubmitting my being to express sincere devotion.\nFar and wide, the phoenix canopy soars,\nFrom afar, grasping the brocade banner of the simurgh.\nThe misty palace stands lofty and lush,\nThe rosy pavilion rests high and still.\nThe jade chariot emerges from the celestial river,\nThe golden dragon enters the Great Clarity.\nSweet dew descends upon the mortal world,\nAuspicious blessings reach the hidden and obscure.\n\n**Hymn to Invoke the Mysterious Master**\nThe liturgy’s strictures are solemnly observed,\nSincerity is offered to the hundred spirits.\nPresenting words to express earnest wishes,\nA pure offering answers the lofty heavens.\nGazing down, the cloud chariot descends,\nWith a tranquil heart, I summon the Supreme Perfected.\nThe Mysterious Master, Lord of All Teachings,\nI humbly request your descent to the mortal realm.\n\n**Hymn to Invoke the Heavenly Master**\nThe Supreme Most transmitted the registers,\nInitially at Crane’s Cry Mountain.\nAccumulated merit surpassed the jade tablets,\nRanked to attend the Three Clarities.\nPresenting the scripture of guidance,\nFulfilling the sentiments of common folk.\nWhen performing the purification rite, I shall make this invocation,\nHoping you will deign to witness my sincerity.\n\n**Hymn to Invoke the Inspector of Purifications**\nYour sacred name remains in the mortal world,\nYour immortal rank is listed in the Upper Clarity.\nThree thousand merits are already complete,\nEight hundred deeds were accomplished first.\nRitual repentance cultivates true blessings,\nOverseeing the purification as witness.\nTonight, the cloud chariot descends,\nAuspicious blessings bestowed upon all beings.\n\n**Hymn to Invoke the Heavenly Officials**\nThe wondrous Dao imparts true teachings,\nPerforming purifications to establish fields of blessings.\nErecting the altar to worship the Supreme Sages,\nConvening the lofty immortals in grand offering.\nConcentrated thoughts reach the celestial extremes,\nSpirit and essence move the Supreme Mystery.\nThe Heavenly Officials ride jeweled chariots,\nTheir colorful retinues descend to the mortal feast.\n\n**Hymn to Invoke the Earthly Officials**\nReverently presenting sincere devotion,\nEarnestly gazing toward the Purple Void.\nPraying to convey the aspirations of the mortal realm,\nWishing to reach the Earth Sovereign.\nIn hidden response, bestowing true protection,\nFrom afar, descending with the register of pardoned sins.\nThe Earthly Officials arrive in descent,\nSwiftly surrounded by five-cloud chariots.\n\n**Hymn to Invoke the Water Officials**\nWith expedient means, unfolding true transformation,\nCompassionately establishing sacred rites.\nWith an empty heart, cultivate the wondrous assembly,\nHarmonizing qi, chanting numinous songs.\nSilently praying to the abyssal court,\nSincere devotion reaches the Great Net.\nThe Water Officials descend with dragon chariots,\nCloud brocade rising from the azure waves.\n\n**Hymn to Invoke the Five Emperors**\nThe Five Emperors dwell among the immortals,\nRectifying the causes of good and evil.\nAuspicious light illumines the cosmos,\nBenevolent grace rescues the sunken.\nRevealing faults to pray for true protection,\nWith a tranquil heart, moved by the sages.\nBoth the living and the dead attain joy,\nEnjoying blessings without end.\n\n**Hymn to Invoke the Scripture Master**\nEntering the retreat to cultivate the Yellow Register,\nSolemnly adorned to summon the Supreme Immortals.\nPresenting the memorial first to the throne,\nWords of sincerity await proclamation.\n\n**Hymn to Invoke the Register Master**\nWith solemn reverence, we pray for pure blessings,\nIn orderly ranks, we form the precious retreat.\nTonight we ascend the altar,\nWalking the Dao in ceaseless procession.\nThough wishes are already made manifest,\nThe eye of the Dao opens to those who turn their hearts.\nThe Register Master descends,\nHis immortal retinue alighting from the Jasper Terrace.\n\n**Hymn to Invoke the Ordination Master**\nWith scriptures and precepts, we pray with a cinnabar heart,\nIn utmost sincerity, we summon the hundred spirits.\nHolding incense, we entreat the Perfected Sages,\nUpholding precepts, we invoke the Immortal Perfected.\nPure chants rise at dawn’s first light,\nDiligent meditation persists into the night.\nThe Ordination Master descends,\nTo protect and bless those who keep the retreat.\n\n**Hymn to Send Forth the Mystic Master**\nThe Celestial Thearch commands the Perfected Immortals,\nTo cultivate the retreat at the Yellow Register altar.\nThe hosts of heaven descend,\nAs incense is burned to repent transgressions.\nHaving prayed for grace and completed the ritual,\nThe retreat’s affairs are now fulfilled.\nVast fortune remains in the mortal realm,\nWhile the Mystic Master ascends to the Nine Heavens.\n\n**Hymn to Send Forth the Celestial Master**\nThe retreat’s blessings are now perfected,\nThe memorial ascends to the Nine Heavens.\nUtmost sincerity evokes response,\nThe entire household attains longevity.\nThe Register-Keepers of the heavens stand guard,\nThe memorial’s words reach the Celestial Throne.\nAncestors are uplifted and delivered,\nDescendants rejoice in honor and promotion.\nThe Three Heavens’ Protector of the Teachings,\nHaving completed the rites, reports the accomplishment.\n\n**Hymn to Send Forth the Retreat Overseer**\nThe numinous altar upholds the Dharma seat,\nReliant on the Overseer’s descent to supervise.\nCorrecting faults while recording good deeds,\nEven the Perfected Immortals revere and admire.\nSoon the Daoist cavalcade will depart,\nVanishing into the depths of the five-colored clouds.\nThe living shall find support,\nAnd the departed shall be delivered from darkness.\n\n**Hymn to Send Forth the Heavenly Official**\nWith wondrous discipline, the retreat is conducted,\nThe luminous precepts wash away the roots of sin.\nGazing upward, we revere the supreme good,\nPouring forth earnest words in humble supplication.\nHaving submitted to the retreat’s refuge,\nWe are graced with boundless pardon and favor.\nThe Heavenly Official returns to the Jade Palace,\nHis precious chariot entering the Golden Gate.\n\n**Hymn to Send Forth the Earthly Official**\nThe floating assembly concludes its audience with the Origin,\nThe Three Paths bear their karmic fruits.\nTrue grace is proclaimed across the Five Peaks,\nSincere devotion is presented to the Three Heavens.\nThe ritual mat is rolled, the ancestral rites ended,\nThe altar is dismantled, the host of immortals sent forth.\nThe Earthly Official returns to his mountain abode,\nAscending high in his five-cloud chariot.\n\n**Hymn to Send Forth the Water Official**\nThe proclamation of the numinous sounds is complete,\nThe immortals return to the upper heavens.\nSpiritual light dispels calamities,\nSweet dew descends with the true wind.\nThe Black Dragon Chariot receives its mandate,\nReturning afar to the Supreme Treasure Palace.\nThe Water Official retires to his grotto palace,\nBestowing boundless fortune and prosperity.\n\n**Hymn to Send Forth the Five Emperors**\nThe immortal retinue arrives from the celestial heights,\nSolemnly descending to the five directions.\nInspecting the vapors, they sound their feathered batons,\nTheir simurgh chariots pause in the purified space.\nAs the retreat nears its conclusion,\nTheir carriages return to the heavens above.\nTheir flowing grace knows no bounds,\nHow could it be merely for the fragrance of incense?\n\n**Hymn to Send Forth the Scripture Master**\nThough the scriptural Dharma is subtle and wondrous,\nIts reverence depends entirely on the master.\nAll who establish goodness,\nFrequently pay homage to him.\nWhen qi flows, merit is easily achieved;\nWhen the heart is negligent, regret comes too late.\nIf one can diligently maintain mindfulness,\nMorning and evening, one will naturally soar as an immortal.\n\n**Hymn to Send Forth the Register Master**\nThe Dao holds the retreat in highest esteem,\nThe Dharma regards audience as constant practice.\nThose who neither cultivate nor uphold it,\nHow can they reach the Celestial Realm?\nWith the right bones, one enters the immortal ranks,\nNaturally opening the Purple Chamber.\nThe Dark Warrior arrays his numinous chariot,\nAnd one beholds the Golden Palace Hall.\n\n**Hymn to Send Forth the Ordination Master**\nFar away stands the Jade Capital Mountain,\nHow towering is the Mystic Metropolis!\nBrightly the long night unfolds,\nThe Perfected One rides the void.\nThe Great Dao is propagated by people,\nWhen the heart is devoted, the spirits naturally return.\nHaving completed the retreat and walked the Dao,\nWe bow our heads and take leave of the Three Masters.\n\n**Hymn of the Bright Lamp**\nThe light of the Orthodox Unity,\nFlares upward in vermilion smoke.\n\n**Hymn of the Radiant Youths**\nTwelve Luminous Youths stand revealed,\nTheir light pervading heaven and earth,\nIllumining our very selves.\nA hundred evils crumble and fall,\nTen thousand ghosts retreat in fear.\nBright radiance shines through all,\nCommuning with the true and numinous.\nThe Most High scatters light in every direction,\nVermilion lamps convey sincerity.\nAll heavens are fully illumined,\nAll earthly realms grow bright and clear.\nMy body, too, shines with light,\nMy five viscera blossom with splendor.\nScorching sunlight ascends the Great Void,\nDistant thoughts reach the Jade Capital.\nCinnabar essence abides in the Supreme Origin,\nMysterious yang resounds in the empty sky.\nGreed’s form severs the root of suffering,\nSubtle and wondrous, the true thought arises.\nHanging blossoms bear no fruit,\nCauses and conditions forever formless.\nMy body is likewise,\nRiding transformation, borne by flowing light.\nThe night’s glow marks the Cinnabar Yang,\nFar and distant, it illumines the void.\nAll heavens beam with radiant countenances,\nAll yin shadows instantly dissolve.\nMy spirit, too, grows keen and bright,\nEver delighting in wisdom and insight.\nCarefree, I traverse the Dao’s workings,\nShifting and yielding to heaven’s decree.\nRaising my form, I tread the empty vastness,\nNight’s torch dries the flowing essence.\n\n**Hymn to Extinguish the Lamps**\nMysterious yin seals the light,\nThe eternal lamp continues its brightness.\nThe Great Yang now shines forth,\nThe Eight Darknesses open to purity.\nThe lamp returns to the Great Yin,\nIts light clings to the arising radiance.\nThe Two Perfected of Sun and Moon\nMerge as one within me.\n\n**Hymn of Wisdom**\nWisdom gives rise to the root of precepts,\nThe true Dao takes precepts as its master.\nFrom this, the Three Treasures flourish,\nRevered and received by lofty immortals.\nSailing this deathless vessel,\nSwiftly one crosses the vast expanse.\nAt this moment of expounding precepts,\nAll heavens come to bow their heads.\nWisdom arises from original non-being,\nBrightly illuminating the ten directions.\nBinding emptiness, it towers in the mystic firmament,\nAll heavens draw from its flowing fragrance.\nIts wonder defies thought and speech,\nIts numinous resonance truly and subtly pervades.\nBeing culminates in non-being,\nNon-being contains all without exception.\nWisdom constantly observes the body,\nThe foremost task in learning the Dao.\nVast and boundless, it roams freely,\nNaturally recording my spirit.\nThe Heavenly Worthy ever protects and shelters,\nThe Demon King pledges his guardianship.\nResplendent is the Vajra body,\nTranscendent, the Most High immortal.\n\n**Hymn of Upholding the Precepts**\nThe Dao takes non-mind as its essence,\nAll acts become fields of merit.\nEstablishing merit has no fixed measure,\nEach follows their original vow.\nEmptying oneself to respond to beings,\nFocus the mind without partiality.\nThe Great Sage exalts the true teaching,\nJust as rain descends from heaven.\nLofty and towering, none are left untouched,\nEver humble, thus forming the abyss.\nThe sea is king of a hundred rivers,\nFor it can relinquish the dragon’s scales.\nThrough ten thousand kalpas, wisdom is preserved,\nHow could it be limited to this lifetime?\nUpholding precepts without the slightest lapse,\nLifetimes of good karmic bonds are formed.\nConcentrate thought on the Great Vehicle,\nAnd you shall embody the Dao’s truth.\n\n**Hymn of Returning the Precepts**\nThe Heavenly Worthy, vast in compassion,\nExpounds the precepts to deliver beings.\nMajestic virtue pervades the hidden and manifest,\nKarmic retribution moves the true numina.\nAll heavens come to bow their heads,\nAll demons restrain their forms.\nThe past transcends the Eight Difficulties,\nThe present safeguards a thousand years.\nWhen the merit of the retreat is complete,\nTogether we send forth our reverence.\nFlowing Sanskrit, ethereal cloud-chants,\nFlying incense mingles with fragrant smoke.\nJade phoenixes ride cinnabar carriages,\nGolden dragons draw emerald chariots.\nIn life and death, all find joy,\nFamilies and nations all know peace.\n\n**Hymn of Burning Incense**\nIn learning the Dao, be diligent and earnest,\nGather faith and circulate cinnabar sincerity.\nBurn incense and take refuge in the Most High,\nTrue qi blends with fragrant smoke.\nMay it open the great pardon,\nFreeing the seven ancestors from dark realms.\n\n**Hymn of the Supreme Ultimate**\nThe Dao takes purification as foremost,\nDiligent practice ascends the Golden Portal.\nThus is the great Dharma bridge established,\nUniversally delivering all beings.\nRepaying the kindness of past lives,\nThe heart of the Dao arises transcendent.\nThe body soars to the immortal capital,\nThe seven ancestors all attain liberation.\n\n**Hymn of Presenting the Petition**\nThe Most High’s Dharma is subtle and wondrous,\nPetitions and registers deliver humans and heavens.\nThe Primordial Beginning announces the talismanic decree,\nAt the appointed hour, one attains ascension.\nTransmission saves the drowning,\nAll achieve self-cultivation.\nInscribing names on the Golden Petition,\nCarefree before the Jade Emperor.\n\n**Hymn of the Deliverance Petition**\nVermilion brightness unfolds the mystic chart,\nHarmonious and smooth, it reaches the upper void.\nThe Primordial Beginning spreads the numinous scripture,\nTen divisions of flying celestial texts.\nOpening deliverance for the nine dark ancestors,\nA myriad recitations, the Dao naturally abides.\nJade peaks adorn the jeweled forest,\nLife and death dwell in the abode of merit and virtue.\nWithout the Yellow Register Petition,\nHow could the root of suffering be severed?\nCircumambulating, reciting the numinous scripture,\nThe Five Numinous Ones return to assist.\n\n**Hymn of Burning the Petition**\nBeings abound in obstacles and hardships,\nThe Great Dao truly pities and cherishes them.\nDeliverance extends through ritual teachings,\nAll are enabled to repent their karmic bonds.\nTransgressions fill the earthly prisons,\nOffenses have reached the heavens.\nRevealing them, I pray for true protection,\nWith a hidden heart, I move the sages.\nReverently bowing to the Three Treasures,\nMay I soon ascend to heaven and enjoy long years.\nBurning the petition, I return it to the upper realms,\nPresenting names before the Jade Emperor.\n\n**Hymn of Burning the Memorial**\nSacred virtue flows through ritual teachings,\nCultivating the retreat brings long life and fortune.\nExtending life by transferring the Jade Petition,\nRequesting destiny by presenting the Golden Scroll.\nSinful names vanish from the Northern Bureau,\nLiving registers are inscribed in the Southern Prosperity.\nThe living all find joy,\nThe departed are born in the land of fortune.\n\n**Hymn of Welcoming the Perfected**\nThe Heavenly Worthy mounts the celestial dragon,\nA million immortals ride as his retinue.\nClouds arise in carefree ascent,\nJade tones form the music of flutes and drums.\nFlower garlands and wish-fulfilling jewels,\nSacred transformations beyond thought.\nMay they deign to descend upon the jade altar,\nBestowing blessings upon all beings.\n\n**Hymn of Sending Forth the Perfected**\nThe returning chariot of five-colored clouds,\nSoaring with the ninefold hymns.\nIn an instant, they ascend far into heaven,\nThe altar’s incense lingers in abundance.\nMysterious grace blankets the cosmos,\nFortune and blessings pervade mountains and rivers.\nGazing afar at the immortal path,\nCarefree, they ascend the Great Loftiness.\n\n**Hymn of Sending Forth the Direct Petition Messenger**\nI reverently invoke the Direct Petition Messenger,\nHidden and manifest paths secretly connect.\nRiding clouds, hastening to present the casket,\nFar traversing the Three Realms.\nThe Purple Clarity and Golden Portal are profound,\nThe Mystic Metropolis and Water Palace abide.\nTransmission is swift as a moment,\nThe upright petition awaits the true wind.\n\n**Hymn of Universal Offering**\nUniversally offering to the boundless sages,\nFragrant smoke scatters in the ten directions.\nMay they ascend the Seven Treasures Terrace,\nShedding light upon the Five Turbid Worlds.\nDelivering the hosts of humans and heavens,\nAll are enabled to mount the Dharma bridge.\nTogether we realize non-action,\nDiligently cultivating without retreat.\n\n**Hymn of the Northern Emperor**\nExcellent is the Primordial Beginning, the Venerable One,\nThe compassionate father and mother of all beings.\nInclining his light from the Purple Tenuity Palace,\nBending to illuminate the nine dark portals.\nTowering is the cold courtyard of Mount Qiu,\nIts reflection expands the icy shores.\nFiery flames rage in the scorching hells,\nAbundantly he showers the Dharma rain.\nAll-pervading, his great compassion and wisdom,\nEver skillfully relieving the suffering of the multitude.\n\n**Deliverance of Long-Night Souls**\nNow delivered from the endless night, they bow in reverence.\n\n**Hymn of Huaxia**\nDiligently observing fasts and precepts,\nReciting scriptures to restrain the six passions.\nThus they ride the void and soar,\nRadiant, ascending to Jade Clarity.\nWith focused heart they keep the fasts,\nExhaling and inhaling to refine the five spirits.\nInner virtue crowns the heavens,\nTurning the wheel to become perfected immortals.\n\n**Hymn of Dao-Seekers**\nTo seek the Dao, action is urgent;\nTo uphold precepts is to master the heart.\nIn emptiness and equanimity, the true *qi* abides,\nWhere immortals and sages naturally converge.\nIf one does not trust the Dharma’s words,\nWhy dwell in mountain forests?\n\n**Hymn of the Supreme Pole Perfected**\nDivine clouds gleam in layered void,\nBrahmic nets gather in azure skies.\nThe Primordial Beginning’s nine dragons draw the chariot,\nThe August One reins the azure carriage.\nLuminous radiance gathers the myriad perfected,\nPearl-like reflections open the vastness of Yang Lea.\nRevealing the *Lingbao* scriptures,\nFortune and virtue are thereby summoned.\nThe Cavernous Mystery conceals lofty majesty,\nJade tones ripple like cloud-borne zithers.\nBoundless as the primordial measure,\nThe Dao’s sea stirs with waves.\nDharma principles flow like rivulets,\nNurturing fine sprouts to grow.\nUsed to relieve the hungry and destitute,\nTeachings flourish to guard the central court.\nMay the August Lord live for myriad years,\nPeace prevail, and weapons be stilled.\nBowing in reverence toward the Jade Dawn,\nDivine blossoms scatter from golden rays.\nThough the Great Dao is without intent,\nIt may be sought with devotion.\nBenevolence rides the empty vastness,\nGazing back upon the veiled azure currents.\nBeyond the Three Realms, in purity and brightness,\nOne roams the ethereal Jade Capital.\nWithout the mysterious impetus of fate,\nWho could fathom the hidden depths?\nVast and clear, the Celestial Han,\nLooking up and down, one finds emptiness and softness.\nThe Seven Mysteries disperse the dark descendants,\nReturning to the womb, flowing with sinking and rising.\nIf the hidden term silently congeals,\nThe Yang’s nine calamities hold no fear.\nBeholding these goings and comings,\nTime and again one lingers.\nExternally forsaking the body, yet the body endures—\nTrue immortals meet with worthy companions.\nVigorous is the mystery within,\nSerene are the waves of the clear Han.\nChange and decay turn like a wheel,\nYet the camphor tree’s branches remain unchanged.\nWith tranquil heart, contemplate the Perfected,\nFollowing fate’s course through separation and union.\nResonance and response are ever connected,\nSpiritual awareness reaches its own origin.\nWandering in simplicity, without bounds,\nProlific thoughts penetrate the nine rosy clouds.\nFlying roots scatter dark leaves,\nPrinciple returns—nothing else.\nEver reciting jade verses,\nMysterious tones pierce the distant skies.\nWhen the *jiashen* flood disaster struck,\nI soared on wings to the Queen Mother’s abode.\nForever enjoying boundless eternity,\nWho knows the multitude of kalpas?\n\n**Hymn of the Golden Register for Delivering Lives and Redeeming Sins from the Nine Dark Realms**\nBowing in reverence to the Supreme Dao,\nMy heart returns to the Primordial Venerable One.\nThe Perfect and Wondrous Responsive Lord,\nOpens and transforms the soaring Mystery Gate.\nWondrous precepts gladden the five spirits,\nGolden scriptures admonish the myriad deities.\nExamining fate, the registers are fixed,\nDivine talismans deliver suffering souls.\nRiding clouds to attend the Jade Emperor,\nIn harmony with those of the Mystery Center.\n**Hymn of Redeeming Karmic Entanglements**\nGreat is the Lord of the Dao,\nEver universally bestowing boundless merit.\nA boat and oars upon the sea of birth and death,\nFerrying across to transcend Fengdu’s nether realms.\nKarmic retribution no longer encountered,\nBlessings connect with the unseen.\nHow could the workings of the divine be fathomed?\nPraise cannot exhaust them.\n\n**Hymn of Merit for Rebirth**\nCool and sweet, the nectar nourishes,\nThe Dharma’s flavor beyond thought.\nIncense wafts to the Seven Perfected,\nHow could doubt arise in the unseen?\nThose who receive this Dharma food,\nAscend to heaven, enter the Purple Tenuity.\nThe field of merit lofty and towering,\nOfferings and alms bring purity.\nAll conditioned deeds,\nUniversally fulfill karmic destiny.\nDelivering you from the three wretched paths’ suffering,\nBestowing the nine mysteries’ blessings.\nWhen the time comes to receive this food,\nAll heavens join in praise.\nThe cold courtyard holds much sorrow,\nTurning hearts to bow to the Primordial August.\nThe Talisman of the Divine Treasure of Lady Blue,\nThe True Scripture of the Central Mountain Emperor.\nOne thought ascends to Grand Clarity,\nA second thought returns to the Supreme Void.\nMerit accrues below the nine dark realms,\nSwiftly reborn in the Purple Tenuity.\n\n**Hymn of the Supreme Pole Perfected Administering the Cavernous Mystery Scripture**\nThe eight paths converge without origin,\nRiding fate to observe the clamorous net.\nTransforming and removing the dust of the world,\nLoosening the collar, one finds the Daoist family.\nIn an instant of wafting smoke,\nBearing truth, one arrives at the numinous peak.\nGazing upon the jade pavilion in the void,\nThe mysterious harmony composes phoenix songs.\nThe path is free from hindrance,\nDivine tones dance upon cloud waves.\nEqual in virtue with the jadelike capital,\nWhy cling to worldly abundance?\nLeft hand grasping the jade parasol,\nFlying at dawn, treading the Seven Origins.\nThe Three Luminaries gleam with purple radiance,\nRising to gaze upon the Bright Perfected.\nIn a moment of leaping transformation,\nAll four directions become divine.\nThe numinous scripture knows no bounds,\nDiligently ponder the *Shangqing* texts.\nWhy remain mired in the crossroads,\nCausing your devotion to waver?\nYin ailments lose their mysterious mechanism,\nUnnoticed, the years divide.\nMysterious waves stir the azure tides,\nVast currents surge through myriad streams.\nRiding the radiance, gazing upon the six voids,\nLonging to wander with the Perfected.\nExquisite songs do not answer me,\nClear tones find no one to receive them.\nAmid clouds, driving jade wheels,\nWho would be a companion in dust and earth?\n\n**Hymn of the Supreme Pole Perfected**\nThe Most High Lord of the Great Dao,\nReveals the *Lingbao* scriptures.\nLofty and wondrous, beyond comparison,\nLike the mystery within mystery.\nThe ten directions’ lands naturally\nRevere the Supreme Immortals.\nVast is the *Dongxu* scripture,\nSeated in peace, attending the heavens.\nAbove, the Purple Tenuity Terrace,\nBelow, the myriad famous mountains.\nResplendent with dragon and phoenix patterns,\nTheir brilliance stored within.\nWondrous is the Most High Dao,\nNon-action, ever natural.\nKings, lords, and common folk,\nValue only the worthy.\nThose with karmic fortune and blessings,\nStand out from the past’s verdant fields.\nDharma masters transmit to one another,\nPrecious faith enduring kalpas.\nWith broad heart, deliver all,\nGreat fortune will be yours.\nThose who make offerings will attain the Dao,\nThose who uphold it become perfected.\nThe Great Dao has no self or other,\nTransmission finds the Perfected.\n\n**Hymn of the First Perfected of the Mysterious Unity**\nMyriad wonders emerge from the Cavernous Truth,\nResplendent, illuminating Grand Clarity.\nThose who uphold it are called immortals,\nEmbodying the origin, they live forever.\nCarefree, they play in the mysterious void,\nPalaces array their forms.\nLush and radiant, the seven-jeweled grove,\nGleaming with the essence of sun and moon.\nDragons and unicorns gallop to and fro,\nPhoenixes soar with mournful cries.\nThe Most High governs the Purple Terrace,\nThe myriad perfected recite the Cavernous scriptures.\nHolding incense, bowing in reverence,\nCircumambulating the palace city.\nThree circuits return to the high seat,\nThe Dao King responds with his voice.\nWhen the ruler promotes the Perfect Dao,\nThe world universally attains peace.\n\n**Hymn of the Second Perfected of the Mysterious Unity**\nEmptiness and nothingness, ever natural,\nForcibly named the Great Dao.\n[...] vast, without bounds,\nMyriad wonders return to the *Lingbao*.\n\n**Hymn of the Third Perfected of the Mysterious Unity**\nWith eyes closed, meditate upon the Most Real,\nIn deep concentration, summon the Ten Elders.\nAscending as immortals, forever free from action,\nTheir numinous countenances ever wondrous and fair.\nThirst quenched by the nectar of Jade Pool,\nHunger sated by the Golden Flower herb.\nThey purify the world, delivering from the Eight Perils,\nRelieving all worldly sufferings and afflictions.\n\n**Hymn of the Third Perfected of the Mysterious Unity**\nWondrous indeed, the *Lingbao* scriptures,\nThe Most High’s spontaneous writings.\nThose who uphold them attain the Dao,\nProclaimed as perfected beings descending into the world.\nEntrusted to propagate the Daoist teachings,\nTruly they transcend the mundane.\nTheir tasks complete, they ascend as immortals,\nTheir palaces governing the Mysterious Terrace.\nAt times descending upon Kunlun Mountain,\nCarefree, they rest in Penglai.\n\n**Hymn to Master Zhang**\nThe *Lingbao* and the Great Cavern,\nSupreme scriptures of the Perfect Dao.\nOnly the Five Thousand Characters,\nLofty and wondrous, without equal.\nThose who practice them ascend as immortals,\nDwelling in the void, governing the ethereal.\nAttending the Terrace of the Most High,\nCarefree in the Purple Tenuity Palace.\nTen thousand kalpas pass like a flash of lightning,\nYet they endure forever, without end.\nThe Dao-eye now fully opened,\nVast and luminous, naturally penetrating the obscure.\nThe hidden and dim—none unknown,\nSeated in stillness, they behold the ten directions.\n\n**Hymn of the Threefold Invocation**\nDelighting in the Dharma as one’s wife,\nCherishing the scriptures like pearls and jade.\nHolding the precepts to restrain the six senses,\nContemplating the Dao to dispel desires.\nIn purity, the upright qi abides,\nIn serenity, the spirit rests in silence.\nHeavenly demons all revere and protect,\nLifetimes of great blessings enjoyed.\nFlourishing are families and nations,\nProsperous are the scriptures and the Dao.\nHeaven and humanity share the same aspiration,\nEthereally entering the Great Vehicle.\nCultivating the field of merit in the mind,\nThe Dharma-wheel ascends in boundless ascent.\nSeven generations of ancestors ascend to heaven,\nWhile this body soars in broad daylight.\nThe Great Dao pervades the mysterious void,\nWith mindfulness, nothing fails to align.\nRefining the body into immortal perfection,\nThus attaining the adamantine form.\nTranscending the Three Realms’ tribulations,\nLiberating from the Five Sufferings of hell.\nAll return to the scriptures of the Most High,\nIn tranquil contemplation, bowing in reverence.\n\n**Hymn in Praise of the Dao’s Manifestation**\nThe Dao of heaven responds to the times,\nYin and yang are most numinous.\nDiscerning their subtle mechanisms,\nOne may preserve or lose the body.\nAwakened, one becomes supreme;\nDeluded, one is not real.\n**Hymn in Praise of the Dharma’s Exposition**\nHeaven and earth, the myriad things,\nYin and yang, the four seasons.\nMutually overcoming one another,\nYet noble is he who harmonizes with heaven’s mechanism.\nThe sagely work is spiritually efficacious,\nNone but the worthy can comprehend.\nThus, one lightly values life,\nCarefully examining what is fitting.\n\n**Hymn in Praise of the Arts’ Exposition**\nCutting off profit at its source,\nThrice reflecting, then acting.\nYielding to things’ mechanisms,\nLife and death lie before one’s eyes.\nJoy arises from tranquility,\nKindness begets cruel harm.\nHeaven and earth’s calamities and blessings,\nTimely principles bring fortune.\n\n**Hymn to the Scripture of Purity and Stillness**\nThe Five Ultimates take primacy,\nThe void and nothingness are the Dao’s spontaneity.\nThe Primordial Origin governs the ancestral norm,\nIts wondrous essence harmonizes with the mysterious and profound.\nExpounding the teachings to clarify the Supreme,\nUnderstanding constancy through metaphorical explication.\nThrough this pure and still virtue,\nThe scriptures are established to propagate transformation.\n\nThe Great Dao conceals itself in form,\nTrue essence blends into the obscure.\nThe Two Modes divide at the first sign,\nA single qi circulates without cease.\nEncompassing and sustaining—truly unfathomable,\nNurturing and generating—oh, how serene!\nFashioning and shaping, the Artisan of things,\nAll creatures, though dull, contain the numinous.\nSun and moon traverse the void,\nBright and luminous, most impartial.\nThose who attain heaven endure in radiance,\nIlluminating all things, universally penetrating.\nTangible things receive light’s illumination,\nInsentient beings merge with form’s fusion.\nYin and yang constantly embody the Dao,\nUnceasing within the Great Vastness.\n\nThe wondrous Dao is truly hard to name,\nYet it embraces and generates the myriad things.\nCirculating through time, it fills the earth’s veins,\nFreely bestowed, it receives heaven’s clarity.\nBreathing forth the true message,\nThe Great Transformation achieves harmony.\nReturning to oneness in perfect communion,\nHigh and low lie level and even.\nFormless, utterly without trace,\nHard to name within the primordial chaos.\nBefore the emergence of heaven, earth, and sun,\nHow could there be rain, clouds, or wind?\nBreaking open the signs of the primordial chaos,\nPiercing through the obscurity of things’ forms.\nThereby dividing and creating,\nProvisionally establishing the boundless Dao.\nThe clear and turbid qi of yin and yang,\nCirculating, surging above and below.\nNaturally accomplishing transformation,\nUltimately harmonizing in perfect communion.\nThe myriad kinds nurtured and reared,\nThe Three Origins conjoined in unity.\nHeaven and earth in harmonious union,\nAll gathered in the One True Emptiness.\n\nAt the inception, the Two Modes divided,\nHumanity and the numinous—most noble and revered.\nThe Three Powers stabilize the cosmos,\nThe Two Forces determine heaven and earth.\nAll things contain the true qi,\nThe primordial is the gateway to true reality.\nHard and soft mutually complement in function,\nWho can abide in embodying the Dao?\nDescending to the root, one penetrates the true body,\nReturning to the origin, one perceives the end’s cause.\nSpring’s yang spreads luxuriant flourishing,\nAutumn’s season governs withering and decline.\nThe Supreme Ultimate generates form and transformation,\nIn pure harmony, it renews creation.\nThe pivot of the great mechanism propels the great movement,\nEntrusted to the divine, it accomplishes its work.\nThe principle of purity and stillness is profound,\nWho can fathom its ultimate depths?\n\nBeholding emptiness, one eliminates all realms,\nCutting off forms, one comprehends all minds.\nThe moon of wisdom flows in the cinnabar river,\nThe cloud of compassion covers the emerald peaks.\nAbiding in stillness, one remains unmoved,\nResponding to things, one manifests as a knowing friend.\nWhen one awakens to constant purity and stillness,\nOne knows the wondrous mechanism of the sagely origin.\nThe Great Beginning is free from defilement,\nIn perfect quiescence, its radiance concealed.\nSilently, it enfolds the sand-realm,\nDimly, it penetrates the Purple Tenuity.\nAfter the Three Origins’ ascent and descent,\nHeaven and earth all return to it.\n\nThe mind is the numinous abode,\nThe spirit rests in stillness, finding peace.\nGreed, anger, and delusion easily arise,\nPrecepts, concentration, and wisdom are hard to behold.\nThe profound essentials lie in perfect uprightness,\nFirmly maintaining inner tranquility.\nEver free from the six desires,\nThe Dharma-realm naturally expands.\nIf one dispels all passions and desires,\nThe mind becomes clear, wondrously penetrating all.\nIn unity with the real, not clinging to things,\nReturning to stillness, abandoning all attachments.\n\nWater, distant, connects to heaven in stillness,\nMountains, high, wear the moon’s chill.\nIn perfect communion, wisdom is all-penetrating,\nWithin the pot, the golden pellet revolves.\nRight mindfulness is without bias,\nIn emptiness, it harmonizes with spontaneity.\nThe six senses’ dust instantly ceases,\nThe three poisons’ afflictions must be healed.\nThe wondrous Dao transcends kalpas of emptiness,\nPreserving the spirit, one ascends to heaven.\nIn this subtle and mysterious place,\nThe Mysterious Female naturally endures.\nLosing the way, one strays from home,\nAll because one’s own light is obscured.\nThe mind, floating, is easily moved,\nFamiliar realms are hard to forget.\nHow can one dispel the defilements of desire?\nDevious cunning only leads to desolation.\nTurning the head, one finds the place of awakening,\nReflecting inward, one beholds the King of Emptiness.\nAwakened to all the leaks of dust,\nThe Dao-eye opens clearly.\nForms and sounds are not obstacles,\nKnowledge and perception must be buried.\nWhen the spirit is still, a thousand calamities vanish,\nWhen the mind is empty, ten thousand cares turn to ash.\nThe pure wind passes through the jade door,\nNaturally, sweet sounds arrive.\n\nBeholding all forms as non-form,\nTheir essence is but a kind of nothingness.\n\nWithin lies the true Dharma-realm,\nIts essence merges with the Great Void.\nClouds still, the toad’s light reveals,\nThe pool so clear, white silk unfurls.\n\nSuch manifest signs—where seek another path?\nIn silent illumination, all things observed:\nHow could the myriad spirits differ?\nIn shared truth, none can be seen,\nBeyond all traces, none can imitate.\n\nThe elder in the hall, clear and bright,\nRests beyond all dharma—nothing more.\nMysterious, mysterious, mystery dissolved,\nThe eight directions stretch unbounded.\nThe vast expanse of true emptiness revealed,\nLooking back—no single thing remains.\n\nFused as the great desert,\nProfoundly still, its nature is void.\nLuminous and ever-silent,\nPerfectly penetrating, its nature flows free.\nWithin and without as one,\nNot returning to the primal origin.\n\nWhen the mind is empty of things,\nEven \"nothingness\" is truly nothing.\nWhy labor to dispel delusion?\nWhat need to discern fine from coarse?\n\nFrom stillness and emptiness, skill arises,\nReturning to truth, unwavering.\nSuch subtle messages—who dares name or shape them?\nAll dharmas are inherently empty,\n\"Nothingness\" and \"nothingness\" unite in sacred work.\n\nProfoundly serene, neither within nor without,\nSilent, east and west dissolve.\nWhere mind and realm both forgotten,\nSquare and round become one.\n\nVast and obscure, beyond creation,\nAll things freely pass through.\nProvisional stillness serves as body,\nYet one must still remove the roots of desire.\nWhen conditions are forgotten, thus stilled,\nTrue stillness renews itself.\n\nAccord with the unborn dharma,\nOnly then does one know the spring of endless day.\nAlone transcending heaven and earth,\nFreely at ease, unbounded.\nOnce settled, one reaches true constancy,\nThe spirit’s light beyond all measure.\n\nIlluminating the chamber of the three poisons,\nPiercing the halls of the five luminaries.\nThe jewel moon shines in the clear sky,\nDeluded clouds vanish in an instant.\nThe pure wind spreads its message,\nResponding to things, it unfolds at will.\n\nThrough endless kalpas, ever perfected,\nNeither darkness nor light.\nThe Valley Spirit remains eternally still,\nThe Dharma-ocean serene and clear.\n\nRight mindfulness enters the true path,\nA settled mind attains the wondrous course.\nForever freed from the bonds of birth and death,\nThe three realms stretch wide for wandering.\n\nHaving stilled sound and trace,\nDeeply penetrating the profound principle:\nTrue emptiness—can it be attained?\nTrue form requires no cultivation.\n\nLet eating and pecking pass as they may,\nDignity and conduct follow freely.\nSuddenly, all deliberation ceases,\nIn tranquility, wholeness is preserved.\n\nTo awaken the transformation of beings,\nAll manifold pursuits must be relinquished.\nInstantly transcending the fruit of no-leakage,\nHow could there be any root or cause?\n\nGrasping and rejecting cannot move it,\nCauses and conditions too are cut off.\nIn a flash, all is let go—\nThe sacred path may then be transmitted.\n\nThe superior person knows no contention,\nDiligently and constantly holds firm resolve.\nDwelling in truth, ever at ease,\nCultivating simplicity, hidden in profound mystery.\n\nLooking up and down, observing heaven’s principle,\nThrough prosperity and adversity, penetrating the depths of the Dao.\nAlas for those who remain unenlightened,\nCompeting in dharmas, their minds obscured.\n\nVirtue’s transformation seeks no reward,\nGrace is wide—how could one be proud?\nConcealing one’s light, treasuring great capacity,\nThe bright nature shines like solid ice.\n\nSilently in accord with the high and distant,\nDeeply penetrating the vastness of the supreme Dao.\nHow could it resemble the foolish who cling,\nForcing distinctions, boasting of their abilities?\n\nMost beings turn from the Dao,\nInverted, seeking outside.\nDelusion arises from this,\nThe true spirit obscured and lost.\n\nOriginally lacking nothing,\nWhy forcefully cling to cultivation?\nWith a sudden sweep, the clouds of delusion disperse,\nThe silver toad shines upon the jade tower.\n\nScheming arises from delusion,\nDeparting from truth disturbs the spirit.\nAll because the mind harbors love and desire,\nAttaching to things, giving rise to greed and anger.\n\nEver harboring the fire of ignorance,\nAdding the dust of affliction.\nFrom this, retribution is received,\nRevolving through the six paths in suffering.\n\nFrom delusion arise anger and desire,\nGreed and ignorance become obstacles.\nSorrow and worry bind endlessly,\nAfflictions coil without cease.\n\nThus the true Dao is obscured,\nFrom this, karmic transgressions arise.\nTurning the light inward in reflection,\nOne awakens to the wondrous within.\n\nAfflictions arise from thoughts—\nWhen has one ever awakened to one’s own mind?\nVast and confused, suffering humiliation,\nDisturbed and restless, unwilling to reflect.\n\nDying in vain without respite,\nLiving emptily until now.\nThus the true Dao is lost,\nDreams and illusions encroach.\n\nIf one connects with heaven and earth,\nAll are sustained by the Dao’s qi.\nHiding the root, deepening the stem,\nExtinguishing the poisons, returning the hun to peace.\n\nHaving awakened to the path of long life,\nOne must open the gate of enduring vision.\nPreserving truth, the spirit transforms itself,\nThe supreme Dharma King is revered.\n\n---\n\n**The Three Caverns’ Hymns of Praise, Scroll the Middle**\n**The Three Caverns’ Hymns of Praise, Scroll the Lower**\n**The Three Contracts’ Hymns**\n\nThe Primordial Cavern of Empty Nothingness,\nThe three qi refine the upper gate.\nPurple radiance illumines the Great Void,\nThe four luminaries plant the spiritual root.\n\nWondrous transformation arises in the eastern jade,\nThe three conveniences open the western Kunlun.\nResplendent, shining upon the nine mysteries,\nThe five flowers adorn the brocade clouds.\n\nThe net of separation gleams with the divine lamp,\nThe seven stars illuminate the northern origin.\nSoaring, soaring to the upper clear realms,\nWinged, winged—the Emperor Unity is revered.\n\nLofty, lofty the supreme hymn,\nHow the feathered youths swarm!\nFlowing fragrance, originally without color,\nPenetrating the myriad immortals’ throng.\n\nTo the left, circling the three kalpas,\nTo the right, conveying the ten thousand heavens’ gates.\nCloud flowers entwine the jade clouds,\nThe eight phoenixes dance in empty turns.\n\nThe four seasons never cease their mechanism,\nBlue and white are early distinguished.\nNine nines transform the kalpa’s fate,\nThree threes pass through one cosmic cycle.\n\nHeaven and earth have their final meeting,\nYin and yang return to the banner.\nThe Cavern’s clarity of the Orthodox Unity,\nThe solemn end of the six celestial texts.\n\nGreat peace reverts to empty nothingness,\nServing the later sagely lord.\nThe divine wind rises from the western gate,\nBrocade clouds arise in the eastern jade.\n\nThe two qi illumine the jade isles,\nFlowing fragrance rides the light smoke.\nThe five flowers scatter in the wind,\nSuddenly brightening the nine clear realms.\n\nThe soaring forest glows with the vermilion sun,\nYellow flowers follow the moon’s birth.\nWithin, the herb-gathering youths,\nClothed in feathers, girded with flying green.\n\nThe swift light of ten thousand peaks,\nFreely at ease, feasting in the green chariot.\nMastering the nine empty conveyances,\nOpening the boundless course.\n\nTo the left, commanding the three celestial texts,\nTo the right, seizing the six celestial soldiers.\nRegulating qi, returning to empty caverns,\nHeaven’s measures respond to the turning fate.\n\nKalpas have their own meetings—\nWho can fathom defeat or success?\nVast waves engulf the cosmic net,\nThe six directions leave no form behind.\n\nWhite corpses drift in the long flow,\nLonely souls scatter and vanish.\nGrieving this cycle of departure and return,\nOnly then does one perceive the brightness of the true Dharma.\n\nWith utmost study and refined cultivation,\nBinding jade blossoms to form a precious name.\nRejoicing in those of the white tally,\nTogether delighting in great peace.\n\nThe cavern’s gate turns heaven’s net,\nThe five qi revolve the three subtleties.\nThe purple portal emits jade tallies,\nThe golden gate receives the divine radiance.\n\nEight Gatherings merge with the true wind,\nRadiant and bright, the layered darkness unfurls.\nBeyond the Nine Pures at heaven’s edge,\nLofty and vast, the high morn returns.\n\nThree hues revert to empty nothingness,\nFour seasons respond to the jade precincts.\nThe River Earl has already raised his brush,\nFive phases silently propel one another.\n\nSix Perfections span endless kalpas,\nWhen fate is exhausted, one rides qi to return.\nMyriad demons spread across the heavens,\nHordes of fiends vie to display their might.\n\nMultitudes bear the brunt of calamity,\nPiles of corpses evoke sorrow.\nWondrous indeed is the scripture of the true Dharma,\nThrough kalpas it shines, undiminished in clarity.\n\nAt the destined hour, they shall be welcomed,\nTheir bond lies at the gate of the Nine Heavens.\nWith you I pledge great peace,\nReleasing the self to soar without wings.\n\nWondrous indeed is the resonance of the Three Caverns,\nVast and echoing—how clear the chime!\nSeeking the sound, it seems both present and absent,\nMoved yet unseen in form.\n\nThe echoing tone pervades the ten directions,\nYet when heard, no sound remains.\nThe great Dao must enter the vast,\nThe wandering mind returns to the Great Void.\n\nAt dawn, pay homage across the ten directions,\nAscend and transcend upon the Nine Dragons.\nSoaring beyond the Three Realms,\nOne rises as if amid clouds.\n\nMy master is the Heavenly Venerable,\nTranscendent, the Supreme Emperor.\nGazing upward beyond the earth’s bounds,\nDimly one glimpses the Purple Flame Hall.\n\nTowering is the Chamber of the Mysterious Capital,\nWhere only the abodes of immortals are seen.\n\n---\n\n*The Great Cavern Scripture in Praise*\nThe Great Cavern True Scripture is of the Great Vehicle,\nProfound and abstruse, reaching the utmost mystery.\nAll immortals and sages of the ten directions and three times,\nThrough cultivation and mastery, attain the Primordial Azure.\n\nThe Three Caverns and Three Vehicles are not easily fathomed,\nThe Jade Emperor’s wondrous words are flawless.\nAll scriptures and myriad dharmas return to the ancestral source,\nThrough comprehension, one ascends to the realm of kalpas.\n\nEmperors, ministers, dukes, and lords,\nGovernors, officials, and common folk—\nWealth, honor, and glory are no different,\nAll converge in the Great Cavern to fathom the profound plan.\n\nThe black-robed and yellow-robed teachings may differ in path,\nYet scholars who hear rites and recite poems are noble.\nAll may chant and uphold the True Great Cavern,\nPrimordial Heaven and Earth—one vast emptiness.\n\nThose who study the Complete Perfection and Dao,\nThrough myriad methods and thousand gates, waste their minds.\nChanting the Great Cavern Scripture ten thousand times,\nThe Jade Emperor and Laozi become their true kin.\n\nScholars, warriors, and officials,\nCourtesans, commoners, and all alike—\nAll may follow their hearts to hold the Great Cavern,\nSevering karmic roots to wander with the gods.\n\nThe Great Cavern’s true essence differs from other scriptures,\nAscending as immortals, entering as sages, to meet the Mysterious Perfected.\nThrough countless kalpas as numerous as dust motes,\nOne fully realizes the Jade Emperor as the Supreme Person.\n\nAlas, the foolish and unenlightened,\nHow could they recognize the pearl of Fuli’s millet?\nThe Great Cavern delivers all as one body,\nEffortlessly ascending to the Mysterious Capital.\n\nIf one wishes to cultivate and reach the Supreme Vehicle,\nHow can it compare to the few chapters of the Great Cavern?\nExhausting heart and nature to refine the body’s method,\nThrough realization, one ascends to the Great Abundance Court.\n\nFor the sake of all disciples, I carve this scripture,\nComposing hymns to praise and extol it.\nIts merit is towering, an inexhaustible treasury,\nThe Jade Emperor’s wondrous Dao is originally formless.\n\n---\n\n*Hymn of the Primordial Heavenly Emperor*\nFrom the beginning, the sounds of Canghu and Tanchi,\nFormed cloud-seals to deliver heaven and humanity.\nThe Great Mystery’s Dao Father sought and received it,\nOnly then was the Great Cavern Scripture heard below.\n\nCommon folk of the earth seek to awaken to truth,\nThe path to the immortal source is distant and hard to find.\nIf one wishes to know the swift and unerring way,\nRecite with the mouth and hold in the heart the Great Cavern Scripture.\n\nAncestral merits from past lives were slight,\nThus this life’s blessings and descendants are meager.\nIf one prays to attain one’s desires,\nHow can it compare to diligently studying the Great Cavern Scripture?\n\nSun and moon lose their light, suffering engulfment,\nStars and constellations fall into disarray, disrupting celestial patterns.\nTo dispel heaven’s calamities and pacify the common folk,\nThe wise together proclaim the Great Cavern Scripture.\n\nDrought demons bring disaster, rain falls like metal,\nLocusts, floods—no harvest is reaped.\nTo universally ensure abundance without famine,\nPrayers rely entirely on the Great Cavern Scripture.\n\nMerchants, artisans, farmers, and traders—all four classes,\nGreedily seeking, unaware of karma clinging to them.\nAmid busyness, spare a moment’s mind and strength,\nTo recite the Wenchang Great Cavern Scripture.\n\nTreasuries overflow with wealth,\nWeapons forever stilled in peaceful ascent.\nThe people sing of virtuous governance, longing for stability,\nIn gratitude, diligently study the Great Cavern Scripture.\n\nEarthly deities, spirits, and all numina,\nSeeking promotion yet lacking cause—\nTo advance in the register of good deeds and amplify power,\nAt dusk, one must heed the Great Cavern Scripture.\n\nKinsfolk, ancestors, and parents’ souls,\nLong detained in the underworld, unable to ascend—\nIf one wishes to deliver them yet lacks the means,\nObserve fasts and diligently study the Great Cavern Scripture.\n\nLawsuits and summons burden descendants,\nDivine reprimands weigh upon the heavenly court.\nThrough generations, misfortunes linger—\nTo resolve them, one should study the Great Cavern Scripture.\n\nWhether building or constructing tombs,\nBreaking ground may offend malevolent spirits.\nCausing one’s dwelling to suffer misfortunes—\nTo pacify them, one should hold the Great Cavern Scripture.\n\nThe Yearly King of Epidemics governs the Five Pests,\nSpreading through states and villages, harming the people.\nTo protect one’s neighbors from contagion,\nMaintain purity and together study the Great Cavern Scripture.\n\nMonthly and yearly calamities long afflict the body,\nSeeking doctors, divination, and gods—\nUnable to escape, with no recourse—\nEntrust one’s fate to the Great Cavern Scripture.\n\nSix kinds of karmic foes—male and female souls,\nDim and obscure in the netherworld’s gloom—\nTo universally refine and ascend to heavenly realms,\nOften study the Great Cavern Scripture.\n\nKarmic enemies of the Six Paths are deeply entangled,\nVengeance upon vengeance—when will it end?\nIf one wishes each to rejoice,\nOnly through hearing the Great Cavern Scripture.\n\nWhether over wealth or wrath,\nIn a moment of fury, one invokes the gods—\nForming ghostly lawsuits, when will they cease?\nOnly the Great Cavern Scripture can dissolve them.\n\nIllness, death, and loss never leave the body,\nOfficial misfortunes, bandits, and suffering press in.\nWealth dissipates, possessions scatter like ice and snow—\nFor protection, one should hold the Great Cavern Scripture.\n\nWood, stone, fox, monkey, and dog spirits,\nHurling bricks, setting fires, appearing in human form—\nExerting power, seeking lewd sacrifices—\nTo eradicate them, study the Great Cavern Scripture.\n\nDwelling in mountains, forests, or secluded paths,\nSnakes, wolves, and tigers often harm people—\nHearing the sound, they retreat without trace—\nStay and sit, keep the Great Cavern Scripture in mind.\n\nScholars and literati with minds blocked like thatch,\nDivine youths falter in response, lacking wisdom.\nTo wield the brush with divine aid,\nFirst, cherish and constantly hold the Great Cavern Scripture.\n\nThis body is like illusion, like a bubble,\nWithin qi and spirit, refine the true.\n\nTo preserve one’s form and life as long as heaven endures,\nDiligently study and ponder the Wondrous Cavern Scripture of Wen Chang.\n\nDo not rely on vast wealth amassed by noble houses—\nHeaven’s decree may strip your blessings, leaving you perilously inclined.\nWhen the time is ripe to cultivate merit and virtue,\nSacrifice your own to print and circulate the Great Cavern Scripture.\n\nWith a heart of pure sincerity reaching Shangqing,\nOne’s devotion moves the Three Spirits to bestow their grace.\nThis body ascends to the rank of Heavenly Worthy—\nAll because of steadfast study of the Great Cavern Scripture.\n\nHear again the words of the Great Cavern Scripture:\nIts profound and wondrous text defies all naming.\nBoundless merit, beyond all reckoning—\nI urge all mortals: do not treat it lightly.\n\nThe Primordial Heavenly King expounded the Great Vehicle,\nAnd only those with karmic affinity encounter this sacred scripture.\nShould one persist in diligent recitation from beginning to end,\nThey shall join the assembly of Wen Chang.\n\n**Opening the Dharma Wheel: A Hymn of Praise**\n\nI open the eight gates,\nWithin lies a jade city.\nSeven-jeweled forests of jasper,\nRootless yet flourishing.\nGolden boughs intertwine,\nShading and illuminating Shangqing.\nThe Dharma Wheel of Liberation turns,\nConnecting the true and reaching the numinous.\nAbove, nothing remains unilluminated;\nBelow, nothing stays obscure.\n\nBehold the Daoist,\nReciting scriptures from dawn to dusk.\nPersevering in long fasts and secluded groves,\nUnwearied through day and night.\nPartaking only of cypress berries at noon,\nWith pure water and simple fare.\nPersonally receiving the master’s teachings,\nUnswerving in every moment.\n\nDwelling in solitary cliffs and caves,\nJourneying alone through desolate paths.\nForming herds with deer,\nResting body against the forest.\nFacing wild beasts in stillness,\nWhile birds cry mournfully above.\nWind and clouds wail in sorrow,\nTen thousand withered things sink into decay.\nIce congeals and fills the ravines,\nWhite snow blankets the courtyard.\nCold plagues pierce the flesh,\nYet resolve remains unshaken.\nBound to the mountains and peaks,\nEnduring every hardship.\nNever yielding to toil,\nNever seeking rest.\nTurning ceaselessly in pursuit of the Dao,\nAt last moving the imperial heart.\n\nCinnabar script in green characters,\nCelestial charts bearing mysterious names.\nDivine immortals in feathered robes,\nJade skirts shimmering in flight.\nDescending in radiant splendor,\nAdorned with fiery bells.\nA chariot of flowing rosy clouds,\nA three-fold celestial carriage soaring.\nEntering my eight gates,\nOne comes to know life and death—\nAll determined by accumulated deeds,\nAlas, for the sentient beings!\n\n**Hymn on the Extinction of Karma Through the Turning Wheel**\n\nThe Dharma Wheel turns, extinguishing karma,\nLife and death bend to one’s will.\nAccumulated deeds yield clear retribution,\nFortune and misfortune ever alternating.\n\nThe worldly seek their past lives,\nThe enlightened aspire to future returns.\nIf past merits remain unfulfilled,\nBlessings will come, though delayed.\n\nBuilding upon past exhortations for future deeds,\nOnce merits are complete, the form ascends of itself.\nImmortals of the ten directions in past lives,\nThrough eons, entered the subtle.\n\nI observe the most devoted scholars,\nYet they fail to embrace others’ hearts.\nDiligently serving the master’s treasure,\nThe master’s protection brings towering blessings.\n\nDisrespecting the master loses this treasure,\nAll prior merits vanish without effect.\nI urge you to perfect your true nature,\nThe Three Masters guide you through the mystic gate.\n\nIf you embody the true Dao,\nThe Dharma Wheel’s cavern opens of itself.\nDo not see this as mere stillness—\nWithin the hidden depths, it is most profound.\n\n**Hymn on the Root of Life Before Its End**\n\nThe Wheel turns through the empty void,\nExtinguishing karma, transforming life and death.\nSin and blessing each have their counterpart,\nFortune and misfortune cling without bias.\n\nAttaining the Dao comes from one’s deeds,\nTied to the essence of past lives.\nEvil deeds summon cruel retribution,\nDragging one through the five courts of suffering.\n\nThough heaven and earth stretch endlessly,\nThe mirror of the profound sees all clearly.\nI have observed your kind,\nReceiving my scriptures from your master.\n\nYet having gained the scriptures, you betray your master,\nConsumed by envy, vying for merit and fame.\nStumbling without self-blame,\nVoicing grievances along the way.\n\nThis compels the Six Departments to act,\nWielding their brushes to record your form.\nWhen your life ends, you bear the Knife Mountain,\nSuffering torment, your body its victim.\n\nTraversing the Three Wretched Paths,\nDo you yet perceive your form and name?\nTransformed into herds of the six beasts,\nYearning to return to the unseen.\n\nThe Dharma Wheel turns ceaselessly,\nComing and going without pause.\nAlas for the law of cause and effect—\nRetribution comes without delay.\n\nPitying your ignorance of fate,\nI compose this hymn in sorrow.\n\n**Hymn on Turning the Spirit Through Reflection**\n\nSubtly I turn my spirit,\nSpreading boundless merit.\nThe Dao accomplished through eons of heaven and earth,\nThe Wheel’s transformations unfold through nine realms.\n\nExtinguishing karma, transforming life and death,\nEach cause and effect has its origin.\nWho awakens to the reasons for coming and going?\nForm and soul have no beginning or end.\n\nAccumulated blessings build the foundation of fortune,\nLifting the body from the five peaks of peril.\nFreed from the Three Evil Paths,\nOne enters the serene emptiness.\n\nContemplating liberation across boundless realms,\nMeditation stirs divine resonance.\nThe Dharma turns in the threefold arena,\nTransforming one into a lofty immortal lord.\n\nI retrace my steps of the great *chun* tree,\nSoaring into the Palace of the Supreme Ultimate.\n\n**Hymn on Past-Life Karmic Conditions**\n\nRefraining from killing brings long life,\nFree from pain, ever apart from suffering.\nAll receive heavenly rank,\nBody at peace, finding support.\n\nRefraining from theft ensures purity and nobility,\nWealth and treasure naturally gather.\nSeven-jeweled palaces arise,\nJoy and contentment bring peace to others.\n\nRefraining from lewdness prevents disorder,\nThe body remains ever pure and clean.\nOffspring are upright and proper,\nVirtuous conduct brings wisdom.\n\nRefraining from deceit keeps the breath fragrant,\nWords remain loyal and steadfast.\nSpeech issues from the primordial Dao,\nDiscourse brings merit to fruition.\n\nNever letting wine pass the lips,\nNo errors or misdeeds arise.\nEver wishing to see blossoms and fruit,\nOne gains the service of heavenly beings.\n\nAt life’s end, ascending to heaven,\nThe twenty-five spirits come to welcome.\nCountless spirits descend of themselves,\nRadiant light ever resplendent.\n\nPracticing generosity brings great fortune,\nWealth and treasure come naturally.\nOffspring are ever noble,\nTransmitting joy through generations.\n\nUpholding precepts with reverence,\nHonoring the Nine Worthies.\nDevout and free from evil,\nOne preserves the body’s longevity.\n\nPracticing patience and humility,\nAnger never escapes the mouth.\nEnduring insults without response,\nBlessings and long life come naturally.\n\nDiligence without laziness,\nContemplating the Dao, one attains truth.\nDeeds aligning with the Dao,\nAt life’s end, one becomes a heavenly being.\n\nUnwavering in true devotion,\nLoyal and truthful, never deceitful.\nHonoring all virtuous ones,\nLife knows no hardship.\n\nThose who practice these six virtues\nAre reborn as humans.\nFaces upright and proper,\nNaturally becoming noble.\n\nStinginess without generosity,\nHoarding wealth, neglecting kin.\nGreedily coveting false honor,\nFailing to aid the old and poor.\n\nWives, children, and servants,\nLeft unclothed, starving in cold.\nSitting idly guarding wealth,\nAt death, one becomes a hungry ghost,\nBody never sated,\nSuffering sores and scars.\nBegging in vain from east to west,\nThe family perishes entirely.\n\nThose who craft deceit with their tongues,\nIn life and death are flayed and maimed.\nMolten bronze poured down their throats,\nTongues torn out, extending past their waists.\nForced to swallow, searing their mouths,\nTheir bellies and bowels rot within.\nLiving without thought of goodness,\nIn death, they are plunged into ash and charcoal.\n\nThose who scorn and slight others,\nAre tortured for ten thousand years.\nOnce their sins are exhausted and they emerge,\nThey become the lowliest of men.\n\nThe utterly wicked delight in killing,\nStealing, and acting as violent brigands.\nMaimed, they enter hell,\nSuffering calamity for ten thousand kalpas.\n\nThose who habitually harbor thieving hearts,\nRefusing to repay debts,\nWho kill for sport and hunt in the fields,\nOr commit unlawful acts in vulgar ways,\nWho act without sincerity or trust,\nAnd fly into rage at the slightest word—\nUnaware of their own sins,\nPreferring falsehood over truth—\nAre reborn as beasts,\nAs oxen, sheep, donkeys, or horses.\nStinking and foul, they bear heavy burdens,\nThus tormented for ten thousand kalpas.\n\nThose who commit incest or violate filial bonds,\nAre struck down by thunder and lightning.\nIn death, they fall into hell,\nHung upside down, scorched by fire.\n\nThose who slander the true Dao with their tongues,\nFace extreme suffering in their next life.\nMolten bronze poured down their throats,\nThey endure constant hunger and cold.\n\nThose who give alms without reluctance,\nRelieving all to bring peace,\nAttain purity and nobility in this life,\nAnd in the world, ascend as immortals.\n\nThose who honor virtue and power,\nObserve fasts, and behold true spirits,\nWho meditate with unwavering hearts,\nSee their seven generations rise to heaven.\n\nThose who endure insults without anger,\nAre born upright and proper.\nThose who study and cherish virtue,\nBecome the most honored among men.\n\nThose whose hearts are gentle and yielding,\nHumble and deferential to others,\nWho rescue others from peril,\nExtend their own lives.\nThose who reverently uphold the Precious Precepts,\nMaster the Nine Palaces’ Dao,\nAnd wholeheartedly trust in the Void,\nLive as long as heaven itself.\n\nYet there are the foolish and ignorant,\nArrogant and disdainful toward their parents,\nLacking reverence and respect—\nThey are reborn as lowly men.\n\nThose who see treasures yet fail to bow in reverence,\nWho defy and offend their elders,\nWho act without kindness or filial piety,\nAre reborn as slaves and servants,\nDependent on others for food and clothing,\nDriven and beaten day and night,\nSuffering endless torment in life,\nWith no escape even in death.\n\nThose who indulge in lust and debauchery,\nWho disbelieve in spirits and gods,\nAre reborn to endure hunger and cold,\nTheir every endeavor beset by hardship.\n\nThose who default on debts yet curse,\nWho in poverty revile their ancestors,\nAre reborn as oxen or sheep,\nTormented and oppressed by men.\n\nThose who firmly believe in the Way of Life,\nWhose compassionate hearts are ever sorrowful,\nWho eat plainly and keep their bodies pure,\nAscend to heaven after transformation.\n\nThose who reverently honor the Three Treasures,\nWho are not arrogant toward their parents,\nWho are utterly sincere and never deceitful,\nAre the truly loyal and filial.\n\nThose who guard their tongues from false speech,\nWhose hearts encompass all,\nWho urge others to shun sin,\nAnd meditate on the Dharma without transgression,\nWho aid the destitute and rescue the imperiled—\nTheir merit and virtue are weighty indeed.\nTheir years and lifespan increase,\nAnd they enjoy joy and peace all their lives.\n\nThose who befriend others with magnanimity,\nRespecting one another as parents,\nWho suppress evil and extol virtue,\nWhose filial piety and brotherly love move the gods—\nSuch men are true.\n\nThose who deceive and lie,\nLacking all sincerity,\nWhose hearts and words contradict,\nEndure filth and disgrace in life.\nThose who are perverse and delight in slander,\nFall into hell at death.\nMolten bronze poured down their throats,\nTheir suffering endless in the dark.\n\nThose who drown in wine and hurl curses,\nWho disbelieve in spirits and gods,\nHave their tongues hooked with iron,\nTheir pain and torment beyond words.\nIf they are reborn among men,\nTheir breath is forever foul and rank,\nHated by all,\nBeset by misfortunes.\nEvil thoughts constantly befall them,\nWherever they turn, they meet punishment.\nWithout cause, they are ensnared,\nEnduring every kind of agony.\nIn death, they return to hell,\nAnd in their next life, become beasts,\nTrapped in the Five Poisons’ cycle,\nWhere sorrow, torment, and shame arise.\n\nThose who honor and return to the Three Powers,\nWho preach and urge good deeds,\nWish to behold immortals and sages,\nAnd welcome true beings to come.\nThey wish to embrace all the worthy,\nMaking them equal to themselves.\nWith hearts serene and purified,\nThey refine themselves through the Hundred Precepts.\nDay and night, they diligently cultivate and study,\nTheir wisdom making them heavenly beings.\n\nYin was transformed in the Western Land,\nUniversally guiding all to know the true Dao.\nFirmly devoted to contemplating immortals,\nTheir thoughts accumulate without difference.\nFirst, they wish to ascend and wander the Void,\nCommuning with the subtle and imperceptible.\n\nAccumulate goodness without tiring,\nBestow kindness without reluctance.\nMerit and virtue move the immortals,\nWho naturally bestow the Elixir.\n\n*Ode to the Supreme by Master Chongmiao*\n\nThe Emperor receives Heaven’s mandate,\nHis sacred lifespan everlasting.\nGolden branches flourish,\nJade leaves ever fragrant.\nThe Five Stars follow their order,\nThe Seven Luminaries cast their radiance.\nResplendent and glorious,\nThe numinous verses fill the Void.\nBlessing our sagely emperor,\nHis precious throne boundless.\nHeaven clear, earth tranquil,\nAll realms bathed in light.\n\nThe Sacred Mother of the West,\nAdorned with precious jade,\nAttends the Phoenix Pavilion and Dragon Terrace,\nEver close to the imperial carriage.\nRainbow light pierces the Dipper,\nThe moon gleams in the Great Void.\nThe sacred palace, serene and pure,\nForever guards Heaven’s abode.\n\nFlourishing in this era of harmony,\nDaily she serves before the Most High.\nDwelling in the Dragon and Phoenix Palaces,\nHer name recorded among the immortals.\nBurning incense, she thanks Heaven’s grace,\nForever reciting the *Xiyi* chapters.\nA thousand lives bring a hundred blessings,\nHer place in the Heaven of Pure Tenuity.\nEver abiding in the realm of carefree ease,\nShe enjoys blessings naturally.\n\nHeaven-born wisdom,\nComes to praise this flourishing age.\nLike ice and jade, sharp and pure,\nWith the bearing of phoenix and simurgh.\nHarmonizing the primal transformations,\nShe aids in the era of peace.\nFields sing with verdant growth,\nArms rest from subduing the four barbarians.\nEver attaining the Five Blessings,\nHeaven’s favor eternally gathers.\n\nResplendent, the verses fill the Void,\nTheir numinous sound shakes the Nine Heavens.\nThe Perfected One opens the treasure trove,\nTransmitting the *Xiyi* chapters.\nThe precious gāthā now passes on,\nThe sacred text delivers ancestors.\nRescuing souls from the long night,\nThey ascend to the Vermilion Terrace Heaven.\n\nWith reverent hearts, they honor what they serve,\nGiving thanks before the Void Emperor.\nThe Jade Emperor proclaims Heaven’s decree,\nUniversally releasing souls from the dark night.\nThe Eight Difficulties all dissolved,\nThe Five Paths all opened.\nFengdu’s retribution ceases,\nThey ascend to the Vermilion Terrace Palace.\nAll beings awaken to the supreme Dao,\nForever enjoying boundless blessings.\n\nThe Venerable Original Beginning of Jade Capital,\nLord of creation and myriad transformations,\nReveals the sacred text to the Three Officials,\nOpening the Nine Dark Prisons below.\nIn Fengdu’s cauldrons of flame,\nCompassion showers the Dharma rain.\n\nThe myriad sinful souls are cleansed,\nAll attain deliverance and transcendence.\nWith wholehearted devotion they face the Supreme Ultimate,\nThe Jade Emperor bestows boundless grace.\nHeaven’s decree is proclaimed to the earthly prisons,\nOpening the path for souls of the long night.\nThe Nine Dark Halls release the seven generations of ancestors,\nThe sacred talismans notify the Three Officials.\nImmortals together guide them upward,\nAscending to the Vermilion Terrace Heaven.\nForever severed from the roots of karmic transgression,\nThey eternally enjoy the blessings of nature.\n\nThe Great Sage Lord of the Golden Portal,\nMaster of the myriad spirits of Heaven and Earth,\nIn compassion showers the sweet dew,\nWashing away all dust and delusion.\nExpounding the *Kongdong* chapters far and wide,\nUniversally awakening beings to the Mystery of Mysteries.\nRescuing from the Eight Difficulties’ suffering,\nFreeing from the Five Turbidities’ mire.\nDelivering beyond the Sea of Six Poisons,\nForever parting from greed, wrath, and delusion.\nImmortals together guide them upward,\nCarefree they ascend to the Grand Tenuity.\nThe Jade Emperor bestows divine favor,\nHeaven proclaims to the ten thousand spirits.\nRescuing from the Nine Dark Halls’ suffering,\nExpounding the Three Caverns’ scriptures.\nNames recorded in the Southern Cinnabar Palace,\nSouls transcend the Northern Frigid Court.\nForever parted from the cauldrons of flame,\nDirectly emerging from the City of Ice Pools.\nImmortals together deliver them,\nCarefree they ascend to the Grand Purity.\n\n*In Praise of the Deliverer from Suffering*\nOur Master, the Venerable Deliverer from Suffering in Heaven,\nEver skillfully transforms form across the ten directions.\nWith this majestic radiance, great compassion arises,\nRescuing those countless beings from boundless suffering.\nThe Nine Nights’ profound darkness in the gloomy prisons,\nUniversally illumined to generate light.\nThe ox-headed jailers all become immortals,\nEvery sunken soul attains liberation.\n\n*The Hymn of the Four-Eyed Elder*\nThe Five Qi of the Mysterious Origin,\nExpounding the Dharma to cross the ford of delusion.\nBeyond images, no image of Dharma,\nWithin the real, seek the supreme real.\nDelusion and awakening lie in the mind’s awakening,\nThe mind’s numinosity makes the Dharma numinous.\nThe spirit fundamentally has no Dharma to grasp,\nThe mind’s vitality generates the spirit.\nIf my mind is single-minded,\nThe divine luminaries follow the mind’s movement.\nThe supreme principle fundamentally has no discourse,\nThe supreme Dao fundamentally has no words.\nAll images are false,\nThe spirit’s numinosity requires my own numinosity.\nTo penetrate the subtlety within subtlety,\nObserve the inner mind in quiescence.\nWithin and without, no trace of obstruction,\nPenetratingly empty, the mind is no-mind.\nThe mind now free of names and images,\nNaturally transcends the immortal courts.\nEmbracing the One to become the True One,\nCarefree they ascend to the Grand Purity.\n\n*The Blood Lake True Sutra’s Hymn*\nReverently bowing to the formless, supreme Dao,\nThe Great Compassionate Deliverer from Suffering.\nDivine radiance of a hundred billion illumines the central darkness,\nCompassionate clouds universally cover, drenching with Dharma rain.\nThe *Xiashi Mingling* Avīci Hell,\nThe Blood Lake, Blood Sea, and Blood Pool Basin.\nThe Jade Register’s great amnesty for all sinful souls,\nLiberating from the ten thousand kalpas’ suffering of sinking and drowning.\nRefining form and delivering life in the Vermilion Terrace Palace,\nAwakening to the Dao and ascending to the true through the Gates of Myriad Mysteries.\nVast and towering, merits beyond conception,\nForever serving as the compassionate father to all beings.\n\n*The Marvelous Mind-Seal of Deliverance from Sin: Gāthā and Hymns*\nThe Dao is vast and clear,\nThe primordial principle profound and obscure.\nBorn before Heaven, it governs transformations through the ages.\nThe Dao has no form,\nClarifying body and mind.\nNo greed, no desire,\nNo wrath, no licentiousness.\nRight and wrong are not discerned,\nWithin and without, seek and ponder.\nBody and mind pure and serene,\nAfflictions do not invade.\nNo arising, no ceasing,\nAbstruse and unfathomable.\nProfoundly empty and quiescent,\nThe mind is no-mind.\nNaturally in harmony with the Dao,\nAll sages come to revere.\nAscending to the Golden Portal,\nRoaming and playing in the *Qianlin* groves.\nSeven generations of ancestors liberated,\nForever parted from the gloomy darkness.\nAll accord with the mind-seal,\nAwakening to the Dao and uniting with the real.\nThought after thought in succession,\nLet no dust-mind arise.\n\n*The Wondrous Chapters of the Three Caverns’ Hymns of Praise, Scroll the Lower, Concludes.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "三洞赞颂灵章 经名：三洞赞颂灵章。 三卷。 底本出处：《 正统道藏》 洞真部赞颂类。 三洞赞颂灵章卷上 玉清惠命颂 稽首玉清元始尊，稽首金阙虚无帝。 包含造化运阴阳，极处自然无凝滞。 生天生地生人物，五色祥光随处慧。 度人无量不思议，敢仗祥光来拯济。 归命东极宫中尊，归命十方救苦尊。 毫光遍照三千界，智慧潜通五苦门。 常以广大威神力，慈悲救苦济亡魂。 指迷恶道返归真，法桥大度永长存。 华盖玄谒真凝炁章 幽微蕊宫为仙宅，道贯枢灵圆景白。 飞根散叶翳翠条，妙炁三华贯幽彻。 郁灵杳淑真人墟，云景眸奔通烜赫。 泥丸三五合灵芝，结珠固精神炁活。 飞烟妙霭却残凶，炼获飞仙去否厄。 太玄太和在右府，紫清真人道为主。 中虚恬淡自怡然，返老还胎导玄圃。 知雄守雌资天机，回反乾坤镇中主。 飞玄神炁合青玄，含药吐芳明子午。 炼养灵根不复枯，万灵朝会群阴睹。 琅音玉霜灌死体，徘徊沉默须周普。 擒龙捉虎坐飙舆，隐韵流音遨妙府。 黄华朱醴濯阳精，万道炁为群仙举。 妙英飞爽集玄炁章 道贯青玄集素瑞，灵宝飞真琼妙炁。 生魂育魄返金容，五藏生华凝景翠。 三田飞郁映华峰，宝曜玄黄端拱会。 提携日月运纵玑，九炁发春扬拆地。 含和吐蕊曜金莲，骊龙吐珠呈彩翅。 鸾呜凤翔对上宾，虎啸虚岩华曲丽。 洞观三界百关明，六纬七经齐天地。 飞灵焕景掷炎灵，东井天河灌幽渭。 九龙奔跃骞宝园，圆景灿炜总翘辔。 飞霞采集咀玉根，景景胎仙生万汇。 千灾却消摧凶残，幽室光明何所击。 紫华混合青玄宫，电掣雷奔绛霞閟。 云台碧落黍米珠，导达光玄焕二炁。 注念左府悟玄机，反覆阴阳成上位。 青灵九炁君颂 东华吐灵凤，西宫扣瑶音。 三炁结空洞，太虚生中心。 灵书披七条，宝文翠华林。 凤福逐天响，六时应节吟。 上有度命童，焕夜朗长阴。 万劫保形明，眇眇莫能寻。 长炼不死年，与运同浮沈。 日月照灵魂，游玑向东南。 九星落形影，宝花生五心。 自有不雕神，与我契丹金。 赤书检籍炁，玉诀妙自陈。 朱宫有绿籍，魔神莫能侵。 丹灵三炁君颂 绛云翠玉虚，灵风披太微。 辽辽六炁降，眇眇吐灵辉。 乘我日中影，披辔顺天回。 朱童披灵夜，洞阳炼落晖。 玉章度促年，灵歌五神开。 长浪无绝景，一念入九围。 亿劫超幽期，华命不雕衰。 飞天披重关，南宫朗凶机。 朱陵定绛籍，神备使形飞。 七祖上生天，福德高巍巍。 轮转空洞魂，出我九玄扉。 夜景披朝阳，飘飘乘运归。 皓灵七炁君颂 琨台生琅音，玉炁遐七冥。 宝章洞太虚，摄真入无形。 锦云翠朱日，圆华逐月生。 混合自然炁，迢迢九遐清。 六慧纯梵行，五神有高灵。 绛宅耀朱景，万劫不雕零。 长存好生君，太乙合黄宁。 保命度符籍，炼魂金华庭。 引归不死炁，飘飘乘运生。 七玄入南官，枯骸更鲜荣。 长乐登云浮，高飞戏彩軿。 逍遥大罗外，三界莫能轻。 玄灵五炁君颂 飞步入北清，把真招上元。 乘景望玄台，四华生锦云。 中有采芝童，羽衣何纷纷。 长歌九命籍，金箓赤书文。 十绝远华庭，飘飘度命幢。 绿盖乘风回，丹霄拱琼轩。 为我造上皇，拔录九夜门。 度命朱陵阙，长保亿劫桩。 留神营绛府，赤子明玄关。 受形不死炁，自然生宝魂。",
      "translated_text": "**Hymns of the Three Caverns: Divine Chapters**\n\n**Title:** *Hymns of the Three Caverns: Divine Chapters*. Three fascicles. Source text: *Daoist Canon of the Zhengtong Era*, \"Hymns and Eulogies\" section of the *Dongzhen* Department.\n\n**Fascicle One**\n\n**Hymn to the Life-Bestowing Command of Jade Purity**\nI bow my head to the Most High Lord of Jade Purity,\nI bow my head to the Emperor of Golden Towers and the Void.\nEncompassing creation, moving yin and yang,\nIn its ultimate state, naturally free from stagnation.\nGiving birth to heaven, earth, and all beings,\nFive-colored auspicious radiance follows wisdom everywhere.\nDelivering countless beings beyond thought or measure,\nI dare to rely on this auspicious light for salvation.\nI surrender my life to the Venerable One in the Eastern Palace,\nI surrender my life to the Saviors of the Ten Directions.\nSubtle radiance pervades the three thousand worlds,\nWisdom silently penetrates the five gates of suffering.\nEver with vast and mighty divine power,\nCompassionately saving the suffering and delivering the lost souls.\nGuiding the lost from evil paths to return to the True,\nThe great Dharma Bridge of deliverance endures forever.\n\n**Mysterious Petition to the Flower Canopy and the True Congealed Qi**\nThe hidden and subtle Palace of the Pistil is the immortal’s abode,\nThe Dao pierces the pivot of spirit, the white radiance of the perfect sphere.\nFlying roots scatter leaves on kingfisher branches,\nWondrous qi of the Three Flowers penetrates the profound and clear.\nLush and numinous, the pure land of the Perfected,\nClouds and light surge forth in dazzling brilliance.\nThe Three and Five unite with the divine mushroom in the Mud Pill Palace,\nStringing pearls to secure the spirit and enliven the qi.\nFlying mists and wondrous vapors dispel lingering misfortune,\nRefining and attaining flight as immortals to escape calamity.\nGreat Mystery and Great Harmony reside in the Right Mansion,\nThe Perfected of Purple Clarity preside over the Dao.\nWithin emptiness, tranquility, and contentment, naturally at ease,\nReversing age to return to the womb, guiding to the Mystic Garden.\nKnowing the masculine, guarding the feminine, drawing on celestial mechanism,\nReversing and returning, the ruler stabilizes the center of heaven and earth.\nFlying mystery and divine qi merge with the Azure Mystery,\nHolding the elixir, exhaling fragrance, illuminating the midnight and noon.\nRefining and nurturing the numinous root so it never withers,\nThe ten thousand spirits gather, the host of yin beholds.\nJade frost and resonant tones bathe the dead body,\nWandering in silence, the cycle must be universal.\nSeizing the dragon, capturing the tiger, seated in the whirlwind chariot,\nHidden rhymes and flowing sounds roam the wondrous mansion.\nYellow blossoms and vermilion nectar lave the yang essence,\nThe myriad Dao’s qi uplifts the assembly of immortals.\n\n**Mysterious Qi Gathers the Flying Radiance of Wondrous Flowers**\nThe Dao pierces the Azure Mystery, gathering pristine auspiciousness,\nNuminous Treasure and flying Perfected merge with jade-like wondrous qi.\nNurturing the hun and fostering the po to return to golden countenance,\nThe five viscera bloom with splendor, congealing radiant verdancy.\nThe Three Fields soar in lushness, reflecting the Flowery Peaks,\nPrecious luminaries of the mysterious and yellow stand in solemn assembly.\nLifting the sun and moon, moving the pivot of the celestial sphere,\nThe Nine Qi herald spring, unfolding the earth.\nHolding harmony, exhaling pistils, illuminating the golden lotus,\nThe black dragon spits pearls, displaying iridescent wings.\nPhoenixes sing and soar, facing the honored guests,\nTigers roar in the empty cliffs, their splendor resplendent.\nGazing through the Three Realms, the hundred passages shine clearly,\nThe six wefts and seven warp threads align heaven and earth.\nFlying spirits and radiant scenes cast forth fiery numina,\nThe Eastern Well and Celestial River bathe the hidden and dark.\nNine dragons leap and bound through the soaring Treasure Garden,\nCircular radiance blazes in total brilliance, all reins raised.\nFlying rosy clouds gather, chewing the jade root,\nScene after scene, womb immortals give birth to the myriad forms.\nA thousand calamities vanish, crushing malevolence,\nThe hidden chamber’s light—what can strike it?\nPurple blossoms merge with the Azure Mystery Palace,\nLightning flashes, thunder rushes, crimson clouds conceal.\nThe Cloud Terrace and Azure Vault, grains of millet pearls,\nGuiding and illuminating the luminous Mystery, the Two Qi shine.\nFocusing thought on the Left Mansion, awakening to the Mystic Mechanism,\nReversing and cycling yin and yang to attain the highest rank.\n\n**Hymn to the Lord of the Nine Qi of Azure Numinosity**\nThe Eastern Flowery emits numinous phoenixes,\nThe Western Palace strikes jade-like tones.\nThe Three Qi knit the empty cavern,\nThe Great Void gives birth to the center.\nNuminous scriptures unfold in seven strips,\nTreasure texts flourish in the verdant forest.\nPhoenix blessings follow the celestial resonance,\nThe six hours chant in harmony with the seasons.\nAbove, the Youth Who Delivers Lives,\nIlluminating the long night, dispelling the dark.\nThrough ten thousand kalpas, preserving the luminous form,\nVast and distant, none can seek it.\nForever refining the undying years,\nFloating and sinking with the course of fate.\nSun and moon shine upon the numinous soul,\nThe pivot of the celestial sphere turns to the southeast.\nThe Nine Stars cast their forms and shadows,\nTreasure flowers bloom in the five hearts.\nNaturally possessing the undecaying spirit,\nIt harmonizes with me like cinnabar and gold.\nThe Red Script inspects the qi of the registers,\nJade formulas wondrously declare themselves.\nThe Vermilion Palace holds the Green Registers,\nDemons and spirits dare not invade.\n\n**Hymn to the Lord of the Three Qi of Cinnabar Numinosity**\nCrimson clouds and jade-like emptiness,\nNuminous winds unfold the Great Subtlety.\nVast and distant, the Six Qi descend,\nSubtle and faint, they exhale numinous radiance.\nRiding my shadow at midday,\nI rein in and follow heaven’s revolution.\nThe Vermilion Youth dons the numinous night,\nRefining the Yang Cavern, tempering the setting sun.\nJade chapters deliver the hastened years,\nNuminous songs open the five spirits.\nEndless waves without ceasing,\nA single thought enters the Nine Enclosures.\nThrough countless kalpas, transcending the hidden ages,\nThe flowery life does not decay or decline.\nFlying immortals traverse the layered barriers,\nThe Southern Palace illuminates the mechanisms of misfortune.\nThe Vermilion Mound establishes the crimson registers,\nSpirits prepare, enabling the body to fly.\nSeven ancestors ascend to heaven,\nTheir blessings and virtues towering and majestic.\nThe wheel turns the empty cavern soul,\nEmerging from my Ninefold Mystery’s gate.\nNight’s radiance dons the morning sun,\nFloating and floating, riding the course to return.\n\n**Hymn to the Lord of the Seven Qi of Radiant Numinosity**\nThe Kun Terrace births jade-like tones,\nJade qi reaches the distant Seven Darknesses.\nTreasure chapters pierce the Great Void,\nDrawing the true into formlessness.\nBroidered clouds and crimson sun,\nCircular blossoms follow the moon’s birth.\nMerging with the qi of spontaneity,\nVast and distant, the Ninefold Mystery is pure.\nSix wisdoms, pure Brahman conduct,\nFive spirits possess lofty numinosity.\nThe Crimson Mansion shines with vermilion radiance,\nThrough ten thousand kalpas, undecaying and unscattered.\nEver abiding, the Lord Who Loves Life,\nThe Great One unites with the Yellow Tranquility.\nPreserving life, delivering the talismanic registers,\nRefining the hun in the Golden Flower Court.\nGuiding to return to the undying qi,\nFloating and floating, riding the course to life.\nThe Seven Mysteries enter the Southern Palace,\nWithered bones become fresh and flourishing.\nEver joyful, ascending the floating clouds,\nSoaring high, playing in the painted chariot.\nCarefree beyond the Great Veil,\nThe Three Realms cannot slight it.\n\n**Hymn to the Lord of the Five Qi of Mysterious Numinosity**\nFlying steps enter the Northern Clarity,\nGrasping the true, summoning the Supreme Prime.\nRiding the radiance, gazing toward the Mysterious Terrace,\nFour blossoms birth broidered clouds.\nWithin, the mushroom-gathering youth,\nFeathered robes—how they flutter!\nSinging the long song of the Ninefold Life Registers,\nThe Golden Record and Red Script texts.\nTen absolutes, the distant Flowery Court,\nFloating and floating, delivering the banner of life.\nThe green canopy rides the wind in return,\nThe Cinnabar Empyrean bows to the jasper carriage.\nFor me, creating the Supreme August,\nExtracting the records from the Nine Night Gates.\nDelivering life at the Vermilion Mound’s gate,\nForever preserving the kalpas’ stake.\nLeaving the spirit to tend the Crimson Mansion,\nThe Red Child illuminates the Mysterious Pass.\nReceiving the form of the undying qi,\nNaturally giving birth to the treasure soul.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1252,
      "start_sentence": 0,
      "end_sentence": 92,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.04874134063721,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\赞颂类\\三洞赞颂灵章.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "七祖度南宫，世世福庆门。 青玄凝真导魂章 玉京万法大罗尊，千重宝梵亿玄言。 碧霞绛云引众道，玉阙金合敷真文。 偃定高真游飞空，八极飞神度无边。 郁郁昭昭万炁中，吐声如婴炁成纹。 振动梵天是空道，静明法曜惟慈云。 超简昏衢北罗酆，列上金简还灵明。 炎炎火池成清凉，解刃挫锋悉摧纷。 豁散业境空法身，保召罪性来吾坛。 天尊经济本无际，万天万地成真元。 莫有不从不化度，超凌三界佐虚玄。 随心所召随心归，仙信梵音如甘泉。 一闻百骸解热恼，朱陵开度成飞玄。 超凡大道入慈悲，不濯巨细惟翩伶。 华夏泠泠引汝魂，逍遥独步紫虚天。 金真章 天魔乘空发，万神骇神庭。 托化谣歌章，随变入无名。 嚣尘何纷纭，秽道当涂生。 云合结朱空，北帝涌神兵。 鼓极自知道，玄运来相征。 上景御飞辔，迅驾检云营。 促校北帝录，收执群魔明。 豁落张天罗，放威掷流铃。 金真护空洞，玉光焕八冥。 金符守上宫，神精戮天精。 剪灭万妖炁，亿亿龟齐龄。 上承九天信，啸命靡不倾。 招真究三洞，惠诵朗日清。 八道望玄霞，七转纬天经，洞合帝一真，拔度七祖程。 削落五苦根，反魂蒙受荣。 金光耀寂室，神烛自然生。 香花散玉宇，烟炁彻玉京。 帝遣徘徊辈，三元降绿軿。 迅驾腾九玄，朝我玉皇庭。 玄掖振云袂，飞空乐未央。 高步七宝林，逍遥天衢长。 迢迢玉京山，琼台耀飞梁。 仰观黄金阙，俯窥白玉床。 中有黄老君，紫炁斡天章。 宴坐捧生籍，绿笔纪华阳。 万劫长无期，超凌不死乡。 云衢耀明景，琼田植紫芝。 神风翔高清，琅琅声何悲。 三华覆八圆，梵炁笼玄机。 至道参寥廓，招真凌云飞。 吟哦欢蒨灿，阆风映昆池。 下有招仙子，千劫戏云衣。 不老游万天，十极云霞栖。 紫盖策神麾，朱霞瑛清微。 郁仪焕丹极，结璘耀玄辉。 神风抱三素，九老扬云旗。 俯仰重霄上，宴乐服灵虚。 携晨朝玉宾，西华罗高墀。 窈窕方诸宫，青童蹑云墀。 旋步歌丹凤，朗哺乘云飞。 西宴瑶池湄，东遨蓬莱津。 倏忽越桑田，旸谷耀朱晨。 龙旌曳千林，宝盖回九真。 流铃焕中黄。 握节斥魔氛。 万仙拍手笑，清歌浩无垠。 翘倾观太无，齐龄太上宾。 检仙尊帝一，金书妙雌雄。 高奔契八素，混合百神功。 二老两仙王，五灵符籍同。 神光耀金楼，妙哉云炁重。 是谓大洞法，九真步玄空。 金津和玉液，咽服琼树丰。 郁罗朝太上，扬袂歌天风。 乘烟结霞友，御辔歌寥闲。 北登广寒宫，玄英玉练颜。 飞步天津上，云璈呜鼓弹。 龙軿驾虎袱，朝揖扶桑暾。 夕憩琪林影，携提控九玄。 遨游太空馆。 徘徊运朱输。 受书登南丹，长歌亿万春。 朝登太微宫，夕憩常阳台。 天风扇清泠，策驾五云回。 星珠罗碧汉，绰约流九垂。 眇莽御明烟，圆霄宴玉墀。 神虎摄万魔，灵威焕巍巍。 金真检云营，玉室映灵阶。 丹丘圆方，奇哉仙真才。 泛景宴紫清，云旌怜丹霄。 遐观瑶台上，钓天何迢迢。 流风焕骞树，神光耀琼楼。 仰噏玄珠华，金书辉层洲。 万天拱四皇，羽履回烟辀。 八浮罗凤盖，琅树瑛飞飙。 霞塘带神畿，千龄如一朝。 琳琅魁华晨，九遐凌非烟。 左顾招无英，右盼揖白元。 神光御玄素，黄老俯芝田。 吉光驾飞乘，游戏控流軿。 高皇觐紫微，恍朗游万天。",
      "translated_text": "The Seven Ancestors cross the Southern Palace,\nGeneration upon generation, the gate of fortune and blessing.\n\n**Green Mystery’s True Qi Guides the Soul Chapter**\nThe Jade Capital, myriad dharmas, Great Luo’s Honored One,\nA thousandfold jeweled mantras, ten thousand mysteries’ words.\nAzure radiance and crimson clouds lead the host of Dao,\nJade towers and golden caskets unfold the true texts.\nSupreme Perfected recline in soaring flight through the void,\nThe eight poles’ flying spirits cross boundless realms.\nLush and luminous within the myriad qi,\nVoices like infants’—qi forms patterns.\nVibrating Brahma Heaven, the empty Dao,\nSerene and bright, the Dharma’s radiance is only compassion’s clouds.\nTranscending the dark crossroads of Northern Feng,\nInscribed upon golden tablets, returning to numinous clarity.\nThe blazing Fire Pool becomes cool and refreshing,\nBlades unbind, edges dull—all shatter and scatter.\nDispersing karmic realms, the Dharmakāya is empty,\nSummoning the nature of sins to our altar.\nThe Heavenly Honored’s governance knows no bounds,\nMyriad heavens, myriad lands—all become true origin.\nNone exist who are not transformed and delivered,\nTranscending the Three Realms to assist the Void Mystery.\nFollowing the heart’s call, returning as the heart desires,\nImmortal trust, Brahma’s sound like sweet springs.\nAt first hearing, the hundred bones dissolve heat and vexation,\nZhuling opens the crossing—becoming flying mystery.\nThe Great Dao transcends the mundane, entering compassion,\nNo washing of great or small—only light and fleet.\nChina’s cool clarity guides your soul,\nCarefree and solitary, stepping the Purple Void Heaven.\n\n**Golden Perfection Chapter**\nHeavenly demons ride the void, erupting,\nMyriad spirits startle the divine court.\nEntrusted with transformation’s ballad and hymn,\nFollowing change, entering namelessness.\nClamor and dust—how tangled,\nDefiled paths arise along the way.\nClouds gather, forming crimson skies,\nThe Northern Emperor surges forth divine soldiers.\nThe drum’s limit knows the Dao,\nMysterious fate comes to summon.\nUpper luminants mount flying reins,\nSwift chariots inspect the cloud camps.\nUrging the Northern Emperor’s records,\nSeizing and binding the host of demons’ brightness.\nVast and open, spreading Heaven’s net,\nUnleashing might, hurling streaming bells.\nGolden perfection guards the empty cavern,\nJade light illumines the eight darknesses.\nGolden talismans guard the upper palace,\nDivine essence slays celestial spirits.\nSevering the myriad demonic qi,\nCountless as tortoises’ ages.\nUpholding the Nine Heavens’ trust,\nWhistling commands—none do not yield.\nSummoning Perfected, exploring the Three Caverns,\nKind recitation—bright as the sun’s clarity.\nEight paths gaze toward the mysterious radiance,\nSeven revolutions weave the Heavenly Canon,\nCaverns unite with the Emperor’s One Truth,\nDelivering the Seven Ancestors’ journey.\nCutting away the five sufferings’ roots,\nReturning souls receive glory’s mantle.\nGolden light shines in the silent chamber,\nDivine candles naturally arise.\nFragrant flowers scatter the Jade Universe,\nMist and qi penetrate the Jade Capital.\nThe Emperor dispatches the lingering ranks,\nThree Primes descend in green chariots.\nSwift chariots ascend the Nine Mysteries,\nPaying court to our Jade Emperor’s court.\nMysterious sleeves flutter cloud sleeves,\nFlying through the void—joy without end.\nHigh-stepping the Seven Jeweled Grove,\nCarefree along Heaven’s long thoroughfare.\nFar-off Jade Capital Mountain,\nJasper terraces gleam with flying beams.\nGazing up at the golden palaces,\nLooking down at the white jade couches.\nWithin sits the Yellow and Old Lord,\nPurple qi revolves Heaven’s canon.\nReclining, he holds the Register of Life,\nGreen brush records the Flourishing Yang.\nFor ten thousand kalpas, endless duration,\nTranscending the realm of no death.\nCloud thoroughfares glow with bright radiance,\nJasper fields plant purple mushrooms.\nDivine winds soar the high clarity,\nClangorous sounds—how mournful!\nThree blossoms cover the eight circles,\nBrahma’s qi envelops the mysterious mechanism.\nThe utmost Dao joins the vast and empty,\nSummoning Perfected, soaring on clouds.\nChanting and singing—joyful and resplendent,\nLangfeng reflects Kun Pond.\nBelow dwell the Summoning Immortals,\nFor a thousand kalpas, playing in cloud robes.\nAgeless, roaming the myriad heavens,\nThe ten poles nest in cloud and mist.\nPurple canopies urge divine banners,\nCrimson radiance illumines the Clear Subtlety.\nYu Yi shines on the Cinnabar Ultimate,\nJie Lin glows with mysterious splendor.\nDivine winds embrace the Three Primes,\nNine Elders wave cloud banners.\nLooking up and down in the layered skies,\nFeasting in the service of numinous emptiness.\nEscorting the dawn to the Jade Guests,\nWestern Florescence arrays the high steps.\nGraceful, the Square Vases Palace,\nAzure lads tread the cloud steps.\nTurning steps, singing the Red Phoenix,\nBrightly feeding, riding clouds in flight.\nWestern feasts by Jasper Pool’s edge,\nEastern wanderings at Penglai’s ford.\nIn an instant, crossing Mulberry Fields,\nYang Valley glows with crimson dawn.\nDragon banners trail through a thousand groves,\nJeweled canopies wheel the Nine Perfected.\nStreaming bells gleam in the Central Yellow.\nGrasping the tally, dispelling demonic mists.\nMyriad immortals clap hands and laugh,\nClear songs vast and boundless.\nCraning to gaze at the Great Nonbeing,\nEqual in age to the Supreme’s guests.\nInspecting immortals, honoring the Emperor’s One,\nGolden script’s wondrous feminine and masculine.\nSoaring high, joining the Eight Primes,\nMerging the hundred spirits’ merits.\nTwo Elders and two Immortal Kings,\nFive Numinous tally with the registers.\nDivine light shines on the golden towers,\nWondrous indeed—cloud qi layered.\nThis is called the Great Cavern’s Dharma,\nNine Perfected step the mysterious void.\nGolden nectar harmonizes jade liquid,\nSwallowing and serving the lush jasper trees.\nLush Luo pays court to the Supreme,\nSleeves raised, singing Heaven’s winds.\nRiding mist, befriending rosy clouds,\nReins in hand, singing the vast and leisurely.\nNorthward ascending the Vast Cold Palace,\nMysterious flourishing—jade-polished countenances.\nFlying steps above the Heavenly Ford,\nCloud zithers sound, drums resound.\nDragon chariots harness tiger steeds,\nMorning salutations to Fusang’s sun.\nEvening rests in the jasper grove’s shadows,\nGuiding and leading the Nine Mysteries.\nRoaming the Great Void’s halls,\nLingering, moving the crimson wheels.\nReceiving the scriptures, ascending Southern Cinnabar,\nSinging long songs for a hundred million springs.\nMorning ascends the Supreme Subtlety Palace,\nEvening rests at the Constant Yang Terrace.\nHeavenly winds fan cool clarity,\nUrging the chariot, returning on fivefold clouds.\nStar pearls array the azure Han,\nGraceful, flowing through the ninefold hangs.\nVast and boundless, riding bright mist,\nRound skies feast at the jade steps.\nDivine tigers seize the myriad demons,\nNuminous might shines majestically.\nGolden perfection inspects the cloud camps,\nJade chambers reflect the numinous stairs.\nCinnabar Mound’s round and square,\nWondrous indeed—the immortals’ talents!\nSailing radiance, feasting in Purple Clarity,\nCloud banners cherish the Cinnabar Empyrean.\nGazing afar at the Jasper Terrace,\nHow distant—Heaven’s Fishing!\nFlowing winds illumine the soaring trees,\nDivine light shines on the jasper towers.\nInhaling the mysterious pearl’s blossoms,\nGolden script glows on the layered isles.\nMyriad heavens bow to the Four August Ones,\nFeathered sandals turn the misty chariots.\nEight Floating Luo phoenix canopies,\nJade trees’ radiance flies in the whirlwind.\nRosy ponds gird the divine precincts,\nA thousand ages like a single dawn.\nJewel-like, magnificent in the morning,\nNine distances transcend the non-smoke.\nLeftward, summoning Non-Brightness,\nRightward, bowing to White Prime.\nDivine light mounts the mysterious primes,\nYellow and Old Lord bends over the mushroom fields.\nAuspicious light harnesses the flying chariot,\nPlaying and controlling the flowing chariots.\nHigh August One visits Purple Tenuity,\nVast and bright, roaming the myriad heavens.",
      "overlap_context": "t,\nFloating and floating, delivering the banner of life.\nThe green canopy rides the wind in return,\nThe Cinnabar Empyrean bows to the jasper carriage.\nFor me, creating the Supreme August,\nExtracting the records from the Nine Night Gates.\nDelivering life at the Vermilion Mound’s gate,\nForever preserving the kalpas’ stake.\nLeaving the spirit to tend the Crimson Mansion,\nThe Red Child illuminates the Mysterious Pass.\nReceiving the form of the undying qi,\nNaturally giving birth to the treasure soul.",
      "start_char": 1252,
      "end_char": 2496,
      "start_sentence": 93,
      "end_sentence": 190,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 49.819008111953735,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\赞颂类\\三洞赞颂灵章.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "春秋无雕谢，千劫穷遐年。 至真无所得，携提灵景仙。 青帝歌 东望重拜手，苍帝玉皇君。 灵风鼓橐钥，育物布元春。 云龙辔严驾，玉卫拥琼输。 枯萌泛沾及，大惠无不均。 万仙歌以道，委曲戒天人。 心根迷自固，拱跽戴洪仁。 白帝歌 六甲抱金阙，七政守灵坛。 流铃掷火化，威剑巨龙蟠。 邈彼素灵真，明宪孰敢干。 束制妖鬼魔，凛落霄风寒。 沴炁既已息，万天俄而安。 真俦荷大芘，抵颡相歌欢。 赤帝歌 太景开玉枢，洞堂启金除。 骞林荫瑶砌，丹鸾踏琼株。 宝房名曲丽，明珰神所居。 飞游豁云道，引目盻真都。 天日永不夕，重烟锁青庐。 太上敕印开，帕几罗简书。 黑帝歌 无质统有物，渊兮上帝心。 不启不发道，蕴妙化机深。 恐尔漏未尽，阴想忽浸淫。 轮转元涯波，苦道相迷寻。 万年常谨约，一旦自湮沈。 无冲落鬼境，殃谴不可任。 黄帝歌 万天拱中宸，控驾玉池根。 翘机贯亿历，洞朗辟四门。 大有混皇真，厌制星宿魂。 非帝道不运，有方赖之存。 威忿即霜秋，和豫为阳春。 生成握元纪，仰荷戴无垠。 青帝消魔赞 洞耀育元精，青华开大明。 布育九天炁，始生荐无英。 扶阳通摄御，丹林合总真。 积霄始晖上，郁迭明霞震。 灵光焕罗络，卫育保形魂。 混化合玄景，仁惠消魔群。 万徧道已超，功当奏上清。 赤帝消魔赞 三炁蔼灵阙，明虚焕玉丹。 朱陵有帝真，华云飞绛軿。 统御万界中，抚运超亿千。 执策按简箓，洞章敷神篇。 解结散祸根，流金摧凶奸。 志能成此道，魔试俱无前。 保度冥劫津，宴盻无穷年。 白帝消魔赞 西灵回七度，太眇郁明华。 白元维我神，皇真御景霞。 皎皎三素晖，昭昭破百邪。 摄音延至炁，金晶育三田。 炼结固玉质，宝曜映琼鲜。 魔精当灭试，逮地无沈连。 逸辔高清馆，齐轮太上仙。 黑帝消魔赞 北玄三秀蔼，太上紫皇居。 总炁摄幽栖，造化敷灵纲。 下统虚危精，宝育天元房。 灵通太妙神，缠罗卫百关。 豁落灭魔试，凶灾永不干。 大道保自然，寿命元亏残。 万劫享庆会，白日登云轮。 黄帝消魔赞 混化归冲妙，元皇总帝灵。 真老闭黄阙，四御齐玄钧。 圆华太张上，同携坚王君。 结津固百骸，琼耀拥胎仙。 晨晖注明景，魔应自灭形。 万道保无亏，返老回童婴。 五会合一炁，飞驭超云京。 龙汉始青玉历宝颂 九阳回妙炁，三景散元精。 碧霭浮灵篆，青林粲淑英。 超遥玉清府，辽邈蓬莱瀛。 真化通无间，神风滋万生。 赤明丹光玉历宝颂 浩劫开神运，龙文泛赤霞。 八威奔电激，九凤破凶邪。 炼度丹皇室，飞升元始家。 炎明常继照，灵庆集晨华。 上皇中灵玉历宝颂 混黄生一炁，感化结真形。 上德持柔顺，含光洞杳冥。 建中该九极，执本统三晨。 炜烨天端上，飞芒曜玉灵。 延康素灵玉历宝颂 皇老储灵粹，金精曜斗威。 六天咸馘灭，万宝复幽微。 爽炁浮高阙，寒光蔼素辉。 空同披玉勒，华丽九霄飞。 开皇玄上玉历宝颂 五炁符元妙，诸天混太冥。 辰精飞羽黑，玉女散华青。 紫策封天宝，玄光凛帝庭。 群魔钦至化，万国保安宁。 空洞灵章 飞玄紫炁凝灵根，纲维玉虚总万神。 空中郁勃结自然，上有棱层十二传。 玉楼峨峨耀景云，流精紫阙带金轩。 琼堂玮铄绕八骞，中有青金九灵仙。 丹皇真母号精延，飞青羽晨婴冠。",
      "translated_text": "The seasons of spring and autumn know no decay,\nThrough a thousand kalpas, endless distant years.\nThe Perfect Truth seeks nothing to attain,\nYet bears aloft the radiant immortal spirits.\n\n**Hymn to the Azure Emperor**\nEastward I gaze and bow again,\nTo the Azure Emperor, Jade Sovereign Lord.\nDivine winds stir the bellows and pipes,\nNurturing all things with primal spring’s spread.\nCloud-dragons harness the solemn chariot,\nJade guards escort the jasper wheels.\nWithered sprouts revive with dewy grace,\nGreat kindness flows without distinction.\nMyriad immortals chant the Dao’s song,\nIn winding counsel warning gods and men.\nThe root of the heart, deluded, clings fast—\nHands clasped, kneeling, we bear vast benevolence.\n\n**Hymn to the White Emperor**\nSix Jia spirits embrace the golden gates,\nSeven Governors guard the sacred altar.\nFlying bells cast forth fiery transformations,\nMighty swords coil with giant dragons.\nThat distant, pure, numinous Perfected—\nWho dares defy their luminous decree?\nThey bind and subdue demonic spirits,\nAs frigid winds howl through the celestial frost.\nOnce baleful qi is stilled,\nThe myriad heavens swiftly find peace.\nThe true companions bear great shelter,\nKowtowing, they chant in joyous praise.\n\n**Hymn to the Red Emperor**\nThe Grand Light opens the jade pivot,\nThe cavernous hall unfolds its golden steps.\nSoaring forests shade the jasper terraces,\nCrimson simurghs tread the jade trees.\nPrecious chambers, resplendent in winding beauty,\nLuminous pendants mark where gods reside.\nWandering freely through cloud-wrought paths,\nThe gaze lingers on the Perfected Capital.\nThe celestial sun knows no dusk,\nLayered mists veil the azure abode.\nThe Supreme Lord’s seal unfurls,\nSilk and bamboo bear the writ divine.\n\n**Hymn to the Black Emperor**\nWithout form, he governs all things,\nAbyssal—O heart of the Supreme Lord.\nThe Dao neither opens nor reveals,\nIts wondrous workings deep in mystery’s weave.\nLest your thoughts leak unfinished,\nDark musings suddenly spread and seep.\nThe wheel turns the boundless waves,\nBitter paths entangle and mislead.\nFor ten thousand years, ever vigilant,\nYet in a single day, self-drowned and lost.\nWithout equanimity, you fall to ghostly realms,\nCalamity’s reproach cannot be borne.\n\n**Hymn to the Yellow Emperor**\nThe myriad heavens bow to the Central Palace,\nReining chariots at the Jade Pool’s root.\nThe trigger mechanism spans countless eons,\nLuminous and vast, it opens the four gates.\nThe Great Possession blends with the August Perfected,\nSubduing the souls of stars and constellations.\nWithout the Emperor, the Dao does not turn—\nAll directions depend on his presence.\nWrath and fury bring frosty autumn,\nHarmony and joy make spring’s warmth.\nCreation and completion grasp the primal record,\nGazing upward, we bear boundless grace.\n\n**Azure Emperor’s Hymn of Demon-Quelling**\nLuminous brilliance nurtures primal essence,\nAzure splendor unfolds great clarity.\nIt spreads and fosters the qi of the Nine Heavens,\nGiving birth to the first offerings of Non-Brightness.\nSupporting yang, it governs and commands,\nCinnabar groves unite with the host of Perfected.\nAccumulated dawn’s radiance ascends,\nLush and layered, bright clouds quake.\nDivine light illumines the net of stars,\nGuarding and nurturing form and soul.\nBlended transformations merge with the mysterious scene,\nBenevolence and kindness dispel demonic hordes.\nTen thousand cycles—Dao transcends all,\nMerit complete, it ascends to Highest Clarity.\n\n**Red Emperor’s Hymn of Demon-Quelling**\nThree qi gather at the numinous gates,\nLuminous and void, they gleam with jade cinnabar.\nThe Crimson Mound holds the Emperor Perfected,\nVermilion clouds fly with crimson chariots.\nGoverning and guiding within the ten thousand realms,\nGuiding and surpassing countless eons.\nHolding the whip, consulting the sacred registers,\nProclaiming the cavernous scriptures, unfolding divine chapters.\nUntying knots, dispersing roots of misfortune,\nMolten gold shatters the wicked and treacherous.\nIf the will can perfect this Dao,\nDemonic trials all vanish before it.\nSafeguarding passage across the kalpa’s dark ford,\nGazing in bliss through endless years.\n\n**White Emperor’s Hymn of Demon-Quelling**\nThe Western Numinous turns the seven measures,\nVast and subtle, it gathers bright splendor.\nWhite Prime sustains my spirit,\nAugust Perfected steer the radiant clouds.\nLuminous, the Three Pure Lights,\nBrilliant, they shatter the hundred evils.\nDrawing in sound, extending the primal qi,\nGolden essence nurtures the Three Fields.\nRefining and congealing, they solidify jade substance,\nPrecious radiance gleams with jasper brilliance.\nDemon essences face annihilation’s trial,\nEven to the earth’s depths, none sink or linger.\nReins loosed in the high, pure halls,\nWheels aligned with the Supreme Immortals.\n\n**Black Emperor’s Hymn of Demon-Quelling**\nNorthern Mystery’s three blossoms flourish,\nThe Supreme Lord’s Purple Emperor resides.\nGathering qi, it governs the hidden dwellings,\nCreation unfolds the numinous net.\nBelow, it commands the Void and Danger’s essence,\nPrecious nurturing in the Heavenly Origin’s chamber.\nSpirit connects with the wondrously subtle,\nWrapping and guarding the hundred passes.\nVast and open, it destroys demonic trials,\nOminous disasters never dare approach.\nThe Great Dao preserves the natural,\nLifespan knows no loss or harm.\nThrough ten thousand kalpas, joyous assemblies,\nIn daylight, they ascend the cloud-wheels.\n\n**Yellow Emperor’s Hymn of Demon-Quelling**\nBlended transformations return to profound subtlety,\nThe Primal August unites the Emperor’s spirit.\nThe True Elder seals the Yellow Gates,\nThe Four Governors align with the mysterious balance.\nCircular splendor soars above the Great Spread,\nTogether they bear the steadfast King Perfected.\nBinding the ford, they secure the hundred bones,\nJasper radiance enfolds the embryonic immortals.\nMorning brilliance pours into luminous scenes,\nDemons respond by self-annihilating form.\nTen thousand Dao safeguard without loss,\nReturning old age to youthful infancy.\nFive assemblies merge into one qi,\nFlying chariots transcend the Cloud Capital.\n\n**Eulogy of the Dragon Han’s Beginning Azure Jade Calendar**\nNine yangs return the wondrous qi,\nThree lights scatter the primal essence.\nEmerald mists float the numinous script,\nAzure groves gleam with pure blossoms.\nTranscendent, they reach the Jade Clarity’s palace,\nVast and distant, Penglai’s isles.\nTrue transformations flow without pause,\nDivine winds nourish the myriad lives.\n\n**Eulogy of the Crimson Brightness’ Cinnabar Light Jade Calendar**\nVast kalpas open divine destiny,\nDragon scripts float on crimson clouds.\nEight Mighties surge like lightning,\nNine phoenixes shatter the inauspicious.\nRefining and transcending the Cinnabar Emperor’s chamber,\nAscending to the Primordial Beginning’s home.\nFiery brightness ever continues its illumination,\nNuminous blessings gather in morning’s splendor.\n\n**Eulogy of the Supreme August’s Central Numinous Jade Calendar**\nPrimal Yellow generates one qi,\nStirred and transformed, it congeals true form.\nSupreme virtue upholds gentleness and compliance,\nEmbracing light, it penetrates the distant and obscure.\nEstablishing the center, it encompasses the Nine Poles,\nGrasping the root, it governs the Three Dawns.\nResplendent at heaven’s apex,\nFlying rays illuminate the jade numen.\n\n**Eulogy of the Extending Prosperity’s Pure Numinous Jade Calendar**\nThe August Elder stores numinous purity,\nGolden essence gleams with the Dipper’s might.\nThe Six Heavens are all beheaded and destroyed,\nThe ten thousand treasures return to hidden subtlety.\nBracing qi floats above the lofty gates,\nCold light gathers in pure radiance.\nEmpty Unity dons the jade bridle,\nSplendid, it soars through the Nine Empyreans.\n\n**Eulogy of the Opening August’s Mysterious Supreme Jade Calendar**\nFive qi accord with the primal mystery,\nAll heavens blend with the Great Obscurity.\nCelestial essence flies with feathered darkness,\nJade maidens scatter azure blossoms.\nPurple writs seal the heavenly treasures,\nMysterious light chills the imperial court.\nAll demons revere the supreme transformation,\nThe myriad lands preserve peace and tranquility.\n\n**Celestial Luminous Chapter**\nFlying mystery, purple qi congeals the numinous root,\nThe net of Jade Clarity governs the myriad gods.\nIn the void, seething and surging, it forms naturally,\nAbove, tiered layers transmit the twelve transmissions.\nJasper towers, towering, shine with radiant clouds,\nFlowing essence, purple gates gird the golden chariots.\nJewel halls, resplendent, encircle the eight soaring ones,\nWithin dwell the Nine Numinous Immortals of azure gold.\nThe Cinnabar August True Mother is named Essence-Extending,\nFlying azure feathers crown the morning’s infant sovereign.",
      "overlap_context": "ind.\nRosy ponds gird the divine precincts,\nA thousand ages like a single dawn.\nJewel-like, magnificent in the morning,\nNine distances transcend the non-smoke.\nLeftward, summoning Non-Brightness,\nRightward, bowing to White Prime.\nDivine light mounts the mysterious primes,\nYellow and Old Lord bends over the mushroom fields.\nAuspicious light harnesses the flying chariot,\nPlaying and controlling the flowing chariots.\nHigh August One visits Purple Tenuity,\nVast and bright, roaming the myriad heavens.",
      "start_char": 2496,
      "end_char": 3801,
      "start_sentence": 191,
      "end_sentence": 298,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 50.563475131988525,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\赞颂类\\三洞赞颂灵章.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "手执玉节握灵旛，五色命魔对帝尊。 把持符籍当生门，咀日嚼月噏醴泉。 离罗吐辉炼五魂，内充外溢绛府欣。 金光焕焕形正圆，从朔入金色浑沦。 唯有开明晓此言，日五月十朝北元。 刻见华盖领仙君，紫炁左回与斗连。 历度四七入金门，正是丹皇校万仙。 有明此诀加精勤，秘念密思每令分。 妙景感会得要文，三年当审保长存。 九年乘空驾羽裙，凤衣轻翔升龙山。 俯仰九灵谒玉晨，得为灵宝大真人。 东方玉晨君赞 森廓连华阙，神尊帝一真。 灵虚交日月，玄觉照冥津。 玉关回运数，梵炁启都明。 麾旛扬洞唱，天君秉化轮。 金华领仙箓，郁带龙山宫。 宝秀焕珍景，宴戏高上墉。 霏烟散妙霭，陶精养我形。 飞天观劫会，赞咏元始文。 太极建青钥，晨辉布发生。 爽耀应穹观，熙怡存玉婴。 皇育旋景舆，升度七祖魂。 弥范流飞纲，周维天地根。 祥霞翳霄仞，紫馆真人君。 轩弈清玄府，灭试推邪凶。 道应混高元，神结泥丸精。 灵丘三素云，罗耀交琳峰。 七九齐至用，三五合同功。 并协冲和德，变炼超仙宗。 南方玉晨君赞 和阳焕明弈，炎晖玉炼颜。 虚梵隐玄邈，空朗昭神功。 九华破幽录，四极延生津。 黄房晨景居，绵绵保长存。 窈窕腾月妃，万界超劫轮。 混洞翳玉书，龙汉明耀晶。 神文摄六天，察制妖魔群。 邪试莫我干，列名标上清。 超度五苦难，逍遥玄仞峰。 飞神开大运，明观九云重。 南上炼我魂，旋盖游骞林。 泛霭缠虚纲，十转回天关。 大魔咸来宾，入景朝紫微。 龙渊注东井，黄华养我真。 大罗无色光，寂度元穷人。 朱灵协至炁，太和升福堂。 玄台映郁萧，诵洞遵西灵。 神公布玄范，反婴齐自然。 西方玉晨君赞 洞神映霄阙，受度好生君。 灵童火炼攻，福馆涉生津。 太漠明道彰，真人翔景云。 高清布元化，荡秽除妖氛。 接我琅碧舆，升入微妙门。 扬辉浩极家，洞耀九玄真。 造化回幽关，杳眇固灵根。 景皇连郁秀，检校超仙魂。 萧仞白元子，洞携列帝宾。 始皇天中王，寂寂虚元庭。 玉晨张大范，流庆涤我尘。 穹楼演洞唱，收魔束鬼形。 三元分化祖，九度悉宣陈。 阿丘驰素斩，那邪契所绿。 弥罗大圣神，更生升福筵。 逸化乘运归，削死永合欢。 琼府巍峨境，森扶霭华骞。 云牙揖三晖，享此亿遐年。 北方玉晨君赞 开化无上神，霄度凝玄炁。 阳华真一精，太和育妙慧。 九灵镇西昆，机化停枢会。 凤车升羽轮，越此大劫津。 云阿拥圆皓，育生天神君。 受符羽林宫，蔼秀灵霞襟。 空霄飞玄章，接举身超腾。 天统摄八耀，开度九幽魂。 兰宫连紫微，按格升朱陵。 南宫有妙童，琅辉炼我形。 苍霞浮绿辇，称庆拱高尊。 灵风泛洞响，可宝无穷龄。 九仙颁运箓，释散宿业根。 流纲抗虚梵，廓达归无名。 大混百骸纪，徊烟合紫云。 庆垂七叶孙，祸塞三徒源。 解带离尘网，齐辔逍遥宾。 倏忽登龙台，稽首玉帝前。 三洞赞颂灵章卷上竟 三洞赞颂灵章卷中 应用赞颂 七真赞",
      "translated_text": "Holding jade tablets and grasping numinous banners,\nFive-colored spirits command demons before the imperial honor.\nGrasping talismanic registers at the Gate of Life,\nChewing the sun and moon, sipping from the sweet spring.\nThe Net of Li radiates brilliance to refine the five souls,\nInternally replete and externally overflowing, the Crimson Palace rejoices.\nGolden light shines resplendently, form perfectly round,\nFrom the new moon entering metal, colors merge in primordial chaos.\nOnly the Enlightened One understands these words,\nOn the fifth day of the sun and tenth of the moon, facing the Northern Origin.\nAt once beholding the flowery canopy leading the immortal lords,\nPurple qi swirls leftward, linking with the Dipper.\nPassing through the four sevens into the Golden Gate,\nJust as the Cinnabar August One reviews the myriad immortals.\nThose who clearly grasp this secret with diligent effort,\nSecretly recite and silently ponder, ever mindful of its divisions.\nMarvelous visions respond to the essential text,\nAfter three years, one may securely preserve long life.\nAfter nine years, riding the void in feathered skirts,\nPhoenix robes lightly soaring to ascend Dragon Mountain.\nGazing up and down at the Nine Numinous Ones to pay homage to the Jade Dawn,\nOne becomes a Great Perfected of the Numinous Treasure.\n\n**Hymn to the Jade Dawn Lord of the East**\nVast and boundless, linked to the flowery gates,\nDivine honor, true unity of the imperial One.\nNuminous void intermingles with sun and moon,\nMysterious awakening illuminates the dark ford.\nJade Pass revolves the reckoning of fate,\nBrahmic qi initiates the capital’s radiance.\nBanners wave, intoning cavernous chants,\nHeavenly lords wield the wheel of transformation.\nGolden splendor leads the immortal registers,\nFragrant sashes gird the Dragon Mountain Palace.\nPrecious effulgences gleam with wondrous light,\nFeasting and reveling in the loftiest walls.\nMisty vapors scatter marvelous mists,\nRefining essence to nurture my form.\nFlying immortals observe the kalpa’s assembly,\nChanting the primordial scriptures of the Origin.\nThe Supreme Ultimate establishes the azure key,\nMorning radiance spreads forth generation.\nLuminous brilliance responds to the vaulted observance,\nJoyful harmony preserves the Jade Infant.\nImperial nurturance revolves the chariot of light,\nAscending the seven ancestral souls.\nExtending the net of flying principles,\nEncompassing the roots of heaven and earth.\nAuspicious clouds veil the towering skies,\nPurple abodes of the Perfected Lords.\nLofty and serene, the Pure Mystery Palace,\nEradicating trials and expelling evil and misfortune.\nThe Dao responds to the primordial vastness,\nSpirit congeals in the Niwan Palace’s essence.\nThe numinous mound’s threefold white clouds,\nInterwoven radiance crisscrosses the jade peaks.\nSeven nines unite in application,\nThree fives combine in shared merit.\nTogether harmonizing the virtue of central harmony,\nTransforming and refining to transcend the immortal lineage.\n\n**Hymn to the Jade Dawn Lord of the South**\nRadiant harmony shines with luminous brilliance,\nFiery splendor refines the jade countenance.\nEmpty Brahma veils the distant mystery,\nVast clarity reveals divine merit.\nNinefold splendor shatters the dark records,\nFour poles extend the springs of life.\nThe Yellow Chamber abides in morning light,\nEndlessly preserving long life.\nGraceful and remote, the moon’s consort ascends,\nMyriad realms transcend the kalpa’s wheel.\nChaotic profundity veils the jade scriptures,\nDragon Han shines with crystalline clarity.\nDivine texts command the Six Heavens,\nScrutinizing and restraining demonic hordes.\nEvil trials dare not approach me,\nNames inscribed in the Highest Clarity.\nTranscending the five sufferings,\nCarefree upon the Mystery’s towering peak.\nFlying spirits open the great destiny,\nBeholding the ninefold layers of clouds.\nRefining my soul in the southern ascent,\nRevolving canopies roam the soaring groves.\nMisty vapors entwine the void’s net,\nTenfold revolutions return through Heaven’s Pass.\nGreat demons all come as guests,\nEntering the light to pay homage to the Purple Tenuity.\nDragon Abyss pours into the Eastern Well,\nYellow splendor nurtures my true self.\nThe Great Net’s colorless light,\nSilently transcends those of boundless origin.\nVermilion spirits harmonize the supreme qi,\nGrand harmony ascends the Hall of Blessings.\nMystic terrace reflects lush verdure,\nReciting cavernous scriptures, following the Western Numinous.\nDivine lords spread the mysterious model,\nReturning to infancy, equal to nature.\n\n**Hymn to the Jade Dawn Lord of the West**\nCavernous spirits mirror the towering gates,\nReceiving the decree, Lord of Good Life.\nNuminous youths refine through fire’s trial,\nFortune’s halls traverse the springs of life.\nThe Great Desert clarifies the Dao’s manifestation,\nPerfected ones soar upon radiant clouds.\nLofty clarity spreads the primordial transformation,\nSweeping away filth and dispelling demonic vapors.\nReceiving my jade-green chariot,\nAscending into the Gate of Subtle Mystery.\nRadiance raised in the vast and boundless home,\nIlluminating the Ninefold Mystery’s Perfected.\nCreation revolves the dark passes,\nProfoundly establishing the numinous root.\nThe Radiant August connects lush splendor,\nReviewing and transcending immortal souls.\nTowering peaks of the White Prime Youth,\nCavernously accompanying the imperial guests.\nThe Origin’s King within Heaven’s midst,\nSilent and still, the Void’s Primordial Court.\nThe Jade Dawn extends the great model,\nFlowing blessings to cleanse my dust.\nVaulted towers intone cavernous chants,\nBinding demons and restraining ghostly forms.\nThree Origins divide the ancestral transformations,\nNine degrees all proclaimed and arrayed.\nWhite Slayer gallops through the Aligned Mounds,\nEvil contracts with the verdant covenant.\nThe Great Saint of the Miro Net,\nReborn to ascend the banquet of blessings.\nUnfettered transformation rides destiny’s return,\nErasing death to forever unite in joy.\nJewel palaces in towering realms,\nForested supports of misty flowery soarings.\nCloudy teeth receive the threefold brilliance,\nPartaking of these boundless, distant years.\n\n**Hymn to the Jade Dawn Lord of the North**\nInitiating transformation, supreme spirit,\nCelestial ascent congeals the mysterious qi.\nYang’s splendor, true unity’s essence,\nGrand harmony nurtures wondrous wisdom.\nNine Numinous guard the Western Kunlun,\nMechanisms of transformation pause at the pivotal assembly.\nPhoenix chariots ascend feathered wheels,\nSurpassing the great kalpa’s ford.\nCloudy banks embrace the round and luminous,\nNurturing the Celestial Lord of Life.\nReceiving talismans at the Feathered Forest Palace,\nFragrant splendor girds the numinous cloud’s lapels.\nEmpty skies fly the mysterious chapters,\nLifting and raising the body to transcendence.\nHeavenly governance commands the Eight Radiant Ones,\nOpening the path for the Nine Dark Souls.\nOrchid Palace links with the Purple Tenuity,\nFollowing the pattern to ascend Vermilion Mound.\nThe Southern Palace holds wondrous youths,\nJade radiance refines my form.\nAzure clouds float upon the green chariot,\nCelebrating and revering the lofty honor.\nNuminous winds ripple through cavernous echoes,\nPrecious and boundless, the ageless years.\nNine immortals bestow the registers of destiny,\nReleasing and dispersing the roots of past karma.\nFlying principles resist the empty Brahma,\nExpansively attaining the nameless return.\nThe Great Chaos records the hundred bones,\nLingering mists merge with purple clouds.\nBlessings descend to seven generations of descendants,\nMisfortunes block the threefold sources of calamity.\nUntying the sash to depart the dusty net,\nEqual reins join the carefree guests.\nIn an instant, ascending the Dragon Terrace,\nBowing before the Jade Emperor.\n\n**End of the First Scroll of Hymns and Eulogies of the Three Caverns**\n**Second Scroll of Hymns and Eulogies of the Three Caverns**\n**Applied Eulogies**\n**Hymn to the Seven Perfected**",
      "overlap_context": "e net of Jade Clarity governs the myriad gods.\nIn the void, seething and surging, it forms naturally,\nAbove, tiered layers transmit the twelve transmissions.\nJasper towers, towering, shine with radiant clouds,\nFlowing essence, purple gates gird the golden chariots.\nJewel halls, resplendent, encircle the eight soaring ones,\nWithin dwell the Nine Numinous Immortals of azure gold.\nThe Cinnabar August True Mother is named Essence-Extending,\nFlying azure feathers crown the morning’s infant sovereign.",
      "start_char": 3801,
      "end_char": 4926,
      "start_sentence": 299,
      "end_sentence": 389,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.479756593704224,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\赞颂类\\三洞赞颂灵章.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "太上玄虚宗，弘道尊其经。 俯仰已得仙，历劫无数龄。 巍巍大圣德，寂寂因无生。 霄景结空构，乘虚自然征。 日月为炳灼，安和乐未央。 学仙绝华念，念念相因积。 去来乱我神，神躁靡不历。 灭念停虚间，萧萧入空寂。 请经若饥渴，持志如金石。 保子飞仙路，五灵度符籍。 济我六度行，故能解三罗。 清斋礼太素，吐纳养云芽。 逍遥金阙内，玉京为余家。 自然生七宝，人人坐莲花。 仰嚼玄都柰，俯酣空洞瓜。 灵颜耀朱日，奚计年劫多。 法鼓会群仙，呜钟征大魔。 灵风扇奇花，灿烂开繁襟。 天真抚云璈，众真弹灵琴。 雅歌三天景，散慧玉华林。 七祖升福堂，由此步玄音。 前世福未足，斯书邈难寻。 信道情不尽，图飞乃返沈。 太上无为道，弘之在兆心。 学道由丹信，奉师如至亲。 挹景伴清辉，孜孜随日新。 众人不得度，中不度我身。 大愿有重报，玄德必信然。 阴德罪至深，对来若转轮。 学道亦甚苦，晨夜建福田。 种福由植树，积篑而成山。 子能耽玄尚，飘尔升清天。 修尔无为道，当为结大绿。 太上至隐书，名为智慧篇。 拔苦由人材，超俗以得真。 灵姿世不奇，时若渊中莲。 人行各有本，皆由宿世功。 立德务及时，发愿莫不从。 善恶俱待对，倚伏理难穷。 贤士奉法言，道亦在兼忘。 解是大智慧，上为太极翁。 宝盖连玉佩，命驾御九龙。 金华擎洞经，捧香恋仙童。 啸歌彻玄都，呜玉扣琼锺。 竦身凌太清，超景逸云霄。 保扶持法言，游玄极逍遥。 万劫犹昨夜，千秋如晨朝。 巍峨荫云华，手攀宝林条。 香烟自然生，玄阶莫扶摇。 灵旛应时散，繁想应时消。 灭智弘大混，无为为清谣。 启坛颂 渺渺空无象，悠悠感至灵。 敬则承天贶，泄则被魔精。 吉凶随运转，否泰应缘生。 道不贵珠玉，神惟感至诚。 丹情尽勤苦，恳祷竭玄情。 自然通大道，皆得降真灵。 捻香陈所愿，稽首冀嘉祯。 天尊常湛寂，回心礼杳冥。 解坛颂 太空包有象，至道窈无形。 承和通妙炁，感应达衷情。 倏忽周八极，依稀降万灵。 微杳陈素捆，委质表丹诚。 远泛翔鸾盖，遐攀绮凤旌。 烟宫高郁郁，霞阁上停停。 琼驾出霄汉，金龙入太清。 甘露降人世，景福被幽冥。 请玄师颂 科律严章奏，精诚享百神。 投词陈悃愿，洁醮答高旻。 俯盻垂云驾，冥心启上真。 玄师都教主，奉请降凡尘。 请天师颂 太上传符箓，初因过鹤呜。 积功超玉简，列位侍三清。 接引章词奏，克随凡庶情。 修斋当奉请，愿俯鉴精诚。 请监斋颂 宝号留尘世，仙阶列上清。 三千功已满，八百行先成。 礼忏修真福，监斋作证明。 今霄云驭降，祥祉被含生。 请天官颂 妙道垂真教，修斋立福田。 结坛朝上圣，建醮会高仙。 注念通霄极，精神感上玄。 天官乘宝辇，彩仗下凡筵。 请地官颂 翼翼陈丹悃，竞竞仰紫虚。 祈通尘下志，愿达土皇君。 潜应垂真佑，遐临赦罪书。 地官来下降，俄拥五云舆。 请水官颂 方便开真化，慈悲立圣科。 虚心修妙会，调炁咏灵歌，默念祈渊府，丹诚通大罗。 水官龙驾降，云锦起沧波。 请五帝颂 五帝居仙品，紏弹善恶因。 祥光临宇宙，惠泽济沈沦。 发露祈真佑，冥心感圣贤。 存亡俱快乐，享福永无垠。 请经师颂 入靖修黄箓，严装启上仙。 奏章先达御，词款欲关宣。",
      "translated_text": "The Supreme Most Transcendent and Mysterious School,\nExpounds the Dao and reveres its scriptures.\nWith a single bow and glance, one attains immortality,\nThrough countless kalpas, ageless years endure.\nMajestic is the Great Sage’s virtue,\nSilent and still, rooted in non-being.\nCelestial radiance weaves empty structures,\nRiding the void in natural ascent.\nSun and moon blaze with brilliance,\nPeace and harmony bring endless joy.\nTo learn immortality, sever worldly desires,\nEach thought accumulates in succession.\nComing and going disturb my spirit,\nRestless, it traverses all without cease.\nExtinguish thoughts within the void,\nWhispering into silent emptiness.\nSeek the scriptures as if parched with thirst,\nHold resolve firm as metal and stone.\nPreserve the path to flying immortality,\nThe Five Numinous Ones bestow registers of passage.\nFulfill my Six Perfections,\nThus dissolving the Three Nets.\nIn purity, worship the Primal Simplicity,\nExhale and inhale to nurture the cloud-sprout.\nCarefree within the Golden Gates,\nJade Capital becomes my home.\nNaturally, the Seven Treasures arise,\nEach person seated upon a lotus.\nGazing up, I chew the immortal fruits of Xuandu,\nBending down, I savor the hollow melons of the void.\nDivine countenance shines like the crimson sun,\nWhy reckon the multitude of kalpas?\nThe dharma drum summons the assembly of immortals,\nThe tolling bell subdues the great demons.\nA sacred breeze fans wondrous blossoms,\nResplendent, unfurling rich robes.\nHeavenly Perfected strum the cloud zither,\nAll Perfected pluck the numinous harp.\nElegant songs of the Three Heavens’ radiance,\nScatter wisdom through the Jade Flower Grove.\nSeven generations of ancestors ascend to the Hall of Blessings,\nHenceforth treading the mysterious tones.\nIf past-life blessings were insufficient,\nThis scripture remains distant and hard to find.\nSincerity in the Dao knows no end,\nYet those who plot flight may sink again.\nThe Supreme Dao of Non-Action,\nIts vastness resides in the hearts of all.\nTo learn the Dao, trust in the cinnabar faith,\nRevere your master as your closest kin.\nDraw in the radiance to accompany pure splendor,\nDiligently renewing with each passing day.\nThough the multitudes may not attain deliverance,\nNeither shall I be left undelivered.\nGreat vows demand profound recompense,\nMysterious virtue must surely be true.\nHidden virtue’s transgressions run deep,\nConfronting them turns the wheel anew.\nTo learn the Dao is also most arduous,\nDay and night, cultivate the field of blessings.\nPlanting blessings is like planting trees,\nHeaped baskets form a mountain.\nIf you can immerse yourself in the mysterious and exalted,\nYou shall soar to the Pure Heavens.\nCultivate the Dao of Non-Action,\nAnd you shall bind the great covenant.\nThe Supreme’s most recondite scripture,\nIs called the *Chapter of Wisdom*.\nTo relieve suffering depends on one’s capacity,\nTranscending the mundane to attain the Real.\nA numinous countenance is no marvel in this world,\nLike a lotus in the depths of an abyss.\nEach person’s conduct has its root,\nAll stemming from past-life merit.\nEstablish virtue while the time is ripe,\nMake vows, and none shall go unanswered.\nGood and evil both await their retribution,\nThe principle of rise and fall is unfathomable.\nThe worthy uphold the Dharma’s words,\nYet the Dao also lies in forgetting both.\nTo comprehend this is great wisdom,\nAscending to become the Venerable of the Supreme Ultimate.\nJewel canopies linked with jade pendants,\nCommanding chariots drawn by nine dragons.\nGolden blossoms hold the Cavern Scriptures,\nOffering incense, cherishing the immortal youths.\nWhistling songs resound through Xuandu,\nStriking jade to chime the jeweled bells.\nRising to soar through the Great Clarity,\nTranscending radiance, roaming the cloudy skies.\nUpholding the Dharma’s words,\nWandering the mysterious ultimate in freedom.\nTen thousand kalpas are but last night,\nA thousand autumns like the morning dawn.\nTowering, shading the cloudy blossoms,\nHand grasping the branches of the Treasure Grove.\nIncense smoke arises naturally,\nThe mysterious steps need no ascent.\nSacred banners disperse in due time,\nProliferating thoughts dissolve in their season.\nExtinguish wisdom to expand the Great Chaos,\nNon-Action becomes the pure hymn.\n\n**Opening the Altar Hymn**\nVast and formless, the empty void,\nEndless, moved by the utmost numen.\nReverence invokes Heaven’s favor,\nNeglect invites demonic intrusion.\nFortune and misfortune turn with fate,\nAdversity and prosperity arise from conditions.\nThe Dao does not prize pearls or jade,\nThe spirits respond only to utmost sincerity.\nRedoubling devotion with diligence,\nPraying earnestly with profound feeling.\nNaturally, the Great Dao is attained,\nAll receive the descent of true numina.\nPinching incense to state my wishes,\nBowing my head, I hope for auspicious blessings.\nThe Heavenly Worthy ever abides in serene stillness,\nTurning my heart, I worship the distant and obscure.\n\n**Closing the Altar Hymn**\nThe great void encompasses all forms,\nThe utmost Dao is subtle and formless.\nHarmonizing with the wondrous qi,\nResonance reaches the depths of feeling.\nIn an instant, pervading the eight directions,\nVaguely, the myriad numina descend.\nHumbly presenting plain offerings,\nSubmitting my being to express sincere devotion.\nFar and wide, the phoenix canopy soars,\nFrom afar, grasping the brocade banner of the simurgh.\nThe misty palace stands lofty and lush,\nThe rosy pavilion rests high and still.\nThe jade chariot emerges from the celestial river,\nThe golden dragon enters the Great Clarity.\nSweet dew descends upon the mortal world,\nAuspicious blessings reach the hidden and obscure.\n\n**Hymn to Invoke the Mysterious Master**\nThe liturgy’s strictures are solemnly observed,\nSincerity is offered to the hundred spirits.\nPresenting words to express earnest wishes,\nA pure offering answers the lofty heavens.\nGazing down, the cloud chariot descends,\nWith a tranquil heart, I summon the Supreme Perfected.\nThe Mysterious Master, Lord of All Teachings,\nI humbly request your descent to the mortal realm.\n\n**Hymn to Invoke the Heavenly Master**\nThe Supreme Most transmitted the registers,\nInitially at Crane’s Cry Mountain.\nAccumulated merit surpassed the jade tablets,\nRanked to attend the Three Clarities.\nPresenting the scripture of guidance,\nFulfilling the sentiments of common folk.\nWhen performing the purification rite, I shall make this invocation,\nHoping you will deign to witness my sincerity.\n\n**Hymn to Invoke the Inspector of Purifications**\nYour sacred name remains in the mortal world,\nYour immortal rank is listed in the Upper Clarity.\nThree thousand merits are already complete,\nEight hundred deeds were accomplished first.\nRitual repentance cultivates true blessings,\nOverseeing the purification as witness.\nTonight, the cloud chariot descends,\nAuspicious blessings bestowed upon all beings.\n\n**Hymn to Invoke the Heavenly Officials**\nThe wondrous Dao imparts true teachings,\nPerforming purifications to establish fields of blessings.\nErecting the altar to worship the Supreme Sages,\nConvening the lofty immortals in grand offering.\nConcentrated thoughts reach the celestial extremes,\nSpirit and essence move the Supreme Mystery.\nThe Heavenly Officials ride jeweled chariots,\nTheir colorful retinues descend to the mortal feast.\n\n**Hymn to Invoke the Earthly Officials**\nReverently presenting sincere devotion,\nEarnestly gazing toward the Purple Void.\nPraying to convey the aspirations of the mortal realm,\nWishing to reach the Earth Sovereign.\nIn hidden response, bestowing true protection,\nFrom afar, descending with the register of pardoned sins.\nThe Earthly Officials arrive in descent,\nSwiftly surrounded by five-cloud chariots.\n\n**Hymn to Invoke the Water Officials**\nWith expedient means, unfolding true transformation,\nCompassionately establishing sacred rites.\nWith an empty heart, cultivate the wondrous assembly,\nHarmonizing qi, chanting numinous songs.\nSilently praying to the abyssal court,\nSincere devotion reaches the Great Net.\nThe Water Officials descend with dragon chariots,\nCloud brocade rising from the azure waves.\n\n**Hymn to Invoke the Five Emperors**\nThe Five Emperors dwell among the immortals,\nRectifying the causes of good and evil.\nAuspicious light illumines the cosmos,\nBenevolent grace rescues the sunken.\nRevealing faults to pray for true protection,\nWith a tranquil heart, moved by the sages.\nBoth the living and the dead attain joy,\nEnjoying blessings without end.\n\n**Hymn to Invoke the Scripture Master**\nEntering the retreat to cultivate the Yellow Register,\nSolemnly adorned to summon the Supreme Immortals.\nPresenting the memorial first to the throne,\nWords of sincerity await proclamation.",
      "overlap_context": " bones,\nLingering mists merge with purple clouds.\nBlessings descend to seven generations of descendants,\nMisfortunes block the threefold sources of calamity.\nUntying the sash to depart the dusty net,\nEqual reins join the carefree guests.\nIn an instant, ascending the Dragon Terrace,\nBowing before the Jade Emperor.\n\n**End of the First Scroll of Hymns and Eulogies of the Three Caverns**\n**Second Scroll of Hymns and Eulogies of the Three Caverns**\n**Applied Eulogies**\n**Hymn to the Seven Perfected**",
      "start_char": 4926,
      "end_char": 6211,
      "start_sentence": 390,
      "end_sentence": 495,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.083306074142456,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\赞颂类\\三洞赞颂灵章.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "宝箓因师度，威仪太上传。 经师求下降，奏请列群仙。 请籍师颂 肃肃祈清福，诜诜结宝斋。 登坛须此夜，行道续徘徊。 有愿仍虽启，皈心道眼开。 籍师来下降，仙仗下瑶台。 请度师颂 经戒丹心祷，虔诚召百神。 捻香祈至圣，持戒请仙真。 清咏凌朝启，精思入夜勤。 度师来下降，保护结斋人。 送玄师颂 上帝命真仙，修斋黄箓坛。 诸天来下降，焚香忏罪愆。 祈恩行道毕，斋事已周圆。 洪福留人世，玄师上九天。 送天师颂 斋福已精严，表牒上九天。 至诚通感应，阖门得延生。 掌籍诸天卫，章词达御前。 祖宗感升度，嗣胤庆荣迁。 三天扶教主，事毕奏功圆。 送监斋颂 灵坛崇法席，允赖下监临。 紏过兼书善，真仙亦仰钦。 行当驱道骑，缥缈五云深。 生存当有赖，更复济幽沈。 送天官颂 妙范修斋直，明科洗罪根。 瞻穹崇上善，沥恳致微言。 既纳依投靖，蒙垂覃宥恩。 天官还玉府，宝驾入金门。 送地官颂 浮会朝元罢，三涂结果因。 真恩宣五岳，诚悃奏三天。 撒席停宗范，解坛送列仙。 地官回岳府，高涉五云軿。 送水官颂 宣演灵音毕，诸仙返上穹。 灵光降横厄，甘露降真风。 复命骊龙驾，遥还太宝宫。 水官归洞府，福禄赐无穷。 送五帝颂 仙仗来霄极，尊临列五方。 检氛吹羽节，鸾辂驻清场。 斋事将圆撤，回舆返上苍。 流恩无不遍，岂但感馨香。 送经师颂 经法虽微妙，崇奉悉因师。 凡有立善者，咸得频礼之。 气运功易就，心慢悔难追。 若能勤系念，朝夕自仙飞。 送籍师颂 道以斋为重，法以朝为常。 不修不奉者，安能达帝乡。 有骨入仙品，自然开紫房。 玄武排灵驾，但见金殿堂。 送度师颂 迢迢玉京山，玄都何巍巍。 朗朗长夜开，真人乘步虚。 大道由人弘，心至神自归。 修斋行道毕，稽首辞三师。 明灯颂 正一阳光，炎上朱烟。",
      "translated_text": "**Hymn to Invoke the Register Master**\nWith solemn reverence, we pray for pure blessings,\nIn orderly ranks, we form the precious retreat.\nTonight we ascend the altar,\nWalking the Dao in ceaseless procession.\nThough wishes are already made manifest,\nThe eye of the Dao opens to those who turn their hearts.\nThe Register Master descends,\nHis immortal retinue alighting from the Jasper Terrace.\n\n**Hymn to Invoke the Ordination Master**\nWith scriptures and precepts, we pray with a cinnabar heart,\nIn utmost sincerity, we summon the hundred spirits.\nHolding incense, we entreat the Perfected Sages,\nUpholding precepts, we invoke the Immortal Perfected.\nPure chants rise at dawn’s first light,\nDiligent meditation persists into the night.\nThe Ordination Master descends,\nTo protect and bless those who keep the retreat.\n\n**Hymn to Send Forth the Mystic Master**\nThe Celestial Thearch commands the Perfected Immortals,\nTo cultivate the retreat at the Yellow Register altar.\nThe hosts of heaven descend,\nAs incense is burned to repent transgressions.\nHaving prayed for grace and completed the ritual,\nThe retreat’s affairs are now fulfilled.\nVast fortune remains in the mortal realm,\nWhile the Mystic Master ascends to the Nine Heavens.\n\n**Hymn to Send Forth the Celestial Master**\nThe retreat’s blessings are now perfected,\nThe memorial ascends to the Nine Heavens.\nUtmost sincerity evokes response,\nThe entire household attains longevity.\nThe Register-Keepers of the heavens stand guard,\nThe memorial’s words reach the Celestial Throne.\nAncestors are uplifted and delivered,\nDescendants rejoice in honor and promotion.\nThe Three Heavens’ Protector of the Teachings,\nHaving completed the rites, reports the accomplishment.\n\n**Hymn to Send Forth the Retreat Overseer**\nThe numinous altar upholds the Dharma seat,\nReliant on the Overseer’s descent to supervise.\nCorrecting faults while recording good deeds,\nEven the Perfected Immortals revere and admire.\nSoon the Daoist cavalcade will depart,\nVanishing into the depths of the five-colored clouds.\nThe living shall find support,\nAnd the departed shall be delivered from darkness.\n\n**Hymn to Send Forth the Heavenly Official**\nWith wondrous discipline, the retreat is conducted,\nThe luminous precepts wash away the roots of sin.\nGazing upward, we revere the supreme good,\nPouring forth earnest words in humble supplication.\nHaving submitted to the retreat’s refuge,\nWe are graced with boundless pardon and favor.\nThe Heavenly Official returns to the Jade Palace,\nHis precious chariot entering the Golden Gate.\n\n**Hymn to Send Forth the Earthly Official**\nThe floating assembly concludes its audience with the Origin,\nThe Three Paths bear their karmic fruits.\nTrue grace is proclaimed across the Five Peaks,\nSincere devotion is presented to the Three Heavens.\nThe ritual mat is rolled, the ancestral rites ended,\nThe altar is dismantled, the host of immortals sent forth.\nThe Earthly Official returns to his mountain abode,\nAscending high in his five-cloud chariot.\n\n**Hymn to Send Forth the Water Official**\nThe proclamation of the numinous sounds is complete,\nThe immortals return to the upper heavens.\nSpiritual light dispels calamities,\nSweet dew descends with the true wind.\nThe Black Dragon Chariot receives its mandate,\nReturning afar to the Supreme Treasure Palace.\nThe Water Official retires to his grotto palace,\nBestowing boundless fortune and prosperity.\n\n**Hymn to Send Forth the Five Emperors**\nThe immortal retinue arrives from the celestial heights,\nSolemnly descending to the five directions.\nInspecting the vapors, they sound their feathered batons,\nTheir simurgh chariots pause in the purified space.\nAs the retreat nears its conclusion,\nTheir carriages return to the heavens above.\nTheir flowing grace knows no bounds,\nHow could it be merely for the fragrance of incense?\n\n**Hymn to Send Forth the Scripture Master**\nThough the scriptural Dharma is subtle and wondrous,\nIts reverence depends entirely on the master.\nAll who establish goodness,\nFrequently pay homage to him.\nWhen qi flows, merit is easily achieved;\nWhen the heart is negligent, regret comes too late.\nIf one can diligently maintain mindfulness,\nMorning and evening, one will naturally soar as an immortal.\n\n**Hymn to Send Forth the Register Master**\nThe Dao holds the retreat in highest esteem,\nThe Dharma regards audience as constant practice.\nThose who neither cultivate nor uphold it,\nHow can they reach the Celestial Realm?\nWith the right bones, one enters the immortal ranks,\nNaturally opening the Purple Chamber.\nThe Dark Warrior arrays his numinous chariot,\nAnd one beholds the Golden Palace Hall.\n\n**Hymn to Send Forth the Ordination Master**\nFar away stands the Jade Capital Mountain,\nHow towering is the Mystic Metropolis!\nBrightly the long night unfolds,\nThe Perfected One rides the void.\nThe Great Dao is propagated by people,\nWhen the heart is devoted, the spirits naturally return.\nHaving completed the retreat and walked the Dao,\nWe bow our heads and take leave of the Three Masters.\n\n**Hymn of the Bright Lamp**\nThe light of the Orthodox Unity,\nFlares upward in vermilion smoke.",
      "overlap_context": "ing the causes of good and evil.\nAuspicious light illumines the cosmos,\nBenevolent grace rescues the sunken.\nRevealing faults to pray for true protection,\nWith a tranquil heart, moved by the sages.\nBoth the living and the dead attain joy,\nEnjoying blessings without end.\n\n**Hymn to Invoke the Scripture Master**\nEntering the retreat to cultivate the Yellow Register,\nSolemnly adorned to summon the Supreme Immortals.\nPresenting the memorial first to the throne,\nWords of sincerity await proclamation.",
      "start_char": 6211,
      "end_char": 6962,
      "start_sentence": 496,
      "end_sentence": 560,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.189289569854736,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\赞颂类\\三洞赞颂灵章.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "开明童子，一十二人。 洞照天下，及臣等身。 百邪摧落，却鬼万千。 光明朗彻，通真达灵。 太上散十方，华灯通精诚。 诸天悉皆照，诸地皆朗明。 我身亦光彻，五脏生华荣。 炎景朝太虚，遐想通玉京。 丹精寄太元，玄阳空中响。 贪形灭苦根，幽妙至真想。 垂华不□实，因缘永无象。 我身亦如之，乘化托流景。 夜光表丹阳，迢遥照虚空。 诸天普光颜，诸阴即自灭。 我神亦聪明，常玩智与慧。 逍遥通道运，迁谢任天势。 举形蹑空洞，夜烛燥流萃。 灭灯颂 玄阴闭光，长灯续明。 太阳已朗，八幽开清。 灯还太阴，光附景生。 日月二真，为我合并。 智慧颂 智慧生戒根，真道戒为主。 三宝由是兴，高仙所崇受。 泛此不死舟，倏忽济大有。 当此说戒时，诸天来稽首。 智慧起本无，朗朗起十方。 结空峙玄霄，诸天挹流芳。 其妙难思议，灵感真密通。 有有竟无有，无无无不容。 智慧常观身，学道之所先。 眇眇任意肆，自然录我神。 天尊常拥护，魔王为保言。 晃晃金刚躯，超超太上仙。 奉戒颂 道为无心宗，一切作福田。 立功无定准，本愿各由人。 虚巳应众生，注心莫不均。 大圣崇正教，亦由雨降天。 高凌靡不周，常卑故成渊。 海为百川王，是能舍龙鳞。 万劫保智用，岂但在厥年。 奉戒不暂亏，世世善结缘。 精思念大乘，会当体道真。 还戒颂 天尊大慈悲，说戒度众生。 威德被幽显，果报感真灵。 诸天来稽首，群魔自束形。 过去超八难，见在保千龄。 斋福行当息，相共送虔诚。 流梵逸云唱，飞香杂烟馨。 琼凤乘丹辇，金龙驾绿軿。 生死皆快乐，家国悉安宁。 烧香颂 学道当勤苦，敛信运丹诚。 烧香皈太上，真炁杂烟馨。 惟希开大宥，七祖离幽冥。 太极颂 道以齐为先，勤行登金阙，故设大法桥，普度诸人物。 宿世恩德报，道心超然发。 身飞升仙都，七祖咸解脱。 投简颂 太上法微妙，简箓度人天。 元始告符命，时刻获升仙。 传授救沈溺，皆得自修然。 书名金箓简，逍遥玉帝前。 度简颂 赤明开玄图，和畅通上虚。 元始敷灵章，十部飞天书。 开度九幽祖； 万遍道自居。 玉阜秀琼林，生死福德庐。 自无黄箓简，苦根焉得除。 旋行诵灵章，五灵还相扶。 焚词颂 众生多障难，大道实矜怜。 济度垂科教，咸令忏罪缘。 罪愆遍地府，衅结已闻天。 发露祈真佑，冥心感圣贤。 虔恭礼三宝，愿得早生天寿长年。 焚词皈上界，奏名玉帝前。 焚疏颂 圣德流科教，修斋福寿长。 延生移玉简，请命奏金章。 罪名消北府，生籍注南昌。 见存皆快乐，过去生福乡。 迎真颂 天尊御天龙，百万神仙骑。 云起自逍遥，玉音成鼓吹。 花严如意珠，圣化不思议。 惟愿降瑶坛，福被群生类。 送真颂 回軿五云舆，腾驾九章歌。 倏忽升天远，醮坛香气多。 玄恩覃宇宙，福禄遍山河。 缅想神仙路，逍遥上大罗。 送直符颂 仰启直符使，幽显路潜通。 乘云驰奏椟，远涉三界中。 紫清金阙邃，玄都水府宫。 奏传资瞬息，端简俟真风。 普献颂 普献无边圣，香烟散十方。 愿乘七宝台，垂光五浊世。 运度人天众，咸令上法桥。 同会证无为，勤修不退转。 北帝颂 善哉元始尊，众生慈父母。 倾光紫微宫，曲映九幽户。 峨峨丘寒庭，回照廓冰浦。 炎炎烈火狱，沛然洒法雨。 圆通大哀智，常善济众苦。",
      "translated_text": "**Hymn of the Radiant Youths**\nTwelve Luminous Youths stand revealed,\nTheir light pervading heaven and earth,\nIllumining our very selves.\nA hundred evils crumble and fall,\nTen thousand ghosts retreat in fear.\nBright radiance shines through all,\nCommuning with the true and numinous.\nThe Most High scatters light in every direction,\nVermilion lamps convey sincerity.\nAll heavens are fully illumined,\nAll earthly realms grow bright and clear.\nMy body, too, shines with light,\nMy five viscera blossom with splendor.\nScorching sunlight ascends the Great Void,\nDistant thoughts reach the Jade Capital.\nCinnabar essence abides in the Supreme Origin,\nMysterious yang resounds in the empty sky.\nGreed’s form severs the root of suffering,\nSubtle and wondrous, the true thought arises.\nHanging blossoms bear no fruit,\nCauses and conditions forever formless.\nMy body is likewise,\nRiding transformation, borne by flowing light.\nThe night’s glow marks the Cinnabar Yang,\nFar and distant, it illumines the void.\nAll heavens beam with radiant countenances,\nAll yin shadows instantly dissolve.\nMy spirit, too, grows keen and bright,\nEver delighting in wisdom and insight.\nCarefree, I traverse the Dao’s workings,\nShifting and yielding to heaven’s decree.\nRaising my form, I tread the empty vastness,\nNight’s torch dries the flowing essence.\n\n**Hymn to Extinguish the Lamps**\nMysterious yin seals the light,\nThe eternal lamp continues its brightness.\nThe Great Yang now shines forth,\nThe Eight Darknesses open to purity.\nThe lamp returns to the Great Yin,\nIts light clings to the arising radiance.\nThe Two Perfected of Sun and Moon\nMerge as one within me.\n\n**Hymn of Wisdom**\nWisdom gives rise to the root of precepts,\nThe true Dao takes precepts as its master.\nFrom this, the Three Treasures flourish,\nRevered and received by lofty immortals.\nSailing this deathless vessel,\nSwiftly one crosses the vast expanse.\nAt this moment of expounding precepts,\nAll heavens come to bow their heads.\nWisdom arises from original non-being,\nBrightly illuminating the ten directions.\nBinding emptiness, it towers in the mystic firmament,\nAll heavens draw from its flowing fragrance.\nIts wonder defies thought and speech,\nIts numinous resonance truly and subtly pervades.\nBeing culminates in non-being,\nNon-being contains all without exception.\nWisdom constantly observes the body,\nThe foremost task in learning the Dao.\nVast and boundless, it roams freely,\nNaturally recording my spirit.\nThe Heavenly Worthy ever protects and shelters,\nThe Demon King pledges his guardianship.\nResplendent is the Vajra body,\nTranscendent, the Most High immortal.\n\n**Hymn of Upholding the Precepts**\nThe Dao takes non-mind as its essence,\nAll acts become fields of merit.\nEstablishing merit has no fixed measure,\nEach follows their original vow.\nEmptying oneself to respond to beings,\nFocus the mind without partiality.\nThe Great Sage exalts the true teaching,\nJust as rain descends from heaven.\nLofty and towering, none are left untouched,\nEver humble, thus forming the abyss.\nThe sea is king of a hundred rivers,\nFor it can relinquish the dragon’s scales.\nThrough ten thousand kalpas, wisdom is preserved,\nHow could it be limited to this lifetime?\nUpholding precepts without the slightest lapse,\nLifetimes of good karmic bonds are formed.\nConcentrate thought on the Great Vehicle,\nAnd you shall embody the Dao’s truth.\n\n**Hymn of Returning the Precepts**\nThe Heavenly Worthy, vast in compassion,\nExpounds the precepts to deliver beings.\nMajestic virtue pervades the hidden and manifest,\nKarmic retribution moves the true numina.\nAll heavens come to bow their heads,\nAll demons restrain their forms.\nThe past transcends the Eight Difficulties,\nThe present safeguards a thousand years.\nWhen the merit of the retreat is complete,\nTogether we send forth our reverence.\nFlowing Sanskrit, ethereal cloud-chants,\nFlying incense mingles with fragrant smoke.\nJade phoenixes ride cinnabar carriages,\nGolden dragons draw emerald chariots.\nIn life and death, all find joy,\nFamilies and nations all know peace.\n\n**Hymn of Burning Incense**\nIn learning the Dao, be diligent and earnest,\nGather faith and circulate cinnabar sincerity.\nBurn incense and take refuge in the Most High,\nTrue qi blends with fragrant smoke.\nMay it open the great pardon,\nFreeing the seven ancestors from dark realms.\n\n**Hymn of the Supreme Ultimate**\nThe Dao takes purification as foremost,\nDiligent practice ascends the Golden Portal.\nThus is the great Dharma bridge established,\nUniversally delivering all beings.\nRepaying the kindness of past lives,\nThe heart of the Dao arises transcendent.\nThe body soars to the immortal capital,\nThe seven ancestors all attain liberation.\n\n**Hymn of Presenting the Petition**\nThe Most High’s Dharma is subtle and wondrous,\nPetitions and registers deliver humans and heavens.\nThe Primordial Beginning announces the talismanic decree,\nAt the appointed hour, one attains ascension.\nTransmission saves the drowning,\nAll achieve self-cultivation.\nInscribing names on the Golden Petition,\nCarefree before the Jade Emperor.\n\n**Hymn of the Deliverance Petition**\nVermilion brightness unfolds the mystic chart,\nHarmonious and smooth, it reaches the upper void.\nThe Primordial Beginning spreads the numinous scripture,\nTen divisions of flying celestial texts.\nOpening deliverance for the nine dark ancestors,\nA myriad recitations, the Dao naturally abides.\nJade peaks adorn the jeweled forest,\nLife and death dwell in the abode of merit and virtue.\nWithout the Yellow Register Petition,\nHow could the root of suffering be severed?\nCircumambulating, reciting the numinous scripture,\nThe Five Numinous Ones return to assist.\n\n**Hymn of Burning the Petition**\nBeings abound in obstacles and hardships,\nThe Great Dao truly pities and cherishes them.\nDeliverance extends through ritual teachings,\nAll are enabled to repent their karmic bonds.\nTransgressions fill the earthly prisons,\nOffenses have reached the heavens.\nRevealing them, I pray for true protection,\nWith a hidden heart, I move the sages.\nReverently bowing to the Three Treasures,\nMay I soon ascend to heaven and enjoy long years.\nBurning the petition, I return it to the upper realms,\nPresenting names before the Jade Emperor.\n\n**Hymn of Burning the Memorial**\nSacred virtue flows through ritual teachings,\nCultivating the retreat brings long life and fortune.\nExtending life by transferring the Jade Petition,\nRequesting destiny by presenting the Golden Scroll.\nSinful names vanish from the Northern Bureau,\nLiving registers are inscribed in the Southern Prosperity.\nThe living all find joy,\nThe departed are born in the land of fortune.\n\n**Hymn of Welcoming the Perfected**\nThe Heavenly Worthy mounts the celestial dragon,\nA million immortals ride as his retinue.\nClouds arise in carefree ascent,\nJade tones form the music of flutes and drums.\nFlower garlands and wish-fulfilling jewels,\nSacred transformations beyond thought.\nMay they deign to descend upon the jade altar,\nBestowing blessings upon all beings.\n\n**Hymn of Sending Forth the Perfected**\nThe returning chariot of five-colored clouds,\nSoaring with the ninefold hymns.\nIn an instant, they ascend far into heaven,\nThe altar’s incense lingers in abundance.\nMysterious grace blankets the cosmos,\nFortune and blessings pervade mountains and rivers.\nGazing afar at the immortal path,\nCarefree, they ascend the Great Loftiness.\n\n**Hymn of Sending Forth the Direct Petition Messenger**\nI reverently invoke the Direct Petition Messenger,\nHidden and manifest paths secretly connect.\nRiding clouds, hastening to present the casket,\nFar traversing the Three Realms.\nThe Purple Clarity and Golden Portal are profound,\nThe Mystic Metropolis and Water Palace abide.\nTransmission is swift as a moment,\nThe upright petition awaits the true wind.\n\n**Hymn of Universal Offering**\nUniversally offering to the boundless sages,\nFragrant smoke scatters in the ten directions.\nMay they ascend the Seven Treasures Terrace,\nShedding light upon the Five Turbid Worlds.\nDelivering the hosts of humans and heavens,\nAll are enabled to mount the Dharma bridge.\nTogether we realize non-action,\nDiligently cultivating without retreat.\n\n**Hymn of the Northern Emperor**\nExcellent is the Primordial Beginning, the Venerable One,\nThe compassionate father and mother of all beings.\nInclining his light from the Purple Tenuity Palace,\nBending to illuminate the nine dark portals.\nTowering is the cold courtyard of Mount Qiu,\nIts reflection expands the icy shores.\nFiery flames rage in the scorching hells,\nAbundantly he showers the Dharma rain.\nAll-pervading, his great compassion and wisdom,\nEver skillfully relieving the suffering of the multitude.",
      "overlap_context": "lace Hall.\n\n**Hymn to Send Forth the Ordination Master**\nFar away stands the Jade Capital Mountain,\nHow towering is the Mystic Metropolis!\nBrightly the long night unfolds,\nThe Perfected One rides the void.\nThe Great Dao is propagated by people,\nWhen the heart is devoted, the spirits naturally return.\nHaving completed the retreat and walked the Dao,\nWe bow our heads and take leave of the Three Masters.\n\n**Hymn of the Bright Lamp**\nThe light of the Orthodox Unity,\nFlares upward in vermilion smoke.",
      "start_char": 6962,
      "end_char": 8276,
      "start_sentence": 561,
      "end_sentence": 673,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.5610773563385,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\赞颂类\\三洞赞颂灵章.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "拔度长夜魂，今得稽首礼。 华夏赞 勤行奉斋戒，诵经制六情。 故得乘空飞，耀景腾玉清。 精心奉斋戒，吐纳炼五神。 内德冠诸天，转轮成上仙。 学道赞 学道行为急，奉戒情制心。 虚夷正炁居，仙圣自相寻。 若不信法言，胡为栖山林。 太极真人颂 神云焕层虚，梵罗屯碧霄。 元始九龙驾，皇人按青轺。 灵光集万真，珠影开阳寥。 出示灵宝篇，福德由是招。 洞玄隐高严，玉音泛云璈。 元量匪得思，道海生波涛。 法义同涓流，滋植成嘉苗。 用以赈饥穷，教兴卫中朝。 帝尊寿亿年，太平灭兵刀。 稽首望玉晨，灵华散金毫。 大道虽无心，可以有情求。 仁驾空洞中，回盻翳沧流。 净明三界外，萧萧玉京游。 自无玄挺运，谁能悟冥趣。 落落天汉澄，俯仰即虚柔。 七玄散幽裔，返胎顺沈浮。 冥期苟潜凝，阳九无虞忧。 睹此去来会，时复为淹留。 外身而身存，真仙会良俦。 亹亹玄中趣，湛湛清汉波。 代谢若旋环，椿木不改柯。 静心念至真，随运顺离罗。 感应理常通，神识逮自徂。 淡游初无际，繁想洞九霞。 飞根散玄叶，理反非有它。 常能诵玉章，玄音彻霄遐。 甲申洪灾至，控翮王母家。 永享无终纪，岂知年劫多。 金箓度命九幽拔罪颂 稽首无上道，归心元始尊。 至真妙应主，开化飞玄门。 妙戒怡五灵，金书警万神。 察命定箓籍，灵符度苦魂。 乘云朝玉帝，齐契玄中人。 解冤拔罪颂 伟哉大道君，常普无量功。 舟楫生死海，济度超罗酆。 罪对不复遇，福报与冥通。 用神安可测，赞之焉能穷。 功德往生颂 泠泠甘露滋，法味难思议。 骞香流七真，冥冥何生疑。 受此法食者，生天登紫微。 福田高巍巍，供施令清净。 一切有为事，普皆成代命。 拔汝三涂苦，施汝九玄庆。 临当受食时，诸天皆赞咏。 寒庭多悲苦，回心礼元皇。 女青灵宝符，中山真帝书。 一念升太清，再念归太无。 功归九幽下，旋旋生紫微。 太元真人临授洞玄经颂 八涂会无宗，乘运观嚣罗。 化浮尘中除，解衿有道家。 骋烟忽未顷，携真造灵阿。 虚景瞻琼轩，玄钧作凤歌。 适路无轨滞，神音舞云波。 齐德秀玉京，何用世间多。 左把玉华盖，飞晨蹑七元。 三辰焕紫辉，竦盻抚明真。 变踊期须臾，四面皆已神。 灵文无涯际，勤思上清文。 何事坐横涂，令尔感不专。 阴痾失玄机，不觉年岁分。 玄波振沧涛，洪津鼓万流。 驾景盻六虚，思与真人游。 妙唱不我对，清音无谁投。 云中骋琼轮，孰为尘土俦。 太极真人颂 太上大道君，出示灵宝篇。 高妙难为喻，犹彼玄中玄。 自然十方土，共仰无上仙。 大乎洞虚经，安坐朝诸天。 上宝紫微台，下藏诸名山。 焕烂龙凤文，戢耀在其间。 妙哉太上道，无为常自然。 王侯及凡庶，所贵唯贵贤。 宿命有福庆，卓拔在昔绿。 法师转相授，宝信劫数年。 广心度一切，大福报尔身。 供养必得道，奉得成至真。 大道无彼我，传当得至人。 玄一一真人颂 众妙出洞真，焕烂耀太清。 奉者号仙人，体元永长生。 逍遥戏玄虚，宫殿罗其形。 蒨璨七宝林，晃朗日月精。 龙麟交横驰，凤凰翔悲呜。 太上治紫台，众真诵洞经。 捻香稽首礼，旋行绕官城。 三周归高座，道王为应声。 人主弘至道，天下普安宁。 玄一二真人颂 虚无常自然，强名字大道。 □邈无边际，众妙归灵宝。",
      "translated_text": "**Deliverance of Long-Night Souls**\nNow delivered from the endless night, they bow in reverence.\n\n**Hymn of Huaxia**\nDiligently observing fasts and precepts,\nReciting scriptures to restrain the six passions.\nThus they ride the void and soar,\nRadiant, ascending to Jade Clarity.\nWith focused heart they keep the fasts,\nExhaling and inhaling to refine the five spirits.\nInner virtue crowns the heavens,\nTurning the wheel to become perfected immortals.\n\n**Hymn of Dao-Seekers**\nTo seek the Dao, action is urgent;\nTo uphold precepts is to master the heart.\nIn emptiness and equanimity, the true *qi* abides,\nWhere immortals and sages naturally converge.\nIf one does not trust the Dharma’s words,\nWhy dwell in mountain forests?\n\n**Hymn of the Supreme Pole Perfected**\nDivine clouds gleam in layered void,\nBrahmic nets gather in azure skies.\nThe Primordial Beginning’s nine dragons draw the chariot,\nThe August One reins the azure carriage.\nLuminous radiance gathers the myriad perfected,\nPearl-like reflections open the vastness of Yang Lea.\nRevealing the *Lingbao* scriptures,\nFortune and virtue are thereby summoned.\nThe Cavernous Mystery conceals lofty majesty,\nJade tones ripple like cloud-borne zithers.\nBoundless as the primordial measure,\nThe Dao’s sea stirs with waves.\nDharma principles flow like rivulets,\nNurturing fine sprouts to grow.\nUsed to relieve the hungry and destitute,\nTeachings flourish to guard the central court.\nMay the August Lord live for myriad years,\nPeace prevail, and weapons be stilled.\nBowing in reverence toward the Jade Dawn,\nDivine blossoms scatter from golden rays.\nThough the Great Dao is without intent,\nIt may be sought with devotion.\nBenevolence rides the empty vastness,\nGazing back upon the veiled azure currents.\nBeyond the Three Realms, in purity and brightness,\nOne roams the ethereal Jade Capital.\nWithout the mysterious impetus of fate,\nWho could fathom the hidden depths?\nVast and clear, the Celestial Han,\nLooking up and down, one finds emptiness and softness.\nThe Seven Mysteries disperse the dark descendants,\nReturning to the womb, flowing with sinking and rising.\nIf the hidden term silently congeals,\nThe Yang’s nine calamities hold no fear.\nBeholding these goings and comings,\nTime and again one lingers.\nExternally forsaking the body, yet the body endures—\nTrue immortals meet with worthy companions.\nVigorous is the mystery within,\nSerene are the waves of the clear Han.\nChange and decay turn like a wheel,\nYet the camphor tree’s branches remain unchanged.\nWith tranquil heart, contemplate the Perfected,\nFollowing fate’s course through separation and union.\nResonance and response are ever connected,\nSpiritual awareness reaches its own origin.\nWandering in simplicity, without bounds,\nProlific thoughts penetrate the nine rosy clouds.\nFlying roots scatter dark leaves,\nPrinciple returns—nothing else.\nEver reciting jade verses,\nMysterious tones pierce the distant skies.\nWhen the *jiashen* flood disaster struck,\nI soared on wings to the Queen Mother’s abode.\nForever enjoying boundless eternity,\nWho knows the multitude of kalpas?\n\n**Hymn of the Golden Register for Delivering Lives and Redeeming Sins from the Nine Dark Realms**\nBowing in reverence to the Supreme Dao,\nMy heart returns to the Primordial Venerable One.\nThe Perfect and Wondrous Responsive Lord,\nOpens and transforms the soaring Mystery Gate.\nWondrous precepts gladden the five spirits,\nGolden scriptures admonish the myriad deities.\nExamining fate, the registers are fixed,\nDivine talismans deliver suffering souls.\nRiding clouds to attend the Jade Emperor,\nIn harmony with those of the Mystery Center.\n**Hymn of Redeeming Karmic Entanglements**\nGreat is the Lord of the Dao,\nEver universally bestowing boundless merit.\nA boat and oars upon the sea of birth and death,\nFerrying across to transcend Fengdu’s nether realms.\nKarmic retribution no longer encountered,\nBlessings connect with the unseen.\nHow could the workings of the divine be fathomed?\nPraise cannot exhaust them.\n\n**Hymn of Merit for Rebirth**\nCool and sweet, the nectar nourishes,\nThe Dharma’s flavor beyond thought.\nIncense wafts to the Seven Perfected,\nHow could doubt arise in the unseen?\nThose who receive this Dharma food,\nAscend to heaven, enter the Purple Tenuity.\nThe field of merit lofty and towering,\nOfferings and alms bring purity.\nAll conditioned deeds,\nUniversally fulfill karmic destiny.\nDelivering you from the three wretched paths’ suffering,\nBestowing the nine mysteries’ blessings.\nWhen the time comes to receive this food,\nAll heavens join in praise.\nThe cold courtyard holds much sorrow,\nTurning hearts to bow to the Primordial August.\nThe Talisman of the Divine Treasure of Lady Blue,\nThe True Scripture of the Central Mountain Emperor.\nOne thought ascends to Grand Clarity,\nA second thought returns to the Supreme Void.\nMerit accrues below the nine dark realms,\nSwiftly reborn in the Purple Tenuity.\n\n**Hymn of the Supreme Pole Perfected Administering the Cavernous Mystery Scripture**\nThe eight paths converge without origin,\nRiding fate to observe the clamorous net.\nTransforming and removing the dust of the world,\nLoosening the collar, one finds the Daoist family.\nIn an instant of wafting smoke,\nBearing truth, one arrives at the numinous peak.\nGazing upon the jade pavilion in the void,\nThe mysterious harmony composes phoenix songs.\nThe path is free from hindrance,\nDivine tones dance upon cloud waves.\nEqual in virtue with the jadelike capital,\nWhy cling to worldly abundance?\nLeft hand grasping the jade parasol,\nFlying at dawn, treading the Seven Origins.\nThe Three Luminaries gleam with purple radiance,\nRising to gaze upon the Bright Perfected.\nIn a moment of leaping transformation,\nAll four directions become divine.\nThe numinous scripture knows no bounds,\nDiligently ponder the *Shangqing* texts.\nWhy remain mired in the crossroads,\nCausing your devotion to waver?\nYin ailments lose their mysterious mechanism,\nUnnoticed, the years divide.\nMysterious waves stir the azure tides,\nVast currents surge through myriad streams.\nRiding the radiance, gazing upon the six voids,\nLonging to wander with the Perfected.\nExquisite songs do not answer me,\nClear tones find no one to receive them.\nAmid clouds, driving jade wheels,\nWho would be a companion in dust and earth?\n\n**Hymn of the Supreme Pole Perfected**\nThe Most High Lord of the Great Dao,\nReveals the *Lingbao* scriptures.\nLofty and wondrous, beyond comparison,\nLike the mystery within mystery.\nThe ten directions’ lands naturally\nRevere the Supreme Immortals.\nVast is the *Dongxu* scripture,\nSeated in peace, attending the heavens.\nAbove, the Purple Tenuity Terrace,\nBelow, the myriad famous mountains.\nResplendent with dragon and phoenix patterns,\nTheir brilliance stored within.\nWondrous is the Most High Dao,\nNon-action, ever natural.\nKings, lords, and common folk,\nValue only the worthy.\nThose with karmic fortune and blessings,\nStand out from the past’s verdant fields.\nDharma masters transmit to one another,\nPrecious faith enduring kalpas.\nWith broad heart, deliver all,\nGreat fortune will be yours.\nThose who make offerings will attain the Dao,\nThose who uphold it become perfected.\nThe Great Dao has no self or other,\nTransmission finds the Perfected.\n\n**Hymn of the First Perfected of the Mysterious Unity**\nMyriad wonders emerge from the Cavernous Truth,\nResplendent, illuminating Grand Clarity.\nThose who uphold it are called immortals,\nEmbodying the origin, they live forever.\nCarefree, they play in the mysterious void,\nPalaces array their forms.\nLush and radiant, the seven-jeweled grove,\nGleaming with the essence of sun and moon.\nDragons and unicorns gallop to and fro,\nPhoenixes soar with mournful cries.\nThe Most High governs the Purple Terrace,\nThe myriad perfected recite the Cavernous scriptures.\nHolding incense, bowing in reverence,\nCircumambulating the palace city.\nThree circuits return to the high seat,\nThe Dao King responds with his voice.\nWhen the ruler promotes the Perfect Dao,\nThe world universally attains peace.\n\n**Hymn of the Second Perfected of the Mysterious Unity**\nEmptiness and nothingness, ever natural,\nForcibly named the Great Dao.\n[...] vast, without bounds,\nMyriad wonders return to the *Lingbao*.",
      "overlap_context": " the Northern Emperor**\nExcellent is the Primordial Beginning, the Venerable One,\nThe compassionate father and mother of all beings.\nInclining his light from the Purple Tenuity Palace,\nBending to illuminate the nine dark portals.\nTowering is the cold courtyard of Mount Qiu,\nIts reflection expands the icy shores.\nFiery flames rage in the scorching hells,\nAbundantly he showers the Dharma rain.\nAll-pervading, his great compassion and wisdom,\nEver skillfully relieving the suffering of the multitude.",
      "start_char": 8276,
      "end_char": 9554,
      "start_sentence": 674,
      "end_sentence": 779,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 49.41114640235901,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\赞颂类\\三洞赞颂灵章.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "闭眼存至真，精思降十老。 升仙永无为，灵颜常妙好。 渴饮玉池醴，饥食金花草。 净世度八难，济世诸苦恼。 玄一三真人颂 妙哉灵宝经，太上自然书。 奉者致得道，号世降真来。 受命宣道教，真为超俗才。 事毕升神仙，宫殿治玄台。 时降昆仑山，逍遥憩蓬莱。 张天师颂 灵宝及大洞，至真道经王。 唯有五千文，高妙无等双。 奉行致飞仙，玄居治虚空。 侍卫太上台，逍遥紫微宫。 万劫犹电顷，长存永无穷。 道眼已备足，豁落自冥通。 幽昧无不知，安坐睹十方。 三启颂 乐法以为妻，爱经如珠玉。 持戒制六情，念道遣所欲。 淡薄正气停，萧然神静默。 天魔并敬护，世世享大福。 郁郁家国盛，济济经道兴。 天人同其愿，缥缈入大乘。 因心立福田，靡靡法轮升。 七祖生天堂，我身白日腾。 大道洞玄虚，有念无不契。 炼质入仙真，遂成金刚体。 超度三界难，地狱五苦解。 悉归太上经，静念稽首礼。 演道赞 天道应运，阴阳至神。 察其机要，有亡其身。 悟即为上，迷者非真。 演法赞 天地万物，阴阳四时。 更相为盗，贵合天机。 圣功神明，非贤莫知。 固躬轻命，审察其宜。 演术赞 绝利一源，三思反覆。 徇物之机，生死在目。 乐出安静，恩生害酷。 天地灾祥，时理为福。 清静经颂 五太初为先，虚无道自然。 混元权祖正，妙体契宗玄。 演教明无上，知常假喻诠。 因斯清静德，阐化立经篇。 大道隐乎形，真精混窈冥。 二仪分始兆，一气运无停。 覆载诚难测，生成育只宁。 陶甄能匠物，蠢动尽含灵。 日月运虚空，明明甚至公。 得天能久照，丽物可咸通。 有质蒙光照，无情混象融。 阴阳常体道，不息太无中。 妙道实难名，包含万物生。 运时充地脉，任信禀天清。 吹煦真消息，冲和大化成。 圆通归一体，高下坦然平。 无相杳无踪，难名混沌中。 未萌天地日，安得雨云风。 凿破胚浑兆，冲开物象蒙。 因斯分造化，权立道无穷。 清浊阴阳气，周流上下冲。 自然成感化，终则契圆通。 万类含滋育，三元配合同。 乾坤交泰定，都会一真空。 肇判两仪分，人灵至贵尊。 三才安宇宙，二物定乾坤。 种种含真炁，元元实相门。 刚柔相济用，体道孰能存。 降本通真体，还元见末因。 春阳敷茂畅，秋候主凋沦。 太极生形化，纯和造物新。 枢机推大运，掌握任功神。 清静理幽深，谁能究竟寻。 观空除万境，绝相了诸心。 慧月流丹汉，慈云覆翠岑。 寂然人不动，应物显知音。 人悟常清静，知源妙圣机。 太初无染滞，全寂隐光辉。 默默藏沙界，昏昏彻紫微。 三元升降后，天地悉皆归。 心者灵之府，神栖静可安。 贪嗔痴易作，戒定慧难观。 深要正中正，坚持闲内闲。 常无生六欲，法界自然宽。 若遣诸情欲，澄心妙洞观。 同真非物物，归寂弃般般。 水远连天静，山高戴月寒。 圆融通智慧，壶内衮金丸。 正念无偏党，冲虚合自然。 六根尘顿息，三毒病须痊。 妙道超空劫，全神达上天。 些儿幽密处，玄牝自绵绵。 迷路失家乡，都缘昧巳光。 心浮诚易动，境熟为难忘。 欲染何能遣，邪奸转使荒。 回头堪悟处，返照见空王。 觉了诸尘漏，分明道眼开。 色声非有碍，知见定须埋。 神静千灾灭，心虚万虑灰。 清风穿玉户，自有好音来。 诸相观非相，其形是种无。",
      "translated_text": "**Hymn of the Third Perfected of the Mysterious Unity**\nWith eyes closed, meditate upon the Most Real,\nIn deep concentration, summon the Ten Elders.\nAscending as immortals, forever free from action,\nTheir numinous countenances ever wondrous and fair.\nThirst quenched by the nectar of Jade Pool,\nHunger sated by the Golden Flower herb.\nThey purify the world, delivering from the Eight Perils,\nRelieving all worldly sufferings and afflictions.\n\n**Hymn of the Third Perfected of the Mysterious Unity**\nWondrous indeed, the *Lingbao* scriptures,\nThe Most High’s spontaneous writings.\nThose who uphold them attain the Dao,\nProclaimed as perfected beings descending into the world.\nEntrusted to propagate the Daoist teachings,\nTruly they transcend the mundane.\nTheir tasks complete, they ascend as immortals,\nTheir palaces governing the Mysterious Terrace.\nAt times descending upon Kunlun Mountain,\nCarefree, they rest in Penglai.\n\n**Hymn to Master Zhang**\nThe *Lingbao* and the Great Cavern,\nSupreme scriptures of the Perfect Dao.\nOnly the Five Thousand Characters,\nLofty and wondrous, without equal.\nThose who practice them ascend as immortals,\nDwelling in the void, governing the ethereal.\nAttending the Terrace of the Most High,\nCarefree in the Purple Tenuity Palace.\nTen thousand kalpas pass like a flash of lightning,\nYet they endure forever, without end.\nThe Dao-eye now fully opened,\nVast and luminous, naturally penetrating the obscure.\nThe hidden and dim—none unknown,\nSeated in stillness, they behold the ten directions.\n\n**Hymn of the Threefold Invocation**\nDelighting in the Dharma as one’s wife,\nCherishing the scriptures like pearls and jade.\nHolding the precepts to restrain the six senses,\nContemplating the Dao to dispel desires.\nIn purity, the upright qi abides,\nIn serenity, the spirit rests in silence.\nHeavenly demons all revere and protect,\nLifetimes of great blessings enjoyed.\nFlourishing are families and nations,\nProsperous are the scriptures and the Dao.\nHeaven and humanity share the same aspiration,\nEthereally entering the Great Vehicle.\nCultivating the field of merit in the mind,\nThe Dharma-wheel ascends in boundless ascent.\nSeven generations of ancestors ascend to heaven,\nWhile this body soars in broad daylight.\nThe Great Dao pervades the mysterious void,\nWith mindfulness, nothing fails to align.\nRefining the body into immortal perfection,\nThus attaining the adamantine form.\nTranscending the Three Realms’ tribulations,\nLiberating from the Five Sufferings of hell.\nAll return to the scriptures of the Most High,\nIn tranquil contemplation, bowing in reverence.\n\n**Hymn in Praise of the Dao’s Manifestation**\nThe Dao of heaven responds to the times,\nYin and yang are most numinous.\nDiscerning their subtle mechanisms,\nOne may preserve or lose the body.\nAwakened, one becomes supreme;\nDeluded, one is not real.\n**Hymn in Praise of the Dharma’s Exposition**\nHeaven and earth, the myriad things,\nYin and yang, the four seasons.\nMutually overcoming one another,\nYet noble is he who harmonizes with heaven’s mechanism.\nThe sagely work is spiritually efficacious,\nNone but the worthy can comprehend.\nThus, one lightly values life,\nCarefully examining what is fitting.\n\n**Hymn in Praise of the Arts’ Exposition**\nCutting off profit at its source,\nThrice reflecting, then acting.\nYielding to things’ mechanisms,\nLife and death lie before one’s eyes.\nJoy arises from tranquility,\nKindness begets cruel harm.\nHeaven and earth’s calamities and blessings,\nTimely principles bring fortune.\n\n**Hymn to the Scripture of Purity and Stillness**\nThe Five Ultimates take primacy,\nThe void and nothingness are the Dao’s spontaneity.\nThe Primordial Origin governs the ancestral norm,\nIts wondrous essence harmonizes with the mysterious and profound.\nExpounding the teachings to clarify the Supreme,\nUnderstanding constancy through metaphorical explication.\nThrough this pure and still virtue,\nThe scriptures are established to propagate transformation.\n\nThe Great Dao conceals itself in form,\nTrue essence blends into the obscure.\nThe Two Modes divide at the first sign,\nA single qi circulates without cease.\nEncompassing and sustaining—truly unfathomable,\nNurturing and generating—oh, how serene!\nFashioning and shaping, the Artisan of things,\nAll creatures, though dull, contain the numinous.\nSun and moon traverse the void,\nBright and luminous, most impartial.\nThose who attain heaven endure in radiance,\nIlluminating all things, universally penetrating.\nTangible things receive light’s illumination,\nInsentient beings merge with form’s fusion.\nYin and yang constantly embody the Dao,\nUnceasing within the Great Vastness.\n\nThe wondrous Dao is truly hard to name,\nYet it embraces and generates the myriad things.\nCirculating through time, it fills the earth’s veins,\nFreely bestowed, it receives heaven’s clarity.\nBreathing forth the true message,\nThe Great Transformation achieves harmony.\nReturning to oneness in perfect communion,\nHigh and low lie level and even.\nFormless, utterly without trace,\nHard to name within the primordial chaos.\nBefore the emergence of heaven, earth, and sun,\nHow could there be rain, clouds, or wind?\nBreaking open the signs of the primordial chaos,\nPiercing through the obscurity of things’ forms.\nThereby dividing and creating,\nProvisionally establishing the boundless Dao.\nThe clear and turbid qi of yin and yang,\nCirculating, surging above and below.\nNaturally accomplishing transformation,\nUltimately harmonizing in perfect communion.\nThe myriad kinds nurtured and reared,\nThe Three Origins conjoined in unity.\nHeaven and earth in harmonious union,\nAll gathered in the One True Emptiness.\n\nAt the inception, the Two Modes divided,\nHumanity and the numinous—most noble and revered.\nThe Three Powers stabilize the cosmos,\nThe Two Forces determine heaven and earth.\nAll things contain the true qi,\nThe primordial is the gateway to true reality.\nHard and soft mutually complement in function,\nWho can abide in embodying the Dao?\nDescending to the root, one penetrates the true body,\nReturning to the origin, one perceives the end’s cause.\nSpring’s yang spreads luxuriant flourishing,\nAutumn’s season governs withering and decline.\nThe Supreme Ultimate generates form and transformation,\nIn pure harmony, it renews creation.\nThe pivot of the great mechanism propels the great movement,\nEntrusted to the divine, it accomplishes its work.\nThe principle of purity and stillness is profound,\nWho can fathom its ultimate depths?\n\nBeholding emptiness, one eliminates all realms,\nCutting off forms, one comprehends all minds.\nThe moon of wisdom flows in the cinnabar river,\nThe cloud of compassion covers the emerald peaks.\nAbiding in stillness, one remains unmoved,\nResponding to things, one manifests as a knowing friend.\nWhen one awakens to constant purity and stillness,\nOne knows the wondrous mechanism of the sagely origin.\nThe Great Beginning is free from defilement,\nIn perfect quiescence, its radiance concealed.\nSilently, it enfolds the sand-realm,\nDimly, it penetrates the Purple Tenuity.\nAfter the Three Origins’ ascent and descent,\nHeaven and earth all return to it.\n\nThe mind is the numinous abode,\nThe spirit rests in stillness, finding peace.\nGreed, anger, and delusion easily arise,\nPrecepts, concentration, and wisdom are hard to behold.\nThe profound essentials lie in perfect uprightness,\nFirmly maintaining inner tranquility.\nEver free from the six desires,\nThe Dharma-realm naturally expands.\nIf one dispels all passions and desires,\nThe mind becomes clear, wondrously penetrating all.\nIn unity with the real, not clinging to things,\nReturning to stillness, abandoning all attachments.\n\nWater, distant, connects to heaven in stillness,\nMountains, high, wear the moon’s chill.\nIn perfect communion, wisdom is all-penetrating,\nWithin the pot, the golden pellet revolves.\nRight mindfulness is without bias,\nIn emptiness, it harmonizes with spontaneity.\nThe six senses’ dust instantly ceases,\nThe three poisons’ afflictions must be healed.\nThe wondrous Dao transcends kalpas of emptiness,\nPreserving the spirit, one ascends to heaven.\nIn this subtle and mysterious place,\nThe Mysterious Female naturally endures.\nLosing the way, one strays from home,\nAll because one’s own light is obscured.\nThe mind, floating, is easily moved,\nFamiliar realms are hard to forget.\nHow can one dispel the defilements of desire?\nDevious cunning only leads to desolation.\nTurning the head, one finds the place of awakening,\nReflecting inward, one beholds the King of Emptiness.\nAwakened to all the leaks of dust,\nThe Dao-eye opens clearly.\nForms and sounds are not obstacles,\nKnowledge and perception must be buried.\nWhen the spirit is still, a thousand calamities vanish,\nWhen the mind is empty, ten thousand cares turn to ash.\nThe pure wind passes through the jade door,\nNaturally, sweet sounds arrive.\n\nBeholding all forms as non-form,\nTheir essence is but a kind of nothingness.",
      "overlap_context": "s the Purple Terrace,\nThe myriad perfected recite the Cavernous scriptures.\nHolding incense, bowing in reverence,\nCircumambulating the palace city.\nThree circuits return to the high seat,\nThe Dao King responds with his voice.\nWhen the ruler promotes the Perfect Dao,\nThe world universally attains peace.\n\n**Hymn of the Second Perfected of the Mysterious Unity**\nEmptiness and nothingness, ever natural,\nForcibly named the Great Dao.\n[...] vast, without bounds,\nMyriad wonders return to the *Lingbao*.",
      "start_char": 9554,
      "end_char": 10852,
      "start_sentence": 780,
      "end_sentence": 886,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.793638706207275,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\赞颂类\\三洞赞颂灵章.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "内含真法界，体合太空虚。 云静蟾光露，潭澄练色铺。 此般明显示，何在觅殊涂。 寂照观诸物，群灵岂有殊。 同真非可见，绝迹莫能模。 了了堂中老，休休法外无。 玄玄玄也泯，八极任宽舒。 廓达真空界，回观一物无。 混融同大漠，湛寂体虚无。 洞照音常寂，圆通性自如。 中间并内外，不属返元初。 达了心无物，无无实亦无。 何劳除妄想，岂在辨精粗。 缘静虚施巧，归真任不渝。 这般消息密，孰敢强名模。 万法本来空，无无合圣功。 湛然非内外，寂尔泯西东。 心境双忘处，方圆一同。 杳冥超造化，无物悉皆通。 假寂权为体，还当去欲因。 忘缘如是息，真静自然新。 契合无生法，方知不夜春。 独超天地外，任意燕申申。 一定达真常，神光莫可量。 照开三毒室，射透五明堂。 宝月晴空露，迷云蕴迩亡。 清风布消息，应物任舒张。 旷劫镇圆成，无暗亦无明。 谷神常自寂，法海晏然清。 正念投真路，澄心达妙程。 永离生死系，三界任宽行。 了寂沈声迹，深通至理幽。 真空宁有得，实相本无修。 饮啄从他过，威仪任自由。 豁然除拟议，安静保全周。 为证众生化，俱亡种种求。 顿超无漏果，宁许有根由。 取舍安能动，因缘亦断流。 瞥然都放下，圣道可传留。 上士何无争，勤常抱志坚。 栖真常憺泊，养素隐幽玄。 俯仰观天理，穷通达道渊。 堪嗟未明者，竞法昧心田。 德化非求报，恩宽肯自矜。 韬光藏大器，明性莹坚冰。 默契高穹远，深通至道弘。 岂同愚士执，分别强谈能。 众生多背道，颠倒外边求。 妄想因斯有，真灵昧了休。 本来无欠少，何假强持修。 顿拂迷云尽，银蟾照玉楼。 谋事因生妄，乖真为动神。 皆心存爱欲，着物起贪嗔。 常蕴无明火，还添烦恼尘。 从兹缘受报，六道转沈沦。 为妄生嗔欲，贪痴作障缘。 忧愁长系绊，烦恼镇缠绵。 为此迷真道，从斯就业愆。 回光能返照，自觉妙中玄。 烦恼缘兴念，何曾觉自心。 茫茫遭苦辱，扰扰肯沈吟。 浪死无休息，虚生直至今。 因而真道失，梦想转来侵。 人若通天地，俱蒙道炁存。 藏根深固蒂，灭魄返安魂。 得悟长生路，须开久视门。 全真神自化，无上法王尊。 三洞赞颂灵章卷中 三洞赞颂灵章卷下 三契颂 元始洞空无，三气精上门。 紫容焕太空，四明植灵根。 妙化发东琼，三便启西昆。 皓映九玄清，五华带锦云。 离罗焕神灯，七星曜北元。 飘飘上清畿，翼翼帝一尊。 落落高上章，羽童何纷纷。 流香本无色，洞入万仙群。 左回三流劫，右输万天关。 云华缨玉云，八凤舞空转。 四时无停机，青白早分明。 九九改劫运，三三度一椿。 天地有终会，否激归在旛。 洞明正一法，严终六天文。 太平反空无，奉翼后圣君。 灵风起西门，锦云生东琼。 二气焕玉洲，流香乘烟轻。 五华披风散，倏忽朗九清。 骞林曜朱日，黄华逐月生。 中有采芝童，衣羽带飞青。 飙景万岭峰，逍遥宴绿軿。 总御九空输，运开无稽程。 左命三天文，右摄六天兵。 检气反空洞，天度应运倾。 劫运自有会，谁测败与成。 洪波沦云纲，六合无遗形。 白尸飘长流，孤魂因复零。 悲此去来际，方觉正法明。 至学加精修，束华结琼名。 欣有白简人，相与乐太平。 洞关运天纲，五气转三微。 紫户吐琼简，金门纳神晖。",
      "translated_text": "Within lies the true Dharma-realm,\nIts essence merges with the Great Void.\nClouds still, the toad’s light reveals,\nThe pool so clear, white silk unfurls.\n\nSuch manifest signs—where seek another path?\nIn silent illumination, all things observed:\nHow could the myriad spirits differ?\nIn shared truth, none can be seen,\nBeyond all traces, none can imitate.\n\nThe elder in the hall, clear and bright,\nRests beyond all dharma—nothing more.\nMysterious, mysterious, mystery dissolved,\nThe eight directions stretch unbounded.\nThe vast expanse of true emptiness revealed,\nLooking back—no single thing remains.\n\nFused as the great desert,\nProfoundly still, its nature is void.\nLuminous and ever-silent,\nPerfectly penetrating, its nature flows free.\nWithin and without as one,\nNot returning to the primal origin.\n\nWhen the mind is empty of things,\nEven \"nothingness\" is truly nothing.\nWhy labor to dispel delusion?\nWhat need to discern fine from coarse?\n\nFrom stillness and emptiness, skill arises,\nReturning to truth, unwavering.\nSuch subtle messages—who dares name or shape them?\nAll dharmas are inherently empty,\n\"Nothingness\" and \"nothingness\" unite in sacred work.\n\nProfoundly serene, neither within nor without,\nSilent, east and west dissolve.\nWhere mind and realm both forgotten,\nSquare and round become one.\n\nVast and obscure, beyond creation,\nAll things freely pass through.\nProvisional stillness serves as body,\nYet one must still remove the roots of desire.\nWhen conditions are forgotten, thus stilled,\nTrue stillness renews itself.\n\nAccord with the unborn dharma,\nOnly then does one know the spring of endless day.\nAlone transcending heaven and earth,\nFreely at ease, unbounded.\nOnce settled, one reaches true constancy,\nThe spirit’s light beyond all measure.\n\nIlluminating the chamber of the three poisons,\nPiercing the halls of the five luminaries.\nThe jewel moon shines in the clear sky,\nDeluded clouds vanish in an instant.\nThe pure wind spreads its message,\nResponding to things, it unfolds at will.\n\nThrough endless kalpas, ever perfected,\nNeither darkness nor light.\nThe Valley Spirit remains eternally still,\nThe Dharma-ocean serene and clear.\n\nRight mindfulness enters the true path,\nA settled mind attains the wondrous course.\nForever freed from the bonds of birth and death,\nThe three realms stretch wide for wandering.\n\nHaving stilled sound and trace,\nDeeply penetrating the profound principle:\nTrue emptiness—can it be attained?\nTrue form requires no cultivation.\n\nLet eating and pecking pass as they may,\nDignity and conduct follow freely.\nSuddenly, all deliberation ceases,\nIn tranquility, wholeness is preserved.\n\nTo awaken the transformation of beings,\nAll manifold pursuits must be relinquished.\nInstantly transcending the fruit of no-leakage,\nHow could there be any root or cause?\n\nGrasping and rejecting cannot move it,\nCauses and conditions too are cut off.\nIn a flash, all is let go—\nThe sacred path may then be transmitted.\n\nThe superior person knows no contention,\nDiligently and constantly holds firm resolve.\nDwelling in truth, ever at ease,\nCultivating simplicity, hidden in profound mystery.\n\nLooking up and down, observing heaven’s principle,\nThrough prosperity and adversity, penetrating the depths of the Dao.\nAlas for those who remain unenlightened,\nCompeting in dharmas, their minds obscured.\n\nVirtue’s transformation seeks no reward,\nGrace is wide—how could one be proud?\nConcealing one’s light, treasuring great capacity,\nThe bright nature shines like solid ice.\n\nSilently in accord with the high and distant,\nDeeply penetrating the vastness of the supreme Dao.\nHow could it resemble the foolish who cling,\nForcing distinctions, boasting of their abilities?\n\nMost beings turn from the Dao,\nInverted, seeking outside.\nDelusion arises from this,\nThe true spirit obscured and lost.\n\nOriginally lacking nothing,\nWhy forcefully cling to cultivation?\nWith a sudden sweep, the clouds of delusion disperse,\nThe silver toad shines upon the jade tower.\n\nScheming arises from delusion,\nDeparting from truth disturbs the spirit.\nAll because the mind harbors love and desire,\nAttaching to things, giving rise to greed and anger.\n\nEver harboring the fire of ignorance,\nAdding the dust of affliction.\nFrom this, retribution is received,\nRevolving through the six paths in suffering.\n\nFrom delusion arise anger and desire,\nGreed and ignorance become obstacles.\nSorrow and worry bind endlessly,\nAfflictions coil without cease.\n\nThus the true Dao is obscured,\nFrom this, karmic transgressions arise.\nTurning the light inward in reflection,\nOne awakens to the wondrous within.\n\nAfflictions arise from thoughts—\nWhen has one ever awakened to one’s own mind?\nVast and confused, suffering humiliation,\nDisturbed and restless, unwilling to reflect.\n\nDying in vain without respite,\nLiving emptily until now.\nThus the true Dao is lost,\nDreams and illusions encroach.\n\nIf one connects with heaven and earth,\nAll are sustained by the Dao’s qi.\nHiding the root, deepening the stem,\nExtinguishing the poisons, returning the hun to peace.\n\nHaving awakened to the path of long life,\nOne must open the gate of enduring vision.\nPreserving truth, the spirit transforms itself,\nThe supreme Dharma King is revered.\n\n---\n\n**The Three Caverns’ Hymns of Praise, Scroll the Middle**\n**The Three Caverns’ Hymns of Praise, Scroll the Lower**\n**The Three Contracts’ Hymns**\n\nThe Primordial Cavern of Empty Nothingness,\nThe three qi refine the upper gate.\nPurple radiance illumines the Great Void,\nThe four luminaries plant the spiritual root.\n\nWondrous transformation arises in the eastern jade,\nThe three conveniences open the western Kunlun.\nResplendent, shining upon the nine mysteries,\nThe five flowers adorn the brocade clouds.\n\nThe net of separation gleams with the divine lamp,\nThe seven stars illuminate the northern origin.\nSoaring, soaring to the upper clear realms,\nWinged, winged—the Emperor Unity is revered.\n\nLofty, lofty the supreme hymn,\nHow the feathered youths swarm!\nFlowing fragrance, originally without color,\nPenetrating the myriad immortals’ throng.\n\nTo the left, circling the three kalpas,\nTo the right, conveying the ten thousand heavens’ gates.\nCloud flowers entwine the jade clouds,\nThe eight phoenixes dance in empty turns.\n\nThe four seasons never cease their mechanism,\nBlue and white are early distinguished.\nNine nines transform the kalpa’s fate,\nThree threes pass through one cosmic cycle.\n\nHeaven and earth have their final meeting,\nYin and yang return to the banner.\nThe Cavern’s clarity of the Orthodox Unity,\nThe solemn end of the six celestial texts.\n\nGreat peace reverts to empty nothingness,\nServing the later sagely lord.\nThe divine wind rises from the western gate,\nBrocade clouds arise in the eastern jade.\n\nThe two qi illumine the jade isles,\nFlowing fragrance rides the light smoke.\nThe five flowers scatter in the wind,\nSuddenly brightening the nine clear realms.\n\nThe soaring forest glows with the vermilion sun,\nYellow flowers follow the moon’s birth.\nWithin, the herb-gathering youths,\nClothed in feathers, girded with flying green.\n\nThe swift light of ten thousand peaks,\nFreely at ease, feasting in the green chariot.\nMastering the nine empty conveyances,\nOpening the boundless course.\n\nTo the left, commanding the three celestial texts,\nTo the right, seizing the six celestial soldiers.\nRegulating qi, returning to empty caverns,\nHeaven’s measures respond to the turning fate.\n\nKalpas have their own meetings—\nWho can fathom defeat or success?\nVast waves engulf the cosmic net,\nThe six directions leave no form behind.\n\nWhite corpses drift in the long flow,\nLonely souls scatter and vanish.\nGrieving this cycle of departure and return,\nOnly then does one perceive the brightness of the true Dharma.\n\nWith utmost study and refined cultivation,\nBinding jade blossoms to form a precious name.\nRejoicing in those of the white tally,\nTogether delighting in great peace.\n\nThe cavern’s gate turns heaven’s net,\nThe five qi revolve the three subtleties.\nThe purple portal emits jade tallies,\nThe golden gate receives the divine radiance.",
      "overlap_context": "e head, one finds the place of awakening,\nReflecting inward, one beholds the King of Emptiness.\nAwakened to all the leaks of dust,\nThe Dao-eye opens clearly.\nForms and sounds are not obstacles,\nKnowledge and perception must be buried.\nWhen the spirit is still, a thousand calamities vanish,\nWhen the mind is empty, ten thousand cares turn to ash.\nThe pure wind passes through the jade door,\nNaturally, sweet sounds arrive.\n\nBeholding all forms as non-form,\nTheir essence is but a kind of nothingness.",
      "start_char": 10852,
      "end_char": 12125,
      "start_sentence": 887,
      "end_sentence": 988,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.59536576271057,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\赞颂类\\三洞赞颂灵章.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "八会交真风，晃朗重冥开。 天际九清外，落落高晨回。 三色返空无，四候应玉畿。 河侯已鼓笔，五行潜相推。 六度无终劫，运极乘气归。 万魔罗天布，群凶竟吐威。 兆人负灾冲，积尸令人悲。 妙哉正法文，履劫明不衰。 至时相奉迎，契在九天扉。 与尔期太平，放身无翮飞。 妙哉三洞响，寥寥何铃铃。 寻声若有无，运之不见形。 响音洞十方，听之不闻声。 大道须入弘，游心归太空。 朝礼运十方，升度乘九龙。 飘飘超三界，亦由云中崇。 吾师天中尊，超超无上皇。 仰观地维表，彷佛紫炎堂。 巍峨玄都室，但见仙人房。 大洞经赞 大洞真经本大乘，渊深蕴奥极玄冥。 十方三世诸仙圣，修习功成达始青。 三洞三乘未易涯，虚皇妙语绝纤瑕。 诸经万法归宗祖，解悟登跻浩劫家。 帝王宰辅及公侯，州牧诸官与庶流。 富贵荣华无别事，总真大洞究玄猷。 缁黄二教若殊途，闻礼闻诗君子儒。 咸可诵持真大洞，先天先地一虚无。 全真学道众王民，万法千门枉用心。 大洞仙经持万遍，虚皇老子自知音。 世间文武及曹僚，娼妓闾阎比比俦。 咸可率心持大洞，罪根削灭与神游。 大洞真诠异众经，登仙入圣谒玄真。 饶经大万尘尘劫，圆证虚皇无上人。 咄哉蠢蠢未明徒，岂识浮黎黍米珠。 大洞度人元一体，等闲平地达玄都。 若欲修行达上乘，争如大洞几篇经。 尽心尽性修身法，悟得高升大有庭。 予因诸子锓斯经，述颂称扬赞此经。 功德巍巍无尽藏，虚皇妙道本无形。 元皇天帝赞 始自苍胡檀炽音，结成云篆度天人。 太玄道父亲求受，下世方闻大洞经。 大地凡夫学悟真，仙源路杳实难寻。 欲知捷径无差错，口诵心持大洞经。 宗祖前生善力轻，今生禄嗣颇艰辛。 祷祈欲得如君意，何似勤看大洞经。 日月无光苦并吞，星辰错度紊天文。 上消天厄宁凡庶，至士同宣大洞经。 旱魃为灾雨若金，虫蝗水涝谷无成。 普教丰稔无饥馑，祈梼全凭大洞经。 工贾农商与四民，贪求不觉业随身。 忙中好割闲心力，习诵文昌大洞经。 府库资财甚满盈，兵戈永息乐升平。 民歌有道图长治，报国勤看大洞经。 社庙神祇与百灵，欲求陛擢盖无因。 迁名善籍增威力，日暮须听大洞经。 眷属宗亲父母魂，久留地府不超升。 欲思荐拔缘无力，斋戒勤看大洞经。 冢讼征呼累后人，又兼谴告在天庭。 生生世世遗殃咎，解止宜看大洞经。 或为营修与筑坟，兴工动土犯凶神。 致令宅宇多灾咎，解息宜持大洞经。 行病年王统五瘟，遍州历里害生民。 保全邻族无传染，严洁同看大洞经。 月厄年灾久染身，寻医问卜与求神。 不能解离无门告，命道皈依大洞经。 六类冤亲男女魂，冥冥漠漠在幽阴。 普教受炼生天界，好与频看大洞经。 六道冤家结得深，冤冤相报几时停。 欲令各各生欢喜，除是听闻大洞经。 或为争财或为嗔，一时忿怒叫神明。 结成鬼讼何时了，解雪元非大洞经。 疾病丧亡不离身，官灾盗贼苦侵陵。 财消物散如冰雪，保佑当持大洞经。 木石狐狸猴犬精，抛砖放火现人形。 作威作福求淫祀，殄灭宜看大洞经。 居处山林与僻行，虫蛇狼虎每伤人。 寻声回避无遗毒，住坐留心大洞经。 士子儒生茅塞心，神童应对不聪明。 挥毫欲得如神助，先好常持大洞经。 如幻如泡是此身，炁精神裹好修真。",
      "translated_text": "Eight Gatherings merge with the true wind,\nRadiant and bright, the layered darkness unfurls.\nBeyond the Nine Pures at heaven’s edge,\nLofty and vast, the high morn returns.\n\nThree hues revert to empty nothingness,\nFour seasons respond to the jade precincts.\nThe River Earl has already raised his brush,\nFive phases silently propel one another.\n\nSix Perfections span endless kalpas,\nWhen fate is exhausted, one rides qi to return.\nMyriad demons spread across the heavens,\nHordes of fiends vie to display their might.\n\nMultitudes bear the brunt of calamity,\nPiles of corpses evoke sorrow.\nWondrous indeed is the scripture of the true Dharma,\nThrough kalpas it shines, undiminished in clarity.\n\nAt the destined hour, they shall be welcomed,\nTheir bond lies at the gate of the Nine Heavens.\nWith you I pledge great peace,\nReleasing the self to soar without wings.\n\nWondrous indeed is the resonance of the Three Caverns,\nVast and echoing—how clear the chime!\nSeeking the sound, it seems both present and absent,\nMoved yet unseen in form.\n\nThe echoing tone pervades the ten directions,\nYet when heard, no sound remains.\nThe great Dao must enter the vast,\nThe wandering mind returns to the Great Void.\n\nAt dawn, pay homage across the ten directions,\nAscend and transcend upon the Nine Dragons.\nSoaring beyond the Three Realms,\nOne rises as if amid clouds.\n\nMy master is the Heavenly Venerable,\nTranscendent, the Supreme Emperor.\nGazing upward beyond the earth’s bounds,\nDimly one glimpses the Purple Flame Hall.\n\nTowering is the Chamber of the Mysterious Capital,\nWhere only the abodes of immortals are seen.\n\n---\n\n*The Great Cavern Scripture in Praise*\nThe Great Cavern True Scripture is of the Great Vehicle,\nProfound and abstruse, reaching the utmost mystery.\nAll immortals and sages of the ten directions and three times,\nThrough cultivation and mastery, attain the Primordial Azure.\n\nThe Three Caverns and Three Vehicles are not easily fathomed,\nThe Jade Emperor’s wondrous words are flawless.\nAll scriptures and myriad dharmas return to the ancestral source,\nThrough comprehension, one ascends to the realm of kalpas.\n\nEmperors, ministers, dukes, and lords,\nGovernors, officials, and common folk—\nWealth, honor, and glory are no different,\nAll converge in the Great Cavern to fathom the profound plan.\n\nThe black-robed and yellow-robed teachings may differ in path,\nYet scholars who hear rites and recite poems are noble.\nAll may chant and uphold the True Great Cavern,\nPrimordial Heaven and Earth—one vast emptiness.\n\nThose who study the Complete Perfection and Dao,\nThrough myriad methods and thousand gates, waste their minds.\nChanting the Great Cavern Scripture ten thousand times,\nThe Jade Emperor and Laozi become their true kin.\n\nScholars, warriors, and officials,\nCourtesans, commoners, and all alike—\nAll may follow their hearts to hold the Great Cavern,\nSevering karmic roots to wander with the gods.\n\nThe Great Cavern’s true essence differs from other scriptures,\nAscending as immortals, entering as sages, to meet the Mysterious Perfected.\nThrough countless kalpas as numerous as dust motes,\nOne fully realizes the Jade Emperor as the Supreme Person.\n\nAlas, the foolish and unenlightened,\nHow could they recognize the pearl of Fuli’s millet?\nThe Great Cavern delivers all as one body,\nEffortlessly ascending to the Mysterious Capital.\n\nIf one wishes to cultivate and reach the Supreme Vehicle,\nHow can it compare to the few chapters of the Great Cavern?\nExhausting heart and nature to refine the body’s method,\nThrough realization, one ascends to the Great Abundance Court.\n\nFor the sake of all disciples, I carve this scripture,\nComposing hymns to praise and extol it.\nIts merit is towering, an inexhaustible treasury,\nThe Jade Emperor’s wondrous Dao is originally formless.\n\n---\n\n*Hymn of the Primordial Heavenly Emperor*\nFrom the beginning, the sounds of Canghu and Tanchi,\nFormed cloud-seals to deliver heaven and humanity.\nThe Great Mystery’s Dao Father sought and received it,\nOnly then was the Great Cavern Scripture heard below.\n\nCommon folk of the earth seek to awaken to truth,\nThe path to the immortal source is distant and hard to find.\nIf one wishes to know the swift and unerring way,\nRecite with the mouth and hold in the heart the Great Cavern Scripture.\n\nAncestral merits from past lives were slight,\nThus this life’s blessings and descendants are meager.\nIf one prays to attain one’s desires,\nHow can it compare to diligently studying the Great Cavern Scripture?\n\nSun and moon lose their light, suffering engulfment,\nStars and constellations fall into disarray, disrupting celestial patterns.\nTo dispel heaven’s calamities and pacify the common folk,\nThe wise together proclaim the Great Cavern Scripture.\n\nDrought demons bring disaster, rain falls like metal,\nLocusts, floods—no harvest is reaped.\nTo universally ensure abundance without famine,\nPrayers rely entirely on the Great Cavern Scripture.\n\nMerchants, artisans, farmers, and traders—all four classes,\nGreedily seeking, unaware of karma clinging to them.\nAmid busyness, spare a moment’s mind and strength,\nTo recite the Wenchang Great Cavern Scripture.\n\nTreasuries overflow with wealth,\nWeapons forever stilled in peaceful ascent.\nThe people sing of virtuous governance, longing for stability,\nIn gratitude, diligently study the Great Cavern Scripture.\n\nEarthly deities, spirits, and all numina,\nSeeking promotion yet lacking cause—\nTo advance in the register of good deeds and amplify power,\nAt dusk, one must heed the Great Cavern Scripture.\n\nKinsfolk, ancestors, and parents’ souls,\nLong detained in the underworld, unable to ascend—\nIf one wishes to deliver them yet lacks the means,\nObserve fasts and diligently study the Great Cavern Scripture.\n\nLawsuits and summons burden descendants,\nDivine reprimands weigh upon the heavenly court.\nThrough generations, misfortunes linger—\nTo resolve them, one should study the Great Cavern Scripture.\n\nWhether building or constructing tombs,\nBreaking ground may offend malevolent spirits.\nCausing one’s dwelling to suffer misfortunes—\nTo pacify them, one should hold the Great Cavern Scripture.\n\nThe Yearly King of Epidemics governs the Five Pests,\nSpreading through states and villages, harming the people.\nTo protect one’s neighbors from contagion,\nMaintain purity and together study the Great Cavern Scripture.\n\nMonthly and yearly calamities long afflict the body,\nSeeking doctors, divination, and gods—\nUnable to escape, with no recourse—\nEntrust one’s fate to the Great Cavern Scripture.\n\nSix kinds of karmic foes—male and female souls,\nDim and obscure in the netherworld’s gloom—\nTo universally refine and ascend to heavenly realms,\nOften study the Great Cavern Scripture.\n\nKarmic enemies of the Six Paths are deeply entangled,\nVengeance upon vengeance—when will it end?\nIf one wishes each to rejoice,\nOnly through hearing the Great Cavern Scripture.\n\nWhether over wealth or wrath,\nIn a moment of fury, one invokes the gods—\nForming ghostly lawsuits, when will they cease?\nOnly the Great Cavern Scripture can dissolve them.\n\nIllness, death, and loss never leave the body,\nOfficial misfortunes, bandits, and suffering press in.\nWealth dissipates, possessions scatter like ice and snow—\nFor protection, one should hold the Great Cavern Scripture.\n\nWood, stone, fox, monkey, and dog spirits,\nHurling bricks, setting fires, appearing in human form—\nExerting power, seeking lewd sacrifices—\nTo eradicate them, study the Great Cavern Scripture.\n\nDwelling in mountains, forests, or secluded paths,\nSnakes, wolves, and tigers often harm people—\nHearing the sound, they retreat without trace—\nStay and sit, keep the Great Cavern Scripture in mind.\n\nScholars and literati with minds blocked like thatch,\nDivine youths falter in response, lacking wisdom.\nTo wield the brush with divine aid,\nFirst, cherish and constantly hold the Great Cavern Scripture.\n\nThis body is like illusion, like a bubble,\nWithin qi and spirit, refine the true.",
      "overlap_context": "pses drift in the long flow,\nLonely souls scatter and vanish.\nGrieving this cycle of departure and return,\nOnly then does one perceive the brightness of the true Dharma.\n\nWith utmost study and refined cultivation,\nBinding jade blossoms to form a precious name.\nRejoicing in those of the white tally,\nTogether delighting in great peace.\n\nThe cavern’s gate turns heaven’s net,\nThe five qi revolve the three subtleties.\nThe purple portal emits jade tallies,\nThe golden gate receives the divine radiance.",
      "start_char": 12125,
      "end_char": 13446,
      "start_sentence": 989,
      "end_sentence": 1070,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.369009017944336,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\赞颂类\\三洞赞颂灵章.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "保全形命同天在，熟玩文昌大洞经。 莫恃家豪积万金，天司夺禄易危倾。 有时正好修功德，割己刊行大洞经。 一片真心达上清，感通得授自三神。 此身位证天尊果，只为勤看大洞经。 听我重言大洞经，斯文玄奥果难名。 无边功德莫思议，普劝凡夫不可轻。 元始天王说大乘，有缘方遇此尊经。 若能终始勤修诵，共作文昌一会人。 开度法轮愒颂 吾开八门，中有玉城。 七宝琼林，无根而生。 金条穿互，荫映上清。 开度法轮，通真达灵。 上无不照，下无不明。 见有道士，晨夕诵经。 长斋幽阜，不倦昼冥。 切栢中餐，素水兼。 躬师受法，时刻不倾。 单景岩穴，独宿孤征。 与鹿为群，倚林栖形。 穷兽对蹲，飞乌哀呜。 风云凄切，万枯沈零。 凝冰填涧，素雪翳庭。 寒疠切肌，执志殊精。 契阔林岫，难苦备婴。 劳不敢倦，极不敢宁。 展转求道，遂感皇情。 丹书绿字，列图玄名。 神仙羽服，锦裙飞青。 郁然而降，焕落火铃。 流霞丹舆，三素飞軿。 入我八门，乃知死生。 皆由积行，苦哉有情。 灭度行业颂 法轮开灭度，死生从愿回。 积基有明报，祸福更相摧。 世眼求前生，达士希后归。 前生功未满，故致福报迟。 藉先劝来行，功备形自飞。 前世十方仙，历劫乃入微。 吾观至学士，乃不领人怀。 勤行奉师宝，师佑福巍巍。 轻师失吾宝，先功永无施。 劝诫成尔真，三师度玄扉。 若能体道真，法轮洞自开。 莫见此寂寂，幽冥中甚微。 命根未尽偈颂 转轮空洞魂，灭度更死生。 罪福各有对，吉凶无偏婴。 得道行所致，缘尔先身精。 行恶招斯酷，流曳五苦庭。 天地虽悠悠，玄鉴理甚明。 吾历观汝辈，从师受吾经。 得经叛汝师，嫉争功名。 轗轲不自咎，沿路吐怨声。 致使六部司，执笔紏尔形。 命灭负刀山，苦恼身是婴。 往反三涂中，岂觉形与名。 化为六畜群，望反其冥冥。 法轮有常运，去留无稽停。 哀此祸福无，受报不贾生。 念汝不知命，发颂为伤情。 思念转神偈颂 妙通转我神，弘普无量功。 道成天地劫，轮化发九重。 灭度更死生，缘对各有宗。 孰悟去来因，形魂无始终。 积庆籍福基，身拔五难峰。 脱离三恶道，萧萧入闲空。 念度无边境，思定感神通。 法转三度场，转成高仙公。 回我大椿步，飘升太极宫。 宿命因缘颂 不杀得长寿，无痛常离苦。 一切受天位，身安得所怙。 不盗常清贵，自然钱财聚。 七宝为宫殿，欢乐当安人。 不淫则不乱，身体常洁清。 所生当端正，行德自聪明。 不欺口气香，言语常忠贞。 所说出元道，谈论使功成。 滴酒不过口，无有谬误事。 常愿见华实，得使天人侍。 寿终升天堂，二十五神迎。 万神自来降，光影恒煌煌。 布施得大福，钱财自然来。 所生常尊贵，传世受欢欣。 持戒常敦敬，奉受於九尊。 精敬不犯恶，保得身长存。 忍辱谦下人，嗔怒不形口。 骂詈忍不应，禄寿常自然。 精进不怠懈，念道常得真。 所行合於道，寿终为天人。 念真心不退，忠信不妄言。 供养诸道德，所生无艰难。 能行此六善，辄得生为人。 面色端且正，自然成贵身。 悭贪不布施，私窃不养亲。 藏财贪妄贵，不救老穷人。 妻子及下使，不衣视饥寒。 端坐守财物，殁为饿鬼残，身不见饱足，苦毒生疮瘢。 东西乞不得，家族悉灭殚。",
      "translated_text": "To preserve one’s form and life as long as heaven endures,\nDiligently study and ponder the Wondrous Cavern Scripture of Wen Chang.\n\nDo not rely on vast wealth amassed by noble houses—\nHeaven’s decree may strip your blessings, leaving you perilously inclined.\nWhen the time is ripe to cultivate merit and virtue,\nSacrifice your own to print and circulate the Great Cavern Scripture.\n\nWith a heart of pure sincerity reaching Shangqing,\nOne’s devotion moves the Three Spirits to bestow their grace.\nThis body ascends to the rank of Heavenly Worthy—\nAll because of steadfast study of the Great Cavern Scripture.\n\nHear again the words of the Great Cavern Scripture:\nIts profound and wondrous text defies all naming.\nBoundless merit, beyond all reckoning—\nI urge all mortals: do not treat it lightly.\n\nThe Primordial Heavenly King expounded the Great Vehicle,\nAnd only those with karmic affinity encounter this sacred scripture.\nShould one persist in diligent recitation from beginning to end,\nThey shall join the assembly of Wen Chang.\n\n**Opening the Dharma Wheel: A Hymn of Praise**\n\nI open the eight gates,\nWithin lies a jade city.\nSeven-jeweled forests of jasper,\nRootless yet flourishing.\nGolden boughs intertwine,\nShading and illuminating Shangqing.\nThe Dharma Wheel of Liberation turns,\nConnecting the true and reaching the numinous.\nAbove, nothing remains unilluminated;\nBelow, nothing stays obscure.\n\nBehold the Daoist,\nReciting scriptures from dawn to dusk.\nPersevering in long fasts and secluded groves,\nUnwearied through day and night.\nPartaking only of cypress berries at noon,\nWith pure water and simple fare.\nPersonally receiving the master’s teachings,\nUnswerving in every moment.\n\nDwelling in solitary cliffs and caves,\nJourneying alone through desolate paths.\nForming herds with deer,\nResting body against the forest.\nFacing wild beasts in stillness,\nWhile birds cry mournfully above.\nWind and clouds wail in sorrow,\nTen thousand withered things sink into decay.\nIce congeals and fills the ravines,\nWhite snow blankets the courtyard.\nCold plagues pierce the flesh,\nYet resolve remains unshaken.\nBound to the mountains and peaks,\nEnduring every hardship.\nNever yielding to toil,\nNever seeking rest.\nTurning ceaselessly in pursuit of the Dao,\nAt last moving the imperial heart.\n\nCinnabar script in green characters,\nCelestial charts bearing mysterious names.\nDivine immortals in feathered robes,\nJade skirts shimmering in flight.\nDescending in radiant splendor,\nAdorned with fiery bells.\nA chariot of flowing rosy clouds,\nA three-fold celestial carriage soaring.\nEntering my eight gates,\nOne comes to know life and death—\nAll determined by accumulated deeds,\nAlas, for the sentient beings!\n\n**Hymn on the Extinction of Karma Through the Turning Wheel**\n\nThe Dharma Wheel turns, extinguishing karma,\nLife and death bend to one’s will.\nAccumulated deeds yield clear retribution,\nFortune and misfortune ever alternating.\n\nThe worldly seek their past lives,\nThe enlightened aspire to future returns.\nIf past merits remain unfulfilled,\nBlessings will come, though delayed.\n\nBuilding upon past exhortations for future deeds,\nOnce merits are complete, the form ascends of itself.\nImmortals of the ten directions in past lives,\nThrough eons, entered the subtle.\n\nI observe the most devoted scholars,\nYet they fail to embrace others’ hearts.\nDiligently serving the master’s treasure,\nThe master’s protection brings towering blessings.\n\nDisrespecting the master loses this treasure,\nAll prior merits vanish without effect.\nI urge you to perfect your true nature,\nThe Three Masters guide you through the mystic gate.\n\nIf you embody the true Dao,\nThe Dharma Wheel’s cavern opens of itself.\nDo not see this as mere stillness—\nWithin the hidden depths, it is most profound.\n\n**Hymn on the Root of Life Before Its End**\n\nThe Wheel turns through the empty void,\nExtinguishing karma, transforming life and death.\nSin and blessing each have their counterpart,\nFortune and misfortune cling without bias.\n\nAttaining the Dao comes from one’s deeds,\nTied to the essence of past lives.\nEvil deeds summon cruel retribution,\nDragging one through the five courts of suffering.\n\nThough heaven and earth stretch endlessly,\nThe mirror of the profound sees all clearly.\nI have observed your kind,\nReceiving my scriptures from your master.\n\nYet having gained the scriptures, you betray your master,\nConsumed by envy, vying for merit and fame.\nStumbling without self-blame,\nVoicing grievances along the way.\n\nThis compels the Six Departments to act,\nWielding their brushes to record your form.\nWhen your life ends, you bear the Knife Mountain,\nSuffering torment, your body its victim.\n\nTraversing the Three Wretched Paths,\nDo you yet perceive your form and name?\nTransformed into herds of the six beasts,\nYearning to return to the unseen.\n\nThe Dharma Wheel turns ceaselessly,\nComing and going without pause.\nAlas for the law of cause and effect—\nRetribution comes without delay.\n\nPitying your ignorance of fate,\nI compose this hymn in sorrow.\n\n**Hymn on Turning the Spirit Through Reflection**\n\nSubtly I turn my spirit,\nSpreading boundless merit.\nThe Dao accomplished through eons of heaven and earth,\nThe Wheel’s transformations unfold through nine realms.\n\nExtinguishing karma, transforming life and death,\nEach cause and effect has its origin.\nWho awakens to the reasons for coming and going?\nForm and soul have no beginning or end.\n\nAccumulated blessings build the foundation of fortune,\nLifting the body from the five peaks of peril.\nFreed from the Three Evil Paths,\nOne enters the serene emptiness.\n\nContemplating liberation across boundless realms,\nMeditation stirs divine resonance.\nThe Dharma turns in the threefold arena,\nTransforming one into a lofty immortal lord.\n\nI retrace my steps of the great *chun* tree,\nSoaring into the Palace of the Supreme Ultimate.\n\n**Hymn on Past-Life Karmic Conditions**\n\nRefraining from killing brings long life,\nFree from pain, ever apart from suffering.\nAll receive heavenly rank,\nBody at peace, finding support.\n\nRefraining from theft ensures purity and nobility,\nWealth and treasure naturally gather.\nSeven-jeweled palaces arise,\nJoy and contentment bring peace to others.\n\nRefraining from lewdness prevents disorder,\nThe body remains ever pure and clean.\nOffspring are upright and proper,\nVirtuous conduct brings wisdom.\n\nRefraining from deceit keeps the breath fragrant,\nWords remain loyal and steadfast.\nSpeech issues from the primordial Dao,\nDiscourse brings merit to fruition.\n\nNever letting wine pass the lips,\nNo errors or misdeeds arise.\nEver wishing to see blossoms and fruit,\nOne gains the service of heavenly beings.\n\nAt life’s end, ascending to heaven,\nThe twenty-five spirits come to welcome.\nCountless spirits descend of themselves,\nRadiant light ever resplendent.\n\nPracticing generosity brings great fortune,\nWealth and treasure come naturally.\nOffspring are ever noble,\nTransmitting joy through generations.\n\nUpholding precepts with reverence,\nHonoring the Nine Worthies.\nDevout and free from evil,\nOne preserves the body’s longevity.\n\nPracticing patience and humility,\nAnger never escapes the mouth.\nEnduring insults without response,\nBlessings and long life come naturally.\n\nDiligence without laziness,\nContemplating the Dao, one attains truth.\nDeeds aligning with the Dao,\nAt life’s end, one becomes a heavenly being.\n\nUnwavering in true devotion,\nLoyal and truthful, never deceitful.\nHonoring all virtuous ones,\nLife knows no hardship.\n\nThose who practice these six virtues\nAre reborn as humans.\nFaces upright and proper,\nNaturally becoming noble.\n\nStinginess without generosity,\nHoarding wealth, neglecting kin.\nGreedily coveting false honor,\nFailing to aid the old and poor.\n\nWives, children, and servants,\nLeft unclothed, starving in cold.\nSitting idly guarding wealth,\nAt death, one becomes a hungry ghost,\nBody never sated,\nSuffering sores and scars.\nBegging in vain from east to west,\nThe family perishes entirely.",
      "overlap_context": "rn Scripture.\n\nDwelling in mountains, forests, or secluded paths,\nSnakes, wolves, and tigers often harm people—\nHearing the sound, they retreat without trace—\nStay and sit, keep the Great Cavern Scripture in mind.\n\nScholars and literati with minds blocked like thatch,\nDivine youths falter in response, lacking wisdom.\nTo wield the brush with divine aid,\nFirst, cherish and constantly hold the Great Cavern Scripture.\n\nThis body is like illusion, like a bubble,\nWithin qi and spirit, refine the true.",
      "start_char": 13446,
      "end_char": 14698,
      "start_sentence": 1071,
      "end_sentence": 1173,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.169456481933594,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\赞颂类\\三洞赞颂灵章.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "造作弄口舌，生死被剥残。 洋铜灌其口，拔舌过身半。 沃口强令咽，入腹肠胃烂。 生时不念善，死没被涂炭。 疽恶轻凌人，被考数万年。 罪毕后身出，便为下贱人，元恶好杀害，盗窃反强梁。 形残入地狱，万劫被灾殃。 常行盗窃心，负债不肯还。 杀生好田猎，非法作俗绿。 执行无诚信，小言辄恚嗔。 罪恶不自觉，好邪不信真。 后生堕畜生，牛羊驴马类。 臭恶恒负重，如是拷万劫。 内淫犯干逆，雷电所槌杀。 死没地狱中，倒悬被火焠。 弄口谤真道，后生极苦难。 洋铜灌其口，常抱饥且寒。 布施常不惜，普济令众安。 即身受清贵，世得见升仙。 供养好道德，斋戒见真灵。 静念心不懈，七祖升天堂。 忍辱无嗔怒，生辄得正端。 学问好道德，得为人中尊。 行心能柔和，谦节下於人。 救急度危厄，克得延命长，敬奉灵宝戒，明练九宫道，委心信虚无，寿与天同老。 正有痴愚者，骄慢於二亲，无有恭恪心，后生卑贱人。 见宝不恭礼，违突於长者，执行不慈孝，后生为奴婢，衣食仰於人，驱打无昼夜，受生恒苦恼，死不得免度。 放荡好淫色，至不信鬼神，后生受饥冻，所作逢艰难。 负债反咒诅，贫苦骂先祖，后生作牛羊，为人所困苦。 笃信好生道，慈心常哀哀。 素餐身清洁，化后登天机。 恭奉於三宝，不骄於二亲。 至诚不欺诈，是行忠孝人。 谨口不妄语，行心周一切。 劝人远罪目，念法不违戾。 周穷救危急，功德甚难重。 增算益年寿，终身受欣泰。 结友行义弘，相敬如父母。 闭恶扬善德，孝悌感神灵。 欺诈好妄语，常无至信诚。 心口自相反，恒受秽辱形。 悖恶好诽谤，死落地狱中。 洋铜灌其口，苦毒长冥冥。 湎酒好骂晋，不信有鬼神。 铁钩着其舌，痛恼当可言。 脱当生人中，口气常腥臭。 为人所憎恶，众灾所克注。 恶念常遭逢，所向遇罪刑。 无端横婴罗，痛毒靡不经，死复还地狱，后身作畜生。 展转五毒中，愁恼憀辱生。 奉敬归三德，宣化劝善事。 愿得见仙贤，长得真人至。 愿抚一切贤，与我等无异。 吾我心平蠲，练练道百诫。 昼夜勤修学，智慧为天人。 尹生西地化，普使知道真。 笃好思仙真，积念无不同。 先愿升虚游，上与希微通。 积善不厌多，布惠勿吝惜。 功德感仙真，自然降丹药。 冲妙先生朝天赞颂 上帝降命，圣算绵长。 金枝挺秀，玉叶弥芳。 五星顺序，七曜垂芒。 赫赫煌煌，空洞灵章。 福我圣皇，宝祚无疆。 天清地宁，万宇辉光。 西灵圣母，贵曳璚琚。 鸾台凤阁，密从宸舆。 虹光贯斗，月莹太虚。 穆清宫禁，永镇天居。 挺秀雍熙运，日奉至尊前。 身居龙凤阙，名籍继诸仙。 烧香谢天荫，长诵希夷篇。 千生臻百福，列位清微天。 永处逍遥境，长享福自然。 天生明哲，来赞昌期。 冰棱玉峭，凤质鸾姿。 燮调元化，力赞雍熙。 农歌绿野，兵戢四夷。 长臻五福，永集天祺。 涣赫空洞章，灵音震九天。 至真开宝蕴，传受希夷篇。 宝偈今仍过，灵文拔祖先。 救度长夜魂，上登朱陵天。 虔心尊所奉，朝谢虚皇前。 玉帝宣天旨，普放幽夜魂。 八难俱解释，五道悉开通。 酆都绝报对，上朝朱陵宫。 群生悟至道，永享福无穷。 玉京元始尊，生成万化主。 灵文告三官，下开九幽府。 酆都炎镬狱，慈悲洒法雨。",
      "translated_text": "Those who craft deceit with their tongues,\nIn life and death are flayed and maimed.\nMolten bronze poured down their throats,\nTongues torn out, extending past their waists.\nForced to swallow, searing their mouths,\nTheir bellies and bowels rot within.\nLiving without thought of goodness,\nIn death, they are plunged into ash and charcoal.\n\nThose who scorn and slight others,\nAre tortured for ten thousand years.\nOnce their sins are exhausted and they emerge,\nThey become the lowliest of men.\n\nThe utterly wicked delight in killing,\nStealing, and acting as violent brigands.\nMaimed, they enter hell,\nSuffering calamity for ten thousand kalpas.\n\nThose who habitually harbor thieving hearts,\nRefusing to repay debts,\nWho kill for sport and hunt in the fields,\nOr commit unlawful acts in vulgar ways,\nWho act without sincerity or trust,\nAnd fly into rage at the slightest word—\nUnaware of their own sins,\nPreferring falsehood over truth—\nAre reborn as beasts,\nAs oxen, sheep, donkeys, or horses.\nStinking and foul, they bear heavy burdens,\nThus tormented for ten thousand kalpas.\n\nThose who commit incest or violate filial bonds,\nAre struck down by thunder and lightning.\nIn death, they fall into hell,\nHung upside down, scorched by fire.\n\nThose who slander the true Dao with their tongues,\nFace extreme suffering in their next life.\nMolten bronze poured down their throats,\nThey endure constant hunger and cold.\n\nThose who give alms without reluctance,\nRelieving all to bring peace,\nAttain purity and nobility in this life,\nAnd in the world, ascend as immortals.\n\nThose who honor virtue and power,\nObserve fasts, and behold true spirits,\nWho meditate with unwavering hearts,\nSee their seven generations rise to heaven.\n\nThose who endure insults without anger,\nAre born upright and proper.\nThose who study and cherish virtue,\nBecome the most honored among men.\n\nThose whose hearts are gentle and yielding,\nHumble and deferential to others,\nWho rescue others from peril,\nExtend their own lives.\nThose who reverently uphold the Precious Precepts,\nMaster the Nine Palaces’ Dao,\nAnd wholeheartedly trust in the Void,\nLive as long as heaven itself.\n\nYet there are the foolish and ignorant,\nArrogant and disdainful toward their parents,\nLacking reverence and respect—\nThey are reborn as lowly men.\n\nThose who see treasures yet fail to bow in reverence,\nWho defy and offend their elders,\nWho act without kindness or filial piety,\nAre reborn as slaves and servants,\nDependent on others for food and clothing,\nDriven and beaten day and night,\nSuffering endless torment in life,\nWith no escape even in death.\n\nThose who indulge in lust and debauchery,\nWho disbelieve in spirits and gods,\nAre reborn to endure hunger and cold,\nTheir every endeavor beset by hardship.\n\nThose who default on debts yet curse,\nWho in poverty revile their ancestors,\nAre reborn as oxen or sheep,\nTormented and oppressed by men.\n\nThose who firmly believe in the Way of Life,\nWhose compassionate hearts are ever sorrowful,\nWho eat plainly and keep their bodies pure,\nAscend to heaven after transformation.\n\nThose who reverently honor the Three Treasures,\nWho are not arrogant toward their parents,\nWho are utterly sincere and never deceitful,\nAre the truly loyal and filial.\n\nThose who guard their tongues from false speech,\nWhose hearts encompass all,\nWho urge others to shun sin,\nAnd meditate on the Dharma without transgression,\nWho aid the destitute and rescue the imperiled—\nTheir merit and virtue are weighty indeed.\nTheir years and lifespan increase,\nAnd they enjoy joy and peace all their lives.\n\nThose who befriend others with magnanimity,\nRespecting one another as parents,\nWho suppress evil and extol virtue,\nWhose filial piety and brotherly love move the gods—\nSuch men are true.\n\nThose who deceive and lie,\nLacking all sincerity,\nWhose hearts and words contradict,\nEndure filth and disgrace in life.\nThose who are perverse and delight in slander,\nFall into hell at death.\nMolten bronze poured down their throats,\nTheir suffering endless in the dark.\n\nThose who drown in wine and hurl curses,\nWho disbelieve in spirits and gods,\nHave their tongues hooked with iron,\nTheir pain and torment beyond words.\nIf they are reborn among men,\nTheir breath is forever foul and rank,\nHated by all,\nBeset by misfortunes.\nEvil thoughts constantly befall them,\nWherever they turn, they meet punishment.\nWithout cause, they are ensnared,\nEnduring every kind of agony.\nIn death, they return to hell,\nAnd in their next life, become beasts,\nTrapped in the Five Poisons’ cycle,\nWhere sorrow, torment, and shame arise.\n\nThose who honor and return to the Three Powers,\nWho preach and urge good deeds,\nWish to behold immortals and sages,\nAnd welcome true beings to come.\nThey wish to embrace all the worthy,\nMaking them equal to themselves.\nWith hearts serene and purified,\nThey refine themselves through the Hundred Precepts.\nDay and night, they diligently cultivate and study,\nTheir wisdom making them heavenly beings.\n\nYin was transformed in the Western Land,\nUniversally guiding all to know the true Dao.\nFirmly devoted to contemplating immortals,\nTheir thoughts accumulate without difference.\nFirst, they wish to ascend and wander the Void,\nCommuning with the subtle and imperceptible.\n\nAccumulate goodness without tiring,\nBestow kindness without reluctance.\nMerit and virtue move the immortals,\nWho naturally bestow the Elixir.\n\n*Ode to the Supreme by Master Chongmiao*\n\nThe Emperor receives Heaven’s mandate,\nHis sacred lifespan everlasting.\nGolden branches flourish,\nJade leaves ever fragrant.\nThe Five Stars follow their order,\nThe Seven Luminaries cast their radiance.\nResplendent and glorious,\nThe numinous verses fill the Void.\nBlessing our sagely emperor,\nHis precious throne boundless.\nHeaven clear, earth tranquil,\nAll realms bathed in light.\n\nThe Sacred Mother of the West,\nAdorned with precious jade,\nAttends the Phoenix Pavilion and Dragon Terrace,\nEver close to the imperial carriage.\nRainbow light pierces the Dipper,\nThe moon gleams in the Great Void.\nThe sacred palace, serene and pure,\nForever guards Heaven’s abode.\n\nFlourishing in this era of harmony,\nDaily she serves before the Most High.\nDwelling in the Dragon and Phoenix Palaces,\nHer name recorded among the immortals.\nBurning incense, she thanks Heaven’s grace,\nForever reciting the *Xiyi* chapters.\nA thousand lives bring a hundred blessings,\nHer place in the Heaven of Pure Tenuity.\nEver abiding in the realm of carefree ease,\nShe enjoys blessings naturally.\n\nHeaven-born wisdom,\nComes to praise this flourishing age.\nLike ice and jade, sharp and pure,\nWith the bearing of phoenix and simurgh.\nHarmonizing the primal transformations,\nShe aids in the era of peace.\nFields sing with verdant growth,\nArms rest from subduing the four barbarians.\nEver attaining the Five Blessings,\nHeaven’s favor eternally gathers.\n\nResplendent, the verses fill the Void,\nTheir numinous sound shakes the Nine Heavens.\nThe Perfected One opens the treasure trove,\nTransmitting the *Xiyi* chapters.\nThe precious gāthā now passes on,\nThe sacred text delivers ancestors.\nRescuing souls from the long night,\nThey ascend to the Vermilion Terrace Heaven.\n\nWith reverent hearts, they honor what they serve,\nGiving thanks before the Void Emperor.\nThe Jade Emperor proclaims Heaven’s decree,\nUniversally releasing souls from the dark night.\nThe Eight Difficulties all dissolved,\nThe Five Paths all opened.\nFengdu’s retribution ceases,\nThey ascend to the Vermilion Terrace Palace.\nAll beings awaken to the supreme Dao,\nForever enjoying boundless blessings.\n\nThe Venerable Original Beginning of Jade Capital,\nLord of creation and myriad transformations,\nReveals the sacred text to the Three Officials,\nOpening the Nine Dark Prisons below.\nIn Fengdu’s cauldrons of flame,\nCompassion showers the Dharma rain.",
      "overlap_context": "ws no hardship.\n\nThose who practice these six virtues\nAre reborn as humans.\nFaces upright and proper,\nNaturally becoming noble.\n\nStinginess without generosity,\nHoarding wealth, neglecting kin.\nGreedily coveting false honor,\nFailing to aid the old and poor.\n\nWives, children, and servants,\nLeft unclothed, starving in cold.\nSitting idly guarding wealth,\nAt death, one becomes a hungry ghost,\nBody never sated,\nSuffering sores and scars.\nBegging in vain from east to west,\nThe family perishes entirely.",
      "start_char": 14698,
      "end_char": 15942,
      "start_sentence": 1174,
      "end_sentence": 1266,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.18985056877136,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\赞颂类\\三洞赞颂灵章.txt",
        "category": "赞颂类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "洗涤诸罪魂，咸皆得超度。 倾心朝太极，玉帝降洪恩。 天符宣地府，开度长夜魂。 幽都解七祖，灵符告三官。 神仙同接引，上朝朱陵天。 永脱罪业根，长享福自然。 金阙大圣主，天地万灵师。 慈悲洒甘露，洗涤诸尘迷。 广演空洞章，徧使悟希夷。 救拔八难苦，抛离五浊泥。 超度六毒海，永谢贪瞋痴。 神仙同接引，逍遥上太微。 玉帝垂灵贶，天宣告万灵。 救拔九幽苦，广演三洞经。 名奏南丹府，魂超北寒庭。 永离炎镬狱，径出冰池城。 神仙同救度，逍遥上太清。 救苦赞 吾师天中救苦尊，常善化形十方界。 以此威光兴大慈，救彼众生无量苦。 九夜重昏幽暗府，普令廓照生光明。 牛头狱卒尽成仙，一切沈魂皆解脱。 四目老翁地只颂 五炁玄元真，演法度迷津。 像外无法像，真中求至真。 迷悟在心悟，心灵法自灵。 神本无所法，生神心自生。 我心若专一，神明随心行。 至理本无说，至道本无言。 有像皆为伪，神灵须我灵。 欲透妙中妙，寂静观内心。 内外无毫滞，透洞心无心。 心已无名像，自然超仙廷。 抱一成真一，逍遥登太清。 血湖真经颂 稽首虚无无上道，慈悲救苦大慈尊。 神光百亿照中昏，遍覆慈云濡法雨。 硖石溟泠无间狱，血湖血海血池盆。 玉箓大赦诸罪魂，解脱沈沦万劫苦。 炼形度命朱陵府，悟道登真众妙门。 巍巍功德难思议，永为众生作慈父。 拔罪心印妙经偈颂 大道澄廓，元理幽深。 先天而生，运化古今。 道无形体，澄滤身心。 不贪不欲，不嗔不淫。 是非莫识，表裹思寻。 身心清诤，烦恼不侵。 无起无灭，冥漠难斟。 湛然空寂，了心无心。 自然合道，众圣来钦。 升朝金阙，游玩骞林。 七祖解脱，永离幽阴。 皆契心印，悟道合真。 念念相继，勿起尘心。 三洞赞颂灵章卷下竟",
      "translated_text": "The myriad sinful souls are cleansed,\nAll attain deliverance and transcendence.\nWith wholehearted devotion they face the Supreme Ultimate,\nThe Jade Emperor bestows boundless grace.\nHeaven’s decree is proclaimed to the earthly prisons,\nOpening the path for souls of the long night.\nThe Nine Dark Halls release the seven generations of ancestors,\nThe sacred talismans notify the Three Officials.\nImmortals together guide them upward,\nAscending to the Vermilion Terrace Heaven.\nForever severed from the roots of karmic transgression,\nThey eternally enjoy the blessings of nature.\n\nThe Great Sage Lord of the Golden Portal,\nMaster of the myriad spirits of Heaven and Earth,\nIn compassion showers the sweet dew,\nWashing away all dust and delusion.\nExpounding the *Kongdong* chapters far and wide,\nUniversally awakening beings to the Mystery of Mysteries.\nRescuing from the Eight Difficulties’ suffering,\nFreeing from the Five Turbidities’ mire.\nDelivering beyond the Sea of Six Poisons,\nForever parting from greed, wrath, and delusion.\nImmortals together guide them upward,\nCarefree they ascend to the Grand Tenuity.\nThe Jade Emperor bestows divine favor,\nHeaven proclaims to the ten thousand spirits.\nRescuing from the Nine Dark Halls’ suffering,\nExpounding the Three Caverns’ scriptures.\nNames recorded in the Southern Cinnabar Palace,\nSouls transcend the Northern Frigid Court.\nForever parted from the cauldrons of flame,\nDirectly emerging from the City of Ice Pools.\nImmortals together deliver them,\nCarefree they ascend to the Grand Purity.\n\n*In Praise of the Deliverer from Suffering*\nOur Master, the Venerable Deliverer from Suffering in Heaven,\nEver skillfully transforms form across the ten directions.\nWith this majestic radiance, great compassion arises,\nRescuing those countless beings from boundless suffering.\nThe Nine Nights’ profound darkness in the gloomy prisons,\nUniversally illumined to generate light.\nThe ox-headed jailers all become immortals,\nEvery sunken soul attains liberation.\n\n*The Hymn of the Four-Eyed Elder*\nThe Five Qi of the Mysterious Origin,\nExpounding the Dharma to cross the ford of delusion.\nBeyond images, no image of Dharma,\nWithin the real, seek the supreme real.\nDelusion and awakening lie in the mind’s awakening,\nThe mind’s numinosity makes the Dharma numinous.\nThe spirit fundamentally has no Dharma to grasp,\nThe mind’s vitality generates the spirit.\nIf my mind is single-minded,\nThe divine luminaries follow the mind’s movement.\nThe supreme principle fundamentally has no discourse,\nThe supreme Dao fundamentally has no words.\nAll images are false,\nThe spirit’s numinosity requires my own numinosity.\nTo penetrate the subtlety within subtlety,\nObserve the inner mind in quiescence.\nWithin and without, no trace of obstruction,\nPenetratingly empty, the mind is no-mind.\nThe mind now free of names and images,\nNaturally transcends the immortal courts.\nEmbracing the One to become the True One,\nCarefree they ascend to the Grand Purity.\n\n*The Blood Lake True Sutra’s Hymn*\nReverently bowing to the formless, supreme Dao,\nThe Great Compassionate Deliverer from Suffering.\nDivine radiance of a hundred billion illumines the central darkness,\nCompassionate clouds universally cover, drenching with Dharma rain.\nThe *Xiashi Mingling* Avīci Hell,\nThe Blood Lake, Blood Sea, and Blood Pool Basin.\nThe Jade Register’s great amnesty for all sinful souls,\nLiberating from the ten thousand kalpas’ suffering of sinking and drowning.\nRefining form and delivering life in the Vermilion Terrace Palace,\nAwakening to the Dao and ascending to the true through the Gates of Myriad Mysteries.\nVast and towering, merits beyond conception,\nForever serving as the compassionate father to all beings.\n\n*The Marvelous Mind-Seal of Deliverance from Sin: Gāthā and Hymns*\nThe Dao is vast and clear,\nThe primordial principle profound and obscure.\nBorn before Heaven, it governs transformations through the ages.\nThe Dao has no form,\nClarifying body and mind.\nNo greed, no desire,\nNo wrath, no licentiousness.\nRight and wrong are not discerned,\nWithin and without, seek and ponder.\nBody and mind pure and serene,\nAfflictions do not invade.\nNo arising, no ceasing,\nAbstruse and unfathomable.\nProfoundly empty and quiescent,\nThe mind is no-mind.\nNaturally in harmony with the Dao,\nAll sages come to revere.\nAscending to the Golden Portal,\nRoaming and playing in the *Qianlin* groves.\nSeven generations of ancestors liberated,\nForever parted from the gloomy darkness.\nAll accord with the mind-seal,\nAwakening to the Dao and uniting with the real.\nThought after thought in succession,\nLet no dust-mind arise.\n\n*The Wondrous Chapters of the Three Caverns’ Hymns of Praise, Scroll the Lower, Concludes.*",
      "overlap_context": "releasing souls from the dark night.\nThe Eight Difficulties all dissolved,\nThe Five Paths all opened.\nFengdu’s retribution ceases,\nThey ascend to the Vermilion Terrace Palace.\nAll beings awaken to the supreme Dao,\nForever enjoying boundless blessings.\n\nThe Venerable Original Beginning of Jade Capital,\nLord of creation and myriad transformations,\nReveals the sacred text to the Three Officials,\nOpening the Nine Dark Prisons below.\nIn Fengdu’s cauldrons of flame,\nCompassion showers the Dharma rain.",
      "start_char": 15942,
      "end_char": 16637,
      "start_sentence": 1267,
      "end_sentence": 1322,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.78939986228943,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\赞颂类\\三洞赞颂灵章.txt",
        "category": "赞颂类"
      }
    }
  ]
}