{
  "source_id": "三论元旨",
  "source_file": "chunked_daozang\\三论元旨.json",
  "total_chunks": 7,
  "total_original_chars": 8619,
  "total_translated_chars": 50745,
  "total_translation_time": 245.80419993400574,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\三论元旨.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**Preface to *The Essential Meaning of the Three Treatises***\n\nThe enlightenment attained through a single realization illuminates even the most obscure depths, while the delusion clung to in a single moment renders all paths foolish. Thus, superfluous growths are maladies of the form, just as deluded thoughts and afflictions are maladies of the mind. When the malady of form is cured, the body finds peace; when the malady of mind is dissolved, the true nature shines forth. To cure the malady of form, one must rely on a skilled physician; to dissolve the malady of mind, one must depend on sublime teachings. The principle of spontaneity is wrought as if by furnace and hammer. Life is finite, and one must wield the skill of a master butcher. Following a luminous teacher, one receives the model; adhering to the model, one moves with the pivot. Relying on the supreme canon as a guide, one forgets the guide and beholds the mystery.\n\nThe dust of the marketplace is dark and murky, causing one to lose the root and stray from the true. When the inner sanctuary is pure and empty, the spirit is whole and the *qi* is wondrous. A whole spirit is the root of long life; wondrous *qi* is the source of immortality. All things, in their great communion, attain realization through cultivation.\n\nFor long have I dwelt among mountains and waters, secluded in quiet retreat, my unwavering heart attuned to the nature of non-action. Serene amid the forests and wilds, my profound intent ever full, I offer these three treatises as a glimpse of one corner. Though the language may seem coarse, the principle is trustworthy. May scholars harbor no doubt, and may their practice yield verification. The great affliction of life and death—who is not grieved by it? I universally exhort those to come to together behold its mystery.\n\n---\n\n**The Essential Meaning of the Three Treatises**\n\n**Chapter One: The Origin of the Dao**\n\nThe origin of the Dao is subtle and profound, the ultimate principle, spiritually responsive and all-pervading, unified in essence yet manifesting in myriad forms. Terms such as non-action, supreme, infinite, boundless, Dao-nature, true nature, inherent nature, mysterious nature, emptiness, spontaneity, emptiness and penetration, liberation, utmost refinement, utmost subtlety, utmost sageliness, utmost truth, purity, clarity, neither birth nor extinction—these many designations, though varied, are without error in principle. All are names for the numinous origin of the perfected ones of the Great Dao. Realization leads to sagehood; delusion binds one to the mundane. Though delusion and realization diverge, how do they differ from the utmost truth?\n\nThe profound and quiescent is not distant; perceiving delusion, one grasps the real. The common people are mired in the delusion of form and color, while the sages expound non-action to dispel their obstructions. They point to the realm of emptiness and nothingness, unfolding the source of the subtle and wondrous. When one comprehends that emptiness and form present no obstacle of attachment, the ever-true nature is revealed.\n\nThus, the *Sutra of the Fundamental Limit* states: \"Because of attachment to nature, one employs expedient means to expound the provisionality of all dharmas. Because of attachment to the provisional, one employs expedient means to expound the emptiness of all dharmas.\" Penetrating the true nature, the true nature flows unimpeded—how could emptiness or the provisional hinder it?\n\nYet without realization, one must still the dust of the world. The utmost refinement cannot be observed through thoughts of form; the utmost profundity cannot be fathomed by superficial emotions. Without clarifying emptiness and purifying thoughts, one cannot preserve the true. Even with vast learning and many approaches, without the illumination of emptiness and quiescence, realization remains unattainable. To perceive form and not return to the spirit—this is the height of delusion. Not comprehending the spirit, how can one truly record it?\n\n---\n\n**Record of Cuiwei Abbey**\n\nThe Daoist Yan Yujing of Cuiwei Abbey in Fuzhou requested that I compose a record of its construction and renovation, following the text of *Record of Cuiwei Abbey* by Lord Wen’an. I had not yet found time to take up my brush, but this spring, while visiting the shrine of the Perfected Lord Wang of Nanfeng, I passed by Cuiwei. Its fertile fields and rich soil, its winding streams and encircling mountains, all layered in verdant hues, stretched sinuously for over ten *li*. The ridges and foothills rose and fell without end—truly a fine place where the vital *qi* of the land converges.\n\nAccording to Lord Wen’an’s record, the mountain of the perfected ones lies at the junction of Yu and Ru, in the southern prefecture of Jinxī. In the first year of the Tianbao era of the Tang (742), a Daoist built a hut at its foot, naming it Valley Grove. In the first year of the Xuanhe era of the Song (1119), it was granted the plaque Cuiwei Abbey. In the second year of the Taiding era of the Yuan (1325), the abbot Zhou Yingti renovated it entirely, and thus the account was written.\n\nOver time, the abbey fell into disrepair, becoming a wasteland of brambles by the end of the Yuan. At the beginning of our dynasty, He of the Later Chariot of Jinxī, a prominent family in the region, invited Luo Zemin, a Daoist from Yanxi Abbey in Nancheng of Yu, to serve as abbot of Yanshou Abbey. His disciples included Xiong Yiqian and Yan Yujing. In the sixth year of the Hongwu era (1373), Yujing petitioned for ordination as a Daoist. In the seventh year (1374), the Ministry of Rites appointed him as a musician in the Court of Imperial Sacrifices. Shortly after, he returned home due to his mother’s mourning. In the eighth year (1375), he resumed his post as a musician. In the twelfth year (1379), he was granted leave to return. Yiqian, meanwhile, resided at the princely residence in Qingzhou. In the seventeenth year (1384), the Daoist registry summoned him to oversee affairs at Cuiwei Abbey.\n\nIn the twenty-second year (1389), Zemin passed away, and Yujing gave him a generous burial. He then led his disciples Huang Yongsu and Li Yongguang in managing both Yanshou and Cuiwei Abbeys. Many halls, corridors, and structures were repaired. In the autumn of the thirtieth year (1397), he built a pavilion atop the mountain, where pines and bamboos grew lush and verdant, naming it Green Waves. He also obtained Lord Wen’an’s record from Li Yincheng of the village, which aligned with his aspirations for expansion and renovation, prompting him to make this renewed request.\n\nI have heard that the numinous traces of ancient immortals and perfected ones are often found in the grandeur of mountains and rivers—what is called \"the land ennobled by the person\" is indeed true. Among the mountains and waters of our prefecture, none surpass those of Yu and Fu, and Cuiwei, which originated in the Tang and flourished in the Song and Yuan, is surely a case of \"a noble land producing outstanding people.\"\n\nTo have one’s name endure in the present age, and to be counted among renowned scholars like Lord Wen’an, is truly splendid. Yujing, with his keen and perceptive nature, excels in playing the *qin* and painting. His renovations and innovations must surpass even those of today. In entrusting him with the affairs of the abbey, the right person has indeed been chosen.\n\nI take no small delight in seeing this endeavor come to fruition and recording it. As for the layout of its mountains, rivers, and temple structures, these have already been detailed in previous records, and I shall not repeat them here.\n\n**Record of the Charitable Ferry**\nNanfeng, once a prefecture, is now the superior county of Yu. Its mountains and waters are lofty and elegant, its people numerous and prosperous, and merchant sails and trading vessels constantly ply its markets. Its roads connect upward to Nanchang, Yuan, and Gan, and downward to Yu, Fu, Min, and Guang. The charitable ferry lies precisely at this vital crossing, where boats cannot but be established.\n\nThe stream lies five *li* from the county seat. Above it rise layered ridges and overlapping peaks, like an encircling belt facing north toward the elegance of Junfeng—this is called Tortoise Mound. During the Chongning era of the Song, the Perfected Lord of the Divine Palace, renowned for his Dao and conduct, was favored by Emperor Huizong. In his later years, he shed his mortal form there, and the auspicious sign of the tortoise further enhanced its fame.\n\nAmong the worthy and good of the county was one Zou Tiebie, who once received the Dao from the Shangguan family. Shangguan was a nephew of the Perfected Lord of the Divine Palace. Later, Zou again encountered the Perfected Lord, who personally transmitted to him its profound mysteries, and his Dao thus flourished. At that time, Wang Zhi, then magistrate of Nanfeng Prefecture, had once studied under Tiebie. During the transmission of the teachings, thunder suddenly shook the altar. Zou said, “I am about to transcend.” Wang, startled and overjoyed, offered all his wealth in devotion. Zou declined, saying, “I am but a cloud-and-water wanderer—what use have I for this?” Wang then requested to expand the Wondrous Numinous Abbey to enshrine and serve the Perfected Lord. The old abbey lay in another village, so it was relocated and rebuilt. From then on, whenever drought, flood, illness, or affliction struck, the residents’ prayers were invariably answered, and supplicants came daily. Yet the ferry still suffered from the hardship of crossing, which was neither convenient nor proper for those seeking profit. Thus, a boat was established at the ferry, and a pavilion built above it, providing a place for rest.\n\nDuring the military upheavals of the late Yuan, the pavilion fell into ruin, and the boat was destroyed. In the spring of the *gengwu* year of the Hongwu era, I once paid homage at the Perfected Lord’s shrine. At that time, the Wondrous Numinous Abbey lay overgrown and untended, so I ordered Zhang Hui, the Dharma heir of Yu, to raise funds and renovate it. Once the work was completed, in the *yihai* year, the Pavilion for Awaiting the Immortals was also rebuilt, and a boat was provided as a charitable ferry. Moreover, several *mu* of paddy fields were donated to support the ferryman and cover the cost of replacing the boat. This was a plan of profound foresight, and the compassionate concern for those burdened by crossing was fully preserved.\n\nSeveral times I was asked to compose a record of this. Now, *yi* (charity) is the fitting response to affairs. The image of a boat disperses and bridges what is impassable—this is the sage’s way of drawing analogies from things. Even the most ordinary streams and islets, though they do not comprehend their own nature, exemplify the forgetting of both inner and outer—this is the forgetting of the One.\n\nThe forgetting of the One is the heart. It is the heart that illuminates, utterly extinguishing all vexations, like a clear spring cleansing a filthy vessel. Once the vessel is ordered, it may be put to good use; once the heart is stilled, the universal is released, and only then can the true be attained. Thus the scripture says: “Ever without desire, observe its mystery.”\n\nYet once the mystery is truly mysterious, and forgetting is truly real, then inner and outer are wholly forgotten, and one transcends to attain both. Through this awakening to the mystery, one knows without knowing and attains the true One through the forgetting of the One. This is not merely about the One—it applies universally. Know that the One is the origin of the myriad things, and the myriad things are the instruments of the One. The not-One that is not the One is attained through the true One. The source of the true One is fundamentally without admixture, neither now nor ancient, neither perishing nor arising. Thus the *Scripture of the Most High* says: “Serene and solitary, it stands unchanging; circulating without beginning.” This is what it means.\n\nTo profoundly grasp this source is to be without error. The heart equals the Dao, and the Dao equals the heart—Dao is heart, and heart is Dao. Heart and Dao share a single nature, neither being nor non-being, and thus they are mysterious. Abiding in being, one is not attached to being yet does not depart from non-being; abiding in non-being, one is not attached to non-being yet does not depart from being. Everywhere present, nowhere obstructed, spirit and understanding merge, and the nature of true constancy is realized. This is what is meant by “penetrating the heart and attaining the ultimate view, reaching the limitless.”\n\nAll sentient beings sink in the sea of suffering, and this arises from the heart. To extinguish delusion and return to the true is the wondrous source of spontaneity.\n\nThe One is born of *yinyun* (primordial vapor). *Yinyun* arises from the two halves. To gather the heart and abide in the One is called *anding* (peaceful stability). To reduce the heart to ashes and forget the One is called *mieding* (extinguished stability). To awaken the heart to the true One is called *taiding* (supreme stability). To ascend bodily and transform into a feathered being is called an immortal. To equal the true spirit in form is called a perfected one. To embody the same nature is called a sage. A heart-mirror bright and wise is called one who awakens to immortality. A heart that penetrates the true spirit is called one who awakens to the true. A heart that unites with the true nature is called one who awakens to sageliness. These three stabilities and four grades of heart enable one to ascend to the Dao.\n\nThe four grades of heart are coarse, fine, subtle, and wondrous. Thus, those who cultivate and refine themselves push the coarse to its limit to reach the fine, the fine to its limit to reach the subtle, the subtle to its limit to reach the wondrous, and the wondrous to its limit to attain the Dao.\n\nNow, ignorance and frenzy are called coarse. Clarity, softness, and purity are called fine. Spirit merged with emptiness and stillness is called subtle. Profound attainment of the true source is called wondrous. To still the heart and inwardly illuminate, observing all thoughts as empty, so that coarse delusions universally dissolve, is called attaining the coarse. To utterly extinguish fine delusions is called attaining the fine. To comprehend the subtlety of spirit is called attaining the subtle. To awaken to the Dao and penetrate the wondrous is called attaining the wondrous.\n\nMoreover, the congealing of *qi* and the colored body is called coarse. The wandering of *qi* and the flow of breath are called fine. The mirroring and functioning of spirit and wisdom are called subtle. The constancy of true nature is called wondrous. Through cultivation, nourishment, and refinement, premature decay and universal harm are eliminated—this is called attaining the coarse. The harmonious flow of *qi* is called attaining the fine. The equality of form and spirit is called attaining the subtle. The dissolution of form and nature is called attaining the wondrous.\n\nKnow that the colored body is coarse, the wandering *qi* is fine, spirit and wisdom are subtle, and true nature is constantly wondrous.\n\nWhat, then, is the wondrous? It is spoken in contrast to the coarse. Beings are mired in the coarse, and thus are urged to cultivate the wondrous in relation to the Dao.\n\nWhat is wondrous about it? In terms of the Dao, there is no wondrous and no non-wondrous; in relation to things, there is the wondrous and the non-wondrous. In terms of the Dao, there is no cultivation and no non-cultivation; in relation to things, there is cultivation and non-cultivation.\n\nThrough spirit, one penetrates nature, becoming spirit without being spirit. Through the coarse, one discards the wondrous, becoming wondrous without being wondrous. Yet those who extinguish the heart and obliterate wisdom to sit in emptiness and delusion practice the Dharma of quiescent extinction. Those who fuse spirit and nurture *qi* to sit in dual forgetting practice the Dharma of longevity.\n\nExtinction following birth is called quiescent extinction. Birth following extinction is called true birth. To penetrate birth after extinction is to dissolve into true emptiness and wondrous existence.\n\nYet the deluded perceive the Three Realms as the Three Pure Ones—this is easily known in practice but difficult to comprehend in principle. Those who are not disturbed by the desires of emptiness and existence, and who constantly abide in the serene clarity of the heart, possess the profound mind of the perfected person.\n\nYet the restless, violent, and unruly impulses that cannot be swiftly restrained resemble the madness and folly of beings. To quell chaos with stillness, to preserve stillness with constancy, to be lucid in movement and illuminating in stillness—those who thus refine wisdom and nature to dispel delusion, and who embody true wisdom and true nature with clarity, are the profoundly awakened.\n\nTo rest in harmony, to diminish desires, to preserve simplicity, not to listen with the ears but with the heart, not to listen with the heart but with *qi*, not to listen with *qi* but to entrust it to nature—those who are complete in affairs yet able to forget, and who forget in principle yet remain complete, are the comprehensively enlightened.\n\nThose who seek knowledge through texts, sight, and hearing are relying on the artificial. Those who clarify emptiness and inwardly illuminate to unite with nature are genuine. To abandon the artificial and penetrate the real is to make the artificial real as well.\n\n**Chapter Thirty-Five: The True Source**\nThe Dao nurtures beings through emptiness and pervades all directions; the true source responds spiritually with subtlety, and *qi* moves to form vessels according to their nature. All corporeal kinds rely on *qi* to live, while all sentient awareness is endowed by spirit.\n\nSpirit is the function of nature; awareness is the function of spirit. Primordial *qi* is the function of nature; yin-yang and *qi* are the functions of primordial *qi*; form and yin-yang are the functions of *qi*. Thus, the *Scripture of the Supreme* states: \"The Dao is empty yet inexhaustible in use.\" The *Scripture of Southern Florescence* states: \"Spirit and essence are born of the Dao.\" This is what is meant.\n\nTo be vast and embrace all is called nature; to be singular and pervade the individual is called spirit. The body is the vessel of spirit and awareness; the heart is the capital of spirit and awareness. Thus, the *Scripture of Western Ascent* states: \"The body is the abode of spirit.\" Awareness also arises from spirit.\n\nSpirit in relation to awareness is like the sun in relation to light. Light arises from the sun but is not the sun’s body; awareness arises from spirit but is not the true spirit. Spirit within the body can perceive externally, while nature is universally serene, its movement never deviating from stillness.\n\nViewing nature from spirit, nature is wondrous while spirit is coarse. Viewing the body from spirit, the body is coarse while spirit is wondrous. Though nature, spirit, and awareness share the same origin, their functions differ. Awakening unites spirit with nature; delusion mires awareness and severs spirit.\n\nThose mired in awareness and severed from spirit drift through life and death with the movement of *qi*. Those who unite spirit with nature are wondrously and perpetually free. Thus, sentient beings are said to form shapes through the resonance of spirit and *qi*, possessing both form and awareness. Insentient kinds are endowed with *qi* alone, lacking spirit, and thus have form but no awareness.\n\nKnow that spirit can become the awareness of beings but cannot become their form. *Qi* can become the form of beings but cannot become their awareness. Thus, nature and spirit are numinous, while *qi* and form are insentient.\n\nBeings endowed with yin-yang and the Five Phases undergo growth and decline, but the true source of correct nature is never exhausted or depleted. Corporeal beings die when *qi* scatters and live when *qi* gathers, yet *qi* has distinctions of gathering and scattering, while spirit has no difference between life and extinction.\n\nKnow that spirit can move *qi*, and *qi* can also sustain spirit. When gathered, they form together; when scattered, each moves independently. Impure flavors and foul odors sustain the turbid *qi* of yin-yang; wondrous medicines and pure harmony sustain the correct *qi* of primordial harmony.\n\nWhen correct *qi* is complete and sustains spirit, there is non-action and non-desire. When the turbid *qi* of yin-yang sustains spirit, there is much desire and much action. Much desire and much action are the source of premature decay and drowning in suffering. Non-action and non-desire are the essence of serene and constant existence.\n\nThe origin of beings arises from the middle way. Mired in awareness, they transmigrate according to karma, revolving without leaving the Dao—yet why do they not awaken to the Dao? Sentient beings with form and appearance have distinctions and divisions. Pursuing objects, they generate delusion; accumulating delusion, they form karma. Unable to escape retribution, they fail to reflect inwardly.\n\nThose who awaken to the profound and serene emptiness, though deluded yet not deluded, though bound to objects yet not bound, are not captured by delusion or objects—how then could there be karmic retribution? The confusion of the three karmas and six senses arises from turbid *qi* and clouded emotions; in tranquil contemplation and perfect emptiness, spirit is clear and *qi* is refreshing.\n\nThus, the *Scripture of the Original Boundary* states: \"Sound, whether clear or turbid, follows its original tone.\" It also states: \"All is felt according to the karma of beings.\" The *Scripture of Western Ascent* states: \"The *qi* of accumulated goodness arrives; the *qi* of accumulated evil arrives.\"\n\nYet evil *qi* is turbid and strong, increasing darkness and generating delusion. Good *qi* is pure and complete, penetrating emptiness and illuminating clarity. To be illuminated and clear is like parting the mist to glimpse the azure sky.\n\nThose shrouded in darkness and obscurity are like those drowning in a muddied river. Thus, when darkness and light are both transcended, when good and evil are both obscured, and when the utmost true source and the flowing wondrous origin are reached, this is the mystery of spontaneity.\n\nSpontaneity is the nature of non-action, requiring no external cause—hence it is called \"spontaneous.\" Those who cultivate practice attain non-action through action, and reach non-birth through birth. When one fully comprehends the self and accords with spontaneity, the nature of non-birth is realized. This nature is not without birth, yet it can give rise to all things. Though it gives rise to all things, the wondrous origin has never truly been born. Thus, the non-action of non-action and the form of no-form are the wondrous essence of the Dao. The action of action and the form of form are the vast functions of the Dao. The wondrous origin, in its relation to the originless—\n\nThe mind is the master of all delusions and also the gateway to all wonders. The depths of the nature, spirit, and consciousness are all illuminated and penetrated through the mind. Yet the foolish masses, called \"deluded consciousness,\" know nothing of ritual and law, and are thus called \"shallow consciousness.\" Those with discerning thoughts and keen insight are called \"wise consciousness\"; those serene, gentle, and unadorned are called \"pure consciousness\"; those with a settled mind and empty tranquility are called \"still consciousness\"; those who extinguish the mind and abolish wisdom are called \"forgotten consciousness\"; those with clear inner reflection are called \"discerning consciousness\"; those who comprehend the divine and true are called \"subtle consciousness\"; those who penetrate the ocean of nature are called \"wondrous consciousness.\"\n\nAlas, many in this age are mired in coarse consciousness, while those who grasp the divine and subtle are rare. Those who grasp the divine transcend consciousness, though they remain connected to it. Those mired in consciousness are not without spirit, yet they remain separated from it. Those who grasp the divine and subtle see both essence and function clearly in spirit and consciousness. Those mired in coarse consciousness cling to partial views of consciousness and fail to unite with spirit.\n\nTo unite with spirit and penetrate nature, one must first cultivate mindfulness meditation, then proceed to the meditation of forgetting the mind. When the mind is extinguished and wisdom abolished, all realms become still. Externally, no sounds are heard; internally, no forms are seen. In the midst of formlessness, a sudden subtle awakening arises—spirit becomes empty and fused, and this is the principle of spirit. When spirit is fused and emptiness dissolved, merging into boundlessness, one abides in vast openness, and the wondrous nature of the Dao, the true origin, is realized.\n\nThus, using consciousness to illuminate consciousness, one exhausts consciousness to penetrate spirit. Using spirit to illuminate spirit, one exhausts spirit to penetrate nature. Penetrating nature, nature sees itself; penetrating spirit, spirit sees itself. When spirit sees itself and nature sees itself, this is true seeing. Using consciousness to see spirit or spirit to see nature is deluded seeing.\n\nThose who attain a settled mind do not fall into evil destinies—how much more so for those whose spirit unites with nature? The subtle spirit and wondrous nature, though inherently numinous, are fundamentally tranquil and free from delusion. Beings mired in consciousness without penetration are called \"deluded minds.\" Those who comprehend the source of spirit do not abandon delusion for truth.\n\nThe essence of nature abides in emptiness, identical to emptiness yet not emptiness; it abides in form, identical to form yet not form. It can encompass both emptiness and form, ever still and ever penetrating—what is vast contains all, what is minute enters all. First, it does not enter the Three Realms; second, it enters the Formless Realm; third, it enters the Form Realm; fourth, it enters the Desire Realm; fifth, it enters the Evil Destinies.\n\nWondrous medicines can nurture harmony; sitting in forgetfulness can illuminate nature. Nurturing harmony prevents the body from dying; penetrating nature prevents delusion from arising. When neither death nor birth exists, form transforms and communicates with spirit—this is the way of feathered transcendence and true immortality. Thus, the *Shangqing*, *Taiqing*, and *Zhen’gao* scriptures all speak of the wondrous elixir of golden cinnabar and refining *qi* to communicate with spirit, enabling one to ascend lightly, become an immortal, and unite with the sagely.\n\nThus, eliminating deluded thoughts is the essential key to awakening the Dao, and the harmony of spirit and *qi* is the pivot of immortality. Those who claim to cultivate the Dao without eliminating delusion are like the blind grasping for clarity. Refining thoughts to stillness and penetrating the true spirit is like drilling wood to spark a flame.\n\nThose who concentrate the mind in sitting forgetfulness to penetrate spirit and awaken nature practice the method of cultivating spirit. Those who guide the body through movements and exhale and inhale primordial harmony practice the method of cultivating the body. Cultivating spirit without cultivating the body is the method of liberation. Cultivating the body without cultivating spirit is the method of prolonging life. Cultivating both spirit and body together is the method of learning immortality.\n\nIn cultivating spirit, refining the mind comes first; in absorbing *qi*, guiding and pulling movements take precedence. When guiding and pulling movements harmonize with the Great Harmony, and refining the mind penetrates all wonders, spirit fuses with empty clarity, and *qi* flows freely in purity. Transforming spirit and *qi* to circulate freely—what truth is not then complete?\n\nThus, superior practitioners of the Dao universally release worldly toils, comprehend the true source, perfect wisdom, and embrace the wondrous. Nurturing harmony, they preserve life, like fire passed from one torch to another. With long vision and eternal life, they ascend on rainbows to the immortal realm, progressing from immortality to truth, from truth to sageliness—sageliness is the wondrous flow of communication. This is not abandoning the body of action but attaining the nature of non-action.\n\nMiddle practitioners of the truth comprehend the source of the mind, yet their bodily forms remain ordinary. They abandon the leaking body to enter the sagely realm—this is abandoning the form of action to attain the nature of non-action.\n\nSuperior practitioners attain both form and spirit, eternally wondrous in the true source. Middle practitioners attain spirit but sink the body, thus requiring liberation. Inferior practitioners fail to attain either spirit or form and follow karmic transmigration.\n\nThe Dao is eternally one in its spontaneous form, while things differ in myriad ways. The Dao can generate things, yet things are not the true Dao. Observing through the Dao, the myriad things and dharmas all communicate through the one Dao. Observing through things, the myriad things and dharmas each cling to their own path. Though things differ, the Dao does not differ; though dharmas vary, the Dao does not vary. Though action ceases, the Dao does not cease; though emptiness and form are severed, the Dao is not severed.\n\nThe true reality abides in serene spontaneity, pervading all with effortless freedom—this is the Dao of great penetration. The Dao is the root-source of the myriad dharmas. To wondrously attain the true and constant is to return to the origin and revert to the primordial.\n\nThe Dao’s relation to sentient beings is like that of an emperor to the common people: those who ascend the imperial throne command the allegiance of all dharmas. Those who attain the wondrous Dao likewise perceive all dharmas. Thus the *Sutra of the Fundamental Limit* states: possessing all wisdom and accomplishing the supreme Dao.\n\nForm aggregates, consciousness aggregates, mind aggregates, and perception aggregates—when these four aggregates coalesce, good and evil arise. The Great Vehicle is level and equal, without excess or limit, while the gradual teachings of the Dharma-gate entail cultivation and realization. Thus, one relies on the boat to reach the shore, then abandons the boat upon arrival. One relies on study to achieve success, then discards study once success is attained. As the *Virtue Classic* says: \"For learning, daily increase; for the Dao, daily decrease—decrease and further decrease until reaching non-action, where non-action accomplishes all.\" Those who pursue learning daily augment their views of action, while those who cultivate the Dao daily diminish their knowledge of action and views. By diminishing the existent, one penetrates the non-existent; by penetrating the non-existent, one possesses all.\n\nYet the true source abides in profound stillness, responding and adapting to conditions. Sentient beings differ in the sharpness or dullness of their roots, so the teachings of the sages likewise vary between gradual and sudden. Cultivation through action is called the gradual teaching; true realization of non-action is called the sudden teaching. The true nature pervades all, perfectly equipping every method—this is called the Dao’s response. Expounding sutras in Han lands and teaching in foreign regions—this is called a distinct response. All sentient beings share the same nature as the Dao—this is called universal resonance; receiving teachings according to their kind—this is called distinct resonance.\n\nThus the *Sutra of the Ocean of Emptiness* states: \"The sage is non-active; sentient beings therefore respond with action.\" It further says: \"Sentient beings resonate with the sage through different conditions; the sage’s response to sentient beings likewise varies in form.\" Therefore, the wondrous essence abiding in stillness is called the true body; manifesting in phenomenal forms is called the responsive body; receiving retribution according to causes is called the reward body.\n\nWithin the wondrous lies the vast, and within the vast lies the wondrous. When the sage responds to action, it is the wondrous within the vast; when sentient beings awaken to non-action, it is the wondrous within the vast. Yet all myriad dharmas originally emerge from the profound and obscure, where the principle of spontaneity resides, and the conditions of causes are the same.\n\nThus, the Dao is one in nature yet can respond to all spirits; spirit is one yet can respond to all things; things receive one spirit yet can respond to all consciousness. Responding to spirit produces the wisdom of harmonious life; responding to form manifests the shapes of the myriad kinds; responding with the body extends the sage’s compassionate transformation; responding with nature guides the deluded masses. Nature is the wondrous numen of emptiness and spontaneity. Responding to the sage is the wondrous function of nature; responding to spirit is the subtle function of nature; responding to form is the minute function of nature; phenomenal appearances are the vast function of nature.\n\nThe sage who responds is the sage of the responsive body. Phenomena are the forms of all conditioned things in heaven and earth. Thus, the response can generate the myriad things yet does not generate; can accomplish the myriad things yet does not accomplish; can possess the myriad things yet does not possess; can empty the myriad things yet does not empty. Not being a thing yet able to act as things, it is not confined by things; not being a dharma yet able to act as dharmas, it is not bound by dharmas. Responding without deviating from its root—this is the true and constant nature of the great Dao.\n\nThe six paths arise in throngs, yet the Dao does not arise; the three realms undergo kalpic transformations, yet the Dao does not change. To cultivate and unite with the Dao, nothing precedes spirit, while form follows after. The thirty-six thousand spirits of the body are the unified governance of a single life. Their functions differ yet all return to one—like the limbs of a body. Phenomena within phenomena reveal sameness within difference; spirits within spirits reveal difference within sameness. Though existence and non-existence stand opposed, principle and phenomenon interpenetrate.\n\nThus, within spontaneity there are causes, and within causes there is spontaneity. Spontaneity does not depart from causes, nor causes from spontaneity—yet they differ while being the same. All causes are ultimately the causes of spontaneity. From the root descending to the near, functions vary according to use; gathering the near to return to the root, all is encompassed without exclusion. The true essence embraces all images, its mysterious responses transforming the great chiliocosm—thus it can wondrously unify one spirit while distinguishing a hundred billion.\n\nWithout distinguishing treasures, one cannot know their value; without illuminating the Dao, one cannot embody its truth. Things receive the Dao and are born, thus things possess the Dao-nature. Those who do not awaken to the Dao are deluded by the customs of a degenerate age. The supreme teaching responds, and teaching can guide to principle. Those who do not know the teaching suffer the eight difficulties; slandering and reviling the sage incurs the three painful destinies.\n\nYet the Dao is omnipresent, and one need not despair over sentient beings—for awakening enables penetration, and how distant is the separation? Thus the *Sutra of the True Treasury* states: \"All afflictions are but the adornments of true nature,\" turning delusion into truth. This is what is meant by: movement does not deviate from stillness, stillness does not deviate from movement; response abides in truth, truth abides in constant response. As the *Western Ascent Sutra* says: \"The Dao is not mine alone—all things possess it.\" Thus, those who can practice can penetrate, and those who can penetrate are sages.\n\nPreserving the true one, the correct one, and the threefold one—this is the Dao’s accomplishment. The great image of primordial chaos has manifold applications, yet the unenlightened find its principles difficult to rightly believe. Now I cite essential passages from various sutras to dispel the doubts of seekers. Thus the *Supreme Sutra* says: \"The great image has no form.\" And the *Western Ascent Sutra* states: \"Nothing in the world is softer or weaker than the Dao.\"\n\nThe reason the Dao is soft and weak is that it envelops Heaven and Earth and permeates the myriad things. The *True Treasury Sutra* states: \"In all under Heaven, nothing is softer or weaker, yet it encompasses all without exclusion, subtle and minutely refined.\" The *Nanhua Sutra* says: \"The most refined has no form; the greatest cannot be encompassed.\" This clarifies that the supreme Dao, being non-action, embraces all phenomena. The *Laozi Sutra* says: \"The Dao gives them life; virtue nurtures them.\" The *Supreme Three Heavens Orthodox Sutra* states: \"The Dao is vast, boundless, and profoundly obscure; from the Great Void’s transformations, darkness arises.\" The *Scripture of Great Peace* says: \"The Dao envelops what lies beyond form; it generates spirit and essence.\" The *Nanhua Sutra* states: \"The Dao possesses sentiment and sincerity, is without action and form; it spiritually empowers ghosts and gods, gives birth to Heaven and Earth.\" This clarifies that spirit and darkness, Heaven and Earth, and the myriad things all serve as instruments of the Dao.\n\nThe *Western Ascent Sutra* says: \"When I recall the time before my birth, before I had a body, it was true essence accumulated as qi that formed my body.\" It further states: \"Form without spirit cannot generate itself; spirit without form cannot complete itself. Only when form and spirit unite do they mutually engender and perfect.\" This clarifies that all beings with nature arise from the mutual resonance of spirit and darkness, which gives rise to the body. Spirit resides within ants, assuming the form of ants; spirit resides within elephants, horses, osprey, and roc, assuming their shapes. Spirit adapts in length to the substance, while substance depends on spirit to activate its function. Discerning good and evil is called *shí* (discernment); the hidden, numinous transformations are called *shén* (spirit). That which animates the body is none other than spirit. When the body exists, spirit abides; when spirit departs, the body dies.\n\nThe body receives one spirit, which generates thirty-six thousand spirits. At the moment of death, the thirty-six thousand spirits return to the one spirit, which then departs. One spirit dwells within and equals one body; within the one, it equals the multitude of spirits. Birds and beasts receive one in the same way, yet they do not possess the full complement of spirits as humans do. In quantity, this is so; likewise, in the purity or turbidity of qi. The resonances differ in myriad ways, hence the many variations.\n\nThe kinds of grasses and trees are generated solely by qi and do not receive spirit to complete their forms; thus, they lack discernment and function. Without discernment, they also lack karma. The *Original Boundary Sutra* states: \"Reciting and contemplating this sutra opens the path to liberation, and the spirit ascends to the Southern Palace.\" The *Scripture of Salvation* says: \"When the hun-soul and spirit momentarily vanish, one does not pass through hell but immediately regains form.\" It further states: \"The suffering souls of innumerable ancestors and past generations are all thereby delivered.\" This clarifies that those who cultivate goodness guide their spirits toward the good Dao, benefiting not only themselves but also their kin.\n\nThe *Great Precepts Sutra* says: \"When the heart-spirit is agitated, it gives rise to love and desire, causing people to wander in delusion.\" The *Original Boundary Sutra* states: \"Those who inflict much harm, upon death, their spirits depart and cycle through the three evil destinies.\" This clarifies that those who do evil suffer retribution in their spirits. The *Ascending Mystery Sutra* says: \"In profound communication and tranquil seclusion, the spirit becomes luminous and enters the subtle.\" The *Karmic Retribution Sutra* states: \"With a tranquil mind and serene contemplation, one returns the spirit to the Dao.\" The *Nanhua Sutra* says: \"Detach from form, abandon wisdom, and merge with the Great Communion.\" The *Original Boundary Sutra* states: \"It cannot be made to be so, nor can it be made not to be so—hence it is called *ziran* (self-so). Awakening to this true nature is called awakening to the Dao.\"\n\nThis clarifies that those who transcend illusion, attune to spirit, and awaken to nature—like cicadas shedding their shells—temporarily rely on spirit to return to the truth of the great Dao. The Dao, in relation to one’s inherent nature, is but a different name. Fire’s nature responds to dryness in its function, while water’s nature responds to moisture—this illustrates the nature of the Five Phases, not the nature of the supreme Dao. Since the Five Phases are thus, the myriad phenomena may be known. Though largely the same, they still differ in minor ways. Therefore, insentient kinds all possess their inherent nature, while sentient beings all possess their karmic nature; the Dao’s emptiness and pervasiveness are called its wondrous nature.\n\nThe *Original Form Sutra* says: \"Cherish the spirit and protect the qi, and you may attain longevity.\" The *Karmic Retribution Sutra* states: \"Refine the darkness and transform the form; turn the spirit to return to the Dao.\" The *Western Ascent Sutra* says: \"Become one with the Dao in body yet without form.\" This clarifies that when form and darkness are both refined, they transform into spirit; turning the spirit to return to the Dao, one unites with the Dao in spirit, thereby encompassing all phenomena. Spirit alone equals the one body. Spirit, empowered by the Dao, becomes numinous; things, empowered by spirit, gain discernment.\n\nThe Dao is profoundly still, of one appearance, its wondrous essence truly constant. Spirit and darkness differ in two ways yet both serve the Dao’s function. Darkness is boundless and without limit; spirit has transformation and transition. Spirit is numinous, while darkness is not; darkness is vast, while spirit is not. Darkness has purity and turbidity; spirit has activity and rest. Only the Dao remains eternally thus, serene and unchanging.\n\nTherefore, extensive learning and broad knowledge enhance discernment; preserving truth and refining darkness enhance spirit. Enhancing spirit connects one to the source without dependence; enhancing discernment increases the function of deliberate action. Deliberate action has limits and bounds; non-action is without limit or end. Alas, the careless multitude does not comprehend this subtlety.\n\nThe *Ascending Mystery Sutra*’s \"Three Disciplines of the Dharma Wheel\" states: \"These three disciplines of the Dharma Wheel are the constant disciplines of the scriptural teachings, the eternal disciplines of immeasurable kalpas, which no sage of the past has ever altered. The disciplines comprise the superior, middling, and inferior practitioners.\" The concluding chapter speaks of guiding the three vehicles, which are the three practitioners—no other designation exists. *Shì* (practitioner) means \"endeavor.\" The supreme practitioner embraces the conduct of the One, vows to attain the Dao without fail, and completes the endeavor without cessation. *Shì* (endeavor) signifies the ability to complete; *chéng* (vehicle) signifies the path of conveyance.\n\nTo summarize briefly:\nThe superior practitioner broadly opens the gates of the Dharma, placing others before self, delivering even rulers and kings, sacrificing self to aid others, extending benevolence to birds and beasts, bestowing kindness upon all living beings, revering teachers and upholding the Dharma as if in the presence of the divine, maintaining long fasts and arduous contemplation, delving deeply into the profound mysteries, expelling the old and absorbing the new, with a heart like cold ashes and a body like withered wood, intent unwavering and qi gentle, both human and spirit exerting effort. Such conduct, though entailing one death and one rebirth, ensures an unretreatant resolve to achieve the rank of highest immortality.\n\nThe first is *conduct*, the second is *vow*, the third is *compassion*, and the fourth is *lamentation*. *Conduct* encompasses the one hundred eighty precepts and two hundred forty rules of deportment, all of which govern body, speech, and mind, and constitute the myriad good practices. The twelve supreme vows are *vows*. The forty-five contemplations are *compassion*. These all derive from the *Scripture of the Cavernous Mystery and Numinous Treasure*.\n\n*Expedient means of liberation* include: the Golden Register for liberating emperors and kings, the Yellow Register for liberating ancestors and descendants, and the Natural Liberation for all sentient beings—this is *lamentation*. *Conduct* takes the cessation of evil as its meaning; *vows* take profound aspiration as their covenant; *compassion* takes virtue as the shade for all things; and *lamentation* takes the relief of suffering as its embrace. Once the Way of the four disciplines is established, there is the severance of a single retribution.\n\nThe middling practitioner, aspiring to the Mystery, liberates all beings, rescues from distress and dispels calamity, bestows merit and repays virtue, establishes fields of profound blessedness, serves ruler and parents with loyalty and filial piety, embraces gentleness and wisdom, cherishes benevolence, empties the heart to attain the supreme Dao, savors the numinous scriptures, eats without thought of satiation, and wears clothing without concern for cold. With all practices perfected, three deaths and three rebirths follow, replenishing the Perfected of the Nine Palaces and cultivating the supreme Dao of Jade Clarity. In conduct, they are meticulous: observing the three hundred great precepts, reciting the thirty-nine chapters of the *Great Cavern*, and contemplating the method of the Three Ones. Upholding precepts to sever evil, the five destinies are without opposition; reciting scriptures to still the spirit, the heart is not driven outward; preserving the One to empty the mind, spirit and heart become serene. When serenity is settled, the mirror beholds the supreme Dao, ascending into non-action, and worldly retribution is severed.\n\nThe lesser practitioner severs emotions and endures hardship, nurtures the spirit through diet and regimen, renounces glory and splendor, dwells in mountains and forests, delights in hills and streams, abides in serenity and steadfastness, abstains from grains and roots, and maintains long fasts while contemplating the Dao. Seated upright, they face their teacher as if present; in coming and going, they keep company with birds and beasts. Solitary in lofty crags, they lodge alone in empty mountains, carve cypress to adorn themselves, their faces bearing the look of hunger, their hearts as if holding cinnabar. Tested, they are unafraid; spirit stilled, heart at peace. Such conduct moves the August Sovereign of Emptiness: nine deaths and nine rebirths follow, their resolve and vows unretreatant. They attain transformation, riding clouds in flight, roaming and feasting on the Five Peaks, carefree in the Great Void. Proceeding thus, they ascend to the rank of lofty immortals, cultivating the Dao of Jade Clarity alongside the middling practitioner.\n\nThe scripture states: The six penetrations and contemplative methods—five colors, five sounds, five tastes, five fragrances, five treasures, floral splendor, and all adornments—disturb the nature. The scripture states: In the east, *penetrating vision*; in the west, *penetrating emptiness*; in the south, *penetrating clarity*; in the north, *penetrating subtlety*; in the center, *penetrating void*. With the six penetrations and wisdom, the contemplation of the Dao is accomplished, casting off immeasurable dust and burdens. When dust and burdens are exhausted, this is called the six penetrations.\n\nThe *Scripture of the Immortals* states: The eye of wisdom, the ear of wisdom, the nose of wisdom, the tongue of wisdom, the body of wisdom, and the heart of wisdom—entering the Dao of the Rare and Silent, transcending the dharmas of the Three Realms, all is empty. This is called the six penetrations.\n\nThe *Scripture of the Three Realms* states: Upholding precepts is the root of fasting and purification; stillness is the foundation of concentrated contemplation; concentrated contemplation is the cause of descending perfection; descending perfection is the treasure of ascending the Dao.\n\nThe scripture states: The darkness of the Three Treasures resides in the heart; the adept of the Three Treasures resides at the edge. The \"edge\" is the register, the threshold. Abiding in the heart, contemplating and acting, transforming the perverse to follow the upright, accumulating goodness and establishing merit—virtue is fulfilled, reaching the ultimate, the ultimate of the Ultimateless. Drawing in the many streams, guiding those with aspiration.\n\nThe scripture states: When spirit and essence dwell within the inner chamber, the primordial darkness abides forever—this is the Dao of long life and enduring vision. *Darkness* takes emptiness and void as its essence, form and color as its function; *essence* takes profound obscurity as its essence, light and sound as its function; *spirit* takes subtlety and wonder as its essence, transformation as its function.\n\nThe scripture states: \"Invisible to sight, it is *even*; inaudible to hearing, it is *rare*; untouchable to grasp, it is *subtle*.\" This is the Dao of spirit, darkness, and essence as the Three Ones, merging three into one, dispersing one into two. The \"one\" is non-being; the \"not-one\" of the one is called the True One. Here ends the essential purport of the Three Discourses.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "三论元旨 经名：三论元旨。 未题撰人，约出於唐代。 底本出处：《正统道藏》太玄部。 三论元旨序 夫一悟所通，乃无幽而不照，一迷所执，亦无往而不愚。 是知附赘悬疣，则形之病焉。 妄想烦恼，射心之病焉。 形病除而形骸泰矣，心病泯而正性明矣。 除形病者必假於良医，泯心病者必资於妙教。 自然之理，犹乎炉锤而成。 生也有涯，须运庖丁之力。 禀明师而作范，禀范随枢。 凭至典而为荃，忘荃观奥。 市尘黑暗，则丧本而乖真。 灵府清虚，亦神全而气妙。 神全乃长生之本，气妙为不死之源。 同乎大通，莫不因修而达矣。 予久依山水，远托幽栖，以不替之心，契无为之性，恬乎林野，玄意常盈，聊举一隅，以为三论。 虽文纯若鄙，而理也可凭。 庶学者无疑，修之有证，死生大患，孰不伤哉。 普劝将来，共观其妙尔。 三论元旨 道宗章第一 夫道之宗也，幽微奥妙，理之极也，灵运港通，体而一焉，应乎万矣。 夫称无为、无上、无极、无穷、道性、真性、理性、玄性、虚无、自然、虚通、解脱、至精、至妙、至圣、至真、清静、清虚、非生非灭者，此之多应，於理无差，悉是大道至人灵宗之号。 悟则通圣，迷则滞凡，迷悟有乖，至真何殊。 玄寂非远，达妄则真，苍生滞有色之迷，圣人说无为以破众滞，指空无之境，演微妙之源，了此空色无执滞之妨，则真常之性见矣。 故《本际经》云：谓执性故，因绿方便，说诸法假； 说执假故，因绿方便，说诸法空。 洞达真性，真性通流，亦何空假之能碍矣。 然而未悟须息纷尘，至精非色想所观，至奥岂浮情能测，若不澄虚涤想，无以全真。 纵广学多端，无虚寂之照，终不悟也。 然见形而不返神者，迷之甚也。 不达神其实请记。 因嘉山水之胜，是不能无以纪之。 翠微观记 抚之翠微观道士严与敬氏，问持揭文安公所撰《翠微观记》，其修创之颠末，谒余文。 余未遑执笔，今春谒南丰侍宸王真君祠，道过翠微，其膏田沃壤，溪山回揖，皆层青迭翠，蜿蜓十余里。 而冈阜支麓起伏不已，信风气所会之佳处也。 按文安公记，应真之山在吁汝之交，是为金溪之南郡。 唐天宝元年，有道士结庐其下，扁日谷林。 宋宣和元年，赐额翠微观。 元泰定二年，住持周君应悌，复彻而新之，是为之述焉。 岁久弊陋，元季已为榛莽之墟。 我朝建国之初，金溪后车何氏，以资力雄乡里，尝延吁之南城延禧观道士罗则铭，住持延寿观，其徒则熊益谦、严与敬也。 与敬於洪武六年，请部牒度为道士。 七年，礼部起充太常乐舞生，未几丁母忧还。 八年起服，仍就乐舞员。 十二年，以故得请赐还。 益谦则居青州藩府，十七年道会疏，延主翠微观事。 二十二年则铭解化，与敬厚葬之。 遂率徒黄用素、李用光，领延寿、翠微二观事。 凡殿堂廊应，多缮茸之。 三十年秋，构亭山之颠，松竹苍蔚，额曰翠涛。 且得文安公记，於里之李尹诚所。 抑符其增创之志，因重有请焉。 余闻古之仙真灵迹，率据山川之雄秀，所谓地因人胜者，信矣。 吾郡山水丰丽，莫过吁抚，而翠微始於唐而兴於宋元，岂非地胜而人杰也哉。 蚓获托不泯於当世，知名之士有如文安公者，可谓盛矣。 而与敬以俊敏之姿，善鼓琴绘画，其兴创改作，必尤有侈於今日也，则主观事，为得人矣。",
      "translated_text": "**Preface to *The Essential Meaning of the Three Treatises***\n\nThe enlightenment attained through a single realization illuminates even the most obscure depths, while the delusion clung to in a single moment renders all paths foolish. Thus, superfluous growths are maladies of the form, just as deluded thoughts and afflictions are maladies of the mind. When the malady of form is cured, the body finds peace; when the malady of mind is dissolved, the true nature shines forth. To cure the malady of form, one must rely on a skilled physician; to dissolve the malady of mind, one must depend on sublime teachings. The principle of spontaneity is wrought as if by furnace and hammer. Life is finite, and one must wield the skill of a master butcher. Following a luminous teacher, one receives the model; adhering to the model, one moves with the pivot. Relying on the supreme canon as a guide, one forgets the guide and beholds the mystery.\n\nThe dust of the marketplace is dark and murky, causing one to lose the root and stray from the true. When the inner sanctuary is pure and empty, the spirit is whole and the *qi* is wondrous. A whole spirit is the root of long life; wondrous *qi* is the source of immortality. All things, in their great communion, attain realization through cultivation.\n\nFor long have I dwelt among mountains and waters, secluded in quiet retreat, my unwavering heart attuned to the nature of non-action. Serene amid the forests and wilds, my profound intent ever full, I offer these three treatises as a glimpse of one corner. Though the language may seem coarse, the principle is trustworthy. May scholars harbor no doubt, and may their practice yield verification. The great affliction of life and death—who is not grieved by it? I universally exhort those to come to together behold its mystery.\n\n---\n\n**The Essential Meaning of the Three Treatises**\n\n**Chapter One: The Origin of the Dao**\n\nThe origin of the Dao is subtle and profound, the ultimate principle, spiritually responsive and all-pervading, unified in essence yet manifesting in myriad forms. Terms such as non-action, supreme, infinite, boundless, Dao-nature, true nature, inherent nature, mysterious nature, emptiness, spontaneity, emptiness and penetration, liberation, utmost refinement, utmost subtlety, utmost sageliness, utmost truth, purity, clarity, neither birth nor extinction—these many designations, though varied, are without error in principle. All are names for the numinous origin of the perfected ones of the Great Dao. Realization leads to sagehood; delusion binds one to the mundane. Though delusion and realization diverge, how do they differ from the utmost truth?\n\nThe profound and quiescent is not distant; perceiving delusion, one grasps the real. The common people are mired in the delusion of form and color, while the sages expound non-action to dispel their obstructions. They point to the realm of emptiness and nothingness, unfolding the source of the subtle and wondrous. When one comprehends that emptiness and form present no obstacle of attachment, the ever-true nature is revealed.\n\nThus, the *Sutra of the Fundamental Limit* states: \"Because of attachment to nature, one employs expedient means to expound the provisionality of all dharmas. Because of attachment to the provisional, one employs expedient means to expound the emptiness of all dharmas.\" Penetrating the true nature, the true nature flows unimpeded—how could emptiness or the provisional hinder it?\n\nYet without realization, one must still the dust of the world. The utmost refinement cannot be observed through thoughts of form; the utmost profundity cannot be fathomed by superficial emotions. Without clarifying emptiness and purifying thoughts, one cannot preserve the true. Even with vast learning and many approaches, without the illumination of emptiness and quiescence, realization remains unattainable. To perceive form and not return to the spirit—this is the height of delusion. Not comprehending the spirit, how can one truly record it?\n\n---\n\n**Record of Cuiwei Abbey**\n\nThe Daoist Yan Yujing of Cuiwei Abbey in Fuzhou requested that I compose a record of its construction and renovation, following the text of *Record of Cuiwei Abbey* by Lord Wen’an. I had not yet found time to take up my brush, but this spring, while visiting the shrine of the Perfected Lord Wang of Nanfeng, I passed by Cuiwei. Its fertile fields and rich soil, its winding streams and encircling mountains, all layered in verdant hues, stretched sinuously for over ten *li*. The ridges and foothills rose and fell without end—truly a fine place where the vital *qi* of the land converges.\n\nAccording to Lord Wen’an’s record, the mountain of the perfected ones lies at the junction of Yu and Ru, in the southern prefecture of Jinxī. In the first year of the Tianbao era of the Tang (742), a Daoist built a hut at its foot, naming it Valley Grove. In the first year of the Xuanhe era of the Song (1119), it was granted the plaque Cuiwei Abbey. In the second year of the Taiding era of the Yuan (1325), the abbot Zhou Yingti renovated it entirely, and thus the account was written.\n\nOver time, the abbey fell into disrepair, becoming a wasteland of brambles by the end of the Yuan. At the beginning of our dynasty, He of the Later Chariot of Jinxī, a prominent family in the region, invited Luo Zemin, a Daoist from Yanxi Abbey in Nancheng of Yu, to serve as abbot of Yanshou Abbey. His disciples included Xiong Yiqian and Yan Yujing. In the sixth year of the Hongwu era (1373), Yujing petitioned for ordination as a Daoist. In the seventh year (1374), the Ministry of Rites appointed him as a musician in the Court of Imperial Sacrifices. Shortly after, he returned home due to his mother’s mourning. In the eighth year (1375), he resumed his post as a musician. In the twelfth year (1379), he was granted leave to return. Yiqian, meanwhile, resided at the princely residence in Qingzhou. In the seventeenth year (1384), the Daoist registry summoned him to oversee affairs at Cuiwei Abbey.\n\nIn the twenty-second year (1389), Zemin passed away, and Yujing gave him a generous burial. He then led his disciples Huang Yongsu and Li Yongguang in managing both Yanshou and Cuiwei Abbeys. Many halls, corridors, and structures were repaired. In the autumn of the thirtieth year (1397), he built a pavilion atop the mountain, where pines and bamboos grew lush and verdant, naming it Green Waves. He also obtained Lord Wen’an’s record from Li Yincheng of the village, which aligned with his aspirations for expansion and renovation, prompting him to make this renewed request.\n\nI have heard that the numinous traces of ancient immortals and perfected ones are often found in the grandeur of mountains and rivers—what is called \"the land ennobled by the person\" is indeed true. Among the mountains and waters of our prefecture, none surpass those of Yu and Fu, and Cuiwei, which originated in the Tang and flourished in the Song and Yuan, is surely a case of \"a noble land producing outstanding people.\"\n\nTo have one’s name endure in the present age, and to be counted among renowned scholars like Lord Wen’an, is truly splendid. Yujing, with his keen and perceptive nature, excels in playing the *qin* and painting. His renovations and innovations must surpass even those of today. In entrusting him with the affairs of the abbey, the right person has indeed been chosen.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1252,
      "start_sentence": 0,
      "end_sentence": 60,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.935951471328735,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\三论元旨.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "余岂不乐道其成而记之。 其山川观宇之规制，已备前记，兹不复赘。 义渡记 南丰之为州，今为吁之上县，山水崇秀，人物繁伙，而商帆贾舶常往还为市。 其道则上通南昌袁赣，下达吁抚闽广。 而义渡适当其要冲，舟不可不设也。 溪去县五里而近，溪上重冈迭茎引叹，若环带北面军峰之秀，是为神龟冈也。 宋崇宁问，侍宸王真君以道行之着，受知徽庙，晚痪蜕其地，而神龟之征益名。 邑之贤良有邹铁璧者，尝受法于上官氏。 上官，侍宸甥也。 已而复遇侍宸，亲授其奥而道亦显。 时有知南丰州事王质，尝师事铁璧，及付受之顷，忽雷震坛上，邹日：吾将度矣。 王惊喜，遂倾资奉之。 邹谢曰：吾云水徒也，用此奚为。 王乃请以广妙灵观，以祠事侍宸。 故旧观在他里，乃迁而新之。 以是凡旱汾疾疚者，居民祷之必应，恳谒者日至。 而渡犹病涉，有不惟利趋之弗宜也。 是设舟於渡，而亭其上，因有以憩息之地焉。 元季兵兴，亭废而舟亦毁。 洪武庚午春，予尝谒真君祠，时妙灵芜秽弗治，是命吁之嗣法章恢，募力新之，工既毕，岁乙亥，复新候仙之亭，设舟以为义渡。 且施水田若干亩，以赡舟师，而备易舟之费，其为悠远之计亦至矣，而恻隐病涉之仁具存矣。 数征文以记之。 夫义者，事之宜也，舟之象涣以济不通，此圣人於物取象之宜也。 虽凡溪渚不通愍然不知其所以，此谓内外都遣，忘一者也。 夫忘一者心，谓照心都绝，烦恼洗然。 犹彼清泉而涤秽器，器中既序，方堪善用。 心澄普释，方可致真。 故经云：常无欲以观其妙。 然妙既妙矣，忘亦真矣，所谓都忘内外，然后超然俱得者也。 妙斯之悟，则无知而能真知，忘一而达真一矣。 非唯於一，抑亦一切统然。 是知一为万之所宗，万为一之所用也。 不一之一，得之真一。 真一之源，本无假杂，非今非古，何灭何生。 故《太上经》云：寂寥，独立不改，周行不始。 此之谓也。 妙达此源竟无差舛，心等於道，道能於心，即道是心，即心是道，心之与道，一性而然，无然无不然，故妙矣。 在有不滞於有，而不乖於无； 在无不滞於无，而不乖於有。 无所不在，无所不通，融神去会，真常之性契矣。 所谓通心达观，极乎无极者矣。 众生沉沦苦海，莫不因心而然。 灭妄归真，自然之源妙矣。 一者生氤氲也，氤氲生於两半。 夫摄心住一，名为安定。 灰心忘一，名为灭定。 悟心真一，名为泰定。 身腾羽化，名日仙人。 形等真神，名日真人。 体同於性，名曰圣人。 心镜明慧，名日悟仙之人。 心达真神，名日悟真之人。 心合真性，名日悟圣之人。 然三定四等之心，能阶至道。 四等心者，为厅细微妙也。 是以澄修之人，极赢而至细，极细而至微，极微而至妙，极妙而道矣。 然愚痴狂躁，谓之厅。 清柔纯素，谓之细。 神融虚寂，谓之微。 至奥真源，谓之妙。 澄心内照，观想皆空，厅惑普消，谓之达康。 细妄尽灭，谓之达细。 晓了神微，谓之达微。 悟道妙通，谓之达妙。 ‘又夫结气色身，谓之厅。 游气通息，谓之细。 神智鉴用，谓之微。 正性真常，谓之妙。 修为纳养，夭损普消，谓之达赢。 和气流通，谓之达细。 形神同等，谓之达微。 形性泯然，谓之达妙。 是知色身为赢，游气为细，神智皆微，正性常妙。",
      "translated_text": "I take no small delight in seeing this endeavor come to fruition and recording it. As for the layout of its mountains, rivers, and temple structures, these have already been detailed in previous records, and I shall not repeat them here.\n\n**Record of the Charitable Ferry**\nNanfeng, once a prefecture, is now the superior county of Yu. Its mountains and waters are lofty and elegant, its people numerous and prosperous, and merchant sails and trading vessels constantly ply its markets. Its roads connect upward to Nanchang, Yuan, and Gan, and downward to Yu, Fu, Min, and Guang. The charitable ferry lies precisely at this vital crossing, where boats cannot but be established.\n\nThe stream lies five *li* from the county seat. Above it rise layered ridges and overlapping peaks, like an encircling belt facing north toward the elegance of Junfeng—this is called Tortoise Mound. During the Chongning era of the Song, the Perfected Lord of the Divine Palace, renowned for his Dao and conduct, was favored by Emperor Huizong. In his later years, he shed his mortal form there, and the auspicious sign of the tortoise further enhanced its fame.\n\nAmong the worthy and good of the county was one Zou Tiebie, who once received the Dao from the Shangguan family. Shangguan was a nephew of the Perfected Lord of the Divine Palace. Later, Zou again encountered the Perfected Lord, who personally transmitted to him its profound mysteries, and his Dao thus flourished. At that time, Wang Zhi, then magistrate of Nanfeng Prefecture, had once studied under Tiebie. During the transmission of the teachings, thunder suddenly shook the altar. Zou said, “I am about to transcend.” Wang, startled and overjoyed, offered all his wealth in devotion. Zou declined, saying, “I am but a cloud-and-water wanderer—what use have I for this?” Wang then requested to expand the Wondrous Numinous Abbey to enshrine and serve the Perfected Lord. The old abbey lay in another village, so it was relocated and rebuilt. From then on, whenever drought, flood, illness, or affliction struck, the residents’ prayers were invariably answered, and supplicants came daily. Yet the ferry still suffered from the hardship of crossing, which was neither convenient nor proper for those seeking profit. Thus, a boat was established at the ferry, and a pavilion built above it, providing a place for rest.\n\nDuring the military upheavals of the late Yuan, the pavilion fell into ruin, and the boat was destroyed. In the spring of the *gengwu* year of the Hongwu era, I once paid homage at the Perfected Lord’s shrine. At that time, the Wondrous Numinous Abbey lay overgrown and untended, so I ordered Zhang Hui, the Dharma heir of Yu, to raise funds and renovate it. Once the work was completed, in the *yihai* year, the Pavilion for Awaiting the Immortals was also rebuilt, and a boat was provided as a charitable ferry. Moreover, several *mu* of paddy fields were donated to support the ferryman and cover the cost of replacing the boat. This was a plan of profound foresight, and the compassionate concern for those burdened by crossing was fully preserved.\n\nSeveral times I was asked to compose a record of this. Now, *yi* (charity) is the fitting response to affairs. The image of a boat disperses and bridges what is impassable—this is the sage’s way of drawing analogies from things. Even the most ordinary streams and islets, though they do not comprehend their own nature, exemplify the forgetting of both inner and outer—this is the forgetting of the One.\n\nThe forgetting of the One is the heart. It is the heart that illuminates, utterly extinguishing all vexations, like a clear spring cleansing a filthy vessel. Once the vessel is ordered, it may be put to good use; once the heart is stilled, the universal is released, and only then can the true be attained. Thus the scripture says: “Ever without desire, observe its mystery.”\n\nYet once the mystery is truly mysterious, and forgetting is truly real, then inner and outer are wholly forgotten, and one transcends to attain both. Through this awakening to the mystery, one knows without knowing and attains the true One through the forgetting of the One. This is not merely about the One—it applies universally. Know that the One is the origin of the myriad things, and the myriad things are the instruments of the One. The not-One that is not the One is attained through the true One. The source of the true One is fundamentally without admixture, neither now nor ancient, neither perishing nor arising. Thus the *Scripture of the Most High* says: “Serene and solitary, it stands unchanging; circulating without beginning.” This is what it means.\n\nTo profoundly grasp this source is to be without error. The heart equals the Dao, and the Dao equals the heart—Dao is heart, and heart is Dao. Heart and Dao share a single nature, neither being nor non-being, and thus they are mysterious. Abiding in being, one is not attached to being yet does not depart from non-being; abiding in non-being, one is not attached to non-being yet does not depart from being. Everywhere present, nowhere obstructed, spirit and understanding merge, and the nature of true constancy is realized. This is what is meant by “penetrating the heart and attaining the ultimate view, reaching the limitless.”\n\nAll sentient beings sink in the sea of suffering, and this arises from the heart. To extinguish delusion and return to the true is the wondrous source of spontaneity.\n\nThe One is born of *yinyun* (primordial vapor). *Yinyun* arises from the two halves. To gather the heart and abide in the One is called *anding* (peaceful stability). To reduce the heart to ashes and forget the One is called *mieding* (extinguished stability). To awaken the heart to the true One is called *taiding* (supreme stability). To ascend bodily and transform into a feathered being is called an immortal. To equal the true spirit in form is called a perfected one. To embody the same nature is called a sage. A heart-mirror bright and wise is called one who awakens to immortality. A heart that penetrates the true spirit is called one who awakens to the true. A heart that unites with the true nature is called one who awakens to sageliness. These three stabilities and four grades of heart enable one to ascend to the Dao.\n\nThe four grades of heart are coarse, fine, subtle, and wondrous. Thus, those who cultivate and refine themselves push the coarse to its limit to reach the fine, the fine to its limit to reach the subtle, the subtle to its limit to reach the wondrous, and the wondrous to its limit to attain the Dao.\n\nNow, ignorance and frenzy are called coarse. Clarity, softness, and purity are called fine. Spirit merged with emptiness and stillness is called subtle. Profound attainment of the true source is called wondrous. To still the heart and inwardly illuminate, observing all thoughts as empty, so that coarse delusions universally dissolve, is called attaining the coarse. To utterly extinguish fine delusions is called attaining the fine. To comprehend the subtlety of spirit is called attaining the subtle. To awaken to the Dao and penetrate the wondrous is called attaining the wondrous.\n\nMoreover, the congealing of *qi* and the colored body is called coarse. The wandering of *qi* and the flow of breath are called fine. The mirroring and functioning of spirit and wisdom are called subtle. The constancy of true nature is called wondrous. Through cultivation, nourishment, and refinement, premature decay and universal harm are eliminated—this is called attaining the coarse. The harmonious flow of *qi* is called attaining the fine. The equality of form and spirit is called attaining the subtle. The dissolution of form and nature is called attaining the wondrous.\n\nKnow that the colored body is coarse, the wandering *qi* is fine, spirit and wisdom are subtle, and true nature is constantly wondrous.",
      "overlap_context": " which originated in the Tang and flourished in the Song and Yuan, is surely a case of \"a noble land producing outstanding people.\"\n\nTo have one’s name endure in the present age, and to be counted among renowned scholars like Lord Wen’an, is truly splendid. Yujing, with his keen and perceptive nature, excels in playing the *qin* and painting. His renovations and innovations must surpass even those of today. In entrusting him with the affairs of the abbey, the right person has indeed been chosen.",
      "start_char": 1252,
      "end_char": 2479,
      "start_sentence": 61,
      "end_sentence": 134,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.11488223075867,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\三论元旨.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "夫妙者何为哉。 对厅而说故也。 众生滞厅，所以令修於妙其於道也。 奚妙之乎。 於道以为言则无妙无不妙，对物以为言则有妙有不妙，於道以为言则无修无不修，对物以为言则有修有不修矣。 以因神达性，不神而神。 因赢弃妙，非妙而妙。 然灰心灭智而坐虚妄者，寂灭法也。 融神育气而坐兼忘者，长生法也。 生而后灭者，谓之寂灭。 灭而后生，谓之真生。 能达灭后之生，则泯真空妙有矣。 然迷而三界是三清，事则易知，理难达者也。 夫不为空有可欲之所乱，常融心湛然之地者，其至人蕴奥之心乎。 然所猿揉狠狩不可卒而禁制者，其犹众生狂愚乎。 夫息乱以静，守静以常，动而能澄，静而能照，则绿智绿性而虚妄、真智真性而晓了者，此乃至悟之士也。 夫安其和，寡其欲，守其朴，无听之以耳，而听之以心，无听之以心，而听之以气，无听之以气，而付之以性，於事全而能忘，於理忘而能全者，此则兼通之士也。 夫寻文视听而知於性者，假矣。 澄虚内照而合於性者，真焉。 能遗假而通真，则假亦真矣。 真源章第三五篇 夫道以虚通育物，褊备群方，真源则神应灵微，气运乃随方成器。 然有形之类，皆资黑以生焉。 有识之知，悉禀神而谓矣。 夫神者性之用，识者神之用。 夫元气者，性之用； 阴阳黑者，元黑之用； 色相阴阳，黑之用矣。 故《太上经》云：道冲而用之。 《南华经》云精神生於道。 此之谓也。 坦然备一切之际，谓之性； 独然褊一身之际，谓之神。 夫身者，神识之所器； 心者，神识之所都。 故《西升经》云：身者神之舍，识亦因神而生。 夫神之於识，犹日之於光。 光因日而生，光非日体； 识因神而起，而识非神真。 神於身内，能识於外，性普湛然，动不乖寂。 以神望性，则性妙而神瘫。 以神望身，则身赢而神妙。 然性神识之由本同而用异，悟则通神合性，迷则滞识乖神。 夫滞识乖神者，随气运而沦死生。 通神合性者，妙然而能常自在。 是以有性之物，谓神感气而成形，故形识双备矣。 无情之类，禀黑而已，不禀於神，故有形而无识。 是知神能为物之识，不能为物之形。 黑能为物之形，不能为物之识。 则性神有灵，黑相无识者也。 然禀阴阳五行之黑者，乃更盛衰，至於正性真源，常无盈竭。 夫质生之物，黑散而为死，黑聚而为生，然黑有聚散之差，神无生灭之别。 是知用神而能运黑，因黑亦能资神，聚则同成，散而各运。 夫荤擅秽味，能资阴阳之浊黑； 妙药清和，能资元和之正黑。 正黑全而资神者，则无为无欲。 阴阳之黑浊而资神者，则多欲多为。 然多欲多为，则夭枉流溺之源。 无为无欲，则湛尔常存之要。 物之本生，则中道而起，滞识迁生，乃随业而行，输转不离於道中，不悟道而何也？ 然有情有相，则有别有分，逐境生绿，积绿成业，受报不通，返照故也。 能悟玄微湛然虚妙，虽绿而非绿，虽境而非境，不为绿境之所摄，亦何业报之有哉。 夫三业六根纷惑者，则黑浊情昏； 静虑全虚，则神清气爽。 故《本际经》云：响清浊随其本声。 又云：皆由众生业绿所感。 故《西升经》云：积善之气至，积恶之气至。 然恶气浊壮，增黑暗而生迷。 善气清全，洞虚明而晓朗。 明而晓者，若拨雾而觊青天。",
      "translated_text": "What, then, is the wondrous? It is spoken in contrast to the coarse. Beings are mired in the coarse, and thus are urged to cultivate the wondrous in relation to the Dao.\n\nWhat is wondrous about it? In terms of the Dao, there is no wondrous and no non-wondrous; in relation to things, there is the wondrous and the non-wondrous. In terms of the Dao, there is no cultivation and no non-cultivation; in relation to things, there is cultivation and non-cultivation.\n\nThrough spirit, one penetrates nature, becoming spirit without being spirit. Through the coarse, one discards the wondrous, becoming wondrous without being wondrous. Yet those who extinguish the heart and obliterate wisdom to sit in emptiness and delusion practice the Dharma of quiescent extinction. Those who fuse spirit and nurture *qi* to sit in dual forgetting practice the Dharma of longevity.\n\nExtinction following birth is called quiescent extinction. Birth following extinction is called true birth. To penetrate birth after extinction is to dissolve into true emptiness and wondrous existence.\n\nYet the deluded perceive the Three Realms as the Three Pure Ones—this is easily known in practice but difficult to comprehend in principle. Those who are not disturbed by the desires of emptiness and existence, and who constantly abide in the serene clarity of the heart, possess the profound mind of the perfected person.\n\nYet the restless, violent, and unruly impulses that cannot be swiftly restrained resemble the madness and folly of beings. To quell chaos with stillness, to preserve stillness with constancy, to be lucid in movement and illuminating in stillness—those who thus refine wisdom and nature to dispel delusion, and who embody true wisdom and true nature with clarity, are the profoundly awakened.\n\nTo rest in harmony, to diminish desires, to preserve simplicity, not to listen with the ears but with the heart, not to listen with the heart but with *qi*, not to listen with *qi* but to entrust it to nature—those who are complete in affairs yet able to forget, and who forget in principle yet remain complete, are the comprehensively enlightened.\n\nThose who seek knowledge through texts, sight, and hearing are relying on the artificial. Those who clarify emptiness and inwardly illuminate to unite with nature are genuine. To abandon the artificial and penetrate the real is to make the artificial real as well.\n\n**Chapter Thirty-Five: The True Source**\nThe Dao nurtures beings through emptiness and pervades all directions; the true source responds spiritually with subtlety, and *qi* moves to form vessels according to their nature. All corporeal kinds rely on *qi* to live, while all sentient awareness is endowed by spirit.\n\nSpirit is the function of nature; awareness is the function of spirit. Primordial *qi* is the function of nature; yin-yang and *qi* are the functions of primordial *qi*; form and yin-yang are the functions of *qi*. Thus, the *Scripture of the Supreme* states: \"The Dao is empty yet inexhaustible in use.\" The *Scripture of Southern Florescence* states: \"Spirit and essence are born of the Dao.\" This is what is meant.\n\nTo be vast and embrace all is called nature; to be singular and pervade the individual is called spirit. The body is the vessel of spirit and awareness; the heart is the capital of spirit and awareness. Thus, the *Scripture of Western Ascent* states: \"The body is the abode of spirit.\" Awareness also arises from spirit.\n\nSpirit in relation to awareness is like the sun in relation to light. Light arises from the sun but is not the sun’s body; awareness arises from spirit but is not the true spirit. Spirit within the body can perceive externally, while nature is universally serene, its movement never deviating from stillness.\n\nViewing nature from spirit, nature is wondrous while spirit is coarse. Viewing the body from spirit, the body is coarse while spirit is wondrous. Though nature, spirit, and awareness share the same origin, their functions differ. Awakening unites spirit with nature; delusion mires awareness and severs spirit.\n\nThose mired in awareness and severed from spirit drift through life and death with the movement of *qi*. Those who unite spirit with nature are wondrously and perpetually free. Thus, sentient beings are said to form shapes through the resonance of spirit and *qi*, possessing both form and awareness. Insentient kinds are endowed with *qi* alone, lacking spirit, and thus have form but no awareness.\n\nKnow that spirit can become the awareness of beings but cannot become their form. *Qi* can become the form of beings but cannot become their awareness. Thus, nature and spirit are numinous, while *qi* and form are insentient.\n\nBeings endowed with yin-yang and the Five Phases undergo growth and decline, but the true source of correct nature is never exhausted or depleted. Corporeal beings die when *qi* scatters and live when *qi* gathers, yet *qi* has distinctions of gathering and scattering, while spirit has no difference between life and extinction.\n\nKnow that spirit can move *qi*, and *qi* can also sustain spirit. When gathered, they form together; when scattered, each moves independently. Impure flavors and foul odors sustain the turbid *qi* of yin-yang; wondrous medicines and pure harmony sustain the correct *qi* of primordial harmony.\n\nWhen correct *qi* is complete and sustains spirit, there is non-action and non-desire. When the turbid *qi* of yin-yang sustains spirit, there is much desire and much action. Much desire and much action are the source of premature decay and drowning in suffering. Non-action and non-desire are the essence of serene and constant existence.\n\nThe origin of beings arises from the middle way. Mired in awareness, they transmigrate according to karma, revolving without leaving the Dao—yet why do they not awaken to the Dao? Sentient beings with form and appearance have distinctions and divisions. Pursuing objects, they generate delusion; accumulating delusion, they form karma. Unable to escape retribution, they fail to reflect inwardly.\n\nThose who awaken to the profound and serene emptiness, though deluded yet not deluded, though bound to objects yet not bound, are not captured by delusion or objects—how then could there be karmic retribution? The confusion of the three karmas and six senses arises from turbid *qi* and clouded emotions; in tranquil contemplation and perfect emptiness, spirit is clear and *qi* is refreshing.\n\nThus, the *Scripture of the Original Boundary* states: \"Sound, whether clear or turbid, follows its original tone.\" It also states: \"All is felt according to the karma of beings.\" The *Scripture of Western Ascent* states: \"The *qi* of accumulated goodness arrives; the *qi* of accumulated evil arrives.\"\n\nYet evil *qi* is turbid and strong, increasing darkness and generating delusion. Good *qi* is pure and complete, penetrating emptiness and illuminating clarity. To be illuminated and clear is like parting the mist to glimpse the azure sky.",
      "overlap_context": " of true nature is called wondrous. Through cultivation, nourishment, and refinement, premature decay and universal harm are eliminated—this is called attaining the coarse. The harmonious flow of *qi* is called attaining the fine. The equality of form and spirit is called attaining the subtle. The dissolution of form and nature is called attaining the wondrous.\n\nKnow that the colored body is coarse, the wandering *qi* is fine, spirit and wisdom are subtle, and true nature is constantly wondrous.",
      "start_char": 2479,
      "end_char": 3694,
      "start_sentence": 135,
      "end_sentence": 204,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.269657373428345,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\三论元旨.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "黑而暗者，乃浑河而被流溺。 是以暗明双遣，善恶两冥，至极真源，流通妙本者，则自然之奥也。 夫自然者，无为之性不假他因，故日自然。 修行之人，因有为而达无为，因有生而达无生。 了乎自绿，契於自然，则无生之性达矣。 性不无生，而能无所不生。 无所不生，而妙本未尝为生。 是以无为之为、无相之相者，道之妙体也。 有为之为、有相之相者，道之庞用也。 妙本之於无本也。 夫心者，众邪之主，亦为众妙之门。 然性神识之源深，莫不因心而照达。 夫蠢尔苍生，名为愚识，罔知礼法，名为浅识； 辩虑聪明，名为智识； 恬柔素朴，名为淳识； 澄心虚寂，名为静识； 灰心灭智，名为忘识； 内鉴分明，名为慧识； 晓达神真，名为微识； 洞达性海，名为妙识。 嗟乎，时人滞庞识者众焉，达神微者缈矣。 夫达神者啡无於识，虽识而通。 滞识者非无於神，虽神而隔。 达神微者，则神之与识，体用双明。 滞厅识者，偏见於识，不会於神矣。 又欲会神通性者，先修摄念观，次修忘心观，则灰心灭智，诸境寂然，外听无声，内视非色，於无色之际，豁然微悟，神灵虚融，此则神理矣。 融神虚泯，杳会无涯，坦然浩荡，而玄通妙性，真宗而达矣。 ．是知以识照识，极识而通神； 以神照神，极神而通性。 通性则性自见性，通神亦神自见神。 然神自见神、性自见性者，此则真见也。 以识见神、以神见性者，此乃妄见也。 然达得定心，犹不堕於恶道，而况神通合性者乎。 盖神微性妙，性虽有灵，本体湛然而无妄。 众生滞识不通者，名为妄心。 晓达神源，不舍妄而真也。 然性之为体，在空同空而非空，在色同色而非色，而能褊空色，常寂常通，所谓大无不包，细无不入。 一未入三界，二入无色界，三入色界，四入欲界，五入恶道。 夫妙药可以养和，坐忘而能照性，养和而形不死，达性而妄不生。 然不死不生，则形变通神，羽化真仙之道也。 故上清、太清、真诰等经，皆云金丹妙药、炼气通神，可以轻举仙腾，登真合圣者也。 是知妄想除而骂悟道之要，神气泰亦为不死之枢。 妄不除而称修道者，犹执瞽以求明。 炼想寂而通神真者，若钻木而兴焰矣。 夫精思坐忘、通神悟性者，此则修神之法也。 导引形躯、吐纳元和者，此则修身之法也。 然修神而不修黑者，灭度之法也。 修黑而不修神者，延年之法也。 神黑兼而通修者，学仙之法也。 夫修神以炼心为首，纳黑以导引为先，导引畅於太和，炼心通於众妙，足使神融虚白，黑逸清全，变神黑而流通，亦何真而不备。 故夫上士修道，则尘劳普释，晓了真源，正智圆融，含融养妙，全和而命续，犹为薪而火传。 久视长生，乃升霓於仙景，从仙入真，从真合圣，圣则流通之妙也。 此乃不舍有为之躯，而达无为之性也。 中士修真，心源晓达，身相同凡，灭弃漏躯，方之圣境，此乃舍有为之形，达无为之性矣。 上士形神俱达，永妙真源。 中士神达身沉，然须灭度。 下士神形未达，可以随业迁因。 道常一相自然，物有万端之别。 道能生於物，即物而非道真。 然以道观之，则万物万法洞通於一道。 以物观之，则万物万法各执於一途。 物虽差而道不差，法虽异而道不异，有为灭而道不灭，空色断而道不断。",
      "translated_text": "Those shrouded in darkness and obscurity are like those drowning in a muddied river. Thus, when darkness and light are both transcended, when good and evil are both obscured, and when the utmost true source and the flowing wondrous origin are reached, this is the mystery of spontaneity.\n\nSpontaneity is the nature of non-action, requiring no external cause—hence it is called \"spontaneous.\" Those who cultivate practice attain non-action through action, and reach non-birth through birth. When one fully comprehends the self and accords with spontaneity, the nature of non-birth is realized. This nature is not without birth, yet it can give rise to all things. Though it gives rise to all things, the wondrous origin has never truly been born. Thus, the non-action of non-action and the form of no-form are the wondrous essence of the Dao. The action of action and the form of form are the vast functions of the Dao. The wondrous origin, in its relation to the originless—\n\nThe mind is the master of all delusions and also the gateway to all wonders. The depths of the nature, spirit, and consciousness are all illuminated and penetrated through the mind. Yet the foolish masses, called \"deluded consciousness,\" know nothing of ritual and law, and are thus called \"shallow consciousness.\" Those with discerning thoughts and keen insight are called \"wise consciousness\"; those serene, gentle, and unadorned are called \"pure consciousness\"; those with a settled mind and empty tranquility are called \"still consciousness\"; those who extinguish the mind and abolish wisdom are called \"forgotten consciousness\"; those with clear inner reflection are called \"discerning consciousness\"; those who comprehend the divine and true are called \"subtle consciousness\"; those who penetrate the ocean of nature are called \"wondrous consciousness.\"\n\nAlas, many in this age are mired in coarse consciousness, while those who grasp the divine and subtle are rare. Those who grasp the divine transcend consciousness, though they remain connected to it. Those mired in consciousness are not without spirit, yet they remain separated from it. Those who grasp the divine and subtle see both essence and function clearly in spirit and consciousness. Those mired in coarse consciousness cling to partial views of consciousness and fail to unite with spirit.\n\nTo unite with spirit and penetrate nature, one must first cultivate mindfulness meditation, then proceed to the meditation of forgetting the mind. When the mind is extinguished and wisdom abolished, all realms become still. Externally, no sounds are heard; internally, no forms are seen. In the midst of formlessness, a sudden subtle awakening arises—spirit becomes empty and fused, and this is the principle of spirit. When spirit is fused and emptiness dissolved, merging into boundlessness, one abides in vast openness, and the wondrous nature of the Dao, the true origin, is realized.\n\nThus, using consciousness to illuminate consciousness, one exhausts consciousness to penetrate spirit. Using spirit to illuminate spirit, one exhausts spirit to penetrate nature. Penetrating nature, nature sees itself; penetrating spirit, spirit sees itself. When spirit sees itself and nature sees itself, this is true seeing. Using consciousness to see spirit or spirit to see nature is deluded seeing.\n\nThose who attain a settled mind do not fall into evil destinies—how much more so for those whose spirit unites with nature? The subtle spirit and wondrous nature, though inherently numinous, are fundamentally tranquil and free from delusion. Beings mired in consciousness without penetration are called \"deluded minds.\" Those who comprehend the source of spirit do not abandon delusion for truth.\n\nThe essence of nature abides in emptiness, identical to emptiness yet not emptiness; it abides in form, identical to form yet not form. It can encompass both emptiness and form, ever still and ever penetrating—what is vast contains all, what is minute enters all. First, it does not enter the Three Realms; second, it enters the Formless Realm; third, it enters the Form Realm; fourth, it enters the Desire Realm; fifth, it enters the Evil Destinies.\n\nWondrous medicines can nurture harmony; sitting in forgetfulness can illuminate nature. Nurturing harmony prevents the body from dying; penetrating nature prevents delusion from arising. When neither death nor birth exists, form transforms and communicates with spirit—this is the way of feathered transcendence and true immortality. Thus, the *Shangqing*, *Taiqing*, and *Zhen’gao* scriptures all speak of the wondrous elixir of golden cinnabar and refining *qi* to communicate with spirit, enabling one to ascend lightly, become an immortal, and unite with the sagely.\n\nThus, eliminating deluded thoughts is the essential key to awakening the Dao, and the harmony of spirit and *qi* is the pivot of immortality. Those who claim to cultivate the Dao without eliminating delusion are like the blind grasping for clarity. Refining thoughts to stillness and penetrating the true spirit is like drilling wood to spark a flame.\n\nThose who concentrate the mind in sitting forgetfulness to penetrate spirit and awaken nature practice the method of cultivating spirit. Those who guide the body through movements and exhale and inhale primordial harmony practice the method of cultivating the body. Cultivating spirit without cultivating the body is the method of liberation. Cultivating the body without cultivating spirit is the method of prolonging life. Cultivating both spirit and body together is the method of learning immortality.\n\nIn cultivating spirit, refining the mind comes first; in absorbing *qi*, guiding and pulling movements take precedence. When guiding and pulling movements harmonize with the Great Harmony, and refining the mind penetrates all wonders, spirit fuses with empty clarity, and *qi* flows freely in purity. Transforming spirit and *qi* to circulate freely—what truth is not then complete?\n\nThus, superior practitioners of the Dao universally release worldly toils, comprehend the true source, perfect wisdom, and embrace the wondrous. Nurturing harmony, they preserve life, like fire passed from one torch to another. With long vision and eternal life, they ascend on rainbows to the immortal realm, progressing from immortality to truth, from truth to sageliness—sageliness is the wondrous flow of communication. This is not abandoning the body of action but attaining the nature of non-action.\n\nMiddle practitioners of the truth comprehend the source of the mind, yet their bodily forms remain ordinary. They abandon the leaking body to enter the sagely realm—this is abandoning the form of action to attain the nature of non-action.\n\nSuperior practitioners attain both form and spirit, eternally wondrous in the true source. Middle practitioners attain spirit but sink the body, thus requiring liberation. Inferior practitioners fail to attain either spirit or form and follow karmic transmigration.\n\nThe Dao is eternally one in its spontaneous form, while things differ in myriad ways. The Dao can generate things, yet things are not the true Dao. Observing through the Dao, the myriad things and dharmas all communicate through the one Dao. Observing through things, the myriad things and dharmas each cling to their own path. Though things differ, the Dao does not differ; though dharmas vary, the Dao does not vary. Though action ceases, the Dao does not cease; though emptiness and form are severed, the Dao is not severed.",
      "overlap_context": "y* states: \"Sound, whether clear or turbid, follows its original tone.\" It also states: \"All is felt according to the karma of beings.\" The *Scripture of Western Ascent* states: \"The *qi* of accumulated goodness arrives; the *qi* of accumulated evil arrives.\"\n\nYet evil *qi* is turbid and strong, increasing darkness and generating delusion. Good *qi* is pure and complete, penetrating emptiness and illuminating clarity. To be illuminated and clear is like parting the mist to glimpse the azure sky.",
      "start_char": 3694,
      "end_char": 4914,
      "start_sentence": 205,
      "end_sentence": 266,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.74040365219116,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\三论元旨.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "实相湛然而然、虚通一切自在者，即大通之道也。 然夫道者，乃万法之根源。 妙达真常，则返本还元之谓矣。 道之於众生，犹帝之於黎庶，登帝位者，万法归焉。 达妙道者，万法而亦见矣。 故《本际经》云：具一切智，成无上道之谓也。 色聚，识聚，心聚，想聚，四聚成，乃善恶生也。 夫大乘平等，无盈无端，渐教法门，有修有证。 是知因舟而能达岸，达岸而舍舟。 因学而以成功，功成而学亦遣。 故《德经》云：为学日益，为道日损，损之又损，以至於无为，无为而无不为。 夫为学者日益有为之见，为道者日损有为有见之知，因损有以通无，能通无而具有。 然真源湛寂，应感随机，众生根有利钝之差，圣人教亦渐顿之别。 且修行有为，名为渐教； 真证无为，名为顿教。 真性周普，褊备群方，名为道应。 在汉说经，於胡演教，名为别应。 一切众生性同道性，名为通感，随类受器，名为别感。 故《海空经才百：圣人无为，众生故应有为。 又云：众生感圣，因绿不同，圣应众生，其体亦异。 是以妙本湛然，名日真身； 演尔法相，名日应身； 随因受果」名曰报身。 故有妙中之庞，庞中之妙。 圣人应有为，即是妙中之巍； 众生悟无为，则是庞中之妙。 然而一切万法，元从窈冥中来，自然之理具焉，因绿之方同矣。 故夫道一性，而能应於一切神； 性一神，而能应於一切物； 物禀神一，而能应乎一切识。 应神作合生之智，应黑为万类之形，应身垂圣化之慈，应性导群迷之惑。 夫性者，虚无自然之妙灵也。 应圣者，性之妙用也。 应神者，性之微用也。 应黑者，性之细用也。 色相者，性之庞用也。 然应圣者，应身之圣人也。 相者，天地万物一切有为之形相也。 是以应能生万物而非能生，能成万物而非能成，能有万物而非能有，能空万物而非能空。 非物而能物，不得於物； 非法而能法，不滞於法。 应而不乖其本者，则惟大道真常之性焉。 六A口群兴，而道也非兴； 三界劫变，而道也非变。 修而能合於道者，莫先於神矣，而黑乃次之。 夫身三万六千神者，则一身所生统运也。 用异而通归一者，亦由手足於身乎。 相中又相，乃是异中而同。 神中又神，则是同中而异。 虽则有无对立，而事理兼通。 故自然中有因绿，因绿中有自然，自然不离於因绿，因绿不离於自然，而能异之而同者矣。 然夫一切因绿者，悉是自然之因绿也。 从本降迩，随所用而多差； 摄迩皈本，亦包罗而无外。 真体包罗万象，玄应变化大千，故能妙统一神，分别百亿也。 盖不别宝者，无以知其贵； 不明道者，无以体其真。 物禀道而生，故物有道性。 不悟道者，由弱丧之俗迷童。 至教应焉，则教能荃理。 不知於教者，乃八难之矣。 忧訾毁圣，亦三涂痛之。 然以道无不在，抑亦不虑众生，悟则能通，相去何远。 故《真藏经》云：一切烦恼，皆为正性之比顿，即妄而真。 所谓动不乖寂，寂不乖动，应常能真，真能常应者矣。 故《西升经》云：道不独在我，万物皆有之。 是以能行者能通，能通则圣也。 真一、正一、三一，守之道成。 夫混成大象，应用多端，未悟之人，理难正信。 今引诸经要证，用遣疑者之心。 故《太上经》日：太象无形。 又《西升经》云：天下柔弱，莫过於道。",
      "translated_text": "The true reality abides in serene spontaneity, pervading all with effortless freedom—this is the Dao of great penetration. The Dao is the root-source of the myriad dharmas. To wondrously attain the true and constant is to return to the origin and revert to the primordial.\n\nThe Dao’s relation to sentient beings is like that of an emperor to the common people: those who ascend the imperial throne command the allegiance of all dharmas. Those who attain the wondrous Dao likewise perceive all dharmas. Thus the *Sutra of the Fundamental Limit* states: possessing all wisdom and accomplishing the supreme Dao.\n\nForm aggregates, consciousness aggregates, mind aggregates, and perception aggregates—when these four aggregates coalesce, good and evil arise. The Great Vehicle is level and equal, without excess or limit, while the gradual teachings of the Dharma-gate entail cultivation and realization. Thus, one relies on the boat to reach the shore, then abandons the boat upon arrival. One relies on study to achieve success, then discards study once success is attained. As the *Virtue Classic* says: \"For learning, daily increase; for the Dao, daily decrease—decrease and further decrease until reaching non-action, where non-action accomplishes all.\" Those who pursue learning daily augment their views of action, while those who cultivate the Dao daily diminish their knowledge of action and views. By diminishing the existent, one penetrates the non-existent; by penetrating the non-existent, one possesses all.\n\nYet the true source abides in profound stillness, responding and adapting to conditions. Sentient beings differ in the sharpness or dullness of their roots, so the teachings of the sages likewise vary between gradual and sudden. Cultivation through action is called the gradual teaching; true realization of non-action is called the sudden teaching. The true nature pervades all, perfectly equipping every method—this is called the Dao’s response. Expounding sutras in Han lands and teaching in foreign regions—this is called a distinct response. All sentient beings share the same nature as the Dao—this is called universal resonance; receiving teachings according to their kind—this is called distinct resonance.\n\nThus the *Sutra of the Ocean of Emptiness* states: \"The sage is non-active; sentient beings therefore respond with action.\" It further says: \"Sentient beings resonate with the sage through different conditions; the sage’s response to sentient beings likewise varies in form.\" Therefore, the wondrous essence abiding in stillness is called the true body; manifesting in phenomenal forms is called the responsive body; receiving retribution according to causes is called the reward body.\n\nWithin the wondrous lies the vast, and within the vast lies the wondrous. When the sage responds to action, it is the wondrous within the vast; when sentient beings awaken to non-action, it is the wondrous within the vast. Yet all myriad dharmas originally emerge from the profound and obscure, where the principle of spontaneity resides, and the conditions of causes are the same.\n\nThus, the Dao is one in nature yet can respond to all spirits; spirit is one yet can respond to all things; things receive one spirit yet can respond to all consciousness. Responding to spirit produces the wisdom of harmonious life; responding to form manifests the shapes of the myriad kinds; responding with the body extends the sage’s compassionate transformation; responding with nature guides the deluded masses. Nature is the wondrous numen of emptiness and spontaneity. Responding to the sage is the wondrous function of nature; responding to spirit is the subtle function of nature; responding to form is the minute function of nature; phenomenal appearances are the vast function of nature.\n\nThe sage who responds is the sage of the responsive body. Phenomena are the forms of all conditioned things in heaven and earth. Thus, the response can generate the myriad things yet does not generate; can accomplish the myriad things yet does not accomplish; can possess the myriad things yet does not possess; can empty the myriad things yet does not empty. Not being a thing yet able to act as things, it is not confined by things; not being a dharma yet able to act as dharmas, it is not bound by dharmas. Responding without deviating from its root—this is the true and constant nature of the great Dao.\n\nThe six paths arise in throngs, yet the Dao does not arise; the three realms undergo kalpic transformations, yet the Dao does not change. To cultivate and unite with the Dao, nothing precedes spirit, while form follows after. The thirty-six thousand spirits of the body are the unified governance of a single life. Their functions differ yet all return to one—like the limbs of a body. Phenomena within phenomena reveal sameness within difference; spirits within spirits reveal difference within sameness. Though existence and non-existence stand opposed, principle and phenomenon interpenetrate.\n\nThus, within spontaneity there are causes, and within causes there is spontaneity. Spontaneity does not depart from causes, nor causes from spontaneity—yet they differ while being the same. All causes are ultimately the causes of spontaneity. From the root descending to the near, functions vary according to use; gathering the near to return to the root, all is encompassed without exclusion. The true essence embraces all images, its mysterious responses transforming the great chiliocosm—thus it can wondrously unify one spirit while distinguishing a hundred billion.\n\nWithout distinguishing treasures, one cannot know their value; without illuminating the Dao, one cannot embody its truth. Things receive the Dao and are born, thus things possess the Dao-nature. Those who do not awaken to the Dao are deluded by the customs of a degenerate age. The supreme teaching responds, and teaching can guide to principle. Those who do not know the teaching suffer the eight difficulties; slandering and reviling the sage incurs the three painful destinies.\n\nYet the Dao is omnipresent, and one need not despair over sentient beings—for awakening enables penetration, and how distant is the separation? Thus the *Sutra of the True Treasury* states: \"All afflictions are but the adornments of true nature,\" turning delusion into truth. This is what is meant by: movement does not deviate from stillness, stillness does not deviate from movement; response abides in truth, truth abides in constant response. As the *Western Ascent Sutra* says: \"The Dao is not mine alone—all things possess it.\" Thus, those who can practice can penetrate, and those who can penetrate are sages.\n\nPreserving the true one, the correct one, and the threefold one—this is the Dao’s accomplishment. The great image of primordial chaos has manifold applications, yet the unenlightened find its principles difficult to rightly believe. Now I cite essential passages from various sutras to dispel the doubts of seekers. Thus the *Supreme Sutra* says: \"The great image has no form.\" And the *Western Ascent Sutra* states: \"Nothing in the world is softer or weaker than the Dao.\"",
      "overlap_context": " its spontaneous form, while things differ in myriad ways. The Dao can generate things, yet things are not the true Dao. Observing through the Dao, the myriad things and dharmas all communicate through the one Dao. Observing through things, the myriad things and dharmas each cling to their own path. Though things differ, the Dao does not differ; though dharmas vary, the Dao does not vary. Though action ceases, the Dao does not cease; though emptiness and form are severed, the Dao is not severed.",
      "start_char": 4914,
      "end_char": 6142,
      "start_sentence": 267,
      "end_sentence": 338,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.220682382583618,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\三论元旨.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "道之所以柔弱者，包裹天地，贯穿万物。 《真藏经》云：天下柔弱，包罗无外，妙少细微。 《南华经》云：至精无形，至大不可围。 此明至道无为，包罗万象。 《老子经》云：道生之，德畜之。 《太上三清天正经》云：道大渺莽幽幽，太无变化而生黑焉。 《太平经》云：道包无表裹，其能生精神。 《南华经》云：夫道有情有信，无为无形，神鬼神帝，生天生地。 此明神之与黑，天地万物，皆为道用者焉。 《西升经》云：念我未生时，未有身也，真以积气，成我身尔。 又云：形不得神，不能自生，神不得形，不能自成，形神合同，更相生成。 此明有性之类，皆谓神黑相感，生成於身。 神在蝼蚁之中，能等蝼蚁之体。 神在象马鸥鹏之中，亦等鹃鹏象马之形。 神随质而短长，质依神而起用。 分别善恶谓之识，潜幽灵变谓之神。 能运於身者，其惟神乎。 身在神存，神去则身死。 夫身禀一神，乃生三万六千之神，身死之际，三万六千之众还归一神，而乃去之。 一神居之而等一身，於一之中而等众神。 禽兽禀一是同，未若人之数备於神。 多少既尔，於气清浊亦然。 所感万差，故有多异。 草木之类，惟气所生，不禀神成，故无识用，既无於识，是亦无业。 《本际经》云：诵念是经，即得开度，神升南宫。 《度人经》云：魂神暂灭，不经地狱，即得返形。 又〔云〕：亿曾万祖幽魂苦爽，皆即受度。 此明修善之人，神归善道，非唯於己，亦及於亲。 《大戒经》云：心神振动，生於爱欲，使人迷荒。 《本际经》云：多所伤害，身死神去，流转三途。 此明为恶之人，神受苦对。 《升玄经》云：幽通虚闲，神朗希夷。 《业报经》云：冥心静虑，归神通道。 《南华经》云：离形去智，同於大通。 《本际经》云：不可使然，不可不然，故日自然，悟此真性，名为悟道。 此明虚妄之人，通神悟性，蝉蜕小神之人，假神归大道之真。 夫道之於称性者，异名尔。 夫火性而用能应燥，水性而用能应湿者，此明五行之性，非至道之性也。 五行既尔，万象可知，虽则大同，亦还小异。 是以无情之类皆有种性，有情之物皆有绿性，至道虚通谓之妙性矣。 《本相经》云：爱神护气，能致长生。 《业报经》云：炼黑易形，转神归道。 《西升经》云：与道同身而无体。 此明形之与黑俱炼，变而成神，转神归道，与道同神，是能包罗万象，神乃惟等一身。 神禀道而能灵，物禀神而有识。 道乃湛然一相，妙体真常。 神之与黑二差，俱为道用。 黑则无涯无际，神则有转有迁。 神灵而黑不灵，黑广而神不广。 黑则有清有浊，神则有兴有歇。 湛尔常然，其惟道矣。 是以博学多闻能益於识，存真炼黑能益於神，神益通无待之源，识益增有为之用，有为则有穷有极，无为则无穷无极。 奈悠悠之徒，不知此之妙也。 《升玄经》三科法行云：此法轮三科，乃是经法之常科，无量世之常科，万圣所不能异也。 科有上士、中士、下士，而末章云教导三乘，即三士是三乘也，更无别指。 士者，事也。 夫至士者，一之行怀，誓必得道，终卒其事，理无中废。 士以能卒为义，乘以运载为道。 谓言其略曰： 上士广开法关，先人后己，救度国君，损己济物，仁及乌兽，惠逮有生，恭师奉法，常如对神，长斋苦思，精研洞玄，吐故纳新，心灰体槁，意勤气柔，人神并劝，如此之行，一灭一生，志不退转，克成上仙。",
      "translated_text": "The reason the Dao is soft and weak is that it envelops Heaven and Earth and permeates the myriad things. The *True Treasury Sutra* states: \"In all under Heaven, nothing is softer or weaker, yet it encompasses all without exclusion, subtle and minutely refined.\" The *Nanhua Sutra* says: \"The most refined has no form; the greatest cannot be encompassed.\" This clarifies that the supreme Dao, being non-action, embraces all phenomena. The *Laozi Sutra* says: \"The Dao gives them life; virtue nurtures them.\" The *Supreme Three Heavens Orthodox Sutra* states: \"The Dao is vast, boundless, and profoundly obscure; from the Great Void’s transformations, darkness arises.\" The *Scripture of Great Peace* says: \"The Dao envelops what lies beyond form; it generates spirit and essence.\" The *Nanhua Sutra* states: \"The Dao possesses sentiment and sincerity, is without action and form; it spiritually empowers ghosts and gods, gives birth to Heaven and Earth.\" This clarifies that spirit and darkness, Heaven and Earth, and the myriad things all serve as instruments of the Dao.\n\nThe *Western Ascent Sutra* says: \"When I recall the time before my birth, before I had a body, it was true essence accumulated as qi that formed my body.\" It further states: \"Form without spirit cannot generate itself; spirit without form cannot complete itself. Only when form and spirit unite do they mutually engender and perfect.\" This clarifies that all beings with nature arise from the mutual resonance of spirit and darkness, which gives rise to the body. Spirit resides within ants, assuming the form of ants; spirit resides within elephants, horses, osprey, and roc, assuming their shapes. Spirit adapts in length to the substance, while substance depends on spirit to activate its function. Discerning good and evil is called *shí* (discernment); the hidden, numinous transformations are called *shén* (spirit). That which animates the body is none other than spirit. When the body exists, spirit abides; when spirit departs, the body dies.\n\nThe body receives one spirit, which generates thirty-six thousand spirits. At the moment of death, the thirty-six thousand spirits return to the one spirit, which then departs. One spirit dwells within and equals one body; within the one, it equals the multitude of spirits. Birds and beasts receive one in the same way, yet they do not possess the full complement of spirits as humans do. In quantity, this is so; likewise, in the purity or turbidity of qi. The resonances differ in myriad ways, hence the many variations.\n\nThe kinds of grasses and trees are generated solely by qi and do not receive spirit to complete their forms; thus, they lack discernment and function. Without discernment, they also lack karma. The *Original Boundary Sutra* states: \"Reciting and contemplating this sutra opens the path to liberation, and the spirit ascends to the Southern Palace.\" The *Scripture of Salvation* says: \"When the hun-soul and spirit momentarily vanish, one does not pass through hell but immediately regains form.\" It further states: \"The suffering souls of innumerable ancestors and past generations are all thereby delivered.\" This clarifies that those who cultivate goodness guide their spirits toward the good Dao, benefiting not only themselves but also their kin.\n\nThe *Great Precepts Sutra* says: \"When the heart-spirit is agitated, it gives rise to love and desire, causing people to wander in delusion.\" The *Original Boundary Sutra* states: \"Those who inflict much harm, upon death, their spirits depart and cycle through the three evil destinies.\" This clarifies that those who do evil suffer retribution in their spirits. The *Ascending Mystery Sutra* says: \"In profound communication and tranquil seclusion, the spirit becomes luminous and enters the subtle.\" The *Karmic Retribution Sutra* states: \"With a tranquil mind and serene contemplation, one returns the spirit to the Dao.\" The *Nanhua Sutra* says: \"Detach from form, abandon wisdom, and merge with the Great Communion.\" The *Original Boundary Sutra* states: \"It cannot be made to be so, nor can it be made not to be so—hence it is called *ziran* (self-so). Awakening to this true nature is called awakening to the Dao.\"\n\nThis clarifies that those who transcend illusion, attune to spirit, and awaken to nature—like cicadas shedding their shells—temporarily rely on spirit to return to the truth of the great Dao. The Dao, in relation to one’s inherent nature, is but a different name. Fire’s nature responds to dryness in its function, while water’s nature responds to moisture—this illustrates the nature of the Five Phases, not the nature of the supreme Dao. Since the Five Phases are thus, the myriad phenomena may be known. Though largely the same, they still differ in minor ways. Therefore, insentient kinds all possess their inherent nature, while sentient beings all possess their karmic nature; the Dao’s emptiness and pervasiveness are called its wondrous nature.\n\nThe *Original Form Sutra* says: \"Cherish the spirit and protect the qi, and you may attain longevity.\" The *Karmic Retribution Sutra* states: \"Refine the darkness and transform the form; turn the spirit to return to the Dao.\" The *Western Ascent Sutra* says: \"Become one with the Dao in body yet without form.\" This clarifies that when form and darkness are both refined, they transform into spirit; turning the spirit to return to the Dao, one unites with the Dao in spirit, thereby encompassing all phenomena. Spirit alone equals the one body. Spirit, empowered by the Dao, becomes numinous; things, empowered by spirit, gain discernment.\n\nThe Dao is profoundly still, of one appearance, its wondrous essence truly constant. Spirit and darkness differ in two ways yet both serve the Dao’s function. Darkness is boundless and without limit; spirit has transformation and transition. Spirit is numinous, while darkness is not; darkness is vast, while spirit is not. Darkness has purity and turbidity; spirit has activity and rest. Only the Dao remains eternally thus, serene and unchanging.\n\nTherefore, extensive learning and broad knowledge enhance discernment; preserving truth and refining darkness enhance spirit. Enhancing spirit connects one to the source without dependence; enhancing discernment increases the function of deliberate action. Deliberate action has limits and bounds; non-action is without limit or end. Alas, the careless multitude does not comprehend this subtlety.\n\nThe *Ascending Mystery Sutra*’s \"Three Disciplines of the Dharma Wheel\" states: \"These three disciplines of the Dharma Wheel are the constant disciplines of the scriptural teachings, the eternal disciplines of immeasurable kalpas, which no sage of the past has ever altered. The disciplines comprise the superior, middling, and inferior practitioners.\" The concluding chapter speaks of guiding the three vehicles, which are the three practitioners—no other designation exists. *Shì* (practitioner) means \"endeavor.\" The supreme practitioner embraces the conduct of the One, vows to attain the Dao without fail, and completes the endeavor without cessation. *Shì* (endeavor) signifies the ability to complete; *chéng* (vehicle) signifies the path of conveyance.\n\nTo summarize briefly:\nThe superior practitioner broadly opens the gates of the Dharma, placing others before self, delivering even rulers and kings, sacrificing self to aid others, extending benevolence to birds and beasts, bestowing kindness upon all living beings, revering teachers and upholding the Dharma as if in the presence of the divine, maintaining long fasts and arduous contemplation, delving deeply into the profound mysteries, expelling the old and absorbing the new, with a heart like cold ashes and a body like withered wood, intent unwavering and qi gentle, both human and spirit exerting effort. Such conduct, though entailing one death and one rebirth, ensures an unretreatant resolve to achieve the rank of highest immortality.",
      "overlap_context": " can penetrate are sages.\n\nPreserving the true one, the correct one, and the threefold one—this is the Dao’s accomplishment. The great image of primordial chaos has manifold applications, yet the unenlightened find its principles difficult to rightly believe. Now I cite essential passages from various sutras to dispel the doubts of seekers. Thus the *Supreme Sutra* says: \"The great image has no form.\" And the *Western Ascent Sutra* states: \"Nothing in the world is softer or weaker than the Dao.\"",
      "start_char": 6142,
      "end_char": 7413,
      "start_sentence": 339,
      "end_sentence": 398,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.22907519340515,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\三论元旨.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "一者行，二者愿，三者慈，四者悲。 行者如百八十戒、二百四十威仪，但摄身口意，万善之法，悉是行也。 十二上愿，愿也。 四十五念，慈也。 并出《洞玄灵宝经》。 方便开度者，则金录开度天子王侯，黄线开度祖弥，自然开度一切众生，是悲也。 行以绝恶为义，愿以玄期为契，慈者以德荫万物，悲者以拔苦为怀。 四科之道既立，即有一报之断矣。 中士志慕在玄，开度一切，救厄解患，施功报德，建玄福田，君亲忠孝，柔智怀仁，虚心至道，口味灵篇，食不念饱，衣不嫌寒，众行并备，三灭三生，补九宫真人，修玉清上道。 其行也谨，修三百大戒，诵大洞三十九章，思三一之法，持戒以绝恶，则五道无对，诵经以静神，则心不外驱，存一以空心，则神心淡泊。 淡泊定，则镜睹至道，升入无为，世报绝矣。 下士断情忍色，服御养神，愿弃荣丽，柄憩山林，爱山乐水，淡泊守固，绝谷休根，长斋念道。 端坐则与师相对，入出则与乌兽为群，孤旅岩亢，独宿空山，切柏拟妆，面有饥容，心如怀丹，见试不恐，神静心安。 如此之行，上感虚皇，九灭九生，志愿不退，克得变化，乘云飞行，游宴五岳，逍遥太无，从此而进，位登高仙，此与中士同修玉清之道。 经云：六通观法者，五色、五音、五味、五香、五财，华丽荣饰，一切乱性。 经云：天日洞视，地日洞听，束日洞空，西日洞虚，南曰洞清，北日洞微，六通智慧，观道成就，则舍除无量尘累，尘累既尽，名日六通。 《仙人经》日：慧眼、慧耳、慧鼻、慧口、慧身、慧心，入希夷之道，出三界法，一切皆空，名为六通。 《三界经》云：持戒者斋争之根，静者精思之本，精思者降真之由，降真者升道之宝。 经云：三宝之黑在心，三宝之士在边。 边者籍也，易也。 在心存思，行心履迩，变邪从正，积善立功之德备充，至乎宗极，极乎无极，引接众流，导其有志。 经云：精神内室，元黑长存，即长生久视之道。 夫黑以空虚为体，形色为用； 精以杳冥为体，光音为用； 神以微妙为体，变化为用。 经日：视之不见，夷也； 听之不闻，希也； 传之不得，微也。 此则神黑精三一之道，而混三为一，散一为二，一者无也，不一之一，谓之真一也。 三论元旨竟",
      "translated_text": "The first is *conduct*, the second is *vow*, the third is *compassion*, and the fourth is *lamentation*. *Conduct* encompasses the one hundred eighty precepts and two hundred forty rules of deportment, all of which govern body, speech, and mind, and constitute the myriad good practices. The twelve supreme vows are *vows*. The forty-five contemplations are *compassion*. These all derive from the *Scripture of the Cavernous Mystery and Numinous Treasure*.\n\n*Expedient means of liberation* include: the Golden Register for liberating emperors and kings, the Yellow Register for liberating ancestors and descendants, and the Natural Liberation for all sentient beings—this is *lamentation*. *Conduct* takes the cessation of evil as its meaning; *vows* take profound aspiration as their covenant; *compassion* takes virtue as the shade for all things; and *lamentation* takes the relief of suffering as its embrace. Once the Way of the four disciplines is established, there is the severance of a single retribution.\n\nThe middling practitioner, aspiring to the Mystery, liberates all beings, rescues from distress and dispels calamity, bestows merit and repays virtue, establishes fields of profound blessedness, serves ruler and parents with loyalty and filial piety, embraces gentleness and wisdom, cherishes benevolence, empties the heart to attain the supreme Dao, savors the numinous scriptures, eats without thought of satiation, and wears clothing without concern for cold. With all practices perfected, three deaths and three rebirths follow, replenishing the Perfected of the Nine Palaces and cultivating the supreme Dao of Jade Clarity. In conduct, they are meticulous: observing the three hundred great precepts, reciting the thirty-nine chapters of the *Great Cavern*, and contemplating the method of the Three Ones. Upholding precepts to sever evil, the five destinies are without opposition; reciting scriptures to still the spirit, the heart is not driven outward; preserving the One to empty the mind, spirit and heart become serene. When serenity is settled, the mirror beholds the supreme Dao, ascending into non-action, and worldly retribution is severed.\n\nThe lesser practitioner severs emotions and endures hardship, nurtures the spirit through diet and regimen, renounces glory and splendor, dwells in mountains and forests, delights in hills and streams, abides in serenity and steadfastness, abstains from grains and roots, and maintains long fasts while contemplating the Dao. Seated upright, they face their teacher as if present; in coming and going, they keep company with birds and beasts. Solitary in lofty crags, they lodge alone in empty mountains, carve cypress to adorn themselves, their faces bearing the look of hunger, their hearts as if holding cinnabar. Tested, they are unafraid; spirit stilled, heart at peace. Such conduct moves the August Sovereign of Emptiness: nine deaths and nine rebirths follow, their resolve and vows unretreatant. They attain transformation, riding clouds in flight, roaming and feasting on the Five Peaks, carefree in the Great Void. Proceeding thus, they ascend to the rank of lofty immortals, cultivating the Dao of Jade Clarity alongside the middling practitioner.\n\nThe scripture states: The six penetrations and contemplative methods—five colors, five sounds, five tastes, five fragrances, five treasures, floral splendor, and all adornments—disturb the nature. The scripture states: In the east, *penetrating vision*; in the west, *penetrating emptiness*; in the south, *penetrating clarity*; in the north, *penetrating subtlety*; in the center, *penetrating void*. With the six penetrations and wisdom, the contemplation of the Dao is accomplished, casting off immeasurable dust and burdens. When dust and burdens are exhausted, this is called the six penetrations.\n\nThe *Scripture of the Immortals* states: The eye of wisdom, the ear of wisdom, the nose of wisdom, the tongue of wisdom, the body of wisdom, and the heart of wisdom—entering the Dao of the Rare and Silent, transcending the dharmas of the Three Realms, all is empty. This is called the six penetrations.\n\nThe *Scripture of the Three Realms* states: Upholding precepts is the root of fasting and purification; stillness is the foundation of concentrated contemplation; concentrated contemplation is the cause of descending perfection; descending perfection is the treasure of ascending the Dao.\n\nThe scripture states: The darkness of the Three Treasures resides in the heart; the adept of the Three Treasures resides at the edge. The \"edge\" is the register, the threshold. Abiding in the heart, contemplating and acting, transforming the perverse to follow the upright, accumulating goodness and establishing merit—virtue is fulfilled, reaching the ultimate, the ultimate of the Ultimateless. Drawing in the many streams, guiding those with aspiration.\n\nThe scripture states: When spirit and essence dwell within the inner chamber, the primordial darkness abides forever—this is the Dao of long life and enduring vision. *Darkness* takes emptiness and void as its essence, form and color as its function; *essence* takes profound obscurity as its essence, light and sound as its function; *spirit* takes subtlety and wonder as its essence, transformation as its function.\n\nThe scripture states: \"Invisible to sight, it is *even*; inaudible to hearing, it is *rare*; untouchable to grasp, it is *subtle*.\" This is the Dao of spirit, darkness, and essence as the Three Ones, merging three into one, dispersing one into two. The \"one\" is non-being; the \"not-one\" of the one is called the True One. Here ends the essential purport of the Three Discourses.",
      "overlap_context": " all living beings, revering teachers and upholding the Dharma as if in the presence of the divine, maintaining long fasts and arduous contemplation, delving deeply into the profound mysteries, expelling the old and absorbing the new, with a heart like cold ashes and a body like withered wood, intent unwavering and qi gentle, both human and spirit exerting effort. Such conduct, though entailing one death and one rebirth, ensures an unretreatant resolve to achieve the rank of highest immortality.",
      "start_char": 7413,
      "end_char": 8267,
      "start_sentence": 399,
      "end_sentence": 428,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.29354763031006,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\三论元旨.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}