{
  "source_id": "三茅真君加封事典",
  "source_file": "chunked_daozang\\三茅真君加封事典.json",
  "total_chunks": 18,
  "total_original_chars": 11362,
  "total_translated_chars": 80295,
  "total_translation_time": 411.61755752563477,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\谱箓类\\三茅真君加封事典.txt",
    "category": "谱箓类"
  },
  "full_translation": "**The Ritual of Ennobling the Three Mao Perfected Lords**\n\n**Scripture Title:** *The Ritual of Ennobling the Three Mao Perfected Lords*\nTwo fascicles. Compiled by Zhang Dachun of the Song Dynasty.\nSource text: *Daoist Canon of the Zhengtong Era*, \"Compendia of the Cavernous Truth\" section, category of registers and genealogies.\n\n**Preface to *The Ritual of Ennobling the Three Mao Perfected Lords***\n\nThe Dao has its origin and its lineage—its origin precedes heaven and earth, unfathomable in its beginning; its lineage follows heaven and earth, boundless in its end. Yet the world claims our Dao waxes and wanes. Alas! How could this be so?\n\nIn daily life and common practice, from hunger’s meal to thirst’s drink, where is the Dao not present? Its single thread of transmission endures unbroken to this day, never once having faded. The only peril lies in the world’s lack of those who transmit the Dao. Thus it is said: *Humans can magnify the Dao; the Dao does not magnify humans.*\n\nThe immortal traces of the Mao Lords have long been manifest, recorded in ancient histories since the pre-Qin era, with later transmissions detailing their legacy. Their exalted rank among the immortals is beyond the reckoning of mortal minds. As for their merits in aiding the Nine Realms, their grace flowing through ten thousand generations, their support of the altars of state, and their provision for the ancestral sacrifices—from the reign of Emperor Sizong to that of Emperor Gulong, they were honored with ever more resplendent titles. At that time, Liu Jingyi traced their source and amplified their influence.\n\nBy the reign of Emperor Lizong, the eminent Daoist Master Situ of Xubai, serving as State Preceptor and Registrar of the Dao, petitioned for the nation and the people, and his prayers were answered. He was specially entrusted with the mandate of the Left Bureau of the Cavernous Mystery. The Master declared: \"Ah! All this is the numinous power of the Three Lords. How dare I claim what is rightfully theirs? I humbly return this honor and glory to the Three Lords, to fulfill the principle of repaying the root.\"\n\nEmperor Lizong assented. The vermilion seals gleamed, illuminating the forests and springs.\n\nAt that time, among the disciples of the Great Purity era who stood in attendance, I witnessed these events with my own eyes. Master Situ had repeatedly pledged to inscribe the rites of enfeoffment upon metal and stone, yet before he could fulfill this, he had already ascended as an immortal. When I, Great Purity, assumed the humble post at the lower abode, I long contemplated carrying on his unfulfilled intent, but pressing affairs left no leisure for the task.\n\nIn the spring of the dingmao year, the *Inner Transmission* and its *Continuation* were fortunately completed. My fellow disciples of the same rank once again expressed concern that the rites of enfeoffment remained unrecorded, saying: \"Without their inscription, not only will the numinous marvels of the Three Lords and the august reverence of the sacred court fail to be proclaimed, but neither will it be seen how we of Kongshan have magnified the pulse of this Dao and expounded its transmission.\" Thereupon, I received this charge with the utmost reverence and now dutifully inscribe this to mark the time.\n\nOn the full moon of the third month in the dingmao year,\nThe Specially Bestowed Master of Pure Tranquility, Illuminating Perfection, and Subtle Wonder;\nSpecially Appointed Daoist Rectifier of the Maoshan Mountain Gate;\nProvisional Supervisor of the Chongxi Abbey before the Throne and Overseer of All Abbeys on This Mountain;\nPurple-Robed Zhang Dachun respectfully inscribes.\n\n*Enfeoffment Rites for the Three Mao Lords, Volume the First*\nThe Specially Bestowed Master of the Cavernous Mystery, Supervisor of the Right Bureau, and Director of Daoist Affairs\nMinister Situ Shitan, the High Scholar of the Void-White Studio at the Yousheng Abbey, reverently undertakes this charge.\n\nThe Specially Bestowed Master of Pure Tranquility, Illuminating Perfection, and Subtle Wonder;\nSpecially Appointed Daoist Rectifier of the Maoshan Mountain Gate;\nProvisional Supervisor of the Chongxi Abbey and Overseer of All Abbeys on This Mountain;\nPurple-Robed Minister Zhang Dachun, compiler.\n\nIssued by the Ministry of Rites on the first day of the first month in the ninth year of the Chunyou era.\n\nOn the first day of the first month, the imperial edict was reverently received, bestowing a decree of exhortation:\n\"The High Scholar of the Void-White Studio, Master of the Cavernous Mystery, Situ Shitan, is hereby specially promoted to Registrar of the Left Bureau and Director of Daoist Affairs.\"\n\nThe Right Bureau has duly noted this for Minister Situ Shitan.\nFirst day of the first month in the ninth year of the Chunyou era.\nImperial Decree.\n\nThe Ministry of Rites issues this document:\nTo the Specially Appointed Master of the Cavernous Mystery, Right Bureau Supervisor of Daoist Rectification, and Director of Daoist Affairs, High Scholar of the Void-White Studio at the Hall of Assisting Sageliness, Situ Shitan.\n\nThis document conveys the imperial exhortation that he be specially promoted to Left Bureau Registrar and Director of Daoist Affairs. Upon receipt, this document shall supersede all previous decrees.\n\nDated the ____ day of the second month in the ninth year of the Chunyou era.\n\nVice Director of the Bureau of Military Affairs and Acting Vice Grand Councilor, Xie [seal]\nVice Director of the Bureau of Military Affairs and Acting Vice Grand Councilor, Ying [seal]\nDirector of the Bureau of Military Affairs and Vice Grand Councilor, Zhao, Supervisor [seal]\nGrand Preceptor, Right Chancellor, and Duke of Yue [seal]\n\n**Petition to Decline the Appointment as Registrar**\n\nYour servant, Situ Shitan, humbly states:\nI have reverently received the imperial decree, which, in recognition of my three years of prayerful service, specially promotes me to Left Bureau Registrar and Director of Daoist Affairs.\n\nI have heard that commands from heaven leave me no ground to stand upon. Truly, \"to know contentment is to avoid disgrace\"—this is the luminous teaching of the Most High. \"To receive favor with alarm\" is the clear warning of the Daoist tradition. My honor exceeds all bounds, and I tremble as if standing on thin ice.\n\nI prostrate myself in gratitude.\n\nReflecting upon my own inadequacies, I find my talents far from sufficient and my learning shamefully deficient in the Dao. How could one as lowly as I, dwelling in mountain seclusion, have been so mistakenly favored with the sagely discernment of Your Majesty? Twice I journeyed to the capital to behold its splendor, and for long have I soiled the purity of the Void-White Studio. Yet by some dreamlike fortune, I was granted an audience in the celestial court; like a boat turning toward Penglai, I was entrusted with the sacred precincts of blessed lands. Racing between altars, I exhausted my meager wisdom in prayers for auspiciousness; from dawn to dusk, I vowed to repay Your Majesty with my very life. Though my contributions were negligible, I was repeatedly burdened with rewards. But blessings overabundant breed misfortune, and men lament my frail fate. My body is worn to the bone, like a withered tree; my spirit is broken, my will extinguished, like ashes that no longer flame. My plea for retirement arises from the depths of my heart, and Your Majesty’s gracious assent has already been bestowed.\n\nI had sworn before heaven and earth to repay my sovereign, and pledged before streams and stones to wander the world in seclusion, roaming freely in the vast wilderness, lingering beyond the dust and filth of the world. Who could have foreseen that the imperial favor would again take pity on my three years of toil, bestowing undeserved grace to swiftly elevate me to the Left Bureau Registrar? Such extraordinary honor, a radiance at the end of my path, is more than I can bear. For when embroidered robes are draped upon a monkey, it will surely tear them to shreds with its teeth; when the music of *Xianchi* and *Shaohao* is played for an owl, it only bewilders and saddens the listener. Looking back, I fear my good fortune is excessive, and that such rapid advancement will hasten my downfall.\n\nI humbly beseech Your Imperial Majesty, whose virtue encompasses heaven and earth, whose brilliance rivals the sun and moon, to consider the sincerity of my past and present intentions, and to preserve my resolve to know my limits from beginning to end. I implore You to revoke this decree, lest You be constrained by the appearance of retracting a promise, and to allow me to spend my remaining years in service, offering what little strength I have left. I dare not accept this honor, for to do so would be to risk offending Your celestial majesty.\n\nWith the utmost reverence and urgency, I submit this petition for Your Majesty’s consideration.\n\nRespectfully submitted.\n\nIn the second month of the ninth year of the Chunyou reign, on a designated day, the Master of the Cavernous Subtlety, High Scholar of the Empty White Studio, Minister Sidu Shitan, Supervisor of the Teaching and Affairs of the Dao on the Right Avenue, was specially bestowed the title of *Jianyi*. He submitted a memorial to decline and was denied further refusals.\n\n**Internal Provincial Document**\nOn the seventh day of the intercalary second month, an imperial decree was received: the High Scholar was specially promoted to *Daolu* of the Left Avenue, with an exhortation and a *huang* decree issued for his compliance. A memorial of gratitude was to be prepared.\nUpon resubmission, further refusals were again denied.\nOn the seventh day, the bestowed *huang* and exhortation decrees arrived and were deposited in Jurong County.\n\nOn the fifteenth day of the same month, he submitted another memorial, beseeching the revocation of the imperial favor and the conferral of a sacred title upon the Three Mao Lords of the Office of Destiny.\n\n**Memorial Requesting the Conferral of a Sacred Title**\nThis minister, undeterred by the severity of punishment, dares to lay bare his sincerity, risking offense to the celestial scrutiny.\n\nOn the first day of the first month, this minister reverently received the imperial grace, being appointed *Daolu* of the Left Avenue and Supervisor of the Teaching and Affairs of the Dao. Though I previously submitted a memorial to decline, it was not granted. Now, I have again been honored with the bestowal of a *huang* decree, commanding me to accept the aforementioned office, with no further refusals permitted. Overwhelmed by the imperial command, I am filled with shame and trepidation.\n\nI have striven to cultivate myself and early aspired to purity and truth, yet never did I imagine that in my declining years I would be favored with such imperial grace. Reflecting inwardly, I recognize my origins: humanity is rooted in heaven, and all things are rooted in their ancestors. Without rooting humanity in heaven, one cannot know the beginning of the mandate received; without rooting things in their ancestors, one cannot fathom the ultimate source of their return.\n\nThis minister has long dwelled on Mount Mao, the place where the Three Mao Perfected Lords attained the Dao. It is the first earthly lung and blessed land, the eighth Cavern Heaven of Huayang, where palaces, monasteries, and hermitages resound with morning bells and evening chimes, tending the incense fires of the Three Lords, offering prayers for the state, and extending the sacred longevity of the emperor. Among the famous mountains of the realm, none surpass this in grandeur.\n\nFrom the Han dynasty to our present Song, whether revealing the hidden radiance of the Three Lords or exalting their illustrious names, their incense fires have burned continuously, unbroken as a bridge. This is the very place where the perfected immortals fulfill their administrative duties, and where the state plants the seeds of boundless prosperity.\n\nIn my reckless folly, I dare to beseech that the titles previously bestowed upon me—High Scholar and *Jianyi*—along with the present appointment as *Daolu* and the exhortation decree, be revoked as imperial grace and, following the recent precedent of the Celestial Master and the Perfected Lord Who Assists the Sacred, that a sacred title be conferred upon the ancestral masters of this mountain, the Three Mao Perfected Lords. Let a decree be specially issued, bestowing honor upon the three peaks, thereby embodying the principle that humanity is rooted in heaven and all things in their ancestors.\n\nThis minister respectfully presents the deeds of the Three Lords for Your Majesty’s august perusal.\n\nI humbly observe that the ancestral lineage of the Mao clan traces back to a distant wellspring of immortality. The eldest, Mao Ying; the second, Mao Gu; and the third, Mao Zhong—three brothers who dwelled in mountain caves and secluded valleys, refining their Dao and truth through diligent practice. After attaining the Dao, they were entrusted with the governance of early immortals, received their charge from the Supreme Ultimate, and presided over the Office of Destiny in the sacred peaks. They examined and assessed the realms of Wu and Yue, and established their abode upon the Red City Mountain. Their virtue was recorded in the purple books, their merits inscribed in the jade registers. Their crane tents and dragon pools repeatedly manifested divine marvels; the celestial lamps and cinnabar lights remain visible to this day. In matters of drought, rain, or snow, their responses to prayers are immediate; in fortunes and misfortunes, their verifications are as swift as an echo. The beacon fires of war have been stilled by their vigilance, and the auspicious omens of fish and dreams have been confirmed by their signs.\n\nSince my arrival at this mountain, I have witnessed these details firsthand in the prayers offered by prefectures and counties. Moreover, the veneration accorded them through the ages has been abundant and flourishing. During the Xiangfu and Jingde eras, the mountain was strictly protected, lands were bestowed, and tax exemptions were granted. The sacrifices offered were solemn, and the prayers for high harvests were answered. Thus, during the reign of Emperor Renzu, the auspicious sign of a rainbow and lightning heralded the imperial heir; subsequently, imperial incense was sent, and the Golden Register was established. Emperor Gaozong repeatedly dispatched envoys to convey his earnest exhortations and ordered local officials to protect the site. From the Qiandao and Chunxi eras onward, the veneration has been even more devout.\n\nThe臣, having recently received the imperial decree, was charged with conducting prayers and exorcisms. Whenever grand rituals were held, he would reverently transcribe the sacred edict, personally knock at the grotto-heaven, supplicating above to the celestial poles and below to the mountains and rivers. All matters pertaining to the sacrificial canon were duly reported, and through the constant favor and protection of the perfected immortals, manifold blessings have accrued. This is none other than because Your Imperial Majesty, embracing the spirit in quiescence, unites with the Dao in truth; your virtue is cultivated amidst the humblest creatures, and your transformative influence extends beyond the vastness of Kunlun. Thus, birds, beasts, fish, and turtles all submit, while mountains, rivers, ghosts, and spirits all attain peace. Wherever manifest responses appear, they are witnessed, and petitions are met with ennobling honors. Yet the Three Perfected Ones of this mountain alone remain without special distinction.\n\nThe臣 notes that the Three Mao Lords initially received their celestial titles and were charged with overseeing the grotto-heaven. In former reigns, their numinous precincts were honored with elevated ranks, which the臣 has meticulously recorded below. He humbly beseeches Your Majesty to heed his earnest plea, to bestow the grace of the imperial mandate upon him, and to specially confer honorific titles upon the ancestral masters, thereby manifesting the Three Lords’ protective and propitious efficacy for the state, and illuminating the august dynasty’s grand tradition of requiting merit. This would also fulfill the臣’s duty to return to the source and repay his origins.\n\nThe臣 grieves that among those reclusive scholars who have encountered sagely enlightenment, many seek only personal glory, unaware of the need to repay their roots. The radiance of the perfected immortals remains buried to this day. Moreover, the臣 reflects that his years and fate both wane, his heart like withered wood or cold ashes, having achieved not even an inch of merit yet presumptuously enjoying imperial favor. To further trespass upon this grace would truly incur the reproach of unseen retribution. He humbly implores Your Sagely Compassion to pity his declining years, to perceive his lack of avarice for honor, and to bestow special grace by enhancing the renown of this sacred mountain, thereby glorifying the ancestral grounds of reverence and prayer, and perpetuating the nation’s boundless prosperity for myriad generations. This would be an incomparable fortune.\n\nThe臣 has carefully transcribed the three original imperial decrees of ennoblement for the Three Mao Perfected Lords and presents them herewith. As for the imperial edicts of exhortation bestowed upon the臣, he dares not presume to receive them at the capital but has already filed them in the public records of Jurong County, awaiting further instructions. He will then submit a memorial presenting the three imperial edicts of exhortation received previously and presently.\n\nThe臣, daring to offend celestial majesty, prostrates himself to await your decree.\n\nPresented on the ____ day of the second month by the Specially Bestowed Master of Cavernous Subtlety, Right Street Supervisor of Daoist Teachings, and Vacuous Luminance Retreat Scholar, the臣 Situ Shitan.\n\n---\n\n**Imperial Decree of Ennoblement**\n\n*Memorandum from the Ministry of Rites:*\nIn accordance with the edict issued on the twenty-seventh day of this month, the Chancellery proclaims: Within the Grotto-Heaven of Juqu, there reside perfected ones whose transformations are boundless and whose numinous efficacy is unfathomable. From the Qin and Han dynasties to the present, spanning over a thousand years, their blessings have flowed forth, benefiting the people. Yet their exalted names and honorific titles remain incomplete, which does not suffice to express the utmost sincerity of veneration.\n\nThe Lord of Great Mao of Mount Mao, currently titled *Taiyuan Perfected Person, Eastern Marchmount Supreme Minister, Director of Destinies*, shall be advanced to the title *Taiyuan Wondrous Dao Perfected Person, Eastern Marchmount Supreme Minister, Director of Destinies*. May this serve to guide harmonious qi, elicit auspicious responses, and assist in securing the nation’s boundless peace and prosperity.\n\nLet this decree be made known as appropriate. The memorandum is issued in accordance with the imperial edict as above.\n\nUpon receipt of the memorandum, in accordance with the imperial edict, this document is hereby issued.\n\nIn the fourth month of the first year of the Chongning reign, the memorandum was sealed by:\n*Wen, Grand Master for Court Service and concurrently Right Vice Director, Guardian of the Right*\n*Lu, Grand Master for Court Service and concurrently Left Vice Director, Guardian of the Left*\n*Right Grand Master of the Silver and Blue Embroidered Silk, Guardian of the Right and concurrently Grand Councilor*\n*Left Grand Master of the Illustrious Embroidered Silk, Left Grand Councilor*\n\nThe Central Mao Lord, currently titled *Perfected Person of Destined Records*, shall be advanced to the title *Perfected Person of Destined Records and Serene Emptiness*. The Lesser Mao Lord, currently titled *Perfected Person of the Three Offices, Preserver of Destiny*, shall be advanced to the title *Perfected Person of the Three Offices, Preserver of Destiny and Subtle Wisdom*.\n\nOn the first day of the third month, a second memorandum was received. The Ministry of Rites’ official document stated: \"The imperial decree has been proclaimed to the eminent Daoist. It is commanded that he first accept the reduction of the *Yellow Register* rites, with no further refusal permitted. He shall promptly submit a memorial of gratitude in return. The bestowal of honorific titles upon the Perfected Lords has already been decreed and shall be implemented accordingly.\"\n\nIn the intercalary second month, *Yanqing* respectfully submitted the third memorial of refusal and decline:\n\n*Your servant, Shi Tan, humbly states:*\nOn the first day of this month, I reverently received the sacred decree, commanding that I first accept the reduction of the *Yellow Register* rites, and that the bestowal of honorific titles upon the Perfected Lords has already been decreed and shall be implemented.\n\nI, your servant, reflect that to decline honor and renounce glory is to await the grace of imperial favor, while for a Daoist master to request a title is to receive the benevolent bestowal of the throne. How dare I persist in my entreaties, hoping to move the imperial ear?\n\nI prostrate myself in gratitude.\n\nI humbly consider that the three peaks stand majestically verdant, each governed by one of the Three Perfected Lords, while the nine virtues flourish abundantly, and the nine bestowals manifest the divine singularity of the spirits. Their blessings extend to a hundred towns, and their beneficence permeates all living things. Moreover, the ancient altars of their legacy, adjacent to the Yangtze and Huai rivers, bear the weight of profound reverence. When the winds cleanse the frontier passes, is there not an opportunity to assist in the harmonious order? When rains nourish the rice fields, do we not rely upon their timely aid? These deeds are recorded in history and celebrated in song. To ascend to the heavens upon receiving such a mandate—how could I harbor any desire for worldly rank? To inscribe their merits in the imperial annals is to express the utmost reverence for the sacred court, to extend boundless blessings for ten thousand generations, and to mark an occasion rare in a thousand years.\n\nThis is all due to the grace of Your Imperial Majesty, who embodies the perfection of the Three Powers and governs the Eight Directions, whose moral authority is profound, and whose creation of heaven and earth is vast. You delight in the supreme teachings, following the Yellow Emperor’s practice of fasting in devotion; you revere the renowned mountains, emulating the sage-kings’ responsiveness to destiny. Thus, you have examined the legacy of the Great Mao Lords and wished to enhance their honorific titles to honor their spirits.\n\nI, your servant, have guarded my precepts and shunned fame, yet my heart remains devoted to repaying my origins. I have poured forth my loyal devotion in this plea, not seeking false glory. Now that I have received the benevolence of your assent, and the ritual bestowal is to be enacted, if I were to persist in further entreaties, I fear I would incur heavenly censure.\n\nHow dare I not await your sagely decree, making it known to the jade halls of the immortals? I shall reverently proclaim the imperial will and pray for the augmentation of your august foundation. When all things come to fruition, the five grains shall ripen; when martial valor is harnessed, the four seas shall be pacified.\n\nAll the *Yellow Registers* and *Daoist Records* previously bestowed upon me—three in total—are hereby respectfully returned with this memorial.\n\nI, your servant, have rashly trespassed against your celestial majesty and humbly await your decree.\n\nOn this day of the third month, *Shi Tan, Master of the Subtle Dao, Right Street Supervisor of Daoist Teachings, and Keeper of the Vacant Luminance Studio, Eminent Daoist of the Highest Rank*, respectfully submits this memorial.\n\nThe imperial decree was issued: \"Not permitted. No further refusal shall be allowed.\"\n\nMemorial submitted to the Ministry of Rites for return of documents:\n\n*Shi Tan, in my humble position, states:*\nOn the first day of this month, I reverently received the transmitted imperial decree, commanding that I first accept the reduction of the *Yellow Register* rites, and that the bestowal of honorific titles upon the Perfected Lords has already been decreed and shall be implemented.\n\nI, Shi Tan, have previously submitted a memorial, beseeching Your Sacred Majesty to revoke the gracious command and the bestowal of honorific titles upon the Perfected Lords. I reverently await the imperial decree and hereby return the *Yellow Register* documents.\n\nHaving received the sagely decree, I humbly comply with your humble servant’s request.\n\nI, Shi Tan, deeply reflect that the divine traces of the Mao Lords and their profound vows have endured from the Han and Jin dynasties to the present, spanning over a thousand years. The common people have received their beneficence, and neither war nor plague has arisen. When drought or excessive rain disrupts the seasons, the prefectures and counties make their pleas, and their prayers are answered as swiftly as an echo. Their altars stand like tripods in the temple courtyards, truly serving as the foundation of governance.\n\nIn recent days, however, the altars have fallen into neglect, their incense and offerings grown sparse. This ancient and renowned mountain is cause for sighing. Moreover, of late, fierce winds and torrential rains have afflicted the land, and the frontier beacons remain unsettled. Though I, Shi Tan, dwell in humble obscurity, I am filled with trepidation day and night. My love for the sovereign and concern for the nation leave me with no means of effectual service—only the ability to concentrate my singular devotion and secretly implore the Three Perfected Lords. In all my waking and resting moments, I have never ceased.\n\nI rely upon the divine power of the immortals to assist in harmonious order, present auspicious omens, and protect the grand enterprise, securing the enduring fortune of the imperial house.\n\nI, Shi Tan, am but a feeble and declining old man, unworthily dwelling in this blessed land. Repeatedly, I have received your abundant grace, yet my repayment is but a drop in the ocean. How could I presume to accept such extraordinary favor?\n\nFortunately, Your Sacred Majesty has already revoked the gracious command and bestowed honor upon the immortal lords. If I do not humbly comply with this decree, I fear I shall incur the reproach of deceiving the throne. It is my duty to persist in refusal, even at the cost of my life.\n\nI respectfully return the three *Daoist Records* and *Yellow Registers* previously bestowed upon me, along with this memorial. I beseech Your Majesty to graciously consider my plea, discerning that my loyalty is not a pretense for seeking undeserved honor, and to revoke the decree of bestowal. May a luminous edict be issued, conferring the title of *Perfected Lord* upon them. Let this be proclaimed to all relevant offices and announced throughout the realm, thereby manifesting the sagely ruler’s intent to honor the Dao for the people, revealing the Three Mao Lords’ responsiveness to the world and their protective power over the nation, and securing the imperial house’s boundless prosperity for a myriad of years. This is my utmost wish.\n\nRespectfully submitted to the *Du Zhi Ti Ju Tai Wei* for memorialization. I humbly await your decree for implementation.\n\nRespectfully submitted.\n\nTwo copies of the ministry’s document are enclosed: one for the Jiangning Prefecture, and one for the mountain itself.\n\nOn the twenty-eighth day of the intercalary second month, the imperial decree was issued, and the bestowal of titles upon the Three Mao Perfected Lords was decreed:\n\n*Taiyuan Wondrous Dao Perfected Person of Serene Emptiness, Eastern Marchmount Supreme Minister, Director of Destinies*, shall be further honored with the title *Sacred Protector*.\n\nThe *Dinglu Right Prohibitions Supreme Dao Serene Emptiness Perfected Person* shall be further honored with the title *Virtue-Protector*. The *Three Officials Life-Securing Subtle Emptiness Perfected Person* shall be further honored with the title *Benevolence-Protector*.\n\nThe above is issued to Jiangning Prefecture for implementation accordingly. One copy is to be delivered to Chongxi Abbey.\n\nOn a day in the third month of the ninth year of Chunyou, the provincial document is returned to Jiangning Prefecture for memorialization.\n\n**Memorial from Maoshan Chongxi Abbey:**\nOn the fifteenth day of this month, we received two documents from the Privy Council and the Ministry, one for this abbey and one for the prefectural authorities, concerning the imperial decree issued on the twenty-eighth day of the intercalary second month, which bestowed additional honorific titles upon the Three Mao Perfected Lords of Destiny of this mountain. This matter requires submission and compliance.\n\nOne provincial document is hereby enclosed and returned to Jiangning Prefecture. We humbly request that it be forwarded to the local Daoist Rectification Bureau, with instructions to notify all official abbeys, temples, and hermitages under its jurisdiction, ensuring universal awareness. We dare not act without authorization and await your esteemed command.\n\nOn a day in the third month of the ninth year of Chunyou,\n*Master of the Numinous Treasure* (Lingbao Dashi), appointed *Chief Daoist Rectifier of Maoshan and Supervisor of Chongxi Abbey and all abbeys of this mountain*, Ye Xipeng, respectfully submits.\n\n**Further Memorial:**\nUpon receipt of the Inner Ministry’s proclamation, we received the imperial decree announcing the bestowal of additional titles upon the Three Mao Perfected Lords. Two provincial documents were issued, with instructions to first deliver them for custody, and to report their receipt upon completion.\n\nOn a day in the third month, we reverently complied.\n\n**Memorial on the Receipt of the Bestowed Provincial Documents for the Additional Titles:**\n\nYour servant, Shi Tan, respectfully declares:\nOn the twentieth day of this month, by command of the *Director of Destinies and Chief Commander* (Du Zhi Ti Ju Tai Wei), we received the imperial proclamation. By the grace of His Majesty, the Three Mao Perfected Lords of Destiny have been further honored with the six-character sacred titles: *Sacred Protector*, *Virtue-Protector*, and *Benevolence-Protector*. Two provincial documents were issued, with instructions for your servant to take custody of them first. I have reverently received one copy and delivered it to Chongxi Abbey, to be announced to all abbeys of this mountain for universal awareness. The other copy has been submitted to the prefectural authorities.\n\nYour servant is profoundly grateful for the imperial favor, profoundly grateful for the imperial favor.\n\nUpon the arrival of the sacred command at this mountain, I shall personally lead the entire mountain’s Daoist community in offering incense, holding purification rites, and ascending the peak to perform the jiao offering, reverently praying for the eternal longevity of His Majesty and the everlasting prosperity of the imperial realm.\n\nYour servant is overwhelmed with awe and gratitude, prostrate in reverence.\n\nWith utmost trepidation, I humbly submit this memorial for your august consideration.\n\nRespectfully submitted.\n\nOn a day in the third month of the ninth year of Chunyou.\n\nMemorial of Gratitude for Promotion to Left-Street Daolu\n\nYour servant Shi Tan respectfully states: By the sacred grace of His Majesty, an edict of exhortation on yellow paper has been bestowed, specially promoting your servant to the office of Left-Street Daolu, charged with oversight of the Three Administrations of the Teachings. Though I have repeatedly submitted memorials to decline, the imperial command has twice forbidden my refusal. I have already reverently received the favor from afar, gazing toward the imperial court in gratitude.\n\nI humbly reflect: The Great Dao is nameless, yet how dare I covet the seclusion of mountain forests? Even small virtues are recorded, and I have been specially elevated to the ranks of the Left Street—an honor most esteemed by the scholarly world, yet never within the hopes of my humble life. Though I sought to decline, I could not, and upon hearing the command, I was struck with awe.\n\nWith profound gratitude, I bow in reverence.\n\nI recall that my knowledge is neither comprehensive nor enlightened, my talents neither vast nor far-reaching. By nature, I have been content with the simplicity of caves and grottoes, my learning insufficient to bridge the wisdom of past and present. Yet my aspirations have ever been to aid the times, my loyalty to repay the realm. In this late age of sagely brilliance, I have basked in the radiance of sun and moon. Though I possess no merit or ability, I have been undeservedly favored with the heavy trust of imperial office. Even as I feared the lightness of my own wings, the yellow-paper edict arrived, further increasing the weight of my title. I now follow the pure fragrance of emptiness and tranquility, treading in the footsteps of those who preserved authenticity. The news, spreading through the wilds, seemed like the tale of Huayang of old; the cap of office and the sighs of refinement spoke of a new splendor in the titles of immortals. Though duty compels me to decline no further, I fear the punishment that may come from such high rank. Reluctantly, I gaze toward the court and receive the command with solemnity, yet like one seated upon a mat of thorns, I find no ease.\n\nThis is all due to the virtue of Your Imperial Majesty, which suffuses harmony and balance, while your transformative influence flows in purity and stillness. You eternally uphold the wondrous mysteries of the Three Absences, fulfilling reverent devotion; you justly order the flourishing of all affairs, leaving not even the smallest detail unattended. Thus, even one as decrepit as I am bathed in the light of imperial grace.\n\nHow dare I not redouble my efforts to emulate the ancients and preserve what little remains of my integrity? Though I have not yet cast aside my official’s cap, I shall add incense to the censer of ten thousand years. Though this old horse is weary, how could I dare betray the favor of the Ninefold Throne?\n\nYour servant is overwhelmed with awe and gratitude, prostrate in reverence.\n\nWith utmost trepidation, I humbly submit this memorial of gratitude for your august consideration.\n\nRespectfully submitted.\n\nOn a day in the third month of the ninth year of Chunyou.\n\nNewly promoted Left-Street Daolu, Master of the Cavernous Subtleties, Master of the Vacant Luminosity Studio, Eminent Scholar charged with oversight of the Teachings, your servant Situ Shi Tan respectfully memorializes.\n\nThe Ministry of Rites has transmitted three edicts conferring the title of Perfected Lord, along with official documents bestowing ceremonial gifts. By imperial decree, the Eminent Scholar Situ is to be informed, and the edicts of investiture, along with the items for the jiao offering—incense, tea, and other bestowed articles—are to be delivered as listed. Please acknowledge receipt and memorialize in reply.\n\nOn a day in the third month, with reverent compliance by Yanqing. Three edicts enclosed.\n\nDecree:\nWe have heard that the Perfected Ones ride the wind and mount the dark, their spirits roaming beyond the Eight Extremities, yet with a single thought for the living, they remain ever present. The Supreme Prime Mysterious Dao, Tranquil Emptiness Perfected Lord, Eastern Marchmount Upper Minister, Director of Destinies Divine Lord attained the Dao at Mount Mao, was registered in the Immortal Bureau, and stands foremost among the Three Lords. His wondrous efficacy has been manifest through successive dynasties, and near and far he is revered as the Director of Destinies.\n\nOut of Our ceaseless admiration for the common people, We specially command the relevant offices to bestow upon him an exalted title, thereby manifesting Our reverence. Let him be specially enfeoffed as the Supreme Prime Mysterious Dao, Tranquil Emptiness, Sagely Protection Perfected Lord, Eastern Marchmount Upper Minister, Director of Destinies Divine Lord.\n\nDecree:\nWe have heard that the Divine Lords of the Three Peaks of Jurong are most illustrious, and for this reason, the Golden Altar Grotto-Heaven bears its name—an object of admiration through the ages, not merely in Our time. The Register-Fixed, Right-Forbidden, Supreme Dao, Tranquil Stillness Perfected Lord cultivated the Dao and attained realization, known as the Central Mao. His responses to prayers for rain and sunshine have been efficacious, and near and far he is held in virtue.\n\nWe urgently command the bestowal of an exalted title to reciprocate these great blessings. Let him embody Our intent and further conceal his hidden efficacy among the people. Let him be specially enfeoffed as the Register-Fixed, Right-Forbidden, Supreme Dao, Tranquil Stillness, Virtue-Protection Perfected Lord.\n\nDecree:\nWe have heard that Emperor Wu of Han sacrificed to the Divine Lord in the forbidden precincts, his invocations most secret, for the purpose of seeking blessings. We do not act thus. The Three Officials, Life-Preserving, Subtle and Wondrous, Balanced Wisdom Perfected Lord, whose true wind and Dao are profound, is styled the Lesser Mao Lord. His reverent service in prayers and sacrifices has been honored in ritual for no short time.\n\nWe now command the bestowal of an exalted title to manifest Our earnest admiration, further expanding his beneficent influence to enlighten the living. Let him be specially enfeoffed as the Three Officials, Life-Preserving, Subtle and Wondrous, Balanced Wisdom, Benevolent Protection Perfected Lord.\n\nThe above decrees are hereby issued. Upon receipt of this document, act accordingly.\n\nA day in the third month of the ninth year of Chunyou.\n\nThe Grand Tutor, Left Chancellor, and Duke of Wei Qingzhi; the Right Chancellor Kui; Participant in Determining Government Affairs Fang Shu; Participant in Determining Government Affairs Pi; concurrently Acting Supervisor of the Gate of Petitions Zhuangfu; concurrently Acting Supervisor of the Secretariat—on the fifteenth day of the third month at the hour of noon, Director of General Affairs Zhao Huan received the document. The Minister of War concurrently Left Director Rao was entrusted with its transmission to the Ministry of Personnel.\n\nThe Grand Tutor, Left Chancellor, and Duke of Wei Qingzhi; the Right Chancellor Kui; Participant in Determining Government Affairs Fang Shu; Participant in Determining Government Affairs Pi; the vacant post of Minister of Personnel; concurrently Acting Minister of War Qingsou; the vacant post of Vice Minister of Personnel; concurrently Acting Supervisor of the Imperial Diary; Director Zhao Yingshu; Clerk Jin Biguo; Clerk Fu Rulin; Director of the Bureau—responsible for the administration of the institute.\n\nIssued on the fifteenth day of the third month of the ninth year of Chunyou.\n\nBestowed ceremonial items:\nOne carved and gilded ruyi scepter of aloeswood, with a handle of descending-true incense, encased in a yellow silk bag, stored in a black lacquered box with complete lock and tin key—presented to the Great Mao Lord.\nTwo jade tablets, each encased in a red brocade bag, further enclosed in small vermilion lacquered boxes, with outer vermilion lacquered boxes for protection, complete with lock and tin key—presented to the Middle Mao Lord.\nTwo woven brocade images of the Heavenly Venerable, each twenty feet in length, held by the Lesser Mao Lord.\nFourteen items of ritual regalia.\nOne pair of five-tiered standards, adorned with five-colored silk ribbons.\n\nEach tier is fitted with one copper tube and one copper lid, atop which sits a hexagonal jeweled canopy with six dragon-head finials holding gilded and colored streamers, and at the base of the tiered finials are copper bells—eighty-four per tier. The dragon-head finials are painted with red cinnabar, and the base is fitted with a copper ferrule.\n\nA pair of banners, adorned with beaded netting. The banner shafts are wrapped with three gilded and colored silk ribbons, each bearing a hexagonal jeweled canopy with dragon-head finials holding six gilded and colored silk streamers. Each streamer is fitted with copper bells—ninety-three per banner. The dragon-head finials are painted with red cinnabar, and the base is fitted with a copper bell.\n\nA pair of four-tiered pennants, each tier adorned with fifteen gilded and five-colored ribbons and six gilded and colored knotted ribbons. Each pennant is fitted with three hundred forty-three copper bells, topped with a jeweled finial on a red cinnabar staff, and the base is fitted with a copper ferrule.\n\nA pair of ceremonial fans, made of red brocade. Each fan is adorned with a set of jade pendants—six pieces per set—five strands of pearls, and two tassels at the base. Atop each fan is a hexagonal jeweled canopy with dragon-head finials holding six small gilded and multicolored streamers, each fitted with ninety-eight copper bells. The finials are phoenix-head shaped, painted with red cinnabar, and the base is fitted with a copper ferrule.\n\nA pair of five-light fans, made of plain silk with gilded crane-wing designs. Each fan is adorned with two gilded silk longevity ribbons, fitted with six copper bells, mounted on red cinnabar staffs, and the base is fitted with a copper ferrule.\n\nA pair of feather fans, made of plain silk with gilded designs. Each fan is adorned with two gilded and colored silk longevity ribbons, mounted on red cinnabar wooden staffs, and the base is fitted with a copper ferrule.\n\nA pair of ruyi scepters, decorated with gilded and colored designs.\n\nTwelve yellow silk bags for covering the ritual regalia.\n\nOne vermilion wooden box, divided into two compartments, with complete lock and key, for storing the ritual regalia.\n\nTwo black lacquered standing racks for the ritual regalia.\n\nFive taels of aloeswood, five taels of borneol, fifty pieces of new tea, and one hundred taels of silver.\n\nOn the twenty-third day of the fourth month, the *jiazi* day of the sexagenary cycle, Daoist masters and townsfolk from the various mountains gathered to reverently welcome the imperial proclamation. The ritual was to be announced at the Three Peaks, but continuous wind and rain had persisted. On the twenty-second day, the *gaoshi* ascended the altar and urgently submitted a memorial to borrow fair weather. By the fifth watch the next morning, drums were sounded to assemble the crowd, and the overnight rain ceased. The sky cleared, revealing bright daylight. The *gaoshi* personally led the abbots and senior Daoists from the mountain’s temples and hermitages, along with the elders and common folk of the town, to the Welcoming Pavilion outside the mountain. There, they set up incense burners, floral canopies, banners, flags, gongs, drums, cymbals, and ceremonial music. The procession included the ritual regalia and attendants, as well as officials from Changning Town of the mountain, who led soldiers with banners, drums, and an escort of over a thousand men. Spectators from near and far gathered like a wall. That day, the weather was clear and mild, auspicious mist swirled like a painting, cranes cried in the clear sky, and a white hare appeared atop the peak.\n\nThe proclamation was first welcomed to the gate of Chongxi Abbey. The *gaoshi*, leading the abbots and senior Daoists from the various mountains, along with the laity, faced the imperial palace to express gratitude. Cheers of \"Long live the Emperor!\" resounded. They then ascended Great Mao Peak to perform the rites, proclaiming the imperial mandate and presenting the sacred vessels. They proceeded to Middle Mao Peak and Small Mao Peak, where the rituals were conducted as before.\n\n**Prayer for Great Peak**\n\nIn the ninth year of the *Chunyou* reign of the Great Song, the *jiyou* year of the sexagenary cycle, on the twenty-third day of the fourth month—the *jiazi* day of the *renyin* new moon—the newly appointed *Zuojie Daolu* of the Left Street, Master of the Cave Mystery, *Xubai Zhai Gaoshi*, Administrator of Daoist Affairs, Minister Situ Shitan, respectfully bows his head, prostrates, and speaks:\n\nI have heard that the wondrous Dao is concealed in namelessness, yet by force of will it is called great. True immortals treasure obscurity; why should they seek to display their radiance? Yet to turn the heart toward the vast emptiness, one must for a time stir the senses with brilliance.\n\nMay you worthily receive the luminous decree, be specially promoted with illustrious titles, and uphold the grand rites of rare splendor—truly a great ceremony of radiant continuity.\n\nWe reverently invoke the **Supreme Primordial Dao, Profoundly Empty and Sagely Protector True Lord**, **Eastern Peak Supreme Minister and Controller of Destiny Divine Lord**: your office governs the vast heavens, your teachings unify mountains and rivers. At the summit of Mount Juqu, you establish your administrative seat for celestial record-keeping. Your blessings extend to all things, your virtue reaches the multitudes. You engrave purple jade, inscribe golden tablets, your brilliance outshines the Nine Bestowals. Your green banners flutter, your embroidered plumes gather, summoning and commanding the ten thousand spirits. Though your immortal titles are already exalted, we fear the court’s honors may yet fall short. Now His Majesty, treasuring thoughts of the wondrous Dao and surpassing the virtue of former emperors, reverently inherits the will of the sagely ancestors and dares to offer sacrifices upon perilous, famed mountains. Having prayed for blessings on behalf of the people, he now performs these rites to manifest your merit—resplendent eulogies, grandly proclaimed. Thus the sagely one reveals the fullness of the Nine Virtues, and the daily protector displays mercy to all living beings. Rainbow phoenixes bear invitations in their beaks, white cranes soar through the sky to witness below. Heaven and humanity rejoice in your grace; mountains and peaks glow with honor.\n\nWe reverently ascend the sacred peak to proclaim the imperial mandate. The blessings we seek are humbly offered for the radiant court.\n\nWe pray that His Majesty’s precious reign may extend in grandeur, that the sacred succession may be crowned with felicity, that weapons of war be forever sheathed, and that the winds of transformation may prevail in due season. May the harvests be ever abundant, and the people enjoy the joys of *Huaxu*. Thereafter, may those who cultivate truth and the loftiest Daoist adepts all ascend to the causes of supreme goodness and together partake in the blessings of long life.\n\nThis minister, overwhelmed with deepest reverence, respectfully bows his head, prostrates, and speaks.\n\n---\n\n**Prayer for the Second Peak**\n\n[Text identical to the preceding until:]\nWe reverently invoke the **Recorder of Destinies, Right Custodian of the Forbidden, Profoundly Serene and Virtue-Protector True Lord**: born of the primordial void, endowed with divine virtue, you received your mandate in the script of purple and white, and govern from the Palace of Pure Emptiness. The strains of lutes and pipes flow forth, your person delights in the feasts of the Jasper Terrace. Wind and rain arrive in their seasons; your blessings already suffuse the people and all things. Charged with overseeing the tasks of the upper immortals and the achievements of the Right Forbiddance, though your celestial titles are already exalted, we fear the court’s honors may yet fall short. Now the Emperor, treasuring thoughts of the wondrous Dao and surpassing the virtue of former emperors, reverently inherits the will of the sagely ancestors and dares to offer sacrifices upon perilous, famed mountains. Having prayed for blessings on behalf of the people, he now performs these rites to manifest your merit—resplendent eulogies, grandly proclaimed. Your illustrious virtue overflows in all directions; your divine protection is manifest beyond measure. Rainbow phoenixes bear invitations in their beaks, white cranes soar through the sky to witness below. Heaven and humanity rejoice in your grace; mountains and peaks glow with honor.\n\nWe reverently ascend the sacred peak to proclaim the imperial mandate. [Remainder identical to the preceding.]\n\n---\n\n**Prayer for the Third Peak**\n\n[Text identical to the preceding until:]\nWe reverently invoke the **Three Officials, Life-Preserving, Subtly Wondrous, Profoundly Wise and Benevolence-Protector True Lord**: marked by brilliant talent and outstanding purity, your deeds encompass all that is pure. You oversee the records in the Jade Nectar archives and received your investiture at the Golden Portal. The Dao flourishes in all things; the benevolent embrace culture. Your domain extends across the Six Heavens; your position is exalted as the Preserver of Life. Your decrees are jointly received in the script of purple and white; your governance extends to the Eternal Realm. Though your immortal titles are already exalted, we fear the court’s honors may yet fall short. Now the Emperor, treasuring thoughts of the wondrous Dao and surpassing the virtue of former emperors, reverently inherits the will of the sagely ancestors and dares to offer sacrifices upon perilous, famed mountains. Having prayed for blessings on behalf of the people, he now performs these rites to manifest your merit—resplendent eulogies, grandly proclaimed. The rites of venerating the true are fully observed, perfectly revealing the numinous blessings of protection. The inner teachings are harmonized; the outer doctrines are pacified. Such is the perfection of benevolence—violence and harm do not arise. The black-haired people receive your moisture; what is this if not protection? White cranes soar through the sky nearby, receiving the rainbow phoenixes’ offered invitations. Heaven and humanity rejoice in your grace... [Remainder identical to the preceding.]\n\n**Concluding the First Scroll of the Rites for the Ennoblement of the Three Mao Lords**\n**Beginning the Second Scroll of the Rites for the Ennoblement of the Three Mao Lords**\n\n**Rites for the Celebratory Offering of the Ennobled Sacred Titles of the Three Mao Lords**\n\nThe ritual proceeds as customary until the Invocation of the Sages:\n\nWe have heard that Heaven blesses the imperial house, safeguarding the myriad states’ black-haired people, and that the state exalts its rites, honoring the mountains and rivers of the four directions. No spirit is left unvenerated; all blessings arrive in full.\n\nRolling up the abode of the perfected immortals, the famed peaks of Mount Juqu rise in majesty. The halls of medicine and courtyards of lingzhi are ever solemn in their sacrifices; the wheels of the august chariot and the revered carriage arrive in timely response to the numinous end. Now, in this enlightened and sagely reign, we perform the rites of luminous harmony in full. Edicts are issued in abundance; illustrious titles are bestowed. The Grand Diviner is charged to select an auspicious day; the officials are commanded to prepare the rites. Jade orchids glisten with purity, awaiting the ascent of sheng pipes and cranes; the radiant grasses of the grottoes gleam, as flutes and phoenixes gather in formation.\n\nWe, your servants, reverently receive the imperial mandate and humbly address the true numina. With minds purified and blue petitions prepared, we now solemnly proclaim the invocation.\n\n**Invocation**\n\nThe intent of these words is set forth in full, revealing our utmost devotion. May your profound hearing and supreme wisdom deign to heed and reflect upon them.\n\nWe have heard that the hidden virtue of the ten thousand beings warms, stills, and tranquilizes the spirits within the jade chambers; that the Nine Virtues are embodied in full, their radiance inscribed upon cinnabar and quartz. Brocade-feathered palanquins float through the void, treading upon the light; green banners and purple standards seal the mountains and summon the clouds. Descending to sport upon the Red City, they now alight upon the Jade Grotto.\n\nThe sagely sovereign, gazing upon Heaven’s loving heart, privately unfurls the map of Earth’s depths. Thus, illustrious titles are bestowed, and wondrous traces are exalted. The rites of luminous harmony are perfected; fragrant offerings are presented in abundance. Illustrious virtue is ever fragrant; utmost sincerity knows no end. Today, on this [day] of the [month], as the Dao is practiced, we, the assembled ritualists, now offer the first pinch of incense. May this fragrant smoke ascend to serve the **Primordial Mystery Dao, Tranquil and Vacuous, Sagely Protector, True and Responsive Perfected Lord; Supreme Minister of the Eastern Marchmount, Controller of Destinies; High Perfected of the Primordial Mansion**. Through the power of this Dao, we pray for the emperor’s sacred longevity without end.\n\nWe humbly beseech that the true end may descend in response, manifesting its luminous regard. May auspicious radiance flow forth, truly fulfilling the favor of the Nine Heavens. May vast blessings be bestowed, and the era of ten thousand years of life be eternally proclaimed. May joy and tranquility extend to the four quarters, and may all things rejoice in harmony.\n\nWe have heard that golden light conceals the luminous, journeying together through the vast caverns of Heaven; that purple silk unfurls its patterns to display the virtue of the divine and bright. Now, the manifest register is proclaimed anew, further exalting the honored titles. Clothed in the numinous precincts with reverence, may the assembled immortals rejoice together.\n\nToday, on this [day] of the [month], as the Dao is practiced, we, the assembled ritualists, now offer the second pinch of incense. May this fragrant smoke ascend to serve the **Recorder of Destinies, Rightward Guardian of the Most Perfect Dao, Tranquil and Virtuous, Wondrously Responsive Perfected Lord; High Immortal of the Mansion of Destinies**. Through the power of this Dao, we pray for the empress. May her achievements be inscribed upon tripods and bells, her virtue surpassing the sands of the rivers. May her great and unshakable foundation be ever exalted; may her boundless and grand reign be eternally preserved. May the spirits and ancestral forebears come to feast and bring peace; may the altars of soil and grain and the ancestral shrines be secure and enduring. May the palace of pepper blossoms be blessed with felicity, its demeanor a model for the myriad states. May the jade branches flourish; may the root and branches endure for a hundred generations.\n\nWe have heard that the Lord of Mount Tai encompasses all, presiding over the profound depths of the divine palaces of the Upper Mansion; that he holds the golden register of seals and plants the precious dragon lingzhi and grotto grasses. His civil virtue is imbued with benevolence; his martial prowess is awe-inspiring. The Nine Steps are adorned with rites of exaltation; the hearts of the people cherish the sincerity of repentance and rejoicing. With reverence, we purify the orchid precincts and humbly present the aquatic offerings.\n\nToday, on this [day] of the [month], as the Dao is practiced, we, the assembled ritualists, now offer the third pinch of incense. May this fragrant smoke ascend to serve the **Three Officials, Protectors of Life, Subtly Wondrous, Tranquilly Wise, Benevolently Protective, Spiritually Responsive Perfected Lords; True Immortals of the Mansion of Life Protection**. Through the power of this Dao, may they guide and welcome the luminous sun, bestowing blessings upon the common people. May weapons and illness not arise; may rain and sunshine arrive in due season. May the Three Luminaries remain whole, and cold and heat be regulated; may the Five Grains ripen, and grasses and trees flourish. May the ten thousand things be nurtured and all prosper; may not a single person be left without shelter. May all be auspicious and without misfortune; may every action be accomplished.\n\n**Great Thanksgiving**\n\nWe, your servants, dwell in blessed lands and receive the teachings of the true immortals. We have glimpsed the secret texts of the towering peaks and been entrusted with the supreme Dao of the Jade Youths. Humbly charged with prayers and supplications, we rely upon the power of spiritual resonance.\n\nUnworthy though we are to receive the bestowal of worldly rank, how dare we betray the weight of our masters’ grace? Reverently receiving the enlightened edict, we hasten to present the register of exaltation. With hearts full of celebratory reverence, we greatly expound the meaning of the numinous response, striving to express our sincerest devotion and repay the abundant blessings.\n\nNow, the emperor deigns to regard the famed mountains and reverently honor the true protectors. The edict, warm with six characters, gloriously enhances the illustrious titles; the three peaks, adorned with imperial splendor, are suffused with the pure fragrance of the imperial censer. The rites are solemnly prepared; the grand names are reverently offered. Our sentiments are expressed in words; our reverence is manifest in the ritual objects.\n\nWe, your servants, have received and proclaimed the secret decree, extending our welcome to the exalted perfected. We earnestly hope that you will deign to regard our intent and fulfill our wishes. May the emperor’s life span equal that of the Eastern Dipper and Weaver Maid; may his blessings extend to the Chinese and the barbarians alike. May the six palaces dream of propitious omens; may the four frontiers be pacified of serpents and boars. May the Xiongnu submit at the frontier passes, sparing the need for Han envoys; may the many officials fill the courts, restoring the grandeur of the Zhou dynasty. May the altars of soil and grain enjoy enduring blessings; may the spring and autumn records proclaim years of great abundance.\n\nMay all beings, even those in flight or afloat, preserve their lives in full.\n\nAbove, may this manifest the compassion of the Three Perfected; below, may it accord with the emperor’s utmost sincerity.\n\nWe humbly submit this memorial for Your attention.\n\n**Twelve Vows:**\nMay the incense burner be restored as in the usual rite.\nMay the celebration liturgy and jiao offering be conducted.\nMay the *Weiling Chi* be recited, and the burner kindled as in the established form.\nMay the officials be dispatched.\n\nWe reverently issue forth from our bodies as in the usual form, and with one heart ascend to address the sacred thrones of the Three Lords:\n\nBy karmic affinity of former lives, we have presumptuously followed the teachings and the Dharma. On the day of our covenant, we pledged to uphold our practice, vowing to propagate the true wind of the Dao, to invigorate and spread its great transformation, to eternally support the imperial destiny, and to universally benefit all living beings. Whatever we pray for, we duly report and memorialize.\n\nWe now reverently proclaim the emperor’s secret decree, declaring his illustrious investiture. We humbly present the rites of celebration and repentance, that the great blessings of response may be gathered.\n\nHerewith, we prostrate and offer one document of blue-green prayer-text, beseeching the *Gongcao* messengers to specially transmit and swiftly convey it upward.\n\nEach states his dharma-rank:\n\nYour subjects, the variously ranked ministers, ascend to address the Three Lords and the Perfected Saints of the Grotto-Heavens:\n\nWe have heard that the Nine Virtues’ merits are lofty, and the Supreme Thearch bestows upon them the Nine Gifts; the Three Officials bear heavy responsibilities, and the Perfected Sovereign receives the scriptures of the Three Origins. The Dao’s beginning is taught by the Lord of Total Perfection; the Registers’ completion is transmitted by the Queen Mother of the West. By relinquishing all attachment to human rank, one attains the position of the Immortal Capital. Jade chambers and coral halls govern the lineage of the Crimson City and the Jade Grotto; phoenix marrow and cinnabar elixirs gather in feasts at the Golden Altar of Mount Goulou. Adorned with the insignia of *Yuyi* and *Jielin*, one obtains the protection of the sun’s radiance and the moon’s splendor, transforming the lands south of the Yangtze and bestowing blessings upon the august realm. The winds of the Celestial Market are pure, and celestial music is played in the empty sky; the waves of Dongting Lake are vast, and the paths connect to the Yin Palaces within the earth. The Blue Lad leaves traces of his whirlwind chariot; the White Crane manifests its soaring form. By talismanic methods, the qi of a thousand demons is expelled; by divine transformation, the hearts of the hundred clans are harmonized. Though we have heard that their traces appear among humans, they never depart from the divine realm above. Where there is sincerity, there is response; no wish goes unfulfilled.\n\nNow the emperor, with a single mind in profound resonance, gazes afar at the Three Radiant Ones. As he encounters this era of flourishing brightness, he recalls the immortals of virtue and the Dao. He initiates grand rites and presents a resplendent memorial, embodying the beauty of emptiness, tranquility, and wisdom, advancing the title of sagely virtue, benevolence, and protection. The imperial mandate descends from Heaven; the jade tablets illuminate the peaks of Long. They enhance the brilliance of the myriad summits and renew the gaze of ten thousand eyes. Having purified the sacred precinct, we respond to the imperial command. We humbly extend our rites of celebration and repentance, reverently offering fragrant incense. The incense curls upward from the renowned peaks, joining the music of the simurgh pipes; the prayer-texts chant in the empty void, summoning the crane-drawn chariots to descend.\n\nOverwhelmed with utmost fervor and urgency, we bow twice and submit this petition.\n\n**First Offering**\n\nWe have heard that Heaven and humanity dwell in separate realms, divided by the Two Modes and Four Images, yet brothers may ascend together as immortals, a rare convergence once in a thousand years. Their fraternal love is recorded in the *Yao Ji*, and their divine traces remain unvanished in Huayang. Through generations, they have been revered; in this imperial dynasty, they are honored with rites.\n\nWe humbly recall the Ancestral Master, the Three Mao Lords of Life and Destiny, the Sagely Virtue and Benevolent Protector Perfected Lords. Born of the primordial void, their aspirations soared to pure emptiness. In ancient times, their praises were foretold in the songs of Jiaping; later, they ascended in succession from the peaks of Juqu. Immortal guests and fellow adepts pledged their visits, while the people of Wu and Yue were all brought under their scrutiny. Each year, in the radiant spring month, they ride the boundless winds, jade pendants to the left, golden bells to the right, leading eight simurghs through the celestial vastness. To the west, they visit Mount Emei; to the east, they bind Linwu, manifesting three cranes upon the peaks. Not only do they wield authority over fortune and misfortune, but they also govern the mechanisms of good and ill, bringing peace to the people, benefit to all things, safeguarding the state, and securing the household. The transformative power of the Dao flows unseen; their merit is accomplished without dominion.\n\nNow, the Emperor stores the essence of the wondrous Dao, surpassing the virtue of former sovereigns. Ever mindful of the challenges of pacification, he reverently serves the true numina. Having secretly received their protection, he fittingly fulfills his devotion. From the nine-tiered palace, grace is bestowed; upon the three peaks, jubilation resounds. Thus, we repay the virtue of aiding the times and pray for the blessings of national protection. With solemnity, we purify the altar and reverently present the ritual mat.\n\nWe, who equally partake in the imperial transformation and are fortunate to dwell upon these renowned mountains, look up to the true spirits of the grotto-heavens, responding to the Emperor’s gracious mandate. May you deign to regard us with favor and graciously accept our earnest prayers. The blue-green memorial is prepared; we shall now proclaim its words.\n\n**Proclamation of the Memorial**\n\nAs the text fully states, our sincere devotion is set forth in vermilion earnestness. May it ascend to the profound and tranquil, assuredly receiving your luminous regard.\n\nWe have heard that the sagely leave no traces, yet some descend into the dusty world; the great Dao is beyond naming, yet how could it seek renown in an age of sagacity? Now, the Emperor personally practices compassion and frugality, his wisdom and insight far-reaching. He revives the winds of purity and stillness, exalting a culture grown thin and shallow. Revering the footsteps of the immortal perfected, he enacts the grand rites of rare splendor. Thus, he honors the Three Lords, revealing their numinous power through the ages. Auspicious responses have graced four emperors of this dynasty, and their blessings have nourished the grasses and roots of Jiangzuo. Therefore, he bestows illustrious titles and elevates their sacred designations.\n\nWe further pray that, without forgetting their origins, they will regard the imperial heart, dispatching commands to the Kunlun terraces and summoning the divine peaks to descend. May they aid in the manifold mysteries, drawing forth abundant blessings, ensuring the flourishing of the jade lineage and the enduring prosperity of the imperial enterprise. May we forever rely upon the great Dao and bring to fruition its grand designs.\n\nOverwhelmed with utmost fervor and urgency, we bow twice and submit this petition.\n\n**Second Offering**\n\nWe have heard that immortality may be learned, with predestined names inscribed in the mysterious charts, and that brothers may ascend together, their steadfast resolve often rewarded by virtuous deeds. Beholding the beauty of Heaven and humanity, they attain the true realm of the imperial abode. Since records began, their renown has been especially resplendent.\n\nWe now reflect upon the virtue of the Three Lords, whose fragrance endures through ten thousand generations. Their Dao sustains the state and household, their kindness flows to the people and all things. By night, their cinnabar radiance shines unbroken; in spring, their crane-drawn chariots return in procession. They serve their masters and roam together; those who love the Dao are entrusted with its stewardship. Mountains and rivers remain unchanged; Heaven and Earth are without end.\n\nNow, the Emperor, deeply moved by true blessings, diligently performs rites of gratitude. Twin simurghs bear the auspicious writs upon jade steps; crane attendants soar through the void, conveying imperial decrees to the jade grottoes. Daoists and laity alike fill the roads with joyous cries; the ritual observances are reverently offered upon the sacred mats. May the profound regard of the immortals descend, bestowing ever-increasing blessings.\n\nWe, entrusted with proclaiming the sagely mandate, look up to aid the immortal enterprise. The cavern bells and jade chimes echo with numinous clarity; mountain herbs and stream offerings present their fragrant sincerity. We humbly hope for the elixir’s grace; the embroidered feathers ascend to the celestial chariots. Auspicious wonders are offered upon the earth; sacred longevity is bestowed to equal Heaven. May the vast beneficence nurture all life; may the imperial enterprise endure for a hundred million years. Five winds and ten rains do not shatter the clods with their sighs; the four seas and nine provinces are all thatched with tribute. The palace halls rejoice in the birth of sons; the frontier defenses proclaim the merit of subduing the barbarians. The harvests are abundant; the black-haired people are at peace.\n\nWe further pray that the sacred mountains remain serene, the true teachings spread far, transforming the demonic and the vulgar to reform their hearts, guiding disciples to advance in the Dao. May all creatures, flying and hidden, fulfill their natures; may plants and trees revive. May all sentient beings together ride the wondrous shade.\n\nOverwhelmed with utmost fervor and earnest prayer, we bow twice and submit this petition.\n\n**Final Offering**\n\nWe, who reverently attend the imperial decrees and grandly proclaim the illustrious titles, have set forth the ritual observances and extended our hospitality to the immortal perfected. We have received the favor of the successive sages and fulfilled the joyous aspirations of all.\n\nNow, the lamp flames fade like orchid embers, and the fragrant incense disperses like clouds. The immortal retinue departs in the distance; we gaze after their numinous radiance and bow in reverence. With deepest respect, we receive the grand favor and look up longingly to the simurgh chariots.\n\nOverwhelmed with utmost yearning and gratitude, we bow twice and humbly take our leave.\n\n**Sending Forth the Immortals**\nThe inner officials restore the incense burners as customary. The rites of celebration and the jiao offering conclude.\n\n**The Emperor’s Blue-Green Memorial for the Jiao Offering**\n\nWe humbly consider that the sagely are boundless, roaming the emptiness of the eight directions, and the great Dao is beyond naming, yet we earnestly yearn for it with devoted hearts. Rightly relying upon the protection of the divine spirits, we fittingly present this luminous memorial. Thus, we enact illustrious titles and reverently offer the ritual mat, solemnly extending our rites of celebration and repentance, praying for enduring blessings.\n\nWhere goodness and benefit are bestowed, the blessings of the black-haired people are secured; where pure felicity descends, the prosperity of the imperial line is further prolonged.\n\nThe Director of the Inner Court, Zhang, presents the memorial for the jiao offering.\n\n**From the *Ji Feng Shan Ji*:**\n\nIt is recorded that the mountain’s form resembles the character *ji*, hence its name, Juqu. Arrayed in solemn ranks, it embodies the true wind of immortals and sages. Though its three titles differ, they together illumine the splendor of this grand rite. Now that the ceremonial offerings are complete, we dare to present these wondrous oblations. Reverently receiving the enlightened decree of the august court, we respectfully proclaim the conferral of titles.\n\nWe humbly pray that the exalted immortals, in their radiant presence, may peer into the unseen and lend their hidden support. May the imperial reign endure without end, and the greatness of the imperial enterprise expand boundlessly. May the three seasons bring no harm, and the people and all beings forever enjoy abundance and peace.\n\n**Memorial for the Jiao Offering at Chongxi Abbey**\n\nWe humbly consider that the imperial edict descends like jade tones, bestowing three titles to honor the true ones, while the golden registers of Chongxi Abbey preside over the peaks to invoke blessings upon the sage. Reverently receiving the gracious mandate, we aspire to aid the immortal’s work. Your humble servant, fortunate to serve in this enlightened age and entrusted with the keys of the teaching, witnesses this momentous rite, which illumines the sacred traces of a thousand ages. Thus, the divine and the numinous alike receive the protection of virtue and benevolence. In divining the years and generations, may the auspicious continuity of the imperial line forever endure.\n\nWith utmost sincerity, we pour forth our joyful praises and offer these refined oblations. May the incense of the grotto-heavens waft afar, amplifying the chorus of \"ten thousand years,\" and may the winds of the Dao-realm blow pure, spreading blessings as grass grows in spring.\n\n**Memorial of Gratitude for the Conferral of Titles upon the Patriarchal Perfected Lords**\n\nYour servant, Master Tan, respectfully states: By the sagely grace of the throne, the three Mao Perfected Lords have been honored with august titles, and three proclamations have been issued. Bestowed are a *ruyi*, a jade scepter, regalia, brocade, *chenxiang* wood, *naozi* incense, fresh tea, and silver taels, commanding your servant to conduct a jiao offering in celebration.\n\nYour servant has reverently obeyed the sagely instructions, leading the ritual currents to announce the rites upon the three peaks, proclaiming the imperial mandate and praying for the flourishing of all life.\n\nWe humbly reflect that this sacred land, steeped in solemnity, unites the felicitations of the four seas, while the imperial favor, flowing from the throne, extends the exalted titles of the three lords. Daoists and laity rejoice together, and gods and humans alike are moved by this grace.\n\nYour servant offers profound thanks, for this mountain cradles the Jade Grotto’s governance and harbors the Golden Altar’s empty terrace. Crane-drawn chariots visit in turn, their years recorded in the registers of Huayang. The Heavenly Sovereign bestowed his mandate, overseeing the lands of Wu and Yue. The Dao aligns with the immortal lineage, its fragrance flowing through a thousand ages; the numinous source of the true lineage has been favored across successive dynasties.\n\nNow, bearing this extraordinary grace, we exalt the ritual offerings. Thus, the virtues of profound emptiness and tranquil wisdom advance to the title of \"Sagely Virtue and Benevolent Protection.\" The resplendent proclamations descend upon the peaks, and the night rain clears the valleys; the imperial procession halts upon the Daoist path, and the morning sun gleams upon the banners. Auspicious mists and propitious vapors hover around the cranes’ sleeves, while the jade scepter and *ruyi* unfold the grandest of rites.\n\nThe rites conclude with harmonious success, the imperial incense wafting its pure fragrance. The feathered ones exchange felicitations, bathed in the glory of the imperial gifts. All appears renewed, and near and far alike rejoice.\n\nThis is all due to Your Majesty’s luminous virtue, which venerates the perilous and sacrifices to transform the people through the Dao. Thus, you extend the bestowal of honors to amplify reverence. When the people are joyful, the gods are never unyielding; when all things are prepared, the rites are fulfilled. Your profound favor brings fortune to the mountains and forests, while your boundless grace nourishes even the grasses and trees. The conferral is already vast, and perfect blessings naturally follow.\n\nYour servant, bearing the imperial mandate, ascends the immortal’s court to pray for the sage’s boundless longevity, celebrating the spread of blessings throughout the realm. Moved by the perfected ones’ response to these prayers, may the radiance of the celestial luminaries shine ever brighter.\n\nYour servant, overwhelmed by gratitude for the celestial and imperial favor, is filled with awe and trepidation. With utmost reverence, I kowtow repeatedly and present this memorial in gratitude.\n\n**Memorial submitted on the ___ day of the sixth month in the ninth year of the Chunyou reign.**\n**Submitted by your servant, Sima Shitan, newly promoted Left Street Daoist Registrar, Master of the Cavernous Subtlety, Vacuous White Scholar, and Director of the Teaching Office.**\n\n**Submission Document**\n\nOn the twenty-first day of the fourth month, I duly received the official document bearing the sacred edict, which bestowed upon me three decrees of enfeoffment for the Perfected Lords, along with imperial gifts of *ruyi* scepters, jade tablets, brocade robes, ceremonial regalia, agarwood, borneol, choice tea, and silver ingots. The edict commanded me to select an auspicious day to hold a jiao offering and make solemn announcement thereof.\n\nAccordingly, I, your servant, have reverently complied with the imperial instruction, receiving in full the aforementioned decrees, imperial gifts, and precious objects. I then convened the Daoist clergy and laity of Mount Gui to descend the mountain and receive them, facing the imperial palace to express gratitude for the celestial favor. Proceeding to the Three Peaks, I proclaimed the imperial mandate, and in due course selected a day to hold the jiao offering, thereby completing the rites of announcement to Heaven, Earth, and the Immortal Perfected.\n\nI have duly compiled a ritual register, recording in detail the ceremonial procedures and sequence of events. The decrees of enfeoffment were distributed among the Three Peaks, the imperial gifts were displayed, and all were entrusted to the Chongxi Abbey’s Daoist Registrar for permanent enshrinement in this sacred mountain, that the sagely longevity may be eternally extended.\n\nHerewith, I present the inventory ledger from Chongxi Abbey detailing the received items, along with three receipts from the Three Peaks acknowledging the decrees and gifts. I humbly submit this memorial for Your Majesty’s gracious consideration and await your further instruction.\n\n**Submission Document submitted on the ___ day of the sixth month in the ninth year of the Chunyou reign.**\n**Submitted by your servant, Sima Shitan, in his official capacity.**\n\n---\n\n**Memorial on the Erection of the Stele for the Enfeoffment Decrees**\n\nYour servant, Sima Shitan, respectfully states: The triple enfeoffment bestows radiant splendor upon the mountains of Juqu, its glory imperishable as the jade of Kun’gang. Perched upon the sacred tortoise and guarded by feathered cranes, its inscriptions command reverence, while from afar the imperial grace is acknowledged by all under Heaven.\n\nThough the marvels of the Perfected Immortals need no illumination by steles, their merits toward humanity must not be left in obscurity. The five-colored clouds of Han still bear witness to imperial decrees, and the Nine Bestowments of Jin remain engraved in stone. Through successive dynasties, they have been graced with imperial favor. Now, a thousand years later, we are fortunate to live in this sagely era, where their exalted titles are further ennobled, magnifying the recompense to the numinous spirits and redoubling the glory of the supreme teaching.\n\nThus, I have selected the finest stone, seeking to ensure its endurance coeval with this mountain. This is all due to Your Majesty’s virtue, profound and sagacious, whose mind perceives even the subtlest truths. You harmonize the Three Powers in perfect accord, governing all within the Four Seas with boundless inclusivity. In your daily conduct, you embody the Dao; in repose, you cultivate the flourishing of a hundred aspirations. The people cannot name your virtue, yet you personally achieve the perfection of the Nine Virtues. Humble in your governance, you seek to repay the divine blessings, bestowing timely favors like rain and dew, so that even the mist-laden peaks feel the weight of your grace.\n\nThough I have long been distant from the celestial court, I renew my devotion upon receiving this mandate. Thus, I have carved these imperishable words to serve as an eternal guardian of the imperial majesty among the peaks. I dare to hope that Your Majesty will deign to cast your gaze upon them.\n\nI humbly present this memorial for Your Majesty’s consideration. Overwhelmed by the awe of addressing the imperial throne, I am filled with boundless trepidation.\n\n**With utmost reverence, I kowtow repeatedly and respectfully submit this memorial.**\n\n**Submitted on the ___ day of the twelfth month in the ninth year of the Chunyou reign.**\n**Submitted by your servant, Sima Shitan, in his official capacity.**\n\n**The second fascicle of *Records of the Enfeoffment of the Three Mao Perfected Lords* concludes here.**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "三茅真君加封事典 经名：三茅真君加封事典。 二卷。 宋账大淳编。 底本出处：《正统道藏》洞真部谱录类。 三茅真君加封事典序 道有原有统，原先天地而莫穷其始，统后天地而莫穷其终。 世乃谓吾道有绝续，吁，有是哉。 日用常行，饥食渴饮之天，何莫非道，一脉之传，至今绵绵延延，一日初未尝泯，惟患世无传道之人耳。 故日人能弘道，非道弘人也。 茅君之仙踪显迩，着於先秦古史，续传已书其详。 其仙班之尊崇，固非世人之所能测料。 至如功济九垓，恩流万世，社稷攸资，宗桃有托，昔在思陵以至固陵，尝增三君之休称美号，时则有刘静一诉其源而推其波矣。 迨理宗朝，我虚白高士司徒道录以为国为民梼祈响应，特俾以左街洞微之命，先生日：嘻，是皆三君之灵也，何敢私有其所有，愿以是宠光归之三君，以崇报 本之义。 理宗允之，芝泥炳焕，照耀林泉。",
      "translated_text": "**The Ritual of Ennobling the Three Mao Perfected Lords**\n\n**Scripture Title:** *The Ritual of Ennobling the Three Mao Perfected Lords*\nTwo fascicles. Compiled by Zhang Dachun of the Song Dynasty.\nSource text: *Daoist Canon of the Zhengtong Era*, \"Compendia of the Cavernous Truth\" section, category of registers and genealogies.\n\n**Preface to *The Ritual of Ennobling the Three Mao Perfected Lords***\n\nThe Dao has its origin and its lineage—its origin precedes heaven and earth, unfathomable in its beginning; its lineage follows heaven and earth, boundless in its end. Yet the world claims our Dao waxes and wanes. Alas! How could this be so?\n\nIn daily life and common practice, from hunger’s meal to thirst’s drink, where is the Dao not present? Its single thread of transmission endures unbroken to this day, never once having faded. The only peril lies in the world’s lack of those who transmit the Dao. Thus it is said: *Humans can magnify the Dao; the Dao does not magnify humans.*\n\nThe immortal traces of the Mao Lords have long been manifest, recorded in ancient histories since the pre-Qin era, with later transmissions detailing their legacy. Their exalted rank among the immortals is beyond the reckoning of mortal minds. As for their merits in aiding the Nine Realms, their grace flowing through ten thousand generations, their support of the altars of state, and their provision for the ancestral sacrifices—from the reign of Emperor Sizong to that of Emperor Gulong, they were honored with ever more resplendent titles. At that time, Liu Jingyi traced their source and amplified their influence.\n\nBy the reign of Emperor Lizong, the eminent Daoist Master Situ of Xubai, serving as State Preceptor and Registrar of the Dao, petitioned for the nation and the people, and his prayers were answered. He was specially entrusted with the mandate of the Left Bureau of the Cavernous Mystery. The Master declared: \"Ah! All this is the numinous power of the Three Lords. How dare I claim what is rightfully theirs? I humbly return this honor and glory to the Three Lords, to fulfill the principle of repaying the root.\"\n\nEmperor Lizong assented. The vermilion seals gleamed, illuminating the forests and springs.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 354,
      "start_sentence": 0,
      "end_sentence": 15,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.461334705352783,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\三茅真君加封事典.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "维时大淳实执弟子列，目击斯事。 司徒君屡期以加封事典载之金石，未及为而君已仙去。 大淳承乏下馆，久思继志，冗未遑也。 丁卯春，《内传》、《续传》幸甫就绪，同班诸友复以事典未刊为疑，谓事典不刊则不惟不足以彰三君之灵异、圣朝之尊崇，且不足以见我空山之能弘斯道之脉而阐斯道之传也。 余於是乎奉承惟谨，谨书此以识岁月。 丁卯三月望日，特赐冲靖明真微妙大师、特差充茅山山门道正、权知御前崇禧观兼管领本山诸宫观事赐紫张大淳谨书。 三茅真君加封事典卷上 特赐洞微先生右街鉴义主管教门公事 佑圣观虚白斋高士臣司徒师坦恭承 特赐冲靖明真微妙大师特差充茅山山门道正 权知崇禧观管辖本山诸官观赐紫臣张大淳编 尚书省割淳佑九年正月　日到 正月初一日，恭奉圣旨，颁降劝黄一道：虚白斋高士洞微先生司徒师坦特转左街道录，主管教门公事。 右剖司徒师坦准此。 淳佑九年正月　日 黄",
      "translated_text": "At that time, among the disciples of the Great Purity era who stood in attendance, I witnessed these events with my own eyes. Master Situ had repeatedly pledged to inscribe the rites of enfeoffment upon metal and stone, yet before he could fulfill this, he had already ascended as an immortal. When I, Great Purity, assumed the humble post at the lower abode, I long contemplated carrying on his unfulfilled intent, but pressing affairs left no leisure for the task.\n\nIn the spring of the dingmao year, the *Inner Transmission* and its *Continuation* were fortunately completed. My fellow disciples of the same rank once again expressed concern that the rites of enfeoffment remained unrecorded, saying: \"Without their inscription, not only will the numinous marvels of the Three Lords and the august reverence of the sacred court fail to be proclaimed, but neither will it be seen how we of Kongshan have magnified the pulse of this Dao and expounded its transmission.\" Thereupon, I received this charge with the utmost reverence and now dutifully inscribe this to mark the time.\n\nOn the full moon of the third month in the dingmao year,\nThe Specially Bestowed Master of Pure Tranquility, Illuminating Perfection, and Subtle Wonder;\nSpecially Appointed Daoist Rectifier of the Maoshan Mountain Gate;\nProvisional Supervisor of the Chongxi Abbey before the Throne and Overseer of All Abbeys on This Mountain;\nPurple-Robed Zhang Dachun respectfully inscribes.\n\n*Enfeoffment Rites for the Three Mao Lords, Volume the First*\nThe Specially Bestowed Master of the Cavernous Mystery, Supervisor of the Right Bureau, and Director of Daoist Affairs\nMinister Situ Shitan, the High Scholar of the Void-White Studio at the Yousheng Abbey, reverently undertakes this charge.\n\nThe Specially Bestowed Master of Pure Tranquility, Illuminating Perfection, and Subtle Wonder;\nSpecially Appointed Daoist Rectifier of the Maoshan Mountain Gate;\nProvisional Supervisor of the Chongxi Abbey and Overseer of All Abbeys on This Mountain;\nPurple-Robed Minister Zhang Dachun, compiler.\n\nIssued by the Ministry of Rites on the first day of the first month in the ninth year of the Chunyou era.\n\nOn the first day of the first month, the imperial edict was reverently received, bestowing a decree of exhortation:\n\"The High Scholar of the Void-White Studio, Master of the Cavernous Mystery, Situ Shitan, is hereby specially promoted to Registrar of the Left Bureau and Director of Daoist Affairs.\"\n\nThe Right Bureau has duly noted this for Minister Situ Shitan.\nFirst day of the first month in the ninth year of the Chunyou era.\nImperial Decree.",
      "overlap_context": "gistrar of the Dao, petitioned for the nation and the people, and his prayers were answered. He was specially entrusted with the mandate of the Left Bureau of the Cavernous Mystery. The Master declared: \"Ah! All this is the numinous power of the Three Lords. How dare I claim what is rightfully theirs? I humbly return this honor and glory to the Three Lords, to fulfill the principle of repaying the root.\"\n\nEmperor Lizong assented. The vermilion seals gleamed, illuminating the forests and springs.",
      "start_char": 354,
      "end_char": 741,
      "start_sentence": 16,
      "end_sentence": 31,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.032406330108643,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\三茅真君加封事典.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "尚书省牒：特赐洞微先生右街鉴义主管教门公事佑圣观虚白斋高士司徒师坦．牒：奉劝宜特转左街道录，主管教门公事。 牒至，准劫故牒。 淳佑九年二月　日。 签书枢密院事兼权参知政事谢　押 同知枢密院事兼权参知政事应　押 枢密使兼参知政事赵督视 太傅右丞相越国公　押 辞免道录表 臣师坦言：恭奉圣旨，以臣三年祈祷，特转左街道录，主管教门公事者。 臣闻命自天，措躬无地，切以知足不辱，炳太上之至言，得宠若惊，尤道家之明戒，荣逾涯分，惧凛渊冰。 臣中谢。 伏念臣才非已千，学惭道百，敢谓山樊之贱，误膺明圣之知，两趋上国以观光，久污虚斋之生白，那鄂有梦，偶听於钧天，蓬岛回舟，奉祠於福地，豆边奔走竭其智以祈祥，晨夕黑崇愿以身而报上，愧毫分之无补，荷赏责之屡加。 福过灾生，人嗟命薄，形劬骨立，木类同枯，志丧神疲，灰毋复焰，丐闲之请实出由衷，日允之俞且蒙锡赐。 方指天地设报君之誓，已盟泉石为终世之游，逍遥乎广漠之乡，彷徨乎尘垢之外。 诅意九重之眷，复怜三载之劳，不次推恩，骤进左街之录，非常冒宠，真为末路之辉。 然衣绣被狙，必龄啮而挽裂，彼咸韶乐钨，徒眩视以悲忧，退惟侥幸之多，恐速颠跻之咎。 伏望皇帝陛下乾坤容覆，日月昭回，迩臣前后非伪之心，全臣始终知止之节，收还成命，毋拘反汗之嫌，俾遂余生，庶竭捐躯之效。 所有恩命，未敢祇受，冒犯天威，臣无任瞻　天望　圣激切之至。 谨具表上奏以闻。 谨奏。",
      "translated_text": "The Ministry of Rites issues this document:\nTo the Specially Appointed Master of the Cavernous Mystery, Right Bureau Supervisor of Daoist Rectification, and Director of Daoist Affairs, High Scholar of the Void-White Studio at the Hall of Assisting Sageliness, Situ Shitan.\n\nThis document conveys the imperial exhortation that he be specially promoted to Left Bureau Registrar and Director of Daoist Affairs. Upon receipt, this document shall supersede all previous decrees.\n\nDated the ____ day of the second month in the ninth year of the Chunyou era.\n\nVice Director of the Bureau of Military Affairs and Acting Vice Grand Councilor, Xie [seal]\nVice Director of the Bureau of Military Affairs and Acting Vice Grand Councilor, Ying [seal]\nDirector of the Bureau of Military Affairs and Vice Grand Councilor, Zhao, Supervisor [seal]\nGrand Preceptor, Right Chancellor, and Duke of Yue [seal]\n\n**Petition to Decline the Appointment as Registrar**\n\nYour servant, Situ Shitan, humbly states:\nI have reverently received the imperial decree, which, in recognition of my three years of prayerful service, specially promotes me to Left Bureau Registrar and Director of Daoist Affairs.\n\nI have heard that commands from heaven leave me no ground to stand upon. Truly, \"to know contentment is to avoid disgrace\"—this is the luminous teaching of the Most High. \"To receive favor with alarm\" is the clear warning of the Daoist tradition. My honor exceeds all bounds, and I tremble as if standing on thin ice.\n\nI prostrate myself in gratitude.\n\nReflecting upon my own inadequacies, I find my talents far from sufficient and my learning shamefully deficient in the Dao. How could one as lowly as I, dwelling in mountain seclusion, have been so mistakenly favored with the sagely discernment of Your Majesty? Twice I journeyed to the capital to behold its splendor, and for long have I soiled the purity of the Void-White Studio. Yet by some dreamlike fortune, I was granted an audience in the celestial court; like a boat turning toward Penglai, I was entrusted with the sacred precincts of blessed lands. Racing between altars, I exhausted my meager wisdom in prayers for auspiciousness; from dawn to dusk, I vowed to repay Your Majesty with my very life. Though my contributions were negligible, I was repeatedly burdened with rewards. But blessings overabundant breed misfortune, and men lament my frail fate. My body is worn to the bone, like a withered tree; my spirit is broken, my will extinguished, like ashes that no longer flame. My plea for retirement arises from the depths of my heart, and Your Majesty’s gracious assent has already been bestowed.\n\nI had sworn before heaven and earth to repay my sovereign, and pledged before streams and stones to wander the world in seclusion, roaming freely in the vast wilderness, lingering beyond the dust and filth of the world. Who could have foreseen that the imperial favor would again take pity on my three years of toil, bestowing undeserved grace to swiftly elevate me to the Left Bureau Registrar? Such extraordinary honor, a radiance at the end of my path, is more than I can bear. For when embroidered robes are draped upon a monkey, it will surely tear them to shreds with its teeth; when the music of *Xianchi* and *Shaohao* is played for an owl, it only bewilders and saddens the listener. Looking back, I fear my good fortune is excessive, and that such rapid advancement will hasten my downfall.\n\nI humbly beseech Your Imperial Majesty, whose virtue encompasses heaven and earth, whose brilliance rivals the sun and moon, to consider the sincerity of my past and present intentions, and to preserve my resolve to know my limits from beginning to end. I implore You to revoke this decree, lest You be constrained by the appearance of retracting a promise, and to allow me to spend my remaining years in service, offering what little strength I have left. I dare not accept this honor, for to do so would be to risk offending Your celestial majesty.\n\nWith the utmost reverence and urgency, I submit this petition for Your Majesty’s consideration.\n\nRespectfully submitted.",
      "overlap_context": "e first month in the ninth year of the Chunyou era.\n\nOn the first day of the first month, the imperial edict was reverently received, bestowing a decree of exhortation:\n\"The High Scholar of the Void-White Studio, Master of the Cavernous Mystery, Situ Shitan, is hereby specially promoted to Registrar of the Left Bureau and Director of Daoist Affairs.\"\n\nThe Right Bureau has duly noted this for Minister Situ Shitan.\nFirst day of the first month in the ninth year of the Chunyou era.\nImperial Decree.",
      "start_char": 741,
      "end_char": 1331,
      "start_sentence": 32,
      "end_sentence": 51,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.7478187084198,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\三茅真君加封事典.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "淳佑九年二月日特赐洞微先生右街鉴义主管教门公事虚白斋高士臣司徒师坦上表奉旨，不许再有辞免。 内省公文 闰二月初七日得旨，高士特转左街道录付去　劝黄省割各一道，请具谢。 奏回，不许再有辞免。 初七日资降到　黄省剖各一道，寄留句容县。 是月十五日再辞，乞回降恩命加封三茅司命真君圣号。 乞加封表 臣不避严诛，辄沥忱捆，上干天鉴。 臣正月初一恭奉圣恩，界臣左街道录，主管· 教门公事。 臣尝具表控辞，弗获。 今来复蒙给降· 黄一道，令臣祇受前件职事，不得再有辞免者，臣承命惭惶，采增感惕。 臣痛自修励，早慕清真，诅意颓龄荐蒙恩遇。 退省其私，盍知所本，盖以生人本乎天，万物本乎祖。 人不本乎天，无以知受命之始，物不本乎祖，无以究归根之宗。 臣翳迩茅山，乃三茅真君成道之所，系第一地肺福地，第八华阳洞天，宫观庵院，晨锺夕磬，奉三君香火，为国焚修，祝延圣寿，天下名山於斯为盛。 爰自汉辑迄于我宋，或发三君之潜耀，或隆三君之美名，香火绵绵，不绝如栈，此盖真仙於是为治职之地，国家於是植无疆之休。 臣不揣狂愚，欲乞以前后所赐臣高士鉴义并今来所赐道录劝命，回降圣恩，照正一天师佑圣真君近例，加封本山祖师三茅真君徽号，特颁一札，各贲三峰，此人本乎天、物本乎祖之义也。 臣谨按三君事迹，上烦　圣听，惟陛下垂览焉。 窃以茅氏之宗，仙源甚远。 大茅君盈，次固，次衷，兄弟三人，岩栖谷隐，精练道真，累功积行。 得道之后，领括旱仙，受事太极，司命岳府，考校乎昊越之境，留治乎赤城之山。 其德纪於紫书，其功茂於玉册，鹤帐龙池，屡显神异，天灯丹光，至今隐见，水旱雨雪，随祷辄应，祸福吉凶，其验如响，狼燧以之而息警，鱼梦以之而考祥。 臣自入山以来，每奉州县祷祈，其详如此。 而况历代崇敬，宠渥便蕃。 祥符、景德间，既严之以山禁，复申之以赐田，又继之以镯租。 祠奉甚严，高媒有祷。 於是仁祖皇帝开虹电之祥嗣是诞弥必降御香，修建金线。 高宗皇帝屡遣中使传宣严劝，监司保护。 乾淳而下，崇奉尤虔。",
      "translated_text": "In the second month of the ninth year of the Chunyou reign, on a designated day, the Master of the Cavernous Subtlety, High Scholar of the Empty White Studio, Minister Sidu Shitan, Supervisor of the Teaching and Affairs of the Dao on the Right Avenue, was specially bestowed the title of *Jianyi*. He submitted a memorial to decline and was denied further refusals.\n\n**Internal Provincial Document**\nOn the seventh day of the intercalary second month, an imperial decree was received: the High Scholar was specially promoted to *Daolu* of the Left Avenue, with an exhortation and a *huang* decree issued for his compliance. A memorial of gratitude was to be prepared.\nUpon resubmission, further refusals were again denied.\nOn the seventh day, the bestowed *huang* and exhortation decrees arrived and were deposited in Jurong County.\n\nOn the fifteenth day of the same month, he submitted another memorial, beseeching the revocation of the imperial favor and the conferral of a sacred title upon the Three Mao Lords of the Office of Destiny.\n\n**Memorial Requesting the Conferral of a Sacred Title**\nThis minister, undeterred by the severity of punishment, dares to lay bare his sincerity, risking offense to the celestial scrutiny.\n\nOn the first day of the first month, this minister reverently received the imperial grace, being appointed *Daolu* of the Left Avenue and Supervisor of the Teaching and Affairs of the Dao. Though I previously submitted a memorial to decline, it was not granted. Now, I have again been honored with the bestowal of a *huang* decree, commanding me to accept the aforementioned office, with no further refusals permitted. Overwhelmed by the imperial command, I am filled with shame and trepidation.\n\nI have striven to cultivate myself and early aspired to purity and truth, yet never did I imagine that in my declining years I would be favored with such imperial grace. Reflecting inwardly, I recognize my origins: humanity is rooted in heaven, and all things are rooted in their ancestors. Without rooting humanity in heaven, one cannot know the beginning of the mandate received; without rooting things in their ancestors, one cannot fathom the ultimate source of their return.\n\nThis minister has long dwelled on Mount Mao, the place where the Three Mao Perfected Lords attained the Dao. It is the first earthly lung and blessed land, the eighth Cavern Heaven of Huayang, where palaces, monasteries, and hermitages resound with morning bells and evening chimes, tending the incense fires of the Three Lords, offering prayers for the state, and extending the sacred longevity of the emperor. Among the famous mountains of the realm, none surpass this in grandeur.\n\nFrom the Han dynasty to our present Song, whether revealing the hidden radiance of the Three Lords or exalting their illustrious names, their incense fires have burned continuously, unbroken as a bridge. This is the very place where the perfected immortals fulfill their administrative duties, and where the state plants the seeds of boundless prosperity.\n\nIn my reckless folly, I dare to beseech that the titles previously bestowed upon me—High Scholar and *Jianyi*—along with the present appointment as *Daolu* and the exhortation decree, be revoked as imperial grace and, following the recent precedent of the Celestial Master and the Perfected Lord Who Assists the Sacred, that a sacred title be conferred upon the ancestral masters of this mountain, the Three Mao Perfected Lords. Let a decree be specially issued, bestowing honor upon the three peaks, thereby embodying the principle that humanity is rooted in heaven and all things in their ancestors.\n\nThis minister respectfully presents the deeds of the Three Lords for Your Majesty’s august perusal.\n\nI humbly observe that the ancestral lineage of the Mao clan traces back to a distant wellspring of immortality. The eldest, Mao Ying; the second, Mao Gu; and the third, Mao Zhong—three brothers who dwelled in mountain caves and secluded valleys, refining their Dao and truth through diligent practice. After attaining the Dao, they were entrusted with the governance of early immortals, received their charge from the Supreme Ultimate, and presided over the Office of Destiny in the sacred peaks. They examined and assessed the realms of Wu and Yue, and established their abode upon the Red City Mountain. Their virtue was recorded in the purple books, their merits inscribed in the jade registers. Their crane tents and dragon pools repeatedly manifested divine marvels; the celestial lamps and cinnabar lights remain visible to this day. In matters of drought, rain, or snow, their responses to prayers are immediate; in fortunes and misfortunes, their verifications are as swift as an echo. The beacon fires of war have been stilled by their vigilance, and the auspicious omens of fish and dreams have been confirmed by their signs.\n\nSince my arrival at this mountain, I have witnessed these details firsthand in the prayers offered by prefectures and counties. Moreover, the veneration accorded them through the ages has been abundant and flourishing. During the Xiangfu and Jingde eras, the mountain was strictly protected, lands were bestowed, and tax exemptions were granted. The sacrifices offered were solemn, and the prayers for high harvests were answered. Thus, during the reign of Emperor Renzu, the auspicious sign of a rainbow and lightning heralded the imperial heir; subsequently, imperial incense was sent, and the Golden Register was established. Emperor Gaozong repeatedly dispatched envoys to convey his earnest exhortations and ordered local officials to protect the site. From the Qiandao and Chunxi eras onward, the veneration has been even more devout.",
      "overlap_context": "t intentions, and to preserve my resolve to know my limits from beginning to end. I implore You to revoke this decree, lest You be constrained by the appearance of retracting a promise, and to allow me to spend my remaining years in service, offering what little strength I have left. I dare not accept this honor, for to do so would be to risk offending Your celestial majesty.\n\nWith the utmost reverence and urgency, I submit this petition for Your Majesty’s consideration.\n\nRespectfully submitted.",
      "start_char": 1332,
      "end_char": 2155,
      "start_sentence": 52,
      "end_sentence": 80,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.576286792755127,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\三茅真君加封事典.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "臣比膺  上旨，俾事祈禳。 ．每当戏事，必密誊  宸命，躬叩洞天，上祈天既，下告山川。 凡系祠典，悉与关遣，常荷真仙孚佑，诸福荐臻。 此盖皇帝陛下抱神以静，与道合真，德修於蟆濩蜡蛆之中，化行於昆仑磅确之外，以至乌兽鱼鳖罔不若，山川鬼神莫不宁。 故凡有显应，所在见之，申请咸被褒封。 独本山三真未蒙表异，臣照得  三茅君初受上帝封号，职任洞天，先朝尝即其灵边进加封爵，臣谨具于后。 伏愿陛下俯从愚请，收所赐臣恩命，特加祖师徽称，式彰三君护国之灵休，昭示皇朝报功之盛典，亦臣反本报祖之职分也。 臣痛念山林之士非无遭际圣明者，多自荣身，未知报本，仙真灵耀迄今埋光。 重念臣年运俱往，槁木灰心，曾蔑寸功，叨瑜恩分，更冒误恩，实负阴谴。 伏望圣慈悯臣以衰暮之踪，察臣无贪荣之累，回降特恩，增重名山，以显祖宗崇敬祈祷之地，以永国家亿万斯年之休，不胜幸甚。 臣谨录白三茅真君元封劝命三道，随表进呈。 所有赐臣劝黄恩命，未敢望阙祗受，已具公状寄留句容县库，拱俟指挥，容臣并将前后蒙赐劝黄三道具表缴进。 臣干冒天威，伏取  进止。 二月日特赐洞微先生右街鉴义主管教门公事虚白斋高士臣司徒师坦上表 元封告勃 尚书省牒：准今月二十七日  诏劝门下：句曲洞天有真人焉，变化无方，灵妙不测，秦汉而降，历千余年，啧陆发祥，泽于生民。 而隆名徽称，犹或未备，非所以极祟奉之诚也。 茅山大茅君今号太元真人束岳上卿司命神君，可进号太元妙道真君束岳上卿司命神君，庶几导和气，获嘉应，以相助国家太平无疆之福。 故兹诏示，想宜知悉。 牒：奉  诏书如前。",
      "translated_text": "The臣, having recently received the imperial decree, was charged with conducting prayers and exorcisms. Whenever grand rituals were held, he would reverently transcribe the sacred edict, personally knock at the grotto-heaven, supplicating above to the celestial poles and below to the mountains and rivers. All matters pertaining to the sacrificial canon were duly reported, and through the constant favor and protection of the perfected immortals, manifold blessings have accrued. This is none other than because Your Imperial Majesty, embracing the spirit in quiescence, unites with the Dao in truth; your virtue is cultivated amidst the humblest creatures, and your transformative influence extends beyond the vastness of Kunlun. Thus, birds, beasts, fish, and turtles all submit, while mountains, rivers, ghosts, and spirits all attain peace. Wherever manifest responses appear, they are witnessed, and petitions are met with ennobling honors. Yet the Three Perfected Ones of this mountain alone remain without special distinction.\n\nThe臣 notes that the Three Mao Lords initially received their celestial titles and were charged with overseeing the grotto-heaven. In former reigns, their numinous precincts were honored with elevated ranks, which the臣 has meticulously recorded below. He humbly beseeches Your Majesty to heed his earnest plea, to bestow the grace of the imperial mandate upon him, and to specially confer honorific titles upon the ancestral masters, thereby manifesting the Three Lords’ protective and propitious efficacy for the state, and illuminating the august dynasty’s grand tradition of requiting merit. This would also fulfill the臣’s duty to return to the source and repay his origins.\n\nThe臣 grieves that among those reclusive scholars who have encountered sagely enlightenment, many seek only personal glory, unaware of the need to repay their roots. The radiance of the perfected immortals remains buried to this day. Moreover, the臣 reflects that his years and fate both wane, his heart like withered wood or cold ashes, having achieved not even an inch of merit yet presumptuously enjoying imperial favor. To further trespass upon this grace would truly incur the reproach of unseen retribution. He humbly implores Your Sagely Compassion to pity his declining years, to perceive his lack of avarice for honor, and to bestow special grace by enhancing the renown of this sacred mountain, thereby glorifying the ancestral grounds of reverence and prayer, and perpetuating the nation’s boundless prosperity for myriad generations. This would be an incomparable fortune.\n\nThe臣 has carefully transcribed the three original imperial decrees of ennoblement for the Three Mao Perfected Lords and presents them herewith. As for the imperial edicts of exhortation bestowed upon the臣, he dares not presume to receive them at the capital but has already filed them in the public records of Jurong County, awaiting further instructions. He will then submit a memorial presenting the three imperial edicts of exhortation received previously and presently.\n\nThe臣, daring to offend celestial majesty, prostrates himself to await your decree.\n\nPresented on the ____ day of the second month by the Specially Bestowed Master of Cavernous Subtlety, Right Street Supervisor of Daoist Teachings, and Vacuous Luminance Retreat Scholar, the臣 Situ Shitan.\n\n---\n\n**Imperial Decree of Ennoblement**\n\n*Memorandum from the Ministry of Rites:*\nIn accordance with the edict issued on the twenty-seventh day of this month, the Chancellery proclaims: Within the Grotto-Heaven of Juqu, there reside perfected ones whose transformations are boundless and whose numinous efficacy is unfathomable. From the Qin and Han dynasties to the present, spanning over a thousand years, their blessings have flowed forth, benefiting the people. Yet their exalted names and honorific titles remain incomplete, which does not suffice to express the utmost sincerity of veneration.\n\nThe Lord of Great Mao of Mount Mao, currently titled *Taiyuan Perfected Person, Eastern Marchmount Supreme Minister, Director of Destinies*, shall be advanced to the title *Taiyuan Wondrous Dao Perfected Person, Eastern Marchmount Supreme Minister, Director of Destinies*. May this serve to guide harmonious qi, elicit auspicious responses, and assist in securing the nation’s boundless peace and prosperity.\n\nLet this decree be made known as appropriate. The memorandum is issued in accordance with the imperial edict as above.",
      "overlap_context": "nted. The sacrifices offered were solemn, and the prayers for high harvests were answered. Thus, during the reign of Emperor Renzu, the auspicious sign of a rainbow and lightning heralded the imperial heir; subsequently, imperial incense was sent, and the Golden Register was established. Emperor Gaozong repeatedly dispatched envoys to convey his earnest exhortations and ordered local officials to protect the site. From the Qiandao and Chunxi eras onward, the veneration has been even more devout.",
      "start_char": 2155,
      "end_char": 2808,
      "start_sentence": 81,
      "end_sentence": 100,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.394804000854492,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\三茅真君加封事典.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "牒至，准诏书故牒。 崇宁元年四月  日牒 中大夫守右丞温  押 中大夫守左丞陆  押 右银青光禄大夫守右仆射  押 左光禄大夫左仆射  押 中茅君今号定录真人，可进号定录冲静真人。 小茅君今号三官保命真人，可进号三官保命冲慧真人。 三月初一日再准。 内省公文 得旨宣谕高士，仰先次只领劝黄省割，不许再有辞兔，即具  谢奏回，所有加封真君，已降  指挥施行。 闰二月延庆  恭准 缴进　勃黄 辞免第三表 臣师坦言：今月初一日恭奉圣旨，今臣先次祇领黄省割，所有加封真君，已降　指挥施行者。 臣伏以避宠辞荣尚阀俞音之赐，师仙请号特蒙　温脖之颁，敢婵再渎之忱，期动　九重之听。 臣中谢。 切惟三峰森秀，三真分治职之区，九德茂隆，九锡显神灵之异。 泽既加於百邑，润旁浃於旱生。 况坛遗之戏祠，接江淮之重望，风清榆塞岂无助顺之机，雨灌稻田攸赖济时之力，宣於史笔，见之咏歌，受命登霄固何心於世爵，褒功着册爰尽敬於圣朝，申万世无疆之休，实千载难逢之会。 兹盖伏遇皇帝陛下全能三极，临统八弦，隐然道德之威，推此乾坤之造，怡神至教，法黄帝之斋心，重意名山，体仁皇之应运，乃卷太元之遗迹，愿增隆号以妥灵。 伏念臣戒守沽名，心怀报本，沥忠肝而有请，非伪计以求荣。 既蒙从欲之仁，将施典礼，傥复进街之录，恐速天诛。 臣敢不祗俟纶音，昭闻琳馆，谨宣明於圣意，祈申佑於丕基。 物得以成，当验五禾之熟，勇摄其武，用图四海之安。 所有臣前蒙赐高士鉴义道录黄共三道，具状缴进。 臣干冒天威，伏取　进止。 三月日特赐洞微先生右街鉴义主管教门公事虚白斋高士臣司徒师坦上表 奉　旨不允，不许再有辞兔。 申内省缴进状 具位司徒师坦。 今月初一日伏准　剖命传奉圣旨，仰先次祇领　黄省割，所有加封真君已降　指挥施行者。 右师坦前已具剖奏，乞圣恩收回宠命，加封真君。 恭候圣旨，缴进　牒。 仰被纶音，俯从愚请。 师坦切念茅君灵迹，愿力深重，历汉晋而至于今，千百余载，苍生蒙润而兵病不登，雨旸愆时则郡邑有请，祈求感格，如响应柠，鼎峙祠庭，实为治所。 迩日以来，观瞻习玩，香火寂寥，千古名山，堪为太息。 况近者烈风霪雨，边烽未清，师坦虽居畎亩之微，晨夕惶惧，盖爱君忧国之心无以自效，惟能精特一念，密叩三真，食息之问，未尝或息。 所藉仙真道力，助顺献祥，克佑丕图，为宗社灵长之福。 师坦自揆衰残，忝居福地，迭被宠渥，报蔑涓埃，异数疗加，岂容冒处。 幸荷　圣慈已回　恩命，褒宠仙真。 若不疗班循墙之请，则恐难逃罔上之讥，义合终辞，万死无悔。 谨将前后蒙赐师坦高士鉴义道录黄共三＇道，随状缴纳，欲乞台慈曲为敷奏，察师坦忠忱非娇妄求荣之意，收还劝命，特颁　明诏，锡封曰真。 行下所属，布告中外，于以彰圣君为民崇道之意，于以显三茅应世卫国之灵，于以保皇家亿万年无疆之休，不胜至愿。 谨具状申都知提举太尉，伏乞　闻奏，恭候　指挥施行。 谨状。 省剖二道，一付建康府，一付本山。 闰二月二十八日，奉圣旨已降指挥，三茅真君加封： 太元妙道冲虚真君束岳上卿司命神君可加封圣佑二字，",
      "translated_text": "Upon receipt of the memorandum, in accordance with the imperial edict, this document is hereby issued.\n\nIn the fourth month of the first year of the Chongning reign, the memorandum was sealed by:\n*Wen, Grand Master for Court Service and concurrently Right Vice Director, Guardian of the Right*\n*Lu, Grand Master for Court Service and concurrently Left Vice Director, Guardian of the Left*\n*Right Grand Master of the Silver and Blue Embroidered Silk, Guardian of the Right and concurrently Grand Councilor*\n*Left Grand Master of the Illustrious Embroidered Silk, Left Grand Councilor*\n\nThe Central Mao Lord, currently titled *Perfected Person of Destined Records*, shall be advanced to the title *Perfected Person of Destined Records and Serene Emptiness*. The Lesser Mao Lord, currently titled *Perfected Person of the Three Offices, Preserver of Destiny*, shall be advanced to the title *Perfected Person of the Three Offices, Preserver of Destiny and Subtle Wisdom*.\n\nOn the first day of the third month, a second memorandum was received. The Ministry of Rites’ official document stated: \"The imperial decree has been proclaimed to the eminent Daoist. It is commanded that he first accept the reduction of the *Yellow Register* rites, with no further refusal permitted. He shall promptly submit a memorial of gratitude in return. The bestowal of honorific titles upon the Perfected Lords has already been decreed and shall be implemented accordingly.\"\n\nIn the intercalary second month, *Yanqing* respectfully submitted the third memorial of refusal and decline:\n\n*Your servant, Shi Tan, humbly states:*\nOn the first day of this month, I reverently received the sacred decree, commanding that I first accept the reduction of the *Yellow Register* rites, and that the bestowal of honorific titles upon the Perfected Lords has already been decreed and shall be implemented.\n\nI, your servant, reflect that to decline honor and renounce glory is to await the grace of imperial favor, while for a Daoist master to request a title is to receive the benevolent bestowal of the throne. How dare I persist in my entreaties, hoping to move the imperial ear?\n\nI prostrate myself in gratitude.\n\nI humbly consider that the three peaks stand majestically verdant, each governed by one of the Three Perfected Lords, while the nine virtues flourish abundantly, and the nine bestowals manifest the divine singularity of the spirits. Their blessings extend to a hundred towns, and their beneficence permeates all living things. Moreover, the ancient altars of their legacy, adjacent to the Yangtze and Huai rivers, bear the weight of profound reverence. When the winds cleanse the frontier passes, is there not an opportunity to assist in the harmonious order? When rains nourish the rice fields, do we not rely upon their timely aid? These deeds are recorded in history and celebrated in song. To ascend to the heavens upon receiving such a mandate—how could I harbor any desire for worldly rank? To inscribe their merits in the imperial annals is to express the utmost reverence for the sacred court, to extend boundless blessings for ten thousand generations, and to mark an occasion rare in a thousand years.\n\nThis is all due to the grace of Your Imperial Majesty, who embodies the perfection of the Three Powers and governs the Eight Directions, whose moral authority is profound, and whose creation of heaven and earth is vast. You delight in the supreme teachings, following the Yellow Emperor’s practice of fasting in devotion; you revere the renowned mountains, emulating the sage-kings’ responsiveness to destiny. Thus, you have examined the legacy of the Great Mao Lords and wished to enhance their honorific titles to honor their spirits.\n\nI, your servant, have guarded my precepts and shunned fame, yet my heart remains devoted to repaying my origins. I have poured forth my loyal devotion in this plea, not seeking false glory. Now that I have received the benevolence of your assent, and the ritual bestowal is to be enacted, if I were to persist in further entreaties, I fear I would incur heavenly censure.\n\nHow dare I not await your sagely decree, making it known to the jade halls of the immortals? I shall reverently proclaim the imperial will and pray for the augmentation of your august foundation. When all things come to fruition, the five grains shall ripen; when martial valor is harnessed, the four seas shall be pacified.\n\nAll the *Yellow Registers* and *Daoist Records* previously bestowed upon me—three in total—are hereby respectfully returned with this memorial.\n\nI, your servant, have rashly trespassed against your celestial majesty and humbly await your decree.\n\nOn this day of the third month, *Shi Tan, Master of the Subtle Dao, Right Street Supervisor of Daoist Teachings, and Keeper of the Vacant Luminance Studio, Eminent Daoist of the Highest Rank*, respectfully submits this memorial.\n\nThe imperial decree was issued: \"Not permitted. No further refusal shall be allowed.\"\n\nMemorial submitted to the Ministry of Rites for return of documents:\n\n*Shi Tan, in my humble position, states:*\nOn the first day of this month, I reverently received the transmitted imperial decree, commanding that I first accept the reduction of the *Yellow Register* rites, and that the bestowal of honorific titles upon the Perfected Lords has already been decreed and shall be implemented.\n\nI, Shi Tan, have previously submitted a memorial, beseeching Your Sacred Majesty to revoke the gracious command and the bestowal of honorific titles upon the Perfected Lords. I reverently await the imperial decree and hereby return the *Yellow Register* documents.\n\nHaving received the sagely decree, I humbly comply with your humble servant’s request.\n\nI, Shi Tan, deeply reflect that the divine traces of the Mao Lords and their profound vows have endured from the Han and Jin dynasties to the present, spanning over a thousand years. The common people have received their beneficence, and neither war nor plague has arisen. When drought or excessive rain disrupts the seasons, the prefectures and counties make their pleas, and their prayers are answered as swiftly as an echo. Their altars stand like tripods in the temple courtyards, truly serving as the foundation of governance.\n\nIn recent days, however, the altars have fallen into neglect, their incense and offerings grown sparse. This ancient and renowned mountain is cause for sighing. Moreover, of late, fierce winds and torrential rains have afflicted the land, and the frontier beacons remain unsettled. Though I, Shi Tan, dwell in humble obscurity, I am filled with trepidation day and night. My love for the sovereign and concern for the nation leave me with no means of effectual service—only the ability to concentrate my singular devotion and secretly implore the Three Perfected Lords. In all my waking and resting moments, I have never ceased.\n\nI rely upon the divine power of the immortals to assist in harmonious order, present auspicious omens, and protect the grand enterprise, securing the enduring fortune of the imperial house.\n\nI, Shi Tan, am but a feeble and declining old man, unworthily dwelling in this blessed land. Repeatedly, I have received your abundant grace, yet my repayment is but a drop in the ocean. How could I presume to accept such extraordinary favor?\n\nFortunately, Your Sacred Majesty has already revoked the gracious command and bestowed honor upon the immortal lords. If I do not humbly comply with this decree, I fear I shall incur the reproach of deceiving the throne. It is my duty to persist in refusal, even at the cost of my life.\n\nI respectfully return the three *Daoist Records* and *Yellow Registers* previously bestowed upon me, along with this memorial. I beseech Your Majesty to graciously consider my plea, discerning that my loyalty is not a pretense for seeking undeserved honor, and to revoke the decree of bestowal. May a luminous edict be issued, conferring the title of *Perfected Lord* upon them. Let this be proclaimed to all relevant offices and announced throughout the realm, thereby manifesting the sagely ruler’s intent to honor the Dao for the people, revealing the Three Mao Lords’ responsiveness to the world and their protective power over the nation, and securing the imperial house’s boundless prosperity for a myriad of years. This is my utmost wish.\n\nRespectfully submitted to the *Du Zhi Ti Ju Tai Wei* for memorialization. I humbly await your decree for implementation.\n\nRespectfully submitted.\n\nTwo copies of the ministry’s document are enclosed: one for the Jiangning Prefecture, and one for the mountain itself.\n\nOn the twenty-eighth day of the intercalary second month, the imperial decree was issued, and the bestowal of titles upon the Three Mao Perfected Lords was decreed:\n\n*Taiyuan Wondrous Dao Perfected Person of Serene Emptiness, Eastern Marchmount Supreme Minister, Director of Destinies*, shall be further honored with the title *Sacred Protector*.",
      "overlap_context": "nt Mao, currently titled *Taiyuan Perfected Person, Eastern Marchmount Supreme Minister, Director of Destinies*, shall be advanced to the title *Taiyuan Wondrous Dao Perfected Person, Eastern Marchmount Supreme Minister, Director of Destinies*. May this serve to guide harmonious qi, elicit auspicious responses, and assist in securing the nation’s boundless peace and prosperity.\n\nLet this decree be made known as appropriate. The memorandum is issued in accordance with the imperial edict as above.",
      "start_char": 2808,
      "end_char": 4083,
      "start_sentence": 101,
      "end_sentence": 149,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.095157623291016,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\三茅真君加封事典.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "定录右禁至道冲静真君可加封德佑二字， 三官保命微妙冲慧真君可加封仁佑二字。 ． 右割付建康府，照应准此。 一付崇禧观。 淳佑九年三月日 缴省割申建康府状 茅山崇禧观：今月十五日，准枢密院、省剖二道，一付本观，一付使府照应，系闰二月二十八日恭奉圣旨特降指挥，加封本山三茅司命真君圣号事须至申缴者。 右具省割一道，随状缴申建康使府，伏乞照应行下管内道正司，告示在处官观庵院，各令通知，未敢专辄。 伏候钧旨。 淳佑九年三月日灵宝大师差茅山都道正知崇禧观管辖本山诸宫观叶晞彭状 再准内省宣谕公文，得旨宣谕高士降赐加封三茅真君省剖二道，请先次交管，仍具已交领　奏回。 三月日延庆恭准。 交领加封省割表 臣师坦上言：今月二十日准都提举都知太尉恭传圣旨宣谕。 已蒙圣恩加封三茅司命真君圣佑、德佑、仁佑六字圣号，颁到省剖二道，令臣先次交管，臣已即祇领内一道付崇禧观，布告本山诸宫观，咸使闻知。 外一道一面申纳使府。 臣上感圣恩，上感圣恩。 恭俟　命到山，即当捧香斋告，躬率阖山道众登峰醮告，仰祝圣寿，同赞皇图。 臣无任感天荷圣激切屏营之至。 臣惶惧惶惧，顿首顿首，谨先具表以　闻。 谨奏。 淳佑九年三月日",
      "translated_text": "The *Dinglu Right Prohibitions Supreme Dao Serene Emptiness Perfected Person* shall be further honored with the title *Virtue-Protector*. The *Three Officials Life-Securing Subtle Emptiness Perfected Person* shall be further honored with the title *Benevolence-Protector*.\n\nThe above is issued to Jiangning Prefecture for implementation accordingly. One copy is to be delivered to Chongxi Abbey.\n\nOn a day in the third month of the ninth year of Chunyou, the provincial document is returned to Jiangning Prefecture for memorialization.\n\n**Memorial from Maoshan Chongxi Abbey:**\nOn the fifteenth day of this month, we received two documents from the Privy Council and the Ministry, one for this abbey and one for the prefectural authorities, concerning the imperial decree issued on the twenty-eighth day of the intercalary second month, which bestowed additional honorific titles upon the Three Mao Perfected Lords of Destiny of this mountain. This matter requires submission and compliance.\n\nOne provincial document is hereby enclosed and returned to Jiangning Prefecture. We humbly request that it be forwarded to the local Daoist Rectification Bureau, with instructions to notify all official abbeys, temples, and hermitages under its jurisdiction, ensuring universal awareness. We dare not act without authorization and await your esteemed command.\n\nOn a day in the third month of the ninth year of Chunyou,\n*Master of the Numinous Treasure* (Lingbao Dashi), appointed *Chief Daoist Rectifier of Maoshan and Supervisor of Chongxi Abbey and all abbeys of this mountain*, Ye Xipeng, respectfully submits.\n\n**Further Memorial:**\nUpon receipt of the Inner Ministry’s proclamation, we received the imperial decree announcing the bestowal of additional titles upon the Three Mao Perfected Lords. Two provincial documents were issued, with instructions to first deliver them for custody, and to report their receipt upon completion.\n\nOn a day in the third month, we reverently complied.\n\n**Memorial on the Receipt of the Bestowed Provincial Documents for the Additional Titles:**\n\nYour servant, Shi Tan, respectfully declares:\nOn the twentieth day of this month, by command of the *Director of Destinies and Chief Commander* (Du Zhi Ti Ju Tai Wei), we received the imperial proclamation. By the grace of His Majesty, the Three Mao Perfected Lords of Destiny have been further honored with the six-character sacred titles: *Sacred Protector*, *Virtue-Protector*, and *Benevolence-Protector*. Two provincial documents were issued, with instructions for your servant to take custody of them first. I have reverently received one copy and delivered it to Chongxi Abbey, to be announced to all abbeys of this mountain for universal awareness. The other copy has been submitted to the prefectural authorities.\n\nYour servant is profoundly grateful for the imperial favor, profoundly grateful for the imperial favor.\n\nUpon the arrival of the sacred command at this mountain, I shall personally lead the entire mountain’s Daoist community in offering incense, holding purification rites, and ascending the peak to perform the jiao offering, reverently praying for the eternal longevity of His Majesty and the everlasting prosperity of the imperial realm.\n\nYour servant is overwhelmed with awe and gratitude, prostrate in reverence.\n\nWith utmost trepidation, I humbly submit this memorial for your august consideration.\n\nRespectfully submitted.\n\nOn a day in the third month of the ninth year of Chunyou.",
      "overlap_context": "tation.\n\nRespectfully submitted.\n\nTwo copies of the ministry’s document are enclosed: one for the Jiangning Prefecture, and one for the mountain itself.\n\nOn the twenty-eighth day of the intercalary second month, the imperial decree was issued, and the bestowal of titles upon the Three Mao Perfected Lords was decreed:\n\n*Taiyuan Wondrous Dao Perfected Person of Serene Emptiness, Eastern Marchmount Supreme Minister, Director of Destinies*, shall be further honored with the title *Sacred Protector*.",
      "start_char": 4083,
      "end_char": 4593,
      "start_sentence": 150,
      "end_sentence": 172,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.279183626174927,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\三茅真君加封事典.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "谢转道录表 臣师坦言：恭蒙圣恩颁降劝黄一道，特转臣左街道录、三管教门公事，臣屡具表控辞，再奉圣旨不许辞免，臣已遥望　阙庭祇受谢恩讫。 臣伏以大道无名，敢慕山中之相，小善必录，特升街左之班，实士论之至荣，岂平生之所望，固辞不获，闻命若惊。 中谢。 伏念臣识匪该明，才非宏远，分独甘岩穴之素，学不通古今之宜，志切辅时，忠怀报国。 晚际圣明之运，仰依日月之光，曾蔑功能，叨尘器使洪恩过宠，方忧福羽之轻，黄纸除书，又换头衔之重。 接清芬於虚静，踵前美於葆真，林野惊传，疑有华阳之故事，冠倨炼叹，谓联仙号之新辉。 义合终辞，惧膺显戮，勉瞻庭而肃受，殆据汉以难安。 兹盖伏遇皇帝陛下德被中和，化行清净，永奉三无之妙，克尽夤恭，允厘庶绩之熙，不遗纤芥，致令衰朽亦沐恩光。 臣敢不益励前修，自全末即。 既投簪未弃，盍加黑万岁之香，虽驽马已疲，宁敢负九重之眷。 臣无任感天荷圣激切屏营之至。 臣惶惧惶惧，顿首顿首，谨具表奏谢以闻。 谨奏。 淳佑九年三月日新特转左街道录洞微先生虚白斋高士主管教门公事臣司徒师坦上表 内省传到加封真君告三道及宣赐仪物公文，　得旨宣谕司徒高士，降去告命并设醮香茶等列具赐目，请具收领奏回。 三月日延庆恭准。 告勃三道",
      "translated_text": "Memorial of Gratitude for Promotion to Left-Street Daolu\n\nYour servant Shi Tan respectfully states: By the sacred grace of His Majesty, an edict of exhortation on yellow paper has been bestowed, specially promoting your servant to the office of Left-Street Daolu, charged with oversight of the Three Administrations of the Teachings. Though I have repeatedly submitted memorials to decline, the imperial command has twice forbidden my refusal. I have already reverently received the favor from afar, gazing toward the imperial court in gratitude.\n\nI humbly reflect: The Great Dao is nameless, yet how dare I covet the seclusion of mountain forests? Even small virtues are recorded, and I have been specially elevated to the ranks of the Left Street—an honor most esteemed by the scholarly world, yet never within the hopes of my humble life. Though I sought to decline, I could not, and upon hearing the command, I was struck with awe.\n\nWith profound gratitude, I bow in reverence.\n\nI recall that my knowledge is neither comprehensive nor enlightened, my talents neither vast nor far-reaching. By nature, I have been content with the simplicity of caves and grottoes, my learning insufficient to bridge the wisdom of past and present. Yet my aspirations have ever been to aid the times, my loyalty to repay the realm. In this late age of sagely brilliance, I have basked in the radiance of sun and moon. Though I possess no merit or ability, I have been undeservedly favored with the heavy trust of imperial office. Even as I feared the lightness of my own wings, the yellow-paper edict arrived, further increasing the weight of my title. I now follow the pure fragrance of emptiness and tranquility, treading in the footsteps of those who preserved authenticity. The news, spreading through the wilds, seemed like the tale of Huayang of old; the cap of office and the sighs of refinement spoke of a new splendor in the titles of immortals. Though duty compels me to decline no further, I fear the punishment that may come from such high rank. Reluctantly, I gaze toward the court and receive the command with solemnity, yet like one seated upon a mat of thorns, I find no ease.\n\nThis is all due to the virtue of Your Imperial Majesty, which suffuses harmony and balance, while your transformative influence flows in purity and stillness. You eternally uphold the wondrous mysteries of the Three Absences, fulfilling reverent devotion; you justly order the flourishing of all affairs, leaving not even the smallest detail unattended. Thus, even one as decrepit as I am bathed in the light of imperial grace.\n\nHow dare I not redouble my efforts to emulate the ancients and preserve what little remains of my integrity? Though I have not yet cast aside my official’s cap, I shall add incense to the censer of ten thousand years. Though this old horse is weary, how could I dare betray the favor of the Ninefold Throne?\n\nYour servant is overwhelmed with awe and gratitude, prostrate in reverence.\n\nWith utmost trepidation, I humbly submit this memorial of gratitude for your august consideration.\n\nRespectfully submitted.\n\nOn a day in the third month of the ninth year of Chunyou.\n\nNewly promoted Left-Street Daolu, Master of the Cavernous Subtleties, Master of the Vacant Luminosity Studio, Eminent Scholar charged with oversight of the Teachings, your servant Situ Shi Tan respectfully memorializes.\n\nThe Ministry of Rites has transmitted three edicts conferring the title of Perfected Lord, along with official documents bestowing ceremonial gifts. By imperial decree, the Eminent Scholar Situ is to be informed, and the edicts of investiture, along with the items for the jiao offering—incense, tea, and other bestowed articles—are to be delivered as listed. Please acknowledge receipt and memorialize in reply.\n\nOn a day in the third month, with reverent compliance by Yanqing. Three edicts enclosed.",
      "overlap_context": "e entire mountain’s Daoist community in offering incense, holding purification rites, and ascending the peak to perform the jiao offering, reverently praying for the eternal longevity of His Majesty and the everlasting prosperity of the imperial realm.\n\nYour servant is overwhelmed with awe and gratitude, prostrate in reverence.\n\nWith utmost trepidation, I humbly submit this memorial for your august consideration.\n\nRespectfully submitted.\n\nOn a day in the third month of the ninth year of Chunyou.",
      "start_char": 4593,
      "end_char": 5108,
      "start_sentence": 173,
      "end_sentence": 190,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.101757526397705,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\三茅真君加封事典.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "：朕闻真人驭风骑黑，神游八极之表，而一念在生灵，则犹数数然也。 ．太元妙道冲虚真君束岳上卿司命神君成道於茅山，登籍於仙府，三君之首者也，奇验见于历代，远近以为司命。 ．朕为黎元慕尚不已，特命有司亟衍喜号，以彰钦崇，可特封太元妙道冲虚圣佑真君束岳上卿司命神君。 ：朕闻句容三峰神君显甚二遂有金坛洞天之名，历代所慕尚，岂独於今乎。 定录右禁至道冲静真君修真得道，是谓中茅，雨旸应祷，远近德之。 亟命衍号，以答洪休，其体朕意，益阴隐于下民。 可特封定录右禁至道冲静德佑真君。 ：朕闻汉武帝祀神君於禁中，其祝甚秘，盖以缴福，朕不为也。 三官保命微妙仲慧真君，真风道黑，号小茅君，祈畎敬事，祭典褒崇，盖非一日矣。 兹命衍号，以昭朕拳拳慕尚之意，益闳尸施，以慧生灵。 可特封三官保命微妙冲慧仁佑真君。 奉劝如右，牒到奉行。 淳佑九年三月日。",
      "translated_text": "Decree:\nWe have heard that the Perfected Ones ride the wind and mount the dark, their spirits roaming beyond the Eight Extremities, yet with a single thought for the living, they remain ever present. The Supreme Prime Mysterious Dao, Tranquil Emptiness Perfected Lord, Eastern Marchmount Upper Minister, Director of Destinies Divine Lord attained the Dao at Mount Mao, was registered in the Immortal Bureau, and stands foremost among the Three Lords. His wondrous efficacy has been manifest through successive dynasties, and near and far he is revered as the Director of Destinies.\n\nOut of Our ceaseless admiration for the common people, We specially command the relevant offices to bestow upon him an exalted title, thereby manifesting Our reverence. Let him be specially enfeoffed as the Supreme Prime Mysterious Dao, Tranquil Emptiness, Sagely Protection Perfected Lord, Eastern Marchmount Upper Minister, Director of Destinies Divine Lord.\n\nDecree:\nWe have heard that the Divine Lords of the Three Peaks of Jurong are most illustrious, and for this reason, the Golden Altar Grotto-Heaven bears its name—an object of admiration through the ages, not merely in Our time. The Register-Fixed, Right-Forbidden, Supreme Dao, Tranquil Stillness Perfected Lord cultivated the Dao and attained realization, known as the Central Mao. His responses to prayers for rain and sunshine have been efficacious, and near and far he is held in virtue.\n\nWe urgently command the bestowal of an exalted title to reciprocate these great blessings. Let him embody Our intent and further conceal his hidden efficacy among the people. Let him be specially enfeoffed as the Register-Fixed, Right-Forbidden, Supreme Dao, Tranquil Stillness, Virtue-Protection Perfected Lord.\n\nDecree:\nWe have heard that Emperor Wu of Han sacrificed to the Divine Lord in the forbidden precincts, his invocations most secret, for the purpose of seeking blessings. We do not act thus. The Three Officials, Life-Preserving, Subtle and Wondrous, Balanced Wisdom Perfected Lord, whose true wind and Dao are profound, is styled the Lesser Mao Lord. His reverent service in prayers and sacrifices has been honored in ritual for no short time.\n\nWe now command the bestowal of an exalted title to manifest Our earnest admiration, further expanding his beneficent influence to enlighten the living. Let him be specially enfeoffed as the Three Officials, Life-Preserving, Subtle and Wondrous, Balanced Wisdom, Benevolent Protection Perfected Lord.\n\nThe above decrees are hereby issued. Upon receipt of this document, act accordingly.\n\nA day in the third month of the ninth year of Chunyou.",
      "overlap_context": "e Ministry of Rites has transmitted three edicts conferring the title of Perfected Lord, along with official documents bestowing ceremonial gifts. By imperial decree, the Eminent Scholar Situ is to be informed, and the edicts of investiture, along with the items for the jiao offering—incense, tea, and other bestowed articles—are to be delivered as listed. Please acknowledge receipt and memorialize in reply.\n\nOn a day in the third month, with reverent compliance by Yanqing. Three edicts enclosed.",
      "start_char": 5108,
      "end_char": 5474,
      "start_sentence": 191,
      "end_sentence": 203,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.982301950454712,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\三茅真君加封事典.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "太傅左丞相魏国公清之　右丞相葵 参知政事方叔　参知政事侮 兼权给事中壮父　兼权中书舍人 三月十五日午时都事赵焕受 兵部郎中兼左司饶　　　付吏部 太傅左丞相魏国公清之　右丞相葵 参知政事方叔　　参知政事僻 吏部尚书阙　　　权兵部尚书清叟 吏部侍郎阙　　　起居兼权口 主事赵颖叔　令史金必过　令史傅汝霖 郎中　主管院 淳佑九年三月十五日下 赐仪物 沉香描金如意一事，系降真香柄黄罗袋，黑漆匣盛，锁钥全锡，献　大茅君像。 秉执玉圭二面，红销金袋各小朱红匣盛，外大朱红匣护，锁钥全锡，献中茅君。 小茅君秉执织天尊绿锦磨二首，各长二丈。 威仪一十四事 节一对五层，系五色线绦铺造。",
      "translated_text": "The Grand Tutor, Left Chancellor, and Duke of Wei Qingzhi; the Right Chancellor Kui; Participant in Determining Government Affairs Fang Shu; Participant in Determining Government Affairs Pi; concurrently Acting Supervisor of the Gate of Petitions Zhuangfu; concurrently Acting Supervisor of the Secretariat—on the fifteenth day of the third month at the hour of noon, Director of General Affairs Zhao Huan received the document. The Minister of War concurrently Left Director Rao was entrusted with its transmission to the Ministry of Personnel.\n\nThe Grand Tutor, Left Chancellor, and Duke of Wei Qingzhi; the Right Chancellor Kui; Participant in Determining Government Affairs Fang Shu; Participant in Determining Government Affairs Pi; the vacant post of Minister of Personnel; concurrently Acting Minister of War Qingsou; the vacant post of Vice Minister of Personnel; concurrently Acting Supervisor of the Imperial Diary; Director Zhao Yingshu; Clerk Jin Biguo; Clerk Fu Rulin; Director of the Bureau—responsible for the administration of the institute.\n\nIssued on the fifteenth day of the third month of the ninth year of Chunyou.\n\nBestowed ceremonial items:\nOne carved and gilded ruyi scepter of aloeswood, with a handle of descending-true incense, encased in a yellow silk bag, stored in a black lacquered box with complete lock and tin key—presented to the Great Mao Lord.\nTwo jade tablets, each encased in a red brocade bag, further enclosed in small vermilion lacquered boxes, with outer vermilion lacquered boxes for protection, complete with lock and tin key—presented to the Middle Mao Lord.\nTwo woven brocade images of the Heavenly Venerable, each twenty feet in length, held by the Lesser Mao Lord.\nFourteen items of ritual regalia.\nOne pair of five-tiered standards, adorned with five-colored silk ribbons.",
      "overlap_context": " sacrifices has been honored in ritual for no short time.\n\nWe now command the bestowal of an exalted title to manifest Our earnest admiration, further expanding his beneficent influence to enlighten the living. Let him be specially enfeoffed as the Three Officials, Life-Preserving, Subtle and Wondrous, Balanced Wisdom, Benevolent Protection Perfected Lord.\n\nThe above decrees are hereby issued. Upon receipt of this document, act accordingly.\n\nA day in the third month of the ninth year of Chunyou.",
      "start_char": 5475,
      "end_char": 5791,
      "start_sentence": 204,
      "end_sentence": 221,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.746944904327393,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\三茅真君加封事典.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "每层有铜管铜盖子各一个，上有六角宝盖龙头衔销金彩婶六首，旖脚有铜铃儿，每一节八十四个，龙头朱红干子，下有铜筵。 幢一对，系珠子结络。 幢身问彩销金罗带三条，上有六角宝盖龙头衔销金彩磨六首，婶带各有铜铃子，每一幢九十三个，龙头．朱红干子，下有铜钟。 旌一对四层，每层系五彩销金带各十五条，问彩销金结带各六条，铜铃子各三百四十三个，系宝珠头朱红干，下铜筵。 磨一对，系红锦造。 婶身上各有玉佩一副，各六事件，珠子五串，下各有坠子二颗，上有六角宝盖龙头，各衔销金杂色小婶子六首，各有铜铃子九十八个，系凤头朱红干，下铜筵。 五明扇一对，系素粉描金书鹤翅。 各有销金罗帛寿带两条，各有铜铃子六个，朱红干，下铜继。 羽扇一对，系素粉描金。 各有销金罗彩寿带二条，朱红木干，下铜掖。 如意一对，系描金彩色装画。 罩护威仪黄绢袋一十二个。 盛威仪朱红木匣一只，二隔，锁钥全。 威仪黑漆立架二座。 沉香五两、脑子五两、新茶五十片、银一百两。",
      "translated_text": "Each tier is fitted with one copper tube and one copper lid, atop which sits a hexagonal jeweled canopy with six dragon-head finials holding gilded and colored streamers, and at the base of the tiered finials are copper bells—eighty-four per tier. The dragon-head finials are painted with red cinnabar, and the base is fitted with a copper ferrule.\n\nA pair of banners, adorned with beaded netting. The banner shafts are wrapped with three gilded and colored silk ribbons, each bearing a hexagonal jeweled canopy with dragon-head finials holding six gilded and colored silk streamers. Each streamer is fitted with copper bells—ninety-three per banner. The dragon-head finials are painted with red cinnabar, and the base is fitted with a copper bell.\n\nA pair of four-tiered pennants, each tier adorned with fifteen gilded and five-colored ribbons and six gilded and colored knotted ribbons. Each pennant is fitted with three hundred forty-three copper bells, topped with a jeweled finial on a red cinnabar staff, and the base is fitted with a copper ferrule.\n\nA pair of ceremonial fans, made of red brocade. Each fan is adorned with a set of jade pendants—six pieces per set—five strands of pearls, and two tassels at the base. Atop each fan is a hexagonal jeweled canopy with dragon-head finials holding six small gilded and multicolored streamers, each fitted with ninety-eight copper bells. The finials are phoenix-head shaped, painted with red cinnabar, and the base is fitted with a copper ferrule.\n\nA pair of five-light fans, made of plain silk with gilded crane-wing designs. Each fan is adorned with two gilded silk longevity ribbons, fitted with six copper bells, mounted on red cinnabar staffs, and the base is fitted with a copper ferrule.\n\nA pair of feather fans, made of plain silk with gilded designs. Each fan is adorned with two gilded and colored silk longevity ribbons, mounted on red cinnabar wooden staffs, and the base is fitted with a copper ferrule.\n\nA pair of ruyi scepters, decorated with gilded and colored designs.\n\nTwelve yellow silk bags for covering the ritual regalia.\n\nOne vermilion wooden box, divided into two compartments, with complete lock and key, for storing the ritual regalia.\n\nTwo black lacquered standing racks for the ritual regalia.\n\nFive taels of aloeswood, five taels of borneol, fifty pieces of new tea, and one hundred taels of silver.",
      "overlap_context": "complete lock and tin key—presented to the Great Mao Lord.\nTwo jade tablets, each encased in a red brocade bag, further enclosed in small vermilion lacquered boxes, with outer vermilion lacquered boxes for protection, complete with lock and tin key—presented to the Middle Mao Lord.\nTwo woven brocade images of the Heavenly Venerable, each twenty feet in length, held by the Lesser Mao Lord.\nFourteen items of ritual regalia.\nOne pair of five-tiered standards, adorned with five-colored silk ribbons.",
      "start_char": 5791,
      "end_char": 6218,
      "start_sentence": 222,
      "end_sentence": 236,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.994422197341919,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\三茅真君加封事典.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "四月二十三日甲子，集诸山市民恭迎告，昭告三峰，时值连日风雨，二十二日，高士登坛上，急奏章借晴。 次早五更呜鼓集众，宿雨即止，霁色开明，躬率本山诸宫观主首道众、庵寮道人，同镇市士庶父老，出山祇迎亭，卓香花婶幢、旌旗锣鼓，铙钹清乐、仙仗仪从，及本山常宁镇官领兵率旗队金鼓卫护约千余人，远近山居来观者如堵。 是日天气清和，祥烟如画，仙鹤呜於晴空，白兔现於峰顶。 先迎告劝至崇禧观门，高士率诸山主首道俗望阙谢恩，欢呼万岁，次登大茅峰奉行典礼，宣扬告命，敷献宝器。 次登中茅峰、小芽峰，仪献如前。 大峰祝文 维大宋淳佑九年岁次己酉四月壬寅朔二十三日甲子，新特转左街道录洞微先生虚白斋高士主管教门公事臣司徒师坦谨稽首顿首再拜言：臣闻妙道隐乎无名，强而日大。 真仙贵在翳迹，岂俟表光。 欲草心注向於空同，故一时动耀於视听。",
      "translated_text": "On the twenty-third day of the fourth month, the *jiazi* day of the sexagenary cycle, Daoist masters and townsfolk from the various mountains gathered to reverently welcome the imperial proclamation. The ritual was to be announced at the Three Peaks, but continuous wind and rain had persisted. On the twenty-second day, the *gaoshi* ascended the altar and urgently submitted a memorial to borrow fair weather. By the fifth watch the next morning, drums were sounded to assemble the crowd, and the overnight rain ceased. The sky cleared, revealing bright daylight. The *gaoshi* personally led the abbots and senior Daoists from the mountain’s temples and hermitages, along with the elders and common folk of the town, to the Welcoming Pavilion outside the mountain. There, they set up incense burners, floral canopies, banners, flags, gongs, drums, cymbals, and ceremonial music. The procession included the ritual regalia and attendants, as well as officials from Changning Town of the mountain, who led soldiers with banners, drums, and an escort of over a thousand men. Spectators from near and far gathered like a wall. That day, the weather was clear and mild, auspicious mist swirled like a painting, cranes cried in the clear sky, and a white hare appeared atop the peak.\n\nThe proclamation was first welcomed to the gate of Chongxi Abbey. The *gaoshi*, leading the abbots and senior Daoists from the various mountains, along with the laity, faced the imperial palace to express gratitude. Cheers of \"Long live the Emperor!\" resounded. They then ascended Great Mao Peak to perform the rites, proclaiming the imperial mandate and presenting the sacred vessels. They proceeded to Middle Mao Peak and Small Mao Peak, where the rituals were conducted as before.\n\n**Prayer for Great Peak**\n\nIn the ninth year of the *Chunyou* reign of the Great Song, the *jiyou* year of the sexagenary cycle, on the twenty-third day of the fourth month—the *jiazi* day of the *renyin* new moon—the newly appointed *Zuojie Daolu* of the Left Street, Master of the Cave Mystery, *Xubai Zhai Gaoshi*, Administrator of Daoist Affairs, Minister Situ Shitan, respectfully bows his head, prostrates, and speaks:\n\nI have heard that the wondrous Dao is concealed in namelessness, yet by force of will it is called great. True immortals treasure obscurity; why should they seek to display their radiance? Yet to turn the heart toward the vast emptiness, one must for a time stir the senses with brilliance.",
      "overlap_context": "ns, mounted on red cinnabar wooden staffs, and the base is fitted with a copper ferrule.\n\nA pair of ruyi scepters, decorated with gilded and colored designs.\n\nTwelve yellow silk bags for covering the ritual regalia.\n\nOne vermilion wooden box, divided into two compartments, with complete lock and key, for storing the ritual regalia.\n\nTwo black lacquered standing racks for the ritual regalia.\n\nFive taels of aloeswood, five taels of borneol, fifty pieces of new tea, and one hundred taels of silver.",
      "start_char": 6219,
      "end_char": 6574,
      "start_sentence": 237,
      "end_sentence": 245,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.4224693775177,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\三茅真君加封事典.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "宜膺明诏，特进徽称，举希阔之盛仪，实缉熙之巨典。 恭惟太元妙道冲虚圣佑真君束岳上卿司命神君，职专昊越，师综山川，按句曲之上峰为校录之治所，泽加庶物，德及兆民，镂紫玉，刻黄金，辉华九锡，摇绿旌，簇绣羽，招驱万灵。 虽仙号之已崇，恐朝封之未称，今陛下储思道妙，迈德帝先，仰承列圣之心，爰险名山之杞，既为民而请福，乃即事以表功，焕烂褒书，发扬丕既。 谓圣者彰九德之既备，日佑者显万生以蒙慈。 彩鸾衔劝以来仪，白鹄翔空而下览，人天欣泽，山岳辉荣。 恭陆灵峰，敷陈君命，所祈福利，仰奉明朝。 伏愿陛下宝历延洪，萝图纂庆，干戈永戢，时臻於变之风，稼穑屡丰，民被华胥之乐。 而后修真至士，奉道高贤，咸跻上善之因，共享长生之福。 臣无任激切之至，谨稽首再拜，谨言。 二峰祝文同前至 恭惟定录右禁至道冲静德佑真君，挺资冲漠，备德神灵，受命紫素之文，留治清虚之府，管弦流响，身逸宴於洞台，风雨以时，泽既沾於民物。 中监上仙之任，右禁有为之功，虽天号之已崇，恐朝封之未称，令皇帝储思道甲妙，迈德帝先，仰承列．’圣乏心，爰险名山之祀。 既为民而请福，乃即事以表功，焕烂褒书，发扬丕既，彰明德之旁溢，显灵佑之外，闻。 、彩鸾衔以来仪，f 白鹤翔空而下鉴，．天人欣泽，山岳辉荣。 恭陆灵峰，敷陈君命。 云云同前。 三峰祝文同前至 恭惟三官保命微妙冲慧仁佑真君，标才明颖，挺业该清，典藏录於玉浆，爰受封於金阙，、道着万物，仁者怀文，域断六天，位尊保命。 书共膺於紫素，治兼莅於良常，虽仙号之已崇，恐朝封之未称，今皇帝储思道妙，迈德帝先，仰承列圣之心，爰险名山之祀。 既为民而请福，乃即事以表功，焕烂褒书，发扬丕肌，具举崇真之礼，克彰障祉之灵。 内法既融，外教以平，皆仁之至，暴害不行，苍生蒙润，非佑而何。 近白鹤之翔空，受彩鸾之献劝，天人欣泽云云同前。 三茅真君加封事典卷上竟 三茅真君加封事典卷下",
      "translated_text": "May you worthily receive the luminous decree, be specially promoted with illustrious titles, and uphold the grand rites of rare splendor—truly a great ceremony of radiant continuity.\n\nWe reverently invoke the **Supreme Primordial Dao, Profoundly Empty and Sagely Protector True Lord**, **Eastern Peak Supreme Minister and Controller of Destiny Divine Lord**: your office governs the vast heavens, your teachings unify mountains and rivers. At the summit of Mount Juqu, you establish your administrative seat for celestial record-keeping. Your blessings extend to all things, your virtue reaches the multitudes. You engrave purple jade, inscribe golden tablets, your brilliance outshines the Nine Bestowals. Your green banners flutter, your embroidered plumes gather, summoning and commanding the ten thousand spirits. Though your immortal titles are already exalted, we fear the court’s honors may yet fall short. Now His Majesty, treasuring thoughts of the wondrous Dao and surpassing the virtue of former emperors, reverently inherits the will of the sagely ancestors and dares to offer sacrifices upon perilous, famed mountains. Having prayed for blessings on behalf of the people, he now performs these rites to manifest your merit—resplendent eulogies, grandly proclaimed. Thus the sagely one reveals the fullness of the Nine Virtues, and the daily protector displays mercy to all living beings. Rainbow phoenixes bear invitations in their beaks, white cranes soar through the sky to witness below. Heaven and humanity rejoice in your grace; mountains and peaks glow with honor.\n\nWe reverently ascend the sacred peak to proclaim the imperial mandate. The blessings we seek are humbly offered for the radiant court.\n\nWe pray that His Majesty’s precious reign may extend in grandeur, that the sacred succession may be crowned with felicity, that weapons of war be forever sheathed, and that the winds of transformation may prevail in due season. May the harvests be ever abundant, and the people enjoy the joys of *Huaxu*. Thereafter, may those who cultivate truth and the loftiest Daoist adepts all ascend to the causes of supreme goodness and together partake in the blessings of long life.\n\nThis minister, overwhelmed with deepest reverence, respectfully bows his head, prostrates, and speaks.\n\n---\n\n**Prayer for the Second Peak**\n\n[Text identical to the preceding until:]\nWe reverently invoke the **Recorder of Destinies, Right Custodian of the Forbidden, Profoundly Serene and Virtue-Protector True Lord**: born of the primordial void, endowed with divine virtue, you received your mandate in the script of purple and white, and govern from the Palace of Pure Emptiness. The strains of lutes and pipes flow forth, your person delights in the feasts of the Jasper Terrace. Wind and rain arrive in their seasons; your blessings already suffuse the people and all things. Charged with overseeing the tasks of the upper immortals and the achievements of the Right Forbiddance, though your celestial titles are already exalted, we fear the court’s honors may yet fall short. Now the Emperor, treasuring thoughts of the wondrous Dao and surpassing the virtue of former emperors, reverently inherits the will of the sagely ancestors and dares to offer sacrifices upon perilous, famed mountains. Having prayed for blessings on behalf of the people, he now performs these rites to manifest your merit—resplendent eulogies, grandly proclaimed. Your illustrious virtue overflows in all directions; your divine protection is manifest beyond measure. Rainbow phoenixes bear invitations in their beaks, white cranes soar through the sky to witness below. Heaven and humanity rejoice in your grace; mountains and peaks glow with honor.\n\nWe reverently ascend the sacred peak to proclaim the imperial mandate. [Remainder identical to the preceding.]\n\n---\n\n**Prayer for the Third Peak**\n\n[Text identical to the preceding until:]\nWe reverently invoke the **Three Officials, Life-Preserving, Subtly Wondrous, Profoundly Wise and Benevolence-Protector True Lord**: marked by brilliant talent and outstanding purity, your deeds encompass all that is pure. You oversee the records in the Jade Nectar archives and received your investiture at the Golden Portal. The Dao flourishes in all things; the benevolent embrace culture. Your domain extends across the Six Heavens; your position is exalted as the Preserver of Life. Your decrees are jointly received in the script of purple and white; your governance extends to the Eternal Realm. Though your immortal titles are already exalted, we fear the court’s honors may yet fall short. Now the Emperor, treasuring thoughts of the wondrous Dao and surpassing the virtue of former emperors, reverently inherits the will of the sagely ancestors and dares to offer sacrifices upon perilous, famed mountains. Having prayed for blessings on behalf of the people, he now performs these rites to manifest your merit—resplendent eulogies, grandly proclaimed. The rites of venerating the true are fully observed, perfectly revealing the numinous blessings of protection. The inner teachings are harmonized; the outer doctrines are pacified. Such is the perfection of benevolence—violence and harm do not arise. The black-haired people receive your moisture; what is this if not protection? White cranes soar through the sky nearby, receiving the rainbow phoenixes’ offered invitations. Heaven and humanity rejoice in your grace... [Remainder identical to the preceding.]\n\n**Concluding the First Scroll of the Rites for the Ennoblement of the Three Mao Lords**\n**Beginning the Second Scroll of the Rites for the Ennoblement of the Three Mao Lords**",
      "overlap_context": "e newly appointed *Zuojie Daolu* of the Left Street, Master of the Cave Mystery, *Xubai Zhai Gaoshi*, Administrator of Daoist Affairs, Minister Situ Shitan, respectfully bows his head, prostrates, and speaks:\n\nI have heard that the wondrous Dao is concealed in namelessness, yet by force of will it is called great. True immortals treasure obscurity; why should they seek to display their radiance? Yet to turn the heart toward the vast emptiness, one must for a time stir the senses with brilliance.",
      "start_char": 6574,
      "end_char": 7355,
      "start_sentence": 246,
      "end_sentence": 269,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.5989990234375,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\三茅真君加封事典.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "进封三茅真君圣号庆礼醮科仪 仪式如常至启圣： 臣闻天佑皇家，保万邦之黎献，国崇典礼，褊草望之山川。 靡神不宗，诸福毕至。 卷真仙之治所，耸句曲之名峰，药馆芝庭素严於祀事，飓轮钦驾时格於· 灵终。 兹逢明圣之朝，具举缉熙之典，肆颁纶诏，式进徽称，劝太卜以涓辰，命有司而具礼。 玉兰清润，伫笙鹤之凌空，洞草晶辉，近箫鸾之簇仗。 臣等钦承宸命，只告真灵，斋意青词，谨当宣奏。 宣词 谛陈词旨，备见至怀，渊听至聪，必蒙鉴省。 臣闻阴德万生，温密静神於玉室，躬备九德，辉华刻简於丹琼。 绣羽斑舆，浮空蹑景，绿旌紫节，封山召云，因下戏於赤城，时按临於玉洞。 圣主仰天心之爱，宴私披地肺之图，爰举徽章，式褒显迹，备成熙事，嘉荐芬芳，明德惟馨，至诚不息，以今某朝行道，请法众等运兹初捻上香，愿此香烟，腾空供养太元妙道冲虚圣佑真应真君束岳上卿司命神君太元府得道高真，愿以是道力，上祝皇帝圣寿无疆。 伏愿真终临格，昭鉴居饮，瑞应流光，允副九天之眷，应洪啧祉，永言万寿之期，致喜靖於四方，俾交欣於百乐。 臣闻金光藏景，同游浩洞之天，紫素敷文，以表神明之德。 载扬显册，益荐崇称，被灵宇以伸虔，集仙僚而交庆。 以今某朝行道，请法众等运兹二捻上香，愿此香烟，腾空供养定录右禁至道冲静德佑妙应真君定录府得道高仙，愿以是道力，上祝皇后，伏愿功铭锺鼎，德迈河沙，益隆不拔之丕基，永保无疆之大历，神祇祖考来燕以来宁，社稷宗桃以安而以永，椒房福庆，仪形万邦，玉叶蕃昌，本支百世。 臣闻总括岱宗，任上府神宫之邃，掌封金录，植龙芝洞草之珍，仁怀其文，勇摄其武，九陛饬褒崇之典，草心怀庆忏之诚，敬肃兰场，恭陈藻供。 以今某朝行道，请法众等运兹三捻上香，愿此香烟，腾空供养三官保命微妙冲慧仁佑神应真君保命府得道真仙，愿以是道力导迎景既，敷锡庶民，兵病不登，雨旸时若，三光全而寒暑节，五谷熟而草木蕃，育万物以皆昌，无一夫之失所，吉无不利，动则皆成。 大谢 臣等栖身福地，被教真仙，窥琅岌之秘文，典玉郎之上道，忝恭祈祷，仰赖感通。 误膺世爵之颁，敢负师恩之重，恭承明诏，驰进褒书，辄膺庆赞之诚，丕阐灵承之义，庶伸忱捆，上答嘉休。 今皇帝俯眷名山，仰崇真佑，纶温六字，焕美号以增隆，贲三峰，霭御炉之清馥，式严褥礼，祇荐鸿名，情见乎辞，仪多在物。 臣等奉宣密旨，延款高真，必冀鉴故，式符愿望，寿齐箕翼，泽被华夷，六宫交梦於态熊，四鄙荡平於蛇豕，匈奴款塞，无烦汉使之通，多士在庭，重见周官之盛，社稷衍灵长之庆，春秋书大有之年。 旁及飞港，俱全性命。 上以表三真之慈悯，下以副皇帝之虔诚。",
      "translated_text": "**Rites for the Celebratory Offering of the Ennobled Sacred Titles of the Three Mao Lords**\n\nThe ritual proceeds as customary until the Invocation of the Sages:\n\nWe have heard that Heaven blesses the imperial house, safeguarding the myriad states’ black-haired people, and that the state exalts its rites, honoring the mountains and rivers of the four directions. No spirit is left unvenerated; all blessings arrive in full.\n\nRolling up the abode of the perfected immortals, the famed peaks of Mount Juqu rise in majesty. The halls of medicine and courtyards of lingzhi are ever solemn in their sacrifices; the wheels of the august chariot and the revered carriage arrive in timely response to the numinous end. Now, in this enlightened and sagely reign, we perform the rites of luminous harmony in full. Edicts are issued in abundance; illustrious titles are bestowed. The Grand Diviner is charged to select an auspicious day; the officials are commanded to prepare the rites. Jade orchids glisten with purity, awaiting the ascent of sheng pipes and cranes; the radiant grasses of the grottoes gleam, as flutes and phoenixes gather in formation.\n\nWe, your servants, reverently receive the imperial mandate and humbly address the true numina. With minds purified and blue petitions prepared, we now solemnly proclaim the invocation.\n\n**Invocation**\n\nThe intent of these words is set forth in full, revealing our utmost devotion. May your profound hearing and supreme wisdom deign to heed and reflect upon them.\n\nWe have heard that the hidden virtue of the ten thousand beings warms, stills, and tranquilizes the spirits within the jade chambers; that the Nine Virtues are embodied in full, their radiance inscribed upon cinnabar and quartz. Brocade-feathered palanquins float through the void, treading upon the light; green banners and purple standards seal the mountains and summon the clouds. Descending to sport upon the Red City, they now alight upon the Jade Grotto.\n\nThe sagely sovereign, gazing upon Heaven’s loving heart, privately unfurls the map of Earth’s depths. Thus, illustrious titles are bestowed, and wondrous traces are exalted. The rites of luminous harmony are perfected; fragrant offerings are presented in abundance. Illustrious virtue is ever fragrant; utmost sincerity knows no end. Today, on this [day] of the [month], as the Dao is practiced, we, the assembled ritualists, now offer the first pinch of incense. May this fragrant smoke ascend to serve the **Primordial Mystery Dao, Tranquil and Vacuous, Sagely Protector, True and Responsive Perfected Lord; Supreme Minister of the Eastern Marchmount, Controller of Destinies; High Perfected of the Primordial Mansion**. Through the power of this Dao, we pray for the emperor’s sacred longevity without end.\n\nWe humbly beseech that the true end may descend in response, manifesting its luminous regard. May auspicious radiance flow forth, truly fulfilling the favor of the Nine Heavens. May vast blessings be bestowed, and the era of ten thousand years of life be eternally proclaimed. May joy and tranquility extend to the four quarters, and may all things rejoice in harmony.\n\nWe have heard that golden light conceals the luminous, journeying together through the vast caverns of Heaven; that purple silk unfurls its patterns to display the virtue of the divine and bright. Now, the manifest register is proclaimed anew, further exalting the honored titles. Clothed in the numinous precincts with reverence, may the assembled immortals rejoice together.\n\nToday, on this [day] of the [month], as the Dao is practiced, we, the assembled ritualists, now offer the second pinch of incense. May this fragrant smoke ascend to serve the **Recorder of Destinies, Rightward Guardian of the Most Perfect Dao, Tranquil and Virtuous, Wondrously Responsive Perfected Lord; High Immortal of the Mansion of Destinies**. Through the power of this Dao, we pray for the empress. May her achievements be inscribed upon tripods and bells, her virtue surpassing the sands of the rivers. May her great and unshakable foundation be ever exalted; may her boundless and grand reign be eternally preserved. May the spirits and ancestral forebears come to feast and bring peace; may the altars of soil and grain and the ancestral shrines be secure and enduring. May the palace of pepper blossoms be blessed with felicity, its demeanor a model for the myriad states. May the jade branches flourish; may the root and branches endure for a hundred generations.\n\nWe have heard that the Lord of Mount Tai encompasses all, presiding over the profound depths of the divine palaces of the Upper Mansion; that he holds the golden register of seals and plants the precious dragon lingzhi and grotto grasses. His civil virtue is imbued with benevolence; his martial prowess is awe-inspiring. The Nine Steps are adorned with rites of exaltation; the hearts of the people cherish the sincerity of repentance and rejoicing. With reverence, we purify the orchid precincts and humbly present the aquatic offerings.\n\nToday, on this [day] of the [month], as the Dao is practiced, we, the assembled ritualists, now offer the third pinch of incense. May this fragrant smoke ascend to serve the **Three Officials, Protectors of Life, Subtly Wondrous, Tranquilly Wise, Benevolently Protective, Spiritually Responsive Perfected Lords; True Immortals of the Mansion of Life Protection**. Through the power of this Dao, may they guide and welcome the luminous sun, bestowing blessings upon the common people. May weapons and illness not arise; may rain and sunshine arrive in due season. May the Three Luminaries remain whole, and cold and heat be regulated; may the Five Grains ripen, and grasses and trees flourish. May the ten thousand things be nurtured and all prosper; may not a single person be left without shelter. May all be auspicious and without misfortune; may every action be accomplished.\n\n**Great Thanksgiving**\n\nWe, your servants, dwell in blessed lands and receive the teachings of the true immortals. We have glimpsed the secret texts of the towering peaks and been entrusted with the supreme Dao of the Jade Youths. Humbly charged with prayers and supplications, we rely upon the power of spiritual resonance.\n\nUnworthy though we are to receive the bestowal of worldly rank, how dare we betray the weight of our masters’ grace? Reverently receiving the enlightened edict, we hasten to present the register of exaltation. With hearts full of celebratory reverence, we greatly expound the meaning of the numinous response, striving to express our sincerest devotion and repay the abundant blessings.\n\nNow, the emperor deigns to regard the famed mountains and reverently honor the true protectors. The edict, warm with six characters, gloriously enhances the illustrious titles; the three peaks, adorned with imperial splendor, are suffused with the pure fragrance of the imperial censer. The rites are solemnly prepared; the grand names are reverently offered. Our sentiments are expressed in words; our reverence is manifest in the ritual objects.\n\nWe, your servants, have received and proclaimed the secret decree, extending our welcome to the exalted perfected. We earnestly hope that you will deign to regard our intent and fulfill our wishes. May the emperor’s life span equal that of the Eastern Dipper and Weaver Maid; may his blessings extend to the Chinese and the barbarians alike. May the six palaces dream of propitious omens; may the four frontiers be pacified of serpents and boars. May the Xiongnu submit at the frontier passes, sparing the need for Han envoys; may the many officials fill the courts, restoring the grandeur of the Zhou dynasty. May the altars of soil and grain enjoy enduring blessings; may the spring and autumn records proclaim years of great abundance.\n\nMay all beings, even those in flight or afloat, preserve their lives in full.\n\nAbove, may this manifest the compassion of the Three Perfected; below, may it accord with the emperor’s utmost sincerity.",
      "overlap_context": "s the perfection of benevolence—violence and harm do not arise. The black-haired people receive your moisture; what is this if not protection? White cranes soar through the sky nearby, receiving the rainbow phoenixes’ offered invitations. Heaven and humanity rejoice in your grace... [Remainder identical to the preceding.]\n\n**Concluding the First Scroll of the Rites for the Ennoblement of the Three Mao Lords**\n**Beginning the Second Scroll of the Rites for the Ennoblement of the Three Mao Lords**",
      "start_char": 7355,
      "end_char": 8423,
      "start_sentence": 270,
      "end_sentence": 295,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.04668855667114,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\三茅真君加封事典.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "谨启以闻。 十二愿　复炉如常仪 庆礼设醮仪 卫灵呎　发炉如常式出官 谨出臣身中如常式至同心上启三君圣位：臣以宿命因绿，叨行教法，告盟之日，约以行持，誓当敷赞真风，振扬大化，永扶国祚，普为生灵。 凡有所祈，理宜关奏。 臣今谨为皇帝宣扬密旨，昭告嘉封，祇陈庆忏之仪，用集应洪之福。 以今拜上青词一通，伏乞功曹使者特为关启，速得上达云云至以闻。 各称法位 具位臣某等上启三君洞天列圣：臣闻九德功高，太帝册加於九锡，三官任重，真皇经受於三元。 道始师於总真，录毕传於西母，由无心於人爵，乃证位於仙都，瑶室琼房，治统於赤城玉洞，凤腴丹药，宴集於句曲金坛。 佩郁仪结璘之章，得服日餐华之卫，化行江左，福被昊邦。 天市风清，时奏空中之仙曲，洞庭浪阔，路连地内之阴宫。 青童遗飕驭之踪，白鹄现轩翔之相，以符法驱千妖之气，以神化顺百姓之心。 尝闻应迹於人问，未始离神於天上，有情斯感，无愿不从。 今皇帝冥运一心，遥瞻三秀，式际休明之运，缅怀道德之仙，肇举鸿仪，丕陈显册，迹冲虚静慧之美，进圣德仁佑之称。 宸命自天，书照陇，增群峰之焕耀，新万目之观瞻，载洁灵场，对扬君命，辄伸庆忏，恭荐芬馨，香袅名峰合鸾笙而共奏，章吟空洞延鹤驭以来临。 臣无任激切之至，再拜奏请。 ．",
      "translated_text": "We humbly submit this memorial for Your attention.\n\n**Twelve Vows:**\nMay the incense burner be restored as in the usual rite.\nMay the celebration liturgy and jiao offering be conducted.\nMay the *Weiling Chi* be recited, and the burner kindled as in the established form.\nMay the officials be dispatched.\n\nWe reverently issue forth from our bodies as in the usual form, and with one heart ascend to address the sacred thrones of the Three Lords:\n\nBy karmic affinity of former lives, we have presumptuously followed the teachings and the Dharma. On the day of our covenant, we pledged to uphold our practice, vowing to propagate the true wind of the Dao, to invigorate and spread its great transformation, to eternally support the imperial destiny, and to universally benefit all living beings. Whatever we pray for, we duly report and memorialize.\n\nWe now reverently proclaim the emperor’s secret decree, declaring his illustrious investiture. We humbly present the rites of celebration and repentance, that the great blessings of response may be gathered.\n\nHerewith, we prostrate and offer one document of blue-green prayer-text, beseeching the *Gongcao* messengers to specially transmit and swiftly convey it upward.\n\nEach states his dharma-rank:\n\nYour subjects, the variously ranked ministers, ascend to address the Three Lords and the Perfected Saints of the Grotto-Heavens:\n\nWe have heard that the Nine Virtues’ merits are lofty, and the Supreme Thearch bestows upon them the Nine Gifts; the Three Officials bear heavy responsibilities, and the Perfected Sovereign receives the scriptures of the Three Origins. The Dao’s beginning is taught by the Lord of Total Perfection; the Registers’ completion is transmitted by the Queen Mother of the West. By relinquishing all attachment to human rank, one attains the position of the Immortal Capital. Jade chambers and coral halls govern the lineage of the Crimson City and the Jade Grotto; phoenix marrow and cinnabar elixirs gather in feasts at the Golden Altar of Mount Goulou. Adorned with the insignia of *Yuyi* and *Jielin*, one obtains the protection of the sun’s radiance and the moon’s splendor, transforming the lands south of the Yangtze and bestowing blessings upon the august realm. The winds of the Celestial Market are pure, and celestial music is played in the empty sky; the waves of Dongting Lake are vast, and the paths connect to the Yin Palaces within the earth. The Blue Lad leaves traces of his whirlwind chariot; the White Crane manifests its soaring form. By talismanic methods, the qi of a thousand demons is expelled; by divine transformation, the hearts of the hundred clans are harmonized. Though we have heard that their traces appear among humans, they never depart from the divine realm above. Where there is sincerity, there is response; no wish goes unfulfilled.\n\nNow the emperor, with a single mind in profound resonance, gazes afar at the Three Radiant Ones. As he encounters this era of flourishing brightness, he recalls the immortals of virtue and the Dao. He initiates grand rites and presents a resplendent memorial, embodying the beauty of emptiness, tranquility, and wisdom, advancing the title of sagely virtue, benevolence, and protection. The imperial mandate descends from Heaven; the jade tablets illuminate the peaks of Long. They enhance the brilliance of the myriad summits and renew the gaze of ten thousand eyes. Having purified the sacred precinct, we respond to the imperial command. We humbly extend our rites of celebration and repentance, reverently offering fragrant incense. The incense curls upward from the renowned peaks, joining the music of the simurgh pipes; the prayer-texts chant in the empty void, summoning the crane-drawn chariots to descend.\n\nOverwhelmed with utmost fervor and urgency, we bow twice and submit this petition.",
      "overlap_context": "boars. May the Xiongnu submit at the frontier passes, sparing the need for Han envoys; may the many officials fill the courts, restoring the grandeur of the Zhou dynasty. May the altars of soil and grain enjoy enduring blessings; may the spring and autumn records proclaim years of great abundance.\n\nMay all beings, even those in flight or afloat, preserve their lives in full.\n\nAbove, may this manifest the compassion of the Three Perfected; below, may it accord with the emperor’s utmost sincerity.",
      "start_char": 8423,
      "end_char": 8949,
      "start_sentence": 296,
      "end_sentence": 314,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.59256625175476,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\三茅真君加封事典.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "请圣　初献 臣闻天人异世，由两仪四象之分，兄弟齐仙，实千载一时之契。 友爱备书於药岌，灵踪未泯於华阳，奕世钦崇，皇朝礼敬。 恭惟祖师三茅司命圣德仁佑真君，挺资冲漠，抗志清虚，古昔评谣早验嘉平之腊，后先飞举率由句曲之山，仙宾师友定约以按行，昊越人民悉归於考校。 岁以艳阳之月，飕乘汗漫之游，左玉佩，右金铛，拥八鸾於霄汉，西峨眉，束林屋，现三鹤於峰头。 不惟专祸福之权，亦乃运吉凶之柄，安人利物，保国宁家，道化潜行，功成不宰。 今皇帝储精道妙，迈德帝先，每思绥靖之艰，虔奉真灵之造，既密叨於护佑，宜克尽於钦崇。 九陛颁恩，三峰称庆，用报辅时之德，载析保国之祥。 爰肃清坛，昭陈褥礼。 臣均沾王化，幸处名山，仰邀洞府之真婷，对扬天子之休命，愿垂鉴盼，俯纳虔祈。 设醮青词，谨当宣奏。 宣词 具如词旨，备列丹忱，谅彻渊冲，必垂鉴映。 臣闻圣人无迹，或降迹於尘寰，大道难名，岂沽名於圣世。 今皇帝躬行慈俭，远达聪明，追还清净之风，崇厚浇漓之俗，钦仙真之隹躅，举希阔之盛仪，乃眷三君，阐灵千古，瑞应皇朝之四帝，润沾江左之草元。 爰锡徽章，崇加显号。 更愿不忘本始，俯察宸怀，申命昆台，降神仙岳，庶资众妙，用格多男，衍玉叶之蕃昌，保瑶图之绵久，永依大道，克着洪猷。 臣等无任激切之至。 亚献 臣闻神仙可学，宿名定着於玄图，兄弟同升，笃志多成於善行。 乃眷天人之美，并登帝所之真，载籍以来，标题尤显。 切仰三君之德，森然万世之芳，道在邦家，惠流民物，夜炳丹光而亘烛，春联鹤驭以来归，奉师而相与遨游，好道者当与料理，山川如故，天地无穷。 今皇帝密感真休，聿修报典，双鸾飞彩传芝检於瑶阶，掌鹤翔空递纶音於玉洞，道俗欢呼而载路，典仪祇荐於褒名，庶期冲鉴之临，永侈蕃禧之锡。 臣等奉宣睿命，仰赞仙猷，洞磬琅傲效灵音而清彻，溪毛涧藻进徽款於芬馨，琳腴敢冀於刀圭，绣羽仰旋於霄驭，献奇祥於有地，锡圣寿以齐天，洪泽万生，皇图亿载，五风十雨不破块以呜条，四海九州悉包茅而贡能，椒掖报得男之喜，榆防奏郁虏之勋，年谷丰登，黔黎怡泰。 然冀名山肃静，真教流传，化魔俗以革心，俾学徒之进道，飞潜遂性，动植昭苏，一切有情，俱乘妙荫。 臣等无任激切恳梼之至。 终献 臣等祇近宸纶，丕扬徽号，敷陈典礼，延款仙真，荷列圣之居饮，副群情之舒庆。 今则灯销兰焰，香散芳云，邈仙仗之言，旋望灵光而顺拜，钦承鸿既，仰恋鸾舆。 臣等无任攀恋望恩之至，谨稽首再拜奉送。 送圣　内官复炉如常仪庆礼设醮仪终。 皇帝设醮青词 伏以圣人无边，驰游八极之虚，大道难名，虔切旱心之慕。 允赖神灵之佑，宜婵昭报之文。 肆举徽章，载加褥礼，用恪伸於庆忏，祈永介於休祥。 善利所加既锡黎元之福，纯禧来被更延. ； 层之昌。 内省张都知醮词",
      "translated_text": "**First Offering**\n\nWe have heard that Heaven and humanity dwell in separate realms, divided by the Two Modes and Four Images, yet brothers may ascend together as immortals, a rare convergence once in a thousand years. Their fraternal love is recorded in the *Yao Ji*, and their divine traces remain unvanished in Huayang. Through generations, they have been revered; in this imperial dynasty, they are honored with rites.\n\nWe humbly recall the Ancestral Master, the Three Mao Lords of Life and Destiny, the Sagely Virtue and Benevolent Protector Perfected Lords. Born of the primordial void, their aspirations soared to pure emptiness. In ancient times, their praises were foretold in the songs of Jiaping; later, they ascended in succession from the peaks of Juqu. Immortal guests and fellow adepts pledged their visits, while the people of Wu and Yue were all brought under their scrutiny. Each year, in the radiant spring month, they ride the boundless winds, jade pendants to the left, golden bells to the right, leading eight simurghs through the celestial vastness. To the west, they visit Mount Emei; to the east, they bind Linwu, manifesting three cranes upon the peaks. Not only do they wield authority over fortune and misfortune, but they also govern the mechanisms of good and ill, bringing peace to the people, benefit to all things, safeguarding the state, and securing the household. The transformative power of the Dao flows unseen; their merit is accomplished without dominion.\n\nNow, the Emperor stores the essence of the wondrous Dao, surpassing the virtue of former sovereigns. Ever mindful of the challenges of pacification, he reverently serves the true numina. Having secretly received their protection, he fittingly fulfills his devotion. From the nine-tiered palace, grace is bestowed; upon the three peaks, jubilation resounds. Thus, we repay the virtue of aiding the times and pray for the blessings of national protection. With solemnity, we purify the altar and reverently present the ritual mat.\n\nWe, who equally partake in the imperial transformation and are fortunate to dwell upon these renowned mountains, look up to the true spirits of the grotto-heavens, responding to the Emperor’s gracious mandate. May you deign to regard us with favor and graciously accept our earnest prayers. The blue-green memorial is prepared; we shall now proclaim its words.\n\n**Proclamation of the Memorial**\n\nAs the text fully states, our sincere devotion is set forth in vermilion earnestness. May it ascend to the profound and tranquil, assuredly receiving your luminous regard.\n\nWe have heard that the sagely leave no traces, yet some descend into the dusty world; the great Dao is beyond naming, yet how could it seek renown in an age of sagacity? Now, the Emperor personally practices compassion and frugality, his wisdom and insight far-reaching. He revives the winds of purity and stillness, exalting a culture grown thin and shallow. Revering the footsteps of the immortal perfected, he enacts the grand rites of rare splendor. Thus, he honors the Three Lords, revealing their numinous power through the ages. Auspicious responses have graced four emperors of this dynasty, and their blessings have nourished the grasses and roots of Jiangzuo. Therefore, he bestows illustrious titles and elevates their sacred designations.\n\nWe further pray that, without forgetting their origins, they will regard the imperial heart, dispatching commands to the Kunlun terraces and summoning the divine peaks to descend. May they aid in the manifold mysteries, drawing forth abundant blessings, ensuring the flourishing of the jade lineage and the enduring prosperity of the imperial enterprise. May we forever rely upon the great Dao and bring to fruition its grand designs.\n\nOverwhelmed with utmost fervor and urgency, we bow twice and submit this petition.\n\n**Second Offering**\n\nWe have heard that immortality may be learned, with predestined names inscribed in the mysterious charts, and that brothers may ascend together, their steadfast resolve often rewarded by virtuous deeds. Beholding the beauty of Heaven and humanity, they attain the true realm of the imperial abode. Since records began, their renown has been especially resplendent.\n\nWe now reflect upon the virtue of the Three Lords, whose fragrance endures through ten thousand generations. Their Dao sustains the state and household, their kindness flows to the people and all things. By night, their cinnabar radiance shines unbroken; in spring, their crane-drawn chariots return in procession. They serve their masters and roam together; those who love the Dao are entrusted with its stewardship. Mountains and rivers remain unchanged; Heaven and Earth are without end.\n\nNow, the Emperor, deeply moved by true blessings, diligently performs rites of gratitude. Twin simurghs bear the auspicious writs upon jade steps; crane attendants soar through the void, conveying imperial decrees to the jade grottoes. Daoists and laity alike fill the roads with joyous cries; the ritual observances are reverently offered upon the sacred mats. May the profound regard of the immortals descend, bestowing ever-increasing blessings.\n\nWe, entrusted with proclaiming the sagely mandate, look up to aid the immortal enterprise. The cavern bells and jade chimes echo with numinous clarity; mountain herbs and stream offerings present their fragrant sincerity. We humbly hope for the elixir’s grace; the embroidered feathers ascend to the celestial chariots. Auspicious wonders are offered upon the earth; sacred longevity is bestowed to equal Heaven. May the vast beneficence nurture all life; may the imperial enterprise endure for a hundred million years. Five winds and ten rains do not shatter the clods with their sighs; the four seas and nine provinces are all thatched with tribute. The palace halls rejoice in the birth of sons; the frontier defenses proclaim the merit of subduing the barbarians. The harvests are abundant; the black-haired people are at peace.\n\nWe further pray that the sacred mountains remain serene, the true teachings spread far, transforming the demonic and the vulgar to reform their hearts, guiding disciples to advance in the Dao. May all creatures, flying and hidden, fulfill their natures; may plants and trees revive. May all sentient beings together ride the wondrous shade.\n\nOverwhelmed with utmost fervor and earnest prayer, we bow twice and submit this petition.\n\n**Final Offering**\n\nWe, who reverently attend the imperial decrees and grandly proclaim the illustrious titles, have set forth the ritual observances and extended our hospitality to the immortal perfected. We have received the favor of the successive sages and fulfilled the joyous aspirations of all.\n\nNow, the lamp flames fade like orchid embers, and the fragrant incense disperses like clouds. The immortal retinue departs in the distance; we gaze after their numinous radiance and bow in reverence. With deepest respect, we receive the grand favor and look up longingly to the simurgh chariots.\n\nOverwhelmed with utmost yearning and gratitude, we bow twice and humbly take our leave.\n\n**Sending Forth the Immortals**\nThe inner officials restore the incense burners as customary. The rites of celebration and the jiao offering conclude.\n\n**The Emperor’s Blue-Green Memorial for the Jiao Offering**\n\nWe humbly consider that the sagely are boundless, roaming the emptiness of the eight directions, and the great Dao is beyond naming, yet we earnestly yearn for it with devoted hearts. Rightly relying upon the protection of the divine spirits, we fittingly present this luminous memorial. Thus, we enact illustrious titles and reverently offer the ritual mat, solemnly extending our rites of celebration and repentance, praying for enduring blessings.\n\nWhere goodness and benefit are bestowed, the blessings of the black-haired people are secured; where pure felicity descends, the prosperity of the imperial line is further prolonged.\n\nThe Director of the Inner Court, Zhang, presents the memorial for the jiao offering.",
      "overlap_context": "iance of the myriad summits and renew the gaze of ten thousand eyes. Having purified the sacred precinct, we respond to the imperial command. We humbly extend our rites of celebration and repentance, reverently offering fragrant incense. The incense curls upward from the renowned peaks, joining the music of the simurgh pipes; the prayer-texts chant in the empty void, summoning the crane-drawn chariots to descend.\n\nOverwhelmed with utmost fervor and urgency, we bow twice and submit this petition.",
      "start_char": 8949,
      "end_char": 10078,
      "start_sentence": 315,
      "end_sentence": 352,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.00067973136902,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\三茅真君加封事典.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "伏以己峰（山记》 云：山形似己字，故以句曲为名焉列峙，俨仙圣之真风，三号虽殊，焕熙辰之盛典。 初属礼成之庆，敢伸妙供之修。 仰奉明朝，敬宣封册。 伏愿高仙昭格洞鉴冥扶，万寿无疆，佑帝图之广大，三时不害，永民物之阜安。 崇禧观醮词 伏以玉音垂诰，锡三号以褒真，金录崇禧，领诸峰而祝圣。 恭承恩命，仰赞仙终，微臣幸际明朝，忝司教钥，睹一时之褥典，焕千古之灵踪，乃圣乃神，兼被德仁之佑，卜年卜世，永绵统绪之祥。 谨倾庆颂之诚，聊效精修之供。 洞天香远，加称万岁之声，道境风清，敷作草生之福。 奏谢加封　祖师真君恩礼表 臣师坦言：恭蒙圣恩，加封三茅真君圣号，颁降告三道，宣赐如意、玉圭、威仪、锦磨、沉香、脑子、新茶、银两，令臣设醮庆赞。 臣已仰遵圣训，率励法流，褊告三峰，昭陈醮礼，发扬君命，祈佑嘉生者。 臣伏以福地凝严，会四海华封之祝，宸纶涣宠，衍三君徽号之崇，道俗欢迎，神人感泽。 臣中谢切惟山留玉洞之治府，内有金坛之虚台，鹤驭来游，岁校华阳之籍，天皇授命？ 董同昊越之疆。 道叶仙枝，流芳千载，灵源真系，被眷累朝。 祇荷殊恩，载扬褥典，即冲虚静慧之美，进圣德仁佑之称。 彩诰临峰，夜雨澄清於岩谷，迎舆戒道，朝晴映曜於旌幢，瑞霭祥烟，徊翔鹤袂，元圭如意，敷露鸿仪。 熙事告功，飘御炉之清馥，羽流交贺，沐上赐之荣光，瞻视一新，迩遐胥庆。 兹盖伏遇陛下明德险祀，以道化民，爰申锡於褒章，用益昭於敬事，人悦则神罔不宥，物备故礼得以成。 笃眷之恩，山林多幸，旷绝之泽，草木俱沾，加贲已宏，全福自至。 臣肃将王命揭处仙庭，祝圣寿认无疆，庆覃寰宇，感真人之应祷，辉丽前星。 臣无任感天荷圣激切屏营之至。 臣实惶实惧，顿首顿首，谨具表奏谢以闻。 淳佑九年六月日新特转左街道录洞微先生虚白高士主管教门公事臣司徒师坦表奏 缴状 具位。",
      "translated_text": "**From the *Ji Feng Shan Ji*:**\n\nIt is recorded that the mountain’s form resembles the character *ji*, hence its name, Juqu. Arrayed in solemn ranks, it embodies the true wind of immortals and sages. Though its three titles differ, they together illumine the splendor of this grand rite. Now that the ceremonial offerings are complete, we dare to present these wondrous oblations. Reverently receiving the enlightened decree of the august court, we respectfully proclaim the conferral of titles.\n\nWe humbly pray that the exalted immortals, in their radiant presence, may peer into the unseen and lend their hidden support. May the imperial reign endure without end, and the greatness of the imperial enterprise expand boundlessly. May the three seasons bring no harm, and the people and all beings forever enjoy abundance and peace.\n\n**Memorial for the Jiao Offering at Chongxi Abbey**\n\nWe humbly consider that the imperial edict descends like jade tones, bestowing three titles to honor the true ones, while the golden registers of Chongxi Abbey preside over the peaks to invoke blessings upon the sage. Reverently receiving the gracious mandate, we aspire to aid the immortal’s work. Your humble servant, fortunate to serve in this enlightened age and entrusted with the keys of the teaching, witnesses this momentous rite, which illumines the sacred traces of a thousand ages. Thus, the divine and the numinous alike receive the protection of virtue and benevolence. In divining the years and generations, may the auspicious continuity of the imperial line forever endure.\n\nWith utmost sincerity, we pour forth our joyful praises and offer these refined oblations. May the incense of the grotto-heavens waft afar, amplifying the chorus of \"ten thousand years,\" and may the winds of the Dao-realm blow pure, spreading blessings as grass grows in spring.\n\n**Memorial of Gratitude for the Conferral of Titles upon the Patriarchal Perfected Lords**\n\nYour servant, Master Tan, respectfully states: By the sagely grace of the throne, the three Mao Perfected Lords have been honored with august titles, and three proclamations have been issued. Bestowed are a *ruyi*, a jade scepter, regalia, brocade, *chenxiang* wood, *naozi* incense, fresh tea, and silver taels, commanding your servant to conduct a jiao offering in celebration.\n\nYour servant has reverently obeyed the sagely instructions, leading the ritual currents to announce the rites upon the three peaks, proclaiming the imperial mandate and praying for the flourishing of all life.\n\nWe humbly reflect that this sacred land, steeped in solemnity, unites the felicitations of the four seas, while the imperial favor, flowing from the throne, extends the exalted titles of the three lords. Daoists and laity rejoice together, and gods and humans alike are moved by this grace.\n\nYour servant offers profound thanks, for this mountain cradles the Jade Grotto’s governance and harbors the Golden Altar’s empty terrace. Crane-drawn chariots visit in turn, their years recorded in the registers of Huayang. The Heavenly Sovereign bestowed his mandate, overseeing the lands of Wu and Yue. The Dao aligns with the immortal lineage, its fragrance flowing through a thousand ages; the numinous source of the true lineage has been favored across successive dynasties.\n\nNow, bearing this extraordinary grace, we exalt the ritual offerings. Thus, the virtues of profound emptiness and tranquil wisdom advance to the title of \"Sagely Virtue and Benevolent Protection.\" The resplendent proclamations descend upon the peaks, and the night rain clears the valleys; the imperial procession halts upon the Daoist path, and the morning sun gleams upon the banners. Auspicious mists and propitious vapors hover around the cranes’ sleeves, while the jade scepter and *ruyi* unfold the grandest of rites.\n\nThe rites conclude with harmonious success, the imperial incense wafting its pure fragrance. The feathered ones exchange felicitations, bathed in the glory of the imperial gifts. All appears renewed, and near and far alike rejoice.\n\nThis is all due to Your Majesty’s luminous virtue, which venerates the perilous and sacrifices to transform the people through the Dao. Thus, you extend the bestowal of honors to amplify reverence. When the people are joyful, the gods are never unyielding; when all things are prepared, the rites are fulfilled. Your profound favor brings fortune to the mountains and forests, while your boundless grace nourishes even the grasses and trees. The conferral is already vast, and perfect blessings naturally follow.\n\nYour servant, bearing the imperial mandate, ascends the immortal’s court to pray for the sage’s boundless longevity, celebrating the spread of blessings throughout the realm. Moved by the perfected ones’ response to these prayers, may the radiance of the celestial luminaries shine ever brighter.\n\nYour servant, overwhelmed by gratitude for the celestial and imperial favor, is filled with awe and trepidation. With utmost reverence, I kowtow repeatedly and present this memorial in gratitude.\n\n**Memorial submitted on the ___ day of the sixth month in the ninth year of the Chunyou reign.**\n**Submitted by your servant, Sima Shitan, newly promoted Left Street Daoist Registrar, Master of the Cavernous Subtlety, Vacuous White Scholar, and Director of the Teaching Office.**\n\n**Submission Document**",
      "overlap_context": "of the divine spirits, we fittingly present this luminous memorial. Thus, we enact illustrious titles and reverently offer the ritual mat, solemnly extending our rites of celebration and repentance, praying for enduring blessings.\n\nWhere goodness and benefit are bestowed, the blessings of the black-haired people are secured; where pure felicity descends, the prosperity of the imperial line is further prolonged.\n\nThe Director of the Inner Court, Zhang, presents the memorial for the jiao offering.",
      "start_char": 10078,
      "end_char": 10832,
      "start_sentence": 353,
      "end_sentence": 379,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.433810472488403,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\三茅真君加封事典.txt",
        "category": "谱箓类"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "四月二十一日恭准公文，备奉圣旨宣谕降赐到，加封真君诰命三道，宣赐如意、玉圭、锦婶、威仪、沉香、脑子、新茶、银两，令师坦择日设醮昭告者。 右师坦谨已恭遵圣训，逐一交领前件告命宣赐、宝器物件，关集闱山道俗出山恭迎，望阙谢恩，褊诣三峰，敷扬君命，以次择日设醮，昭告天地仙真事竟。 谨置典册，具载仪礼节次，及将告命分贲三峰，宣扬宝器，交付山门道正司崇禧观，永镇名山，仰延睿算。 今取到崇禧观开具交管版册一本，三峰交领诰命宝审状三本，具表缴进。 伏乞台慈特为闻奏，伏候台旨。 淳佑九年六月日具位司徒师坦状 进加封告碑表 臣师坦言：伏以三封加，辉华句曲之山，万古不磨，琢刻昆岗之玉。 踞文龟而拥护，聚羽鹤以观瞻，遥阙归。 ＇恩，溥天知敬。 臣中谢切谓仙真之异固毋俟於表光，功德於人有不容於泯晦，空现五云而汉诏具在”帝赞九锡而晋碑尚存，自历代以来，蒙被眷渥。 今千载而下，幸逢圣时，聿阐褒章，载崇显号，用侈灵祇之报，倍为至教之荣。 谨才诸石以惟探，期与此山而不朽。 兹盖伏遇陛下德充浚哲，心照危微，饮函三於太和，抚万宇而无外。 日行其道，坐凝百志之熙，民莫能名，躬致九功之叔，不矜已治，思答神休，时加雨露之私，顿觉烟霞之重。 臣去天易久，承命惟新，爰镂坚泯，永作君群峰之镇，摹成彻御，敢祈乙览之垂。 臣谨奉表缴进以闻。 冒读宸严。 下情无任激切之至。 谨稽首顿首谨言。 淳佑九年十二月日具位臣司徒师坦上 三茅真君加封事典卷下竟",
      "translated_text": "On the twenty-first day of the fourth month, I duly received the official document bearing the sacred edict, which bestowed upon me three decrees of enfeoffment for the Perfected Lords, along with imperial gifts of *ruyi* scepters, jade tablets, brocade robes, ceremonial regalia, agarwood, borneol, choice tea, and silver ingots. The edict commanded me to select an auspicious day to hold a jiao offering and make solemn announcement thereof.\n\nAccordingly, I, your servant, have reverently complied with the imperial instruction, receiving in full the aforementioned decrees, imperial gifts, and precious objects. I then convened the Daoist clergy and laity of Mount Gui to descend the mountain and receive them, facing the imperial palace to express gratitude for the celestial favor. Proceeding to the Three Peaks, I proclaimed the imperial mandate, and in due course selected a day to hold the jiao offering, thereby completing the rites of announcement to Heaven, Earth, and the Immortal Perfected.\n\nI have duly compiled a ritual register, recording in detail the ceremonial procedures and sequence of events. The decrees of enfeoffment were distributed among the Three Peaks, the imperial gifts were displayed, and all were entrusted to the Chongxi Abbey’s Daoist Registrar for permanent enshrinement in this sacred mountain, that the sagely longevity may be eternally extended.\n\nHerewith, I present the inventory ledger from Chongxi Abbey detailing the received items, along with three receipts from the Three Peaks acknowledging the decrees and gifts. I humbly submit this memorial for Your Majesty’s gracious consideration and await your further instruction.\n\n**Submission Document submitted on the ___ day of the sixth month in the ninth year of the Chunyou reign.**\n**Submitted by your servant, Sima Shitan, in his official capacity.**\n\n---\n\n**Memorial on the Erection of the Stele for the Enfeoffment Decrees**\n\nYour servant, Sima Shitan, respectfully states: The triple enfeoffment bestows radiant splendor upon the mountains of Juqu, its glory imperishable as the jade of Kun’gang. Perched upon the sacred tortoise and guarded by feathered cranes, its inscriptions command reverence, while from afar the imperial grace is acknowledged by all under Heaven.\n\nThough the marvels of the Perfected Immortals need no illumination by steles, their merits toward humanity must not be left in obscurity. The five-colored clouds of Han still bear witness to imperial decrees, and the Nine Bestowments of Jin remain engraved in stone. Through successive dynasties, they have been graced with imperial favor. Now, a thousand years later, we are fortunate to live in this sagely era, where their exalted titles are further ennobled, magnifying the recompense to the numinous spirits and redoubling the glory of the supreme teaching.\n\nThus, I have selected the finest stone, seeking to ensure its endurance coeval with this mountain. This is all due to Your Majesty’s virtue, profound and sagacious, whose mind perceives even the subtlest truths. You harmonize the Three Powers in perfect accord, governing all within the Four Seas with boundless inclusivity. In your daily conduct, you embody the Dao; in repose, you cultivate the flourishing of a hundred aspirations. The people cannot name your virtue, yet you personally achieve the perfection of the Nine Virtues. Humble in your governance, you seek to repay the divine blessings, bestowing timely favors like rain and dew, so that even the mist-laden peaks feel the weight of your grace.\n\nThough I have long been distant from the celestial court, I renew my devotion upon receiving this mandate. Thus, I have carved these imperishable words to serve as an eternal guardian of the imperial majesty among the peaks. I dare to hope that Your Majesty will deign to cast your gaze upon them.\n\nI humbly present this memorial for Your Majesty’s consideration. Overwhelmed by the awe of addressing the imperial throne, I am filled with boundless trepidation.\n\n**With utmost reverence, I kowtow repeatedly and respectfully submit this memorial.**\n\n**Submitted on the ___ day of the twelfth month in the ninth year of the Chunyou reign.**\n**Submitted by your servant, Sima Shitan, in his official capacity.**\n\n**The second fascicle of *Records of the Enfeoffment of the Three Mao Perfected Lords* concludes here.**",
      "overlap_context": "our servant, overwhelmed by gratitude for the celestial and imperial favor, is filled with awe and trepidation. With utmost reverence, I kowtow repeatedly and present this memorial in gratitude.\n\n**Memorial submitted on the ___ day of the sixth month in the ninth year of the Chunyou reign.**\n**Submitted by your servant, Sima Shitan, newly promoted Left Street Daoist Registrar, Master of the Cavernous Subtlety, Vacuous White Scholar, and Director of the Teaching Office.**\n\n**Submission Document**",
      "start_char": 10833,
      "end_char": 11440,
      "start_sentence": 380,
      "end_sentence": 401,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.109925746917725,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\谱箓类\\三茅真君加封事典.txt",
        "category": "谱箓类"
      }
    }
  ]
}