{
  "source_id": "上清僊府琼林经",
  "source_file": "chunked_daozang\\上清僊府琼林经.json",
  "total_chunks": 10,
  "total_original_chars": 9568,
  "total_translated_chars": 57417,
  "total_translation_time": 299.6726107597351,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\上清僊府琼林经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Upper Clarity Jade Grove of the Immortal Palaces Scripture**\n\n**Scripture Title:** *The Upper Clarity Jade Grove of the Immortal Palaces Scripture*. Author unknown, approximately composed during the Northern and Southern Dynasties. Compiled from excerpts of the *Great Cavern Perfected Scripture*, *Declarations of the Perfected*, *Concealed Instructions for Ascending to Perfection*, and other Upper Clarity School cultivation scriptures and methods. One scroll. Base text from: *The Orthodox Daoist Canon*, Zhengyi Section, First Subsection.\n\nThe *Upper Clarity Jade Grove of the Immortal Palaces Scripture* states:\n\nHeaven possesses the Mysterious One, born of the Great Yang, named the Flowing Pearl, the gate of all wonders. To obtain and retain it is to attain longevity.\n\nHumans possess the Three Ones, each dwelling in different places. To master and guard them all is to become a King of Immortals.\n\nOne resides in the North Pole’s Great Abyss, before which lies the Hall of Light, below which is the Crimson Palace, above which is the Floral Canopy, with jade towers of ten thousand layers.\n\nIt further states: The Perfected Purple Yang said, \"In my early Daoist studies, I received the true names of the Three Ones from the Perfected Su Zixuan of Mount Song. Zixuan taught me the method of guarding the One, comprising over two hundred matters. I practiced them faithfully and became a Perfected of the Upper Clarity. That Dao is most authentic.\"\n\nIt further says: The twenty-four qi correspond to the Twenty-Four Perfected of the Great Tenuity. With a thousand chariots and ten thousand riders, feathered canopies and cloud-borne carriages, they unite with the Primordial Chart of the Purple Palace and Upper Clarity. If one guards this with unwavering firmness, essence responds and resonance flows unimpeded, then the Three Ones may be seen. When the Three Ones are seen, the thousand chariots and ten thousand riders appear, the feathered canopy may be mounted, and the cloud-borne carriage may be ridden. Ascending to the Great Tenuity, merging the twenty-four qi, one beholds the Twenty-Four Perfected, soars through the Upper Clarity, and is listed in the Primordial Chart. This is the way of ascending to heaven in broad daylight, concurrently practicing the Dao of the Grotto Chambers.\n\nIt further says: The Upper One is the utmost of the true, the Middle One the perfection of the true, the Lower One the subtlety of the true. The Heavenly Sovereign attained the utmost and thus ascended to the Imperial Ultimate; the Earthly Sovereign attained perfection and thus ascended to the Orthodox One; the Human Sovereign attained subtlety and thus ascended to become the Lord of Myriad Wonders. The Three Sovereigns embodied the true to guard the One, thus the One conceals no form. Immortals seek the true to pursue the One, thus the Three Ones are all illuminated. When the One conceals no form, its true nature is utmost; when the Three Ones are all illuminated, it is simply the attainment of the One.\n\nThe *Original Record of the Upper Perfected’s Birth and Transformations* states: The August Emperor opens the true, the nine ways unite in clarity. Refining the primordial void, illuminating the Upper Clarity, dividing forms and transforming radiance, the four movements follow generation. The eight effulgences support and assist, conveying the cinnabar carriage, riding clouds and driving mist, urging on to the Upper Clarity, soaring through the cloud chambers, and paying court to the Imperial Capital.\n\nIt further says: For those cultivating the Dao of the Perfected Kings of the Nine Heavens, regularly on the winter solstice, bathe and enter the chamber, face west and bow nine times, and pay homage to the Perfected Kings of the Nine Heavens. Naturally, one may ride the nine-colored cloud chariot and soar to the Upper Clarity.\n\nIt further says: The upper spirits of the Nine Heavens are primordially spontaneous... The Central Treasure of Purple Primordiality, the Three Purities externally entwined...\n\nPenetrating transformation enters the subtle; my Dao was early apportioned. The eyes summon numinous radiance; the heart unfolds the five clouds. Urging the eight effulgences, I fly into the imperial dawn.\n\nIt further says: Embracing the true and inheriting qi, the form excels in the purple heavens. Riding clouds and driving the floating, bathing in the radiance of the eight mists...\n\nObtaining the carriage of the empyrean, ascending to the Jade Dawn.\n\nIt further says: The sevenfold-luminous palace of jade and forest.\n\nIt further says: Internally, one contains the numinous immortal; externally, one refines the true countenance. The Jade Pool’s floral dew flows and moistens the purple chamber.\n\nIt further says: The Supreme Jade Dawn, revolving radiance in the empty clarity. Dividing forms and transforming convergence, ninefold refinement of the Three Perfected.\n\nIt further says: The prayer text for the qi of the Morning Brilliance of the Three Primordial Lords of the Upper Primordial and Great Simplicity states: The Three Purities revolve the primordial heavens; the clear empyrean supports the Jade Numinous...\n\nThough the great rosy clouds stretch afar, the penetrating radiance discerns the affectionate. Together we carry the jade tally, jointly awaiting the carriage of the Nine Heavens.\n\nIt further says: The Great Simplicity urges the movement; the four effulgences fly in the void.\n\nIt further says: The August Clarity marks the morning radiance; the numinous qi supports the void’s ascent. Drifting, drifting to the Nine Primordials above, gently, gently entering the imperial dawn.\n\nIt further says: The Four Elders and Middle Perfected scatter flowers in the cloud chambers.\n\nIt further says: The Mysterious Dawn girds the lofty numinous; the Perfected Governor of the Eight Clarities. Jade brilliance unfolds the cinnabar chamber; the purple phoenix illuminates the cloud encampment.\n\nIt further says: I ride the auspicious day to ascend and report to the imperial numinous. Seeking immortality and ascending in flight, I obtain the carriage of flowing radiance.\n\nIt further says: The Primordial Purple Sovereign, the Dao harmonizes with the mysterious void. Three transformations and nine divisions merge and transform the Great Beginning. Flying clouds and flowing supports, the azure canopy and green carriage.\n\nIt further says: The night sky brightens and clears; the hidden void reveals the true. Flowing clouds linger; golden flowers scatter in four directions. The Cinnabar Sovereign spreads radiance; clouds fly to the purple carriage.\n\nThe *Jade Scripture Precious Instructions of the Supreme* states: Ascending to the Jade Clarity within, roaming and feasting beyond the Nine Distant Realms.\n\nIt further says: The numinous wind fans the floral fragrance; resplendent and brilliant, unfolding luxuriant finery. The Great Perfected plucks the cloud zither; the assembled immortals play the numinous harp. Refined songs of the Three Heavens’ effulgences scatter blessings in the Jade Floral Grove.\n\nIt further says: Learning the Dao depends on cinnabar sincerity; serving the master as one’s closest kin. Drawing radiance to pair with the clear void, diligently renewing with each day. Rising to ascend the Great Clarity, transcending radiance to roam the Nine Empyreans. Preserving the origin and upholding the Dharma’s net, wandering the mysterious and attaining carefree ease. Ten thousand kalpas are like last night; a thousand kalpas like this morning. The numinous banner scatters with the wind; myriad thoughts dissolve in due time.\n\nThe *Great Cavern Perfected Scripture* states: The Great Feast transcends the Nine Mysteries; the grotto radiance entrusts spiritual communion. The Jade Emperor rides the vermilion empyrean; green rosy clouds adorn the golden walls. The upper palace within the cloud pearls, gazing upward to the Primordial Blade Peak.\n\nIt further says: The Flowing Pearl halts its radiance; purple rosy clouds surge in mist. Sevenfold revolving paths; the Three Luminaries illuminate the true.\n\nThe *Supreme Primordial Cavern Mystery Great Possession Scripture* states: Dwelling in the numinous cavern, feasting in the radiance of the seven dawns. Clarifying and sprinkling the floral garden, resting in the Nine Mysteries. Transforming radiance in the Jade Void, leading the hosts of heavens.\n\nIt further says: The Yin Spirit of the Great Perfected is named the Numinous Woman. Transforming radiance in the Nine Mysteries, riding the true in hidden obscurity. Conveying the flying rosy clouds, ascending to the imperial court.\n\nThe scriptures further state: The Nine Mysteries and Nine Heavens lie above the Three Realms.\n\nIt further says: Roaming and playing upon the Terrace of the Nine Mysteries, resting and halting by the Western Feather River.\n\nIt further says: The Eight Radiant Chariots traverse the heavens.\n\nThe *Supreme Cavern Mystery Scripture* says: Crimson clouds obstruct the luminous brilliance; the Eight Radiant Chariots soar through the great void.\n\nIt further says: The Eight Vows Mysterious Mother, together with me, roams amidst the Three Mysteries. Then, loosening the reins in the Great Wilderness, we turn the chariot through the Three Mysteries. The Five Numinous Spirits support my back; the Queen Mother sits shoulder to shoulder with me. Dancing wheels upon the divine mounds, we halt our carriage in the Nine Heavens.\n\nThe *Inner Scripture of the Cavern Chambers* says: The Limitless Lofty Perfected ones, at dawn within the Vermilion Court, clad in dragon robes and tiger belts, recite the *Cavern Mystery Scripture*. They wander through the Nine Heavens, gathering in the high assembly of the Seven Voids. Riding the flowing chariot of the Empty Cavern, they rein the round carriage of the Great Empyrean.\n\nIt further says: I blend within the Five Qi, transforming together to ride the solar chariot. Feasting and gazing beyond the cloudy empyrean, exhaling and inhaling the essence of the Seven Spirits. Reposing within the Nine Mysteries, sitting and rising upon the radiant clouds.\n\nThe text derives from the *Scripture of the Five Elders and the Feminine One*.\n\nThe *Scripture of the Three Primordials and the True One* says: To the left, spurring the cloud wheels; to the right, urging the flying dragons. Commanding the Twenty-Four Spirits above, with a thousand chariots and ten thousand riders, they summon the Yang and invoke the Yin, ascending to heaven in broad daylight.\n\nThe *Primordial Register of Mount Tortoise* says: At dawn, soaring in the Grand Solar Observatory; at dusk, nesting in the hidden Langfeng.\n\nIt further says: The host of immortals plays amidst the cloudy scenes; vermilion blossoms unfold in the spring sun. The imperial carriage halts amidst the cloud companions; lightly and freely, they soar. Gazing beyond the Eight Extremities, who can fathom the workings of their boundless journey?\n\nIt further says: The Three Primordial True Lords transform their forms according to the four seasons, reverting to their original qi, undergoing refinement to restore their forms.\n\nThe *Supreme Cavern Mystery Scripture* says: The northern ridges are thick with empyrean mists; crimson trees bear purple blossoms. Azure herbs fall in the phoenix groves; verdant [ ] adorn the rocky cliffs. The numinous towers soar into the great void; jade chambers mingle with the supreme rosy clouds. Cloud upon cloud... The dragon’s breath entwines the Five Clouds. Cloud upon cloud... Vermilion rosy clouds flourish in the morning empyrean.\n\nThe *Scripture of the Jade Pendants and Golden Earrings* says: The golden earrings above the Nine Heavens are named Rainbow Radiance, also called the Upper Clarity Palace, within the Great Empyrean. They coalesce from the qi of white mist, numinously reflecting the Nine Heavens. Cloud upon cloud... Their color is like white clouds; their form is like a jade mountain. There is the Palace of the Jasper Grove.\n\nIt further says: The Lords of the Nine Heavens are stationed within the Golden Court of the Solar Gate.\n\nIt further says: Jade pendants are made from the ethereal essence of the Nine Heavens. Above the Nine Heavens, they are named Morning Lamp. Cloud upon cloud... They coalesce from the qi of green yang, numinously reflecting the Nine Heavens. Cloud upon cloud... Their color is like green jade; their form is like the full moon. Within, there is the Empty Mystery, the Jade Terrace, and the Purple Palace.\n\nIt further says: The essence of the solar brilliance and lunar radiance, the rosy clouds of the sun and the luminous reflections of the moon. To the left, revolving the jade pendants; to the right, grasping the golden earrings. The Two Radiant Spirits entwine; the dual souls are at peace. Ascending to the Great Ultimate, descending to the Ten Directions.\n\nThe *Scripture of the Purple Book and Golden Root* says: The Azure Essence Lord is the disciple of the Nine Yang Primordial August Jade Emperor. Nurtured in the Heaven of the Primordial Cliff within the Jasper Grove and Seven Treasures of the Jade Mound Kingdom, beneath the seven-colored jasper phoenix that shades his body.\n\nIt further says: Dwelling in the realm of luminous rosy clouds, his teachings flow through the ruins of the Jade Kingdom. Grasping the Nine August Sovereigns’ scepters, descending upon the mounds of the Nine Regions. Cloud upon cloud... His house is made of purple clouds; his city is made of green rosy clouds. His halls are of yellow gold; his beds are of white jade.\n\nThe *Upper Scripture of the Cinnabar of the Guarded Mystery* says: One *cun* above and inward from the space between the eyebrows is the Double Field of the Guarded Inch. One *cun* inward is the Palace of the Bright Hall. Two *cun* inward is the Palace of the Cavern Chamber. Three *cun* inward is the Palace of the Cinnabar Field. Four *cun* inward is the Palace of the Flowing Pearl. Five *cun* inward is the Palace of the Jade Emperor. One *cun* above the Bright Hall is the Palace of the Celestial Court. One *cun* above the Cavern Chamber is the Palace of the Ultimate Perfection. One *cun* above the Cinnabar Field is the Palace of the Mysterious Cinnabar. One *cun* above the Flowing Pearl is the Palace of the Supreme August. In all, there are nine palaces within the head.\n\nThe meridians of the Bright Hall, Cavern Chamber, Cinnabar Field, and Flowing Pearl Palaces are the Way of the divine immortals to become Perfected Ones, transmitted to the world. The *Scripture of the Mysterious Cinnabar* is also the essential teaching of the True Officials and Directors of Destiny, the guiding principle of the Four Palaces. This scripture may only be imparted when the Lord of the Great Ultimate has given his instruction.\n\nIt further says: Within the Palace of the Jade Emperor resides the Divine Mother of Jade Clarity. Within the Palace of the Celestial Court resides the True Woman of Upper Clarity. Within the Palace of Ultimate Perfection resides the Empress of the Great Ultimate. Within the Palace of the Supreme August resides the Sovereign Lady of the Most High. These Four Palaces are all the Feminine True One, whose Dao surpasses that of the Masculine True One. They possess precious scriptures transmitted only to those who have already attained Perfection. Those who have not attained Perfection are not to hear of them; the essentials of the Feminine True One are likewise not to be imparted.\n\nThus, the Most High emerges to feast amidst the Eight Radiant Spirits and enters to attend the Jasper Pavilion. Three thousand Jade Maidens serve and support the Perfected One; numinous consorts sing in harmony; divine attendants hold the towels. Truly, this is the practice of guarding the Feminine One, used to gather in the high assembly of the Mysterious Dawn. This is the root and origin of the Most High, transmitted by the August Void.\n\nIt further says: The Way of the True Lord of the Guarded Cinnabar of the Great One: At dusk, in tranquil repose, dispel all thoughts. Sit or lie as you wish. First, visualize the purple qi of the Northern Culmen star descending and entering your Mysterious Cinnabar. Cloud upon cloud... Then visualize the sun entering the Palace of the Mysterious Cinnabar, filling the palace within. Amidst the purple qi, gaze as if seeing a fire pearl in the dark. Then visualize the Central Yellow True Lord of Upper Clarity descending from the purple qi of the Northern Culmen into the Palace of the Mysterious Cinnabar, seated within the sun. The Lord’s name is Guiying, styled Huaxuan. Then visualize your entire body suddenly ascending into the Palace of the Mysterious Cinnabar, seated before the True Lord of the Great One. Cloud upon cloud... Thereupon, the True Lord of the Great One, together with you, rides the sun into the path of the red qi. Cloud upon cloud... There will be true responses. Cloud upon cloud... Then, together with the Great One, you will arrive at the guiding principle of the Seven Primordials, proceeding to the Upper Clarity Palace.\n\nThe *Supreme Dragon Script* further states: \"Sit upright in the Palace of Mysterious Cinnabar, neither inclined nor slanted—such is the essence of this Dao.\" You should visualize the purple qi of the Great One swirling around your body and swallow it. Always visualize the True Lord of the Great One within the purple qi of the Palace of Mysterious Cinnabar. Thus shall you attain boundless longevity, and the myriad calamities shall not assail you—the Dao of Mysterious Cinnabar is complete.\n\nThe *Scripture of Daoist Mechanisms* says: \"Man takes the body as his kingdom, spirit as his sovereign, essence as his minister, and qi as his people. Qi transforms into essence, essence into spirit, and spirit into the infant.\"\n\nThe *Inner Transmission on the Origins of Divine Immortals* states: \"On the eight seasonal nodes, all the great sagely honored deities and perfected persons of wondrous conduct ascend without exception to the Upper Palace of the Numinous Treasure’s Mysterious Capital on Jade Mountain, to pay homage and celebrate the celestial perfected.\"\n\nThe *Cavernous Spirit Section* says:\n*\"Commanding the radiance of the Great Auroral Palace,\nIn unison with the wheels of the Nine Heavens’ courts.\"*\n\nThe *Original Register of Mount Tortoise* states: \"The perfected one, amid golden halls and jade chambers, within seven-jeweled flower groves and above pools of limpid waters...\" Soaring in flight, pacing the void, they feast in jade chambers. Golden terraces and jeweled lights, the eight rarities as viands. Ascending the cavernous emptiness of immortal realms, within Mount Tortoise’s midst, they breakfast on jasper mushrooms and sip jade springs at dusk. All come to assemble: the twelve dark dragons, purple phoenixes, numinous serpents, divine birds in cinnabar chariots, feathered canopies and perfected mounts. The various spirits ascend with cinnabar, the lords follow with numinosity, descending to me.\n\nThe *Natural Jade Characters* says:\n*\"Beyond the celestial balance, in the capital of the Mysterious Capital,\nThere is the Mountain of Empty Peaks—\nThe playground of the ten thousand sages.\nThose who attain the Dao and achieve immortality\nAscend directly to the summit of Empty Peaks,\nReceive their titles, and soar into the void.\"*\n\nIt further states: \"In the Heaven of Imperial Gourds, there is the Mountain of Golden Flowers, where the Five Thearchs’ palaces stand. Five-colored clouds perpetually arise, with the sun and moon flanking its sides, and flying immortals as its winged chariots.\"\n\nThe *Scriptures of Numinous Treasure* say: \"The Supreme Dao Lord, on the Floating Mound of Yucha Mountain in the Western Heaven, sits beneath the seven-jeweled canopy of flowering trees...\" The Dao Lord then plucks the cloud-zither of the radiant dragon, its transcendent tones cascading in boundless resonance. The myriad heavens stir, purple canopies revolve in mystery, and the four assemblies of the luminous void gather. The eight paths blaze with brilliance.\n\nThe *Supreme Treasure Instructions* state:\n*\"The subtle gate of the Mysterious Origin,\nResplendent and luminous, pervades the vastness.\nThe supreme Dao arises from stillness and silence—\nTherein you shall behold the Three Pristine Palaces.\"*\n\nIt further cites the *Laozi’s Scripture of Dao and Virtue*: \"That which is seen yet formless is called *Yi*; heard yet soundless, *Xi*; grasped yet intangible, *Wei*—these are the titles of the Three Primal Lords.\" It continues: \"These three cannot be exhaustively questioned, thus they merge into the One. The Three Pristine unite as the Primal One Lord, the Primordial Father of the Three Honored Ones and the Mysterious Mother.\" Whoever reads this scripture, if two venerable lords witness it, shall attain the immortal Dao—here the Dao is complete.\n\nThe text further says:\n*\"The Great Simplicity originally has no substance,\nThe sages call it the Mysterious.\nTwo principles arise from beginning and end,\nAll things reach the abyssal spring.\"*\n\nIt also states: \"On Kunlun Mountain, the many immortals often manifest in the Central Realm. The nine heavens resound with their recitations, vast and far-reaching, their pure tones crystalline and clear. Those who hear them are enraptured, forgetting all worldly passions. When the assembly of immortals gathers, they sing of the cavernous mystery in unison. Their new melodies ring out, ethereal and distant, echoing endlessly...\"\n\nThe text further states:\n\nThe Primordial Heavenly Venerable of the Origin, seated upon the Azure Mist in the Great Fuli realm of the Azure Vault, rests where the earth is all of azure jade. The steps and pathways on all sides are adorned with gold and silver treasures, wondrous and manifold.\n\nIt also says: In the Crimson Radiance realm of the Chanli world, at the Southern Garden’s Cinnabar Terrace, within the Three Origin Cavern Chambers, the Heavenly Venerable sits upon the crimson clouds. The Perfected Celestial Spirits and the Great Cinnabar Jade Maidens gather together at the Cinnabar Terrace, where the land perpetually emanates crimson qi, resembling the hue of crimson clouds.\n\nThe method of Guarding the One requires one to eat sparingly, abstain from pork, fish, and pungent foods, and adjust one’s diet to the warmth or coolness of the four seasons without defying their nature.\n\nIn the practice of Guarding the One, one must never drink turbid wine. Turbid wine harms the essence, depletes the five viscera’s generative qi, impedes the flow of essence and qi, and obstructs the blood and vessels.\n\nThe *Scripture of the Purple Lord of the Supreme Sovereign* states: The Divine Continent lies north of the Celestial Pass, where the sun and moon revolve in their courses. To its south, the Seven Stars wheel within its bounds.\n\nThe *Scripture of the Supreme Purity* says: Contemplate the Three Origins within the Mud-Pill Palace, guard the Nine Perfected within the bodily abode. Exhale and inhale the Five Radiances, breathe the Jade Fluid. At dawn and dusk, seek transcendence in the Cavernous Void; in sleep and repose, commune with spirits in the Great Desert.\n\nIt further states: Those who uphold this shall ascend the Three Mornings and wander the Grand Empyrean.\n\nIt also says: The *Scripture of the Great Cavern* is the wondrous esoteric teaching of the Nine Heavens, the foremost scripture of the Golden Writ of the Supreme Origin Lord of the Grand Clarity. Formerly, the Central Yellow Elder Lord concealed this text, and its mysteries were known only to the Grand Mystery. Only in the Golden Tower of the Grand Mystery were there golden tablets and jade slips with purple inscriptions. Whoever reads this chapter ten thousand times shall ascend to heaven in broad daylight, ascend to the Supreme Purity, receive the scripture in the Grand Ultimate, and be appointed as a High Minister of the Lofty Ones. Yet if one possesses this scripture but does not read it, the Heavenly Emperor of the Grand Tenuity shall strike one’s name from the Register of Death, inscribe the true record, and transfer it to the Grand Ultimate. One’s name shall be engraved in the Eastern Florescence, reported to the Supreme Venerable, and recorded in the Tortoise Terrace. The myriad spirits and thousand gods shall then address the adept as the Grand Master of the Nine Mysteries, with a rank equivalent to the Immortal Earl of the Grand Clarity.\n\nThe *Scripture of the Concealed Mystery of the Five Mornings’ Golden Flower and Jade Essence* states: The *Eight Gates of the Mysterious Mother’s Wandering Intervals* says: May the Mysterious Mother be born with me amidst the generative qi, abide with me between the sun and moon, protect me within the Nine Heavens, dwell with me in the realm of spontaneity, drink with me from the Gourd River, rest with me in the Jade Perfection, sleep with me in the Immortal Hall, and wander with me among the Three Mysteries.\n\nIt further says: The Twelve Supreme Vows of the Nine Heavenly Lords, the Eight Divine Intervals of the Nine Numinous Mysterious Mother, the Great Returning Origin and Five Penetrations—calm the secret chamber, disperse incense and stove smoke, and recite the *Scripture of the Golden Flower of the Great Cavern*.\n\nThe *Inner Scripture of the Foremost Cavern Chamber* states: Kunlun stands lofty and unshaken, the abode of divine immortals. Its golden halls and jade cities, the convergence and divergence of the Nine Qi, the misty clouds and rain, the Yellow Gate and Purple Portal—all are of the most refined essence. Above, it pierces the distant mists; below, it illuminates the Nine Numinous. To the left, it connects with the Azure Palace; to the right, it flanks the Luminous Clarity. The Golden Terrace of the Eight Simplicities transforms myriad forms; the Jade Elixir settles its fluid, and the nectar of jasper arises spontaneously. The Six Harmonies’ secluded portals, the Eight Pavilions’ assembly of scriptures—within them dwells the Supreme Perfected, whose name cannot be uttered. Subtle and wondrous beyond measure, it is called the Peerless.\n\nIt also says: Formerly, Li Zhong of Chang’an understood neither other teachings nor the practice of the Great Cinnabar or the methods of the Three Origins. He only obtained this hidden method of the morning audience and guarded its practice for thirty years. Thereupon, he rode the clouds and ascended in a whirlwind to the Dark Continent.\n\nThe immortals Wang Lübing, Zhao Shuangcheng, Fan Shuyou, Guan Pinghe, Li Mingxian, An Shengzhi, and others all attained this Dao and ascended to the chambers of Kunlun, or dwelled in the Three Mystery Palace of the Dark Continent.\n\nIt further says: The Supreme Simplicity Three Origin Lords are a single Perfected Woman. She wears a floating-cloud brocade mantle of purple qi, a nine-colored dragon-feathered skirt, and a feathered crown of precious langgan adorned with morning rays. At her waist hang flowing golden fire-bells, tiger tallies, and dragon scripts. She sits in the void, and beneath her knees ever rise three clouds of cinnabar, green, and azure, luxuriantly crowning her form.\n\nThe Supreme Simplicity Three Origin Lord often chants:\n*\"The Grand Origin connects to the Jade Clarity,\nThe Three Caverns shine with lofty brilliance.\nThe Eight Effulgences revolve the morning winds,\nScattering clouds and misting the flying numina.\nThe circular wheel hurls through the empty cavern,\nGolden reflections crown the celestial essence.\nJade radiance binds the Five Elders,\nPurple mists gleam upon the auroral chariot.\nRiding the qi, I sway the mysterious chamber,\nMy golden form illumines the Nine Auroras.\"*\nThis is the hymn of the Upper Palace of the Jade Clarity.\n\nThe *Scripture of the Jade Dawn Luminous Mirror* states: The White Simplicity Right Origin Lord is the mother of the White Origin Cavern Yang Lord and the child of the Supreme Simplicity Three Origin Lords. Her name is Stimulating Brightness, her cognomen is Upper Golden Gate. From her mouth, she constantly exhales white qi, called the Jade Dawn White Treasure’s Generative-Soul Qi, which suffuses my body and renders one an immortal, deathless.\n\nThe Yellow Simplicity Central Origin Lord is the mother of the Central Yellow Elder Lord and the child of the Supreme Simplicity Three Lords. Her name is Round Flower Yellow Blade, her cognomen is Supreme Great Flourishing, and her title is Yellow Simplicity Lofty Origin Lord. She possesses a body of yellow gold and exhales yellow qi from her mouth, called the Jade Dawn Yellow Treasure’s Great Numinous Generative Qi of the Five Viscera, which suffuses my body and enables one to ascend as a flying immortal to heaven.\n\nThe Purple Simplicity Left Origin Lord is the mother of the Primordial Simplicity Lord and the child of the Supreme Simplicity Three Origin Lords. Her name is Concealing Transmission of the Nameless Blade, her cognomen is Upper Peaceful Advent. Her divine mirror surveys the eight directions, and her countenance is that of a young child. From her mouth, she exhales purple qi, called the Jade Dawn Purple Treasure’s Life-Embryo Flowing-Aurora Radiance, which suffuses my body and enables one to ascend at dawn to the Upper Palace of the Jade Clarity.\n\nThis is an excerpted passage; the full text is contained in the original scripture.\n\nMoreover, it is said: Behind the necks of the Three Simplicity Origin Lords, each bears a precious radiance. Their solar qi displays nine colors, and their circular luminosity shines resplendently within the Golden Flower Grotto-Chamber, illuminating the entire room. The Three Simplicity Origin Lords each exhale qi as described above, and the three qi converge, intertwining and coalescing to form a sun-like image, nine inches in diameter, within the Golden Flower Grotto-Chamber.\n\nIt is further said: The Supreme Jade Dawn’s Nine Subtleties guide the mist, the Five Elders scatter their radiance, the Eight Numinous Gates give birth, the Three Simplicity Precious Qi, the Supreme Mystery Jade Dawn, the Golden Flower Feminine One—within it lies the Purple Origin. The seven and nine merge and transform, ascending through the clouds, the threefold ascent of the three qi, entering emptiness and issuing forth cinnabar. Constantly accompanying the Purple Simplicity, they together rank among the Jade Immortals.\n\nThe *Scripture of the Feminine One of the Great Cavern, the Five Elder Thearchs of the Supreme Ultimate, and the Five Viscera’s Life-Securing* states: The Supreme Ultimate Golden Flower Perfected Person inscribed this scriptural text upon the eastern wall of the Jade Numinous Palace in the Purple Tenuity Palace of the Heavenly Thearch. The text reads: The five qi arise from different directions, their effulgences merging with form. Some end in death, some begin in life. The myriad kinds return to their root, the thousand threads converge in darkness. Qi drifts like floating mist, blood rushes like flowing clarity. Alas, the portents of the body!\n\nThereafter, it is recorded in the cinnabar methods and ingestion formulas. The Southern Marchmount Perfected Person also said: Among my disciples who entered the chamber, there was the immortal Zhao Chengzi. When he first received my *Scripture of the Five Viscera’s Life-Securing*, he practiced it accordingly. Later, Chengzi wished to reenter the Great Yin to seek transformation of his appearance and form. He feigned death in the dark hills of Shanggu in Youzhou, beneath a stone chamber. Five years after his death, a mountain traveler saw his white bones in the chamber, his exposed skeleton lying in the dim room. Yet his five viscera remained intact within his abdomen, unrotted as before, their five-colored blossoms gleaming within. The mountain traveler sighed and said: \"Of old, I heard that the five viscera could be nurtured to achieve imperishability. Now I behold one whose white bones bear blossoms within his chest—this man must have possessed the Dao but did not complete it, or perhaps failed some intermediate trial.\"\n\nThereupon, he reached out and parted the remains, seeing within the five viscera a white stone each, securing the five-colored blossoms in their proper places. The traveler said: \"That your five viscera remain imperishable must be due to these five stones that generate the blossoms. You have already perished in the Dao; let me join you.\" He then took and swallowed them. Four or five years later, when Chengzi’s corpse was due to revive, the traveler, having already ingested the stones, found that on the morning of Chengzi’s revival, the five stones flew from his mouth like cicadas, accompanied by faint thunder. The five-colored brilliance pierced the sun as they returned directly to the viscera of the dead man. Thereby, Chengzi transformed his appearance and arose, as if from a single night’s drunken slumber. The traveler, his mind seized with terror and confusion, fell gravely ill. He entered the mountains to seek the place where the corpse had lain. Arriving before the stone chamber, he saw Chengzi reclining and whistling in the grotto. His face bore a jadelike glow, and he asked: \"Who are you?\"\n\nSuddenly, five Elder Immortal Lords appeared, wearing brocade sashes and talismans, holding feathered tablets, their heads crowned with purple coronets. They addressed Chengzi, saying: \"This is the man who stole and swallowed your five visceral treasure-stones.\" As soon as they spoke, the traveler’s face erupted with malignant sores, and he was struck dumb. By the time he returned home, the leprous ulcers had spread over his entire body. His entire household, young and old, died simultaneously, and his clan was thus extinguished.\n\nIt is also said that those who regularly ingest the essences of the sun and moon should frequently eat bamboo shoots. Bamboo shoots are the embryo of the sun’s radiance, also called Great Brilliance. They should also frequently eat the flesh of swans, which are the feathered birds of the moon’s embryo, also called Moon Herons. To ingest the sun and moon, one should consume these things, for their qi resonates and communicates.\n\nThe Perfected Person of the Great Void said: \"Swan\" is the general name for the feathered tribes. Magpies, geese, swans, and crows are all called \"swan-herons.\" An ancient song says:\n*\"Swan-herons of a thousand years,\nAs viands they summon celestial perfected ones.\nThe Five Thearchs hold moon’s radiance in their beaks,\nSeated in rows as guests in the empty sky.\"*\nThis is an ancient fisherman’s song.\n\nThe *Scripture of the Jade Dawn’s Luminous Mirror* says: Further, visualize the names of the five spirits, each seated securely in its palace. The five spirits all exhale purple qi, which coils around my body until inner and outer merge in darkness, and hands and feet are no longer visible.\n\nAlso visualize the sun and moon emerging from my cheeks—sun on the left, moon on the right—with their twofold radiance penetrating and illuminating. Thereupon, the purple qi suddenly clears. Gradually visualize the sun ascending and entering my mouth, which then consumes it, tasting like maltose. Swallow nine times and stop.\n\nAlso visualize the moon entering my navel, directly above the Gate of Destiny, its light descending to illuminate the Yin Chamber. Then visualize my hand grasping the handle of the Northern Dipper’s seven stars, wearing it as I walk. Enter the Purple Chamber within the Supreme Tenuity, and behold the Thearch, who says: \"You have attained divine transcendence. I bestow upon you the Azure Jade Talisman, inscribed upon the heavens of the Nine Realms.\"\n\n*\"Within the coiled ninefold mystery,\nRising and sitting upon the clouds’ radiance,\nThe five talismans are entrusted to the Thearch’s son,\nWho ascends and returns to the Flowering Infant.\"*\n\nIt further says:\n*\"The three and five oppose each other,\nHeaven covers, earth begins.\nI possess the five talismans,\nWhich ascend to the Thearch’s son.\nThe Three Non-abiding remain long,\nWithin the Chamber of the Celestial Camp.\"*\nThe above is from the *Scripture of the Five Elders and the Feminine One*.\n\nThe *Inner Chapters of the Mysterious Wondrous* says: The Supreme Lord said: The original Dao fundamentally arises from the Non-prior. It is the ancestor of the myriad qi, the origin of the myriad ways. Above the Void and Nothing, prior to Non-being, without form or image, neither existent nor non-existent, it is honored as having nothing above it, its nobility beyond compare.\n\nThe *Scripture of the Jade Dawn’s Luminous Mirror* says: The Scripture of the Cavern Realms of the Supreme One Thearch’s method for visualizing the five spirits also involves visualizing the spirits of the Supreme One, the Non-Brave, the White Prime, the Controller of Destiny, and the Peach Lord—altogether five female spirits—and nine male spirits, named the Three, Five, Nine, and Seven. When ascending to the Gate of Mystery, their forms and appearances all resemble those of newborn infants. The five females and nine males each exhale white qi from their mouths, mutually suffusing the practitioner’s body. Thereupon, the five females and nine males merge with the practitioner’s single body, blending into one. They become a single white qi, round in shape, resembling the sun’s radiant orb. In an instant, the round luminosity of the white qi transforms into two small children, one male and one female, both resembling newborn infants. The male is called the Perfected of the Nine Origins, the female is titled the Soul of the August One. The male is named Restraining Control, styled Three Yang; the female is named Ascending Return, styled Thearch’s Son.\n\nIn an instant, visualize the boy Restraining Control and the girl Ascending Return standing together within the sun and moon—the boy within the sun, the girl within the moon. The sun and moon hang in the august heavens, the sun in the east, the moon in the west. At that moment, one suddenly perceives one’s entire body as having transformed into the aforementioned white *qi*.\n\nThen, visualize hearing the boy Restraining Control within the sun chanting:\n*\"Restraining Control, Three Yang,\nPerfected of the Nine Origins—\nsuch is my title.\nThe sun binds my form,\nmy tally inscribed in Jade Clarity,\nkindred to heaven.\nMerging yin and yang,\nimmortals entwine in ecstasy.\"*\n\nNext, visualize hearing the girl Ascending Return within the moon chanting:\n*\"Ascending Return, Thearch’s Son,\nSoul of the August One—\nsuch is my title.\nThe moon binds my essence,\nmaster of the tally’s register,\nalready within Great Brilliance.\nKindred to the Mysterious,\nlife spans ten thousand myriad ages.\nMerging yin and yang,\nnaked in radiant splendor.\"*\n\nThe *Inner Transmission of Emperor Wu of Han* states: The Queen Mother of the West bestowed upon the Emperor the *Illuminated Scripture of the Five Marchmounts’ True Forms*, while the Lady of the Supreme Prime granted him the *Twelve Methods of the Six Jia Spirit-Flight Summoning the Perfected*, and so forth. There were also the arts of \"treading the void and pacing the Mysterious,\" along with various essential and wondrous incantations. The Emperor personally compiled these into a single scroll, together with all the teachings he had received. These were all presented upon a table of yellow gold, sealed in a casket of white jade, placed upon a bed of coral, and encased in a purple brocade sack. They were stored in the □ Liang Terrace, where he would daily pay homage, burning incense and sweeping the grounds. Later, the Emperor’s intentions strayed, and he failed to uphold the utmost precepts, disregarding the Queen Mother’s words in every matter. Thus, the Queen Mother never returned. In the era of Great Beginning, without year, a celestial fire burned the □ Liang Terrace, and the twelve received teachings were lost in the flames.\n\nThe *Scripture of Transforming Form, Concealing Radiance, Ascending, and Preserving Immortality* states: Visualize the Nine Dawn Lords and their hidden consorts, the Nine Yin Inner Names—their forms, colors, and attire—all made luminously manifest as they descend from the Northern Dipper. Their blazing radiance suffuses the void, resplendent and boundless, turning the spirit to reflect the Mysterious, entering my body. The Nine Dawn Lords are the essences of the nine stars.\n\nThe *Scripture of Purple Ascension and Blazing Radiance* speaks of the same.\n\nThe *Declarations of the Perfected* states: The Lady of South Marchmount said that the *Scripture of Treasuring the Spirit* was a text from the brocade pouch of Pei Qingling, which her attendants always carried. Pei had once received this scripture from the Lady of Purple Tenuity, and I also possess a copy transcribed in the Western Palace’s definitive edition.\n\nWhen asked about the location of the Western Palace, she replied: It is the terrace above the Western Jade of the Northern Altar of the Mysterious Garden. All the celestial treasures and sacred writings are stored therein.\n\nPei the Perfected also said that these texts align entirely with the essentials of the *Hidden Perfected*, and may be employed immediately. Another name for them is the *Seven Hidden Mysterious Writings*.\n\nThe *Declarations of the Perfected* states: On the night of the twenty-fourth day of the sixth month, the Lady of Purple Tenuity, Queen Wang, descended and came to earth, whereupon she was asked about the clouds of true numina. Humbly seeking instruction in these obscure matters, she was bidden to sit again. Then, □ commanded the writing of this response:\n\n*\"To drift upon the empty and mysterious,\nno path can be traced.\nWords uttered in the void,\nnothing to grasp.\nThus, unbound by the primal stream,\none surrenders to the wind’s oar.\nAbiding in the empty boat,\none travels—\nhence, the emptiness within the real,\nthe formlessness within being.\nAs for the manifestation of written traces,\nthey are merely brushed upon paper and bamboo...\"*\n\nMortal remains, though exposed, may yet advance or retreat with the world, yet above they tarnish the odes of transcendent recluses, and below they breach the prohibitions of separation. Such is not the conduct of our kind, nor is it permitted by the numinous laws. Pray, let me explain the origins of writing.\n\nOnce creation had begun, the five colors first sprouted, and the patterns of literature were fully established. With the differentiation of peoples and the separation of yin and yang, there arose the *Scriptures of the Three Origins and Eight Meetings*, the *Flying Writings of the Myriad Directions*, and the *Luminous Chapters of the Eight Dragons’ Numinous Seal-Script*. Later, in the age of the Three Sovereigns, the *Eight Meetings* were expanded into the *Dragon and Phoenix Chapters*, the traces of *Cloud-Simplified Seal-Script* were refined into *Brahmā Writing of Conforming Forms*. Divided and broken, the true was corrupted for the sake of ease, branches were matched to roots, and thus arose the sixty-four kinds of writing. These were then disseminated throughout the thirty-six heavens and the ten directions above and below.\n\nUpon examination, the *Eight Meetings* are the most authentic of writings, the ancestors of literary composition. Today, the *Scriptures of the Three Origins and Eight Meetings* are used by the Jade Thearch, the Supreme Ultimate, and the various perfected immortals. The *Luminous Chapters of Cloud Seal-Script* are the characters seen in the talismanic writings of gods and spirits.\n\nThe *Declarations of the Perfected* states: The Lady of South Marchmount told her disciples that on the morrow she would journey to the Pure Void Palace on Mount Wangwu, so that they might know her destination.\n\nThe *Declarations of the Perfected* states: The Perfected Consort of Purple Clarity sat for a long while without speaking. In her hand, she first held three dates—hued like dried dates but elongated in shape, without pits, and tasting not of dates but somewhat like pears. She first gave one to [the disciple], then gave one to the Lady of Purple Tenuity, keeping one for herself. After all had eaten, the Perfected Consort asked about Nian Deng’s age, and so forth.\n\nThe Perfected Consort further said: \"Your teacher, the Lady of South Marchmount, wields authority as Controller of Destinies. Her Dao is lofty and wondrously complete—truly the ancestral font of virtuous power.\"\n\nThe *Declarations of the Perfected* states: On the night of the twenty-sixth day of the sixth month, eight perfected beings descended: the Lady of the Left of Purple Tenuity, the Perfected Consort of the Nine Flowers of the Supreme Palace, the Controller of Destinies and Lady of South Marchmount, the Perfected Lord of Purple Yang, the Perfected Lord of Pure Numen, the Lord of the Central Mao, and the Lesser Lord of the Mao. There was also a spirit, youthful and well-composed, wearing a lotus crown and a vermilion robe, girded with a sword, whom I had never seen before. I secretly suspected him to be Wang Ziqiao, the Perfected of Tong□ Mountain. Much was discussed regarding matters of Mount Jinting, though many things were incomprehensible. Gongxuan is the Perfected Consort of the Nine Flowers of Purple Tenuity—all bowed in reverence.\n\nThe Perfected of the Upper Offices said: \"Yesterday, I went with Shu Shen to the Palace of Pure Vacuity to examine the successes and failures of those who have attained true transcendence. Recently, forty-seven were abruptly removed, and only three were restored to the registers. We also reviewed the name-slips of your cohort—now things are well. Xu [so-and-so] is included among the *bozha*, and Xu [so-and-so] is the name of the Chief Scribe.\n\nThe fruit of the rosy clouds is the essence of the sun, and the rosy clouds are the radiance of the sun. Though you have heard of the method of ingesting the sun’s fruit, you have not yet known the art of consuming the rosy clouds’ essence. The scriptures on consuming rosy clouds are most secret, yet the way to summon them is quite simple—this is the method of embodying jade-light and reflecting the rosy clouds of the Upper Clarity.\n\nThe eyes are the body’s mirrors, and the ears are the body’s windows. Too much seeing dims the mirror, and too much hearing darkens the windows. I possess the whetstone to polish mirrors and the technique to unseal windows—with these, you may penetrate the myriad spirits and perceive the faintest echoes. Is this acceptable?\"\n\nThe *Zhen’gao* states: \"The Wilds of Lang are the precincts of Langfeng. Atop Kunlun lie the Nine Offices, which are the Nine Palaces, with the Great Ultimate as the Grand Palace. All immortals are merely the functionaries of the Nine Palaces, while the Perfected are the dukes and ministers of the Nine Palaces.\n\nThe offices of transcendents have ranks, each with its proper order. There are left and right bureaus of transcendents, with left and right dukes, left and right ministers, left and right grand masters, and left and right censors. Those who master the Great Cavern are the ministers of transcendents; those who ingest golden elixirs are the grand masters; those who consume magic mushrooms are the censors. If one obtains and consumes the Hidden Mushroom of the Great Ultimate, one becomes the Left Duke of Transcendents and a Perfected.\n\nThe Perfected said: \"People follow worldly customs in seeking vain reputations—it is like burning incense: though many smell its fragrance, they do not know that the smoke, once its flame is spent, disperses and vanishes. When fame is established, the person perishes. Thus, the lofty withdraw and remain in purity.\"\n\nThey also said: \"It is like racing an ice-chariot across the fiery lands of the south or sailing a fire-boat upon drowning waters. Without true rectitude, failure is certain in ten thousand cases out of ten thousand.\"\n\n*The Declarations of the Perfected* states: Zhang Jiangzi and others were initially ranked in the second grade, having only just entered the Palace of Easy Transitions. The Palace of Easy Transitions and the Youthful Prime Palace are the halls and chambers of the Dao of man and woman. Within them, all is serene and tranquil. The Azure Lord of the Eastern Sea visits twice a year, inspecting these palaces and observing the assembled multitudes.\n\nZhao Sutai has dwelled in the Palace of Easy Transitions for four hundred years and refuses to move, declaring that nowhere in the world brings greater joy than this place. Sutai was the daughter of Zhao Xi, who served as Inspector of Youzhou during the Han. Xi aided the destitute in the Yellow River, rescued Yu Hui and others from the execution of their clans, and performed countless acts of hidden virtue. Thus, he himself attained the Vermilion Mound, and his descendants now dwell in the Grotto-Heavens. Xi frequently enters and exits the Palace of the Register of Destinies.\n\nAmong those in the Palace of Easy Transitions who have attained lofty merit yet remain in quiet obscurity are Dou Qiongying, Han Taihua, Liu Chunlong, Wang Jinxian, Li Xizi, and Guo Shuxiang. These individuals possess natures of dense elegance, their aspirations pure and distant, their talents surpassing all comparison, their bearing awe-inspiring to the multitude. They are the most exalted among the stewards, the most capable among the transcendents’ officials. Those of the next rank include Zhang Jiangzi and her peers. Deng Boniao’s mother performed many virtuous deeds, and thus later arrivals often seek her patronage and protection.\n\nDou Qiongying was the younger sister of Dou Wu. Her seventh-generation ancestor, a man named Zhi, made it his life’s work to gather dry bones and restore the dead to life. Thus, his blessings extended to Qiongying’s own lifetime.\n\nHan Taihua was the younger sister of Han Anguo and the wife of Li Guangli, the Han general of the Second Campaign against Dayuan. Guangli had accumulated merit and virtue in past lives, and he now resides in the palace undergoing transformation.\n\nLiu Chunlong was the daughter of Liu Fengxian, the Han Minister of the Imperial Clan.\n\nLi Xizi was the grandmother of Li Zhong, who served as Grand Administrator of Dongping during the Jin. Zhong’s grandfather (and others) performed many acts of hidden virtue. Once, during a great snowstorm, he scattered grain in the garden courtyard, fearing the birds would starve. Such was the depth of his compassion.\n\nWang Jinxian was the daughter of Wang Yan.\n\n[Her] affairs were overseen by Attendant Xu.\n\nGuo Shuxiang was the mother of Wang Xiu. Wang Xiu, styled Shuzhi, was a native of Beihai. During the Wei, he served as Cavalier Attendant-in-Ordinary to the Martial Emperor. At the age of seven, he lost his mother, who passed away on the day of the She Festival. It was not known to whom among the Guos she belonged.\n\nIn his youth, the prefectural office had Wang Shaodao, Fan Shusheng, and Li Boshan, all paragons of the prefectural office in their youth.\n\nThe *True Records* states: Lang Zong, styled Zhongsui, was a native of Anqiu in Beihai. In his early years, he served as Magistrate of Wu County. His studies delved deeply into the Daoist arts, and he was skilled in divining the winds and qi. One day, a sudden gale swept through his window. Upon divination, he knew that a great fire would burn the Great Xia Gate in the capital. He sent someone to verify, and indeed, it was so. When the various lords heard of this, they summoned Zong as a Academician. Ashamed to be summoned for his divination skills, he removed his official seal and sash by night, shouldered his satchel, and fled. He dwelled beneath Mount Hua, ingested sesame pills, and attained the Dao. He now resides within the grotto.\n\nThere was also Zhu [missing character], a native of Chenliu. He was a man without the Way, devoted solely to robbery and banditry. Later, when his crimes were discovered, he fled far away to another region. Arriving at Mount Shaoshi in Runan, he encountered Master Feng, who lived in reclusion and studied the Dao. After three years, he was transmitted the true Dao. Remaining on the mountain to ingest herbs and cultivate the Way for thirty-eight years, he later entered Mount Dongkeng. At the age of one hundred and forty-seven, immortals descended and led him into the grotto of Mount Dayou, where he became a perfected one.\n\nThere was also Guo Jing, a native of Yingchuan. Orphaned in his youth, at the age of sixteen, he was summoned by the county to serve as an official. Later, he committed a minor offense and fled into hiding, remaining secluded for two months. He then encountered Master Zheng. Jing thereafter followed Zheng, serving him for seven years without敢懈怠. He was transmitted the essentials of guiding and pulling, ingested mountain herbs and *fuling*, and attained a lifespan of three hundred years. Later, in Mount Tianwei, Master Red Pine descended and transmitted to the two of them the true Dao. They now reside in the grotto of Mount Dayou as perfected ones.\n\nIt further states: Sima Jizhu later entered the stone chamber of the Dayou Palace in Mount Weiyu, where he received from Xiling Zidu the method of \"Concealing the Radiance and Transforming the Form with Stone Essence and Golden Light.\" Zidu was a transcendent maiden of the Great Mystery. Those who, in the same era, now reside in the Dayou chamber include Bao Shuyang of Guangning, Wang Boyang of Taiyuan, Liu Weihui of Yingchuan, and Duan Jizheng of Daijun, all of whom received the Way from their master, Xiling Zidu.\n\nAs Jizhu was about to depart, he left behind his form upon the pillow and mat as a likeness to replace himself. His tomb lies south of Mount Shengpan in Chengdu of Shu Commandery. In former times, Marquis Wu of Shu, Zhuge Liang, erected a stele before Jizhu’s tomb to inscribe his virtue. At the end of the stele’s eulogy, it reads:\n\nThe profound desert, the great stillness,\nMerging yin and yang,\nHeaven and earth intermingle,\nMyriad beings flourish and manifest.\nThe master ordered the milfoil,\nDistinguishing the soft and hard.\nSpirits and gods beheld,\nThe Six Perfections shone clearly.\n\nJizhu’s complexion was like that of a young maiden, his beard and sideburns those of the Three Heavens, black as ink.\n\nLet two disciples, one male and one female, each cultivate the Dao. The male is named Ru Yu, and the female is named Ji Hua. Both now reside within Mount Weiyu, where Ji Hua today is reciting the Thirty-Nine Chapters, though she has yet to complete them.\n\nThe *Preface to the Formulae of Master Pei* states: Master Pei, styled Xuanren, was dignified and unadorned in his youthful appearance. His eyes shone with a luminous essence, his arms hung past his knees, and his voice was resonant and clear, ringing like a struck bell.\n\nThe *True Reports* says: The trees of fire-jujubes and intersecting pears grow within your heart. Yet now, thorns and brambles are tangled among them, which is why the two trees remain unseen. I wonder if one might prune the brambles to reveal the trees—these trees grow alone, and how fine they would be!\n\nThe *Hidden Formulae for Ascending Perfection* states: Within the Purple Prime of the Grand Tenuity dwell twenty-four inner spirits, born of generative qi and transformed into numinous beings. They govern the essence of transcendence. Those who cultivate and invoke their names will govern and guard the primordial essence of the body. The Purple Void unites with the mysterious origin of conjoined qi, forming the vessel of embodied spirit. They guide clouds and mist, gird themselves with the true smoke of life, and each may summon jade chariots and dragon-riders, arrayed in ranks of thousands. Together, they ascend as one, mounting the dawn in broad daylight. This is the Way of the Great Perfected, who ride the whirlwind and vanish in an instant. After eighteen years of practice, the Most High commanded the Lord of the Grand Tenuity and Blended Numinosity to dispatch the twenty-four perfected ones. With a thousand chariots and ten thousand riders, they galloped upon the wind and trod the clouds, inhaling and exhaling to ascend in flowing ascent, entering the celestial registers in broad daylight.\n\nAccording to the *Scripture of the Three Ones*: Within the Grand Tenuity dwell twenty-four qi, and within each qi resides a perfected one, all ministers of the Thearchs. Through them, the Dao achieves its manifold transformations.\n\nOnce one has attained the Three Ones within the body, the Three Ones of the Grand Tenuity—the Lords of the Thearchs—will descend and manifest externally, speaking with you. They come and go from the Supreme Clarity, resting within the Grand Tenuity. As this text states, by guarding the Three Sections within the body, one may also summon those twenty-four perfected ones, who will arrive with a thousand chariots and ten thousand riders to welcome you.\n\nThe dragon on the left of the sun is named Whirlwind Essence, and the dragon on the right is named Vanishing Pavilion. Visualize the two dragons exhaling white mist, and not only will your own spirit-perfected ones ascend the mysterious heavens.\n\nThe *Inner Biography of Lord Ge the Immortal* records: My uncle, Xiaoxian, said, “You have transcended worldly tastes, forsaken splendor for the Dao, and aspired to immortality—this is the noble pursuit of the loftiest perfected ones.”\n\nThe *Jade Grove Scripture of the Supreme Clarity’s Immortal Courts* is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清仙府琼林经 经名：上清仙府琼林经。 撰人不详，约出於南北朝。 系摘抄《大洞真经》《真诰》《登真隐诀》等上清派修行经诀而成。 一卷。 底本出处：《正统道藏》正一部。 上清仙府琼林经 经云：天有玄一，生於太阳，名为流珠，众妙之门，得而留之，可得长生。 人有三一，其居不同，兼能守之，可为仙王也。 一在北极太渊之中，前有明堂，下有绛宫，上有华盖，玉楼万重。 又云紫阳真人曰：吾昔学道，受三一真名於中岳真人苏子玄，子玄授吾守一之法，凡二百余事，吾奉而行之，为上清真人，其道至真。 又曰：二十四气以应太微二十四真，其有千乘万骑，羽盖云车，以合紫宫上清元图，若守之弥固，精应感畅，则三一可见，三一可见则千乘万骑见矣，羽盖可御，云车可乘，上造太微，混二十四气，见二十四真，飞行上清，列名元图，此白日升天，兼行洞房之道也。 又曰：上一真之极也，中一真之至，下一真之妙也。 天皇得极故上成皇极，地皇得至故上成正一，人皇得妙故上成众妙之君。 三皇体真以守一，故一无藏形，仙人寻真以求一，故三一俱明。 一无藏形，其真极也，三一俱明，得一而已。 《上真始生变化元录》曰：皇上开真，九道合明，变炼元虚，洞映上清，分形化景，四运顺生，八景扶翼，运致丹軿，乘云驾烟，策御上清，飞行云房，朝谒帝京。 又曰：凡修九天真王之道，常以冬节之日，沐浴入室，西向九拜，朝九天真王，自然得乘九色云舆，飞行上清。 又曰：九天上灵，元始自然，云云。 中宝紫元，三素外缠，云云。 洞化入微，我道早分，目招灵晖，心披五云，乘策八景，飞入帝晨。 又曰：含真胤气，形秀紫天，乘云驾浮，浴景八烟，云云。 得乘霄軿，飞升玉晨。 又曰：琼琳七映之宫。 又曰：内为含仙灵，外炼真容，玉池华露，泽流紫房。 又曰：太上玉晨，回景虚明，分形变合，九炼三真。 又曰：上元太素三元君晨华之气祝文曰：三素回天元，清霄翼玉灵，云云。 太霞虽云辽，洞映鉴有情，相与携玉契，同期九天軿。 又曰：太素策运，四景虚飞。 又曰：皇清摽晨晖，灵气翼虚迁，飘飘九元上，靡靡入帝晨。 又曰：四老中真，散花云房。 又曰：玄晨带高灵，总真御八清，玉华披丹房，紫凤曜云营。 又曰：我乘日吉，上告帝灵，求仙升飞，得御流軿。 又曰：紫皇元初，道合玄虚，三变九分，混化太初，飞云流辅，苍盖绿舆。 又曰：天夜朗清，幽虚启真，流云徘徊，金花四骞，丹皇敷晖，云飞紫轩。 《太上玉经宝诀》曰：上升玉清中，邀晏九遐外。 又曰：灵风扇华香，粲烂开繁矜，太真抚云璈，众仙弹灵琴，雅歌三天景，散惠玉华林。 又曰：学道由丹信，奉师如至亲，挹景偶清虚，孜孜随日新，竦身陵太清，超景逸九霄，保元持法纲，游玄适逍遥，万劫犹昨夜，千椿如晨朝，灵幡顺风散，繁想应时消。 《太洞真经》曰：太宴绝九玄，洞景寄神通，玉帝乘朱霄，绿霞焕金墉，上馆云珠内，仰投元刃峰。 又曰：流珠停晖，紫霞踊烟，七度回路，三光映真。 《太上素灵洞玄大有经》曰：耽栖灵洞，宴景七晨，澄洒华园，息憩九玄，变景玉虚，携领诸天。 又曰：太真阴神，号曰女灵，变景九玄，乘真隐冥，运致飞霞，上造帝庭。",
      "translated_text": "**The Upper Clarity Jade Grove of the Immortal Palaces Scripture**\n\n**Scripture Title:** *The Upper Clarity Jade Grove of the Immortal Palaces Scripture*. Author unknown, approximately composed during the Northern and Southern Dynasties. Compiled from excerpts of the *Great Cavern Perfected Scripture*, *Declarations of the Perfected*, *Concealed Instructions for Ascending to Perfection*, and other Upper Clarity School cultivation scriptures and methods. One scroll. Base text from: *The Orthodox Daoist Canon*, Zhengyi Section, First Subsection.\n\nThe *Upper Clarity Jade Grove of the Immortal Palaces Scripture* states:\n\nHeaven possesses the Mysterious One, born of the Great Yang, named the Flowing Pearl, the gate of all wonders. To obtain and retain it is to attain longevity.\n\nHumans possess the Three Ones, each dwelling in different places. To master and guard them all is to become a King of Immortals.\n\nOne resides in the North Pole’s Great Abyss, before which lies the Hall of Light, below which is the Crimson Palace, above which is the Floral Canopy, with jade towers of ten thousand layers.\n\nIt further states: The Perfected Purple Yang said, \"In my early Daoist studies, I received the true names of the Three Ones from the Perfected Su Zixuan of Mount Song. Zixuan taught me the method of guarding the One, comprising over two hundred matters. I practiced them faithfully and became a Perfected of the Upper Clarity. That Dao is most authentic.\"\n\nIt further says: The twenty-four qi correspond to the Twenty-Four Perfected of the Great Tenuity. With a thousand chariots and ten thousand riders, feathered canopies and cloud-borne carriages, they unite with the Primordial Chart of the Purple Palace and Upper Clarity. If one guards this with unwavering firmness, essence responds and resonance flows unimpeded, then the Three Ones may be seen. When the Three Ones are seen, the thousand chariots and ten thousand riders appear, the feathered canopy may be mounted, and the cloud-borne carriage may be ridden. Ascending to the Great Tenuity, merging the twenty-four qi, one beholds the Twenty-Four Perfected, soars through the Upper Clarity, and is listed in the Primordial Chart. This is the way of ascending to heaven in broad daylight, concurrently practicing the Dao of the Grotto Chambers.\n\nIt further says: The Upper One is the utmost of the true, the Middle One the perfection of the true, the Lower One the subtlety of the true. The Heavenly Sovereign attained the utmost and thus ascended to the Imperial Ultimate; the Earthly Sovereign attained perfection and thus ascended to the Orthodox One; the Human Sovereign attained subtlety and thus ascended to become the Lord of Myriad Wonders. The Three Sovereigns embodied the true to guard the One, thus the One conceals no form. Immortals seek the true to pursue the One, thus the Three Ones are all illuminated. When the One conceals no form, its true nature is utmost; when the Three Ones are all illuminated, it is simply the attainment of the One.\n\nThe *Original Record of the Upper Perfected’s Birth and Transformations* states: The August Emperor opens the true, the nine ways unite in clarity. Refining the primordial void, illuminating the Upper Clarity, dividing forms and transforming radiance, the four movements follow generation. The eight effulgences support and assist, conveying the cinnabar carriage, riding clouds and driving mist, urging on to the Upper Clarity, soaring through the cloud chambers, and paying court to the Imperial Capital.\n\nIt further says: For those cultivating the Dao of the Perfected Kings of the Nine Heavens, regularly on the winter solstice, bathe and enter the chamber, face west and bow nine times, and pay homage to the Perfected Kings of the Nine Heavens. Naturally, one may ride the nine-colored cloud chariot and soar to the Upper Clarity.\n\nIt further says: The upper spirits of the Nine Heavens are primordially spontaneous... The Central Treasure of Purple Primordiality, the Three Purities externally entwined...\n\nPenetrating transformation enters the subtle; my Dao was early apportioned. The eyes summon numinous radiance; the heart unfolds the five clouds. Urging the eight effulgences, I fly into the imperial dawn.\n\nIt further says: Embracing the true and inheriting qi, the form excels in the purple heavens. Riding clouds and driving the floating, bathing in the radiance of the eight mists...\n\nObtaining the carriage of the empyrean, ascending to the Jade Dawn.\n\nIt further says: The sevenfold-luminous palace of jade and forest.\n\nIt further says: Internally, one contains the numinous immortal; externally, one refines the true countenance. The Jade Pool’s floral dew flows and moistens the purple chamber.\n\nIt further says: The Supreme Jade Dawn, revolving radiance in the empty clarity. Dividing forms and transforming convergence, ninefold refinement of the Three Perfected.\n\nIt further says: The prayer text for the qi of the Morning Brilliance of the Three Primordial Lords of the Upper Primordial and Great Simplicity states: The Three Purities revolve the primordial heavens; the clear empyrean supports the Jade Numinous...\n\nThough the great rosy clouds stretch afar, the penetrating radiance discerns the affectionate. Together we carry the jade tally, jointly awaiting the carriage of the Nine Heavens.\n\nIt further says: The Great Simplicity urges the movement; the four effulgences fly in the void.\n\nIt further says: The August Clarity marks the morning radiance; the numinous qi supports the void’s ascent. Drifting, drifting to the Nine Primordials above, gently, gently entering the imperial dawn.\n\nIt further says: The Four Elders and Middle Perfected scatter flowers in the cloud chambers.\n\nIt further says: The Mysterious Dawn girds the lofty numinous; the Perfected Governor of the Eight Clarities. Jade brilliance unfolds the cinnabar chamber; the purple phoenix illuminates the cloud encampment.\n\nIt further says: I ride the auspicious day to ascend and report to the imperial numinous. Seeking immortality and ascending in flight, I obtain the carriage of flowing radiance.\n\nIt further says: The Primordial Purple Sovereign, the Dao harmonizes with the mysterious void. Three transformations and nine divisions merge and transform the Great Beginning. Flying clouds and flowing supports, the azure canopy and green carriage.\n\nIt further says: The night sky brightens and clears; the hidden void reveals the true. Flowing clouds linger; golden flowers scatter in four directions. The Cinnabar Sovereign spreads radiance; clouds fly to the purple carriage.\n\nThe *Jade Scripture Precious Instructions of the Supreme* states: Ascending to the Jade Clarity within, roaming and feasting beyond the Nine Distant Realms.\n\nIt further says: The numinous wind fans the floral fragrance; resplendent and brilliant, unfolding luxuriant finery. The Great Perfected plucks the cloud zither; the assembled immortals play the numinous harp. Refined songs of the Three Heavens’ effulgences scatter blessings in the Jade Floral Grove.\n\nIt further says: Learning the Dao depends on cinnabar sincerity; serving the master as one’s closest kin. Drawing radiance to pair with the clear void, diligently renewing with each day. Rising to ascend the Great Clarity, transcending radiance to roam the Nine Empyreans. Preserving the origin and upholding the Dharma’s net, wandering the mysterious and attaining carefree ease. Ten thousand kalpas are like last night; a thousand kalpas like this morning. The numinous banner scatters with the wind; myriad thoughts dissolve in due time.\n\nThe *Great Cavern Perfected Scripture* states: The Great Feast transcends the Nine Mysteries; the grotto radiance entrusts spiritual communion. The Jade Emperor rides the vermilion empyrean; green rosy clouds adorn the golden walls. The upper palace within the cloud pearls, gazing upward to the Primordial Blade Peak.\n\nIt further says: The Flowing Pearl halts its radiance; purple rosy clouds surge in mist. Sevenfold revolving paths; the Three Luminaries illuminate the true.\n\nThe *Supreme Primordial Cavern Mystery Great Possession Scripture* states: Dwelling in the numinous cavern, feasting in the radiance of the seven dawns. Clarifying and sprinkling the floral garden, resting in the Nine Mysteries. Transforming radiance in the Jade Void, leading the hosts of heavens.\n\nIt further says: The Yin Spirit of the Great Perfected is named the Numinous Woman. Transforming radiance in the Nine Mysteries, riding the true in hidden obscurity. Conveying the flying rosy clouds, ascending to the imperial court.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1258,
      "start_sentence": 0,
      "end_sentence": 41,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.75918006896973,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清僊府琼林经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "又经曰：九玄九天，谓在三界之上。 又曰：游戏九玄台，解憩西羽河。 又曰：八景运天舆。 《大洞真经》曰：绛霞遏明曜，八景飞太空。 又曰：八愿玄母，与我俱游三玄之间，乃逸辔太漠，回軿三玄，五灵扶背，王母比肩，舞轮神丘，停驾九天。 《洞房内经》曰：无极高真，晨中朱庭，龙衣虎带，读洞真经，徘徊九天，高会七虚。 乘空洞之流軿，辔太霄之圆车。 又曰：我混五气中，共化乘日軿，宴观云霄外，吐纳七神精，盘栢九玄内，坐起霞上生。 文出五老雌一经 《三元真一经》曰：左激云轮，右骋飞龙，仰役二十四神，千乘万骑，呼阳召阴，白日升天。 《龟山元箓》曰：朝翔太阳观，夕栖隐阆风。 又曰：众仙戏云景，丹葩敷春阳，皇驾停云侣，飘飖自翱翔，瞻此八极外，谁究运所长。 又曰：三元真君各随四时变化形象，则反所元之气，受炼复形。 《太洞真经》曰：北陇郁霄霭，绛树结紫华，青药落凤林，碧□秀岩阿，灵阙凌太空，琼房参太霞，云云。 龙吹缠五云，云云。 丹霞蔚晨霄。 《玉佩金珰经》曰：金珰九天之上，名曰虹映，一曰上清之馆，太霄之中，结白烟之气，灵映九天，云云。 色如白云，形如玉山，有琼林之宫。 又曰：九天帝君镇在日门金庭之内。 又曰：玉佩以九天魂精，九天之上名曰晨灯，云云。 结青阳之气，灵映九天，云云。 色如青玉，形如月圆，内有空玄，玉台紫殿。 又曰：日华月精，日霞月映，左回玉佩，右把金珰，二景缠绵，双魂安康，上行太极，下造十方。 《紫书金根经》曰：青要帝君以九阳元皇玉帝之弟子，育於玄丘玉国元崖之天，琼林七宝之下，七色琼凤荫君之身。 又曰：栖心明霞之境，教流玉国之墟，执把九皇之策，落九域之丘，云云。 以紫云为屋，青霞为城。 黄金为殿，白玉为床。 《守玄丹上经》曰：两眉间上却入一分为守寸双田，却入一寸为明堂宫，却入二寸为洞房宫，却入三寸为丹田宫，却入四寸为流珠宫，却入五寸为玉帝宫，明堂上一寸为天庭宫，洞房上一寸为极真宫，丹田上一寸为玄丹宫，流珠宫上一寸为太皇宫，凡一头中有九宫也。 其明堂、洞房、丹田、流珠四宫之经，皆神仙为真人之道，传於世。 其玄丹经，亦真官司命之要言，四宫之领宗矣，此经须太极帝君告乃可与之也。 又曰：玉帝宫有玉清神母居之，天庭宫上清真女居之，极真宫太极帝妃居之，太皇宫太上君后居之，此四宫皆雌真一也，道胜於雄真一也。 并有宝经，以传已成真人者，未得成真，非所闻也，雌真之要亦自不授之矣。 太上所以出宴八景，入参琼轩，玉女三千，侍真扶轩，灵妃侠唱，神后执巾者，寔由守雌一之道，用以高会玄晨也。 此太上之宗根，虚皇之所传。 又曰：守玄丹太一真君之道，暮夕静寝，去诸思念，坐卧任意，先存北极辰星紫气来下，入己玄丹中，云云。 又存日来入玄丹宫中，日满宫内，在紫气中央，望视如暗中视火珠之状。 毕乃存上清中黄太一真君，从北极紫气中来，下入玄丹宫日中坐，君讳规英，字化玄，又存己一身忽然上入玄丹宫日中，在太一真君前对坐，云云。 於是太一君乃与己俱乘日，入行赤气道中，云云。 亦即有真应，云云。 则与太一同俱到七元之纲也，诣#1上清宫。",
      "translated_text": "The scriptures further state: The Nine Mysteries and Nine Heavens lie above the Three Realms.\n\nIt further says: Roaming and playing upon the Terrace of the Nine Mysteries, resting and halting by the Western Feather River.\n\nIt further says: The Eight Radiant Chariots traverse the heavens.\n\nThe *Supreme Cavern Mystery Scripture* says: Crimson clouds obstruct the luminous brilliance; the Eight Radiant Chariots soar through the great void.\n\nIt further says: The Eight Vows Mysterious Mother, together with me, roams amidst the Three Mysteries. Then, loosening the reins in the Great Wilderness, we turn the chariot through the Three Mysteries. The Five Numinous Spirits support my back; the Queen Mother sits shoulder to shoulder with me. Dancing wheels upon the divine mounds, we halt our carriage in the Nine Heavens.\n\nThe *Inner Scripture of the Cavern Chambers* says: The Limitless Lofty Perfected ones, at dawn within the Vermilion Court, clad in dragon robes and tiger belts, recite the *Cavern Mystery Scripture*. They wander through the Nine Heavens, gathering in the high assembly of the Seven Voids. Riding the flowing chariot of the Empty Cavern, they rein the round carriage of the Great Empyrean.\n\nIt further says: I blend within the Five Qi, transforming together to ride the solar chariot. Feasting and gazing beyond the cloudy empyrean, exhaling and inhaling the essence of the Seven Spirits. Reposing within the Nine Mysteries, sitting and rising upon the radiant clouds.\n\nThe text derives from the *Scripture of the Five Elders and the Feminine One*.\n\nThe *Scripture of the Three Primordials and the True One* says: To the left, spurring the cloud wheels; to the right, urging the flying dragons. Commanding the Twenty-Four Spirits above, with a thousand chariots and ten thousand riders, they summon the Yang and invoke the Yin, ascending to heaven in broad daylight.\n\nThe *Primordial Register of Mount Tortoise* says: At dawn, soaring in the Grand Solar Observatory; at dusk, nesting in the hidden Langfeng.\n\nIt further says: The host of immortals plays amidst the cloudy scenes; vermilion blossoms unfold in the spring sun. The imperial carriage halts amidst the cloud companions; lightly and freely, they soar. Gazing beyond the Eight Extremities, who can fathom the workings of their boundless journey?\n\nIt further says: The Three Primordial True Lords transform their forms according to the four seasons, reverting to their original qi, undergoing refinement to restore their forms.\n\nThe *Supreme Cavern Mystery Scripture* says: The northern ridges are thick with empyrean mists; crimson trees bear purple blossoms. Azure herbs fall in the phoenix groves; verdant [ ] adorn the rocky cliffs. The numinous towers soar into the great void; jade chambers mingle with the supreme rosy clouds. Cloud upon cloud... The dragon’s breath entwines the Five Clouds. Cloud upon cloud... Vermilion rosy clouds flourish in the morning empyrean.\n\nThe *Scripture of the Jade Pendants and Golden Earrings* says: The golden earrings above the Nine Heavens are named Rainbow Radiance, also called the Upper Clarity Palace, within the Great Empyrean. They coalesce from the qi of white mist, numinously reflecting the Nine Heavens. Cloud upon cloud... Their color is like white clouds; their form is like a jade mountain. There is the Palace of the Jasper Grove.\n\nIt further says: The Lords of the Nine Heavens are stationed within the Golden Court of the Solar Gate.\n\nIt further says: Jade pendants are made from the ethereal essence of the Nine Heavens. Above the Nine Heavens, they are named Morning Lamp. Cloud upon cloud... They coalesce from the qi of green yang, numinously reflecting the Nine Heavens. Cloud upon cloud... Their color is like green jade; their form is like the full moon. Within, there is the Empty Mystery, the Jade Terrace, and the Purple Palace.\n\nIt further says: The essence of the solar brilliance and lunar radiance, the rosy clouds of the sun and the luminous reflections of the moon. To the left, revolving the jade pendants; to the right, grasping the golden earrings. The Two Radiant Spirits entwine; the dual souls are at peace. Ascending to the Great Ultimate, descending to the Ten Directions.\n\nThe *Scripture of the Purple Book and Golden Root* says: The Azure Essence Lord is the disciple of the Nine Yang Primordial August Jade Emperor. Nurtured in the Heaven of the Primordial Cliff within the Jasper Grove and Seven Treasures of the Jade Mound Kingdom, beneath the seven-colored jasper phoenix that shades his body.\n\nIt further says: Dwelling in the realm of luminous rosy clouds, his teachings flow through the ruins of the Jade Kingdom. Grasping the Nine August Sovereigns’ scepters, descending upon the mounds of the Nine Regions. Cloud upon cloud... His house is made of purple clouds; his city is made of green rosy clouds. His halls are of yellow gold; his beds are of white jade.\n\nThe *Upper Scripture of the Cinnabar of the Guarded Mystery* says: One *cun* above and inward from the space between the eyebrows is the Double Field of the Guarded Inch. One *cun* inward is the Palace of the Bright Hall. Two *cun* inward is the Palace of the Cavern Chamber. Three *cun* inward is the Palace of the Cinnabar Field. Four *cun* inward is the Palace of the Flowing Pearl. Five *cun* inward is the Palace of the Jade Emperor. One *cun* above the Bright Hall is the Palace of the Celestial Court. One *cun* above the Cavern Chamber is the Palace of the Ultimate Perfection. One *cun* above the Cinnabar Field is the Palace of the Mysterious Cinnabar. One *cun* above the Flowing Pearl is the Palace of the Supreme August. In all, there are nine palaces within the head.\n\nThe meridians of the Bright Hall, Cavern Chamber, Cinnabar Field, and Flowing Pearl Palaces are the Way of the divine immortals to become Perfected Ones, transmitted to the world. The *Scripture of the Mysterious Cinnabar* is also the essential teaching of the True Officials and Directors of Destiny, the guiding principle of the Four Palaces. This scripture may only be imparted when the Lord of the Great Ultimate has given his instruction.\n\nIt further says: Within the Palace of the Jade Emperor resides the Divine Mother of Jade Clarity. Within the Palace of the Celestial Court resides the True Woman of Upper Clarity. Within the Palace of Ultimate Perfection resides the Empress of the Great Ultimate. Within the Palace of the Supreme August resides the Sovereign Lady of the Most High. These Four Palaces are all the Feminine True One, whose Dao surpasses that of the Masculine True One. They possess precious scriptures transmitted only to those who have already attained Perfection. Those who have not attained Perfection are not to hear of them; the essentials of the Feminine True One are likewise not to be imparted.\n\nThus, the Most High emerges to feast amidst the Eight Radiant Spirits and enters to attend the Jasper Pavilion. Three thousand Jade Maidens serve and support the Perfected One; numinous consorts sing in harmony; divine attendants hold the towels. Truly, this is the practice of guarding the Feminine One, used to gather in the high assembly of the Mysterious Dawn. This is the root and origin of the Most High, transmitted by the August Void.\n\nIt further says: The Way of the True Lord of the Guarded Cinnabar of the Great One: At dusk, in tranquil repose, dispel all thoughts. Sit or lie as you wish. First, visualize the purple qi of the Northern Culmen star descending and entering your Mysterious Cinnabar. Cloud upon cloud... Then visualize the sun entering the Palace of the Mysterious Cinnabar, filling the palace within. Amidst the purple qi, gaze as if seeing a fire pearl in the dark. Then visualize the Central Yellow True Lord of Upper Clarity descending from the purple qi of the Northern Culmen into the Palace of the Mysterious Cinnabar, seated within the sun. The Lord’s name is Guiying, styled Huaxuan. Then visualize your entire body suddenly ascending into the Palace of the Mysterious Cinnabar, seated before the True Lord of the Great One. Cloud upon cloud... Thereupon, the True Lord of the Great One, together with you, rides the sun into the path of the red qi. Cloud upon cloud... There will be true responses. Cloud upon cloud... Then, together with the Great One, you will arrive at the guiding principle of the Seven Primordials, proceeding to the Upper Clarity Palace.",
      "overlap_context": "ystery Great Possession Scripture* states: Dwelling in the numinous cavern, feasting in the radiance of the seven dawns. Clarifying and sprinkling the floral garden, resting in the Nine Mysteries. Transforming radiance in the Jade Void, leading the hosts of heavens.\n\nIt further says: The Yin Spirit of the Great Perfected is named the Numinous Woman. Transforming radiance in the Nine Mysteries, riding the true in hidden obscurity. Conveying the flying rosy clouds, ascending to the imperial court.",
      "start_char": 1259,
      "end_char": 2503,
      "start_sentence": 42,
      "end_sentence": 81,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.06681966781616,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清僊府琼林经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "又曰：太上龙书曰，正坐玄丹，不徧不邪，言此道之要也。 兆当存太一紫气以绕身，及咽吞之，又当常存太一真君在玄丹宫紫气中，长生无极，万凶不干，玄丹之道毕也。 《道机经》曰：人以身为国，神为君，精为臣，气为民，炁变为精，精化为神，神化婴儿。 《神仙本起内传》曰：八节之日，诸天大圣尊神，妙行真人，莫不上会灵宝玄都玉〔京〕#2山上宫，朝庆天真。 洞神部曰：控景大霞宫，齐轮九天庭。 《龟山元箓》曰：真人於金堂琼室，七宝花林之中，渌水华池之上，云云。 飞真步虚，游宴玉房，金台宝光，八希之馔，登仙洞空，龟山之中，朝餐琼芝，夕嗽玉泉，俱来造焉，十二玄龙，紫凤灵虬，神禽丹舆，羽盖真骑，诸神上丹，诸君从灵，来降我焉。 《自然玉字》〔曰〕#3： 越衡天上，玄都之京，有空峰之山，乃万圣之所游，道成得仙，径升空峰之上，受号而腾空。 又曰：皇茄天上有金华之山，山有五帝之宫，常生五色之云，日月侠乎左右，飞仙翼轩。 《灵宝经》曰：太上道君於西那天郁察山浮罗之岳，坐七宝骞林之下，云云。 道君方自弹景龙云璈，霄音逸响，流激千寻，诸天郁勃，紫盖回玄，庆霄四会，八道焕明。 《太上宝诀》曰：微微玄宗门，焕朗彻空同，至道由静默，当见三素宫。 又曰《老子道德经》称：视之不见夷，听之不闻希，抟之不得微，即三元老子之号矣。 又言此三者不可致诘，故混而为一，是三素合为元一君，是三尊之元父、玄母也。 读此经，二老君子见之，仙道成矣，道尽此矣。 又曰：大朴本无质，圣圣谓之玄，二义由终始，万物至渊泉。 又曰：昆仑山上诸仙多作中夏，九天诵咏，萧条远畅，清音泠朗，听者霄绝，使人忘情。 时会众仙，歌洞咏玄，合〔声〕#4齐唱，新声激响，窈窕遐闻，云云。 上真之所重也。 又《高台铭》曰：子欲乘空凌虚，诵我步玄羽书。 诸仙不解此语也。 步玄羽经，此之两书，太上玄经，不传中仙矣。 《紫书金根经》曰：制命九天之皆，征召五帝之灵，逸回风之混合，凝九转於玄精。 又曰：太上君后头九玄玉精颓云之髻，居太清九玄之上。 台名也，亦九天洞元极真宫中。 《大洞真经》曰：飘飘三霞岭，徊纲七元盖，八景入太无，飞洒九天外。 琼扉生景云，灵烟绝幽蔼，西宫咏洞玄，清唱扶桑际。 又曰：七阙焕流霞，琼室生龙云，左回三素辔，右抚八景轮。 又曰：左把玉华盖，飞景登七元。 《太上飞行玉经》曰：上步天宿，飞行九星，左把隐书，右执羽经，拜谒帝尊，受帝之名，得越华盖，腾翔紫庭。 又曰：驾景紫烟，飞步九元。 又曰：五皇夫人内阴隐名，太上藏之玄斗紫盖宫中，此五夫人皆回天转地，盈缩三光，变化山河，改易五行，移动万物，隐藏幽冥，有知其道，皆不复经地户，魂过太山也。 又曰：道气无光，寥廓无端，混沌元形，虚元自然，太上无根，冥寂玄通。 又曰：天地大劫之交，诸天至真尊神、妙行真人下游五岳，径观天下至学之人，洪流弥天，皆以五龙迎之，登游福地，得与元始同游。 《灵宝经》曰：妙行真人，无鞅数众，一时同会，国土皆以融金灌地，四边阶道并是碧玉瑠璃宝饰，四匝严整，光明洞彻。",
      "translated_text": "The *Supreme Dragon Script* further states: \"Sit upright in the Palace of Mysterious Cinnabar, neither inclined nor slanted—such is the essence of this Dao.\" You should visualize the purple qi of the Great One swirling around your body and swallow it. Always visualize the True Lord of the Great One within the purple qi of the Palace of Mysterious Cinnabar. Thus shall you attain boundless longevity, and the myriad calamities shall not assail you—the Dao of Mysterious Cinnabar is complete.\n\nThe *Scripture of Daoist Mechanisms* says: \"Man takes the body as his kingdom, spirit as his sovereign, essence as his minister, and qi as his people. Qi transforms into essence, essence into spirit, and spirit into the infant.\"\n\nThe *Inner Transmission on the Origins of Divine Immortals* states: \"On the eight seasonal nodes, all the great sagely honored deities and perfected persons of wondrous conduct ascend without exception to the Upper Palace of the Numinous Treasure’s Mysterious Capital on Jade Mountain, to pay homage and celebrate the celestial perfected.\"\n\nThe *Cavernous Spirit Section* says:\n*\"Commanding the radiance of the Great Auroral Palace,\nIn unison with the wheels of the Nine Heavens’ courts.\"*\n\nThe *Original Register of Mount Tortoise* states: \"The perfected one, amid golden halls and jade chambers, within seven-jeweled flower groves and above pools of limpid waters...\" Soaring in flight, pacing the void, they feast in jade chambers. Golden terraces and jeweled lights, the eight rarities as viands. Ascending the cavernous emptiness of immortal realms, within Mount Tortoise’s midst, they breakfast on jasper mushrooms and sip jade springs at dusk. All come to assemble: the twelve dark dragons, purple phoenixes, numinous serpents, divine birds in cinnabar chariots, feathered canopies and perfected mounts. The various spirits ascend with cinnabar, the lords follow with numinosity, descending to me.\n\nThe *Natural Jade Characters* says:\n*\"Beyond the celestial balance, in the capital of the Mysterious Capital,\nThere is the Mountain of Empty Peaks—\nThe playground of the ten thousand sages.\nThose who attain the Dao and achieve immortality\nAscend directly to the summit of Empty Peaks,\nReceive their titles, and soar into the void.\"*\n\nIt further states: \"In the Heaven of Imperial Gourds, there is the Mountain of Golden Flowers, where the Five Thearchs’ palaces stand. Five-colored clouds perpetually arise, with the sun and moon flanking its sides, and flying immortals as its winged chariots.\"\n\nThe *Scriptures of Numinous Treasure* say: \"The Supreme Dao Lord, on the Floating Mound of Yucha Mountain in the Western Heaven, sits beneath the seven-jeweled canopy of flowering trees...\" The Dao Lord then plucks the cloud-zither of the radiant dragon, its transcendent tones cascading in boundless resonance. The myriad heavens stir, purple canopies revolve in mystery, and the four assemblies of the luminous void gather. The eight paths blaze with brilliance.\n\nThe *Supreme Treasure Instructions* state:\n*\"The subtle gate of the Mysterious Origin,\nResplendent and luminous, pervades the vastness.\nThe supreme Dao arises from stillness and silence—\nTherein you shall behold the Three Pristine Palaces.\"*\n\nIt further cites the *Laozi’s Scripture of Dao and Virtue*: \"That which is seen yet formless is called *Yi*; heard yet soundless, *Xi*; grasped yet intangible, *Wei*—these are the titles of the Three Primal Lords.\" It continues: \"These three cannot be exhaustively questioned, thus they merge into the One. The Three Pristine unite as the Primal One Lord, the Primordial Father of the Three Honored Ones and the Mysterious Mother.\" Whoever reads this scripture, if two venerable lords witness it, shall attain the immortal Dao—here the Dao is complete.\n\nThe text further says:\n*\"The Great Simplicity originally has no substance,\nThe sages call it the Mysterious.\nTwo principles arise from beginning and end,\nAll things reach the abyssal spring.\"*\n\nIt also states: \"On Kunlun Mountain, the many immortals often manifest in the Central Realm. The nine heavens resound with their recitations, vast and far-reaching, their pure tones crystalline and clear. Those who hear them are enraptured, forgetting all worldly passions. When the assembly of immortals gathers, they sing of the cavernous mystery in unison. Their new melodies ring out, ethereal and distant, echoing endlessly...\"",
      "overlap_context": "iying, styled Huaxuan. Then visualize your entire body suddenly ascending into the Palace of the Mysterious Cinnabar, seated before the True Lord of the Great One. Cloud upon cloud... Thereupon, the True Lord of the Great One, together with you, rides the sun into the path of the red qi. Cloud upon cloud... There will be true responses. Cloud upon cloud... Then, together with the Great One, you will arrive at the guiding principle of the Seven Primordials, proceeding to the Upper Clarity Palace.",
      "start_char": 2503,
      "end_char": 3743,
      "start_sentence": 82,
      "end_sentence": 116,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.265348196029663,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清僊府琼林经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "又曰：元始天尊於碧落空歌大浮黎国土，坐碧霞之上，地皆是碧玉，四边阶道悉以金宝银饰，种种奇妙。 又曰：禅黎世界赤明之国，南圃丹霍之阿，三元洞室，天尊坐绛云之上，至真大神、大丹玉女，一时同会丹霍之阿，其国土常生赤炁，似如绛云。 守一之法，常以少饮食、无食豕肉鱼臊，凡饮食随四时温凉，无逆时以之。 守一法，慎无饮浊酒。 浊酒损人精五藏生炁，精炁不行，血脉不通。 《上皇先生紫君经》曰：神州在天关之北，日月回度，其南七星，轮转其中。 《上清经》曰：念三元於泥丸，守九真於形宅，吐纳五华，呼吸玉液，朝暮求仙於空洞，寝息感神於太漠。 又曰：奉之者登三晨，游太霄。 又曰：大洞之经乃九天之奇诀，上元太清君金书之首经也。 昔中央黄老君隐禁此书，时元知焉，唯太玄有金阙玉名、琼札紫简。 受读此章万过，即便白日升天，上登上清，受书太极，拜为高上卿。 但有此书不得读之者，太微天帝君拔出死简，刊定真箓，度籍太极，刻名东华，关奏太上，录封龟台，万灵千神自称兆为九玄大夫，位准泰清仙伯。 《大丹隐玄五晨金华玉经》曰：玄母八门行间篇曰：愿玄母与我俱生於生炁之间，与我俱存於日月之间，与我俱保於九天之间，与我俱存於自然之间，与我俱饮於匏河之间，与我俱息於玉真之间，与我俱寝於仙堂之间，与我俱游於三玄之间。 又曰：九天帝君十二上愿，九灵玄母八门神间，大回元五通，静於密室，散香灶烟，而读《大洞金华经》。 《先进洞房内经》曰：昆仑高而不倾，神仙所止，金堂玉城，九炁离合，云雨杳冥，黄阙紫户，至为玄精，上冲绝霞，下照九灵，左连青宫，右侠皓清，金台八素，游变万形，玉醴澄液，琼液自生，六合幽户，八阁会经，中有太真，至不可名，微妙无中，号曰无英。 又曰：昔常安李仲，了不知他道，又亦不知施行太丹之事，三元之法也。 唯隅得此隐朝之道，守行之三十年，得乘云驾欻，升入玄洲。 〔仙〕#5人王履冰、赵双成、范叔友、管平何、李明贤、安生之辈，皆得此道，而升昆仑之房，或在玄洲三玄宫也。 又曰：太素三元君者，一真女子也，服紫炁浮云锦帔，九色龙锦羽裙，建宝琅扶晨羽冠，腰流金火铃，虎符龙书，而坐空中，膝下常有丹绿青三素之云，郁然冠其形也。 又太素三元君常咏曰：太元连玉清，三洞曜高明，八景回晨风，散云蔼飞灵，圆轮掷空洞，金映冠天精，玉华结五老，紫烟晖霄軿，乘炁荡玄房，金姿曜九霞。 云是玉清上宫之唱。 《玉晨明镜经》曰：白素右元君者，白元洞阳君之母，太素三元君之子也，讳启明萧刃，字金门上，口中常吐出白气，名之曰玉晨白宝生魂之炁，以熏我身，使人神仙不死。 黄素中央元君者，中央黄老君之母，太素三君之子也，讳圆华黄刃，字太张上，号日黄素高元君，有黄金之质，口吐黄炁，名曰玉晨黄宝大灵生五藏之炁，以熏我身，使人飞仙升天。 紫素左元君者，元素君之母，太素三元君之子也，讳翳传无刃，字安来上，神镜八方，而貌少婴孩也，口吐紫炁，名曰玉晨紫宝命胎流霞之景烟，以熏我身，使人白日升晨，登玉清上宫。 此系节抄出者，其全文具在本经。",
      "translated_text": "The text further states:\n\nThe Primordial Heavenly Venerable of the Origin, seated upon the Azure Mist in the Great Fuli realm of the Azure Vault, rests where the earth is all of azure jade. The steps and pathways on all sides are adorned with gold and silver treasures, wondrous and manifold.\n\nIt also says: In the Crimson Radiance realm of the Chanli world, at the Southern Garden’s Cinnabar Terrace, within the Three Origin Cavern Chambers, the Heavenly Venerable sits upon the crimson clouds. The Perfected Celestial Spirits and the Great Cinnabar Jade Maidens gather together at the Cinnabar Terrace, where the land perpetually emanates crimson qi, resembling the hue of crimson clouds.\n\nThe method of Guarding the One requires one to eat sparingly, abstain from pork, fish, and pungent foods, and adjust one’s diet to the warmth or coolness of the four seasons without defying their nature.\n\nIn the practice of Guarding the One, one must never drink turbid wine. Turbid wine harms the essence, depletes the five viscera’s generative qi, impedes the flow of essence and qi, and obstructs the blood and vessels.\n\nThe *Scripture of the Purple Lord of the Supreme Sovereign* states: The Divine Continent lies north of the Celestial Pass, where the sun and moon revolve in their courses. To its south, the Seven Stars wheel within its bounds.\n\nThe *Scripture of the Supreme Purity* says: Contemplate the Three Origins within the Mud-Pill Palace, guard the Nine Perfected within the bodily abode. Exhale and inhale the Five Radiances, breathe the Jade Fluid. At dawn and dusk, seek transcendence in the Cavernous Void; in sleep and repose, commune with spirits in the Great Desert.\n\nIt further states: Those who uphold this shall ascend the Three Mornings and wander the Grand Empyrean.\n\nIt also says: The *Scripture of the Great Cavern* is the wondrous esoteric teaching of the Nine Heavens, the foremost scripture of the Golden Writ of the Supreme Origin Lord of the Grand Clarity. Formerly, the Central Yellow Elder Lord concealed this text, and its mysteries were known only to the Grand Mystery. Only in the Golden Tower of the Grand Mystery were there golden tablets and jade slips with purple inscriptions. Whoever reads this chapter ten thousand times shall ascend to heaven in broad daylight, ascend to the Supreme Purity, receive the scripture in the Grand Ultimate, and be appointed as a High Minister of the Lofty Ones. Yet if one possesses this scripture but does not read it, the Heavenly Emperor of the Grand Tenuity shall strike one’s name from the Register of Death, inscribe the true record, and transfer it to the Grand Ultimate. One’s name shall be engraved in the Eastern Florescence, reported to the Supreme Venerable, and recorded in the Tortoise Terrace. The myriad spirits and thousand gods shall then address the adept as the Grand Master of the Nine Mysteries, with a rank equivalent to the Immortal Earl of the Grand Clarity.\n\nThe *Scripture of the Concealed Mystery of the Five Mornings’ Golden Flower and Jade Essence* states: The *Eight Gates of the Mysterious Mother’s Wandering Intervals* says: May the Mysterious Mother be born with me amidst the generative qi, abide with me between the sun and moon, protect me within the Nine Heavens, dwell with me in the realm of spontaneity, drink with me from the Gourd River, rest with me in the Jade Perfection, sleep with me in the Immortal Hall, and wander with me among the Three Mysteries.\n\nIt further says: The Twelve Supreme Vows of the Nine Heavenly Lords, the Eight Divine Intervals of the Nine Numinous Mysterious Mother, the Great Returning Origin and Five Penetrations—calm the secret chamber, disperse incense and stove smoke, and recite the *Scripture of the Golden Flower of the Great Cavern*.\n\nThe *Inner Scripture of the Foremost Cavern Chamber* states: Kunlun stands lofty and unshaken, the abode of divine immortals. Its golden halls and jade cities, the convergence and divergence of the Nine Qi, the misty clouds and rain, the Yellow Gate and Purple Portal—all are of the most refined essence. Above, it pierces the distant mists; below, it illuminates the Nine Numinous. To the left, it connects with the Azure Palace; to the right, it flanks the Luminous Clarity. The Golden Terrace of the Eight Simplicities transforms myriad forms; the Jade Elixir settles its fluid, and the nectar of jasper arises spontaneously. The Six Harmonies’ secluded portals, the Eight Pavilions’ assembly of scriptures—within them dwells the Supreme Perfected, whose name cannot be uttered. Subtle and wondrous beyond measure, it is called the Peerless.\n\nIt also says: Formerly, Li Zhong of Chang’an understood neither other teachings nor the practice of the Great Cinnabar or the methods of the Three Origins. He only obtained this hidden method of the morning audience and guarded its practice for thirty years. Thereupon, he rode the clouds and ascended in a whirlwind to the Dark Continent.\n\nThe immortals Wang Lübing, Zhao Shuangcheng, Fan Shuyou, Guan Pinghe, Li Mingxian, An Shengzhi, and others all attained this Dao and ascended to the chambers of Kunlun, or dwelled in the Three Mystery Palace of the Dark Continent.\n\nIt further says: The Supreme Simplicity Three Origin Lords are a single Perfected Woman. She wears a floating-cloud brocade mantle of purple qi, a nine-colored dragon-feathered skirt, and a feathered crown of precious langgan adorned with morning rays. At her waist hang flowing golden fire-bells, tiger tallies, and dragon scripts. She sits in the void, and beneath her knees ever rise three clouds of cinnabar, green, and azure, luxuriantly crowning her form.\n\nThe Supreme Simplicity Three Origin Lord often chants:\n*\"The Grand Origin connects to the Jade Clarity,\nThe Three Caverns shine with lofty brilliance.\nThe Eight Effulgences revolve the morning winds,\nScattering clouds and misting the flying numina.\nThe circular wheel hurls through the empty cavern,\nGolden reflections crown the celestial essence.\nJade radiance binds the Five Elders,\nPurple mists gleam upon the auroral chariot.\nRiding the qi, I sway the mysterious chamber,\nMy golden form illumines the Nine Auroras.\"*\nThis is the hymn of the Upper Palace of the Jade Clarity.\n\nThe *Scripture of the Jade Dawn Luminous Mirror* states: The White Simplicity Right Origin Lord is the mother of the White Origin Cavern Yang Lord and the child of the Supreme Simplicity Three Origin Lords. Her name is Stimulating Brightness, her cognomen is Upper Golden Gate. From her mouth, she constantly exhales white qi, called the Jade Dawn White Treasure’s Generative-Soul Qi, which suffuses my body and renders one an immortal, deathless.\n\nThe Yellow Simplicity Central Origin Lord is the mother of the Central Yellow Elder Lord and the child of the Supreme Simplicity Three Lords. Her name is Round Flower Yellow Blade, her cognomen is Supreme Great Flourishing, and her title is Yellow Simplicity Lofty Origin Lord. She possesses a body of yellow gold and exhales yellow qi from her mouth, called the Jade Dawn Yellow Treasure’s Great Numinous Generative Qi of the Five Viscera, which suffuses my body and enables one to ascend as a flying immortal to heaven.\n\nThe Purple Simplicity Left Origin Lord is the mother of the Primordial Simplicity Lord and the child of the Supreme Simplicity Three Origin Lords. Her name is Concealing Transmission of the Nameless Blade, her cognomen is Upper Peaceful Advent. Her divine mirror surveys the eight directions, and her countenance is that of a young child. From her mouth, she exhales purple qi, called the Jade Dawn Purple Treasure’s Life-Embryo Flowing-Aurora Radiance, which suffuses my body and enables one to ascend at dawn to the Upper Palace of the Jade Clarity.\n\nThis is an excerpted passage; the full text is contained in the original scripture.",
      "overlap_context": "ise from beginning and end,\nAll things reach the abyssal spring.\"*\n\nIt also states: \"On Kunlun Mountain, the many immortals often manifest in the Central Realm. The nine heavens resound with their recitations, vast and far-reaching, their pure tones crystalline and clear. Those who hear them are enraptured, forgetting all worldly passions. When the assembly of immortals gathers, they sing of the cavernous mystery in unison. Their new melodies ring out, ethereal and distant, echoing endlessly...\"",
      "start_char": 3743,
      "end_char": 4982,
      "start_sentence": 117,
      "end_sentence": 141,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.96742224693298,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清僊府琼林经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "又曰：三素元君项后各有一宝曜，日气九色，圆光朗彻金花洞房一室之内，三素元君口各吐炁如上法，三炁会合，缠这相着，化为一日象九寸，在金华洞房中。 又曰：太上玉晨，九微导烟，五老散景，八灵生门，三素宝炁，太玄玉晨，金华雌一，中有紫元，混化七九，上拔云云，三上三炁，入虚出丹，常与紫素，俱列玉仙。 《大洞雌一太极五老帝君镇生五藏上经》曰：太极金华真人以此经文刻於天帝紫微宫玄琳玉殿东壁牖上，其文曰：五炁异方，津光合形，有终而死，有始而生，万类反本，千条归冥，气适浮烟，血奔流清，哀哉兆身。 已后在丹方服饵注耳。 又云南岳真人曰：吾昔有入室弟子仙人赵成子者，初受吾镇生五脏上经，乃案为之，成子后欲还入太阴，求改貌化形，自故死亡於幽州上谷玄丘中石室之下。 死后五年，后有山行者见白骨在室中，露骸冥室，又见腹中五藏，自生不烂如故，五色之华莹然於内，彼山行人叹曰：昔闻五藏可养，以至不朽，白骨胸中生花者，今睹其人矣，此子将有道不终，将中道帔试不过乎。 因手披之，见五藏中各有一白石子，镇生五色华，如容状在焉。 彼人曰：使汝五藏所以不朽者，必以五石生华故也，子已夫道，可以相与。 因取而吞之。 去复四五年，而成子之尸当生，彼人先服石子，以成子当生之旦，而五石皆从口中飞出如蝉状，隐隐雷声，五色洞日径还死尸之脏，因此成子改形而起，如一宿醉睡之间。 其人心惧恍惚，因病日甚，乃至入山寻视死尸所在，到石室前，方见成子偃据洞啸，面有玉光，而问之曰：子何人哉？ 忽见有五老仙公披锦带符，手乘羽节，头建紫冠，言於成子曰：昔盗吞先生五脏宝石者，此人是也。 言毕，彼人面上即生恶癞，噤而失言，比归达家，癞疮亦匝，一门大小，同时俱死，族亦遂灭矣。 又常服日月之精华者，欲得常食竹笋，竹笋者，日华之胎也，一名大明。 又欲常食鸿脯者，月胎之羽乌也，一名月鹭，欲服日月，当食此物，炁感通之。 太虚真人曰：鸿者羽族之总名也，其鹊雁鹅鸲，皆曰鸿鹭也。 古歌曰：鸿鹭千年乌，为肴致天真，五帝衔月华，列坐空中宾。 此古之渔父歌也。 《玉晨明镜经》曰：又存五神名，各安坐其宫也，五神并口吐紫炁，以缠我身，内外冥合，手足不相见乃止。 又存日月出我颊间，左日右月，二光洞照，於是紫炁豁然，而徐存日上入我口中，口即食之，作饴味，九咽止。 又存月入我脐中，当命门，下照阴室，间又存我手把北斗七星之柄，戴以行步，入紫房太微中，见帝君曰：子之得神仙，我以子上青玉之符，书九有之天也。 盘□九玄内，起坐霞上生，五符付帝子，上归反华婴。 又曰：三五相反，天覆地始，我有五符，上归帝子，三无长留，营室之里。 已上出《五老雌一经》 《玄妙内篇》曰：太上曰，元道本起於无先，万炁之祖，万道之元，虚无之上，无有之先，无体无象，不有不无，尊无有上，贵不可胜。 《玉晨明镜经》曰：太一帝君洞真玄经存五神法，又存神太一、无英、白元、司命、桃君等，凡有五女子之神，有九男子之神，名曰三五九七，上到玄门之时，形貌并如婴儿始生之状，五女九男口中各吐白炁，互熏兆身，於是五女九男并兆一身，混共一合，都为一白炁圆形，如日之光团团之状，须臾圆光白炁变为二小儿，一男一女，并如初生婴胎之状，男曰九元之真，女号皇一之魂，男名拘制，字三阳，女名上归，字帝子。",
      "translated_text": "Moreover, it is said: Behind the necks of the Three Simplicity Origin Lords, each bears a precious radiance. Their solar qi displays nine colors, and their circular luminosity shines resplendently within the Golden Flower Grotto-Chamber, illuminating the entire room. The Three Simplicity Origin Lords each exhale qi as described above, and the three qi converge, intertwining and coalescing to form a sun-like image, nine inches in diameter, within the Golden Flower Grotto-Chamber.\n\nIt is further said: The Supreme Jade Dawn’s Nine Subtleties guide the mist, the Five Elders scatter their radiance, the Eight Numinous Gates give birth, the Three Simplicity Precious Qi, the Supreme Mystery Jade Dawn, the Golden Flower Feminine One—within it lies the Purple Origin. The seven and nine merge and transform, ascending through the clouds, the threefold ascent of the three qi, entering emptiness and issuing forth cinnabar. Constantly accompanying the Purple Simplicity, they together rank among the Jade Immortals.\n\nThe *Scripture of the Feminine One of the Great Cavern, the Five Elder Thearchs of the Supreme Ultimate, and the Five Viscera’s Life-Securing* states: The Supreme Ultimate Golden Flower Perfected Person inscribed this scriptural text upon the eastern wall of the Jade Numinous Palace in the Purple Tenuity Palace of the Heavenly Thearch. The text reads: The five qi arise from different directions, their effulgences merging with form. Some end in death, some begin in life. The myriad kinds return to their root, the thousand threads converge in darkness. Qi drifts like floating mist, blood rushes like flowing clarity. Alas, the portents of the body!\n\nThereafter, it is recorded in the cinnabar methods and ingestion formulas. The Southern Marchmount Perfected Person also said: Among my disciples who entered the chamber, there was the immortal Zhao Chengzi. When he first received my *Scripture of the Five Viscera’s Life-Securing*, he practiced it accordingly. Later, Chengzi wished to reenter the Great Yin to seek transformation of his appearance and form. He feigned death in the dark hills of Shanggu in Youzhou, beneath a stone chamber. Five years after his death, a mountain traveler saw his white bones in the chamber, his exposed skeleton lying in the dim room. Yet his five viscera remained intact within his abdomen, unrotted as before, their five-colored blossoms gleaming within. The mountain traveler sighed and said: \"Of old, I heard that the five viscera could be nurtured to achieve imperishability. Now I behold one whose white bones bear blossoms within his chest—this man must have possessed the Dao but did not complete it, or perhaps failed some intermediate trial.\"\n\nThereupon, he reached out and parted the remains, seeing within the five viscera a white stone each, securing the five-colored blossoms in their proper places. The traveler said: \"That your five viscera remain imperishable must be due to these five stones that generate the blossoms. You have already perished in the Dao; let me join you.\" He then took and swallowed them. Four or five years later, when Chengzi’s corpse was due to revive, the traveler, having already ingested the stones, found that on the morning of Chengzi’s revival, the five stones flew from his mouth like cicadas, accompanied by faint thunder. The five-colored brilliance pierced the sun as they returned directly to the viscera of the dead man. Thereby, Chengzi transformed his appearance and arose, as if from a single night’s drunken slumber. The traveler, his mind seized with terror and confusion, fell gravely ill. He entered the mountains to seek the place where the corpse had lain. Arriving before the stone chamber, he saw Chengzi reclining and whistling in the grotto. His face bore a jadelike glow, and he asked: \"Who are you?\"\n\nSuddenly, five Elder Immortal Lords appeared, wearing brocade sashes and talismans, holding feathered tablets, their heads crowned with purple coronets. They addressed Chengzi, saying: \"This is the man who stole and swallowed your five visceral treasure-stones.\" As soon as they spoke, the traveler’s face erupted with malignant sores, and he was struck dumb. By the time he returned home, the leprous ulcers had spread over his entire body. His entire household, young and old, died simultaneously, and his clan was thus extinguished.\n\nIt is also said that those who regularly ingest the essences of the sun and moon should frequently eat bamboo shoots. Bamboo shoots are the embryo of the sun’s radiance, also called Great Brilliance. They should also frequently eat the flesh of swans, which are the feathered birds of the moon’s embryo, also called Moon Herons. To ingest the sun and moon, one should consume these things, for their qi resonates and communicates.\n\nThe Perfected Person of the Great Void said: \"Swan\" is the general name for the feathered tribes. Magpies, geese, swans, and crows are all called \"swan-herons.\" An ancient song says:\n*\"Swan-herons of a thousand years,\nAs viands they summon celestial perfected ones.\nThe Five Thearchs hold moon’s radiance in their beaks,\nSeated in rows as guests in the empty sky.\"*\nThis is an ancient fisherman’s song.\n\nThe *Scripture of the Jade Dawn’s Luminous Mirror* says: Further, visualize the names of the five spirits, each seated securely in its palace. The five spirits all exhale purple qi, which coils around my body until inner and outer merge in darkness, and hands and feet are no longer visible.\n\nAlso visualize the sun and moon emerging from my cheeks—sun on the left, moon on the right—with their twofold radiance penetrating and illuminating. Thereupon, the purple qi suddenly clears. Gradually visualize the sun ascending and entering my mouth, which then consumes it, tasting like maltose. Swallow nine times and stop.\n\nAlso visualize the moon entering my navel, directly above the Gate of Destiny, its light descending to illuminate the Yin Chamber. Then visualize my hand grasping the handle of the Northern Dipper’s seven stars, wearing it as I walk. Enter the Purple Chamber within the Supreme Tenuity, and behold the Thearch, who says: \"You have attained divine transcendence. I bestow upon you the Azure Jade Talisman, inscribed upon the heavens of the Nine Realms.\"\n\n*\"Within the coiled ninefold mystery,\nRising and sitting upon the clouds’ radiance,\nThe five talismans are entrusted to the Thearch’s son,\nWho ascends and returns to the Flowering Infant.\"*\n\nIt further says:\n*\"The three and five oppose each other,\nHeaven covers, earth begins.\nI possess the five talismans,\nWhich ascend to the Thearch’s son.\nThe Three Non-abiding remain long,\nWithin the Chamber of the Celestial Camp.\"*\nThe above is from the *Scripture of the Five Elders and the Feminine One*.\n\nThe *Inner Chapters of the Mysterious Wondrous* says: The Supreme Lord said: The original Dao fundamentally arises from the Non-prior. It is the ancestor of the myriad qi, the origin of the myriad ways. Above the Void and Nothing, prior to Non-being, without form or image, neither existent nor non-existent, it is honored as having nothing above it, its nobility beyond compare.\n\nThe *Scripture of the Jade Dawn’s Luminous Mirror* says: The Scripture of the Cavern Realms of the Supreme One Thearch’s method for visualizing the five spirits also involves visualizing the spirits of the Supreme One, the Non-Brave, the White Prime, the Controller of Destiny, and the Peach Lord—altogether five female spirits—and nine male spirits, named the Three, Five, Nine, and Seven. When ascending to the Gate of Mystery, their forms and appearances all resemble those of newborn infants. The five females and nine males each exhale white qi from their mouths, mutually suffusing the practitioner’s body. Thereupon, the five females and nine males merge with the practitioner’s single body, blending into one. They become a single white qi, round in shape, resembling the sun’s radiant orb. In an instant, the round luminosity of the white qi transforms into two small children, one male and one female, both resembling newborn infants. The male is called the Perfected of the Nine Origins, the female is titled the Soul of the August One. The male is named Restraining Control, styled Three Yang; the female is named Ascending Return, styled Thearch’s Son.",
      "overlap_context": "gin Lords. Her name is Concealing Transmission of the Nameless Blade, her cognomen is Upper Peaceful Advent. Her divine mirror surveys the eight directions, and her countenance is that of a young child. From her mouth, she exhales purple qi, called the Jade Dawn Purple Treasure’s Life-Embryo Flowing-Aurora Radiance, which suffuses my body and enables one to ascend at dawn to the Upper Palace of the Jade Clarity.\n\nThis is an excerpted passage; the full text is contained in the original scripture.",
      "start_char": 4983,
      "end_char": 6319,
      "start_sentence": 142,
      "end_sentence": 167,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.96370553970337,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清僊府琼林经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "须臾又存男儿拘制，女儿上归，并立在日月之中，男在日中，女在月中，日月悬乎皇天，日在东方，月在西方，当时自觉一身乃已共化为向之白炁矣。 又存闻童子拘制在日中，有声咏曰：拘制三阳，九元之真，是我之号，日结我身，符籍玉清，与天相亲，混合雌雄，神仙缠绵。 又存闻上归女子在月中，有声咏曰：上归帝子，皇一之魂，是我之号，月结我精，主人符籍，已在大明，与玄为亲，寿万亿龄，混合雌雄，裸身华。 《汉武内传》曰：西王母授帝《五岳真形图灵光生经》，上元夫人授帝《六甲灵飞招真》十二事，云云。 或乘虚步玄之术，诸要妙辞，帝自撰集为一卷，及所受之事，皆承以黄金之几，封以白玉之函，以珊瑚为床，紫锦为囊，安着□梁台上，数自朝拜，烧香洒扫，帝后意旨自误，不修至戒，每事不从王母之言，王母遂不复来。 太初无年天火烧□梁台，所受十二事於是烧失矣。 《化形隐景登升保仙上经》曰：存九晨帝君隐妃九阴内名，形色衣服，皆使朗然从北斗来，下炎流映，焕烂虚无，回神玄映，入我身中。 九晨即九星之精也。 《紫度炎光经》说同也。 《真诰》曰：南岳夫人言《宝神经》是裴清灵锦囊中书，侍者常所带者，裴昔从紫微夫人受此书也，吾亦有俱如此写西宫中定本。 又问西宫所在，答云：是玄圃北坛西瑶之上台也，天真宝文尽藏於此中。 裴真人又言此尽与隐尽同辈事要，而即可得用，一名七隐玄书。 《真诰》曰：六月二十四日夜，紫微王夫人来降，因下地请问真灵云云，敢谘於此，愿诲曚昧。 夫人因令复坐，即见□令书，此以答曰：夫泛景虚玄，无涂可寻，言发空中，无物可纵，云云。 是故放荡元津，遂任风鼓枻，存乎虚舟而行耳，故实中之空，有中之无象矣，至於书迹之示，则挥於纸札云云。 骞露有骸之物，而得与世进退，上玷逸真之咏，下亏有隔之禁，亦我等所不行，灵法所不许也。 请陈为书之本始也。 造化之既肇矣，乃是五色初萌，文章尽定之秀，人民之交别，阴阳之分判，有三元八会群方飞天之书，又有八龙灵篆明光之章也，其后逮三皇之世，演八会之文，为龙凤之章，拘省云篆之迹，以为顺形梵书，分破二道，坏真从易，配别本支，乃为六十四种之书也，遂播之于三十六天十方上下也，云云。 校而论之，八会之书是书之至真，建文章之祖也，今三元八会之书，玉帝太极高真诸仙之所用也，云篆明章，今所见神灵符书之字是也。 《真诰》曰：南岳夫人语弟子，言我明日当诣王屋山清虚宫，令汝知之所至也。 《真诰》曰：紫清真妃坐良久，都不言，妃手中先握三枚枣，色如乾枣而形长，内无核，亦不作枣味，有似於梨味耳，妃先以一枚见与，次以一枚与紫微夫人，自留一枚，令各食毕，真妃问年登答，云云。 真妃又曰：君师南真夫人，司命秉权，道高妙备，寔良德之宗也。 《真诰》曰：六月二十六日夜，降八真人，紫微左夫人，紫清上宫九华真妃二，上真司命南岳夫人三，紫阳真人四，清灵真人五，茅中君六，茅小君七。 又有一神，甚少整顿，建芙蓉冠，朱衣带剑，未曾见也，隐疑是桐□山真人王子乔。 多论金庭山中事，言多有不可解者，恭玄紫微上真九华妃也，皆揖称也。",
      "translated_text": "In an instant, visualize the boy Restraining Control and the girl Ascending Return standing together within the sun and moon—the boy within the sun, the girl within the moon. The sun and moon hang in the august heavens, the sun in the east, the moon in the west. At that moment, one suddenly perceives one’s entire body as having transformed into the aforementioned white *qi*.\n\nThen, visualize hearing the boy Restraining Control within the sun chanting:\n*\"Restraining Control, Three Yang,\nPerfected of the Nine Origins—\nsuch is my title.\nThe sun binds my form,\nmy tally inscribed in Jade Clarity,\nkindred to heaven.\nMerging yin and yang,\nimmortals entwine in ecstasy.\"*\n\nNext, visualize hearing the girl Ascending Return within the moon chanting:\n*\"Ascending Return, Thearch’s Son,\nSoul of the August One—\nsuch is my title.\nThe moon binds my essence,\nmaster of the tally’s register,\nalready within Great Brilliance.\nKindred to the Mysterious,\nlife spans ten thousand myriad ages.\nMerging yin and yang,\nnaked in radiant splendor.\"*\n\nThe *Inner Transmission of Emperor Wu of Han* states: The Queen Mother of the West bestowed upon the Emperor the *Illuminated Scripture of the Five Marchmounts’ True Forms*, while the Lady of the Supreme Prime granted him the *Twelve Methods of the Six Jia Spirit-Flight Summoning the Perfected*, and so forth. There were also the arts of \"treading the void and pacing the Mysterious,\" along with various essential and wondrous incantations. The Emperor personally compiled these into a single scroll, together with all the teachings he had received. These were all presented upon a table of yellow gold, sealed in a casket of white jade, placed upon a bed of coral, and encased in a purple brocade sack. They were stored in the □ Liang Terrace, where he would daily pay homage, burning incense and sweeping the grounds. Later, the Emperor’s intentions strayed, and he failed to uphold the utmost precepts, disregarding the Queen Mother’s words in every matter. Thus, the Queen Mother never returned. In the era of Great Beginning, without year, a celestial fire burned the □ Liang Terrace, and the twelve received teachings were lost in the flames.\n\nThe *Scripture of Transforming Form, Concealing Radiance, Ascending, and Preserving Immortality* states: Visualize the Nine Dawn Lords and their hidden consorts, the Nine Yin Inner Names—their forms, colors, and attire—all made luminously manifest as they descend from the Northern Dipper. Their blazing radiance suffuses the void, resplendent and boundless, turning the spirit to reflect the Mysterious, entering my body. The Nine Dawn Lords are the essences of the nine stars.\n\nThe *Scripture of Purple Ascension and Blazing Radiance* speaks of the same.\n\nThe *Declarations of the Perfected* states: The Lady of South Marchmount said that the *Scripture of Treasuring the Spirit* was a text from the brocade pouch of Pei Qingling, which her attendants always carried. Pei had once received this scripture from the Lady of Purple Tenuity, and I also possess a copy transcribed in the Western Palace’s definitive edition.\n\nWhen asked about the location of the Western Palace, she replied: It is the terrace above the Western Jade of the Northern Altar of the Mysterious Garden. All the celestial treasures and sacred writings are stored therein.\n\nPei the Perfected also said that these texts align entirely with the essentials of the *Hidden Perfected*, and may be employed immediately. Another name for them is the *Seven Hidden Mysterious Writings*.\n\nThe *Declarations of the Perfected* states: On the night of the twenty-fourth day of the sixth month, the Lady of Purple Tenuity, Queen Wang, descended and came to earth, whereupon she was asked about the clouds of true numina. Humbly seeking instruction in these obscure matters, she was bidden to sit again. Then, □ commanded the writing of this response:\n\n*\"To drift upon the empty and mysterious,\nno path can be traced.\nWords uttered in the void,\nnothing to grasp.\nThus, unbound by the primal stream,\none surrenders to the wind’s oar.\nAbiding in the empty boat,\none travels—\nhence, the emptiness within the real,\nthe formlessness within being.\nAs for the manifestation of written traces,\nthey are merely brushed upon paper and bamboo...\"*\n\nMortal remains, though exposed, may yet advance or retreat with the world, yet above they tarnish the odes of transcendent recluses, and below they breach the prohibitions of separation. Such is not the conduct of our kind, nor is it permitted by the numinous laws. Pray, let me explain the origins of writing.\n\nOnce creation had begun, the five colors first sprouted, and the patterns of literature were fully established. With the differentiation of peoples and the separation of yin and yang, there arose the *Scriptures of the Three Origins and Eight Meetings*, the *Flying Writings of the Myriad Directions*, and the *Luminous Chapters of the Eight Dragons’ Numinous Seal-Script*. Later, in the age of the Three Sovereigns, the *Eight Meetings* were expanded into the *Dragon and Phoenix Chapters*, the traces of *Cloud-Simplified Seal-Script* were refined into *Brahmā Writing of Conforming Forms*. Divided and broken, the true was corrupted for the sake of ease, branches were matched to roots, and thus arose the sixty-four kinds of writing. These were then disseminated throughout the thirty-six heavens and the ten directions above and below.\n\nUpon examination, the *Eight Meetings* are the most authentic of writings, the ancestors of literary composition. Today, the *Scriptures of the Three Origins and Eight Meetings* are used by the Jade Thearch, the Supreme Ultimate, and the various perfected immortals. The *Luminous Chapters of Cloud Seal-Script* are the characters seen in the talismanic writings of gods and spirits.\n\nThe *Declarations of the Perfected* states: The Lady of South Marchmount told her disciples that on the morrow she would journey to the Pure Void Palace on Mount Wangwu, so that they might know her destination.\n\nThe *Declarations of the Perfected* states: The Perfected Consort of Purple Clarity sat for a long while without speaking. In her hand, she first held three dates—hued like dried dates but elongated in shape, without pits, and tasting not of dates but somewhat like pears. She first gave one to [the disciple], then gave one to the Lady of Purple Tenuity, keeping one for herself. After all had eaten, the Perfected Consort asked about Nian Deng’s age, and so forth.\n\nThe Perfected Consort further said: \"Your teacher, the Lady of South Marchmount, wields authority as Controller of Destinies. Her Dao is lofty and wondrously complete—truly the ancestral font of virtuous power.\"\n\nThe *Declarations of the Perfected* states: On the night of the twenty-sixth day of the sixth month, eight perfected beings descended: the Lady of the Left of Purple Tenuity, the Perfected Consort of the Nine Flowers of the Supreme Palace, the Controller of Destinies and Lady of South Marchmount, the Perfected Lord of Purple Yang, the Perfected Lord of Pure Numen, the Lord of the Central Mao, and the Lesser Lord of the Mao. There was also a spirit, youthful and well-composed, wearing a lotus crown and a vermilion robe, girded with a sword, whom I had never seen before. I secretly suspected him to be Wang Ziqiao, the Perfected of Tong□ Mountain. Much was discussed regarding matters of Mount Jinting, though many things were incomprehensible. Gongxuan is the Perfected Consort of the Nine Flowers of Purple Tenuity—all bowed in reverence.",
      "overlap_context": "h the practitioner’s single body, blending into one. They become a single white qi, round in shape, resembling the sun’s radiant orb. In an instant, the round luminosity of the white qi transforms into two small children, one male and one female, both resembling newborn infants. The male is called the Perfected of the Nine Origins, the female is titled the Soul of the August One. The male is named Restraining Control, styled Three Yang; the female is named Ascending Return, styled Thearch’s Son.",
      "start_char": 6319,
      "end_char": 7557,
      "start_sentence": 168,
      "end_sentence": 192,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.84881329536438,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清僊府琼林经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "官上真云，昨与叔申诣清虚宫，校为真仙得失之事耳，近顿除落四十七人，都复上三人耳，并复视尔辈之名简，如今佳耳，许某及得在伯扎中，许某即长史名。 日者霞之实，霞者日之精，君虽闻服日实之法，未见知餐霞之精也。 夫餐霞之经甚秘，致霞之道甚易，此谓体生玉光，霞映上清之法也。 眼者身之镜，耳者体之牖，视多则镜昏，听众则牖暗，妾有磨镜之石，决牖之术，即能彻洞万灵，眇察绝响，可乎。 《真诰》曰：阆野者，阆风之府是也。 昆仑上有九府，是为九宫，太极为太宫也。 诸仙人但是九官之官僚耳，至於真人，乃九宫之公卿。 夫仙官有上下，各有次秩，仙有左右府，而有左右公、左右卿、左右大夫、左右御史也。 明大洞为仙卿，服金丹为大夫，服芝为御史，若得太极隐芝服之，便为左仙公及真人矣。 真人告曰：人随俗要求华名，譬若烧香，众人皆闻其芳，然不知熏，自以燔焰尽则炁灭，名立则身绝，是故高人哂而远之，遂为清净。 又曰：有似骋冰车之陆乎炎州，泛火舟以浪於溺津矣。 自非真正，亦失者万万。",
      "translated_text": "The Perfected of the Upper Offices said: \"Yesterday, I went with Shu Shen to the Palace of Pure Vacuity to examine the successes and failures of those who have attained true transcendence. Recently, forty-seven were abruptly removed, and only three were restored to the registers. We also reviewed the name-slips of your cohort—now things are well. Xu [so-and-so] is included among the *bozha*, and Xu [so-and-so] is the name of the Chief Scribe.\n\nThe fruit of the rosy clouds is the essence of the sun, and the rosy clouds are the radiance of the sun. Though you have heard of the method of ingesting the sun’s fruit, you have not yet known the art of consuming the rosy clouds’ essence. The scriptures on consuming rosy clouds are most secret, yet the way to summon them is quite simple—this is the method of embodying jade-light and reflecting the rosy clouds of the Upper Clarity.\n\nThe eyes are the body’s mirrors, and the ears are the body’s windows. Too much seeing dims the mirror, and too much hearing darkens the windows. I possess the whetstone to polish mirrors and the technique to unseal windows—with these, you may penetrate the myriad spirits and perceive the faintest echoes. Is this acceptable?\"\n\nThe *Zhen’gao* states: \"The Wilds of Lang are the precincts of Langfeng. Atop Kunlun lie the Nine Offices, which are the Nine Palaces, with the Great Ultimate as the Grand Palace. All immortals are merely the functionaries of the Nine Palaces, while the Perfected are the dukes and ministers of the Nine Palaces.\n\nThe offices of transcendents have ranks, each with its proper order. There are left and right bureaus of transcendents, with left and right dukes, left and right ministers, left and right grand masters, and left and right censors. Those who master the Great Cavern are the ministers of transcendents; those who ingest golden elixirs are the grand masters; those who consume magic mushrooms are the censors. If one obtains and consumes the Hidden Mushroom of the Great Ultimate, one becomes the Left Duke of Transcendents and a Perfected.\n\nThe Perfected said: \"People follow worldly customs in seeking vain reputations—it is like burning incense: though many smell its fragrance, they do not know that the smoke, once its flame is spent, disperses and vanishes. When fame is established, the person perishes. Thus, the lofty withdraw and remain in purity.\"\n\nThey also said: \"It is like racing an ice-chariot across the fiery lands of the south or sailing a fire-boat upon drowning waters. Without true rectitude, failure is certain in ten thousand cases out of ten thousand.\"",
      "overlap_context": "d Lord of Pure Numen, the Lord of the Central Mao, and the Lesser Lord of the Mao. There was also a spirit, youthful and well-composed, wearing a lotus crown and a vermilion robe, girded with a sword, whom I had never seen before. I secretly suspected him to be Wang Ziqiao, the Perfected of Tong□ Mountain. Much was discussed regarding matters of Mount Jinting, though many things were incomprehensible. Gongxuan is the Perfected Consort of the Nine Flowers of Purple Tenuity—all bowed in reverence.",
      "start_char": 7557,
      "end_char": 7976,
      "start_sentence": 193,
      "end_sentence": 204,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.227318048477173,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清僊府琼林经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "《真诰》曰：张姜子等先在第二等中，亦始得入易迁耳，易迁童初二宫，是男女之道堂馆也，其中闲静，东海青君一年再游，校此诸宫，观见群辈也。 赵素台，在易迁中已四百年，不肯徙，自谓天下无复乐此处也。 素台，赵熙之女，熙汉时为幽州刺史，有济穷人於河中，救玉惠等於族诛，行阴德数十事，故其身得诣朱陵，其儿子今并得在洞天中也，熙常出入定录府。 易迁中有高业而萧条者，有窦琼英、韩太华、刘春龙、王进贤、李奚子、郭叔香，此数人并天姿郁秀，澄尚眇邈，才及拟胜，仪观骇众，此即主者之高者，仙官之可才，其次及得张姜子辈，邓伯苗母有善行，故后来人多宗庇之。 窦琼英者，窦武之妹也，七世祖有名峙者，以藏枯骨活死为事，故祚及於英身矣。 韩太华者，安国妹，汉二师将军李广利之妇，利宿世有功德，利今亦在宫受化。 刘春龙者，汉宗正刘奉先之女。 李奚子者，李忠之祖母也，忠晋东平太守，忠祖父云云，多行阴德，尝天大雪寒，常露谷於园庭，恐鸟饿死，其用心如此。 王进贤，王衍女也。 事许长史。",
      "translated_text": "*The Declarations of the Perfected* states: Zhang Jiangzi and others were initially ranked in the second grade, having only just entered the Palace of Easy Transitions. The Palace of Easy Transitions and the Youthful Prime Palace are the halls and chambers of the Dao of man and woman. Within them, all is serene and tranquil. The Azure Lord of the Eastern Sea visits twice a year, inspecting these palaces and observing the assembled multitudes.\n\nZhao Sutai has dwelled in the Palace of Easy Transitions for four hundred years and refuses to move, declaring that nowhere in the world brings greater joy than this place. Sutai was the daughter of Zhao Xi, who served as Inspector of Youzhou during the Han. Xi aided the destitute in the Yellow River, rescued Yu Hui and others from the execution of their clans, and performed countless acts of hidden virtue. Thus, he himself attained the Vermilion Mound, and his descendants now dwell in the Grotto-Heavens. Xi frequently enters and exits the Palace of the Register of Destinies.\n\nAmong those in the Palace of Easy Transitions who have attained lofty merit yet remain in quiet obscurity are Dou Qiongying, Han Taihua, Liu Chunlong, Wang Jinxian, Li Xizi, and Guo Shuxiang. These individuals possess natures of dense elegance, their aspirations pure and distant, their talents surpassing all comparison, their bearing awe-inspiring to the multitude. They are the most exalted among the stewards, the most capable among the transcendents’ officials. Those of the next rank include Zhang Jiangzi and her peers. Deng Boniao’s mother performed many virtuous deeds, and thus later arrivals often seek her patronage and protection.\n\nDou Qiongying was the younger sister of Dou Wu. Her seventh-generation ancestor, a man named Zhi, made it his life’s work to gather dry bones and restore the dead to life. Thus, his blessings extended to Qiongying’s own lifetime.\n\nHan Taihua was the younger sister of Han Anguo and the wife of Li Guangli, the Han general of the Second Campaign against Dayuan. Guangli had accumulated merit and virtue in past lives, and he now resides in the palace undergoing transformation.\n\nLiu Chunlong was the daughter of Liu Fengxian, the Han Minister of the Imperial Clan.\n\nLi Xizi was the grandmother of Li Zhong, who served as Grand Administrator of Dongping during the Jin. Zhong’s grandfather (and others) performed many acts of hidden virtue. Once, during a great snowstorm, he scattered grain in the garden courtyard, fearing the birds would starve. Such was the depth of his compassion.\n\nWang Jinxian was the daughter of Wang Yan.\n\n[Her] affairs were overseen by Attendant Xu.",
      "overlap_context": "worldly customs in seeking vain reputations—it is like burning incense: though many smell its fragrance, they do not know that the smoke, once its flame is spent, disperses and vanishes. When fame is established, the person perishes. Thus, the lofty withdraw and remain in purity.\"\n\nThey also said: \"It is like racing an ice-chariot across the fiery lands of the south or sailing a fire-boat upon drowning waters. Without true rectitude, failure is certain in ten thousand cases out of ten thousand.\"",
      "start_char": 7977,
      "end_char": 8400,
      "start_sentence": 205,
      "end_sentence": 214,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.278423547744751,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清僊府琼林经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "郭叔香者，王修母也。 王修字叔治，北海人，魏武郎中令，年七岁丧母，母以社日亡，不知是郭谁也。 其童初府有王少道、范叔胜、李伯山，皆童初府之标者。 《真诰》曰：郎宗，字仲绥，北海安丘人，少仕官为吴县令，学精道术，占候风炁，后一旦有暴风经窗间，占知京师大火烧大夏门，遣人往参果尔，诸公闻之，以博士征宗，耻以占候就征，夜解印绶负笈遁去，居华山下，服胡麻丸得道，今在洞中。 又有朱□者，陈留人也，为人无道，专作劫盗，后人发觉云云。 远遁他境，至汝南少室山中，见冯先生隐学云云，后三年乃授其真道，留山服食，修道三十八年，后入东坑山中，寿百四十七岁，仙人降，将入大有山洞中成真人。 又有郭静者，颖川人也，少孤云云。 年十六县召为吏，后得下罪逃伏，经二月不出，遇见郑先生云云。 静遂随郑驱使，经七年不敢懈怠，遂授其导引之要，饵服山木、茯苓，得寿三百年，后於天维山中赤松子降授其二人真道，今在大有洞中为真人。 又曰：司马季主后入委羽山石室大有宫中，受石精金光藏景化形法於西灵子都，子都者，太玄仙女也。 其同时今在大有室中者，广宁鲍叔阳，太原王伯养，颖川刘伟惠、代郡段季正，俱受师西灵子都之道也。 季主临去之际，托形枕席为代己之象，墓在蜀郡成都升盘山之南，诸葛武侯昔建碑铭德於季主墓前，碑赞末曰：玄漠太寂，混合阴阳，天地交泮，万品滋彰。 先生理蓍，分别柔刚，鬼神以观，六度显明。 季主颜如少女，髭鬓三天，其黑如墨。",
      "translated_text": "Guo Shuxiang was the mother of Wang Xiu. Wang Xiu, styled Shuzhi, was a native of Beihai. During the Wei, he served as Cavalier Attendant-in-Ordinary to the Martial Emperor. At the age of seven, he lost his mother, who passed away on the day of the She Festival. It was not known to whom among the Guos she belonged.\n\nIn his youth, the prefectural office had Wang Shaodao, Fan Shusheng, and Li Boshan, all paragons of the prefectural office in their youth.\n\nThe *True Records* states: Lang Zong, styled Zhongsui, was a native of Anqiu in Beihai. In his early years, he served as Magistrate of Wu County. His studies delved deeply into the Daoist arts, and he was skilled in divining the winds and qi. One day, a sudden gale swept through his window. Upon divination, he knew that a great fire would burn the Great Xia Gate in the capital. He sent someone to verify, and indeed, it was so. When the various lords heard of this, they summoned Zong as a Academician. Ashamed to be summoned for his divination skills, he removed his official seal and sash by night, shouldered his satchel, and fled. He dwelled beneath Mount Hua, ingested sesame pills, and attained the Dao. He now resides within the grotto.\n\nThere was also Zhu [missing character], a native of Chenliu. He was a man without the Way, devoted solely to robbery and banditry. Later, when his crimes were discovered, he fled far away to another region. Arriving at Mount Shaoshi in Runan, he encountered Master Feng, who lived in reclusion and studied the Dao. After three years, he was transmitted the true Dao. Remaining on the mountain to ingest herbs and cultivate the Way for thirty-eight years, he later entered Mount Dongkeng. At the age of one hundred and forty-seven, immortals descended and led him into the grotto of Mount Dayou, where he became a perfected one.\n\nThere was also Guo Jing, a native of Yingchuan. Orphaned in his youth, at the age of sixteen, he was summoned by the county to serve as an official. Later, he committed a minor offense and fled into hiding, remaining secluded for two months. He then encountered Master Zheng. Jing thereafter followed Zheng, serving him for seven years without敢懈怠. He was transmitted the essentials of guiding and pulling, ingested mountain herbs and *fuling*, and attained a lifespan of three hundred years. Later, in Mount Tianwei, Master Red Pine descended and transmitted to the two of them the true Dao. They now reside in the grotto of Mount Dayou as perfected ones.\n\nIt further states: Sima Jizhu later entered the stone chamber of the Dayou Palace in Mount Weiyu, where he received from Xiling Zidu the method of \"Concealing the Radiance and Transforming the Form with Stone Essence and Golden Light.\" Zidu was a transcendent maiden of the Great Mystery. Those who, in the same era, now reside in the Dayou chamber include Bao Shuyang of Guangning, Wang Boyang of Taiyuan, Liu Weihui of Yingchuan, and Duan Jizheng of Daijun, all of whom received the Way from their master, Xiling Zidu.\n\nAs Jizhu was about to depart, he left behind his form upon the pillow and mat as a likeness to replace himself. His tomb lies south of Mount Shengpan in Chengdu of Shu Commandery. In former times, Marquis Wu of Shu, Zhuge Liang, erected a stele before Jizhu’s tomb to inscribe his virtue. At the end of the stele’s eulogy, it reads:\n\nThe profound desert, the great stillness,\nMerging yin and yang,\nHeaven and earth intermingle,\nMyriad beings flourish and manifest.\nThe master ordered the milfoil,\nDistinguishing the soft and hard.\nSpirits and gods beheld,\nThe Six Perfections shone clearly.\n\nJizhu’s complexion was like that of a young maiden, his beard and sideburns those of the Three Heavens, black as ink.",
      "overlap_context": "n.\n\nLiu Chunlong was the daughter of Liu Fengxian, the Han Minister of the Imperial Clan.\n\nLi Xizi was the grandmother of Li Zhong, who served as Grand Administrator of Dongping during the Jin. Zhong’s grandfather (and others) performed many acts of hidden virtue. Once, during a great snowstorm, he scattered grain in the garden courtyard, fearing the birds would starve. Such was the depth of his compassion.\n\nWang Jinxian was the daughter of Wang Yan.\n\n[Her] affairs were overseen by Attendant Xu.",
      "start_char": 8400,
      "end_char": 8991,
      "start_sentence": 215,
      "end_sentence": 228,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.826584339141846,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清僊府琼林经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "男女二人各令修道，男名汝育，女名济华，今皆在委羽山中，济华今日正读三十九章，犹未过竟。 《裴君序诀》曰：裴君字玄仁，少为人颜仪整素，目有精光，垂臂下膝，声气高彻，呼如锺鸣。 《真诰》曰：火枣交梨之树在君心中也，今心中犹有荆棘相杂，是以二树不见，不审可剪荆棘出树否，此树单生，其几好也。 《登真隐诀》曰：太微造形紫元内神二十四人，生气变神，主仙上精，能修存名字者，治镇一身，保守元精，紫虚并结气之玄宗，成体之具神，连导云雾，带生真烟，各能致玉辇龙骑，千万列行，同舆一体，白日登晨，此大真人乘飙欻之道，行之十八年，太上命太微混灵道君，檄二十四真人，千乘万骑，驰风蹑云，呼吸流升，白日造天注内。 案《三一经》云：太微中有二十四气，气中有二十四真人，皆帝皇之臣，所以致分道变化矣。 既致守身中三一，则上太微三一，帝皇之君而降见於外，与子言矣，皆出入上清，寝止太微，案如此言，令守身中三部，亦能致彼二十四真，千乘万骑而来迎也。 入日左龙名飙精，右龙名欻亭，存二龙并吐白烟，非止己身之神真，能腾跃玄霄矣。 《葛仙公内传》曰：从叔孝先曰：卿迈俗味，奔华道，慕神仙，乃巢绮之上真佳事也。 上清仙府琼林经竟 #1『诣』原本误作『请』，据文义改。 #2『京』字据文义补。 #3『曰』字据文义补。 #4『声』字据文义补。 #5『仙』字据文义补。",
      "translated_text": "Let two disciples, one male and one female, each cultivate the Dao. The male is named Ru Yu, and the female is named Ji Hua. Both now reside within Mount Weiyu, where Ji Hua today is reciting the Thirty-Nine Chapters, though she has yet to complete them.\n\nThe *Preface to the Formulae of Master Pei* states: Master Pei, styled Xuanren, was dignified and unadorned in his youthful appearance. His eyes shone with a luminous essence, his arms hung past his knees, and his voice was resonant and clear, ringing like a struck bell.\n\nThe *True Reports* says: The trees of fire-jujubes and intersecting pears grow within your heart. Yet now, thorns and brambles are tangled among them, which is why the two trees remain unseen. I wonder if one might prune the brambles to reveal the trees—these trees grow alone, and how fine they would be!\n\nThe *Hidden Formulae for Ascending Perfection* states: Within the Purple Prime of the Grand Tenuity dwell twenty-four inner spirits, born of generative qi and transformed into numinous beings. They govern the essence of transcendence. Those who cultivate and invoke their names will govern and guard the primordial essence of the body. The Purple Void unites with the mysterious origin of conjoined qi, forming the vessel of embodied spirit. They guide clouds and mist, gird themselves with the true smoke of life, and each may summon jade chariots and dragon-riders, arrayed in ranks of thousands. Together, they ascend as one, mounting the dawn in broad daylight. This is the Way of the Great Perfected, who ride the whirlwind and vanish in an instant. After eighteen years of practice, the Most High commanded the Lord of the Grand Tenuity and Blended Numinosity to dispatch the twenty-four perfected ones. With a thousand chariots and ten thousand riders, they galloped upon the wind and trod the clouds, inhaling and exhaling to ascend in flowing ascent, entering the celestial registers in broad daylight.\n\nAccording to the *Scripture of the Three Ones*: Within the Grand Tenuity dwell twenty-four qi, and within each qi resides a perfected one, all ministers of the Thearchs. Through them, the Dao achieves its manifold transformations.\n\nOnce one has attained the Three Ones within the body, the Three Ones of the Grand Tenuity—the Lords of the Thearchs—will descend and manifest externally, speaking with you. They come and go from the Supreme Clarity, resting within the Grand Tenuity. As this text states, by guarding the Three Sections within the body, one may also summon those twenty-four perfected ones, who will arrive with a thousand chariots and ten thousand riders to welcome you.\n\nThe dragon on the left of the sun is named Whirlwind Essence, and the dragon on the right is named Vanishing Pavilion. Visualize the two dragons exhaling white mist, and not only will your own spirit-perfected ones ascend the mysterious heavens.\n\nThe *Inner Biography of Lord Ge the Immortal* records: My uncle, Xiaoxian, said, “You have transcended worldly tastes, forsaken splendor for the Dao, and aspired to immortality—this is the noble pursuit of the loftiest perfected ones.”\n\nThe *Jade Grove Scripture of the Supreme Clarity’s Immortal Courts* is now complete.",
      "overlap_context": "f Shu, Zhuge Liang, erected a stele before Jizhu’s tomb to inscribe his virtue. At the end of the stele’s eulogy, it reads:\n\nThe profound desert, the great stillness,\nMerging yin and yang,\nHeaven and earth intermingle,\nMyriad beings flourish and manifest.\nThe master ordered the milfoil,\nDistinguishing the soft and hard.\nSpirits and gods beheld,\nThe Six Perfections shone clearly.\n\nJizhu’s complexion was like that of a young maiden, his beard and sideburns those of the Three Heavens, black as ink.",
      "start_char": 8991,
      "end_char": 9569,
      "start_sentence": 229,
      "end_sentence": 242,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.468995809555054,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清僊府琼林经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}