{
  "source_id": "上清元始谱箓太真玉诀",
  "source_file": "chunked_daozang\\上清元始谱箓太真玉诀.json",
  "total_chunks": 3,
  "total_original_chars": 3234,
  "total_translated_chars": 21512,
  "total_translation_time": 100.84330773353577,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\上清元始谱箓太真玉诀.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Clarity Register of the Primordial Beginning and the Jade Instructions of the Great Perfection**\n\n**Title:** *The Supreme Clarity Register of the Primordial Beginning and the Jade Instructions of the Great Perfection* (also known as *Dissolving the Form, Escaping Transformation, and Flowing Radiance of Jade Light*)\n\n**Author:** Unknown, approximately dated to the Eastern Jin or Southern Dynasties.\n**Content:** Discusses methods for shedding the Three Corpses and dissolving the Five Sufferings.\n**Volume:** One.\n**Source Text:** *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n---\n\n### **The Three Evil Gates**\n\n**First Gate:** The Gate of Sensual Desire, also called the Path of the Upper Corpse or the Realm of Heavenly Transgressors.\n**Second Gate:** The Gate of Attachment, also called the Path of the Middle Corpse or the Realm of Human Transgressors.\n**Third Gate:** The Gate of Gluttony, also called the Path of the Lower Corpse or the Realm of Earthly Transgressors.\n\nThese Three Evil Gates are also known as the Paths of the Three Corpses or the Realms of the Three Transgressors. They constantly dwell within the human body, blocking the mouths of the Three Passes, severing the roots of the Three Lives, obstructing the path of immortal study, and suppressing the soaring hun-souls of those who seek transcendence.\n\nThe foundation of learning lies in shedding the Corpses from the Three Paths and eliminating desires at the gates of the Three Realms. How else can the True One descend? How else can the Dao be accomplished?\n\nThose who study the supreme methods must dispel all desires, extinguish the roots of the Corpses, and the Dao will naturally descend; immortality will naturally be achieved. Only then can one soar and ascend to the Three Clarities.\n\n---\n\n### **The Five Suffering Gates**\n\n**First Gate:** The Gate of Sensual Bondage and Heart Suffering, also called the Path of Suffering in the Earth Prison of Mount Tai.\n**Second Gate:** The Gate of Attachment and Spirit Suffering, also called the Path of Suffering under Wind and Blade.\n**Third Gate:** The Gate of Greed and Bodily Suffering, also called the Path of Suffering under the Burden of Mountains and Stones.\n**Fourth Gate:** The Gate of Vanity and Essence Suffering, also called the Path of Suffering in Rivers and Seas.\n**Fifth Gate:** The Gate of Bodily Bondage and Multifold Suffering, also called the Path of Suffering in Boiling Cauldrons, Fire-Swallowing, and Coal-Eating.\n\nThese Five Gates of Suffering and Five Paths constantly reside within the human body, binding the roots of life, obstructing the path to summoning the True, and severing the gate of immortal cultivation.\n\nThe foundation of learning lies in dissolving the form from the Five Paths and eradicating traces beneath the Five Sufferings. If the myriad bonds are not severed, one will sink into the gates of sin—how then can liberation be attained? How can the body escape, transform, and radiate the flowing jade light?\n\nThose who seek the supreme study must first sever all bonds and extinguish the paths of suffering. The True One will naturally descend; divine immortality will naturally be achieved. Only then can one transform the form and wander through the heavens.\n\n---\n\n### **Shedding the Path of the Upper Corpse**\n\nTo shed the Path of the Upper Corpse, inscribe the *Upper Primordial Jade Talisman for Extinguishing Desire, Beheading the Corpse, Transforming Radiance, and Flowing Light* in green, and place it upon the head.\n\nAt the Gate of Sensual Desire, face north while holding a blade in the mouth. Prepare a cup of pure water and place it before the water’s surface. The master stands behind the disciple, strikes the teeth nine times, and recites the incantation:\n\n> *The Upper Corpse, Green Desire, styles itself Peng Ju,*\n> *Transforming into nine forms, with a bird’s head and serpent’s body,*\n> *Chaotic and heartless, now sinking, now floating,*\n> *Gluttonous for fine flavors, dwelling in gaudy beauty,*\n> *It roams as the human hun and po, secretly recording transgressions,*\n> *Severing life’s roots, scattering qi, and causing the spirit to wander,*\n> *Rampant through the Three Palaces, a tiny worm without toil.*\n>\n> *True Person Jia Yi, bearing the register and wearing the talisman,*\n> *Has severed sensual desire and removed the path of death.*\n> *By the command of the Primordial Beginning, I beseech the beheading of the Corpse’s head.*\n> *The Three Terraces oversee the form—depart swiftly, linger not!*\n> *Eradicate the root, exterminate the lineage, leave no remnant behind.*\n>\n> *Jia Yi refines the True, the Three Palaces purified and void,*\n> *The Five Emperors descend in radiance, the Great One inscribes the register.*\n> *Bathed in the Northern Primordial, crowned and girded, traversing the realms,*\n> *Ascending boundlessly, riding the jade chariot of flowing radiance,*\n> *Escaping and transforming in the Supreme Clarity, roaming the void.*\n\nUpon completion, the master takes the blade held in the disciple’s mouth and circles the disciple’s head nine times. The rolled jade talisman is then buried beneath the Gate of Sensual Desire, and the cup of water is poured over it.\n\nBy practicing this method, the Upper Corpse is extinguished, sensual desire is eradicated, and the body transcends the Realm of Heavenly Transgressors. The form and hun-soul are freed from the afflictions of suffering.\n\n**The Great Perfection’s supreme path must not be lightly transmitted.**\n\nProceed in order to the Middle Gate to shed the Middle Corpse.\n\n---\n\n### **Shedding the Middle Corpse**\n\nTo shed the Middle Corpse, inscribe the *Middle Primordial Jade Talisman for Extinguishing Desire, Beheading the Corpse, Transforming Radiance, and Flowing Light* in yellow, and place it before the heart.\n\nAt the Gate of Attachment, face the sovereign while holding the blade toward the abdomen. Place a cup of pure water before you. The master stands behind, strikes the teeth twelve times, and recites the incantation:\n\n> *The Middle Corpse, Peng Zhi, styles itself the Central Yellow,*\n> *Dwelling in attachment, hiding within the abdomen,*\n> *Sinking and floating, transforming without fixed form,*\n> *Seizing the human hun and po, roaming the Three Palaces,*\n> *The Red Child races wildly, driving one to madness,*\n> *Desire consumes the spirit—guilt lies with the tiny worm.*\n>\n> *True Person Jia Yi, summoned by the Celestial Emperor,*\n> *Bears the jade talisman, the cinnabar script and golden seal,*\n> *Inscribed in the Primordial Register. The Three Desires are extinguished.*\n> *By the command of the Primordial Beginning, the Corpse’s form is beheaded and eradicated,*\n> *Its root severed, its lineage exterminated—let it not take flight!*\n>\n> *Jia Yi undergoes refinement, the Five Talismans sustain without grain,*\n> *True immortals settle in peace, light born within the hidden.*\n> *The Five Emperors oversee, the Great One arrays the ranks,*\n> *Bathed in the Middle Primordial, crowned and robed,*\n> *Dissolving the form, escaping transformation, flowing jade radiance,*\n> *Ascending to the Supreme Clarity, breathing in the Great Void,*\n> *Eternally preserving the natural, boundless as heaven and earth.*\n\nProceed in order to the Lower Gate to shed the Lower Corpse.\n\n---\n\n### **Shedding the Lower Corpse**\n\nTo shed the Lower Corpse, inscribe the *Lower Primordial Jade Talisman for Extinguishing Desire, Beheading the Corpse, Transforming Radiance, and Flowing Light* in white, and place it upon both feet.\n\nAt the Gate of Lower Desire, face south and lay the blade horizontally upon the feet. Place a cup of pure water beneath the feet. The master stands behind, strikes the teeth three times, and recites the incantation:\n\n> *The Lower Corpse, Peng Jiao, glories in gluttony,*\n> *White and chaotic, its body without fixed form,*\n> *Dwelling in the human feet, stirring emotions,*\n> *Whispering gains and losses, roaming as the hun and ling,*\n> *Disturbing the Three Palaces, the Red Child restless,*\n> *A tiny worm of desire, trading in the dark netherworld.*\n>\n> *True Person Jia Yi, the Three Refinements now purified,*\n> *The Gate of Desire sealed, no longer receiving demonic essence.*\n> *By the urgent command of the Primordial Beginning, the Three Terraces descend to the court—*\n> *Depart swiftly, hide not, nor your brethren,*\n> *Nor your ninefold descendants! All forms beheaded at once.*\n> *The Five Emperors deliver the True, the Great One records the name,*\n> *Bathed in the Lower Primordial, crowned and feather-robed in azure,*\n> *Transcending the Three Realms, drinking primordial essence,*\n> *Dissolving the form, escaping transformation, ascending to the Supreme Clarity,*\n> *Treading the void in dark steps, the Three Radiances shining as one.*\n\n**The Great Perfection’s supreme path must not be lightly transmitted.**\n\nOnce the Three Realms are transcended, one then traverses the path of the Five Sufferings. The method for *dissolving form and escaping transformation* to ascend beyond the Five Paths requires the preparation of a new set of robes, headscarf, and shoes. Upon the first gate of the *Gate of Accumulated Suffering of the Heart*, inscribe in black the *Jade Talisman for Dissolving Form, Escaping Transformation, Extinguishing Hell, and Flowing Radiance*. Place it beneath the feet, stand facing north, and the master strikes the teeth five times, reciting the incantation:\n\n*\"Dissolve form, escape transformation,*\n*Cast off the corpse’s five tribulations.*\n*The Three Desires now purified,*\n*Divine nectar inwardly irrigates.*\n*Shed the old, refine the new,*\n*Body fragrant as orchid and sweet herb.*\n*The jade talisman erases traces,*\n*No earthly bonds constrain.*\n*Ascend through heaven’s realms,*\n*Surpassing the clouds’ edge.*\n*The Demon Kings guard the True,*\n*Qi merges with the natural.*\n*Seven ancestors ascend together,*\n*Treading the steps of heaven’s gate.*\n*The Five Emperors oversee,*\n*All spirits hear and witness.\"*\n\nUpon completion, remove the headscarf and untie the knots, bury the talisman beneath the feet, and discard the shoes. Proceed next to the *Gate of the Spirit of Love and Desire’s Suffering*.\n\nUpon the *Gate of the Spirit of Love and Desire’s Suffering*, inscribe in white the *Jade Talisman for Dissolving Form, Escaping Transformation, Extinguishing the Wind-Blade, and Flowing Radiance*. Place it beneath the feet, stand facing west, and the master strikes the teeth seven times, reciting the incantation:\n\n*\"Clouds drift, steps take flight,*\n*Escaping transformation in jade light.*\n*Dissolve form, erase traces,*\n*Loose hair soars free.*\n*No bonds in the human realm,*\n*Riding the void’s expanse.*\n*The Heavenly Demons now guard,*\n*The Five Paths open wide.*\n*Cross beyond wind-blades,*\n*Form ascends to the Upper Palace.\"*\n\nUpon completion, bury the talisman beneath the feet and proceed in order to the *Gate of the Suffering Form of Greed and Desire*.\n\n*(The following text is missing in the original.)*\n\n**Method for Presenting Memorials at the Gates of the Nine Heavens:**\nUse silver wood, one foot and two inches in length, two inches and four fen in width. After reading the memorial, bury it beneath the respective gate.\n\nAt the gate of the *Jade Lord of the Immeasurable Heaven of Utmost Joy*, *So-and-so, Emperor-Master Wang Jia*, bows twice in audience.\nAt the gate of the *Jade Lord of the Immeasurable Longevity Heaven of Meditative Goodness*, *So-and-so, Emperor-Master Wang Jia*, bows twice in audience.\nAt the gate of the *Jade Lord of the Brahmā-Monitor Heaven*, *So-and-so, Emperor-Master Wang Jia*, bows twice in audience.\nAt the gate of the *Jade Lord of the Tuṣita Heaven*, *So-and-so, Emperor-Master Wang Jia*, bows twice in audience.\nAt the gate of the *Jade Lord of the Heaven of No Joy in Pride*, *So-and-so, Emperor-Master Wang Jia*, bows twice in audience.\nAt the gate of the *Jade Lord of the Heaven of Responsive Transformation*, *So-and-so, Emperor-Master Wang Jia*, bows twice in audience.\nAt the gate of the *Jade Lord of the Brahmā-Treasure Heaven*, *So-and-so, Emperor-Master Wang Jia*, bows twice in audience.\nAt the gate of the *Jade Lord of the Parīttābha Heaven*, *So-and-so, Emperor-Master Wang Jia*, bows twice in audience.\nAt the gate of the *Jade Lord of the Brahmā-Kāyika Heaven*, *So-and-so, Emperor-Master Wang Jia*, bows twice in audience.\n\nPlace the nine memorials in order.\n\n**First:** The *Imperial Throne of the Pristine and Subtle August Celestial Heaven of the Primordial Yang Qi*.\n**Second:** The *Imperial Throne of the Yu-Yu Supreme Brightness Jade Perfection Heaven of the Upper Yang Qi*.\n**Third:** The *Imperial Throne of the Great Crimson Clarity and Brightness Haotong Heaven of the Great Yang Qi*.\n**Fourth:** The *Imperial Throne of the Immeasurable Mysterious Womb Nurturing Heaven of the Pure Yang Qi*.\n**Fifth:** The *Imperial Throne of the Immeasurable Longevity Primordial Brightness Literary Elevation Heaven of the Penetrating Yang Qi*.\n**Sixth:** The *Imperial Throne of the Brahmā-Monitor Upper Brightness Seven Luminaries Heaven of the Penetrating Yang Qi*.\n**Seventh:** The *Imperial Throne of the Tuṣita Void-Transcending Balance Heaven of the Establishing Yang Qi*.\n**Eighth:** The *Imperial Throne of the Heaven of No Joy in Pride, Supreme Ultimate Veiled Brilliance of the Utmost Yang Qi*.\n\nThe eight heavens of the *Eastern Primordial Yang Qi* tablet proceed leftward in order. Place one lamp beneath each tablet, totaling eight lamps.\n\n**First:** The *Imperial Throne of the Heaven of Responsive Transformation, Crimson Clarity and Harmonious Yang of the Yang’s Beginning Qi*.\n**Second:** The *Imperial Throne of the Brahmā-Treasure Mysterious Clarity Reverent Splendor Heaven of the Yang’s Radiance Qi*.\n**Third:** The *Imperial Throne of the Māra-Kāyika Heaven of Illuminating Brilliance and Ancestral Drifting of the Yang’s Cavern Qi*.\n**Fourth:** The *Imperial Throne of the Parīttābha Heaven of the Bamboo Grove’s August Drum of the Yang’s Clarity Qi*.\n**Fifth:** The *Imperial Throne of the Heaven of Soft Clarity, Void Brightness, and Hall’s Brilliance of the Yang’s Expansion Qi*.\n**Sixth:** The *Imperial Throne of the Heaven of Māra-Soft Harmony, Observing Clarity, and Upright Stillness of the Yang’s Clarity Qi*.\n**Seventh:** The *Imperial Throne of the Heaven of Remembering-La, Mysterious Clarity, and Reverent Celebration of the Yang’s Vast Qi*.\n**Eighth:** The *Imperial Throne of the Heaven of Naśī, Supreme Flaming Brilliance, and Ultimate Jade of the Yang’s Utmost Qi*.\n\nThe eight heavens of the *Southern Yang’s Beginning Qi* tablet proceed leftward in order. Place one lamp beneath each tablet, totaling eight lamps.\n\n**First:** The *Imperial Throne of the Heaven of Pāri, Primordial Bearing, and Empty Ascent of the Lesser Yin Qi*.\n**Second:** The *Imperial Throne of the Heaven of Naśī, Supreme Peace, and August Cliff of the Great Yin Qi*.\n**Third:** The *Imperial Throne of the Heaven of Naśī-Ji, Manifest Stability, and Ultimate Wind of the Vast Yin Qi*.\n**Fourth:** The *Imperial Throne of the Heaven of Anavatapta, Primordial Filial Piety, and August Mang of the Cavern Yin Qi*.\n**Fifth:** The *Imperial Throne of the Heaven of Pāramitā, Great Yellow Elder, and Heavy Heaven of the Mysterious Yin Qi*.\n**Sixth:** The *Imperial Throne of the Heaven of Brahmā-Clarity, No-Thought, and River’s Origin of the Mysterious Yin Qi*.\n**Seventh:** The *Imperial Throne of the Heaven of Nai-Ning, Primordial Upper Deliberation, and Joyous Obscurity of the August Yin Qi*.\n**Eighth:** The *Imperial Throne of the Heaven of Ālaya, Primordial Ultimate, and Cloud-Vow of the Utmost Yin Qi*.\n\nThe eight heavens of the *Western Lesser Yin Qi* tablet proceed leftward in order. Place one lamp beneath each tablet, totaling eight lamps.\n\n**First:** The *Imperial Throne of the Heaven of Anai, Luminous Court, and Rosy Transcendence of the Yin’s Birth Qi*.\n**Second:** The *Imperial Throne of the Heaven of Fan-Ming, People’s Abyss, and Penetrating Primordial Cavern of the Transformative Yin Qi*.\n**Third:** The *Imperial Throne of the Heaven of Li-Na, Supreme Literary Splendor, and Grace of the Yin’s Clarity Qi*.\n**Fourth:** The *Imperial Throne of the Heaven of Bright Brahmā, Supreme Simplicity, and Forbidden Upper Realm of the Cavern Yin Qi*.\n**Fifth:** The *Imperial Throne of the Heaven of Ani-Gou, Great Void, and Constant Fusion of the Yin’s Spirit Qi*.\n**Sixth:** The *Imperial Throne of the Heaven of Xiang-Da, Supreme Release, and Ascendant Victory of the Yin’s Spirit Qi*.\n**Seventh:** The *Imperial Throne of the Heaven of Great Brahmā, Supreme Obscurity, and Dragon Transformation of the Yin’s Vast Qi*.\n**Eighth:** The *Imperial Throne of the Heaven of Meditative Cicada, Natural Supreme Ultimate, and Splendid Obscurity of the Yin’s Utmost Qi*.\n\nThe eight heavens of the *Northern Yin’s Birth Qi* tablet proceed leftward in order. Place one lamp beneath each tablet, totaling eight lamps. The thirty-two heavenly tablets of the four directions, each with one lamp beneath, illuminate the thirty-two heavens.\n\nUpon completion of the rites, begin from the eastern tablet, bow twice, and declare: \"I, so-and-so, of the rank Wang Jia, now offer a living substitute to transform my form and alter my name, passing through the gates of the Three Evils and Five Paths. Unable to endure the suffering of form and soul, I have received the celestial grace in full.\" Proceed thus through the thirty-two southern tablets to complete the reception.\n\n**To sever the path of the Upper Corpse:**\nInscribe in blue on white silk, place upon the head.\n*Upper Prime’s Desire-Erasing, Corpse-Severing, Radiant-Light Jade Talisman of Transformative Splendor.*\n\n**To sever the path of the Middle Corpse:**\nInscribe in yellow on white silk, place before the heart.\n*Middle Prime’s Desire-Erasing, Corpse-Severing, Radiant-Light Jade Talisman of Transformative Splendor.*\n\n**To sever the path of the Lower Corpse:**\nInscribe in white on white silk, place upon both feet.\n*Lower Prime’s Desire-Erasing, Corpse-Severing, Radiant-Light Jade Talisman of Transformative Splendor.*\n\nThe three talismans, once inscribed and positioned as prescribed, are buried at the gates of the Three Evils. Water is poured over the site before departing.\n\n**Jade Talisman of Radiant Escape for Dissolving Form, Concealing Transformation, and Transcending Hell:**\nInscribe in black on white silk, place beneath both feet to sever the root of suffering from sensory entanglements. Upon completion, bury beneath the gate to dissolve the form.\n\n**Jade Talisman of Radiant Escape for Dissolving Form, Concealing Transformation, and Transcending the Wind-Blade:**\nInscribe in white on silk, place beneath both feet to sever the root of suffering from craving and desire. Upon completion, bury beneath the gate to dissolve the form.\n\n**Jade Talisman of Radiant Escape for Dissolving Form, Concealing Transformation, and Transcending the Crushing Stones:**\nInscribe in red on white silk, place beneath both feet to sever the root of suffering from greed and desire. Upon completion, bury beneath the gate to dissolve the form.\n\n**Jade Talisman of Radiant Escape for Dissolving Form, Concealing Transformation, and Transcending the Rivers and Seas:**\nInscribe in blue on silk, place beneath both feet to sever the root of suffering from contention and strife. Upon completion, bury beneath the gate to dissolve the form.\n\n**Jade Talisman of Radiant Escape for Dissolving Form, Concealing Transformation, and Transcending the Fire-Swallowing and Coal-Eating:**\nInscribe in yellow on silk, place beneath both feet to sever the root of all bodily sufferings. Upon completion, bury beneath the gate to dissolve the form.\n\nThe five talismans, inscribed as prescribed, are buried at the gates of the Five Paths of Suffering.\n\nHaving received the Great Dharma for dissolving form, severing corpses, and emitting radiant jade light, one passes through the midst of the Three Evils and Five Paths. Without a substitute to take one’s form, the Three Offices and Nine Bureaus will not permit passage through the Three Realms. Thus, one offers oneself as a substitute, enlightening the Three Offices of the Upper Heavens. Upon receiving the names bestowed by the Five Emperors, the body escapes the gates of the Three Evils and the midst of the Five Sufferings. The Earthly Offices no longer restrain it, and form and soul ascend as immortals.\n\nThe one who substitutes for another’s form may later be appointed to the position of Chief Scribe of the Three Offices. Following the regulations, after 240 years of meritorious service, they too may attain the rank of Perfected. The substitute must not be a vulgar or unworthy person; suitability alone suffices. They should possess delicate bones, a fair countenance, a gentle and humble disposition—only then will both parties conform to the Dharma and achieve immortality.\n\n**Jade Talisman of the Water-Mother Stone Mirror and Essence of Jade:**\nInscribe in yellow on a round blue-green silk, place within water. The recipient of the Dharma washes and bathes in the Jade Pool, causing the body to emit light and receive the Perfected both internally and externally. By regularly inscribing and washing with it, the spirit becomes luminously penetrating, and after nine years, one naturally attains immortality.\n\nHere ends the *Upper Clarity’s Register of the Primal Beginning and Jade Instructions of the Great Perfected*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清元始谱录太真玉诀 经名：上清元始谱录太真玉诀。 撰人不详，约出於东晋南朝。 言落三尸解五苦之法。 一卷。 底本出处：《正统道藏》正一部。 上清元始谱录太真玉诀 一名解形遁变流景玉光 三恶门 第一门名色欲门，一名上尸道一名天徒界。 第二门名爱欲门，一名中尸道一名人徒界。 第三门名食欲门，一名下尸道一名地徒界。 此三恶之门，一名三尸之道，一名三徒之界，常居人身中，塞人三关之口，断人三命之根，遏人学仙之路，抑人飞腾之魂。 为学之本，而不落尸於三道之上，去欲於三界之门，真何由降，道何由成？ 夫学上法，宜遣诸欲，灭落尸根，道自然降，仙自然成，克得飞腾，上升三清。 五道门 第一门名色累苦心门，一名太山地狱苦道。 第二门名爱累苦神门，一名风刀苦道。 第三门名贪累苦形门，一名担山负石苦道。 第四门名华竞苦精门，一名作江河苦道。 第五门名身累众苦门，一名吞火食炭镬汤苦道。 此五苦五道之门，常居於人身，系人命根，遏人招真之路，断人修仙之门。 为学之本，而不解形於五道之上，灭迹於五苦之下，众累不断，沉沦罪门，何由得脱，腾身遁变，流景玉光也？ 夫欲上学，当先断诸累，绝灭苦道，真自然降，神仙自成，克得变形，游宴诸天。 落上尸之道，当青书上元灭欲斩尸变景流光玉符，着头上。 当於色欲之门，北向衔刀，请一杯清水，面临水上，师於弟子后，叩齿九通，咒曰： 上尸青欲，自号彭琚，变化九种，鸟头蛇躯，混沌无心，或沉或浮，贪欲滋美，华色自居，走作人魂魄，潜司过咎，断人命根，炁散神游，放浪三宫，小虫无劬。 真人甲乙，佩箓带符，色欲已断，死路已除，元始有命，请斩尸头，三台监形，速出无留，灭根绝种，勿使遗余。 甲乙练真，三宫清虚，五帝临映，太一定书，北元沐浴，冠带行畴，飞度无界，流景玉舆，遁变上清，乘空遨游。 毕，取所衔刀，师以绕弟子头结九过，下所卷玉符，埋於色欲门下，以杯水灌上。 行此之道，上尸即灭，色欲自除，身过天徒之界，形魂无复苦恼之患。 太真上道，慎勿轻传。 以次进中门，而落中尸。 落中尸，当黄书中元灭欲斩尸变景流光玉符，着心前，於爱欲中门，向王捉刀向腹，请一杯清水着前，师於后，叩齿十二通，咒曰： 中尸彭质，号曰中黄，爱欲自居，依腹逃藏，沉浮变化，形无常方，执人魂魄，走作三宫，赤子驰竞，使人发狂，欲性丧神，罪由小虫。 真人甲乙，上帝已征，身佩玉符，丹文金章，列名元图，三欲已亡，元始符命，斩灭尸形，断根绝种，勿得飞扬。 甲乙受练，五符休粮，真仙安镇，藏内生光，五帝监映，太一列行，中元沐浴，冠带衣裳，解形遁变，流景玉光，飞升上清，食息太空，长保自然，天地无穷。 毕，以次进下门而落下尸。 落下尸，当白书下元灭欲斩尸变景流光玉符，着两脚上於下爱欲门，向南横刀於两足上，一杯清水着足下，师於后，叩齿三通，而咒曰： 下尸彭矫，贪欲自荣，白色混沌，体无常形，依人两足，讯动人情，言白得失，走作魂灵，三宫扰乱，赤子不宁，贪欲小虫，贾备幽冥。 真人甲乙，三练已清，欲门断塞，不受邪精，元始急令，三台临庭，速出无隐，及汝弟兄，九种子孙，一时斩形，五帝度真，太一记名，下元沐浴，冠带羽青，玄度三界，上饮元精，解形遁变，流景上清，飞玄步虚，三景齐明。",
      "translated_text": "**The Supreme Clarity Register of the Primordial Beginning and the Jade Instructions of the Great Perfection**\n\n**Title:** *The Supreme Clarity Register of the Primordial Beginning and the Jade Instructions of the Great Perfection* (also known as *Dissolving the Form, Escaping Transformation, and Flowing Radiance of Jade Light*)\n\n**Author:** Unknown, approximately dated to the Eastern Jin or Southern Dynasties.\n**Content:** Discusses methods for shedding the Three Corpses and dissolving the Five Sufferings.\n**Volume:** One.\n**Source Text:** *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n---\n\n### **The Three Evil Gates**\n\n**First Gate:** The Gate of Sensual Desire, also called the Path of the Upper Corpse or the Realm of Heavenly Transgressors.\n**Second Gate:** The Gate of Attachment, also called the Path of the Middle Corpse or the Realm of Human Transgressors.\n**Third Gate:** The Gate of Gluttony, also called the Path of the Lower Corpse or the Realm of Earthly Transgressors.\n\nThese Three Evil Gates are also known as the Paths of the Three Corpses or the Realms of the Three Transgressors. They constantly dwell within the human body, blocking the mouths of the Three Passes, severing the roots of the Three Lives, obstructing the path of immortal study, and suppressing the soaring hun-souls of those who seek transcendence.\n\nThe foundation of learning lies in shedding the Corpses from the Three Paths and eliminating desires at the gates of the Three Realms. How else can the True One descend? How else can the Dao be accomplished?\n\nThose who study the supreme methods must dispel all desires, extinguish the roots of the Corpses, and the Dao will naturally descend; immortality will naturally be achieved. Only then can one soar and ascend to the Three Clarities.\n\n---\n\n### **The Five Suffering Gates**\n\n**First Gate:** The Gate of Sensual Bondage and Heart Suffering, also called the Path of Suffering in the Earth Prison of Mount Tai.\n**Second Gate:** The Gate of Attachment and Spirit Suffering, also called the Path of Suffering under Wind and Blade.\n**Third Gate:** The Gate of Greed and Bodily Suffering, also called the Path of Suffering under the Burden of Mountains and Stones.\n**Fourth Gate:** The Gate of Vanity and Essence Suffering, also called the Path of Suffering in Rivers and Seas.\n**Fifth Gate:** The Gate of Bodily Bondage and Multifold Suffering, also called the Path of Suffering in Boiling Cauldrons, Fire-Swallowing, and Coal-Eating.\n\nThese Five Gates of Suffering and Five Paths constantly reside within the human body, binding the roots of life, obstructing the path to summoning the True, and severing the gate of immortal cultivation.\n\nThe foundation of learning lies in dissolving the form from the Five Paths and eradicating traces beneath the Five Sufferings. If the myriad bonds are not severed, one will sink into the gates of sin—how then can liberation be attained? How can the body escape, transform, and radiate the flowing jade light?\n\nThose who seek the supreme study must first sever all bonds and extinguish the paths of suffering. The True One will naturally descend; divine immortality will naturally be achieved. Only then can one transform the form and wander through the heavens.\n\n---\n\n### **Shedding the Path of the Upper Corpse**\n\nTo shed the Path of the Upper Corpse, inscribe the *Upper Primordial Jade Talisman for Extinguishing Desire, Beheading the Corpse, Transforming Radiance, and Flowing Light* in green, and place it upon the head.\n\nAt the Gate of Sensual Desire, face north while holding a blade in the mouth. Prepare a cup of pure water and place it before the water’s surface. The master stands behind the disciple, strikes the teeth nine times, and recites the incantation:\n\n> *The Upper Corpse, Green Desire, styles itself Peng Ju,*\n> *Transforming into nine forms, with a bird’s head and serpent’s body,*\n> *Chaotic and heartless, now sinking, now floating,*\n> *Gluttonous for fine flavors, dwelling in gaudy beauty,*\n> *It roams as the human hun and po, secretly recording transgressions,*\n> *Severing life’s roots, scattering qi, and causing the spirit to wander,*\n> *Rampant through the Three Palaces, a tiny worm without toil.*\n>\n> *True Person Jia Yi, bearing the register and wearing the talisman,*\n> *Has severed sensual desire and removed the path of death.*\n> *By the command of the Primordial Beginning, I beseech the beheading of the Corpse’s head.*\n> *The Three Terraces oversee the form—depart swiftly, linger not!*\n> *Eradicate the root, exterminate the lineage, leave no remnant behind.*\n>\n> *Jia Yi refines the True, the Three Palaces purified and void,*\n> *The Five Emperors descend in radiance, the Great One inscribes the register.*\n> *Bathed in the Northern Primordial, crowned and girded, traversing the realms,*\n> *Ascending boundlessly, riding the jade chariot of flowing radiance,*\n> *Escaping and transforming in the Supreme Clarity, roaming the void.*\n\nUpon completion, the master takes the blade held in the disciple’s mouth and circles the disciple’s head nine times. The rolled jade talisman is then buried beneath the Gate of Sensual Desire, and the cup of water is poured over it.\n\nBy practicing this method, the Upper Corpse is extinguished, sensual desire is eradicated, and the body transcends the Realm of Heavenly Transgressors. The form and hun-soul are freed from the afflictions of suffering.\n\n**The Great Perfection’s supreme path must not be lightly transmitted.**\n\nProceed in order to the Middle Gate to shed the Middle Corpse.\n\n---\n\n### **Shedding the Middle Corpse**\n\nTo shed the Middle Corpse, inscribe the *Middle Primordial Jade Talisman for Extinguishing Desire, Beheading the Corpse, Transforming Radiance, and Flowing Light* in yellow, and place it before the heart.\n\nAt the Gate of Attachment, face the sovereign while holding the blade toward the abdomen. Place a cup of pure water before you. The master stands behind, strikes the teeth twelve times, and recites the incantation:\n\n> *The Middle Corpse, Peng Zhi, styles itself the Central Yellow,*\n> *Dwelling in attachment, hiding within the abdomen,*\n> *Sinking and floating, transforming without fixed form,*\n> *Seizing the human hun and po, roaming the Three Palaces,*\n> *The Red Child races wildly, driving one to madness,*\n> *Desire consumes the spirit—guilt lies with the tiny worm.*\n>\n> *True Person Jia Yi, summoned by the Celestial Emperor,*\n> *Bears the jade talisman, the cinnabar script and golden seal,*\n> *Inscribed in the Primordial Register. The Three Desires are extinguished.*\n> *By the command of the Primordial Beginning, the Corpse’s form is beheaded and eradicated,*\n> *Its root severed, its lineage exterminated—let it not take flight!*\n>\n> *Jia Yi undergoes refinement, the Five Talismans sustain without grain,*\n> *True immortals settle in peace, light born within the hidden.*\n> *The Five Emperors oversee, the Great One arrays the ranks,*\n> *Bathed in the Middle Primordial, crowned and robed,*\n> *Dissolving the form, escaping transformation, flowing jade radiance,*\n> *Ascending to the Supreme Clarity, breathing in the Great Void,*\n> *Eternally preserving the natural, boundless as heaven and earth.*\n\nProceed in order to the Lower Gate to shed the Lower Corpse.\n\n---\n\n### **Shedding the Lower Corpse**\n\nTo shed the Lower Corpse, inscribe the *Lower Primordial Jade Talisman for Extinguishing Desire, Beheading the Corpse, Transforming Radiance, and Flowing Light* in white, and place it upon both feet.\n\nAt the Gate of Lower Desire, face south and lay the blade horizontally upon the feet. Place a cup of pure water beneath the feet. The master stands behind, strikes the teeth three times, and recites the incantation:\n\n> *The Lower Corpse, Peng Jiao, glories in gluttony,*\n> *White and chaotic, its body without fixed form,*\n> *Dwelling in the human feet, stirring emotions,*\n> *Whispering gains and losses, roaming as the hun and ling,*\n> *Disturbing the Three Palaces, the Red Child restless,*\n> *A tiny worm of desire, trading in the dark netherworld.*\n>\n> *True Person Jia Yi, the Three Refinements now purified,*\n> *The Gate of Desire sealed, no longer receiving demonic essence.*\n> *By the urgent command of the Primordial Beginning, the Three Terraces descend to the court—*\n> *Depart swiftly, hide not, nor your brethren,*\n> *Nor your ninefold descendants! All forms beheaded at once.*\n> *The Five Emperors deliver the True, the Great One records the name,*\n> *Bathed in the Lower Primordial, crowned and feather-robed in azure,*\n> *Transcending the Three Realms, drinking primordial essence,*\n> *Dissolving the form, escaping transformation, ascending to the Supreme Clarity,*\n> *Treading the void in dark steps, the Three Radiances shining as one.*\n\n**The Great Perfection’s supreme path must not be lightly transmitted.**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1340,
      "start_sentence": 0,
      "end_sentence": 40,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.751001834869385,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清元始谱箓太真玉诀.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "毕，三界既度，便度五苦之道。 解形遁变飞度五道之法，当作新衣一通，巾履并新，於第一色累苦心门上，黑书解形遁变灭度地狱流景玉符，置两足下，北向平立，师叩齿五通，咒曰： 解形遁变，落尸五难，三欲已清，神津内灌，脱故练新，体香气兰，玉符灭迹，地无拘挛，身度天界，超凌云端，魔王保真，炁合自然，七祖同升，飞步天门，五帝监映，万神咸闻。 毕，脱巾解结，埋符於两足下，脱履而去。 次进爱欲苦神门。 於爱欲苦神门上，白书解形遁变灭度风刀流景玉符，置两足下，西向平立，师叩齿七通，咒曰： 云行飞步，遁变玉光，解形脱迹，散发遨翔，人界无拘，乘虚空行，天魔已保，五道开通，越度风刀，形升上宫。 毕，埋符两足之下，以次进贪欲苦形门。 （已下原阙文） 出九天门谒刺法 用银木，长一尺二寸，广二寸四分，读刺毕，埋所属门下。 郁单无量天玉郎门下，某帝先生王甲再拜谒。 禅善无量寿天玉郎门下，某帝先生王甲再拜谒。 梵监天玉郎门下，某帝先生王甲再拜谒。 兜术天玉郎门下，某帝先生王甲再拜谒。 不骄乐天玉郎门下，某帝先生王甲再拜谒。 化应声天玉郎门下，某帝先生王甲再拜谒。 梵宝天玉郎门下，某帝先生王甲再拜谒。 波梨答和天玉郎门下，某帝先生王甲再拜谒。 梵摩迦夷天玉郎门下，某帝先生王甲再拜谒。 右九刺，以次安之。 第一清微皇曾天帝位，元阳之炁。 第二禹余泰明玉完天帝位，上阳之炁。 第三太赤清明何童天帝位，太阳之炁。 第四无量玄胎平育天帝位，清阳之炁。 第五无量寿元明文举天帝位，通阳之炁。 第六梵监上明七曜天帝位，通阳之炁。 第七兜术虚无越衡天帝位，建阳之炁。 第八不骄乐太极蒙翳天帝位，极阳之炁。 右八天东方元阳之榜，以次左行，榜下安一灯火，合八灯。 第一化应声赤明和阳天帝位，阳始之炁。 第二梵宝玄明恭华天帝位，阳晖之炁。 第三魔迦夷耀明宗飘天帝位，阳洞之炁。 第四答和竺落皇笳天帝位，阳明之炁。 第五褥明虚明堂曜天帝位，阳演之炁。 第六摩褥和观明端静天帝位，阳明之炁。 第七忆罗玄明恭庆天帝位，阳浩之炁。 第八那首太焕极瑶天帝位，阳极之炁。 右八天南方阳始之榜，次左行，榜下安一灯火，合八灯。 第一波梨荼首元载孔升天帝位，少阴之炁。 第二首来太安皇崖天帝位，太阴之炁。 第三首稽那显定极风天帝位，浩阴之炁。 第四阿那波罗迦始皇孝芒天帝位，洞阴之炁。 第五波罗离和太黄翁重天帝位，玄阴之炁。 第六梵明无思江由天帝位，玄阴之炁。 第七奈泞元上揲阮乐天帝位，旻阴之炁。 第八阿梨和元极昙誓天帝位，极阴之炁。 右八天西方少阴之膀，以次左行，膀下安一灯火，合八灯。 第一阿奈皓庭霄度天帝位，阴生之炁。 第二扇明民渊通元洞天帝位，化阴之炁。 第三梨那太文翰宠天帝位，阴明之炁。 第四明梵耐太素禁上天帝位，洞阴之炁。 第五阿尼姤太虚常融天帝位，阴灵之炁。 第六项达泰释腾胜天帝位，阴灵之炁。 第七大梵项带大昏龙变天帝位，阴浩之炁。 第八禅蝉自然太极贾奕天帝位，阴极之炁。 右八天北方阴生之榜，以次左行，榜下安一灯火，合八灯。 四方三十二天榜，榜下一灯火，以照三十二天。",
      "translated_text": "Once the Three Realms are transcended, one then traverses the path of the Five Sufferings. The method for *dissolving form and escaping transformation* to ascend beyond the Five Paths requires the preparation of a new set of robes, headscarf, and shoes. Upon the first gate of the *Gate of Accumulated Suffering of the Heart*, inscribe in black the *Jade Talisman for Dissolving Form, Escaping Transformation, Extinguishing Hell, and Flowing Radiance*. Place it beneath the feet, stand facing north, and the master strikes the teeth five times, reciting the incantation:\n\n*\"Dissolve form, escape transformation,*\n*Cast off the corpse’s five tribulations.*\n*The Three Desires now purified,*\n*Divine nectar inwardly irrigates.*\n*Shed the old, refine the new,*\n*Body fragrant as orchid and sweet herb.*\n*The jade talisman erases traces,*\n*No earthly bonds constrain.*\n*Ascend through heaven’s realms,*\n*Surpassing the clouds’ edge.*\n*The Demon Kings guard the True,*\n*Qi merges with the natural.*\n*Seven ancestors ascend together,*\n*Treading the steps of heaven’s gate.*\n*The Five Emperors oversee,*\n*All spirits hear and witness.\"*\n\nUpon completion, remove the headscarf and untie the knots, bury the talisman beneath the feet, and discard the shoes. Proceed next to the *Gate of the Spirit of Love and Desire’s Suffering*.\n\nUpon the *Gate of the Spirit of Love and Desire’s Suffering*, inscribe in white the *Jade Talisman for Dissolving Form, Escaping Transformation, Extinguishing the Wind-Blade, and Flowing Radiance*. Place it beneath the feet, stand facing west, and the master strikes the teeth seven times, reciting the incantation:\n\n*\"Clouds drift, steps take flight,*\n*Escaping transformation in jade light.*\n*Dissolve form, erase traces,*\n*Loose hair soars free.*\n*No bonds in the human realm,*\n*Riding the void’s expanse.*\n*The Heavenly Demons now guard,*\n*The Five Paths open wide.*\n*Cross beyond wind-blades,*\n*Form ascends to the Upper Palace.\"*\n\nUpon completion, bury the talisman beneath the feet and proceed in order to the *Gate of the Suffering Form of Greed and Desire*.\n\n*(The following text is missing in the original.)*\n\n**Method for Presenting Memorials at the Gates of the Nine Heavens:**\nUse silver wood, one foot and two inches in length, two inches and four fen in width. After reading the memorial, bury it beneath the respective gate.\n\nAt the gate of the *Jade Lord of the Immeasurable Heaven of Utmost Joy*, *So-and-so, Emperor-Master Wang Jia*, bows twice in audience.\nAt the gate of the *Jade Lord of the Immeasurable Longevity Heaven of Meditative Goodness*, *So-and-so, Emperor-Master Wang Jia*, bows twice in audience.\nAt the gate of the *Jade Lord of the Brahmā-Monitor Heaven*, *So-and-so, Emperor-Master Wang Jia*, bows twice in audience.\nAt the gate of the *Jade Lord of the Tuṣita Heaven*, *So-and-so, Emperor-Master Wang Jia*, bows twice in audience.\nAt the gate of the *Jade Lord of the Heaven of No Joy in Pride*, *So-and-so, Emperor-Master Wang Jia*, bows twice in audience.\nAt the gate of the *Jade Lord of the Heaven of Responsive Transformation*, *So-and-so, Emperor-Master Wang Jia*, bows twice in audience.\nAt the gate of the *Jade Lord of the Brahmā-Treasure Heaven*, *So-and-so, Emperor-Master Wang Jia*, bows twice in audience.\nAt the gate of the *Jade Lord of the Parīttābha Heaven*, *So-and-so, Emperor-Master Wang Jia*, bows twice in audience.\nAt the gate of the *Jade Lord of the Brahmā-Kāyika Heaven*, *So-and-so, Emperor-Master Wang Jia*, bows twice in audience.\n\nPlace the nine memorials in order.\n\n**First:** The *Imperial Throne of the Pristine and Subtle August Celestial Heaven of the Primordial Yang Qi*.\n**Second:** The *Imperial Throne of the Yu-Yu Supreme Brightness Jade Perfection Heaven of the Upper Yang Qi*.\n**Third:** The *Imperial Throne of the Great Crimson Clarity and Brightness Haotong Heaven of the Great Yang Qi*.\n**Fourth:** The *Imperial Throne of the Immeasurable Mysterious Womb Nurturing Heaven of the Pure Yang Qi*.\n**Fifth:** The *Imperial Throne of the Immeasurable Longevity Primordial Brightness Literary Elevation Heaven of the Penetrating Yang Qi*.\n**Sixth:** The *Imperial Throne of the Brahmā-Monitor Upper Brightness Seven Luminaries Heaven of the Penetrating Yang Qi*.\n**Seventh:** The *Imperial Throne of the Tuṣita Void-Transcending Balance Heaven of the Establishing Yang Qi*.\n**Eighth:** The *Imperial Throne of the Heaven of No Joy in Pride, Supreme Ultimate Veiled Brilliance of the Utmost Yang Qi*.\n\nThe eight heavens of the *Eastern Primordial Yang Qi* tablet proceed leftward in order. Place one lamp beneath each tablet, totaling eight lamps.\n\n**First:** The *Imperial Throne of the Heaven of Responsive Transformation, Crimson Clarity and Harmonious Yang of the Yang’s Beginning Qi*.\n**Second:** The *Imperial Throne of the Brahmā-Treasure Mysterious Clarity Reverent Splendor Heaven of the Yang’s Radiance Qi*.\n**Third:** The *Imperial Throne of the Māra-Kāyika Heaven of Illuminating Brilliance and Ancestral Drifting of the Yang’s Cavern Qi*.\n**Fourth:** The *Imperial Throne of the Parīttābha Heaven of the Bamboo Grove’s August Drum of the Yang’s Clarity Qi*.\n**Fifth:** The *Imperial Throne of the Heaven of Soft Clarity, Void Brightness, and Hall’s Brilliance of the Yang’s Expansion Qi*.\n**Sixth:** The *Imperial Throne of the Heaven of Māra-Soft Harmony, Observing Clarity, and Upright Stillness of the Yang’s Clarity Qi*.\n**Seventh:** The *Imperial Throne of the Heaven of Remembering-La, Mysterious Clarity, and Reverent Celebration of the Yang’s Vast Qi*.\n**Eighth:** The *Imperial Throne of the Heaven of Naśī, Supreme Flaming Brilliance, and Ultimate Jade of the Yang’s Utmost Qi*.\n\nThe eight heavens of the *Southern Yang’s Beginning Qi* tablet proceed leftward in order. Place one lamp beneath each tablet, totaling eight lamps.\n\n**First:** The *Imperial Throne of the Heaven of Pāri, Primordial Bearing, and Empty Ascent of the Lesser Yin Qi*.\n**Second:** The *Imperial Throne of the Heaven of Naśī, Supreme Peace, and August Cliff of the Great Yin Qi*.\n**Third:** The *Imperial Throne of the Heaven of Naśī-Ji, Manifest Stability, and Ultimate Wind of the Vast Yin Qi*.\n**Fourth:** The *Imperial Throne of the Heaven of Anavatapta, Primordial Filial Piety, and August Mang of the Cavern Yin Qi*.\n**Fifth:** The *Imperial Throne of the Heaven of Pāramitā, Great Yellow Elder, and Heavy Heaven of the Mysterious Yin Qi*.\n**Sixth:** The *Imperial Throne of the Heaven of Brahmā-Clarity, No-Thought, and River’s Origin of the Mysterious Yin Qi*.\n**Seventh:** The *Imperial Throne of the Heaven of Nai-Ning, Primordial Upper Deliberation, and Joyous Obscurity of the August Yin Qi*.\n**Eighth:** The *Imperial Throne of the Heaven of Ālaya, Primordial Ultimate, and Cloud-Vow of the Utmost Yin Qi*.\n\nThe eight heavens of the *Western Lesser Yin Qi* tablet proceed leftward in order. Place one lamp beneath each tablet, totaling eight lamps.\n\n**First:** The *Imperial Throne of the Heaven of Anai, Luminous Court, and Rosy Transcendence of the Yin’s Birth Qi*.\n**Second:** The *Imperial Throne of the Heaven of Fan-Ming, People’s Abyss, and Penetrating Primordial Cavern of the Transformative Yin Qi*.\n**Third:** The *Imperial Throne of the Heaven of Li-Na, Supreme Literary Splendor, and Grace of the Yin’s Clarity Qi*.\n**Fourth:** The *Imperial Throne of the Heaven of Bright Brahmā, Supreme Simplicity, and Forbidden Upper Realm of the Cavern Yin Qi*.\n**Fifth:** The *Imperial Throne of the Heaven of Ani-Gou, Great Void, and Constant Fusion of the Yin’s Spirit Qi*.\n**Sixth:** The *Imperial Throne of the Heaven of Xiang-Da, Supreme Release, and Ascendant Victory of the Yin’s Spirit Qi*.\n**Seventh:** The *Imperial Throne of the Heaven of Great Brahmā, Supreme Obscurity, and Dragon Transformation of the Yin’s Vast Qi*.\n**Eighth:** The *Imperial Throne of the Heaven of Meditative Cicada, Natural Supreme Ultimate, and Splendid Obscurity of the Yin’s Utmost Qi*.\n\nThe eight heavens of the *Northern Yin’s Birth Qi* tablet proceed leftward in order. Place one lamp beneath each tablet, totaling eight lamps. The thirty-two heavenly tablets of the four directions, each with one lamp beneath, illuminate the thirty-two heavens.",
      "overlap_context": " *Nor your ninefold descendants! All forms beheaded at once.*\n> *The Five Emperors deliver the True, the Great One records the name,*\n> *Bathed in the Lower Primordial, crowned and feather-robed in azure,*\n> *Transcending the Three Realms, drinking primordial essence,*\n> *Dissolving the form, escaping transformation, ascending to the Supreme Clarity,*\n> *Treading the void in dark steps, the Three Radiances shining as one.*\n\n**The Great Perfection’s supreme path must not be lightly transmitted.**",
      "start_char": 1340,
      "end_char": 2705,
      "start_sentence": 41,
      "end_sentence": 98,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.22849130630493,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清元始谱箓太真玉诀.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "受事毕，便从东面起一榜，便再拜，称名王甲，今以生口代形易名，过度三恶五道之门，不胜形魂，受天恩毕，以次南三十二榜，而受之。 落上尸之道，青书白素，着头上，上元灭欲斩尸变景流光玉符： 落中尸道，黄书白素，着心前，中元灭欲斩尸变景流光玉符： 落下尸道，白书白素，着两足上下元灭欲斩尸变景流光玉符： 右三符，书安如法。 毕，埋着三恶之门，水灌上而去。 解形遁变灭度地狱流景玉符，黑书白素，置两足下，以断色累苦心根。 毕，埋门下以解形。 解形遁变灭度风刀流景玉符，白书素上，置两足下，以断爱欲苦神根。 毕，埋门下以解形。 解形遁变灭度摙石流景玉符，赤书白素，置两足下，以断贪欲苦形根。 毕，埋门下以解形。 解形遁变灭度作江河流景玉符，青书素上，置两足下，以断诤竞苦精根。 毕，埋门下以解形。 解形遁变灭度吞火食炭流景玉符，黄书素上，置两足下，以断身累众苦根。 毕，埋门下以解形。 右五符，书如法，毕，埋五苦道之门。 受大法解形落尸流景玉光，过度三恶五道之中，无人代形，则三官九府皆不听人度三界，故以人自代，开明上天三官讫，受五帝领名，身即得离三恶之门，五苦之中，地司不拘，形魂升仙。 代形之人，后亦得补三官都书史主者之任，依格二百四十年一转有功，亦得上真之任。 所以代形，不得辄以凡丑恶之人，贵以应用而已，皆须细骨美色，柔和小心之人，则彼此合法，克得成仙。 右石镜水母玉精符，黄书员青缯之上，置於水中。 受法者以水自洗濯，沐浴玉池，身体生光，内外受真。 常能书以浣洗，则神明洞达，九年自仙也。 上清元始谱录太真玉诀竟",
      "translated_text": "Upon completion of the rites, begin from the eastern tablet, bow twice, and declare: \"I, so-and-so, of the rank Wang Jia, now offer a living substitute to transform my form and alter my name, passing through the gates of the Three Evils and Five Paths. Unable to endure the suffering of form and soul, I have received the celestial grace in full.\" Proceed thus through the thirty-two southern tablets to complete the reception.\n\n**To sever the path of the Upper Corpse:**\nInscribe in blue on white silk, place upon the head.\n*Upper Prime’s Desire-Erasing, Corpse-Severing, Radiant-Light Jade Talisman of Transformative Splendor.*\n\n**To sever the path of the Middle Corpse:**\nInscribe in yellow on white silk, place before the heart.\n*Middle Prime’s Desire-Erasing, Corpse-Severing, Radiant-Light Jade Talisman of Transformative Splendor.*\n\n**To sever the path of the Lower Corpse:**\nInscribe in white on white silk, place upon both feet.\n*Lower Prime’s Desire-Erasing, Corpse-Severing, Radiant-Light Jade Talisman of Transformative Splendor.*\n\nThe three talismans, once inscribed and positioned as prescribed, are buried at the gates of the Three Evils. Water is poured over the site before departing.\n\n**Jade Talisman of Radiant Escape for Dissolving Form, Concealing Transformation, and Transcending Hell:**\nInscribe in black on white silk, place beneath both feet to sever the root of suffering from sensory entanglements. Upon completion, bury beneath the gate to dissolve the form.\n\n**Jade Talisman of Radiant Escape for Dissolving Form, Concealing Transformation, and Transcending the Wind-Blade:**\nInscribe in white on silk, place beneath both feet to sever the root of suffering from craving and desire. Upon completion, bury beneath the gate to dissolve the form.\n\n**Jade Talisman of Radiant Escape for Dissolving Form, Concealing Transformation, and Transcending the Crushing Stones:**\nInscribe in red on white silk, place beneath both feet to sever the root of suffering from greed and desire. Upon completion, bury beneath the gate to dissolve the form.\n\n**Jade Talisman of Radiant Escape for Dissolving Form, Concealing Transformation, and Transcending the Rivers and Seas:**\nInscribe in blue on silk, place beneath both feet to sever the root of suffering from contention and strife. Upon completion, bury beneath the gate to dissolve the form.\n\n**Jade Talisman of Radiant Escape for Dissolving Form, Concealing Transformation, and Transcending the Fire-Swallowing and Coal-Eating:**\nInscribe in yellow on silk, place beneath both feet to sever the root of all bodily sufferings. Upon completion, bury beneath the gate to dissolve the form.\n\nThe five talismans, inscribed as prescribed, are buried at the gates of the Five Paths of Suffering.\n\nHaving received the Great Dharma for dissolving form, severing corpses, and emitting radiant jade light, one passes through the midst of the Three Evils and Five Paths. Without a substitute to take one’s form, the Three Offices and Nine Bureaus will not permit passage through the Three Realms. Thus, one offers oneself as a substitute, enlightening the Three Offices of the Upper Heavens. Upon receiving the names bestowed by the Five Emperors, the body escapes the gates of the Three Evils and the midst of the Five Sufferings. The Earthly Offices no longer restrain it, and form and soul ascend as immortals.\n\nThe one who substitutes for another’s form may later be appointed to the position of Chief Scribe of the Three Offices. Following the regulations, after 240 years of meritorious service, they too may attain the rank of Perfected. The substitute must not be a vulgar or unworthy person; suitability alone suffices. They should possess delicate bones, a fair countenance, a gentle and humble disposition—only then will both parties conform to the Dharma and achieve immortality.\n\n**Jade Talisman of the Water-Mother Stone Mirror and Essence of Jade:**\nInscribe in yellow on a round blue-green silk, place within water. The recipient of the Dharma washes and bathes in the Jade Pool, causing the body to emit light and receive the Perfected both internally and externally. By regularly inscribing and washing with it, the spirit becomes luminously penetrating, and after nine years, one naturally attains immortality.\n\nHere ends the *Upper Clarity’s Register of the Primal Beginning and Jade Instructions of the Great Perfected*.",
      "overlap_context": "he Heaven of Great Brahmā, Supreme Obscurity, and Dragon Transformation of the Yin’s Vast Qi*.\n**Eighth:** The *Imperial Throne of the Heaven of Meditative Cicada, Natural Supreme Ultimate, and Splendid Obscurity of the Yin’s Utmost Qi*.\n\nThe eight heavens of the *Northern Yin’s Birth Qi* tablet proceed leftward in order. Place one lamp beneath each tablet, totaling eight lamps. The thirty-two heavenly tablets of the four directions, each with one lamp beneath, illuminate the thirty-two heavens.",
      "start_char": 2705,
      "end_char": 3376,
      "start_sentence": 99,
      "end_sentence": 122,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.86381459236145,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清元始谱箓太真玉诀.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}