{
  "source_id": "上清回神飞霄登空招五星上法经",
  "source_file": "chunked_daozang\\上清回神飞霄登空招五星上法经.json",
  "total_chunks": 3,
  "total_original_chars": 3069,
  "total_translated_chars": 18525,
  "total_translation_time": 98.45328450202942,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\上清回神飞霄登空招五星上法经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Clarity Scripture of Reverting the Spirit, Soaring through the Empyrean, Ascending the Void, and Summoning the Five Stars: The Upper Method**\n\n**Scripture Title:** *The Supreme Clarity Scripture of Reverting the Spirit, Soaring through the Empyrean, Ascending the Void, and Summoning the Five Stars: The Upper Method*\n**Author:** Unknown, approximately dated to the Northern and Southern Dynasties.\n**Compilation:** A single fascicle combining *The Method of Reverting the Spirit, Soaring through the Empyrean, Ascending the Void, and Summoning the Five Stars* and *The Upper Method of Pacifying the Spirit, Nurturing Life, and Internal Contemplation for Ascending as an Immortal*.\n**Source Text:** *Daoist Canon of the Orthodox Tradition*, Section Zhengyi, Subsection Zheng.\n\n---\n\n### **The Method of Reverting the Spirit, Soaring through the Empyrean, Ascending the Void, and Summoning the Five Stars**\n\nThe Dao of reverting the spirit, feeding upon the celestial essence, and summoning the Five Stars to ascend the void pierces the Seven Mysteries above and dissolves the myriad forms below. It unifies the ten thousand transformations, establishes the ascent to the Mysterious Framework, bathes in orchid fragrance, enters the chamber in purity, and cultivates its methods. The Five Viscera radiate clarity, the Seven Orifices shine resplendently, the spirit guards the Crimson Palace, and the form ascends the Five Mornings. This is the most wondrous method—it is not transmitted to the untrue.\n\nThose who know the Dao find it easy; those who cultivate the method find it difficult. For this arduous path, how could it not be guarded in secrecy?\n\nOn the days of *jiazi*, *jiawu*, *yiyou*, *yimao*, *jichou*, *jiwei*, *wuchen*, and *wuxu*, bathe in purity, fast, and enter the chamber. Sit or recline as you wish, close your eyes, and clasp your hands over your heart. Visualize the Azure Emperor of the East, whose taboo name is *Tongming* and style *Gaiqing*. He wears a cyan turban, cyan robes, a cyan crown, and cyan shoes, and bears the insignia of *Tongguang Yangxia*. Enter my body.\n\nNext, visualize the Four Perfected of the Liver, named *Qingming Jun* and styled *Minglun Tongzi*, who eternally guard my liver, protect the gate of my stomach duct, and beneath the adipose membrane, block the dead qi. They bestow upon me the Azure Essence, the Lunar Water, and the Jade Mushroom. Then, visualize the luminous essence of Jupiter, drawing it into the mouth and swallowing it ninety times, allowing the qi to fill the Liver Palace. After nine years of practice, nine Azure Waist Jade Maidens of the East will attend at your side.\n\nNext, visualize the Vermilion Emperor of the South, whose taboo name is *Taiyang* and style *Huanlin*. He wears a crimson turban, crimson robes, a crimson crown, and crimson shoes, and bears the insignia of *Silang Zhubi*. Enter my body.\n\nNext, visualize the Primordial Cinnabar Sovereign of the Crimson Palace, named *Shenyun Zhu* and styled *Zinan Dan*, also called *Shengshang Bo* and *Shiyun Ju*, who eternally guards my Crimson Palace, protects the gate of my cervical vertebrae, and severs the path of dead qi. He bestows upon me the Cinnabar Essence, the Vermilion Water, and the Jade Mushroom. Then, visualize the luminous essence of Mars, drawing it into the mouth and swallowing it eighty times, allowing the vermilion qi to suffuse the Crimson Palace. After nine years of practice, eight Vermilion Jade Maidens of the South will serve at your side.\n\nNext, visualize the White Emperor of the West, whose taboo name is *Tongyin* and style *Yuanqi*. He wears a white turban, plain robes, a white crown, and white shoes, and bears the insignia of *Haoling Fuxi*. Enter my body.\n\nNext, visualize the Six Perfected of the Lungs, named *Shangsu Jun* and styled *Liangnanzhong Tong*, who eternally guard my lungs, protect the Twelve Passes, and sever the path of dead qi. They bestow upon me the Plain Mushroom, the Lunar Water, and the Jade Essence Elixir. Then, visualize the luminous essence of Venus, drawing it into the mouth and swallowing it sixty times, allowing the stellar qi to fill the lungs. After nine years of practice, six Supreme Plain Jade Maidens will attend at your side.\n\nNext, visualize the Black Emperor of the North, whose taboo name is *Tongshen* and style *Zigui*. He wears a dark turban, black robes, a dark crown, and dark shoes, and bears the insignia of *Yuzhen Xiaofeng*. Enter my body.\n\nNext, visualize the Seven Perfected Sovereigns of the Kidneys, named *Xuanyang Jun* and styled *Mingguang Xiansheng*, who eternally guard my two kidneys, protect the Earth Gate of my spine, and block the path of dead qi. They bestow upon me the Mysterious Yin Elixir and the Nine Liquids of the Jade Mushroom. Then, visualize the luminous essence of Mercury, drawing it into the mouth and swallowing it fifty times, allowing the stellar qi to fill the two kidneys. After nine years of practice, five Supreme Mysterious Jade Maidens will attend at your side.\n\nNext, visualize the Yellow Emperor of the Center, whose taboo name is *Wanfu* and style *Taicang*. He wears a yellow turban, yellow robes, a yellow crown, and yellow shoes, and bears the insignia of *Zhongyuan Bawei Yumen*. Enter my body.\n\nNext, visualize the Five Perfected Sovereigns of the Spleen, named *Yangguang Jun* and styled *Taichang Zi*, who eternally guard my spleen, protect the gate of my root extremity, and sever the path of dead qi. They bestow upon me the Yellow Water, the Lunar Radiance, and the Jade Embryo Elixir. Then, visualize the luminous essence of Saturn, drawing it into the mouth and swallowing it twelve times, allowing the qi to fill the spleen. After nine years of practice, twelve Yellow Plain Jade Maidens will attend at your side.\n\nNext, visualize the Supreme Mysterious Primordial Father, whose taboo name is *Gaotongsheng* and style *Zuohuiming*, and the Lower Mysterious Primordial Mother, named *Shuhuowang* and styled *Youhuiguang*. These two spirits guard the root of my original destiny, block the source of dead qi, and bestow upon me the Yang Mushroom and Yin Essence to nourish my body.\n\nVisualize the radiance of the Two Luminaries (Sun and Moon), illuminating my form. Draw their light into the mouth and swallow it thirty-six times, allowing the luminous qi to fill the Cinnabar Field below the navel. After nine years of practice, your face will assume a golden countenance, your eyes will emit flowing light, and you will command the Six Jia and summon the Six Ding, fulfilling every desire.\n\nWhen the Perfected One has completed the visualization of the Five Emperors and the Two Luminaries, recite the incantation:\n\n> *\"The Five Stars entwine and weave, their light flowing within to illuminate.\n> The Two Luminaries soar with rosy clouds, irrigating the Five Essences.\n> The Perfected Spirits guard and store, eternally preserving the Yellow Tranquility.\n> The Great Unity’s grand design transforms the embryo and reverts to infancy.\n> Liver and lungs blossom in splendor, heart and kidneys brim with radiance.\n> The spleen guards the Central Mystery, the Five Mushrooms receive life.\n> The precious light of the Sun and Moon merges with the Emperor.\n> Soaring through the void, ascending to the Jade Clarity.\"*\n\nThe practice of reverting the spirit, feeding upon the celestial essence, and summoning the Five Stars to ascend the void concludes here. After nine years of unwavering cultivation and visualization, the true numina will inwardly radiate. The Three Origins will attend the chamber, severing the dead qi in the Nine Chambers and delivering the Register of Life to the Southern Palace. Receiving the mysterious infusion of the Five Spirits and swallowing the Two Luminaries, one attains eternal existence. The Five Viscera blossom in splendor and never decay; the hun and po are preserved and guarded, prolonging the years.\n\n**The Supreme Method of Stabilizing the Spirit, Nurturing Life, and Inwardly Visualizing the Flight to Immortality**\n\nThe Perfected Lord of the Grand Tenuity Heaven stabilizes the spirit through inward visualization, dissolving the fetal bonds, dispersing knots, securing the *hun*, and congealing the *po*—the Dao of blending and transforming the Mysterious True. Opening the Six Bowels, the Five Offices receive numina. Swallowing *qi* and contemplating the True, fragrant mushrooms spontaneously grow. The stomach’s tubes and networks solidify; the spirit clarifies, the body purifies. The Jade Chariot arrives at once, and one ascends the dawn in broad daylight.\n\nOne must always fast in purity, bathe, burn incense, and enter the chamber. Calm the heart, cast off burdens, and abandon dust—suddenly, all obstructions vanish. Focus the mind without sleep, and then the true form may be seen, the wandering spirit may return.\n\nEach morning at dawn, face east and sit upright. Close the eyes and inwardly visualize the form and color, bright and clear. Call their true names to return and stabilize their original palaces, then knock the teeth thirty-six times.\n\nNext, visualize the spirit of the hair, named **Canghua**, styled **Taiyuan**, two *cun* and one *fen* in height;\nthe spirit of the brain, named **Jinggen**, styled **Niwan**, one *cun* and one *fen* in height;\nthe spirit of the eyes, named **Mingshang**, styled **Yingxuan**, three *cun* in height;\nthe spirit of the nose, named **Yulong**, styled **Lingjian**, two *cun* and five *fen* in height;\nthe spirit of the ears, named **Kongxian**, styled **Youtian**, three *cun* and one *fen* in height;\nthe spirit of the tongue, named **Tongming**, styled **Zhenglun**, seven *cun* in height;\nthe spirit of the teeth, named **Efeng**, styled **Luoqian**, one *cun* and five *fen* in height.\nThe seven spirits of the face all wear flying silk skirts, each in the form of an infant. Visualize them distinctly, arrayed across the face, each stabilizing its palace. When complete, knock the teeth twenty-four times, swallow *qi* twelve times, and recite the incantation:\n\n*\"The numinous source disperses *qi*,\nknits *qi* into spirit,\ndistinguishes front and back,\ngoverns the Muddy Pellet.\nAbove and below support one another,\nthe seven spirits array themselves.\nFlowing forms shift and change,\nnurturing the radiant origin.\nGuiding and drawing the Eight Numinous,\nthey surge upward through the Cavernous Gate,\nguarding the body and gathering the luminous,\nascending to the Emperor’s Dawn.\"*\n\nWhen finished, next visualize the spirit of the heart, named **Danyuan**, styled **Shouling**, nine *cun* in height;\nthe spirit of the lungs, named **Haohua**, styled **Xucheng**, eight *cun* in height;\nthe spirit of the liver, named **Longyan**, styled **Hecangming**, seven *cun* in height;\nthe spirit of the kidneys, named **Xuanming**, styled **Yuying**, three *cun* and six *fen* in height;\nthe spirit of the spleen, named **Changzai**, styled **Hunting**, seven *cun* and three *fen* in height;\nthe spirit of the gallbladder, named **Longyao**, styled **Weiming**, three *cun* and six *fen* in height.\nThe true spirits of the Six Bowels all wear cinnabar brocade flying skirts, dwelling within the Five Viscera and the palaces of the Six Bowels, their forms like infants, their colors like radiant youths. Visualize them distinctly, arraying their forms from dawn to dusk, contemplating without forgetfulness. Knock the teeth twenty-four times, swallow *qi* twelve times, and invoke:\n\n*\"The Five Viscera and Six Bowels,\ntrue spirits unite as one,\ngoverning the Crimson Palace together,\nabove and below following one another.\nThe Golden Chamber’s Red Child\ndwells opposite the Four Gates.\nThe Dark Chamber and Mysterious Portal,\nthe Spirit Hall’s pivotal mechanism—\nblending and transforming to generate spirit,\ntrue *qi* refined and subtle.\nPreserve and refine the Cinnabar Field,\nshining with the sun’s splendor,\nto join the Eight Luminous,\nunite form and ascend in flight.\"*\n\nWhen finished, next visualize the Three Perfected of Essence and Blood, named **Yuansheng Jun**, styled **Huangningzi**, eternally stabilizing the source beneath my two apertures;\nthe Two Perfected of Bones and Joints, named **Jianyu Jun**, styled **Ningyuzhu**, stabilizing my Granary Storehouse and the mouth of the Five Intestines;\nthe One Perfected within the heart, named **Tianjing Jinye Jun**, styled **Feisheng Shangying**, stabilizing the mouth of the Four Extremities in my chest;\nthe True Male of the Nine Origins, named **Jouzhi**, styled **Sanyang**, stabilizing the Gate of Hidden Dawn in my left ear;\nthe Imperial One’s *Hun*-Female, named **Shanggui**, styled **Dizi**, stabilizing the Gate of Hidden Dawn in my right ear;\nthe Left Primordial Perfected of Purple Simplicity, named **Yiyu Wuren**, styled **Anlai Shang**, stabilizing the region of my head and face;\nthe Central Primordial Perfected of Yellow Simplicity, named **Yuanhua Huangren**, styled **Taizhang Shang**, stabilizing the region of my chest and abdomen;\nthe Right Primordial Perfected of White Simplicity, named **Qiming Xiaoren**, styled **Jinmen Shang**, stabilizing the region of my lower barrier;\nthe Director of Destiny in the Sun, named **Jiesheng**, stabilizing my left hand;\nthe Peach Lord in the Moon, named **Fangying**, stabilizing my right hand;\nthe Primordial White *Qi* Lord of the Womb, named **Wuxuanzi**, styled **Yushangsheng**;\nthe Supreme One’s Essence and *Hun*, named **Xuanguizi**, styled **Shengchang**—these two spirits stabilize the knot above my Five Viscera, the root of the throat’s junction;\nthe Azure *Qi* Lord of the Junction, named **Anyanchang**, styled **Heheying**;\nthe Perfected *Hun* of the Primordial Lord, named **Baogutong**, styled **Mingfu**—these two spirits stabilize below my Five Viscera, above the Great Stomach;\nthe Black *Qi* Lord of the Nodes, named **Binlaisheng**, styled **Jingshangmen**;\nthe Imperial True Perfected *Hun*, named **Youtaisheng**, styled **Guanshangsheng**—these two spirits stabilize the mouth of my Nine Intestines, beneath the Hidden Source;\nthe Yellow *Qi* Lord of the Womb, named **Zumingche**, styled **Shenwuji**;\nthe Heavenly Emperor’s Essence and *Hun*, named **Liweizang**, styled **Fazhu**—these two spirits stabilize within my lower abdomen, the root of the two apertures;\nthe Red *Qi* Lord of the Blood, named **Hunlizi**, styled **Shubaojian**;\nthe Director of Destiny’s Essence and *Hun*, named **Faniuzi**, styled **Qingxuan**—these two spirits stabilize beneath the severed nodes of the hundred joints in my blood;\nthe Upper Primordial Father Lord, named **Gaotongsheng**, styled **Zuohuiming**;\nthe Lower Primordial Dark Mother, named **Shuhuowang**, styled **Youhuiguang**;\nthe Imperial Supreme One, named **Chongmingkong**, styled **Youliaowu**;\nthe Nine August Emperors, named **Mingzhen**, styled **Zhongdisheng**;\nthe Supreme Emperor’s Essence and *Hun*, named **Youyangtangyu**, styled **Baling**;\nthe Nine Barriers’ *Hun*, named **Lühuidao**, styled **Xueming**;\nthe Heavenly Register’s Imperial *Hun*, named **Zhaowua**, styled **Guangshen**—these seven spirits stabilize the root of my original destiny, sealing the gate of my death’s path.\n\nVisualize and invoke the host of Perfected from the head to the navel, none not radiant and clear. Then let the Golden Fluid flow in circuits, the Jade Splendor illuminate the *hun*, the numinous *qi* overflow the hidden intestines, and the Emperor’s *qi* fill the Nine Barriers. The Seven Ancestors are released from the Three Realms, receive rebirth in the Southern Palace, stabilize the life-spirit within the body, and spread true *qi* to secure the years.\n\nUpon completion, strike the teeth thirty-nine times and invoke:\n\nThe *qi* arises from nothingness, coalesces with the spirit;\nYang *qi* steadies without, Yin *qi* matures within.\nThe two images intertwine, fusing with the primordial numen.\nThe inner Perfected guard and protect, the nine apertures receive life.\nPreserve the *hun*, secure the *po*, the myriad spirits rest in peace.\nSafeguard my Three Barriers, let the flowering mushrooms fill and overflow.\nAscend with me together, jointly attain the Jade Clarity.\n\nUpon completion, swallow the *qi* thirty-nine times to stabilize the thirty-nine portals, allowing the *qi*-moisture to circulate and suffuse the entire body.\n\nShould one cast off burdens, untether from worldly dust,\ncalm the heart and pacify the intent,\nclearly perceive the empty chamber,\ngaze inward in contemplation,\nstabilize the spirit and secure the *hun*,\nseal the death-*qi* at the nine portals,\nand anchor the life-palace at the Upper Barrier—\nrevolving in cycles of visualization and invocation,\nas though speaking face-to-face—\nthen after three years, day and night,\nthe true spirit will manifest in form.\nRadiant splendor returns to the root,\nrotten teeth regrow,\nthe Five Viscera knit their networks,\nthe inner fills to abundance.\nOne may command the Six *Jia*, dispatch the Six *Ding*,\nsummon guests from the Nine Empyreans,\nand welcome the gods descending in the Three Primes’ chariot.\nThe spirit soars, the form ascends—\nby daylight, one mounts the dawn.\n\nThis is the divine treasure of the Supreme Perfected, named the \"Inner Character,\"\nwhich stabilizes within the human body,\ncirculates the *qi* of the Nine Heavens,\nand secures the mechanisms of the Six Palaces.\nThe myriad essences transform and arise—all through the spirit.\nWhen the spirit is anchored, life endures; when the spirit departs, life perishes.\nThrough diligent cultivation and accumulated resonance,\none may uplift the body’s form to ascend to the Dark Palace.\n\nThe Dao of seeking immortality—\nwithout knowing the inner names of form and spirit,\nwithout knowing how to seal the portals of death—\nhow can one hope for life?\n\nIn practicing this Dao,\none must not dwell in filth or impurity,\nnor consume the five pungents, wine, or meat—\nsuch things offend the true *qi*, and the spirit will depart.\n\nPeople know that rich delicacies please the palate,\nand ranks and emoluments glorify the body,\nyet they do not desire the sweetness of the palate’s food—\nthis is the axe that wounds life.\nExtravagant ranks and luxuries are the wellspring that drains the true.\nThus do the spirit-people cherish seclusion,\nneither lodging the body nor revealing their form in the mundane world.\n\nThose who cultivate life—ought they not be cautious?\n\n*The Scripture of the Supreme Clarity on Revolving the Spirit, Soaring to the Empyreans, and Summoning the Five Stars’ Upper Method* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "正一部 上清回神飞霄登空招五星上法经 经名：上清迥神飞霄登空招五星上法经。 撰人不详，约出於南北朝。 系纂集《迥神飞霄登空招五星上法》、《镇神养生内思飞仙上法》二篇而成。 一卷。 底本出处：《正统道藏》正一部。 上清回神飞霄登空招五星上法经 回神飞霄登空招五星上法 回神哺饮上招五星登空之道，上冲七玄，下解兆形，混合万变，立升玄纲，沐浴兰香，入室清斋，修行其方，五内映明，七孔朗然，神镇绛府，形登五晨，至极妙法，非真不传。 所谓知道者易，修方者难，难修之道，可不秘乎。 常当以甲子、甲午、乙酉、乙卯、己丑、己未、戊辰、戊戌之日，沐浴清斋入室，坐卧任意，临目执手於心，仿髴存东方青帝，讳通明，字盖卿，巾青巾，衣青衣，青冠青履，带通光阳霞之章，入我身中。 又思肝中四真，名青明君，字明轮童子，常镇我肝中，守我胃管之户，膏膜之下，固塞死气，为我降青精月水玉芝。 因存岁星光精，口引咽之九十过止，令气极充於肝府。 行之九年，使东方青腰玉女九人侍侧。 次思南方赤帝，讳太阳，字幻林，巾赤巾，衣赤衣，赤冠赤履，带四朗朱碧之章，入兆身中。 又思绛宫中一元丹皇君，名神运珠，字子南丹，一名生上伯，一名史云拘，常镇我绛宫中，守我项骨首之户，断绝死气之路，为我降丹精赤水玉芝。 因存荧惑星光精，口引咽之八十过止，令赤气充布绛宫中。 行之九年，役使南方赤圭玉女八人侍侧。 次思西方白帝，讳通阴，字元起，巾白巾，衣素衣，素冠素履，带皓灵扶希之章，入兆身中。 又思肺中六真，名上素君，字梁南中童，恒镇我肺中，守我十二关门，断绝死气之路，为我降素芝月水玉精之丹。 因存太白星精光，口引咽之六十过止，令星气布充於肺。 行之九年，太素玉女六人侍侧。 次思北方黑帝，讳通神，字子规，巾苍巾，衣皂衣，苍冠苍履，带郁真箫凤之章，入兆身中。 又思肾中七真君，名玄阳君，字冥光先生，常镇我两肾中，守我背骨地户，断塞死气之路，为我降玄阴丹芝九液之水。 因存北方辰星精光，口引咽之五十过止，令星气充布两肾之中。 行之九年，太玄玉女五人侍侧。 次思中央黄帝，讳万福，字太仓，巾黄巾，衣黄衣，黄冠黄履，带中元八维玉门之章，入兆身中。 又思脾中五真君，名养光君，字太昌子，常镇我脾中，守我极根之户，断绝死气之路，为我致黄水月华玉胎丹芝。 因存中央镇星精光，口引咽之十二过止，令气充於脾中。 行之九年，黄素玉女十二人侍侧。 次思上玄元父君，讳高同生，字左回明； 下元玄母，名叔火王，字右回光。 二神守我本命之根，塞我死气之源，为我致阳芝阴精，哺饲我身。 存日月二景之光，映照一形，口引光色三十六咽止，令光气充盈脐下丹田宫。 行之九年，面生金容，目有流光，役使六甲，召制六丁，随意所欲。 真人诣房存思五帝二景真神事讫，祝曰： 五星缠络，光流内明，二景飞霞，灌溉五精，真神镇藏，长保黄宁，太乙务猷，变胎回婴，肝肺结华，心肾光盈，脾保中元，五芝受生，日月宝光，与帝合并，飞空腾虚，上朝玉清。 修行回神哺饲招五星飞空，事毕於此，行之九年，存祝不亏，真灵内映，三元诣房，绝死气於九房，度生录於南宫，承五神之玄注，咽二景以长存，五藏结华而不朽，魂魄保镇而停年。",
      "translated_text": "**The Supreme Clarity Scripture of Reverting the Spirit, Soaring through the Empyrean, Ascending the Void, and Summoning the Five Stars: The Upper Method**\n\n**Scripture Title:** *The Supreme Clarity Scripture of Reverting the Spirit, Soaring through the Empyrean, Ascending the Void, and Summoning the Five Stars: The Upper Method*\n**Author:** Unknown, approximately dated to the Northern and Southern Dynasties.\n**Compilation:** A single fascicle combining *The Method of Reverting the Spirit, Soaring through the Empyrean, Ascending the Void, and Summoning the Five Stars* and *The Upper Method of Pacifying the Spirit, Nurturing Life, and Internal Contemplation for Ascending as an Immortal*.\n**Source Text:** *Daoist Canon of the Orthodox Tradition*, Section Zhengyi, Subsection Zheng.\n\n---\n\n### **The Method of Reverting the Spirit, Soaring through the Empyrean, Ascending the Void, and Summoning the Five Stars**\n\nThe Dao of reverting the spirit, feeding upon the celestial essence, and summoning the Five Stars to ascend the void pierces the Seven Mysteries above and dissolves the myriad forms below. It unifies the ten thousand transformations, establishes the ascent to the Mysterious Framework, bathes in orchid fragrance, enters the chamber in purity, and cultivates its methods. The Five Viscera radiate clarity, the Seven Orifices shine resplendently, the spirit guards the Crimson Palace, and the form ascends the Five Mornings. This is the most wondrous method—it is not transmitted to the untrue.\n\nThose who know the Dao find it easy; those who cultivate the method find it difficult. For this arduous path, how could it not be guarded in secrecy?\n\nOn the days of *jiazi*, *jiawu*, *yiyou*, *yimao*, *jichou*, *jiwei*, *wuchen*, and *wuxu*, bathe in purity, fast, and enter the chamber. Sit or recline as you wish, close your eyes, and clasp your hands over your heart. Visualize the Azure Emperor of the East, whose taboo name is *Tongming* and style *Gaiqing*. He wears a cyan turban, cyan robes, a cyan crown, and cyan shoes, and bears the insignia of *Tongguang Yangxia*. Enter my body.\n\nNext, visualize the Four Perfected of the Liver, named *Qingming Jun* and styled *Minglun Tongzi*, who eternally guard my liver, protect the gate of my stomach duct, and beneath the adipose membrane, block the dead qi. They bestow upon me the Azure Essence, the Lunar Water, and the Jade Mushroom. Then, visualize the luminous essence of Jupiter, drawing it into the mouth and swallowing it ninety times, allowing the qi to fill the Liver Palace. After nine years of practice, nine Azure Waist Jade Maidens of the East will attend at your side.\n\nNext, visualize the Vermilion Emperor of the South, whose taboo name is *Taiyang* and style *Huanlin*. He wears a crimson turban, crimson robes, a crimson crown, and crimson shoes, and bears the insignia of *Silang Zhubi*. Enter my body.\n\nNext, visualize the Primordial Cinnabar Sovereign of the Crimson Palace, named *Shenyun Zhu* and styled *Zinan Dan*, also called *Shengshang Bo* and *Shiyun Ju*, who eternally guards my Crimson Palace, protects the gate of my cervical vertebrae, and severs the path of dead qi. He bestows upon me the Cinnabar Essence, the Vermilion Water, and the Jade Mushroom. Then, visualize the luminous essence of Mars, drawing it into the mouth and swallowing it eighty times, allowing the vermilion qi to suffuse the Crimson Palace. After nine years of practice, eight Vermilion Jade Maidens of the South will serve at your side.\n\nNext, visualize the White Emperor of the West, whose taboo name is *Tongyin* and style *Yuanqi*. He wears a white turban, plain robes, a white crown, and white shoes, and bears the insignia of *Haoling Fuxi*. Enter my body.\n\nNext, visualize the Six Perfected of the Lungs, named *Shangsu Jun* and styled *Liangnanzhong Tong*, who eternally guard my lungs, protect the Twelve Passes, and sever the path of dead qi. They bestow upon me the Plain Mushroom, the Lunar Water, and the Jade Essence Elixir. Then, visualize the luminous essence of Venus, drawing it into the mouth and swallowing it sixty times, allowing the stellar qi to fill the lungs. After nine years of practice, six Supreme Plain Jade Maidens will attend at your side.\n\nNext, visualize the Black Emperor of the North, whose taboo name is *Tongshen* and style *Zigui*. He wears a dark turban, black robes, a dark crown, and dark shoes, and bears the insignia of *Yuzhen Xiaofeng*. Enter my body.\n\nNext, visualize the Seven Perfected Sovereigns of the Kidneys, named *Xuanyang Jun* and styled *Mingguang Xiansheng*, who eternally guard my two kidneys, protect the Earth Gate of my spine, and block the path of dead qi. They bestow upon me the Mysterious Yin Elixir and the Nine Liquids of the Jade Mushroom. Then, visualize the luminous essence of Mercury, drawing it into the mouth and swallowing it fifty times, allowing the stellar qi to fill the two kidneys. After nine years of practice, five Supreme Mysterious Jade Maidens will attend at your side.\n\nNext, visualize the Yellow Emperor of the Center, whose taboo name is *Wanfu* and style *Taicang*. He wears a yellow turban, yellow robes, a yellow crown, and yellow shoes, and bears the insignia of *Zhongyuan Bawei Yumen*. Enter my body.\n\nNext, visualize the Five Perfected Sovereigns of the Spleen, named *Yangguang Jun* and styled *Taichang Zi*, who eternally guard my spleen, protect the gate of my root extremity, and sever the path of dead qi. They bestow upon me the Yellow Water, the Lunar Radiance, and the Jade Embryo Elixir. Then, visualize the luminous essence of Saturn, drawing it into the mouth and swallowing it twelve times, allowing the qi to fill the spleen. After nine years of practice, twelve Yellow Plain Jade Maidens will attend at your side.\n\nNext, visualize the Supreme Mysterious Primordial Father, whose taboo name is *Gaotongsheng* and style *Zuohuiming*, and the Lower Mysterious Primordial Mother, named *Shuhuowang* and styled *Youhuiguang*. These two spirits guard the root of my original destiny, block the source of dead qi, and bestow upon me the Yang Mushroom and Yin Essence to nourish my body.\n\nVisualize the radiance of the Two Luminaries (Sun and Moon), illuminating my form. Draw their light into the mouth and swallow it thirty-six times, allowing the luminous qi to fill the Cinnabar Field below the navel. After nine years of practice, your face will assume a golden countenance, your eyes will emit flowing light, and you will command the Six Jia and summon the Six Ding, fulfilling every desire.\n\nWhen the Perfected One has completed the visualization of the Five Emperors and the Two Luminaries, recite the incantation:\n\n> *\"The Five Stars entwine and weave, their light flowing within to illuminate.\n> The Two Luminaries soar with rosy clouds, irrigating the Five Essences.\n> The Perfected Spirits guard and store, eternally preserving the Yellow Tranquility.\n> The Great Unity’s grand design transforms the embryo and reverts to infancy.\n> Liver and lungs blossom in splendor, heart and kidneys brim with radiance.\n> The spleen guards the Central Mystery, the Five Mushrooms receive life.\n> The precious light of the Sun and Moon merges with the Emperor.\n> Soaring through the void, ascending to the Jade Clarity.\"*\n\nThe practice of reverting the spirit, feeding upon the celestial essence, and summoning the Five Stars to ascend the void concludes here. After nine years of unwavering cultivation and visualization, the true numina will inwardly radiate. The Three Origins will attend the chamber, severing the dead qi in the Nine Chambers and delivering the Register of Life to the Southern Palace. Receiving the mysterious infusion of the Five Spirits and swallowing the Two Luminaries, one attains eternal existence. The Five Viscera blossom in splendor and never decay; the hun and po are preserved and guarded, prolonging the years.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1302,
      "start_sentence": 0,
      "end_sentence": 38,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.4438214302063,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清回神飞霄登空招五星上法经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "镇神养生内思飞仙上法 太微天帝君镇神内思解胞散结固魂凝魄混化玄真之道，开通六府，五官受灵，咽气思真，芳芝自生，胃管结络，神澄体清，玉辇立至，白日登晨。 常当清斋沐浴，烧香入室，夷心弃累遗尘，豁然无滞，注念不眠，然后真形可睹，游神可还。 每以平旦东向平坐，临目内存形色朗然，呼其正讳还镇本宫，叩齿三十六通。 乃存发神名苍华，字太元，形长二寸一分； 脑神名精根，字泥丸，形长一寸一分； 眼神名明上，字英玄，形长三寸； 鼻神名玉陇，字灵坚，形长二寸五分； 耳神名空闲，字幽田，形长三寸一分； 舌神名通命，字正轮，形长七寸； 齿神名崿锋，字罗千，形长一寸五分。 面部七神，同衣飞罗裙，并婴儿之形。 存之审正，罗列一面，各镇其宫。 毕，便叩齿二十四通，咽气十二过，咒曰： 灵源散气，结气成神，分别前后，总统泥丸，上下相扶，七神敷陈，流形遁变，爱养华元，导引八灵，上冲洞门，卫躯摄景，上升帝晨。 毕。 次思心神名丹元，字守灵，形长九寸； 肺神名皓华，字虚成，长八寸； 肝神名龙烟，字合苍明，长七寸； 肾神名玄冥，字育婴，长三寸六分； 脾神名常在，字魂庭，长七寸三分； 胆神名龙曜，字威明，长三寸六分。 六府真神，同着丹锦飞裙，处五脏之内，六府之宫，形若婴儿，色如华童。 存之审正，罗列之形，从朝至暮，思念勿忘，叩齿二十四通，咽气十二过，祝曰： 五脏六腑，真神同归，总御绛宫，上下相随，金房赤子，对处四扉，幽房玄阙，神堂纽机，混化生神，真气精微，保炼丹田，与日齐晖，得与八景，合形升飞。 毕。 次思精血三真，名元生君，字黄宁子，恒镇我两孔之下源； 骨节二真，名坚玉君，字凝羽珠，镇我太仓之府五肠之口； 心中一真，名天精津液君，字飞生上英，镇我胸中四极之口； 九元之真男，名拘制，字三阳，镇我左耳伏晨之户； 皇一之魂女，名上归，字帝子，镇我右耳伏晨之户； 紫素左元君，名翳郁无刃，字安来上，镇我头面之境； 黄素中无君，名圆华黄刃，字太张上，镇我胸腹之境； 白素右元君，名启明萧刃，字金门上，镇我下关之境； 日中司命，名接生，镇我左手中； 月中桃君，名方盈，镇我右手； 胎中一元白气君，名务玄子，字育尚生； 太一精魂，名玄归子，字盛昌，二神镇我五脏之上结，结喉之本； 结中青气君，名案延昌，字合和婴； 元君精魂，名保谷童，字明夫，二神镇我五脏之下，大胃之上； 节中黑气君，名斌来生，字精上门； 帝真精魂，名幽台生，字灌上生，二神镇我九肠之口，伏源之下； 胞中黄气君，名祖明车，字神无极； 天帝精魂，名理维藏，字法珠，二神镇我少腹之内，二孔之本； 血中赤气君，名混离子，字叔保坚； 司命精魂，〔名〕#1发纽子，字庆玄，二神镇我百关之血绝节之下； 上玄元父君，名高同生，字左回明； 下元玄母，〔名〕#2叔火王，字右回光； 帝皇太一，名重冥空，字幽寥无； 九帝尊，名曰明真，字众帝生； 太帝精魂，名右阳堂玉，字八灵； 九关魂，名绿回道，字绝冥； 天纪帝魂，名照无阿，字广神，七神镇我本命之根，塞我死路之门。 存祝众真从头至脐，无不朗然，便使金液流匝，玉华映魂，神溢於穷肠，帝气充於九关，七祖披释於三徒，受更胎於南宫，镇生神於一身，布真气以固年。",
      "translated_text": "**The Supreme Method of Stabilizing the Spirit, Nurturing Life, and Inwardly Visualizing the Flight to Immortality**\n\nThe Perfected Lord of the Grand Tenuity Heaven stabilizes the spirit through inward visualization, dissolving the fetal bonds, dispersing knots, securing the *hun*, and congealing the *po*—the Dao of blending and transforming the Mysterious True. Opening the Six Bowels, the Five Offices receive numina. Swallowing *qi* and contemplating the True, fragrant mushrooms spontaneously grow. The stomach’s tubes and networks solidify; the spirit clarifies, the body purifies. The Jade Chariot arrives at once, and one ascends the dawn in broad daylight.\n\nOne must always fast in purity, bathe, burn incense, and enter the chamber. Calm the heart, cast off burdens, and abandon dust—suddenly, all obstructions vanish. Focus the mind without sleep, and then the true form may be seen, the wandering spirit may return.\n\nEach morning at dawn, face east and sit upright. Close the eyes and inwardly visualize the form and color, bright and clear. Call their true names to return and stabilize their original palaces, then knock the teeth thirty-six times.\n\nNext, visualize the spirit of the hair, named **Canghua**, styled **Taiyuan**, two *cun* and one *fen* in height;\nthe spirit of the brain, named **Jinggen**, styled **Niwan**, one *cun* and one *fen* in height;\nthe spirit of the eyes, named **Mingshang**, styled **Yingxuan**, three *cun* in height;\nthe spirit of the nose, named **Yulong**, styled **Lingjian**, two *cun* and five *fen* in height;\nthe spirit of the ears, named **Kongxian**, styled **Youtian**, three *cun* and one *fen* in height;\nthe spirit of the tongue, named **Tongming**, styled **Zhenglun**, seven *cun* in height;\nthe spirit of the teeth, named **Efeng**, styled **Luoqian**, one *cun* and five *fen* in height.\nThe seven spirits of the face all wear flying silk skirts, each in the form of an infant. Visualize them distinctly, arrayed across the face, each stabilizing its palace. When complete, knock the teeth twenty-four times, swallow *qi* twelve times, and recite the incantation:\n\n*\"The numinous source disperses *qi*,\nknits *qi* into spirit,\ndistinguishes front and back,\ngoverns the Muddy Pellet.\nAbove and below support one another,\nthe seven spirits array themselves.\nFlowing forms shift and change,\nnurturing the radiant origin.\nGuiding and drawing the Eight Numinous,\nthey surge upward through the Cavernous Gate,\nguarding the body and gathering the luminous,\nascending to the Emperor’s Dawn.\"*\n\nWhen finished, next visualize the spirit of the heart, named **Danyuan**, styled **Shouling**, nine *cun* in height;\nthe spirit of the lungs, named **Haohua**, styled **Xucheng**, eight *cun* in height;\nthe spirit of the liver, named **Longyan**, styled **Hecangming**, seven *cun* in height;\nthe spirit of the kidneys, named **Xuanming**, styled **Yuying**, three *cun* and six *fen* in height;\nthe spirit of the spleen, named **Changzai**, styled **Hunting**, seven *cun* and three *fen* in height;\nthe spirit of the gallbladder, named **Longyao**, styled **Weiming**, three *cun* and six *fen* in height.\nThe true spirits of the Six Bowels all wear cinnabar brocade flying skirts, dwelling within the Five Viscera and the palaces of the Six Bowels, their forms like infants, their colors like radiant youths. Visualize them distinctly, arraying their forms from dawn to dusk, contemplating without forgetfulness. Knock the teeth twenty-four times, swallow *qi* twelve times, and invoke:\n\n*\"The Five Viscera and Six Bowels,\ntrue spirits unite as one,\ngoverning the Crimson Palace together,\nabove and below following one another.\nThe Golden Chamber’s Red Child\ndwells opposite the Four Gates.\nThe Dark Chamber and Mysterious Portal,\nthe Spirit Hall’s pivotal mechanism—\nblending and transforming to generate spirit,\ntrue *qi* refined and subtle.\nPreserve and refine the Cinnabar Field,\nshining with the sun’s splendor,\nto join the Eight Luminous,\nunite form and ascend in flight.\"*\n\nWhen finished, next visualize the Three Perfected of Essence and Blood, named **Yuansheng Jun**, styled **Huangningzi**, eternally stabilizing the source beneath my two apertures;\nthe Two Perfected of Bones and Joints, named **Jianyu Jun**, styled **Ningyuzhu**, stabilizing my Granary Storehouse and the mouth of the Five Intestines;\nthe One Perfected within the heart, named **Tianjing Jinye Jun**, styled **Feisheng Shangying**, stabilizing the mouth of the Four Extremities in my chest;\nthe True Male of the Nine Origins, named **Jouzhi**, styled **Sanyang**, stabilizing the Gate of Hidden Dawn in my left ear;\nthe Imperial One’s *Hun*-Female, named **Shanggui**, styled **Dizi**, stabilizing the Gate of Hidden Dawn in my right ear;\nthe Left Primordial Perfected of Purple Simplicity, named **Yiyu Wuren**, styled **Anlai Shang**, stabilizing the region of my head and face;\nthe Central Primordial Perfected of Yellow Simplicity, named **Yuanhua Huangren**, styled **Taizhang Shang**, stabilizing the region of my chest and abdomen;\nthe Right Primordial Perfected of White Simplicity, named **Qiming Xiaoren**, styled **Jinmen Shang**, stabilizing the region of my lower barrier;\nthe Director of Destiny in the Sun, named **Jiesheng**, stabilizing my left hand;\nthe Peach Lord in the Moon, named **Fangying**, stabilizing my right hand;\nthe Primordial White *Qi* Lord of the Womb, named **Wuxuanzi**, styled **Yushangsheng**;\nthe Supreme One’s Essence and *Hun*, named **Xuanguizi**, styled **Shengchang**—these two spirits stabilize the knot above my Five Viscera, the root of the throat’s junction;\nthe Azure *Qi* Lord of the Junction, named **Anyanchang**, styled **Heheying**;\nthe Perfected *Hun* of the Primordial Lord, named **Baogutong**, styled **Mingfu**—these two spirits stabilize below my Five Viscera, above the Great Stomach;\nthe Black *Qi* Lord of the Nodes, named **Binlaisheng**, styled **Jingshangmen**;\nthe Imperial True Perfected *Hun*, named **Youtaisheng**, styled **Guanshangsheng**—these two spirits stabilize the mouth of my Nine Intestines, beneath the Hidden Source;\nthe Yellow *Qi* Lord of the Womb, named **Zumingche**, styled **Shenwuji**;\nthe Heavenly Emperor’s Essence and *Hun*, named **Liweizang**, styled **Fazhu**—these two spirits stabilize within my lower abdomen, the root of the two apertures;\nthe Red *Qi* Lord of the Blood, named **Hunlizi**, styled **Shubaojian**;\nthe Director of Destiny’s Essence and *Hun*, named **Faniuzi**, styled **Qingxuan**—these two spirits stabilize beneath the severed nodes of the hundred joints in my blood;\nthe Upper Primordial Father Lord, named **Gaotongsheng**, styled **Zuohuiming**;\nthe Lower Primordial Dark Mother, named **Shuhuowang**, styled **Youhuiguang**;\nthe Imperial Supreme One, named **Chongmingkong**, styled **Youliaowu**;\nthe Nine August Emperors, named **Mingzhen**, styled **Zhongdisheng**;\nthe Supreme Emperor’s Essence and *Hun*, named **Youyangtangyu**, styled **Baling**;\nthe Nine Barriers’ *Hun*, named **Lühuidao**, styled **Xueming**;\nthe Heavenly Register’s Imperial *Hun*, named **Zhaowua**, styled **Guangshen**—these seven spirits stabilize the root of my original destiny, sealing the gate of my death’s path.\n\nVisualize and invoke the host of Perfected from the head to the navel, none not radiant and clear. Then let the Golden Fluid flow in circuits, the Jade Splendor illuminate the *hun*, the numinous *qi* overflow the hidden intestines, and the Emperor’s *qi* fill the Nine Barriers. The Seven Ancestors are released from the Three Realms, receive rebirth in the Southern Palace, stabilize the life-spirit within the body, and spread true *qi* to secure the years.",
      "overlap_context": " concludes here. After nine years of unwavering cultivation and visualization, the true numina will inwardly radiate. The Three Origins will attend the chamber, severing the dead qi in the Nine Chambers and delivering the Register of Life to the Southern Palace. Receiving the mysterious infusion of the Five Spirits and swallowing the Two Luminaries, one attains eternal existence. The Five Viscera blossom in splendor and never decay; the hun and po are preserved and guarded, prolonging the years.",
      "start_char": 1303,
      "end_char": 2581,
      "start_sentence": 39,
      "end_sentence": 92,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.14054083824158,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清回神飞霄登空招五星上法经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "毕，叩齿三十九通，祝曰： 气生於无，结气於神，阳气外贞，阴气内成，二象番错，交结元灵，内真镇卫，九孔受生，保魂固魄，万神安停，保我三关，华芝充盈，与我同升，俱造玉清。 毕，咽气三十九过。 以镇三十九户，气泽匝润流布一身。 若能弃累，不拘世尘，静心夷意，朗睹虚房，眄想内视，镇神固魂，绝死气於九户，镇生宫於上关，回匝存祝，如面共言，昼夜三年，真神见形，皓华反根，朽齿牙生，五藏结络，内补充盈，役召六甲，驱策六丁，室致九霄之宾，神降三素之軿，神飞形举，白日登晨。 右上真之神宝名内字，而镇在人身之内，运於九天之气，固人六府机关。 万精化生，皆由於神，神镇则生，神逝则亡，勤心积感，则能举人身形，上升玄宫。 求仙之道，不知形神内名，又不知填塞死户，生岂可冀乎。 夫修此道，不得身履殗秽，食五辛酒肉之属，触忤正气，神则去矣。 人知丰肴以甘口，爵禄以荣身，而不愿甘口之食，是伤命之斧，爵禄奢丽，是消真之源。 故神人爱幽寂，不栖身，不显形於凡尘者也。 修生之家，宜可慎乎。 上清回神飞霄登空招五星上法经竟 #1#2『名』字据前后文补。",
      "translated_text": "Upon completion, strike the teeth thirty-nine times and invoke:\n\nThe *qi* arises from nothingness, coalesces with the spirit;\nYang *qi* steadies without, Yin *qi* matures within.\nThe two images intertwine, fusing with the primordial numen.\nThe inner Perfected guard and protect, the nine apertures receive life.\nPreserve the *hun*, secure the *po*, the myriad spirits rest in peace.\nSafeguard my Three Barriers, let the flowering mushrooms fill and overflow.\nAscend with me together, jointly attain the Jade Clarity.\n\nUpon completion, swallow the *qi* thirty-nine times to stabilize the thirty-nine portals, allowing the *qi*-moisture to circulate and suffuse the entire body.\n\nShould one cast off burdens, untether from worldly dust,\ncalm the heart and pacify the intent,\nclearly perceive the empty chamber,\ngaze inward in contemplation,\nstabilize the spirit and secure the *hun*,\nseal the death-*qi* at the nine portals,\nand anchor the life-palace at the Upper Barrier—\nrevolving in cycles of visualization and invocation,\nas though speaking face-to-face—\nthen after three years, day and night,\nthe true spirit will manifest in form.\nRadiant splendor returns to the root,\nrotten teeth regrow,\nthe Five Viscera knit their networks,\nthe inner fills to abundance.\nOne may command the Six *Jia*, dispatch the Six *Ding*,\nsummon guests from the Nine Empyreans,\nand welcome the gods descending in the Three Primes’ chariot.\nThe spirit soars, the form ascends—\nby daylight, one mounts the dawn.\n\nThis is the divine treasure of the Supreme Perfected, named the \"Inner Character,\"\nwhich stabilizes within the human body,\ncirculates the *qi* of the Nine Heavens,\nand secures the mechanisms of the Six Palaces.\nThe myriad essences transform and arise—all through the spirit.\nWhen the spirit is anchored, life endures; when the spirit departs, life perishes.\nThrough diligent cultivation and accumulated resonance,\none may uplift the body’s form to ascend to the Dark Palace.\n\nThe Dao of seeking immortality—\nwithout knowing the inner names of form and spirit,\nwithout knowing how to seal the portals of death—\nhow can one hope for life?\n\nIn practicing this Dao,\none must not dwell in filth or impurity,\nnor consume the five pungents, wine, or meat—\nsuch things offend the true *qi*, and the spirit will depart.\n\nPeople know that rich delicacies please the palate,\nand ranks and emoluments glorify the body,\nyet they do not desire the sweetness of the palate’s food—\nthis is the axe that wounds life.\nExtravagant ranks and luxuries are the wellspring that drains the true.\nThus do the spirit-people cherish seclusion,\nneither lodging the body nor revealing their form in the mundane world.\n\nThose who cultivate life—ought they not be cautious?\n\n*The Scripture of the Supreme Clarity on Revolving the Spirit, Soaring to the Empyreans, and Summoning the Five Stars’ Upper Method* concludes.",
      "overlap_context": ", sealing the gate of my death’s path.\n\nVisualize and invoke the host of Perfected from the head to the navel, none not radiant and clear. Then let the Golden Fluid flow in circuits, the Jade Splendor illuminate the *hun*, the numinous *qi* overflow the hidden intestines, and the Emperor’s *qi* fill the Nine Barriers. The Seven Ancestors are released from the Three Realms, receive rebirth in the Southern Palace, stabilize the life-spirit within the body, and spread true *qi* to secure the years.",
      "start_char": 2581,
      "end_char": 3044,
      "start_sentence": 93,
      "end_sentence": 106,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.868922233581543,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清回神飞霄登空招五星上法经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}