{
  "source_id": "上清黄书过度仪",
  "source_file": "chunked_daozang\\上清黄书过度仪.json",
  "total_chunks": 10,
  "total_original_chars": 9156,
  "total_translated_chars": 59254,
  "total_translation_time": 294.9058108329773,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\上清黄书过度仪.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Yellow Book of Shangqing Rites for Crossing Over**\n\n**Scripture Title:** *The Yellow Book of Shangqing Rites for Crossing Over*. Author unknown, approximately dating to the Northern and Southern Dynasties. A ritual manual for bedroom cultivation practices in the early Heavenly Master Dao tradition. One scroll. Base text from *Daoist Canon of the Zhengtong Era*, Orthodox Section, Part One.\n\n---\n\n**The Yellow Book of Shangqing Rites for Crossing Over**\n\nWhen disciples receive the Dao under a master’s guidance, they must not exceed twenty years of age for the Crossing Over; if they receive the Dao beyond twenty, it is considered an overstepping, and they must bathe, observe prohibitions, and burn incense. Upon entering the oratory (*jing*), they must first report to the master before proceeding. Upon entering and exiting, they bow to the oratory and express gratitude.\n\n**Entering the Oratory**\nFor the first entry into the oratory, the yang disciple stands at the *yin* position (north), and the yin disciple stands at the *shen* position (west). The one seeking the Crossing Over kneels and says: *\"I, a mortal of flesh, am fortunate beyond a thousand generations to have been touched by the transformative power of the Dao. Having sought the Dharma for some time yet remaining uninitiated into the Crossing Over, I bow my head in reverence and take refuge, begging for the gift of life.\"* They then bow twice.\n\nThe master responds: *\"Today is auspicious; it is fitting to serve as your bridge.\"*\n\nThe seeker repeats: *\"I humbly pray for its fulfillment.\"*\n\nThe master replies: *\"I shall make the announcement.\"* The disciple, overwhelmed by the grace received, bows twice more to the master, who then takes their hand and leads them to face east.\n\n**Visualizing the Officials and Soldiers**\nBoth stand facing east, the yang on the left and the yin on the right, hands clasped together. The yang disciple interlocks fingers, with the second finger inserted between the yin disciple’s second and third fingers. Each sounds the drum twelve times in their mind, visualizing the Registrar Officials and Envoys, Generals, and Soldiers from the talismans they wear. These figures are adorned in resplendent robes, arrayed in ranks, guarding the disciples front and back, left and right. They are to summon the life-generating *qi* of the four directions to dispel calamities and disperse misfortune, reporting and distinguishing matters with clarity.\n\nThis visualization is performed once and then concluded.\n\n**Visualizing the White Qi**\nEach visualizes a white *qi* from the cinnabar field (*dantian*), as large as a six-inch mirror, emerging between the eyebrows. It gradually expands, radiating brilliance that illuminates the head above and showers the body below, penetrating to reveal the five viscera, six bowels, nine palaces, twelve chambers, four limbs, five constituents, joints, sinews, vessels, pores, and defensive and constructive *qi*—both exterior and interior—all becoming luminously clear.\n\nThis visualization is performed once and then concluded.\n\n**Visualizing the Royal Qi**\nEach visualizes the royal *qi* according to the season:\n- In spring, visualize the green *qi* of the east nourishing the body, accompanied by red *qi*.\n- In summer, visualize the red *qi* of the south, accompanied by yellow *qi*.\n- In autumn, visualize the white *qi* of the west, accompanied by black *qi*.\n- In winter, visualize the black *qi* of the north, accompanied by green *qi*.\n- During the four seasons, visualize the yellow *qi* of the center, accompanied by white *qi*.\n\nTilt the head back to inhale the *qi* through the nose, then lower the head to swallow it, guiding it down to the cinnabar field. From there, it ascends to the Kunlun (head). This is done three times, with three swallowings, and then concluded.\n\n**Swallowing the Three Palaces**\nEach visualizes the life-generating *qi* of the Three Origins descending in pure whiteness, enveloping the body. Tilting the head back, they inhale the life-generating *qi* through the nose and say: *\"Palace of Heavenly One, may the life-generating *qi* come to enliven me.\"* Lowering the head, they swallow it, filling the lower cinnabar field, then guiding it upward to the Mud Pill (head). Following the method of Heaven, Earth, and Water, they recite the incantation and swallow. Tilting the head back again, they inhale the life-generating *qi* of the Three Palaces—Heaven, Earth, and Water—through the nose, saying: *\"May the life-generating *qi* of the Three Palaces come together to enliven my body.\"* Lowering the head, they swallow it, filling the lower cinnabar field, then guiding it upward to the Mud Pill. The life-generating *qi* of the Three Palaces, vast and pure white, covers the body and permeates the five viscera, six bowels, and the twelve branches and trunks.\n\nThis visualization is performed once and then concluded.\n\n**Initiating the Rite**\n\nThe Sixth Rite proceeds with all facing east in a long kneel, each sounding the drum twelve times. The functionary of my body, the *li* officials, emerge—from the Upper Transcendent and Upper Numinous Bureaus—along with the direct envoys of the Orthodox Unity, the *yin-yang* life-generating *qi*, the functionaries for healing maladies, the left and right officials, and the *yin-yang* divine *yu* scribes, two in number. Those who emerge don their solemn attire and stand before and behind me, all receiving the words from my mouth. They are to distinguish and relay the following to the relevant commanderies, counties, townships, and hamlets:\n\nThe Central Perfected Officials infuse *qi* and summon all the Lords, Generals, and *li* officials. The Four Beginnings stand vigilant, monitoring the four directions. All officials, lords, and generals who preside over the summons—with reverence, I humbly address:\n\nThe Supreme Non-Ultimate Great Dao, the Most High Mysterious Elder, the Lords, Generals, and *li* officials of the Three *Qi*;\nThe Most High Lord Lao, the Most High Elder, and all Lords, Generals, and *li* officials;\nThe life-generating *qi* of the Three Masters—Celestial Master, Lineage Master, and Female Master—and their disciples;\nAll Lords, Generals, and *li* officials;\nThe Perfected Lords and Generals;\nThe Lords and Generals of Supreme Harmony;\nThe Lords and Generals of the Yellow Writ and the Contract of the Abdominal Eye;\nThe Nine *Qi* Elders and the Lords and Generals of Summons;\nThe Lords and Generals of *Yin-Yang* Life-Generating *Qi* and Dao Transmission;\nThe Central Womb Perfected and the Lords and Generals of Preparation;\nThe Central Womb Red-and-White and the Lords and Generals of Discharge;\nThe Central Yellow *Wu-Ji* and the Lords and Generals of the Hundred Joints;\nThe *Yin-Yang* Functionaries and the Lords and Generals of Transformation;\nThe *Yin-Yang* Perfected *Qi* and the Lords and Generals of Transcendent Dao;\nThe Lords and Generals of Internal and External Supervision and Enlightenment;\nThe Lords and Generals of Disaster Dispersion, Calamity Dissolution, and Tribulation Resolution;\nThe Heavenly, Earthly, and Human Standards, the Three Pennants, and the Four Seasons and Eight Nodes;\nThe Five Phases and the Union of the Three and Five, the Functionaries of the Dipper’s Handle, and the Lords and Generals;\nThe Lords and Generals of the Three Officials—Heaven, Earth, and Water—summoning all officials;\nThe Lords and Generals of this hamlet and encampment, and the transforming spirits within;\nThe Lords and Generals of the One Hundred Twenty *Qi* and the Former *Qi*;\nThe Lords and Generals of Ghosts and Bandits.\n\nI, [Name], prostrate in awe and trepidation, declare: I, in my foolishness and ignorance, delight in the Dao and cherish life. Previously, under the guidance of Master [Name], Libationer of *Qi* Cultivation and Perfected One, I received the essential teachings and the Eightfold Great Salvation Method. Bound by duty, I now uphold them.\n\nThere is a man/woman of [Commandery], [County], [Township], [Hamlet], named [Name], aged [Age] years, who delights in the Dao and aspires to transcendence. They have come before me seeking passage and salvation, vowing to practice the *yin-yang*, Five Phases, and Three *Qi*. Beginning with the Middle Prime’s first generation, then the Upper Prime’s first generation, and the Lower Prime’s first generation, the Three *Qi* intertwine to form the Dao.\n\nI humbly beseech the Lords and *li* officials of Internal and External Supervision and Enlightenment, the Lords and *li* officials of Spirit Restoration and *Qi* Replenishment, the Lords and Generals of the Encampment’s Transforming Spirits, and the Lords and Generals of the Three Officials—Heaven, Earth, and Water—to act on my behalf and [Name]’s, absolving us of the Three Officials’ judgments, expunging our names from the Registers of Death, and inscribing them in the Register of Long Life under the King. May we be counted among the Seed People.\n\nMay my spirit and that of [Name] be steadfast and our life-generating *qi* firm, suffusing our four limbs and five viscera, free from harm. May our desires be fulfilled, our passages secured, our slander silenced, our tasks completed, and our words efficacious. May we not betray the trust placed in us.\n\nI, [Name], prostrate in utmost reverence, kowtow twice and humbly submit this petition, awaiting your response and compliance.\n\n[Clan affiliation to be specified]\n[Supreme Purity to be invoked]\n\nMay the Year Star [to be specified] and the Earthly Net—on the seventh traversal of the Earthly Net’s three crossings, the first crossing to the left, the Supreme Center crossing to the right, the Mysterious Elder and the Most High joining hands—O Merciful Father and Holy Mother, release us from the snares, remove our names from the Registers of Death, and inscribe them in the Register of Life.\n\nMay the Heavenly Net—on the threefold release of the Heavenly Net, first in the Supreme Center to the right of the Mysterious Elder, then the Most High facing and joining hands—he who gave me life be Jiazi, Master Wang Wenqing, Father Kang; she who nurtured me be Jiawu, Master Wei Shangqing, Mother Niu, who bore me and sustained me, their deeds rooted in the Great Dao, together with my parents.\n\nFor the Eighth Rite, the Homage to the Four Venerables: cross both hands and raise them toward the *yin* direction, bow once, then kneel in full prostration. Declare: “Jiayin, Radiant Writ of the Dao, the Dao-Father praises and extends his grace, appointing [Name] as your servant, to dispel the great calamities of the world.” The Master says: “Let there be a man or woman born [Name], who through your servant seeks passage and deliverance.”\n\nThe disciple says: “Your servant now through Master [Name] seeks passage, that we may together uphold and practice the Dao and its virtue, beseeching harmony in the hidden viscera and the free flow of life-generating *qi* within your servant’s body. May the spirit be steadfast and firm, each free from harm.” Then turn toward the *shen* direction and declare: “Jiashen, Hu Wen, the Long Dao, the Mother who subdues the rebellious and restrains the violent—dispel for your servant the eight disasters of the eight directions on earth.”\n\nThen turn toward the *zi* direction and declare: “Jiazi, Wang Wenqing, Master Father Kang of the Xia Hall—dispel for your servant the great calamities of the world.”\n\nThen turn toward the *wu* direction and declare: “Jiawu, Wei Shangqing, Master Mother Niu—dispel for your servant the eight disasters of the eight directions on earth.”\n\nThe incantation follows the same form as that for the *yin* direction, once only.\n\nFor the Ninth Rite, Visualization: sit facing the *yang-yin* direction, with the *yin-shen* direction above. Those seeking deliverance place their knees outward, hands joined in the *yin* position and drawn back, palms covering the knees in the *yang* position, fingers interlaced and covering. Tap the teeth twelve times. Visualize the Supreme Black, the True Azure *qi* of the Mysterious Elder; the True Yellow *qi* of the Most High; the True White and the Three Blacks, all merging into a single state of primordial chaos, resembling a fledgling parrot, its five colors blending into yellow, descending into the Cinnabar Field.\n\nThus, once only.\n\nThe Ten Spirits.\n\nThe Tenth Visualization: The Ten Spirits of *Jia-zi* and *Jia-wu*\n\nFirst visualize *Jia-wu*: Wei Shangqing of *Yi-wei*; Du Zhongyang of *Bing-shen*; Zhu Bozhong of *Ding-you*; Zang Wengong of *Wu-xu*; Fan Shaoqing of *Jia-zi*; Wang Wenqing of *Yi-chou*; Long Jiqing of *Bing-yin*; Zhang Zhongqing of *Ding-mao*; Sima Qing of *Wu-chen*; Ji Chuqing. May these ten spirits ascend to the Upper Three Heavenly Courts.\n\nThe master declares: “Now there is a man or woman born under such-and-such a name, who entreats me for deliverance.”\n\nThe disciple responds: “Your disciple now entreats Master So-and-so for deliverance, that we may together practice the Dao and its virtue, entreating the harmony of *yin* and *yang*, that the *qi* of life may flow through this disciple’s body, that spirit and essence may be concentrated and firm, each free from harm. May the name be struck from the register of death and inscribed in the Jade Record of Longevity, that the nine calamities be transcended, and this disciple be made a seed-person of future generations.”\n\nFirst visualize from *Jia-zi* to *Wu-chen*, then from *Jia-wu* to *Wu-xu*.\n\nMatching *Jia*\nThe Eleventh: Matching the Twelve Honorable Names\n\n*Jia-yin*: Mingwenzhang, the Dao-Father who praises and extends the ten;\n*Jia-shen*: Hu Wenchang, the Dao-Mother who expounds and subdues the ten.\n\nThe master declares: “Now there is a man or woman born under such-and-such a name, who entreats me for deliverance.”\n\nThe disciple responds: “Your disciple now entreats Master So-and-so for deliverance, that we may together practice the Dao and its virtue, entreating the harmony of *yin* and *yang*, that the *qi* of life may flow through this disciple’s body, that the register of death be struck and the name inscribed in the Jade Record of Longevity, that the nine calamities be transcended, and this disciple be made a seed-person of future generations.”\n\nNext invoke:\n*Jia-zi* Wang Wenqing, the Master-Father Kang;\n*Jia-wu* Wei Shangqing, the Master-Mother *Niū-nǎi* (cut as *chǒu*);\n*Yi-hai* Pang Mingxin, the Dao-Father Qi Dian Tuo;\n*Yi-si* Tang Wenqing, the Dao-Mother *Mǐn* (门+也, cut as *bà*);\n*Yi-mao* Dai Gongyang, the Dao-Father Qi Qizhi;\n*Yi-you* Kong Ligong, the Dao-Mother *Mā* (慈卒/慈律, cut as *cù/lǜ*);\n*Jia-chen* Meng Feiqing, the Dao-Father Chu Zhi Zao Dongshi;\n*Jia-xu* Zhan Zijiang, the Dao-Mother *Xì* (女+恚, cut as *zhì-yù*);\n*Yi-chou* Long Jiqing, the Dao-Father *Qìe* (加+手) Ning Qi Nanwei;\n*Yi-wei* Du Zhongyang, the Dao-Mother *Shī*.\n\nThe Five Spirits\nThe Twelfth Visualization: The Five Spirits\n\nThe Spirit of the Great Year, the Spirit of the Current Month, the Spirit of One’s Original Destiny, the Spirit of the Year of Age, the Spirit of the Present Day. May these five spirits ascend to the Three Heavenly Courts.\n\nThe master declares: “Now there is a man or woman born under such-and-such a name, who entreats me for deliverance.”\n\nThe disciple responds: “Your disciple now entreats Master So-and-so for deliverance, that we may together practice the Dao and its virtue, that the Three Officials’ investigations be resolved, the net of entanglements undone, the register of death struck, the name inscribed in the Jade Record of Longevity, the nine calamities transcended, and this disciple be made a seed-person of future generations.”\n\nThus, twice only.\n\nThe Eight Generations\nThe Thirteenth: Unbinding the Hands and the Eight Generations\n\nFirst: Play of the Dragon and Tiger\nLeft: the Supreme Center; Right: the Mysterious Elder, the Most High.\n“This disciple now delivers the man or woman born under such-and-such a name, that we may together practice the Dao and its virtue, entreating the *yin* and *yang* *qi* of life to be born within this disciple, resolving the Three Officials’ investigations, undoing the net of entanglements, striking the register of death, inscribing the name in the Jade Record of Longevity, transcending the nine calamities, and making this disciple a seed-person of future generations.”\n\nSecond: Turning the Pass\nLeft: the Supreme Center; Right: the Mysterious Elder, the Most High.\nThe newly emerged Lord Lao, the Supreme Clarity of the Primordial Mystery, the Great Dao of the Boundless Upper Three Heavens.\n\nThird: Dragon and Tiger in Union\nLeft: the Supreme Center; Right: the Mysterious Elder, the Most High.\nLord Lao, the Most High, the Venerable Lord of the Three *Qi*.\n\nFourth: Dragon and Tiger in Alignment\nLeft: the Supreme Center; Right: the Mysterious Elder, the Most High.\nThe Lord Emperor of the Most High, the Heavenly Emperor, the Venerable Lord.\n\nFifth: Dragon and Tiger in Motion\nLeft: the Supreme Center; Right: the Mysterious Elder, the Most High.\nThe Nine Elders of the Most High, the Lords of the Immortal Capital, the Nine *Qi* Venerable Lords, and the like.\n\nSixth: Dragon and Tiger in Flux\nTake the Upper Primordial: Left, the Supreme Center; Right, the Mysterious Elder, the Most High.\nTake the Upper Primordial: the Most High, the myriad layers of the Dao’s *qi*, the twelve hundred Lords Official.\n\nSeventh: Dragon and Tiger in Expansion\nTake the Upper Primordial: Left, the Supreme Center; Right, the Mysterious Elder, the Most High.\nTake the Upper Primordial: the Most High, the Lord of the Supreme Clarity of the Dao, the Venerable Lord of the Supreme Clarity beneath the Jade Steps.\n\nEighth: Bowing to the Perfected\nTake the Upper Primordial: Left, the Supreme; Center, the Mysterious Elder, the Most High.\nTake the Upper Primordial: the Most High, the Heavenly Master, the Lineage Master, the Master of the System, the Female Master.\n\nFor the Unbinding of the Middle Primordial’s Twenty-Four *Qi*, all declare:\n“Now there is such-and-such a name who entreats for deliverance, that we may together practice the Dao and its virtue, entreating the *yin* and *yang* *qi* of life to be born within this disciple’s body, resolving the Three Officials’ investigations, undoing the net of entanglements, striking the register of death, inscribing the name in the Jade Record of Longevity, transcending the nine calamities, and making this disciple a seed-person of future generations.” All is complete.\n\nUnbinding Knots and Taking Nourishment\nThe master unbinds the knots of the disciple’s sash and loosens the hair; the one making the declaration also unbinds the knots of the worthy one.\n\nThe Fourteenth: Method of Ingesting Life and Expelling Death\nMen to the left, women to the right. Hands interlaced, both facing the direction of the king, legs extended in seated posture. With the nose, gently draw in the *qi* of life, lower the head and swallow it. Lie down with eyes closed, and with the mouth gently expel the *qi* of death. Three times lying down, three times sitting—stop.\n\nThe Nine Palaces\nThe Fifteenth: Method of Arranging the Nine Palaces\n\nAt the head, *wu*, where Heaven and Earth meet: horizontal lines form *yi*, vertical lines form *jia*.\n\nFirst: *Zi* Nine\n*Yang* proceeds to the Lower Primordial’s four; *yin* proceeds to five. Together call: *Zi* Nine.\n\nSecond: *Wu* Nine\n*Yang* proceeds to the Upper Primordial’s four; *yin* proceeds to five. Together call: *Wu* Nine.\n\nThird: *Mao* Nine\n*Yang*: with the left hand, cover the four fingers horizontally, concealing the *yin*; the right hand’s five fingers above. Combined as nine, placed in the eastern direction. Together declare: *Mao* Nine.\n\nFourth: *You* Nine\n*Yin*: left hand upturned with five fingers extended; *yang*: right hand covering with four fingers, horizontally over the *yin* fingers. Placed in the western direction. Together declare: *You* Nine.\n\nFifth: Central Nine\nHeaven covers, Earth bears. *Yang* contemplates the four viscera: liver, heart, lungs, spleen; *yin* contemplates the five viscera: liver, heart, spleen, lungs, kidneys. Combined as nine, together declare: the Central Five-Nine Position is complete.\n\nTogether declare: \"Water flows to its end.\" Divide eight to *chou*. *Yang* uses the second toe of the left foot; *yin* uses the five toes of the right foot. Further, with the right hand’s one finger beside the foot, the *yang* finger covers the *yin* toes to make eight. Place at *chou*, together declare: *Gen* Eight Returns, becomes *Kan* One. *Yin* and *yang* together declare *Kan* One.\n\nNext command: \"Wood falls to return to its root.\" Divide six to *hai*. Pure *yang*: right foot and hand each combine three to make six, covering the *yin* left foot. Place at *hai*, declare *Qian* Six Returns, becomes *Zhen* Three. *Yang* uses the left hand’s one finger to horizontally cover the *yin* right hand’s two fingers. Place together at *mao*, aligning with the waist, declare *Zhen* Three.\n\nNext command: \"Metal is firm, fire is strong.\" Divide two to *wei*. Pure *yin*. *Yang* extends the left hand’s two fingers to horizontally cover *yin*’s hand. Place at the southwest, aligning with the shoulder, declare *Kun* Two Returns to become *Dui* Seven *yin*. Extend the left hand’s four *yang* fingers, with the right hand’s three fingers horizontally covering *yin*. Place above the fingers at the west, aligning with the waist, declare *Dui* Seven.\n\nNext command: \"Earth reaches the four seasons.\" Divide four to the four kings of *si* *yang*. With the left hand’s three *yin* fingers horizontal, the right hand’s one finger placed at the southeast, aligning with the shoulder, declare *Xun* Four Returns. Contemplate the five viscera of the Central Palace: *yang* contemplates the kidneys and liver; *yin* contemplates the heart, lungs, and spleen. Each silently declares the Central Official Five. Further command: \"Fire is strong, flames rise.\" Abide in one’s own domain, without dividing positions to complete.\n\nNext command: \"Two and four are the shoulders’ *yang*.\" With the hands together, direct to the *yin* left eyebrow as two, and to the right eyebrow as four. Next command: \"Six and eight are the feet’s *yang*.\" With the right foot direct to *yin*’s left foot as six *yang*; with the left foot direct to *yin*’s right foot as eight. Next command: \"Left three, right seven.\" *Yang* with the left hand, *yin* with the right hand, together direct to *yin*’s left waist as three. *Yang* with the right hand, *yin* with the left hand, together direct to *yin*’s right waist as seven.\n\nNext command: \"Wear nine, cover one.\" *Yang* takes the Upper Primordial’s three; *yin* takes the Upper Primordial’s six. The Lower Primordial’s *yin* and *yang* each take half of one. Further command: \"Five resides in the Central Palace, governing the solidity of the abdomen.\" Together contemplate the five viscera: *yang* the kidneys and liver; *yin* the heart, spleen, and lungs. With the heart mutually harmonize. The Five-Nine Palace positions are complete.\n\nEach declares *Xun*, calls the Gate of Heaven. From *Qian* obtain one, then proceed five. Each declares *Qian* Five, retreat and report five. Proceed another five, each declares *Central Retreat*. Proceed another five, each declares *Xun* Five, retreat and report five. Further declare *Gen* Eight. Raise high and disperse three from *Kun*, then proceed five. Each declares *Gen* Five, retreat and report. Proceed another five, each declares *Kun* Five, retreat and report. Further declare: \"Thunder shakes the marsh.\" From *Dui* obtain two, then proceed five. Each declares *Dui* Five, retreat and report. Proceed another five, each declares *Zhen* Five, retreat and report. Further declare: \"*Kan* does not stand alone.\" From *Li* take four, then proceed five. Each declares *Li* Five, retreat and report. Proceed another five, each declares *Kan* Five, retreat and report. Further declare: \"Three and five crisscross, equal and as one.\"\n\nForty-five *qi* complete. Measure *jia*’s head at the east *mao*; measure *yi*’s head at the south *wu*, lying down.\n\n---\n\nSixteenth: Treading the Ji\n\nFirst: *Yang* Treads the Ji\nBelow *yin*, lie on the left side outside *yi*. Raise the right hand’s second fingernail. With the left hand’s second and third fingers interlaced in the middle, hold *yi*’s finger. Lift the left foot forward, the right foot horizontally behind. Then lift the left foot three times, rubbing *yi*’s heart, and recite the incantation: \"Central *wu ji*, lords and officials of the hundred joints; lords and officials of the four seasons, eight nodes, and twelve hundred offices, assist your minister in passing beneath the Three Bridges.\" Then lift the left foot from *yi*’s heart, tread *yi*, proceed right to the south, rotate west, turn north, to *yi*’s right flank, eleven steps.\n\nFirst: *Yin* Treads the Ji\nBelow *yang*, lie on the right side outside *jia*. Raise the left hand’s second fingernail from *yi*. With the right hand’s second and third fingers interlaced in the middle, hold the *yang* finger. Lift the right foot forward, the left foot horizontally behind. Then lift the right foot three times, rubbing *jia*’s heart, and recite the incantation: \"Central *wu ji*, lords and officials of the hundred joints; lords and officials of the four seasons, eight nodes, and twelve hundred offices, assist your handmaiden in passing beneath the Three Bridges.\" Then lift the right foot from *jia*’s heart, tread *jia*, proceed left to the east, rotate north, turn west, to *jia*’s left flank, eleven steps.\n\nSecond: Disperse Steps to Return to *Shen*\nAgain interlace *yi*’s finger. Lift the left foot forward, the right foot horizontally behind. Then lift the left foot three times, rubbing *yi*’s heart, incantation as before.\n\nSecond: Disperse Steps to Return to *Yin*\nAgain interlace *jia*’s finger. Lift the right foot forward, the left foot horizontally behind. Then lift the right foot three times, rubbing *jia*’s heart, incantation as before.\n\nThird: Disperse Steps to Return to *Shen*\nAgain interlace *yi*’s finger. Lift the left foot forward, the right foot horizontally behind. Then lift the left foot three times, rubbing *yi*’s heart, incantation as before. *Yang* proceeds, circling three rounds, returns to *yin*. Lie on the left, *yang* rises, grasping the *Kui*. Ascend three *qi*, take three Primordials, swallow three times, complete.\n\nThird: Disperse Steps to Return to *Yin*\nAgain interlace *jia*’s finger. Lift the right foot forward, the left foot horizontally behind. Then lift the right foot three times, rubbing *jia*’s heart, incantation as before. *Yin* proceeds, circling three rounds, returns to *yang*. Lie on the right, *yang* rises, grasping the *Kui*. Ascend three *qi*, take three Primordials, swallow three times, complete.\n\n*Jia* then rises. With the right hand support *Kunlun*; with the left hand rub the *Niwan*. Rotate left three times, then bring the face down from the left side to the *Niwan*, declaring: \"Left, the Supreme Three, take the Upper Primordial.\" Then tread to the right side, report three times. Again with the left hand support *Kunlun*; with the right hand rub the *Niwan*. Rotate right three times, then bring the face down from the right side to the *Niwan*, declaring: \"Right, the Mysterious Elder Three, take the Upper Primordial.\" Return to the left side, report three times. Again with the right hand support *Kunlun*; with the left hand rub the *Niwan*. First rotate left, then right, then left again, completing three rounds. Bring the face straight down to the *Mingmen*, declaring: \"Supreme Three, take the Three Primordials.\" Then tread to the right side, report three times, then return to the left.\n\nWith the right hand support *Kunlun*; with the left hand rub the left Central Primordial below the left breast. Rotate left three times, bring straight down to the *Niwan*, declaring: \"Left, the Supreme.\" Tread to the right, report three times. With the left hand support *Kunlun*; with the right hand rub the right Central Primordial below the right breast. Rotate right three times, bring straight down to the *Niwan*, declaring: \"Right, the Mysterious Elder, return to the left,\" report three times.\n\nWith the right hand support *Kunlun*; with the left hand rub the *Niwan*. Rotate left, then right, then left again, completing three rounds. Bring the face straight down to the *Mingmen*, declaring: \"Supreme.\" Tread to the right, report three times, then return to the left. With the right hand support *Kunlun*; with the left hand rub the left side of the *Dantian* below the navel. Rotate left three times, bring straight down to the *Mingmen*, declaring: \"Left, the Supreme.\" Tread to the right, report three times.\n\nWith the left hand support *Kunlun*; with the right hand rub the right side of the *Dantian*. Rotate right three times, bring straight down to the *Mingmen*, declaring: \"Right, the Mysterious Elder, return to the left,\" report three times. With the right hand support *Kunlun*; with the left hand rub the *Jianggong*. First rotate left, then right, then left again, completing three rounds. Bring straight down to the *Dantian*, rotate left and right three times downward to the *Mingmen*, declaring: \"Supreme.\" Tread to the right, report three times.\n\nVisualize the Three Qi and return to the left. Lie supine and visualize the spirits: the left, the Qi of the Supreme, true blue-green; the right, the Qi of the Mysterious Elder, true yellow; the center, the Qi of the Supreme, true white, piercing through your body, the Six Jia, the five viscera, and the branches and stems. Left above, right below, encircling the entire body, returning to govern within your lower Dantian, ascending to Kunlun Mountain.\n\nVisualize the One Palace: the Great Clarity’s Primordial Blue-Green Qi, left above and right below, encircling one palace; the Great Simplicity’s White Qi, left above and right below, encircling one palace; the Great Beginning’s Red Qi, left above and right below, encircling one palace; the Great Origin’s Yellow Qi, left above and right below, encircling one palace. The liver’s Qi, true blue-green, left above and right below, encircling one palace; the lungs’ Qi, true white, left above and right below, encircling one palace; the heart’s Qi, true red, left above and right below, encircling one palace; the spleen’s Qi, true yellow, left above and right below, encircling one palace; the kidneys’ Qi, true black, left above and right below, encircling one palace. Each of these palaces is the lower Dantian, wherein the True Person, the Lord, governs. Visualize all the Qi encircling each palace in three layers.\n\nYin: right above, left below—proceed as above.\n\nSelf-Guiding:\nVisualize the Qi and spirits to completion. Then, with the hands, guide yourself: with the left hand, trace from the left breast to the foot, declaring \"Left, the Supreme\" three times and stop. With the right hand, trace from the right breast to the foot, declaring \"Right, the Mysterious Elder\" three times and stop. Next, with the left hand, trace from the forehead straight downward to the Dantian, the Supreme; the right hand follows. Do this three times, three declarations, then rise upon the *Kui* star, refusing the Three and Five Dragons’ ascent. Again, with the right hand, rub the lower Dantian three times, approach the Gate of Life, open the Golden Gate with the right hand, and insert the Jade Key with the left, placing it upon the Gate of Life. With the left hand supporting Kunlun, and the right hand rubbing the Mingmen horizontally and vertically, declare three times: \"Water flows east, clouds return west; yin nurtures yang’s Qi, subtly, subtly, essence and fluid flourish.\" Ascend to the Master’s Gate. Then, exhale upon the divine male holding the pass, or the divine female opening the door, to harmonize Qi with yin. With Qi, recite the *Yi* incantation: \"Yin and yang bestow transformation; the myriad things flourish. Heaven covers, earth bears—may Qi be bestowed upon my body.\"\n\nIncantation of Jia and Yi:\nSeventeenth Jia incantation: \"I desire to ride the celestial net and enter earth’s records, the four seasons and five phases, each abiding by their True Person, unshaken. Hold the records and the Five Qi; let the mysterious and the yellow return to my five viscera, naturally generating light.\"\nYi incantation: \"I desire to lie upon earth and uphold heaven, uniting yin and yang, the four seasons and five phases, each abiding by their True Person, unshaken. Hold the records and the Five Qi; let the mysterious and the yellow return to my five viscera, naturally generating light.\"\nWith the left hand supporting the Dao Father, recite the incantation: \"One Lord before me, two Lords behind me, weaving and removing calamities, adversities, and all misfortunes, causing them all to vanish.\" Direct left three times, declaring \"Left, the Supreme\"; direct right three times, declaring \"Right, the Mysterious Elder\"; direct upward three times, declaring \"Center, the Supreme.\" Declare: \"Your servant, so-and-so Jia, humbly seeks passage and transcendence, together upholding the Dao and virtue, beseeching longevity and enduring vision, to become one of the seed people.\" Direct the center three times, declaring: \"Left, the Supreme; right, the Mysterious Elder; the Supreme’s Three Qi together generate your servant’s body, merging into one, named Peach Health, dwelling at the Northern Culmen, called the Cinnabar Child. Clothed in five colors, wearing a great red cap, upon a golden bed and jade couch, with five-colored railings, a canopy of pearls and jade, directly aligned with the Mingmen. Divine males and jade maidens attend on either side. Yang Qi revolves left, yin Qi spirals right, ascending to the Great Clarity, descending to the lowest depths, constantly roaming among the Nine Palaces, the five viscera, and the six bowels. Leading and recording the host of spirits, calling names by the register, they must not flee. Long abide within my body, ascending with me as immortals.\" Inhale the Qi of life through the nose three times, swallow the yang seven, nine, and eleven times. Declare: \"The Dao of heaven proceeds.\" Declare: \"The Dao of earth proceeds.\" Then enter the Gate of Life, half your head within. Again recite: \"Willow Lord, Nü Lord, the myriad spirits live. I desire to shake heaven and move earth; let the Five Lords each attend carefully.\" Yi incantation: \"Willow Lord, Nü Lord, Dantian Palace, I desire to move earth and shake heaven; let the five spirits within my body each firmly advance to the abyss’s depths.\" Close the mouth, inhale the Qi of life through the nose, exhale through the mouth, click the teeth three times, declaring: \"Nine and one are born within.\" Slightly retreat, half a head’s distance. Jia first proceeds, beginning the Qi of life.\n\nStems and Branches Count:\nIn the Jiazi cycle, heaven first generates Bingyin, earth first generates Renshen.\nIn the Jiaxu cycle, heaven first generates Bingzi, earth first generates Renwu.\nIn the Jiashen cycle, heaven first generates Bingxu, earth first generates Renchen.\nIn the Jiawu cycle, heaven first generates Bingshen, earth first generates Renyin.\nIn the Jiachen cycle, heaven first generates Bingwu, earth first generates Renzi.\nIn the Jiayin cycle, heaven first generates Bingchen, earth first generates Renxu.\nNext, proceed with three, five, seven, nine, then retreat and report; proceed with two, four, six, eight, then retreat and report; proceed with the Five Qi, then retreat and report, swallowing six times.\n\nProceed with Yi first to initiate the beginning of generation. Next, advance with two, four, six, eight, then retreat and report; proceed with three, five, seven, nine, then retreat and report; proceed with the Three Qi, then retreat and report, drawing in the Upper Primordial Qi three times by swallowing.\n\nStep upon the cyclical marker below, refusing the inverted descent of the Three-Five Dragons. For the first Yin step upon the cyclical marker below the Yang on the right side: lie facing Yang, wearing the Yang upon the head. Raise the Yin with the second finger of the left hand, cross the fingers of the right hand between the second and third fingers to hold the Yang finger, lift the right foot forward, place the left foot horizontally behind, then lift the right foot three times to stroke the heart of Jia while reciting the incantation: *\"Central Yellow Wu-Ji, Lords of the Hundred Nodes, Lords of the Four Seasons and Eight Nodes, One Thousand Two Hundred Officials—assist your servant in crossing beneath the Three Bridges.\"* Then lift the right foot, traverse from the heart of Jia to Jia, turn left to the east, rotate northward, and circle westward to the right flank of Jia, marking eleven traces.\n\nFor the first Yang step upon the cyclical marker below the Yin on the left side: lie externally facing Yin, wearing the Yin upon the head. Raise the Yang with the second finger of the right hand, cross the fingers of the left hand between the second and third fingers to hold the Yin finger, lift the left foot forward, place the right foot horizontally behind, then lift the left foot three times to stroke the heart of Yi while reciting the incantation: *\"Central Yellow Wu-Ji, Lords of the Hundred Nodes, Lords of the Four Seasons and Eight Nodes, One Thousand Two Hundred Officials—assist your ministers in crossing beneath the Three Bridges.\"* Then lift the left foot, traverse from the heart of Yi to Yi, turn left to the south, rotate westward, and circle northward to the left flank of Yi, marking eleven traces.\n\nFor the second dispersal step returning to Yin, cross the fingers over Jia’s finger, lift the right foot forward, place the left foot horizontally behind, then lift the right foot three times to stroke the heart of Jia while reciting the incantation, tracing as in the first instance. For the second dispersal step returning to Shen, cross the fingers over Yi’s finger, lift the left foot forward, place the right foot horizontally behind, then lift the left foot three times to stroke the heart of Yi while reciting the incantation, tracing as in the first instance. For the third dispersal step returning to Yin, repeat entirely as before. For the third dispersal step returning to Shen, repeat entirely as before.\n\nPassing to the right of the Yang, circle the market three times, then circle the market three times. Returning to Yang from Yin, lie facing Yang to rise, ride the *Kui* upward to conduct the Three Qi, drawing in the Upper Primordial Qi three times by swallowing, then conclude.\n\nPassing to the right of the Yin, circle the perimeter three times, then circle the perimeter three times. Returning to Yin from Yang, lie externally facing Yang to rise, ride the *Kui* upward to conduct the Three Qi, drawing in the Upper Primordial Qi three times by swallowing, then conclude.\n\nFor the first Yang step upon the cyclical marker below the Yin on the right side, lie externally facing Yin with the Yin worn upon the head. Raise the Yang with the second finger of the right hand, cross the fingers of the left hand between the second and third fingers to hold the Yin finger, lift the left foot forward, place the right foot horizontally behind, then lift the left foot three times to stroke the heart of Yi while reciting the incantation: *\"The Central Womb Perfected Person, three inches and two fen in length, fills the Crimson Palace of Yi, governing the Three Myriads and Six Thousand Spirits of the Life Officials to eternally guard the body of Yi, ascending with Yi as immortals.\"* Then lift the left foot, traverse from the heart of Yi to the right, proceed southward, rotate westward, and circle northward to the left flank of Yi, marking eleven traces.\n\nFor the first Yin step upon the cyclical marker below the Yang on the right side, lie facing Yang with the Yang worn upon the head. Raise the Yin with the second finger of the left hand, cross the fingers of the right hand between the second and third fingers to hold the Yang finger, lift the right foot forward, place the left foot horizontally behind, then lift the right foot three times to stroke the heart of Jia while reciting the incantation: *\"The Central Womb Perfected Person, three inches and two fen in length, fills the Blade Palace of Jia, governing the Three Myriads and Six Thousand Spirits of the Life Officials to eternally guard the body of Jia, ascending with Jia as immortals.\"* Then lift the right foot, traverse from the heart of Jia to the left, proceed eastward, rotate northward, and circle westward to the right flank of Jia, marking eleven traces.\n\nFor the second dispersal step returning to Yin, cross the fingers over Jia’s finger again, lift the right foot forward, place the left foot horizontally behind, then lift the right foot three times to stroke the heart of Jia while reciting the incantation, tracing as in the first instance. For the second dispersal step returning to the center, cross the fingers over Yi’s finger again, lift the left foot forward, place the right foot horizontally behind, then lift the left foot three times to stroke the heart of Yi while reciting the incantation, tracing as in the first instance. For the third, repeat entirely as in the second.\n\nPassing to the right of the Yin, circle the perimeter three times. Returning to Yin from Yang, lie facing Yang to rise, ride the *Kui* upward to conduct the Three Qi, drawing in the Upper Primordial Qi three times by swallowing, then conclude. Passing to the right of the Yang, circle the market three times. Returning to Yang from Yin, lie facing Yang to rise, ride the *Kui* upward to conduct the Three Qi, drawing in the Upper Primordial Qi three times by swallowing, then conclude.\n\nThe discourse on the Dao of Heaven for Jia is complete; the discourse on the Dao of Earth for Yi is complete. Strike the teeth three times each and recite the incantation: *\"Three and Five form the sun and moon, emerging from the profound and entering the obscure—true qi, entering the correct qi, communicating with the spirit qi, spreading the Dao qi. May all malevolent ghosts and thieves be annihilated. Those who gaze upon me shall be blinded; those who listen to me shall be deafened. Whoever dares to plot against me shall suffer the consequences in return.\"* Then cease with twenty-four breaths, retreat slightly, and recite the incantation of the Supreme Beginning Lord: *\"One Lord before me, two Lords behind me, breaking and dispelling disasters, calamities, and all adversities within the Great Yin.\"* Retreat further to invoke the Supreme Simplicity, then the Supreme Beginning Lord. Exit through the Vermilion Gate, then invert the Dragon to descend on the right side of Yin. With the left hand, support the Kunlun; with the right hand, stroke the Central Primordial. Recite thrice: *\"Left, the Utmost Above; right, the Mysterious Elder Supreme.\"* Draw in the Upper Primordial Qi three times, then stroke the Lower Primordial while reciting: *\"Water flows to its end, wood falls to its root, metal is unyielding, fire is fierce, earth reigns over the four seasons.\"* Then traverse and return to the left. Compose the body and lie flat, crossing the hands over the Great Clarity. Strike the teeth twelve times, then with three, five, seven, nine, swallow the subtle qi through the nose, completing the twenty-four breaths of three, five, seven, and nine.\n\n**Returning the Spirits**\nEighteenth: Visualize the return of all Yin and Yang spirits. Cross both hands over the forehead, imagining the dissolution of the qi. The Utmost Qi, correct and azure, returns to the left kidney of your servants and ministers.\n\nThe Three Mysterious Elder Qi, correct and yellow, returns to the spleen of your servants and ministers. The Second Supreme Qi, correct and white, returns to the right kidney of your servants and ministers. The Five Spleen Qi, correct and yellow, right above and left below, returns to the spleen of your servant. The Four Kidney Qi, correct and black, right above and left below, returns to the kidney of your servant. The Yin Official, left above and right below, the Seven Lung Qi, correct and white, right above and left below, returns to the lung of your servant. The Six Heart Qi, correct and red, right above and left below, returns to the heart of your servant. The Nine Supreme Beginning Qi, correct and yellow, right above and left below, returns to govern the Jade Hall Palace. The Eight Liver Qi, correct and azure, right above and left below, returns to the liver of your servant. The Ten Supreme Primordial Qi, correct and white, right above and left below, returns to govern the Longevity Palace. The Supreme Beginning Qi, correct and red, right above and left below, returns to govern the Crimson Palace. The Supreme Clarity Mysterious Primordial Qi, right above and left below, returns to the left kidney of your servants and ministers. The Supreme Clarity Qi, correct and azure, right above and left below, returns to govern the Establishing Loftiness Palace. The Supreme Primordial White Qi, right above and left below, returns to the right kidney of your servant.\n\nThe lung is the Canopy Palace, the heart is the Crimson Palace, the liver is the Purple Tenuity Palace, the gallbladder is the Longevity Palace, the spleen is the Hall of Light Palace, the stomach is the Grand Granary Palace, the kidneys are the Twin Envoys. The Five Cities and Twelve Towers, ever accompanying the Red Child, each returns to my palace chambers.\n\n**Royal Qi**\nNineteenth: Rub both hands together until warm, then massage the face and body. In spring, visualize the liver as the Purple Tenuity Palace, its color azure, moist and radiant. Azure qi emerges from the nose, large as a nine-inch mirror, gradually expanding to cover the face, the entire body suffused with azure. In summer, visualize the heart as the Crimson Palace, its color red, moist and radiant. Red qi emerges from the nose, large as an eight-inch mirror, gradually expanding to cover the face, the entire body suffused with red. In autumn, visualize the lung as the Canopy Palace, its color white, moist and radiant. White qi emerges from the nose, large as a six-inch mirror, gradually expanding to cover the face, the entire body suffused with white. In winter, visualize the kidneys as the Twin Envoys, their color black, moist and radiant. Black qi emerges from the nose, large as a five-inch mirror, gradually expanding to cover the face, the entire body suffused with black. During the four seasons when earth reigns, visualize the spleen as the Yellow Court Palace, its color yellow, moist and radiant. Yellow qi emerges from the nose, large as a three-inch mirror, gradually expanding to cover the face, the entire body suffused with yellow.\n\nThen, with the right hand, massage between the breasts, then move the hand downward three times to massage the left and right sides of the cinnabar field, then further downward. Massage below the navel without fixed count. Cross the hands over the head, draw in qi from above, guiding it upward from both feet along the two meridians to the Pass of Origin, then along the three paths of the spine. Yin: right azure, left white, center yellow. Yang: left azure, right white, center yellow. Directly enter the Mud Pill Palace, then reverse the flow. Draw the qi downward: Yin: left azure, right white, center yellow. Yang: right azure, left white, center yellow. From the root of the hair and forehead, along the brows and face, descend through the mouth, nose, and throat, passing through the five viscera down to the feet and ten toes, then return upward as before. Perform three ascents and three descents, returning to store the qi in the lower cinnabar field.\n\n**Infant’s Return**\nTwentieth: The infant returns. Yang: bend the left foot beneath the right foot, grasp the left big toe with the right hand and pull. Then turn to the right. Yin: bend the right foot beneath the left foot, grasp the right big toe with the left hand and pull. Then turn to the right, returning to the original position with feet apart.\n\nYang: first place the right foot against Yin, the left foot against Yin. Then place the right foot against Yang, the left foot against Yang. Again, place the right foot against Yin, the left foot against Yin. Then place the right foot against Yang, the left foot against Yang. With each movement, recite: *\"Left, the Utmost Supreme; right, the Mysterious Elder Supreme.\"* Perform three cycles of advance and return, then stop.\n\n**Severing Death**\nYang: Assume the crane-knee posture. With both hands, stroke from the forehead upward to the feet, then grasp the big toes while seated. Stroke both knees once—this is called \"severing the path of death.\"\n\nYin: Face the origin of the Primordial Yang. With both hands, gather from the cinnabar field through the Gate of Life, returning to the Jade Father. Press the thumbs and the base of the palms against the face, raise the hands high above the head, then gaze downward toward the Jade Chamber. Lie on the back, slightly raise the head, and gaze toward the origin of the Primordial Yang soaring in the heavens. Soar in the heavens, tread upon the earth, then descend like a butterfly’s wings.\n\nYang: Press both hands against the yellow earth—this is called \"treading upon the earth.\" Rise from the long kneel, raise the hands high above the head—this is called \"soaring in the heavens.\" Then lower the hands behind—this is called \"descending like a butterfly’s wings.\"\n\nYang: Cross the left hand over Yin, while the right hand performs the Dragon’s Inversion three times, passing over the head. Men turn left, women turn right, then return to face each other.\n\nNext, traverse the Earthly Net as before. First recite: *\"Left, the Utmost Supreme,\"* then: *\"Right, the Mysterious Elder,\"* and finally: *\"Supreme.\"* *\"Compassionate Father, Holy Mother, unbind the nets and snares, remove my name from the register of death, inscribe it in the record of life.\"* Next, release the nets again. First: *\"Left, the Utmost Supreme,\"* then: *\"Right, the Mysterious Elder,\"* and finally: *\"Supreme.\"*\n\n*\"He who gave me life is Jiazi, Royal Wencheng. My master-father is Kang. He who nurtured me is Jiawu, Minister Wei. My master-mother is Niu. He who gave me life and sustained me serves the Great Dao, alongside my parents.\"*\n\n**Treading the Hours**\nTread the twelve hours, crossing Yang. Place the left foot on Yin, the right foot in the center. Recite: *\"Jia-Yin, Dao Father, may you, as your servant, dispel the disasters of the four directions.\"* Place the right foot on Shen, the left foot in the center. Recite: *\"Jia-Shen, Dao Mother, may you, as your servant, disperse the calamities of the four directions.\"* Yang next treads Mao, Yin next treads Wei, reciting as before. Alternate Zi and Hai, completing a cycle with Yin and Shen. With each cycle, recite: *\"He who gave me life is my master-father Kang; she who nurtured me is my master-mother Niu. He who gave me life and sustained me serves the Great Dao, alongside my parents.\"* Perform three cycles, then stop.\n\n**Thanksgiving for Life**\n\nNext, give thanks for life, facing the *yin* direction toward *Mao*. Recite: *\"Jia-Yin, Dao Father, the Ten Masters declare: Before you stands a man/woman born as [personal name], who through your servant [disciple’s name] begs for passage and transcendence.\"* The disciple recites: *\"Your servant, through Master [name], begs for mutual passage and transcendence.\"* Together, we uphold the Dao and its virtue, receiving grace as wished, each spared from harm—grateful to the Dao Father. *\"May the Ten Masters, as your servant, dispel the disasters of the four directions.\"* Bow twice. Next, for *Yi-Mao*, recite the Dao Father’s covenant, cycling through the twelve hours as with *Yin*.\n\n**Declaring Merit**\n\nNext, declare merit, all facing east with hands clasped, kneeling upright. Sound the drum twelve times.\n\n*\"Your servant humbly petitions the Merit-Recording Couriers, the Yin-Yang Deities of Merit, the Generals and Officers of the Qi of Life, the True Persons of the Central Womb, the Crimson and White Generals and Officers, the Yellow-Writ Covenant Generals and Officers of the Abdominal Eyes, the True Officials of this domain who infuse qi, the Overseers and Examiners who summon all officials, generals, and officers—those under the Three Masters: the Celestial Master, the Lineage Master, and the Female Master—alongside the Generals and Officers of the Qi of Life, the Generals and Officers of the Dao of Passage through Yin and Yang, the Nine Qi Venerable who commands summons, the Generals and Officers of the Three Officials of Heaven, Earth, and Water who examine and summon, and the Generals and Officers who dispel disasters, disperse calamities, and resolve adversities.*\n\n*With trepidation, your servant [name] declares: Though dull-witted, I delight in the Dao and cherish life. As my master instructed, I now petition on behalf of [prefecture, county, village, and personal name], a man/woman who, through your servant, begs for passage and transcendence. Your servant, through Master [name], likewise begs for mutual passage and transcendence. In strict accordance with the master’s teachings, together with [name], we uphold the Dao and its virtue, embracing the transformations of Three, Five, Seven, and Nine, the bestowals of Yin and Yang, and the mutual passage of man and woman. By grace, our wishes are fulfilled, our spirits steadfast and whole, both containing life within, each spared from harm.*\n\n*We reverently summon the Yin-Yang Merit-Recording Couriers and the Generals, Officers, and soldiers of the Qi of Life to ascend to the Three Celestial Bureaus, where the central offices shall record and transmit our merits, distinguishing and conveying them as per the ancient rites of the Celestial Bureaus, ensuring no intent is lost. Thus, our toils are proclaimed, and our merit duly received. May all return to their duties, safeguarding as before. We pray that your servants may enjoy long life and enduring vision, transcend disasters and adversities, have our names stricken from the ledgers of death, and be inscribed in the Jade Register of life, becoming exemplars among future generations as proof of this covenant.\"*\n\n*[Personal name] and [disciple’s name], with utmost reverence and awe, kowtow twice in submission.\"*\n\n*[Lineage affiliation to be recited]*\n*[Celestial clarity to be recited]*\n\nThe Year-Star [recited as appropriate]. Next, the officiating officer declares: \"We, your servants, dispatch the contract decrees to all the officials, the Six Jia spirits, and the various deities, commanding them to perform their Way-affairs for the day and return to the Central Palace, whereupon we knock the teeth thrice and swallow the qi. We now offer incense thrice in accordance with the ritual, focusing our intent to petition the master, requesting that those born under the Jia among men and women be allowed to seek passage and transcendence through us. The disciples state: 'We, your servants, beseech Master So-and-so to grant us mutual passage and transcendence.' Together, we uphold the Dao and its virtue, harmonizing the Three Qi, and pray for immortality and freedom from death. May this merit and power flow back to us, your servants—returning to the body upon the body’s end, to the spirit upon the spirit’s end, and to the life upon the life’s end, merging with the Great Dao.\"\n\n\"We, your servants, prostrate ourselves body and head to the earth, surrendering to the Three Honored Ones. May this merit and power flow back to us, your servants, so that in this body we may study the Dao and attain the Dao, seek immortality and achieve immortality, reverse aging and restore youth, enjoy boundless longevity, ascend into the formless, and unite with the Dao.\"\n\n[Recite the incantation of the time of tranquility:]\n\"One Lord stands before me,\nTwo Lords stand behind me.\nThey break and dispel the disasters of the four directions for me,\nSubduing all adversities.\nWith both hands, we break through and exit the door.\"\n\n[Declare the merit accomplished.]\n\nThe officiating officer respectfully states in accordance with the document: \"We, your servants, though dull-witted and beset by the Six Obstructions, delight in the safeguarding of long life. We reverently uphold the essential words of the true scriptures and adhere to the great methods of the Yellow Writ Contract Decrees. We are duty-bound to practice them faithfully. Here, in such-and-such commandery, county, village, and hamlet, a man or woman named So-and-so, aged such-and-such years, who delights in the Dao and rejoices in immortality, has come before us on this day and hour to seek passage and transcendence, upholding the Dao and its virtue, harmonizing the qi of Three, Five, Seven, Nine, Two, Four, Six, Eight, and the Three Threes. By grace, their wishes are fulfilled, their spirits steadfast and secure, each free from harm. In accordance with the master’s teachings, we submit a memorial, praying that the officials of the Three Offices within our bodies be summoned to examine and convene; that the Yellow Writ Contract Decree Generals of the Abdominal Eyes, the Generals of the Central Yellow Wu-Ji and the Hundred Nodes, the True One Generals, the Generals of Supreme Harmony, the Celestial, Terrestrial, and Human Standards, the Three Pennants and Established Standards, the Four Seasons and Eight Nodes, the Five Agents in harmony, the Three and Five Merit Officers and the Generals of the Dipper’s Handle, the Central Womb Realized Ones and the Generals of Red and White Surge and White Discharge, the Generals of the Nine Qi Venerable One and the Summoning Officers—all those who serve in such-and-such commandery, county, village, and hamlet, and all the qi-officials and generals—be recorded for three hundred merits; that the generals and officers be credited with two hundred merits; and that the soldiers be recorded for fifty merits. May they ascend to the Central Palace and the Second Palace to receive, record, and register their duties, their ranks increased accordingly, their regular allotments augmented, and none left resentful.\"\n\n\"We, your servants, have a thousand transgressions and ten thousand faults, all of which we pray may be pardoned. May the qi of life of yin and yang flow freely within us and within So-and-so, harmonizing the five viscera and six bowels, the twelve palaces, strengthening sinews and bones, moistening countenance and complexion. May we traverse the world unhindered, our undertakings accomplished under heaven and earth. We beseech that we may become seed-people for future generations, that evil and rebellion be eradicated, and that all slander, legal writs, and adversities be subdued as proof of this covenant.\"\n\n\"With compassion, O Merciful Father and Holy Mother, we humbly seek passage and transcendence, repenting of our transgressions and declaring our merits. We submit this central memorial, which ascends to the Three Celestial Bureaus of the Upper Heavens.\"\n\nThe Rite of Passage by the Yellow Writ of the Highest Clarity is thus concluded.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清黄书过度仪 经名：上清黄书过度仪。 撰人不详，约出於南北朝。 系早期天师道房中修炼仪式。 一卷。 底本出处：《正统道藏》正一部。 上清黄书过度仪 夫弟子在师治受道，不得过二十不过度，二十外受道，即过度当沐浴禁诫需香也，入靖又先启师然后行事，出入皆拜靖乃谢。 入靖 第一入靖，阳立寅上，阴立申上，求过者长跪，言某以肉人千载有幸，得染道化，求法经时，未蒙过度，稽首归依，乞丐生活，便再拜。 师答言今日吉，合当为桥梁。 求者重言，愿蒙成就。 答曰，当为启白，弟子伏惟受恩，复再拜师，便执手引之东向。 存吏兵 第二俱东向正立，阳左阴右，两手相持，叉手立阳，以第二指贯阴，第二三指中间各呜鼓十二通，各思所佩箓上功曹使者，将军吏兵，冠显衣服，罗列行伍，卫臣妾前后左右，当为臣妾致四方生气消灾散祸，随事分别关启，皆使分明了然。 如此一过止。 思白气 第三各思丹田白气，大如六寸面镜，出在两眉中问，渐大光明照耀之头上，下灌身雨体，彻见五藏六府，九宫十二室，四支五体，关节筋脉，孔窍营卫，表裹一切，莫不朗然。 如此一过止。 思王气 第四各思王气，春思东方青气润泽我身，赤气相之。 夏思南方赤气，黄气相之。 秋思西方白气，黑气相之。 冬思北方黑气，青气相之。 四季思中央黄气，白气相之。 仰头以鼻纳气，低头咽之，下至丹田，中上升昆仑。 三取三咽之止。 咽三宫 第五各思三元生气，正白来下，周匝覆身，因仰头以鼻纳生气，言天一宫，生气当来生我，低头咽之，令满腹下丹田，中上升泥丸，地水如天法咒咽讫仰头，以鼻纳生气，天地水三宫生气，当共来生我身，低头咽之，令满腹下丹田，中上升泥丸。 三宫生气，浩然正白，覆身体，贯达五藏六府十二支干间。 如此一过止。 启事",
      "translated_text": "**The Yellow Book of Shangqing Rites for Crossing Over**\n\n**Scripture Title:** *The Yellow Book of Shangqing Rites for Crossing Over*. Author unknown, approximately dating to the Northern and Southern Dynasties. A ritual manual for bedroom cultivation practices in the early Heavenly Master Dao tradition. One scroll. Base text from *Daoist Canon of the Zhengtong Era*, Orthodox Section, Part One.\n\n---\n\n**The Yellow Book of Shangqing Rites for Crossing Over**\n\nWhen disciples receive the Dao under a master’s guidance, they must not exceed twenty years of age for the Crossing Over; if they receive the Dao beyond twenty, it is considered an overstepping, and they must bathe, observe prohibitions, and burn incense. Upon entering the oratory (*jing*), they must first report to the master before proceeding. Upon entering and exiting, they bow to the oratory and express gratitude.\n\n**Entering the Oratory**\nFor the first entry into the oratory, the yang disciple stands at the *yin* position (north), and the yin disciple stands at the *shen* position (west). The one seeking the Crossing Over kneels and says: *\"I, a mortal of flesh, am fortunate beyond a thousand generations to have been touched by the transformative power of the Dao. Having sought the Dharma for some time yet remaining uninitiated into the Crossing Over, I bow my head in reverence and take refuge, begging for the gift of life.\"* They then bow twice.\n\nThe master responds: *\"Today is auspicious; it is fitting to serve as your bridge.\"*\n\nThe seeker repeats: *\"I humbly pray for its fulfillment.\"*\n\nThe master replies: *\"I shall make the announcement.\"* The disciple, overwhelmed by the grace received, bows twice more to the master, who then takes their hand and leads them to face east.\n\n**Visualizing the Officials and Soldiers**\nBoth stand facing east, the yang on the left and the yin on the right, hands clasped together. The yang disciple interlocks fingers, with the second finger inserted between the yin disciple’s second and third fingers. Each sounds the drum twelve times in their mind, visualizing the Registrar Officials and Envoys, Generals, and Soldiers from the talismans they wear. These figures are adorned in resplendent robes, arrayed in ranks, guarding the disciples front and back, left and right. They are to summon the life-generating *qi* of the four directions to dispel calamities and disperse misfortune, reporting and distinguishing matters with clarity.\n\nThis visualization is performed once and then concluded.\n\n**Visualizing the White Qi**\nEach visualizes a white *qi* from the cinnabar field (*dantian*), as large as a six-inch mirror, emerging between the eyebrows. It gradually expands, radiating brilliance that illuminates the head above and showers the body below, penetrating to reveal the five viscera, six bowels, nine palaces, twelve chambers, four limbs, five constituents, joints, sinews, vessels, pores, and defensive and constructive *qi*—both exterior and interior—all becoming luminously clear.\n\nThis visualization is performed once and then concluded.\n\n**Visualizing the Royal Qi**\nEach visualizes the royal *qi* according to the season:\n- In spring, visualize the green *qi* of the east nourishing the body, accompanied by red *qi*.\n- In summer, visualize the red *qi* of the south, accompanied by yellow *qi*.\n- In autumn, visualize the white *qi* of the west, accompanied by black *qi*.\n- In winter, visualize the black *qi* of the north, accompanied by green *qi*.\n- During the four seasons, visualize the yellow *qi* of the center, accompanied by white *qi*.\n\nTilt the head back to inhale the *qi* through the nose, then lower the head to swallow it, guiding it down to the cinnabar field. From there, it ascends to the Kunlun (head). This is done three times, with three swallowings, and then concluded.\n\n**Swallowing the Three Palaces**\nEach visualizes the life-generating *qi* of the Three Origins descending in pure whiteness, enveloping the body. Tilting the head back, they inhale the life-generating *qi* through the nose and say: *\"Palace of Heavenly One, may the life-generating *qi* come to enliven me.\"* Lowering the head, they swallow it, filling the lower cinnabar field, then guiding it upward to the Mud Pill (head). Following the method of Heaven, Earth, and Water, they recite the incantation and swallow. Tilting the head back again, they inhale the life-generating *qi* of the Three Palaces—Heaven, Earth, and Water—through the nose, saying: *\"May the life-generating *qi* of the Three Palaces come together to enliven my body.\"* Lowering the head, they swallow it, filling the lower cinnabar field, then guiding it upward to the Mud Pill. The life-generating *qi* of the Three Palaces, vast and pure white, covers the body and permeates the five viscera, six bowels, and the twelve branches and trunks.\n\nThis visualization is performed once and then concluded.\n\n**Initiating the Rite**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 729,
      "start_sentence": 0,
      "end_sentence": 31,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.321074724197388,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清黄书过度仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "第六启仍俱东向长跪，各呜鼓十二通，臣身功曹，吏出上仙上灵二官，直使正一阴阳生气，治病功曹左右官使者，阴阳神庾吏官二人出，出者严装显服，住立臣前后，咸受臣口中辞语，分别关启某郡县乡里，中真官注气考召诸官君将吏，都候四始，四面监察，诸官主考召四君将吏，谨上启 太上无极大道无上玄老大上三炁君将吏，太上老君太上丈人诸官君将吏，天师嗣师系师女师三师君夫人门下生炁，诸官君将吏，真人君将吏，太和君将吏，黄书契令腹目君将吏，九炁丈人逮召君将吏，阴阳生炁度道君将吏，中胎真人备白君将吏，中胎赤白备泄君将吏，中黄戊己百节君将吏，阴阳功曹导化君将吏，阴阳真炁越道君将吏，监察内外开化君将吏，消灾散祸解厄君将吏，天节地节人节，三旄建节，四时八节，五行为合三五功曹斗杓君将吏，天地水三官考召诸官君将吏，此下里中营域中化神君将吏，官将百二十人故炁君将吏，鬼贼君将吏，臣某惶恐白，臣以顽愚痴下，好道乐生，前后某治炁祭酒真人某，甲进受真言要语，八生大度之法，要当奉行，谨有某郡县乡里男女生某，甲年如干岁，好道乐仙，今来诣臣求乞过度，奉行阴阳五行三炁，先从中元一生，上元一生，下元一生，三炁相结，共成为道，愿请监察内外开化君吏，还神复色补炁君吏，营域中化神君将吏，天地水三官考召诸君将吏，当为臣及甲解释三官，考逮撒除死籍，着名长生王历，得在种民辈中，愿臣及甲精神专固生炁，布染四支五藏，各得无他，所求者得，所过者度，口舌伏匿，事竟言功，不负效信，臣某诚惶诚恐，稽首再拜，谨以上启须报奉行。 姓属云云 太清云云",
      "translated_text": "The Sixth Rite proceeds with all facing east in a long kneel, each sounding the drum twelve times. The functionary of my body, the *li* officials, emerge—from the Upper Transcendent and Upper Numinous Bureaus—along with the direct envoys of the Orthodox Unity, the *yin-yang* life-generating *qi*, the functionaries for healing maladies, the left and right officials, and the *yin-yang* divine *yu* scribes, two in number. Those who emerge don their solemn attire and stand before and behind me, all receiving the words from my mouth. They are to distinguish and relay the following to the relevant commanderies, counties, townships, and hamlets:\n\nThe Central Perfected Officials infuse *qi* and summon all the Lords, Generals, and *li* officials. The Four Beginnings stand vigilant, monitoring the four directions. All officials, lords, and generals who preside over the summons—with reverence, I humbly address:\n\nThe Supreme Non-Ultimate Great Dao, the Most High Mysterious Elder, the Lords, Generals, and *li* officials of the Three *Qi*;\nThe Most High Lord Lao, the Most High Elder, and all Lords, Generals, and *li* officials;\nThe life-generating *qi* of the Three Masters—Celestial Master, Lineage Master, and Female Master—and their disciples;\nAll Lords, Generals, and *li* officials;\nThe Perfected Lords and Generals;\nThe Lords and Generals of Supreme Harmony;\nThe Lords and Generals of the Yellow Writ and the Contract of the Abdominal Eye;\nThe Nine *Qi* Elders and the Lords and Generals of Summons;\nThe Lords and Generals of *Yin-Yang* Life-Generating *Qi* and Dao Transmission;\nThe Central Womb Perfected and the Lords and Generals of Preparation;\nThe Central Womb Red-and-White and the Lords and Generals of Discharge;\nThe Central Yellow *Wu-Ji* and the Lords and Generals of the Hundred Joints;\nThe *Yin-Yang* Functionaries and the Lords and Generals of Transformation;\nThe *Yin-Yang* Perfected *Qi* and the Lords and Generals of Transcendent Dao;\nThe Lords and Generals of Internal and External Supervision and Enlightenment;\nThe Lords and Generals of Disaster Dispersion, Calamity Dissolution, and Tribulation Resolution;\nThe Heavenly, Earthly, and Human Standards, the Three Pennants, and the Four Seasons and Eight Nodes;\nThe Five Phases and the Union of the Three and Five, the Functionaries of the Dipper’s Handle, and the Lords and Generals;\nThe Lords and Generals of the Three Officials—Heaven, Earth, and Water—summoning all officials;\nThe Lords and Generals of this hamlet and encampment, and the transforming spirits within;\nThe Lords and Generals of the One Hundred Twenty *Qi* and the Former *Qi*;\nThe Lords and Generals of Ghosts and Bandits.\n\nI, [Name], prostrate in awe and trepidation, declare: I, in my foolishness and ignorance, delight in the Dao and cherish life. Previously, under the guidance of Master [Name], Libationer of *Qi* Cultivation and Perfected One, I received the essential teachings and the Eightfold Great Salvation Method. Bound by duty, I now uphold them.\n\nThere is a man/woman of [Commandery], [County], [Township], [Hamlet], named [Name], aged [Age] years, who delights in the Dao and aspires to transcendence. They have come before me seeking passage and salvation, vowing to practice the *yin-yang*, Five Phases, and Three *Qi*. Beginning with the Middle Prime’s first generation, then the Upper Prime’s first generation, and the Lower Prime’s first generation, the Three *Qi* intertwine to form the Dao.\n\nI humbly beseech the Lords and *li* officials of Internal and External Supervision and Enlightenment, the Lords and *li* officials of Spirit Restoration and *Qi* Replenishment, the Lords and Generals of the Encampment’s Transforming Spirits, and the Lords and Generals of the Three Officials—Heaven, Earth, and Water—to act on my behalf and [Name]’s, absolving us of the Three Officials’ judgments, expunging our names from the Registers of Death, and inscribing them in the Register of Long Life under the King. May we be counted among the Seed People.\n\nMay my spirit and that of [Name] be steadfast and our life-generating *qi* firm, suffusing our four limbs and five viscera, free from harm. May our desires be fulfilled, our passages secured, our slander silenced, our tasks completed, and our words efficacious. May we not betray the trust placed in us.\n\nI, [Name], prostrate in utmost reverence, kowtow twice and humbly submit this petition, awaiting your response and compliance.\n\n[Clan affiliation to be specified]\n[Supreme Purity to be invoked]",
      "overlap_context": "aces—Heaven, Earth, and Water—through the nose, saying: *\"May the life-generating *qi* of the Three Palaces come together to enliven my body.\"* Lowering the head, they swallow it, filling the lower cinnabar field, then guiding it upward to the Mud Pill. The life-generating *qi* of the Three Palaces, vast and pure white, covers the body and permeates the five viscera, six bowels, and the twelve branches and trunks.\n\nThis visualization is performed once and then concluded.\n\n**Initiating the Rite**",
      "start_char": 729,
      "end_char": 1377,
      "start_sentence": 32,
      "end_sentence": 35,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.717725038528442,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清黄书过度仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "太岁云云 地网 第七越地网三过，初一过言左，无上中过右，玄老后太上合手，慈父圣母，解脱罗网，除我死籍，上我生录。 天罗 释天罗三过，初在无上中右玄老，后太上对合手，生我者甲子，王文卿师父康，怀我者甲午，卫上卿师，母妞生我活我，事在大道，与父母。 四尊 第八朝四尊，两手相叉，持向寅上一拜长跪，言甲寅明文章，道父赞厥又纵厥十某为臣妾，消天下大灾，师言：令有男女生某甲，从臣妾乞丐过度。 弟子言：臣妾令从师某乙乞丐，更相过度，共奉行道德，乞丐阴肠和合，生气布流，臣妾身中，释神专固、各得无他，次回向申，上言甲申，扈文长道，母阐挫尤，戎拘，为臣妾散地上八方八祸。 次向子上言：甲子王文卿，师父可囊夏堂康，为臣妾消天下大灾。 次向午上言：甲午卫上卿，师母妞乃丑切，为臣妾散地上八方之祸。 咒皆如寅上法，一过止。 存思 第九对坐阳寅，上阴申上，求度者以两膝着外，合手阴却，两手膝上阳覆，两手叉掩，各琢齿十二通，思无上黑，正青玄老炁。 正黄太上炁，正白三黑，共为一混沌状，似鹦子，五色混黄，下诣丹田中。 如此一过止 十神",
      "translated_text": "May the Year Star [to be specified] and the Earthly Net—on the seventh traversal of the Earthly Net’s three crossings, the first crossing to the left, the Supreme Center crossing to the right, the Mysterious Elder and the Most High joining hands—O Merciful Father and Holy Mother, release us from the snares, remove our names from the Registers of Death, and inscribe them in the Register of Life.\n\nMay the Heavenly Net—on the threefold release of the Heavenly Net, first in the Supreme Center to the right of the Mysterious Elder, then the Most High facing and joining hands—he who gave me life be Jiazi, Master Wang Wenqing, Father Kang; she who nurtured me be Jiawu, Master Wei Shangqing, Mother Niu, who bore me and sustained me, their deeds rooted in the Great Dao, together with my parents.\n\nFor the Eighth Rite, the Homage to the Four Venerables: cross both hands and raise them toward the *yin* direction, bow once, then kneel in full prostration. Declare: “Jiayin, Radiant Writ of the Dao, the Dao-Father praises and extends his grace, appointing [Name] as your servant, to dispel the great calamities of the world.” The Master says: “Let there be a man or woman born [Name], who through your servant seeks passage and deliverance.”\n\nThe disciple says: “Your servant now through Master [Name] seeks passage, that we may together uphold and practice the Dao and its virtue, beseeching harmony in the hidden viscera and the free flow of life-generating *qi* within your servant’s body. May the spirit be steadfast and firm, each free from harm.” Then turn toward the *shen* direction and declare: “Jiashen, Hu Wen, the Long Dao, the Mother who subdues the rebellious and restrains the violent—dispel for your servant the eight disasters of the eight directions on earth.”\n\nThen turn toward the *zi* direction and declare: “Jiazi, Wang Wenqing, Master Father Kang of the Xia Hall—dispel for your servant the great calamities of the world.”\n\nThen turn toward the *wu* direction and declare: “Jiawu, Wei Shangqing, Master Mother Niu—dispel for your servant the eight disasters of the eight directions on earth.”\n\nThe incantation follows the same form as that for the *yin* direction, once only.\n\nFor the Ninth Rite, Visualization: sit facing the *yang-yin* direction, with the *yin-shen* direction above. Those seeking deliverance place their knees outward, hands joined in the *yin* position and drawn back, palms covering the knees in the *yang* position, fingers interlaced and covering. Tap the teeth twelve times. Visualize the Supreme Black, the True Azure *qi* of the Mysterious Elder; the True Yellow *qi* of the Most High; the True White and the Three Blacks, all merging into a single state of primordial chaos, resembling a fledgling parrot, its five colors blending into yellow, descending into the Cinnabar Field.\n\nThus, once only.\n\nThe Ten Spirits.",
      "overlap_context": "\n\nMay my spirit and that of [Name] be steadfast and our life-generating *qi* firm, suffusing our four limbs and five viscera, free from harm. May our desires be fulfilled, our passages secured, our slander silenced, our tasks completed, and our words efficacious. May we not betray the trust placed in us.\n\nI, [Name], prostrate in utmost reverence, kowtow twice and humbly submit this petition, awaiting your response and compliance.\n\n[Clan affiliation to be specified]\n[Supreme Purity to be invoked]",
      "start_char": 1377,
      "end_char": 1846,
      "start_sentence": 36,
      "end_sentence": 51,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.624592781066895,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清黄书过度仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "第十思甲子甲．午十神，易先思甲午，卫上卿乙未，杜仲阳丙申，朱伯众丁酉，臧文公戊戌，范少卿甲子，王文卿乙丑，龙季卿丙寅，张仲卿丁卯，司马卿戊辰，季楚卿愿遣此十神，上诣上三天曹。 师言：今有男女生某甲，从臣乞丐过度。 弟子言； 臣妾今从师某乙乞丐，更相过度，共奉行道德，乞丐阴阳和合，生气布流臣妾身中，精神专固，各得无他，当为甲撤除死籍，着名长生玉历，过度九厄，得为后世种民，乙先思甲子至戊辰，次甲午至戊戌。 配甲 第十一配十二尊名言，甲寅明文章，道父赞厥又纵厥十某，甲申扈文长，道母阐挫尤戎拘，师言：今有男女生某甲，从臣妾乞丐过度。 弟子言：臣妾今从师某乙乞丐，更相过度，共奉行道德乞丐阴阳和合，生炁布流臣妾身中，撒除死籍，着名长生玉历，过度九厄，得为后世种民，次呼甲子王文卿，师父康，可囊夏堂甲午卫上卿，师母妞乃丑切，次呼乙亥庞明心，道父弃颠托，乙巳唐文卿，道母闽（门＋也）该罢切，次呼乙卯戴公阳，道父契欺制，乙酉孔利公，道母妈（）慈卒、慈律二切。 次呼甲辰孟非卿，道父杵只藻东实，甲戌展子江，道母媳（女＋恚）知御切。 次呼乙丑龙季卿，道父挈（加＋手）宁琦男尾，乙未杜仲阳，道母媤。 五神 第十二思五神，太岁神，今月神，本命神行年神，今日神，愿遣此五神，上诣三天曹，师言：今有男女生某甲，从臣妾乞丐过度。 弟子言：臣妾今从师某乙乞丐，更相过度，共奉行道德，愿为臣妾解除三官考逮，解脱罗网，彻除死籍，着名长生玉历，过度九厄，乞为后世种民。 如此二过止。 八生 第十三解手八生，第一戏龙虎初，左无上中右玄老后太上，臣今过度男女生某甲，共奉行道德乞丐阴阳生气共生臣妾，解除三官考逮，解脱罗网，撒除死籍，着名长生玉历，过度九厄，乞为后世种民。 第二转关初左无上中右玄老后太上，新出老君太清玄元，上三天无极大道。 第三龙虎交初左无上中右玄老，后太上老君太上丈人三炁君。 第四龙虎校初左无上中右玄老，后太上帝君天帝丈人。 第五龙虎推初左无上中右玄老，后太上九老仙都君，九炁丈人等。 第六龙虎荡初，取上元左无上中，取上元右玄老后，取上元太上百千万重道炁千二百官君。 第七龙虎张初，取上元左无上中，取上元右玄老后，取上元太上太清道君，太清丈人玉陛下。 第八揖真人初取上元左无上，中取上元右玄老后，取上元太上天师嗣师系师女师。 右解中元二十四气，皆言今有甲乙乞丐过度，共奉行道德乞丐阴阳生气共生臣妾身，愿为臣妾解除三官考逮，解脱罗网，彻除死藉，着名长生玉历，过度九厄，得为后世种民都毕。 解结食 师为弟子解衣带结，散发，告者亦解贤者结。 第十四食生吐死法，男左女右，两手相叉，俱向王伸两脚坐头，以鼻微微纳生气，低头咽之，俱卧瞑目，以口微微吐死气，三卧三坐止。 九宫 第十五布九宫法，首午天地相临，横画为乙，纵画为甲。 第一子九，阳行下元四，阴行五，共呼子九。 第二午九，阳行上元四，阴行五，共呼午九。 第三卯九，阳以左手四指覆横，掩阴右手五指上，合为九，置东方， 共言卯九。 第四酉九，阴仰伸左手五指，阳覆右手四指，横覆阴指上，置西方，共言酉九。",
      "translated_text": "The Tenth Visualization: The Ten Spirits of *Jia-zi* and *Jia-wu*\n\nFirst visualize *Jia-wu*: Wei Shangqing of *Yi-wei*; Du Zhongyang of *Bing-shen*; Zhu Bozhong of *Ding-you*; Zang Wengong of *Wu-xu*; Fan Shaoqing of *Jia-zi*; Wang Wenqing of *Yi-chou*; Long Jiqing of *Bing-yin*; Zhang Zhongqing of *Ding-mao*; Sima Qing of *Wu-chen*; Ji Chuqing. May these ten spirits ascend to the Upper Three Heavenly Courts.\n\nThe master declares: “Now there is a man or woman born under such-and-such a name, who entreats me for deliverance.”\n\nThe disciple responds: “Your disciple now entreats Master So-and-so for deliverance, that we may together practice the Dao and its virtue, entreating the harmony of *yin* and *yang*, that the *qi* of life may flow through this disciple’s body, that spirit and essence may be concentrated and firm, each free from harm. May the name be struck from the register of death and inscribed in the Jade Record of Longevity, that the nine calamities be transcended, and this disciple be made a seed-person of future generations.”\n\nFirst visualize from *Jia-zi* to *Wu-chen*, then from *Jia-wu* to *Wu-xu*.\n\nMatching *Jia*\nThe Eleventh: Matching the Twelve Honorable Names\n\n*Jia-yin*: Mingwenzhang, the Dao-Father who praises and extends the ten;\n*Jia-shen*: Hu Wenchang, the Dao-Mother who expounds and subdues the ten.\n\nThe master declares: “Now there is a man or woman born under such-and-such a name, who entreats me for deliverance.”\n\nThe disciple responds: “Your disciple now entreats Master So-and-so for deliverance, that we may together practice the Dao and its virtue, entreating the harmony of *yin* and *yang*, that the *qi* of life may flow through this disciple’s body, that the register of death be struck and the name inscribed in the Jade Record of Longevity, that the nine calamities be transcended, and this disciple be made a seed-person of future generations.”\n\nNext invoke:\n*Jia-zi* Wang Wenqing, the Master-Father Kang;\n*Jia-wu* Wei Shangqing, the Master-Mother *Niū-nǎi* (cut as *chǒu*);\n*Yi-hai* Pang Mingxin, the Dao-Father Qi Dian Tuo;\n*Yi-si* Tang Wenqing, the Dao-Mother *Mǐn* (门+也, cut as *bà*);\n*Yi-mao* Dai Gongyang, the Dao-Father Qi Qizhi;\n*Yi-you* Kong Ligong, the Dao-Mother *Mā* (慈卒/慈律, cut as *cù/lǜ*);\n*Jia-chen* Meng Feiqing, the Dao-Father Chu Zhi Zao Dongshi;\n*Jia-xu* Zhan Zijiang, the Dao-Mother *Xì* (女+恚, cut as *zhì-yù*);\n*Yi-chou* Long Jiqing, the Dao-Father *Qìe* (加+手) Ning Qi Nanwei;\n*Yi-wei* Du Zhongyang, the Dao-Mother *Shī*.\n\nThe Five Spirits\nThe Twelfth Visualization: The Five Spirits\n\nThe Spirit of the Great Year, the Spirit of the Current Month, the Spirit of One’s Original Destiny, the Spirit of the Year of Age, the Spirit of the Present Day. May these five spirits ascend to the Three Heavenly Courts.\n\nThe master declares: “Now there is a man or woman born under such-and-such a name, who entreats me for deliverance.”\n\nThe disciple responds: “Your disciple now entreats Master So-and-so for deliverance, that we may together practice the Dao and its virtue, that the Three Officials’ investigations be resolved, the net of entanglements undone, the register of death struck, the name inscribed in the Jade Record of Longevity, the nine calamities transcended, and this disciple be made a seed-person of future generations.”\n\nThus, twice only.\n\nThe Eight Generations\nThe Thirteenth: Unbinding the Hands and the Eight Generations\n\nFirst: Play of the Dragon and Tiger\nLeft: the Supreme Center; Right: the Mysterious Elder, the Most High.\n“This disciple now delivers the man or woman born under such-and-such a name, that we may together practice the Dao and its virtue, entreating the *yin* and *yang* *qi* of life to be born within this disciple, resolving the Three Officials’ investigations, undoing the net of entanglements, striking the register of death, inscribing the name in the Jade Record of Longevity, transcending the nine calamities, and making this disciple a seed-person of future generations.”\n\nSecond: Turning the Pass\nLeft: the Supreme Center; Right: the Mysterious Elder, the Most High.\nThe newly emerged Lord Lao, the Supreme Clarity of the Primordial Mystery, the Great Dao of the Boundless Upper Three Heavens.\n\nThird: Dragon and Tiger in Union\nLeft: the Supreme Center; Right: the Mysterious Elder, the Most High.\nLord Lao, the Most High, the Venerable Lord of the Three *Qi*.\n\nFourth: Dragon and Tiger in Alignment\nLeft: the Supreme Center; Right: the Mysterious Elder, the Most High.\nThe Lord Emperor of the Most High, the Heavenly Emperor, the Venerable Lord.\n\nFifth: Dragon and Tiger in Motion\nLeft: the Supreme Center; Right: the Mysterious Elder, the Most High.\nThe Nine Elders of the Most High, the Lords of the Immortal Capital, the Nine *Qi* Venerable Lords, and the like.\n\nSixth: Dragon and Tiger in Flux\nTake the Upper Primordial: Left, the Supreme Center; Right, the Mysterious Elder, the Most High.\nTake the Upper Primordial: the Most High, the myriad layers of the Dao’s *qi*, the twelve hundred Lords Official.\n\nSeventh: Dragon and Tiger in Expansion\nTake the Upper Primordial: Left, the Supreme Center; Right, the Mysterious Elder, the Most High.\nTake the Upper Primordial: the Most High, the Lord of the Supreme Clarity of the Dao, the Venerable Lord of the Supreme Clarity beneath the Jade Steps.\n\nEighth: Bowing to the Perfected\nTake the Upper Primordial: Left, the Supreme; Center, the Mysterious Elder, the Most High.\nTake the Upper Primordial: the Most High, the Heavenly Master, the Lineage Master, the Master of the System, the Female Master.\n\nFor the Unbinding of the Middle Primordial’s Twenty-Four *Qi*, all declare:\n“Now there is such-and-such a name who entreats for deliverance, that we may together practice the Dao and its virtue, entreating the *yin* and *yang* *qi* of life to be born within this disciple’s body, resolving the Three Officials’ investigations, undoing the net of entanglements, striking the register of death, inscribing the name in the Jade Record of Longevity, transcending the nine calamities, and making this disciple a seed-person of future generations.” All is complete.\n\nUnbinding Knots and Taking Nourishment\nThe master unbinds the knots of the disciple’s sash and loosens the hair; the one making the declaration also unbinds the knots of the worthy one.\n\nThe Fourteenth: Method of Ingesting Life and Expelling Death\nMen to the left, women to the right. Hands interlaced, both facing the direction of the king, legs extended in seated posture. With the nose, gently draw in the *qi* of life, lower the head and swallow it. Lie down with eyes closed, and with the mouth gently expel the *qi* of death. Three times lying down, three times sitting—stop.\n\nThe Nine Palaces\nThe Fifteenth: Method of Arranging the Nine Palaces\n\nAt the head, *wu*, where Heaven and Earth meet: horizontal lines form *yi*, vertical lines form *jia*.\n\nFirst: *Zi* Nine\n*Yang* proceeds to the Lower Primordial’s four; *yin* proceeds to five. Together call: *Zi* Nine.\n\nSecond: *Wu* Nine\n*Yang* proceeds to the Upper Primordial’s four; *yin* proceeds to five. Together call: *Wu* Nine.\n\nThird: *Mao* Nine\n*Yang*: with the left hand, cover the four fingers horizontally, concealing the *yin*; the right hand’s five fingers above. Combined as nine, placed in the eastern direction. Together declare: *Mao* Nine.\n\nFourth: *You* Nine\n*Yin*: left hand upturned with five fingers extended; *yang*: right hand covering with four fingers, horizontally over the *yin* fingers. Placed in the western direction. Together declare: *You* Nine.",
      "overlap_context": "s joined in the *yin* position and drawn back, palms covering the knees in the *yang* position, fingers interlaced and covering. Tap the teeth twelve times. Visualize the Supreme Black, the True Azure *qi* of the Mysterious Elder; the True Yellow *qi* of the Most High; the True White and the Three Blacks, all merging into a single state of primordial chaos, resembling a fledgling parrot, its five colors blending into yellow, descending into the Cinnabar Field.\n\nThus, once only.\n\nThe Ten Spirits.",
      "start_char": 1846,
      "end_char": 3128,
      "start_sentence": 52,
      "end_sentence": 84,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.37515997886658,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清黄书过度仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "第五中九，天覆地载，阳思肝心肺脾四藏，阴思肝心脾肺肾五藏，合为九，共言中五九位成。 共言：水流归末，分八至丑，阳以左足二指，阴以右足五指，又以右手一指并足边，阳指掩阴足指为八，置丑上，共言：艮八还，作坎一，阴阳共言坎一。 又命木落归本，分六至亥，纯阳右足手各三合为六，掩阴左足上，置亥，言乾六还，作震三。 阳以左手一指横掩阴右手二指，合置卯上，令对腰，言震三。 又命金刚火强，分二至未，纯阴，阳以左手伸二指横掩阴，手上置西南，对肩言坤二还作兑七阴，以左手伸四指阳，以右手三指横掩阴，指上置西，对腰言兑七。 又命土至四季分四王已阳，以左手三指阴横，右手一指置东南，对肩言巽四还，思中宫五藏阳，思肝肾阴，思心肺脾各窃言中官五，又命火强炎上，自处其乡，不分位成，又命二四为肩阳，以手共注阴左眉上二，又注右眉上四，又命六八为足阳，以右足注阴，左足上六阳，以左足注阴，右足上八，又命左三右七，阳以左手，阴以右手，共注阴，左腰三，阳以右手，阴以左手，共注阴，左腰七，又命戴九覆一，阳取上元三，阴取上元六，下元阴阳各半，一又命五在中宫，主为腹实，共思五藏阳，肾肝阴，心脾肺以心相摩，五九宫位成。 各言巽，呼天门，从乾得一，便行五，各言乾五，退报五，又行五，各言中退，又行五，各言巽五，退报五，又言艮八，高举散三从坤，便行五，各言艮五退报，又行五，各言坤五退报，又言震雷动泽，从兑得二便行五，各言兑五退报，又行五，各言震五退报，又言坎不独立，从离取四便行五，各言离五退报，又行五，各言坎五退报，又言三五纵横，齐等如一。 四十五气毕。 度甲首东卯度乙首南午卧 第十六蹑纪。 第一阳蹑纪，下阴左边外乙卧，戴右手第二指甲起，以左手第二第三指中问相叉，持乙指，举左足於前，右足横后，因举左足三摩乙心咒曰，中央戊己百节君吏，四时八节千二百官君吏，辅臣过某三桥之下，因举左足从乙心度乙，右南行西旋北转，至乙右胁边十一迹。 第一阴蹑纪，下阳右边卧甲卧，戴左手第二指乙起，以右手第二第三指中间相叉，持阳指举右足於前，左足横后，因举右足三摩甲心咒曰，中央戊己百节君吏，四时八节千二百官君吏，辅妾过某三桥之下，因举右足从甲心度甲，左东行北旋西转，至甲左胁边十一迹。 第二散步还申，更叉乙指，举左足於前，右足横后，因举左足三摩乙心咒迹如前。 第二散步还寅，更叉甲指，举右足於前，左足横后，因举右足三摩甲心，咒迹如前。 第三散步还申，更叉乙指，举左足於前，右足横后，因举左足三摩乙心，咒迹如前。 阳行绕三周雨还阴，左卧阳起秉魁，上行三气三取三元三咽毕。 第三散步还寅，更叉甲指举右足於前，左足横后，因举右足三摩甲心咒迹如前。 阴行绕三周市还阳，右卧阳起秉魁，上行三气三取三元三咽毕。 甲因起以右手捧昆仑，左手摩泥丸，左回三过，因将面从左边下至泥丸，言左无上三取上元，因度右边，报之三过，又以左手捧昆仑，右手摩泥丸，右回三过，因将面右边下至泥丸，言右玄老三取上元，复左边报之三，又以右手捧昆仑，左手摩泥丸，初左回次右迥，又左回合三周，将从面上直下至命门，言太上三取三元，因度右边报之三即还左，以右手扶昆仑，左手摩左边中元左乳下，左回三过，直将下至泥丸，言在左无上，度右报三，又以左手扶昆仑下，右手摩右中元右乳下，右回三过，直将下至泥丸，言右玄老复还左报三，以右手扶昆仑，左手摩泥丸，左回次右回，又左回合三周，将面上直下至命门，言太上因度右报三即还左，以右手扶昆仑，左手摩丹田左边脐下丹田，左回三过，直下将至命门，言左无上，又度右报三，以左手扶昆仑，右手摩丹田右边，右回三过，直下将至命门，言右玄老复还左报三，以右手扶昆仑，左手摩绛官，初左回，次右回，又左回，合三周直下将至丹田，左右回三下，至命门，言太上，因度右报三。",
      "translated_text": "Fifth: Central Nine\nHeaven covers, Earth bears. *Yang* contemplates the four viscera: liver, heart, lungs, spleen; *yin* contemplates the five viscera: liver, heart, spleen, lungs, kidneys. Combined as nine, together declare: the Central Five-Nine Position is complete.\n\nTogether declare: \"Water flows to its end.\" Divide eight to *chou*. *Yang* uses the second toe of the left foot; *yin* uses the five toes of the right foot. Further, with the right hand’s one finger beside the foot, the *yang* finger covers the *yin* toes to make eight. Place at *chou*, together declare: *Gen* Eight Returns, becomes *Kan* One. *Yin* and *yang* together declare *Kan* One.\n\nNext command: \"Wood falls to return to its root.\" Divide six to *hai*. Pure *yang*: right foot and hand each combine three to make six, covering the *yin* left foot. Place at *hai*, declare *Qian* Six Returns, becomes *Zhen* Three. *Yang* uses the left hand’s one finger to horizontally cover the *yin* right hand’s two fingers. Place together at *mao*, aligning with the waist, declare *Zhen* Three.\n\nNext command: \"Metal is firm, fire is strong.\" Divide two to *wei*. Pure *yin*. *Yang* extends the left hand’s two fingers to horizontally cover *yin*’s hand. Place at the southwest, aligning with the shoulder, declare *Kun* Two Returns to become *Dui* Seven *yin*. Extend the left hand’s four *yang* fingers, with the right hand’s three fingers horizontally covering *yin*. Place above the fingers at the west, aligning with the waist, declare *Dui* Seven.\n\nNext command: \"Earth reaches the four seasons.\" Divide four to the four kings of *si* *yang*. With the left hand’s three *yin* fingers horizontal, the right hand’s one finger placed at the southeast, aligning with the shoulder, declare *Xun* Four Returns. Contemplate the five viscera of the Central Palace: *yang* contemplates the kidneys and liver; *yin* contemplates the heart, lungs, and spleen. Each silently declares the Central Official Five. Further command: \"Fire is strong, flames rise.\" Abide in one’s own domain, without dividing positions to complete.\n\nNext command: \"Two and four are the shoulders’ *yang*.\" With the hands together, direct to the *yin* left eyebrow as two, and to the right eyebrow as four. Next command: \"Six and eight are the feet’s *yang*.\" With the right foot direct to *yin*’s left foot as six *yang*; with the left foot direct to *yin*’s right foot as eight. Next command: \"Left three, right seven.\" *Yang* with the left hand, *yin* with the right hand, together direct to *yin*’s left waist as three. *Yang* with the right hand, *yin* with the left hand, together direct to *yin*’s right waist as seven.\n\nNext command: \"Wear nine, cover one.\" *Yang* takes the Upper Primordial’s three; *yin* takes the Upper Primordial’s six. The Lower Primordial’s *yin* and *yang* each take half of one. Further command: \"Five resides in the Central Palace, governing the solidity of the abdomen.\" Together contemplate the five viscera: *yang* the kidneys and liver; *yin* the heart, spleen, and lungs. With the heart mutually harmonize. The Five-Nine Palace positions are complete.\n\nEach declares *Xun*, calls the Gate of Heaven. From *Qian* obtain one, then proceed five. Each declares *Qian* Five, retreat and report five. Proceed another five, each declares *Central Retreat*. Proceed another five, each declares *Xun* Five, retreat and report five. Further declare *Gen* Eight. Raise high and disperse three from *Kun*, then proceed five. Each declares *Gen* Five, retreat and report. Proceed another five, each declares *Kun* Five, retreat and report. Further declare: \"Thunder shakes the marsh.\" From *Dui* obtain two, then proceed five. Each declares *Dui* Five, retreat and report. Proceed another five, each declares *Zhen* Five, retreat and report. Further declare: \"*Kan* does not stand alone.\" From *Li* take four, then proceed five. Each declares *Li* Five, retreat and report. Proceed another five, each declares *Kan* Five, retreat and report. Further declare: \"Three and five crisscross, equal and as one.\"\n\nForty-five *qi* complete. Measure *jia*’s head at the east *mao*; measure *yi*’s head at the south *wu*, lying down.\n\n---\n\nSixteenth: Treading the Ji\n\nFirst: *Yang* Treads the Ji\nBelow *yin*, lie on the left side outside *yi*. Raise the right hand’s second fingernail. With the left hand’s second and third fingers interlaced in the middle, hold *yi*’s finger. Lift the left foot forward, the right foot horizontally behind. Then lift the left foot three times, rubbing *yi*’s heart, and recite the incantation: \"Central *wu ji*, lords and officials of the hundred joints; lords and officials of the four seasons, eight nodes, and twelve hundred offices, assist your minister in passing beneath the Three Bridges.\" Then lift the left foot from *yi*’s heart, tread *yi*, proceed right to the south, rotate west, turn north, to *yi*’s right flank, eleven steps.\n\nFirst: *Yin* Treads the Ji\nBelow *yang*, lie on the right side outside *jia*. Raise the left hand’s second fingernail from *yi*. With the right hand’s second and third fingers interlaced in the middle, hold the *yang* finger. Lift the right foot forward, the left foot horizontally behind. Then lift the right foot three times, rubbing *jia*’s heart, and recite the incantation: \"Central *wu ji*, lords and officials of the hundred joints; lords and officials of the four seasons, eight nodes, and twelve hundred offices, assist your handmaiden in passing beneath the Three Bridges.\" Then lift the right foot from *jia*’s heart, tread *jia*, proceed left to the east, rotate north, turn west, to *jia*’s left flank, eleven steps.\n\nSecond: Disperse Steps to Return to *Shen*\nAgain interlace *yi*’s finger. Lift the left foot forward, the right foot horizontally behind. Then lift the left foot three times, rubbing *yi*’s heart, incantation as before.\n\nSecond: Disperse Steps to Return to *Yin*\nAgain interlace *jia*’s finger. Lift the right foot forward, the left foot horizontally behind. Then lift the right foot three times, rubbing *jia*’s heart, incantation as before.\n\nThird: Disperse Steps to Return to *Shen*\nAgain interlace *yi*’s finger. Lift the left foot forward, the right foot horizontally behind. Then lift the left foot three times, rubbing *yi*’s heart, incantation as before. *Yang* proceeds, circling three rounds, returns to *yin*. Lie on the left, *yang* rises, grasping the *Kui*. Ascend three *qi*, take three Primordials, swallow three times, complete.\n\nThird: Disperse Steps to Return to *Yin*\nAgain interlace *jia*’s finger. Lift the right foot forward, the left foot horizontally behind. Then lift the right foot three times, rubbing *jia*’s heart, incantation as before. *Yin* proceeds, circling three rounds, returns to *yang*. Lie on the right, *yang* rises, grasping the *Kui*. Ascend three *qi*, take three Primordials, swallow three times, complete.\n\n*Jia* then rises. With the right hand support *Kunlun*; with the left hand rub the *Niwan*. Rotate left three times, then bring the face down from the left side to the *Niwan*, declaring: \"Left, the Supreme Three, take the Upper Primordial.\" Then tread to the right side, report three times. Again with the left hand support *Kunlun*; with the right hand rub the *Niwan*. Rotate right three times, then bring the face down from the right side to the *Niwan*, declaring: \"Right, the Mysterious Elder Three, take the Upper Primordial.\" Return to the left side, report three times. Again with the right hand support *Kunlun*; with the left hand rub the *Niwan*. First rotate left, then right, then left again, completing three rounds. Bring the face straight down to the *Mingmen*, declaring: \"Supreme Three, take the Three Primordials.\" Then tread to the right side, report three times, then return to the left.\n\nWith the right hand support *Kunlun*; with the left hand rub the left Central Primordial below the left breast. Rotate left three times, bring straight down to the *Niwan*, declaring: \"Left, the Supreme.\" Tread to the right, report three times. With the left hand support *Kunlun*; with the right hand rub the right Central Primordial below the right breast. Rotate right three times, bring straight down to the *Niwan*, declaring: \"Right, the Mysterious Elder, return to the left,\" report three times.\n\nWith the right hand support *Kunlun*; with the left hand rub the *Niwan*. Rotate left, then right, then left again, completing three rounds. Bring the face straight down to the *Mingmen*, declaring: \"Supreme.\" Tread to the right, report three times, then return to the left. With the right hand support *Kunlun*; with the left hand rub the left side of the *Dantian* below the navel. Rotate left three times, bring straight down to the *Mingmen*, declaring: \"Left, the Supreme.\" Tread to the right, report three times.\n\nWith the left hand support *Kunlun*; with the right hand rub the right side of the *Dantian*. Rotate right three times, bring straight down to the *Mingmen*, declaring: \"Right, the Mysterious Elder, return to the left,\" report three times. With the right hand support *Kunlun*; with the left hand rub the *Jianggong*. First rotate left, then right, then left again, completing three rounds. Bring straight down to the *Dantian*, rotate left and right three times downward to the *Mingmen*, declaring: \"Supreme.\" Tread to the right, report three times.",
      "overlap_context": "four; *yin* proceeds to five. Together call: *Wu* Nine.\n\nThird: *Mao* Nine\n*Yang*: with the left hand, cover the four fingers horizontally, concealing the *yin*; the right hand’s five fingers above. Combined as nine, placed in the eastern direction. Together declare: *Mao* Nine.\n\nFourth: *You* Nine\n*Yin*: left hand upturned with five fingers extended; *yang*: right hand covering with four fingers, horizontally over the *yin* fingers. Placed in the western direction. Together declare: *You* Nine.",
      "start_char": 3128,
      "end_char": 4661,
      "start_sentence": 85,
      "end_sentence": 103,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.76482629776001,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清黄书过度仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "思三气 复还左，正偃卧思神，左无上气，正青右玄老气，正黄太上气，正白贯臣妾身，六甲五藏，支干间，左上右下，周匝一身，还治臣妾下丹田中，上升昆仑山。 思－宫 太清玄元青气，左上右下，绕一宫太素白气，左上右下，绕一宫太初赤气，左上右下，绕一宫太始黄气，左上右下，绕一宫肝气，正青，左上右下，绕一宫肺气正白，左上右下，绕一宫心气正赤，左上右下，绕一宫脾气正黄，左上右下，绕一宫肾气正黑，左上右下，绕一宫一宫者下丹田，中有真人君治其中，存思诸气，皆围绕一宫三重。 阴右上左下如上法 自导 思气神都毕甲因以手自导，以左手将左乳边至足，言左无上三过止，又以右手将右乳边至足，言右玄老三过止，次以左手将额上直下，下至丹田太上，右手随之，如此三将三言之便，乘魁起不受三五龙行上，复以右手摩下丹田三便诣生门，以右手开金门，左手挺玉钥注生门上，又以左手扶昆仑，右手摩命门纵横，三言水东流云西归，阴养阳气微，微玄精滋液，上诣师门，甲又呎神男持关王，女开户配气从阴，以气施我乙咒阴阳施化，万物滋生，天覆地载，愿以气施臣妾身。 甲乙咒法 第十七甲咒，吾欲乘天纲入地纪，四时五行，各自当真人，不得动摇，持纪纲五气，自附玄且黄归吾五藏，自生光，乙咒吾欲偃地承天，合阴阳四时五行，各自当真人，不得动摇，持纪纲五气，自附玄且黄归吾五藏，自生光，甲以左手扶道父，咒曰一君在吾前，二君在吾后，为吾梭除灾害恶逆，一切皆令消灭，注左三言左无上，注右三言右玄老，注上三言中太上，言臣妾有某甲乞丐过度，共奉行道德，乞长生久视，得为种民，注中央三言，左无上右玄老，太上三气，共生臣妾身，混沌为一，名曰桃康，舍止北极，号日子丹，衣服五色，赤积大冠，金床玉榻，五色栏干，珠玉斗帐，正当命门，神男玉女侍两边，阳气左转，阴气右旋，上至太清，下至无下，常游九宫五藏六府之间，领录群神，案录召名，不得通亡，长在我身，与我俱仙，仰头鼻三纳生气，三五七九咽阳，言天道行乙，言地道行，便进入生门中，令半首又咒，柳君妞君万神生，吾欲摇天动地，五君各自谛乙咒，柳君妞君丹田府，吾欲动地摇天，身中五神各自坚径进渊底，闭口以鼻纳生气，口吐之，三琢齿，言九一生其中，小退还半、首度甲先行始生气。 支干数 甲子旬生，天始生丙寅，地始生壬申，甲戌旬生，天始生丙子，地始生壬午，甲申旬生，天始生丙戌，地始生壬辰，甲午旬生，天始生丙申，地始生壬寅，甲辰旬生，天始生丙午，地始生壬子，甲寅旬生，天始生丙辰，地始生壬戌，次行三五七九退报，又行二四六八退报，又行五气退报六咽。",
      "translated_text": "Visualize the Three Qi and return to the left. Lie supine and visualize the spirits: the left, the Qi of the Supreme, true blue-green; the right, the Qi of the Mysterious Elder, true yellow; the center, the Qi of the Supreme, true white, piercing through your body, the Six Jia, the five viscera, and the branches and stems. Left above, right below, encircling the entire body, returning to govern within your lower Dantian, ascending to Kunlun Mountain.\n\nVisualize the One Palace: the Great Clarity’s Primordial Blue-Green Qi, left above and right below, encircling one palace; the Great Simplicity’s White Qi, left above and right below, encircling one palace; the Great Beginning’s Red Qi, left above and right below, encircling one palace; the Great Origin’s Yellow Qi, left above and right below, encircling one palace. The liver’s Qi, true blue-green, left above and right below, encircling one palace; the lungs’ Qi, true white, left above and right below, encircling one palace; the heart’s Qi, true red, left above and right below, encircling one palace; the spleen’s Qi, true yellow, left above and right below, encircling one palace; the kidneys’ Qi, true black, left above and right below, encircling one palace. Each of these palaces is the lower Dantian, wherein the True Person, the Lord, governs. Visualize all the Qi encircling each palace in three layers.\n\nYin: right above, left below—proceed as above.\n\nSelf-Guiding:\nVisualize the Qi and spirits to completion. Then, with the hands, guide yourself: with the left hand, trace from the left breast to the foot, declaring \"Left, the Supreme\" three times and stop. With the right hand, trace from the right breast to the foot, declaring \"Right, the Mysterious Elder\" three times and stop. Next, with the left hand, trace from the forehead straight downward to the Dantian, the Supreme; the right hand follows. Do this three times, three declarations, then rise upon the *Kui* star, refusing the Three and Five Dragons’ ascent. Again, with the right hand, rub the lower Dantian three times, approach the Gate of Life, open the Golden Gate with the right hand, and insert the Jade Key with the left, placing it upon the Gate of Life. With the left hand supporting Kunlun, and the right hand rubbing the Mingmen horizontally and vertically, declare three times: \"Water flows east, clouds return west; yin nurtures yang’s Qi, subtly, subtly, essence and fluid flourish.\" Ascend to the Master’s Gate. Then, exhale upon the divine male holding the pass, or the divine female opening the door, to harmonize Qi with yin. With Qi, recite the *Yi* incantation: \"Yin and yang bestow transformation; the myriad things flourish. Heaven covers, earth bears—may Qi be bestowed upon my body.\"\n\nIncantation of Jia and Yi:\nSeventeenth Jia incantation: \"I desire to ride the celestial net and enter earth’s records, the four seasons and five phases, each abiding by their True Person, unshaken. Hold the records and the Five Qi; let the mysterious and the yellow return to my five viscera, naturally generating light.\"\nYi incantation: \"I desire to lie upon earth and uphold heaven, uniting yin and yang, the four seasons and five phases, each abiding by their True Person, unshaken. Hold the records and the Five Qi; let the mysterious and the yellow return to my five viscera, naturally generating light.\"\nWith the left hand supporting the Dao Father, recite the incantation: \"One Lord before me, two Lords behind me, weaving and removing calamities, adversities, and all misfortunes, causing them all to vanish.\" Direct left three times, declaring \"Left, the Supreme\"; direct right three times, declaring \"Right, the Mysterious Elder\"; direct upward three times, declaring \"Center, the Supreme.\" Declare: \"Your servant, so-and-so Jia, humbly seeks passage and transcendence, together upholding the Dao and virtue, beseeching longevity and enduring vision, to become one of the seed people.\" Direct the center three times, declaring: \"Left, the Supreme; right, the Mysterious Elder; the Supreme’s Three Qi together generate your servant’s body, merging into one, named Peach Health, dwelling at the Northern Culmen, called the Cinnabar Child. Clothed in five colors, wearing a great red cap, upon a golden bed and jade couch, with five-colored railings, a canopy of pearls and jade, directly aligned with the Mingmen. Divine males and jade maidens attend on either side. Yang Qi revolves left, yin Qi spirals right, ascending to the Great Clarity, descending to the lowest depths, constantly roaming among the Nine Palaces, the five viscera, and the six bowels. Leading and recording the host of spirits, calling names by the register, they must not flee. Long abide within my body, ascending with me as immortals.\" Inhale the Qi of life through the nose three times, swallow the yang seven, nine, and eleven times. Declare: \"The Dao of heaven proceeds.\" Declare: \"The Dao of earth proceeds.\" Then enter the Gate of Life, half your head within. Again recite: \"Willow Lord, Nü Lord, the myriad spirits live. I desire to shake heaven and move earth; let the Five Lords each attend carefully.\" Yi incantation: \"Willow Lord, Nü Lord, Dantian Palace, I desire to move earth and shake heaven; let the five spirits within my body each firmly advance to the abyss’s depths.\" Close the mouth, inhale the Qi of life through the nose, exhale through the mouth, click the teeth three times, declaring: \"Nine and one are born within.\" Slightly retreat, half a head’s distance. Jia first proceeds, beginning the Qi of life.\n\nStems and Branches Count:\nIn the Jiazi cycle, heaven first generates Bingyin, earth first generates Renshen.\nIn the Jiaxu cycle, heaven first generates Bingzi, earth first generates Renwu.\nIn the Jiashen cycle, heaven first generates Bingxu, earth first generates Renchen.\nIn the Jiawu cycle, heaven first generates Bingshen, earth first generates Renyin.\nIn the Jiachen cycle, heaven first generates Bingwu, earth first generates Renzi.\nIn the Jiayin cycle, heaven first generates Bingchen, earth first generates Renxu.\nNext, proceed with three, five, seven, nine, then retreat and report; proceed with two, four, six, eight, then retreat and report; proceed with the Five Qi, then retreat and report, swallowing six times.",
      "overlap_context": " hand rub the right side of the *Dantian*. Rotate right three times, bring straight down to the *Mingmen*, declaring: \"Right, the Mysterious Elder, return to the left,\" report three times. With the right hand support *Kunlun*; with the left hand rub the *Jianggong*. First rotate left, then right, then left again, completing three rounds. Bring straight down to the *Dantian*, rotate left and right three times downward to the *Mingmen*, declaring: \"Supreme.\" Tread to the right, report three times.",
      "start_char": 4662,
      "end_char": 5724,
      "start_sentence": 104,
      "end_sentence": 114,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.726887226104736,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清黄书过度仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "度乙先行始生，次二四六八退报，又行三五七九退报，又行三气退报，取上元气三咽之。 便蹑纪下不受三五龙倒下 第一阴蹑纪下阳右边，卧阳卧戴，左手第二指阴起，以右手第二三指中间相叉持阳指，举右足於前，左足横后，因举右足三摩甲心咒，中黄戊己百节君吏，四时八节千二百官君吏，辅妾过某三桥之下，因举右足，从甲心度甲，左东行北旋，西转至甲右胁十一迹。 第一阳蹑纪下阴左边，外阴卧戴，右手第二指阳起，以左手第二三指中问相叉持阴指，举左足於前； 右足横后，因举左足三摩乙心咒，中黄戊己百节君吏，四时八节千二百官君吏，辅臣过某三桥之下，因举左足，从乙心度乙，左南行西旋，北转至乙左胁令成十一迹。 第二散步还寅叉甲指，举右足於前，左足横后，因举右足三摩甲心咒，度迹如第一。 第二散步还申叉乙指，举左足於前，右足横后，因举左足三摩乙心咒，度迹如第一。 第三散步还寅，悉复如前。 第三散步还申，悉复如前。 右过阳三绕周市行三绕市，阴还阳右卧阳起，乘魁上行三炁，取上元三咽毕。 右过阴三绕周匝行三绕匝，阳还阴左外阳因起，乘魁上行三炁，取上元三咽毕。 第一阳蹑纪下阴右边阴外戴，右手第二指阳起，以左手第二三指中间相叉持阴指举，左足於前，右足横后，因举左足三摩乙心咒曰，中胎真人长三寸二分，填乙绛宫，摄录生官三万六千神长守乙体，与乙俱仙，因举左足从乙心度右，南行西旋北转，至乙左胁，令成十一迹。 第一阴蹑纪下阳右边阳卧戴，左手第二指阴起，以右手第二三指中间相叉持阳指举，右足於前，左足横复，因举右足三摩甲心咒曰，中胎真人长三寸二分，填甲锋宫，摄录生官三万六千神长守甲体，与甲俱仙，因举右足从甲心度左，东行北旋西转，至甲右胁，令成十一迹。 第二散步还寅更叉甲指，举右足於前，左足横后，因举右足三摩甲心咒迹如第一。 第二散步还中更叉乙指，举左足於前，右足横后，因举左足三摩乙心咒迹如第一。 第三悉复如第二 右过阴三绕周匝阳还阴，左卧阳因起，乘魁上行三气，取上元三咽毕。 右过阳三绕周市阴还阳，右卧阳因起，乘魁上行三气，取上元三咽毕。 甲言天道毕，乙言地道毕，悉三叩齿，各咒曰三五成日月，出窈窈入冥冥真气，入正气，通神气，布道气，行奸邪鬼贼皆消亡，视我者盲，听我者聋，敢有谋图我者反受其殃，便二十四息止小退言太初君令半首咒曰，一君在吾前，二君在吾后，为吾破除灾害恶逆，一切皆绝太阴中，又小退念太素，又退太始君，出朱门便龙倒下阴右边，以左手扶昆仑，右手摩中元，三言左无上，右玄老太上，三取上元气，摩下元咒曰，水流归末，木落归本，金刚火强，土王四季、因度还左，各正身平卧，叉手过泰清，十二叩齿，三五七九，咽鼻微微纳生气，至三五七九二十四气都毕。 还神 第十八便思，还诸神阴阳，各以两手交额上，各思解气无上气正青，还臣妾左肾中。",
      "translated_text": "Proceed with Yi first to initiate the beginning of generation. Next, advance with two, four, six, eight, then retreat and report; proceed with three, five, seven, nine, then retreat and report; proceed with the Three Qi, then retreat and report, drawing in the Upper Primordial Qi three times by swallowing.\n\nStep upon the cyclical marker below, refusing the inverted descent of the Three-Five Dragons. For the first Yin step upon the cyclical marker below the Yang on the right side: lie facing Yang, wearing the Yang upon the head. Raise the Yin with the second finger of the left hand, cross the fingers of the right hand between the second and third fingers to hold the Yang finger, lift the right foot forward, place the left foot horizontally behind, then lift the right foot three times to stroke the heart of Jia while reciting the incantation: *\"Central Yellow Wu-Ji, Lords of the Hundred Nodes, Lords of the Four Seasons and Eight Nodes, One Thousand Two Hundred Officials—assist your servant in crossing beneath the Three Bridges.\"* Then lift the right foot, traverse from the heart of Jia to Jia, turn left to the east, rotate northward, and circle westward to the right flank of Jia, marking eleven traces.\n\nFor the first Yang step upon the cyclical marker below the Yin on the left side: lie externally facing Yin, wearing the Yin upon the head. Raise the Yang with the second finger of the right hand, cross the fingers of the left hand between the second and third fingers to hold the Yin finger, lift the left foot forward, place the right foot horizontally behind, then lift the left foot three times to stroke the heart of Yi while reciting the incantation: *\"Central Yellow Wu-Ji, Lords of the Hundred Nodes, Lords of the Four Seasons and Eight Nodes, One Thousand Two Hundred Officials—assist your ministers in crossing beneath the Three Bridges.\"* Then lift the left foot, traverse from the heart of Yi to Yi, turn left to the south, rotate westward, and circle northward to the left flank of Yi, marking eleven traces.\n\nFor the second dispersal step returning to Yin, cross the fingers over Jia’s finger, lift the right foot forward, place the left foot horizontally behind, then lift the right foot three times to stroke the heart of Jia while reciting the incantation, tracing as in the first instance. For the second dispersal step returning to Shen, cross the fingers over Yi’s finger, lift the left foot forward, place the right foot horizontally behind, then lift the left foot three times to stroke the heart of Yi while reciting the incantation, tracing as in the first instance. For the third dispersal step returning to Yin, repeat entirely as before. For the third dispersal step returning to Shen, repeat entirely as before.\n\nPassing to the right of the Yang, circle the market three times, then circle the market three times. Returning to Yang from Yin, lie facing Yang to rise, ride the *Kui* upward to conduct the Three Qi, drawing in the Upper Primordial Qi three times by swallowing, then conclude.\n\nPassing to the right of the Yin, circle the perimeter three times, then circle the perimeter three times. Returning to Yin from Yang, lie externally facing Yang to rise, ride the *Kui* upward to conduct the Three Qi, drawing in the Upper Primordial Qi three times by swallowing, then conclude.\n\nFor the first Yang step upon the cyclical marker below the Yin on the right side, lie externally facing Yin with the Yin worn upon the head. Raise the Yang with the second finger of the right hand, cross the fingers of the left hand between the second and third fingers to hold the Yin finger, lift the left foot forward, place the right foot horizontally behind, then lift the left foot three times to stroke the heart of Yi while reciting the incantation: *\"The Central Womb Perfected Person, three inches and two fen in length, fills the Crimson Palace of Yi, governing the Three Myriads and Six Thousand Spirits of the Life Officials to eternally guard the body of Yi, ascending with Yi as immortals.\"* Then lift the left foot, traverse from the heart of Yi to the right, proceed southward, rotate westward, and circle northward to the left flank of Yi, marking eleven traces.\n\nFor the first Yin step upon the cyclical marker below the Yang on the right side, lie facing Yang with the Yang worn upon the head. Raise the Yin with the second finger of the left hand, cross the fingers of the right hand between the second and third fingers to hold the Yang finger, lift the right foot forward, place the left foot horizontally behind, then lift the right foot three times to stroke the heart of Jia while reciting the incantation: *\"The Central Womb Perfected Person, three inches and two fen in length, fills the Blade Palace of Jia, governing the Three Myriads and Six Thousand Spirits of the Life Officials to eternally guard the body of Jia, ascending with Jia as immortals.\"* Then lift the right foot, traverse from the heart of Jia to the left, proceed eastward, rotate northward, and circle westward to the right flank of Jia, marking eleven traces.\n\nFor the second dispersal step returning to Yin, cross the fingers over Jia’s finger again, lift the right foot forward, place the left foot horizontally behind, then lift the right foot three times to stroke the heart of Jia while reciting the incantation, tracing as in the first instance. For the second dispersal step returning to the center, cross the fingers over Yi’s finger again, lift the left foot forward, place the right foot horizontally behind, then lift the left foot three times to stroke the heart of Yi while reciting the incantation, tracing as in the first instance. For the third, repeat entirely as in the second.\n\nPassing to the right of the Yin, circle the perimeter three times. Returning to Yin from Yang, lie facing Yang to rise, ride the *Kui* upward to conduct the Three Qi, drawing in the Upper Primordial Qi three times by swallowing, then conclude. Passing to the right of the Yang, circle the market three times. Returning to Yang from Yin, lie facing Yang to rise, ride the *Kui* upward to conduct the Three Qi, drawing in the Upper Primordial Qi three times by swallowing, then conclude.\n\nThe discourse on the Dao of Heaven for Jia is complete; the discourse on the Dao of Earth for Yi is complete. Strike the teeth three times each and recite the incantation: *\"Three and Five form the sun and moon, emerging from the profound and entering the obscure—true qi, entering the correct qi, communicating with the spirit qi, spreading the Dao qi. May all malevolent ghosts and thieves be annihilated. Those who gaze upon me shall be blinded; those who listen to me shall be deafened. Whoever dares to plot against me shall suffer the consequences in return.\"* Then cease with twenty-four breaths, retreat slightly, and recite the incantation of the Supreme Beginning Lord: *\"One Lord before me, two Lords behind me, breaking and dispelling disasters, calamities, and all adversities within the Great Yin.\"* Retreat further to invoke the Supreme Simplicity, then the Supreme Beginning Lord. Exit through the Vermilion Gate, then invert the Dragon to descend on the right side of Yin. With the left hand, support the Kunlun; with the right hand, stroke the Central Primordial. Recite thrice: *\"Left, the Utmost Above; right, the Mysterious Elder Supreme.\"* Draw in the Upper Primordial Qi three times, then stroke the Lower Primordial while reciting: *\"Water flows to its end, wood falls to its root, metal is unyielding, fire is fierce, earth reigns over the four seasons.\"* Then traverse and return to the left. Compose the body and lie flat, crossing the hands over the Great Clarity. Strike the teeth twelve times, then with three, five, seven, nine, swallow the subtle qi through the nose, completing the twenty-four breaths of three, five, seven, and nine.\n\n**Returning the Spirits**\nEighteenth: Visualize the return of all Yin and Yang spirits. Cross both hands over the forehead, imagining the dissolution of the qi. The Utmost Qi, correct and azure, returns to the left kidney of your servants and ministers.",
      "overlap_context": "generates Bingxu, earth first generates Renchen.\nIn the Jiawu cycle, heaven first generates Bingshen, earth first generates Renyin.\nIn the Jiachen cycle, heaven first generates Bingwu, earth first generates Renzi.\nIn the Jiayin cycle, heaven first generates Bingchen, earth first generates Renxu.\nNext, proceed with three, five, seven, nine, then retreat and report; proceed with two, four, six, eight, then retreat and report; proceed with the Five Qi, then retreat and report, swallowing six times.",
      "start_char": 5724,
      "end_char": 6866,
      "start_sentence": 115,
      "end_sentence": 135,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.485801458358765,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清黄书过度仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "三玄老气正黄还臣妾脾中。 二太上气正白，还臣妾右肾中。 五脾气正黄，右上左下，还臣脾中。 四肾气正黑，右上左下，还臣肾中。 阴官左上右下七肺气正白，右上左下，还臣肺中。 六心气正赤，右上左下还臣臣心中。 九泰始气正黄，右上左下，还治玉堂宫中。 八肝气正青，右上左下，还臣肝中。 十太素气正白，右上左下，还治长命官中。 太初气正赤，右上左下，还治绛宫中。 太清玄元气，右上左下，还治臣妾左肾中。 太清气正青，右上左下，还治建高宫中。 太素白气，右上左下，还治臣右肾中。 肺为华盖宫，心为绛宫，肝为紫微宫，胆为长命宫，脾为明堂宫，胃为太仓宫，肾为双合使者，五城十二楼，常与赤子俱各还吾宫室中。 王气 第十九各以两手相摩令热以摩面及身体，春思肝为紫微宫，其色青，润泽有光，青气从鼻中出，大如九寸面镜，渐大覆面，一身郁青。 夏思心为绛宫，其色赤，润泽有光，赤气从鼻中出，大如八寸面镜，渐大覆面，一身通赤。 秋思肺为华盖宫，其色白，润泽有光，白气从鼻中出，大如六寸面镜，渐大覆面，一身皓白。 冬思肾为双合使者，其色黑，润泽有光，黑气从鼻中出，大如五寸面镜，渐大覆面，一身黤黑。 四季土王思脾，为黄庭宫，其色黄，润泽有光，黄气从鼻中出，大如三寸面镜，渐大覆面，一身熏黄。 便以右手自摩两乳间，又下手三摩左右边丹田又偏下，手从脐下摩之，无复数竟，叉手过头，上引气，从两足上，两经中上至关元中夹脊膂三道上。 阴右青左白中黄阳左青右白中黄径入泥丸中，竟发标复，引气还下，阴左青右白中黄阳右青左白中黄从发本额上两眉经面，如中下入口鼻喉咙，经五藏下至两脚，十指复还，上手如前法，三上三下，还藏下丹田中。 〔婴〕儿回 第二十婴儿回，阳屈左脚在右脚下，以右手持左脚大指引之，因右转阴屈右脚在左脚下，以左手持右脚大指引之，因右回转仍以两脚相距。 阳先以右足距阴，左足阴，以右足距阳，左足次又阳，以右足距阴，左足阴，以右足距阳，左足一往一还，窃言左无上，右玄老太上，如此三往三还止。 断死 阳将膝鹄座，以两手从额将上至足，以两手各引足大指坐，又以两手历两膝一过，名断死路。 阴对作因，望元元阳，以两手将丹田经命门敛还至玉父，以大拇指及手胚厉面上，举手高头於下，望玉室，阴卧小举头，望元元腾天阳，腾天踏地，蝶翅而下。 阳两手按黄土名曰踏地，自长跪举手高头名曰腾天，因下手着后名曰蝶翅而去。 阳以左手叉阴，右手俱作龙倒三过。 从头上过，男左回女右转，自还相向。 次重越地网如上，初言左无上，中言右玄老，后言太上。 慈父圣母，解罗脱网，除我死籍，上我生录，次重释罗，初左无上，中右玄老，后太上。 生我者甲子王文卿，师父康，怀我者甲午卫上卿，师母妞，生我活我，事在大道，与父母。 蹑时 蹑十二时相叉阳，左足蹑寅右，在中。 言甲寅道父，十某为臣妾消四方之灾阴，右足蹑申左，在中。 言甲申道母，留为臣妾散四方之祸，阳次卯阴次未咒，如初交巳亥周寅申，每一周咒曰，生我者师父康，怀我者师母妞，生我活我，事在大道与父母。 三周止。",
      "translated_text": "The Three Mysterious Elder Qi, correct and yellow, returns to the spleen of your servants and ministers. The Second Supreme Qi, correct and white, returns to the right kidney of your servants and ministers. The Five Spleen Qi, correct and yellow, right above and left below, returns to the spleen of your servant. The Four Kidney Qi, correct and black, right above and left below, returns to the kidney of your servant. The Yin Official, left above and right below, the Seven Lung Qi, correct and white, right above and left below, returns to the lung of your servant. The Six Heart Qi, correct and red, right above and left below, returns to the heart of your servant. The Nine Supreme Beginning Qi, correct and yellow, right above and left below, returns to govern the Jade Hall Palace. The Eight Liver Qi, correct and azure, right above and left below, returns to the liver of your servant. The Ten Supreme Primordial Qi, correct and white, right above and left below, returns to govern the Longevity Palace. The Supreme Beginning Qi, correct and red, right above and left below, returns to govern the Crimson Palace. The Supreme Clarity Mysterious Primordial Qi, right above and left below, returns to the left kidney of your servants and ministers. The Supreme Clarity Qi, correct and azure, right above and left below, returns to govern the Establishing Loftiness Palace. The Supreme Primordial White Qi, right above and left below, returns to the right kidney of your servant.\n\nThe lung is the Canopy Palace, the heart is the Crimson Palace, the liver is the Purple Tenuity Palace, the gallbladder is the Longevity Palace, the spleen is the Hall of Light Palace, the stomach is the Grand Granary Palace, the kidneys are the Twin Envoys. The Five Cities and Twelve Towers, ever accompanying the Red Child, each returns to my palace chambers.\n\n**Royal Qi**\nNineteenth: Rub both hands together until warm, then massage the face and body. In spring, visualize the liver as the Purple Tenuity Palace, its color azure, moist and radiant. Azure qi emerges from the nose, large as a nine-inch mirror, gradually expanding to cover the face, the entire body suffused with azure. In summer, visualize the heart as the Crimson Palace, its color red, moist and radiant. Red qi emerges from the nose, large as an eight-inch mirror, gradually expanding to cover the face, the entire body suffused with red. In autumn, visualize the lung as the Canopy Palace, its color white, moist and radiant. White qi emerges from the nose, large as a six-inch mirror, gradually expanding to cover the face, the entire body suffused with white. In winter, visualize the kidneys as the Twin Envoys, their color black, moist and radiant. Black qi emerges from the nose, large as a five-inch mirror, gradually expanding to cover the face, the entire body suffused with black. During the four seasons when earth reigns, visualize the spleen as the Yellow Court Palace, its color yellow, moist and radiant. Yellow qi emerges from the nose, large as a three-inch mirror, gradually expanding to cover the face, the entire body suffused with yellow.\n\nThen, with the right hand, massage between the breasts, then move the hand downward three times to massage the left and right sides of the cinnabar field, then further downward. Massage below the navel without fixed count. Cross the hands over the head, draw in qi from above, guiding it upward from both feet along the two meridians to the Pass of Origin, then along the three paths of the spine. Yin: right azure, left white, center yellow. Yang: left azure, right white, center yellow. Directly enter the Mud Pill Palace, then reverse the flow. Draw the qi downward: Yin: left azure, right white, center yellow. Yang: right azure, left white, center yellow. From the root of the hair and forehead, along the brows and face, descend through the mouth, nose, and throat, passing through the five viscera down to the feet and ten toes, then return upward as before. Perform three ascents and three descents, returning to store the qi in the lower cinnabar field.\n\n**Infant’s Return**\nTwentieth: The infant returns. Yang: bend the left foot beneath the right foot, grasp the left big toe with the right hand and pull. Then turn to the right. Yin: bend the right foot beneath the left foot, grasp the right big toe with the left hand and pull. Then turn to the right, returning to the original position with feet apart.\n\nYang: first place the right foot against Yin, the left foot against Yin. Then place the right foot against Yang, the left foot against Yang. Again, place the right foot against Yin, the left foot against Yin. Then place the right foot against Yang, the left foot against Yang. With each movement, recite: *\"Left, the Utmost Supreme; right, the Mysterious Elder Supreme.\"* Perform three cycles of advance and return, then stop.\n\n**Severing Death**\nYang: Assume the crane-knee posture. With both hands, stroke from the forehead upward to the feet, then grasp the big toes while seated. Stroke both knees once—this is called \"severing the path of death.\"\n\nYin: Face the origin of the Primordial Yang. With both hands, gather from the cinnabar field through the Gate of Life, returning to the Jade Father. Press the thumbs and the base of the palms against the face, raise the hands high above the head, then gaze downward toward the Jade Chamber. Lie on the back, slightly raise the head, and gaze toward the origin of the Primordial Yang soaring in the heavens. Soar in the heavens, tread upon the earth, then descend like a butterfly’s wings.\n\nYang: Press both hands against the yellow earth—this is called \"treading upon the earth.\" Rise from the long kneel, raise the hands high above the head—this is called \"soaring in the heavens.\" Then lower the hands behind—this is called \"descending like a butterfly’s wings.\"\n\nYang: Cross the left hand over Yin, while the right hand performs the Dragon’s Inversion three times, passing over the head. Men turn left, women turn right, then return to face each other.\n\nNext, traverse the Earthly Net as before. First recite: *\"Left, the Utmost Supreme,\"* then: *\"Right, the Mysterious Elder,\"* and finally: *\"Supreme.\"* *\"Compassionate Father, Holy Mother, unbind the nets and snares, remove my name from the register of death, inscribe it in the record of life.\"* Next, release the nets again. First: *\"Left, the Utmost Supreme,\"* then: *\"Right, the Mysterious Elder,\"* and finally: *\"Supreme.\"*\n\n*\"He who gave me life is Jiazi, Royal Wencheng. My master-father is Kang. He who nurtured me is Jiawu, Minister Wei. My master-mother is Niu. He who gave me life and sustained me serves the Great Dao, alongside my parents.\"*\n\n**Treading the Hours**\nTread the twelve hours, crossing Yang. Place the left foot on Yin, the right foot in the center. Recite: *\"Jia-Yin, Dao Father, may you, as your servant, dispel the disasters of the four directions.\"* Place the right foot on Shen, the left foot in the center. Recite: *\"Jia-Shen, Dao Mother, may you, as your servant, disperse the calamities of the four directions.\"* Yang next treads Mao, Yin next treads Wei, reciting as before. Alternate Zi and Hai, completing a cycle with Yin and Shen. With each cycle, recite: *\"He who gave me life is my master-father Kang; she who nurtured me is my master-mother Niu. He who gave me life and sustained me serves the Great Dao, alongside my parents.\"* Perform three cycles, then stop.",
      "overlap_context": "pose the body and lie flat, crossing the hands over the Great Clarity. Strike the teeth twelve times, then with three, five, seven, nine, swallow the subtle qi through the nose, completing the twenty-four breaths of three, five, seven, and nine.\n\n**Returning the Spirits**\nEighteenth: Visualize the return of all Yin and Yang spirits. Cross both hands over the forehead, imagining the dissolution of the qi. The Utmost Qi, correct and azure, returns to the left kidney of your servants and ministers.",
      "start_char": 6866,
      "end_char": 8093,
      "start_sentence": 136,
      "end_sentence": 174,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.66528797149658,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清黄书过度仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "谢生 次谢生相叉向寅言，甲寅道父十师言，向有男女生某甲，从臣某乙乞丐过度。 弟子言，臣妾从师某乙乞丐更相过度。 共奉行道德，蒙恩如愿，各得无他，恩惟道父。 十某为臣妾消四方之灾，再拜，次乙卯道父契周十二时咒如寅。 言功 次言功俱东向，叉手长跪，呜鼓十二通。 臣谨启功曹使者，阴阳神功曹，生炁君将吏，中胎真人，赤白君将吏，黄书契令腹目君将吏，此里域中真官注气，监察考召诸官君吏，天师嗣师女师三师门下生气君将吏，阴阳生气度道君将吏，九气丈人逮召君将吏，天地水三官考召君将吏，消灾散祸解厄君将吏，臣妾等某惶恐白，臣以顽愚好道乐生，师言向启有某郡县乡里男生甲乙，从臣妾乞丐过度弟子，言臣妾向从师某乙乞丐更相过度。 谨按师法与甲共奉行道德，三五七九之化，阴阳之施，男女更相过度，蒙恩如愿，精神专固，两相含生，各得无他，谨迁阴阳功曹，生气君将吏兵士，诣上三天曹中官录署，分别迁达，如天曹旧仪，无令失意，以宣劳苦，受功事竟，各亲所职，保守如故，愿令臣等长生久视，过度灾厄，削除死籍，更着生名玉历，为后世种民辈中以为效信，臣甲乙等，诚惶诚恐，稽首再拜以闻。 姓属云云 泰清云云",
      "translated_text": "**Thanksgiving for Life**\n\nNext, give thanks for life, facing the *yin* direction toward *Mao*. Recite: *\"Jia-Yin, Dao Father, the Ten Masters declare: Before you stands a man/woman born as [personal name], who through your servant [disciple’s name] begs for passage and transcendence.\"* The disciple recites: *\"Your servant, through Master [name], begs for mutual passage and transcendence.\"* Together, we uphold the Dao and its virtue, receiving grace as wished, each spared from harm—grateful to the Dao Father. *\"May the Ten Masters, as your servant, dispel the disasters of the four directions.\"* Bow twice. Next, for *Yi-Mao*, recite the Dao Father’s covenant, cycling through the twelve hours as with *Yin*.\n\n**Declaring Merit**\n\nNext, declare merit, all facing east with hands clasped, kneeling upright. Sound the drum twelve times.\n\n*\"Your servant humbly petitions the Merit-Recording Couriers, the Yin-Yang Deities of Merit, the Generals and Officers of the Qi of Life, the True Persons of the Central Womb, the Crimson and White Generals and Officers, the Yellow-Writ Covenant Generals and Officers of the Abdominal Eyes, the True Officials of this domain who infuse qi, the Overseers and Examiners who summon all officials, generals, and officers—those under the Three Masters: the Celestial Master, the Lineage Master, and the Female Master—alongside the Generals and Officers of the Qi of Life, the Generals and Officers of the Dao of Passage through Yin and Yang, the Nine Qi Venerable who commands summons, the Generals and Officers of the Three Officials of Heaven, Earth, and Water who examine and summon, and the Generals and Officers who dispel disasters, disperse calamities, and resolve adversities.*\n\n*With trepidation, your servant [name] declares: Though dull-witted, I delight in the Dao and cherish life. As my master instructed, I now petition on behalf of [prefecture, county, village, and personal name], a man/woman who, through your servant, begs for passage and transcendence. Your servant, through Master [name], likewise begs for mutual passage and transcendence. In strict accordance with the master’s teachings, together with [name], we uphold the Dao and its virtue, embracing the transformations of Three, Five, Seven, and Nine, the bestowals of Yin and Yang, and the mutual passage of man and woman. By grace, our wishes are fulfilled, our spirits steadfast and whole, both containing life within, each spared from harm.*\n\n*We reverently summon the Yin-Yang Merit-Recording Couriers and the Generals, Officers, and soldiers of the Qi of Life to ascend to the Three Celestial Bureaus, where the central offices shall record and transmit our merits, distinguishing and conveying them as per the ancient rites of the Celestial Bureaus, ensuring no intent is lost. Thus, our toils are proclaimed, and our merit duly received. May all return to their duties, safeguarding as before. We pray that your servants may enjoy long life and enduring vision, transcend disasters and adversities, have our names stricken from the ledgers of death, and be inscribed in the Jade Register of life, becoming exemplars among future generations as proof of this covenant.\"*\n\n*[Personal name] and [disciple’s name], with utmost reverence and awe, kowtow twice in submission.\"*\n\n*[Lineage affiliation to be recited]*\n*[Celestial clarity to be recited]*",
      "overlap_context": " Shen, the left foot in the center. Recite: *\"Jia-Shen, Dao Mother, may you, as your servant, disperse the calamities of the four directions.\"* Yang next treads Mao, Yin next treads Wei, reciting as before. Alternate Zi and Hai, completing a cycle with Yin and Shen. With each cycle, recite: *\"He who gave me life is my master-father Kang; she who nurtured me is my master-mother Niu. He who gave me life and sustained me serves the Great Dao, alongside my parents.\"* Perform three cycles, then stop.",
      "start_char": 8094,
      "end_char": 8585,
      "start_sentence": 175,
      "end_sentence": 185,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.918065786361694,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清黄书过度仪.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "太岁云云 次复官言，臣妾所出契令诸官六甲诸神，日行道事，还入中宫，三叩齿咽。 愿念法三上香，一心愿师言，令有男女生甲，从臣妾乞丐过度。 弟子言，臣妾从师某乙乞丐更相过度。 共奉行道德，和合三气，乞长生不死，愿以是功德，归流臣妾，身故归身，归神归命大道，臣妾首体投地，自归三尊，扶是功德，归流臣妾，身愿学道得道，求仙得仙，还年却老，长生无穷，升入无形，与道合同出靖时咒，一君在吾前，二君在吾后，为我破除四方之灾，皆令执伏，两手破除而出户。 言功 上言谨按文书，臣妾以顽愚六蔽，好乐长生之卫，真言要语，奉承黄书契令大度之法，要当奉行，辄有某郡县乡里，男女甲乙年如干岁，好道乐仙，今月日时，诣臣妾求乞过度，奉行道德，三五七九，二四六八三三之气，蒙恩如愿，精神专固，各得无他，谨承师法，拜章一通，愿为臣妾身中三官考召君吏，黄书契令腹目君将吏，中黄戊己百节君吏，真一君将吏，太和君将吏，天节地节人节，三旎建节，四时八节，五行为合，三五功曹斗杓君将吏，中胎真人赤白涌白泄君将吏，九气丈人逮召君将吏，此某郡县乡里中用事，主气诸官君将吏等言功三百等，将吏育功二百等，兵士言功五十等，上诣中官二宫谒受收录署使曹隐职各加其秩等数，加常科比无令恚恨者，某有千罪万过，并蒙赦贯臣妾及某身中，阴阳生气，通利五藏六府，十二宫室，肌骨坚强，面目润泽，横行天下，覆载成就，乞丐为后世种民，令恶逆绝灭，口舌官符，一切执伏以为效信，恩惟慈父圣母，分别求哀操过度，谢生言功，中章一通，上诣上三天曹。 上清黄书过度仪竟",
      "translated_text": "The Year-Star [recited as appropriate]. Next, the officiating officer declares: \"We, your servants, dispatch the contract decrees to all the officials, the Six Jia spirits, and the various deities, commanding them to perform their Way-affairs for the day and return to the Central Palace, whereupon we knock the teeth thrice and swallow the qi. We now offer incense thrice in accordance with the ritual, focusing our intent to petition the master, requesting that those born under the Jia among men and women be allowed to seek passage and transcendence through us. The disciples state: 'We, your servants, beseech Master So-and-so to grant us mutual passage and transcendence.' Together, we uphold the Dao and its virtue, harmonizing the Three Qi, and pray for immortality and freedom from death. May this merit and power flow back to us, your servants—returning to the body upon the body’s end, to the spirit upon the spirit’s end, and to the life upon the life’s end, merging with the Great Dao.\"\n\n\"We, your servants, prostrate ourselves body and head to the earth, surrendering to the Three Honored Ones. May this merit and power flow back to us, your servants, so that in this body we may study the Dao and attain the Dao, seek immortality and achieve immortality, reverse aging and restore youth, enjoy boundless longevity, ascend into the formless, and unite with the Dao.\"\n\n[Recite the incantation of the time of tranquility:]\n\"One Lord stands before me,\nTwo Lords stand behind me.\nThey break and dispel the disasters of the four directions for me,\nSubduing all adversities.\nWith both hands, we break through and exit the door.\"\n\n[Declare the merit accomplished.]\n\nThe officiating officer respectfully states in accordance with the document: \"We, your servants, though dull-witted and beset by the Six Obstructions, delight in the safeguarding of long life. We reverently uphold the essential words of the true scriptures and adhere to the great methods of the Yellow Writ Contract Decrees. We are duty-bound to practice them faithfully. Here, in such-and-such commandery, county, village, and hamlet, a man or woman named So-and-so, aged such-and-such years, who delights in the Dao and rejoices in immortality, has come before us on this day and hour to seek passage and transcendence, upholding the Dao and its virtue, harmonizing the qi of Three, Five, Seven, Nine, Two, Four, Six, Eight, and the Three Threes. By grace, their wishes are fulfilled, their spirits steadfast and secure, each free from harm. In accordance with the master’s teachings, we submit a memorial, praying that the officials of the Three Offices within our bodies be summoned to examine and convene; that the Yellow Writ Contract Decree Generals of the Abdominal Eyes, the Generals of the Central Yellow Wu-Ji and the Hundred Nodes, the True One Generals, the Generals of Supreme Harmony, the Celestial, Terrestrial, and Human Standards, the Three Pennants and Established Standards, the Four Seasons and Eight Nodes, the Five Agents in harmony, the Three and Five Merit Officers and the Generals of the Dipper’s Handle, the Central Womb Realized Ones and the Generals of Red and White Surge and White Discharge, the Generals of the Nine Qi Venerable One and the Summoning Officers—all those who serve in such-and-such commandery, county, village, and hamlet, and all the qi-officials and generals—be recorded for three hundred merits; that the generals and officers be credited with two hundred merits; and that the soldiers be recorded for fifty merits. May they ascend to the Central Palace and the Second Palace to receive, record, and register their duties, their ranks increased accordingly, their regular allotments augmented, and none left resentful.\"\n\n\"We, your servants, have a thousand transgressions and ten thousand faults, all of which we pray may be pardoned. May the qi of life of yin and yang flow freely within us and within So-and-so, harmonizing the five viscera and six bowels, the twelve palaces, strengthening sinews and bones, moistening countenance and complexion. May we traverse the world unhindered, our undertakings accomplished under heaven and earth. We beseech that we may become seed-people for future generations, that evil and rebellion be eradicated, and that all slander, legal writs, and adversities be subdued as proof of this covenant.\"\n\n\"With compassion, O Merciful Father and Holy Mother, we humbly seek passage and transcendence, repenting of our transgressions and declaring our merits. We submit this central memorial, which ascends to the Three Celestial Bureaus of the Upper Heavens.\"\n\nThe Rite of Passage by the Yellow Writ of the Highest Clarity is thus concluded.",
      "overlap_context": "return to their duties, safeguarding as before. We pray that your servants may enjoy long life and enduring vision, transcend disasters and adversities, have our names stricken from the ledgers of death, and be inscribed in the Jade Register of life, becoming exemplars among future generations as proof of this covenant.\"*\n\n*[Personal name] and [disciple’s name], with utmost reverence and awe, kowtow twice in submission.\"*\n\n*[Lineage affiliation to be recited]*\n*[Celestial clarity to be recited]*",
      "start_char": 8585,
      "end_char": 9235,
      "start_sentence": 186,
      "end_sentence": 193,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.306389570236206,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清黄书过度仪.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}