{
  "source_id": "上清高圣太上大道君洞真金元八景玉录",
  "source_file": "chunked_daozang\\上清高圣太上大道君洞真金元八景玉录.json",
  "total_chunks": 7,
  "total_original_chars": 7076,
  "total_translated_chars": 49402,
  "total_translation_time": 283.4458255767822,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\上清高圣太上大道君洞真金元八景玉录.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Clarity Highest Sage, Most High Lord of the Great Dao, *Dongzhen Jin Yuan Eight Radiant Jade Register***\n\n**Scripture Title:** *The Supreme Clarity Highest Sage, Most High Lord of the Great Dao’s Dongzhen Jin Yuan Eight Radiant Jade Register* (abbreviated as *Dongzhen Jin Yuan Eight Radiant Jade Register*).\n\nAuthor unknown, approximately dating to the Eastern Jin or Southern Dynasties. A foundational scripture of the early Supreme Clarity tradition. Originally one scroll, later erroneously divided into two. Based on the text from the *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n---\n\nThe Eastern Flower Supreme Immortal calls it the *Eight Hidden Writings of Supreme Simplicity*; the Southern Flower Supreme Immortal calls it the *True Scripture of the Great Cavern*; the Western Flower Supreme Immortal calls it the *Golden True Jade Radiance Illuminating Heaven’s Cavern-Observing Jade Scripture*; the Northern Flower Supreme Immortal calls it the *Desolate Nine Luminaries, Expansive Seven Mysteries Upper Scripture*; the Supreme Immortal of the Jade Emperor’s Central Flower calls it the *Most High Sage’s Eight Radiant Jade Register*.\n\nThe Central Yellow Elder Lord and the Southern Pole Primordial Lady concealed and recorded these two scriptures within the Jade Simplicity’s Jasper Terrace and the Mystic Cloud Feather Chamber, sealing them in a fragrant, dense casket with the jade seals of the Three Primes of Jade Clarity. They then commanded seven hundred Jade Maidens of the Northern Frigid Golden Terrace and seven hundred Jade Lads of the Western Numinous Jade Palace of White Emptiness to attend and guard the *True Scripture of the Great Cavern* and the *Jade Register of the Great Concealment of the Most High’s Void-Born* therein.\n\nThe Supreme Clarity Highest Sage, Most High Lord of the Great Dao, was the essence of the Two Dawns’ *qi*, the purple mist of auspicious clouds, his jade radiance blazing, golden reflections streaming with truth. Congealing transformation, embracing refinement, he enfolded the mysterious spirit, entrusted to a mother’s womb, and took human form. His taboo name was [obscured], his style *Shang Kai*. His primordial mother carried him for three thousand seven hundred years before he was born beside the Crimson Mystery Slope of the Floating Mount Luo in the Western Heaven’s Yu Cha Mountain.\n\nHis primordial oversight shone at the first dawn; the Eight Caverns spread through the Great Beginning. Surveying the nine wefts of the cosmos, he descended to the sweet springs of the Li River. Roaming freely to nurture life, he gathered truth and consumed essence. Soaring in mystery, spreading his plumes, he rinsed and sipped from the Great Clarity. Receiving the register from the Purple Emperor, he was appointed to govern the Highest Immortals. Stirring the vermilion winds, he convened the ten thousand spirits. The dark abyss and towering peaks resounded with the great sound’s boundless fragrance. Yearning for the jade truth of the void’s rosy clouds and the numinous dawn of Supreme Clarity, he then cast aside worldly thoughts, trod the void, and dwelled in truth. Plunging the vermilion jade tablet into the depths, he doffed his cap of the Nine Heavens. Gazing upon the bright hills and mountains, he traversed the myriad peaks of the caverns. His spirit grasped the Five Luminaries; his form coiled with the Seven Origins. Moved by the essence of the Great Stillness, he yearned to summon the Mystic Clarity. Thus, his vast radiance stilled its brilliance; flying pearls bathed his spirit. Hidden mushrooms formed their splendor; night-born jewel lights arose. At dawn, he explored the flowery morning, consuming the morning’s supreme essence. Riding clouds and descending mists, the Eight Ways blazed with light. Divine lightning whirled in the winds; green *qi* shrouded the depths. His vast gaze spanned the Eight Vastnesses; the Nine Origins encircled him. Ascending the purple steps again, thrice flying through the jasper towers, four times attending the Great Simplicity, five times feasting in the gem chambers, he grasped the Five Elders, plumbing the caverns’ utmost mysteries. The Highest Lord of the Heavens, none who did not tread this path.\n\nHis wisdom flowed through the jade chapters; he savored the subtle flavors. Lingering in the hidden void, he turned toward the drifting, ethereal clouds. His form sank into the Eight Mysteries; his light concealed the ten thousand sources. Vast and boundless, profoundly penetrating, each strand of rosy clouds soared. His spirit’s refinement awakened outwardly; his *qi* suffused the tranquil realms. In harmony with the great transformation, he roamed the vastness of the original void. The great emptiness bore his intent; form dissolved with the passing hues. The pure wind filled the peaks; his tranquil mechanism governed joy. Heaven’s sounds rang clear; the lofty path was deep and distant. His mysterious heart filled with rare resonance; his soaring brush flourished amid auspicious mists. The dragon lurked in a single surge; the phoenix’s grace spread faintly. Thus, he embraced the Four Greats, encompassing the weak and lost. Thereupon, he received the scriptures of Jade Emptiness, gazing upon the scenes of Supreme Clarity, and was enthroned as the Most High Sage, Jade Dawn Lord of the Great Dao. He governed the Palace of the Elixir Pearl Sun, dwelling in the Sevenfold Radiance Purple Chamber. Three hundred thousand jade lads and maidens attended him, dispersing incense.\n\nHe wore a robe of nine-colored parted silk and a gown of flying frost-pearls. His cap changed a hundred times in an instant; his belt bore the Morning Light Sun Bell and the Sword of Nurtured Essence. His dominion extended infinitely, serving the Void Emperor. At times, he transformed repeatedly with the constant flow, entering the mists with the wind. Stirring the Three Ways, he gazed below upon the Eight Beyonds. Ascending the hills and mounds, he staffed the myriad lands. The mysterious chant resounded in four directions. Leading and uplifting with grand intent, his roc’s wings brushed the Eight Supports. Harmonious sounds flowed and gathered; he entrusted the melody to the clouds and rosy clouds above. Briefly releasing his distant, subtle elegance, he gazed down upon the vast earth, advancing ever onward.\n\nTo resolve doubts and illuminate delusions, to revere the numinous virtue’s model: he illuminated dragon patterns in the azure abyss, blazed with rosy clouds over rivers and marshes. He bathed his heavenly countenance in orchid jade, emitted golden essence from secluded valleys. Riding the Great Compliance to govern the supreme images, roaming the mysterious spirit to blend the Five Impurities, he stilled the Nine Falls without wearying his feet. Congealing his form in the center, he upheld honor and disgrace—such was the Most High’s subtle teaching.\n\nAs for his delighting in dwelling in numinous observances, feasting in the Seven Awakenings, his mechanism’s edge swift as the wind’s tip, plumbing the spirit’s utmost mysteries: his vast pattern swirled and stilled, his emptiness shifted through hidden realms. The spirit’s waves were rare and silent; the Nine Sounds hung in suspension. Having forgotten the mysterious stillness, he lodged in the flowery garden. Brightly shining, the dharma’s standard; clearly luminous, his merits complete. Subtly arousing the profound principle, his doors opened to the myriad thousands. Dancing scenes fanned the void; riding emptiness, he embraced the mist. Coiling through the Seven Records, he ascended the register’s summit. Numinous talismans blazed and scattered; hidden chapters unfolded. Encompassing the sunken and obscure, he turned the stagnant wheel, weaving together the Five Images, leading the hosts of heaven—such was the Most High’s transformative governance, by which he oversaw the multitudes.\n\nAs for dispersing teachings to nurture form and hastening to rescue the spirit’s *qi*: he clearly established the Three Palaces, the solitary peace of the profound spirit. The Two Compliances were vast and bright; the Primordial Harmony gathered in joy. Casting aside杂念, forgetting burdens and relinquishing externals, he traversed the hidden void, accumulating mysteries to achieve greatness. Exhaling the old, receiving the new, he gathered essence and expelled filth. Dispelling the tangled thoughts of deviant intentions, he treasured the preciousness of true uprightness. Rinsing the morning’s splendor to summon the Sun Emperor, he drew in the night’s brightness to embrace the Moon Pearl.\n\nAmidst the vast expanse, Yu Yi’s horizontal traverse ignites the radiance of Supreme Non-Being; entwined jade brilliance inhales the dawn, as twin luminaries conjoin in their celestial sojourn. Flying zhi-mushrooms unfurl their dark petals, their numinous essence cloaking the mountain peaks; phoenix brains beat their wings upon the golden calendar, while scaled spirits prick their ears to rouse their forms. Night’s glow illumines the Five Peaks, its resplendent tendrils trailing to weave blossoms. Hidden dragons cry amidst the clouds, and jade fruits rise in startled encounter.\n\nThen do spirit melons spread across the fields, purple stalks flourish on mist-laden mounds; cinnabar scatters in a thousand unions, jade clusters hang dense upon the cliffs. Treading the Seven Origins, one ascends the void to ride the floating clouds. In the west, the Numinous One offers vast nectar; in the east, vermilion libations are established. Drinking deeply of cinnabar jade-essence may transform the Nine Mysteries; savoring tiger froth suffices to encircle the decaying husk.\n\nBehold the Four Petals of Purple Nectar, the Three Flowers of Dark Perfection: azure vases float with zhi-mushrooms, dark branches gleam with langgan jade. Pristine abundance fills the void, crimson blooms with fivefold splendor. Drawing from the dark channel’s sweet dew, one alters white-haired age to youthful prime.\n\nShould one ascend the towering peaks, the vast harmony of heaven and earth unfolds; nurturing the radiant, delicate silk, the divine branches unfurl their luminous fans. At dawn, ethereal herbs flourish; at dusk, cinnabar orchids fall through the forest. Spreading numinous majesty, the cliffs stand empty, wreathed in drifting mist. Offering fragrant incense in the valley, presenting blossoms and aromatic essences, one congeals form in purple and azure, crimson clouds and golden boughs. The dazzling essence gathers at the root, as Mount Taihua exhales and inhales. Seven darknesses and six blessings wield wisdom’s eight liberations; dwelling in subtle clarity, one soars afar with effortless grace. Cutting off the mind’s dark stillness, calming its rhythms, one turns back the infant’s bondage.\n\nThereupon, settled awareness engenders trust; luminous order aligns with the equal. Jade perfected ones greet the dawn, bathing upon the numinous mound. Pure guests ascend in audience; with focused mind, they open to joy. The flourishing Three Passes pair with the luminous shadows, weaving in harmony. The inner resonance of profound stillness embraces the lofty and gentle song. Wielding the banner, they summon the immortals; refining the spirit, they tread the primal. Traversing the Nine Heavens in stately array, the Seven Sages ascend the ladder, their noble bearing a standard. With the bright model established, they govern the Four Floatings in unison.\n\nThen, in tranquil chant within the jade hall, one delights in the Great Possession. A numinous breeze scatters the light; six clouds arise at the window. Leisurely at the zenith of dawn, gazing down upon the lofty mounds, the myriad valleys stretch desolate, reins gathered over the empty fields. Casting the wheel into the numinous ford, flying beasts howl in procession; divine lads flank the canopy as the Western Flower feasts upon stone. Fragrant mists coil about the lapels; aromatic vapors arise from the vast and solitary mountain vessels. Gold hides within jade thickets; the Five Symbols and Eight Vastnesses settle their luminous union. Roaming to observe the hidden mysteries, one thus attains enduring permanence.\n\nAt times, one unbinds the sash to the myriad streams, sun’s journey and moon’s revolution their companions. Summoning the wind to fan the wings, one drifts through ninefold transformations. Bright clouds mirror the radiance; profound darkness enfolds the profound. The cloud chamber contains the luminous; gathering the true, one orders the principles within. In the secluded abode of the abstruse, the spirit pervades the void’s expanse. Inner radiance reflects within; the Three Palaces remain pure and fresh. A thousand ailments do not arise—thus is there constant healing.\n\nThen, brandishing the staff through the Seven Gardens, raising the azure banner with vermilion tassels, one soars through the void, dancing the pennants, driving the light to race the whirlwind. Lingering amidst the eight mists, circling the empty paths, one pins the sun’s splendor to the hair, gathers the moon’s fallen pearls. Plucking the langgan fruits from the crimson grove, feeding upon the purple lotuses of the Dark River, one reclines in the numinous carriage, governing the imperial scriptures. Myriad spirits enter to pay homage; the Five Powers grasp the talismans. Supreme perfected ones attend the dawn; the Heavenly Sovereign embraces the charts. The Four Supreme Ones proclaim the decrees; the Central Scroll establishes the model. The Six Records flow to fullness; refining the *qi*, one embraces the void.\n\nThereupon, gazing into the void and lifting one’s voice, one chants and declares: If you wish to become a perfected one, you must meditate upon the Lord Within the Sun, driving dragons and phoenixes to harness the celestial radiance and clouds. Journey east to the Sparse Grove, then enter the Emperor’s Gate. If you must ascend to heaven, contemplate the Lady Within the Moon, driving ten flying dragons to harness my flowing essence. Journey west to the Six Ridges, then proceed to the Emperor’s Hall. With focused root and moving thought, ascend to pay court to the Jade Sovereign. The verdant expanse of Yu Yi treads the light; the scattered brilliance of Jie Lin reaches the dawn. The Nine Latitudes cast their traverse; the Seven Symbols flash like lightning through the dark. Numinous winds intermingle in their drumming; the Two Dawns and Eight Paths gallop in purity to attend the court. Three clouds blaze with splendor at the northern pole; ten thousand dragons gallop and sing in chorus. The Eastern Peng beats the rhythm; purple blossoms unfurl their petals. Soaring high, the round essence unites; the luminous void brings carefree wandering. The Twin Sovereigns join their chariots, outpacing heaven in their flight.\n\nThen, the hidden and the manifest merge in ease; spirit and *qi* dissolve into equilibrium. Numinous guests stand in solemn array, parting the jade courtyard’s pristine expanse. In the left hand, the dragon talisman; in the right, the tiger scripture. Eight winds pierce the void; their resonance flows through the Five Cities. Dark and yellow brilliance scatters, dense as a net of stars. The Three Treasures intermingle their fans; treading the grand, one searches for jade. The lofty ancestor plucks the blossoms; clanging, the jade rings resound. Dark tones continue to rise; the golden root’s langgan chimes. Simurghs dance upon the cloud pools; flying phoenixes sing their melodies. Purple cassia and orchids revolve, encircling the void and the numinous. Leaping through the great auroras, their radiance illumines the Supreme Clarity. The dragon’s path unleashes the whirlwind, startling the Eight Luminaries. Accumulating kalpas upon kalpas, one preserves this benefit and integrity.\n\nAt times, the teachings transform and divide the Dao, borrowing names to shift forms. The Six-and-One restrains the unformed; dark clouds nurture completion. Flying cinnabar, water jade, leaping through snow and frost, the numinous blossoms shoot forth in eight directions; purple wanderings traverse the nine expanses. Lingering in chaotic turns, veiled in the Three Yellows, crimson essences transmute the spirit; the Nine Jades emit their rays. Langgan jade transforms a hundredfold; azure reflections mirror the waters and sunlight. Eight jades take flight in the radiance; elegant stamens yield green nectar. At dawn’s curve, one rides the dawn; flowing gold and moonlit brightness. Dark ford and jade libation, numinous reflections of the Five Lords. Light discards its resonance; one chant summons eight unfoldings. Waves like fire essence, Yi and Li’s jade ginger, golden *qi* at the hundred convergences. Relics bind the fragrance; luxuriant, the numinous treasure transforms the literary patterns. Once the knife and measure are arrayed, longevity becomes immeasurable—truly the rare medicine of the true origin, the secret treasure of the Supreme Emperor.\n\nOr refining the five clouds and jade blossoms, one ingests the numinous gold’s purity. Vermilion souls and green lotuses, lush blossoms and azure essence, southern candles and kingfisher-green *□*, cinnabar sand and empty azure. At dawn, one gathers the Five Dawns’ jade pool and pristine nectar—this too can reverse the old and restore the new, transforming age to regain infancy.\n\nThus, the Four *Qi* harmonize their movements; the Eight Winds fan the void. Gazing in leisure upon the purple groves, one shakes the robes at the nine corners. Fusang flourishes in lushness; the Jianmu dances upon the mound. Myriad perfected ones circle in procession, dipping their wings in the azure streams. A hundred grasses knot their branches; the Five Blossoms radiate their splendor. Ming pods sprout at dusk, floating in rhythmic accord.\n\nShould one ascend the fast and enter the chamber, first expel and dispel to ward off demonic afflictions, then guard against all trials. Only then, with eyes closed and inward gaze, press the heart and invoke, facing north to strike the teeth thirty-six times. Whisper to the Jade Clarity’s Radiant Primordial Sovereign:\n\n\"The Six Heavens’ Great Demon Kings, bound in the dark and desolate void,\nGiant beasts of crimson armor, four-throated venomous dragons,\nWhite eagles shrieking aloft, claws brandished and bristles raised—\nAll myriad spirits lurk in concealment, vanquishing evil and shattering demons.\nLet the Heavenly Soldiers’ wrath arise, the Five Peaks bow in audience,\nWind and fire launch their campaign, the Nine Heavens fan their radiance.\"\n\nThereupon, bolt the gates and seal the vision, refine the spirit and guard the essence. Harmonize the Three Palaces, meditate upon the Heavenly Court. The Thearch holds his banquet; his ministers and aides illumine all. Harmonizing the qi-fluid, one pays homage to the Nine Numinous Ones. The Five Spirits settle in turn; the spring’s source flows full. White Prime unfolds the true, Flourishing Hero spreads its life. The cavern’s light shines in concealment; the Four Powers attain balance. Inner treasures knot their radiance; one sings the Cavern’s purity and plays in clarity. The Great Simplicity arrays its charts—longevity shall not falter.\n\nAt times, one gazes broadly into the vast emptiness, the clamor fading beyond the Milky Way. Riding the wind, one shakes the reins at the dawn’s edge by the azure shore. The heart unfolds across the Eight Wilds; the spirit alone beams in splendor. Ascending the numinous terrace of Emerald Waters, one gazes upon the Purple Mansion of the Azure Isle. Vast and distant, rosy clouds scatter like mist, trailing vapors carve the skies. Veils of radiance shimmer and blaze. Glancing at paired reflections, a myriad dawns flicker in an instant. Ethereal tones race and intertwine; the Dark Wind joins in praise. The Primordial fans its might; the sun’s glory blazes. One roams the celestial vastness—thus is eternal feasting achieved.\n\nShould one gather jade from the Dark Mound or pluck mushrooms from the Jade Garden, the lofty perfected ones, towering Celestial Worthies, their jade blossoms winging the light, golden truths encircling their chariots, crimson waves surging from the peaks, the heart leaping in harmonious freshness—then, with hands plucking the Seven Luminaries and stilling the Eight Gates, one floats upon the Gourd River and treads the peaks beyond mountains. Leading and ordering the highest concord, chewing and savoring the profound mystery, grasping the ritual implements, embracing essence and containing spirit, one soars aloft, borne by the wind, following the new. Vast and resplendent in virtue’s pattern, the hidden blossom unfolds in wholeness—thus accumulating the cedar’s age in long contemplation, ever preserving the flow of benefit.\n\nAt times, amidst verdant groves and towering cliffs, where idle light knots the mounds, one wanders in dark enlightenment, observing the transformations of the Jade Void. Ten thousand measures are not real; the root-substance lies in nothingness. Divine maidens unfurl their talismans as the divine chariot whirls in the gale. Feathered skirts pool in the heavens; kingfisher capes spread in shade. Chanting high to the Jade Clarity, one expounds the origins of the primordial. The Grand Tenuity attends the banquet; the Five Sovereigns illumine the pivot. The cavern’s mechanism declares the obscure; the supreme image unites the distinct. Jade lads pluck the *ao*-zither; the Northern Flower unveils the zither. Heavenly maidens array themselves in ranks, a hundred hundred in perfect alignment. The Dark Harmony sounds in fourfold resonance; a thousand tones chime and scatter. Purple phoenixes preen their wings, rinsing their flutes in unison. Cloud phoenixes advance in staggered flight, beaks poised to sing. Divine feathered skirts call out; flying chimes raise their *zheng* and *shang* notes. Azure dragons roar aloft; clustered clouds rise in thickets. Divine tigers roar in fury; the Eight Winds fan the courtyard. Bronze is struck and jade shattered; bells are tapped and chimes clapped. Vermilion mists surge in billows; the Three Simplicities—green and azure—glow. Round essences slumber in radiance; flying rosy clouds gaze into darkness. Then the Supreme Thearch descends from his seat, scattering his spirit and releasing his numen. Gazing upon the celestial talismans, luminous and resplendent, he points left to the Southern Chamber and right to the Literary Prosperity. Advancing toward the wondrous and lush, meeting the rhythm in harmonious flight, he wanders the morning’s depths, pacing the azure waves. Qi courses through the secluded halls; □ brushes the void. Banners are raised and standards halted; flags are grasped to summon the light. Lingering in inward chant, heart harmonized and soul at ease, the gaze encompassing all—one attainment endures forever.\n\nThereupon, each sings the wondrous subtleties, discoursing on the primal principles of the numinous. Jade echoes resound across the Eight Directions; golden tones shake the courtyard. The Great Simplicity is unfolded; the hidden and obscure are guided forth. Myriad embellishments flourish in profusion; whispered words continue to appear. Radiant branches scatter in abundance, the essence of utmost subtlety. Encountering the towering and dense in throngs, branching and entangled in scattered glory, one surpasses the southern glow of the Gate of Heaven, or seems to circle the red blossoms’ beams. Flowing light gathers in lushness; flying mists billow in haze. The Nine Hues shine upon the Thearch’s chart; the Purple Void’s harmony is sung in resonance. Broad hearing attends the jumbled sounds at the Jade Terrace; stones are struck and waters boil in the Golden Hall. Five Clouds coil the canopy; Eight Simplicities illumine the chapters. Summoning the sun and moon’s lofty essence, commanding the Seven Lodgings’ numinous net, grasping the tally to pace the Six Heavens, brandishing the vermilion cords in blazing splendor, dancing the Ten Absolutes beneath the Northern Candle, waving the flowered banners in the White Void—riding the divine wind to gaze upon the Eight Sceneries, what need has one for the Nine Phoenixes or Eight Wolves? The green canopy dances in distant leaps; the crimson standards flutter in reverse ascent. Nine reins in one accord, treading the clouds of heaven in galloping flight. Plucking the azure cinnabar’s curling petals, scattering the flying blossoms’ returning fragrance, suspending the five-fold refined pear to soften the waters, the Nine Jade Gems merge in cavernous harmony to form jade. Fire-rubies yield pearls; flowing gold gathers radiant jade. Turning toward the Northern Ridge of the Curved Array, one scatters the stars of the dawn’s farthest reaches. Grasping the wheel of the vast emptiness, one circulates the qi in campaign. Towering and profound, the true and mysterious—laws and constants are fulfilled. Aligning with the highest concord, how could one’s destiny ever falter?\n\nShould the primal stillness wander the marsh, subtle tones stirring clarity, one grasps and savors the Three Wisdoms, reflecting and embracing the Yellow Tranquility. Vast is the sagely mystery; subtle the dark script. The cavern arises from non-being; the empty and idle unfurl their banners. Firmly grasping the spirit’s court, entwining the numinous pass, the outer barbarians of the Four Mirrors—treasures lie in the Six Origins. Radiant and resplendent, jade virtue’s form and vessel suddenly extend. This may be called warmth and harmony in ten thousand patterns, guiding the reins to steer the round.\n\nAs evening’s twilight settles, one completes the Eight Transformations. Embracing life in pure tranquility, the spirit’s traces stretch into the distant. Gracefully unfolding the principles of transformation, plumbing the obscure to the utmost, one’s wondrous workings and marvelous subtleties lodge in the flowing brush. Dragon blossoms gleam in embroidered clouds; the Five Radiance’s hidden leaps dance in the great rosy clouds. Cinnabar light flashes like lightning; the Scenery Wind fans harmony. A lofty gathering in the Upper Palace, floating waves upon the empty waves—vast and distant, the dark and true bathe their qi in the Jade River. Shaking and draping the Eight Paths, fragrance flows through the celestial ridges. Thus is jade ordered, daily renewed without abiding. Therefore, accumulating kalpas of numinous layers, there shall be no end thereafter.\n\nHerein lies the method of refining the soul and restraining the poised spirit, of congealing the spirit within the womb—though it unfolds in but a few dozen words, it can settle the body and unite with the Dao, scattering all demonic hosts. This is the supreme incantation of the celestial realms, the esoteric revelation of the Mystic North beneath the Dragon Candle. Its purport cannot be expounded, its layered phrases cannot be translated; whether the cries of birds or beasts, the entwining winds or descending clouds, the hidden chants of the Nine Heavens—none can be fully interpreted.\n\nShould one briefly gather the wondrous brushstrokes, drawing qi into the cavernous abode, encompassing the Nine Nether realms and expanding the inner resonance of the obscure melody, then the jade tones and golden currents may be bestowed upon the southern portal. On the day of one’s original destiny, or in a place where the heart trembles, one seals the passes and concentrates the essence, striking the teeth thrice, settling the qi and regulating the breath. Facing north with upright posture, the heart holds these subtle words:\n\n*\"Luole Nahuan, Fangnai Elian, Banmu Bosui, Danhan Jushe,\nChicha Baixiang, Danli Damo, Zhenyun Guangfu, Xuling Zhixiao,\nZonglan Jixiong, Fadong Changyou, Wumian Zhongpin, Lingkuo Fantiao,\nBaifang Qiantu, Moni Huoliao, Tiandi Qidu, Shu yun neng diao?\"*\n\nThus concludes the invocation. To resolve myriad obstructions, sever stubborn doubts, harmonize sounds with rhythm, and manifest the Four Radiance in brilliance—where celestial luminaries shift and gleam without transmission or teacher—the Eight Winds revolve and dissolve. The Heavenly Emperor then proclaims:\n\n*\"Luolai Xiuguang, Yuxu Sisi, Jishu Batan, Bingandingwei,\nYousheng Wuying, Xuanjing Zhisi, Youhuo Jidong, Wufei Wochi,\nHunxing Tongcai, Yan neng jizhi?\nJiayan Hanjin, Zuoqi Dayi, Erchang Yuewu, Sanhe Wuli,\nDaluo Liuhui, Kongtong Jiuzhuan, Qiqing Chengguang, Siyuan Qianquan,\nTishen Wangjue, Wanlü Feijin, Huawen Kongsi, Yulang Zazhen,\nYinyun Chongxuan, Miaonei Lunyun, Qiji Dongbiao, Mingxin Yuannin,\nXichen Lu’an, Yuanzong Guidai, Renxing Toukong, Zaoshen Neiwai,\nMingmo Miaopian, Ziran Gaohui, Chongling Dujing, Huihui Yuantai,\nSilü Shouqi, Yunze Xiuyong, Jiuguan Yuanyuan, Xin yi huojing,\nXuyan Laoluo, Erchen Huanying, Yunti Qianshi, Wupei Ercheng,\nBajie Sandao, Hushen Yijing, Gaode Yuanyao, Zhongmen Yunling,\nJikong Yiwu, Zuowu Liangming, Taixuan Yibiao, Zhitiao Youqing,\nYouliao Zhaozhuo, Tingyin Heqing, Erdu Qijie, Jinai Wusheng,\nBiaoxiao Elie, Youzhong Poxu, Damiaosui Chang, Xuanjing Weisong,\nChenji Shihao, Zuoyu Benwu, Bu gui Changzhen, Li gui Moyu,\nDahui Yishi, Yutian Tongxiu, Wanshi Baixiang, Moneng Huiyu.\"*\n\nWhen true subtleties and numinous verses arise without bound, in the indistinct and wondrous caverns, gazing loftily upon the circular realm—seizing this divine resonance, all categories dissolve into nothingness. With awe, one ascends the heavens, fragrance wafting and flourishing. Looking up, one grasps the celestial measures in the remotest spaces; looking down, one rescues the myriad harmonies from feeble decay. The Four Wheels radiate splendor, the true origin drifts and shifts; the Great Marshal holds the helm, grasping the register of luminous scriptures. Riding the whirlwind and spurring the light, dragons soar through the Nine Heavens. The dharma drum resounds through the caverns, the luminous disk gleams resplendent. The Vermilion Emperor of the Southern Palace shines forth, floating the Seven Canopies upon the Jade Ford. Fanning and casting feathered banners, one lingers by the numinous source. Green clouds trail the standards, the northern winds stir the throng. Flowing bells and arrayed arrows, the Whirlwind Sovereign’s pennants arise. Guiding the myriad transformations, they respond to the rhythm and fan the mist. The Vermilion Tiger flanks the light, the Poison Dragon wings the chariot, awaiting the missteps of the malevolent and overawing the great villains of the Six Heavens. Evil is inevitably punished, good inevitably preserved. A thousand demons bow their heads, mountain spirits tear themselves apart. Echoes drift through the Great Void, the Two Effulgences gleam and scatter their brilliance.\n\nThen, roaming among the myriad beings, one’s form drifts through ten thousand dawns. Above, one ascends the Jade Empyrean; below, one reaches the furthest dispersals. Assuming temporary forms, a thousand arts display their wonders; bestowing blessings upon the multitudes, each regains their former state. From the highest to the lowest, the black-haired masses open and encompass the primordial life. Names are inscribed in the registers, spirits are measured and essences probed. Those who can apply this method ascend to the Upper Clarity, chanting the mysteries of the Cavernous Origin. Emerging from obscurity and entering darkness, one compiles the *Supreme Scripture of the Eight Effulgences of Jade*, revealing the marvels of the Perfected Ones and illuminating the wisdom of the Emperor. Having obtained this scripture, you are titled the Left Minister of Primordial Effulgence. Cultivating the Cavernous Dao, you become the Left Duke of the Upper Clarity, circling the Three Primes and roaming the Purple Empyrean.\n\nTo govern the multitudes is to embrace and guide the myriad streams, to regulate the movements of the ten thousand things, to survey the vast emptiness and illuminate the Eight Beyonds. One exhausts the revered foundations of the Empty Same and encounters the ultimate luxuriance of the Mystic Radiance. Clouds converge at distant shores, winds traverse the gathering mists—rarely does one attain such lofty tranquility amidst the rosy clouds, pointing to the refined governance of the Two Modes.\n\nHow could one remain silent in the Three Clarities, allowing the Six Qi to drift aimlessly? Thus, one binds the heart to the level observation, brightening the spirit across the Ten Peaks. Thereupon, the Eight Emperors are commanded, and the myriad spirits are summoned. The yin armor of the water sources is notified, the guardian lords of the Five Emperors are called forth. Rivers and seas are arrayed in solemnity, the thousand Perfected turn the Wheel of Principle. The fire armor sharpens its edge, the Heavenly Soldiers wield their axes. Mountains and peaks open their paths, the sun and moon illuminate the dawn.\n\nThen, the Supreme Lord of the Great Dao sets forth to wander the Nine Empyreans, gazing upon the spirits of the outer heavens, gathering the hidden verses from the Jade Void, seeking the concealed talismans from the Purple Emperor, and illuminating the Eight Directions to thoroughly penetrate all regions. Thereupon, the Supreme Lord of the Great Dao first mounts the chariot of a single effulgence, driving the Eight Primes of Purple Clouds. He summons the Subtle Emperor of the Vast Granary, named Luzi of the Abundant Register, and together they journey eastward to the Jade Terrace of the Heaven of Joyous Forests, where they behold the Supreme Lord of the Jade Clarity and the Purple Dao, the Empty Sovereign, and receive the Hidden Talisman of the Nine Radiance of the Great Dawn.\n\nThen the Supreme Lord of the Great Dao mounts the chariot of twofold effulgence, driving the Seven Primes of Crimson Clouds. He summons the Subtle Emperor of the Central Vermilion, named Ding Wuyan, and together they journey southward to the Lofty Peach and Fierce Surge Dragon Net Heaven, where they behold the Jade Clarity Winged Sun Empty Sovereign, the Supreme Lord of the Great Dao, and receive the Hidden Talisman of the Contemplation of the Numinous Origin of the Dawn.\n\nNext, the Supreme Lord of the Great Dao mounts the chariot of threefold effulgence, driving the Six Primes of Red Clouds. He summons the Purple Tenuity White Emperor, named Qu Yuanshi, and together they journey westward to the Azure Fall and Empty Song Jade Pear Heaven, where they behold the Jade Clarity Prosperous Yang Origin Empty Sovereign, the Lofty Primordial Lord, and receive the Hidden Talisman of the Nine Poles of the Grand Dawn.\n\nNext, the Supreme Lord of the Great Dao mounts the chariot of fourfold effulgence, driving the Five Primes of Azure Clouds. He summons the Mysterious Tenuity Black Emperor, named Qi Yuanxuan, and together they journey northward to the Vast Desert and Towering Obscurity Heaven, where they behold the Jade Clarity Sevenfold Stillness Life-Guiding Lofty Supreme Empty Sovereign Lord and receive the Hidden Talisman of the Overlapping Radiance and Rotating Root.\n\nNext, the Supreme Lord of the Great Dao mounts the chariot of fivefold effulgence, driving the Four Primes of Yellow Clouds. He summons the Primordial Tenuity Supreme Emperor, named Jie Kongzi, and together they journey northeastward to the Supporting Blade and Canopy Flower-Floating Net Heaven, where they behold the Jade Clarity Supreme Brilliance Empty Sovereign, the Cavernous Clarity Lord, and receive the Hidden Talisman of the Mysterious Effulgence of the Level Dawn.\n\nNext, the Supreme Lord of the Great Dao mounts the chariot of sixfold effulgence, driving the Three Primes of Green Clouds. He summons the Numinous Tenuity Central Emperor, named Bing Juwen, and together they journey southeastward to the Possessing Flourishing and Initial Silence Heaven, where they behold the Jade Clarity Primordial Origin Empty Sovereign, the Supreme Empyrean Lord, and receive the Hidden Talisman of the Converging Radiance of the Dawn Mandate.\n\nNext, the Supreme Lord of the Great Dao mounts the chariot of sevenfold effulgence, driving the Two Primes of Purple Clouds. He summons the Proclaiming Tenuity Lower Emperor, whose lord is named Hong Fuzi, and together they journey southwestward to the Surging Harmony and Nurturing Separation Sand Heaven, where they behold the Jade Clarity Sevenfold Contemplation Non-Birth Empty Sovereign, the Golden Numinous Lord, and receive the Hidden Talisman of the Aligned Radiance of the Mysterious Dawn.\n\nNext, the Supreme Lord of the Great Dao mounts the chariot of eightfold effulgence, driving the One Prime of Numinous Clouds. He summons the Cavernous Tenuity True Emperor, named Si Chengshu, and together they journey northwestward to the Solitary Green and Scrutinizing Treasure Wheel Dharma Heaven, where they behold the Jade Clarity Eightfold Contemplation Lofty Primordial Empty Sovereign, the Tranquil Effulgence Lord, and receive the Hidden Talisman of the Lofty Dragon Mist.\n\nThen the Supreme Lord of the Great Dao mounts the Cavernous Effulgence Jade Chariot, driving the Grand Auroral Purple Mist and Mysterious Effulgence’s radiance. He summons the Ninefold Tenuity Inner Emperor Lord, named Shen Mingxian, along with the Supreme Sovereign, the Ninefold Mysterious, and the Nine Heavens’ various perfected immortals and transcendents, and together they ascend to the Mijianluo Terrace, the Empyrean’s Utmost Desolation Mound, the Soaring Non-Cloud Root Capital of the Jade Clarity Upper Heaven. There they behold the Jade Clarity Purple Radiance Supreme Jade Sovereign, the Illustrious Supreme Lord of the Great Dao, and receive the Hidden Talisman of the Lofty Clarity, Supreme Void, and Boundless Upper Dao Lord.\n\nSuch is the solemnity of the Supreme Lord’s ninefold journey, the inception of his soaring ascent. The eightfold effulgent chariots proceed in sequence, the eightfold primes wafting mists; the jade chariot’s flying banners, the grand aurora encircling its wheels. Sun and moon are drawn together, escorting the imperial carriage and raising its canopy. The Five Emperors drive forth, illuminating the Nine Heavens; the Primordial Rigidity grasps the register, the Northern Culmen commands the spirits. The Supreme Emperor unfolds the Dao, the Grand Simplicity gathers the clouds. Seven thousand divine tigers roar mightily, nine hundred venomous dragons open the ford. Fierce beasts sing the path, sixfold leaders bear mountains in their jaws; eagles and birds of prey brandish their talons, severing the nets of myriad treacheries. The Nine Emperors gird themselves with the sun’s effulgence, the Five Marchmounts cleave the nine barriers.\n\nBehold the fiery armor of blazing cypress, the circular array of forest-like weapons. Wielding hundred-fathom halberds, they topple mountains and drain rivers. The Heavenly Soldiers and Martial Troops, myriad upon myriad of coiling serpents; the female cavalry rides a thousand leagues, their feathers drifting in the void. They hurl fire-bells upward, leaping through the air in dazzling streams. Molten metal surges in reverse, bursting asunder the eight corners. The majestic wind penetrates the source, uprooting forests and tearing out trees.\n\nAuspicious clouds darkly soar, dragon mists obscurely interweave and support. Girded with the seven dawns’ nocturnal effulgence, they bind the nine luminances’ moon-pearls. Black tigers roar and howl, scattering and spreading the celestial array. Jade is struck and bells resound; the Northern Feng unfolds the dawn. The bright reins traverse the nine thoroughfares, precious incense and blossoms scatter. The effulgent chariot hurls through the empyrean, the eight primes dance upon the canopy. A thousand myriad paths, yellow-robed master soldiers; feathered canopies float in the void, cinnabar banners extend their essence. Brocade-fanged dragon standards, myriad upon myriad, vie in splendor. Flying mists press against the sun, their luster dimming its brilliance; fivefold auroras entwine its radiance, surging and filling the empty courtyard.\n\nGrasping the tally to subdue demons, brandishing swords to tread upon spirits. Dragon-men blow upon flutes, patterned tigers play upon zithers. Jade drums shake with thunder, the ninefold radiance turns day to dusk. Eight wolves govern the pitch-pipes, their harmonious tones resounding. Cloud harps are strummed in the void, traversing the falling notes of gong and shang. Horn and feather receive the zhi, merging with the empty and cavernous brilliance. Eight hundred divine maidens sing and dance in the Upper Clarity. Cloud-veiled brocade sleeves, feathered kerchiefs fluttering in the azure. To the right, they wave the Vast Perfected; to the left, they summon the Dawn Mulberry. Graceful and distant, the cloud array; emerald canopies flow like meteors. Soaring and wheeling in formation, sleeves and necks intertwined. Bathing in the Grand Void, plucking the empty space to absorb effulgence. They call forth the sevenfold Dao’s purple mists, streaming the dragon candles’ flickering glow. Ten thousand glances reach the utmost joy, carefree upon the empyrean’s ridge. Treading upon auroras, surpassing the void, fiercely ascending the jade city. The celestial harmony’s phoenix tones, feathered simurghs sing in unison. Flying blossoms snow in descent, the nocturnal sun revolves its essence. Nine-jointed jasper blossoms, pure white as frost. Grand cassia trees grow in succession, sweeping and brushing the perfect clarity. Dawn auroras array the reins, three wheels and nine chariots. Seething and penetrating the empty and mysterious, overturning the distant and obscure.\n\nHow great is the jade chariot’s majesty! What supreme virtue of numinous power! How lush is the empyrean’s effulgence! What flourishing splendor of soaring petals!\n\nFor the grand tone penetrates the cavernous, the jade Dao is profoundly remote. Lofty radiance revolves its brilliance, mysterious blossoms brightly flourish. Wondrous echoes recede like parted fans, divine maidens array in guard. The Five Elders assist his person, advancing virtue and augmenting qi. Harmonizing the hun and gathering the essence, the seven po are restrained. The Cavernous Immortals and Void Perfected, the Emperor Unity is most honored. Thereupon, the Directors of Destiny ride the whirlwind in unison, the Lords and Heirs share the chariot. Wheeling the reins upon the eight paths, flowing spirits through the ninefold essences. The Five Emperors descend to welcome, ascending to the Upper Clarity. Northward they pay homage to the Five Emperors, chanting and intoning the Cavernous Scriptures. Reposing in the Grand Simplicity, blossoming feathers in perfect clarity. Golden consorts approach the chamber, jade lads scatter incense. Upon concluding the recitation, they bow in reverence to the four directions. Thus is the honor accorded to the Cavernous Numinous, the heart’s aspiration to soar through the void.\n\nUpon completion.\n\nTo receive the *Thirty-Nine Chapters of the Great Cavern Perfected Scripture* and the *Jade Register of the Supreme Lord of the Great Dao*, the *Eight Winds’ Circuit of the Dao of the Emperor Unity*, one must first purify the fast for three years, or for seven hundred days, or for one hundred forty days. Bathe in the five fragrant herbs, preserve the true and meditate upon the immortals, with a profound heart earnestly entreat, prostrating at the master’s gate—only then may one receive them.\n\nThe one who transmits the scripture is called the *Master Lord*; the one who receives it is called the *Disciple*. Unless one’s heart is utterly sincere and the depths of the unseen laid bare, enduring long suffering within the numinous precincts, abasing oneself at the master’s gate and bowing the head in the hall of virtue, the *Cavern Scripture* and *Jade Register* shall never be revealed to the aspirant.\n\nIf the aspirant’s body is not naturally endowed with extraordinary *qi*, uniquely concentrated to harmonize with the spirit, if the spirit’s radiance does not inwardly illuminate and the feathered splendor does not reflect the profound, if the Grand Simplicity does not generate the five viscera and the seven numina do not enter the *niwan*, if the bones do not bear the jade radiance of the Five Emperors and the blood does not flow with the vast spring of molten gold—such are the marks of a celestial immortal.\n\nWithout these celestial signs, one shall never encounter a master of this scripture. Upon receiving the scripture, the covenant is sworn: the green jade ring is split, the pledge is opened for transmission, the belt is severed from kin—only then may one practice the *qi* of the Emperor Unity, recite the *Great Cavern Perfected Scripture*, and receive the *Jade Register of the Supreme Lord*.\n\nThe scripture master originates from the primordial mystery, gathering the initial *qi* to traverse the unseen, clearing the obstructed paths to commune with the perfected, opening the cloud-crossings to guide the aspirant. Greatly crossing beyond water and fire, one must be born in clarity to achieve transcendence.\n\nFor those who become disciples of this scripture, they must devote themselves to its precepts with suffering heart, revering and serving the Master Lord, sharing the same flavors in food and drink, equally partaking in sweetness and bitterness. From beginning to end, they must mirror the divine luminaries, sharing peril and hardship as if on the same arduous path. Only then will the Emperor Unity gaze upon their goodness with enduring steadfastness, and the Supreme Lord wield the craftsman’s skill to complete the wheel. The heart’s core shall know no barrier in its devotion, the five viscera shall not sink beneath the burdens of the *niwan*. Thus, the *qi* shall meet the morning clouds, virtue shall uplift the seven mysteries, generation after generation shall be born with great fortune, descendants shall ever be noble immortals. Layer upon layer of the profound shall accumulate ten thousand myriad-fold, planting the roots of the Dao for ages to come. Ancestors shall return to the womb of rebirth, and the Supreme Lord shall aid the aspirant’s spirit.\n\nThereupon, the jade chamber becomes luminous and clear, the ninefold circuits merge and divide. The mirror of the heart remains ever unified, and the hundred spirits rejoice. In all expansion and contraction of suffering, the Master Lord is ever held in mind.\n\nThe *Thirty-Nine Chapters of the Great Cavern Perfected Scripture*, the highest and foremost section, concludes here.\n\nTo receive the *Thirty-Nine Chapters of the Great Cavern Perfected Scripture*, the *Eightfold Radiance Jade Register of the Supreme Lord of the Great Dao*, the *Eight Winds’ Circuit of the Dao of the Emperor Unity*, the *Fivefold Mysterious Return of the Concealed Cinnabar*, the *Twelve Supreme Vows of the Mysterious Mother of the Eight Intervals*, the *Golden Flower of the Cavern Chamber’s Preceding Feminine Unity and the Ninefold Mystery Array*, the *Numinous Writ of the Purple Text*, and the *Jade-Stemmed Cinnabar of the Five Viscera’s Life-Securing Treasure*—one must sever the jade ring and cut the cord to be worthy of their transmission. The regulations are as follows:\n\nFashion a ring of purple gold, one *cun* in diameter. Sever one ring, dividing it into two halves. The scripture master and the disciple shall each wear one half for life.\n\nTake a cord of green silk, nine *chi* in length. Each shall cut half to bind their half-ring, then wear it together.\n\nTake a piece of green brocade, one *chi* and eight *cun* in size. Each shall divide it in half to make a pouch, in which to store their half-ring and green silk cord.\n\nOnce the ring and cord are divided, the disciple shall bow three times to receive the scripture, and the scripture master shall kneel to transmit it. Each shall silently recite the vow:\n\n*\"I, [Name], now receive the* Thirty-Nine Chapters of the Great Cavern Perfected Scripture *and the* Eightfold Radiance Jade Register of the Supreme Lord of the Great Dao*. May my body ascend to the Purple Void, attaining the immortal palaces. May my seven generations of ancestors return to the womb and be reborn. May great fortune and blessing fill my halls for generations to come. May my descendants flourish, a thousand thousand in radiant splendor. I shall not reveal the received scripture, but recite and cultivate its jade chapters, adhering to every precept and ritual to preserve my form.\"*\n\nShould one violate the precepts or betray the scripture, calamity shall befall generation after generation. The severing of the silk and cutting of the ring shall be heard above by the Three Clarities, below by the Five Peaks, and by the Northern Emperor and the Three Officials.\n\nThus concludes the transmission.\n\nIn the eleventh year of the Yonghe reign of the Jin dynasty, in the year *yimao* (Wood Rabbit), on the first day of the ninth month at midnight, the scripture was received from Lady Wang of the Purple Tenuity. In total, twenty thousand two hundred and thirty characters, of which *The Perfect Scripture of the Great Cavern* comprises ten thousand characters. Here concludes the *Jade Register of the Eight Radiant Numina of the Golden Prime of the Dao*, bestowed by the Most High and Venerable Supreme Lord of the Great Dao of the Upper Clarity.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清高圣太上大道君洞真金元八景玉箓 经名：上清高圣太上大道君洞真金元八景玉箓。 简称《洞真金元八景玉箓》。 撰人不详，约出於东晋南朝。 系早期上清派重要经典。 原本一卷，复误分作两种。 底本出处：《正统道藏》正一部。 上清高圣太上大道君洞真金元八景玉箓 东华上仙曰太上八素隐书，南华上仙曰大洞真经，西华上仙曰金真玉光映天洞观玉经，北华上仙曰萧条九曜豁落七玄上经，玉皇中华上仙曰太上高圣八景玉箓。 中央黄老君、南极元君，藏录二经於太素瑶台玄云羽室、封以郁森之笈，玉清三元之章。 乃命北寒金台龙华玉女七百人，又命白空虞宫西灵玉童七百人，侍卫大洞真经及太上虚生大隐符玉箓焉。 上清高圣太上大道君者，盖二晨之精炁，庆云之紫烟，玉晖曜焕，金映流真，结化含秀，苞凝玄神，寄胎母氏，育形为人，讳，字上开，元母妊三千七百年，诞於西那天郁察山浮罗岳丹玄之阿侧矣。 元监朗於始旦，八洞被於太初，周观九纬，俯擢醴川，逍遥摄生，采真食精，飞玄扬羽，漱挹泰明，受箓紫皇，位司高仙。 振风朱素，朝会万神，玄渊峨岑，大音弥芬，希想玉真之虚霞，上清之灵晨，尔乃拔思眇慕，蹈空栖真，沉朱华璋，解冠九天，眄朗丘岳，极洞万峰，神秉五曜，形盘七元，感精太寂，思招玄清，遂浩映停晖，飞珠濯灵，隐芝结秀，宝光夜生，朝探华晨，餐晨上精，乘云落烟，八道焕明，神电回风，绿炁幽蔼，广眄八浩，九元匝至，再登紫陛，三飞琼阙，四宾太素，五宴琳室，携握五老，洞源极密，高尊上帝，莫不履此。 慧畅玉篇，咀嚼冲味，徘徊幽虚，向流逸霄，形沉八玄，韬光万源，浩浩冥贯，条条霞摽，神秀外觉，炁弥淡州，容与大化，寥廓本无，太空任寄，即色随消，淳风满峙，恬机理愉，天音朗解，高涂窈窕，玄心充於希韵，飞翰蔚乎庆烟，龙潜一勃，凤仪眇扇，遂抚四大，惚括弱丧，於是受书玉虚，眺景上清，位为太上高圣玉晨大道君，治药珠日阙，馆七映紫房，玉童玉女各三十万人，侍君散香焉。 佩九色离罗之帔，衣飞森霜珠之袍，巾须臾百变之冠，带晨光日铃育精之剑，下极万万，受事虚皇也。 君或累变常流，顺风入蔼，鼓扬三道，下盻八外，登乎丘阜，杖褐万国，玄唱四振。 领拔宏致，鹏翮八抚，和音流萃，委彼云霞之上韵，暂释一往之眇蔚，俯摄苍梨，亹亹弥迈。 夫决疑朗惑，钦范灵德，曜龙文於苍渊，焕采云於川泽，濯天貌於兰玉，发金精於幽谷，乘大顺以御至象，游冥神以混五浊，虚澄九落，劳不止足，凝形泊中，提携荣辱，寔太上之曲教也。 若其耽栖灵观，洞宴七觉，机芒飙末，测神尽奥，弘模潆停，虚迁幽间，神浪希夷，九音以悬，玄寂既忘，托寓华园，照照法标，明明功全，妙激重理，扉洞万千，舞景扇虚，乘空抱烟，盘纡七纪，箓首上缘，灵符曜散，敷陈隐篇，括致沉蒙，运转滞轮，综结五象，携领诸天，寔太上之化理，以视於群方也。 若夫散教养形，赴救神炁，明立三宫，冲灵独泰，寥朗二顺，含元嘉会，遣撒杂思，忘累遣外，行洞幽虚，积妙成大，吐故受新，摄精逐秽，除邪念之纷交，藏真正之宝贵，漱晨华以招日皇，挹夜明以抱月珠。",
      "translated_text": "**The Supreme Clarity Highest Sage, Most High Lord of the Great Dao, *Dongzhen Jin Yuan Eight Radiant Jade Register***\n\n**Scripture Title:** *The Supreme Clarity Highest Sage, Most High Lord of the Great Dao’s Dongzhen Jin Yuan Eight Radiant Jade Register* (abbreviated as *Dongzhen Jin Yuan Eight Radiant Jade Register*).\n\nAuthor unknown, approximately dating to the Eastern Jin or Southern Dynasties. A foundational scripture of the early Supreme Clarity tradition. Originally one scroll, later erroneously divided into two. Based on the text from the *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n---\n\nThe Eastern Flower Supreme Immortal calls it the *Eight Hidden Writings of Supreme Simplicity*; the Southern Flower Supreme Immortal calls it the *True Scripture of the Great Cavern*; the Western Flower Supreme Immortal calls it the *Golden True Jade Radiance Illuminating Heaven’s Cavern-Observing Jade Scripture*; the Northern Flower Supreme Immortal calls it the *Desolate Nine Luminaries, Expansive Seven Mysteries Upper Scripture*; the Supreme Immortal of the Jade Emperor’s Central Flower calls it the *Most High Sage’s Eight Radiant Jade Register*.\n\nThe Central Yellow Elder Lord and the Southern Pole Primordial Lady concealed and recorded these two scriptures within the Jade Simplicity’s Jasper Terrace and the Mystic Cloud Feather Chamber, sealing them in a fragrant, dense casket with the jade seals of the Three Primes of Jade Clarity. They then commanded seven hundred Jade Maidens of the Northern Frigid Golden Terrace and seven hundred Jade Lads of the Western Numinous Jade Palace of White Emptiness to attend and guard the *True Scripture of the Great Cavern* and the *Jade Register of the Great Concealment of the Most High’s Void-Born* therein.\n\nThe Supreme Clarity Highest Sage, Most High Lord of the Great Dao, was the essence of the Two Dawns’ *qi*, the purple mist of auspicious clouds, his jade radiance blazing, golden reflections streaming with truth. Congealing transformation, embracing refinement, he enfolded the mysterious spirit, entrusted to a mother’s womb, and took human form. His taboo name was [obscured], his style *Shang Kai*. His primordial mother carried him for three thousand seven hundred years before he was born beside the Crimson Mystery Slope of the Floating Mount Luo in the Western Heaven’s Yu Cha Mountain.\n\nHis primordial oversight shone at the first dawn; the Eight Caverns spread through the Great Beginning. Surveying the nine wefts of the cosmos, he descended to the sweet springs of the Li River. Roaming freely to nurture life, he gathered truth and consumed essence. Soaring in mystery, spreading his plumes, he rinsed and sipped from the Great Clarity. Receiving the register from the Purple Emperor, he was appointed to govern the Highest Immortals. Stirring the vermilion winds, he convened the ten thousand spirits. The dark abyss and towering peaks resounded with the great sound’s boundless fragrance. Yearning for the jade truth of the void’s rosy clouds and the numinous dawn of Supreme Clarity, he then cast aside worldly thoughts, trod the void, and dwelled in truth. Plunging the vermilion jade tablet into the depths, he doffed his cap of the Nine Heavens. Gazing upon the bright hills and mountains, he traversed the myriad peaks of the caverns. His spirit grasped the Five Luminaries; his form coiled with the Seven Origins. Moved by the essence of the Great Stillness, he yearned to summon the Mystic Clarity. Thus, his vast radiance stilled its brilliance; flying pearls bathed his spirit. Hidden mushrooms formed their splendor; night-born jewel lights arose. At dawn, he explored the flowery morning, consuming the morning’s supreme essence. Riding clouds and descending mists, the Eight Ways blazed with light. Divine lightning whirled in the winds; green *qi* shrouded the depths. His vast gaze spanned the Eight Vastnesses; the Nine Origins encircled him. Ascending the purple steps again, thrice flying through the jasper towers, four times attending the Great Simplicity, five times feasting in the gem chambers, he grasped the Five Elders, plumbing the caverns’ utmost mysteries. The Highest Lord of the Heavens, none who did not tread this path.\n\nHis wisdom flowed through the jade chapters; he savored the subtle flavors. Lingering in the hidden void, he turned toward the drifting, ethereal clouds. His form sank into the Eight Mysteries; his light concealed the ten thousand sources. Vast and boundless, profoundly penetrating, each strand of rosy clouds soared. His spirit’s refinement awakened outwardly; his *qi* suffused the tranquil realms. In harmony with the great transformation, he roamed the vastness of the original void. The great emptiness bore his intent; form dissolved with the passing hues. The pure wind filled the peaks; his tranquil mechanism governed joy. Heaven’s sounds rang clear; the lofty path was deep and distant. His mysterious heart filled with rare resonance; his soaring brush flourished amid auspicious mists. The dragon lurked in a single surge; the phoenix’s grace spread faintly. Thus, he embraced the Four Greats, encompassing the weak and lost. Thereupon, he received the scriptures of Jade Emptiness, gazing upon the scenes of Supreme Clarity, and was enthroned as the Most High Sage, Jade Dawn Lord of the Great Dao. He governed the Palace of the Elixir Pearl Sun, dwelling in the Sevenfold Radiance Purple Chamber. Three hundred thousand jade lads and maidens attended him, dispersing incense.\n\nHe wore a robe of nine-colored parted silk and a gown of flying frost-pearls. His cap changed a hundred times in an instant; his belt bore the Morning Light Sun Bell and the Sword of Nurtured Essence. His dominion extended infinitely, serving the Void Emperor. At times, he transformed repeatedly with the constant flow, entering the mists with the wind. Stirring the Three Ways, he gazed below upon the Eight Beyonds. Ascending the hills and mounds, he staffed the myriad lands. The mysterious chant resounded in four directions. Leading and uplifting with grand intent, his roc’s wings brushed the Eight Supports. Harmonious sounds flowed and gathered; he entrusted the melody to the clouds and rosy clouds above. Briefly releasing his distant, subtle elegance, he gazed down upon the vast earth, advancing ever onward.\n\nTo resolve doubts and illuminate delusions, to revere the numinous virtue’s model: he illuminated dragon patterns in the azure abyss, blazed with rosy clouds over rivers and marshes. He bathed his heavenly countenance in orchid jade, emitted golden essence from secluded valleys. Riding the Great Compliance to govern the supreme images, roaming the mysterious spirit to blend the Five Impurities, he stilled the Nine Falls without wearying his feet. Congealing his form in the center, he upheld honor and disgrace—such was the Most High’s subtle teaching.\n\nAs for his delighting in dwelling in numinous observances, feasting in the Seven Awakenings, his mechanism’s edge swift as the wind’s tip, plumbing the spirit’s utmost mysteries: his vast pattern swirled and stilled, his emptiness shifted through hidden realms. The spirit’s waves were rare and silent; the Nine Sounds hung in suspension. Having forgotten the mysterious stillness, he lodged in the flowery garden. Brightly shining, the dharma’s standard; clearly luminous, his merits complete. Subtly arousing the profound principle, his doors opened to the myriad thousands. Dancing scenes fanned the void; riding emptiness, he embraced the mist. Coiling through the Seven Records, he ascended the register’s summit. Numinous talismans blazed and scattered; hidden chapters unfolded. Encompassing the sunken and obscure, he turned the stagnant wheel, weaving together the Five Images, leading the hosts of heaven—such was the Most High’s transformative governance, by which he oversaw the multitudes.\n\nAs for dispersing teachings to nurture form and hastening to rescue the spirit’s *qi*: he clearly established the Three Palaces, the solitary peace of the profound spirit. The Two Compliances were vast and bright; the Primordial Harmony gathered in joy. Casting aside杂念, forgetting burdens and relinquishing externals, he traversed the hidden void, accumulating mysteries to achieve greatness. Exhaling the old, receiving the new, he gathered essence and expelled filth. Dispelling the tangled thoughts of deviant intentions, he treasured the preciousness of true uprightness. Rinsing the morning’s splendor to summon the Sun Emperor, he drew in the night’s brightness to embrace the Moon Pearl.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1229,
      "start_sentence": 0,
      "end_sentence": 20,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.828344106674194,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高圣太上大道君洞真金元八景玉录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "郁仪横运，焕启太无，结璘吸霄，双景合游，飞芝葩玄，灵若被岫，凤脑鼓翼於金历，鳞精奋耳以振躯，夜光焕乎五岳，晃朗垂条而结华，隐龙鸣云，琼子竦遘，於是灵瓜漫垄，紫捺郁丘，丹散千合，玉密悬嵎，蹀躞七元，登空驾浮，西灵浩浆，东建醴朱，酣丹琳可以迁九玄，味虎沫足以婴朽夫。 爰有四蕊紫津，三华玄刚，青瓶漂芝，玄柯莹琅，素盈冲霄，绛生五英，挹玄渠之甘露，变白首而方童矣。 若登峻岭，洪秀天和，育明弱罗，焕扇神柯，晨荣缥药，落林丹兰，敷灵嵉嵉，岩虚飞烟，奏香合谷，献葩芳液，凝形紫碧，绛云金条，艳精总根，太华吐纳，七冥六庆，挥慧八解，寄成略略，远畅飘飘，绝冥心泊节惔，以回孙婴也。 於是定觉造信，明序等畴，玉真启晨，沐浴灵丘，清宾上朝，精心豁愉，蔚蔚三关，偶景以绸，寂幽内韵，含唱高柔，仗麾命仙，研神步元，历落九天，俨然整齐，七圣表梯，高风以标，明范既维，总运四浮也。 将有静咏琼堂，愔玩大有，灵风散景，六云生牖，从容霄杪，俯眄崇阜，萧条万谷，总辔空亩，掷轮灵津，飞兽嗥旅，神童翼盖，西华宴石，芬雾绕襟，芳烟生乎，寥寥岳器，金藏玉薮，五象八廓，澄景合偶，游观隐奥，是以永久也。 时复解带万流，日游月旋，招风扇羽，流荡九迁，明霞遂镜，暝暝重玄，云房含曜，采真理间，窈窕绝宅，神洞寥间，精晖内映，三馆洁鲜，千痾不兆，故有常痊。 遂尔振策七圃，扬青建朱，腾空舞旌，驾景骋飙，徘徊八烟，盘桓空涂，仰簪日华，拾落月珠，摘绛林之琅实，饵玄河之紫蕖，偃蹇灵轩，领理帝书，万神入拜，五德把符，上真侍晨，天皇抱图，太真四告，中篇定模，六纪流盈，整炁摄虚。 於焉抚空仰玄，吟唱而言曰：子欲为真，当存日中君，驾龙骖凤，乘天景云，东游希林，遂入帝门。 若必升天，当思月中夫人，驾十飞龙，乘我流零，西朝六领，遂诣帝堂。 精根运思，上朝玉皇，苍敷郁仪以蹑景，晃散结璘以暨霄，九纬横掷，七象电幽，灵风交鼓，二晨八道，骋素以侍朝，三云焕华於北维，万龙骋腾以唱啸，东鹏鼓节，紫华启翘，高奔圆精，洞景逍遥，双皇合辇，后天而雕也。 隐通坦陶，神泯炁平，灵宾森列，披素玉庭，左把龙符，右操虎经，八风洞虚，流响五城，玄黄焕落，郁若罗星，三宝交扇，步豪搜瑛，高宗拔藻，枪枪弹琼，玄音续拔，金根琅砰，鸾舞云池，飞凤唱声，紫杜运兰，绕空绕灵，跃踏太霞，曜采上清，发飙龙隧，骇动八明，累椿积劫，保兹利贞也。 或变教分道，假名移形，六一遏未，玄云育成，飞丹水玉，腾跃雪霜，灵华八射，紫游九扬，徘徊乱转，暧昧三黄，绛液易精，九琳吐芒，琅玕百变，碧映水阳，八琼飞景，秀蕊绿浆，曲晨乘霄，流金月明，玄津玉醴，灵映五公，光弃投音，一唱八张，波若火精，伊离玉姜，金百会，舍利缚香，郁郁灵宝，化易文章，刀圭既陈，寿不可量，实真元之珍药，上帝之所秘藏也。 或炼五云玉华，灵金饵清，朱魄绿蕖，华腴碧精，南烛翠□，沉沙空青，朝探五晨玉渊素浆，亦能反故还新，变老得婴也。 於是四炁运和，八风扇虚，宴眄紫林，振裳九隅，扶桑郁秀，建木舞丘，万真逡巡，濯翮沧流，百草结柯，五华曜敷，蓂荚夕生，合节而浮。",
      "translated_text": "Amidst the vast expanse, Yu Yi’s horizontal traverse ignites the radiance of Supreme Non-Being; entwined jade brilliance inhales the dawn, as twin luminaries conjoin in their celestial sojourn. Flying zhi-mushrooms unfurl their dark petals, their numinous essence cloaking the mountain peaks; phoenix brains beat their wings upon the golden calendar, while scaled spirits prick their ears to rouse their forms. Night’s glow illumines the Five Peaks, its resplendent tendrils trailing to weave blossoms. Hidden dragons cry amidst the clouds, and jade fruits rise in startled encounter.\n\nThen do spirit melons spread across the fields, purple stalks flourish on mist-laden mounds; cinnabar scatters in a thousand unions, jade clusters hang dense upon the cliffs. Treading the Seven Origins, one ascends the void to ride the floating clouds. In the west, the Numinous One offers vast nectar; in the east, vermilion libations are established. Drinking deeply of cinnabar jade-essence may transform the Nine Mysteries; savoring tiger froth suffices to encircle the decaying husk.\n\nBehold the Four Petals of Purple Nectar, the Three Flowers of Dark Perfection: azure vases float with zhi-mushrooms, dark branches gleam with langgan jade. Pristine abundance fills the void, crimson blooms with fivefold splendor. Drawing from the dark channel’s sweet dew, one alters white-haired age to youthful prime.\n\nShould one ascend the towering peaks, the vast harmony of heaven and earth unfolds; nurturing the radiant, delicate silk, the divine branches unfurl their luminous fans. At dawn, ethereal herbs flourish; at dusk, cinnabar orchids fall through the forest. Spreading numinous majesty, the cliffs stand empty, wreathed in drifting mist. Offering fragrant incense in the valley, presenting blossoms and aromatic essences, one congeals form in purple and azure, crimson clouds and golden boughs. The dazzling essence gathers at the root, as Mount Taihua exhales and inhales. Seven darknesses and six blessings wield wisdom’s eight liberations; dwelling in subtle clarity, one soars afar with effortless grace. Cutting off the mind’s dark stillness, calming its rhythms, one turns back the infant’s bondage.\n\nThereupon, settled awareness engenders trust; luminous order aligns with the equal. Jade perfected ones greet the dawn, bathing upon the numinous mound. Pure guests ascend in audience; with focused mind, they open to joy. The flourishing Three Passes pair with the luminous shadows, weaving in harmony. The inner resonance of profound stillness embraces the lofty and gentle song. Wielding the banner, they summon the immortals; refining the spirit, they tread the primal. Traversing the Nine Heavens in stately array, the Seven Sages ascend the ladder, their noble bearing a standard. With the bright model established, they govern the Four Floatings in unison.\n\nThen, in tranquil chant within the jade hall, one delights in the Great Possession. A numinous breeze scatters the light; six clouds arise at the window. Leisurely at the zenith of dawn, gazing down upon the lofty mounds, the myriad valleys stretch desolate, reins gathered over the empty fields. Casting the wheel into the numinous ford, flying beasts howl in procession; divine lads flank the canopy as the Western Flower feasts upon stone. Fragrant mists coil about the lapels; aromatic vapors arise from the vast and solitary mountain vessels. Gold hides within jade thickets; the Five Symbols and Eight Vastnesses settle their luminous union. Roaming to observe the hidden mysteries, one thus attains enduring permanence.\n\nAt times, one unbinds the sash to the myriad streams, sun’s journey and moon’s revolution their companions. Summoning the wind to fan the wings, one drifts through ninefold transformations. Bright clouds mirror the radiance; profound darkness enfolds the profound. The cloud chamber contains the luminous; gathering the true, one orders the principles within. In the secluded abode of the abstruse, the spirit pervades the void’s expanse. Inner radiance reflects within; the Three Palaces remain pure and fresh. A thousand ailments do not arise—thus is there constant healing.\n\nThen, brandishing the staff through the Seven Gardens, raising the azure banner with vermilion tassels, one soars through the void, dancing the pennants, driving the light to race the whirlwind. Lingering amidst the eight mists, circling the empty paths, one pins the sun’s splendor to the hair, gathers the moon’s fallen pearls. Plucking the langgan fruits from the crimson grove, feeding upon the purple lotuses of the Dark River, one reclines in the numinous carriage, governing the imperial scriptures. Myriad spirits enter to pay homage; the Five Powers grasp the talismans. Supreme perfected ones attend the dawn; the Heavenly Sovereign embraces the charts. The Four Supreme Ones proclaim the decrees; the Central Scroll establishes the model. The Six Records flow to fullness; refining the *qi*, one embraces the void.\n\nThereupon, gazing into the void and lifting one’s voice, one chants and declares: If you wish to become a perfected one, you must meditate upon the Lord Within the Sun, driving dragons and phoenixes to harness the celestial radiance and clouds. Journey east to the Sparse Grove, then enter the Emperor’s Gate. If you must ascend to heaven, contemplate the Lady Within the Moon, driving ten flying dragons to harness my flowing essence. Journey west to the Six Ridges, then proceed to the Emperor’s Hall. With focused root and moving thought, ascend to pay court to the Jade Sovereign. The verdant expanse of Yu Yi treads the light; the scattered brilliance of Jie Lin reaches the dawn. The Nine Latitudes cast their traverse; the Seven Symbols flash like lightning through the dark. Numinous winds intermingle in their drumming; the Two Dawns and Eight Paths gallop in purity to attend the court. Three clouds blaze with splendor at the northern pole; ten thousand dragons gallop and sing in chorus. The Eastern Peng beats the rhythm; purple blossoms unfurl their petals. Soaring high, the round essence unites; the luminous void brings carefree wandering. The Twin Sovereigns join their chariots, outpacing heaven in their flight.\n\nThen, the hidden and the manifest merge in ease; spirit and *qi* dissolve into equilibrium. Numinous guests stand in solemn array, parting the jade courtyard’s pristine expanse. In the left hand, the dragon talisman; in the right, the tiger scripture. Eight winds pierce the void; their resonance flows through the Five Cities. Dark and yellow brilliance scatters, dense as a net of stars. The Three Treasures intermingle their fans; treading the grand, one searches for jade. The lofty ancestor plucks the blossoms; clanging, the jade rings resound. Dark tones continue to rise; the golden root’s langgan chimes. Simurghs dance upon the cloud pools; flying phoenixes sing their melodies. Purple cassia and orchids revolve, encircling the void and the numinous. Leaping through the great auroras, their radiance illumines the Supreme Clarity. The dragon’s path unleashes the whirlwind, startling the Eight Luminaries. Accumulating kalpas upon kalpas, one preserves this benefit and integrity.\n\nAt times, the teachings transform and divide the Dao, borrowing names to shift forms. The Six-and-One restrains the unformed; dark clouds nurture completion. Flying cinnabar, water jade, leaping through snow and frost, the numinous blossoms shoot forth in eight directions; purple wanderings traverse the nine expanses. Lingering in chaotic turns, veiled in the Three Yellows, crimson essences transmute the spirit; the Nine Jades emit their rays. Langgan jade transforms a hundredfold; azure reflections mirror the waters and sunlight. Eight jades take flight in the radiance; elegant stamens yield green nectar. At dawn’s curve, one rides the dawn; flowing gold and moonlit brightness. Dark ford and jade libation, numinous reflections of the Five Lords. Light discards its resonance; one chant summons eight unfoldings. Waves like fire essence, Yi and Li’s jade ginger, golden *qi* at the hundred convergences. Relics bind the fragrance; luxuriant, the numinous treasure transforms the literary patterns. Once the knife and measure are arrayed, longevity becomes immeasurable—truly the rare medicine of the true origin, the secret treasure of the Supreme Emperor.\n\nOr refining the five clouds and jade blossoms, one ingests the numinous gold’s purity. Vermilion souls and green lotuses, lush blossoms and azure essence, southern candles and kingfisher-green *□*, cinnabar sand and empty azure. At dawn, one gathers the Five Dawns’ jade pool and pristine nectar—this too can reverse the old and restore the new, transforming age to regain infancy.\n\nThus, the Four *Qi* harmonize their movements; the Eight Winds fan the void. Gazing in leisure upon the purple groves, one shakes the robes at the nine corners. Fusang flourishes in lushness; the Jianmu dances upon the mound. Myriad perfected ones circle in procession, dipping their wings in the azure streams. A hundred grasses knot their branches; the Five Blossoms radiate their splendor. Ming pods sprout at dusk, floating in rhythmic accord.",
      "overlap_context": "e vast and bright; the Primordial Harmony gathered in joy. Casting aside杂念, forgetting burdens and relinquishing externals, he traversed the hidden void, accumulating mysteries to achieve greatness. Exhaling the old, receiving the new, he gathered essence and expelled filth. Dispelling the tangled thoughts of deviant intentions, he treasured the preciousness of true uprightness. Rinsing the morning’s splendor to summon the Sun Emperor, he drew in the night’s brightness to embrace the Moon Pearl.",
      "start_char": 1229,
      "end_char": 2475,
      "start_sentence": 21,
      "end_sentence": 34,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 55.270299434661865,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高圣太上大道君洞真金元八景玉录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "若登斋入室，当先驱除以辟鬼病，又防百试，乃冥目内视，拊心而祝，北向叩齿三十六通，有微言於玉清琼元君曰：六天大魔王，受制幽寥无，巨兽赤甲，毒龙四喉，白鹰仰鸣，奋爪振豪，万精幽匿，灭邪破妖，天丁一怒，五岳启朝，风火征伐，九天扇照矣。 於是重楗闭视，练神密精，调研三宫，存一天庭，帝君撰宴，卿辅普明，和适炁液，朝谒九灵，五神安迭，津源流盈，白元启真，无英布生，洞景潜朗，四德以平，结晖内宝，歌洞玩清，太素列图，寿亦不倾也。 时复广眄空同，嗷嘈绝汉，乘风振辔，始晖沧畔，演心八陔，熙神独粲，登碧水之灵台，观沧洲之紫馆，希悠眇眇，霞飞烟散，蔼裔云镂，翳勃晃烂，偶景眺目，鲦欻万旦，虚音互骋，玄风合赞，扇元掣刚，日华炜焕，纵容霄汉，所以永宴矣。 若采琳玄垄，翦芝琼园，眇邈高真，巍巍天尊，玉华翼景，金真绕辕，绛波岳踊，跃心和鲜，手落七曜，澄回八门，仰浮匏河，俯步绝山，领理上契，咀嚼至玄，把持法器，怀精含神，飘飘高肆，顺风随新，昙昙德模，潜英启全，所以积椿久眄，常保利津也。 或遇绿林茂崿，逸景结丘，逍遥玄觉，观化玉虚，万度非有，本质在无，轩飙神盘，灵姬启符，羽裙渟霄，翠帔翳舒，高咏玉清，讲豪原初，太微侍席，五皇曜枢，洞机宣幽，至象合殊，玉童弹璈，北华启筝，天女罗陈，百百齐并，玄钧四哕，千音铿零，紫凤抚翅，漱籁同鸣，云鸾差池，整喙唱声，神羽裙呼，飞征扬商，苍龙仰嗥，丛云郁生，神虎啸咤，八风扇庭，撞金折玉，拊锺拍琼，朱烟蔽勃，三素绿青，圆精寝曜，飞霞眄冥，然后太帝下席，散神纵灵，眺眺霄符，晃朗亭亭，左挥南房，右指文昌，进趣奇蔚，会节顺翔，窈窕冲晨，蹀躞沧浪，炁贯逸馆，□拂空，扬旄遏麾，秉旗招光，迁延内咏，心和魂畅，眄眸既周，一至永长矣 。 又各大唱妙几，论元理灵，玉响八维，金音振庭，开陈太素，敷诱隐冥，众藻扶疏，微言续呈，晖条森洒，极妙之精，旁遘岌丛以群臻，别柯棼罗以散荣，有迈於阊阖之南映，又似乎 红葩之绕梁，流景之伊郁，飞烟之蔼蒙，曜九采於帝图，歌紫虚之邕邕，广听嘈囐於玉台，击石沸骇於金堂，五云缠盖，八素朗章，招日月之高精，命七宿之灵纲，握节以步六天，振朱绂之炜煌，舞十绝於北烛，麾华幡於白空，乘神风以盼八景，何事九凤与八狼，绿盖眇眇以炼跃，绛旌飘飘以逆冲，九辔一迭，蹑霄云骧，摘青丹之蕊翘，散飞华之反香，悬梨五练而水柔，九琳洞合而玉成，火琅遂珠，流金采琼，回勾陈之北阿，落散晨之极星，秉轮空同，运炁而征，巍峨奥真，法恒数成，有齐上契，命何可倾。 若其元渟游泮，微音激清，执玩三慧，鉴摄黄宁，浩哉圣玄，微乎幽翰，洞起无生，空逸启旌，握固神庭，缠绵灵关，外夷四镜，宝在六元，苕苕玉德，形器欻延，可谓温和万范，顺辔御圆也。 及至夕龄时栖，方遂八易，清淡抱生，眇眇神迹，婉延化理，测幽极颐，妙运奇绝，寓翰汜适，龙华駽焕於绣云，五映潜跃於太霞，丹晖电曜，景风扇和，高会上宫，泛浪虚波，悠悠玄真，濯炁玉河，振披八道，馨流霄阿，乃为理玉，日新不居，是用积劫灵累，后无弗殂也。",
      "translated_text": "Should one ascend the fast and enter the chamber, first expel and dispel to ward off demonic afflictions, then guard against all trials. Only then, with eyes closed and inward gaze, press the heart and invoke, facing north to strike the teeth thirty-six times. Whisper to the Jade Clarity’s Radiant Primordial Sovereign:\n\n\"The Six Heavens’ Great Demon Kings, bound in the dark and desolate void,\nGiant beasts of crimson armor, four-throated venomous dragons,\nWhite eagles shrieking aloft, claws brandished and bristles raised—\nAll myriad spirits lurk in concealment, vanquishing evil and shattering demons.\nLet the Heavenly Soldiers’ wrath arise, the Five Peaks bow in audience,\nWind and fire launch their campaign, the Nine Heavens fan their radiance.\"\n\nThereupon, bolt the gates and seal the vision, refine the spirit and guard the essence. Harmonize the Three Palaces, meditate upon the Heavenly Court. The Thearch holds his banquet; his ministers and aides illumine all. Harmonizing the qi-fluid, one pays homage to the Nine Numinous Ones. The Five Spirits settle in turn; the spring’s source flows full. White Prime unfolds the true, Flourishing Hero spreads its life. The cavern’s light shines in concealment; the Four Powers attain balance. Inner treasures knot their radiance; one sings the Cavern’s purity and plays in clarity. The Great Simplicity arrays its charts—longevity shall not falter.\n\nAt times, one gazes broadly into the vast emptiness, the clamor fading beyond the Milky Way. Riding the wind, one shakes the reins at the dawn’s edge by the azure shore. The heart unfolds across the Eight Wilds; the spirit alone beams in splendor. Ascending the numinous terrace of Emerald Waters, one gazes upon the Purple Mansion of the Azure Isle. Vast and distant, rosy clouds scatter like mist, trailing vapors carve the skies. Veils of radiance shimmer and blaze. Glancing at paired reflections, a myriad dawns flicker in an instant. Ethereal tones race and intertwine; the Dark Wind joins in praise. The Primordial fans its might; the sun’s glory blazes. One roams the celestial vastness—thus is eternal feasting achieved.\n\nShould one gather jade from the Dark Mound or pluck mushrooms from the Jade Garden, the lofty perfected ones, towering Celestial Worthies, their jade blossoms winging the light, golden truths encircling their chariots, crimson waves surging from the peaks, the heart leaping in harmonious freshness—then, with hands plucking the Seven Luminaries and stilling the Eight Gates, one floats upon the Gourd River and treads the peaks beyond mountains. Leading and ordering the highest concord, chewing and savoring the profound mystery, grasping the ritual implements, embracing essence and containing spirit, one soars aloft, borne by the wind, following the new. Vast and resplendent in virtue’s pattern, the hidden blossom unfolds in wholeness—thus accumulating the cedar’s age in long contemplation, ever preserving the flow of benefit.\n\nAt times, amidst verdant groves and towering cliffs, where idle light knots the mounds, one wanders in dark enlightenment, observing the transformations of the Jade Void. Ten thousand measures are not real; the root-substance lies in nothingness. Divine maidens unfurl their talismans as the divine chariot whirls in the gale. Feathered skirts pool in the heavens; kingfisher capes spread in shade. Chanting high to the Jade Clarity, one expounds the origins of the primordial. The Grand Tenuity attends the banquet; the Five Sovereigns illumine the pivot. The cavern’s mechanism declares the obscure; the supreme image unites the distinct. Jade lads pluck the *ao*-zither; the Northern Flower unveils the zither. Heavenly maidens array themselves in ranks, a hundred hundred in perfect alignment. The Dark Harmony sounds in fourfold resonance; a thousand tones chime and scatter. Purple phoenixes preen their wings, rinsing their flutes in unison. Cloud phoenixes advance in staggered flight, beaks poised to sing. Divine feathered skirts call out; flying chimes raise their *zheng* and *shang* notes. Azure dragons roar aloft; clustered clouds rise in thickets. Divine tigers roar in fury; the Eight Winds fan the courtyard. Bronze is struck and jade shattered; bells are tapped and chimes clapped. Vermilion mists surge in billows; the Three Simplicities—green and azure—glow. Round essences slumber in radiance; flying rosy clouds gaze into darkness. Then the Supreme Thearch descends from his seat, scattering his spirit and releasing his numen. Gazing upon the celestial talismans, luminous and resplendent, he points left to the Southern Chamber and right to the Literary Prosperity. Advancing toward the wondrous and lush, meeting the rhythm in harmonious flight, he wanders the morning’s depths, pacing the azure waves. Qi courses through the secluded halls; □ brushes the void. Banners are raised and standards halted; flags are grasped to summon the light. Lingering in inward chant, heart harmonized and soul at ease, the gaze encompassing all—one attainment endures forever.\n\nThereupon, each sings the wondrous subtleties, discoursing on the primal principles of the numinous. Jade echoes resound across the Eight Directions; golden tones shake the courtyard. The Great Simplicity is unfolded; the hidden and obscure are guided forth. Myriad embellishments flourish in profusion; whispered words continue to appear. Radiant branches scatter in abundance, the essence of utmost subtlety. Encountering the towering and dense in throngs, branching and entangled in scattered glory, one surpasses the southern glow of the Gate of Heaven, or seems to circle the red blossoms’ beams. Flowing light gathers in lushness; flying mists billow in haze. The Nine Hues shine upon the Thearch’s chart; the Purple Void’s harmony is sung in resonance. Broad hearing attends the jumbled sounds at the Jade Terrace; stones are struck and waters boil in the Golden Hall. Five Clouds coil the canopy; Eight Simplicities illumine the chapters. Summoning the sun and moon’s lofty essence, commanding the Seven Lodgings’ numinous net, grasping the tally to pace the Six Heavens, brandishing the vermilion cords in blazing splendor, dancing the Ten Absolutes beneath the Northern Candle, waving the flowered banners in the White Void—riding the divine wind to gaze upon the Eight Sceneries, what need has one for the Nine Phoenixes or Eight Wolves? The green canopy dances in distant leaps; the crimson standards flutter in reverse ascent. Nine reins in one accord, treading the clouds of heaven in galloping flight. Plucking the azure cinnabar’s curling petals, scattering the flying blossoms’ returning fragrance, suspending the five-fold refined pear to soften the waters, the Nine Jade Gems merge in cavernous harmony to form jade. Fire-rubies yield pearls; flowing gold gathers radiant jade. Turning toward the Northern Ridge of the Curved Array, one scatters the stars of the dawn’s farthest reaches. Grasping the wheel of the vast emptiness, one circulates the qi in campaign. Towering and profound, the true and mysterious—laws and constants are fulfilled. Aligning with the highest concord, how could one’s destiny ever falter?\n\nShould the primal stillness wander the marsh, subtle tones stirring clarity, one grasps and savors the Three Wisdoms, reflecting and embracing the Yellow Tranquility. Vast is the sagely mystery; subtle the dark script. The cavern arises from non-being; the empty and idle unfurl their banners. Firmly grasping the spirit’s court, entwining the numinous pass, the outer barbarians of the Four Mirrors—treasures lie in the Six Origins. Radiant and resplendent, jade virtue’s form and vessel suddenly extend. This may be called warmth and harmony in ten thousand patterns, guiding the reins to steer the round.\n\nAs evening’s twilight settles, one completes the Eight Transformations. Embracing life in pure tranquility, the spirit’s traces stretch into the distant. Gracefully unfolding the principles of transformation, plumbing the obscure to the utmost, one’s wondrous workings and marvelous subtleties lodge in the flowing brush. Dragon blossoms gleam in embroidered clouds; the Five Radiance’s hidden leaps dance in the great rosy clouds. Cinnabar light flashes like lightning; the Scenery Wind fans harmony. A lofty gathering in the Upper Palace, floating waves upon the empty waves—vast and distant, the dark and true bathe their qi in the Jade River. Shaking and draping the Eight Paths, fragrance flows through the celestial ridges. Thus is jade ordered, daily renewed without abiding. Therefore, accumulating kalpas of numinous layers, there shall be no end thereafter.",
      "overlap_context": "estore the new, transforming age to regain infancy.\n\nThus, the Four *Qi* harmonize their movements; the Eight Winds fan the void. Gazing in leisure upon the purple groves, one shakes the robes at the nine corners. Fusang flourishes in lushness; the Jianmu dances upon the mound. Myriad perfected ones circle in procession, dipping their wings in the azure streams. A hundred grasses knot their branches; the Five Blossoms radiate their splendor. Ming pods sprout at dusk, floating in rhythmic accord.",
      "start_char": 2475,
      "end_char": 3702,
      "start_sentence": 35,
      "end_sentence": 44,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 53.47749590873718,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高圣太上大道君洞真金元八景玉录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "爰有宝魂制魄，凝神胞胎之法，发数十言耳，可以安身合道，众魔散却，乃异天之绝祝，秘宣龙烛之玄北，其旨不可得而演，重言不可得而译，鸟音兽声，风缠云落，殊天幽唱，莫能通释。 若聊总领奇翰，采炁洞宅，领括九幽，冥韵内廓，乃玉音金流，以施於南户之方矣。 本命之日，及有心震之地，闭关精思，叩齿三过，安炁呼吸，正身北趣，而心存微言曰：罗勒那翰，方柰阏练，班目勃隧，惮汉巨蛇，赤察白象，丹黎大魔，真韵广敷，虚灵峙霄，总览吉凶，发洞畅幽，舞眄众品，领括繁条，百方千涂，莫不豁寥，天地齐度，孰云能雕也。 毕。 若夫决分万滞，剖坚散疑，触音合节，四映显丕，天曜焕迁，不传不师，八风回释，天帝陈辞曰：罗来秀光，玉虚四司，激摅八坦，秉安定危，有生无营，玄精致思，悠豁极洞，物非我持，混形同采，焉 能及之，嘉宴寒津，坐起大夷，二唱曰无，三合五离，大罗六慧，空同九转，七清澄光，四元缱绻，体神忘觉，万虑非尽，华文空肆，玉朗杂轸，荫云重玄，眇内轮陨，七积动飙，冥心远泯，细尘乱蔼，原宗归大，任形投空，造神内外，冥默妙篇，自然高会，冲灵独镜，恢恢远泰，四律受炁，云泽修永，九观元元，心亦豁静，虚烟牢落，二晨焕颖，云梯迁适，无辔而骋，八界三道，胡神以惊，高德远曜，众门运灵，即空亦无，作无两名，太玄一标，支条由情，幽寥照灼，渟音和清，二度七结，及乃无生，飙霄遏离，有中颇虚，大妙虽唱，玄景未竦，尘迹始豪，坐与本无，不贵常珍，理归漠愉，大慧已释，与天同休，万事百向，莫不会遇。 将有真妙玄致，灵章无方，恍惚奇洞，高眄圆乡，擢此神音，触类在亡，凛凛登霄，芬芬运芳，仰执轨度於绝间，俯拯万和於弱丧，四轮扬晖，真元眇迁，大帅秉柂，把箓明篇，乘飙策景，龙腾九天，法鼓洞震，炜晔灵盘，曜南宫之朱皇，浮七盖於玉津，扇掷羽旗，徘徊灵源，绿云掣旗，北风振群，流铃罗射，飙皇生幡，导达万变，应节扇烟，朱虎侠景，毒龙翼轩，伺凶夫之失道，威六天之大奸，有恶必诛，有吉必存，千魔为之伏首，山精为之自残，流响逸乎 太空，二景蔼而落焕矣 。 逍遥群品，泛形万旦，高极玉霄，下尽杪散，变化假体，千术肆观，惠化众兆，各获曩情，上下苍黎，开括元生，标名列籍，致神测精，有能施用，飞登上清，洞元咏微，出幽入冥，乃撰《太上八景玉经》，罗真之妙，阐帝之明，子获其篇，号曰元景左卿，思习洞道，上清左公，徊为三素，逍遥紫空。 夫总亿兆者，将抚摄群流，轨运万物，周眄广虚，目朗八外，尽空同之所宗，遘玄晖之极蔚，云合辽涯，风行烟萃，罕得高静霄霞，指两仪之修御也。 岂容默然三清，任六气以假适乎？ 遂绋心坦观，熙灵十阿，於是乃命八帝，檄落万灵，告水源之阴甲，召五皇之守君，河海整严，千真理轮，火甲厉锋，天丁挥斤，山岳开涂，日月照晨。 尔乃太上大道君，将游行乎九霄，眺神於外天，采幽章於玉虚，求隐符於紫皇，明光八维，略彻群方者也。 於是太上大道君初乘一景之舆，驾八素紫云，摄希微仓帝，名箓丰子，俱东行诣郁悦那林昌玉台天，见玉清紫道虚皇上君，受九晖大晨隐符。",
      "translated_text": "Herein lies the method of refining the soul and restraining the poised spirit, of congealing the spirit within the womb—though it unfolds in but a few dozen words, it can settle the body and unite with the Dao, scattering all demonic hosts. This is the supreme incantation of the celestial realms, the esoteric revelation of the Mystic North beneath the Dragon Candle. Its purport cannot be expounded, its layered phrases cannot be translated; whether the cries of birds or beasts, the entwining winds or descending clouds, the hidden chants of the Nine Heavens—none can be fully interpreted.\n\nShould one briefly gather the wondrous brushstrokes, drawing qi into the cavernous abode, encompassing the Nine Nether realms and expanding the inner resonance of the obscure melody, then the jade tones and golden currents may be bestowed upon the southern portal. On the day of one’s original destiny, or in a place where the heart trembles, one seals the passes and concentrates the essence, striking the teeth thrice, settling the qi and regulating the breath. Facing north with upright posture, the heart holds these subtle words:\n\n*\"Luole Nahuan, Fangnai Elian, Banmu Bosui, Danhan Jushe,\nChicha Baixiang, Danli Damo, Zhenyun Guangfu, Xuling Zhixiao,\nZonglan Jixiong, Fadong Changyou, Wumian Zhongpin, Lingkuo Fantiao,\nBaifang Qiantu, Moni Huoliao, Tiandi Qidu, Shu yun neng diao?\"*\n\nThus concludes the invocation. To resolve myriad obstructions, sever stubborn doubts, harmonize sounds with rhythm, and manifest the Four Radiance in brilliance—where celestial luminaries shift and gleam without transmission or teacher—the Eight Winds revolve and dissolve. The Heavenly Emperor then proclaims:\n\n*\"Luolai Xiuguang, Yuxu Sisi, Jishu Batan, Bingandingwei,\nYousheng Wuying, Xuanjing Zhisi, Youhuo Jidong, Wufei Wochi,\nHunxing Tongcai, Yan neng jizhi?\nJiayan Hanjin, Zuoqi Dayi, Erchang Yuewu, Sanhe Wuli,\nDaluo Liuhui, Kongtong Jiuzhuan, Qiqing Chengguang, Siyuan Qianquan,\nTishen Wangjue, Wanlü Feijin, Huawen Kongsi, Yulang Zazhen,\nYinyun Chongxuan, Miaonei Lunyun, Qiji Dongbiao, Mingxin Yuannin,\nXichen Lu’an, Yuanzong Guidai, Renxing Toukong, Zaoshen Neiwai,\nMingmo Miaopian, Ziran Gaohui, Chongling Dujing, Huihui Yuantai,\nSilü Shouqi, Yunze Xiuyong, Jiuguan Yuanyuan, Xin yi huojing,\nXuyan Laoluo, Erchen Huanying, Yunti Qianshi, Wupei Ercheng,\nBajie Sandao, Hushen Yijing, Gaode Yuanyao, Zhongmen Yunling,\nJikong Yiwu, Zuowu Liangming, Taixuan Yibiao, Zhitiao Youqing,\nYouliao Zhaozhuo, Tingyin Heqing, Erdu Qijie, Jinai Wusheng,\nBiaoxiao Elie, Youzhong Poxu, Damiaosui Chang, Xuanjing Weisong,\nChenji Shihao, Zuoyu Benwu, Bu gui Changzhen, Li gui Moyu,\nDahui Yishi, Yutian Tongxiu, Wanshi Baixiang, Moneng Huiyu.\"*\n\nWhen true subtleties and numinous verses arise without bound, in the indistinct and wondrous caverns, gazing loftily upon the circular realm—seizing this divine resonance, all categories dissolve into nothingness. With awe, one ascends the heavens, fragrance wafting and flourishing. Looking up, one grasps the celestial measures in the remotest spaces; looking down, one rescues the myriad harmonies from feeble decay. The Four Wheels radiate splendor, the true origin drifts and shifts; the Great Marshal holds the helm, grasping the register of luminous scriptures. Riding the whirlwind and spurring the light, dragons soar through the Nine Heavens. The dharma drum resounds through the caverns, the luminous disk gleams resplendent. The Vermilion Emperor of the Southern Palace shines forth, floating the Seven Canopies upon the Jade Ford. Fanning and casting feathered banners, one lingers by the numinous source. Green clouds trail the standards, the northern winds stir the throng. Flowing bells and arrayed arrows, the Whirlwind Sovereign’s pennants arise. Guiding the myriad transformations, they respond to the rhythm and fan the mist. The Vermilion Tiger flanks the light, the Poison Dragon wings the chariot, awaiting the missteps of the malevolent and overawing the great villains of the Six Heavens. Evil is inevitably punished, good inevitably preserved. A thousand demons bow their heads, mountain spirits tear themselves apart. Echoes drift through the Great Void, the Two Effulgences gleam and scatter their brilliance.\n\nThen, roaming among the myriad beings, one’s form drifts through ten thousand dawns. Above, one ascends the Jade Empyrean; below, one reaches the furthest dispersals. Assuming temporary forms, a thousand arts display their wonders; bestowing blessings upon the multitudes, each regains their former state. From the highest to the lowest, the black-haired masses open and encompass the primordial life. Names are inscribed in the registers, spirits are measured and essences probed. Those who can apply this method ascend to the Upper Clarity, chanting the mysteries of the Cavernous Origin. Emerging from obscurity and entering darkness, one compiles the *Supreme Scripture of the Eight Effulgences of Jade*, revealing the marvels of the Perfected Ones and illuminating the wisdom of the Emperor. Having obtained this scripture, you are titled the Left Minister of Primordial Effulgence. Cultivating the Cavernous Dao, you become the Left Duke of the Upper Clarity, circling the Three Primes and roaming the Purple Empyrean.\n\nTo govern the multitudes is to embrace and guide the myriad streams, to regulate the movements of the ten thousand things, to survey the vast emptiness and illuminate the Eight Beyonds. One exhausts the revered foundations of the Empty Same and encounters the ultimate luxuriance of the Mystic Radiance. Clouds converge at distant shores, winds traverse the gathering mists—rarely does one attain such lofty tranquility amidst the rosy clouds, pointing to the refined governance of the Two Modes.\n\nHow could one remain silent in the Three Clarities, allowing the Six Qi to drift aimlessly? Thus, one binds the heart to the level observation, brightening the spirit across the Ten Peaks. Thereupon, the Eight Emperors are commanded, and the myriad spirits are summoned. The yin armor of the water sources is notified, the guardian lords of the Five Emperors are called forth. Rivers and seas are arrayed in solemnity, the thousand Perfected turn the Wheel of Principle. The fire armor sharpens its edge, the Heavenly Soldiers wield their axes. Mountains and peaks open their paths, the sun and moon illuminate the dawn.\n\nThen, the Supreme Lord of the Great Dao sets forth to wander the Nine Empyreans, gazing upon the spirits of the outer heavens, gathering the hidden verses from the Jade Void, seeking the concealed talismans from the Purple Emperor, and illuminating the Eight Directions to thoroughly penetrate all regions. Thereupon, the Supreme Lord of the Great Dao first mounts the chariot of a single effulgence, driving the Eight Primes of Purple Clouds. He summons the Subtle Emperor of the Vast Granary, named Luzi of the Abundant Register, and together they journey eastward to the Jade Terrace of the Heaven of Joyous Forests, where they behold the Supreme Lord of the Jade Clarity and the Purple Dao, the Empty Sovereign, and receive the Hidden Talisman of the Nine Radiance of the Great Dawn.",
      "overlap_context": "the Five Radiance’s hidden leaps dance in the great rosy clouds. Cinnabar light flashes like lightning; the Scenery Wind fans harmony. A lofty gathering in the Upper Palace, floating waves upon the empty waves—vast and distant, the dark and true bathe their qi in the Jade River. Shaking and draping the Eight Paths, fragrance flows through the celestial ridges. Thus is jade ordered, daily renewed without abiding. Therefore, accumulating kalpas of numinous layers, there shall be no end thereafter.",
      "start_char": 3703,
      "end_char": 4937,
      "start_sentence": 45,
      "end_sentence": 59,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.702935457229614,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高圣太上大道君洞真金元八景玉录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "太上大道君次乘二景之舆，驾七素绛云，摄中微赤帝，名定无彦，俱南行，诣高桃厉冲龙罗天，见玉清翼日虚皇太上道君，受观灵元晨隐符。 太上大道君次乘三景之舆，驾六素红云，摄紫微白帝，名渠渊石，俱西行，诣碧落空歌余梨天，见玉清昌阳始虚皇高元君，受总晨九极隐符。 太上大道君次乘四景之舆，驾五素青云，摄玄微黑帝，名齐元旋，俱北行，诣摩坦娄于翳天，见玉清七静导生高上虚皇君，受沓曜旋根隐符。 太上大道君次乘五景之舆，驾四素黄云，摄始微上帝，名接空子，俱东北行，诣扶刀盖华浮罗天，见玉清太明虚皇洞清君，受玄景晨平隐符。 太上大道君次乘六景之舆，驾三素绿云，摄灵微中帝，名秉巨文，俱东南行，诣具渭耶渠初默天，见玉清始元虚皇太霄君，受合晖晨命隐符。 太上大道君次乘七景之舆，驾二素紫云，摄宣微下帝，君名宏肤子，俱西南行，诣冲容育郁离沙天，见玉清七观无生虚皇金灵君，受齐晖晨玄隐符。 太上大道君次乘八景之舆，驾一素灵云，摄洞微真帝，名泗澄摅，俱西北行，诣单绿察宝轮法天，见玉清八观高元虚皇渟景君，受高上龙烟隐符。 太上大道君又乘洞景玉舆，驾太霞紫烟玄景之晖，摄九微内帝君，名申明闲，及上皇九玄九天诸真仙王等，俱仰登弥梵罗台霄绝寥丘飞无云根之都玉清上天，见玉清紫晖太上玉皇明上大道君，受高清太虚无极上道君隐符。 太上九游之严矣，佪腾之初也，八景次驾，八素运烟，玉舆飞旗，太霞绕轮，引日合月，侠辇扬轩，五皇驱除，发曜九天，元刚把箓，北极命神，太帝启道，太素摄云，神虎七千以大啸，毒龙九百而开津，猛兽唱涂，六领衔山，鹰禽奋爪，断罗万奸，九帝带日景，五岳剖九关。 爰有火甲赫柏，圆兵森罗，执戈百丈，阜倾河，天丁武卒，万万蜲蛇，女骑千里，落羽浮虚，仰掷火铃，跃空晃流，流金逆激，焕裂八嵎，威风洞源，扶林拔株。 庆云蔼蔼以玄竦，龙霞幽罗以参扶，带七晨之夜景，要九光之月珠，黑虎甝号，散扬天陈，叩玉鸣锺，北酆启旦，明辔九衢，宝香华散，景辇掷霄，八素舞轩，千百万涂，黄衣师兵，羽盖浮空，丹旗延精，锦牙龙旄，万万相倾，飞烟薄日，映郁丧明，五霞缠曜，冲蔼虚庭。 握节制魔，挥剑步精，龙人吹箫，文虎奏筝，玉鼓震雷，九晖昼冥，八狼御律，齐音铿铿，云璈虚弹，历落宫商，角羽纳征，合空洞明，神姬八百，歌舞上清，云帔锦袂，羽巾徊青，右挥浩真，左招晨桑，窈窕云陈，翠华流星，仿翔罗列，交袂连颈，潜濯太虚，弹空吸景，呼七道之紫烟，流龙烛之荧荧，万盼极欢，逍遥霄领，迈霞超空，凌厉玉城，天钧凤音，羽鸾唱鸣，飞华雪洒，夜日运精，琼华九节，洁白如霜，太桂生系，扫拂圆明，晨霞列辔，三轮九軿，沸洞虚玄，颠倒杳冥，大哉 玉驾，何灵德之至尊，郁矣 霄景，何飞蕊之蔚翰。 夫大音洞畅，玉道幽邃，高曜回明，玄华朗蔚，妙响却扇，神姬列卫，五老辅身，进德益炁，和魂摄精，七魄受制，洞仙虚真，帝一尊贵，於是司命齐飙，公子同軿，徊辔八涂，流神九精，五帝下迎，上造上清，北谒五帝，唱咏洞经，寝宴太素，华羽圆明，金妃诣房，玉童散香，读讫於此，心拜四方，所以尊贵洞灵，心愿腾空也。",
      "translated_text": "Then the Supreme Lord of the Great Dao mounts the chariot of twofold effulgence, driving the Seven Primes of Crimson Clouds. He summons the Subtle Emperor of the Central Vermilion, named Ding Wuyan, and together they journey southward to the Lofty Peach and Fierce Surge Dragon Net Heaven, where they behold the Jade Clarity Winged Sun Empty Sovereign, the Supreme Lord of the Great Dao, and receive the Hidden Talisman of the Contemplation of the Numinous Origin of the Dawn.\n\nNext, the Supreme Lord of the Great Dao mounts the chariot of threefold effulgence, driving the Six Primes of Red Clouds. He summons the Purple Tenuity White Emperor, named Qu Yuanshi, and together they journey westward to the Azure Fall and Empty Song Jade Pear Heaven, where they behold the Jade Clarity Prosperous Yang Origin Empty Sovereign, the Lofty Primordial Lord, and receive the Hidden Talisman of the Nine Poles of the Grand Dawn.\n\nNext, the Supreme Lord of the Great Dao mounts the chariot of fourfold effulgence, driving the Five Primes of Azure Clouds. He summons the Mysterious Tenuity Black Emperor, named Qi Yuanxuan, and together they journey northward to the Vast Desert and Towering Obscurity Heaven, where they behold the Jade Clarity Sevenfold Stillness Life-Guiding Lofty Supreme Empty Sovereign Lord and receive the Hidden Talisman of the Overlapping Radiance and Rotating Root.\n\nNext, the Supreme Lord of the Great Dao mounts the chariot of fivefold effulgence, driving the Four Primes of Yellow Clouds. He summons the Primordial Tenuity Supreme Emperor, named Jie Kongzi, and together they journey northeastward to the Supporting Blade and Canopy Flower-Floating Net Heaven, where they behold the Jade Clarity Supreme Brilliance Empty Sovereign, the Cavernous Clarity Lord, and receive the Hidden Talisman of the Mysterious Effulgence of the Level Dawn.\n\nNext, the Supreme Lord of the Great Dao mounts the chariot of sixfold effulgence, driving the Three Primes of Green Clouds. He summons the Numinous Tenuity Central Emperor, named Bing Juwen, and together they journey southeastward to the Possessing Flourishing and Initial Silence Heaven, where they behold the Jade Clarity Primordial Origin Empty Sovereign, the Supreme Empyrean Lord, and receive the Hidden Talisman of the Converging Radiance of the Dawn Mandate.\n\nNext, the Supreme Lord of the Great Dao mounts the chariot of sevenfold effulgence, driving the Two Primes of Purple Clouds. He summons the Proclaiming Tenuity Lower Emperor, whose lord is named Hong Fuzi, and together they journey southwestward to the Surging Harmony and Nurturing Separation Sand Heaven, where they behold the Jade Clarity Sevenfold Contemplation Non-Birth Empty Sovereign, the Golden Numinous Lord, and receive the Hidden Talisman of the Aligned Radiance of the Mysterious Dawn.\n\nNext, the Supreme Lord of the Great Dao mounts the chariot of eightfold effulgence, driving the One Prime of Numinous Clouds. He summons the Cavernous Tenuity True Emperor, named Si Chengshu, and together they journey northwestward to the Solitary Green and Scrutinizing Treasure Wheel Dharma Heaven, where they behold the Jade Clarity Eightfold Contemplation Lofty Primordial Empty Sovereign, the Tranquil Effulgence Lord, and receive the Hidden Talisman of the Lofty Dragon Mist.\n\nThen the Supreme Lord of the Great Dao mounts the Cavernous Effulgence Jade Chariot, driving the Grand Auroral Purple Mist and Mysterious Effulgence’s radiance. He summons the Ninefold Tenuity Inner Emperor Lord, named Shen Mingxian, along with the Supreme Sovereign, the Ninefold Mysterious, and the Nine Heavens’ various perfected immortals and transcendents, and together they ascend to the Mijianluo Terrace, the Empyrean’s Utmost Desolation Mound, the Soaring Non-Cloud Root Capital of the Jade Clarity Upper Heaven. There they behold the Jade Clarity Purple Radiance Supreme Jade Sovereign, the Illustrious Supreme Lord of the Great Dao, and receive the Hidden Talisman of the Lofty Clarity, Supreme Void, and Boundless Upper Dao Lord.\n\nSuch is the solemnity of the Supreme Lord’s ninefold journey, the inception of his soaring ascent. The eightfold effulgent chariots proceed in sequence, the eightfold primes wafting mists; the jade chariot’s flying banners, the grand aurora encircling its wheels. Sun and moon are drawn together, escorting the imperial carriage and raising its canopy. The Five Emperors drive forth, illuminating the Nine Heavens; the Primordial Rigidity grasps the register, the Northern Culmen commands the spirits. The Supreme Emperor unfolds the Dao, the Grand Simplicity gathers the clouds. Seven thousand divine tigers roar mightily, nine hundred venomous dragons open the ford. Fierce beasts sing the path, sixfold leaders bear mountains in their jaws; eagles and birds of prey brandish their talons, severing the nets of myriad treacheries. The Nine Emperors gird themselves with the sun’s effulgence, the Five Marchmounts cleave the nine barriers.\n\nBehold the fiery armor of blazing cypress, the circular array of forest-like weapons. Wielding hundred-fathom halberds, they topple mountains and drain rivers. The Heavenly Soldiers and Martial Troops, myriad upon myriad of coiling serpents; the female cavalry rides a thousand leagues, their feathers drifting in the void. They hurl fire-bells upward, leaping through the air in dazzling streams. Molten metal surges in reverse, bursting asunder the eight corners. The majestic wind penetrates the source, uprooting forests and tearing out trees.\n\nAuspicious clouds darkly soar, dragon mists obscurely interweave and support. Girded with the seven dawns’ nocturnal effulgence, they bind the nine luminances’ moon-pearls. Black tigers roar and howl, scattering and spreading the celestial array. Jade is struck and bells resound; the Northern Feng unfolds the dawn. The bright reins traverse the nine thoroughfares, precious incense and blossoms scatter. The effulgent chariot hurls through the empyrean, the eight primes dance upon the canopy. A thousand myriad paths, yellow-robed master soldiers; feathered canopies float in the void, cinnabar banners extend their essence. Brocade-fanged dragon standards, myriad upon myriad, vie in splendor. Flying mists press against the sun, their luster dimming its brilliance; fivefold auroras entwine its radiance, surging and filling the empty courtyard.\n\nGrasping the tally to subdue demons, brandishing swords to tread upon spirits. Dragon-men blow upon flutes, patterned tigers play upon zithers. Jade drums shake with thunder, the ninefold radiance turns day to dusk. Eight wolves govern the pitch-pipes, their harmonious tones resounding. Cloud harps are strummed in the void, traversing the falling notes of gong and shang. Horn and feather receive the zhi, merging with the empty and cavernous brilliance. Eight hundred divine maidens sing and dance in the Upper Clarity. Cloud-veiled brocade sleeves, feathered kerchiefs fluttering in the azure. To the right, they wave the Vast Perfected; to the left, they summon the Dawn Mulberry. Graceful and distant, the cloud array; emerald canopies flow like meteors. Soaring and wheeling in formation, sleeves and necks intertwined. Bathing in the Grand Void, plucking the empty space to absorb effulgence. They call forth the sevenfold Dao’s purple mists, streaming the dragon candles’ flickering glow. Ten thousand glances reach the utmost joy, carefree upon the empyrean’s ridge. Treading upon auroras, surpassing the void, fiercely ascending the jade city. The celestial harmony’s phoenix tones, feathered simurghs sing in unison. Flying blossoms snow in descent, the nocturnal sun revolves its essence. Nine-jointed jasper blossoms, pure white as frost. Grand cassia trees grow in succession, sweeping and brushing the perfect clarity. Dawn auroras array the reins, three wheels and nine chariots. Seething and penetrating the empty and mysterious, overturning the distant and obscure.\n\nHow great is the jade chariot’s majesty! What supreme virtue of numinous power! How lush is the empyrean’s effulgence! What flourishing splendor of soaring petals!\n\nFor the grand tone penetrates the cavernous, the jade Dao is profoundly remote. Lofty radiance revolves its brilliance, mysterious blossoms brightly flourish. Wondrous echoes recede like parted fans, divine maidens array in guard. The Five Elders assist his person, advancing virtue and augmenting qi. Harmonizing the hun and gathering the essence, the seven po are restrained. The Cavernous Immortals and Void Perfected, the Emperor Unity is most honored. Thereupon, the Directors of Destiny ride the whirlwind in unison, the Lords and Heirs share the chariot. Wheeling the reins upon the eight paths, flowing spirits through the ninefold essences. The Five Emperors descend to welcome, ascending to the Upper Clarity. Northward they pay homage to the Five Emperors, chanting and intoning the Cavernous Scriptures. Reposing in the Grand Simplicity, blossoming feathers in perfect clarity. Golden consorts approach the chamber, jade lads scatter incense. Upon concluding the recitation, they bow in reverence to the four directions. Thus is the honor accorded to the Cavernous Numinous, the heart’s aspiration to soar through the void.",
      "overlap_context": "etrate all regions. Thereupon, the Supreme Lord of the Great Dao first mounts the chariot of a single effulgence, driving the Eight Primes of Purple Clouds. He summons the Subtle Emperor of the Vast Granary, named Luzi of the Abundant Register, and together they journey eastward to the Jade Terrace of the Heaven of Joyous Forests, where they behold the Supreme Lord of the Jade Clarity and the Purple Dao, the Empty Sovereign, and receive the Hidden Talisman of the Nine Radiance of the Great Dawn.",
      "start_char": 4937,
      "end_char": 6178,
      "start_sentence": 60,
      "end_sentence": 74,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 50.08771371841431,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高圣太上大道君洞真金元八景玉录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "毕。 受大洞真经三十九章，太上大道君玉箓，八风徘徊帝一之道者，当先清斋三年，或清斋七百日，或清斋一百四十日，沐浴五香，存真念仙，玄心苦告，稽首师门，乃受之矣。 授经曰师君，受经曰弟子，自非赤心坦幽，长苦灵囿，肘伏师门，顿首德宇者，而洞经玉箓终不告兆也。 兆身无奇炁特锺自然合神，神光内照，羽晖映玄，太素生五藏，七灵入泥丸，骨有五帝之玉晖，血有流金之浩泉，如此皆天仙之相也。 自无此天相，亦终不与此经师相遭遇矣。 受经盟誓，割青破镮，启约相授，截带骨亲，然后乃得行帝一之炁，读大洞真经，太上玉箓焉。 经师源於本玄，摄始炁以运幽，拔滞路以通真，启云津以告翘，大渡越於水火，必生明乎济超。 为此经弟子者，当苦心经戒，尊奉师君，馔膳同味，甘苦分均，始终镜於神明，崄痾同於涂辛，然后帝一盼善以恒坦之固，太上挥匠以必成之轮，心膂无鬲於所崇，五藏不沈累於泥丸，於是炁遘晨霄，德拔七玄，世世生大福，子孙常贵仙，重玄累万万，方来植道根，祖考反生胎，太上辅兆神。 於是玉房明白，九徊混分，镜心常一，百灵欢然，盈缩所苦，常存师君。 大洞真经高上首篇三十九章，毕於是焉。 受大洞真经三十九章、太上大道君八景玉箓、八风徘徊帝一之道、太丹隐玄回元五通、十二上愿玄母八间、先进洞房金华雌一九玄列纪，灵书紫文、镇生五藏琅玕华丹者，当破镮割绳乃得传之，节度如左： 紫金为镮，镮径一寸，截破一镮，分为两半，经师及弟子当各带一半，终身佩之； 青丝为绳，綖长九尺，各割半以缠绕缚此半镮，又合带之； 青锦一尺八寸，各分半为囊，以盛此金半镮及青丝绳矣。 分镮绳各毕，弟子三拜受经，经师跪授之，各心中存祝曰：某甲今受大洞真经三十九章、太上大道君八景玉箓，当令身升紫虚，上造仙宫，七祖父母，反胎摄生，大福大庆，世世来庭，子孙繁盛，千千华明，受经无泄，讽修玉章，事事如法戒，奉以保身形。 违戒背经，世世生祸殃，割丝截镮，上闻三清，下告五岳，北帝三官。 毕。",
      "translated_text": "Upon completion.\n\nTo receive the *Thirty-Nine Chapters of the Great Cavern Perfected Scripture* and the *Jade Register of the Supreme Lord of the Great Dao*, the *Eight Winds’ Circuit of the Dao of the Emperor Unity*, one must first purify the fast for three years, or for seven hundred days, or for one hundred forty days. Bathe in the five fragrant herbs, preserve the true and meditate upon the immortals, with a profound heart earnestly entreat, prostrating at the master’s gate—only then may one receive them.\n\nThe one who transmits the scripture is called the *Master Lord*; the one who receives it is called the *Disciple*. Unless one’s heart is utterly sincere and the depths of the unseen laid bare, enduring long suffering within the numinous precincts, abasing oneself at the master’s gate and bowing the head in the hall of virtue, the *Cavern Scripture* and *Jade Register* shall never be revealed to the aspirant.\n\nIf the aspirant’s body is not naturally endowed with extraordinary *qi*, uniquely concentrated to harmonize with the spirit, if the spirit’s radiance does not inwardly illuminate and the feathered splendor does not reflect the profound, if the Grand Simplicity does not generate the five viscera and the seven numina do not enter the *niwan*, if the bones do not bear the jade radiance of the Five Emperors and the blood does not flow with the vast spring of molten gold—such are the marks of a celestial immortal.\n\nWithout these celestial signs, one shall never encounter a master of this scripture. Upon receiving the scripture, the covenant is sworn: the green jade ring is split, the pledge is opened for transmission, the belt is severed from kin—only then may one practice the *qi* of the Emperor Unity, recite the *Great Cavern Perfected Scripture*, and receive the *Jade Register of the Supreme Lord*.\n\nThe scripture master originates from the primordial mystery, gathering the initial *qi* to traverse the unseen, clearing the obstructed paths to commune with the perfected, opening the cloud-crossings to guide the aspirant. Greatly crossing beyond water and fire, one must be born in clarity to achieve transcendence.\n\nFor those who become disciples of this scripture, they must devote themselves to its precepts with suffering heart, revering and serving the Master Lord, sharing the same flavors in food and drink, equally partaking in sweetness and bitterness. From beginning to end, they must mirror the divine luminaries, sharing peril and hardship as if on the same arduous path. Only then will the Emperor Unity gaze upon their goodness with enduring steadfastness, and the Supreme Lord wield the craftsman’s skill to complete the wheel. The heart’s core shall know no barrier in its devotion, the five viscera shall not sink beneath the burdens of the *niwan*. Thus, the *qi* shall meet the morning clouds, virtue shall uplift the seven mysteries, generation after generation shall be born with great fortune, descendants shall ever be noble immortals. Layer upon layer of the profound shall accumulate ten thousand myriad-fold, planting the roots of the Dao for ages to come. Ancestors shall return to the womb of rebirth, and the Supreme Lord shall aid the aspirant’s spirit.\n\nThereupon, the jade chamber becomes luminous and clear, the ninefold circuits merge and divide. The mirror of the heart remains ever unified, and the hundred spirits rejoice. In all expansion and contraction of suffering, the Master Lord is ever held in mind.\n\nThe *Thirty-Nine Chapters of the Great Cavern Perfected Scripture*, the highest and foremost section, concludes here.\n\nTo receive the *Thirty-Nine Chapters of the Great Cavern Perfected Scripture*, the *Eightfold Radiance Jade Register of the Supreme Lord of the Great Dao*, the *Eight Winds’ Circuit of the Dao of the Emperor Unity*, the *Fivefold Mysterious Return of the Concealed Cinnabar*, the *Twelve Supreme Vows of the Mysterious Mother of the Eight Intervals*, the *Golden Flower of the Cavern Chamber’s Preceding Feminine Unity and the Ninefold Mystery Array*, the *Numinous Writ of the Purple Text*, and the *Jade-Stemmed Cinnabar of the Five Viscera’s Life-Securing Treasure*—one must sever the jade ring and cut the cord to be worthy of their transmission. The regulations are as follows:\n\nFashion a ring of purple gold, one *cun* in diameter. Sever one ring, dividing it into two halves. The scripture master and the disciple shall each wear one half for life.\n\nTake a cord of green silk, nine *chi* in length. Each shall cut half to bind their half-ring, then wear it together.\n\nTake a piece of green brocade, one *chi* and eight *cun* in size. Each shall divide it in half to make a pouch, in which to store their half-ring and green silk cord.\n\nOnce the ring and cord are divided, the disciple shall bow three times to receive the scripture, and the scripture master shall kneel to transmit it. Each shall silently recite the vow:\n\n*\"I, [Name], now receive the* Thirty-Nine Chapters of the Great Cavern Perfected Scripture *and the* Eightfold Radiance Jade Register of the Supreme Lord of the Great Dao*. May my body ascend to the Purple Void, attaining the immortal palaces. May my seven generations of ancestors return to the womb and be reborn. May great fortune and blessing fill my halls for generations to come. May my descendants flourish, a thousand thousand in radiant splendor. I shall not reveal the received scripture, but recite and cultivate its jade chapters, adhering to every precept and ritual to preserve my form.\"*\n\nShould one violate the precepts or betray the scripture, calamity shall befall generation after generation. The severing of the silk and cutting of the ring shall be heard above by the Three Clarities, below by the Five Peaks, and by the Northern Emperor and the Three Officials.\n\nThus concludes the transmission.",
      "overlap_context": "fold essences. The Five Emperors descend to welcome, ascending to the Upper Clarity. Northward they pay homage to the Five Emperors, chanting and intoning the Cavernous Scriptures. Reposing in the Grand Simplicity, blossoming feathers in perfect clarity. Golden consorts approach the chamber, jade lads scatter incense. Upon concluding the recitation, they bow in reverence to the four directions. Thus is the honor accorded to the Cavernous Numinous, the heart’s aspiration to soar through the void.",
      "start_char": 6178,
      "end_char": 6974,
      "start_sentence": 75,
      "end_sentence": 91,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.703869342803955,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高圣太上大道君洞真金元八景玉录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "晋永和十一年岁在乙卯，九月一日夜半，受经於紫微王夫人。 凡二万二百三十字，其《大洞真经》一万字。 上清高圣太上大道君洞真金元八景玉箓竟",
      "translated_text": "In the eleventh year of the Yonghe reign of the Jin dynasty, in the year *yimao* (Wood Rabbit), on the first day of the ninth month at midnight, the scripture was received from Lady Wang of the Purple Tenuity. In total, twenty thousand two hundred and thirty characters, of which *The Perfect Scripture of the Great Cavern* comprises ten thousand characters. Here concludes the *Jade Register of the Eight Radiant Numina of the Golden Prime of the Dao*, bestowed by the Most High and Venerable Supreme Lord of the Great Dao of the Upper Clarity.",
      "overlap_context": "thousand thousand in radiant splendor. I shall not reveal the received scripture, but recite and cultivate its jade chapters, adhering to every precept and ritual to preserve my form.\"*\n\nShould one violate the precepts or betray the scripture, calamity shall befall generation after generation. The severing of the silk and cutting of the ring shall be heard above by the Three Clarities, below by the Five Peaks, and by the Northern Emperor and the Three Officials.\n\nThus concludes the transmission.",
      "start_char": 6975,
      "end_char": 7046,
      "start_sentence": 92,
      "end_sentence": 94,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.3751676082611084,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清高圣太上大道君洞真金元八景玉录.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}