{
  "source_id": "上清太上元始耀光金虎凤文章宝经",
  "source_file": "chunked_daozang\\上清太上元始耀光金虎凤文章宝经.json",
  "total_chunks": 3,
  "total_original_chars": 2267,
  "total_translated_chars": 15255,
  "total_translation_time": 79.46251797676086,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\上清太上元始耀光金虎凤文章宝经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Clarity Precious Scripture of the Primordial Radiant Light of the Golden Tiger and Phoenix Writ**\n\n**Scripture Title:** *The Supreme Clarity Precious Scripture of the Primordial Radiant Light of the Golden Tiger and Phoenix Writ*\n**Author:** Unknown, approximately dated to the Northern and Southern Dynasties period.\n**Volume:** One.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, Orthodox Section, Part One.\n\n---\n\n### *The Supreme Clarity Precious Scripture of the Primordial Radiant Light of the Golden Tiger and Phoenix Writ*\n\n#### **The Hidden Script of Concealed Taboos**\n#### **The Hidden Words of the Scripture**\n\n#### **The Earthly Sovereign’s Exposition on the Phoenix Writ**\n#### **The Human Sovereign’s Phoenix Writ**\n#### **The Supreme Phoenix Writ**\n\n#### **The Hidden Script of Concealed Taboos**\n#### **The Hidden Words of the Scripture**\n\nThe Supreme Three Sovereigns and Great Perfected of the Mystic Cavern, the Upper Cavern Dao Lord, declared:\nThe true talismans of the Golden Tiger and Phoenix Writ were issued by the Celestial Parents of the Supreme Perfected, transmitted by the Supreme Perfected Elder from the Three Sovereign Lords, and passed through kalpas to the Youth of the Eastern Sea. The Nine Heavenly Kings conveyed them to the Supreme Lord of the Great Dao, who treasured and concealed them within the Jade Chamber of the Numinous Capital of the Grand Tenuity, guarded by the Great Beasts of the Vast Heavens, defended by Poisonous Dragons and Golden Tigers, and escorted by seven thousand attendants. Within the Jade Palace, three hundred Golden Dawn Jade Lads and three hundred Pure Numinous Jade Maidens served to protect the sacred writ. Its numinous radiance illumined the void, purple mists dispersed across the celestial court, its majesty resounding through the nine distant realms. The great deities of the August Heaven shone resplendent in the Supreme Clarity, its wondrous harmony unfolding in spontaneity, its wisdom penetrating the formless.\n\nThe Divine Tiger adorned its head, the Golden Tiger guarded its truth, wisdom marked its trunk, and demonic roots were severed at their source. Its subtle meanings were profound and obscure, its marvels too intricate to detail—all inscribed with the hidden taboos of heavenly demons and the inner names of the hundred spirits. Reciting its chapters startled a thousand essences into motion; chanting its verses bound ten thousand demons in form. At the inception of governance in the Three Heavens, it was transmitted to the Celestial Emperor of the Grand Tenuity, empowering him to command the Six Heavens, decapitate myriad spirits, subdue mountain valleys, and summon the gods of the seas. All essences girded themselves in submission. The host of spirits deployed talismans, their mighty awe shaking demons, evil vanishing in form, the true gods of the earthly prisons realigning the net of the Five Stars.\n\nThereupon, the Celestial Emperor of the Grand Tenuity received the *Golden Tiger and Phoenix Writ of Demonic-Dispelling Wisdom*, bearing its talismans in roaming play. He traversed the Supreme Clarity, soaring beyond the void, floating upon the wheel of the firmament. The Grand Tenuity’s radiance settled in the lofty hall; the Supreme Perfected paused upon the palace steps, harmonizing with Heaven and Earth in covenant, illuminating the Seven Luminaries in sublime brilliance. Aligned with the revolutions of the Three Sovereigns, its light shone through the Nine Nether realms. He grasped the cloud tablets upon the cliffs, his jade chapters gleaming in the numinous mechanism, encompassing the myriad transformations in profound wisdom, summoning divine perfected and the hundred yang. Thus, lightning flashed against ten thousand poisons, sweeping away billions, causing all malevolent spirits to perish and toxins to vanish. Its majesty resounded through distant courts; the Golden Dawn unfurled the Dao, leaving no room for self-concealment. Above, he gazed into the inner Golden Palace, where the Eight Luminaries responded to his command. Numinous officials mounted Golden Tigers, bearing him to soar beyond the void. A host of dragons opened the immortal path, ascending afar to pay homage to the Grand Tenuity. The Three Terraces led the way; the Seven Stars followed in swift pursuit. He flew and soared, galloping upon the divine steed, exuberantly attuned to the celestial mechanism. Gazing through the Nine Mystic Gates, he roamed to the farthest reaches of Heaven. Resting in the jasper chambers of the Phoenix Pavilion, his comings and goings flowed without cease. Subtle indeed was the celestial true talisman; the august numen bore its wondrous title.\n\n#### **The Earthly Sovereign’s Exposition on the Phoenix Writ**\nThe Earthly Sovereign transmitted the talismanic chapters of the Golden Tiger and Phoenix Writ to the Celestial Emperor of the Grand Tenuity. The Celestial Emperor of the Grand Tenuity then informed the Most Sage Azure Youth Lord. Thereupon, the Lord of the Western City declared:\n*The Supreme Clarity Scripture of Great Wisdom for Dispelling Demons*—this is the Phoenix Writ of the Three Sovereigns, the inner script of the Great Ultimate, the hidden taboos of the host of spirits, the jade chapters of the Supreme, the precious formulas of the Upper Sovereign, the precious writ of the Golden Tiger. Its wisdom can expel filth and annihilate demons, perform great exorcisms to restrain poisons, and discern evil—no malevolent spirit shall remain unshattered in form. Bearing it, one harmonizes with form to ascend and transcend, scattering radiance in all directions, roaming the ford-crossings of the seas. No harm shall befall, and one may sit or stand in vanishing presence, communing with the Mystic, attaining desires in an instant—what wish would not be fulfilled?\n\nNow, with divine majesty, I transmit it to you. Cultivate it diligently, for this true scripture is lofty and wondrous. Recite it ten thousand times to achieve mastery, and proclaim it to encourage later worthies to receive the true teachings. Adhere to the regulations of the Supreme Perfected; do not casually reveal it to the unworthy. In an age devoid of faithful and compliant individuals, after seven hundred years, it shall reemerge at the end of the Ma clan, when virtuous power reaches the Song region. Its mighty efficacy shall assist three transmissions, ascending to the Grand Ultimate Duke. Unless one possesses the bearing of dragons and phoenixes, how could one share in the treasure of the worthy?\n\n#### **The Human Sovereign’s Phoenix Writ**\nThe Phoenix Writ descended from afar,\nThe Golden Tiger illumined the divine perfected.\nIts application bore primordial merit,\nNever bestowed upon the impure and defiled.\nIt covered and sustained the masters of the Three Caverns,\nAscending to the guests of the Supreme Mystery.\nPassing the gates of the Queen Mother of the West,\nRoaming the ford-crossings of the Celestial River.\nFirst paying homage to the Emperor of the Great Ultimate,\nTraversing thirty heavens through kalpas.\nFrequently receiving the descent of celestial perfected,\nWith jade maidens numbering in the thousands.\nGolden lads descended to the left,\nJade maidens attended to the right.\nBestowed with the Nine-Bend Staff,\nHow resplendent was its jade!\nCelestial officials descended in its train,\nThe Five Peaks led the way before.\nHeavenly beings played flutes and struck chimes,\nPipes and songs guarded the space between.\nMountains and seas stilled into waves,\nThe pure path free of dust and shadow.\nDescending to play in the Four Waterways,\nThe Five Peaks briefly revolved.\nAll demons hid in submission,\nMalevolent spirits perished in form.\nFlying radiance within the crimson palace,\nExuberantly following the host of immortals.\nWith focused intent, receiving Heaven’s descent,\nAscending to the August Heaven in broad daylight.\nWhy not strive with diligence,\nTo broadly seek the ford-crossings of enlightened masters?\nThe Heavenly Sovereign’s Dao was lofty and wondrous,\nPenetrating above to the sage perfected.\nThe Earthly Sovereign followed in clarity,\nHis virtue aligned with the Emperor’s causes.\nThe Human Sovereign’s transformation was sagely,\nHis virtue equaling the celestial wheel.\n\nMasters transmitting this to disciples must all observe a pure fast for ninety days, or thirty days, or a minor fast of seven days. They must present seven taels of refined gold as a token of faith for the Golden Tiger and Phoenix Writ. Ninety feet of cinnabar-red brocade shall be offered to swear an oath to the Nine Heavens. Forty feet of azure silk shall be used to pledge allegiance to the scripture.\n\nThose who cherish the Dao and align with the True, who diligently focus their hearts on the Mysterious, who spare no wealth nor treasure their bodies but hold fast to faith—nothing shall fail to descend upon them, nor shall anything remain unchanged. Those who receive this teaching must seek with diligence, never rushing ahead in transgression. Day and night, they must remain unsleeping, striving ever to surpass others. Why indulge in laziness and neglect, sitting idly to incur faults? To embody the Law is to unite with the Dao; those who do not embody it must not speak recklessly. If both inner and outer are but superficial adornments, how can one truly associate with others? Beware: wealth becomes a burden, and slander may ruin both name and self. Even the slightest misdeed is known to Heaven—do not claim that trifles do not entangle. I urge you to evade the snares of the world, gradually retreat to shelter in the famed mountains. In the stillness of mountains and marshes, devoid of distraction, the myriad spirits may be preserved. Frequently disperse your treasures to redeem past-life transgressions. In every generation, become a bridge to ferry those lost in darkness. Diminish excess to supplement deficiency, and your merit shall spread to the eight directions. When calamity arises, it is through the Dao that deliverance comes; the Dao’s descent offers sheltering wings. When bestowing grace, act swiftly—do not wait until disaster strikes. Once disaster has struck, fault is already sealed; it cannot be undone. Though you may strive to undo it, your strength may prove insufficient, leaving you to sit in helpless poverty.\n\nWear the Golden Tiger and Phoenix Writ as an upper talisman, inscribed in cinnabar. Alternatively, it may be written in cinnabar upon an azure ground.\n\nThe August Dao declares: Daoists who study the Way of Immortal Perfection must establish merit among humankind. After years of practice, they should enter the Five Marchmounts and other sacred mountains. If scholars endure hardship yet have not yet refined their reclusion, or if they set their sights on divine herbs and directly journey to the mountains—though the path be long and distant—should they suddenly encounter the Three Calamities or Five Adversities, unable to deploy their arts, finding themselves amidst evil bandits, ghosts, or malevolent spirits, they must invoke the might of divine power in a grand incantation. Facing the perilous place, they shall strike the Heavenly Drum thirty-six times in unison, summoning the gods within their bodies, and pray thus:\n\n*\"May the Mystic Sound of the Nine Heavens descend in perfect harmony, governing the Four Directions and unfolding the myriad divine blossoms. May it transcend stagnant celestial traces, embracing the Three and Five in boundless array. May it turn the plain into radiant splendor, chanting the swift decree of fate. By cinnabar oaths and solemn vows, may afflictions be dissolved and maladies dispelled. May luminous glory shine on high, its radiance filling the household. Like Bo Le wielding his whip, may it vanquish demonic hordes, reclaiming lost lineages and obliterating the Nine Netherworlds. By the tiger talisman’s divine might, may all evil be subdued, all adversaries—great or small—annihilated. May the Nine Yin’s perversity be severed, and misfortunes buried in the shifting sands. May all poisons be subdued, and a hundred trials overcome. Let this be proclaimed as merit worthy of reward, unbetraying the Great Harmony.\"*\n\n**Lofty Phoenix Writ of the Most High**\nResplendent upon the Five-Rayed Peak,\nA solitary summit gleams with celestial radiance.\n\nThe scholar lacks strict purity,\nThe officers and soldiers fail to comply.\nI follow the Orthodox Dao in practice—\nHow dare the myriad evils assail me?\nMy body bears the Golden Spirit’s token,\nTinkling bells fly beside me in flight.\nTalismans of the Three Heavens and Five Peaks\nGuide my path before and behind.\nThe Heavenly Net is cast wide,\nThe Earthly Snare is set in place.\nGhosts, demons, and venomous beasts—\nAt the sight of me, they crumble and fall.\nHow dare thieves and bandits approach?\nThe Golden Phoenix devours their decay.\nA thousand spirits lose their eyes,\nTen thousand demons flee like thunder.\nHow can thieves and bandits be tolerated?\nThe Three Officials shall sternly pursue them.\nHasten their flight, drive them in rout—\nTiger Soldiers shall strike with pain.\nSwiftly, swiftly, by imperial decree,\nProclaim the awe of the Supreme Might.\nThose with merit shall be promoted and rewarded,\nThose without shall be pursued by ten thousand mechanisms.\nSwiftly, swiftly, as the Bright Heaven’s curse and command!\n\nThere is also the Great Talisman for Dispelling Demons,\nFound in the *Scripture of Heavenly Water for Dispelling Demons*,\nWhich may be preemptively employed to repel evil,\nFollowed by the divine incantation’s execution of command.\nThis is the hidden sound of the Demon Kings of the Nine Heavens—\nIt should also be worn and recited to subdue demons.\nWhen no recitation is used for control,\nFirst ingest a talisman to strengthen the inner spirits’ resonance.\n\nIn the third year of the Xingning reign, the *yichou* year, the seventh day of the seventh month,\nTongbo Perfected received from Le Zichang and Master Anqi\nThe *Golden Tiger Phoenix Writ Talismans* concealed within the Three Sovereigns’ treasury,\nCommanding the late-learning Daoist Xu Yuanyou to receive them\nFor the subduing of the myriad demons.\nThe divine incantation’s efficacy extends to the years *yiwei*, *jiashen*, *yihai*, *renchen*, and *guisi*,\nOn the first day of the ninth month, the seventh day of the seventh month, and the eighth day of the fourth month—\nOn these three days, there shall appear worthy persons and Daoists,\nClad in seven-colored ritual robes, staff in hand,\nUpon the sacred altar or among the people, making petitions.\nAt such times, they chant scriptures, recite texts,\nOr raise voices in wild song.\nIf you encounter such a person,\nDiligently inquire and fully explain your circumstances—\nThey shall surely bestow upon you the *Upper Talisman of the Golden Tiger*,\nAlong with essential teachings.\nTake care not to slight them—\nThese are Perfected Ones in hidden transformation.\nThe Perfected of Mount Nanyue are often dispatched\nBy the Most High Lord of the Boundless Dao and the Heavenly Thearch,\nSometimes descending among the people\nTo observe the earnestness of late-learning Daoists in the degenerate age.\n\nThe *Upper Clarity Scripture of the Primordial Beginning’s Radiant Light: Golden Tiger Phoenix Writ* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清太上元始耀光金虎凤文章宝经 经名：上清太上元始耀光金虎凤文章宝经。 撰人不详，约出於南北期。 一卷。 底本出处：《正统道藏》正一部。 上清太上元始耀光金虎凤文章宝经 上隐书讳 上隐书辞 地皇叙凤文章 人皇凤文章 高上凤文章 上隐书讳 上隐书辞 高上三皇太真玄洞上洞道君曰：金虎凤文章真符，是太真九天父母所出，太真丈人从三皇君所受，积劫以传东海小童。 九天王以传太上大道君，常所宝秘，藏之於太微灵都玉房之里，卫以巨天大兽，捍以毒龙金虎，导以七千人，备于玉阙，金晨玉童、素灵玉女各三百人，侍卫灵文，玄晖空映，散烟紫庭，威振九遐之域，皇天大神焕乎上清、妙畅启於自然，洞彻慧於无形。 神虎班其首，金虎卫其真，智慧标其干，消魔馘其源，微旨幽邃，妙辄难详，皆署天魔之隐讳，亦标百神之内名，诵其章则千精骇动，咏其篇万妖束形。 以三天立政之始，传付太微天帝君，使威制六天，斩截万神，摄山谷，召海神，众精为之束带。 群灵施符，大威振魔，邪灭於形，地狱真神，回纲转五星。 於是太微帝君奉受消魔智慧金虎凤文，佩符游遨，洞戏上清，超乘虚逸，玄浮霄轮，太微澄景於高馆，太真止足乎阶庭，与天地合其契，耀七景而高明。 齐运度於三皇，耀七落於九冥，握云节於崖岭，焕琼章於机灵，括万度於玄聪，檄神真而召百阳。 於是电耀万毒，荡灭亿千，使万祆灭毒，威振遐庭，金晨披道，无容自开，上窥金阙内，八景应命回，灵官御金虎，载我绝空飞，群龙启仙路，遥上谒太微，三台为引导，七星从奔驰，飞澄骋神筑，郁郁乎天机，洞观九玄门，游览极天涯，燕寝琼房轩，往还浩不衰，微乎天真符，皇灵将妙号。 地皇叙凤文章 地皇付金虎凤文符章於太微天帝君，太微天帝君告上圣青童君，於是西城王君又曰：《上清大智慧消魔之真经》，此三皇之凤章，太极之内文，众灵之隐讳，高上之玉篇，上皇之宝诀，金虎之宝章。 智慧可以逐秽灭魔，大有所禳制毒，兼以察邪，万祆莫不摧形。 佩之则合形飞超，散景万方，游浪海津，万害不伤，坐在立亡，上与玄通，须立得，何愿不从。 今以威神相付，勤加修躬，真经高妙，当诵此万通，宣劝后贤受真之朋。 当依太真之制，不顺慎勿开容。 世无信顺之人，七百年后当相从，复出马氏末，善德及宋方，威烈辅三传，遂登太极公，自非龙凤姿，焉得宝贤同。 人皇凤文章 凤文既遐降，金虎耀神真。 所加有元功，不降秽浊人。 覆载三洞师，超升高玄宾。 过登王母阙，游浪天河津。 先拜太极帝，劫历三十天。 频蒙天真降，玉女有数千。 金童降於左，玉女侍右边。 加赐九曲节，玉与一何鲜。 天官从其降，五岳导其前。 天人鼓篁璈，箫歌卫其间。 山海为静波，清道无翳尘。 下游戏四渎，五岳亦暂旋。 万魔悉伏藏，妖□并灭身。 飞景绛阙中，郁郁从群仙。 志专蒙天降，白日升皇乾。 何不为勤彻，广览明师津。 天皇道高妙，通上彻圣真。 地皇次其明，德与帝征因。 人皇亦圣化，德同天齐轮。 夫师受弟子，悉当清斋九十日，或三十日，或小斋七日。 皆责上金七两，以为金虎凤文之信。 丹地锦九十尺，以誓九天。 青缯四十尺，以盟其文。",
      "translated_text": "**The Supreme Clarity Precious Scripture of the Primordial Radiant Light of the Golden Tiger and Phoenix Writ**\n\n**Scripture Title:** *The Supreme Clarity Precious Scripture of the Primordial Radiant Light of the Golden Tiger and Phoenix Writ*\n**Author:** Unknown, approximately dated to the Northern and Southern Dynasties period.\n**Volume:** One.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, Orthodox Section, Part One.\n\n---\n\n### *The Supreme Clarity Precious Scripture of the Primordial Radiant Light of the Golden Tiger and Phoenix Writ*\n\n#### **The Hidden Script of Concealed Taboos**\n#### **The Hidden Words of the Scripture**\n\n#### **The Earthly Sovereign’s Exposition on the Phoenix Writ**\n#### **The Human Sovereign’s Phoenix Writ**\n#### **The Supreme Phoenix Writ**\n\n#### **The Hidden Script of Concealed Taboos**\n#### **The Hidden Words of the Scripture**\n\nThe Supreme Three Sovereigns and Great Perfected of the Mystic Cavern, the Upper Cavern Dao Lord, declared:\nThe true talismans of the Golden Tiger and Phoenix Writ were issued by the Celestial Parents of the Supreme Perfected, transmitted by the Supreme Perfected Elder from the Three Sovereign Lords, and passed through kalpas to the Youth of the Eastern Sea. The Nine Heavenly Kings conveyed them to the Supreme Lord of the Great Dao, who treasured and concealed them within the Jade Chamber of the Numinous Capital of the Grand Tenuity, guarded by the Great Beasts of the Vast Heavens, defended by Poisonous Dragons and Golden Tigers, and escorted by seven thousand attendants. Within the Jade Palace, three hundred Golden Dawn Jade Lads and three hundred Pure Numinous Jade Maidens served to protect the sacred writ. Its numinous radiance illumined the void, purple mists dispersed across the celestial court, its majesty resounding through the nine distant realms. The great deities of the August Heaven shone resplendent in the Supreme Clarity, its wondrous harmony unfolding in spontaneity, its wisdom penetrating the formless.\n\nThe Divine Tiger adorned its head, the Golden Tiger guarded its truth, wisdom marked its trunk, and demonic roots were severed at their source. Its subtle meanings were profound and obscure, its marvels too intricate to detail—all inscribed with the hidden taboos of heavenly demons and the inner names of the hundred spirits. Reciting its chapters startled a thousand essences into motion; chanting its verses bound ten thousand demons in form. At the inception of governance in the Three Heavens, it was transmitted to the Celestial Emperor of the Grand Tenuity, empowering him to command the Six Heavens, decapitate myriad spirits, subdue mountain valleys, and summon the gods of the seas. All essences girded themselves in submission. The host of spirits deployed talismans, their mighty awe shaking demons, evil vanishing in form, the true gods of the earthly prisons realigning the net of the Five Stars.\n\nThereupon, the Celestial Emperor of the Grand Tenuity received the *Golden Tiger and Phoenix Writ of Demonic-Dispelling Wisdom*, bearing its talismans in roaming play. He traversed the Supreme Clarity, soaring beyond the void, floating upon the wheel of the firmament. The Grand Tenuity’s radiance settled in the lofty hall; the Supreme Perfected paused upon the palace steps, harmonizing with Heaven and Earth in covenant, illuminating the Seven Luminaries in sublime brilliance. Aligned with the revolutions of the Three Sovereigns, its light shone through the Nine Nether realms. He grasped the cloud tablets upon the cliffs, his jade chapters gleaming in the numinous mechanism, encompassing the myriad transformations in profound wisdom, summoning divine perfected and the hundred yang. Thus, lightning flashed against ten thousand poisons, sweeping away billions, causing all malevolent spirits to perish and toxins to vanish. Its majesty resounded through distant courts; the Golden Dawn unfurled the Dao, leaving no room for self-concealment. Above, he gazed into the inner Golden Palace, where the Eight Luminaries responded to his command. Numinous officials mounted Golden Tigers, bearing him to soar beyond the void. A host of dragons opened the immortal path, ascending afar to pay homage to the Grand Tenuity. The Three Terraces led the way; the Seven Stars followed in swift pursuit. He flew and soared, galloping upon the divine steed, exuberantly attuned to the celestial mechanism. Gazing through the Nine Mystic Gates, he roamed to the farthest reaches of Heaven. Resting in the jasper chambers of the Phoenix Pavilion, his comings and goings flowed without cease. Subtle indeed was the celestial true talisman; the august numen bore its wondrous title.\n\n#### **The Earthly Sovereign’s Exposition on the Phoenix Writ**\nThe Earthly Sovereign transmitted the talismanic chapters of the Golden Tiger and Phoenix Writ to the Celestial Emperor of the Grand Tenuity. The Celestial Emperor of the Grand Tenuity then informed the Most Sage Azure Youth Lord. Thereupon, the Lord of the Western City declared:\n*The Supreme Clarity Scripture of Great Wisdom for Dispelling Demons*—this is the Phoenix Writ of the Three Sovereigns, the inner script of the Great Ultimate, the hidden taboos of the host of spirits, the jade chapters of the Supreme, the precious formulas of the Upper Sovereign, the precious writ of the Golden Tiger. Its wisdom can expel filth and annihilate demons, perform great exorcisms to restrain poisons, and discern evil—no malevolent spirit shall remain unshattered in form. Bearing it, one harmonizes with form to ascend and transcend, scattering radiance in all directions, roaming the ford-crossings of the seas. No harm shall befall, and one may sit or stand in vanishing presence, communing with the Mystic, attaining desires in an instant—what wish would not be fulfilled?\n\nNow, with divine majesty, I transmit it to you. Cultivate it diligently, for this true scripture is lofty and wondrous. Recite it ten thousand times to achieve mastery, and proclaim it to encourage later worthies to receive the true teachings. Adhere to the regulations of the Supreme Perfected; do not casually reveal it to the unworthy. In an age devoid of faithful and compliant individuals, after seven hundred years, it shall reemerge at the end of the Ma clan, when virtuous power reaches the Song region. Its mighty efficacy shall assist three transmissions, ascending to the Grand Ultimate Duke. Unless one possesses the bearing of dragons and phoenixes, how could one share in the treasure of the worthy?\n\n#### **The Human Sovereign’s Phoenix Writ**\nThe Phoenix Writ descended from afar,\nThe Golden Tiger illumined the divine perfected.\nIts application bore primordial merit,\nNever bestowed upon the impure and defiled.\nIt covered and sustained the masters of the Three Caverns,\nAscending to the guests of the Supreme Mystery.\nPassing the gates of the Queen Mother of the West,\nRoaming the ford-crossings of the Celestial River.\nFirst paying homage to the Emperor of the Great Ultimate,\nTraversing thirty heavens through kalpas.\nFrequently receiving the descent of celestial perfected,\nWith jade maidens numbering in the thousands.\nGolden lads descended to the left,\nJade maidens attended to the right.\nBestowed with the Nine-Bend Staff,\nHow resplendent was its jade!\nCelestial officials descended in its train,\nThe Five Peaks led the way before.\nHeavenly beings played flutes and struck chimes,\nPipes and songs guarded the space between.\nMountains and seas stilled into waves,\nThe pure path free of dust and shadow.\nDescending to play in the Four Waterways,\nThe Five Peaks briefly revolved.\nAll demons hid in submission,\nMalevolent spirits perished in form.\nFlying radiance within the crimson palace,\nExuberantly following the host of immortals.\nWith focused intent, receiving Heaven’s descent,\nAscending to the August Heaven in broad daylight.\nWhy not strive with diligence,\nTo broadly seek the ford-crossings of enlightened masters?\nThe Heavenly Sovereign’s Dao was lofty and wondrous,\nPenetrating above to the sage perfected.\nThe Earthly Sovereign followed in clarity,\nHis virtue aligned with the Emperor’s causes.\nThe Human Sovereign’s transformation was sagely,\nHis virtue equaling the celestial wheel.\n\nMasters transmitting this to disciples must all observe a pure fast for ninety days, or thirty days, or a minor fast of seven days. They must present seven taels of refined gold as a token of faith for the Golden Tiger and Phoenix Writ. Ninety feet of cinnabar-red brocade shall be offered to swear an oath to the Nine Heavens. Forty feet of azure silk shall be used to pledge allegiance to the scripture.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1251,
      "start_sentence": 0,
      "end_sentence": 51,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.04489779472351,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上元始耀光金虎凤文章宝经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "好道合真，勤心注玄，无吝财物，贵身好信，应无不降，亦靡不新。 禀之当勤求，勿为过之先，专专夜不寐，务进殊人前，何为自怠慢，端然受坐愆，体法当与道，不体勿妄言，内外并浮好，安可共周旋，慎之财为累，毁名没子身，纤毫天已知，勿言细不缠，愿子避世罗，渐去庇名山，山泽寂无娱，可以存万神，时时散财宝，以赎宿世愆，世世为桥梁，济度幽远人，损有补不足，功施扬八方，过灾当由道，道降翼可蒙，恩施当迎作，勿为待灾冲，灾冲咎已结，非可复料通，料通力不至，念子坐守穷。 佩金虎凤文章上符，以丹书之，亦可以青为地，丹书之。 皇道曰：道士学仙真之道，在人间建立功德，经年之后，应入五岳诸山。 学士苦辛，未及炼隐遁，立望芝药，径造诸山，道里长远，忽遇三灾五难，卒不得施方术，身在恶贼鬼魅之中，皆当作威神大祝。 辄向恶处，同鸣天鼓三十六通，具身中神，因祝曰： 愿九天玄音，降节万和，总统四张，开神万华，越滞天迹，三五兼罗，回素蔚景，咏命伊驰，盟丹启誓，荡释却痾，含光高映，流景盈家，伯乐运策，威馘天魔，收录绝种，灭形九罗，虎符神威，威摄万邪，斩戮无大，纤细悉殂，祆绝九阴，祸灭流沙，万毒悉伏，百难并过，当为言功迁赏，不负太和。 高上凤文章 赫赫五芒岭，孤峰耀太辉。",
      "translated_text": "Those who cherish the Dao and align with the True, who diligently focus their hearts on the Mysterious, who spare no wealth nor treasure their bodies but hold fast to faith—nothing shall fail to descend upon them, nor shall anything remain unchanged. Those who receive this teaching must seek with diligence, never rushing ahead in transgression. Day and night, they must remain unsleeping, striving ever to surpass others. Why indulge in laziness and neglect, sitting idly to incur faults? To embody the Law is to unite with the Dao; those who do not embody it must not speak recklessly. If both inner and outer are but superficial adornments, how can one truly associate with others? Beware: wealth becomes a burden, and slander may ruin both name and self. Even the slightest misdeed is known to Heaven—do not claim that trifles do not entangle. I urge you to evade the snares of the world, gradually retreat to shelter in the famed mountains. In the stillness of mountains and marshes, devoid of distraction, the myriad spirits may be preserved. Frequently disperse your treasures to redeem past-life transgressions. In every generation, become a bridge to ferry those lost in darkness. Diminish excess to supplement deficiency, and your merit shall spread to the eight directions. When calamity arises, it is through the Dao that deliverance comes; the Dao’s descent offers sheltering wings. When bestowing grace, act swiftly—do not wait until disaster strikes. Once disaster has struck, fault is already sealed; it cannot be undone. Though you may strive to undo it, your strength may prove insufficient, leaving you to sit in helpless poverty.\n\nWear the Golden Tiger and Phoenix Writ as an upper talisman, inscribed in cinnabar. Alternatively, it may be written in cinnabar upon an azure ground.\n\nThe August Dao declares: Daoists who study the Way of Immortal Perfection must establish merit among humankind. After years of practice, they should enter the Five Marchmounts and other sacred mountains. If scholars endure hardship yet have not yet refined their reclusion, or if they set their sights on divine herbs and directly journey to the mountains—though the path be long and distant—should they suddenly encounter the Three Calamities or Five Adversities, unable to deploy their arts, finding themselves amidst evil bandits, ghosts, or malevolent spirits, they must invoke the might of divine power in a grand incantation. Facing the perilous place, they shall strike the Heavenly Drum thirty-six times in unison, summoning the gods within their bodies, and pray thus:\n\n*\"May the Mystic Sound of the Nine Heavens descend in perfect harmony, governing the Four Directions and unfolding the myriad divine blossoms. May it transcend stagnant celestial traces, embracing the Three and Five in boundless array. May it turn the plain into radiant splendor, chanting the swift decree of fate. By cinnabar oaths and solemn vows, may afflictions be dissolved and maladies dispelled. May luminous glory shine on high, its radiance filling the household. Like Bo Le wielding his whip, may it vanquish demonic hordes, reclaiming lost lineages and obliterating the Nine Netherworlds. By the tiger talisman’s divine might, may all evil be subdued, all adversaries—great or small—annihilated. May the Nine Yin’s perversity be severed, and misfortunes buried in the shifting sands. May all poisons be subdued, and a hundred trials overcome. Let this be proclaimed as merit worthy of reward, unbetraying the Great Harmony.\"*\n\n**Lofty Phoenix Writ of the Most High**\nResplendent upon the Five-Rayed Peak,\nA solitary summit gleams with celestial radiance.",
      "overlap_context": "es.\nThe Human Sovereign’s transformation was sagely,\nHis virtue equaling the celestial wheel.\n\nMasters transmitting this to disciples must all observe a pure fast for ninety days, or thirty days, or a minor fast of seven days. They must present seven taels of refined gold as a token of faith for the Golden Tiger and Phoenix Writ. Ninety feet of cinnabar-red brocade shall be offered to swear an oath to the Nine Heavens. Forty feet of azure silk shall be used to pledge allegiance to the scripture.",
      "start_char": 1251,
      "end_char": 1775,
      "start_sentence": 52,
      "end_sentence": 60,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.494759559631348,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上元始耀光金虎凤文章宝经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "学者不严洁，吏兵亦不依。 我承正道行，万邪何敢加。 体佩金神信，流铃随身飞。 三天符五岳，并导吾后前。 天罗已张维。 地网亦布机。 鬼邪及毒兽，见吾即灭摧。 盗贼何敢前，金凤食汝衰。 千精即丧目，万魔走如雷。 何以容盗贼，三官应严推。 急走使奔迸，虎兵当痛推。 急急承勑命，严明宣太威。 有功当迁赏，无功追万机。 急急如明天祝律令。 又有消魔大符，在《消魔天水经》中，可预施之以却恶，然后神咒行令也。 此是九天众魔王之隐音也，亦应佩之祝之，以制魔也。 无祝制时，亦先服一符，益勑内神相应。 兴宁三年乙丑岁七月七日，桐栢真人承乐子长、安期先生，受出三皇蕴中金虎凤文章符，令晚学道士许远游承受，以制万魔。 言神祝行至乙未、甲申、乙亥、壬辰、癸巳之岁，九月一日、及七月七日、四月八日，此三日当有贤人道士，着七色法衣，手持策杖，在灵坛之上，或在人间告乞，时咏经诵书，或作狂歌之声。 子若见如此之人，勤请问之具道情事，必当授子金虎上符，并诸学要言也。 慎勿轻之，此隐化真人也。 南岳真人从太上无极大道君、天帝君常所使，其时或下在人间，观察末世晚学道士勤志之心尔。 上清太上元始耀光金虎凤文章宝经竟",
      "translated_text": "The scholar lacks strict purity,\nThe officers and soldiers fail to comply.\nI follow the Orthodox Dao in practice—\nHow dare the myriad evils assail me?\nMy body bears the Golden Spirit’s token,\nTinkling bells fly beside me in flight.\nTalismans of the Three Heavens and Five Peaks\nGuide my path before and behind.\nThe Heavenly Net is cast wide,\nThe Earthly Snare is set in place.\nGhosts, demons, and venomous beasts—\nAt the sight of me, they crumble and fall.\nHow dare thieves and bandits approach?\nThe Golden Phoenix devours their decay.\nA thousand spirits lose their eyes,\nTen thousand demons flee like thunder.\nHow can thieves and bandits be tolerated?\nThe Three Officials shall sternly pursue them.\nHasten their flight, drive them in rout—\nTiger Soldiers shall strike with pain.\nSwiftly, swiftly, by imperial decree,\nProclaim the awe of the Supreme Might.\nThose with merit shall be promoted and rewarded,\nThose without shall be pursued by ten thousand mechanisms.\nSwiftly, swiftly, as the Bright Heaven’s curse and command!\n\nThere is also the Great Talisman for Dispelling Demons,\nFound in the *Scripture of Heavenly Water for Dispelling Demons*,\nWhich may be preemptively employed to repel evil,\nFollowed by the divine incantation’s execution of command.\nThis is the hidden sound of the Demon Kings of the Nine Heavens—\nIt should also be worn and recited to subdue demons.\nWhen no recitation is used for control,\nFirst ingest a talisman to strengthen the inner spirits’ resonance.\n\nIn the third year of the Xingning reign, the *yichou* year, the seventh day of the seventh month,\nTongbo Perfected received from Le Zichang and Master Anqi\nThe *Golden Tiger Phoenix Writ Talismans* concealed within the Three Sovereigns’ treasury,\nCommanding the late-learning Daoist Xu Yuanyou to receive them\nFor the subduing of the myriad demons.\nThe divine incantation’s efficacy extends to the years *yiwei*, *jiashen*, *yihai*, *renchen*, and *guisi*,\nOn the first day of the ninth month, the seventh day of the seventh month, and the eighth day of the fourth month—\nOn these three days, there shall appear worthy persons and Daoists,\nClad in seven-colored ritual robes, staff in hand,\nUpon the sacred altar or among the people, making petitions.\nAt such times, they chant scriptures, recite texts,\nOr raise voices in wild song.\nIf you encounter such a person,\nDiligently inquire and fully explain your circumstances—\nThey shall surely bestow upon you the *Upper Talisman of the Golden Tiger*,\nAlong with essential teachings.\nTake care not to slight them—\nThese are Perfected Ones in hidden transformation.\nThe Perfected of Mount Nanyue are often dispatched\nBy the Most High Lord of the Boundless Dao and the Heavenly Thearch,\nSometimes descending among the people\nTo observe the earnestness of late-learning Daoists in the degenerate age.\n\nThe *Upper Clarity Scripture of the Primordial Beginning’s Radiant Light: Golden Tiger Phoenix Writ* concludes.",
      "overlap_context": "bliterating the Nine Netherworlds. By the tiger talisman’s divine might, may all evil be subdued, all adversaries—great or small—annihilated. May the Nine Yin’s perversity be severed, and misfortunes buried in the shifting sands. May all poisons be subdued, and a hundred trials overcome. Let this be proclaimed as merit worthy of reward, unbetraying the Great Harmony.\"*\n\n**Lofty Phoenix Writ of the Most High**\nResplendent upon the Five-Rayed Peak,\nA solitary summit gleams with celestial radiance.",
      "start_char": 1775,
      "end_char": 2259,
      "start_sentence": 61,
      "end_sentence": 83,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.922860622406006,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上元始耀光金虎凤文章宝经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}