{
  "source_id": "上清北极天心正法",
  "source_file": "chunked_daozang\\上清北极天心正法.json",
  "total_chunks": 14,
  "total_original_chars": 11487,
  "total_translated_chars": 65780,
  "total_translation_time": 360.6642966270447,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\方法类\\上清北极天心正法.txt",
    "category": "方法类"
  },
  "full_translation": "*The Supreme Clarity Northern Culmen Celestial Heart Orthodox Method*\n\n*The Scripture of the Supreme Clarity Northern Culmen Celestial Heart Orthodox Method* is of unknown authorship, emerging during the Southern Song dynasty. It comprises a single fascicle. The base text is derived from the *Zhengtong Daoist Canon*, under the category of Methods in the Cavernous Mystery Division.\n\n**The Celestial Heart Method**\n\nThe Celestial Heart Method was bestowed by the Most High upon Mount Cranecall, where daily he instructed the Celestial Master in the scriptures of the Northern Culmen, its purpose being to repel and expel demonic forces and to deliver the people. Of old, the transmitted Celestial Heart Orthodox Method consisted solely of three talismans: first, the Talisman of the Great Sage of the Celestial Pivot; second, the Talisman of the Black Destructor; and third, the Three Luminaries Talisman.\n\nAs for the Three Luminaries Talisman, it is bound above to the Three Sovereigns, its Dao resonating with the Three Realms, its virtue manifesting the Three Powers, and its truth issuing from the Three Masters—thus is it named the Celestial Heart. It is the origin of the myriad Dao, the progenitor of all methods.\n\nMaster Void Tranquility stated: There are two seals. The first is the Seal of the Northern Culmen Demon-Quelling Court, also called the Seal of the Lord of All-Heaven, Commander of Ghosts and Spirits Across the Three Realms. The second is the Seal of the Great Dharma Lord of All-Heaven. Simple yet not cumbersome, they were entrusted to extraordinary individuals and transmitted through the ages.\n\nWhen a Dharma officer enters the afflicted household, he employs the method of transformation.\n\nWhen entering an afflicted household, perform the Ninefold Stem of the Celestial Pole, and visualize yourself as the Primordial Sovereign. The Nine Phoenixes of the South spew true fire, reducing the stricken dwelling to ashes that scatter on the wind. A single gust from the Thunder Wind purifies all, transforming it into a towering palace—the Hall of Golden Splendor. Its inhabitants become celestial immortals, and beneath the palace, nine giant turtles soar. The lofty towers are wreathed in purple mist, while myriad golden rays burst forth from Fusang.\n\nOn all sides stretch vast seas, their waves surging and boiling without bound. The endless billows span ten thousand leagues, devoid of boats or oars. I then enter, wielding the Celestial Pole, transforming into the Primordial Sovereign to command the armored hosts. The Orthodox Unity of the Mysterious Center attends my body, while the Four Saints, the Three Officials, and the marshals, along with the Six Jia and Six Ding spirits, all descend. The Azure Dragon, White Tiger, Vermilion Bird, Dark Warrior, Qilin, and Master Phoenix soar forth. Thunder and lightning clash as they advance before me, while my body, imbued with the Five Pecks of qi, conceals the hun-souls.\n\nThe Celestial Pole’s crimson qi clears the path ahead, as iron nets weave above and below. On all ten sides and eight directions, soldiers and generals stand arrayed, their banners and standards lining the ranks of ten thousand troops. Knocking the teeth to gather the spirits and circulating the Three qi, recite the incantation to slay ghosts—naturally efficacious.\n\n**Transformation of the Vast Sea Mudra:**\nClasp the *hai* position, press the upper *jia* to the fourth, third, and second fingernails below. Flick outward to manifest a vast sea, boundless and indistinct, its waves spanning ten thousand leagues, encircling the dwelling on all sides.\n\n**Mudra of the Void Sovereign’s Terrace:**\nPress the *chou* position with the thumb, then trace upward to *wu*. Flick outward to transform the house into a divine immortal’s palace, its twelve steps aligned with the *ding* and *wai* positions. Gargle water three times, shout the transformation thrice, and with eyes closed, visualize the dwelling as twelve towering pavilions. Bones and flesh become immortals, jade maidens revel above, while below, giant turtles bear them to and fro across the fathomless sea.\n\n**Mudra of the Boat and Oars:**\nPress the *yin* position with the thumb, then rotate sequentially to *hai*. Flick outward to visualize the sea devoid of boats or oars, leaving ghosts and spirits without passage.\n\n**Mudra of the Four Quadrants’ Iron Barrier Reaching Heaven:**\nRight hand facing upward, left hand facing downward, the right hand’s second fingernail presses the root of the left hand’s second finger. The left thumb presses the right hand’s third finger, then the right hand’s fourth finger passes over the back to meet the middle finger’s middle joint, pressing the upper segment. The five fingers press the backs of the left hand’s five fingernails. Bend and straighten the right hand’s second finger, visualizing an iron barrier stretching from heaven to earth, sealing off malevolent spirits and blocking all entry.\n\nWhen the Dharma master departs, he rides a black cloud across the sea, dissolving the iron barrier—opening before and closing behind. Stand with feet together, then step forward and close behind.\n\n**Purification of the Altar Incantation:**\nAbove in heaven, below on earth,\nMighty Heavenly Ding spirits,\nAssist my Dharma,\nSweep away demonic miasma.\nFoul qi swiftly perish,\nDemonic miasma cleansed.\nMay the altar be swiftly purified,\nThe Dao’s qi eternally abide.\n*Swiftly, swiftly, as decreed by statute and ordinance!*\n\n**Left Hand’s Slaying Mudra:**\nDraw the qi of the Heavenly Gate, enter water, and sprinkle to purify.\n\n**Purification of the Body Incantation:**\nSupreme Perfected, Mysterious Numinous,\nFive Pecks of qi cover my body.\nSpirit clear, qi refreshed,\nFoulness dispelled, peace restored.\n*Swiftly, swiftly, as decreed by the Most High’s statutes and ordinances!*\n\n**Left Hand’s Yaksha Mudra:**\nForm the mudra, draw the qi of the Heavenly Gate, and blow.\n\n**Purification of the Heart Incantation:**\nFive qi, true and numinous,\nHeaven’s image transforms.\nAssist and guard,\nHeart and spirit unerring.\n*Swiftly, swiftly, as decreed by the Most High’s statutes and ordinances!*\n\n**Left Hand’s Celestial Heart Mudra:**\nFrom the third finger, press into the palm’s center.\n\n**Transformation of Form Incantation:**\nBy the decree of the Three Heavens,\nTransform my form.\nAzure Dragon, White Tiger,\nAttend and guard my body.\nEvil ghosts flee afar,\nTrue qi swiftly arises.\n*Swiftly, swiftly, as decreed by the Most High’s statutes and ordinances!*\n\n**Left Hand’s Celestial Heart Mudra, Right Hand’s Dipper Seal:**\nVisualize oneself in the likeness of the Heavenly Master.\n\n**Concealing the Hun-Souls into the Dipper Incantation:**\nI receive the Heavenly Master’s Heart Treasure Seal,\nEndowed by nature,\nCommuning with the hidden and reaching the netherworld,\nAscending through the grotto-heavens.\nI tread the Yu step, aspiring to transcendence.\nThree Hun Spirits,\n*Left hand forms the Three Terraces Mudra,*\nDraw the qi of the Three Luminaries,\nVisualize the Three Terraces at the left shoulder—these are the Three Hun.\nSeven Po Immortals,\n*Right hand forms the Northern Dipper Mudra,*\nThe third fingertip inhales seven breaths of qi,\nSeven stars reside at the right mansion—these are the Seven Po.\nFollow my Yu step,\nAspiring to cross the numinous barrier.\n*Swiftly, swiftly, as decreed by statute and ordinance!*\n\n**Stepping the Huoluo Dipper:**\nAfter the Summer Solstice, lead with the right foot.\nAfter the Winter Solstice, lead with the left foot.\nOn yang days: *\"The Dipper’s mystery, ah—twelve celestial hours.\"*\nOn yin days: *\"Sun and moon shine bright, Heaven and Earth unite.\"*\nThe *Hetu* conceals the spirits within the Nine-Palace Dipper—\n*Wearing nine atop, treading one below, three to the left, seven to the right.*\n*Two and four as shoulders, six and eight as feet.*\n*Five dwells within, forming the solid belly.*\n*A thousand evils, ten thousand ghosts—all submit as guests.*\n*Swiftly, swiftly, as decreed by statute and ordinance!*\n\n**Heavenly Heart Summoning Generals Incantation:**\n*Left: the Demon-Queller. Right: the Firmament.*\nSix Jia spirit-generals—\n*Swiftly summon the true general, hasten to descend!*\nBy the Emperor’s decree, obey and act accordingly.\n*Swiftly, swiftly, as decreed by statute and ordinance!*\n*Right hand forms the Dipper Mudra, Heaven’s Gate qi summons the generals—use as desired.*\n\n**Talisman-Writing Visualization Formula:**\nFirst, purify the heart—banish stray thoughts.\nSit facing the established direction, toward the breaking point.\nVisualize the Three Clarities, gaze upward into the void.\nCommand the Four Sages, the ten thousand soldier-generals.\nEnvision my body assuming the exorcising form.\nFive Dippers’ radiance conceals my shape.\nStep forward onto the Firmament, kick back onto the Yang Path.\nMy body shines bright—Three Luminaries descend.\nInhale into the mouth, without error or delusion.\n*Fire of the Great Yang descends from Mao.*\n*Water of the Great Yin descends from You.*\n*The Heavenly Firmament Star descends from the center.*\n*Purple, white, red—three hues in form.*\nEnvelop my body—ten thousand evils chant in submission.\nKnock the teeth nine times—four great [elements] flow unimpeded.\nThree Fields’ light—my body grows mighty.\nNow write the talisman—this is the Dharma treasury.\n\n**Heavenly Heart General Incantation:**\n*Vast and formless, the primordial chaos—*\n*Within, the written script.*\n*Ocean’s depths pour forth clarity.*\n*Chou.*\n\nRadiant brilliance blazes forth—*Yin*.\nResplendent flames surge—*Mao*.\nAzure Emperor convenes the spirits—*Mao*.\nWhite Emperor resides in *You*.\nCrimson Emperor nurtures qi—*Wu*.\nBlack Emperor channels blood—*Zi*.\nYellow Emperor presides at the center—*Center*.\n\nOne, five, three transformations—left hand forms three coins.\nDispersed into ten thousand distinctions—*return to Chou*.\nWind—*Yin*.\nConvergence—*Mao*.\nNuminous—*Chen*.\nStillness—*Si*.\nVastness—*Wu*.\nResonance—*Wei*.\nPermeation—*Shen*.\nAttunement—*You*.\nOnly the true—*Xu*.\nOnly the responsive—*Xu*.\nEvil rebellion—*Hai*.\nDare to sprout—*Zi*.\nPurify and govern—*Chou*.\nThus govern—*Center*.\n\nBy the Dharma summon the spirits, by the spirits summon qi—*Wu*.\nCondense it naturally—press the center finger against the thumbnail.\nCirculating through Heaven and Earth—*Wu*.\nThe Heavenly Heart bears command—*Wu*.\nAll spirits reverently heed—*center script*.\n\nOne net severs baleful forces—*center above*.\nThree Greedy Wolves receive the decree—*center one*.\nThree Ketu seize—*center script*.\n\n*Oṃ □□lī □□li svāhā*—the summoned [General] so-and-so, hasten here swiftly.\nExtend the center finger’s lower mudrā.\n\n*Swiftly, swiftly, in accordance with the Jade Purity’s decree, summoning all spirits by this present command!*\n\n**Heavenly Heart Dharma Division Generals and Officers—Attire, Names, and Titles:**\n\n**Marshal of the All-Heaven Enforcing Evil, Zhang Tingzhong:**\nDisheveled hair, crimson robe, golden armor, wields a sword.\n\n**Marshal of the Heaven-Spanning Slayer, Zhu Zizhen:**\nDisheveled hair, azure robe, golden armor, holds a noose.\n\n**Marshal of the Heaven-Piercing Seizer, Su Chengli:**\nDisheveled hair, yellow robe, golden armor, grasps a sword.\n\n**Marshal of the Golden Heaven Fire Wheel, Zheng Tianying:**\nDisheveled hair, black robe, golden armor, bears a staff.\n\n**Marshal of the Flying Golden Sage, Zhao Tianzheng:**\nDisheveled hair, white robe, golden armor, wields a cangue.\n\n**Marshal of the Blazing Sky Flying Wheel, Wang Huoguang:**\nDisheveled hair, scarlet robe, golden armor, holds a fire wheel.\n\n**Marshal of the Soaring Empyrean Evil-Destroyer, Liu Cishen:**\nDisheveled hair, purple robe, golden armor, grips a blade.\n\n**Marshal of the Cinnabar-Azure Sage Spirit, Hu Zhongyuan:**\nDisheveled hair, black robe, golden armor, bears a staff.\n\n**Marshal of the Spirit-Calming Soul-Stabilizer, Ju Zizhen:**\nDisheveled hair, variegated robe, golden armor, staff and sword.\n\n**Marshal of the Soul-Pursuing Soul-Returner, Du Gangzhi:**\nDisheveled hair, azure robe, golden armor, wields a blade.\n\n**Marshal of the Dharma-Prohibiting Divine Penetration, Yao Yaozhen:**\nDisheveled hair, green robe, golden armor, staff and sword.\n\n**Marshal of the Phantom-Pursuing Specter-Captor, Xu Tianxin:**\nDisheveled hair, yellow-flowered robe, golden armor, holds a blade.\n\n**Marshal of the Mountain-Leaping Sea-Entering, Yuan Tongling:**\nDisheveled hair, azure robe, golden armor, staff and sword.\n\nThe thirteen great marshals above all belong to the Northern Court,\nthe Northern Culmen Heavenly Heart Chancellery,\nthe Northern Culmen Orthodox Dharma Chancellery.\n\n**Celestial Heart Orthodox Dharma Seal and Talismanic Script**\n**The True Talisman of the Heavenly Stem Great Sage for Exorcising Ghosts by Imperial Decree**\n\nAs the Daoist scriptures state: The Heavenly Stem Great Sage is invoked to repel disasters for the state. When the sun and moon lose their proper course, when comets appear in daylight, when drought, flood, locusts, or pestilence rage, when malevolent spirits and ghosts enter the land or manifest, when grotesque and monstrous forms invade human dwellings, hurling bricks and tiles, summoning winds and setting fires, bewildering the living—then inscribe the True Form Talisman of the Heavenly Stem. Visualize the Breaker of Armies, aligning it correctly as prescribed.\n\nOn the preceding night, prepare incense, flowers, wine, and fruit to honor the Heavenly Stem Great Sage, and leave brush and ink exposed beneath the talisman. At dawn, banish all extraneous thoughts, purify body and mind, and inscribe the talisman according to the method.\n\n**The \"Heaven\" Character Form**\n**The \"Stem\" Character Form**\n**The \"Great\" Character Form**\n**The \"Sage\" Character Form**\n**The \"Decree\" Character Form**\n**The \"Slay\" Character Form**\n\nWhile inscribing the talisman, recite the Heavenly Stem Mantra and Decree. Visualize the true *qi* of the Heavenly Regulator, the Star of the Demon-Quelling Venerable, entering the talisman. Clasp the Stem and Eye mudras.\n\nFor warding homes and expelling evil, this method yields profound efficacy. Alternatively, hand over the talisman, spray water, and clench the Sword Mudra, declaring:\n\n*\"Celestial Spirit, Earthly Spirit,\nThe Three and Five conjoin in harmony.\nBy Imperial Decree I act,\nTo scrutinize and bind wayward spirits.\nDirect-Day Merit Officers,\nAttending officials and marshals,\nDelay not, tarry not—\nHasten forth, return swiftly,\nFor I await in command.\"*\n\n**Next, Circulate the Thunder Formation**\n\n*\"Heavenly Thunder rumbles low—*Zi.\n*Earth Thunder, Yin Thunder, Yang Thunder—*\nThunder’s might stirs and shakes.\nDragon and Tiger cross paths,\nSun and Moon array in order—*Yin.\nRadiance shines clear—*Mao.\nTwelve Merit Officers—*Chen.\nFive Thunder Envoys,\nSix Jia and Six Ding,\nBear the talisman forth—*Wu Tiao.\nSwift as law commands!\"*\n\n**First Revolution:** Six Spirits conceal—*Yin* to *Mao.*\n**Second Revolution:** Four Malevolents vanish—*Chen.*\n**Third Revolution:** The Stem and Culmen move—*Wu.*\n**Fourth Revolution:** Thunderfire surges—*Zi.*\n**Fifth Revolution:** Thunderbolts strike—*You.*\n**Sixth Revolution:** Mountain ghosts perish—*Xu.*\n**Seventh Revolution:** All rebels against Heaven, all lawless specters with severed feet, are seized.\n\n*\"Whatever demonic affliction plagues this body,\nCome before my Stem and Culmen,\nBeneath the Five Thunders,\nTo meet your death—\nMove not, act not!\nSwift as law commands!\"*\n\n**Mantra and Mudra for Circulating the Thunder Formation**\nWhen circulating thunder, use the mudra to stir the Kidney Palace, raising the Kidney Water upward while the Heart Fire’s red *qi* descends, merging with the Kidney *qi*. The two *qi* blend and fuse, generating thunder and lightning.\n\nCirculate with both hands in the Thunder Formation, guiding it to the crown of the head. Extend the mudra, cover the ears to produce thunder, flash the eyes thrice for lightning, exhale through the nose for wind, expel breath from the mouth for clouds, and spray water thrice for rain.\n\nSend forth the talisman with the dispatching mudra, transforming and invoking the talismanic water. The bearer becomes a Heavenly Ding Warrior or the Direct-Day Merit Officer. For hastening childbirth, the bearer becomes the Hastening Birth Lad or the Birth-Supervising Great Spirit. The talisman-bearer must not pause or rest along the way.\n\n**Ancient Three Lights Talisman**\nBefore inscribing the talisman, sit facing the Destruction Palace, cast the *Zi-Wu* Dipper, and cover the body as prescribed. Invoke *qi* into the cinnabar inkwell, visualizing radiance filling the vessel. Recite the incantation:\n\n*\"The Great Sun shines true,\nEvil ghosts wane in its light.\nDivine cinnabar gleams bright as day,\nNinefold dew from the Supreme Canopy.\nThree *qi* form the Terrace,\nSeven *qi* form the Dipper.\nBoth stars shine forth—\nWhere the talisman arrives, pursuit is certain.\nInk becomes the divine sword,\nBrush the halberd and glaive.\nInkstone the Dragon Pool,\nWater the Dragon Ford.\nBy brushwork, illness is cured,\nAll evil vanishes.\nAs the law commands!\"*\n\nNext, clasp the Sun Lord Mudra at the upper joint of the left middle finger.\n\n**Round Radiance, Square Image, Round Shadow Talisman**\nRecite the Sun Mantra. Visualize the purple *qi* of the sun, nine-rayed, blown into the talisman with the *Tiao* mudra.\nRecite the Moon Mantra. Visualize the white *qi* of the moon, ten-rayed, blown into the talisman with the *Tiao* mudra.\nSeven revolutions.\nRecite from *Kui* to *Piao*. Clasp the *Chen* mudra, draw the Stem into the talisman.\nUpon completing the form, recite the invocation for the Heavenly Stem Great Sage to descend, infusing the true *qi* into the ghost’s heart.\n\n**Five Fires Three Lights Talisman**\n**Talisman-Consecrating Mantra**\n\nThe talismans of Heaven are efficacious,\nThe talismans of Earth are efficacious.\nThe Six Jia and Six Ding spirits seize all demonic essences.\nWhen the talisman arrives, all maladies are cured.\nSwiftly, swiftly, as the law commands!\n\n**Another Talisman: Five Fires Three Lights Talisman**\nUpon completing the inscription of the right talisman,\nRecite the Stem Mantra, then the Consecration Mantra of Heavenly Emperor Śakra.\nFurther recite the *Hun* and *Yuepo* Mantras, dispatching the divine generals forth.\nWithin the Thunder Formation, draw *qi* into the water.\n\n**Great Three Lights Talisman**\n**Black Malevolence True Form Talisman**\n\nIn the practice of the Dao, nothing precedes the drawing of *qi*.\nFor when *qi* is correct, the talisman is efficacious;\nWhen the general is correct, the method is verified.\nThere has never been one who practiced without knowing the pathways of *qi*.\nThough the methods and gates are manifold, none have definitively expounded them.\nThe method of drawing *qi* takes the Three Lights as its essence in the *Tianxin Zhengfa*.\nThe Numinous Writ of the Southern Quarter takes the Vermilion Mound as its root,\nYet does not reveal the Vermilion Mound’s directional mantras.\nThe various numinous writs of the schools merely record the drawing of *qi* from a given direction,\nWithout pointing to its source.\nThus, those who transmit the teachings to later learners err in a hundred ways.\nWhen talismanic water fails to respond, they blame the Great Dao,\nUnknowing that the fault lies in the transmission itself—how pitiable!\nHerein it is set forth in full.\nThose who delve deeply into it shall find it most fitting.\n\nThe *Shangqing* Method of Ingesting the Flying Root and Vermilion Essence Golden Elixir\n\nEach day at the hour of solar culmination, face the sun with eyes slightly opened. Knock the teeth nine times, silently invoke the names of the solar soul and the characters of the Five Emperors within the sun. With hands clasped, call forth the solar soul.\n\nThe Five Emperors sit according to the five directions, with the sun at their center. The solar soul is the essence of the sun, the vermilion *qi* within it. The Most August True Lord, named General, styled Gaoqian, must not be casually invoked—know him through visualization.\n\n**Zhujing** – Solar Soul\n*Illuminating Radiance* (Green Emperor): Yuanchangwu, styled Zhaotao, appears as an infant clad in azure jade brocade, with a verdant floral flying feather skirt and a kingfisher-feathered dawn crown. He rides the sunlight to stand at one’s left.\n\n*Vermilion Glow* (Red Emperor): Danlingzhi, styled Lü Hongying, appears as an infant clad in crimson jade brocade, with a white feathered floral flying skirt and a cinnabar dawn crown. He emerges from the sun’s rays to stand at one’s right.\n\n*Returning Radiance* (White Emperor): Haoyujiang, styled Huijin Xia, appears as an infant clad in white jade brocade, with a white feathered floral flying skirt and a luminous dawn crown. He arrives from the sun’s light to stand before one.\n\n**Chitong** – Lunar Soul\n*Mysterious Flame* (Black Emperor): Chengqinting, styled Xuan Lüyan, appears as an infant clad in black jade brocade, with a black feathered floral flying skirt and a dark mountain dawn crown. He comes from the sun’s light to stand above one’s left hand.\n\n*Symbolic Brilliance* (Yellow Emperor): Shouyifu, styled Yihui, appears as before, clad in yellow jade brocade, with a yellow feathered floral flying skirt and a mulberry dawn crown. He arrives from the sun’s light to stand above one’s right hand.\n\nOnce the invocations are complete, close the eyes and gaze upon the sunlight. Clench the fists and lower the hands, visualizing the five-colored floating mists within the sun. The radiance shimmers: azure on the left, vermilion on the right, white above, black below, and yellow at the center. Within these five hues, *qi* intermingles and reflects, all converging upon the body. From the feet to the nape, streaming mists of five colors enter the mouth. The flowing radiance, initially emanating from the sun, blends with its light to suffuse the entire body from head to foot.\n\nNext, visualize within the radiant mist a vermilion *qi*, large as a child’s eye, suspended in clusters of dozens. Amidst the resplendent five colors, focus on forty-five of these, known as the *Flying Root Water Mother*. Silently invoke them thrice, drawing them with the five-colored *qi* into the mouth. Open the mouth and inhale, sensing the mouth fill. Facing the sun, swallow the mist forty-five times. With each inhalation of flowing mist, a *Flying Root* enters and is swallowed together.\n\nNine swallows enter the liver, nine the lungs, nine the heart, nine the kidneys, and nine the spleen. Visualize the entire body, inside and out, organs and navel alike, suffused with radiant light, the mist penetrating completely. After a long while, the visualization concludes.\n\nThen swallow saliva nine times, knock the teeth nine times, and softly recite the incantation:\n*\"Vermilion furnace, cinnabar *qi*, the Dark Heavens nurture essence.\nThe firm receives the yielding, the flame’s yin blossom.\nThe sun’s primal radiance is called Great Clarity.\nNine yangs transform as one, the two images arise together.\nCongealing soul and harmonizing spirit, the essence of the five *qi*.\nAt the center, the Five Emperors are born, riding light to govern form.\nGathering the flying numinous, plucking the root to attain fullness.\nWithin the head, the dragon harmonizes; clad in vermilion, girded in azure.\nThe reins of the crow flow dark, the mist illumines the *Shangqing*.\nBestowed the jade writ, the Golden Watchtower engraves the name.\nIngesting the morning’s blossom, merging with the true Dao’s numen.\nFlying immortal of the *Taiwei*, ascending to the Purple Court.\nHasten, hasten, as decreed by statute and ordinance.\"*\n\nAfter the incantation, bow twice toward the sun. On overcast days without sun, perform this in a clean space within a chamber, visualizing the practice. For those of pure cultivation and profound attainment, success comes naturally without awaiting the sun’s appearance—though practicing in its presence remains most efficacious.\n\n**The *Taiwei* Method of Ingesting Solar *Qi* and the Luminous Numinous Talisman**\nOn the last day of the lunar month at dawn, face east and burn incense. Write in vermilion on azure paper, carefully inscribing the talisman’s strokes to resemble the original. The talisman’s form follows this text; others are to be modeled likewise. Face east to swallow it, thereby informing the solar soul.\n\nNo talisman should be prepared in advance; write it at the moment of ingestion. Hold the breath, grasp the talisman in the left hand, and recite the incantation:\n*\"The *Taiwei*’s cinnabar writ is called *Opening Clarity*.\nSummon the sun’s upper soul to transform this form.\nBy day, adorned in solemn splendor, issuing from the profound.\nThe courtyard’s flying blossom-water, the sun’s root, golden essence.\nPurple radiance flowing light, named the Five Numinous.\"*\n\nAfter the incantation, roll the talisman into a pellet with the left hand and swallow it, visualizing it entering the heart.\n\n**The *Shangqing* Method of Ingesting the Moon’s Radiance and the Stone Mirror Water Mother**\nPractice this each evening at moonrise. Knock the teeth ten times and silently invoke the names of the lunar spirit and the characters of the Five Empresses within the moon. Next, visualize the Five Empresses seated in the moon according to the five colors, riding light to stand at the left, right, front, back, and above the hands.\n\nThe lunar spirit is the essence of the moon, the yellow *qi* within it. The Most August Divine Mother, named Yaodaoyou, styled Wang Huiliao, must not be casually invoked.\n\n**Xuanxiao** – Lunar Spirit\n*Fragrant Splendor* (Green Empress): Ehunzhu, styled Fenyan, appears as an infant clad in azure floral damask, with a kingfisher dragon-phoenix flying skirt and a three-cornered cloud bun atop the head, the rest of her hair cascading to her arms.\n\n*Hidden Radiance* (Red Empress): Yiyiliao, styled Kuai Yianxu, appears as before, clad in cinnabar medicinal jade brocade, with a vermilion phoenix-net flying skirt, her hair arranged as above, standing to the right facing left.\n\n*Mystic Orchid* (White Empress): Lingsulan, styled Yulianhua, clad in white forest four-dragon damask, with a crimson feathered luan-patterned flying skirt, her hair arranged as above.\n\n*Knot of Gold* (Black Empress): Jieqiao, styled Chunshujin, clad in black jade nine-colored numinous brocade, with a black feathered dragon-patterned flying skirt, her hair arranged as above, standing above the right hand facing the face.\n\n*Luminous Radiance* (Yellow Empress): Qingyingjin, styled Jiong Rong, clad in yellow-cloud mountain-patterned brocade, with a green-feathered phoenix-embroidered skirt, her hair arranged as before, standing to the left facing forward.\n\n*White Standard* and *Moon Essence*—each name called in succession; when the invocation is complete, close the eyes, clasp the hands firmly, and let them hang at the sides. Visualize the five-colored flowing essence of the moon descending to envelop the entire body, from the feet to the crown of the head. Then, see the crystalline moonlight of five hues entering the mouth. Within the crystalline light, further visualize a yellow *qi*, vast as a child’s eye, in linked clusters of dozens. Amid the five-colored moonlight, perceive fifty luminous orbs named *Flying Cinnabar Crystals*; silently invoke them three times, and with the breath, draw them into the mouth. Facing the moon, swallow the crystals fifty times—with each inhalation, let the flowing essence and one *Flying Yellow* enter the mouth and be consumed.\n\nTen swallows enter the liver, ten the lungs, ten the heart, ten the kidneys, ten the spleen. Then visualize the five viscera and limbs, inside and out, suffused with clarity, merging with the flowing essence for a long while. When complete, swallow saliva ten times and click the teeth ten times.\n\nRecite the incantation softly:\n*Yellow essence, mysterious radiance,*\n*Primal yin, ascending qi.*\n*Dispel stagnant cold, refine the numinous, gather the stomach.*\n*Empty waves, sharp brilliance,*\n*Upright, cleansed, still vessel.*\n*Moon crystal, night’s splendor,*\n*Mysterious palace, supreme treasure.*\n*Five Palace Ladies, each guard your mother’s throne.*\n*Crimson heaven flies in, Infant Maiden follows.*\n*Four yin, three unions, light shines in ten thousand directions.*\n*Harmonize the hun, restrain the po, five wombs flow with light.*\n*Ride the clouds, fly with essence, soar in emptiness to the east.*\n*At the crown, bind the numinous cloud,*\n*May fortune favor the wind.*\n*Left, gird the tiger tally; right, wear the dragon insignia.*\n*Phoenix-feather cloud mantle, jade pendants, golden earrings.*\n*Soaring tree, branches entwined, named Wood King.*\n*Divine canopy roots the stem—waning and waxing.*\n*Bright essence responds within, mysterious water exhales fragrance.*\n*Granted a jade tablet, name carved in the Cloud Chamber.*\n*Ingest moon’s radiance, merge with the Perfected.*\n*Ascend as an immortal to the Purple Tenuity, pay homage to the Supreme August.*\n*Purple Tenuity’s Moon Radiance, Supreme Yin Mysterious Life Talisman.*\n\nFor this method, on the night of the dark moon, write the talisman in yellow on blue paper, face east, and swallow it. Address the Moon Essence, hold the breath, and grasp the talisman with the right hand.\n\nRecite the incantation:\n*Purple Tenuity’s yellow script,*\n*Named Supreme Mystery.*\n*Scatter moon’s radiant water,*\n*Nurture the po, harmonize the hun.*\n*Within the square, solemn rites,*\n*Issuing from the Mysterious Pass.*\n*Conceal heaven, veil the moon,*\n*Five Numinous Ladies.*\n*Flying light of nine paths,*\n*Illuminating the Mud Pill.*\nWhen finished, roll the talisman with the right hand and swallow it, visualizing it entering the Mud Pill.\n\nThose who first undertake the cultivation of sun and moon ingestion must, on the night of the dark moon preceding the practice, write and swallow the talisman before proceeding. Thereafter, on the night of each dark moon, repeat the ritual. First write and ingest the sun talisman, recite the incantation, then write and ingest the moon talisman—altogether, three talismans.\n\n**Talisman-Writing Protocol**\nEvery talisman contains yin and yang. The brush holds the *Gang* (Celestial Stem), the brush bears flying fire. The left hand gathers, the right hand guides; conceal the talismanic aperture. The Dipper’s stars—void and solid, inverse and direct—must all be present for the talisman to take form and gain efficacy. As the *Record of the Numinous Grotto* states: *\"To write talismans without mastery is to invite ghosts’ mocking laughter. Mortals, utterly foolish, remain utterly ignorant.\"* Each talisman dispatched is governed by a single general.\n\nWhen writing talismans for others to cure illness or sever malevolence, first prepare a cold chamber facing the Heavenly Gate. Arrange the talismans and implements in order. Then burn incense, invoke the deities, and make offerings. Once the petition is complete, begin writing. Visualize the brush as a dragon, the inkstone as a vast sea, the ink as an iron mountain, the cinnabar as a hundred medicines, the cinnabar dish as a fire pool, the paper as an iron plate. When the visualization is complete, one must also know the yin-yang days.\n\nWhen writing talismans, the left hand seals the *mao* (fifth earthly branch), pass the cinnabar and brush over the incense, and recite *\"Conjoined Brightness of the Heavenly Emperor\"* three times. Further visualize the perfected immortals and stellar deities of the myriad heavens descending, their divine light resplendent, encircling the talismanic implements. The scribes and attendants stand in attendance on all sides.\n\nRecite the general incantation:\n*At the first gleam of the sun,*\n*Yin ghosts are crushed.*\n*Divine cinnabar shines bright,*\n*Nine dews of the Supreme Subtlety.*\n*What I now transform,*\n*All evil withers.*\n*Seven qi form the Dipper,*\n*Three qi form the Terrace.*\n*Two stars pierce the darkness,*\n*The talisman speeds to its mark.*\n*The brush is a divine sword,*\n*The ink, halberds and spears,*\n*The inkstone, a dragon pool,*\n*The cinnabar, a hundred medicines.*\n*Brushwork cures illness,*\n*Writing seals the celestial talisman.*\n*Where it arrives, all obey;*\n*Ten thousand evils submit.*\n*Swiftly, swiftly, as the Emperor decrees!*\n\nWhen the incantation is complete, draw three breaths of solar *qi* and infuse them into the paper, brush, cinnabar, and ink. Follow the protocol to complete the talisman.\n\n**On the Solar Discourse**\nTo ingest the true *qi* of the sun, do so each day at dawn. If unable to practice daily, perform it on the 3rd, 5th, 7th, 9th, 11th, 13th, 15th, 17th, 19th, and 21st days of the lunar month. At sunrise, face east toward the sun. If an eclipse occurs, wait until it passes, then set out incense, bow twice, gaze directly at the sun, and press both hands to the heart in reverence. The sun’s rising is not always due east—face wherever it appears. Even if it stands three *zhang* high, it may still be ingested. If the sun is not visible at dawn, or if practicing in a dim chamber, the moment of sunrise is especially potent. Follow the previous method to request the *qi* and proceed accordingly.\n\nThe ingestion of solar *qi* must align with the proper direction, which shifts with the seasons, for the Way of Heaven revolves leftward—no exceptions. For example, in the first month, it resides in *zi*; in the second, *hai*; in the third, *xu*; the rest follow accordingly.\n\nWhen drawing the *qi*, visualize the Seven Stars of the Dipper askew, reaching the seventh star, then silently recite the Six Jia of the Four Seasons.\n\nUpon completing the incantation, visualize a single step of the *Ding Gang*, facing the direction of the sun, ensuring the *Ding Gang* remains aligned with the first star. With the left hand forming the Solar Lord’s mudra, recite the Solar Lord’s incantation seven times. Envision a golden world wherein a crimson *qi* appears, resplendent as fire. It resembles a golden basin, its five-colored radiance descending into the nose. Draw it in, swallow, and click the teeth nine times. Silently recite the Solar incantation seven times, then inhale through the left nostril, guiding the *qi* downward. Imagine the solar *qi* descending directly from the *Chonglou* to the *Weilu* cavity, ascending along the spine to the brain’s *Niwan* Palace, then flowing downward through the five viscera and six bowels, suffusing the four limbs entirely. Sense the five-colored brilliance emanating from every pore and orifice. Next, visualize it settling in the lower *Dantian*, motionless as a luminous pellet. Slowly exhale the turbid *qi*; once the breath steadies, inhale and swallow as before. Repeat this three times, then bow three times to the sun. For further details, consult the general treatise.\n\n**On the Lunar *Qi***\nWhen ingesting the true *qi* of the moon, choose a clear evening when the sky is limpid. Begin after the third day of the lunar month, or during the waning phase once the moon’s brightness wanes. If not practiced regularly, perform on the 2nd, 4th, 6th, 8th, 10th, 12th, 14th, 16th, 18th, 20th, 22nd, or 24th day. Alternatively, await the moon’s first appearance at dusk or nightfall. For the 2nd or 3rd day, use the sun’s initial degree. On the last day of the lunar month or the new moon, take the *qi* at sunset. If a lunar eclipse occurs, wait until it passes. Face the moon, set out incense, and burn it while gazing directly at the moon, pressing both hands to the heart in reverence. Even if the moon stands three or four *zhang* high, it may still be ingested—follow the illustrated method precisely.\n\nFor example, begin counting from *you*: *you* (1), *shen* (2), *wei* (3), *wu* (2), *si* (3), *chen* (2), *mao* (3), *yin* (2), *chou* (3), *zi* (2), *hai* (3), *xu* (2). After two days, return to *you*. Then, add *you* to the day’s branch to determine the moon’s position at the chosen time. For instance, on the 3rd day at the *zi* hour: starting from the 1st day (*you* 3), the moon is in *shen*. At the *zi* hour, add *you* to *shen*, counting forward: *xu* (in *you*), *hai* (in *xu*), *zi* (in *hai*), so the moon resides in *hai*. Face the moon’s rising direction, form the Lunar Lord’s mudra, and visualize a silver world wherein a white *qi* appears, lustrous as warm jade. It resembles a silver platter, its radiance streaming directly into the nostrils. Upon reciting the Lunar Lord’s incantation, inhale through the right nostril as before, guiding the *qi* downward to the *Dantian*. Exhale the turbid *qi*, then bow three times with a settled mind.\n\n**On the Celestial Stem (*Tiangang*)**\nAlso called the *Living Luminaries of Heaven* or the *Secret Art of Entering the Dipper*.\nIn ancient times, the Yellow Emperor resided within Yuecheng when a Perfected Lord descended from the void, manifesting in his true form—nine *chi* tall, crowned with a starry diadem, and girded with a sword. He addressed the Yellow Emperor: “I bestow upon you the method of the *Living Luminaries of Heaven*, through which you shall achieve great victory.” Having spoken, he vanished. The Yellow Emperor later employed this method, slaying Chiyou and decisively defeating the Qiangrong tribes—its efficacy defies description. The Emperor then enshrined the divine talismans in the Hall of Spirits at Huayang Palace, concealing them within the Tai’ping Observatory. The *Qi*-Emperor Immortals preserved and transmitted them to the present age.\n\nDuring the Later Han, Jiang Anguo frequently used this talisman to vanquish treachery and evil. When enemy forces besieged a city, the sight of the Seven Stars ascending the emperor’s throne would cause weapons to retreat of their own accord. Later, in the Tang dynasty, General Li Jing of Luoyang encountered a divine being who, at midnight during the *zi* hour, transmitted this method, naming it the *Wondrous Art of the Living Luminaries of Heaven*. The *Six Ren*, *Dun Jia*, *Three Transmissions*, *Four Lessons*, and *Three Marvels* all derive from this source—truly the subtlety of the authentic scriptures.\n\nMoreover, the ancients who mastered this method achieved swift responses, as is known. For those today who seek its wonders, a single phrase suffices: it is none other than the *orthodox qi* of the *Great Sage of the Celestial Stem*.\n\nWhat is the *Tiangang*? It is the *Breaking Army* star of the Northern Dipper—the *orthodox qi* of great majesty and virtue. In the *Great Crimson Heaven*, it hangs ten thousand *zhang* long, its threads finer than silk, flanking the sun and moon to annihilate all evil. During transformations, the sun and moon are easily discerned, but the *Tiangang* remains elusive. Gazing upward at the celestial patterns, the handle of the Dipper points to the *established* branch—before *hai*, it is called the *Tiangang*.\n\nThe transmission from master to disciple occurs monthly, with the moon regularly positioned at the *xu* hour, revealing the *Breaking Army* as the *orthodox qi* of the *Living Luminaries*. For example, if the lunar establishment is in *yin*, add *hai* to *yin*, then proceed forward: *hai* points to *yin*, *zi* to *mao*, *chou* to *chen*, *yin* to *si*, and so on. If inscribing the talisman on the 5th day of the 5th month at the *wu* hour, as the 5th month establishes *wu*, *hai* points to *wu*, making *chou* the *Ghost Gate* at the *wu* hour. The path of yin is thus illuminated—how could harm arise?\n\nAnother method: when the monthly general aligns with the correct hour at *chen*, it is the *Tiangang*, referring to the palace of the stem. For instance, if the monthly general is in *hai*, and the Dao of Heaven revolves leftward, then the 2nd month corresponds to *xu*—apply this principle accordingly. To determine the *Tiangang*’s location at the *zi* hour in the 1st month, add *hai* to *zi* and proceed rightward to *chen*, placing the *Tiangang* in *si*. This *Tiangang* palace aligns with the *Tiangang*’s established palace, both governed by the same revolving *qi*. Though their applications differ in weight, neither can be fixed without an official nor activated without *qi*. All within the great void belongs to the Three Luminaries—scholars must not remain ignorant. Yet clinging rigidly to conventions may lead one astray.\n\nMaster Liu states: In all matters of direction, it is the heart’s orientation that matters. In all matters of precepts, it is the heart’s discipline that counts. The essential subtlety lies in turning left to gather the *Taiyang* and right to gather the *Taiyin*, following the monthly establishment to firm the *Tiangang*—only through refined truth is this profound mystery attained.\n\nShould one err while aboard a vessel, adrift where seas and rivers teem with dragons and fish, caught in swirling winds and rain, disoriented to east, west, south, or north—how then to face the *Tiangang* and draw *qi*? Without a settled heart, the method will not follow. With the heart settled, stillness radiates divine light, and swift alignment is achieved.\n\nThe left palm represents Heaven and Earth; the four fingers, twelve *wen* as palaces. Face south to determine direction, apply the seasonal and hourly formulas, and align with the *qi* of the sun. Lift the head to draw it in. One sees only the great crimson sky, where the *Tiangang* suspends fiery *qi* like threads pouring into the mouth, illuminating within and without.\n\nIf one does not know the whereabouts of father, mother, or revered teacher, how can there be leisure to discuss the four directions? Thus it is said: directions have no fixed orientation. The method must be engraved in the mind, and its practice must be thoroughly understood.\n\nSome say: use *hai* in the first half of the month and *xu* in the second, counting forward from the monthly establishment until reaching the *wei* hour. For example, in the first half of the first month at the *wu* hour, add *hai* to *yin*, count forward to *you* to reach *wu*, and the *Tiangang* is found in *xu*. This method derives from the *Purple Microseven Luminaries Classic*, rarely known among common people. Those who do know it often rely on the *Tiangang* methods for years and months, which differ significantly, unaware of the living-luminaries formula.\n\nThe *Great Verified Efficacy Model* states: The *Tiangang* governs the masters of great methods and heads all divination arts. Those who follow it live; those who oppose it die. Yet people mistakenly apply the monthly general to *xu* or *hai*, or add the monthly general to the current hour—both are incorrect. Practitioners of all methods must recognize the true form of the *Tiangang*; only then can they visualize and invoke *qi* without error.\n\nThe *Tiangang* resembles a yin person, appearing as a Jade Maiden. Its attire and colors are detailed in the *Three Luminaries Canon*. Have you not heard the *Big Dipper Incantation*? *\"Spiritual Big Dipper, the star at the handle’s tip.\"* And again: *\"Where the Tiangang points, day and night it revolves.\"* Since it follows the Dipper’s handle, how can it be fixed to *xu* or *hai*? Though Heaven does not speak, it reveals its signs to humanity—yet people fail to comprehend the Dao of Heaven.\n\nWithout knowing the *Tiangang*’s position, how can one practice? Yet within a single discourse, perspectives differ. Now that these have been compiled by category, they share the same school but differ in approach. Alas, the saying of solitary study without companions, narrow and shallow in learning, is evident here. Yet within these few lines of the model, the meaning is abundantly clear—truly sufficient to guide those lost in our Dao.\n\nWhen applying these methods, one should always follow the *Tiangang*. This practice can be used while staying in lodgings, traveling on roads, or sailing on boats when stepping the Dipper is impractical—simply face the *Tiangang* and proceed.\n\nThe living-luminaries method requires fixing the hour precisely and adding the earthly stem, with the monthly establishment’s spirit shifting one position at a time. The *Tiangang* completes its cycle each year. If practice aligns with the heart and words take effect, one can topple mountains and shatter demonic temples—all within the palm’s grasp, in the space between reversal and return.\n\nThe classic states: *\"Where the Tiangang points, all demons have no escape.\"* Practice carefully, and there will be no cause for concern. In all matters, proceed from the *Tiangang*: the three *chen* ahead are the *Luan*, the three *chen* behind are the *Yin*—all will be auspicious.\n\nThis method, if not transmitted by sages to the world, would remain unknown to later generations. Those of good fortune who receive it do so by deep karmic affinity—difficult indeed to encounter. This celestial mechanism’s subtle essence must be guarded in secret, treasured and kept with care. It is not passed from father to son, nor exchanged for a thousand gold. To leak it lightly shortens one’s lifespan and diminishes one’s fortune, bringing calamity to nine generations—wind and blade strike instantly, with no redemption for ten thousand kalpas.\n\nThose who uphold it must be wholeheartedly sincere, without fail keeping it secret. Thus it is.\n\n**Tiangang Healing Method**\nTo draw the *Tiangang*, first determine where it points for the day, month, and hour, then face it to draw it in. For example, if the *Tiangang* points to *yin*, step toward *yin* and face *shen* to receive it. When stepping the *Tiangang*, begin at *Tan* and proceed to *Po*, visualizing the star before your feet. Raise the *Tiangang*, lift your head to see it in the sky, and draw *qi* fully into your mouth. Step for a long time into the Dipper’s mouth to apply it.\n\nWhen stepping the *Tiangang*, do not cross it horizontally. To do so breaks the pattern—this is strictly forbidden in the Dao. Remove your headwear, bow, and offer thanks.\n\nStep the *Tiangang* on seven days of the month: the 1st, 5th, 9th, 15th, 20th, 25th, and 29th. For rituals, use the hour of *wu* in a secluded place for auspiciousness. Do not let others see you—if seen, celestial essence will not descend.\n\n**Tiangang Qi Method**\nWith the left hand form the Dipper seal and the right hand the sword mudra. Step the Three Origins *Tiangang*.\n\nRecite the incantation:\n*\"Great Sage Tiangang, Spirit Lord of the Northern Dipper, I perform the true method—bind and fetter your body. By the Emperor’s decree, the Northern Dipper lends me power. Tiangang, seize demonic qi—hasten the descent of true qi! Swiftly, swiftly, as the law commands!\"*\n\nAnother incantation:\n*\"Qian, origin; Kun, balance; Zhen, harmony; Li, steadfastness. Sun and moon aid my forces. Spirit qi enters the five viscera; the six bowels attain peace. By the Jade Emperor’s decree, the Great Sage Tiangang’s decree, the Four Sage Lords—silently recite and unite with the Bright Heavenly Emperor’s Jade Emperor Great Sage Decree to command!\"*\n\n**Tiangang Direction Method**\nFor the current month and the hour of drawing *qi*, count forward to find the *chen*’s position—this is where the *Tiangang* points. To draw *Tiangang qi*, face the direction it points, visualize the Great Sage *Tiangang* before you, dishevel your hair, bare your feet, wear plain silk robes, and stand a hundred *zhang* tall.\n\nStand with the left hand akimbo and the right hand wielding a sword, pointing forward to emit azure-white *qi*, within which a thread-like fiery red *qi* resides. Next, visualize *Tiangang*—his face crimson. Turn to regard your own body, then draw *qi*, first reciting the incantation. Absorb while turning left and tilting the back upward.\n\n**Lively Luminaries Song**\nMonth by month, ever at *you*,\nHeaven’s skew shines on the rear palace.\nMonth by month, ever at *hai*,\nThe front palace faces its opposite.\nMonth by month, ever at *xu*,\n*He Kui* meets you head-on.\nAt the third hour, stride straight within,\nBack to water, face *Tiangang*.\n\n**Master Tian Shi’s Song of Guidance for the Perplexed**\nWhen *Tiangang* stands in the west, face east,\n*Dui* draws *Tiangang qi*—once done, it is the same.\nFirst inhale: *Tiangang* like clouds and rain,\nSecond inhale: *Tiangang* crimson as ten thousand *zhang*.\nExhale onto the brush, then draw it into the heart,\nCommand spirits and dispatch generals—here are heroes!\nIf you master the *Tiangang* method,\nCuring illness and expelling evil brings instant success.\n\n**Rules for Activation**\n*Tiangang* at *zi* when *yin* or *shen* govern,\n*Tiangang* at *yin* when *mao* or *you* are pinched.\n*Chen* and *xu* ride the dragon’s head,\n*Si* and *hai* attend the horse’s palace.\n*Wu* and *zi* occupy the monkey’s station,\n*Chou* and *wei* take turns at the dog’s palace.\n\n**Lively Luminaries: Monthly *Tiangang* and *Qi* Timing Formula**\nIn the first month, *Tiangang* aligns with *yin*,\nAll positions reveal their original cyclical signs.\nIf month by month it ever aligns with *xu*,\nYou will always encounter *Po Jun*.\n\n**Selecting *Tiangang* on the Fifth Day at *Chen* Hour**\nAt the Vernal Equinox, the second month is the norm,\nTwo solstices shift thrice, four full moons mark the edge.\nThree, six, and seven align with the two solstices,\nAt the Autumnal Equinox and Minor Snow, six directions converge.\nOne day before Rain Water and Great Cold,\nEight mornings after Frost Descent—no deviation.\n**Rain Water**: The first day at *hai* hour exchanges *Deng Ming*.\n**Vernal Equinox**: The second day at *xu* hour exchanges *He Kui*.\n**Grain Rain**: The third day at *you* hour exchanges *Cong Kui*.\n**Lesser Fullness**: The fifth day at *chen* hour exchanges *Chuan Song*.\n**Summer Solstice**: The fourth day at *wei* hour exchanges *Xiao Ji*.\n**Great Heat**: The fourth day at *wu* hour exchanges *Sheng Xian*.\n**End of Heat**: The fourth day at *si* hour exchanges *Tai Yi*.\n**Autumnal Equinox**: The sixth day at *chen* hour exchanges *Tiangang*.\n**Frost Descent**: The eighth day at *mao* hour exchanges *Tai Chong*.\n**Minor Snow**: The sixth day at *hai* hour exchanges *Gong Cao*.\n**Winter Solstice**: The fourth day at *chou* hour exchanges *Da Ji*.\n**Great Cold**: The first day at *zi* hour exchanges *Shen Hou*.\n\n**Comprehensive Discussion on the Three Celestial Lights**\nWhen capturing the radiance of the Three Lights to empower talismans, they are the Great Sun, Great Moon, and *Tiangang*. The Great Sun traverses one degree every twelve hours, covering two palaces in five days. Most methods for drawing the *qi* of the sun and moon rely on this principle. For instance, when the sun and moon pass through *Xu* and *Wei*, gaze toward the *Zi* palace in Aquarius to draw *qi*. When they pass through *Xing* and *Zhang*, gaze toward the *Wu* palace in Leo to draw *qi*. Yet they fail to recognize that other directions exist, for the heavens’ movement never ceases. Moreover, the sky spans 365 degrees—half above the earth, half below—through which the sun and moon traverse their lodges. Though their paths follow degrees of longitude and latitude, who discerns the separation of the ecliptic and equatorial planes, or distinguishes the north-south circuit? As for drawing *Tiangang qi*, how can *Tiangang* at *xu* suffice? *Tiangang* follows the hour to determine the cyclical sign; by adding the monthly general to the hour, one deduces *Tiangang*’s establishment and draws *qi* toward it—this is deemed the height of subtlety. Yet if one must split a candle in two to face the void and inhale, is this truly effective? Only the sixteen-word incantation of the Great Sun and the twenty-four-word incantation of the Great Moon are supremely efficacious—these must never be lightly disclosed. Furthermore, the seven-character incantation *\"Zhuan Luo Kui Chi Chi Chi Chi Liang Piao\"* can summon *Tiangang qi*, drawing its kind from the Great Void, much like using a burning mirror to capture water and fire. One who masters this Dao sits amidst ascending mist, enveloped in luminous clouds—what need is there for calculations or meditative visualizations beyond established methods?\n\nAlas! The mysteries of the Three Lights remain imperfectly grasped.\n\nIt is said: The Three Lights Talisman is the foremost of ingested talismans. It can expel all perverse *qi*, *gu* *qi*, and oppressive *qi*; cure all demonic illnesses, break poisonous afflictions, sever ghostly fetuses, end corpse-induced consumption, and eradicate epidemics. For unbearable pains and the eighteen strange maladies, or accidental ingestion of poison or *gu* toxins, this talisman brings immediate relief with a single breath.\n\nYet later scholars know only the talisman’s name, unaware of:\n1. The true names of the Three Lights,\n2. The identity of *Tiangang*,\n3. The incomplete or erroneous recitation of the *Tiangang* incantation,\n4. The method of \"adding and aligning,\"\n5. The descent of *qi*,\n6. The transmission of the Three Talismans,\n7. The immediate efficacy of the Three Lights,\n8. The secret techniques of talisman stabilization,\n9. The proper timing for inscribing talismans.\n\nThese nine points of ignorance render the Three Lights Talisman ineffective.\n\nIt is said: To practice the Three Lights method, one must receive the Three Lights Register as a duty—only then will ghosts and spirits submit in reverence. If the method contradicts the register, local earth gods and temple spirits will mock you, and your practice will yield no results.\n\n**Absorbing the Three Qi**\nWhen ingesting the Three Qi each day, sit calmly before drawing *qi*, free from distracting thoughts. Alternatively, at midnight, don plain robes, sit in stillness, clench your fists, concentrate your spirit, knock your teeth, and swallow saliva three times. After a moment, visualize the Great Sun’s *qi* in your liver like the sun, the Great Moon’s *qi* in your lungs like the moon, and *Tiangang qi* in your heart like a tangerine-sized pellet. All emerge into the Yellow Court Palace, merging into one, then descend into the *Dantian*. Envision it entering the lower pass, ascending the double passes of the spine, passing through the middle pass, and striking the *Niwan* Palace. From the Bright Hall, it enters the Jade Pond; press your tongue against the upper palate, receive the true *qi*, swallow it, and store it in the *Dantian*—its form like a pellet, its color like a red tangerine. In all activities—walking, standing, sitting, or lying down—constantly focus on the true *qi* in your *Dantian*, radiant and resplendent. Upon completing the visualization, knock your teeth three times, swallow saliva three times, and rub your hands together eighty-one times, alternating left and right. Then rest.\n\nWhen conducting *qi*-absorption, do so at three times—dawn, noon, and dusk—or simply at dawn and dusk once each, performing the practice equally by day and night. Upon completion, seal the Seven Gates. The Seven Gates refer to the mouth, nose, ears, and eyes. The sealing method: clasp the *Tianding* seal with both hands, first using the left hand to seal the mouth, nose, and eyes, then each hand to seal the left and right ears. Then rotate the body and assume the Dipper mudra.\n\nThe sun, moon, and stars are the Three Celestial Wonders; in humans, they correspond to spirit, *qi*, and essence. Absorb the Three Celestial Wonders to augment the Three Wonders within the body. After absorbing *qi*, keep the mouth closed, allowing the breath in the nose to flow gently and subtly, so faint it does not stir a single hair. Envision the Three Lights as a pellet, round like a pellet, residing in the lower *Dantian*. Avoid the Five Pungent Foods, the Three Taboo Meats, and all impure substances of blood; refrain from sexual activity. Those who do not violate these precepts attain the state of Earthly Immortality. By inscribing talismans and consecrating water, one may subdue ghosts, command spirits, vanquish myriad evils, shatter their eyes, and break their gallbladders, so they dare not approach. This *qi* is the origin of all methods. After nine years of practice, one may sit in a chamber at night without lamplight yet perceive radiant clarity. Those who persist throughout their lives will merge their *qi* with the Three Celestial Wonders and ascend in flight.\n\nMoreover, it is essential to burn incense and maintain stillness with constancy. As the spirit and essence circulate internally, one should practice *daoyin*. By following this method, no illness can invade.\n\n**Preface to the Method of Reversing the Three Fields and Returning the Golden Elixir**\nThis pertains to the application of the Three Lights. The lungs serve as the Florid Canopy, the throat as the Tower of Dual Pillars, the mouth as the Jade Pond, the eyebrows as the Jade Hall, the forehead as the Celestial Court, the nose as the Celestial Pillar, the crown as the Celestial Palace, and the ears as the Twin Market Gates. Kidney *qi* transmits to the liver, liver *qi* to the heart, heart *qi* to the spleen, and spleen *qi* to the lungs. The lower *Dantian* enters the upper *Dantian*, the upper *Dantian* then enters the middle *Dantian*, and the middle *Dantian* returns to the lower *Dantian*—this reversal of the Three Fields is called the Three Lights Elixir, also known as the Great Return Elixir.\n\n**Diagram of the Five *Qi* Converging at the Origin and the Three Lights Refining the Form**\nThe east is blue-green, the west white, the south red, the north black—these are the spirit images.\n\n**Diagram of the Three Lights Passing Through the Passes**\nThe upper pass is the Celestial Palace.\n\nThis method is also called the Fundamental Method of Water and Fire Achieving Balance. At the hours of *yin* (3–5 AM) and *mao* (5–7 AM), sit upright and recline the body. With a single thrust, penetrate the Three Passes, and listen to the breath for a long while. When you sense the ascent and descent of water and fire, perform movements to guide and direct, silently circulating heart *qi* upward.\n\nInvoke the Method of Commanding the Celestial Pillar with this incantation:\n*Reverently summon the Great Spirit of the Celestial Pillar to swiftly descend with true numinosity.\nAscend to the Golden Gate, descend to cover Kunlun.\nWielding the precious sword, search out and slay demonic essences.\nMarch the spirits, deploy the* qi*, dispel illness, and eradicate pain.\nWhether enchanting fruits or consecrating water to heal, do not lightly disclose or recklessly transmit to the unworthy.*\n\n**Universal Application of the Three Lights Talismanic Water**\nFor all cases where evil spirits, demons, or malevolent forces afflict and prevent speech or consciousness:\nRecite the Celestial Pillar incantation, draw *qi* from the Pillar into water, sip it, and spray it onto the face. Have the afflicted ingest the talisman along with the Three Lights Demon-Quelling Talisman, burned and dissolved in water.\n\nFor all cases of pestilence, take the Upright *Qi* daily to gradually restore tranquility.\n\nFor all cases of red eyes and impaired vision:\nAssume the Mudra of the Dipper, or the Noon Seal if necessary. Next, form the Mudra of the Supreme Emperor, enter the Dipper Seal, and draw the Three Lights. Blow onto the brush, inscribe the talisman, and take *qi* to consecrate the water. Soak the talisman in water and have the afflicted wash their eyes. Then, facing due north, shout \"Swift!\" once, release the talisman, and recite the incantation:\n*Oṃ va-□-li ya-□-ṭa, you are Li Gongzhong—why have you come to my home?*\nWith each recitation, shout once. Administer the water for washing, then draw the fire *qi* from the sun and exhale it onto the eyes.\n\nFor all cases of unbearable headaches:\nInscribe the Three Lights Talisman and affix it to the temples.\n\nFor all cases where malaria demons cause obstruction:\nInscribe the Three Lights Talisman on a cake and have the afflicted consume it. Recite the talismanic incantation:\n*You appear as a black sorrowful ghost—I know your name. Depart swiftly a thousand leagues, and do not linger for even a moment.*\nThen draw the Three Lights *qi*, spray it, and have the afflicted ingest the Three Lights Talisman.\n\nFor all cases of prolonged labor where the child has not descended, risking life:\nHave the mother ingest the Three Lights Talisman. Visualize the Three Lights Great Sage standing before her, followed by the thunder, lightning, and fire chariots, demon-quelling officials, and divine soldiers overseeing the birth. Envision the talisman-bearer as a talismanic officer, holding the talisman and command to proceed. Immediately summon the thunder, lightning, fire chariot, and birth-overseeing deities to follow the talisman into the mother’s mouth, ensuring swift delivery.\n\nFor all cases where demonic entities manifest malevolence to harm the living:\nAffix the Three Lights Demon-Quelling Talisman to the door. If the affliction clings to a person or livestock, consecrate water and spray it.\n\nFor all cases of long-standing sores and abscesses:\nBurn the Three Lights Talisman to ash and apply it to the afflicted area. Alternatively, cover the sore with the talisman or ingest it. For unbroken sores, silently recite the Celestial Pillar incantation seven times, drawing *qi* seven times to blow onto the sore, which will naturally resolve and discharge.\n\nFor all cases of crossing rivers or seas where water spirits encircle the vessel, causing harm and refusing to depart, or making unreasonable demands that induce terror:\nDraw the Upright *Qi* of the Celestial Pillar onto an iron blade, inscribe the Three Lights Talisman, and cast it into the water.\n\nFor all cases of unresolved ailments:\nIngest the Three Lights Talisman. Depending on the illness, dissolve it in decoction to expel pathogenic *qi*, or add the Demon-Quelling Talisman. Use a seven-inch peach twig from the southeast, boiled in water for ingestion. Alternatively, consecrated water or burning the talisman in a cup for consumption may also be used.\n\n**Method for Gathering Pillar Water**\nThe Pillar is the innate fire within *yin*, capable of destroying all evil. To gather Pillar Water is to conceal its power and await its use.\n\nOn the Double Fifth Festival during heavy rain, place a vessel in the direction of the Celestial Canopy (*huagai*) at the following hours: *zi* (11 PM–1 AM) for the first year, *mao* (5–7 AM) for the second, *you* (5–7 PM) for the third, and *zi* again for the fifth. If no rain falls, collect well water at noon and store it—this is called Pillar Water.\n\nAnother method: On days of Heavenly Virtue or Monthly Virtue, or the *chou* day (2–4 AM) of each month, or the day of Brahmin descent, collect water from the Celestial Canopy direction during rainfall. This is called Dharma Water, to be used only after offering.\n\n**Method for Harmonizing the Three Lights Elixir**\nTake a steamed bun, remove the skin and base, leaving only the center (where nothing congregates). Divide it into two pieces: dry one piece and soak the other until soft. These represent *yin* and *yang*. Knead them together until extremely sticky. Recite the incantation any number of times, drawing *qi* to exhale onto the mixture. Visualize the left hand as the sun, the right as the moon, and the exhaled *qi* as the Pillar. Shape the dough into cakes, flipping them repeatedly while inscribing the Three Lights Talisman on top any number of times. Once complete, form pills of varying sizes, each infused with the Three Lights *qi* and a recitation of the incantation.\n\nAs the text states: *If this method is followed, merely blowing onto the steamed bun seventy times will turn it crimson like cinnabar, resistant to fading. Its efficacy is extraordinary. Form it into fine pills for ingestion—this is the Three Lights Elixir. If a talisman is cast into a well at the first watch of dawn, the well water will boil. Test it to witness its divine efficacy.*\n\n**Visualization of the Perfected One’s Form and Attire**\nWhen subduing sorrow or exorcising malevolent forces, first visualize a Dipper above the crown, its mouth covering the body. The Pillar extends forward, stepping upon another Dipper, with the Pillar hanging below, flanked by two additional Dippers. The elbows align with *Tanlang* (Greedy Wolf), the shoulders with *Juxu* (Giant Gate), the heart with *Lu* (Salary), the clenched hands with *Wenqu* (Literary Brilliance). The left hand descends to the right waist, the right hand to the left waist, forming *Lianzhen* (Integrity) and *Wuqu* (Military Brilliance). The feet align with *Pojun* (Breaker of Armies). The Pillar’s radiance intermingles, with the master standing amidst the firelight, crowned by a Dipper above and borne by a Dipper below.\n\n**Flying the Dipper**\nWith the left hand, thrust the *zi-wu* (midnight-noon) axis to the left. With the right hand, thrust the *yin-wu* (tiger-noon) and *chou* (ox) axes to the rear, forming the left as the *yang* Dipper and the cloud of *Tanlang*. Visualize black stellar light emanating from beneath the right foot, coiling upward around the left side to crown the head, then projecting as a red stellar light.\n\nRed light emanates from beneath the left foot, coiling upward along the right side to crown the head, then projecting from the crown. The right hand’s *zi-wu* Dipper thrusts to the left. The *yin-wu* Dipper thrusts to the right. The right forms the *yin* Dipper, from *Kui* to *Pi*. Next, the *chen-xu* Dipper caps the head, with the Three Terraces layered above.\n\n**Three Terraces Dipper Incantation**\nUpper Terrace: *Xu Jing* (Void Essence), *si* (Serpent).\nPreserve my thousand-year lifespan.\nMiddle Terrace: *Liu Chun* (Sixfold Purity), *wu* (Horse).\nGuard my bodily form.\nLower Terrace: *Qu Sheng* (Crooked Life), *wei* (Sheep).\nI bow in homage to the Three Clarities.\n\n**The Orthodox Rites of the Northern Culmen’s Celestial Heart are complete.**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清北极天心正法 经名：上清北极天心正法。 撰人不详，出矜南宋。 一卷。 底本出处：《正统道藏》洞玄部方法类。 上清北极天心正法 夫天心法者，自太上降鹤呜山，日授天师指东北极之书，辟斥邪魔，救民是务。 昔之流传天心正法，止有三符。 一乃天罡大圣符，二曰黑煞符，三名三光符。 若论三光符者，上结三皇，道应三境，德表三才，真出三师，是名天心。 为万道之宗，众法之祖。 虚静先生云：有两印。 一系北极驱邪院印，又名都天统摄三界鬼神之印，二系都天大法主印。 简而不繁，留付奇人，留传于世。 法官入患家存变法",
      "translated_text": "*The Supreme Clarity Northern Culmen Celestial Heart Orthodox Method*\n\n*The Scripture of the Supreme Clarity Northern Culmen Celestial Heart Orthodox Method* is of unknown authorship, emerging during the Southern Song dynasty. It comprises a single fascicle. The base text is derived from the *Zhengtong Daoist Canon*, under the category of Methods in the Cavernous Mystery Division.\n\n**The Celestial Heart Method**\n\nThe Celestial Heart Method was bestowed by the Most High upon Mount Cranecall, where daily he instructed the Celestial Master in the scriptures of the Northern Culmen, its purpose being to repel and expel demonic forces and to deliver the people. Of old, the transmitted Celestial Heart Orthodox Method consisted solely of three talismans: first, the Talisman of the Great Sage of the Celestial Pivot; second, the Talisman of the Black Destructor; and third, the Three Luminaries Talisman.\n\nAs for the Three Luminaries Talisman, it is bound above to the Three Sovereigns, its Dao resonating with the Three Realms, its virtue manifesting the Three Powers, and its truth issuing from the Three Masters—thus is it named the Celestial Heart. It is the origin of the myriad Dao, the progenitor of all methods.\n\nMaster Void Tranquility stated: There are two seals. The first is the Seal of the Northern Culmen Demon-Quelling Court, also called the Seal of the Lord of All-Heaven, Commander of Ghosts and Spirits Across the Three Realms. The second is the Seal of the Great Dharma Lord of All-Heaven. Simple yet not cumbersome, they were entrusted to extraordinary individuals and transmitted through the ages.\n\nWhen a Dharma officer enters the afflicted household, he employs the method of transformation.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 248,
      "start_sentence": 0,
      "end_sentence": 14,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.666072845458984,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清北极天心正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "凡入患家丁罡九，自身存为元始王。 南方九凤吐真火，烧毁患宅皆灰扬。 震风一吹皆清净，化为楼殿金华堂。 人物皆化天仙子，楼殿下有九鳖翔。 戴起楼台俱紫雾，金光万道迸扶桑。 四面俱为大海水，波涛涌沸无四方。 洪浪万顷无舟楫，我方入去运天罡。 化身元始领甲兵，玄中正一侍吾身。 四圣三官并将吏，六甲六丁齐降临。 青龙白虎并朱雀，玄武麒麟师凤翔。 雷电交轰俱前入，我身五斗挟藏魂。 天罡赤炁前开道，铁网交加上下缯。 十面八方皆兵将，旅帜幢旛列万兵。 叩齿集神运三炁，诵咒煞鬼自然灵。 变巨海诀，掐亥勒上甲，至四三二指甲下。 挑出化为巨海，渺渺茫茫，洪波万顷，宅四畔皆为大海。 次虚皇台诀，大指掐丑，勒上至午，挑出化居屋，为神仙官阙，十二步丁歪。 嘤水三口，喝变三声，闭目存己身，宅为十二楼台。 骨肉尽化为神仙，玉女在上游宴，下有巨鳖，乘载往来，海水深无定。 次掐舟楫诀，大指掐寅，顺转至亥，挑出存海无舟楫，鬼神无路。 次四方发连天铁障诀，右手仰，左手覆，右手二指甲掐左手二指根，左手大指掐右手三指从右手四指背过恰中指中掐四指上节，五指掐左手五指甲背，曲直右手二指，存铁障亘天连地，隔断邪祟，无路而入。 若法师出，乘黑云度海，化铁障，前开后合。 乃二足并立，前开后合。 净坛咒 天上地下，大力天丁。 辅助吾法，扫荡妖氛。 秽炁速灭，荡涤妖氛。 坛场速浄，道炁长存。 急急如律令。 左手煞文，取天门炁，入水洒净。 诤身咒 上真玄灵，五斗覆身。 神清气爽，荡秽安宁。 急急如太上律令。 左手药叉印，诀取天门炁吹之。 诤心咒 五炁正灵，乾象变化。 翊卫辅佐，心神无差。 急急如太上律令。 左手天心诀，从三指格掌心。 变形咒 三天之令，化吾之形。 青龙白虎，侍卫我身。 邪鬼远遁，真炁速生。 急急如太上律令。 左手天心诀，右手斗印，想身如天师状。 藏魂入斗咒 吾受天师心宝印，佩受自然，通幽达冥，上彻洞天。 吾行禹步，愿得升仙。 三魂童子，左手三台诀，取三光炁，存三台居左肩，谓之三魂。 七魄真人。 右手北斗诀，第三指尖吸七口炁，有七星居右府，谓之七魄。 随吾禹步，愿度灵关。 急急如律令。",
      "translated_text": "When entering an afflicted household, perform the Ninefold Stem of the Celestial Pole, and visualize yourself as the Primordial Sovereign. The Nine Phoenixes of the South spew true fire, reducing the stricken dwelling to ashes that scatter on the wind. A single gust from the Thunder Wind purifies all, transforming it into a towering palace—the Hall of Golden Splendor. Its inhabitants become celestial immortals, and beneath the palace, nine giant turtles soar. The lofty towers are wreathed in purple mist, while myriad golden rays burst forth from Fusang.\n\nOn all sides stretch vast seas, their waves surging and boiling without bound. The endless billows span ten thousand leagues, devoid of boats or oars. I then enter, wielding the Celestial Pole, transforming into the Primordial Sovereign to command the armored hosts. The Orthodox Unity of the Mysterious Center attends my body, while the Four Saints, the Three Officials, and the marshals, along with the Six Jia and Six Ding spirits, all descend. The Azure Dragon, White Tiger, Vermilion Bird, Dark Warrior, Qilin, and Master Phoenix soar forth. Thunder and lightning clash as they advance before me, while my body, imbued with the Five Pecks of qi, conceals the hun-souls.\n\nThe Celestial Pole’s crimson qi clears the path ahead, as iron nets weave above and below. On all ten sides and eight directions, soldiers and generals stand arrayed, their banners and standards lining the ranks of ten thousand troops. Knocking the teeth to gather the spirits and circulating the Three qi, recite the incantation to slay ghosts—naturally efficacious.\n\n**Transformation of the Vast Sea Mudra:**\nClasp the *hai* position, press the upper *jia* to the fourth, third, and second fingernails below. Flick outward to manifest a vast sea, boundless and indistinct, its waves spanning ten thousand leagues, encircling the dwelling on all sides.\n\n**Mudra of the Void Sovereign’s Terrace:**\nPress the *chou* position with the thumb, then trace upward to *wu*. Flick outward to transform the house into a divine immortal’s palace, its twelve steps aligned with the *ding* and *wai* positions. Gargle water three times, shout the transformation thrice, and with eyes closed, visualize the dwelling as twelve towering pavilions. Bones and flesh become immortals, jade maidens revel above, while below, giant turtles bear them to and fro across the fathomless sea.\n\n**Mudra of the Boat and Oars:**\nPress the *yin* position with the thumb, then rotate sequentially to *hai*. Flick outward to visualize the sea devoid of boats or oars, leaving ghosts and spirits without passage.\n\n**Mudra of the Four Quadrants’ Iron Barrier Reaching Heaven:**\nRight hand facing upward, left hand facing downward, the right hand’s second fingernail presses the root of the left hand’s second finger. The left thumb presses the right hand’s third finger, then the right hand’s fourth finger passes over the back to meet the middle finger’s middle joint, pressing the upper segment. The five fingers press the backs of the left hand’s five fingernails. Bend and straighten the right hand’s second finger, visualizing an iron barrier stretching from heaven to earth, sealing off malevolent spirits and blocking all entry.\n\nWhen the Dharma master departs, he rides a black cloud across the sea, dissolving the iron barrier—opening before and closing behind. Stand with feet together, then step forward and close behind.\n\n**Purification of the Altar Incantation:**\nAbove in heaven, below on earth,\nMighty Heavenly Ding spirits,\nAssist my Dharma,\nSweep away demonic miasma.\nFoul qi swiftly perish,\nDemonic miasma cleansed.\nMay the altar be swiftly purified,\nThe Dao’s qi eternally abide.\n*Swiftly, swiftly, as decreed by statute and ordinance!*\n\n**Left Hand’s Slaying Mudra:**\nDraw the qi of the Heavenly Gate, enter water, and sprinkle to purify.\n\n**Purification of the Body Incantation:**\nSupreme Perfected, Mysterious Numinous,\nFive Pecks of qi cover my body.\nSpirit clear, qi refreshed,\nFoulness dispelled, peace restored.\n*Swiftly, swiftly, as decreed by the Most High’s statutes and ordinances!*\n\n**Left Hand’s Yaksha Mudra:**\nForm the mudra, draw the qi of the Heavenly Gate, and blow.\n\n**Purification of the Heart Incantation:**\nFive qi, true and numinous,\nHeaven’s image transforms.\nAssist and guard,\nHeart and spirit unerring.\n*Swiftly, swiftly, as decreed by the Most High’s statutes and ordinances!*\n\n**Left Hand’s Celestial Heart Mudra:**\nFrom the third finger, press into the palm’s center.\n\n**Transformation of Form Incantation:**\nBy the decree of the Three Heavens,\nTransform my form.\nAzure Dragon, White Tiger,\nAttend and guard my body.\nEvil ghosts flee afar,\nTrue qi swiftly arises.\n*Swiftly, swiftly, as decreed by the Most High’s statutes and ordinances!*\n\n**Left Hand’s Celestial Heart Mudra, Right Hand’s Dipper Seal:**\nVisualize oneself in the likeness of the Heavenly Master.\n\n**Concealing the Hun-Souls into the Dipper Incantation:**\nI receive the Heavenly Master’s Heart Treasure Seal,\nEndowed by nature,\nCommuning with the hidden and reaching the netherworld,\nAscending through the grotto-heavens.\nI tread the Yu step, aspiring to transcendence.\nThree Hun Spirits,\n*Left hand forms the Three Terraces Mudra,*\nDraw the qi of the Three Luminaries,\nVisualize the Three Terraces at the left shoulder—these are the Three Hun.\nSeven Po Immortals,\n*Right hand forms the Northern Dipper Mudra,*\nThe third fingertip inhales seven breaths of qi,\nSeven stars reside at the right mansion—these are the Seven Po.\nFollow my Yu step,\nAspiring to cross the numinous barrier.\n*Swiftly, swiftly, as decreed by statute and ordinance!*",
      "overlap_context": "hods.\n\nMaster Void Tranquility stated: There are two seals. The first is the Seal of the Northern Culmen Demon-Quelling Court, also called the Seal of the Lord of All-Heaven, Commander of Ghosts and Spirits Across the Three Realms. The second is the Seal of the Great Dharma Lord of All-Heaven. Simple yet not cumbersome, they were entrusted to extraordinary individuals and transmitted through the ages.\n\nWhen a Dharma officer enters the afflicted household, he employs the method of transformation.",
      "start_char": 248,
      "end_char": 1167,
      "start_sentence": 15,
      "end_sentence": 68,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.394717931747437,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清北极天心正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "步豁落斗 夏至后，先右足。 冬至后，先左足。 阳日：斗要妙兮，十二辰。 阴日：日月明，乾坤配。 河图藏神九官斗 戴九履一，左三右七。 二四为肩，六八为足。 五居其中，以为实腹。 千邪万鬼，悉皆宾伏。 急急如律令。 天心召将咒 左魁右罡，六甲灵神。 速召正将，急速降临。 上帝有敕，遵依奉行。 急急如律令。 右手斗印，天门炁召将，随意用。 书符存思诀 先诤心，毋杂想。 坐建方，向破上。 存三清，虚空仰。 领四圣，万兵将。 存我身，驱邪相。 五斗光，藏形状。 前踏罡，后踢炀。 我身明，三光降。 吸入口，无差妄。 太阳火，自卯降。 太阴水，自酉降。 天罡星，自中降。 紫白赤，三色样。 罩我身，万邪唱。 叩齿九，四大畅。 三田光，我身壮。 方书符，为法藏。 天心总咒 墟混溟滓，中文。 海渥注明。 丑。",
      "translated_text": "**Stepping the Huoluo Dipper:**\nAfter the Summer Solstice, lead with the right foot.\nAfter the Winter Solstice, lead with the left foot.\nOn yang days: *\"The Dipper’s mystery, ah—twelve celestial hours.\"*\nOn yin days: *\"Sun and moon shine bright, Heaven and Earth unite.\"*\nThe *Hetu* conceals the spirits within the Nine-Palace Dipper—\n*Wearing nine atop, treading one below, three to the left, seven to the right.*\n*Two and four as shoulders, six and eight as feet.*\n*Five dwells within, forming the solid belly.*\n*A thousand evils, ten thousand ghosts—all submit as guests.*\n*Swiftly, swiftly, as decreed by statute and ordinance!*\n\n**Heavenly Heart Summoning Generals Incantation:**\n*Left: the Demon-Queller. Right: the Firmament.*\nSix Jia spirit-generals—\n*Swiftly summon the true general, hasten to descend!*\nBy the Emperor’s decree, obey and act accordingly.\n*Swiftly, swiftly, as decreed by statute and ordinance!*\n*Right hand forms the Dipper Mudra, Heaven’s Gate qi summons the generals—use as desired.*\n\n**Talisman-Writing Visualization Formula:**\nFirst, purify the heart—banish stray thoughts.\nSit facing the established direction, toward the breaking point.\nVisualize the Three Clarities, gaze upward into the void.\nCommand the Four Sages, the ten thousand soldier-generals.\nEnvision my body assuming the exorcising form.\nFive Dippers’ radiance conceals my shape.\nStep forward onto the Firmament, kick back onto the Yang Path.\nMy body shines bright—Three Luminaries descend.\nInhale into the mouth, without error or delusion.\n*Fire of the Great Yang descends from Mao.*\n*Water of the Great Yin descends from You.*\n*The Heavenly Firmament Star descends from the center.*\n*Purple, white, red—three hues in form.*\nEnvelop my body—ten thousand evils chant in submission.\nKnock the teeth nine times—four great [elements] flow unimpeded.\nThree Fields’ light—my body grows mighty.\nNow write the talisman—this is the Dharma treasury.\n\n**Heavenly Heart General Incantation:**\n*Vast and formless, the primordial chaos—*\n*Within, the written script.*\n*Ocean’s depths pour forth clarity.*\n*Chou.*",
      "overlap_context": "ep, aspiring to transcendence.\nThree Hun Spirits,\n*Left hand forms the Three Terraces Mudra,*\nDraw the qi of the Three Luminaries,\nVisualize the Three Terraces at the left shoulder—these are the Three Hun.\nSeven Po Immortals,\n*Right hand forms the Northern Dipper Mudra,*\nThe third fingertip inhales seven breaths of qi,\nSeven stars reside at the right mansion—these are the Seven Po.\nFollow my Yu step,\nAspiring to cross the numinous barrier.\n*Swiftly, swiftly, as decreed by statute and ordinance!*",
      "start_char": 1168,
      "end_char": 1518,
      "start_sentence": 69,
      "end_sentence": 107,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.783082485198975,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清北极天心正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "焕辉炳焰，寅。 炜煌烗。 卯。 青帝会神，卯。 白帝居酉，酉。 赤帝养炁，午。 黑帝通血，子。 黄帝中主。 中。 一五三变，左三币。 散之万殊。 回丑。 风寅。 合卯。 灵，辰。 寂巳。 寞午。 感未。 通。 申。 惟真酉。 惟应，戌。 恶逆亥。 敢萌。 子。 净治丑。 而治，中。 以法召神，以神召炁。 午。 凝之自然，中指抢大指甲下。 周流天地。 午。 天心有命，午。 万神敬听。 中文。 一罗斩煞，中上。 三贪狼敕，中一。 三计都摄。 中文。 唵□□哩□□利娑诃，所召某将，疾速前来。 发中指下诀。 急急如玉清诏召万神律今敕。 天心法部将吏服色姓讳 都天执邪大将张廷中。 披发，大红袍，金甲，杖剑。 横天杀神大将朱子真。 披发，青袍，金甲，执索。 冲天摄神大将苏成力。 披发，黄袍，金甲，持剑。 金天火轮神将郑天英。 披发，皂袍，金甲，持杖。 飞空金圣大将赵天正。 披发，白袍，金甲，执枷。 炎空飞轮大将王火光。 披发，绯袍，金甲，持火轮。 飞霄灭邪大将刘次神。 披发，紫袍，金甲，握刀。 丹青圣神大将胡中元。 披发，皂袍，金甲，执杖。 安神定魂大将居子镇。 披发，绊袍，金甲，杖剑。 追魂归魂大将杜刚志。 披发，青袍，金甲，执刀。 禁法神通大将姚尧真。 披发，绿袍，金甲，杖剑。 追魑捉魅大将许天信。 披发，黄花袍，金甲，持刀。 跳山入海大将袁通灵。 披发，青袍，金甲，杖剑。 右大将一十三员，并属北院。 北极天心丞相府。 北极正法丞相府。",
      "translated_text": "Radiant brilliance blazes forth—*Yin*.\nResplendent flames surge—*Mao*.\nAzure Emperor convenes the spirits—*Mao*.\nWhite Emperor resides in *You*.\nCrimson Emperor nurtures qi—*Wu*.\nBlack Emperor channels blood—*Zi*.\nYellow Emperor presides at the center—*Center*.\n\nOne, five, three transformations—left hand forms three coins.\nDispersed into ten thousand distinctions—*return to Chou*.\nWind—*Yin*.\nConvergence—*Mao*.\nNuminous—*Chen*.\nStillness—*Si*.\nVastness—*Wu*.\nResonance—*Wei*.\nPermeation—*Shen*.\nAttunement—*You*.\nOnly the true—*Xu*.\nOnly the responsive—*Xu*.\nEvil rebellion—*Hai*.\nDare to sprout—*Zi*.\nPurify and govern—*Chou*.\nThus govern—*Center*.\n\nBy the Dharma summon the spirits, by the spirits summon qi—*Wu*.\nCondense it naturally—press the center finger against the thumbnail.\nCirculating through Heaven and Earth—*Wu*.\nThe Heavenly Heart bears command—*Wu*.\nAll spirits reverently heed—*center script*.\n\nOne net severs baleful forces—*center above*.\nThree Greedy Wolves receive the decree—*center one*.\nThree Ketu seize—*center script*.\n\n*Oṃ □□lī □□li svāhā*—the summoned [General] so-and-so, hasten here swiftly.\nExtend the center finger’s lower mudrā.\n\n*Swiftly, swiftly, in accordance with the Jade Purity’s decree, summoning all spirits by this present command!*\n\n**Heavenly Heart Dharma Division Generals and Officers—Attire, Names, and Titles:**\n\n**Marshal of the All-Heaven Enforcing Evil, Zhang Tingzhong:**\nDisheveled hair, crimson robe, golden armor, wields a sword.\n\n**Marshal of the Heaven-Spanning Slayer, Zhu Zizhen:**\nDisheveled hair, azure robe, golden armor, holds a noose.\n\n**Marshal of the Heaven-Piercing Seizer, Su Chengli:**\nDisheveled hair, yellow robe, golden armor, grasps a sword.\n\n**Marshal of the Golden Heaven Fire Wheel, Zheng Tianying:**\nDisheveled hair, black robe, golden armor, bears a staff.\n\n**Marshal of the Flying Golden Sage, Zhao Tianzheng:**\nDisheveled hair, white robe, golden armor, wields a cangue.\n\n**Marshal of the Blazing Sky Flying Wheel, Wang Huoguang:**\nDisheveled hair, scarlet robe, golden armor, holds a fire wheel.\n\n**Marshal of the Soaring Empyrean Evil-Destroyer, Liu Cishen:**\nDisheveled hair, purple robe, golden armor, grips a blade.\n\n**Marshal of the Cinnabar-Azure Sage Spirit, Hu Zhongyuan:**\nDisheveled hair, black robe, golden armor, bears a staff.\n\n**Marshal of the Spirit-Calming Soul-Stabilizer, Ju Zizhen:**\nDisheveled hair, variegated robe, golden armor, staff and sword.\n\n**Marshal of the Soul-Pursuing Soul-Returner, Du Gangzhi:**\nDisheveled hair, azure robe, golden armor, wields a blade.\n\n**Marshal of the Dharma-Prohibiting Divine Penetration, Yao Yaozhen:**\nDisheveled hair, green robe, golden armor, staff and sword.\n\n**Marshal of the Phantom-Pursuing Specter-Captor, Xu Tianxin:**\nDisheveled hair, yellow-flowered robe, golden armor, holds a blade.\n\n**Marshal of the Mountain-Leaping Sea-Entering, Yuan Tongling:**\nDisheveled hair, azure robe, golden armor, staff and sword.\n\nThe thirteen great marshals above all belong to the Northern Court,\nthe Northern Culmen Heavenly Heart Chancellery,\nthe Northern Culmen Orthodox Dharma Chancellery.",
      "overlap_context": "Great Yin descends from You.*\n*The Heavenly Firmament Star descends from the center.*\n*Purple, white, red—three hues in form.*\nEnvelop my body—ten thousand evils chant in submission.\nKnock the teeth nine times—four great [elements] flow unimpeded.\nThree Fields’ light—my body grows mighty.\nNow write the talisman—this is the Dharma treasury.\n\n**Heavenly Heart General Incantation:**\n*Vast and formless, the primordial chaos—*\n*Within, the written script.*\n*Ocean’s depths pour forth clarity.*\n*Chou.*",
      "start_char": 1518,
      "end_char": 2124,
      "start_sentence": 108,
      "end_sentence": 179,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.326267957687378,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清北极天心正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "天心正法印篆 天罡大圣敕煞鬼真符 按道书云：天罡大圣，为国禳灾。 日月失度，彗星昼出。 旱涝虫蝗，瘟疫流炽。 凶恶神鬼，入境出见。 丑恶怪形，入人宅舍。 抛砖掷瓦，使风放火，迷惑生人。 即书天罡真形符，存见破军，正照如法。 预先一日，於夜备置香花酒果，供养天罡大圣，并露笔墨於按上。 至晓可屏除外念，清净身心，依法书符。 天字式 罡字式 大字式 圣字式 敕字式 煞字式 书符念天罡咒敕，存上天节度破魔尊星真炁入符，掐罡目。 凡镇宅驱邪，大有应验。 或付符噀水握剑诀云： 天灵地灵，三五交并。 吾奉帝敕，纠察邪精。 直日功曹，承行将吏，不得稽停。 速去速来，吾当坐待摄。 次运雷局 天雷隐隐，子。 地雷、阴雷、阳雷，雷威惊动。 龙虎交横，日月罗列，寅。 照耀分明。 卯。 十二功曹，辰。 五雷使者，六甲六丁，执符而行。 午挑。 急急如律令。 一转六神藏，寅至卯。 二转四煞没，辰。 三转动魁罡，午。 四转雷火腾，子。 五转霹雳发，酉。 六转山鬼灭，戌。 七转收摄一切逆天无道截足之鬼。 某身上为祸邪祟，赴吾魁是五雷。 之下受死，无动无作。 急急如律令。 咒诀掐雷局，运雷时，以诀自肾官搅，起肾水上腾，心火赤炁下，交肾  炁。 二熙混合，激成雷电。 运转须用两手雷局，引上顶门，出以诀，掩耳作雷声。 闪目三次为电，鼻出炁为风，口吐炁为云，噀水三口为雨。 送符发诀，去变请符水。 人为天丁力士，或本日功曹。 如催生，为催生童子、监生大神，所将符之人，路中不可停歇。 古本三光符 书符先坐建方，向破出官，掷子午斗，覆身如法。 请炁入朱墨现中，存光芒满现。 咒曰： 太阳正照，阴鬼当衰。 神朱明日，九露太微。 三炁成台，七炁成斗。 二星俱照，符到必追。 墨为神剑，笔为戈戟。 砚为龙池，水为龙津。 笔法治病，万邪俱灭。 一如律令。 次掐日君诀，左手中指上节。 圆景方象方形圆影符 念日咒 存日中紫炁九芒吹人符中挑诀 念月咒 存月中白炁十芒吹人符中挑诀 七转 念魁至魒  掐辰取罡人符 合形毕念天罡大圣降临正真炁收入鬼心 五火三光符 敕符咒",
      "translated_text": "**Celestial Heart Orthodox Dharma Seal and Talismanic Script**\n**The True Talisman of the Heavenly Stem Great Sage for Exorcising Ghosts by Imperial Decree**\n\nAs the Daoist scriptures state: The Heavenly Stem Great Sage is invoked to repel disasters for the state. When the sun and moon lose their proper course, when comets appear in daylight, when drought, flood, locusts, or pestilence rage, when malevolent spirits and ghosts enter the land or manifest, when grotesque and monstrous forms invade human dwellings, hurling bricks and tiles, summoning winds and setting fires, bewildering the living—then inscribe the True Form Talisman of the Heavenly Stem. Visualize the Breaker of Armies, aligning it correctly as prescribed.\n\nOn the preceding night, prepare incense, flowers, wine, and fruit to honor the Heavenly Stem Great Sage, and leave brush and ink exposed beneath the talisman. At dawn, banish all extraneous thoughts, purify body and mind, and inscribe the talisman according to the method.\n\n**The \"Heaven\" Character Form**\n**The \"Stem\" Character Form**\n**The \"Great\" Character Form**\n**The \"Sage\" Character Form**\n**The \"Decree\" Character Form**\n**The \"Slay\" Character Form**\n\nWhile inscribing the talisman, recite the Heavenly Stem Mantra and Decree. Visualize the true *qi* of the Heavenly Regulator, the Star of the Demon-Quelling Venerable, entering the talisman. Clasp the Stem and Eye mudras.\n\nFor warding homes and expelling evil, this method yields profound efficacy. Alternatively, hand over the talisman, spray water, and clench the Sword Mudra, declaring:\n\n*\"Celestial Spirit, Earthly Spirit,\nThe Three and Five conjoin in harmony.\nBy Imperial Decree I act,\nTo scrutinize and bind wayward spirits.\nDirect-Day Merit Officers,\nAttending officials and marshals,\nDelay not, tarry not—\nHasten forth, return swiftly,\nFor I await in command.\"*\n\n**Next, Circulate the Thunder Formation**\n\n*\"Heavenly Thunder rumbles low—*Zi.\n*Earth Thunder, Yin Thunder, Yang Thunder—*\nThunder’s might stirs and shakes.\nDragon and Tiger cross paths,\nSun and Moon array in order—*Yin.\nRadiance shines clear—*Mao.\nTwelve Merit Officers—*Chen.\nFive Thunder Envoys,\nSix Jia and Six Ding,\nBear the talisman forth—*Wu Tiao.\nSwift as law commands!\"*\n\n**First Revolution:** Six Spirits conceal—*Yin* to *Mao.*\n**Second Revolution:** Four Malevolents vanish—*Chen.*\n**Third Revolution:** The Stem and Culmen move—*Wu.*\n**Fourth Revolution:** Thunderfire surges—*Zi.*\n**Fifth Revolution:** Thunderbolts strike—*You.*\n**Sixth Revolution:** Mountain ghosts perish—*Xu.*\n**Seventh Revolution:** All rebels against Heaven, all lawless specters with severed feet, are seized.\n\n*\"Whatever demonic affliction plagues this body,\nCome before my Stem and Culmen,\nBeneath the Five Thunders,\nTo meet your death—\nMove not, act not!\nSwift as law commands!\"*\n\n**Mantra and Mudra for Circulating the Thunder Formation**\nWhen circulating thunder, use the mudra to stir the Kidney Palace, raising the Kidney Water upward while the Heart Fire’s red *qi* descends, merging with the Kidney *qi*. The two *qi* blend and fuse, generating thunder and lightning.\n\nCirculate with both hands in the Thunder Formation, guiding it to the crown of the head. Extend the mudra, cover the ears to produce thunder, flash the eyes thrice for lightning, exhale through the nose for wind, expel breath from the mouth for clouds, and spray water thrice for rain.\n\nSend forth the talisman with the dispatching mudra, transforming and invoking the talismanic water. The bearer becomes a Heavenly Ding Warrior or the Direct-Day Merit Officer. For hastening childbirth, the bearer becomes the Hastening Birth Lad or the Birth-Supervising Great Spirit. The talisman-bearer must not pause or rest along the way.\n\n**Ancient Three Lights Talisman**\nBefore inscribing the talisman, sit facing the Destruction Palace, cast the *Zi-Wu* Dipper, and cover the body as prescribed. Invoke *qi* into the cinnabar inkwell, visualizing radiance filling the vessel. Recite the incantation:\n\n*\"The Great Sun shines true,\nEvil ghosts wane in its light.\nDivine cinnabar gleams bright as day,\nNinefold dew from the Supreme Canopy.\nThree *qi* form the Terrace,\nSeven *qi* form the Dipper.\nBoth stars shine forth—\nWhere the talisman arrives, pursuit is certain.\nInk becomes the divine sword,\nBrush the halberd and glaive.\nInkstone the Dragon Pool,\nWater the Dragon Ford.\nBy brushwork, illness is cured,\nAll evil vanishes.\nAs the law commands!\"*\n\nNext, clasp the Sun Lord Mudra at the upper joint of the left middle finger.\n\n**Round Radiance, Square Image, Round Shadow Talisman**\nRecite the Sun Mantra. Visualize the purple *qi* of the sun, nine-rayed, blown into the talisman with the *Tiao* mudra.\nRecite the Moon Mantra. Visualize the white *qi* of the moon, ten-rayed, blown into the talisman with the *Tiao* mudra.\nSeven revolutions.\nRecite from *Kui* to *Piao*. Clasp the *Chen* mudra, draw the Stem into the talisman.\nUpon completing the form, recite the invocation for the Heavenly Stem Great Sage to descend, infusing the true *qi* into the ghost’s heart.\n\n**Five Fires Three Lights Talisman**\n**Talisman-Consecrating Mantra**",
      "overlap_context": " Yao Yaozhen:**\nDisheveled hair, green robe, golden armor, staff and sword.\n\n**Marshal of the Phantom-Pursuing Specter-Captor, Xu Tianxin:**\nDisheveled hair, yellow-flowered robe, golden armor, holds a blade.\n\n**Marshal of the Mountain-Leaping Sea-Entering, Yuan Tongling:**\nDisheveled hair, azure robe, golden armor, staff and sword.\n\nThe thirteen great marshals above all belong to the Northern Court,\nthe Northern Culmen Heavenly Heart Chancellery,\nthe Northern Culmen Orthodox Dharma Chancellery.",
      "start_char": 2125,
      "end_char": 2997,
      "start_sentence": 180,
      "end_sentence": 253,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.75830388069153,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清北极天心正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "天之符灵，地之符灵。 六甲六丁，摄众邪精。 符到奉行，万病皆治。 急急如律令。 又符 五火三光符 右书符毕。 罡咒，敕天帝释章咒。 又曰魂月魄二咒，敕差将发去。 雷局取炁入水。 大三光符 黑煞真形符 夫行持之道，莫先於取炁。 盖炁正而符灵，将正而法验。 未有不知炁路而行持者也。 是法门众多，未尝确论。 取炁之方，天心正法，以三光为宗。 南方灵文，以朱陵为本，不说朱陵方咒。 夫诸家灵文，但只载某方取炁，而不指其源。 夫后学传职之士，谬误百端。 乃符水不应，欲怨大道。 殊不得传而然也，探可悯之。 今具于后，能深造之，不亦宜乎。",
      "translated_text": "The talismans of Heaven are efficacious,\nThe talismans of Earth are efficacious.\nThe Six Jia and Six Ding spirits seize all demonic essences.\nWhen the talisman arrives, all maladies are cured.\nSwiftly, swiftly, as the law commands!\n\n**Another Talisman: Five Fires Three Lights Talisman**\nUpon completing the inscription of the right talisman,\nRecite the Stem Mantra, then the Consecration Mantra of Heavenly Emperor Śakra.\nFurther recite the *Hun* and *Yuepo* Mantras, dispatching the divine generals forth.\nWithin the Thunder Formation, draw *qi* into the water.\n\n**Great Three Lights Talisman**\n**Black Malevolence True Form Talisman**\n\nIn the practice of the Dao, nothing precedes the drawing of *qi*.\nFor when *qi* is correct, the talisman is efficacious;\nWhen the general is correct, the method is verified.\nThere has never been one who practiced without knowing the pathways of *qi*.\nThough the methods and gates are manifold, none have definitively expounded them.\nThe method of drawing *qi* takes the Three Lights as its essence in the *Tianxin Zhengfa*.\nThe Numinous Writ of the Southern Quarter takes the Vermilion Mound as its root,\nYet does not reveal the Vermilion Mound’s directional mantras.\nThe various numinous writs of the schools merely record the drawing of *qi* from a given direction,\nWithout pointing to its source.\nThus, those who transmit the teachings to later learners err in a hundred ways.\nWhen talismanic water fails to respond, they blame the Great Dao,\nUnknowing that the fault lies in the transmission itself—how pitiable!\nHerein it is set forth in full.\nThose who delve deeply into it shall find it most fitting.",
      "overlap_context": " sun, nine-rayed, blown into the talisman with the *Tiao* mudra.\nRecite the Moon Mantra. Visualize the white *qi* of the moon, ten-rayed, blown into the talisman with the *Tiao* mudra.\nSeven revolutions.\nRecite from *Kui* to *Piao*. Clasp the *Chen* mudra, draw the Stem into the talisman.\nUpon completing the form, recite the invocation for the Heavenly Stem Great Sage to descend, infusing the true *qi* into the ghost’s heart.\n\n**Five Fires Three Lights Talisman**\n**Talisman-Consecrating Mantra**",
      "start_char": 2997,
      "end_char": 3259,
      "start_sentence": 254,
      "end_sentence": 276,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.743316173553467,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清北极天心正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "上清部服飞根赤精金丹上法 每日服时，见太阳论。 临目小开，面向日叩齿九通，心中阴祝，呼日魂之名，日中五帝之字。 每手相接，呼之日魂。 五帝依五方坐，日在其中。 日魂精魂，日中赤炁。 上皇真君讳将军，字高骞。 不可辄呼，存而知之。 朱景  日魂 照韬青帝圆常无，字照韬，形似婴儿，衣青玉锦被，苍华飞羽裙，建翠容扶晨冠，从日中乘光而来，立吾身左。 绿映赤帝丹灵峙，字绿红映，形如婴儿，衣绛玉锦帔，白羽飞华裙，建丹扶灵冠，从日光芒来，立吾身右。 回霞白帝皓郁将，字回金霞，形如婴儿，素衣白玉锦被，白羽飞华裙，建皓灵扶华冠，从日光中来，立于吾前。 赤童  日魄 玄炎黑帝澄溱停，字玄绿炎，形如婴儿，衣黑玉锦帔，黑羽飞华裙，建玄山扶蓉冠，从日光中来，立吾左手上。 象黄帝寿逸阜，字辉，形如前，衣黄玉锦被，黄羽飞华裙，建扶桑素冠，从日光中来，立吾右手上。 右法，几呼召毕，暝目依烯见日光，握固垂手，存见日中五色浮霞之炁。 其霞芒左青右赤，上白下黑中黄。 五色之中，炁含炁映，皆接来一身。 自两足至顶颈，流霞五色，俱入口中。 流霞初从日中来，见五色混合日光通遍头足也。 又存光霞之中，后有赤炁，大如童目者，累垂数十。 绚焕五色之中，存有四十五枚，名曰飞根水母。 心存呼之三遍，与五色炁来入口中，开口吸引，觉满口。 向日吞霞四十五咽，每一吸流霞，并一飞根同入吞之。 九吞入肝，九吞入肺，九吞入心，九吞入肾，九吞入脾，仍存一身。 内外脏脐，一同光芒，霞光洞彻良久毕。 · 又咽液九遍，叩齿九通，微咒曰： 赤炉丹炁，玄天育精。 刚以受柔，炎火阴英。 日晨元景，号曰大明。 九阳齐化，二象俱生。 凝魂和魄，五炁之精。 中生五帝，乘光御形。 采飞以灵，掇根得盈。 首中龙和，披朱带青。 辔乌流玄，霞映上清。 赐书玉柬，金阙刻名。 服食朝华，与真道合灵。 飞仙太微，上升紫庭。 急急如律令。 咒毕，向日再拜。 天阴无日，可於室中所外处洁净，存而行之。 清修之士，精通上感，岂待见日修持，自然成功，见日犹妙。 太微服日炁开明灵符 右月晦早，向束烧香，朱书青纸上，细书之。 其点画宜象，本文后符亦效此，东向吞之，以告日魂也。 凡服符，不可预书，临时书毕即服。 临符闭炁，左手执符。 咒曰： 太微丹书，名曰开明。 致日上魂，来化某形。 平日严妆，发自玄玄。 庭飞华水，日根金精。 紫映流光，号曰五灵。 咒毕服符，以左手卷符，成丸吞下，存入心中。 上清部吞月华石镜水母上法 夕夕服之，见论须叩齿十遍，心中阴呼月魄名，月中五帝夫人之字。 次存五帝夫人在月中，依五色坐乘光芒而来，立于左右前后两手。 月魄精神月中黄炁，上皇神母，讳曜道友，字王荟条，不可辄呼。 谖萧  月魄 芳艳青帝娥隐珠，字芬艳，形如婴儿，青华绫绵被，翠龙凤文飞裙，头上作颓云三角髻，余发垂至胺。 翳寥婉虚赤帝夫人翳逸寥，字块延虚，形如前，衣丹药玉锦被，朱华凤络飞裙，头如前，立右向左。 灵兰郁华白帝夫人灵素兰，字郁连华，衣白林四出龙绵帔，赤羽鸾章飞华裙，头如前。 结翘淳金黑帝夫人结翘，字淳属金，衣玄玉九色灵锦之帔，黑羽龙文飞华裙，头如前，立右手向面。",
      "translated_text": "The *Shangqing* Method of Ingesting the Flying Root and Vermilion Essence Golden Elixir\n\nEach day at the hour of solar culmination, face the sun with eyes slightly opened. Knock the teeth nine times, silently invoke the names of the solar soul and the characters of the Five Emperors within the sun. With hands clasped, call forth the solar soul.\n\nThe Five Emperors sit according to the five directions, with the sun at their center. The solar soul is the essence of the sun, the vermilion *qi* within it. The Most August True Lord, named General, styled Gaoqian, must not be casually invoked—know him through visualization.\n\n**Zhujing** – Solar Soul\n*Illuminating Radiance* (Green Emperor): Yuanchangwu, styled Zhaotao, appears as an infant clad in azure jade brocade, with a verdant floral flying feather skirt and a kingfisher-feathered dawn crown. He rides the sunlight to stand at one’s left.\n\n*Vermilion Glow* (Red Emperor): Danlingzhi, styled Lü Hongying, appears as an infant clad in crimson jade brocade, with a white feathered floral flying skirt and a cinnabar dawn crown. He emerges from the sun’s rays to stand at one’s right.\n\n*Returning Radiance* (White Emperor): Haoyujiang, styled Huijin Xia, appears as an infant clad in white jade brocade, with a white feathered floral flying skirt and a luminous dawn crown. He arrives from the sun’s light to stand before one.\n\n**Chitong** – Lunar Soul\n*Mysterious Flame* (Black Emperor): Chengqinting, styled Xuan Lüyan, appears as an infant clad in black jade brocade, with a black feathered floral flying skirt and a dark mountain dawn crown. He comes from the sun’s light to stand above one’s left hand.\n\n*Symbolic Brilliance* (Yellow Emperor): Shouyifu, styled Yihui, appears as before, clad in yellow jade brocade, with a yellow feathered floral flying skirt and a mulberry dawn crown. He arrives from the sun’s light to stand above one’s right hand.\n\nOnce the invocations are complete, close the eyes and gaze upon the sunlight. Clench the fists and lower the hands, visualizing the five-colored floating mists within the sun. The radiance shimmers: azure on the left, vermilion on the right, white above, black below, and yellow at the center. Within these five hues, *qi* intermingles and reflects, all converging upon the body. From the feet to the nape, streaming mists of five colors enter the mouth. The flowing radiance, initially emanating from the sun, blends with its light to suffuse the entire body from head to foot.\n\nNext, visualize within the radiant mist a vermilion *qi*, large as a child’s eye, suspended in clusters of dozens. Amidst the resplendent five colors, focus on forty-five of these, known as the *Flying Root Water Mother*. Silently invoke them thrice, drawing them with the five-colored *qi* into the mouth. Open the mouth and inhale, sensing the mouth fill. Facing the sun, swallow the mist forty-five times. With each inhalation of flowing mist, a *Flying Root* enters and is swallowed together.\n\nNine swallows enter the liver, nine the lungs, nine the heart, nine the kidneys, and nine the spleen. Visualize the entire body, inside and out, organs and navel alike, suffused with radiant light, the mist penetrating completely. After a long while, the visualization concludes.\n\nThen swallow saliva nine times, knock the teeth nine times, and softly recite the incantation:\n*\"Vermilion furnace, cinnabar *qi*, the Dark Heavens nurture essence.\nThe firm receives the yielding, the flame’s yin blossom.\nThe sun’s primal radiance is called Great Clarity.\nNine yangs transform as one, the two images arise together.\nCongealing soul and harmonizing spirit, the essence of the five *qi*.\nAt the center, the Five Emperors are born, riding light to govern form.\nGathering the flying numinous, plucking the root to attain fullness.\nWithin the head, the dragon harmonizes; clad in vermilion, girded in azure.\nThe reins of the crow flow dark, the mist illumines the *Shangqing*.\nBestowed the jade writ, the Golden Watchtower engraves the name.\nIngesting the morning’s blossom, merging with the true Dao’s numen.\nFlying immortal of the *Taiwei*, ascending to the Purple Court.\nHasten, hasten, as decreed by statute and ordinance.\"*\n\nAfter the incantation, bow twice toward the sun. On overcast days without sun, perform this in a clean space within a chamber, visualizing the practice. For those of pure cultivation and profound attainment, success comes naturally without awaiting the sun’s appearance—though practicing in its presence remains most efficacious.\n\n**The *Taiwei* Method of Ingesting Solar *Qi* and the Luminous Numinous Talisman**\nOn the last day of the lunar month at dawn, face east and burn incense. Write in vermilion on azure paper, carefully inscribing the talisman’s strokes to resemble the original. The talisman’s form follows this text; others are to be modeled likewise. Face east to swallow it, thereby informing the solar soul.\n\nNo talisman should be prepared in advance; write it at the moment of ingestion. Hold the breath, grasp the talisman in the left hand, and recite the incantation:\n*\"The *Taiwei*’s cinnabar writ is called *Opening Clarity*.\nSummon the sun’s upper soul to transform this form.\nBy day, adorned in solemn splendor, issuing from the profound.\nThe courtyard’s flying blossom-water, the sun’s root, golden essence.\nPurple radiance flowing light, named the Five Numinous.\"*\n\nAfter the incantation, roll the talisman into a pellet with the left hand and swallow it, visualizing it entering the heart.\n\n**The *Shangqing* Method of Ingesting the Moon’s Radiance and the Stone Mirror Water Mother**\nPractice this each evening at moonrise. Knock the teeth ten times and silently invoke the names of the lunar spirit and the characters of the Five Empresses within the moon. Next, visualize the Five Empresses seated in the moon according to the five colors, riding light to stand at the left, right, front, back, and above the hands.\n\nThe lunar spirit is the essence of the moon, the yellow *qi* within it. The Most August Divine Mother, named Yaodaoyou, styled Wang Huiliao, must not be casually invoked.\n\n**Xuanxiao** – Lunar Spirit\n*Fragrant Splendor* (Green Empress): Ehunzhu, styled Fenyan, appears as an infant clad in azure floral damask, with a kingfisher dragon-phoenix flying skirt and a three-cornered cloud bun atop the head, the rest of her hair cascading to her arms.\n\n*Hidden Radiance* (Red Empress): Yiyiliao, styled Kuai Yianxu, appears as before, clad in cinnabar medicinal jade brocade, with a vermilion phoenix-net flying skirt, her hair arranged as above, standing to the right facing left.\n\n*Mystic Orchid* (White Empress): Lingsulan, styled Yulianhua, clad in white forest four-dragon damask, with a crimson feathered luan-patterned flying skirt, her hair arranged as above.\n\n*Knot of Gold* (Black Empress): Jieqiao, styled Chunshujin, clad in black jade nine-colored numinous brocade, with a black feathered dragon-patterned flying skirt, her hair arranged as above, standing above the right hand facing the face.",
      "overlap_context": "t does not reveal the Vermilion Mound’s directional mantras.\nThe various numinous writs of the schools merely record the drawing of *qi* from a given direction,\nWithout pointing to its source.\nThus, those who transmit the teachings to later learners err in a hundred ways.\nWhen talismanic water fails to respond, they blame the Great Dao,\nUnknowing that the fault lies in the transmission itself—how pitiable!\nHerein it is set forth in full.\nThose who delve deeply into it shall find it most fitting.",
      "start_char": 3260,
      "end_char": 4565,
      "start_sentence": 277,
      "end_sentence": 340,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.879058837890625,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清北极天心正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "清莹炅容黄帝夫人。 青莹金，字炅容，黄云山文锦帔，绿羽凤文绣裙，头如前，立左手向面。 素标  月魄 每呼两字相连，呼毕乃暝目，握固垂手，存见月中五色流精皆来，接一身，下至两足，上至头顶。 於是，月中流晶五色俱来入口。 又存晶光中，复有黄炁？ 大如童目，数十相连。 存月晶光五色中，有五十枚，名日飞丹之晶，心存呼之三遍，与熙俱入口中。 向月吞晶，五十咽，每一吸炁流晶，并一飞黄同入口吞之矣。 十吞入肝，十吞入肺，十吞入心，十吞入肾，十吞入脾，仍存五脏肢体，内外明彻，与流晶一通良久毕，又咽液十过，叩齿十通。 微咒曰： 黄精玄辉，元阴上炁。 散郁寒飕，修灵敛胃。 虚波澜颖，挺濯停器。 月晶夜景，玄宫上贵。 五宫夫人，各保母位。 赤天飞入，婴女续至。 四阴三合，光芒万方。 和魂制魄，五胎流光。 乘霞飞精，逸虚於东。 首结灵云，景幸昭风。 左带虎符，右腰龙章。 凤羽云帔，玉佩金珰。 骞树结柯，号曰木王。 神幙控根，有亏有光。 明精内应，玄水吐香。 赐书玉札，刻名云房。 服食月华，与真合同。 飞仙紫微，上朝太皇。 紫微服月华太阴玄生符 右法於月晦半夜，黄书青纸上，东向吞之。 以告月魄，闭炁，右手执符。 咒曰： 紫微黄书，名曰太玄。 散月华水，养魄和魂。 方中严事，发自玄关。 藏天隐月，五灵夫人。 飞光九道，映朗泥丸。 咒毕，丸服符，以右手卷符吞下，存入泥丸中。 初欲修服日月者，法当先以前月晦半夜，书符服之，然后可行事。 自后每月至月晦夜，皆服之。 先书日符，咒服讫。 次书月符服之，并书三符。 书符格式 凡书符，符中有阴阳。 笔有罡，笔有飞火。 笔左收右摄，隐秘符窍，斗星虚实，逆顺俱备，方得成符，始有灵验。 如《洞灵录》云：书符不窍，弄鬼齿笑。 世人至愚，端然不晓。 应遣一符，一将主之。 凡为人书符，治病馘祟，先立冷室，向天门。 仍备符，具罗列在上。 次焚香变神，启奏毕，即书符。 想笔为龙，砚为大海，墨为铁山，朱为百药，朱盂为火池，纸为铁板，存讫又要知阴阳日。 凡书符，左手掐卯，朱与笔於香上度过，念合明天帝日三遍，仍存诸天真仙星宿成降，神光辉辉罩定，符具将史，左右围绕。 再诵都咒： 太阳一照，阴鬼当摧。 神朱明日，九露太微。 我今所化，万恶俱衰。 七炁成斗，三炁成台。 二星洞照，符到速追。 笔为神剑，墨为戈戟，砚为龙池，朱为百药。 笔法治病，书篆天符。 所到奉行，万邪俱伏。 急急如上帝敕。 咒毕，取太阳炁三口，布於纸笔朱墨之中，依窍成符。 太阳论 凡服太阳真炁，每日清晨服之。 若不能常服，但以月朔三日、五日、七日、九日、十一日、十三日、十五日、十七日、十九日、二十一日，按而为之。 候日出时，束向对日。 如日蚀，即候过置香按，烧香再拜，正视日，两手拊心而礼之。 日所出，非止正东，随所见处向之。 高三丈，尚可服。 若见日不在早，及阴两暗室中为之，得日初出尤妙。 须当准前，请炁依式而行。 大抵服日炁，欲得其方，即随时运转，盖天道左旋故也，不论其他。 且如正月在子，二月在亥，三月在戌，其余准此。 取炁之时，思念七星歪，至第七，即默念六甲四时。",
      "translated_text": "*Luminous Radiance* (Yellow Empress): Qingyingjin, styled Jiong Rong, clad in yellow-cloud mountain-patterned brocade, with a green-feathered phoenix-embroidered skirt, her hair arranged as before, standing to the left facing forward.\n\n*White Standard* and *Moon Essence*—each name called in succession; when the invocation is complete, close the eyes, clasp the hands firmly, and let them hang at the sides. Visualize the five-colored flowing essence of the moon descending to envelop the entire body, from the feet to the crown of the head. Then, see the crystalline moonlight of five hues entering the mouth. Within the crystalline light, further visualize a yellow *qi*, vast as a child’s eye, in linked clusters of dozens. Amid the five-colored moonlight, perceive fifty luminous orbs named *Flying Cinnabar Crystals*; silently invoke them three times, and with the breath, draw them into the mouth. Facing the moon, swallow the crystals fifty times—with each inhalation, let the flowing essence and one *Flying Yellow* enter the mouth and be consumed.\n\nTen swallows enter the liver, ten the lungs, ten the heart, ten the kidneys, ten the spleen. Then visualize the five viscera and limbs, inside and out, suffused with clarity, merging with the flowing essence for a long while. When complete, swallow saliva ten times and click the teeth ten times.\n\nRecite the incantation softly:\n*Yellow essence, mysterious radiance,*\n*Primal yin, ascending qi.*\n*Dispel stagnant cold, refine the numinous, gather the stomach.*\n*Empty waves, sharp brilliance,*\n*Upright, cleansed, still vessel.*\n*Moon crystal, night’s splendor,*\n*Mysterious palace, supreme treasure.*\n*Five Palace Ladies, each guard your mother’s throne.*\n*Crimson heaven flies in, Infant Maiden follows.*\n*Four yin, three unions, light shines in ten thousand directions.*\n*Harmonize the hun, restrain the po, five wombs flow with light.*\n*Ride the clouds, fly with essence, soar in emptiness to the east.*\n*At the crown, bind the numinous cloud,*\n*May fortune favor the wind.*\n*Left, gird the tiger tally; right, wear the dragon insignia.*\n*Phoenix-feather cloud mantle, jade pendants, golden earrings.*\n*Soaring tree, branches entwined, named Wood King.*\n*Divine canopy roots the stem—waning and waxing.*\n*Bright essence responds within, mysterious water exhales fragrance.*\n*Granted a jade tablet, name carved in the Cloud Chamber.*\n*Ingest moon’s radiance, merge with the Perfected.*\n*Ascend as an immortal to the Purple Tenuity, pay homage to the Supreme August.*\n*Purple Tenuity’s Moon Radiance, Supreme Yin Mysterious Life Talisman.*\n\nFor this method, on the night of the dark moon, write the talisman in yellow on blue paper, face east, and swallow it. Address the Moon Essence, hold the breath, and grasp the talisman with the right hand.\n\nRecite the incantation:\n*Purple Tenuity’s yellow script,*\n*Named Supreme Mystery.*\n*Scatter moon’s radiant water,*\n*Nurture the po, harmonize the hun.*\n*Within the square, solemn rites,*\n*Issuing from the Mysterious Pass.*\n*Conceal heaven, veil the moon,*\n*Five Numinous Ladies.*\n*Flying light of nine paths,*\n*Illuminating the Mud Pill.*\nWhen finished, roll the talisman with the right hand and swallow it, visualizing it entering the Mud Pill.\n\nThose who first undertake the cultivation of sun and moon ingestion must, on the night of the dark moon preceding the practice, write and swallow the talisman before proceeding. Thereafter, on the night of each dark moon, repeat the ritual. First write and ingest the sun talisman, recite the incantation, then write and ingest the moon talisman—altogether, three talismans.\n\n**Talisman-Writing Protocol**\nEvery talisman contains yin and yang. The brush holds the *Gang* (Celestial Stem), the brush bears flying fire. The left hand gathers, the right hand guides; conceal the talismanic aperture. The Dipper’s stars—void and solid, inverse and direct—must all be present for the talisman to take form and gain efficacy. As the *Record of the Numinous Grotto* states: *\"To write talismans without mastery is to invite ghosts’ mocking laughter. Mortals, utterly foolish, remain utterly ignorant.\"* Each talisman dispatched is governed by a single general.\n\nWhen writing talismans for others to cure illness or sever malevolence, first prepare a cold chamber facing the Heavenly Gate. Arrange the talismans and implements in order. Then burn incense, invoke the deities, and make offerings. Once the petition is complete, begin writing. Visualize the brush as a dragon, the inkstone as a vast sea, the ink as an iron mountain, the cinnabar as a hundred medicines, the cinnabar dish as a fire pool, the paper as an iron plate. When the visualization is complete, one must also know the yin-yang days.\n\nWhen writing talismans, the left hand seals the *mao* (fifth earthly branch), pass the cinnabar and brush over the incense, and recite *\"Conjoined Brightness of the Heavenly Emperor\"* three times. Further visualize the perfected immortals and stellar deities of the myriad heavens descending, their divine light resplendent, encircling the talismanic implements. The scribes and attendants stand in attendance on all sides.\n\nRecite the general incantation:\n*At the first gleam of the sun,*\n*Yin ghosts are crushed.*\n*Divine cinnabar shines bright,*\n*Nine dews of the Supreme Subtlety.*\n*What I now transform,*\n*All evil withers.*\n*Seven qi form the Dipper,*\n*Three qi form the Terrace.*\n*Two stars pierce the darkness,*\n*The talisman speeds to its mark.*\n*The brush is a divine sword,*\n*The ink, halberds and spears,*\n*The inkstone, a dragon pool,*\n*The cinnabar, a hundred medicines.*\n*Brushwork cures illness,*\n*Writing seals the celestial talisman.*\n*Where it arrives, all obey;*\n*Ten thousand evils submit.*\n*Swiftly, swiftly, as the Emperor decrees!*\n\nWhen the incantation is complete, draw three breaths of solar *qi* and infuse them into the paper, brush, cinnabar, and ink. Follow the protocol to complete the talisman.\n\n**On the Solar Discourse**\nTo ingest the true *qi* of the sun, do so each day at dawn. If unable to practice daily, perform it on the 3rd, 5th, 7th, 9th, 11th, 13th, 15th, 17th, 19th, and 21st days of the lunar month. At sunrise, face east toward the sun. If an eclipse occurs, wait until it passes, then set out incense, bow twice, gaze directly at the sun, and press both hands to the heart in reverence. The sun’s rising is not always due east—face wherever it appears. Even if it stands three *zhang* high, it may still be ingested. If the sun is not visible at dawn, or if practicing in a dim chamber, the moment of sunrise is especially potent. Follow the previous method to request the *qi* and proceed accordingly.\n\nThe ingestion of solar *qi* must align with the proper direction, which shifts with the seasons, for the Way of Heaven revolves leftward—no exceptions. For example, in the first month, it resides in *zi*; in the second, *hai*; in the third, *xu*; the rest follow accordingly.\n\nWhen drawing the *qi*, visualize the Seven Stars of the Dipper askew, reaching the seventh star, then silently recite the Six Jia of the Four Seasons.",
      "overlap_context": "ying skirt, her hair arranged as above, standing to the right facing left.\n\n*Mystic Orchid* (White Empress): Lingsulan, styled Yulianhua, clad in white forest four-dragon damask, with a crimson feathered luan-patterned flying skirt, her hair arranged as above.\n\n*Knot of Gold* (Black Empress): Jieqiao, styled Chunshujin, clad in black jade nine-colored numinous brocade, with a black feathered dragon-patterned flying skirt, her hair arranged as above, standing above the right hand facing the face.",
      "start_char": 4566,
      "end_char": 5820,
      "start_sentence": 341,
      "end_sentence": 418,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.2807400226593,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清北极天心正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "咒毕，存定一步丁罡，向太阳方，丁罡不离第一星。 左手拾日君诀，念日君咒，七转。 存见金色世界中，有赤炁一道，如火灿烂。 又如金盆，五色光芒降於鼻。 引咽叩齿九通，默念日咒七徧，以左鼻孔，吸引炁下。 想日炁从重楼直下，至尾阊穴。 从夹脊上，自脑顶入泥丸宫中，又从上降下五脏六腑，四肢俱徧。 觉毛发孔窍中，五色光明射出。 又想在下丹田中，如弹丸，光彩不动。 次徐徐呵出浊气，伺气定，又吸咽如前。 如此三褊了，心拜太阳三拜，余见总论。 太阴论 太阴真炁，欲服食之时，须伺天气清明之夕。 每月初三日后，或下弦，便可服，月巳生魄。 若不常行，以月二日、四日，六八十十二，四六八二十、二十二四日，按而为之。 或伺月初出，或夕或晚。 初二三以日初度。 及晦朔，并以日没时取之。 或遇月蚀，则待过。 对月置香按，烧香正视月，两手村心礼之。 月高三四丈，尚可服，须当依图法用之。 且如起酉之数，逆数其日，则酉一、申二、未三、午二、· 巳三、辰二、卯三、寅二、丑三、子二、亥三、戌二，余二日复归於酉。 却以酉加本日分数，至用时节，即知太阴方位。 假如初三日用子时，初一日起酉三，日在申。 用子时，即以酉加申，顺数戌在酉，亥在戌，子时在亥，则知太阴在亥。 依此取之，面向太阴方生处，掐月君诀。 存见银色世界中，有白炁一道，如暧玉莹诤。 又如银盘，光灿直入鼻孔。 即念月君咒毕，以右鼻孔吸引如前，直下丹田毕，呵出浊炁，定心三拜。 天罡论 又名天上活曜天罡又名入斗秘诀 昔日轩辕黄帝在越城之内，有真君於空中，降现本身，长九尺，顶星冠，按剑谓黄帝曰：授汝活曜天罡之法，当获大胜。 授罢，忽然不见。 黄帝后用此法，蚩尤果戮，大破羌戎之众，其验难述。 帝乃华阳宫舍灵殿上神仙银箓，藏於太平观。 藏中炁帝仙人，流传於世迨今。 后汉蒋安国，亦常用此符，而断奸邪。 若兵来侵城，但见七星登帝，干戈自退。 次及唐李靖将军在雒阳城中，忽见一神人，约夜半子时传度此法，号曰上天活曜天罡之妙。 又六壬遁甲，三传四课三奇门，皆从所出，斯为真经之妙矣。 况古之人，得此法而响应可知。 而今之人，欲知此妙，一言可以蔽之，正是天罡大圣正炁而已。 天罡者何？ 北斗破军者是也。 乃大威德之正炁，在大赤天中，垂万丈光，其细如丝，左右日月，破灭万邪。 存变之际，日月易晓，惟天罡难知。 仰观垂象，则杓星之指建，乃是亥前，曰天罡。 师资常传有月，月常加戌时，时见破军，以活曜正炁。 谓如月建寅，即於寅上加亥，戌顺行，即亥时指寅，子时指卯，丑时指辰，寅时指巳，依此顺指去。 若以五月五日午时书符之良者，以五月建午，亥时指午，则午时丑上为鬼门。 阴道明矣，安有害也。 又法，月将加正时逢辰，是天罡，以罡之宫言也。 谓如月将正在亥，天道左行，则二月为戌，以此推用。 假如欲知正月子时天罡之所在，便是亥时加子，右行逢辰，乃此天罡在巳也。 此天罡之宫，与天罡所建宫，则司建同运气。 二者用之，各有轻重。 当其进养，非官莫定。 当其施用，非炁不行。 徧在太虚，莫非三光。 学者不可不知。 若向为对拘执，又恐非。",
      "translated_text": "Upon completing the incantation, visualize a single step of the *Ding Gang*, facing the direction of the sun, ensuring the *Ding Gang* remains aligned with the first star. With the left hand forming the Solar Lord’s mudra, recite the Solar Lord’s incantation seven times. Envision a golden world wherein a crimson *qi* appears, resplendent as fire. It resembles a golden basin, its five-colored radiance descending into the nose. Draw it in, swallow, and click the teeth nine times. Silently recite the Solar incantation seven times, then inhale through the left nostril, guiding the *qi* downward. Imagine the solar *qi* descending directly from the *Chonglou* to the *Weilu* cavity, ascending along the spine to the brain’s *Niwan* Palace, then flowing downward through the five viscera and six bowels, suffusing the four limbs entirely. Sense the five-colored brilliance emanating from every pore and orifice. Next, visualize it settling in the lower *Dantian*, motionless as a luminous pellet. Slowly exhale the turbid *qi*; once the breath steadies, inhale and swallow as before. Repeat this three times, then bow three times to the sun. For further details, consult the general treatise.\n\n**On the Lunar *Qi***\nWhen ingesting the true *qi* of the moon, choose a clear evening when the sky is limpid. Begin after the third day of the lunar month, or during the waning phase once the moon’s brightness wanes. If not practiced regularly, perform on the 2nd, 4th, 6th, 8th, 10th, 12th, 14th, 16th, 18th, 20th, 22nd, or 24th day. Alternatively, await the moon’s first appearance at dusk or nightfall. For the 2nd or 3rd day, use the sun’s initial degree. On the last day of the lunar month or the new moon, take the *qi* at sunset. If a lunar eclipse occurs, wait until it passes. Face the moon, set out incense, and burn it while gazing directly at the moon, pressing both hands to the heart in reverence. Even if the moon stands three or four *zhang* high, it may still be ingested—follow the illustrated method precisely.\n\nFor example, begin counting from *you*: *you* (1), *shen* (2), *wei* (3), *wu* (2), *si* (3), *chen* (2), *mao* (3), *yin* (2), *chou* (3), *zi* (2), *hai* (3), *xu* (2). After two days, return to *you*. Then, add *you* to the day’s branch to determine the moon’s position at the chosen time. For instance, on the 3rd day at the *zi* hour: starting from the 1st day (*you* 3), the moon is in *shen*. At the *zi* hour, add *you* to *shen*, counting forward: *xu* (in *you*), *hai* (in *xu*), *zi* (in *hai*), so the moon resides in *hai*. Face the moon’s rising direction, form the Lunar Lord’s mudra, and visualize a silver world wherein a white *qi* appears, lustrous as warm jade. It resembles a silver platter, its radiance streaming directly into the nostrils. Upon reciting the Lunar Lord’s incantation, inhale through the right nostril as before, guiding the *qi* downward to the *Dantian*. Exhale the turbid *qi*, then bow three times with a settled mind.\n\n**On the Celestial Stem (*Tiangang*)**\nAlso called the *Living Luminaries of Heaven* or the *Secret Art of Entering the Dipper*.\nIn ancient times, the Yellow Emperor resided within Yuecheng when a Perfected Lord descended from the void, manifesting in his true form—nine *chi* tall, crowned with a starry diadem, and girded with a sword. He addressed the Yellow Emperor: “I bestow upon you the method of the *Living Luminaries of Heaven*, through which you shall achieve great victory.” Having spoken, he vanished. The Yellow Emperor later employed this method, slaying Chiyou and decisively defeating the Qiangrong tribes—its efficacy defies description. The Emperor then enshrined the divine talismans in the Hall of Spirits at Huayang Palace, concealing them within the Tai’ping Observatory. The *Qi*-Emperor Immortals preserved and transmitted them to the present age.\n\nDuring the Later Han, Jiang Anguo frequently used this talisman to vanquish treachery and evil. When enemy forces besieged a city, the sight of the Seven Stars ascending the emperor’s throne would cause weapons to retreat of their own accord. Later, in the Tang dynasty, General Li Jing of Luoyang encountered a divine being who, at midnight during the *zi* hour, transmitted this method, naming it the *Wondrous Art of the Living Luminaries of Heaven*. The *Six Ren*, *Dun Jia*, *Three Transmissions*, *Four Lessons*, and *Three Marvels* all derive from this source—truly the subtlety of the authentic scriptures.\n\nMoreover, the ancients who mastered this method achieved swift responses, as is known. For those today who seek its wonders, a single phrase suffices: it is none other than the *orthodox qi* of the *Great Sage of the Celestial Stem*.\n\nWhat is the *Tiangang*? It is the *Breaking Army* star of the Northern Dipper—the *orthodox qi* of great majesty and virtue. In the *Great Crimson Heaven*, it hangs ten thousand *zhang* long, its threads finer than silk, flanking the sun and moon to annihilate all evil. During transformations, the sun and moon are easily discerned, but the *Tiangang* remains elusive. Gazing upward at the celestial patterns, the handle of the Dipper points to the *established* branch—before *hai*, it is called the *Tiangang*.\n\nThe transmission from master to disciple occurs monthly, with the moon regularly positioned at the *xu* hour, revealing the *Breaking Army* as the *orthodox qi* of the *Living Luminaries*. For example, if the lunar establishment is in *yin*, add *hai* to *yin*, then proceed forward: *hai* points to *yin*, *zi* to *mao*, *chou* to *chen*, *yin* to *si*, and so on. If inscribing the talisman on the 5th day of the 5th month at the *wu* hour, as the 5th month establishes *wu*, *hai* points to *wu*, making *chou* the *Ghost Gate* at the *wu* hour. The path of yin is thus illuminated—how could harm arise?\n\nAnother method: when the monthly general aligns with the correct hour at *chen*, it is the *Tiangang*, referring to the palace of the stem. For instance, if the monthly general is in *hai*, and the Dao of Heaven revolves leftward, then the 2nd month corresponds to *xu*—apply this principle accordingly. To determine the *Tiangang*’s location at the *zi* hour in the 1st month, add *hai* to *zi* and proceed rightward to *chen*, placing the *Tiangang* in *si*. This *Tiangang* palace aligns with the *Tiangang*’s established palace, both governed by the same revolving *qi*. Though their applications differ in weight, neither can be fixed without an official nor activated without *qi*. All within the great void belongs to the Three Luminaries—scholars must not remain ignorant. Yet clinging rigidly to conventions may lead one astray.",
      "overlap_context": "Follow the previous method to request the *qi* and proceed accordingly.\n\nThe ingestion of solar *qi* must align with the proper direction, which shifts with the seasons, for the Way of Heaven revolves leftward—no exceptions. For example, in the first month, it resides in *zi*; in the second, *hai*; in the third, *xu*; the rest follow accordingly.\n\nWhen drawing the *qi*, visualize the Seven Stars of the Dipper askew, reaching the seventh star, then silently recite the Six Jia of the Four Seasons.",
      "start_char": 5820,
      "end_char": 7046,
      "start_sentence": 419,
      "end_sentence": 479,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.073166608810425,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清北极天心正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "刘先生曰：凡方所向，在心之向。 凡戒无戒，在心之戒。 所谓左顾取太阳，右顾取太阴，逐月建而坚罡，精真得之要妙。 假若乘舟误，有海渎鱼龙出。 入风雨旋转，不知东西南北之所。 欲向罡取炁，何以知之。 心未定，法亦不从。 心既定，寂然神光，迅格当在。 左掌为天地，四指十二文为宫，分所向南，约时历诀，迎日炁对，仰首便取。 惟见大赤天中，罡垂火炁，如丝灌下口中，内外洞明。 倘不知父母师尊之所在，奚暇论四方。 故曰：凡方无向也。 其法不可不刻，指其行不可不知。 或云：上半月用亥，下半月用戌，从月建上数起，至未时而住。 假令正月上半月午时，以亥加寅，上数到酉得午，便见天罡在戌。 此法出《紫微七政经》，世人罕得而知。 所知者，则有年月天罡之法，甚有差别，不知活曜之诀。 《大有灵验格》云：且如天罡，主大法之师，诸式之首，顺之者生，逆之者死。 凡人却以月将天罡，加戌加亥，非也。 又或将月将加正时，亦非也。 诸法官须当识天罡真相，则存思请炁而不误矣。 天罡是如阴人，状如玉女，服色等详载三光律内。 岂不闻北斗咒曰：北斗灵灵，斗柄前星。 又曰：天罡所指，昼夜常轮。 既逐斗柄之前，何缘加戌加亥。 此皆天虽不语，而垂象於人，人自不悟天之道也。 不识天罡位，如何行持矣。 然一论之中，所见不同。 今既类以成集，俱是同门而异户。 叹夫独学无友，孤陋寡闻之说可见矣。 今观此格数句之内，意有兼明，真足为吾道之指迷。 应欲施为，并宜顺之。 此法，或随寓旅舍路途行船之时，不及步斗，即丁罡面向而为之矣。 其活曜，常要定时正而加地干，月建神灵以次移转一神，其罡每年周而复始。 若行应心效口，可以倒山岳破邪庙，皆在指掌之内，反覆之间也。 经云：天罡所指，百邪无逃遁之形。 子细行用，永无虑矣。 几事但从天罡上去，前三辰为鸾，后三辰为引，无不吉利。 此法若非圣人相传於世，后人莫得而知。 吉人得之，非夙缘实难遭际，授此天机之妙旨，秘而藏之，实而慎之。 父子不传，千金不易。 轻泄则减算折禄，殃及九祖，风· 刀立至，万劫不原。 受持之士，全在志诚，靡不顺听秘之。 天罡救治法 凡欲取罡，先须定日月时罡之所指，即迎而取之。 谓如罡指寅，即步向寅反面申取之。 罡步起贪至破，即存星在足前。 以剔起罡，仰首视天罡，满口取炁，久步入斗口用之。 凡步罡，勿横行天罡也。 如独横罡，皆成断文，道大禁此二字。 脱巾叩头而谢之。 步罡日，一月凡七日，初一，初五，初九、十五、二十、二十五、二十九。 若行事，可用日中时，无人处吉，不得令人见，见则天精不降也。 罡炁法 左手斗印，右手剑诀，步三元罡。 咒曰： 天罡大圣，北斗灵君，吾行正法，枷缚汝身。 吾奉大帝敕，北斗助吾力。 天罡捉妖气，急降真炁至。 急急如律令。 又咒曰： 乾元亨利贞，日月助吾兵。 灵炁入五脏，六腑得安宁。 玉皇大帝敕，天罡大圣敕，四圣真君。 默念合明天帝日玉皇大圣敕摄 天罡方所法 以本月加取炁之时，顺数寻辰在何位，即天罡所指之方。 取罡炁之法，当面天罡指方，存天罡大圣在己身前，披发跌足，着素罗衣，身长百丈居立。",
      "translated_text": "Master Liu states: In all matters of direction, it is the heart’s orientation that matters. In all matters of precepts, it is the heart’s discipline that counts. The essential subtlety lies in turning left to gather the *Taiyang* and right to gather the *Taiyin*, following the monthly establishment to firm the *Tiangang*—only through refined truth is this profound mystery attained.\n\nShould one err while aboard a vessel, adrift where seas and rivers teem with dragons and fish, caught in swirling winds and rain, disoriented to east, west, south, or north—how then to face the *Tiangang* and draw *qi*? Without a settled heart, the method will not follow. With the heart settled, stillness radiates divine light, and swift alignment is achieved.\n\nThe left palm represents Heaven and Earth; the four fingers, twelve *wen* as palaces. Face south to determine direction, apply the seasonal and hourly formulas, and align with the *qi* of the sun. Lift the head to draw it in. One sees only the great crimson sky, where the *Tiangang* suspends fiery *qi* like threads pouring into the mouth, illuminating within and without.\n\nIf one does not know the whereabouts of father, mother, or revered teacher, how can there be leisure to discuss the four directions? Thus it is said: directions have no fixed orientation. The method must be engraved in the mind, and its practice must be thoroughly understood.\n\nSome say: use *hai* in the first half of the month and *xu* in the second, counting forward from the monthly establishment until reaching the *wei* hour. For example, in the first half of the first month at the *wu* hour, add *hai* to *yin*, count forward to *you* to reach *wu*, and the *Tiangang* is found in *xu*. This method derives from the *Purple Microseven Luminaries Classic*, rarely known among common people. Those who do know it often rely on the *Tiangang* methods for years and months, which differ significantly, unaware of the living-luminaries formula.\n\nThe *Great Verified Efficacy Model* states: The *Tiangang* governs the masters of great methods and heads all divination arts. Those who follow it live; those who oppose it die. Yet people mistakenly apply the monthly general to *xu* or *hai*, or add the monthly general to the current hour—both are incorrect. Practitioners of all methods must recognize the true form of the *Tiangang*; only then can they visualize and invoke *qi* without error.\n\nThe *Tiangang* resembles a yin person, appearing as a Jade Maiden. Its attire and colors are detailed in the *Three Luminaries Canon*. Have you not heard the *Big Dipper Incantation*? *\"Spiritual Big Dipper, the star at the handle’s tip.\"* And again: *\"Where the Tiangang points, day and night it revolves.\"* Since it follows the Dipper’s handle, how can it be fixed to *xu* or *hai*? Though Heaven does not speak, it reveals its signs to humanity—yet people fail to comprehend the Dao of Heaven.\n\nWithout knowing the *Tiangang*’s position, how can one practice? Yet within a single discourse, perspectives differ. Now that these have been compiled by category, they share the same school but differ in approach. Alas, the saying of solitary study without companions, narrow and shallow in learning, is evident here. Yet within these few lines of the model, the meaning is abundantly clear—truly sufficient to guide those lost in our Dao.\n\nWhen applying these methods, one should always follow the *Tiangang*. This practice can be used while staying in lodgings, traveling on roads, or sailing on boats when stepping the Dipper is impractical—simply face the *Tiangang* and proceed.\n\nThe living-luminaries method requires fixing the hour precisely and adding the earthly stem, with the monthly establishment’s spirit shifting one position at a time. The *Tiangang* completes its cycle each year. If practice aligns with the heart and words take effect, one can topple mountains and shatter demonic temples—all within the palm’s grasp, in the space between reversal and return.\n\nThe classic states: *\"Where the Tiangang points, all demons have no escape.\"* Practice carefully, and there will be no cause for concern. In all matters, proceed from the *Tiangang*: the three *chen* ahead are the *Luan*, the three *chen* behind are the *Yin*—all will be auspicious.\n\nThis method, if not transmitted by sages to the world, would remain unknown to later generations. Those of good fortune who receive it do so by deep karmic affinity—difficult indeed to encounter. This celestial mechanism’s subtle essence must be guarded in secret, treasured and kept with care. It is not passed from father to son, nor exchanged for a thousand gold. To leak it lightly shortens one’s lifespan and diminishes one’s fortune, bringing calamity to nine generations—wind and blade strike instantly, with no redemption for ten thousand kalpas.\n\nThose who uphold it must be wholeheartedly sincere, without fail keeping it secret. Thus it is.\n\n**Tiangang Healing Method**\nTo draw the *Tiangang*, first determine where it points for the day, month, and hour, then face it to draw it in. For example, if the *Tiangang* points to *yin*, step toward *yin* and face *shen* to receive it. When stepping the *Tiangang*, begin at *Tan* and proceed to *Po*, visualizing the star before your feet. Raise the *Tiangang*, lift your head to see it in the sky, and draw *qi* fully into your mouth. Step for a long time into the Dipper’s mouth to apply it.\n\nWhen stepping the *Tiangang*, do not cross it horizontally. To do so breaks the pattern—this is strictly forbidden in the Dao. Remove your headwear, bow, and offer thanks.\n\nStep the *Tiangang* on seven days of the month: the 1st, 5th, 9th, 15th, 20th, 25th, and 29th. For rituals, use the hour of *wu* in a secluded place for auspiciousness. Do not let others see you—if seen, celestial essence will not descend.\n\n**Tiangang Qi Method**\nWith the left hand form the Dipper seal and the right hand the sword mudra. Step the Three Origins *Tiangang*.\n\nRecite the incantation:\n*\"Great Sage Tiangang, Spirit Lord of the Northern Dipper, I perform the true method—bind and fetter your body. By the Emperor’s decree, the Northern Dipper lends me power. Tiangang, seize demonic qi—hasten the descent of true qi! Swiftly, swiftly, as the law commands!\"*\n\nAnother incantation:\n*\"Qian, origin; Kun, balance; Zhen, harmony; Li, steadfastness. Sun and moon aid my forces. Spirit qi enters the five viscera; the six bowels attain peace. By the Jade Emperor’s decree, the Great Sage Tiangang’s decree, the Four Sage Lords—silently recite and unite with the Bright Heavenly Emperor’s Jade Emperor Great Sage Decree to command!\"*\n\n**Tiangang Direction Method**\nFor the current month and the hour of drawing *qi*, count forward to find the *chen*’s position—this is where the *Tiangang* points. To draw *Tiangang qi*, face the direction it points, visualize the Great Sage *Tiangang* before you, dishevel your hair, bare your feet, wear plain silk robes, and stand a hundred *zhang* tall.",
      "overlap_context": "ation at the *zi* hour in the 1st month, add *hai* to *zi* and proceed rightward to *chen*, placing the *Tiangang* in *si*. This *Tiangang* palace aligns with the *Tiangang*’s established palace, both governed by the same revolving *qi*. Though their applications differ in weight, neither can be fixed without an official nor activated without *qi*. All within the great void belongs to the Three Luminaries—scholars must not remain ignorant. Yet clinging rigidly to conventions may lead one astray.",
      "start_char": 7046,
      "end_char": 8283,
      "start_sentence": 480,
      "end_sentence": 547,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.2014262676239,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清北极天心正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "左手叉腰，右手仗剑，指前顶出青白炁，中有火色赤炁，细如丝。 次存天罡，面赤色。 回顾己身，然后取炁，先诵咒。 左转仰背吸之。 活曜歌 月月常加酉，天歪照后宫。 月月常加亥，前宫属对冲。 月月常加戌，河魁当面逢。 时三一径裹，背水向天罡。 嗣汉虚静天师指迷歌 罡在西方面在东，兑取罡气已还同。 一吸天罡如云雨，再吸天罡万丈红。 呵笔上，纳心中，行神遣将有英雄。 若能识得天罡法，治病驱邪立见功。 起例 寅申罡加子，卯酉掐加寅。 辰戌龙头上，巳亥马宫亲。 子午居猴位，丑未犬宫轮。 活曜天罡月将炁候诀 正月天罡加在寅，但将诸位见元辰。 若将月月常加戌，管得时时见破军。 此取罡日五日辰时 春分二月是常言，二至三移四满边。 三六七中同二至，秋分小雪六方边。 雨水大寒前一日，八朝霜降候无偏。 雨水。 一日亥时交登明。 春分。 二日戌时交河魁。 谷雨。 三日酉时交从魁。 小满。 五日辰时交传送。 夏至。 四日未时交小吉。 大暑。 四日午时交胜先。 处暑。 四日巳时交太一。 秋分。 六日辰时交天罡。 霜降。 八日卯时交太冲。 小雪。 六日亥时交功曹。 冬至四日丑时交大吉。 大寒。 一日子时交神后。 天心三光总论 凡取三光之光芒付符者，谓太阳太阴天罡。 且太阳十二时行一度，五日行两宫。 今取日月之炁者，多以此推。 谓日月临虚危，则望宝瓶宫子取炁。 临星张，望师子宫午取炁。 曾不知他处有方，天运不息。 况天有三百六十五度，一半出地绕下，其日月行舍。 虽经纬躔度，孰知黄赤二道分度，岂辩南北往来。 又取罡气，如何罡戌？ 天罡顺时定辰，以月将加时，推其罡建，向望之取，自谓曲尽其妙。 且如分烛者，必以二薪向空，吸之可乎。 惟太阳十六字咒、太阴二十四字咒极妙，不可轻泄。 又转罗魁魑魑魑魑魉魒七字，能召天罡之炁，引类太虚，正如方燧之取水火。 能知此道，则坐致明霞於冲炁之中，又何必历算存思於制度之外也。 哉吁，三光之奥，由未善也。 格云：三光符，乃吞符第一道。 能驱一切邪炁、蛊炁、厌炁。 治一切邪病，破毒病，斩鬼胎，断尸劳，除瘟疫。 及诸痛不可忍者，及十八种奇疾，误食毒药蛊毒，已上符到，即愈其呼吸。 后学之士，但知符名而已，不知三光真名者，一也。 不识天罡者，二也。 念天罡咒不全而纰缪者，三也。 不识加临者，四也。 不知炁之所降者，五也。 不曾受三符者，六也。 不得三光即者，七也。 不知稳秘符窍者，八也。 不知书符之时者，九也。 此乃九件未知，三光符即无验矣。 格云：如行三光，合受三光箓为职，即令鬼神钦伏。 若法与箓相违背，则为社庙鬼神所笑，行持无功。 凡服三炁，竟於每日欲进炁时，惟平坐安定，无以杂虑干心。 或於每夜子时，披衣静坐，握固思神，叩齿咽津液三口。 须臾，存肝中太阳炁如日，肺中太阴炁如月，心中罡炁如橘弹丸。 俱出至黄庭宫，混合为一，下入丹田。 想入下关，自夹脊双关，历中关，撞入泥丸宫。 自明堂入玉池，以舌拄上，乘接真炁咽之，存入丹田藏之，形若弹丸，色同朱橘。 凡行住坐卧，念念常思丹田中真炁，光明灿灿。 存毕，叩齿三通，咽液三过，以左右手互换，搓八十一徧，讫及睡。",
      "translated_text": "Stand with the left hand akimbo and the right hand wielding a sword, pointing forward to emit azure-white *qi*, within which a thread-like fiery red *qi* resides. Next, visualize *Tiangang*—his face crimson. Turn to regard your own body, then draw *qi*, first reciting the incantation. Absorb while turning left and tilting the back upward.\n\n**Lively Luminaries Song**\nMonth by month, ever at *you*,\nHeaven’s skew shines on the rear palace.\nMonth by month, ever at *hai*,\nThe front palace faces its opposite.\nMonth by month, ever at *xu*,\n*He Kui* meets you head-on.\nAt the third hour, stride straight within,\nBack to water, face *Tiangang*.\n\n**Master Tian Shi’s Song of Guidance for the Perplexed**\nWhen *Tiangang* stands in the west, face east,\n*Dui* draws *Tiangang qi*—once done, it is the same.\nFirst inhale: *Tiangang* like clouds and rain,\nSecond inhale: *Tiangang* crimson as ten thousand *zhang*.\nExhale onto the brush, then draw it into the heart,\nCommand spirits and dispatch generals—here are heroes!\nIf you master the *Tiangang* method,\nCuring illness and expelling evil brings instant success.\n\n**Rules for Activation**\n*Tiangang* at *zi* when *yin* or *shen* govern,\n*Tiangang* at *yin* when *mao* or *you* are pinched.\n*Chen* and *xu* ride the dragon’s head,\n*Si* and *hai* attend the horse’s palace.\n*Wu* and *zi* occupy the monkey’s station,\n*Chou* and *wei* take turns at the dog’s palace.\n\n**Lively Luminaries: Monthly *Tiangang* and *Qi* Timing Formula**\nIn the first month, *Tiangang* aligns with *yin*,\nAll positions reveal their original cyclical signs.\nIf month by month it ever aligns with *xu*,\nYou will always encounter *Po Jun*.\n\n**Selecting *Tiangang* on the Fifth Day at *Chen* Hour**\nAt the Vernal Equinox, the second month is the norm,\nTwo solstices shift thrice, four full moons mark the edge.\nThree, six, and seven align with the two solstices,\nAt the Autumnal Equinox and Minor Snow, six directions converge.\nOne day before Rain Water and Great Cold,\nEight mornings after Frost Descent—no deviation.\n**Rain Water**: The first day at *hai* hour exchanges *Deng Ming*.\n**Vernal Equinox**: The second day at *xu* hour exchanges *He Kui*.\n**Grain Rain**: The third day at *you* hour exchanges *Cong Kui*.\n**Lesser Fullness**: The fifth day at *chen* hour exchanges *Chuan Song*.\n**Summer Solstice**: The fourth day at *wei* hour exchanges *Xiao Ji*.\n**Great Heat**: The fourth day at *wu* hour exchanges *Sheng Xian*.\n**End of Heat**: The fourth day at *si* hour exchanges *Tai Yi*.\n**Autumnal Equinox**: The sixth day at *chen* hour exchanges *Tiangang*.\n**Frost Descent**: The eighth day at *mao* hour exchanges *Tai Chong*.\n**Minor Snow**: The sixth day at *hai* hour exchanges *Gong Cao*.\n**Winter Solstice**: The fourth day at *chou* hour exchanges *Da Ji*.\n**Great Cold**: The first day at *zi* hour exchanges *Shen Hou*.\n\n**Comprehensive Discussion on the Three Celestial Lights**\nWhen capturing the radiance of the Three Lights to empower talismans, they are the Great Sun, Great Moon, and *Tiangang*. The Great Sun traverses one degree every twelve hours, covering two palaces in five days. Most methods for drawing the *qi* of the sun and moon rely on this principle. For instance, when the sun and moon pass through *Xu* and *Wei*, gaze toward the *Zi* palace in Aquarius to draw *qi*. When they pass through *Xing* and *Zhang*, gaze toward the *Wu* palace in Leo to draw *qi*. Yet they fail to recognize that other directions exist, for the heavens’ movement never ceases. Moreover, the sky spans 365 degrees—half above the earth, half below—through which the sun and moon traverse their lodges. Though their paths follow degrees of longitude and latitude, who discerns the separation of the ecliptic and equatorial planes, or distinguishes the north-south circuit? As for drawing *Tiangang qi*, how can *Tiangang* at *xu* suffice? *Tiangang* follows the hour to determine the cyclical sign; by adding the monthly general to the hour, one deduces *Tiangang*’s establishment and draws *qi* toward it—this is deemed the height of subtlety. Yet if one must split a candle in two to face the void and inhale, is this truly effective? Only the sixteen-word incantation of the Great Sun and the twenty-four-word incantation of the Great Moon are supremely efficacious—these must never be lightly disclosed. Furthermore, the seven-character incantation *\"Zhuan Luo Kui Chi Chi Chi Chi Liang Piao\"* can summon *Tiangang qi*, drawing its kind from the Great Void, much like using a burning mirror to capture water and fire. One who masters this Dao sits amidst ascending mist, enveloped in luminous clouds—what need is there for calculations or meditative visualizations beyond established methods?\n\nAlas! The mysteries of the Three Lights remain imperfectly grasped.\n\nIt is said: The Three Lights Talisman is the foremost of ingested talismans. It can expel all perverse *qi*, *gu* *qi*, and oppressive *qi*; cure all demonic illnesses, break poisonous afflictions, sever ghostly fetuses, end corpse-induced consumption, and eradicate epidemics. For unbearable pains and the eighteen strange maladies, or accidental ingestion of poison or *gu* toxins, this talisman brings immediate relief with a single breath.\n\nYet later scholars know only the talisman’s name, unaware of:\n1. The true names of the Three Lights,\n2. The identity of *Tiangang*,\n3. The incomplete or erroneous recitation of the *Tiangang* incantation,\n4. The method of \"adding and aligning,\"\n5. The descent of *qi*,\n6. The transmission of the Three Talismans,\n7. The immediate efficacy of the Three Lights,\n8. The secret techniques of talisman stabilization,\n9. The proper timing for inscribing talismans.\n\nThese nine points of ignorance render the Three Lights Talisman ineffective.\n\nIt is said: To practice the Three Lights method, one must receive the Three Lights Register as a duty—only then will ghosts and spirits submit in reverence. If the method contradicts the register, local earth gods and temple spirits will mock you, and your practice will yield no results.\n\n**Absorbing the Three Qi**\nWhen ingesting the Three Qi each day, sit calmly before drawing *qi*, free from distracting thoughts. Alternatively, at midnight, don plain robes, sit in stillness, clench your fists, concentrate your spirit, knock your teeth, and swallow saliva three times. After a moment, visualize the Great Sun’s *qi* in your liver like the sun, the Great Moon’s *qi* in your lungs like the moon, and *Tiangang qi* in your heart like a tangerine-sized pellet. All emerge into the Yellow Court Palace, merging into one, then descend into the *Dantian*. Envision it entering the lower pass, ascending the double passes of the spine, passing through the middle pass, and striking the *Niwan* Palace. From the Bright Hall, it enters the Jade Pond; press your tongue against the upper palate, receive the true *qi*, swallow it, and store it in the *Dantian*—its form like a pellet, its color like a red tangerine. In all activities—walking, standing, sitting, or lying down—constantly focus on the true *qi* in your *Dantian*, radiant and resplendent. Upon completing the visualization, knock your teeth three times, swallow saliva three times, and rub your hands together eighty-one times, alternating left and right. Then rest.",
      "overlap_context": "angang’s decree, the Four Sage Lords—silently recite and unite with the Bright Heavenly Emperor’s Jade Emperor Great Sage Decree to command!\"*\n\n**Tiangang Direction Method**\nFor the current month and the hour of drawing *qi*, count forward to find the *chen*’s position—this is where the *Tiangang* points. To draw *Tiangang qi*, face the direction it points, visualize the Great Sage *Tiangang* before you, dishevel your hair, bare your feet, wear plain silk robes, and stand a hundred *zhang* tall.",
      "start_char": 8283,
      "end_char": 9547,
      "start_sentence": 548,
      "end_sentence": 635,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.64145874977112,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清北极天心正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "夫进炁时候，早午晚三时，或只早晚一次，日与夜同进，毕即封七户。 七户者，即口鼻耳眼也。 封法，两手各握天丁印，先以左手印封口鼻眼，两手各封左右耳毕，旋身出斗诀。 日月星是天上三奇，在人则神炁精。 服天上三奇，以辅我身中三奇。 服炁后，常闭口，鼻中绵绵炁息，往来微细，不吹动毫毛。 存三光，圆如弹丸，在下丹田，忌食五辛三厌诸血秽之物，不犯房事．不违此则为地仙。 书符咒水，治鬼御神，万邪摧伏，丧睛破胆，不敢近也。 此炁乃万法祖宗，行之九年，夜坐室中，不看灯烛，而目睹光明。 终身行之，其炁与天上三奇合体，而飞腾矣。 又贵在焚香，静定而有常也。 然精神内运，当导引。 若如此法式运用，则万病不能侵矣。 三田反复金液还丹诀序 此即三光中用。 肺为华盖，咽喉为重楼，口为玉池，眉为玉堂，额为天庭，鼻为天柱，顶为天宫，耳为双市门。 肾炁传肝，肝炁传心，心炁传脾，脾炁传肺。 下田入上田，上田又入中田，中田入下田，三田反复，号曰三光丹，亦曰大还丹。 五炁朝元三光炼形之图 东青西白南赤北黑神像也。 三光过关图 上关天府宫",
      "translated_text": "When conducting *qi*-absorption, do so at three times—dawn, noon, and dusk—or simply at dawn and dusk once each, performing the practice equally by day and night. Upon completion, seal the Seven Gates. The Seven Gates refer to the mouth, nose, ears, and eyes. The sealing method: clasp the *Tianding* seal with both hands, first using the left hand to seal the mouth, nose, and eyes, then each hand to seal the left and right ears. Then rotate the body and assume the Dipper mudra.\n\nThe sun, moon, and stars are the Three Celestial Wonders; in humans, they correspond to spirit, *qi*, and essence. Absorb the Three Celestial Wonders to augment the Three Wonders within the body. After absorbing *qi*, keep the mouth closed, allowing the breath in the nose to flow gently and subtly, so faint it does not stir a single hair. Envision the Three Lights as a pellet, round like a pellet, residing in the lower *Dantian*. Avoid the Five Pungent Foods, the Three Taboo Meats, and all impure substances of blood; refrain from sexual activity. Those who do not violate these precepts attain the state of Earthly Immortality. By inscribing talismans and consecrating water, one may subdue ghosts, command spirits, vanquish myriad evils, shatter their eyes, and break their gallbladders, so they dare not approach. This *qi* is the origin of all methods. After nine years of practice, one may sit in a chamber at night without lamplight yet perceive radiant clarity. Those who persist throughout their lives will merge their *qi* with the Three Celestial Wonders and ascend in flight.\n\nMoreover, it is essential to burn incense and maintain stillness with constancy. As the spirit and essence circulate internally, one should practice *daoyin*. By following this method, no illness can invade.\n\n**Preface to the Method of Reversing the Three Fields and Returning the Golden Elixir**\nThis pertains to the application of the Three Lights. The lungs serve as the Florid Canopy, the throat as the Tower of Dual Pillars, the mouth as the Jade Pond, the eyebrows as the Jade Hall, the forehead as the Celestial Court, the nose as the Celestial Pillar, the crown as the Celestial Palace, and the ears as the Twin Market Gates. Kidney *qi* transmits to the liver, liver *qi* to the heart, heart *qi* to the spleen, and spleen *qi* to the lungs. The lower *Dantian* enters the upper *Dantian*, the upper *Dantian* then enters the middle *Dantian*, and the middle *Dantian* returns to the lower *Dantian*—this reversal of the Three Fields is called the Three Lights Elixir, also known as the Great Return Elixir.\n\n**Diagram of the Five *Qi* Converging at the Origin and the Three Lights Refining the Form**\nThe east is blue-green, the west white, the south red, the north black—these are the spirit images.\n\n**Diagram of the Three Lights Passing Through the Passes**\nThe upper pass is the Celestial Palace.",
      "overlap_context": "ters the Jade Pond; press your tongue against the upper palate, receive the true *qi*, swallow it, and store it in the *Dantian*—its form like a pellet, its color like a red tangerine. In all activities—walking, standing, sitting, or lying down—constantly focus on the true *qi* in your *Dantian*, radiant and resplendent. Upon completing the visualization, knock your teeth three times, swallow saliva three times, and rub your hands together eighty-one times, alternating left and right. Then rest.",
      "start_char": 9547,
      "end_char": 10002,
      "start_sentence": 636,
      "end_sentence": 657,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.943315267562866,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清北极天心正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "此法又号水火既济本法，用寅卯时，平坐偃身，一撞三关，闻息良久，觉水火降升，要举动导引，默运心炁上升。 役使天罡法咒曰： 谨请天歪大神，速降真灵。 上朝金阙，下覆昆仑。 手持宝剑，搜斩邪精。 行神布炁，去病灭疼。 或咒果子，咒水治病，不可轻泄，妄传非人。 普施三光符水 一凡有邪祟妖怪染着，不能通言解醒。 念天罡咒，入水取罡炁，吸水噀其面，令病者服符，及三光煞鬼符，烧入水中吞。 一凡有瘟疫日服正炁，渐以安宁。 一凡有赤眼闭明，以变神掐斗诀，午文亦得。 次掐上帝诀，入斗印，取三光，吹笔书符，取炁咒水。 符浸水中，令病人洗眼，仍用斗诀，向正喝一声疾，发符念咒。 唵嚩□哩液□咤，尔是李公仲，缘何来我家？ 一念每一喝，即喝之。 付水与洗，仍向日取火炁呵之。 一凡有头痛不可忍者，当书三光符贴太阳穴。 一凡有疟鬼作梗者，书三光符於饼上，令食之。 书符咒曰：汝是形如黑忧鬼，吾知汝姓名，速速去千里，不得稍留停。 复取三光炁喷之，以三光符与吞。 一凡有生产，经日未下十死一生者，书三光符吞服，存三光大圣立前，次存雷电火车、煞鬼吏兵同监生大神等，存捧符人为符吏，赍持符命前去。 以立待雷电火车监生大神，随符入产人口中，立即生下。 一凡有鬼精作凶怪，以压害生人。 以三光煞鬼符贴门上，如着人身及六畜，咒水噀之。 一凡有疮疖久疼，以三光符烧灰贴之。 或以符覆之，或吞之。 或未破者，默念天罡咒七褊，取炁七过吹之，自然消溃。 一凡渡江涉海，有水怪绕船，作害不去，妄有求取而作惊恐者，取天罡正炁於铁剖上，书三光符掷水中。 一凡有百病未安，皆以三光符服之。 随病用汤吞下应邪炁，加煞鬼符，用东南方桃枝七寸，煎汤下。 或咒水皆可，或烧符在盏内服之。 收罡水法 罡者，阴中自然之火，破灭万邪。 凡收罡水，乃藏威而待之。 凡遇重午日大雨时，於华盖方，正子二年三卯四酉五复子。 下置水器收之。 若无雨，即於午时取井华水收之，谓之罡水。 又法：以天德月德日，每月丑日，若婆罗门下降日，已上是也。 遇天雨时，亦於华盖方收之。 谓之法水，皆祭而后用。 和合三光丹法 每一蒸饼，去皮并底，用心中，无所聚也。 分作二片，乾一片，用水浸烂一片，两片阴阳也。 一处两搓搜，令极黏腻，不计褊数念咒，取炁嘘之。 仍先想左手为日，右手为月，口嘘炁为罡。 捍作饼子翻覆，褊写三光符在上，不计徧数。 毕，随大小丸之，每一粒各存三光炁，咒一褊。 格云：若依此法，但将蒸饼吹之七七徧，其色如丹，久而难白，其灵尤妙，细丸之，与人吞服，日三光丹。 若书符投井中，五更初投符时，井水俱沸，试之即知神验矣。 存想真人形配衣式 凡伏哀问祟行持，先存顶上一座斗，以斗口罩身，罡在前出履一斗，垂罡在下，而两斗乘之，左右挟辅各一斗。 并以肘贪狼肩巨，问心为禄，存所握手处为文曲，左手即落，右腰右手即落，左腰为廉贞，为武曲，足前为破军。 罡光交焕，师在火光中，上有斗罩，下有斗乘也。 飞斗左手，子午挑出左边。 右手寅午，牛挑在后，左为阳斗云贪狼。 存想黑星光，自右足下发，绕左边直上，罩头顶上，出存红星。",
      "translated_text": "This method is also called the Fundamental Method of Water and Fire Achieving Balance. At the hours of *yin* (3–5 AM) and *mao* (5–7 AM), sit upright and recline the body. With a single thrust, penetrate the Three Passes, and listen to the breath for a long while. When you sense the ascent and descent of water and fire, perform movements to guide and direct, silently circulating heart *qi* upward.\n\nInvoke the Method of Commanding the Celestial Pillar with this incantation:\n*Reverently summon the Great Spirit of the Celestial Pillar to swiftly descend with true numinosity.\nAscend to the Golden Gate, descend to cover Kunlun.\nWielding the precious sword, search out and slay demonic essences.\nMarch the spirits, deploy the* qi*, dispel illness, and eradicate pain.\nWhether enchanting fruits or consecrating water to heal, do not lightly disclose or recklessly transmit to the unworthy.*\n\n**Universal Application of the Three Lights Talismanic Water**\nFor all cases where evil spirits, demons, or malevolent forces afflict and prevent speech or consciousness:\nRecite the Celestial Pillar incantation, draw *qi* from the Pillar into water, sip it, and spray it onto the face. Have the afflicted ingest the talisman along with the Three Lights Demon-Quelling Talisman, burned and dissolved in water.\n\nFor all cases of pestilence, take the Upright *Qi* daily to gradually restore tranquility.\n\nFor all cases of red eyes and impaired vision:\nAssume the Mudra of the Dipper, or the Noon Seal if necessary. Next, form the Mudra of the Supreme Emperor, enter the Dipper Seal, and draw the Three Lights. Blow onto the brush, inscribe the talisman, and take *qi* to consecrate the water. Soak the talisman in water and have the afflicted wash their eyes. Then, facing due north, shout \"Swift!\" once, release the talisman, and recite the incantation:\n*Oṃ va-□-li ya-□-ṭa, you are Li Gongzhong—why have you come to my home?*\nWith each recitation, shout once. Administer the water for washing, then draw the fire *qi* from the sun and exhale it onto the eyes.\n\nFor all cases of unbearable headaches:\nInscribe the Three Lights Talisman and affix it to the temples.\n\nFor all cases where malaria demons cause obstruction:\nInscribe the Three Lights Talisman on a cake and have the afflicted consume it. Recite the talismanic incantation:\n*You appear as a black sorrowful ghost—I know your name. Depart swiftly a thousand leagues, and do not linger for even a moment.*\nThen draw the Three Lights *qi*, spray it, and have the afflicted ingest the Three Lights Talisman.\n\nFor all cases of prolonged labor where the child has not descended, risking life:\nHave the mother ingest the Three Lights Talisman. Visualize the Three Lights Great Sage standing before her, followed by the thunder, lightning, and fire chariots, demon-quelling officials, and divine soldiers overseeing the birth. Envision the talisman-bearer as a talismanic officer, holding the talisman and command to proceed. Immediately summon the thunder, lightning, fire chariot, and birth-overseeing deities to follow the talisman into the mother’s mouth, ensuring swift delivery.\n\nFor all cases where demonic entities manifest malevolence to harm the living:\nAffix the Three Lights Demon-Quelling Talisman to the door. If the affliction clings to a person or livestock, consecrate water and spray it.\n\nFor all cases of long-standing sores and abscesses:\nBurn the Three Lights Talisman to ash and apply it to the afflicted area. Alternatively, cover the sore with the talisman or ingest it. For unbroken sores, silently recite the Celestial Pillar incantation seven times, drawing *qi* seven times to blow onto the sore, which will naturally resolve and discharge.\n\nFor all cases of crossing rivers or seas where water spirits encircle the vessel, causing harm and refusing to depart, or making unreasonable demands that induce terror:\nDraw the Upright *Qi* of the Celestial Pillar onto an iron blade, inscribe the Three Lights Talisman, and cast it into the water.\n\nFor all cases of unresolved ailments:\nIngest the Three Lights Talisman. Depending on the illness, dissolve it in decoction to expel pathogenic *qi*, or add the Demon-Quelling Talisman. Use a seven-inch peach twig from the southeast, boiled in water for ingestion. Alternatively, consecrated water or burning the talisman in a cup for consumption may also be used.\n\n**Method for Gathering Pillar Water**\nThe Pillar is the innate fire within *yin*, capable of destroying all evil. To gather Pillar Water is to conceal its power and await its use.\n\nOn the Double Fifth Festival during heavy rain, place a vessel in the direction of the Celestial Canopy (*huagai*) at the following hours: *zi* (11 PM–1 AM) for the first year, *mao* (5–7 AM) for the second, *you* (5–7 PM) for the third, and *zi* again for the fifth. If no rain falls, collect well water at noon and store it—this is called Pillar Water.\n\nAnother method: On days of Heavenly Virtue or Monthly Virtue, or the *chou* day (2–4 AM) of each month, or the day of Brahmin descent, collect water from the Celestial Canopy direction during rainfall. This is called Dharma Water, to be used only after offering.\n\n**Method for Harmonizing the Three Lights Elixir**\nTake a steamed bun, remove the skin and base, leaving only the center (where nothing congregates). Divide it into two pieces: dry one piece and soak the other until soft. These represent *yin* and *yang*. Knead them together until extremely sticky. Recite the incantation any number of times, drawing *qi* to exhale onto the mixture. Visualize the left hand as the sun, the right as the moon, and the exhaled *qi* as the Pillar. Shape the dough into cakes, flipping them repeatedly while inscribing the Three Lights Talisman on top any number of times. Once complete, form pills of varying sizes, each infused with the Three Lights *qi* and a recitation of the incantation.\n\nAs the text states: *If this method is followed, merely blowing onto the steamed bun seventy times will turn it crimson like cinnabar, resistant to fading. Its efficacy is extraordinary. Form it into fine pills for ingestion—this is the Three Lights Elixir. If a talisman is cast into a well at the first watch of dawn, the well water will boil. Test it to witness its divine efficacy.*\n\n**Visualization of the Perfected One’s Form and Attire**\nWhen subduing sorrow or exorcising malevolent forces, first visualize a Dipper above the crown, its mouth covering the body. The Pillar extends forward, stepping upon another Dipper, with the Pillar hanging below, flanked by two additional Dippers. The elbows align with *Tanlang* (Greedy Wolf), the shoulders with *Juxu* (Giant Gate), the heart with *Lu* (Salary), the clenched hands with *Wenqu* (Literary Brilliance). The left hand descends to the right waist, the right hand to the left waist, forming *Lianzhen* (Integrity) and *Wuqu* (Military Brilliance). The feet align with *Pojun* (Breaker of Armies). The Pillar’s radiance intermingles, with the master standing amidst the firelight, crowned by a Dipper above and borne by a Dipper below.\n\n**Flying the Dipper**\nWith the left hand, thrust the *zi-wu* (midnight-noon) axis to the left. With the right hand, thrust the *yin-wu* (tiger-noon) and *chou* (ox) axes to the rear, forming the left as the *yang* Dipper and the cloud of *Tanlang*. Visualize black stellar light emanating from beneath the right foot, coiling upward around the left side to crown the head, then projecting as a red stellar light.",
      "overlap_context": "Dantian* then enters the middle *Dantian*, and the middle *Dantian* returns to the lower *Dantian*—this reversal of the Three Fields is called the Three Lights Elixir, also known as the Great Return Elixir.\n\n**Diagram of the Five *Qi* Converging at the Origin and the Three Lights Refining the Form**\nThe east is blue-green, the west white, the south red, the north black—these are the spirit images.\n\n**Diagram of the Three Lights Passing Through the Passes**\nThe upper pass is the Celestial Palace.",
      "start_char": 10002,
      "end_char": 11275,
      "start_sentence": 658,
      "end_sentence": 714,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.450246810913086,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清北极天心正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "红光自左足发，绕右手边，直上罩头，头顶上出。 右手子午斗，挑出左边。 又寅午斗，挑出右边。 右为阴斗，魁至魒。 次辰戌斗盖头，又以三台重盖在上。 三台斗咒 上台虚精，巳。 保我千龄。 中台六淳，午。 卫我身形。 下台曲生，未。 拜谒三清。 上清北极天心正法竟",
      "translated_text": "Red light emanates from beneath the left foot, coiling upward along the right side to crown the head, then projecting from the crown. The right hand’s *zi-wu* Dipper thrusts to the left. The *yin-wu* Dipper thrusts to the right. The right forms the *yin* Dipper, from *Kui* to *Pi*. Next, the *chen-xu* Dipper caps the head, with the Three Terraces layered above.\n\n**Three Terraces Dipper Incantation**\nUpper Terrace: *Xu Jing* (Void Essence), *si* (Serpent).\nPreserve my thousand-year lifespan.\nMiddle Terrace: *Liu Chun* (Sixfold Purity), *wu* (Horse).\nGuard my bodily form.\nLower Terrace: *Qu Sheng* (Crooked Life), *wei* (Sheep).\nI bow in homage to the Three Clarities.\n\n**The Orthodox Rites of the Northern Culmen’s Celestial Heart are complete.**",
      "overlap_context": " standing amidst the firelight, crowned by a Dipper above and borne by a Dipper below.\n\n**Flying the Dipper**\nWith the left hand, thrust the *zi-wu* (midnight-noon) axis to the left. With the right hand, thrust the *yin-wu* (tiger-noon) and *chou* (ox) axes to the rear, forming the left as the *yang* Dipper and the cloud of *Tanlang*. Visualize black stellar light emanating from beneath the right foot, coiling upward around the left side to crown the head, then projecting as a red stellar light.",
      "start_char": 11275,
      "end_char": 11402,
      "start_sentence": 715,
      "end_sentence": 727,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.523122787475586,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清北极天心正法.txt",
        "category": "方法类"
      }
    }
  ]
}