{
  "source_id": "上清金真玉皇上元九天真灵三百六十五部元录",
  "source_file": "chunked_daozang\\上清金真玉皇上元九天真灵三百六十五部元录.json",
  "total_chunks": 9,
  "total_original_chars": 7994,
  "total_translated_chars": 55004,
  "total_translation_time": 277.2463972568512,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\上清金真玉皇上元九天真灵三百六十五部元录.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Clarity Golden Perfection Jade Sovereign’s Upper Prime Nine Heavens True Numinous Register of the Three Hundred Sixty-Five Departments**\n\n**Scripture Title:** *The Supreme Clarity Golden Perfection Jade Sovereign’s Upper Prime Nine Heavens True Numinous Register of the Three Hundred Sixty-Five Departments* (abbreviated as *The Upper Prime Nine Heavens True Numinous Mysterious Register*).\n\nAuthor unknown, approximately composed between the late Northern and Southern Dynasties or the early Tang. Falsely attributed to the Supreme Venerable Jade Dawn Lord bestowing it upon the Seven Perfected of Golden Radiance.\n\nOne scroll. Source text: *Daoist Canon of the Zhengtong Era*, Orthodox Section, Part One.\n\n---\n\n**The Supreme Clarity Golden Perfection Jade Sovereign’s Upper Prime Nine Heavens True Numinous Register of the Three Hundred Sixty-Five Departments**\n\nGolden Radiance said: In the *guihai* year, on the fifth day of the fifth month at noon, the Seven Perfected first received the *Upper Prime Numinous Register* from the Supreme Venerable Jade Dawn Lord. For nine years now, the Seven Perfected have treasured this register to gather spirit and qi, never once neglecting its divine writ.\n\nNow, in the fifth year of the Great Clarity (*taiqing*), the year *xinwei*, on the first day of the fifth month at noon, the Most High Heavenly Treasure Jade Sovereign descended in truth within the Jeweled Palace of Belt Ridge, once more ranking and ordaining the *Upper Prime Nine Heavens True Numinous Mysterious Register* for the Seven Perfected, rectifying the titles and positions of its officials and generals.\n\nGolden Radiance said: At that time, the Most High Heavenly Treasure Jade Sovereign spoke from his golden mouth, addressing the Seven Perfected: \"This *Upper Prime Nine Heavens True Numinous Register of the Three Hundred Sixty-Five Departments of Generals and Heavenly Officials* was not composed by later scholars. These true beings are the Upper Prime’s soaring, congealed, pure, and numinous life-breath, responding naturally to the luminous course of destiny to become perfected persons. When they don their robes, they naturally wear five-colored flying celestial feathered garments; their forms are adamantine, their bodies over three thousand *zhang* in height. The officials and generals under their command all wear the naturally arising three-colored flying azure feathered immortal robes, ever guarding the Upper Prime of the Nine Heavens to assist the thirty-six True Sovereigns in their governance.\n\nThus, their method accords with the four images of Heaven and Earth and the three hundred sixty-five degrees of the Jade Pass and the Celestial Pivot. It also mirrors the governance of the Nine Dawns, the Three Luminaries, the Seven Luminants, and the stellar lodges, as well as the nine palaces, eight trigrams, and three hundred sixty-five degrees of the correct positions. It further accords with the inception of the three hundred sixty-five qi of Heaven, Earth, and the four seasons. At the center, it governs the revolutions of the human form, the three hundred sixty-five joints, and the viscera.\n\nAbove, it presides over the circulation of the correct qi of Heaven and Earth; in the middle, it sustains the mandate of the Heavenly Thearch and the imperial foundation, the enlightened prosperity of rulers, the illumination of the Three Primes and the imperial course, and the transformation of the worthy kalpa. Below, it rescues the three realms from the multitudes of beings, opens the gate of true Dharma in great radiance, ferries celestial and human beings across the Bridge of Blessings, delivers the eight difficulties from the Sea of Suffering, extricates the three paths from the six destinies, saves the degenerate world through the *Mysterious Register*, wards off heavenly disasters through the numinous officials, delivers the nine breaths through divine merit, protects the myriad bodies with heavenly soldiers, preserves blessings and prosperity through kalpas, dispels the ten evils in the heavenly halls, restrains poisonous ghosts with divine generals, subdues all demons with the heavenly perfected, repels all misfortunes with the numinous clerks, overpowers all spirits with heavenly might, slays all demons with divine power, extinguishes water and fire with numinous wisdom, dissolves foul qi with azure waters, sweeps away clamorous dust with the golden wind, preserves the myriad forms with wondrous qi, cures the hundred diseases with the heavenly physicians, and stabilizes the myriad joints with true essence.\n\nThus, its merits are all-encompassing, its reach boundless, its method a reflection of the measures of Heaven, Earth, and humanity. It constantly follows the luminous course to descend teachings and deliver beings in the kalpa of decline. It safeguards the realm of non-action for the future. Its Dharma shall flourish in the era of the numinous dragon. When rulers practice the Dao and cultivate virtue, it is their destiny. When the imperial reign is at peace, it is their merit. When the lives of celestial and human beings are not cut short, it is their blessing.\"\n\nThe Most High declared: \"At this pinnacle, when the myriad Daoist arts have reached their end, the mysterious model arises, the Great Vehicle circulates, and the celestial years of the myriad beings are preserved, they shall attain equality with the Three Primes. Can this not be called the work of spontaneity, where deliverance is effortless?\"\n\nNow, therefore, this preface is composed to clarify its merits. May later worthies, perfected persons, and those who revere and uphold this teaching not fail to practice it accordingly.\n\n---\n\n**The Upper Prime True Numinous Mysterious Register**\n\nBelonging to the Primordial Heavenly Worthy of the Upper Prime of the Pure and Boundless True, governed by the Ever-Bright Golden Perfection Jade Lads. To the left: the True Person of the Nine Myriad, Nine Thousand, Nine Hundred Ninety-Nine Layers of Flowing Radiance of the Jade Heaven of the Pure True Primordial Qi; to the right: the True Person of the Eight Myriad, Eight Thousand, Eight Hundred Eighty-Eight Layers of Golden Light and Jeweled Brilliance of the Accumulated Yang True Essence Primordial Qi; at the center: the True Person of the Hundred Million Myriad Layers of the Jade Mystery Golden Primordial True Qi of the Boundless Pure and Wondrous Life-Breath of the Mysterious Origin. Together, they lead the Nine Hundred Ninety-Nine Myriad, Nine Thousand, Nine Hundred Ninety-Nine Layers of Qi of the Thirty-Six Grotto-Heavens’ Most True Empty Mystery Venerable Ones. The Seven Perfected of Golden Radiance now lead the Most High Heavenly Treasure Jade Sovereign’s thirty-six governances, overseeing the Flying Celestial Divine Kings of the Ten Directions, collectively administering the Three Primes of the Nine Heavens and the Supreme Ultimate above and below, revolving through the Four Images, and extending to the myriad numina.\n\nUniversally proclaimed to the boundless numinous officials of all heavens: the Seven Perfected, upholding the correct Dao, now bestow the *Upper Prime Nine Heavens True Numinous Register of the One Hundred Eighty-Three Departments*, along with the ranks and appointments of its generals, soldiers, officers, and clerks. They shall, in accordance with the Dharma, be installed and stabilized within the three hundred sixty-five palaces of the upper, middle, and lower regions of one’s body, safeguarding one’s form as they traverse the Five Directions and Eight Extremes, the Five Marchmounts, famous mountains and great marshes, the Three Rivers and Four Seas, the Yangtze, Huai, Ji, and Zi, the villages, townships, nine provinces, talismanic temples, and village altars, as well as all the deities of empty space. All shall obey the statutes and commands, assisting the nation and sustaining the mandate, controlling and guiding the multitude of spirits, healing the myriad beings, and delivering celestial and human beings.\n\nFrom the day one receives this register, one must not violate the precepts or breach the covenant, nor engage in licentious sacrifices to the Six Heavens’ ghostly spirits or commit wanton killing. One may only worship one’s ancestors in accordance with the orthodox canon of the Great Perfected. Should one commit licentiousness, theft, or other transgressions, turning from the true to the false, the generals, soldiers, officers, and clerks shall record one’s offenses. One and one’s seven generations of ancestors shall be consigned to the Wind Blade for ten thousand kalpas without reprieve, in strict accordance with the true and luminous imperial decree.\"\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Original-Life Ten Generals, with their officers, generals, and soldiers, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Life-Delivering Ten Generals, with their officers, generals, flying immortals, and dragon-mounted cavalry, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Body-Guarding Ten Generals, with their officers, generals, and soldiers, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Breath-Delivering Ten Generals, with their officers, generals, flying immortals, and dragon-mounted cavalry, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Body-Nurturing Ten Generals, with their officers, generals, and soldiers, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Left Life-Qi Ten Generals, with their officers, generals, and flying tiger cavalry, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Body-Protecting Ten Generals, with their officers, generals, and soldiers, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Right Life-Qi Ten Generals, with their officers, generals, talisman-executing and temple-destroying soldiers, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Concealing-Form Ten Generals, with their officers, generals, and soldiers, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Central Mysterious Life-Qi Ten Generals, with their officers, generals, and dragon-and-heaven-summoning soldiers, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Concealing-Form Ten Generals, with their officers, generals, and soldiers, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Disaster-Dispelling and Summoning Ten Generals, with their officers, generals, and soldiers, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Disease-Healing Merit-Officials Ten Generals, with their officers, generals, and soldiers, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Spirit-Controlling and Summoning Ten Generals, with their warriors, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Celestial Physician Merit-Officials Ten Generals, with their officers, generals, and soldiers, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Hundred-Ghosts-Subduing Ten Generals, with their warriors, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Life-Supporting and Form-Guarding Ten Generals, with their officers, generals, and soldiers, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Flying Celestial White Tiger Document-Delivering and Flying Dragon Cavalry Ten Generals, with their officers, generals, and soldiers, each numbering one hundred thousand.\n\nIn the reign year, the [such-and-such] month, the [such-and-such] day of the first lunar day, Wang of [such-and-such] commandery, county, village, and hamlet, aged [such-and-such] years, now receives the Supreme Primordial Nine Heavens’ True Numinous One Hundred Eighty-Three Registers of the Mysterious. The generals, soldiers, true officials, and officers are hereby arrayed and bestowed upon his person.\n\nThe generals, soldiers, and various officials shall, according to their positions, array themselves within the palaces of his body, encircling him above and below, nurturing his form and assisting his qi. His hun-soul and po-soul, his form and shadow, shall unite as one—guarding before and protecting behind, controlling and restraining left and right. With awe-inspiring might spanning ten thousand miles, the myriad demons, evil spirits, spectral beings, and unorthodox gods shall all be crushed and destroyed by poisoned blades, coming to submit and transform, upholding the true and orthodox Dao.\n\nShould there be any stubborn and disobedient malevolent spirits or rebellious ghosts, they shall all be delivered to the generals and soldiers for sweeping eradication. From this day forward, they shall abide by the primordial and spread the beginning, ever guarding his person.\n\nHasten, hasten, in accordance with the true and luminous statutes of the Supreme Primordial Nine Heavens.\n\nThe talismans within the scroll are all inscribed in vermilion.\n\nThe Seven Perfected of Golden Clarity, upholding the Supreme Primordial Nine Heavens’ Upper Numinous One Hundred Eighty-Two Registers of the Mysterious, the generals, soldiers, celestial officials, and officers, together with the Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous One Hundred Eighty-Three Registers of the Mysterious, total three hundred sixty-five registers. This corresponds to the law and image of Heaven and Earth, the Nine Auroras, Three Luminaries, Seven Luminants, and stellar constellations, the Four Seasons, Five Phases, Nine Palaces, Six Jia, and Eight Trigrams, the pivot of the celestial sphere and the correct measure of the wandering Three Primordials, eternally securing them within the human body.\n\nNow, with utmost sincerity and profound truth, I take refuge in the Three Honored Ones, for the principle lies in what may be pitied.\n\nThe Seven Perfected, on this day, transmit the Upper Numinous Mysterious Registers in accordance with the statutes. The generals, soldiers, celestial officials, and officers shall all, in accordance with the law, guard his form, roaming above and below through the Five Directions and Eight Extremities, the Five Marchmounts, famous mountains and great marshes, the Three Rivers, Four Seas, Jiang, Huai, Ji, and Du, the land altars and village shrines of the Nine Provinces and Four Domains, and all the numinous spirits and divine souls. They shall all uphold the talismanic mandate, control and guide the ten directions, and jointly defend his person. In every place, they shall all comply and act accordingly.\n\nShould any malevolent spirits or evil ghosts seek to harm him, the generals and soldiers shall, in accordance with the law, execute and slaughter them without delay.\n\nShould he violate the statutes or breach the covenant, engaging in licentiousness, theft, or sacrifices to the ghostly spirits of the Six Heavens, and be observed and investigated by the celestial officials, on the day he dies and undergoes the Three Offices’ interrogation and torture, he shall not blame his master or fault the Dao.\n\nAll in accordance with the true and luminous statutes of the Nine Heavens.\n\nThe Supreme Mysterious Supreme Primordial Nine Heavens’ Upper Numinous Original-Life Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Non-Ultimate Supreme Primordial Nine Heavens’ Upper Numinous Flying Celestial Ding Warriors Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Supreme Mysterious Supreme Primordial Nine Heavens’ Upper Numinous Life-Delivering and Spirit-Opening Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Non-Ultimate Supreme Primordial Nine Heavens’ Upper Numinous Flying Celestial Talisman-Executing, Temple-Destroying Vajra Warriors Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Supreme Mysterious Supreme Primordial Nine Heavens’ Upper Numinous Life-Delivering and Numinous-Opening Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Non-Ultimate Supreme Primordial Nine Heavens’ Upper Numinous Flying Celestial Demon-Subduing and Demon-Slaying Warriors Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Supreme Mysterious Supreme Primordial Nine Heavens’ Upper Numinous Life-Qi-Delivering and Opening Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Non-Ultimate Supreme Primordial Nine Heavens’ Upper Numinous Flying Celestial Spirit-Seizing and Ghost-Consuming Warriors Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Supreme Mysterious Supreme Primordial Nine Heavens’ Upper Numinous Body-Encircling Lightning Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Non-Ultimate Supreme Primordial Nine Heavens’ Upper Numinous Flying Celestial Essence-Seizing and Poison-Consuming Warriors Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Supreme Mysterious Supreme Primordial Nine Heavens’ Upper Numinous Illustrious Might Body-Guarding Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Non-Ultimate Supreme Primordial Nine Heavens’ Upper Numinous Flying Celestial Examination and Summoning Warriors Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Supreme Mysterious Supreme Primordial Nine Heavens’ Upper Numinous Yang Spirit Upright Qi Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Non-Ultimate Supreme Primordial Nine Heavens’ Upper Numinous Flying Celestial Officials and Scribes Flying Talisman Seizing and Summoning Warriors Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Supreme Mysterious Supreme Primordial Nine Heavens’ Upper Numinous Yin Spirit Upright Qi Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Non-Ultimate Supreme Primordial Nine Heavens’ Upper Numinous Flying Celestial Crimson Whirlwind Golden Army Feathered Messengers Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Supreme Mysterious Supreme Primordial Nine Heavens’ Upper Numinous Spirit-Protecting and Body-Guarding Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Non-Ultimate Supreme Primordial Nine Heavens’ Upper Numinous Flying Celestial White Tiger Memorial-Conveying Dragon Immortals Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nMale and female disciples of the living, [Name], wholeheartedly devote themselves to the Mysterious True, seeking to receive the Upper Primordial Nine Heavens’ True Numinous Three Hundred Sixty-Five Registers of the Mysterious. The Seven Perfected Ones shall, in accordance with the method, array the generals, soldiers, celestial officials, and scribes in their proper ranks, and in due order transmit the Mysterious Registers to [Name], while also sealing them with the Flying Mysterious Three Primordials’ Life-Prolonging Numinous Talismans. These shall command the celestial officials and divine soldiers, and now a universal proclamation is made to Heaven and Earth, the Five Directions and Eight Extremes, the Nine Dawns and Three Luminaries, the Seven Radiant Ones, all celestial star lodges, the Four Seasons and Five Phases, the Nine Palaces and Six Jia, the Eight Trigrams, the Three Offices and Nine Bureaus, and all officials of the Three Realms: all shall heed the edict and talismanic command, jointly safeguarding [Name]’s person, protecting them from the Three Disasters and Nine Calamities, the Five Poisons and Eight Difficulties, the perils of wind, blade, water, fire, and the Five Weapons, and all manner of suffering and misfortune. May [Name]’s years and life attain equality with the Three Primordials. May a thousand demons and ten thousand devils all submit and be transformed, and may a hundred evils be extinguished. May the celestial officials and divine soldiers, as vowed, eternally guard [Name]’s three hundred sixty-five passes, palaces, and bureaus, so that their wondrous qi endures through the kalpas. All is done in accordance with the True and Luminous Statutes and Ordinances of the Nine Heavens.\n\nThe Upper Primordial Three Hundred Sixty-Five True Numinous Mysterious Registers may be received equally by both male and female disciples, with no distinction between them.\n\nMale and female children of [such-and-such] commandery, county, village, and hamlet, aged [such-and-such] years, shall this day be invested with the Mysterious Register of One General for the Protection of the Body through the Dao. They shall uphold and practice the pure and mysterious qi.\n\nHasten! As the statutes and ordinances command.\n\nOne Non-Ultimate Nine Heavens Jade Immortal Great General, with one hundred thousand officials, generals, scribes, and soldiers.\n\nThe Seven Perfected of Golden Luminosity now transmit the Mysterious Register of One General to the male or female child [Name]. From this day forward, as [Name] bears the Mysterious Register and divine talismans, the celestial officials, scribes, and soldiers shall all jointly safeguard them, guarding their person, averting disasters, repelling evil, capturing demons, and beheading malevolent spirits. May the baleful gods and rebellious ghosts of the Five Directions and Eight Extremes, the celestial afflictions and earthly deities, the wandering and hunting spirits in the void, the myriad specters and all numinous essences dissolve like clouds. May all the good gods of the heavens and the true officials of the earth heed the talismanic command and eternally protect them. Should any fierce or obstructive ghosts or gods seek to harm them, the generals, officials, and soldiers shall capture and behead them without delay.\n\nHasten! As the True and Luminous Statutes and Ordinances of the Nine Heavens command.\n\nOn the [such-and-such] day of the [such-and-such] month of the [such-and-such] year, at the hour of *zi*, the ritual is performed.\n\nThe text of the register for male and female children.\n\nRitual for the Transmission of the Register and the Investiture of Officials and Soldiers\n\nNext, ascend the altar, face east, and bow twice. Next, offer incense three times. Next, strike the ritual drum twenty-four times. Next, kindle the incense burner.\n\nThe Pure and Mysterious, Boundless and Supreme, the True and Lofty Three Heavens, the Primordial Qi of the Boundless Dao, the Most High Lord Lao, the Left and Right Incense Officials, the Flying Immortals and Dragon-Messengers bearing incense, the Heavenly Flying Dragon-Riders and the Jade Lads and Maidens serving the Five Thearchs—twenty-four of each—emerge.\n\nThey reverently address the Primordial Heavenly Worthy of the Void and the Natural, as the Seven Perfected burn incense and present the memorial, entrusting the ritual of transmission and ordination. May the Primordial Qi of the Most High’s Ten Directions and True Perfected Ones descend into the bodies of the Seven Perfected, that their petition may ascend directly before the Imperial Presence of the Boundless Dao and the Most True Jade Emperor.\n\nThis done, they bow twice, then kneel reverently before the incense table. The officials emerge to receive the memorial and transmit the ordination.\n\nWith solemn care, the Golden Luminance Seven Perfected summon from within their bodies the True Officials and Merit Officers of the Five Agents—two of each—who emerge. The Merit Officers of the Upper Nine Heavens—two of each—emerge. The Merit Officers of the Upper Nine Heavens’ Ascending Mystery—two of each—emerge. The Merit Officers of the Upper Nine Heavens’ Orthodox Unity—two of each—emerge. The Merit Officers of the Upper Nine Heavens’ Left Mystery and True Luminance—two of each—emerge. The Merit Officers of the Upper Nine Heavens’ Right Mystery and Supreme Perfection—two of each—emerge. The Merit Officers of the Upper Nine Heavens’ Yang Spirit and Orthodox Unity—two of each—emerge. The Merit Officers of the Upper Nine Heavens’ Yin Spirit and Orthodox Unity—two of each—emerge. The Merit Officers of the Upper Nine Heavens’ Divine Capital and Healing—two of each—emerge. The Supreme Upper Nine Heavens’ Flying Heavenly White Tiger Envoys bearing the memorial, the Dragon-Riding Immortal Couriers—two of each—emerge.\n\nWith solemn care, the Seven Perfected summon from within their bodies the True Official Envoys, the Divine Capital’s Direct True Talisman Officers, and the Envoys leading the Immortal Prefectures—one thousand two hundred of each—who emerge. Robes immaculate, sashes and pendants in order, each arrays the celestial and true feathered regalia, forming ranks on all four sides and eight directions, encamping and guarding left and right, front and back. Their radiance flashes like lightning, sweeping away all inauspicious influences. With dark clarity, they present and transmit the ritual of ordination.\n\nNow, there are so many men and women of such-and-such prefecture, county, village, and hamlet who, having renounced the mundane and turned toward the Mysterious and True, wholeheartedly take refuge in the Three Worthies. They seek to receive the Three Hundred Sixty-Five Registers of the Upper Nine Heavens’ True Numinosity. Today, their celestial titles and ranks are inscribed according to the statutes of the Mysterious Registers. If the register is to be presented, it shall be declared at the proper time; if the ordination is to be transmitted, it shall be declared at such-and-such an hour. Then, at that hour, the Three Primordials and Nine Heavens’ Officials are invoked to transmit the ordination.\n\nNow, a second memorial is reverently presented to the Boundless Dao, the Primordial and Most High Jade Emperor, the Supreme and Most True Great Sage Heavenly Worthy, the Golden Portal Jade Thearch, and the Divine Capital’s True Officials, the Envoys who examine and summon deeds and records. May their true compassion descend, their dark scrutiny overseeing the ordination of these registers of the Upper Nine Heavens’ True Numinosity. May they all, according to their ranks, be transmitted into the bodies of these ordinands, settling in their palaces and guarding their bureaus, encamping and protecting them on all sides. Turning left, nine thousand myriad layers; turning right, nine thousand myriad layers. Guard their bodies, protect their lives, their brilliance shining forth, their majestic influence extending ten thousand miles.\n\nGenerals, soldiers, celestial officials, and marshals shall take the same form as these ordinands, their spirits penetrating within and without. The true officials of the lands they tread shall infuse them with qi, overseeing and examining them. All the officials and soldiers shall assist and support them. According to merit, they shall be promoted and rewarded, their loyalty and trust never betrayed. Thus is this memorial presented before the Imperial Presence of the Boundless Dao and the Most True Jade Emperor.\n\nThis done, they bow twice and then present the memorial. When the memorial is concluded, they again invoke and proclaim its merit.\n\nThe Golden Luminance Seven Perfected again invoke from within their bodies the multitude of true Merit Officers, celestial officials, marshals, soldiers, chief envoys, and the Flying Heavenly White Tiger Envoys bearing the memorial, the Dragon-Riding Immortal Couriers. The Seven Perfected address the emergent officials, presenting the memorial and petition. The dark hosts of their subordinate true ones return, ascending the void in their chariots, resuming their palaces and bureaus, settling into their proper positions, encamping in heaven and assisting on earth.\n\nThey return, preparing the hundred thousand myriad layers of heavenly palaces within the Seven Perfected’s bodies. The true and orthodox each reenter through the vermilion gates and wondrous portals, resuming their ranks. Thus is the petition of the Seven Perfected presented before the Dao.\n\nThis done, they bow twice, return to the table, and kneel facing north. The officials emerge once more to transmit the registers of ordination and governance.\n\nThe Golden Luminance Seven Perfected again activate from within their bodies the Five True Gentlemen-Officials, the Left and Right Merit-Officers, the Immortal Lords and Dukes, the Direct True Talisman Officers, the Divine Capital’s Jade Gentlemen, the Orthodox Unity and Ascending Mystery Merit Officers, the Chief Envoys who examine and summon, the Envoys who inspect the Immortal Kings, the Flying Heavenly Riders, the Direct True Flying Dragon-Riders, and the Soaring Dragon Couriers—thirty-six of each—who emerge. Robes immaculate, they array the celestial regalia, covering heaven and filling earth, assuming positions left and right. According to the ritual, they oversee, inspect, and transmit the Three Hundred Sixty-Five Registers of the Upper Nine Heavens’ True Numinosity—generals, soldiers, celestial officials, and marshals—into the bodies of these ordinands. They settle and guard the Three Hundred Sixty-Five Passes and Palaces of their joints and bureaus, encamping with a hundred thousand myriad layers, ensuring no errors.\n\nThey prepare and encamp these ordinands, uniting them with the multitude of true ones. Thus is the petition of the Seven Perfected presented directly before the Imperial Presence of the Boundless Dao and the Most True Jade Emperor.\n\nThis done, the registers of ordination are read aloud, transmitted by the heavenly palaces. When this is complete, the registers are invoked, then the talismanic texts are invoked, with the prayer:\n\nThe Dao opens the true, the Orthodox Dharma stands majestic.\nThe power of the Great Nonbeing stirs a mighty wind,\nFrom the nonbeing, light arises.\nThe divine merit of the Great Nonbeing transforms the ten directions.\nThe True Talismans of the Great Mystery summon the Spirit Kings.\nSupreme control and command shatter the myriad calamities,\nThe Nine Heavens uphold life, the Six Heavens dare not oppose.\nAll heavens protect and encamp, guarding through endless kalpas.\n\nHasten! As the Statutes and Ordinances of the Jade Emperor command.\n\nNext, the water texts of the ordination registers are invoked, with the prayer:\n\nThe Most High’s azure waters surge from the Celestial River,\nTransforming into divine qi like a heavenly net.\nFlying and scattering like swords, they slay heavenly demons.\nThe ghostly soldiers of the five directions—\nAll who encounter them are dissolved,\nLike wind, like fire, extinguishing spirits and sweeping away demons.\n\nHasten! As the Statutes and Ordinances command.\n\nThis done, the ordination registers are transmitted, and the merit is proclaimed. Next, incense is offered three times. They return to the table, face east, and kneel to proclaim the merit.\n\nThe Seven Perfected of Golden Clarity,\nsupplicate the Boundless Dao’s Beginningless, Most High, Perfectly True and Greatly Sagely Heavenly Worthy.\n\nTo the Five Perfected Gentlemen and Clerks within the bodies of the Seven Perfected,\nthe Left and Right Merit-Balancing Immortal Lords and Immortal Dukes,\nthe Direct Perfected Talisman Clerks,\nthe Jade Gentlemen of the Immortal Capital,\nthe Orthodox Unity Ascending Mystery Merit Recorders,\nthe Inspecting and Summoning Celestial Kings and Envoys of the General Bureau,\nthe Flying Heavenly Mounted Riders,\nthe Direct Perfected Flying Dragon Riders,\nthe Soaring Dragon Courier Manifesting Flying Immortals and Feathered Riders—\n\nall are charged to oversee and transmit the ordination of [Name] in this ritual affair.\nBy the mysterious invocation, merit is proclaimed and promotion petitioned.\nEach shall be elevated to lofty celestial ranks, myriad-fold,\nas recorded in the Golden Tablets, their merit recompensed and promotion granted.\n\nWhen the affair is complete,\neach shall return to their numinous soaring chariots,\nrestoring to the Mysterious Palace, the Golden Hall, and Jade Treasury,\nperpetually guarding the Three Primes,\nall resuming their former stations,\nawaiting future summons before reappearing.\n\nThe Upper Prime’s Nine Heavens’ True Spirits,\nthe Three Hundred and Sixty-Five Departments of Mysterious Registers,\nthe generals, soldiers, celestial officials, and talisman clerks\nentrusted by the Seven Perfected to [Name]—\nfrom this moment onward,\nshall constantly guard and protect [Name],\nenduring through endless kalpas.\n\nThe Seven Perfected memorialize,\ntheir words ascending to the Boundless Dao’s Perfectly True Jade Emperor’s presence.\n\nThis done, they bow twice more before the incense burner, concluding the rite, then return to the burner.\n\nThe Left and Right Incense Officials,\nthe Flying Immortal Courier Dragon Riders,\nthe Incense-Bearing Envoys,\nthe Flying Heavenly Dragon Riders—\nall cause the numinous altar to generate spontaneous golden radiance and precious luminance,\nmysteriously reflecting the essence of jade brilliance and golden liquid,\nso that [Name] receives the blessings of the Dao, at ease and secure,\nthe world beneath heaven receives grace,\nand the jade lads and jade maidens of the ten directions attend in guard.\nThe fragrant smoke ascends directly to the Seven Perfected’s memorial\nbefore the Boundless Dao’s Perfectly True Jade Emperor.\n\nRight: Ordination Register, Memorial Document, and Petition.\n[Name], male/female, of [Prefecture], [County], [Village], born in the year of [Heavenly Stem-Earthly Branch], aged [Number] years.\n\nRight: [Number] persons now submit their petitions, requesting to receive the Mysterious Registers of the Upper Prime’s Nine Heavens and Three Hundred Sixty-Five Departments. Respectfully filed petition.\n[Name], male/female child, of [Prefecture], [County], [Village], aged [Number] years.\n\nRight: [Number] persons now submit their petitions, requesting to receive the Mysterious Register of the Supreme Nine Heavens’ Jade Immortal First General Child. Respectfully filed petition.\nTwo hundred coins, five bundles of firewood.\n\nRight: The token offerings for receiving the Mysterious Registers of the Three Hundred Sixty-Five Departments are as follows:\nTwo hundred coins, one bundle of firewood.\n\nRight: The token offerings for receiving the Child’s Mysterious Register are as follows.\n\nThe Celestial Worthy of Primordial Qi of the Orthodox Unity of the Boundless Dao,\nthe Ever-Bright Golden Perfected Jade Emperor’s Court,\nthe Left: Nine Myriad Nine Thousand Nine Hundred Ninety-Nine Layers of Flowing Luminous Jade Heavenly Perfected of the Pure True Primordial Qi,\nthe Right: Eight Myriad Eight Thousand Eight Hundred Eighty-Eight Layers of Golden Mysterious Radiant Treasure Light Perfected of the Accumulated Yang Primordial Qi,\nthe Center: Hundreds of Thousands of Myriad Layers of Jade Mysterious Golden Primordial Perfected of the Wondrously Pure and Boundless Primordial Qi of Living Spirits—\nall together lead the Nine Hundred Ninety-Nine Myriad Nine Thousand Nine Hundred Ninety-Nine Layers of Qi of the Upper Realm’s Pure Void and Spontaneously Generated Spirit,\nlead the Thirty-Six Grotto-Heavens’ Most True Void Mysterious Elders,\nlead the Highest Jade Emperor’s Thirty-Six Perfected Sovereigns’ Orthodox Governance and the Ten Directions’ Boundless Jade Judicial Kings,\nthe Golden Luminous Seven Perfected, bowing twice, reverently salute the Highest Perfected’s True Might and Orthodox Qi.\n\nRespectfully following the ancient statutes, there are now male and female disciples who, having first received the grace of their masters’ initiation, were appointed to celestial offices. They have advanced to partake in the wondrous methods of the Three Caverns’ Supreme Dao, undeservingly bearing the boundless grace of the Great Dao’s vast beneficence. Yet, having been born and raised in the turbid world, their lives are subject to the Three Calamities. They have committed transgressions and accumulated evil, their habits ingrained by nature. Their bodies and minds have been careless, violating prohibitions and sacred pledges. Their sins have piled high as mountains, their faults deep as the abyss. They have incurred the greatest of offenses and transgressions.\n\nHaving heard that the Great Dao’s compassionate truth universally nurtures all, its grace pervading the ten directions, its embrace vast as the sea, its mercy moistening the Three Realms and Six Paths, with nothing left unprovided—yet they, greedy for advancement and forgetful of retreat, have no means to save themselves. Thus, they humbly submit their petitions to the Mysterious Perfected, taking refuge in the Three Worthies, beseeching to receive the Upper Prime’s Nine Heavens’ True Numinous Three Hundred Sixty-Five Departments’ Mysterious Registers, the generals, soldiers, celestial officials, and divine officers, to forever ferry them across the ford of the Long River. After receiving the register, they shall follow the statutes and uphold the precepts, daring not to transgress.\n\nThe Seven Perfected, seeing their ceaseless prostrations, shall then appoint them to celestial offices. Respectfully recording their prefectures, counties, villages, names, and ages, this day they submit their memorials and petitions, reporting their celestial office titles as stated above.\n\nWe humbly pray that the Boundless Dao’s Supreme Golden Portal Jade Emperor, Most True and Great Sage, may move the Three Heavens’ Immortal Capitals to appoint the Jade Gentlemen of the Immortal Offices, the Nine Heavens’ True Kings’ Supervisors of Registers and Life-Spans, to summon the celestial officials, distinguish their proper ranks, and on this day of this month, ordain and appoint them according to the law. Their earnest words are inscribed and submitted, memorialized before the Boundless Dao’s imperial presence.\n\nThe Golden Luminous Seven Perfected bow twice and present this petition, ascending to the Supreme Prime’s Nine Heavens’ Golden Portal Jade Emperor to summon the Pure True Orthodox Qi.\n\nIn the year of [Heavenly Stem-Earthly Branch], on the [Day] of the [Month], at the hour of the Rat, the Golden Luminous Seven Perfected submit this petition in [Prefecture], [County], [Village].\n\nThe Supreme Prime’s Nine Heavens’ Most True and Great Assembly of the Supreme Perfected descends and dispatches.\n\nRight: Ordination Register and Memorial Rites.\n\nThe Golden Luminous Seven Perfected of the Celestial Worthy of Primordial Qi of the Orthodox Unity of the Boundless Dao’s [Name] Court bow twice and reverently salute the Highest Perfected’s True Might and Orthodox Qi. Following the Mysterious Statutes, there are now [Number] male and female disciples who submit their petitions, prostrating themselves to seek the Upper Prime’s Nine Heavens’ True Numinous Three Hundred Sixty-Five Departments’ Mysterious Registers. The Seven Perfected, on this day of this month, in accordance with the statutes, appoint them to celestial offices and ranks as stated above, submitting their memorials and petitions to the Dao’s imperial presence.\n\nWe humbly pray that the Boundless Dao’s Most True and Great Sage, the Supreme Celestial Worthy, may deign to oversee with divine gaze, compassionately descending to deliver them from the calamities of the sea of suffering, forever becoming the treasure of their bodies. May the edict be issued to the Nine Heavens’ Highest Jade Emperor’s Supervisors of Registers, the Mysterious Capital’s Immortal Sovereigns’ Jade Gentlemen Supervisors of Oaths, the Ten Directions’ Flying Celestial Jade Bureau’s Divine Immortal Feathered Gentlemen Envoys, and the Supreme Three Heavens’ Golden Portal Jade Emperor’s Dao Perfected Lords of Disaster Dispelling—all descending together, their celestial perfected riding mounts covering heaven and earth, their flowing essence flashing like lightning, sweeping away the myriad wrongs of the Six Heavens, summoning the divine officials of the Three Realms to jointly oversee and deliver them. May they receive the Upper Prime’s Nine Heavens’ True Numinous Three Hundred Sixty-Five Departments’ Mysterious Registers, the generals, soldiers, celestial officials, and divine officers, itemized and bestowed, forever guarding the Three Hundred Sixty-Five palaces within their bodies, ensuring the Primordial Decree does not lose its order.\n\nThe Seven Perfected prostrate themselves and present one memorial.\n\nWe beseech the Boundless Dao’s Supreme Golden Portal Jade Emperor, Most True and Great Sage, to take pity on the Seven Perfected’s petition, distinguishing the merits of the Pure True Primordial Qi’s living spirits and divine transformations according to each matter. May the celestial perfected and their subordinates bestow and ordain them, constantly protecting and defending, their flowing light flashing like lightning, spreading through their palaces, forever becoming the treasure of their bodies.\n\nRespectfully entrusted to the Upright Perfected Talisman Officers, the Flying Dragon Riders, the Flying Celestial Jade Gentlemen, the Petition-Submitting Flying Perfected White Tiger Divine Dragon Riders—each one thousand two hundred in number—to swiftly deliver this memorial to the Supreme Most True Jade Emperor’s imperial presence.\n\nThe Golden Luminous Seven Perfected bow twice and make this known.\n\nThe Golden Luminous Seven Perfected Disciples, belonging to the Golden Phase Cavern-Luminous Jade Realm’s Nine Perfected Village of the Upper Realm’s Golden Wheel Hamlet.\n\nThe Great Purity is in accordance with the law.\n\nIn the year of [Heavenly Stem-Earthly Branch], on the [Day] of the [Month], at the hour of the Rat, prostrating and submitting in [Village].\n\nRites for the Upper Prime’s Nine Heavens’ True Numinous Officials’ Manifestation.\nCommonly used for the laity’s urgent petitions for salvation and blessings.\n\nNext, enter seclusion and bow twice facing east.\nAt night, face north to make the report.\nNext, kneel lengthily before the altar and offer incense three times.\nUpon completion, rise and stand.\n\nNext, strike the celestial drum twenty-four times. Then, open the incense burner.\n\nThe Pure and Boundless True One of the Three Heavens’ Primordial Origin, the Primordial Qi of the Boundless Dao, the Most High Lord Lao; the Left and Right Incense Officials; the Flying Immortals’ Dragon-Mounted Couriers; the Incense-Bearing Envoys; the Flying Celestial Dragon-Riders; and the Jade Lads and Maidens attendant upon the Five Thearchs—twenty-four each—emerge to report above to the Primordial Heavenly Worthy of the Void and Spontaneous Nature. [The petitioner] now burns incense and submits this memorial, praying that the Primordial Qi of the Most High’s Ten Directions’ True and Upright Ones descend into the body of so-and-so.\n\nThe report shall ascend directly to the Imperial Presence of the Boundless Dao’s Most True Jade Thearch. Upon completion, bow twice, then kneel lengthily before the incense altar and present the memorial for the officials’ manifestation.\n\nRespectfully summon from the body of the disciple so-and-so the True Officials and Merit Officers of the Five Agents—two each. From the Upper Prime’s Nine Heavens, the Merit Officers—two each. From the Upper Prime’s Nine Heavens’ Ascending Mystery, the Merit Officers—two each. From the Upper Prime’s Nine Heavens’ Left Mystery’s True Luminous Merit Officers—two each. From the Upper Prime’s Nine Heavens’ Right Mystery’s Grand True Merit Officers—two each. From the Upper Prime’s Nine Heavens’ Yang Spirit’s Orthodox Unity Merit Officers—two each. From the Upper Prime’s Nine Heavens’ Yin Spirit’s Orthodox Unity Merit Officers—two each. From the Upper Prime’s Nine Heavens’ Upper Immortals’ Capital’s Healing Merit Officers—two each. From the Upper Prime’s Nine Heavens’ Upper Numinous Flying Ascendant Celestial Ding Force Soldiers—two each. From the Upper Prime’s Nine Heavens’ Upper Numinous Flying Ascendant Talismanic Destruction of Demonic Shrines Vajra Force Soldiers—two each. From the Upper Prime’s Nine Heavens’ Upper Numinous Flying Ascendant Demon-Subduing and Demon-Slaying Force Soldiers—two each. From the Upper Prime’s Nine Heavens’ Upper Numinous Flying Ascendant Spirit-Seizing and Ghost-Devouring Force Soldiers—two each. From the Upper Prime’s Nine Heavens’ Upper Numinous Flying Ascendant Essence-Seizing and Toxin-Devouring Force Soldiers—two each. From the Upper Prime’s Nine Heavens’ Upper Numinous Flying Ascendant Celestial Examination and Summoning Force Soldiers—two each. From the Upper Prime’s Nine Heavens’ Upper Numinous Flying Ascendant Celestial Clerks and Flying Talismanic Summoning Force Soldiers—two each. From the Upper Prime’s Nine Heavens’ Upper Numinous Flying Ascendant Scarlet Whirlwind Golden Chariot Feathered Clerks—two each. From the Supreme Upper Prime’s Nine Heavens’ Upper Numinous Flying Ascendant White Tiger Memorial-Delivering Dragon-Riding Couriers—two each.\n\nRespectfully summon from the body of so-and-so the True Official Envoys, the Capital of Immortals’ Direct True Talismanic Clerks, and the Leading Envoys of the Capital of Immortals’ Officials—one thousand two hundred each.\n\nSolemnly adorned in robes, caps, and pendent tassels, each arrays the celestial feathered regalia of the True Ones, forming ranks on all four sides and eight directions. They guard and protect so-and-so’s left and right, front and rear, their flowing luminosity flashing like lightning, filling heaven and earth, sweeping away inauspiciousness. The divine radiance illumines brightly the dwelling of so-and-so, where the Mysterious Mirror observes all that is reported.\n\nNow, so-and-so, a common person of such-and-such prefecture, county, village, and hamlet, respectfully states the following in accordance with the matter at hand:\n\nRespectfully, so-and-so petitions the Heavenly Officials, submitting one written memorial, beseeching relief from so-and-so’s thousand transgressions and myriad faults—or regarding such-and-such matter. May grievances be reconciled, disasters dispersed, calamities averted, and misfortunes eradicated, all resolved without hindrance. May the afflictions and adversities besetting so-and-so’s household be wholly pardoned and remitted, illnesses cured, and a hundred blessings adorned. May all endeavors be propitious and upright, attaining supreme auspiciousness. May the Compassionate True Ones descend to shelter so-and-so’s household, that all within may receive grace.\n\nSo-and-so now reports above to the Boundless Dao’s Primordial Most High Jade Thearch, the Supreme and Most Upright Great Sage Heavenly Worthy, the Jade Emperor of the Golden Watchtower; the Nine Elders of the Immortals’ Capital and the Nine Qi Master; the Upper Numinous Immortals’ Capital’s True Officials; the Merit Officers of the Examination and Summoning Bureau; the Highest Dharma Kings and Supreme Eight Primordial Heavenly Masters. May they command the myriad officials of the Ten Directions’ all heavens, the Eight Extremes, the Five Directions, the Three Origins, the Four Beginnings, the Jiazi cycles, the seventy-two officials, the Red Yang Bing Ding thirty-six officials, and all numinous officials of heaven, earth, mountains, rivers, the Huai, the Ji, the nine rivers, the eight seas—to examine and summon the local Earth Gods and True Officials, the Qi-Recording Community and Hamlet Lords. May each obey the edict and talismanic command, transmitting so-and-so’s memorial in accordance with the matter at hand, ensuring its swift ascent without delay or obstruction of the official document.\n\nMay the gods of heaven and earth mutually guard and protect. Should any of the Six Heavens’ subordinate officials, corrupt qi, or unrighteous spirits obstruct the Dao and intercept the memorial, preventing its ascent, the Heavenly Officials’ soldiers shall, in accordance with the Three Heavens’ Mysterious Capital’s Orthodox Statutes, seize and deliver them to the Heavenly One’s Northern Great Yin Prison. The memorial shall ascend directly to the Imperial Presence of the Boundless Dao’s Most True Jade Thearch.\n\nUpon completion, bow twice, then present the memorial. When the memorial concludes, solemnly recite the merit-conferring invocation.\n\nNext, recite the merit-conferring invocation:\n\nThe first *jia* stirs the host of perfected beings within the body—Merit Officers, Celestial Officials, Generals, Scribes, Soldiers, Capital Envoys, Flying Celestial White Tigers, Memorial-Conveying Immortal Dragon Riders, and all the Heavenly Officials who emerged at the first *jia*—on behalf of so-and-so, for such-and-such matter, have transmitted this memorial and revealed its memorial tablet to completion.\n\nMay so-and-so’s household, by virtue of this merit, open the path to deliver the Nine Mysteries and Seven Ancestors, extricating them from the Five Paths, absolving the Ten Sufferings, Eight Calamities, and Three Wretched Realms of their karmic transgressions. May the living and the dead alike receive salvation and ascension, ascending to heaven to receive blessings, their robes and provisions naturally flowing from the Southern Palace.\n\nMay all illnesses afflicting so-and-so’s household, great and small, be cured, or [address] such-and-such matter. May dreams and illusions be dispelled, and truth be firmly established.\n\nMay all malevolent spirits, demonic entities, and spectral apparitions—whether the baleful *qi* of the Five Directions, pestilential toxins, cloud-chasing hunters, *wangliang* specters, or any roving bands of inauspicious ghosts—be utterly extinguished from this day forth. May ten thousand misfortunes never arise, and may a hundred blessings adorn and perfect, ensuring eternal supreme fortune.\n\nMay all that the first *jia* transforms be transformed, all it governs be healed, and all it subdues be subdued, all jointly guarded and protected.\n\nMay the host of perfected Celestial Officials under the first *jia*’s command return, soaring through the void, to their palaces of golden citadels and jade precincts, resuming their stations to pacify heaven and assist earth. May the twelve thousand layers of Celestial Officials and Orthodox Perfected Ones within the first *jia*’s body, each departing from the vermilion gates of wondrous palaces, return to their posts.\n\nThe first *jia* has presented this memorial before the Imperial Presence of the Boundless Dao’s Most True Jade Thearch.\n\nUpon completion, bow twice. Next, tend to the incense burner.\n\nThe Left and Right Fragrant Officers, Flying Immortal Courier Dragon Riders, Incense-Bearing Envoys, and Flying Celestial Dragon Riders shall ensure that above the sacred altar and within the tranquil chamber, gold radiance and precious luminosity naturally arise, intermingling with jade’s resplendence and the essence of golden liquid.\n\nMay so-and-so’s household enjoy blessings and ease, the world receive grace, and the jade lads and jade maidens of the Ten Directions attend the fragrant smoke, conveying the first *jia*’s memorial directly to the Imperial Presence of the Boundless Dao’s Most True Jade Thearch.\n\nUpon completion, depart.\n\nThe *Jinming* states: The Seven Perfected received the Supreme Mysterious Register, and from the Golden Mouth’s decrees, this ritual was established as a ready-made liturgical model. Together with the transmission protocols and ordinances, they form this single scroll.\n\nThe Mysterious Register’s movement perpetually aligns with the Seven Perfected’s natural course, aiding the Thirty-Six Perfected August Ones in their orthodox governance, presiding over the Worthy Kalpa, as it is now.\n\nIf the celestial beings of the Ten Directions remain unaware of the myriad Dao’s culmination, let them observe the abolition of false ordinances—then the Three Caverns shall shine forth, the true scriptures shall illuminate with clarity, resplendent and pure, their brilliance as radiant as the sun’s light, like a dharma-mirror.\n\nThe Orthodox Dao is in motion; the Dharma Vehicle is at work. Thus, the Cavern Scriptures flourish, the Dharma teachings thrive, and the ten thousand demons are subdued.\n\nAt that time, heaven shall no longer accept sacrifices, spirits shall no longer receive offerings, ghosts shall no longer partake of food, malevolent entities shall hide, licentious harm shall vanish, the Six Heavens shall be rectified, and heterodox paths shall submit.\n\nAt that time, it shall truly be a cause for celebration—how could the celestial beings of the Ten Directions not rejoice?\n\nNow, this later section is roughly outlined to serve as proof. Transmit this to future worthies, and do not divide this scroll by extracting portions to form separate volumes.\n\nThose who violate this shall incur punishment by the Wind Blade—beware!\n\nIf transmission is desired, simply follow this text, and it shall not deviate from the lineage. Take heed and guard against transgression.\n\nThe True Decree of the Jade Thearch must not be defied; the Seven Perfected’s scriptural embodiment truly dares not betray the sagely teachings.\n\nThe Supreme Perfected of the Great Mystery, the Orthodox Mystery, the Primordial Mystery, and the Boundless Mystery; the True Illuminator Celestial Lord; the Supreme Celestial Lord; the Most High Lord of the Great Dao; the Lord of the Myriad Layers of True Mystery and Primordial *Qi*; the Most High Lord Lao; the Most High Elder; the Nine Elders of the Immortal Capital; and the Lords of the Hundred Thousand Layers of Dao *Qi* and Perfected Celestials—before the True Heavenly Court.\n\nSixty-one characters.\n\nThe Supreme Perfected of the Great Clarity, the Primordial Mystery, and the Boundless Mystery; the True Illuminator and Great Assembly Celestial Worthies; the Supreme Golden Clarity Celestial Worthy; the Supreme Lord of the Myriad Layers of Immortal Mystery and Primordial *Qi* of the Boundless Great Dao; the Lord of the Three Origins and the Hundred Thousand Layers of Dao *Qi*; and the Nine Elders, True Immortals, and Elders beneath the Golden Clarity Gate.\n\nSixty-one characters.\n\nThese two passages are not to be removed from this scroll. As their reading remains incomplete, they are provisionally placed here.\n\nThe Great Register is employed afterward, the Lesser Register is employed beforehand.\n\nHere concludes the *Primordial Registers of the Three Hundred and Sixty-Five Divisions of the True Numinous Ones of the Nine Heavens of the Upper Origin*—the Supreme Jade Emperor of the Golden Perfection of Highest Clarity.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清金真玉皇上元九天真灵三百六十五部元箓 经名：上清金真玉皇上元九天真灵三百六十五部元箓。 简称《上元九天真灵玄箓》。 撰人不详，约出於南北期末或睛唐之际。 假托大上玉晨君授金明七真。 一卷。 底本出处：《正统道藏》正一部。 上清金真玉皇上元九天真灵三百六十五部元箓 金明曰：七真先以癸亥岁五月五日午时，受太上玉晨君上元灵录，於今九载。 七真宝录以摄神气，未尝亏诞神文也。 七真重以今太清五年太岁辛未五月一日午时，高上天宝玉皇降真於带岭琼宫之中，重为七真品定上元九天真灵玄录，官将位号於是正焉。 金明曰：是时高上天宝玉皇金口诀言，告於七真，言此上元九天真灵三百六十五部将军玄录天官者，皆非后学而为之也。 其真即上元飞凝清真生灵妙气，而应自然明运，成为真人矣。 服即自然五色飞天羽衣，形皆金刚，身长三千余丈。 其所部官将者、齐服自然三色飞青羽仙之衣，常镇九天上元，以辅三十六真皇治也。 所以法应天地四象，玉关难玑三百六十五正度之数也。 亦法镇九晨三光七曜星宿，九宫八卦三百六十五度正位也。 亦法天地四时三百六十五气之始也。 中以法镇天人形斡，三百六十五关节脏腑之数也。 上即主运天地正气； 中即扶命天帝皇基、国君明祚，明三元御运，明化於贤劫也； 下拯三界於群生，开真法门於大光，度天人於福桥，济八难於苦海，拔三涂於六道，救疾世於玄录，防天灾於灵官，度九息於神功，卫兆身於天兵，保福祚於历劫，禳十恶於天堂，拥毒鬼於神将，制众魔於天真，却众祸於灵吏，伏众精於天威，戳群妖於神力，灭水火於神智，消秽气於碧水，扫嚣尘於金风，保兆形於妙气，治百病於天医，镇兆关节於真精也。 是以其功无所不周，无所不匝，法象天地人之度量也。 常随明运下教，度人於季劫矣。 保无为於将来也。 其法当兴於灵龙之世也。 尔时国君行道修德，是其运也。 帝祚太平，是其功也。 天人命不夭伤，是其福也。 高上有言，当斯之隆，即是万道势讫，玄范是兴，大乘运行，则保兆天年，得以三元等矣。 可谓自然之功、开度亦复不与为难者哉。 今故序此篇，即以明之功乎。 后贤至人信尚之士，可不奉而行焉。 上元真灵玄录 系清玄无极真上元始天尊，长明金真玉童治，左清真玄气九万九千九百九十九重流明玉天真人、右积阳真精元气八万八千八百八十八重金光宝耀真人、中玄生灵清妙无央真气百千万重玉玄金元真人、都领上景清虚生神妙气九亿九万九千九百九十九重气三十六洞天至真空玄丈人，金明七真子今领高上天宝玉皇三十六治，都监十方飞天神王，总司九天三元太极上下，周回四象，下布万灵，普告无穷诸天灵官，七真奉行正道，上元九天真灵百八十三部玄录，将军兵士将吏等，列位付授，当依法度某身中，安镇形干上中下三百六十五宫府，营卫某身游行，五方八极、五岳名山大泽、三河四海江淮济渍、乡亭九州符庙里社、虚空一切神祇，咸当奉承律令，助国扶命，制御群神，医治万兆，救度天人。 某自受录之日，不得违科犯约，淫祀六天鬼神，无辜杀害，唯得依太真正典，祠家先人。 若有犯淫盗不，背真入伪，为将军兵士将吏所伺札过之日，某及七祖长充风刀，万劫无原，一如真明勅令。",
      "translated_text": "**The Supreme Clarity Golden Perfection Jade Sovereign’s Upper Prime Nine Heavens True Numinous Register of the Three Hundred Sixty-Five Departments**\n\n**Scripture Title:** *The Supreme Clarity Golden Perfection Jade Sovereign’s Upper Prime Nine Heavens True Numinous Register of the Three Hundred Sixty-Five Departments* (abbreviated as *The Upper Prime Nine Heavens True Numinous Mysterious Register*).\n\nAuthor unknown, approximately composed between the late Northern and Southern Dynasties or the early Tang. Falsely attributed to the Supreme Venerable Jade Dawn Lord bestowing it upon the Seven Perfected of Golden Radiance.\n\nOne scroll. Source text: *Daoist Canon of the Zhengtong Era*, Orthodox Section, Part One.\n\n---\n\n**The Supreme Clarity Golden Perfection Jade Sovereign’s Upper Prime Nine Heavens True Numinous Register of the Three Hundred Sixty-Five Departments**\n\nGolden Radiance said: In the *guihai* year, on the fifth day of the fifth month at noon, the Seven Perfected first received the *Upper Prime Numinous Register* from the Supreme Venerable Jade Dawn Lord. For nine years now, the Seven Perfected have treasured this register to gather spirit and qi, never once neglecting its divine writ.\n\nNow, in the fifth year of the Great Clarity (*taiqing*), the year *xinwei*, on the first day of the fifth month at noon, the Most High Heavenly Treasure Jade Sovereign descended in truth within the Jeweled Palace of Belt Ridge, once more ranking and ordaining the *Upper Prime Nine Heavens True Numinous Mysterious Register* for the Seven Perfected, rectifying the titles and positions of its officials and generals.\n\nGolden Radiance said: At that time, the Most High Heavenly Treasure Jade Sovereign spoke from his golden mouth, addressing the Seven Perfected: \"This *Upper Prime Nine Heavens True Numinous Register of the Three Hundred Sixty-Five Departments of Generals and Heavenly Officials* was not composed by later scholars. These true beings are the Upper Prime’s soaring, congealed, pure, and numinous life-breath, responding naturally to the luminous course of destiny to become perfected persons. When they don their robes, they naturally wear five-colored flying celestial feathered garments; their forms are adamantine, their bodies over three thousand *zhang* in height. The officials and generals under their command all wear the naturally arising three-colored flying azure feathered immortal robes, ever guarding the Upper Prime of the Nine Heavens to assist the thirty-six True Sovereigns in their governance.\n\nThus, their method accords with the four images of Heaven and Earth and the three hundred sixty-five degrees of the Jade Pass and the Celestial Pivot. It also mirrors the governance of the Nine Dawns, the Three Luminaries, the Seven Luminants, and the stellar lodges, as well as the nine palaces, eight trigrams, and three hundred sixty-five degrees of the correct positions. It further accords with the inception of the three hundred sixty-five qi of Heaven, Earth, and the four seasons. At the center, it governs the revolutions of the human form, the three hundred sixty-five joints, and the viscera.\n\nAbove, it presides over the circulation of the correct qi of Heaven and Earth; in the middle, it sustains the mandate of the Heavenly Thearch and the imperial foundation, the enlightened prosperity of rulers, the illumination of the Three Primes and the imperial course, and the transformation of the worthy kalpa. Below, it rescues the three realms from the multitudes of beings, opens the gate of true Dharma in great radiance, ferries celestial and human beings across the Bridge of Blessings, delivers the eight difficulties from the Sea of Suffering, extricates the three paths from the six destinies, saves the degenerate world through the *Mysterious Register*, wards off heavenly disasters through the numinous officials, delivers the nine breaths through divine merit, protects the myriad bodies with heavenly soldiers, preserves blessings and prosperity through kalpas, dispels the ten evils in the heavenly halls, restrains poisonous ghosts with divine generals, subdues all demons with the heavenly perfected, repels all misfortunes with the numinous clerks, overpowers all spirits with heavenly might, slays all demons with divine power, extinguishes water and fire with numinous wisdom, dissolves foul qi with azure waters, sweeps away clamorous dust with the golden wind, preserves the myriad forms with wondrous qi, cures the hundred diseases with the heavenly physicians, and stabilizes the myriad joints with true essence.\n\nThus, its merits are all-encompassing, its reach boundless, its method a reflection of the measures of Heaven, Earth, and humanity. It constantly follows the luminous course to descend teachings and deliver beings in the kalpa of decline. It safeguards the realm of non-action for the future. Its Dharma shall flourish in the era of the numinous dragon. When rulers practice the Dao and cultivate virtue, it is their destiny. When the imperial reign is at peace, it is their merit. When the lives of celestial and human beings are not cut short, it is their blessing.\"\n\nThe Most High declared: \"At this pinnacle, when the myriad Daoist arts have reached their end, the mysterious model arises, the Great Vehicle circulates, and the celestial years of the myriad beings are preserved, they shall attain equality with the Three Primes. Can this not be called the work of spontaneity, where deliverance is effortless?\"\n\nNow, therefore, this preface is composed to clarify its merits. May later worthies, perfected persons, and those who revere and uphold this teaching not fail to practice it accordingly.\n\n---\n\n**The Upper Prime True Numinous Mysterious Register**\n\nBelonging to the Primordial Heavenly Worthy of the Upper Prime of the Pure and Boundless True, governed by the Ever-Bright Golden Perfection Jade Lads. To the left: the True Person of the Nine Myriad, Nine Thousand, Nine Hundred Ninety-Nine Layers of Flowing Radiance of the Jade Heaven of the Pure True Primordial Qi; to the right: the True Person of the Eight Myriad, Eight Thousand, Eight Hundred Eighty-Eight Layers of Golden Light and Jeweled Brilliance of the Accumulated Yang True Essence Primordial Qi; at the center: the True Person of the Hundred Million Myriad Layers of the Jade Mystery Golden Primordial True Qi of the Boundless Pure and Wondrous Life-Breath of the Mysterious Origin. Together, they lead the Nine Hundred Ninety-Nine Myriad, Nine Thousand, Nine Hundred Ninety-Nine Layers of Qi of the Thirty-Six Grotto-Heavens’ Most True Empty Mystery Venerable Ones. The Seven Perfected of Golden Radiance now lead the Most High Heavenly Treasure Jade Sovereign’s thirty-six governances, overseeing the Flying Celestial Divine Kings of the Ten Directions, collectively administering the Three Primes of the Nine Heavens and the Supreme Ultimate above and below, revolving through the Four Images, and extending to the myriad numina.\n\nUniversally proclaimed to the boundless numinous officials of all heavens: the Seven Perfected, upholding the correct Dao, now bestow the *Upper Prime Nine Heavens True Numinous Register of the One Hundred Eighty-Three Departments*, along with the ranks and appointments of its generals, soldiers, officers, and clerks. They shall, in accordance with the Dharma, be installed and stabilized within the three hundred sixty-five palaces of the upper, middle, and lower regions of one’s body, safeguarding one’s form as they traverse the Five Directions and Eight Extremes, the Five Marchmounts, famous mountains and great marshes, the Three Rivers and Four Seas, the Yangtze, Huai, Ji, and Zi, the villages, townships, nine provinces, talismanic temples, and village altars, as well as all the deities of empty space. All shall obey the statutes and commands, assisting the nation and sustaining the mandate, controlling and guiding the multitude of spirits, healing the myriad beings, and delivering celestial and human beings.\n\nFrom the day one receives this register, one must not violate the precepts or breach the covenant, nor engage in licentious sacrifices to the Six Heavens’ ghostly spirits or commit wanton killing. One may only worship one’s ancestors in accordance with the orthodox canon of the Great Perfected. Should one commit licentiousness, theft, or other transgressions, turning from the true to the false, the generals, soldiers, officers, and clerks shall record one’s offenses. One and one’s seven generations of ancestors shall be consigned to the Wind Blade for ten thousand kalpas without reprieve, in strict accordance with the true and luminous imperial decree.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1256,
      "start_sentence": 0,
      "end_sentence": 36,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.19005727767944,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清金真玉皇上元九天真灵三百六十五部元录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "太无上元九天真灵元命十将军，官将兵士各十万人。 太无上元九天真灵度命十将军，官将飞仙龙骑兵士各十万人。 太无上元九天真灵防身十将军，官将兵士各十万人。 太无上元九天真灵度息十将军，官将飞仙龙骑兵士各十万人。 太无上元九天真灵营身十将军，官将兵士各十万人。 太无上元九天真灵左生气十将军，官将飞虎骑兵士各十万人。 太无上元九天真灵卫身十将军，官将兵士各十万人。 太无上元九天真灵右生气十将军，官将诛符破庙兵士各十万人。 太无上元九天真灵藏形十将军，官将兵士各十万人。 太无上元九天真灵中玄生气十将军，官将摄召龙天兵士各十万人。 太无上元九天真灵隐形十将军，官将兵士各十万人。 太无上元九天真灵消灾考召十将军，官将兵士各十万人。 太无上元九天真灵治病功曹十将军，官将兵士各十万人。 太无上元九天真灵制神考召十将军，力士各十万人。 太无上元九天真灵天医功曹十将军，官将兵士各十万人。 太无上元九天真灵考杀百鬼十将军，力士各十万人。 太无上元九天真灵扶命形景十将军，官将兵士各十万人。 太无上元九天真灵飞天白虎送章飞龙骑十将军，官将兵士各十万人。 年号太岁某月某日子朔，某郡县乡里王甲，年如干岁，今奉受上元九天真灵百八十三部玄录，将军兵士真官将吏等，即列位付度某身。 将军兵士众官，各当依位罗列某形内宫府，周匝上下，营身辅气，魂魄形影一合前防后卫，左右制摄，威风万里，千妖万魔精灵鬼魅不正之神，莫不摧崩毒刃，咸来降化承真正道。 若有疆徉不伏凶神逆鬼，悉付将军兵士扫荡，自今以去，行元布始，犹守某身。 急急如上元九天真明律令。 卷内符并朱书。 金明七真子，奉行上元九天上灵百八十二部玄录，将军兵士天官将吏等，合太无上元九天真灵百八十三部玄录，都合三百六十五部，即以法象天地，九晨三光七曜星宿，四时五行九官六甲八卦，关玑正度游天三元之数，镇常於人之身。 某今至心玄真，归命三尊，即理在可哀。 七真子即日依科传授上灵玄录，将军兵士天官将吏，咸当依法镇守某形，上下游行五方八极、五岳名山大泽、三河四海江淮济渎、九州四域土地符庙、里社乡亭灵祇神爽，皆当奉承符命，制御十方，共相营卫某身，在在处处，咸遵奉行。 若有凶神恶鬼，欲来中害者，将军兵士依法刑戮，不得稽留。 某若违科犯约，淫盗祷祀六天鬼神，为天官所伺检纠，死受三官考掠之日，不得怨师咎道。 一如九天真明律令。 太玄上元九天上灵元命十将军，兵士各十万人。 无上上元九天上灵飞腾天丁力士十将军，兵士各十万人。 太玄上元九天上灵开度生神十将军，兵士各十万人。 无上上元九天上灵飞腾诛符破庙金刚力士十将军，兵士各十万人。 太玄上元九天上灵开度生灵十将军，兵士各十万人。 无上上元九天上灵飞腾收魔伐杀力士十将军，兵士各十万人。 太玄上元九天上灵开度生气十将军，兵士各十万人。 无上上元九天上灵飞腾收神食鬼力士十将军，兵士各十万人。 太玄上元九天上灵周身耀电十将军，兵士各十万人。 无上上元九天上灵飞腾收精食毒力士十将军，兵士各十万人。 太玄上元九天上灵明威镇身十将军，兵士各十万人。",
      "translated_text": "The Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Original-Life Ten Generals, with their officers, generals, and soldiers, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Life-Delivering Ten Generals, with their officers, generals, flying immortals, and dragon-mounted cavalry, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Body-Guarding Ten Generals, with their officers, generals, and soldiers, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Breath-Delivering Ten Generals, with their officers, generals, flying immortals, and dragon-mounted cavalry, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Body-Nurturing Ten Generals, with their officers, generals, and soldiers, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Left Life-Qi Ten Generals, with their officers, generals, and flying tiger cavalry, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Body-Protecting Ten Generals, with their officers, generals, and soldiers, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Right Life-Qi Ten Generals, with their officers, generals, talisman-executing and temple-destroying soldiers, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Concealing-Form Ten Generals, with their officers, generals, and soldiers, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Central Mysterious Life-Qi Ten Generals, with their officers, generals, and dragon-and-heaven-summoning soldiers, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Concealing-Form Ten Generals, with their officers, generals, and soldiers, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Disaster-Dispelling and Summoning Ten Generals, with their officers, generals, and soldiers, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Disease-Healing Merit-Officials Ten Generals, with their officers, generals, and soldiers, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Spirit-Controlling and Summoning Ten Generals, with their warriors, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Celestial Physician Merit-Officials Ten Generals, with their officers, generals, and soldiers, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Hundred-Ghosts-Subduing Ten Generals, with their warriors, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Life-Supporting and Form-Guarding Ten Generals, with their officers, generals, and soldiers, each numbering one hundred thousand.\n\nThe Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous Flying Celestial White Tiger Document-Delivering and Flying Dragon Cavalry Ten Generals, with their officers, generals, and soldiers, each numbering one hundred thousand.\n\nIn the reign year, the [such-and-such] month, the [such-and-such] day of the first lunar day, Wang of [such-and-such] commandery, county, village, and hamlet, aged [such-and-such] years, now receives the Supreme Primordial Nine Heavens’ True Numinous One Hundred Eighty-Three Registers of the Mysterious. The generals, soldiers, true officials, and officers are hereby arrayed and bestowed upon his person.\n\nThe generals, soldiers, and various officials shall, according to their positions, array themselves within the palaces of his body, encircling him above and below, nurturing his form and assisting his qi. His hun-soul and po-soul, his form and shadow, shall unite as one—guarding before and protecting behind, controlling and restraining left and right. With awe-inspiring might spanning ten thousand miles, the myriad demons, evil spirits, spectral beings, and unorthodox gods shall all be crushed and destroyed by poisoned blades, coming to submit and transform, upholding the true and orthodox Dao.\n\nShould there be any stubborn and disobedient malevolent spirits or rebellious ghosts, they shall all be delivered to the generals and soldiers for sweeping eradication. From this day forward, they shall abide by the primordial and spread the beginning, ever guarding his person.\n\nHasten, hasten, in accordance with the true and luminous statutes of the Supreme Primordial Nine Heavens.\n\nThe talismans within the scroll are all inscribed in vermilion.\n\nThe Seven Perfected of Golden Clarity, upholding the Supreme Primordial Nine Heavens’ Upper Numinous One Hundred Eighty-Two Registers of the Mysterious, the generals, soldiers, celestial officials, and officers, together with the Supreme Non-Ultimate Primordial Nine Heavens’ True Numinous One Hundred Eighty-Three Registers of the Mysterious, total three hundred sixty-five registers. This corresponds to the law and image of Heaven and Earth, the Nine Auroras, Three Luminaries, Seven Luminants, and stellar constellations, the Four Seasons, Five Phases, Nine Palaces, Six Jia, and Eight Trigrams, the pivot of the celestial sphere and the correct measure of the wandering Three Primordials, eternally securing them within the human body.\n\nNow, with utmost sincerity and profound truth, I take refuge in the Three Honored Ones, for the principle lies in what may be pitied.\n\nThe Seven Perfected, on this day, transmit the Upper Numinous Mysterious Registers in accordance with the statutes. The generals, soldiers, celestial officials, and officers shall all, in accordance with the law, guard his form, roaming above and below through the Five Directions and Eight Extremities, the Five Marchmounts, famous mountains and great marshes, the Three Rivers, Four Seas, Jiang, Huai, Ji, and Du, the land altars and village shrines of the Nine Provinces and Four Domains, and all the numinous spirits and divine souls. They shall all uphold the talismanic mandate, control and guide the ten directions, and jointly defend his person. In every place, they shall all comply and act accordingly.\n\nShould any malevolent spirits or evil ghosts seek to harm him, the generals and soldiers shall, in accordance with the law, execute and slaughter them without delay.\n\nShould he violate the statutes or breach the covenant, engaging in licentiousness, theft, or sacrifices to the ghostly spirits of the Six Heavens, and be observed and investigated by the celestial officials, on the day he dies and undergoes the Three Offices’ interrogation and torture, he shall not blame his master or fault the Dao.\n\nAll in accordance with the true and luminous statutes of the Nine Heavens.\n\nThe Supreme Mysterious Supreme Primordial Nine Heavens’ Upper Numinous Original-Life Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Non-Ultimate Supreme Primordial Nine Heavens’ Upper Numinous Flying Celestial Ding Warriors Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Supreme Mysterious Supreme Primordial Nine Heavens’ Upper Numinous Life-Delivering and Spirit-Opening Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Non-Ultimate Supreme Primordial Nine Heavens’ Upper Numinous Flying Celestial Talisman-Executing, Temple-Destroying Vajra Warriors Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Supreme Mysterious Supreme Primordial Nine Heavens’ Upper Numinous Life-Delivering and Numinous-Opening Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Non-Ultimate Supreme Primordial Nine Heavens’ Upper Numinous Flying Celestial Demon-Subduing and Demon-Slaying Warriors Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Supreme Mysterious Supreme Primordial Nine Heavens’ Upper Numinous Life-Qi-Delivering and Opening Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Non-Ultimate Supreme Primordial Nine Heavens’ Upper Numinous Flying Celestial Spirit-Seizing and Ghost-Consuming Warriors Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Supreme Mysterious Supreme Primordial Nine Heavens’ Upper Numinous Body-Encircling Lightning Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Non-Ultimate Supreme Primordial Nine Heavens’ Upper Numinous Flying Celestial Essence-Seizing and Poison-Consuming Warriors Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Supreme Mysterious Supreme Primordial Nine Heavens’ Upper Numinous Illustrious Might Body-Guarding Ten Generals, with their soldiers, each numbering one hundred thousand.",
      "overlap_context": "y spirits or commit wanton killing. One may only worship one’s ancestors in accordance with the orthodox canon of the Great Perfected. Should one commit licentiousness, theft, or other transgressions, turning from the true to the false, the generals, soldiers, officers, and clerks shall record one’s offenses. One and one’s seven generations of ancestors shall be consigned to the Wind Blade for ten thousand kalpas without reprieve, in strict accordance with the true and luminous imperial decree.\"",
      "start_char": 1257,
      "end_char": 2568,
      "start_sentence": 37,
      "end_sentence": 76,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.85478591918945,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清金真玉皇上元九天真灵三百六十五部元录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "无上上元九天上灵飞天考召力士十将军，兵士各十万人。 太玄上元九天上灵阳神正气十将军，兵士各十万人。 无上上元九天上灵飞天郎吏飞符摄召力士十将军，兵士各十万人。 太玄上元九天上灵阴神正气十将军，兵士各十万人。 无上上元九天上灵飞天赤飘金军羽郎使者十将军，兵士各十万人。 太玄上元九天上灵保神护身十将军，兵士各十万人。 无上上元九天上灵飞天白虎送章仙龙十将军，兵士各十万人。 男女生弟子某，至心归命玄真，求受上元九天真灵三百六十五部玄录，七真子即依法列位将军兵士天官将吏，以次付度某玄录，并以飞玄三元延生灵符镇於玄录，以部制天官神兵，今以普告天地，五方八极九晨三光七耀诸天星宿、四时五行九宫六甲八卦、三官九府三界一切官属，皆当奉勅符命，共相营卫某身，保度三灾九厄，五毒八难，风刀水火五兵疾害，得免众苦凶祸，年命得与三元同等。 千妖万魔咸归降化，百恶消亡。 所愿同期天官神兵，长守某形三百六十五关阙宫府，历劫妙气长存。 一如九天真明律令。 右上元三百六十五真灵玄录，男女生同得受也，更无别异耳。 某郡县乡里男女童子，年如干岁，即日贯玄卫身一将军玄录，奉行清真玄气。 急急如勅律令。 无上九天玉仙大将军一人，官将吏兵十万众。 金明七真子，今以童子一将军玄录，度某男女童子玄录。 自今以去，某佩带玄录神符，天官吏兵咸共营卫，镇守某身，防灾辟恶，收妖斩邪，五方八极凶神逆鬼、天殃地祇、空中游猎众精魍魉、一切灵爽云消。 诸天善神土地真官，皆当奉承符命，长相卫护。 若有疆□鬼神欲中害之者，将军吏兵收斩，不得稽留。 急急如九天真明律令。 某年号月朔日子时奉行。 右男女童子录文。 度治录吏兵仪 次登坛东向再拜，次三捻香， 次呜法鼓二十四通，次发炉。",
      "translated_text": "The Non-Ultimate Supreme Primordial Nine Heavens’ Upper Numinous Flying Celestial Examination and Summoning Warriors Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Supreme Mysterious Supreme Primordial Nine Heavens’ Upper Numinous Yang Spirit Upright Qi Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Non-Ultimate Supreme Primordial Nine Heavens’ Upper Numinous Flying Celestial Officials and Scribes Flying Talisman Seizing and Summoning Warriors Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Supreme Mysterious Supreme Primordial Nine Heavens’ Upper Numinous Yin Spirit Upright Qi Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Non-Ultimate Supreme Primordial Nine Heavens’ Upper Numinous Flying Celestial Crimson Whirlwind Golden Army Feathered Messengers Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Supreme Mysterious Supreme Primordial Nine Heavens’ Upper Numinous Spirit-Protecting and Body-Guarding Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Non-Ultimate Supreme Primordial Nine Heavens’ Upper Numinous Flying Celestial White Tiger Memorial-Conveying Dragon Immortals Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nMale and female disciples of the living, [Name], wholeheartedly devote themselves to the Mysterious True, seeking to receive the Upper Primordial Nine Heavens’ True Numinous Three Hundred Sixty-Five Registers of the Mysterious. The Seven Perfected Ones shall, in accordance with the method, array the generals, soldiers, celestial officials, and scribes in their proper ranks, and in due order transmit the Mysterious Registers to [Name], while also sealing them with the Flying Mysterious Three Primordials’ Life-Prolonging Numinous Talismans. These shall command the celestial officials and divine soldiers, and now a universal proclamation is made to Heaven and Earth, the Five Directions and Eight Extremes, the Nine Dawns and Three Luminaries, the Seven Radiant Ones, all celestial star lodges, the Four Seasons and Five Phases, the Nine Palaces and Six Jia, the Eight Trigrams, the Three Offices and Nine Bureaus, and all officials of the Three Realms: all shall heed the edict and talismanic command, jointly safeguarding [Name]’s person, protecting them from the Three Disasters and Nine Calamities, the Five Poisons and Eight Difficulties, the perils of wind, blade, water, fire, and the Five Weapons, and all manner of suffering and misfortune. May [Name]’s years and life attain equality with the Three Primordials. May a thousand demons and ten thousand devils all submit and be transformed, and may a hundred evils be extinguished. May the celestial officials and divine soldiers, as vowed, eternally guard [Name]’s three hundred sixty-five passes, palaces, and bureaus, so that their wondrous qi endures through the kalpas. All is done in accordance with the True and Luminous Statutes and Ordinances of the Nine Heavens.\n\nThe Upper Primordial Three Hundred Sixty-Five True Numinous Mysterious Registers may be received equally by both male and female disciples, with no distinction between them.\n\nMale and female children of [such-and-such] commandery, county, village, and hamlet, aged [such-and-such] years, shall this day be invested with the Mysterious Register of One General for the Protection of the Body through the Dao. They shall uphold and practice the pure and mysterious qi.\n\nHasten! As the statutes and ordinances command.\n\nOne Non-Ultimate Nine Heavens Jade Immortal Great General, with one hundred thousand officials, generals, scribes, and soldiers.\n\nThe Seven Perfected of Golden Luminosity now transmit the Mysterious Register of One General to the male or female child [Name]. From this day forward, as [Name] bears the Mysterious Register and divine talismans, the celestial officials, scribes, and soldiers shall all jointly safeguard them, guarding their person, averting disasters, repelling evil, capturing demons, and beheading malevolent spirits. May the baleful gods and rebellious ghosts of the Five Directions and Eight Extremes, the celestial afflictions and earthly deities, the wandering and hunting spirits in the void, the myriad specters and all numinous essences dissolve like clouds. May all the good gods of the heavens and the true officials of the earth heed the talismanic command and eternally protect them. Should any fierce or obstructive ghosts or gods seek to harm them, the generals, officials, and soldiers shall capture and behead them without delay.\n\nHasten! As the True and Luminous Statutes and Ordinances of the Nine Heavens command.\n\nOn the [such-and-such] day of the [such-and-such] month of the [such-and-such] year, at the hour of *zi*, the ritual is performed.\n\nThe text of the register for male and female children.\n\nRitual for the Transmission of the Register and the Investiture of Officials and Soldiers\n\nNext, ascend the altar, face east, and bow twice. Next, offer incense three times. Next, strike the ritual drum twenty-four times. Next, kindle the incense burner.",
      "overlap_context": "e Heavens’ Upper Numinous Body-Encircling Lightning Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Non-Ultimate Supreme Primordial Nine Heavens’ Upper Numinous Flying Celestial Essence-Seizing and Poison-Consuming Warriors Ten Generals, with their soldiers, each numbering one hundred thousand.\n\nThe Supreme Mysterious Supreme Primordial Nine Heavens’ Upper Numinous Illustrious Might Body-Guarding Ten Generals, with their soldiers, each numbering one hundred thousand.",
      "start_char": 2569,
      "end_char": 3308,
      "start_sentence": 77,
      "end_sentence": 101,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.70427441596985,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清金真玉皇上元九天真灵三百六十五部元录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "清玄无极真上三天玄元始炁无极大道太上老君、左右香官、飞仙驿龙乘骑捧香使者、飞天龙骑五帝侍香玉童玉女等，各二十四人出。 上启虚无自然元始天尊，七真正尔烧香奉表，付度法事。 愿得太上十方正真生炁，降七真等身中，所启径上无极大道至真玉皇御前。 毕，即再拜，长跪香案前，出官奉表付度。 谨出金明七真身中五体真官功曹使者，各二人出。 上元九天功曹官，各二人出。 上元九天升玄功曹官，各二人出。 上元九天正一功曹官，各二人出。 上元九天左玄真明功曹官，各二人出。 上元九天右玄太真功曹官，各二人出。 上元九天阳神正一功曹官，各二人出。 上元九天阴神正一功曹官，各二人出。 上元九天仙都治病功曹官，各二人出。 无上上元九天上灵飞天白虎送章仙龙骑吏官，各二人出。 谨出七真身中真官使者、仙都直真符吏、领仙郡官使者，各千二百人出。 严庄整服，冠带垂缨，各整天真羽仪，罗列四面八方，营卫左右前后，流明曜电，扫除不祥，玄鉴玄奏，付度法事。 今有某郡县乡里男女生等如干人，投辞玄真，至心归命三尊，求受上元九天真灵三百六十五部玄录，即日书写条例天官位号，依科玄录，若上刺当言以时刺，若付度即言以某时付度，即以某时拜请三元九天官付度。 今重表上启无极大道元始太上玉皇、无上至真大圣天尊金阙玉帝陛下、仙都真官考召行状都官使者，伏愿真慈下降，玄察监度某等上元九天真灵玄录，皆当依位列度某等身中，安宫镇府，周匝营卫，左转九千万重，右转九千万重，防某等身，护某等命，光明映曜，威风万里。 将军兵士天官将吏，与某同形，神洞内外。 为是所履土地真官，注气监察，考召诸官军等，共相辅佐。 当随功迁赏，不负效信，所启上御无极大道至真玉皇御前。 毕，再拜，便奏章。 章竟，即重勅言奏章功。 金明七真重勅身中众真功曹天官、将吏兵士、都官使者、飞天白虎送章仙龙骑吏等，七真向出官言奏章表事，玄所部众真各回腾虚驾，还复宫府，安镇本位，营天辅地。 回备七真身中百千万重天宫，正真各从朱门妙阙而还职位。 七真所启上御道前。 毕，即再拜回案，向北长跪，重出官，玄即付度治录也。 金明七真重动身中五真郎吏、左右功平仙伯仙公、直真符吏、仙都玉郎、正一升玄功曹、考召都官，条检仙王使者、飞天乘骑、直真飞龙骑、腾龙驿呈飞仙羽骑，各三十六人出。 严庄整服，列侍天仪，盖天弥地方位左右，依法领押监察，列付某等所受上元真灵三百六十五部将军兵士天官将吏，付度某等身中，安镇三百六十五关节宫府，周备亿千万重，勿令错误。 营备某等与众真合同，七真所启径上无极大道至真玉皇御前。 毕，即读度录，天宫付授也。 毕即勅录，次勅录符文，祝曰： 大道开真，正法堂堂，太无威风，无中发光，太无神功，功化十方，太玄真符，摄召神王，无上制御，万祸摧亡，九天扶命，六天敢当，诸天拥护，弥劫相防。 急急如太上玉皇律令。 次勅度录水文，祝曰： 太上碧水涌天河，化为神气如天罗，飞洒如剑斩天魔，五方鬼兵，当者皆消，如风如火，灭精荡妖。 急急如律令。 毕，度录，即言功，次三上香，回案东向，跪言功。",
      "translated_text": "The Pure and Mysterious, Boundless and Supreme, the True and Lofty Three Heavens, the Primordial Qi of the Boundless Dao, the Most High Lord Lao, the Left and Right Incense Officials, the Flying Immortals and Dragon-Messengers bearing incense, the Heavenly Flying Dragon-Riders and the Jade Lads and Maidens serving the Five Thearchs—twenty-four of each—emerge.\n\nThey reverently address the Primordial Heavenly Worthy of the Void and the Natural, as the Seven Perfected burn incense and present the memorial, entrusting the ritual of transmission and ordination. May the Primordial Qi of the Most High’s Ten Directions and True Perfected Ones descend into the bodies of the Seven Perfected, that their petition may ascend directly before the Imperial Presence of the Boundless Dao and the Most True Jade Emperor.\n\nThis done, they bow twice, then kneel reverently before the incense table. The officials emerge to receive the memorial and transmit the ordination.\n\nWith solemn care, the Golden Luminance Seven Perfected summon from within their bodies the True Officials and Merit Officers of the Five Agents—two of each—who emerge. The Merit Officers of the Upper Nine Heavens—two of each—emerge. The Merit Officers of the Upper Nine Heavens’ Ascending Mystery—two of each—emerge. The Merit Officers of the Upper Nine Heavens’ Orthodox Unity—two of each—emerge. The Merit Officers of the Upper Nine Heavens’ Left Mystery and True Luminance—two of each—emerge. The Merit Officers of the Upper Nine Heavens’ Right Mystery and Supreme Perfection—two of each—emerge. The Merit Officers of the Upper Nine Heavens’ Yang Spirit and Orthodox Unity—two of each—emerge. The Merit Officers of the Upper Nine Heavens’ Yin Spirit and Orthodox Unity—two of each—emerge. The Merit Officers of the Upper Nine Heavens’ Divine Capital and Healing—two of each—emerge. The Supreme Upper Nine Heavens’ Flying Heavenly White Tiger Envoys bearing the memorial, the Dragon-Riding Immortal Couriers—two of each—emerge.\n\nWith solemn care, the Seven Perfected summon from within their bodies the True Official Envoys, the Divine Capital’s Direct True Talisman Officers, and the Envoys leading the Immortal Prefectures—one thousand two hundred of each—who emerge. Robes immaculate, sashes and pendants in order, each arrays the celestial and true feathered regalia, forming ranks on all four sides and eight directions, encamping and guarding left and right, front and back. Their radiance flashes like lightning, sweeping away all inauspicious influences. With dark clarity, they present and transmit the ritual of ordination.\n\nNow, there are so many men and women of such-and-such prefecture, county, village, and hamlet who, having renounced the mundane and turned toward the Mysterious and True, wholeheartedly take refuge in the Three Worthies. They seek to receive the Three Hundred Sixty-Five Registers of the Upper Nine Heavens’ True Numinosity. Today, their celestial titles and ranks are inscribed according to the statutes of the Mysterious Registers. If the register is to be presented, it shall be declared at the proper time; if the ordination is to be transmitted, it shall be declared at such-and-such an hour. Then, at that hour, the Three Primordials and Nine Heavens’ Officials are invoked to transmit the ordination.\n\nNow, a second memorial is reverently presented to the Boundless Dao, the Primordial and Most High Jade Emperor, the Supreme and Most True Great Sage Heavenly Worthy, the Golden Portal Jade Thearch, and the Divine Capital’s True Officials, the Envoys who examine and summon deeds and records. May their true compassion descend, their dark scrutiny overseeing the ordination of these registers of the Upper Nine Heavens’ True Numinosity. May they all, according to their ranks, be transmitted into the bodies of these ordinands, settling in their palaces and guarding their bureaus, encamping and protecting them on all sides. Turning left, nine thousand myriad layers; turning right, nine thousand myriad layers. Guard their bodies, protect their lives, their brilliance shining forth, their majestic influence extending ten thousand miles.\n\nGenerals, soldiers, celestial officials, and marshals shall take the same form as these ordinands, their spirits penetrating within and without. The true officials of the lands they tread shall infuse them with qi, overseeing and examining them. All the officials and soldiers shall assist and support them. According to merit, they shall be promoted and rewarded, their loyalty and trust never betrayed. Thus is this memorial presented before the Imperial Presence of the Boundless Dao and the Most True Jade Emperor.\n\nThis done, they bow twice and then present the memorial. When the memorial is concluded, they again invoke and proclaim its merit.\n\nThe Golden Luminance Seven Perfected again invoke from within their bodies the multitude of true Merit Officers, celestial officials, marshals, soldiers, chief envoys, and the Flying Heavenly White Tiger Envoys bearing the memorial, the Dragon-Riding Immortal Couriers. The Seven Perfected address the emergent officials, presenting the memorial and petition. The dark hosts of their subordinate true ones return, ascending the void in their chariots, resuming their palaces and bureaus, settling into their proper positions, encamping in heaven and assisting on earth.\n\nThey return, preparing the hundred thousand myriad layers of heavenly palaces within the Seven Perfected’s bodies. The true and orthodox each reenter through the vermilion gates and wondrous portals, resuming their ranks. Thus is the petition of the Seven Perfected presented before the Dao.\n\nThis done, they bow twice, return to the table, and kneel facing north. The officials emerge once more to transmit the registers of ordination and governance.\n\nThe Golden Luminance Seven Perfected again activate from within their bodies the Five True Gentlemen-Officials, the Left and Right Merit-Officers, the Immortal Lords and Dukes, the Direct True Talisman Officers, the Divine Capital’s Jade Gentlemen, the Orthodox Unity and Ascending Mystery Merit Officers, the Chief Envoys who examine and summon, the Envoys who inspect the Immortal Kings, the Flying Heavenly Riders, the Direct True Flying Dragon-Riders, and the Soaring Dragon Couriers—thirty-six of each—who emerge. Robes immaculate, they array the celestial regalia, covering heaven and filling earth, assuming positions left and right. According to the ritual, they oversee, inspect, and transmit the Three Hundred Sixty-Five Registers of the Upper Nine Heavens’ True Numinosity—generals, soldiers, celestial officials, and marshals—into the bodies of these ordinands. They settle and guard the Three Hundred Sixty-Five Passes and Palaces of their joints and bureaus, encamping with a hundred thousand myriad layers, ensuring no errors.\n\nThey prepare and encamp these ordinands, uniting them with the multitude of true ones. Thus is the petition of the Seven Perfected presented directly before the Imperial Presence of the Boundless Dao and the Most True Jade Emperor.\n\nThis done, the registers of ordination are read aloud, transmitted by the heavenly palaces. When this is complete, the registers are invoked, then the talismanic texts are invoked, with the prayer:\n\nThe Dao opens the true, the Orthodox Dharma stands majestic.\nThe power of the Great Nonbeing stirs a mighty wind,\nFrom the nonbeing, light arises.\nThe divine merit of the Great Nonbeing transforms the ten directions.\nThe True Talismans of the Great Mystery summon the Spirit Kings.\nSupreme control and command shatter the myriad calamities,\nThe Nine Heavens uphold life, the Six Heavens dare not oppose.\nAll heavens protect and encamp, guarding through endless kalpas.\n\nHasten! As the Statutes and Ordinances of the Jade Emperor command.\n\nNext, the water texts of the ordination registers are invoked, with the prayer:\n\nThe Most High’s azure waters surge from the Celestial River,\nTransforming into divine qi like a heavenly net.\nFlying and scattering like swords, they slay heavenly demons.\nThe ghostly soldiers of the five directions—\nAll who encounter them are dissolved,\nLike wind, like fire, extinguishing spirits and sweeping away demons.\n\nHasten! As the Statutes and Ordinances command.\n\nThis done, the ordination registers are transmitted, and the merit is proclaimed. Next, incense is offered three times. They return to the table, face east, and kneel to proclaim the merit.",
      "overlap_context": "ous Statutes and Ordinances of the Nine Heavens command.\n\nOn the [such-and-such] day of the [such-and-such] month of the [such-and-such] year, at the hour of *zi*, the ritual is performed.\n\nThe text of the register for male and female children.\n\nRitual for the Transmission of the Register and the Investiture of Officials and Soldiers\n\nNext, ascend the altar, face east, and bow twice. Next, offer incense three times. Next, strike the ritual drum twenty-four times. Next, kindle the incense burner.",
      "start_char": 3308,
      "end_char": 4581,
      "start_sentence": 102,
      "end_sentence": 139,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.35543966293335,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清金真玉皇上元九天真灵三百六十五部元录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "金明七真，上启无极大道无始太上至真大圣天尊，向所七真身中五真郎吏、左右功平仙伯仙公、直真符吏、仙都玉郎、正一升玄功曹、考召都官条检仙王使者、飞天乘骑、直真飞龙骑、腾龙驿呈飞仙羽骑等，监察付度某法事，以玄请举迁言功，各当加真高位天爵万重，皆如金简功偿受迁事毕，各回灵腾驾，还复玄宫金堂玉府，周镇三元，并如先位，须后召复出。 七真所付度某等上元九天真灵三百六十五部玄录，将军兵士天官符吏，从今以去，与某等常相镇守，弥劫长存。 七真启奏，上闻无极大道至真玉皇御前。 毕，即再拜复炉，竟使出，次复炉。 左右香官、飞仙驿龙乘骑、捧香使者、飞天龙骑等，当使灵坛上生自然金辉宝耀，玄映玉瑛金液之精，使某受道福庆自在，天下受恩，十方玉童玉女侍卫，香烟径奏七真所启无极大道至真玉皇御前。 右度录刺状章。 某郡县乡里男女生王甲，年如干岁。",
      "translated_text": "The Seven Perfected of Golden Clarity,\nsupplicate the Boundless Dao’s Beginningless, Most High, Perfectly True and Greatly Sagely Heavenly Worthy.\n\nTo the Five Perfected Gentlemen and Clerks within the bodies of the Seven Perfected,\nthe Left and Right Merit-Balancing Immortal Lords and Immortal Dukes,\nthe Direct Perfected Talisman Clerks,\nthe Jade Gentlemen of the Immortal Capital,\nthe Orthodox Unity Ascending Mystery Merit Recorders,\nthe Inspecting and Summoning Celestial Kings and Envoys of the General Bureau,\nthe Flying Heavenly Mounted Riders,\nthe Direct Perfected Flying Dragon Riders,\nthe Soaring Dragon Courier Manifesting Flying Immortals and Feathered Riders—\n\nall are charged to oversee and transmit the ordination of [Name] in this ritual affair.\nBy the mysterious invocation, merit is proclaimed and promotion petitioned.\nEach shall be elevated to lofty celestial ranks, myriad-fold,\nas recorded in the Golden Tablets, their merit recompensed and promotion granted.\n\nWhen the affair is complete,\neach shall return to their numinous soaring chariots,\nrestoring to the Mysterious Palace, the Golden Hall, and Jade Treasury,\nperpetually guarding the Three Primes,\nall resuming their former stations,\nawaiting future summons before reappearing.\n\nThe Upper Prime’s Nine Heavens’ True Spirits,\nthe Three Hundred and Sixty-Five Departments of Mysterious Registers,\nthe generals, soldiers, celestial officials, and talisman clerks\nentrusted by the Seven Perfected to [Name]—\nfrom this moment onward,\nshall constantly guard and protect [Name],\nenduring through endless kalpas.\n\nThe Seven Perfected memorialize,\ntheir words ascending to the Boundless Dao’s Perfectly True Jade Emperor’s presence.\n\nThis done, they bow twice more before the incense burner, concluding the rite, then return to the burner.\n\nThe Left and Right Incense Officials,\nthe Flying Immortal Courier Dragon Riders,\nthe Incense-Bearing Envoys,\nthe Flying Heavenly Dragon Riders—\nall cause the numinous altar to generate spontaneous golden radiance and precious luminance,\nmysteriously reflecting the essence of jade brilliance and golden liquid,\nso that [Name] receives the blessings of the Dao, at ease and secure,\nthe world beneath heaven receives grace,\nand the jade lads and jade maidens of the ten directions attend in guard.\nThe fragrant smoke ascends directly to the Seven Perfected’s memorial\nbefore the Boundless Dao’s Perfectly True Jade Emperor.\n\nRight: Ordination Register, Memorial Document, and Petition.\n[Name], male/female, of [Prefecture], [County], [Village], born in the year of [Heavenly Stem-Earthly Branch], aged [Number] years.",
      "overlap_context": "nsforming into divine qi like a heavenly net.\nFlying and scattering like swords, they slay heavenly demons.\nThe ghostly soldiers of the five directions—\nAll who encounter them are dissolved,\nLike wind, like fire, extinguishing spirits and sweeping away demons.\n\nHasten! As the Statutes and Ordinances command.\n\nThis done, the ordination registers are transmitted, and the merit is proclaimed. Next, incense is offered three times. They return to the table, face east, and kneel to proclaim the merit.",
      "start_char": 4582,
      "end_char": 4949,
      "start_sentence": 140,
      "end_sentence": 146,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.72864317893982,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清金真玉皇上元九天真灵三百六十五部元录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "右如干人今投辞，请受上元九天三百六十五部玄录，请给谨状。 某郡县乡里男女童子，年如干岁。 右如干人今投辞，请受无上九天玉仙一将军童子玄录，请给馑状。 钱二百，　薪五束。 右受三百六十五部玄录信物如左。 钱二百，　薪一束。 右受童子玄录信物如左。 清玄无极正一玄气系天尊，长明金真玉皇治，左清真玄气九万九千九百九十九重流明玉天真人、右积阳元气八万八千八百八十八重金玄宝光真人，中玄生灵清妙无央真气百千万重玉玄金元真人，都领上景清虚自然生神妙气九亿九万九千九百九十九重气、领三十六洞天至真虚玄丈人、领高上玉皇三十六真皇正治都监十方无纲玉司法王，金明七真子稽首再拜高上真威正气。 谨案元科，今有男女生等，先蒙师真启拔，赐署天官治职，进叨上道三洞妙法，非分佩恩宝衔罔极大道洪泽。 但某生长浊俗，命属三灾，为非染恶，习与性成，身心不谨，负越禁诚，罪积丘岳，过深渊海，自罹咎衅莫大之愆。 伏闻大道慈真普育，恩备十方，海纳万流，恩沾三界，六道光润，无物不备。 某等贪进忘退，无以自济，谨以投辞玄真，归命三尊，乞受上元九天真灵三百六十五部玄录，将军兵士天官将吏，永济长河之津。 佩法之后，当依科奉行，不敢有违。 七真见某等稽颡不止，即加署天官。 谨依某等郡县乡里姓名年纪，即日逆刺上言章表天官位号，如前事状。 伏愿无极大道无上金阙玉帝至真大圣，降动三天仙都署仙玉郎、九天真王监真度命使者，摄召天官，分别正位，克以今月某日付度某等，依法拜署，竭言上刺，奏御无极大道御前。 金明七真稽首再拜白刺，上诣太元上九天金阙玉帝考召清真正气。 太岁某月日子时，金明七真於某郡县乡里白刺。 太玄上九天无上真明大众至真降遣。 右度录章仪。 清玄无极正一玄气系天尊某治气金明七真，稽首再拜高上真威正气，谨按玄科，今有男女生等如干人，投辞稽颡，求受上元九天真灵三百六十五部玄录。 七真以今月某日，依科署某等天官列位，如前事状，逆刺表章，上御道前。 伏愿无极大道至真大圣太上天尊，垂神玄监，慈真降下，开度某等得济苦海之难，永为身宝。 愿勅九天高上玉皇监真使者、玄都仙皇监盟玉郎使者、十方飞天开度玉司神仙羽郎使者、无上三天金阙玉帝消灾道真公使者，一合来下，天真乘骑盖天弥地，流精电转，扫荡六天群非，摄召三界神官，共下监临，开度某等上元九天真灵三百六十五部玄录，将军兵士天官将吏，条列付度，永镇某等身中三百六十五宫室，元令失次。 七真伏地，拜上纸章一通。 恩惟无极大道无上金阙玉帝至真大圣，哀愍七真所表，随事分别清真玄气生灵神化之功，天真官属付度某等，常审营卫，流光电转，布在宫室，长为某等身宝。 谨因直真符吏、飞龙乘骑飞天玉郎、送章飞真白虎神龙骑吏等，各千二百，驿章文上奏无上至真玉帝御前。 金明七真稽首再拜以闻。 金明七真子，属金相洞明玉国九真乡上景金轮里。 泰清如法。 太岁年月日子时，於某里中拜上。 上元九天真灵出官仪 百姓救急请福上章通用。 次入静东向再拜。 夜即北向言奏。 次长跪案前三捻香。 毕即起立。",
      "translated_text": "Right: [Number] persons now submit their petitions, requesting to receive the Mysterious Registers of the Upper Prime’s Nine Heavens and Three Hundred Sixty-Five Departments. Respectfully filed petition.\n[Name], male/female child, of [Prefecture], [County], [Village], aged [Number] years.\n\nRight: [Number] persons now submit their petitions, requesting to receive the Mysterious Register of the Supreme Nine Heavens’ Jade Immortal First General Child. Respectfully filed petition.\nTwo hundred coins, five bundles of firewood.\n\nRight: The token offerings for receiving the Mysterious Registers of the Three Hundred Sixty-Five Departments are as follows:\nTwo hundred coins, one bundle of firewood.\n\nRight: The token offerings for receiving the Child’s Mysterious Register are as follows.\n\nThe Celestial Worthy of Primordial Qi of the Orthodox Unity of the Boundless Dao,\nthe Ever-Bright Golden Perfected Jade Emperor’s Court,\nthe Left: Nine Myriad Nine Thousand Nine Hundred Ninety-Nine Layers of Flowing Luminous Jade Heavenly Perfected of the Pure True Primordial Qi,\nthe Right: Eight Myriad Eight Thousand Eight Hundred Eighty-Eight Layers of Golden Mysterious Radiant Treasure Light Perfected of the Accumulated Yang Primordial Qi,\nthe Center: Hundreds of Thousands of Myriad Layers of Jade Mysterious Golden Primordial Perfected of the Wondrously Pure and Boundless Primordial Qi of Living Spirits—\nall together lead the Nine Hundred Ninety-Nine Myriad Nine Thousand Nine Hundred Ninety-Nine Layers of Qi of the Upper Realm’s Pure Void and Spontaneously Generated Spirit,\nlead the Thirty-Six Grotto-Heavens’ Most True Void Mysterious Elders,\nlead the Highest Jade Emperor’s Thirty-Six Perfected Sovereigns’ Orthodox Governance and the Ten Directions’ Boundless Jade Judicial Kings,\nthe Golden Luminous Seven Perfected, bowing twice, reverently salute the Highest Perfected’s True Might and Orthodox Qi.\n\nRespectfully following the ancient statutes, there are now male and female disciples who, having first received the grace of their masters’ initiation, were appointed to celestial offices. They have advanced to partake in the wondrous methods of the Three Caverns’ Supreme Dao, undeservingly bearing the boundless grace of the Great Dao’s vast beneficence. Yet, having been born and raised in the turbid world, their lives are subject to the Three Calamities. They have committed transgressions and accumulated evil, their habits ingrained by nature. Their bodies and minds have been careless, violating prohibitions and sacred pledges. Their sins have piled high as mountains, their faults deep as the abyss. They have incurred the greatest of offenses and transgressions.\n\nHaving heard that the Great Dao’s compassionate truth universally nurtures all, its grace pervading the ten directions, its embrace vast as the sea, its mercy moistening the Three Realms and Six Paths, with nothing left unprovided—yet they, greedy for advancement and forgetful of retreat, have no means to save themselves. Thus, they humbly submit their petitions to the Mysterious Perfected, taking refuge in the Three Worthies, beseeching to receive the Upper Prime’s Nine Heavens’ True Numinous Three Hundred Sixty-Five Departments’ Mysterious Registers, the generals, soldiers, celestial officials, and divine officers, to forever ferry them across the ford of the Long River. After receiving the register, they shall follow the statutes and uphold the precepts, daring not to transgress.\n\nThe Seven Perfected, seeing their ceaseless prostrations, shall then appoint them to celestial offices. Respectfully recording their prefectures, counties, villages, names, and ages, this day they submit their memorials and petitions, reporting their celestial office titles as stated above.\n\nWe humbly pray that the Boundless Dao’s Supreme Golden Portal Jade Emperor, Most True and Great Sage, may move the Three Heavens’ Immortal Capitals to appoint the Jade Gentlemen of the Immortal Offices, the Nine Heavens’ True Kings’ Supervisors of Registers and Life-Spans, to summon the celestial officials, distinguish their proper ranks, and on this day of this month, ordain and appoint them according to the law. Their earnest words are inscribed and submitted, memorialized before the Boundless Dao’s imperial presence.\n\nThe Golden Luminous Seven Perfected bow twice and present this petition, ascending to the Supreme Prime’s Nine Heavens’ Golden Portal Jade Emperor to summon the Pure True Orthodox Qi.\n\nIn the year of [Heavenly Stem-Earthly Branch], on the [Day] of the [Month], at the hour of the Rat, the Golden Luminous Seven Perfected submit this petition in [Prefecture], [County], [Village].\n\nThe Supreme Prime’s Nine Heavens’ Most True and Great Assembly of the Supreme Perfected descends and dispatches.\n\nRight: Ordination Register and Memorial Rites.\n\nThe Golden Luminous Seven Perfected of the Celestial Worthy of Primordial Qi of the Orthodox Unity of the Boundless Dao’s [Name] Court bow twice and reverently salute the Highest Perfected’s True Might and Orthodox Qi. Following the Mysterious Statutes, there are now [Number] male and female disciples who submit their petitions, prostrating themselves to seek the Upper Prime’s Nine Heavens’ True Numinous Three Hundred Sixty-Five Departments’ Mysterious Registers. The Seven Perfected, on this day of this month, in accordance with the statutes, appoint them to celestial offices and ranks as stated above, submitting their memorials and petitions to the Dao’s imperial presence.\n\nWe humbly pray that the Boundless Dao’s Most True and Great Sage, the Supreme Celestial Worthy, may deign to oversee with divine gaze, compassionately descending to deliver them from the calamities of the sea of suffering, forever becoming the treasure of their bodies. May the edict be issued to the Nine Heavens’ Highest Jade Emperor’s Supervisors of Registers, the Mysterious Capital’s Immortal Sovereigns’ Jade Gentlemen Supervisors of Oaths, the Ten Directions’ Flying Celestial Jade Bureau’s Divine Immortal Feathered Gentlemen Envoys, and the Supreme Three Heavens’ Golden Portal Jade Emperor’s Dao Perfected Lords of Disaster Dispelling—all descending together, their celestial perfected riding mounts covering heaven and earth, their flowing essence flashing like lightning, sweeping away the myriad wrongs of the Six Heavens, summoning the divine officials of the Three Realms to jointly oversee and deliver them. May they receive the Upper Prime’s Nine Heavens’ True Numinous Three Hundred Sixty-Five Departments’ Mysterious Registers, the generals, soldiers, celestial officials, and divine officers, itemized and bestowed, forever guarding the Three Hundred Sixty-Five palaces within their bodies, ensuring the Primordial Decree does not lose its order.\n\nThe Seven Perfected prostrate themselves and present one memorial.\n\nWe beseech the Boundless Dao’s Supreme Golden Portal Jade Emperor, Most True and Great Sage, to take pity on the Seven Perfected’s petition, distinguishing the merits of the Pure True Primordial Qi’s living spirits and divine transformations according to each matter. May the celestial perfected and their subordinates bestow and ordain them, constantly protecting and defending, their flowing light flashing like lightning, spreading through their palaces, forever becoming the treasure of their bodies.\n\nRespectfully entrusted to the Upright Perfected Talisman Officers, the Flying Dragon Riders, the Flying Celestial Jade Gentlemen, the Petition-Submitting Flying Perfected White Tiger Divine Dragon Riders—each one thousand two hundred in number—to swiftly deliver this memorial to the Supreme Most True Jade Emperor’s imperial presence.\n\nThe Golden Luminous Seven Perfected bow twice and make this known.\n\nThe Golden Luminous Seven Perfected Disciples, belonging to the Golden Phase Cavern-Luminous Jade Realm’s Nine Perfected Village of the Upper Realm’s Golden Wheel Hamlet.\n\nThe Great Purity is in accordance with the law.\n\nIn the year of [Heavenly Stem-Earthly Branch], on the [Day] of the [Month], at the hour of the Rat, prostrating and submitting in [Village].\n\nRites for the Upper Prime’s Nine Heavens’ True Numinous Officials’ Manifestation.\nCommonly used for the laity’s urgent petitions for salvation and blessings.\n\nNext, enter seclusion and bow twice facing east.\nAt night, face north to make the report.\nNext, kneel lengthily before the altar and offer incense three times.\nUpon completion, rise and stand.",
      "overlap_context": "hat [Name] receives the blessings of the Dao, at ease and secure,\nthe world beneath heaven receives grace,\nand the jade lads and jade maidens of the ten directions attend in guard.\nThe fragrant smoke ascends directly to the Seven Perfected’s memorial\nbefore the Boundless Dao’s Perfectly True Jade Emperor.\n\nRight: Ordination Register, Memorial Document, and Petition.\n[Name], male/female, of [Prefecture], [County], [Village], born in the year of [Heavenly Stem-Earthly Branch], aged [Number] years.",
      "start_char": 4950,
      "end_char": 6206,
      "start_sentence": 147,
      "end_sentence": 183,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.6007924079895,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清金真玉皇上元九天真灵三百六十五部元录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "次呜天鼓二十四通。 次发炉。 清玄无极真上三天玄元始炁无极大道太上老君、左右香官、飞仙驿龙乘骑、捧香使者、飞天龙骑、五帝侍香玉童玉女等，各二十四人出，上启虚无自然元始天尊，某正尔烧香，表奏某章，愿得太上十方正真生炁，降甲身中。 所启径上无极大道至真玉皇御前。 毕即再拜，长跪香案前，出官奏章。 谨出某真人弟子甲身中五体真官功曹使者，各二人出。 上元九天功曹官，各二人出。 上元九天升玄功曹官，各二人出。 上元九天左玄真明功曹官，各二人出。 上元九天右玄太真功曹官，各二人出。 上元九天阳神正一功曹官，各二人出。 上元九天阴神正一功曹官，各二人出。 上元九天上仙都治病功曹官，各二人出。 上元九天上灵飞腾天丁力士官，各二人出。 上元九天上灵飞腾诛符破庙金刚力士官，各二人出。 上元九天上灵飞腾收魔伐杀力士官，各二人出。 上元九天上灵飞腾收神食鬼力士官，各二人出。 上元九天上灵飞腾收精食毒力士官，各二人出。 上元九天上灵飞天考召力士官，各二人出。 上元九天上灵飞天郎吏飞符摄召力士官，各二人出。 上元九天上灵飞天赤飘金车羽郎官，各二人出。 无上上元九天上灵飞天白虎送章仙龙骑吏官，各二人出。 谨出甲身中真官使者、仙都直真符吏、领仙都官使者，各千二百人出。 严庄整服，冠带垂缨，各整天真羽仪，罗列四面八方，营卫甲左右前后，流明耀电，弥天盖地，扫除不祥，神光朗焕某所住宫宅，玄鉴所启。 今有某郡县乡里某甲男女生民，当随事口启言奏云。 谨因甲拜请天官，上纸章一通，乞为某解释千愆万责，或某事云云。 和怨扶对，消灾散祸，除凶灭徉，皆得剔然。 某家所犯衰厄，咸蒙原赦，疾病差愈，百福庄严，所向利贞，悉得元吉。 慈真降覆某家，合门受恩。 甲今上启无极大道元始太上玉皇、无上至直大圣天尊金阙玉帝陛下、九老仙都君九气丈人、上灵仙都真官、考召行状都官使者、高上法王无上八元天师，愿勅下十方诸天八极五方，监察考召三元四始甲子诸官七十二官君、赤阳丙丁三十六诸官、天地山岳河淮济渍九江八海一切诸灵官属，当考召此间土地真官，注气社里邑君，各当奉勅符命，为某随事关启章闻，必使上达，不得拘留，致停公文。 天神地祇，更相营卫。 若有六天下官故气强□不正之神，於道断截章文，不使上达，天官吏兵即依仙都三天玄都正律，收付天一北太阴之狱，必使上启径奏无极大道至真玉皇御前。 毕即再拜，便奏章。 章竟，即重勅言功。",
      "translated_text": "Next, strike the celestial drum twenty-four times. Then, open the incense burner.\n\nThe Pure and Boundless True One of the Three Heavens’ Primordial Origin, the Primordial Qi of the Boundless Dao, the Most High Lord Lao; the Left and Right Incense Officials; the Flying Immortals’ Dragon-Mounted Couriers; the Incense-Bearing Envoys; the Flying Celestial Dragon-Riders; and the Jade Lads and Maidens attendant upon the Five Thearchs—twenty-four each—emerge to report above to the Primordial Heavenly Worthy of the Void and Spontaneous Nature. [The petitioner] now burns incense and submits this memorial, praying that the Primordial Qi of the Most High’s Ten Directions’ True and Upright Ones descend into the body of so-and-so.\n\nThe report shall ascend directly to the Imperial Presence of the Boundless Dao’s Most True Jade Thearch. Upon completion, bow twice, then kneel lengthily before the incense altar and present the memorial for the officials’ manifestation.\n\nRespectfully summon from the body of the disciple so-and-so the True Officials and Merit Officers of the Five Agents—two each. From the Upper Prime’s Nine Heavens, the Merit Officers—two each. From the Upper Prime’s Nine Heavens’ Ascending Mystery, the Merit Officers—two each. From the Upper Prime’s Nine Heavens’ Left Mystery’s True Luminous Merit Officers—two each. From the Upper Prime’s Nine Heavens’ Right Mystery’s Grand True Merit Officers—two each. From the Upper Prime’s Nine Heavens’ Yang Spirit’s Orthodox Unity Merit Officers—two each. From the Upper Prime’s Nine Heavens’ Yin Spirit’s Orthodox Unity Merit Officers—two each. From the Upper Prime’s Nine Heavens’ Upper Immortals’ Capital’s Healing Merit Officers—two each. From the Upper Prime’s Nine Heavens’ Upper Numinous Flying Ascendant Celestial Ding Force Soldiers—two each. From the Upper Prime’s Nine Heavens’ Upper Numinous Flying Ascendant Talismanic Destruction of Demonic Shrines Vajra Force Soldiers—two each. From the Upper Prime’s Nine Heavens’ Upper Numinous Flying Ascendant Demon-Subduing and Demon-Slaying Force Soldiers—two each. From the Upper Prime’s Nine Heavens’ Upper Numinous Flying Ascendant Spirit-Seizing and Ghost-Devouring Force Soldiers—two each. From the Upper Prime’s Nine Heavens’ Upper Numinous Flying Ascendant Essence-Seizing and Toxin-Devouring Force Soldiers—two each. From the Upper Prime’s Nine Heavens’ Upper Numinous Flying Ascendant Celestial Examination and Summoning Force Soldiers—two each. From the Upper Prime’s Nine Heavens’ Upper Numinous Flying Ascendant Celestial Clerks and Flying Talismanic Summoning Force Soldiers—two each. From the Upper Prime’s Nine Heavens’ Upper Numinous Flying Ascendant Scarlet Whirlwind Golden Chariot Feathered Clerks—two each. From the Supreme Upper Prime’s Nine Heavens’ Upper Numinous Flying Ascendant White Tiger Memorial-Delivering Dragon-Riding Couriers—two each.\n\nRespectfully summon from the body of so-and-so the True Official Envoys, the Capital of Immortals’ Direct True Talismanic Clerks, and the Leading Envoys of the Capital of Immortals’ Officials—one thousand two hundred each.\n\nSolemnly adorned in robes, caps, and pendent tassels, each arrays the celestial feathered regalia of the True Ones, forming ranks on all four sides and eight directions. They guard and protect so-and-so’s left and right, front and rear, their flowing luminosity flashing like lightning, filling heaven and earth, sweeping away inauspiciousness. The divine radiance illumines brightly the dwelling of so-and-so, where the Mysterious Mirror observes all that is reported.\n\nNow, so-and-so, a common person of such-and-such prefecture, county, village, and hamlet, respectfully states the following in accordance with the matter at hand:\n\nRespectfully, so-and-so petitions the Heavenly Officials, submitting one written memorial, beseeching relief from so-and-so’s thousand transgressions and myriad faults—or regarding such-and-such matter. May grievances be reconciled, disasters dispersed, calamities averted, and misfortunes eradicated, all resolved without hindrance. May the afflictions and adversities besetting so-and-so’s household be wholly pardoned and remitted, illnesses cured, and a hundred blessings adorned. May all endeavors be propitious and upright, attaining supreme auspiciousness. May the Compassionate True Ones descend to shelter so-and-so’s household, that all within may receive grace.\n\nSo-and-so now reports above to the Boundless Dao’s Primordial Most High Jade Thearch, the Supreme and Most Upright Great Sage Heavenly Worthy, the Jade Emperor of the Golden Watchtower; the Nine Elders of the Immortals’ Capital and the Nine Qi Master; the Upper Numinous Immortals’ Capital’s True Officials; the Merit Officers of the Examination and Summoning Bureau; the Highest Dharma Kings and Supreme Eight Primordial Heavenly Masters. May they command the myriad officials of the Ten Directions’ all heavens, the Eight Extremes, the Five Directions, the Three Origins, the Four Beginnings, the Jiazi cycles, the seventy-two officials, the Red Yang Bing Ding thirty-six officials, and all numinous officials of heaven, earth, mountains, rivers, the Huai, the Ji, the nine rivers, the eight seas—to examine and summon the local Earth Gods and True Officials, the Qi-Recording Community and Hamlet Lords. May each obey the edict and talismanic command, transmitting so-and-so’s memorial in accordance with the matter at hand, ensuring its swift ascent without delay or obstruction of the official document.\n\nMay the gods of heaven and earth mutually guard and protect. Should any of the Six Heavens’ subordinate officials, corrupt qi, or unrighteous spirits obstruct the Dao and intercept the memorial, preventing its ascent, the Heavenly Officials’ soldiers shall, in accordance with the Three Heavens’ Mysterious Capital’s Orthodox Statutes, seize and deliver them to the Heavenly One’s Northern Great Yin Prison. The memorial shall ascend directly to the Imperial Presence of the Boundless Dao’s Most True Jade Thearch.\n\nUpon completion, bow twice, then present the memorial. When the memorial concludes, solemnly recite the merit-conferring invocation.",
      "overlap_context": " law.\n\nIn the year of [Heavenly Stem-Earthly Branch], on the [Day] of the [Month], at the hour of the Rat, prostrating and submitting in [Village].\n\nRites for the Upper Prime’s Nine Heavens’ True Numinous Officials’ Manifestation.\nCommonly used for the laity’s urgent petitions for salvation and blessings.\n\nNext, enter seclusion and bow twice facing east.\nAt night, face north to make the report.\nNext, kneel lengthily before the altar and offer incense three times.\nUpon completion, rise and stand.",
      "start_char": 6207,
      "end_char": 7224,
      "start_sentence": 184,
      "end_sentence": 217,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.22234654426575,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清金真玉皇上元九天真灵三百六十五部元录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "次言功 甲重动身中众真功曹天官将吏兵士、都官使者、飞天白虎送章仙龙骑吏等，甲向所出天官为某，为某，随事言奏章一通，露表事竟。 愿某家因是功德，开度九玄七祖，於斯拔对五道，原赦十苦八难三涂之谪，存亡皆蒙济度，升天受福，南宫衣厨，自然庆流。 某家门大小所疾除愈，或某事。 解释梦想，真正为是。 从来所为作祸精灵鬼魅、五方疫毒、云中游猎魍魉、浮游诸凶鬼伍，咸当从今灭爽，万祸不生，百福庄严，永享元吉。 令甲所化者化，所治者愈，所伏者伏，咸共营卫。 甲所部众真天官，各回腾虚驾，还复宫阙金城玉府，安镇本位，营天辅地，周备甲身中，有千二万重天官正真，各从朱门妙阙而还职位。 甲所启上御无极大道前。 毕即再拜。 次复炉 左右香官、飞仙驿龙乘骑捧香使者、飞天龙骑等，当使灵坛静室之上，内外自然生金晖宝耀，玄映玉映金液之精。 某家福庆自在，天下受恩，十方玉童玉女侍卫香烟，径奏甲所启无极大道至真玉皇御前。 毕即便出。 金明曰：七真受高上玄录，即金口所诀，以为立成仪典，并付度科格，共为此一卷也。 玄录者，其运常随七真自然之运，以辅三十六真皇正治，御於贤劫，在乎兹也。 十方天人，若不知万道势讫者，兆但看伪科罢除，即三洞莹发，真经洞明，焕彻清夷，光净日景，有若法镜矣。 正道运行矣，法乘运功矣，即是洞经兴矣，法教於斯盛矣，万魔降矣。 当尔之时，天不受祭，神不受祠，鬼不受食，妖精匿矣，淫害灭矣，六天正矣，野道伏矣。 当尔之时，真为庆也，十方天人岂不乐哉。 今粗述后篇而以证矣。 传告后贤，勿析斯卷，以分别出外，更为卷轴也。 有犯者获罪於风刀，可不慎之。 若欲传授，但寻斯文，自不越宗矣，慎以自可戒之乎。 玉皇真旨，自不可有违，七真经身，实不敢负圣教焉。 泰玄正真玄元清玄无极真上天君、真明天君、无上天君、太上大道君、亿千万重真玄生炁道君、太上老君、太上丈人、九老仙都君、百千万重道气君真天陛下。 六十一字。 泰清玄元清玄无极真上天尊、真明大众天尊、无上金明天尊、上玄亿千万重仙玄生气无极大道天君、三元生气百千万重道气君、九老真仙丈人金明阙下。 六十一字。 右二件不出此卷，读之未究，权置此耳。",
      "translated_text": "Next, recite the merit-conferring invocation:\n\nThe first *jia* stirs the host of perfected beings within the body—Merit Officers, Celestial Officials, Generals, Scribes, Soldiers, Capital Envoys, Flying Celestial White Tigers, Memorial-Conveying Immortal Dragon Riders, and all the Heavenly Officials who emerged at the first *jia*—on behalf of so-and-so, for such-and-such matter, have transmitted this memorial and revealed its memorial tablet to completion.\n\nMay so-and-so’s household, by virtue of this merit, open the path to deliver the Nine Mysteries and Seven Ancestors, extricating them from the Five Paths, absolving the Ten Sufferings, Eight Calamities, and Three Wretched Realms of their karmic transgressions. May the living and the dead alike receive salvation and ascension, ascending to heaven to receive blessings, their robes and provisions naturally flowing from the Southern Palace.\n\nMay all illnesses afflicting so-and-so’s household, great and small, be cured, or [address] such-and-such matter. May dreams and illusions be dispelled, and truth be firmly established.\n\nMay all malevolent spirits, demonic entities, and spectral apparitions—whether the baleful *qi* of the Five Directions, pestilential toxins, cloud-chasing hunters, *wangliang* specters, or any roving bands of inauspicious ghosts—be utterly extinguished from this day forth. May ten thousand misfortunes never arise, and may a hundred blessings adorn and perfect, ensuring eternal supreme fortune.\n\nMay all that the first *jia* transforms be transformed, all it governs be healed, and all it subdues be subdued, all jointly guarded and protected.\n\nMay the host of perfected Celestial Officials under the first *jia*’s command return, soaring through the void, to their palaces of golden citadels and jade precincts, resuming their stations to pacify heaven and assist earth. May the twelve thousand layers of Celestial Officials and Orthodox Perfected Ones within the first *jia*’s body, each departing from the vermilion gates of wondrous palaces, return to their posts.\n\nThe first *jia* has presented this memorial before the Imperial Presence of the Boundless Dao’s Most True Jade Thearch.\n\nUpon completion, bow twice. Next, tend to the incense burner.\n\nThe Left and Right Fragrant Officers, Flying Immortal Courier Dragon Riders, Incense-Bearing Envoys, and Flying Celestial Dragon Riders shall ensure that above the sacred altar and within the tranquil chamber, gold radiance and precious luminosity naturally arise, intermingling with jade’s resplendence and the essence of golden liquid.\n\nMay so-and-so’s household enjoy blessings and ease, the world receive grace, and the jade lads and jade maidens of the Ten Directions attend the fragrant smoke, conveying the first *jia*’s memorial directly to the Imperial Presence of the Boundless Dao’s Most True Jade Thearch.\n\nUpon completion, depart.\n\nThe *Jinming* states: The Seven Perfected received the Supreme Mysterious Register, and from the Golden Mouth’s decrees, this ritual was established as a ready-made liturgical model. Together with the transmission protocols and ordinances, they form this single scroll.\n\nThe Mysterious Register’s movement perpetually aligns with the Seven Perfected’s natural course, aiding the Thirty-Six Perfected August Ones in their orthodox governance, presiding over the Worthy Kalpa, as it is now.\n\nIf the celestial beings of the Ten Directions remain unaware of the myriad Dao’s culmination, let them observe the abolition of false ordinances—then the Three Caverns shall shine forth, the true scriptures shall illuminate with clarity, resplendent and pure, their brilliance as radiant as the sun’s light, like a dharma-mirror.\n\nThe Orthodox Dao is in motion; the Dharma Vehicle is at work. Thus, the Cavern Scriptures flourish, the Dharma teachings thrive, and the ten thousand demons are subdued.\n\nAt that time, heaven shall no longer accept sacrifices, spirits shall no longer receive offerings, ghosts shall no longer partake of food, malevolent entities shall hide, licentious harm shall vanish, the Six Heavens shall be rectified, and heterodox paths shall submit.\n\nAt that time, it shall truly be a cause for celebration—how could the celestial beings of the Ten Directions not rejoice?\n\nNow, this later section is roughly outlined to serve as proof. Transmit this to future worthies, and do not divide this scroll by extracting portions to form separate volumes.\n\nThose who violate this shall incur punishment by the Wind Blade—beware!\n\nIf transmission is desired, simply follow this text, and it shall not deviate from the lineage. Take heed and guard against transgression.\n\nThe True Decree of the Jade Thearch must not be defied; the Seven Perfected’s scriptural embodiment truly dares not betray the sagely teachings.\n\nThe Supreme Perfected of the Great Mystery, the Orthodox Mystery, the Primordial Mystery, and the Boundless Mystery; the True Illuminator Celestial Lord; the Supreme Celestial Lord; the Most High Lord of the Great Dao; the Lord of the Myriad Layers of True Mystery and Primordial *Qi*; the Most High Lord Lao; the Most High Elder; the Nine Elders of the Immortal Capital; and the Lords of the Hundred Thousand Layers of Dao *Qi* and Perfected Celestials—before the True Heavenly Court.\n\nSixty-one characters.\n\nThe Supreme Perfected of the Great Clarity, the Primordial Mystery, and the Boundless Mystery; the True Illuminator and Great Assembly Celestial Worthies; the Supreme Golden Clarity Celestial Worthy; the Supreme Lord of the Myriad Layers of Immortal Mystery and Primordial *Qi* of the Boundless Great Dao; the Lord of the Three Origins and the Hundred Thousand Layers of Dao *Qi*; and the Nine Elders, True Immortals, and Elders beneath the Golden Clarity Gate.\n\nSixty-one characters.\n\nThese two passages are not to be removed from this scroll. As their reading remains incomplete, they are provisionally placed here.",
      "overlap_context": "s obstruct the Dao and intercept the memorial, preventing its ascent, the Heavenly Officials’ soldiers shall, in accordance with the Three Heavens’ Mysterious Capital’s Orthodox Statutes, seize and deliver them to the Heavenly One’s Northern Great Yin Prison. The memorial shall ascend directly to the Imperial Presence of the Boundless Dao’s Most True Jade Thearch.\n\nUpon completion, bow twice, then present the memorial. When the memorial concludes, solemnly recite the merit-conferring invocation.",
      "start_char": 7225,
      "end_char": 8106,
      "start_sentence": 218,
      "end_sentence": 247,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.435322999954224,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清金真玉皇上元九天真灵三百六十五部元录.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "大章用后，小章用前也。 上清金真玉皇上元九天真灵三百六十五部元箓竟",
      "translated_text": "The Great Register is employed afterward, the Lesser Register is employed beforehand.\n\nHere concludes the *Primordial Registers of the Three Hundred and Sixty-Five Divisions of the True Numinous Ones of the Nine Heavens of the Upper Origin*—the Supreme Jade Emperor of the Golden Perfection of Highest Clarity.",
      "overlap_context": "nd Great Assembly Celestial Worthies; the Supreme Golden Clarity Celestial Worthy; the Supreme Lord of the Myriad Layers of Immortal Mystery and Primordial *Qi* of the Boundless Great Dao; the Lord of the Three Origins and the Hundred Thousand Layers of Dao *Qi*; and the Nine Elders, True Immortals, and Elders beneath the Golden Clarity Gate.\n\nSixty-one characters.\n\nThese two passages are not to be removed from this scroll. As their reading remains incomplete, they are provisionally placed here.",
      "start_char": 8106,
      "end_char": 8142,
      "start_sentence": 248,
      "end_sentence": 249,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 2.1547348499298096,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清金真玉皇上元九天真灵三百六十五部元录.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}