{
  "source_id": "上清骨髓灵文鬼律",
  "source_file": "chunked_daozang\\上清骨髓灵文鬼律.json",
  "total_chunks": 16,
  "total_original_chars": 12102,
  "total_translated_chars": 76595,
  "total_translation_time": 386.1722996234894,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\戒律类\\上清骨髓灵文鬼律.txt",
    "category": "戒律类"
  },
  "full_translation": "**Preface to the *Shangqing Gusui Lingwen Guilü* (Upper Clarity Ghost Statutes of the Numinous Writ of Bone and Marrow)**\n\nComposed by Deng Yougong, Servant of the Heavenly Heart Orthodox Rites and Recipient of the *Shangqing Dadong Lu*\n\nI have heard it said in the *Book of Documents*: \"The Dao of Heaven blesses the good and calamitizes the licentious.\" It is also written: \"Heaven commands those with virtue; Heaven punishes those with guilt.\" Thus, the good are surely blessed, the licentious surely calamitized; those with virtue are destined to receive mandate, those with guilt are destined for chastisement—this is the Dao of Heaven. Though Heaven oversees the world below, is this principle manifest only among humans? Even in the hidden realms of ghosts and spirits, it is no different.\n\nFor this reason, spirits who render merit to the state and the people are all recorded in the sacrificial canons and accorded due rites. As for perverse and monstrous ghostly beings—those who bring misfortune, plague, demonic possession, or calamity, disturbing the people and harming creatures—there are none for whom measures of governance do not exist. How, then, could their harms be enumerated? It is for this reason that the *Shangqing Gusui Lingwen* has been entrusted to the upright, that they may uphold and enact it.\n\nIts contents comprise three sections: the *Ghost Statutes*, the *Jade Regulations*, and the *Ritual Procedures and Forms*. Collectively, they are known as the *Lingwen of Bone and Marrow*. The *Ghost Statutes* are adjudicated by the Heavenly Courts, administered through the Bureau of Expelling Evil, and executed under the authority of the Northern Emperor. The *Jade Regulations* and *Ritual Procedures and Forms* were specially bestowed upon the Bureau of Expelling Evil by the Jade Emperor for the governance of judgments.\n\nTheir essential purpose is to adjudicate the transgressions of ghosts and spirits, assist the upright, expel evil, bring fortune to the people, and defend the state against disaster. I have observed that the texts of the *Jade Regulations* are typically transmitted orally by ordinary ritual masters, while the *Ritual Procedures and Forms* remain obscure and poorly understood. As a result, the *Lingwen* has become fragmented, and only the *Ghost Statutes* remain extant. Even these, however, are not deeply comprehended by vulgar practitioners. Compounded by errors in transmission and copying, their structure and meaning have become disordered, leading to neglect. Now, they are reduced to mere talismanic waters for healing, often resulting in deception—how could this not betray the intent of High Heaven?\n\nThe *Lingwen* consists of fifty-six articles, venerating the Northern Culmen as supreme, encompassing the numerical principles of Heaven and Earth, yin and yang, and the Five Phases. It governs the principles of life and death, and all cases where the perverse overcomes the upright are subject to its jurisdiction. The *Jade Regulations* and *Ritual Forms* comprise sixty-four articles, mirroring the ceaseless generative images of the Eight Trigrams. When the *Ghost Statutes* are paired with the *Jade Regulations*, there are sixteen primary articles, totaling seventy-two—corresponding to the cycles of qi. Any transgression is referred to the Seventy-Two Offices of Mount Tai; if even one is missing, the law is incomplete, and the offices are not properly governed.\n\nThus, the Dao serves as the essence of the law, while the statutes serve as its function. When ghostly beings or perverse qi encroach, they must be rectified through the Dao—hence, it is called the *Orthodox Rite*. The *Ritual Procedures* comprise forty-eight articles: thirty-six correspond to the Thirty-Six Generals, while the remaining twelve represent the spirits of the twelve hours, ever present at one’s side, gathered into a single body—hence, it is called the *Ritual Procedures*. Moreover, the body is the abode of the One True, movement is the transformation of immortality, and stillness is communion with the numinous—is this not the marvel of spontaneity?\n\nUpon careful study of the *Ghost Statutes*, I find their texts detailed and refined. Tracing their origins, they derive from the Ancestral Immortal Rao Dongtian. Originally a prefectural clerk, he was impartial in his duties, strict in enforcing the law, and just in adjudicating cases, winning the satisfaction of the people. His luminous virtue aligned with the celestial patterns, illuminating the earthly realms and revealing these secret texts—the *Ghost Statutes*—as a true gift from August Heaven.\n\nThe Ancestral Immortal Dongtian held that though Heaven and humanity differ, their principles are one. Thus, he modeled the statutes after the laws of the state, weighing their severity to establish appropriate punishments. However, ghosts and spirits, though responsive, cannot be physically seized; where whips and cudgels cannot be applied, their crimes are met with hard labor. The *Fengdu Statutes* state that ghosts are punished with the labor of bearing mountains, and dragons with the task of digging ponds—such are their penal servitudes. The *Nüqing Ghost Statutes* declare that when Heaven rounds the three rains, it is akin to exile in the human realm. The *Nine Earth Statutes* speak of the supreme punishment of annihilating form, comparable to execution in the world. The *Xuandu Statutes* describe the dispersal of form and shadow, akin to extrajudicial measures. Applied in the world, these statutes for adjudicating ghosts and spirits are most meticulous.\n\nBy fortunate karmic affinity, I have ascended to study the true canons and encountered renowned masters, receiving their transmission. Over a decade, I sought rare manuscripts at the Jade Embankment Abbey on West Mountain in Hongzhou, the Great Peace Abbey on Mount Lu in Jiangzhou, the Simplicity Retreat Abbey in Nankang Prefecture, and the Numinous Immortal Abbey in Shuzhou. I collected five versions of the *Shangqing Ghost Statutes*, collating their errors against the original texts and arranging them in order. The *Ghost Statutes* comprise seven sections and fifty-six articles; the *Jade Regulations*, sixteen articles; and the *Ritual Procedures and Forms*, forty-eight articles—totaling one hundred twenty articles, divided into three scrolls. Each was meticulously examined, ensuring completeness in even the finest details. With the newly and previously obtained texts, I presented them to the Celestial Palaces and submitted them to the Bureau of Expelling Evil and other offices. The responses were clear and unerring, with no omissions—this is the complete edition.\n\nIf one were to practice these rites privately, concealing them from the world, their merit would not spread, and I fear it would contravene Heaven’s intent, inviting hidden retribution. Thus, I have transcribed and submitted them. I have also heard that in ancient times, those who governed Heaven with the Dao ensured that even the lowest ghosts were not numinous. It was not that the ghosts lacked numinosity, but that their powers did not harm people—so that neither side harmed the other, and virtue was reciprocally restored.\n\nThen this would be the pinnacle of grand governance—how magnificent indeed!\n\nWe humbly reflect that Your Imperial Majesty wields supreme authority, singularly orchestrating the myriad transformations beyond reckoning. The hundred spirits receive their offices, and the common people dwell in peace—surely, the one who governs thus must inherently possess the Dao.\n\nYour servant, in presenting this, does not merely seek to petition its promulgation throughout the realm to broaden its transmission. May all ritual masters under Heaven obtain the complete edition, practice accordingly, and ensure that even in distant lands and remote hamlets, no heretical spirits or malevolent specters may harm the people. This would but slightly aid Your Majesty’s transformative power by a ten-thousandth part.\n\nYour servant respectfully bows and touches his head to the ground in preface.\n\n*Upper Scroll of the Upper Clarity Essence-Spirit Ghost Statutes*\n*Composed by Deng Yougong, Purple Tenuity Palace Attendant and Daily Duty Perfected of the Ziwei Palace, Rectifier of the Received Upper Clarity Great Cavern Record and Practitioner of the Heavenly Heart Orthodox Rites*\n\n**Twenty-Seven Articles of the Dharma Dao Discipline**\n\nAll ritual officers, who enact yang in practice and receive yin in recompense, shall be assessed annually according to the prescribed forms.\n\nThose who suppress evil, restrain wrongdoing, relieve distress, rescue peril, deliver the dead beyond life, and grant boons to all sentient beings—resolving enmities and grievances—shall be promoted in rank according to the rites.\n\nThose who indulge private bias, abet wickedness, or foster treachery shall be reported by the Three Offices for investigation and subjected to severe demotion or punishment.\n\nAll urgent dispatches must be promptly acted upon within the same day—such as cases of critical illness, inquiries to the Underworld or Heavenly Bureaus regarding the extension or curtailment of lifespans.\n\nFor next-level urgent documents, city gods shall respond within one day.\n\nFor summons to the Five Peaks to establish prisons or hasten spirits, the limit is two days.\n\nRoutine matters shall not exceed three days.\n\nDelays of half a day incur one hundred strokes of the rod.\n\nDelays due to private obstruction result in one year of penal servitude.\n\nFor grave offenses, the penalty increases by one degree.\n\nThose who obstruct the Dao shall be punished according to their crimes.\n\nAll divine generals, officers, and soldiers assigned by the Eastern Peak shall serve three-year terms, though one-year terms may be permitted.\n\nTheir merits and transgressions shall be reported to their home peak for evaluation, rewards, or penalties. Replacements shall be pre-assigned one month before the term’s end.\n\nThose wishing to remain for another term shall notify their home peak.\n\nFailure to replace when due, or replacing when not due, incurs one hundred strokes, unless due to unavoidable circumstances.\n\nDivine generals who delay in reporting their missions shall receive one hundred strokes.\n\nThose who harm people or accept bribes in the course of duty shall be sentenced to two years of penal servitude. Heavenly soldiers and officers shall have their offenses reported accordingly.\n\nNo alterations may be made to ritual matters deemed unsuitable; immediate memorials must be submitted to await responses—such as cases where dispatched ghosts refuse to depart or talismanic envoys prove ineffectual.\n\nViolators shall be sentenced to two years of penal servitude.\n\nUnauthorized interference by non-ritual officers incurs three years of penal servitude.\n\nSpirits or gods assigned duties who fail in their posts, mistakenly seize living souls, or cause madness or illness shall be exiled one thousand *li*.\n\nIf such actions result in death, the penalty increases by two degrees.\n\nThose who defy or disobey the statutes shall be executed.\n\nRitual officers may carry talismans and seals while traveling, identifying themselves as itinerant authorities in any locale.\n\nThose who refuse requisitions or disobey summons to generals or officers shall be sentenced to one year of penal servitude.\n\nInterference with the ranks of immortals shall be memorialized with full details.\n\nThose who lose or misplace received documents must immediately report to the Bureau of Expelling Evil.\n\nIf documents are not recovered after investigation and pursuit within the set time, the penalty is one hundred strokes.\n\nRecovery within the time limit exempts the offender from punishment.\n\nSpirits or gods who disobey orders to proceed to their assigned posts shall be exiled three thousand *li*; repeat offenders shall be executed.\n\nDivine generals, officers, or soldiers who, in pursuing or capturing malevolent spirits, harm others for bribes shall be sentenced to two years of penal servitude.\n\nThose who conceal or allow such spirits to escape shall be punished according to the criminals’ crimes.\n\nIf a criminal, having been exposed and verified at the altar, later dies unexpectedly due to other causes, the circumstances of the responsible officers’ negligence shall be memorialized.\n\nAll divine generals, officers of famous mountains and great rivers, city gods, and local deities of the third rank or above must verify the seals on documents from the Bureau of Expelling Evil, strictly safeguard them, and promptly report compliance.\n\nNegligence incurs two years of penal servitude.\n\nSpirits or gods who, upon receiving orders from the Bureau of Expelling Evil, remain in place overnight without departing shall be sentenced to one year of penal servitude per day, increasing by one degree for every ten days, up to a maximum of three years.\n\nIf malevolent spirits, after being expelled, are concealed and not banished by the gods of the Six Jia or Earth Offices, the penalty is three years of penal servitude.\n\nIf such concealment results in death, the offender shall be exiled three thousand *li*.\n\nExceptions are made if the Heavenly Bureaus issue orders to detain them.\n\nIf commoners report matters to ritual officers who fail to act, act perfunctorily, or falsely accuse spirits or gods, the officers shall receive one hundred strokes.\n\nActing without a report or arbitrarily assigning blame for unrelated incidents is prohibited.\n\nSpirits in office who engage in illicit relations with common women shall be exiled three thousand *li*.\n\nFor grave offenses, the case shall be memorialized for imperial decision. Local spirits or gods committing such crimes shall receive penalties one degree higher.\n\nSpirits or gods who unjustly take lives or steal property, and resist capture despite entreaties, shall be executed.\n\nLocal city gods or earth deities who knowingly allow such acts shall be punished equally.\n\nThose who fail to detect such crimes shall receive one hundred strokes.\n\nSpirits or gods who do not promptly attend to their duties shall receive one hundred strokes.\n\nFor urgent matters involving human lives, the penalty is two years of penal servitude.\n\nIf death results, the penalty is exile of three thousand *li*.\n\nThose who disobey imperial talismans and refuse to depart shall be executed.\n\nFor locust plagues, droughts, floods, frost, snow, or hail damaging crops, local spirits who fail to provide relief shall be reported by the Bureau of Expelling Evil to dispatch officers to suppress the afflictions. Failure to comply incurs one hundred strokes.\n\nIf the matter concerns celestial bureaus or seasonal calamities, memorials may be submitted.\n\nDivine generals, officers, or soldiers who are summoned but refuse, or are not summoned but act, shall each receive one hundred strokes.\n\nFor every ten persons, the penalty increases by one degree, with a maximum of three years of penal servitude.\n\nThose who, when summoned to relieve the suffering of the people, fail to promptly attend due to interference from gods or spirits shall be exiled three thousand *li*. Even if they attend but do not cooperate wholeheartedly in searching or capturing swiftly, the penalty is two years of penal servitude. If dispatched by the Celestial Treasury for other matters, no penalty shall be imposed.\n\nFor seasonal epidemics causing people to suffer from sores, swellings, or wandering pains, the gods under the jurisdiction of the Twelve-Year Cycle Kings shall, upon receiving orders from the Bureau of Expelling Evil to comply with celestial decrees for suppression, immediately respond and report to the upper realms. Failure to do so incurs one hundred strokes.\n\nMountain, river, earth, and city gods who, upon receiving orders to search for and capture malevolent spirits, deliberately delay, neglect, or allow harm to occur within their jurisdictions shall be sent directly to Mount Tai for judgment. Those in charge who fail to detect such negligence shall receive one hundred strokes.\n\nFor city gods or local deities found to have committed offenses, reports shall be submitted to the Northern Culmen for decrees, with the Three Officials conducting investigations and the Bureau of Expelling Evil executing the orders.\n\nWhen disasters or great epidemics within a region cause harm to people, livestock, or animals, the Year-King gods shall be notified to withdraw the poison, and the upper realms shall be informed. Failure to comply incurs one hundred strokes.\n\nFor prisoners long detained and suffering unjustly, whose cases are not redressed despite clear evidence of wrongful accusation, the local city god or prison deity shall be commissioned to reveal the truth, prompting officials to reexamine the case and execute justice accordingly. Failure to do so incurs one year of penal servitude. If the prisoner is truly subject to karmic retribution, no penalty shall be imposed.\n\nDivine generals, officers, or soldiers who leave their commanding exorcism officer without authorization shall receive one hundred strokes. In urgent shortages, they may be temporarily borrowed from nearby temples, not exceeding five hundred persons. Upon completion of the task, rewards and merits shall be reported to the relevant authorities for recognition.\n\nGods or spirits who, upon receiving orders from the Celestial Treasury, delay for five days shall receive one hundred strokes. For every ten days of delay, the penalty increases by one degree, with a maximum of three years of penal servitude. Those with valid reasons shall report to the Celestial Treasury.\n\n**Tai Jia Gate: Two Articles**\nFor malevolent spirits in forests or valleys causing repeated harm to people, the penalty is death. Those under their jurisdiction not directly involved shall be sent to Mount Tai for disposition. Failure to detect such occurrences within their jurisdictions incurs one hundred strokes. Those who collude in the offense shall receive the same penalty.\n\nFor sacred trees or groves widely revered by people but failing to bestow blessings upon those who establish shrines and pray, they shall be removed. If no harm is caused and they genuinely bring fortune to people, their merits or lack thereof may be reported. Failure to comply incurs one hundred strokes.\n\n**Tai Wu Gate: Seventeen Articles**\nFor creatures produced and nurtured by the earth’s *qi*, during years of disaster, they must emerge from their habitats. If gods or spirits, without cause, move about, stir winds and rains, and thereby damage crops or harm lives, they shall be exiled one thousand *li*. Immortal officials shall apprehend offenders of the Six Earths and report to the Celestial Treasury.\n\nGods or spirits who steal property worth one thousand coins or more shall be exiled two thousand *li*. For amounts less than one thousand coins, the penalty is two years of penal servitude. For property dedicated to perpetual offerings, regardless of quantity, the penalty is death.\n\nLocal deities who deliberately allow malevolent spirits to harm their jurisdictions shall be reported by the Day-Patrolling Deities. Failure to do so incurs one hundred strokes.\n\nFor those managing documents and suppressing demons, if the assigned Day Officers or officials cause delays, unclear submissions, or damage to documents, they shall receive one hundred strokes. Those who privately open or peek at sealed documents shall receive two years of penal servitude. For leaking or losing memorials, the penalty is exile of three thousand *li*.\n\nGods or spirits who arbitrarily seize human souls shall be exiled three thousand *li*. If death results, the penalty is execution.\n\nGods or spirits who, when summoned, fail to attend or show disrespect shall receive three years of penal servitude.\n\nGods or spirits not assigned to the mortal realm shall not mingle with the living. Violators shall receive one hundred strokes. Exiled immortals from the Celestial Treasury are exempt. Those who falsely assume identities to demand sacrifices shall receive two years of penal servitude. For serious harm, they shall be sent to Mount Tai for disposition. Those who resist arrest shall be executed.\n\nGods or spirits who, without cause, lurk in people’s homes, stir up malevolence, and fail to leave after one night shall receive one hundred strokes. For every five days, the penalty increases by one degree, with a maximum of two years of penal servitude. Those who refuse to leave after being ordered shall be executed.\n\nFor people suffering from prolonged illnesses, dreaming of or communicating with ghosts or demons, the local earth deity shall report the matter to Mount Tai for execution. Failure to do so incurs one hundred strokes.\n\nOfficials of the Bureau of Expelling Evil who, upon receiving celestial talismans, order local mountain and earth deities to capture malevolent spirits but fail to act promptly or show disrespect shall receive one year of penal servitude.\n\n**Zheng Yi Gate: Four Articles**\nFor all waters, regardless of size or depth, that nourish crops but do not do so seasonally, the Nine Rivers Water Emperor shall assess their merits or faults and report accordingly. Failure to comply incurs one hundred strokes.\n\nDragon gods residing in rivers, lakes, or deep pools, if they have designated domains, shall be properly worshipped. If they, without cause, roam during storms and harm crops, the penalty is one year of penal servitude. Those who demand sacrifices shall receive two years of penal servitude.\n\nThe Water Bureau officials who divert water, causing floods that damage fields, houses, crops, and harm fifty or more households shall be exiled three thousand *li*. If fewer than fifty households are harmed, the penalty is three years of penal servitude. In times of natural disasters or regional anomalies, no penalty shall be imposed, but a detailed report must be submitted.\n\nDragon gods or spirit masters residing in rivers, polluted streams, or other waterways who deliberately obstruct boats or vehicles to demand sacrifices shall receive two years of penal servitude. Those who recklessly summon wind and rain, capsizing fields and houses and causing loss of life—one person exiled three thousand *li*, ten executed, and over ten annihilated—shall be punished accordingly. Interfering with the guardianship of lakes or deep pools incurs the same penalty. Local deities who fail to intervene shall be equally culpable.\n\nSpirits or ghosts responsible for summoning rain who, in times of drought or suffering, collude with water deities to conceal and withhold relief shall receive three years of penal servitude.\n\n**Six Articles of the Wandering Dead**\nIf the deceased hold grievances against the living, having previously petitioned the Underworld but unresolved, and forcibly enter a household to commit malevolent acts, harming others or seeking retribution through merit, even without taking lives, but causing disturbances or instigating disputes among the innocent, they shall be sent to the Underworld for annihilation.\n\nSpirits or malevolent entities that manifest visibly or invisibly, set fires, spill blood, or manipulate livestock to frighten or harm the living shall be exiled three thousand *li*. If they cause loss of life, they shall be executed.\n\nGhosts or spirits that set fires in human dwellings, or heat chests and cabinets to burn property or homes, resulting in ten or more households affected, shall be executed. If fewer than ten households are harmed, the penalty is three years of penal servitude, and they shall be sent to Fengdu for hard labor. Those who knowingly allow or abet such acts shall be exiled three thousand *li*.\n\nAncestral spirits, ghostly apparitions, ancient artifacts, or unnamed ghosts that falsely claim affiliation, linger in the world after death, and refuse to depart shall receive one year of penal servitude. Those who falsely assume authority, demand sacrifices, or harm the living shall be exiled two thousand *li*. Local deities who know and fail to intervene shall share the same penalty.\n\nSpirits or ghosts that harm the living and resist capture or concealment shall receive three years of penal servitude. Those who resist arrest and engage in combat with officials or soldiers shall be executed.\n\nLonely, wandering spirits that exploit the newly deceased to cling to the living and make demands shall be exiled one thousand *li*. If they cause loss of life, they shall be annihilated. If they are family members or relatives who, due to neglect in offerings, cause disturbances, they shall be appeased with food and sacrifices, and persuaded to depart. If, after receiving offerings, they continue to harm the living, they shall be sent to Mount Tai and bound in the register of lesser ghosts.\n\n**Five Articles of State Sacrifices**\nSpirits or ghosts not recorded in the state sacrificial canon who recklessly cause disturbances, deceive the people, and claim to bring fortune or misfortune shall be exiled three thousand *li*. If they cause loss of life, they shall be annihilated.\n\nSpirits or gods not recorded in the sacrificial canon but who bring blessings to the people shall have their merits examined and reported for consideration of honors. If they boast of their deeds and recklessly cause disturbances, spreading illness and demanding sacrifices without relenting, they shall receive three years of penal servitude. If they cause loss of life, they shall be exiled three thousand *li*; if ten are harmed, executed; and if over ten, annihilated.\n\nLocal community shrines within their designated boundaries, or those along water and land routes recognized as spiritually efficacious in the yang realm and included in the sacrificial canon, shall not accept improper sacrifices or curses against lives. Violators shall be investigated, reported to the Three Officials, and subject to severe demotion or promotion as deemed appropriate.\n\nBlessed spirits in the sacrificial canon that harm the people shall have their offenses reported for imperial judgment.\n\nMeritorious officials, virtuous individuals, or worthies enshrined after death who later harm the people shall be immediately expelled. If they refuse to depart, they shall be reported to Mount Tai, with their offenses fully documented.\n\n**Two Articles of Urgent Memorials**\nUrgent memorials shall receive a response within two reports. For matters of utmost celestial urgency, where earthly and mountain deities dispatch spirit officials, the timeframe may differ. Those who fail to report on time or make errors in transcribing memorials shall receive one hundred strokes. A second memorial may be submitted while awaiting a response. If the Bureau of Expelling Evil errs in reporting, no penalty shall be imposed.\n\nMemorials of extreme urgency shall be reported within one day; those of secondary urgency within three days; and routine matters within seven days—all referring to memorials submitted to heaven. All must be transmitted via official channels, passing through local deities for escort beyond their jurisdiction. Those who obstruct, detain, or delay shall receive one hundred strokes for one day, with the penalty increasing by one degree for every ten days, up to a maximum of three years of penal servitude. For matters of grave harm, the circumstances shall be fully reported.\n\n*End of the Upper Scroll of the Upper Clarity Ghost Statutes of the Essence and Marrow of the Dao*\n*Beginning of the Middle Scroll of the Upper Clarity Ghost Statutes of the Essence and Marrow of the Dao*\n\nThe Purple Tenuity Palace Attendant, Daily Duty Primordial Lord Ráo of the Cavern-Heaven, having rectified and received the *Great Cavern Record of the Upper Clarity*, now practices the *Orthodox Rites of the Celestial Heart*—Dèng Yǒugōng’s revised edition. **Sixteen Statutes of the Jade Canon:**\n\nAll officials of this institute shall wear ritual vestments, star-crowned headdresses, and vermilion shoes. Those not engaged in subduing demonic spirits shall not don them; violators shall be sentenced to one year of penal servitude. Those who, without cause in ritual matters, trouble spirits and deities shall be sentenced to two years of penal servitude.\n\nAll officials of this institute, appointed by the *Jade Registers of the Upper Clarity* and governing the demonic spirits of the Three Realms, shall receive the orthodox talismanic writs of the *Central Scriptures*. These shall be inscribed in vermilion and black ink on yellow-flowered silk, bound into scrolls, and duly conferred. The master shall admonish them with strict precepts, and all matters pertaining to the rites—secret incantations and sacred texts—shall be transmitted orally and memorized. None shall be concealed or omitted; violators shall be investigated by the Three Offices.\n\nIf any ritual official, capable of transmitting the orthodox rites to a person of the Dao, performs acts of salvation that move the spirits, they may submit an annual memorial for consideration, and exceptional merit shall be rewarded without regard to rank.\n\nThose who fail to memorialize suitable candidates or memorialize unsuitable ones shall be sentenced to one year of penal servitude. Those who transmit seals and oral instructions without prior memorial shall incur the same penalty. If the master becomes aware of such acts within the prescribed period and fails to report them, the penalty shall likewise apply.\n\nIf, after being memorialized, one disobeys the master’s instructions or violates ritual propriety, the penalty shall be one year of penal servitude. In cases of grave harm, the master shall report the facts in full, first executing the offender, then punishing their nine clans.\n\nIf a Daoist transmits the orthodox rites to save the people, but the master obstructs them for personal gain, the master shall receive one hundred strokes. If bribes are accepted, even one bolt of silk shall incur one year of penal servitude. For every ten bolts, the penalty shall increase by one degree, up to a maximum of three years of penal servitude, and the master shall be demoted by two ranks in ritual office. Accepting less than one bolt shall incur one hundred strokes. Offerings of wine and food shall be treated likewise.\n\nRitual officials who each year save twenty critically ill persons shall be promoted by one rank. Those who save more than twenty shall be advanced in office according to the celestial register, their merit and conduct memorialized for promotion. If, when petitioned, they refuse to accept cases or delay salvation, or if they falsely promote others in ritual office, they shall be sentenced to one year of penal servitude.\n\nThose who falsely claim ritual office before being memorialized shall be sentenced to two years of penal servitude. If, after memorialization but before the response arrives, improper recommendations or investigations are made, or if one falsely claims a master-disciple relationship, each shall incur two years of penal servitude.\n\nNewly appointed officials of this institute shall practice celestial talismans, star-seal incantations, and pacing the stars, inscribing them on plates of gold, jade, fragrant wood, or other materials. Upon completion, they shall wash the inscriptions away with fragrant water and cast them into flowing waters; violators shall be sentenced to one year of penal servitude.\n\nThose who recklessly transmit the orthodox rites to unworthy persons for profit, or who accept payment but later refuse to transmit them, shall be sentenced to two years of penal servitude. The same penalty applies if no payment is received. Those who falsely present other methods as the orthodox rites shall be sentenced to three years of penal servitude.\n\nThose who show the orthodox rites or ghost statutes to unworthy persons, or who lend or entrust them to others for copying, thereby disrespecting or mocking them, or who discuss or reveal their secrets to uninitiated persons, shall be sentenced to three years of penal servitude. Those who use the rites to toy with spirits shall be sentenced to one year. Those who deliberately cause others to use the rites to entrap spirits shall be sentenced to two years. If death results, the penalty shall be exile to three thousand *li*. Those who fail to maintain solemnity and purity while reading the texts shall be exiled to two thousand *li*.\n\nAll memorials to the Upper Clarity shall be submitted through the duty-day functionaries, and documents shall be transmitted to the Five Marchmounts to dispatch local earth deities to capture malevolent spirits. The institute’s divine generals, officers, and soldiers shall be assigned to execute the decrees according to the gravity of the matter. Those who fail to memorialize when required, or memorialize when not required, shall receive one hundred strokes.\n\nWhen transmitting the celestial scriptures, secret registers, talismans, or orthodox rites to others, one may make copies for storage in the caverns of famous mountains and great rivers, or in stone caskets. When a ritual official’s decrees, talismans, or texts are exhausted upon promotion, all previously received materials shall be burned and cast into rivers or lakes. Only current official documents may be retained. If old ritual vestments, talismans, brushes, ink, vermilion, paper, inkstones, water vessels, coronets, or other worn-out items are not burned but instead wrapped in old vestments and cast into rivers, or if talismans, seals, and other items are buried in cavern-heavens or stone chambers, all such materials shall be concealed according to the oral instructions; violators shall be sentenced to one year of penal servitude.\n\nThose who transmit the orthodox rites shall do so on the days of *jiǎzǐ*, *gēngshēn*, the Three Origins, the Eight Festivals, the Five La days, or their own birthdays. The recipient shall kneel to receive the sword, seal, oral instructions, brush, inkstone, vermilion, and ritual implements, all of which shall be consecrated before use. Any gold, silver, or other valuables received as pledges shall be melted down and sold, the proceeds used for offerings or to aid the poor. None shall be kept for personal use; violators shall be sentenced to three years of penal servitude.\n\nIf a ritual official passes away suddenly, having foretold extraordinary signs, it is a celestial blessing, and their departure shall be swift. If no such signs appear, the authorities shall investigate. If the circumstances are unclear, the heir or kin shall promptly burn the talismanic notices, petitions, and ritual vestments to ashes and cast them into the Yangtze River, notifying the water officials to convey them to the deceased. The underworld authorities shall comply; violators shall be sentenced to two years of penal servitude.\n\nWhen a ritual official’s merit and conduct are complete and they are summoned, their body shall rise twice and fall thrice, like an earthworm. Their ears shall hear the sound of wind, their eyes shall lose their divine light, their celestial pillar shall not rise, and the celestial drum shall not sound. Pain shall arise in the kidney chamber, and their spirit shall surge from the *Yǒngquán* point to exit through the crown. They shall then gather their decrees, registers, talismans, seals, and containers in one place, don fresh ritual vestments, sit upright, and leave final instructions to their heir. Their body shall shed like a cicada’s shell, and a propitious cloud with a celestial retinue shall welcome them, escorting them directly to their cavern-heaven to receive a celestial office and govern affairs.\n\nShould the ritual body sense its decline and prove unable to sustain itself, the local earth deity shall be invoked to assist the heir and kin in securing the decrees, registers, talismans, seals, and containers according to the prescribed method. Violators shall be exiled three thousand *li*; those whose transgressions are grave in both fact and principle shall be put to death.\n\n---\n\nHere ends the *Middle Scroll of the Divine Writ of the Marrow of the Dao: Ghost Statutes of the Numinous Texts*.\nHere begins the *Lower Scroll of the Divine Writ of the Marrow of the Dao: Ghost Statutes of the Numinous Texts*.\n\nCompiled and revised by Deng Yougong, Registrar of the Purple Clarity Bureau, Daily Attendant of the Celestial Office, and Ordained Master of the Great Cavern Register of the Highest Clarity, Practitioner of the Heavenly Heart Orthodox Dao.\n\n**Thirty-Six Articles**\n\nAll authentic ghost statutes, talismanic writs, and scriptures of the orthodox Dao shall be stored in fragrant caskets, brocade satchels, or bamboo containers. When reviewing them, one must enter stillness, establish a sacred boundary, and invoke the spirits before unsealing the scrolls. No more than five may be opened at once. These texts must be guarded in secrecy, lest ghosts and spirits steal a glimpse.\n\nThose among the faithful who drive out evil, uphold the Dao, and truly render aid to beings shall be recorded and memorialized, transmitted the orthodox teachings, and appointed to office with rank.\n\nAll ritual implements within the sanctuary—such as swords, seals, brushes, ink, cinnabar, inkstones, headdresses, footwear, and ritual water—may not be privately used without prior petition and offering.\n\nWhen transmitting the teachings to disciples, the disciple shall approach the master with measured steps, whereupon the master ascends the altar to recite the precepts. The disciple shall then undergo bloodletting, consume the elixir, and divide the ring to break the contract, swearing oaths of allegiance. Next, the master shall confer the esoteric signs, talismanic writs, and revealed scriptures, bestow the true instructions, and kneel to present the official regalia, seals, and swords. The master shall then invoke the Most High, expelling the Three Worms from the four limbs and absolving the myriad sins across the Nine Mysteries. Reports shall be filed with the relevant authorities to ensure alignment with the Heavenly Will.\n\nAll spirit generals, officers, and soldiers—such as those dispatched by the Eastern Marchmount—shall, upon arrival at the sanctuary, be received with offerings of wine, food, paper money, and spirit horses. They shall remain in their assigned posts, prepared for deployment, and may not be privately employed.\n\nWhen ritual masters pass by sacred shrines, they shall form the Mudra of the Heavenly Soldiers, strike the Heavenly Drum, and summon the guardian generals and protective officers within their bodies to accompany them, thereby manifesting majesty. The spirits shall then submit in awe.\n\nRitual masters shall, at dawn, absorb the vital *qi* of the day’s dominant phase. When drafting memorials or conducting rites, they shall not burn frankincense.\n\nAll human lives are endowed by Heaven with allotted lifespan and fortune. If, after this sanctuary’s intercession, the afflicted still do not recover, it is because their fate is exhausted and their kalpa has ended. In such cases, further petitions and documents shall be futile.\n\nWhen aiding and delivering the world, the language of petitions and decrees must not be convoluted. Speak only with utmost sincerity, and clearly state the nature of the supplicant.\n\nThe fate of all lives is governed by the celestial bureaus; to petition for the restoration of lost fortune or reduced lifespan falls beyond the scope of present supplications, yet the karmic response shall be made manifest.\n\nFor all who submit complaints of madness, heresy, or demonic disturbances, the ritual master shall transform into a divine form to receive their words, affix the seal, and dispatch the decree.\n\nIn all offerings and rites, beyond the presentation of paper money and horses to the Three Clarities and the Jade Emperor, no untimely acts of irreverence shall be permitted. When burning paper money and horses, first combine them with silk of the five colors as a token of sincerity, then dispatch the *gongcao* and *zhifu* spirits to convey them.\n\nFor all rites and petitions directed to the Three Clarities and the Jade Emperor, a single *Cai Fang* Envoy may be positioned beside the throne, but no other deities shall approach the imperial seat.\n\nWhen entering the oratory to burn incense and conduct affairs, all texts written in the course of ritual practice must first be covered with the Dipper’s lid, shielding them from profane eyes.\n\nFor those who come to invoke vengeance upon killers who caused death, employ the *xuan* lid to suppress them.\n\nWhen treating cattle, horses, or other livestock afflicted by pestilence, inquire into the number of losses, then petition the Year-Ruling Deity to expel the harm.\n\nFor all who present offerings of faith, assess their sincerity before accepting, setting the price at three parts: one for sacrificial offerings, one for distribution to the poor, and one for the sustenance of the Dao.\n\nFor those who resist the documents of judgment in cases of illness or imprisonment, seize and detain them for adjudication.\n\nFor those possessed or tormented by malevolent spirits, causing depletion of the heart and kidneys, administer talismans for ingestion and wearing to suppress the affliction.\n\nFor children suffering from night terrors and nocturnal crying, pacify the household stove and eaves deities, the Four Heavenly Kings, and the Flying Swift Spirits, employing the Three Luminaries Talisman to remedy the condition.\n\nAll ritual masters who daily deliver the world must use the funds for the sustenance of the Dao without accepting bribes from the people, for Heaven naturally bestows its blessings. When resources are lacking, present a memorial with utmost sincerity, and unseen aid shall arrive without want. If one recklessly accepts worldly goods, the means for practice shall be insufficient.\n\nFor households whose stoves, shops, or businesses are afflicted by malevolent hexes or closures, employ the Three Luminaries Talisman to dispatch spirits for resolution.\n\nFor all construction or renovation projects, petition the Great Year Deity to placate the local Earth Deities and other spirits under its jurisdiction, preventing harm from arising.\n\nFor strange occurrences in ponds, embankments, or dikes—whether from irregular repairs, untimely damage, or persistent harm—summon the local Earth Deity to expel the disturbance. If the affliction persists, employ the Three Luminaries Talisman to suppress it, and those who defy expulsion shall be adjudicated by law.\n\nWhen epidemics spread and people suffer from illness, follow the prescribed procedures to commission the local Earth Deities and other spirits, then petition the Year-Ruling Deity to withdraw the toxic *qi*. For cases requiring an urgent memorial, the ritual master of this sanctuary shall perform the *Yu Bu* step, transform into a divine form, and silently recite the oral petition to report the plight of the orphaned and destitute.\n\nFor men and women who are impoverished and childless, first employ ritual to repel the Three Punishments and Six Harms stars, then bestow talismans for wearing.\n\nFor those whose dwellings are inauspicious, where *yin* and *yang* are disharmonious, and where upper and lower clash, leading to years of hardship and misfortune, confer upon them the Orthodox Register.\n\nThe *Rites for Receiving the Precepts* in the transmission of the Orthodox Dao states: The Dao is cultivated in oneself yet applied to others, and the power to transform through the Dao arises from the rectitude of the heart. With a rectified and enlightened heart, one may guide others, and none shall remain unaligned. Thus, the myriad dharmas arise from the heart and are transformed by it. By rectifying one’s own heart to align with the celestial heart, none shall fail to receive its rectitude.\n\nTo conduct oneself in the Dao is to correct the deviant, and no deviation shall fail to submit. Yet the conduct of the crooked and perverse stems from an unrectified heart, led astray by external things. When external deviations obscure the inner, and clarity is lost within, the true nature is diminished, and delusion runs rampant like a hunt, driving the heart to madness—this is the obscuration of external things.\n\nLike the intoxication of wine that unsettles true nature, the lust for beauty that muddies true sentiment, the pursuit of wealth that forgets benevolence and righteousness, or the biases of love and hatred that distort right and wrong—all arise from emotions that obscure the ultimate principle, constituting the greatest peril. These align with the Three Evil Karma and bind the Three Officials, perpetuating the cycle of the Three Realms without respite.\n\nNot to kill is benevolence. Not to steal is righteousness. Not to engage in licentiousness is propriety. Not to deceive is trustworthiness. Not to be deluded is wisdom. The six roots and seven emotions, along with the transgressions of the ten evils, must be guarded against.\n\nTo neglect the support of parents, disrespect teachers and friends, disregard the orphaned and young, fail to repay the nation’s grace, withhold true faith, or disregard hierarchy—these must be strictly avoided.\n\nOne must restrain body and mind, revere the celestial Dao, study the methods of the Most High, benefit oneself and others, and transmit the Dao to future generations. Trust and serve teachers and friends, heed their teachings, honor the enlightened, uphold faith and righteousness, avoid rebellion, refrain from corrupt bribes, and never defy Heaven or betray Earth. Even a single transgression brings unforgivable sin; the Dao’s power wanes, and the individual suffers calamity, while the nine clans share in the guilt.\n\nOne must take refuge in the Supreme Dao and its boundless methods. Only after the immeasurable multitude has sworn this great oath may the esoteric formulas of the Shangqing be transmitted, to assist Heaven in its transformations, aid the nation and deliver the people, heal the sick and rescue the imperiled, expel the deviant and uphold the upright.\n\nBefore the assembly of the Great Dao and the exalted perfected, with heartfelt devotion and spoken words, from this day forward, uphold this covenant without fail. Bowing deeply, one is moved to the utmost gratitude.\n\nThe above rites are performed upon ascending the altar, with all officers joining in the chant.\n\nFor all matters addressed, assess their gravity and conduct the rituals without recklessly mobilizing the divine generals, officers, or soldiers. When receiving and dispatching written complaints, do not falsely implicate spirits or deities in wrongdoing.\n\nFor the transmission of the Orthodox Dao, on the designated day within the ritual period, conduct an offering rite known as the *Transmission Offering*. Present 120 portions of paper money and horses, with the deities of the memorial and offering rites listed in order of veneration. If half the amount is offered, it shall be accepted.\n\nAfter reporting to Heaven and Earth and receiving the official appointment, and once the guarantor’s statement is complete, proceed to bestow the talismanic formulas, official decrees, and authentic registers in accordance with the ritual.\n\nTo report to the Eastern Peak for transfer and reassignment, inscribe the name in the celestial registers, thereby petitioning for the pardon of the nine familial clans to depart the nether realms and ascend to the realm of the living. The sequence of ritual proceedings upon the altar shall follow the original method.\n\nAll officials of the Demon-Quelling Court shall be addressed as *Grand Commanders*, governing the demonic forces across the Three Realms. Initially, one is appointed as *Right Vice-Judge*; next, *Right Grand Judge*; then *Left Vice-Judge*; and finally *Left Grand Judge*—all of whom shall concurrently oversee the affairs of the Court. Those whose merit and achievements are eminent shall ascend to the ranks of immortals and be appointed as *Grand Daoist Masters and Co-Judges of the Court*. Further, those who, within a year, have rescued twenty or more people during calamitous years of drought, flood, or famine, and whose prayers yield immediate results, shall be promoted to *Grand Master of the Nine Heavens’ Golden Gates*.\n\nNext, in ascending order: *Minister of the Water Department*, *Minister of the Wood Department*, *Minister of the Earth Department*, *Minister of the Metal Department*, and *Minister of the Fire Department*—these ranks apply to those who have saved more than twenty lives in a year. Those whose merit in averting great disasters is exceptionally profound shall be progressively promoted to *Purple Tenuity Palace Envoy* and *Day-Watch Primordial Lord*, the latter granted to those who, by year’s end, have aided the state in disaster relief, pacified the land, and dispatched ghostly soldiers to secretly assist the imperial reign in achieving peace. Those who, within a year, can expel or eradicate locust plagues and monstrous calamities from the designated celestial sectors shall be appointed as *Censor of the Nine Heavens’ Golden Gates*.\n\nFurther, those who, within a year, may vow to establish altars in renowned mountains, submit memorials, and offer prayers for the sovereign’s longevity—with verifiable efficacy—shall be elevated to *Golden Gates Supreme Immortal and Attendant-in-Ordinary*. Those who, within a year, attain self-realization beyond the mundane, guide the deluded from the Five Sufferings, and personally journey to the Southern Bureau to inscribe their names—thereby ensuring the sage rule of the sovereign, the virtue of ministers, the ascent of the nine clans to heaven, and the benefaction of all beings—shall be promoted to *Purple Palace Grand Chancellor*. The subsequent ranks are: *Mystic Capital Grand Chancellor*, *Supreme Mystic Grand Chancellor*, *Supreme Ultimate Grand Chancellor*, and *Golden Gates Grand Chancellor*.\n\nThose who, within a year, fully realize the boundless Dao, transcend reliance on written scripture, and through direct instruction achieve verifiable results—such as quelling the harm caused by dragons in rivers, lakes, seas, or landslides, and whose deeds truly benefit the state and deliver the people while excising great calamities—shall be elevated to *Supreme Ultimate Grand Chancellor*. From *Day-Watch Primordial Lord* to *Supreme Ultimate Grand Chancellor*, these nine ranks of promotion entail the conferral of the *Nine Grades of Supreme Clarity Registers*, after which one may enter this system of regulations. All other ranks shall follow the protocols of the immortal officials.\n\nThe Three Primordials serve as the foundation, with the *Cavern Spirit* rank and below proceeding in sequence, beginning with the *First Lesser Primordial* as *First-Rank Immortal Official* and *Supervisor of the Northern Culmen Demon-Quelling Court*. The *Middle Primordial* as *First-Rank Immortal Official* and *Judge of the Northern Culmen Demon-Quelling Court*. The *Upper Primordial* as *First-Rank Immortal Official* and *Judge of the Fengdu Court*. Those whose merit, conduct, and karmic deeds are exemplary shall ascend in sequence, their persons entering the Golden Gates to attend the Three Clarities.\n\nWhen issuing talismans of the Three Clarities, the Jade Emperor, or the Three Luminaries of the Northern Dipper, the officiating official shall transform into a deity and submit a memorial detailing the purpose of the petition, declaring: *\"Your servant, in accordance with the prescribed rites, now dispatches this decree. May it be as I have stated.\"* Upon concluding the prayer, the talisman-bearing messenger shall be immediately dispatched, and upon its arrival, the decree shall be executed.\n\nAll officiating officials, when entering or exiting, shall constantly visualize the presence of the Six Ding, Four Straight Earth Deities, and Seal-Monitoring Valiant Spirits, commanding them through ritual to follow without fail. When officiating officials ascend to the Celestial Court to expel pestilential demons or sever malevolent influences, they must first don the Northern Dipper of the Three Terraces and transform into the *Envoy of the Demon-Quelling Court*.\n\nAfter presenting the memorial and petition to the Celestial Emperor, proceed to the Celestial Pivot Court to command the Four Heavenly Kings, Twelve Great Deities, Eight Vajras, Six Ding and Six Jia, Marshals Tianpeng and Tianyu, Firebell Generals, and the Five Thunder Wind-Rain Deities, and exit through the Celestial Gate.\n\nWhen establishing a celestial prison, a memorial must be submitted to inform Mount Tai, detailing the proceedings and stating: *\"On such-and-such a day of such-and-such a month, a celestial prison was established in such-and-such a direction.\"* Memorialize the Celestial Emperor regarding the *Five Dipper Prison*, adhering to the twelve prescribed protocols.\n\nThe seal of the Demon-Quelling Court shall measure one *cun* and eight *fen* in width, crafted from gold or jade, and inscribed with celestial script. Seals made from thunder-struck wood are also permissible. Summon the Six Ding and Six Jia messengers to establish a boundary for its protection. Once placed, apply red cinnabar to the seal’s surface, first memorializing the upper realms. Only this seal may be used for all talismanic inscriptions in the ritual method. Next, match the seal with the official’s signature and floral cipher, report to the Eastern Peak for verification, and only then may it be employed.\n\nYour servant, the *Perfected of Universal Reception from the Grotto-Heavens*, having received the celestial script of the *Demon-Quelling Court and Grand Daoist Master’s Stellar Seal* from instruction, transcribed two copies and buried them in the original site. The seal’s dimensions were then compared: the large *chi* measures one *cun* and eight *fen*, equivalent to two *cun* and one *fen* of the small *chi*, or two *cun* and four *fen* of the millet *chi*—all identical. These measurements, as ordained by celestial law, confound even spirits and deities within the minutest fraction, and are thus established here as the fixed standard for ritual regulation.\n\nWhen inscribing celestial script talismans and registers, use water from the *Celestial Virtue* and *Monthly Virtue*, brushes of the Six Ding and Six Jia, ink of the Black Emperor, cinnabar of the *Luminous Solar Essence*, and inkstones of the *Five Dragons’ Treasure*—all prepared in accordance with the transmission method. Only after memorializing the upper realms may they be employed.\n\nWhen subduing fierce and ferocious spirits, it is essential to dispatch divine generals, while simultaneously forming mudras with the left and right hands and invoking the Dipper’s canopy over oneself. Proclaim the decree: *\"Your transgressions have been absolved. My intent is to save the people.\"*\n\nWhen conducting offering rites to beseech the stars for disaster aversion, first memorialize the *True Lords of the Constellations* with the prescribed documents. Then, seated, declare: *\"Your disciple beseeches for disaster aversion, the accumulation of blessings, the prolongation of life, the substitution of calamities, and the augmentation of fortune and emolument. Humbly prepared, may the enlightened perceive my sincerity.\"*\n\nWhen reciting the *Northern Dipper Mantra* during the *Perfected’s Dipper Steps*, halt at the *Celestial Pivot*, flick the seal mudra, and then point with the *Celestial Pivot Seal*. If reciting the mantra within a talisman, begin with the star *Greedy Wolf*.\n\nWhen making offerings to the deities, record the dates using the *Six Jia* days of the four seasons: spring, summer, autumn, and winter.\n\nIn spring, the six *Jia* days; in summer, the six *Bing* days; in autumn, the six *Geng* days; in winter, the six *Gui* days. On these days, outside the door, offer three portions of vegetarian fruits, incense, jujubes, and soup to the *Direct Attendants of the Three Realms* and the *Four Duty Merit Officers*. First, erect an earthen altar, then place earthen coins. Thereafter, declare the intent:\n\n*\"By the decree of the Jade Emperor, I assist in the transformation of the Dao and aid the state in delivering the people. In all talismanic rites, I sever and eradicate malevolent spirits that bring calamity, cure illnesses, succor the perilous, bestow blessings, and invoke auspiciousness—all relying on you, the messengers, to convey these matters to the divine assemblies above and below. Today, I present wine, fruits, coins, and horses in offering. Humbly, I beseech the messengers to extend their compassion, radiate their majestic light, and bestow their numinous protection.\"*\n\nNext, pour wine thrice, burn the coins, recite the incantation, and swear to the *Merit Officers*:\n\n*\"I have heard that those who cultivate the Great Dao in former lives now become supreme spirits, none but those whose merit and conduct take precedence, whose devotion to saving the people is paramount. Thus, they manifest in the unseen, traverse the nether realms, emerge from water, and enter fire. Their transformations are myriad, their might pervades all forms. Armed with halberds and clad in armor, bearing drums and lifting bells, they move freely without hindrance. At their presence, evil demons shatter in fear, and the afflicted find peace. I wield the Orthodox Dharma to subdue demons, relying on your awe-inspiring might to assist me—subjugating malevolent spirits, severing the roots of calamity, bestowing fortune upon the virtuous, and ascribing merit to the Way of goodness. Today, with these offerings, I modestly repay your divine merits, slightly express gratitude for your toils, and deeply honor your strenuous efforts. Humbly, I invite each of you to feast and drink to satiety.\"*\n\n**Oath to the Divine Generals:**\n*\"May you all feast and drink to satiety, then compose your majestic demeanor. Strictly observe the celestial precepts, reverently heed the Emperor’s command. Wield the authority of martial prowess to achieve the merit of pacification. May your illustrious achievements be fulfilled, and your resounding responses be clear. By the decree of the Five Marchmounts, you, the divine generals, officers, and soldiers, are dispatched. All possess concealed martial prowess and long-nurtured strategies. Your reputation is pure and stern, your virtue and bearing heroic and majestic. Responding to the command of the Marchmounts, you are entrusted with the authority of punitive expeditions. At your tremors, malevolent specters shatter in form; at your glares, wind and clouds change color. Where your numinous halberds point, great evil cannot prevail. Assisting the state, delivering the people, benefiting the times, and aiding all beings—devote your hearts to the Dao, and none should covet merit. Those in this court have long received immortal decrees. Though this humble Daoist has presumptuously assumed the authority of a celestial officer, I rely solely on your numinous protection. Above, may it guard my body and preserve my life, as I study the Dao and serve Heaven, aiding my true self in aspiring to celestial rank. In the middle, may it manifest the sagely transformation, illuminate and spread hidden merits, and through this mighty power, fulfill my aspirations. Below, may it deliver people and benefit beings, cure illnesses and expel evil, punish malevolent demons, and bring abundant fortune and prosperity. May these layered merits be achieved, and their efficacious responses resound. May your hidden virtues be renowned, and may you share in these merits. May all honors be bestowed according to the conveniences of the age, and may we together uphold the Orthodox Dharma’s supremacy. Benefit without harm, awe with discipline. In all matters, deficiency harms the mean; losing harmony injures beings. Defying Heaven invites punitive expeditions—execute and eradicate evil. Assist the upright with divine merit to overcome malevolent power, and with wondrous transformation to overcome treacherous schemes. Who can withstand this? None can oppose. Only you, the divine, assist my Great Dao. Hasten, hasten, in accordance with the statutes and ordinances!\"*\n\nTo all divine generals, officers, and soldiers, entrust the Dharma seals and charge them to constantly guard and uphold the rites.\n\n**Orthodox Dharma Placard Format**\n**Northern Culmen Exorcism Court:**\nThe generals, officers, and soldiers currently under the jurisdiction of this court are dispatched by the Jade Emperor’s life-saving decree to this court to protect the Dharma, transform the world, assist the state, deliver the people, and guide all beings to the Orthodox Dao. It is feared that they may be unaware: this court possesses a celestial seal, either one *cun* and eight *fen* square, two *cun* and one *fen* square, three *cun* square, or five *cun* square. It commands trillions of celestial soldiers. Each stroke and line of the seal’s script conceals thirty-six trillion soldiers and generals, who turn with my seal. At its presence, evil demons shatter in fear, and the afflicted find peace. Bestowed by the Supreme Emperor, celestial warriors bear it aloft, following my commands. The soldiers and generals within the seal number trillions, coming and going like the wind, formless and boundless, their transformations inexhaustible. Concealed within my seal, they appear when summoned. Sometimes they manifest as colossal forms, filling the void, their heads bearing Kunlun, their shoulders the sun and moon, their hands grasping the Emperor’s bell, their feet treading *kui* dragons. Sometimes they appear as minute forms, entering a speck of dust or a strand of hair. Behold their mighty power, upholding the Orthodox Dharma, transforming endlessly to deliver sentient beings, never boasting of their merit. Their wondrous might and Daoist arts are boundless. It is feared that the generals, officers, and soldiers under this court’s command may be unaware of these statutes and willfully disobey or neglect them. If they are sent to receive punishment, this court shall not be lenient. Now, the celestial soldiers and generals, as well as the Marchmount soldiers and generals, are divided into rotating shifts, prepared for urgent matters. When summoned by this court, they must hasten immediately. If not on duty or called, they are to conceal and submit themselves within the Six Directions. The following are specified:\n\n- Celestial soldiers, generals, and officers must always be prepared for summons. If not called, they may not leave the celestial realms without authorization.\n  - Southern Dipper celestial soldiers: 3,600.\n  - Black-Killing divine soldiers: 50,000.\n  - Northern Dipper division soldiers and generals.\n  - Three-Five division soldiers and generals.\n  - Orthodox division soldiers and generals.\n  - Radiant Light division soldiers and generals.\n  - Celestial *Ding* deities.\n  - Celestial warriors.\n  - Vajra deities.\n  - Great Brightness deities.\n  - Flying Dragon mounted officers: 1,000.\n  - Dragon-Slaying mounted officers: 1,000.\n  - Dragon-Centralizing mounted officers: 1,000.\n  - Dharma-Assisting Generals: 2.\n- Generals dispatched from Mount Tai are to be divided into two shifts, alternating daily, accompanying the Dharma-officiating officials of this court in their comings and goings. In cases of urgent matters, this does not apply.\n\nThe aforementioned troops and officers are to be stationed solely within this court, without any negligence or disrespect. They shall remain under the command of the Dharma-Assisting Generals.\n\n- One General to constantly oversee and command the troops.\n- One Dharma-Assisting General.\n- Cavalry and infantry soldiers: a designated number.\n- Personnel dispatched from the Eastern Peak Pass.\n\nThe above-mentioned troops, officers, and divine functionaries are hereby ordered to be publicly announced. All are to carefully heed the preceding directives and comply accordingly. Any violation, however slight, shall not be lightly forgiven. Those among you who render meritorious service shall be duly rewarded and commended. A memorial shall be submitted to the celestial realms, whereupon they shall be bestowed with divine blessings. Let this be proclaimed without falsehood; all should take heed.\n\nProclamation issued on the ___ day of the ___ month of the ___ year.\n\n[Official title, name, and seal]\n\n**Petition for Transmission of the Dharma from Disciple to Master**\n\nDisciple [Name], residing in [State, County, Township, Village, Hamlet], born on the ___ day of the ___ month of the ___ year at the ___ hour, under the governance of the [specific] Star Lord of the Northern Dipper.\n\nRespectfully offering:\n- Nine taels of yellow gold, a pair of gold rings, and one bolt of plain silk as tokens of sincerity.\n- Four taels of black silk thread, representing ten thousand strands of hair.\n- Seven taels of cinnabar, substituting for the blood of oath.\n\nWith reverence, [Disciple] presents these before the Dharma Master [Name], seeking to receive the transmission.\n\nThe Heavenly Heart Orthodox Dharma,\nIntended to aid the Dao in its transformative work,\nTo serve the state and deliver the people.\n\nThis disciple, observing the fate of the fleeting world,\nHas long grieved for this fragile, imperiled body.\nAshamed of my inability to eradicate harm,\nAnd my lack of means to promote benefit.\nNeglectful in cultivation, my dread runs deep.\n\nWho could have foreseen that, after countless kalpas,\nThis day’s encounter would be my fortune?\nI have learned that [Dharma Master’s Name]\nDoes not obstruct the path to the Mystic Capital,\nBut uniquely propagates the wind of the Most High,\nEmbracing the resolve to uphold the One Dharma.\nEnhancing the radiance of the Daoist teachings,\nExtending a hand to deliver all beings.\nBreaking through the dust-laden cage,\nI, with my withered and decayed roots, aspire to grasp it.\n\nRelying above on the power of your nurturing,\nIn my own conduct, how dare I transgress?\nIf I were to forget the grace of your instruction,\nI would willingly endure the suffering of eternal submersion.\nHaving turned toward deliverance,\nI will exhaust my devotion in practice.\nMeeting this mysterious destiny,\nI will dedicate my heart to repayment.\n\nHumbly I beseech [Dharma Master’s Name]\nTo open wide your compassionate creation,\nAnd deign to regard these humble, dust-tainted words.\nI implore your merciful consideration.\nMy heart below is utterly without pretense,\nLonging for your grace to the utmost.\n\nRespectfully submitted.\nOn the ___ day of the ___ month of the ___ year.\n\nPetition for a Master’s Endorsement\n\nThe disciple, [Surname] of [Village], [Township], [County], [Prefecture], respectfully states:\n\nOn the ___ day of the ___ month of the ___ year, I personally presented a petition at the abode of the Highest Clarity Dharma Master [Name], seeking to receive the Orthodox Method of the Celestial Heart in its entirety. My aspiration is to assist in the transformative work of Heaven, aid the state and succor the people, heal the sick and sustain the imperiled, and sever all perverse and malevolent influences. Having received your gracious consent, I was permitted to submit my name in the monthly memorial. In accordance with your command, I have followed the method and sought a master of renowned virtue to endorse and transmit the teaching.\n\nI reflect that, by birth, I am fortunate to dwell within the Central Kingdom. My heart has long abided beyond form, and in my search for a teacher, I repeatedly inquired among those of understanding, until at last I poured forth my sincerity and encountered one of luminous discernment. Recently, I have come to revere [Name], who has attained the utmost refinement in the Dharma, who exalts and propagates the Great Dao, whose dedication to saving the people is most earnest, and whose deliverance is profoundly far-reaching.\n\nI now humbly present myself to [Name], beseeching your endorsement. Should I be so fortunate as to be accepted, I would surely steel my heart and fortify my resolve, inscribing your grace upon my bones and engraving it into my very frame, devoting myself wholeheartedly to cultivation. In so doing, I would repay above the gift of your guidance—what greater fortune could there be?\n\nThis petition is respectfully submitted for your consideration, and I prostrate myself in await of your Dharma decree.\n\nOn the [day] of the [month] in the [year], residing at [place], [Name] respectfully submits this petition.\n\n**Form of the Newly Conferred Orthodox Dharma Plate-Tally and Iron Pledge**\n\nThe plate-tally and iron pledge shall be nine inches in height, with five inches corresponding to the five bodies of the manifested self and four inches representing the four numinous spirits of the body. It shall measure four feet and nine inches in length, aligning with the four directions and the nine stars of the Dharma.\n\nTraditionally, yellow flowered silk was used, but those who practice the Dharma today often employ cypress wood for the tally and iron for the pledge. This is not so, for such mundane materials do not accord with the intent of the immortals. The plate-tally signifies the register of records and the contract of the tally, while the iron pledge represents an oath of unshakable alliance, steadfast and unchanging.\n\nThis was transmitted by the great immortal Master Rao, and its meaning is recorded below:\n\n**By Imperial Decree of the Three Terraces, to the Office Below:**\n\nTo the Right Judge of the Bureau for Driving Away Demons, [Name], who practices and upholds the Orthodox Dharma of the Celestial Heart, in accordance with the decree bestowed by the Jade Emperor:\n\nYou shall reverently follow the teachings in your practice, dispelling evil and aiding the upright, benefiting and delivering the multitude of beings, and propagating the Great Dao. Your actions must align with the Celestial Heart; beware of deceit, corruption, or negligence. Honor and serve your parents with filial piety, respect your teachers and elders, and maintain harmony among the six relations. Do not follow after power or profit, nor transmit this Dharma to unworthy persons. Should you fail to comply, your efficacy in affairs shall wane. The Three Officials shall record your merits and transgressions, and you shall be rewarded or punished according to the Dharma.\n\n*Oṃ hūṃ hūṃ!* All spirits bow their heads; demons and evil forces submit to rectitude. Should any dare to act with malice or rebellion, they shall be shattered into dust.\n\nBy decree of the Supreme Emperor of the Grand Tenuity: *Swiftly, swiftly, in accordance with the statutes and ordinances!*\n\nTo the Four Heavenly Gate Kings, the Eight Great Vajras, the Five Divisional Wheel Kings, the Dharma-protecting deities of the ten directions, the stellar host of immortals within the registers of the four heavens and three realms, the Six Ding and Six Jia, the Great Sage Xuanwu, the Celestial Ding Warriors, the Lords of Wind and Rain, the Envoys of the Five Thunders, the Sage Emperors of the Five Peaks, the Four Drainage Kings, the deities of grotto-heavens, renowned mountains, official temples, and the Five Paths, the celestial soldiers and officers, the mountain soldiers and officers—let each act in accordance with the Emperor’s decree. The plate-tally and iron pledge shall ever protect and assist, exterminating evil demons, dispelling illness, and eradicating malevolent spirits. Any fierce or rebellious evil spirits who dare to defy shall be shattered into dust.\n\nUpon the arrival of this saving tally: *Swiftly, swiftly, in accordance with the statutes and ordinances!*\n\nWhereas you possess the endowment of loyalty and sincerity, the nature of purity and harmony, a profound aspiration for the true, and a resolute heart for delivering beings, you must uphold this pledge to cultivate the self and harmonize with the praises of the true words. Let this be known to you.\n\nRespectfully recorded on the [day] of the [month] in the [year].\n\nTo the Esteemed Bearer of the Dharma Transmission and Preceptor’s Rank, the Minister of [Surname], acting in accordance with the rites:\n\nThe Great Dharma Master of the Three Heavens, Upholder of the Dao, Perfected One of the Orthodox Unity, Serene and Responsive True Lord, Minister Zhang Daoling,\n\n**Decree of Appointment for the Newly Conferred Orthodox Practitioner and Official of the Demon-Quelling Court**\n\nIssued by the Chancellery of the Three Terraces:\n\nWhereas the Demon-Quelling Court official of [Surname] has submitted a memorial endorsing [Name of Candidate]:\n\nPossessing a nature of purity and simplicity, they uphold goodness and preserve sincerity. Ever revering the Lofty Perfected, they constantly take refuge in the Great Dao. They harbor the aspiration to aid the state and deliver the people, desiring to receive transmission of the Orthodox Dharma of the Celestial Heart, talismans, and registers—to guard the body and protect life, assist in the Dao’s unfolding, and benefit all beings.\n\n[Name of Candidate], aged [number] years, born on the [day] of the [month] in the [year] of the sexagenary cycle, under the governance of the [specific] Star Lord of the Northern Dipper, awaits the humble repayment of their devotion.\n\nThe Orthodox Dharma of the Three Heavens converges all myriad ways. How much more so when our words are easily practiced—how could your heart falter in emulation?\n\nThey are hereby appointed as Right Judiciary Official of the Northern Culmen Demon-Quelling Court, concurrently overseeing the affairs of the Court. Let this be recorded in accordance with the prescribed form.\n\nRespectfully issued this decree.\n\nBy Edict of the Supreme Clarity Jade Emperor, upon receipt of this talisman, let it be reverently executed.\n\nDated the [day] of the [month] in the [year] of the sexagenary cycle.\n\nPresented by the Dharma Master of Transmission and Ordination, the Gold-Titled Minister [Name], proclaiming the decree.\n\nThe Great Dharma Master of the Three Heavens, Upholder of the Teachings, Orthodox Unity Perfected Person, Tranquil Response Perfected Lord, Minister Zhang Daoling.\n\n**Memorial of Gratitude for Receiving the Dharma and Reporting Responses—Prescribed Form**\n\nThe humble official [Name], with utmost reverence and trepidation, prostrates and bows twice.\n\nI humbly declare: I have heard that the Great Dao is formless, nurturing and embracing the myriad transformations. The supreme virtue is not fixed, yet it revolves and governs the Three Origins. All things attain manifestation, with the most numinous residing at the forefront. The unparalleled Dharma does not depart from its root; the essence of guarding the One emerges from sincerity. Looking upon myself as one of mere mortal capacity, I am entrusted with the protection and participation among the ranks of immortals. With utmost reverence and trepidation, I prostrate and bow twice.\n\nReverently addressing the Jade Purity Sacred Realm’s Primordial Heavenly Venerable, the Supreme Clarity Perfected Realm’s Numinous Treasure Heavenly Venerable, and the Grand Clarity Immortal Realm’s Dao and Virtue Heavenly Venerable—who opened the heavens and governed the epochs, wielding talismans as the Nine Hundred Ninety-Nine Myriad Million Dao Lords; who cleaved the earth in the Crimson Brilliance and Dragon Han eras, assuming the Ten Titles and Ten Perfections. The hundred spirits take their source from the sacred scriptures and treasures.\n\nThe Three Heavens’ Orthodox Dharma, the Five Emperors’ True Talismans—spreading transformation, descending auspiciousness, casting radiance to respond to all beings. Though I dwell in humble mortality, I have presumptuously received the utmost Dao/Way. Having escaped the dusty world, I rejoice in my enrollment among the immortal registers. How dare I not uphold the Heavenly Precepts above and fulfill human sentiments below? With relieving suffering as my heart and repaying kindness as my urgency, I humbly present this memorial in gratitude, venturing to disturb the Heavenly Might. My inferior feelings are without limit; I gaze upon the sagely presence with fervent longing, overwhelmed with awe.\n\nI, your subject [Name], with utmost reverence and trepidation, prostrate and bow twice.\n\nRespectfully submitted.\n\nMemorial presented by your subject [Surname and Name], of such-and-such rank, on the [Day] day of the [Month] month of the [Year] year.\n\n*Lower Scroll of the Upper Clarity’s* **Marrow Spirit Writs and Ghostly Precepts**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清骨髓灵文鬼律 经名：上清骨髓灵文鬼律。 宋饶洞天定正，宋邓有功重编。 三卷。 底本出处：《正统道藏》洞玄部戒律类。 上清骨髓灵文鬼律序 受上清大洞箓行天心正法臣邓有功撰 臣闻《书》曰：天道福善祸淫。 又曰：天命有德，天讨有罪。 夫善者必福之，淫者必祸之，有德则在所命，有罪则在所讨，此天之道也。 天之临下，岂特明之，於人为然哉。 虽幽之於鬼神，其不尔。 是故神有功於国与民者，莫不载之杞典，而秩祭之。 乃若邪怪之鬼物，为祟为厉，为祆为孽，扰民害物者，莫不有以治之，则其为患可胜计耶。 此《上清骨髓灵文》所以俾付正直者，使之以奉行也。 其目有三，曰鬼律，曰玉格，曰行法仪式。 合而言之，通谓之《骨髓灵文》也。 鬼律者，天曹割判，入驱邪院，北帝主而行之。 玉格并行法仪式者，玉帝特赐驱邪院以掌判也。 其要皆所以批断鬼神罪犯，辅正驱邪，与民为福，为国御灾者焉。 臣窃见玉格之文，寻常法师只以口传，而行法仪式，又隐而不谕，故灵文因此散缺，所存者，鬼律而已。 鬼律虽存，其俗师不能深晓其意，加之传写讹谬，文理舛错，遂致废缺，只以符水治病，多致诳惑，岂不负高天之意哉。 盖灵文五十六条者，尊一於北极，总领包括天地阴阳五行之数，杀生之理，以邪克正者，罔不隶焉。 玉格仪式六十四条，若八卦生生无穷之象也。 鬼律配玉格，正条一十六，合七十二，即气候所摄也。 有所行邪，即付泰山七十二司，缺其一则法不全而司不正矣。 是则以道为法之体，以律为法之用。 鬼物邪气之所干，必体道以正之，故曰正法也。 行事仪式四十八条，以三十六表三十六将，余十二时神，常置左右，摄归一身，故曰行事仪。 又以身为一真之舍，动为仙化，静与神默，岂非自然之妙耶。 臣尝细绎鬼律，窃见其文，详悉精致，推原其本，则祖仙饶洞天。 初为府吏，用心公平，执法严正，断狱不枉，众心惬适。 昭格乾象灵光，下烛地藏为之开辟，而秘文出见，即斯鬼录之法，实皇天之所赐也。 祖仙洞天以谓，天人虽异，理则一致。 即仿以国家法律参校，深得轻重之意，而定其刑罚之例。 然则鬼神有影响而不可执着，无所施其鞭扑，有罪犯则苦役之。 故《丰都律》言鬼以负山之劳，龙以穿池之役，则若是之，有徒役也。 《女青鬼律》 云：当天圆三雨，则若世之有流窜也。 《九地律》云：无上灭形则若世之处置也。 《玄都律》云：分形散影，即若世之法外也。 以此行於世间，断治鬼神，最为详密。 臣夙缘幸会，上观真科，遭遇名师，得以传授。 十数年间，尝於洪州西山玉隆观、江州庐山太平观、南康军简寂观、舒州灵仙观，博求妙本，前后所收《上清鬼律》共五部，校对讹舛，一依旧本，排定编次。 鬼律七门五十六条，玉格十六条，行法仪式四十八条，总计一百二十条，分为三卷。 逐一勘当，纤悉周备，遂以所得新故之文，焚上天阙，申驱邪院等处，继获报应分明，更无遗缺，是谓完本。 若乃只自奉行，隐默不传于世，则其功未广，恐违天意而贻阴谴也。 是以缮写投进，抑尝闻昔之以道御天，下者其鬼不神，非其鬼不神，其神不伤人，以至两不相伤而德交归焉。",
      "translated_text": "**Preface to the *Shangqing Gusui Lingwen Guilü* (Upper Clarity Ghost Statutes of the Numinous Writ of Bone and Marrow)**\n\nComposed by Deng Yougong, Servant of the Heavenly Heart Orthodox Rites and Recipient of the *Shangqing Dadong Lu*\n\nI have heard it said in the *Book of Documents*: \"The Dao of Heaven blesses the good and calamitizes the licentious.\" It is also written: \"Heaven commands those with virtue; Heaven punishes those with guilt.\" Thus, the good are surely blessed, the licentious surely calamitized; those with virtue are destined to receive mandate, those with guilt are destined for chastisement—this is the Dao of Heaven. Though Heaven oversees the world below, is this principle manifest only among humans? Even in the hidden realms of ghosts and spirits, it is no different.\n\nFor this reason, spirits who render merit to the state and the people are all recorded in the sacrificial canons and accorded due rites. As for perverse and monstrous ghostly beings—those who bring misfortune, plague, demonic possession, or calamity, disturbing the people and harming creatures—there are none for whom measures of governance do not exist. How, then, could their harms be enumerated? It is for this reason that the *Shangqing Gusui Lingwen* has been entrusted to the upright, that they may uphold and enact it.\n\nIts contents comprise three sections: the *Ghost Statutes*, the *Jade Regulations*, and the *Ritual Procedures and Forms*. Collectively, they are known as the *Lingwen of Bone and Marrow*. The *Ghost Statutes* are adjudicated by the Heavenly Courts, administered through the Bureau of Expelling Evil, and executed under the authority of the Northern Emperor. The *Jade Regulations* and *Ritual Procedures and Forms* were specially bestowed upon the Bureau of Expelling Evil by the Jade Emperor for the governance of judgments.\n\nTheir essential purpose is to adjudicate the transgressions of ghosts and spirits, assist the upright, expel evil, bring fortune to the people, and defend the state against disaster. I have observed that the texts of the *Jade Regulations* are typically transmitted orally by ordinary ritual masters, while the *Ritual Procedures and Forms* remain obscure and poorly understood. As a result, the *Lingwen* has become fragmented, and only the *Ghost Statutes* remain extant. Even these, however, are not deeply comprehended by vulgar practitioners. Compounded by errors in transmission and copying, their structure and meaning have become disordered, leading to neglect. Now, they are reduced to mere talismanic waters for healing, often resulting in deception—how could this not betray the intent of High Heaven?\n\nThe *Lingwen* consists of fifty-six articles, venerating the Northern Culmen as supreme, encompassing the numerical principles of Heaven and Earth, yin and yang, and the Five Phases. It governs the principles of life and death, and all cases where the perverse overcomes the upright are subject to its jurisdiction. The *Jade Regulations* and *Ritual Forms* comprise sixty-four articles, mirroring the ceaseless generative images of the Eight Trigrams. When the *Ghost Statutes* are paired with the *Jade Regulations*, there are sixteen primary articles, totaling seventy-two—corresponding to the cycles of qi. Any transgression is referred to the Seventy-Two Offices of Mount Tai; if even one is missing, the law is incomplete, and the offices are not properly governed.\n\nThus, the Dao serves as the essence of the law, while the statutes serve as its function. When ghostly beings or perverse qi encroach, they must be rectified through the Dao—hence, it is called the *Orthodox Rite*. The *Ritual Procedures* comprise forty-eight articles: thirty-six correspond to the Thirty-Six Generals, while the remaining twelve represent the spirits of the twelve hours, ever present at one’s side, gathered into a single body—hence, it is called the *Ritual Procedures*. Moreover, the body is the abode of the One True, movement is the transformation of immortality, and stillness is communion with the numinous—is this not the marvel of spontaneity?\n\nUpon careful study of the *Ghost Statutes*, I find their texts detailed and refined. Tracing their origins, they derive from the Ancestral Immortal Rao Dongtian. Originally a prefectural clerk, he was impartial in his duties, strict in enforcing the law, and just in adjudicating cases, winning the satisfaction of the people. His luminous virtue aligned with the celestial patterns, illuminating the earthly realms and revealing these secret texts—the *Ghost Statutes*—as a true gift from August Heaven.\n\nThe Ancestral Immortal Dongtian held that though Heaven and humanity differ, their principles are one. Thus, he modeled the statutes after the laws of the state, weighing their severity to establish appropriate punishments. However, ghosts and spirits, though responsive, cannot be physically seized; where whips and cudgels cannot be applied, their crimes are met with hard labor. The *Fengdu Statutes* state that ghosts are punished with the labor of bearing mountains, and dragons with the task of digging ponds—such are their penal servitudes. The *Nüqing Ghost Statutes* declare that when Heaven rounds the three rains, it is akin to exile in the human realm. The *Nine Earth Statutes* speak of the supreme punishment of annihilating form, comparable to execution in the world. The *Xuandu Statutes* describe the dispersal of form and shadow, akin to extrajudicial measures. Applied in the world, these statutes for adjudicating ghosts and spirits are most meticulous.\n\nBy fortunate karmic affinity, I have ascended to study the true canons and encountered renowned masters, receiving their transmission. Over a decade, I sought rare manuscripts at the Jade Embankment Abbey on West Mountain in Hongzhou, the Great Peace Abbey on Mount Lu in Jiangzhou, the Simplicity Retreat Abbey in Nankang Prefecture, and the Numinous Immortal Abbey in Shuzhou. I collected five versions of the *Shangqing Ghost Statutes*, collating their errors against the original texts and arranging them in order. The *Ghost Statutes* comprise seven sections and fifty-six articles; the *Jade Regulations*, sixteen articles; and the *Ritual Procedures and Forms*, forty-eight articles—totaling one hundred twenty articles, divided into three scrolls. Each was meticulously examined, ensuring completeness in even the finest details. With the newly and previously obtained texts, I presented them to the Celestial Palaces and submitted them to the Bureau of Expelling Evil and other offices. The responses were clear and unerring, with no omissions—this is the complete edition.\n\nIf one were to practice these rites privately, concealing them from the world, their merit would not spread, and I fear it would contravene Heaven’s intent, inviting hidden retribution. Thus, I have transcribed and submitted them. I have also heard that in ancient times, those who governed Heaven with the Dao ensured that even the lowest ghosts were not numinous. It was not that the ghosts lacked numinosity, but that their powers did not harm people—so that neither side harmed the other, and virtue was reciprocally restored.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1217,
      "start_sentence": 0,
      "end_sentence": 46,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.88855218887329,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\上清骨髓灵文鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "然后为盛治之极致，岂不伟哉。 伏惟皇帝陛下，操至权而独运斡万化於不测，百神受职，庶民安堵，则驭之者固自有道矣。 臣且区区以进此者，非特欲乞颁行四方，以广其传。 庶几天下法师皆得完本，依此行持，使遐邦僻邑、祆邪灵怪皆不得以伤人，是亦少裨陛下道化之万一也。 臣谨拜手稽首而为之序。 上清骨髓灵文鬼律卷上 紫微官使日直元君饶洞天定正受上清大洞录行天心正法邓有功重编 法道门二＋七条 诸行法官，乃阳行阴报，并依式岁考功绩。 如能止邪抑非，治困拯危，度死超生，含灵受赐，解除怨仇者，依仪迁职。 如傍循私曲，随恶长奸者，许三官斜察以闻，当议重行黜责。 诸发遣文字，危急行剖子，限当时。 谓病笃，会问阴府天曹命数延促之类。 次紧牒，城隍限一日。 次申束岳立狱，催鬼神，限二日。 常程给限，并不过三日。 辄有留滞，半日杖一百。 涉私故，徒一年。 情重者，加一等。 在道阻节者，以其罪罪之。 诸应管东岳差到神将吏兵，三年一替。 一年一替者听。 并具劳绩过犯，报本岳考察赏罚，仍於去替一月前，预差 替人。 愿留再任者，关本岳。 应替不替，不应替而替者，杖一百，有故者勿论。 诸神将被命报应稽迟者，杖一百。 缘事害人受赂者，徒二年。 天兵将吏，仍具所犯，因依奏闻。 诸行法事，有不便者，不得檀行改易。 即时奏请，以俟报应。 谓如遣鬼不去，即符使不灵神之类。 违者，徒二年。 非行法官辄干预者，徒三年。 诸差使鬼神不任职，误取生人魂魄，或令发狂致疾者，流一千里。 因而害人性命，加二等。 毁法不遵者，处死。 诸行法官所至，许带符印随行，在处称行司。 应有须索，呼召将吏等辄违戾者，徒一年。 干仙班者，具事因奏闻。 诸承受文字遗坠者，画时经驱邪院自陈。 检会别行，仍责限追寻不获者，杖一百。 限内寻获，与免罪。 诸鬼神应送所置，辄违而不往者，流三千里，累犯者处死。 诸神将吏兵等，因追摄鬼祟残害受赂者，徒二年。 若隐花纵令逃避者，以犯人罪罪之。 若罪人在坛显验通露，后忽因事身死者，具将吏所责情状奏闻。 诸神将名山大川城隍社令主三品神众，凡遇承受驱邪院文字，并须验认印记，严谨护持，速具报应。 辄有轻易者，徒二年。 诸鬼神等，受驱邪院发遣，经宿不离当处者，一日徒一年。 十日加一等，罪止徒三年。 诸邪祟经驱遣，而六甲土公司命等神辄隐藏不发去者，徒三年。 因而害人性命者，流三千里。 天曹降旨留住者，勿论。 诸民人有事告诉行法官，受接不行，虽行而苟简，及妄入鬼神罪目者，杖一百。 不候告，而别指事故行遣者非。 诸当职之神，辄与民人妇女私通者，流三千里。 情理重者，奏裁如地分鬼神犯者，加一等。 诸鬼神无故害人性命及偷盗人间财物，不受咨恳被捉者，处死。 所属城隍土地等故纵者，同罪。 失觉察者，杖一百。 诸被使鬼神不即时往干者，杖一百。 紧切事干人命，徒二年。 因而至死，流三千里。 受敕符违而不去者，处死。 诸蝗虫旱潦天霜雪雹害民稼穑，本地分神众不能救济，驱邪院差将吏同力止绝违者，杖一百。 事干天曹时行年灾，许具章表奏闻。 诸神将吏兵，应使而不使，不应使而使者，一人杖一百。",
      "translated_text": "Then this would be the pinnacle of grand governance—how magnificent indeed!\n\nWe humbly reflect that Your Imperial Majesty wields supreme authority, singularly orchestrating the myriad transformations beyond reckoning. The hundred spirits receive their offices, and the common people dwell in peace—surely, the one who governs thus must inherently possess the Dao.\n\nYour servant, in presenting this, does not merely seek to petition its promulgation throughout the realm to broaden its transmission. May all ritual masters under Heaven obtain the complete edition, practice accordingly, and ensure that even in distant lands and remote hamlets, no heretical spirits or malevolent specters may harm the people. This would but slightly aid Your Majesty’s transformative power by a ten-thousandth part.\n\nYour servant respectfully bows and touches his head to the ground in preface.\n\n*Upper Scroll of the Upper Clarity Essence-Spirit Ghost Statutes*\n*Composed by Deng Yougong, Purple Tenuity Palace Attendant and Daily Duty Perfected of the Ziwei Palace, Rectifier of the Received Upper Clarity Great Cavern Record and Practitioner of the Heavenly Heart Orthodox Rites*\n\n**Twenty-Seven Articles of the Dharma Dao Discipline**\n\nAll ritual officers, who enact yang in practice and receive yin in recompense, shall be assessed annually according to the prescribed forms.\n\nThose who suppress evil, restrain wrongdoing, relieve distress, rescue peril, deliver the dead beyond life, and grant boons to all sentient beings—resolving enmities and grievances—shall be promoted in rank according to the rites.\n\nThose who indulge private bias, abet wickedness, or foster treachery shall be reported by the Three Offices for investigation and subjected to severe demotion or punishment.\n\nAll urgent dispatches must be promptly acted upon within the same day—such as cases of critical illness, inquiries to the Underworld or Heavenly Bureaus regarding the extension or curtailment of lifespans.\n\nFor next-level urgent documents, city gods shall respond within one day.\n\nFor summons to the Five Peaks to establish prisons or hasten spirits, the limit is two days.\n\nRoutine matters shall not exceed three days.\n\nDelays of half a day incur one hundred strokes of the rod.\n\nDelays due to private obstruction result in one year of penal servitude.\n\nFor grave offenses, the penalty increases by one degree.\n\nThose who obstruct the Dao shall be punished according to their crimes.\n\nAll divine generals, officers, and soldiers assigned by the Eastern Peak shall serve three-year terms, though one-year terms may be permitted.\n\nTheir merits and transgressions shall be reported to their home peak for evaluation, rewards, or penalties. Replacements shall be pre-assigned one month before the term’s end.\n\nThose wishing to remain for another term shall notify their home peak.\n\nFailure to replace when due, or replacing when not due, incurs one hundred strokes, unless due to unavoidable circumstances.\n\nDivine generals who delay in reporting their missions shall receive one hundred strokes.\n\nThose who harm people or accept bribes in the course of duty shall be sentenced to two years of penal servitude. Heavenly soldiers and officers shall have their offenses reported accordingly.\n\nNo alterations may be made to ritual matters deemed unsuitable; immediate memorials must be submitted to await responses—such as cases where dispatched ghosts refuse to depart or talismanic envoys prove ineffectual.\n\nViolators shall be sentenced to two years of penal servitude.\n\nUnauthorized interference by non-ritual officers incurs three years of penal servitude.\n\nSpirits or gods assigned duties who fail in their posts, mistakenly seize living souls, or cause madness or illness shall be exiled one thousand *li*.\n\nIf such actions result in death, the penalty increases by two degrees.\n\nThose who defy or disobey the statutes shall be executed.\n\nRitual officers may carry talismans and seals while traveling, identifying themselves as itinerant authorities in any locale.\n\nThose who refuse requisitions or disobey summons to generals or officers shall be sentenced to one year of penal servitude.\n\nInterference with the ranks of immortals shall be memorialized with full details.\n\nThose who lose or misplace received documents must immediately report to the Bureau of Expelling Evil.\n\nIf documents are not recovered after investigation and pursuit within the set time, the penalty is one hundred strokes.\n\nRecovery within the time limit exempts the offender from punishment.\n\nSpirits or gods who disobey orders to proceed to their assigned posts shall be exiled three thousand *li*; repeat offenders shall be executed.\n\nDivine generals, officers, or soldiers who, in pursuing or capturing malevolent spirits, harm others for bribes shall be sentenced to two years of penal servitude.\n\nThose who conceal or allow such spirits to escape shall be punished according to the criminals’ crimes.\n\nIf a criminal, having been exposed and verified at the altar, later dies unexpectedly due to other causes, the circumstances of the responsible officers’ negligence shall be memorialized.\n\nAll divine generals, officers of famous mountains and great rivers, city gods, and local deities of the third rank or above must verify the seals on documents from the Bureau of Expelling Evil, strictly safeguard them, and promptly report compliance.\n\nNegligence incurs two years of penal servitude.\n\nSpirits or gods who, upon receiving orders from the Bureau of Expelling Evil, remain in place overnight without departing shall be sentenced to one year of penal servitude per day, increasing by one degree for every ten days, up to a maximum of three years.\n\nIf malevolent spirits, after being expelled, are concealed and not banished by the gods of the Six Jia or Earth Offices, the penalty is three years of penal servitude.\n\nIf such concealment results in death, the offender shall be exiled three thousand *li*.\n\nExceptions are made if the Heavenly Bureaus issue orders to detain them.\n\nIf commoners report matters to ritual officers who fail to act, act perfunctorily, or falsely accuse spirits or gods, the officers shall receive one hundred strokes.\n\nActing without a report or arbitrarily assigning blame for unrelated incidents is prohibited.\n\nSpirits in office who engage in illicit relations with common women shall be exiled three thousand *li*.\n\nFor grave offenses, the case shall be memorialized for imperial decision. Local spirits or gods committing such crimes shall receive penalties one degree higher.\n\nSpirits or gods who unjustly take lives or steal property, and resist capture despite entreaties, shall be executed.\n\nLocal city gods or earth deities who knowingly allow such acts shall be punished equally.\n\nThose who fail to detect such crimes shall receive one hundred strokes.\n\nSpirits or gods who do not promptly attend to their duties shall receive one hundred strokes.\n\nFor urgent matters involving human lives, the penalty is two years of penal servitude.\n\nIf death results, the penalty is exile of three thousand *li*.\n\nThose who disobey imperial talismans and refuse to depart shall be executed.\n\nFor locust plagues, droughts, floods, frost, snow, or hail damaging crops, local spirits who fail to provide relief shall be reported by the Bureau of Expelling Evil to dispatch officers to suppress the afflictions. Failure to comply incurs one hundred strokes.\n\nIf the matter concerns celestial bureaus or seasonal calamities, memorials may be submitted.\n\nDivine generals, officers, or soldiers who are summoned but refuse, or are not summoned but act, shall each receive one hundred strokes.",
      "overlap_context": "rites privately, concealing them from the world, their merit would not spread, and I fear it would contravene Heaven’s intent, inviting hidden retribution. Thus, I have transcribed and submitted them. I have also heard that in ancient times, those who governed Heaven with the Dao ensured that even the lowest ghosts were not numinous. It was not that the ghosts lacked numinosity, but that their powers did not harm people—so that neither side harmed the other, and virtue was reciprocally restored.",
      "start_char": 1217,
      "end_char": 2487,
      "start_sentence": 47,
      "end_sentence": 114,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.12485718727112,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\上清骨髓灵文鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "十人加一等，罪 止徒三年。 诸救济民人疾苦，合用干碍神鬼呼召辄不到者，流三千里。 虽到而不协心搜捕干捷者，徒二年。 天府差干他事者，勿论。 诸天行疫疾，令人患疮肿走痛之类，隶十二年王子统行所，主鬼神受驱邪院遣除事合遵禀天曹拘收者，即时报应，具奏上界，违者杖一百。 诸山川土地司命城隍，受命搜捕邪祟，辄有违滞故纵於经历地分害人者，直送东岳，处断主者失觉察，杖一百。 诸提举城隍社令有过者，具奏北极取旨，三官纠察，关驱邪院施行。 诸方境内遇年灾大疫，损伤人民牛马畜兽之类，被告即关年王神收毒，仍奏知上界，违者杖一百。 诸囹圄久淹受苦之人，所犯非辜，实负冤屈，诸处雪理不明，即委当处城隍狱神显谕，推勘官吏省悟，实情立为委决，违者徒一年。 如囚人实犯阴谴者，勿论。 诸神将吏兵辄离行法官者，杖一百。 遇有急阙，许於近便神祠差借兵，不得过五百人。 干办讫，犒赏推恩，申奏所属录功。 诸鬼神承受天府委干，稽留不行五日，杖一百。 十日加一等，罪止徒三年。 有缘故者，具奏天府。 太甲门二条 诸林谷祆异累害人者，处死。 所部鬼物非过干累及者，送东岳处分。 应干经历地分不觉察，杖一百。 同情犯者，罪亦如之。 诸林木散大，为人钦仰，立祠祈梼无福报者，并除之。 因立祠而不为害，善能兴福於人者，听以有无功绩奏闻，违者杖一百。 太戊门一十七条 诸地气所产育养之物，遇灾年须出生地毛。 如鬼神无故出入，别兴风雨，而因损伤稼穑害及人命者，并流一千里。 仙官拘 执六地犯者，具奏天府。 诸神鬼盗人财满千钱者，流二千里。 不满千钱，徒二年。 若常住供献之物，不以多寡，灭形。 诸地分主首故纵邪祟於部下为害者，关日游神吏誊报，违者杖一百。 诸掌文字管摄邪魔，差当日功曹将吏承受，有稽迟、投至不明、磨擦损污者，杖一百。 私拆封角视者，徒二年。 奏书有漏泄遗坠者，流三千里。 诸鬼神妄摄人魂者，流三千里。 因而致毙者，处死。 诸神鬼呼召不至，辄违慢不恭者，徒三年。 诸鬼神非摄受於人世，不得与生灵混处，违者杖一百。 天府谪仙者非。 如妄假名目，邀求祭祀者，徒二年。 切害者，送东岳处置。 拒捕者，处死。 诸鬼神无故在人家潜伏，妄兴妖祟为害，经宿不去者，杖一百。 五日加一等，罪止徒二年。 被命遣不去者，处死。 诸人间染疾，旬月淹延不退，梦寐与鬼魅交通者，委所居地祇具事状，申东岳诛灭，违者杖一百。 诸驱邪院官行天符，委山川地主收捕鬼祟，不即力干违慢者，徒一年。 正一门四条 诸称水者，不以大小浅深，善能滋养稼穑而不随时者，许九江水帝察其功过保奏，违者杖一百。 诸龙神在江河湖潭湫水，有所主者谓之主，正则祠之。 若因大风雨，无故非理出游害人稼穑者，徒一年。 妄邀祭祀者，徒二年。",
      "translated_text": "For every ten persons, the penalty increases by one degree, with a maximum of three years of penal servitude.\n\nThose who, when summoned to relieve the suffering of the people, fail to promptly attend due to interference from gods or spirits shall be exiled three thousand *li*. Even if they attend but do not cooperate wholeheartedly in searching or capturing swiftly, the penalty is two years of penal servitude. If dispatched by the Celestial Treasury for other matters, no penalty shall be imposed.\n\nFor seasonal epidemics causing people to suffer from sores, swellings, or wandering pains, the gods under the jurisdiction of the Twelve-Year Cycle Kings shall, upon receiving orders from the Bureau of Expelling Evil to comply with celestial decrees for suppression, immediately respond and report to the upper realms. Failure to do so incurs one hundred strokes.\n\nMountain, river, earth, and city gods who, upon receiving orders to search for and capture malevolent spirits, deliberately delay, neglect, or allow harm to occur within their jurisdictions shall be sent directly to Mount Tai for judgment. Those in charge who fail to detect such negligence shall receive one hundred strokes.\n\nFor city gods or local deities found to have committed offenses, reports shall be submitted to the Northern Culmen for decrees, with the Three Officials conducting investigations and the Bureau of Expelling Evil executing the orders.\n\nWhen disasters or great epidemics within a region cause harm to people, livestock, or animals, the Year-King gods shall be notified to withdraw the poison, and the upper realms shall be informed. Failure to comply incurs one hundred strokes.\n\nFor prisoners long detained and suffering unjustly, whose cases are not redressed despite clear evidence of wrongful accusation, the local city god or prison deity shall be commissioned to reveal the truth, prompting officials to reexamine the case and execute justice accordingly. Failure to do so incurs one year of penal servitude. If the prisoner is truly subject to karmic retribution, no penalty shall be imposed.\n\nDivine generals, officers, or soldiers who leave their commanding exorcism officer without authorization shall receive one hundred strokes. In urgent shortages, they may be temporarily borrowed from nearby temples, not exceeding five hundred persons. Upon completion of the task, rewards and merits shall be reported to the relevant authorities for recognition.\n\nGods or spirits who, upon receiving orders from the Celestial Treasury, delay for five days shall receive one hundred strokes. For every ten days of delay, the penalty increases by one degree, with a maximum of three years of penal servitude. Those with valid reasons shall report to the Celestial Treasury.\n\n**Tai Jia Gate: Two Articles**\nFor malevolent spirits in forests or valleys causing repeated harm to people, the penalty is death. Those under their jurisdiction not directly involved shall be sent to Mount Tai for disposition. Failure to detect such occurrences within their jurisdictions incurs one hundred strokes. Those who collude in the offense shall receive the same penalty.\n\nFor sacred trees or groves widely revered by people but failing to bestow blessings upon those who establish shrines and pray, they shall be removed. If no harm is caused and they genuinely bring fortune to people, their merits or lack thereof may be reported. Failure to comply incurs one hundred strokes.\n\n**Tai Wu Gate: Seventeen Articles**\nFor creatures produced and nurtured by the earth’s *qi*, during years of disaster, they must emerge from their habitats. If gods or spirits, without cause, move about, stir winds and rains, and thereby damage crops or harm lives, they shall be exiled one thousand *li*. Immortal officials shall apprehend offenders of the Six Earths and report to the Celestial Treasury.\n\nGods or spirits who steal property worth one thousand coins or more shall be exiled two thousand *li*. For amounts less than one thousand coins, the penalty is two years of penal servitude. For property dedicated to perpetual offerings, regardless of quantity, the penalty is death.\n\nLocal deities who deliberately allow malevolent spirits to harm their jurisdictions shall be reported by the Day-Patrolling Deities. Failure to do so incurs one hundred strokes.\n\nFor those managing documents and suppressing demons, if the assigned Day Officers or officials cause delays, unclear submissions, or damage to documents, they shall receive one hundred strokes. Those who privately open or peek at sealed documents shall receive two years of penal servitude. For leaking or losing memorials, the penalty is exile of three thousand *li*.\n\nGods or spirits who arbitrarily seize human souls shall be exiled three thousand *li*. If death results, the penalty is execution.\n\nGods or spirits who, when summoned, fail to attend or show disrespect shall receive three years of penal servitude.\n\nGods or spirits not assigned to the mortal realm shall not mingle with the living. Violators shall receive one hundred strokes. Exiled immortals from the Celestial Treasury are exempt. Those who falsely assume identities to demand sacrifices shall receive two years of penal servitude. For serious harm, they shall be sent to Mount Tai for disposition. Those who resist arrest shall be executed.\n\nGods or spirits who, without cause, lurk in people’s homes, stir up malevolence, and fail to leave after one night shall receive one hundred strokes. For every five days, the penalty increases by one degree, with a maximum of two years of penal servitude. Those who refuse to leave after being ordered shall be executed.\n\nFor people suffering from prolonged illnesses, dreaming of or communicating with ghosts or demons, the local earth deity shall report the matter to Mount Tai for execution. Failure to do so incurs one hundred strokes.\n\nOfficials of the Bureau of Expelling Evil who, upon receiving celestial talismans, order local mountain and earth deities to capture malevolent spirits but fail to act promptly or show disrespect shall receive one year of penal servitude.\n\n**Zheng Yi Gate: Four Articles**\nFor all waters, regardless of size or depth, that nourish crops but do not do so seasonally, the Nine Rivers Water Emperor shall assess their merits or faults and report accordingly. Failure to comply incurs one hundred strokes.\n\nDragon gods residing in rivers, lakes, or deep pools, if they have designated domains, shall be properly worshipped. If they, without cause, roam during storms and harm crops, the penalty is one year of penal servitude. Those who demand sacrifices shall receive two years of penal servitude.",
      "overlap_context": "uted.\n\nFor locust plagues, droughts, floods, frost, snow, or hail damaging crops, local spirits who fail to provide relief shall be reported by the Bureau of Expelling Evil to dispatch officers to suppress the afflictions. Failure to comply incurs one hundred strokes.\n\nIf the matter concerns celestial bureaus or seasonal calamities, memorials may be submitted.\n\nDivine generals, officers, or soldiers who are summoned but refuse, or are not summoned but act, shall each receive one hundred strokes.",
      "start_char": 2487,
      "end_char": 3632,
      "start_sentence": 115,
      "end_sentence": 168,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.45472002029419,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\上清骨髓灵文鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "掌水司引水，因漂溺田屋苗稼被害及五十家已上者，流三千里。 不及五十家，徒三年。 灾年时行地分变异者，勿论，仍具表以闻。 诸龙神鬼主江河污流去处，若故曲邀舟车祭祀者，徒二年。 妄兴风雨，翻陷田屋至伤人命，一人流三千里，十人处死，十人已上灭形。 干涉湖潭主守，并同罪。 本地分不紏者，罪亦如之。 诸隐伏神鬼合起雨泽，不急救旱救苦，水主同情隐匿不为放露者，并徒三年。 亡祟门六条 诸亡者有怨於生人，曾经地府陈理，未结绝而擅於人家，作祆异克害他人，侥求功果为报，虽非损人命，而动烦立狱仇对平人者，关地府灭形。 诸无道邪祟隐显形影，放火撒血、引弄家畜之类，惊犯生人者，流三千里。 至害性命者，处死。 诸鬼祟放火在人居室，或笼柜中烧热财物舍宅，及十户者处死，不及十户徒三年，送酆都重役地分。 知情故纵不斜者，流三千里。 诸伏尸鬼怪古物精祆一切无名之鬼，妄托不系籍，身死辄停世间不去者，徒一年。 妄假威势，曲求祭祀，陷害生人，流二千里。 地主者知而不紏，同罪。 诸鬼祟伤害生人，因追捉藏伏者，徒三年。 拒捕辄与吏兵斗敌者，处死。 诸孤露无主邪鬼，假於新死故亡之便，缠绕生人有所求者，流一千里。 伤人命者，灭形。 委是家亲眷属，逐时有阙祭祀，因而作祟者，以肴馔祭享，善功为报，化谕遣退。 若受祭享福力后，依前为害生人者，送东岳，於下鬼籍中拘系。 国祀门五条 诸国家不载祠典神鬼，妄兴祆孽，诳惑人民，辄为祸福者，流三千里。 曾伤人命者，灭形。 诸鬼神虽不载祠典而能福及於民者，当考功绩，以闻推恩。 若自矜其功，而辄便妄以祆异，於人兴疾疫，须求梼祀而不退者，徒三年。 至伤人命者，流三千里。 及十人，处死。 十人已上者，灭形。 诸里社本界神祠，水陆二路，见系阳界灵感，该在祀典不得受人间曲祀及不得受人厌咒生命，违者紏察，申三官，当议重行黜陟。 诸祀典福神，有害於人间者，具所犯，奏取救裁。 诸朝列功臣名贤，因立庙祀后有害於民者，立便遣之，违而不去关东岳，并具所犯奏闻。 飞奏门二条 诸急切飞奏，限两时报应。 上天急切，兴地岳灵官行报者不同。 若违时不报，或因誊奏有失者，并杖一百。 仍许再奏，候报施行。 如驱邪院悮报，因而违者，勿论。 诸奏书紧切，限一日。 次紧，限三日。 常程，限七日报应。 并谓奏上天者。 皆用引札通落，须经历地分护送出界，辄邀拦拘滞者，一日杖一百，十日加一等，罪止徒三年。 若情理切害者，并具事因奏闻。 上清骨髓灵文鬼律卷上竟 上清骨髓灵文鬼律卷中",
      "translated_text": "The Water Bureau officials who divert water, causing floods that damage fields, houses, crops, and harm fifty or more households shall be exiled three thousand *li*. If fewer than fifty households are harmed, the penalty is three years of penal servitude. In times of natural disasters or regional anomalies, no penalty shall be imposed, but a detailed report must be submitted.\n\nDragon gods or spirit masters residing in rivers, polluted streams, or other waterways who deliberately obstruct boats or vehicles to demand sacrifices shall receive two years of penal servitude. Those who recklessly summon wind and rain, capsizing fields and houses and causing loss of life—one person exiled three thousand *li*, ten executed, and over ten annihilated—shall be punished accordingly. Interfering with the guardianship of lakes or deep pools incurs the same penalty. Local deities who fail to intervene shall be equally culpable.\n\nSpirits or ghosts responsible for summoning rain who, in times of drought or suffering, collude with water deities to conceal and withhold relief shall receive three years of penal servitude.\n\n**Six Articles of the Wandering Dead**\nIf the deceased hold grievances against the living, having previously petitioned the Underworld but unresolved, and forcibly enter a household to commit malevolent acts, harming others or seeking retribution through merit, even without taking lives, but causing disturbances or instigating disputes among the innocent, they shall be sent to the Underworld for annihilation.\n\nSpirits or malevolent entities that manifest visibly or invisibly, set fires, spill blood, or manipulate livestock to frighten or harm the living shall be exiled three thousand *li*. If they cause loss of life, they shall be executed.\n\nGhosts or spirits that set fires in human dwellings, or heat chests and cabinets to burn property or homes, resulting in ten or more households affected, shall be executed. If fewer than ten households are harmed, the penalty is three years of penal servitude, and they shall be sent to Fengdu for hard labor. Those who knowingly allow or abet such acts shall be exiled three thousand *li*.\n\nAncestral spirits, ghostly apparitions, ancient artifacts, or unnamed ghosts that falsely claim affiliation, linger in the world after death, and refuse to depart shall receive one year of penal servitude. Those who falsely assume authority, demand sacrifices, or harm the living shall be exiled two thousand *li*. Local deities who know and fail to intervene shall share the same penalty.\n\nSpirits or ghosts that harm the living and resist capture or concealment shall receive three years of penal servitude. Those who resist arrest and engage in combat with officials or soldiers shall be executed.\n\nLonely, wandering spirits that exploit the newly deceased to cling to the living and make demands shall be exiled one thousand *li*. If they cause loss of life, they shall be annihilated. If they are family members or relatives who, due to neglect in offerings, cause disturbances, they shall be appeased with food and sacrifices, and persuaded to depart. If, after receiving offerings, they continue to harm the living, they shall be sent to Mount Tai and bound in the register of lesser ghosts.\n\n**Five Articles of State Sacrifices**\nSpirits or ghosts not recorded in the state sacrificial canon who recklessly cause disturbances, deceive the people, and claim to bring fortune or misfortune shall be exiled three thousand *li*. If they cause loss of life, they shall be annihilated.\n\nSpirits or gods not recorded in the sacrificial canon but who bring blessings to the people shall have their merits examined and reported for consideration of honors. If they boast of their deeds and recklessly cause disturbances, spreading illness and demanding sacrifices without relenting, they shall receive three years of penal servitude. If they cause loss of life, they shall be exiled three thousand *li*; if ten are harmed, executed; and if over ten, annihilated.\n\nLocal community shrines within their designated boundaries, or those along water and land routes recognized as spiritually efficacious in the yang realm and included in the sacrificial canon, shall not accept improper sacrifices or curses against lives. Violators shall be investigated, reported to the Three Officials, and subject to severe demotion or promotion as deemed appropriate.\n\nBlessed spirits in the sacrificial canon that harm the people shall have their offenses reported for imperial judgment.\n\nMeritorious officials, virtuous individuals, or worthies enshrined after death who later harm the people shall be immediately expelled. If they refuse to depart, they shall be reported to Mount Tai, with their offenses fully documented.\n\n**Two Articles of Urgent Memorials**\nUrgent memorials shall receive a response within two reports. For matters of utmost celestial urgency, where earthly and mountain deities dispatch spirit officials, the timeframe may differ. Those who fail to report on time or make errors in transcribing memorials shall receive one hundred strokes. A second memorial may be submitted while awaiting a response. If the Bureau of Expelling Evil errs in reporting, no penalty shall be imposed.\n\nMemorials of extreme urgency shall be reported within one day; those of secondary urgency within three days; and routine matters within seven days—all referring to memorials submitted to heaven. All must be transmitted via official channels, passing through local deities for escort beyond their jurisdiction. Those who obstruct, detain, or delay shall receive one hundred strokes for one day, with the penalty increasing by one degree for every ten days, up to a maximum of three years of penal servitude. For matters of grave harm, the circumstances shall be fully reported.\n\n*End of the Upper Scroll of the Upper Clarity Ghost Statutes of the Essence and Marrow of the Dao*\n*Beginning of the Middle Scroll of the Upper Clarity Ghost Statutes of the Essence and Marrow of the Dao*",
      "overlap_context": "dless of size or depth, that nourish crops but do not do so seasonally, the Nine Rivers Water Emperor shall assess their merits or faults and report accordingly. Failure to comply incurs one hundred strokes.\n\nDragon gods residing in rivers, lakes, or deep pools, if they have designated domains, shall be properly worshipped. If they, without cause, roam during storms and harm crops, the penalty is one year of penal servitude. Those who demand sacrifices shall receive two years of penal servitude.",
      "start_char": 3632,
      "end_char": 4671,
      "start_sentence": 169,
      "end_sentence": 216,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.215651273727417,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\上清骨髓灵文鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "紫微官使日直元君饶洞天定正受上清大洞录行天心正法邓有功重编 玉格正条十六条 诸应本院官法服，星冠朱履。 非行持伏鬼魔者，不得披戴，违者徒一年。 不因法中事仪以劳鬼神者，徒二年。 诸应本院官法职，乃上清玉籍补充，统摄三界邪魔所受正法中诰箓，并以黄花帛上朱墨间写，装严卷轴给付讫。 本师告谕，戒行勤切，应系法中，秘语灵文，口传心授，不得隐落，违者三官纠察。 诸法官若善能传授正法与有道之士，行持救济生民有感格者，岁许具表章，奏陈当议，不次推恩。 诸应选人材，可保奏而不奏，不可奏而奏者，并徒一年。 未经奏陈辄传印诀者，罪同上。 百日内本师自觉举限内不首陈，罪亦如之。 诸应奏名，后不依师旨及有违背事仪者，徒一年。 情理切害者，本师具实告奏，先灭一身，后罪九族。 诸应有道士告传正法以救民人，主师图其财利，辄生艰阻者，杖一百。 妄受货止一匹，徒一年。 十匹加一等罪，止徒三年，仍降两资法职。 不满一匹，杖一百。 馈送酒食亦同。 诸行法官每岁拯救危笃病及二十人，转一资。 二十人已上，依仙班格升职，功行迁转法位奏闻。 若人问告诉，不为受理画即救济，并妄迁补法位不实者，并徒一年。 诸奏名人未奏诈称法职者，徒二年。 已奏而报应未下，保举审察不当即议重奏，不俟报而妄称师弟，各徒二年。 诸新补本院法官，习篆天心符文、星斗印诀、纲步之类，以金玉香木板书习，了画时以香水洗脱，弃於长流水中，违者徒一年。 诸以正法妄传非人，而希求财利，或得财而中悔不传者，并徒二年。 未得财同。 假以他法影应为正法传之者，徒三年。 诸以正法鬼律示非人，或假借倩人传写侮玩不恭，与非行法人持论泄漏诀目者，徒三年。 以法示玩鬼神者，徒一年。 故令他人以法陷鬼神者，徒二年。 至死者，流三千里。 不具威仪精洁观读者，流二千里。 诸奏上清表章词文，关直日功曹，通落束岳文书，付沿路土地收捕鬼祟，差本院神将吏兵，告奏事定轻重行遣，如合奏而不奏不合奏而奏者，已上并杖一百。 诸正法天书秘箓符传授与人者，许誊写故本，藏之名山大川龛岩石匣中，法官敕诰符文经转资尽，将已前所授者，皆焚化置之江湖中，止得留见任官文书，如不烧化以故法衣裹复投於江河内，篆符替下，笔墨朱纸砚水道冠法服诸般应替之物，尽火化沉向水中，或埋在洞府石室之内。 已上并以诀法藏之，违者徒一年。 诸传度正法，听以甲子庚申三元八节五腊本命日，奏名跪受剑印、诀目、笔砚、朱墨法具，皆祭而用之，镮券质信器具金银等物，炋镕售钱，置供献拯济贫人，不得入己侵使，违者徒三年。 诸行法官急速去世者，豫显异境，此乃上天吉命，遂使卒然而去。 无者，即是有司追取，证对不明事宜，令嗣法亲眷，速以符告救牒法服焚为灰，投长江，关水官递与其人，幽司遵行，违者徒二年。 诸法官功行果满，被召者法体二上三下，如地虫行，耳有风声，目无神光，天柱不起，天鼓不呜，便穴肾堂皆痛，神气自涌泉穴透出顶门，即便以诰箓符印函藏一处，更新衣法服端坐，遗嘱嗣法亲眷讫蜕去，前有瑞云仙仗迎引，直赴洞府，授仙官领职治事。",
      "translated_text": "The Purple Tenuity Palace Attendant, Daily Duty Primordial Lord Ráo of the Cavern-Heaven, having rectified and received the *Great Cavern Record of the Upper Clarity*, now practices the *Orthodox Rites of the Celestial Heart*—Dèng Yǒugōng’s revised edition. **Sixteen Statutes of the Jade Canon:**\n\nAll officials of this institute shall wear ritual vestments, star-crowned headdresses, and vermilion shoes. Those not engaged in subduing demonic spirits shall not don them; violators shall be sentenced to one year of penal servitude. Those who, without cause in ritual matters, trouble spirits and deities shall be sentenced to two years of penal servitude.\n\nAll officials of this institute, appointed by the *Jade Registers of the Upper Clarity* and governing the demonic spirits of the Three Realms, shall receive the orthodox talismanic writs of the *Central Scriptures*. These shall be inscribed in vermilion and black ink on yellow-flowered silk, bound into scrolls, and duly conferred. The master shall admonish them with strict precepts, and all matters pertaining to the rites—secret incantations and sacred texts—shall be transmitted orally and memorized. None shall be concealed or omitted; violators shall be investigated by the Three Offices.\n\nIf any ritual official, capable of transmitting the orthodox rites to a person of the Dao, performs acts of salvation that move the spirits, they may submit an annual memorial for consideration, and exceptional merit shall be rewarded without regard to rank.\n\nThose who fail to memorialize suitable candidates or memorialize unsuitable ones shall be sentenced to one year of penal servitude. Those who transmit seals and oral instructions without prior memorial shall incur the same penalty. If the master becomes aware of such acts within the prescribed period and fails to report them, the penalty shall likewise apply.\n\nIf, after being memorialized, one disobeys the master’s instructions or violates ritual propriety, the penalty shall be one year of penal servitude. In cases of grave harm, the master shall report the facts in full, first executing the offender, then punishing their nine clans.\n\nIf a Daoist transmits the orthodox rites to save the people, but the master obstructs them for personal gain, the master shall receive one hundred strokes. If bribes are accepted, even one bolt of silk shall incur one year of penal servitude. For every ten bolts, the penalty shall increase by one degree, up to a maximum of three years of penal servitude, and the master shall be demoted by two ranks in ritual office. Accepting less than one bolt shall incur one hundred strokes. Offerings of wine and food shall be treated likewise.\n\nRitual officials who each year save twenty critically ill persons shall be promoted by one rank. Those who save more than twenty shall be advanced in office according to the celestial register, their merit and conduct memorialized for promotion. If, when petitioned, they refuse to accept cases or delay salvation, or if they falsely promote others in ritual office, they shall be sentenced to one year of penal servitude.\n\nThose who falsely claim ritual office before being memorialized shall be sentenced to two years of penal servitude. If, after memorialization but before the response arrives, improper recommendations or investigations are made, or if one falsely claims a master-disciple relationship, each shall incur two years of penal servitude.\n\nNewly appointed officials of this institute shall practice celestial talismans, star-seal incantations, and pacing the stars, inscribing them on plates of gold, jade, fragrant wood, or other materials. Upon completion, they shall wash the inscriptions away with fragrant water and cast them into flowing waters; violators shall be sentenced to one year of penal servitude.\n\nThose who recklessly transmit the orthodox rites to unworthy persons for profit, or who accept payment but later refuse to transmit them, shall be sentenced to two years of penal servitude. The same penalty applies if no payment is received. Those who falsely present other methods as the orthodox rites shall be sentenced to three years of penal servitude.\n\nThose who show the orthodox rites or ghost statutes to unworthy persons, or who lend or entrust them to others for copying, thereby disrespecting or mocking them, or who discuss or reveal their secrets to uninitiated persons, shall be sentenced to three years of penal servitude. Those who use the rites to toy with spirits shall be sentenced to one year. Those who deliberately cause others to use the rites to entrap spirits shall be sentenced to two years. If death results, the penalty shall be exile to three thousand *li*. Those who fail to maintain solemnity and purity while reading the texts shall be exiled to two thousand *li*.\n\nAll memorials to the Upper Clarity shall be submitted through the duty-day functionaries, and documents shall be transmitted to the Five Marchmounts to dispatch local earth deities to capture malevolent spirits. The institute’s divine generals, officers, and soldiers shall be assigned to execute the decrees according to the gravity of the matter. Those who fail to memorialize when required, or memorialize when not required, shall receive one hundred strokes.\n\nWhen transmitting the celestial scriptures, secret registers, talismans, or orthodox rites to others, one may make copies for storage in the caverns of famous mountains and great rivers, or in stone caskets. When a ritual official’s decrees, talismans, or texts are exhausted upon promotion, all previously received materials shall be burned and cast into rivers or lakes. Only current official documents may be retained. If old ritual vestments, talismans, brushes, ink, vermilion, paper, inkstones, water vessels, coronets, or other worn-out items are not burned but instead wrapped in old vestments and cast into rivers, or if talismans, seals, and other items are buried in cavern-heavens or stone chambers, all such materials shall be concealed according to the oral instructions; violators shall be sentenced to one year of penal servitude.\n\nThose who transmit the orthodox rites shall do so on the days of *jiǎzǐ*, *gēngshēn*, the Three Origins, the Eight Festivals, the Five La days, or their own birthdays. The recipient shall kneel to receive the sword, seal, oral instructions, brush, inkstone, vermilion, and ritual implements, all of which shall be consecrated before use. Any gold, silver, or other valuables received as pledges shall be melted down and sold, the proceeds used for offerings or to aid the poor. None shall be kept for personal use; violators shall be sentenced to three years of penal servitude.\n\nIf a ritual official passes away suddenly, having foretold extraordinary signs, it is a celestial blessing, and their departure shall be swift. If no such signs appear, the authorities shall investigate. If the circumstances are unclear, the heir or kin shall promptly burn the talismanic notices, petitions, and ritual vestments to ashes and cast them into the Yangtze River, notifying the water officials to convey them to the deceased. The underworld authorities shall comply; violators shall be sentenced to two years of penal servitude.\n\nWhen a ritual official’s merit and conduct are complete and they are summoned, their body shall rise twice and fall thrice, like an earthworm. Their ears shall hear the sound of wind, their eyes shall lose their divine light, their celestial pillar shall not rise, and the celestial drum shall not sound. Pain shall arise in the kidney chamber, and their spirit shall surge from the *Yǒngquán* point to exit through the crown. They shall then gather their decrees, registers, talismans, seals, and containers in one place, don fresh ritual vestments, sit upright, and leave final instructions to their heir. Their body shall shed like a cicada’s shell, and a propitious cloud with a celestial retinue shall welcome them, escorting them directly to their cavern-heaven to receive a celestial office and govern affairs.",
      "overlap_context": " beyond their jurisdiction. Those who obstruct, detain, or delay shall receive one hundred strokes for one day, with the penalty increasing by one degree for every ten days, up to a maximum of three years of penal servitude. For matters of grave harm, the circumstances shall be fully reported.\n\n*End of the Upper Scroll of the Upper Clarity Ghost Statutes of the Essence and Marrow of the Dao*\n*Beginning of the Middle Scroll of the Upper Clarity Ghost Statutes of the Essence and Marrow of the Dao*",
      "start_char": 4671,
      "end_char": 5927,
      "start_sentence": 217,
      "end_sentence": 255,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.773778200149536,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\上清骨髓灵文鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "若法体觉知，不能支持，当处土地宠助嗣法亲眷，依上法函藏，违者流三千里，情理重者处死。 上清骨髓灵文鬼律卷中竟 上清骨髓灵文鬼律卷下 紫彻官使日直元君饶洞天定正受上清大洞箓行天心正法邓有功重编 仪三十六条 诸应正法鬼律文篆，并以香箧彩囊巾笋贮之。 遇检阅，存神结界入静，方得开卷，不得过五，行秘之，慎勿令鬼神盗观。 诸善民能驱邪辅正，实有济物之功者，收录奏名，传度正法，补职受位。 诸应院中法具，谓如剑印、笔墨朱砚、冠履、法水之类。 未经奏祭者，不得擅便私用。 诸应传度弟子，肘步投师，师升坛说戒，露刺饮丹，分镮破券，以誓盟言。 次与诀目符文，宣示真诰，跪授官职印剑之类。 师启白上圣，落三尸於四体，释万罪於九玄。 关报所属行持，上合天心。 诸应神将吏兵，谓东岳差到者。 明受报应到院讫，以酒食钱马犒，设常守本职，准备驱用，不得私使。 诸行法官，经过有神祠处，搯天丁诀，呜天鼓，集身中灵官护法将吏，随行以布威仪，神自畏伏。 诸应法官，早朝取服旺气，作用奏书，设醮不得烧乳香。 诸应世间人命，禀天注寿禄。 如经本院拯救，所病不起，即是数尽劫终。 此即不可，行移文字，必为虚设。 诸应拯济世人，行遣文理，不得繁 杂。 可直言至诚之事，仍声说前人性",
      "translated_text": "Should the ritual body sense its decline and prove unable to sustain itself, the local earth deity shall be invoked to assist the heir and kin in securing the decrees, registers, talismans, seals, and containers according to the prescribed method. Violators shall be exiled three thousand *li*; those whose transgressions are grave in both fact and principle shall be put to death.\n\n---\n\nHere ends the *Middle Scroll of the Divine Writ of the Marrow of the Dao: Ghost Statutes of the Numinous Texts*.\nHere begins the *Lower Scroll of the Divine Writ of the Marrow of the Dao: Ghost Statutes of the Numinous Texts*.\n\nCompiled and revised by Deng Yougong, Registrar of the Purple Clarity Bureau, Daily Attendant of the Celestial Office, and Ordained Master of the Great Cavern Register of the Highest Clarity, Practitioner of the Heavenly Heart Orthodox Dao.\n\n**Thirty-Six Articles**\n\nAll authentic ghost statutes, talismanic writs, and scriptures of the orthodox Dao shall be stored in fragrant caskets, brocade satchels, or bamboo containers. When reviewing them, one must enter stillness, establish a sacred boundary, and invoke the spirits before unsealing the scrolls. No more than five may be opened at once. These texts must be guarded in secrecy, lest ghosts and spirits steal a glimpse.\n\nThose among the faithful who drive out evil, uphold the Dao, and truly render aid to beings shall be recorded and memorialized, transmitted the orthodox teachings, and appointed to office with rank.\n\nAll ritual implements within the sanctuary—such as swords, seals, brushes, ink, cinnabar, inkstones, headdresses, footwear, and ritual water—may not be privately used without prior petition and offering.\n\nWhen transmitting the teachings to disciples, the disciple shall approach the master with measured steps, whereupon the master ascends the altar to recite the precepts. The disciple shall then undergo bloodletting, consume the elixir, and divide the ring to break the contract, swearing oaths of allegiance. Next, the master shall confer the esoteric signs, talismanic writs, and revealed scriptures, bestow the true instructions, and kneel to present the official regalia, seals, and swords. The master shall then invoke the Most High, expelling the Three Worms from the four limbs and absolving the myriad sins across the Nine Mysteries. Reports shall be filed with the relevant authorities to ensure alignment with the Heavenly Will.\n\nAll spirit generals, officers, and soldiers—such as those dispatched by the Eastern Marchmount—shall, upon arrival at the sanctuary, be received with offerings of wine, food, paper money, and spirit horses. They shall remain in their assigned posts, prepared for deployment, and may not be privately employed.\n\nWhen ritual masters pass by sacred shrines, they shall form the Mudra of the Heavenly Soldiers, strike the Heavenly Drum, and summon the guardian generals and protective officers within their bodies to accompany them, thereby manifesting majesty. The spirits shall then submit in awe.\n\nRitual masters shall, at dawn, absorb the vital *qi* of the day’s dominant phase. When drafting memorials or conducting rites, they shall not burn frankincense.\n\nAll human lives are endowed by Heaven with allotted lifespan and fortune. If, after this sanctuary’s intercession, the afflicted still do not recover, it is because their fate is exhausted and their kalpa has ended. In such cases, further petitions and documents shall be futile.\n\nWhen aiding and delivering the world, the language of petitions and decrees must not be convoluted. Speak only with utmost sincerity, and clearly state the nature of the supplicant.",
      "overlap_context": "rise in the kidney chamber, and their spirit shall surge from the *Yǒngquán* point to exit through the crown. They shall then gather their decrees, registers, talismans, seals, and containers in one place, don fresh ritual vestments, sit upright, and leave final instructions to their heir. Their body shall shed like a cicada’s shell, and a propitious cloud with a celestial retinue shall welcome them, escorting them directly to their cavern-heaven to receive a celestial office and govern affairs.",
      "start_char": 5927,
      "end_char": 6464,
      "start_sentence": 256,
      "end_sentence": 279,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.483653783798218,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\上清骨髓灵文鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "命，系系天司，夺禄减算乞，不在今来所陈之限，明乞报应。 诸授披诉狂邪祆怪者，法官变神受词，押印遣行。 诸应醮设，许奏三清玉帝钱马外，非时不得辄有亵渎。 焚奏钱马，先以镇信彩缯同化，差功曹直符赍送。 诸应醮奏於三清玉帝位，傍列采访使者一位，余位不得近帝座。 诸应入靖烧香行事，修写法中文字，先以斗盖，勿视凡目。 诸被告诉致死而来呼煞者，以盖镇之。 诸应治牛马六畜温者，问所损过数，牒年王神驱之。 诸应授质信，量其至诚收售之，价钱为三分。 许用一置供献，一施贫者，一即赡道。 诸立狱治病移文不伏者，并摄囚治之。 诸应魅乱发魇心肾虚困者，施符箓吞佩镇之。 诸应治小儿惊叫夜啼，安家灶檐神、四天王、飞天捷疾神，以三光符治之。 诸应行法官，逐日拯救世人，合用赡道之费，无受民贿，自然上天赐禄。 遇阙即上章表言诚，自有阴助，更无乏少。 如辄受民物，则世用不敷。 诸人家灶铺营业被邪厌闭者，以三光符遣神治之。 诸应修造营茸之类，牒太岁安抚，所辖土公等神，无令兴害。 诸应有怪异於陂塘堤岸，以至修筑不常、非时为害损坏者，要当处土地驱逐离彼，仍以三光符镇之，违而不去者，依法理断。 诸遇瘟疫流行，人罹疾苦，依格札委土地等神外，牒年王神收回毒气，合飞奏者，本院官禹步变神，默言口章，以闻诸孤民不宜。 男女贫无嗣息，先以法退三刑六害星，仍以箓佩。 诸应世人所居不利，阴阳不和，上下克害，连年困笃，累岁述澶者，授之以正箓。 诸传度正法官《受戒仪》云：夫道行己，而为人所以能化其道者，寔由心之正也。 正心而明，可持心以度人，人无不正也。 故万法因心而生，因心而化。 能正己之心，上合天心，则未有不蒙其正焉。 行己之道，以正其邪，而邪莫不由伏焉。 然邪曲之行况，因心之不正，而为外物诱之。 因外邪之所蔽，而内有所不明，则正性缺然。 而昧邪驰骋畋猎，令人心发狂，是为外物蔽之。 如饮酒之荡正性，色欲之汨真情，财利以忘仁义，爱恶以成是非，皆缘情而迷至理，是谓大患。 仍协三恶业结三官，因兹所见，三界不息而沈滞不休也。 且不杀者，仁也。 不盗者，义也。 不淫者，礼也。 不欺者，信也。 不惑者，智也。 六根七情，十恶之愆，宜须戒之。 不养父母，不敬师友，不念孤幼，不报国恩，不施正信，不识上下，切宜戒之。 不能束敛身心，敬畏天道，学太上法，自利利人，化道后昆。 信服师友，遵奉教诲，不侮先觉，不轻信义，不为悖逆，不枉贿赂，不违天背地。 一以不遵，罪不可这，道法不神，一身受殃，九族同罪。 当须归投无上道，无穷法。 无量众发此大誓，方可传付上清诀目，佐天行化，助国济民，治病扶危，驱邪辅正。 宜对大道阖座高真，心念口言，自今日始，常怀誓盟，永不忘失，稽首顿首，感激之至。 已上仪登坛唱礼，众官同赞咏。 诸应治事，量其轻重，行持不得妄动神将吏兵。 如接押辞状画时行遣，勿得妄入鬼神之罪。 诸应传度正法，以法中用日，设醮一座，名曰传度醮。 奏献钱马一百二十分，章醮仪中圣位列献。 如数内臧半奏者，从之。 告报天地受举官，保明状讫，依法付嘱符诀、官告、真箓之类。",
      "translated_text": "The fate of all lives is governed by the celestial bureaus; to petition for the restoration of lost fortune or reduced lifespan falls beyond the scope of present supplications, yet the karmic response shall be made manifest.\n\nFor all who submit complaints of madness, heresy, or demonic disturbances, the ritual master shall transform into a divine form to receive their words, affix the seal, and dispatch the decree.\n\nIn all offerings and rites, beyond the presentation of paper money and horses to the Three Clarities and the Jade Emperor, no untimely acts of irreverence shall be permitted. When burning paper money and horses, first combine them with silk of the five colors as a token of sincerity, then dispatch the *gongcao* and *zhifu* spirits to convey them.\n\nFor all rites and petitions directed to the Three Clarities and the Jade Emperor, a single *Cai Fang* Envoy may be positioned beside the throne, but no other deities shall approach the imperial seat.\n\nWhen entering the oratory to burn incense and conduct affairs, all texts written in the course of ritual practice must first be covered with the Dipper’s lid, shielding them from profane eyes.\n\nFor those who come to invoke vengeance upon killers who caused death, employ the *xuan* lid to suppress them.\n\nWhen treating cattle, horses, or other livestock afflicted by pestilence, inquire into the number of losses, then petition the Year-Ruling Deity to expel the harm.\n\nFor all who present offerings of faith, assess their sincerity before accepting, setting the price at three parts: one for sacrificial offerings, one for distribution to the poor, and one for the sustenance of the Dao.\n\nFor those who resist the documents of judgment in cases of illness or imprisonment, seize and detain them for adjudication.\n\nFor those possessed or tormented by malevolent spirits, causing depletion of the heart and kidneys, administer talismans for ingestion and wearing to suppress the affliction.\n\nFor children suffering from night terrors and nocturnal crying, pacify the household stove and eaves deities, the Four Heavenly Kings, and the Flying Swift Spirits, employing the Three Luminaries Talisman to remedy the condition.\n\nAll ritual masters who daily deliver the world must use the funds for the sustenance of the Dao without accepting bribes from the people, for Heaven naturally bestows its blessings. When resources are lacking, present a memorial with utmost sincerity, and unseen aid shall arrive without want. If one recklessly accepts worldly goods, the means for practice shall be insufficient.\n\nFor households whose stoves, shops, or businesses are afflicted by malevolent hexes or closures, employ the Three Luminaries Talisman to dispatch spirits for resolution.\n\nFor all construction or renovation projects, petition the Great Year Deity to placate the local Earth Deities and other spirits under its jurisdiction, preventing harm from arising.\n\nFor strange occurrences in ponds, embankments, or dikes—whether from irregular repairs, untimely damage, or persistent harm—summon the local Earth Deity to expel the disturbance. If the affliction persists, employ the Three Luminaries Talisman to suppress it, and those who defy expulsion shall be adjudicated by law.\n\nWhen epidemics spread and people suffer from illness, follow the prescribed procedures to commission the local Earth Deities and other spirits, then petition the Year-Ruling Deity to withdraw the toxic *qi*. For cases requiring an urgent memorial, the ritual master of this sanctuary shall perform the *Yu Bu* step, transform into a divine form, and silently recite the oral petition to report the plight of the orphaned and destitute.\n\nFor men and women who are impoverished and childless, first employ ritual to repel the Three Punishments and Six Harms stars, then bestow talismans for wearing.\n\nFor those whose dwellings are inauspicious, where *yin* and *yang* are disharmonious, and where upper and lower clash, leading to years of hardship and misfortune, confer upon them the Orthodox Register.\n\nThe *Rites for Receiving the Precepts* in the transmission of the Orthodox Dao states: The Dao is cultivated in oneself yet applied to others, and the power to transform through the Dao arises from the rectitude of the heart. With a rectified and enlightened heart, one may guide others, and none shall remain unaligned. Thus, the myriad dharmas arise from the heart and are transformed by it. By rectifying one’s own heart to align with the celestial heart, none shall fail to receive its rectitude.\n\nTo conduct oneself in the Dao is to correct the deviant, and no deviation shall fail to submit. Yet the conduct of the crooked and perverse stems from an unrectified heart, led astray by external things. When external deviations obscure the inner, and clarity is lost within, the true nature is diminished, and delusion runs rampant like a hunt, driving the heart to madness—this is the obscuration of external things.\n\nLike the intoxication of wine that unsettles true nature, the lust for beauty that muddies true sentiment, the pursuit of wealth that forgets benevolence and righteousness, or the biases of love and hatred that distort right and wrong—all arise from emotions that obscure the ultimate principle, constituting the greatest peril. These align with the Three Evil Karma and bind the Three Officials, perpetuating the cycle of the Three Realms without respite.\n\nNot to kill is benevolence. Not to steal is righteousness. Not to engage in licentiousness is propriety. Not to deceive is trustworthiness. Not to be deluded is wisdom. The six roots and seven emotions, along with the transgressions of the ten evils, must be guarded against.\n\nTo neglect the support of parents, disrespect teachers and friends, disregard the orphaned and young, fail to repay the nation’s grace, withhold true faith, or disregard hierarchy—these must be strictly avoided.\n\nOne must restrain body and mind, revere the celestial Dao, study the methods of the Most High, benefit oneself and others, and transmit the Dao to future generations. Trust and serve teachers and friends, heed their teachings, honor the enlightened, uphold faith and righteousness, avoid rebellion, refrain from corrupt bribes, and never defy Heaven or betray Earth. Even a single transgression brings unforgivable sin; the Dao’s power wanes, and the individual suffers calamity, while the nine clans share in the guilt.\n\nOne must take refuge in the Supreme Dao and its boundless methods. Only after the immeasurable multitude has sworn this great oath may the esoteric formulas of the Shangqing be transmitted, to assist Heaven in its transformations, aid the nation and deliver the people, heal the sick and rescue the imperiled, expel the deviant and uphold the upright.\n\nBefore the assembly of the Great Dao and the exalted perfected, with heartfelt devotion and spoken words, from this day forward, uphold this covenant without fail. Bowing deeply, one is moved to the utmost gratitude.\n\nThe above rites are performed upon ascending the altar, with all officers joining in the chant.\n\nFor all matters addressed, assess their gravity and conduct the rituals without recklessly mobilizing the divine generals, officers, or soldiers. When receiving and dispatching written complaints, do not falsely implicate spirits or deities in wrongdoing.\n\nFor the transmission of the Orthodox Dao, on the designated day within the ritual period, conduct an offering rite known as the *Transmission Offering*. Present 120 portions of paper money and horses, with the deities of the memorial and offering rites listed in order of veneration. If half the amount is offered, it shall be accepted.\n\nAfter reporting to Heaven and Earth and receiving the official appointment, and once the guarantor’s statement is complete, proceed to bestow the talismanic formulas, official decrees, and authentic registers in accordance with the ritual.",
      "overlap_context": "s, they shall not burn frankincense.\n\nAll human lives are endowed by Heaven with allotted lifespan and fortune. If, after this sanctuary’s intercession, the afflicted still do not recover, it is because their fate is exhausted and their kalpa has ended. In such cases, further petitions and documents shall be futile.\n\nWhen aiding and delivering the world, the language of petitions and decrees must not be convoluted. Speak only with utmost sincerity, and clearly state the nature of the supplicant.",
      "start_char": 6464,
      "end_char": 7730,
      "start_sentence": 280,
      "end_sentence": 331,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.98873805999756,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\上清骨髓灵文鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "关报束岳割移，名籍附天曹，原赦九族出离幽冥，超升生界。 登坛节次行事，并依本法。 诸应驱邪院行法官，并称都大，统摄三界邪魔。 事初补右判官，次右大判官，次左判官，次左大判官，已上并谓同管勾院事。 次功格高者，升入仙班，补为都天大法主同判院事。 次加九天金阙大夫，谓一年内，救民及二十人凶岁旱涝枯槁，刻日应梼升补者。 次水部尚书，次木部尚书，次土部尚书，次金部尚书，次火部尚书。 已上谓岁救数过二十人者。 次或救大害功行优甚者，递相转补次紫微宫使日直元君谓岁终，助国除灾、安宁境土、遣鬼兵阴助帝祚太平者，升上职。 又一年内，能驱灭分野蝗虫灾怪，持法除去者，加九天金阙御史。 又一年可发志愿，自於名山建立坛场，投词献章，上祝人君万寿实有验应者，加金阙上仙侍中。 又一年自了性理出於物外，提拔群迷出离五苦，亲诣南曹添注，主圣臣贤九族生天，万物受恩者，加紫府上相。 次玄都大相，次太玄上相，次太极上相，次金阙上相。 又一年通证大道无穷，不执文字，指喝有验，能治江湖河海蛟龙作害山崩派决，实有利国济民、馘除大孽之功者，加无极上相。 已上自日直元君至无极上相，．计九位迁职者，合授上清九等大箓，方许入此宪格，余职并依诸仙官。 以三元为首，洞神已下转行，初下元一品仙官。 次知北极驱邪院使，中元一品仙官，判北极驱邪院。 次上元一品仙官，判酆都使。 已上有功行果业，次第迁转，身登金阙，侍列三清。 诸应发三清、玉帝、北斗三光符，行事官变神，上奏具所请事因，称臣今准式付发遣，愿如臣言，祝毕即便给直符使，符到奉行。 诸应行法官出入，常存领六丁、四直土地、监印力士等神，随行以法嘱之，无令失事。 诸行法官朝上帝，驱瘟邪，断怪祟，须先戴三台北斗，变为驱邪院使。 诸朝见上帝奏请毕，即诣天枢院，部领四天王、十二大神、八金刚、六丁六甲、天蓬天猷元帅、火铃将军、五雷风雨神，直出天门。 诸立狱须奏，闻申泰山，具事仪，称述已於某月日，於某方立建天狱。 奏上帝，言五斗狱。 式十二条 诸造驱邪院印，方一寸八分，以金玉为之，篆以天文。 雷霹木造者听。 召六丁六甲使者，结界守护。 置讫，以红朱傅印面上，先闻上界，应造法中印记惟此。 次同所授官花押字样，关东岳，照会讫，方得使用。 臣洞天普受真人指示，得天篆骊邪院并都天大法主星印，二面誊本讫，埋於故地。 遂以印式契对，今世间所用，大尺一寸八分，即小尺二寸一分，黍尺二寸四分，皆同也。 其分寸上天法式数度所表，使鬼神不测於毫发之内，故标於此，为法定制。 诸篆天文符箓，以天德月德水，六丁六甲之笔，黑帝墨，太阳灵朱，五龙宝砚，一如传度法诀收取，奏上界讫，方得行用。 诸应伏凶猛鬼神，切要委差神将，仍左右掐局邪诀，又以左右斗盖之己身，宣敕云：汝过罪已疏之，吾以救民为心。 诸应奏醮，为人禳灾，先奏星宿真君科状，后坐称弟子禳灾，集福延龄，命素代厄，衣禄虔诚置备，知鉴达诚。 诸应上清罡步念斗咒，至天罡住便弹印诀，却用天罡印指出。 若以符中咒，唯是斗以贪狼星起之。 诸祭神，以春夏秋冬四季六甲等日记之。",
      "translated_text": "To report to the Eastern Peak for transfer and reassignment, inscribe the name in the celestial registers, thereby petitioning for the pardon of the nine familial clans to depart the nether realms and ascend to the realm of the living. The sequence of ritual proceedings upon the altar shall follow the original method.\n\nAll officials of the Demon-Quelling Court shall be addressed as *Grand Commanders*, governing the demonic forces across the Three Realms. Initially, one is appointed as *Right Vice-Judge*; next, *Right Grand Judge*; then *Left Vice-Judge*; and finally *Left Grand Judge*—all of whom shall concurrently oversee the affairs of the Court. Those whose merit and achievements are eminent shall ascend to the ranks of immortals and be appointed as *Grand Daoist Masters and Co-Judges of the Court*. Further, those who, within a year, have rescued twenty or more people during calamitous years of drought, flood, or famine, and whose prayers yield immediate results, shall be promoted to *Grand Master of the Nine Heavens’ Golden Gates*.\n\nNext, in ascending order: *Minister of the Water Department*, *Minister of the Wood Department*, *Minister of the Earth Department*, *Minister of the Metal Department*, and *Minister of the Fire Department*—these ranks apply to those who have saved more than twenty lives in a year. Those whose merit in averting great disasters is exceptionally profound shall be progressively promoted to *Purple Tenuity Palace Envoy* and *Day-Watch Primordial Lord*, the latter granted to those who, by year’s end, have aided the state in disaster relief, pacified the land, and dispatched ghostly soldiers to secretly assist the imperial reign in achieving peace. Those who, within a year, can expel or eradicate locust plagues and monstrous calamities from the designated celestial sectors shall be appointed as *Censor of the Nine Heavens’ Golden Gates*.\n\nFurther, those who, within a year, may vow to establish altars in renowned mountains, submit memorials, and offer prayers for the sovereign’s longevity—with verifiable efficacy—shall be elevated to *Golden Gates Supreme Immortal and Attendant-in-Ordinary*. Those who, within a year, attain self-realization beyond the mundane, guide the deluded from the Five Sufferings, and personally journey to the Southern Bureau to inscribe their names—thereby ensuring the sage rule of the sovereign, the virtue of ministers, the ascent of the nine clans to heaven, and the benefaction of all beings—shall be promoted to *Purple Palace Grand Chancellor*. The subsequent ranks are: *Mystic Capital Grand Chancellor*, *Supreme Mystic Grand Chancellor*, *Supreme Ultimate Grand Chancellor*, and *Golden Gates Grand Chancellor*.\n\nThose who, within a year, fully realize the boundless Dao, transcend reliance on written scripture, and through direct instruction achieve verifiable results—such as quelling the harm caused by dragons in rivers, lakes, seas, or landslides, and whose deeds truly benefit the state and deliver the people while excising great calamities—shall be elevated to *Supreme Ultimate Grand Chancellor*. From *Day-Watch Primordial Lord* to *Supreme Ultimate Grand Chancellor*, these nine ranks of promotion entail the conferral of the *Nine Grades of Supreme Clarity Registers*, after which one may enter this system of regulations. All other ranks shall follow the protocols of the immortal officials.\n\nThe Three Primordials serve as the foundation, with the *Cavern Spirit* rank and below proceeding in sequence, beginning with the *First Lesser Primordial* as *First-Rank Immortal Official* and *Supervisor of the Northern Culmen Demon-Quelling Court*. The *Middle Primordial* as *First-Rank Immortal Official* and *Judge of the Northern Culmen Demon-Quelling Court*. The *Upper Primordial* as *First-Rank Immortal Official* and *Judge of the Fengdu Court*. Those whose merit, conduct, and karmic deeds are exemplary shall ascend in sequence, their persons entering the Golden Gates to attend the Three Clarities.\n\nWhen issuing talismans of the Three Clarities, the Jade Emperor, or the Three Luminaries of the Northern Dipper, the officiating official shall transform into a deity and submit a memorial detailing the purpose of the petition, declaring: *\"Your servant, in accordance with the prescribed rites, now dispatches this decree. May it be as I have stated.\"* Upon concluding the prayer, the talisman-bearing messenger shall be immediately dispatched, and upon its arrival, the decree shall be executed.\n\nAll officiating officials, when entering or exiting, shall constantly visualize the presence of the Six Ding, Four Straight Earth Deities, and Seal-Monitoring Valiant Spirits, commanding them through ritual to follow without fail. When officiating officials ascend to the Celestial Court to expel pestilential demons or sever malevolent influences, they must first don the Northern Dipper of the Three Terraces and transform into the *Envoy of the Demon-Quelling Court*.\n\nAfter presenting the memorial and petition to the Celestial Emperor, proceed to the Celestial Pivot Court to command the Four Heavenly Kings, Twelve Great Deities, Eight Vajras, Six Ding and Six Jia, Marshals Tianpeng and Tianyu, Firebell Generals, and the Five Thunder Wind-Rain Deities, and exit through the Celestial Gate.\n\nWhen establishing a celestial prison, a memorial must be submitted to inform Mount Tai, detailing the proceedings and stating: *\"On such-and-such a day of such-and-such a month, a celestial prison was established in such-and-such a direction.\"* Memorialize the Celestial Emperor regarding the *Five Dipper Prison*, adhering to the twelve prescribed protocols.\n\nThe seal of the Demon-Quelling Court shall measure one *cun* and eight *fen* in width, crafted from gold or jade, and inscribed with celestial script. Seals made from thunder-struck wood are also permissible. Summon the Six Ding and Six Jia messengers to establish a boundary for its protection. Once placed, apply red cinnabar to the seal’s surface, first memorializing the upper realms. Only this seal may be used for all talismanic inscriptions in the ritual method. Next, match the seal with the official’s signature and floral cipher, report to the Eastern Peak for verification, and only then may it be employed.\n\nYour servant, the *Perfected of Universal Reception from the Grotto-Heavens*, having received the celestial script of the *Demon-Quelling Court and Grand Daoist Master’s Stellar Seal* from instruction, transcribed two copies and buried them in the original site. The seal’s dimensions were then compared: the large *chi* measures one *cun* and eight *fen*, equivalent to two *cun* and one *fen* of the small *chi*, or two *cun* and four *fen* of the millet *chi*—all identical. These measurements, as ordained by celestial law, confound even spirits and deities within the minutest fraction, and are thus established here as the fixed standard for ritual regulation.\n\nWhen inscribing celestial script talismans and registers, use water from the *Celestial Virtue* and *Monthly Virtue*, brushes of the Six Ding and Six Jia, ink of the Black Emperor, cinnabar of the *Luminous Solar Essence*, and inkstones of the *Five Dragons’ Treasure*—all prepared in accordance with the transmission method. Only after memorializing the upper realms may they be employed.\n\nWhen subduing fierce and ferocious spirits, it is essential to dispatch divine generals, while simultaneously forming mudras with the left and right hands and invoking the Dipper’s canopy over oneself. Proclaim the decree: *\"Your transgressions have been absolved. My intent is to save the people.\"*\n\nWhen conducting offering rites to beseech the stars for disaster aversion, first memorialize the *True Lords of the Constellations* with the prescribed documents. Then, seated, declare: *\"Your disciple beseeches for disaster aversion, the accumulation of blessings, the prolongation of life, the substitution of calamities, and the augmentation of fortune and emolument. Humbly prepared, may the enlightened perceive my sincerity.\"*\n\nWhen reciting the *Northern Dipper Mantra* during the *Perfected’s Dipper Steps*, halt at the *Celestial Pivot*, flick the seal mudra, and then point with the *Celestial Pivot Seal*. If reciting the mantra within a talisman, begin with the star *Greedy Wolf*.\n\nWhen making offerings to the deities, record the dates using the *Six Jia* days of the four seasons: spring, summer, autumn, and winter.",
      "overlap_context": "tual period, conduct an offering rite known as the *Transmission Offering*. Present 120 portions of paper money and horses, with the deities of the memorial and offering rites listed in order of veneration. If half the amount is offered, it shall be accepted.\n\nAfter reporting to Heaven and Earth and receiving the official appointment, and once the guarantor’s statement is complete, proceed to bestow the talismanic formulas, official decrees, and authentic registers in accordance with the ritual.",
      "start_char": 7730,
      "end_char": 8987,
      "start_sentence": 332,
      "end_sentence": 371,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.054733753204346,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\上清骨髓灵文鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "春六甲，夏六丙，秋六庚，冬六癸。 日於门户外，以斋果香枣汤三分，供养三界直符四直功曹。 一立土也先，匕土也钱。 后具述情意云：吾奉玉皇敕，佐天行化，助国济民。 凡行符法，断绝为祸邪祟，治病扶危，作福祈祥，皆凭使者通达上下诸位圣众。 今日赍备酒果钱马，以伸醮礼。 伏望使者恩慈，大布威光，特垂灵佑。 次三上酒，化钱念咒，誓功曹云：吾闻夙修大道，今作至神，莫不以功行居先，救民是切。 故显幽赴冥，出水入火。 变现千途，威通万状。 荷戈挂甲，负鼓擎钟。 出役纵横，来去无碍。 邪魔闻之胆碎，病者见之安宁。 吾以正法降魔，用汝威灵伏助，收伏鬼祟，断绝祸源，福及良民，功归善道。 今以祭礼，略报神勋，少谢功勤，深劳戮力，伏请各各醉饱。 誓神将文 汝等各宜醉饱酒饭，整肃威仪。 具严天戒，祇畏帝命。 奋威武之柄，致平定之功。 嘉绩有成，明敦响答。 奉咨束岳，差来神将吏兵。 众素韬神武，夙蕴机谋。 闻望清严，仪德英伟。 响应镇岳之命，来专讨伐之权。 震动则凶魅裂形，眦睚则风云变色。 灵戈所指，大恶无前。 辅国救民，济时利物。 推心事道，宜莫好功。 当院早膺，仙诰素被。 道麻误叨天吏之权，惟藉至神之佑。 上则镇身保命，学道事天，资我身真，冀膺天爵。 中则显扬圣化，昭布阴功，推此威灵，愿成绩绪。 下则救人利物，治病去邪，诛前凶祆，粤隆福泰。 庶使累成，善效响应。 幽微德着而汝等同分，其利功成而汝等共享。 其荣尽举当世之便宜，共望正法之超冠。 利而不害，威而有惩。 凡事亏中，失顺害物。 违天致讨，行诛芟邪。 辅正以神功而胜凶德，以妙化而胜奸谋。 其何以当，人孰能御。 惟尔有神，辅我大道。 急急如律令。 诸应神将吏兵，以法诀付嘱，常当守护行持。 正法榜式 北极驱邪院： 当院见管押将吏兵等，系奉 玉帝救命差拨，赴本院护法行化，助国济民，救度覃品，咸归正道。 切虑不知，本院有天印，方一寸八分，或方二寸一分，或方三寸，或方五寸。 管辖天兵百千亿万垓，印篆一毫一纹，容隐三十六万垓兵将，随吾印转。 邪魔闻之胆碎，病者见之安宁。 上帝赐之，力士捧擎，从吾所行。 印中兵将，百千亿万垓。 来往如风，无形无边，变化不穷。 隐吾印中，召之则至。 或见大身，褊满虚空。 头戴昆仑，肩担日月，手把帝钟，足踏夔龙。 或见小身，入微尘中，於丝发内。 视大威通，护持正法，千变万化。 救度有情，不自伐功。 玄妙之力，道法无穷。 切恐所管神将吏兵等，不知有此法令，故意违慢。 遣汝受罪，不轻当院。 今将天兵将吏，岳兵将吏，分屯番次，准备缓急。 使唤如闻当院呼召，急须速至。 如不系当番，或不呼召，并仰港隐六合之内，自隐自伏。 具下项： 一天兵将吏等，常切准备呼召。 如不呼召，不得擅离天界。 南斗天兵，三千六百人。 黑杀神兵，五万人。 北斗部兵将。 三五部兵将。 正一部兵将。 放光部兵将。 天丁众神。 力士众神。 金刚众神。 大明众神。 飞龙骑吏，一千人。 斩龙骑吏，一千人。 央龙骑吏，一千人。 统兵助法神将，二员。 一泰山差到兵将，仰分作两番，每一日一替，参随当院行法官出入。 遇有急速干事，不在此限。",
      "translated_text": "In spring, the six *Jia* days; in summer, the six *Bing* days; in autumn, the six *Geng* days; in winter, the six *Gui* days. On these days, outside the door, offer three portions of vegetarian fruits, incense, jujubes, and soup to the *Direct Attendants of the Three Realms* and the *Four Duty Merit Officers*. First, erect an earthen altar, then place earthen coins. Thereafter, declare the intent:\n\n*\"By the decree of the Jade Emperor, I assist in the transformation of the Dao and aid the state in delivering the people. In all talismanic rites, I sever and eradicate malevolent spirits that bring calamity, cure illnesses, succor the perilous, bestow blessings, and invoke auspiciousness—all relying on you, the messengers, to convey these matters to the divine assemblies above and below. Today, I present wine, fruits, coins, and horses in offering. Humbly, I beseech the messengers to extend their compassion, radiate their majestic light, and bestow their numinous protection.\"*\n\nNext, pour wine thrice, burn the coins, recite the incantation, and swear to the *Merit Officers*:\n\n*\"I have heard that those who cultivate the Great Dao in former lives now become supreme spirits, none but those whose merit and conduct take precedence, whose devotion to saving the people is paramount. Thus, they manifest in the unseen, traverse the nether realms, emerge from water, and enter fire. Their transformations are myriad, their might pervades all forms. Armed with halberds and clad in armor, bearing drums and lifting bells, they move freely without hindrance. At their presence, evil demons shatter in fear, and the afflicted find peace. I wield the Orthodox Dharma to subdue demons, relying on your awe-inspiring might to assist me—subjugating malevolent spirits, severing the roots of calamity, bestowing fortune upon the virtuous, and ascribing merit to the Way of goodness. Today, with these offerings, I modestly repay your divine merits, slightly express gratitude for your toils, and deeply honor your strenuous efforts. Humbly, I invite each of you to feast and drink to satiety.\"*\n\n**Oath to the Divine Generals:**\n*\"May you all feast and drink to satiety, then compose your majestic demeanor. Strictly observe the celestial precepts, reverently heed the Emperor’s command. Wield the authority of martial prowess to achieve the merit of pacification. May your illustrious achievements be fulfilled, and your resounding responses be clear. By the decree of the Five Marchmounts, you, the divine generals, officers, and soldiers, are dispatched. All possess concealed martial prowess and long-nurtured strategies. Your reputation is pure and stern, your virtue and bearing heroic and majestic. Responding to the command of the Marchmounts, you are entrusted with the authority of punitive expeditions. At your tremors, malevolent specters shatter in form; at your glares, wind and clouds change color. Where your numinous halberds point, great evil cannot prevail. Assisting the state, delivering the people, benefiting the times, and aiding all beings—devote your hearts to the Dao, and none should covet merit. Those in this court have long received immortal decrees. Though this humble Daoist has presumptuously assumed the authority of a celestial officer, I rely solely on your numinous protection. Above, may it guard my body and preserve my life, as I study the Dao and serve Heaven, aiding my true self in aspiring to celestial rank. In the middle, may it manifest the sagely transformation, illuminate and spread hidden merits, and through this mighty power, fulfill my aspirations. Below, may it deliver people and benefit beings, cure illnesses and expel evil, punish malevolent demons, and bring abundant fortune and prosperity. May these layered merits be achieved, and their efficacious responses resound. May your hidden virtues be renowned, and may you share in these merits. May all honors be bestowed according to the conveniences of the age, and may we together uphold the Orthodox Dharma’s supremacy. Benefit without harm, awe with discipline. In all matters, deficiency harms the mean; losing harmony injures beings. Defying Heaven invites punitive expeditions—execute and eradicate evil. Assist the upright with divine merit to overcome malevolent power, and with wondrous transformation to overcome treacherous schemes. Who can withstand this? None can oppose. Only you, the divine, assist my Great Dao. Hasten, hasten, in accordance with the statutes and ordinances!\"*\n\nTo all divine generals, officers, and soldiers, entrust the Dharma seals and charge them to constantly guard and uphold the rites.\n\n**Orthodox Dharma Placard Format**\n**Northern Culmen Exorcism Court:**\nThe generals, officers, and soldiers currently under the jurisdiction of this court are dispatched by the Jade Emperor’s life-saving decree to this court to protect the Dharma, transform the world, assist the state, deliver the people, and guide all beings to the Orthodox Dao. It is feared that they may be unaware: this court possesses a celestial seal, either one *cun* and eight *fen* square, two *cun* and one *fen* square, three *cun* square, or five *cun* square. It commands trillions of celestial soldiers. Each stroke and line of the seal’s script conceals thirty-six trillion soldiers and generals, who turn with my seal. At its presence, evil demons shatter in fear, and the afflicted find peace. Bestowed by the Supreme Emperor, celestial warriors bear it aloft, following my commands. The soldiers and generals within the seal number trillions, coming and going like the wind, formless and boundless, their transformations inexhaustible. Concealed within my seal, they appear when summoned. Sometimes they manifest as colossal forms, filling the void, their heads bearing Kunlun, their shoulders the sun and moon, their hands grasping the Emperor’s bell, their feet treading *kui* dragons. Sometimes they appear as minute forms, entering a speck of dust or a strand of hair. Behold their mighty power, upholding the Orthodox Dharma, transforming endlessly to deliver sentient beings, never boasting of their merit. Their wondrous might and Daoist arts are boundless. It is feared that the generals, officers, and soldiers under this court’s command may be unaware of these statutes and willfully disobey or neglect them. If they are sent to receive punishment, this court shall not be lenient. Now, the celestial soldiers and generals, as well as the Marchmount soldiers and generals, are divided into rotating shifts, prepared for urgent matters. When summoned by this court, they must hasten immediately. If not on duty or called, they are to conceal and submit themselves within the Six Directions. The following are specified:\n\n- Celestial soldiers, generals, and officers must always be prepared for summons. If not called, they may not leave the celestial realms without authorization.\n  - Southern Dipper celestial soldiers: 3,600.\n  - Black-Killing divine soldiers: 50,000.\n  - Northern Dipper division soldiers and generals.\n  - Three-Five division soldiers and generals.\n  - Orthodox division soldiers and generals.\n  - Radiant Light division soldiers and generals.\n  - Celestial *Ding* deities.\n  - Celestial warriors.\n  - Vajra deities.\n  - Great Brightness deities.\n  - Flying Dragon mounted officers: 1,000.\n  - Dragon-Slaying mounted officers: 1,000.\n  - Dragon-Centralizing mounted officers: 1,000.\n  - Dharma-Assisting Generals: 2.\n- Generals dispatched from Mount Tai are to be divided into two shifts, alternating daily, accompanying the Dharma-officiating officials of this court in their comings and goings. In cases of urgent matters, this does not apply.",
      "overlap_context": " augmentation of fortune and emolument. Humbly prepared, may the enlightened perceive my sincerity.\"*\n\nWhen reciting the *Northern Dipper Mantra* during the *Perfected’s Dipper Steps*, halt at the *Celestial Pivot*, flick the seal mudra, and then point with the *Celestial Pivot Seal*. If reciting the mantra within a talisman, begin with the star *Greedy Wolf*.\n\nWhen making offerings to the deities, record the dates using the *Six Jia* days of the four seasons: spring, summer, autumn, and winter.",
      "start_char": 8987,
      "end_char": 10221,
      "start_sentence": 372,
      "end_sentence": 456,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.72894358634949,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\上清骨髓灵文鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "仍只得於本院安泊，无辄慢易，仍委自统兵助法神将。 常切提辖统兵神将，一员。 助法神将，一员。 马步兵，若干人。 开东岳关到人数。 右件，兵将神吏等令，出榜晓谕，仰详前项，指挥，遵依奉行。 如稍有违，必无轻恕。 汝等有功，即当赏犒。 具奏上界，赐之恩果。 的无虚示，各宜知悉。 某年某月某日榜。 具衔位姓  押。 弟子投师传法词 某州县乡坊村里住姓某。 右某本命年月日时生，所属北斗某星君。 谨资黄金九两，金镮一对，命素一端，以代质信。 青丝四两，以代万发。 丹砂七两，以代歃血。 捧诣 法师某门下，求授",
      "translated_text": "The aforementioned troops and officers are to be stationed solely within this court, without any negligence or disrespect. They shall remain under the command of the Dharma-Assisting Generals.\n\n- One General to constantly oversee and command the troops.\n- One Dharma-Assisting General.\n- Cavalry and infantry soldiers: a designated number.\n- Personnel dispatched from the Eastern Peak Pass.\n\nThe above-mentioned troops, officers, and divine functionaries are hereby ordered to be publicly announced. All are to carefully heed the preceding directives and comply accordingly. Any violation, however slight, shall not be lightly forgiven. Those among you who render meritorious service shall be duly rewarded and commended. A memorial shall be submitted to the celestial realms, whereupon they shall be bestowed with divine blessings. Let this be proclaimed without falsehood; all should take heed.\n\nProclamation issued on the ___ day of the ___ month of the ___ year.\n\n[Official title, name, and seal]\n\n**Petition for Transmission of the Dharma from Disciple to Master**\n\nDisciple [Name], residing in [State, County, Township, Village, Hamlet], born on the ___ day of the ___ month of the ___ year at the ___ hour, under the governance of the [specific] Star Lord of the Northern Dipper.\n\nRespectfully offering:\n- Nine taels of yellow gold, a pair of gold rings, and one bolt of plain silk as tokens of sincerity.\n- Four taels of black silk thread, representing ten thousand strands of hair.\n- Seven taels of cinnabar, substituting for the blood of oath.\n\nWith reverence, [Disciple] presents these before the Dharma Master [Name], seeking to receive the transmission.",
      "overlap_context": " - Celestial *Ding* deities.\n  - Celestial warriors.\n  - Vajra deities.\n  - Great Brightness deities.\n  - Flying Dragon mounted officers: 1,000.\n  - Dragon-Slaying mounted officers: 1,000.\n  - Dragon-Centralizing mounted officers: 1,000.\n  - Dharma-Assisting Generals: 2.\n- Generals dispatched from Mount Tai are to be divided into two shifts, alternating daily, accompanying the Dharma-officiating officials of this court in their comings and goings. In cases of urgent matters, this does not apply.",
      "start_char": 10221,
      "end_char": 10472,
      "start_sentence": 457,
      "end_sentence": 476,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.615256786346436,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\上清骨髓灵文鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "天心正法。 意欲助天行化，为国救民。 以某窃观浮世之数，常忧危脆之身。 愧除害以不能，思兴利而无卫。 操修既怠，惶恐且深。 岂期多劫而来，以庆今辰之会。 伏闻 某人不掩玄都之路，特扬 太上之风，抱行持一法之心。 增光道教，垂拔度群生之手。 拆破尘笼，愿持枯朽之根。 上赖栽培之力，其於行已，岂敢为非。 苟忘教育之恩，甘受沈沦之苦。 输回得度，竭志奉修。 玄运相逢，尽心报答。 伏望 某人大开慈造，少鉴微诚尘渎之词。 乞垂悯念，下情无任，望恩之至。 谨词。 某年某月某日。",
      "translated_text": "The Heavenly Heart Orthodox Dharma,\nIntended to aid the Dao in its transformative work,\nTo serve the state and deliver the people.\n\nThis disciple, observing the fate of the fleeting world,\nHas long grieved for this fragile, imperiled body.\nAshamed of my inability to eradicate harm,\nAnd my lack of means to promote benefit.\nNeglectful in cultivation, my dread runs deep.\n\nWho could have foreseen that, after countless kalpas,\nThis day’s encounter would be my fortune?\nI have learned that [Dharma Master’s Name]\nDoes not obstruct the path to the Mystic Capital,\nBut uniquely propagates the wind of the Most High,\nEmbracing the resolve to uphold the One Dharma.\nEnhancing the radiance of the Daoist teachings,\nExtending a hand to deliver all beings.\nBreaking through the dust-laden cage,\nI, with my withered and decayed roots, aspire to grasp it.\n\nRelying above on the power of your nurturing,\nIn my own conduct, how dare I transgress?\nIf I were to forget the grace of your instruction,\nI would willingly endure the suffering of eternal submersion.\nHaving turned toward deliverance,\nI will exhaust my devotion in practice.\nMeeting this mysterious destiny,\nI will dedicate my heart to repayment.\n\nHumbly I beseech [Dharma Master’s Name]\nTo open wide your compassionate creation,\nAnd deign to regard these humble, dust-tainted words.\nI implore your merciful consideration.\nMy heart below is utterly without pretense,\nLonging for your grace to the utmost.\n\nRespectfully submitted.\nOn the ___ day of the ___ month of the ___ year.",
      "overlap_context": " the ___ month of the ___ year at the ___ hour, under the governance of the [specific] Star Lord of the Northern Dipper.\n\nRespectfully offering:\n- Nine taels of yellow gold, a pair of gold rings, and one bolt of plain silk as tokens of sincerity.\n- Four taels of black silk thread, representing ten thousand strands of hair.\n- Seven taels of cinnabar, substituting for the blood of oath.\n\nWith reverence, [Disciple] presents these before the Dharma Master [Name], seeking to receive the transmission.",
      "start_char": 10472,
      "end_char": 10702,
      "start_sentence": 477,
      "end_sentence": 496,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.030301570892334,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\上清骨髓灵文鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "弟子求保举师状 某州县乡坊里住姓某。 右某昨於某年月日，具词躬诣 上清法师某人门下，求授 天心正法一部。 志愿助 天行化，佐 国救民，治病扶危，断绝邪祟。 已蒙许赐，克月奏名。 奉 命依法，访寻有道名师，保举传授。 窃念某生身，幸处於中华。 存心久栖於象外，寻师屡访於知己，倾诚始遇於明人。 比者伏惟 某人，得法至精，兴扬 大道，救民极切，拯济殊深。 某谨投 某人，愿求保举，傥蒙收录，则某岂不坚心克志，镂骨铭骸； 至愿修行。 上报提拔之赐，不胜幸甚。 谨具状告 闻，伏候 法旨。",
      "translated_text": "Petition for a Master’s Endorsement\n\nThe disciple, [Surname] of [Village], [Township], [County], [Prefecture], respectfully states:\n\nOn the ___ day of the ___ month of the ___ year, I personally presented a petition at the abode of the Highest Clarity Dharma Master [Name], seeking to receive the Orthodox Method of the Celestial Heart in its entirety. My aspiration is to assist in the transformative work of Heaven, aid the state and succor the people, heal the sick and sustain the imperiled, and sever all perverse and malevolent influences. Having received your gracious consent, I was permitted to submit my name in the monthly memorial. In accordance with your command, I have followed the method and sought a master of renowned virtue to endorse and transmit the teaching.\n\nI reflect that, by birth, I am fortunate to dwell within the Central Kingdom. My heart has long abided beyond form, and in my search for a teacher, I repeatedly inquired among those of understanding, until at last I poured forth my sincerity and encountered one of luminous discernment. Recently, I have come to revere [Name], who has attained the utmost refinement in the Dharma, who exalts and propagates the Great Dao, whose dedication to saving the people is most earnest, and whose deliverance is profoundly far-reaching.\n\nI now humbly present myself to [Name], beseeching your endorsement. Should I be so fortunate as to be accepted, I would surely steel my heart and fortify my resolve, inscribing your grace upon my bones and engraving it into my very frame, devoting myself wholeheartedly to cultivation. In so doing, I would repay above the gift of your guidance—what greater fortune could there be?\n\nThis petition is respectfully submitted for your consideration, and I prostrate myself in await of your Dharma decree.",
      "overlap_context": "of eternal submersion.\nHaving turned toward deliverance,\nI will exhaust my devotion in practice.\nMeeting this mysterious destiny,\nI will dedicate my heart to repayment.\n\nHumbly I beseech [Dharma Master’s Name]\nTo open wide your compassionate creation,\nAnd deign to regard these humble, dust-tainted words.\nI implore your merciful consideration.\nMy heart below is utterly without pretense,\nLonging for your grace to the utmost.\n\nRespectfully submitted.\nOn the ___ day of the ___ month of the ___ year.",
      "start_char": 10703,
      "end_char": 10959,
      "start_sentence": 497,
      "end_sentence": 519,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.49170184135437,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\上清骨髓灵文鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "某年某月某日某处住姓某状。 新授正法人给板符铁券式 夫板符铁券者，高九寸，五寸应身五体，四寸表身四灵。 长四尺九寸，长四维，法九星。 以黄花缯帛为之今行法之人多使柏木为符，铁板为券。 此皆不然以俗世所见非合仙旨板符则是板籍符契之义。 铁券则誓坚确盟，要之不移也。 乃大仙饶公所传，之意录之于后。 敕三台门下： 驱邪院右判官某人，行持 天心正法事，准 玉帝敕赐。 汝仰依教行持，除邪辅正，利济群生，阐扬大道。 动合天心，慎勿邪娌欺滥。 恭孝二亲，敬奉师长，和睦六亲。 勿随势利，无传非人。 若不依从，令汝临事不神。 三官考录功过，依法赏罚者。 唵吽吽，众神稽首，邪魔归正。 敢有恶逆，碎作微尘。 太微上帝敕，急急如律令。 四天门王，八大金刚，五部大轮王，十方护法神，四天三界符箓内众星都大神仙，六丁六甲，玄武大圣，天丁力士，风伯雨师，五雷使者，五岳圣帝，四渍大王，洞府名山官庙五道等神，天兵将吏，岳兵将吏等，宜各依准 上帝。 板符铁券，常切护助。 诛灭邪魔，去病除妖。 其凶猛邪神，辄敢违戾，碎如微尘。 奉救符到，急急如律令。 右以尔忠厚之资，粹和之质，深励趣真之志，坚崇济物之心。 须戒券以修身，协真言之美赞。 尚宜知悉。 某年某月某日。",
      "translated_text": "On the [day] of the [month] in the [year], residing at [place], [Name] respectfully submits this petition.\n\n**Form of the Newly Conferred Orthodox Dharma Plate-Tally and Iron Pledge**\n\nThe plate-tally and iron pledge shall be nine inches in height, with five inches corresponding to the five bodies of the manifested self and four inches representing the four numinous spirits of the body. It shall measure four feet and nine inches in length, aligning with the four directions and the nine stars of the Dharma.\n\nTraditionally, yellow flowered silk was used, but those who practice the Dharma today often employ cypress wood for the tally and iron for the pledge. This is not so, for such mundane materials do not accord with the intent of the immortals. The plate-tally signifies the register of records and the contract of the tally, while the iron pledge represents an oath of unshakable alliance, steadfast and unchanging.\n\nThis was transmitted by the great immortal Master Rao, and its meaning is recorded below:\n\n**By Imperial Decree of the Three Terraces, to the Office Below:**\n\nTo the Right Judge of the Bureau for Driving Away Demons, [Name], who practices and upholds the Orthodox Dharma of the Celestial Heart, in accordance with the decree bestowed by the Jade Emperor:\n\nYou shall reverently follow the teachings in your practice, dispelling evil and aiding the upright, benefiting and delivering the multitude of beings, and propagating the Great Dao. Your actions must align with the Celestial Heart; beware of deceit, corruption, or negligence. Honor and serve your parents with filial piety, respect your teachers and elders, and maintain harmony among the six relations. Do not follow after power or profit, nor transmit this Dharma to unworthy persons. Should you fail to comply, your efficacy in affairs shall wane. The Three Officials shall record your merits and transgressions, and you shall be rewarded or punished according to the Dharma.\n\n*Oṃ hūṃ hūṃ!* All spirits bow their heads; demons and evil forces submit to rectitude. Should any dare to act with malice or rebellion, they shall be shattered into dust.\n\nBy decree of the Supreme Emperor of the Grand Tenuity: *Swiftly, swiftly, in accordance with the statutes and ordinances!*\n\nTo the Four Heavenly Gate Kings, the Eight Great Vajras, the Five Divisional Wheel Kings, the Dharma-protecting deities of the ten directions, the stellar host of immortals within the registers of the four heavens and three realms, the Six Ding and Six Jia, the Great Sage Xuanwu, the Celestial Ding Warriors, the Lords of Wind and Rain, the Envoys of the Five Thunders, the Sage Emperors of the Five Peaks, the Four Drainage Kings, the deities of grotto-heavens, renowned mountains, official temples, and the Five Paths, the celestial soldiers and officers, the mountain soldiers and officers—let each act in accordance with the Emperor’s decree. The plate-tally and iron pledge shall ever protect and assist, exterminating evil demons, dispelling illness, and eradicating malevolent spirits. Any fierce or rebellious evil spirits who dare to defy shall be shattered into dust.\n\nUpon the arrival of this saving tally: *Swiftly, swiftly, in accordance with the statutes and ordinances!*\n\nWhereas you possess the endowment of loyalty and sincerity, the nature of purity and harmony, a profound aspiration for the true, and a resolute heart for delivering beings, you must uphold this pledge to cultivate the self and harmonize with the praises of the true words. Let this be known to you.\n\nRespectfully recorded on the [day] of the [month] in the [year].",
      "overlap_context": " now humbly present myself to [Name], beseeching your endorsement. Should I be so fortunate as to be accepted, I would surely steel my heart and fortify my resolve, inscribing your grace upon my bones and engraving it into my very frame, devoting myself wholeheartedly to cultivation. In so doing, I would repay above the gift of your guidance—what greater fortune could there be?\n\nThis petition is respectfully submitted for your consideration, and I prostrate myself in await of your Dharma decree.",
      "start_char": 10960,
      "end_char": 11490,
      "start_sentence": 520,
      "end_sentence": 550,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.75056481361389,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\上清骨髓灵文鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "具保举传度师衔位臣姓某奉行。 三天扶教大法师正一真人静应真君臣 张道陵。 新授正人补驱邪院官告式 敕三台门下： 据驱邪院某官姓某，保奏某人。 禀 性纯素，守善存心。 每崇奉於高真， 常归依於 大道。 颇有助国救民之志，愿欲传授 天心正 法符箓。 保身护命，佐 天行道，利济群生。 某人年若干岁，甲子某月日时生，上属 北斗某星君，躬俟 俯报者。 惟三天正法，万道同归。 矧吾言之易行，岂汝心之难勉。 宜补北极驱邪院右判官，同勾院事。 准式以闻。 右牒奉",
      "translated_text": "To the Esteemed Bearer of the Dharma Transmission and Preceptor’s Rank, the Minister of [Surname], acting in accordance with the rites:\n\nThe Great Dharma Master of the Three Heavens, Upholder of the Dao, Perfected One of the Orthodox Unity, Serene and Responsive True Lord, Minister Zhang Daoling,\n\n**Decree of Appointment for the Newly Conferred Orthodox Practitioner and Official of the Demon-Quelling Court**\n\nIssued by the Chancellery of the Three Terraces:\n\nWhereas the Demon-Quelling Court official of [Surname] has submitted a memorial endorsing [Name of Candidate]:\n\nPossessing a nature of purity and simplicity, they uphold goodness and preserve sincerity. Ever revering the Lofty Perfected, they constantly take refuge in the Great Dao. They harbor the aspiration to aid the state and deliver the people, desiring to receive transmission of the Orthodox Dharma of the Celestial Heart, talismans, and registers—to guard the body and protect life, assist in the Dao’s unfolding, and benefit all beings.\n\n[Name of Candidate], aged [number] years, born on the [day] of the [month] in the [year] of the sexagenary cycle, under the governance of the [specific] Star Lord of the Northern Dipper, awaits the humble repayment of their devotion.\n\nThe Orthodox Dharma of the Three Heavens converges all myriad ways. How much more so when our words are easily practiced—how could your heart falter in emulation?\n\nThey are hereby appointed as Right Judiciary Official of the Northern Culmen Demon-Quelling Court, concurrently overseeing the affairs of the Court. Let this be recorded in accordance with the prescribed form.\n\nRespectfully issued this decree.",
      "overlap_context": "l be shattered into dust.\n\nUpon the arrival of this saving tally: *Swiftly, swiftly, in accordance with the statutes and ordinances!*\n\nWhereas you possess the endowment of loyalty and sincerity, the nature of purity and harmony, a profound aspiration for the true, and a resolute heart for delivering beings, you must uphold this pledge to cultivate the self and harmonize with the praises of the true words. Let this be known to you.\n\nRespectfully recorded on the [day] of the [month] in the [year].",
      "start_char": 11491,
      "end_char": 11741,
      "start_sentence": 551,
      "end_sentence": 574,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.502192974090576,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\上清骨髓灵文鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "上清玉帝 敕，符到奉行。 某甲子年月日。 具传度法师金衔臣姓某诰行。 三天扶教大法师正一真人静应真君臣 张道陵。 新补驱邪院官受法报应谢表式 具位臣某，诚惶诚恐，顿首顿首，再拜。 上言臣闻， 大道无形，育包万化。 上德不牢，运斡三元。 庶汇成彰，最灵居首。 不二之法，非离乎本。 守一之要，盖出於诚。 自顾凡材，护参 仙品。 臣诚惶诚恐，顿首顿首。 恭唯 玉清圣境元始天尊， 上清真境灵宝天尊， 太清仙境道德天尊。 开天御历， 执符为九百九十九亿万之 道君。 辟地赤明龙汉，乃十号十真。 百灵源之， 经宝",
      "translated_text": "By Edict of the Supreme Clarity Jade Emperor, upon receipt of this talisman, let it be reverently executed.\n\nDated the [day] of the [month] in the [year] of the sexagenary cycle.\n\nPresented by the Dharma Master of Transmission and Ordination, the Gold-Titled Minister [Name], proclaiming the decree.\n\nThe Great Dharma Master of the Three Heavens, Upholder of the Teachings, Orthodox Unity Perfected Person, Tranquil Response Perfected Lord, Minister Zhang Daoling.\n\n**Memorial of Gratitude for Receiving the Dharma and Reporting Responses—Prescribed Form**\n\nThe humble official [Name], with utmost reverence and trepidation, prostrates and bows twice.\n\nI humbly declare: I have heard that the Great Dao is formless, nurturing and embracing the myriad transformations. The supreme virtue is not fixed, yet it revolves and governs the Three Origins. All things attain manifestation, with the most numinous residing at the forefront. The unparalleled Dharma does not depart from its root; the essence of guarding the One emerges from sincerity. Looking upon myself as one of mere mortal capacity, I am entrusted with the protection and participation among the ranks of immortals. With utmost reverence and trepidation, I prostrate and bow twice.\n\nReverently addressing the Jade Purity Sacred Realm’s Primordial Heavenly Venerable, the Supreme Clarity Perfected Realm’s Numinous Treasure Heavenly Venerable, and the Grand Clarity Immortal Realm’s Dao and Virtue Heavenly Venerable—who opened the heavens and governed the epochs, wielding talismans as the Nine Hundred Ninety-Nine Myriad Million Dao Lords; who cleaved the earth in the Crimson Brilliance and Dragon Han eras, assuming the Ten Titles and Ten Perfections. The hundred spirits take their source from the sacred scriptures and treasures.",
      "overlap_context": "[specific] Star Lord of the Northern Dipper, awaits the humble repayment of their devotion.\n\nThe Orthodox Dharma of the Three Heavens converges all myriad ways. How much more so when our words are easily practiced—how could your heart falter in emulation?\n\nThey are hereby appointed as Right Judiciary Official of the Northern Culmen Demon-Quelling Court, concurrently overseeing the affairs of the Court. Let this be recorded in accordance with the prescribed form.\n\nRespectfully issued this decree.",
      "start_char": 11741,
      "end_char": 12030,
      "start_sentence": 575,
      "end_sentence": 601,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.334394693374634,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\上清骨髓灵文鬼律.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "三天正法。 五帝真符，布化降祥， 垂光应物。 臣居凡贱，叨奉 至猷。 获脱尘寰，喜厕 仙籍。 敢不上遵 天戒，下尽人情。 救苦为心，报 恩是切。 谨具表 谢，冒渎 天威。 下情无任，望 圣激切，屏营之至。 臣某诚惶诚恐，顿 首顿首。 谨言。 某岁某月某日具位臣姓某上表。 上清骨髓灵文鬼律卷下",
      "translated_text": "The Three Heavens’ Orthodox Dharma, the Five Emperors’ True Talismans—spreading transformation, descending auspiciousness, casting radiance to respond to all beings. Though I dwell in humble mortality, I have presumptuously received the utmost Dao/Way. Having escaped the dusty world, I rejoice in my enrollment among the immortal registers. How dare I not uphold the Heavenly Precepts above and fulfill human sentiments below? With relieving suffering as my heart and repaying kindness as my urgency, I humbly present this memorial in gratitude, venturing to disturb the Heavenly Might. My inferior feelings are without limit; I gaze upon the sagely presence with fervent longing, overwhelmed with awe.\n\nI, your subject [Name], with utmost reverence and trepidation, prostrate and bow twice.\n\nRespectfully submitted.\n\nMemorial presented by your subject [Surname and Name], of such-and-such rank, on the [Day] day of the [Month] month of the [Year] year.\n\n*Lower Scroll of the Upper Clarity’s* **Marrow Spirit Writs and Ghostly Precepts**",
      "overlap_context": "s Primordial Heavenly Venerable, the Supreme Clarity Perfected Realm’s Numinous Treasure Heavenly Venerable, and the Grand Clarity Immortal Realm’s Dao and Virtue Heavenly Venerable—who opened the heavens and governed the epochs, wielding talismans as the Nine Hundred Ninety-Nine Myriad Million Dao Lords; who cleaved the earth in the Crimson Brilliance and Dragon Han eras, assuming the Ten Titles and Ten Perfections. The hundred spirits take their source from the sacred scriptures and treasures.",
      "start_char": 12030,
      "end_char": 12195,
      "start_sentence": 602,
      "end_sentence": 622,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.7342588901519775,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\戒律类\\上清骨髓灵文鬼律.txt",
        "category": "戒律类"
      }
    }
  ]
}