{
  "source_id": "上清紫精君皇初紫灵道君洞房上经",
  "source_file": "chunked_daozang\\上清紫精君皇初紫灵道君洞房上经.json",
  "total_chunks": 7,
  "total_original_chars": 7608,
  "total_translated_chars": 46082,
  "total_translation_time": 225.4593586921692,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清紫精君皇初紫灵道君洞房上经.txt",
    "category": "玉诀类"
  },
  "full_translation": "*The Upper Scripture of the Cavern Chamber of the Purple Essence Lord, the August Primordial Purple Numinous Dao Lord*\n\n**Scripture Title:** *The Upper Scripture of the Cavern Chamber of the Purple Essence Lord, the August Primordial Purple Numinous Dao Lord* (abbreviated as *The Upper Scripture of the Cavern Chamber*).\nAuthor unknown, approximately dating to the Northern and Southern Dynasties period, contemporaneous with *The Upper Scripture of Golden Writ and Jade Characters*. Compiled from early Shangqing scriptural formulas, including *The Method of the Five Spirit-Qi of the Supreme Simplicity for Summoning the Imperial Lords*, *The Scripture of the Twenty-Four Spirits of the Supreme Tenuity Emperor Turning the Primal Origin*, *The Jade Scripture and Precious Formulae of the Southern Culmen Primordial Lord*, *The Scripture of the Seven Primes and Nine Celestial Stems of the Supreme*, and *The Scripture of the Supreme Turning the Primal Origin and Concealing the Dao to Remove the Registers of Sins*. One scroll.\nSource of the base text: *Daoist Canon of the Zhengtong Era*, Cavern Mystery Section, Jade Formulae Category.\n\n---\n\n**The Method of the Five Spirit-Qi of the Supreme Simplicity for Summoning the Imperial Lords**\n\nRecline beneath the radiant celestial stems, repose within the ninefold essences, restrain the hun and po in the northern ascent, refine the five spirits within the true qi, roam the eightfold simplicities, and inscribe names upon the Dark Chart. The Supreme Great Lord chants:\n\nAscend the Purple Gate, gaze upon the Eight Mornings,\nExpand the Vermilion Palace, array the luminous spirits,\nRoam the nine qi, dance with the celestial immortals,\nTurban the azure heavens, intone the Great Calendar,\nGird the Vast Fall, recite the Numinous Strategy,\nSummon the storm-dragons, tread the twin whites,\nMagnify the Purple Youths, revolve the two reds,\nConceal the Supreme Simplicity, hide the radiant jade.\n\nThis is the scriptural method of the Purple Essence for summoning the five spirits.\n\nThe *Great Calendar* refers to the records of the Seven Sages.\nThe *Numinous Strategy* refers to the *Scripture of the Jade Emperor*.\n\nAt the hour when the parrot cries, visualize the green qi of the east emerging from the sun and filling the head’s Mud-Pill Palace. Within the Mud-Pill Palace are two green mists, which then issue from the eyes, billowing thickly, and transform into two youths. They are clad in green above and below, resembling infants taking their first steps. The youth of the left eye is named Flying Numinous; the youth of the right eye is named Morning Infant. Both stand at my left and right, perfectly distinct. After a long while, knock the teeth nine times, swallow the saliva nine times, and softly invoke:\n\n*\"Five numina of the east, solar qi gleaming green,\nAt dawn enter the Mud-Pill, refining the brain’s precious form.\nLeft transforms, right transmutes, attaining the name of the Dao,\nEnabling me to ascend and audience the Supreme Simplicity of Purple Clarity.\"*\n\nWhen finished, concentrate intensely on the names of the two youths, and the hundred harms will not assail you. If one cultivates this persistently for eighteen years, one will ascend to heaven.\n\nVisualize the two youths emerging from the eyes, causing the green qi to suddenly transform and take form. Station them at the left and right, so that the two youths each exhale green qi, which bathes and encircles my entire body, penetrating both within and without.\n\nAt noon, face the sun with eyes closed and fists clenched. Visualize two red qi from the sun entering the clenched hands. After a long while, they suddenly transform into two red youths, one in each hand, both clad in red, resembling infants taking their first steps. They stand at my left and right, attending to my rising and resting. The youth in the left hand is the Controller of Destiny within the sun, named Life-Receiver. The youth in the right hand is the Peach Lord within the sun, named Square Fullness. Both exhale red qi, which enters my mouth, surging upward to the Mud-Pill Palace and downward throughout the body, penetrating within and without like firelight. After visualizing for a long while, softly invoke:\n\n*\"True perfection of the Great Yang, red numina wafting mist,\nJade numina transform and arise, intimate with me.\nLife-Receiver and Square Fullness, upper spirits of the sun,\nOrder the hun and guard the form, prolonging life by billions and thousands.\nThe entire body merges with the radiance, ascending as a lofty immortal.\"*\n\nWhen finished, if one persistently practices this and visualizes the names of the spirits, one may sit in death or stand in disappearance.\n\nAt the hour of *bu*, sit upright and, with eyes closed, visualize two streams of white qi emerging from the moon and entering directly into the soles of your feet, penetrating to their centers. After a long while, from each sole two white dragons take form, one on my left and one on my right. The left dragon is named Whirlwind Essence, the right dragon Swift Pavilion. Both dragons exhale white mist, which enters my two nostrils and proceeds directly to the lungs.\n\nVisualize within the lungs a youth clad in white above and below, who emerges from the right nostril and stands at my right. He is named Luminous Purity Youth, his appearance like that of an infant taking its first steps. After a long while, refine the visualization until it is distinct and vivid. Then knock the teeth seven times, swallow saliva seven times, and softly invoke:\n\n*\"Jade Sovereign’s whirlwind and swiftness,\nTwo dragons descend at dawn,\nEntering my two feet, transforming my entire body.\nLuminous Purity Youth, circling left and right,\nHarmonizes and gathers the six qi, nurturing the five spirits.\nBearing me upward, we ascend to the Treasure Immortals of Great Simplicity.\"*\n\nPersist in this practice, and one will attain swiftness without haste.\n\nThe five spirit names are: the youth in the left eye, Flying Numen; the youth in the right eye, Morning Infant; the youth in the left hand, Life-Receiver; the youth in the right hand, Square Fullness; and the youth of the lung, Luminous Purity. Constantly command the two dragons, Whirlwind Essence and Swift Pavilion, to exhale qi and bathe me in it.\n\nPractice this without negligence for eighteen years, and the Lords of Great Simplicity will dispatch Jade Guardian Duke to descend and welcome you. You will ride the radiance, driving the dawn chariot, and ascend directly to the Purple Clarity.\n\nWhen visualizing Luminous Purity standing at my right, see him exhale white mist that billows over my face. Focus the mind intently, without distraction. All visualizations should be done with eyes closed; open them only when finished. Constantly maintain the five spirits and two dragons at my left and right, bathing me in qi without cease.\n\nOn the eight seasonal nodes, avoid mingling with others. Do not lend clothing or headscarves, nor overuse carriages and horses. This is to preserve undivided stillness, to concentrate the mind in seeking the subtle. Thus may one fan the purple chariot through empty space and ride the whirlwind and swiftness upward.\n\nThe immortal path is a study of the heart; with sincerity, one becomes an immortal. The Dao is sought within; with inner secrecy, the Dao comes. The true is cultivated in stillness; with profound quiet, one merges with the true. The divine requires resonance; with accumulated resonance, spiritual communion is achieved. Constantly abide by this, and the day of ascension draws near.\n\nIf the heart is competitive and the spirit restless, if the body is harmonious but the mind not focused, if movement and stillness dissipate essence, if the ears and eyes are overly stimulated—then even with long accumulation, the Dao remains distant.\n\n---\n*The Scripture of the Twenty-Four Spirits Returning to the Origin, by the Lord Emperor of Grand Tenuity, states:*\nThe Lord Emperor of Grand Tenuity, the Great One who fashions form,\nThe inner spirits of Purple Origin, the twenty-four perfected,\nBlended qi transforms and generates, the jade immortals’ supreme essence.\nThey dissolve the knots of the womb, release stagnation, and open the origin.\n\nThe twenty-four knots must be untied by the command of the twenty-four spirits. If one cultivates and visualizes their names, they will govern and stabilize the entire body, preserving original essence.\n\nTo untie the knots, first recite the incantation, then the gates may open. These numina are the mysterious origin of knotted qi, the true spirits that complete the body. They guide clouds and mist, bear the true smoke of life, and each can summon jade-script dragon-riders in ranks of thousands. They must unite as one body to ascend at dawn.\n\nThese are the twenty-four spirits of the Most High Perfected, who guard the mysterious and preserve the origin—the Dao of the Lord Emperor of Highest Clarity, riding the whirlwind and swiftness.\n\nOne should always calm the body and still the heart, rectify the qi and pacify the form. Close the eyes and inwardly gaze, forget the body and contemplate the spirits. Burn incense, purify, refine, visualize the spirits, and guard the true. With threefold indistinct entry, the radiance of the mysterious gathers like mist.\n\nAfter practicing for eighteen years, the Most High will command the Lord Emperor of Grand Tenuity and the Five Spirits of the Great One to transform and generate the Lord of Blended Numen and Dao. He will issue a summons to the twenty-four perfected, with a thousand chariots and ten thousand riders, galloping on wind and treading clouds, breathing and ascending in flow, ascending to heaven in broad daylight.\n\nIn the practice of spirit visualization, do not associate with the unworthy. Retreat to secluded chambers, avoid worldly affairs, perch essence on emptiness. With the heart stored and the eyes visualized, guard the subtle and preserve the tranquil. Still the *hun* and pacify the form, then the ten thousand harms will not wound, the hundred ghosts will flee, the thousand demons will not act, disasters will dissolve, and misfortunes scatter—blessings beyond measure.\n\nFirst knock the teeth twenty-four times, then visualize:\nThe spirit of the brain is named Awareness Without Child, styled Dao Capital, one *cun* and one *fen* in height, pure white in color.\nThe spirit of the hair is named Mysterious Patterned Flower, styled Dao Balance, two *cun* and one *fen* in height, dark in color.\nThe spirit of the skin is named Penetrating Multitude Second, styled Dao Link, one *cun* and five *fen* in height, yellow in color.\nThe spirit of the eyes is named Numinous Overseer of Life, styled Dao Youth, three *cun* in height, clad in five colors.\nThe spirit of the nape marrow is named Numinous Plan Cover, styled Dao Circumference, five *cun* in height, white in color.\nThe spirit of the spine is named Beneficial Calendar Assistant, styled Dao Pillar, three *cun* and a half in height, clad in white jade and plain robes.\nThe spirit of the nose is named Second Dragon Jade, styled Dao Subtle, two *cun* and five *fen* in height, clad in blue, white, and yellow.\nThe spirit of the tongue is named Beginning Beam Peak, styled Dao Fork, seven *cun* in height, pure red.\n\nThese are the names of the eight numinous youths of the upper body’s eight luminaries. First visualize them all in the form of infants, indistinct yet present in the body, each settled in its place. Then knock the teeth eight times, swallow saliva eight times, and softly invoke:\n\n*\"Eight spirits of the upper luminaries,\nLord Emperor and Mysterious Mother,\nFive spirits each arrayed, merging as one within the body.\nThe entire form vanishes and transforms, flowing and changing to merge with the true.\nA thousand chariots and ten thousand riders together ascend to the imperial dawn.\nWhite Origin and Non-Exalted nurture the Supreme Guest,\nEight numina flank the body, jade radiance bearing mist.\nIn a thousand cycles of indistinctness, we proceed directly to the Gate of the Sun.\"*\n\nAt the beginning of visualization, first call the names of the spirits three times. When the invocation is finished, call their names three more times, so that as the sound leaves the mouth, the three sections respond in unison.\n\nAt dawn, noon, and midnight, constantly visualize the twenty-four spirits in sequence, reciting and calling their names as described above.\n\n*The Scripture of Precious Numinous Regulations* states: The method of knocking the teeth—knocking the left against the left—is called \"knocking the Heavenly Bell.\"\n\nKnocking the right against the right is called \"striking the Heavenly Chime.\"\nKnocking the upper and lower teeth together at the center is called \"sounding the Heavenly Drum.\"\nIf suddenly encountering inauspicious omens or malevolence, knock the Heavenly Bell thirty times.\nWhen traversing mountains, to repel evil and invoke the might of the spirits, strike the Heavenly Chime.\nWhen visualizing the Dao to summon the true and invoke the numinous, sound the Heavenly Drum.\nThough the act of knocking the teeth is one, in truth it distinguishes left and right, upper and lower.\nThus, malevolence fears the resonance of the Heavenly Bell, mountain spirits dread the clarity of the Heavenly Chime, and the summoning of spirits is solemnized by the thunder of the Heavenly Drum.\nThe notes of gong and shang must be measured; subtle inner resonance cannot be sought through uniformity nor achieved by mere coincidence.\nIn all matters great and small, this principle holds—thus the method of knocking the teeth unfolds, and the sounds of bell and drum are distinguished.\nTherefore, the numerology of the Dao must not be transgressed or confused; its techniques and methods must not be disordered.\nTransgression and confusion lead to obscurity and failure; disorder invites slander and calamity.\nThis is not due to the impenetrable void of the unseen, but to the lack of order in its practice.\nThe failure of the Dao and the inefficacy of affairs stem from seeking the true path without following the proper tracks.\n\nKnocking the Heavenly Bell twenty times suffices when no other incantation is required, serving only to dispel inauspiciousness.\nIf following a specific method, adhere to the prescribed number of knocks in the text, without necessarily performing thirty.\n\nThe spirit of the throat is named Hundred Streams Radiant, styled Dao-Tong, eight inches in height, clad in nine colors.\nThe spirit of the lungs is named Pure Numen Born, styled Dao-Ping, eight inches and one fen in height, pure white.\nThe spirit of the heart is named Radiant Yang Prospering, styled Dao-Ming, nine inches in height, crimson.\nThe spirit of the liver is named Opening Lord Youth, styled Dao-Qing, six inches in height, azure.\nThe spirit of the gallbladder is named Dragon Virtue Bound, styled Dao-Fang, three inches and six fen in height, azure-yellow-green.\nThe spirit of the left kidney is named Spring Origin Upright, styled Dao-Qing, three inches and seven fen in height, dark, its color shifting among white, red, and the five hues without constancy.\nThe spirit of the right kidney is named Image Other None, styled Dao-Yu, three inches and five fen in height, white or black.\nThe spirit of the spleen is named Treasure Origin Complete, styled Dao-Qian, seven inches and three fen in height, true yellow.\n\nVisualize in sequence the names of these eight numinous youths of the central body, each in the form of an infant, faintly present within, settled in their respective places.\nUpon completion, knock the teeth eight times, swallow saliva eight times, and softly intone:\n*\"The eight spirits of the central realm,\nFour transformations, nine flights,\nRefine the soul, rectify the body,\nBright radiance shares its splendor.\nUnited with the eight spirits,\nWe join in shared majesty,\nA thousand chariots, ten thousand riders,\nAscend together to the Supreme Microcosm.\"*\n\nThe spirit of the stomach is named Together Come Nurturing, styled Dao-Zhan, seven inches in height, yellow.\nThe spirit within the hollow intestines is named Omen Knee Health, styled Dao-Huan, one inch and four fen in height, yellow-red.\nThe spirit within the large and small intestines is named Vast Delivery Remaining, styled Dao-Chu, two inches and one fen in height, red-yellow.\nThe spirit within the torso is named Receiving Abundance Thriving, styled Dao-Xu, nine inches and one fen in height, clad in nine colors.\nThe spirit of the chest diaphragm is named Vast Crystal Dwelling, styled Dao-Chong, five inches in height, white.\nThe spirits of the two flanks are named Repelling Falsehood Steed, styled Dao-Cheng, four inches and one fen in height, red-white.\nThe spirit of the left yin and left yang is named Supporting Flow Rising, styled Dao-Gui, two inches and two fen in height, azure-yellow-white.\nFor men, visualize as left yang; for women, as left yin.\nThe spirit of the right yin and right yang is named Embracing Bright Manifestation, styled Dao-Sheng, two inches and three fen in height, azure-yellow-white.\nFor men, visualize as right yang; for women, as right yin.\n\nVisualize in sequence the names of these eight numinous youths of the lower body, each in the form of an infant, faintly present within, settled in their respective places.\nUpon completion, knock the teeth eight times, swallow saliva eight times, and softly intone:\n*\"The eight spirits of the lower realm,\nDispersed forms transform into numinous beings,\nPurple mist rises thickly,\nEmbracing the origin, guarding essence.\nThe Primordial Father of the Great One,\nThe Lord Emperor engenders life,\nThe seven luminaries shine in the register,\nThe Controller of Destiny records birth.\nSoul and spirit are at peace,\nThe five luminaries nurture clarity,\nA thousand chariots, ten thousand riders,\nJoin me in ascent,\nFirst to the Primal Simplicity,\nThen to pay homage in the Supreme Clarity.\"*\n\nThe spirit of the innermost root of the body is named Pursuing Nothing Steed, styled Dao-Ji-Sheng, two inches and two fen in height, purple.\nFor men, visualize as the Inner Spirit of the One Dao; for women, as the Central Numen of the True Origin.\nThis is the profound spirit of the body’s deepest root, the supreme numen guarding the center.\nNext, visualize it in the form of an infant, seated in its proper place.\n\nHaving completed this, knock the teeth thirty times and swallow saliva twenty-four cycles, then softly intone the incantation:\n\n\"Dark Prime’s inner truth,\nNurtures form and attends the dawn,\nMastering the pivot and grasping the web,\nNine revolutions and eight spirals,\nThe Dipper’s stars within the profound,\nPalaces arrayed in ninefold ranks,\nThe Lord Emperor joins in flourishing,\nNine Ways and seven swallows,\nExpelling fluid and receiving essence,\nHarmonizing to bathe the host of spirits,\nThe five viscera bloom with radiance,\nReverting age to youthful countenance,\nA thousand chariots, ten thousand riders,\nAscend with me to heaven,\nTo pay homage at the Grand Stair,\nAnd bow deeply to the Jade Dawn.\"\n\nThis is the precious name of the body’s inner character, the spirit of transformation and life. Without knowing this name, the Dao of immortality cannot be achieved. If, on the day of untying the knots, one does not first recite this incantation, the knots will not be undone. Should the knots remain unresolved, the three hun-souls will lose their harmony, the Upper Prime’s inner essence will be lost, the Five Elders will lose their clarity, and the Lord Emperor will become estranged.\n\nFor men, visualize this as the spirit of the Divine Child; for women, as the spirit of the Divine Maiden—both share the same name. Visualize the twenty-four spirits, always at midnight, lying flat without a pillow, fists clenched and body relaxed, breath regulated and subtle. Focus the mind on the body’s spirits, and with tranquil thought, summon the Lord Emperor to appear in his proper place. Close the eyes and inwardly behold him. If any are incomplete, then burn incense, sit upright, close the eyes, clench the fists upon the knees, and with concentrated intent, visualize the host of spirits while reciting the incantation as prescribed.\n\nAt dawn and noon, perform the visualization while sitting upright, ensuring no one witnesses it. Always inwardly behold with eyes closed.\n\nOn the first day of the month at midnight, after visualizing the spirits, next visualize within the eyes a white qi the size of a chicken’s egg, suspended before the face. In an instant, it transforms into two luminous mirrors, each nine feet in diameter, which shine before and behind, illuminating the twenty-four spirits upon the body with perfect clarity. After a long while, intone the incantation:\n\n\"Great Luminous Treasure Mirrors,\nDispersing forms and transforming manifestations,\nIlluminating the primordial spirit,\nSubduing the myriad demons,\nSoaring to the Supreme Clarity,\nParting the cloud-veiled canopy,\nCommanding a thousand spirits,\nSealing mountains and summoning rivers.\"\n\nConclude. Perform this once every five days—this is what is meant by \"reviewing the inner essence and inspecting the five spirits.\" By practicing this regularly, calamities will not arise, and one will ascend to the rank of High Immortal.\n\nThe method for the Divine Child’s revelation, enabling clear vision of the Lord Emperor, the five spirits, and the twenty-four spirits, is as follows: During the *jiazi*旬, on the day of *gengwu*, at noon, take a *dou* of pure water and dissolve one *zhu* of true cinnabar into it. Stir counterclockwise twenty-one times and recite the incantation:\n\n\"Crimson essence of the Dark Flow,\nGenerating light and entering clarity,\nThe host of body spirits all appear,\nManifesting their forms,\nPenetrating vision for ten thousand *li*,\nCommuning with the Nine Numinous Ones,\nThe Lord Emperor illumines the Child,\nRefining my supreme essence.\"\n\nConclude the incantation, then face east and wash the eyes fourteen times. Those who practice this regularly will attain penetrating vision of the myriad spirits. The incantation should be recited softly, washing the eyes with the water while facing the moon’s position, always toward the east.\n\nThe Most High Perfected Person summons the Five Celestial Bodies in the Grotto Chamber and registers the flying immortals within the Six Directions. The Hidden Stored Secret Dao of the Southern Culmen’s Primordial Lord transmits the Jade Scripture’s precious instructions.\n\nAt midnight, in perfect stillness, sit or lie as you wish. Calm the body, quiet the mind, relax the breath, and regulate the spirit. Close the eyes and inwardly visualize the Western White Star above the brows, called the Jade Pendants of the Purple Palace. One *cun* above the brows and one *cun* inward lies the Jade Pendants of the Purple Palace. On yang days, visualize the star above the left brow; on yin days, above the right brow.\n\nNext, visualize the Northern Chen Star in the Celestial Center’s Imperial Realm of the Dark Palace. The Imperial Realm of the Dark Palace lies directly above the nose, five *fen* from the hairline, one *cun* inward.\n\nNext, visualize the Eastern Wood Star in the Vermilion Terrace of the Grotto Pass. The Vermilion Terrace of the Grotto Pass lies one *cun* behind the eyes, one *cun* inward. On yang days, visualize the star behind the left eye; on yin days, behind the right eye.\n\nNext, visualize the Southern Fire Star in the Jade Gate of the Flowery Chamber. The Jade Gate of the Flowery Chamber lies five *fen* within the inner corners of the eyes. On yang days, visualize it within the left eye’s corner; on yin days, within the right.\n\nNext, visualize the Central Earth Star in the Golden Coffer of the Yellow Chamber and the Long Valley. The Golden Coffer of the Yellow Chamber and the Long Valley lies at the center of the philtrum, two *fen* inward, with the star suspended as if strung above.\n\nHaving completed the visualization, ensure the stars occupy their proper positions. One should feel the five stars emitting radiant beams, releasing five-colored mists that penetrate the body, illuminating both within and without, as if the body is suffused with the stars’ essence.\n\nThen knock the teeth twenty-five times and swallow saliva twenty-five cycles. Softly intone the incantation:\n\n\"Lofty Purple Palace,\nWithin appears the Lord Emperor,\nThe Great One blends in unity,\nThe gate of the Purple Chamber,\nWithin it shines resplendent,\nThis is the Three Primes,\nThe Three Primes congeal essence,\nWithin dwell the five spirits,\nPrecious luminaries spread their radiance,\nBeams of light surge through the gate,\nEssence transforms and accumulates,\nChanging into an elder,\nHead wrapped in white, serene countenance,\nGreen mantle and crimson skirt,\nRight side bears flowing bells,\nLeft side adorned with tiger patterns,\nHolding the Heavenly Net in hand,\nDispersing blades and flying stars,\nFeet treading the Flowery Canopy,\nSpouting rays to refine the body,\nThe Three Luminaries guard and protect,\nGranting me attainment of the true,\nNurturing the hun and restraining the po,\nRiding the whirlwind to fly as an immortal.\"\n\nConclude, then swallow saliva three more times and knock the teeth three times.\n\nThose who practice this for fifteen years will be met thus: The Southern Culmen’s Elder of the Cinnabar Mound and Supreme Perfected One will welcome them with a chariot of green clouds; the Western Culmen’s Elder, the White Numinous Master, will welcome them with a carriage of yellow whirlwinds; the Northern Culmen’s Elder, the Dark Supreme Immortal Sovereign, will welcome them with a dragon of dark radiance; the Eastern Culmen’s Elder, the Yang-Assisting Noble Son, will welcome them with a palanquin of azure curtains; the Central Prime’s Elder, the Supreme Dark Child of the Center, will welcome them with a canopy of curved dawn. The Five Elders will unite, ascending together to the Purple Void.\n\nPractice this without fail, and visualize with utmost precision.\n\nAvoid treading upon filth, shun defiling company, regularly burn incense, and bathe frequently. Those who violate these precepts will wither and decay; those who observe them will ascend as flying immortals.\n\nOnce the visualization of the stars is complete and you harbor a wish, focus your intent upon the invocation and then articulate it. Envision the Five Stars dwelling together, entering directly three *cun* below the nape, then spreading one *cun* in each direction—each star bright as a pellet, illuminating the entire body with radiance.\n\nOn the first, fifteenth, seventh, ninth, thirteenth, seventeenth, twentieth, and twenty-fifth days of the lunar month, at cockcrow, visualize the images of the sun and moon within the *Hun* Chamber, the Mansion of the Six Harmonies. This mansion lies at the upper outer corners of the eyes, slightly raised toward the empty space above. Press there, knock the teeth, and listen below for the convergence of the Four Meetings—where movement stirs beneath is the place. Enter directly one *cun*, spanning nine *fen* in width, called the *Hun* Chamber, the Mansion of the Six Harmonies. The sun to the left, the moon to the right, visualize their light illuminating the form, making it faintly perceptible in its place. Close the eyes and concentrate intensely, allowing no lapse in focus. Upon completion, knock the teeth six times, swallow saliva nine times, and softly invoke:\n\n*\"Great luminous dawn, ninefold verdant ascent,\nSummoning rosy clouds, concealing radiance,\nBathing and refining the five forms,\nPalace-chariot of the Six Harmonies,\nSeven spirits in harmonious balance,\nGrant me flight as an immortal,\nAscending to traverse the Upper Clarity.\"*\n\nAfter fifteen years of practice, the Jade Emperor will dispatch the Three Pure Jade Lads to welcome you.\n\nOne must train a rooster to crow, ensuring it marks the dawn with regularity. If the method is concealed and practiced in secret, the mutual radiance of sun and moon will be lost.\n\nThe Southern Culmen’s Lady received this protective method from the Most High Perfected Ones, naming it the *Double Radiance Winged Form Concealment Dao*.\n\n**The Seven Primes and Nine Stars Scripture of the Celestial Grotto Chamber’s Eightfold Liberation Gate and Jade Characters**\n\n**Dipper Star, First Great Star:** Essence named *Mysterious Pivot*, spirit called *Yang Brightness*.\n**Second Prime Star:** Essence named *Northern Terrace*, spirit called *Yin Essence*.\n**Third True Star:** Essence named *Nine Ultimates*, spirit called *Perfected Person*.\n**Fourth Pivot Star:** Essence named *Rotating Root*, spirit called *Mysterious Darkness*.\n**Fifth Net Star:** Essence named *Celestial Balance*, spirit called *Cinnabar Prime*.\n**Sixth Record Star:** Essence named *Life Mechanism*, spirit called *Northern Culmen*.\n**Seventh Barrier Star:** Essence named *Mysterious Yang*, spirit called *Celestial Barrier*.\n**Eighth Emperor Star:** Essence titled *Supreme Jade Emperor Lord*, spirit called *Eightfold Radiance Numinous Prime Lord*.\n**Ninth Venerable Star:** Essence titled *Grand Tenuity Jade Emperor Lord*, spirit called *Grand Simplicity Sevenfold Dawn Prime Lord*.\n\nThese are the names and titles of the Dipper Lords, known as the Nine Stars. The Dipper possesses stars of *hun* and *po*, revolving around its exterior and entwining it—the Dipper lies within the *hun* and *po*. Its net extends outward, unlike the Dipper’s form, for the *hun* and *po* roam and transform, unbound by shape.\n\nTo pace the *hun* of the Dipper, store the heart’s intent and call the names of the Seven *Hun*, saying *Flying Immortal* as you tread upon each black star, invoking one *hun* name per step. Without knowing these names, the method will not take effect, and the Dao will not be achieved.\n\nThe star between *Yang Brightness* and *Yin Essence* is the chief of the Dipper’s *hun* and *po*, named the *Celestial Pivot Hun Spirit*. Next, proceed to the upper corner of the second star, named the *Celestial Rotation Hun Spirit*. Then, moving toward *Yang Brightness*, follow the third star, named the *Celestial Mechanism Po Essence*. Opposite the *Perfected Person*, the fourth star is named the *Celestial Balance Po Essence*. Opposite *Cinnabar Prime*, the fifth star is named the *Jade Balance Po Numinous*. Opposite *Celestial Barrier*, the sixth star is named the *Kai Yang Po Numinous*. Finally, ascending to face *Northern Culmen*, the seventh star is named *Shaking Radiance Great Brightness*.\n\nThese are the names and titles of the seven stars’ *hun* and *po*, called the *Seven Primes’ Numinous Brightness*. The *hun* of the seven stars reside upon the black stars—store these names in the heart and say *Flying Immortal*.\n\n**The Most High’s Revolving Prime Concealment Dao for Removing Sin Records, Inner Chapter**\n\nThe *Jade Perfected Concealed Prime Inner Vision* employs the days of the Six *Ding* as the time of generative *qi*, when the Celestial Prime unfolds, the embryonic matrix is doubly fortified, the Seven *Po* speak above, the Three *Hun* record transgressions, ancestral errors of seven generations accumulate, and punishments amass in the Three Yin. Thus, there exists a method of dissolution to absolve transgressions and sins.\n\nThose who practice this method are called seekers of immortality. Regularly, on the *Ding-Mao* day within the *Jia-Zi* decade, at midnight, sit upright upon the bed, face north, clasp the hands, and knock the teeth seven times. Then, gaze upward and visualize the Seven Stars, making them shine brilliantly in the north. After a long while, softly invoke:\n\n*\"First Great Star, Mysterious Pivot, Yang Brightness, Celestial Pivot Hun Spirit, Supreme Prime Lord.\"*\n\nCall seven times, then invoke again:\n\n*\"May I be absolved of all yang sins and yang transgressions from my seven generations down to my present self, dissolving them entirely. May all I undertake be as I wish, all matters align with my heart. May I pace the Seven Primes, harmonize with heaven, my name inscribed upon the Dipper’s dawn, my lifespan extended by billions and thousands.\"*\n\nUpon completion, visualize the *Yang Brightness* star descending from the Dipper, flying into your mouth, and entering your heart. Envision the star’s light, making the interior and exterior thoroughly luminous, and concentrate intensely. This is called *Dissolving the Dawn Net’s Inner Reflection of the Upper Dao*.\n\nAt this moment, visualize the Seven Stars, one missing and six remaining, thus suspended in the sky. Visualize the missing one descending and suddenly entering your mouth—hence, the other six remain in the heavens. All matters follow this method.\n\nOn the *Ding-Chou* day within the *Jia-Xu* decade, at midnight, sit upright upon the bed, face north, clasp the hands, knock the teeth seven times, then gaze upward and visualize the Seven Stars, making them shine brilliantly in the north. After a long while, softly invoke:\n\n*\"Second Prime Star, Northern Terrace, Yin Essence, Celestial Rotation Hun Spirit, Supreme Jade Lord.\"*\n\nCall seven times, then invoke again:\n\n*\"May I be absolved of all yin sins and yin transgressions from my seven generations down to my present self, dissolving them entirely. May the Six *Qi* be full, the Four Spirits at ease. May I fly through the Seven Primes, my name inscribed in the Jade Book, ascend to the Purple Clarity, ride the dark chariot of the void, move with auspicious correctness, and harmonize with heaven.\"*\n\nWhen finished, visualize the Yin Essence Star descending from the Dipper, flying into your mouth, and entering directly into your lungs, allowing it to illuminate and clearly discern both within and without, making the Five Viscera distinct. As the star enters your mouth, you should feel its radiance scattering and filling your mouth; if your mouth grows slightly warm, this is the sign that the star’s essence has entered. In all contemplations of the Seven Primes and the Way of the Nine Mornings, the bed and mat where you sleep must not be shared with others, nor should your clothing. If a man and woman share a mat to rest, their names are recorded in the ledgers of sin under the Northern Mystery. Those who defile themselves with impurity bring calamity upon their three generations of ancestors. This does not apply to masters and those of the same *qi*.\n\nOn the *Ding-Hai* day within the *Jia-Shen* decade, at midnight, sit upright upon the bed, face north, clasp the hands, knock the teeth seven times, then gaze upward and visualize the Seven Stars, making them shine brilliantly in the north. After a long while, softly invoke:\n\n*\"Third True Star, Nine Ultimates, Supreme Perfected, Primordial True Person, Celestial Mechanism, Po-Spirit, Essence of the Upper Void, Lord of Pure Simplicity.\"*\n\nCall seven times, then invoke again:\n\n*\"May I be absolved of all death sins and death transgressions from my seven generations down to my present self—accumulated evils, hidden faults, and offenses against the Three Officials of Heaven, Earth, and Water—dissolving them entirely. May my eyes see clearly, piercing the darkest depths, my name inscribed in the Upper Clarity, commanding the myriad spirits, ascending to the Jade Court, riding the luminous chariot of the void, and harmonizing with heaven.\"*\n\nWhen finished, visualize the True Person Star descending from the Dipper, flying into your mouth, and entering directly into your liver, its light illuminating the Five Viscera and making all within and without distinctly visible. Then, face north and bow twice; when finished, swallow saliva nine times. You may also bow in your heart to the True Star.\n\nOn the *Ding-You* day within the *Jia-Wu* decade, at midnight, sit upright upon the bed in your sleeping chamber, face north, clasp the hands, knock the teeth seven times, then gaze upward and visualize the Seven Stars, making them shine brilliantly in the north. After a long while, softly invoke:\n\n*\"Fourth Pivot Star, Mystic Mechanism, Dark Depths, Celestial Balance, Po-Spirit, Essence of the Upper Void, Lord of Profound Mystery.\"*\n\nCall seven times, then invoke again:\n\n*\"May I be absolved of all ungrateful and unvirtuous deeds, all acts of unkindness and unfiliality, and all yin evils—numbering in the tens of millions—from my seven generations down to my present self, dissolving them entirely. May I ingest essence and refine *qi*, daily increasing in power, ascending through the Seven Primes, my name inscribed in the Great Mystery, listed among the Jade Emperor’s court, riding the swift chariot of the Nine Heavens, commanding spirits and guiding numina, renewing with the sun and moon.\"*\n\nWhen finished, visualize the Dark Depths Star descending from the Dipper, flying into your mouth, and entering directly into your spleen, its light illuminating and piercing through, casting radiance upon the Five Viscera. Then, swallow saliva fourteen times.\n\nOn the *Ding-Wei* day within the *Jia-Chen* decade, at midnight, sit upright upon the bed in your sleeping chamber, face north, clasp the hands, knock the teeth seven times, then gaze upward and visualize the Seven Stars, making them shine brilliantly in the north. After a long while, softly invoke:\n\n*\"Fifth Principal Star, Celestial Balance, Cinnabar Prime, Jade Mechanism, Po-Spirit, Numinous Essence, Supreme Lord, Nine August Sovereigns of the Upper Mystery.\"*\n\nCall seven times, then invoke again:\n\n*\"May I be absolved of all inner and outer defilements—sins and deep transgressions numbering in the tens of millions of billions, recorded in the hidden passes—from my seven generations down to my present self, dissolving them entirely. May my body be filled and my *qi* abundant, the Yellow Court stabilized within, my name listed in the Great Simplicity, riding the luminous chariot to the Purple Palace, attended on the right by Jade Maidens and on the left by Jade Lads, sharing radiance with the sun and moon, and assuming the rank of True King.\"*\n\nWhen finished, visualize the Cinnabar Prime Star descending from the Dipper, flying into your mouth, and entering directly into your stomach, its light illuminating and clearly distinguishing the Five Viscera. Then, swallow saliva eighteen times.\n\nOn the *Ding-Si* day within the *Jia-Yin* decade, at midnight, sit upright upon the bed in your sleeping chamber, face north, clasp the hands, knock the teeth seven times, then gaze upward and visualize the Seven Stars, making them shine brilliantly in the north. After a long while, softly invoke:\n\n*\"Sixth Record Star, Life Mechanism, Northern Culmen, Opening Yang, Po-Spirit, Numinous Essence, Supreme Perfected, Cinnabar August Sovereign of the Void.\"*\n\nCall seven times, then invoke again:\n\n*\"May I be absolved of all thieving evils, rebellious acts, and chaotic transgressions—offenses recorded in the imperial archives—from my seven generations down to my present self, dissolving them entirely. May the hundred ailments be cured, my body’s *qi* flow with auspicious correctness, my name inscribed on the Immortal Terrace, engraved in gold in the Upper Clarity, commanding the myriad spirits, and soaring through the Nine Luminaries.\"*\n\nWhen finished, visualize the Northern Culmen Star descending from the Dipper and entering directly into your mouth, settling in your kidneys, its light illuminating and clearly distinguishing the Five Viscera. Then, swallow saliva fourteen times. On yang days, visualize it in the left kidney; on yin days, in the right kidney. The first day is yang, the second yin. This practice strictly forbids sexual intercourse. Those who engage in it will be examined by the Most High and their three generations of ancestors and parents; their own death will reduce them to lowly ghosts.\n\nOn the evening of the last day of the lunar month, before the next month’s first day and before the cock crows, sit upright upon the bed in your sleeping chamber, face east, clasp the hands, knock the teeth seven times, then gaze upward and visualize the Seven Stars of the north, making them shine brilliantly to your left. After a long while, softly invoke:\n\n*\"Seventh Barrier Star, Mystic Yang, Celestial Barrier, Shaking Radiance, Great Brilliance, Supreme Jade August Sovereign, Dao Lord.\"*\n\nCall seven times, then invoke again:\n\n*\"May I be absolved of all hidden and obscured sins—offenses subject to the Five Punishments, numbering in the tens of millions of billions among the spirits within my body, recorded in the Ghostly Archives of the Northern Emperor—from my seven generations down to my present self, dissolving them entirely. May my spirit and essence flow freely, granting the power to sit in stillness or vanish at will, my ears hearing the most distant sounds, my eyes emitting purple light, my name inscribed in the Jade Great Simplicity, my vision piercing all ghostly forms, my name recorded in the Imperial Carriage, my fate equal to the Two Luminaries, soaring through the Seven Primes, and resting in the Purple Court.\"*\n\nWhen finished, visualize the Celestial Barrier Star descending from the Dipper, flying into your mouth, and entering directly into your pupils, illuminating both eyes and allowing you to see clearly within and without, distinctly perceiving the Five Viscera.\n\nOn yang days, visualize the star entering the left eye; on yin days, visualize it entering the right pupil. In all practices and meditations, keep both eyes gently closed.\n\nOn the days of the Six Jia, at the hour when generative qi arises at midnight, in your bedchamber—whether lying or sitting, with your head facing any direction—clench your fists, settle your breath, and stabilize your spirit. After a long while, knock your teeth nine times, then visualize the Nine Stars of the Northern Dipper shining brilliantly above your crown. Let the radiance of the Nine Stars extend their rays, with two stars positioned before the Dipper’s handle, their light intermingling. Then softly intone:\n\n*\"Eighth Imperial Star, Exalted Jade Sovereign, Spirit of the Eightfold Radiance Primordial Lord; Ninth Revered Star, Supreme Jade Emperor of the Grand Tenuity, Spirit of the Sevenfold Dawn Primordial Lord.\"*\n\nCall upon them nine times, then pray:\n\n*\"May all transgressions of my nine generations of ancestors and parents, down to my own self—every great and small sin committed in mountains, rivers, and water sources—be dissolved. May all names inscribed in the ledgers of the dead, all hidden evils, concealed treacheries, and deceptions—numbering in the tens of millions and recorded in the Ghostly Archives of Mount Feng—along with all capital offenses and errors listed in the Black Register of the Ninefold Primordial Perfected of the Northern Supreme, be petitioned before the Ninefold Primordial Supreme Jade Mystery Lord. May every matter be erased, allowing me to soar through the Seven Paths, ascend to the Jade Purity, roam the Great Void, ride the luminous dawn, feast in the Eightfold Simplicity of the North, rival the sun in splendor, and collectively attend the Perfected Consorts, commanding the myriad spirits.\"*\n\nWhen finished, visualize the Eighth Imperial Star and the Ninth Revered Star descending from the Dipper, flying directly into the Purple Chamber of your Mud-Pellet Palace, illuminating it thoroughly and brightening your entire body’s Five Viscera, so that inner and outer are suffused with purple cloud-qi, dense and luxuriant. Hold this vision firmly.\n\nConclude by swallowing saliva twenty-seven times.\n\nIf the days of the Six Jia and Six Ding interfere with one another in visualization, repeat the practice in sequence, ensuring each step adheres fully to the true method.\n\nHere ends the *Dao of the Supreme’s Return to the Origin and Atonement for Transgressions*.\n\nThe Supreme concealed the *Dao of the Fivefold Penetration* within the Jade Casket of the Five Peaks and hid the *Dao of Returning to the Origin* in the Palace of the Nine Dawns. The Fivefold Penetration opens the beginning, while Returning to the Origin seals the end. Thus, those who cultivate the Fivefold Penetration must first observe a three-day fast before proceeding on the appointed day. Those who practice the *Sevenfold Primordial Return Dao* must abstain from blood and meat, though no fast is required on the preceding or following days. The reason for this is that the Fivefold Penetration has already been purified beforehand. The Fivefold Penetration occurs on the Supreme’s auspicious assembly day, while Returning to the Origin marks the Supreme’s day of renewal. Without knowledge of the Fivefold Penetration, one cannot dissolve sins or erase transgressions; without knowledge of the *Hidden Dao of Returning to the Origin*, one cannot inscribe their name in the registers of the Perfected. Always on these days, reflect upon auspicious matters and first atone for the transgressions within your body—this is what is meant by *liberation from form and name*. Do not reveal these practices to the immortals of the Nine Palaces.\n\nFor all who cultivate affairs of the Purple Chamber within the Grotto Chamber, or visualize the Ninefold Primordial or Sevenfold Primordial, upon first rising from sleep, when first lying down, or after eating, softly intone:\n\n*\"Five Stars, Fivefold Penetration,\nSixfold Union, Purple Chamber,\nReturn to the Origin, Hidden Dao,\nVast and Luminous Seven Dawns.\nThe Mysterious Father generates the hun-soul,\nThe Father transforms it into the One, becoming spirit;\nThe Mysterious Mother generates the po-soul,\nThe Mother transforms it into the Two, becoming form.\nThe Duke’s Son governs my sinews and bones,\nThe White Prime governs my essence and qi.\nMay I attain long life and enduring vision,\nSoaring as an immortal through the Ten Heavens.\"*\n\nDo not let your ears hear the sound of this prayer. This is the Supreme’s *Hidden Prayer* for dispelling malevolent qi, gathering spirit-essence, and ensuring one never falls into obscurity throughout their life.\n\nHere ends the *Upper Clarity Scripture of the Purple Essence Sovereign, the August Primordial Purple Numinous Dao Lord of the Grotto Chamber*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清紫精君皇初紫灵道君洞房上经 经名：上清紫精君皇初紫灵道君洞房上经。 简称《洞房上经》。 撰人不详，约出於南北期，与《金书玉字上经》同时。 系慕集《太素上清致帝君五神气法》、《太微帝君二十四神迥元经》、《南极元君玉经宝诀》、《太上七元九辰经》、《太上迥元隐道除罪籍经》等早期上清经诀而成。 一卷。 底本出处：《正统道藏》洞玄部玉诀类。 上清紫精君皇初紫灵道君洞房上经 太素上清致帝君五神气法 偃息华辰之下，寝宴九精之内，拘魂魄於北上，炼五神於真气，逍遥八素，列名玄图，太上大君吟曰： 上紫门，望八晨，弘丹宫，具明神，游九气，舞天仙，巾青天，咏大历，带豁落，诵灵策，招飙龙，蹑双白，弘紫童，回二赤，藏太素，隐华璧。 此紫精致五神之道经也。 大历，谓七圣纪。 灵策，谓玉皇经。 常以鹦呜时，存东方青气从日中来，使满入头泥丸中。 泥丸中有两青烟，又从目中出，郁郁然，又变成二童子，上下衣青，如婴儿始行状也。 左目童子名飞灵，右目童子名晨婴，并在我之左右，极使仿髴，良久，叩齿九通，咽液九过，微祝曰： 东方五灵，日气焕青，旦入泥丸，炼脑宝形，左变右化，得道之名，使我上朝，太素紫清。 毕，极念二童名，则百害不干。 恒能修之十八年，升天也。 存两童子，令从目中出，使青气忽化而生成也。 存在左右，令二童各吐青气，以灌绕我一身，洞入内外。 日中时，临目握固，存思日中有两赤气，来入手拳中，良久，忽变成赤童子，手各一人，并赤衣，如婴儿始行之状也。 并在我之左右也，侍兆起居。 其左手童子，是日中司命，名接生。 其右手童子，是日中桃君，名方盈。 俱吐赤气，以灌入我口中，上冲泥丸，下及一身，内外洞彻如火光，存思良久，微祝曰： 太阳正真，赤灵运烟，玉灵化生，与我相亲，接生方盈，日之上神，理魂护形，延命亿千，举体合景，升为高仙。 毕。 恒能行事，存神名者，坐在立亡。",
      "translated_text": "*The Upper Scripture of the Cavern Chamber of the Purple Essence Lord, the August Primordial Purple Numinous Dao Lord*\n\n**Scripture Title:** *The Upper Scripture of the Cavern Chamber of the Purple Essence Lord, the August Primordial Purple Numinous Dao Lord* (abbreviated as *The Upper Scripture of the Cavern Chamber*).\nAuthor unknown, approximately dating to the Northern and Southern Dynasties period, contemporaneous with *The Upper Scripture of Golden Writ and Jade Characters*. Compiled from early Shangqing scriptural formulas, including *The Method of the Five Spirit-Qi of the Supreme Simplicity for Summoning the Imperial Lords*, *The Scripture of the Twenty-Four Spirits of the Supreme Tenuity Emperor Turning the Primal Origin*, *The Jade Scripture and Precious Formulae of the Southern Culmen Primordial Lord*, *The Scripture of the Seven Primes and Nine Celestial Stems of the Supreme*, and *The Scripture of the Supreme Turning the Primal Origin and Concealing the Dao to Remove the Registers of Sins*. One scroll.\nSource of the base text: *Daoist Canon of the Zhengtong Era*, Cavern Mystery Section, Jade Formulae Category.\n\n---\n\n**The Method of the Five Spirit-Qi of the Supreme Simplicity for Summoning the Imperial Lords**\n\nRecline beneath the radiant celestial stems, repose within the ninefold essences, restrain the hun and po in the northern ascent, refine the five spirits within the true qi, roam the eightfold simplicities, and inscribe names upon the Dark Chart. The Supreme Great Lord chants:\n\nAscend the Purple Gate, gaze upon the Eight Mornings,\nExpand the Vermilion Palace, array the luminous spirits,\nRoam the nine qi, dance with the celestial immortals,\nTurban the azure heavens, intone the Great Calendar,\nGird the Vast Fall, recite the Numinous Strategy,\nSummon the storm-dragons, tread the twin whites,\nMagnify the Purple Youths, revolve the two reds,\nConceal the Supreme Simplicity, hide the radiant jade.\n\nThis is the scriptural method of the Purple Essence for summoning the five spirits.\n\nThe *Great Calendar* refers to the records of the Seven Sages.\nThe *Numinous Strategy* refers to the *Scripture of the Jade Emperor*.\n\nAt the hour when the parrot cries, visualize the green qi of the east emerging from the sun and filling the head’s Mud-Pill Palace. Within the Mud-Pill Palace are two green mists, which then issue from the eyes, billowing thickly, and transform into two youths. They are clad in green above and below, resembling infants taking their first steps. The youth of the left eye is named Flying Numinous; the youth of the right eye is named Morning Infant. Both stand at my left and right, perfectly distinct. After a long while, knock the teeth nine times, swallow the saliva nine times, and softly invoke:\n\n*\"Five numina of the east, solar qi gleaming green,\nAt dawn enter the Mud-Pill, refining the brain’s precious form.\nLeft transforms, right transmutes, attaining the name of the Dao,\nEnabling me to ascend and audience the Supreme Simplicity of Purple Clarity.\"*\n\nWhen finished, concentrate intensely on the names of the two youths, and the hundred harms will not assail you. If one cultivates this persistently for eighteen years, one will ascend to heaven.\n\nVisualize the two youths emerging from the eyes, causing the green qi to suddenly transform and take form. Station them at the left and right, so that the two youths each exhale green qi, which bathes and encircles my entire body, penetrating both within and without.\n\nAt noon, face the sun with eyes closed and fists clenched. Visualize two red qi from the sun entering the clenched hands. After a long while, they suddenly transform into two red youths, one in each hand, both clad in red, resembling infants taking their first steps. They stand at my left and right, attending to my rising and resting. The youth in the left hand is the Controller of Destiny within the sun, named Life-Receiver. The youth in the right hand is the Peach Lord within the sun, named Square Fullness. Both exhale red qi, which enters my mouth, surging upward to the Mud-Pill Palace and downward throughout the body, penetrating within and without like firelight. After visualizing for a long while, softly invoke:\n\n*\"True perfection of the Great Yang, red numina wafting mist,\nJade numina transform and arise, intimate with me.\nLife-Receiver and Square Fullness, upper spirits of the sun,\nOrder the hun and guard the form, prolonging life by billions and thousands.\nThe entire body merges with the radiance, ascending as a lofty immortal.\"*\n\nWhen finished, if one persistently practices this and visualizes the names of the spirits, one may sit in death or stand in disappearance.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 782,
      "start_sentence": 0,
      "end_sentence": 29,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.69769859313965,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清紫精君皇初紫灵道君洞房上经.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "哺时平坐，临目存月中有两白气，径来入两足底踱心中，良久，足底各化生两白龙，在我之左右也。 左龙名曰飙精，右龙名曰欻亭，二龙并吐白烟，入我鼻两孔中，径达肺。 存肺中有一童子，上下白衣，从鼻右孔中出，在我右而立，名素明童子，状如婴儿始行状也。 良久，存思分别，极令仿髴，乃叩齿七通，咽液七过，微祝曰： 玉皇飙欻，二龙降晨，入我两足，化生一身，素明童子，左回右旋，和摄六气，养育五神，负我上奔，太素宝仙。 恒能行事，不疾而速。 左目童子飞灵，右目童子晨婴，左手童子接生，右手童子方盈，肺部童子素明，此五神名也。 恒御持飙欻二龙，吐气灌我。 行之勿殆，一十八年，太素遣玉保公下迎，乘景驾晨，径造紫清。 当存素明在我右立，口吐白烟，郁我面上，极思寂注、勿杂念也。 存思皆当临目，毕乃开之。 常存五神二龙在我左右，灌气勿休。 八节日勿杂处也，衣巾不假人，车马不众用，所以专静抱感，注思求妙，故能迥紫軿以扇空，驾飙欻以上升也。 夫仙者心学，心诚则成仙。 道者内求，内密则道来矣。 夫真者修寂，洞静则合真。 神者须感，积感则灵通也。 常能守此，则去仙日近矣。 若夫心竞神务，体和不专，动静丧精，耳目广明者，徒积稔索道，道愈辽也。 〔太微帝君二十四神回元经〕#1 太微帝君，太一造形，紫元内神，二十四真，混气变生，玉仙上精，散解胞结，释滞开元。 〔二十四结节，须〕#2二十四神所命，乃得脱除也。 兆能修存名字者，则治镇一身，保守元精。 欲解结节之法，当先咒之，乃得开关耳。 此灵并是结气之玄宗，成体之真神，运导云雾，带生真烟，各能致玉笔龙骑，千万列行，必同与一体，白日登晨。 此太上真人二十四神存玄守元，帝君上清乘飙欻之道。 常当安身静心，正气夷形，闭目内视，忘体念神，烧香盥炼，存神守真，仿髴三入，蔼蔼晖玄。 行之十八年，太上命太微帝君、太一五神，化生混灵道君，檄二十四真人，千乘万骑，骋风蹑云，呼吸流升，白日造天。 存神之道，勿交非类，深室避事，栖精蹑空，心存目想，微妙守冲，静魂安形，则万害不伤，百鬼避窜，千妖不行，消灾散祸，庆不可胜。 先叩齿二十四通，乃存思： 脑神名觉无子，字道都，形长一寸一分，色正白。 发神名玄文华，字道衡，形长二寸一分，色玄。 皮肤神名通众仲，字道连，形长一寸五分，色黄。 目神名灵监生，字道童，形长三寸，衣五色。 项髓神名灵谟盖，字道周，形长五寸，色白。 膂神名益历辅，字道柱，形长三寸半，白玉素衣。 鼻神名仲龙玉，字道微，形长二寸五分，青白黄色衣。 舌神名始梁峙，字道岐，形长七寸，正赤。 右一身上部八景神童名字，先存之，并如婴儿之形，仿髴在身，各安其所。 讫，乃叩齿八通，咽液八过，而微祝曰： 上景八神，帝君玄母，五神各陈，一合入身，举形遁化，流变适真，千乘万骑，俱升帝晨，白元无英，道养太宾，八灵翼体，玉华衔烟，恍惚千周，径造日门。 初存思之始，先三呼神名字，祝讫，又三呼神名字，令声才出口，三部同尔。 平旦、日中、夜半三时，恒存二十四神，以次念祝呼，如上法。 《高上宝神明科经》说曰：叩齿之法，左左相叩，名曰叩天钟。",
      "translated_text": "At the hour of *bu*, sit upright and, with eyes closed, visualize two streams of white qi emerging from the moon and entering directly into the soles of your feet, penetrating to their centers. After a long while, from each sole two white dragons take form, one on my left and one on my right. The left dragon is named Whirlwind Essence, the right dragon Swift Pavilion. Both dragons exhale white mist, which enters my two nostrils and proceeds directly to the lungs.\n\nVisualize within the lungs a youth clad in white above and below, who emerges from the right nostril and stands at my right. He is named Luminous Purity Youth, his appearance like that of an infant taking its first steps. After a long while, refine the visualization until it is distinct and vivid. Then knock the teeth seven times, swallow saliva seven times, and softly invoke:\n\n*\"Jade Sovereign’s whirlwind and swiftness,\nTwo dragons descend at dawn,\nEntering my two feet, transforming my entire body.\nLuminous Purity Youth, circling left and right,\nHarmonizes and gathers the six qi, nurturing the five spirits.\nBearing me upward, we ascend to the Treasure Immortals of Great Simplicity.\"*\n\nPersist in this practice, and one will attain swiftness without haste.\n\nThe five spirit names are: the youth in the left eye, Flying Numen; the youth in the right eye, Morning Infant; the youth in the left hand, Life-Receiver; the youth in the right hand, Square Fullness; and the youth of the lung, Luminous Purity. Constantly command the two dragons, Whirlwind Essence and Swift Pavilion, to exhale qi and bathe me in it.\n\nPractice this without negligence for eighteen years, and the Lords of Great Simplicity will dispatch Jade Guardian Duke to descend and welcome you. You will ride the radiance, driving the dawn chariot, and ascend directly to the Purple Clarity.\n\nWhen visualizing Luminous Purity standing at my right, see him exhale white mist that billows over my face. Focus the mind intently, without distraction. All visualizations should be done with eyes closed; open them only when finished. Constantly maintain the five spirits and two dragons at my left and right, bathing me in qi without cease.\n\nOn the eight seasonal nodes, avoid mingling with others. Do not lend clothing or headscarves, nor overuse carriages and horses. This is to preserve undivided stillness, to concentrate the mind in seeking the subtle. Thus may one fan the purple chariot through empty space and ride the whirlwind and swiftness upward.\n\nThe immortal path is a study of the heart; with sincerity, one becomes an immortal. The Dao is sought within; with inner secrecy, the Dao comes. The true is cultivated in stillness; with profound quiet, one merges with the true. The divine requires resonance; with accumulated resonance, spiritual communion is achieved. Constantly abide by this, and the day of ascension draws near.\n\nIf the heart is competitive and the spirit restless, if the body is harmonious but the mind not focused, if movement and stillness dissipate essence, if the ears and eyes are overly stimulated—then even with long accumulation, the Dao remains distant.\n\n---\n*The Scripture of the Twenty-Four Spirits Returning to the Origin, by the Lord Emperor of Grand Tenuity, states:*\nThe Lord Emperor of Grand Tenuity, the Great One who fashions form,\nThe inner spirits of Purple Origin, the twenty-four perfected,\nBlended qi transforms and generates, the jade immortals’ supreme essence.\nThey dissolve the knots of the womb, release stagnation, and open the origin.\n\nThe twenty-four knots must be untied by the command of the twenty-four spirits. If one cultivates and visualizes their names, they will govern and stabilize the entire body, preserving original essence.\n\nTo untie the knots, first recite the incantation, then the gates may open. These numina are the mysterious origin of knotted qi, the true spirits that complete the body. They guide clouds and mist, bear the true smoke of life, and each can summon jade-script dragon-riders in ranks of thousands. They must unite as one body to ascend at dawn.\n\nThese are the twenty-four spirits of the Most High Perfected, who guard the mysterious and preserve the origin—the Dao of the Lord Emperor of Highest Clarity, riding the whirlwind and swiftness.\n\nOne should always calm the body and still the heart, rectify the qi and pacify the form. Close the eyes and inwardly gaze, forget the body and contemplate the spirits. Burn incense, purify, refine, visualize the spirits, and guard the true. With threefold indistinct entry, the radiance of the mysterious gathers like mist.\n\nAfter practicing for eighteen years, the Most High will command the Lord Emperor of Grand Tenuity and the Five Spirits of the Great One to transform and generate the Lord of Blended Numen and Dao. He will issue a summons to the twenty-four perfected, with a thousand chariots and ten thousand riders, galloping on wind and treading clouds, breathing and ascending in flow, ascending to heaven in broad daylight.\n\nIn the practice of spirit visualization, do not associate with the unworthy. Retreat to secluded chambers, avoid worldly affairs, perch essence on emptiness. With the heart stored and the eyes visualized, guard the subtle and preserve the tranquil. Still the *hun* and pacify the form, then the ten thousand harms will not wound, the hundred ghosts will flee, the thousand demons will not act, disasters will dissolve, and misfortunes scatter—blessings beyond measure.\n\nFirst knock the teeth twenty-four times, then visualize:\nThe spirit of the brain is named Awareness Without Child, styled Dao Capital, one *cun* and one *fen* in height, pure white in color.\nThe spirit of the hair is named Mysterious Patterned Flower, styled Dao Balance, two *cun* and one *fen* in height, dark in color.\nThe spirit of the skin is named Penetrating Multitude Second, styled Dao Link, one *cun* and five *fen* in height, yellow in color.\nThe spirit of the eyes is named Numinous Overseer of Life, styled Dao Youth, three *cun* in height, clad in five colors.\nThe spirit of the nape marrow is named Numinous Plan Cover, styled Dao Circumference, five *cun* in height, white in color.\nThe spirit of the spine is named Beneficial Calendar Assistant, styled Dao Pillar, three *cun* and a half in height, clad in white jade and plain robes.\nThe spirit of the nose is named Second Dragon Jade, styled Dao Subtle, two *cun* and five *fen* in height, clad in blue, white, and yellow.\nThe spirit of the tongue is named Beginning Beam Peak, styled Dao Fork, seven *cun* in height, pure red.\n\nThese are the names of the eight numinous youths of the upper body’s eight luminaries. First visualize them all in the form of infants, indistinct yet present in the body, each settled in its place. Then knock the teeth eight times, swallow saliva eight times, and softly invoke:\n\n*\"Eight spirits of the upper luminaries,\nLord Emperor and Mysterious Mother,\nFive spirits each arrayed, merging as one within the body.\nThe entire form vanishes and transforms, flowing and changing to merge with the true.\nA thousand chariots and ten thousand riders together ascend to the imperial dawn.\nWhite Origin and Non-Exalted nurture the Supreme Guest,\nEight numina flank the body, jade radiance bearing mist.\nIn a thousand cycles of indistinctness, we proceed directly to the Gate of the Sun.\"*\n\nAt the beginning of visualization, first call the names of the spirits three times. When the invocation is finished, call their names three more times, so that as the sound leaves the mouth, the three sections respond in unison.\n\nAt dawn, noon, and midnight, constantly visualize the twenty-four spirits in sequence, reciting and calling their names as described above.\n\n*The Scripture of Precious Numinous Regulations* states: The method of knocking the teeth—knocking the left against the left—is called \"knocking the Heavenly Bell.\"",
      "overlap_context": " for a long while, softly invoke:\n\n*\"True perfection of the Great Yang, red numina wafting mist,\nJade numina transform and arise, intimate with me.\nLife-Receiver and Square Fullness, upper spirits of the sun,\nOrder the hun and guard the form, prolonging life by billions and thousands.\nThe entire body merges with the radiance, ascending as a lofty immortal.\"*\n\nWhen finished, if one persistently practices this and visualizes the names of the spirits, one may sit in death or stand in disappearance.",
      "start_char": 783,
      "end_char": 2073,
      "start_sentence": 30,
      "end_sentence": 73,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.42585301399231,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清紫精君皇初紫灵道君洞房上经.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "右右相叩，名曰捶天磬。 中央上下对相叩，名曰呜天鼓。 若卒遇凶恶不详，当叩天钟三十过。 若经山，辟邪威神大祝，当捶天磬。 若存思念道，致真招灵，当呜天鼓。 叩齿虽一，其实有左右上下也。 故凶恶而畏天钟之响，山神而惮天磬之洞，招神而肃天鼓之震矣。 宫商有节，希微内感，不可以一求也，不可偶然而合也。 千章万事，皆当如此，叩齿之道演矣，钟鼓之音别矣。 是以道数不可乖错，术法不可杂乱，乖错则有暗昧之败，杂乱则有讟毁之祸，非冥冥之无贯也，行冥贯之无序耳。 道之不成，事之不验，良由求真之途，不由迹辙而来往乎。 叩天钟二十过，谓无他祝，须行此以除不祥耳。 若有所按行，随本文叩齿之多少，不必须叩三十过也。 喉神名百流放，字道通，形长八寸，九色衣。 肺神名素灵生，字道平，形长八寸一分，纯白。 心神名焕阳昌，字道明，形长九寸，色赤。 肝神名开君童，字道青，形长六寸，色青。 胆神名龙德拘，字道放。 形长三寸六分，色青黄绿。 左肾神名春元直，字道卿，形长三寸七分，色玄，数变白赤五色无常。 右肾神名象他无，字道玉，形长三寸五分，色白或黑。 脾神名宝元全，字道骞，形长七寸三分，色正黄。 右一身中部八景神童名字，次存之，并婴儿之形，仿髴在身，各安其所。 讫，叩齿八通，咽液八过，而微祝曰： 中景八神，四变九飞，炼魂正身，明景同晖，得与八神，合辇齐威，千乘万骑，上登太微。 胃神名同来育，字道展，形长七寸，色黄。 穷肠中神名兆滕康，字道还，形长一寸四分，黄赤色。 大小肠中神名蓬送留，字道厨，形长二寸一分，色赤黄。 胴中神名受厚勃，字道虚，形长九寸一分，九色衣。 胸膈神名广瑛宅，字道冲，形长五寸，色白。 两胁神名辟假马，字道成，形长四寸一分，色赤白。 左阴左阳神名扶流起，字道圭，形长二寸二分，色青黄白。 在男存为左阳，在女存为左阴。 右阴右阳神名苞表明，字道生，形长二寸三分，色青黄白。 在男存为右阳，在女存为右阴。 右一身下部八景神童名字，后存之，并婴儿之形，仿髴在身，各安其所。 讫，乃叩齿八通，咽液八过，而微祝曰： 下景八神，散形化灵，紫烟郁生，含元守精，太一元父，帝君挺生，七爽映籍，司命记生，魂魄以安，五爽育明，千乘万骑，与我同并，先造太素，次揖上清。 道一内神名逐无马，字道极生，形长二寸二分，紫色，男存曰道一内神，女存曰真元中灵。 右一身极根之幽神，守中之上灵也。 次又存之，如婴儿之状，安坐其所。",
      "translated_text": "Knocking the right against the right is called \"striking the Heavenly Chime.\"\nKnocking the upper and lower teeth together at the center is called \"sounding the Heavenly Drum.\"\nIf suddenly encountering inauspicious omens or malevolence, knock the Heavenly Bell thirty times.\nWhen traversing mountains, to repel evil and invoke the might of the spirits, strike the Heavenly Chime.\nWhen visualizing the Dao to summon the true and invoke the numinous, sound the Heavenly Drum.\nThough the act of knocking the teeth is one, in truth it distinguishes left and right, upper and lower.\nThus, malevolence fears the resonance of the Heavenly Bell, mountain spirits dread the clarity of the Heavenly Chime, and the summoning of spirits is solemnized by the thunder of the Heavenly Drum.\nThe notes of gong and shang must be measured; subtle inner resonance cannot be sought through uniformity nor achieved by mere coincidence.\nIn all matters great and small, this principle holds—thus the method of knocking the teeth unfolds, and the sounds of bell and drum are distinguished.\nTherefore, the numerology of the Dao must not be transgressed or confused; its techniques and methods must not be disordered.\nTransgression and confusion lead to obscurity and failure; disorder invites slander and calamity.\nThis is not due to the impenetrable void of the unseen, but to the lack of order in its practice.\nThe failure of the Dao and the inefficacy of affairs stem from seeking the true path without following the proper tracks.\n\nKnocking the Heavenly Bell twenty times suffices when no other incantation is required, serving only to dispel inauspiciousness.\nIf following a specific method, adhere to the prescribed number of knocks in the text, without necessarily performing thirty.\n\nThe spirit of the throat is named Hundred Streams Radiant, styled Dao-Tong, eight inches in height, clad in nine colors.\nThe spirit of the lungs is named Pure Numen Born, styled Dao-Ping, eight inches and one fen in height, pure white.\nThe spirit of the heart is named Radiant Yang Prospering, styled Dao-Ming, nine inches in height, crimson.\nThe spirit of the liver is named Opening Lord Youth, styled Dao-Qing, six inches in height, azure.\nThe spirit of the gallbladder is named Dragon Virtue Bound, styled Dao-Fang, three inches and six fen in height, azure-yellow-green.\nThe spirit of the left kidney is named Spring Origin Upright, styled Dao-Qing, three inches and seven fen in height, dark, its color shifting among white, red, and the five hues without constancy.\nThe spirit of the right kidney is named Image Other None, styled Dao-Yu, three inches and five fen in height, white or black.\nThe spirit of the spleen is named Treasure Origin Complete, styled Dao-Qian, seven inches and three fen in height, true yellow.\n\nVisualize in sequence the names of these eight numinous youths of the central body, each in the form of an infant, faintly present within, settled in their respective places.\nUpon completion, knock the teeth eight times, swallow saliva eight times, and softly intone:\n*\"The eight spirits of the central realm,\nFour transformations, nine flights,\nRefine the soul, rectify the body,\nBright radiance shares its splendor.\nUnited with the eight spirits,\nWe join in shared majesty,\nA thousand chariots, ten thousand riders,\nAscend together to the Supreme Microcosm.\"*\n\nThe spirit of the stomach is named Together Come Nurturing, styled Dao-Zhan, seven inches in height, yellow.\nThe spirit within the hollow intestines is named Omen Knee Health, styled Dao-Huan, one inch and four fen in height, yellow-red.\nThe spirit within the large and small intestines is named Vast Delivery Remaining, styled Dao-Chu, two inches and one fen in height, red-yellow.\nThe spirit within the torso is named Receiving Abundance Thriving, styled Dao-Xu, nine inches and one fen in height, clad in nine colors.\nThe spirit of the chest diaphragm is named Vast Crystal Dwelling, styled Dao-Chong, five inches in height, white.\nThe spirits of the two flanks are named Repelling Falsehood Steed, styled Dao-Cheng, four inches and one fen in height, red-white.\nThe spirit of the left yin and left yang is named Supporting Flow Rising, styled Dao-Gui, two inches and two fen in height, azure-yellow-white.\nFor men, visualize as left yang; for women, as left yin.\nThe spirit of the right yin and right yang is named Embracing Bright Manifestation, styled Dao-Sheng, two inches and three fen in height, azure-yellow-white.\nFor men, visualize as right yang; for women, as right yin.\n\nVisualize in sequence the names of these eight numinous youths of the lower body, each in the form of an infant, faintly present within, settled in their respective places.\nUpon completion, knock the teeth eight times, swallow saliva eight times, and softly intone:\n*\"The eight spirits of the lower realm,\nDispersed forms transform into numinous beings,\nPurple mist rises thickly,\nEmbracing the origin, guarding essence.\nThe Primordial Father of the Great One,\nThe Lord Emperor engenders life,\nThe seven luminaries shine in the register,\nThe Controller of Destiny records birth.\nSoul and spirit are at peace,\nThe five luminaries nurture clarity,\nA thousand chariots, ten thousand riders,\nJoin me in ascent,\nFirst to the Primal Simplicity,\nThen to pay homage in the Supreme Clarity.\"*\n\nThe spirit of the innermost root of the body is named Pursuing Nothing Steed, styled Dao-Ji-Sheng, two inches and two fen in height, purple.\nFor men, visualize as the Inner Spirit of the One Dao; for women, as the Central Numen of the True Origin.\nThis is the profound spirit of the body’s deepest root, the supreme numen guarding the center.\nNext, visualize it in the form of an infant, seated in its proper place.",
      "overlap_context": "first call the names of the spirits three times. When the invocation is finished, call their names three more times, so that as the sound leaves the mouth, the three sections respond in unison.\n\nAt dawn, noon, and midnight, constantly visualize the twenty-four spirits in sequence, reciting and calling their names as described above.\n\n*The Scripture of Precious Numinous Regulations* states: The method of knocking the teeth—knocking the left against the left—is called \"knocking the Heavenly Bell.\"",
      "start_char": 2073,
      "end_char": 3100,
      "start_sentence": 74,
      "end_sentence": 114,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.094106435775757,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清紫精君皇初紫灵道君洞房上经.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "讫，乃叩齿三十过，咽液二十四通，而微祝曰： 玄上内真，养形侍晨，总纽摄纲，九度八旋，斗星内玄，宫馆九陈，帝君合昌，九道七咽，出液纳精，和灌众神，五藏生华，反老童颜，千乘万骑，与我升天，上朝太阶，高揖玉晨。 右一身宝名内字，化生之精神也。 不知此名，则仙道不成矣。 若解结之日，不先祝此者，则结节不解也。 结节不解，必三魂失适，上元内丧，五老失明，帝君乖踈也。 男存为童子之神，女存为女子之神，俱同一名字也。 存二十四神，常以夜半，去枕平卧，握固放体，气调而微，存思其身神，安念帝君，令仿髴居位，闭目内视之。 如有不具，便当烧香平坐闭目，握固两膝上，精存众神，祝行如法。 其平旦、日中时存神，自平坐而行之，勿令有见之者矣。 皆内视临闭而存也。 月一日夜半，存神讫，又存两目中有白气，如鸡子大，在面目前，须臾变成两明镜，径九尺，以前后照我一体上二十四神，使洞鉴分明。 良久，乃心祝曰： 大明宝镜，分形散化，鉴朗元神，制却万魔，飞行上清，披云巾罗，役使千灵，封山召河。 毕。 五日一行之，所谓覆校内精，检敛五神者也。 常能行之，灾害不生，而位登高仙。 拂童之道，使彻见帝君五神及二十四神之法：常以甲子之旬，庚午之日，日中之时，取清水一斗，以一铢真丹投水中搅之，左行三七过，祝曰： 玄流朱精，生光入明，身神众列，并来见形，彻视万里，中达九灵，帝君映童，使我上精。 祝毕，东向以洗目二七过。 恒行之者，彻视万神。 祝当微言，以水向月建洗目，常东向。 太上真人招五辰於洞房籍飞仙於六合隐存秘道南极元君受传玉经宝诀 夜半清静，坐卧任意，安体静心，宽气调神，临目内视，存西方太白星，在面两眉上，名为玉珰紫阙。 眉上一寸直入一寸，为玉珰紫阙。 阳日存星在左眉上，阴日存星在右眉上。 次又存北方辰星，在天中帝乡玄宫。 帝乡玄宫从鼻直上，至发际五分，直入一寸。 次又存东方木星，在洞关朱台。 洞关朱台在目后一寸，直入一寸。 阳日存星在左目后，阴日存星在右目后。 次又存南方荧惑星，在玉门华房。 玉门华房在两目眦内际五分，直入五分。 阳日存在左目眦际，阴日存在右目眦际。 次又存中央镇星，在金匮黄室长谷。 金匮黄室长谷，在人中中央直入二分，星如缀悬於上。 存思都讫，仿髴令星处其位，当觉使五星出光芒，放五色烟，贯我一身，洞彻内外，体中如有熏熏星精来入也。 乃叩齿二十五通，咽液二十五过讫，乃微祝曰： 高元紫阙，内见帝君，太一混合，紫房之门，门内焕明，是为三元，三元结精，中有五神，宝曜敷晖，放光冲门，精化积生，变为老人，首巾素容，绿帔绛裙，右带流铃，左佩虎文，手把天纲，散锋飞辰，足蹑华盖，吐芒练身，三景保守，令我得真，养魂制魄，乘飙飞仙。 毕，又咽液三过，叩齿三通。 常能行此十五年者，於是南极老人丹陵上真，迎以绿云之举； 西极老人素灵子期，迎以黄飙之车； 北极老人玄上仙皇，迎以玄景之龙； 东极老人扶阳公子，迎以青軿之辇； 中元老人中央上玄子，迎以曲晨之盖。 五老一合，俱升紫虚。 行之勿令不常也，存之勿令不精也。",
      "translated_text": "Having completed this, knock the teeth thirty times and swallow saliva twenty-four cycles, then softly intone the incantation:\n\n\"Dark Prime’s inner truth,\nNurtures form and attends the dawn,\nMastering the pivot and grasping the web,\nNine revolutions and eight spirals,\nThe Dipper’s stars within the profound,\nPalaces arrayed in ninefold ranks,\nThe Lord Emperor joins in flourishing,\nNine Ways and seven swallows,\nExpelling fluid and receiving essence,\nHarmonizing to bathe the host of spirits,\nThe five viscera bloom with radiance,\nReverting age to youthful countenance,\nA thousand chariots, ten thousand riders,\nAscend with me to heaven,\nTo pay homage at the Grand Stair,\nAnd bow deeply to the Jade Dawn.\"\n\nThis is the precious name of the body’s inner character, the spirit of transformation and life. Without knowing this name, the Dao of immortality cannot be achieved. If, on the day of untying the knots, one does not first recite this incantation, the knots will not be undone. Should the knots remain unresolved, the three hun-souls will lose their harmony, the Upper Prime’s inner essence will be lost, the Five Elders will lose their clarity, and the Lord Emperor will become estranged.\n\nFor men, visualize this as the spirit of the Divine Child; for women, as the spirit of the Divine Maiden—both share the same name. Visualize the twenty-four spirits, always at midnight, lying flat without a pillow, fists clenched and body relaxed, breath regulated and subtle. Focus the mind on the body’s spirits, and with tranquil thought, summon the Lord Emperor to appear in his proper place. Close the eyes and inwardly behold him. If any are incomplete, then burn incense, sit upright, close the eyes, clench the fists upon the knees, and with concentrated intent, visualize the host of spirits while reciting the incantation as prescribed.\n\nAt dawn and noon, perform the visualization while sitting upright, ensuring no one witnesses it. Always inwardly behold with eyes closed.\n\nOn the first day of the month at midnight, after visualizing the spirits, next visualize within the eyes a white qi the size of a chicken’s egg, suspended before the face. In an instant, it transforms into two luminous mirrors, each nine feet in diameter, which shine before and behind, illuminating the twenty-four spirits upon the body with perfect clarity. After a long while, intone the incantation:\n\n\"Great Luminous Treasure Mirrors,\nDispersing forms and transforming manifestations,\nIlluminating the primordial spirit,\nSubduing the myriad demons,\nSoaring to the Supreme Clarity,\nParting the cloud-veiled canopy,\nCommanding a thousand spirits,\nSealing mountains and summoning rivers.\"\n\nConclude. Perform this once every five days—this is what is meant by \"reviewing the inner essence and inspecting the five spirits.\" By practicing this regularly, calamities will not arise, and one will ascend to the rank of High Immortal.\n\nThe method for the Divine Child’s revelation, enabling clear vision of the Lord Emperor, the five spirits, and the twenty-four spirits, is as follows: During the *jiazi*旬, on the day of *gengwu*, at noon, take a *dou* of pure water and dissolve one *zhu* of true cinnabar into it. Stir counterclockwise twenty-one times and recite the incantation:\n\n\"Crimson essence of the Dark Flow,\nGenerating light and entering clarity,\nThe host of body spirits all appear,\nManifesting their forms,\nPenetrating vision for ten thousand *li*,\nCommuning with the Nine Numinous Ones,\nThe Lord Emperor illumines the Child,\nRefining my supreme essence.\"\n\nConclude the incantation, then face east and wash the eyes fourteen times. Those who practice this regularly will attain penetrating vision of the myriad spirits. The incantation should be recited softly, washing the eyes with the water while facing the moon’s position, always toward the east.\n\nThe Most High Perfected Person summons the Five Celestial Bodies in the Grotto Chamber and registers the flying immortals within the Six Directions. The Hidden Stored Secret Dao of the Southern Culmen’s Primordial Lord transmits the Jade Scripture’s precious instructions.\n\nAt midnight, in perfect stillness, sit or lie as you wish. Calm the body, quiet the mind, relax the breath, and regulate the spirit. Close the eyes and inwardly visualize the Western White Star above the brows, called the Jade Pendants of the Purple Palace. One *cun* above the brows and one *cun* inward lies the Jade Pendants of the Purple Palace. On yang days, visualize the star above the left brow; on yin days, above the right brow.\n\nNext, visualize the Northern Chen Star in the Celestial Center’s Imperial Realm of the Dark Palace. The Imperial Realm of the Dark Palace lies directly above the nose, five *fen* from the hairline, one *cun* inward.\n\nNext, visualize the Eastern Wood Star in the Vermilion Terrace of the Grotto Pass. The Vermilion Terrace of the Grotto Pass lies one *cun* behind the eyes, one *cun* inward. On yang days, visualize the star behind the left eye; on yin days, behind the right eye.\n\nNext, visualize the Southern Fire Star in the Jade Gate of the Flowery Chamber. The Jade Gate of the Flowery Chamber lies five *fen* within the inner corners of the eyes. On yang days, visualize it within the left eye’s corner; on yin days, within the right.\n\nNext, visualize the Central Earth Star in the Golden Coffer of the Yellow Chamber and the Long Valley. The Golden Coffer of the Yellow Chamber and the Long Valley lies at the center of the philtrum, two *fen* inward, with the star suspended as if strung above.\n\nHaving completed the visualization, ensure the stars occupy their proper positions. One should feel the five stars emitting radiant beams, releasing five-colored mists that penetrate the body, illuminating both within and without, as if the body is suffused with the stars’ essence.\n\nThen knock the teeth twenty-five times and swallow saliva twenty-five cycles. Softly intone the incantation:\n\n\"Lofty Purple Palace,\nWithin appears the Lord Emperor,\nThe Great One blends in unity,\nThe gate of the Purple Chamber,\nWithin it shines resplendent,\nThis is the Three Primes,\nThe Three Primes congeal essence,\nWithin dwell the five spirits,\nPrecious luminaries spread their radiance,\nBeams of light surge through the gate,\nEssence transforms and accumulates,\nChanging into an elder,\nHead wrapped in white, serene countenance,\nGreen mantle and crimson skirt,\nRight side bears flowing bells,\nLeft side adorned with tiger patterns,\nHolding the Heavenly Net in hand,\nDispersing blades and flying stars,\nFeet treading the Flowery Canopy,\nSpouting rays to refine the body,\nThe Three Luminaries guard and protect,\nGranting me attainment of the true,\nNurturing the hun and restraining the po,\nRiding the whirlwind to fly as an immortal.\"\n\nConclude, then swallow saliva three more times and knock the teeth three times.\n\nThose who practice this for fifteen years will be met thus: The Southern Culmen’s Elder of the Cinnabar Mound and Supreme Perfected One will welcome them with a chariot of green clouds; the Western Culmen’s Elder, the White Numinous Master, will welcome them with a carriage of yellow whirlwinds; the Northern Culmen’s Elder, the Dark Supreme Immortal Sovereign, will welcome them with a dragon of dark radiance; the Eastern Culmen’s Elder, the Yang-Assisting Noble Son, will welcome them with a palanquin of azure curtains; the Central Prime’s Elder, the Supreme Dark Child of the Center, will welcome them with a canopy of curved dawn. The Five Elders will unite, ascending together to the Purple Void.\n\nPractice this without fail, and visualize with utmost precision.",
      "overlap_context": "scent,\nFirst to the Primal Simplicity,\nThen to pay homage in the Supreme Clarity.\"*\n\nThe spirit of the innermost root of the body is named Pursuing Nothing Steed, styled Dao-Ji-Sheng, two inches and two fen in height, purple.\nFor men, visualize as the Inner Spirit of the One Dao; for women, as the Central Numen of the True Origin.\nThis is the profound spirit of the body’s deepest root, the supreme numen guarding the center.\nNext, visualize it in the form of an infant, seated in its proper place.",
      "start_char": 3100,
      "end_char": 4340,
      "start_sentence": 115,
      "end_sentence": 161,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.15227150917053,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清紫精君皇初紫灵道君洞房上经.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "忌履秽，禁杂处，常熏香，数沐浴。 违之者凋败，顺之者飞仙也。 存星毕，而欲有所愿，在意於祝后，续言之也。 存五星共室止处，直入项下三寸，仍辟方一寸，星如弹丸，昭一洞面体。 月旦、月望、七日、九日、十三日、十七日、二十日、二十五日，鸡呜时，存日月之象在魂房六合之府。 六合之府在两目外之上角小仰高空之中，按之叩齿，闻乎下有四会，动在其下者是也，直入一寸方九分，名曰魂房六合之府。 日左月右，存使光明洞形，令仿髴在位，闭目极念，无得遣脱。 毕，叩齿六通，咽液九过，而微祝曰： 大明灵晨，九度郁青，招霞藏晖，灌炼五形，宫驾六合，七神调平，使我飞仙，登行上清。 毕。 行之十五年，玉皇遣三素玉童来迎。 当养能呜鸡，使其司旦，而有常节者也。 若隐章而作，必失日月之交晖也。 南极夫人受此卫於太上高真，名曰双景翼形隐道。 太上七元九辰经洞房八解门玉字 斗星第一太星，精名玄枢，神曰阳明。 第二元星，精名北台，神曰阴精。 第三真星，精名九极，神曰真人。 第四纽星，精名旋根，神曰玄冥。 第五纲星，精名天平，神曰丹元。 第六纪星，精名命机，神曰北极。 第七关星，精名玄阳，神曰天关。 第八帝星，精号高上玉皇君，神曰八景灵元君。 第九尊星，精号太微玉帝君，神曰太素七晨元君。 此斗君名号，是曰九辰。 斗有魂魄之星，回旋在斗外，裹缠於斗，斗在魂魄之内也。 其纲在外，不似斗者，盖魂魄游变，不缘形也。 子步斗魂，存心呼七魂之名，曰飞仙，蹑一黑星，辄呼一魂名。 不知此名，术不行，道不成也。 其星在阳明阴精之间，是斗魂魄之魁首星也，名曰天枢魂神。 次又上角行第二星，名曰天旋魂神。 次向阳明顺行第三星，名曰天机魄精。 次对真人第四星，名曰天权魄精。 次对丹元第五星，名曰玉衡魄灵。 次对天关第六星，名曰闿阳魄灵。 次上行下对北极第七星，名曰摇光大明。 此七星魂魄之名号，曰七元之灵明。 七星魂在黑星上，皆心存此名曰飞仙也。 太上回元隐道用除罪籍内篇 太上玉真隐元内观，用六丁之日，是生气时，天元敷陈，胞结重固，七魄上言，三魂记过，遗愆七祖，积罚三阴，故有消除之法，以解脱愆罪。 施此道者，乃曰求仙之夫者矣。 常以甲子之旬，丁卯之日，夜半之时，於寝床平坐； 北向接手，叩齿七通毕，乃仰存七星，使焕明於北方。 良久，微祝曰：第一太星玄枢阳明天枢魂神上玄君。 七呼之，乃又祝曰：愿得除某七世以来，下逮某身阳罪阳过，皆令消除，所向如愿，万事合心，飞步七元，与天相倾，名刊斗晨，延纪亿千。 毕，乃存阳明星从斗而来，飞入我口，径在心中，存星光，令内外洞彻，极思念之。 此谓解晨结罗内映上道。 当存觉七星，缺一余六，故悬乎天也。 缺者存来，忽入我口中，是故余六位在天耳。 事事皆效此法。 甲戌之旬，丁丑之日，夜半之时，於寝床平坐，北向接手，先叩齿七过毕，乃仰存七星，使焕明於北方，良久，微祝曰：第二元星北台阴精天旋魂神上玉君。 七呼之，乃又祝曰：愿得除某七世以来，下逮某身阴罪阴过，皆令消除，六气盈满，四神用虚，飞行七元，名刊玉书，上登紫清，乘玄驾无，出入利贞，与天同符。",
      "translated_text": "Avoid treading upon filth, shun defiling company, regularly burn incense, and bathe frequently. Those who violate these precepts will wither and decay; those who observe them will ascend as flying immortals.\n\nOnce the visualization of the stars is complete and you harbor a wish, focus your intent upon the invocation and then articulate it. Envision the Five Stars dwelling together, entering directly three *cun* below the nape, then spreading one *cun* in each direction—each star bright as a pellet, illuminating the entire body with radiance.\n\nOn the first, fifteenth, seventh, ninth, thirteenth, seventeenth, twentieth, and twenty-fifth days of the lunar month, at cockcrow, visualize the images of the sun and moon within the *Hun* Chamber, the Mansion of the Six Harmonies. This mansion lies at the upper outer corners of the eyes, slightly raised toward the empty space above. Press there, knock the teeth, and listen below for the convergence of the Four Meetings—where movement stirs beneath is the place. Enter directly one *cun*, spanning nine *fen* in width, called the *Hun* Chamber, the Mansion of the Six Harmonies. The sun to the left, the moon to the right, visualize their light illuminating the form, making it faintly perceptible in its place. Close the eyes and concentrate intensely, allowing no lapse in focus. Upon completion, knock the teeth six times, swallow saliva nine times, and softly invoke:\n\n*\"Great luminous dawn, ninefold verdant ascent,\nSummoning rosy clouds, concealing radiance,\nBathing and refining the five forms,\nPalace-chariot of the Six Harmonies,\nSeven spirits in harmonious balance,\nGrant me flight as an immortal,\nAscending to traverse the Upper Clarity.\"*\n\nAfter fifteen years of practice, the Jade Emperor will dispatch the Three Pure Jade Lads to welcome you.\n\nOne must train a rooster to crow, ensuring it marks the dawn with regularity. If the method is concealed and practiced in secret, the mutual radiance of sun and moon will be lost.\n\nThe Southern Culmen’s Lady received this protective method from the Most High Perfected Ones, naming it the *Double Radiance Winged Form Concealment Dao*.\n\n**The Seven Primes and Nine Stars Scripture of the Celestial Grotto Chamber’s Eightfold Liberation Gate and Jade Characters**\n\n**Dipper Star, First Great Star:** Essence named *Mysterious Pivot*, spirit called *Yang Brightness*.\n**Second Prime Star:** Essence named *Northern Terrace*, spirit called *Yin Essence*.\n**Third True Star:** Essence named *Nine Ultimates*, spirit called *Perfected Person*.\n**Fourth Pivot Star:** Essence named *Rotating Root*, spirit called *Mysterious Darkness*.\n**Fifth Net Star:** Essence named *Celestial Balance*, spirit called *Cinnabar Prime*.\n**Sixth Record Star:** Essence named *Life Mechanism*, spirit called *Northern Culmen*.\n**Seventh Barrier Star:** Essence named *Mysterious Yang*, spirit called *Celestial Barrier*.\n**Eighth Emperor Star:** Essence titled *Supreme Jade Emperor Lord*, spirit called *Eightfold Radiance Numinous Prime Lord*.\n**Ninth Venerable Star:** Essence titled *Grand Tenuity Jade Emperor Lord*, spirit called *Grand Simplicity Sevenfold Dawn Prime Lord*.\n\nThese are the names and titles of the Dipper Lords, known as the Nine Stars. The Dipper possesses stars of *hun* and *po*, revolving around its exterior and entwining it—the Dipper lies within the *hun* and *po*. Its net extends outward, unlike the Dipper’s form, for the *hun* and *po* roam and transform, unbound by shape.\n\nTo pace the *hun* of the Dipper, store the heart’s intent and call the names of the Seven *Hun*, saying *Flying Immortal* as you tread upon each black star, invoking one *hun* name per step. Without knowing these names, the method will not take effect, and the Dao will not be achieved.\n\nThe star between *Yang Brightness* and *Yin Essence* is the chief of the Dipper’s *hun* and *po*, named the *Celestial Pivot Hun Spirit*. Next, proceed to the upper corner of the second star, named the *Celestial Rotation Hun Spirit*. Then, moving toward *Yang Brightness*, follow the third star, named the *Celestial Mechanism Po Essence*. Opposite the *Perfected Person*, the fourth star is named the *Celestial Balance Po Essence*. Opposite *Cinnabar Prime*, the fifth star is named the *Jade Balance Po Numinous*. Opposite *Celestial Barrier*, the sixth star is named the *Kai Yang Po Numinous*. Finally, ascending to face *Northern Culmen*, the seventh star is named *Shaking Radiance Great Brightness*.\n\nThese are the names and titles of the seven stars’ *hun* and *po*, called the *Seven Primes’ Numinous Brightness*. The *hun* of the seven stars reside upon the black stars—store these names in the heart and say *Flying Immortal*.\n\n**The Most High’s Revolving Prime Concealment Dao for Removing Sin Records, Inner Chapter**\n\nThe *Jade Perfected Concealed Prime Inner Vision* employs the days of the Six *Ding* as the time of generative *qi*, when the Celestial Prime unfolds, the embryonic matrix is doubly fortified, the Seven *Po* speak above, the Three *Hun* record transgressions, ancestral errors of seven generations accumulate, and punishments amass in the Three Yin. Thus, there exists a method of dissolution to absolve transgressions and sins.\n\nThose who practice this method are called seekers of immortality. Regularly, on the *Ding-Mao* day within the *Jia-Zi* decade, at midnight, sit upright upon the bed, face north, clasp the hands, and knock the teeth seven times. Then, gaze upward and visualize the Seven Stars, making them shine brilliantly in the north. After a long while, softly invoke:\n\n*\"First Great Star, Mysterious Pivot, Yang Brightness, Celestial Pivot Hun Spirit, Supreme Prime Lord.\"*\n\nCall seven times, then invoke again:\n\n*\"May I be absolved of all yang sins and yang transgressions from my seven generations down to my present self, dissolving them entirely. May all I undertake be as I wish, all matters align with my heart. May I pace the Seven Primes, harmonize with heaven, my name inscribed upon the Dipper’s dawn, my lifespan extended by billions and thousands.\"*\n\nUpon completion, visualize the *Yang Brightness* star descending from the Dipper, flying into your mouth, and entering your heart. Envision the star’s light, making the interior and exterior thoroughly luminous, and concentrate intensely. This is called *Dissolving the Dawn Net’s Inner Reflection of the Upper Dao*.\n\nAt this moment, visualize the Seven Stars, one missing and six remaining, thus suspended in the sky. Visualize the missing one descending and suddenly entering your mouth—hence, the other six remain in the heavens. All matters follow this method.\n\nOn the *Ding-Chou* day within the *Jia-Xu* decade, at midnight, sit upright upon the bed, face north, clasp the hands, knock the teeth seven times, then gaze upward and visualize the Seven Stars, making them shine brilliantly in the north. After a long while, softly invoke:\n\n*\"Second Prime Star, Northern Terrace, Yin Essence, Celestial Rotation Hun Spirit, Supreme Jade Lord.\"*\n\nCall seven times, then invoke again:\n\n*\"May I be absolved of all yin sins and yin transgressions from my seven generations down to my present self, dissolving them entirely. May the Six *Qi* be full, the Four Spirits at ease. May I fly through the Seven Primes, my name inscribed in the Jade Book, ascend to the Purple Clarity, ride the dark chariot of the void, move with auspicious correctness, and harmonize with heaven.\"*",
      "overlap_context": "iage of yellow whirlwinds; the Northern Culmen’s Elder, the Dark Supreme Immortal Sovereign, will welcome them with a dragon of dark radiance; the Eastern Culmen’s Elder, the Yang-Assisting Noble Son, will welcome them with a palanquin of azure curtains; the Central Prime’s Elder, the Supreme Dark Child of the Center, will welcome them with a canopy of curved dawn. The Five Elders will unite, ascending together to the Purple Void.\n\nPractice this without fail, and visualize with utmost precision.",
      "start_char": 4340,
      "end_char": 5589,
      "start_sentence": 162,
      "end_sentence": 213,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.918203830718994,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清紫精君皇初紫灵道君洞房上经.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "毕，乃存阴精星从斗而来，飞入我口，径在肺中，使鉴洞内外，五藏分明。 存星来入口，当令自觉光芒四散满口，如口中小热，即星精来入之验也。 诸思七元存九晨之道，所寝床席不与他同止，衣服亦然。 男女同席而息者，乃列罪北玄之籍。 犯污秽者，殃注於三祖之考。 师及同气不为犯也。 甲申之旬，丁亥之日，夜半之时，於寝床平坐，北向接手，叩齿七过毕，乃仰存七星，使焕明於北方。 良久，阴祝曰：第三真星九极上真上元真人天机魄精上素君。 七呼之，乃祝日：愿得除某七祖以来，下逮某身死罪死过，积恶私匿，犯天地水三官者，皆令消灭，目明彻视，鉴洞幽无，飞行七元，名书上清，役使万神，上登玉庭，驾景乘空，与天相倾。 毕，乃存真人星从斗而来，下飞入我口，径在肝中，使光照五脏，内外洞明。 毕，北向再拜，拜毕，咽液九过，亦可心拜真星。 甲午之旬，丁酉之日，夜半之时，於寝室床平坐，北向接手，叩齿七过，乃仰存七星，使焕明於北方。 良久，微祝曰：第四纽星璇玑玄冥天权魄精上虚君。 七呼之，又祝曰：愿得除某七世以来，下逮某身无恩无德，不仁不孝，阴恶之罪，数千万计，皆令消灭，服食纳精，以日进益，飞登七元，录刊太玄，上列玉皇，乘欻九天，役神御灵，日月同新。 毕，乃存玄冥星从斗而来，下飞入我口，径在脾中，使光明洞彻，映着五脏。 毕，咽液二七过。 甲辰之旬，丁未之日，夜半之时，於寝室床，北向接手，叩齿七通毕，乃仰存七星，使焕明於北方。 良久，微祝曰：第五纲星天平丹元玉衡魄灵上君上玄九皇君。 七呼之，又祝曰：愿得除某七世以来，下逮某身内外秽罪，表裹沉过数千万亿，记在幽关者，皆令消除，当令体充气盈，黄庭镇中，上列太素，乘景紫宫，右侍玉女，左侍玉童，日月同晖，位为真王。 毕，乃存丹元星从斗而来，下飞入我口，径在胃中，使光洞朗照，五脏分别。 毕，咽液二九过。 甲寅之旬，丁巳之日，夜半之时，於寝室床，北向接手，先叩齿七过，乃仰存七星，使焕明於北方。 良久，微祝曰：第六纪星命机北极闿阳魄灵上真丹皇虚无君。 七呼之，又祝曰：愿得除某七世以来，下逮某身所犯所行贼恶罪过，奸逆乱妄，列纪帝宫者，皆令消灭，百痾康愈，体气利贞，名书仙台，刻金上清，役使万神，飞行九明。 毕，存北极星从斗而来，下径入我口，在肾中，使光明洞彻，五脏分别。 毕，咽液二七。 阳日存在左肾，阴日存在右肾，一日为阳，二日为阴。 此道尤禁交接。 交接，太上考及三世祖、父母，身死为下鬼。 月晦之夕，明日月朔也，未鸡呜之前，当於寝室床上，东向接手平坐，叩齿七过，乃仰存北方七星，使焕明於我之左面也。 良久，微祝曰：第七关星玄阳天关摇光大明太上玉皇道君。 七呼之，又祝曰：愿得除某七世以来暗昧匿罪，犯罹五刑，身中之神数千万亿，记在北帝鬼官者，皆令消灭，当令某神精八达，坐在立亡，耳听绝音，目生紫光，刊玉太素，洞鉴鬼形，名书帝轩，命均二明，飞行七元，寝宴紫庭。 毕，存天关星飞从斗而来下，径入我口中，从口中入至目瞳中，通映两眼，使内外自照，存见五脏，使分明。",
      "translated_text": "When finished, visualize the Yin Essence Star descending from the Dipper, flying into your mouth, and entering directly into your lungs, allowing it to illuminate and clearly discern both within and without, making the Five Viscera distinct. As the star enters your mouth, you should feel its radiance scattering and filling your mouth; if your mouth grows slightly warm, this is the sign that the star’s essence has entered. In all contemplations of the Seven Primes and the Way of the Nine Mornings, the bed and mat where you sleep must not be shared with others, nor should your clothing. If a man and woman share a mat to rest, their names are recorded in the ledgers of sin under the Northern Mystery. Those who defile themselves with impurity bring calamity upon their three generations of ancestors. This does not apply to masters and those of the same *qi*.\n\nOn the *Ding-Hai* day within the *Jia-Shen* decade, at midnight, sit upright upon the bed, face north, clasp the hands, knock the teeth seven times, then gaze upward and visualize the Seven Stars, making them shine brilliantly in the north. After a long while, softly invoke:\n\n*\"Third True Star, Nine Ultimates, Supreme Perfected, Primordial True Person, Celestial Mechanism, Po-Spirit, Essence of the Upper Void, Lord of Pure Simplicity.\"*\n\nCall seven times, then invoke again:\n\n*\"May I be absolved of all death sins and death transgressions from my seven generations down to my present self—accumulated evils, hidden faults, and offenses against the Three Officials of Heaven, Earth, and Water—dissolving them entirely. May my eyes see clearly, piercing the darkest depths, my name inscribed in the Upper Clarity, commanding the myriad spirits, ascending to the Jade Court, riding the luminous chariot of the void, and harmonizing with heaven.\"*\n\nWhen finished, visualize the True Person Star descending from the Dipper, flying into your mouth, and entering directly into your liver, its light illuminating the Five Viscera and making all within and without distinctly visible. Then, face north and bow twice; when finished, swallow saliva nine times. You may also bow in your heart to the True Star.\n\nOn the *Ding-You* day within the *Jia-Wu* decade, at midnight, sit upright upon the bed in your sleeping chamber, face north, clasp the hands, knock the teeth seven times, then gaze upward and visualize the Seven Stars, making them shine brilliantly in the north. After a long while, softly invoke:\n\n*\"Fourth Pivot Star, Mystic Mechanism, Dark Depths, Celestial Balance, Po-Spirit, Essence of the Upper Void, Lord of Profound Mystery.\"*\n\nCall seven times, then invoke again:\n\n*\"May I be absolved of all ungrateful and unvirtuous deeds, all acts of unkindness and unfiliality, and all yin evils—numbering in the tens of millions—from my seven generations down to my present self, dissolving them entirely. May I ingest essence and refine *qi*, daily increasing in power, ascending through the Seven Primes, my name inscribed in the Great Mystery, listed among the Jade Emperor’s court, riding the swift chariot of the Nine Heavens, commanding spirits and guiding numina, renewing with the sun and moon.\"*\n\nWhen finished, visualize the Dark Depths Star descending from the Dipper, flying into your mouth, and entering directly into your spleen, its light illuminating and piercing through, casting radiance upon the Five Viscera. Then, swallow saliva fourteen times.\n\nOn the *Ding-Wei* day within the *Jia-Chen* decade, at midnight, sit upright upon the bed in your sleeping chamber, face north, clasp the hands, knock the teeth seven times, then gaze upward and visualize the Seven Stars, making them shine brilliantly in the north. After a long while, softly invoke:\n\n*\"Fifth Principal Star, Celestial Balance, Cinnabar Prime, Jade Mechanism, Po-Spirit, Numinous Essence, Supreme Lord, Nine August Sovereigns of the Upper Mystery.\"*\n\nCall seven times, then invoke again:\n\n*\"May I be absolved of all inner and outer defilements—sins and deep transgressions numbering in the tens of millions of billions, recorded in the hidden passes—from my seven generations down to my present self, dissolving them entirely. May my body be filled and my *qi* abundant, the Yellow Court stabilized within, my name listed in the Great Simplicity, riding the luminous chariot to the Purple Palace, attended on the right by Jade Maidens and on the left by Jade Lads, sharing radiance with the sun and moon, and assuming the rank of True King.\"*\n\nWhen finished, visualize the Cinnabar Prime Star descending from the Dipper, flying into your mouth, and entering directly into your stomach, its light illuminating and clearly distinguishing the Five Viscera. Then, swallow saliva eighteen times.\n\nOn the *Ding-Si* day within the *Jia-Yin* decade, at midnight, sit upright upon the bed in your sleeping chamber, face north, clasp the hands, knock the teeth seven times, then gaze upward and visualize the Seven Stars, making them shine brilliantly in the north. After a long while, softly invoke:\n\n*\"Sixth Record Star, Life Mechanism, Northern Culmen, Opening Yang, Po-Spirit, Numinous Essence, Supreme Perfected, Cinnabar August Sovereign of the Void.\"*\n\nCall seven times, then invoke again:\n\n*\"May I be absolved of all thieving evils, rebellious acts, and chaotic transgressions—offenses recorded in the imperial archives—from my seven generations down to my present self, dissolving them entirely. May the hundred ailments be cured, my body’s *qi* flow with auspicious correctness, my name inscribed on the Immortal Terrace, engraved in gold in the Upper Clarity, commanding the myriad spirits, and soaring through the Nine Luminaries.\"*\n\nWhen finished, visualize the Northern Culmen Star descending from the Dipper and entering directly into your mouth, settling in your kidneys, its light illuminating and clearly distinguishing the Five Viscera. Then, swallow saliva fourteen times. On yang days, visualize it in the left kidney; on yin days, in the right kidney. The first day is yang, the second yin. This practice strictly forbids sexual intercourse. Those who engage in it will be examined by the Most High and their three generations of ancestors and parents; their own death will reduce them to lowly ghosts.\n\nOn the evening of the last day of the lunar month, before the next month’s first day and before the cock crows, sit upright upon the bed in your sleeping chamber, face east, clasp the hands, knock the teeth seven times, then gaze upward and visualize the Seven Stars of the north, making them shine brilliantly to your left. After a long while, softly invoke:\n\n*\"Seventh Barrier Star, Mystic Yang, Celestial Barrier, Shaking Radiance, Great Brilliance, Supreme Jade August Sovereign, Dao Lord.\"*\n\nCall seven times, then invoke again:\n\n*\"May I be absolved of all hidden and obscured sins—offenses subject to the Five Punishments, numbering in the tens of millions of billions among the spirits within my body, recorded in the Ghostly Archives of the Northern Emperor—from my seven generations down to my present self, dissolving them entirely. May my spirit and essence flow freely, granting the power to sit in stillness or vanish at will, my ears hearing the most distant sounds, my eyes emitting purple light, my name inscribed in the Jade Great Simplicity, my vision piercing all ghostly forms, my name recorded in the Imperial Carriage, my fate equal to the Two Luminaries, soaring through the Seven Primes, and resting in the Purple Court.\"*\n\nWhen finished, visualize the Celestial Barrier Star descending from the Dipper, flying into your mouth, and entering directly into your pupils, illuminating both eyes and allowing you to see clearly within and without, distinctly perceiving the Five Viscera.",
      "overlap_context": "Terrace, Yin Essence, Celestial Rotation Hun Spirit, Supreme Jade Lord.\"*\n\nCall seven times, then invoke again:\n\n*\"May I be absolved of all yin sins and yin transgressions from my seven generations down to my present self, dissolving them entirely. May the Six *Qi* be full, the Four Spirits at ease. May I fly through the Seven Primes, my name inscribed in the Jade Book, ascend to the Purple Clarity, ride the dark chariot of the void, move with auspicious correctness, and harmonize with heaven.\"*",
      "start_char": 5589,
      "end_char": 6810,
      "start_sentence": 214,
      "end_sentence": 246,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.247530937194824,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清紫精君皇初紫灵道君洞房上经.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "阳日存星入左目，阴日存入右目瞳。 行事存思，皆当闭临两目。 六甲日，夜半生气之时，於寝室床，卧坐首向随意也，握固而闭气定神，良久，叩齿九过毕，存北斗九星，使焕明於顶上也。 令九星光芒，二星在斗柄前，光芒相映於是，乃微祝曰：第八帝星高上玉皇神八景元君、第九尊星太微玉帝君神太素七晨元君。 九过呼之，乃祝曰：愿得除某九世祖父母以来，下逮某身诸丘山水源大小罪过，名上死籍者，阴匿贼恶，伏奸藏欺，事有亿万，列在鬼帝酆山上者，死罪条例之愆，记于北上九元太极真人黑簿者，乞九元太上帝尊玉玄君，皆令事事消除，飞行七道，上登玉清，洞游太无，乘景晨生，北宴八素，与日相倾，总朝真妃，摄御万灵。 毕，又存第八帝星、第九尊星，飞从斗而来下，径入我泥丸宫紫房中，使洞照泥丸，及明接一身五脏，使内外通生紫光云气，极令郁郁，仿髴念之。 毕，咽液三九过。 若六甲日与六丁日，存思相妨共者，以次重修之，每事效此，唯令全备於真法也。 於是太上回元谢罪之道毕矣。 太上藏五通之道，封于五岳之玉笥，隐回元之道於九晨之宫。 既修五通，当行回元，五通开於始，回元关於终。 故修五通者，先斋三日，乃行事於其日。 故修七元回道者，不食血腥物，於前后日不斋也。 所以不斋者，五通已斋於前。 五通者，太上之吉会日，回元者，太上之更新日也。 不知五通，不得解罪除过，不知回元隐道，不得刻简上真。 常以其日思存吉事，首谢身中罪过，所谓解脱形名者也。 不以示九宫中仙矣。 诸修洞房紫房中事，及存思九元七元者，眠初起，卧初时，及食毕，先微祝曰： 五星五通，六合紫房，回元隐道，豁落七晨，生魂者玄父，父变一成神，生魄者玄母，母化二生身，摄吾筋骨者公子，为吾精气者白元，长生久视，飞仙十天。 毕，勿令耳闻祝音。 此太上隐祝以除邪气，致精神，使人终身不厌昧也。 上清紫精君皇初紫灵道君洞房上经竟 #1小标题系据《太微帝君二十四神回元经》补。 #2此六字据《上清紫微帝君南极元君玉经宝诀》补。",
      "translated_text": "On yang days, visualize the star entering the left eye; on yin days, visualize it entering the right pupil. In all practices and meditations, keep both eyes gently closed.\n\nOn the days of the Six Jia, at the hour when generative qi arises at midnight, in your bedchamber—whether lying or sitting, with your head facing any direction—clench your fists, settle your breath, and stabilize your spirit. After a long while, knock your teeth nine times, then visualize the Nine Stars of the Northern Dipper shining brilliantly above your crown. Let the radiance of the Nine Stars extend their rays, with two stars positioned before the Dipper’s handle, their light intermingling. Then softly intone:\n\n*\"Eighth Imperial Star, Exalted Jade Sovereign, Spirit of the Eightfold Radiance Primordial Lord; Ninth Revered Star, Supreme Jade Emperor of the Grand Tenuity, Spirit of the Sevenfold Dawn Primordial Lord.\"*\n\nCall upon them nine times, then pray:\n\n*\"May all transgressions of my nine generations of ancestors and parents, down to my own self—every great and small sin committed in mountains, rivers, and water sources—be dissolved. May all names inscribed in the ledgers of the dead, all hidden evils, concealed treacheries, and deceptions—numbering in the tens of millions and recorded in the Ghostly Archives of Mount Feng—along with all capital offenses and errors listed in the Black Register of the Ninefold Primordial Perfected of the Northern Supreme, be petitioned before the Ninefold Primordial Supreme Jade Mystery Lord. May every matter be erased, allowing me to soar through the Seven Paths, ascend to the Jade Purity, roam the Great Void, ride the luminous dawn, feast in the Eightfold Simplicity of the North, rival the sun in splendor, and collectively attend the Perfected Consorts, commanding the myriad spirits.\"*\n\nWhen finished, visualize the Eighth Imperial Star and the Ninth Revered Star descending from the Dipper, flying directly into the Purple Chamber of your Mud-Pellet Palace, illuminating it thoroughly and brightening your entire body’s Five Viscera, so that inner and outer are suffused with purple cloud-qi, dense and luxuriant. Hold this vision firmly.\n\nConclude by swallowing saliva twenty-seven times.\n\nIf the days of the Six Jia and Six Ding interfere with one another in visualization, repeat the practice in sequence, ensuring each step adheres fully to the true method.\n\nHere ends the *Dao of the Supreme’s Return to the Origin and Atonement for Transgressions*.\n\nThe Supreme concealed the *Dao of the Fivefold Penetration* within the Jade Casket of the Five Peaks and hid the *Dao of Returning to the Origin* in the Palace of the Nine Dawns. The Fivefold Penetration opens the beginning, while Returning to the Origin seals the end. Thus, those who cultivate the Fivefold Penetration must first observe a three-day fast before proceeding on the appointed day. Those who practice the *Sevenfold Primordial Return Dao* must abstain from blood and meat, though no fast is required on the preceding or following days. The reason for this is that the Fivefold Penetration has already been purified beforehand. The Fivefold Penetration occurs on the Supreme’s auspicious assembly day, while Returning to the Origin marks the Supreme’s day of renewal. Without knowledge of the Fivefold Penetration, one cannot dissolve sins or erase transgressions; without knowledge of the *Hidden Dao of Returning to the Origin*, one cannot inscribe their name in the registers of the Perfected. Always on these days, reflect upon auspicious matters and first atone for the transgressions within your body—this is what is meant by *liberation from form and name*. Do not reveal these practices to the immortals of the Nine Palaces.\n\nFor all who cultivate affairs of the Purple Chamber within the Grotto Chamber, or visualize the Ninefold Primordial or Sevenfold Primordial, upon first rising from sleep, when first lying down, or after eating, softly intone:\n\n*\"Five Stars, Fivefold Penetration,\nSixfold Union, Purple Chamber,\nReturn to the Origin, Hidden Dao,\nVast and Luminous Seven Dawns.\nThe Mysterious Father generates the hun-soul,\nThe Father transforms it into the One, becoming spirit;\nThe Mysterious Mother generates the po-soul,\nThe Mother transforms it into the Two, becoming form.\nThe Duke’s Son governs my sinews and bones,\nThe White Prime governs my essence and qi.\nMay I attain long life and enduring vision,\nSoaring as an immortal through the Ten Heavens.\"*\n\nDo not let your ears hear the sound of this prayer. This is the Supreme’s *Hidden Prayer* for dispelling malevolent qi, gathering spirit-essence, and ensuring one never falls into obscurity throughout their life.\n\nHere ends the *Upper Clarity Scripture of the Purple Essence Sovereign, the August Primordial Purple Numinous Dao Lord of the Grotto Chamber*.",
      "overlap_context": "ight, my name inscribed in the Jade Great Simplicity, my vision piercing all ghostly forms, my name recorded in the Imperial Carriage, my fate equal to the Two Luminaries, soaring through the Seven Primes, and resting in the Purple Court.\"*\n\nWhen finished, visualize the Celestial Barrier Star descending from the Dipper, flying into your mouth, and entering directly into your pupils, illuminating both eyes and allowing you to see clearly within and without, distinctly perceiving the Five Viscera.",
      "start_char": 6810,
      "end_char": 7620,
      "start_sentence": 247,
      "end_sentence": 271,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.923694372177124,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清紫精君皇初紫灵道君洞房上经.txt",
        "category": "玉诀类"
      }
    }
  ]
}