{
  "source_id": "上清十一大曜灯仪",
  "source_file": "chunked_daozang\\上清十一大曜灯仪.json",
  "total_chunks": 3,
  "total_original_chars": 2763,
  "total_translated_chars": 17784,
  "total_translation_time": 93.27011609077454,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\威仪类\\上清十一大曜灯仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**The Supreme Clarity Ritual of the Eleven Great Luminaries’ Lamps**\n\n**Scripture Title:** *The Supreme Clarity Ritual of the Eleven Great Luminaries’ Lamps*. One fascicle. Base text from the *Zhengtong Daoist Canon*, *Dongzhen* Section, *Weiyi* Category.\n\n**The Ritual of the Supreme Clarity Eleven Great Luminaries’ Lamps**\n\nThe ritual proceeds according to form. The officiant [Name], with reverence and awe, prostrates, bows twice, burns incense, and respectfully memorializes:\n\nTo the Three Clarities and Supreme Saints, the Ten Poles’ Lofty Perfected, the Central Heaven’s Star Lord, the Purple Tenuity Great Emperor, the Sun Palace and Moon Mansion Star Lords, the Five Planets and Four Luminaries Star Lords, the Southern Dipper’s Six Offices Star Lords, the Northern Dipper’s Nine August Star Lords, the Circumpolar Twenty-Eight Constellations Star Lords, the Star Lords of One’s Original Destiny, the Three Officials Great Emperors, the Four Palaces’ Perfected Lords, the Five Masters and Three Ministries’ Perfected Lords, the Three Realms and Four Palaces, and the boundless host of sages—\n\nMay the sagely compassion wholly illumine and reflect [our devotion].\n\nYour servant has heard: one brilliance by day, one brilliance by night, the Three Luminaries alternate their illumination without end. Whether descending as auspice or calamity, the myriad phenomena all submit to regulation. Their revolutions divide the seasons, their closure completes the year, and they govern floods, droughts, famine, and abundance to admonish the times. Though the cinnabar cassia and white elm are separated by clouds and heavens, the stringing of pearls and union of jades never err by the slightest measure. Thus, the jade armillary sphere and balance were devised in the reigns of Yao and Shun, while bronze instruments and wooden apparatus were perfected in the eras of Han and Tang.\n\nThe great virtue of the luminous spirits and nocturnal radiance is stored in five-colored halos of felicity; the majesty of the Yang’s winding celestial assistance is manifested in their adherence to orbits and lodges, displaying their distinction. Their celestial paths are thus revealed, and their astrological correspondences perfectly aligned. The altar’s directional banners establish the proper orientation for offerings, ever marking the luminaries’ bright positions. With horizontal vision, one may observe the warp and weft [of fate]; by introspection, one examines one’s conduct and concealment. Circling through the twelve palaces, the eleven luminaries are arrayed. Who would claim the Dao is distant or near, entirely unrelated? Yet virtue summons fortune and misfortune, and no movement goes unanswered. Moreover, the unerring cycles of rise and fall, prosperity and decline, all depend on the gains, losses, rebellions, and submissions [of celestial influence]. Since all rely on their generation and completion, how dare we forget our service?\n\nNow, the sponsor [Name], having long frequented the oratory and greatly expounded the immortal teachings, looks up in hope of the spirits’ descent, brushing the dust of the mundane to descend. Respectfully presenting pure offerings, he displays his sincerity to receive their favor. Prostrating in reverence, he devoutly chants praises.\n\nWe, your servants, wholeheartedly take refuge in the Sun Palace’s Great Yang Emperor Lord and the Sun Palace’s divine immortals and spirit officials.\n\nYour servants have heard: the Great Brilliance is the ancestor of all Yang, long illuminating and activating the use of all eyes. Tracing its origin in the qi and forms, it inwardly embraces the crow and outwardly rides the dragon. Distinguishing dawn and dusk, it emerges from Fusang and enters Xiliu. Ten thousand miles share its shadow; five colors unfold its auspices. Ever mindful of the sagely and divine, we should always revere it as elder brother; alas, the common people should serve it as their sovereign.\n\nNow, the ritual master [Name], solemnly arousing his sincere heart, ventures to present these humble offerings. Reverently reciting the sacred scriptures, may they ascend to the cloudy heavens. Prostrating in reverence, he devoutly chants praises:\n\nGazing eastward to Fusang Palace,\nI prostrate and pay homage to Yu Yi.\nThe Great Yang’s penetrating brilliance—\nhow vast, what thoughts arise?\nI bow before the golden radiance,\nawaiting the celestial majesty’s appearance.\nThe Yellow Flower and Jade Maiden\ndescend to the hall at this hour.\n\nWe, your servants, wholeheartedly take refuge in the Moon Palace’s Great Yin August Lord and the Moon Palace’s divine immortals and spirit officials.\n\nYour servants have heard: the round orb adorns the heavens, its pure light tracing back to the sun. Sometimes white, sometimes black, it constantly observes the reins of the golden pivot; now waning, now waxing, how could it require the repair of the jade axe? The Pale Consort drifts ethereally, deeply hidden in her palace; the cinnabar cassia sways, jointly shading the hare and toad. Its qi is fundamentally the essence of Yin, perfectly manifesting the meaning of bright majesty; its image matches the virtue of the empress, all relying on its reflected illumination.\n\nNow, the ritual sponsor [Name], solemnly purifying the altar, gazes up at the celestial heights. Selecting companions of the Orthodox Unity, he reverently intones the esoteric hymns. Prostrating in reverence, he devoutly chants praises:\n\nLooking up to survey the eight directions,\nonly the moon nurtures Yin essence.\nWithin is the Great Plain August One,\nher lady riding a green carriage.\nRadiant splendor illumines the two poles,\nits blended brightness shining on the Three Clarities.\nDiligently seeking the supreme Dao,\nthe five colors descend to welcome.\n\nWe, your servants, wholeheartedly take refuge in the Eastern Wood Virtue’s Year Star, the Resplendent Star Lord, and the various spirit officials.\n\nYour servants have heard: ever mindful of the Wood Virtue, all look up to the Year Star. It orders the four seasons and initiates spring, arraying the five affairs to form appearances. When its advance and retreat accord with measure, treachery and deceit cease; when it is red-yellow and sinks, the year’s grains will be abundant. The lands it visits prosper and can thus be at peace. When the four borders share its color, weapons are stilled—this is truly the first of the Five Phases. The fruit resembles coiled peaches; the beast crouches with bristling mane.\n\nNow, the ritual practitioner [Name], gazing upon the tiger-belt’s image, exhausts reverence and solemnity. Chanting the hymn of the golden cord, he hopes to entreat their luminous response. Prostrating in reverence, he devoutly chants praises:\n\nThe Year Star rides the Wood Virtue,\nrevolving to shine in the eastern quarter.\nAscending the heavens, it moistens and nourishes,\nits true color gleaming with august brightness.\nSeeking blossoms, singing of vast expanse,\ncasting waters, chanting of the mushroom chambers.\nThrough the seasons, frequently praying,\none naturally obtains long-lasting blessings.\n\nWe, your servants, wholeheartedly take refuge in the Southern Fire Virtue’s Sparkling Deluder, the Enforcer Star Lord, and the various spirit officials.\n\nYour servants have heard: occupying the stern position of the Enforcer, its name records the weight of the Sparkling Deluder. Entering the Supreme Subtlety, it receives restraint; accompanying the Flame Emperor, it partakes of separation. Examining the Six Ministers, it governs the Minister of Works and concurrently the Minister of War; assisting in myriad affairs, it inwardly administers governance and outwardly commands troops. Forests of swords and halberds are jointly grasped; bows and arrows are solemnly at the ready. Horses gallop past the dew; pennants chase the flying wind.\n\nNow, the ritual practitioner [Name], reciting the true scriptures of the Three Caverns without the slightest negligence, gazing up at the hidden radiance of the Nine Heavens, dares not be irreverent. Prostrating in reverence, he devoutly chants praises:\n\nIts points sharp as dragons and phoenixes,\nits majestic light rebukes the ten directions.\n\nCrimson *Gang* illumines the midnight,\nVermilion flames blaze along the three borders.\nCrystal clarity seals the upright *qi*,\nSwords and halberds radiate martial authority.\nThe *Chanqiang* responds to vanquish the frontier,\nComets and broom stars dare to advance first.\n\nWith devoted hearts, we take refuge and submit,\nTo the Western Metal Virtue, the Great White Star of Heavenly Brightness, and all spirit officials.\nWe have heard: measuring the golden balance to gaze upon the Great White, it presides over great ministers and is styled the Supreme Duke.\nIn righteousness, it knows no flaw;\nin speech, it suffers no error.\nIt stores auspiciousness to bestow blessings—\nthe state, by its illumination, gradually prospers.\nIt suppresses violence and pacifies ferocity—\nthe army, only by emulating its pattern, attains felicity.\nEver attended by the music of the four strings,\nit observes the five-virtue birds from the side.\nConcentrating the pure essence of the vast *qi*,\nits true visage stands resplendent in luminous majesty.\n\nNow, the ritual practitioner [Name], driving his sincerity to the skies and the Milky Way, directs his thoughts to the void.\nDaring to unfold the essential and wondrous scriptures,\nhe gazes up to the clear and bright mirror.\nProstrating in reverence, he devoutly chants praises:\n\nThe Great White ascends the limpid Han,\nsoaring frost gleams on pristine blossoms.\nLofty, it floats with auspicious radiance,\nbrilliant, it magnifies the Long-Lived Star.\nIts blade, high, can repel invaders;\nits hue, lustrous, often brings down armies.\nExhaustively it accords with the celestial reckoning,\nuniting with the Dao and long life.\n\nWith devoted hearts, we take refuge and submit,\nTo the Northern Water Virtue, the Morning-Attending Star and the Dawn Star, and all spirit officials.\nWe have heard: humbly called the \"Morning Star,\"\nits flourishing virtue is wisdom.\nIn small matters, it verifies punishments and laws;\nin great matters, it examines yin and yang.\nDistantly, it governs the barbarians,\noften divining omens north of the Celestial Street.\nNearly, it equals the prime minister,\nfittingly aiding the sovereign in the temple of state.\nIts sequence belongs to severe congealment,\nits *qi* clarifies the execution of punishments.\nStanding as a wooden monkey holding an inkstone,\nit wields a white scroll to draw forth the brush.\n\nNow, the ritual practitioner [Name], stretching afar toward the pearl-strewn celestial path,\nimagines the whirlwind chariot racing the simurgh.\nUnfolding the jade tablets,\nhe declares the subtle mysteries of the cloud-script.\nProstrating in reverence, he devoutly chants praises:\n\nWondrous! It accords with the five *qi*,\nfaintly visible is the true gate.\nTowering in the *Chou* position,\nthe *Ren* and *Gui* spirits of the profound.\nIts divided radiance congeals in purity,\n[...] hastens to thought and recollection.\nWith immortal songs and dances,\nfor a long while, it descends from the golden heavens.\n\nWith devoted hearts, we take refuge and submit,\nTo the Central Earth Virtue, the Earth-Guarding and Saturn Star, and all spirit officials.\nWe have heard: its position is centered in the middle,\nits season corresponds to long summer.\nBenevolence, righteousness, propriety, and wisdom are governed by trust—\nonly thus may success be hoped for.\nSight, hearing, speech, and appearance are rectified in the heart—\nonly thus may one avoid straying onto other paths.\nFlourishing is the virtue of the Yellow Emperor—\nit is the star of the Son of Heaven.\nGirded with a sword and riding an ox,\nstaff and seal in hand,\nwherever it resides, it brings down good fortune.\n\nNow, the ritual practitioner [Name], reciting the azure talismanic scriptures,\nfar-flung on the cloud paths,\nprays for the descent of the verdant tassels of authority,\nto alight upon the dusty world.\nProstrating in reverence, he devoutly chants praises:\n\nThe high vault accords with *Wu* and *Ji*,\nthe hidden land rises through layered skies.\nThe Five Phases honor its obscure brilliance,\nthe Nine Lands behold its luminous dawn.\nGan and Shi discern its stations and retrogressions,\nTaoist and shaman calculate its profound depths.\nThe perfected immortals bestow rain and dew—\nprostrate on the earth, we reverently worship from afar.\n\nWith devoted hearts, we take refuge and submit,\nTo the Intercalary Beginning Star, the Net-Hidden Brilliance Star, and all spirit officials.\nWe have heard: truly, the star of the divine head,\nit scatters the odes of \"Yun Si.\"\nStyled as noble authority and wielding power,\nit follows the dark path to conceal its light.\nCrowned with the majesty of the morning asterisms,\nnone dare insult it;\ncharged with the eclipses of the sun and moon,\nwho could say it is not so?\nIts body rides a flying dragon,\nits hand holds a precious sword.\nEver divining the new and dark moons,\nit may dispel calamities and misfortunes.\n\nNow, the ritual practitioner [Name], reverently upholding its majestic countenance,\ndares to present humble offerings;\ndevoutly declaring the hidden verses,\nmay they ascend to be heard.\nProstrating in reverence, he devoutly chants praises:\n\nThe divine head follows the dark path,\nmysteriously transcending to supreme numen.\nDark and bright, it awaits the new and full moons,\nthe yang power obscures the yin essence.\nLoftily it guards the Yellow Banner Gate,\nits spear and halberd gleam with frost and bells.\nWith devoted heart, we await abundant blessings—\nprostrating, we recite the true scriptures.\n\nWith devoted hearts, we take refuge and submit,\nTo the Intercalary End, the Divine Tail, the Falling Star, and the *Jidu* Star, and all spirit officials.\nWe have heard: reckoning the intercalary end in the jade calendar,\nimagining the hidden brilliance along the pearl-strewn path.\nWhen its awe is unavailing,\nit glares and wields the three-foot blade;\nmartial and mighty,\nit rides the *neng* and stands above the nine heavens.\nTruly, the authority of the divine head and divine tail,\njointly governs the transformations of cultivating virtue and executing punishments.\nIn anger, it shatters mountains and peaks,\nmonstrous dragons and serpents emerge.\nIf its thoughts are moved by sincerity,\nit must turn misfortune into fortune.\n\nNow, the ritual practitioner [Name], unfurling the cloud-phoenix’s brocade,\nsolemnly chants the numinous scriptures;\npraying for the descent of the luminous celestial wheel,\nto alight upon the ritual mat.\nProstrating in reverence, he devoutly chants praises:\n\nDwelling in darkness, it manifests yin virtue,\nthe leopard tail guards the star palace.\nIn wrath, it points to shatter mountains and peaks,\nits authority, fierce, darkens the vast sky.\nDragons and serpents assume monstrous forms,\nominous changes suddenly obscure the gloom.\nThe master enjoys long life and joy—\nthe exorcism responds to reverent devotion.\n\nWith devoted hearts, we take refuge and submit,\nTo the Celestial One, the Purple *Qi* Dao Brilliance Star, and all spirit officials.\nWe have heard: the star of the Celestial One’s Dao,\nit receives the surplus *qi* of the Wood Virtue.\nIts crown rises in carved jade,\ngazing up, its countenance is solemn and majestic;\nits robes trail in flying rosy clouds,\nfrom afar, one imagines the tinkling of its pendants.\nSerene and detached,\nit stands aloof and solitary.\nAt ease, it is composed and expansive—\nit ensures the fulfillment of many leisurely pursuits;\nauspicious and tranquil,\nin facing peril, it naturally escapes from distress and danger.\n\nNow, the ritual practitioner [Name], offering fragrant incense with reverence,\nhumbly exhausts his earnest sincerity.\nUnfolding and declaring the flowery scriptures,\nmay they ascend to the layered skies.\nProstrating in reverence, he devoutly chants praises:\n\nBestowed authority by the Primordial Sovereign,\nit contains essence and shines in the Purple Tenuity.\nAlternating yin and yang at the extremity of their course,\nthe subtle mechanisms of the hidden and manifest are concealed.\nIts jade chariot ascends the vast Han,\nits golden bells pace the Dipper’s flight.\nThe four asterisms follow the celestial cycles,\nthe nine lands honor the heavenly might.\n\nWith devoted hearts, we take refuge and submit,\nTo the Great One, the Moon Comet, and the Broom Star, and all spirit officials.\nWe have heard: tracing the origin of the Great One’s star,\nit is endowed with the *qi* of the night’s brilliance.\n\nThough it traverses the dark paths yet remains measurable,\nit dwells among the yin luminaries yet knows no fullness.\nSolemn in cap and robes adorning the body,\nawaiting the dawn’s audience in proper attire;\nawe-inspiring with axes and halberds in hand,\nas though wielding the authority of a great general.\nWhen it transgresses, calamity arises,\nyet when it moves with singular purpose, blessings descend.\nThus it is fitting to offer expiation and gratitude—\nhow could reverence ever be exhausted?\n\nNow the officiant, so-and-so, presents these humble offerings,\nhis sincerity utterly poured forth,\nas he looks up to entreat the swift chariot,\nand devoutly recites the sacred verses.\nProstrating in reverence, he devoutly chants praises:\n\nThe Great Yin’s radiance weaves jade,\nits essence and spirit nurtures all living beings.\nGreen osmanthus and yellow blossoms attend,\nlush and misty, they guard the pure spirits.\nIts comet head divides into wondrous forms,\nits tail may secretly traverse the heavens.\nFrom its station it dispenses fortune and misfortune—\nthrough purification rites, it penetrates the profound and obscure.\n\nReciting the scriptures, dedication is made:\n*To the Upper Clarity’s Eleven Great Luminaries Lamp Rite.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清十一大曜灯仪 经名：上清十一大曜灯仪。 一卷。 底本出处：《正统道藏》洞真部威仪类。 上清十一大曜灯仪 法事如式 具位某诚惶诚恐，稽首顿首，再拜焚香，上奏：三清上圣，十极高真，中天星主紫微大帝，日宫月府星君，五星四曜星君，南斗六司星君，北斗九皇星· 君，周天二十八宿星君，本命元辰星君，三官大帝，四府真君，五师三省真君，三界四府，无鞅圣众。 恭望圣慈，一洞回昭鉴。 。 臣闻：一昱乎昼，一昱乎夜，三光。 递照於无穷； 或降之祥，或降之殃，万汇咸归於有制。 斡分至启，闭而成岁，司水旱饥穰以戒时。 丹桂白榆，虽有云霄之隔； 贯珠合璧，曾无杪忽之差。 是故璇玑玉衡，则创乎尧舜之朝； 铜仪木器，则备乎汉唐之世。 惟曜灵夜光之大德，有五色重轮以储休； 惟阳萦天佐之威严，有循轨徙舍以表异。 躔次斯显，分野允符。 坛坎奠礼神之方旗，常标着明之象所。 以横目宜观於经纬，反身自省於行藏。 循还十有二宫，列布十有一曜。 孰谓道分远迩，了不相关。 其如德召吉凶，动无弗应。 矧穷通盛衰之匪忒，皆赢缩逆顺之是繇。 既咸赖於生成，曷敢忘於奉事。 今醮主某夙趋靖馆，丕阐仙科，仰觊灵游，抚尘凡而来下； 恭陈净供，昭悃愊以居歆。 稽首归依，虔诚赞咏。 臣众等志心皈命，日宫太阳帝君，日宫神仙诸灵官。 臣闻：大明为众阳之宗，久照启群目之用。 推原气象，内抱乌而外驾龙； 判立晨昏，出榑桑而入细柳。 万里同晷，五色开祥。 永惟圣神，尚每严於兄事； 嗟尔士庶，宜若奉於君临。 今醮官某肃启诚心，辄敢陈乎菲荐； 虔宣蕊笈，庶上彻於丛霄。 稽首皈依，虔诚赞咏： 东望榑桑宫，稽首朝郁仪。 太阳洞明景，寥寥何所思。 令我拜金色，候天望英姿。 黄华将玉女，临轩降此时。 臣众等志心皈命，月宫太阴皇君，月宫神仙诸灵官。 臣闻：圆魄丽天，清光遡日。 或白或黑，常观纵辔於金枢； 乍缺乍盈，讵假修轮於玉斧。 素娥缥缈而深隐宫殿，丹桂婆娑而兼覆兔蟾。 气本阴精，允着明威之义； 象侔后德，咸依委照之功。 今醮主某载肃兰场，仰瞻霄堮。 爰选正一之侣，恭扬隐秘之章。 稽首归依，虔诚赞咏： 仰望顾八表，惟月孕阴精。 中有太素皇，夫人驾绿軿。 耀华光二极，混明照三清。 殷懃求至道，五色下来迎。 臣众等志心皈命，东方木德岁星重华星君，诸灵官。 臣闻：永惟木德，咸仰岁星。 序四时而发春，陈五事而为貌。 进退如度，则奸邪息； 赤黄而沉，则年谷丰。 所临国昌，乃能安乎。 四境同色，兵偃兹实，首於五行。 果玩蟠桃，兽蹲刚鬣。 今醮士某瞻虎带之象，惟罄肃恭； 咏金绳之章，庶祈昭格。 稽首归依，虔诚赞咏： 岁星乘木德，展转耀东乡。 凌天滋润泽，正色晃明皇。 寻华歌浩漾，掷水咏芝房。 经时频祷祝，获福自然长。 臣众等志心皈命南方火德荧惑执法星君，诸灵官。 臣闻：位居执法之严，名记荧惑之重。 入太微而受制，参炎帝以乘离。 稽考六卿，主司空而兼司马； 赞襄万务，内理政而外理兵。 森剑戟之兼持，俨弧矢之在御。 马逾露逝，旒逐风飞。 今醮士某三洞之真文，曾无少懈； 仰九天之隐耀，敢有弗恭。 稽首归依，虔诚赞咏： 芒角森龙凤，威光叱十方。",
      "translated_text": "**The Supreme Clarity Ritual of the Eleven Great Luminaries’ Lamps**\n\n**Scripture Title:** *The Supreme Clarity Ritual of the Eleven Great Luminaries’ Lamps*. One fascicle. Base text from the *Zhengtong Daoist Canon*, *Dongzhen* Section, *Weiyi* Category.\n\n**The Ritual of the Supreme Clarity Eleven Great Luminaries’ Lamps**\n\nThe ritual proceeds according to form. The officiant [Name], with reverence and awe, prostrates, bows twice, burns incense, and respectfully memorializes:\n\nTo the Three Clarities and Supreme Saints, the Ten Poles’ Lofty Perfected, the Central Heaven’s Star Lord, the Purple Tenuity Great Emperor, the Sun Palace and Moon Mansion Star Lords, the Five Planets and Four Luminaries Star Lords, the Southern Dipper’s Six Offices Star Lords, the Northern Dipper’s Nine August Star Lords, the Circumpolar Twenty-Eight Constellations Star Lords, the Star Lords of One’s Original Destiny, the Three Officials Great Emperors, the Four Palaces’ Perfected Lords, the Five Masters and Three Ministries’ Perfected Lords, the Three Realms and Four Palaces, and the boundless host of sages—\n\nMay the sagely compassion wholly illumine and reflect [our devotion].\n\nYour servant has heard: one brilliance by day, one brilliance by night, the Three Luminaries alternate their illumination without end. Whether descending as auspice or calamity, the myriad phenomena all submit to regulation. Their revolutions divide the seasons, their closure completes the year, and they govern floods, droughts, famine, and abundance to admonish the times. Though the cinnabar cassia and white elm are separated by clouds and heavens, the stringing of pearls and union of jades never err by the slightest measure. Thus, the jade armillary sphere and balance were devised in the reigns of Yao and Shun, while bronze instruments and wooden apparatus were perfected in the eras of Han and Tang.\n\nThe great virtue of the luminous spirits and nocturnal radiance is stored in five-colored halos of felicity; the majesty of the Yang’s winding celestial assistance is manifested in their adherence to orbits and lodges, displaying their distinction. Their celestial paths are thus revealed, and their astrological correspondences perfectly aligned. The altar’s directional banners establish the proper orientation for offerings, ever marking the luminaries’ bright positions. With horizontal vision, one may observe the warp and weft [of fate]; by introspection, one examines one’s conduct and concealment. Circling through the twelve palaces, the eleven luminaries are arrayed. Who would claim the Dao is distant or near, entirely unrelated? Yet virtue summons fortune and misfortune, and no movement goes unanswered. Moreover, the unerring cycles of rise and fall, prosperity and decline, all depend on the gains, losses, rebellions, and submissions [of celestial influence]. Since all rely on their generation and completion, how dare we forget our service?\n\nNow, the sponsor [Name], having long frequented the oratory and greatly expounded the immortal teachings, looks up in hope of the spirits’ descent, brushing the dust of the mundane to descend. Respectfully presenting pure offerings, he displays his sincerity to receive their favor. Prostrating in reverence, he devoutly chants praises.\n\nWe, your servants, wholeheartedly take refuge in the Sun Palace’s Great Yang Emperor Lord and the Sun Palace’s divine immortals and spirit officials.\n\nYour servants have heard: the Great Brilliance is the ancestor of all Yang, long illuminating and activating the use of all eyes. Tracing its origin in the qi and forms, it inwardly embraces the crow and outwardly rides the dragon. Distinguishing dawn and dusk, it emerges from Fusang and enters Xiliu. Ten thousand miles share its shadow; five colors unfold its auspices. Ever mindful of the sagely and divine, we should always revere it as elder brother; alas, the common people should serve it as their sovereign.\n\nNow, the ritual master [Name], solemnly arousing his sincere heart, ventures to present these humble offerings. Reverently reciting the sacred scriptures, may they ascend to the cloudy heavens. Prostrating in reverence, he devoutly chants praises:\n\nGazing eastward to Fusang Palace,\nI prostrate and pay homage to Yu Yi.\nThe Great Yang’s penetrating brilliance—\nhow vast, what thoughts arise?\nI bow before the golden radiance,\nawaiting the celestial majesty’s appearance.\nThe Yellow Flower and Jade Maiden\ndescend to the hall at this hour.\n\nWe, your servants, wholeheartedly take refuge in the Moon Palace’s Great Yin August Lord and the Moon Palace’s divine immortals and spirit officials.\n\nYour servants have heard: the round orb adorns the heavens, its pure light tracing back to the sun. Sometimes white, sometimes black, it constantly observes the reins of the golden pivot; now waning, now waxing, how could it require the repair of the jade axe? The Pale Consort drifts ethereally, deeply hidden in her palace; the cinnabar cassia sways, jointly shading the hare and toad. Its qi is fundamentally the essence of Yin, perfectly manifesting the meaning of bright majesty; its image matches the virtue of the empress, all relying on its reflected illumination.\n\nNow, the ritual sponsor [Name], solemnly purifying the altar, gazes up at the celestial heights. Selecting companions of the Orthodox Unity, he reverently intones the esoteric hymns. Prostrating in reverence, he devoutly chants praises:\n\nLooking up to survey the eight directions,\nonly the moon nurtures Yin essence.\nWithin is the Great Plain August One,\nher lady riding a green carriage.\nRadiant splendor illumines the two poles,\nits blended brightness shining on the Three Clarities.\nDiligently seeking the supreme Dao,\nthe five colors descend to welcome.\n\nWe, your servants, wholeheartedly take refuge in the Eastern Wood Virtue’s Year Star, the Resplendent Star Lord, and the various spirit officials.\n\nYour servants have heard: ever mindful of the Wood Virtue, all look up to the Year Star. It orders the four seasons and initiates spring, arraying the five affairs to form appearances. When its advance and retreat accord with measure, treachery and deceit cease; when it is red-yellow and sinks, the year’s grains will be abundant. The lands it visits prosper and can thus be at peace. When the four borders share its color, weapons are stilled—this is truly the first of the Five Phases. The fruit resembles coiled peaches; the beast crouches with bristling mane.\n\nNow, the ritual practitioner [Name], gazing upon the tiger-belt’s image, exhausts reverence and solemnity. Chanting the hymn of the golden cord, he hopes to entreat their luminous response. Prostrating in reverence, he devoutly chants praises:\n\nThe Year Star rides the Wood Virtue,\nrevolving to shine in the eastern quarter.\nAscending the heavens, it moistens and nourishes,\nits true color gleaming with august brightness.\nSeeking blossoms, singing of vast expanse,\ncasting waters, chanting of the mushroom chambers.\nThrough the seasons, frequently praying,\none naturally obtains long-lasting blessings.\n\nWe, your servants, wholeheartedly take refuge in the Southern Fire Virtue’s Sparkling Deluder, the Enforcer Star Lord, and the various spirit officials.\n\nYour servants have heard: occupying the stern position of the Enforcer, its name records the weight of the Sparkling Deluder. Entering the Supreme Subtlety, it receives restraint; accompanying the Flame Emperor, it partakes of separation. Examining the Six Ministers, it governs the Minister of Works and concurrently the Minister of War; assisting in myriad affairs, it inwardly administers governance and outwardly commands troops. Forests of swords and halberds are jointly grasped; bows and arrows are solemnly at the ready. Horses gallop past the dew; pennants chase the flying wind.\n\nNow, the ritual practitioner [Name], reciting the true scriptures of the Three Caverns without the slightest negligence, gazing up at the hidden radiance of the Nine Heavens, dares not be irreverent. Prostrating in reverence, he devoutly chants praises:\n\nIts points sharp as dragons and phoenixes,\nits majestic light rebukes the ten directions.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1260,
      "start_sentence": 0,
      "end_sentence": 83,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.81146454811096,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\上清十一大曜灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "丹罡耀午夜，朱火焰三边。 晶明符正气，剑戟焕兵权。 搀抢应灭边，孛彗敢当先。 臣众等志心皈命，西方金德太白天皓星君，诸灵官。 臣闻：测金衡而瞻太白，主大臣而号上公。 在义无亏，於言罔失。 储祥降福，国因临照以寖昌； 禁暴夷凶，师必法象而后吉。 常御四弦之乐，旁观五德之禽。 专浩气之清英，俨真容之光丽。 今醮士某驰诚霄汉，注想虚无，敢披要妙之文，仰格清明之鉴。 稽首归依，虔诚赞咏： 太白凌清汉，腾霜耀素英。 亭亭浮瑞彩，皎皎盛长庚。 锋高能御寇，色润每降兵。 推穷符历数，合道与长生。 臣众等志心皈命，北方水德辰星伺晨星君，诸灵官。 臣闻：微称曰辰，盛德为智。 小则验夫刑法，大则考诸阴阳。 远主蛮夷，每占象於天街之北； 近侔辅相，宜赞元於嵓庙之中。 序属严凝，气明杀伐。 立木猴而捧砚，执素卷以抽毫。 今醮士某遥跂珠躔，想飙轮之驰鸯； 肆陈玉册，宣云籀之幽微。 稽首归依，虔诚赞咏： 妙哉符五炁，仿髴见真门。 嵯峨当丑位，壬癸洞灵君。 分辉凝皎洁，□蠁赴思存。 仙歌将舞蹈，良久下金天。 臣众等志心皈命，中央土德地候镇星真君，诸灵官。 臣闻：位正中央，时当长夏。 仁义礼智主乎信，斯有望於成功； 视听言貌正于心，乃不入於他道。 茂着黄帝之德，是为天子之星。 带剑伏牛，杖锡持印，所居关柝，能降吉祥。 今醮士某敷碧篆之文，远飘云路； 祈望翠蕤之仗，俯降尘寰。 稽首归依，虔诚赞咏： 高穹符戊己，藏陆起重霄。 五行尊暗曜，九土见光朝。 甘石推留伏，陶巫算沉寥。 上仙垂雨露，伏地礼空遥。 臣众等志心皈命，交初建星罗隐曜星君，诸灵官。 臣闻：允惟神首之星，爰播聿斯之咏。 号贵权而操势，循黑道以韬光。 冠晨宿之威棱，亦莫余而敢侮； 掌日月之薄蚀，其谁曰而不然。 身御飞龙，手持宝剑，常占测乎晦朔，庶消弭乎灾殃。 今醮士某恪奉威容，辄敢陈乎菲荐； 虔宣隐韵，庶上彻於聪闻。 稽首归依，虔诚赞咏： 神首循黑道，冥冥超至灵。 暗明期朔望，阳德晦阴精。 高镇黄旛阙，矛戟耀霜铃。 志心俟多福，稽首诵真经。 臣众等志心皈命，交终神尾坠星计都星君，诸灵官。 臣闻：推交终於玉历，想隐曜於珠躔。 爱罔克威，瞋目而仗三尺； 武且有力，乘能而立九垓。 允惟神首神尾之权，共掌修德修刑之变。 怒摧山岳，怪出龙蛇。 思能动之在诚，必转祸以为福。 今醮士某启云凤之韫，只咏灵文； 祈景霄之轮，下临法席。 稽首归依，虔诚赞咏： 处暗表阴德，豹尾镇星宫。 怒指摧山岳，权凶瞑太空。 龙蛇生怪状，变异忽昏蒙。 主人长寿乐，禳应在恪恭。 臣众等志心皈命，天一紫炁道曜星君，诸灵官。 臣闻：惟天一之道星，禀木德之余氧。 冠耸琱玉，仰瞻穆穆之容； 服曳飞霞，遥想锵锵之佩。 悠然冲淡，卓尔孤高。 燕居申申，主张多遂於闲适； 吉祥止止，临难自脱於迍危。 今醮士某祇荐馨香，俯殚恳款，肆披宣於蕊笈，庶上彻於丛霄。 稽首归依，虔诚赞咏： 授制宗元帝，含精耀紫微。 除阳乘运极，幽显閟灵机。 玉舆登广汉，金铃步斗飞。 四宿循周度，九土尊天威。 臣众等志心皈命，太一月孛彗星星君，诸灵官。 臣闻：切原太一之星，盖禀夜光之炁。",
      "translated_text": "Crimson *Gang* illumines the midnight,\nVermilion flames blaze along the three borders.\nCrystal clarity seals the upright *qi*,\nSwords and halberds radiate martial authority.\nThe *Chanqiang* responds to vanquish the frontier,\nComets and broom stars dare to advance first.\n\nWith devoted hearts, we take refuge and submit,\nTo the Western Metal Virtue, the Great White Star of Heavenly Brightness, and all spirit officials.\nWe have heard: measuring the golden balance to gaze upon the Great White, it presides over great ministers and is styled the Supreme Duke.\nIn righteousness, it knows no flaw;\nin speech, it suffers no error.\nIt stores auspiciousness to bestow blessings—\nthe state, by its illumination, gradually prospers.\nIt suppresses violence and pacifies ferocity—\nthe army, only by emulating its pattern, attains felicity.\nEver attended by the music of the four strings,\nit observes the five-virtue birds from the side.\nConcentrating the pure essence of the vast *qi*,\nits true visage stands resplendent in luminous majesty.\n\nNow, the ritual practitioner [Name], driving his sincerity to the skies and the Milky Way, directs his thoughts to the void.\nDaring to unfold the essential and wondrous scriptures,\nhe gazes up to the clear and bright mirror.\nProstrating in reverence, he devoutly chants praises:\n\nThe Great White ascends the limpid Han,\nsoaring frost gleams on pristine blossoms.\nLofty, it floats with auspicious radiance,\nbrilliant, it magnifies the Long-Lived Star.\nIts blade, high, can repel invaders;\nits hue, lustrous, often brings down armies.\nExhaustively it accords with the celestial reckoning,\nuniting with the Dao and long life.\n\nWith devoted hearts, we take refuge and submit,\nTo the Northern Water Virtue, the Morning-Attending Star and the Dawn Star, and all spirit officials.\nWe have heard: humbly called the \"Morning Star,\"\nits flourishing virtue is wisdom.\nIn small matters, it verifies punishments and laws;\nin great matters, it examines yin and yang.\nDistantly, it governs the barbarians,\noften divining omens north of the Celestial Street.\nNearly, it equals the prime minister,\nfittingly aiding the sovereign in the temple of state.\nIts sequence belongs to severe congealment,\nits *qi* clarifies the execution of punishments.\nStanding as a wooden monkey holding an inkstone,\nit wields a white scroll to draw forth the brush.\n\nNow, the ritual practitioner [Name], stretching afar toward the pearl-strewn celestial path,\nimagines the whirlwind chariot racing the simurgh.\nUnfolding the jade tablets,\nhe declares the subtle mysteries of the cloud-script.\nProstrating in reverence, he devoutly chants praises:\n\nWondrous! It accords with the five *qi*,\nfaintly visible is the true gate.\nTowering in the *Chou* position,\nthe *Ren* and *Gui* spirits of the profound.\nIts divided radiance congeals in purity,\n[...] hastens to thought and recollection.\nWith immortal songs and dances,\nfor a long while, it descends from the golden heavens.\n\nWith devoted hearts, we take refuge and submit,\nTo the Central Earth Virtue, the Earth-Guarding and Saturn Star, and all spirit officials.\nWe have heard: its position is centered in the middle,\nits season corresponds to long summer.\nBenevolence, righteousness, propriety, and wisdom are governed by trust—\nonly thus may success be hoped for.\nSight, hearing, speech, and appearance are rectified in the heart—\nonly thus may one avoid straying onto other paths.\nFlourishing is the virtue of the Yellow Emperor—\nit is the star of the Son of Heaven.\nGirded with a sword and riding an ox,\nstaff and seal in hand,\nwherever it resides, it brings down good fortune.\n\nNow, the ritual practitioner [Name], reciting the azure talismanic scriptures,\nfar-flung on the cloud paths,\nprays for the descent of the verdant tassels of authority,\nto alight upon the dusty world.\nProstrating in reverence, he devoutly chants praises:\n\nThe high vault accords with *Wu* and *Ji*,\nthe hidden land rises through layered skies.\nThe Five Phases honor its obscure brilliance,\nthe Nine Lands behold its luminous dawn.\nGan and Shi discern its stations and retrogressions,\nTaoist and shaman calculate its profound depths.\nThe perfected immortals bestow rain and dew—\nprostrate on the earth, we reverently worship from afar.\n\nWith devoted hearts, we take refuge and submit,\nTo the Intercalary Beginning Star, the Net-Hidden Brilliance Star, and all spirit officials.\nWe have heard: truly, the star of the divine head,\nit scatters the odes of \"Yun Si.\"\nStyled as noble authority and wielding power,\nit follows the dark path to conceal its light.\nCrowned with the majesty of the morning asterisms,\nnone dare insult it;\ncharged with the eclipses of the sun and moon,\nwho could say it is not so?\nIts body rides a flying dragon,\nits hand holds a precious sword.\nEver divining the new and dark moons,\nit may dispel calamities and misfortunes.\n\nNow, the ritual practitioner [Name], reverently upholding its majestic countenance,\ndares to present humble offerings;\ndevoutly declaring the hidden verses,\nmay they ascend to be heard.\nProstrating in reverence, he devoutly chants praises:\n\nThe divine head follows the dark path,\nmysteriously transcending to supreme numen.\nDark and bright, it awaits the new and full moons,\nthe yang power obscures the yin essence.\nLoftily it guards the Yellow Banner Gate,\nits spear and halberd gleam with frost and bells.\nWith devoted heart, we await abundant blessings—\nprostrating, we recite the true scriptures.\n\nWith devoted hearts, we take refuge and submit,\nTo the Intercalary End, the Divine Tail, the Falling Star, and the *Jidu* Star, and all spirit officials.\nWe have heard: reckoning the intercalary end in the jade calendar,\nimagining the hidden brilliance along the pearl-strewn path.\nWhen its awe is unavailing,\nit glares and wields the three-foot blade;\nmartial and mighty,\nit rides the *neng* and stands above the nine heavens.\nTruly, the authority of the divine head and divine tail,\njointly governs the transformations of cultivating virtue and executing punishments.\nIn anger, it shatters mountains and peaks,\nmonstrous dragons and serpents emerge.\nIf its thoughts are moved by sincerity,\nit must turn misfortune into fortune.\n\nNow, the ritual practitioner [Name], unfurling the cloud-phoenix’s brocade,\nsolemnly chants the numinous scriptures;\npraying for the descent of the luminous celestial wheel,\nto alight upon the ritual mat.\nProstrating in reverence, he devoutly chants praises:\n\nDwelling in darkness, it manifests yin virtue,\nthe leopard tail guards the star palace.\nIn wrath, it points to shatter mountains and peaks,\nits authority, fierce, darkens the vast sky.\nDragons and serpents assume monstrous forms,\nominous changes suddenly obscure the gloom.\nThe master enjoys long life and joy—\nthe exorcism responds to reverent devotion.\n\nWith devoted hearts, we take refuge and submit,\nTo the Celestial One, the Purple *Qi* Dao Brilliance Star, and all spirit officials.\nWe have heard: the star of the Celestial One’s Dao,\nit receives the surplus *qi* of the Wood Virtue.\nIts crown rises in carved jade,\ngazing up, its countenance is solemn and majestic;\nits robes trail in flying rosy clouds,\nfrom afar, one imagines the tinkling of its pendants.\nSerene and detached,\nit stands aloof and solitary.\nAt ease, it is composed and expansive—\nit ensures the fulfillment of many leisurely pursuits;\nauspicious and tranquil,\nin facing peril, it naturally escapes from distress and danger.\n\nNow, the ritual practitioner [Name], offering fragrant incense with reverence,\nhumbly exhausts his earnest sincerity.\nUnfolding and declaring the flowery scriptures,\nmay they ascend to the layered skies.\nProstrating in reverence, he devoutly chants praises:\n\nBestowed authority by the Primordial Sovereign,\nit contains essence and shines in the Purple Tenuity.\nAlternating yin and yang at the extremity of their course,\nthe subtle mechanisms of the hidden and manifest are concealed.\nIts jade chariot ascends the vast Han,\nits golden bells pace the Dipper’s flight.\nThe four asterisms follow the celestial cycles,\nthe nine lands honor the heavenly might.\n\nWith devoted hearts, we take refuge and submit,\nTo the Great One, the Moon Comet, and the Broom Star, and all spirit officials.\nWe have heard: tracing the origin of the Great One’s star,\nit is endowed with the *qi* of the night’s brilliance.",
      "overlap_context": "Forests of swords and halberds are jointly grasped; bows and arrows are solemnly at the ready. Horses gallop past the dew; pennants chase the flying wind.\n\nNow, the ritual practitioner [Name], reciting the true scriptures of the Three Caverns without the slightest negligence, gazing up at the hidden radiance of the Nine Heavens, dares not be irreverent. Prostrating in reverence, he devoutly chants praises:\n\nIts points sharp as dragons and phoenixes,\nits majestic light rebukes the ten directions.",
      "start_char": 1260,
      "end_char": 2526,
      "start_sentence": 84,
      "end_sentence": 168,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.88547682762146,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\上清十一大曜灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "虽历黑道而可测，然居阴曜而不盈。 俨冠服之饰躬，待将趋昕朝之着； 凛鈇钺之在手，又若拥大将之权。 或凌犯以兴灾，唯特达而降福。 是宜禳谢，曷罄肃恭。 今醮士某荐献甚微，精诚斯罄，将仰祈乎飙驭，乃恭诵於灵章。 稽首归依，虔诚赞咏： 太阴光玉纬，精魄育群生。 青桂黄华辅，郁罗保素灵。 毛头分怪状，彗尾或潜经。 舍次流灾福，斋修洞杳冥。 讽经　回向 上清十一大曜灯仪",
      "translated_text": "Though it traverses the dark paths yet remains measurable,\nit dwells among the yin luminaries yet knows no fullness.\nSolemn in cap and robes adorning the body,\nawaiting the dawn’s audience in proper attire;\nawe-inspiring with axes and halberds in hand,\nas though wielding the authority of a great general.\nWhen it transgresses, calamity arises,\nyet when it moves with singular purpose, blessings descend.\nThus it is fitting to offer expiation and gratitude—\nhow could reverence ever be exhausted?\n\nNow the officiant, so-and-so, presents these humble offerings,\nhis sincerity utterly poured forth,\nas he looks up to entreat the swift chariot,\nand devoutly recites the sacred verses.\nProstrating in reverence, he devoutly chants praises:\n\nThe Great Yin’s radiance weaves jade,\nits essence and spirit nurtures all living beings.\nGreen osmanthus and yellow blossoms attend,\nlush and misty, they guard the pure spirits.\nIts comet head divides into wondrous forms,\nits tail may secretly traverse the heavens.\nFrom its station it dispenses fortune and misfortune—\nthrough purification rites, it penetrates the profound and obscure.\n\nReciting the scriptures, dedication is made:\n*To the Upper Clarity’s Eleven Great Luminaries Lamp Rite.*",
      "overlap_context": "emity of their course,\nthe subtle mechanisms of the hidden and manifest are concealed.\nIts jade chariot ascends the vast Han,\nits golden bells pace the Dipper’s flight.\nThe four asterisms follow the celestial cycles,\nthe nine lands honor the heavenly might.\n\nWith devoted hearts, we take refuge and submit,\nTo the Great One, the Moon Comet, and the Broom Star, and all spirit officials.\nWe have heard: tracing the origin of the Great One’s star,\nit is endowed with the *qi* of the night’s brilliance.",
      "start_char": 2526,
      "end_char": 2705,
      "start_sentence": 169,
      "end_sentence": 181,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.573174715042114,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\上清十一大曜灯仪.txt",
        "category": "威仪类"
      }
    }
  ]
}