{
  "source_id": "上清化形隐景登升保仙上经",
  "source_file": "chunked_daozang\\上清化形隐景登升保仙上经.json",
  "total_chunks": 2,
  "total_original_chars": 1715,
  "total_translated_chars": 11253,
  "total_translation_time": 57.11190056800842,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\上清化形隐景登升保仙上经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Clarity Scripture on Transforming Form, Concealing Radiance, Ascending, and Preserving Immortality**\n\n*The Scripture of Supreme Clarity on Transforming Form, Concealing Radiance, Ascending, and Preserving Immortality* is of uncertain authorship, likely composed during the Northern and Southern Dynasties. It expounds methods for spirit-preservation, form-concealment, and flight to immortality. One scroll.\n\n**From:** *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n---\n\n**The Supreme Clarity Scripture on Transforming Form, Concealing Radiance, Ascending, and Preserving Immortality**\n\nThe Central Yellow Venerable Lord received from the Heavenly Emperor of the Grand Tenuity the *Scripture of Supreme Clarity on Transforming Form, Concealing Radiance, and Ascending to the Jade Clarity*, wherein one preserves the Eight Radiant Forms to animate the body, contemplates the Five Clouds to elevate the form, commands the Purple Transcendence to summon the void, and wields the Blazing Light to invoke the numinous. One reverses the Three Mornings to infuse the mysterious, draws the primordial essence of the Seven Stars, establishes the Moon Mechanism within the chamber, and accumulates spiritual resonance in the silent courtyard.\n\nSince the golden scriptures of the Eastern Florescence and the mysterious registers of jade names were bestowed, none have been permitted to unfold and behold the chapters of the Supreme Thearch.\n\nFor all who cultivate the Dao of concealing radiance: on each of the Eight Seasonal Festivals, when the Eight Thearchs convene in celestial assembly, bathe in orchid incense, purify the secluded chamber, enter the room in stillness, and sit in meditation. With eyes closed, visualize and contemplate the Azure Thearch of the Subtle and Vast, whose name is recorded as Fengzi. He wears the Golden Flower of the Great Mystery and the True Crown, dons a cloud-luminous brocade robe, and bears the Nine Brilliances’ Radiant Yang Rosy Dawn Talisman. He rides the Eight Simplicities’ Purple Cloud Chariot of One Radiance, bestowing upon me the Nine Brilliances’ Great Morning Concealment Talisman. As cloud qi envelops my crown, my body senses ascent with the radiance. Strike the teeth twenty-four times and swallow qi eight times to conclude.\n\nNext, visualize the Vermilion Thearch of the Central Subtle, whose taboo name is Ding Guangyan. He wears the Two Simplicities’ Treasure Unity Crown, a cloud-luminous brocade robe, and the Four Brightnesses’ Vermilion and Azure Talisman of the Primordial Morning. He rides the Seven Simplicities’ Crimson Cloud Chariot of Two Radiance, bestowing upon me the Cloud-Observing Primordial Morning Concealment Talisman. As cloud qi envelops my crown, my body senses ascent with the radiance. Strike the teeth nine times and swallow qi nine times to conclude.\n\nNext, visualize the White Thearch of the Purple Tenuity, whose taboo name is Liang Yuanshi. He wears the Hibiscus Crown, a dark numinous brocade robe, and the Comprehensive Morning’s Luminous Support Talisman. He rides the Six Simplicities’ Red Cloud Chariot of Three Radiance, bestowing upon me the Comprehensive Morning’s Nine Ultimates Concealment Talisman. As cloud qi envelops my crown, my body senses ascent with the radiance. Strike the teeth eleven times and swallow qi six times to conclude.\n\nNext, visualize the Black Thearch of the Mysterious Subtle, whose taboo name is Qi Yuanxuan. He wears the Nine Primordials’ Guest Crown, a dark cloud brocade robe, and the Overlapping Brilliance’s Numinous Flute Phoenix Talisman. He rides the Five Simplicities’ Azure Cloud Chariot of Four Radiance, bestowing upon me the Overlapping Brilliance’s Rotating Root Concealment Talisman. As cloud qi envelops my crown, my body senses ascent with the radiance. Strike the teeth nine times and swallow qi five times to conclude.\n\nNext, visualize the Supreme Thearch of the Origin Subtle, whose taboo name is Jiekongzi. He wears the Mysterious Light Guest Crown, a cloud-luminous brocade robe, and the Mysterious Radiance’s Central Primordial Eight Directions Jade Gate Talisman. He rides the Four Simplicities’ Yellow Cloud Chariot of Five Radiance, bestowing upon me the Mysterious Radiance’s Morning Equilibrium Concealment Talisman. As cloud qi envelops my crown, my body senses ascent with the radiance. Strike the teeth twelve times and swallow qi four times to conclude.\n\nNext, visualize the Central Thearch of the Numinous Subtle, whose taboo name is Kang Ewu. He wears the Far-Wandering Crown, a green brocade patterned robe, and the Converging Brilliance’s Mysterious Rosy Dawn Talisman. He rides the Three Simplicities’ Green Cloud Chariot of Six Radiance, bestowing upon me the Converging Brilliance’s Morning Mandate Concealment Talisman. As cloud qi envelops my crown, my body senses ascent with the radiance. Strike the teeth twelve times and swallow qi three times to conclude.\n\nNext, visualize the Lower Thearch of the Proclaiming Subtle, whose taboo name is Hongfuzi. He wears the Three Treasures Divine Crown, a plain brocade patterned robe, and the Harmonizing Brilliance’s Preserving Luminance Talisman. He rides the Two Simplicities’ Purple Cloud Chariot of Seven Radiance, bestowing upon me the Harmonizing Brilliance’s Mysterious Morning Concealment Talisman. As cloud qi envelops my crown, my body senses ascent with the radiance. Strike the teeth nine times and swallow qi twice to conclude.\n\nNext, visualize the Perfected Thearch of the Cavernous Subtle, whose taboo name is Sidengshu. He wears the Flying Cloud Purple Flower Crown, a dark numinous brocade robe, and the Primordial Mandate’s Preserving Form Mysterious Brilliance Talisman. He rides the One Simplicity’s Numinous Cloud Chariot of Eight Radiance, bestowing upon me the Supreme Dragon Mist Concealment Talisman. As cloud qi envelops my crown, my body senses ascent with the radiance. Strike the teeth thirty-six times and swallow qi once to conclude.\n\nNext, visualize the Inner Thearch of the Nine Subtleties, whose taboo name is Shen Mingxian. He wears the Purple Primordial Three Treasures Crown, a dark cloud brocade robe, and the Morning Rosy Dawn’s Eight Transformations Flying Palace Talisman. He drives the Grand Rosy Dawn’s Purple Mist Cavernous Radiance Jade Chariot, coming to bestow upon me the Supreme Clarity’s Primordial Ultimate Boundless Supreme Dao Constant Concealment Talisman. With the cavernous radiance chariot, he comes to welcome my body, ascending to the Jade Clarity’s chamber.\n\nWhen all is complete, strike the teeth thirty-six times and recite the incantation:\n*\"Eight Radiant Mysterious Mist, dispersing qi in the void courtyard,\nShrouding the body in nine rosy dawns, concealing radiance in the hidden and dark.\nPrecious talismans descend mysteriously, chariots of green jade turn and revolve,\nReturning through the Nine Mornings, anchoring my form.\nAscending to the Jade Chamber, bowing in audience at the Purple Court.\"*\n\nConclude by swallowing qi thirty-six times.\n\nNext, visualize the First Star Thearch of the Dipper transforming and concealing the Peach Primordial Inner Consort, named Taiyi Fatan, styled Xing Zhengfu, wearing a yellow brocade cloak and vermilion-green flying skirt, with cloud-like tresses.\n\nThe Second Star Thearch, Preserver of the Womb and Transformer of Form Inner Concubine, named Taiyi Sanpeng, styled Luo Zhuying, wearing a green brocade cloak and green-feathered flying skirt, with cloud-like tresses.\n\nThe Third Star Thearch, Six Escapes and Seven Stars’ Upper Primordial Cinnabar Mother, named Taiyi Yunyi, styled Chong Shuangzhao, wearing a green brocade cloak and embroidered-feather patterned skirt, with cloud-like tresses.\n\nThe Fourth Star Thearch, Concealer of Radiance and Hider of Light Central Primordial Inner Consort, named Taiyi Qilie, styled Qiu Hengying, wearing a purple brocade cloak and yellow-flowered feathered skirt, with cloud-like tresses.\n\nThe Fifth Star Thearch, Transformer of Body and Changer of Radiance Dipper’s Central Great Maiden, named Taiyi Yushu, styled Chou Qiulan, wearing a vermilion brocade cloak and purple-green flying skirt, with cloud-like tresses.\n\nThe Sixth Star Thearch, Concealer of Traces and Disperser of Forms Dipper’s Central Maiden, named Taiyi Qijing, styled Baoding Ling, wearing a vermilion brocade cloak and blue-embroidered flying skirt, with cloud-like tresses.\n\nThe Seventh Star Thearch, Divider of Radiance and Shaper of Myriad Forms Dipper’s Youngest Maiden, named Taiyi Duyi, styled Tian Fanshu, wearing a cinnabar brocade cloak and blue-flowered feathered skirt, with cloud-like tresses.\n\nThe Eighth Star Thearch, Transformer of Sun and Moon, Water and Fire Dipper’s High August Left Consort, named Taiyi Shiqizhu, styled Luomaohua, wearing a purple brocade cloak and embroidered-feather flying skirt, with cloud-like tresses.\n\nThe Ninth Star Thearch, Transformer of Metal and Stone, Mountains and Rivers Dipper’s High August Right Consort, named Taiyi Aitiao, styled Yun Yuxuan, wearing a green brocade cloak and kingfisher-flowered flying skirt, with cloud-like tresses.\n\nPreserve the hidden names of the Nine Star Thearchs’ concealed consorts, their forms and colors, and their attire, all made luminously manifest. Descending from the Northern Dipper, their blazing radiance streams forth, resplendent in the void. Turning the spirit to mysterious reflection, they enter within my body, abiding in the Hall of Light and the Purple Chamber, flanked by the twin symbols of sun and moon, with the ninefold morning brilliance arrayed in order. They transform in succession into infants, the true forms of the Nine Thearchs, named the Eternal Youths. Settling within my body, both inner and outer become pervaded with clarity, their blazing radiance and mysterious reflection suffusing my frame with warmth. Then strike the teeth nine times and intone the incantation:\n\n\"Nine Mornings revolve on high,\nConcealed transformations of the Primal Quadrant.\nCavern-Heaven’s Nine Origins,\nTrue Youths within the Dipper.\nBlazing radiance and mysterious reflection,\nSpreading and suffusing the Purple Chamber.\nA thousand changes, ten thousand transformations,\nExchanging radiance, infant illumination.\nFollowing intent wherever it goes,\nEmerging from being, entering non-being.\nAttaining to ride the Eight Effulgences,\nAscending to audience with the August Thearchs.\"\n\nWhen finished, swallow the qi nine times and cease.\n\nThis is the *Upper Scripture on the Concealed Forms and Hidden Radiance of the Nine Thearchs’ Yin Transformations*, wherein the Central Yellow Venerable Lord, the Southern Vermilion Essence Lord, the Eastern Azure Youth Lord, the Northern Supreme Lord, and the Western Primordial Simplicity Lord all revolve the Nine Yin to disperse their forms, move the Nine Mornings to conceal their bodies, cast the flying wheel to ascend the void, and ride the Dark Empyrean to roam at will. Their radiance transforms myriad times, drifting with the world’s vicissitudes. Should one practice this, the Three Luminaries shall share in one’s repose.\n\nThe *Upper Scripture on Ascending and Preserving Transcendence through Concealed Forms and Hidden Radiance* from the *Highest Clarity* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清化形隐景登升保仙上经 经名：上清化形隐景登升保仙上经。 撰人不详，约出於南北朝。 言存神隐形飞仙法术。 一卷。 底本出处：《正统道藏》正一部。 上清化形隐景登升保仙上经 中央黄老君，受太微天帝君化形隐景登升玉清上经，存八景以运躯，思五云以升形，役紫度以招虚，策炎光以召灵，回三晨以玄注，引七斗之元精，立月机於寝室，积神感於寂庭。 自无金书东华，玄格玉名，莫得披看高帝之篇。 凡修隐景之道，每至八节之日，八帝游会之时也，沐浴兰香，清斋幽房，入室静坐，临目存思希微苍帝君，名录丰子，建金华太玄实冠，着云光锦袍，带九晖通光阳霞之符，乘八素紫云一景之舆，授我九辉大晨隐符，以云气覆冠我身，身觉随景而升，叩齿二十四通，咽气八过止。 次存思中微赤帝君，讳定光彦，建二素宝一之冠，着云光锦袍，带元晨四朗朱碧之符，乘七素绛云二景之舆，授我观云元晨隐符，以云气覆冠我身，身觉随景而升，个叩齿九通，咽气九过止。 次存思紫微白帝君，讳梁渊石，建芙蓉之冠，着玄灵锦袍，带总晨皓灵扶希之符，乘六素红云三景之舆，授我总晨九极隐符，以云气覆冠我身，身觉随景而升，因叩齿十一通，咽气六过止。 次存思玄微黑帝君，讳齐元旋，建九元宾冠，着玄云锦袍，带沓耀灵真箫凤之符，乘五素青云四景之舆，授我沓耀旋根隐符，以云气覆冠我身，身觉随景而升，因叩齿九通，咽气五过止。 次存思始微上帝君，讳接空子，建玄光宾冠，着云光锦袍，带玄景中元八维玉门之符，乘四素黄云五景之舆，授我玄景晨平隐符，以云气覆冠我身，身觉随景而上升，因叩齿十二通，咽气四过止。 次存思灵微中帝君，讳康厄文，建远游冠，着绿锦纹袍，带合晖玄霞之符，乘三素绿云六景之舆，授我合晖晨命隐符，以云气覆冠我身，身觉随景上升，因叩齿十二通，咽气三过止。 次存思宣微下帝君，讳宏肤子，建三宝神冠，着单锦文袍，带齐晖保曜灵之符，乘二素紫云七景之舆，授我齐晖晨玄隐符，以云气覆冠我身，身觉随景上升，因叩齿九通，咽气二过止。 次存思洞微真帝君。 讳泗登摅，建飞云紫华之冠，着玄灵锦袍，带元命保形玄晖之符，乘一素灵云八景之舆，授我高上龙烟隐符，以云气覆冠我身，身觉随景上升，叩齿三十六通，咽气一过止。 次存思九微内帝君，讳申明闲，建紫元三宝之冠，着玄云锦袍，带晨霄八变飞宫之符，驾太霞紫烟洞景玉舆，来授我高清太元无极上道常隐符，以洞景之舆来迎我身，上登玉清之房。 都毕，叩齿三十六通，祝曰： 八景玄烟，散气虚庭，蔽身九霞，隐景幽冥，宝符玄降，驾乘绿軿，回转九晨，住我身形，上登玉房，拜谒紫庭。 毕，咽气三十六过止。 次存斗第一星帝君变隐桃元内妃，名太一法坦，字幸正扶，着黄锦帔丹青飞裙，颓云髻。 第二星帝君保胎化形内嫔，名太一三瓫，字罗朱婴，着青锦帔绿羽飞裙，颓云髻。 第三星帝君六遁七星上元丹母，名太一云夷，字冲双兆，着青锦帔绣羽华裙，颓云髻。 第四星帝君匿景藏光中元内妃，名太一七烈，字丘横婴，着紫锦帔黄华羽裙，颓云髻。 第五星帝君变体易景斗中大女，名太一郁书，字畴丘兰，着朱锦帔紫青飞裙，颓云髻。",
      "translated_text": "**The Supreme Clarity Scripture on Transforming Form, Concealing Radiance, Ascending, and Preserving Immortality**\n\n*The Scripture of Supreme Clarity on Transforming Form, Concealing Radiance, Ascending, and Preserving Immortality* is of uncertain authorship, likely composed during the Northern and Southern Dynasties. It expounds methods for spirit-preservation, form-concealment, and flight to immortality. One scroll.\n\n**From:** *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n---\n\n**The Supreme Clarity Scripture on Transforming Form, Concealing Radiance, Ascending, and Preserving Immortality**\n\nThe Central Yellow Venerable Lord received from the Heavenly Emperor of the Grand Tenuity the *Scripture of Supreme Clarity on Transforming Form, Concealing Radiance, and Ascending to the Jade Clarity*, wherein one preserves the Eight Radiant Forms to animate the body, contemplates the Five Clouds to elevate the form, commands the Purple Transcendence to summon the void, and wields the Blazing Light to invoke the numinous. One reverses the Three Mornings to infuse the mysterious, draws the primordial essence of the Seven Stars, establishes the Moon Mechanism within the chamber, and accumulates spiritual resonance in the silent courtyard.\n\nSince the golden scriptures of the Eastern Florescence and the mysterious registers of jade names were bestowed, none have been permitted to unfold and behold the chapters of the Supreme Thearch.\n\nFor all who cultivate the Dao of concealing radiance: on each of the Eight Seasonal Festivals, when the Eight Thearchs convene in celestial assembly, bathe in orchid incense, purify the secluded chamber, enter the room in stillness, and sit in meditation. With eyes closed, visualize and contemplate the Azure Thearch of the Subtle and Vast, whose name is recorded as Fengzi. He wears the Golden Flower of the Great Mystery and the True Crown, dons a cloud-luminous brocade robe, and bears the Nine Brilliances’ Radiant Yang Rosy Dawn Talisman. He rides the Eight Simplicities’ Purple Cloud Chariot of One Radiance, bestowing upon me the Nine Brilliances’ Great Morning Concealment Talisman. As cloud qi envelops my crown, my body senses ascent with the radiance. Strike the teeth twenty-four times and swallow qi eight times to conclude.\n\nNext, visualize the Vermilion Thearch of the Central Subtle, whose taboo name is Ding Guangyan. He wears the Two Simplicities’ Treasure Unity Crown, a cloud-luminous brocade robe, and the Four Brightnesses’ Vermilion and Azure Talisman of the Primordial Morning. He rides the Seven Simplicities’ Crimson Cloud Chariot of Two Radiance, bestowing upon me the Cloud-Observing Primordial Morning Concealment Talisman. As cloud qi envelops my crown, my body senses ascent with the radiance. Strike the teeth nine times and swallow qi nine times to conclude.\n\nNext, visualize the White Thearch of the Purple Tenuity, whose taboo name is Liang Yuanshi. He wears the Hibiscus Crown, a dark numinous brocade robe, and the Comprehensive Morning’s Luminous Support Talisman. He rides the Six Simplicities’ Red Cloud Chariot of Three Radiance, bestowing upon me the Comprehensive Morning’s Nine Ultimates Concealment Talisman. As cloud qi envelops my crown, my body senses ascent with the radiance. Strike the teeth eleven times and swallow qi six times to conclude.\n\nNext, visualize the Black Thearch of the Mysterious Subtle, whose taboo name is Qi Yuanxuan. He wears the Nine Primordials’ Guest Crown, a dark cloud brocade robe, and the Overlapping Brilliance’s Numinous Flute Phoenix Talisman. He rides the Five Simplicities’ Azure Cloud Chariot of Four Radiance, bestowing upon me the Overlapping Brilliance’s Rotating Root Concealment Talisman. As cloud qi envelops my crown, my body senses ascent with the radiance. Strike the teeth nine times and swallow qi five times to conclude.\n\nNext, visualize the Supreme Thearch of the Origin Subtle, whose taboo name is Jiekongzi. He wears the Mysterious Light Guest Crown, a cloud-luminous brocade robe, and the Mysterious Radiance’s Central Primordial Eight Directions Jade Gate Talisman. He rides the Four Simplicities’ Yellow Cloud Chariot of Five Radiance, bestowing upon me the Mysterious Radiance’s Morning Equilibrium Concealment Talisman. As cloud qi envelops my crown, my body senses ascent with the radiance. Strike the teeth twelve times and swallow qi four times to conclude.\n\nNext, visualize the Central Thearch of the Numinous Subtle, whose taboo name is Kang Ewu. He wears the Far-Wandering Crown, a green brocade patterned robe, and the Converging Brilliance’s Mysterious Rosy Dawn Talisman. He rides the Three Simplicities’ Green Cloud Chariot of Six Radiance, bestowing upon me the Converging Brilliance’s Morning Mandate Concealment Talisman. As cloud qi envelops my crown, my body senses ascent with the radiance. Strike the teeth twelve times and swallow qi three times to conclude.\n\nNext, visualize the Lower Thearch of the Proclaiming Subtle, whose taboo name is Hongfuzi. He wears the Three Treasures Divine Crown, a plain brocade patterned robe, and the Harmonizing Brilliance’s Preserving Luminance Talisman. He rides the Two Simplicities’ Purple Cloud Chariot of Seven Radiance, bestowing upon me the Harmonizing Brilliance’s Mysterious Morning Concealment Talisman. As cloud qi envelops my crown, my body senses ascent with the radiance. Strike the teeth nine times and swallow qi twice to conclude.\n\nNext, visualize the Perfected Thearch of the Cavernous Subtle, whose taboo name is Sidengshu. He wears the Flying Cloud Purple Flower Crown, a dark numinous brocade robe, and the Primordial Mandate’s Preserving Form Mysterious Brilliance Talisman. He rides the One Simplicity’s Numinous Cloud Chariot of Eight Radiance, bestowing upon me the Supreme Dragon Mist Concealment Talisman. As cloud qi envelops my crown, my body senses ascent with the radiance. Strike the teeth thirty-six times and swallow qi once to conclude.\n\nNext, visualize the Inner Thearch of the Nine Subtleties, whose taboo name is Shen Mingxian. He wears the Purple Primordial Three Treasures Crown, a dark cloud brocade robe, and the Morning Rosy Dawn’s Eight Transformations Flying Palace Talisman. He drives the Grand Rosy Dawn’s Purple Mist Cavernous Radiance Jade Chariot, coming to bestow upon me the Supreme Clarity’s Primordial Ultimate Boundless Supreme Dao Constant Concealment Talisman. With the cavernous radiance chariot, he comes to welcome my body, ascending to the Jade Clarity’s chamber.\n\nWhen all is complete, strike the teeth thirty-six times and recite the incantation:\n*\"Eight Radiant Mysterious Mist, dispersing qi in the void courtyard,\nShrouding the body in nine rosy dawns, concealing radiance in the hidden and dark.\nPrecious talismans descend mysteriously, chariots of green jade turn and revolve,\nReturning through the Nine Mornings, anchoring my form.\nAscending to the Jade Chamber, bowing in audience at the Purple Court.\"*\n\nConclude by swallowing qi thirty-six times.\n\nNext, visualize the First Star Thearch of the Dipper transforming and concealing the Peach Primordial Inner Consort, named Taiyi Fatan, styled Xing Zhengfu, wearing a yellow brocade cloak and vermilion-green flying skirt, with cloud-like tresses.\n\nThe Second Star Thearch, Preserver of the Womb and Transformer of Form Inner Concubine, named Taiyi Sanpeng, styled Luo Zhuying, wearing a green brocade cloak and green-feathered flying skirt, with cloud-like tresses.\n\nThe Third Star Thearch, Six Escapes and Seven Stars’ Upper Primordial Cinnabar Mother, named Taiyi Yunyi, styled Chong Shuangzhao, wearing a green brocade cloak and embroidered-feather patterned skirt, with cloud-like tresses.\n\nThe Fourth Star Thearch, Concealer of Radiance and Hider of Light Central Primordial Inner Consort, named Taiyi Qilie, styled Qiu Hengying, wearing a purple brocade cloak and yellow-flowered feathered skirt, with cloud-like tresses.\n\nThe Fifth Star Thearch, Transformer of Body and Changer of Radiance Dipper’s Central Great Maiden, named Taiyi Yushu, styled Chou Qiulan, wearing a vermilion brocade cloak and purple-green flying skirt, with cloud-like tresses.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1280,
      "start_sentence": 0,
      "end_sentence": 26,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.7974112033844,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清化形隐景登升保仙上经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "第六星帝君隐迹散象斗中中女，名太一气精，字抱定陵，着朱锦帔青绣飞裙，颓云髻。 第七星帝君分景万形斗中少女，名太一都异，字天凡淑，着丹锦帔青华羽裙，颓云髻。 第八星帝君化日月水火斗中高皇左夫人，名太一石启珠，字洛茂华，着紫锦帔绣羽飞裙，颓云髻。 第九星帝君化金石山河斗中高皇右夫人，名太一爱条，字云育玄，着绿锦帔翠华飞裙，颓云髻。 存九星帝君隐妃九阴内名，形色衣服，皆使朗然，从北斗中来下，炎光流曜，焕烂虚无，回神玄映，入我身中，处明堂之内，紫房之中，夹日月二象，九晨之晖罗列，相次化为婴孩，九帝真形，名曰无常童子，安在兆身，内外洞彻，炎光玄映，匝体通热，仍叩齿九通，祝曰： 九晨回巅，隐化元方，洞天九元，斗中真童，炎光玄映，布溢紫房，千变万化，易景婴蒙，随意所之，出有入无，得乘八景，上谒帝皇。 毕，咽气九过止。 此帝君九阴化形隐景之上经，中央黄老君、南方赤精君、东方青童君、北方太上君、西方太素君，并回九阴以散形，运九晨以匿躯，掷飞轮以登空，乘玄霄以遨游，纵景万变，随世沉浮，若兆行之，三光同休。 上清化形隐景登升保仙上经竟",
      "translated_text": "The Sixth Star Thearch, Concealer of Traces and Disperser of Forms Dipper’s Central Maiden, named Taiyi Qijing, styled Baoding Ling, wearing a vermilion brocade cloak and blue-embroidered flying skirt, with cloud-like tresses.\n\nThe Seventh Star Thearch, Divider of Radiance and Shaper of Myriad Forms Dipper’s Youngest Maiden, named Taiyi Duyi, styled Tian Fanshu, wearing a cinnabar brocade cloak and blue-flowered feathered skirt, with cloud-like tresses.\n\nThe Eighth Star Thearch, Transformer of Sun and Moon, Water and Fire Dipper’s High August Left Consort, named Taiyi Shiqizhu, styled Luomaohua, wearing a purple brocade cloak and embroidered-feather flying skirt, with cloud-like tresses.\n\nThe Ninth Star Thearch, Transformer of Metal and Stone, Mountains and Rivers Dipper’s High August Right Consort, named Taiyi Aitiao, styled Yun Yuxuan, wearing a green brocade cloak and kingfisher-flowered flying skirt, with cloud-like tresses.\n\nPreserve the hidden names of the Nine Star Thearchs’ concealed consorts, their forms and colors, and their attire, all made luminously manifest. Descending from the Northern Dipper, their blazing radiance streams forth, resplendent in the void. Turning the spirit to mysterious reflection, they enter within my body, abiding in the Hall of Light and the Purple Chamber, flanked by the twin symbols of sun and moon, with the ninefold morning brilliance arrayed in order. They transform in succession into infants, the true forms of the Nine Thearchs, named the Eternal Youths. Settling within my body, both inner and outer become pervaded with clarity, their blazing radiance and mysterious reflection suffusing my frame with warmth. Then strike the teeth nine times and intone the incantation:\n\n\"Nine Mornings revolve on high,\nConcealed transformations of the Primal Quadrant.\nCavern-Heaven’s Nine Origins,\nTrue Youths within the Dipper.\nBlazing radiance and mysterious reflection,\nSpreading and suffusing the Purple Chamber.\nA thousand changes, ten thousand transformations,\nExchanging radiance, infant illumination.\nFollowing intent wherever it goes,\nEmerging from being, entering non-being.\nAttaining to ride the Eight Effulgences,\nAscending to audience with the August Thearchs.\"\n\nWhen finished, swallow the qi nine times and cease.\n\nThis is the *Upper Scripture on the Concealed Forms and Hidden Radiance of the Nine Thearchs’ Yin Transformations*, wherein the Central Yellow Venerable Lord, the Southern Vermilion Essence Lord, the Eastern Azure Youth Lord, the Northern Supreme Lord, and the Western Primordial Simplicity Lord all revolve the Nine Yin to disperse their forms, move the Nine Mornings to conceal their bodies, cast the flying wheel to ascend the void, and ride the Dark Empyrean to roam at will. Their radiance transforms myriad times, drifting with the world’s vicissitudes. Should one practice this, the Three Luminaries shall share in one’s repose.\n\nThe *Upper Scripture on Ascending and Preserving Transcendence through Concealed Forms and Hidden Radiance* from the *Highest Clarity* concludes.",
      "overlap_context": "erned skirt, with cloud-like tresses.\n\nThe Fourth Star Thearch, Concealer of Radiance and Hider of Light Central Primordial Inner Consort, named Taiyi Qilie, styled Qiu Hengying, wearing a purple brocade cloak and yellow-flowered feathered skirt, with cloud-like tresses.\n\nThe Fifth Star Thearch, Transformer of Body and Changer of Radiance Dipper’s Central Great Maiden, named Taiyi Yushu, styled Chou Qiulan, wearing a vermilion brocade cloak and purple-green flying skirt, with cloud-like tresses.",
      "start_char": 1281,
      "end_char": 1760,
      "start_sentence": 27,
      "end_sentence": 35,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.314489364624023,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清化形隐景登升保仙上经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}