{
  "source_id": "上清九天上帝祝百神内名经",
  "source_file": "chunked_daozang\\上清九天上帝祝百神内名经.json",
  "total_chunks": 3,
  "total_original_chars": 3351,
  "total_translated_chars": 21079,
  "total_translation_time": 121.67362713813782,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\上清九天上帝祝百神内名经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Upper Clarity Scripture of the Nine Heavens’ Celestial Sovereigns’ Invocation of the Hundred Spirits’ Inner Names**\n\n**Scripture Title:** *The Upper Clarity Scripture of the Nine Heavens’ Celestial Sovereigns’ Invocation of the Hundred Spirits’ Inner Names*\nAuthor unknown, approximately composed during the Eastern Jin or Southern Dynasties, adapted from the *Great Cavern Scripture* and the *Scripture of the Feminine One*. One scroll.\nSource text: *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n**The Upper Clarity Scripture of the Nine Heavens’ Celestial Sovereigns’ Invocation of the Hundred Spirits’ Inner Names**\n\nThose who know the first names of the hundred spirits shall not die; those who constantly recite the invocation of the Nine Heavens’ Celestial Sovereigns become immortals. When the adept completes the practices of Returning to the Origin, the Five Penetrations, the Eight Intervals, and the Twelve Vows, they shall read the names of the hundred spirits once to continue their affairs thereafter.\n\n**The Hundred Spirits’ Names:**\nSanlan Luobo Dai Tai.\nLi Tang He Tui Yun Ru.\nZhu Yu Luo Guang Du Ling.\nFu Yu Miao San Zhao Sheng.\nChao Zhi Tian Heng Ming Shi.\nQian Bao Ting Xi You Yi.\nXuan Wo Sha Cheng Fu Shen.\nMing Zhu Zi Hui He Cun.\nLe Bai Le Fei Ming Xian.\nWang Chang Jie Shun Wan Yan.\nHui Su Chong Ji Lai Jing.\nHe Gui Luo Jie Shu Yong.\nSan Le Shen Wu Da Men.\nHong Yu Xia Du Fa Quan.\nMing Kao Li Ba Jie A.\nHuai Yin Ming Shen Chu Luo.\nFa Qian He Guang Yun Chang.\nMi Jie Da Da Sheng Zhang.\nMan Jing Sheng Bi Chang Tong.\nZhong Qi Hui Chu Lan Meng.\nHui Ming Chu You Zhong He.\nMing Chong Ci Xin Ming Du.\nZhang Tang Dai Yuan Miao Ling.\nBao Jie Cheng Jie Liu Ting.\nDan Ming Chang Zuo Di Gen.\nBian Shi Qi San Dao Qian.\nDeng Lai Zhang Cheng Fa Mo.\nJie Qu Xuan Jing Zhong Che.\nZong Ming Ben Deng Long Lü.\nHui Yan Le De Ri Xian.\nCheng Yuan Lun Ru You Zong.\nWu A Lei Feng Shen Chong.\nYing Sui Jie Du Lian Jue.\nGuan Xuan Qin Ming Bin Yu.\nYing Jie Yun Yong Yu Sheng.\nWu Di Bo Fang Chao Ning.\nKai Shen Hua Tai Ji Yuan.\nLing Chang Yu Bai Tu Jun.\nJi Qi Shou Shou Cheng Ming.\n\nThree, five, seven, nine—immortal Dao is achieved;\nThe Primordial Cavern’s Eight Intervals congeal the Emperor’s form.\nAbove, the Twelve Heavens’ blessings arise;\nThis is the Return to the Origin, the hundred spirits’ illumination.\nThe Five Paths’ secret invocation preserves the Yellow Tranquility.\nI know the hundred spirits attain eternal life;\nMay Heaven and immortals ascend to the Upper Clarity.\nBlessings and prosperity naturally embrace true numen.\nThe Primordial Cavern’s Eight Intervals and the Feminine One’s essence,\nCherishing the *Great Cavern’s Lofty Scripture*,\nThe ancestral master unties the knots and receives the womb’s name.\n\nHere ends the invocation of the hundred spirits’ names.\n\nThe Way of the Three, Five, Seven, Nine, and the Primordial Cavern’s Eight Intervals congealing the Emperor’s form—when twelve persons unite in vow, this is the oral transmission of the *Great Cavern*, the jade instructions of its thirty-nine chapters. Those who obtain it become Perfected Ones of the Highest Clarity; those who practice it become Perfected Ones of the Highest Clarity. Golden tablets are inscribed with feathered writ; jade slips are carved upon the cavern’s summit. The Celestial Emperor treasures its transformations; the Three Primes forbid its leakage.\n\nThus, in transmission:\nFor the superior fast, three hundred days;\nFor the middle fast, one hundred seventy days;\nFor the lesser fast, forty-five days.\nDiligently refine the cinnabar heart in the dark instructions;\nSuffer the five limbs in supplication.\nThe body labors in the master’s qi;\nSeek resonance beyond the numinous Han.\nIncense clouds thicken upon the sleeping mat;\nAlign and harmonize, sitting in the master’s chamber.\nThus, the true heart becomes luminous and penetrating;\nMysterious toil converges with the journey.\nThe obscure quest unfolds smoothly;\nOnly then is the true scripture bestowed.\n\nThe rites of fasting and offerings follow the *Great Cavern’s* methods.\nOn the day of receiving the text, they swear an oath in a separate chamber.\nShould the jade scripture be leaked, seven generations of ancestors shall suffer the punishment of the wind-knife.\n\n**The Supreme Lord’s Chant of Wisdom to Dissolve Demons**\nAfter reading the *True Scripture of the Great Cavern* ten times, one should read this *Chant to Dissolve Demons* once to repel the poisonous qi of the Nine Heavens and ward off the trials of the Great Demon King of the Northern Emperor.\n\nThe Four Supreme Lords of the Most High, attending the Jade Dawn Supreme Lord of the Great Dao on his left, the Great Dao Lord reposes in the Jade Void Chamber of Harmonious Dawn, the Golden Flower Chamber. Below, he registers the Nine Mysteries; to the right, he aids the Six Realms.\n\nThen, the Perfected Attendant Simplified Life, the Jade Maiden of the Jade Clarity’s divine chamber, Fang Su, holding the incense of the Flying Qi of Vermilion Mound, bearing the divine chapters of the essential and mysterious, stands forth. The Supreme Dao Lord rinses with azure water, exhales crimson qi, empties the heart, stills the body, calms the spirit, and focuses upon the mysterious. Girded on the left with the Divine Tiger, on the right with the Golden Perfected, he recites the *Jade Scripture of Wisdom* and the *Supreme Chapters of the Dissolution of Demons*, along with the *Eight Mysteries and Nine Obscurities*, the *Seven Gates and Three Candles*, the *Sun’s Void and Moon’s Absence*. The upper script shines resplendent; a thousand truths halt their wheels; ten thousand spirits cease their steps. The empty sound ascends, stirring; the mysterious sprinkles a hundred blessings. Rare echoes soar and play; the cavern’s gold shines radiant. Above, it illumines the hidden and obscure; below, it brightens the crouching and concealed. The mysterious pattern flows and flourishes; the divine gaze is swift and keen. The Dao converges without bound; the subtle resonance awakens the obscure. The whirlwind’s qi extends into the void; dust and ruins accumulate in the realm. The mysterious reflection inwardly illuminates; the clear waves mirror the lucid. The Great Dao is distantly complete; flying light shines afar. Moving steps in the numinous chamber, startling waves drift in purity. Profoundly steadfast, without obscurity, gazing at the sun, they leap free. Transformation is not dull silence; change is not stagnant. Swift transformation soars in the yang; rare perching embodies luminous virtue. Serene and joyful, the twin gates return to awakening the principle’s subtlety. Tranquil and unadorned, the great image, shaking the bell, broadens the river. Darkly penetrating, the mysterious interflows; the principle’s subtlety connects the minute. Roaming and playing with the divine blade, floating and clarifying the great jade, they excite the hundred yang to generate lightning, drum the thousand yin to emit might. The Six Heavens lose their qi; the Nine Demons crumble and disperse. Grasping the sun, broadening the rosy clouds, ten thousand mists enter the bosom. At rest, they harmonize with Heaven and Earth; in motion, they equal the Seven Luminaries’ radiance. In the mysterious repose of the Dharma Hall, they empty and focus upon peril and peace. Shining brilliance flows like smoke; gathering the true, they embrace and perch. At Harmonious Dawn, the two absolutes intermingle; with a glance, the ten thousand Perfected spontaneously open.\n\nThen, feet tread the Seven Degrees; hands hold the Heavenly Mechanism. The crown’s canopy is the mysterious celestial body; the two poles converge and withdraw. The River God is thereby breached; the Four Qi thereby flow and shift. The firm and mysterious, the bright jade, the Nine Rotations collapse. The numinous measure encircles and falls; the One Mystery returns and unites. The spirit is whole, emptily advancing; the wondrous resonance mysteriously soars. Those who can stir the Great Void from the constant, generate the host of winds from the latent subtlety, raise the Eight Luminaries to ascend, lift the flying reins upon the pure ridge, ride the phoenix carriage to gaze on high, release the cloud chariot to roam and gallop—such ones shall surely attain it.\n\nGazing upon the Nine Distances with radiant brilliance, ascending the Purple Heavens to halt the Crimson Light;\nDelighting in the Seven Springs to harmonize qi, crowning the Azure Ford to pour into the Crimson Well.\nDrifting mist and lightning flashes, with the wondrous body upright and limpid—\nEmpty spirit reveres the numinous, ascending the ladder of eternity.\n\nThe Vermilion Radiance now gleams; qi returns to the Mystic River.\nFolding wings to observe transformation, soaring freely through the Void Net—\nMyriad forms converge in reflection, flying wheels upon the Jade Slope.\nPhoenixes cry and dragons leap; tigers roar and phoenixes sing.\nA thousand echoes scatter like jade; countless gems bloom in disarray.\nJade chimes vibrate in the wind; crimson trees burst into blossom.\n\nThus, stirring harmony into ten thousand tones, flying melodies through a thousand measures—\nThe numinous pattern unfurls; cloud-unicorns reveal their essence.\nMysterious transformations flow at dawn; wondrous arts emerge at dusk.\nLoosening the sash to wander in spirit, embracing the knees with mistletoe and blossoms—\nObserving transformation without adornment, the Jade Mystery unadorned.\nUpright and open, the empty current flows; carefree and luminous, the essence flourishes.\nThe Seven Luminaries endure eternally, neither forsaking nor prizing—\nDispelling harm and cold spirits, without burden or counterpart.\nRevering the trust of the divine harmony, chanting songs of dark wisdom—\nSeizing the heavens to prepare the liver; the lion steadies the lungs.\nScorching fire guards the soul; the copper-headed aligns the po.\nLong fangs and pricked ears leap in reverse; the Lightning Father excites qi with twin bounds.\nBaring teeth and drawing in feet, the Thunder Duke pounds and presses.\nThe Six ( ) camps gaze; the Five Tigers roar and snort.\nGripping blades to chase away evil; fierce beasts drive out filth.\nRushing qi and thunder essence guard life from falling.\n\nYet these marvels arise from human action; the Dao also aids life.\nScaling peaks to concentrate spirit, shaking free the towering crags—\nNine calamities dispel misfortune; thought and emotion dissolve.\nHarmonizing the Eight Images, the Mystic Void’s qi is light.\nThe Seven Glances of the Lofty Empyrean bestow fragrant blossoms—\nVermilion and yellow, fiery and lush, flying mist and radiant spirit.\nCultivating and circulating true essence, scattering simplicity and fame—\nRinsing the taste of numinous brushstrokes, spirit levels the dawn’s clarity.\nWandering the Nine Heavens, the high chambers fragrant and dark—\nJade maidens hold incense; purple consorts cradle infants.\nIrrigating the Celestial Pools with dew, scattering blossoms in the Jade Court—\nSummoning the armored couriers, swiftly seizing the Heavenly Soldiers.\nPoisonous dragons spew blades; divine tigers dispatch troops.\nExternally entwined with Mystic qi, outwardly prepared with the Five Citadels—\nThe Dao unites all; relying on majesty to give life.\nThe true attains equal virtue; the Primordial qi then merges.\n\nThus, the Jade Purity’s dawn perfected—heart without empty shores—\nDwelling high beyond the worthy, embracing cinnabar amidst the clouds.\nExtending to those of the Supreme Dao, containing brilliance and self-radiance—\nReaching those of the Supreme Virtue, savoring solitude and dark dispersal.\nThe Mystic does not seek the true; the sign does not reveal splendor.\nConfronting the Great Dao’s vastness, at the hair’s-breadth margin—\nRising in emptiness to respond to the moment, the subtle and constant resonance.\nFlying strings soar afar; sound does not await plucking.\nThe Nine Harmonies’ Mystic Echo—empty and identical to the Utmost Dark.\n\nThus can the heart be cut off beyond heaven, wondrously one with the singular vision.\nFrom this point onward, all are the Dragon’s Radiance and Four Marshes—\nEmitting essence in secluded migration, wandering dreams in the Jade Purity—\nEntrusting light to the upper leisure, drifting reflections to ascend the Void.\nHands fanning eight thousand; body shaking the Purple Staff—\nScarlet kerchief and lotus crown, gleaming through the Seven Valleys.\nFlying fragrance rinses the mist; essence penetrates the Great Void.\nVirtue fills the Nine Heavens, bearing sun and moon together—\nSerene dwelling in the vast expanse; flying wheels and mendicant monks.\nLoosening the sash in the blossoming circle, the Western Primordial commands the reins—\nRiding the Turtle Mountain, the Four Unfurlings of Jade Wisdom—\nWondrously chanting the Supreme Mystery; the Six Yin’s blossoms come to cultivate martial affinity.\nVirtue reaches the Vermilion Distance; the Dao awakens the Supreme Perfected.\n\nMoreover, with langgan in lush bloom, the Seven Yangs’ Solar Infants—\nThe Nine Lin’s fluid, the Eight Qiongs’ essence—\nFour Stamens’ Mystic Nectar, Five Pearls’ Crimson Life—\nThree Blossoms’ flying net, Twin Pearls’ moonlight—\nOrchid liquid and golden ( ), Sweet Dew’s Jade Vase—\nAzure tendrils and weak silk, drifting mushrooms and flowing spirit—\nDivine powder and cinnabar dust, Mystic Branches’ linked camps—\nWandering roots gather at dawn; the Western Sovereign’s plain abundance.\nThis can ascend the Vermilion Empyrean, fly the Void’s Jade Purity—\nInhaling and exhaling to reach the true and numinous—\nRinsing and transforming to enter the Purple Court.\nIt can also be the Eastern Culmen’s Weaving Maiden’s water,\nOr the Western Expanse’s Long Dusk’s twilight,\nOr the Southern Limit’s Yang Radiance’s root,\nOr the Northern Depths’ Great Yin’s Night Citadel.\n\nThen, as the Vermilion Summer congeals yang, the radiant whirlwind soars afar—\nThe Great Void submits its essence; the Two Images turn toward light.\nThe Eight Paths harmonize; riding the fragrant course of Mu—\nTransforming and ordering the Nine Absolutes, attaining the Jade Emperor’s delight.\nThe Three Passes’ profound depths; the Four Divine Portals unfurl—\nAuspicious clouds construct the Empyrean; the Six Perfections bring felicity.\nNuminous winds scatter demons; the Dharma Drum summons troops.\nWandering the shores to bathe in the ford, washing the heart in the azure waves—\nRefining the soul and transforming the po, all gather in the Dao’s precinct.\nSipping essence and ( ) embryo, harmonious qi preserves longevity—\nUnfolding brilliance and sprouting wisdom, wisdom assists external fusion.\nBelow, drawing from the Mystic Current; above, pushing open the Empty Cavern.\n\nThe vessel’s ( ) omen—thus playing with the Dao’s lineage—\nRooting the karmic affinity, returning to feast with the Jade Emperor.\nAt dawn, shedding the world; ascending to wander the Empty Cavern—\nQi returns to the Dark Ford; shaking and bestowing the Numinous River.\nMorning registers with the Golden Immortals; self-aid without end—\nAbove the Jade Purity, the Supreme Primordial’s numinous qi—\nDiscarding the immortal’s chapters, doffing the morning crown—\nThough the body harmonizes with the powdered groves, the heart dwells beyond images—\nVaguely towering and lofty, yearning for the subtle sound of the empty flute.\n\nThus, bidding farewell to glory and scattering blossoms, shaking the staff upon the lofty ridge—\nChewing the Primordial qi, inhaling and drawing the Two Luminaries—\nControlling the Nine Immortals’ swans, exhausting spirit to probe the upright—\nSilent bones within emptiness, gathering qi to overturn the tripod—\nThe insipid body self-vanishes; the dwelling’s fate is tranquil and still.\nReleasing form to attain emptiness, without heart or grasp.\n\nThen, opening the cavernous inquiry in the Sparse Grove, seeking the Jade Numinous in the Cinnabar Cavern—\nUnlocking the Nine Heavens’ Vermilion Gates, obtaining the Jade Purity’s jade missive—\nOnce gazing upon the Jade Steps amidst the dawn’s clouds,\nTwice beholding the Cavern Texts in the brocade-clouded satchel—\nFour encounters with the Three Primordials upon the Mystic Terrace,\nSix visits to the Five Elders in the Azure Chamber—\nPassing the Fusang in the Mystic Palace, seeing the Supreme Constancy upon the Nine Heights—\nHeaven’s fan scatters; the plain and subtle grow dark.\nExtending the wheel and returning the carriage, the high assembly in the Jade Court—\nFeathered skirts and brocade robes, flowing bells and chiming flutes—\nDragon crowns and phoenix blossoms, following the clouds in carefree roaming—\nDark and vast, equal to the dawn; heart cavernous, body distant.\nThe Great Cavern’s Jade Canon stirs my Nine Darks—\nAscending above the sun and moon, the Jade Grove’s branches.\n\n**Method of Ingesting the Qi of the Mystic Root from the Great Cavern Jade Canon**\n\nThe method of ingesting the qi of the Mystic Root renders the body luminously clear, sharpens the eight senses of the spirit, suffuses the form with solar radiance, and imparts a jade-like luster to the face. The eyes emit bright light, the teeth hold purple qi, the intestines grow firm, and the hidden splendor flourishes—thus attaining longevity and enduring vision.\n\nAbsorb the morning essence, suspend grain, and fast from solid food. The essential Dao lies in the Golden Liquid; its subtlety resides in the Water Jade’s workings. This is called exhaling and inhaling the Great Harmony of nature, mastering the numinous essence of the Ninefold Purity.\n\nThe function of the Dao values spontaneity; the stillness of virtue honors serenity and joy. Embracing spontaneity to manifest truth and holding fast to tranquil emptiness to rectify deviation—then no transgression arises, and harm vanishes of itself. This pertains to the qi of the Three, Five, Seven, and Nine, which may be called the essential purport of the Dao.\n\nWhen the adept lies abed before rising, visualize within the mouth a white qi, vast as the yolk of a chicken’s egg. Beyond the yolk, five-colored qi naturally coils and overflows, soon filling the heart and mouth—this is called the qi of the Three, Five, Seven, and Nine, the Mystic Root of the Zi-day.\n\nWithin the heart and stomach’s opening, visualize a woman shaped like an infant, unclothed, standing upright in the stomach’s passage. She faces the stomach’s gate, mouth agape, and is named the Mystic Woman of the Nine Heavens. She receives and pours the soul’s essence, inhaling the five-colored qi of the egg-yolk within the mouth.\n\nRegularly rinse the mouth, inside and out, above and below. With the tongue, draw in the solar qi and the five-colored saliva, filling the mouth before swallowing. Visualize the saliva descending into the Mystic Woman’s mouth. Repeat this five times, then click the teeth thrice and softly intone:\n\n*\"Jade Purity on high, Nine Heavens and Nine Numinous Ones,\nGoverned in the Mystic Mystic, descending into the stomach’s clarity.\nGold harmonizes with jade’s radiance, first born from emptiness—\nNamed ‘Pure Ring,’ styled ‘Luminous Essence.’\nRefining the hun and restraining the po, the heart opens and the spirit brightens.\nIngesting the Zi-day’s sustenance, golden splendor fills to abundance.\"*\n\nAfter a long while, conclude the practice. Wipe the eyes fourteen times with the hands, then rub the hands together and massage the face, brows, eyes, temples, and hairline until warmth suffuses them, as if gently steamed.\n\nThis is the Supreme’s method of ingesting the qi of the Three, Five, Seven, and Nine, the Mystic Root of the Zi-day.\n\n---\n\n**Ode by Lady Wang of the Purple Tenuity**\n\nGaze upon the Grand Aurora Palace,\nWhere golden portals gleam in Purple Clarity.\nThe immortal chambers reflect the Primal Simplicity,\nFour casements all of crimson jasper.\n\nTossing wheels across the boundless ford,\nReining steeds to dance in emerald carriages.\nJade blossoms unfurl cloud-canopies,\nWestern consorts unfurl brocade banners.\n\nSuddenly descending amid the dust’s murk,\nSwiftly alighting in the courtyard of a fair one.\nLong-awaited resonance answers the destined hour—\nWhat is gained already dwells in mystery.\n\nRiding the wind, we soar through the Nine Empyreans,\nTogether sipping the cinnabar bloom’s essence.\nTurning from worldly things, we part—\nHow could they know the numinous void’s spirit?\n\nNorthward we ascend the Gate of Mystic Darkness,\nHand in hand, weaving the lofty net.\nIncense smoke scatters the Eight Sceneries,\nMystic winds stir the crimson waves.\n\nGazing upward, we cross the Coral Ford;\nLooking down, we survey the winding valleys.\nJade whistles sing above the clouds,\nPhoenixes cry through the Nine Distances.\n\nRiding qi, we float in the Great Void—\nWhy tread upon mountains and rivers?\nWith golden tablets, we summon feathered spirits,\nConquering peaks to crush lofty demons.\n\nRinsing and imbibing the round dawn’s glow,\nAccumulating eons like an infant’s teeth.\nAmid the clamor of the world’s striving,\nThey know not what to do.\n\n*The Scripture of the Hundred Inner Names of the Gods of the Nine Heavens of the Supreme Clarity is now complete.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清九天上帝祝百神内名经 经名：上清九天上帝祝百神内名经。 撰人不详，约出於东晋南期，系改编《大洞经》、《雌一经》而成。 一卷。 底本出处：《正统道藏》正一部。 上清九天上帝祝百神内名经 兆能知百神名首者不死，恒诵九天上帝之祝者神仙也。 兆行回元五通八间十二愿之事，既毕，读百神名一过，以续行事之后也。 百神名 三蓝罗波逮台。 离堂合推运入。 珠郁罗广都灵。 弗育邈散兆生。 超滞天横冥始。 骞苞庭盻猷已。 玄幄沙称福神。 明柱子会和存。 乐百勒飞冥贤。 望昌竭顺万烟。 回素充吉来静。 和归络结舒永。 三乐深五达门。 泓郁遐度法全。 明考梨拔劫阿。 徊因明神初罗。 发迁合光运长。 弥劫大大生彰。 满景生比常通。 种气会出阑蒙。 会命初幽中和。 冥冲次信明都。 掌堂逮元眇灵。 保解乘结六庭。 丹明昌左帝根。 变世气三道迁。 登来张乘法谟。 解曲玄镜重车。 总命本登龙律。 晖延勒得日贤。 乘元轮入幽宗。 无阿累奉神冲。 映遂劫度连绝。 观轩寝明宾郁。 盈劫运邕玉升。 无帝伯方超凝。 开神华太纪元。 凌昌玉百涂君。 极气寿受乘明。 三五七九仙道成，混洞八间帝凝形，上愿十二天福生， 是为回元百神明，五道秘祝保黄宁，我知百神得常生， 愿天愿仙得上清，祚禄自然含真灵，混洞八间雌一精， 怀抱大洞高上经，上祖解结受胎名。 右祝百神名毕於此也。 三五七九，混洞八间帝一凝形之道，十二人合愿者，乃大洞之口传，三十九章之玉诀，得之者成上真，行之者成上真，金简撰於羽章，玉札刊於洞巅，天帝宝其变，三元禁其泄。 故传授者，对斋三百日，中斋一百七十日，下斋四十五日，勤丹心於冥诀，苦五体於请乞，身劳於经师之气，求感於灵汉之表，香云郁於寝席，正和坐於师宇，如此则真心明达，玄苦合旅，幽求坦畅，真经乃与耳。 斋馔之节，一依大洞之法，受书之日，共盟于别室。 泄漏玉经，七祖获风刀之考罚矣。 太上说智慧消魔唱 读《大洞真经》十过，辄当一过读此消魔唱，以辟九天之毒气，禳北帝大魔王之来试也。 太上四老君，侍玉晨太上大道君之左，大道君闲居於协晨玉虚之房，金华之室，下籍九玄，右济六领。 於是太保真人，简生玉清神女房素，执朱陵飞气之香华，捧要妙幽玄之神章而立，太上道君漱碧水，吐绛气，虚心静躬，安神注玄，乃左带神虎，右佩金真，诵吟智慧玉经，及消魔药叙上章，及八玄九冥、七扉三烛、日虚月无，上文朗郁，千真停轮，万灵止足，虚音上激，玄洒百福，殊响逸奏，洞金朗郁，上鉴潜幽，下焕跧伏，玄范流秀，神览颖速，道会无涯，希韵幽觉，飙气延虚，埃圮积域，玄映内照，清波镜渌，大道远备，飞光遐灼，动步灵宇，惊浪素逸，沉挺无冥，望日解跃，变则期蔚，化不淳默，逡化翘阳，希栖景德，恬愉双门，反悟理几，镇朴大象，振铃广河，冥洞玄通，理妙接微，遨玩神刀，泛澄大瑰，激百阳以生电，鼓千阴以吐威，六天失气，九魔消摧，握日广霞，万烟入怀，静与天地合契，动与七景齐晖，玄寝法堂，虚注安危，映冏流烟，采真含栖，协晨则二绝交和，盻目则万真自开。 於是足排七度，手秉天机，巅盖玄辰，合遁二仪，河神为之冲决，四气为之流移，坚玄明玉，九璇豁颓，周落灵度，廓一玄归，神全虚往，妙韵玄飞者，必能动太空於无常，生群风於潜颖，举八景以上升，抗飞辔於清岭，逸凤车以高观，放云軿以流骋。",
      "translated_text": "**The Upper Clarity Scripture of the Nine Heavens’ Celestial Sovereigns’ Invocation of the Hundred Spirits’ Inner Names**\n\n**Scripture Title:** *The Upper Clarity Scripture of the Nine Heavens’ Celestial Sovereigns’ Invocation of the Hundred Spirits’ Inner Names*\nAuthor unknown, approximately composed during the Eastern Jin or Southern Dynasties, adapted from the *Great Cavern Scripture* and the *Scripture of the Feminine One*. One scroll.\nSource text: *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n**The Upper Clarity Scripture of the Nine Heavens’ Celestial Sovereigns’ Invocation of the Hundred Spirits’ Inner Names**\n\nThose who know the first names of the hundred spirits shall not die; those who constantly recite the invocation of the Nine Heavens’ Celestial Sovereigns become immortals. When the adept completes the practices of Returning to the Origin, the Five Penetrations, the Eight Intervals, and the Twelve Vows, they shall read the names of the hundred spirits once to continue their affairs thereafter.\n\n**The Hundred Spirits’ Names:**\nSanlan Luobo Dai Tai.\nLi Tang He Tui Yun Ru.\nZhu Yu Luo Guang Du Ling.\nFu Yu Miao San Zhao Sheng.\nChao Zhi Tian Heng Ming Shi.\nQian Bao Ting Xi You Yi.\nXuan Wo Sha Cheng Fu Shen.\nMing Zhu Zi Hui He Cun.\nLe Bai Le Fei Ming Xian.\nWang Chang Jie Shun Wan Yan.\nHui Su Chong Ji Lai Jing.\nHe Gui Luo Jie Shu Yong.\nSan Le Shen Wu Da Men.\nHong Yu Xia Du Fa Quan.\nMing Kao Li Ba Jie A.\nHuai Yin Ming Shen Chu Luo.\nFa Qian He Guang Yun Chang.\nMi Jie Da Da Sheng Zhang.\nMan Jing Sheng Bi Chang Tong.\nZhong Qi Hui Chu Lan Meng.\nHui Ming Chu You Zhong He.\nMing Chong Ci Xin Ming Du.\nZhang Tang Dai Yuan Miao Ling.\nBao Jie Cheng Jie Liu Ting.\nDan Ming Chang Zuo Di Gen.\nBian Shi Qi San Dao Qian.\nDeng Lai Zhang Cheng Fa Mo.\nJie Qu Xuan Jing Zhong Che.\nZong Ming Ben Deng Long Lü.\nHui Yan Le De Ri Xian.\nCheng Yuan Lun Ru You Zong.\nWu A Lei Feng Shen Chong.\nYing Sui Jie Du Lian Jue.\nGuan Xuan Qin Ming Bin Yu.\nYing Jie Yun Yong Yu Sheng.\nWu Di Bo Fang Chao Ning.\nKai Shen Hua Tai Ji Yuan.\nLing Chang Yu Bai Tu Jun.\nJi Qi Shou Shou Cheng Ming.\n\nThree, five, seven, nine—immortal Dao is achieved;\nThe Primordial Cavern’s Eight Intervals congeal the Emperor’s form.\nAbove, the Twelve Heavens’ blessings arise;\nThis is the Return to the Origin, the hundred spirits’ illumination.\nThe Five Paths’ secret invocation preserves the Yellow Tranquility.\nI know the hundred spirits attain eternal life;\nMay Heaven and immortals ascend to the Upper Clarity.\nBlessings and prosperity naturally embrace true numen.\nThe Primordial Cavern’s Eight Intervals and the Feminine One’s essence,\nCherishing the *Great Cavern’s Lofty Scripture*,\nThe ancestral master unties the knots and receives the womb’s name.\n\nHere ends the invocation of the hundred spirits’ names.\n\nThe Way of the Three, Five, Seven, Nine, and the Primordial Cavern’s Eight Intervals congealing the Emperor’s form—when twelve persons unite in vow, this is the oral transmission of the *Great Cavern*, the jade instructions of its thirty-nine chapters. Those who obtain it become Perfected Ones of the Highest Clarity; those who practice it become Perfected Ones of the Highest Clarity. Golden tablets are inscribed with feathered writ; jade slips are carved upon the cavern’s summit. The Celestial Emperor treasures its transformations; the Three Primes forbid its leakage.\n\nThus, in transmission:\nFor the superior fast, three hundred days;\nFor the middle fast, one hundred seventy days;\nFor the lesser fast, forty-five days.\nDiligently refine the cinnabar heart in the dark instructions;\nSuffer the five limbs in supplication.\nThe body labors in the master’s qi;\nSeek resonance beyond the numinous Han.\nIncense clouds thicken upon the sleeping mat;\nAlign and harmonize, sitting in the master’s chamber.\nThus, the true heart becomes luminous and penetrating;\nMysterious toil converges with the journey.\nThe obscure quest unfolds smoothly;\nOnly then is the true scripture bestowed.\n\nThe rites of fasting and offerings follow the *Great Cavern’s* methods.\nOn the day of receiving the text, they swear an oath in a separate chamber.\nShould the jade scripture be leaked, seven generations of ancestors shall suffer the punishment of the wind-knife.\n\n**The Supreme Lord’s Chant of Wisdom to Dissolve Demons**\nAfter reading the *True Scripture of the Great Cavern* ten times, one should read this *Chant to Dissolve Demons* once to repel the poisonous qi of the Nine Heavens and ward off the trials of the Great Demon King of the Northern Emperor.\n\nThe Four Supreme Lords of the Most High, attending the Jade Dawn Supreme Lord of the Great Dao on his left, the Great Dao Lord reposes in the Jade Void Chamber of Harmonious Dawn, the Golden Flower Chamber. Below, he registers the Nine Mysteries; to the right, he aids the Six Realms.\n\nThen, the Perfected Attendant Simplified Life, the Jade Maiden of the Jade Clarity’s divine chamber, Fang Su, holding the incense of the Flying Qi of Vermilion Mound, bearing the divine chapters of the essential and mysterious, stands forth. The Supreme Dao Lord rinses with azure water, exhales crimson qi, empties the heart, stills the body, calms the spirit, and focuses upon the mysterious. Girded on the left with the Divine Tiger, on the right with the Golden Perfected, he recites the *Jade Scripture of Wisdom* and the *Supreme Chapters of the Dissolution of Demons*, along with the *Eight Mysteries and Nine Obscurities*, the *Seven Gates and Three Candles*, the *Sun’s Void and Moon’s Absence*. The upper script shines resplendent; a thousand truths halt their wheels; ten thousand spirits cease their steps. The empty sound ascends, stirring; the mysterious sprinkles a hundred blessings. Rare echoes soar and play; the cavern’s gold shines radiant. Above, it illumines the hidden and obscure; below, it brightens the crouching and concealed. The mysterious pattern flows and flourishes; the divine gaze is swift and keen. The Dao converges without bound; the subtle resonance awakens the obscure. The whirlwind’s qi extends into the void; dust and ruins accumulate in the realm. The mysterious reflection inwardly illuminates; the clear waves mirror the lucid. The Great Dao is distantly complete; flying light shines afar. Moving steps in the numinous chamber, startling waves drift in purity. Profoundly steadfast, without obscurity, gazing at the sun, they leap free. Transformation is not dull silence; change is not stagnant. Swift transformation soars in the yang; rare perching embodies luminous virtue. Serene and joyful, the twin gates return to awakening the principle’s subtlety. Tranquil and unadorned, the great image, shaking the bell, broadens the river. Darkly penetrating, the mysterious interflows; the principle’s subtlety connects the minute. Roaming and playing with the divine blade, floating and clarifying the great jade, they excite the hundred yang to generate lightning, drum the thousand yin to emit might. The Six Heavens lose their qi; the Nine Demons crumble and disperse. Grasping the sun, broadening the rosy clouds, ten thousand mists enter the bosom. At rest, they harmonize with Heaven and Earth; in motion, they equal the Seven Luminaries’ radiance. In the mysterious repose of the Dharma Hall, they empty and focus upon peril and peace. Shining brilliance flows like smoke; gathering the true, they embrace and perch. At Harmonious Dawn, the two absolutes intermingle; with a glance, the ten thousand Perfected spontaneously open.\n\nThen, feet tread the Seven Degrees; hands hold the Heavenly Mechanism. The crown’s canopy is the mysterious celestial body; the two poles converge and withdraw. The River God is thereby breached; the Four Qi thereby flow and shift. The firm and mysterious, the bright jade, the Nine Rotations collapse. The numinous measure encircles and falls; the One Mystery returns and unites. The spirit is whole, emptily advancing; the wondrous resonance mysteriously soars. Those who can stir the Great Void from the constant, generate the host of winds from the latent subtlety, raise the Eight Luminaries to ascend, lift the flying reins upon the pure ridge, ride the phoenix carriage to gaze on high, release the cloud chariot to roam and gallop—such ones shall surely attain it.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1356,
      "start_sentence": 0,
      "end_sentence": 61,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 48.435853004455566,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清九天上帝祝百神内名经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "观九遐以齐焕焕，凌紫天而停朱景； 乐七源以通气，冠碧津而注绛井。 飘烟浪电，与妙体挺澄，空神钦灵，梯绝永矣。 朱光已焕，气反玄河，戢翼观化，逸尚虚罗，万殊总映，飞轮玉阿，鸾啸龙跃，虎嗥凤歌。 万响琼散，众玉乱葩，琳琅振风，绛木跃华。 尔乃激和万音，飞鸣千律，灵范既舒，云麟显质，玄化晨流，奇术夕出，解带游神，拥滕萧华，观化不藻，玉玄不蔚，挺开空流，萧任莹荟，七朗永时，不遗不贵，消伤寒灵，无任无对，钦托神调，行歌冥慧，攫天备肝，师子镇肺，焦火卫魂，铜头齐魄，长牙奋耳以逆跃，电父激气以双趹，揭齿敛足，雷公磕捺，六( )营瞻，五虎呴咈，衔刀逐邪，猛兽驱秽，奔气雷精，保生莫坠。 然此禽始由人动，道亦济生，陵峰凝神，振披峥嵘，九凶遣难，不思不情，均合八象，玄无气轻，重霄七盻，垂芳秀英，朱黄炎萃，飞烟焕灵，陶运含真，洒朴散名，漱味灵翰，神平霄清，流浪九天，高房馨冥，玉女执香，紫妃抱婴，灌津霄池，散华玉庭，檄命甲驺，疾摄天丁，毒龙吐锋，神虎出兵，外缠玄气，外备五城，道无不合，凭威而生，真成齐德，元气乃并。 是故玉清霄真，心无空岸，高栖绝贤，抱丹云间，爰及上道之士，含章自粲，逮于上德之士，独味冥散，玄不期真，标不启焕，颉顽大道，毫分之畔，冲起应时，希微常韵，飞弦远逸，音不待弹，九和玄响，空同至冥。 故能心绝於天外，妙同於一观也。 自此以下，皆龙曜四泽，发精幽迁，游梦玉清，托景上闲，浪映升虚，手扇八千，身振紫策，巾朱冠莲，晃映七谷，飞芳漱烟，精彻太虚，德盈九天，并日载月，恬栖浩篇，飞轮比丘，解带华圆，西元命辔，骖乘龟山，四摅玉慧，妙咏太玄，六阴之华，来修武缘，德致朱遐，道悟上真。 又加以琅玕郁华，七阳日婴，九琳之液，八琼之精，四蕊玄桨，五珠绛生，三华飞网，双珠月明，兰液金( )，甘露玉瓶，青建弱罗，漂芝流灵，神屑丹散，玄柯连营，浪根朝结，西皇素盈，可以冲跃朱霄，飞虚玉清，呼而吸之，以至真灵，漱而变之，以入紫庭，亦可以东极织女之水，亦可以西尽长庚虞渊，亦可以南穷阳光之根，亦可以北测大阴夜城。 於是朱夏凝阳，景飙远翔，太虚伏精，二象向光，八道调和，乘穆运芳，化理九绝，得畅玉皇，窈窕三关，神轩四张，庆云霄构，六度休祥，灵风散魔，法鼓征兵，游汜濯津，洗心沧浪，炼魂化魄，俱会道场，歠精( )胎，和气保长，启华发颖，慧赞外融，下挹玄流，仰排空洞矣。 器( )兆也，爰玩道宗，结根因缘，反宴玉皇，晨落脱世，上游空洞，气归冥津，振施灵江，朝籍金仙，自济不终，玉清之上，太元灵气，籍弃仙章，解冠晨世，虽复体和粉林，然心栖象外，仿髴高秀，希音冲籁。 尔乃遂辞荣散华，振策崇岭，咀嚼元气，吸引二景，控鹄九仙，极神测挺，寂骨虚中，敛气倾鼎，淡身自丧，宅运闲静，放形得空，无心无秉矣。 遂启洞问於希林，寻玉灵於丹穴，开九天之朱户，得玉清之琼札，一瞻玉陛於清霄之云，再睹洞文於锦云之笈，四遇三元於玄台，六造五老於碧室，过扶桑於玄宫，见太常於九高，天扇廓散，素微玄幽，延轮回轩，高会玉朝，羽裙锦被，流铃鸣箫，龙冠凤华，随云逍遥，冥漠齐晨，心洞体辽，大洞玉经，发我九幽，上登日月，玉林之条。",
      "translated_text": "Gazing upon the Nine Distances with radiant brilliance, ascending the Purple Heavens to halt the Crimson Light;\nDelighting in the Seven Springs to harmonize qi, crowning the Azure Ford to pour into the Crimson Well.\nDrifting mist and lightning flashes, with the wondrous body upright and limpid—\nEmpty spirit reveres the numinous, ascending the ladder of eternity.\n\nThe Vermilion Radiance now gleams; qi returns to the Mystic River.\nFolding wings to observe transformation, soaring freely through the Void Net—\nMyriad forms converge in reflection, flying wheels upon the Jade Slope.\nPhoenixes cry and dragons leap; tigers roar and phoenixes sing.\nA thousand echoes scatter like jade; countless gems bloom in disarray.\nJade chimes vibrate in the wind; crimson trees burst into blossom.\n\nThus, stirring harmony into ten thousand tones, flying melodies through a thousand measures—\nThe numinous pattern unfurls; cloud-unicorns reveal their essence.\nMysterious transformations flow at dawn; wondrous arts emerge at dusk.\nLoosening the sash to wander in spirit, embracing the knees with mistletoe and blossoms—\nObserving transformation without adornment, the Jade Mystery unadorned.\nUpright and open, the empty current flows; carefree and luminous, the essence flourishes.\nThe Seven Luminaries endure eternally, neither forsaking nor prizing—\nDispelling harm and cold spirits, without burden or counterpart.\nRevering the trust of the divine harmony, chanting songs of dark wisdom—\nSeizing the heavens to prepare the liver; the lion steadies the lungs.\nScorching fire guards the soul; the copper-headed aligns the po.\nLong fangs and pricked ears leap in reverse; the Lightning Father excites qi with twin bounds.\nBaring teeth and drawing in feet, the Thunder Duke pounds and presses.\nThe Six ( ) camps gaze; the Five Tigers roar and snort.\nGripping blades to chase away evil; fierce beasts drive out filth.\nRushing qi and thunder essence guard life from falling.\n\nYet these marvels arise from human action; the Dao also aids life.\nScaling peaks to concentrate spirit, shaking free the towering crags—\nNine calamities dispel misfortune; thought and emotion dissolve.\nHarmonizing the Eight Images, the Mystic Void’s qi is light.\nThe Seven Glances of the Lofty Empyrean bestow fragrant blossoms—\nVermilion and yellow, fiery and lush, flying mist and radiant spirit.\nCultivating and circulating true essence, scattering simplicity and fame—\nRinsing the taste of numinous brushstrokes, spirit levels the dawn’s clarity.\nWandering the Nine Heavens, the high chambers fragrant and dark—\nJade maidens hold incense; purple consorts cradle infants.\nIrrigating the Celestial Pools with dew, scattering blossoms in the Jade Court—\nSummoning the armored couriers, swiftly seizing the Heavenly Soldiers.\nPoisonous dragons spew blades; divine tigers dispatch troops.\nExternally entwined with Mystic qi, outwardly prepared with the Five Citadels—\nThe Dao unites all; relying on majesty to give life.\nThe true attains equal virtue; the Primordial qi then merges.\n\nThus, the Jade Purity’s dawn perfected—heart without empty shores—\nDwelling high beyond the worthy, embracing cinnabar amidst the clouds.\nExtending to those of the Supreme Dao, containing brilliance and self-radiance—\nReaching those of the Supreme Virtue, savoring solitude and dark dispersal.\nThe Mystic does not seek the true; the sign does not reveal splendor.\nConfronting the Great Dao’s vastness, at the hair’s-breadth margin—\nRising in emptiness to respond to the moment, the subtle and constant resonance.\nFlying strings soar afar; sound does not await plucking.\nThe Nine Harmonies’ Mystic Echo—empty and identical to the Utmost Dark.\n\nThus can the heart be cut off beyond heaven, wondrously one with the singular vision.\nFrom this point onward, all are the Dragon’s Radiance and Four Marshes—\nEmitting essence in secluded migration, wandering dreams in the Jade Purity—\nEntrusting light to the upper leisure, drifting reflections to ascend the Void.\nHands fanning eight thousand; body shaking the Purple Staff—\nScarlet kerchief and lotus crown, gleaming through the Seven Valleys.\nFlying fragrance rinses the mist; essence penetrates the Great Void.\nVirtue fills the Nine Heavens, bearing sun and moon together—\nSerene dwelling in the vast expanse; flying wheels and mendicant monks.\nLoosening the sash in the blossoming circle, the Western Primordial commands the reins—\nRiding the Turtle Mountain, the Four Unfurlings of Jade Wisdom—\nWondrously chanting the Supreme Mystery; the Six Yin’s blossoms come to cultivate martial affinity.\nVirtue reaches the Vermilion Distance; the Dao awakens the Supreme Perfected.\n\nMoreover, with langgan in lush bloom, the Seven Yangs’ Solar Infants—\nThe Nine Lin’s fluid, the Eight Qiongs’ essence—\nFour Stamens’ Mystic Nectar, Five Pearls’ Crimson Life—\nThree Blossoms’ flying net, Twin Pearls’ moonlight—\nOrchid liquid and golden ( ), Sweet Dew’s Jade Vase—\nAzure tendrils and weak silk, drifting mushrooms and flowing spirit—\nDivine powder and cinnabar dust, Mystic Branches’ linked camps—\nWandering roots gather at dawn; the Western Sovereign’s plain abundance.\nThis can ascend the Vermilion Empyrean, fly the Void’s Jade Purity—\nInhaling and exhaling to reach the true and numinous—\nRinsing and transforming to enter the Purple Court.\nIt can also be the Eastern Culmen’s Weaving Maiden’s water,\nOr the Western Expanse’s Long Dusk’s twilight,\nOr the Southern Limit’s Yang Radiance’s root,\nOr the Northern Depths’ Great Yin’s Night Citadel.\n\nThen, as the Vermilion Summer congeals yang, the radiant whirlwind soars afar—\nThe Great Void submits its essence; the Two Images turn toward light.\nThe Eight Paths harmonize; riding the fragrant course of Mu—\nTransforming and ordering the Nine Absolutes, attaining the Jade Emperor’s delight.\nThe Three Passes’ profound depths; the Four Divine Portals unfurl—\nAuspicious clouds construct the Empyrean; the Six Perfections bring felicity.\nNuminous winds scatter demons; the Dharma Drum summons troops.\nWandering the shores to bathe in the ford, washing the heart in the azure waves—\nRefining the soul and transforming the po, all gather in the Dao’s precinct.\nSipping essence and ( ) embryo, harmonious qi preserves longevity—\nUnfolding brilliance and sprouting wisdom, wisdom assists external fusion.\nBelow, drawing from the Mystic Current; above, pushing open the Empty Cavern.\n\nThe vessel’s ( ) omen—thus playing with the Dao’s lineage—\nRooting the karmic affinity, returning to feast with the Jade Emperor.\nAt dawn, shedding the world; ascending to wander the Empty Cavern—\nQi returns to the Dark Ford; shaking and bestowing the Numinous River.\nMorning registers with the Golden Immortals; self-aid without end—\nAbove the Jade Purity, the Supreme Primordial’s numinous qi—\nDiscarding the immortal’s chapters, doffing the morning crown—\nThough the body harmonizes with the powdered groves, the heart dwells beyond images—\nVaguely towering and lofty, yearning for the subtle sound of the empty flute.\n\nThus, bidding farewell to glory and scattering blossoms, shaking the staff upon the lofty ridge—\nChewing the Primordial qi, inhaling and drawing the Two Luminaries—\nControlling the Nine Immortals’ swans, exhausting spirit to probe the upright—\nSilent bones within emptiness, gathering qi to overturn the tripod—\nThe insipid body self-vanishes; the dwelling’s fate is tranquil and still.\nReleasing form to attain emptiness, without heart or grasp.\n\nThen, opening the cavernous inquiry in the Sparse Grove, seeking the Jade Numinous in the Cinnabar Cavern—\nUnlocking the Nine Heavens’ Vermilion Gates, obtaining the Jade Purity’s jade missive—\nOnce gazing upon the Jade Steps amidst the dawn’s clouds,\nTwice beholding the Cavern Texts in the brocade-clouded satchel—\nFour encounters with the Three Primordials upon the Mystic Terrace,\nSix visits to the Five Elders in the Azure Chamber—\nPassing the Fusang in the Mystic Palace, seeing the Supreme Constancy upon the Nine Heights—\nHeaven’s fan scatters; the plain and subtle grow dark.\nExtending the wheel and returning the carriage, the high assembly in the Jade Court—\nFeathered skirts and brocade robes, flowing bells and chiming flutes—\nDragon crowns and phoenix blossoms, following the clouds in carefree roaming—\nDark and vast, equal to the dawn; heart cavernous, body distant.\nThe Great Cavern’s Jade Canon stirs my Nine Darks—\nAscending above the sun and moon, the Jade Grove’s branches.",
      "overlap_context": ", the Nine Rotations collapse. The numinous measure encircles and falls; the One Mystery returns and unites. The spirit is whole, emptily advancing; the wondrous resonance mysteriously soars. Those who can stir the Great Void from the constant, generate the host of winds from the latent subtlety, raise the Eight Luminaries to ascend, lift the flying reins upon the pure ridge, ride the phoenix carriage to gaze on high, release the cloud chariot to roam and gallop—such ones shall surely attain it.",
      "start_char": 1356,
      "end_char": 2628,
      "start_sentence": 62,
      "end_sentence": 76,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 48.72932720184326,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清九天上帝祝百神内名经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "大洞玉经食玄根之气法 食玄根之气法，使人体中清朗，神明八聪，身有日映，面有玉泽，眼生明光，齿含紫气，坚肠华藏，长生久视。 服吸朝液，悬粮绝粒，道要於金液，事妙於水玉所为，谓吐纳自然之太和，御九精之灵者也。 夫道之为用，贵自然也； 德之为静，尊恬愉也。 摄自然以表真，抱恬漠以正邪者，则横犯不生，非害自灭。 此及三五七九之气，可谓要道之旨者也。 兆卧未起之时，存口中有一白气，大如鸡子之黄，鸡子之黄外又有五色气，五色气宛转自然，结溢黄外，须臾，乃须满心口中，名曰三五七九日子玄根之气也。 人存心胃口之中，有一女人如婴儿之形，无衣服也，正立胃管中，张口向胃管门口，号曰九天玄女，承注魂液，仰嗡口中鸡子黄之五气也。 常漱满口中内外上下，以舌回吸日气五色津液，满口吞之，存使津液下入玄女之口矣。 如此五过，毕，又叩齿三通，微祝曰： 玉清高上，九天九灵，治在玄玄，下入胃清，金和玉映，先自虚生，名曰淳镮，字曰艳精，炼魂拘魄，心开神明，服食日子，金华充盈。 良久，都毕，以手拭两目二七，又以两手相拭，极摩面眉目之间，鬓肤之际，小令热，使台熏熏然也。 此太上服三五七九日子玄根之道也。 紫微王夫人颂 宴盼太霞宫，金阙曜紫清。 仙房映太素，四轩皆朱琼。 掷轮空洞津，总辔舞绿軿。 玉华飞云盖，西妃运锦旌。 翻然尘浊际，倏欻佳人庭。 宿感应期来，所得已在冥。 乘风愬九霄，共歠丹华婴。 顾谢世俗物，安知空洞灵。 北登玄冥关，携手结高罗。 香烟散八景，玄风鼓绛波。 仰超琅玕津，俯盼回岳阿。 玉啸云上唱，凤鸣洞九遐。 乘气浮太空，曷为蹑山河。 金节命羽灵，征岳摧高魔。 漱挹圆晨晖，积椿方婴牙。 纷纷趣竞中，不解可奈何。 上清九天上帝祝百神内名经竟",
      "translated_text": "**Method of Ingesting the Qi of the Mystic Root from the Great Cavern Jade Canon**\n\nThe method of ingesting the qi of the Mystic Root renders the body luminously clear, sharpens the eight senses of the spirit, suffuses the form with solar radiance, and imparts a jade-like luster to the face. The eyes emit bright light, the teeth hold purple qi, the intestines grow firm, and the hidden splendor flourishes—thus attaining longevity and enduring vision.\n\nAbsorb the morning essence, suspend grain, and fast from solid food. The essential Dao lies in the Golden Liquid; its subtlety resides in the Water Jade’s workings. This is called exhaling and inhaling the Great Harmony of nature, mastering the numinous essence of the Ninefold Purity.\n\nThe function of the Dao values spontaneity; the stillness of virtue honors serenity and joy. Embracing spontaneity to manifest truth and holding fast to tranquil emptiness to rectify deviation—then no transgression arises, and harm vanishes of itself. This pertains to the qi of the Three, Five, Seven, and Nine, which may be called the essential purport of the Dao.\n\nWhen the adept lies abed before rising, visualize within the mouth a white qi, vast as the yolk of a chicken’s egg. Beyond the yolk, five-colored qi naturally coils and overflows, soon filling the heart and mouth—this is called the qi of the Three, Five, Seven, and Nine, the Mystic Root of the Zi-day.\n\nWithin the heart and stomach’s opening, visualize a woman shaped like an infant, unclothed, standing upright in the stomach’s passage. She faces the stomach’s gate, mouth agape, and is named the Mystic Woman of the Nine Heavens. She receives and pours the soul’s essence, inhaling the five-colored qi of the egg-yolk within the mouth.\n\nRegularly rinse the mouth, inside and out, above and below. With the tongue, draw in the solar qi and the five-colored saliva, filling the mouth before swallowing. Visualize the saliva descending into the Mystic Woman’s mouth. Repeat this five times, then click the teeth thrice and softly intone:\n\n*\"Jade Purity on high, Nine Heavens and Nine Numinous Ones,\nGoverned in the Mystic Mystic, descending into the stomach’s clarity.\nGold harmonizes with jade’s radiance, first born from emptiness—\nNamed ‘Pure Ring,’ styled ‘Luminous Essence.’\nRefining the hun and restraining the po, the heart opens and the spirit brightens.\nIngesting the Zi-day’s sustenance, golden splendor fills to abundance.\"*\n\nAfter a long while, conclude the practice. Wipe the eyes fourteen times with the hands, then rub the hands together and massage the face, brows, eyes, temples, and hairline until warmth suffuses them, as if gently steamed.\n\nThis is the Supreme’s method of ingesting the qi of the Three, Five, Seven, and Nine, the Mystic Root of the Zi-day.\n\n---\n\n**Ode by Lady Wang of the Purple Tenuity**\n\nGaze upon the Grand Aurora Palace,\nWhere golden portals gleam in Purple Clarity.\nThe immortal chambers reflect the Primal Simplicity,\nFour casements all of crimson jasper.\n\nTossing wheels across the boundless ford,\nReining steeds to dance in emerald carriages.\nJade blossoms unfurl cloud-canopies,\nWestern consorts unfurl brocade banners.\n\nSuddenly descending amid the dust’s murk,\nSwiftly alighting in the courtyard of a fair one.\nLong-awaited resonance answers the destined hour—\nWhat is gained already dwells in mystery.\n\nRiding the wind, we soar through the Nine Empyreans,\nTogether sipping the cinnabar bloom’s essence.\nTurning from worldly things, we part—\nHow could they know the numinous void’s spirit?\n\nNorthward we ascend the Gate of Mystic Darkness,\nHand in hand, weaving the lofty net.\nIncense smoke scatters the Eight Sceneries,\nMystic winds stir the crimson waves.\n\nGazing upward, we cross the Coral Ford;\nLooking down, we survey the winding valleys.\nJade whistles sing above the clouds,\nPhoenixes cry through the Nine Distances.\n\nRiding qi, we float in the Great Void—\nWhy tread upon mountains and rivers?\nWith golden tablets, we summon feathered spirits,\nConquering peaks to crush lofty demons.\n\nRinsing and imbibing the round dawn’s glow,\nAccumulating eons like an infant’s teeth.\nAmid the clamor of the world’s striving,\nThey know not what to do.\n\n*The Scripture of the Hundred Inner Names of the Gods of the Nine Heavens of the Supreme Clarity is now complete.*",
      "overlap_context": "me Constancy upon the Nine Heights—\nHeaven’s fan scatters; the plain and subtle grow dark.\nExtending the wheel and returning the carriage, the high assembly in the Jade Court—\nFeathered skirts and brocade robes, flowing bells and chiming flutes—\nDragon crowns and phoenix blossoms, following the clouds in carefree roaming—\nDark and vast, equal to the dawn; heart cavernous, body distant.\nThe Great Cavern’s Jade Canon stirs my Nine Darks—\nAscending above the sun and moon, the Jade Grove’s branches.",
      "start_char": 2629,
      "end_char": 3357,
      "start_sentence": 77,
      "end_sentence": 108,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.50844693183899,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清九天上帝祝百神内名经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}