{
  "source_id": "上清太极真人撰所施行秘要经",
  "source_file": "chunked_daozang\\上清太极真人撰所施行秘要经.json",
  "total_chunks": 4,
  "total_original_chars": 2399,
  "total_translated_chars": 14053,
  "total_translation_time": 71.25806832313538,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\上清太极真人撰所施行秘要经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Esoteric Essential Scripture Compiled by the Supreme Clarity Perfected One of the Great Ultimate**\n\n**Scripture Title:** *The Esoteric Essential Scripture Compiled by the Supreme Clarity Perfected One of the Great Ultimate*. The compiler is unknown, likely dating to the mid-Eastern Jin period. It is a compilation of early Supreme Clarity School cultivation methods and oral instructions. Its contents also appear in *Declared Realities* (卷九). One scroll. Base text from *Daoist Canon of the Orthodox Tradition*, First Section.\n\n---\n\n### *The Esoteric Essential Scripture Compiled by the Supreme Clarity Perfected One of the Great Ultimate*\n\nThe *Scripture of the Great Plain and Cinnabar Radiance* states:\nUpon the face, one should frequently rub with both hands until warm, following the contours of the features in all directions until thoroughly covered. This will lend the face a luminous glow, preventing wrinkles and blemishes. Practiced for five years, the complexion will resemble that of a maiden. This is what is meant by \"the qi of mountains and rivers, ever full and never depleted.\"\n\nFirst, rub the hands until warm, then use them to wipe the face and eyes. Next, stroke the hair with the hands as if combing it. Alternately massage the two kidneys to prevent the hair from whitening and the vessels from floating outward.\n\nThe above passage is from the middle scroll of the *Scripture of Cinnabar Radiance*.\n\nThe *Massage Chapter of the Essence and Radiance of the Great Cavern Scripture* states:\nUpon rising from sleep, sit upright and regulate the breath. First, clasp the hands and place them behind the neck, then tilt the head back to gaze upward, causing the neck to strain against the hands. Repeat this three or four times to harmonize the essence and circulate the blood, preventing the intrusion of pathogenic winds. Long practice ensures freedom from illness and death.\n\nAfterward, bend and stretch the body, extend the limbs to their utmost, arch backward, and twist to the sides, shaking and loosening all joints—each movement performed three times. These are the oral instructions.\n\nUpon rising, first use a handkerchief or thick cloth to wipe the neck on all sides and behind the ears until thoroughly warmed. Then, stroke the hair and massage the neck as if combing without ceasing. After a while, rub the hands and treat the face and eyes. Long practice sharpens the vision, repels pathogenic qi, prevents bodily filth and greasiness, and dispels impurities.\n\nWhen finished, swallow saliva thirty times to guide the inner fluids.\n\nThe above passage is from the upper scroll of the *Scripture of the Essence and Radiance of the Great Cavern*.\n\nThe *Highest Inner Chapters of the Great Cavern Scripture*’s *Great Incantation for Suppressing Evil* states:\nWhenever traversing perilous paths, passing through ghostly shrines, or encountering places of doubt or subtle taboo, or when the mind harbors slight apprehension about the journey ahead, first press the tongue against the inner upper palate and swallow saliva three times. Then, with the second and third fingers of the left hand, pinch the base of the philtrum beneath the nostrils—where the nasal septum meets the inner cavity—thirty-six times. Press firmly without lifting the fingers to count.\n\nThe area between the nostrils is called the *Mountain Source*. It is also named the *Ghost Well*, the *Divine Pool*, the *Root of Evil*, and the *Terrace of the Hun-soul*.\n\nAfter pinching, knock the teeth together seven times, then advance the palm to cover the nose. Close the eyes slightly and recite the incantation:\n*\"The Vermilion Bird soars through the heavens, its divine might inwardly expanding. The Four Pillars of the Mountain Source stand firm; the Ghost Well flees in terror. The Divine Pool exhales its breath; the Root of Evil hides in submission. The Terrace of the Hun-soul shines in fourfold brilliance; the Jade Chamber resounds with tinkling jade. The Jade Perfected stands majestic, seated in the Hall of Light. Hands wave the purple auroras; the head wears the radiance of dawn. Reciting the thirty-nine chapters of the Cavern Scripture, within are the dragon and tiger that repel evil, severing mountains and cleaving hardness. Fierce beasts and charging oxen, bearing blades and swallowing blades. Lifting mountains and overturning heavens, the divine birds and poisonous dragons. Six leaders spew fire, devouring the King of Ghosts. The lightning essence and thunder father, seizing stars and scattering meteors. Owls and monstrous creatures, scorching and blazing, moving against the wind. Heavenly birds arrayed in ranks, all stand beside me. Spewing fire ten thousand fathoms long to dispel misfortune. The host of perfected beings open the Dao, sealing off the mountain villages. A thousand spirits and a hundred numina, all bow their heads in reverence. The marsh marshals hold censers, burning incense for me. Wherever I go, the myriad spirits welcome me.\"*\n\nWhen finished, knock the teeth together three more times, then slowly open the eyes and withdraw the left hand.\n\nPressing the *Mountain Source* closes the gate of the *Ghost Well*; grasping the *Divine Pool* scatters the *Root of Evil*; covering the *Terrace of the Hun-soul* stations the *Jade Perfected* at the pass. Thus, the numinous root is stirred, celestial beasts come to guard, and a thousand spirits tremble in submission, unable to invade my qi. This is the natural principle, causing it to be so in an instant.\n\nThe *Mountain Source* beneath the nose is the martial ford of the body, the thoroughfare of the true and the evil. For those not true, it generates pathogenic qi; for those who are true, it suppresses the myriad evils. It lies within my control and regulation, hence the omens of fortune and misfortune manifest here.\n\nThe *Hall of Light* is also the body’s pool, the dwelling of life and death. Preserving its spirit allows inner contemplation to become boundless; abandoning its Dao leads to decay and putrefaction. Thus, life and death, regret and remorse are determined by my mastery and compliance with its art.\n\nThe above passage is from the first chapter of the *Highest Inner Chapters of the Great Cavern Scripture*.\n\nThe *Inner Methods of the Red Lord of the Southern Marchmount, Perfected One of the Great Void*, state:\nOn the fifth night of the lunar month at midnight, visualize the image of the sun within the heart, as if the sun enters through the mouth. Let it illuminate the interior of the heart, merging its light with the sun. When the heart feels warm and a rosy radiance appears as verification, recite the incantation:\n*\"The Great Luminance nurtures essence; within, the cinnabar heart is refined. Light and brilliance merge; the divine and the true come to seek me.\"*\n\nThen swallow saliva nine times. Repeat this practice on the fifteenth, twenty-fifth, and twenty-ninth days of the month.\n\nThis method sharpens hearing and perception, brightens all joints, lends the face the luster of jade, and the body the sheen of gold. Practiced for fifteen years, the Great One will dispatch a jeweled chariot to welcome you, ascending to the Great Empyrean.\n\nThe practice should be frequent, not limited to these specific days.\n\nThe above passage is from the middle section of the *Scripture of the Supreme One for Dispelling Demons*.\n\nThe *Scripture of the Supreme One for Dispelling Demons and Numinous Spirits* states: If the body feels unwell, press the tongue against the throat, gargle with saliva, and swallow it repeatedly. After a short while, the discomfort will naturally dissipate. In ordinary times, one should also feel the body relaxed and supple.\n\nThe above passage is from the *Preface to the Scripture of Dispelling Demons and Numinous Spirits*.\n\nThe *Upper Chapter of the Scripture of Dispelling Demons* states: Frequently press and massage the ears on both sides, without limit, to sharpen hearing. This is called \"tending the city walls,\" and one’s name will be inscribed in the imperial registry.\n\nIt further states: Frequently press and massage the nose on both sides, without limit, to harmonize the qi. This is called \"irrigating the Central Peak,\" and one’s name will be inscribed in the celestial records.\n\nThese two methods were transmitted by Lady Li of the Illuminating Terrace of the Square Zhang.\n\nThe *Scripture of the Supreme One on Halting Hair and Flourishing Splendor* prescribes a massage method: At the time of vital qi, swallow saliva fourteen times, then press the painful area of the body while facing the ruler and recite the incantation:\n*\"Left mystery, right mystery, the Three Spirits unite in perfection. Left yellow, right yellow, the Six Splendors align. Wind-qi and malign illnesses hide in the four directions. Jade liquid flows with luster, circulating above and below. Within, dispatch water and fire; without, ward off misfortune. Ascend to immortality and flying transcendence, the body ever at ease and strong.\"*\nAfterward, swallow saliva fourteen times again. Practice this regularly to remain free of illness. Press the painful area thirty-one times in succession.\n\nThe above passage was transmitted by Lady Wang of the Right Radiance of the Cloudy Forest Palace.\n\nThe *Scripture of the Three and Five in Harmony with the Purple Script* states: When seated, keep the eyes closed and inwardly visualize the five viscera and intestines. With prolonged practice, they will naturally become distinct and clear.\n\nThe *Scripture of the Red Characters on Stone* states: Frequently cover the mouth and nose with the hands, exhale gently with the eyes closed, and after some time, saliva will form in the palms. Use it to massage the face. Regular practice will make the body fragrant.\n\nThe *Method of Inner Vision from the Purple Radiance of Blazing Light* states: Keep the eyes closed and sit upright, exhaling gently as if in repose, so that others do not notice. Then inwardly gaze and listen to the four directions, directing the ears and eyes to ten thousand *li* beyond. With prolonged practice, one will naturally perceive events at that distance. Focus the mind intently, and one may see a hundred thousand *li* beyond. The ears will also constantly hear the sounds of gold, jade, and silk strings—this is a wondrous method. The \"four directions\" are a general term; begin by focusing on one direction, then inwardly direct vision and hearing. At first, there may be no sign of success, but with time, one will naturally enter the marvelous.\n\nThe *Scripture of the Three Celestial Passes* states: Frequently press the corners of the eyes near the nose with the hands, holding the breath while doing so. Stop when the qi flows smoothly, then begin again. Regular practice will enable penetrating vision.\n\nThe above four passages were commanded for use by the Mysterious Master.\n\nThe *Record of the Supreme Ultimate* states: When combing the hair, face the direction of the king’s land. At the beginning of grooming, softly recite the incantation: *\"Mud-pellet’s mysterious blossom, preserve essence and ensure its enduring presence. On the left, the hidden moon; on the right, the sun’s root. The Six Harmonies purified, the hundred spirits receive grace.\"* After reciting, swallow saliva three times. Regular practice will prevent hair loss and promote daily growth. Frequently change combs, using those with many teeth, ensuring no pain; one may also have an attendant comb the hair thoroughly. Thus, blood and fluids will flow unobstructed, and the hair roots will remain firm.\n\nThe above passage was commanded for use by An Jiuhua.\n\nThe *Scripture of Orthodox Unity and Peace* states: Perform prostrations while holding the breath, causing the hundred ghosts to tremble in fear. The Merit-Officials, the Dragon and Tiger Lords, may then appear and converse. This refers to those who practice with focused mind and enduring dedication. It further states: When burning incense, do not look back, for doing so disrupts the true qi and invites demonic responses. When entering the oratory door, first step forward with the right foot, then bring the left foot forward to align with it. Once inside, proceed as usual, allowing one’s petitions to ascend and be heard. It also states: When partaking in meals, do not speak of the dead, nor expose food, lest it attract hordes of malevolent qi. It further states: Bathe frequently, and on each *jiazi* day, one should wash the hair; if not, then at the start of each month, to enable communion with spirits. Bathing is not troublesome in itself—only that people often fail to do so, cleansing the corpse’s stench while the true qi has yet to enter.\n\nThe above passage was commanded for use by the Primordial Master.\n\nThe *Scripture of the Supreme Nine Transformations and Ten Transmutations for Renewal* states: If one treads upon filth or any unclean place, one should bathe and wash to dissolve the form and dispel it. The method involves ten *liang* of bamboo leaves and four *liang* of peeled white peach bark, boiled in one *hu* and two *dou* of clear water in a cauldron until it boils white. Adjust to a suitable temperature, then bathe the body, and all filth will vanish. This not only removes impurities but also prevents damp impediment, sores, and itching. Moreover, bamboo is hollow and pure within, while peach repels evil and severs filth. Thus, these two substances are used to dissolve the turbidity within the body. When celestial beings descend and return, they invariably use this water to cleanse themselves. Even the common talismanic waters, incantations, and rinses of the world cannot compare to this method. Bathing with it is even better, though this water should not be used for washing the hair. The refined essence for purifying the corpse is precisely suited for bathing. Truly wondrous and secret.\n\nThe above passage was commanded for use by Lady Wang of Purple Tenuity.\n\nThe *Esoteric Essentials of Practice* as Composed by the Supreme Clarity Perfected One of the Great Ultimate, Here Concluded.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清太极真人撰所施行秘要经 经名：上清太极真人撰所施行秘要经。 撰人不详，约出於东晋南期。 系纂集早期上清派修行经诀而成。 内容又见《真诰》卷九。 一卷。 底本出处：《正统道藏》正一部。 上清太极真人撰所施行秘要经 《太素丹景经》曰：一面之上，常欲得两手摩拭之，使热，高下随形，皆使极匝，令人面有光泽，皱斑不生，行之五年，色如少女。 所谓山川行气，常盈不没。 先当摩两手令热，然后以拭面目毕，又顺手摩发，如理栉之状。 两肾亦更互以手摩之，使发不白，脉不浮外。 右一条出《丹景经》中卷。 《大洞真经精景按摩篇》曰：卧起当平气正坐，先叉两手，乃度以掩项后，因仰面视上，使项与两手争，为之三四止，使人精和血通，风气不入，能久行之，不死不病。 毕，又屈动身体，伸手四极，反张侧掣，宣摇百关，为之各三。 此当口诀。 卧起先以手巾若厚帛，拭项中四面及耳后，使圆匝热，温温然也。 顺发摩颈，若栉理之无度也。 良久，摩两手以治面目，久行之使人目明，而邪气不干，形体不垢腻，去秽也。 都毕，乃咽液三十过，以导内液。 右一条出《大洞精景经》上卷。 《大洞真经高上内章》遏邪大祝上法曰：每当经危险之路，鬼庙之间，意中诸有疑难之处，心将有微忌，劲所经履者，乃当先反舌内面，咽液三过毕，以左手第二、第三指捻两鼻孔下人中之本，鼻中隔孔之内际也，三十六过。 即手急按，勿举指计数也。 鼻中隔之际，名曰山源。 山源者，一名鬼井，一名神池，一名邪根，一名魂台也。 捻毕，因叩齿七通毕，又进手心以掩鼻，於是临目，乃微祝曰： 朱鸟凌天，神威内张，山源四镇，鬼井逃亡，神池吐气，邪源伏藏，魂台四明，琼房玲琅，玉真巍峨，坐镇明堂，手挥紫霞，头戴晨光，执咏洞经，三十九章，中有辟邪龙虎，截岳斩刚，猛兽奔牛，衔刀吞镶，揭山镬天，神雀毒龙，六领吐火，啖鬼之王，电精雷父，掣星流横，枭磕驳灼，逆风横行，天禽罗陈，皆在我傍，吐火万丈，以除不祥，群真启道，封落山乡，千神百灵，并手叩颡，泽尉捧炉，为我烧香，所在所经，万神奉迎。 毕，又叩齿三通，乃开目，徐去左手。 手按山源则鬼井闭门，手抟神池则邪根散分，手临魂台则玉真守关，於是感激灵根，天兽来卫，千精震伏，莫干我气，此自然之理，使忽尔而然也。 鼻下山源，是一身之武津，真邪之通府，不真者所以生邪气，为真者所以遏万邪，在我运摄之耳，故吉凶兆焉。 明堂中亦一身之池，死生之形宅，存其神可以渺兮内观，废其道所以致乎朽烂，故由我御顺其术，而死生悔吝定焉。 右一条出大洞真经高上首章。 太虚真人南岳赤君内法曰：以月五日夜半，存日象在心中，日从口入也。 使照一心之内，与日共光，相合会毕，当觉心暖，霞晖映验，良久乃祝曰： 太明育精，内练丹心，光辉合映，神真来寻。 毕，咽液九过。 到十五日、二十五日、二十九日，复作如上。 使人开明听察，百关鲜彻，面有玉光，体有金泽，行之十五年，太一遣宝车来迎，上登太霄。 行之务欲数，不必此数日也。 右一条出《太上消魔经》中。",
      "translated_text": "**The Esoteric Essential Scripture Compiled by the Supreme Clarity Perfected One of the Great Ultimate**\n\n**Scripture Title:** *The Esoteric Essential Scripture Compiled by the Supreme Clarity Perfected One of the Great Ultimate*. The compiler is unknown, likely dating to the mid-Eastern Jin period. It is a compilation of early Supreme Clarity School cultivation methods and oral instructions. Its contents also appear in *Declared Realities* (卷九). One scroll. Base text from *Daoist Canon of the Orthodox Tradition*, First Section.\n\n---\n\n### *The Esoteric Essential Scripture Compiled by the Supreme Clarity Perfected One of the Great Ultimate*\n\nThe *Scripture of the Great Plain and Cinnabar Radiance* states:\nUpon the face, one should frequently rub with both hands until warm, following the contours of the features in all directions until thoroughly covered. This will lend the face a luminous glow, preventing wrinkles and blemishes. Practiced for five years, the complexion will resemble that of a maiden. This is what is meant by \"the qi of mountains and rivers, ever full and never depleted.\"\n\nFirst, rub the hands until warm, then use them to wipe the face and eyes. Next, stroke the hair with the hands as if combing it. Alternately massage the two kidneys to prevent the hair from whitening and the vessels from floating outward.\n\nThe above passage is from the middle scroll of the *Scripture of Cinnabar Radiance*.\n\nThe *Massage Chapter of the Essence and Radiance of the Great Cavern Scripture* states:\nUpon rising from sleep, sit upright and regulate the breath. First, clasp the hands and place them behind the neck, then tilt the head back to gaze upward, causing the neck to strain against the hands. Repeat this three or four times to harmonize the essence and circulate the blood, preventing the intrusion of pathogenic winds. Long practice ensures freedom from illness and death.\n\nAfterward, bend and stretch the body, extend the limbs to their utmost, arch backward, and twist to the sides, shaking and loosening all joints—each movement performed three times. These are the oral instructions.\n\nUpon rising, first use a handkerchief or thick cloth to wipe the neck on all sides and behind the ears until thoroughly warmed. Then, stroke the hair and massage the neck as if combing without ceasing. After a while, rub the hands and treat the face and eyes. Long practice sharpens the vision, repels pathogenic qi, prevents bodily filth and greasiness, and dispels impurities.\n\nWhen finished, swallow saliva thirty times to guide the inner fluids.\n\nThe above passage is from the upper scroll of the *Scripture of the Essence and Radiance of the Great Cavern*.\n\nThe *Highest Inner Chapters of the Great Cavern Scripture*’s *Great Incantation for Suppressing Evil* states:\nWhenever traversing perilous paths, passing through ghostly shrines, or encountering places of doubt or subtle taboo, or when the mind harbors slight apprehension about the journey ahead, first press the tongue against the inner upper palate and swallow saliva three times. Then, with the second and third fingers of the left hand, pinch the base of the philtrum beneath the nostrils—where the nasal septum meets the inner cavity—thirty-six times. Press firmly without lifting the fingers to count.\n\nThe area between the nostrils is called the *Mountain Source*. It is also named the *Ghost Well*, the *Divine Pool*, the *Root of Evil*, and the *Terrace of the Hun-soul*.\n\nAfter pinching, knock the teeth together seven times, then advance the palm to cover the nose. Close the eyes slightly and recite the incantation:\n*\"The Vermilion Bird soars through the heavens, its divine might inwardly expanding. The Four Pillars of the Mountain Source stand firm; the Ghost Well flees in terror. The Divine Pool exhales its breath; the Root of Evil hides in submission. The Terrace of the Hun-soul shines in fourfold brilliance; the Jade Chamber resounds with tinkling jade. The Jade Perfected stands majestic, seated in the Hall of Light. Hands wave the purple auroras; the head wears the radiance of dawn. Reciting the thirty-nine chapters of the Cavern Scripture, within are the dragon and tiger that repel evil, severing mountains and cleaving hardness. Fierce beasts and charging oxen, bearing blades and swallowing blades. Lifting mountains and overturning heavens, the divine birds and poisonous dragons. Six leaders spew fire, devouring the King of Ghosts. The lightning essence and thunder father, seizing stars and scattering meteors. Owls and monstrous creatures, scorching and blazing, moving against the wind. Heavenly birds arrayed in ranks, all stand beside me. Spewing fire ten thousand fathoms long to dispel misfortune. The host of perfected beings open the Dao, sealing off the mountain villages. A thousand spirits and a hundred numina, all bow their heads in reverence. The marsh marshals hold censers, burning incense for me. Wherever I go, the myriad spirits welcome me.\"*\n\nWhen finished, knock the teeth together three more times, then slowly open the eyes and withdraw the left hand.\n\nPressing the *Mountain Source* closes the gate of the *Ghost Well*; grasping the *Divine Pool* scatters the *Root of Evil*; covering the *Terrace of the Hun-soul* stations the *Jade Perfected* at the pass. Thus, the numinous root is stirred, celestial beasts come to guard, and a thousand spirits tremble in submission, unable to invade my qi. This is the natural principle, causing it to be so in an instant.\n\nThe *Mountain Source* beneath the nose is the martial ford of the body, the thoroughfare of the true and the evil. For those not true, it generates pathogenic qi; for those who are true, it suppresses the myriad evils. It lies within my control and regulation, hence the omens of fortune and misfortune manifest here.\n\nThe *Hall of Light* is also the body’s pool, the dwelling of life and death. Preserving its spirit allows inner contemplation to become boundless; abandoning its Dao leads to decay and putrefaction. Thus, life and death, regret and remorse are determined by my mastery and compliance with its art.\n\nThe above passage is from the first chapter of the *Highest Inner Chapters of the Great Cavern Scripture*.\n\nThe *Inner Methods of the Red Lord of the Southern Marchmount, Perfected One of the Great Void*, state:\nOn the fifth night of the lunar month at midnight, visualize the image of the sun within the heart, as if the sun enters through the mouth. Let it illuminate the interior of the heart, merging its light with the sun. When the heart feels warm and a rosy radiance appears as verification, recite the incantation:\n*\"The Great Luminance nurtures essence; within, the cinnabar heart is refined. Light and brilliance merge; the divine and the true come to seek me.\"*\n\nThen swallow saliva nine times. Repeat this practice on the fifteenth, twenty-fifth, and twenty-ninth days of the month.\n\nThis method sharpens hearing and perception, brightens all joints, lends the face the luster of jade, and the body the sheen of gold. Practiced for fifteen years, the Great One will dispatch a jeweled chariot to welcome you, ascending to the Great Empyrean.\n\nThe practice should be frequent, not limited to these specific days.\n\nThe above passage is from the middle section of the *Scripture of the Supreme One for Dispelling Demons*.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1223,
      "start_sentence": 0,
      "end_sentence": 39,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.628037452697754,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太极真人撰所施行秘要经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "《消魔上灵经》曰：若体中不宁，当反舌塞喉，嗽津咽液无数，须臾，不宁之痾自即除也。 平时亦当觉体中宽软也。 右一条出消魔上灵叙中。 《消魔经上篇》曰：耳欲得数按抑其左右，亦令无数，令人聪彻。 所谓营治城郭，名书皇籍。 又曰：鼻亦欲数得按其左右，唯令无数，令人气平。 所谓灌溉中岳，名书帝录。 右此二法，方丈台照灵李夫人出用。 《太上录停发华经》上按摩法：常以生气时，咽液二七过毕，按体所痛处，向王而咒曰： 左玄右玄，三神合真，左黄右黄，六华相当，风气恶疾，伏匿四方，玉液流泽，上下宣通，内遣水火，外辟不祥，长生飞仙，身常休强，毕，又咽液二七过。 常如此，则无疾。 又当急按所痛处三十一过。 右一条沧浪云林宫右英王夫人所出。 《丹字紫书三五顺行经》曰：坐常欲闭目内视，存见五藏肠胃，久行之，自得分明了了也。 《石景赤字经》曰：常能以手掩口鼻，临目微气，久许时，手中生液，用以摩面目。 常行之，使人体香。 《紫度炎光内视中方》曰：常欲闭目而临，安身微气，使如卧状，令傍人不觉也。 乃内视远听四方，令我耳目注万里之外，久行之，尔自见万里之外事，精心为之，乃见百万里之外事也。 又耳中亦常闻金玉之音，丝竹之声，此妙法也。 四方者，总其言耳，当先起一方，而内注视听。 初为之，实无仿髴，久久诚自入妙。 《太上天关三图经》曰：常欲以手按目近鼻之两眦，闭气为之，气通辄止，终而复始。 常行之，眼能洞视。 右四条，玄师所勑用。",
      "translated_text": "The *Scripture of the Supreme One for Dispelling Demons and Numinous Spirits* states: If the body feels unwell, press the tongue against the throat, gargle with saliva, and swallow it repeatedly. After a short while, the discomfort will naturally dissipate. In ordinary times, one should also feel the body relaxed and supple.\n\nThe above passage is from the *Preface to the Scripture of Dispelling Demons and Numinous Spirits*.\n\nThe *Upper Chapter of the Scripture of Dispelling Demons* states: Frequently press and massage the ears on both sides, without limit, to sharpen hearing. This is called \"tending the city walls,\" and one’s name will be inscribed in the imperial registry.\n\nIt further states: Frequently press and massage the nose on both sides, without limit, to harmonize the qi. This is called \"irrigating the Central Peak,\" and one’s name will be inscribed in the celestial records.\n\nThese two methods were transmitted by Lady Li of the Illuminating Terrace of the Square Zhang.\n\nThe *Scripture of the Supreme One on Halting Hair and Flourishing Splendor* prescribes a massage method: At the time of vital qi, swallow saliva fourteen times, then press the painful area of the body while facing the ruler and recite the incantation:\n*\"Left mystery, right mystery, the Three Spirits unite in perfection. Left yellow, right yellow, the Six Splendors align. Wind-qi and malign illnesses hide in the four directions. Jade liquid flows with luster, circulating above and below. Within, dispatch water and fire; without, ward off misfortune. Ascend to immortality and flying transcendence, the body ever at ease and strong.\"*\nAfterward, swallow saliva fourteen times again. Practice this regularly to remain free of illness. Press the painful area thirty-one times in succession.\n\nThe above passage was transmitted by Lady Wang of the Right Radiance of the Cloudy Forest Palace.\n\nThe *Scripture of the Three and Five in Harmony with the Purple Script* states: When seated, keep the eyes closed and inwardly visualize the five viscera and intestines. With prolonged practice, they will naturally become distinct and clear.\n\nThe *Scripture of the Red Characters on Stone* states: Frequently cover the mouth and nose with the hands, exhale gently with the eyes closed, and after some time, saliva will form in the palms. Use it to massage the face. Regular practice will make the body fragrant.\n\nThe *Method of Inner Vision from the Purple Radiance of Blazing Light* states: Keep the eyes closed and sit upright, exhaling gently as if in repose, so that others do not notice. Then inwardly gaze and listen to the four directions, directing the ears and eyes to ten thousand *li* beyond. With prolonged practice, one will naturally perceive events at that distance. Focus the mind intently, and one may see a hundred thousand *li* beyond. The ears will also constantly hear the sounds of gold, jade, and silk strings—this is a wondrous method. The \"four directions\" are a general term; begin by focusing on one direction, then inwardly direct vision and hearing. At first, there may be no sign of success, but with time, one will naturally enter the marvelous.\n\nThe *Scripture of the Three Celestial Passes* states: Frequently press the corners of the eyes near the nose with the hands, holding the breath while doing so. Stop when the qi flows smoothly, then begin again. Regular practice will enable penetrating vision.\n\nThe above four passages were commanded for use by the Mysterious Master.",
      "overlap_context": "the fifteenth, twenty-fifth, and twenty-ninth days of the month.\n\nThis method sharpens hearing and perception, brightens all joints, lends the face the luster of jade, and the body the sheen of gold. Practiced for fifteen years, the Great One will dispatch a jeweled chariot to welcome you, ascending to the Great Empyrean.\n\nThe practice should be frequent, not limited to these specific days.\n\nThe above passage is from the middle section of the *Scripture of the Supreme One for Dispelling Demons*.",
      "start_char": 1224,
      "end_char": 1840,
      "start_sentence": 40,
      "end_sentence": 63,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.901803731918335,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太极真人撰所施行秘要经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "《太极录经》曰：理发欲向王地，既栉发之始，而微祝曰： 泥丸玄华，保精长存，左为隐月，右为日根，六合清练，百神受恩。 咒毕，咽液三过。 能常行之，发不落而日生。 当数易栉，栉之取多，而不使痛，亦可令侍者栉取多也。 於是血液不滞，发根常坚。 右一条，安九华所告令施用。 《正一平经》曰：闭气拜靖，使百鬼畏惮，功曹使者龙虎君，可见与语。 谓能精心久行之耳。 又曰：烧香时勿反顾，反顾则忤真气，使致邪应也。 又曰：入靖户，先前右足着前，后进左足，令与右足齐。 毕，乃趣行如故，使人陈启通达上闻。 又曰：临食上，勿道死事，勿露食物，来众邪气。 又曰：数澡浴，每至甲子当沐，不尔当以几月旦，使人通灵。 浴不患数，患人不能耳，荡炼尸臭，而真气未入。 右一条，元师所勑使施用。 《太上九变十化易新经》曰：若履殗秽及诸不冷处，当洗澡浴盥，解形以除之。 其法用竹叶十两，桃皮削取白四两，以清水一斛二斗，於釜中煮之，令白沸出，适寒温，以浴形，即万殗消除也。 既以除殗，又辟湿痹疮痒之疾。 且竹虚素而内白，桃即却邪而折秽。 故用此二物，以消形中之滓浊也。 天人下游，既反，未曾不用此水以自荡也。 至於世间符水咒漱外含之近术，皆莫比於此方也。 若浴者益佳，但不用此水以沐耳。 炼尸之素浆，正宜以沐浴耳。 真奇秘也。 右一条，紫微王夫人所勑用。",
      "translated_text": "The *Record of the Supreme Ultimate* states: When combing the hair, face the direction of the king’s land. At the beginning of grooming, softly recite the incantation: *\"Mud-pellet’s mysterious blossom, preserve essence and ensure its enduring presence. On the left, the hidden moon; on the right, the sun’s root. The Six Harmonies purified, the hundred spirits receive grace.\"* After reciting, swallow saliva three times. Regular practice will prevent hair loss and promote daily growth. Frequently change combs, using those with many teeth, ensuring no pain; one may also have an attendant comb the hair thoroughly. Thus, blood and fluids will flow unobstructed, and the hair roots will remain firm.\n\nThe above passage was commanded for use by An Jiuhua.\n\nThe *Scripture of Orthodox Unity and Peace* states: Perform prostrations while holding the breath, causing the hundred ghosts to tremble in fear. The Merit-Officials, the Dragon and Tiger Lords, may then appear and converse. This refers to those who practice with focused mind and enduring dedication. It further states: When burning incense, do not look back, for doing so disrupts the true qi and invites demonic responses. When entering the oratory door, first step forward with the right foot, then bring the left foot forward to align with it. Once inside, proceed as usual, allowing one’s petitions to ascend and be heard. It also states: When partaking in meals, do not speak of the dead, nor expose food, lest it attract hordes of malevolent qi. It further states: Bathe frequently, and on each *jiazi* day, one should wash the hair; if not, then at the start of each month, to enable communion with spirits. Bathing is not troublesome in itself—only that people often fail to do so, cleansing the corpse’s stench while the true qi has yet to enter.\n\nThe above passage was commanded for use by the Primordial Master.\n\nThe *Scripture of the Supreme Nine Transformations and Ten Transmutations for Renewal* states: If one treads upon filth or any unclean place, one should bathe and wash to dissolve the form and dispel it. The method involves ten *liang* of bamboo leaves and four *liang* of peeled white peach bark, boiled in one *hu* and two *dou* of clear water in a cauldron until it boils white. Adjust to a suitable temperature, then bathe the body, and all filth will vanish. This not only removes impurities but also prevents damp impediment, sores, and itching. Moreover, bamboo is hollow and pure within, while peach repels evil and severs filth. Thus, these two substances are used to dissolve the turbidity within the body. When celestial beings descend and return, they invariably use this water to cleanse themselves. Even the common talismanic waters, incantations, and rinses of the world cannot compare to this method. Bathing with it is even better, though this water should not be used for washing the hair. The refined essence for purifying the corpse is precisely suited for bathing. Truly wondrous and secret.\n\nThe above passage was commanded for use by Lady Wang of Purple Tenuity.",
      "overlap_context": "focusing on one direction, then inwardly direct vision and hearing. At first, there may be no sign of success, but with time, one will naturally enter the marvelous.\n\nThe *Scripture of the Three Celestial Passes* states: Frequently press the corners of the eyes near the nose with the hands, holding the breath while doing so. Stop when the qi flows smoothly, then begin again. Regular practice will enable penetrating vision.\n\nThe above four passages were commanded for use by the Mysterious Master.",
      "start_char": 1841,
      "end_char": 2393,
      "start_sentence": 64,
      "end_sentence": 90,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.537554502487183,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太极真人撰所施行秘要经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "上清太极真人撰所施行秘要经竟",
      "translated_text": "The *Esoteric Essentials of Practice* as Composed by the Supreme Clarity Perfected One of the Great Ultimate, Here Concluded.",
      "overlap_context": " the turbidity within the body. When celestial beings descend and return, they invariably use this water to cleanse themselves. Even the common talismanic waters, incantations, and rinses of the world cannot compare to this method. Bathing with it is even better, though this water should not be used for washing the hair. The refined essence for purifying the corpse is precisely suited for bathing. Truly wondrous and secret.\n\nThe above passage was commanded for use by Lady Wang of Purple Tenuity.",
      "start_char": 2394,
      "end_char": 2411,
      "start_sentence": 91,
      "end_sentence": 91,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.1906726360321045,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太极真人撰所施行秘要经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}