{
  "source_id": "上清外国放品青童内文",
  "source_file": "chunked_daozang\\上清外国放品青童内文.json",
  "total_chunks": 24,
  "total_original_chars": 19287,
  "total_translated_chars": 120142,
  "total_translation_time": 642.1049423217773,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**Upper Clarity Scripture of the Released Grades of the Azure Lad from the Outer Realms**\n\n**Scripture Title:** *Upper Clarity Scripture of the Released Grades of the Azure Lad from the Outer Realms*. Author unknown, approximately dated to the Eastern Jin dynasty. A foundational scripture of the early Shangqing (Upper Clarity) tradition. Two scrolls.\n\n**Source:** *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n---\n\n### *Upper Clarity Scripture of the Released Grades of the Azure Lad from the Outer Realms, Scroll One*\n\n#### *The Hidden Primordial Writ of the Lofty One from the Celestial Realm*\n\nThe Supreme Perfected Jade Guardian King of Upper Clarity and the Grand Minister of State commanded the Master of Lofty Dawn, the Azure Lad of the Jade Gate of the Eastern Sea, to receive the *Hidden Primordial Writ of the Released Grades from the Outer Realms of the Supreme Jade Emperor*.\n\nThis Dao is most wondrous, born before the Nine Mysteries, forming the natural chapters of soaring dark-purple *qi*. Its numinous writ manifests marvels, shining brilliantly in Upper Clarity. After ninety thousand kalpas, it was inscribed upon the Green Jasper Realm’s Spirit Bird Mountain, set upon the Eastern Florescence’s cavern and the Dark Garden’s piled stones to the north. Its flowing radiance illumines the Great Void; sun and moon flank its glow. The Five Dawns bear its spirit; the Eight Simplicities intertwine. The Four Convergences weave mist; flying auroras veil the *qi*. The maidens of golden splendor and the lads of jade dawn—three hundred each—attend and guard the sacred writ.\n\nThe Heavenly Consorts waft incense; the numinous winds scatter truth. Flying dragons and coursing beasts array before the Jade Pass. Vermilion phoenixes preen their wings; divine simurghs shade the dark. The Western Florescence hosts its rites; ten thousand sages bow in the celestial court.\n\nOn the first day of the third month of the inaugural year of the Central August Era, at the hour when Heavenly Virtue aligns, the Azure Lad, Minister of the Uppermost, purified himself in the empty mountains. He swore a golden-green pact with Heaven and received from the Supreme One the writ. He traversed the Six Realms, trod the famed mountains, circled the Five Peaks, and walked the sources of all rivers. The Five Thearchs lent their wings; his numinous chariot descended. The hosts of the Ten Realms and the assembled sages feasted in the vast court. He explored the remote and obscure, grasped the formless, and channeled flowing essence to illumine the Dao. The Great Yang unleashed lightning to manifest its power. The Seven Primes coursed through the purple void; the Eight Effulgences reined their steeds to ascend and fly. He chanted the jade tones of the Outer Realms, releasing the divine grades into subtlety. He commanded the Five Elders to order their ranks and summoned the ten thousand perfected to gather. The Nine Numinous harmonized; the Three Radiant merged their splendor. The Cinnabar Numinous announced auspices; the Supreme One oversaw and reflected. His rank ascended to Upper Minister; his name was inscribed in the Purple Dawn. His body was clad in a nine-hued frost-silk robe; he wore the flowing, luminous, cavernous, primordial writ of the Radiant Effulgence. His crown, the Hundred-Transformations Numinous Treasure, bore cascading bells. Ninefold cinnabar clouds entwined him. The golden-florescence jade maidens and the purple-dawn lads—three thousand each—attended the Lord.\n\nThus, the Celestial Mystery sounded its rhythm; the mold of virtue responded to the true. He was entrusted with the transformation of the upper realms, governing the Nine Heavens, overseeing all under Heaven, and universally leading the ten thousand immortals. The registers of life and death—nothing, however minute, escaped his purview.\n\nThe Lord’s virtue was lofty, his Dao complete. He roamed the Jade Clarity, serene and luminous. The Seven Primes shone and scattered; the Five Elders attended his spirit. The Three Luminants flanked his radiance; the Nine Thearchs aligned their chariots. Flying mists formed a purple canopy; dark clouds arose in the void. Jade maidens raised their voices; the divine net resounded. Dragons intoned; phoenixes sang. The vast court swelled with celestial music. Auroras encircled the sun; flowing lightning quickened essence. Radiant lights intermingled; divine candles merged their brilliance. Alone, he wielded the tally of the numinous writ, his hand brandishing the banner to command demonic spirits. He wandered the Purple Clouds’ palace, lingered in the Azure Florescence’s chambers. He overawed the Six Heavens with his advent; he severed the myriad spirits from their hordes of malevolence. He gathered the later disciples upon golden tablets, collated the azure registers from all directions. He summoned the ten thousand thearchs to the winding script, expounded the precious formulas in the wondrous chapters. He unfolded the Nine Mysteries through the kalpas, unraveled the arcane to enlighten the benighted. He composed the *Standing Alone* to equal the perfected; he enforced the Four Poles to restrain transgressions. He commanded the Four Offices to execute punishments, empowered the Five Thearchs to correct wrongs. Universally, he governed the boundless. The Four Quarters, the Six Realms, the Five Peaks, and the famed mountains—myriad billions of perfected beings—all submitted to the Azure Palace and served the Upper Minister.\n\nSuch a treasure writ is the Supreme One’s chapter of mysterious emptiness, naturally formed. It gathers the soaring dark-purple *qi* into hidden writ, releasing the thirty-six tones of the Outer Realms’ grades. It establishes the Six Realms within the offices of the Five Elders, to be practiced by those of the Dao who fly as immortals. The jade tones are crystalline and clear; the wondrous meanings are subtle and profound. All manifest the rhythms of the Supreme August and the Primordial Mystery. The Four Convergences and Eight Reaches intertwine to form its sounds. Its true purport is difficult to fathom; its principles are hard to trace. Unless one is of the purple womb’s woven network, the jade treasury’s unobstructed freshness, and the nine apertures’ receptivity to the numinous, one cannot grasp its subtle rhythms or penetrate its jade tones.\n\nThe Supreme One guarded this secret closely. Thus, it was transmitted mouth to mouth. The Nine Heavens appointed the Left Assistant to hold the tally in the Immortal Capital. To the right, they placed the Jade Gentlemen Attendants and the Five Directions’ Numinous Officials—fifty thousand each—to safeguard the treasure writ. Jade lads and maidens held towels and attended incense. Dark numinous purple canopies scattered mist through the distant court. The assembled perfected shone brilliantly in Upper Clarity.\n\nThus, the Supreme Jade Emperor and all the sagely beings, on the eight seasonal days, ascend the jasper chambers to perform rites and chant the tones. The jade echoes ring clear, shaking the Nine Heavens.\n\nOn the day this writ is inscribed, the Five Stars emerge from their lodgings; the Seven Primes halt their radiance. The Five Thearchs float in their positions; the ten thousand immortals attend the court. A thousand demons lose their sight; hordes of devils extinguish their essence. His might subdues the Six Realms; countless domains are pacified. The divine and wondrous transformations defy description. Its gaze flows through a hundred million kalpas without fading; the great transformation renews itself ever anew. Its numinous excellence is towering and majestic, beyond naming.\n\nWhoever possesses this scripture has had their name inscribed in the imperial registers before their birth, destined to emerge as an immortal. Some celestial perfected descend to bestow this writ; others, through worldly karmic conditions, encounter a scripture master. Dreams echo with numinous responses; their spirit merges with the true. Having received the jade tones, one should burn incense in a secluded chamber, perform rites, and cultivate practice. Chanting it once summons the ten thousand perfected to gather; the Five Elders attend in form. Heavenly demons bow their heads; a thousand demons lose their essence. His might shakes the Six Realms; he summons immortals and draws the perfected near.\n\nAfter nine years, the Three Primes ascend to the celestial chambers, descending in cloud-borne chariots to soar through the Upper Clarity. Even if one possesses this scripture yet fails to cultivate its practice in the world, merely revering it with sincere devotion will summon twelve jade lads and twelve jade maidens to attend and guard one’s person, warding off the ten thousand calamities. They subdue weapons of war, and the thousand afflictions and myriad harms dare not rashly intrude. The Five Emperors stand guard, enabling one to attain the rank of lesser immortal. Alternatively, one may undergo bodily transformation and cyclic rebirth, ascending into the numinous chambers—though one may not yet assume office in the Jade Void or wander among the Three Clarities.\n\n**Thirty-Six Celestial Registers of the Six Realms**\n\nThe Five Directions of Heaven and Earth each possess governing hues of hardness and softness, preventing their dissolution. The earth extends twenty billion miles deep, where it receives moisture; beneath this moisture lies another twenty billion miles of golden millet marsh; below that, twenty billion miles of adamantine iron marsh; deeper still, twenty billion miles of watery marsh; descending eighty billion miles further, one reaches the great wind marsh; and five hundred twenty billion miles beyond that, the cosmic net sustains Heaven and Earth, ensuring they do not collapse—just as the sun, moon, and stars are upheld by the wind. Scholars who remain ignorant of the depths and hues beneath the earth will find the Five Emperors unable to extend their protection beyond the borders of foreign lands.\n\n**Eastern Realm: The Land of Fuyudai**\nBeyond ninety thousand miles to the easternmost extremity lies the Wasteland of Haolin, where the kingdom of Heluoti resides. Its land is perfectly round, its soil as fresh as azure rouge, devoid of mountains or hills, spanning nine hundred thousand miles in breadth. The people of this land stand two *zhang* tall and live four hundred years. The kingdom possesses six celestial registers, which the Supreme Highest established among the foreign Hu elders. The Supreme Highest often chants these registers to transform the Hu elders, revealing to them the teachings of immortality in foreign lands. If the people of this land observe rites and recite these registers, they attain a lifespan of four hundred years, free from premature death. Scholars who study the hues of foreign lands and constantly chant the six registers will summon the immortal officials of the Hu elders to guard their persons. After nine years, they naturally gain passage to the land of Heluoti, converse with the Hu elders, transform their bodies to fly through the air, and wander the easternmost realms.\n\n**The Six Registers of the Eastern Land of Heluoti:**\n1. First Register: *Chan Ayiti Nawei*\n2. Second Register: *Yue Jia Moxu Yunchi*\n3. Third Register: *Tan Zhen Shizhe Yuantuo*\n4. Fourth Register: *Gao Bojun Yun Wuzi*\n5. Fifth Register: *Xi Jin Lingfa Poyi*\n6. Sixth Register: *Sheliding Quni Tai*\n\nIn the land of Heluoti, the six registers are disseminated, and the titles of the Hu elders are established. Those who master them attain a lifespan equal to Heaven and Earth. By cultivating this Way, one summons the immortal officials of foreign lands to guard one’s person. On the days of the Great Year Star, one’s natal star, and the eight solar terms, one should inscribe the six registers in azure ink, recite them once while facing east, and knock the teeth nine times. Chant the six registers six times each, then close the eyes, compose the body, and settle the spirit. Abandon all stray thoughts and visualize the boundless eastern realm, the land of Heluoti, clearly and vividly. Envision countless Hu elder immortal officials arriving to pay homage, reciting the foreign registers. Then softly intone the prayer:\n\n*\"The bounds of Heaven and Earth unfold,\nEight directions shine in clarity,\nVast and boundless insight,\nThe names of foreign lands,\nCelestial registers transform through sound,\nQi coalesces into spirit,\nSummoning immortals and drawing the perfected near,\nMyriad hosts gather as one,\nTracing the subtle and profound,\nMirroring the formless,\nAbove and below resound in harmony,\nWithin and without grow solemn and pure,\nAzure mists and flying wheels\nCome to aid my form,\nBearing me aloft,\nTo the northern audience in the Jade Capital.\"*\n\nConclude by swallowing the qi nine times. This is the supreme method of the celestial registers of foreign lands, a practice of divine immortals. After nine years of cultivation, one summons immortal officials, gains spiritual insight into the subtle, communicates with the divine, and ascends into the void to rise to Heaven in broad daylight.\n\n**Southern Realm: The Land of Yanfuli**\nBeyond three hundred thousand miles to the southernmost extremity lies the Radiant Yang Wilderness, where the kingdom of Yishata resides. Its land is vast and level, without elevation or depression, its soil crimson, spanning eight hundred ten thousand miles in breadth. The people of this land stand two *zhang* and four *chi* tall and live three hundred sixty years. The kingdom possesses six celestial registers, which the Supreme Highest established among the foreign Yue elders. The Supreme Highest often chants these registers to transform the Yue elders, revealing to them the teachings of immortality in their land. If the people of this land observe rites and recite these registers, they attain a lifespan of three hundred sixty years, free from premature death. Scholars who study the hues of foreign lands and constantly chant the six registers will summon the immortal officials to guard their persons. After nine years, they naturally gain passage to the land of Yishata, converse with the Yue elders, transform their bodies within the vermilion palace, and soar through the southern yang realms.\n\n**The Six Registers of the Southern Land of Yishata:**\n1. First Register: *Nan Weina Xihan Luo*\n2. Second Register: *Huan Molan Yulan Bo*\n3. Third Register: *Le Feng Le Yuming Sha*\n4. Fourth Register: *Hui Su Jie Qi Feituo*\n5. Fifth Register: *Gen Zhi Sui Bai Wuhe*\n6. Sixth Register: *Ying Chong Du Xuan Jingche*\n\nIn the land of Yishata, the six registers are disseminated, and the titles of the Yue elders are established. Those who master them attain a lifespan equal to Heaven and Earth. By cultivating this Way, one summons the flying immortal officials of foreign lands to guard one’s person. On the days of the Great Year Star, one’s natal star, and the eight solar terms, inscribe the six registers in vermilion ink, enter a chamber, face south, and recite them. Knock the teeth nine times and chant the six registers six times each.\n\nWhen finished, close the eyes to settle the spirit and stabilize the qi, casting aside all stray thoughts. Visualize the boundless, infinite realm of the southern direction, its clarity and luminosity fully revealed. Envision the countless Yue elders and immortal officials arriving to attend one’s person. Then softly recite the incantation:\n\n*\"Lofty numina descend their radiance,\nScattering transformation through the Vermilion Palace.\nThe flowing tones of the six registers\nCongeal into a cinnabar countenance.\nHosts of immortals arrive in audience,\nPaired with the true mandate in duality.\nPenetrating vision of the Eight Luminaries,\nEyes behold the Flowering Chamber.\nDivided effulgences ascend to the Upper Clarity,\nEmerging from azure, entering into yellow.\nFive-hued streaming essences\nBecome my luminous light.\nI roam the Six Lands,\nAscend to the Jade Hall,\nReceive the immortal Dharma robes,\nFly in azure feathered garments,\nGirded with flowing gold and intertwining sashes,\nAdorned with phoenix-script purple insignia.\nAttaining unity with the Emperor in truth,\nMy form shines in the Jade Capital.\"*\n\nWhen finished, swallow the qi nine times and cease.\n\nPracticing this for nine years will summon the Yue elders and immortal officials of the southern lands to guard and attend one’s form. They will perceive the hidden and fathom the void, conversing with the spirits. Flying clouds and dark dragons will descend to welcome the adept.\n\n---\n\n**The Land of Junayi in the West**\nBeyond seventy myriad li to the farthest reaches of the west lies the White Mound, the land of Junayi. Its register is inscribed as the *Niviro Lǔnā* nation. The terrain is marked by towering mounds, bordering the Western Gate of Heaven. The earth’s hue is white as jade, spanning sixty-eight myriad li in breadth. Its people stand sixteen feet tall and live for six hundred years. The land possesses six register tones, which are the exalted teachings bestowed upon the Di elders of foreign lands. The exalted ones constantly chant and sing these tones to transform the Di elders, revealing to them the land’s teachings of deathlessness. If the people of this land all perform rites and recite these tones, they attain a lifespan of six hundred years, free from premature death. Scholars who know the earth’s hues of foreign lands and constantly chant, recite, and cultivate these practices will naturally summon the Di elders and immortal officials to guard their persons. After nine years, they will effortlessly journey to the land of *Niviro Lǔnā*, converse with the Di elders, and soar through the void, frolicking in the White Mound.\n\n**The Six Registers of the Western Land of Niviro Lǔnā:**\n1. First Register: *Tayī Āsēnhēgēn*\n2. Second Register: *Jīnluó Guójiā Móqiān*\n3. Third Register: *Póyī Nífàn Bǎozhēn*\n4. Fourth Register: *Líkuí Tílán Pózhēn*\n5. Fifth Register: *Shìfēn Nàmào Lǜchén*\n6. Sixth Register: *Tíwò Shārù Huátián*\n\nIn the land of *Niviro Lǔnā* in the west, the six registers are disseminated, and the titles of the Di elders are established. Those who master them attain a lifespan whose radiance equals that of the sun and moon. By cultivating this Way, one summons the flying immortal officials of foreign lands to guard one’s person. On the days of the Great Year Star, one’s natal star, and the eight solar terms, inscribe the six registers in white ink, enter a chamber, face due west, and recite them. Knock the teeth nine times and chant the six registers six times each.\n\nWhen finished, close the eyes to settle the spirit and stabilize the will, casting aside all external distractions. Visualize the boundless, infinite realm of the western direction, its clarity fully revealed. Envision the countless Di elders and immortal officials arriving to attend one’s person. Then softly recite the incantation:\n\n*\"Heavenly tones, subtle numina,\nVoid and subtle, they command the spirits.\nThe Six Divisions of the Jade Land\nAppoint the One as true.\nTransforming the foreign lands in harmony,\nDisseminating the registers to delight the immortals.\nLofty numina curve their radiance—\nI attain spontaneity.\nRiding the void, soaring aloft,\nAlighting upon the Dragon Terrace.\nRoaming and gazing without bound,\nDarkly ascending the Five Mornings.\nMy brilliance equals the qi,\nMy mandate governs the exalted.\nThrough countless kalpas of fate,\nI eternally preserve long existence.\"*\n\nWhen finished, swallow the qi nine times and cease.\n\nPracticing this for nine years will summon the Di elders and immortal officials of the western lands to guard one’s person. They will perceive the unseen future and commune with the true and numinous, descending with azure chariots to ascend to the Jade Clarity.\n\n---\n\n**The Land of Xuntaluo in the North**\nBeyond fifty myriad li to the farthest reaches of the north lies the Dark Yin Court, the land of Xuntaluo. Its register is inscribed as the *Xuntaluo* nation. The land stretches long and flows level, its earth black and lustrous, spanning fifty-eight myriad li in breadth. Its people stand twelve feet tall and live for three hundred years. The land possesses six register tones, which are the exalted teachings bestowed upon the Qiang elders of foreign lands. The exalted ones constantly chant and sing these tones to transform the Qiang elders, revealing to them the land’s teachings of deathlessness. If the people of this land all perform rites and recite these tones, they attain a lifespan of three hundred years, free from premature death. Scholars who know the earth’s hues of foreign lands and constantly chant, recite, and cultivate these practices will summon the Qiang elders and immortal officials to guard their persons. After nine years, they will effortlessly journey to the land of *Xuntaluo*, converse with the Qiang elders, soar through the void, and feast in the Dark Yin Court.\n\n**The Six Registers of the Northern Land of Xuntaluo:**\n1. First Register: *Yōuluó Yùtóu Tā’ā*\n2. Second Register: *Yōuzhēn Shìwéi Guāngnà*\n3. Third Register: *Pǐnyù Dìngjué Shìhé*\n4. Fourth Register: *Yīnyè Bǎokāi Lùshā*\n5. Fifth Register: *Fǎguāng Jǐngliàng Guóluó*\n6. Sixth Register: *Bōmì Wéijiāhē*\n\nIn the land of *Xuntaluo* in the north, the six registers are disseminated, and the titles of the Qiang elders are established. Those who master them attain a lifespan equal to the numinous Seven Origins. By cultivating this Way, one summons the immortal officials of foreign lands to attend. On the days of the Great Year Star, one’s natal star, and the eight solar terms, inscribe the six registers in black ink, enter a chamber, face north, and recite them. Knock the teeth nine times and chant the six registers six times each.\n\nWhen finished, close the eyes to settle the spirit and stabilize the will, casting aside all external distractions. Visualize the boundless, infinite realm of the northern direction, its clarity fully revealed. Envision the countless Qiang elders and immortal officials arriving to attend one’s person. Then softly recite the incantation:\n\n*\"Northern darkness congeals in Luo,\nThe Seven Origins exhale their essence.\nDisseminating the registers, fasting in qi,\nThe Six Lands establish their names.\nThe Qiang elders, ever pure,\nReceive the Dharma’s transformation and numinous power.\nExalted immortals command the mandate—\nI am endowed with formlessness.\nQi flows in tandem,\nPenetrating the Eight Darknesses.\nFlying immortals arrive in audience,\nLush and misty in the Purple Court.\nCloud chariots and feathered canopies,\nVerdant mists and cinnabar chariots,\nConvey me upward\nTo ascend to the Jade Clarity.\"*\n\nUpon completion, swallow the qi nine times and cease. Practicing this for nine years will summon the Qiang elders and immortal officials of the northern direction to guard one’s person, allowing one to trace the obscure and fathom the yet-unseen, commune with the perfected and attain numinous power, soar through the mysterious void, and ascend to the Purple Dawn. Above the Nine Heavens of the upper direction, within the clear yang and empty space, where there is no color, no form, no shape, no shadow—there lies the realm of the primordial essence and the naturally arising Azure Chaos, where azure qi serves as the fragrance of the world. Boundless above, it covers the four directions of all heavens, forming the root from which the Most High Jade Emperor and the myriad sage emperors and perfected beings receive life. Without age, without limit, only kalpas serve as years. Within this empty void, there are also the Six Resonances, established by the Primordial Beginning as the natural ranks of the Perfected Emperor. The Most High intones and chants these sounds to extend the lives of the host of immortals, allowing them to know that the mysterious void holds boundless perfected beings. As the Jade Emperor and the ten thousand emperors of that realm all pay homage and chant these sounds, they attain limitless longevity. Those who study and know the color of the empty void, practicing through intoning and recitation, will summon the descent of the Three Origins, with the Five Emperors visiting their chamber to bestow upon them the numinous sounds. After nine years, they will be able to ride the void and mount the floating clouds, ascending to the Great Void of Jade Clarity.\n\nThe realm of the naturally arising Azure Chaos of the primordial essence in the upper direction:\nFirst Rank Resonance, sounding: *Qiongyao Fenlu Dingyin*.\nSecond Rank Resonance, sounding: *Fengyun Landan Baolin*.\nThird Rank Resonance, sounding: *Yaoliang Guangdong Zisen*.\nFourth Rank Resonance, sounding: *Yuannai Jingru Kongqiong*.\nFifth Rank Resonance, sounding: *He’a Fangbihu Ping*.\nSixth Rank Resonance, sounding: *Qiyao Qi Fei Yuanqing*.\n\nThe realm of the naturally arising Azure Chaos of the primordial essence emits the Six Ranks of Resonance to mark the truth of the Jade Emperor of Supreme Clarity. Those who know these sounds will soar through the Jade Void, and the myriad immortals will come to pay homage. On the days of one’s original destiny, the year-star, and the eight solar terms, inscribe the Six Ranks of Resonance in azure script, enter the chamber, face the year-star, and ingest them. Knock the teeth nine times and intone the Six Resonances six times each. Upon completion, close the eyes, calm the spirit, settle the will, and cast aside all thoughts. Visualize the boundless Supreme Clarity of the uppermost clear yang and empty space, where there is no color, no form, no shape, no shadow—only the luminous clarity of the empty void, suffused with dense azure qi descending to crown one’s person. Then softly recite the incantation:\n\n*\"Primordial Beginning, naturally arising,\nAzure yang dense and dark,\nMysterious transformation of the empty void,\nBoundless and formless,\nCongealing qi to form the realm,\nFragrant world as its name,\nEncompassing all heavens,\nUniversally nurturing the ten thousand spirits.\nCloud chambers and golden nets,\nTowering in Supreme Clarity,\nThe Six Ranks emit their positions,\nInscribing the primordial essence.\nJade sounds penetrate the subtle,\nMysterious echoes resound in clarity.\nIntoning and chanting issue forth,\nThe Perfected Emperors descend to the court.\nCurved reflections hang like trailing branches—\nI partake of the supreme numen,\nEqual in rank to Heaven,\nThe Three Luminaries unite in brightness,\nForever preserving the Great Void,\nUnshaken through the kalpas.\"*\n\nUpon completion, swallow the qi nine times and cease. Practicing this for nine years will cause the Three Origins to descend and bestow the true sounds upon one, granting a flying auroral cinnabar chariot to one’s person, allowing flight through the Great Void and ascent to Jade Clarity. This is a most exalted and secret method, recorded in the nameless golden texts and the azure characters of Supreme Clarity. It must not be practiced without authorization. Those who recklessly transmit it to others will bring calamity upon their seven generations, incur punishment from the Three Officials, forfeit their own lives, and lose all hope of immortality. Adhere strictly to the regulations and guard this knowledge with care.\n\nBeneath the central lands lies the vast Windy Marsh, extending five hundred twenty billion miles from the earth. The firm axis of the earth’s roots governs it, preventing its fall. The soil there is the color of golden essence. The resonance of the central lands is called the realm of the Treasured Perfection of Great Harmony and Boundless Life. Mount Kunlun of the central peaks stands at its center, bearing the alternate names of all heavens. Above it lies the Seven Jeweled Pearl Palace of the Dark Garden, where the ends of heaven meet, serving as the abode of the perfected and flying immortals. The central lands span one hundred twenty billion miles in circumference. The people there are nine feet tall, all practicing the arts of guiding and pulling, and live for one thousand two hundred years. The land possesses the Six Resonances, established by the Most High as the ranks of the central lands. The Jade Emperor and the Most High intone and chant these sounds to transform the Qiang elders of the central lands, allowing them to know that their realm holds the teachings of deathlessness. If the people of that land all cultivate the Dao of Supreme Clarity, practicing rites and recitations, they will live for one thousand two hundred years, free from untimely death. Those who study and know the earth’s color of the central lands, practicing through intoning and recitation, will have the Qiang elder immortal officials guard their persons. After nine years, they will naturally converse with the Qiang elders, ascend to the Great Void, and soar to Supreme Clarity.\n\nThe realm of the Treasured Perfection of Great Harmony and Boundless Life:\nFirst Rank Resonance, sounding: *Dingshi Yinjie Ronghe*.\nSecond Rank Resonance, sounding: *Zhongbao Zhu Ruolaihua*.\nThird Rank Resonance, sounding: *Guangyuan Yuanli Yun’a*.\nFourth Rank Resonance, sounding: *Tiaoqiong Fen Jin Shiluo*.\nFifth Rank Resonance, sounding: *Dongling Yin Jieshi Tuo*.\nSixth Rank Resonance, sounding: *Jingen Bao Zhuyang Po*.\n\nThe realm of the Treasured Perfection of Great Harmony and Boundless Life emits the Six Ranks of Resonance to establish the titles of the Qiang elders. Those who know these sounds will live as long as heaven and earth. Practicing this Dao will summon the Qiang elder immortal officials to pay homage to one’s person. On the days of the year-star, one’s original destiny, and the eight solar terms, inscribe the Six Ranks of Resonance in yellow script, enter the chamber, face one’s original destiny, and ingest them. Knock the teeth nine times and intone the sounds of the six lands six times each. Upon completion, close the eyes, calm the spirit, settle the will, and cast aside all thoughts. Visualize the vast Windy Marsh beneath the central lands, plunging five hundred twenty billion miles into the abyss, its clarity fully revealed. Envision the countless Qiang elder immortal officials arriving to attend one’s person. Then recite the prayer:\n\n*\"Central perfection, myriad emperors and mysterious numina,\nThe Nine Heavens bestow their canon,\nCongealing qi and condensing essence,\nVast and yellow, the court of boundless fathoms.\nThe central lands emit their ranks,\nDividing the sounds into six names.\nJade faces the luminous void,\nPenetrating the subtle and entering the azure.\nFlowing perfection spreads forth,\nCultivating my form,\nTransforming into Great Harmony,\nTreasured perfection, advantageous and upright.\nBelow, it pierces the abyssal depths;\nAbove, it ascends to Jade Clarity.\"*\n\nWhen finished, swallow the qi nine times and cease. Practicing this for nine years, the Perfected One descends to bestow upon the practitioner the true sounds, enabling converse with the Qiang elder immortal officials, riding the void to ascend to the Court of the Celestial Dawn. The Highest establishes the Six States’ ranked inscriptions, transforming them into thirty-six sounds. At the inception of the Primordial Beginning, the texts were inscribed in gold on tablets, each placed within a state, now all sealed within their borders or upon the sacred peaks of the Five Marchmounts. The sounds of the Central Lands, for instance, correspond to the northern face of the Jasper Orchard’s Piled Stones. These divine texts are each attended by three hundred Purple Aurora Jade Lads and Great Flower Jade Maidens, who serve and tend the incense.\n\nBy ancient decree, after ten thousand kalpas, they are transmitted to those of the highest Perfection. Without one’s name inscribed on the Emperor’s golden tablets or the Jade Clarity’s green script, one cannot receive these texts. Upon obtaining the Six States’ ranked sounds, one may wander boundlessly, traversing the Six States, ascending to Heaven or entering the abyss, transforming in myriad ways, treading the Five Marchmounts, and roaming the sacred peaks. Then the Hu, Yue, Di, Qiang, and Qiang elder immortal officials will escort and receive, all demons bow in submission, weapons and misfortune vanish, and one may roam the Six States at will. Reciting these ten thousand times, the Three Primes visit one’s chamber, descending with green chariots to ascend to the Jade Dawn.\n\nThese are the Highest’s spontaneous texts, the Prime Minister’s soaring mysterious purple qi script, written in realgar upon azure jade, worn upon the body to wander the Five Marchmounts, enter the Three Clarities, subdue the demonic hordes, command the myriad spirits, overawe the Six States, and subjugate the five weapons. Practicing this for nine years, the Perfected One visits one’s court, enabling flight through the void to ascend to the Great Clarity.\n\nThe Lad of the Azure Lads says: The Jade Perfected of the Celestial Emperor and the immortals of the Five Marchmounts all wear these texts and chant their sounds, bearing them upon their persons to cultivate Perfection. Without these texts, one cannot wander the sacred peaks, govern the Six States, repel weapons, or have the Five Elder Officials guard one’s form. The foundation of study lies in diligently traversing the Five Marchmounts to seek these texts, whereupon numinous might responds, and one naturally attains the Highest’s wondrous Daoist methods—even without study, one becomes immortal.\n\nThe Lad of the Azure Lads received the Highest’s texts for entering the Six States. Those who later study and wish to wander the sacred peaks, the Five Marchmounts, and the Six States, summoning the host of immortals, subduing the myriad demons, and subjugating the five weapons, must receive the Five Emperors’ texts of intersecting sounds. Wearing them for six years, one may converse with the Six States’ immortal officials and naturally comprehend the thirty-six states’ sounds.\n\nThe Yellow Emperor received the Hidden Primordial Three Lines, dominating the world, communing with the divine and luminous, commanding ghosts and spirits, and governing the myriad numina. Yu of Xia received the Three Lines of Intersecting Sounds, enabling the world’s ghosts and spirits to heed fortune and misfortune, know their past lives, and attain the ranks of numinous immortals. Zeng Xuan received the Three Lines of the Azure Grotto Text, aiding the Five Dragons and wandering the Cloud Palaces. An Yang received the Three Lines of the Nine Numinous Sounds, ascending the Emperor’s Hall and attaining the rank of Immortal King. Chi Jing received the Text of Treasured Perfection, ascending to the Four Poles and entering the Three Clarities. Wang Qiao received the Three Lines of the Primordial Womb’s Hidden Register, ascending to the ranks of the Highest Perfected and governing the host of immortals, entering and exiting the Flower Chambers.\n\nThe Highest, at the Golden Flower Palace of the Western Mound in the Jasper Orchard, transmitted the texts of the Numinous Assembly to the Prime Minister, the Lad of the Azure Lads.\n\nThe Three Lines of the Eastern Meng’s Hidden Texts, written in realgar upon azure silk and worn upon the body, enable one to wander the eastern state of A-luo-ti, govern the myriad spirits, slay celestial demons, subjugate the five weapons, roam the sacred peaks, have the Hu elders escort and receive, naturally comprehend the Six States’ sounds, and converse with the divine.\n\nThe Three Lines of the Southern Intersecting Sounds, written in realgar upon azure silk and worn upon the body, enable one to wander the state of Yi-sha-ta, govern the myriad spirits, slay celestial demons, subjugate the five weapons, roam the sacred peaks, have the Yue elders escort and receive, naturally comprehend the Six States’ sounds, and converse with the divine.\n\nThe Three Lines of the Western Primordial Hidden Texts of the Azure Grotto, written in realgar upon azure silk and worn upon the body, enable one to wander the state of Ni-wei-luo-lü-na, govern the myriad spirits, slay celestial demons, subjugate the five weapons, exit the mysterious paths, enter the Three Clarities, roam the sacred peaks, have the Di elders escort and receive, naturally comprehend the Six States’ sounds, and converse with the divine.\n\nThe Three Lines of the Northern Nine Numinous Golden Radiance Sounds, written in realgar upon azure silk and worn upon the body, enable one to enter the state of Xun-ta-la, govern the myriad spirits, slay celestial demons, subjugate the five weapons, ascend the Vast Cold, visit the Northern Essence, roam the sacred peaks, have the Qiang elders escort and receive, naturally comprehend the Six States’ sounds, and converse with the divine.\n\nThe Three Lines of the Upper Clarity’s Yang Primordial Womb’s Hidden Register, written in realgar upon azure silk and worn upon the body, enable one to ascend and wander the state of Primordial Essence’s Azure Chaos, govern the myriad spirits, slay celestial demons, subjugate the five weapons, tread the void heavens, ascend to the Jade Clarity, roam the sacred peaks, have the myriad Perfected escort and receive, naturally comprehend the Six States’ sounds, and converse with the divine.\n\nThe Three Lines of the Central Numinous Assembly’s Perfected Multitude, written in realgar upon azure silk and worn upon the body, enable one to wander the state of Great Harmony’s Treasured Perfection and Boundlessness, govern the myriad spirits, slay celestial demons, subjugate the five weapons, enter the grotto abyss, ascend the Mysterious Darkness, sport in the Northern Primordial, visit the Purple Court, roam the sacred peaks, have the Five Elders escort and receive, naturally comprehend the Six States’ sounds, and converse with the divine.\n\nThe Highest’s Hidden Perfected Texts for Entering the Six States, transmitted to the Prime Minister, the Lad of the Azure Lads, written in realgar upon azure silk and worn upon the body, cause a precious radiance to arise from the nape, illuminating the Ten Heavens. They command thirty-six Jade Lads and thirty-six Jade Maidens, enabling one to wander the Five Marchmounts, traverse the sacred peaks, enter the Six States, tread the river sources, whereupon the host of immortals and the Five Directions’ officials all come to bow, the border sentinels welcome, the myriad demons are subdued, the thousand spirits are commanded, the Six States are overawed, the five weapons are subjugated, transformations are boundless, and one may follow one’s will. Descending green chariots of the cinnabar clouds come to receive one’s person, ascending to the Eastern Flower’s Azure Palace, attaining the rank of Prime Minister and governing the myriad Perfected.\n\nThe Dao is most exalted and wondrous, the August Lord’s precious writ. The Most High has now inscribed this writ in the script of men and birds, placing it within the cavern of Penglai, upon the northern slopes of the Accumulated Stones above the Dark Garden. The dark mystery of the feathered script and the radiant splendor of its luminous patterns intermingle, illuminating the vast heavens; purple mists layer in shadow, and the brilliance of its patterns shines with penetrating clarity. By ancient decree, after ten thousand kalpas one who is destined to transmit it shall have already become a Perfected. Whoever obtains this writ shall have their rank elevated to that of Immortal Minister, able to traverse the Six States, converse with the Five Elders, and penetrate the mysteries of the Dark Void. They shall command the myriad spirits, and even without jade bones, their name shall be engraved upon the purple tablets before their birth. Those who receive this writ, though they study not, shall still become Median Immortals. Should one lightly divulge this precious incantation, their seven ancestors shall bear the burden, hauling mountains and bearing stones for ten thousand kalpas without pardon. Their own person shall be bound and subjected to the trials of the world’s winds and blades, dying to enter hell, never again to attain immortality.\n\nWhen wearing this writ to wander the Six States, tread the Five Marchmounts, and traverse the myriad sacred peaks, upon reaching the border of any realm, one must first strike the teeth thirty-six times, hold the breath for thirty-six cycles, and recite the incantation:\n\n*\"Jade Perfected, lingering in circuit,\nCloud chariots soar aloft.\nThis day is most auspicious,\nDragons ascend, phoenixes take flight.\nArrayed in feathered regalia,\nThe four paths open wide,\nThe six hosts set forth to guide,\nThe ten realms come to welcome.\nImmortal lads bear banners,\nJade maidens scatter incense.\nThe Five Elders bow in reverence,\nMajestic and resplendent,\nSun and moon intertwined in sash,\nDivine immortals lend their aid.\nTreading the Six States,\nTraversing the four quarters,\nThe Four Waterways and Five Marchmounts\nBecome bridges for my passage.\nBy the August Lord’s command,\nSweep away all inauspiciousness.\nWherever I journey,\nAll shall be most propitious.\nWondrous and strange,\nThe immortal’s refinement flourishes within,\nThe foreign lands grow luminous without,\nAscending to the Jade Capital above.\"*\n\nWhen finished, draw in the breath thirty-six times and cease. This is the mighty incantation of the Prime Minister’s excursions, by which one governs the Six States, subdues the myriad spirits, summons immortal officials to manifest, and performs boundless transformations, ascending to the Great Clarity.\n\nThe recipient must fast for seven days, or thirty days, and during the fast present thirty-two feet of azure-patterned silk, one golden fish, one jade dragon, nine pairs of golden rings, and five taels of gold as substitutes for the oath of cutting hair and tearing cloth. The master shall face north to proclaim the covenant and transmit the writ, while the disciple receives it with reverence, adhering to the statutes of the Four Poles, gathering in solemnity and restraint, guarding the precepts in secrecy and upholding them faithfully.\n\nThe Most High Clarity’s Jade Guardian, King of the Prime Minister and Grand Marshal, commands the Master of the Lofty Dawn, the Azure Lad of the Jade Gate of the Eastern Sea, to receive this from the Most High Jade Emperor and transmit it to the Perfected of the Four Poles. The Five Thearchs’ divine soldiers shall punish those who leak its secrets, break their covenant, or betray their oath: their seven ancestors shall bear the burden, their own person shall perish, enduring the three paths and five sufferings for ten thousand kalpas without pardon.\n\nHere ends the *Upper Scroll of the Azure Lad’s Writ of the Outer Realms’ Ranks* of the Most High Clarity.\nHere begins the *Lower Scroll of the Azure Lad’s Writ of the Outer Realms’ Ranks* of the Most High Clarity.\n\nThe *Inner Sounds of the Nine Mysteries and Thirty-Six Heavens of the Most High* and the *Inner Sounds of the Outer Realms’ Ranks of the Thirty-Six Heavens of the Cavernous Abyss and Nine Lands* originated before the Nine Mysteries of the Great Void. They coalesced from the soaring, mysterious purple qi as natural scriptures, their numinous writs dense in the layered skies, their true radiance resplendent in the Highest Clarity. Their divine marvels manifested in the Great Han, their jade tones ringing clear in the Golden Court. Whirling winds coursed through the purple mists, incense scattered across the Eight Darks. Cinnabar brilliance shone upon their jasper stems, the vermilion sun bathed the divine perfected. Through countless kalpas, they descended in emptiness from the mysterious void. The Three Primes initiated their motion, the Nine Cycles propelled their shifts. The numinous sounds appeared, inscribed upon Kunlun’s slopes, above the Jasper Gardens, and beneath the Accumulated Stones. Their radiant patterns cast forth splendor, their essence blazed toward the heavens. The sun and moon matched their light, the five stars shared their brilliance. The Four Convergences and Eight Reaches pierced through the Jade Clarity. Three hundred flying immortals and purple lads each attended the incense and awaited the numinous, girded with the beasts of the Jue Heaven, defended by myriad layers of golden heads. Nine-colored streaming clouds crowned their peaks, divine simurghs and vermilion phoenixes perched upon their pavilions. The Five Thearchs oversaw the perfected, the Four Poles governed the immortals. The Seven Luminaries exhaled their essence to refine and temper, jade blossoms scattered their truth to adorn the dust. Treading the yang’s decline without weariness, enduring ten thousand kalpas yet ever fresh.\n\nOn the first day of the third month of the first year of the Middle August Era, at the hour when Heavenly Virtue aligned, the Most High Clarity’s Jade Guardian, King of the Prime Minister and Grand Marshal, commanded the Master of the Lofty Dawn, the Azure Lad of the Jade Gate of the Eastern Sea, to purify himself in the Upper Palace for nine hundred days, to pledge alliance with the Azure and Gold Heavens, and to receive this from the Most High Jade Emperor. He traversed all heavens, penetratingly beheld the void, his gaze flowing across countless fordings. Above, he observed the boundless; at the center, he sported in the vast expanse. He circled the Six Lands, wound through the Nine Mysteries. The Four Offices examined and tested him, the Upper Prime fixed his immortal rank. The Jade Void cast its reflection, the Tortoise Mother descended with truth. The Eight Effulgences reined their steeds, the Five Elders flanked his chariot. Flying immortals raced one another, the Eight Winds played amidst the mists. Streaming lightning flashed with might, a hundred suns exhaled their essence. Jasper wheels illuminated the void, feathered canopies billowed in mystery. Golden lads scattered blossoms, jade maidens brushed away dust. The host of spirits bowed their heads, the Five Marchmounts paid homage to the perfected. The various heavens offered their rites, the ten directions’ overseers welcomed him. He governed the myriad Dao, universally oversaw the ten thousand immortals. His rank ascended to Prime Minister, he presided over the Lofty Dawn, truly by the wondrous decree of the Jade Emperor and the jade tones of the Thirty-Six Heavens. He controlled life and death in the registers, held the immortal titles in the Azure Palace, led the golden names in the mysterious records, and oversaw the white tablets in the jade chapters. Above, he governed the boundless, infinite, and inexhaustible; below, he oversaw the Cavernous Abyss, the Nine Lands, and the myriad spirits of the Five Marchmounts, Four Poles, rivers, and seas, along with the immortals of the Thirty-Six Lands—none were not subject to the Azure Lad.\n\nBy ancient statute, this was transmitted once every ten thousand kalpas, at the conjunction of the Nine and Five Cycles, when the Three Eras intersected. There were thirty-six names inscribed in the Emperor’s register. Those who beheld its writ and wore these sounds would erase their traces in the Nine Lands, be welcomed from afar by the Six Lands, and have their names recorded in the Thirty-Six Heavens. The Three Primes of the Upper Palace would descend, and they would naturally become immortals.\n\nThe mysterious canon encompassed the cavernous source, its numinous principles towering and beyond discourse. The jade depths were profound and unfathomable, its wondrous transformations too subtle to recount repeatedly. Here, but a thousandth part is briefly raised, a single truth coarsely marked from ten thousand marvels.\n\nThe *Inner Inscriptions of the Various Heavens* and the *Thirty-Six Sounds of the Nine Lands* coexisted with the Primordial Beginning, established their titles in the empty numinous, and wove their natural names to manifest in the Nine Mysteries, unfolding the Thirty-Six Sounds of the Outer Realms. Thus, heaven and earth each had thirty-six divisions: heaven had thirty-six Heavenly Kings to correspond to the thirty-six lands, and earth had thirty-six Earthly Sovereigns to correspond to the thirty-six heavens. The Heavenly Kings and true Earthly Sovereigns presided over the immortals. Those who studied yet did not know the Inner Sounds of Heaven would not have their names recorded by the Heavenly Kings; those who did not know the sounds of the earth below would not have their traces erased by the Earthly Sovereigns, and thus would remain barred from immortality.\n\nThose who beheld its writ and received its oral instructions would have the Heavenly Kings’ mysterious scrutiny, the Seven Sages’ inscribed chapters, the Western Tortoise’s fixed register, and the Eastern Florescence’s recorded names. The Earthly Sovereigns would erase their corpses and obliterate their traces, the Nine Yin would recommend them to the Highest Clarity, the Five Numinous would reverently guard them, and the Ten Realms would support their ascent. They would circulate through the Six Lands, pacify and eliminate the multitude of evils, subdue the five weapons, and bind the heavenly demons. After nine years, they would ride the void and fly to the Highest Clarity.\n\nThe true Dao is lofty and wondrous; it must not be rashly proclaimed. Those who lightly divulge its sacred sounds shall have their seven ancestors burdened, their own persons perish, and endure the three paths and five sufferings for ten thousand kalpas without pardon. Perfected adepts must heed the statutes and act accordingly.\n\nThe Heavenly Kings regularly, on the eight solar terms and the first days of each month, roam and observe the boundless, sport in the cloud chambers, and wander carefree in the Jade Clarity. Their gaze flows across the ten directions, and above the bright clouds, they constantly chant the *Inner Sounds of the Various Heavens* and the *Soaring Mystery’s Chapters* to celebrate the heavenly perfected, inwardly delighting their divine hearts. Jade tones resonate in emptiness, jasper melodies harmonize. On such days, the Five Elders rise from their seats, the Nine Thearchs attend their pavilions. The Four Offices examine and test, the Five Thearchs guard the numinous. The host of perfected sings in unison, the ten thousand immortals offer their ritual sounds. The Three Luminaries pause their brilliance, the Seven Primes blaze with light. Mountains and seas grow still, the various heavens grow solemn and clear. The Eight Primes scatter blossoms, the Four August Ones brush away dust. Numinous winds waft incense, green clouds exhale nectar. The heavenly origin dissolves its stagnation, the Jade Void contains its joy. In the bright and lofty halls of the Highest Clarity, amidst the vast and distant Great Desert, the cavernous void enters the subtle, and all-pervading scrutiny knows no end.\n\nThose who attain this Dao and befriend the Thearch, diligently recite its chapters, shall have their ranks equated with the Immortal Kings, their virtue equated with the various heavens, and their lifespan equated with the Three Luminaries. All who study the Dao of the highest immortals, aspiring to ascend to the Jade Clarity and pay homage to the August Honored One, yet do not know the sounds of the Thirty-Six Heavens and the *Soaring Mystery’s Chapters*, shall not have their names recorded by the Thirty-Six Heavenly Kings. Their efforts shall be in vain, heaven shall not descend its truth, the Four Offices shall not revere them, the Five Thearchs shall not welcome them, and heavenly demons shall invade their truth. They shall never attain immortality.\n\nThose who aspire to soar through the mysterious void and wander the Five Peaks, yet do not know the inner names of the Nine Earths and the Thirty-Six Earthly Thearchs, shall not have their corpse cast into the Nine Yin, nor their traces extinguished in the Nine Earths. Their toil in the hidden mountains shall be in vain, and their hopes of flight shall instead plunge them into the depths.\n\nTo practice this Dao, on each of the Eight Solar Terms and the first day of the lunar month, bathe in purity, maintain a fast, enter the chamber, and burn incense. Pay homage to the various heavens, face north, and knock the teeth thirty-six times. Softly intone the incantation:\n\n*\"Your servant, [Name], yearns for the divine immortals. On this day of eightfold felicity, I pay homage to the Heavenly Honored One. My highest wish is to ride the luminous essence, traverse the void, and drift upon the mist, to soar beyond the Jade Clarity and roam freely through the heavens. My middle wish is to transform my form, summon the Five Spirits, ascend through the Moon Gate, and drink from the Eight Steeds. May the Stone Radiance and Water Mother, the Jade Embryo and Flying Root, clothe me in the crimson sun, that I may abide in its light. My lowest wish is for the Four Poles to bestow upon me the sacred words, for the Western Florescence to guard me, and for the Golden Dawn to serve me. May I command the Five Elders and share the same chariot as the Eight Effulgences. May the upper and lower felicitations unite, and my five wishes be fulfilled. Grant that my desires be realized, my body harmonized with nature, and the true numina descend to confer upon me the rank of highest immortal.\"*\n\nWhen finished, perform six bows and inhale six breaths while facing upward. Then turn west, perform six bows, and inhale six breaths. Finally, turn south, perform six bows, and inhale six breaths.\n\nNext, turn east, perform six bows, and inhale six breaths; then turn northwest, perform six bows, and inhale six breaths; finally, turn southeast, perform six bows, and inhale six breaths. Having completed thirty-six bows in the six directions, the audience with the Thirty-Six Heavens is concluded. Return to face north and sit upright, then chant the \"Chapter of the Flying Mystery of the Thirty-Six Heavens\" once through. When finished, perform six bows again and inhale six breaths, and the rite is complete.\n\nThis is the supreme method of audience with the Thirty-Six Heavens. Practicing it for nine years will cause a cloud chariot to descend from heaven, and the Three Primes will attend your chamber. Your name will be inscribed in the Jade Purity, carved upon the azure tablets of the Green Palace. The Four Offices will distinguish you to the right, and the Ten Realms will reverently welcome you. You will ride the void and ascend to the Jade Dawn.\n\nThis method is most wondrous; it must not be rashly disclosed. To carelessly reveal its sacred texts will bring punishment upon seven generations of ancestors, consigning your body to the offices of ghosts and confining you eternally in the Three Prisons, never to be released for ten thousand kalpas.\n\n*Inner Sounds of the Supreme Nine Mysteries and Thirty-Six Heavens*\n1. The Boundless Heaven of Utmost Singularity, without radiance or form – *Yudan Wuliang Tian*\n   Sovereign: *Yingbo*\n   Heavenly King: Surnamed *Hun*, named *Nini Luo*\n\n2. The Heaven of Formless Purity – *Wuxing Qingwei Tian*\n   Sovereign: *Huasheng*\n   Heavenly King: Surnamed *Feng*, named *Tiasasha*\n\n3. The Heaven of No Essence, the Wave-Span – *Wujing Poloru Tian*\n   Sovereign: *Xuanhei*\n   Heavenly King: Surnamed *Yun*, named *Kuiling*\n\n4. The Heaven of Entering Form, the Water-Boundless Myriad – *Ruse Shuiwuliang Yiluo Tian*\n   Sovereign: *Feizong*\n   Heavenly King: Surnamed *Wang*, named *Awei*\n\nThe Sounds of the Four Heavens arise from the primordial, spontaneous qi of the Yuan Shi, existing above the Supreme Jade Purity. On the eight solar terms and the first day of each lunar month, the Four Heavenly Kings roam and observe the summit of the Supreme Jade Purity—boundless, infinite, formless, and colorless—chanting the *Flying Mystery Stanzas* of the Four Heavens’ Sounds. On these days, talismans from the Four Offices circulate throughout the world. Those who study the Dao, maintain purity through fasting, recite the scriptures, and pay homage to the various heavens will instantly have their names inscribed on the jade tablets of the Mysterious Register and recorded in the Azure Palace. Their lifespan will equal that of the denizens of the Four Heavens, and after nine years of aerial flight, they will ascend to heaven in broad daylight.\n\nThe *Spontaneous Flying Mystery Stanzas* of the Four Heavens proclaim:\n\nProfound and serene, entwined with Brahma’s grace,\nThe Treasure Dhyāna King harmonizes all.\nThe Three Realms bear the wheel’s embrace,\nThe Nine Images subdue the demons’ thrall.\nMystic knots unfold in boundless sight,\nLush branches trail in radiant might.\nJubilant clouds soar anew in flight,\nCrimson orchids bloom in splendor bright.\nVermilion essences spiral upward high,\nEssence bathes the jade-hued sky.\nPhoenixes cry on peaks untrod,\nDragons startle in the Dao’s abode.\nGolden tones resound afar,\nEmpty melodies weave *Nāda*’s scarf.\nThree dawns unfold their gleaming light,\nCrimson hues adorn the patterned night.\nNine voids swift as racing smoke,\nEight winds scatter blossoms’ cloak.\nGolden chariots with jade wheels spin,\nPhoenix carriages whirl within.\nGolden tones waft fragrant air,\nClouds in towering peaks repair.\nSweet nectars mingle, scatter wide,\nDivine elixirs pour and glide.\nMystic valleys, jade springs flow,\nLike rivers vast or boats that row.\nThe body merges with the natural state,\nEons pass—what weight or weight?\nLingering at the Golden Gate,\nFeasting in the Radiant Emperor’s estate.\nEternally guard the Jade Void’s height,\nForever free from decline or blight.\n\n5. The Heaven of Limitless Cavernous Purity, Supreme Meditation, and Boundless Longevity – *Wuji Dongqing Shangshang Chan Shan Wuliang Shou Tian*\n   *Yunluo*\n\nThe Heavenly King, surnamed *Kai*, given name *Mouliju* – *Sixth Xuanwei Ziran Shangxu Yuyu Heaven*\n*Fanyan*\n\nThe Heavenly King, surnamed Luo, given name *Politu* – *Seventh Xuanqing Shangwu Nashou Yuezheng Heaven*\n*Xuanna*\n\nThe Heavenly King, surnamed Fan, given name *Moshoubo* – *Eighth Fanxing Shangqing Qi Jina Bianjing Heaven*\n*Yunxie*\n\nThe Heavenly King, surnamed Qian, given name *Shouke* – The Four Heavenly Voices, the Primordial Progeny of the Dao’s Natural Qi, dwell within the High Void of Jade Purity.\n\nOn the eight solar terms and the first day of each lunar month, the Four Heavenly Kings roam and observe the summit of the High Void—boundless, limitless, nameless, and profoundly empty—chanting the *Four Heavenly Voices* and the *Flying Mystery’s Hymn*. On these days, the celestial envoys of the Perfected traverse the heavens.\n\nThose who cultivate immortality through ascetic devotion, recite the *Flying Mystery’s Hymn*, and pay homage to the heavens at dawn shall have their names presented to the Four Heavens, inscribed upon the Emperor’s tablets. Their lifespan shall equal that of the Four Heavenly Beings, and after nine years of flight, they shall ascend to the celestial palaces.\n\nThe *Flying Mystery’s Hymn of the Four Heavens* proclaims:\n\n*Boya he ni,*\n*Mystic radiance scatters its glow,*\n*Crimson clouds unfurl their scrolls,*\n*Luminous essence gleams like jade dust.*\n*Falling winds carry the Daoist tones,*\n*The vermilion sun wheels leftward,*\n*Jade echoes resound in the Mystic Chamber,*\n*Golden skies descend on all four sides.*\n*Lofty flight brushes the essence,*\n*Stony light soars aloft,*\n*The heavens reflect in profound splendor,*\n*The Jade Emperor lingers in contemplation.*\n*Green chariots and crimson carriages,*\n*Kingfisher plumes and brocade robes,*\n*Wandering the nine cliffs,*\n*Hands parting the gates of heaven.*\n*Flourishing with the sun,*\n*Waning with the moon,*\n*Bathed at the Golden Gate,*\n*Adorned with the radiance of spirits.*\n*Learning equals that of celestial beings,*\n*Lifespan spans the Two Modes.*\n*Ascending to join in harmony,*\n*All immortals converge in return.*\n*The Jade Void seals its pact,*\n*Forever free from peril or decline.*\n*The Perfected unfold their celestial array,*\n*Ascending to the Purple Tenuity’s pavilion.*\n*May this vow descend from on high,*\n*As we pay homage at the Jade Stairs.*\n\n*Ninth Wuqiong Dongxu Jishang Xuyan Heaven*\n*Huimo*\n\nThe Heavenly King surnamed Ze, named Hui Luo\nTenth: Mystic Brahma Jade Void Non-Existent Essence Qi Luo Jia Fu Moon Heaven\nYun A\n\nThe Heavenly King surnamed Zhou, named A Jia Xu\nEleventh: Qi Mystic Heaven Attaining Supreme Numinous Crimson Heaven\nChong Mu\n\nThe Heavenly King surnamed Dan, named Qing Fu □\nTwelfth: Great Brahma Mystic Origin Qi Departing Harmony Proceeding Heaven\nShi Bi\n\nThe Heavenly King surnamed Gu, named Fen Ruo\nThe Sounds of the Four Heavens, the Nine Voids’ Primordial Yang, the Qi of Cavernous Obscurity—all dwell beneath the Mystic Void Jade Purity.\n\nThe Four Heavenly Kings, on the eight solar terms and the first day of each lunar month, roam and observe the boundless void of the Constant Non-Existence Cliff, chanting the Sounds of the Four Heavens and the Flying Mysteries’ Hymns. On such days, they dispatch the Supreme Perfected Envoys to traverse the world below. Those who cultivate immortality through pure fasting, recite scriptures, and pay homage in audience shall have their names memorialized to the Four Heavens, inscribed in the Emperor’s Register. Their lifespan shall equal that of the Four Heavenly Beings; after nine years of flight, they shall ascend to the Celestial Palace.\n\nThe Hymn of the Four Heavens’ Flying Mysteries reads:\nHaraya Treasure, Jade Brahma’s flourishing splendor,\nVina’s radiant fall, Cavernous Profundity’s worldly truth,\nJade chime’s resonant sound, lush echoes arise naturally,\nCrimson jasper blooms, auspicious clouds gleam within,\nFlowing rosy clouds sprout orchids, cinnabar swirls in purple mist,\nThe Three Heavens unite in radiance, the Seven Luminaries usher dawn,\nEight Sceneries turn their chariots, the Nine Emperors share their carriages,\nLifting high the exalted craftsman, the Purple Void’s Supreme Immortals,\nIn unison they chant and harmonize, arraying the Jade Perfected,\nSacred canons vast and distant, jade tones command the spirits,\nThe Five Elders gird their sashes, the Four Poles entwine in coils,\nThe Nine Qi meander, weaving the void into mist,\nThe Three Numinous Ones cast their glow, the Seven Essences bathe in dew,\nForms are molded, jade-refined, the Mystic Root is delivered,\nTranscending beyond all bounds, traversing the manifold heavens,\nPenetrating the formless, returning to my karmic origins.\n\nThirteenth: Supreme Numinous Jade Void Mystic Cavern Serene Heaven\nJia Zhu\n\nThe Heavenly King surnamed Jin, named □ □\nFourteenth: Treasure Brahma Heaven’s Color Supreme Perfected Qi Pan Luo Mystic Wondrous Heaven\nYun Chi\n\nThe Heavenly King surnamed Sui, named Li Mu Yin\nFifteenth: Flying Brahma Practicing Perfected Supreme Mystic Answering Deception Blessing Virtue Heaven\nBu Sheng\n\nThe Heavenly King surnamed Wang, named Wei Bo Li\nSixteenth: Cloud Brahma Flowing Essence Middle Origin Near Delusion’s Edge Pure Heaven\nShi Liang\n\nThe Heavenly King surnamed Zhu, named Li Ai\n\nThe Four Heavens’ hymns, the Brahma-practicing primordial qi of the Cavernous Void, abide above the Supreme Void Sovereign’s Upper Clarity. The Four Heavenly Kings, on the eight solar terms and the first day of each lunar month, roam and observe above the boundless, infinite Cavernous Void of the Supreme Void Sovereign’s Upper Clarity. They chant the hymns of the Four Heavens’ soaring mystery, and on those days, dispatch the jade overseers among the perfected to traverse the world below. Those who cultivate immortality, practice the Dao, pay homage to the heavens, burn incense, and recite scriptures—these names are memorialized to the Four Heavens, inscribed upon jade tablets, and their lifespans become equal to those of the Four Heavens. After nine years, they soar through the empty void, ascending to the Mystic Palace.\n\nThe hymn of the Four Heavens’ soaring mystery reads:\nMāyā spreads fourfold, six rhymes unite in pairs,\nNuminous tones scatter and radiate, the Void transforms into palaces.\nJade mystery drifts through the empyrean, Tihe strikes the resounding bells,\nJasper echoes like ringing jade, whistling spirits summon the lads.\nEight luminaries align in perfection, the Nine Emperors share fellowship,\nSouthward they cross floating Li, northward they descend to the Cold Palace.\nRevolving truth through the four quarters, the Hall of Vast Numinosity,\nAbove they wield the numinous hymn, below they subdue demonic fiends.\nClouds soar through the profound mystery, four directions interconnect,\nMists of dawn spill forth essence, spreading across the great void.\nPurple emptiness weaves mist, lingering in the cinnabar chamber,\nTriple radiance illumines the cavern, the Seven Luminaries stream light.\nThe crimson sun flourishes in splendor, the verdant Brahma overflows,\nPresiding over the sixteen stations, jade orchids bathe in fragrance.\nThe nine corners resound in unison, in meditation I am made king,\nMirroring the ten heavens, myriad immortals come to pay homage.\nWith luminous jasper tones, the mystery is perfected as the Immortal Duke,\nBound to the kalpa’s term, eternally preserved without end.\n\nSeventeenth: Profound Upper Cavernous Ultimate Boundless Unyielding Joy Heaven\nLiu Fang\n\nThe Heavenly King surnamed Ning, personal name Xuyao: Eighteenth Great Brahma Profound Azure Unbounded Responsive Near-Boundary Heaven. Yuan Shen.\nThe Heavenly King surnamed A, personal name Mingxiu: Nineteenth Ascendant Brahma Purple Void Upper Prime Origin Swift Vision Heaven. Dong Gan.\nThe Heavenly King surnamed Liu, personal name Qieshan: Twentieth Void Brahma Upper Clarity Transformative Spirit Sutra-Bound Love Heaven. Fei Yi.\nThe Heavenly King surnamed Peng, personal name Yina.\n\nThe voices of the Four Heavens, soaring Brahma ascendant Void Purple Prime qi, abide within the Void Sovereign’s Upper Clarity. The Four Heavenly Kings, on the eight solar terms and the first day of each lunar month, roam and observe within the Void Sovereign’s Upper Clarity—boundless, infinite, and cavernously empty—chanting the voices of the Four Heavens and the soaring mystery hymns. On these days, they dispatch Jade Perfected Stabilizing Immortals to traverse the world. Those who cultivate immortality, practice the Dao, pay homage to the heavens, burn incense, and recite scriptures have their names memorialized to the Heavenly Kings, inscribed in the Azure Register. Their lifespans equal those of the Four Heavenly beings, and after nine years, they ascend to Upper Clarity.\n\nThe hymn of the Four Heavens’ soaring mystery states:\n\nClouds veil cinnabar peaks, profound and wondrously numinous,\nLayered skies dense with emptiness, thin orchids lush with jade verdure.\nVermilion gales billow, swirling to reflect the cloud courts,\nWorldly dharma-wheels bound qi, settling into limpid clarity.\nVerdant boughs cradle branches, iridescent blossoms gleam like jasper,\nEight winds dance upon the carriage, six dragons soar in flight and song.\nGolden tones resonate in emptiness, jade chants arise from the void,\nPerfected ones ascend to the upper realms, the Four Emperors unite in spirit.\nThe August Cliff reins in tranquility, jade immortals urge their chariots,\nGazing across the Four Heavens, they traverse the Three Clarities,\nCarefree and unbounded, loftily illumining the Great Darkness,\nRadiant nets bathe in splendor, the Seven Primes exhale essence.\nCrowned and sashed, the immortal officials refine their vermilion forms in the elixir,\nEver enjoying primal blessings, attaining the ultimate jade longevity of truth.\n\nTwenty-First Supreme Ultimate Boundless Radiance Cavernous Subtle Transformative Responsive Heaven. Yu Xie.\n\nThe Heavenly King surnamed Hui, personal name Zhenyue,\nTwenty-Second Great Brahma Nine Mysteries Central Primordial Qi Anagīta Virtue/Power Heaven.\n\nThe Heavenly King surnamed Jie, personal name Nihou,\nTwenty-Third Practicing Brahma Primordial Purity Lower Numinous Qi Sudatta Heaven.\nGeneral Record.\n\nThe Heavenly King surnamed Zhou, personal name Nanshou,\nTwenty-Fourth Ultimate Brahma Cavernous Subtle Nine Numinous No-Need-Belt Anāgāmin Heaven.\nNine Bends.\n\nThe Heavenly King surnamed Zhu, personal name Minghe.\nThe sounds of the Four Heavens, the supreme treasure of Brahma’s Upper Numinous Mystery and Purity qi, reside beneath the August Void’s Upper Clarity.\n\nThe Four Heavenly Kings, on the eight solar terms and the first day of each lunar month, together roam beneath the boundless and infinite empty cavern of the August Void’s Upper Clarity, chanting the sounds of the Four Heavens and the Flying Mystery’s hymn. On these days, they dispatch Perfected Jade Lords to traverse the world. Those who cultivate immortality, practice the Dao, pay homage to the various heavens, burn incense, and recite scriptures have their names memorialized to the Heavenly Kings, who inscribe their names in the Mystery Script. Their lifespans become equal to those of the Four Heavens’ people, and after nine years, they ascend in flight to the Upper Clarity.\n\nThe hymn of the Four Heavens’ Flying Mystery states:\n*Weave the warp and bind the karmic threads,\nGolden roots plant the numinous,\nThe world’s wheel turns the Dharma-flower,\nNine images round and bright,\nDharma drums sound in vermilion tones,\nFlowing chimes ring in the cold courtyard,\nEight winds dance upon the carriage,\nCloud nets exhale jasper,\nJasper and jade resound in emptiness,\nJade wisdom echoes through the cavern,\nAugust radiance embraces orchids,\nVermilion blossoms bloom in glory,\nJade elegance soars on celestial branches,\nLayered voids of purple clarity,\nLofty dawns display their canopies,\nWandering within the golden city,\nEight effulgences harmonize as one,\nNine Emperors unite in assembly,\nFlowing fragrance shades the void,\nAromas scatter across the Great Darkness,\nFlying wheels and feathered canopies,\nAscend into formlessness,\nMerge with qi in perfect union,\nEver tranquil in ultimate longevity.*\n\nTwenty-Fifth Nameless Ultimate Cavernous Subtle Brahma Treasure Heaven. [Text missing]\n\nThe Heavenly King surnamed Jing, named Misty Cloud,\nTwenty-Sixth Subtle Brahma Mysterious Heaven Qi-Belt Fan Virtue/Power Heaven. □□\n\nThe Heavenly King surnamed Luo, named Suo Amo,\nTwenty-Seventh Void Brahma Qi Cicada-Like Wisdom Heaven. □□\n\nThe Heavenly King surnamed Yun, named Wutuo,\nTwenty-Eighth Empty Brahma Central Heaven Achievement-Origin Yitana Heaven. □□\n\nThe Heavenly King surnamed Zhu, named Zhongsheng,\nThe sounds of the Four Heavens, the subtle primordial qi of Upper Origin Brahma Heaven, abide above the Void-Ultimate Great Clarity. The Four Heavenly Kings, on the eight solar terms and the first day of each lunar month, together wander above the boundless, limitless, empty void of the Void-Ultimate Great Clarity, chanting the *Flying Mystery Chapter* of the Four Heavenly Sounds. On these days, they dispatch the Eight Numinous Immortals of the Central Perfected to traverse the world. Those who cultivate immortality, practice the Dao, pay homage to the various heavens, recite scriptures, and invoke goodness—these names are memorialized to the Heavenly Kings, their mysterious writings inscribed. Their lifespan aligns with the people of the Four Heavens, and after nine years of flight, they ascend to the Palace of Great Clarity.\n\nThe *Flying Mystery Chapter* of the Four Heavens states:\nDhāraṇī resounds, jade melodies arise in song,\nVermilion orchids gleam within,\nAuspicious clouds unfurl their plumes,\nEight winds stir the essence,\nJasper tones drift afar,\nVast and distant, the structure soars,\nWings of the Great Empyrean spread,\nPurple phoenixes luxuriate in the void,\nKnotting elegance in layered depths,\nTowering cloud-layers stretch,\nFour directions and eight intersections meet,\nHeavenly Elders and host-immortals,\nFive Emperors witness the court,\nThe Jade Sovereign turns his numen,\nJasper chariots ride the green gales,\nFour Origins guide the reins,\nSix Masters steady the dragons,\nRoaming and gazing through the Four Heavens,\nIlluminating the nine distances,\nHeavenly Perfected unfold their array,\nOur joy is shared in unison,\nMysterious charts are inscribed on tablets,\nNames recorded on purple markers,\nTo join the August Above,\nTogether preserving boundless eons,\nSun and moon in equal radiance,\nEternally abiding without decay.\n\nTwenty-Ninth Supreme Ultimate Boundless Purple Void Cavernous Secluded Brahma Kamaya Heaven.\nWorld-Net.\n\nThe Heavenly King surnamed Xuan, named Hongpao.\nThe Thirtieth Green Brahma Spontaneous Wisdom-Entering Heaven.\nCloud Nine.\n\nThe Heavenly King surnamed Jia, named Shiwenluo.\nThe Thirty-First Mysterious Brahma Great Conduct No-Form No-Thought Wisdom Heaven.\nZongti.\n\nThe Heavenly King surnamed Yi, named Tan’a.\nThe Thirty-Second Heavenly Cloud Brahma Supreme Conduct Wei Xian Adan Heaven.\nZhengqun.\n\nThe Heavenly King surnamed Zhu, named Yunxunbo.\nThe sounds of the Four Heavens, the qi of pure mystery, primordial void, and precious Brahma, abide within the Great Clarity of Non-Being.\n\nOn the eight solar terms and the first days of the lunar months, the Four Heavenly Kings and Emperors roam together above the boundless, limitless, empty void of the Great Clarity. They recite and chant the sounds of the Four Heavens and the Flying Mystery hymns. On these days, they dispatch the Supreme Perfected, Jade Bureau, and Immortal Kings to traverse the world below.\n\nThose who cultivate immortality, practice the Dao, pay homage to the various heavens, recite scriptures, invoke goodness, observe fasts with sincerity, and uphold the laws—their names are memorialized to the Heavenly Kings. Their names are inscribed in mysterious script, and their lifespans become equal to those of the Four Heavens’ people. After nine years of flying ascent, they ascend into the Great Clarity.\n\nThe hymn of the Four Heavens’ Flying Mystery states:\n\nAt the verse’s beginning, come to Heaven,\nCloud Brahma Mysterious A,\nSix qi exhale essence,\nNine images weave the net,\nJasper tones resound in freedom,\nJade chants sing clear songs,\nVoid rhymes harmonize with rhythm,\nCommanding numinous demons,\nPreserving the origin, securing the mystery,\nSix spirits pacified in harmony,\nHeavenly Elders arrive in rectitude,\nMyriad blossoms hold their buds,\nJade Perfected refine and bathe,\nFlying Sovereigns overflow in splendor,\nEight purities adorn the grove,\nUpper radiance scatters blossoms,\nGolden essence flows abundantly,\nJade towers stand lofty,\nFour Perfect Ones open the dawn,\nThe royal immortals’ abode,\nCrimson gates ninefold,\nTreading the sacred steps in dance,\nThirty-six tones,\nAll return to Ti’a,\nThose who know its rhyme,\nAscend to the purple clouds,\nTheir lifespan equal to Heaven’s people,\nTen thousand kalpas without error.\n\nThe Thirty-Third Formless Mysterious Clarity Cavernous Subtle Hari Dharma Heaven.\n\nThe Heavenly King surnamed Wang, named Lingyu.\nThe Thirty-Fourth Cavernous Subtle Mysterious Upper Brahma Qi Akṣobhya Containing Heaven.\n\nThe Heavenly King surnamed Bo, named Duoshizong.\nThe Thirty-Fifth Mysterious Upper Green Brahma Extinction Thusness Heaven.\n\nThe Heavenly King surnamed Zhu, named Tuoyunmi.\nThe Thirty-Sixth Utmost Form Upper Conduct Brahma Nirmāṇarati Preceding Thusness Heaven.\n\nThe Heavenly King surnamed Yuan, named Yuanzhu.\nThe Four Heavenly Sounds—Utmost Void Cavernous Formless Brahma Heaven—resides below the Mundane Void and Great Clarity, within the emptiness of the Cavernous Mysterious Desert. The Four Heavenly Kings, on the eight solar terms and the first day of each lunar month, roam above the Void of Great Clarity, the Boundless, the Limitless, the Empty, the Formless. They recite the Four Heavenly Sounds and the Flying Mystery Hymns. On these days, they dispatch the Supreme Perfected Jade Administrators and the Four Pole Immortal Kings to traverse the world. Those who cultivate immortality, practice the Dao, pay homage to the heavens, recite scriptures, uphold goodness, observe fasts with sincerity, and revere the teachings—these names are memorialized to the Heavenly Kings, inscribed in the records of the Nine Heavens. Their lifespan equals that of the Four Heavenly People, and after nine years of flight, they ascend into the Great Clarity.\n\nThe Flying Mystery Hymn of the Four Heavens states:\nJade mist surges vast,\nFlying fragrance lush and dense,\nThree blossoms radiate the sun,\nDeparting the cinnabar chambers of Li and Luo,\nGolden smelting ten thousand fathoms,\nCrimson clouds ninefold,\nFloating jade buds unfurl,\nCavernous streams bathe the cold palace,\nJade immortals turn left,\nThree heads interflow,\nThe August Supreme shines numinous,\nJade blossoms encircle the dragon,\nSix reins transcend the void,\nRoaming the great emptiness,\nHolding covenant with the Eight Perfected,\nJoining in joy with the Heavenly Kings,\nGaze flowing through the purple dawn,\nPassing through kalpas without end,\nWhistling and chanting jade and jasper,\nTheir harmonies overflowing,\nPerpetual fast of the Nine Origins,\nDual luminaries shine as one,\nAbove transforming, below transmuting,\nSeventy-four directions,\nWe bind our six sixes,\nTo pair with the Perfected as one.\n\nThe names of the thirty-six heavens within arise before the primordial qi of the Cavernous Void. Their literary splendor is inscribed upon Kunlun Mountain. The Highest Tones bear their jade script, the Supreme Ministers compile their wondrous chapters. They receive the natural hymns of the Great Emptiness, their titles emblazoned upon the Mysterious Chart. Above, they govern the Six Realms and the thirty-six sounds; below, they oversee the Nine Lands and the thirty-six Earthly Sovereigns. The numinous chapters flow unimpeded, their jade wisdom fresh and void-bright—all are the roaming songs of the Heavenly Kings, the treasured hymns of the Empty Mystery. Six sixes harmonize in rhyme, four fours align in perfection. The Nine Emperors divide the titles of the thirty-six heavens, myriad qi are wholly subordinate, universally leading the host of immortals. Above, they reach the boundless formless; below, they penetrate the cavernous sources and abysses. All who would become Supreme Perfected and Flying Immortals—without receiving the Jade Sounds, they may not roam and observe the boundless heavens. Those who obtain these texts have their names inscribed by the Heavenly Kings on purple tablets, recorded in the Jade Dawn Register. After thirty-six years, they may ascend to the formless heavens above and penetrate the sources of the Nine Lands below.\n\nThe Supreme Mystery Dao is not transmitted to lesser immortals. To recklessly divulge the treasured sounds is to incur the punishment of seven generations, to bear the knife mountain, to endure the three calamities and five sufferings, for ten thousand kalpas without redemption.\n\nThe Cavernous Abyss Nine Lands Thirty-Six Inscriptions:\n\nFirst Rampart of Color, Moist Earth Right Tone,\nEarthly Sovereign surnamed Qin, named Xiaojingchun.\n\nFirst Rampart of Color, Moist Earth Conducting Tone,\nEarthly Sovereign surnamed Huang, named Changshangwen.\n\nFirst Rampart of Color, Moist Earth Roaming Tone,\nEarthly Sovereign surnamed Qing, named Xuanwenji.\n\nFirst Rampart of Color, Moist Earth Brahma Tone,\nEarthly Sovereign surnamed Fei, named Zhongzhenhuang.\n\nThe Four Colored Earthly Sovereigns of this first rampart bear the earth’s load, encompassing its four extremities without bound or limit, its qi without color. It lies ninety-nine billion miles from heaven. These Earthly Sovereigns, on the day of the Beginning of Spring, ride chariots drawn by green dragons, wielding nine-colored banners. From the palace of the Green Emperor Hu Lao, with a retinue of nine thousand riders upon giant scaled mounts, they ascend to the Yudan Immeasurable Heaven to memorialize the names of those earthbound immortals who have attained the Dao and advanced in learning to the Four Heavenly Kings.\n\nAll who cultivate the Supreme Method should, at dawn on the day of the Beginning of Spring, enter their chamber facing east. With a green brush, they write the Inner Sounds of the Supreme August upon white paper and ingest it. They knock their teeth nine times, visualizing the four Earthly Sovereigns’ surnames and names, all clad in green feathered robes, their heads crowned with Nine Origins Penetrating Heaven Hats. They ride green dragon feathered chariots, flying upward to ascend the Immeasurable Heaven, and recite the incantation:\n\nGreen Yang announces ascent,\nEarthly Sovereigns witness the dawn,\nGoverning the Four Offices,\nUniversally overseeing the myriad immortals,\nHeavenly Elders determine the records,\nSupreme memorials are presented,\nDiligent in supreme vows,\nAttaining the Dao without partiality,\nMay the imperial tablets be inscribed,\nNames carved in the Jade Chapters,\nNine ramparts erase traces,\nFlying scenes of jasper chariots,\nLifespan equal to the Four August Ones,\nEternally safeguarding the firmament.\n\nUpon completion, they bow nine times toward the east, swallow qi nine times, and cease. Thus, the Earthly Sovereigns list their names in the Nine Heavens and Nine Lands, erasing their traces from the Nine Yin. The Earthly Offices provide protection, the Hu Lao Ministers welcome them. After thirty-six years, they may ride green feathered flying chariots to ascend the Immeasurable Heaven.\n\nSecond Rampart of Strength, Colored Earth Right Tone,\nEarthly Sovereign surnamed Wu, named Kunwenguang.\n\nSecond Rampart of Strength, Colored Earth Conducting Tone,\nEarthly Sovereign surnamed Yu, named Huangmusheng.\n\nSecond Rampart of Strength, Colored Earth Roaming Tone,\nEarthly Sovereign surnamed Xuan, named Qiandewi.\n\nSecond Rampart of Strength, Colored Earth Brahma Tone,\nEarthly Sovereign surnamed Chang, named Huangmeng.\n\nThe Four Colored Earthly Sovereigns of this second rampart bear the earth’s load, encompassing its four extremities without bound or limit, its qi without color. It lies eighty-one billion miles from the first rampart. These Earthly Sovereigns of the second rampart, on the day of the Spring Equinox, ride upon the dual qi of yellow and azure, twelve dark turtles bearing the Nine Origins Wands of the Divine August. From the palace of the Green Emperor Hu Lao, with a retinue of eight thousand flying armored riders, they ascend to the Supreme Meditation Goodness Immeasurable Longevity Heaven to memorialize the names of those earthbound immortals who have attained the Dao and advanced in learning to the Four Heavenly Kings.\n\nWhenever studying the superior method, on the day of the Spring Equinox at dawn, enter the chamber facing east. With a green brush, inscribe the Earthly Sovereign’s inner sound upon yellow paper and ingest it. Strike the teeth nine times, and visualize the four Earthly Sovereigns’ surnames and given names, all clad in yellow brocade flying skirts, heads crowned with Flat-Heaven coronets. They ride upon a cloud chariot of dual qi—yellow and azure—twelve dark turtles bearing the Nine Origins Wands of the Divine August. From the palace of the Green Emperor Hu Lao, with a retinue of eight thousand flying armored riders, they ascend to the Supreme Meditation Goodness Immeasurable Longevity Heaven. Then recite the incantation:\n\n*\"Three Ways traverse the course,\nSeasonal nodes attend the origin.\nNine ramparts sustain,\nEight gates broadly govern.\nEarthbound immortals are universally surveyed,\nTheir names ascend to the Imperial Lord.\nHeavenly Elders fix the records,\nEarthly Sovereigns inscribe the texts.\nOn this day of supplication,\nMy Dao was early apportioned.\nTraces alight upon the Nine Yin,\nSoaring scenes merge with pristine clouds.\nFour qi harmonize as one,\nAugust personages gather in throngs.\"*\n\nUpon completion, bow eight times toward the east, swallowing qi eight times, then cease.\n\nPracticing this for thirty-six years, one attains the ability to ride the flying cloud chariot and ascend to the Meditation Goodness Immeasurable Longevity Heaven.\n\n---\n\nThe third rampart, of stone-fat luster and Earthly Upright Tone,\nEarthly Sovereign surnamed Zhang, named Weishenbao.\n\nThe third rampart, of stone-fat luster and Earthly Conduct Tone,\nEarthly Sovereign surnamed Zhou, named Boshangren.\n\nThe third rampart, of stone-fat luster and Earthly Roaming Tone,\nEarthly Sovereign surnamed Zhu, named Mingchezi.\n\nThe third rampart, of stone-fat luster and Earthly Brahma Tone,\nEarthly Sovereign surnamed Geng, named Wenjingshi.\n\nThe four Earthly Sovereigns of this third rampart bear the earth’s load, encompassing its four extremities without bound or limit, its qi without color. It lies one hundred ten billion miles from the second rampart. These Earthly Sovereigns of the third rampart, on the day of the Summer Commencement, ride upon crimson rosy clouds, twelve phoenixes bearing the Five-Colored Standards. From the palace of the Yue Elder, with a retinue of eight thousand flying armored riders, they ascend to the Xu Yan Heaven to memorialize the names of those earthbound immortals who have attained the Dao and advanced in learning to the Four Heavenly Kings.\n\nWhenever studying the superior method, on the day of the Summer Commencement after the meal, enter the chamber facing south. With a vermilion brush, inscribe the Earthly Sovereign’s inner sound upon white paper and ingest it. Strike the teeth nine times, and visualize the four Earthly Sovereigns’ surnames and given names, all clad in crimson-patterned flying skirts, heads crowned with the Boundless Advancing Worthies coronet. They ride upon crimson rosy clouds, twelve phoenixes bearing the Five-Colored Standards, flying upward to ascend to the Xu Yan Heaven. Then recite the incantation:\n\n*\"Four qi converge at the center,\nEight directions assemble in court.\nAuspicious dawn attends the rectitude,\nNine ramparts unfurl their splendor.\nGrasping the records, life’s immortals\nAscend to the Purple Empyrean.\nNames arrayed in the August Texts,\nPromoted to celestial offices.\nAttaining the vermilion radiance,\nCarefree they ride the soaring gales.\nYears equaling the Three Luminaries,\nUtmost heaven knows no decay.\"*\n\nUpon completion, bow eight times toward the south, swallowing qi eight times, then cease.\n\nPracticing this for thirty-six years, one attains the ability to ride the flying cloud chariot and ascend to the Xu Yan Heaven.\n\n---\n\nThe fourth rampart, of lustrous Earthly Upright Tone,\nEarthly Sovereign surnamed Jia, named Yunzigao.\n\nThe fourth rampart, of lustrous Earthly Conduct Tone,\nEarthly Sovereign surnamed Xie, named Bowuyuan.\n\nThe fourth rampart, of lustrous Earthly Roaming Tone,\nEarthly Sovereign surnamed Ji, named Wenqinchen.\n\nThe fourth rampart, of lustrous Earthly Brahma Tone,\nEarthly Sovereign surnamed Xing, named Jizhengfang.\n\nThe four Earthly Sovereigns of this fourth rampart bear the earth’s load, encompassing its four extremities without bound or limit, its qi without color. It lies twenty billion miles from the third rampart. These Earthly Sovereigns of the fourth rampart, on the day of the Summer Solstice, ride upon a crimson rosy cloud chariot, twelve vermilion birds bearing the Banner of Life’s Demons. From the palace of the Yue Elder Immortal, with a retinue of eight thousand flying armored riders, they ascend to the Tranquil Heaven to memorialize the names of those earthbound immortals who have attained the Dao and advanced in learning to the Four Heavenly Kings.\n\nWhenever studying the superior method, on the day of the Summer Solstice at noon, enter the chamber facing south. With a vermilion brush, inscribe the Earthly Sovereign’s inner sound upon yellow paper and ingest it. Strike the teeth nine times, and visualize the four Earthly Sovereigns’ surnames and given names, all clad in yellow-green skirts, heads crowned with the Far-Roaming coronet. They ride upon a crimson rosy cloud chariot, twelve vermilion birds bearing the Banner of Life’s Demons, flying upward to ascend to the Tranquil Heaven. Then recite the incantation:\n\n*\"Heaven clarifies, earth settles,\nNine soils luxuriate in mystery.\nFour movements govern the dawn,\nAscending to partake of the Purple Heaven.\nWandering the flying chariot,\nFeasting upon scenes without interval.\nEight assemblies exchange felicitations,\nJade Void unfolds its array.\nAugust Elders list the names,\nHeavenly Kings inscribe the scrolls.\nNine ramparts excise death,\nLife’s Mandate engraves the years.\nThe body enters the Flowery Dawn,\nEternally preserving the superior immortals.\"*\n\nUpon completion, bow eight times toward the south, swallowing qi eight times, then cease.\n\nPracticing this for thirty-six years, one attains the ability to ride the crimson cloud chariot and ascend to the Tranquil Heaven.\n\n---\n\nThe fifth rampart, of golden millet luster and Earthly Upright Tone,\nEarthly Sovereign surnamed Hua, named Yanqiming.\n\nThe fifth rampart, of golden millet luster and Earthly Conduct Tone,\nEarthly Sovereign surnamed Huang, named Lingworong.\n\nThe fifth rampart, of golden millet luster and Earthly Roaming Tone,\nEarthly Sovereign surnamed Yun, named Tanyuanyuan.\n\nThe fifth rampart, of golden millet luster and Earthly Brahma Tone,\nEarthly Sovereign surnamed Jiang, named Tongbaguang.\n\nThe four Earthly Sovereigns of this fifth rampart bear the earth’s load, encompassing its four extremities without bound or limit, its qi without color. It lies twenty billion miles from the fourth rampart. These Earthly Sovereigns of the fifth rampart, on the day of the Autumn Commencement, ride upon a plain cloud chariot, twelve white tigers bearing the Nine Origins Writs of Life’s Numinous Power. From the palace of the Di Elder Immortal, with a retinue of six thousand flying tiger riders, they ascend to the Unhaughty Joy Heaven to memorialize the names of those earthbound immortals who have attained the Dao and advanced in learning to the Four Heavenly Kings.\n\nWhenever studying the superior method, on the day of the Autumn Commencement at the evening meal hour, enter the chamber facing west. With a white brush, inscribe the Earthly Sovereign’s inner sound upon green paper and ingest it. Strike the teeth nine times, and visualize the four Earthly Sovereigns’ surnames and given names, all clad in plain silk flying skirts, heads crowned with the Nine Origins Luminous Treasure coronet. They ride upon a plain cloud chariot, twelve white tigers bearing the Nine Origins Writs of Life’s Numinous Power, flying upward to ascend to the Unhaughty Joy Heaven. Then recite the incantation:\n\nResplendent radiance illumines the brilliance, the ninefold white gates of the celestial palace. The four seasons turn through the Brahma-boundaries; at the auspicious dawn, the Sovereign is addressed. The primal effulgence governs destiny, recording the names before the Heavenly Kings. Inscribed upon the Emperor’s tablets, they ascend to memorialize in the Azure Palace. The nine yin extinguish the corpse, and the body soars to the Flower Chamber, eternally preserving the status of superior immortals, where the Three Dawns shine as one.\n\nUpon completion, face west and bow six times from the heart, swallowing qi six times before ceasing. Practicing this for thirty-six years, one attains the jade chariot of plain clouds, ascending to the Unhaughty Joy Heaven.\n\nThe **Sixth Rampart’s** Vajra Marsh Earth **Upright Tone**:\nEarth Sovereign surnamed Li, given name Shang Shaojun.\n\nThe **Sixth Rampart’s** Vajra Marsh Earth **Acting Tone**:\nEarth Sovereign surnamed Fan, given name Lai Lian.\n\nThe **Sixth Rampart’s** Vajra Marsh Earth **Roaming Tone**:\nEarth Sovereign surnamed Chang, given name Li Jiyuan.\n\nThe **Great Rampart’s** Vajra Marsh Earth **Brahma Tone**:\nEarth Sovereign surnamed Wang, given name Si Nürong.\n\nThe four Earth Sovereigns of the six ramparts’ tones govern the earth, which extends boundlessly in all four directions—inexhaustible, infinite, formless qi—twenty billion miles beyond the Fifth Rampart.\n\nThus, the Earth Sovereigns of the Sixth Rampart, on the day of the Autumn Equinox, ride a plain cloud flying chariot, twelve white tigers bearing the nine-colored banners of spirit command, accompanied by the *Dilao* immortal officials and six thousand celestial tiger riders, ascending to the Responsive Transformation Heaven to memorialize the names of those earthbound immortals who have attained the Dao and advanced in learning to the Four Heavenly Kings.\n\nWhenever studying the superior method, on the day of the Autumn Equinox at the evening meal hour, enter the chamber facing west. With a white brush, inscribe the Earthly Sovereign’s inner sound upon green paper and ingest it. Strike the teeth nine times, and visualize the four Earthly Sovereigns’ surnames and given names, all clad in plain silk flying skirts, heads crowned with the Boundless Advancing Worthies coronet. They ride upon a plain cloud chariot, twelve white tigers bearing the nine-colored banners of spirit command, flying upward to ascend to the Responsive Transformation Heaven. Then recite the incantation:\n\nWhite Earth’s nine ramparts,\nqi connects to the Grand Tenuity.\nThe August Elders attend the dawn,\nsoaring effulgences linger.\nVermilion orchids gleam in array,\nthe Eight Flowers radiate brilliance.\nAscending into the Emperor’s court,\none parts the jade portals.\nThe Five Vows meet in mystery,\ndescending to bestow feathered robes.\nThe Eight Effulgences unite in perfection,\nthe form attains ascending flight.\nDestiny aligns with Heaven and Earth,\neternally preserving the Two Modes.\n\nUpon completion, face west and bow six times from the heart, swallowing qi six times before ceasing. Practicing this for thirty-six years, one attains the jade chariot of plain clouds, ascending to the Responsive Transformation Heaven.\n\nThe **Seventh Rampart’s** Water-Restraining Marsh Earth **Upright Tone**:\nEarth Sovereign surnamed Tang, given name Chusheng Ying.\n\nThe **Seventh Rampart’s** Water-Restraining Marsh Earth **Acting Tone**:\nEarth Sovereign surnamed Wu, given name Zheng Fatu.\n\nThe **Seventh Rampart’s** Water-Restraining Marsh Earth **Roaming Tone**:\nEarth Sovereign surnamed Han, given name Gaowen Che.\n\nThe **Seventh Rampart’s** Water-Restraining Marsh Earth **Brahma Tone**:\nEarth Sovereign surnamed Jing, given name Zhong Longshou.\n\nThe four Earth Sovereigns of the seven ramparts’ tones govern the earth, which extends boundlessly in all four directions—inexhaustible, infinite, formless qi—twenty billion miles beyond the Sixth Rampart.\n\nThus, the Earth Sovereigns of the Seventh Rampart, on the day of Winter Commencement, ride a dark cloud flying chariot, twenty-four black tortoises bearing the five-colored banners of life’s numinous power, accompanied by the *Qianglao* immortal officials and five thousand celestial riders, ascending to the Brahma Treasure Heaven to memorialize the names of those earthbound immortals who have attained the Dao and advanced in learning to the Four Heavenly Kings.\n\nWhenever studying the superior method, on the day of Winter Commencement at the midnight hour, enter the chamber facing north. With black ink, inscribe the Earthly Sovereign’s inner sound upon white paper and ingest it. Strike the teeth nine times, and visualize the four Earthly Sovereigns’ surnames and given names, all clad in dark spirit-brocade flying skirts, heads crowned with the Boundless Advancing Worthies coronet. They ride upon a dark cloud flying chariot, twenty-four black tortoises bearing the five-colored banners of life’s numinous power, flying upward to ascend to the Brahma Treasure Heaven. Then recite the incantation:\n\nThe Five Qi intertwine as sashes,\nthe Eight Spirits return to the court.\nThe Three Origins attend in rectitude,\nthe Earth Sovereign commands the numinous.\nCloud chariots and feathered canopies\nascend to the lofty clarity.\nThe Great Vow unfolds in array,\nI receive the formless.\nThe nine ramparts erase traces,\nthe celestial perfected inscribe names.\nBound in the mysterious chart,\nreceiving the title of Flowery Azure,\none attains the flying effulgence,\ntransforming to enter the Emperor’s court.\n\nUpon completion, bow five times from the heart, swallowing qi five times before ceasing. Practicing this for thirty-six years, one attains the chariot of dark clouds, ascending to the Brahma Treasure Heaven.\n\nThe **Eighth Rampart’s** Great Wind Marsh Earth **Upright Tone**:\nEarth Sovereign surnamed Ge, given name Xuan Shengxian.\n\nThe **Eighth Rampart’s** Great Wind Marsh Earth **Acting Tone**:\nEarth Sovereign surnamed Hua, given name Maoyun Chang.\n\nThe **Eighth Rampart’s** Great Wind Marsh Earth **Roaming Tone**:\nEarth Sovereign surnamed Yang, given name Zhen Dongxuan.\n\nThe **Eighth Rampart’s** Great Wind Marsh Earth **Brahma Tone**:\nEarth Sovereign surnamed Zhou, given name Shang Jingyuan.\n\nThe four Earth Sovereigns of the eight ramparts’ tones govern the earth, which extends boundlessly in all four directions—inexhaustible, infinite, formless qi—eighty billion miles beyond the Seventh Rampart.\n\nThus, the Earth Sovereigns of the Eighth Rampart, on the day of the Winter Solstice, ride a dark cloud flying chariot, five-colored flying unicorns bearing the nine-colored tablets, accompanied by the *Qianglao* immortal officials and five thousand celestial riders, ascending to the Brahma *Kāmadhātu* Heaven to memorialize the names of those earthbound immortals who have attained the Dao and advanced in learning to the Four Heavenly Kings.\n\nWhenever studying the superior method, on the day of the Winter Solstice at the midnight hour, enter the chamber facing north. With black ink, inscribe the Earthly Sovereign’s inner sound upon white paper and ingest it. Strike the teeth nine times, and visualize the four Earthly Sovereigns’ surnames and given names, all clad in dark cloud brocade skirts, heads crowned with the Heaven-Penetrating Treasure Coronet. They ride upon a dark cloud feathered chariot, five-colored flying unicorns bearing the nine-colored tablets, flying upward to ascend to the Brahma *Kāmadhātu* Heaven. Then recite the incantation:\n\nHeaven unfolds, Earth arrays,\nthe Nine Images emulate the mysterious.\nThe Four Measures ascend and descend,\nthe Eight Qi renew in clarity.\nThe Earth Sovereign’s register is inscribed,\nthe Jade Emperor confirms the perfected.\nNames are inscribed upon the celestial chart,\nI attain the status of superior immortal.\nFlying through the Great Void,\nsoaring effulgences move naturally.\nIn harmony with the numinous,\nin unity with qi, eternally abiding.\nThree transformations, nine transmutations,\nascending into the Emperor’s dawn.\n\nUpon completion, bow four times in the heart and swallow qi four times to conclude. Practicing this for thirty-six years, one attains the dark cloud chariot and ascends to the *Kāmadhātu* Heaven of Brahma. The ninth stratum of the Abyssal Cavern, the Formless Rigid Axis of Earth Qi’s true tone—\nthe Earth Sovereign’s surname is *Ji*, personal name *Wu Shang Xuan*.\nThe ninth stratum of the Abyssal Cavern, the Formless Rigid Axis of Earth Qi’s moving tone—\nthe Earth Sovereign’s surname is *Sheng*, personal name *Xu Yuan Hao*.\nThe ninth stratum of the Abyssal Cavern, the Formless Rigid Axis of Earth Qi’s roaming tone—\nthe Earth Sovereign’s surname is *Zhao*, personal name *Shang Bo Xuan*.\nThe ninth stratum of the Abyssal Cavern, the Formless Rigid Axis of Earth Qi’s Brahma tone—\nthe Earth Sovereign’s surname is *Nong*, personal name *Le Yuan Bo*.\n\nTo the right: the nine strata of the earth’s ultimate depths, the Abyssal Cavern’s source, the Rigid Axis of Heaven and Earth, governs so that one does not fall. Above, it is five hundred twenty billion *li* from the first stratum; below, it is boundless, without end or border, all pervaded by the qi of the Rigid Axis. The Earth Sovereigns of the ninth stratum, on the first day of the third month, the second day of the sixth month, the third day of the ninth month, and the fourth day of the twelfth month—four times a year—ride a five-colored cloud chariot, nine-colored flying dragons bearing the writ of the Central Origin’s life-spirit, accompanied by the Elder Immortal Officials, a radiant heavenly host of twelve thousand feathered riders, ascending to the *Pāriyātraka* Heaven to report the names of those who have attained immortality through the nine earths’ Dao. For those studying the superior method, on these days enter the chamber, face the Grand Year Star, inscribe in yellow on white paper the inner tones of the four Earth Sovereigns and wear them, strike the teeth twelve times, and visualize the surnames and personal names of the four Earth Sovereigns, all clad in dark and yellow five-colored robes, heads crowned with the Nine Origins Heaven-Penetrating Treasure Coronet, feet shod in five-colored slippers woven with lion patterns, bearing the life-preserving talisman of the tattooed body, riding a yellow auroral flying chariot, accompanied by thirty-six Jade Maidens of the Five Thearchs, flying upward to ascend to the *Pāriyātraka* Heaven. Then recite the incantation:\n\nThe Two Images revolve in cycles,\nthe Nine Essences penetrate the numinous.\nThe Elder Thearchs respond to the tally,\nsoaring through the void to enter clarity.\nFourfold connections, eightfold thoroughfares,\nflying auroras and purple jades.\nAscending to the Golden Flower,\npaying homage before the Emperor’s numen.\nInscribed in the immortal register,\nnames carved in the Azure Palace.\nAttaining the Dao’s white writ,\nsealed with the seven numina.\nThe nine strata extinguish the corpse,\nthe Eastern Well refines the form.\nThe Three Origins descend the perfected,\nmy Dao is now luminous.\nI attain the flying effulgence,\nascending to the Jade Court.\n\nUpon completion, bow nine times in the heart and swallow qi twelve times to conclude. Practicing this for thirty-six years, one attains the yellow auroral flying chariot and ascends to the *Pāriyātraka* Heaven. The nine earths and nine strata descend ninefold, corresponding to thirty-six tones and thirty-six Earth Sovereigns, aligning above with the thirty-six heavens and at the center with the thirty-six states. These Earth Sovereigns all hold ranks equal to the Jade Emperor’s title, differing only in the division of qi they govern and the distinctions of their names above and below. Every thirty-six years, the Earth Sovereigns transform their titles, ascending to the Upper Clarity Palace to inherit the rulership of the thirty-six heavens. The officials of the Jade Bureau, beneath the nine strata, all report the names of those who have attained immortality through the Dao to the Nine Heavens’ Heavenly Kings. Those who study without knowing the inner names of the nine strata’ earth tones and thirty-six Earth Sovereigns will not have their traces extinguished in the nine earths; the Nine Heavens’ Chancellor will not accept their names, the Five Marchmounts will not descend cloud chariots, the Five Thearchs will not protect their bodies, and though they may master foreign tones, they will not ascend through the empty void.\n\nThus, Heaven, Earth, and Human each receive the qi of the three threes, and only when the three unite as the perfected can one attain immortality. Those who know the inner names of the nine earths’ tones and thirty-six Earth Sovereigns will have the Nine Qi Elder constantly guarded by four directions’ five-colored numinous officials, protecting their bodies in all movements, ascending and traversing the Five Marchmounts. Immortal officials will attend and escort them, dispelling demonic trials, summoning divine perfected beings, flying through the void in nine years, sitting in disappearance and standing in vanishing. In thirty years, they will ascend to the Great Clarity. Those who possess this text in the world will have the Seven Mysteries’ Ancestor serve as the Nine Qi Life-Spirit Earth Sovereign’s official, safeguarding their forms, comforting their souls, and driving away the *Hao Li* elders and Earth Chancellor’s karmic entanglements, freeing them from confinement, punishment, and servitude. Dwelling in the world, they will be secure and free from misfortune; the twelve guardian generals will encamp and defend the eight gates, connecting with the perfected and summoning the divine. They may become wealthy if they wish, attain office if they wish, become immortals if they wish, or become divine if they wish.\n\nThis Dao is secret and wondrous, not to be idly spoken of. The Highest Oral Instructions and Precious Scrolls of the Upper Minister Azure Lad are transmitted only to those who receive them. Recklessly divulging the numinous text will condemn one’s seven ancestors to servitude, irredeemable for ten thousand kalpas. When ascending mountains to dwell or settling in a residence, to discern the land’s auspiciousness or inauspiciousness, on a *wu* or *ji* day, inscribe in yellow the thirty-six earth tones of the nine strata on white paper and place it at the center of the dwelling, covering it with a basin. After three nights, uncover and examine it: if the paper is moist and yellow, it is greatly auspicious; if it is green, there are dead spirits’ corpses below; if it is white, it is inauspicious.\n\nIf the color appears red, there will be fright and terror; if black, there will be treasures; if purple, one will attain immortality as a divine transcendent. If none of these colors differ, then cease further inquiry—one may dwell in peace for three years, but beyond this, misfortune and harm will surely follow.\n\n**The Six True Tones of the Highest Outer Realms**\n\n**The Land of Heluoti in the East:**\nFirst Inscription: The true tone is *Wu Yi*.\nSecond Inscription: The true tone is *Boni*.\nThird Inscription: The true tone is *Jiu Nan*.\nFourth Inscription: The true tone is *Ji Wei*.\nFifth Inscription: The true tone is *Wu Si*.\nSixth Inscription: The true tone is *Yun Zhi*.\n\nBeyond nine hundred thousand *li* east of the Middle Kingdom lies the Land of Heluoti, also called the Star Realm. Beyond its borders stands Fusang, amid the Azure Sea, spanning ten thousand *li*. Atop it stands the Palace of the Supreme Emperor, a secondary abode of the Perfected True King. There grows an upper-born forest resembling mulberry trees, each towering thousands of *zhang*, the largest three thousand *wei* in girth. They grow in pairs from the same root, bearing crimson fruit like mulberries, which immortals consume. Their bodies take on a golden radiance, and their fruit ripens but once every nine thousand years.\n\nFurther out lies Shengzhou, beyond Fusang, bordering Penglai to the west. Its land spans two thousand five hundred *li*, twenty-three thousand *li* from shore, and is home to tens of thousands of immortals. The land knows no cold or heat, its climate ever temperate, and abounds with divine transcendent herbs. Those who consume them may soar through the air.\n\nEast of Fusang lies Zuzhou, amid the Eastern Sea, spanning five hundred *li*, seven thousand *li* from shore. Upon it grows the herb of immortality, resembling wild rice shoots, three to four *chi* in length, also called the *Yangshen Zhi* (Nurturing-Spirit Mushroom). Its leaves resemble those of wild rice, growing not in clusters but singly. One who consumes a single stalk may ascend to the Upper Clarity in flight. Even the dead may be revived if covered with it—truly a wondrous and divine medicine. Those who enter this land must know its name. By meditating upon the immortal official Hu Lao and gathering the herb from Zuzhou, visualizing its color and ingesting it, after three years one’s face will radiate flowing light, and life will extend for ten thousand years. Over time, immortals will naturally bestow this divine substance, delivering it to the practitioner.\n\n**The Land of Yishatuo in the South:**\nFirst Inscription: The true tone is *Ying Hua*.\nSecond Inscription: The true tone is *Wang Jia*.\nThird Inscription: The true tone is *Wo Mo*.\nFourth Inscription: The true tone is *Yao Pa*.\nFifth Inscription: The true tone is *Wu Du*.\nSixth Inscription: The true tone is *Fei Pu*.\n\nBeyond eighty-one thousand *li* south of the Middle Kingdom lies the farthest reaches of Jambudvīpa, the wilds of Dongyang, the Land of Yishatuo, also called the Celestial Fire Court of Tianzhu. Beyond its borders lies Changzhou, also called Qingqiu, in the southern sea of Chen and Si, spanning five thousand *li*, twenty-five thousand *li* from shore. There grow great trees, three thousand *zhang* tall and two thousand *wei* in girth, abundant with divine medicines, sweet nectar, and jade blossoms—nothing is lacking. Its inhabitants live for three hundred and sixty years. There are also spirit foxes, as large as dogs, their fur in five colors. Their cries resound for four thousand *li*, and their majesty subdues tigers, leopards, and all beasts. Those who wear their fur live as long as heaven and earth.\n\nTo the left stands Wind Mountain, where constant rumbling echoes. Atop it lies the Purple Mansion Palace, where divine transcendent jade maidens wander and observe. Further lies Yanzhou, at the center of the Southern Sea, spanning two thousand *li*, nine thousand *li* from shore. Upon it dwells the Wind-Born Beast, resembling a leopard, blue in color, and as large as a wildcat. Its body blazes with fire that reaches the heavens, burning for months without dying, its fur unscorched. Blades cannot pierce it, and only after striking its head thousands of times with an iron hammer does it perish. If it opens its mouth to the wind, it revives in moments. Plugging its nostrils with *shi shang changpu* (stone-surface calamus) kills it. Taking its brain and mixing it with chrysanthemum blossoms to consume grants life as enduring as heaven and earth.\n\nThere is also Fire Forest Mountain, where the Fire-Light Beast dwells, as large as a rat, its fur three to four *cun* long, either red or white. Gazing at the mountain’s forests and these beasts at midnight, their light shines like burning flames. Weaving their fur into cloth produces *huohuan bu* (fire-washed cloth). If slightly soiled, burning it restores its freshness. The people of Yishatuo wear this cloth, and immortals descend in its likeness. Scholars who meditate upon the land’s tones and contemplate the immortal official Yue Lao for thirty-six years will have divine beings present these beasts and other wondrous treasures of the land to them.\n\n**The Land of Niweiluolüna in the West:**\nFirst Inscription: The true tone is *Hua Lian*.\nSecond Inscription: The tone is *Ri Gao Xuan*.\nThird Inscription: The tone is *Ri Ming Shen*.\nFourth Inscription: The tone is *Ri Tu Chan*.\nFifth Inscription: The tone is *Ri Xing Zhen*.\nSixth Inscription: The tone is *Ri Zhu Tian*.\n\nBeyond sixty thousand *li* west of the Middle Kingdom lies the farthest reaches of Juxieni, the bleak and frigid wilds of Haosu, the Land of Niweiluolüna, also called the Cloud Barbarian Moon-Branch Land. Its people live for six hundred years. Beyond its borders lies Liuzhou, in the southern part of the Western Sea, spanning three thousand *li*, nineteen thousand *li* from the eastern shore, home to tens of thousands of immortals. Upon it stands a mountain where *kunwu* stone is found. Forged into iron and crafted into swords, their brilliance illuminates caves like crystal, cutting jade as easily as earth.\n\nFenglínzhou lies at the sea’s center, spanning one thousand five hundred *li*, surrounded by weak waters where even goose feathers cannot float. It is home to thousands of immortals and flocks of phoenixes and qilin. There dwells the Ji Guang Beast, resembling a wildcat, capable of human speech, its voice like Sanskrit chanting. It communicates with the land’s people, its fur radiant with light, worn only by immortals.\n\nObtaining its fur grants life as enduring as heaven and earth. Those who master the land’s speech shall, after thirty-six years as an elder immortal official, present the *kunwu* sword and the Ji Guang Beast to the Supreme One.\n\n**The Land of Xunta Luo in the North**\n**First Inscription:** Sounds as \"Xuanjia.\"\n**Second Inscription:** Sounds as \"Wenduo.\"\n**Third Inscription:** Sounds as \"Shanlu.\"\n**Fourth Inscription:** Sounds as \"Wudu.\"\n**Fifth Inscription:** Sounds as \"Yingjia.\"\n**Sixth Inscription:** Sounds as \"Xuanmo.\"\n\nFive hundred thousand *li* north of the Middle Kingdom lies the extreme of the northern darkness, the court of the Celestial Curtain—known as the Land of Xunta Luo, or the Land of the Heavenly Mirror. Its people live three hundred years. Beyond its borders lies Xuanzhou, spanning seven thousand two hundred *li*, surrounded by seas thirty-six thousand *li* from shore. Above stands the Great Mysterious Capital, governed by the Immortal Lord Zhen Gong. There dwells the Longevity Mandarin Duck, resembling floating mist. Many hills rise there, called Wind Mountain, which borders the northwestern gate of heaven. Its halls and chambers are of gold and jade, yielding golden jade and purple lingzhi, governed by the Three Heavens.\n\nBeyond it lies Yuanzhou, spanning three thousand *li*, ten thousand *li* from its southern shore. There grow the Five Lingzhi of the Mysterious Gorge, whose waters flow like honey. Drinking them grants life equal to heaven and earth. Thirty thousand immortals dwell there, all drinking this water to attain deathless transcendence. Those who master the land’s speech shall, after thirty-six years as an elder immortal official, offer the Five Lingzhi Water of the Mysterious Gorge.\n\n**The Land of Primordial Essence and Pristine Chaos in the Upper Realm**\n**First Inscription:** True sound, \"Chonghuan.\"\n**Second Inscription:** True sound, \"Yujin.\"\n**Third Inscription:** True sound, \"Sanlin.\"\n**Fourth Inscription:** True sound, \"Zhengjing.\"\n**Fifth Inscription:** True sound, \"Xiqin.\"\n**Sixth Inscription:** True sound, \"Lüying.\"\n\nAbove the Nine Heavens, within the vast emptiness of pure yang, where form and shadow dissolve into the void—there lies the Land of Primordial Essence and Pristine Chaos, also called the Land of the Abyssal Azure Expanse. It is a world perfumed by pure *qi*, boundless above, covering all heavens below. Only the Jade Void and Purple Pavilion weave mist through the hollow emptiness, nestled within the Pristine Azure Chaos. Those who master the loftiest celestial speech shall receive from the heavens the method of ascending as a flying immortal.\n\n**The Land of Supreme Harmony and Boundless Treasure Truth in the Central Realm**\n**First Inscription:** True sound, \"Shanlu.\"\n**Second Inscription:** True sound, \"Shijia.\"\n**Third Inscription:** True sound, \"Cuo’e.\"\n**Fourth Inscription:** True sound, \"Yinghua.\"\n**Fifth Inscription:** True sound, \"Dipan.\"\n**Sixth Inscription:** True sound, \"Luona.\"\n\nThe Middle Kingdom spans one hundred twenty million *li* in circumference, its depths reaching the Great Wind Marsh five hundred twenty million *li* across. At its center stands Kunlun, encircled by weak waters. The mountain rises thirty-six thousand *li* above the plain, its summit triangular, each face ten thousand *li* in length, shaped like an inverted basin—narrow at the waist, broad above. One peak points due north, infused with the essence of the Chen star, called the Terrace of Soaring Winds. Another faces west, named the Terrace of the Mysterious Garden. The third points east, called the Kunlun Palace. In one place, gold accumulates to form the Celestial Rampart City, a thousand *li* on each side. Upon it stand five golden terraces and twelve jade towers. To the north lie the Mountain of the Northern Gate and the Mountain of the Abyssal Spring, along with their subsidiary peaks. There are also rampart cities, golden terraces, and jade towers, all identical in splendor—gleaming towers of refined essence, halls of luminous azure, chambers of jasper radiance, vermilion chambers of purple and cinnabar, where rosy clouds illuminate the sun and crimson auroras glow with ninefold brilliance. Here rules the Queen Mother of the West. Above, it connects to the Celestial Mechanism, where primordial *qi* flows and spreads. The Five Constants and Jade Balance universally guide the influx from the Nine Heavens’ abysses, serving as the root of myriad immortals, the pivot of heaven and earth, the handle of all measures.\n\nGold and silver trees grow here, forests of jade branches and cinnabar treasures, their boughs draped in resplendent tassels, their fruits formed of refined jade. Each tree is inscribed with the thirty-six celestial scripts of the heavens and the languages of the thirty-six lands. Above soar purple falcons, phoenixes, white sparrows, vermilion owls, *kun* pheasants, spirit magpies, red birds, and azure magpies. Below, flying birds and wandering beasts thrive alongside Kunlun, never knowing death or decay. Yet the sacred texts of the Mysterious Scriptures and the hidden writings of ancient characters—comprising one thousand two hundred million words—lie upon the northern slope of the Accumulated Stones in the Mysterious Garden. Ninety thousand immortals dwell there, scattered across the numinous mountain. Those who recite the celestial sounds of the heavens, the thirty-six languages of foreign lands, and the nine subterranean tones for nine years shall have immortals descend to bestow the mountain’s divine wonders. After thirty-six years, they shall ascend Kunlun upon a five-colored cloud chariot.\n\nThe Most High addresses the Supreme Minister, the Azure Youth: All celestial writings of the thirty-six lands and nine earthly realms are the primordial, hollow, and empty scriptures—natural chapters of the highest truth. From the Supreme Thearch and the Imperial Sovereigns below, to those who study immortality and attain the Dao, none fail to receive these sounds from the Supreme Truth. Bearing these texts in their travels, they command the awe of all spirits, subdue demons, summon essences, traverse the Five Peaks, and enter the Three Armies—always escorted by the Nine Heavens’ guards, attended by the Four Directors. After nine years, they ascend to the Three Origins’ chambers. After thirty-six years, heaven sends a cloud chariot to carry them aloft into the Upper Clarity.\n\nTo receive these sounds, use azure silk as the ground and a yellow brush to inscribe the text. On the night of the *jiazi* day, at midnight, perform an open-air libation in the central courtyard. Offer seasonal delicacies, three *dou* of clear wine, nine plates, and nine cups, arranged within a nine-*chi* square of azure silk. Present the texts accordingly. The disciple shall offer nine taels of gold and thirty-six *chi* of figured silk, prostrating toward the south.\n\nThe master faces north, striking the teeth thirty-six times in succession. Above, he petitions the Nine Heavens’ Chancellor; at the center, the Five Emperors and Five Spirits; below, the Nine Lands’ and Nine Qi’s Elders. Now he reports to the Eight Assemblies: the Heavenly Source shines in clarity, the Jade Emperor reflects in witness, the Void Sovereign presides over the court, the Registers of Transcendents are overseen, and the Eastern Florescence records the name. The disciple, so-and-so, yearning for the divine immortals, pledges allegiance to the numinous and receives the thirty-six celestial writings. With sealed lips, he cultivates the practice, daring not to leak the divine and true. Offering sweet wine, he dedicates his heart: above, he summons the primordial qi of the lofty dawn; below, he oversees the signs of his fate. From this moment onward, should he violate the covenant’s statutes, his seven ancestors shall bear the blame, his person sink into the river’s source, and forever endure the knife mountains. He dares not deceive the immortals—the Three Offices and Nine Bureaus all acknowledge this sworn pact.\n\nWhen finished, the disciple presents the token of faith, holding the text in his left hand. Facing the northwest, he bows nine times; turning to the southeast, he bows nine times; then, facing his own life-star, he bows nine times. All rites completed.\n\n*Concluding the Lower Scroll of the Outer Realm’s Graded Writings and the Inner Writings of the Azure Lad of Upper Clarity.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清外国放品青童内文 经名：上清外国放品青童内文。 撰人不详，约出於东晋。 系早期上清派重要经典。 二卷。 底本出处：《正统道藏》正一部。 上清外国放品青童内文卷上 高上人国隐元内文 上清太真玉保王、上相大司马，命高晨师东海玉门青华小童君，受高上玉帝外国放品隐元内文。 其道高妙，乃生於九玄之先，结飞玄紫炁自然之章，灵文表异，焕明上清，经九万之劫，刻书绿那之国灵鸟之山，着东华之岫玄圃之上积石之阴，流光洞曜，映落太空，日月侠照，五晨翼灵，八素交带，四会结烟，飞霄翳气，蓊郁虚庭，金华之女、玉晨之童，各三百人，侍卫神文。 天妃扬香，灵风散真，飞龙走兽，备罗玉关，朱凤抚翮，神鸾荫玄，西华宴礼，万圣朝轩。 以中皇元年三月一日甲子，天德值合之时，上相青童君清斋空山，金青盟天，受於高上，备游六国，履涉名山，周历五岳，步诸河源，五帝扶翼，降致灵轩，十界众圣，宴礼广庭，洞穷寥幽，揽究无形，流精焕光以通道，太阳激电以吐威，七元运霄於紫虚，八景驭辔而升飞，咏玉音於外国，放神品以入微，命五老以整位，招万真以总归，九灵齐契，三景合晖，丹灵告瑞，高上监映，位登上相，名标紫晨，身冠九色霜罗之袍，佩流光曜灵洞元之章，灵宝百变之冠，流铃交落，丹云九缠，金华玉女、紫晨之童，各三千人，侍卫君焉 。 於是天玄启韵，范德应真，权任上化，主司九天，总统天下，普领万仙，生死图籍，无细不关。 君德高道备，逸朗玉清，七元焕落，五老侍灵，三光侠映，九帝齐軿，飞烟紫盖，玄云空生，玉姬扬音，神无罗铮，龙吟凤歌，广乐虚庭，飞霄绕日，流电激精，华光交洒，神烛合明，独乘灵符之节，手麾命魔灵幡，逍遥紫云之馆，徘徊青华之房，威六天於来运，剪万精於群凶，采后学於金简，校青箓於诸方，延万帝於曲字，讲宝诀於妙章，演九玄以历运，解曲逮於瞳蒙，撰独立以齐真，严四极以检违，命四司以执罚，符五帝以纠非，普统无穷，四垂六国、五岳名山，亿兆万真，莫不咸隶於青宫，受事於上相也 。 如是宝文，乃高上玄虚自然之章，结飞玄紫气以为隐文，放外国之品三十六音，置六国於五老之官，行於有道飞仙之人，玉音琼朗，妙义虚微，皆表上皇玄古之韵，四会八达结而成音，真趣难详，其理难寻，自非紫胞结络，玉藏通鲜，九孔纳灵之人，不能解其微韵，通於玉音。 高上重秘，故口口相传，九天以左辅执节仙都，右置侍仙玉郎、五方灵官，各五万人，典卫宝文，玉童玉女执巾侍香，玄灵紫盖，散烟遐庭，众真交会，焕朗上清。 如是上圣玉帝，皆以八节之日，上登琼房，行礼诵音，玉响朗彻，倾动九天。 书此之日，则五星出宿，七元停晖，五帝浮位，万仙临庭，千妖丧目，群魔灭精，威制六国，亿境肃清，神奇妙化，不可言论，流眄亿劫而不灭，大化改度而方鲜，灵秀巍巍，难可名焉。 若有此经，皆刻简於未生之前，名题帝籍，运挺应仙。 或天真下降，得授此文，或於世因缘，遭遇经师，梦响景应，与真合灵。 得受玉音，当烧香寂室，礼愿修行，咏之一遍，万真交会，五老朝形，天魔伏首，千妖丧精，威振六国，招仙致真。",
      "translated_text": "**Upper Clarity Scripture of the Released Grades of the Azure Lad from the Outer Realms**\n\n**Scripture Title:** *Upper Clarity Scripture of the Released Grades of the Azure Lad from the Outer Realms*. Author unknown, approximately dated to the Eastern Jin dynasty. A foundational scripture of the early Shangqing (Upper Clarity) tradition. Two scrolls.\n\n**Source:** *Zhengtong Daoist Canon*, Orthodox Section, Part One.\n\n---\n\n### *Upper Clarity Scripture of the Released Grades of the Azure Lad from the Outer Realms, Scroll One*\n\n#### *The Hidden Primordial Writ of the Lofty One from the Celestial Realm*\n\nThe Supreme Perfected Jade Guardian King of Upper Clarity and the Grand Minister of State commanded the Master of Lofty Dawn, the Azure Lad of the Jade Gate of the Eastern Sea, to receive the *Hidden Primordial Writ of the Released Grades from the Outer Realms of the Supreme Jade Emperor*.\n\nThis Dao is most wondrous, born before the Nine Mysteries, forming the natural chapters of soaring dark-purple *qi*. Its numinous writ manifests marvels, shining brilliantly in Upper Clarity. After ninety thousand kalpas, it was inscribed upon the Green Jasper Realm’s Spirit Bird Mountain, set upon the Eastern Florescence’s cavern and the Dark Garden’s piled stones to the north. Its flowing radiance illumines the Great Void; sun and moon flank its glow. The Five Dawns bear its spirit; the Eight Simplicities intertwine. The Four Convergences weave mist; flying auroras veil the *qi*. The maidens of golden splendor and the lads of jade dawn—three hundred each—attend and guard the sacred writ.\n\nThe Heavenly Consorts waft incense; the numinous winds scatter truth. Flying dragons and coursing beasts array before the Jade Pass. Vermilion phoenixes preen their wings; divine simurghs shade the dark. The Western Florescence hosts its rites; ten thousand sages bow in the celestial court.\n\nOn the first day of the third month of the inaugural year of the Central August Era, at the hour when Heavenly Virtue aligns, the Azure Lad, Minister of the Uppermost, purified himself in the empty mountains. He swore a golden-green pact with Heaven and received from the Supreme One the writ. He traversed the Six Realms, trod the famed mountains, circled the Five Peaks, and walked the sources of all rivers. The Five Thearchs lent their wings; his numinous chariot descended. The hosts of the Ten Realms and the assembled sages feasted in the vast court. He explored the remote and obscure, grasped the formless, and channeled flowing essence to illumine the Dao. The Great Yang unleashed lightning to manifest its power. The Seven Primes coursed through the purple void; the Eight Effulgences reined their steeds to ascend and fly. He chanted the jade tones of the Outer Realms, releasing the divine grades into subtlety. He commanded the Five Elders to order their ranks and summoned the ten thousand perfected to gather. The Nine Numinous harmonized; the Three Radiant merged their splendor. The Cinnabar Numinous announced auspices; the Supreme One oversaw and reflected. His rank ascended to Upper Minister; his name was inscribed in the Purple Dawn. His body was clad in a nine-hued frost-silk robe; he wore the flowing, luminous, cavernous, primordial writ of the Radiant Effulgence. His crown, the Hundred-Transformations Numinous Treasure, bore cascading bells. Ninefold cinnabar clouds entwined him. The golden-florescence jade maidens and the purple-dawn lads—three thousand each—attended the Lord.\n\nThus, the Celestial Mystery sounded its rhythm; the mold of virtue responded to the true. He was entrusted with the transformation of the upper realms, governing the Nine Heavens, overseeing all under Heaven, and universally leading the ten thousand immortals. The registers of life and death—nothing, however minute, escaped his purview.\n\nThe Lord’s virtue was lofty, his Dao complete. He roamed the Jade Clarity, serene and luminous. The Seven Primes shone and scattered; the Five Elders attended his spirit. The Three Luminants flanked his radiance; the Nine Thearchs aligned their chariots. Flying mists formed a purple canopy; dark clouds arose in the void. Jade maidens raised their voices; the divine net resounded. Dragons intoned; phoenixes sang. The vast court swelled with celestial music. Auroras encircled the sun; flowing lightning quickened essence. Radiant lights intermingled; divine candles merged their brilliance. Alone, he wielded the tally of the numinous writ, his hand brandishing the banner to command demonic spirits. He wandered the Purple Clouds’ palace, lingered in the Azure Florescence’s chambers. He overawed the Six Heavens with his advent; he severed the myriad spirits from their hordes of malevolence. He gathered the later disciples upon golden tablets, collated the azure registers from all directions. He summoned the ten thousand thearchs to the winding script, expounded the precious formulas in the wondrous chapters. He unfolded the Nine Mysteries through the kalpas, unraveled the arcane to enlighten the benighted. He composed the *Standing Alone* to equal the perfected; he enforced the Four Poles to restrain transgressions. He commanded the Four Offices to execute punishments, empowered the Five Thearchs to correct wrongs. Universally, he governed the boundless. The Four Quarters, the Six Realms, the Five Peaks, and the famed mountains—myriad billions of perfected beings—all submitted to the Azure Palace and served the Upper Minister.\n\nSuch a treasure writ is the Supreme One’s chapter of mysterious emptiness, naturally formed. It gathers the soaring dark-purple *qi* into hidden writ, releasing the thirty-six tones of the Outer Realms’ grades. It establishes the Six Realms within the offices of the Five Elders, to be practiced by those of the Dao who fly as immortals. The jade tones are crystalline and clear; the wondrous meanings are subtle and profound. All manifest the rhythms of the Supreme August and the Primordial Mystery. The Four Convergences and Eight Reaches intertwine to form its sounds. Its true purport is difficult to fathom; its principles are hard to trace. Unless one is of the purple womb’s woven network, the jade treasury’s unobstructed freshness, and the nine apertures’ receptivity to the numinous, one cannot grasp its subtle rhythms or penetrate its jade tones.\n\nThe Supreme One guarded this secret closely. Thus, it was transmitted mouth to mouth. The Nine Heavens appointed the Left Assistant to hold the tally in the Immortal Capital. To the right, they placed the Jade Gentlemen Attendants and the Five Directions’ Numinous Officials—fifty thousand each—to safeguard the treasure writ. Jade lads and maidens held towels and attended incense. Dark numinous purple canopies scattered mist through the distant court. The assembled perfected shone brilliantly in Upper Clarity.\n\nThus, the Supreme Jade Emperor and all the sagely beings, on the eight seasonal days, ascend the jasper chambers to perform rites and chant the tones. The jade echoes ring clear, shaking the Nine Heavens.\n\nOn the day this writ is inscribed, the Five Stars emerge from their lodgings; the Seven Primes halt their radiance. The Five Thearchs float in their positions; the ten thousand immortals attend the court. A thousand demons lose their sight; hordes of devils extinguish their essence. His might subdues the Six Realms; countless domains are pacified. The divine and wondrous transformations defy description. Its gaze flows through a hundred million kalpas without fading; the great transformation renews itself ever anew. Its numinous excellence is towering and majestic, beyond naming.\n\nWhoever possesses this scripture has had their name inscribed in the imperial registers before their birth, destined to emerge as an immortal. Some celestial perfected descend to bestow this writ; others, through worldly karmic conditions, encounter a scripture master. Dreams echo with numinous responses; their spirit merges with the true. Having received the jade tones, one should burn incense in a secluded chamber, perform rites, and cultivate practice. Chanting it once summons the ten thousand perfected to gather; the Five Elders attend in form. Heavenly demons bow their heads; a thousand demons lose their essence. His might shakes the Six Realms; he summons immortals and draws the perfected near.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1227,
      "start_sentence": 0,
      "end_sentence": 22,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.14325714111328,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "九年，三元诣房，降致云舆，飞行上清。 但有是经，於世不得修行，精心供养，则给玉童玉女各十二人，侍卫左右，营护有经者身，辟却万灾，禳伏甲兵，千患万害，不敢妄干，五帝防卫，克得下仙，或尸变轮转，升入灵房，但不得受於玉虚之任，游三清之中耳。 六国品铭三十六首 天地五方，皆有制御刚柔之色，使不得落。 其地深二十亿万里，得润泽； 润泽下二十亿万里，得金粟泽； 金栗泽下二十亿万里，得金刚铁泽； 金刚铁泽深入二十亿万里，得水泽； 水泽下八十亿万里，得大风泽； 大风泽下五百二十亿万里，纲维天地，制使不陷，如今日月星辰，为风所持也。 学者不知地下之境润色深浅，则五帝不过兆身於外国之境也。 东方弗于逮，九万里之外极，豪林之墟，其国音铭呵罗提之国，国地形正员，土色如碧脂之鲜，无有山阜，广狭九十万里。 其国人形长二丈，寿四百岁。 国有六音之铭，是高上始气置於外国胡老之品。 高上常吟歌其音，以化胡老之人，令知外国有不死之教。 如其国人皆行礼而诵其音，是得四百岁之寿，无有中夭之命。 上学之士，知外国地色； 常吟咏六品之音者，则致胡老仙官卫兆之身，九年，自然得游呵罗提之国，与胡老交言，变化飞空，游行东极之境也。 东方呵罗提国： 第一品铭 音曰擅阿夷提那维。 第二品铭 音曰越家摩须云持。 第三品铭 音曰昙真释遮缘陁。 第四品铭 音曰诰波君运乌紫。 第四品铭 音曰锡晋灵法婆颐。 第六品铭 音曰舍梨定曲泥台。 东方呵罗提之国，放六品之音，置胡老之号，知者寿与天地齐龄，修行其道，则致外国仙官来卫兆身。 当以太岁、本命、八节之日，青书六品铭，服一通，东向叩齿九通，吟咏六品六徧。 毕，瞑目安身定神。 弃诸异念。 思存东方无极无穷之境，呵罗提之国，洞达了然，存胡老仙官无数众，皆来朝己行礼，诵外国之音。 便微祝曰： 天地开境，八达朗清，洞观无穷，外国之名，放品化音，结气成灵，招仙致真，亿万齐并，逆究玄微，监映无形，上下响应，内外肃清，碧霞飞轮，来辅我形，运我上升，北谒玉京。 毕，咽气九过止。 此高上放外国之品神仙上法，行之九年，则致仙官，通灵察微，与神交言，飞空腾虚，白日升天。 南方阎浮利，三十万里之外极，洞阳之野，其国音则铭伊沙他之国，国地平博，无有高下，土色如丹，广狭八十一万里。 其国人皆形长二丈四尺，寿三百六十岁。 国有六音之铭，是高上置於外国越老之品。 高上常吟歌其音，以化越老之人，令知其国有不死之教。 如其国人皆行礼而诵其音，是得三百六十岁之寿，无有中夭之命。 学者知外国地色，常吟咏六品之音者，则致仙官卫兆之身，九年，自然得游伊沙他之国，与越老交言，变化朱宫，飞行南阳之境也。 南方伊沙他国： 第一品铭 ，音曰难维那薜汉罗。 第二品铭 ，音曰桓摩罗郁蓝波。 第三品铭 ，音曰乐酆勒育明沙。 第四品铭 ，音曰回素劫起飞陁。 第五品铭 ，音曰根植遂百无和。 第六品铭 ，音曰盈冲都玄镜车。 南方伊沙他之国，放六品之音，置越老之号，知者寿与天地同年，修行其道，则致外国飞仙之官来卫兆身。 当以太岁、本命、八节之日，朱书六品之铭，入室南向而服之，叩齿九通，吟咏六音六遍。",
      "translated_text": "After nine years, the Three Primes ascend to the celestial chambers, descending in cloud-borne chariots to soar through the Upper Clarity. Even if one possesses this scripture yet fails to cultivate its practice in the world, merely revering it with sincere devotion will summon twelve jade lads and twelve jade maidens to attend and guard one’s person, warding off the ten thousand calamities. They subdue weapons of war, and the thousand afflictions and myriad harms dare not rashly intrude. The Five Emperors stand guard, enabling one to attain the rank of lesser immortal. Alternatively, one may undergo bodily transformation and cyclic rebirth, ascending into the numinous chambers—though one may not yet assume office in the Jade Void or wander among the Three Clarities.\n\n**Thirty-Six Celestial Registers of the Six Realms**\n\nThe Five Directions of Heaven and Earth each possess governing hues of hardness and softness, preventing their dissolution. The earth extends twenty billion miles deep, where it receives moisture; beneath this moisture lies another twenty billion miles of golden millet marsh; below that, twenty billion miles of adamantine iron marsh; deeper still, twenty billion miles of watery marsh; descending eighty billion miles further, one reaches the great wind marsh; and five hundred twenty billion miles beyond that, the cosmic net sustains Heaven and Earth, ensuring they do not collapse—just as the sun, moon, and stars are upheld by the wind. Scholars who remain ignorant of the depths and hues beneath the earth will find the Five Emperors unable to extend their protection beyond the borders of foreign lands.\n\n**Eastern Realm: The Land of Fuyudai**\nBeyond ninety thousand miles to the easternmost extremity lies the Wasteland of Haolin, where the kingdom of Heluoti resides. Its land is perfectly round, its soil as fresh as azure rouge, devoid of mountains or hills, spanning nine hundred thousand miles in breadth. The people of this land stand two *zhang* tall and live four hundred years. The kingdom possesses six celestial registers, which the Supreme Highest established among the foreign Hu elders. The Supreme Highest often chants these registers to transform the Hu elders, revealing to them the teachings of immortality in foreign lands. If the people of this land observe rites and recite these registers, they attain a lifespan of four hundred years, free from premature death. Scholars who study the hues of foreign lands and constantly chant the six registers will summon the immortal officials of the Hu elders to guard their persons. After nine years, they naturally gain passage to the land of Heluoti, converse with the Hu elders, transform their bodies to fly through the air, and wander the easternmost realms.\n\n**The Six Registers of the Eastern Land of Heluoti:**\n1. First Register: *Chan Ayiti Nawei*\n2. Second Register: *Yue Jia Moxu Yunchi*\n3. Third Register: *Tan Zhen Shizhe Yuantuo*\n4. Fourth Register: *Gao Bojun Yun Wuzi*\n5. Fifth Register: *Xi Jin Lingfa Poyi*\n6. Sixth Register: *Sheliding Quni Tai*\n\nIn the land of Heluoti, the six registers are disseminated, and the titles of the Hu elders are established. Those who master them attain a lifespan equal to Heaven and Earth. By cultivating this Way, one summons the immortal officials of foreign lands to guard one’s person. On the days of the Great Year Star, one’s natal star, and the eight solar terms, one should inscribe the six registers in azure ink, recite them once while facing east, and knock the teeth nine times. Chant the six registers six times each, then close the eyes, compose the body, and settle the spirit. Abandon all stray thoughts and visualize the boundless eastern realm, the land of Heluoti, clearly and vividly. Envision countless Hu elder immortal officials arriving to pay homage, reciting the foreign registers. Then softly intone the prayer:\n\n*\"The bounds of Heaven and Earth unfold,\nEight directions shine in clarity,\nVast and boundless insight,\nThe names of foreign lands,\nCelestial registers transform through sound,\nQi coalesces into spirit,\nSummoning immortals and drawing the perfected near,\nMyriad hosts gather as one,\nTracing the subtle and profound,\nMirroring the formless,\nAbove and below resound in harmony,\nWithin and without grow solemn and pure,\nAzure mists and flying wheels\nCome to aid my form,\nBearing me aloft,\nTo the northern audience in the Jade Capital.\"*\n\nConclude by swallowing the qi nine times. This is the supreme method of the celestial registers of foreign lands, a practice of divine immortals. After nine years of cultivation, one summons immortal officials, gains spiritual insight into the subtle, communicates with the divine, and ascends into the void to rise to Heaven in broad daylight.\n\n**Southern Realm: The Land of Yanfuli**\nBeyond three hundred thousand miles to the southernmost extremity lies the Radiant Yang Wilderness, where the kingdom of Yishata resides. Its land is vast and level, without elevation or depression, its soil crimson, spanning eight hundred ten thousand miles in breadth. The people of this land stand two *zhang* and four *chi* tall and live three hundred sixty years. The kingdom possesses six celestial registers, which the Supreme Highest established among the foreign Yue elders. The Supreme Highest often chants these registers to transform the Yue elders, revealing to them the teachings of immortality in their land. If the people of this land observe rites and recite these registers, they attain a lifespan of three hundred sixty years, free from premature death. Scholars who study the hues of foreign lands and constantly chant the six registers will summon the immortal officials to guard their persons. After nine years, they naturally gain passage to the land of Yishata, converse with the Yue elders, transform their bodies within the vermilion palace, and soar through the southern yang realms.\n\n**The Six Registers of the Southern Land of Yishata:**\n1. First Register: *Nan Weina Xihan Luo*\n2. Second Register: *Huan Molan Yulan Bo*\n3. Third Register: *Le Feng Le Yuming Sha*\n4. Fourth Register: *Hui Su Jie Qi Feituo*\n5. Fifth Register: *Gen Zhi Sui Bai Wuhe*\n6. Sixth Register: *Ying Chong Du Xuan Jingche*\n\nIn the land of Yishata, the six registers are disseminated, and the titles of the Yue elders are established. Those who master them attain a lifespan equal to Heaven and Earth. By cultivating this Way, one summons the flying immortal officials of foreign lands to guard one’s person. On the days of the Great Year Star, one’s natal star, and the eight solar terms, inscribe the six registers in vermilion ink, enter a chamber, face south, and recite them. Knock the teeth nine times and chant the six registers six times each.",
      "overlap_context": "ugh worldly karmic conditions, encounter a scripture master. Dreams echo with numinous responses; their spirit merges with the true. Having received the jade tones, one should burn incense in a secluded chamber, perform rites, and cultivate practice. Chanting it once summons the ten thousand perfected to gather; the Five Elders attend in form. Heavenly demons bow their heads; a thousand demons lose their essence. His might shakes the Six Realms; he summons immortals and draws the perfected near.",
      "start_char": 1227,
      "end_char": 2524,
      "start_sentence": 23,
      "end_sentence": 71,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.165533781051636,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "毕，瞑目安神定气，弃诸异念，存思南方无极无穷之境，洞达朗然，存越老仙官无数众，来朝己身。 便微咒曰： 高灵垂映，散化朱宫，流音六品，结成丹容，群仙来朝，与真命双，洞观八朗，目睹华房，分景上清，出青入黄，五色流精，为我明光，得游六国，上造玉堂，受仙法服，飞青羽裳，流金交带，凤文紫章，与帝同真，耀形玉京。 毕，咽气九过止。 行之九年，则致南方越老仙官来卫侍形，察幽洞虚，与神共言，降致飞云玄龙来迎。 西方俱那邑，七十万里之外极，皓素之垄，其国音则铭尼维罗绿那之国，国地形多高垄，与天西关相接，土色白如玉，广狭六十八万里。 其国人形长一丈六尺，寿六百年。 国有六音之铭，是高上置於外国氐老之品。 高上常吟歌其音，以化氐老之人，令知其国有不死之教。 如其国人皆行礼诵咏其音，是得寿六百之年，无有中夭之命。 学者知外国地色，常吟咏修行，自有氐老仙官卫兆之身，九年，自然得游尼维罗绿那之国，与氐老仙官交言，能飞行玄虚，游戏皓素之垄也。 西方绿那之国： 第一品铭 ，音曰陁姨阿森呵根。 第二品铭 ，音曰金罗国迦摩骞。 第三品铭 ，音曰婆姨泥梵宝真。 第四品铭 ，音曰离奎提蓝婆臻。 第五品铭 ，音曰世芬那茂绿晨。 第六品铭 ，音曰提握沙入华田。 西方尼维罗绿那之国，放六品之音，以置氐老之号，知者寿与日月同光，修行其道，则致外国飞仙之官来卫兆身。 当以太岁、本命、八节之日，白书六品之铭、入室正西向服之，叩齿九通，吟咏六音六遍。 毕，瞑目安神定志，弃诸外想，思存西方无极无穷之境，洞达了然，存氐老仙官无数，来朝已身。 便微咒曰： 天音微灵，虚微命神，玉国六分，命一为真，混化外国，放品怡仙，高灵曲映，我得自然，乘空飞腾，落景龙轩，游眄无方，玄登五晨，与气齐晖，命司高骞，亿兆劫运，永保长存。 毕，咽气九过止。 行此九年，则致西方氐老仙官来卫兆身，逆睹未然，与真通灵，降致青軿，飞上玉清。 北方郁单，五十万里之外极，朔阴之庭，其国音则铭旬他罗之国，国地长流平演，土色黑润，广狭五十八万里。 其国人形长一丈二尺，寿三百岁。 国有六音之铭，是高上置於外国羌老之品。 高上常吟歌其音，以化羌老之人，令知其国有不死之教。 如其国人皆行礼而诵咏其音者，是得三百年寿，无有中夭之命。 学者知外国地色，常吟咏修行，则致羌老仙官卫兆之身，九年，自然得游旬他罗之国，与羌老交言，飞行玄虚，游宴朔阴之庭也。 北方旬他罗之国： 第一品铭 ，音曰幽罗郁头陁阿。 第二品铭 ，音曰幽真释维光那。 第三品铭 ，音曰品郁定爵世和。 第四品铭 ，音曰阴夜宝开录沙。 第五品铭 ，音曰法光景量国罗。 第六品铭 ，音曰波密维迦诃。 北方旬他罗之国，放六品之音，以置羌老之号，知者寿同七元之灵，修行其道，则致外国仙官来朝。 当以太岁、本命、八节之日，黑书六品之铭，入室北向服之，叩齿九通，吟咏六音六遍。 毕，瞑目安神定志，弃诸外想，思存北方无极无穷之境，洞达明朗，存羌老仙官无数众，来朝己身。 便微咒曰： 北郁结罗，七元吐精，放品斋气，六国置名，羌老弥纯，法化受灵，高仙命章，我禀无形，气气兼行，洞朗八冥，飞仙来朝，蓊蔼紫庭，云舆羽盖，绿霞丹軿，致我上升，以造玉清。",
      "translated_text": "When finished, close the eyes to settle the spirit and stabilize the qi, casting aside all stray thoughts. Visualize the boundless, infinite realm of the southern direction, its clarity and luminosity fully revealed. Envision the countless Yue elders and immortal officials arriving to attend one’s person. Then softly recite the incantation:\n\n*\"Lofty numina descend their radiance,\nScattering transformation through the Vermilion Palace.\nThe flowing tones of the six registers\nCongeal into a cinnabar countenance.\nHosts of immortals arrive in audience,\nPaired with the true mandate in duality.\nPenetrating vision of the Eight Luminaries,\nEyes behold the Flowering Chamber.\nDivided effulgences ascend to the Upper Clarity,\nEmerging from azure, entering into yellow.\nFive-hued streaming essences\nBecome my luminous light.\nI roam the Six Lands,\nAscend to the Jade Hall,\nReceive the immortal Dharma robes,\nFly in azure feathered garments,\nGirded with flowing gold and intertwining sashes,\nAdorned with phoenix-script purple insignia.\nAttaining unity with the Emperor in truth,\nMy form shines in the Jade Capital.\"*\n\nWhen finished, swallow the qi nine times and cease.\n\nPracticing this for nine years will summon the Yue elders and immortal officials of the southern lands to guard and attend one’s form. They will perceive the hidden and fathom the void, conversing with the spirits. Flying clouds and dark dragons will descend to welcome the adept.\n\n---\n\n**The Land of Junayi in the West**\nBeyond seventy myriad li to the farthest reaches of the west lies the White Mound, the land of Junayi. Its register is inscribed as the *Niviro Lǔnā* nation. The terrain is marked by towering mounds, bordering the Western Gate of Heaven. The earth’s hue is white as jade, spanning sixty-eight myriad li in breadth. Its people stand sixteen feet tall and live for six hundred years. The land possesses six register tones, which are the exalted teachings bestowed upon the Di elders of foreign lands. The exalted ones constantly chant and sing these tones to transform the Di elders, revealing to them the land’s teachings of deathlessness. If the people of this land all perform rites and recite these tones, they attain a lifespan of six hundred years, free from premature death. Scholars who know the earth’s hues of foreign lands and constantly chant, recite, and cultivate these practices will naturally summon the Di elders and immortal officials to guard their persons. After nine years, they will effortlessly journey to the land of *Niviro Lǔnā*, converse with the Di elders, and soar through the void, frolicking in the White Mound.\n\n**The Six Registers of the Western Land of Niviro Lǔnā:**\n1. First Register: *Tayī Āsēnhēgēn*\n2. Second Register: *Jīnluó Guójiā Móqiān*\n3. Third Register: *Póyī Nífàn Bǎozhēn*\n4. Fourth Register: *Líkuí Tílán Pózhēn*\n5. Fifth Register: *Shìfēn Nàmào Lǜchén*\n6. Sixth Register: *Tíwò Shārù Huátián*\n\nIn the land of *Niviro Lǔnā* in the west, the six registers are disseminated, and the titles of the Di elders are established. Those who master them attain a lifespan whose radiance equals that of the sun and moon. By cultivating this Way, one summons the flying immortal officials of foreign lands to guard one’s person. On the days of the Great Year Star, one’s natal star, and the eight solar terms, inscribe the six registers in white ink, enter a chamber, face due west, and recite them. Knock the teeth nine times and chant the six registers six times each.\n\nWhen finished, close the eyes to settle the spirit and stabilize the will, casting aside all external distractions. Visualize the boundless, infinite realm of the western direction, its clarity fully revealed. Envision the countless Di elders and immortal officials arriving to attend one’s person. Then softly recite the incantation:\n\n*\"Heavenly tones, subtle numina,\nVoid and subtle, they command the spirits.\nThe Six Divisions of the Jade Land\nAppoint the One as true.\nTransforming the foreign lands in harmony,\nDisseminating the registers to delight the immortals.\nLofty numina curve their radiance—\nI attain spontaneity.\nRiding the void, soaring aloft,\nAlighting upon the Dragon Terrace.\nRoaming and gazing without bound,\nDarkly ascending the Five Mornings.\nMy brilliance equals the qi,\nMy mandate governs the exalted.\nThrough countless kalpas of fate,\nI eternally preserve long existence.\"*\n\nWhen finished, swallow the qi nine times and cease.\n\nPracticing this for nine years will summon the Di elders and immortal officials of the western lands to guard one’s person. They will perceive the unseen future and commune with the true and numinous, descending with azure chariots to ascend to the Jade Clarity.\n\n---\n\n**The Land of Xuntaluo in the North**\nBeyond fifty myriad li to the farthest reaches of the north lies the Dark Yin Court, the land of Xuntaluo. Its register is inscribed as the *Xuntaluo* nation. The land stretches long and flows level, its earth black and lustrous, spanning fifty-eight myriad li in breadth. Its people stand twelve feet tall and live for three hundred years. The land possesses six register tones, which are the exalted teachings bestowed upon the Qiang elders of foreign lands. The exalted ones constantly chant and sing these tones to transform the Qiang elders, revealing to them the land’s teachings of deathlessness. If the people of this land all perform rites and recite these tones, they attain a lifespan of three hundred years, free from premature death. Scholars who know the earth’s hues of foreign lands and constantly chant, recite, and cultivate these practices will summon the Qiang elders and immortal officials to guard their persons. After nine years, they will effortlessly journey to the land of *Xuntaluo*, converse with the Qiang elders, soar through the void, and feast in the Dark Yin Court.\n\n**The Six Registers of the Northern Land of Xuntaluo:**\n1. First Register: *Yōuluó Yùtóu Tā’ā*\n2. Second Register: *Yōuzhēn Shìwéi Guāngnà*\n3. Third Register: *Pǐnyù Dìngjué Shìhé*\n4. Fourth Register: *Yīnyè Bǎokāi Lùshā*\n5. Fifth Register: *Fǎguāng Jǐngliàng Guóluó*\n6. Sixth Register: *Bōmì Wéijiāhē*\n\nIn the land of *Xuntaluo* in the north, the six registers are disseminated, and the titles of the Qiang elders are established. Those who master them attain a lifespan equal to the numinous Seven Origins. By cultivating this Way, one summons the immortal officials of foreign lands to attend. On the days of the Great Year Star, one’s natal star, and the eight solar terms, inscribe the six registers in black ink, enter a chamber, face north, and recite them. Knock the teeth nine times and chant the six registers six times each.\n\nWhen finished, close the eyes to settle the spirit and stabilize the will, casting aside all external distractions. Visualize the boundless, infinite realm of the northern direction, its clarity fully revealed. Envision the countless Qiang elders and immortal officials arriving to attend one’s person. Then softly recite the incantation:\n\n*\"Northern darkness congeals in Luo,\nThe Seven Origins exhale their essence.\nDisseminating the registers, fasting in qi,\nThe Six Lands establish their names.\nThe Qiang elders, ever pure,\nReceive the Dharma’s transformation and numinous power.\nExalted immortals command the mandate—\nI am endowed with formlessness.\nQi flows in tandem,\nPenetrating the Eight Darknesses.\nFlying immortals arrive in audience,\nLush and misty in the Purple Court.\nCloud chariots and feathered canopies,\nVerdant mists and cinnabar chariots,\nConvey me upward\nTo ascend to the Jade Clarity.\"*",
      "overlap_context": "e six registers are disseminated, and the titles of the Yue elders are established. Those who master them attain a lifespan equal to Heaven and Earth. By cultivating this Way, one summons the flying immortal officials of foreign lands to guard one’s person. On the days of the Great Year Star, one’s natal star, and the eight solar terms, inscribe the six registers in vermilion ink, enter a chamber, face south, and recite them. Knock the teeth nine times and chant the six registers six times each.",
      "start_char": 2524,
      "end_char": 3852,
      "start_sentence": 72,
      "end_sentence": 114,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.28230929374695,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "毕，咽气九过止。 行此九年，则致北方羌老仙官来卫兆身，逆究幽穷、尽睹未然之事，与真通灵，飞行玄虚，上升紫晨。 上方九天之上，清阳虚空之内，无色无象，无形无影，空洞之铭元精青沌自然之国，以青炁为世芬，上极无穷，四覆诸天，则高上玉皇、万圣帝真受生之根，无寿无量，惟劫为年。 其空洞之内，亦有六音之铭，则元始置於真皇自然之品。 高上吟歌其音，以延群仙，令知玄空有无量之真。 如其国玉皇万帝，皆礼音吟咏，是得无量之寿。 学者知空洞之色，吟咏修行，则致三元下降，五帝诣房，授兆灵音，九年，则得乘虚驾浮，上造玉清太空之中也。 上方元精青沌自然之国： 第一品铭 ，音曰琼瑶芬录定音。 第二品铭 ，音曰凤云兰丹宝林。 第三品铭 ，音曰杳量光洞紫森。 第四品铭 ，音曰缘那境入空琼。 第五品铭 ，音曰呵阿房薜胡軿。 第六品铭 ，音曰七曜气飞元青。 上方元精青沌自然之国，放六品之音，以标上清玉帝之真，知者飞行玉虚，万仙来朝。 当以本命、太岁、八节之日，青书六品之铭，入室向太岁服之，叩齿九通，吟咏六音六遍。 毕，瞑目安神定志，弃诸想念，思存无上之上清阳太空之内，无色无象无形无影空洞之中，洞达朗彻，青气郁郁，下冠兆身。 便微咒曰： 元始自然，青阳郁冥，玄化空洞，无量无形，结气凝国，芬世为名，总覆诸天，普植万灵，云房金罗，嵯峨上清，六品放位，标题元精，玉音彻微，玄响朗琼，吟咏发出，帝真临庭，曲映垂条，我享上灵，与天齐位，三景合明，永保太空，随劫无倾。 毕，咽气九过止。 行此九年，则三元下降，授兆真音，飞霞丹軿，给兆之身，飞行大洞，上升玉清。 高上秘法，自无金名紫简，绿字上清，不得行此道。 有者妄泄示人，殃及七祖，获考三官，己身亡命，无复仙冀，依科明慎奉焉。 中国直下极大风泽，去地五百二十亿万里，刚维地源，制使不落，土色如金之精，中国音则铭太和宝真无量之国，中岳昆仑即据其中央，诸天之别名，上有玄圃七宝珠宫，与天交端，上真飞仙之馆。 中国周回百二十亿万里，其国人形长九尺，皆学导引之术，寿一千二百岁。 国有六音之铭，是高上置於中国之品。 高上玉皇帝君，悉吟咏其音，以化中国伧老之人，令知其国有不死之教。 如其国人皆修上清之道，行礼诵咏，是得寿一千二百岁，无有横夭之年。 学者知中国地色，吟咏修行，则伧老仙官卫兆之身，九年，自然与伧老交言，身登太空，飞行上清。 太和宝真无量之国： 第一品铭 ，音曰定世阴结荣和。 第二品铭 ，音曰中宝珠若来华。 第三品铭 ，音曰广原缘理云阿。 第四品铭 ，音曰条琼芬晋世罗。 第五品铭 ，音曰洞灵音解世陁。 第六品铭 ，音曰金根宝朱阳婆。 太和宝真无量之国，放六品之音，以置伧老之号，知者寿同天地，修行其道，致伧老仙官来朝己身。 当以太岁、本命、八节之日，黄书六品之铭，入室向本命服之，叩齿九通，吟咏六国之音六遍。 毕，瞑目安神定志，弃诸想念，存思中国极下大风泽，入地五百二十亿万里之渊，朗达分明，伧老仙官无数众，来朝己身。 便祝曰： 中原总真，万帝玄灵，九天垂典，结气凝精，太黄浩浩，亿丈之庭，中国放品，分音六名，玉向朗空，彻微入青，流真敷布，陶育我形，变化太和，宝真利贞，下洞无渊，上升玉清。",
      "translated_text": "Upon completion, swallow the qi nine times and cease. Practicing this for nine years will summon the Qiang elders and immortal officials of the northern direction to guard one’s person, allowing one to trace the obscure and fathom the yet-unseen, commune with the perfected and attain numinous power, soar through the mysterious void, and ascend to the Purple Dawn. Above the Nine Heavens of the upper direction, within the clear yang and empty space, where there is no color, no form, no shape, no shadow—there lies the realm of the primordial essence and the naturally arising Azure Chaos, where azure qi serves as the fragrance of the world. Boundless above, it covers the four directions of all heavens, forming the root from which the Most High Jade Emperor and the myriad sage emperors and perfected beings receive life. Without age, without limit, only kalpas serve as years. Within this empty void, there are also the Six Resonances, established by the Primordial Beginning as the natural ranks of the Perfected Emperor. The Most High intones and chants these sounds to extend the lives of the host of immortals, allowing them to know that the mysterious void holds boundless perfected beings. As the Jade Emperor and the ten thousand emperors of that realm all pay homage and chant these sounds, they attain limitless longevity. Those who study and know the color of the empty void, practicing through intoning and recitation, will summon the descent of the Three Origins, with the Five Emperors visiting their chamber to bestow upon them the numinous sounds. After nine years, they will be able to ride the void and mount the floating clouds, ascending to the Great Void of Jade Clarity.\n\nThe realm of the naturally arising Azure Chaos of the primordial essence in the upper direction:\nFirst Rank Resonance, sounding: *Qiongyao Fenlu Dingyin*.\nSecond Rank Resonance, sounding: *Fengyun Landan Baolin*.\nThird Rank Resonance, sounding: *Yaoliang Guangdong Zisen*.\nFourth Rank Resonance, sounding: *Yuannai Jingru Kongqiong*.\nFifth Rank Resonance, sounding: *He’a Fangbihu Ping*.\nSixth Rank Resonance, sounding: *Qiyao Qi Fei Yuanqing*.\n\nThe realm of the naturally arising Azure Chaos of the primordial essence emits the Six Ranks of Resonance to mark the truth of the Jade Emperor of Supreme Clarity. Those who know these sounds will soar through the Jade Void, and the myriad immortals will come to pay homage. On the days of one’s original destiny, the year-star, and the eight solar terms, inscribe the Six Ranks of Resonance in azure script, enter the chamber, face the year-star, and ingest them. Knock the teeth nine times and intone the Six Resonances six times each. Upon completion, close the eyes, calm the spirit, settle the will, and cast aside all thoughts. Visualize the boundless Supreme Clarity of the uppermost clear yang and empty space, where there is no color, no form, no shape, no shadow—only the luminous clarity of the empty void, suffused with dense azure qi descending to crown one’s person. Then softly recite the incantation:\n\n*\"Primordial Beginning, naturally arising,\nAzure yang dense and dark,\nMysterious transformation of the empty void,\nBoundless and formless,\nCongealing qi to form the realm,\nFragrant world as its name,\nEncompassing all heavens,\nUniversally nurturing the ten thousand spirits.\nCloud chambers and golden nets,\nTowering in Supreme Clarity,\nThe Six Ranks emit their positions,\nInscribing the primordial essence.\nJade sounds penetrate the subtle,\nMysterious echoes resound in clarity.\nIntoning and chanting issue forth,\nThe Perfected Emperors descend to the court.\nCurved reflections hang like trailing branches—\nI partake of the supreme numen,\nEqual in rank to Heaven,\nThe Three Luminaries unite in brightness,\nForever preserving the Great Void,\nUnshaken through the kalpas.\"*\n\nUpon completion, swallow the qi nine times and cease. Practicing this for nine years will cause the Three Origins to descend and bestow the true sounds upon one, granting a flying auroral cinnabar chariot to one’s person, allowing flight through the Great Void and ascent to Jade Clarity. This is a most exalted and secret method, recorded in the nameless golden texts and the azure characters of Supreme Clarity. It must not be practiced without authorization. Those who recklessly transmit it to others will bring calamity upon their seven generations, incur punishment from the Three Officials, forfeit their own lives, and lose all hope of immortality. Adhere strictly to the regulations and guard this knowledge with care.\n\nBeneath the central lands lies the vast Windy Marsh, extending five hundred twenty billion miles from the earth. The firm axis of the earth’s roots governs it, preventing its fall. The soil there is the color of golden essence. The resonance of the central lands is called the realm of the Treasured Perfection of Great Harmony and Boundless Life. Mount Kunlun of the central peaks stands at its center, bearing the alternate names of all heavens. Above it lies the Seven Jeweled Pearl Palace of the Dark Garden, where the ends of heaven meet, serving as the abode of the perfected and flying immortals. The central lands span one hundred twenty billion miles in circumference. The people there are nine feet tall, all practicing the arts of guiding and pulling, and live for one thousand two hundred years. The land possesses the Six Resonances, established by the Most High as the ranks of the central lands. The Jade Emperor and the Most High intone and chant these sounds to transform the Qiang elders of the central lands, allowing them to know that their realm holds the teachings of deathlessness. If the people of that land all cultivate the Dao of Supreme Clarity, practicing rites and recitations, they will live for one thousand two hundred years, free from untimely death. Those who study and know the earth’s color of the central lands, practicing through intoning and recitation, will have the Qiang elder immortal officials guard their persons. After nine years, they will naturally converse with the Qiang elders, ascend to the Great Void, and soar to Supreme Clarity.\n\nThe realm of the Treasured Perfection of Great Harmony and Boundless Life:\nFirst Rank Resonance, sounding: *Dingshi Yinjie Ronghe*.\nSecond Rank Resonance, sounding: *Zhongbao Zhu Ruolaihua*.\nThird Rank Resonance, sounding: *Guangyuan Yuanli Yun’a*.\nFourth Rank Resonance, sounding: *Tiaoqiong Fen Jin Shiluo*.\nFifth Rank Resonance, sounding: *Dongling Yin Jieshi Tuo*.\nSixth Rank Resonance, sounding: *Jingen Bao Zhuyang Po*.\n\nThe realm of the Treasured Perfection of Great Harmony and Boundless Life emits the Six Ranks of Resonance to establish the titles of the Qiang elders. Those who know these sounds will live as long as heaven and earth. Practicing this Dao will summon the Qiang elder immortal officials to pay homage to one’s person. On the days of the year-star, one’s original destiny, and the eight solar terms, inscribe the Six Ranks of Resonance in yellow script, enter the chamber, face one’s original destiny, and ingest them. Knock the teeth nine times and intone the sounds of the six lands six times each. Upon completion, close the eyes, calm the spirit, settle the will, and cast aside all thoughts. Visualize the vast Windy Marsh beneath the central lands, plunging five hundred twenty billion miles into the abyss, its clarity fully revealed. Envision the countless Qiang elder immortal officials arriving to attend one’s person. Then recite the prayer:\n\n*\"Central perfection, myriad emperors and mysterious numina,\nThe Nine Heavens bestow their canon,\nCongealing qi and condensing essence,\nVast and yellow, the court of boundless fathoms.\nThe central lands emit their ranks,\nDividing the sounds into six names.\nJade faces the luminous void,\nPenetrating the subtle and entering the azure.\nFlowing perfection spreads forth,\nCultivating my form,\nTransforming into Great Harmony,\nTreasured perfection, advantageous and upright.\nBelow, it pierces the abyssal depths;\nAbove, it ascends to Jade Clarity.\"*",
      "overlap_context": "r essence.\nDisseminating the registers, fasting in qi,\nThe Six Lands establish their names.\nThe Qiang elders, ever pure,\nReceive the Dharma’s transformation and numinous power.\nExalted immortals command the mandate—\nI am endowed with formlessness.\nQi flows in tandem,\nPenetrating the Eight Darknesses.\nFlying immortals arrive in audience,\nLush and misty in the Purple Court.\nCloud chariots and feathered canopies,\nVerdant mists and cinnabar chariots,\nConvey me upward\nTo ascend to the Jade Clarity.\"*",
      "start_char": 3852,
      "end_char": 5180,
      "start_sentence": 115,
      "end_sentence": 155,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.10602140426636,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "毕，咽气九过止。 行此九年，真人下降，授兆真音，得与伧老仙官交言，乘空飞虚，上升帝晨。 高上置六国品铭，化为三十六音，元始之初，金鉼刻书其文，各置一国，今悉封於国境，或封名山五岳之洞。 如中国之音，即对玄圃积石之阴。 如此神文，皆各以紫晨玉童、太华玉女各、三百人，侍卫典香。 旧科万劫当行下世，授於上真之人，自无金名帝简，绿字玉清，不得此文。 得受六国放品之音，便得游行无穷，洞达六国之中，上天入渊，变化万方，履五岳，游名山，则胡越氐羌伧老仙官，营卫送迎，群魔伏首，兵凶灭亡，周流六国，适意所从。 诵之万遍，三元诣房，降致绿軿，飞升玉晨。 此高上自然之文，上相撰飞玄紫气之字，以雌黄书碧琼，佩身游五岳，入三清，制群魔，御万灵，威六国，伏五兵。 行之九年，真人诣庭，能飞乘虚，上造太清。 青童君曰：上帝玉真及五、岳上仙、皆服文而咏音，佩身而修真。 学无此文，则不得游名山，制六国，却甲兵，五老之官不卫身形。 为学之本，当勤行五岳，寻受此文，灵威告应，自得道真高上妙法，虽不学而仙也。 青童君受高上入六国内文，后学欲游名山，之五岳，入六国，致群仙，制万魔，伏五兵，当受五帝交音内文，佩之六年，得与六国仙官交言，自明三十六国之音也。 黄帝受隐元三行，霸天下，通神明，役鬼神，制万灵。 夏禹受交音三行，使天下鬼神禀吉凶，知宿命，得补灵仙。 曾玄受青洞文三行，匡五龙，游云宫。 安阳受九灵音三行，登帝堂，位加仙王。 赤精受宝真文，位登四极，出入三清。 王乔受苞元隐箓三行，身登上真，总领众仙，出入华房。 高上於玄圃西垄金华之宫，以化灵总众内文，以授上相青童君。 东蒙隐文真书三行，雌黄书碧缯上，佩身，则得游行东方呵罗提之国，制群灵，斩天魔，伏五兵，游名山，胡老扶迎，自知六国之音，与神交言。 南方交音内文三行，雌黄书碧缯上，佩身，则得游伊沙他之国，制群灵，斩天魔，伏五兵，游名山，越老之官扶将送迎，自知六国之音，与神共言。 西混青洞隐元内文三行，雌黄书碧缯上，佩身，则游入尼维罗绿那之国，制群灵，斩天魔，伏五兵，出玄路，入三清，游名山，氐老扶迎，自知六国之音，与神人共言。 北九灵金光音三行，雌黄书碧缯上，佩身，则得入旬他罗之国，制群灵，斩天魔，伏五兵，登广寒，谒北精，游名山，羌老扶迎，自知六国之音，与神人交言。 上清阳苞元隐录内文三行，雌黄书碧缯上，佩身，则得上游元精青沌自然之国，制群灵，斩天魔，伏五兵，步空天，升玉清，游名山，万真扶迎，自然知六国之音，与神共言。 中化灵总真众内文三行，雌黄书碧缯上，佩身，则得游涉太和宝真无量之国，制群灵，斩天魔，伏五兵，入洞渊，升玄冥，戏北元，谒紫庭，游名山，则五老扶迎，自然知六国之音，与神共言。 高上入六国内隐真文，授於上相青童君，雌黄书碧缯佩身，项生宝光，映照十天，役使玉童玉女各三十六人，游行五岳，涉诸名山，入六国，履河源，所在群仙五方之官，皆来稽首，缘界司迎，制万魔，御千灵，威六国，伏五兵，变化无方，随意所从，降致飞轮丹霄紫軿，来迎我身，上升东华青宫，位登上相，总领万真。",
      "translated_text": "When finished, swallow the qi nine times and cease. Practicing this for nine years, the Perfected One descends to bestow upon the practitioner the true sounds, enabling converse with the Qiang elder immortal officials, riding the void to ascend to the Court of the Celestial Dawn. The Highest establishes the Six States’ ranked inscriptions, transforming them into thirty-six sounds. At the inception of the Primordial Beginning, the texts were inscribed in gold on tablets, each placed within a state, now all sealed within their borders or upon the sacred peaks of the Five Marchmounts. The sounds of the Central Lands, for instance, correspond to the northern face of the Jasper Orchard’s Piled Stones. These divine texts are each attended by three hundred Purple Aurora Jade Lads and Great Flower Jade Maidens, who serve and tend the incense.\n\nBy ancient decree, after ten thousand kalpas, they are transmitted to those of the highest Perfection. Without one’s name inscribed on the Emperor’s golden tablets or the Jade Clarity’s green script, one cannot receive these texts. Upon obtaining the Six States’ ranked sounds, one may wander boundlessly, traversing the Six States, ascending to Heaven or entering the abyss, transforming in myriad ways, treading the Five Marchmounts, and roaming the sacred peaks. Then the Hu, Yue, Di, Qiang, and Qiang elder immortal officials will escort and receive, all demons bow in submission, weapons and misfortune vanish, and one may roam the Six States at will. Reciting these ten thousand times, the Three Primes visit one’s chamber, descending with green chariots to ascend to the Jade Dawn.\n\nThese are the Highest’s spontaneous texts, the Prime Minister’s soaring mysterious purple qi script, written in realgar upon azure jade, worn upon the body to wander the Five Marchmounts, enter the Three Clarities, subdue the demonic hordes, command the myriad spirits, overawe the Six States, and subjugate the five weapons. Practicing this for nine years, the Perfected One visits one’s court, enabling flight through the void to ascend to the Great Clarity.\n\nThe Lad of the Azure Lads says: The Jade Perfected of the Celestial Emperor and the immortals of the Five Marchmounts all wear these texts and chant their sounds, bearing them upon their persons to cultivate Perfection. Without these texts, one cannot wander the sacred peaks, govern the Six States, repel weapons, or have the Five Elder Officials guard one’s form. The foundation of study lies in diligently traversing the Five Marchmounts to seek these texts, whereupon numinous might responds, and one naturally attains the Highest’s wondrous Daoist methods—even without study, one becomes immortal.\n\nThe Lad of the Azure Lads received the Highest’s texts for entering the Six States. Those who later study and wish to wander the sacred peaks, the Five Marchmounts, and the Six States, summoning the host of immortals, subduing the myriad demons, and subjugating the five weapons, must receive the Five Emperors’ texts of intersecting sounds. Wearing them for six years, one may converse with the Six States’ immortal officials and naturally comprehend the thirty-six states’ sounds.\n\nThe Yellow Emperor received the Hidden Primordial Three Lines, dominating the world, communing with the divine and luminous, commanding ghosts and spirits, and governing the myriad numina. Yu of Xia received the Three Lines of Intersecting Sounds, enabling the world’s ghosts and spirits to heed fortune and misfortune, know their past lives, and attain the ranks of numinous immortals. Zeng Xuan received the Three Lines of the Azure Grotto Text, aiding the Five Dragons and wandering the Cloud Palaces. An Yang received the Three Lines of the Nine Numinous Sounds, ascending the Emperor’s Hall and attaining the rank of Immortal King. Chi Jing received the Text of Treasured Perfection, ascending to the Four Poles and entering the Three Clarities. Wang Qiao received the Three Lines of the Primordial Womb’s Hidden Register, ascending to the ranks of the Highest Perfected and governing the host of immortals, entering and exiting the Flower Chambers.\n\nThe Highest, at the Golden Flower Palace of the Western Mound in the Jasper Orchard, transmitted the texts of the Numinous Assembly to the Prime Minister, the Lad of the Azure Lads.\n\nThe Three Lines of the Eastern Meng’s Hidden Texts, written in realgar upon azure silk and worn upon the body, enable one to wander the eastern state of A-luo-ti, govern the myriad spirits, slay celestial demons, subjugate the five weapons, roam the sacred peaks, have the Hu elders escort and receive, naturally comprehend the Six States’ sounds, and converse with the divine.\n\nThe Three Lines of the Southern Intersecting Sounds, written in realgar upon azure silk and worn upon the body, enable one to wander the state of Yi-sha-ta, govern the myriad spirits, slay celestial demons, subjugate the five weapons, roam the sacred peaks, have the Yue elders escort and receive, naturally comprehend the Six States’ sounds, and converse with the divine.\n\nThe Three Lines of the Western Primordial Hidden Texts of the Azure Grotto, written in realgar upon azure silk and worn upon the body, enable one to wander the state of Ni-wei-luo-lü-na, govern the myriad spirits, slay celestial demons, subjugate the five weapons, exit the mysterious paths, enter the Three Clarities, roam the sacred peaks, have the Di elders escort and receive, naturally comprehend the Six States’ sounds, and converse with the divine.\n\nThe Three Lines of the Northern Nine Numinous Golden Radiance Sounds, written in realgar upon azure silk and worn upon the body, enable one to enter the state of Xun-ta-la, govern the myriad spirits, slay celestial demons, subjugate the five weapons, ascend the Vast Cold, visit the Northern Essence, roam the sacred peaks, have the Qiang elders escort and receive, naturally comprehend the Six States’ sounds, and converse with the divine.\n\nThe Three Lines of the Upper Clarity’s Yang Primordial Womb’s Hidden Register, written in realgar upon azure silk and worn upon the body, enable one to ascend and wander the state of Primordial Essence’s Azure Chaos, govern the myriad spirits, slay celestial demons, subjugate the five weapons, tread the void heavens, ascend to the Jade Clarity, roam the sacred peaks, have the myriad Perfected escort and receive, naturally comprehend the Six States’ sounds, and converse with the divine.\n\nThe Three Lines of the Central Numinous Assembly’s Perfected Multitude, written in realgar upon azure silk and worn upon the body, enable one to wander the state of Great Harmony’s Treasured Perfection and Boundlessness, govern the myriad spirits, slay celestial demons, subjugate the five weapons, enter the grotto abyss, ascend the Mysterious Darkness, sport in the Northern Primordial, visit the Purple Court, roam the sacred peaks, have the Five Elders escort and receive, naturally comprehend the Six States’ sounds, and converse with the divine.\n\nThe Highest’s Hidden Perfected Texts for Entering the Six States, transmitted to the Prime Minister, the Lad of the Azure Lads, written in realgar upon azure silk and worn upon the body, cause a precious radiance to arise from the nape, illuminating the Ten Heavens. They command thirty-six Jade Lads and thirty-six Jade Maidens, enabling one to wander the Five Marchmounts, traverse the sacred peaks, enter the Six States, tread the river sources, whereupon the host of immortals and the Five Directions’ officials all come to bow, the border sentinels welcome, the myriad demons are subdued, the thousand spirits are commanded, the Six States are overawed, the five weapons are subjugated, transformations are boundless, and one may follow one’s will. Descending green chariots of the cinnabar clouds come to receive one’s person, ascending to the Eastern Flower’s Azure Palace, attaining the rank of Prime Minister and governing the myriad Perfected.",
      "overlap_context": "sterious numina,\nThe Nine Heavens bestow their canon,\nCongealing qi and condensing essence,\nVast and yellow, the court of boundless fathoms.\nThe central lands emit their ranks,\nDividing the sounds into six names.\nJade faces the luminous void,\nPenetrating the subtle and entering the azure.\nFlowing perfection spreads forth,\nCultivating my form,\nTransforming into Great Harmony,\nTreasured perfection, advantageous and upright.\nBelow, it pierces the abyssal depths;\nAbove, it ascends to Jade Clarity.\"*",
      "start_char": 5180,
      "end_char": 6445,
      "start_sentence": 156,
      "end_sentence": 183,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.6832377910614,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "其道高妙，帝君宝文，高上今以其文刻书人鸟，着之於蓬莱之岫，玄圃之上积石之阴。 高玄羽章，华光交焕，映曜太空，紫烟重阴，文采洞鲜。 旧科万劫当传已成真人，有得 其文，位加仙卿，能周流六国，与五老交言，洞达玄虚，驱策万灵，自无玉骨，刻名紫简於未生之前，不得此文，得者不学亦为中仙。 轻泄宝音，七祖充责，运山负石，万劫不原，己身婴见世风刀之考，死入地狱，不得又仙。 佩此文游行六国，履涉五岳，历诸名山，至其界首，当先叩齿三十六通，闭气三十六息，咒曰： 玉真徘徊，云驾昂昂，是日上吉，龙飞凤翔，列行羽仪，四道开张，六师启导，十界来迎，仙童执幡，玉女散香，五老稽首，翼翼洋洋，日月交带，灵仙扶将，履历六国，周流四乡，四渎五岳，为我桥梁，帝君使令，扫除不祥，诸所之造，靡不吉良，神奇异方，仙练内昌，外国洞朗，上造玉京。 毕，引气三十六咽止。 此上相出游威神大咒，行之制六国，伏万灵，致仙官来朝形，变化无方，上升太清。 受者对斋七日，或三十日，於斋中赍青纹之缯三十二尺，金鱼、玉龙各一枚，金镮九双，上金五两，以代割发裂帛之誓。 师北向告盟而传，弟子奉受，依四极之科，敛慎禁戒，密而奉行。 上清太真玉保王上相大司马，命高晨师东海玉门青华小童君，受於高上玉帝，以传四极真人，部以五帝神兵，罚於漏泄，愆盟负誓，七祖充责，己身亡命，三徒五苦，万劫不原也。 上清外国放品青童内文卷上竟 上清外国放品青童内文卷下",
      "translated_text": "The Dao is most exalted and wondrous, the August Lord’s precious writ. The Most High has now inscribed this writ in the script of men and birds, placing it within the cavern of Penglai, upon the northern slopes of the Accumulated Stones above the Dark Garden. The dark mystery of the feathered script and the radiant splendor of its luminous patterns intermingle, illuminating the vast heavens; purple mists layer in shadow, and the brilliance of its patterns shines with penetrating clarity. By ancient decree, after ten thousand kalpas one who is destined to transmit it shall have already become a Perfected. Whoever obtains this writ shall have their rank elevated to that of Immortal Minister, able to traverse the Six States, converse with the Five Elders, and penetrate the mysteries of the Dark Void. They shall command the myriad spirits, and even without jade bones, their name shall be engraved upon the purple tablets before their birth. Those who receive this writ, though they study not, shall still become Median Immortals. Should one lightly divulge this precious incantation, their seven ancestors shall bear the burden, hauling mountains and bearing stones for ten thousand kalpas without pardon. Their own person shall be bound and subjected to the trials of the world’s winds and blades, dying to enter hell, never again to attain immortality.\n\nWhen wearing this writ to wander the Six States, tread the Five Marchmounts, and traverse the myriad sacred peaks, upon reaching the border of any realm, one must first strike the teeth thirty-six times, hold the breath for thirty-six cycles, and recite the incantation:\n\n*\"Jade Perfected, lingering in circuit,\nCloud chariots soar aloft.\nThis day is most auspicious,\nDragons ascend, phoenixes take flight.\nArrayed in feathered regalia,\nThe four paths open wide,\nThe six hosts set forth to guide,\nThe ten realms come to welcome.\nImmortal lads bear banners,\nJade maidens scatter incense.\nThe Five Elders bow in reverence,\nMajestic and resplendent,\nSun and moon intertwined in sash,\nDivine immortals lend their aid.\nTreading the Six States,\nTraversing the four quarters,\nThe Four Waterways and Five Marchmounts\nBecome bridges for my passage.\nBy the August Lord’s command,\nSweep away all inauspiciousness.\nWherever I journey,\nAll shall be most propitious.\nWondrous and strange,\nThe immortal’s refinement flourishes within,\nThe foreign lands grow luminous without,\nAscending to the Jade Capital above.\"*\n\nWhen finished, draw in the breath thirty-six times and cease. This is the mighty incantation of the Prime Minister’s excursions, by which one governs the Six States, subdues the myriad spirits, summons immortal officials to manifest, and performs boundless transformations, ascending to the Great Clarity.\n\nThe recipient must fast for seven days, or thirty days, and during the fast present thirty-two feet of azure-patterned silk, one golden fish, one jade dragon, nine pairs of golden rings, and five taels of gold as substitutes for the oath of cutting hair and tearing cloth. The master shall face north to proclaim the covenant and transmit the writ, while the disciple receives it with reverence, adhering to the statutes of the Four Poles, gathering in solemnity and restraint, guarding the precepts in secrecy and upholding them faithfully.\n\nThe Most High Clarity’s Jade Guardian, King of the Prime Minister and Grand Marshal, commands the Master of the Lofty Dawn, the Azure Lad of the Jade Gate of the Eastern Sea, to receive this from the Most High Jade Emperor and transmit it to the Perfected of the Four Poles. The Five Thearchs’ divine soldiers shall punish those who leak its secrets, break their covenant, or betray their oath: their seven ancestors shall bear the burden, their own person shall perish, enduring the three paths and five sufferings for ten thousand kalpas without pardon.\n\nHere ends the *Upper Scroll of the Azure Lad’s Writ of the Outer Realms’ Ranks* of the Most High Clarity.\nHere begins the *Lower Scroll of the Azure Lad’s Writ of the Outer Realms’ Ranks* of the Most High Clarity.",
      "overlap_context": "eupon the host of immortals and the Five Directions’ officials all come to bow, the border sentinels welcome, the myriad demons are subdued, the thousand spirits are commanded, the Six States are overawed, the five weapons are subjugated, transformations are boundless, and one may follow one’s will. Descending green chariots of the cinnabar clouds come to receive one’s person, ascending to the Eastern Flower’s Azure Palace, attaining the rank of Prime Minister and governing the myriad Perfected.",
      "start_char": 6445,
      "end_char": 7047,
      "start_sentence": 184,
      "end_sentence": 197,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.033963680267334,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "高上九玄三十六天内音 高上九玄空洞三十六天、洞渊九地外国放品内音者，乃生於太空九玄之先，结飞玄紫气自然之章，灵文郁乎 重霄，真光焕乎 上清，神奇表异於太汉，玉音朗激於金庭，回风流於紫烟，扬香洒於八冥，丹晖发其琼干，朱日灌其神真，流盻亿劫，虚降空玄，三素启运，九度推迁，灵音表见，刻书昆仑之山，玄圃之上积石之阴，文彩垂芒，精焕上天，日月齐其光，五星同其明，四会八达，洞彻玉清，飞仙紫童各三百人，典香待灵，佩以玃天之兽，扞以金头万重，九色流霞蔼其巅，神鸾朱凤抚其轩，五帝监真，四极典仙，七曜吐精以莹厉，玉华散真以饰尘，履阳否而不厌，经万劫而更鲜。 至中皇元年三月一日甲子，天德值合之时，上清太真玉保王上相大司马，命高晨师东海玉门青华小童君，清斋上宫九百日，青金盟天，受於高上玉帝，徧游诸天，洞鉴虚无，流眄亿津，上观无崖，中戏广员，周历六国，盘回九玄，四司鉴试，上元定仙，玉虚垂映，龟母降真，八景策辔，五老翼轩，飞仙互骋，八风奏烟，流电激威，百阳吐精，琼轮曜虚，羽盖郁玄，金童散华，玉女拂尘，众灵稽首，五岳朝真，诸天晏礼，十方司迎，总领亿道，普监万仙，位登上相，主司高晨，寔由玉帝之妙旨，三十六天之琼音，主生死於图籍，掌仙号於青宫，领金名於玄记，典白简於玉篇，上统无崖无极无穷，下摄洞渊九地万灵，五岳四极河海众仙，至三十六国，莫不咸隶於青童。 旧科万劫一传，九五之运，三代交并，当有玉名书於帝录三十六人，得见其文，得佩此音，九地灭迹，六国邀迎，三十六天书名，上宫三元下降，自然成仙。 玄典苞於洞源，灵轨巍巍乎难论，玉澳深而难测，妙化难可屡陈，略举千分之一，粗标万奇之一真也。 诸天内铭九地三十六音，以元始同存，空灵建号，结自然之名，表於九玄，演流外国三十六音。 如是天地，各有三十六分，天则有三十六天王，以应三十六国，地有三十六土皇，以应三十六天。 天王与真土皇主仙，为学不知天之内音，则天王不领兆名，不知地下之音，土皇则不灭兆迹，闭不得仙。 有见其文，受其诀音，天王玄鉴，七圣刻篇，西龟定录，东华书名，土皇灭尸落迹，九阴保举上清，五灵敬护，十界扶迎，周流六国，平灭群凶，五兵摧伏，天魔束形，九年乘空，飞行上清。 真道高妙，不得妄宣，轻泄宝音，七祖充责，己身殒亡，三涂五苦，万劫不原上真之士，慎科而行。 诸天王常以八节及月朔之日，游观无崖，历戏云房，逍遥玉清，流眄十方，於明霞之上，常咏诸天内音飞玄之章，上庆天真，内欢神衿，玉响虚朗，琼韵合音。 当此之日，五老浮位，九帝临轩，四司鉴试，五帝卫灵，众真齐唱，万仙礼音，三光停晖，七元焕明，山海静波，诸天肃清，八素散华，四皇拂尘，灵风扬香，绿霞吐津，天元溟滞，玉虚含欣，朗朗高清之馆，眇眇太漠之中，洞虚入微，周鉴无穷。 有得其道，与帝结朋，勤诵其章，位准仙王，德同诸天，寿齐三光。 凡学上仙之道，志登玉清，奉礼帝尊，而不知三十六天之音，飞玄之章，则三十六天王不领兆名，徒为精勤，天不降真，四司不敬，五帝不迎，天魔侵真，终不成仙。",
      "translated_text": "The *Inner Sounds of the Nine Mysteries and Thirty-Six Heavens of the Most High* and the *Inner Sounds of the Outer Realms’ Ranks of the Thirty-Six Heavens of the Cavernous Abyss and Nine Lands* originated before the Nine Mysteries of the Great Void. They coalesced from the soaring, mysterious purple qi as natural scriptures, their numinous writs dense in the layered skies, their true radiance resplendent in the Highest Clarity. Their divine marvels manifested in the Great Han, their jade tones ringing clear in the Golden Court. Whirling winds coursed through the purple mists, incense scattered across the Eight Darks. Cinnabar brilliance shone upon their jasper stems, the vermilion sun bathed the divine perfected. Through countless kalpas, they descended in emptiness from the mysterious void. The Three Primes initiated their motion, the Nine Cycles propelled their shifts. The numinous sounds appeared, inscribed upon Kunlun’s slopes, above the Jasper Gardens, and beneath the Accumulated Stones. Their radiant patterns cast forth splendor, their essence blazed toward the heavens. The sun and moon matched their light, the five stars shared their brilliance. The Four Convergences and Eight Reaches pierced through the Jade Clarity. Three hundred flying immortals and purple lads each attended the incense and awaited the numinous, girded with the beasts of the Jue Heaven, defended by myriad layers of golden heads. Nine-colored streaming clouds crowned their peaks, divine simurghs and vermilion phoenixes perched upon their pavilions. The Five Thearchs oversaw the perfected, the Four Poles governed the immortals. The Seven Luminaries exhaled their essence to refine and temper, jade blossoms scattered their truth to adorn the dust. Treading the yang’s decline without weariness, enduring ten thousand kalpas yet ever fresh.\n\nOn the first day of the third month of the first year of the Middle August Era, at the hour when Heavenly Virtue aligned, the Most High Clarity’s Jade Guardian, King of the Prime Minister and Grand Marshal, commanded the Master of the Lofty Dawn, the Azure Lad of the Jade Gate of the Eastern Sea, to purify himself in the Upper Palace for nine hundred days, to pledge alliance with the Azure and Gold Heavens, and to receive this from the Most High Jade Emperor. He traversed all heavens, penetratingly beheld the void, his gaze flowing across countless fordings. Above, he observed the boundless; at the center, he sported in the vast expanse. He circled the Six Lands, wound through the Nine Mysteries. The Four Offices examined and tested him, the Upper Prime fixed his immortal rank. The Jade Void cast its reflection, the Tortoise Mother descended with truth. The Eight Effulgences reined their steeds, the Five Elders flanked his chariot. Flying immortals raced one another, the Eight Winds played amidst the mists. Streaming lightning flashed with might, a hundred suns exhaled their essence. Jasper wheels illuminated the void, feathered canopies billowed in mystery. Golden lads scattered blossoms, jade maidens brushed away dust. The host of spirits bowed their heads, the Five Marchmounts paid homage to the perfected. The various heavens offered their rites, the ten directions’ overseers welcomed him. He governed the myriad Dao, universally oversaw the ten thousand immortals. His rank ascended to Prime Minister, he presided over the Lofty Dawn, truly by the wondrous decree of the Jade Emperor and the jade tones of the Thirty-Six Heavens. He controlled life and death in the registers, held the immortal titles in the Azure Palace, led the golden names in the mysterious records, and oversaw the white tablets in the jade chapters. Above, he governed the boundless, infinite, and inexhaustible; below, he oversaw the Cavernous Abyss, the Nine Lands, and the myriad spirits of the Five Marchmounts, Four Poles, rivers, and seas, along with the immortals of the Thirty-Six Lands—none were not subject to the Azure Lad.\n\nBy ancient statute, this was transmitted once every ten thousand kalpas, at the conjunction of the Nine and Five Cycles, when the Three Eras intersected. There were thirty-six names inscribed in the Emperor’s register. Those who beheld its writ and wore these sounds would erase their traces in the Nine Lands, be welcomed from afar by the Six Lands, and have their names recorded in the Thirty-Six Heavens. The Three Primes of the Upper Palace would descend, and they would naturally become immortals.\n\nThe mysterious canon encompassed the cavernous source, its numinous principles towering and beyond discourse. The jade depths were profound and unfathomable, its wondrous transformations too subtle to recount repeatedly. Here, but a thousandth part is briefly raised, a single truth coarsely marked from ten thousand marvels.\n\nThe *Inner Inscriptions of the Various Heavens* and the *Thirty-Six Sounds of the Nine Lands* coexisted with the Primordial Beginning, established their titles in the empty numinous, and wove their natural names to manifest in the Nine Mysteries, unfolding the Thirty-Six Sounds of the Outer Realms. Thus, heaven and earth each had thirty-six divisions: heaven had thirty-six Heavenly Kings to correspond to the thirty-six lands, and earth had thirty-six Earthly Sovereigns to correspond to the thirty-six heavens. The Heavenly Kings and true Earthly Sovereigns presided over the immortals. Those who studied yet did not know the Inner Sounds of Heaven would not have their names recorded by the Heavenly Kings; those who did not know the sounds of the earth below would not have their traces erased by the Earthly Sovereigns, and thus would remain barred from immortality.\n\nThose who beheld its writ and received its oral instructions would have the Heavenly Kings’ mysterious scrutiny, the Seven Sages’ inscribed chapters, the Western Tortoise’s fixed register, and the Eastern Florescence’s recorded names. The Earthly Sovereigns would erase their corpses and obliterate their traces, the Nine Yin would recommend them to the Highest Clarity, the Five Numinous would reverently guard them, and the Ten Realms would support their ascent. They would circulate through the Six Lands, pacify and eliminate the multitude of evils, subdue the five weapons, and bind the heavenly demons. After nine years, they would ride the void and fly to the Highest Clarity.\n\nThe true Dao is lofty and wondrous; it must not be rashly proclaimed. Those who lightly divulge its sacred sounds shall have their seven ancestors burdened, their own persons perish, and endure the three paths and five sufferings for ten thousand kalpas without pardon. Perfected adepts must heed the statutes and act accordingly.\n\nThe Heavenly Kings regularly, on the eight solar terms and the first days of each month, roam and observe the boundless, sport in the cloud chambers, and wander carefree in the Jade Clarity. Their gaze flows across the ten directions, and above the bright clouds, they constantly chant the *Inner Sounds of the Various Heavens* and the *Soaring Mystery’s Chapters* to celebrate the heavenly perfected, inwardly delighting their divine hearts. Jade tones resonate in emptiness, jasper melodies harmonize. On such days, the Five Elders rise from their seats, the Nine Thearchs attend their pavilions. The Four Offices examine and test, the Five Thearchs guard the numinous. The host of perfected sings in unison, the ten thousand immortals offer their ritual sounds. The Three Luminaries pause their brilliance, the Seven Primes blaze with light. Mountains and seas grow still, the various heavens grow solemn and clear. The Eight Primes scatter blossoms, the Four August Ones brush away dust. Numinous winds waft incense, green clouds exhale nectar. The heavenly origin dissolves its stagnation, the Jade Void contains its joy. In the bright and lofty halls of the Highest Clarity, amidst the vast and distant Great Desert, the cavernous void enters the subtle, and all-pervading scrutiny knows no end.\n\nThose who attain this Dao and befriend the Thearch, diligently recite its chapters, shall have their ranks equated with the Immortal Kings, their virtue equated with the various heavens, and their lifespan equated with the Three Luminaries. All who study the Dao of the highest immortals, aspiring to ascend to the Jade Clarity and pay homage to the August Honored One, yet do not know the sounds of the Thirty-Six Heavens and the *Soaring Mystery’s Chapters*, shall not have their names recorded by the Thirty-Six Heavenly Kings. Their efforts shall be in vain, heaven shall not descend its truth, the Four Offices shall not revere them, the Five Thearchs shall not welcome them, and heavenly demons shall invade their truth. They shall never attain immortality.",
      "overlap_context": "les. The Five Thearchs’ divine soldiers shall punish those who leak its secrets, break their covenant, or betray their oath: their seven ancestors shall bear the burden, their own person shall perish, enduring the three paths and five sufferings for ten thousand kalpas without pardon.\n\nHere ends the *Upper Scroll of the Azure Lad’s Writ of the Outer Realms’ Ranks* of the Most High Clarity.\nHere begins the *Lower Scroll of the Azure Lad’s Writ of the Outer Realms’ Ranks* of the Most High Clarity.",
      "start_char": 7047,
      "end_char": 8280,
      "start_sentence": 198,
      "end_sentence": 213,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.659080266952515,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "欲飞行玄虚，游宴五岳，而不知九地三十六土皇内名，则九阴不落兆尸，九地不灭兆迹，徒劳幽山，望飞反沉。 欲行此道，每至八节、月朔之日，沐浴清斋，入室烧香，朝礼诸天，北向叩齿三十六通，微咒曰： 兆臣甲子，志慕神仙，八庆之日，朝礼天尊，上愿腾景，乘空落烟，飞超玉清，洞游诸天，中愿变形，降致五神，升入月门，仰啜八骞，石景水母，玉胞飞根，长披朱日，与光同存，下愿四极，授我口言，西华侍卫，役使金晨，携提五老，八景同轩，上庆交合，五愿开陈，得如所愿，体合自然，真灵下降，赐登上仙。 毕，便六拜，仰咽六气； 次西向六拜，咽六气，次南向六拜，咽六气；",
      "translated_text": "Those who aspire to soar through the mysterious void and wander the Five Peaks, yet do not know the inner names of the Nine Earths and the Thirty-Six Earthly Thearchs, shall not have their corpse cast into the Nine Yin, nor their traces extinguished in the Nine Earths. Their toil in the hidden mountains shall be in vain, and their hopes of flight shall instead plunge them into the depths.\n\nTo practice this Dao, on each of the Eight Solar Terms and the first day of the lunar month, bathe in purity, maintain a fast, enter the chamber, and burn incense. Pay homage to the various heavens, face north, and knock the teeth thirty-six times. Softly intone the incantation:\n\n*\"Your servant, [Name], yearns for the divine immortals. On this day of eightfold felicity, I pay homage to the Heavenly Honored One. My highest wish is to ride the luminous essence, traverse the void, and drift upon the mist, to soar beyond the Jade Clarity and roam freely through the heavens. My middle wish is to transform my form, summon the Five Spirits, ascend through the Moon Gate, and drink from the Eight Steeds. May the Stone Radiance and Water Mother, the Jade Embryo and Flying Root, clothe me in the crimson sun, that I may abide in its light. My lowest wish is for the Four Poles to bestow upon me the sacred words, for the Western Florescence to guard me, and for the Golden Dawn to serve me. May I command the Five Elders and share the same chariot as the Eight Effulgences. May the upper and lower felicitations unite, and my five wishes be fulfilled. Grant that my desires be realized, my body harmonized with nature, and the true numina descend to confer upon me the rank of highest immortal.\"*\n\nWhen finished, perform six bows and inhale six breaths while facing upward. Then turn west, perform six bows, and inhale six breaths. Finally, turn south, perform six bows, and inhale six breaths.",
      "overlap_context": "of the highest immortals, aspiring to ascend to the Jade Clarity and pay homage to the August Honored One, yet do not know the sounds of the Thirty-Six Heavens and the *Soaring Mystery’s Chapters*, shall not have their names recorded by the Thirty-Six Heavenly Kings. Their efforts shall be in vain, heaven shall not descend its truth, the Four Offices shall not revere them, the Five Thearchs shall not welcome them, and heavenly demons shall invade their truth. They shall never attain immortality.",
      "start_char": 8280,
      "end_char": 8546,
      "start_sentence": 214,
      "end_sentence": 218,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.015334129333496,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "次东向六拜，咽六气，次西北六拜，咽六气，次东南六拜，咽六气。 合六方三十六拜，朝三十六天毕，还北向平坐，咏三十六天飞玄之章一遍，竟，又六拜，六咽气，都止也。 此高上朝三十六天上法，行之九年，天降云舆，三元诣房，书名玉清，刻简青宫，四司右别，十界敬迎，乘空飞行，上升玉晨。 其法高妙，不得妄宣，轻泄宝文，七祖充责，身没鬼官，长闭三徒，万劫不原。 高上九玄三十六天内音 第一无景无色郁单无量天 英勃 天王姓混讳罗 第二无形清微天 化升 天王姓冯讳提阿沙 第三无精波罗褥天 玄黑 天王姓云讳奎零 第四入色水无量亿罗天 飞宗 天王姓王讳阿卫",
      "translated_text": "Next, turn east, perform six bows, and inhale six breaths; then turn northwest, perform six bows, and inhale six breaths; finally, turn southeast, perform six bows, and inhale six breaths. Having completed thirty-six bows in the six directions, the audience with the Thirty-Six Heavens is concluded. Return to face north and sit upright, then chant the \"Chapter of the Flying Mystery of the Thirty-Six Heavens\" once through. When finished, perform six bows again and inhale six breaths, and the rite is complete.\n\nThis is the supreme method of audience with the Thirty-Six Heavens. Practicing it for nine years will cause a cloud chariot to descend from heaven, and the Three Primes will attend your chamber. Your name will be inscribed in the Jade Purity, carved upon the azure tablets of the Green Palace. The Four Offices will distinguish you to the right, and the Ten Realms will reverently welcome you. You will ride the void and ascend to the Jade Dawn.\n\nThis method is most wondrous; it must not be rashly disclosed. To carelessly reveal its sacred texts will bring punishment upon seven generations of ancestors, consigning your body to the offices of ghosts and confining you eternally in the Three Prisons, never to be released for ten thousand kalpas.\n\n*Inner Sounds of the Supreme Nine Mysteries and Thirty-Six Heavens*\n1. The Boundless Heaven of Utmost Singularity, without radiance or form – *Yudan Wuliang Tian*\n   Sovereign: *Yingbo*\n   Heavenly King: Surnamed *Hun*, named *Nini Luo*\n\n2. The Heaven of Formless Purity – *Wuxing Qingwei Tian*\n   Sovereign: *Huasheng*\n   Heavenly King: Surnamed *Feng*, named *Tiasasha*\n\n3. The Heaven of No Essence, the Wave-Span – *Wujing Poloru Tian*\n   Sovereign: *Xuanhei*\n   Heavenly King: Surnamed *Yun*, named *Kuiling*\n\n4. The Heaven of Entering Form, the Water-Boundless Myriad – *Ruse Shuiwuliang Yiluo Tian*\n   Sovereign: *Feizong*\n   Heavenly King: Surnamed *Wang*, named *Awei*",
      "overlap_context": " I command the Five Elders and share the same chariot as the Eight Effulgences. May the upper and lower felicitations unite, and my five wishes be fulfilled. Grant that my desires be realized, my body harmonized with nature, and the true numina descend to confer upon me the rank of highest immortal.\"*\n\nWhen finished, perform six bows and inhale six breaths while facing upward. Then turn west, perform six bows, and inhale six breaths. Finally, turn south, perform six bows, and inhale six breaths.",
      "start_char": 8546,
      "end_char": 8838,
      "start_sentence": 219,
      "end_sentence": 235,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.408287048339844,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "四天之音，元始自然气，在高上玉清之上。 四天王常以八节、月朔之日，游观高上玉清无崖无极无形无色太空之巅，诵咏四天之音飞玄之章，其日符四司周行天下。 学仙之人，有斋诚诵经，朝礼诸天者，即刻名玄简，注录青宫，寿同四天之人，九年飞行，白日升天。 四天自然飞玄之章曰 郁澄缘梵，宝禅王和，三界携轮，九象提魔，维结洞览，荣秀垂柯，庆霄重飞，朱兰吐葩，流丹上回，精灌玉霞，凤鸣绝峰，龙骇玄阿，金音遥朗，虚韵结那，三晨敷晖，朱采文罗，九空迅烟，八风扬华，金舆琼轮，凤轩婆娑，金音流馥，云层峨峨，芳津交洒，灵浆滂沲，玄谷玉泉，如舟如河，体洞自然，亿龄奚多，徘徊金门，宴景皇家，长保玉虚，永无倾差。 第五无极洞清上上禅善无量寿天 云罗",
      "translated_text": "The Sounds of the Four Heavens arise from the primordial, spontaneous qi of the Yuan Shi, existing above the Supreme Jade Purity. On the eight solar terms and the first day of each lunar month, the Four Heavenly Kings roam and observe the summit of the Supreme Jade Purity—boundless, infinite, formless, and colorless—chanting the *Flying Mystery Stanzas* of the Four Heavens’ Sounds. On these days, talismans from the Four Offices circulate throughout the world. Those who study the Dao, maintain purity through fasting, recite the scriptures, and pay homage to the various heavens will instantly have their names inscribed on the jade tablets of the Mysterious Register and recorded in the Azure Palace. Their lifespan will equal that of the denizens of the Four Heavens, and after nine years of aerial flight, they will ascend to heaven in broad daylight.\n\nThe *Spontaneous Flying Mystery Stanzas* of the Four Heavens proclaim:\n\nProfound and serene, entwined with Brahma’s grace,\nThe Treasure Dhyāna King harmonizes all.\nThe Three Realms bear the wheel’s embrace,\nThe Nine Images subdue the demons’ thrall.\nMystic knots unfold in boundless sight,\nLush branches trail in radiant might.\nJubilant clouds soar anew in flight,\nCrimson orchids bloom in splendor bright.\nVermilion essences spiral upward high,\nEssence bathes the jade-hued sky.\nPhoenixes cry on peaks untrod,\nDragons startle in the Dao’s abode.\nGolden tones resound afar,\nEmpty melodies weave *Nāda*’s scarf.\nThree dawns unfold their gleaming light,\nCrimson hues adorn the patterned night.\nNine voids swift as racing smoke,\nEight winds scatter blossoms’ cloak.\nGolden chariots with jade wheels spin,\nPhoenix carriages whirl within.\nGolden tones waft fragrant air,\nClouds in towering peaks repair.\nSweet nectars mingle, scatter wide,\nDivine elixirs pour and glide.\nMystic valleys, jade springs flow,\nLike rivers vast or boats that row.\nThe body merges with the natural state,\nEons pass—what weight or weight?\nLingering at the Golden Gate,\nFeasting in the Radiant Emperor’s estate.\nEternally guard the Jade Void’s height,\nForever free from decline or blight.\n\n5. The Heaven of Limitless Cavernous Purity, Supreme Meditation, and Boundless Longevity – *Wuji Dongqing Shangshang Chan Shan Wuliang Shou Tian*\n   *Yunluo*",
      "overlap_context": " *Yingbo*\n   Heavenly King: Surnamed *Hun*, named *Nini Luo*\n\n2. The Heaven of Formless Purity – *Wuxing Qingwei Tian*\n   Sovereign: *Huasheng*\n   Heavenly King: Surnamed *Feng*, named *Tiasasha*\n\n3. The Heaven of No Essence, the Wave-Span – *Wujing Poloru Tian*\n   Sovereign: *Xuanhei*\n   Heavenly King: Surnamed *Yun*, named *Kuiling*\n\n4. The Heaven of Entering Form, the Water-Boundless Myriad – *Ruse Shuiwuliang Yiluo Tian*\n   Sovereign: *Feizong*\n   Heavenly King: Surnamed *Wang*, named *Awei*",
      "start_char": 8838,
      "end_char": 9155,
      "start_sentence": 236,
      "end_sentence": 242,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.048100233078003,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "天王姓讳 第六玄微自然上虚禹余天 梵咽 天王姓罗讳波梨荼 第七玄清上无那首约诤天 玄那 天王姓梵讳摩首波 第八梵行上清气稽那边净天 云携 天王姓骞讳首苛 四天之音，上始胤梵自然气，在高虚玉清之中。 四天王常以八节、月朔之日，游观高虚无涯无极无名玄空之巅，诵咏四天之音飞玄之章，其日符天真使者周行天下。 有学仙清苦斋诚，诵飞玄之章，朝礼诸天，即奏名四天，刻书帝简，寿同四天之人，九年飞行，上升天宫。 四天飞玄之章曰 波韵呵泥，玄景散晖，丹霞敷简，曜灵琼微，零风梵音，朱日左回，玉响玄室，金霄四垂，高骞拂精，石景腾飞，诸天玄映，玉帝徘徊，绿辕丹舆，翠羽锦衣，游朗九崖，手披天扉，与日同盛，与月同衰，沐浴金门，冠带神辉，学同天人，寿极二仪，高上合欢，万仙总归，玉虚结符，永无倾危，天真敷陈，上亭紫微，斯愿仰降，朝礼玉阶。 第九无穷洞虚极上须延天 回摩",
      "translated_text": "The Heavenly King, surnamed *Kai*, given name *Mouliju* – *Sixth Xuanwei Ziran Shangxu Yuyu Heaven*\n*Fanyan*\n\nThe Heavenly King, surnamed Luo, given name *Politu* – *Seventh Xuanqing Shangwu Nashou Yuezheng Heaven*\n*Xuanna*\n\nThe Heavenly King, surnamed Fan, given name *Moshoubo* – *Eighth Fanxing Shangqing Qi Jina Bianjing Heaven*\n*Yunxie*\n\nThe Heavenly King, surnamed Qian, given name *Shouke* – The Four Heavenly Voices, the Primordial Progeny of the Dao’s Natural Qi, dwell within the High Void of Jade Purity.\n\nOn the eight solar terms and the first day of each lunar month, the Four Heavenly Kings roam and observe the summit of the High Void—boundless, limitless, nameless, and profoundly empty—chanting the *Four Heavenly Voices* and the *Flying Mystery’s Hymn*. On these days, the celestial envoys of the Perfected traverse the heavens.\n\nThose who cultivate immortality through ascetic devotion, recite the *Flying Mystery’s Hymn*, and pay homage to the heavens at dawn shall have their names presented to the Four Heavens, inscribed upon the Emperor’s tablets. Their lifespan shall equal that of the Four Heavenly Beings, and after nine years of flight, they shall ascend to the celestial palaces.\n\nThe *Flying Mystery’s Hymn of the Four Heavens* proclaims:\n\n*Boya he ni,*\n*Mystic radiance scatters its glow,*\n*Crimson clouds unfurl their scrolls,*\n*Luminous essence gleams like jade dust.*\n*Falling winds carry the Daoist tones,*\n*The vermilion sun wheels leftward,*\n*Jade echoes resound in the Mystic Chamber,*\n*Golden skies descend on all four sides.*\n*Lofty flight brushes the essence,*\n*Stony light soars aloft,*\n*The heavens reflect in profound splendor,*\n*The Jade Emperor lingers in contemplation.*\n*Green chariots and crimson carriages,*\n*Kingfisher plumes and brocade robes,*\n*Wandering the nine cliffs,*\n*Hands parting the gates of heaven.*\n*Flourishing with the sun,*\n*Waning with the moon,*\n*Bathed at the Golden Gate,*\n*Adorned with the radiance of spirits.*\n*Learning equals that of celestial beings,*\n*Lifespan spans the Two Modes.*\n*Ascending to join in harmony,*\n*All immortals converge in return.*\n*The Jade Void seals its pact,*\n*Forever free from peril or decline.*\n*The Perfected unfold their celestial array,*\n*Ascending to the Purple Tenuity’s pavilion.*\n*May this vow descend from on high,*\n*As we pay homage at the Jade Stairs.*\n\n*Ninth Wuqiong Dongxu Jishang Xuyan Heaven*\n*Huimo*",
      "overlap_context": "le, scatter wide,\nDivine elixirs pour and glide.\nMystic valleys, jade springs flow,\nLike rivers vast or boats that row.\nThe body merges with the natural state,\nEons pass—what weight or weight?\nLingering at the Golden Gate,\nFeasting in the Radiant Emperor’s estate.\nEternally guard the Jade Void’s height,\nForever free from decline or blight.\n\n5. The Heaven of Limitless Cavernous Purity, Supreme Meditation, and Boundless Longevity – *Wuji Dongqing Shangshang Chan Shan Wuliang Shou Tian*\n   *Yunluo*",
      "start_char": 9155,
      "end_char": 9563,
      "start_sentence": 243,
      "end_sentence": 259,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.95955991744995,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "天王姓泽讳罗 第十玄梵玉虚无精炁罗迦浮月天 云阿 天王姓周讳阿迦须 第十一炁玄天达上灵赤天 重慕 天王姓丹讳清浮□ 第十二大梵玄元炁离和行如天 世毕 天王姓固讳分若 四天之音，九空始阳洞冥之气，在玄虚玉清之下。 四天王常以八节、月朔之日，游观常虚无崖无鞅空虚之中，诵咏四天之音飞玄之章，其日遣太真使者周行天下。 有学仙清斋，诵经朝礼者，即奏名四天，刻书帝录，寿同四天之人，九年飞行，上升天宫。 四天飞玄之章曰 诃罗夜宝，玉梵秀骞，维那弥落，洞赜世真，玉瑶叩音，琳响自然，朱琼曜葩，庆云内鲜，流霞吐兰，丹回紫烟，三天齐光，七曜启晨，八景回舆，九帝同轩，携提高匠，紫虚上仙，齐唱合韵，以部玉真，灵典遐眇，琼音命神，五老束带，四极罗缠，九气徘徊，结虚成烟，三灵垂映，七精灌津，形陶玉润，拔度玄根，超凌无崖，历戏诸天，洞入无色，反我宿缘。 第十三无极上灵玉空玄洞寂然天 家主 天王姓津讳 第十四宝梵天色上真炁潘罗玄妙天 云持 天王姓随讳梨沐音 第十五飞梵行真上玄答谩福德天 部剩 天王姓王讳惟钵离 第十六云梵流精中元近惑际淳天 世良 天王姓朱讳梨蔼",
      "translated_text": "The Heavenly King surnamed Ze, named Hui Luo\nTenth: Mystic Brahma Jade Void Non-Existent Essence Qi Luo Jia Fu Moon Heaven\nYun A\n\nThe Heavenly King surnamed Zhou, named A Jia Xu\nEleventh: Qi Mystic Heaven Attaining Supreme Numinous Crimson Heaven\nChong Mu\n\nThe Heavenly King surnamed Dan, named Qing Fu □\nTwelfth: Great Brahma Mystic Origin Qi Departing Harmony Proceeding Heaven\nShi Bi\n\nThe Heavenly King surnamed Gu, named Fen Ruo\nThe Sounds of the Four Heavens, the Nine Voids’ Primordial Yang, the Qi of Cavernous Obscurity—all dwell beneath the Mystic Void Jade Purity.\n\nThe Four Heavenly Kings, on the eight solar terms and the first day of each lunar month, roam and observe the boundless void of the Constant Non-Existence Cliff, chanting the Sounds of the Four Heavens and the Flying Mysteries’ Hymns. On such days, they dispatch the Supreme Perfected Envoys to traverse the world below. Those who cultivate immortality through pure fasting, recite scriptures, and pay homage in audience shall have their names memorialized to the Four Heavens, inscribed in the Emperor’s Register. Their lifespan shall equal that of the Four Heavenly Beings; after nine years of flight, they shall ascend to the Celestial Palace.\n\nThe Hymn of the Four Heavens’ Flying Mysteries reads:\nHaraya Treasure, Jade Brahma’s flourishing splendor,\nVina’s radiant fall, Cavernous Profundity’s worldly truth,\nJade chime’s resonant sound, lush echoes arise naturally,\nCrimson jasper blooms, auspicious clouds gleam within,\nFlowing rosy clouds sprout orchids, cinnabar swirls in purple mist,\nThe Three Heavens unite in radiance, the Seven Luminaries usher dawn,\nEight Sceneries turn their chariots, the Nine Emperors share their carriages,\nLifting high the exalted craftsman, the Purple Void’s Supreme Immortals,\nIn unison they chant and harmonize, arraying the Jade Perfected,\nSacred canons vast and distant, jade tones command the spirits,\nThe Five Elders gird their sashes, the Four Poles entwine in coils,\nThe Nine Qi meander, weaving the void into mist,\nThe Three Numinous Ones cast their glow, the Seven Essences bathe in dew,\nForms are molded, jade-refined, the Mystic Root is delivered,\nTranscending beyond all bounds, traversing the manifold heavens,\nPenetrating the formless, returning to my karmic origins.\n\nThirteenth: Supreme Numinous Jade Void Mystic Cavern Serene Heaven\nJia Zhu\n\nThe Heavenly King surnamed Jin, named □ □\nFourteenth: Treasure Brahma Heaven’s Color Supreme Perfected Qi Pan Luo Mystic Wondrous Heaven\nYun Chi\n\nThe Heavenly King surnamed Sui, named Li Mu Yin\nFifteenth: Flying Brahma Practicing Perfected Supreme Mystic Answering Deception Blessing Virtue Heaven\nBu Sheng\n\nThe Heavenly King surnamed Wang, named Wei Bo Li\nSixteenth: Cloud Brahma Flowing Essence Middle Origin Near Delusion’s Edge Pure Heaven\nShi Liang\n\nThe Heavenly King surnamed Zhu, named Li Ai",
      "overlap_context": "thed at the Golden Gate,*\n*Adorned with the radiance of spirits.*\n*Learning equals that of celestial beings,*\n*Lifespan spans the Two Modes.*\n*Ascending to join in harmony,*\n*All immortals converge in return.*\n*The Jade Void seals its pact,*\n*Forever free from peril or decline.*\n*The Perfected unfold their celestial array,*\n*Ascending to the Purple Tenuity’s pavilion.*\n*May this vow descend from on high,*\n*As we pay homage at the Jade Stairs.*\n\n*Ninth Wuqiong Dongxu Jishang Xuyan Heaven*\n*Huimo*",
      "start_char": 9563,
      "end_char": 10086,
      "start_sentence": 260,
      "end_sentence": 286,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.829960346221924,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "四天之音，梵行上始洞虚之气，在虚皇上清之上。 四天王常以八节、月朔之日，游观虚皇上清无崖无极空洞之上，诵咏四天之音飞玄之章，其日遣上仙玉监周行天下。 有学仙行道，朝礼诸天，烧香诵经，即奏名四天，刻书录简，寿同四天之人，九年飞行空虚，上升玄宫。 四天飞玄之章日 摩夷四张，六韵合双，灵音散发，虚变成宫，玉玄逸霄，提诃激锺，琼响琅玕，啸神命童，八景齐真，九帝同朋，南越浮利，北落寒宫，回真四周，广灵之堂，上御灵章，下制魔凶，云飞重玄，四达交通，缘霞吐津，罗布太空，紫虚结烟，徘徊丹房，三辉洞明，七曜流光，朱日郁茂，绿梵洋洋，主十六位，玉兰灌芳，九隅齐响，禅我为王，鉴映十天，万仙来宗，有明琼音，玄成仙公，与劫为期，永保无穷。 第十七玄上洞极无崖不骄乐天 流芳",
      "translated_text": "The Four Heavens’ hymns, the Brahma-practicing primordial qi of the Cavernous Void, abide above the Supreme Void Sovereign’s Upper Clarity. The Four Heavenly Kings, on the eight solar terms and the first day of each lunar month, roam and observe above the boundless, infinite Cavernous Void of the Supreme Void Sovereign’s Upper Clarity. They chant the hymns of the Four Heavens’ soaring mystery, and on those days, dispatch the jade overseers among the perfected to traverse the world below. Those who cultivate immortality, practice the Dao, pay homage to the heavens, burn incense, and recite scriptures—these names are memorialized to the Four Heavens, inscribed upon jade tablets, and their lifespans become equal to those of the Four Heavens. After nine years, they soar through the empty void, ascending to the Mystic Palace.\n\nThe hymn of the Four Heavens’ soaring mystery reads:\nMāyā spreads fourfold, six rhymes unite in pairs,\nNuminous tones scatter and radiate, the Void transforms into palaces.\nJade mystery drifts through the empyrean, Tihe strikes the resounding bells,\nJasper echoes like ringing jade, whistling spirits summon the lads.\nEight luminaries align in perfection, the Nine Emperors share fellowship,\nSouthward they cross floating Li, northward they descend to the Cold Palace.\nRevolving truth through the four quarters, the Hall of Vast Numinosity,\nAbove they wield the numinous hymn, below they subdue demonic fiends.\nClouds soar through the profound mystery, four directions interconnect,\nMists of dawn spill forth essence, spreading across the great void.\nPurple emptiness weaves mist, lingering in the cinnabar chamber,\nTriple radiance illumines the cavern, the Seven Luminaries stream light.\nThe crimson sun flourishes in splendor, the verdant Brahma overflows,\nPresiding over the sixteen stations, jade orchids bathe in fragrance.\nThe nine corners resound in unison, in meditation I am made king,\nMirroring the ten heavens, myriad immortals come to pay homage.\nWith luminous jasper tones, the mystery is perfected as the Immortal Duke,\nBound to the kalpa’s term, eternally preserved without end.\n\nSeventeenth: Profound Upper Cavernous Ultimate Boundless Unyielding Joy Heaven\nLiu Fang",
      "overlap_context": "\n\nThe Heavenly King surnamed Jin, named □ □\nFourteenth: Treasure Brahma Heaven’s Color Supreme Perfected Qi Pan Luo Mystic Wondrous Heaven\nYun Chi\n\nThe Heavenly King surnamed Sui, named Li Mu Yin\nFifteenth: Flying Brahma Practicing Perfected Supreme Mystic Answering Deception Blessing Virtue Heaven\nBu Sheng\n\nThe Heavenly King surnamed Wang, named Wei Bo Li\nSixteenth: Cloud Brahma Flowing Essence Middle Origin Near Delusion’s Edge Pure Heaven\nShi Liang\n\nThe Heavenly King surnamed Zhu, named Li Ai",
      "start_char": 10086,
      "end_char": 10422,
      "start_sentence": 287,
      "end_sentence": 293,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.554865837097168,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "天王姓凝讳须 第十八大梵玄青无精答奋近际天 元深 天王姓阿讳明秀 第十九行梵紫虚上元首带快见天 洞干 天王姓刘讳且扇 第二十虚梵上清化灵须陁结爱天 飞衣 天王姓彭讳移那 四天之音，飞梵行上虚紫元之气，在虚皇上清之中。 四天王常以八节、月朔之日，游观虚皇上清无崖无极空洞之中，咏诵四天之音飞玄之章，其日遣玉真定仙周行天下。 有学仙行道，朝礼诸天，烧香诵经之人，即奏名天王，刻书青录，寿同四天之人，九年飞行上清。 四天飞玄之章曰： 云昙丹陁，维赜妙灵，重霄郁虚，薄兰翠荣，蔼蔼丹飙，回映云庭，界世法轮，结气澄清，绿柯含条，彩华曜琼，八风舞轩，六龙飞鸣，金音虚朗，玉唱空生，真上景，四帝齐灵，皇崖晏辔，玉仙策軿，游眄四天，洞披三清，逍遥无崖，高映太冥，曜罗灌晖，七元吐精，冠带仙官，津陶朱形，长享元庆，极真玉龄。 第二十一上极无景洞微化应声天 玉携",
      "translated_text": "The Heavenly King surnamed Ning, personal name Xuyao: Eighteenth Great Brahma Profound Azure Unbounded Responsive Near-Boundary Heaven. Yuan Shen.\nThe Heavenly King surnamed A, personal name Mingxiu: Nineteenth Ascendant Brahma Purple Void Upper Prime Origin Swift Vision Heaven. Dong Gan.\nThe Heavenly King surnamed Liu, personal name Qieshan: Twentieth Void Brahma Upper Clarity Transformative Spirit Sutra-Bound Love Heaven. Fei Yi.\nThe Heavenly King surnamed Peng, personal name Yina.\n\nThe voices of the Four Heavens, soaring Brahma ascendant Void Purple Prime qi, abide within the Void Sovereign’s Upper Clarity. The Four Heavenly Kings, on the eight solar terms and the first day of each lunar month, roam and observe within the Void Sovereign’s Upper Clarity—boundless, infinite, and cavernously empty—chanting the voices of the Four Heavens and the soaring mystery hymns. On these days, they dispatch Jade Perfected Stabilizing Immortals to traverse the world. Those who cultivate immortality, practice the Dao, pay homage to the heavens, burn incense, and recite scriptures have their names memorialized to the Heavenly Kings, inscribed in the Azure Register. Their lifespans equal those of the Four Heavenly beings, and after nine years, they ascend to Upper Clarity.\n\nThe hymn of the Four Heavens’ soaring mystery states:\n\nClouds veil cinnabar peaks, profound and wondrously numinous,\nLayered skies dense with emptiness, thin orchids lush with jade verdure.\nVermilion gales billow, swirling to reflect the cloud courts,\nWorldly dharma-wheels bound qi, settling into limpid clarity.\nVerdant boughs cradle branches, iridescent blossoms gleam like jasper,\nEight winds dance upon the carriage, six dragons soar in flight and song.\nGolden tones resonate in emptiness, jade chants arise from the void,\nPerfected ones ascend to the upper realms, the Four Emperors unite in spirit.\nThe August Cliff reins in tranquility, jade immortals urge their chariots,\nGazing across the Four Heavens, they traverse the Three Clarities,\nCarefree and unbounded, loftily illumining the Great Darkness,\nRadiant nets bathe in splendor, the Seven Primes exhale essence.\nCrowned and sashed, the immortal officials refine their vermilion forms in the elixir,\nEver enjoying primal blessings, attaining the ultimate jade longevity of truth.\n\nTwenty-First Supreme Ultimate Boundless Radiance Cavernous Subtle Transformative Responsive Heaven. Yu Xie.",
      "overlap_context": "light.\nThe crimson sun flourishes in splendor, the verdant Brahma overflows,\nPresiding over the sixteen stations, jade orchids bathe in fragrance.\nThe nine corners resound in unison, in meditation I am made king,\nMirroring the ten heavens, myriad immortals come to pay homage.\nWith luminous jasper tones, the mystery is perfected as the Immortal Duke,\nBound to the kalpa’s term, eternally preserved without end.\n\nSeventeenth: Profound Upper Cavernous Ultimate Boundless Unyielding Joy Heaven\nLiu Fang",
      "start_char": 10422,
      "end_char": 10825,
      "start_sentence": 294,
      "end_sentence": 310,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.001437425613403,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "天王姓辉讳 第二十二大梵九玄中元炁阿那给道德天 天葵 天王姓捷讳尼诟 第二十三行梵元清下灵炁须达天 总几 天王姓周讳难首 第二十四极梵洞微九灵无须带阿那天 九曲 天王姓竺讳明和 四天之音，极宝梵上灵玄清之气，在虚皇上清之下。 四天王常以八节、月朔之日，同游虚皇上清无崖无极空洞之下，诵咏四天之音飞玄之章，其日遣领真玉郎周行天下。 有学仙行道，朝礼诸天，烧香诵经之人，即奏名天王，刻书玄文，寿同四天之人，九年飞行上清。 四天飞玄之章曰 提维结缘，金根植灵，世轮法华，九象员明，法鼓朱音，流磬寒庭，八风舞轩，云罗吐琼，琼瑶虚朗，玉慧洞鸣，皇晖含兰，丹葩发荣，玉秀霄柯，重虚紫清，高晨显盖，徘徊金城，八景同和，九帝齐并，流芬翳空，馥洒太冥，飞轮羽盖，升入无形，与气混合，永晏极龄。 第二十五无名至极洞微梵宝天 □□",
      "translated_text": "The Heavenly King surnamed Hui, personal name Zhenyue,\nTwenty-Second Great Brahma Nine Mysteries Central Primordial Qi Anagīta Virtue/Power Heaven.\n\nThe Heavenly King surnamed Jie, personal name Nihou,\nTwenty-Third Practicing Brahma Primordial Purity Lower Numinous Qi Sudatta Heaven.\nGeneral Record.\n\nThe Heavenly King surnamed Zhou, personal name Nanshou,\nTwenty-Fourth Ultimate Brahma Cavernous Subtle Nine Numinous No-Need-Belt Anāgāmin Heaven.\nNine Bends.\n\nThe Heavenly King surnamed Zhu, personal name Minghe.\nThe sounds of the Four Heavens, the supreme treasure of Brahma’s Upper Numinous Mystery and Purity qi, reside beneath the August Void’s Upper Clarity.\n\nThe Four Heavenly Kings, on the eight solar terms and the first day of each lunar month, together roam beneath the boundless and infinite empty cavern of the August Void’s Upper Clarity, chanting the sounds of the Four Heavens and the Flying Mystery’s hymn. On these days, they dispatch Perfected Jade Lords to traverse the world. Those who cultivate immortality, practice the Dao, pay homage to the various heavens, burn incense, and recite scriptures have their names memorialized to the Heavenly Kings, who inscribe their names in the Mystery Script. Their lifespans become equal to those of the Four Heavens’ people, and after nine years, they ascend in flight to the Upper Clarity.\n\nThe hymn of the Four Heavens’ Flying Mystery states:\n*Weave the warp and bind the karmic threads,\nGolden roots plant the numinous,\nThe world’s wheel turns the Dharma-flower,\nNine images round and bright,\nDharma drums sound in vermilion tones,\nFlowing chimes ring in the cold courtyard,\nEight winds dance upon the carriage,\nCloud nets exhale jasper,\nJasper and jade resound in emptiness,\nJade wisdom echoes through the cavern,\nAugust radiance embraces orchids,\nVermilion blossoms bloom in glory,\nJade elegance soars on celestial branches,\nLayered voids of purple clarity,\nLofty dawns display their canopies,\nWandering within the golden city,\nEight effulgences harmonize as one,\nNine Emperors unite in assembly,\nFlowing fragrance shades the void,\nAromas scatter across the Great Darkness,\nFlying wheels and feathered canopies,\nAscend into formlessness,\nMerge with qi in perfect union,\nEver tranquil in ultimate longevity.*\n\nTwenty-Fifth Nameless Ultimate Cavernous Subtle Brahma Treasure Heaven. [Text missing]",
      "overlap_context": "mmortals urge their chariots,\nGazing across the Four Heavens, they traverse the Three Clarities,\nCarefree and unbounded, loftily illumining the Great Darkness,\nRadiant nets bathe in splendor, the Seven Primes exhale essence.\nCrowned and sashed, the immortal officials refine their vermilion forms in the elixir,\nEver enjoying primal blessings, attaining the ultimate jade longevity of truth.\n\nTwenty-First Supreme Ultimate Boundless Radiance Cavernous Subtle Transformative Responsive Heaven. Yu Xie.",
      "start_char": 10825,
      "end_char": 11210,
      "start_sentence": 311,
      "end_sentence": 327,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.831859588623047,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "天王姓精讳雾云 第二十六微梵玄天炁带扇给道德天 □□ 天王姓洛讳须阿摩 第二十七虚梵炁蝉然识慧天 □□ 天王姓云讳无陁 第二十八空梵中天绩元伊檀天 □□ 天王姓朱讳仲生 四天之音，玄微上元梵天之气，在虚无太清之上。 四天王常以八节、月朔之日，同游虚无太清无崖无极空无之上，诵咏四天之音飞玄之章，其日遣中真八灵仙人周行天下。 有学仙行道，朝礼诸天，诵经念善之人，即奏名天王，刻书玄文，寿同四天之人，九年飞行，上升太清宫。 四天飞玄之章日 檀勒洹沙，玉韵发谣，朱兰内映，景云吐翘，八风扬精，琼音逸辽，翳翳遐构，翼翼太霄，紫凤郁虚，结秀重幽，峨峨云层，四达八交，天老部仙，五帝鉴朝，玉皇回灵，琼舆绿飙，四元策辔，六师匡虬，游观四天，洞映九辽，天真敷陈，我庆同抄，刻简玄图，名书紫标，得与皇上，同保亿炰，日月齐景，长存无雕。 第二十九太极无崖紫虚洞幽梵迦摩夷天 世罗",
      "translated_text": "The Heavenly King surnamed Jing, named Misty Cloud,\nTwenty-Sixth Subtle Brahma Mysterious Heaven Qi-Belt Fan Virtue/Power Heaven. □□\n\nThe Heavenly King surnamed Luo, named Suo Amo,\nTwenty-Seventh Void Brahma Qi Cicada-Like Wisdom Heaven. □□\n\nThe Heavenly King surnamed Yun, named Wutuo,\nTwenty-Eighth Empty Brahma Central Heaven Achievement-Origin Yitana Heaven. □□\n\nThe Heavenly King surnamed Zhu, named Zhongsheng,\nThe sounds of the Four Heavens, the subtle primordial qi of Upper Origin Brahma Heaven, abide above the Void-Ultimate Great Clarity. The Four Heavenly Kings, on the eight solar terms and the first day of each lunar month, together wander above the boundless, limitless, empty void of the Void-Ultimate Great Clarity, chanting the *Flying Mystery Chapter* of the Four Heavenly Sounds. On these days, they dispatch the Eight Numinous Immortals of the Central Perfected to traverse the world. Those who cultivate immortality, practice the Dao, pay homage to the various heavens, recite scriptures, and invoke goodness—these names are memorialized to the Heavenly Kings, their mysterious writings inscribed. Their lifespan aligns with the people of the Four Heavens, and after nine years of flight, they ascend to the Palace of Great Clarity.\n\nThe *Flying Mystery Chapter* of the Four Heavens states:\nDhāraṇī resounds, jade melodies arise in song,\nVermilion orchids gleam within,\nAuspicious clouds unfurl their plumes,\nEight winds stir the essence,\nJasper tones drift afar,\nVast and distant, the structure soars,\nWings of the Great Empyrean spread,\nPurple phoenixes luxuriate in the void,\nKnotting elegance in layered depths,\nTowering cloud-layers stretch,\nFour directions and eight intersections meet,\nHeavenly Elders and host-immortals,\nFive Emperors witness the court,\nThe Jade Sovereign turns his numen,\nJasper chariots ride the green gales,\nFour Origins guide the reins,\nSix Masters steady the dragons,\nRoaming and gazing through the Four Heavens,\nIlluminating the nine distances,\nHeavenly Perfected unfold their array,\nOur joy is shared in unison,\nMysterious charts are inscribed on tablets,\nNames recorded on purple markers,\nTo join the August Above,\nTogether preserving boundless eons,\nSun and moon in equal radiance,\nEternally abiding without decay.\n\nTwenty-Ninth Supreme Ultimate Boundless Purple Void Cavernous Secluded Brahma Kamaya Heaven.\nWorld-Net.",
      "overlap_context": " soars on celestial branches,\nLayered voids of purple clarity,\nLofty dawns display their canopies,\nWandering within the golden city,\nEight effulgences harmonize as one,\nNine Emperors unite in assembly,\nFlowing fragrance shades the void,\nAromas scatter across the Great Darkness,\nFlying wheels and feathered canopies,\nAscend into formlessness,\nMerge with qi in perfect union,\nEver tranquil in ultimate longevity.*\n\nTwenty-Fifth Nameless Ultimate Cavernous Subtle Brahma Treasure Heaven. [Text missing]",
      "start_char": 11210,
      "end_char": 11623,
      "start_sentence": 328,
      "end_sentence": 344,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.193467378616333,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "天王姓玄讳霐 第三十绿梵自然识慧入天 云九 天王姓迦讳释文罗 第三十一玄梵大行无景无所念慧天 宗提 天王姓伊讳檀阿 第三十二天云梵上行维先阿檀天 正群 天王姓伫讳云勋勃 四天之音，清玄元虚宝梵之气，在虚无太清之中。 四天王帝以八节、月朔之日，同游虚无太清无崖无极空无之上，诵咏四天之音飞玄之章，其日遣上真玉司仙王周行天下。 有学仙行道，朝礼诸天，诵经念善，斋诚奉法之人，即奏名天王，刻书玄文，寿同四天之人，九年飞行，上升太清之中。 四天飞玄之章曰 词首来天，云梵玄阿，六气吐精，九象结罗，琼音朗逸，玉唱清歌，虚韵合节，制命灵魔，保元固玄，六妖静和，天老临正，万翘含葩，玉真陶灌，飞皇滂，八素缀林，上景散华，金精洋洋，玉离峨峨，四员启明，皇仙之家，朱阙九重，蹑舄婆娑，三十六音，总归提阿，有知其韵，上升紫霞，寿同天人，万椿不蹉。 第三十三无色玄清洞微波梨答和天 □□",
      "translated_text": "The Heavenly King surnamed Xuan, named Hongpao.\nThe Thirtieth Green Brahma Spontaneous Wisdom-Entering Heaven.\nCloud Nine.\n\nThe Heavenly King surnamed Jia, named Shiwenluo.\nThe Thirty-First Mysterious Brahma Great Conduct No-Form No-Thought Wisdom Heaven.\nZongti.\n\nThe Heavenly King surnamed Yi, named Tan’a.\nThe Thirty-Second Heavenly Cloud Brahma Supreme Conduct Wei Xian Adan Heaven.\nZhengqun.\n\nThe Heavenly King surnamed Zhu, named Yunxunbo.\nThe sounds of the Four Heavens, the qi of pure mystery, primordial void, and precious Brahma, abide within the Great Clarity of Non-Being.\n\nOn the eight solar terms and the first days of the lunar months, the Four Heavenly Kings and Emperors roam together above the boundless, limitless, empty void of the Great Clarity. They recite and chant the sounds of the Four Heavens and the Flying Mystery hymns. On these days, they dispatch the Supreme Perfected, Jade Bureau, and Immortal Kings to traverse the world below.\n\nThose who cultivate immortality, practice the Dao, pay homage to the various heavens, recite scriptures, invoke goodness, observe fasts with sincerity, and uphold the laws—their names are memorialized to the Heavenly Kings. Their names are inscribed in mysterious script, and their lifespans become equal to those of the Four Heavens’ people. After nine years of flying ascent, they ascend into the Great Clarity.\n\nThe hymn of the Four Heavens’ Flying Mystery states:\n\nAt the verse’s beginning, come to Heaven,\nCloud Brahma Mysterious A,\nSix qi exhale essence,\nNine images weave the net,\nJasper tones resound in freedom,\nJade chants sing clear songs,\nVoid rhymes harmonize with rhythm,\nCommanding numinous demons,\nPreserving the origin, securing the mystery,\nSix spirits pacified in harmony,\nHeavenly Elders arrive in rectitude,\nMyriad blossoms hold their buds,\nJade Perfected refine and bathe,\nFlying Sovereigns overflow in splendor,\nEight purities adorn the grove,\nUpper radiance scatters blossoms,\nGolden essence flows abundantly,\nJade towers stand lofty,\nFour Perfect Ones open the dawn,\nThe royal immortals’ abode,\nCrimson gates ninefold,\nTreading the sacred steps in dance,\nThirty-six tones,\nAll return to Ti’a,\nThose who know its rhyme,\nAscend to the purple clouds,\nTheir lifespan equal to Heaven’s people,\nTen thousand kalpas without error.\n\nThe Thirty-Third Formless Mysterious Clarity Cavernous Subtle Hari Dharma Heaven.",
      "overlap_context": "e the reins,\nSix Masters steady the dragons,\nRoaming and gazing through the Four Heavens,\nIlluminating the nine distances,\nHeavenly Perfected unfold their array,\nOur joy is shared in unison,\nMysterious charts are inscribed on tablets,\nNames recorded on purple markers,\nTo join the August Above,\nTogether preserving boundless eons,\nSun and moon in equal radiance,\nEternally abiding without decay.\n\nTwenty-Ninth Supreme Ultimate Boundless Purple Void Cavernous Secluded Brahma Kamaya Heaven.\nWorld-Net.",
      "start_char": 11623,
      "end_char": 12036,
      "start_sentence": 345,
      "end_sentence": 361,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.127744436264038,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "天王姓王讳灵霐 第三十四洞微玄上梵炁阿竭含那天 □□ 天王姓栢讳堕世宗 第三十五玄上绿梵灭然天 □□ 天王姓朱讳陁云弥 第三十六极色上行梵泥维先若那天 □□ 天王姓袁讳员珠 四天之音，极无虚洞无色梵天，在俗虚无太清之下，空洞玄漠之中。 四天王常以八节、月朔之日，游於虚无太清无崖无极空无无色之上，诵咏四天之音飞玄之章，其日遣上真玉司四极仙王周行天下。 有学仙行道，朝礼诸天，诵经念善，斋诚奉教之人，即奏名天王，刻书九天之录，寿同四天之人，九年飞行，上升太清之中。 四天飞玄之章曰 琼霐浩澜，飞芬郁芳，三华曜日，离罗丹房，金治万丈，朱云九重，浮利吐翘，洞灌寒宫，玉仙左回，三首交通，皇上耀灵，玉华匡龙，六辔超虚，逍遥太空，携契八真，合欢天王，流眄紫霄，历运无穷，啸咏琼瑶，琳响逸充，长斋九元，二景同光，上化下变，七十四方，结我六六，与真齐双。 三十六天内名，生於空洞元气之先，文华表见题於昆仑之山，高上音其玉文，上相集其妙篇，禀受太空自然之章，上标玄图，中统六国三十六音，下总九地三十六土皇，灵篇洞畅，玉慧虚鲜，皆天王之游歌，空玄之宝章，六六韵合，四四齐真，九帝分号三十六天，万气总隶，普领群仙，上极无崖无色，下极洞源洞渊，诸为上真飞仙，不禀玉音，则不得游观无崖之天。 有得其文，天王书名，刻字紫札，结录玉晨，三十六年，克得上登无色之天，下洞九地之源。 上妙之道，不传下仙，轻泄宝音，七祖充责，身负刀山，三徒五苦，万劫不原。 洞渊九地三十六铭 第一垒色，润地正音， 土皇姓秦，讳孝景椿。 第一垒色，润地行音， 土皇姓黄，讳昌上文。 第一垒色，润地游音， 土皇姓青，讳玄文基。 第一垒色，润地梵音， 土皇姓蜚，讳忠阵皇。 右一垒之地四色土皇，地载周竟四垂不极不穷无边无际无色之气，去天九十九亿万里。 如是土皇，常以立春之日，乘青龙之车，执九色之麾，从青帝胡老之官，巨鳞之骑九千人，上诣郁单无量天，奏地仙得道上学之人，言名於四天之王。 凡修上法，当以立春之日平旦，入室东向，以青笔书上皇内音白纸上而服之，叩齿九通，仰存四土皇姓讳，悉着青羽之，头建九元通天冠，乘青龙羽车，飞行上升无量天，便咒曰： 青阳告升，土皇鉴晨，总领四司，普典万仙，天老定录，上告开陈，精勤上愿，得道无亲，愿书帝简，刻名玉篇，九垒灭迹，飞景琼轩，寿齐四皇，永保监乾。 毕，东向心拜九过，咽气九通止。 如此则土皇列名九天九地，灭迹九阴，地官营卫，胡老司迎，三十六年，得乘青羽飞舆，上升无量之天。 第二垒刚，色地正音， 土皇姓戊，讳坤文光。 第二垒刚，色地行音， 土皇姓郁，讳黄母生。 第二垒刚色地游音， 土皇姓玄，讳乾德维。 第二垒刚色地梵音， 土皇姓长，讳皇萌。 右二垒之地四色土皇，地载周竟四垂不极不穷无边无际无色之气，去第一垒八十一亿万里。 如是第二垒土皇，常以春分之日，乘黄碧二色之气，十二玄龟执神皇九元之策，从青帝胡老之官，飞行甲骑八千人，上诣上上禅善无量寿天，奏地仙得道上学之人，言名於四天之王。",
      "translated_text": "The Heavenly King surnamed Wang, named Lingyu.\nThe Thirty-Fourth Cavernous Subtle Mysterious Upper Brahma Qi Akṣobhya Containing Heaven.\n\nThe Heavenly King surnamed Bo, named Duoshizong.\nThe Thirty-Fifth Mysterious Upper Green Brahma Extinction Thusness Heaven.\n\nThe Heavenly King surnamed Zhu, named Tuoyunmi.\nThe Thirty-Sixth Utmost Form Upper Conduct Brahma Nirmāṇarati Preceding Thusness Heaven.\n\nThe Heavenly King surnamed Yuan, named Yuanzhu.\nThe Four Heavenly Sounds—Utmost Void Cavernous Formless Brahma Heaven—resides below the Mundane Void and Great Clarity, within the emptiness of the Cavernous Mysterious Desert. The Four Heavenly Kings, on the eight solar terms and the first day of each lunar month, roam above the Void of Great Clarity, the Boundless, the Limitless, the Empty, the Formless. They recite the Four Heavenly Sounds and the Flying Mystery Hymns. On these days, they dispatch the Supreme Perfected Jade Administrators and the Four Pole Immortal Kings to traverse the world. Those who cultivate immortality, practice the Dao, pay homage to the heavens, recite scriptures, uphold goodness, observe fasts with sincerity, and revere the teachings—these names are memorialized to the Heavenly Kings, inscribed in the records of the Nine Heavens. Their lifespan equals that of the Four Heavenly People, and after nine years of flight, they ascend into the Great Clarity.\n\nThe Flying Mystery Hymn of the Four Heavens states:\nJade mist surges vast,\nFlying fragrance lush and dense,\nThree blossoms radiate the sun,\nDeparting the cinnabar chambers of Li and Luo,\nGolden smelting ten thousand fathoms,\nCrimson clouds ninefold,\nFloating jade buds unfurl,\nCavernous streams bathe the cold palace,\nJade immortals turn left,\nThree heads interflow,\nThe August Supreme shines numinous,\nJade blossoms encircle the dragon,\nSix reins transcend the void,\nRoaming the great emptiness,\nHolding covenant with the Eight Perfected,\nJoining in joy with the Heavenly Kings,\nGaze flowing through the purple dawn,\nPassing through kalpas without end,\nWhistling and chanting jade and jasper,\nTheir harmonies overflowing,\nPerpetual fast of the Nine Origins,\nDual luminaries shine as one,\nAbove transforming, below transmuting,\nSeventy-four directions,\nWe bind our six sixes,\nTo pair with the Perfected as one.\n\nThe names of the thirty-six heavens within arise before the primordial qi of the Cavernous Void. Their literary splendor is inscribed upon Kunlun Mountain. The Highest Tones bear their jade script, the Supreme Ministers compile their wondrous chapters. They receive the natural hymns of the Great Emptiness, their titles emblazoned upon the Mysterious Chart. Above, they govern the Six Realms and the thirty-six sounds; below, they oversee the Nine Lands and the thirty-six Earthly Sovereigns. The numinous chapters flow unimpeded, their jade wisdom fresh and void-bright—all are the roaming songs of the Heavenly Kings, the treasured hymns of the Empty Mystery. Six sixes harmonize in rhyme, four fours align in perfection. The Nine Emperors divide the titles of the thirty-six heavens, myriad qi are wholly subordinate, universally leading the host of immortals. Above, they reach the boundless formless; below, they penetrate the cavernous sources and abysses. All who would become Supreme Perfected and Flying Immortals—without receiving the Jade Sounds, they may not roam and observe the boundless heavens. Those who obtain these texts have their names inscribed by the Heavenly Kings on purple tablets, recorded in the Jade Dawn Register. After thirty-six years, they may ascend to the formless heavens above and penetrate the sources of the Nine Lands below.\n\nThe Supreme Mystery Dao is not transmitted to lesser immortals. To recklessly divulge the treasured sounds is to incur the punishment of seven generations, to bear the knife mountain, to endure the three calamities and five sufferings, for ten thousand kalpas without redemption.\n\nThe Cavernous Abyss Nine Lands Thirty-Six Inscriptions:\n\nFirst Rampart of Color, Moist Earth Right Tone,\nEarthly Sovereign surnamed Qin, named Xiaojingchun.\n\nFirst Rampart of Color, Moist Earth Conducting Tone,\nEarthly Sovereign surnamed Huang, named Changshangwen.\n\nFirst Rampart of Color, Moist Earth Roaming Tone,\nEarthly Sovereign surnamed Qing, named Xuanwenji.\n\nFirst Rampart of Color, Moist Earth Brahma Tone,\nEarthly Sovereign surnamed Fei, named Zhongzhenhuang.\n\nThe Four Colored Earthly Sovereigns of this first rampart bear the earth’s load, encompassing its four extremities without bound or limit, its qi without color. It lies ninety-nine billion miles from heaven. These Earthly Sovereigns, on the day of the Beginning of Spring, ride chariots drawn by green dragons, wielding nine-colored banners. From the palace of the Green Emperor Hu Lao, with a retinue of nine thousand riders upon giant scaled mounts, they ascend to the Yudan Immeasurable Heaven to memorialize the names of those earthbound immortals who have attained the Dao and advanced in learning to the Four Heavenly Kings.\n\nAll who cultivate the Supreme Method should, at dawn on the day of the Beginning of Spring, enter their chamber facing east. With a green brush, they write the Inner Sounds of the Supreme August upon white paper and ingest it. They knock their teeth nine times, visualizing the four Earthly Sovereigns’ surnames and names, all clad in green feathered robes, their heads crowned with Nine Origins Penetrating Heaven Hats. They ride green dragon feathered chariots, flying upward to ascend the Immeasurable Heaven, and recite the incantation:\n\nGreen Yang announces ascent,\nEarthly Sovereigns witness the dawn,\nGoverning the Four Offices,\nUniversally overseeing the myriad immortals,\nHeavenly Elders determine the records,\nSupreme memorials are presented,\nDiligent in supreme vows,\nAttaining the Dao without partiality,\nMay the imperial tablets be inscribed,\nNames carved in the Jade Chapters,\nNine ramparts erase traces,\nFlying scenes of jasper chariots,\nLifespan equal to the Four August Ones,\nEternally safeguarding the firmament.\n\nUpon completion, they bow nine times toward the east, swallow qi nine times, and cease. Thus, the Earthly Sovereigns list their names in the Nine Heavens and Nine Lands, erasing their traces from the Nine Yin. The Earthly Offices provide protection, the Hu Lao Ministers welcome them. After thirty-six years, they may ride green feathered flying chariots to ascend the Immeasurable Heaven.\n\nSecond Rampart of Strength, Colored Earth Right Tone,\nEarthly Sovereign surnamed Wu, named Kunwenguang.\n\nSecond Rampart of Strength, Colored Earth Conducting Tone,\nEarthly Sovereign surnamed Yu, named Huangmusheng.\n\nSecond Rampart of Strength, Colored Earth Roaming Tone,\nEarthly Sovereign surnamed Xuan, named Qiandewi.\n\nSecond Rampart of Strength, Colored Earth Brahma Tone,\nEarthly Sovereign surnamed Chang, named Huangmeng.\n\nThe Four Colored Earthly Sovereigns of this second rampart bear the earth’s load, encompassing its four extremities without bound or limit, its qi without color. It lies eighty-one billion miles from the first rampart. These Earthly Sovereigns of the second rampart, on the day of the Spring Equinox, ride upon the dual qi of yellow and azure, twelve dark turtles bearing the Nine Origins Wands of the Divine August. From the palace of the Green Emperor Hu Lao, with a retinue of eight thousand flying armored riders, they ascend to the Supreme Meditation Goodness Immeasurable Longevity Heaven to memorialize the names of those earthbound immortals who have attained the Dao and advanced in learning to the Four Heavenly Kings.",
      "overlap_context": "or,\nEight purities adorn the grove,\nUpper radiance scatters blossoms,\nGolden essence flows abundantly,\nJade towers stand lofty,\nFour Perfect Ones open the dawn,\nThe royal immortals’ abode,\nCrimson gates ninefold,\nTreading the sacred steps in dance,\nThirty-six tones,\nAll return to Ti’a,\nThose who know its rhyme,\nAscend to the purple clouds,\nTheir lifespan equal to Heaven’s people,\nTen thousand kalpas without error.\n\nThe Thirty-Third Formless Mysterious Clarity Cavernous Subtle Hari Dharma Heaven.",
      "start_char": 12036,
      "end_char": 13318,
      "start_sentence": 362,
      "end_sentence": 396,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.90726280212402,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "凡学上法，当以春分之日平旦，入室东向，以青笔书土皇内音黄纸上服之，叩齿九通，仰存四土皇姓讳，悉衣黄锦飞裙，头戴平天之冠，乘黄碧二色云车，十二玄龟九天之策，从青帝胡老之官，飞行甲骑，上升上上禅善无量寿天，便咒曰： 三道行运，季节临元，维落九垒，广御八门，总鉴地仙，上闻帝君，天老定录，土皇记文，上告之日，我道早分，落迹九阴，飞景素云，四气同符，皇人齐群。 毕，东向心拜八过，咽气八通止。 行之三十六年，得乘飞云之车，上升禅善无量寿天。 第三垒石脂色泽地正音， 土皇姓张，讳维神保。 第三垒石脂色泽地行音， 土皇姓周，讳伯上仁。 第三垒石脂色泽地游音， 土皇姓朱，讳明车子。 第三垒石脂色泽地梵音， 土皇姓庚，讳文敬士。 右三垒之地四色土皇，地载周竟四垂不极不穷无边无际无色之气，去第二垒一百一十亿万里。 如是第三垒土皇，常以立夏之日，乘绛霞之云，十二凤皇执五色之节，从越老之官，飞行武骑八千人，上诣须延夭，奏地仙得道上学之人，言名於四天之王。 凡学上法，当以立夏之日食后，入室南向，朱笔书土皇内音白纸上服之，叩齿九通，仰存四土皇姓讳，悉衣绛文飞裙，头巾无极进贤之冠，乘绛霞之云，十二凤皇执五色之节，飞行上升须延之天，便咒曰： 四气总中，八达合朝，吉晨临正，九垒发翘，执录命仙，上升紫霄，列名皇文，补仙上僚，得乘朱景，逍遥飞飙，年齐三光，极天无雕。 毕，南向心拜八过，咽气八通止。 行之三十六年，得乘飞云之车，上升须延之天。 第四垒润泽地正音， 土皇姓贾，讳云子高。 第四垒润泽地行音， 土皇姓谢，讳伯无元。 第四垒润泽地游音， 土皇姓已，讳文秦阵。 第四垒润泽地梵音， 土皇姓行，讳机正方。 右四垒之地四音土皇，地载周竟四垂不极不穷无边无际无色之气，去第三垒地二十亿万里。 如是第四垒土皇，常以夏至之日，乘绛霞云舆，十二朱鸟执命魔之幡，从越老仙官，飞行武骑八千人，上诣寂然天，奏地仙得道上学之人，言名於四天之王。 凡学上法，当以夏至之日正中，入室南向，朱笔书土皇内音黄纸上服之，叩齿九通，仰存四土皇姓讳，悉着黄绿之裙，头戴远游之冠，乘绛霞云舆，十二朱鸟执命魔之幡，飞行上升寂然之天，便咒曰： 天清地澄，九土郁玄，四运御晨，上参紫天，徘徊飞舆，宴景无间，八会交庆，玉虚开陈，皇老列名，天王题篇，九垒削死，司命勒年，身入华晨，永保上仙。 毕，向南心拜八过，咽气八通止。 行之三十六年，得乘绛云舆，上升寂然之天。 第五垒金栗泽地正音， 土皇姓华，讳延期明。 第五垒金粟泽地行音， 土皇姓黄，讳龄我容。 第五垒金粟泽地游音， 土皇姓云，讳探元渊。 第五垒金粟泽地梵音， 土皇姓蒋，讳通八光。 右五垒之地四音土皇，地载周竟四垂不极不穷无边无际无色之气，去第四垒地二十亿万里。 如是第五垒土皇，常以立秋之日，乘素云之舆，十二白虎执命灵九元之章，从氐老仙官，飞天虎骑六千人，上诣不骄乐天，奏地仙得道上学之人，言名於四天之王。 凡学上法，当以立秋之日哺时，入室西向，白笔书青纸上土皇内音服之，叩齿九通，仰存四土皇姓讳，悉着素罗飞裙，头戴九元通明宝冠，乘素云之舆，十二白虎执命灵九元之章，飞行上升不骄乐之天，便咒曰：",
      "translated_text": "Whenever studying the superior method, on the day of the Spring Equinox at dawn, enter the chamber facing east. With a green brush, inscribe the Earthly Sovereign’s inner sound upon yellow paper and ingest it. Strike the teeth nine times, and visualize the four Earthly Sovereigns’ surnames and given names, all clad in yellow brocade flying skirts, heads crowned with Flat-Heaven coronets. They ride upon a cloud chariot of dual qi—yellow and azure—twelve dark turtles bearing the Nine Origins Wands of the Divine August. From the palace of the Green Emperor Hu Lao, with a retinue of eight thousand flying armored riders, they ascend to the Supreme Meditation Goodness Immeasurable Longevity Heaven. Then recite the incantation:\n\n*\"Three Ways traverse the course,\nSeasonal nodes attend the origin.\nNine ramparts sustain,\nEight gates broadly govern.\nEarthbound immortals are universally surveyed,\nTheir names ascend to the Imperial Lord.\nHeavenly Elders fix the records,\nEarthly Sovereigns inscribe the texts.\nOn this day of supplication,\nMy Dao was early apportioned.\nTraces alight upon the Nine Yin,\nSoaring scenes merge with pristine clouds.\nFour qi harmonize as one,\nAugust personages gather in throngs.\"*\n\nUpon completion, bow eight times toward the east, swallowing qi eight times, then cease.\n\nPracticing this for thirty-six years, one attains the ability to ride the flying cloud chariot and ascend to the Meditation Goodness Immeasurable Longevity Heaven.\n\n---\n\nThe third rampart, of stone-fat luster and Earthly Upright Tone,\nEarthly Sovereign surnamed Zhang, named Weishenbao.\n\nThe third rampart, of stone-fat luster and Earthly Conduct Tone,\nEarthly Sovereign surnamed Zhou, named Boshangren.\n\nThe third rampart, of stone-fat luster and Earthly Roaming Tone,\nEarthly Sovereign surnamed Zhu, named Mingchezi.\n\nThe third rampart, of stone-fat luster and Earthly Brahma Tone,\nEarthly Sovereign surnamed Geng, named Wenjingshi.\n\nThe four Earthly Sovereigns of this third rampart bear the earth’s load, encompassing its four extremities without bound or limit, its qi without color. It lies one hundred ten billion miles from the second rampart. These Earthly Sovereigns of the third rampart, on the day of the Summer Commencement, ride upon crimson rosy clouds, twelve phoenixes bearing the Five-Colored Standards. From the palace of the Yue Elder, with a retinue of eight thousand flying armored riders, they ascend to the Xu Yan Heaven to memorialize the names of those earthbound immortals who have attained the Dao and advanced in learning to the Four Heavenly Kings.\n\nWhenever studying the superior method, on the day of the Summer Commencement after the meal, enter the chamber facing south. With a vermilion brush, inscribe the Earthly Sovereign’s inner sound upon white paper and ingest it. Strike the teeth nine times, and visualize the four Earthly Sovereigns’ surnames and given names, all clad in crimson-patterned flying skirts, heads crowned with the Boundless Advancing Worthies coronet. They ride upon crimson rosy clouds, twelve phoenixes bearing the Five-Colored Standards, flying upward to ascend to the Xu Yan Heaven. Then recite the incantation:\n\n*\"Four qi converge at the center,\nEight directions assemble in court.\nAuspicious dawn attends the rectitude,\nNine ramparts unfurl their splendor.\nGrasping the records, life’s immortals\nAscend to the Purple Empyrean.\nNames arrayed in the August Texts,\nPromoted to celestial offices.\nAttaining the vermilion radiance,\nCarefree they ride the soaring gales.\nYears equaling the Three Luminaries,\nUtmost heaven knows no decay.\"*\n\nUpon completion, bow eight times toward the south, swallowing qi eight times, then cease.\n\nPracticing this for thirty-six years, one attains the ability to ride the flying cloud chariot and ascend to the Xu Yan Heaven.\n\n---\n\nThe fourth rampart, of lustrous Earthly Upright Tone,\nEarthly Sovereign surnamed Jia, named Yunzigao.\n\nThe fourth rampart, of lustrous Earthly Conduct Tone,\nEarthly Sovereign surnamed Xie, named Bowuyuan.\n\nThe fourth rampart, of lustrous Earthly Roaming Tone,\nEarthly Sovereign surnamed Ji, named Wenqinchen.\n\nThe fourth rampart, of lustrous Earthly Brahma Tone,\nEarthly Sovereign surnamed Xing, named Jizhengfang.\n\nThe four Earthly Sovereigns of this fourth rampart bear the earth’s load, encompassing its four extremities without bound or limit, its qi without color. It lies twenty billion miles from the third rampart. These Earthly Sovereigns of the fourth rampart, on the day of the Summer Solstice, ride upon a crimson rosy cloud chariot, twelve vermilion birds bearing the Banner of Life’s Demons. From the palace of the Yue Elder Immortal, with a retinue of eight thousand flying armored riders, they ascend to the Tranquil Heaven to memorialize the names of those earthbound immortals who have attained the Dao and advanced in learning to the Four Heavenly Kings.\n\nWhenever studying the superior method, on the day of the Summer Solstice at noon, enter the chamber facing south. With a vermilion brush, inscribe the Earthly Sovereign’s inner sound upon yellow paper and ingest it. Strike the teeth nine times, and visualize the four Earthly Sovereigns’ surnames and given names, all clad in yellow-green skirts, heads crowned with the Far-Roaming coronet. They ride upon a crimson rosy cloud chariot, twelve vermilion birds bearing the Banner of Life’s Demons, flying upward to ascend to the Tranquil Heaven. Then recite the incantation:\n\n*\"Heaven clarifies, earth settles,\nNine soils luxuriate in mystery.\nFour movements govern the dawn,\nAscending to partake of the Purple Heaven.\nWandering the flying chariot,\nFeasting upon scenes without interval.\nEight assemblies exchange felicitations,\nJade Void unfolds its array.\nAugust Elders list the names,\nHeavenly Kings inscribe the scrolls.\nNine ramparts excise death,\nLife’s Mandate engraves the years.\nThe body enters the Flowery Dawn,\nEternally preserving the superior immortals.\"*\n\nUpon completion, bow eight times toward the south, swallowing qi eight times, then cease.\n\nPracticing this for thirty-six years, one attains the ability to ride the crimson cloud chariot and ascend to the Tranquil Heaven.\n\n---\n\nThe fifth rampart, of golden millet luster and Earthly Upright Tone,\nEarthly Sovereign surnamed Hua, named Yanqiming.\n\nThe fifth rampart, of golden millet luster and Earthly Conduct Tone,\nEarthly Sovereign surnamed Huang, named Lingworong.\n\nThe fifth rampart, of golden millet luster and Earthly Roaming Tone,\nEarthly Sovereign surnamed Yun, named Tanyuanyuan.\n\nThe fifth rampart, of golden millet luster and Earthly Brahma Tone,\nEarthly Sovereign surnamed Jiang, named Tongbaguang.\n\nThe four Earthly Sovereigns of this fifth rampart bear the earth’s load, encompassing its four extremities without bound or limit, its qi without color. It lies twenty billion miles from the fourth rampart. These Earthly Sovereigns of the fifth rampart, on the day of the Autumn Commencement, ride upon a plain cloud chariot, twelve white tigers bearing the Nine Origins Writs of Life’s Numinous Power. From the palace of the Di Elder Immortal, with a retinue of six thousand flying tiger riders, they ascend to the Unhaughty Joy Heaven to memorialize the names of those earthbound immortals who have attained the Dao and advanced in learning to the Four Heavenly Kings.\n\nWhenever studying the superior method, on the day of the Autumn Commencement at the evening meal hour, enter the chamber facing west. With a white brush, inscribe the Earthly Sovereign’s inner sound upon green paper and ingest it. Strike the teeth nine times, and visualize the four Earthly Sovereigns’ surnames and given names, all clad in plain silk flying skirts, heads crowned with the Nine Origins Luminous Treasure coronet. They ride upon a plain cloud chariot, twelve white tigers bearing the Nine Origins Writs of Life’s Numinous Power, flying upward to ascend to the Unhaughty Joy Heaven. Then recite the incantation:",
      "overlap_context": "thly Sovereigns of the second rampart, on the day of the Spring Equinox, ride upon the dual qi of yellow and azure, twelve dark turtles bearing the Nine Origins Wands of the Divine August. From the palace of the Green Emperor Hu Lao, with a retinue of eight thousand flying armored riders, they ascend to the Supreme Meditation Goodness Immeasurable Longevity Heaven to memorialize the names of those earthbound immortals who have attained the Dao and advanced in learning to the Four Heavenly Kings.",
      "start_char": 13319,
      "end_char": 14653,
      "start_sentence": 397,
      "end_sentence": 427,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.705068826675415,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "皓华映晖，白阙九重，四运梵维，吉晨告皇，元景理命，记录天王，列书帝简，上奏青宫，九阴灭尸，腾身华房，永保上仙，三晨齐光。 毕，向西心拜六过，咽气六通止。 行之三十六年，得乘素云琼舆，上升不骄乐之天。 第六垒金刚泽地正音， 土皇姓李，讳上少君。 第六垒金刚泽地行音， 土皇姓范，讳来力安。 第六垒金刚泽地游音， 土皇姓长，讳李季元。 第大垒金刚泽地梵音， 土皇姓王，讳驷女容。 右六垒之地四音土皇，地载周竟四垂不极不穷无边无际无色之气，去第五垒地二十亿万里。 如是第六垒土皇，常以秋分之日，乘素云飞舆，十二白虎执九色制神之麾，从氐老仙官，飞天虎骑六千人，上诣化应声天，奏地仙得道上学之人，言名於四天之王。 凡学上法，当以秋分之日哺时，入室西向，白笔书青纸上土皇内音服之，叩齿九通，仰存四土皇姓讳，悉着素锦飞裙，头戴无极进贤之冠，乘素云之舆，十二白虎执九色制神之麾，飞行上升化应声天，便咒曰： 白土九垒，气通太微，皇老临晨，腾景徘徊，朱兰映陈，八华扬晖，升入帝庭，上披琼扉，五愿玄会，降致羽衣，八景齐真，形得升飞，命同天地，永保二仪。 毕，西向心拜六过，咽六气止。 行之三十六年，得乘素云琼舆，上升化应声天。 第七垒水制泽地正音， 土皇姓唐，讳初生映。 第七垒水制泽地行音， 土皇姓吴，讳正法图。 第七垒水制泽地游音， 土皇姓汉，讳高文彻。 第七垒水制泽地梵音， 土皇姓京，讳仲龙首。 右七垒之地四音土皇，地载周竟四垂不极不穷无边无际无色之气，去第六垒二十亿万里。 如是第七垒土皇，常以立冬之日，乘玄云飞舆，二十四玄武执五色命灵之幡，从羌老仙官，腾天之骑五千人，诣梵宝天，奏地仙得道上学之人，言名於四天之王。 凡学上法，当以立冬之日子时，入室北向，墨书土皇内音白纸上服之，叩齿九通，仰存四土皇姓讳，悉着玄灵锦文飞裙，头戴无极进贤之冠，乘玄云飞舆，二十四玄武执五色命灵之幡，飞行上升梵宝天，便咒曰： 五气交带，八神回庭，三元临正，土皇命灵，云舆羽盖，上升高清，大愿开陈，我纳无形，九垒灭迹，天真刻名，结编玄图； 受号华青，得乘飞景，化入帝庭。 毕，心拜五过，咽五通止。 行之三十六年，得乘玄云之舆，上升梵宝之天。 第八垒大风泽地正音， 土皇姓葛，讳玄升先。 第八垒大风泽地行音， 土皇姓华，讳茂云长。 第八垒大风泽地游音， 土皇姓羊，讳真洞玄。 第八垒大风泽地梵音， 土皇姓周，讳尚敬原。 右八垒之地四音土皇，地载周竟四垂不极不穷无边无际无色之气，去第七垒八十亿万里。 如是第八垒土皇，常以冬至之日，乘玄云飞舆，五色飞麟执九色之节，从羌老仙官，腾天之骑五千人，上诣梵迦摩夷天，奏地仙得道上学之人，言名於四天之王。 凡学上法，当以冬至日子时，入室北向，墨书白纸上土皇内音服之，叩齿九通，仰存四土皇姓讳，悉着玄云锦裙，头戴通天宝冠，乘玄云羽舆，五色飞麟执九色之节，飞行上升梵迦摩夷天，便咒曰： 天敷地陈，九象法玄，四度升降，八气明新，土皇简箓，玉帝定真，名题图札，我获上仙，飞行太虚，纵景自然，与灵同符，与气长存，三变九化，升入帝晨。",
      "translated_text": "Resplendent radiance illumines the brilliance, the ninefold white gates of the celestial palace. The four seasons turn through the Brahma-boundaries; at the auspicious dawn, the Sovereign is addressed. The primal effulgence governs destiny, recording the names before the Heavenly Kings. Inscribed upon the Emperor’s tablets, they ascend to memorialize in the Azure Palace. The nine yin extinguish the corpse, and the body soars to the Flower Chamber, eternally preserving the status of superior immortals, where the Three Dawns shine as one.\n\nUpon completion, face west and bow six times from the heart, swallowing qi six times before ceasing. Practicing this for thirty-six years, one attains the jade chariot of plain clouds, ascending to the Unhaughty Joy Heaven.\n\nThe **Sixth Rampart’s** Vajra Marsh Earth **Upright Tone**:\nEarth Sovereign surnamed Li, given name Shang Shaojun.\n\nThe **Sixth Rampart’s** Vajra Marsh Earth **Acting Tone**:\nEarth Sovereign surnamed Fan, given name Lai Lian.\n\nThe **Sixth Rampart’s** Vajra Marsh Earth **Roaming Tone**:\nEarth Sovereign surnamed Chang, given name Li Jiyuan.\n\nThe **Great Rampart’s** Vajra Marsh Earth **Brahma Tone**:\nEarth Sovereign surnamed Wang, given name Si Nürong.\n\nThe four Earth Sovereigns of the six ramparts’ tones govern the earth, which extends boundlessly in all four directions—inexhaustible, infinite, formless qi—twenty billion miles beyond the Fifth Rampart.\n\nThus, the Earth Sovereigns of the Sixth Rampart, on the day of the Autumn Equinox, ride a plain cloud flying chariot, twelve white tigers bearing the nine-colored banners of spirit command, accompanied by the *Dilao* immortal officials and six thousand celestial tiger riders, ascending to the Responsive Transformation Heaven to memorialize the names of those earthbound immortals who have attained the Dao and advanced in learning to the Four Heavenly Kings.\n\nWhenever studying the superior method, on the day of the Autumn Equinox at the evening meal hour, enter the chamber facing west. With a white brush, inscribe the Earthly Sovereign’s inner sound upon green paper and ingest it. Strike the teeth nine times, and visualize the four Earthly Sovereigns’ surnames and given names, all clad in plain silk flying skirts, heads crowned with the Boundless Advancing Worthies coronet. They ride upon a plain cloud chariot, twelve white tigers bearing the nine-colored banners of spirit command, flying upward to ascend to the Responsive Transformation Heaven. Then recite the incantation:\n\nWhite Earth’s nine ramparts,\nqi connects to the Grand Tenuity.\nThe August Elders attend the dawn,\nsoaring effulgences linger.\nVermilion orchids gleam in array,\nthe Eight Flowers radiate brilliance.\nAscending into the Emperor’s court,\none parts the jade portals.\nThe Five Vows meet in mystery,\ndescending to bestow feathered robes.\nThe Eight Effulgences unite in perfection,\nthe form attains ascending flight.\nDestiny aligns with Heaven and Earth,\neternally preserving the Two Modes.\n\nUpon completion, face west and bow six times from the heart, swallowing qi six times before ceasing. Practicing this for thirty-six years, one attains the jade chariot of plain clouds, ascending to the Responsive Transformation Heaven.\n\nThe **Seventh Rampart’s** Water-Restraining Marsh Earth **Upright Tone**:\nEarth Sovereign surnamed Tang, given name Chusheng Ying.\n\nThe **Seventh Rampart’s** Water-Restraining Marsh Earth **Acting Tone**:\nEarth Sovereign surnamed Wu, given name Zheng Fatu.\n\nThe **Seventh Rampart’s** Water-Restraining Marsh Earth **Roaming Tone**:\nEarth Sovereign surnamed Han, given name Gaowen Che.\n\nThe **Seventh Rampart’s** Water-Restraining Marsh Earth **Brahma Tone**:\nEarth Sovereign surnamed Jing, given name Zhong Longshou.\n\nThe four Earth Sovereigns of the seven ramparts’ tones govern the earth, which extends boundlessly in all four directions—inexhaustible, infinite, formless qi—twenty billion miles beyond the Sixth Rampart.\n\nThus, the Earth Sovereigns of the Seventh Rampart, on the day of Winter Commencement, ride a dark cloud flying chariot, twenty-four black tortoises bearing the five-colored banners of life’s numinous power, accompanied by the *Qianglao* immortal officials and five thousand celestial riders, ascending to the Brahma Treasure Heaven to memorialize the names of those earthbound immortals who have attained the Dao and advanced in learning to the Four Heavenly Kings.\n\nWhenever studying the superior method, on the day of Winter Commencement at the midnight hour, enter the chamber facing north. With black ink, inscribe the Earthly Sovereign’s inner sound upon white paper and ingest it. Strike the teeth nine times, and visualize the four Earthly Sovereigns’ surnames and given names, all clad in dark spirit-brocade flying skirts, heads crowned with the Boundless Advancing Worthies coronet. They ride upon a dark cloud flying chariot, twenty-four black tortoises bearing the five-colored banners of life’s numinous power, flying upward to ascend to the Brahma Treasure Heaven. Then recite the incantation:\n\nThe Five Qi intertwine as sashes,\nthe Eight Spirits return to the court.\nThe Three Origins attend in rectitude,\nthe Earth Sovereign commands the numinous.\nCloud chariots and feathered canopies\nascend to the lofty clarity.\nThe Great Vow unfolds in array,\nI receive the formless.\nThe nine ramparts erase traces,\nthe celestial perfected inscribe names.\nBound in the mysterious chart,\nreceiving the title of Flowery Azure,\none attains the flying effulgence,\ntransforming to enter the Emperor’s court.\n\nUpon completion, bow five times from the heart, swallowing qi five times before ceasing. Practicing this for thirty-six years, one attains the chariot of dark clouds, ascending to the Brahma Treasure Heaven.\n\nThe **Eighth Rampart’s** Great Wind Marsh Earth **Upright Tone**:\nEarth Sovereign surnamed Ge, given name Xuan Shengxian.\n\nThe **Eighth Rampart’s** Great Wind Marsh Earth **Acting Tone**:\nEarth Sovereign surnamed Hua, given name Maoyun Chang.\n\nThe **Eighth Rampart’s** Great Wind Marsh Earth **Roaming Tone**:\nEarth Sovereign surnamed Yang, given name Zhen Dongxuan.\n\nThe **Eighth Rampart’s** Great Wind Marsh Earth **Brahma Tone**:\nEarth Sovereign surnamed Zhou, given name Shang Jingyuan.\n\nThe four Earth Sovereigns of the eight ramparts’ tones govern the earth, which extends boundlessly in all four directions—inexhaustible, infinite, formless qi—eighty billion miles beyond the Seventh Rampart.\n\nThus, the Earth Sovereigns of the Eighth Rampart, on the day of the Winter Solstice, ride a dark cloud flying chariot, five-colored flying unicorns bearing the nine-colored tablets, accompanied by the *Qianglao* immortal officials and five thousand celestial riders, ascending to the Brahma *Kāmadhātu* Heaven to memorialize the names of those earthbound immortals who have attained the Dao and advanced in learning to the Four Heavenly Kings.\n\nWhenever studying the superior method, on the day of the Winter Solstice at the midnight hour, enter the chamber facing north. With black ink, inscribe the Earthly Sovereign’s inner sound upon white paper and ingest it. Strike the teeth nine times, and visualize the four Earthly Sovereigns’ surnames and given names, all clad in dark cloud brocade skirts, heads crowned with the Heaven-Penetrating Treasure Coronet. They ride upon a dark cloud feathered chariot, five-colored flying unicorns bearing the nine-colored tablets, flying upward to ascend to the Brahma *Kāmadhātu* Heaven. Then recite the incantation:\n\nHeaven unfolds, Earth arrays,\nthe Nine Images emulate the mysterious.\nThe Four Measures ascend and descend,\nthe Eight Qi renew in clarity.\nThe Earth Sovereign’s register is inscribed,\nthe Jade Emperor confirms the perfected.\nNames are inscribed upon the celestial chart,\nI attain the status of superior immortal.\nFlying through the Great Void,\nsoaring effulgences move naturally.\nIn harmony with the numinous,\nin unity with qi, eternally abiding.\nThree transformations, nine transmutations,\nascending into the Emperor’s dawn.",
      "overlap_context": "g west. With a white brush, inscribe the Earthly Sovereign’s inner sound upon green paper and ingest it. Strike the teeth nine times, and visualize the four Earthly Sovereigns’ surnames and given names, all clad in plain silk flying skirts, heads crowned with the Nine Origins Luminous Treasure coronet. They ride upon a plain cloud chariot, twelve white tigers bearing the Nine Origins Writs of Life’s Numinous Power, flying upward to ascend to the Unhaughty Joy Heaven. Then recite the incantation:",
      "start_char": 14653,
      "end_char": 15953,
      "start_sentence": 428,
      "end_sentence": 459,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.300830602645874,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "毕，心拜四过，仰咽气四通止。 行之三十六年，得乘玄云之舆，飞升梵迦摩夷之天。 第九垒洞渊无色刚维地气正音， 土皇姓极，讳无上玄。 第九垒洞渊无色刚维地气行音， 土皇姓升，讳虚元浩。 第九垒洞渊无色刚维地气游音， 土皇姓赵，讳上伯玄。 第九垒洞渊无色刚维地气梵音， 土皇姓农，讳勒元伯。 右九垒之地极下洞渊洞源，刚维天地，制使不落，上则去第一垒五百二十亿万里，下则无穷无境无边无际，皆刚维之气。 如是第九垒土皇，常以三月一日、六月二日、九月三日、十二月四日，一年四过，乘五色云舆，九色飞龙执中元命神之章，从伧老仙官，耀天羽骑万二千人，上诣波梨答和天，奏九地学道得仙人名，言於四天之王。 凡学上法，当以其日入室，向太岁，黄书白纸上四土皇内音服之，叩齿十二通，仰存四土皇姓讳，悉着玄黄五色之衣，头戴九元通天宝冠，足着五色狮子交文之履，执文身保命之符，乘黄霞飞舆，从五帝玉女三十六人，飞行上升波梨答和天，便咒曰： 二象回周，九精洞灵，皇老应符，腾虚入清，四通八达，飞霞紫琼，上登金华，奉对帝灵，记仙元录，青宫刻名，得道白简，封字七灵，九垒灭尸，东井炼形，三元降真，我道已明，得乘飞景，上登玉庭。 毕，心礼九拜，咽气十二通止。 行之三十六年，得乘黄霞飞軿，上升波梨答和之天。 九地九垒直下九重，合三十六音三十六土皇，上应三十六天，中应三十六国。 如是土皇，皆位齐玉皇之号，但分气各治，上下之别名耳。 土皇三十六年转号，升上清之宫，袭三十六天之王。 玉司之官於九垒之下，皆举学道得仙之名，上奏九天天王。 为学不知九垒地音三十六土皇内讳，九地不灭兆迹，九天丞相不受兆名、五岳不降云舆，五帝不卫兆身，徒明外国之音，故不得匡虚而升也。 故天地人各禀三三之气，三合成真，然后得仙也。 凡知九地之音三十六土皇内讳，则九气丈人常以四方五色灵官防卫兆身，出入游行，登涉五岳，则仙官侍送，灭魔威试，降致神真，九年飞空，坐在立亡，三十年上升太清。 居世得有此文，七玄之祖则为九气命灵土皇司官，奉卫形骸，抚慰灵魂，蒿里父老土丞相缘，皆为驱除，无复拘闭责役之患，居则在地保安无凶，十二守将营扞八门，通真致神，欲富则富，欲宦则宦，欲仙则仙，欲神则神。 此道秘妙，非可言宣，上相青童，禀受高上口诀宝篇，妄泄灵文，七祖充役，万劫不原。 欲登山住止，及安居宅，审地吉凶，当以戊己之日，黄书九地三十六音文白纸上，置所住中央，以盆覆之，三宿开看，若有黄色润纸，大吉； 若有青色，则下有死灵之尸； 若有白色者，为凶；",
      "translated_text": "Upon completion, bow four times in the heart and swallow qi four times to conclude. Practicing this for thirty-six years, one attains the dark cloud chariot and ascends to the *Kāmadhātu* Heaven of Brahma. The ninth stratum of the Abyssal Cavern, the Formless Rigid Axis of Earth Qi’s true tone—\nthe Earth Sovereign’s surname is *Ji*, personal name *Wu Shang Xuan*.\nThe ninth stratum of the Abyssal Cavern, the Formless Rigid Axis of Earth Qi’s moving tone—\nthe Earth Sovereign’s surname is *Sheng*, personal name *Xu Yuan Hao*.\nThe ninth stratum of the Abyssal Cavern, the Formless Rigid Axis of Earth Qi’s roaming tone—\nthe Earth Sovereign’s surname is *Zhao*, personal name *Shang Bo Xuan*.\nThe ninth stratum of the Abyssal Cavern, the Formless Rigid Axis of Earth Qi’s Brahma tone—\nthe Earth Sovereign’s surname is *Nong*, personal name *Le Yuan Bo*.\n\nTo the right: the nine strata of the earth’s ultimate depths, the Abyssal Cavern’s source, the Rigid Axis of Heaven and Earth, governs so that one does not fall. Above, it is five hundred twenty billion *li* from the first stratum; below, it is boundless, without end or border, all pervaded by the qi of the Rigid Axis. The Earth Sovereigns of the ninth stratum, on the first day of the third month, the second day of the sixth month, the third day of the ninth month, and the fourth day of the twelfth month—four times a year—ride a five-colored cloud chariot, nine-colored flying dragons bearing the writ of the Central Origin’s life-spirit, accompanied by the Elder Immortal Officials, a radiant heavenly host of twelve thousand feathered riders, ascending to the *Pāriyātraka* Heaven to report the names of those who have attained immortality through the nine earths’ Dao. For those studying the superior method, on these days enter the chamber, face the Grand Year Star, inscribe in yellow on white paper the inner tones of the four Earth Sovereigns and wear them, strike the teeth twelve times, and visualize the surnames and personal names of the four Earth Sovereigns, all clad in dark and yellow five-colored robes, heads crowned with the Nine Origins Heaven-Penetrating Treasure Coronet, feet shod in five-colored slippers woven with lion patterns, bearing the life-preserving talisman of the tattooed body, riding a yellow auroral flying chariot, accompanied by thirty-six Jade Maidens of the Five Thearchs, flying upward to ascend to the *Pāriyātraka* Heaven. Then recite the incantation:\n\nThe Two Images revolve in cycles,\nthe Nine Essences penetrate the numinous.\nThe Elder Thearchs respond to the tally,\nsoaring through the void to enter clarity.\nFourfold connections, eightfold thoroughfares,\nflying auroras and purple jades.\nAscending to the Golden Flower,\npaying homage before the Emperor’s numen.\nInscribed in the immortal register,\nnames carved in the Azure Palace.\nAttaining the Dao’s white writ,\nsealed with the seven numina.\nThe nine strata extinguish the corpse,\nthe Eastern Well refines the form.\nThe Three Origins descend the perfected,\nmy Dao is now luminous.\nI attain the flying effulgence,\nascending to the Jade Court.\n\nUpon completion, bow nine times in the heart and swallow qi twelve times to conclude. Practicing this for thirty-six years, one attains the yellow auroral flying chariot and ascends to the *Pāriyātraka* Heaven. The nine earths and nine strata descend ninefold, corresponding to thirty-six tones and thirty-six Earth Sovereigns, aligning above with the thirty-six heavens and at the center with the thirty-six states. These Earth Sovereigns all hold ranks equal to the Jade Emperor’s title, differing only in the division of qi they govern and the distinctions of their names above and below. Every thirty-six years, the Earth Sovereigns transform their titles, ascending to the Upper Clarity Palace to inherit the rulership of the thirty-six heavens. The officials of the Jade Bureau, beneath the nine strata, all report the names of those who have attained immortality through the Dao to the Nine Heavens’ Heavenly Kings. Those who study without knowing the inner names of the nine strata’ earth tones and thirty-six Earth Sovereigns will not have their traces extinguished in the nine earths; the Nine Heavens’ Chancellor will not accept their names, the Five Marchmounts will not descend cloud chariots, the Five Thearchs will not protect their bodies, and though they may master foreign tones, they will not ascend through the empty void.\n\nThus, Heaven, Earth, and Human each receive the qi of the three threes, and only when the three unite as the perfected can one attain immortality. Those who know the inner names of the nine earths’ tones and thirty-six Earth Sovereigns will have the Nine Qi Elder constantly guarded by four directions’ five-colored numinous officials, protecting their bodies in all movements, ascending and traversing the Five Marchmounts. Immortal officials will attend and escort them, dispelling demonic trials, summoning divine perfected beings, flying through the void in nine years, sitting in disappearance and standing in vanishing. In thirty years, they will ascend to the Great Clarity. Those who possess this text in the world will have the Seven Mysteries’ Ancestor serve as the Nine Qi Life-Spirit Earth Sovereign’s official, safeguarding their forms, comforting their souls, and driving away the *Hao Li* elders and Earth Chancellor’s karmic entanglements, freeing them from confinement, punishment, and servitude. Dwelling in the world, they will be secure and free from misfortune; the twelve guardian generals will encamp and defend the eight gates, connecting with the perfected and summoning the divine. They may become wealthy if they wish, attain office if they wish, become immortals if they wish, or become divine if they wish.\n\nThis Dao is secret and wondrous, not to be idly spoken of. The Highest Oral Instructions and Precious Scrolls of the Upper Minister Azure Lad are transmitted only to those who receive them. Recklessly divulging the numinous text will condemn one’s seven ancestors to servitude, irredeemable for ten thousand kalpas. When ascending mountains to dwell or settling in a residence, to discern the land’s auspiciousness or inauspiciousness, on a *wu* or *ji* day, inscribe in yellow the thirty-six earth tones of the nine strata on white paper and place it at the center of the dwelling, covering it with a basin. After three nights, uncover and examine it: if the paper is moist and yellow, it is greatly auspicious; if it is green, there are dead spirits’ corpses below; if it is white, it is inauspicious.",
      "overlap_context": "ays,\nthe Nine Images emulate the mysterious.\nThe Four Measures ascend and descend,\nthe Eight Qi renew in clarity.\nThe Earth Sovereign’s register is inscribed,\nthe Jade Emperor confirms the perfected.\nNames are inscribed upon the celestial chart,\nI attain the status of superior immortal.\nFlying through the Great Void,\nsoaring effulgences move naturally.\nIn harmony with the numinous,\nin unity with qi, eternally abiding.\nThree transformations, nine transmutations,\nascending into the Emperor’s dawn.",
      "start_char": 15953,
      "end_char": 16991,
      "start_sentence": 460,
      "end_sentence": 483,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.41015672683716,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 21,
      "original_text": "若有赤色者，惊恐； 若有黑色者，则财宝； 若有紫色者，得神仙。 都不异则止，可三年安，过此必折伤也。 高上外国六品正音 东方呵罗提之国： 第一品铭 ，正音无夷。 第二品铭 ，正音波泥。 第三品铭 ，正音久难。 第四品铭 ，正音吉维。 第五品铭 ，正音无思。 第六品铭 ，正音云芝。 东方去中国九十万里外，名为呵罗提之国，一名星国。 国外有扶桑，在碧海之中，地方万里，上有太帝宫，太真王之别治。 有上生林如桑，皆长数千丈，大者三千围，两两同根而生，有实赤如椹，仙人所啖食，体作金光色，其实皆九千岁一生。 又有生洲，在扶桑外，西接蓬莱，地面方二千五百里，去岸二十三万里，上有仙家数万人。 地无寒暑，时节温和，多生神仙芝草，食之飞空而行。 扶桑东又有祖洲，在东海之中，地方五百里，去岸七万里，上有不死之草，形似菰苗，长三四尺，一名养神芝，其叶似菰，生不丛株，一株食之，飞行上清，已死之人，覆之则生，神奇妙药。 入其国，宜知其名，存胡老仙官，采之於祖洲，思其色而服之，三年面有流光，延寿万年，久久自然有仙人责此神物，降送於身也。 南方伊沙陁之国： 第一品铭 ，正音盈华。 第二品铭 ，正音王家。 第三品铭 ，正音握魔。 第四品铭 ，正音耀葩。 第五品铭 ，正音武都。 第六品铭 ，正音飞蒲。 南方去中国八万一千里外，名阎浮梨之外极，洞阳之野，国名伊沙陁之国，一名火庭天竺之国。 国外有长洲，一名青丘，南海辰己，地方五千里，去岸二十五万里。 则生大树，长三千丈，大二千围，甚多灵药，甘液玉英，无所不有。 其上有民人，皆寿三百六十岁。 又灵狐之兽，大者如犬，色有五色，叫声响四千里，威制虎豹万禽，得衣其毛，寿同天地。 左则有风山，山常震声，上有紫府宫，天真神仙玉女所游观。 又有炎洲，在南海中央，地方二千里，去岸九万里，上有风生兽，似豹，青色，大如狸，积火连天，烧之经月不死，毛亦不燃，斫刺不入，以椎交锻其头，数千下乃死，张口向风，须臾复活，以石上菖蒲塞其鼻，即死，取其脑和菊华服之，寿固天地。 又有火林山，山中有火光兽，大如鼠，毛长三四寸，或赤或白，於是夜半望山上林木及此兽，光照如燃火，取其兽毛作布，名之火浣布，若小污，以火烧之即鲜。 曰财伊沙陁国人所衣，得此毛，仙人降形。 学者存国之音，思越老仙官三十六年，神人当以此兽及国神奇之物，献送於兆也。 西方尼维罗绿那之国： 第一品铭 ，正音华连。 第二品铭 ，音日高轩。 第三品铭 ，音日明身。 第四品铭 ，音日土缠。 第五品铭 ，音日星震。 第六品铭 ，音日朱天。 西方去中国六万里外，名俱邪尼之外极，皓素之垄寒冗之野，则尼维罗绿那之国，一名云胡月支国，国人寿六百岁。 国外则有流洲，在西海之南，地方三千里，去东岸十九万里，其上则有仙家数万。 上有山，生昆吾之石，治石成铁作剑，光明照洞如水精，割玉如土。 凤麟洲在海中央，地方一千五百里，四面有弱水，鸿毛所不浮，上有仙家数千，有凤麟为群。 上有吉光之兽，如狸，能作故语，声如梵音，与其国人通言，毛生光奕奕，悉仙人所衣。",
      "translated_text": "If the color appears red, there will be fright and terror; if black, there will be treasures; if purple, one will attain immortality as a divine transcendent. If none of these colors differ, then cease further inquiry—one may dwell in peace for three years, but beyond this, misfortune and harm will surely follow.\n\n**The Six True Tones of the Highest Outer Realms**\n\n**The Land of Heluoti in the East:**\nFirst Inscription: The true tone is *Wu Yi*.\nSecond Inscription: The true tone is *Boni*.\nThird Inscription: The true tone is *Jiu Nan*.\nFourth Inscription: The true tone is *Ji Wei*.\nFifth Inscription: The true tone is *Wu Si*.\nSixth Inscription: The true tone is *Yun Zhi*.\n\nBeyond nine hundred thousand *li* east of the Middle Kingdom lies the Land of Heluoti, also called the Star Realm. Beyond its borders stands Fusang, amid the Azure Sea, spanning ten thousand *li*. Atop it stands the Palace of the Supreme Emperor, a secondary abode of the Perfected True King. There grows an upper-born forest resembling mulberry trees, each towering thousands of *zhang*, the largest three thousand *wei* in girth. They grow in pairs from the same root, bearing crimson fruit like mulberries, which immortals consume. Their bodies take on a golden radiance, and their fruit ripens but once every nine thousand years.\n\nFurther out lies Shengzhou, beyond Fusang, bordering Penglai to the west. Its land spans two thousand five hundred *li*, twenty-three thousand *li* from shore, and is home to tens of thousands of immortals. The land knows no cold or heat, its climate ever temperate, and abounds with divine transcendent herbs. Those who consume them may soar through the air.\n\nEast of Fusang lies Zuzhou, amid the Eastern Sea, spanning five hundred *li*, seven thousand *li* from shore. Upon it grows the herb of immortality, resembling wild rice shoots, three to four *chi* in length, also called the *Yangshen Zhi* (Nurturing-Spirit Mushroom). Its leaves resemble those of wild rice, growing not in clusters but singly. One who consumes a single stalk may ascend to the Upper Clarity in flight. Even the dead may be revived if covered with it—truly a wondrous and divine medicine. Those who enter this land must know its name. By meditating upon the immortal official Hu Lao and gathering the herb from Zuzhou, visualizing its color and ingesting it, after three years one’s face will radiate flowing light, and life will extend for ten thousand years. Over time, immortals will naturally bestow this divine substance, delivering it to the practitioner.\n\n**The Land of Yishatuo in the South:**\nFirst Inscription: The true tone is *Ying Hua*.\nSecond Inscription: The true tone is *Wang Jia*.\nThird Inscription: The true tone is *Wo Mo*.\nFourth Inscription: The true tone is *Yao Pa*.\nFifth Inscription: The true tone is *Wu Du*.\nSixth Inscription: The true tone is *Fei Pu*.\n\nBeyond eighty-one thousand *li* south of the Middle Kingdom lies the farthest reaches of Jambudvīpa, the wilds of Dongyang, the Land of Yishatuo, also called the Celestial Fire Court of Tianzhu. Beyond its borders lies Changzhou, also called Qingqiu, in the southern sea of Chen and Si, spanning five thousand *li*, twenty-five thousand *li* from shore. There grow great trees, three thousand *zhang* tall and two thousand *wei* in girth, abundant with divine medicines, sweet nectar, and jade blossoms—nothing is lacking. Its inhabitants live for three hundred and sixty years. There are also spirit foxes, as large as dogs, their fur in five colors. Their cries resound for four thousand *li*, and their majesty subdues tigers, leopards, and all beasts. Those who wear their fur live as long as heaven and earth.\n\nTo the left stands Wind Mountain, where constant rumbling echoes. Atop it lies the Purple Mansion Palace, where divine transcendent jade maidens wander and observe. Further lies Yanzhou, at the center of the Southern Sea, spanning two thousand *li*, nine thousand *li* from shore. Upon it dwells the Wind-Born Beast, resembling a leopard, blue in color, and as large as a wildcat. Its body blazes with fire that reaches the heavens, burning for months without dying, its fur unscorched. Blades cannot pierce it, and only after striking its head thousands of times with an iron hammer does it perish. If it opens its mouth to the wind, it revives in moments. Plugging its nostrils with *shi shang changpu* (stone-surface calamus) kills it. Taking its brain and mixing it with chrysanthemum blossoms to consume grants life as enduring as heaven and earth.\n\nThere is also Fire Forest Mountain, where the Fire-Light Beast dwells, as large as a rat, its fur three to four *cun* long, either red or white. Gazing at the mountain’s forests and these beasts at midnight, their light shines like burning flames. Weaving their fur into cloth produces *huohuan bu* (fire-washed cloth). If slightly soiled, burning it restores its freshness. The people of Yishatuo wear this cloth, and immortals descend in its likeness. Scholars who meditate upon the land’s tones and contemplate the immortal official Yue Lao for thirty-six years will have divine beings present these beasts and other wondrous treasures of the land to them.\n\n**The Land of Niweiluolüna in the West:**\nFirst Inscription: The true tone is *Hua Lian*.\nSecond Inscription: The tone is *Ri Gao Xuan*.\nThird Inscription: The tone is *Ri Ming Shen*.\nFourth Inscription: The tone is *Ri Tu Chan*.\nFifth Inscription: The tone is *Ri Xing Zhen*.\nSixth Inscription: The tone is *Ri Zhu Tian*.\n\nBeyond sixty thousand *li* west of the Middle Kingdom lies the farthest reaches of Juxieni, the bleak and frigid wilds of Haosu, the Land of Niweiluolüna, also called the Cloud Barbarian Moon-Branch Land. Its people live for six hundred years. Beyond its borders lies Liuzhou, in the southern part of the Western Sea, spanning three thousand *li*, nineteen thousand *li* from the eastern shore, home to tens of thousands of immortals. Upon it stands a mountain where *kunwu* stone is found. Forged into iron and crafted into swords, their brilliance illuminates caves like crystal, cutting jade as easily as earth.\n\nFenglínzhou lies at the sea’s center, spanning one thousand five hundred *li*, surrounded by weak waters where even goose feathers cannot float. It is home to thousands of immortals and flocks of phoenixes and qilin. There dwells the Ji Guang Beast, resembling a wildcat, capable of human speech, its voice like Sanskrit chanting. It communicates with the land’s people, its fur radiant with light, worn only by immortals.",
      "overlap_context": "sand kalpas. When ascending mountains to dwell or settling in a residence, to discern the land’s auspiciousness or inauspiciousness, on a *wu* or *ji* day, inscribe in yellow the thirty-six earth tones of the nine strata on white paper and place it at the center of the dwelling, covering it with a basin. After three nights, uncover and examine it: if the paper is moist and yellow, it is greatly auspicious; if it is green, there are dead spirits’ corpses below; if it is white, it is inauspicious.",
      "start_char": 16991,
      "end_char": 18275,
      "start_sentence": 484,
      "end_sentence": 531,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.25681972503662,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 22,
      "original_text": "得衣其毛，寿同天地。 学者存其国音，氐老仙官三十六年，当献送昆吾之剑，吉光之兽於兆也。 北方旬他罗之国 第一品铭 ，音曰玄家。 第二品铭 ，音曰文多。 第三品铭 ，音曰山芦。 第四品铭 ，音曰武都。 第五品铭 ，音曰盈家。 第六品铭 ，音曰玄摩。 北方去中国分五万里外，名郁单下极朔阴钩陈之庭，国名旬他罗之国，一名天镜之国，国人寿三百岁。 国外则有玄洲，方七千二百里，四面是海，去岸三十六万里，上有太玄都，仙伯真公所治。 有寿鸳之鸟，如浮气，多丘山，名为风山，与天西北门连界，金堂玉室宫府，生金玉紫芝，是三天所治。 其外则有元洲，地方三千里，去南岸十万里，上生五芝玄涧，涧水如蜜，饮之与天地同年。 中有三万仙家，悉饮此水，得仙不死。 学者存其国音，羌老仙官三十六年，献降玄涧五芝水也。 上方元精青沌自然之国： 第一品铭 ，正音重欢。 第二品铭 ，正音玉金。 第三品铭 ，正音三林。 第四品铭 ，正音正精。 第五品铭 ，正音吸钤。 第六品铭 ，正音绿婴。 上方九天之上，清阳恢空之内，无色无象无形无影空洞之铭，元精清沌自然之国，一名洞澳清衍之国，以清气为芬世，上极无穷，四覆诸天，惟有玉虚紫馆，结空洞之烟，在虚玄青沌之内也。 为学存高上之音，则天人授子飞仙之方。 中方太和宝真无量之国： 第一品铭 ，正音山芦 第二品铭 ，正音世家。 第三品铭 ，正音嵯峨。 第四品铭 ，正音盈华。 第五品铭 ，正音翟葩。 第六品名 ，正音罗那。 中国四周百二十亿万里，下极大风泽五百二十亿万里，昆仑处其中央，弱水周匝绕山，山高平地三万六千里，上三角，面方长万里，形似偃盆，中狭上广。 其一角正北，干辰星之精，名阆风台； 一角正西，名曰玄圃台； 其一角正东，名曰昆仑宫。 一处有积金，为天墉城，面方千里，城上安金台五所，玉楼十二，其北户山承渊山，并其支辅。 又有墉城、金台玉楼，相似如一，流精之阙，光碧之堂，琼华之室，紫翠丹房，景云烛日，朱霞九光，西王母之所治。 上通璇玑，元气流布，五常玉衡，普引九天之澳灌，万仙之宗根，天地之纽，万度之柄矣。 上生金银之树，琼柯丹宝之林，垂苏瑰以为枝，结玉精以为实，其树悉刻题三十六国音诸天内文，上楼紫驽、凤鸾、白雀、朱鹗、鹍鸡、灵鹄、赤鸟、青鹊，下则飞禽游兽，与昆仑同生，初无死耗。 但玄文宝经，隐书古字，有千二百亿万言，在玄圃之上，积石之阴，仙人有九万人，皆停散於灵山。 学者常诵诸天内音，外国三十六音，地下九垒之音，九年，仙人自当降送灵山之神奇，三十六年，得乘五色云舆，上登昆仑之山也。 高上告上相青童君：凡诸天文三十六国九地之音，皆玄古空洞之书，自然之章，悉是上真帝皇以下，及学仙得道，莫不受音於太真，佩文以游行，威制万灵，摄魔召精，登涉五岳，及入三军，皆九天卫迎，四司扶侍，九年，三元诣房，三十六年，天降云舆，飞行上清。 受其音，以青缯为地，黄笔书文。 以甲子之日夜半，於中庭露醮，以随时珍果、清酒三斗，设以九盘九杯，施九尺青罗之内，以设诸文。 弟子赍上金九两，纹之缯三十六尺，南向而伏。",
      "translated_text": "Obtaining its fur grants life as enduring as heaven and earth. Those who master the land’s speech shall, after thirty-six years as an elder immortal official, present the *kunwu* sword and the Ji Guang Beast to the Supreme One.\n\n**The Land of Xunta Luo in the North**\n**First Inscription:** Sounds as \"Xuanjia.\"\n**Second Inscription:** Sounds as \"Wenduo.\"\n**Third Inscription:** Sounds as \"Shanlu.\"\n**Fourth Inscription:** Sounds as \"Wudu.\"\n**Fifth Inscription:** Sounds as \"Yingjia.\"\n**Sixth Inscription:** Sounds as \"Xuanmo.\"\n\nFive hundred thousand *li* north of the Middle Kingdom lies the extreme of the northern darkness, the court of the Celestial Curtain—known as the Land of Xunta Luo, or the Land of the Heavenly Mirror. Its people live three hundred years. Beyond its borders lies Xuanzhou, spanning seven thousand two hundred *li*, surrounded by seas thirty-six thousand *li* from shore. Above stands the Great Mysterious Capital, governed by the Immortal Lord Zhen Gong. There dwells the Longevity Mandarin Duck, resembling floating mist. Many hills rise there, called Wind Mountain, which borders the northwestern gate of heaven. Its halls and chambers are of gold and jade, yielding golden jade and purple lingzhi, governed by the Three Heavens.\n\nBeyond it lies Yuanzhou, spanning three thousand *li*, ten thousand *li* from its southern shore. There grow the Five Lingzhi of the Mysterious Gorge, whose waters flow like honey. Drinking them grants life equal to heaven and earth. Thirty thousand immortals dwell there, all drinking this water to attain deathless transcendence. Those who master the land’s speech shall, after thirty-six years as an elder immortal official, offer the Five Lingzhi Water of the Mysterious Gorge.\n\n**The Land of Primordial Essence and Pristine Chaos in the Upper Realm**\n**First Inscription:** True sound, \"Chonghuan.\"\n**Second Inscription:** True sound, \"Yujin.\"\n**Third Inscription:** True sound, \"Sanlin.\"\n**Fourth Inscription:** True sound, \"Zhengjing.\"\n**Fifth Inscription:** True sound, \"Xiqin.\"\n**Sixth Inscription:** True sound, \"Lüying.\"\n\nAbove the Nine Heavens, within the vast emptiness of pure yang, where form and shadow dissolve into the void—there lies the Land of Primordial Essence and Pristine Chaos, also called the Land of the Abyssal Azure Expanse. It is a world perfumed by pure *qi*, boundless above, covering all heavens below. Only the Jade Void and Purple Pavilion weave mist through the hollow emptiness, nestled within the Pristine Azure Chaos. Those who master the loftiest celestial speech shall receive from the heavens the method of ascending as a flying immortal.\n\n**The Land of Supreme Harmony and Boundless Treasure Truth in the Central Realm**\n**First Inscription:** True sound, \"Shanlu.\"\n**Second Inscription:** True sound, \"Shijia.\"\n**Third Inscription:** True sound, \"Cuo’e.\"\n**Fourth Inscription:** True sound, \"Yinghua.\"\n**Fifth Inscription:** True sound, \"Dipan.\"\n**Sixth Inscription:** True sound, \"Luona.\"\n\nThe Middle Kingdom spans one hundred twenty million *li* in circumference, its depths reaching the Great Wind Marsh five hundred twenty million *li* across. At its center stands Kunlun, encircled by weak waters. The mountain rises thirty-six thousand *li* above the plain, its summit triangular, each face ten thousand *li* in length, shaped like an inverted basin—narrow at the waist, broad above. One peak points due north, infused with the essence of the Chen star, called the Terrace of Soaring Winds. Another faces west, named the Terrace of the Mysterious Garden. The third points east, called the Kunlun Palace. In one place, gold accumulates to form the Celestial Rampart City, a thousand *li* on each side. Upon it stand five golden terraces and twelve jade towers. To the north lie the Mountain of the Northern Gate and the Mountain of the Abyssal Spring, along with their subsidiary peaks. There are also rampart cities, golden terraces, and jade towers, all identical in splendor—gleaming towers of refined essence, halls of luminous azure, chambers of jasper radiance, vermilion chambers of purple and cinnabar, where rosy clouds illuminate the sun and crimson auroras glow with ninefold brilliance. Here rules the Queen Mother of the West. Above, it connects to the Celestial Mechanism, where primordial *qi* flows and spreads. The Five Constants and Jade Balance universally guide the influx from the Nine Heavens’ abysses, serving as the root of myriad immortals, the pivot of heaven and earth, the handle of all measures.\n\nGold and silver trees grow here, forests of jade branches and cinnabar treasures, their boughs draped in resplendent tassels, their fruits formed of refined jade. Each tree is inscribed with the thirty-six celestial scripts of the heavens and the languages of the thirty-six lands. Above soar purple falcons, phoenixes, white sparrows, vermilion owls, *kun* pheasants, spirit magpies, red birds, and azure magpies. Below, flying birds and wandering beasts thrive alongside Kunlun, never knowing death or decay. Yet the sacred texts of the Mysterious Scriptures and the hidden writings of ancient characters—comprising one thousand two hundred million words—lie upon the northern slope of the Accumulated Stones in the Mysterious Garden. Ninety thousand immortals dwell there, scattered across the numinous mountain. Those who recite the celestial sounds of the heavens, the thirty-six languages of foreign lands, and the nine subterranean tones for nine years shall have immortals descend to bestow the mountain’s divine wonders. After thirty-six years, they shall ascend Kunlun upon a five-colored cloud chariot.\n\nThe Most High addresses the Supreme Minister, the Azure Youth: All celestial writings of the thirty-six lands and nine earthly realms are the primordial, hollow, and empty scriptures—natural chapters of the highest truth. From the Supreme Thearch and the Imperial Sovereigns below, to those who study immortality and attain the Dao, none fail to receive these sounds from the Supreme Truth. Bearing these texts in their travels, they command the awe of all spirits, subdue demons, summon essences, traverse the Five Peaks, and enter the Three Armies—always escorted by the Nine Heavens’ guards, attended by the Four Directors. After nine years, they ascend to the Three Origins’ chambers. After thirty-six years, heaven sends a cloud chariot to carry them aloft into the Upper Clarity.\n\nTo receive these sounds, use azure silk as the ground and a yellow brush to inscribe the text. On the night of the *jiazi* day, at midnight, perform an open-air libation in the central courtyard. Offer seasonal delicacies, three *dou* of clear wine, nine plates, and nine cups, arranged within a nine-*chi* square of azure silk. Present the texts accordingly. The disciple shall offer nine taels of gold and thirty-six *chi* of figured silk, prostrating toward the south.",
      "overlap_context": " brilliance illuminates caves like crystal, cutting jade as easily as earth.\n\nFenglínzhou lies at the sea’s center, spanning one thousand five hundred *li*, surrounded by weak waters where even goose feathers cannot float. It is home to thousands of immortals and flocks of phoenixes and qilin. There dwells the Ji Guang Beast, resembling a wildcat, capable of human speech, its voice like Sanskrit chanting. It communicates with the land’s people, its fur radiant with light, worn only by immortals.",
      "start_char": 18275,
      "end_char": 19564,
      "start_sentence": 532,
      "end_sentence": 576,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.674086570739746,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 23,
      "original_text": "师北向，叩齿三十六通，上告九天丞相，中告五帝五灵，下关九土九气丈人，今上告八会，天源朗清，玉帝鉴映，虚皇临庭，领仙校录，东华简名，上学某甲，仰慕神仙，投盟誓灵，奉受天文三十六音，闭口修行，敢泄灵真，醴酒贡心，上招高晨元灵之气，下监兆臣自尔之后，违负盟科，七祖充责，身没河源，长负刀山，不敢蒙仙，三官九府咸识盟言。 毕，弟子置信，左手执文，向西北九拜，回东南向九拜，次向本命上九拜。 都毕。 上清外国放品青童内文卷下竟",
      "translated_text": "The master faces north, striking the teeth thirty-six times in succession. Above, he petitions the Nine Heavens’ Chancellor; at the center, the Five Emperors and Five Spirits; below, the Nine Lands’ and Nine Qi’s Elders. Now he reports to the Eight Assemblies: the Heavenly Source shines in clarity, the Jade Emperor reflects in witness, the Void Sovereign presides over the court, the Registers of Transcendents are overseen, and the Eastern Florescence records the name. The disciple, so-and-so, yearning for the divine immortals, pledges allegiance to the numinous and receives the thirty-six celestial writings. With sealed lips, he cultivates the practice, daring not to leak the divine and true. Offering sweet wine, he dedicates his heart: above, he summons the primordial qi of the lofty dawn; below, he oversees the signs of his fate. From this moment onward, should he violate the covenant’s statutes, his seven ancestors shall bear the blame, his person sink into the river’s source, and forever endure the knife mountains. He dares not deceive the immortals—the Three Offices and Nine Bureaus all acknowledge this sworn pact.\n\nWhen finished, the disciple presents the token of faith, holding the text in his left hand. Facing the northwest, he bows nine times; turning to the southeast, he bows nine times; then, facing his own life-star, he bows nine times. All rites completed.\n\n*Concluding the Lower Scroll of the Outer Realm’s Graded Writings and the Inner Writings of the Azure Lad of Upper Clarity.*",
      "overlap_context": "oft into the Upper Clarity.\n\nTo receive these sounds, use azure silk as the ground and a yellow brush to inscribe the text. On the night of the *jiazi* day, at midnight, perform an open-air libation in the central courtyard. Offer seasonal delicacies, three *dou* of clear wine, nine plates, and nine cups, arranged within a nine-*chi* square of azure silk. Present the texts accordingly. The disciple shall offer nine taels of gold and thirty-six *chi* of figured silk, prostrating toward the south.",
      "start_char": 19564,
      "end_char": 19773,
      "start_sentence": 577,
      "end_sentence": 580,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.806697368621826,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清外国放品青童内文.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}