{
  "source_id": "上清黄庭养神经",
  "source_file": "chunked_daozang\\上清黄庭养神经.json",
  "total_chunks": 3,
  "total_original_chars": 2833,
  "total_translated_chars": 16046,
  "total_translation_time": 83.75477814674377,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\上清黄庭养神经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Clarity Scripture on Nurturing the Spirit in the Yellow Court**\n\n**Scripture Title:** *The Supreme Clarity Scripture on Nurturing the Spirit in the Yellow Court*. Author unknown. One scroll.\n\n**Source Text:** *Daoist Canon of the Orthodox Tradition*, Zhengyi Section, First Division.\n**Collated Editions:** *Seven Lots from the Bookcase of the Clouds* (Volume 14 includes partial content).\n\n---\n\nThe Dao speaks: Long ago in the Flowery Pearl Palace, I heard the wondrous meanings of the *Yellow Court* and the transformative Dao within the *Lute of the Heart and Spirit of the Great Way*. When humans receive life, they partake of the numinous Dao-qi, embracing the harmony of yin and yang. Yet they become ensnared by sounds and sights, deluded by flavors, and seduced by excess and lust, losing their right mindfulness and squandering their prime years.\n\nKnow that movement and stillness, departure and abiding, must be cultivated in accord with the teachings. By treading the wondrous practices to nurture the spirit, the body attains tranquility, myriad calamities are averted, and demonic forces cannot disturb. Preserve the thought of the Dao and distance yourself from evil paths.\n\nWhen coming or going, call upon the name of the Day Spirit of the present day, saying, \"[Name], escort me forth and back.\" By thus invoking, you walk in the Dao. The Day Spirit accompanies you, and no evil of the spirit-realm can assail you. You will repel all ghosts, and for a thousand years, ten thousand ages, no venomous harm shall befall you.\n\nWhen submitting memorials to high officials, inscribe talismans and carry them on your person. Thrice invoke the Day Spirit, saying, \"[Name], accompany me.\" For households afflicted by illness or death, place the talisman on your person—on the right side on yin days, the left on yang days.\n\nIf entering mountains or forests to evade peril, thrice knock your teeth and call upon the Day Spirit, as well as the Spirit of Jia-Shen. All mountain ghosts, demons, wolves, and tigers will flee in terror. To dispel malevolent spirits and ghosts, inscribe the talismans of the Six Jia and Six Yi, and invoke the Spirit of Jia-Yin—all ghosts will scatter.\n\nTo avert weapons in battle, inscribe the talismans of the Six Bing and Six Ding, invoke their spirits, and call upon the name of the Spirit of Jia-Wu. Blades shall not wound you. To guard against fire, inscribe the talismans of the Six Ren and Six Gui, invoke their spirits, and call upon the name and style of the Spirit of Jia-Zi, saying, \"[Name], accompany me,\" and you shall not be burned.\n\nTo escape drowning, inscribe the talismans of the Six Wu and Six Ji, and invoke the Spirit of Jia-Xu—you shall be spared from water’s peril. In disputes or slander, inscribe the talismans of the Six Geng and Six Xin, invoke their spirits, and call upon the talisman of the Spirit of Jia-Chen. All hostile words shall be resolved in harmony.\n\nThe talismans described above are to be inscribed and worn in secret; do not transmit them carelessly. For example, the Spirit of Jia-Zi is surnamed Wang, styled Wenqing—Wang is the surname, Wenqing the style. The same pattern applies to all others through Gui-Hai. In total, there are eight hundred and seven spirits, each serving in rotation as the Day Spirit.\n\nIf one, at dawn each day, thrice knocks the teeth and recites the name of the Day Spirit, saying, \"[Name], today’s Day Spirit, accompany me, that all I encounter may be propitious and upright,\" and further thrice knocks the teeth to invoke one’s Life Spirit, all desires shall be fulfilled. Moreover, whatever one eats daily should be offered to one’s Life Spirit, thereby increasing fortune and longevity. On one’s Life Day, performing great acts of merit for the Life Spirit brings even greater auspiciousness.\n\nOn the left, the Azure Dragon Mengzhang of Jia-Yin; on the right, the White Tiger Jianbing of Jia-Shen; above the head, the Vermilion Bird Lingguang of Jia-Wu; beneath the feet, the Dark Warrior Zhiming of Jia-Zi. The Moon enters the center as the Noble One.\n\nRecite this passage in secret until memorized; do not utter it aloud, nor let others know. In legal disputes, when encountering inauspicious qi, amid the perils of battle, or when entering foreign lands with unfamiliar waters and soils, or during epidemics, repeatedly meditate upon it at dawn. When entering a household in mourning or approaching a corpse, recite it once per step upon crossing the threshold, knock the teeth thrice, and recite it three times—this is my method.\n\nUpon awakening the next day, invoke the names of the Four Seas’ spirits:\n- Spirit of the Eastern Sea: Aming\n- Spirit of the Western Sea: Zhouliang\n- Spirit of the Southern Sea: Jucheng\n- Spirit of the Northern Sea: Yuqiang\n\nThe great spirits of the Four Seas repel all ghosts, dispel misfortune, and swiftly obey the command!\n\nThe *Scripture of the Six Jia Spirits Enveloping the Body in the Secret Essentials of the Yellow Court’s Inner Radiance* states:\n\nShould one suddenly contract illness, paralysis, swelling, malign qi, the hundred poisons of corpse-curse, or suffer from nightmares, hold the breath and recite in intervals: from *jia-wu* to *wu-xu*, retaining the qi within the Upper Dipper. The Upper Dipper lies between the two breasts. Hold the breath and recite *jia-wu* to *wu-xu* ten times, then exhale. Again, hold the breath and recite *jia-zi* to *wu-chen* ten times, then retain the qi within the Lower Dipper. The Lower Dipper is the navel’s center. Recite in intervals ten times, then exhale—this cures all ailments and brings immediate recovery.\n\nIf pain or suffering arises suddenly in any of the four limbs, invoke the name of the spirit presiding over the afflicted area three times, and the ailment will cease; invoke no more than thrice. Inscribe a vermilion talisman directly upon the painful spot and swallow it. Also invoke the name of the spirit of the current day, saying, “So-and-so, protect me and accompany me on my way.” With this method alone, no illness remains uncured.\n\nThe Heavenly Master states: Before employing these talismans or consuming them oneself, one must first purify the body and maintain a sincere, unblemished heart—only then will the talismans prove efficacious. Should one act with deceit, flattery, or falsehood, seeking to profit from my methods by extorting others’ wealth or pursuing fame and gain, such persons shall incur misfortune, and the afflictions of those they treat shall not be dispelled. This is the immutable decree. Do not use my methods to seek worldly wealth, nor transmit them to the flattering or deceitful.\n\nMy Dao possesses sagely wisdom—guard it closely, never transmit it recklessly. Seal it in silence, bind your tongue, and do not leak it. Transmit it only to the worthy, and the Dao shall remain pure and luminous; transmit it to the unworthy, and the Dao shall be defiled. Bestow it upon the worthy, and both shall receive its blessings; bestow it upon the unworthy, and both shall suffer calamity. Know when to transmit and when to withhold—transmit when it is right, and halt when it is not. To withhold from the worthy is to hoard treasure; to transmit to the unworthy is to squander it. Hoarding or squandering treasure brings untimely ruin.\n\nLord Lao says: Guard it well, do not transmit it recklessly.\n\nFor all rituals, first observe purification and fasting. Prepare a chamber with a seat in readiness. When fasting for sixty days to consume the talisman, bathe the night before, and drink a divine decoction of ten jujubes—refrain from other food. Sit in quietude, and when the spirit-birds sing at dawn, draw a cup of well’s first water. At daybreak, face east, knock the teeth, and recite the incantation: “I delight in the Dao and its methods, and reverently consume this divine talisman. May the spirits be moved—*jia-zi* Wang Wenqing and his eighteen attending officials.” Upon finishing the incantation, bow twice, swallow the talisman with the water, and carefully determine the spirit of the current day, ensuring no error.\n\nOn *gui-hai* day, consume the *jia-zi* talisman; on *jia-zi* day, consume the *yi-chou* talisman, also invoking the spirit of the current day. From *yin* day onward, consume the talisman of each respective day until all sixty are exhausted, aligning with the spirits of the day. Should you hear the voice of the day’s spirit, do not be startled or afraid. When you first behold the spirit, offer a sacrifice of wine, jujubes, incense, and fruit. If, after consuming all sixty talismans, you immediately perceive the spirit, proceed with the sacrifice. If you engage in speech with the spirit, further sacrifices are unnecessary.\n\nFor the grand sacrifice, use the seventh day of the first month. The offerings are as described above, with the addition of a bolt of blue silk measuring one *zhang* and five *cun*. After the sacrifice, wear the blue silk as an upper garment.\n\nFor the fasting and sacrificial rites, avoid only impure colors and foul, odious foods; all else is as in the *Fu Yi Xi* for personal practice.\n\nFor the initial encounter with the spirit, lay out a mat with the seat facing west. Arrange sixty cups upon the mat in six rows. Pour wine and present six jujubes, facing east, and recite the incantation: “I humbly invite the Lords of the Six Jia to partake of these sweet jujubes and fine wine.” Only bow once the spirit is seated. For the first sacrifice, the jujubes must be presented. The rites for transmitting talismans to others or healing the sick follow the same method.\n\nUpon concluding, recite the incantation: “Water, fire, metal, wood, earth—return each to its proper place.”\n\nLord Lao says: Within the heart reside three spirits, each with a name:\n- The first is Ling Zhu Jun,\n- The second is Ling Ming Jun,\n- The third is Ling Huang Jun.\n\nConstantly meditate upon them, reciting their names thrice daily. They shall accompany you whether walking or sitting, shielding you to traverse perilous years.\n\nAt dawn, after rinsing the mouth, recite this incantation:\n*“Nihuan’s mysterious blossom, preserving essence evermore.\nLeft, the hidden sun; right, the moon’s root.\nThe Six Harmonies refine the spirit,\nAnd the hundred gods receive grace.”*\n\nBefore each meal, first recite this incantation:\n*“The hundred grains enter the stomach,\nUniting with the spirit’s qi.\nThey replenish blood and fluids,\nBanishing corpse-demons and decay.\nAscend to the Golden Gate,\nTo live as long as heaven and earth,\nCommanding the Six Dings,\nWith divine youths in attendance.\nSwiftly, swiftly, as decreed by statute and ordinance.”*\n\nKnock the teeth seven times on the right, swallow saliva thrice, and recite in secret.\n\nOn one’s natal day, distribute alms of money, rice, and cloth according to one’s age to the poor, increasing blessings and extending years.\n\nAll impurities and filth must never be directed toward the north.\n\nOn the sixteenth day of the fifth month, strictly avoid the union of yin and yang.\n\nWhen relieving oneself, never face the Three Luminaries—such is a grave transgression.\n\nThe *Six Jia* spirit-talismans of the *Scripture of the Yellow Court* cure illness, restrain the hun and po souls, and conceal celestial patterns.\n\nFor the *jia-zi* cycle, the Jade Maiden is named Moonlight, clad in purple above and yellow below.\nFor the *jia-zi* cycle, the spirit-general is Tianpeng, with the official Yin A Jun, a child of Tian Yi.\n“Today, in unity with Tianpeng and the Six Jia, dare any oppose? Tianpeng shall not be restrained.”\n\nFor the *jia-xu* cycle, the Jade Maiden is named Denggu, clad in green above and purple below.\nFor the *jia-xu* cycle, the spirit-general is Tiannei, with the official Zhang Bulin, a child of Tian Yi.\n“Today, in unity with Tiannei and the Six Ji, dare any oppose? Tiannei shall not be restrained.”\n\nFor the *jia-shen* cycle, the Jade Maiden is named Open Brightness, clad in white above and red below.\nFor the *jia-shen* cycle, the spirit-general is Tianchong, with the official Cheng Zi’en, a child of Tian Yi.\n“Today, in unity with Tianchong and the Six Geng, dare any oppose? Tianchong shall not be restrained.”\n\nFor the *jia-wu* cycle, the Jade Maiden is named Han Ying, clad in purple above and white below.\n\nFor the *jia-wu* cycle, the spirit-general is Tianfu, with the official Du Xujun, a child of Tian Yi.\n“Today, in unity with Tianfu and the Six Xin, dare any oppose? Tianfu shall not be restrained.”\n\nFor the *jia-chen* cycle, the Jade Maiden is named Yingtai, clad in yellow above and green below.\nFor the *jia-chen* cycle, the spirit-general is Tianqin, with the official Gongsun Dajun, a child of Tian Yi.\n“Today, in unity with Tianqin and the Six Ding, dare any oppose? Tianqin shall not be restrained.”\n\nFor the *jia-yin* cycle, the Jade Maiden is named Dengfu, clad in green above and red below.\nFor the *jia-yin* cycle, the spirit-general is Tianxin, with the official Xu Junwang, a child of Tian Yi.\n“Today, in unity with Tianxin and the Six Wu, dare any oppose? Tianxin shall not be restrained.”\n\nThe divine talismans of the Six Jia cycles include six Jade Maidens, six Jade Maidens of the Six Ding, six cycle officials, and six talisman officials.\nIn total, there are twenty-four Jade Maidens and cycle officials.\n\nFor the *jia-zi* cycle, the Jade Maiden is accompanied by one hundred thirty-nine spirits.\nFor the *jia-xu* cycle, the Jade Maiden is accompanied by one hundred thirty-five spirits.\nFor the *jia-shen* cycle, the Jade Maiden is accompanied by one hundred thirty-one spirits.\nFor the *jia-wu* cycle, the Jade Maiden is accompanied by one hundred thirty-one spirits.\nFor the *jia-chen* cycle, the Jade Maiden is accompanied by one hundred thirty-five spirits.\nFor the *jia-yin* cycle, the Jade Maiden is accompanied by one hundred thirty-five spirits.\nThe Six Jia cycles include twelve beast-warriors.\n\nAcross the Six Jia cycles, the generals, Jade Maidens, cycle officials, and talisman spirits total nine hundred sixty-six.\n\nThe *zi* beast-warrior has a rat’s head and a human body, wielding a spear and clad in black.\nThe *chou* beast-warrior has an ox’s head and a human body, wielding a sword and clad in yellow.\nThe *yin* beast-warrior has a tiger’s head and a human body, wielding a halberd and clad in green.\nThe *mao* beast-warrior has a rabbit’s head and a human body, wielding a halberd and clad in green.\nThe *chen* beast-warrior has a dragon’s head and a human body, wielding a halberd and clad in yellow.\nThe *si* beast-warrior has a snake’s head and a human body, wielding a halberd and clad in red.\nThe *wu* beast-warrior has a horse’s head and a human body, wielding a halberd and clad in red.\nThe *wei* beast-warrior has a goat’s head and a human body, wielding a halberd and clad in yellow.\nThe *shen* beast-warrior has a monkey’s head and a human body, wielding a halberd and clad in white.\nThe *you* beast-warrior has a rooster’s head and a human body, wielding a crossbow and clad in white.\nThe *xu* beast-warrior has a dog’s head and a human body, wielding a crossbow and clad in yellow.\nThe *hai* beast-warrior has a boar’s head and a human body, wielding a spear and clad in black.\n\nAll talismans above are to be inscribed in vermilion.\n\nThe Six Jia comprise three metals, five dragons, and six stone chambers, totaling nine hundred sixty scrolls—this scroll serves as the key.\nThose who master it transcend the world, instantly summoning traveling kitchens. Myriad evils shall not encroach, and no spirit dare oppose. It is used to break into demonic shrines, capture ghosts, dispel malevolence, and heal all ailments.\nThose who wear the Six Jia divine talismans command ten thousand spirits, ensuring personal safety. Cultivating benevolence and righteousness dispels calamities and transcends misfortune, inevitably attaining the Dao and ascending to the heavens.\nAvoid defilement above all. If entering households of mourning or childbirth, wear the talisman to dissolve impurity.\n\nHere ends the *Shangqing Huangting Yangshen Jing*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清黄庭养神经 经名：上清黄庭养神经。 不着撰人。 一卷。 底本出处：《正统道藏》正一部。 参校版本：《云笈七签》，部分内容收入该书卷十四。 上清黄庭养神经 道言：昔於蕊珠，宫中，听闻，《黄庭》妙义，《大道琴心灵篇》内固，变化之道。 人之受生，分灵道气，含和阴阳。 逐恋声色，为滋味所惑，为奢淫所诱，亡失正念，虚度壮年焉。 知动静出处当依教修习，履历妙行，以辅养其神，则身安静，万灾不干，邪魔不挠。 存思念道，远离恶道。 将来出入，当呼今日日神姓名字某某，送我去来。 如是呼之，乃行其道。 直日神与人同行，神道众恶不干，能却百鬼，千年万岁不逢恶毒。 又奏表上谒贵人，皆书符持怀中，三呼直日之神，与我同行。 疾病家、死生家，置符於怀中，遇阴日右畔，阳日左边。 若入山林避难者，三叩齿，呼直日神，并呼甲申神，山中鬼魅狼虎之类，尽皆迸走。 若辟除恶神鬼者，书六甲六乙符持行，并呼甲寅神，鬼皆散走。 若入军阵辟兵，即书六丙六丁符，并呼其神姓名，仍呼甲午神名，兵刃不伤。 若欲辟火者，书六壬六癸符，并呼其神，又呼甲子神姓名字，云与我同行，即不被烧燕。 若欲避水难者，书六戊六己符，并呼甲戌神，即免水溺。 若官司口舌，书六庚六辛符，并呼其神姓名，又呼甲辰神官符，口舌相向，悉皆和解。 已上所言，书符带之，秘之勿传。 假令甲子神姓王字文卿，王是姓，文卿是字。 至癸亥，佗皆放此。 从神计八百七人，每日有一神当直。 人能每日清旦三叩齿，诵直日之神名，云某君为直日，与我俱行，使我所在咸亨利贞，又能每日三叩齿，诵本命神，所求如意。 又每日所须食之物，宜与本命神吃，尤加福寿。 更能於本命日与本命神作大福利，吉庆尤甚。 某乙左青龙孟章甲寅，右白虎监兵甲申，头上朱雀灵光甲午，足下玄武执明甲子。 月为贵人入中央。 右此一首，常密念之令熟，勿令出声，不要他人知。 若有官司，或有殃害之气，军阵险难之处，及入他国未习水土，或遇疫病，晨日数数存念之心。 或入孝家，临尸见丧，亦入其门一步诵一遍，叩齿三下，当诵三褊，此我法也。 来日平觉，便念四海神名： 东海神名阿明， 西海神名咒良， 南海神名巨乘， 北海神名愚强。 四海大神辟百鬼，荡凶灾，急急如律令。 《黄庭内景秘要六甲缘身经》曰：",
      "translated_text": "**The Supreme Clarity Scripture on Nurturing the Spirit in the Yellow Court**\n\n**Scripture Title:** *The Supreme Clarity Scripture on Nurturing the Spirit in the Yellow Court*. Author unknown. One scroll.\n\n**Source Text:** *Daoist Canon of the Orthodox Tradition*, Zhengyi Section, First Division.\n**Collated Editions:** *Seven Lots from the Bookcase of the Clouds* (Volume 14 includes partial content).\n\n---\n\nThe Dao speaks: Long ago in the Flowery Pearl Palace, I heard the wondrous meanings of the *Yellow Court* and the transformative Dao within the *Lute of the Heart and Spirit of the Great Way*. When humans receive life, they partake of the numinous Dao-qi, embracing the harmony of yin and yang. Yet they become ensnared by sounds and sights, deluded by flavors, and seduced by excess and lust, losing their right mindfulness and squandering their prime years.\n\nKnow that movement and stillness, departure and abiding, must be cultivated in accord with the teachings. By treading the wondrous practices to nurture the spirit, the body attains tranquility, myriad calamities are averted, and demonic forces cannot disturb. Preserve the thought of the Dao and distance yourself from evil paths.\n\nWhen coming or going, call upon the name of the Day Spirit of the present day, saying, \"[Name], escort me forth and back.\" By thus invoking, you walk in the Dao. The Day Spirit accompanies you, and no evil of the spirit-realm can assail you. You will repel all ghosts, and for a thousand years, ten thousand ages, no venomous harm shall befall you.\n\nWhen submitting memorials to high officials, inscribe talismans and carry them on your person. Thrice invoke the Day Spirit, saying, \"[Name], accompany me.\" For households afflicted by illness or death, place the talisman on your person—on the right side on yin days, the left on yang days.\n\nIf entering mountains or forests to evade peril, thrice knock your teeth and call upon the Day Spirit, as well as the Spirit of Jia-Shen. All mountain ghosts, demons, wolves, and tigers will flee in terror. To dispel malevolent spirits and ghosts, inscribe the talismans of the Six Jia and Six Yi, and invoke the Spirit of Jia-Yin—all ghosts will scatter.\n\nTo avert weapons in battle, inscribe the talismans of the Six Bing and Six Ding, invoke their spirits, and call upon the name of the Spirit of Jia-Wu. Blades shall not wound you. To guard against fire, inscribe the talismans of the Six Ren and Six Gui, invoke their spirits, and call upon the name and style of the Spirit of Jia-Zi, saying, \"[Name], accompany me,\" and you shall not be burned.\n\nTo escape drowning, inscribe the talismans of the Six Wu and Six Ji, and invoke the Spirit of Jia-Xu—you shall be spared from water’s peril. In disputes or slander, inscribe the talismans of the Six Geng and Six Xin, invoke their spirits, and call upon the talisman of the Spirit of Jia-Chen. All hostile words shall be resolved in harmony.\n\nThe talismans described above are to be inscribed and worn in secret; do not transmit them carelessly. For example, the Spirit of Jia-Zi is surnamed Wang, styled Wenqing—Wang is the surname, Wenqing the style. The same pattern applies to all others through Gui-Hai. In total, there are eight hundred and seven spirits, each serving in rotation as the Day Spirit.\n\nIf one, at dawn each day, thrice knocks the teeth and recites the name of the Day Spirit, saying, \"[Name], today’s Day Spirit, accompany me, that all I encounter may be propitious and upright,\" and further thrice knocks the teeth to invoke one’s Life Spirit, all desires shall be fulfilled. Moreover, whatever one eats daily should be offered to one’s Life Spirit, thereby increasing fortune and longevity. On one’s Life Day, performing great acts of merit for the Life Spirit brings even greater auspiciousness.\n\nOn the left, the Azure Dragon Mengzhang of Jia-Yin; on the right, the White Tiger Jianbing of Jia-Shen; above the head, the Vermilion Bird Lingguang of Jia-Wu; beneath the feet, the Dark Warrior Zhiming of Jia-Zi. The Moon enters the center as the Noble One.\n\nRecite this passage in secret until memorized; do not utter it aloud, nor let others know. In legal disputes, when encountering inauspicious qi, amid the perils of battle, or when entering foreign lands with unfamiliar waters and soils, or during epidemics, repeatedly meditate upon it at dawn. When entering a household in mourning or approaching a corpse, recite it once per step upon crossing the threshold, knock the teeth thrice, and recite it three times—this is my method.\n\nUpon awakening the next day, invoke the names of the Four Seas’ spirits:\n- Spirit of the Eastern Sea: Aming\n- Spirit of the Western Sea: Zhouliang\n- Spirit of the Southern Sea: Jucheng\n- Spirit of the Northern Sea: Yuqiang\n\nThe great spirits of the Four Seas repel all ghosts, dispel misfortune, and swiftly obey the command!\n\nThe *Scripture of the Six Jia Spirits Enveloping the Body in the Secret Essentials of the Yellow Court’s Inner Radiance* states:",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 919,
      "start_sentence": 0,
      "end_sentence": 41,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.197747230529785,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清黄庭养神经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "若人卒得疾病及瘫臃，恶气、非尸百毒、恶梦之属，使闭气间诵：甲午至戊戌止，留气在上斗。 上斗中者，在两乳问也。 闭气间诵甲午至戊戌十遍，然后吐气。 又闭气间诵甲子至戊辰十遍然后留气在下斗。 下斗中者，脐中也。 亦间诵十遍，然后吐气，以治万病，悉能立愈。 若人身四肢卒有病苦之处，亦呼所痛处神名，满三即差，更不过呼三。 以朱书直符於痛处，并吞之。 又呼直日神名，言某护我，与我同行。 但以此法疗病，病无不愈者。 天师曰：吾行此符及自服者，先须清洁，直心无曲，即符有验。 若欺诳谄谬，欲以吾法货觅他人资财而求名利，如此之流，令受凶殃，亦令前人病不得除愈，皇犹斯也。 莫以吾法行求世财，莫授与谄佞之人。 吾道有圣，切莫妄传，闭在缄藏，结舌莫泄。 传得其人，令道清明； 传非其人，令道不清。 传得其人，受其福传； 非其人的受殃。 可传当传，不可传，切止，可传不传，名日遏宝，不堪与传而传，名曰泄宝。 遏宝、泄宝，令人不终。 老君曰：秘之，勿妄传。 凡须斋戒洁今，、先造一屋，设坐之所便，就斋六十母，当服符，宿沐浴，与枣十枚作神汤饮之，勿食，平坐静思，神鹦呜时取井华水一杯，清旦，面东，先叩齿，咒曰：某好乐道法，谨服神符，愿感神灵，甲子王文卿从官十八人。 咒讫，再拜，以水吞符，当审定直日之神，勿令差错。 可以癸亥，日服甲子符，甲子日服乙丑符，亦兼呼直日神，寅日以去，各服直日符尽，当直神，或闻直神声，不得惊怖，即见直神，便祭用酒枣香果。 若服符尽，六十而即见者，便当祭之。 若与神得语，不复烦祭。 大祭法，用正月七日，所用如上所说，但加青缯一丈五寸耳。 祭讫，以青为上衣，欲祭斋法，唯忌犯色及食臭恶之物，其余同福颐戏一身尔。 初见神祭法，铺席一领，位坐西向，用盏六十只，着席上为六行，枣六枚酌酒向东咒曰：谨请六甲之君，今奉甘枣美酒，愿飨膳食。 须见神坐乃拜，初祭要当枣着，授人及救病祭如上法。 讫咒曰：水火金木土，皆还其方。 老君曰：心中有神三名：一灵朱君，二灵明君，三灵黄君。 常思念，逐日三称名，行坐相随，拥护可度厄年。 平旦先灌漱讫诵此咒： 泥丸玄华，保精长存。 左为隐日，右为月根，六合精炼，百神受恩。 每欲食时先咒曰： 百谷入胃，与神合气，填补血液，尸邪亡坠，飞登金阙，长生天地，役使六丁，灵童奉卫， 急急如律令。 右叩齿诵七遍，咽液三褊，密念之。 凡人本命日，以随年钱米布施贫下，增福益年。 凡人一切秽污，忌向北方。 凡人五月十六日，大忌阴阳交会。 凡人小大便，忌向三光之大恶祸之。 黄庭经六甲神符治病，拘魂制魄，内秘天文， 甲子旬，玉女名月光，上紫衣下黄衣。 甲子旬，神将天蓬，吏阴阿君，天　　一子也。 今日与天蓬六甲同心，敢有当者，灭蓬不禁。 甲戌旬，玉女名登姑，上绛下紫衣。 甲戌旬，神将天内吏，张不临，天一子也。 今日与天内六己同心，敢有当者，灭内不禁。 甲申旬，玉女名开明，上白下红衣。 甲申旬，神将天冲，吏程子恩，天一子也。 今日与天冲六庚同心，敢有当者，灭冲不禁。 甲午旬，玉女名汉英，上紫下白衣。",
      "translated_text": "Should one suddenly contract illness, paralysis, swelling, malign qi, the hundred poisons of corpse-curse, or suffer from nightmares, hold the breath and recite in intervals: from *jia-wu* to *wu-xu*, retaining the qi within the Upper Dipper. The Upper Dipper lies between the two breasts. Hold the breath and recite *jia-wu* to *wu-xu* ten times, then exhale. Again, hold the breath and recite *jia-zi* to *wu-chen* ten times, then retain the qi within the Lower Dipper. The Lower Dipper is the navel’s center. Recite in intervals ten times, then exhale—this cures all ailments and brings immediate recovery.\n\nIf pain or suffering arises suddenly in any of the four limbs, invoke the name of the spirit presiding over the afflicted area three times, and the ailment will cease; invoke no more than thrice. Inscribe a vermilion talisman directly upon the painful spot and swallow it. Also invoke the name of the spirit of the current day, saying, “So-and-so, protect me and accompany me on my way.” With this method alone, no illness remains uncured.\n\nThe Heavenly Master states: Before employing these talismans or consuming them oneself, one must first purify the body and maintain a sincere, unblemished heart—only then will the talismans prove efficacious. Should one act with deceit, flattery, or falsehood, seeking to profit from my methods by extorting others’ wealth or pursuing fame and gain, such persons shall incur misfortune, and the afflictions of those they treat shall not be dispelled. This is the immutable decree. Do not use my methods to seek worldly wealth, nor transmit them to the flattering or deceitful.\n\nMy Dao possesses sagely wisdom—guard it closely, never transmit it recklessly. Seal it in silence, bind your tongue, and do not leak it. Transmit it only to the worthy, and the Dao shall remain pure and luminous; transmit it to the unworthy, and the Dao shall be defiled. Bestow it upon the worthy, and both shall receive its blessings; bestow it upon the unworthy, and both shall suffer calamity. Know when to transmit and when to withhold—transmit when it is right, and halt when it is not. To withhold from the worthy is to hoard treasure; to transmit to the unworthy is to squander it. Hoarding or squandering treasure brings untimely ruin.\n\nLord Lao says: Guard it well, do not transmit it recklessly.\n\nFor all rituals, first observe purification and fasting. Prepare a chamber with a seat in readiness. When fasting for sixty days to consume the talisman, bathe the night before, and drink a divine decoction of ten jujubes—refrain from other food. Sit in quietude, and when the spirit-birds sing at dawn, draw a cup of well’s first water. At daybreak, face east, knock the teeth, and recite the incantation: “I delight in the Dao and its methods, and reverently consume this divine talisman. May the spirits be moved—*jia-zi* Wang Wenqing and his eighteen attending officials.” Upon finishing the incantation, bow twice, swallow the talisman with the water, and carefully determine the spirit of the current day, ensuring no error.\n\nOn *gui-hai* day, consume the *jia-zi* talisman; on *jia-zi* day, consume the *yi-chou* talisman, also invoking the spirit of the current day. From *yin* day onward, consume the talisman of each respective day until all sixty are exhausted, aligning with the spirits of the day. Should you hear the voice of the day’s spirit, do not be startled or afraid. When you first behold the spirit, offer a sacrifice of wine, jujubes, incense, and fruit. If, after consuming all sixty talismans, you immediately perceive the spirit, proceed with the sacrifice. If you engage in speech with the spirit, further sacrifices are unnecessary.\n\nFor the grand sacrifice, use the seventh day of the first month. The offerings are as described above, with the addition of a bolt of blue silk measuring one *zhang* and five *cun*. After the sacrifice, wear the blue silk as an upper garment.\n\nFor the fasting and sacrificial rites, avoid only impure colors and foul, odious foods; all else is as in the *Fu Yi Xi* for personal practice.\n\nFor the initial encounter with the spirit, lay out a mat with the seat facing west. Arrange sixty cups upon the mat in six rows. Pour wine and present six jujubes, facing east, and recite the incantation: “I humbly invite the Lords of the Six Jia to partake of these sweet jujubes and fine wine.” Only bow once the spirit is seated. For the first sacrifice, the jujubes must be presented. The rites for transmitting talismans to others or healing the sick follow the same method.\n\nUpon concluding, recite the incantation: “Water, fire, metal, wood, earth—return each to its proper place.”\n\nLord Lao says: Within the heart reside three spirits, each with a name:\n- The first is Ling Zhu Jun,\n- The second is Ling Ming Jun,\n- The third is Ling Huang Jun.\n\nConstantly meditate upon them, reciting their names thrice daily. They shall accompany you whether walking or sitting, shielding you to traverse perilous years.\n\nAt dawn, after rinsing the mouth, recite this incantation:\n*“Nihuan’s mysterious blossom, preserving essence evermore.\nLeft, the hidden sun; right, the moon’s root.\nThe Six Harmonies refine the spirit,\nAnd the hundred gods receive grace.”*\n\nBefore each meal, first recite this incantation:\n*“The hundred grains enter the stomach,\nUniting with the spirit’s qi.\nThey replenish blood and fluids,\nBanishing corpse-demons and decay.\nAscend to the Golden Gate,\nTo live as long as heaven and earth,\nCommanding the Six Dings,\nWith divine youths in attendance.\nSwiftly, swiftly, as decreed by statute and ordinance.”*\n\nKnock the teeth seven times on the right, swallow saliva thrice, and recite in secret.\n\nOn one’s natal day, distribute alms of money, rice, and cloth according to one’s age to the poor, increasing blessings and extending years.\n\nAll impurities and filth must never be directed toward the north.\n\nOn the sixteenth day of the fifth month, strictly avoid the union of yin and yang.\n\nWhen relieving oneself, never face the Three Luminaries—such is a grave transgression.\n\nThe *Six Jia* spirit-talismans of the *Scripture of the Yellow Court* cure illness, restrain the hun and po souls, and conceal celestial patterns.\n\nFor the *jia-zi* cycle, the Jade Maiden is named Moonlight, clad in purple above and yellow below.\nFor the *jia-zi* cycle, the spirit-general is Tianpeng, with the official Yin A Jun, a child of Tian Yi.\n“Today, in unity with Tianpeng and the Six Jia, dare any oppose? Tianpeng shall not be restrained.”\n\nFor the *jia-xu* cycle, the Jade Maiden is named Denggu, clad in green above and purple below.\nFor the *jia-xu* cycle, the spirit-general is Tiannei, with the official Zhang Bulin, a child of Tian Yi.\n“Today, in unity with Tiannei and the Six Ji, dare any oppose? Tiannei shall not be restrained.”\n\nFor the *jia-shen* cycle, the Jade Maiden is named Open Brightness, clad in white above and red below.\nFor the *jia-shen* cycle, the spirit-general is Tianchong, with the official Cheng Zi’en, a child of Tian Yi.\n“Today, in unity with Tianchong and the Six Geng, dare any oppose? Tianchong shall not be restrained.”\n\nFor the *jia-wu* cycle, the Jade Maiden is named Han Ying, clad in purple above and white below.",
      "overlap_context": "nd recite it three times—this is my method.\n\nUpon awakening the next day, invoke the names of the Four Seas’ spirits:\n- Spirit of the Eastern Sea: Aming\n- Spirit of the Western Sea: Zhouliang\n- Spirit of the Southern Sea: Jucheng\n- Spirit of the Northern Sea: Yuqiang\n\nThe great spirits of the Four Seas repel all ghosts, dispel misfortune, and swiftly obey the command!\n\nThe *Scripture of the Six Jia Spirits Enveloping the Body in the Secret Essentials of the Yellow Court’s Inner Radiance* states:",
      "start_char": 919,
      "end_char": 2169,
      "start_sentence": 42,
      "end_sentence": 96,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.1775062084198,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清黄庭养神经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "甲午旬，神将天辅，吏杜徐君，天一子也。 今日与天辅六辛同心，敢有当者，减辅不禁。 甲辰旬，玉女名婴台，上黄下青衣。 甲辰旬，神将天禽、吏公孙大君，天一子也。 今日与天禽六丁同心，敢有当者，灭禽不禁。 甲寅旬，玉女名登赴，上绛下红衣。 甲寅旬，神将天心，吏徐君望，天一子也。 今日与天心六戊同心，敢有当者，灭心不禁。 神符六甲旬，玉女六人，六丁玉女六人，旬吏六人，符吏六人。 已上，玉女旬吏二十四人。 甲子旬，玉女从神一百三十九人， 甲戌旬，玉女从神一百三十五人。 甲申旬，玉女从神一百三十一人。 甲午旬，玉女从神一百三十一人。 甲辰旬，玉女从神一百三十五人。 甲寅旬，玉女从神一百三十五人。 六甲兽士十二人。 六甲旬，将玉女旬吏符神，合九百六十六人。 子兽士，鼠头人身，持镶黑衣。 丑兽士，牛头人身，持舒黄衣。 寅兽士，虎头人身，持戟青衣。 卯兽士，兔头人身，持戟青衣。 辰兽士，龙头人身，持戟黄衣。 巳兽士，蛇头人身，持戟赤衣。 午兽士，马头人身，持戟赤衣。 未兽士，羊头人身，执戟黄衣。 申兽士，猴头人身，执戟白衣。 酉兽士，鹦头人身，持弩白衣。 戌兽士，狗头人身，持弩黄衣。 亥兽士，猜头人身，持镶黑衣。 已上符并用朱书。 六甲三金五龙六石室，九百六十卷，以此卷为诀。 知者度世，立致行厨，万邪不干，神无敢当，所以行攻破房庙，收鬼，治邪，救疗百病。 服六甲神符，役使万灵，不得危人自安，念行仁义，消灾度厄，必获仙道，与天相毕。 不入污秽为上。 若临丧产之家，服解秽符解之。 上清黄庭养神经竟",
      "translated_text": "For the *jia-wu* cycle, the spirit-general is Tianfu, with the official Du Xujun, a child of Tian Yi.\n“Today, in unity with Tianfu and the Six Xin, dare any oppose? Tianfu shall not be restrained.”\n\nFor the *jia-chen* cycle, the Jade Maiden is named Yingtai, clad in yellow above and green below.\nFor the *jia-chen* cycle, the spirit-general is Tianqin, with the official Gongsun Dajun, a child of Tian Yi.\n“Today, in unity with Tianqin and the Six Ding, dare any oppose? Tianqin shall not be restrained.”\n\nFor the *jia-yin* cycle, the Jade Maiden is named Dengfu, clad in green above and red below.\nFor the *jia-yin* cycle, the spirit-general is Tianxin, with the official Xu Junwang, a child of Tian Yi.\n“Today, in unity with Tianxin and the Six Wu, dare any oppose? Tianxin shall not be restrained.”\n\nThe divine talismans of the Six Jia cycles include six Jade Maidens, six Jade Maidens of the Six Ding, six cycle officials, and six talisman officials.\nIn total, there are twenty-four Jade Maidens and cycle officials.\n\nFor the *jia-zi* cycle, the Jade Maiden is accompanied by one hundred thirty-nine spirits.\nFor the *jia-xu* cycle, the Jade Maiden is accompanied by one hundred thirty-five spirits.\nFor the *jia-shen* cycle, the Jade Maiden is accompanied by one hundred thirty-one spirits.\nFor the *jia-wu* cycle, the Jade Maiden is accompanied by one hundred thirty-one spirits.\nFor the *jia-chen* cycle, the Jade Maiden is accompanied by one hundred thirty-five spirits.\nFor the *jia-yin* cycle, the Jade Maiden is accompanied by one hundred thirty-five spirits.\nThe Six Jia cycles include twelve beast-warriors.\n\nAcross the Six Jia cycles, the generals, Jade Maidens, cycle officials, and talisman spirits total nine hundred sixty-six.\n\nThe *zi* beast-warrior has a rat’s head and a human body, wielding a spear and clad in black.\nThe *chou* beast-warrior has an ox’s head and a human body, wielding a sword and clad in yellow.\nThe *yin* beast-warrior has a tiger’s head and a human body, wielding a halberd and clad in green.\nThe *mao* beast-warrior has a rabbit’s head and a human body, wielding a halberd and clad in green.\nThe *chen* beast-warrior has a dragon’s head and a human body, wielding a halberd and clad in yellow.\nThe *si* beast-warrior has a snake’s head and a human body, wielding a halberd and clad in red.\nThe *wu* beast-warrior has a horse’s head and a human body, wielding a halberd and clad in red.\nThe *wei* beast-warrior has a goat’s head and a human body, wielding a halberd and clad in yellow.\nThe *shen* beast-warrior has a monkey’s head and a human body, wielding a halberd and clad in white.\nThe *you* beast-warrior has a rooster’s head and a human body, wielding a crossbow and clad in white.\nThe *xu* beast-warrior has a dog’s head and a human body, wielding a crossbow and clad in yellow.\nThe *hai* beast-warrior has a boar’s head and a human body, wielding a spear and clad in black.\n\nAll talismans above are to be inscribed in vermilion.\n\nThe Six Jia comprise three metals, five dragons, and six stone chambers, totaling nine hundred sixty scrolls—this scroll serves as the key.\nThose who master it transcend the world, instantly summoning traveling kitchens. Myriad evils shall not encroach, and no spirit dare oppose. It is used to break into demonic shrines, capture ghosts, dispel malevolence, and heal all ailments.\nThose who wear the Six Jia divine talismans command ten thousand spirits, ensuring personal safety. Cultivating benevolence and righteousness dispels calamities and transcends misfortune, inevitably attaining the Dao and ascending to the heavens.\nAvoid defilement above all. If entering households of mourning or childbirth, wear the talisman to dissolve impurity.\n\nHere ends the *Shangqing Huangting Yangshen Jing*.",
      "overlap_context": "unity with Tiannei and the Six Ji, dare any oppose? Tiannei shall not be restrained.”\n\nFor the *jia-shen* cycle, the Jade Maiden is named Open Brightness, clad in white above and red below.\nFor the *jia-shen* cycle, the spirit-general is Tianchong, with the official Cheng Zi’en, a child of Tian Yi.\n“Today, in unity with Tianchong and the Six Geng, dare any oppose? Tianchong shall not be restrained.”\n\nFor the *jia-wu* cycle, the Jade Maiden is named Han Ying, clad in purple above and white below.",
      "start_char": 2169,
      "end_char": 2863,
      "start_sentence": 97,
      "end_sentence": 133,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.37952470779419,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清黄庭养神经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}