{
  "source_id": "上清琼宫灵飞六甲左右上符",
  "source_file": "chunked_daozang\\上清琼宫灵飞六甲左右上符.json",
  "total_chunks": 3,
  "total_original_chars": 3384,
  "total_translated_chars": 21435,
  "total_translation_time": 115.45861196517944,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\神符类\\上清琼宫灵飞六甲左右上符.txt",
    "category": "神符类"
  },
  "full_translation": "**The Upper Clarity Jade Palace Numinous Flight Six Jia Left and Right Superior Talismans**\n\n*Scripture Title:* The Upper Clarity Jade Palace Numinous Flight Six Jia Left and Right Superior Talismans. Also known as *The Upper Clarity Plain Memorial Cinnabar Talismans of Numinous Flight Six Jia*.\n\nAuthor unknown, approximately dating to the Eastern Jin. A key early scripture of the Upper Clarity tradition. One scroll.\n\n*Source Text:* *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Shenfu* Category.\n\n---\n\n**The Upper Clarity Jade Palace Numinous Flight Six Jia Left and Right Superior Talismans**\n\nThe Upper Clarity Jade Palace Numinous Flight Six Jia Jade Maidens, numbering sixty, bear names, designations, and the left and right superior talismans. The Supreme Ultimate Ninefold Upper August Supreme Ultimate Perfected received these from the Jade Dawn Great Dao Lord.\n\nThe left and right Numinous Flight Six Jia Talismans are also called *The Jade Essence True Formula*, *The Way Within the Radiance*, *The Hidden Travels of the White-Feathered Black-Winged Upper Scripture*, and *The Divine Way of Numinous Flight Six Jia*.\n\nThe deities of the Six Jia ride six dragons at times, feasting upon auspicious clouds, gazing upon the six directions, and descending to the bedchamber of those who ingest their talismans. On appointed days, they ride chariots drawn by white simurghs and black-winged phoenixes, feasting in the inverted radiance of Eternal Yang, surveying the divine peaks of the eight directions.\n\nWhen one ingests their talismans, body and self harmonize, hun and po unite, spirit and form commune. The Three Qi blend as incense, the Five Viscera bloom with splendor. One may sit in death or stand in life, command the myriad demons, tread upon blades and traverse peril. Ten thousand blessings converge in harmony. One may cross mountains and enter waters, traverse seas and ford rivers, unbound by bridges or fords, unafraid of perilous heights. One may transform and conceal, summon wind and call forth thunder, instantly raise clouds and rain, conjure traveling kitchens at will. Entering battle, one remains unharmed; entering water, one stays dry. Mountain spirits offer protection, Jade Maidens come to greet.\n\nAfter six years of ingestion, the Six Jia manifest in bodily form, speaking with the practitioner, bestowing true scriptures. One attains longevity coeval with Heaven and Earth, in harmony with the Two Images.\n\nOne must dwell apart, avoiding defilement and reckless desire. Still the heart, mirror the form—only then may one seek this attainment.\n\nThe Four Perfected of the Supreme Ultimate declare: The Six Qi circulate through the Ten Heavens; the Six Jia cycle through the hidden and dark. With these talismans, one may conceal and transform without limit. Hearing their names, one supplements the Heavenly Perfected. Practicing their Way, one soars through emptiness and rides the radiance. Wearing their script, Jade Maidens hold towels.\n\nAfter six years of use, the Azure Palace inscribes merit upon jade tablets, recording one’s name and designation. Myriad spirits offer protection; Perfected Ones visit one’s chamber.\n\nAfter fourteen years of practice, the Three Primordials of Grand Simplicity welcome one with feathered tablets of the Three Dawns, clothing one in a cloud cloak of purple auroras. One roams the Eight Effulgences by night and ascends the Tiger Chariot by day. Phoenix pipes sing, and the Dark Chime plays. Myriad spirits support one’s carriage, summoning wind and calling forth clouds. The Great One shares the reins; one ascends the Dawn in broad daylight.\n\nThe Numinous Flight Six Jia Left and Right Jade Maidens, numbering sixty in name and designation, appear thus: On each Jia day at dawn, face the kingly direction, close the eyes, and inwardly visualize the Jade Maidens of the Six Jia fortnight, all arrayed before you. Their attire and appearance are as described above. After a long while, knock the teeth six times, swallow saliva sixty times, then softly recite the incantation:\n\n*Left flight, right numen,*\n*Eight Effulgences’ radiant essence,*\n*Above, planted in the forest of jade,*\n*Below, blossoming with cinnabar and jasper.*\n*In harmony with the Eight Regulations,*\n*Governing the myriad sprouts.*\n*Through divine communion and accumulated resonance,*\n*The Six Qi refine and purify.*\n*Cloud officials and jade splendor,*\n*Riding emptiness, following life.*\n*Brocade cloaks and flying skirts,*\n*Auroras reflecting the purple chamber.*\n*Tiger-script waist sashes,*\n*Feathered tablets and azure banners.*\n*Hand-holding divine talismans,*\n*Flowing gold and fire bells.*\n*Dispelling evil, repelling demons,*\n*Preserving my integrity and fortune.*\n*Severing and restraining the myriad fiends,*\n*Ten thousand evils dissolved in peace.*\n*Roaming together in the Three Luminaries,*\n*Reversing age to return to infancy.*\n*Sitting in death, standing in life,*\n*Attending me, the Six Ding.*\n*Fierce beasts guard my body,*\n*Heavenly soldiers follow.*\n*Inhaling rivers, exhaling seas,*\n*Mountains and peaks flow and topple.*\n*Instantly conjuring traveling kitchens,*\n*Golden liquors and jade blossoms.*\n*Binding tigers and leopards,*\n*Roaring at the dark and hidden.*\n*Commanding ghosts and spirits,*\n*Subduing a thousand numina.*\n*All wishes follow the heart,*\n*Ten thousand affairs achieve success.*\n*Dispersing the Way, scattering the body,*\n*Transforming at will.*\n*Supplementing the Perfected Ones,*\n*Coeval with Heaven and Earth.*\n*Ears sharp, eyes bright,*\n*Penetrating vision of the Yellow Court.*\n*Six Jia Jade Maidens,*\n*Serve as my messengers.*\n\nWhen the incantation is complete, close the eyes. At the start of visualization, sit upright, place the hands upon the knees, and let no one see. If seen, the true radiance will not unify; thoughts will scatter and dissipate. Focus the mind unwaveringly, allowing no other thoughts. One must be cautious.\n\nBefore ingesting the talisman, first call the name of the Jade Maiden of the current day, then softly recite the incantation:\n\n*Heaven’s mystery, Earth’s yellow,*\n*Great Void’s Six Qi,*\n*At dawn, ingesting numinous essence,*\n*Divine gold and tiger script.*\n*May my Perfected self be thus,*\n*May my spirit be thus.*\n*Dispersing form and shadow,*\n*Sealing mountains, summoning spirits.*\n*Commanding the myriad gods,*\n*Sitting in death, standing in life.*\n*Soaring high in Upper Clarity,*\n*Northward audience with the Jade Dawn.*\n\nWhen the incantation is complete, ingest the talisman.\n\nThe essential true script of the talismans follows:\n\nAll talismans within the scroll are written in vermilion.\n\n**Jiazi:** Supreme Ultimate Jade Maiden, name *Numinous Pearl*, designation *Bearing Wings*.\n**Yichou:** Supreme Ultimate Jade Maiden, name *Simplicity Cultivation*, designation *Azure Sprout*.\n**Bingyin:** Supreme Ultimate Jade Maiden, name *Stabilizing Splendor*, designation *Luxuriant Mound*.\n**Dingmao:** Supreme Ultimate Jade Maiden, name *Beard Terrace*, designation *Fragrant Conduct*.\n**Wuchen:** Supreme Ultimate Jade Maiden, name *Cherishing Purity*, designation *Multitude of Pears*.\n**Jisi:** Supreme Ultimate Jade Maiden, name *Fourfold Purity*, designation *Tranquil Splendor*.\n**Gengwu:** Supreme Ultimate Jade Maiden, name *Gathering Countenance*, designation *Flowing South*.\n**Xinwei:** Supreme Ultimate Jade Maiden, name *Limpid Splendor*, designation *Embracing Pearl*.\n**Renshen:** Supreme Ultimate Jade Maiden, name *Double August*, designation *Phoenix Script*.\n**Guiyou:** Supreme Ultimate Jade Maiden, name *Dragon Infant*, designation *Joyous Life*.\n\n*Above: Left Numinous Flight Jade Maidens of the Supreme Ultimate Palace of Jiazi.*\n\nThe Jade Maidens wear dark brocade robes, azure silk skirts of flying splendor, and hold spirit-tiger talismans of jade essence. The rest may be adapted as appropriate.\n\n**Jiaxu:** Yellow Simplicity Jade Maiden, name *Divine Radiance*, designation *Flying Health*.\n**Yihai:** Yellow Simplicity Jade Maiden, name *Purple Spring*, designation *Flying Mushroom*.\n\n**Bingzi:** Yellow Simplicity Jade Maiden, name *Lodging Wind*, designation *Joined Fullness*.\n**Dingchou:** Yellow Simplicity Jade Maiden, name *Phoenix Ring*, designation *Lush Beauty*.\n**Wuyin:** Yellow Simplicity Jade Maiden, name *Shu Hua*, designation *Supreme Countenance*.\n**Jimao:** Yellow Simplicity Jade Maiden, name *Flourishing Mystery*, designation *Feathered Pearl*.\n**Gengchen:** Yellow Simplicity Jade Maiden, name *Rightful Age*, designation *Spring Fragrance*.\n**Xinsi:** Yellow Simplicity Jade Maiden, name *Luxuriant Soaring*, designation *Carved Silk*.\n**Renwu:** Yellow Simplicity Jade Maiden, name *Graceful Chariot*, designation *Thousand Achievements*.\n**Guiwei:** Yellow Simplicity Jade Maiden, name *Good Camp*, designation *Beauty Prospering*.\n\n*Above: Jiaxu Yellow Simplicity Palace Left Numinous Flight Jade Maidens.*\n\nThe Jade Maidens wear azure robes and crimson skirts, with cyan, red, and yellow cloud-sashes, vermilion shoes, and hold green jade spirit talismans. The rest may be adapted as appropriate.\n\n**Jiashen:** Supreme Simplicity Jade Maiden, name *True Origin*, designation *Jasper Stone*.\n**Yiyou:** Supreme Simplicity Jade Maiden, name *Misty Orchid*, designation *Jade Bloom*.\n**Bingxu:** Supreme Simplicity Jade Maiden, name *Beauty Mystery*, designation *Harmonious Radiance*.\n**Dinghai:** Supreme Simplicity Jade Maiden, name *Rising Chamber*, designation *Lucid Splendor*.\n**Wuzi:** Supreme Simplicity Jade Maiden, name *Soaring Peak*, designation *Steadfast Brilliance*.\n**Jichou:** Supreme Simplicity Jade Maiden, name *Mist Child*, designation *Recumbent Marvel*.\n**Gengyin:** Supreme Simplicity Jade Maiden, name *Seven Wheels*, designation *Numinous Flight*.\n**Xinmao:** Supreme Simplicity Jade Maiden, name *Commencing Terrace*, designation *Spreading Chapters*.\n**Renchen:** Supreme Simplicity Jade Maiden, name *Luxuriant Gold*, designation *Cinnabar Banner*.\n**Guisi:** Supreme Simplicity Jade Maiden, name *Peaceful Heaven*, designation *Sand Wind*.\n\n*Above: Jiashen Supreme Simplicity Palace Left Numinous Flight Jade Maidens.*\n\nThe Jade Maidens wear green robes and crimson skirts, with cyan and red cloud-sashes, cyan shoes, and hold green jade spirit talismans. The rest may be adapted as appropriate.\n\n**Jiawu:** Crimson Palace Jade Maiden, name *Cinnabar Purity*, designation *Cloud Age*.\n**Yiwei:** Crimson Palace Jade Maiden, name *Scattered Sun*, designation *Numinous Splendor*.\n**Bingshen:** Crimson Palace Jade Maiden, name *Attaining Essence*, designation *Mystic Pearl*.\n**Dingyou:** Crimson Palace Jade Maiden, name *Embracing Cloud*, designation *Green Leisure*.\n**Wuxu:** Crimson Palace Jade Maiden, name *Chamber Guest*, designation *Stone Fragrance*.\n**Jihai:** Crimson Palace Jade Maiden, name *Pure Flourishing*, designation *Southern Numinous*.\n**Gengzi:** Crimson Palace Jade Maiden, name *Numinous Flock*, designation *Curved Ascent*.\n**Xinchou:** Crimson Palace Jade Maiden, name *Plain Beauty*, designation *Initiating Clarity*.\n**Renyin:** Crimson Palace Jade Maiden, name *Fen Hua*, designation *Luxuriant Mushroom*.\n**Guimao:** Crimson Palace Jade Maiden, name *Radiant Flourishing*, designation *Western Peace*.\n\n*Above: Jiawu Crimson Palace Right Numinous Flight Jade Maidens.*\n\nThe Jade Maidens wear pale red robes and cyan skirts, with cyan and red cloud-sashes, hold green jade spirit talismans in hand, and wear vermilion shoes. The rest may be adapted as appropriate.\n\n**Jiachen:** Worship Essence Jade Maiden, name *Dragon Wish*, designation *Numinous Simplicity*.\n**Yisi:** Worship Essence Jade Maiden, name *Joyful Court*, designation *Leisure Terrace*.\n**Bingwu:** Worship Essence Jade Maiden, name *Cultivating Mushroom*, designation *Jade Birth*.\n**Dingwei:** Worship Essence Jade Maiden, name *Beckoning Wind*, designation *Constant Beauty*.\n**Wushen:** Worship Essence Jade Maiden, name *Night Splendor*, designation *Cloud Infant*.\n**Jiyou:** Worship Essence Jade Maiden, name *Secret Radiance*, designation *Victorious Nonbeing*.\n**Gengxu:** Worship Essence Jade Maiden, name *Purple Void*, designation *Containing Ring*.\n**Xinhai:** Worship Essence Jade Maiden, name *Phoenix Splendor*, designation *Green Peace*.\n**Renzi:** Worship Essence Jade Maiden, name *Proper Chamber*, designation *Supreme Marvel*.\n**Guichou:** Worship Essence Jade Maiden, name *Treasure Splendor*, designation *Sole Illumination*.\n\n*Above: Jiachen Worship Essence Palace Right Numinous Flight Jade Maidens.*\n\nThe Jade Maidens wear yellow robes and pale cyan skirts, with cyan and red cloud-sashes, vermilion shoes, and hold green jade spirit talismans. The rest may be adapted as appropriate.\n\n**Jiayin:** Azure Essence Jade Maiden, name *Initiating First*, designation *Kind Essence*.\n**Yimao:** Azure Essence Jade Maiden, name *Celebrating Soaring*, designation *Beauty Birth*.\n**Bingchen:** Azure Essence Jade Maiden, name *Hidden Prosperity*, designation *Morning Radiance*.\n**Dingsi:** Azure Essence Jade Maiden, name *Subduing Splendor*, designation *Vast Spreading*.\n**Wuwu:** Azure Essence Jade Maiden, name *Green Cloud*, designation *Peaceful Prosperity*.\n**Jiwei:** Azure Essence Jade Maiden, name *Golden Sound*, designation *Curved Terrace*.\n**Gengshen:** Azure Essence Jade Maiden, name *Whirlwind Roaming*, designation *Cloud Flight*.\n**Xinyou:** Azure Essence Jade Maiden, name *Intimate Worthies*, designation *Lofty Flourishing*.\n**Renxu:** Azure Essence Jade Maiden, name *Spirit Pearl*, designation *Piercing Host*.\n**Guihai:** Azure Essence Jade Maiden, name *Cloud Lingering*, designation *Embracing Birth*.\n\n*Above: Jiayin Azure Essence Palace Numinous Flight Jade Maidens.*\n\nThe Jade Maidens wear purple brocade capes and vermilion-cyan flying splendor skirts, and hold jade-essence golden tiger talismans. The rest may be adapted as appropriate.\n\n**Upper Talisman of the Supreme Ultimate Jade Essence True Formula**\nThis talisman is first ingested on the *jiazi* day, then again on the second day. One is taken at dawn by men, and another at midday on the eight seasonal nodes.\n\n**Upper Talisman of the Supreme Ultimate Jade Essence True Formula**\nThis talisman is first ingested on the *yichou* day, then again on the second day. One is taken at dawn by women, and another at midnight on the eight seasonal nodes.\n\nThe above two talismans are the ancestral talismans of the Numinous Flight Six *Jia* system. To ingest them, first observe a six-day purification, then proceed. After sixty days of ingestion, one may then ingest the sixty Jade Maiden talismans. These two talismans govern the summoning of spirits and deities, the communication with the myriad essences. With continuous ingestion and no neglect, one attains flying transcendence and everlasting life. Having ingested the sixty Jade Maiden talismans, one must therefore cultivate these talismans in tandem.\n\nMen and women officials should use them according to their respective names. Avoid impurity, passing through homes of the dead, sharing beds with others, lending clothing, consuming the five pungent foods and the meat of the six livestock, and especially approaching women—these defilements cause the spirit to perish and the soul to scatter, giving rise to deviance and loss of nature, inviting calamity upon the three *qi*, and resulting in death as a lowly ghost. Always burn incense at the head of one’s sleeping quarters.\n\nThe *Jiazi* Jade Maidens of the Supreme Ultimate Palace all wear upper dark brocade capes and lower azure silk flying splendor skirts. The *Jiaxu* Jade Maidens of the Yellow Simplicity Palace all wear yellow brocade capes and purple silk flying feather skirts. The *Jiashen* Jade Maidens of the Supreme Simplicity Palace all wear white brocade capes and red silk flying splendor skirts.\n\nThe Left and Right Numinous Flight Jade Maidens’ attire and accoutrements: all hold jade-essence spirit-tiger talismans in hand, and wear their hair in three-cornered cloud buns with the rest left loose to the waist.\n\nThe Crimson Palace *Jiawu* Jade Maidens, one cohort, all wear cinnabar brocade capes and azure silk flying skirts. The Purple Essence Palace *Jiachen* Jade Maidens, one cohort, all wear purple brocade capes and jade-green silk flying skirts. The Azure Pivot Palace *Jiayin* Jade Maidens, one cohort, all wear purple brocade capes and cinnabar-azure flying feather skirts. The Right and Left Numinous Flight Jade Maidens’ attire: all hold jade-essence golden-tiger talismans in hand, and wear their hair in three-cornered cloud buns with the rest left loose to the waist.\n\nThese sixty-two talismans were received by the Four Perfected of the Supreme Ultimate Upper Palace from the Most High Lord of the Dao. Those who receive them must maintain strict precepts and purify the heart, washing away the five defilements and impure thoughts, severing the faults of worldly filth and lustful desires. With upright gaze, they visualize the six essences; with concentrated thought, they perceive the fragrant smoke of jade perfected ones filling the chamber. Secluded in a solitary room, they accumulate virtue and merit, harmonize the *po* and preserve the center, faintly emulating the five spirits as they wander through the Three Palaces. Cutting off competition with the common crowd, they guard stillness and silence to achieve resonance. Thus, the spirits of the Six *Jia* will descend to them within a year.\n\nIf one can cultivate this Dao with utmost dedication, one will surely ascend as an immortal. Those who believe and uphold it become numinous beings; those who disbelieve will sink into the Nine Springs. The Dao of the Six *Jia*’s Numinous Radiance must be transmitted only to those of utmost purity and perfection, for only then will resonance and descent occur.\n\nThe Perfected of Nine Peaks, Xu Weiyuan, once received this method from Song Dexuan of Mount Song. Dexuan, a man of the reign of King Xuan of Zhou, practiced the Numinous Flight Six *Jia* Talismans, attained the Dao, and could travel three thousand *li* in a day. He could transform his shape into birds and beasts, mastering the Dao of the true and numinous. He now resides on Mount Song. Weiyuan followed him for a long time and thus received this method. After achieving the Dao through its practice, he now dwells on Mount Jiuyi.\n\nWomen such as Guo Shaoyao, Zhao Aier, and Wang Lulian also received this method and attained the Dao. Several dozen others did likewise, some wandering the Dark Continent, others residing on the Eastern Florescence Terrace of Square Cauldron Mountain, where they now dwell. The Lady Wei of Mount Nanyue said: This Guo Shaoyao was the daughter of Guo Qian, the Han Dynasty General Who Pacified the Liao. From youth, she was devoted to the Dao with utmost sincerity, and the Perfected One thus transmitted the Six *Jia* arts to her. Zhao Aier was the wife of Liu Yu, Prefect of Youzhou, and the elder sister of Zhao Gai, Vice Prefect. Fond of the Dao, she attained liberation from the corpse and later received these talismans. Wang Lulian was the daughter of Wang Bozhou, City Gate Commandant of Wei Emperor Wen, and a princess of Fanling. She too studied the Dao. One day, she suddenly departed, leaving her husband, Li Ziqī, to enter Mount Luhun. The Perfected One then transmitted this method to Ziqī, who was the tutor of the Prince of Qinghe under the Sima Wei regime. He often spoke of this woman’s erratic behavior, saying she vanished one day without a trace.\n\nThe Hidden Retreat of the Numinous Flight of the Six *Jia* of the Upper Clarity Jade Palace: those who ingest these true talismans may wander the eight directions. Those who practice this true scripture must find the right person. According to the *Bright Statutes of the Four Poles*, those who transmit the inner scriptures of Upper Clarity must first take oaths and make pledges before revealing them. Every seven hundred years, they may be passed to six individuals. Once the time limit is reached, they may no longer be disseminated.\n\nThose who receive the transmission must fast for seven days, offering incense and pledges to a master who possesses the scriptures. They must present six *liang* of gold, sixty feet of white silk, six pairs of gold rings, six *liang* of green silk thread, and twenty-two feet each of five-colored silks. These serve as substitutes for the rites of cutting hair, ascending the altar, blood-oaths, and breaking contracts, sealing the vow to uphold the numinous talismans and the pledge to keep the jade names secret. Should one violate the oath and betray the pledge, one’s seven generations of ancestors and oneself will suffer the trials of the Wind Blade, be consigned to the River of Accumulated Nights, and bear the stones of Mount Meng to fill the Meng Ford.\n\nMasters who possess the scriptures and receive the ritual offerings must distribute them to the cold, destitute, poor, orphaned, sick, elderly, weak, and infirm. They may not use them for themselves alone. Should they violate these statutes, the Three Officials will record and examine their transgressions, and they will die as lowly ghosts. One must revere and be cautious of this.\n\nThe Upper Talismans of the Left and Right Numinous Flight of the Six *Jia* of the Upper Clarity Jade Palace #1: *Dispel Lustful Desires* (likely intended as *Dispel Lust and Forget Desires*).",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清琼宫灵飞六甲左右上符 经名：上清琼宫灵飞六甲左右上符。 又名《上清素奏丹符灵飞六甲》。 撰人不详，约出於东晋。 系早期上清派重要经典。 一卷。 底本出处：《正统道藏》洞真部神符类。 上清琼宫灵飞六甲左右上符 上清琼宫灵飞六甲玉女六十人，讳字并左右上符，太极九部上皇太极真人受之於玉晨大道君。 左右灵飞六甲符，一名玉精真诀，一名景中之道，一名白羽黑翮隐游上经，灵飞六甲神道也。 六甲之神时乘六龙，以宴庆云，盻看六合，回降服符者寝房也。 其以节日，又乘白鸾之车，驾黑翮之凤，以宴常阳倒景，看游八方之神岳也。 降服符者身，和合魂魄，通灵达形，三气合香，五藏生华，坐在立亡，役召万魔，履锋蹈崄，万福来和，涉山入水，沿海步河，不拘津梁，不畏危巅，变化隐遁，招风召雷，立起云雨，坐致行厨，入兵不伤，入水不濡，山神奉卫，玉女来迎。 服之六年，六甲见躯，与人语言，授子真书，长生天地，二象同符。 别寝勿杂，遗淫妄欲#1，寂心镜形，乃可见求。 太极四真人曰：六气顺运於十天，六甲旬周行於幽冥，有其符则隐化无方，闻其名则上补天真，行其道则飞虚驾景，佩其文则玉女执巾。 用之六年，方诸青宫刊功玉简，书名录字，万神奉卫，真人造房。 行之十四年，太素三元君迎以三晨之羽节，衣以紫霞之云帔，夕游八景，朝登虎舆，唱以凤吹，乐以玄钧，万神扶轩，摄风召云，太一参辔，白日登晨。 六甲灵飞左右玉女，名字六十人，每至甲日平旦，向王方闭目内视，存六甲一旬之玉女，尽来罗立我前，衣服形色如上，良久毕，乃叩齿六通，咽液六十过，毕，而微咒曰： 左飞右灵，八景华精，上植琳房，下秀丹琼，合度八纪，摄御万萌，神通积感，六气练清，云官玉华，乘虚顺生，锦帔飞裙，霞映紫房，腰带虎书，给羽建青，手执神符，流金火铃，挥邪却魔，保我利贞，剖勒众妖，万恶泯平，同游三光，回老返婴，坐在立亡，侍我六丁，猛兽卫身，从以天兵，呼吸江河，山岳流倾，卒致行厨，金醴玉英，收束虎豹，叱咤幽冥，役使鬼神，摄伏千精，所愿从心，万事克成，分道散躯，恣意化形，上补真人，天地同生，耳 聪目明，彻视黄庭，六甲玉女，为我使令。 咒毕，闭目，初存思之时，当平坐，按手於膝上，勿令人见，见则真光不一，思虑荡散，念念在心，不得他想，当须慎之。 临服符，当先呼直日玉女名，毕，微咒曰： 天玄地黄，太虚六气，朝服灵精，神金虎文，当令我真，又令我神，分散形影，封山召灵，役使万神，坐亡立存，高游上清，北朝玉晨。 咒毕，乃服符。 符文真要如左： 卷内符并朱书。 甲子太玄玉女名灵珠，字承翼。 乙丑太玄玉女名简修，字青萌。 丙寅太玄玉女名定华，字郁陵。 丁卯太玄玉女名须台，字馥猷。 戊辰太玄玉女名爱淳，字众梨。 己巳太玄玉女名四淳，字宁华。 庚午太玄玉女名会容，字流南。 辛未太玄玉女名澄华，字抱珠。 壬申太玄玉女名双皇，字凤文。 癸酉太玄玉女名龙婴，字欢生。 右甲子太玄宫左灵飞玉女部。 玉女玄锦被，青罗飞华裙，捧玉精神虎符，余取宜。 甲戌黄素玉女名神光，字飞康。 乙亥黄素玉女名紫春，字飞芝。",
      "translated_text": "**The Upper Clarity Jade Palace Numinous Flight Six Jia Left and Right Superior Talismans**\n\n*Scripture Title:* The Upper Clarity Jade Palace Numinous Flight Six Jia Left and Right Superior Talismans. Also known as *The Upper Clarity Plain Memorial Cinnabar Talismans of Numinous Flight Six Jia*.\n\nAuthor unknown, approximately dating to the Eastern Jin. A key early scripture of the Upper Clarity tradition. One scroll.\n\n*Source Text:* *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Shenfu* Category.\n\n---\n\n**The Upper Clarity Jade Palace Numinous Flight Six Jia Left and Right Superior Talismans**\n\nThe Upper Clarity Jade Palace Numinous Flight Six Jia Jade Maidens, numbering sixty, bear names, designations, and the left and right superior talismans. The Supreme Ultimate Ninefold Upper August Supreme Ultimate Perfected received these from the Jade Dawn Great Dao Lord.\n\nThe left and right Numinous Flight Six Jia Talismans are also called *The Jade Essence True Formula*, *The Way Within the Radiance*, *The Hidden Travels of the White-Feathered Black-Winged Upper Scripture*, and *The Divine Way of Numinous Flight Six Jia*.\n\nThe deities of the Six Jia ride six dragons at times, feasting upon auspicious clouds, gazing upon the six directions, and descending to the bedchamber of those who ingest their talismans. On appointed days, they ride chariots drawn by white simurghs and black-winged phoenixes, feasting in the inverted radiance of Eternal Yang, surveying the divine peaks of the eight directions.\n\nWhen one ingests their talismans, body and self harmonize, hun and po unite, spirit and form commune. The Three Qi blend as incense, the Five Viscera bloom with splendor. One may sit in death or stand in life, command the myriad demons, tread upon blades and traverse peril. Ten thousand blessings converge in harmony. One may cross mountains and enter waters, traverse seas and ford rivers, unbound by bridges or fords, unafraid of perilous heights. One may transform and conceal, summon wind and call forth thunder, instantly raise clouds and rain, conjure traveling kitchens at will. Entering battle, one remains unharmed; entering water, one stays dry. Mountain spirits offer protection, Jade Maidens come to greet.\n\nAfter six years of ingestion, the Six Jia manifest in bodily form, speaking with the practitioner, bestowing true scriptures. One attains longevity coeval with Heaven and Earth, in harmony with the Two Images.\n\nOne must dwell apart, avoiding defilement and reckless desire. Still the heart, mirror the form—only then may one seek this attainment.\n\nThe Four Perfected of the Supreme Ultimate declare: The Six Qi circulate through the Ten Heavens; the Six Jia cycle through the hidden and dark. With these talismans, one may conceal and transform without limit. Hearing their names, one supplements the Heavenly Perfected. Practicing their Way, one soars through emptiness and rides the radiance. Wearing their script, Jade Maidens hold towels.\n\nAfter six years of use, the Azure Palace inscribes merit upon jade tablets, recording one’s name and designation. Myriad spirits offer protection; Perfected Ones visit one’s chamber.\n\nAfter fourteen years of practice, the Three Primordials of Grand Simplicity welcome one with feathered tablets of the Three Dawns, clothing one in a cloud cloak of purple auroras. One roams the Eight Effulgences by night and ascends the Tiger Chariot by day. Phoenix pipes sing, and the Dark Chime plays. Myriad spirits support one’s carriage, summoning wind and calling forth clouds. The Great One shares the reins; one ascends the Dawn in broad daylight.\n\nThe Numinous Flight Six Jia Left and Right Jade Maidens, numbering sixty in name and designation, appear thus: On each Jia day at dawn, face the kingly direction, close the eyes, and inwardly visualize the Jade Maidens of the Six Jia fortnight, all arrayed before you. Their attire and appearance are as described above. After a long while, knock the teeth six times, swallow saliva sixty times, then softly recite the incantation:\n\n*Left flight, right numen,*\n*Eight Effulgences’ radiant essence,*\n*Above, planted in the forest of jade,*\n*Below, blossoming with cinnabar and jasper.*\n*In harmony with the Eight Regulations,*\n*Governing the myriad sprouts.*\n*Through divine communion and accumulated resonance,*\n*The Six Qi refine and purify.*\n*Cloud officials and jade splendor,*\n*Riding emptiness, following life.*\n*Brocade cloaks and flying skirts,*\n*Auroras reflecting the purple chamber.*\n*Tiger-script waist sashes,*\n*Feathered tablets and azure banners.*\n*Hand-holding divine talismans,*\n*Flowing gold and fire bells.*\n*Dispelling evil, repelling demons,*\n*Preserving my integrity and fortune.*\n*Severing and restraining the myriad fiends,*\n*Ten thousand evils dissolved in peace.*\n*Roaming together in the Three Luminaries,*\n*Reversing age to return to infancy.*\n*Sitting in death, standing in life,*\n*Attending me, the Six Ding.*\n*Fierce beasts guard my body,*\n*Heavenly soldiers follow.*\n*Inhaling rivers, exhaling seas,*\n*Mountains and peaks flow and topple.*\n*Instantly conjuring traveling kitchens,*\n*Golden liquors and jade blossoms.*\n*Binding tigers and leopards,*\n*Roaring at the dark and hidden.*\n*Commanding ghosts and spirits,*\n*Subduing a thousand numina.*\n*All wishes follow the heart,*\n*Ten thousand affairs achieve success.*\n*Dispersing the Way, scattering the body,*\n*Transforming at will.*\n*Supplementing the Perfected Ones,*\n*Coeval with Heaven and Earth.*\n*Ears sharp, eyes bright,*\n*Penetrating vision of the Yellow Court.*\n*Six Jia Jade Maidens,*\n*Serve as my messengers.*\n\nWhen the incantation is complete, close the eyes. At the start of visualization, sit upright, place the hands upon the knees, and let no one see. If seen, the true radiance will not unify; thoughts will scatter and dissipate. Focus the mind unwaveringly, allowing no other thoughts. One must be cautious.\n\nBefore ingesting the talisman, first call the name of the Jade Maiden of the current day, then softly recite the incantation:\n\n*Heaven’s mystery, Earth’s yellow,*\n*Great Void’s Six Qi,*\n*At dawn, ingesting numinous essence,*\n*Divine gold and tiger script.*\n*May my Perfected self be thus,*\n*May my spirit be thus.*\n*Dispersing form and shadow,*\n*Sealing mountains, summoning spirits.*\n*Commanding the myriad gods,*\n*Sitting in death, standing in life.*\n*Soaring high in Upper Clarity,*\n*Northward audience with the Jade Dawn.*\n\nWhen the incantation is complete, ingest the talisman.\n\nThe essential true script of the talismans follows:\n\nAll talismans within the scroll are written in vermilion.\n\n**Jiazi:** Supreme Ultimate Jade Maiden, name *Numinous Pearl*, designation *Bearing Wings*.\n**Yichou:** Supreme Ultimate Jade Maiden, name *Simplicity Cultivation*, designation *Azure Sprout*.\n**Bingyin:** Supreme Ultimate Jade Maiden, name *Stabilizing Splendor*, designation *Luxuriant Mound*.\n**Dingmao:** Supreme Ultimate Jade Maiden, name *Beard Terrace*, designation *Fragrant Conduct*.\n**Wuchen:** Supreme Ultimate Jade Maiden, name *Cherishing Purity*, designation *Multitude of Pears*.\n**Jisi:** Supreme Ultimate Jade Maiden, name *Fourfold Purity*, designation *Tranquil Splendor*.\n**Gengwu:** Supreme Ultimate Jade Maiden, name *Gathering Countenance*, designation *Flowing South*.\n**Xinwei:** Supreme Ultimate Jade Maiden, name *Limpid Splendor*, designation *Embracing Pearl*.\n**Renshen:** Supreme Ultimate Jade Maiden, name *Double August*, designation *Phoenix Script*.\n**Guiyou:** Supreme Ultimate Jade Maiden, name *Dragon Infant*, designation *Joyous Life*.\n\n*Above: Left Numinous Flight Jade Maidens of the Supreme Ultimate Palace of Jiazi.*\n\nThe Jade Maidens wear dark brocade robes, azure silk skirts of flying splendor, and hold spirit-tiger talismans of jade essence. The rest may be adapted as appropriate.\n\n**Jiaxu:** Yellow Simplicity Jade Maiden, name *Divine Radiance*, designation *Flying Health*.\n**Yihai:** Yellow Simplicity Jade Maiden, name *Purple Spring*, designation *Flying Mushroom*.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1282,
      "start_sentence": 0,
      "end_sentence": 40,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.07516169548035,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\神符类\\上清琼宫灵飞六甲左右上符.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "丙子黄素玉女名寄风，字参盈。 丁丑黄素玉女名凤环，字郁娥。 戊寅黄素玉女名叔华，字上容。 己卯黄素玉女名英玄，字羽珠。 庚辰黄素玉女名正龄，字春香。 辛巳黄素玉女名蔚腾，字雕罗。 壬午黄素玉女名琬御，字千成。 癸未黄素玉女名良营，字娥昌。 右甲戌黄素宫左灵飞玉女部。 玉女青衣绛裙，青红黄霞绶，朱履，捧绿玉神符，余取宜。 甲申太素玉女名真元，字琼石。 乙酉太素玉女名萧兰，字玉英。 丙戌太素玉女名娥玄，字和明。 丁亥太素玉女名兴房，字渌华。 戊子太素玉女名翔峰，字定睴。 己丑太素玉女名烟童，字偃殊。 庚寅太素玉女名七轮，字灵飞。 辛卯太素玉女名肇台，字篇敷。 壬辰太素玉女名蔚金，字丹旗。 癸巳太素玉女名安天，字沙风。 右甲申太素宫左灵飞玉女部。 玉女绿衣绛裙，青红霞绶，青履，捧绿玉神符，余取宜。 甲午绛宫玉女名丹淳，字云龄。 乙未绛官玉女名散阳，字灵华。 丙申绛宫玉女名遂精，字玄珠。 丁酉绛宫玉女名抱云，字绿闲。 戊戌绛宫玉女名房宾，字石香 已亥绛宫玉女名清英，字南灵。 庚子绛宫玉女名灵群。 字曲登。 辛丑绛宫玉女名素美，字启清。 壬寅绛宫玉女名汾华，字蔚芝。 癸卯绛宫玉名矅英，字西安。 右甲午绛宫右灵飞玉女部。 玉女浅红衣，青裙，青红霞绶，手托绿玉神符，朱履，余取宜。 甲辰拜精玉女名龙愿，字灵素。 乙巳拜精玉女名欢庭，字逸台。 丙午拜精玉女名营芝字玉生。 丁未拜精玉女名招风，字常娥。 戊申拜精玉女名夜华，字云婴。 己酉拜精玉女名密明，字胜非。 庚戌拜精玉女名紫虚，字容镮。 辛亥拜精玉女名凤华，字绿安。 壬子拜精玉女名仪房，字上奇。 癸丑拜精玉女名宝华，字壹昭。 右甲辰拜精宫右灵飞玉女部。 玉女黄衣，浅青裙，青红霞绶，朱履，持绿玉神符，余取宜。 甲寅青要玉女名启先，字惠精。 乙卯青要玉女名庆翔，字娥生。 丙辰青要玉女名幽昌，字晨晖。 丁巳青要玉女名伏华，字广敷。 戊午青要玉女名绿云，字安昌。 己未青要玉女名金声，字曲台。 庚申青要玉女名飙游，字云飞。 辛酉青要玉女名亲贤，字高英。 壬戌青要玉女名神珠，字贯众。 癸亥青要玉女名云徊，字抱生。 右甲寅青要官灵飞玉女部。 玉女紫锦帔，下丹青飞华裙，持玉精金虎符，余取宜。 太极玉精真诀上符 右符以甲子日始二日服，一以平旦男，八节日日中又服之。 太极玉精真诀上符 右符以乙丑日始二日服，一以平旦女服，八节日夜半又服之。 上二符，是灵飞六甲之符宗也。 欲服符，先斋六日，乃服。 服之六十日，乃得服六十玉女符也。 此二符主招神灵，通达万精，长服不废，飞仙长生。 既服六十玉女符，故当须此符兼修之也。 男女官各随名而用，忌殗秽、经死丧之家，不得与人同床寝卧，衣服不假借人，禁食五辛及六畜肉，及接近妇人，尤禁之甚，令人神丧魄亡，生邪失性，灾及三气，死为下鬼。 常烧香於寝林之首。 太玄宫甲子玉女一部，同服上玄锦帔、下青罗飞华裙。 黄素宫甲戌玉女一部，同服黄锦帔，紫罗飞羽之裙。 太素宫甲申玉女一部，同服白锦帔，丹罗飞华裙。 左右灵飞玉女服色，手中并执玉精神虎符，头并颓云三角髻，余发散垂至腰。",
      "translated_text": "**Bingzi:** Yellow Simplicity Jade Maiden, name *Lodging Wind*, designation *Joined Fullness*.\n**Dingchou:** Yellow Simplicity Jade Maiden, name *Phoenix Ring*, designation *Lush Beauty*.\n**Wuyin:** Yellow Simplicity Jade Maiden, name *Shu Hua*, designation *Supreme Countenance*.\n**Jimao:** Yellow Simplicity Jade Maiden, name *Flourishing Mystery*, designation *Feathered Pearl*.\n**Gengchen:** Yellow Simplicity Jade Maiden, name *Rightful Age*, designation *Spring Fragrance*.\n**Xinsi:** Yellow Simplicity Jade Maiden, name *Luxuriant Soaring*, designation *Carved Silk*.\n**Renwu:** Yellow Simplicity Jade Maiden, name *Graceful Chariot*, designation *Thousand Achievements*.\n**Guiwei:** Yellow Simplicity Jade Maiden, name *Good Camp*, designation *Beauty Prospering*.\n\n*Above: Jiaxu Yellow Simplicity Palace Left Numinous Flight Jade Maidens.*\n\nThe Jade Maidens wear azure robes and crimson skirts, with cyan, red, and yellow cloud-sashes, vermilion shoes, and hold green jade spirit talismans. The rest may be adapted as appropriate.\n\n**Jiashen:** Supreme Simplicity Jade Maiden, name *True Origin*, designation *Jasper Stone*.\n**Yiyou:** Supreme Simplicity Jade Maiden, name *Misty Orchid*, designation *Jade Bloom*.\n**Bingxu:** Supreme Simplicity Jade Maiden, name *Beauty Mystery*, designation *Harmonious Radiance*.\n**Dinghai:** Supreme Simplicity Jade Maiden, name *Rising Chamber*, designation *Lucid Splendor*.\n**Wuzi:** Supreme Simplicity Jade Maiden, name *Soaring Peak*, designation *Steadfast Brilliance*.\n**Jichou:** Supreme Simplicity Jade Maiden, name *Mist Child*, designation *Recumbent Marvel*.\n**Gengyin:** Supreme Simplicity Jade Maiden, name *Seven Wheels*, designation *Numinous Flight*.\n**Xinmao:** Supreme Simplicity Jade Maiden, name *Commencing Terrace*, designation *Spreading Chapters*.\n**Renchen:** Supreme Simplicity Jade Maiden, name *Luxuriant Gold*, designation *Cinnabar Banner*.\n**Guisi:** Supreme Simplicity Jade Maiden, name *Peaceful Heaven*, designation *Sand Wind*.\n\n*Above: Jiashen Supreme Simplicity Palace Left Numinous Flight Jade Maidens.*\n\nThe Jade Maidens wear green robes and crimson skirts, with cyan and red cloud-sashes, cyan shoes, and hold green jade spirit talismans. The rest may be adapted as appropriate.\n\n**Jiawu:** Crimson Palace Jade Maiden, name *Cinnabar Purity*, designation *Cloud Age*.\n**Yiwei:** Crimson Palace Jade Maiden, name *Scattered Sun*, designation *Numinous Splendor*.\n**Bingshen:** Crimson Palace Jade Maiden, name *Attaining Essence*, designation *Mystic Pearl*.\n**Dingyou:** Crimson Palace Jade Maiden, name *Embracing Cloud*, designation *Green Leisure*.\n**Wuxu:** Crimson Palace Jade Maiden, name *Chamber Guest*, designation *Stone Fragrance*.\n**Jihai:** Crimson Palace Jade Maiden, name *Pure Flourishing*, designation *Southern Numinous*.\n**Gengzi:** Crimson Palace Jade Maiden, name *Numinous Flock*, designation *Curved Ascent*.\n**Xinchou:** Crimson Palace Jade Maiden, name *Plain Beauty*, designation *Initiating Clarity*.\n**Renyin:** Crimson Palace Jade Maiden, name *Fen Hua*, designation *Luxuriant Mushroom*.\n**Guimao:** Crimson Palace Jade Maiden, name *Radiant Flourishing*, designation *Western Peace*.\n\n*Above: Jiawu Crimson Palace Right Numinous Flight Jade Maidens.*\n\nThe Jade Maidens wear pale red robes and cyan skirts, with cyan and red cloud-sashes, hold green jade spirit talismans in hand, and wear vermilion shoes. The rest may be adapted as appropriate.\n\n**Jiachen:** Worship Essence Jade Maiden, name *Dragon Wish*, designation *Numinous Simplicity*.\n**Yisi:** Worship Essence Jade Maiden, name *Joyful Court*, designation *Leisure Terrace*.\n**Bingwu:** Worship Essence Jade Maiden, name *Cultivating Mushroom*, designation *Jade Birth*.\n**Dingwei:** Worship Essence Jade Maiden, name *Beckoning Wind*, designation *Constant Beauty*.\n**Wushen:** Worship Essence Jade Maiden, name *Night Splendor*, designation *Cloud Infant*.\n**Jiyou:** Worship Essence Jade Maiden, name *Secret Radiance*, designation *Victorious Nonbeing*.\n**Gengxu:** Worship Essence Jade Maiden, name *Purple Void*, designation *Containing Ring*.\n**Xinhai:** Worship Essence Jade Maiden, name *Phoenix Splendor*, designation *Green Peace*.\n**Renzi:** Worship Essence Jade Maiden, name *Proper Chamber*, designation *Supreme Marvel*.\n**Guichou:** Worship Essence Jade Maiden, name *Treasure Splendor*, designation *Sole Illumination*.\n\n*Above: Jiachen Worship Essence Palace Right Numinous Flight Jade Maidens.*\n\nThe Jade Maidens wear yellow robes and pale cyan skirts, with cyan and red cloud-sashes, vermilion shoes, and hold green jade spirit talismans. The rest may be adapted as appropriate.\n\n**Jiayin:** Azure Essence Jade Maiden, name *Initiating First*, designation *Kind Essence*.\n**Yimao:** Azure Essence Jade Maiden, name *Celebrating Soaring*, designation *Beauty Birth*.\n**Bingchen:** Azure Essence Jade Maiden, name *Hidden Prosperity*, designation *Morning Radiance*.\n**Dingsi:** Azure Essence Jade Maiden, name *Subduing Splendor*, designation *Vast Spreading*.\n**Wuwu:** Azure Essence Jade Maiden, name *Green Cloud*, designation *Peaceful Prosperity*.\n**Jiwei:** Azure Essence Jade Maiden, name *Golden Sound*, designation *Curved Terrace*.\n**Gengshen:** Azure Essence Jade Maiden, name *Whirlwind Roaming*, designation *Cloud Flight*.\n**Xinyou:** Azure Essence Jade Maiden, name *Intimate Worthies*, designation *Lofty Flourishing*.\n**Renxu:** Azure Essence Jade Maiden, name *Spirit Pearl*, designation *Piercing Host*.\n**Guihai:** Azure Essence Jade Maiden, name *Cloud Lingering*, designation *Embracing Birth*.\n\n*Above: Jiayin Azure Essence Palace Numinous Flight Jade Maidens.*\n\nThe Jade Maidens wear purple brocade capes and vermilion-cyan flying splendor skirts, and hold jade-essence golden tiger talismans. The rest may be adapted as appropriate.\n\n**Upper Talisman of the Supreme Ultimate Jade Essence True Formula**\nThis talisman is first ingested on the *jiazi* day, then again on the second day. One is taken at dawn by men, and another at midday on the eight seasonal nodes.\n\n**Upper Talisman of the Supreme Ultimate Jade Essence True Formula**\nThis talisman is first ingested on the *yichou* day, then again on the second day. One is taken at dawn by women, and another at midnight on the eight seasonal nodes.\n\nThe above two talismans are the ancestral talismans of the Numinous Flight Six *Jia* system. To ingest them, first observe a six-day purification, then proceed. After sixty days of ingestion, one may then ingest the sixty Jade Maiden talismans. These two talismans govern the summoning of spirits and deities, the communication with the myriad essences. With continuous ingestion and no neglect, one attains flying transcendence and everlasting life. Having ingested the sixty Jade Maiden talismans, one must therefore cultivate these talismans in tandem.\n\nMen and women officials should use them according to their respective names. Avoid impurity, passing through homes of the dead, sharing beds with others, lending clothing, consuming the five pungent foods and the meat of the six livestock, and especially approaching women—these defilements cause the spirit to perish and the soul to scatter, giving rise to deviance and loss of nature, inviting calamity upon the three *qi*, and resulting in death as a lowly ghost. Always burn incense at the head of one’s sleeping quarters.\n\nThe *Jiazi* Jade Maidens of the Supreme Ultimate Palace all wear upper dark brocade capes and lower azure silk flying splendor skirts. The *Jiaxu* Jade Maidens of the Yellow Simplicity Palace all wear yellow brocade capes and purple silk flying feather skirts. The *Jiashen* Jade Maidens of the Supreme Simplicity Palace all wear white brocade capes and red silk flying splendor skirts.\n\nThe Left and Right Numinous Flight Jade Maidens’ attire and accoutrements: all hold jade-essence spirit-tiger talismans in hand, and wear their hair in three-cornered cloud buns with the rest left loose to the waist.",
      "overlap_context": "iden, name *Dragon Infant*, designation *Joyous Life*.\n\n*Above: Left Numinous Flight Jade Maidens of the Supreme Ultimate Palace of Jiazi.*\n\nThe Jade Maidens wear dark brocade robes, azure silk skirts of flying splendor, and hold spirit-tiger talismans of jade essence. The rest may be adapted as appropriate.\n\n**Jiaxu:** Yellow Simplicity Jade Maiden, name *Divine Radiance*, designation *Flying Health*.\n**Yihai:** Yellow Simplicity Jade Maiden, name *Purple Spring*, designation *Flying Mushroom*.",
      "start_char": 1283,
      "end_char": 2680,
      "start_sentence": 41,
      "end_sentence": 114,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.633503913879395,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\神符类\\上清琼宫灵飞六甲左右上符.txt",
        "category": "神符类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "绛宫甲午玉女一部，同服丹锦帔，青罗飞裙。 拜精宫甲辰玉女一部，同 服紫锦帔，碧罗飞裙。 青要宫甲寅玉女一部，同服紫锦帔，丹青飞羽裙。 右左灵飞玉女服色，手中并执玉精金虎符，头并颓云三角髻，余发垂至腰。 此有六十二符，乃是太极上宫四真人所受於太上道君。 受者当须精戒洁心，澡除五累秽污之意，杜尘浊淫欲之失，正目存六精，凝思玉真香烟散室，幽身孤房，积德累功，和魄保中，仿髴五神游生三宫，绝争竞於常辈，守寂默以感通者，六甲之神不逾年而降己也。 子能精修此道，必致登仙矣。 信而奉者，为灵人，不信者将沈九泉矣。 上清六甲灵映之道，当得至精至真之人，乃可传之，即致通降。 九嶷真人许伟远，昔受此方於中岳宋德玄。 德玄者，周宣王时人，服此灵飞六甲符，得道，能一日行三千里，数变形为鸟兽，得真灵之道，今在嵩山。 伟远久随之，乃受得此法，行之道成，今处九嶷山。 有女子郭少药、赵爱儿、王鲁连等，并受此法，而得道者复数十人，或游玄洲，或处东华方诸台，今见居之。 南岳魏夫人言：此郭少药者，汉度辽将军阳平郭骞女也，少好道精诚，真人因受其六甲之术。 赵爱儿者，幽州刺史刘虞妻，别驾赵该姊也，好道，得尸解后，又受此符。 王鲁连，魏文帝城门校尉，范陵王伯周女也。 亦学道，一旦忽委化，壻李子期入陆浑山中，真人又授此法，子期者，司马魏人清河王傅也。 常言此妇狂走，云一旦失所在矣。 上清六甲灵飞隐遁，服此真符，游行八方，行此真书，当得其人。 按四极明科，传上清内书者，皆列盟奉，启誓乃宣之，七百年得付六人，过年限足，不得复出泄也。 其受度者，皆对斋七日，香信於有经之师。 上金六两，白素六十尺，金镮六双，青丝六两，五色缯各二十二尺，以代剪发登坛，歃血破券之誓，以盟奉行灵符，玉名不泄之信。 如违盟负誓，七祖父母及己身，俱受风刀之考，诣积夜之河，运蒙山之石，以填孟津。 有经之师，所得法信，当给施寒栖贫下、孤病老耄懦弱之辈，不得独用。 如违科典，三官纪察，死为下鬼，切宜敬之慎之。 上清琼宫灵飞六甲左右上符 #1遗淫妄欲：疑当作『遣淫忘欲』。",
      "translated_text": "The Crimson Palace *Jiawu* Jade Maidens, one cohort, all wear cinnabar brocade capes and azure silk flying skirts. The Purple Essence Palace *Jiachen* Jade Maidens, one cohort, all wear purple brocade capes and jade-green silk flying skirts. The Azure Pivot Palace *Jiayin* Jade Maidens, one cohort, all wear purple brocade capes and cinnabar-azure flying feather skirts. The Right and Left Numinous Flight Jade Maidens’ attire: all hold jade-essence golden-tiger talismans in hand, and wear their hair in three-cornered cloud buns with the rest left loose to the waist.\n\nThese sixty-two talismans were received by the Four Perfected of the Supreme Ultimate Upper Palace from the Most High Lord of the Dao. Those who receive them must maintain strict precepts and purify the heart, washing away the five defilements and impure thoughts, severing the faults of worldly filth and lustful desires. With upright gaze, they visualize the six essences; with concentrated thought, they perceive the fragrant smoke of jade perfected ones filling the chamber. Secluded in a solitary room, they accumulate virtue and merit, harmonize the *po* and preserve the center, faintly emulating the five spirits as they wander through the Three Palaces. Cutting off competition with the common crowd, they guard stillness and silence to achieve resonance. Thus, the spirits of the Six *Jia* will descend to them within a year.\n\nIf one can cultivate this Dao with utmost dedication, one will surely ascend as an immortal. Those who believe and uphold it become numinous beings; those who disbelieve will sink into the Nine Springs. The Dao of the Six *Jia*’s Numinous Radiance must be transmitted only to those of utmost purity and perfection, for only then will resonance and descent occur.\n\nThe Perfected of Nine Peaks, Xu Weiyuan, once received this method from Song Dexuan of Mount Song. Dexuan, a man of the reign of King Xuan of Zhou, practiced the Numinous Flight Six *Jia* Talismans, attained the Dao, and could travel three thousand *li* in a day. He could transform his shape into birds and beasts, mastering the Dao of the true and numinous. He now resides on Mount Song. Weiyuan followed him for a long time and thus received this method. After achieving the Dao through its practice, he now dwells on Mount Jiuyi.\n\nWomen such as Guo Shaoyao, Zhao Aier, and Wang Lulian also received this method and attained the Dao. Several dozen others did likewise, some wandering the Dark Continent, others residing on the Eastern Florescence Terrace of Square Cauldron Mountain, where they now dwell. The Lady Wei of Mount Nanyue said: This Guo Shaoyao was the daughter of Guo Qian, the Han Dynasty General Who Pacified the Liao. From youth, she was devoted to the Dao with utmost sincerity, and the Perfected One thus transmitted the Six *Jia* arts to her. Zhao Aier was the wife of Liu Yu, Prefect of Youzhou, and the elder sister of Zhao Gai, Vice Prefect. Fond of the Dao, she attained liberation from the corpse and later received these talismans. Wang Lulian was the daughter of Wang Bozhou, City Gate Commandant of Wei Emperor Wen, and a princess of Fanling. She too studied the Dao. One day, she suddenly departed, leaving her husband, Li Ziqī, to enter Mount Luhun. The Perfected One then transmitted this method to Ziqī, who was the tutor of the Prince of Qinghe under the Sima Wei regime. He often spoke of this woman’s erratic behavior, saying she vanished one day without a trace.\n\nThe Hidden Retreat of the Numinous Flight of the Six *Jia* of the Upper Clarity Jade Palace: those who ingest these true talismans may wander the eight directions. Those who practice this true scripture must find the right person. According to the *Bright Statutes of the Four Poles*, those who transmit the inner scriptures of Upper Clarity must first take oaths and make pledges before revealing them. Every seven hundred years, they may be passed to six individuals. Once the time limit is reached, they may no longer be disseminated.\n\nThose who receive the transmission must fast for seven days, offering incense and pledges to a master who possesses the scriptures. They must present six *liang* of gold, sixty feet of white silk, six pairs of gold rings, six *liang* of green silk thread, and twenty-two feet each of five-colored silks. These serve as substitutes for the rites of cutting hair, ascending the altar, blood-oaths, and breaking contracts, sealing the vow to uphold the numinous talismans and the pledge to keep the jade names secret. Should one violate the oath and betray the pledge, one’s seven generations of ancestors and oneself will suffer the trials of the Wind Blade, be consigned to the River of Accumulated Nights, and bear the stones of Mount Meng to fill the Meng Ford.\n\nMasters who possess the scriptures and receive the ritual offerings must distribute them to the cold, destitute, poor, orphaned, sick, elderly, weak, and infirm. They may not use them for themselves alone. Should they violate these statutes, the Three Officials will record and examine their transgressions, and they will die as lowly ghosts. One must revere and be cautious of this.\n\nThe Upper Talismans of the Left and Right Numinous Flight of the Six *Jia* of the Upper Clarity Jade Palace #1: *Dispel Lustful Desires* (likely intended as *Dispel Lust and Forget Desires*).",
      "overlap_context": "e silk flying splendor skirts. The *Jiaxu* Jade Maidens of the Yellow Simplicity Palace all wear yellow brocade capes and purple silk flying feather skirts. The *Jiashen* Jade Maidens of the Supreme Simplicity Palace all wear white brocade capes and red silk flying splendor skirts.\n\nThe Left and Right Numinous Flight Jade Maidens’ attire and accoutrements: all hold jade-essence spirit-tiger talismans in hand, and wear their hair in three-cornered cloud buns with the rest left loose to the waist.",
      "start_char": 2681,
      "end_char": 3535,
      "start_sentence": 115,
      "end_sentence": 142,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.749946355819702,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\神符类\\上清琼宫灵飞六甲左右上符.txt",
        "category": "神符类"
      }
    }
  ]
}