{
  "source_id": "上清五常变通万化郁冥经",
  "source_file": "chunked_daozang\\上清五常变通万化郁冥经.json",
  "total_chunks": 17,
  "total_original_chars": 16299,
  "total_translated_chars": 103973,
  "total_translation_time": 523.9105730056763,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\上清五常变通万化郁冥经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Supreme Clarity Scripture of the Five Constants’ Transformations and Myriad Changes in the Murky Darkness**\n\n**Scripture Title:** *The Supreme Clarity Scripture of the Five Constants’ Transformations and Myriad Changes in the Murky Darkness*. Author unknown. Compiled from four early Supreme Clarity scriptural formulas: *The Flying Steps of the Void Constant Formula*, *The Dragon-Soaring Silk Measure Formula*, *The Jade Talisman of the Spirit-Flight with White Feathers and Black Wings*, and *The Nine Perfected’s Ascension to the Mysterious Record of the Flying Feather Scripture*. One scroll. Base text from *The Orthodox Daoist Canon*, *Cavern Mystery Section*, *Scriptural Writings Category*.\n\n---\n\nThe Most High Lord of the Great Dao said: The Void Constant is the hun-soul and po-soul of Heaven and Earth, the majestic brilliance of yin and yang. The Void is the hun-essence of the Nine Heavens; the Constant is the po-spirit of the Nine Earths. Their two qi congeal to form the great spirit of the Imperial Honored One, whose radiance aids and illuminates. The Void Constant, with its aiding brilliance as its gaze, commands the movement of celestial light, surveys the ten thousand directions, records the celestial lodges, revolves the Five Constants, summons and directs gatherings, and hastens the turning of mechanisms. When Heaven is at rest and Earth at peace, the Void Constant conceals itself; when Heaven is in decline and Earth in turmoil, the Void Constant shines forth. Fortune and misfortune, omens and portents—it instantly reports all inauspicious signs. The transformations of the myriad qi, the alterations of yin and yang, the succession of the four seasons—none occur without its agency. Thus, the two stars are revered and noble, hidden within the splendor of dawn, their wondrous subtlety belonging to the Void Constant, rarely to be glimpsed. Those who behold the two stars gain boundless longevity; those who cultivate and preserve this Dao ascend in flight to the Hall of Splendor. This is the secret teaching of the Highest Perfected.\n\nThe Prime Minister, the Azure Lad, respectfully inquired: The Dao of the Void Constant is spiritually resonant and wondrously noble—may it be heard?\n\nThe Most High Lord of the Great Dao said: The Void Constant is the supreme name of Heaven and Earth, yet it is called the Nameless. Blended into one, it becomes the Named. However, the Nine Heavens guard its spiritual resonance, which does not circulate in scriptural texts. Since it employs its aiding brilliance for seeing and hearing, relying on light and shadow to communicate with the real, the Imperial Honored One receives it to govern, and scholars wield it to attain immortality. It causes those with intention to seek it in the unfathomable, and thus it is again named the Named. Though named, it is not transmitted to the reckless; none can fathom it. Those who esteem it yet fail to attain its truth—how could this serve as the foundation for encouraging study? Yet the Nine Heavens have decreed that only those destined to possess the Dark Chart and Jade Characters, inscribed on the Fangzhu and bamboo slips, and those born to unite with the real, may partake of its hidden name. You shall oversee the myriad regions, examine the ten thousand immortals, settle the subtle and obscure, and deliver the countless people. You must not rashly disclose it in violation of the prohibitions—guard it well.\n\nThereupon, the Azure Lad ascended to the Vermilion Chamber of the Cinnabar Spirit above the clouds, purified himself for three months, tore silk to invoke the spirits, and with golden sheep and silver geese, paid homage to Heaven to receive the real. The Lord of the Dao declared: The Nine Heavens have strictures—according to the rules, it is transmitted once in ten thousand kalpas. Now, as the cycles intersect and qi returns to Supreme Clarity, the Dao is to be practiced in this era. Follow the dark statutes: within seven hundred years, there may be one who hears the three transmissions. If none are worthy, seal it and return it to the Nine Heavens, or entrust it to the chambers of the Nine Caves in the famous mountains. To lightly divulge or neglect it brings retribution upon the seven generations: drawing from the dark waves to irrigate the Four Rivers, bearing the weight of the mountains to fill the seas and oceans. This karmic response of fortune and misfortune leaves no room for error. You must clearly heed these words and act with caution.\n\nWhenever one wishes to tread the Void Constant, flying the net to escape form and transform appearance, and soaring into the Jade Clarity, one should practice this seven times in a month. On the Eight Nodes and the Six Ding days, one may also perform this Dao. On the appointed day, enter the chamber, burn incense to the left and right, arrange the mat and diagram, face south, and knock the teeth twenty-four times. Close the eyes and visualize the Five Stars shining brilliantly in the five directions. After a long while, let them descend and enter the five viscera within one’s body: the Metal Star into the Lung Palace, the Earth Star into the Spleen Palace, the Fire Star into the Heart Palace, the Wood Star into the Liver Palace, and the Water Star into the Kidney Palace. The Five Stars’ radiance illuminates the five viscera, and one feels the body suffused with warmth. Then visualize the Five August Ladies of the Stars and the Twenty-Five Celestial Lords of the Void Constant’s Dawn, recalling their surnames, personal names, and attire, each in their respective direction.\n\nWhen all is complete, softly recite the prayer:\n*Metal, Wood, Water, Fire, Earth—*\n*Together they govern the Four Origins.*\n*The dark essence flows and reflects,*\n*Illuminating the Five Gates.*\n*Within reside the Five August Ladies and Spirit Lords,*\n*The Twenty-Five Celestial Lords of the Void Constant,*\n*Transforming shapes and shadows,*\n*Uniting in thousands, dividing in myriad ways.*\n*Descend into the five viscera,*\n*Congeal to form Jade Immortals.*\n*Refine my seven po,*\n*Nurture my three hun.*\n*Raise my form to ascend,*\n*Fly into the Dipper’s Gate.*\n*Roam and play in the Upper Capital,*\n*The Five Stars gathered as one.*\n*Today, in this dark celebration,*\n*I request that all be as recited.*\n\nAfterward, draw in the star-light qi twenty-five times and swallow it. Then rise and ascend the net.\n\nStanding with feet together upon the Star of Great White, hold the breath for seven cycles, then face west and softly recite the prayer:\n\n*Seven Gates of the West,*\n*White qi flies in radiance.*\n*Above dwells the Luminous Emperor,*\n*the Bright August of Lesser Yin.*\n*His name is Golden Supreme Essence,*\n*robed in feathered garments.*\n*Resplendent essence flows and reflects,*\n*illuminating the Golden Palace.*\n*Named the Five Points,*\n*ancestral of the Void Constant,*\n*he bears the talisman and raises the standard,*\n*summoning yin and seizing yang,*\n*transforming water and fire across seventy-four directions.*\n*Grant me flying steps,*\n*concealing my form to enter the void,*\n*driving the white chariot,*\n*roaming the cloud chambers.*\n*May heaven and earth endure,*\n*eternally without end.*\n\nAfterward, tilt the head back and swallow the star-light qi seven times. Then take twelve steps with feet together, standing upon the Star of Quelling, hold the breath for twelve cycles, face southwest, look to the heavens, and softly recite the prayer:\n\n*Four Qi of the Central August,*\n*overseeing the Eight Spirits,*\n*within the Jade Terrace and Purple Chamber,*\n*divine points give rise to transformation.*\n*There resides the Primordial August,*\n*the Five Emperors’ hidden names,*\n*styled the Stepping Constant,*\n*serene within the Yellow Court.*\n*Clothed in flying clouds,*\n*crowned with radiant essence,*\n*holding the register and talisman,*\n*adorned with falling fire bells,*\n*grant me flying steps,*\n*reveal to me the divine names.*\n*Descend into the spleen palace,*\n*quelling the spirits and settling the essence.*\n*Ascend to heaven and enter the clouds,*\n*concealing my shadow and eluding my form,*\n*transforming the myriad things,*\n*roaming the Jade Clarity.*\n*May I, with the August Lord,*\n*together preserve the Great Luminance.*\n\nAfterward, draw in the star-light qi twelve times and swallow it. Then take three steps with feet together, standing upon the Star of Blazing Deluder, hold the breath for three cycles, face south, and softly recite the prayer:\n\n*Three Gates gleam resplendent,*\n*cinnabar light flows with essence.*\n*Mysterious qi surges and billows,*\n*illuminating the Southern Darkness.*\n*Above dwells the Crimson August,*\n*the Five Emperors’ bright spirits.*\n*His name is Wandering Radiance,*\n*clothed in brocade and patterned essence,*\n*crowned with a treasure diadem,*\n*girded with jade bells.*\n*He enters and exits the Vermilion Palace,*\n*the Purple Chamber and Crimson Citadel.*\n*Preserve my life’s record,*\n*inscribed in the Southern Palace.*\n*Grant me flying steps,*\n*transforming my qi and concealing my form.*\n*On an auspicious day, walk the Dao,*\n*universally purifying heaven and earth.*\n*May my heart-spirit congeal in true perfection,*\n*the five hun gleam with clarity,*\n*aligning with the three qi,*\n*merging with the Fire Star’s radiance.*\n\nAfterward, draw in the star-light qi three times and swallow it. Then take nine steps with feet together, standing upon the Star of Jupiter, hold the breath for nine cycles, face east, and softly recite the prayer:\n\n*Nine Qi of the East,*\n*Azure Heaven’s Jade Gate.*\n*Within dwells the Azure Morning,*\n*the Lord of the Mystic Above.*\n*Flowing azure surges and billows,*\n*this is the Celestial Hun.*\n*His name is Great Luminance,*\n*exalted of heaven and earth,*\n*clothed in phoenix robes,*\n*striped skirts of the tiger.*\n*Transforming the Five Points,*\n*shifting forms in nine aspects,*\n*crowned with azure essence,*\n*adorned with the Heaven-Crossing Jade Diadem.*\n*Golden talismans and feathered standards,*\n*jingling pendants in profusion,*\n*holding the Hidden Script,*\n*flying with feathered script.*\n*Preserve my life’s record,*\n*guard my liver’s gate.*\n*Externally radiant, internally luminous,*\n*the liver palace congeals into immortals.*\n*Welcome my ascent,*\n*to audience with the Imperial Morning.*\n\nAfterward, draw in the star-light qi nine times and swallow it. Then take five steps with feet together, standing upon the Star of Mercury, hold the breath for five cycles, face north, and softly recite the prayer:\n\n*Five Qi of the Northern Mystery,*\n*the Mystic Gate gleams with spirit.*\n*The Northern Morning flows and reflects,*\n*the Great Culmen of Jade Clarity.*\n*Within dwells the Supreme August,*\n*the Five Constants’ exalted name.*\n*His name is Yin’s Primordial Stillness,*\n*robed in mysterious clarity,*\n*crowned with a jade diadem,*\n*girded with flowing bells,*\n*golden seals and jade standards,*\n*jade pendants gleaming resplendent.*\n*Wandering the radiant morning,*\n*gazing beside the Eight Darknesses,*\n*returning to descend below,*\n*entering my kidney court.*\n*Preserve the five spirits’ record,*\n*the viscera flourishing in brilliance.*\n*Internally and externally replete,*\n*transforming my shadow and altering my form,*\n*bones flying, flesh ascending,*\n*ascending to Jade Clarity.*\n\nAfterward, tilt the head back and draw in the star-light qi five times and swallow it. Having completed the steps of the Five Stars, descend from the Star of Water, ascend seven steps from the Star of Metal, and again mount the Void Constant Register.\n\nFirst, stand with feet together upon the First Nine Constants and recite the prayer:\n*Lord of the Nine Constants of Earth,*\n*shifting forms in the hidden darkness,*\n*grant me concealed steps,*\n*to elude my form.*\n\nNext, ascend to the Second Nurturing Constant and recite the prayer:\n*Spirit Lord of the Nurturing Constant,*\n*whose form has no fixed attire,*\n*grant me transformation,*\n*that my body become grass and trees.*\n\nNext, ascend to the Third Mao Constant and recite the prayer:\n*Exalted Spirit of the Mao Constant,*\n*able to sink and to rise,*\n*grant me transformed radiance,*\n*shifting into hills and mounds.*\n\nNext, ascend to the Fourth Flowing Constant and recite the prayer:\n*August Lord of the Flowing Constant,*\n*whose form has no constant body,*\n*grant me exhalation,*\n*arousing qi and kindling smoke.*\n\nNext, ascend to the Fifth Walking Constant and recite the prayer:\n*Great Lord of the Walking Constant,*\n*whose might subdues the myriad ghosts,*\n*transform my form,*\n*kindling smoke into fire.*\n\nHaving completed the steps of the Five Constants, return to the Star of Metal, hold the breath for five cycles, and recite the prayer:\n\n*Flying into the Great Hidden,*\n*transforming radiance through the Five Constants,*\n*entering the Five Qi of the North,*\n*controlling the Three Yangs of the South.*\n*Golden talismans command the spirits,*\n*the Supreme Emperor aids and upholds.*\n*Six Wus escape the Six Jis,*\n*preserving passage to the Cavern Realm.*\n*Great White guards the lungs,*\n*Metal stabilizes the stomach and intestines.*\n*Internally replete, externally overflowing,*\n*form and hun together soar.*\n*Transforming in thousands, shifting in myriad ways,*\n*welcoming whatever the intent desires.*\n*May I, with the Jade August,*\n*together roam the Upper Capital.*\n\nAfterward, draw in the qi seven times and swallow it. Then take twelve steps from the Star of Metal to mount the Star of Earth, stand with feet together upon the First Upper Constant, and recite the prayer:\n*Upper Constant soaring,*\n*transforming in countless millions,*\n*grant me concealed radiance,*\n*ascending into the Nine Heavens.*\n\nNext, ascend to the Second Heavenly Constant and recite the prayer:\n*Heavenly Constant flowing with flame,*\n*kindling smoke into ramparts,*\n*grant me eluding form,*\n*carrying the spirit into fire.*\n\nNext, ascend to the Third Named Constant and recite the prayer:\n*Named Constant of the Northern Mystery,*\n*whose body is water,*\n*conceal me in rivers and seas,*\n*irrigate me to perfection.*\n\nNext, ascend to the Fourth Three Constants and recite the prayer:\n*Three Constants transforming might,*\n*radiance controlling the Eight Courts,*\n*grant me attainment of immortality,*\n*warding off disaster and repelling weapons.*\n\nNext, ascend to the Fifth Chen Constant and recite the prayer:\n*Chen Constant of myriad transformations,*\n*whose body has no constant form,*\n*grant me attainment of immortality,*\n*escaping death and entering life.*\n\nHaving completed the steps of the Five Constants, return to the Star of Earth, hold the breath for twelve cycles, and knock the teeth together twelve times, then recite the prayer:\n\nThe Primal Constant of the Five Yellows,\nCentral August Divine Sovereign,\ntransforms the Seven Metals,\nsubdues the Three Luminaries with might,\nescapes the body and divides the form,\nascends to heaven and enters the clouds.\nSummon the Five Spirits in unison,\nguard my Spleen Gate,\nthat my organs and viscera\nmay swiftly transform into immortality.\nSoaring into the void, entering the emptiness,\nwater and fire span the ten thousand origins—\nall as my will desires,\nascending without hindrance,\nto join the August Consort,\nbefriending the host of equals.\n\nComplete, draw in the breath and swallow twelve times to conclude.\n\nNext, from the Star of Earth take three steps,\nascend to the Star of Fire, feet together,\nand mount the First Void Constant, reciting the prayer:\n*Void Constant most numinous,*\n*assisting and aiding the Supreme Perfected,*\n*enter my Crimson Palace,*\n*governing the host of immortals.*\n\nNext, ascend to the Second River Constant, reciting the prayer:\n*River Constant of escape and concealment,*\n*hidden in the Eight Obscurities,*\n*transforming through water and fire,*\n*grant me attainment of immortality.*\n\nNext, ascend to the Third Primal Constant, reciting the prayer:\n*Primal Constant of transformation,*\n*grass and trees conceal my body,*\n*that my form and shadow*\n*may unite with the perfection of the Dao.*\n\nNext, ascend to the Fourth Ancient Constant, reciting the prayer:\n*Ancient Constant of celestial pairing,*\n*entering and exiting without hindrance,*\n*my body sprouts feathered wings,*\n*soaring upward to the heavens.*\n\nNext, ascend to the Fifth Si Constant, reciting the prayer:\n*Si Constant of the Southern Li,*\n*erecting the Ninefold Self-Covering,*\n*transforming and completing the form,*\n*instantly becoming the roaring beast.*\n\nHaving completed the steps of the Five Constants, return to the Star of Fire,\nhold the breath for three cycles, and knock the teeth together three times, then recite the prayer:\n*Flowing flame, cinnabar numen,*\n*Three Gates like lightning coursing,*\n*Five Constants transforming and communicating,*\n*myriad transformations flourishing in obscurity.*\n*Seize the life of the Earth Sovereign,*\n*subdue the might of the Northern Essence.*\n*Preserve the Upper Prime Record,*\n*fortify my long life.*\n*Today I step through the void,*\n*riding the emptiness into the stars.*\n*Mars aids my heart,*\n*my Dao shines with clarity.*\n*A thousand divisions, ten thousand unions—*\n*all I face is instantly accomplished.*\n*Spirit guides, soul refines,*\n*feathered raiment timely born.*\n*Attaining the Five Stars,*\n*I grasp the chariot of Jade Clarity.*\n\nComplete, draw in the breath and swallow three times to conclude.\n\nNext, from the Star of Fire take nine steps,\nreach the Star of Wood, feet together,\nand mount the Nine Constants, reciting the prayer:\n*Nine Constants of the Azure Sovereign,*\n*root of the soul of heaven and earth,*\n*grant me transformation,*\n*escaping my shadow and concealing myself in the mountains.*\n\nNext, ascend to the World Constant, reciting the prayer:\n*World Constant of celestial numen,*\n*governing the deliverance of the host of immortals,*\n*grant me to step through the void,*\n*uniting with my shadow to become a spirit.*\n\nNext, ascend to the Luminous Constant, reciting the prayer:\n*Luminous Constant shining bright,*\n*radiance illuminating the Eight Corners,*\n*grant me transformation of form,*\n*escaping water to become earth.*\n\nNext, ascend to the Five Constants, reciting the prayer:\n*Five Constants of mighty transformation,*\n*controlling and commanding the Five Lands,*\n*grant me transformation of form,*\n*instantly standing as a tiger.*\n\nNext, ascend to the Dharma Constant, reciting the prayer:\n*Dharma Constant manifesting wood,*\n*position governing the divine immortals,*\n*grant me division of my shadow,*\n*transforming my body into a thousand.*\n\nHaving completed the steps of the Five Constants, return to the Star of Wood,\nhold the breath for nine cycles, and knock the teeth together nine times, then recite the prayer:\n*Lesser Yang of the Nine Gates,*\n*wandering the azure heavens,*\n*within are the Five Constants,*\n*transforming in countless millions.*\n*Summon yin, call forth yang,*\n*commanding the Metal Spirit.*\n*Eastern Florescence receives the mandate,*\n*sitting in accord with spontaneity.*\n*Stepping through the void, treading the empty,*\n*urging the chariot of blue mist,*\n*ascending to the Azure Numen,*\n*below guarding the Gate of the Liver.*\n*The Dao illumines the Nine Unions,*\n*instantly attaining flight as an immortal,*\n*joining the Azure Sovereign,*\n*as one with the Perfected of the Wooden Dawn.*\n\nComplete, draw in the breath and swallow nine times to conclude.\n\nNext, from the Star of Wood take five steps,\nreach the Star of Water, feet together,\nand mount the Yin Constant, reciting the prayer:\n*Yin Constant of the Northern Mystery,*\n*origin of the myriad transformations,*\n*grant me to dwell here,*\n*instantly becoming the divine dragon.*\n\nNext, ascend to the Yellow Constant, reciting the prayer:\n*Yellow Constant of numinous yin,*\n*transforming into the Jade Maiden,*\n*grant me division of form,*\n*instantly becoming a hundred selves.*\n\nNext, ascend to the Stabilizing Constant, reciting the prayer:\n*Stabilizing Constant governing the origin,*\n*transformations flourishing and exuberant,*\n*grant me division of form,*\n*to become the myriad things.*\n\nNext, ascend to the Flying Constant, reciting the prayer:\n*Flying Constant entering the void,*\n*ascending and descending in a hundred rhymes,*\n*transforming the form into the six livestock,*\n*that others may not see me.*\n\nNext, ascend to the Six Constants, reciting the prayer:\n*Six Constants of the fundamental bond,*\n*commanding ghosts and controlling spirits,*\n*revolving heaven and earth,*\n*confronting them slays men.*\n\nHaving completed the steps of the Five Constants, return to the Star of Water,\nhold the breath for five cycles, and knock the teeth together five times, then recite the prayer:\n*Northern Mystery of the Five Qi,*\n*Five Gates opening wide,*\n*Central Star of the Black Sovereign,*\n*styled the Five Constants.*\n*Transformations in the hidden and obscure,*\n*exiting yin and entering yang,*\n*summoning the life of the Three Luminaries,*\n*commanding the Earth Officials.*\n*Grant me to fly and step,*\n*escaping my shadow into the great void,*\n*wherever I turn,*\n*dividing my form in a hundred directions.*\n*Ascending to the Hook Array,*\n*raising my body to Jade Capital,*\n*my body sprouts wondrous fur,*\n*the Palace of the Kidneys receives fragrance.*\n*Today I practice the Dao,*\n*the origin of divine immortals,*\n*attaining the wish of heaven,*\n*enjoying blessings without end.*\n\nComplete, draw in the breath and swallow five times to conclude.\n\nThus completing the steps of the Twenty-Five Point Constants,\ndescend, knock the teeth together thirty-six times at the gate,\nface the guiding cord and chant the *Three Caverns Flying Steps Chapter*,\nthen take nine steps to ascend the Star of Yang Brightness.\n\nFeet together, mount the Star of Yang Brightness,\nface east and recite the prayer:\n*Within the Palace of the Supreme One,*\n*transforming, concealing, and escaping the origin,*\n*the Great Divine Consort within,*\n*the Most Honored of the Great One,*\n*governing the records of life,*\n*speak on my behalf,*\n*concealing my form and escaping myself,*\n*ascending to the imperial chariot.*\n\nNext, ascend to the Star of Yin Essence,\nface northeast and recite the prayer:\n*Within the Palace of the Middle Prime,*\n*preserving the embryo and transforming the form,*\n*the Divine Consort within,*\n*the Supreme Numen of the Lofty One,*\n*severing the afterbirth and untying the knots,*\n*refining the embryo and securing the essence,*\n*transforming in myriad ways,*\n*granting me long life.*\n\nNext, ascend to the Star of the Aiding Star,\nface the Star of the Perfected and recite the prayer:\n*Within the Palace of the True Origin,*\n*Six Escapes and Seven Concealments,*\n*the Mysterious Mother of the Upper Prime,*\n*nurturing my embryonic birth,*\n*concealing and transforming in the Golden Chamber,*\n*transforming into the Azure Chariot,*\n*granting me to fly through the void,*\n*endless years without limit.*\n\nNext, ascend to the Star of the Dark and Mysterious,\nface north and recite the prayer:\n*Within the Palace of the Axis of Obscurity,*\n*concealing my shadow and hiding my light,*\n*the Divine Consort within,*\n*great origin of divine immortals,*\n*delivering me through the Six Wus,*\n*exiting me through the Eight Directions,*\n*escaping my traces, flying and stepping,*\n*transcending to the imperial chambers.*\n\nNext, ascend to the Star of Cinnabar Origin,\nface west and recite the prayer:\n\nWithin the Palace of the Starry Net,\ntransforming my form and altering my radiance,\nthe Great Maiden within the Dipper,\nmysterious transformation without image,\ndelivering me through the Primordial Dipper,\ninscribing my name upon the imperial register,\nsoaring through the void and riding the emptiness,\nascending in body to cast no shadow.\n\nNext, ascend to the Star of the Northern Pole,\nface northeast and recite the prayer:\nWithin the Palace of the Bright Record,\nconcealing my traces and dispersing the multitudes,\nthe Middle Maiden within the Dipper,\nnuminous transformation of the Upper Palace,\nstriking my name from the Mysterious Register,\ninscribing it through all directions,\ndividing my body into a thousand,\nreturning my countenance to that of an infant.\n\nNext, ascend to the Star of the Celestial Pass,\nface northwest and recite the prayer:\nWithin the Palace of the Converging Pass,\nsplitting my radiance into ten thousand forms,\nthe Youngest Maiden within the Dipper,\ngreat numen of the Mysterious Upper Realm,\nfollowing the Dipper’s revolving mechanism,\ngoverning the myriad lives,\ngranting me to fly through the void,\ntransforming into the Great Obscurity.\n\nNext, ascend to the Star of the Assistant,\nface the Gate of Heaven, knock the teeth nine times, and recite the prayer:\nWithin the Upper Palace of the Imperial Couch,\nthe August Consort of the Right,\nfacing the Imperial Lord above,\naligning her radiance with the True,\nnamed the Wondrous Constancy,\ntransforming through the Nine Heavens,\nguiding and conveying the sun and moon,\ngathering qi to form mist,\nrevolving water and fire,\nconcealing the myriad anomalies within,\nat this time of primordial auspiciousness,\nproclaiming the Mysterious Blessing,\ngranting me to fly in steps,\nriding the Constant to enter the True,\nthe Nine Dawns flowing and scattering,\nenjoying ten thousand blessings,\nmy form equaling the radiance of heaven,\nmy virtue harmonizing with the Three Conveniences.\n\nWhen finished, face upward and swallow qi twenty-four times to conclude.\n\nNext, ascend to the Star of the Supporter,\nface the Earthly Door, knock the teeth nine times, and recite the prayer:\nWithin the Upper Palace of the Supreme,\nthe August Consort of the Right,\nequal in honor to the Imperial Lord,\nuniting in the Flowery Chamber of the Numinous,\nheavenly hun and earthly po,\nnamed the Supreme Void,\ntransforming through the Nine Qi,\nancestor of the myriad perfected,\nrevolving metal and turning stone,\nequaling the merit of heaven,\ndissolving mountains and rivers,\nsummoning clouds and calling dragons,\nthe myriad anomalies instantly vanishing,\nsplitting my radiance into a hundred million,\nflying in steps upon the void,\nstreaming brilliance through the four directions,\nconcealing my body within the Dipper’s seat,\ncloaking myself in the radiance of heaven,\neternally numinous between heaven and earth,\nenjoying boundless blessings,\nmay all be as wished,\nreceiving fortune forever.\n\nWhen finished, face upward and swallow qi thirty-six times to conclude.\nAll these are performed in a single passage, without retracing.\n\nThe Dao of the Eternal Void concludes here.\n\nThe Most High practices the Dao of the Eternal Void. On each appointed day, they purify themselves, burn incense, and seclude in a separate chamber, free from worldly affairs, performing the rites in secrecy. Calming the mind and settling the intent, they visualize the divine perfected, with stars arrayed in orderly ranks, each distinct and clear. They proceed slowly, stepping through the celestial net.\n\nWithin five years, the Imperial Lord and the August Consort descend without fail; the Primordial August Five Stars cast their radiance without omission. The inner form becomes luminously clear, and the myriad spirits undergo transformation. After seven years of practice, one may divide their form into a myriad manifestations and conceal their traces within the Nine Voids. After fourteen years, they soar through the Great Void, ascending to the Dipper’s dawn.\n\nIf constrained by worldly duties or circumstances, should one obtain this scripture but be unable to perform the stepping ritual, simply burn incense, hold the scripture, face north toward the stars, and visualize the divine perfected, praying for transcendence. Thus, all calamities are averted, misfortunes dispelled, the spirit brightens, the body purifies, and one regains youthful countenance. Practicing thus for fourteen years extends life by seven hundred years.\n\nImpurity, negligence, or leakage of secrets brings ruin upon the entire household, with punishment extending to the seven generations of ancestors. The correspondence of sin and fortune is most evident. From here, proceed with seven steps to ascend upon the Metal Star and recite one invocation. From the Metal Star, take twelve steps to ascend upon the Earth Star and recite another invocation. From the Earth Star, take three steps to ascend upon the Fire Star and recite another invocation. From the Fire Star, take nine steps to ascend upon the Wood Star and recite another invocation. From the Wood Star, take five steps to ascend upon the Water Star and recite another invocation. When the Five Stars are completed, recite one final invocation. Then, beginning again from the Metal Star, repeat the sequence fifteen times in reverse, stepping without invocation. Thus, the Dao is fulfilled.\n\nAfter completing the steps of the Five Stars, proceed from the outer path with seven steps to ascend upon the Earth Gate of the Nine Constants, then proceed through the Five Constants in sequence. Return to the Metal Star and recite one invocation, then take twelve steps to ascend upon the Upper Constant and proceed through the Five Constants in sequence. Return to the Earth Star and recite one invocation, then take three steps to ascend upon the Void Constant and proceed through the Five Constants in sequence. Return to the Fire Star and recite one invocation, then take nine steps to ascend upon the Nine Constants and proceed through the Five Constants in sequence. Return to the Wood Star and recite one invocation, then take five steps to ascend upon the Yin Constant and proceed through the Five Constants in sequence. Finally, return to the Water Star and recite one invocation.\n\nThe Celestial Pivot Star’s Primordial Dipper Palace houses the Mystic August Perfected Sovereign Consort, surnamed Bright Permeation, with the taboo name Yingyu, and the true name [ ]. Her hair is styled in a Flying Cloud Floral Coiffure, and she wears a mantle of purple, yellow, and azure hues.\n\nThe Celestial Wandering Star’s Mystic Dipper Palace houses the Numinous August Perfected Sovereign Consort, surnamed Mystic Mirror, with the taboo name Yubo Guang, and the true name [ ]. Her hair is styled in a Flying Cloud Floral Coiffure, and she wears a mantle of purple, yellow, and azure hues.\n\nThe Celestial Jade Star’s Upper Essence Palace houses the Numinous August Sovereign Consort, surnamed Constant Brightness, with the taboo name Huayun, and the true name [ ]. She wears a Morning Infant Treasure Crown and a luminous brocade robe of flying clouds.\n\nThe Celestial Balance Star’s Net-Pole Palace houses the Upper Numinous Divine Consort, the August Sovereign Consort, surnamed Opening Life, with the taboo name Yunming, and the true name [ ]. She wears a Seven-Tiered Jade Crown and a crimson phoenix-patterned robe.\n\nThe Jade Transverse Star’s Numinous Opening Palace houses the Northern August Golden Canopy Central Sovereign Consort, surnamed Primordial Direction, with the taboo name Shenwu, and the true name [ ]. She wears a Purple Dawn Flying Floral Crown and a nine-colored robe.\n\nThe Celestial Gate Star’s Northern Culmen Palace houses the Peaceful August Floral Primordial Sovereign Consort, surnamed Jade Primordial, with the taboo name Genhua, and the true name [ ]. She wears a Jade Dawn Advancing Worthies Crown and a flying azure feathered robe.\n\nThe Radiant Light Star’s Heavenly Motion Palace houses the Jade Floral Numinous August Sovereign Consort, surnamed Degrees Primordial, with the taboo name Zhonghui, and the true name [ ]. Her hair is styled in a Flying Floral Cloud-Tumbling Coiffure, and she wears a seven-colored night-luminous cloud brocade skirt and a nine-colored brocade mantle.\n\nThe Luminous Void Star’s Cavern Clarity Palace houses the Imperial Great Brightness Eternal August Sovereign Consort, surnamed Dark Ascent, with the taboo name Yuanyun, and the true name [ ]. Her hair is styled in a Flying Cloud Floral Tumbling Coiffure, and she wears a flying net robe.\n\nThe Hidden Primordial Star’s Constant Treasure Palace houses the Void Mystic Transformative Numinous Upper August Sovereign Consort, surnamed Dark Permeation, with the taboo name Wanguang, and the true name [ ]. She wears a Flying Heaven Seven-Tiered Jade Crown and a blue-patterned brocade robe.\n\nThese are the true names of the Nine Stars’ numinous essence, the August Sovereign Consorts, whose awe-inspiring divine transformations grant immortality to those who know them and transcendence to those who cultivate them. Record and strive to emulate them.\n\nThe Assistant Star’s Imperial Seat Palace houses the Purple Qi Jade Tower Imperial Lord of the Nine Dawns, surnamed Essence Constant, with the taboo name Wu Cu, styled Mystic Unraveling Master, and the true name [ ]. He wears a Flying Essence Jade Crown and a nine-colored phoenix robe.\n\nThe Adjuvant Star’s Upper August Palace houses the Jade Tower Purple Mansion Imperial Lord of the Primordial Dawn, surnamed Dark Void, with the taboo name Kong Wuxian, styled Hidden Primordial Awareness, and the true name [ ]. He wears a Flying Heaven Jade Crown and a Heavenly Dragon Robe.\n\nThese two stars embody the awe-inspiring numina of heaven and earth’s hun and po. The Assistant Star is called Constant, governing heaven. The Adjuvant Star is called Void, governing earth. Together, they revolve the celestial lodgings, turn the Five Peaks, and undergo myriad transformations. Those who know them attain boundless longevity, and those who cultivate them swiftly achieve concealment and seclusion. The twenty-five points of the Constants derive from the branches of these two deities, assisting the eight titles of the Numinous August One.\n\nThe Yang Brightness Star’s Supreme Palace houses the Azure City Jade Tower Lord of the Nine Dawns, surnamed Upper Cloud, with the taboo name Faying Rong, styled Dong Dongyang, and the true name [ ]. He wears a Nine Dawns Jade Crown and an azure flying robe.\n\nThe Yin Essence Star’s Middle Primordial Palace houses the Five-Colored Jade Tower Northern August Lord, surnamed Nurturing Infant, with the taboo name Xuan Shang Peng, styled Changyang Wen, and the true name [ ]. He wears a Mystic Essence Jade Crown and a dark feathered flying robe.\n\nThe Perfected Person Star’s True Primordial Palace houses the Yellow Terrace Jade Tower Master of Immortals, the Floral Lord of Dawn, surnamed Returning Union, with the taboo name Miaoyin Guang, styled Permeating Degrees Primordial, and the true name [ ]. He wears a Flying Dawn Treasure Crown and a blue feathered flying robe.\n\nThe Dark Obscurity Star’s Dark Secluded Palace houses the Vermilion Terrace Jade Tower Dark Flying Canopy Lord of Dawn, surnamed Dark Pivot, with the taboo name Dingxuanjue, styled Dharma Opening Degrees, and the true name [ ]. He wears a Seven Treasures Flying Heaven Crown and a white brocade flying robe.\n\nThe Northern Culmen Star’s Bright Record Palace houses the Dark Terrace Jade Tower Northern Dawn Flying Floral Lord, surnamed Bright Numinous, with the taboo name Changminghua, styled Abyssal Cavern Source, and the true name [ ]. He wears a Flying Essence Floral Crown and a purple brocade flying robe.\n\nThe Celestial Barrier Star’s Barrier Convergence Palace houses the Nine-Layered Jade Tower General Numinous Nine Primordials Northern Canopy Lord of Dawn, surnamed Dark Pivot, with the taboo name Zhuantian’guang, styled Converging Heaven’s End, and the true name [ ]. He wears a Nine Primordials Treasure Crown and a nine-colored brocade robe.\n\nThe seven stars above are all the majestic deities of the Nine Essences Emperor Dawn of the Nine Heavens, governing the palaces of the seven stars, revolving the celestial radiance, summoning and hastening kalpic destinies, transforming the myriad things, and merging heaven and earth. Knowing their inner names extends life by seven thousand years. Cultivating for fourteen years ascends one to the dawn in broad daylight.\n\nWithin the Supreme Palace’s Imperial Lord Transforms-Conceals-and-Retreats Primordial Inner Consort, surnamed Extending Brilliance, with the taboo name Supreme One’s Dharma Altar, styled Fortunate Upright Support, and the true name [ ], she wears a yellow brocade mantle and a cinnabar-and-indigo flying skirt, her hair coiled in a cascading cloud chignon.\n\nWithin the Middle Primordial Palace’s Imperial Lord Protects-Embryo-and-Transforms-Form Inner Concubine, surnamed Opening Barrier, with the taboo name Supreme One’s Three Vessels, styled Net of Vermilion Infants, and the true name [ ], she wears a blue-green brocade mantle and a green-feathered flying skirt, her hair coiled in a cascading cloud chignon.\n\nWithin the True Primordial Palace’s Imperial Lord Six Paths Seven Concealments Supreme Primordial Mother, surnamed Obscure Vastness, with the taboo name Supreme One’s Numinous Yi, styled Soaring Twin Omens, and the true name [ ], she wears a blue-green brocade mantle and an embroidered-feather patterned skirt, her hair coiled in a cascading cloud chignon.\n\nWithin the Cord-of-Darkness Palace’s Imperial Lord Conceals-Light-and-Hides-Radiance Middle Primordial Inner Consort, surnamed Opening Brilliance, with the taboo name Supreme One’s Seven Fierces, styled Horizontal Single Tray, and the true name [ ], she wears a purple brocade mantle and a yellow-flowered feathered skirt, her hair coiled in a cascading cloud chignon.\n\nWithin the Net-of-Spirits Palace’s Imperial Lord Transforms-Body-and-Alters-Radiance Dipper’s Middle Great Maiden, surnamed Dark Path, with the taboo name Supreme One’s Gloomy Writ, styled Ridge-of-the-Field Orchid, and the true name [ ], she wears a vermilion brocade mantle and a purple-and-indigo flying skirt, her hair coiled in a cascading cloud chignon.\n\nWithin the Record-of-Brilliance Palace’s Imperial Lord Conceals-Traces-and-Disperses-Multitudes Dipper’s Middle Maiden, surnamed Flying Swiftness, with the taboo name Supreme One’s Qi Essence, styled Embracing Fixed Mound, and the true name [ ], she wears a vermilion brocade mantle and a blue-green embroidered flying skirt, her hair coiled in a cascading cloud chignon.\n\nWithin the Barrier Convergence Palace’s Imperial Lord Divides-Radiance-and-Manifolds-Forms Dipper’s Youngest Maiden, surnamed Aged Heaviness, with the taboo name Supreme One’s Gloomy Ink, styled Heavenly Ordinary Grace, and the true name [ ], she wears a cinnabar brocade mantle and a blue-green-flowered feathered skirt, her hair coiled in a cascading cloud chignon.\n\nWithin the Imperial Couch Palace’s Imperial Lord Transforms-Sun-and-Moon-Water-and-Fire Dipper’s High August Left Consort, surnamed Constant Brilliance, with the taboo name Supreme One’s Stone-Initiating Pearl, styled Falling Luxuriant Flower, and the true name [ ], she wears a purple brocade mantle and an embroidered-feather cinnabar skirt, her hair coiled in a cascading cloud chignon.\n\nWithin the Supreme Veneration Palace’s Imperial Lord Transforms-Metal-and-Stone-Mountains-and-Rivers Dipper’s High August Right Consort, surnamed Void Yellow, with the taboo name Supreme One’s Beloved Branch, styled Nurturing Mystery, and the true name [ ], she wears a green brocade mantle and a kingfisher-feather patterned skirt, her hair coiled in a cascading cloud chignon.\n\nThe nine Imperial Lords of the Dipper’s Nine Dawn Palaces are the great deities of the Nine Yin. Those who know them shall have the Nine Consorts descend, escorting their omens to ascend into the Dipper’s palaces, where they shall be ranked as Jade Clarity Perfected Ones. After seven years, they may divide radiance and disperse form, transform the myriad things, merge the hidden and obscure, and soar through the Great Void, ascending to Jade Clarity.\n\nThe True August Emperor Lord of the Eastern Year Star’s Yang Primordial Palace, surnamed Azure Void, with the taboo name Clear Ripples, styled Pure Congealment, and the true name [ ], wears a green-essence jade crown and a blue-feathered flying robe.\n\nThe True August Emperor Lord of the Southern Fire Star’s Cavern Yang Palace, surnamed Radiant Void, with the taboo name Flourishing Vessel, styled Mysterious Net, and the true name [ ], wears a vermilion-essence jade crown and a crimson-feathered flying robe.\n\nThe True August Emperor Lord of the Western Venus Star’s Plain Brilliance Palace, surnamed Vast Void, with the taboo name Desolate Loftiness, styled Vibrant Seeking, and the true name [ ], wears a gold-essence jade crown and a white-feathered flying robe.\n\nThe True August Emperor Lord of the Northern Mercury Star’s Dark Dipper Palace, surnamed Yin Void, with the taboo name Mysterious Flourishing, styled Dragon Maiden, and the true name [ ], wears a dark-essence jade crown and a black-feathered flying robe.\n\nThe True August Emperor Lord of the Central Saturn Star’s Upper Pivot Palace, surnamed Constant Void, with the taboo name Mysterious Jade, styled Flying Worthiness, and the true name [ ], wears a yellow-essence jade crown and a yellow-feathered flying robe.\n\nThe five True August Emperor Lords of the Five Star Palaces conceal their hidden names, which the Supreme One has secreted within the Nine Numinous Upper Palace of the Purple Chamber. They are not transmitted to beginners. Those who obtain them must have borne the mysterious chart and inscribed tablets, their true names having been inscribed in reverse across ninety thousand kalpas prior, destined to receive these texts. They shall become ministers to the future sages, Jade Clarity Perfected Ones.\n\nWithin the Eastern Yang Primordial Palace resides the True August Emperor Lord’s August Consort, surnamed Opening Constancy, with the taboo name Treasure Countenance, styled Soaring Cloud, and the true name [ ], who wears a blue-green brocade mantle and a green-feathered flying skirt, her hair coiled in a cascading cloud chignon.\n\nWithin the Southern Cavern Yang Palace resides the True August Emperor Lord’s August Consort, surnamed Yang Constancy, with the taboo name Maintaining Stillness, styled Dispersing Fusion, and the true name [ ], who wears a cinnabar brocade mantle and a cinnabar-feathered flying skirt, her hair coiled in a cascading cloud chignon.\n\nWithin the Western Plain Brilliance Palace resides the True August Emperor Lord’s August Consort, surnamed Bright Constancy, with the taboo name Whirlwind Heroine, styled Numinous Grace, and the true name [ ], who wears a plain brocade mantle and a purple-feathered flying skirt, her hair coiled in a cascading cloud chignon.\n\nWithin the Northern Dark Dipper Palace resides the True August Emperor Lord’s August Consort, surnamed Abyssal Constancy, with the taboo name Commencing Brilliance, styled Essence Origin, and the true name [ ], who wears a dark brocade mantle and a kingfisher-feathered flying skirt, her hair coiled in a cascading cloud chignon.\n\nWithin the Central Upper Pivot Palace resides the True August Emperor Lord’s August Consort, surnamed Health Constancy, with the taboo name Concealing Obscurity, styled Indulging Extension, and the true name [ ], who wears a yellow brocade mantle and a yellow-flowered flying skirt, her hair coiled in a cascading cloud chignon.\n\nThe Five Star Consorts’ inner yin hidden names are concealed by the Supreme One within the Purple Canopy Palace of the Dark Dipper. These five consorts revolve heaven and turn earth, expand and contract the Three Luminaries, transform mountains and rivers, alter the Five Phases, shift the myriad things, and conceal the hidden and obscure. Those who know their Dao shall no longer tread upon the earth’s gates, their souls passing beyond Mount Tai. They shall become the Perfected of Jade Clarity, emerging once every ten thousand kalpas in accordance with the statutes.\n\nTo cultivate the Way of the Nine Dawns and Five Stars, one should enter the chamber at midnight on the eight solar terms and one’s own life-destiny day, face north, and click the teeth nine times. Closing the eyes, visualize the Nine Stars, their radiance shining brilliantly upon the northern direction. Further visualize the Five Stars, their luminosity illuminating the five directions, their light cascading to illuminate one’s body, sensing oneself within a crimson glow, inwardly and outwardly obscure. After a long while, visualize the Nine Stars’ and Five Stars’ Imperial Lords, the August Lords and their consorts, the Nine Stars’ inner consorts—their surnames, taboo names, styles, and attire—each within their stellar palaces, all made distinct.\n\nAfter a moment, the assembled deities reverently coalesce into a single infant, appearing as one newly born, named the Eternal Youth, styled the Divine King of Transformations. In his hands he holds the Nine Stars and Five Stars, their tassels adorning his entire body, bearing the sun and moon in his sash and mouth. The youth bathes your form in the radiance of sun, moon, and stars, your body enveloped in crimson light, inwardly and outwardly luminous and transparent—this is the Dao of the Myriad Transformations in Unity. Then, raising your head, swallow qi nine times and recite the incantation:\n\n*\"Great spirits of the celestial circuit,\nTitled August Emperors,\nRevolving the Nine Paths,\nEssence blazing through the eight directions,\nLuminous radiance streaming through the heavens,\nShooting forth rays and scattering light,\nConcealed and dissolved in the profound,\nRevolving to unite in the Purple Chamber,\nTransforming myriad forms,\nCongealing into the numinous youth,\nFlowing within and without,\nJade Perfected of the four cardinals,\nLeft wielding the Fire Bell of Destiny,\nRight striking the lightning’s flash,\nClouds and mists surging,\nResplendent patterns soaring,\nDivine transformations of the Great One,\nBrocade mantle and luminous robes,\nHolding the sun and wearing the moon,\nAdorned with celestial insignia,\nSoaring through the Five Mornings,\nUrging the turning of the Dipper’s net,\nFollowing the heart’s desire,\nWherever the will extends,\nAscending to heaven, entering the obscure,\nTransforming in a hundred ways,\nPreserving and nurturing my body,\nHeaven and earth sharing the merit,\nMy body sprouting feathered raiment,\nAscending to fly in the imperial palace.\"*\n\nWhen finished, raise your head and swallow qi nine times to conclude. Profoundly meditate upon the Dao of the Nine Perfected and Five Mornings, concealed within the eight obscurities—this is the ultimate attainment of the practice.\n\nThe Five Points of Venus:\nFirst Point: Surname Dìcháng, taboo name Yīngyù, style Tōngbó, true name Táojiǔyuán.\nSecond Point: Surname Yùcháng, taboo name Huàntōng, style Yōuyuán, true name Rùwǔdào.\nThird Point: Surname Mǎocháng, taboo name Jīnshàng, style Hàochún, true name Dàiliùxíng.\nFourth Point: Surname Liúcháng, taboo name Gǔqīng, style Táobiān, true name Zhuǎnsānguān.\nFifth Point: Surname Xíngcháng, taboo name Hàotáō, style Qùdǒu, true name Fúqìjīng.\n\nThe Five Constants of the Western White Star, all wearing white-beamed precious crowns, clad in white brocade flying robes, and holding golden talismans and jade tablets, preside over the transformations of the Seven Gates.\n\nThe Five Points of Saturn:\nFirst Point: Surname Shàngcháng, taboo name Huángguāng, style Yuányìn, true name Táohuángyuán.\nSecond Point: Surname Tiāncháng, taboo name Liáodiàn, style Zhuódù, true name Rùmùjīng.\nThird Point: Surname Xīngcháng, taboo name Kōngtiǎo, style Xiáxuán, true name Biànshuǐhuǒ.\nFourth Point: Surname Sāncháng, taboo name Téngmín, style Língbiàn, true name Jīnshàngshēng.\nFifth Point: Surname Chéncháng, taboo name Nèiyì, style Yìwēi, true name Hēiláigǔ.\n\nThe Five Constants of the Central Yellow Star, all wearing yellow-beamed precious crowns, clad in yellow brocade flying robes, and holding yellow banners and demon-subduing talismans, preside over the transformations of the Twelve Gates.\n\nThe Five Points of Mars:\nFirst Point: Surname Kōngcháng, taboo name Chángyáng, style Yuánwú, true name Língtōngmíng.\nSecond Point: Surname Hécháng, taboo name Liújīng, style Qīzhuǎn, true name Qīshénhuì.\nThird Point: Surname Yuáncháng, taboo name Nánhào, style Jīngjí, true name Rùliúguāng.\nFourth Point: Surname Gǔcháng, taboo name Dòngzhǔ, style Wēishēng, true name Biànsānshén.\nFifth Point: Surname Sìcháng, taboo name Jìxíng, style Hòuhuà, true name Táoxíngbiān.\n\nThe Five Constants of the Southern Fire Star, all wearing vermilion-beamed precious crowns, clad in vermilion brocade flying robes, and holding red spirit-summoning talismans, preside over the transformations of the Three Gates.\n\nThe Five Points of Jupiter:\nFirst Point: Surname Jiǔcháng, taboo name Qīngmáng, style Shàngyáng, true name Yǐnzhēnshēn.\nSecond Point: Surname Shìcháng, taboo name Cāngyuán, style Chángmìng, true name Tōngjiǔdào.\nThird Point: Surname Míngcháng, taboo name Bìyuān, style Dòngshēng, true name Huàqīngguāng.\nFourth Point: Surname Wǔcháng, taboo name Guīqīng, style Yùyáng, true name Liúdiànhéng.\nFifth Point: Surname Fǎcháng, taboo name Lǜtái, style Míngài, true name Wànzhēnhuì.\n\nThe Five Constants of the Eastern Wood Star, all wearing azure-beamed precious crowns, clad in azure brocade flying robes, and holding the Green Emperor’s demon-subduing talismans, preside over the transformations of the Nine Gates.\n\nThe Five Points of Mercury:\nFirst Point: Surname Yīncháng, taboo name Xuántōng, style Zǐyuán, true name Běishàngyuán.\nSecond Point: Surname Huángcháng, taboo name Yuēkōng, style Dōngmíng, true name Dòngtiānzhòng.\nThird Point: Surname Dìngcháng, taboo name Yǐnyáng, style Bóguāng, true name Lúndàjié.\nFourth Point: Surname Fēicháng, taboo name Shàngyuán, style Cángguāng, true name Dìngwànshén.\nFifth Point: Surname Liùcháng, taboo name Zhōngbiàn, style Fēntú, true name Rùhēiguān.\n\nThe Five Constants of the Northern Water Star, all wearing black-beamed precious crowns, clad in black brocade flying robes, and holding the Northern Palace’s execution-subduing banners, preside over the transformations of the Five Gates.\n\nTo practice the Dao of the Void and Constant Transformations, regularly enter the chamber at noon on the eight solar terms and one’s own life-destiny day, face south, and click the teeth twelve times. Closing the eyes, visualize the Two Spirits of Void and Constant, along with the twenty-five Points’ Constants—their hidden names and attire—each in their respective directions, distinctly arrayed within the stellar palaces, their radiance streaming and luminous, mysteriously illuminating your body. After a long while, they suddenly transform into two beasts, the phoenix and the dark turtle, descending from the midst of heaven. The phoenix rides the crimson qi’s radiance, alighting upon your head; the dark turtle rides the white qi’s radiance, descending beneath your feet. The phoenix enters through your mud-pill, the dark turtle through your life-gate, the red and white qi intertwining throughout your body. You sense your form transforming into a phoenix, standing atop the dark turtle, enveloped in the red and white qi. Then, click the teeth twenty-five times, swallow qi twenty-five times, and raise your head to recite the incantation:\n\n*\"Heaven’s essence and earth’s spirit,\nTitled Void and Constant,\nNorthward entering the Five Qi,\nSouthward governing the Three Yangs,\nWood generating flowing fire,\nSeven Qi breaking harm,\nWater irrigating the Nine Shocks,\nCentral Yuan ceasing its course,\nEarth reigning to nurture metal,\nWood Qi concealed and stored,\nGolden talismans commanding spirits,\nThe Great Emperor aiding and welcoming,\nSix Wù fleeing Six Jǐ,\nConcealed in the shadowy nether realms,\nThe Great One guarding the lungs,\nMetal anchoring the kidneys and bowels,\nUpper Yuan assisting the heart,\nRefining the immortal’s liver palace,\nInwardly fresh and outwardly flourishing,\nJade Perfected filling the four cardinals,\nTransforming myriad scenes,\nMerging the two lights,\nNuminous phoenix and dark turtle,\nDivine beasts coming to welcome,\nProfoundly entering the subtle,\nForm and soul soaring together,\nA thousand transformations, ten thousand changes,\nFollowing the will’s intent,\nEast, west, south, north,\nNone fail to aid and support,\nEternally preserving heaven and earth,\nEnjoying boundless blessings,\nAttaining to wander with the Radiant Emperor,\nIn the Upper Capital.\"*\n\nWhen finished, draw in the qi and swallow twice, then stop.\nThis is the Dao of the Ever-Concealed, the profound and subtle principle of wondrous workings, wherein all matters culminate.\nHerein lies the myriad transformations, the body generating water and fire, merging with heaven and earth in perfect accord, fulfilling every intent and desire.\nThose who attain this shall ascend to the rank of Immortal Duke, their names inscribed by the Northern Asterism, their records kept in the Southern Palace.\nThe Five Stars shall descend, ten thousand spirits shall serve as guards, and blessings and virtue shall arise naturally, requiring no external aid.\nAfter nine years of cultivation, one shall attain flight, ascend to the celestial lodgings, and wander in revelry through the Jade Purity.\nWithout this method, all distant aspirations shall be cut off, and the spirit shall suffer no rest by night or day.\n\nThis is a celestial forbidden scripture. To lightly disclose or profane it brings guilt upon nine generations of ancestors and parents, while the offender’s own body shall perish abruptly, forever confined to the ghostly bureaus.\n\n**The Hidden Essentials of the Dragon’s Flight on Nine-Path Silk**\n\nThe Most High Lord of the Great Dao, in the first year of the Supreme August Emperor’s reign, on the first day of the second month (a *jiǎzǐ* day), proclaimed an oath in the Heaven of Infinite Vastness, transmitting the *Feathered Scripture of Flight and the Ever-Concealed Transformations* to the Perfected Lord of the Northern Culmen.\nAt that time, the Nine Heavens’ Celestial Emperor, the Lofty Immortals, and the Great Sages all attended the oath ceremony. The Five Emperors wore sashes, ten thousand spirits stood in attendance, the sun and moon radiated their splendor, the host of stars arrayed their essence, the Seven Origins opened the gates, the Yellow Path ceased its motion, heaven and earth paused their mechanisms, and the Three Realms grew solemn and clear.\nCrimson clouds cast their shade, purple mists soared on all sides, the time was harmonious, the day auspicious, and the Eight Sceneries unfolded in full.\nBeneath the radiant dawn, the Lord of the Dao tore the silk and imparted the secret within his golden mouth. His words resounded through the Nine Heavens, and from afar he intoned the sacred name.\nThe Celestial Emperor rejoiced, the Heavenly Perfected bowed their heads, the demon kings restrained their forms, and they pledged to uphold the Mysterious Void. Thus, the Perfected Lord ascended to the Jade Purity.\n\nThe Five Elders were commanded to oversee the trial, the Four Directors to assist the Perfected, and the attending immortals to the left and right to divide the oath and proclaim it to the spirits.\nFollowing the prescribed form of reverence, they faced north and intoned:\n*\"It is not for common ascent that we gather. By the mandate of the Nine Spirits, the revolutions shift ceaselessly, the sun and moon never halt. At this dawn hour, with sincere hearts and unbound forms, we hold the blade in the Southern Palace, inhale the cinnabar in the Cold Court.\nThe golden ram and silver crow are offered in homage to the Supreme Purity. The silk is torn to divide the scripture, and the oath is sworn before heaven. We beseech the Four Poles: let this be transmitted but once in ten thousand kalpas.\nShould any betray these words, calamity shall strike the Seven Mysteries. Should any violate this covenant, their form shall be extinguished, their life and death forfeit, and they shall be eternally confined to the dark nether realms.\"*\n\nWhen finished, the silk was torn to transmit the scripture, and the secret words were imparted orally.\nThe Heavenly Perfected descended, the Five Emperors guarded the spirit, the Nine Dawns bestowed nine hundred golden dawn lads and jade maidens, the Nine August Ones bestowed seven hundred jade flower maidens, and the Five August Ones further bestowed five hundred jade maidens each from the Five Emperors.\nThe Five Elders commanded their chariots, the Four Directors wielded their banners, twelve jade chariots of purple clouds flew in tandem, phoenix songs led the way, and celestial chimes followed behind.\nThe Six Masters cleared the path, nine dragons flanked the carriage, and thus they welcomed the Perfected Lord.\nAscending to the Northern Asterism’s Upper Palace of Jade Purity, he roamed and feasted among the Seven Origins, circled the Five Lodgings, traversed the Celestial Passes, and attained the rank of Supreme Immortal, governing the Palace of Vast Spirit in the Northern Culmen.\nIn the Supreme August Era, the text was transmitted to the Great Lord of the Eastern Florescence, the Azure Lad, to be passed on once in ten thousand kalpas according to the prescribed form.\n\nThe Dao of the Dragon’s Flight on Silk emerges from the Nine Heavens’ Celestial Emperor, bearing the names of the Nine Dawns, Five Stars, and the Ever-Concealed of heaven and earth.\nAs the precious, secret, numinous sound, it serves as the oath text. Unless one’s name was inscribed in the Mysterious Register of the Supreme Purity in a former life—having reversed the flow of ninety thousand kalpas—one shall not glimpse its passages or fathom its hidden tones.\nThose who behold this text shall achieve immortality in life or death. Those who cultivate its Dao shall radiate divine light, and the Celestial Emperor shall descend. After seven years of concealment, they shall transform in a hundred ways, traversing the nether realms and floating through the Nine Void Heavens.\nAfter fourteen years, they shall ascend at dawn and fly to the Jade Purity.\nThis is the great scripture of the ancestral lineage. By merely paying homage to the divine Perfected, one shall attain longevity, prolong life without end, repel a thousand calamities, and avert ten thousand misfortunes. Weapons shall be stilled, and all endeavors shall prosper.\nWhen one goes forth, the Nine August Ones shall respond, a halo shall encircle their neck, and the Five Emperors shall provide guard. Wherever they turn, the directors shall welcome them, enabling them to serve the Sage Lord in the Palace of Supreme Purity.\nThis Dao existed coevally with the Primordial Beginning. The Nine Origins’ Void Sovereign transmitted it to the Most High Lord of the Great Dao, who passed it to the Later Sage, the Golden Portal Emperor Lord, as well as the Supreme Emperor Lord, the Celestial Emperor of the Grand Tenuity, and the Perfected Lord of the Northern Culmen, who entrusted it to the Great Lord of the Eastern Florescence, the Azure Lad.\nAccording to the prescribed form, it is transmitted once in ten thousand kalpas to those among later learners who attain the Dao.\n\nThe method of transmission requires the recipient to be sincere and steadfast, offering ninety feet of crimson silk and fifty feet each of five-colored silk. They must seek a master who possesses the scripture and observe a hundred-day retreat—or seventy days, or seven days.\nUpon a secluded altar on the Mysterious Peak, they shall face north to divide the oath and transmit the secret.\nFive taels of golden ram are offered to the Five Stars, and nine taels of silver crow to the Nine Dawns. These two offerings are presented to heaven upon receiving the scripture, and the disciple pledges devotion to the master.\nAt the *zǐ* hour, the offerings are exposed upon the altar: the ram wrapped in crimson silk placed to the east, the crow wrapped in white silk placed to the west.\nThey swear the oath before the Nine Heavens, divide the silk, and orally transmit the secret names. At the moment of transmission, they follow the same prayer as above.\nThis is the precious Dao of the noble Perfected, an oath never to be betrayed. Without such an oath, any careless transmission shall bring the master and disciple alike to annihilation, their seven generations of ancestors condemned, and their souls unredeemed for ten thousand kalpas.\nThe prohibitions of heaven demand careful consideration.\n\nWhen ascending the altar, the disciple holds the ram and crow, faces north, and bows nine times. Then, they bow once to each of the five directions, beginning in the west, circling to the south, and ending in the west, prostrating to the east and placing the ram and crow to the master’s left and right.\nThe master stands at the center, faces north, and knocks his teeth nine times, declaring:\n*\"I, the Perfected Minister of [Name] Peak, [Personal Name], dare, at this auspicious time of triple conjunction, ascend the imperial altar, bare my form and sincere heart, purify my fast, and partake of cinnabar. I array this oath before heaven.\"*\n\nMay the Most High deign to cast its radiance upon this humble servant, turning its gaze to the Minister of [Name] Peak, [Personal Name], whom the Northern Emperor has exalted. May the blessings of past lives extend deeply into future rebirths, the wheel of fortune turning without cease across the Nine Heavens. Inscribed upon the mystic registers of destiny, this day I am granted the vision to behold the arcane scriptures and the voice to chant the hymns of the Imperial Unity. Envious of the immortals and yearning for divine communion, I now, within the midst of [Name] Heaven, receive the rites of transcendence—the esoteric formulas of feathered flight through empty space.\n\nI hereby supplicate the Ten Thousand Emperors, the Supreme Primal Sovereign, the Lofty Immortals and Great Saints, the Boundless Lords of the Dao, beseeching them to turn their luminous gaze and graciously oversee this sacred covenant. May the qi of the Perfected Immortals of the Jade Pure Upper Palace attend and guard my person. I invoke the Five Emperors, the Five Peaks, the myriad spirits, the river and sea deities—all to bear witness to this oath and to transmit the teachings in accordance with the established protocols.\n\nThe left half of the silk writ shall be inscribed on two *chi* of white silk, with one half on each *chi*, the two halves joined by a central talisman. The recipient shall inscribe the master’s taboo name in purple ink, and the text and talisman in vermilion. Once the master’s transmission of the taboo name is complete, the Jade Lads and Jade Maidens shall attend the recipient’s person. The central talisman shall then be split, each half to be worn upon the body: the left for men, the right for women. The writ shall be encased in a cinnabar-silk pouch and worn over the heart.\n\nBeware the veils of life and death—three transgressions shall scatter the celestial lodgings, and the Five Emperors shall weep in lament. The soul’s essence shall dissipate, the spirit wander astray, and the hun and po be lost, bringing death within the year. The prohibitions of the Nine Heavens are absolute: observe them, and the numinous radiance of heaven shall descend, divine immortals shall alight, the body shall command water and fire, and the myriad transformations shall submit of their own accord.\n\n**The Jade Talisman of the White-Feathered, Black-Quilled Numinous Flight**\n\nThe Primordial Father of the Nine Heavens and the Celestial Mother, the Supreme Perfected Lord, together ascended the resplendent dragon chariot, accompanied by the thousand immortals and ten thousand riders of the Mulberry Grove. The flying immortals harnessed this celestial wheel, swift as lightning and fleeting as mist, their bodies moving in harmony with the cosmos. They chanted sacred hymns, wandering the caverns of the Mystic Mound, resting by the limpid waves, roaming the purple void’s embrace, and halting at the timeless edge of the ageless realm.\n\nAt that moment, the celestial origin shone brilliantly, the five dawns turned their light, and the three pure clouds wove purple mists, exhaling fragrant blossoms that encircled the sun, their fragrance dispersing into the Great Void. Radiant splendor intertwined, the three torches merged their brilliance, congealing the true essence in perfect union. They chewed the root of the sun, imbibed the mysterious and infused the void, unfurled the resplendent golden scriptures, and intoned the nine subtleties in a resonant chant. The numinous chariot soared, their wondrous thoughts stirring the Great Silence, their inner contemplation awakening the Spontaneous.\n\nOn the third day of the third month of the first year of the *Above Emperor* era, at the dawn of the Primordial’s revelation, the Mystic Numinous descended in a chariot drawn by white simurghs, black-quilled phoenixes bearing in their beaks the silk writ of the *Feathered Flight through Empty Space*. The jade essence of the flying immortals guided the mist, the host of spirits guarded the numinous, their luminous presence suffusing the Nine Empyreans, resplendent in the courtyard of the Jade Void. They descended upon the Mystic Mound of the Supreme Perfected to transmit the precious scriptures.\n\nOn that day, as the Supreme Perfected Lord completed his fast in the Upper Clarity, the Celestial Emperor of the Great Thearch, the Three Pure Primordial Ladies of the Purple Tenuity, the Heavenly Emperor, the Celestial Emperor of the Supreme Tenuity, and the august guests of the Lofty Jade Sovereign all descended together. They kindled incense of a hundred harmonies, arrayed the floating banners of the five-colored spirit officials, and took their jade seats in the Purple Palace. The assembled immortals circumambulated the scriptures thrice, whereupon the Three Pure Primordial Ladies rose, faced west, and intoned in a voice of mystic clarity the *Ode of Celebration for the Feathered Writ*, extolling the divine scriptures. Their words began:\n\n*\"The vapors gather in the halls of the Great Void,\nA numinous wind scatters rare fragrance...\"*\n\nThe mystic radiance soars aloft in the void,\nA gentle breeze bears the sun on its wings.\nThe white simurgh swiftly follows the phoenix,\nIts beak holding the divine *Feathered Writ*.\nBeating their pinions, they shake the nine heavens,\nTheir mournful cries illumine the dark beams.\nArcane incantations issue forth through the air,\nThe pure governance of the Dao knows no end.\nThe assembled immortals join in celebration,\nBowing their heads in homage to the Jade Sovereign.\n\nWhen the recitation concluded, the Celestial Emperor of the Great Thearch rose again, facing north, and intoned:\n\n*\"The dark phoenix darts on cloud-wings,\nThe white simurgh rejoices in its stride.\nFlying fragrance blends with fragrant blossoms,\nMeteors gleam along the clouded thoroughfares.\nA mighty rainbow reins the long bridle,\nFlying immortals support one another.\nThe ten thousand perfected celebrate this felicitous fortune,\nJoyous phoenixes roam the empty midst.\nThe Primal Beginning leaves no trace,\nYet the mystic resonance seeks itself.\nBeating their wings without awaiting a chariot,\nThey drift lightly upon the mists of affinity.\nThe treasure scripture weaves the dark warp,\nThe five bodies command the numinous talismans.\nIn celebration they bow before the Court of Blessings,\nCircumambulating the incense thrice.\"*\n\nWhen this recitation ended, the Heavenly Emperor rose, facing east, and intoned:\n\n*\"White feathers and dark wings flutter,\nRiding the floating mists in cyclic return.\nFlowing fragrance overflows the ten heavens,\nFragrant fungi flourish in the Supreme Tenuity.\nThe numinous scripture unlocks the hidden mechanism,\nThe *Feathered Writ* shines with mystic splendor.\nThe supreme Dao is fundamentally without obscurity,\nHolding fast to the true, the radiant scene soars white.\"*\n\nWhen this too concluded, the Venerable Lord of the Great Perfected donned his ritual vestments: a crown of the Infinite Three Treasures of Heaven, a robe of seamless nine-colored flying clouds adorned with luminous feathered script, a tinkling bell at his left, and the Seven Primes at his right. Facing due south, he prostrated himself. The Celestial Emperor of the Supreme Tenuity then commanded the Feathered Immortal Attendant to raise a golden table, bearing the scripture as he stood facing north, and presented it to the Great Perfected. All the immortals voiced their approval, and the Great Perfected rose to receive the scripture. A golden light emanated from his countenance, and the five agents of his body spontaneously generated the *Numinous Flying Jade Talismans*. Ascending with the assembled perfected, they boarded the white simurgh’s chariot, drawn by black-winged phoenixes, to feast in the verdant groves and azure waters of the Eastern Expanse of Eternal Yang, the precincts of Fusang, the mouth of the Nine Springs. They journeyed west to the dark-feathered plain of the White Wilderness by the banks of the Mengsi, south to the Crimson Mound and the essence of extreme flame in the southern lands of Xia, north to the frigid halls of the Northern Darkness and the abode of the Cold Waters, and circled the ten absolute peaks of the Yellow Qi and the Yang Essence in the Great Mysterious Jade Capital, the Golden Terrace, the Jade Chamber, and the Cinnabar Palace. They roamed the ten heavens and the eight domains of the Grotto Clarity, governing the countless perfected. No heaven was beyond their reach, no hidden realm beyond their purview, no *qi* beyond their command, no immortal beyond their charge. They universally governed the host of spirits, and from heaven downward, none failed to model their virtue upon the Great Perfected or revere the *Feathered Writ*.\n\nThereupon, the Celestial Lords each ascended their dark palanquins, and after seven thousand kalpas, transmitted the scripture to the Most High Lord of the Great Dao. The *Upper Numinous Flying Jade Talisman of the Dark Immortal Feathered Essence* is worn for seven years, enabling one to ride the void and ascend to the Seven Primes. Those who cultivate the *Feathered Writ’s* flying paces without this talisman cannot ascend the void to the dark mysteries. The recipient pledges to heaven with ninety feet of azure brocade. On the day of ascetic practice, inscribing the talisman upon the left palm allows one to grasp the azure radiance and take flight. Inscribing nine inches of azure silk and wearing it on the left elbow summons the Six Jia and Twelve Spirits, with twelve *Numinous Flying Jade Maidens* attending at the left.\n\nThe *Lower Numinous Flying Jade Talisman of the Primal Feathered Essence of Dark Jade* is worn for seven years, enabling one to ride the void and ascend to the Five Stars. Those who practice the flying paces to ascend the dark mysteries without this talisman cannot traverse the void. The recipient pledges to heaven with sixty feet of white brocade. On the day of ascetic practice, inscribing the talisman upon the right palm allows one to grasp the white radiance and take flight. Inscribing nine inches of white silk and wearing it on the right elbow summons the Six Jia and Twelve Spirits, with twelve *Numinous Flying Jade Maidens* attending at the right.\n\nThe *Left Numinous Flying Jade Talisman of the Dark Qi’s Primal Essence and White Feathered Writ* is worn for nine years, enabling one to ride the void and ascend to the Five Stars. Those who practice the flying paces to ascend the dark mysteries without this talisman cannot tread the clouds to ascend the dark mysteries. The recipient pledges to heaven with eighty feet of cinnabar brocade. On the day of ascetic practice, inscribing the talisman upon the sole of the left foot allows one to tread the void and take flight. Inscribing nine inches of crimson silk and wearing it on the left elbow summons the Six Jia and Twelve Spirits, with twelve *Numinous Flying Jade Maidens* attending at the front.\n\nThe *Right Numinous Flying Jade Talisman of the Primal Qi’s Essence and Ascending Dark Feathered Writ* is worn for nine years, enabling one to ride the flying clouds and traverse the Jade Clarity. Those who cultivate the flying paces without this talisman cannot tread the Seven Primes to ascend the void. The recipient pledges to heaven with fifty feet of dark brocade. On the day of ascetic practice, inscribing the talisman upon the sole of the right foot allows one to tread the dark and take flight. Inscribing nine inches of black silk and wearing it on the right elbow summons the Six Jia and Twelve Spirits, with twelve *Numinous Flying Jade Maidens* attending at the rear.\n\nThe *Great Numinous Flying Jade Talisman of the Yang Qi’s Yellow Essence and Flying Feathered Writ* is worn for nine years, causing a golden light to emanate from the face, enabling one to vanish while sitting or standing and to fly through the great void. Those who cultivate the flying paces without this talisman cannot ascend to the stellar pivots or transcend the Nine Darks. The recipient pledges to heaven with twelve feet of yellow brocade. On the day of ascetic practice, inscribing the talisman before the heart allows one to exhale *qi* as clouds and ride them in flight. Inscribing nine inches of yellow silk and wearing it on the left elbow summons the Six Jia and Twelve Spirits, with twelve *Numinous Flying Jade Maidens* attending the body.\n\nIn all practices of meditative visualization upon the Seven Stars, one must first ingest the five talismans before inscribing them. When inscribing or ingesting the talismans, face east, click the teeth twelve times, and pray aloud:\n\n*\"Dark Void and Purple Clarity,\nFlying *Feathered Writ*,\nAbove you illumine the cloud palaces,\nBelow you command the thousand spirits.\nYou govern the Six Jia,\nTransport my bodily form,\nTraverse the celestial warp,\nAscend to grasp the Dipper’s essence.\nCongeal the hun and solidify the po,\nInternally secure and fill the self.\nExiting the void and entering the dark,\nEver abide with the qi.\"*\n\nUpon completion, ingest the talisman and inscribe it upon the five centers, then proceed with the practice. After nine years of such cultivation, one may ride the void and command the clouds, flying through the Great Clarity. The *Left* and *Right Numinous Flying Jade Talismans* emerge from the *qi* of spontaneity, transmitted by the Great Perfected to ascend the void, tread the celestial warp, entwine the Seven Primes, and ascend to the Jade Clarity, perfecting the *Flying Feathered Writ*.\n\nThose who attain it become divine immortals; those who wear it become perfected beings. Those who cultivate it summon the white-luan chariot and the black-winged phoenix to welcome their bodies, ascending to the Jade Clarity Palace to roam and feast in the Eternal Yang. The Most High Lord of the Great Dao transmitted it to the Supreme Prime Lord of Grand Simplicity and the Celestial Emperor of the Grand Tenuity. When the Dao is practiced to completion, it is concealed within the Numinous Capital of the Most High. According to the regulations, it is transmitted once every three thousand years, and must not be lightly divulged or revealed to celestial perfected ones. Those who violate the covenant and betray their oaths will have their bodies consigned to the offices of ghosts, their misfortune extending to nine generations, bound in the Dark Springs.\n\n*The Flying Feathered Writ: Nine Perfected Ascending to the Primordial Upper Record*\nThe Most High Lord of the Great Dao once received *The Flying Feathered Writ: Nine Perfected Ascending to the Primordial Upper Record*, its treasured words inscribed in purple script and green-gold characters, the Dao of traversing the void and treading the empty sky upon floating radiance, bestowed by the Highest Lord of the Dao in the Jade Clarity Upper Palace. Thereupon, the Most High Lord of the Great Dao transmitted its essentials to the Jade Emperor of the Highest Clarity. The Jade Emperor of the Highest Clarity transmitted it to the Supreme Prime Lord of Grand Simplicity, who in turn transmitted it to the Celestial Emperor of the Grand Tenuity. The Celestial Emperor of the Grand Tenuity practiced its true secrets and transmitted it to the Yellow Radiance Lord of the Central Dawn. The Yellow Radiance Lord of the Central Dawn transmitted it to the Purple Numinosity Lord of the Primordial Beginning, who transmitted it to the Yellow Elder Lord of the Center. The Yellow Elder Lord of the Center transmitted it to the Jade Guardian King of the Nine Subtleties, the Great Minister of Fate, the High Dawn Master, the Azure Lad, and the Great Lord Fanmei, instructing them to teach this text to those worthy of becoming perfected beings. All who possess the *Crimson Record of Grand Simplicity* or whose names are inscribed in the Golden Portal shall be permitted to behold this text. Those unworthy shall not encounter it. Should one wish to transmit it, one must first attain perfect resonance and response before bestowing it. They shall swear an unbreakable oath, pledging inviolable secrecy.\n\nThose who possess this scripture shall be attended by twenty-four Jade Lads and twenty-four Jade Maidens sent by the Three Primordial Lords of Grand Simplicity, who shall stand to the left and right of the scripture, correcting and restraining transgressions of carelessness and disclosure, guarding and protecting the bearer. This is the Dao of the central perfected, not of the ordinary ranks of immortals. It is the central perfection of harmony, aligned with the registers of the Three Primes, its name recorded in Grand Simplicity. In action, it is marked by purple-feathered standards; in travel, it is borne by the eight-radiance cloud chariot. Ten thousand spirits lead the way, a thousand perfected follow behind. Nine phoenixes cry in unison, celestial zithers play their strings. Divine dragons open the path, the Five Emperors’ banners flutter. They traverse the Great Void, roaming and feasting in the Cinnabar Empyrean, attaining the rank of Master of the Jade Ministers among the Perfected of the Highest Clarity.\n\nAll who possess *The Flying Feathered Writ of the Most High: Ascending to the Primordial Nine Perfected* shall observe the rule of six transmissions in three thousand years. If a worthy recipient is found, it may be bestowed in a single day. If none are found when the three-thousand-year limit expires, six copies shall be inscribed in red on plain silk, sealed within the Golden Terrace Chamber of Mount Emei. Beyond this, it shall not be transmitted again. To transmit it to the unworthy is to divulge the Dao of the perfected. To receive it without upholding the regulations is to violate the oath of the perfected. The transmitter is the scripture master; the recipient is their disciple. Those who defy the scripture, disregard its precepts, or reveal its treasured words shall have their seven generations of ancestors brought before the Dark Capital to endure the trials of the Wind Blade. Their bodies shall become lowly ghosts, submerged in the River of Eternal Night.\n\nTo receive the *Flying Feathered Writ*, scatter gold as an oath. To know the taboos of immortality, offer a silk kerchief as a pledge. Once you comprehend the feathered scripture, heaven and earth become as one. Having heard these mysterious words, you shall transcend and ride the auspicious clouds—this is what it means.\n\n*Inscribed on the stone stele of the Terrace of Committed Feathers.*\n\nThe Three Primordial Lords of Grand Simplicity have said: Immortals first know the Dao of concealing themselves beneath the Dipper’s stars, yet do not know the method by which perfected beings conceal the Dipper’s stars. The Nine Dipper stars are the true canopy of the Celestial Pivot, the radiant treasure of the Mysterious Axis, the mechanism that binds the eight directions, the hub that revolves the nine measures. They turn and shade the square and round, governing and harmonizing the qi, regulating yin and yang, presiding over all without exception.\n\nThe Dipper’s stars—brilliant and luminous—veil the night. The turning jade mechanism sets them in motion. The Four Symbols flow and descend from them. Mysterious brightness shines resplendently, their majestic radiance blazing. The Supreme Lord of the Great Void has said: Immortals merely know how to chew yin and yang, to exhale and inhale the two qi, yet do not know that the Dipper’s stars are the root and repository of yin and yang, the mysterious warp of the two images. They toil arduously at the waves’ ends, failing to recognize the ease of tending to the source. They shelter beneath its branches and leaves, yet lose the root and foundation. Why not conceal the Nine Dipper, refining and forging the supreme image?\n\nPractice this for fourteen years, and the Most High shall welcome you with a jade wheel. You shall traverse the void and tread the empty sky, ascending to the Highest Clarity, ranked among the supreme perfected. Your spirit shall return, your countenance rejuvenated, and all spirits shall attend your chariot. The Azure Lad has said: Immortals merely know the great majesty of the turning jade mechanism, its brilliance startling the myriad stars. They behold the flowing radiance of the nine paths, delight in its circular motion to gather the spirit, sheltering beneath it to seek great attainment, employing it to seek divine immortality. Yet they still do not know how to turn the nine lights inward to illuminate, to conceal the bright Dipper within the muddy pellet. Thereby, the hun is congealed and the po refined, virtue and cloud-mist harmonized. Those who master this Dao ascend to the Highest Clarity; those who attain it become supreme perfected.\n\nThus, the perfected embrace the great image to conceal the radiance, enclose the Dipper’s essence to hide the self. My former master therefore rode upon green clouds to the left, reined the crimson dawn to the right, ascending to Grand Simplicity, traversing the void and treading the empty sky. Visualize the Dipper’s stars as purple, its warp as red. Sense the purple qi as warm and gentle. Envision the stars’ sizes as you practice. This is the oral instruction of the Azure Lad.\n\nFormerly, Master Wucheng, Master Guxi, Master Guangcheng, and Master Qingzhen together visualized the qi of the Dipper’s stars, merging it with their bodies to enter the lotus seed. Suddenly, they beheld within the lotus a golden pond a thousand leagues wide, jade mountains ten thousand qing in expanse. Palaces, terraces, chambers, and halls stretched unbroken into the clouds. Vermilion trees bore fruit, purple blossoms bloomed in gardens. Azure carriages and mysterious yellow banners, the Three Simplicities and Eight Wheels—wondrous sights beyond naming.\n\nThe four masters roamed for some time, then turned their gaze in leisurely contemplation and returned. At that moment, they were unaware of the lotus seed’s center—such is the principle of the great entering the small, transformation without trace, the utmost resonance of stellar visualization, the essence of vastness and constriction. Thus may the tip of a hair become the Eight Extremes; how could the lotus seed not be wondrous?\n\nOn the first, third, or fifth day of the lunar month, at midday or midnight—these are the appointed times. Enter the hall, sit upright, face north, and clasp your hands. Regulate the breath, close the eyes, and then visualize the nine stars of the Northern Dipper descending into the head’s Mud-Pill Palace, with the Dipper’s handle pointing forward and its bowl tilted upward. After a long while, suddenly behold within the Dipper’s bowl a great divine figure, whose robes and name accord with the invocation’s words. After a great while, the head should grow slightly warm, gently so. This is the true qi of the Nine Essences of the Upper Prime entering the head, thus the unusual warmth—a sign of response to the verification of resonance.\n\nThen swallow saliva fifty times and click the teeth nine times. With the left hand’s third finger, press between the brows and softly recite the prayer:\n\n“Supreme Purple Radiance, honored of the Nine Paths,\nCanopy of sevenfold splendor, revolving brilliance of ten thousand dawns,\nMoving, you command the lofty spirits; still, you harmonize with the luminous clouds.\nYin and yang flow and irrigate, the single qi divides at the center,\nRoaming and aiding beyond all bounds, illuminating and brightening the host of heavens.\nThis month, this day, this hour, ascend to the Mud-Pill Palace.\nThe primal essence gathers and resonates, transforming into a great spirit,\nNamed Marvelous Pivot, whose child is the Numinous Net,\nSeated upright within the Dipper, roaming my Bright Hall.\nFeathered phoenix cloak of purple, tiger-embroidered cinnabar robes,\nLeft side girded with jade pendants, right waist hung with golden bells,\nHolding a flowing tassel, head crowned with dawn’s light.\nExhaling qi to bathe the essence, the Mud-Pill Palace is made sound,\nHun and po congeal in harmony, planting the flowering pillars and beams.\nLet me become a flying immortal, traversing the void and treading the empty sky,\nAscend to the Upper Clarity, rein the tiger and command the dragon,\nPay court to the Jade Emperor in the north, the Jasper-Limned Upper Palace,\nAnd in the west, prostrate before the Great Simplicity, bowing to the Three Primes.”\n\nWhen the prayer is finished, swallow saliva thirty times and click the teeth nine times. Recite the prayer again as before, then rise, face north, and bow twice; face west, and bow twice. No longer close the eyes; the practice is complete. This may also be performed on the bed in a quiet chamber, without descending to the ground for the bows.\n\nThe true practitioner values stability in what is inherently stable, honoring the wondrous and subtle while avoiding convoluted deviations that disrupt the natural order of rest and repose. The essential Dao is unburdened—thus transcending all comparison. The subsequent three invocations all follow and emulate this method, differing only in their prayers and the orientation of the visualized stars.\n\nThe key lies in performing this within a secluded chamber, ensuring no one witnesses the visualization. For during this practice, jade youths and jade maidens stand beside you as overseers. One must not approach mourning rites, encounter corpses, or come into contact with impurities. Clothing, bedding, headscarves, and footwear must not be misused or lent to those of a different kind. What is this \"different kind\"? Those whose aspirations do not align with yours. Those not of like mind should not share your mat, nor should those not of your covenant share your vessel. Daoists and laypeople differ: those who revere the Six Heavens or serve mountain and river demons must not be entertained in your chamber, nor should you partake of their food, wear their garments, or don their headscarves. This is to avoid the foul qi of their corpse-like impurity and to block the passage of their perverse winds. Such is the true Dao of the true Dao, the essence of the most refined essence.\n\nIf one can embody this refinement, one attains the true Dao; by shunning impurity, one gains renewal. But those who dwell in chaos, mingling the foul with the fragrant in the same vessel, failing to distinguish the divine, neglecting to refine their qi, cohabiting with the licentious while sharing space with the upright, allowing perverse winds to unsettle the heart or treading in dust without aspiring to transcendence—such seekers will find no truth. As the radiant pearl does not emerge from a cesspit, nor does mediocre talent flourish in exalted ranks, so too is this principle.\n\nWhen essence and resonance align, the numinous responds with subtle efficacy. Jade blossoms manifest as signs, and divine radiance shines forth as verification. Unless they are your teacher, do not speak of this lightly.\n\nThe great spirits within the Dipper are the essences of the Nine Stars, born suddenly through resonant transformation. When practicing this method, first visualize their names and forms, then conclude with the invocation. After the invocation, the spirits will appear—visualize them again as before. If the star spirit of the Mud-Pill Palace is to be constantly visualized, let it reside within. Model all practices after this example.\n\nVisualize the Dipper’s stars descending until, through intense focus, you suddenly feel them within your form. If at first they do not come, persist in visualization until they seem to dwell within—this is sufficient to evoke resonance. With time, one naturally enters the wondrous.\n\nOn the seventh, ninth, and thirteenth days of the lunar month, at the hour of *yu zhong* or midnight, enter your chamber, sit upright, clasp your hands, regulate your breath, and close your eyes. Then visualize the Nine Stars of the Northern Dipper descending into your heart, with the handle of the Dipper pointing upward toward your throat and the *kui* (the Dipper’s bowl) facing outward. After a long while, you will suddenly see within the *kui* a great spirit, clad and named as described in the invocation. Eventually, you will feel warmth in your heart as true qi enters.\n\nThen swallow saliva fifty times and click your teeth nine times. Raise your right hand’s second finger to press your heart, and softly recite the incantation:\n\n*\"Supreme Purple Perfection, spirit of the Nine Qi,\nEncompassing the myriad measures, the radiant turning jade,\nFlying auroras stream with luminous brilliance,\nIlluminating the Jade Clarity,\nDark canopy of all dawns,\nYin and Yang divide and unite,\nThe Four Harmonies descend in exchange,\nThe Seven Wefts align in sequence,\nOn this auspicious lunar day,\nCome to shine within my heart’s court,\nFlying light and boundless radiance,\nFilling the Central Palace,\nThe Six Palaces open their gates,\nFlowing essence levels all,\nHun and po refined and tempered,\nAttaining the essence of the true,\nResonant transformation at touch,\nMyriad transformations instantly complete,\nSuddenly the great spirit appears,\nSeated steadfast in my heart’s chamber,\nRegulating breath and gathering fluids,\nA hundred joints flow unobstructed,\nGrasping the Dipper and seizing the *kui*,\nGazing afar in all directions,\nNamed *Xuan Du*,\nStyled *Su Kang*,\nCrimson-feathered mantle,\nDragon belt and tiger robe,\nBody born of jeweled radiance,\nNeck bearing a halo of light,\nHeadscarf of flying dawn,\nCrown of heroes rising and falling,\nGrant me flight as an immortal,\nSoaring through the great void,\nAscending to the Purple Palace,\nPaying court to the Jade Emperor in the north,\nCommanding the myriad spirits,\nAll numinous beings in attendance,\nBlossoms blooming above my heart,\nAuspicious clouds eternal,\nPhoenixes cry with tinkling clarity,\nLuan-birds sing with resonant chime.\"*\n\nWhen the incantation is finished, swallow saliva thirty times and click your teeth nine times. Recite the incantation again as before, then rise, face south, and bow twice. The practice is complete; open your eyes.\n\nOn the fifteenth, nineteenth, and twenty-third days of the lunar month, at the hour of *yu zhong* or midnight, enter your chamber, sit upright, clasp your hands, regulate your breath, and close your eyes. Then visualize the Nine Stars of the Northern Dipper descending into the Lower Palace, three inches below the navel, with the Dipper’s handle pointing upward toward the heart and the *kui* facing outward. After a long while, you will suddenly see within the *kui* a great spirit, clad and named as described in the invocation. You will also feel warmth in your navel as true qi arrives.\n\nThen swallow saliva sixty times and click your teeth nine times. Raise your left hand’s third finger to press the *ren zhong* point below your nose, and softly recite the incantation:\n\n*\"Supreme Purple Emperor,\nRadiant and resplendent at the central pivot,\nNine Wefts gleaming in luster,\nLight surpassing the great aurora,\nMyriad spirits look up in reverence,\nA thousand dawns plant their roots,\nSeven Degrees employed in brightness,\nNine Mists blooming in fragrance,\nGoverning Yang to manifest obedience,\nGrasping Yin to achieve harmony,\nTrue radiance opens the array,\nDark roots encompass all,\nOn this auspicious lunar day,\nCome to shine within my navel,\nPurple qi rising to the heavens,\nFlying light descending in streams,\nRefining my hun and po,\nFlourishing essence and vital fluids,\nSuddenly the great spirit appears,\nNoble and divine in the Upper Palace,\nNamed *Zhu Meng*,\nStyled *Liu Yu*,\nSeated upright within the navel,\nRiding the Nine Qi of the Dipper,\nExhaling and inhaling numinous fluids,\nBalancing blood and regulating the stomach,\nYellow phoenix-feathered mantle,\nDragon robe and tiger belt,\nHands unlocking the sun’s root,\nHead crowned with green hibiscus,\nWaist ablaze with flowing fire,\nLightning’s brilliance illuminating the boundless,\nGrant me flight as an immortal,\nTreading the void and soaring aloft,\nAscending to the Jade Chamber,\nBearing the canopy of the celestial void,\nCommanding the myriad spirits,\nHeaven and Earth in shared repose.\"*\n\nUpon concluding the invocation, swallow the saliva thirty times and click the teeth nine times. Repeat the invocation as before, and when finished, rise to face one’s life-star and bow twice. After bowing, open the eyes.\n\nThe practice of the Lower Prime’s Dao is now complete.\n\nIf the hands are raised with fingers interlaced, this occurs during the invocation; once the invocation ends, return the hands to their original position.\n\nOn the eight seasonal nodes at midnight, enter the chamber and sit upright. Interlace the hands, settle the qi, close the eyes, and inwardly visualize the entire body rising gently, ascending to fly into the Dipper’s *Kui* asterism. Persist in this visualization until sensing one’s form already within the Dipper. Focus intently, and when warmth is felt throughout the body, this is the true qi uniting with virtue.\n\nNext, visualize the names, appearances, and colors of the Nine Essences and Three Spirits, their forms like newborn infants. The Three Spirits sit facing me, and I bow to them in my heart. Concentrate the vision until the body seems to dissolve into faintness, inducing a state of profound absorption.\n\nThen swallow the saliva eighty times and click the teeth nine times. Raise the left hand to rest upon the heart and softly invoke:\n\n*\"Supreme Cinnabar Numinous,\nMysterious radiance blazing like a whirlwind,\nNine jades unlock the celestial pivot,\nLuminous qi diffuses in clarity,\nPurple dawn illumines the hidden,\nSeven luminaries gleam resplendent,\nDual effulgences proclaim brightness,\nYin and Yang divide in harmony,\nFour measures flourish in use,\nNuminous fluids return in reflux,\nEight nodes awaken qi,\nAscending to the Nine Origins,\nGrasping the Dipper’s handle,\nI present myself to the Three Spirits.\nThey ask why I linger,\nWhy I have not yet ascended as an immortal.\nI bow my head in awe before the Emperor,\nThen grow majestic in might,\nMouth holding the sun’s root,\nLeft shattering the Six Heavens,\nRight overseeing Mount Feng,\nFlowing bells blaze above,\nTen thousand demons shatter and scatter.\nThus they know my po,\nStrengthen my three hun,\nConceal the Dipper’s inner radiance within,\nNine Essences abide in the heart,\nPurple auroras glow in mutual reflection,\nFlying light spans ten thousand fathoms.\nHarmonizing the hun and restraining the po,\nSix wombs refine in balance,\nEssence responds in transformation,\nThe Jade Consort suddenly appears,\nSeated within my heart,\nGazing down and up in mutual regard.\nHer name is *Mihua*,\nStyled *Linqian*,\nExhaling and inhaling the dual qi,\nPacifying the hundred meridians.\nHer body wears a mantle of refined light,\nPhoenix radiance and simurgh skirts,\nTiger-scribed belt at the waist,\nDragon patterns in jade script,\nHands holding moon’s essence,\nHead crowned with purple coronet.\nLeaping into the Great Empyrean,\nRiding the canopy of light,\nInscribed in the *Tai Su*,\nI attain flight as an immortal,\nTranscending the empty vastness,\nMounting the Jade Prime,\nAscending to the Crimson Chamber,\nCommanding the myriad spirits,\nBalancing the Two Measures,\nReturning to infant visage.\nThe Northern Emperor’s lightning,\nThe Southern Emperor’s fire array,\nThe Azure Emperor’s kindled torch,\nDazzling thunder and lightning,\nWestern currents double-striking,\nResonant tones chanting in harmony,\nFourfold leaps propel me upward,\nRecommending me to the Jade Perfected.\nThereupon I ride the Eight Effulgences,\nRoaming and feasting amidst the Nine Mists.\"*\n\nUpon concluding the invocation, swallow the saliva thirty times and click the teeth nine times. Repeat the invocation as before, then rise to face the northwest and bow twice. After bowing, open the eyes.\n\nThe practice of the Eight Nodes’ Perfection is now complete.\n\nThis Dao is the secret wonder of transcending emptiness, the marvelous method of the Nine Perfected. The practice is divided into three stages, with nine days of monthly cultivation—hence it is called the *Nine Perfected Ascending the Mysterious Writ*. It is a treasured text among the esoteric scriptures of the Supreme Perfected, the essential formula for attaining perfection.\n\nWhen transmitting this to a worthy recipient, the receiver must first undergo a purification fast for one hundred days, or thirty days, or ten days, according to their capacity. Additionally, they should observe a one-day fast beforehand to cleanse their sincere heart. The transmitter must also fast in the same manner as the receiver. On the day of transmission, both parties shall first draw blood to consecrate the altar, cut their hair, and swear an oath of secrecy. Later sages, however, deemed blood sacrifice harmful to the vitality of living beings and hair-cutting a violation of bodily integrity. Thus, they substituted three taels of yellow gold for the blood oath and thirty-two feet of green silk for the hair-cutting pledge.\n\nThe master and disciple must not treat these oath objects as private possessions or misuse them; instead, they should be offered to reclusive Daoists dwelling in lofty mountains or to solitary, impoverished practitioners. If one has ascended to walk the void, the objects may be cast into mountain chambers or scattered upon sacred peaks. This is done to demonstrate that heavenly trust is profound and the Dao’s essence is prized above material wealth.\n\nThose who violate these precepts will cause their seven generations of ancestors to suffer the trials of the Wind Blade in the Dark Capital, while their own souls shall become lowly ghosts. The transmission period, the method of bestowal, and all procedures must adhere strictly to the above regulations, with oath objects of the finest quality. The recipient’s heart must be pure and refined, their sincerity unwavering, and their devotion complete.\n\nThe transmitter is the master and guide, while the receiver is the disciple. Those who hear the Dao should look to the master as their model; those who seek life should dwell near the realm of life. Those who fail to uphold these teachings, who neglect or disrespect them, will cause their three generations of ancestors to be punished by the Fire Bureau, while they themselves shall be afflicted with lifelong ailments.\n\nThe Yellow Emperor once studied under the Master of Mount Jing, who knew only the method of refining stones—no other wonders—and was hardly superior to the Yellow Emperor. Yet because the Yellow Emperor inquired about the art of refining stones, he became his disciple. The Master of Mount Jing was a descendant of Lord You of Ji and now resides on Mount Weiyu. He can refine stones into water, boil water into jade, and grind jade into powder, which he consumes with stone water. Those who master this art may endure as long as heaven itself, yet they cannot soar through the empty void or grasp the morning mist in their hands. Though the art of refining stones is marvelous, it remains but a minor technique.\n\nHere ends the *Supreme Perfected’s Scripture of Soaring on Wings: The Upper Record of the Nine Perfected Ascending the Mysterious*. The following section is the *Central Scripture of the Nine Perfected of the Supreme Perfected*. Though it contains an upper and lower sequence, its methods and applications differ and do not intersect.\n\nThe Central Yellow Lord of the Dao transmitted this to the Perfected of the Great Void, alongside the *Eight Esoteric Sayings*. The *Central Scripture of the Nine Perfected* is practiced among humans and includes oral instructions, though the main text is too sacred to be written. Now, the prescribed methods are as follows:\n\n**First Perfected Method**: To be practiced on the 5th, 15th, 25th, 27th, and 29th days of the fifth month—five times in a month, all at dawn.\n\n**Second Perfected Method**: To be practiced on the 8th, 11th, 14th, 19th, 23rd, and 27th days of the eighth month—six times in a month, all at the hour of *chen* (7–9 AM).\n\n**Third Perfected Method**: To be practiced on the 6th, 7th, 17th, 18th, 25th, and 26th days of the sixth month—six times in a month, all at the hour of *si* (9–11 AM).\n\n**Fourth Perfected Method**: To be practiced on the 2nd, 8th, 14th, 18th, 19th, and 28th days of the first month—six times in a month, all at noon.\n\n**Fifth Perfected Method**: To be practiced on the 3rd, 8th, 13th, 20th, and 26th days of the third month—five times in a month, all at the hour of *wei* (1–3 PM).\n\n**Sixth Perfected Method**: To be practiced on the 7th, 11th, 14th, 18th, 23rd, 25th, and 28th days of the seventh month—seven times in a month, all at the hour of *shen* (3–5 PM).\n\n**Seventh Perfected Method**: To be practiced on the 2nd, 6th, 9th, 13th, 16th, 19th, 23rd, and 27th days of the eleventh month—eight times in a month, all at the hour of *you* (5–7 PM).\n\n**Eighth Perfected Method**: To be practiced on the 2nd, 7th, 9th, 15th, 18th, 19th, and 27th days of the second month—seven times in a month, all at the hour of *xu* or *hai* (7–11 PM).\n\n**Ninth Perfected Method**: To be practiced on the 3rd, 9th, 17th, 19th, 26th, and 29th days of the twelfth month—six times in a month, all at midnight.\n\nHere end the oral instructions of the *Central Scripture of the Nine Perfected*. These days and hours are when the qi of life converges and the essence of the Perfected aligns, making it most auspicious for visualization and readily invoking the mysterious response. If one dwells in seclusion atop lofty peaks, hidden among cloud-wreathed cliffs, severs all worldly ties, purifies the intestines by abstaining from grains, joins hands to rectify the heart, and meditates upon the morning’s essence, they should practice daily as prescribed in the original scripture.\n\nHowever, as most people in the world are occupied with affairs and cannot cultivate in daily tranquility, the above schedule is provided. Practicing for fourteen years is sufficient to transcend the empty void, master life and death, pass through water and fire, ascend to the Supreme Clarity, cause the five viscera to blossom, and commune with heaven.\n\nThe *Upper Scroll of the Scripture of Ascending the Mysterious on Wings* requires three repetitions in a month, totaling nine days—this is due to the world’s lack of perfect stillness. If one maintains long fasts, embraces solitude, gazes upon the empty vastness, and focuses the heart beyond worldly matters, they should practice on these days in sequence.\n\nA monthly practice of nine repetitions is merely for those still dwelling among worldly concerns. At the eight solar nodes, one should meditate upon the Dipper’s midst, and suddenly perceive the Jade Consort seated before them. The Jade Consort exhales purple mist into one’s mouth, and after a long while, her robes appear as invoked at the eight nodes. This woman is the yin spirit of the Nine Essences, the Supreme Clarity’s foremost consort.\n\nThis is the oral transmission of the Azure Lad.\n\nHere ends the *Scripture of the Five Constants of the Supreme Clarity: Transformations and Myriad Changes in the Murky Depths*. #1 The character *nai* 乃 was originally written as *ji* 及.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清五常变通万化郁冥经 经名：上清五常变通万化郁冥经。 撰人不详。 系纂集《飞步空常诀》、《龙飞尺素诀》、《白羽黑翩灵飞玉符》、《飞行羽经九真升玄上记》四篇早期上清经诀而成。 一卷。 底本出处：《正统道藏》洞玄部本文类。 上清五常变通万化郁冥经 太上大道君曰：空常者，天地之魂魄，阴阳之威明。 空者，九天之魂精； 常者，九地之魄灵。 其二炁则结成帝尊之大神，以威辅弼之焕明。 空常则以辅弼为瞻视，役运天光，察观万方，总录天宿，回化五常，召运摄会，促机转输。 天休地泰，则空常隐藏； 天否地激，则空常焕明。 吉凶报应，立告不祥，变化万气，改易阴阳，四时代谢，莫不由焉。 故二星尊贵，隐伏华晨，皆空常之妙趣，难可屡瞻也。 得见二星，延寿无穷，存修其道，飞升华堂，上真秘言，此之谓也。 上相青童君敢请问：空常之道，灵音妙贵，岂可闻乎。 太上大道君曰：空常者，天地之至名，而谓之无名，混而为一，是为有名。 但九天秘其灵音，不行於经文，既运辅弼为视听，倚光景以通真，帝尊禀之以致治，学者御之以致仙，使有心者求之於无测，因复名之为有名。 有名而不传於莽莽之徒，莫能测焉，好尚者而不获其真也，如此岂复为劝学之宗者哉。 然九天有命，唯宿有玄图玉字，方诸刻简，来生合真之人，得参隐名。 君当总掌群方，试校万仙，理定幽微，拯救兆民，不得冒禁相告，子当秘焉。 於是君便登云景之上丹灵朱房，清斋三月，裂帛告灵，金羊银雁，礼天受真。 道君告曰：九天有禁，依格万劫一传，令运度交周，气反上清，道应行於今。 一依玄科，七百年中有其人听三传，自无其挺，封还九天，或付名山九洞之室，轻泄漏慢，责及七祖，摙汲溟波以灌四渎，担负诸山以填河海，此祸福报应，无一差失也。 子明审此言，慎而行焉。 凡欲步空常，飞纲以逃形变景，飞行玉清，当以一月七过行之，八节、六丁日，亦行其道。 至其日，入室烧香左右，敷置图席，南向叩齿二十四通，闭目思五星焕明五方，良久，来下入己身五藏之中。 金星入肺宫，土星入脾宫，火星入心宫，木星入肝宫，水星入肾宫。 五星光明，洞照五藏，觉体熏热，便思五星皇夫人及二十五点空常晨君，姓讳衣服，各在其方。 都毕，而微祝曰： 金木水火土，总统四元，玄精流映，光照五门，中有五皇夫人灵君，二十五点空常天尊，变化形影，千合万分，降入五藏，结成玉仙，炼我七魄，育我三魂，举形上升，飞入斗门，遨戏上都，五星齐群，今日玄庆，请如所陈。 毕，引星光炁二十五咽止。 便起登纲也。",
      "translated_text": "**The Supreme Clarity Scripture of the Five Constants’ Transformations and Myriad Changes in the Murky Darkness**\n\n**Scripture Title:** *The Supreme Clarity Scripture of the Five Constants’ Transformations and Myriad Changes in the Murky Darkness*. Author unknown. Compiled from four early Supreme Clarity scriptural formulas: *The Flying Steps of the Void Constant Formula*, *The Dragon-Soaring Silk Measure Formula*, *The Jade Talisman of the Spirit-Flight with White Feathers and Black Wings*, and *The Nine Perfected’s Ascension to the Mysterious Record of the Flying Feather Scripture*. One scroll. Base text from *The Orthodox Daoist Canon*, *Cavern Mystery Section*, *Scriptural Writings Category*.\n\n---\n\nThe Most High Lord of the Great Dao said: The Void Constant is the hun-soul and po-soul of Heaven and Earth, the majestic brilliance of yin and yang. The Void is the hun-essence of the Nine Heavens; the Constant is the po-spirit of the Nine Earths. Their two qi congeal to form the great spirit of the Imperial Honored One, whose radiance aids and illuminates. The Void Constant, with its aiding brilliance as its gaze, commands the movement of celestial light, surveys the ten thousand directions, records the celestial lodges, revolves the Five Constants, summons and directs gatherings, and hastens the turning of mechanisms. When Heaven is at rest and Earth at peace, the Void Constant conceals itself; when Heaven is in decline and Earth in turmoil, the Void Constant shines forth. Fortune and misfortune, omens and portents—it instantly reports all inauspicious signs. The transformations of the myriad qi, the alterations of yin and yang, the succession of the four seasons—none occur without its agency. Thus, the two stars are revered and noble, hidden within the splendor of dawn, their wondrous subtlety belonging to the Void Constant, rarely to be glimpsed. Those who behold the two stars gain boundless longevity; those who cultivate and preserve this Dao ascend in flight to the Hall of Splendor. This is the secret teaching of the Highest Perfected.\n\nThe Prime Minister, the Azure Lad, respectfully inquired: The Dao of the Void Constant is spiritually resonant and wondrously noble—may it be heard?\n\nThe Most High Lord of the Great Dao said: The Void Constant is the supreme name of Heaven and Earth, yet it is called the Nameless. Blended into one, it becomes the Named. However, the Nine Heavens guard its spiritual resonance, which does not circulate in scriptural texts. Since it employs its aiding brilliance for seeing and hearing, relying on light and shadow to communicate with the real, the Imperial Honored One receives it to govern, and scholars wield it to attain immortality. It causes those with intention to seek it in the unfathomable, and thus it is again named the Named. Though named, it is not transmitted to the reckless; none can fathom it. Those who esteem it yet fail to attain its truth—how could this serve as the foundation for encouraging study? Yet the Nine Heavens have decreed that only those destined to possess the Dark Chart and Jade Characters, inscribed on the Fangzhu and bamboo slips, and those born to unite with the real, may partake of its hidden name. You shall oversee the myriad regions, examine the ten thousand immortals, settle the subtle and obscure, and deliver the countless people. You must not rashly disclose it in violation of the prohibitions—guard it well.\n\nThereupon, the Azure Lad ascended to the Vermilion Chamber of the Cinnabar Spirit above the clouds, purified himself for three months, tore silk to invoke the spirits, and with golden sheep and silver geese, paid homage to Heaven to receive the real. The Lord of the Dao declared: The Nine Heavens have strictures—according to the rules, it is transmitted once in ten thousand kalpas. Now, as the cycles intersect and qi returns to Supreme Clarity, the Dao is to be practiced in this era. Follow the dark statutes: within seven hundred years, there may be one who hears the three transmissions. If none are worthy, seal it and return it to the Nine Heavens, or entrust it to the chambers of the Nine Caves in the famous mountains. To lightly divulge or neglect it brings retribution upon the seven generations: drawing from the dark waves to irrigate the Four Rivers, bearing the weight of the mountains to fill the seas and oceans. This karmic response of fortune and misfortune leaves no room for error. You must clearly heed these words and act with caution.\n\nWhenever one wishes to tread the Void Constant, flying the net to escape form and transform appearance, and soaring into the Jade Clarity, one should practice this seven times in a month. On the Eight Nodes and the Six Ding days, one may also perform this Dao. On the appointed day, enter the chamber, burn incense to the left and right, arrange the mat and diagram, face south, and knock the teeth twenty-four times. Close the eyes and visualize the Five Stars shining brilliantly in the five directions. After a long while, let them descend and enter the five viscera within one’s body: the Metal Star into the Lung Palace, the Earth Star into the Spleen Palace, the Fire Star into the Heart Palace, the Wood Star into the Liver Palace, and the Water Star into the Kidney Palace. The Five Stars’ radiance illuminates the five viscera, and one feels the body suffused with warmth. Then visualize the Five August Ladies of the Stars and the Twenty-Five Celestial Lords of the Void Constant’s Dawn, recalling their surnames, personal names, and attire, each in their respective direction.\n\nWhen all is complete, softly recite the prayer:\n*Metal, Wood, Water, Fire, Earth—*\n*Together they govern the Four Origins.*\n*The dark essence flows and reflects,*\n*Illuminating the Five Gates.*\n*Within reside the Five August Ladies and Spirit Lords,*\n*The Twenty-Five Celestial Lords of the Void Constant,*\n*Transforming shapes and shadows,*\n*Uniting in thousands, dividing in myriad ways.*\n*Descend into the five viscera,*\n*Congeal to form Jade Immortals.*\n*Refine my seven po,*\n*Nurture my three hun.*\n*Raise my form to ascend,*\n*Fly into the Dipper’s Gate.*\n*Roam and play in the Upper Capital,*\n*The Five Stars gathered as one.*\n*Today, in this dark celebration,*\n*I request that all be as recited.*\n\nAfterward, draw in the star-light qi twenty-five times and swallow it. Then rise and ascend the net.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1012,
      "start_sentence": 0,
      "end_sentence": 34,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.60697627067566,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\上清五常变通万化郁冥经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "并足上太白星上，闭气七息，向西而微祝曰： 西方七门，白气飞光，上有皓帝，少阴明皇，讳金上精，衣服羽裳，艳精流映，焕明金宫，号曰五点，空常之宗，带符建节，召阴摄阳，变化水火，七十四方，使我飞步，隐景入空，驾乘白舆，遨翔云房，天地长年，永享无穷。 毕，仰咽七气止。 次行十二步，并足，上镇星上，闭气十二息，向西南仰天而微祝曰： 中皇四气，总监八灵，玉台紫房，神点化生，内有元皇，五帝隐名，号曰步常，安镇黄庭，衣带飞云，首建华精，执籍持符，焕落火铃，使我飞步，告我神名，下降脾府，镇神安精，上天入云，藏影逃形，变化万物，遨游玉清，得与皇君，俱保太明。 毕，引星光气十二咽·止。 次行三步，并足，上荧惑星之上，闭气三息，南向而微祝曰： 三门洞曜，丹光流精，玄气郁勃，焕照南冥，上有赤皇，五帝明灵，讳游光曜，衣锦文精，首建宝冠，腰佩玉铃，出入朱宫，紫房绛城， 保录我命，南宫记生，使我飞步，变气藏形，日吉行道，普天肃清，心神结真五魂洞明，齐光三气，合景火星。 毕，引星光气三咽止。 次行九步，并足，上岁星上，闭气九息，东向而微祝曰： 东方九气，青天玉门，中有青晨，玄上之君，流青郁勃，是为天魂，讳太明焕，天地高尊，身衣凤衣，斑文虎裙，化生五点，变景九端，头建青精，横天玉冠，金符羽节，流铃纷纷，手执隐书，飞行羽文，总我命录，保我肝门，外映内曜，肝府结仙，迎我高登，上朝帝晨。 毕，引星光气九咽止。 次行五步，并足，上辰星上，闭气五息，北向而微祝曰： 五气北玄，玄门洞灵，北晨流映，魁上玉清，中有太皇，五常尊名，讳阴元然，衣服玄清，首建玉冠，腰带流铃，金章玉节，翠佩焕明，徘徊华晨，傍观八冥，回津下降，入我肾庭，保录五神，藏府鲜荣，内外充溢，变景化形，骨飞肉升，上造玉清。 毕，仰引星光气五咽止。 步五星毕，从水星下，从金星上七步，又登空常纪也。 第一并足，上第一九常上，祝曰： 地九常君，变景幽冥，为我隐步，以逃我形。 次上第二育常上，祝曰： 育常灵君，形无常服，为我变化，身为草木。 次上第三卯常上，祝曰： 卯常尊神，能沈能升，为我化景，变成丘陵。 次上第四流常上，祝曰： 流常皇君，形无恒身，为我吐噏，兴气起烟。 次上第五行常上，祝曰： 行常大君，威伏万鬼，变化我形，起烟成火。 步五常毕，还金星上，闭气五息，而祝曰： 飞空太幽，化景五常，北入五气，南制三阳，金符命灵，太帝扶将，六戊逃己，保度洞乡，太白护肺，金镇胃肠，内充外溢，形魂俱翔，千变万化，适意所迎，得与玉皇，同游上京。 毕，引气七咽止。 次从金星十二步，登土星，并足，上第一上常上，祝曰： 上常翔翔，变化亿千，为我藏景，升入九天。 次上第二天常上，祝曰： 天常流炎，起烟成垒，为我逃形，带神入火。 次上第三名常上，祝曰： 名常北玄，以水为身，隐我河海，灌我成真。 次上第四三常上，祝曰： 三常变威，光制八庭，为我致仙，却灾攘兵。 次上第五辰常上，祝曰： 辰常万化，体无常形，为我致仙，逃死入生。 步五常毕，还土星上，闭气十二息，叩齿十二通，而祝曰：",
      "translated_text": "Standing with feet together upon the Star of Great White, hold the breath for seven cycles, then face west and softly recite the prayer:\n\n*Seven Gates of the West,*\n*White qi flies in radiance.*\n*Above dwells the Luminous Emperor,*\n*the Bright August of Lesser Yin.*\n*His name is Golden Supreme Essence,*\n*robed in feathered garments.*\n*Resplendent essence flows and reflects,*\n*illuminating the Golden Palace.*\n*Named the Five Points,*\n*ancestral of the Void Constant,*\n*he bears the talisman and raises the standard,*\n*summoning yin and seizing yang,*\n*transforming water and fire across seventy-four directions.*\n*Grant me flying steps,*\n*concealing my form to enter the void,*\n*driving the white chariot,*\n*roaming the cloud chambers.*\n*May heaven and earth endure,*\n*eternally without end.*\n\nAfterward, tilt the head back and swallow the star-light qi seven times. Then take twelve steps with feet together, standing upon the Star of Quelling, hold the breath for twelve cycles, face southwest, look to the heavens, and softly recite the prayer:\n\n*Four Qi of the Central August,*\n*overseeing the Eight Spirits,*\n*within the Jade Terrace and Purple Chamber,*\n*divine points give rise to transformation.*\n*There resides the Primordial August,*\n*the Five Emperors’ hidden names,*\n*styled the Stepping Constant,*\n*serene within the Yellow Court.*\n*Clothed in flying clouds,*\n*crowned with radiant essence,*\n*holding the register and talisman,*\n*adorned with falling fire bells,*\n*grant me flying steps,*\n*reveal to me the divine names.*\n*Descend into the spleen palace,*\n*quelling the spirits and settling the essence.*\n*Ascend to heaven and enter the clouds,*\n*concealing my shadow and eluding my form,*\n*transforming the myriad things,*\n*roaming the Jade Clarity.*\n*May I, with the August Lord,*\n*together preserve the Great Luminance.*\n\nAfterward, draw in the star-light qi twelve times and swallow it. Then take three steps with feet together, standing upon the Star of Blazing Deluder, hold the breath for three cycles, face south, and softly recite the prayer:\n\n*Three Gates gleam resplendent,*\n*cinnabar light flows with essence.*\n*Mysterious qi surges and billows,*\n*illuminating the Southern Darkness.*\n*Above dwells the Crimson August,*\n*the Five Emperors’ bright spirits.*\n*His name is Wandering Radiance,*\n*clothed in brocade and patterned essence,*\n*crowned with a treasure diadem,*\n*girded with jade bells.*\n*He enters and exits the Vermilion Palace,*\n*the Purple Chamber and Crimson Citadel.*\n*Preserve my life’s record,*\n*inscribed in the Southern Palace.*\n*Grant me flying steps,*\n*transforming my qi and concealing my form.*\n*On an auspicious day, walk the Dao,*\n*universally purifying heaven and earth.*\n*May my heart-spirit congeal in true perfection,*\n*the five hun gleam with clarity,*\n*aligning with the three qi,*\n*merging with the Fire Star’s radiance.*\n\nAfterward, draw in the star-light qi three times and swallow it. Then take nine steps with feet together, standing upon the Star of Jupiter, hold the breath for nine cycles, face east, and softly recite the prayer:\n\n*Nine Qi of the East,*\n*Azure Heaven’s Jade Gate.*\n*Within dwells the Azure Morning,*\n*the Lord of the Mystic Above.*\n*Flowing azure surges and billows,*\n*this is the Celestial Hun.*\n*His name is Great Luminance,*\n*exalted of heaven and earth,*\n*clothed in phoenix robes,*\n*striped skirts of the tiger.*\n*Transforming the Five Points,*\n*shifting forms in nine aspects,*\n*crowned with azure essence,*\n*adorned with the Heaven-Crossing Jade Diadem.*\n*Golden talismans and feathered standards,*\n*jingling pendants in profusion,*\n*holding the Hidden Script,*\n*flying with feathered script.*\n*Preserve my life’s record,*\n*guard my liver’s gate.*\n*Externally radiant, internally luminous,*\n*the liver palace congeals into immortals.*\n*Welcome my ascent,*\n*to audience with the Imperial Morning.*\n\nAfterward, draw in the star-light qi nine times and swallow it. Then take five steps with feet together, standing upon the Star of Mercury, hold the breath for five cycles, face north, and softly recite the prayer:\n\n*Five Qi of the Northern Mystery,*\n*the Mystic Gate gleams with spirit.*\n*The Northern Morning flows and reflects,*\n*the Great Culmen of Jade Clarity.*\n*Within dwells the Supreme August,*\n*the Five Constants’ exalted name.*\n*His name is Yin’s Primordial Stillness,*\n*robed in mysterious clarity,*\n*crowned with a jade diadem,*\n*girded with flowing bells,*\n*golden seals and jade standards,*\n*jade pendants gleaming resplendent.*\n*Wandering the radiant morning,*\n*gazing beside the Eight Darknesses,*\n*returning to descend below,*\n*entering my kidney court.*\n*Preserve the five spirits’ record,*\n*the viscera flourishing in brilliance.*\n*Internally and externally replete,*\n*transforming my shadow and altering my form,*\n*bones flying, flesh ascending,*\n*ascending to Jade Clarity.*\n\nAfterward, tilt the head back and draw in the star-light qi five times and swallow it. Having completed the steps of the Five Stars, descend from the Star of Water, ascend seven steps from the Star of Metal, and again mount the Void Constant Register.\n\nFirst, stand with feet together upon the First Nine Constants and recite the prayer:\n*Lord of the Nine Constants of Earth,*\n*shifting forms in the hidden darkness,*\n*grant me concealed steps,*\n*to elude my form.*\n\nNext, ascend to the Second Nurturing Constant and recite the prayer:\n*Spirit Lord of the Nurturing Constant,*\n*whose form has no fixed attire,*\n*grant me transformation,*\n*that my body become grass and trees.*\n\nNext, ascend to the Third Mao Constant and recite the prayer:\n*Exalted Spirit of the Mao Constant,*\n*able to sink and to rise,*\n*grant me transformed radiance,*\n*shifting into hills and mounds.*\n\nNext, ascend to the Fourth Flowing Constant and recite the prayer:\n*August Lord of the Flowing Constant,*\n*whose form has no constant body,*\n*grant me exhalation,*\n*arousing qi and kindling smoke.*\n\nNext, ascend to the Fifth Walking Constant and recite the prayer:\n*Great Lord of the Walking Constant,*\n*whose might subdues the myriad ghosts,*\n*transform my form,*\n*kindling smoke into fire.*\n\nHaving completed the steps of the Five Constants, return to the Star of Metal, hold the breath for five cycles, and recite the prayer:\n\n*Flying into the Great Hidden,*\n*transforming radiance through the Five Constants,*\n*entering the Five Qi of the North,*\n*controlling the Three Yangs of the South.*\n*Golden talismans command the spirits,*\n*the Supreme Emperor aids and upholds.*\n*Six Wus escape the Six Jis,*\n*preserving passage to the Cavern Realm.*\n*Great White guards the lungs,*\n*Metal stabilizes the stomach and intestines.*\n*Internally replete, externally overflowing,*\n*form and hun together soar.*\n*Transforming in thousands, shifting in myriad ways,*\n*welcoming whatever the intent desires.*\n*May I, with the Jade August,*\n*together roam the Upper Capital.*\n\nAfterward, draw in the qi seven times and swallow it. Then take twelve steps from the Star of Metal to mount the Star of Earth, stand with feet together upon the First Upper Constant, and recite the prayer:\n*Upper Constant soaring,*\n*transforming in countless millions,*\n*grant me concealed radiance,*\n*ascending into the Nine Heavens.*\n\nNext, ascend to the Second Heavenly Constant and recite the prayer:\n*Heavenly Constant flowing with flame,*\n*kindling smoke into ramparts,*\n*grant me eluding form,*\n*carrying the spirit into fire.*\n\nNext, ascend to the Third Named Constant and recite the prayer:\n*Named Constant of the Northern Mystery,*\n*whose body is water,*\n*conceal me in rivers and seas,*\n*irrigate me to perfection.*\n\nNext, ascend to the Fourth Three Constants and recite the prayer:\n*Three Constants transforming might,*\n*radiance controlling the Eight Courts,*\n*grant me attainment of immortality,*\n*warding off disaster and repelling weapons.*\n\nNext, ascend to the Fifth Chen Constant and recite the prayer:\n*Chen Constant of myriad transformations,*\n*whose body has no constant form,*\n*grant me attainment of immortality,*\n*escaping death and entering life.*\n\nHaving completed the steps of the Five Constants, return to the Star of Earth, hold the breath for twelve cycles, and knock the teeth together twelve times, then recite the prayer:",
      "overlap_context": "*\n*Transforming shapes and shadows,*\n*Uniting in thousands, dividing in myriad ways.*\n*Descend into the five viscera,*\n*Congeal to form Jade Immortals.*\n*Refine my seven po,*\n*Nurture my three hun.*\n*Raise my form to ascend,*\n*Fly into the Dipper’s Gate.*\n*Roam and play in the Upper Capital,*\n*The Five Stars gathered as one.*\n*Today, in this dark celebration,*\n*I request that all be as recited.*\n\nAfterward, draw in the star-light qi twenty-five times and swallow it. Then rise and ascend the net.",
      "start_char": 1012,
      "end_char": 2324,
      "start_sentence": 35,
      "end_sentence": 75,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.13537359237671,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\上清五常变通万化郁冥经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "元常五黄，中皇大神，变化七金，威伏三辰，逃身分形，上天入云，总呼五灵，卫我脾门，使我藏府，早化成仙，飞玄入空，水火万原，在意所欲，上升无间，得与皇妃，结友齐群。 毕，引气十二咽止。 次从土星三步，登火星，并足，上第一空常上，祝曰： 空常至灵，辅弼上真，入我绛宫，总摄万仙。 次上第二河常上，祝曰： 河常逃伏，隐遁八冥，水火变化，使我仙成。 次上第三元常上，祝曰： 元常变化，草木蔽身，使我形影，同合道真。 次上第四古常上，祝曰： 古常天双，出入无间，身生羽翮，飞升上天。 次上第五巳常上，祝曰： 巳常南离，建九自覆，变化成形，立成呜兽。 步五常毕，还火星上，闭气三息，叩齿三通，而祝曰： 流炎丹灵，三门电庭，五常变通，万化郁冥，摄命土皇，威制北精，上元保录，固我长生，今日步空，乘虚入星，荧惑辅心，我道洞明，千分万合，所向立成，魂导魄炼，羽服时生，得与五星，擭舆玉清。 毕，引气三咽止，次从火星九步，取木星，并足，登九常上，祝曰： 九常青皇，天地魂根，使我变化，逃景隐山。 次上世常上，祝曰： 世常天灵，总度万仙，使我步空，合景成神。 次上明常上，祝曰： 明常昭昭，光曜八眦，使我变形，逃水成地。 次上五常上，祝曰： 五常威化，制御五土，使我化形，立住成虎。 次上法常上，祝曰： 法常彰木，位总神仙，使我分景，化身为千。 步五常毕，还木星上，闭气九息，叩齿九通，而祝曰： 少阳九门，徘徊青天，中有五常，变化亿千，呼阴召阳，制御金神，东华命节，坐应自然，步空蹑虚，策驾青姻，上降碧灵，下镇肝门，道明九合，立致飞仙，得与青皇，同真木晨。 毕，引气九咽止。 次从木星五步，取水星，并足，登阴常上，祝曰： 阴常北玄，万化之宗，使我住此，立成神龙。 次上黄常上，祝曰： 黄常灵阴，化为玉女，使我分形，立为百己。 次上定常上，祝曰： 定常总元，变化郁勃，使我分形，以成万物。 次上飞常上，祝曰： 飞常入空，上下百韵，化形六畜，使人不见。 次上六常上，祝曰： 六常纲纽，制鬼御神，回转天地，当之杀人。 步五常毕，还水星上，闭气五息，叩齿五通，祝曰： 北玄五气，五门开张，中星黑皇，号曰五常，变化幽冥，出阴入阳，召命三晨，制御土官，使我飞步，逃景太空，在所适向，分形百方，上造钩陈，升身玉京，体生奇毛，肾府纳芳，今日行道，神仙之宗，得天上愿，享祚无穷。 毕，引气五咽止。 如此步二十五点常都竟，便下，从门叩齿三十六通，向纲而歌三洞飞步章，九步登阳明星也。 并足，上阳明星上，东向祝曰： 太上宫中，变隐遁元，内妃大神，太一上尊，总领命籍，为我致言，藏形逃己，上升帝轩。 次上阴精星上，东北向祝曰： 中元宫中，保胎化形，内嫔太真，高上玄灵，斩胞解结，炼胎固精，变化万方，使我长生。 次上弼星上，向真人星祝曰： 真元官中，六遁七隐，上元玄母，育我胎产，遁化金室，变成苍辇，使我飞空，长年无限。 次上玄冥星上，向北祝曰： 纽幽宫中，匿景藏光，中元内妃，神仙大宗，度我六戊，出我八方，逃迹飞步，上超帝房。 次上丹元星上，西向祝曰：",
      "translated_text": "The Primal Constant of the Five Yellows,\nCentral August Divine Sovereign,\ntransforms the Seven Metals,\nsubdues the Three Luminaries with might,\nescapes the body and divides the form,\nascends to heaven and enters the clouds.\nSummon the Five Spirits in unison,\nguard my Spleen Gate,\nthat my organs and viscera\nmay swiftly transform into immortality.\nSoaring into the void, entering the emptiness,\nwater and fire span the ten thousand origins—\nall as my will desires,\nascending without hindrance,\nto join the August Consort,\nbefriending the host of equals.\n\nComplete, draw in the breath and swallow twelve times to conclude.\n\nNext, from the Star of Earth take three steps,\nascend to the Star of Fire, feet together,\nand mount the First Void Constant, reciting the prayer:\n*Void Constant most numinous,*\n*assisting and aiding the Supreme Perfected,*\n*enter my Crimson Palace,*\n*governing the host of immortals.*\n\nNext, ascend to the Second River Constant, reciting the prayer:\n*River Constant of escape and concealment,*\n*hidden in the Eight Obscurities,*\n*transforming through water and fire,*\n*grant me attainment of immortality.*\n\nNext, ascend to the Third Primal Constant, reciting the prayer:\n*Primal Constant of transformation,*\n*grass and trees conceal my body,*\n*that my form and shadow*\n*may unite with the perfection of the Dao.*\n\nNext, ascend to the Fourth Ancient Constant, reciting the prayer:\n*Ancient Constant of celestial pairing,*\n*entering and exiting without hindrance,*\n*my body sprouts feathered wings,*\n*soaring upward to the heavens.*\n\nNext, ascend to the Fifth Si Constant, reciting the prayer:\n*Si Constant of the Southern Li,*\n*erecting the Ninefold Self-Covering,*\n*transforming and completing the form,*\n*instantly becoming the roaring beast.*\n\nHaving completed the steps of the Five Constants, return to the Star of Fire,\nhold the breath for three cycles, and knock the teeth together three times, then recite the prayer:\n*Flowing flame, cinnabar numen,*\n*Three Gates like lightning coursing,*\n*Five Constants transforming and communicating,*\n*myriad transformations flourishing in obscurity.*\n*Seize the life of the Earth Sovereign,*\n*subdue the might of the Northern Essence.*\n*Preserve the Upper Prime Record,*\n*fortify my long life.*\n*Today I step through the void,*\n*riding the emptiness into the stars.*\n*Mars aids my heart,*\n*my Dao shines with clarity.*\n*A thousand divisions, ten thousand unions—*\n*all I face is instantly accomplished.*\n*Spirit guides, soul refines,*\n*feathered raiment timely born.*\n*Attaining the Five Stars,*\n*I grasp the chariot of Jade Clarity.*\n\nComplete, draw in the breath and swallow three times to conclude.\n\nNext, from the Star of Fire take nine steps,\nreach the Star of Wood, feet together,\nand mount the Nine Constants, reciting the prayer:\n*Nine Constants of the Azure Sovereign,*\n*root of the soul of heaven and earth,*\n*grant me transformation,*\n*escaping my shadow and concealing myself in the mountains.*\n\nNext, ascend to the World Constant, reciting the prayer:\n*World Constant of celestial numen,*\n*governing the deliverance of the host of immortals,*\n*grant me to step through the void,*\n*uniting with my shadow to become a spirit.*\n\nNext, ascend to the Luminous Constant, reciting the prayer:\n*Luminous Constant shining bright,*\n*radiance illuminating the Eight Corners,*\n*grant me transformation of form,*\n*escaping water to become earth.*\n\nNext, ascend to the Five Constants, reciting the prayer:\n*Five Constants of mighty transformation,*\n*controlling and commanding the Five Lands,*\n*grant me transformation of form,*\n*instantly standing as a tiger.*\n\nNext, ascend to the Dharma Constant, reciting the prayer:\n*Dharma Constant manifesting wood,*\n*position governing the divine immortals,*\n*grant me division of my shadow,*\n*transforming my body into a thousand.*\n\nHaving completed the steps of the Five Constants, return to the Star of Wood,\nhold the breath for nine cycles, and knock the teeth together nine times, then recite the prayer:\n*Lesser Yang of the Nine Gates,*\n*wandering the azure heavens,*\n*within are the Five Constants,*\n*transforming in countless millions.*\n*Summon yin, call forth yang,*\n*commanding the Metal Spirit.*\n*Eastern Florescence receives the mandate,*\n*sitting in accord with spontaneity.*\n*Stepping through the void, treading the empty,*\n*urging the chariot of blue mist,*\n*ascending to the Azure Numen,*\n*below guarding the Gate of the Liver.*\n*The Dao illumines the Nine Unions,*\n*instantly attaining flight as an immortal,*\n*joining the Azure Sovereign,*\n*as one with the Perfected of the Wooden Dawn.*\n\nComplete, draw in the breath and swallow nine times to conclude.\n\nNext, from the Star of Wood take five steps,\nreach the Star of Water, feet together,\nand mount the Yin Constant, reciting the prayer:\n*Yin Constant of the Northern Mystery,*\n*origin of the myriad transformations,*\n*grant me to dwell here,*\n*instantly becoming the divine dragon.*\n\nNext, ascend to the Yellow Constant, reciting the prayer:\n*Yellow Constant of numinous yin,*\n*transforming into the Jade Maiden,*\n*grant me division of form,*\n*instantly becoming a hundred selves.*\n\nNext, ascend to the Stabilizing Constant, reciting the prayer:\n*Stabilizing Constant governing the origin,*\n*transformations flourishing and exuberant,*\n*grant me division of form,*\n*to become the myriad things.*\n\nNext, ascend to the Flying Constant, reciting the prayer:\n*Flying Constant entering the void,*\n*ascending and descending in a hundred rhymes,*\n*transforming the form into the six livestock,*\n*that others may not see me.*\n\nNext, ascend to the Six Constants, reciting the prayer:\n*Six Constants of the fundamental bond,*\n*commanding ghosts and controlling spirits,*\n*revolving heaven and earth,*\n*confronting them slays men.*\n\nHaving completed the steps of the Five Constants, return to the Star of Water,\nhold the breath for five cycles, and knock the teeth together five times, then recite the prayer:\n*Northern Mystery of the Five Qi,*\n*Five Gates opening wide,*\n*Central Star of the Black Sovereign,*\n*styled the Five Constants.*\n*Transformations in the hidden and obscure,*\n*exiting yin and entering yang,*\n*summoning the life of the Three Luminaries,*\n*commanding the Earth Officials.*\n*Grant me to fly and step,*\n*escaping my shadow into the great void,*\n*wherever I turn,*\n*dividing my form in a hundred directions.*\n*Ascending to the Hook Array,*\n*raising my body to Jade Capital,*\n*my body sprouts wondrous fur,*\n*the Palace of the Kidneys receives fragrance.*\n*Today I practice the Dao,*\n*the origin of divine immortals,*\n*attaining the wish of heaven,*\n*enjoying blessings without end.*\n\nComplete, draw in the breath and swallow five times to conclude.\n\nThus completing the steps of the Twenty-Five Point Constants,\ndescend, knock the teeth together thirty-six times at the gate,\nface the guiding cord and chant the *Three Caverns Flying Steps Chapter*,\nthen take nine steps to ascend the Star of Yang Brightness.\n\nFeet together, mount the Star of Yang Brightness,\nface east and recite the prayer:\n*Within the Palace of the Supreme One,*\n*transforming, concealing, and escaping the origin,*\n*the Great Divine Consort within,*\n*the Most Honored of the Great One,*\n*governing the records of life,*\n*speak on my behalf,*\n*concealing my form and escaping myself,*\n*ascending to the imperial chariot.*\n\nNext, ascend to the Star of Yin Essence,\nface northeast and recite the prayer:\n*Within the Palace of the Middle Prime,*\n*preserving the embryo and transforming the form,*\n*the Divine Consort within,*\n*the Supreme Numen of the Lofty One,*\n*severing the afterbirth and untying the knots,*\n*refining the embryo and securing the essence,*\n*transforming in myriad ways,*\n*granting me long life.*\n\nNext, ascend to the Star of the Aiding Star,\nface the Star of the Perfected and recite the prayer:\n*Within the Palace of the True Origin,*\n*Six Escapes and Seven Concealments,*\n*the Mysterious Mother of the Upper Prime,*\n*nurturing my embryonic birth,*\n*concealing and transforming in the Golden Chamber,*\n*transforming into the Azure Chariot,*\n*granting me to fly through the void,*\n*endless years without limit.*\n\nNext, ascend to the Star of the Dark and Mysterious,\nface north and recite the prayer:\n*Within the Palace of the Axis of Obscurity,*\n*concealing my shadow and hiding my light,*\n*the Divine Consort within,*\n*great origin of divine immortals,*\n*delivering me through the Six Wus,*\n*exiting me through the Eight Directions,*\n*escaping my traces, flying and stepping,*\n*transcending to the imperial chambers.*\n\nNext, ascend to the Star of Cinnabar Origin,\nface west and recite the prayer:",
      "overlap_context": "the Eight Courts,*\n*grant me attainment of immortality,*\n*warding off disaster and repelling weapons.*\n\nNext, ascend to the Fifth Chen Constant and recite the prayer:\n*Chen Constant of myriad transformations,*\n*whose body has no constant form,*\n*grant me attainment of immortality,*\n*escaping death and entering life.*\n\nHaving completed the steps of the Five Constants, return to the Star of Earth, hold the breath for twelve cycles, and knock the teeth together twelve times, then recite the prayer:",
      "start_char": 2324,
      "end_char": 3665,
      "start_sentence": 76,
      "end_sentence": 125,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.18795871734619,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\上清五常变通万化郁冥经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "纲神宫中，变体易景，斗中大女，玄化无像，度我元斗，书名帝榜，飞空策虚，腾身浮影。 次上北极星上，东北向祝曰： 纪明宫中，隐迹散众，斗中中女，灵化上宫，落我玄籍，度名诸方，分身成千，反容婴童。 次上天关星上，向西北祝曰： 关会宫中，分景万形，斗中少女，玄上大灵，随斗运机，总输万生，使我飞空，变化太冥。 次上辅星上，向天门叩齿九通，祝曰： 帝席上宫，右皇夫人，上对帝君，齐景合真，号曰妙常，变化九天，运导日月，聚气成姻，回转水火，万怪潜身，是时元吉，玄庆敷陈，使我飞步，乘常入真，九晨流落，享福万千，形齐天光，德同三便。 毕，仰咽气二十四过止。 次上弼星上，向地户叩齿九通，祝曰： 上尊上宫，夫人右皇，帝尊同符，合灵华房，天魂地魄，号曰上空，变化九气，万真祖宗，回金转石，与天齐功， 化消山河 ，呼云召龙，万怪立灭，分景亿通，飞步蹑虚，流焕四冲，藏身魁席，覆衣天光，长灵天地，享庆洋洋，请如所愿，受福永终。 毕，仰咽三十六过止。 如此皆一过行之，不往反也。",
      "translated_text": "Within the Palace of the Starry Net,\ntransforming my form and altering my radiance,\nthe Great Maiden within the Dipper,\nmysterious transformation without image,\ndelivering me through the Primordial Dipper,\ninscribing my name upon the imperial register,\nsoaring through the void and riding the emptiness,\nascending in body to cast no shadow.\n\nNext, ascend to the Star of the Northern Pole,\nface northeast and recite the prayer:\nWithin the Palace of the Bright Record,\nconcealing my traces and dispersing the multitudes,\nthe Middle Maiden within the Dipper,\nnuminous transformation of the Upper Palace,\nstriking my name from the Mysterious Register,\ninscribing it through all directions,\ndividing my body into a thousand,\nreturning my countenance to that of an infant.\n\nNext, ascend to the Star of the Celestial Pass,\nface northwest and recite the prayer:\nWithin the Palace of the Converging Pass,\nsplitting my radiance into ten thousand forms,\nthe Youngest Maiden within the Dipper,\ngreat numen of the Mysterious Upper Realm,\nfollowing the Dipper’s revolving mechanism,\ngoverning the myriad lives,\ngranting me to fly through the void,\ntransforming into the Great Obscurity.\n\nNext, ascend to the Star of the Assistant,\nface the Gate of Heaven, knock the teeth nine times, and recite the prayer:\nWithin the Upper Palace of the Imperial Couch,\nthe August Consort of the Right,\nfacing the Imperial Lord above,\naligning her radiance with the True,\nnamed the Wondrous Constancy,\ntransforming through the Nine Heavens,\nguiding and conveying the sun and moon,\ngathering qi to form mist,\nrevolving water and fire,\nconcealing the myriad anomalies within,\nat this time of primordial auspiciousness,\nproclaiming the Mysterious Blessing,\ngranting me to fly in steps,\nriding the Constant to enter the True,\nthe Nine Dawns flowing and scattering,\nenjoying ten thousand blessings,\nmy form equaling the radiance of heaven,\nmy virtue harmonizing with the Three Conveniences.\n\nWhen finished, face upward and swallow qi twenty-four times to conclude.\n\nNext, ascend to the Star of the Supporter,\nface the Earthly Door, knock the teeth nine times, and recite the prayer:\nWithin the Upper Palace of the Supreme,\nthe August Consort of the Right,\nequal in honor to the Imperial Lord,\nuniting in the Flowery Chamber of the Numinous,\nheavenly hun and earthly po,\nnamed the Supreme Void,\ntransforming through the Nine Qi,\nancestor of the myriad perfected,\nrevolving metal and turning stone,\nequaling the merit of heaven,\ndissolving mountains and rivers,\nsummoning clouds and calling dragons,\nthe myriad anomalies instantly vanishing,\nsplitting my radiance into a hundred million,\nflying in steps upon the void,\nstreaming brilliance through the four directions,\nconcealing my body within the Dipper’s seat,\ncloaking myself in the radiance of heaven,\neternally numinous between heaven and earth,\nenjoying boundless blessings,\nmay all be as wished,\nreceiving fortune forever.\n\nWhen finished, face upward and swallow qi thirty-six times to conclude.\nAll these are performed in a single passage, without retracing.",
      "overlap_context": "ithout limit.*\n\nNext, ascend to the Star of the Dark and Mysterious,\nface north and recite the prayer:\n*Within the Palace of the Axis of Obscurity,*\n*concealing my shadow and hiding my light,*\n*the Divine Consort within,*\n*great origin of divine immortals,*\n*delivering me through the Six Wus,*\n*exiting me through the Eight Directions,*\n*escaping my traces, flying and stepping,*\n*transcending to the imperial chambers.*\n\nNext, ascend to the Star of Cinnabar Origin,\nface west and recite the prayer:",
      "start_char": 3665,
      "end_char": 4110,
      "start_sentence": 126,
      "end_sentence": 137,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.66618275642395,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\上清五常变通万化郁冥经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "空常之道毕於此矣。 太上步空常之道，每至其日，清斋烧香，别室独处，不交人事，密而行之。 安心定意，存想神真，星点罗列，并使历然，徐而步纲。 五年之中，帝尊皇妃，无不下降，元皇五星，无不垂映，洞明形内，变化万神也。 行之七年，分形万景，隐迹九空。 十四年，飞行太虚，上升斗晨。 若羁逼世务，运会得经，未获修步，但每至其日烧香执经，北向朝星，存念神真，乞丐神仙，如此便禳万灾，辟却凶患，神朗体清，还年反颜。 如此十四年，延寿七百年。 秽慢漏泄，殃灭一门，罚及七祖。 罪福愆对，其效甚明。 从此入七步，登金星上，一祝。 从金星十二步，登土星上，又一祝。 从土星三步，登火星上，又一祝。 从火星九步，登木星上，又一祝。 从木星五步，登水星上，又一祝。 如此五星毕，通一祝。 又从金星起，如初往反十五过，但步不祝。 其道毕。 步五星毕，又从外入七步，登地户九常，以次行五常毕。 还金星上一祝，十二步登上常，以次行五常毕。 还土星上一祝，三步登空常，以次行五常毕。 还火星上一祝，九步登九常，以次行五常毕。 还木星上一祝，五步登阴常，以次行五常毕。 还水星上一祝。 天枢星元斗宫中魁精玄上真皇夫人，姓明通，讳婴育，真名 ，头作飞云华绩之髻，衣紫黄青三色之帔。 天游星玄魁宫中灵精上玄皇夫人，姓玄镜，讳郁勃光， 真名 ，头作飞云华绩之髻，衣紫黄青三色之帔。 天游星玄魁宫中灵精上玄皇夫人，姓玄镜，讳郁勃光，真名 ，头作飞云华积之髻，衣飞锦罗裙凤文锦帔。 天玑星上精宫中灵妃元皇夫人，姓常明，讳化云，真名 ，头建晨婴宝冠，衣飞云明光锦裯。 天权星纲极宫中上灵神妃华皇夫人，姓开生，讳运明，真名 ，头建七称玉冠，衣绯罗凤文之裯。 玉衡星灵开宫中北上金盖中皇夫人，姓元方，讳神武，真名 ，头建紫晨飞华之冠，衣九色之裯。 阅阳星北极宫中安上晨华元皇夫人，姓玉元，讳根华，真名 ，头建玉晨进贤冠，衣飞青羽裯。 瑶光星运天宫中玉华灵皇夫人，姓度元，讳终会，真名 ，头建飞华颓云之髻，衣七色夜光云锦之裙九色锦帔。 洞明星空真宫中帝大明常皇夫人，姓幽升，讳元韵，真名 ，头作飞云华颓之髻，衣飞罗之裯。 隐元星常宝宫中空玄变灵上皇夫人，姓冥通，讳万光，真名 ，头建飞天七称玉冠，衣青文锦裯。 右九星之魂精皇夫人之至名，变化之威神，知者不死，修之飞仙也。 记而勉之。 辅星帝席宫紫气玉楼帝尊九晨君，姓精常，讳无粗，字玄解子，真名 ，头建飞精玉冠，衣九色凤衣。 弼星上尊宫玉楼紫馆帝尊元晨君，姓幽空，讳空无先，字隐元觉，真名 ，头建飞天玉冠，衣天龙衣。 此二星，则天地魂魄之威神。 辅星曰常，主天。 弼星曰空，主地。 皆回天宿，转五岳，变化亿万，知者延年无极，修之立致藏隐。 二十五点常则，以此二神之支，辅灵尊之八号也。 阳明星太上宫青城玉楼九晨君，姓上云，讳法罂容，字董洞阳，真名 ，头建九晨玉冠，衣青飞裳。 阴精星中元宫五色玉楼北上晨君，姓育婴，讳玄上瓫，字昌阳文，真名 ，头建玄精玉冠，衣玄羽飞裳。 真人星真元宫黄台玉楼主仙华晨君，姓归姘，讳妙音光，字通度元，真名 ，头建飞晨宝冠，衣青羽飞裳。",
      "translated_text": "The Dao of the Eternal Void concludes here.\n\nThe Most High practices the Dao of the Eternal Void. On each appointed day, they purify themselves, burn incense, and seclude in a separate chamber, free from worldly affairs, performing the rites in secrecy. Calming the mind and settling the intent, they visualize the divine perfected, with stars arrayed in orderly ranks, each distinct and clear. They proceed slowly, stepping through the celestial net.\n\nWithin five years, the Imperial Lord and the August Consort descend without fail; the Primordial August Five Stars cast their radiance without omission. The inner form becomes luminously clear, and the myriad spirits undergo transformation. After seven years of practice, one may divide their form into a myriad manifestations and conceal their traces within the Nine Voids. After fourteen years, they soar through the Great Void, ascending to the Dipper’s dawn.\n\nIf constrained by worldly duties or circumstances, should one obtain this scripture but be unable to perform the stepping ritual, simply burn incense, hold the scripture, face north toward the stars, and visualize the divine perfected, praying for transcendence. Thus, all calamities are averted, misfortunes dispelled, the spirit brightens, the body purifies, and one regains youthful countenance. Practicing thus for fourteen years extends life by seven hundred years.\n\nImpurity, negligence, or leakage of secrets brings ruin upon the entire household, with punishment extending to the seven generations of ancestors. The correspondence of sin and fortune is most evident. From here, proceed with seven steps to ascend upon the Metal Star and recite one invocation. From the Metal Star, take twelve steps to ascend upon the Earth Star and recite another invocation. From the Earth Star, take three steps to ascend upon the Fire Star and recite another invocation. From the Fire Star, take nine steps to ascend upon the Wood Star and recite another invocation. From the Wood Star, take five steps to ascend upon the Water Star and recite another invocation. When the Five Stars are completed, recite one final invocation. Then, beginning again from the Metal Star, repeat the sequence fifteen times in reverse, stepping without invocation. Thus, the Dao is fulfilled.\n\nAfter completing the steps of the Five Stars, proceed from the outer path with seven steps to ascend upon the Earth Gate of the Nine Constants, then proceed through the Five Constants in sequence. Return to the Metal Star and recite one invocation, then take twelve steps to ascend upon the Upper Constant and proceed through the Five Constants in sequence. Return to the Earth Star and recite one invocation, then take three steps to ascend upon the Void Constant and proceed through the Five Constants in sequence. Return to the Fire Star and recite one invocation, then take nine steps to ascend upon the Nine Constants and proceed through the Five Constants in sequence. Return to the Wood Star and recite one invocation, then take five steps to ascend upon the Yin Constant and proceed through the Five Constants in sequence. Finally, return to the Water Star and recite one invocation.\n\nThe Celestial Pivot Star’s Primordial Dipper Palace houses the Mystic August Perfected Sovereign Consort, surnamed Bright Permeation, with the taboo name Yingyu, and the true name [ ]. Her hair is styled in a Flying Cloud Floral Coiffure, and she wears a mantle of purple, yellow, and azure hues.\n\nThe Celestial Wandering Star’s Mystic Dipper Palace houses the Numinous August Perfected Sovereign Consort, surnamed Mystic Mirror, with the taboo name Yubo Guang, and the true name [ ]. Her hair is styled in a Flying Cloud Floral Coiffure, and she wears a mantle of purple, yellow, and azure hues.\n\nThe Celestial Jade Star’s Upper Essence Palace houses the Numinous August Sovereign Consort, surnamed Constant Brightness, with the taboo name Huayun, and the true name [ ]. She wears a Morning Infant Treasure Crown and a luminous brocade robe of flying clouds.\n\nThe Celestial Balance Star’s Net-Pole Palace houses the Upper Numinous Divine Consort, the August Sovereign Consort, surnamed Opening Life, with the taboo name Yunming, and the true name [ ]. She wears a Seven-Tiered Jade Crown and a crimson phoenix-patterned robe.\n\nThe Jade Transverse Star’s Numinous Opening Palace houses the Northern August Golden Canopy Central Sovereign Consort, surnamed Primordial Direction, with the taboo name Shenwu, and the true name [ ]. She wears a Purple Dawn Flying Floral Crown and a nine-colored robe.\n\nThe Celestial Gate Star’s Northern Culmen Palace houses the Peaceful August Floral Primordial Sovereign Consort, surnamed Jade Primordial, with the taboo name Genhua, and the true name [ ]. She wears a Jade Dawn Advancing Worthies Crown and a flying azure feathered robe.\n\nThe Radiant Light Star’s Heavenly Motion Palace houses the Jade Floral Numinous August Sovereign Consort, surnamed Degrees Primordial, with the taboo name Zhonghui, and the true name [ ]. Her hair is styled in a Flying Floral Cloud-Tumbling Coiffure, and she wears a seven-colored night-luminous cloud brocade skirt and a nine-colored brocade mantle.\n\nThe Luminous Void Star’s Cavern Clarity Palace houses the Imperial Great Brightness Eternal August Sovereign Consort, surnamed Dark Ascent, with the taboo name Yuanyun, and the true name [ ]. Her hair is styled in a Flying Cloud Floral Tumbling Coiffure, and she wears a flying net robe.\n\nThe Hidden Primordial Star’s Constant Treasure Palace houses the Void Mystic Transformative Numinous Upper August Sovereign Consort, surnamed Dark Permeation, with the taboo name Wanguang, and the true name [ ]. She wears a Flying Heaven Seven-Tiered Jade Crown and a blue-patterned brocade robe.\n\nThese are the true names of the Nine Stars’ numinous essence, the August Sovereign Consorts, whose awe-inspiring divine transformations grant immortality to those who know them and transcendence to those who cultivate them. Record and strive to emulate them.\n\nThe Assistant Star’s Imperial Seat Palace houses the Purple Qi Jade Tower Imperial Lord of the Nine Dawns, surnamed Essence Constant, with the taboo name Wu Cu, styled Mystic Unraveling Master, and the true name [ ]. He wears a Flying Essence Jade Crown and a nine-colored phoenix robe.\n\nThe Adjuvant Star’s Upper August Palace houses the Jade Tower Purple Mansion Imperial Lord of the Primordial Dawn, surnamed Dark Void, with the taboo name Kong Wuxian, styled Hidden Primordial Awareness, and the true name [ ]. He wears a Flying Heaven Jade Crown and a Heavenly Dragon Robe.\n\nThese two stars embody the awe-inspiring numina of heaven and earth’s hun and po. The Assistant Star is called Constant, governing heaven. The Adjuvant Star is called Void, governing earth. Together, they revolve the celestial lodgings, turn the Five Peaks, and undergo myriad transformations. Those who know them attain boundless longevity, and those who cultivate them swiftly achieve concealment and seclusion. The twenty-five points of the Constants derive from the branches of these two deities, assisting the eight titles of the Numinous August One.\n\nThe Yang Brightness Star’s Supreme Palace houses the Azure City Jade Tower Lord of the Nine Dawns, surnamed Upper Cloud, with the taboo name Faying Rong, styled Dong Dongyang, and the true name [ ]. He wears a Nine Dawns Jade Crown and an azure flying robe.\n\nThe Yin Essence Star’s Middle Primordial Palace houses the Five-Colored Jade Tower Northern August Lord, surnamed Nurturing Infant, with the taboo name Xuan Shang Peng, styled Changyang Wen, and the true name [ ]. He wears a Mystic Essence Jade Crown and a dark feathered flying robe.\n\nThe Perfected Person Star’s True Primordial Palace houses the Yellow Terrace Jade Tower Master of Immortals, the Floral Lord of Dawn, surnamed Returning Union, with the taboo name Miaoyin Guang, styled Permeating Degrees Primordial, and the true name [ ]. He wears a Flying Dawn Treasure Crown and a blue feathered flying robe.",
      "overlap_context": "ies instantly vanishing,\nsplitting my radiance into a hundred million,\nflying in steps upon the void,\nstreaming brilliance through the four directions,\nconcealing my body within the Dipper’s seat,\ncloaking myself in the radiance of heaven,\neternally numinous between heaven and earth,\nenjoying boundless blessings,\nmay all be as wished,\nreceiving fortune forever.\n\nWhen finished, face upward and swallow qi thirty-six times to conclude.\nAll these are performed in a single passage, without retracing.",
      "start_char": 4110,
      "end_char": 5409,
      "start_sentence": 138,
      "end_sentence": 184,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.2714409828186,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\上清五常变通万化郁冥经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "玄冥星纽幽宫朱台玉楼玄飞盖晨君，姓冥枢，讳定宣觉，字法开度，真名 ，头建七宝飞天冠，衣白锦飞裳。 北极星纪明宫玄台玉楼北晨飞华君，姓明灵，讳长明化，字渊洞源，真名 ，头建飞精华冠，衣紫锦飞裳。 天关星关会宫九层玉楼总灵九元北盖晨君，姓玄枢，讳转天光，字会天终，真名 ，头建九元宝冠，衣九色锦裳。 右七星，皆九精帝晨九天之威神，治七星之宫馆，回转天光，召促劫运，变化万物，混合天地。 知其内名，延寿七千年。 修行十四年，白日登晨也。",
      "translated_text": "The Dark Obscurity Star’s Dark Secluded Palace houses the Vermilion Terrace Jade Tower Dark Flying Canopy Lord of Dawn, surnamed Dark Pivot, with the taboo name Dingxuanjue, styled Dharma Opening Degrees, and the true name [ ]. He wears a Seven Treasures Flying Heaven Crown and a white brocade flying robe.\n\nThe Northern Culmen Star’s Bright Record Palace houses the Dark Terrace Jade Tower Northern Dawn Flying Floral Lord, surnamed Bright Numinous, with the taboo name Changminghua, styled Abyssal Cavern Source, and the true name [ ]. He wears a Flying Essence Floral Crown and a purple brocade flying robe.\n\nThe Celestial Barrier Star’s Barrier Convergence Palace houses the Nine-Layered Jade Tower General Numinous Nine Primordials Northern Canopy Lord of Dawn, surnamed Dark Pivot, with the taboo name Zhuantian’guang, styled Converging Heaven’s End, and the true name [ ]. He wears a Nine Primordials Treasure Crown and a nine-colored brocade robe.\n\nThe seven stars above are all the majestic deities of the Nine Essences Emperor Dawn of the Nine Heavens, governing the palaces of the seven stars, revolving the celestial radiance, summoning and hastening kalpic destinies, transforming the myriad things, and merging heaven and earth. Knowing their inner names extends life by seven thousand years. Cultivating for fourteen years ascends one to the dawn in broad daylight.",
      "overlap_context": " Nurturing Infant, with the taboo name Xuan Shang Peng, styled Changyang Wen, and the true name [ ]. He wears a Mystic Essence Jade Crown and a dark feathered flying robe.\n\nThe Perfected Person Star’s True Primordial Palace houses the Yellow Terrace Jade Tower Master of Immortals, the Floral Lord of Dawn, surnamed Returning Union, with the taboo name Miaoyin Guang, styled Permeating Degrees Primordial, and the true name [ ]. He wears a Flying Dawn Treasure Crown and a blue feathered flying robe.",
      "start_char": 5410,
      "end_char": 5631,
      "start_sentence": 185,
      "end_sentence": 190,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.599421977996826,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\上清五常变通万化郁冥经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "太上宫中帝君变隐遁元内妃，姓延明，讳太一法坦，字幸正扶，真名 ，衣黄锦帔丹青飞裙，颓云髻。 中元宫中帝君保胎化形内嫔，姓开关，讳太一三瓫，字罗朱婴，真名 ，衣青锦帔绿羽飞裙，颓云髻。 真元宫中帝君六道七隐上元母，姓瞑蒙，讳太一灵夷，字冲双兆，真名 ，衣青锦帔绣羽华裙，颓云髻。 纽幽宫中帝君匿景藏光中元内妃，姓开耀，讳太一七烈，字横单盘，真名 ，衣紫锦帔黄华羽裙，颓云髻。 纲神宫中帝君变体易景斗中大女，姓玄路，讳太一郁书，字畴丘兰， 真名 ，衣朱锦帔紫青飞裙，颓云髻。 纪明官中帝君隐迹散众斗中中女，姓蜚廉，讳太一气精，字抱定陵，真名 ，衣朱锦帔青绣飞裙，颓云髻。 关会宫中帝君分景万形斗中少女，姓翁重，讳太一郁墨，字天凡淑，真名 ，衣丹锦帔青华羽裙，颓云髻。 帝席宫中帝君化日月水火斗中高皇左夫人，姓常明，讳太一石启珠，字落茂华，真名 ，衣紫锦帔绣羽丹裙，颓云髻。 上尊官中帝君化金石山河斗中高皇右夫人，姓空黄，讳太一爱条，字育玄，真名 ，衣绿锦帔翠羽华裙，颓云髻。 右帝君九晨斗官中隐妃，九阴之大神，知之者则九妃下降，携兆上升斗宫之中，位为玉清真人。 七年，能分景散形，变化万物，混合幽冥，飞行太虚，上升玉清。 东方岁星阳元宫中真皇帝君，姓碧空，讳澄澜，字清凝，真名 ，头建青精玉冠，衣青羽飞衣。 南方荧惑星洞阳宫中真皇君，姓焕空，讳华瓶，字玄罗，真名 ，头建朱精玉冠，衣绛羽飞衣。 西方太白星素明宫中真皇君，姓浩空，讳寥凌，字振寻，真名 ，头建金精玉冠，衣白羽飞衣。 北方辰星玄斗宫中真皇君，姓阴空，讳玄华，字龙娥，真名 ，头建玄精玉冠，衣玄羽飞衣。 中央镇星上枢宫中真皇君，姓常空，讳玄瑶，字飞贤，真名 ，头建黄精玉冠，衣黄羽飞衣。 右五星官中五真皇君隐名，太上藏之紫房九灵上宫，不授始学之人。 得者皆宿有玄图刻简，来生九万劫之前，已逆注真名，应得其文也。 克为后圣之臣，玉清真人也。 东方阳元宫中，有真皇帝君皇夫人，姓开常，讳宝容，字飞云，真名 ，衣青锦帔绿羽飞裙，颓云髻。 南方洞阳宫中，有真皇帝君皇夫人，姓阳常，讳维停，字散融，真名 ，衣丹锦帔丹羽飞裙，颓云髻。 西方素明宫中，有真皇帝君皇夫人，姓明常，讳飙英，字灵恩，真名 ，衣素锦帔紫羽飞裙，颓云髻。 北方玄斗宫中，有真皇帝君皇夫人，姓渊常，讳肇晅，字精原，真名 ，衣玄锦帔翠羽飞裙，颓云髻。 中央上枢宫中有真皇帝君皇夫人，姓康常，讳藏暝，字耽延，真名 ，衣黄锦岐黄华飞裙，颓云髻。 右五星夫人内阴隐名，太上藏之玄斗紫盖官中。 此五夫人，皆回天转地，盈缩三光，变化山河，改易五行，移动万物，隐藏幽冥。 有知其道，皆不复经履地户，魂过太山也。 克为玉清之真，依科万劫一出。 修九晨五星之道，当以八节及本命之日，夜半入室，北向叩齿九通，闭眼思九星，光明焕照北方。 又存五星，洞明五方，垂光洞映己身，觉身在赤光之内，内外冥然。 良久，又思九星、五星帝君，及皇君夫人、九星内妃，姓讳字衣服，各在其星官，并使分明。",
      "translated_text": "Within the Supreme Palace’s Imperial Lord Transforms-Conceals-and-Retreats Primordial Inner Consort, surnamed Extending Brilliance, with the taboo name Supreme One’s Dharma Altar, styled Fortunate Upright Support, and the true name [ ], she wears a yellow brocade mantle and a cinnabar-and-indigo flying skirt, her hair coiled in a cascading cloud chignon.\n\nWithin the Middle Primordial Palace’s Imperial Lord Protects-Embryo-and-Transforms-Form Inner Concubine, surnamed Opening Barrier, with the taboo name Supreme One’s Three Vessels, styled Net of Vermilion Infants, and the true name [ ], she wears a blue-green brocade mantle and a green-feathered flying skirt, her hair coiled in a cascading cloud chignon.\n\nWithin the True Primordial Palace’s Imperial Lord Six Paths Seven Concealments Supreme Primordial Mother, surnamed Obscure Vastness, with the taboo name Supreme One’s Numinous Yi, styled Soaring Twin Omens, and the true name [ ], she wears a blue-green brocade mantle and an embroidered-feather patterned skirt, her hair coiled in a cascading cloud chignon.\n\nWithin the Cord-of-Darkness Palace’s Imperial Lord Conceals-Light-and-Hides-Radiance Middle Primordial Inner Consort, surnamed Opening Brilliance, with the taboo name Supreme One’s Seven Fierces, styled Horizontal Single Tray, and the true name [ ], she wears a purple brocade mantle and a yellow-flowered feathered skirt, her hair coiled in a cascading cloud chignon.\n\nWithin the Net-of-Spirits Palace’s Imperial Lord Transforms-Body-and-Alters-Radiance Dipper’s Middle Great Maiden, surnamed Dark Path, with the taboo name Supreme One’s Gloomy Writ, styled Ridge-of-the-Field Orchid, and the true name [ ], she wears a vermilion brocade mantle and a purple-and-indigo flying skirt, her hair coiled in a cascading cloud chignon.\n\nWithin the Record-of-Brilliance Palace’s Imperial Lord Conceals-Traces-and-Disperses-Multitudes Dipper’s Middle Maiden, surnamed Flying Swiftness, with the taboo name Supreme One’s Qi Essence, styled Embracing Fixed Mound, and the true name [ ], she wears a vermilion brocade mantle and a blue-green embroidered flying skirt, her hair coiled in a cascading cloud chignon.\n\nWithin the Barrier Convergence Palace’s Imperial Lord Divides-Radiance-and-Manifolds-Forms Dipper’s Youngest Maiden, surnamed Aged Heaviness, with the taboo name Supreme One’s Gloomy Ink, styled Heavenly Ordinary Grace, and the true name [ ], she wears a cinnabar brocade mantle and a blue-green-flowered feathered skirt, her hair coiled in a cascading cloud chignon.\n\nWithin the Imperial Couch Palace’s Imperial Lord Transforms-Sun-and-Moon-Water-and-Fire Dipper’s High August Left Consort, surnamed Constant Brilliance, with the taboo name Supreme One’s Stone-Initiating Pearl, styled Falling Luxuriant Flower, and the true name [ ], she wears a purple brocade mantle and an embroidered-feather cinnabar skirt, her hair coiled in a cascading cloud chignon.\n\nWithin the Supreme Veneration Palace’s Imperial Lord Transforms-Metal-and-Stone-Mountains-and-Rivers Dipper’s High August Right Consort, surnamed Void Yellow, with the taboo name Supreme One’s Beloved Branch, styled Nurturing Mystery, and the true name [ ], she wears a green brocade mantle and a kingfisher-feather patterned skirt, her hair coiled in a cascading cloud chignon.\n\nThe nine Imperial Lords of the Dipper’s Nine Dawn Palaces are the great deities of the Nine Yin. Those who know them shall have the Nine Consorts descend, escorting their omens to ascend into the Dipper’s palaces, where they shall be ranked as Jade Clarity Perfected Ones. After seven years, they may divide radiance and disperse form, transform the myriad things, merge the hidden and obscure, and soar through the Great Void, ascending to Jade Clarity.\n\nThe True August Emperor Lord of the Eastern Year Star’s Yang Primordial Palace, surnamed Azure Void, with the taboo name Clear Ripples, styled Pure Congealment, and the true name [ ], wears a green-essence jade crown and a blue-feathered flying robe.\n\nThe True August Emperor Lord of the Southern Fire Star’s Cavern Yang Palace, surnamed Radiant Void, with the taboo name Flourishing Vessel, styled Mysterious Net, and the true name [ ], wears a vermilion-essence jade crown and a crimson-feathered flying robe.\n\nThe True August Emperor Lord of the Western Venus Star’s Plain Brilliance Palace, surnamed Vast Void, with the taboo name Desolate Loftiness, styled Vibrant Seeking, and the true name [ ], wears a gold-essence jade crown and a white-feathered flying robe.\n\nThe True August Emperor Lord of the Northern Mercury Star’s Dark Dipper Palace, surnamed Yin Void, with the taboo name Mysterious Flourishing, styled Dragon Maiden, and the true name [ ], wears a dark-essence jade crown and a black-feathered flying robe.\n\nThe True August Emperor Lord of the Central Saturn Star’s Upper Pivot Palace, surnamed Constant Void, with the taboo name Mysterious Jade, styled Flying Worthiness, and the true name [ ], wears a yellow-essence jade crown and a yellow-feathered flying robe.\n\nThe five True August Emperor Lords of the Five Star Palaces conceal their hidden names, which the Supreme One has secreted within the Nine Numinous Upper Palace of the Purple Chamber. They are not transmitted to beginners. Those who obtain them must have borne the mysterious chart and inscribed tablets, their true names having been inscribed in reverse across ninety thousand kalpas prior, destined to receive these texts. They shall become ministers to the future sages, Jade Clarity Perfected Ones.\n\nWithin the Eastern Yang Primordial Palace resides the True August Emperor Lord’s August Consort, surnamed Opening Constancy, with the taboo name Treasure Countenance, styled Soaring Cloud, and the true name [ ], who wears a blue-green brocade mantle and a green-feathered flying skirt, her hair coiled in a cascading cloud chignon.\n\nWithin the Southern Cavern Yang Palace resides the True August Emperor Lord’s August Consort, surnamed Yang Constancy, with the taboo name Maintaining Stillness, styled Dispersing Fusion, and the true name [ ], who wears a cinnabar brocade mantle and a cinnabar-feathered flying skirt, her hair coiled in a cascading cloud chignon.\n\nWithin the Western Plain Brilliance Palace resides the True August Emperor Lord’s August Consort, surnamed Bright Constancy, with the taboo name Whirlwind Heroine, styled Numinous Grace, and the true name [ ], who wears a plain brocade mantle and a purple-feathered flying skirt, her hair coiled in a cascading cloud chignon.\n\nWithin the Northern Dark Dipper Palace resides the True August Emperor Lord’s August Consort, surnamed Abyssal Constancy, with the taboo name Commencing Brilliance, styled Essence Origin, and the true name [ ], who wears a dark brocade mantle and a kingfisher-feathered flying skirt, her hair coiled in a cascading cloud chignon.\n\nWithin the Central Upper Pivot Palace resides the True August Emperor Lord’s August Consort, surnamed Health Constancy, with the taboo name Concealing Obscurity, styled Indulging Extension, and the true name [ ], who wears a yellow brocade mantle and a yellow-flowered flying skirt, her hair coiled in a cascading cloud chignon.\n\nThe Five Star Consorts’ inner yin hidden names are concealed by the Supreme One within the Purple Canopy Palace of the Dark Dipper. These five consorts revolve heaven and turn earth, expand and contract the Three Luminaries, transform mountains and rivers, alter the Five Phases, shift the myriad things, and conceal the hidden and obscure. Those who know their Dao shall no longer tread upon the earth’s gates, their souls passing beyond Mount Tai. They shall become the Perfected of Jade Clarity, emerging once every ten thousand kalpas in accordance with the statutes.\n\nTo cultivate the Way of the Nine Dawns and Five Stars, one should enter the chamber at midnight on the eight solar terms and one’s own life-destiny day, face north, and click the teeth nine times. Closing the eyes, visualize the Nine Stars, their radiance shining brilliantly upon the northern direction. Further visualize the Five Stars, their luminosity illuminating the five directions, their light cascading to illuminate one’s body, sensing oneself within a crimson glow, inwardly and outwardly obscure. After a long while, visualize the Nine Stars’ and Five Stars’ Imperial Lords, the August Lords and their consorts, the Nine Stars’ inner consorts—their surnames, taboo names, styles, and attire—each within their stellar palaces, all made distinct.",
      "overlap_context": "He wears a Nine Primordials Treasure Crown and a nine-colored brocade robe.\n\nThe seven stars above are all the majestic deities of the Nine Essences Emperor Dawn of the Nine Heavens, governing the palaces of the seven stars, revolving the celestial radiance, summoning and hastening kalpic destinies, transforming the myriad things, and merging heaven and earth. Knowing their inner names extends life by seven thousand years. Cultivating for fourteen years ascends one to the dawn in broad daylight.",
      "start_char": 5632,
      "end_char": 6909,
      "start_sentence": 191,
      "end_sentence": 222,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.42737650871277,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\上清五常变通万化郁冥经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "须臾，众神钦然合变为一小儿，如始生之状，名曰无常童子，字曰变化神王，手执九星、五星，缨络一身，带日衔月。 童子以日月星光，以映熏兆身，身在赤光之内，表裹洞彻，则为混合万变之道。 仍仰咽气九过，而祝曰： 周天大神，号曰帝皇，回转九道，精焕八方，洞天流曜，发芒散光，隐沦绝冥，回合紫房，改化万形，结成灵童，流降内外，玉真四冲，左命火铃，右激电光，云雾郁勃，华文骞扬，太一神化，锦帔华裳，衔日戴月，身佩天章，飞回五晨，促转斗纲，适心纵己，在意所通，上天入冥，变化百方，保养我身，天地齐功，身生羽服，飞升帝宫。 毕，仰咽气九过止。 洞思九真五晨之道，隐沦八冥，事极於此矣。 金星五点，第一点姓地常，讳罂育，字通勃，真名逃九元。 第二点姓育常，讳焕通，字幽元，真名入五道。 第三点姓卯常，讳金上，字浩淳，真名代六形。 第四点姓流常，讳谷清，字逃边，真名转三关。 第五点姓行常，讳浩逃，字去斗，真名服气精。 右西方太白星之五常，并建素梁宝冠，衣素锦飞衣，手执金符玉节，主七门变化。 土星第一点，姓上常，讳黄光，字元胤，真名逃皇元。 第二点姓天常，讳寥电，字卓度，真名入木精。 第三点姓名常，讳空脁，字霞玄，真名变水火。 第四点姓三常，讳滕旻，字灵变，真名金上生。 第五点姓辰常，讳内溢，字益微，真名黑来谷。 右中央镇星五常之隐名，并建黄梁宝冠，衣黄锦飞衣，手执黄麾命魔之章，主十二门变化。 火星第一点，姓空常，讳常阳，字元无，真名灵通冥。 第二点姓河常，讳流精，字七转，真名七神会。 第三点姓元常，讳南皓，字精极，真名入流光。 第四点姓古常，讳洞主，字微生，真名变三神。 第五点姓巳常，讳季行，字后化，真名逃形边。 右南方荧惑星五常，并建朱粱宝冠，衣朱锦飞衣，手执赤神召灵之章，主三门变化。 木星第一点，姓九常，讳青芒，字上阳，真名隐真身。 第二点姓世常，讳苍元，字长命，真名通九道。 第三点姓明常，讳碧渊，字洞生，真名化青光。 第四点姓五常，讳归青，字玉阳，真名流电衡。 第五点姓法常，讳绿台，字明暧，真名万真会。 右东方岁星五常，并建青梁宝冠，衣青锦飞衣，手执青帝制魔之章，主九门变化。 水星第一点，姓阴常，讳玄通，字子元，真名北上元。 第二点姓黄常，讳曰空，字冬冥，真名动天众。 第三点姓定常，讳隐阳，字勃光，真名轮大劫。 第四点姓飞常，讳上元，字藏光，真名定万神。 第五点姓六常，讳终变，字分图，真名入黑关。 右北方辰星五常，并建玄梁宝冠，衣玄锦飞衣，手执北官摄杀之麾，主五门变化。 修行空常变化之道，常以八节及本命之日，正中入室，南向叩齿十二通，闭目思空常二神，及二十五点常之隐名衣服，各在其方，分明罗列在星宫之中，光明流焕，玄映兆身。 良久，忽化为凤凰、玄龟二兽，从天中来下，凤凰乘赤气之光，下兆头上； 玄龟乘白气之光，下兆两脚下。 凤凰从兆泥丸中入，玄龟从兆命门下入，赤白二气交络兆一身，觉己形化成凤凰，立玄龟之上，在赤白二气之中。 便叩齿二十五通，咽气二十五过，而仰祝曰： 天精地灵，号曰空常，北入五气，南制三阳，木生流火，七气折伤，水灌九震，中元不行，土王养金，木气伏藏，金符命灵，太帝扶迎，六戊逃己，隐影冥乡，太一护肺，金镇肾肠，上元辅心，炼仙肝宫，内鲜外荣，玉真四充，变化万景，混合二光，灵凤玄龟，神兽来迎，洞虚入微，形魂同翔，千变万化，适意所行，束西南北，莫不扶将，长保天地，享福无央，得与明皇，同游上京。",
      "translated_text": "After a moment, the assembled deities reverently coalesce into a single infant, appearing as one newly born, named the Eternal Youth, styled the Divine King of Transformations. In his hands he holds the Nine Stars and Five Stars, their tassels adorning his entire body, bearing the sun and moon in his sash and mouth. The youth bathes your form in the radiance of sun, moon, and stars, your body enveloped in crimson light, inwardly and outwardly luminous and transparent—this is the Dao of the Myriad Transformations in Unity. Then, raising your head, swallow qi nine times and recite the incantation:\n\n*\"Great spirits of the celestial circuit,\nTitled August Emperors,\nRevolving the Nine Paths,\nEssence blazing through the eight directions,\nLuminous radiance streaming through the heavens,\nShooting forth rays and scattering light,\nConcealed and dissolved in the profound,\nRevolving to unite in the Purple Chamber,\nTransforming myriad forms,\nCongealing into the numinous youth,\nFlowing within and without,\nJade Perfected of the four cardinals,\nLeft wielding the Fire Bell of Destiny,\nRight striking the lightning’s flash,\nClouds and mists surging,\nResplendent patterns soaring,\nDivine transformations of the Great One,\nBrocade mantle and luminous robes,\nHolding the sun and wearing the moon,\nAdorned with celestial insignia,\nSoaring through the Five Mornings,\nUrging the turning of the Dipper’s net,\nFollowing the heart’s desire,\nWherever the will extends,\nAscending to heaven, entering the obscure,\nTransforming in a hundred ways,\nPreserving and nurturing my body,\nHeaven and earth sharing the merit,\nMy body sprouting feathered raiment,\nAscending to fly in the imperial palace.\"*\n\nWhen finished, raise your head and swallow qi nine times to conclude. Profoundly meditate upon the Dao of the Nine Perfected and Five Mornings, concealed within the eight obscurities—this is the ultimate attainment of the practice.\n\nThe Five Points of Venus:\nFirst Point: Surname Dìcháng, taboo name Yīngyù, style Tōngbó, true name Táojiǔyuán.\nSecond Point: Surname Yùcháng, taboo name Huàntōng, style Yōuyuán, true name Rùwǔdào.\nThird Point: Surname Mǎocháng, taboo name Jīnshàng, style Hàochún, true name Dàiliùxíng.\nFourth Point: Surname Liúcháng, taboo name Gǔqīng, style Táobiān, true name Zhuǎnsānguān.\nFifth Point: Surname Xíngcháng, taboo name Hàotáō, style Qùdǒu, true name Fúqìjīng.\n\nThe Five Constants of the Western White Star, all wearing white-beamed precious crowns, clad in white brocade flying robes, and holding golden talismans and jade tablets, preside over the transformations of the Seven Gates.\n\nThe Five Points of Saturn:\nFirst Point: Surname Shàngcháng, taboo name Huángguāng, style Yuányìn, true name Táohuángyuán.\nSecond Point: Surname Tiāncháng, taboo name Liáodiàn, style Zhuódù, true name Rùmùjīng.\nThird Point: Surname Xīngcháng, taboo name Kōngtiǎo, style Xiáxuán, true name Biànshuǐhuǒ.\nFourth Point: Surname Sāncháng, taboo name Téngmín, style Língbiàn, true name Jīnshàngshēng.\nFifth Point: Surname Chéncháng, taboo name Nèiyì, style Yìwēi, true name Hēiláigǔ.\n\nThe Five Constants of the Central Yellow Star, all wearing yellow-beamed precious crowns, clad in yellow brocade flying robes, and holding yellow banners and demon-subduing talismans, preside over the transformations of the Twelve Gates.\n\nThe Five Points of Mars:\nFirst Point: Surname Kōngcháng, taboo name Chángyáng, style Yuánwú, true name Língtōngmíng.\nSecond Point: Surname Hécháng, taboo name Liújīng, style Qīzhuǎn, true name Qīshénhuì.\nThird Point: Surname Yuáncháng, taboo name Nánhào, style Jīngjí, true name Rùliúguāng.\nFourth Point: Surname Gǔcháng, taboo name Dòngzhǔ, style Wēishēng, true name Biànsānshén.\nFifth Point: Surname Sìcháng, taboo name Jìxíng, style Hòuhuà, true name Táoxíngbiān.\n\nThe Five Constants of the Southern Fire Star, all wearing vermilion-beamed precious crowns, clad in vermilion brocade flying robes, and holding red spirit-summoning talismans, preside over the transformations of the Three Gates.\n\nThe Five Points of Jupiter:\nFirst Point: Surname Jiǔcháng, taboo name Qīngmáng, style Shàngyáng, true name Yǐnzhēnshēn.\nSecond Point: Surname Shìcháng, taboo name Cāngyuán, style Chángmìng, true name Tōngjiǔdào.\nThird Point: Surname Míngcháng, taboo name Bìyuān, style Dòngshēng, true name Huàqīngguāng.\nFourth Point: Surname Wǔcháng, taboo name Guīqīng, style Yùyáng, true name Liúdiànhéng.\nFifth Point: Surname Fǎcháng, taboo name Lǜtái, style Míngài, true name Wànzhēnhuì.\n\nThe Five Constants of the Eastern Wood Star, all wearing azure-beamed precious crowns, clad in azure brocade flying robes, and holding the Green Emperor’s demon-subduing talismans, preside over the transformations of the Nine Gates.\n\nThe Five Points of Mercury:\nFirst Point: Surname Yīncháng, taboo name Xuántōng, style Zǐyuán, true name Běishàngyuán.\nSecond Point: Surname Huángcháng, taboo name Yuēkōng, style Dōngmíng, true name Dòngtiānzhòng.\nThird Point: Surname Dìngcháng, taboo name Yǐnyáng, style Bóguāng, true name Lúndàjié.\nFourth Point: Surname Fēicháng, taboo name Shàngyuán, style Cángguāng, true name Dìngwànshén.\nFifth Point: Surname Liùcháng, taboo name Zhōngbiàn, style Fēntú, true name Rùhēiguān.\n\nThe Five Constants of the Northern Water Star, all wearing black-beamed precious crowns, clad in black brocade flying robes, and holding the Northern Palace’s execution-subduing banners, preside over the transformations of the Five Gates.\n\nTo practice the Dao of the Void and Constant Transformations, regularly enter the chamber at noon on the eight solar terms and one’s own life-destiny day, face south, and click the teeth twelve times. Closing the eyes, visualize the Two Spirits of Void and Constant, along with the twenty-five Points’ Constants—their hidden names and attire—each in their respective directions, distinctly arrayed within the stellar palaces, their radiance streaming and luminous, mysteriously illuminating your body. After a long while, they suddenly transform into two beasts, the phoenix and the dark turtle, descending from the midst of heaven. The phoenix rides the crimson qi’s radiance, alighting upon your head; the dark turtle rides the white qi’s radiance, descending beneath your feet. The phoenix enters through your mud-pill, the dark turtle through your life-gate, the red and white qi intertwining throughout your body. You sense your form transforming into a phoenix, standing atop the dark turtle, enveloped in the red and white qi. Then, click the teeth twenty-five times, swallow qi twenty-five times, and raise your head to recite the incantation:\n\n*\"Heaven’s essence and earth’s spirit,\nTitled Void and Constant,\nNorthward entering the Five Qi,\nSouthward governing the Three Yangs,\nWood generating flowing fire,\nSeven Qi breaking harm,\nWater irrigating the Nine Shocks,\nCentral Yuan ceasing its course,\nEarth reigning to nurture metal,\nWood Qi concealed and stored,\nGolden talismans commanding spirits,\nThe Great Emperor aiding and welcoming,\nSix Wù fleeing Six Jǐ,\nConcealed in the shadowy nether realms,\nThe Great One guarding the lungs,\nMetal anchoring the kidneys and bowels,\nUpper Yuan assisting the heart,\nRefining the immortal’s liver palace,\nInwardly fresh and outwardly flourishing,\nJade Perfected filling the four cardinals,\nTransforming myriad scenes,\nMerging the two lights,\nNuminous phoenix and dark turtle,\nDivine beasts coming to welcome,\nProfoundly entering the subtle,\nForm and soul soaring together,\nA thousand transformations, ten thousand changes,\nFollowing the will’s intent,\nEast, west, south, north,\nNone fail to aid and support,\nEternally preserving heaven and earth,\nEnjoying boundless blessings,\nAttaining to wander with the Radiant Emperor,\nIn the Upper Capital.\"*",
      "overlap_context": "shining brilliantly upon the northern direction. Further visualize the Five Stars, their luminosity illuminating the five directions, their light cascading to illuminate one’s body, sensing oneself within a crimson glow, inwardly and outwardly obscure. After a long while, visualize the Nine Stars’ and Five Stars’ Imperial Lords, the August Lords and their consorts, the Nine Stars’ inner consorts—their surnames, taboo names, styles, and attire—each within their stellar palaces, all made distinct.",
      "start_char": 6909,
      "end_char": 8379,
      "start_sentence": 223,
      "end_sentence": 264,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.118165493011475,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\上清五常变通万化郁冥经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "毕，引气二咽止。 此空常隐沦之道，玄微理妙，事极於此。 所谓变化万方，身生水火，迥合天地，适意所求者矣。 子得之者，位加仙公，北辰书名，南宫记籍，五星下降，万神侍卫，福德自然，无求傍力。 修之九年，立致飞行，上步天宿，游宴玉清。 学无此法，便绝望於遐思，无损神於寝夕矣。 上天禁书，轻泄漏慢，罪及九祖父母，己身卒亡，长闭鬼官。 龙飞九道尺素隐诀 太上大道君，以上皇元年二月一日甲子，於无量天告盟，传度飞行羽经空常变化隐文，以付北极真公。 时九天上帝高仙大圣，并临盟场，五帝束带，万灵侍轩，日月吐晖，众星列精，七元开关，黄道不行，天地停机，三界肃清，绛霞随荫，紫云四骞，时和日庆，八景敷陈。 道君裂帛华晨之下，授诀金口之中，发言九天，遥唱命讳，上帝称欣，天真稽首，魔王束形，保举玄虚，位登玉清。 命五老监试，四司辅真，左右侍仙，分盟告灵，依俯仰之格，北向祝曰： 寒非登场，上命九灵，运度推移，日月不停，是时告晨，赤心解形，衔刀南官，噏丹寒庭，金羊银疡，礼献上清，裂素分经，告盟干天，请如四极，万劫一传，有泄我言，祸罚七玄，有愆我盟，考灭尔形，生死谢责，长闭幽冥。 毕，於是裂素度经，口授秘言。 天真下降，五帝卫灵，九晨给以金晨玉童九百人，九皇给以玉华玉女七百人，五皇又给五帝玉女各五百人。 五老命驾，四司仗幡，紫云飞耕十二琼输，前导凤歌，后从天钧，六师启路，九龙翼辕，以迎於真公。 上登玉清北辰上宫，遨宴七元，回旋五宿，历步天关，位登总仙，治於北极广灵之宫。 至开皇上年，以文付东华青童大君，依格万劫一传。 龙飞尺素之道，出於九天上帝，以载天地九晨五星空常之名。 高上宝秘灵音，故为盟文，自非前生九万劫逆注玄简，录字上清，应为真人者，不得盻其篇目，参其隐音也。 得见此文，生死成仙，能修其道，则神光流映，帝皇下降，七年隐沦，变化百方，出入幽冥，浮景九空。 十四年白日登晨，飞升玉清。 有宗大经，但朝礼神真，则致长生，延寿无穷，千祸不干，万凶不当，兵灾珍息，触向皆成，出入则致九皇垂应，项映圆光，五帝营卫，所向司迎，克得奉侍圣君於上清宫。 此道与元始俱生，九元虚皇以传太上大道君，大道君以传后圣金阙帝君，及太帝君、太微天帝君、北极真公，使付束华青童大君。 依格万劫一传於后学得道之人。 传度之法，受者依科实信，绛纹缯九十尺，五色纹缯各五十尺，诣有经之师，对斋百日，或七十日，或七日。 於玄岳立坛高寂之地，书文北向分盟度诀。 以金羊五两告五星，银鸦九两告九晨，二物礼天受经，奉师效心。 子时露於坛场之上，以绛纹之巾盛羊着东，白纹之巾盛雁着西，告誓九天，分盟各半，口度秘名。 临度之时，亦依上祝之法。 可谓宝道贵真，誓不泄漏之盟。 若无盟轻传，师及弟子同考灭身，七祖充责，万劫不原。 上天之禁，宜各审详。 登盟之时，弟子执羊雁，北向九拜，次五方各一拜，西起，竟南还西，伏东向，置羊鸦於师左右。 师於中央，北向叩齿九道，称： 某岳真人臣某甲，敢以良时上吉，三合喜辰，谨登皇坛，披形赤心，清斋歃丹，列盟于天。",
      "translated_text": "When finished, draw in the qi and swallow twice, then stop.\nThis is the Dao of the Ever-Concealed, the profound and subtle principle of wondrous workings, wherein all matters culminate.\nHerein lies the myriad transformations, the body generating water and fire, merging with heaven and earth in perfect accord, fulfilling every intent and desire.\nThose who attain this shall ascend to the rank of Immortal Duke, their names inscribed by the Northern Asterism, their records kept in the Southern Palace.\nThe Five Stars shall descend, ten thousand spirits shall serve as guards, and blessings and virtue shall arise naturally, requiring no external aid.\nAfter nine years of cultivation, one shall attain flight, ascend to the celestial lodgings, and wander in revelry through the Jade Purity.\nWithout this method, all distant aspirations shall be cut off, and the spirit shall suffer no rest by night or day.\n\nThis is a celestial forbidden scripture. To lightly disclose or profane it brings guilt upon nine generations of ancestors and parents, while the offender’s own body shall perish abruptly, forever confined to the ghostly bureaus.\n\n**The Hidden Essentials of the Dragon’s Flight on Nine-Path Silk**\n\nThe Most High Lord of the Great Dao, in the first year of the Supreme August Emperor’s reign, on the first day of the second month (a *jiǎzǐ* day), proclaimed an oath in the Heaven of Infinite Vastness, transmitting the *Feathered Scripture of Flight and the Ever-Concealed Transformations* to the Perfected Lord of the Northern Culmen.\nAt that time, the Nine Heavens’ Celestial Emperor, the Lofty Immortals, and the Great Sages all attended the oath ceremony. The Five Emperors wore sashes, ten thousand spirits stood in attendance, the sun and moon radiated their splendor, the host of stars arrayed their essence, the Seven Origins opened the gates, the Yellow Path ceased its motion, heaven and earth paused their mechanisms, and the Three Realms grew solemn and clear.\nCrimson clouds cast their shade, purple mists soared on all sides, the time was harmonious, the day auspicious, and the Eight Sceneries unfolded in full.\nBeneath the radiant dawn, the Lord of the Dao tore the silk and imparted the secret within his golden mouth. His words resounded through the Nine Heavens, and from afar he intoned the sacred name.\nThe Celestial Emperor rejoiced, the Heavenly Perfected bowed their heads, the demon kings restrained their forms, and they pledged to uphold the Mysterious Void. Thus, the Perfected Lord ascended to the Jade Purity.\n\nThe Five Elders were commanded to oversee the trial, the Four Directors to assist the Perfected, and the attending immortals to the left and right to divide the oath and proclaim it to the spirits.\nFollowing the prescribed form of reverence, they faced north and intoned:\n*\"It is not for common ascent that we gather. By the mandate of the Nine Spirits, the revolutions shift ceaselessly, the sun and moon never halt. At this dawn hour, with sincere hearts and unbound forms, we hold the blade in the Southern Palace, inhale the cinnabar in the Cold Court.\nThe golden ram and silver crow are offered in homage to the Supreme Purity. The silk is torn to divide the scripture, and the oath is sworn before heaven. We beseech the Four Poles: let this be transmitted but once in ten thousand kalpas.\nShould any betray these words, calamity shall strike the Seven Mysteries. Should any violate this covenant, their form shall be extinguished, their life and death forfeit, and they shall be eternally confined to the dark nether realms.\"*\n\nWhen finished, the silk was torn to transmit the scripture, and the secret words were imparted orally.\nThe Heavenly Perfected descended, the Five Emperors guarded the spirit, the Nine Dawns bestowed nine hundred golden dawn lads and jade maidens, the Nine August Ones bestowed seven hundred jade flower maidens, and the Five August Ones further bestowed five hundred jade maidens each from the Five Emperors.\nThe Five Elders commanded their chariots, the Four Directors wielded their banners, twelve jade chariots of purple clouds flew in tandem, phoenix songs led the way, and celestial chimes followed behind.\nThe Six Masters cleared the path, nine dragons flanked the carriage, and thus they welcomed the Perfected Lord.\nAscending to the Northern Asterism’s Upper Palace of Jade Purity, he roamed and feasted among the Seven Origins, circled the Five Lodgings, traversed the Celestial Passes, and attained the rank of Supreme Immortal, governing the Palace of Vast Spirit in the Northern Culmen.\nIn the Supreme August Era, the text was transmitted to the Great Lord of the Eastern Florescence, the Azure Lad, to be passed on once in ten thousand kalpas according to the prescribed form.\n\nThe Dao of the Dragon’s Flight on Silk emerges from the Nine Heavens’ Celestial Emperor, bearing the names of the Nine Dawns, Five Stars, and the Ever-Concealed of heaven and earth.\nAs the precious, secret, numinous sound, it serves as the oath text. Unless one’s name was inscribed in the Mysterious Register of the Supreme Purity in a former life—having reversed the flow of ninety thousand kalpas—one shall not glimpse its passages or fathom its hidden tones.\nThose who behold this text shall achieve immortality in life or death. Those who cultivate its Dao shall radiate divine light, and the Celestial Emperor shall descend. After seven years of concealment, they shall transform in a hundred ways, traversing the nether realms and floating through the Nine Void Heavens.\nAfter fourteen years, they shall ascend at dawn and fly to the Jade Purity.\nThis is the great scripture of the ancestral lineage. By merely paying homage to the divine Perfected, one shall attain longevity, prolong life without end, repel a thousand calamities, and avert ten thousand misfortunes. Weapons shall be stilled, and all endeavors shall prosper.\nWhen one goes forth, the Nine August Ones shall respond, a halo shall encircle their neck, and the Five Emperors shall provide guard. Wherever they turn, the directors shall welcome them, enabling them to serve the Sage Lord in the Palace of Supreme Purity.\nThis Dao existed coevally with the Primordial Beginning. The Nine Origins’ Void Sovereign transmitted it to the Most High Lord of the Great Dao, who passed it to the Later Sage, the Golden Portal Emperor Lord, as well as the Supreme Emperor Lord, the Celestial Emperor of the Grand Tenuity, and the Perfected Lord of the Northern Culmen, who entrusted it to the Great Lord of the Eastern Florescence, the Azure Lad.\nAccording to the prescribed form, it is transmitted once in ten thousand kalpas to those among later learners who attain the Dao.\n\nThe method of transmission requires the recipient to be sincere and steadfast, offering ninety feet of crimson silk and fifty feet each of five-colored silk. They must seek a master who possesses the scripture and observe a hundred-day retreat—or seventy days, or seven days.\nUpon a secluded altar on the Mysterious Peak, they shall face north to divide the oath and transmit the secret.\nFive taels of golden ram are offered to the Five Stars, and nine taels of silver crow to the Nine Dawns. These two offerings are presented to heaven upon receiving the scripture, and the disciple pledges devotion to the master.\nAt the *zǐ* hour, the offerings are exposed upon the altar: the ram wrapped in crimson silk placed to the east, the crow wrapped in white silk placed to the west.\nThey swear the oath before the Nine Heavens, divide the silk, and orally transmit the secret names. At the moment of transmission, they follow the same prayer as above.\nThis is the precious Dao of the noble Perfected, an oath never to be betrayed. Without such an oath, any careless transmission shall bring the master and disciple alike to annihilation, their seven generations of ancestors condemned, and their souls unredeemed for ten thousand kalpas.\nThe prohibitions of heaven demand careful consideration.\n\nWhen ascending the altar, the disciple holds the ram and crow, faces north, and bows nine times. Then, they bow once to each of the five directions, beginning in the west, circling to the south, and ending in the west, prostrating to the east and placing the ram and crow to the master’s left and right.\nThe master stands at the center, faces north, and knocks his teeth nine times, declaring:\n*\"I, the Perfected Minister of [Name] Peak, [Personal Name], dare, at this auspicious time of triple conjunction, ascend the imperial altar, bare my form and sincere heart, purify my fast, and partake of cinnabar. I array this oath before heaven.\"*",
      "overlap_context": "\nJade Perfected filling the four cardinals,\nTransforming myriad scenes,\nMerging the two lights,\nNuminous phoenix and dark turtle,\nDivine beasts coming to welcome,\nProfoundly entering the subtle,\nForm and soul soaring together,\nA thousand transformations, ten thousand changes,\nFollowing the will’s intent,\nEast, west, south, north,\nNone fail to aid and support,\nEternally preserving heaven and earth,\nEnjoying boundless blessings,\nAttaining to wander with the Radiant Emperor,\nIn the Upper Capital.\"*",
      "start_char": 8380,
      "end_char": 9622,
      "start_sentence": 265,
      "end_sentence": 300,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.09820532798767,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\上清五常变通万化郁冥经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "愿高上垂映，顾盼贱臣，北帝所举某岳先生某甲，先身垂福，庆深来生，轮转流祚，九天不绝，宿名玄简，运禀今日，得目披洞章，口咏帝一，贪羡神仙，仰希灵契，今辄於某天之中，授度羽章飞空之诀，上告万帝至极元皇，高仙大圣，无量道君，愿垂回映，曲监盟灵，以玉清上宫真仙之气，辅侍某身，上告五帝五岳万灵，河海大神，共监盟文，请如所奏，依格以传。 尺素诀左半，当以白素二尺书此文，令一半在一尺上，两半合中央符。 受者以紫笔书讳，朱笔书文及符。 师度讳，请玉童玉女侍卫受者身毕，於中央符裂分各半佩身。 男受取左，女受取右，以丹锦为囊，盛文当心。 每不可冒生死之掩，三犯天宿奔溃，五帝号泣，魂精荡散，亡神失魄，不移年而丧身。 九天上禁，慎之则天灵玄映，神真下降，身生水火，万化自从也。 太上白羽黑翮灵飞玉符 元始九天父母、太真丈人，同宴景龙之舆，从桑林千真万骑，飞仙巨此御轮，流电迅姻，纵体适运，口歌灵篇，逍遥玄丘之洞，解憩清波之隅，游盘紫虚之绾，息驾无岁之端。 是时天元焕明，五晨回光，三素流云紫姻，吐芳飞香，绕日馥散太无，华光交焕，三烛合明，凝真上契，咀嚼日根，餐玄注虚，披朗金章，洞啸九微，灵畅琼轩，妙思感於太寂，内念启於自然。 以上皇元年三月三日，元始启旦，忽致玄灵垂驾白鸾之车，黑翮之凤口衔素章，飞行羽经登空步虚真诀。 玉精飞仙导烟，群神卫灵，腌蔼九霄之上，焕赫玉虚之庭，来降於太真玄丘，传授宝经。 是日太真丈人方退斋上清，时太帝君、紫微三素元君、天帝君、太微天帝君、高上玉皇之宾，咸同降坐，焚百和之香，置五色神官浮号，玉位列于紫宫。 众真礼经旋行三周，三素元君起立西向，发玄朗之音，诵庆真羽章，以赞神经。 其辞曰： 蔼沬太虚馆，灵风散奇香。",
      "translated_text": "May the Most High deign to cast its radiance upon this humble servant, turning its gaze to the Minister of [Name] Peak, [Personal Name], whom the Northern Emperor has exalted. May the blessings of past lives extend deeply into future rebirths, the wheel of fortune turning without cease across the Nine Heavens. Inscribed upon the mystic registers of destiny, this day I am granted the vision to behold the arcane scriptures and the voice to chant the hymns of the Imperial Unity. Envious of the immortals and yearning for divine communion, I now, within the midst of [Name] Heaven, receive the rites of transcendence—the esoteric formulas of feathered flight through empty space.\n\nI hereby supplicate the Ten Thousand Emperors, the Supreme Primal Sovereign, the Lofty Immortals and Great Saints, the Boundless Lords of the Dao, beseeching them to turn their luminous gaze and graciously oversee this sacred covenant. May the qi of the Perfected Immortals of the Jade Pure Upper Palace attend and guard my person. I invoke the Five Emperors, the Five Peaks, the myriad spirits, the river and sea deities—all to bear witness to this oath and to transmit the teachings in accordance with the established protocols.\n\nThe left half of the silk writ shall be inscribed on two *chi* of white silk, with one half on each *chi*, the two halves joined by a central talisman. The recipient shall inscribe the master’s taboo name in purple ink, and the text and talisman in vermilion. Once the master’s transmission of the taboo name is complete, the Jade Lads and Jade Maidens shall attend the recipient’s person. The central talisman shall then be split, each half to be worn upon the body: the left for men, the right for women. The writ shall be encased in a cinnabar-silk pouch and worn over the heart.\n\nBeware the veils of life and death—three transgressions shall scatter the celestial lodgings, and the Five Emperors shall weep in lament. The soul’s essence shall dissipate, the spirit wander astray, and the hun and po be lost, bringing death within the year. The prohibitions of the Nine Heavens are absolute: observe them, and the numinous radiance of heaven shall descend, divine immortals shall alight, the body shall command water and fire, and the myriad transformations shall submit of their own accord.\n\n**The Jade Talisman of the White-Feathered, Black-Quilled Numinous Flight**\n\nThe Primordial Father of the Nine Heavens and the Celestial Mother, the Supreme Perfected Lord, together ascended the resplendent dragon chariot, accompanied by the thousand immortals and ten thousand riders of the Mulberry Grove. The flying immortals harnessed this celestial wheel, swift as lightning and fleeting as mist, their bodies moving in harmony with the cosmos. They chanted sacred hymns, wandering the caverns of the Mystic Mound, resting by the limpid waves, roaming the purple void’s embrace, and halting at the timeless edge of the ageless realm.\n\nAt that moment, the celestial origin shone brilliantly, the five dawns turned their light, and the three pure clouds wove purple mists, exhaling fragrant blossoms that encircled the sun, their fragrance dispersing into the Great Void. Radiant splendor intertwined, the three torches merged their brilliance, congealing the true essence in perfect union. They chewed the root of the sun, imbibed the mysterious and infused the void, unfurled the resplendent golden scriptures, and intoned the nine subtleties in a resonant chant. The numinous chariot soared, their wondrous thoughts stirring the Great Silence, their inner contemplation awakening the Spontaneous.\n\nOn the third day of the third month of the first year of the *Above Emperor* era, at the dawn of the Primordial’s revelation, the Mystic Numinous descended in a chariot drawn by white simurghs, black-quilled phoenixes bearing in their beaks the silk writ of the *Feathered Flight through Empty Space*. The jade essence of the flying immortals guided the mist, the host of spirits guarded the numinous, their luminous presence suffusing the Nine Empyreans, resplendent in the courtyard of the Jade Void. They descended upon the Mystic Mound of the Supreme Perfected to transmit the precious scriptures.\n\nOn that day, as the Supreme Perfected Lord completed his fast in the Upper Clarity, the Celestial Emperor of the Great Thearch, the Three Pure Primordial Ladies of the Purple Tenuity, the Heavenly Emperor, the Celestial Emperor of the Supreme Tenuity, and the august guests of the Lofty Jade Sovereign all descended together. They kindled incense of a hundred harmonies, arrayed the floating banners of the five-colored spirit officials, and took their jade seats in the Purple Palace. The assembled immortals circumambulated the scriptures thrice, whereupon the Three Pure Primordial Ladies rose, faced west, and intoned in a voice of mystic clarity the *Ode of Celebration for the Feathered Writ*, extolling the divine scriptures. Their words began:\n\n*\"The vapors gather in the halls of the Great Void,\nA numinous wind scatters rare fragrance...\"*",
      "overlap_context": "tions, beginning in the west, circling to the south, and ending in the west, prostrating to the east and placing the ram and crow to the master’s left and right.\nThe master stands at the center, faces north, and knocks his teeth nine times, declaring:\n*\"I, the Perfected Minister of [Name] Peak, [Personal Name], dare, at this auspicious time of triple conjunction, ascend the imperial altar, bare my form and sincere heart, purify my fast, and partake of cinnabar. I array this oath before heaven.\"*",
      "start_char": 9622,
      "end_char": 10333,
      "start_sentence": 301,
      "end_sentence": 316,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.965291738510132,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\上清五常变通万化郁冥经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "萧萧玄景上，微飙翼太阳。 素鸾迅飞凤，口衔神羽章。 翻翮振九霄，悲呜焕玄梁。 妙诀乘空发，清治道未央。 群真并称庆，稽首礼玉皇。 诵毕，太帝君又起立北向，诵曰： 玄凤迅云翮，白鸾欣踌躇。 飞香和芳花，流星耀云衢。 巨虹控长辔，飞仙互相扶。 万真庆嘉吉，欣凤虚中游。 元始本无迹，玄感自相求。 振羽不待驾，飘飘乘姻浮。 宝章综玄纲，五体御灵符。 称庆礼福庭，旋香各三周。 诵毕，天帝君起立东向，又诵曰： 素羽斑玄翩，乘浮落运回。 流香溢十天，芳芝郁太微。 灵章启幽机，羽经朗玄辉。 至道本无赜，持真景白飞。 於是诵毕。 太真丈人身建法服，冠极天无量三宝玉冠，衣无缝九色飞云耀光羽章，左佩流铃，右带七元，正南向而伏。 太微天帝君，起命羽仙侍郎擎执金案，承经北向长立，以授於太真。 众仙咸称善，太真长立授经，面发金光，五体即生自然灵飞玉符，登携众真，共登白鸾之车，驾黑翮之凤，以宴常阳东之豪林碧水之境，扶桑之墟九源之口，西游玄羽素野之域蒙汜之滨，南造朱陵极炎之精南夏之邑，北到朔阴洞玄之馆寒水之乡，中盘十绝黄气阳精太玄玉京金台玉室丹琼之宫。 游朗十天，八域洞清，总领亿真，无天不系，无幽不关，无气不统，无仙不摄，普御群神，自天以下，莫不范德於太真，仰宗於羽经也。 於是帝君各浮玄官，经劫七千，传於太上大道君焉。 上灵飞玉符玄仙羽精自然之章，佩之七年，乘空飞行，上登七元。 修羽经飞步之道，无此符则不得乘虚升玄也。 受者青锦九十尺盟天。 登修之日，书左手掌心，即能握碧霞而飞行。 书青缯九寸，佩之左肘，六甲十二神，灵飞玉女十二人侍左。 下灵飞玉符元始羽精玄玉之章，佩之七年，乘空飞行，上登五星。 行飞步升玄之道，无此符则不得乘空而行也。 受者素锦六十尺盟天。 登修之日，书右手掌心，则能握素霞而飞行。 书白缯九寸，佩之右肘，六甲十二神，灵飞玉女十二人侍右。 左灵飞玉符玄气始生之精素羽之章，佩之九年，乘空飞行，上登五星。 行飞步升玄之道，无此符则不得蹑云玄升也。 受者丹锦八十尺盟天。 登修之日，书左足跖心，即能蹑空飞行。 书绛缯九寸，佩之左肘，六甲十二神，灵飞玉女十二人侍前。 右灵飞玉符元气之精升玄羽章，佩之九年，得乘飞云，行步玉清。 修飞步之道，无此符不得蹑於七元而升虚也。 受者玄锦五十尺盟天。 登修之日，书右足取心，即能步玄飞行。 书皂缯九寸，佩之右肘，六甲十二神，灵飞玉女十二人侍后。 太灵飞玉符阳气黄精飞行羽章，佩之九年，面生金光，坐在立亡，飞行太空。 修飞步之道，无此符则不得仰登星魁，超升九玄。 受者黄锦十二尺盟天。 登修之日，书符於心前，即能吐气成云，乘云飞行。 书黄缯九寸，佩之左肘，六甲十二神，灵飞玉女十二人侍身。 凡修行存思七星之道，入室皆先服五符，然后书也。 书及服符，皆东向叩齿十二通，仰祝曰： 玄虚紫清，飞行羽经，上映云宫，下摄千灵，控御六甲，运我身形，飞步天纲，上攀斗精，凝魂固魄，内镇充盈，出空入玄，与气常生。 毕，服符并书五心，然后行事。 如此九年，克得乘空御云，飞行太清。 左右灵飞玉符，出於自然之气，传授於太真，以登空步虚，乘魁蹑纲，缠络七元，上升玉清之道，以备飞行羽经。",
      "translated_text": "The mystic radiance soars aloft in the void,\nA gentle breeze bears the sun on its wings.\nThe white simurgh swiftly follows the phoenix,\nIts beak holding the divine *Feathered Writ*.\nBeating their pinions, they shake the nine heavens,\nTheir mournful cries illumine the dark beams.\nArcane incantations issue forth through the air,\nThe pure governance of the Dao knows no end.\nThe assembled immortals join in celebration,\nBowing their heads in homage to the Jade Sovereign.\n\nWhen the recitation concluded, the Celestial Emperor of the Great Thearch rose again, facing north, and intoned:\n\n*\"The dark phoenix darts on cloud-wings,\nThe white simurgh rejoices in its stride.\nFlying fragrance blends with fragrant blossoms,\nMeteors gleam along the clouded thoroughfares.\nA mighty rainbow reins the long bridle,\nFlying immortals support one another.\nThe ten thousand perfected celebrate this felicitous fortune,\nJoyous phoenixes roam the empty midst.\nThe Primal Beginning leaves no trace,\nYet the mystic resonance seeks itself.\nBeating their wings without awaiting a chariot,\nThey drift lightly upon the mists of affinity.\nThe treasure scripture weaves the dark warp,\nThe five bodies command the numinous talismans.\nIn celebration they bow before the Court of Blessings,\nCircumambulating the incense thrice.\"*\n\nWhen this recitation ended, the Heavenly Emperor rose, facing east, and intoned:\n\n*\"White feathers and dark wings flutter,\nRiding the floating mists in cyclic return.\nFlowing fragrance overflows the ten heavens,\nFragrant fungi flourish in the Supreme Tenuity.\nThe numinous scripture unlocks the hidden mechanism,\nThe *Feathered Writ* shines with mystic splendor.\nThe supreme Dao is fundamentally without obscurity,\nHolding fast to the true, the radiant scene soars white.\"*\n\nWhen this too concluded, the Venerable Lord of the Great Perfected donned his ritual vestments: a crown of the Infinite Three Treasures of Heaven, a robe of seamless nine-colored flying clouds adorned with luminous feathered script, a tinkling bell at his left, and the Seven Primes at his right. Facing due south, he prostrated himself. The Celestial Emperor of the Supreme Tenuity then commanded the Feathered Immortal Attendant to raise a golden table, bearing the scripture as he stood facing north, and presented it to the Great Perfected. All the immortals voiced their approval, and the Great Perfected rose to receive the scripture. A golden light emanated from his countenance, and the five agents of his body spontaneously generated the *Numinous Flying Jade Talismans*. Ascending with the assembled perfected, they boarded the white simurgh’s chariot, drawn by black-winged phoenixes, to feast in the verdant groves and azure waters of the Eastern Expanse of Eternal Yang, the precincts of Fusang, the mouth of the Nine Springs. They journeyed west to the dark-feathered plain of the White Wilderness by the banks of the Mengsi, south to the Crimson Mound and the essence of extreme flame in the southern lands of Xia, north to the frigid halls of the Northern Darkness and the abode of the Cold Waters, and circled the ten absolute peaks of the Yellow Qi and the Yang Essence in the Great Mysterious Jade Capital, the Golden Terrace, the Jade Chamber, and the Cinnabar Palace. They roamed the ten heavens and the eight domains of the Grotto Clarity, governing the countless perfected. No heaven was beyond their reach, no hidden realm beyond their purview, no *qi* beyond their command, no immortal beyond their charge. They universally governed the host of spirits, and from heaven downward, none failed to model their virtue upon the Great Perfected or revere the *Feathered Writ*.\n\nThereupon, the Celestial Lords each ascended their dark palanquins, and after seven thousand kalpas, transmitted the scripture to the Most High Lord of the Great Dao. The *Upper Numinous Flying Jade Talisman of the Dark Immortal Feathered Essence* is worn for seven years, enabling one to ride the void and ascend to the Seven Primes. Those who cultivate the *Feathered Writ’s* flying paces without this talisman cannot ascend the void to the dark mysteries. The recipient pledges to heaven with ninety feet of azure brocade. On the day of ascetic practice, inscribing the talisman upon the left palm allows one to grasp the azure radiance and take flight. Inscribing nine inches of azure silk and wearing it on the left elbow summons the Six Jia and Twelve Spirits, with twelve *Numinous Flying Jade Maidens* attending at the left.\n\nThe *Lower Numinous Flying Jade Talisman of the Primal Feathered Essence of Dark Jade* is worn for seven years, enabling one to ride the void and ascend to the Five Stars. Those who practice the flying paces to ascend the dark mysteries without this talisman cannot traverse the void. The recipient pledges to heaven with sixty feet of white brocade. On the day of ascetic practice, inscribing the talisman upon the right palm allows one to grasp the white radiance and take flight. Inscribing nine inches of white silk and wearing it on the right elbow summons the Six Jia and Twelve Spirits, with twelve *Numinous Flying Jade Maidens* attending at the right.\n\nThe *Left Numinous Flying Jade Talisman of the Dark Qi’s Primal Essence and White Feathered Writ* is worn for nine years, enabling one to ride the void and ascend to the Five Stars. Those who practice the flying paces to ascend the dark mysteries without this talisman cannot tread the clouds to ascend the dark mysteries. The recipient pledges to heaven with eighty feet of cinnabar brocade. On the day of ascetic practice, inscribing the talisman upon the sole of the left foot allows one to tread the void and take flight. Inscribing nine inches of crimson silk and wearing it on the left elbow summons the Six Jia and Twelve Spirits, with twelve *Numinous Flying Jade Maidens* attending at the front.\n\nThe *Right Numinous Flying Jade Talisman of the Primal Qi’s Essence and Ascending Dark Feathered Writ* is worn for nine years, enabling one to ride the flying clouds and traverse the Jade Clarity. Those who cultivate the flying paces without this talisman cannot tread the Seven Primes to ascend the void. The recipient pledges to heaven with fifty feet of dark brocade. On the day of ascetic practice, inscribing the talisman upon the sole of the right foot allows one to tread the dark and take flight. Inscribing nine inches of black silk and wearing it on the right elbow summons the Six Jia and Twelve Spirits, with twelve *Numinous Flying Jade Maidens* attending at the rear.\n\nThe *Great Numinous Flying Jade Talisman of the Yang Qi’s Yellow Essence and Flying Feathered Writ* is worn for nine years, causing a golden light to emanate from the face, enabling one to vanish while sitting or standing and to fly through the great void. Those who cultivate the flying paces without this talisman cannot ascend to the stellar pivots or transcend the Nine Darks. The recipient pledges to heaven with twelve feet of yellow brocade. On the day of ascetic practice, inscribing the talisman before the heart allows one to exhale *qi* as clouds and ride them in flight. Inscribing nine inches of yellow silk and wearing it on the left elbow summons the Six Jia and Twelve Spirits, with twelve *Numinous Flying Jade Maidens* attending the body.\n\nIn all practices of meditative visualization upon the Seven Stars, one must first ingest the five talismans before inscribing them. When inscribing or ingesting the talismans, face east, click the teeth twelve times, and pray aloud:\n\n*\"Dark Void and Purple Clarity,\nFlying *Feathered Writ*,\nAbove you illumine the cloud palaces,\nBelow you command the thousand spirits.\nYou govern the Six Jia,\nTransport my bodily form,\nTraverse the celestial warp,\nAscend to grasp the Dipper’s essence.\nCongeal the hun and solidify the po,\nInternally secure and fill the self.\nExiting the void and entering the dark,\nEver abide with the qi.\"*\n\nUpon completion, ingest the talisman and inscribe it upon the five centers, then proceed with the practice. After nine years of such cultivation, one may ride the void and command the clouds, flying through the Great Clarity. The *Left* and *Right Numinous Flying Jade Talismans* emerge from the *qi* of spontaneity, transmitted by the Great Perfected to ascend the void, tread the celestial warp, entwine the Seven Primes, and ascend to the Jade Clarity, perfecting the *Flying Feathered Writ*.",
      "overlap_context": " a hundred harmonies, arrayed the floating banners of the five-colored spirit officials, and took their jade seats in the Purple Palace. The assembled immortals circumambulated the scriptures thrice, whereupon the Three Pure Primordial Ladies rose, faced west, and intoned in a voice of mystic clarity the *Ode of Celebration for the Feathered Writ*, extolling the divine scriptures. Their words began:\n\n*\"The vapors gather in the halls of the Great Void,\nA numinous wind scatters rare fragrance...\"*",
      "start_char": 10333,
      "end_char": 11620,
      "start_sentence": 317,
      "end_sentence": 372,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.87098002433777,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\上清五常变通万化郁冥经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "得之者神仙，佩之者成真人，修之者致白鸾之车，黑翮之凤，来迎子身，上登玉清宫，游宴常阳。 太上大道君以传上元太素君、太微天帝君，施行道成，秘於太上灵都之宫。 依科三千年一传，不得轻泄宣露天真，违盟负誓，身没鬼官，殃及九祖，充闭幽泉。 飞行羽经九真升元上记 太上大道君，昔受飞行羽经九真升玄上记，宝言紫文绿金之字，超虚蹑空浮景之道，於玉清上宫虚皇高上道君。 於是太上大道君以其要传上清玉帝君，上清玉帝君以传上元太素君，上元太素君又传太微天帝君。 太微天帝君施行真秘，以传晨中黄景君，晨中黄景君又以传皇初紫灵君，皇初紫灵君以传中央黄老君，中央黄老君以传九微太真玉保王金阙上相大司命高晨师青童大君梵湄，使以此文教授当得为真人者也。 诸有太素绛录及金阙刻名，皆当得见此文。 自非其人，不得与相遇。 欲出传之者，必须精应感畅，乃付之耳。 歃盟断金，誓以不宣之信矣。 有此经者，太素三元君遣玉童二十四人，玉女二十四人，侍经之左右，纠刺泄慢之愆，卫护有经者身。 此中真之道也，非仙次第之中也。 盖中和之中真也，配简三元，名刊太素，行则紫毛之节，驾则八景云舆，前导万灵，后从千真，九凤齐呜，天钧唱弦，神龙启导，五帝縿轩，飞行太空，遨宴丹霄，位为上清真人玉卿之师。 诸有太上飞行羽经升玄九真者，听三千年六传，遇其人一日顿授之。 若无可授者，三千年限尽，以朱书素写六通，封之峨媚山金台之室。 过此不复传出。 不可授而传者，泄真人之道也。 受而不承科者，毁真人之誓也。 授者经师，受者宗焉。 违经慢范，宣露宝文者，七祖父母诣玄都，受风刀之考，身为下鬼，积幽夜之河也。 欲受飞行，散金为盟，欲知仙忌，文巾为质，既知羽书，天地同符，子闻玄文，超驾庆云，此之谓也。 出委羽洞台刻石铭。 太素三元君有言日：仙人始知瘾庇斗星之道，而未知真人藏斗星之法。 夫九斗者，天枢之正盖，玄轴之华宝，机纽八维，总旋九度，回荫圆方，运摄和气，理调阴阳，司适无外。 夫斗星者，朗曜为之夜翳，璇玑为之动用，四象为之流坠，玄明焕烂，威光赫蔚矣。 太无帝君有言曰：仙人徒知咀嚼阴阳，吐纳二气，而不知斗星者，是阴阳之根府，二象之玄纲也。 乃苦辛玩其波末，而不识营始而甚易，荫庇其枝条，而失乎根本矣。 何不藏九斗，陶冶至象耶。 行之十四年，太上迎以琼轮，超虚蹑空，上登上清，列为上真，反神婴颜，众神侍轩。 青童大君有言曰：仙人徒知璇玑大威，焕惧万辰，睹九道之流赫，玩圆动以摄神，庇之以求大度，用之以求神仙，而犹不识回九光以内照，藏明斗於泥丸，於是魂凝魄炼，合德云姻，解其道上升上清，得其道身为上真。 是以真人抱大象以匿霞，包斗精以藏身，我先师是故左驾绿云，右辔绛晨，身升太素，超虚蹑空，存斗星紫色，其纲赤色，觉紫色之气温温暖也。 存星大小，在意行之。 此青童君口诀。 昔梧成子、谷希子、广成子、青真子，合存斗星之气，并与身共入莲实之中，忽见莲内有千里金池，玉山万顷，宫台宇室，盖亦连云，朱木结实，紫华生园，碧辇玄黄，三素八轮，奇异之观，不可名字。",
      "translated_text": "Those who attain it become divine immortals; those who wear it become perfected beings. Those who cultivate it summon the white-luan chariot and the black-winged phoenix to welcome their bodies, ascending to the Jade Clarity Palace to roam and feast in the Eternal Yang. The Most High Lord of the Great Dao transmitted it to the Supreme Prime Lord of Grand Simplicity and the Celestial Emperor of the Grand Tenuity. When the Dao is practiced to completion, it is concealed within the Numinous Capital of the Most High. According to the regulations, it is transmitted once every three thousand years, and must not be lightly divulged or revealed to celestial perfected ones. Those who violate the covenant and betray their oaths will have their bodies consigned to the offices of ghosts, their misfortune extending to nine generations, bound in the Dark Springs.\n\n*The Flying Feathered Writ: Nine Perfected Ascending to the Primordial Upper Record*\nThe Most High Lord of the Great Dao once received *The Flying Feathered Writ: Nine Perfected Ascending to the Primordial Upper Record*, its treasured words inscribed in purple script and green-gold characters, the Dao of traversing the void and treading the empty sky upon floating radiance, bestowed by the Highest Lord of the Dao in the Jade Clarity Upper Palace. Thereupon, the Most High Lord of the Great Dao transmitted its essentials to the Jade Emperor of the Highest Clarity. The Jade Emperor of the Highest Clarity transmitted it to the Supreme Prime Lord of Grand Simplicity, who in turn transmitted it to the Celestial Emperor of the Grand Tenuity. The Celestial Emperor of the Grand Tenuity practiced its true secrets and transmitted it to the Yellow Radiance Lord of the Central Dawn. The Yellow Radiance Lord of the Central Dawn transmitted it to the Purple Numinosity Lord of the Primordial Beginning, who transmitted it to the Yellow Elder Lord of the Center. The Yellow Elder Lord of the Center transmitted it to the Jade Guardian King of the Nine Subtleties, the Great Minister of Fate, the High Dawn Master, the Azure Lad, and the Great Lord Fanmei, instructing them to teach this text to those worthy of becoming perfected beings. All who possess the *Crimson Record of Grand Simplicity* or whose names are inscribed in the Golden Portal shall be permitted to behold this text. Those unworthy shall not encounter it. Should one wish to transmit it, one must first attain perfect resonance and response before bestowing it. They shall swear an unbreakable oath, pledging inviolable secrecy.\n\nThose who possess this scripture shall be attended by twenty-four Jade Lads and twenty-four Jade Maidens sent by the Three Primordial Lords of Grand Simplicity, who shall stand to the left and right of the scripture, correcting and restraining transgressions of carelessness and disclosure, guarding and protecting the bearer. This is the Dao of the central perfected, not of the ordinary ranks of immortals. It is the central perfection of harmony, aligned with the registers of the Three Primes, its name recorded in Grand Simplicity. In action, it is marked by purple-feathered standards; in travel, it is borne by the eight-radiance cloud chariot. Ten thousand spirits lead the way, a thousand perfected follow behind. Nine phoenixes cry in unison, celestial zithers play their strings. Divine dragons open the path, the Five Emperors’ banners flutter. They traverse the Great Void, roaming and feasting in the Cinnabar Empyrean, attaining the rank of Master of the Jade Ministers among the Perfected of the Highest Clarity.\n\nAll who possess *The Flying Feathered Writ of the Most High: Ascending to the Primordial Nine Perfected* shall observe the rule of six transmissions in three thousand years. If a worthy recipient is found, it may be bestowed in a single day. If none are found when the three-thousand-year limit expires, six copies shall be inscribed in red on plain silk, sealed within the Golden Terrace Chamber of Mount Emei. Beyond this, it shall not be transmitted again. To transmit it to the unworthy is to divulge the Dao of the perfected. To receive it without upholding the regulations is to violate the oath of the perfected. The transmitter is the scripture master; the recipient is their disciple. Those who defy the scripture, disregard its precepts, or reveal its treasured words shall have their seven generations of ancestors brought before the Dark Capital to endure the trials of the Wind Blade. Their bodies shall become lowly ghosts, submerged in the River of Eternal Night.\n\nTo receive the *Flying Feathered Writ*, scatter gold as an oath. To know the taboos of immortality, offer a silk kerchief as a pledge. Once you comprehend the feathered scripture, heaven and earth become as one. Having heard these mysterious words, you shall transcend and ride the auspicious clouds—this is what it means.\n\n*Inscribed on the stone stele of the Terrace of Committed Feathers.*\n\nThe Three Primordial Lords of Grand Simplicity have said: Immortals first know the Dao of concealing themselves beneath the Dipper’s stars, yet do not know the method by which perfected beings conceal the Dipper’s stars. The Nine Dipper stars are the true canopy of the Celestial Pivot, the radiant treasure of the Mysterious Axis, the mechanism that binds the eight directions, the hub that revolves the nine measures. They turn and shade the square and round, governing and harmonizing the qi, regulating yin and yang, presiding over all without exception.\n\nThe Dipper’s stars—brilliant and luminous—veil the night. The turning jade mechanism sets them in motion. The Four Symbols flow and descend from them. Mysterious brightness shines resplendently, their majestic radiance blazing. The Supreme Lord of the Great Void has said: Immortals merely know how to chew yin and yang, to exhale and inhale the two qi, yet do not know that the Dipper’s stars are the root and repository of yin and yang, the mysterious warp of the two images. They toil arduously at the waves’ ends, failing to recognize the ease of tending to the source. They shelter beneath its branches and leaves, yet lose the root and foundation. Why not conceal the Nine Dipper, refining and forging the supreme image?\n\nPractice this for fourteen years, and the Most High shall welcome you with a jade wheel. You shall traverse the void and tread the empty sky, ascending to the Highest Clarity, ranked among the supreme perfected. Your spirit shall return, your countenance rejuvenated, and all spirits shall attend your chariot. The Azure Lad has said: Immortals merely know the great majesty of the turning jade mechanism, its brilliance startling the myriad stars. They behold the flowing radiance of the nine paths, delight in its circular motion to gather the spirit, sheltering beneath it to seek great attainment, employing it to seek divine immortality. Yet they still do not know how to turn the nine lights inward to illuminate, to conceal the bright Dipper within the muddy pellet. Thereby, the hun is congealed and the po refined, virtue and cloud-mist harmonized. Those who master this Dao ascend to the Highest Clarity; those who attain it become supreme perfected.\n\nThus, the perfected embrace the great image to conceal the radiance, enclose the Dipper’s essence to hide the self. My former master therefore rode upon green clouds to the left, reined the crimson dawn to the right, ascending to Grand Simplicity, traversing the void and treading the empty sky. Visualize the Dipper’s stars as purple, its warp as red. Sense the purple qi as warm and gentle. Envision the stars’ sizes as you practice. This is the oral instruction of the Azure Lad.\n\nFormerly, Master Wucheng, Master Guxi, Master Guangcheng, and Master Qingzhen together visualized the qi of the Dipper’s stars, merging it with their bodies to enter the lotus seed. Suddenly, they beheld within the lotus a golden pond a thousand leagues wide, jade mountains ten thousand qing in expanse. Palaces, terraces, chambers, and halls stretched unbroken into the clouds. Vermilion trees bore fruit, purple blossoms bloomed in gardens. Azure carriages and mysterious yellow banners, the Three Simplicities and Eight Wheels—wondrous sights beyond naming.",
      "overlap_context": ".\"*\n\nUpon completion, ingest the talisman and inscribe it upon the five centers, then proceed with the practice. After nine years of such cultivation, one may ride the void and command the clouds, flying through the Great Clarity. The *Left* and *Right Numinous Flying Jade Talismans* emerge from the *qi* of spontaneity, transmitted by the Great Perfected to ascend the void, tread the celestial warp, entwine the Seven Primes, and ascend to the Jade Clarity, perfecting the *Flying Feathered Writ*.",
      "start_char": 11620,
      "end_char": 12853,
      "start_sentence": 373,
      "end_sentence": 407,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.13454484939575,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\上清五常变通万化郁冥经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "四子遨游经时，旋宴极盻而反。 当是之时，不觉莲实之中央也。 所谓以大投小，变化无踪，此存星之极感，阔狭之标致也。 乃可毫杪为八极，何莲实之足妙哉。 以月一日、三日，及五日禺中、夜半，唯一时也，入堂正坐，北向接手，定气临目毕，乃存北斗九星来下，入头泥丸中，以柄杓前指，魁偃向上也。 良久，忽见斗魁中有一大神人，衣服名字如祝所言，极久，头中当小热，温温然也。 此是上元九精真气来入头，故暖异，以告验报感之休应也。 方乃#1咽液五十过，叩齿九通毕，左手第三指捻两眉中，於是微祝曰： 太上紫晖，九道之尊，华盖七络，回曜万晨，动御高灵，静和景云，阴阳流灌，一气中分，游济无外，焕朗众天，令月启辰，来登泥丸，元精结感，化为大神，名曰奇纽，厥子灵纲，正坐斗中，游我明堂，凤羽紫被，虎锦丹裳，左带玉佩，右腰金铛，手把流铃，头巾晨光，吐气溉精，泥丸以康，魂魄凝和，植华柱梁，使我飞仙，超虚蹑空，上造上清，策虎命龙，北朝玉帝，琼琳上宫，西谒太素，稽首三元。 祝毕，又咽液三十过，叩齿九通，又祝如前毕，起北向再拜，西向再拜毕，乃不复临目，事讫。 诸寝静之室床上，行之亦可也，拜亦不下地也。",
      "translated_text": "The four masters roamed for some time, then turned their gaze in leisurely contemplation and returned. At that moment, they were unaware of the lotus seed’s center—such is the principle of the great entering the small, transformation without trace, the utmost resonance of stellar visualization, the essence of vastness and constriction. Thus may the tip of a hair become the Eight Extremes; how could the lotus seed not be wondrous?\n\nOn the first, third, or fifth day of the lunar month, at midday or midnight—these are the appointed times. Enter the hall, sit upright, face north, and clasp your hands. Regulate the breath, close the eyes, and then visualize the nine stars of the Northern Dipper descending into the head’s Mud-Pill Palace, with the Dipper’s handle pointing forward and its bowl tilted upward. After a long while, suddenly behold within the Dipper’s bowl a great divine figure, whose robes and name accord with the invocation’s words. After a great while, the head should grow slightly warm, gently so. This is the true qi of the Nine Essences of the Upper Prime entering the head, thus the unusual warmth—a sign of response to the verification of resonance.\n\nThen swallow saliva fifty times and click the teeth nine times. With the left hand’s third finger, press between the brows and softly recite the prayer:\n\n“Supreme Purple Radiance, honored of the Nine Paths,\nCanopy of sevenfold splendor, revolving brilliance of ten thousand dawns,\nMoving, you command the lofty spirits; still, you harmonize with the luminous clouds.\nYin and yang flow and irrigate, the single qi divides at the center,\nRoaming and aiding beyond all bounds, illuminating and brightening the host of heavens.\nThis month, this day, this hour, ascend to the Mud-Pill Palace.\nThe primal essence gathers and resonates, transforming into a great spirit,\nNamed Marvelous Pivot, whose child is the Numinous Net,\nSeated upright within the Dipper, roaming my Bright Hall.\nFeathered phoenix cloak of purple, tiger-embroidered cinnabar robes,\nLeft side girded with jade pendants, right waist hung with golden bells,\nHolding a flowing tassel, head crowned with dawn’s light.\nExhaling qi to bathe the essence, the Mud-Pill Palace is made sound,\nHun and po congeal in harmony, planting the flowering pillars and beams.\nLet me become a flying immortal, traversing the void and treading the empty sky,\nAscend to the Upper Clarity, rein the tiger and command the dragon,\nPay court to the Jade Emperor in the north, the Jasper-Limned Upper Palace,\nAnd in the west, prostrate before the Great Simplicity, bowing to the Three Primes.”\n\nWhen the prayer is finished, swallow saliva thirty times and click the teeth nine times. Recite the prayer again as before, then rise, face north, and bow twice; face west, and bow twice. No longer close the eyes; the practice is complete. This may also be performed on the bed in a quiet chamber, without descending to the ground for the bows.",
      "overlap_context": " Master Qingzhen together visualized the qi of the Dipper’s stars, merging it with their bodies to enter the lotus seed. Suddenly, they beheld within the lotus a golden pond a thousand leagues wide, jade mountains ten thousand qing in expanse. Palaces, terraces, chambers, and halls stretched unbroken into the clouds. Vermilion trees bore fruit, purple blossoms bloomed in gardens. Azure carriages and mysterious yellow banners, the Three Simplicities and Eight Wheels—wondrous sights beyond naming.",
      "start_char": 12853,
      "end_char": 13338,
      "start_sentence": 408,
      "end_sentence": 418,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.333906888961792,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\上清五常变通万化郁冥经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "夫真人作法，所贵於安其所安，崇妙简微，不复曲折败常，乖乎寝处也。 要道不烦，乃绝伦矣。 后施三祝之法，皆依希拟象此行也。 但祝不同，及存星有背向之异耳。 要言在於密房曲室，勿令有见其存思时也。 所以尔者，存思时玉童玉女将在侧而监焉，不可吊丧临尸，经秽殗，衣被巾履一切勿错越，以假借於非类矣。 何谓非类耶，不同志契者是也。 非我同好，不与同席而坐，非我同盟，弗与同器而食。 道俗有殊，有崇奉六天及事山川魔神者，弗居其室，弗飨其饥，勿着其衣，勿冠其巾，盖避其尸秽之下气，遏其邪风之往来也。 此所谓真道之真道矣，精妙之精妙也。 若能为其妙，乃得其真道，避其秽乃获其新。 若将混沌杂栖，臭香齐器，不标其神，不整其气，滛真同居，贪廉共位，厕邪风而不荡心，履尘壤而不思超迈者，以此寻真为无也。 夜光不生於粪阱，下才不植於标领，此之谓也。 精感仿髴，灵应机微，玉华告验，神光表晖，自非尔师，勿妄与之言也。 斗中大神者，盖九星之精，因感变而忽生矣。 是施行时，当心存名字，至后祝曰止。 后祝自后有神，又存如初。 若是泥丸中星神，恒存居其中。 每事效此为象。 存斗星来下，令极思不觉，忽然已在我形中也。 初存或未来时仿髴，但极思念之，如已在形中，亦足致感也。 久久自渐入妙。 月七日、九日、十三日，禺中时，若夜半时，入室正坐，接手定气临目毕，乃存北斗九星来下入心中，以柄杓坚仰向喉，魁中向外也。 良久，忽然见魁中有一大神，衣服名字如祝所言。 极久，当觉心中温温暖，真气来入也。 乃咽液五十过，叩齿九通，举右手第二指以捻心，於是乃微咒曰： 太上紫真，九气中灵，包括万度，璇玑焕明，飞霞流曜，晖烛玉清，玄盖众晨，阴阳判成，四和交降，七纬顺生，肇月吉辰，来映心庭，飞光络景，中元充盈，六府启关，华液泯平，魂魄制炼，得真之精，感至触变，亿兆立成，忽见大神，坐安心房，整气潮津，百节流通，攀斗据魁，盻邈百方，其名璇度，厥字素康，绛羽华帔，龙带虎裳，身生宝曜，项负圆光，首巾飞晨，英冠低昂，使我飞仙，超浮太空，上造紫阙，北朝玉皇，役使万神，众灵奉迎，心上生华，庆云永昌，凤啸玲玲，鸾吹锵锵。 祝毕，咽液三十过，叩齿九通，又祝如前，祝毕，起南向再拜，事毕，乃开目○ 月十五日、十九日、二十三日，禺中时，若夜半时，入室正坐，接手定气临目毕，乃存北斗九星来下，入脐下三寸下元宫中，以斗柄杓坚向心，魁中向外。 极久，忽见魁中有一大神，衣服名字如祝所言，亦当觉脐中温温热，真气来至也。 乃咽液六十过，叩齿九通，举左手第三指以捻鼻下人中，於是乃微祝曰： 太上紫皇，焕朗中枢，九纬炳蔼，光秀太霞，万灵仰镇，千晨植牙，七度用明，九烟芬葩，制阳表顺，执阴以和，真晖启阵，玄根总罗，肇月惟吉，观映脐内，紫气发霄，飞光纵坠，炼我魂魄，华津荣蔚，忽见大神，上宫灵贵，名曰祝萌，厥字流郁，正坐脐中，乘斗九气，吐纳灵液，平血理胃，黄凤羽帔，龙衣虎带，手启日根，头戴绿芙，腰生流火，焕电映无，使我飞仙，超虚蹑浮，上造玉房，担带霄虚，役使万神，天地同休。",
      "translated_text": "The true practitioner values stability in what is inherently stable, honoring the wondrous and subtle while avoiding convoluted deviations that disrupt the natural order of rest and repose. The essential Dao is unburdened—thus transcending all comparison. The subsequent three invocations all follow and emulate this method, differing only in their prayers and the orientation of the visualized stars.\n\nThe key lies in performing this within a secluded chamber, ensuring no one witnesses the visualization. For during this practice, jade youths and jade maidens stand beside you as overseers. One must not approach mourning rites, encounter corpses, or come into contact with impurities. Clothing, bedding, headscarves, and footwear must not be misused or lent to those of a different kind. What is this \"different kind\"? Those whose aspirations do not align with yours. Those not of like mind should not share your mat, nor should those not of your covenant share your vessel. Daoists and laypeople differ: those who revere the Six Heavens or serve mountain and river demons must not be entertained in your chamber, nor should you partake of their food, wear their garments, or don their headscarves. This is to avoid the foul qi of their corpse-like impurity and to block the passage of their perverse winds. Such is the true Dao of the true Dao, the essence of the most refined essence.\n\nIf one can embody this refinement, one attains the true Dao; by shunning impurity, one gains renewal. But those who dwell in chaos, mingling the foul with the fragrant in the same vessel, failing to distinguish the divine, neglecting to refine their qi, cohabiting with the licentious while sharing space with the upright, allowing perverse winds to unsettle the heart or treading in dust without aspiring to transcendence—such seekers will find no truth. As the radiant pearl does not emerge from a cesspit, nor does mediocre talent flourish in exalted ranks, so too is this principle.\n\nWhen essence and resonance align, the numinous responds with subtle efficacy. Jade blossoms manifest as signs, and divine radiance shines forth as verification. Unless they are your teacher, do not speak of this lightly.\n\nThe great spirits within the Dipper are the essences of the Nine Stars, born suddenly through resonant transformation. When practicing this method, first visualize their names and forms, then conclude with the invocation. After the invocation, the spirits will appear—visualize them again as before. If the star spirit of the Mud-Pill Palace is to be constantly visualized, let it reside within. Model all practices after this example.\n\nVisualize the Dipper’s stars descending until, through intense focus, you suddenly feel them within your form. If at first they do not come, persist in visualization until they seem to dwell within—this is sufficient to evoke resonance. With time, one naturally enters the wondrous.\n\nOn the seventh, ninth, and thirteenth days of the lunar month, at the hour of *yu zhong* or midnight, enter your chamber, sit upright, clasp your hands, regulate your breath, and close your eyes. Then visualize the Nine Stars of the Northern Dipper descending into your heart, with the handle of the Dipper pointing upward toward your throat and the *kui* (the Dipper’s bowl) facing outward. After a long while, you will suddenly see within the *kui* a great spirit, clad and named as described in the invocation. Eventually, you will feel warmth in your heart as true qi enters.\n\nThen swallow saliva fifty times and click your teeth nine times. Raise your right hand’s second finger to press your heart, and softly recite the incantation:\n\n*\"Supreme Purple Perfection, spirit of the Nine Qi,\nEncompassing the myriad measures, the radiant turning jade,\nFlying auroras stream with luminous brilliance,\nIlluminating the Jade Clarity,\nDark canopy of all dawns,\nYin and Yang divide and unite,\nThe Four Harmonies descend in exchange,\nThe Seven Wefts align in sequence,\nOn this auspicious lunar day,\nCome to shine within my heart’s court,\nFlying light and boundless radiance,\nFilling the Central Palace,\nThe Six Palaces open their gates,\nFlowing essence levels all,\nHun and po refined and tempered,\nAttaining the essence of the true,\nResonant transformation at touch,\nMyriad transformations instantly complete,\nSuddenly the great spirit appears,\nSeated steadfast in my heart’s chamber,\nRegulating breath and gathering fluids,\nA hundred joints flow unobstructed,\nGrasping the Dipper and seizing the *kui*,\nGazing afar in all directions,\nNamed *Xuan Du*,\nStyled *Su Kang*,\nCrimson-feathered mantle,\nDragon belt and tiger robe,\nBody born of jeweled radiance,\nNeck bearing a halo of light,\nHeadscarf of flying dawn,\nCrown of heroes rising and falling,\nGrant me flight as an immortal,\nSoaring through the great void,\nAscending to the Purple Palace,\nPaying court to the Jade Emperor in the north,\nCommanding the myriad spirits,\nAll numinous beings in attendance,\nBlossoms blooming above my heart,\nAuspicious clouds eternal,\nPhoenixes cry with tinkling clarity,\nLuan-birds sing with resonant chime.\"*\n\nWhen the incantation is finished, swallow saliva thirty times and click your teeth nine times. Recite the incantation again as before, then rise, face south, and bow twice. The practice is complete; open your eyes.\n\nOn the fifteenth, nineteenth, and twenty-third days of the lunar month, at the hour of *yu zhong* or midnight, enter your chamber, sit upright, clasp your hands, regulate your breath, and close your eyes. Then visualize the Nine Stars of the Northern Dipper descending into the Lower Palace, three inches below the navel, with the Dipper’s handle pointing upward toward the heart and the *kui* facing outward. After a long while, you will suddenly see within the *kui* a great spirit, clad and named as described in the invocation. You will also feel warmth in your navel as true qi arrives.\n\nThen swallow saliva sixty times and click your teeth nine times. Raise your left hand’s third finger to press the *ren zhong* point below your nose, and softly recite the incantation:\n\n*\"Supreme Purple Emperor,\nRadiant and resplendent at the central pivot,\nNine Wefts gleaming in luster,\nLight surpassing the great aurora,\nMyriad spirits look up in reverence,\nA thousand dawns plant their roots,\nSeven Degrees employed in brightness,\nNine Mists blooming in fragrance,\nGoverning Yang to manifest obedience,\nGrasping Yin to achieve harmony,\nTrue radiance opens the array,\nDark roots encompass all,\nOn this auspicious lunar day,\nCome to shine within my navel,\nPurple qi rising to the heavens,\nFlying light descending in streams,\nRefining my hun and po,\nFlourishing essence and vital fluids,\nSuddenly the great spirit appears,\nNoble and divine in the Upper Palace,\nNamed *Zhu Meng*,\nStyled *Liu Yu*,\nSeated upright within the navel,\nRiding the Nine Qi of the Dipper,\nExhaling and inhaling numinous fluids,\nBalancing blood and regulating the stomach,\nYellow phoenix-feathered mantle,\nDragon robe and tiger belt,\nHands unlocking the sun’s root,\nHead crowned with green hibiscus,\nWaist ablaze with flowing fire,\nLightning’s brilliance illuminating the boundless,\nGrant me flight as an immortal,\nTreading the void and soaring aloft,\nAscending to the Jade Chamber,\nBearing the canopy of the celestial void,\nCommanding the myriad spirits,\nHeaven and Earth in shared repose.\"*",
      "overlap_context": "urt to the Jade Emperor in the north, the Jasper-Limned Upper Palace,\nAnd in the west, prostrate before the Great Simplicity, bowing to the Three Primes.”\n\nWhen the prayer is finished, swallow saliva thirty times and click the teeth nine times. Recite the prayer again as before, then rise, face north, and bow twice; face west, and bow twice. No longer close the eyes; the practice is complete. This may also be performed on the bed in a quiet chamber, without descending to the ground for the bows.",
      "start_char": 13338,
      "end_char": 14581,
      "start_sentence": 419,
      "end_sentence": 450,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.542242765426636,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\上清五常变通万化郁冥经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "祝毕，又咽液三十过，叩齿九通，又祝如前，祝毕，起向本命再拜，拜毕开目。 行下元之道毕矣。 举手有所捻，是临祝之时耳，祝毕接手如初。 以八节日夜半时，入室正坐，接手定气，闭目内视，乃存一身冉冉起，上飞升北斗魁中。 良久为之，如觉我形已在斗中也。 极念为之，当觉体中热，是真气合德也。 又存九精三神名字服色，貌如婴儿之始生也。 三神与我对坐也，我心拜之焉，精想仿髴，遗形眇眇，将令恍惚也。 乃咽津八十过，叩齿九通，举左手拊心，乃微祝曰： 太上丹灵，玄光飙焕，九璋启璇，晖气澄散，紫晨幽烛，七曜蔚灿，二景奏明，阴阳以判，四度用昌，灵津回灌，八节启气，上升九元，据斗攀纲，奉见三神，问我稽留，何不升仙，我即稽首，畏以帝前，尔乃赫壮，口衔日根，左破六天，右督酆山，流铃上焕，万魔碎分，遂知我魄，强我三魂，藏斗内曜，九精在心，紫霞洞映，飞光万寻，和魂制魄，六胎调炼，精感变跃，玉妃忽见，坐当我心，俯视仰盻，其名密华，厥字璘蒨，吐纳二气，和平百关，身服炼帔，凤光鸾裙，腰带虎录，龙章玉文，手执月华，头巾紫冠，腾跃太霄，驾景盖云，书名太素，我得飞仙，超浮空洞，乘琼太元，上造朱房，役使万神，纪均二度，还反婴颜，北帝激电，南帝火阵，苍帝启烛，赫赫电震，西流双扑，呜音唱钧，四举超跃，荐我玉真，遂乘八景，遨宴九烟。 祝毕，又咽液三十过，叩齿九通，复祝如前，祝毕，起向西北再拜毕，开目。 行八节之真毕矣。",
      "translated_text": "Upon concluding the invocation, swallow the saliva thirty times and click the teeth nine times. Repeat the invocation as before, and when finished, rise to face one’s life-star and bow twice. After bowing, open the eyes.\n\nThe practice of the Lower Prime’s Dao is now complete.\n\nIf the hands are raised with fingers interlaced, this occurs during the invocation; once the invocation ends, return the hands to their original position.\n\nOn the eight seasonal nodes at midnight, enter the chamber and sit upright. Interlace the hands, settle the qi, close the eyes, and inwardly visualize the entire body rising gently, ascending to fly into the Dipper’s *Kui* asterism. Persist in this visualization until sensing one’s form already within the Dipper. Focus intently, and when warmth is felt throughout the body, this is the true qi uniting with virtue.\n\nNext, visualize the names, appearances, and colors of the Nine Essences and Three Spirits, their forms like newborn infants. The Three Spirits sit facing me, and I bow to them in my heart. Concentrate the vision until the body seems to dissolve into faintness, inducing a state of profound absorption.\n\nThen swallow the saliva eighty times and click the teeth nine times. Raise the left hand to rest upon the heart and softly invoke:\n\n*\"Supreme Cinnabar Numinous,\nMysterious radiance blazing like a whirlwind,\nNine jades unlock the celestial pivot,\nLuminous qi diffuses in clarity,\nPurple dawn illumines the hidden,\nSeven luminaries gleam resplendent,\nDual effulgences proclaim brightness,\nYin and Yang divide in harmony,\nFour measures flourish in use,\nNuminous fluids return in reflux,\nEight nodes awaken qi,\nAscending to the Nine Origins,\nGrasping the Dipper’s handle,\nI present myself to the Three Spirits.\nThey ask why I linger,\nWhy I have not yet ascended as an immortal.\nI bow my head in awe before the Emperor,\nThen grow majestic in might,\nMouth holding the sun’s root,\nLeft shattering the Six Heavens,\nRight overseeing Mount Feng,\nFlowing bells blaze above,\nTen thousand demons shatter and scatter.\nThus they know my po,\nStrengthen my three hun,\nConceal the Dipper’s inner radiance within,\nNine Essences abide in the heart,\nPurple auroras glow in mutual reflection,\nFlying light spans ten thousand fathoms.\nHarmonizing the hun and restraining the po,\nSix wombs refine in balance,\nEssence responds in transformation,\nThe Jade Consort suddenly appears,\nSeated within my heart,\nGazing down and up in mutual regard.\nHer name is *Mihua*,\nStyled *Linqian*,\nExhaling and inhaling the dual qi,\nPacifying the hundred meridians.\nHer body wears a mantle of refined light,\nPhoenix radiance and simurgh skirts,\nTiger-scribed belt at the waist,\nDragon patterns in jade script,\nHands holding moon’s essence,\nHead crowned with purple coronet.\nLeaping into the Great Empyrean,\nRiding the canopy of light,\nInscribed in the *Tai Su*,\nI attain flight as an immortal,\nTranscending the empty vastness,\nMounting the Jade Prime,\nAscending to the Crimson Chamber,\nCommanding the myriad spirits,\nBalancing the Two Measures,\nReturning to infant visage.\nThe Northern Emperor’s lightning,\nThe Southern Emperor’s fire array,\nThe Azure Emperor’s kindled torch,\nDazzling thunder and lightning,\nWestern currents double-striking,\nResonant tones chanting in harmony,\nFourfold leaps propel me upward,\nRecommending me to the Jade Perfected.\nThereupon I ride the Eight Effulgences,\nRoaming and feasting amidst the Nine Mists.\"*\n\nUpon concluding the invocation, swallow the saliva thirty times and click the teeth nine times. Repeat the invocation as before, then rise to face the northwest and bow twice. After bowing, open the eyes.\n\nThe practice of the Eight Nodes’ Perfection is now complete.",
      "overlap_context": "haling and inhaling numinous fluids,\nBalancing blood and regulating the stomach,\nYellow phoenix-feathered mantle,\nDragon robe and tiger belt,\nHands unlocking the sun’s root,\nHead crowned with green hibiscus,\nWaist ablaze with flowing fire,\nLightning’s brilliance illuminating the boundless,\nGrant me flight as an immortal,\nTreading the void and soaring aloft,\nAscending to the Jade Chamber,\nBearing the canopy of the celestial void,\nCommanding the myriad spirits,\nHeaven and Earth in shared repose.\"*",
      "start_char": 14582,
      "end_char": 15173,
      "start_sentence": 451,
      "end_sentence": 462,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.68588137626648,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\上清五常变通万化郁冥经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "此道是超空之秘妙，九真之奇法。 三段行真，月用九日，故谓之九真升玄文。 乃太真禁书内宝，为真之要诀也。 若得其人，当传之时，受者当清斋百日，或三十日，或十日，任意造其所适也。 又当先告斋一日，以洗素心。 授者对斋，如受者也。 付与之日，皆当先敌血垒坛，剪发立盟，为不宣不泄之信誓也。 后圣以敌血犯生气之伤，剪发违肤毁之礼，谨以黄金三两，代敌血之信，青纹之缯三十二尺，当代割发之约。 师受誓物，不得收为私利，藉以滥用，皆当施山柄高隐，单贫道士。 若超腾步虚，或投之於山室，散之於灵岩。 所以尔者，明天信贵重誓深测，道精贱宝欲也。 不奉科约，生死七祖父母，受玄都风刀之考，身为下鬼。 传授年限，出授节度，如上法，当谨按之，盟物皆精上也。 启心秀整，坦诚婵允，靡有不尽。 授者则师宗也，受者则资也。 闻道则仰范标模，求生则存近生地，不遵所奉，阙略违慢者，三世祖获刑於火官，身生弃疾。 轩辕师荆山丈人，丈人但解炼石之道，无他妙，岂贤於轩辕哉。 轩辕曾问其炼石之道，故遂师焉。 荆山丈人，是姬幽子也，今在委羽山，能炼石成水，煎水成玉，粉玉为散，以石水服之。 能知其道，与天同存，然不能飞行空虚，手把晨霞也。 炼石虽妙，固小术耳。 右太上飞行羽经九真升玄上记，其道毕矣。 其下巷是太上九真中经，虽有上下序，然别法异用，不相干也。 中央黄老君分以传太虚真人，与八道秘言相次。 九真中经在人间施行，亦有口诀，本文以秘不书。 今请言： 第一真法，当以五月五日、十五日、二十五日、二十七日、二十九日，一月之中五过行之，皆以平旦。 第二真法，当以八月八日、十一日、十四日、十九日、二十三日、二十七日，一月之中六过行之，皆以辰时。 第三真法，当以六月六日、七日、十七日、十八日、二十五日、二十六日，一月之中六过行之，当以巳时。 第四真法，当以正月二日、八日、十四日、十八日、十九日、二十八日，一月之中六过行之，皆以午时。 第五真法，当以三月三日、八日、十三日、二十日、二十六日，一月之中五过行之，皆以未时。 第六真法，当以七月七日、十一日、十四日、十八日、二十三日、二十五日、二十八日，一月之中七过行之，皆以申时。 第七真法，当以十一月二日、六日、九日、十三日、十六日、十九日、二十三日、二十七日，一月之中八过行之，皆以酉时。 第八真法，当以二月二日、七日、九日、十五日、十八日、十九日、二十七日，一月之中七过行之，皆以戌或亥时。 第九真法，当以十二月三日、九日、十七日、十九日、二十六日、二十九日，一月之中六过行之，皆以子时。 右行九真中经口诀毕矣。 此月此日，皆是合真迥顺，生气摄精之时，善可以存思，易致玄感。 若高栖绝顶，潜摽云岩，断人事於内外，割粒食以清肠，接手正心，念乎含晨，皆当日日施行，自如本经。 今之所书，盖人间多事，不得日日清闲以行之也。 行之十四年，亦足超浮虚无，能生能死，出水入火，上登上清，五藏生华，与天相倾。 其升玄羽经上卷也，行之三过，一月九日，盖亦人间未及大静之时。 若长斋久静，抱景独往，仰秀空洞，心单事外者，皆宜此日行之，以次相续。",
      "translated_text": "This Dao is the secret wonder of transcending emptiness, the marvelous method of the Nine Perfected. The practice is divided into three stages, with nine days of monthly cultivation—hence it is called the *Nine Perfected Ascending the Mysterious Writ*. It is a treasured text among the esoteric scriptures of the Supreme Perfected, the essential formula for attaining perfection.\n\nWhen transmitting this to a worthy recipient, the receiver must first undergo a purification fast for one hundred days, or thirty days, or ten days, according to their capacity. Additionally, they should observe a one-day fast beforehand to cleanse their sincere heart. The transmitter must also fast in the same manner as the receiver. On the day of transmission, both parties shall first draw blood to consecrate the altar, cut their hair, and swear an oath of secrecy. Later sages, however, deemed blood sacrifice harmful to the vitality of living beings and hair-cutting a violation of bodily integrity. Thus, they substituted three taels of yellow gold for the blood oath and thirty-two feet of green silk for the hair-cutting pledge.\n\nThe master and disciple must not treat these oath objects as private possessions or misuse them; instead, they should be offered to reclusive Daoists dwelling in lofty mountains or to solitary, impoverished practitioners. If one has ascended to walk the void, the objects may be cast into mountain chambers or scattered upon sacred peaks. This is done to demonstrate that heavenly trust is profound and the Dao’s essence is prized above material wealth.\n\nThose who violate these precepts will cause their seven generations of ancestors to suffer the trials of the Wind Blade in the Dark Capital, while their own souls shall become lowly ghosts. The transmission period, the method of bestowal, and all procedures must adhere strictly to the above regulations, with oath objects of the finest quality. The recipient’s heart must be pure and refined, their sincerity unwavering, and their devotion complete.\n\nThe transmitter is the master and guide, while the receiver is the disciple. Those who hear the Dao should look to the master as their model; those who seek life should dwell near the realm of life. Those who fail to uphold these teachings, who neglect or disrespect them, will cause their three generations of ancestors to be punished by the Fire Bureau, while they themselves shall be afflicted with lifelong ailments.\n\nThe Yellow Emperor once studied under the Master of Mount Jing, who knew only the method of refining stones—no other wonders—and was hardly superior to the Yellow Emperor. Yet because the Yellow Emperor inquired about the art of refining stones, he became his disciple. The Master of Mount Jing was a descendant of Lord You of Ji and now resides on Mount Weiyu. He can refine stones into water, boil water into jade, and grind jade into powder, which he consumes with stone water. Those who master this art may endure as long as heaven itself, yet they cannot soar through the empty void or grasp the morning mist in their hands. Though the art of refining stones is marvelous, it remains but a minor technique.\n\nHere ends the *Supreme Perfected’s Scripture of Soaring on Wings: The Upper Record of the Nine Perfected Ascending the Mysterious*. The following section is the *Central Scripture of the Nine Perfected of the Supreme Perfected*. Though it contains an upper and lower sequence, its methods and applications differ and do not intersect.\n\nThe Central Yellow Lord of the Dao transmitted this to the Perfected of the Great Void, alongside the *Eight Esoteric Sayings*. The *Central Scripture of the Nine Perfected* is practiced among humans and includes oral instructions, though the main text is too sacred to be written. Now, the prescribed methods are as follows:\n\n**First Perfected Method**: To be practiced on the 5th, 15th, 25th, 27th, and 29th days of the fifth month—five times in a month, all at dawn.\n\n**Second Perfected Method**: To be practiced on the 8th, 11th, 14th, 19th, 23rd, and 27th days of the eighth month—six times in a month, all at the hour of *chen* (7–9 AM).\n\n**Third Perfected Method**: To be practiced on the 6th, 7th, 17th, 18th, 25th, and 26th days of the sixth month—six times in a month, all at the hour of *si* (9–11 AM).\n\n**Fourth Perfected Method**: To be practiced on the 2nd, 8th, 14th, 18th, 19th, and 28th days of the first month—six times in a month, all at noon.\n\n**Fifth Perfected Method**: To be practiced on the 3rd, 8th, 13th, 20th, and 26th days of the third month—five times in a month, all at the hour of *wei* (1–3 PM).\n\n**Sixth Perfected Method**: To be practiced on the 7th, 11th, 14th, 18th, 23rd, 25th, and 28th days of the seventh month—seven times in a month, all at the hour of *shen* (3–5 PM).\n\n**Seventh Perfected Method**: To be practiced on the 2nd, 6th, 9th, 13th, 16th, 19th, 23rd, and 27th days of the eleventh month—eight times in a month, all at the hour of *you* (5–7 PM).\n\n**Eighth Perfected Method**: To be practiced on the 2nd, 7th, 9th, 15th, 18th, 19th, and 27th days of the second month—seven times in a month, all at the hour of *xu* or *hai* (7–11 PM).\n\n**Ninth Perfected Method**: To be practiced on the 3rd, 9th, 17th, 19th, 26th, and 29th days of the twelfth month—six times in a month, all at midnight.\n\nHere end the oral instructions of the *Central Scripture of the Nine Perfected*. These days and hours are when the qi of life converges and the essence of the Perfected aligns, making it most auspicious for visualization and readily invoking the mysterious response. If one dwells in seclusion atop lofty peaks, hidden among cloud-wreathed cliffs, severs all worldly ties, purifies the intestines by abstaining from grains, joins hands to rectify the heart, and meditates upon the morning’s essence, they should practice daily as prescribed in the original scripture.\n\nHowever, as most people in the world are occupied with affairs and cannot cultivate in daily tranquility, the above schedule is provided. Practicing for fourteen years is sufficient to transcend the empty void, master life and death, pass through water and fire, ascend to the Supreme Clarity, cause the five viscera to blossom, and commune with heaven.\n\nThe *Upper Scroll of the Scripture of Ascending the Mysterious on Wings* requires three repetitions in a month, totaling nine days—this is due to the world’s lack of perfect stillness. If one maintains long fasts, embraces solitude, gazes upon the empty vastness, and focuses the heart beyond worldly matters, they should practice on these days in sequence.",
      "overlap_context": "ing,\nWestern currents double-striking,\nResonant tones chanting in harmony,\nFourfold leaps propel me upward,\nRecommending me to the Jade Perfected.\nThereupon I ride the Eight Effulgences,\nRoaming and feasting amidst the Nine Mists.\"*\n\nUpon concluding the invocation, swallow the saliva thirty times and click the teeth nine times. Repeat the invocation as before, then rise to face the northwest and bow twice. After bowing, open the eyes.\n\nThe practice of the Eight Nodes’ Perfection is now complete.",
      "start_char": 15174,
      "end_char": 16442,
      "start_sentence": 463,
      "end_sentence": 504,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.277939558029175,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\上清五常变通万化郁冥经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "一月九行，施於人中耳。 八节思斗中，又存思忽见斗中玉妃在我前坐，玉妃吐紫姻入我口中，良久，其衣服如八节所祝。 此女子是九精之阴灵，玉清之上妃也。 此青童君口诀。 上清五常变通万化郁冥经竟 #1『乃』字原本作『及』。",
      "translated_text": "A monthly practice of nine repetitions is merely for those still dwelling among worldly concerns. At the eight solar nodes, one should meditate upon the Dipper’s midst, and suddenly perceive the Jade Consort seated before them. The Jade Consort exhales purple mist into one’s mouth, and after a long while, her robes appear as invoked at the eight nodes. This woman is the yin spirit of the Nine Essences, the Supreme Clarity’s foremost consort.\n\nThis is the oral transmission of the Azure Lad.\n\nHere ends the *Scripture of the Five Constants of the Supreme Clarity: Transformations and Myriad Changes in the Murky Depths*. #1 The character *nai* 乃 was originally written as *ji* 及.",
      "overlap_context": "aster life and death, pass through water and fire, ascend to the Supreme Clarity, cause the five viscera to blossom, and commune with heaven.\n\nThe *Upper Scroll of the Scripture of Ascending the Mysterious on Wings* requires three repetitions in a month, totaling nine days—this is due to the world’s lack of perfect stillness. If one maintains long fasts, embraces solitude, gazes upon the empty vastness, and focuses the heart beyond worldly matters, they should practice on these days in sequence.",
      "start_char": 16442,
      "end_char": 16553,
      "start_sentence": 505,
      "end_sentence": 510,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.9886841773986816,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\上清五常变通万化郁冥经.txt",
        "category": "本文类"
      }
    }
  ]
}