{
  "source_id": "上清太上玉清隐书灭魔神慧高玄真经",
  "source_file": "chunked_daozang\\上清太上玉清隐书灭魔神慧高玄真经.json",
  "total_chunks": 13,
  "total_original_chars": 15042,
  "total_translated_chars": 102346,
  "total_translation_time": 561.0128891468048,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\上清太上玉清隐书灭魔神慧高玄真经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Cavern-Perfect Jade-Pure Hidden Writings of the Highest Dao**\n\n**Scripture Title:** *The Supreme Cavern-Perfect Jade-Pure Hidden Writings of the Highest Dao* (abbreviated as *The Jade-Pure Hidden Writings*). Author unknown, approximately composed during the Eastern Jin dynasty. A foundational scripture of the early Shangqing tradition. Originally comprising four scrolls and eight chapters, later divided into four texts:\n\n1. *The Supreme Cavern-Perfect Jade-Pure Hidden Writings: Scripture of the Divine Wisdom of the High Mystery for Subduing Demons* (three chapters);\n2. *The Supreme Highest Jade-Pure Hidden Writings of the Jade Emperor’s Divine Wisdom for Subduing Demons* (three chapters);\n3. *The Supreme Highest Jade-Pure Hidden Writings of the Golden Prime and Cavern-Luminance for Subduing Demons* (one chapter);\n4. *The Supreme Highest Jade-Pure Hidden Writings of the Golden Prime and Feathered Chapters* (one chapter).\n\n**Source Text:** *Daoist Canon of the Orthodox Tradition*, Zhengyi Section, Part One.\n\n---\n\n### *The Supreme Cavern-Perfect Jade-Pure Hidden Writings: Scripture of the Divine Wisdom of the High Mystery for Subduing Demons*\n\nThis divine scripture emerges from the oral formulas of the Supreme Great Cavern, concealing the celestial and terrestrial sounds of the myriad essences. It was transmitted to the Jade-Pure King of Divine Radiance, the Subduer of Demon Kings, to command demons and summon perfected beings, thereby rectifying and restraining the myriad spirits.\n\nThe Most High, accompanied by two hundred and seventy jade maidens of the Upper Palace and two hundred and seventy jade lads of the Golden Immortals, attends to incense and dust-whisks, guarding the divine texts in secret within the Three Primes’ Purple Chamber of the Most High, in the Palace of the Six Harmonies.\n\nThe Jade-Pure Lord of the Imperial Sovereign roams above the Cavern-Perfect, feasting on the Dragon Mountain of Radiant Scenery. At times, he invites the exalted guests of the Jade-Pure, the Great Divine Subduer of Demons, the Jade-Pure King of Divine Radiance, to recline in the chambers of jasper and jade, the golden-flowered abode. After a three-year purification fast, he unfolds and recites the *Supreme High Mystery’s Perfect Text of the Lofty Mystery*. Its divine marvels arise spontaneously; its wondrous purport illumines the ten directions. Its lofty cadences resound clearly; its jade brushstrokes gleam like crystal. The numinous splendor adorns the flowery court, blazing across the Great Void. The Eight Emperors align their visions; the Five Ancients flank the perfected. The Primordial Beginning shines forth; the Celestial Prime unfolds in full. Tamed beasts crouch in submission; fierce steeds bolt in terror. The Great Marshal brandishes his banners; a hundred million cavalry array in ranks. Demons are restrained, and evil spirits seized; proclamations disperse the myriad spirits. Mountains and seas grow still; the Three Luminaries merge in brilliance.\n\nThereupon, the Imperial Lord himself plucks the *Cloud-Zither of the Dragon Mountain of Radiant Scenery*. A hundred harmonies join in chorus; jade tones resonate through the Great Void. The desolate and pure flow forth; jade sounds stir the *qi*. The Eight Winds converge with the perfected at the Central Heaven; the Five Florals array the immortals at the Four Extremities. Divine whistles arise from the gates of jade and jasper; wondrous melodies issue from the mechanism of the Great Cavern.\n\nThen he commands the Jade Maidens of the Dragon-Flower Terrace of the Northern Frigid Golden Platform—Yu Xiaoming, Ding Yunfu, An Yanchang, Fei Siqu, and others—to join in singing the *Poems of the Supreme Cavern Spirits* and the *Melodies for Subduing Demons and Summoning the Perfected*. Their lyrics declare:\n\n> By paired radiance, we urge our flying canopies,\n> Swift reins float through the Eight Pures.\n> We adjust our reins to open the cinnabar thoroughfare,\n> Casting glances to feast in the cloud encampments.\n> Harmonizing with the divine, we drift on the waves of the ford,\n> Lifting our steps to tread the frigid court.\n> Dragon pennants leap with jade substance,\n> Feathered robes trail in kingfisher and purple hues.\n> Soaring beyond the Six Ridge Terraces,\n> In profusion we descend upon the Phoenix City.\n> Escorting the Divine Radiance King,\n> We ascend to the grand assembly in the Supreme Capital.\n> Gazing up, we part the Three Simplicities’ chambers,\n> Long mists scatter across the Eight Seas.\n> The Perfect Dao hastens to the Orchid Palace,\n> Ethereal, it arises from the Void above.\n> Towering peaks connect to wondrous visions,\n> The Great Splendor illumines the Jade-Pure.\n> Accumulated diligence moves the Primordial Simplicity—\n> Who can fathom its form or name?\n> Awaiting the kalpa’s unended dawn,\n> In an instant, the myriad ages commence.\n> The dark workings have their own convergence—\n> How could one know the heavens and earth would overturn?\n> Riding the destiny of self-arising,\n> We urge our radiance to traverse the Northern Prime.\n> Flowing auroras follow our return,\n> Flying canopies shade the verdant axles.\n> Ascending the Fourfold Brightness Gates,\n> Flowering jasper adorns the Golden Portal.\n> Divine radiance penetrates the Orchid Peaks,\n> The Three Luminaries shine forth, already distinct.\n> Congealing clarity to generate *qi*,\n> The Eight Assemblies lay bare the hidden sources.\n> Vast and boundless, the Primordial Han begins,\n> The Great Yang harmonizes with the morning court.\n> The numinous transforms the Four Canopy Courts,\n> The wondrous flows unimpeded, the Dharma complete.\n> The Dao of natural principle unfolds,\n> Luxuriant as the Supreme Highest Texts.\n> A thousand demons cannot be bargained into life—\n> They are restrained, the demonic hordes of heaven.\n> The Primordial Assembly roams the Great Cavern wilds,\n> Gathering essences to pluck the sun’s soul.\n> Containing the essence, refining in the cinnabar chamber,\n> Eternally preserved without end.\n> Turning the chariot to rest in the cinnabar chamber,\n> Silently contemplating the High Mystery.\n> Leisurely and still, free from worldly dust,\n> Gazing upon the guests of the auroral realm.\n> Concentrating the spirit to mark the Nine Ridges,\n> Linking watches to continue the long mists.\n> Three candles illumine the Great Splendor,\n> The Void’s extremity gives birth to the perfected.\n> Radiant scenery gleams over the Jade Continent,\n> Harmonizing the spirit to order the flowery years.\n> The hidden encounter responds to the dark convergence,\n> Faint and distant, it follows the shifting radiance.\n> Myriad inspirations arise of themselves—\n> Good counsel, too, has its ford.\n> The Jade Emperor governs his numinous heart,\n> Whispering through the Ninefold Heavens.\n> Alone, I tread the dark ridge peaks,\n> My thoughts dwelling in the spaceless.\n> Without the High Immortal’s cadence,\n> How could I tread there, and why seek the green?\n> The Dao’s treasury holds the Golden Ultimate Chapters,\n> Treasuring my Jade-Pure Stanzas.\n> The Great Void penetrates the Mysterious-Perfect,\n> Within purity, the Mysterious Subtle arises.\n> Azure clouds encircle the cinnabar chamber,\n> The distant realm gleams with purple radiance.\n> Raising my feet over the myriad ford-waves,\n> With mysterious steps, I ascend the jade portals.\n> The Eight Winds drum the lofty peaks,\n> How mournful the ten thousand clouds!\n> Dragons and phoenixes cry in the Nine Auroras,\n> What sorrow in the birds’ songs!\n> The numinous realm has no bounds,\n> On all sides, emptiness hangs.\n> Vast and boundless, the Milky Way’s path,\n> Drifting, drifting, to the Shangqing precincts.\n> The dark abode responds to the convergence of resonance—\n> The Perfected One’s heart holds the Mysterious Stillness.\n> Counting the kalpas as they unfold,\n> Principle’s extremity returns the spirit of itself.\n> Reciting aloud the Supreme Highest Texts,\n> Secretly seeking to reverse the withered blossoms.\n> Turning the poems to summon the perfected,\n> Divine wisdom transforms Heaven’s might.\n> Issuing commands in accord with the Mysterious Talismans,\n> Grasping the tally to march upon the Supreme Subtle.\n> Wondrous awakening knows no obstruction,\n> The vast numinous barrier opens.\n> Merging radiance to return to the tranquil axle,\n> Soaring high beyond the ridge’s flight.\n> Mysteriously dwelling in the layered Void’s halls,\n> In stillness, I contemplate the return of the lofty spirit.\n\nUpon the song’s conclusion, the Lord Emperor thereupon commanded the Five Venerable Perfected Ones to request the *Supreme Highest Great Cavern Demon-Quelling Divine Wisdom Lofty Mystery True Scripture* and the *Jade Clarity Concealed Writ*, encasing it in a cloud-brocade pouch and sealing it with the *Heaven-Opening Seal*. He entrusted it to the Left Duke of the Immortal Capital for transcription within the Jeweled Palace, assigning thirty-seven Jade Flower Maidens and thirty-seven Golden Dawn Jade Lads to hold the towels and tend the incense, guarding the divine text.\n\nIn accordance with the *Bright Statutes of the Four Poles*, it is transmitted once every seven hundred years, reserved solely for those whose names are inscribed in the *Mystery-Free Imperial Register* from former lives—those of golden bones and jade marrow, whose destiny aligns with transcendence—never to be heard by the uninitiated. Its Way is lofty and wondrous, hence called the *Concealed Writ*, treasured and kept secret by the Most High, never passed to the lower worlds. To recklessly divulge its sacred text is to incur the wind-blade’s judgment, bringing calamity for ten thousand generations.\n\nThe *Supreme Divine Scripture* bears the secret taboo names of the exalted perfected above and records the sounds of heaven, earth, and the myriad spirits below, employed to summon immortals and quell demons, to unseal the gates of the hidden. All derive from the oral instructions of the Supreme Highest, applied to the *Great Cavern True Scripture*. The Supreme Lord wields the brush to inscribe it; the Great One sweeps the mat; the Jade Youths compile the passages; the Heavenly Consorts weave the chapters; the Five Emperors collate and proofread, thus completing the numinous text.\n\nThe Five Venerable Ones oversee the trial; the Left Immortals assist the perfected; the Great Flower tends the incense; the Golden Dawn stirs the smoke. Divine marvels arise in abundance; jade wisdom illumines the profound. Its numinous transformation wields power throughout heaven and earth; its literary splendor shines upon the Highest Clarity. When uttered, its voice resonates with the Supreme Subtle; its lofty chant echoes afar. To recite it once is to startle the Nine Heavens into listening, to move the Jade Emperor to reverent response, to summon the myriad perfected to attend the court, to extinguish the host of malevolent forces, and to topple the demon kings of heaven. Practicing this Way, one’s *qi* ascends to the pure empyrean, spreading blessings across the nine ford-crossings, redeeming the seven ancestors, and rebirthing them in the heavens above.\n\nSuch is the wondrous and precious nature of this divine scripture—its excellence is beyond all reckoning. Whenever one cultivates the *Great Cavern True Scripture of Returning Wind and Blending Harmony* in its thirty-nine chapters, one must first recite the *Supreme Highest Demon-Quelling Divine Wisdom* once, to dispel trials and summon the perfected, to unseal the three barriers, to gracefully restore the bodily form, to cause orchid-*qi* to suffuse the ford-crossings, to settle the myriad spirits in their proper places, to harmonize the jade voice, and to attune the *qi* until its resonance is pure. Only then may one recite the wondrous verses, their golden tones ringing clear in the Supreme Highest, their sublime purport gleaming radiantly across the ten directions. Thus do the August Elders remotely oversee the cinnabar trials; the Three Primes inscribe the records in the Purple Chamber; the seven ancestors are rescued from the dark paths; rebirth is granted in the Southern Immortal Realm. Life and death partake of its blessings; glory and beauty flow to one’s kindred. Its Way is profoundly secret—it must not be recklessly proclaimed. To carelessly reveal its divine sounds is to drown in the river’s source, to incur the seven ancestors’ reproach, to bind one’s sins in the dark mountains. The *Nine Heavens’ Forbidden Writ* is not to be transmitted to the unworthy.\n\n---\n\n**The Jade Clarity Concealed Writ of the Great Cavern Demon-Quelling Divine Wisdom**\n\nThe dark radiance scatters at heaven’s edge,\nThe clear Han thins as clouds drift back.\nWondrous *qi* illumines the Three Dawns,\nCinnabar clouds blaze upon the Purple Tenuity.\nThe pure heavens unfurl their numinous splendor,\nThe flowing empyrean—how misty and vast!\nThe divine lamp shines through the long night,\nThe Net of Separation exhales its bright glow.\nFour peaks gird the towering clouds,\nSuspended essence shades the eight directions.\nThe Three Primes open the lofty void,\nOrchid pavilions part their layered gates.\nGolden ramparts mirror Jade Clarity,\nNuminous beauty marks the celestial precincts.\nWinds arise in the Eight Convergence Palaces,\nFierce beasts gallop through the clouds.\nIn the bustling Three Cavern Courts,\nThe perfected mingle in profusion.\nAbove dwell the Dry Radiance Essences,\nTheir hidden virtue towering and majestic.\nThe Great One gathers the affairs of care,\nGrasping destiny, wielding the divine banner.\nThe Orthodox Unity treads the flourishing numen,\nSummoning and gathering the myriad spirits.\nThe Noble Scion flanks the tranquil axle,\nThe Cavern Yang guards the mystery’s pivot.\nAt the bright dawn, the Way harmonizes with peace,\nThe dragon chariot lingers in measured circuit.\nThe Seven Radiance align with the Spirit Kings,\nThe whirlwind wheels traverse the ten-thousand-treed stair.\nEmbodied grace ascends the dark ford,\nSoaring steps transcend the ridge’s ladder.\nDonning brocade, one enters the divine mounds,\nResplendent, the feathered robes shimmer.\nMysteriously communing in clouded assembly,\nFlying radiance bears the divine penetration.\nThe pure peaks bear no trace of brush,\nWondrous confluence arises in the boundless void.\nGolden flowers gird the numinous chariot,\nThe soaring immortals, wing upon wing.\nTen thousand reins disperse into the empty,\nLush and misty, the dark upper casement.\nWithin arises the Blended Radiance Lord,\nThe Nine Emperors exalt the Supreme August.\nThe bright wheel reflects the Yellow Tranquility,\nThe feathered pearls gleam in the Dark Yang.\nThe celestial essence of primordial *qi*,\nThe Central Five are called the Nurturing Light.\nLuminous coalescence gives birth to the spirit,\nThe Nine Perfected unite as one.\nWondrous radiance reveals the hidden reckoning,\nFollowing resonance, it marks the divine traces.\nThe Muddy Pellet cavern glows with primordial light,\nThe moving pearl aligns with the Crimson Palace.\nThe Primordial Yang governs the Gate of Destiny,\nThe Three Spirits escort the Purple Youths.\nRestraining and summoning, they return above,\nFlanking the gates to attend the bright casement.\nLush and dense, they face the Morning Star,\nThe round flower blazes through the Three Thoroughfares.\nThe square fullness draws forth and receives life,\nReversing age to return to infant simplicity.\nThe whirlwind’s brilliance adorns the Nine Heavens,\nThe heavenly green encircles the cinnabar chamber.\nHowling winds coil beyond the mists,\nCurving descent to repose in the flowery hall.\nRoaming and feasting, gazing upon ten thousand transformations,\nReturning to assemble before the Spirit Empyrean King.\nThe immortal Way delights in the child’s life,\nThe ghostly Way delights in the child’s doom.\nOne hears only of the Way that honors life,\nNever of the ghostly Way’s exaltation.\nChants and songs mingle with the celestial *qi*,\nThe merchant’s son lacks the proper verses.\nDivine wisdom commands the Vermilion Troops,\nThe Five Emperors’ talismans chill the northern wastes.\nBrandishing banners, they capture the myriad demons,\nThe jade writs restrain the Northern Feng.\nThe Way of spontaneous dissolution—\nNot your merit that the demons are destroyed.\nThe dawn’s drum resounds with the long fan,\nAll beings rejoice upon the empyrean peak.\nLooking down upon the four flights of thanksgiving,\nThe heavenly tribulation shall never end.\nWithin the wondrous arises the true radiance,\nThe returning chariot lingers in sorrowful delay.\nIntent harmonizes in hidden resonance,\nLifting and guiding the Supreme Highest’s grace.\nSoaring wings await the wondrous assembly,\nGazing into the cavern, the heart turns sorrowful.\nWith a whistle, a sigh, a sudden cry—\nIn an instant, one traverses the nine enclosures.\nGathering *qi*, returning to the primal exchange,\nMerging radiance to dwell in the dark mystery.\n\nAt this, the Seven Essences halt their shining,\nThe layered gates open wide,\nA hundred yangs surge like lightning,\nThe five stars hasten in their courses.\nGrasping the tally, commanding the spirits,\nAll *qi* is summoned and pursued.\nIron bears array in ambush,\nFierce tigers transform their might.\nThe Six Masters behead the demons,\nThe Bronze Heads seize the transgressors.\nThe Heavenly Apes devour poison,\nThe Crystal Shields shatter and crumble.\nThe myriad spirits are annihilated,\nThe Six Heavens collapse and topple.\nThe Three Ways are rectified—\nWhat *qi* does not return?\nMountains and rivers are overturned,\nSun and moon dim their light.\nDivine beasts drop their manes,\nThe Golden Wings cease their flight.\nThe Five Emperors gird their sashes in the divine precincts,\nThe myriad spirits receive judgment in the Supreme Subtle.\nThe Supreme Highest floats its canopy above the cinnabar cliffs,\nThe Eight Radiance urge their chariots at the empyrean gates.\nBeholding the wondrous transformations of the cavern’s source,\nI rejoice in my Way, my heart at ease.\n\nThe High and Mysterious Perfected of the Great Cavern says: When one wishes to ascend the high seat and recite the *Thirty-Nine Chapters of the Perfect Scripture of the Great Cavern*, one must first sit upright, face due north, and strike the teeth thirty-two times. Closing the eyes, one visualizes oneself clad in a nine-colored feathered robe adorned with dragon patterns, wearing the Jade Dawn crown, and holding a nine-colored tally. A green dragon attends on the left, a white tiger guards on the right; a floral canopy shades the head, and one sits upon a lion. Immortal youths attend with incense, jade maidens scatter blossoms; purple clouds billow thickly, filling the hall, while five-colored hues of dark and yellow array before and behind, both within and without, all made radiant and clear. Then one recites the *Hidden Writ of Divine Wisdom for Vanquishing Demons*.\n\nUpon completion, one closes the eyes and silently intones, bowing in the heart to the four directions. From the mouth, one draws the essence of the green *qi* of the Eastern Azure Yang, swallowing nine times to fill and suffuse the liver’s palace. Next, one draws the essence of the red *qi* of the Southern Cinnabar Spirit, swallowing three times to fill and suffuse the heart’s palace. Then, one draws the essence of the white *qi* of the Western Metal Soul, swallowing seven times to fill and suffuse the lungs’ palace. Next, one draws the essence of the black *qi* of the Northern Mysterious Radiance, swallowing five times to fill and suffuse the kidneys’ palace. Finally, one draws the essence of the yellow *qi* of the Central Lofty Sovereign, swallowing twelve times to fill and suffuse the spleen’s palace.\n\nWhen the *qi* of the five directions has been swallowed in full, one softly intones:\n*\"The five *qi* blend and arise,\nThe essence of the Mysterious Highest,\nFilling the five palaces,\nThe six conduits gleam bright.\nWithin they irrigate, without they overflow,\nBoth surface and interior are purified.\nBanishing filth, summoning the true,\nI soar to the Supreme Numinous,\nEver facing the Highest Dawn.\"*\n\nAfter reciting the *Perfect Scripture of the Great Cavern*, one shakes the left hand three times, ritually casting the Flowing Bell. Then one shakes the right hand seven times, ritually casting the Seven Origins of the Vast and Open. Next, one lifts the head, then sways the neck nine times, in accord with the celestial pattern. Then one stamps the foot once, in accord with the numinous tremor. One sways the body fourteen times to gladden the myriad spirits. Next, one wipes the eyes three times to brighten the Three Luminaries. Then one pinches the nose seven times to illumine the Bright Beam. Next, one presses the two gates behind the brows three times to block the source of evil. Then one wheels the body three times to open the Heavenly Window. Finally, one swallows saliva nine times to ingest the Jade Fluid.\n\nWhen the entire body’s rites are complete, the myriad spirits all rejoice. Harmonizing the voice and rectifying the *qi*, one then recites the Jade Chapters, softly intoning:\n*\"Bearing heaven, treading earth,\nEntering and exiting the cavern’s gate,\nLeft hand shaking the Flowing Bell,\nRight hand casting the Seven Origins.\nGirded with gold, adorned with jade,\nImmortal robes fluttering,\nThe Eight Radiance arrayed,\nUrging the chariot to ride the clouds.\nTen thousand circuits, all luminous and penetrating,\nI fly into the Emperor’s Dawn.\"*\n\nThereupon, one sits upright and recites the scripture.\n\nThis is the wondrous pattern of the Great Cavern, the proper form of reverent movement. If the ritual sequence is performed correctly, the Highest will cast its gaze upon one; the Three Origins will descend to the seat; the myriad spirits will come to pay homage; heavenly demons will submit; the Five Sufferings will all be dissolved; the seven ancestors will receive blessings; divine phoenixes will come soaring; cloud-dragons will leap and dance. The host of immortals will praise one in the High Void, and the Five Elders will inscribe one’s name in the Emperor’s Register.\n\nFor all who cultivate the Supreme Way and recite the numinous chapters yet fail to perform these rites, the celestial forms are deficient and incomplete. Such negligence is insufficient for prostration and submission, and one will be mocked by the Ghostly Gods of the Northern Emperor, punished by the Three Officials, tested and thwarted by the host of demons, and perish to no avail. Thus, to transgress the Dao is easy, while to cultivate it is difficult. Only by attaining its proper forms and patterns can one ascend the steps to flight and transcendence.\n\n**Hidden Writ of Divine Wisdom for Vanquishing Demons Within the Great Cavern**\n\nWhen reciting the scripture of the Highest Lord of the Jade Void, one must visualize the true *qi* of the Lesser Lad of the Grand Tenuity, the essence of the Dryness-Spirit, glowing red, entering from the mud-pill of one’s own crown and descending to fill the root of the tongue, the palace of blood and fluids. Then one softly intones:\n*\"True *qi* flows downward to fill the hidden pass,\nStabilizing the spirit, securing essence, sealing the source of death.\nThe Jade Scripture’s wisdom illumines, communicating with the myriad spirits,\nFor me it summons the true destiny to abide long,\nDelivering the seven ancestors to revert as womb-born immortals.\"*\n\nThereupon, one draws the red *qi* and swallows it three times to conclude. Then one recites the scripture. Upon completion, one intones again:\n*\"Heaven holds the great hidden treasure of life,\nCalled the *qi* above the Bright Beam.\nGuard my sealed gate below the absolute barrier,\nAnd receive anew the outer gate of the prison of birth.\"*\n\nThen one summons the Feathered Lad of Augmented Origin to array before the pavilion of the Green Chamber, causing him to untie the hundred knots of the seven ancestors, to drift with the wind and leave their roots, to match heaven in shifting their foundation, and to enter the mysterious through transformation.\n\nThe hidden writ of the Jade Clarity further intones:\n*\"Primal *qi* is not originally born,\nThe five paths bear the numinous forth.\nMale and female entrust the spirit to transformation,\nThe forest of stars, profound and dark, billows thickly.\nThe Jade Tone resounds with Supreme Harmony,\nTen thousand chants arise from the midst of nothingness.\nThe immortal court revolves through nine changes,\nThe hundred blends all attain the One.\nChange holds union within the void,\nTogether they enter the Emperor’s hall and chamber.\"*\n\nThis is the secret inner writ of the Highest. Should it be divulged, the seven ancestors will bear the blame.\n\nWhen reciting the scripture of the Jade Emperor of the Supreme Sovereign, one must visualize the true *qi* of the Venerable Duty of the Most Honored Unity, glowing purple, entering from the mud-pill of one’s own crown and descending to fill the Jade Pillow below, the rear gate of the mud-pill. Then one softly intones:\n*\"The Most Honored Unity preserves destiny,\nStabilizing the spirit and settling life.\nFor me it summons above the *qi* of the Emperor’s true,\nBelow it fills the courtyard of the Purple Gate.\nThe Jade Scripture, gazed upon, penetrates,\nThe Nine Origins shine bright.\nThe seven ancestors rejoice together,\nAll ascending to the Highest Clarity.\"*\n\nThereupon, one draws the purple *qi* and swallows it three times to conclude. Then one recites the Jade Scripture. Upon completion, one intones again:\n*\"My body is the ever-dying pass,\nThe womb’s knot harms the hundred spirits.\nWhen the hundred spirits untie the womb’s knot,\nThe roots within the placenta scatter.\nSeven generations enter the Emperor’s chamber,\nOne body unites with the divine immortals.\nDivine immortals gather in the Jade Hall,\nThe seven ancestors are born in the Southern Palace.\nTogether they wear the initial clarity of governance,\nSharing the seat of the child’s Way of health.\nThe myriad perfected guard the body’s form,\nOn this day they conceal the initial brightness.\nThe Emperor’s One revolves male and female,\nPreserving and guarding the gates of the hundred spirits.\nSealing the myriad evil portals,\nReceiving office in the Nine Palaces,\nOverseeing the summons of the Controller of Destiny,\nThrice daily attending the mud-pill.\"*\n\nWhen reciting the scripture of the Jade Emperor of the Supreme Sovereign, one must visualize the true *qi* of the Imperial Lord Fengling, glowing purple and lush, entering from the mud-pill of one’s own crown and descending to fill the space between the brows, the outer palace of the Purple Gate.\n\nUpon completion, softly intone the incantation:\n\"The Imperial Lord transmits the talismanic registers,\nUpright *qi* summons the myriad spirits.\nAbove, it calls forth the Jade Perfected *qi*,\nFilling and spreading between the brows.\nMerging as one to generate the Emperor’s radiance,\nThe Three Primes perfect my transcendence.\nSwift and radiant, I ride the soaring canopy,\nAscending directly to the loftiest pavilion.\"\n\nUpon completion, draw in the purple *qi* and swallow it thrice to conclude.\n\nThen recite the Jade Scripture. When finished, offer this prayer:\n\"Supporting the dawn’s first glow,\nPurple clouds illumine the dark slopes.\nResplendent, the circular light flourishes,\nDazzling and bright, it shines through the gauze.\nSubtle and distant, the numinous radiance’s origin,\nLush and scattered, the azure’s splendor.\nThe Nine Heavens’ halls host jade guests,\nGolden chambers resound with celestial hymns.\nVirtuous indeed, facing the Emperor’s guests,\nCommanding the dark chariots of the summoned lords.\nSeven ancestors untie the root of the womb,\nGeneration upon generation, they become immortals’ kin.\"\n\nThe Hidden Writ of Jade Clarity offers this further prayer:\n\"The Cinnabar Sovereign revolves the pearl,\nGuarding and stabilizing the Gate of Death.\nAbove, the One Crimson Child,\nThe Mysterious Emperor congeals in heaven.\nOne name: Lord of No Above,\nAlso the Primordial of the Three Origins.\nSupporting and nurturing me,\nEnabling my ascent upon the cloud-wheel,\nEver seated in the Upper Clarity’s pavilion,\nThe Seven Mysteries as Transcendent Lords.\"\n\nWhen reciting the Scripture of the Supreme Sovereign Purple Dawn Lord, visualize the true *qi* of the Left Non-Bearing Duke, Master Xuanchong, its jade light luminous and flowing, entering from the mud-pill of your crown and descending to fill the space beneath your left armpit, the posterior gate of the liver.\n\nUpon completion, softly intone:\n\"The Non-Bearing Divine Perfected engenders the Purple Sovereign,\nThe Three *Qi* merge and harmonize into palace tones.\nSummoning and guiding the true *qi* to stabilize the bladder,\nFlowing through the Three Cinnabar Fields to meet in the Grotto Chamber,\nTransforming my cinnabar countenance to attain transcendence,\nSoaring to the cloud pavilions and entering the Golden Wall.\"\n\nUpon completion, draw in the jade light and swallow it thrice to conclude.\n\nThen recite the Jade Scripture. When finished, offer this prayer:\n\"Spirits settled, *qi* pervading,\nAbove, in communion with heaven.\nTranscending the earthly gate,\nPassing through the celestial portal.\nConcealing breath in the four directions,\nThe Seven Stars disperse and divide.\nFlying through the Yin Chamber,\nSun and moon plant their roots.\nGuarding gold and treasuring jade,\nCommanding and restraining the myriad spirits.\nWho is the Transcendent King?\nI have already attained perfection.\nConcealing and preserving the feminine and masculine,\nPervading the four quarters in unity.\nBinding the central azure *qi*,\nNamed ‘Prolonging Prosperity,’\nStyled ‘Harmonious Infant.’\nGoverning destiny for eternal duration,\nThe Mysterious returns to the inner fortress,\nCelebrating the expansion of the Dark Enclosure.\nThis day I perfect my truth,\nSoaring as an immortal to the Cloud Capital.\"\n\nWhen reciting the Scripture of the Heavenly Emperor of Grand Tenuity, visualize the true *qi* of the Right White Prime, Lord Dongyang, its golden light radiant and gleaming, entering from the mud-pill of your crown and descending to fill the space beneath your right armpit, the posterior gate of the lungs.\n\nUpon completion, softly intone:\n\"Dongyang’s numinous treasure flourishes the spirit’s life,\nGolden light shines resplendent within the *qi*’s essence.\nSummoning the true to secure the spirit, ensuring longevity,\nExtracting the dark root to return to the womb’s infancy.\nHarnessing the dawn’s *qi*, I ascend to Jade Clarity.\"\n\nUpon completion, draw in the golden light and swallow it thrice to conclude.\n\nThen recite the Jade Scripture. When finished, softly intone:\n\"Dongyang’s numinous standard,\nGuarding the body’s Gate of Death.\nOpening to expel the Three Corpses’ worms,\nReceiving the Nine Perfected’s origin.\nUntying the womb, dispersing stagnant blood,\nA hundred joints engender upright spirits.\nSeven ancestors extinguish the corpse’s calamity,\nEradicating the afflictions of descendants.\nBlack *qi* refines and generates,\nSevering the womb’s root of death.\nFormer generations receive the Dao’s virtue,\nLater ones obtain the Emperor’s transcendence.\nWho are these Emperor Transcendents?\nLuminous, the seven generations’ descendants.\nTheir ancestors enter the Cinnabar Capital,\nTogether seated at the Gate of Essence’s summit.\"\n\nWhen reciting the Scripture of the Three Origins Purple Essence Lord, visualize the true *qi* of the Central Controller of Destiny, the Venerable Lord, its color like purple clouds, blazing and brilliant, entering from the mud-pill of your crown and descending to fill the Crimson Palace within the heart.\n\nUpon completion, softly intone:\n\"The Controller of Destiny determines the years,\nThe Venerable Lord safeguards transcendence.\nConveying names to the Southern Palace,\nPresenting them before the Imperial Lord.\nGeneration upon generation as Transcendent Kings,\nExtracting the seven generations’ root.\nBlessings and recompense without end,\nAll as proclaimed in the Jade Scripture.\"\n\nUpon completion, draw in the purple cloud *qi* and swallow it thrice to conclude.\n\nThen recite the Jade Scripture. When finished, offer this prayer:\n\"Converging the Three Origins’ threefold embrace,\nEscorting and guiding the returned womb-infant.\nBearing the light, guarding the lower pass,\nAttending the Mysterious, awaiting the moon’s clarity.\nThereupon, merging and sealing the Li’s lock,\nThe bright chariot receives completion.\nFortune extends through seven generations,\nCalamity disperses, the Mysterious engenders.\nGuarding the radiance of the six directions,\nAscending the Brahma of the seven numina.\nTogether engendering billions and thousands,\nSuddenly ascending to the Jade Court.\nThe infant lingers,\nFeathered robes command transcendence.\nAuspicious aid by the myriad,\nFortune spreads by the thousand.\nBones reflect jade’s luster,\nBlood inherits the jasper spring.\nLiving in joy with heaven and earth,\nSharing the same years as sun and moon.\"\n\nThe Hidden Writ of Jade Clarity offers this further prayer:\n\"Fortune spreads before the Seven Mysteries,\nSins extinguish within the Three Paths.\nThe numinous breath of the Nine Dawns’ tips,\nAbsorbing *qi* into the Supreme Emperor’s palace.\nThe Five Transcendents escort the Great One,\nTogether standing in the profound and obscure void.\nThereupon, concealing themselves in the Upper Clarity’s chamber,\nFeathered brightness in the Emperor’s One’s abode.\"\n\nWhen reciting the Scripture of the True Yang Primordial Elder, the Mysterious One Lord, visualize the true *qi* of the Life Gate’s Peach Lord, the Child’s Way of Health, its color like yellow clouds, entering from the mud-pill of your crown and descending to fill the space outside the Life Gate within the navel.\n\nUpon completion, softly intone:\n\"The true and numinous upright spirit,\nNamed the Peach Lord.\nMerging and harmonizing the Palace of Life,\nGuarding and protecting the Life Gate.\nCommunicating transcendence and conveying *qi*,\nAligning with the radiance of precious clouds.\nSeven ancestors together live,\nReceiving fortune in the lofty dawn.\"\n\nUpon completion, draw in the yellow cloud *qi* and swallow it thrice to conclude.\n\nThen recite the Jade Scripture. When finished, softly intone:\n\"The Perfected of the Five Marchmounts,\nRecording and stabilizing the Four Guests.\nThe Recorder hastens their arrival,\nProtecting the registers and governing the people.\nThe Way of Health grasps the tally,\nClouds gather and report the banner.\nFragrant winds spread in eight directions,\nEvil demons vanish like smoke.\nAll come to face the Emperor,\nMyriad upon myriad, they acclaim as subjects.\nConveying my living register,\nMy name ascends to the Jade Gate.\nSupporting and winging the Five Talismans,\nStabilizing and guarding the dusty waves.\"\n\nThe Hidden Writ of Jade Clarity offers this further prayer:\n\"The Supreme’s time is not the child,\nOne day, it unites essence to prolong.\nThis is the King of the Life Gate,\nWho can summon the myriad spirits.\nThe myriad spirits arrive at once,\nConverging at the Gate of Jade Feathers.\nCommanding the dispersal of calamity,\nCalamity ceases, fortune connects.\nAbove, resting in the Jade Hall,\nGeneration upon generation, receiving the name of transcendence.\"\n\nWhen reciting the Scripture of the Supreme Prime Three Origins Lord, visualize the true *qi* of the Mud-Pill Heavenly Emperor’s Crimson Child, its *qi* like precious light, entering from the mud-pill of your crown and descending to fill the nine apertures of the mud-pill’s gate.\n\nUpon completion, softly intone this prayer:\n\"Supreme Prime’s Crimson Child, named Supreme Perfected,\nSoaring clouds and feathered robes gleam with purple mist.\nAbove, summoning luminous radiance to attend the Emperor’s guest,\nPrecious light, resplendent, illumines my form—\nMy body sprouts feathers and wings, ascending to the Nine Heavens.\"\n\nUpon completion, draw in the precious light and swallow thrice to conclude.\n\nThen recite the Jade Scripture. When finished, intone this further prayer:\n\"Luminous essence of the Divine Child,\nPossessing spirit and majesty,\nUniting the threefold image,\nNine Ways mutually advancing.\nVestments crimson and cinnabar,\nSteps measured yet unaligned,\nEmerging into the Supreme Prime,\nWithin the Inner Stair of the Great Ultimate.\nThose who know me live,\nThose who preserve me do not decay.\nPeople bear no omen of weeping,\nRelying on me to avert misfortune.\nShould you seek my abode,\nSecretly inquire of the Supreme Subtlety.\nThe Jade Emperor of the Supreme Subtlety,\nThree Sages lingering,\nFlanking me left and right,\nTogether we take flight as one,\nMerging the Six Palaces of Chaos,\nSun and moon shine in equal splendor.\"\n\nThe Hidden Writ of Jade Clarity offers this prayer:\n\"Nine Ways revolve in accord,\nFive Elders each at peace.\nCavern-Yang holds the register,\nNamed ‘Luxuriant Spirit.’\nSeven generations of parents,\nReturn to the womb and are reborn.\nAccumulated karma and sins,\nSins dissolve, fortune arises.\nAscending into the Emperor’s Hall,\nReceiving the script of cinnabar brightness.\nEver with the Earls of History,\nLingering in the Three Realms’ court.\nHeadscarves of gold, feathered pendants,\nPrecious luminosity, perfectly round.\nThe Jade Wheel turns northward,\nCommanding the Crimson Host.\"\n\nWhen reciting the Scripture of the Supreme Clarity’s Threefold Prime and Threefold Essence Lord, visualize the true *qi* of the Crimson Palace’s Primordial Cinnabar Sovereign, its hue like sunlight, entering from the mud-pill of your crown and descending to fill the great vertebral gate at the nape of your neck.\n\nUpon completion, softly intone this prayer:\n\"Central Primordial Perfected Lord,\nNamed ‘Linked Pearls,’\nAbove, summoning sunlight,\nBathing my form.\nThree Perfected, precious luminaries,\nSecuring the Jade Talisman of life.\nLongevity of a hundred million years,\nForever without end.\nMy body sprouts feathered robes,\nSoaring to the celestial thoroughfare.\"\n\nUpon completion, draw in the sunlight and swallow thrice to conclude.\n\nThen recite the Jade Scripture. When finished, intone this further prayer:\n\"Heaven possesses Nine Souls,\nWhich must not be divided.\nThe Way possesses Three Perfected,\nWhich must not leave the body.\nThe Emperor’s Unity transforms radiance,\nMyriad transformations thus attain completion.\nFlowing pearls pause their brilliance,\nPurple mist leaps with smoke.\nSevenfold revolutions entwine,\nThree Lights illumine the Perfected.\nThe Supreme’s essence-talisman,\nJoins with me in kinship.\nThe Controller of Life holds the moon,\nBreathing into my layered lips.\nFive Elders hold the sun,\nInhaling my threefold ease.\nThe Supreme Dao Lord,\nEntwines with me.\nAbove, ascending the celestial stair,\nHand in hand with the Supreme Perfected.\"\n\nWhen reciting the Scripture of the Azure Spirit’s Yang-Ancestral Primordial Lord, visualize the true *qi* of the Primordial Sovereign of the Yellow Court below the Life Gate, its hue like moonlight, entering from the mud-pill of your crown and descending to fill the gate beneath the axle between the two pills.\n\nUpon completion, softly intone this prayer:\n\"Lower Primordial Perfected Sovereign,\nNamed ‘Primal Luminous Essence,’\nThree August Ones grasp the talisman of life,\nGolden tally conveying to the transcendent court.\nAbove, summoning the *qi* within radiance,\nIts flow bathing my form.\nFeathered chariots gleam with cloudy gauze,\nCommanding me to soar to the Supreme Clarity.\"\n\nUpon completion, draw in the moonlight and swallow thrice to conclude.\n\nThen recite the Jade Scripture. When finished, intone this further prayer:\n\"Five viscera, hundred knots,\nGive rise to ten thousand ailments.\nMysterious Unity, Forest of Emptiness,\nUnlocks barriers and dissolves knots.\nKnots severed, illness scatters,\nSpirit and essence overflow.\nFortune-*qi* fills with brightness,\nCalamity’s shadows utterly exhausted.\nThe heart of transcendence daily advances,\nThe path of death monthly recedes.\nChaos transforms the Nine Lords,\nUniting talismans with the Emperor’s Unity.\nSeven spirits uphold the talisman,\nThe Duke’s son enters the chamber.\"\n\nWhen reciting the Scripture of the August Clarity’s Cavern-True Dao Lord, visualize the true *qi* of the Nine Perfected Sovereigns of the Mud-Pill’s Supreme August Lord, a radiance of ten thousand fathoms of azure light, entering from the mud-pill of your crown and descending to fill the four borders of your mouth.\n\nUpon completion, softly intone this prayer:\n\"Nine Perfected arise,\nBorn in the Supreme Prime,\nNamed ‘Primal Spirit.’\nThree Luminaries each distinct,\nAbove, summoning the dark radiance,\nIts flow filling the four gates.\nPacifying spirits, preserving transcendence,\nDelivering the Seven Mysteries.\nMounting radiance, riding the floating,\nPaying homage to the Three Primes.\"\n\nUpon completion, draw in the azure *qi* thrice to conclude.\n\nThen recite the Jade Scripture. When finished, intone this further prayer:\n\"Seven *qi* depart the net,\nGreat Chaos in Yellow Tranquility.\nSix Jia assist the soul,\nInternally infusing the Six Ding.\nThree Perfected enter the stomach,\nFluids flow into the Great Clarity.\nFive Talismans of the Supreme August,\nEver arising in the mud-pill.\nNine Stars descend in illumination,\nDaily in tandem with the sun’s chariot.\nGazing in eight directions,\nDual canopies of flowered tassels.\nAscending to the Purple Chamber,\nDonning azure feathered scarves.\nSeven generations of parents,\nEach attains rebirth.\"\n\nWhen reciting the Scripture of the Highest Supreme Prime Lord, visualize the true *qi* of the Eight Perfected Convergent Radiance Lord within the gallbladder, its hue like yellow clouds, entering from the mud-pill of your crown and descending to fill the palace of your spine’s vertebrae.\n\nUpon completion, softly intone this prayer:\n\"Eight Perfected knit the spirit,\nSpirit born in the Nine Heavens,\nNamed ‘Northern Terrace Lord,’\nEver abiding between the Three Conjunctions.\nSummoning the true *qi* of Cavern Clarity,\nIts flow descending to bathe my form.\nMy body generates purple radiance,\nJoining with the Emperor in kinship.\nHand in hand with the Five Elders,\nSupreme transcendence entwines.\"\n\nUpon completion, draw in the yellow *qi* and swallow thrice to conclude.\n\nThen recite the Jade Scripture. When finished, intone this further prayer:\n\"Life after life attains the Emperor’s heart,\nEach meeting within the layered gates.\nPurple Chamber merges the Five Spirits,\nHun and po ever precious.\nSeven Passes receive transcendent radiance,\nFive viscera fill with Jade-*qi*.\nTogether traversing the heavens of water and fire,\nDonning the Four Harmonies’ luxuriance.\nAbove, returning to the August Unity’s child,\nWith my soul facing yours.\"\n\nWhen reciting the Scripture of the August Supreme’s Four Elders of the Dao’s Central Lord, visualize the true *qi* of the Seven Perfected Mysterious Yang Lord within the two kidneys, its hue like black clouds, entering from the mud-pill of your crown and descending to fill the earthen gate of the hollow bone at the base of your spine.\n\nUpon completion, softly intone this prayer:\n\"Seven Perfected born in the Emperor’s radiance,\nEight *qi* perpetually in motion, ever at peace.\nAbove, summoning the Child of the Sun’s Center,\nRound pearls illumine my form.\nRevolving winds merge the Dark Palace,\nReturning to the wondrous Cavern Scripture.\nDelivered from the earthen gate’s trials,\nTranscending and soaring beyond the Nine Heavens.\"\n\nUpon completion, draw in the black *qi* and swallow thrice to conclude.\n\nThen recite the Jade Scripture. When finished, intone this further prayer:\n\"The Supreme Unity’s luxuriant script,\nAscends to the Cavern Chamber.\nSix Harmonies, Three Guests,\nController of Life, Divine Duke,\nHands holding the register,\nMounting radiance, riding the dragon.\nLeftward, revolving numinous luminaries,\nRightward, fanning the divine wind.\nTowering, concealed pearls,\nFragrant and resplendent, infant and youth.\nGazing upon the Great Vastness,\nBathing and refining the Five Penetrations.\nClarifying the soul’s feathered obscurity,\nRefining the po in emptiness.\nSummoning my hundred spirits,\nA monthly accomplishment.\nSeven ancestors follow in birth,\nRadiant fortune flourishes.\nReversing my aged years,\nRestoring the Mysterious Child.\nAbove, facing the Divine Empyrean,\nGolden light in ten directions.\nJade wheels in flying whirlwinds,\nStriking gold, sounding bells.\"\n\nWhen reciting the *Scripture of the Jade Dawn and the Supreme Lord of the Great Dao*, one must visualize the true qi of the Six Perfected Ones of the Upper Prime within the lungs—radiant as white clouds—entering through the mud-pillar of one’s being and descending to fill the twelve beams of the neck. Upon completion, softly intone:\n\n\"Six Perfected, resplendent,\nWhite light effulgent,\nRevolving the Emperor’s radiance,\nAscending to the Cinnabar Homestead.\nSummoning the true to flow downward,\nIrrigating me with jade nectar.\nFeathered skirts fluttering,\nClothing me in immortal robes.\nTranscending water and fire,\nSoaring to the Divine Capital.\"\n\nUpon completion, draw in the white qi and swallow it thrice. Then recite the jade scripture, and when finished, intone again:\n\n\"Nine Unions, Three Separations,\nPurple chambers dispersed and divided.\nFive Elders in solemn majesty,\nThe Imperial Unity guards the spirit.\nThe Controller of Life presents the register,\nOffering the talisman to the Three Primes.\nThe womb-tree withers and falls,\nThe blood-corpse severs its root.\nReversing the womb’s crimson fire,\nReturning qi to the mud-pillar.\nI merge with the Nine Pures,\nThe Great Confluence of a hundred spirits.\nThe body ascends to the Jade Chamber,\nRiding alongside the Golden Immortals.\nRoaming the Primal Simplicity,\nWandering the Three Heavens.\nThe Double Flowers array the tablets,\nBlack essence flows into the Mysterious.\nFor generations, I shall be a Daoist patriarch,\nGreat fortune entwined.\nAbove, I repose in the Jade Clarity,\nBelow, I rest at the Gate of Life.\nThe Five Viscera blossom in splendor,\nThe nape bears the solar essence.\nPreserving kalpic longevity,\nPostnatal integrity ever whole.\"\n\nWhen reciting the *Scripture of the Supreme Clarity and the Great Lord of the Dao*, one must visualize the true qi of the Five Perfected Nurturing Radiance Lord within the spleen—hued like jade light and golden perfection—entering through the mud-pillar of one’s being and descending to fill the extreme root’s gate within the throat. Upon completion, softly intone:\n\n\"Five Perfected scatter numinosity,\nDispersing qi through the Nine Mysteries.\nGolden light blazes in brilliance,\nJade qi exudes sweet dew.\nThe myriad spirits harmonize,\nGladdening my body.\nThe Rounded Radiance presents the register of life,\nThe Supreme Unity inscribes the Nine Heavens.\nDescending the Eightfold Luminous Chariot,\nSpurring dragons to ride the pristine mist.\nMerging within the Three Emperor’s chambers,\nPreserving my kalpas of years.\"\n\nUpon completion, draw in the jade light and swallow it thrice. Then recite the jade scripture, and when finished, intone again:\n\n\"At dawn, ascending the Ninefold Luminous Terrace,\nAt dusk, entering the Divine Empyrean’s gate.\nThe Supreme Unity’s divine master,\nAlso called the Threefold Advent Vessel.\nLeft hand holding my talismanic register,\nRight hand escorting the Cavern Yang Lord.\nStabilizing life within the Purple Chamber,\nThe Five Spirits further intermingle.\nIntermingling in the Emperor’s Hall of Leisure,\nThe seven ancestors sever the root of death.\nThe five poisons’ qi dissipates and vanishes,\nThe turbid streams bear no floating dross.\nCommanding my corpse and blood to transform,\nThe Emperor’s chamber yields golden prime.\nThe Three Paths’ suffering-trees wither,\nFor generations, attaining celestial immortality.\nEver accompanying the King within the Radiance,\nAccumulating kalpas to preserve the Primal Prime.\"\n\nWhen reciting the *Scripture of the Supreme Ultimate and the Primordial Radiance Lord of the Dao*, one must visualize the true qi of the Four Perfected Azure Clarity Lord within the liver—hued like azure clouds—entering through the mud-pillar of one’s being and descending to fill the gate of the stomach’s membrane beneath the fat. Upon completion, softly intone:\n\n\"Four Perfected, ever vital,\nAzure light, essence of splendor.\nWandering the resplendent luminous walls,\nPervading the Jade Radiance’s court.\nUpholding the Upper Prime,\nRevering and yielding to the Five Spirits.\nUprooting the seven-leaf root,\nPreserving my blossoming infant.\"\n\nUpon completion, draw in the azure qi and swallow it thrice. Then recite the jade scripture, and when finished, intone again:\n\n\"The Emperor’s chamber merges the body,\nOne Dao, myriad divisions.\nMyriad divisions unite in distinction,\nThis is called the Imperial Unity.\nWhite Emperor, luminous and numinous,\nGolden auroras revolve the sun.\nLayered darkness, profound and silent,\nConcealing the spirit’s transformations in secrecy.\nGrasping my Five Talismans,\nAligning with heaven’s completion.\nJade radiance overspreads,\nNo death, no illness.\nSeven ancestors and parents,\nTranscending to the Cinnabar Chamber.\nThe eightfold untying of the womb-root,\nThe death-tally extinguished.\nThe Emperor obtains the Five Primes,\nI return the Three Sevens.\nThe six armpits blaze in splendor,\nGolden script and feathered missives.\nFor generations, I shall be an immortal perfected,\nPrecious registers, mysterious and distinct.\nFlourishing in the ancestral mystery,\nGenerations without end.\"\n\nWhen reciting the *Scripture of the Primordial Purple Numinosity Lady of the August Beginning*, one must visualize the true qi of the Three Perfected Primal Life Lord within the essence-blood—hued like crimson clouds—entering through the mud-pillar of one’s being and descending to fill the source beneath the two nostrils. Upon completion, softly intone:\n\n\"Three Perfected, blazing in light,\nFlowing cinnabar, wandering in cycles.\nSeparating and uniting the Nine Radiant Ones,\nThe Three Caverns’ golden portals.\nAbove, summoning the Vermilion Youth,\nThe Five Sufferings dissolve and open.\nThe root of death severs and falls,\nThe solar essence soars in flight.\nTranscending the Ten Realms,\nAscending the Jade Stair.\"\n\nUpon completion, draw in the crimson qi and swallow it thrice. Then recite the jade scripture, and when finished, intone again:\n\n\"Seven qi merge and harmonize,\nThe Imperial Unity returns to the origin.\nStagnant knots of the moon disperse,\nMy life-span lengthens and transcends.\nThe path of death closes and vanishes,\nSevering the womb-root.\nThe Five Viscera bloom in splendor,\nThe Six Bowels gleam like gold.\nThe Imperial Unity guards the form,\nThe Controller of Life guards the spirit.\nThe Five Talismans open the portals,\nThe Five Registers ascend to immortality.\nFor generations, I shall be a Daoist sovereign,\nThe Emperor’s teacher, entwined in fortune.\nScattering incense at the Dragon Window,\nReturning blossoms to waft mist.\nSevenfold ascent to the Supreme,\nEightfold radiance, Ninefold Arrays.\nFlowing sources, winding fluids,\nGathering at the Six Abysses.\nName inscribed in the Upper Clarity,\nQi accumulates in tranquil serenity.\nRevolving winds shed death,\nThe Imperial Unity remains linked.\nFive Penetrations, Seven Unions,\nAll born in the Upper Prime.\"\n\nWhen reciting the *Scripture of the Supreme Elder Lord of the Center and the Perfected of Non-Florescence*, one must visualize the true qi of the Two Perfected Firm Jade Lords within the bones and joints—hued like azure clouds—entering through the mud-pillar of one’s being and descending to fill the mouth of the Great Granary and the five intestines. Upon completion, softly intone:\n\n\"Two Perfected, firming the spirit,\nVigorous and surging through the Three Passes.\nRevolving gold to merge with jade,\nStrengthening and preparing the mud-pillar.\nAbove, connecting with the Emperor’s qi,\nDispersing and flowing through the Golden Gate.\nMerging transformations, inaugurating brightness,\nUniting with my immortal soul.\nSeven ancestors ascend together,\nEradicating the womb-root.\nFor generations, preserving the Dao and virtue,\nEver enjoying joy and abundance.\"\n\nUpon completion, draw in the azure cloud qi and swallow it thrice. Then recite the jade scripture, and when finished, intone again:\n\n\"The soul born from the Non-Being,\nSpread through the Ninefold Heavens.\nThe Dao emerges from the Three Ultimates,\nEver roaming the Crimson Palace.\nThree palaces merge and transform,\nThis is the Purple Chamber.\nWhere the Purple Chamber resides,\nFirst is the Hall of Brightness.\nWithin the Hall of Brightness,\nGuarding the spirit, Peach Prosperity.\nWind and clouds, lush and dense,\nClear and cool.\nSealing the apertures of desire,\nSevering the root of attachment.\nIts sage is called Elder Brother,\nIts perfected is called Overflowing.\nIf one can know this,\nThen the Golden Gate opens.\nTo the left and right of the Golden Gate,\nSuddenly beholding the exalted worthies.\nOn the left, Father Tranquil Existence,\nOn the right, Mother Essence Prolonged.\nThese are the Lords within the Radiance,\nAscending with you to the Jade Dawn.\nFather Tranquil, Mother Essence,\nFor generations, they shall be immortals.\nMyriad branches of Double Flowers,\nAll receive the grace of the Imperial Unity.\"\n\nWhen reciting the *Daoist Canon of the Central Yellow and Lao Lord*, one should visualize the True Qi of the One Real Heavenly Essence Sovereign within the heart—a crimson cloud descending from the mud-pill palace of the self, flowing downward to fill the four apertures of the chest. Once complete, softly intone:\n\n*\"One Real anchors the heart,\nGoverning the hundred spirits.\nMay the hundred spirits ever flourish,\nGathering with me in the Crimson Chariot.\nAbove, summon the Jade Qi,\nSix fluids settle as treasures.\nThe Red Radiance awakens the numinous,\nUprooting my seven roots,\nTranscending the Three Paths,\nAscending to the Southern Immortals.\"*\n\nAfter this, draw in the Qi of the crimson cloud and swallow it thrice, then cease. Proceed to recite the *Jade Canon*. Upon completion, intone once more:\n\n*\"The Imperial Unity whirls with the wind,\nTransforming to unite with Peach Prosperity.\nFlowing life generates fortune,\nAscending to bind the Jade Hall.\nMerge and harmonize,\nEntering and exiting the Imperial Chamber.\nThree and Five unite as One—\nSurely becoming an Immortal Lord.\nThe Seven Mysteries’ parents,\nExtinguish the corpse and disperse resentment.\nThrough ten thousand kalpas and a thousand layers,\nAll ascend to the Upper Clarity.\nThe immortal melody bows in submission,\nBroadly spreading through the lush center.\nHe who guards my form—\nThe Director of Destinies, the Venerable One.\nThe Imperial Lord’s Noble Son,\nDeeply fortifies the mud-pill palace.\nThe Great Tenuity’s Jade Flower,\nFeathered robes unfurl banners.\nSoul and spirit embrace forever,\nA hundred bones all filled with spirit.\nThe Spirit King generates fluids above,\nSurpassing to cross the Gate of Death.\nThen befriending the Exalted One,\nGrasping the register as a guest of the Jade Clarity.\"*\n\nWhen reciting the *Daoist Canon of the Upper True Inner Radiance Sovereign of Azure Essence*, one should visualize the True Qi of the Nine Origins’ Perfected, which constrains and governs—clouds of five colors descending from the mud-pill palace of the self, flowing downward to fill the Gate of Hidden Dawn in the left ear. Once complete, softly intone:\n\n*\"The essence of the Nine Origins,\nOpens the Heavenly Pass’s window.\nEight Radiant Qi converge,\nAscending to connect with the Golden Chamber.\nThe Three Origins’ Imperial Abode,\nReverses aging to generate flourishing.\nJade Flower irrigates,\nRefining and transforming the mugwort-like visage.\nThe Flying Auroral Purple Chariot,\nCarries me to ascend the void.\"*\n\nAfter this, draw in the Qi of the five-colored clouds and swallow it thrice, then cease. Proceed to recite the *Jade Canon*. Upon completion, intone once more:\n\n*\"The Lesser Lad of the Great Tenuity,\nEver stands before the Emperor.\nHis name is Radiant Essence,\nHis surname is Gan.\nUniting form with the Great One,\nClad in vermilion cinnabar.\nFive talismans command the register,\nHolding the Jade Tablet.\nWhere the Imperial Lord descends,\nHe governs the communication of all spirits.\nMerging with the Supreme,\nThe Director of Destinies,\nFirmly protects the Numinous Gate.\nThe Five Viscera divide and assemble,\nThe Imperial Immortal guards the dwelling.\nMalevolent seeds uproot their roots.\nThree Qi spread lushly,\nEight revolutions, Five Smokes.\nI ascend to the auroral void,\nDriving the dragon’s bright chariot.\"*\n\nWhen reciting the *Daoist Canon of the Jade Worthiness Sovereign of the Nine Qi of the Great Yang*, one should visualize the Hun-soul of the August One ascending to return to True Qi—a cloud of profound hue descending from the mud-pill palace of the self, flowing downward to fill the Gate of Hidden Dawn in the right ear. Softly intone:\n\n*\"The August One’s Upper Perfected,\nWashes and generates the Cinnabar Chamber.\nVermilion illumines the orchid’s brilliance,\nRadiating and overflowing with luminous light.\nThe sound of the Great Origin,\nResonates clearly through the Nine Voids.\nThe solitary joy of Mysterious Gold,\nVibrates with a ringing clarity.\nAbove, summon the Jade Radiance,\nHarmonizing with my spirit hall.\nUrging the void to ascend and fly,\nRoaming and feasting in the Jade Capital.\"*\n\nAfter this, draw in the Qi of the profound cloud and swallow it thrice, then cease. Proceed to recite the *Jade Canon*. Upon completion, intone once more:\n\n*\"The Nine Palaces unite as One,\nTransforming form in the Imperial Dawn.\nAscending to the Purple Chamber,\nSummoning the Perfected to call the Immortals.\nGathering and aiding soul and spirit,\nEncompassing and embracing the hundred spirits.\nThe Seven Mysteries rejoice in well-being,\nShedding suffering and breaking roots.\nThe smoke of death extinguishes its Qi,\nFortune and emolument fill the chariot.\nThe self ascends to the Great Auroral Void,\nDriving the radiance to harness the clouds.\nThe Five Emperors within the sun,\nGrasp the Wheel of Solar Essence.\nLushly flourishing in transcendent abundance,\nThe auroral gale ascends together.\"*\n\nWhen reciting the *Daoist Canon of the Golden Flower Radiance Sovereign of the Nine Primes*, one should visualize the True Qi of the Left Origin Sovereign of Purple Prime, Yiyu Wuren—a cloud of radiant hue descending from the mud-pill palace of the self, flowing downward to fill the boundaries of the head and face. Once complete, softly intone:\n\n*\"Yiyu generates the Perfected,\nThe Perfected Radiance generates the void.\nNuminous Qi shines brightly,\nPurple Prime fuses harmoniously.\nAbove, it conveys flowing fluids,\nBelow, it spreads through my palace.\nThe body generates water and fire,\nThe form transforms into jade light.\nThe Flying Immortal’s feathered canopy,\nAscends to enter the Spirit Duke.\nReceiving the scripture in the Jade Capital,\nPerfecting my immortal lineage.\"*\n\nAfter this, draw in the Qi of the radiant cloud and swallow it thrice, then cease. Proceed to recite the *Jade Canon*. Upon completion, intone once more:\n\n*\"Auspicious fluids of Celebration Prime,\nFlow and surge through the Western Field.\nThe Supreme Emperor takes my hand,\nSummoning the Exalted Immortals.\nShedding turbidity and dispersing filth,\nSevering the roots of death.\nThe One Heavenly Emperor,\nNamed the Mysterious Congealing Heaven.\nIlluminating the Six Harmonies,\nPacifying the mud-pill palace.\nThis is the Unsurpassed Elder,\nEnabling the self to preserve enduring peace.\nInscribed in the Jade Emperor’s charts,\nShoulder to shoulder with the Imperial Dawn.\nThe Five Palaces generate blossoms,\nThe Six Fluids are the dragon’s source.\nThe abyss clears to Great Simplicity,\nLushly misting the Golden Fluids.\nTen thousand immortals come to pay court,\nThe Five Peaks open and present.\nProfound transgressions sink and scatter,\nHeavenly fortune manifests as smoke.\nThe carved beam guards the Gate of Destiny,\nEver coming to protect the Gate of Death.\nAbove, born in the Jade Chamber,\nReceiving the rank of Golden Immortal.\nThe Heavenly Jade Hall,\nEver connects with the Imperial Worthies.\nWithin the Nine Heavens,\nFeasting and gazing through kalpas of years.\"*\n\nWhen reciting the *Daoist Canon of the Director of Destinies, the Upper True Sovereign of the Nine August Ones*, one should visualize the True Qi of the Central Origin Sovereign of Yellow Prime, Yuanhua Huangren—a radiance like the morning’s splendor ascending, descending from the mud-pill palace of the self to fill the boundaries of the chest and abdomen. Once complete, softly intone:\n\n*\"The Upper Radiance of the Nine Heavens,\nTransforms to generate blossoming splendor.\nResplendent through the Great Void,\nIlluminating the Perfected Purple Tenuity.\nAbove, it conveys the Central Yellow,\nA hundred spirits descend and return.\nDispersing roots to depart suffering,\nThe Eight Difficulties open wide.\nSeven ancestors ascend together,\nFortune covers all majestically.\nEnabling my spirit to become immortal,\nEight Radiant Qi fly in unison.\"*\n\nAfter this, draw in the blossoming radiance and swallow it thrice, then cease. Proceed to recite the *Jade Canon*. Upon completion, intone once more:\n\n*\"The Supreme Emperor’s essence and soul,\nThe Eight Numinous of the Yang Hall.\nDispersing the Qi of death,\nMerging and harmonizing with all beings.\nThe Imperial Unity receives the chart,\nThe Three Origins gather in clarity.\nThe Nine Perfected rest in tranquility,\nThe Seven Spirits abide in serenity.\nSurpassing stagnant nodes,\nCrossing beyond the ghostly troops.\nAscending to the Imperial Dawn,\nGazing joyfully upon the Jade Court.\nThe Mysterious Mother stabilizes the register,\nThe Five Palaces open to clarity.\nThe womb’s roots eradicate their seeds,\nBlood and filth settle into peace.\nSeven ancestors and parents,\nGenerate fortune in the Three Clarities.\nThe Brilliant Husband of Non-Duality,\nHolds my immortal canon.\nBroadly calming the spirit and settling Qi,\nReversing the register to sever darkness.\nSealing the Gate of Death,\nThe Great Chaos generates the One.\nEternally resting upon the Feathered Terrace,\nFirmly guarding the Five Elders’ chamber.\nReceiving the register in the Upper Clarity’s gates,\nPreserving virtue on the Seven Origins’ days.\nAbove, ascending to the Jade Auroral Void,\nBelow, uniting with the Imperial Unity.\"*\n\nWhen reciting the *Scripture of the Heavenly Sovereign’s Supreme Perfected Jade-Flower Three Primes Lord*, one must visualize the White Primordial Right Prime Lady, Radiant Dawn, and the True Qi of the Selenic Blade—its form like the blossom within the moon—entering through the adept’s Mud-Pill Palace, then descending to spread through the Lower Pass of the small abdomen down to the feet. Once this is complete, softly intone the prayer:\n\n*\"White Primordial Radiant Dawn,\nBorn with the Nine Heavens as one,\nLofty Void with reins of purity,\nFloating scene in Jade Clarity.\nTurning truth to curve with immortals,\nFlowing and sprinkling the Eight Seas,\nPenetrating the obscure to reach the subtle,\nMysterious radiance of flowery essence—\nLet me inwardly pierce through,\nFive apertures open to clarity.\nDivine Lords come to wander,\nMy Dao attains completion.\"*\n\nOnce done, draw in the Qi of the moon’s blossom and swallow it thrice, then cease. Proceed to recite the Jade Scripture. Upon completion, intone the prayer again:\n\n*\"Soul born of Nine Qi,\nQi transforms to become spirit.\nFive lights entwine and gather,\nGrand Unity transfigures into immortals.\nTwenty-Four Perfected,\nReturn form to the Imperial Ancestor.\nNine curves of the Lower Gate,\nGuard life within white clouds.\nYellow Court and Six Palaces,\nNurture the root of destiny.\nWomb knots and placenta-tree,\nSeeds planted in the mountain of death—\nOnce bound and restrained,\nCut off the source of annihilation.\nRegisters pure and bright,\nGolden chariot and Jade axle.\nEver a Virtuous Elder,\nGenerations receive the grace of the Dao.\nAscending to join sun and moon,\nTo befriend the Imperial Immortals.\"*\n\nWhen reciting the *Scripture of the Supreme Prime Prohibiting Lord of Grand Unity*, one must visualize the True Qi of the Life-Receiving Controller within the sun, the color of the Three Blossoms, entering through the adept’s Mud-Pill Palace and spreading through the Gate of the left hand. Once this is complete, softly intone the prayer:\n\n*\"Four Great Ascend to Heaven,\nHeavenly Prime returns to me.\nThree Blossoms spout radiance,\nController of Life soars on the scene.\nSummon immortals for me,\nSeven ancestors disperse and ascend.\nTogether we rise to the Great Numinous,\nSun and moon shine as one.\"*\n\nOnce done, draw in the Qi of the Three Blossoms and swallow it thrice, then cease. Proceed to recite the Jade Scripture. Upon completion, intone the prayer again:\n\n*\"Grand Unity’s tasks are gathered,\nSummoning the Northern Controller, the Primordial Elder.\nGrasping the tally, coming and going,\nPrimal Simplicity holds the talisman.\nWhite Prime guards the feminine,\nResplendent as the dawn’s bright light.\nDonning auroras, ascending the Imperial Wall,\nSeated in order on the Thunder Numinous mat.\nMerging with the Five Solar Chambers,\nWhite Qi nurtures the noble-born.\nAzure Lord presses forward with prosperity,\nLeft hand carries the Essence Gate’s door,\nRight arm embraces the Harmonious Infant.\nMy life blooms with sun and moon’s blossom,\nFriend and guest to the Crimson Qi King.\nEight Sceneries illuminate the Mud-Pill wilds,\nLuminous within the Grotto Chamber.\nThe Infant becomes the Crimson Child,\nMerging and parting to generate jade countenance.\nFive Paths flourish with golden blossoms,\nRanked as a Lord of Supreme Clarity.\nSeven ancestors sever dark stagnation,\nBody attains to ride the spirit-wind.\nWandering above the Three Clarities,\nJoyfully returning to the Infant Child.\"*\n\nWhen reciting the *Scripture of the Primal Void Yellow Chamber True Dawn Lord*, one must visualize the True Qi of the Peach Lord within the sun, Full Radiance, the color of solar brilliance, entering through the adept’s Mud-Pill Palace and spreading through the Gate of the right hand. Once this is complete, softly intone the prayer:\n\n*\"Within the Primal Void Yellow Chamber,\nThe sun’s midst is named Full Radiance.\nLeft feasting in the Vermilion Numinous Terrace,\nRight carrying the Immortal Emperor’s Court.\nReclining in the Three Blossoms’ chamber,\nKnots form my spirit’s beginning.\nTogether we fly into the Mysterious-Mysterious,\nSeven ancestors return to the Flowery Infant.\"*\n\nOnce done, draw in the Qi of solar brilliance and swallow it thrice, then cease. Proceed to recite the Jade Scripture. Upon completion, intone the prayer again:\n\n*\"Nine Primes guard the true,\nFive Emperors entwine and coil.\nKing of sun and moon,\nBecomes kin to the adept.\nGreat Chaos of Three and Five,\nParting the hun-soul and po-soul.\nHundred joints of golden splendor,\nJade liquid returns the spirit.\nFive Palaces generate blossoms,\nWhite Qi moves the mist.\nFilling the Three Clarities,\nPurple Chamber’s treasure nectar.\nAbove, opens the immortal’s gate,\nBelow, seals the Gate of Death.\nLet my feathered tally stand\nBefore the Jade Emperor.\nSeven ancestors and parents,\nReturn to life in the Southern Pavilion.\nTiger-clad, they seize demons,\nDragon banners command spirits.\nGrand Unity’s brocade banner,\nSummons and binds the Three Officials.\nErasing the register of death,\nInscribing names in Jade Perfection.\nPreserving life with Grand Unity,\nSun and moon share the same years.\"*\n\nWhen reciting the *Scripture of the Four Perfected Lords of the Grand Ultimate*, one must visualize the True Qi of the Flying Numinous Child of the left eye, the radiant blossom of the sun, entering through the adept’s Mud-Pill Palace and spreading into the left eye. Once this is complete, intone the incantation:\n\n*\"Four Poles, Grand Numinous,\nPrime Lord’s essence and luster.\nSolar blossom fills and overflows,\nChild’s clarity shines resplendent.\nTwo Sceneries illuminate each other,\nPenetrating my luminous beam.\nThree Cinnabars open the true,\nMy Dao unfolds and expands.\nFeathered robes and silk skirts,\nFlying to the Supreme Capital.\"*\n\nOnce done, draw in the radiant blossom and swallow it thrice, then cease. Proceed to recite the Jade Scripture. Upon completion, intone the prayer again:\n\n*\"I ride the Qi of merging chaos,\nEntwining and securing the Nine Perfected Mounds.\nNurturing light with the Grandly Prosperous Child,\nTogether arrayed with the congealed Feathered Pearl.\nNine Honored and hosts of emperors born,\nScenery and grotto revolve in an instant.\nSeven ancestors’ knots dissolve and scatter,\nFilth and accumulation suddenly vanish.\nGeneration after generation, life flourishes,\nMysterious-Mysterious obtains the immortal scripture.\nBody ascends to the Grand Auroral Palace,\nControlling dragons to feast in Jade Void.\nAbove, paying court to the Supreme Clarity Emperor,\nReclining and rising with the True Support.\"*\n\nWhen reciting the *Scripture of the Seven Dawns Flower-Scattering Perfected Lord of the Four Celestial Houses*, one must visualize the True Qi of the Dawn Infant Child of the right eye, the radiant blossom of the moon, entering through the adept’s Mud-Pill Palace and spreading into the right eye. Once this is complete, softly intone the prayer:\n\n*\"Seven Dawns fly with blossoms,\nBlossoms scatter the Three Primes.\nMerging to form the true,\nAbove, summoning the moon’s soul.\nDescend numinosity for me,\nOpen my immortal’s gate.\nSeven ancestors fly together,\nFlying to pay court to the Imperial Lord.\"*\n\nOnce done, draw in the radiant blossom of the moon and swallow it thrice, then cease. Proceed to recite the Jade Scripture. Upon completion, intone the prayer again:\n\n*\"Three Purities firmly spread,\nSupreme Prime Elder Lord.\nSpirit born, Dao secured,\nMy po-soul roams freely.\nPreserving the adept’s Six Harmonies,\nWorries and sufferings sink into the Crooked Gate.\nDeathly Qi sealed beneath the earth,\nBody and Imperial Unity Lord,\nTogether lapels joyful in the Six Palaces.\nMirroring the heart in the Cinnabar Mysterious Chamber,\nBright Qi in the Mud-Pill wilds,\nBody radiant with golden brilliance.\nFeathered register summons the true,\nWhite Qi thickly lush.\nHundred spirits luminous and fresh,\nEver with sun and moon.\nRegisters entwine and coil,\nGenerations preserve virtue and power.\nEternally a Heavenly Immortal,\nSilent and inwardly focused,\nAscending to the Imperial Court.\"*\n\nWhen reciting the *Scripture of the Yellow Radiance Prime Lord of the Stellar Hour*, one must visualize the True Qi of the White Clarity Child of the lung region, the radiant light of the Five Passes, entering through the adept’s Mud-Pill Palace and spreading through the Gate of the lung’s Flowery Canopy, above to connect with the Child of both eyes.\n\nUpon completion, softly intone the invocation:\n\"White Clarity Child, nine-fold yellow clouds entwined,\nAzure Terrace’s flying wheel,\nThree spirits harmonize with the true,\nNamed Mystic Supreme Radiance,\nEnthroned as the Lofty August Guest,\nMaster of the hundred spirits’ lives,\nBearing me into purple mist.\"\nThis done, draw in the radiant light and swallow thrice to conclude.\n\nThen recite the *Jade Scripture*. When finished, intone again:\n\"Two Elders at left and right,\nImperial soul illumines the Nine Abysses,\nYin and yang transform above and below,\nGrand Unity stands at the central root,\nFive spirits guard this living form,\nLife’s Controller seals my gate of death,\nNine Palaces merge as one,\nSix Harmonies blend boundlessly,\nThe world gains immortal scriptures,\nFortune and blessings entwine,\nFive Elders face one another in feast,\nCelebrating the Three Primes,\nTogether they come to welcome,\nAscending to the Imperial Dawn,\nSeven generations of stagnant blood,\nAll uprooted at their source,\nReturning to the Southern Palace’s womb,\nReborn in the Imperial Chariot,\nI feast in the Jade Hall,\nShoulder to shoulder with the Imperial Wheel,\nGeneration upon generation inscribed in the registers,\nClad in feathered robes, waving pennants,\nChildren’s children preserved in prosperity,\nBlessings extending to later mysteries,\nForever an Immortal Lord,\nCommanding the ten thousand spirits.\"\n\nWhen reciting the *Scripture of the Golden Watchtower’s Later Sage, Supreme Peace Li, Heavenly Emperor, Supreme Radiance Lord*, one must visualize the One Primal White Qi Lord of the Womb, Wu Xuanzi, and the Grand Unity’s Essence-Soul, Xuan Guizi—two spirits’ true qi, the colors of the Three Flowers—entering through the adept’s Mud-Pill Palace and descending to fill the root gate of the adept’s five viscera and throat’s origin.\n\nSoftly intone:\n\"Golden Watchtower gleams in Jade Clarity,\nWhite qi illumines cinnabar clouds,\nLuminous radiance dense with golden numen,\nFive hues emit the Three Flowers,\nFlowing nectar feasts in the resting hall,\nKnitting my first sprouting bud,\nJade tally summons the hundred spirits,\nMighty writ subdues the ten thousand demons,\nPreserving this immortal through kalpas,\nThe Dao bright, no misfortune or evil.\"\nThis done, draw in the Three Flowers’ qi and swallow thrice to conclude.\n\nThen recite the *Jade Scripture*. When finished, intone again:\n\"Heaven engenders the Eight Qi,\nRevolving to unite with the Imperial Homeland,\nFive spirits bear the tally,\nLife’s Controller lends support,\nSevering the ledger of death,\nSweeping impurity from the dark underworld,\nSeven generations’ knots undone,\nFortune extends to the Jade Court,\nStagnant blood dissolved,\nThree Pures gleam in clarity,\nI ascend to the Heavenly Hall,\nUniting with the Emperor in spirit,\nThe world attains immortal covenant,\nAll petitions fulfilled,\nPlanting years in the sun’s midst,\nCultivating life in the moon’s court,\nReturning to the womb’s childlike ignorance,\nRevolving to become an infant,\nBorn in unity with Heaven,\nLifespan merging with the sun.\"\n\nWhen reciting the *Scripture of the Supreme Void’s Later Sage, Radiance-Free Pengshi True Lord*, one must visualize the Green Qi Lord of the Knot, An Yanchang, and the Primal Lord’s Essence-Soul, Guardian Valley Child—two spirits’ true qi, qi like jade blossoms—entering through the adept’s Mud-Pill Palace and descending to fill the upper mouth of the adept’s five viscera and great stomach.\n\nSoftly intone:\n\"Separating and uniting the Nine Numinous,\nTwo Perfected in profound secrecy,\nSupreme Void’s layered heavens,\nAbove bearing the Grand Unity,\nFeminine and masculine merge,\nTogether in the wondrous chamber,\nAbove transforming the Nine Immortals,\nBelow dissolving the womb’s knots,\nSeven ancestors rejoice,\nFive sufferings released,\nEnabling my flight,\nSpirit transforming my original form.\"\nThis done, draw in the jade blossoms’ qi and swallow thrice to conclude.\n\nThen recite the *Jade Scripture*. When finished, intone again:\n\"Planting fortune to ascend the Nine Heavens,\nUprooting corpses from the earthly gate below,\nSeven Mysteries’ stagnation dissolved,\nSevering the tree of shade and sorrow,\nReturning to the Vermilion Fire Palace’s womb,\nReborn in the Nine Mysteries’ gate,\nTrue qi daily accruing,\nMisfortune daily dispelled,\nI ascend to the Three Clarities’ hall,\nRiding the whirlwind to the Supreme Radiance Court,\nLife conjoined with the Moon Mother,\nYears following the Sun Emperor’s birth,\nLayered mysteries preserve the immortal register,\nReversing age to become a child again,\nFortune rising within the Six Harmonies,\nReceiving the register for eternal life.\"\n\nWhen reciting the *Scripture of the Supreme Mystery Capital’s Nine Qi Elder, Lord of Immortals*, one must visualize the Black Qi Lord of the Node, Bin Laisheng, and the Imperial True Essence-Soul, Dark Terrace Wang—two spirits’ true qi, the color of jade light—entering through the adept’s Mud-Pill Palace and descending to fill the mouth of the adept’s nine intestines, beneath the Hidden Source.\n\nUpon completion, softly intone:\n\"Supreme Mystery, how vast and empty,\nBlack qi born in the upper void,\nImperial true illumines the radiant scene,\nNine qi merge in the spirit’s hut,\nTransforming to chant praises in the ten directions,\nSuddenly manifesting at the dawn of light,\nMyriad Perfected refine my immortal self,\nHundred Passes naturally purified,\nSeven Mysteries sever the womb’s tree,\nNine Generations ascend the fortune hall,\nAbove summoning the Radiance Child,\nWith me mounting the flying chariot.\"\nThis done, draw in the jade light and swallow thrice to conclude.\n\nThen recite the *Jade Scripture*. When finished, intone again:\n\"Imperial soul illumines the Primal Alve,\nEver guarding my gate of life,\nProstrate corpses extinguished,\nPreserving the po soul and pacifying the spirit,\nMysterious Mother revolves the light,\nServing the Emperor’s Jade Immortal,\nThe Right Life Grand Unity,\nExtending to my body,\nFeasting in the northern Upper Clarity,\nEnthroned as a Jade Guest,\nLife’s destiny conjoined with the sun’s splendor,\nYears harmonized with the moon’s mist,\nForever aiding the Golden Chamber,\nDawn’s radiance as neighbor,\nDispelling sorrow from the stomach’s gate,\nUprooting suffering from the Three Disciples’ midst,\nFortune accumulates within the Cinnabar Mystery,\nBlessings fill the Mud-Pill Chamber,\nHundred spirits merge with the Imperial Unity,\nGreat transformation in the revolving wind,\nReversing my withered mugwort form,\nRemaking my countenance as an infant,\nGeneration upon generation entering the Immortal Hall,\nMystery upon mystery ascending the Feathered Palace,\nThough great kalpas repeatedly collapse,\nWith the sun I ever grow in glory.\"\n\nWhen reciting the *Scripture of the Supreme Clarity’s Eight Radiance Elder Lord*, one must visualize the Yellow Qi Lord of the Womb, Zu Mingche, and the Heavenly Emperor’s Essence-Soul, Li Weizang—two spirits’ true qi, the color of yellow clouds—entering through the adept’s Mud-Pill Palace and descending to fill the root of the adept’s small intestine’s two apertures.\n\nSoftly intone:\n\"Supreme Clarity illumines the Mystic Hall,\nEight Radiance riding the Heavenly Discipline,\nYellow qi harmonizes with the spirit’s true,\nEssence-soul faces the Imperial Child,\nGrand Unity once inscribed in the life register,\nFive talismans secure immortality,\nBearing immortals with dawn’s radiance,\nRevolving wind to reverse the form’s origin,\nUprooting suffering from seven ancestors,\nTogether rejoicing within the Nine Mysteries.\"\nThis done, draw in the yellow clouds and swallow thrice to conclude.\n\nThen recite the *Jade Scripture*. When finished, intone again:\n\"White clouds merge with dawn’s radiance,\nRiding the plain to meet the Supreme Tenuity,\nAscending to the Imperial Unity’s chamber,\nUnbinding the sash at the August Unity’s steps,\nOpening the Golden Gate’s light,\nThree Yangs summoning the return above,\nRaising my body’s spirits within,\nEnveloping the Supreme Brightness’ majesty,\nGreat Treasure’s Nine Flowers,\nLight illuminating my form,\nSummoning clouds to merge with the true,\nDispersing incense to invite the numinous,\nRebirth in the moon’s womb,\nReceiving life in the sun’s midst,\nYears enjoying radiant splendor,\nLife following without collapse,\nBody as an Immortal King,\nPreserving this Supreme Clarity,\nThe world receives true scriptures,\nMystic splendor in the Jade Court.\"\n\nRecite the *Daoist Scripture of the Azure Florescence, the Lofty Dawn Master, the Jade Guardian, the Perfected Immortal King, and the Azure Lad of the Square Cauldron Palace*. While doing so, visualize the Lord of Crimson Qi within the Blood—Hunli Zi—and the Controller of Life-Spirit Essence—Faniu Zi. The true qi of these two spirits, like crimson clouds, enters from your Mud-Pill Palace and descends to suffuse beneath the hundred joints and nodes of your body.\n\nThen intone the subtle incantation:\n\"Dawn’s radiance gleams with eastern clouds,\nCinnabar light illumines the lofty clarity,\nTwo Perfected harmonize the spirit’s origin,\nLuminous, the Seven Flowers arise,\nFive Elders ascend the Imperial Seat,\nThe Supreme Unity guards the infant’s essence,\nBroidered clouds gleam through the dark night,\nMystery upon mystery unfolds the layered depths,\nSeven Ancestors inscribe their names in the registers,\nThe Southern Culmen receives the numinous embryo,\nThe Lofty Dawn gazes upon the cloud-chariot,\nConveying me to ascend in flight,\nUprooting the foundations of a hundred generations,\nRejoicing in the path of ten thousand kalpas.\"\n\nWhen finished, draw in the crimson cloud-qi three times and cease. Then recite the *Jade Scripture*. When finished, intone again:\n\"The Five Ways merge and return,\nThe Seven Gates first divide,\nThe Southern Harmony raises its standard,\nThe White Emperor manifests peace,\nThe numinous banner orders the po,\nThe Flourishing Assembly guards the spirit,\nReceiving the talisman to ascend the heavens,\nResting in the Jade Pavilion,\nInscribing the record on jade tablets,\nFor generations to be Heavenly Immortals,\nThe Three Paths severed and broken,\nThe root of the womb-cutting eradicated,\nThe qi of death sinks and scatters,\nThe wheel of misfortune unlinked,\nFortune reaches the branching descendants,\nBlessings gather in the flourishing mystery,\nNames inscribed within the Jade Hall,\nFor generations to be of the Gate of Dao and Virtue.\"\n\nRecite the *Daoist Scripture of the Nine Elder Perfected Immortal Sovereigns of the Fusang Great Emperor*. While doing so, visualize the Supreme Mystery’s Primordial Father—Gaotongsheng—and the Profound Mystery’s Mysterious Mother—Shuhuowang—the Supreme Emperor of the Great Unity—Chongmingkong—and the Nine August Emperors, whose honored name is Bright Perfection; the Supreme Emperor’s Essence-Spirit—Yangtangwang; the Heavenly Emperor’s Nine Passes Spirit—Lüjiudao; and the Heavenly Register’s Emperor Spirit—Zhaowu’a. The true qi of these seven spirits, merging into the form of a lotus, enters from your Mud-Pill Palace and descends to suffuse the root of your original destiny—the great node within the womb’s chamber.\n\nThen intone the subtle incantation:\n\"Primordial Father and Mysterious Mother,\nSeven Perfected unite in qi,\nDivine Lords and Supreme Emperor,\nNine Elders share their stations,\nStrengthening my life for me,\nDelivering across the Ten Realms,\nSun and moon share the same tally,\nNine Emperors seal the covenant,\nSeated, the Heavenly Demons command,\nMyriad spirits come to pay homage,\nThe floating light ascends thrice,\nThe Thunderclap safeguards for a hundred generations.\"\n\nWhen finished, draw in the lotus qi three times and cease. Then recite the *Jade Scripture*. When finished, intone again:\n\"The Supreme Mystery gathers its radiance,\nCrowning the Fusang Dawn,\nThe Great Constancy transforms its light,\nIn an instant merging and dividing,\nEntering my Five Palaces,\nSteadying my Jade Root,\nTwin chariots of the Supreme Unity,\nJoining wings to wheel aloft,\nAscending with me,\nRevolving through the Golden Gate,\nYears sharing the sun’s virtue,\nBody treasured as a Golden Immortal,\nGeneration upon generation flourishing,\nTrue talismans flowing unbroken,\nMystery upon mystery layered through the ages,\nNames inscribed in the Numinous Pavilion,\nFeathered registers in the Purple Court,\nIncense wafting, smoke ascending,\nFortune reaching a hundred branches,\nBlessings overflowing the Imperial Gate.\"\n\nRecite the *Daoist Scripture of the Lord of the Diagram, the Jade Lord of the Myriad Flowers, the Master of the Lesser Existence’s Jade Perfection*. While doing so, visualize the Three Primordial Elder Lords—Laozhangshang—and the Orthodox Unity’s Left Immortal—Zhongchengzi—and Right Immortal—Quwenzi. The true qi of these three spirits, merging into clouds of yellow, white, and mysterious hues, enters from your Mud-Pill Palace and descends together to suffuse your philtrum.\n\nThen intone the subtle incantation:\n\"The Jade Perfected engenders the Imperial Light,\nMyriad Flowers ride the clouds forth,\nThree Elders assist the Two Immortals,\nTogether guarding the cavern of death’s gate,\nSpirits illumine the Seven Flowers’ birth,\nRotten bones receive renewal and shedding,\nTranscending the Three Realms’ courts,\nThe Five Sufferings all released,\nAttaining the Nine Heavens’ outer bounds,\nAscending to illumine the Lofty Vermilion Sun.\"\n\nWhen finished, draw in the three-colored clouds three times and cease. Then recite the *Jade Scripture*. When finished, intone again the subtle incantation:\n\"The Gate of Life unites with essence,\nSix merge and seven divide,\nThe Supreme Unity holds the register,\nThe Controller of Life orders the spirit,\nThe Imperial Unity secures the form,\nWu Ying guards the hun,\nTai Jiong’s Purple Chamber,\nReceiving the talisman from the Imperial Lord,\nThe womb’s tree felled and extinguished,\nThe blood’s root severed and cut,\nThe Seven Mysteries arise anew,\nSinking light gives birth to mist,\nYou ascend and transform,\nUniting with the Imperial Dawn,\nBody illumined by sun and moon,\nLife linked with Heaven,\nLayered flowers accumulate radiance,\nAll gathering in the Supreme Honor,\nGenerations inscribed in the Numinous Register,\nPurple records proclaimed within,\nRiding the light of the Three Primordials,\nFeasting in the Northern Loftiness,\nNamed as Immortal King,\nPerfected Person of the Supreme Clarity.\"\n\nRecite the *Daoist Scripture of the Lord of Prohibitions, the Twenty-Nine Perfected Earls of the Mysterious Prefecture and the Supreme Emperor*. While doing so, visualize the true qi of the Central Mystery’s Unity Elder—Lao Zixufu—like a yellow cloud, suffusing the tip of your yin organ; the true qi of the Northern Black Emperor’s Guardian—Baochehe—like a mysterious cloud, suffusing your bladder; the true qi of the Western White Emperor’s Manifest Peace—Xing—like a plain cloud, suffusing your scrotum; the true qi of the Southern Crimson Emperor’s Eternal Awareness—Jue—like a crimson cloud, suffusing your mouth and tongue; and the true qi of the Eastern Azure Emperor’s Carved Beam—Ji—like a blue-green cloud, suffusing your Five Viscera. The true qi of the Five Emperors enters from your Mud-Pill Palace and descends to suffuse your entire body.\n\nWhen finished, intone the subtle incantation:\n\"The Five Emperors illumine the Perfected,\nAssisting the Perfected Earls of the Mysterious,\nThe Supreme Emperor’s radiant light,\nExhaling numinosity to spread its seat,\nVeil upon veil of spirit’s brilliance,\nWandering through layered depths,\nFeathered light safeguards the record,\nThe Supreme Unity commands the register,\nFive qi gather the hun,\nThree essences secure the po,\nGolden Immortals refine their countenance,\nHalt the years and return to youth,\nUproot the hidden roots,\nSun and moon share the same dwelling.\"\n\nWhen finished, draw in the five-colored qi five times and cease. Then recite the *Jade Scripture*. When finished, intone again:\n\"The Supreme Treasure’s Nine Perfected of the Moon,\nThe sun’s brilliance transforms the Jade Chamber,\nInhaling and exhaling the Purple Tenuity,\nThe Great Merger of the Imperial Unity,\nEight mists arise in profusion,\nA hundred spirits manifest their majesty,\nNine hun separate and unite,\nThree Lights share their radiance,\nThe Heavenly Sovereign abides in the Primordial,\nPurple mist swirls and billows,\nFive spirits receive the diagram,\nThe original destiny remains unbroken,\nTransforming to enter the Nine Palaces,\nClad in vermilion robes,\nGirded with tiger-seal pendants,\nSashed with embroidered cloud-streamers,\nCanopied with beaded curtains,\nFive colors swirling and lingering,\nSun and moon illuminating and inspecting,\nFlanking east and west,\nThe spirit’s court within distills sweet dew,\nTo dispel thirst and hunger,\nThree and Five return anew,\nRevolving the hidden mechanism,\nCirculating through the Supreme Unity,\nLife equalizing the Two Modes.\"\n\nThe Hidden Writ of Jade Purity further intones:\nThe Great One transforms the Six Harmonies,\nFive spirits nourish the Mud-Pill Palace,\nSeven accumulations extinguish the Three Paths,\nBlood-corpses block the Lower Pass,\nThree collars face the Imperial Perfected,\nSevering the roots of the womb-tree,\nThe Venerable One is styled Spirit Ancestor,\nOf one heart with the Primordial Plain Lord,\nThe Heavenly Sovereign enters the Grand Clarity,\nFive Elders present the talismanic writ,\nGeneration upon generation ascends the Feathered Palace,\nDouble Flowering in the sun’s central chariot,\nThe Primordial King first illumines essence,\nFirming my root-life gate,\nProtecting and assisting the flow of green qi,\nReturning to the Upper Valley and Lower Mystery,\nMysterious radiance □ spirit and form,\nAscending to the wheel of the Grand Supreme,\nSun and moon join the jade collar,\nYears divide with the twin luminaries,\nCinnabar script within the Jade Hall,\nRanked as Lord of Heaven Above,\nTo the left grasping the Feathered Terrace Lad,\nTo the right lifting the Golden Countenance Immortal.\n\nRecite the *Dawn-in-Utter-None Lord’s Engraved Scripture of Mount Emei’s Grotto Palace Jade Portal Primordial Lord*, contemplating:\nImperial Minister Engraver of Essence in the Crimson Palace,\nCentral Radiance of the Central One in the Firm Crimson Palace,\nYellow Court Assistant Minister Returning to Upper Clarity—\nThree spirit-perfected qi,\nMerging azure, white, and yellow clouds,\nEntering from your Mud-Pill Palace,\nDescending to suffuse your body’s Three Palaces and root-life imperial chamber.\n\nConcluding, softly intone:\nThree Perfected engender Utter-None,\nJade Portal reflects the dawn glow,\nPrimordial Void of the Grand Plain,\nCinnabar numen thick upon Scarlet Mound,\nReturning spirit to the Ninefold Repository,\nInner chant unfurls jeweled blossoms,\nHundred Passes receive the fluid elixir,\nProlonging years with the Three-Flowered Bough,\nMy body soars to Jade Purity,\nSeven ancestors depart the Dark Capital,\nEver preserving beyond kalpas’ end,\nTen thousand generations inherit the immortal lineage.\n\nConcluding, draw in the three-colored cloud-qi, swallowing thrice. Then halt.\n\nProceed to recite the Jade Scripture. Upon completion, further intone:\nImperial Unity merges the Nine Mysteries,\nGrand Plain’s Five-Flowered Essence,\nPrecious plumes feast in the Jade Hall,\nEight Winds fan the Grand Luminance,\nExalted One rides the Primordial Radiance,\nTreading the flourishing numinous,\nSeven transformations descend to the Purple Chamber,\nNine mergers purify the Five Emperors,\nBody generates six-hued brilliances,\nGolden radiance flows through spirit-form,\nPerceiving the bathing of primordial qi within,\nGolden script in the Jade Emperor’s court.\n\nThe Hidden Writ of Jade Purity further intones:\nNuminous clouds first divide,\nWhite qi billows in plainness,\nMerging the Nine Mysteries,\nThree and Five flow and spread,\nImperial Unity releases form,\nTranscending to ascend the celestial path,\nGreat One breathes,\nFive Flowers consolidate,\nLife-Master governs the sun’s zenith,\nWhite Prime rules the moonlit night,\nMidday stills the heart,\nHeart’s mystery wondrously awakens,\nEvening retreats to the Mud-Pill Palace,\nHundred spirits proclaim,\nTwo Palaces may attain long life,\nHeart and brain may endure forever.\n\nRecite the *Scripture of the Nine Numinous True Immortal Mother of the Azure Gold Elixir Sovereign Lord of Western Origin and Tortoise Mountain*, contemplating:\nThe Great Grotto’s Imperial Unity Honored Lord Father reposes in true qi,\nFive-colored purple cloud-smoke,\nEntering from your Mud-Pill Palace,\nDescending to suffuse your singular form,\nDispersing qi through the nine apertures.\n\nConcluding, softly intone:\nNine Numinous penetrate wondrous transformation,\nGolden Immortals merge at Fusang,\nImperial Unity transforms the hundred spirits,\nUniting numen with the Western Cinnabar Sovereign,\nAbove styled Womb Immortal Mother,\nBelow titled Spirit Ancestor,\nRadiant splendor transcends cloud-tips,\nSoughing in the Purple Tenuity Palace,\nFor me wielding the register of life,\nPreserving truth in the Three Plain Chambers,\nWondrous radiance descends from the void,\nRefining me to revert to infancy,\nSeven ancestors sever the source of suffering,\nLeisurely transcend the Nine Felicity Halls.\n\nConcluding, draw in the purple cloud-qi, swallowing thrice. Then halt.\n\nProceed to recite the Jade Scripture. Upon completion, further intone:\nGrand Supreme Grotto Illumination,\nFlying radiance of the Nine Origins,\nCongealing essence, condensing qi,\nTransforming qi, transmuting spirit,\nLife-Master merges and blends,\nDispersing form into myriad parts,\nThousand chariots of fiery armor,\nTen thousand riders brandish banners,\nAll joining the Great One,\nAscending to become Imperial Immortals,\nEldest None-Rising Paces,\nSecond Accomplished Curved Writ,\nFirst merging my qi,\nSecond merging my spirit,\nThird merging my po,\nFourth merging my hun,\nFifth merging my essence,\nSixth merging my body,\nMy body six-merged,\nGrotto numen reveals truth,\nEight Radiant Empty Chariots,\nThree Plain Floating Wheels,\nI and the Imperial Unity,\nTogether ascend Jade Dawn,\nDouble Flowering layered branches,\nMerging with Heavenly Immortals,\nBody holds the Dao register,\nGenerations possess life’s root,\nGolden tablets, feathered talismans,\nName inscribed in the sun’s chariot,\nWishes instantly fulfilled,\nHeavenly emolument abundant,\nDesires as the heart directs,\nTen thousand blessings fill the gate,\nEver abiding with the Grand Supreme,\nImperial Unity in the Mud-Pill Palace,\nFeminine and masculine merge and transform,\nHundred spirits entwine,\nReciting scripture ten thousand times,\nCloud chariots come to welcome,\nFeasting with the Five Emperors,\nNine Lords of Sun and Moon,\nStyled as Immortal Elder,\nPerfected One of the Grand Clarity.\n\nThe Hidden Writ of Jade Purity’s Nine Heavens’ Upper Text,\nIssuing from the Highest Oral Instructions,\nDissolving stagnation, dispersing resentment,\nThe Thirty-Nine Chapters of the Great Grotto True Scripture,\nTheir principles culminate herein.\nAbove, they summon the radiance of exalted numina,\nBelow, they extinguish the misfortunes of ten thousand demons.\nExcerpted from the *Secret Essentials*, Forty-Second Yang Character Section.\n\nReciting once opens the thirty-nine gates of the Dark Pass,\nReceiving jade nectar,\nDead qi sinks and obstructs,\nHundred spirits rejoice within,\nHundred spirits thus unobstructed,\nVoices reach the Nine Mysteries,\nQi brightens the Purple Empyrean,\nEchoes knock at Jade Dawn,\nFive Emperors gird their sashes,\nMyriad numina attend the chariot,\nLife upon life comes to return,\nSeven ancestors ascend and transmigrate,\nBody attains feathered wings,\nRiding radiance, mounting clouds,\nSoaring through Jade Purity,\nRank equal to the Purple Guest,\nThis is the wondrous Dao of the Exalted Mystery,\nThe secret篇 of Jade Purity.\nExcerpted from the *Secret Essentials*, Forty-Second Yang Character Section.\nAll confer golden names and jade characters,\nHighest Immortal Perfected Ones.\nWithin seven hundred years,\nThose whose quality accords may receive a single transmission.\n\nLater Sages say: Upon receiving the *Thirty-Nine Chapters of the Great Grotto True Scripture* and practicing its cultivation,\nFirst perform the Great Grotto’s rites and protocols,\nRecite the Hidden Writ of Jade Purity,\nFurther contemplate the hundred spirits’ inner names,\nExternally blocking the ten thousand trials,\nInternally sealing the death pass.\nThus, one recitation suffices for a day and night.\nReciting the thirty-nine chapters alone,\nWithout the need to repeatedly follow the original ritual protocols.\nIf one intends to ascend the fast and recite the scripture again the next day,\nThen once more follow the original procedure.\n\nShould one wish to traverse the Five Marchmounts, to wander and observe the myriad mountains, to preserve life and halt the whitening of hair, to safeguard longevity through kalpas of years—yet not yet desire to soar aloft and depart far from the world—then on the days of the Great Year-Star, one’s own life-star, and the Eight Seasonal Nodes, one may simply recite the *Hidden Writ of Jade Purity*, inwardly contemplating the hundred spirits once through, without need to recite the *Jade Scripture*. After a hundred such recitations, qi will ascend to mingle with the dawn clouds, and the hundred spirits will coil within. After a thousand recitations, the Three Primes will descend, one’s name will be inscribed in the Emperor’s register, and one will long preserve the sun and moon, matching the years of heaven and earth. After ten thousand recitations, the Dao will be perfected: one will ride clouds and mount dragons, roam the Great Void, and lead the host of immortals. This Dao is lofty and wondrous; guard it well and do not reveal it to the untrue.\n\nThe *Purple Text, Cinnabar Chapters, Green-Character Hidden Writ*—one hundred twenty words—is the qi of the Nine Heavens above, congealed from the essence of purple radiance, formed into natural chapters that manifest within the Jade Purity Palace. Its text shines resplendent, illuminating the Highest Clarity, enabling the exalted to inscribe its brushstrokes and penetrate its hidden sounds, thereby upholding the Jade Abode, commanding the Nine Heavens, governing and wielding numinous power, summoning perfected ones and inspecting spirits. It was originally the token worn by the Celestial King of Primordial Beginning, transmitted to the Jade Purity Emperor-Lord, the Great King Who Dispels Demons, and the Jade Purity Divine Numinous King, along with twenty-four Jade Lads and Jade Maidens who attend the text, correcting lapses and negligence, and guarding the bodies of those who bear the text.\n\nOne who bears this text becomes equal in perfection to the Nine Heavens, one’s name is inscribed on the Cinnabar Terrace, one’s rank is aligned with the Highest Mystery, one’s body emits purple light, and one’s neck bears a halo of perfect clarity. Roaming the Great Void, the ten realms will welcome one in attendance; the Three Primes will descend, and one will feast together in the cloud-borne chariots of the heavens. To practice the Dao of divine transcendents and recite the *Highest Jade Purity Hidden Writ of the Great Grotto True Scripture*, one should sit upon a square zhang of space, the heart illumined by the *Purple Text, Cinnabar Chapters*. In the left hand, grasp the flowing-gold fire-bell; in the right, wield the *Huoluo* of the Seven Primes. Then the Jade Void will descend unbidden, the Great Grotto will open its gates without knocking, the ten thousand perfected will respond to the moment and gather, and the host of demons will bind themselves and perish. Directing the eight qi, revolving the five celestial bodies, one sits and commands the ten thousand spirits, employs and governs the host of immortals, qi merging with the Highest Void, form equaling the Purple Guest.\n\nThe secret mysteries of the Nine Heavens, the hidden writ of Jade Purity—should one leak these chapters, the body will be scourged by the wind-knife, and accountability will extend to the Seven Ancestors. The trials of life and death shall be as the oaths of the Nine Heavens. Those whose golden names and jade characters are arrayed in the charts of the Nine Heavens, who are deemed worthy to behold this text, shall take three feet of crimson-woven silk as ground, inscribe the cinnabar chapters upon the silk with purple brush, and present ninety feet of purple-woven silk, a golden fish, and a jade dragon. Proceeding to the master, purify oneself for ninety days, face north, and swear an oath to the Nine Heavens before transmission. The disciple shall receive it in a brocade pouch, wearing it over the heart.\n\nThose who bear the *Purple Text, Cinnabar Chapters* shall have ranks aligned with the Highest Mystery; those who receive the *Jade Purity Hidden Writ* shall have ranks aligned with the Great Perfected. In sitting, rising, sleeping, and resting, they shall ever intertwine with the Jade Void, the Jade Flower shall guard the perfected at their left and right, and the Five Thearchs shall hover near the sleeping chamber. One must not mingle with the common and vulgar, nor defile the exalted perfected. To violate this is to invite the departure of spirits and the approach of demons, to be scourged and lose one’s immortality.\n\nWhen bearing the *Purple Text, Cinnabar Chapters*, whether entering or exiting, resting or sleeping, or at the time of practicing the Dao, one should always first contemplate one’s body suffused with purple radiance, darkly veiled above, qi swirling around the body. Then knock the teeth nine times and invoke:\n\n*\"Ninefold Jade Void, eightfold purple radiance coiled,\nDark light layered, Jade Purity spills its essence.\nPurple text, cinnabar writ, manifesting the Nine Heavens,\nCommanding the ten thousand spirits, summoning and employing the host of immortals.\nMight subduing the myriad myriads, inspecting and shearing the thousand thousands.\nEcho and shadow instantly gather, five clouds emit smoke.\nFlying chariots and purple canopies swiftly arrive before me.\nMay I ride the void, ascend the Jade Dawn.\"*\n\nConclude by drawing in the purple qi twelve times and swallowing it. After nine years of this, a canopy of purple clouds will shine and cover one’s body, one’s body will generate purple light illuminating the ten directions, one will communicate with spirits and summon the perfected, and one will penetrate and observe the Great Void.\n\nOf old, the Lady of the Upper Prime transmitted the hidden writ to the Jade Maiden of Great Harmony; the Jade Maiden of Great Harmony transmitted it to the Lord of Young Yang. When the Lord of Yang perfected the Dao and ascended the void, he sealed the text within the grotto-chamber of the Nine Doubts, where it shall be transmitted after seven hundred years to those whose truth accords and whose mystery is penetrated. Later students who cultivate with devotion shall naturally feel the resonance if they are predestined.\n\n*The Highest Jade Purity Hidden Writ of the Great Grotto True Scripture for Destroying Demons and Cultivating Divine Wisdom of the High Mystery* concludes.\n\nExplanation of Pronunciation:\n*Xi* (檄) is pronounced *qiao*.\n\nPronunciation Guide:\n*Yu* (嵎) is pronounced *jū* (俱-cut).\n*Ji* (畿) is pronounced *qí* (渠-xī-cut).\n*Shū* (摅) is pronounced *chū*.\n*Cēn* (参) is pronounced *shēn* (疏-zhēn-cut); *cī* (差) is also pronounced *yí*.\n*Miǎo* (杪) is pronounced *miǎo*.\n*Pí* (罴) is pronounced *bān-mí*.\n*Xiǎo* (皛) is pronounced *jiǎo*.\n*Yǎn* (弇) is pronounced *yī-jiǎn*.\n*Xiáng* (降) in \"subdue\" is pronounced *háng*.\n*Bīn* (斌) is pronounced *nín*.\n*Jīn* (巾) in the upper register is pronounced *jìn*.\n*Sān* (三) in the third instance is read in the level tone.\n*Yù* (昱) is pronounced *yù*.\n*Mì* (幂) is pronounced *mò-dí*.\n#1 The character *qū* (曲) was originally written as *diǎn* (典).",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真高上玉清隐书经 经名：洞真高上玉清隐书经。 简称《玉清隐书》。 撰人不详，约出於东晋。 系早期上清派重要经典。 原本有四卷八篇，后分作四种。 即：《上清太上玉清隐书灭魔神慧高玄真经》三篇； 《上清高上灭魔玉帝神慧玉清隐书》三篇； 《上清高上灭魔洞景金元玉清隐书经》一篇； 《上清高上金元羽章玉清隐书经》一篇。 底本出处：《正统道藏》正一部。 上清太上玉清隐书灭魔神慧高玄真经 神经出自高上大洞口诀，隐书天地万精之音，以传玉清消魔王神霄玉清王，制魔召真，匡检万灵。 太上以上宫玉女、金仙玉童各二百七十人，典香拂尘，侍卫神文，秘於太上三元紫房之内，六合宫中。 玉清帝君逍遥洞清之上，晏景龙山，时引高圣玉清之宾，消魔大神神霄玉清王，曲寝琼瑶之内，金花之房，清斋三年，披诵高上高玄真丈，神奇出於自然，妙旨朗於十方，高韵落落，玉翰瑛瑛，神秀华庭，焕耀太空，八帝齐景，五老翼真，玄始映朗，天元敷陈，伏兽攘据，猛马奔惊，大帅仗旛，罗骑亿千，检魔摄邪，檄落万灵，山海静波，三光合明。 於是帝君乃自弹景龙云璈，百和合唱，琼响太虚，萧条流清，玉音激炁，八风交真於中天，五华罗仙於四嵎，神啸启於琳琅之关，妙韵发於大洞之机。 尔乃命北寒金台龙华玉女，郁萧明、定云敷、安延昌、飞四渠等，合歌高上洞神之诗，灭魔招真之曲#1，其词曰： 偶景策飞盖，迅辔浮八清。 整控启丹衢，流盻宴云营。 协神飘津波，褰趾步寒庭。 龙翰跃玉质，羽服翠紫軿。 超凌六领台，纷纷落凤城。 携提神霄王，高会太上京。 仰披三素房，长烟洒八溟。 至道趣兰阙，缥缈虚上生。 绝峰通妙观，太晖朗玉清。 积勤感太素，谁测形与名。 待劫未终旦，倏欻肇万龄。 冥运自有会，安知天地倾。 乘我自生运，策景涉北元。 流霄随我回，飞盖荫绿辕。 高登四明阙，华琼秀金门。 神晖洞兰峰，三景焕已分。 结朗始生炁，八会坦幽源。 落落玄汉初，太阳协朝晨。 灵化四盖庭，妙畅法亦全。 运理自然道，郁若高上文。 千祆无贾生，检制天魔群。 玄会大洞野，采精掇日魂。 含精炼丹房，长保无终桩。 回辇寝丹房，默想念高玄。 闲寂无尘累，盼目霄中宾。 凝神标九领，连更续长烟。 三烛朗太晖，绝空中生真。 秀景曜玉州，协神整华年。 幽遘应冥会，眇眇逐景迁。 万感自启运，良谋亦有津。 玉帝理灵襟，萧萧九重天。 独步冥领峰，从怀在无间。 自无高仙韵，蹑彼亦何绿。 道藏金极章，宝我玉清篇。 太虚洞玄清，清中生玄微。 碧云绕丹房，绝宇曜紫晖。 抗足万津波，玄步登玉扉。 八风鼓高峰，云万何凄凄。 龙凤呜九霄，禽籁唱何悲。 灵境无崖际，四顾皆空垂。 莽莽天汉涂，飘飘上清畿。 冥据应感会，玄寂真人怀。 数来劫自运，理极神自归。 明诵高上文，密求反华颓。 转诗以招真，神慧变天威。 制命合玄符，握节征太微，妙觉无凝塻，廓然灵关开。 并景反寂辕，高超绝岭飞。 玄栖重虚馆，静想高神回。",
      "translated_text": "**The Supreme Cavern-Perfect Jade-Pure Hidden Writings of the Highest Dao**\n\n**Scripture Title:** *The Supreme Cavern-Perfect Jade-Pure Hidden Writings of the Highest Dao* (abbreviated as *The Jade-Pure Hidden Writings*). Author unknown, approximately composed during the Eastern Jin dynasty. A foundational scripture of the early Shangqing tradition. Originally comprising four scrolls and eight chapters, later divided into four texts:\n\n1. *The Supreme Cavern-Perfect Jade-Pure Hidden Writings: Scripture of the Divine Wisdom of the High Mystery for Subduing Demons* (three chapters);\n2. *The Supreme Highest Jade-Pure Hidden Writings of the Jade Emperor’s Divine Wisdom for Subduing Demons* (three chapters);\n3. *The Supreme Highest Jade-Pure Hidden Writings of the Golden Prime and Cavern-Luminance for Subduing Demons* (one chapter);\n4. *The Supreme Highest Jade-Pure Hidden Writings of the Golden Prime and Feathered Chapters* (one chapter).\n\n**Source Text:** *Daoist Canon of the Orthodox Tradition*, Zhengyi Section, Part One.\n\n---\n\n### *The Supreme Cavern-Perfect Jade-Pure Hidden Writings: Scripture of the Divine Wisdom of the High Mystery for Subduing Demons*\n\nThis divine scripture emerges from the oral formulas of the Supreme Great Cavern, concealing the celestial and terrestrial sounds of the myriad essences. It was transmitted to the Jade-Pure King of Divine Radiance, the Subduer of Demon Kings, to command demons and summon perfected beings, thereby rectifying and restraining the myriad spirits.\n\nThe Most High, accompanied by two hundred and seventy jade maidens of the Upper Palace and two hundred and seventy jade lads of the Golden Immortals, attends to incense and dust-whisks, guarding the divine texts in secret within the Three Primes’ Purple Chamber of the Most High, in the Palace of the Six Harmonies.\n\nThe Jade-Pure Lord of the Imperial Sovereign roams above the Cavern-Perfect, feasting on the Dragon Mountain of Radiant Scenery. At times, he invites the exalted guests of the Jade-Pure, the Great Divine Subduer of Demons, the Jade-Pure King of Divine Radiance, to recline in the chambers of jasper and jade, the golden-flowered abode. After a three-year purification fast, he unfolds and recites the *Supreme High Mystery’s Perfect Text of the Lofty Mystery*. Its divine marvels arise spontaneously; its wondrous purport illumines the ten directions. Its lofty cadences resound clearly; its jade brushstrokes gleam like crystal. The numinous splendor adorns the flowery court, blazing across the Great Void. The Eight Emperors align their visions; the Five Ancients flank the perfected. The Primordial Beginning shines forth; the Celestial Prime unfolds in full. Tamed beasts crouch in submission; fierce steeds bolt in terror. The Great Marshal brandishes his banners; a hundred million cavalry array in ranks. Demons are restrained, and evil spirits seized; proclamations disperse the myriad spirits. Mountains and seas grow still; the Three Luminaries merge in brilliance.\n\nThereupon, the Imperial Lord himself plucks the *Cloud-Zither of the Dragon Mountain of Radiant Scenery*. A hundred harmonies join in chorus; jade tones resonate through the Great Void. The desolate and pure flow forth; jade sounds stir the *qi*. The Eight Winds converge with the perfected at the Central Heaven; the Five Florals array the immortals at the Four Extremities. Divine whistles arise from the gates of jade and jasper; wondrous melodies issue from the mechanism of the Great Cavern.\n\nThen he commands the Jade Maidens of the Dragon-Flower Terrace of the Northern Frigid Golden Platform—Yu Xiaoming, Ding Yunfu, An Yanchang, Fei Siqu, and others—to join in singing the *Poems of the Supreme Cavern Spirits* and the *Melodies for Subduing Demons and Summoning the Perfected*. Their lyrics declare:\n\n> By paired radiance, we urge our flying canopies,\n> Swift reins float through the Eight Pures.\n> We adjust our reins to open the cinnabar thoroughfare,\n> Casting glances to feast in the cloud encampments.\n> Harmonizing with the divine, we drift on the waves of the ford,\n> Lifting our steps to tread the frigid court.\n> Dragon pennants leap with jade substance,\n> Feathered robes trail in kingfisher and purple hues.\n> Soaring beyond the Six Ridge Terraces,\n> In profusion we descend upon the Phoenix City.\n> Escorting the Divine Radiance King,\n> We ascend to the grand assembly in the Supreme Capital.\n> Gazing up, we part the Three Simplicities’ chambers,\n> Long mists scatter across the Eight Seas.\n> The Perfect Dao hastens to the Orchid Palace,\n> Ethereal, it arises from the Void above.\n> Towering peaks connect to wondrous visions,\n> The Great Splendor illumines the Jade-Pure.\n> Accumulated diligence moves the Primordial Simplicity—\n> Who can fathom its form or name?\n> Awaiting the kalpa’s unended dawn,\n> In an instant, the myriad ages commence.\n> The dark workings have their own convergence—\n> How could one know the heavens and earth would overturn?\n> Riding the destiny of self-arising,\n> We urge our radiance to traverse the Northern Prime.\n> Flowing auroras follow our return,\n> Flying canopies shade the verdant axles.\n> Ascending the Fourfold Brightness Gates,\n> Flowering jasper adorns the Golden Portal.\n> Divine radiance penetrates the Orchid Peaks,\n> The Three Luminaries shine forth, already distinct.\n> Congealing clarity to generate *qi*,\n> The Eight Assemblies lay bare the hidden sources.\n> Vast and boundless, the Primordial Han begins,\n> The Great Yang harmonizes with the morning court.\n> The numinous transforms the Four Canopy Courts,\n> The wondrous flows unimpeded, the Dharma complete.\n> The Dao of natural principle unfolds,\n> Luxuriant as the Supreme Highest Texts.\n> A thousand demons cannot be bargained into life—\n> They are restrained, the demonic hordes of heaven.\n> The Primordial Assembly roams the Great Cavern wilds,\n> Gathering essences to pluck the sun’s soul.\n> Containing the essence, refining in the cinnabar chamber,\n> Eternally preserved without end.\n> Turning the chariot to rest in the cinnabar chamber,\n> Silently contemplating the High Mystery.\n> Leisurely and still, free from worldly dust,\n> Gazing upon the guests of the auroral realm.\n> Concentrating the spirit to mark the Nine Ridges,\n> Linking watches to continue the long mists.\n> Three candles illumine the Great Splendor,\n> The Void’s extremity gives birth to the perfected.\n> Radiant scenery gleams over the Jade Continent,\n> Harmonizing the spirit to order the flowery years.\n> The hidden encounter responds to the dark convergence,\n> Faint and distant, it follows the shifting radiance.\n> Myriad inspirations arise of themselves—\n> Good counsel, too, has its ford.\n> The Jade Emperor governs his numinous heart,\n> Whispering through the Ninefold Heavens.\n> Alone, I tread the dark ridge peaks,\n> My thoughts dwelling in the spaceless.\n> Without the High Immortal’s cadence,\n> How could I tread there, and why seek the green?\n> The Dao’s treasury holds the Golden Ultimate Chapters,\n> Treasuring my Jade-Pure Stanzas.\n> The Great Void penetrates the Mysterious-Perfect,\n> Within purity, the Mysterious Subtle arises.\n> Azure clouds encircle the cinnabar chamber,\n> The distant realm gleams with purple radiance.\n> Raising my feet over the myriad ford-waves,\n> With mysterious steps, I ascend the jade portals.\n> The Eight Winds drum the lofty peaks,\n> How mournful the ten thousand clouds!\n> Dragons and phoenixes cry in the Nine Auroras,\n> What sorrow in the birds’ songs!\n> The numinous realm has no bounds,\n> On all sides, emptiness hangs.\n> Vast and boundless, the Milky Way’s path,\n> Drifting, drifting, to the Shangqing precincts.\n> The dark abode responds to the convergence of resonance—\n> The Perfected One’s heart holds the Mysterious Stillness.\n> Counting the kalpas as they unfold,\n> Principle’s extremity returns the spirit of itself.\n> Reciting aloud the Supreme Highest Texts,\n> Secretly seeking to reverse the withered blossoms.\n> Turning the poems to summon the perfected,\n> Divine wisdom transforms Heaven’s might.\n> Issuing commands in accord with the Mysterious Talismans,\n> Grasping the tally to march upon the Supreme Subtle.\n> Wondrous awakening knows no obstruction,\n> The vast numinous barrier opens.\n> Merging radiance to return to the tranquil axle,\n> Soaring high beyond the ridge’s flight.\n> Mysteriously dwelling in the layered Void’s halls,\n> In stillness, I contemplate the return of the lofty spirit.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1141,
      "start_sentence": 0,
      "end_sentence": 64,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.123570680618286,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上玉清隐书灭魔神慧高玄真经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "歌毕，於是帝君即命五老上真，请高上大洞灭魔神慧高玄真经玉清隐书，〔盛〕以云锦之囊，封以启天之章，付仙都左公掌录琼宫，以玉华之女、金晨玉童各三十七人，执巾典香，侍卫神文。 依四极明科，七百年一传，自无玄名帝图，刻简来生，金骨玉髓，挺命合仙，不得参闻。 其道高妙，故曰隐书，太上所宝秘，不传於下世。 轻泄灵文，身负风刀，万代被殃。 高上神经，皆上表高真之秘讳，下载天地万精之音，以招仙灭魔，通理幽关。 皆出高上口诀，以施大洞真经，上宰注笔，太一拂筵，玉郎撰目，天妃结篇，五帝集校，以成灵文。 五老监试，左仙辅真，太华典香，金晨扬烟，神奇发逸，玉慧洞明，灵化威乎天地，文翰焕乎上清，发口则声参太微，高上遥唱。 诵之一遍，则九天骇听，玉帝礼音，万真监庭，群凶灭景，天魔摧倾。 行此之道，则炁达清霄，泽布九津，拔度七祖，更生上天。 以标神经之妙贵，可谓难可载胜焉。 凡修回风混合大洞真经三十九章，皆当先诵高上灭魔神慧一遍，以灭试招真，通理三关，惠整形骸，令兰炁布津，万神定位，调畅玉声，炁和响清，乃诵妙章，金音朗彻於高上，妙旨凄粲於十方，则皇老遥监於丹苦，三元记勒於紫房，拔七祖於幽涂，度更胎於南仙，生死享其祚福，荣美流於种亲。 其道秘妙，不得妄宣，轻泄灵音，身没河源，七祖谢责，结罪幽山，九天禁书，非真勿传。 大洞灭魔神慧玉清隐书 玄景散天湄，清汉薄云回。 妙炁焕三晨，丹霞曜紫微。 清天舒灵彩，流霄何霏霏。 神灯朗长更，离罗吐明晖。 四岭带高云，悬精荫八垂。 三素启高虚，兰阙披重扉。 金墉映玉清，灵秀表天畿。 风生八会宫，猛兽骋云驰。 纷纷三洞府，真人互参差。 上有干景精，冥德高巍巍。 太一务犹收，执命握神麾。 正一履昌灵，摄召万神归。 公子翼寂辕，洞阳卫玄机。 明初合道康，龙舆正徘徊。 七景协神王，飙轮万杪阶。 体娇玄津上，飞步绝岭梯。 披锦入神丘，璨璨振羽衣。 冥摅交云会，飞景承神通。 清峰无毫荟，绮合生绝空。 金华带灵軿，翼翼高仙翁。 万辔承虚散，蓊蔼玄上窗。 中生合景君，九帝昌上皇。 明轮映黄宁，羽珠曜玄阳。 天精元素炁，中五号养光。 结朗始生神，九真合成双。 妙景启冥数，顺感标神踪。 泥丸洞元光，运珠正绛宫。 元阳部命门，三神携紫童。 拘制招上归，夹阙侍明窗。 翳郁对启明，圆华焕三冲。 方盈引接生，反老回婴蒙。 飙粲丽九天，天绿绕丹房。 萧萧缠霭表，曲降寝华堂。 游宴盻万变，归会神霄王。 仙道乐子生，鬼道乐子凶。 但闻贵生道，不闻鬼道隆。 谣歌参天炁，贾生无正章。 神慧命朱兵，五帝符寒乡。 仗旛摄万魔，琼文检北酆。 体解自然道，妖灭非尔功。 泛晨鼓长扇，含灵庆霄峰。 俯盻四谢飞，天劫永难终。 妙中生真景，回辇苦迟迟。 意合在冥感，携提高上猗。 翔翅期妙会，洞观情转悲。 啸咤咄嗟顷，倏欻历九围。 摄炁反交初，并景幽玄栖。 於是七精停曜，重关洞开，百阳激电，五星奔移，握节命灵，是炁悉追，铁熊罗遮，猛虎变威，六师斩妖，铜头捕非，玃天啖毒，晶消摧，万精灭种，六天崩颓，三道正行，何炁不回，山河为之倾倒，日月为之弇晖，灵兽为之堕领，金翅为之落飞，五帝束带於神宇，万灵受对於太微，高上泛盖於丹崖，八景策驾於霄扉，观洞源之妙化，欣我道以坦怀。",
      "translated_text": "Upon the song’s conclusion, the Lord Emperor thereupon commanded the Five Venerable Perfected Ones to request the *Supreme Highest Great Cavern Demon-Quelling Divine Wisdom Lofty Mystery True Scripture* and the *Jade Clarity Concealed Writ*, encasing it in a cloud-brocade pouch and sealing it with the *Heaven-Opening Seal*. He entrusted it to the Left Duke of the Immortal Capital for transcription within the Jeweled Palace, assigning thirty-seven Jade Flower Maidens and thirty-seven Golden Dawn Jade Lads to hold the towels and tend the incense, guarding the divine text.\n\nIn accordance with the *Bright Statutes of the Four Poles*, it is transmitted once every seven hundred years, reserved solely for those whose names are inscribed in the *Mystery-Free Imperial Register* from former lives—those of golden bones and jade marrow, whose destiny aligns with transcendence—never to be heard by the uninitiated. Its Way is lofty and wondrous, hence called the *Concealed Writ*, treasured and kept secret by the Most High, never passed to the lower worlds. To recklessly divulge its sacred text is to incur the wind-blade’s judgment, bringing calamity for ten thousand generations.\n\nThe *Supreme Divine Scripture* bears the secret taboo names of the exalted perfected above and records the sounds of heaven, earth, and the myriad spirits below, employed to summon immortals and quell demons, to unseal the gates of the hidden. All derive from the oral instructions of the Supreme Highest, applied to the *Great Cavern True Scripture*. The Supreme Lord wields the brush to inscribe it; the Great One sweeps the mat; the Jade Youths compile the passages; the Heavenly Consorts weave the chapters; the Five Emperors collate and proofread, thus completing the numinous text.\n\nThe Five Venerable Ones oversee the trial; the Left Immortals assist the perfected; the Great Flower tends the incense; the Golden Dawn stirs the smoke. Divine marvels arise in abundance; jade wisdom illumines the profound. Its numinous transformation wields power throughout heaven and earth; its literary splendor shines upon the Highest Clarity. When uttered, its voice resonates with the Supreme Subtle; its lofty chant echoes afar. To recite it once is to startle the Nine Heavens into listening, to move the Jade Emperor to reverent response, to summon the myriad perfected to attend the court, to extinguish the host of malevolent forces, and to topple the demon kings of heaven. Practicing this Way, one’s *qi* ascends to the pure empyrean, spreading blessings across the nine ford-crossings, redeeming the seven ancestors, and rebirthing them in the heavens above.\n\nSuch is the wondrous and precious nature of this divine scripture—its excellence is beyond all reckoning. Whenever one cultivates the *Great Cavern True Scripture of Returning Wind and Blending Harmony* in its thirty-nine chapters, one must first recite the *Supreme Highest Demon-Quelling Divine Wisdom* once, to dispel trials and summon the perfected, to unseal the three barriers, to gracefully restore the bodily form, to cause orchid-*qi* to suffuse the ford-crossings, to settle the myriad spirits in their proper places, to harmonize the jade voice, and to attune the *qi* until its resonance is pure. Only then may one recite the wondrous verses, their golden tones ringing clear in the Supreme Highest, their sublime purport gleaming radiantly across the ten directions. Thus do the August Elders remotely oversee the cinnabar trials; the Three Primes inscribe the records in the Purple Chamber; the seven ancestors are rescued from the dark paths; rebirth is granted in the Southern Immortal Realm. Life and death partake of its blessings; glory and beauty flow to one’s kindred. Its Way is profoundly secret—it must not be recklessly proclaimed. To carelessly reveal its divine sounds is to drown in the river’s source, to incur the seven ancestors’ reproach, to bind one’s sins in the dark mountains. The *Nine Heavens’ Forbidden Writ* is not to be transmitted to the unworthy.\n\n---\n\n**The Jade Clarity Concealed Writ of the Great Cavern Demon-Quelling Divine Wisdom**\n\nThe dark radiance scatters at heaven’s edge,\nThe clear Han thins as clouds drift back.\nWondrous *qi* illumines the Three Dawns,\nCinnabar clouds blaze upon the Purple Tenuity.\nThe pure heavens unfurl their numinous splendor,\nThe flowing empyrean—how misty and vast!\nThe divine lamp shines through the long night,\nThe Net of Separation exhales its bright glow.\nFour peaks gird the towering clouds,\nSuspended essence shades the eight directions.\nThe Three Primes open the lofty void,\nOrchid pavilions part their layered gates.\nGolden ramparts mirror Jade Clarity,\nNuminous beauty marks the celestial precincts.\nWinds arise in the Eight Convergence Palaces,\nFierce beasts gallop through the clouds.\nIn the bustling Three Cavern Courts,\nThe perfected mingle in profusion.\nAbove dwell the Dry Radiance Essences,\nTheir hidden virtue towering and majestic.\nThe Great One gathers the affairs of care,\nGrasping destiny, wielding the divine banner.\nThe Orthodox Unity treads the flourishing numen,\nSummoning and gathering the myriad spirits.\nThe Noble Scion flanks the tranquil axle,\nThe Cavern Yang guards the mystery’s pivot.\nAt the bright dawn, the Way harmonizes with peace,\nThe dragon chariot lingers in measured circuit.\nThe Seven Radiance align with the Spirit Kings,\nThe whirlwind wheels traverse the ten-thousand-treed stair.\nEmbodied grace ascends the dark ford,\nSoaring steps transcend the ridge’s ladder.\nDonning brocade, one enters the divine mounds,\nResplendent, the feathered robes shimmer.\nMysteriously communing in clouded assembly,\nFlying radiance bears the divine penetration.\nThe pure peaks bear no trace of brush,\nWondrous confluence arises in the boundless void.\nGolden flowers gird the numinous chariot,\nThe soaring immortals, wing upon wing.\nTen thousand reins disperse into the empty,\nLush and misty, the dark upper casement.\nWithin arises the Blended Radiance Lord,\nThe Nine Emperors exalt the Supreme August.\nThe bright wheel reflects the Yellow Tranquility,\nThe feathered pearls gleam in the Dark Yang.\nThe celestial essence of primordial *qi*,\nThe Central Five are called the Nurturing Light.\nLuminous coalescence gives birth to the spirit,\nThe Nine Perfected unite as one.\nWondrous radiance reveals the hidden reckoning,\nFollowing resonance, it marks the divine traces.\nThe Muddy Pellet cavern glows with primordial light,\nThe moving pearl aligns with the Crimson Palace.\nThe Primordial Yang governs the Gate of Destiny,\nThe Three Spirits escort the Purple Youths.\nRestraining and summoning, they return above,\nFlanking the gates to attend the bright casement.\nLush and dense, they face the Morning Star,\nThe round flower blazes through the Three Thoroughfares.\nThe square fullness draws forth and receives life,\nReversing age to return to infant simplicity.\nThe whirlwind’s brilliance adorns the Nine Heavens,\nThe heavenly green encircles the cinnabar chamber.\nHowling winds coil beyond the mists,\nCurving descent to repose in the flowery hall.\nRoaming and feasting, gazing upon ten thousand transformations,\nReturning to assemble before the Spirit Empyrean King.\nThe immortal Way delights in the child’s life,\nThe ghostly Way delights in the child’s doom.\nOne hears only of the Way that honors life,\nNever of the ghostly Way’s exaltation.\nChants and songs mingle with the celestial *qi*,\nThe merchant’s son lacks the proper verses.\nDivine wisdom commands the Vermilion Troops,\nThe Five Emperors’ talismans chill the northern wastes.\nBrandishing banners, they capture the myriad demons,\nThe jade writs restrain the Northern Feng.\nThe Way of spontaneous dissolution—\nNot your merit that the demons are destroyed.\nThe dawn’s drum resounds with the long fan,\nAll beings rejoice upon the empyrean peak.\nLooking down upon the four flights of thanksgiving,\nThe heavenly tribulation shall never end.\nWithin the wondrous arises the true radiance,\nThe returning chariot lingers in sorrowful delay.\nIntent harmonizes in hidden resonance,\nLifting and guiding the Supreme Highest’s grace.\nSoaring wings await the wondrous assembly,\nGazing into the cavern, the heart turns sorrowful.\nWith a whistle, a sigh, a sudden cry—\nIn an instant, one traverses the nine enclosures.\nGathering *qi*, returning to the primal exchange,\nMerging radiance to dwell in the dark mystery.\n\nAt this, the Seven Essences halt their shining,\nThe layered gates open wide,\nA hundred yangs surge like lightning,\nThe five stars hasten in their courses.\nGrasping the tally, commanding the spirits,\nAll *qi* is summoned and pursued.\nIron bears array in ambush,\nFierce tigers transform their might.\nThe Six Masters behead the demons,\nThe Bronze Heads seize the transgressors.\nThe Heavenly Apes devour poison,\nThe Crystal Shields shatter and crumble.\nThe myriad spirits are annihilated,\nThe Six Heavens collapse and topple.\nThe Three Ways are rectified—\nWhat *qi* does not return?\nMountains and rivers are overturned,\nSun and moon dim their light.\nDivine beasts drop their manes,\nThe Golden Wings cease their flight.\nThe Five Emperors gird their sashes in the divine precincts,\nThe myriad spirits receive judgment in the Supreme Subtle.\nThe Supreme Highest floats its canopy above the cinnabar cliffs,\nThe Eight Radiance urge their chariots at the empyrean gates.\nBeholding the wondrous transformations of the cavern’s source,\nI rejoice in my Way, my heart at ease.",
      "overlap_context": "d blossoms.\n> Turning the poems to summon the perfected,\n> Divine wisdom transforms Heaven’s might.\n> Issuing commands in accord with the Mysterious Talismans,\n> Grasping the tally to march upon the Supreme Subtle.\n> Wondrous awakening knows no obstruction,\n> The vast numinous barrier opens.\n> Merging radiance to return to the tranquil axle,\n> Soaring high beyond the ridge’s flight.\n> Mysteriously dwelling in the layered Void’s halls,\n> In stillness, I contemplate the return of the lofty spirit.",
      "start_char": 1142,
      "end_char": 2425,
      "start_sentence": 65,
      "end_sentence": 125,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 51.11375284194946,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上玉清隐书灭魔神慧高玄真经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "大洞高玄真人曰：欲登高座，披诵《大洞真经三十九章》，当先平坐，正视北向，叩齿三十二通，闭眼思己身着九色羽衣龙文之帔，头冠玉晨之冠，手执九色之节，青龙侍左，白虎卫右，头荫华盖，下坐狮子，仙童侍香，玉女散华，紫云蓊郁，满於堂宇，五色玄黄，罗列前后，内外分明，皆使映朗，便诵灭魔神慧隐书一篇。 诵毕，又闭眼默念，心拜四方，口引东方青阳之精青炁九咽，使充布肝腑之中； 次口引南方丹灵之精赤炁三咽，使充布心腑之中； 次口引西方金魂之精白炁七咽，使充布肺腑之中； 次口引北方玄曜之精黑炁五咽，使充布肾腑之中； 次口引中央高皇之精黄炁十二咽，使充布脾腑之中。 咽五方都毕，微祝曰： 五炁混生，玄上之精，充布五府，六管鲜明，内灌外逸，表裹俱清，灭秽招真，我飞太灵，常对高晨。 诵大洞真经毕，便振左手三过，法掷流铃，振右手七过，法掷豁落七元。 次仰头，次摇颈九过，法承天。 次鼓脚一过，法震灵。 摇身二七过，以欢万神。 次拭目三过，明三光。 次捻鼻七过，通明梁。 次捻眉后两门三过，塞邪源。 次轮身三周，开天窗。 次咽液九过，服玉津。 一身都毕，万神皆欢，调声正炁，乃诵玉章，微咒曰： 承天履地，出入洞门，左振流铃，右掷七元，带金佩玉，仙衣纷纷，八景罗列，策舆乘云，万徧朗达，飞入帝晨。 毕，乃平坐诵经。 此大洞之妙格，俯仰之仪，使庠序得法，则高上盻目，三元降席，万灵朝礼，天魔降伏，五苦咸解，七祖受福，神凤来翔，云龙踊跃，众仙称善於高虚，五老刻名於帝录。 凡修上道，披诵灵章，而不行此法，亏忽天仪，於俯伏不足，则为北帝鬼神所笑，三官所罚，群妖试败，身丧无益。 故违道者易，修道者难也。 得其仪格，将有飞腾之阶级也。 大洞消魔神慧内祝隐文 读高上虚皇君道经，当思太微小童干景精真之炁，赤色焕焕，从兆泥丸中入，下布兆身舌本之下，血液之府。 毕，微祝曰： 真炁下流充幽关，镇神固精塞死源，玉经惠朗通万神，为我致真命长存，拔度七祖反胎仙。 毕，引赤炁三咽止。 便读经，经毕，又祝曰： 天有大隐生之宝，称曰明梁之上炁，守我绝塞之下户，更受生牢门之外。 乃又召益元之羽童，列于绿室之轩，使解七祖百结，随风离根，配天迁基，达变入玄。 玉清隐文又祝曰： 元炁非本生，五涂承灵出，雌雄寄神化，森罗邃幽郁，玉音响太和，万唱无中发，仙庭回九变，百混同得一，易有合虚中，俱入帝堂室。 毕。 此高上内祝秘文，泄之七祖充责。 读上皇玉虚君道经，当思太一尊神务犹收真炁，紫色爓爓，从兆泥丸中入，下布兆玉枕之下泥丸之后户。 毕，微祝曰： 太一保命，固神定生，为我上招帝真之炁，下布紫户之庭，玉经仰彻，九元朗明，七祖同欢，俱升上清。 毕，引紫炁三咽止。 便读玉经，经毕，又祝曰： 兆身常死关，结胎害百神，百神解胎结，披散胞内根，七世入帝室，一体合神仙，神仙会玉堂，七祖生南宫，并带理明初，同席孩道康，万真守身形，是日藏初明，帝一回雌雄，保镇百神门，闭塞万邪户，受事九宫间，典禁召司命，三日朝泥丸。 读皇上玉帝君道经，当思帝君逢陵梵真炁，紫光郁郁，从兆泥丸中入，下布两眉中间紫户之外宫。",
      "translated_text": "The High and Mysterious Perfected of the Great Cavern says: When one wishes to ascend the high seat and recite the *Thirty-Nine Chapters of the Perfect Scripture of the Great Cavern*, one must first sit upright, face due north, and strike the teeth thirty-two times. Closing the eyes, one visualizes oneself clad in a nine-colored feathered robe adorned with dragon patterns, wearing the Jade Dawn crown, and holding a nine-colored tally. A green dragon attends on the left, a white tiger guards on the right; a floral canopy shades the head, and one sits upon a lion. Immortal youths attend with incense, jade maidens scatter blossoms; purple clouds billow thickly, filling the hall, while five-colored hues of dark and yellow array before and behind, both within and without, all made radiant and clear. Then one recites the *Hidden Writ of Divine Wisdom for Vanquishing Demons*.\n\nUpon completion, one closes the eyes and silently intones, bowing in the heart to the four directions. From the mouth, one draws the essence of the green *qi* of the Eastern Azure Yang, swallowing nine times to fill and suffuse the liver’s palace. Next, one draws the essence of the red *qi* of the Southern Cinnabar Spirit, swallowing three times to fill and suffuse the heart’s palace. Then, one draws the essence of the white *qi* of the Western Metal Soul, swallowing seven times to fill and suffuse the lungs’ palace. Next, one draws the essence of the black *qi* of the Northern Mysterious Radiance, swallowing five times to fill and suffuse the kidneys’ palace. Finally, one draws the essence of the yellow *qi* of the Central Lofty Sovereign, swallowing twelve times to fill and suffuse the spleen’s palace.\n\nWhen the *qi* of the five directions has been swallowed in full, one softly intones:\n*\"The five *qi* blend and arise,\nThe essence of the Mysterious Highest,\nFilling the five palaces,\nThe six conduits gleam bright.\nWithin they irrigate, without they overflow,\nBoth surface and interior are purified.\nBanishing filth, summoning the true,\nI soar to the Supreme Numinous,\nEver facing the Highest Dawn.\"*\n\nAfter reciting the *Perfect Scripture of the Great Cavern*, one shakes the left hand three times, ritually casting the Flowing Bell. Then one shakes the right hand seven times, ritually casting the Seven Origins of the Vast and Open. Next, one lifts the head, then sways the neck nine times, in accord with the celestial pattern. Then one stamps the foot once, in accord with the numinous tremor. One sways the body fourteen times to gladden the myriad spirits. Next, one wipes the eyes three times to brighten the Three Luminaries. Then one pinches the nose seven times to illumine the Bright Beam. Next, one presses the two gates behind the brows three times to block the source of evil. Then one wheels the body three times to open the Heavenly Window. Finally, one swallows saliva nine times to ingest the Jade Fluid.\n\nWhen the entire body’s rites are complete, the myriad spirits all rejoice. Harmonizing the voice and rectifying the *qi*, one then recites the Jade Chapters, softly intoning:\n*\"Bearing heaven, treading earth,\nEntering and exiting the cavern’s gate,\nLeft hand shaking the Flowing Bell,\nRight hand casting the Seven Origins.\nGirded with gold, adorned with jade,\nImmortal robes fluttering,\nThe Eight Radiance arrayed,\nUrging the chariot to ride the clouds.\nTen thousand circuits, all luminous and penetrating,\nI fly into the Emperor’s Dawn.\"*\n\nThereupon, one sits upright and recites the scripture.\n\nThis is the wondrous pattern of the Great Cavern, the proper form of reverent movement. If the ritual sequence is performed correctly, the Highest will cast its gaze upon one; the Three Origins will descend to the seat; the myriad spirits will come to pay homage; heavenly demons will submit; the Five Sufferings will all be dissolved; the seven ancestors will receive blessings; divine phoenixes will come soaring; cloud-dragons will leap and dance. The host of immortals will praise one in the High Void, and the Five Elders will inscribe one’s name in the Emperor’s Register.\n\nFor all who cultivate the Supreme Way and recite the numinous chapters yet fail to perform these rites, the celestial forms are deficient and incomplete. Such negligence is insufficient for prostration and submission, and one will be mocked by the Ghostly Gods of the Northern Emperor, punished by the Three Officials, tested and thwarted by the host of demons, and perish to no avail. Thus, to transgress the Dao is easy, while to cultivate it is difficult. Only by attaining its proper forms and patterns can one ascend the steps to flight and transcendence.\n\n**Hidden Writ of Divine Wisdom for Vanquishing Demons Within the Great Cavern**\n\nWhen reciting the scripture of the Highest Lord of the Jade Void, one must visualize the true *qi* of the Lesser Lad of the Grand Tenuity, the essence of the Dryness-Spirit, glowing red, entering from the mud-pill of one’s own crown and descending to fill the root of the tongue, the palace of blood and fluids. Then one softly intones:\n*\"True *qi* flows downward to fill the hidden pass,\nStabilizing the spirit, securing essence, sealing the source of death.\nThe Jade Scripture’s wisdom illumines, communicating with the myriad spirits,\nFor me it summons the true destiny to abide long,\nDelivering the seven ancestors to revert as womb-born immortals.\"*\n\nThereupon, one draws the red *qi* and swallows it three times to conclude. Then one recites the scripture. Upon completion, one intones again:\n*\"Heaven holds the great hidden treasure of life,\nCalled the *qi* above the Bright Beam.\nGuard my sealed gate below the absolute barrier,\nAnd receive anew the outer gate of the prison of birth.\"*\n\nThen one summons the Feathered Lad of Augmented Origin to array before the pavilion of the Green Chamber, causing him to untie the hundred knots of the seven ancestors, to drift with the wind and leave their roots, to match heaven in shifting their foundation, and to enter the mysterious through transformation.\n\nThe hidden writ of the Jade Clarity further intones:\n*\"Primal *qi* is not originally born,\nThe five paths bear the numinous forth.\nMale and female entrust the spirit to transformation,\nThe forest of stars, profound and dark, billows thickly.\nThe Jade Tone resounds with Supreme Harmony,\nTen thousand chants arise from the midst of nothingness.\nThe immortal court revolves through nine changes,\nThe hundred blends all attain the One.\nChange holds union within the void,\nTogether they enter the Emperor’s hall and chamber.\"*\n\nThis is the secret inner writ of the Highest. Should it be divulged, the seven ancestors will bear the blame.\n\nWhen reciting the scripture of the Jade Emperor of the Supreme Sovereign, one must visualize the true *qi* of the Venerable Duty of the Most Honored Unity, glowing purple, entering from the mud-pill of one’s own crown and descending to fill the Jade Pillow below, the rear gate of the mud-pill. Then one softly intones:\n*\"The Most Honored Unity preserves destiny,\nStabilizing the spirit and settling life.\nFor me it summons above the *qi* of the Emperor’s true,\nBelow it fills the courtyard of the Purple Gate.\nThe Jade Scripture, gazed upon, penetrates,\nThe Nine Origins shine bright.\nThe seven ancestors rejoice together,\nAll ascending to the Highest Clarity.\"*\n\nThereupon, one draws the purple *qi* and swallows it three times to conclude. Then one recites the Jade Scripture. Upon completion, one intones again:\n*\"My body is the ever-dying pass,\nThe womb’s knot harms the hundred spirits.\nWhen the hundred spirits untie the womb’s knot,\nThe roots within the placenta scatter.\nSeven generations enter the Emperor’s chamber,\nOne body unites with the divine immortals.\nDivine immortals gather in the Jade Hall,\nThe seven ancestors are born in the Southern Palace.\nTogether they wear the initial clarity of governance,\nSharing the seat of the child’s Way of health.\nThe myriad perfected guard the body’s form,\nOn this day they conceal the initial brightness.\nThe Emperor’s One revolves male and female,\nPreserving and guarding the gates of the hundred spirits.\nSealing the myriad evil portals,\nReceiving office in the Nine Palaces,\nOverseeing the summons of the Controller of Destiny,\nThrice daily attending the mud-pill.\"*\n\nWhen reciting the scripture of the Jade Emperor of the Supreme Sovereign, one must visualize the true *qi* of the Imperial Lord Fengling, glowing purple and lush, entering from the mud-pill of one’s own crown and descending to fill the space between the brows, the outer palace of the Purple Gate.",
      "overlap_context": "oes not return?\nMountains and rivers are overturned,\nSun and moon dim their light.\nDivine beasts drop their manes,\nThe Golden Wings cease their flight.\nThe Five Emperors gird their sashes in the divine precincts,\nThe myriad spirits receive judgment in the Supreme Subtle.\nThe Supreme Highest floats its canopy above the cinnabar cliffs,\nThe Eight Radiance urge their chariots at the empyrean gates.\nBeholding the wondrous transformations of the cavern’s source,\nI rejoice in my Way, my heart at ease.",
      "start_char": 2426,
      "end_char": 3698,
      "start_sentence": 126,
      "end_sentence": 168,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.2542359828949,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上玉清隐书灭魔神慧高玄真经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "毕，微咒曰： 帝君度符籍，正气召万神，上招玉真炁，充布两眉间，混一生帝景，三素成我仙，飙粲乘飞盖，径升高上轩。 毕，引紫炁三咽止。 便读玉经，经毕，又祝曰： 扶晨始晖生，紫云映玄阿，焕洞圆光蔚，晃朗惧耀罗，眇眇灵景元，森洒空青华，九天馆玉宾，金房唱霄歌，贤哉对帝宾，役召伯幽车，七祖解胞根，世世为仙家。 玉清隐文又祝曰： 丹皇运珠，守镇死门，上一赤子，玄帝凝天，一名伯无上，亦为三元先，扶我亦养我，使我登云轮，常坐上清轩，七玄为仙君。 读上皇先生紫晨君道经，当思左无英公子玄充叔真炁，玉光奕奕，从兆泥丸中入，下布兆左腋之下肝之后户。 毕，微祝曰： 无英神真生紫皇，三炁混合成宫商，招引真炁镇膀胱，通流三丹会洞房，为我致仙变丹容，飞升云馆入金墉。 毕，引玉光三咽止。 便读玉经，经毕，又祝曰： 神安炁洞，上与天通，越出地户，过度天门，隐息四维，七星散分，飞行阴房，日月植根，守金藏玉，制御万神，仙王何人，我已成真，隐存雌雄，洞一四乡，结中青炁，号为延昌，字曰和婴，理命永长，玄归固内，庆玄牢张，我日成真，飞仙云京。 读太微天帝君道经，当思右白元洞阳君真炁，金光耀耀，从兆泥丸中入，下布兆右腋之下肺之后户。 毕，微祝曰： 洞阳郁灵宝魂生，金光焕焕炁中精，招真固神令长生，拔出幽根返胎婴，骖晨御炁升玉清。 毕，引金光三咽止。 便读玉经，经毕，又微祝曰： 洞阳郁灵标，守体死户门，开出三尸虫，受入九真源，解胞散滞血，百节生正神，七祖灭尸祸，拔殖后叶患，黑炁斌来生，斫断胞死根，上世受道德，后来获帝仙，帝仙是何人，明明七叶孙，乃祖入丹都，并坐精上门。 读三元紫精君道经，当思中央司命丈人君真炁，紫云之色爓爓，从兆泥丸中入，下布兆绛宫心房之中。 毕，微祝曰： 司命定年，丈人保仙，度名於南宫，上奏帝君前，世世为仙王，拔出七叶根，福报无穷已，皆是玉经言。 毕，引紫云炁三咽止。 便读玉经，经毕，又祝曰： 会元三襟交，携领回胎婴，承光守下关，务玄待月明，於是混离固钥，明车受成，福延七世，祸散玄生，守景六合，陵梵七灵，共生亿千，欻升玉庭，婴儿徘徊，羽衣命仙，吉济万万，福布千千，骨有玉映，血承琼泉，生乐天地，日月同年。 玉清隐文又祝曰： 福布七玄前，罪灭三徒中，灵吹九晨杪，纳炁太帝宫，五仙携太一，并立重冥空，遂隐上清室，羽明帝一房。 读真阳元老玄一君道经，当思命门桃君孩道康真炁，黄云之色，从兆泥丸中入，下布兆脐中命门之外。 毕，微祝曰： 真灵正神，号曰桃君，混合生宫，守护命门，通仙致炁，齐景宝云，七祖同生，受福高晨。 毕，引黄云之炁三咽止。 便读玉经，经毕，又微祝曰： 五岳真人，定录四宾，司录促到，护籍理民，道康握节，云拘报旛，香风八被，恶魔绝烟，并来对帝，万万称臣，度我生籍，名迁玉门，扶翼五符，镇护波尘。 玉清隐文又祝曰： 太上时非子，一曰合精延，是为命门王，可以召万神，万神即时到，合会琼羽门，使令散祸，祸绝福连，上寝玉堂，世受名仙。 读上元太素三元君道经，当思泥丸天帝上一赤子真炁，炁如宝光，从兆泥丸中入，下布泥丸九孔之户。",
      "translated_text": "Upon completion, softly intone the incantation:\n\"The Imperial Lord transmits the talismanic registers,\nUpright *qi* summons the myriad spirits.\nAbove, it calls forth the Jade Perfected *qi*,\nFilling and spreading between the brows.\nMerging as one to generate the Emperor’s radiance,\nThe Three Primes perfect my transcendence.\nSwift and radiant, I ride the soaring canopy,\nAscending directly to the loftiest pavilion.\"\n\nUpon completion, draw in the purple *qi* and swallow it thrice to conclude.\n\nThen recite the Jade Scripture. When finished, offer this prayer:\n\"Supporting the dawn’s first glow,\nPurple clouds illumine the dark slopes.\nResplendent, the circular light flourishes,\nDazzling and bright, it shines through the gauze.\nSubtle and distant, the numinous radiance’s origin,\nLush and scattered, the azure’s splendor.\nThe Nine Heavens’ halls host jade guests,\nGolden chambers resound with celestial hymns.\nVirtuous indeed, facing the Emperor’s guests,\nCommanding the dark chariots of the summoned lords.\nSeven ancestors untie the root of the womb,\nGeneration upon generation, they become immortals’ kin.\"\n\nThe Hidden Writ of Jade Clarity offers this further prayer:\n\"The Cinnabar Sovereign revolves the pearl,\nGuarding and stabilizing the Gate of Death.\nAbove, the One Crimson Child,\nThe Mysterious Emperor congeals in heaven.\nOne name: Lord of No Above,\nAlso the Primordial of the Three Origins.\nSupporting and nurturing me,\nEnabling my ascent upon the cloud-wheel,\nEver seated in the Upper Clarity’s pavilion,\nThe Seven Mysteries as Transcendent Lords.\"\n\nWhen reciting the Scripture of the Supreme Sovereign Purple Dawn Lord, visualize the true *qi* of the Left Non-Bearing Duke, Master Xuanchong, its jade light luminous and flowing, entering from the mud-pill of your crown and descending to fill the space beneath your left armpit, the posterior gate of the liver.\n\nUpon completion, softly intone:\n\"The Non-Bearing Divine Perfected engenders the Purple Sovereign,\nThe Three *Qi* merge and harmonize into palace tones.\nSummoning and guiding the true *qi* to stabilize the bladder,\nFlowing through the Three Cinnabar Fields to meet in the Grotto Chamber,\nTransforming my cinnabar countenance to attain transcendence,\nSoaring to the cloud pavilions and entering the Golden Wall.\"\n\nUpon completion, draw in the jade light and swallow it thrice to conclude.\n\nThen recite the Jade Scripture. When finished, offer this prayer:\n\"Spirits settled, *qi* pervading,\nAbove, in communion with heaven.\nTranscending the earthly gate,\nPassing through the celestial portal.\nConcealing breath in the four directions,\nThe Seven Stars disperse and divide.\nFlying through the Yin Chamber,\nSun and moon plant their roots.\nGuarding gold and treasuring jade,\nCommanding and restraining the myriad spirits.\nWho is the Transcendent King?\nI have already attained perfection.\nConcealing and preserving the feminine and masculine,\nPervading the four quarters in unity.\nBinding the central azure *qi*,\nNamed ‘Prolonging Prosperity,’\nStyled ‘Harmonious Infant.’\nGoverning destiny for eternal duration,\nThe Mysterious returns to the inner fortress,\nCelebrating the expansion of the Dark Enclosure.\nThis day I perfect my truth,\nSoaring as an immortal to the Cloud Capital.\"\n\nWhen reciting the Scripture of the Heavenly Emperor of Grand Tenuity, visualize the true *qi* of the Right White Prime, Lord Dongyang, its golden light radiant and gleaming, entering from the mud-pill of your crown and descending to fill the space beneath your right armpit, the posterior gate of the lungs.\n\nUpon completion, softly intone:\n\"Dongyang’s numinous treasure flourishes the spirit’s life,\nGolden light shines resplendent within the *qi*’s essence.\nSummoning the true to secure the spirit, ensuring longevity,\nExtracting the dark root to return to the womb’s infancy.\nHarnessing the dawn’s *qi*, I ascend to Jade Clarity.\"\n\nUpon completion, draw in the golden light and swallow it thrice to conclude.\n\nThen recite the Jade Scripture. When finished, softly intone:\n\"Dongyang’s numinous standard,\nGuarding the body’s Gate of Death.\nOpening to expel the Three Corpses’ worms,\nReceiving the Nine Perfected’s origin.\nUntying the womb, dispersing stagnant blood,\nA hundred joints engender upright spirits.\nSeven ancestors extinguish the corpse’s calamity,\nEradicating the afflictions of descendants.\nBlack *qi* refines and generates,\nSevering the womb’s root of death.\nFormer generations receive the Dao’s virtue,\nLater ones obtain the Emperor’s transcendence.\nWho are these Emperor Transcendents?\nLuminous, the seven generations’ descendants.\nTheir ancestors enter the Cinnabar Capital,\nTogether seated at the Gate of Essence’s summit.\"\n\nWhen reciting the Scripture of the Three Origins Purple Essence Lord, visualize the true *qi* of the Central Controller of Destiny, the Venerable Lord, its color like purple clouds, blazing and brilliant, entering from the mud-pill of your crown and descending to fill the Crimson Palace within the heart.\n\nUpon completion, softly intone:\n\"The Controller of Destiny determines the years,\nThe Venerable Lord safeguards transcendence.\nConveying names to the Southern Palace,\nPresenting them before the Imperial Lord.\nGeneration upon generation as Transcendent Kings,\nExtracting the seven generations’ root.\nBlessings and recompense without end,\nAll as proclaimed in the Jade Scripture.\"\n\nUpon completion, draw in the purple cloud *qi* and swallow it thrice to conclude.\n\nThen recite the Jade Scripture. When finished, offer this prayer:\n\"Converging the Three Origins’ threefold embrace,\nEscorting and guiding the returned womb-infant.\nBearing the light, guarding the lower pass,\nAttending the Mysterious, awaiting the moon’s clarity.\nThereupon, merging and sealing the Li’s lock,\nThe bright chariot receives completion.\nFortune extends through seven generations,\nCalamity disperses, the Mysterious engenders.\nGuarding the radiance of the six directions,\nAscending the Brahma of the seven numina.\nTogether engendering billions and thousands,\nSuddenly ascending to the Jade Court.\nThe infant lingers,\nFeathered robes command transcendence.\nAuspicious aid by the myriad,\nFortune spreads by the thousand.\nBones reflect jade’s luster,\nBlood inherits the jasper spring.\nLiving in joy with heaven and earth,\nSharing the same years as sun and moon.\"\n\nThe Hidden Writ of Jade Clarity offers this further prayer:\n\"Fortune spreads before the Seven Mysteries,\nSins extinguish within the Three Paths.\nThe numinous breath of the Nine Dawns’ tips,\nAbsorbing *qi* into the Supreme Emperor’s palace.\nThe Five Transcendents escort the Great One,\nTogether standing in the profound and obscure void.\nThereupon, concealing themselves in the Upper Clarity’s chamber,\nFeathered brightness in the Emperor’s One’s abode.\"\n\nWhen reciting the Scripture of the True Yang Primordial Elder, the Mysterious One Lord, visualize the true *qi* of the Life Gate’s Peach Lord, the Child’s Way of Health, its color like yellow clouds, entering from the mud-pill of your crown and descending to fill the space outside the Life Gate within the navel.\n\nUpon completion, softly intone:\n\"The true and numinous upright spirit,\nNamed the Peach Lord.\nMerging and harmonizing the Palace of Life,\nGuarding and protecting the Life Gate.\nCommunicating transcendence and conveying *qi*,\nAligning with the radiance of precious clouds.\nSeven ancestors together live,\nReceiving fortune in the lofty dawn.\"\n\nUpon completion, draw in the yellow cloud *qi* and swallow it thrice to conclude.\n\nThen recite the Jade Scripture. When finished, softly intone:\n\"The Perfected of the Five Marchmounts,\nRecording and stabilizing the Four Guests.\nThe Recorder hastens their arrival,\nProtecting the registers and governing the people.\nThe Way of Health grasps the tally,\nClouds gather and report the banner.\nFragrant winds spread in eight directions,\nEvil demons vanish like smoke.\nAll come to face the Emperor,\nMyriad upon myriad, they acclaim as subjects.\nConveying my living register,\nMy name ascends to the Jade Gate.\nSupporting and winging the Five Talismans,\nStabilizing and guarding the dusty waves.\"\n\nThe Hidden Writ of Jade Clarity offers this further prayer:\n\"The Supreme’s time is not the child,\nOne day, it unites essence to prolong.\nThis is the King of the Life Gate,\nWho can summon the myriad spirits.\nThe myriad spirits arrive at once,\nConverging at the Gate of Jade Feathers.\nCommanding the dispersal of calamity,\nCalamity ceases, fortune connects.\nAbove, resting in the Jade Hall,\nGeneration upon generation, receiving the name of transcendence.\"\n\nWhen reciting the Scripture of the Supreme Prime Three Origins Lord, visualize the true *qi* of the Mud-Pill Heavenly Emperor’s Crimson Child, its *qi* like precious light, entering from the mud-pill of your crown and descending to fill the nine apertures of the mud-pill’s gate.",
      "overlap_context": "ding the gates of the hundred spirits.\nSealing the myriad evil portals,\nReceiving office in the Nine Palaces,\nOverseeing the summons of the Controller of Destiny,\nThrice daily attending the mud-pill.\"*\n\nWhen reciting the scripture of the Jade Emperor of the Supreme Sovereign, one must visualize the true *qi* of the Imperial Lord Fengling, glowing purple and lush, entering from the mud-pill of one’s own crown and descending to fill the space between the brows, the outer palace of the Purple Gate.",
      "start_char": 3698,
      "end_char": 4988,
      "start_sentence": 169,
      "end_sentence": 204,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.9905948638916,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上玉清隐书灭魔神慧高玄真经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "毕，微祝曰： 上元赤子号上真，飞云羽衣耀紫烟，上招明景对帝宾，宝光奕奕映我身，身生毛羽升九天。 毕，引宝光三咽止。 便读玉经，经毕，又祝曰： 童子景精，有神有威，合象三形，九道相推，衣服朱丹，步正参差，出入上元，太极内阶，知我者生，存我不衰，人无哭兆，恃赖辟非，欲知吾处，密问太微，太微玉帝，三圣徘徊，侠我左右，一合俱飞，混洞六府，日月齐晖。 玉清隐文祝曰： 九道转对，五老各宁，洞阳衔籍，号曰郁灵，七世父母，反胎更生，累业积罪，罪泄福生，上入帝堂，受书丹明，常与伯史原，徘徊三界庭，巾金佩羽，宝曜圆形，玉轮北回，役御朱兵。 读上清紫精三素君道经，当思绛宫中一元丹皇君真炁，日光之色，从兆泥丸中入，下布项中大椎骨首之户。 毕，微祝曰： 中一真君，号曰连珠，上招日光，灌我形躯，三真宝曜，固命玉符，寿亿万年，永无终休，身生羽服，飞升天衢。 毕，便引日光三咽止。 便读玉经，经毕，又祝曰： 天有九魂，不可不分，道有三真，不可去身，帝一变景，万化以臻，流珠停晖，紫霞踊烟，七度回络，三光映真，太上精符，相与为亲，司命衔月，嘘我重唇，五老衔日，吸我三便，太上道君，与我缠绵，上造天阶，携把太真。 读青灵阳安元君道经，当思命门下一黄庭元王真炁，月光之色，从我泥丸中入，下布两丸间车轴下户。 毕，微祝曰： 下一真元王，号曰始明精，三皇把符命，金契度仙庭，上招景中炁，炁布灌我形，羽车曜云罗，令我飞上清。 毕，便引月光三咽止。 便读玉经，经毕，又祝曰： 五藏百结，生此万疾，玄一林虚，开关解结，结绝病散，精神盈溢，福炁充明，祸翳倾竭，仙心日臻，死道月绝，混化九君，合符帝一，七神奉符，公子 入室。 读皇清洞真道君道经，当思泥丸九真帝君上皇真炁，青光万丈，从兆泥丸中入，下布口之四际。 毕，微祝曰： 九真始生，生於上元，号为先灵，三景各分，上招玄晖，布流四门，镇神保仙，拔度七玄，骖景乘浮，朝拜三元。 毕，引青炁三过止。 便读玉经，经毕，又祝曰： 七炁离罗，大混黄宁，六甲辅魂，内注六丁，三真入胃，液流太明，五符上皇，泥丸常生，九星下映，日每同軿，游盻八回，双盖华缨，上到紫房，披巾羽青，七世父母，各得反生。 读高上太素君道经，当思胆中八真合景君真炁，黄云之色，从兆泥丸中入，下布兆背中骨节之府。 毕，微祝曰： 八真结神，神生九天，号曰北台君，常在三合间，招真洞明炁，下流布我身，身生紫晖，与帝结亲，携契五老，太仙缠绵。 毕，引黄炁三咽止。 便读玉经，经毕，又祝曰： 生生得帝心，各会重户内，紫房混五神，魂魄恒宝贵，七关受仙辉，五藏充玉炁，俱过水火天，披建四和蔚，上归皇一子，与兆魂相对。 读皇上四老道中君道经，当思两肾七真玄阳君真炁，黑云之色，从兆泥丸中入，下布兆背穷骨地户中。 毕，微祝曰： 七真生帝景，八炁运常宁，上招日中童，圆珠映我形，回风混幽府，归妙大洞经，拔出地户难，超凌逸九天。 毕，引黑炁三咽止。 便读玉经，经毕，又祝曰： 太一郁书，上登洞房，六合三宾，司命神公，手执录籍，驾景乘龙，左回灵曜，右扇神风，峨峨隐珠，芬艳婴蒙，浩观太无，濯炼五通，澄魂羽幽，炼魄空洞，招兆百神，月常之功，七祖顺生，景福昌隆，回我老艾，还复玄童，上对神霄，金光十方，飞飙玉轮，弹金呜钟。",
      "translated_text": "Upon completion, softly intone this prayer:\n\"Supreme Prime’s Crimson Child, named Supreme Perfected,\nSoaring clouds and feathered robes gleam with purple mist.\nAbove, summoning luminous radiance to attend the Emperor’s guest,\nPrecious light, resplendent, illumines my form—\nMy body sprouts feathers and wings, ascending to the Nine Heavens.\"\n\nUpon completion, draw in the precious light and swallow thrice to conclude.\n\nThen recite the Jade Scripture. When finished, intone this further prayer:\n\"Luminous essence of the Divine Child,\nPossessing spirit and majesty,\nUniting the threefold image,\nNine Ways mutually advancing.\nVestments crimson and cinnabar,\nSteps measured yet unaligned,\nEmerging into the Supreme Prime,\nWithin the Inner Stair of the Great Ultimate.\nThose who know me live,\nThose who preserve me do not decay.\nPeople bear no omen of weeping,\nRelying on me to avert misfortune.\nShould you seek my abode,\nSecretly inquire of the Supreme Subtlety.\nThe Jade Emperor of the Supreme Subtlety,\nThree Sages lingering,\nFlanking me left and right,\nTogether we take flight as one,\nMerging the Six Palaces of Chaos,\nSun and moon shine in equal splendor.\"\n\nThe Hidden Writ of Jade Clarity offers this prayer:\n\"Nine Ways revolve in accord,\nFive Elders each at peace.\nCavern-Yang holds the register,\nNamed ‘Luxuriant Spirit.’\nSeven generations of parents,\nReturn to the womb and are reborn.\nAccumulated karma and sins,\nSins dissolve, fortune arises.\nAscending into the Emperor’s Hall,\nReceiving the script of cinnabar brightness.\nEver with the Earls of History,\nLingering in the Three Realms’ court.\nHeadscarves of gold, feathered pendants,\nPrecious luminosity, perfectly round.\nThe Jade Wheel turns northward,\nCommanding the Crimson Host.\"\n\nWhen reciting the Scripture of the Supreme Clarity’s Threefold Prime and Threefold Essence Lord, visualize the true *qi* of the Crimson Palace’s Primordial Cinnabar Sovereign, its hue like sunlight, entering from the mud-pill of your crown and descending to fill the great vertebral gate at the nape of your neck.\n\nUpon completion, softly intone this prayer:\n\"Central Primordial Perfected Lord,\nNamed ‘Linked Pearls,’\nAbove, summoning sunlight,\nBathing my form.\nThree Perfected, precious luminaries,\nSecuring the Jade Talisman of life.\nLongevity of a hundred million years,\nForever without end.\nMy body sprouts feathered robes,\nSoaring to the celestial thoroughfare.\"\n\nUpon completion, draw in the sunlight and swallow thrice to conclude.\n\nThen recite the Jade Scripture. When finished, intone this further prayer:\n\"Heaven possesses Nine Souls,\nWhich must not be divided.\nThe Way possesses Three Perfected,\nWhich must not leave the body.\nThe Emperor’s Unity transforms radiance,\nMyriad transformations thus attain completion.\nFlowing pearls pause their brilliance,\nPurple mist leaps with smoke.\nSevenfold revolutions entwine,\nThree Lights illumine the Perfected.\nThe Supreme’s essence-talisman,\nJoins with me in kinship.\nThe Controller of Life holds the moon,\nBreathing into my layered lips.\nFive Elders hold the sun,\nInhaling my threefold ease.\nThe Supreme Dao Lord,\nEntwines with me.\nAbove, ascending the celestial stair,\nHand in hand with the Supreme Perfected.\"\n\nWhen reciting the Scripture of the Azure Spirit’s Yang-Ancestral Primordial Lord, visualize the true *qi* of the Primordial Sovereign of the Yellow Court below the Life Gate, its hue like moonlight, entering from the mud-pill of your crown and descending to fill the gate beneath the axle between the two pills.\n\nUpon completion, softly intone this prayer:\n\"Lower Primordial Perfected Sovereign,\nNamed ‘Primal Luminous Essence,’\nThree August Ones grasp the talisman of life,\nGolden tally conveying to the transcendent court.\nAbove, summoning the *qi* within radiance,\nIts flow bathing my form.\nFeathered chariots gleam with cloudy gauze,\nCommanding me to soar to the Supreme Clarity.\"\n\nUpon completion, draw in the moonlight and swallow thrice to conclude.\n\nThen recite the Jade Scripture. When finished, intone this further prayer:\n\"Five viscera, hundred knots,\nGive rise to ten thousand ailments.\nMysterious Unity, Forest of Emptiness,\nUnlocks barriers and dissolves knots.\nKnots severed, illness scatters,\nSpirit and essence overflow.\nFortune-*qi* fills with brightness,\nCalamity’s shadows utterly exhausted.\nThe heart of transcendence daily advances,\nThe path of death monthly recedes.\nChaos transforms the Nine Lords,\nUniting talismans with the Emperor’s Unity.\nSeven spirits uphold the talisman,\nThe Duke’s son enters the chamber.\"\n\nWhen reciting the Scripture of the August Clarity’s Cavern-True Dao Lord, visualize the true *qi* of the Nine Perfected Sovereigns of the Mud-Pill’s Supreme August Lord, a radiance of ten thousand fathoms of azure light, entering from the mud-pill of your crown and descending to fill the four borders of your mouth.\n\nUpon completion, softly intone this prayer:\n\"Nine Perfected arise,\nBorn in the Supreme Prime,\nNamed ‘Primal Spirit.’\nThree Luminaries each distinct,\nAbove, summoning the dark radiance,\nIts flow filling the four gates.\nPacifying spirits, preserving transcendence,\nDelivering the Seven Mysteries.\nMounting radiance, riding the floating,\nPaying homage to the Three Primes.\"\n\nUpon completion, draw in the azure *qi* thrice to conclude.\n\nThen recite the Jade Scripture. When finished, intone this further prayer:\n\"Seven *qi* depart the net,\nGreat Chaos in Yellow Tranquility.\nSix Jia assist the soul,\nInternally infusing the Six Ding.\nThree Perfected enter the stomach,\nFluids flow into the Great Clarity.\nFive Talismans of the Supreme August,\nEver arising in the mud-pill.\nNine Stars descend in illumination,\nDaily in tandem with the sun’s chariot.\nGazing in eight directions,\nDual canopies of flowered tassels.\nAscending to the Purple Chamber,\nDonning azure feathered scarves.\nSeven generations of parents,\nEach attains rebirth.\"\n\nWhen reciting the Scripture of the Highest Supreme Prime Lord, visualize the true *qi* of the Eight Perfected Convergent Radiance Lord within the gallbladder, its hue like yellow clouds, entering from the mud-pill of your crown and descending to fill the palace of your spine’s vertebrae.\n\nUpon completion, softly intone this prayer:\n\"Eight Perfected knit the spirit,\nSpirit born in the Nine Heavens,\nNamed ‘Northern Terrace Lord,’\nEver abiding between the Three Conjunctions.\nSummoning the true *qi* of Cavern Clarity,\nIts flow descending to bathe my form.\nMy body generates purple radiance,\nJoining with the Emperor in kinship.\nHand in hand with the Five Elders,\nSupreme transcendence entwines.\"\n\nUpon completion, draw in the yellow *qi* and swallow thrice to conclude.\n\nThen recite the Jade Scripture. When finished, intone this further prayer:\n\"Life after life attains the Emperor’s heart,\nEach meeting within the layered gates.\nPurple Chamber merges the Five Spirits,\nHun and po ever precious.\nSeven Passes receive transcendent radiance,\nFive viscera fill with Jade-*qi*.\nTogether traversing the heavens of water and fire,\nDonning the Four Harmonies’ luxuriance.\nAbove, returning to the August Unity’s child,\nWith my soul facing yours.\"\n\nWhen reciting the Scripture of the August Supreme’s Four Elders of the Dao’s Central Lord, visualize the true *qi* of the Seven Perfected Mysterious Yang Lord within the two kidneys, its hue like black clouds, entering from the mud-pill of your crown and descending to fill the earthen gate of the hollow bone at the base of your spine.\n\nUpon completion, softly intone this prayer:\n\"Seven Perfected born in the Emperor’s radiance,\nEight *qi* perpetually in motion, ever at peace.\nAbove, summoning the Child of the Sun’s Center,\nRound pearls illumine my form.\nRevolving winds merge the Dark Palace,\nReturning to the wondrous Cavern Scripture.\nDelivered from the earthen gate’s trials,\nTranscending and soaring beyond the Nine Heavens.\"\n\nUpon completion, draw in the black *qi* and swallow thrice to conclude.\n\nThen recite the Jade Scripture. When finished, intone this further prayer:\n\"The Supreme Unity’s luxuriant script,\nAscends to the Cavern Chamber.\nSix Harmonies, Three Guests,\nController of Life, Divine Duke,\nHands holding the register,\nMounting radiance, riding the dragon.\nLeftward, revolving numinous luminaries,\nRightward, fanning the divine wind.\nTowering, concealed pearls,\nFragrant and resplendent, infant and youth.\nGazing upon the Great Vastness,\nBathing and refining the Five Penetrations.\nClarifying the soul’s feathered obscurity,\nRefining the po in emptiness.\nSummoning my hundred spirits,\nA monthly accomplishment.\nSeven ancestors follow in birth,\nRadiant fortune flourishes.\nReversing my aged years,\nRestoring the Mysterious Child.\nAbove, facing the Divine Empyrean,\nGolden light in ten directions.\nJade wheels in flying whirlwinds,\nStriking gold, sounding bells.\"",
      "overlap_context": " once,\nConverging at the Gate of Jade Feathers.\nCommanding the dispersal of calamity,\nCalamity ceases, fortune connects.\nAbove, resting in the Jade Hall,\nGeneration upon generation, receiving the name of transcendence.\"\n\nWhen reciting the Scripture of the Supreme Prime Three Origins Lord, visualize the true *qi* of the Mud-Pill Heavenly Emperor’s Crimson Child, its *qi* like precious light, entering from the mud-pill of your crown and descending to fill the nine apertures of the mud-pill’s gate.",
      "start_char": 4988,
      "end_char": 6343,
      "start_sentence": 205,
      "end_sentence": 242,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 50.05054450035095,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上玉清隐书灭魔神慧高玄真经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "读玉晨太上大道君道经，当思肺中六真上元素玉君真炁，白云之色，从兆泥丸中入，下布兆颈外十二间梁之中。 毕，微祝曰： 六真奕奕，白光央央，回帝之景，上入丹乡，招真下流，灌我玉浆，羽裙纷纷，衣我仙裳，越过水火，飞登神京。 毕，引白炁三咽止。 便读玉经，经毕，又祝曰： 九合三离，紫房散分，五老正严，帝一保神，司命奏籍，奉符三元，胞树断落，血尸绝根，反胎火朱，回炁泥丸，我合九清，大混百神，身登玉房，同軿金仙，逍遥太素，徘徊三天，重华列简，黑支流玄，世为道伯，大福缠绵，上寝玉清，下息命门，五藏秀华，项负日魂，长保劫龄，后天常全。 读太清大道君道经，当思脾中五真养光君真炁，如玉光金真之色，从兆泥丸中入，下布兆喉内极根之户。 毕，微祝曰： 五真散灵，布炁九玄，金光曜晖，玉炁吐津，万神并畅，熙怡我身，圆光奏命籍，太一勒九天，降致八景舆，策龙驾素烟，混合三帝室，保我亿劫年。 毕，引玉光三咽止。 便读玉经，经毕，又祝曰： 晨登九景台，夕入神霄门，太一神夫子，或曰三来瓮，左执兆符籍，右携洞阳君，定生会紫房，五神更混分，混分逸帝堂，七祖绝死根，五毒炁零灭，翳津无浮连，令我尸血化，帝房出金元，三涂绝苦树，世世获天仙，常与景中王，积劫保元元。 读太极大道元景君道经，当思肝中四真青明君真炁，青云之色，从兆泥丸中入，下布兆胃管之户膏膜之下，微祝曰： 四真常生，青光华精，徘徊秀朗垣，沈弥玉景庭，携提高上元，俯仰要五灵，拔解七叶根，与我保华婴。 毕，引青炁三咽止。 便读玉经，经毕，又祝曰： 帝室混身，一道万分，万分合别，是曰帝一，白帝皓灵，金霞回日，重冥幽寥，藏神化密，把兆五符，与天相毕，玉晖覆盖，无死无疾，七祖父母，超登丹室，胞根八解，死符绝灭，帝得五元，我回三七，六腋焕华，金书羽札，世为仙真，宝箓玄别，华繁曾玄，世元曲折。 读皇初紫灵元君道经，当思精血中三真元生君真炁，赤云之色，从兆泥丸中入，下布兆鼻两孔下源之中。 毕，微祝曰： 三真焕光，流丹徘徊，离合九景，三洞金扉，上招朱童，五苦廓开，死根断落，日魂同飞，超逸十界，上升玉阶。 毕，引赤炁三咽止。 便读玉经，经毕，又祝曰： 七炁混合，帝一回元，结滞月散，兆命长迁，死道闭灭，断绝胞根，五藏生华，六腑金鲜，帝一保形，司命保神，五符启扉，五籍登仙，世为道王，帝师缠绵，散香龙窗，反华扬烟，七携无上，八晖九陈，流源曲液，领会六渊，名书上清，炁积寂轩，回风脱死，帝一相连，五通七合，俱生上元。 读无英中真上老君道经，当思骨节二真坚玉君真炁，碧云之色，从兆泥丸中入，下布兆太仓五肠之口。 毕，微祝曰： 二真固神，郁勃三关，回金合玉，坚备泥丸，上通帝炁，布流金门，混化启明，合我仙魂，七祖同飞，灭绝胞根，世保道德，永享欣欣。 毕，引碧云之炁三咽止。 便读玉经，经毕，又祝曰： 魂生无中，布在九重，道出三极，常游绛官，三宫合化，是为紫房，紫房所在，先由明堂，明堂之内，守神桃康，风云郁郁，既清且凉，塞闭欲孔，割破恋根，其圣曰哥，其真曰霐，兆能知之，乃开金门，金门左右，忽见高贤，左曰父宁在，右曰母精延，此是景中伯，与尔登玉晨，父宁母精，世世为仙，万条重华，皆受帝一恩。",
      "translated_text": "When reciting the *Scripture of the Jade Dawn and the Supreme Lord of the Great Dao*, one must visualize the true qi of the Six Perfected Ones of the Upper Prime within the lungs—radiant as white clouds—entering through the mud-pillar of one’s being and descending to fill the twelve beams of the neck. Upon completion, softly intone:\n\n\"Six Perfected, resplendent,\nWhite light effulgent,\nRevolving the Emperor’s radiance,\nAscending to the Cinnabar Homestead.\nSummoning the true to flow downward,\nIrrigating me with jade nectar.\nFeathered skirts fluttering,\nClothing me in immortal robes.\nTranscending water and fire,\nSoaring to the Divine Capital.\"\n\nUpon completion, draw in the white qi and swallow it thrice. Then recite the jade scripture, and when finished, intone again:\n\n\"Nine Unions, Three Separations,\nPurple chambers dispersed and divided.\nFive Elders in solemn majesty,\nThe Imperial Unity guards the spirit.\nThe Controller of Life presents the register,\nOffering the talisman to the Three Primes.\nThe womb-tree withers and falls,\nThe blood-corpse severs its root.\nReversing the womb’s crimson fire,\nReturning qi to the mud-pillar.\nI merge with the Nine Pures,\nThe Great Confluence of a hundred spirits.\nThe body ascends to the Jade Chamber,\nRiding alongside the Golden Immortals.\nRoaming the Primal Simplicity,\nWandering the Three Heavens.\nThe Double Flowers array the tablets,\nBlack essence flows into the Mysterious.\nFor generations, I shall be a Daoist patriarch,\nGreat fortune entwined.\nAbove, I repose in the Jade Clarity,\nBelow, I rest at the Gate of Life.\nThe Five Viscera blossom in splendor,\nThe nape bears the solar essence.\nPreserving kalpic longevity,\nPostnatal integrity ever whole.\"\n\nWhen reciting the *Scripture of the Supreme Clarity and the Great Lord of the Dao*, one must visualize the true qi of the Five Perfected Nurturing Radiance Lord within the spleen—hued like jade light and golden perfection—entering through the mud-pillar of one’s being and descending to fill the extreme root’s gate within the throat. Upon completion, softly intone:\n\n\"Five Perfected scatter numinosity,\nDispersing qi through the Nine Mysteries.\nGolden light blazes in brilliance,\nJade qi exudes sweet dew.\nThe myriad spirits harmonize,\nGladdening my body.\nThe Rounded Radiance presents the register of life,\nThe Supreme Unity inscribes the Nine Heavens.\nDescending the Eightfold Luminous Chariot,\nSpurring dragons to ride the pristine mist.\nMerging within the Three Emperor’s chambers,\nPreserving my kalpas of years.\"\n\nUpon completion, draw in the jade light and swallow it thrice. Then recite the jade scripture, and when finished, intone again:\n\n\"At dawn, ascending the Ninefold Luminous Terrace,\nAt dusk, entering the Divine Empyrean’s gate.\nThe Supreme Unity’s divine master,\nAlso called the Threefold Advent Vessel.\nLeft hand holding my talismanic register,\nRight hand escorting the Cavern Yang Lord.\nStabilizing life within the Purple Chamber,\nThe Five Spirits further intermingle.\nIntermingling in the Emperor’s Hall of Leisure,\nThe seven ancestors sever the root of death.\nThe five poisons’ qi dissipates and vanishes,\nThe turbid streams bear no floating dross.\nCommanding my corpse and blood to transform,\nThe Emperor’s chamber yields golden prime.\nThe Three Paths’ suffering-trees wither,\nFor generations, attaining celestial immortality.\nEver accompanying the King within the Radiance,\nAccumulating kalpas to preserve the Primal Prime.\"\n\nWhen reciting the *Scripture of the Supreme Ultimate and the Primordial Radiance Lord of the Dao*, one must visualize the true qi of the Four Perfected Azure Clarity Lord within the liver—hued like azure clouds—entering through the mud-pillar of one’s being and descending to fill the gate of the stomach’s membrane beneath the fat. Upon completion, softly intone:\n\n\"Four Perfected, ever vital,\nAzure light, essence of splendor.\nWandering the resplendent luminous walls,\nPervading the Jade Radiance’s court.\nUpholding the Upper Prime,\nRevering and yielding to the Five Spirits.\nUprooting the seven-leaf root,\nPreserving my blossoming infant.\"\n\nUpon completion, draw in the azure qi and swallow it thrice. Then recite the jade scripture, and when finished, intone again:\n\n\"The Emperor’s chamber merges the body,\nOne Dao, myriad divisions.\nMyriad divisions unite in distinction,\nThis is called the Imperial Unity.\nWhite Emperor, luminous and numinous,\nGolden auroras revolve the sun.\nLayered darkness, profound and silent,\nConcealing the spirit’s transformations in secrecy.\nGrasping my Five Talismans,\nAligning with heaven’s completion.\nJade radiance overspreads,\nNo death, no illness.\nSeven ancestors and parents,\nTranscending to the Cinnabar Chamber.\nThe eightfold untying of the womb-root,\nThe death-tally extinguished.\nThe Emperor obtains the Five Primes,\nI return the Three Sevens.\nThe six armpits blaze in splendor,\nGolden script and feathered missives.\nFor generations, I shall be an immortal perfected,\nPrecious registers, mysterious and distinct.\nFlourishing in the ancestral mystery,\nGenerations without end.\"\n\nWhen reciting the *Scripture of the Primordial Purple Numinosity Lady of the August Beginning*, one must visualize the true qi of the Three Perfected Primal Life Lord within the essence-blood—hued like crimson clouds—entering through the mud-pillar of one’s being and descending to fill the source beneath the two nostrils. Upon completion, softly intone:\n\n\"Three Perfected, blazing in light,\nFlowing cinnabar, wandering in cycles.\nSeparating and uniting the Nine Radiant Ones,\nThe Three Caverns’ golden portals.\nAbove, summoning the Vermilion Youth,\nThe Five Sufferings dissolve and open.\nThe root of death severs and falls,\nThe solar essence soars in flight.\nTranscending the Ten Realms,\nAscending the Jade Stair.\"\n\nUpon completion, draw in the crimson qi and swallow it thrice. Then recite the jade scripture, and when finished, intone again:\n\n\"Seven qi merge and harmonize,\nThe Imperial Unity returns to the origin.\nStagnant knots of the moon disperse,\nMy life-span lengthens and transcends.\nThe path of death closes and vanishes,\nSevering the womb-root.\nThe Five Viscera bloom in splendor,\nThe Six Bowels gleam like gold.\nThe Imperial Unity guards the form,\nThe Controller of Life guards the spirit.\nThe Five Talismans open the portals,\nThe Five Registers ascend to immortality.\nFor generations, I shall be a Daoist sovereign,\nThe Emperor’s teacher, entwined in fortune.\nScattering incense at the Dragon Window,\nReturning blossoms to waft mist.\nSevenfold ascent to the Supreme,\nEightfold radiance, Ninefold Arrays.\nFlowing sources, winding fluids,\nGathering at the Six Abysses.\nName inscribed in the Upper Clarity,\nQi accumulates in tranquil serenity.\nRevolving winds shed death,\nThe Imperial Unity remains linked.\nFive Penetrations, Seven Unions,\nAll born in the Upper Prime.\"\n\nWhen reciting the *Scripture of the Supreme Elder Lord of the Center and the Perfected of Non-Florescence*, one must visualize the true qi of the Two Perfected Firm Jade Lords within the bones and joints—hued like azure clouds—entering through the mud-pillar of one’s being and descending to fill the mouth of the Great Granary and the five intestines. Upon completion, softly intone:\n\n\"Two Perfected, firming the spirit,\nVigorous and surging through the Three Passes.\nRevolving gold to merge with jade,\nStrengthening and preparing the mud-pillar.\nAbove, connecting with the Emperor’s qi,\nDispersing and flowing through the Golden Gate.\nMerging transformations, inaugurating brightness,\nUniting with my immortal soul.\nSeven ancestors ascend together,\nEradicating the womb-root.\nFor generations, preserving the Dao and virtue,\nEver enjoying joy and abundance.\"\n\nUpon completion, draw in the azure cloud qi and swallow it thrice. Then recite the jade scripture, and when finished, intone again:\n\n\"The soul born from the Non-Being,\nSpread through the Ninefold Heavens.\nThe Dao emerges from the Three Ultimates,\nEver roaming the Crimson Palace.\nThree palaces merge and transform,\nThis is the Purple Chamber.\nWhere the Purple Chamber resides,\nFirst is the Hall of Brightness.\nWithin the Hall of Brightness,\nGuarding the spirit, Peach Prosperity.\nWind and clouds, lush and dense,\nClear and cool.\nSealing the apertures of desire,\nSevering the root of attachment.\nIts sage is called Elder Brother,\nIts perfected is called Overflowing.\nIf one can know this,\nThen the Golden Gate opens.\nTo the left and right of the Golden Gate,\nSuddenly beholding the exalted worthies.\nOn the left, Father Tranquil Existence,\nOn the right, Mother Essence Prolonged.\nThese are the Lords within the Radiance,\nAscending with you to the Jade Dawn.\nFather Tranquil, Mother Essence,\nFor generations, they shall be immortals.\nMyriad branches of Double Flowers,\nAll receive the grace of the Imperial Unity.\"",
      "overlap_context": "\nFragrant and resplendent, infant and youth.\nGazing upon the Great Vastness,\nBathing and refining the Five Penetrations.\nClarifying the soul’s feathered obscurity,\nRefining the po in emptiness.\nSummoning my hundred spirits,\nA monthly accomplishment.\nSeven ancestors follow in birth,\nRadiant fortune flourishes.\nReversing my aged years,\nRestoring the Mysterious Child.\nAbove, facing the Divine Empyrean,\nGolden light in ten directions.\nJade wheels in flying whirlwinds,\nStriking gold, sounding bells.\"",
      "start_char": 6344,
      "end_char": 7661,
      "start_sentence": 243,
      "end_sentence": 271,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.8626012802124,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上玉清隐书灭魔神慧高玄真经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "读中央黄老君道经，当思心中一真天精君真炁，绛云之色，从兆泥丸中入，下布兆胸中四极之口。 毕，微祝曰： 一真镇心，总领百神，百神常生，会我绛轩，上招玉炁，六液沉珍，赤景启灵，拔我七根，超逸三涂，上升南仙。 毕，引绛云之炁三咽止。 便读玉经，经毕，又祝曰： 帝一迥风，化合桃康，流生起福，上缢玉堂，混而合之，出入帝房，三五合一，必成仙君，七玄父母，灭尸散怨，万劫千重，皆登上清，仙曲节伏扈，广敷郁中，守我形者，司命丈人，帝君公子，深固泥丸，太微玉华，羽服扬幡，魂魄长相抱，百骨皆满神，神王生津上，超越度死门，遂友高上子，把籍玉清宾。 读青精上真内景君道经，当思九元之真拘制真炁，五色云炁，从兆泥丸中入，下布兆左耳伏晨之户。 毕，微祝曰： 九元之精，天关开窗，八景合炁，上通金房，三元帝室，反老生蓊，玉华灌溉，炼改艾容，飞霄紫舆，运我升空。 毕，便引五色云炁三咽止。 便读玉经，经毕，又祝曰： 太微小童，常在帝前，其名景精，其姓曰干，合形太一，被服朱丹，五符命籍，把持玉案，帝君所临，主通诸神，混合太上，司命丈人，固保灵户，五藏会分，帝仙守宅，凶种灭根，三炁郁敷，八回五烟，我得升霄，驾龙朗轩。 读太阳九炁玉贤元君道经，当思皇一之魂上归真炁，玄云之色，从兆泥丸中入，下布兆右耳伏晨之户。 微祝曰： 皇一上真，洞生丹房，朱映兰曜，发溢明光，太元之音，朗彻九空，玄金独乐，振响琅琅，上招玉景，协我神堂，策虚升飞，游宴玉京。 毕，引玄云之炁三咽止。 便读玉经，经毕，又祝曰： 九宫一合，化形帝晨，上升紫房，命真召仙，会济魂魄，领括百神，七玄康乐，披苦破根，死烟灭炁，福禄充轩，兆登太霄，驾景控云，日中五帝，挟日精轮，郁将逸阜，飙景同迁。 读太初九素金华景元君道经，当思紫素左元君翳郁无刃真炁，景云之色，从兆泥丸中入，下布兆头面之境。 毕，微祝曰： 翳郁生真，真景生空，灵炁昱昱，紫素融融，上致流津，下布我宫，身生水火，体变玉光，飞仙羽盖，升入神公，受书玉京，成我仙宗。 毕，引景云之炁三咽止。 便读玉经，经毕，又祝曰： 庆元吉津，流汨西田，太帝携手，命召高仙，披浊散秽，断绝死根，上一天帝，号玄凝天，曜明六合，靖寂泥丸，是为伯无上，使兆保长安，列图玉皇，并襟帝晨，五府生华，六液龙源，渊清太素，郁霭金津，万仙来朝，五岳启陈，玄愆沉散，天福奏烟，雕梁守命户，长来护死门，上生玉房，受位金仙，天之玉堂，常接帝贤，九天之中，宴盼劫年。 读九皇上真司命君道经，当思黄素中元君圆华黄刃真炁，状晨景之晖上华，从兆泥丸中入，下布兆胸腹之境。 毕，微祝曰： 九天上景，化生华晖，晃哗太空，曜真紫微，上致中黄，百神降回，散根离苦，八难豁开，七祖同升，福覆巍巍，使我神仙，八景齐飞。 毕，引景晖之华三咽止。 便读玉经，经毕，又祝曰： 太帝精魂，阳堂八灵，披散死炁，混合众生，帝一承图，三元会明，九真安安，七神宁宁，超越滞节，过度鬼兵，上升帝晨，盼乐玉庭，玄母定录，五府开清，胞根没种，血秽珍平，七祖父母，起福三清，无英明夫，掌我仙经，广神安炁，录回绝冥，闭藏死关，太混一生，长寝羽台上，固神五老室，受录上清阙，保德七元日，上上登玉霄，下下合帝一。",
      "translated_text": "When reciting the *Daoist Canon of the Central Yellow and Lao Lord*, one should visualize the True Qi of the One Real Heavenly Essence Sovereign within the heart—a crimson cloud descending from the mud-pill palace of the self, flowing downward to fill the four apertures of the chest. Once complete, softly intone:\n\n*\"One Real anchors the heart,\nGoverning the hundred spirits.\nMay the hundred spirits ever flourish,\nGathering with me in the Crimson Chariot.\nAbove, summon the Jade Qi,\nSix fluids settle as treasures.\nThe Red Radiance awakens the numinous,\nUprooting my seven roots,\nTranscending the Three Paths,\nAscending to the Southern Immortals.\"*\n\nAfter this, draw in the Qi of the crimson cloud and swallow it thrice, then cease. Proceed to recite the *Jade Canon*. Upon completion, intone once more:\n\n*\"The Imperial Unity whirls with the wind,\nTransforming to unite with Peach Prosperity.\nFlowing life generates fortune,\nAscending to bind the Jade Hall.\nMerge and harmonize,\nEntering and exiting the Imperial Chamber.\nThree and Five unite as One—\nSurely becoming an Immortal Lord.\nThe Seven Mysteries’ parents,\nExtinguish the corpse and disperse resentment.\nThrough ten thousand kalpas and a thousand layers,\nAll ascend to the Upper Clarity.\nThe immortal melody bows in submission,\nBroadly spreading through the lush center.\nHe who guards my form—\nThe Director of Destinies, the Venerable One.\nThe Imperial Lord’s Noble Son,\nDeeply fortifies the mud-pill palace.\nThe Great Tenuity’s Jade Flower,\nFeathered robes unfurl banners.\nSoul and spirit embrace forever,\nA hundred bones all filled with spirit.\nThe Spirit King generates fluids above,\nSurpassing to cross the Gate of Death.\nThen befriending the Exalted One,\nGrasping the register as a guest of the Jade Clarity.\"*\n\nWhen reciting the *Daoist Canon of the Upper True Inner Radiance Sovereign of Azure Essence*, one should visualize the True Qi of the Nine Origins’ Perfected, which constrains and governs—clouds of five colors descending from the mud-pill palace of the self, flowing downward to fill the Gate of Hidden Dawn in the left ear. Once complete, softly intone:\n\n*\"The essence of the Nine Origins,\nOpens the Heavenly Pass’s window.\nEight Radiant Qi converge,\nAscending to connect with the Golden Chamber.\nThe Three Origins’ Imperial Abode,\nReverses aging to generate flourishing.\nJade Flower irrigates,\nRefining and transforming the mugwort-like visage.\nThe Flying Auroral Purple Chariot,\nCarries me to ascend the void.\"*\n\nAfter this, draw in the Qi of the five-colored clouds and swallow it thrice, then cease. Proceed to recite the *Jade Canon*. Upon completion, intone once more:\n\n*\"The Lesser Lad of the Great Tenuity,\nEver stands before the Emperor.\nHis name is Radiant Essence,\nHis surname is Gan.\nUniting form with the Great One,\nClad in vermilion cinnabar.\nFive talismans command the register,\nHolding the Jade Tablet.\nWhere the Imperial Lord descends,\nHe governs the communication of all spirits.\nMerging with the Supreme,\nThe Director of Destinies,\nFirmly protects the Numinous Gate.\nThe Five Viscera divide and assemble,\nThe Imperial Immortal guards the dwelling.\nMalevolent seeds uproot their roots.\nThree Qi spread lushly,\nEight revolutions, Five Smokes.\nI ascend to the auroral void,\nDriving the dragon’s bright chariot.\"*\n\nWhen reciting the *Daoist Canon of the Jade Worthiness Sovereign of the Nine Qi of the Great Yang*, one should visualize the Hun-soul of the August One ascending to return to True Qi—a cloud of profound hue descending from the mud-pill palace of the self, flowing downward to fill the Gate of Hidden Dawn in the right ear. Softly intone:\n\n*\"The August One’s Upper Perfected,\nWashes and generates the Cinnabar Chamber.\nVermilion illumines the orchid’s brilliance,\nRadiating and overflowing with luminous light.\nThe sound of the Great Origin,\nResonates clearly through the Nine Voids.\nThe solitary joy of Mysterious Gold,\nVibrates with a ringing clarity.\nAbove, summon the Jade Radiance,\nHarmonizing with my spirit hall.\nUrging the void to ascend and fly,\nRoaming and feasting in the Jade Capital.\"*\n\nAfter this, draw in the Qi of the profound cloud and swallow it thrice, then cease. Proceed to recite the *Jade Canon*. Upon completion, intone once more:\n\n*\"The Nine Palaces unite as One,\nTransforming form in the Imperial Dawn.\nAscending to the Purple Chamber,\nSummoning the Perfected to call the Immortals.\nGathering and aiding soul and spirit,\nEncompassing and embracing the hundred spirits.\nThe Seven Mysteries rejoice in well-being,\nShedding suffering and breaking roots.\nThe smoke of death extinguishes its Qi,\nFortune and emolument fill the chariot.\nThe self ascends to the Great Auroral Void,\nDriving the radiance to harness the clouds.\nThe Five Emperors within the sun,\nGrasp the Wheel of Solar Essence.\nLushly flourishing in transcendent abundance,\nThe auroral gale ascends together.\"*\n\nWhen reciting the *Daoist Canon of the Golden Flower Radiance Sovereign of the Nine Primes*, one should visualize the True Qi of the Left Origin Sovereign of Purple Prime, Yiyu Wuren—a cloud of radiant hue descending from the mud-pill palace of the self, flowing downward to fill the boundaries of the head and face. Once complete, softly intone:\n\n*\"Yiyu generates the Perfected,\nThe Perfected Radiance generates the void.\nNuminous Qi shines brightly,\nPurple Prime fuses harmoniously.\nAbove, it conveys flowing fluids,\nBelow, it spreads through my palace.\nThe body generates water and fire,\nThe form transforms into jade light.\nThe Flying Immortal’s feathered canopy,\nAscends to enter the Spirit Duke.\nReceiving the scripture in the Jade Capital,\nPerfecting my immortal lineage.\"*\n\nAfter this, draw in the Qi of the radiant cloud and swallow it thrice, then cease. Proceed to recite the *Jade Canon*. Upon completion, intone once more:\n\n*\"Auspicious fluids of Celebration Prime,\nFlow and surge through the Western Field.\nThe Supreme Emperor takes my hand,\nSummoning the Exalted Immortals.\nShedding turbidity and dispersing filth,\nSevering the roots of death.\nThe One Heavenly Emperor,\nNamed the Mysterious Congealing Heaven.\nIlluminating the Six Harmonies,\nPacifying the mud-pill palace.\nThis is the Unsurpassed Elder,\nEnabling the self to preserve enduring peace.\nInscribed in the Jade Emperor’s charts,\nShoulder to shoulder with the Imperial Dawn.\nThe Five Palaces generate blossoms,\nThe Six Fluids are the dragon’s source.\nThe abyss clears to Great Simplicity,\nLushly misting the Golden Fluids.\nTen thousand immortals come to pay court,\nThe Five Peaks open and present.\nProfound transgressions sink and scatter,\nHeavenly fortune manifests as smoke.\nThe carved beam guards the Gate of Destiny,\nEver coming to protect the Gate of Death.\nAbove, born in the Jade Chamber,\nReceiving the rank of Golden Immortal.\nThe Heavenly Jade Hall,\nEver connects with the Imperial Worthies.\nWithin the Nine Heavens,\nFeasting and gazing through kalpas of years.\"*\n\nWhen reciting the *Daoist Canon of the Director of Destinies, the Upper True Sovereign of the Nine August Ones*, one should visualize the True Qi of the Central Origin Sovereign of Yellow Prime, Yuanhua Huangren—a radiance like the morning’s splendor ascending, descending from the mud-pill palace of the self to fill the boundaries of the chest and abdomen. Once complete, softly intone:\n\n*\"The Upper Radiance of the Nine Heavens,\nTransforms to generate blossoming splendor.\nResplendent through the Great Void,\nIlluminating the Perfected Purple Tenuity.\nAbove, it conveys the Central Yellow,\nA hundred spirits descend and return.\nDispersing roots to depart suffering,\nThe Eight Difficulties open wide.\nSeven ancestors ascend together,\nFortune covers all majestically.\nEnabling my spirit to become immortal,\nEight Radiant Qi fly in unison.\"*\n\nAfter this, draw in the blossoming radiance and swallow it thrice, then cease. Proceed to recite the *Jade Canon*. Upon completion, intone once more:\n\n*\"The Supreme Emperor’s essence and soul,\nThe Eight Numinous of the Yang Hall.\nDispersing the Qi of death,\nMerging and harmonizing with all beings.\nThe Imperial Unity receives the chart,\nThe Three Origins gather in clarity.\nThe Nine Perfected rest in tranquility,\nThe Seven Spirits abide in serenity.\nSurpassing stagnant nodes,\nCrossing beyond the ghostly troops.\nAscending to the Imperial Dawn,\nGazing joyfully upon the Jade Court.\nThe Mysterious Mother stabilizes the register,\nThe Five Palaces open to clarity.\nThe womb’s roots eradicate their seeds,\nBlood and filth settle into peace.\nSeven ancestors and parents,\nGenerate fortune in the Three Clarities.\nThe Brilliant Husband of Non-Duality,\nHolds my immortal canon.\nBroadly calming the spirit and settling Qi,\nReversing the register to sever darkness.\nSealing the Gate of Death,\nThe Great Chaos generates the One.\nEternally resting upon the Feathered Terrace,\nFirmly guarding the Five Elders’ chamber.\nReceiving the register in the Upper Clarity’s gates,\nPreserving virtue on the Seven Origins’ days.\nAbove, ascending to the Jade Auroral Void,\nBelow, uniting with the Imperial Unity.\"*",
      "overlap_context": "d Elder Brother,\nIts perfected is called Overflowing.\nIf one can know this,\nThen the Golden Gate opens.\nTo the left and right of the Golden Gate,\nSuddenly beholding the exalted worthies.\nOn the left, Father Tranquil Existence,\nOn the right, Mother Essence Prolonged.\nThese are the Lords within the Radiance,\nAscending with you to the Jade Dawn.\nFather Tranquil, Mother Essence,\nFor generations, they shall be immortals.\nMyriad branches of Double Flowers,\nAll receive the grace of the Imperial Unity.\"",
      "start_char": 7662,
      "end_char": 8984,
      "start_sentence": 272,
      "end_sentence": 301,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 48.51826763153076,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上玉清隐书灭魔神慧高玄真经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "读天皇上真玉华三元君道经，当思白素右元君启明萧刃真炁，状月中之华，从兆泥丸中入，下布兆下关小腹至脚。 毕，微祝曰： 白素启明，九天同生，高虚素辔，浮景玉清，回真曲仙，流洒八溟，通幽达微，玄曜华精，使我内彻，五孔开明，神公来游，我道克成。 毕，引月华炁三咽止。 便读玉经，经毕，又祝曰： 魂生九炁，炁变成神，五光缠会，太一化仙，二十四真，回形帝先，九曲下户，镇生白云，黄庭六腑，含养命根，胎结胞树，种栽死山，一得拘制，受断灭源，符籍清明，金□玉轩，长为德伯，世得道恩，升登日月，遂友帝仙。 读太一上元禁君道经，当思日中司命接生真炁，三华之色，从兆泥丸中入，布兆左手之户。 毕，微祝曰： 四大乘天，天元来归，三华吐曜，司命景飞，为我招仙，七祖散开，上登大灵，日月同晖。 毕，引三华之炁三咽止。 便读玉经，经毕，又祝曰： 太一务犹收，召北司玄一老子，握节往来，元素把符，白元守雌，焕然晨光明，披霞升帝墉，列坐震灵席，混合五日房，白炁育尚生，青君案延昌，左携精上门，右抱合和婴，我生日月华，友宾赤炁王，八景照泥丸，朗然洞房中，婴儿为赤子，混离生玉容，五道秀金华，位为上清公，七祖断玄滞，身得乘神风，徘徊三清上，和乐返婴童。 读元虚黄房真晨君道经，当思日中桃君方盈真炁，日晖之色，从兆泥丸中入，下布兆右手之户。 毕，微祝曰： 元虚黄房内，日中号方盈，左宴朱领台，右携仙皇庭，寝宴三秀房，结我神始生，同飞入玄玄，七祖反华婴。 毕，引日晖之炁三咽止，便读玉经，经毕，又祝曰： 九元镇真，五帝缠绵，日月中王，与兆为亲，大混三五，离落魄魂，百节金□，玉液回神，五府生华，白炁运烟，充溢三清，紫房宝津，上开仙户，下塞死关，令我羽简，玉帝之前，七祖父母，反生南轩，虎服摄魔，龙旌命神，太一锦旌，召束三官，除灭死籍，刊名玉真，保生太一，日月同年。 读太极主四真人元君道经，当思左目童子飞灵真炁，日之华光，从兆泥丸中入，下布兆左目之中。 毕，咒曰： 四极太灵，元君精瑛，日华充溢，童明光光，二景相照，通我明梁，三丹启真，我道开张，毛羽罗裙，飞上上京。 毕，引华光三咽止。 便读玉经，经毕，又祝曰： 我乘混合炁，缠固九真丘，养光太昌子，并罗凝羽珠，九尊众帝生，景洞回须臾，七祖结解散，秽积忽已除，世世生福昌，玄玄获仙书，身升太霞宫，控龙宴玉虚，上朝上清皇，寝兴幸正扶。 读四斗中真人七晨散华君道经，当思右目童子晨婴真炁，月之华光，从兆泥丸中入，下布兆右目之中。 毕，微祝曰： 七晨飞华，华散三元，混合成真，上招月魂，为我降灵，启我仙门，七祖同飞，飞朝帝君。 毕，引月华光三咽止。 便读玉经，经毕，又祝曰： 三素牢张，上元老君，神生道固，我魄逸游，保兆六合恼，忧苦没曲门，死炁闭地下，身与帝一君，并襟乐六腑，镜心丹玄房，熙炁泥丸野，体曜金晖，羽录召真，白炁重郁，百神光鲜，长与日月，符籍缠绵，世保道德，永为天仙，寂寂内注，遂升帝庭。 读辰中黄景元君道经，当思肺部童子素明真炁，五关晖光，从兆泥丸中入，下布兆肺部华盖之门，上通两目之童。",
      "translated_text": "When reciting the *Scripture of the Heavenly Sovereign’s Supreme Perfected Jade-Flower Three Primes Lord*, one must visualize the White Primordial Right Prime Lady, Radiant Dawn, and the True Qi of the Selenic Blade—its form like the blossom within the moon—entering through the adept’s Mud-Pill Palace, then descending to spread through the Lower Pass of the small abdomen down to the feet. Once this is complete, softly intone the prayer:\n\n*\"White Primordial Radiant Dawn,\nBorn with the Nine Heavens as one,\nLofty Void with reins of purity,\nFloating scene in Jade Clarity.\nTurning truth to curve with immortals,\nFlowing and sprinkling the Eight Seas,\nPenetrating the obscure to reach the subtle,\nMysterious radiance of flowery essence—\nLet me inwardly pierce through,\nFive apertures open to clarity.\nDivine Lords come to wander,\nMy Dao attains completion.\"*\n\nOnce done, draw in the Qi of the moon’s blossom and swallow it thrice, then cease. Proceed to recite the Jade Scripture. Upon completion, intone the prayer again:\n\n*\"Soul born of Nine Qi,\nQi transforms to become spirit.\nFive lights entwine and gather,\nGrand Unity transfigures into immortals.\nTwenty-Four Perfected,\nReturn form to the Imperial Ancestor.\nNine curves of the Lower Gate,\nGuard life within white clouds.\nYellow Court and Six Palaces,\nNurture the root of destiny.\nWomb knots and placenta-tree,\nSeeds planted in the mountain of death—\nOnce bound and restrained,\nCut off the source of annihilation.\nRegisters pure and bright,\nGolden chariot and Jade axle.\nEver a Virtuous Elder,\nGenerations receive the grace of the Dao.\nAscending to join sun and moon,\nTo befriend the Imperial Immortals.\"*\n\nWhen reciting the *Scripture of the Supreme Prime Prohibiting Lord of Grand Unity*, one must visualize the True Qi of the Life-Receiving Controller within the sun, the color of the Three Blossoms, entering through the adept’s Mud-Pill Palace and spreading through the Gate of the left hand. Once this is complete, softly intone the prayer:\n\n*\"Four Great Ascend to Heaven,\nHeavenly Prime returns to me.\nThree Blossoms spout radiance,\nController of Life soars on the scene.\nSummon immortals for me,\nSeven ancestors disperse and ascend.\nTogether we rise to the Great Numinous,\nSun and moon shine as one.\"*\n\nOnce done, draw in the Qi of the Three Blossoms and swallow it thrice, then cease. Proceed to recite the Jade Scripture. Upon completion, intone the prayer again:\n\n*\"Grand Unity’s tasks are gathered,\nSummoning the Northern Controller, the Primordial Elder.\nGrasping the tally, coming and going,\nPrimal Simplicity holds the talisman.\nWhite Prime guards the feminine,\nResplendent as the dawn’s bright light.\nDonning auroras, ascending the Imperial Wall,\nSeated in order on the Thunder Numinous mat.\nMerging with the Five Solar Chambers,\nWhite Qi nurtures the noble-born.\nAzure Lord presses forward with prosperity,\nLeft hand carries the Essence Gate’s door,\nRight arm embraces the Harmonious Infant.\nMy life blooms with sun and moon’s blossom,\nFriend and guest to the Crimson Qi King.\nEight Sceneries illuminate the Mud-Pill wilds,\nLuminous within the Grotto Chamber.\nThe Infant becomes the Crimson Child,\nMerging and parting to generate jade countenance.\nFive Paths flourish with golden blossoms,\nRanked as a Lord of Supreme Clarity.\nSeven ancestors sever dark stagnation,\nBody attains to ride the spirit-wind.\nWandering above the Three Clarities,\nJoyfully returning to the Infant Child.\"*\n\nWhen reciting the *Scripture of the Primal Void Yellow Chamber True Dawn Lord*, one must visualize the True Qi of the Peach Lord within the sun, Full Radiance, the color of solar brilliance, entering through the adept’s Mud-Pill Palace and spreading through the Gate of the right hand. Once this is complete, softly intone the prayer:\n\n*\"Within the Primal Void Yellow Chamber,\nThe sun’s midst is named Full Radiance.\nLeft feasting in the Vermilion Numinous Terrace,\nRight carrying the Immortal Emperor’s Court.\nReclining in the Three Blossoms’ chamber,\nKnots form my spirit’s beginning.\nTogether we fly into the Mysterious-Mysterious,\nSeven ancestors return to the Flowery Infant.\"*\n\nOnce done, draw in the Qi of solar brilliance and swallow it thrice, then cease. Proceed to recite the Jade Scripture. Upon completion, intone the prayer again:\n\n*\"Nine Primes guard the true,\nFive Emperors entwine and coil.\nKing of sun and moon,\nBecomes kin to the adept.\nGreat Chaos of Three and Five,\nParting the hun-soul and po-soul.\nHundred joints of golden splendor,\nJade liquid returns the spirit.\nFive Palaces generate blossoms,\nWhite Qi moves the mist.\nFilling the Three Clarities,\nPurple Chamber’s treasure nectar.\nAbove, opens the immortal’s gate,\nBelow, seals the Gate of Death.\nLet my feathered tally stand\nBefore the Jade Emperor.\nSeven ancestors and parents,\nReturn to life in the Southern Pavilion.\nTiger-clad, they seize demons,\nDragon banners command spirits.\nGrand Unity’s brocade banner,\nSummons and binds the Three Officials.\nErasing the register of death,\nInscribing names in Jade Perfection.\nPreserving life with Grand Unity,\nSun and moon share the same years.\"*\n\nWhen reciting the *Scripture of the Four Perfected Lords of the Grand Ultimate*, one must visualize the True Qi of the Flying Numinous Child of the left eye, the radiant blossom of the sun, entering through the adept’s Mud-Pill Palace and spreading into the left eye. Once this is complete, intone the incantation:\n\n*\"Four Poles, Grand Numinous,\nPrime Lord’s essence and luster.\nSolar blossom fills and overflows,\nChild’s clarity shines resplendent.\nTwo Sceneries illuminate each other,\nPenetrating my luminous beam.\nThree Cinnabars open the true,\nMy Dao unfolds and expands.\nFeathered robes and silk skirts,\nFlying to the Supreme Capital.\"*\n\nOnce done, draw in the radiant blossom and swallow it thrice, then cease. Proceed to recite the Jade Scripture. Upon completion, intone the prayer again:\n\n*\"I ride the Qi of merging chaos,\nEntwining and securing the Nine Perfected Mounds.\nNurturing light with the Grandly Prosperous Child,\nTogether arrayed with the congealed Feathered Pearl.\nNine Honored and hosts of emperors born,\nScenery and grotto revolve in an instant.\nSeven ancestors’ knots dissolve and scatter,\nFilth and accumulation suddenly vanish.\nGeneration after generation, life flourishes,\nMysterious-Mysterious obtains the immortal scripture.\nBody ascends to the Grand Auroral Palace,\nControlling dragons to feast in Jade Void.\nAbove, paying court to the Supreme Clarity Emperor,\nReclining and rising with the True Support.\"*\n\nWhen reciting the *Scripture of the Seven Dawns Flower-Scattering Perfected Lord of the Four Celestial Houses*, one must visualize the True Qi of the Dawn Infant Child of the right eye, the radiant blossom of the moon, entering through the adept’s Mud-Pill Palace and spreading into the right eye. Once this is complete, softly intone the prayer:\n\n*\"Seven Dawns fly with blossoms,\nBlossoms scatter the Three Primes.\nMerging to form the true,\nAbove, summoning the moon’s soul.\nDescend numinosity for me,\nOpen my immortal’s gate.\nSeven ancestors fly together,\nFlying to pay court to the Imperial Lord.\"*\n\nOnce done, draw in the radiant blossom of the moon and swallow it thrice, then cease. Proceed to recite the Jade Scripture. Upon completion, intone the prayer again:\n\n*\"Three Purities firmly spread,\nSupreme Prime Elder Lord.\nSpirit born, Dao secured,\nMy po-soul roams freely.\nPreserving the adept’s Six Harmonies,\nWorries and sufferings sink into the Crooked Gate.\nDeathly Qi sealed beneath the earth,\nBody and Imperial Unity Lord,\nTogether lapels joyful in the Six Palaces.\nMirroring the heart in the Cinnabar Mysterious Chamber,\nBright Qi in the Mud-Pill wilds,\nBody radiant with golden brilliance.\nFeathered register summons the true,\nWhite Qi thickly lush.\nHundred spirits luminous and fresh,\nEver with sun and moon.\nRegisters entwine and coil,\nGenerations preserve virtue and power.\nEternally a Heavenly Immortal,\nSilent and inwardly focused,\nAscending to the Imperial Court.\"*\n\nWhen reciting the *Scripture of the Yellow Radiance Prime Lord of the Stellar Hour*, one must visualize the True Qi of the White Clarity Child of the lung region, the radiant light of the Five Passes, entering through the adept’s Mud-Pill Palace and spreading through the Gate of the lung’s Flowery Canopy, above to connect with the Child of both eyes.",
      "overlap_context": " Three Clarities.\nThe Brilliant Husband of Non-Duality,\nHolds my immortal canon.\nBroadly calming the spirit and settling Qi,\nReversing the register to sever darkness.\nSealing the Gate of Death,\nThe Great Chaos generates the One.\nEternally resting upon the Feathered Terrace,\nFirmly guarding the Five Elders’ chamber.\nReceiving the register in the Upper Clarity’s gates,\nPreserving virtue on the Seven Origins’ days.\nAbove, ascending to the Jade Auroral Void,\nBelow, uniting with the Imperial Unity.\"*",
      "start_char": 8985,
      "end_char": 10255,
      "start_sentence": 302,
      "end_sentence": 331,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.539013385772705,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上玉清隐书灭魔神慧高玄真经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "毕，微祝曰： 童子素明，黄云九缠，沧台飞轮，三神协真，号曰玄上景，列位高皇宾，总摄命百神，携我入紫烟。 毕，引晖光三咽止。 便读玉经，经毕，又祝曰： 二老在左右，帝魂照九垓，阴阳变其上下，太一立其中根，五神卫其生质，司命塞我死门，九宫合而为一，六合混而无量，世获仙书，福庆缠绵，五老对席，以庆三元，偕一来迎，上升帝晨，七祖滞血，皆为拔根，反胎南宫，受生帝轩，兆宴玉堂，同襟帝轮，世世列图，服羽扬旛，子子保昌，庆及后玄，长为仙伯，役使万神。 读金阙后圣太平李真天帝上景君道经，当思胎中一元白炁君务玄子、太一精魂玄归子，二神真炁，三华之色，从兆泥丸中入，下布兆五藏结喉之本户。 微祝曰： 金阙焕玉清，白炁映丹霞，明光郁金灵，五色吐三华，流津宴寝堂，结我始生牙，玉符召百神，威章征万魔，保此亿劫仙，道明无凶邪。 毕，引三华之炁三咽止。 便读玉经，经毕，又祝曰： 天生八炁，回合帝乡，五神奉符，司命扶将，拔断死籍，荡秽幽冥，七世解结，福延玉庭，血积沉没，三素焕清，兆升天堂，与帝合灵，世得仙契，所启必成，种年日中，植命月庭，反胎童蒙，回为孩婴，生与天同，寿与日并。 读太虚后圣无景彭室真君道经，当思结中青炁君按延昌、元君精魂保谷童，二神真炁，炁如玉华，从兆泥丸中入，下布兆五藏大胃上口。 微祝曰： 离合九灵，二真幽密，太虚重天，上携太一，雌雄混合，同仙妙室，上变九仙，下解胎结，七祖庆欣，五苦解脱，使我飞腾，灵化本质。 毕，引玉华三咽止。 便读玉经，经毕，又祝曰： 种福九天升，拔尸地门下，七玄解滞积，断树阴忧苦，反胎朱火宫，更生九玄户，真炁日日臻，祸害日日治，兆升三清堂，乘飙上景庭，命与月母俱，年随日帝生，累玄保仙籍，回老更童婴，福升六合内，受图永常生。 读太玄都九炁丈人主仙君道经，当思节中黑炁君斌来生、帝真精魂幽台王，二神真炁，玉光之色？ 从兆泥丸中入，下布兆九肠之口伏源之下。 毕，微祝曰： 太玄何寥寥，黑炁生上虚，帝真洞明景，九炁合神庐，变化十方颂，倏欻肇明初，万真炼我仙，百关自清居，七玄断胞树，九曾升福堂，上招景中子，与我登飞舆。 毕，便引玉光三咽止。 便读玉经，经毕，又祝曰： 帝魂照元阿，常镇兆生门，伏尸灭落，保魄宁神，玄母回光，奉帝玉仙，右命太一，乃及兆身，北宴上清，列为玉宾，命生日华，年合月烟，长济金房，晨景为邻，除忧伏胃门，拔苦三徒中，福积丹玄内，庆充泥丸房，百神混帝一，大变流回风，反兆朽艾形，改貌为婴童，世世入仙堂，玄玄登羽宫，大劫虽屡倾，与日方增崇。 读上清八景老君道经，当思胞中黄炁君祖明车、天帝精魂理维藏，二神真炁黄云之色，从兆泥丸中入，下布兆小肠二孔之本。 微说曰： 上清曜玄堂，八景乘天纪，黄炁协神真，精魂对帝子，太一度命籍，五符固不死，携仙带晨晖，回风反形始，拔苦出七祖，同欢九玄裹。 毕，引黄云三咽止。 便读玉经，经毕，又祝日： 白云合晨景，乘素会太微，上朝帝一室，解带皇一阶，启明金门中，三阳召上归，升我身神内，覆盖太明威，大宝九华，光映兆形，招云混真，散香要灵，月中反胎，日中受生，年享曜景，命遂无倾，身为仙王，保此上清，世受真书，玄华玉庭。",
      "translated_text": "Upon completion, softly intone the invocation:\n\"White Clarity Child, nine-fold yellow clouds entwined,\nAzure Terrace’s flying wheel,\nThree spirits harmonize with the true,\nNamed Mystic Supreme Radiance,\nEnthroned as the Lofty August Guest,\nMaster of the hundred spirits’ lives,\nBearing me into purple mist.\"\nThis done, draw in the radiant light and swallow thrice to conclude.\n\nThen recite the *Jade Scripture*. When finished, intone again:\n\"Two Elders at left and right,\nImperial soul illumines the Nine Abysses,\nYin and yang transform above and below,\nGrand Unity stands at the central root,\nFive spirits guard this living form,\nLife’s Controller seals my gate of death,\nNine Palaces merge as one,\nSix Harmonies blend boundlessly,\nThe world gains immortal scriptures,\nFortune and blessings entwine,\nFive Elders face one another in feast,\nCelebrating the Three Primes,\nTogether they come to welcome,\nAscending to the Imperial Dawn,\nSeven generations of stagnant blood,\nAll uprooted at their source,\nReturning to the Southern Palace’s womb,\nReborn in the Imperial Chariot,\nI feast in the Jade Hall,\nShoulder to shoulder with the Imperial Wheel,\nGeneration upon generation inscribed in the registers,\nClad in feathered robes, waving pennants,\nChildren’s children preserved in prosperity,\nBlessings extending to later mysteries,\nForever an Immortal Lord,\nCommanding the ten thousand spirits.\"\n\nWhen reciting the *Scripture of the Golden Watchtower’s Later Sage, Supreme Peace Li, Heavenly Emperor, Supreme Radiance Lord*, one must visualize the One Primal White Qi Lord of the Womb, Wu Xuanzi, and the Grand Unity’s Essence-Soul, Xuan Guizi—two spirits’ true qi, the colors of the Three Flowers—entering through the adept’s Mud-Pill Palace and descending to fill the root gate of the adept’s five viscera and throat’s origin.\n\nSoftly intone:\n\"Golden Watchtower gleams in Jade Clarity,\nWhite qi illumines cinnabar clouds,\nLuminous radiance dense with golden numen,\nFive hues emit the Three Flowers,\nFlowing nectar feasts in the resting hall,\nKnitting my first sprouting bud,\nJade tally summons the hundred spirits,\nMighty writ subdues the ten thousand demons,\nPreserving this immortal through kalpas,\nThe Dao bright, no misfortune or evil.\"\nThis done, draw in the Three Flowers’ qi and swallow thrice to conclude.\n\nThen recite the *Jade Scripture*. When finished, intone again:\n\"Heaven engenders the Eight Qi,\nRevolving to unite with the Imperial Homeland,\nFive spirits bear the tally,\nLife’s Controller lends support,\nSevering the ledger of death,\nSweeping impurity from the dark underworld,\nSeven generations’ knots undone,\nFortune extends to the Jade Court,\nStagnant blood dissolved,\nThree Pures gleam in clarity,\nI ascend to the Heavenly Hall,\nUniting with the Emperor in spirit,\nThe world attains immortal covenant,\nAll petitions fulfilled,\nPlanting years in the sun’s midst,\nCultivating life in the moon’s court,\nReturning to the womb’s childlike ignorance,\nRevolving to become an infant,\nBorn in unity with Heaven,\nLifespan merging with the sun.\"\n\nWhen reciting the *Scripture of the Supreme Void’s Later Sage, Radiance-Free Pengshi True Lord*, one must visualize the Green Qi Lord of the Knot, An Yanchang, and the Primal Lord’s Essence-Soul, Guardian Valley Child—two spirits’ true qi, qi like jade blossoms—entering through the adept’s Mud-Pill Palace and descending to fill the upper mouth of the adept’s five viscera and great stomach.\n\nSoftly intone:\n\"Separating and uniting the Nine Numinous,\nTwo Perfected in profound secrecy,\nSupreme Void’s layered heavens,\nAbove bearing the Grand Unity,\nFeminine and masculine merge,\nTogether in the wondrous chamber,\nAbove transforming the Nine Immortals,\nBelow dissolving the womb’s knots,\nSeven ancestors rejoice,\nFive sufferings released,\nEnabling my flight,\nSpirit transforming my original form.\"\nThis done, draw in the jade blossoms’ qi and swallow thrice to conclude.\n\nThen recite the *Jade Scripture*. When finished, intone again:\n\"Planting fortune to ascend the Nine Heavens,\nUprooting corpses from the earthly gate below,\nSeven Mysteries’ stagnation dissolved,\nSevering the tree of shade and sorrow,\nReturning to the Vermilion Fire Palace’s womb,\nReborn in the Nine Mysteries’ gate,\nTrue qi daily accruing,\nMisfortune daily dispelled,\nI ascend to the Three Clarities’ hall,\nRiding the whirlwind to the Supreme Radiance Court,\nLife conjoined with the Moon Mother,\nYears following the Sun Emperor’s birth,\nLayered mysteries preserve the immortal register,\nReversing age to become a child again,\nFortune rising within the Six Harmonies,\nReceiving the register for eternal life.\"\n\nWhen reciting the *Scripture of the Supreme Mystery Capital’s Nine Qi Elder, Lord of Immortals*, one must visualize the Black Qi Lord of the Node, Bin Laisheng, and the Imperial True Essence-Soul, Dark Terrace Wang—two spirits’ true qi, the color of jade light—entering through the adept’s Mud-Pill Palace and descending to fill the mouth of the adept’s nine intestines, beneath the Hidden Source.\n\nUpon completion, softly intone:\n\"Supreme Mystery, how vast and empty,\nBlack qi born in the upper void,\nImperial true illumines the radiant scene,\nNine qi merge in the spirit’s hut,\nTransforming to chant praises in the ten directions,\nSuddenly manifesting at the dawn of light,\nMyriad Perfected refine my immortal self,\nHundred Passes naturally purified,\nSeven Mysteries sever the womb’s tree,\nNine Generations ascend the fortune hall,\nAbove summoning the Radiance Child,\nWith me mounting the flying chariot.\"\nThis done, draw in the jade light and swallow thrice to conclude.\n\nThen recite the *Jade Scripture*. When finished, intone again:\n\"Imperial soul illumines the Primal Alve,\nEver guarding my gate of life,\nProstrate corpses extinguished,\nPreserving the po soul and pacifying the spirit,\nMysterious Mother revolves the light,\nServing the Emperor’s Jade Immortal,\nThe Right Life Grand Unity,\nExtending to my body,\nFeasting in the northern Upper Clarity,\nEnthroned as a Jade Guest,\nLife’s destiny conjoined with the sun’s splendor,\nYears harmonized with the moon’s mist,\nForever aiding the Golden Chamber,\nDawn’s radiance as neighbor,\nDispelling sorrow from the stomach’s gate,\nUprooting suffering from the Three Disciples’ midst,\nFortune accumulates within the Cinnabar Mystery,\nBlessings fill the Mud-Pill Chamber,\nHundred spirits merge with the Imperial Unity,\nGreat transformation in the revolving wind,\nReversing my withered mugwort form,\nRemaking my countenance as an infant,\nGeneration upon generation entering the Immortal Hall,\nMystery upon mystery ascending the Feathered Palace,\nThough great kalpas repeatedly collapse,\nWith the sun I ever grow in glory.\"\n\nWhen reciting the *Scripture of the Supreme Clarity’s Eight Radiance Elder Lord*, one must visualize the Yellow Qi Lord of the Womb, Zu Mingche, and the Heavenly Emperor’s Essence-Soul, Li Weizang—two spirits’ true qi, the color of yellow clouds—entering through the adept’s Mud-Pill Palace and descending to fill the root of the adept’s small intestine’s two apertures.\n\nSoftly intone:\n\"Supreme Clarity illumines the Mystic Hall,\nEight Radiance riding the Heavenly Discipline,\nYellow qi harmonizes with the spirit’s true,\nEssence-soul faces the Imperial Child,\nGrand Unity once inscribed in the life register,\nFive talismans secure immortality,\nBearing immortals with dawn’s radiance,\nRevolving wind to reverse the form’s origin,\nUprooting suffering from seven ancestors,\nTogether rejoicing within the Nine Mysteries.\"\nThis done, draw in the yellow clouds and swallow thrice to conclude.\n\nThen recite the *Jade Scripture*. When finished, intone again:\n\"White clouds merge with dawn’s radiance,\nRiding the plain to meet the Supreme Tenuity,\nAscending to the Imperial Unity’s chamber,\nUnbinding the sash at the August Unity’s steps,\nOpening the Golden Gate’s light,\nThree Yangs summoning the return above,\nRaising my body’s spirits within,\nEnveloping the Supreme Brightness’ majesty,\nGreat Treasure’s Nine Flowers,\nLight illuminating my form,\nSummoning clouds to merge with the true,\nDispersing incense to invite the numinous,\nRebirth in the moon’s womb,\nReceiving life in the sun’s midst,\nYears enjoying radiant splendor,\nLife following without collapse,\nBody as an Immortal King,\nPreserving this Supreme Clarity,\nThe world receives true scriptures,\nMystic splendor in the Jade Court.\"",
      "overlap_context": "ne and coil,\nGenerations preserve virtue and power.\nEternally a Heavenly Immortal,\nSilent and inwardly focused,\nAscending to the Imperial Court.\"*\n\nWhen reciting the *Scripture of the Yellow Radiance Prime Lord of the Stellar Hour*, one must visualize the True Qi of the White Clarity Child of the lung region, the radiant light of the Five Passes, entering through the adept’s Mud-Pill Palace and spreading through the Gate of the lung’s Flowery Canopy, above to connect with the Child of both eyes.",
      "start_char": 10255,
      "end_char": 11560,
      "start_sentence": 332,
      "end_sentence": 361,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.09181189537048,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上玉清隐书灭魔神慧高玄真经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "读青华方诸宫高晨师玉保仙王青童君道经，当思血中赤炁君混离子、司命精魂发纽子，二神真炁如赤云之色，从兆泥丸中入，下布兆百关结节之下。 微祝曰： 晨晖焕东霞，丹景映高清，二真协神宗，落落七华生，五老飞帝席，太一保童婴，锦云曜幽夜，玄玄开重冥，七祖勒符籍，南极受胎灵，高晨盼云舆，运我升飞軿，拔解亿世基，欢我万劫程。 毕，引赤云炁三咽止，便读玉经，经毕，又祝曰： 五道混回，七门始分，南和建节，白帝彰安，灵标理魄，会昌护神，奉符登霄，寝息玉轩，定录琼札，世为天仙，三涂绝破，除伐胞根，死炁沉零，祸轮无连，福臻重枝，庆会华玄，名书玉堂内，世为道德门。 读扶桑大帝九老仙皇君道经，当思上玄元父高同生、下玄玄母叔火王、帝皇太一重冥空、九帝尊曰明真，太帝精魂阳堂王、天帝九关魂绿迥道、天纪帝魂照无阿，七神真炁，混合莲华之形，从兆泥丸中入，下布兆本命之根胞胎大结之中。 微祝曰： 元父玄母，七真齐炁，神公太帝，九老并位，为我固生，拔度十界，日月同符，九帝合契，坐命天魔，万灵来拜，浮景三举上，震丈保亿世。 毕，引莲花之炁三咽止。 便读玉经，经毕，又祝曰： 太玄聚晖，映冠扶晨，太常变景，须臾混分，入兆五府，坚我玉根，双軿太一，合羽扬轮，与兆上升，回转金门，年同日德，体宝金仙，世世昌盛，真符流连，玄玄累叶，名书灵轩，羽籍紫庭，飞香奏烟，福逮百枝，庆溢帝门。 读小有玉真万华先生主图玉君道经，当思三素老君牢张上、正一左仙仲成子、右仙曲文子，三神真炁，混合黄白玄三色之云，从兆泥丸中入，共下布兆鼻下人中。 微祝曰： 玉真生帝景，万华乘云发，三老辅二仙，共镇死户窟，神映七华生，朽骨蒙更蜕，超逸三界庭，五苦咸解脱，得入九天表，上朗高朱日。 毕，引三色之云三咽止。 便读玉经，经毕，又微祝曰： 命门合精，六混七分，太一把籍，司命理神，帝一固形，无英守魂，太迥紫房，奉符帝君，胞树伐灭，断绝血根，七玄更起，沉景生烟，兆得上升，化合帝晨，身映日月，命与天连，重华累晖，咸会上尊，世书灵羽，紫录内宣，乘景三素，北宴高元，号曰仙王，上清真人。 读玄州二十九真伯上帝司禁君道经，当思中央玄一老子林虚夫真炁，黄云之色，布兆阴茎之端； 北方黑帝保成曷真之炁，玄云之色，布兆膀胱之中； 西方白帝彰安幸真炁，素云之色，布兆阴囊之中； 南方赤帝长来觉真炁，绛云之色，布兆口舌之中； 东方青帝雕梁际真炁，青云之色，布兆五藏内。 五帝真炁从兆泥丸中入，下布一身。 毕，微祝曰： 五帝明真，辅仙玄伯，上帝景晖，吐灵敷席，翳翳神曜，徘徊重幂，羽景保录，太一命籍，五炁总魂，三精固魄，金仙炼容，停年返白，拔出幽根，日月同宅。 毕，引五色炁五咽止。 便读玉经，经毕，又祝曰： 上宝月九真，日曦变玉室，呼吸紫微，大混帝一，八烟丛生，百灵明威，九魂离合，三光同晖，天皇在元，紫烟霏霏，五神奉图，始命不亏，变入九官，被服朱衣，腰佩虎章，流云绣帔，帷帐瓓玕，五色徘徊，日月照察，侠以东西，神庭内醴，以除渴饥，三五复返，转藏营机，周流太一，生均两仪。",
      "translated_text": "Recite the *Daoist Scripture of the Azure Florescence, the Lofty Dawn Master, the Jade Guardian, the Perfected Immortal King, and the Azure Lad of the Square Cauldron Palace*. While doing so, visualize the Lord of Crimson Qi within the Blood—Hunli Zi—and the Controller of Life-Spirit Essence—Faniu Zi. The true qi of these two spirits, like crimson clouds, enters from your Mud-Pill Palace and descends to suffuse beneath the hundred joints and nodes of your body.\n\nThen intone the subtle incantation:\n\"Dawn’s radiance gleams with eastern clouds,\nCinnabar light illumines the lofty clarity,\nTwo Perfected harmonize the spirit’s origin,\nLuminous, the Seven Flowers arise,\nFive Elders ascend the Imperial Seat,\nThe Supreme Unity guards the infant’s essence,\nBroidered clouds gleam through the dark night,\nMystery upon mystery unfolds the layered depths,\nSeven Ancestors inscribe their names in the registers,\nThe Southern Culmen receives the numinous embryo,\nThe Lofty Dawn gazes upon the cloud-chariot,\nConveying me to ascend in flight,\nUprooting the foundations of a hundred generations,\nRejoicing in the path of ten thousand kalpas.\"\n\nWhen finished, draw in the crimson cloud-qi three times and cease. Then recite the *Jade Scripture*. When finished, intone again:\n\"The Five Ways merge and return,\nThe Seven Gates first divide,\nThe Southern Harmony raises its standard,\nThe White Emperor manifests peace,\nThe numinous banner orders the po,\nThe Flourishing Assembly guards the spirit,\nReceiving the talisman to ascend the heavens,\nResting in the Jade Pavilion,\nInscribing the record on jade tablets,\nFor generations to be Heavenly Immortals,\nThe Three Paths severed and broken,\nThe root of the womb-cutting eradicated,\nThe qi of death sinks and scatters,\nThe wheel of misfortune unlinked,\nFortune reaches the branching descendants,\nBlessings gather in the flourishing mystery,\nNames inscribed within the Jade Hall,\nFor generations to be of the Gate of Dao and Virtue.\"\n\nRecite the *Daoist Scripture of the Nine Elder Perfected Immortal Sovereigns of the Fusang Great Emperor*. While doing so, visualize the Supreme Mystery’s Primordial Father—Gaotongsheng—and the Profound Mystery’s Mysterious Mother—Shuhuowang—the Supreme Emperor of the Great Unity—Chongmingkong—and the Nine August Emperors, whose honored name is Bright Perfection; the Supreme Emperor’s Essence-Spirit—Yangtangwang; the Heavenly Emperor’s Nine Passes Spirit—Lüjiudao; and the Heavenly Register’s Emperor Spirit—Zhaowu’a. The true qi of these seven spirits, merging into the form of a lotus, enters from your Mud-Pill Palace and descends to suffuse the root of your original destiny—the great node within the womb’s chamber.\n\nThen intone the subtle incantation:\n\"Primordial Father and Mysterious Mother,\nSeven Perfected unite in qi,\nDivine Lords and Supreme Emperor,\nNine Elders share their stations,\nStrengthening my life for me,\nDelivering across the Ten Realms,\nSun and moon share the same tally,\nNine Emperors seal the covenant,\nSeated, the Heavenly Demons command,\nMyriad spirits come to pay homage,\nThe floating light ascends thrice,\nThe Thunderclap safeguards for a hundred generations.\"\n\nWhen finished, draw in the lotus qi three times and cease. Then recite the *Jade Scripture*. When finished, intone again:\n\"The Supreme Mystery gathers its radiance,\nCrowning the Fusang Dawn,\nThe Great Constancy transforms its light,\nIn an instant merging and dividing,\nEntering my Five Palaces,\nSteadying my Jade Root,\nTwin chariots of the Supreme Unity,\nJoining wings to wheel aloft,\nAscending with me,\nRevolving through the Golden Gate,\nYears sharing the sun’s virtue,\nBody treasured as a Golden Immortal,\nGeneration upon generation flourishing,\nTrue talismans flowing unbroken,\nMystery upon mystery layered through the ages,\nNames inscribed in the Numinous Pavilion,\nFeathered registers in the Purple Court,\nIncense wafting, smoke ascending,\nFortune reaching a hundred branches,\nBlessings overflowing the Imperial Gate.\"\n\nRecite the *Daoist Scripture of the Lord of the Diagram, the Jade Lord of the Myriad Flowers, the Master of the Lesser Existence’s Jade Perfection*. While doing so, visualize the Three Primordial Elder Lords—Laozhangshang—and the Orthodox Unity’s Left Immortal—Zhongchengzi—and Right Immortal—Quwenzi. The true qi of these three spirits, merging into clouds of yellow, white, and mysterious hues, enters from your Mud-Pill Palace and descends together to suffuse your philtrum.\n\nThen intone the subtle incantation:\n\"The Jade Perfected engenders the Imperial Light,\nMyriad Flowers ride the clouds forth,\nThree Elders assist the Two Immortals,\nTogether guarding the cavern of death’s gate,\nSpirits illumine the Seven Flowers’ birth,\nRotten bones receive renewal and shedding,\nTranscending the Three Realms’ courts,\nThe Five Sufferings all released,\nAttaining the Nine Heavens’ outer bounds,\nAscending to illumine the Lofty Vermilion Sun.\"\n\nWhen finished, draw in the three-colored clouds three times and cease. Then recite the *Jade Scripture*. When finished, intone again the subtle incantation:\n\"The Gate of Life unites with essence,\nSix merge and seven divide,\nThe Supreme Unity holds the register,\nThe Controller of Life orders the spirit,\nThe Imperial Unity secures the form,\nWu Ying guards the hun,\nTai Jiong’s Purple Chamber,\nReceiving the talisman from the Imperial Lord,\nThe womb’s tree felled and extinguished,\nThe blood’s root severed and cut,\nThe Seven Mysteries arise anew,\nSinking light gives birth to mist,\nYou ascend and transform,\nUniting with the Imperial Dawn,\nBody illumined by sun and moon,\nLife linked with Heaven,\nLayered flowers accumulate radiance,\nAll gathering in the Supreme Honor,\nGenerations inscribed in the Numinous Register,\nPurple records proclaimed within,\nRiding the light of the Three Primordials,\nFeasting in the Northern Loftiness,\nNamed as Immortal King,\nPerfected Person of the Supreme Clarity.\"\n\nRecite the *Daoist Scripture of the Lord of Prohibitions, the Twenty-Nine Perfected Earls of the Mysterious Prefecture and the Supreme Emperor*. While doing so, visualize the true qi of the Central Mystery’s Unity Elder—Lao Zixufu—like a yellow cloud, suffusing the tip of your yin organ; the true qi of the Northern Black Emperor’s Guardian—Baochehe—like a mysterious cloud, suffusing your bladder; the true qi of the Western White Emperor’s Manifest Peace—Xing—like a plain cloud, suffusing your scrotum; the true qi of the Southern Crimson Emperor’s Eternal Awareness—Jue—like a crimson cloud, suffusing your mouth and tongue; and the true qi of the Eastern Azure Emperor’s Carved Beam—Ji—like a blue-green cloud, suffusing your Five Viscera. The true qi of the Five Emperors enters from your Mud-Pill Palace and descends to suffuse your entire body.\n\nWhen finished, intone the subtle incantation:\n\"The Five Emperors illumine the Perfected,\nAssisting the Perfected Earls of the Mysterious,\nThe Supreme Emperor’s radiant light,\nExhaling numinosity to spread its seat,\nVeil upon veil of spirit’s brilliance,\nWandering through layered depths,\nFeathered light safeguards the record,\nThe Supreme Unity commands the register,\nFive qi gather the hun,\nThree essences secure the po,\nGolden Immortals refine their countenance,\nHalt the years and return to youth,\nUproot the hidden roots,\nSun and moon share the same dwelling.\"\n\nWhen finished, draw in the five-colored qi five times and cease. Then recite the *Jade Scripture*. When finished, intone again:\n\"The Supreme Treasure’s Nine Perfected of the Moon,\nThe sun’s brilliance transforms the Jade Chamber,\nInhaling and exhaling the Purple Tenuity,\nThe Great Merger of the Imperial Unity,\nEight mists arise in profusion,\nA hundred spirits manifest their majesty,\nNine hun separate and unite,\nThree Lights share their radiance,\nThe Heavenly Sovereign abides in the Primordial,\nPurple mist swirls and billows,\nFive spirits receive the diagram,\nThe original destiny remains unbroken,\nTransforming to enter the Nine Palaces,\nClad in vermilion robes,\nGirded with tiger-seal pendants,\nSashed with embroidered cloud-streamers,\nCanopied with beaded curtains,\nFive colors swirling and lingering,\nSun and moon illuminating and inspecting,\nFlanking east and west,\nThe spirit’s court within distills sweet dew,\nTo dispel thirst and hunger,\nThree and Five return anew,\nRevolving the hidden mechanism,\nCirculating through the Supreme Unity,\nLife equalizing the Two Modes.\"",
      "overlap_context": "g the return above,\nRaising my body’s spirits within,\nEnveloping the Supreme Brightness’ majesty,\nGreat Treasure’s Nine Flowers,\nLight illuminating my form,\nSummoning clouds to merge with the true,\nDispersing incense to invite the numinous,\nRebirth in the moon’s womb,\nReceiving life in the sun’s midst,\nYears enjoying radiant splendor,\nLife following without collapse,\nBody as an Immortal King,\nPreserving this Supreme Clarity,\nThe world receives true scriptures,\nMystic splendor in the Jade Court.\"",
      "start_char": 11561,
      "end_char": 12811,
      "start_sentence": 362,
      "end_sentence": 389,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.057100772857666,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上玉清隐书灭魔神慧高玄真经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "玉清隐文又祝曰： 太一变六合，五神哺泥丸，七积灭三涂，血尸塞下关，三衿对帝真，拔斫胞树根，丈人号神宗，同心元素君，天皇入太清，五老奉符文，世世登羽宫，重华日中轩，元王始明精，固我本命门，保弼运绿炁，归上谷下玄，玄景□形神，朝跻太上轮，日月并玉衿，年随二景分，丹书玉堂内，位为天上君，左携羽台子，右提金颜仙。 读太无晨中君刊娥眉山中洞宫玉户太素君道经，当思帝卿肇勒精、绛宫中一卿中光坚、下黄庭弼卿归上明，三神真炁，混合青白黄三色之云，从兆泥丸中入，下布兆身三宫本命帝室。 毕，微祝曰： 三真生太无，玉户映晨霞，太素洞元虚，丹灵森朱阿，回神九重府，内唱发琼华，百关纳津液，停年三秀柯，我身腾玉清，七祖离幽都，长保不终劫，万世承仙家。 毕，引三色云炁三咽止。 便读玉经，经毕，又祝曰： 帝一混九玄，太素五华精，宝羽宴玉堂，八风扇太明，高上乘元景，凌梵履昌灵，七化紫房下，九混五帝清，体生六色曜，金映流神形，感濯元炁内，金书玉皇庭。 玉清隐文又祝曰： 灵云始分，白炁郁素，混会九玄，三五流布，帝一解形，超登霄路，太一呼吸，五华坚固，司命主日中，白元司月夜，日中静心，心玄妙悟，夕隐泥丸，百神宣布，二宫可以长生，心脑可以长度。 读西元龟山九灵真仙母青金丹皇君道经，当思大洞帝一尊君父宁在真炁，五色紫云之烟，从兆泥丸中入，下布一形之内，散炁九孔之中。 毕，微祝曰： 九灵通妙化，金仙混扶桑，帝一变百神，合灵西丹皇，上为胎仙母，下号称神宗，曜景绝云杪，萧萧紫微宫，为我执命籍，保真三素房，妙景空中降，炼我反婴蒙，七祖绝苦源，逸超九福堂。 毕，引紫云三咽止。 便读玉经，毕，又祝曰： 太上洞明，飞景九元，结精凝炁，化炁变神，司命混合，散形亿分，千乘火甲，万骑扬幡，俱与太一，上造帝仙，伯无起徘，仲成曲文，一合我炁，再合我神，三合我魄，四合我魂，五合我精，六合我身，我身六合，洞灵启真，八景虚驾，三素浮轮，我与帝一，俱升玉晨，重华累枝，混会天仙，身有道籍，世有生根，金简羽符，名刊日轩，所愿即从，天禄诜诜，所向如心，万福盈门，常存太上，帝一泥丸，雌雄混化，百灵缠绵，读经万徧，云驾来延，携宴五帝，日月九君，号为仙翁，上清真人。 大洞玉清隐祝九天上文，出自高上口诀，解滞散怨，大洞真经三十九章，理极於此。 上则引致高灵之霞映，下则灭於万魔之凶殃。 出秘要四十二阳字号。 诵之一徧，开明幽关三十九户，纳受玉津，死炁沉塞，百神内欢，百神既畅，则声达九玄，炁朗紫霄，响叩玉晨，五帝束带，万灵朝轩，生生来归，七祖升迁，身致羽翼，驾景乘云，飞行玉清，位齐紫宾，此高玄之妙道，玉清之秘篇。 出秘要四十二阳字。 皆授金名玉字，高仙真人。 七百年中，有合此质，听得一传。 后圣曰：得受大洞真经三十九章，修行之日，当先行大洞之仪格，诵玉清隐祝之文，又存思百神内名，外则遏於万试，内则塞於死关。 如此一徧，便得一日一夜。 单诵三十九章，不烦徧徧依旧行其仪轨也。 若明日又登斋诵经者，当更按旧一过行之。",
      "translated_text": "The Hidden Writ of Jade Purity further intones:\nThe Great One transforms the Six Harmonies,\nFive spirits nourish the Mud-Pill Palace,\nSeven accumulations extinguish the Three Paths,\nBlood-corpses block the Lower Pass,\nThree collars face the Imperial Perfected,\nSevering the roots of the womb-tree,\nThe Venerable One is styled Spirit Ancestor,\nOf one heart with the Primordial Plain Lord,\nThe Heavenly Sovereign enters the Grand Clarity,\nFive Elders present the talismanic writ,\nGeneration upon generation ascends the Feathered Palace,\nDouble Flowering in the sun’s central chariot,\nThe Primordial King first illumines essence,\nFirming my root-life gate,\nProtecting and assisting the flow of green qi,\nReturning to the Upper Valley and Lower Mystery,\nMysterious radiance □ spirit and form,\nAscending to the wheel of the Grand Supreme,\nSun and moon join the jade collar,\nYears divide with the twin luminaries,\nCinnabar script within the Jade Hall,\nRanked as Lord of Heaven Above,\nTo the left grasping the Feathered Terrace Lad,\nTo the right lifting the Golden Countenance Immortal.\n\nRecite the *Dawn-in-Utter-None Lord’s Engraved Scripture of Mount Emei’s Grotto Palace Jade Portal Primordial Lord*, contemplating:\nImperial Minister Engraver of Essence in the Crimson Palace,\nCentral Radiance of the Central One in the Firm Crimson Palace,\nYellow Court Assistant Minister Returning to Upper Clarity—\nThree spirit-perfected qi,\nMerging azure, white, and yellow clouds,\nEntering from your Mud-Pill Palace,\nDescending to suffuse your body’s Three Palaces and root-life imperial chamber.\n\nConcluding, softly intone:\nThree Perfected engender Utter-None,\nJade Portal reflects the dawn glow,\nPrimordial Void of the Grand Plain,\nCinnabar numen thick upon Scarlet Mound,\nReturning spirit to the Ninefold Repository,\nInner chant unfurls jeweled blossoms,\nHundred Passes receive the fluid elixir,\nProlonging years with the Three-Flowered Bough,\nMy body soars to Jade Purity,\nSeven ancestors depart the Dark Capital,\nEver preserving beyond kalpas’ end,\nTen thousand generations inherit the immortal lineage.\n\nConcluding, draw in the three-colored cloud-qi, swallowing thrice. Then halt.\n\nProceed to recite the Jade Scripture. Upon completion, further intone:\nImperial Unity merges the Nine Mysteries,\nGrand Plain’s Five-Flowered Essence,\nPrecious plumes feast in the Jade Hall,\nEight Winds fan the Grand Luminance,\nExalted One rides the Primordial Radiance,\nTreading the flourishing numinous,\nSeven transformations descend to the Purple Chamber,\nNine mergers purify the Five Emperors,\nBody generates six-hued brilliances,\nGolden radiance flows through spirit-form,\nPerceiving the bathing of primordial qi within,\nGolden script in the Jade Emperor’s court.\n\nThe Hidden Writ of Jade Purity further intones:\nNuminous clouds first divide,\nWhite qi billows in plainness,\nMerging the Nine Mysteries,\nThree and Five flow and spread,\nImperial Unity releases form,\nTranscending to ascend the celestial path,\nGreat One breathes,\nFive Flowers consolidate,\nLife-Master governs the sun’s zenith,\nWhite Prime rules the moonlit night,\nMidday stills the heart,\nHeart’s mystery wondrously awakens,\nEvening retreats to the Mud-Pill Palace,\nHundred spirits proclaim,\nTwo Palaces may attain long life,\nHeart and brain may endure forever.\n\nRecite the *Scripture of the Nine Numinous True Immortal Mother of the Azure Gold Elixir Sovereign Lord of Western Origin and Tortoise Mountain*, contemplating:\nThe Great Grotto’s Imperial Unity Honored Lord Father reposes in true qi,\nFive-colored purple cloud-smoke,\nEntering from your Mud-Pill Palace,\nDescending to suffuse your singular form,\nDispersing qi through the nine apertures.\n\nConcluding, softly intone:\nNine Numinous penetrate wondrous transformation,\nGolden Immortals merge at Fusang,\nImperial Unity transforms the hundred spirits,\nUniting numen with the Western Cinnabar Sovereign,\nAbove styled Womb Immortal Mother,\nBelow titled Spirit Ancestor,\nRadiant splendor transcends cloud-tips,\nSoughing in the Purple Tenuity Palace,\nFor me wielding the register of life,\nPreserving truth in the Three Plain Chambers,\nWondrous radiance descends from the void,\nRefining me to revert to infancy,\nSeven ancestors sever the source of suffering,\nLeisurely transcend the Nine Felicity Halls.\n\nConcluding, draw in the purple cloud-qi, swallowing thrice. Then halt.\n\nProceed to recite the Jade Scripture. Upon completion, further intone:\nGrand Supreme Grotto Illumination,\nFlying radiance of the Nine Origins,\nCongealing essence, condensing qi,\nTransforming qi, transmuting spirit,\nLife-Master merges and blends,\nDispersing form into myriad parts,\nThousand chariots of fiery armor,\nTen thousand riders brandish banners,\nAll joining the Great One,\nAscending to become Imperial Immortals,\nEldest None-Rising Paces,\nSecond Accomplished Curved Writ,\nFirst merging my qi,\nSecond merging my spirit,\nThird merging my po,\nFourth merging my hun,\nFifth merging my essence,\nSixth merging my body,\nMy body six-merged,\nGrotto numen reveals truth,\nEight Radiant Empty Chariots,\nThree Plain Floating Wheels,\nI and the Imperial Unity,\nTogether ascend Jade Dawn,\nDouble Flowering layered branches,\nMerging with Heavenly Immortals,\nBody holds the Dao register,\nGenerations possess life’s root,\nGolden tablets, feathered talismans,\nName inscribed in the sun’s chariot,\nWishes instantly fulfilled,\nHeavenly emolument abundant,\nDesires as the heart directs,\nTen thousand blessings fill the gate,\nEver abiding with the Grand Supreme,\nImperial Unity in the Mud-Pill Palace,\nFeminine and masculine merge and transform,\nHundred spirits entwine,\nReciting scripture ten thousand times,\nCloud chariots come to welcome,\nFeasting with the Five Emperors,\nNine Lords of Sun and Moon,\nStyled as Immortal Elder,\nPerfected One of the Grand Clarity.\n\nThe Hidden Writ of Jade Purity’s Nine Heavens’ Upper Text,\nIssuing from the Highest Oral Instructions,\nDissolving stagnation, dispersing resentment,\nThe Thirty-Nine Chapters of the Great Grotto True Scripture,\nTheir principles culminate herein.\nAbove, they summon the radiance of exalted numina,\nBelow, they extinguish the misfortunes of ten thousand demons.\nExcerpted from the *Secret Essentials*, Forty-Second Yang Character Section.\n\nReciting once opens the thirty-nine gates of the Dark Pass,\nReceiving jade nectar,\nDead qi sinks and obstructs,\nHundred spirits rejoice within,\nHundred spirits thus unobstructed,\nVoices reach the Nine Mysteries,\nQi brightens the Purple Empyrean,\nEchoes knock at Jade Dawn,\nFive Emperors gird their sashes,\nMyriad numina attend the chariot,\nLife upon life comes to return,\nSeven ancestors ascend and transmigrate,\nBody attains feathered wings,\nRiding radiance, mounting clouds,\nSoaring through Jade Purity,\nRank equal to the Purple Guest,\nThis is the wondrous Dao of the Exalted Mystery,\nThe secret篇 of Jade Purity.\nExcerpted from the *Secret Essentials*, Forty-Second Yang Character Section.\nAll confer golden names and jade characters,\nHighest Immortal Perfected Ones.\nWithin seven hundred years,\nThose whose quality accords may receive a single transmission.\n\nLater Sages say: Upon receiving the *Thirty-Nine Chapters of the Great Grotto True Scripture* and practicing its cultivation,\nFirst perform the Great Grotto’s rites and protocols,\nRecite the Hidden Writ of Jade Purity,\nFurther contemplate the hundred spirits’ inner names,\nExternally blocking the ten thousand trials,\nInternally sealing the death pass.\nThus, one recitation suffices for a day and night.\nReciting the thirty-nine chapters alone,\nWithout the need to repeatedly follow the original ritual protocols.\nIf one intends to ascend the fast and recite the scripture again the next day,\nThen once more follow the original procedure.",
      "overlap_context": "tiny remains unbroken,\nTransforming to enter the Nine Palaces,\nClad in vermilion robes,\nGirded with tiger-seal pendants,\nSashed with embroidered cloud-streamers,\nCanopied with beaded curtains,\nFive colors swirling and lingering,\nSun and moon illuminating and inspecting,\nFlanking east and west,\nThe spirit’s court within distills sweet dew,\nTo dispel thirst and hunger,\nThree and Five return anew,\nRevolving the hidden mechanism,\nCirculating through the Supreme Unity,\nLife equalizing the Two Modes.\"",
      "start_char": 12812,
      "end_char": 14051,
      "start_sentence": 390,
      "end_sentence": 416,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.90845036506653,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上玉清隐书灭魔神慧高玄真经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "凡欲游行五岳，历观群山，留命停白，保寿劫年，未欲飞腾远离世间者，便可以太岁、本命、八节之日，单诵玉清隐祝，内思百神一徧，不须诵玉经也。 如此百褊，则炁参晨霄，百神内缠。 千徧，三元下降，刻名帝篇，长保日月，天地齐年。 万徧道备，乘云驾龙，游行太虚，领括群仙。 此道高妙，慎宣非真。 九天玉清紫文丹章绿字隐文 紫文丹章绿字隐文，一百二十言，乃九天之上炁，凝紫晖之精，结成自然之章，表见玉清宫中。 其文焕曜，照明上清，致高上注笔，通其隐音，以纲维玉处，制命九天，匡御威神，召真检灵。 即元始天王所佩，以传玉清帝君消魔大王、玉清神霄王等，侍文玉童玉女各二十四人，纠於漏慢，营卫佩文者身。 得佩此文，则与九天齐真，名书丹台，位准高玄，身发紫光，项负圆明，游行太虚，十界司迎，致三元下降，同宴霄軿。 修行神仙之道，披诵高上玉清隐书大洞真经，当安身方丈之上，心映紫文丹章，左把流金火铃，右御豁落七元，则玉虚不招而自降，大洞不叩而发关，万真应机而感会，群魔束身而自亡，运策八炁，回转五辰，坐命万灵，役御群仙，炁合高虚，形齐紫宾。 九天之秘奥，玉清之隐文，有泄此章，身被风刀，责及七玄，生死之考，一如九天盟文。 有金名玉字，列图九天，得见此文，当以绛纹之缯三尺为地，以紫笔书丹章於缯上，赍紫纹九十尺，金鱼玉龙，诣师清斋九十日，北向告盟九天而传。 弟子受以锦囊，佩之当心也。 得佩紫文丹章，皆位准高玄，得受玉清隐书，位准太真，坐起寝息，皆与玉虚交缠，玉华卫真於左右，五帝仿髴於寝轩。 不得杂同於常俗，混秽於高真也。 犯则神逝而魔前，被拷而失仙矣。 佩紫文丹章，出入卧息，乃行道之际，恒当先思己身有紫晖之光，玄覆於上，炁绕一身，便叩齿九通而祝曰： 玉虚九重，紫晖八缠，玄光重映，玉清吐津，紫文丹书，表明九天，制命万灵，招役群仙，威摄万万，检翦千千，影响立会，五云发烟，飞舆紫盖，倏忽来前，使我乘空，高登玉晨。 毕，便引紫炁十二咽止。 如此九年，即有紫云之盖映覆兆身，身生紫光，照明十方，通神致真，洞观太虚也。 昔上元夫人以隐文授太和玉女，太和玉女授幼阳君，阳君道成升虚，以文封於九嶷洞室，七百年当授合真通玄之人。 后学精念，自当感会预有缘也。 上清太上玉清隐书灭魔神慧高玄真经竟 释音 檄音窍。",
      "translated_text": "Should one wish to traverse the Five Marchmounts, to wander and observe the myriad mountains, to preserve life and halt the whitening of hair, to safeguard longevity through kalpas of years—yet not yet desire to soar aloft and depart far from the world—then on the days of the Great Year-Star, one’s own life-star, and the Eight Seasonal Nodes, one may simply recite the *Hidden Writ of Jade Purity*, inwardly contemplating the hundred spirits once through, without need to recite the *Jade Scripture*. After a hundred such recitations, qi will ascend to mingle with the dawn clouds, and the hundred spirits will coil within. After a thousand recitations, the Three Primes will descend, one’s name will be inscribed in the Emperor’s register, and one will long preserve the sun and moon, matching the years of heaven and earth. After ten thousand recitations, the Dao will be perfected: one will ride clouds and mount dragons, roam the Great Void, and lead the host of immortals. This Dao is lofty and wondrous; guard it well and do not reveal it to the untrue.\n\nThe *Purple Text, Cinnabar Chapters, Green-Character Hidden Writ*—one hundred twenty words—is the qi of the Nine Heavens above, congealed from the essence of purple radiance, formed into natural chapters that manifest within the Jade Purity Palace. Its text shines resplendent, illuminating the Highest Clarity, enabling the exalted to inscribe its brushstrokes and penetrate its hidden sounds, thereby upholding the Jade Abode, commanding the Nine Heavens, governing and wielding numinous power, summoning perfected ones and inspecting spirits. It was originally the token worn by the Celestial King of Primordial Beginning, transmitted to the Jade Purity Emperor-Lord, the Great King Who Dispels Demons, and the Jade Purity Divine Numinous King, along with twenty-four Jade Lads and Jade Maidens who attend the text, correcting lapses and negligence, and guarding the bodies of those who bear the text.\n\nOne who bears this text becomes equal in perfection to the Nine Heavens, one’s name is inscribed on the Cinnabar Terrace, one’s rank is aligned with the Highest Mystery, one’s body emits purple light, and one’s neck bears a halo of perfect clarity. Roaming the Great Void, the ten realms will welcome one in attendance; the Three Primes will descend, and one will feast together in the cloud-borne chariots of the heavens. To practice the Dao of divine transcendents and recite the *Highest Jade Purity Hidden Writ of the Great Grotto True Scripture*, one should sit upon a square zhang of space, the heart illumined by the *Purple Text, Cinnabar Chapters*. In the left hand, grasp the flowing-gold fire-bell; in the right, wield the *Huoluo* of the Seven Primes. Then the Jade Void will descend unbidden, the Great Grotto will open its gates without knocking, the ten thousand perfected will respond to the moment and gather, and the host of demons will bind themselves and perish. Directing the eight qi, revolving the five celestial bodies, one sits and commands the ten thousand spirits, employs and governs the host of immortals, qi merging with the Highest Void, form equaling the Purple Guest.\n\nThe secret mysteries of the Nine Heavens, the hidden writ of Jade Purity—should one leak these chapters, the body will be scourged by the wind-knife, and accountability will extend to the Seven Ancestors. The trials of life and death shall be as the oaths of the Nine Heavens. Those whose golden names and jade characters are arrayed in the charts of the Nine Heavens, who are deemed worthy to behold this text, shall take three feet of crimson-woven silk as ground, inscribe the cinnabar chapters upon the silk with purple brush, and present ninety feet of purple-woven silk, a golden fish, and a jade dragon. Proceeding to the master, purify oneself for ninety days, face north, and swear an oath to the Nine Heavens before transmission. The disciple shall receive it in a brocade pouch, wearing it over the heart.\n\nThose who bear the *Purple Text, Cinnabar Chapters* shall have ranks aligned with the Highest Mystery; those who receive the *Jade Purity Hidden Writ* shall have ranks aligned with the Great Perfected. In sitting, rising, sleeping, and resting, they shall ever intertwine with the Jade Void, the Jade Flower shall guard the perfected at their left and right, and the Five Thearchs shall hover near the sleeping chamber. One must not mingle with the common and vulgar, nor defile the exalted perfected. To violate this is to invite the departure of spirits and the approach of demons, to be scourged and lose one’s immortality.\n\nWhen bearing the *Purple Text, Cinnabar Chapters*, whether entering or exiting, resting or sleeping, or at the time of practicing the Dao, one should always first contemplate one’s body suffused with purple radiance, darkly veiled above, qi swirling around the body. Then knock the teeth nine times and invoke:\n\n*\"Ninefold Jade Void, eightfold purple radiance coiled,\nDark light layered, Jade Purity spills its essence.\nPurple text, cinnabar writ, manifesting the Nine Heavens,\nCommanding the ten thousand spirits, summoning and employing the host of immortals.\nMight subduing the myriad myriads, inspecting and shearing the thousand thousands.\nEcho and shadow instantly gather, five clouds emit smoke.\nFlying chariots and purple canopies swiftly arrive before me.\nMay I ride the void, ascend the Jade Dawn.\"*\n\nConclude by drawing in the purple qi twelve times and swallowing it. After nine years of this, a canopy of purple clouds will shine and cover one’s body, one’s body will generate purple light illuminating the ten directions, one will communicate with spirits and summon the perfected, and one will penetrate and observe the Great Void.\n\nOf old, the Lady of the Upper Prime transmitted the hidden writ to the Jade Maiden of Great Harmony; the Jade Maiden of Great Harmony transmitted it to the Lord of Young Yang. When the Lord of Yang perfected the Dao and ascended the void, he sealed the text within the grotto-chamber of the Nine Doubts, where it shall be transmitted after seven hundred years to those whose truth accords and whose mystery is penetrated. Later students who cultivate with devotion shall naturally feel the resonance if they are predestined.\n\n*The Highest Jade Purity Hidden Writ of the Great Grotto True Scripture for Destroying Demons and Cultivating Divine Wisdom of the High Mystery* concludes.\n\nExplanation of Pronunciation:\n*Xi* (檄) is pronounced *qiao*.",
      "overlap_context": "m the Great Grotto’s rites and protocols,\nRecite the Hidden Writ of Jade Purity,\nFurther contemplate the hundred spirits’ inner names,\nExternally blocking the ten thousand trials,\nInternally sealing the death pass.\nThus, one recitation suffices for a day and night.\nReciting the thirty-nine chapters alone,\nWithout the need to repeatedly follow the original ritual protocols.\nIf one intends to ascend the fast and recite the scripture again the next day,\nThen once more follow the original procedure.",
      "start_char": 14052,
      "end_char": 14998,
      "start_sentence": 417,
      "end_sentence": 442,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.47634315490723,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上玉清隐书灭魔神慧高玄真经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "嵎元俱切。 畿渠希切。 摅音樗。 参差上疏臻切，下又宜切。 杪音眇。 罴班糜切。 皛音皎。 弇衣检切。 降伏上音杭。 斌纽民切。 巾金上音靳。 三便下平声。 昱音育。 幂莫狄切。 #1『曲』原作『典』。",
      "translated_text": "Pronunciation Guide:\n*Yu* (嵎) is pronounced *jū* (俱-cut).\n*Ji* (畿) is pronounced *qí* (渠-xī-cut).\n*Shū* (摅) is pronounced *chū*.\n*Cēn* (参) is pronounced *shēn* (疏-zhēn-cut); *cī* (差) is also pronounced *yí*.\n*Miǎo* (杪) is pronounced *miǎo*.\n*Pí* (罴) is pronounced *bān-mí*.\n*Xiǎo* (皛) is pronounced *jiǎo*.\n*Yǎn* (弇) is pronounced *yī-jiǎn*.\n*Xiáng* (降) in \"subdue\" is pronounced *háng*.\n*Bīn* (斌) is pronounced *nín*.\n*Jīn* (巾) in the upper register is pronounced *jìn*.\n*Sān* (三) in the third instance is read in the level tone.\n*Yù* (昱) is pronounced *yù*.\n*Mì* (幂) is pronounced *mò-dí*.\n#1 The character *qū* (曲) was originally written as *diǎn* (典).",
      "overlap_context": "ealed the text within the grotto-chamber of the Nine Doubts, where it shall be transmitted after seven hundred years to those whose truth accords and whose mystery is penetrated. Later students who cultivate with devotion shall naturally feel the resonance if they are predestined.\n\n*The Highest Jade Purity Hidden Writ of the Great Grotto True Scripture for Destroying Demons and Cultivating Divine Wisdom of the High Mystery* concludes.\n\nExplanation of Pronunciation:\n*Xi* (檄) is pronounced *qiao*.",
      "start_char": 14998,
      "end_char": 15089,
      "start_sentence": 443,
      "end_sentence": 457,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.026601791381836,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太上玉清隐书灭魔神慧高玄真经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}