{
  "source_id": "上清天枢院回车毕道正法",
  "source_file": "chunked_daozang\\上清天枢院回车毕道正法.json",
  "total_chunks": 20,
  "total_original_chars": 14477,
  "total_translated_chars": 84251,
  "total_translation_time": 441.8605649471283,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\方法类\\上清天枢院回车毕道正法.txt",
    "category": "方法类"
  },
  "full_translation": "**The Orthodox Methods of the Upper Clarity Heavenly Pivot Institute’s Returning Chariot and Concluding Dao**\n\n**Title:** *The Orthodox Methods of the Upper Clarity Heavenly Pivot Institute’s Returning Chariot and Concluding Dao*\n**Author:** Unknown\n**Volume:** Three\n**Source Text:** *Daoist Canon of the Orthodox Unity* (Dongxuan Section, Methods Category)\n\n---\n\n### *The Orthodox Methods of the Upper Clarity Heavenly Pivot Institute’s Returning Chariot and Concluding Dao, Volume One*\n\n#### **Seal of the Nine Elders of the Upper Clarity Immortal Capital**\nThe Seal of the Nine Elders of the Upper Clarity Immortal Capital, when worn into the mountains, subdues wolves, tigers, and spectral beings; when crossing rivers, winds and rains align to aid passage. It commands all grotto-heavens and immortal officials. If one bears this seal, weapons cannot harm, tigers cannot wound, waters cannot drown; in times of great peril, deliverance is assured. For ordinary folk, it prolongs life, suppresses malevolent spirits, and repels all evil. To treat night terrors in children, fright-wind, and all manner of ailments in adults, burn the seal to ash and administer it with frankincense decoction—efficacy is immediate. It hastens childbirth and expels stillborn fetuses; when worn, it stabilizes pregnancy. For women without children, it brings conception. It resolves curses, redresses grievances, sharpens the mind, and fulfills all uses.\n\nThe seal measures two *cun* and two *fen* in width, perfectly square, eight *fen* thick. Its inscription consists of eight characters in two lines of stacked seal script.\n\n---\n\n#### **Seal of Governance and Universal Command**\nThe Seal of Governance and Universal Command serves as a military seal. Its bearer commands all spirits, immortals, officials, territorial deities, city gods, earth temples, and spectral soldiers across the Three Realms, regardless of rank. Worn, it carries the authority of the Celestial Emperor; all ferocious spirits submit. Without this seal, those practicing methods cannot deploy spectral troops. When the seal moves, the troops advance; when it halts, they stop. To move the seal is to move the army. If troops disobey, all—regardless of rank—are executed, as spectral enforcers ensure justice. After execution, a memorial may be submitted to the Celestial Emperor.\n\nThus, troops follow the seal’s turn, generals obey its commands; violations of orders incur severe penalties.\n\nThe seal measures two *cun* and two *fen* in width, perfectly square, eight *fen* thick. Its inscription consists of six characters in two lines of stacked seal script.\n\n---\n\n#### **Seal of the Great Heavenly Thunderfire**\nThe Seal of the Great Heavenly Thunderfire governs all mountains, rivers, forests, temples, altars, dragons, and *shen* across the world; when the seal stirs, thunder responds. This seal must not be used alongside others. To summon sweet rains, inscribe an iron plaque at a dragon’s abode, seal it with paper, and impress it with this seal. Have someone cast it into water, and the dragon spirit will rise at once. If waters harbor monsters, forests spawn demons, or ancient temples invite disaster, draft a document, affix the seal, and impress it—waterborne creatures will perish, temples collapse, forests wither, or be consumed by celestial fire and lightning.\n\nThe seal measures two *cun* and two *fen* in width, perfectly square, eight *fen* thick. Its inscription consists of six characters in two lines of stacked celestial seal script.\n\n---\n\n#### **Seal of the Intendant of City Gods**\nThe Seal of the Intendant of City Gods confers the office of Intendant of City Gods, acting on Heaven’s behalf. Those appointed must possess this seal; without it, they cannot traverse the world. Wherever the city god travels, yin officials report, and spectral escorts attend. Assigned assistant soldiers and clerics accompany them through mountains, forests, temples, and across rivers or seas. Day and night, subordinate troops remain at their side. All petitions to city gods require this seal for immediate response. If city god troops fail to arrive or disobey, a memorial may be submitted to the Celestial Emperor to demote or relocate them according to law.\n\nThe seal measures two *cun* and two *fen* in width, perfectly square, eight *fen* thick. Its inscription consists of six characters in two lines of stacked celestial seal script.\n\n---\n\n#### **Seal of the Upper Clarity Heavenly Pivot Institute**\nThe Seal of the Upper Clarity Heavenly Pivot Institute serves as the bureau for memorials to the Three Heavenly Gates of Upper Clarity. For mortals practicing methods, submitting memorials to celestial courts, or issuing directives to spirits of the middle and lower realms, this seal is essential. Excluding the Celestial Emperor, memorials may be submitted to all—from the Five Peaks and famous mountains of the middle realm to the gods of Fengdu in the lower realm, regardless of rank. Worn, it dispels evil; ingested, it cures illness. Wherever it travels, all spirits submit, and spectral attendants accompany its bearer.\n\nThe seal measures one *cun* and eight *fen* in width, one *cun* and nine *fen* in length. Its inscription consists of six characters in two lines of stacked seal script.\n\n---\n\n#### **Seal of the Great Master of Heavenly Methods**\nThe Seal of the Great Master of Heavenly Methods commands all spectral beings and the Six Grotto Demon Kings. Wherever malevolent spirits wreak havoc, dragons or *shen* stir calamity, or harm befalls the people, all talismans and registers require this seal. For those wronged by curses, ancestral spirits, or karmic debts of life or wealth, wearing this seal keeps vengeful spirits at bay and wards off evil karma. It dispels nightmares, harmonizes all affairs, cures chronic ailments, prolongs life, prevents poisoning, and averts the Nine Worms.\n\nIngested regularly, it eradicates long-standing illnesses.\n\nTo expel stillborn fetuses or hasten childbirth, burn the seal to ash and ingest it.\n\nThe seal measures one *cun* and eight *fen* in width, one *cun* and nine *fen* in length, its inscription consisting of six characters in two lines of stacked seal script.\n\n**Vermilion Luminous Divine Talisman of Supreme Purity**\n*Scattered Form* | *Gathered Form*\n\nThe Vermilion Luminous Divine Talisman of Supreme Purity is the true *qi* of the Seven Primordial Lords of the Northern Dipper, naturally assuming form. Issued by the Celestial Pivot Bureau of Supreme Purity, it may shatter demonic shrines, expel evil, enter plague-ridden zones, and repel epidemics.\n\nWorn constantly, it shields the body, rendering all malevolence powerless to assail; spirits behold it as a towering mountain of fire.\n\nRegular ingestion sharpens the mind, prevents malignant ailments, neutralizes poisons, and grants fearlessness before blades.\n\nIt cures all manner of grave illnesses and alleviates pain. It treats madness, night terrors in children, convulsions, and febrile seizures; ensures safe pregnancies, hastens labor, expels stillborn fetuses, dispels ghostly *qi* and spectral pregnancies, eliminates the Three Corpses, and severs demonic unions. Steeped in decoctions, its efficacy is unfailing.\n\nTo inscribe this talisman, form the mudra with the left hand by pressing the *wu* finger upward while reciting the incantation:\n\n*Incantation:*\n\nThe Seven Perfected of the Northern Dipper, great deities of the celestial center.\nAbove, they ascend to the Golden Gates; below, they overspread Kunlun.\nThey regulate the cosmic net and govern the framework of Heaven and Earth.\nGreedy Wolf, Giant Gate, Wealth Storage, Literary Star,\nIntegrity and Chastity, Martial Star, Breaking Army, and the Auxiliary Star.\nThey encompass the great celestial realm, penetrating even the tiniest speck of dust.\nWhat disaster do they not eradicate? What blessing do they not bestow?\nThe primordial imperial *qi* comes to merge with my body.\nWherever the Celestial Pivot points, it revolves day and night without cease.\nThose who dwell apart from petty men, who seek the Dao and pursue the Perfected,\nshall constantly behold the august countenance and be granted longevity.\nThe Most High Jade Emperor, the Purple Tenuity Emperor Lord.\nThe Three Terraces gave me birth, the Three Terraces nurtured me,\nthe Three Terraces protected me, □□□□□□□.\n\n*Incantation:*\nQian, the Creative, is strong and unswerving.\nSun and moon are my soldiers.\nThe divine talisman enters the five viscera,\nforever preserving peace and tranquility.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\n**The Divine Talisman of the Nine Prisons of Highest Clarity**\nThe Divine Talisman of the Nine Prisons of Highest Clarity is employed to remedy spectral and demonic harms afflicting the human realm, where malevolent toxins and inauspicious omens arise.\nIt governs doors opening and closing, wells and springs surging and boiling, household pots and cauldrons emitting eerie sounds, insects and rodents behaving strangely, and all manner of apparitions manifesting in forms and shadows, driving people to madness, inflicting chronic illness, and confining them to bed, where remedies prove ineffective.\nBeneath the dwelling, foul and putrid ghosts and defiling spirits persist unceasingly.\nPresent a written petition to this court for endorsement.\nInscribe the talisman on an iron plate with raw cinnabar, following the prescribed method, and bury it beneath the dwelling’s ground.\nTo establish the Fengdu Prisons, use a piece of yellow silk, one foot and two inches in length and seven inches in width, inscribe the talisman upon it, and affix it within the prison.\nIf water spirits cause mischief, cast the talisman into the water.\nFor iron plates, larger ones measure two feet and four inches in length and one foot and two inches in width; smaller ones measure one foot and two inches in length and seven inches in width. Inscribe them accordingly.\nThis talisman must be drawn on a *wu* day; it may not be drawn on other days.\nWhile inscribing, stand in a *ding*-shaped stance, ensuring no one witnesses the process.\nForm the mudra with the left hand by pressing the thumb against the middle joint of the middle finger, recite the incantation, and then inscribe the talisman.\n\n*Incantation:*\nSpirits of the Nine Prisons, great deities of Fengdu,\nZhang and Ma, the Four Poisons, subdue and capture demonic spirits.\nGolden nets and iron webs enclose and seize perverse essences.\nBy the edict of the Three Heavenly Emperors, the law is strictly enforced.\nThe earth gods of the nine provinces and the local deities dispatch their troops.\nWind, fire, thunder, and lightning reduce ghosts to dust.\nWith a hundred thousand, ten thousand, a thousand legions,\nblack winds and fire bells resound.\nThe prison is named Great Fire—none escape to be reborn.\nIron lions and bronze dogs devour your forms.\nWith the first stroke, Heaven and Earth are inscribed;\nwith the second, essences are extinguished;\nwith the third, the Wind Earl is summoned;\nwith the fourth, the prison is completed.\nThe divine talisman descends to suppress; myriad ghosts are overthrown.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nAfter reciting the incantation seven times, the talisman is complete.\n\n*Incantation:*\nSpirits of the Nine Prisons of Fengdu,\nby the Emperor’s decree, they are dispatched.\nThose who dare disobey shall be punished by the soldiers of the Five Peaks.\nThe Six Ding and Six Jia spirits seize them; the steps of the Dipper and Pivot are merciless.\nThe edict is entrusted beneath the Pivot Star—no ghost retains its form.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation seven times, spray water seven times upon the talisman, and release the mudra.\n\n**The Divine Talisman of Thunder Duke of Highest Clarity**\nThe Divine Talisman of Thunder Duke of Highest Clarity is employed to remedy pestilential *qi*, miasmic *qi* from mountains and mists, the five types of *gu* poison, consumptive illnesses, mountain spirits and demonic entities, violent and unrestrained wandering dead, lingering corpses and ancient anomalies, those who drowned, hanged themselves, died in battle, by poison, or in childbirth, as well as wandering spirits of forests and trees that afflict the dwelling’s earth, and deities worshipped by others who have been sent but refuse to depart, or graves that bring forth calamities.\nPresent a written petition to this court for endorsement, and deliver it to the local earth god before inscribing the talisman on an iron plate.\nThis talisman consists of five strips, to be buried in the five directions.\nGhosts and spirits will perceive only thunder and fire engulfing the dwelling, leaving them no place to enter, or the afflicted household may dream of their home being consumed by fire.\nIn households struck by pestilence, the afflicted will see great flames and experience a frenzied state, but upon breaking into a cold sweat, they will immediately recover.\nIf ancient temples harbor inauspicious omens or forests and trees become instruments of harm to the people, inscribe one talisman and bury it beneath the temple or trees. The temple will crumble on its own, and the forest will wither; otherwise, heavenly fire will consume them.\nIf water harbors anomalies, inscribe one talisman and cast it into the water. The anomaly will vanish, the ghost will be driven away, and a dragon will arise.\nIron plates must be forged on a *water* day and inscribed on a *fire* day.\nThe iron plate measures one foot and four inches in length and eight inches in width.\nInscribe it within a purified chamber, stepping the *ding*-Pivot three times. Form the mudra with the left hand by pressing the *fire* day’s palace, using the *chen* position as the seal, recite the incantation, and inscribe the talisman.\n\n*Incantation:*\nThunder Duke of the Capital Heaven, who summons clouds and shakes the winds.\nGreen thunder with crimson *qi* penetrates the nine palaces.\nCrimson thunder with white *qi* ascends to the highest heavens.\nWhite thunder with black *qi* roams the northern Fengdu.\nBlack thunder with yellow *qi* surges through the Great Ultimate’s primordial axis.\nYellow thunder with blue-green *qi* fills the empty void.\nThe celestial fire realm blazes with scorching winds.\nWhat spirit does not submit? What ghost does not obey?\nThose who oppose me perish; those who follow me are enfeoffed.\nNorthern clouds, black calendars, the Nine Uglies, and the Purple Youths.\nThe Earl of Wind and the Master of Rain drive lightning and consume winds.\nWhere the divine talisman arrives, no perverse ghost remains.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nAfter reciting the incantation fourteen times, the talisman is complete. Bury it beneath the dwelling’s ground.\n\n*Incantation:*\nGreat Thunder Duke of the Capital Heaven,\nwhose thunderclaps transform the empty void.\nThree hundred thousand blades and soldiers scatter in the crimson cavern.\nThose who dare disobey shall face the stern decree without mercy.\nEntrusted beneath the Pivot Star, they become forever pure and serene winds.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation eighty-one times, spray water nine times upon the talisman, and release the mudra.\n\n**The Divine Talisman of Fire Bells of Highest Clarity**\n\nThe **Divine Talisman of Fire Bells of Highest Clarity** addresses women who fail to conceive, suffer unstable pregnancies, or miscarry within three to five months; those whose children do not survive past one or two years; and cases where despite extensive prayers and offerings, no remedy proves effective. Such afflictions are no ordinary matter. They may arise from adverse *fengshui* in the household, malign influences from ancestral graves, lingering *fushi* (buried corpses) in the dwelling, inauspicious wells or stoves, ritual transgressions, baleful stellar deities, marital incompatibility in the couple’s destinies, ancestral wrongdoing, past-life neglect of descendants, or offenses against parents by one’s own forebears—or from uncleanliness within the home.\n\nTo ensure robust offspring and longevity, strict abstinence is required: on the new and full moons, the waxing and waning quarters, the four seasons and eight solar terms, the *jiazi* and *gengshen* days, during great winds or rains, extreme cold or heat, after excessive eating or drinking, under the stars and moon, before well and stove deities, amid thunder and lightning, when auspicious clouds appear, or during solar and lunar eclipses—all such times demand restraint from conjugal relations. Adherence to these precepts ensures stable conception, perfect features in the child, and extended blessings of fortune and longevity. Failure to comply, even if the firstborn survives, will result in ugliness, poverty, or premature death.\n\nFor such cases, submit a written petition to this institute for endorsement. Inscribe the talisman as prescribed, and have the couple wear it. Within a month, auspicious dreams will herald conception, and a noble child will be born. Even after birth, ensure the child wears this talisman to remain free from illness, enjoy lasting fortune and longevity, and be shielded from malevolent spirits and all harm.\n\nIf inscribed on iron or wooden plaques of any size, burned with incense, and venerated, the talisman also repels plagues and fire disasters. Write it in cinnabar, pressing the left thumb to the *yin* position while forming the mudra, and recite the incantation as you inscribe it. Those who wear or venerate it will be protected by celestial envoys and spirit officials.\n\n*Incantation:*\nGreat Fire Bells of the Void,\noverseeing life in the highest heavens.\nHolding the registers, wielding the ledgers,\nHan Gong, who cherishes life.\nThe Five Emperors shatter souls,\nthe Three Terraces bestow fates.\nThe Seven Primes assist the *po*,\nthe divine origin upholds the lineage.\nCorpse-ghosts disperse and converge,\nno ghost shall be left destitute.\nThey receive human destinies,\nslaying evil and banishing traces.\nBy decree of Heaven, eternally granted,\nthey dwell in the immortal palace.\nThe Great Spirit of Emptiness,\nsevering evil and expelling misfortune.\nThe Nine Heavens’ Controller of Destinies,\nordains the Primordial Ancestor.\nInscribing life’s roots,\nenlightening human transcendence.\nCutting off rebellious ghosts,\nslashing away evil trails.\nThe divine talisman shelters,\nits true form in purple clouds.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation twenty-one times to complete the inscription.\n\n*Additional Incantation:*\nThe Great Fire Bells of the Celestial Circuit,\npreserving life and extending years.\nThe Three Corpses all disperse,\nthe Numinous Treasure guards eternal life.\nThey reject the destitute and lawless,\nseeking only the perfection of the Dao.\nSuppressing the Three Yellow Chapters,\nthe Five Peaks in azure emptiness.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation thirty-six times, spray water once upon the talisman, and release the mudra.\n\n---\n\n**The Divine Talisman of Ding and Jia of Highest Clarity**\nThe **Divine Talisman of Ding and Jia of Highest Clarity** remedies transgressions against the Grand Year (*Taisui*), earth deities, and *tufu* spirits; or when others’ construction projects cause *feitu* (flying earth) to afflict the dwelling. It also addresses burial offenses against mountain spirits, adverse *fengshui*, frequent calamities, genital sores in women, repeated scalds or burns, chronic illness unresponsive to medicine, baleful stars aligning with one’s fate, causing confusion, procrastination, restless dreams, and household unrest. It counters *cixiongsha* (male-female killing stars), funeral processions, curses from others, persistent illness, mental agitation, and family members afflicted by madness. It dispels *fushi* (lingering corpses), malevolent entities, self-inflicted harm, nocturnal apparitions, lanterns lit or fires set by unseen hands, terrorizing of women and children, and inexplicable loss of wealth.\n\nSubmit a written petition to this institute for endorsement, then inscribe this divine talisman. Whether venerated or worn, its efficacy is immediate. For construction projects, inscribe twenty-four copies of this talisman and affix them around the dwelling—no need to suspend work, as benevolent spirits will guard the site, and baleful stars or malevolent forces will dare not harm.\n\nInscribe the talisman using raw cinnabar, pressing the left thumb to the *wu* position while forming the mudra, and recite the incantation as you write. Its power is infallible.\n\n*Incantation:*\nGenerals Ding and Jia,\nrevered deities of Tianpeng.\nThe Three Terraces lend aid,\nthe Six Jia and Six Ding.\nNine Uglies lead the vanguard,\nmountain spirits are vanquished in the rear.\nThe spirit of springs and streams aids the crossing,\nby the Emperor’s decree they march.\nThe lands of the Nine Provinces,\nmountains, marshes, rivers, and springs.\nThe Twenty-Eight Constellations,\nthe Six Spirits at peace.\nThe Divine Youth executes commands,\nthe Eight Trigrams honor Qian.\nThe Vermilion Bird assists,\nthe Dark Warrior resists.\nThe Azure Dragon presides,\nthe White Tiger submits.\nAbove, they commune with the Golden Gates,\nbelow, they unite with Qian’s origin.\nCommanding ghostly soldiers,\ntheir report ascends to Heaven.\nThe talisman’s master is the Pivot Star,\nall myriad evils are crushed and expelled.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation twenty-one times to complete the inscription.\n\n*Additional Incantation:*\nGreat Generals Ding and Jia,\nthe sixty deities of Supreme Yang.\nThe Most High and Lofty Dao,\ndecrees the Pivot Star Lord.\nSeizing mountain and marsh ghosts,\nsubduing the Yellow Earth spirits.\nAny who resist,\nQian’s origin brings harmony and virtue.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation eighty-one times, spray water once upon the talisman, and release the mudra.\n\n---\n\n**The Divine Talisman of the Seven Primes of the Northern Dipper of Highest Clarity**\nThe **Divine Talisman of the Seven Primes of the Northern Dipper of Highest Clarity** remedies the lingering consequences of past evil deeds, ancestral curses, and transmitted consumptive illnesses that spread contagiously, defying all medical treatment, until the body withers and the limbs waste away. If one’s fate is not yet exhausted, the affliction may first pass to descendants, perpetuating an unending cycle of suffering.\n\nThus did the Celestial Emperor take pity, bestowing this sacred talisman. Have it transcribed in seal script and burned to ashes. Take seven willow twigs, each carved with the character for \"child,\" and steep them in ashless wine. Drink three doses daily, and within ten days the worms shall perish, and the body gradually restore itself. Those afflicted with such conditions must submit a written petition to this institute, where their circumstances shall be recorded and presented to the Celestial Emperor. A memorial shall also be dispatched to the sacred mountains and rivers to seek absolution. Only then may this talisman be transcribed, given to the sufferer, and swallowed according to the prescribed method. Additionally, transcribe twenty-one copies of this talisman, affix them to the four corners of the dwelling, and carry one on the person. Auspicious dreams shall soon follow, and the Perfected Ones of the Highest Clarity shall descend with true qi to guard the body. Wearing this talisman ensures protection of life, defense of the person, averts misfortune, and secures great fortune for the household.\n\nThis talisman must be transcribed with cinnabar, using the left thumb to press the \"zi\" position as the mudra while reciting the incantation. The incantation reads:\n\nThe Seven Stars of the Northern Dipper,\nJade Perfected, divine and numinous.\nGreedy Wolf and Great Gate,\npreserve life and grant enduring glory.\nSalary Star and Literary Curve,\nbestow wisdom upon your servant.\nIntegrity Star and Martial Tune,\nguard your servant in peace.\nBroken Soldier and Auxiliary Star,\nshield your servant’s form.\nEver dwell in fortune,\neternally abide in blessed longevity.\nInscribe in the register of life,\nstrike from the ledger of death.\nSpirit clear, qi refreshed,\npenetrating the hidden and obscure.\nCommand demons, subdue ghosts,\nall malevolent forces topple and fall.\nThose who cultivate the Dao and refine the true,\nmay their aspirations be fulfilled.\nThe Seven Primes extend their protection,\nascending to the Purple Court.\nThe spirit lords of the five viscera,\neach safeguard in tranquility.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation fourteen times to complete the transcription.\n\nAnother incantation reads:\nGreat Sage of the Seven Primes,\nsupreme deities of the heavens.\nGrant eternal longevity,\nthe Three Corpses flee in disarray.\nThe mighty divine general, Lifting Ram,\nseals the gate of death.\nDhāraṇī scatters flowers,\nprolonging the years of life.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite seven times, spray water once upon the talisman, and release the mudra.\n\n**The Divine Talisman of the Three Terraces of Highest Clarity**\nThe **Divine Talisman of the Three Terraces of Highest Clarity** embodies the constellation of great peace and fortune, governing all affairs. When one’s fate aligns with this stellar configuration, yet their fortune remains obstructed, malignant stars cast their baleful influence, repeatedly inviting official disputes, pestilence, and jaundice to the household. The eldest son often falls ill, women endure difficult childbirth, and ancestral enemies or creditors exact their due in life or wealth, with no means of escape. Submit a written petition to this institute, whereupon this true talisman shall be transcribed on yellow silk and worn upon the head. Immediately, the baleful stars shall withdraw, and vengeful ghosts shall not intrude.\n\nThis talisman is the hidden treasure of the heavens, the most true and precious. Using the left thumb to press the \"chen\" position as the mudra, recite the incantation while transcribing. The incantation reads:\n\nThree Terraces Star Lords,\nguard my form.\nWith celestial cover,\npurple qi flows smoothly.\nThe Nine Primes gather,\nsevering and subduing with might.\nThe Great One bends to me,\nthe *River Chart* and Six Classics.\nHighest Perfected Kings,\nsoaring through the heavens, self-sealed.\nFree from sorrow, Origin Prime,\nilluminating the essence of the embryo.\nFour fierce steeds arrayed,\nbanners, drums, and golden bells.\nMighty Celestial Armored Soldiers,\nthe Six Jia and Six Ding.\nRoaming the world,\nconcealing my form.\nWhat disaster dares appear?\nWhat ghost dares glare?\nThose who cast baleful eyes shall perish,\nthose who glare shall fall.\nA single talisman,\nand Heaven shall not see my form.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation fourteen times to complete the transcription.\n\nAnother incantation reads:\nThe Three Terraces bring me forth,\nmy life granted longevity.\nThe Three Terraces nurture me,\nthe Celestial Emperor protects and sustains.\nThe Three Terraces guard me,\neternal peace and tranquility.\nDecreed to the Mighty Ridge below,\norigin, prosperity, great benefit, and virtue.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation forty-nine times, spray water once upon the talisman, and release the mudra.\n\n**The Divine Talisman of the Black Killer of Highest Clarity**\nThe **Divine Talisman of the Black Killer of Highest Clarity** remedies the mischief of water monsters, river dragons, and sea serpents that stir winds and waves, capsizing boats and demanding sacrifices, thereby harming lives. Submit a written petition to this institute, whereupon an iron plaque, one foot and two inches in length and seven inches in width, shall be inscribed with this talisman in cinnabar and placed to suppress the site of the malevolent activity. The dragon or serpent shall immediately relocate. When the Black Killer Perfected Lord hears of a dragon or serpent violating the talisman, he shall personally descend to subdue it. When crossing rivers or seas, transcribe the talisman on paper and wear it to avoid water calamities and repel aquatic monsters. It also pacifies households and dispels disasters and strange occurrences.\n\nUsing the left thumb to press the \"hai\" position as the mudra, recite the incantation while transcribing, and use cinnabar. The incantation reads:\n\nBlack Killer Perfected Lord,\nyour radiance transforms sun and moon,\nyour might stabilizes Heaven and Earth.\nWielding talismans to command and record,\nsealing the gates of ghosts.\nRoaming the world,\ncapturing and subduing spirits.\nDivine soldiers deploy qi,\nsweeping away the Five Pestilences.\nLeft and right officers and soldiers,\nthe Three and Five Generals.\nThunder Lords and lightning bolts,\ncharging through clouds.\nSwords like rain,\nbanners and weapons like clouds.\nSpitting fangs and exerting strength,\nshattering their forms.\nThe Earth Gods of the Nine Provinces,\nthe blood-fed soldiers.\nThe talisman’s decree descends,\nthe law is obeyed.\nThose who defy,\nshall be slain without mercy.\nKui and Dragon resplendent,\nred clouds and the Purple Court.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation eighteen times to complete the transcription.\n\nAnother incantation reads:\nBlack Killer, mighty divine,\nboundlessly aiding the Dharma realm.\nSeizing demons, binding evil spirits,\ntraversing the celestial spheres.\nDriving dragons into rivers and seas,\nreaching the suffering in hidden realms.\nGolden swords sever malevolent forces,\nghosts and demons shall yield.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation twenty-one times, spray water once upon the talisman, and release the mudra.\n\n**The Divine Talisman of the True Forms of the Five Peaks of Highest Clarity**\nThe **Divine Talisman of the True Forms of the Five Peaks of Highest Clarity** subdues wolves and tigers when entering mountains and tames dragons and serpents when entering water.\n\nWearing it brings auspiciousness and averts calamities. It prevents damage to houses from insects and ants, strange occurrences when birds fly into dwellings, and the appearance of snakes and vermin. In such cases, submit a petition to this court for registration, then inscribe this talisman on a catalpa wood board, two feet and four inches in length and one foot and two inches in width, using cinnabar. Nail it to the residence, and the strange phenomena will dissolve, insects and ants will depart, and they shall never cause harm again. If worn on the person, it protects the body and safeguards life, repelling all dangers. Those who cultivate the Dao must wear it to avoid demonic obstructions.\n\nTo inscribe this talisman, form the mudra by pressing the left thumb against the upper joint of the index finger, recite the incantation, and write. The incantation reads:\nThe true forms of the Five Peaks,\nreceived from the Heavenly Yu’s scriptures.\nGreat Cavern’s Demon King,\nNine Shameful Primal Spirits.\nVanquishing demons, seizing ghosts,\nsubduing malevolent spirits.\nHeavenly Ding soldiers,\nspitting forth horse-clouds and augmenting—swiftly dispatch vengeful spirits.\nJia Yi, Wu Ji, Ren Gui, Geng Xin.\nBing Ding command the flames,\nSix Netherworlds of the Great Thousand.\nPrimal Dipper’s ninefold net,\nuniting the primal to return to the spirit.\nGathering the radiance of the Upper Luminaries,\nGreat Void and Great Clarity.\nThe Emperor’s sheltering canopy,\nthe land’s peace and tranquility.\nSupreme Tenuity’s Six Jia,\nmerging with Qian’s primal origin.\nEight-nine divine talismans,\ndescend to guard mountains and rivers.\nAs decreed, execute without delay.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation fourteen times to complete the inscription.\n\nAnother incantation reads:\nGreat talisman of the Five Peaks,\nseizing and annihilating evil destinies.\nShould any transgress against me,\nheavenly and earthly chariots shall crush them.\nWind and thunder, fire and lightning,\nfierce generals subdue and execute demons.\nBound to the Dipper’s stem,\nriding ghosts to serve Heaven’s command.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation eighteen times, spray water once upon the talisman, and release the mudra.\n\n**The Divine Talisman of the Celestial Dipper of Highest Clarity**\nThe **Divine Talisman of the Celestial Dipper of Highest Clarity** remedies human afflictions caused by spectral perversity, malignant poisonous *gu* qi, ghostly fetuses, and demonic qi transmitted to travelers, harming their lives. It also addresses all manner of malevolent forces, every perverse spirit that unlawfully occupies and refuses to leave human dwellings, as well as cattle plagues and pestilences affecting the six livestock. Submit a petition to this court for registration, then inscribe this talisman with cinnabar for installation and consecration—auspiciousness shall be immediately attained. When inscribed and worn, it prolongs life, repels evil, expels the Three Corpses, eliminates the Nine Worms, averts pestilential misfortune, severs ghostly bonds, and treats nighttime crying and fright in children. It also cures madness, miasmic mountain vapors, the five types of *zhan* illnesses, and all manner of ailments, repelling and subduing them all.\n\nTo inscribe this talisman, form the mudra by pressing the left thumb against the upper joint of the index finger, recite the incantation, and write. The incantation reads:\nGreat spirit of the Celestial Dipper,\nnine nines and seven perfected.\nPrimal life of the Great Unity,\nslaying ghostly miasmas.\nThe nine provinces’ domains,\nVenerable Star of Venus.\nTraversing the six directions,\nflaming fire bells.\nEight mights spitting poison,\nsubduing ghosts without punishment.\nThree hundred fifty thousand,\ndevouring ghosts and consuming essences.\nGreat brilliance of the netherworld,\nsubduing demons and vanquishing spirits.\nThe Great Thousand World,\nall qi as the Upper Army.\nWhat spirit does not protect?\nWhat ghost dares linger?\nThe Venerable of Mount Tai,\nresplendent in the void’s radiance.\nGhosts that slander the virtuous,\nall shall be met with blades.\nThe divine talisman eternally guards.\nTen thousand ghosts find no peace.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation eight times to complete the inscription.\n\nAnother incantation reads:\nThirty-six deviant heavens,\ngreat divine kings of the celestial realm.\nFlame Emperor scorches my blood,\nbestowing upon me the title of Supreme Yellow.\nSeven Lords of the Great Primal,\ndrive misfortune away for me.\nTrue qi receives thunder and fire,\nthe Old Duke subdues the fire’s glow.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation twenty-one times, spray water once upon the talisman, and release the mudra.\n\nHere ends the first scroll of *The Orthodox Methods of the Highest Clarity’s Celestial Pivot Court’s Returning Chariot Dao*.\nHere begins the second scroll of *The Orthodox Methods of the Highest Clarity’s Celestial Pivot Court’s Returning Chariot Dao*.\n\n**Method for Directing Qi**\n\nAt a place of utmost sincerity, face the sun and burn incense. Look up and pray:\n\n*\"[State your rank and name], reverently addressing the Great Sun Emperor: I, [your name], practice the Orthodox Methods of the Highest Clarity’s Celestial Pivot Court to relieve the suffering of all people and direct qi to pacify spirits. Today, I humbly beseech your compassion, that you bestow true qi into my body. May my Mud-Pill Palace, all joints, the five viscera, and six bowels be filled and brimming with its vastness. In treating all living beings, may there be no failure.\"*\n\nConclude with focused devotion. Strike the Heavenly Drum seven times, open your eyes toward the sun, and press the third joint of each middle finger with your thumbs. Draw in a breath of qi from the sun and swallow it. Recite the incantation seven times, then swallow a second breath. Press your right hand again, recite the incantation seven times, and take in a third breath. Cross both hands before your mouth, recite the incantation seven times, then draw in true qi and blow it onto the two mudras. Repeat this cycle three times in full.\n\nThe incantation reads:\n*\"Wind-pain departs with the wind,\nqi-pain vanishes with the qi.\"*\n\nFor those afflicted, have them sit in the southeast, facing northwest. The practitioner stands in the northwest, facing southeast, seated opposite. Instruct the patient to press firmly on the painful area without releasing. First, have them cough once, then draw in a breath of qi—do not swallow it yet. Assume the mudra as before, recite the incantation seven times, then have them cough again, swallow the qi, and recite the incantation once more. For mild cases, three to five repetitions suffice; for severe cases, five to seven. Efficacy is certain.\n\n---\n\n**Method for Enchanting Water**\n\nPurify the mind and focus the intent. Press the center of each palm with the middle fingers and invoke the twenty-eight constellations of the five directions:\n\n*\"Reverently summon the true form of the star essence of Horn and Neck in the East, wielding swords and talismans to guard my body.\nReverently summon the true form of the star essence of Well and Ghost in the South, wielding swords and talismans to guard my body.\nReverently summon the true form of the star essence of Straddler and Harvester in the West, wielding swords and talismans to guard my body.\nReverently summon the true form of the star essence of Dipper and Ox in the North, wielding swords and talismans to guard my body.\nReverently summon the true form of the Yellow Essence of the Seven Stars of the Center, wielding swords and talismans to guard my body.\nMay the true qi of the five directions enter this water.\"*\n\nThis is no ordinary water—it is the natural water of the Highest Clarity’s Boundless Dao, capable of dispelling illness and rescuing from suffering. Wherever a drop of this water falls, all becomes pure. If a true spirit touches it, their divine power expands. If a demonic entity touches it, their body burns as if consumed by fire. This water is formed from the true qi bestowed by the Perfected of the Upper Heavens. What evil would not submit? What ghost would dare appear? Those who oppose me shall die; those who turn away shall perish. Where this divine water arrives, the myriad ghosts hide in submission.\n\nThe incantation reads:\n*\"Kui-Yuan, Qian-Yuan, Li-Zhen, You-Zhen.\nSupreme Void, I invoke your decree,\nGate of Kunlun’s Heavenly Portal.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\"*\n\nRecite it twenty-one times. Sprinkle this water to cleanse all defilements; swallow talismans with it, and none will fail to respond. During epidemics, sprinkle it inside and outside dwellings. For the sick, boil it into decoctions or powders—its efficacy is undeniable, and there is no purpose for which it cannot be used.\n\n---\n\n**Method for Extracting Consumptive Worms**\n\nFor those suffering from corpse-transmitted illness within one hundred and twenty days, first earnestly invite a Zhengyi Daoist to perform a three-day jiao ritual. Prepare three talismans and administer them to the patient as follows.\n\nOn the fourth day, prepare a cauldron with at least five *jin* of heated oil and a bolt of white silk to bind the patient to a pillar. Use three left-spun silk threads, each four *chi* and four *cun* long. Affix one talisman to each thread on a peachwood stick, and have the patient swallow them with ginseng decoction. One thread is held steady as the talisman draws the thread into the abdomen. Use a ruler to pry open the patient’s mouth, swiftly pull out the talisman, and the worm will be upon it. Repeat this three times to extract three worms, which will shriek as they fall into the oil and fry. Only then is the patient safe. If only one or two worms are extracted, death is certain.\n\n**First Talisman**\nUse a half-*cun* square of silk, inscribed in cinnabar. Form the mudra with the left hand on the *wu* position, recite the incantation, and seal it in a wax pill. Administer at the *chou* hour of the first day with frankincense decoction. Recite the incantation three times to complete the inscription.\n\nThe incantation reads:\n*\"Divine spirits of the Three Lights of Heaven,\ngrant me the mandate of life.\nBy this decree, I sever you—\nthe calamity arrives, the method is executed.\"*\n\n**Second Talisman**\nUse a half-*cun* square of silk, inscribed in cinnabar. Form the mudra with the left hand on the *shen* position, recite the incantation, and seal it in a wax pill. Administer at the *wu* hour of the second day with frankincense decoction. Recite the incantation three times to complete the inscription.\n\nThe incantation reads:\n*\"Originally, you harmed me—\nnow I expel and unite with you.\nLike all flying heavens,\nyou wander as corpse-drinking ghosts.\"*\n\n**Third Talisman**\nUse a half-*cun* square of silk, inscribed in cinnabar. Form the mudra with the left hand on the *hai* position, recite the incantation, and seal it in a wax pill. Administer at the *hai* hour of the third day with frankincense decoction. Recite the incantation three times to complete the inscription.\n\nThe incantation reads:\n*\"Great Lord of the Supreme Dao,\nreceive my protection of this form.\nAuspicious blessings descend with the Heavenly Talisman,\nthe Great One unites with the Primordial Perfected.\"*\n\n---\n\n**Method for Treating Illness**\n\nThe illness may be treated after seven days of onset. When it flares, press the center of each palm with the middle fingers while observing the patient. Recite the incantation seven times, have the patient cough once, and draw in a breath of qi toward the wall, reciting the incantation three times over it. Instruct the patient to avoid the five pungent foods and toxic substances for seven days.\n\nThe incantation reads:\n*(Untranslated fragments follow as given in the original:)*\n*\"Talisman for Pacifying Silkworm Spirits (to be affixed inside the silkworm chamber)\nTalisman for Securing the Household\nTalisman for Dispersing Swelling and Toxins\"*\n\nFor swellings and toxins that have reached seventy or eighty percent severity, treatment is still possible. The method: place the finger-tally on the *wu* position of the left hand, press firmly on the painful area, and recite the incantation:\n\n*\"You are toxin—how dare you harm human flesh?\nI now dispatch you to the Blade Ridge.\"*\n\n*\"Swiftly, swiftly, as decreed by statute and command!\"*\n\nRecite the incantation seven times, then shift the finger-tally and have the patient cough once. Draw in a breath of *qi* and blow it onto the ground, then extinguish it with the foot.\n\n**Method for Treating Pestilence**\nThe treatment of pestilence follows established ritual protocols. Upon entering the door, first press the center of each palm with the middle fingers and recite:\n\n*\"Seal the Heavenly Eye—let no ghost or spirit see.\"*\n\nThis is the method for deploying *qi* for the patient. Before the patient’s dwelling, declare:\n\n*\"Plague Year King, Disease Enforcer:\nThis child has strayed from the Dao/Way.\nHeaven has sent you to patrol.\nNow this child repents and returns to the Great Dao/Way.\nI have memorialized the Celestial Emperor and filed a petition with the City God.\nIf this is not by Heaven’s talismanic summons, then swiftly withdraw your medicinal toxins and *qi* toxins.\nDo not linger, for Heaven’s pardon is imminent.\nDisobedience will not be tolerated.\nSwiftly comply!\"*\n\n**Method for Treating Ghostly Afflictions**\nFor the patient’s body, the exact year, month, day, and hour of birth must be obtained. Hold a sword in the right hand, first form the finger-tally, then press the tally on the year position and recite the incantation forty-nine times. Spray a mouthful of water onto the patient’s body.\n\nIf the condition lightens, cease treatment. If not, shift the tally to the position of the birth month and recite the incantation forty-nine times, spraying water onto the patient’s body. If the affliction has not fully receded, proceed to the birth day and birth hour, repeating the method in sequence until a response is achieved.\n\nThe incantation reads:\n*\"By Heaven’s amnesty, swiftly sever evil!\nSwiftly slay, swiftly bind!\"*\n\nIf the birth month, day, or hour is unknown, use the *zi* position for those born in the *zi* hour. This is the \"Four Heavenly Stabs\" method for binding evil. Additionally, administer the Northern Dipper’s Seven Origins Talisman and the Three Terraces Talisman with frankincense decoction.\n\n**Herbal Spirit Elixir Formula for Heart and Blood Afflictions**\nIngredients:\nSeven divine peaches, half a *liang* of frankincense, half a *liang* of cinnabar, half a *liang* of sour jujube kernels, half a *liang* of tangkuei, half a *liang* of rehmannia, half a *liang* of realgar.\n\nGrind the seven ingredients into powder, form into pills with wax the size of *wutong* seeds. Take twenty-one pills per dose, along with seven talismans. Select the appropriate talisman at the time and incorporate it into the pill. For children and men, administer with rush pith decoction; for women, with safflower decoction.\n\n**Secret Method for Managing Madness and Severing Ghostly Influences**\nThose born in the Lower Era who commit myriad transgressions—arrogance, indulgence in lust and killing, habitual slander, filial impiety, miserliness, and insatiable greed—generate deluded thoughts. Such thoughts disturb the spirit, giving rise to vexation, false imaginings, and bodily suffering. Thus, malevolent entities seize the opportunity to invade, exploiting the vulnerabilities. Essence-corrupting demons, lower ghosts, and a thousand specters assail the form and soul, causing erratic laughter, unsteady moods, disorientation, or singing and dancing, weeping and wailing. Excessive eating, loss of propriety, and disregard for social norms may ensue. These afflictions may also arise from restless graves, careless ancestral rites, inauspicious dwellings, or the calamity of felling sacred trees. One must not remain ignorant of these causes.\n\nBy examining the symptoms, the source may be discerned.\n\nHeart afflictions pertain to fire—manifesting as flushed complexion, loud laughter and shouts, frequent anger, and rare joy. Liver afflictions pertain to wood—manifesting as a greenish hue, excessive drinking, and unceasing sorrow. Lung afflictions pertain to metal—manifesting as a pale complexion, brandishing blades to commit violence, and constant talk of fighting and killing. Spleen afflictions pertain to earth—manifesting as a yellowish hue, excessive eating, and incessant boasting. Kidney afflictions pertain to water—manifesting as erratic sorrow, frequent tearing of clothes, hanging head and gnashing teeth, or a shamefaced demeanor. These are the signs of the five viscera assailed by malevolent forces. First, one must perform rituals and administer talismanic remedies. Then, according to the affected viscus, apply medicinal treatment—none shall fail to take effect.\n\n**Identifying Ghostly Malevolence:**\nGlaring eyes and gnashing teeth with ferocity—these are ghosts of self-inflicted harm.\nSinging, dancing, shouting, and laughing—these are mountain specter ghosts.\nCalling upon spirits and ghosts, biting objects—these are wandering deceased ghosts.\nMoods shifting between anger and joy—these are shrine and temple ghosts.\nGnashing teeth and wailing, voices as if enduring pain—these are drowned ghosts.\nFearful of living people—these are essence-devouring ghosts.\nAverse to daylight and ashamed of brightness—these are ghosts of blood-death or difficult childbirth.\nProne to roaming—these are tree spirits.\nSeeking death through self-harm—these are ghosts of grievance and debt.\nInclined to excessive sleep—these are ghosts of prison death.\n\nAs for those who recite or read scriptures yet treat them with disdain;\nSighing and groaning, troubled in heart and qi, speaking deceitfully;\nLosing resolve and singing or dancing, moods shifting between anger and joy—\nthese too are signs of ghostly malevolence.\n\nTo examine ghostly afflictions, follow this method—none shall prove false. To discern whether one is ill or not, observe the eyes: if they gaze upward, turning green or white, and appear unusually clear, there is no affliction; if they seem normal, it is all deception.\n\n**Treating Madness and Malevolence:**\nFirst, have the afflicted submit a written statement. Next, secure the local deities’ protection, file a petition with the city god of the jurisdiction, and dispatch divine officers and soldiers for defense. Then, enter the Dipper to embody the self, perform the ritual with full dignity, and proceed to examine the afflicted. Follow the prescribed methods strictly, without indulging personal inclinations. When addressing the afflicted, instruct them gently and soothingly, lest their spirit be harmed—this prevents violent outbursts and preserves their inherent nature.\n\n**Secret Ritual for Entering the Dipper and Embodying the Self:**\nWhen treating ghosts of madness and ferocity, one must purify the heart and bathe in ritual purity before proceeding. Upon arrival, remain focused, lest crude and ignorant ghosts, lacking understanding, dare to disobey, leading to a loss of dignity and profaning the mandate of the Supreme Emperor. Though it may take time, they will ultimately be captured—such is the nature of ritual practice.\n\nFor each ritual performance, face east and burn incense. Stand upright and centered, using the thumbs to form the Shangqing mudra, tracing from the back of the head to the brow; then separate the hands and lower them straight before the chest, clasping the waist. Silently recite the incantation:\n\n*\"Within my body, the Attendant Functionaries, I summon forth the twelve hours of my body, the twenty-four yang breaths, the seventy-two seasonal nodes, the three hun souls on the left, the seven po souls on the right, the twelve thousand spirits of radiant essence, the twenty-two thousand spirits of form and shadow, the thirty-three thousand spirits of the pores, the spirit of the heart, the spirit of the spleen, the spirit of the lungs, the spirit of the liver, the spirit of the kidneys—all arrayed in dignity. Grant me auspicious fortune, bestow upon me the Great Dao, and transform my body into that of the Great Exorcist of the Thirty-Six Caverns of the Mystic Capital of Shangqing, crowned with the Far-Wandering Cap, robed in crimson silk, holding the jade tablet, shod in vermilion. Seated upon the Jade Bureau, may you, divine spirits, guard my left and right. Above, let the red light shield me; below, let auspicious clouds encircle me. Proceed to the home of so-and-so in such-and-such place to investigate malevolent ghosts, cure illness, and eradicate evil, compelling all wicked demons to self-destruct and all ferocity to vanish, cutting away sickness. May the Southern Numinosity protect me, and my form be transformed into the Jade Void.\"*\n\n*\"Swiftly, swiftly, in accordance with the statutes and decrees of Shangqing!\"*\n\nAfter the incantation, face east and spray a mouthful of water over the body. Burn incense again, face south, and click the teeth. State your rank and name, then invoke:\n\n*\"Star Lord of the Southern Pole Heavenly Mansion,\nStar Lord of the Southern Pole Heavenly Appearance,\nStar Lord of the Southern Pole Heavenly Beam,\nStar Lord of the Southern Pole Heavenly Union,\nStar Lord of the Southern Pole Heavenly Pivot,\nStar Lord of the Southern Pole Heavenly Mechanism,\nStar Lord of the Southern Pole Myriad Longevities,\nLady of the Three Luminaries of the Southern Pole,\nFire-Bell General of the Southern Pole—*\n\n*Your servant, so-and-so, today observes auspicious fortune and maintains perpetual purification, cultivating boundless practice to deliver beings and save the world, dispelling evil and vanquishing malevolence to establish rectitude. Humbly beseech the Star Lords of the Southern Mansion to bestow divine radiance and guard my form. May three thousand attendants and the Fire-Bell General descend to protect my body, granting me longevity.\"*\n\n*\"Swiftly, swiftly, in accordance with the statutes and decrees of Shangqing!\"*\n\nAfter the incantation, click the teeth and proceed with the ritual steps, reciting the name of one Star Lord with each step of the Dipper:\n*\"Star Lord of the Heavenly Mansion,\nStar Lord of the Heavenly Appearance...\"*\n\nStar Lord of the Heavenly Mechanism,\nStar Lord of the Heavenly Union,\nStar Lord of the Heavenly Pivot,\nStar Lord of the Heavenly Beam.\n\nUpon completing the steps, grasp the sword and recite the incantation:\n*\"Day-Functionary Messenger of [this] day, I dispatch you to ascend to Heaven—swiftly reach the Heavenly Gate.\nI dispatch you to enter the Earth—swiftly reach the Earthly Portal.\nI dispatch you to enter the Waters—swiftly reach the Watery Mansion.\nNow, I do not dispatch you to ascend to Heaven, nor to enter the Earth, nor to enter the Waters.\nI dispatch you swiftly to [such-and-such] place, to the household of [so-and-so],\nto notify the Controller of Destiny, the Local Earth God, the relevant deities, the *qi* spirits,\nalong with the city god of this jurisdiction and the soldiers and generals sent forth,\nto command them to defend this site and come forth to examine the illness of [so-and-so].\nYou must be meticulous and strict, allowing no defilement to touch, lest dignity be lost.\"*\n\nNext recite:\n*\"Heavenly numen, Earthly numen—Heaven and Earth unite in convergence.\nFunctionary spirits and generals, you may not tarry.\nGo swiftly, return swiftly—I await you before the altar, sword planted in readiness.\nSwiftly, swiftly, in accordance with the statutes and decrees of Shangqing!\"*\n\nUpon finishing the incantation, plant the sword into the ground, interlock the fingers of both hands, and shout: *\"Go!\"*\n\nWhen entering the afflicted person’s home, upon crossing the threshold, remove your headscarf at once upon seeing anyone, proceed directly to the main hall, and sit upright. As you take your seat, press the middle fingers of both hands into your palms to form the mudra, exhale a breath of *qi* to the four directions, and recite:\n*\"I am the grandson of the Primordial August One, the child of the Most High.\nThe Northern Dipper is at my command; I tread the Yu Steps, sent forth by the Heavenly Officers.\nTo my left attends the Azure Dragon, to my right the White Tiger.\nThe Three Clarities’ Lords secretly deploy true *qi*.\nShould any demonic *qi* or perverse ghosts refuse to submit,\nthe Golden Net and Iron Web shall consign them to Fengdu for execution.\nSwiftly, swiftly, as decreed by the statutes!\"*\n\nRecite this seven times, then draw in a breath from all around and exhale it into your cupped hands. Press the mudra again until it pains, and recite:\n*\"Heaven is my father, Earth my mother,\nthe Sun and Moon my brothers, the Seven Stars my friends.\nThe Generals of the Six Jia wield axes,\nthe Earthly Jia Generals sternly bear gongs and drums.\nThe Three Terraces lead the way; the Avian Constellations follow as messengers.\nI am Heaven’s servant, sent forth by Heaven’s command.\nI sever evil, devour demons, bind malevolence, and capture ghosts.\nMy pointing and calling are as decrees; I regulate the *qi* of the firm.\nBy the talismanic command of Highest Heaven, all earth gods must hasten to comply.\nSwiftly, swiftly, carry this out!\"*\n\n*[East]*\n\nEast:\nThe Azure Emperor and Azure Youth Lord of the East, wielding gongs and striking drums, swiftly bind the demons that stir malevolence, casting them into the Golden Net Prison. Let them suffer punishment without mercy, and swiftly bring the case to judgment. As before, they receive the talismanic command of Heaven. Gaze toward the East and shout: *\"Begone!\"*\n\nSouth:\nThe Vermilion Emperor and Vermilion Youth Lord of the South, wielding thunder and lightning, swiftly bind the demons that stir malevolence, casting them into the Endless Prison. Let them suffer grievous punishment without mercy, and swiftly bring the case to judgment. As before, they receive the talismanic command of Heaven. Gaze toward the South and shout: *\"Begone!\"*\n\nWest:\nThe White Emperor and White Youth Lord of the West, wielding battle-axes, swiftly bind the demons that stir malevolence, casting them into the Drowning Sea Prison. Let them suffer punishment without mercy, and swiftly bring the case to judgment. As before, they receive the talismanic command of Heaven. Gaze toward the West and shout: *\"Begone!\"*\n\nNorth:\nThe Black Emperor and Black Youth Lord of the North, wielding the Emperor’s Gong, swiftly bind the demons that stir malevolence, casting them into the Inescapable Prison. Let them suffer punishment without mercy, and swiftly bring the case to judgment. As before, they receive the talismanic command of Heaven. Gaze toward the North and shout: *\"Begone!\"*\n\nCenter:\nThe Yellow Emperor and Yellow Youth Lord of the Center, wielding a golden mallet, swiftly bind the demons that stir malevolence, casting them into the Everlasting Prison. Let them suffer punishment without mercy, and swiftly bring the case to judgment. As before, they receive the talismanic command of Heaven. Gaze toward the heavens and shout: *\"Begone!\"*\n\nWhen the afflicted person cries out in distress, command: *\"Left and Right Marshal Generals, divine warriors aiding the Dao, seize and bring them forth!\"* Then instruct the household to lead the afflicted to the hall below, where they will prostrate themselves.\n\nRecite the incantation as the afflicted emerges, using the Jade Purity Mudra:\n*\"Heavenly spirit, earthly spirit,\nHeaven and Earth conjoin in power.\nOfficers dispatched by decree,\nShow no leniency, spare no mercy.\nSeize the demonic thieves,\nSwiftly bring them before the steps.\nHasten! As the statutes command.\"*\n\nRecite the incantation seven times. When the afflicted reaches the steps, command: *\"Gaolers of the Day’s Prison, seize the demonic thieves for me!\"*\n\nRecite the incantation:\n*\"By decree of the Supreme Heaven,\nSwiftly bind the demonic essence.\nGaolers on duty, show no leniency,\nHasten to obey Heaven’s command,\nExamine and subdue their defiance.\nBeneath my steps—\nPrimordial, flourishing, harmonious, steadfast.\nHasten! As the statutes command.\"*\n\nRecite the incantation three times. The afflicted will then sit of their own accord. Once seated, question them and bid them confess the cause. If they refuse to comply, shout: *\"Place them in the cangue!\"* Then recite the incantation seven times.\n\nUse the Supreme Purity Mudra.\nRecite the incantation:\n*\"By Heaven’s mandate,\nThe Radiant Emperor of Jade holds sway.\nDemons in the cangue,\nDefiant against the Supreme Purity,\nBound by the Mystic Registers of the Nine Heavens,\nShow no leniency, spare no mercy.\nHasten! As the statutes command.\"*\n\nThe afflicted will then behave as though bound by the cangue. If they still refuse to confess, form the Jade Emperor Mudra with both hands and shout: *\"Bind them for me!\"* Then use the Purple Tenuity Seal and recite the incantation seven times.\n\nRecite the incantation:\n*\"Heavenly spirit, heavenly glory,\nI act by decree of the Supreme Purity.\nBind the demonic thieves,\nResistance brings punishment.\nThe Dipper’s might and the Demon-Quelling Star,\nShow no leniency, spare no mercy.\nHasten! As the statutes command.\"*\n\nThe afflicted will stand as though tightly bound. Question them again and bid them confess. If they still refuse, command: *\"Beat their feet—both at once!\"*\n\nRecite the incantation:\n*\"Interrogation Mudra of Demons.\nBy decree of the Supreme Heaven,\nThe cangue restrains demonic essence.\nGaolers executing punishment,\nShow no leniency, spare no mercy.\nBy Heaven’s talismanic command,\nAct in accordance with the decree.\nHasten! As the statutes command.\"*\n\nIf the afflicted cries out but still refuses to confess when questioned, recite the Yellow Wasp Incantation three times: *Interrogation Mudra of Demons.*\n\n*\"Great Demon, Great Spirit,\nRadiance of the Seven Stars of the Dipper.\nTrue Primal Qi of the Nine Heavens,\nEternally bound by the Supreme Decree.\nBy command as command,\nAct with utmost urgency.\nHasten! As the statutes command.\"*\n\nIf the afflicted still refuses to confess, command: *\"Bind them to the bronze pillar and pour molten bronze and iron pellets upon them!\"*\n\nRecite the incantation seven times: *Interrogation Mudra of Demons.*\n*\"Great Tenuity, Great Tenuity,\nMolten bronze searing red.\nEternally condemned by the Nine Heavens,\nEnduring punishment without reprieve.\nDie again and again,\nBy decree of the Supreme Emperor.\nSummon the gaolers,\nTo feast on ghosts and drink their blood.\nHasten! As the statutes command.\"*\n\nWhen the afflicted cries out in suffering, question them again for their confession.\n\n**Method for Beheading the Ghost**\nUse the *Mudra for Annihilating Demonic Ghosts*, forming it with both hands. To execute the ghost, declare in accordance with the statutory verification: *\"You have incurred this guilt, and your guilt warrants beheading.\"*\n\nThen command: *\"Executioner of this court, behead the ghost for me!\"*\n\nRecite the incantation:\n*\"By stern decree of the Heavenly Emperor,\nThe executioner receives his charge.\nBearing the Heavenly Talisman’s command,\nShow no leniency, spare no mercy.\nThe divine blade’s twin edges,\nSever evil and cast it away.\nEscort them beneath the altar’s steps,\nAnd with a single stroke, execute them.\nHasten! As the statutes command.\"*\n\nAfter reciting the incantation seven times, command: *\"Drag them forth for dismemberment!\"*\n\nRecite the *Ghost Incantation* seven times:\n*\"By decree of the Heavenly Emperor,\nThe Heavenly Armored Ones, the Heavenly Soldiers.\nThe ghost has committed grievous crimes,\nGround to dust, its form shattered.\nBy the Heavenly Decree’s command,\nEnforce the law as ordered.\nHasten! As the statutes command.\"*\n\n**Incantation for Severing the Ghost** – Use the *Interrogation Mudra of Demons.*\n*\"By decree of the Heavenly Emperor,\nThe law is established without mercy.\nUnder the Three Heavenly Talismans,\nThe guilty shall receive their punishment.\nBy the Heavenly Decree’s command,\nEnforce the law as ordered.\nHasten! As the statutes command.\"*\n\n**Incantation for Exiling the Ghost** – Use the *Mudra for Exiling Ghosts.*\n*\"The ghost has committed vile crimes,\nIts heart devoid of mercy.\nBy the statutes’ command,\nExile it to the Sea Garrison.\nBy decree of the Supreme Heaven,\nEnforce the law as ordered.\nShould it resist,\nGrind its bones to dust, shatter its form.\nHasten! As the statutes command.\"*\n\nFrom the *Incantation for Capturing the Seated Ghost-Thief* to this point, after each recitation, spray a mouthful of water and declare: *\"Extinguished!\"*\n\n**Method for Distant Treatment of Madness and Malevolence**\nFor any maiden or woman one does not wish to see, after consecrating the water, have them take a bowl to wash their hands and face, then let the afflicted wash theirs. While washing the hands, form the *Jade Emperor Mudra* with both hands, recite the incantation seven times, and blow seven times into the water.\n\n**Incantation:**\n*\"Divine hands of the Heavenly Dragon,\nA thousand demons flee of their own accord.\nEstablished in the Great Luo,\nChanting the cavern’s hymns in song.\"*\n*Swiftly, swiftly, as the Upper Clarity statutes command.*\n\nUpon completion, flick the mudra into the water.\n\n**Mudra Guide:**\n*Upper Clarity Mudra* – two fingers raised; *Interrogation Mudra of Ghosts* – two fingers centered.\n*Jade Clarity Mudra* – middle finger raised; *Jade Emperor Mudra* – middle finger centered.\n*Thrusting Sword Mudra* – middle finger lowered; *Upper Clarity Mudra* – four fingers centered.\n*Purple Tenuity Mudra* – four fingers centered; *Exiling Ghost Mudra* – little finger centered.\n*Extinguishing Ghost Mudra* – little finger lowered.\n\nBefore proceeding to treat malevolence, first burn the *Pass Permit* and post the *Notice Placard* before the local Earth God, the Controller of Fate, and the Five Roads’ relevant deities. Simultaneously, file a petition to the City God to borrow troops for apprehension and custody. Once used, file another petition to return them. After securing the entity, report the outcome clearly.\n\n**Incantation for Dispersing Qi:**\n*\"Primordial Heaven’s numen,\nJia Yi Bing Ding.\nWu Ji and the Great Unity,\nRen Gui guard the form.\nVermilion Bird’s shelter,\nLongevity and immortal life.\nBody’s Attendants,\nGenerals of Three and Five.\nDivine persons left and right,\nAuspicious fortune this day.\nAttaining the Dao’s subtlety,\nGrant me communion with the spirits.\nSweep away foul qi,\nBanish malevolence and unrest.\nSpirit clear, qi refreshed,\nAttain the Dao and cultivate integrity.\"*\n*Swiftly, swiftly, as the Upper Clarity statutes command.*\n\nHere ends the *Middle Scroll of the Upper Clarity Heavenly Pivot Institute’s Returning Chariot and Completing the Dao Orthodox Methods*.\nHere begins the *Lower Scroll of the Upper Clarity Heavenly Pivot Institute’s Returning Chariot and Completing the Dao Orthodox Methods*.\n\n**Verification Form for Stove Inspection**\nIf someone submits a petition, first burn incense, form the mudra by raising both index fingers to the *Hai* position, clasp the waist, knock the teeth three times, blow a breath toward the ground, knock the teeth three times again, draw a breath from the center and swallow it, then recite:\n\n**Incantation:**\n*\"Heaven’s numen, Earth’s numen,\nHeaven and Earth dispatch their troops.\nI act by the Jade Emperor’s decree,\nTo investigate and restrain malevolent spirits.\nWang Min submits a petition,\nWith earnest matters to bring.\nAttendants of this institute,\nDare not delay.\nSwiftly summon the Controller of Fate,\nTo summon the names of calamity’s ghosts.\nGo swiftly, return swiftly,\nI stand before the altar, sword drawn, awaiting.\"*\n*Swiftly, swiftly, as the statutes command.*\n\nShout: *\"Go!\"*\n\nAfter reciting the incantation, examine the petition to identify the character upon which the issue hinges, thereby discerning whether malevolent spirits or misfortune are at fault. Assess the circumstances and proceed in accordance with the celestial statutes and decrees. For minor matters, dispatch them to the appropriate authority or entrust them to the household’s attending deities. Whenever summoning ghostly soldiers or divine generals, specify which temple’s forces are being deployed. Affix the seal of the Lord of Universal Dharma upon the signature space, and provide offerings of incense, wine, tea, and fruit. Once the affliction is resolved, burn incense and paper offerings at the temple of origin. The petition requires six sheets of spirit money, twelve paper horses, and incense with candles.\n\nIf the divine generals of this institute observe inauspicious signs, do not grant the petition—even if the supplicant appears at ease, their longevity will not endure. Exercise utmost care; never lightly diminish another’s merit and practice. This originates from the First Dragon Han Era, when the Supreme Dao Lord of the Upper Clarity Realm summoned the celestial officials to pursue and interrogate the Stove Lord and Controller of Fate regarding the causes of human calamities and malevolent spirits, delegating their adjudication and remedy to the Celestial Pivot Institute.\n\n**Petition Format:**\n[Petitioner’s] residence: [State], [County], [Township], [Village], [Neighborhood], [Lane].\nDisciple [Family Name, Given Name] respectfully submits:\n\nRegarding [Name of Afflicted], currently aged [Number] years, born on the [Day] of the [Month] at the [Hour].\nSince [Year, Month], [Name] has suffered from [Illness], enduring repeated medical treatments without recovery. Fearing that misfortune or malevolent spirits have intruded, causing obstructions that render remedies ineffective, I now have no recourse but to humbly submit this petition to the Upper Clarity Celestial Pivot Institute, beseeching your command to administer lawful relief.\n\nRespectfully submitted.\n[Year] [Month] [Day]\n[Petitioner’s Family Name, Given Name] petitions.\n\n**Verification Petition Method**\n\nThe character *zhou* (州) shares the same form as *jun* (军). If *zhou* is absent, the two characters *Tianshu Yuan* (天枢院) may be used interchangeably.\n\n**Stains (点污):**\nThree generations of ancestral spirits, unfulfilled vows to household deities, disturbances along the five pathways before the gate.\nThe spirit of an ancient tomb in the southeast, household possession of round and luminous objects.\nWithin twenty-one days, the return of blood-tainted items, or the affliction of singing ghosts.\n\n**Grievous Offenses (犯重):**\nBeneath the threshold of the central chamber lies the buried remains of a woman, seven feet deep.\nWithin seven years, the violent death of a close blood relative, unsettled earth of the dwelling, or the haunting of this chamber by flying corpses or female calamity ghosts.\n\n**Provocation (挑起):**\nThe five-tongued ghosts of southern trees, drawn by offerings of food, along with the flying earth spirits of the west.\n\n**Neglect (注失):**\nFive-tongued spirits of incense and mountain specters, three generations of ancestral spirits, wandering dead, self-inflicted female ghosts, those perished in riverways, and the deities of city gods and earth altars.\n\n**County (县):**\n**Stains:**\nDisturbances among household deities, unfulfilled vows to the city god, stars and constellations aligned over this direction.\nUnsettled mountain spirits and yin earth, disturbed by outsiders.\n\n**Grievous Offenses:**\nWandering earth spirits of the south, offenses against the Grand Year within a decade.\nUnfulfilled vows to ancestral spirits, and the affliction of crimson-purple deities, illness arising from external consumption.\n\n**Provocation:**\nDeaths before the gate, male violent deaths, unresolved yin-yang conflicts, unsettled stove deities.\nDisturbances in monastic vows, or wandering ghosts of miscarried fetuses.\n\n**Neglect:**\nCrimson-purple deities, consumptive ghosts of transmitted corpses, parental curses, ghosts of northern kin.\nUnsettled door and household deities, unfulfilled vows to the stove god.\n\n**Township (乡):**\n**Stains:**\nUnfulfilled vows to the five temples, kin from the northeast.\nGhosts of poisoned medicine, blood curses, blood corpses, and flying consumptive ghosts.\n\n**Grievous Offenses:**\nWithin ten paces east of the gate, buried remains of stone spirits, and ancestral spirits transmitting hereditary afflictions.\n\n**Provocation:**\nCurses from close kin in southern temples, fate entangled with baleful stars, offenses against the dwelling’s earth.\n\n**Neglect:**\nGhosts of ancient tombs and buried remains, old painted merit offerings, anomalous objects as spirits, household possession of clothing or items from those who died of consumptive illnesses.\n\n**Neighborhood (保):**\n**Stains:**\nSpirits of old temples, disturbed merit vows, female blood corpses, consumption of eastern food within fourteen days, bearing ghost-inflicted wounds into the dwelling.\n\n**Grievous Offenses:**\nBeneath the third mouth of the stove, the withered bones of a man, and self-inflicted female ghosts.\nNorthern riverway deaths, spirits of ancient tombs.\n\n**Neglect:**\nWestern spirits of old temples, offenses against the dwelling’s earth, wells, and stoves, disturbances by self-inflicted ghosts before the gate, female violent deaths.\n\n**Village (里):**\n**Stains:**\nGhosts of male riverway deaths in the north, five-tongued spirits of northern trees, spirits of northern bronze statues, unfulfilled vows to the stove god.\n\n**Grievous Offenses:**\nWandering spirits and five-tongued deities, floating earth of the west, spirits of funeral carts, ghostly household items, bronze and iron objects—fate doomed to death.\n**Beyond remedy.**\n\n**Provocation:**\nMountain specters and wood-dwelling ghosts, unfulfilled vows to the dwelling, unsettled earth deities, ghosts of female violent deaths.\nSouthern ghosts of convulsive illnesses, entry into monastic temples, curses from stars aligned over fate, disturbances along the five pathways, parental ghosts.\n\n**Petition Submission:**\nIf the surname or given name is forgotten and left unrecorded, the affliction stems from western ancient tombs, five-tongued wandering ghosts, or offenses by earth-bound poison ghosts.\n\n**Stains:**\nParental ghosts, household conduct in darkness, neglect of parents—heaven-sent calamities.\n\n**Grievous Offenses:**\nUnfulfilled vows to ancestral spirits, baleful stars as afflictions.\nGhosts of paternal uncles and grandfathers, buried remains beneath the hall, ancient objects and stone spirits.\n\n**Provocation:**\nAncestral curses upon temple deities, transgressions of flattery, deceit, slander, or false accusations.\n**Fate doomed to death, beyond remedy.**\n\n**Neglect.**\n\n**Earth Afflictions:**\nEarth-yellow, earth-arrows, earth-pestilence, mountain imps, earth-altar elders, river-way female ghosts, northeast direction’s gu-qi ghosts. **Name:** Women with the same clan name. **Stains:** Parental and sibling ghosts, corpse-transmitted ghosts, mountain imps as calamities, guest-hall concealed corpses. **Household failing to accumulate goodness, offenses against parents, curses from closest kin, northern tree spirits, ancient bronze and iron essences—fated to die, beyond remedy.** **Grievous Offenses:** Maternal ancestral ghosts, curses from temple-visiting kin and friends, dead qi entering the dwelling, northern debt-collecting ghosts, wandering ghosts, household-stored weapons, mountain imps, tile-and-brick hauntings, drum-like sounds, fish-and-turtle spirits, southern self-injury ghosts, well-and-spring female ghosts.\n\n**Afflicted Person’s Name:** Women with the same clan name. **Stains:** Southern direction, afflictions through food and drink, northwest’s old temples, behind the spirit hall, western concealed corpses, female [missing character] ghosts. **Grievous Offenses:** Ancestral unfulfilled vows, ghosts of deceased friends and wandering dead, stars directly aligned, past-life creditors claiming lives. **Death beyond remedy, three deaths inevitable.** **Neglect:** Stars aligned with unfulfilled vows, fate doomed to short life. **Northern funeral-cart ghosts, five pathways summoning southwestern gu ghosts—death beyond remedy.**\n\n**Afflicted Year, Month, Day, and Hour:** **Stains:** Stars and constellations aligned over fate, dwelling with concealed corpses, mountain spirits and ancient anomalies, hill-and-grave ghosts, well-and-spring ghosts. **Grievous Offenses:** Mountain spirits as hauntings, pit-and-filth deities, kitchen ghosts of unnatural deaths, poison-induced fatalities, stove-earth disturbances. **Provocation:** Five-tongued concealed-corpse ghosts, southwestern corpse-transmitted afflictions, curses from kin, monks, and nuns, household-stored bronze and iron objects turning into spirits. **Neglect:** Eastern chamber concealing ancient weapons, water spirits, bamboo and wood omens of green and yellow laughter, and self-punishing female ghosts.\n\n**Divine Character:**\nIf the divine character is at the top, it is the first character in the first line. **Wandering female [missing character] ghosts of self-injury, mountain imps, ancient temple spirits, five pathways with unfulfilled vows, earth-mansion disturbances.**\n\nIf at the bottom, it is the first character in the last line. **Unnaturally deceased female ghosts, temple-cursing ghosts, western ancestral-tomb spirits, objects of lethal harm within two years.** **Stains:** Five-tongued ancestral ghosts of service, others’ paternal and maternal ancestral ghosts seizing household land as calamities. **Grievous Offenses:** Nightmare ghosts, eastern afflictions through food and drink, household-stored ancient objects turning into demons, childbirth-death ghosts. **Provocation:** Corpse-transmitted ghosts, clothing and flying insects entering the dwelling, southern flower-and-fruit spirits. **Death beyond remedy.** **Neglect.**\n\nWaters and lands stir with divine vows—ghosts of parents’ curses, mountain spirits, and the essences of blue and yellow. Spirits of ancient graves on hills and mounds. **The character \"ghost\" appears above:** southeastern temple deities, those in the central hall, with male corpse-spirits lying beneath. Within twenty-one days, strange apparitions will bring disaster.\n\n**Below:** temple deities within a hundred *li*, curses bound by vows, northwestern riverine ghosts of drowned ancestral kin. **Stains:** stars bearing vows, ghosts of brothers, southern corpse-spirits and tree deities, those who died as strangers or by self-inflicted harm, and the hauntings of wrongful death. **Grievous Offenses:** deities of the Five Paths worshipped with incense, southwestern transgressions against earthly authorities, the Year-Star bringing calamity, startling the Controller of Fate. **Provocation:** nightmare ghosts of the strangled, those slain in war, deaths in prison, households storing ancient objects, subordinates rebelling against superiors. **Neglect:** western kin sending gifts, women bearing misfortune, poison-curse ghosts, water demons, riverine dragons and miasmic serpents.\n\n**The character \"misfortune\" appears above:** southern female ghosts of self-injury, spirits of flowers and trees, wells and hearths obscured, ancestral vows lingering. **Below:** ghosts of brothers and grandparents, self-inflicted curses, faults of intent, celestial deities seizing control. **Death beyond remedy.** **Stains:** northern and southern curses, vows to deities, kin stirring trouble, heterodox paths bringing disaster, and unnaturally deceased female ghosts. **Grievous Offenses:** ancestral kin as corpse-transmitted ghosts, creditors from past lives claiming lives owed, possessive ghosts, spirits of the Five Paths leading the departed to harm deities. **Provocation:** bringing blood offerings to lure eastern singing ghosts into the dwelling as calamity, unsettling the Controller of Fate and household ancestors. **Neglect:** offending mountain deities and yin earth, malevolent stars descending upon fate, vows to ancient temples of the Five Paths.\n\n**The character \"haunting\" appears above:** others’ incense mingling in the chamber, female ghosts of self-injury within, deities of wells and springs. **Below:** outsiders tending incense, ancient graves with corpse-spirits, consumptive ghosts, the departed bearing vows, the dwelling’s earth unsettled. **Stains:** uncles, maternal ancestors, mountain ghosts, tree spirits, the Five Paths before the gate. **Grievous Offenses:** female ghosts of stranger-death, obscure spirits four feet west of the fence, ghosts of blades and swords. **Death beyond remedy.** **Provocation:**\n\nThe deities of floral and fruited play from the West unsettle the dwelling’s earth, with many spirits bearing vows and strange apparitions seen within a hundred days. **Neglect:** this constitutes an offense against the dwelling’s earth, with ghosts of violent death, the Pure Deities bearing vows, and provocation of the Great Spirits.\n\n**The character \"perversity\" appears above:** the deities of ancient tombs from the Five Directions, ancestral dead bringing misfortune, the Mountain Deities bearing vows, the Controller of Fate unsettled. **Below:** vows unfulfilled, the Three Realms’ spirits in contention, the heart and mouth unreliable—this is Heaven’s affliction. **Death beyond remedy.** **Stains:** Heavenly deities bearing vows, northern curses, mountain demons and parents bringing calamity. **Grievous Offenses:** ghosts of those slain in war, southern roadside deaths, violent and ill-fated female ghosts, and eastern wandering Five Paths ghosts of play. **Provocation:** the Gate Deities, the Five Paths, the arrayed spirits of trees, the City God bearing vows bringing misfortune. **Neglect:** ghosts of prison death, female corpses drained of blood, fierce mountain spirits, the Five Spirits unsettled.\n\n**The character \"sorcery\" appears above:** consumptive disease, ancestral ghosts, the dwelling beset by evil omens, stars bearing vows, female ghosts of corpse-spirits beneath the groves. **Below:** riverine deaths, rampant ghosts, northern female corpses of poison and curses, spirits of medicinal substances. **Stains:** corpse-spirits before the hall, parents’ graves and dwelling inauspicious, ancient objects and calligraphy as omens. **Death beyond remedy.** **Grievous Offenses:** illness contracted from purchasing a sufferer’s garments, female ghosts of sudden ruin and violent death. **Southwestern spirits of poison and curses.** **Provocation.**\n\n**Stone spirits**, specters of bronze, iron, and beastly forms, tomb deities, mountain gods, river gods, wandering rampant ghosts, hauntings of ancient barrows. **Neglect:** mountain gods bearing vows, brothers’ curses, demonic path spirits and ghostly officials, the Five Rampant gods of mountains and stones.\n\n**The character \"specter\" appears above:** female ghosts of three generations’ wandering dead, earth deities unsettled, riverine rampant ghosts of premature death, blood-curse spirits. **Below:** mountain imps, fire-calamity death ghosts, blood-death and violent-death corpse-spirits, crimson and violet deities, afflictions from food and drink in the northeast. **Stains:** ghosts of gloom, western water spirits, northern spirits of locust and soapberry trees. **Death beyond remedy.** **Grievous Offenses:** ghosts of those slain in battle, the Five Paths’ mutual entanglements, dwelling earth bearing vows, northern curses, flying corpse-ghosts. **Provocation:** female ghosts of self-harm in kitchens and latrines, eastern and western spirits of ancient temples, ghosts of murky ditches and wells. **Neglect:** killing living beings within two years, seven generations’ karmic debts, baleful stars darkly converging upon one’s fate.\n\n**The characters \"wraith\" and \"consumption\" are equivalent.** **Above:** sins of unfiliality toward parents in past lives, ghosts of southeastern poisonous mountain spirits, deaths from wandering or violence. **Below:** the five directions’ qi of curses and poisons, wandering tree spirits, mountain imps, stone spirits, water sprites, ghosts of violent death in riverways. **Stains:** offending the Grand Year for a decade, yin dwellings unsettled, ghosts of parents and ancestors, gate deities disturbed. **Grievous Offenses:** blood-corpses and the Five Penetrations’ mountain imps wreaking havoc, fox spirits, murky wells and hearths. **Provocation:** nightmare death ghosts, consumptive disease ghosts, southern food and drink, northern ancestral grandmothers’ spirits of ancient tombs. **Neglect:** hauntings by parents and ancestors, mountain imps and spirits of ancient barrows, newly deceased ghosts, northern earth spirits of ancient tombs.\n\n**The character \"demon\" appears above:** mountain imps, monkey spirits, those sharing fate with the Controller of Destiny, rampant harm, wandering death, self-hanged ghosts, consumptive disease. **Below:** deities served beneath old dwellings, eastern and western playful ghosts of flowers and fruit, spirits of nails and iron. **Stains:** within one year, purchasing Daoist or monastic garments, vows upon purity deities, stars illuminating one’s fate, spirits of sweeping the residence. **Grievous Offenses:** violent-death ghosts and corpse-spirits, ancestral ghosts transmitting disease, the Five Paths’ mountain gods wreaking havoc. **Provocation:** maternal grandparents entering the dwelling, sharing fate with ancestral grandparents’ Controller of Destiny, suffering calamity and affliction.\n\n*Here ends the Lower Scroll of the Orthodox Rites of the Heavenly Pivot Institute’s Turning the Wheel.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清天枢院回车毕道正法 经名：上清天枢院回车毕道正法。 撰人不详。 三卷。 底本出处：《正统道藏》洞玄部方法类。 上清天枢院回车毕道正法卷上 上清九老仙都之印 夫上清九老仙都印者，佩之入山，狼虎精怪自伏； 遇过江河，风雨顺济。 可管天下洞府仙官。 若佩其印，兵不能害，虎不能伤，水不能溺，临大危难，必有善生。 常人佩之，寿命延长，伏诸邪鬼，百恶不侵。 及治小儿夜啼、惊 风，及大人诸般疾患，并烧灰，用乳香汤调下，立效。 催生下死胎，此印佩之安胎。 妇人无子，佩之有孕。 及解咒咀冤枉，令人聪明，用之皆应。 印阔二寸二分，方正，厚八分，印文分八字，作二行迭篆。 治都总摄之印 夫治都总摄之印者，为之兵印。 有此印者，能管天下三界鬼神、仙官、分野、城隍、社庙、吏兵，皆得差使，不论高下。 此印佩之如上天帝命，凶恶鬼神皆伏。 若行法，职官不得此印者，难用鬼兵。 印行兵将行，印住兵将住，动印如动兵。 若用此印，兵将不行，不论高下，并皆处斩，自有鬼神直之云。 斩了，便可具状奏闻上帝。 故兵随印转，将逐令行，违命之罪皆，须重焉。 印阔二寸二分，方正，厚八分，印文分六字，作二行迭篆。 都天大雷火印 夫都天大雷火印者，治天下山川、林木、庙宇、神坛、龙蜃，并皆起之，印动雷动。 此印不可与他印相杂使用，只是求甘雨，於有龙处用铁版一面，用纸封上押字，用此印印之，令人送於水中，龙神立起。 如水有怪，林木为妖，古庙兴灾，皆行文於内押字，用此印印之，其水内有怪自死，庙宇自坏，林木自枯，或被天火雷电所烧。 印阔二寸二分，方正，厚八分，印文分六字，作二行迭天文篆。 提举城隍司印 夫提举城隍司印者，受提举城隍之职，代天行化。 凡受此职者，须得此印，无此印不行天下。 城隍神所行去处，阴官自报，皆有鬼神迎接佐送。 亦差助法兵吏所直，经过山林庙宇，或渡江河海。 次日夜常有本属兵吏侍右。 凡牒城隍，只用此印，即时报应。 或城隍兵不至，为之不从，便可具状闻奏上帝，依法移居并位。 印阔二寸二分，方正，厚八分，印文分六字，作二行迭天文篆。 上清天枢院印 夫上清天枢院印者，为上清三天门下进奏之司。 凡於人世为民行法，申奏天曹，关牒中界、下界鬼神之事，皆须此印。 除天界上帝，可具状奏闻。 中界五岳名山大川，下至酆都之神，不论高下，并用关牒。 及佩之除邪，服之治病。 有此印随行，天下鬼神皆伏，所行之处，鬼神侍右。 印阔一寸八分，长一寸九分，印文分六字，作二行迭篆。 都天大法主印 夫都天大法主印者，管天下邪精、六洞魔王。 凡有精邪作孽，龙蜃兴祆，与民为患，所行符箓，皆须此印。 及人有冤枉咒咀，宿世冤灵负命欠财，一切疾苦，佩此印，冤灵不能近，恶业不能侵。 及除夜梦，和合万事。 常服除宿疾，令人延寿，不患蛊毒，不生九虫。",
      "translated_text": "**The Orthodox Methods of the Upper Clarity Heavenly Pivot Institute’s Returning Chariot and Concluding Dao**\n\n**Title:** *The Orthodox Methods of the Upper Clarity Heavenly Pivot Institute’s Returning Chariot and Concluding Dao*\n**Author:** Unknown\n**Volume:** Three\n**Source Text:** *Daoist Canon of the Orthodox Unity* (Dongxuan Section, Methods Category)\n\n---\n\n### *The Orthodox Methods of the Upper Clarity Heavenly Pivot Institute’s Returning Chariot and Concluding Dao, Volume One*\n\n#### **Seal of the Nine Elders of the Upper Clarity Immortal Capital**\nThe Seal of the Nine Elders of the Upper Clarity Immortal Capital, when worn into the mountains, subdues wolves, tigers, and spectral beings; when crossing rivers, winds and rains align to aid passage. It commands all grotto-heavens and immortal officials. If one bears this seal, weapons cannot harm, tigers cannot wound, waters cannot drown; in times of great peril, deliverance is assured. For ordinary folk, it prolongs life, suppresses malevolent spirits, and repels all evil. To treat night terrors in children, fright-wind, and all manner of ailments in adults, burn the seal to ash and administer it with frankincense decoction—efficacy is immediate. It hastens childbirth and expels stillborn fetuses; when worn, it stabilizes pregnancy. For women without children, it brings conception. It resolves curses, redresses grievances, sharpens the mind, and fulfills all uses.\n\nThe seal measures two *cun* and two *fen* in width, perfectly square, eight *fen* thick. Its inscription consists of eight characters in two lines of stacked seal script.\n\n---\n\n#### **Seal of Governance and Universal Command**\nThe Seal of Governance and Universal Command serves as a military seal. Its bearer commands all spirits, immortals, officials, territorial deities, city gods, earth temples, and spectral soldiers across the Three Realms, regardless of rank. Worn, it carries the authority of the Celestial Emperor; all ferocious spirits submit. Without this seal, those practicing methods cannot deploy spectral troops. When the seal moves, the troops advance; when it halts, they stop. To move the seal is to move the army. If troops disobey, all—regardless of rank—are executed, as spectral enforcers ensure justice. After execution, a memorial may be submitted to the Celestial Emperor.\n\nThus, troops follow the seal’s turn, generals obey its commands; violations of orders incur severe penalties.\n\nThe seal measures two *cun* and two *fen* in width, perfectly square, eight *fen* thick. Its inscription consists of six characters in two lines of stacked seal script.\n\n---\n\n#### **Seal of the Great Heavenly Thunderfire**\nThe Seal of the Great Heavenly Thunderfire governs all mountains, rivers, forests, temples, altars, dragons, and *shen* across the world; when the seal stirs, thunder responds. This seal must not be used alongside others. To summon sweet rains, inscribe an iron plaque at a dragon’s abode, seal it with paper, and impress it with this seal. Have someone cast it into water, and the dragon spirit will rise at once. If waters harbor monsters, forests spawn demons, or ancient temples invite disaster, draft a document, affix the seal, and impress it—waterborne creatures will perish, temples collapse, forests wither, or be consumed by celestial fire and lightning.\n\nThe seal measures two *cun* and two *fen* in width, perfectly square, eight *fen* thick. Its inscription consists of six characters in two lines of stacked celestial seal script.\n\n---\n\n#### **Seal of the Intendant of City Gods**\nThe Seal of the Intendant of City Gods confers the office of Intendant of City Gods, acting on Heaven’s behalf. Those appointed must possess this seal; without it, they cannot traverse the world. Wherever the city god travels, yin officials report, and spectral escorts attend. Assigned assistant soldiers and clerics accompany them through mountains, forests, temples, and across rivers or seas. Day and night, subordinate troops remain at their side. All petitions to city gods require this seal for immediate response. If city god troops fail to arrive or disobey, a memorial may be submitted to the Celestial Emperor to demote or relocate them according to law.\n\nThe seal measures two *cun* and two *fen* in width, perfectly square, eight *fen* thick. Its inscription consists of six characters in two lines of stacked celestial seal script.\n\n---\n\n#### **Seal of the Upper Clarity Heavenly Pivot Institute**\nThe Seal of the Upper Clarity Heavenly Pivot Institute serves as the bureau for memorials to the Three Heavenly Gates of Upper Clarity. For mortals practicing methods, submitting memorials to celestial courts, or issuing directives to spirits of the middle and lower realms, this seal is essential. Excluding the Celestial Emperor, memorials may be submitted to all—from the Five Peaks and famous mountains of the middle realm to the gods of Fengdu in the lower realm, regardless of rank. Worn, it dispels evil; ingested, it cures illness. Wherever it travels, all spirits submit, and spectral attendants accompany its bearer.\n\nThe seal measures one *cun* and eight *fen* in width, one *cun* and nine *fen* in length. Its inscription consists of six characters in two lines of stacked seal script.\n\n---\n\n#### **Seal of the Great Master of Heavenly Methods**\nThe Seal of the Great Master of Heavenly Methods commands all spectral beings and the Six Grotto Demon Kings. Wherever malevolent spirits wreak havoc, dragons or *shen* stir calamity, or harm befalls the people, all talismans and registers require this seal. For those wronged by curses, ancestral spirits, or karmic debts of life or wealth, wearing this seal keeps vengeful spirits at bay and wards off evil karma. It dispels nightmares, harmonizes all affairs, cures chronic ailments, prolongs life, prevents poisoning, and averts the Nine Worms.\n\nIngested regularly, it eradicates long-standing illnesses.",
      "overlap_context": "",
      "start_char": 1,
      "end_char": 1139,
      "start_sentence": 0,
      "end_sentence": 55,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.38598656654358,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清天枢院回车毕道正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "及下死胎，催生，并皆烧灰吞服。 印阔一寸八分，长一寸九分，印文分六字，作二行迭篆。 上清朱明神符 散形 聚形 夫上清朱明神符者，是北斗七元圣君之真炁自然而成形也，系上清天枢院使行，可以破庙、除邪、入瘟、辟疫。 常佩护身，万恶不侵，鬼神见之，如大火山。 常服令人聪明，不生恶疾，毒药不害，不惧刀刃。 及治诸般恶疾，能止疼痛。 及治颠邪，小儿夜啼、惊风，妇人安胎、催生、下死胎，及鬼气、鬼胎，去三尸，剪鬼交，皆换汤液服之，无不应验。 右篆此符，用左手搯午上为诀，念咒书之。 咒曰：",
      "translated_text": "To expel stillborn fetuses or hasten childbirth, burn the seal to ash and ingest it.\n\nThe seal measures one *cun* and eight *fen* in width, one *cun* and nine *fen* in length, its inscription consisting of six characters in two lines of stacked seal script.\n\n**Vermilion Luminous Divine Talisman of Supreme Purity**\n*Scattered Form* | *Gathered Form*\n\nThe Vermilion Luminous Divine Talisman of Supreme Purity is the true *qi* of the Seven Primordial Lords of the Northern Dipper, naturally assuming form. Issued by the Celestial Pivot Bureau of Supreme Purity, it may shatter demonic shrines, expel evil, enter plague-ridden zones, and repel epidemics.\n\nWorn constantly, it shields the body, rendering all malevolence powerless to assail; spirits behold it as a towering mountain of fire.\n\nRegular ingestion sharpens the mind, prevents malignant ailments, neutralizes poisons, and grants fearlessness before blades.\n\nIt cures all manner of grave illnesses and alleviates pain. It treats madness, night terrors in children, convulsions, and febrile seizures; ensures safe pregnancies, hastens labor, expels stillborn fetuses, dispels ghostly *qi* and spectral pregnancies, eliminates the Three Corpses, and severs demonic unions. Steeped in decoctions, its efficacy is unfailing.\n\nTo inscribe this talisman, form the mudra with the left hand by pressing the *wu* finger upward while reciting the incantation:\n\n*Incantation:*",
      "overlap_context": ". Wherever malevolent spirits wreak havoc, dragons or *shen* stir calamity, or harm befalls the people, all talismans and registers require this seal. For those wronged by curses, ancestral spirits, or karmic debts of life or wealth, wearing this seal keeps vengeful spirits at bay and wards off evil karma. It dispels nightmares, harmonizes all affairs, cures chronic ailments, prolongs life, prevents poisoning, and averts the Nine Worms.\n\nIngested regularly, it eradicates long-standing illnesses.",
      "start_char": 1139,
      "end_char": 1384,
      "start_sentence": 56,
      "end_sentence": 67,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.994619131088257,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清天枢院回车毕道正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "北斗七真，天中大神。 上朝金阙，下覆昆仑。 调理纲纪，统制乾坤。 贪狼巨门，禄存文曲。 廉贞武曲，破军辅星。 大周天界，细入微尘。 何灾不灭，何福不臻。 元皇正炁，来合我身。 天罡所指，昼夜常轮，隔居小人，好道求真。 常见尊仪，愿赐长生。 高上玉皇，紫微帝君。 三台生我来，三台养我来，三台护我来，□□□□□□□。 又咒曰： 乾元亨利贞，日月是吾兵。 神符入五脏，永保得安宁。 急急如上清律令勑。 上清九狱神符 夫上清九狱神符者，治人间精邪为害，L 恶毒兴祆。 开门闭户，井泉涌沸，屋宅锅釜虚响，虫鼠作怪，诸般变现形影，使人颠狂，令人久病，困痾状枕，服药无效。 宅舍之下，腥膻之鬼，秽触之精，无由断绝。 即令具状，经本院投押。 用铁版生砂，依法书篆，镇所居之地埋之。 凡置酆都狱，用黄绢一尺二寸，阔七寸，书之，黏於狱内。 如水怪作孽，投於水中。 铁版大者长二尺四寸，阔一尺二寸； 小者长一尺二寸，阔七寸，书之。 凡书此符，须六戊日可篆，余日不可篆。 及篆符时，脚分丁字，无令人见。 用左手大指搯中指中节为诀，诵咒书之。 咒曰： 九狱灵君，酆都大神。 张马四毒，擒伏鬼神。 金罗铁网，收罩邪精。 三天帝勑，法令严行。 九州土地，社伯行兵。 风火雷电，有鬼粉形。 百千万卒，黑风火铃。 狱名大火，无劫更生。 铁师铜狗，伤食汝形。 一笔天地，二笔灭精。 三笔风伯，四笔狱成。 神符下镇，万鬼摧倾。 急急如上清律令勑。 右诵阮七遍书成。 又咒曰： 酆都九狱神，上帝勑奉行。 敢有不伏者，罪在五岳兵。 六丁六甲捉，步罡斗无情。 勑付魁罡下，万鬼不存形。 急急如上清律令勑。 右诵咒七遍，噀水七口於符上，了放诀。 上清雷公符 夫上清雷公神符者，治瘟邪疫炁、山岚瘴炁、五般蛊炁、传尸劳瘵、山精鬼魅、猖狂客死、伏尸古怪、投河自缢、兵亡、药死、产亡、林木游神作犯宅土、及他人承事之神被遣不去、坟墓兴灾者。 并仰具状，经本院投押，付所居之神后，方可用铁版上书。 此符五道，於五方埋之。 其鬼神只见雷火烧宅，皆无入处，或是他人家自梦被火所烧。 瘟疫之家得此符，患人皆见大火，心如发狂时，即凉汗立安。 若是古庙兴祆，林木成器，为民患者，亦书此符一道，埋於庙中林木之下，其庙自坏，其林自枯，不然有天火烧之。 如水中有怪，书此符一道，投於水中，其怪自灭，其鬼自驱，有龙自起。 铁版须得水日打，火日书。 铁版长一尺四寸，阔八寸。 入浄室内书时，丁罡三步，左手搯火日宫，辰为诀，诵咒书之。 咒曰： 都天雷公，呼云震风。 青雷赤炁，洞按九宫。 赤雷白炁，上游上穹。 白雷黑炁，北游元酆。 黑雷黄炁，太极元冲。 黄雷青炁，遍满虚空。 周天火界，炎炎赤风。 何神不伏，何鬼不从。 逆我者死，从我者封。 北云黑历，九丑紫童。 风伯雨师，驱电饮风。 神符至处，邪鬼无踪。 急急如上清律令勑。 右诵咒一十四遍书成，镇所居之地。 又咒曰： 都天大雷公，霹雳变虚空。 刀兵三十万，炎散紫洞中。 如有不伏者，严令辄不容。 摄付魁罡下，永为清浄风。 急急如上清律令勑。 右诵八十一遍，噀水九口於符上，了放诀。 上清火铃神符",
      "translated_text": "The Seven Perfected of the Northern Dipper, great deities of the celestial center.\nAbove, they ascend to the Golden Gates; below, they overspread Kunlun.\nThey regulate the cosmic net and govern the framework of Heaven and Earth.\nGreedy Wolf, Giant Gate, Wealth Storage, Literary Star,\nIntegrity and Chastity, Martial Star, Breaking Army, and the Auxiliary Star.\nThey encompass the great celestial realm, penetrating even the tiniest speck of dust.\nWhat disaster do they not eradicate? What blessing do they not bestow?\nThe primordial imperial *qi* comes to merge with my body.\nWherever the Celestial Pivot points, it revolves day and night without cease.\nThose who dwell apart from petty men, who seek the Dao and pursue the Perfected,\nshall constantly behold the august countenance and be granted longevity.\nThe Most High Jade Emperor, the Purple Tenuity Emperor Lord.\nThe Three Terraces gave me birth, the Three Terraces nurtured me,\nthe Three Terraces protected me, □□□□□□□.\n\n*Incantation:*\nQian, the Creative, is strong and unswerving.\nSun and moon are my soldiers.\nThe divine talisman enters the five viscera,\nforever preserving peace and tranquility.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\n**The Divine Talisman of the Nine Prisons of Highest Clarity**\nThe Divine Talisman of the Nine Prisons of Highest Clarity is employed to remedy spectral and demonic harms afflicting the human realm, where malevolent toxins and inauspicious omens arise.\nIt governs doors opening and closing, wells and springs surging and boiling, household pots and cauldrons emitting eerie sounds, insects and rodents behaving strangely, and all manner of apparitions manifesting in forms and shadows, driving people to madness, inflicting chronic illness, and confining them to bed, where remedies prove ineffective.\nBeneath the dwelling, foul and putrid ghosts and defiling spirits persist unceasingly.\nPresent a written petition to this court for endorsement.\nInscribe the talisman on an iron plate with raw cinnabar, following the prescribed method, and bury it beneath the dwelling’s ground.\nTo establish the Fengdu Prisons, use a piece of yellow silk, one foot and two inches in length and seven inches in width, inscribe the talisman upon it, and affix it within the prison.\nIf water spirits cause mischief, cast the talisman into the water.\nFor iron plates, larger ones measure two feet and four inches in length and one foot and two inches in width; smaller ones measure one foot and two inches in length and seven inches in width. Inscribe them accordingly.\nThis talisman must be drawn on a *wu* day; it may not be drawn on other days.\nWhile inscribing, stand in a *ding*-shaped stance, ensuring no one witnesses the process.\nForm the mudra with the left hand by pressing the thumb against the middle joint of the middle finger, recite the incantation, and then inscribe the talisman.\n\n*Incantation:*\nSpirits of the Nine Prisons, great deities of Fengdu,\nZhang and Ma, the Four Poisons, subdue and capture demonic spirits.\nGolden nets and iron webs enclose and seize perverse essences.\nBy the edict of the Three Heavenly Emperors, the law is strictly enforced.\nThe earth gods of the nine provinces and the local deities dispatch their troops.\nWind, fire, thunder, and lightning reduce ghosts to dust.\nWith a hundred thousand, ten thousand, a thousand legions,\nblack winds and fire bells resound.\nThe prison is named Great Fire—none escape to be reborn.\nIron lions and bronze dogs devour your forms.\nWith the first stroke, Heaven and Earth are inscribed;\nwith the second, essences are extinguished;\nwith the third, the Wind Earl is summoned;\nwith the fourth, the prison is completed.\nThe divine talisman descends to suppress; myriad ghosts are overthrown.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nAfter reciting the incantation seven times, the talisman is complete.\n\n*Incantation:*\nSpirits of the Nine Prisons of Fengdu,\nby the Emperor’s decree, they are dispatched.\nThose who dare disobey shall be punished by the soldiers of the Five Peaks.\nThe Six Ding and Six Jia spirits seize them; the steps of the Dipper and Pivot are merciless.\nThe edict is entrusted beneath the Pivot Star—no ghost retains its form.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation seven times, spray water seven times upon the talisman, and release the mudra.\n\n**The Divine Talisman of Thunder Duke of Highest Clarity**\nThe Divine Talisman of Thunder Duke of Highest Clarity is employed to remedy pestilential *qi*, miasmic *qi* from mountains and mists, the five types of *gu* poison, consumptive illnesses, mountain spirits and demonic entities, violent and unrestrained wandering dead, lingering corpses and ancient anomalies, those who drowned, hanged themselves, died in battle, by poison, or in childbirth, as well as wandering spirits of forests and trees that afflict the dwelling’s earth, and deities worshipped by others who have been sent but refuse to depart, or graves that bring forth calamities.\nPresent a written petition to this court for endorsement, and deliver it to the local earth god before inscribing the talisman on an iron plate.\nThis talisman consists of five strips, to be buried in the five directions.\nGhosts and spirits will perceive only thunder and fire engulfing the dwelling, leaving them no place to enter, or the afflicted household may dream of their home being consumed by fire.\nIn households struck by pestilence, the afflicted will see great flames and experience a frenzied state, but upon breaking into a cold sweat, they will immediately recover.\nIf ancient temples harbor inauspicious omens or forests and trees become instruments of harm to the people, inscribe one talisman and bury it beneath the temple or trees. The temple will crumble on its own, and the forest will wither; otherwise, heavenly fire will consume them.\nIf water harbors anomalies, inscribe one talisman and cast it into the water. The anomaly will vanish, the ghost will be driven away, and a dragon will arise.\nIron plates must be forged on a *water* day and inscribed on a *fire* day.\nThe iron plate measures one foot and four inches in length and eight inches in width.\nInscribe it within a purified chamber, stepping the *ding*-Pivot three times. Form the mudra with the left hand by pressing the *fire* day’s palace, using the *chen* position as the seal, recite the incantation, and inscribe the talisman.\n\n*Incantation:*\nThunder Duke of the Capital Heaven, who summons clouds and shakes the winds.\nGreen thunder with crimson *qi* penetrates the nine palaces.\nCrimson thunder with white *qi* ascends to the highest heavens.\nWhite thunder with black *qi* roams the northern Fengdu.\nBlack thunder with yellow *qi* surges through the Great Ultimate’s primordial axis.\nYellow thunder with blue-green *qi* fills the empty void.\nThe celestial fire realm blazes with scorching winds.\nWhat spirit does not submit? What ghost does not obey?\nThose who oppose me perish; those who follow me are enfeoffed.\nNorthern clouds, black calendars, the Nine Uglies, and the Purple Youths.\nThe Earl of Wind and the Master of Rain drive lightning and consume winds.\nWhere the divine talisman arrives, no perverse ghost remains.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nAfter reciting the incantation fourteen times, the talisman is complete. Bury it beneath the dwelling’s ground.\n\n*Incantation:*\nGreat Thunder Duke of the Capital Heaven,\nwhose thunderclaps transform the empty void.\nThree hundred thousand blades and soldiers scatter in the crimson cavern.\nThose who dare disobey shall face the stern decree without mercy.\nEntrusted beneath the Pivot Star, they become forever pure and serene winds.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation eighty-one times, spray water nine times upon the talisman, and release the mudra.\n\n**The Divine Talisman of Fire Bells of Highest Clarity**",
      "overlap_context": "es all manner of grave illnesses and alleviates pain. It treats madness, night terrors in children, convulsions, and febrile seizures; ensures safe pregnancies, hastens labor, expels stillborn fetuses, dispels ghostly *qi* and spectral pregnancies, eliminates the Three Corpses, and severs demonic unions. Steeped in decoctions, its efficacy is unfailing.\n\nTo inscribe this talisman, form the mudra with the left hand by pressing the *wu* finger upward while reciting the incantation:\n\n*Incantation:*",
      "start_char": 1384,
      "end_char": 2645,
      "start_sentence": 68,
      "end_sentence": 152,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.577868938446045,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清天枢院回车毕道正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "夫上清火铃神符者，治妇人无子、怀孕不安，有孕不过三五月间自然落下，或养子不成，不过一二岁而死，多方作福而无应验。 能治如此之事，非寻常也。 或因门户风水，或是坟冢所招，或是宅有伏尸，或是井灶不利，或因作犯，或是星神，或夫妻二命相刑，或祖宗有过，或前世不钦子孙，或自高曾辜负父母，或室户不明。 大凡若要子息寿命坚牢，切须戒忌，朔望弦晦，四时八节，甲子庚申，大风大雨，大寒大暑，大饱大饥大醉，星月之下，井灶神祇之前，雷电震响，天有祥云，日月交蚀，切慎行房。 如能依此，方子息受胎安稳，相貌十全，福寿延远； 若不依此，假使长子长寿，必须丑恶贫薄，及令短寿。 凡有此事，并仰具状，经本院投押，依式书此神符，夫妻佩带，不过月日之间，便有吉梦受胎，必生贵子。 长下亦须令佩此符，永无疾患，具福长寿，百鬼不侵，万邪不害。 若用铁版或木板，不拘大小，书篆焚香供养，大辟瘟疫，治火灾。 并用朱书，左手大指搯寅上为诀，诵咒书之。 若人佩带供养，天使灵官佑之。 咒曰： 大火铃空，监生上穹。 执箓掌籍，好生韩公。 五帝破魂，三台禄封。 七元助魄，神元负宗。 尸鬼辟合，不欲鬼穷。 但受人命，杀邪却踪。 上天勑赐，永受仙宫。 虚无大神，断恶除凶。 九天司命，令元祖公。 注命生根，度人灵通。 绝却逆鬼，斩除邪踪。 神符覆护，紫云真容。 急急如上清律令勑。 右诵咒二十一遍书成。 又咒曰： 周天大火铃，保命受延龄。 三尸俱辟合，灵宝守长生。 不欲不道穷，但欲仙道成。 遏人三黄章，五岳碧灵空。 急急如上清律令勑。 右诵咒三十六遍，噀水一口於符上，了放诀。 上清丁甲神符 夫上清丁甲神符者，治人间作犯太岁，土符神杀。 又他人家造作，飞土临宅。 及葬犯山神，风水不顺，多生灾咎。 妇人阴小生疮，频被汤火伤害。 久病床枕，有药不效。 或命属凶星，运限相并，令人蒙昧，作事迟延，夜多乱梦，人口不安。 及雌雄杀，丧车句连。 及命属他人咒咀，常多疾病，心神不宁，家中常令人颠狂。 宅有伏尸怪物、自伤刑害之鬼，夜出现形，打灯放火，惊吓妇女小儿，财物虚耗。 并仰具状，经本院投押，书此灵符。 或供养，或佩带，可立应验。 若有造作，亦书此符二十四道，於宅上周匝贴之。 不须歇宅，自有吉神卫护，凶星恶杀不敢为害。 书此神符，并用生砂，用左手大指掐午上为诀，诵咒书之，用无不验也。 咒曰： 丁甲将军，天蓬尊神。 三台仰助，六甲六丁。 前驱九丑，后灭山精。 泉灵通济，上帝勑行。 九州土地，山泽河源。 二十八宿，六神平安。 童子行令，八卦尊乾。 朱雀佑助，玄武当千。 青龙正主，白虎伏连。 上通金阙，下合乾元。 总管鬼兵，一表同上天。 符主魁罡，万祆摧迁。 急急如上清律令勑。 右诵咒二十一遍书成。 又咒曰： 丁甲大将军，六十上阳神。 太上高上道，勑赐魁罡君。 收擒山泽鬼，下捉土黄神。 若有不正者，乾元亨利贞。 急急如上清律令勑。 右诵咒八十一遍，噀水一口於符上，了放诀。 上清北斗七元符 夫上清北斗七元圣君符者，治人间宿造恶业。 祖宗之祟，传成瘵疾，递互相感，无药可治，遂乾枯四肢形状。 如命未终，先传宗裔，如此之状，求无尽歇。",
      "translated_text": "The **Divine Talisman of Fire Bells of Highest Clarity** addresses women who fail to conceive, suffer unstable pregnancies, or miscarry within three to five months; those whose children do not survive past one or two years; and cases where despite extensive prayers and offerings, no remedy proves effective. Such afflictions are no ordinary matter. They may arise from adverse *fengshui* in the household, malign influences from ancestral graves, lingering *fushi* (buried corpses) in the dwelling, inauspicious wells or stoves, ritual transgressions, baleful stellar deities, marital incompatibility in the couple’s destinies, ancestral wrongdoing, past-life neglect of descendants, or offenses against parents by one’s own forebears—or from uncleanliness within the home.\n\nTo ensure robust offspring and longevity, strict abstinence is required: on the new and full moons, the waxing and waning quarters, the four seasons and eight solar terms, the *jiazi* and *gengshen* days, during great winds or rains, extreme cold or heat, after excessive eating or drinking, under the stars and moon, before well and stove deities, amid thunder and lightning, when auspicious clouds appear, or during solar and lunar eclipses—all such times demand restraint from conjugal relations. Adherence to these precepts ensures stable conception, perfect features in the child, and extended blessings of fortune and longevity. Failure to comply, even if the firstborn survives, will result in ugliness, poverty, or premature death.\n\nFor such cases, submit a written petition to this institute for endorsement. Inscribe the talisman as prescribed, and have the couple wear it. Within a month, auspicious dreams will herald conception, and a noble child will be born. Even after birth, ensure the child wears this talisman to remain free from illness, enjoy lasting fortune and longevity, and be shielded from malevolent spirits and all harm.\n\nIf inscribed on iron or wooden plaques of any size, burned with incense, and venerated, the talisman also repels plagues and fire disasters. Write it in cinnabar, pressing the left thumb to the *yin* position while forming the mudra, and recite the incantation as you inscribe it. Those who wear or venerate it will be protected by celestial envoys and spirit officials.\n\n*Incantation:*\nGreat Fire Bells of the Void,\noverseeing life in the highest heavens.\nHolding the registers, wielding the ledgers,\nHan Gong, who cherishes life.\nThe Five Emperors shatter souls,\nthe Three Terraces bestow fates.\nThe Seven Primes assist the *po*,\nthe divine origin upholds the lineage.\nCorpse-ghosts disperse and converge,\nno ghost shall be left destitute.\nThey receive human destinies,\nslaying evil and banishing traces.\nBy decree of Heaven, eternally granted,\nthey dwell in the immortal palace.\nThe Great Spirit of Emptiness,\nsevering evil and expelling misfortune.\nThe Nine Heavens’ Controller of Destinies,\nordains the Primordial Ancestor.\nInscribing life’s roots,\nenlightening human transcendence.\nCutting off rebellious ghosts,\nslashing away evil trails.\nThe divine talisman shelters,\nits true form in purple clouds.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation twenty-one times to complete the inscription.\n\n*Additional Incantation:*\nThe Great Fire Bells of the Celestial Circuit,\npreserving life and extending years.\nThe Three Corpses all disperse,\nthe Numinous Treasure guards eternal life.\nThey reject the destitute and lawless,\nseeking only the perfection of the Dao.\nSuppressing the Three Yellow Chapters,\nthe Five Peaks in azure emptiness.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation thirty-six times, spray water once upon the talisman, and release the mudra.\n\n---\n\n**The Divine Talisman of Ding and Jia of Highest Clarity**\nThe **Divine Talisman of Ding and Jia of Highest Clarity** remedies transgressions against the Grand Year (*Taisui*), earth deities, and *tufu* spirits; or when others’ construction projects cause *feitu* (flying earth) to afflict the dwelling. It also addresses burial offenses against mountain spirits, adverse *fengshui*, frequent calamities, genital sores in women, repeated scalds or burns, chronic illness unresponsive to medicine, baleful stars aligning with one’s fate, causing confusion, procrastination, restless dreams, and household unrest. It counters *cixiongsha* (male-female killing stars), funeral processions, curses from others, persistent illness, mental agitation, and family members afflicted by madness. It dispels *fushi* (lingering corpses), malevolent entities, self-inflicted harm, nocturnal apparitions, lanterns lit or fires set by unseen hands, terrorizing of women and children, and inexplicable loss of wealth.\n\nSubmit a written petition to this institute for endorsement, then inscribe this divine talisman. Whether venerated or worn, its efficacy is immediate. For construction projects, inscribe twenty-four copies of this talisman and affix them around the dwelling—no need to suspend work, as benevolent spirits will guard the site, and baleful stars or malevolent forces will dare not harm.\n\nInscribe the talisman using raw cinnabar, pressing the left thumb to the *wu* position while forming the mudra, and recite the incantation as you write. Its power is infallible.\n\n*Incantation:*\nGenerals Ding and Jia,\nrevered deities of Tianpeng.\nThe Three Terraces lend aid,\nthe Six Jia and Six Ding.\nNine Uglies lead the vanguard,\nmountain spirits are vanquished in the rear.\nThe spirit of springs and streams aids the crossing,\nby the Emperor’s decree they march.\nThe lands of the Nine Provinces,\nmountains, marshes, rivers, and springs.\nThe Twenty-Eight Constellations,\nthe Six Spirits at peace.\nThe Divine Youth executes commands,\nthe Eight Trigrams honor Qian.\nThe Vermilion Bird assists,\nthe Dark Warrior resists.\nThe Azure Dragon presides,\nthe White Tiger submits.\nAbove, they commune with the Golden Gates,\nbelow, they unite with Qian’s origin.\nCommanding ghostly soldiers,\ntheir report ascends to Heaven.\nThe talisman’s master is the Pivot Star,\nall myriad evils are crushed and expelled.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation twenty-one times to complete the inscription.\n\n*Additional Incantation:*\nGreat Generals Ding and Jia,\nthe sixty deities of Supreme Yang.\nThe Most High and Lofty Dao,\ndecrees the Pivot Star Lord.\nSeizing mountain and marsh ghosts,\nsubduing the Yellow Earth spirits.\nAny who resist,\nQian’s origin brings harmony and virtue.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation eighty-one times, spray water once upon the talisman, and release the mudra.\n\n---\n\n**The Divine Talisman of the Seven Primes of the Northern Dipper of Highest Clarity**\nThe **Divine Talisman of the Seven Primes of the Northern Dipper of Highest Clarity** remedies the lingering consequences of past evil deeds, ancestral curses, and transmitted consumptive illnesses that spread contagiously, defying all medical treatment, until the body withers and the limbs waste away. If one’s fate is not yet exhausted, the affliction may first pass to descendants, perpetuating an unending cycle of suffering.",
      "overlap_context": "se thunderclaps transform the empty void.\nThree hundred thousand blades and soldiers scatter in the crimson cavern.\nThose who dare disobey shall face the stern decree without mercy.\nEntrusted beneath the Pivot Star, they become forever pure and serene winds.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation eighty-one times, spray water nine times upon the talisman, and release the mudra.\n\n**The Divine Talisman of Fire Bells of Highest Clarity**",
      "start_char": 2645,
      "end_char": 3913,
      "start_sentence": 153,
      "end_sentence": 226,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.254523277282715,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清天枢院回车毕道正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "於是上帝哀愍，降此灵符。 令各书篆烧灰。 用柳木克人子七个，用无灰酒煎调下，日服三道，不经十日其虫自死，其形渐生。 有此状者，并仰具状，经本院投押，录本人情状，闻奏上帝。 及牒岳渎，谢过解释，然后可篆此符，给付患人依式吞服。 及篆此符二十一道，於屋下四周安贴，并篆佩带，立有吉梦，亦感上真降真炁护身。 此符常带，保命护身，不招横祸，镇宅大吉。 此符并用生砂书篆，用左手大指搯子上为诀，诵咒书之。 咒曰： 北斗七星，玉真仙灵。 贪狼巨门，保命长荣。 禄存文曲，使臣聪明。 廉贞武曲，卫臣安宁。 破军辅星，护臣身形。 常居吉庆，永处福龄。 注上生籍，勾落死名。 神清气爽，洞达幽冥。 御邪摄鬼，群祆摧倾。 学道修真，伏愿遂成。 七元覆护，飞升紫庭。 五脏神君，各保安宁。 急急如上清律令勑。 右诵咒一十四遍书成。 又咒曰： 大圣七元君，天中至尊神。 愿保永长生，三尸辟合群。 擎羊大神将，绝却死命门。 陀罗为散花，常得延寿年。 急急如上清律令勑。 右诵七遍，噀水一。 於符上，了放诀。 上清三台神符 夫上清三台符者，大宁吉庆之宿，汇盖万事。 凡人命值星宿，运限不通，恶曜缠照，频招官事，宅发瘟黄，长子多生疾患，及妇人难产，有三世冤家债主负命欠财，无由解脱。 并仰具状，经本院投押，用黄绫书此真符，戴於头上，即时凶星不照，冤鬼不侵。 此符为天中匿盖，至真之宝。 用左手大指搯辰上为诀，诵咒书之。 咒曰： 三台星君，护我身形。 用天覆护，紫炁顺成。 九元辟合，斩摄威灵。 太乙伏我，《河图》六经。 高上神王，飞天自扃。 无愁元始，照冑元精。 猛马四张，幢鼓金铃。 巨天甲卒，六甲六丁。 游行天下，匿盖身形。 何灾敢现，何鬼怒睛。 灾视者灭，怒睛者倾。 神符一单，天不视形。 急急如上清律令勑。 右诵咒一十四遍书成。 又咒曰： 三台生我来，本命得长生。 三台养我来，上帝保护持。 三台护我来，永寿得安宁。 勑付魁罡下，元亨大利贞。 急上急如上清律令勑。 右诵咒四十九遍，噀水一口於符上，了放诀。 上清黑杀神符 夫上清黑杀神符者，治水怪、江河龙蜃作孽，兴风作浪，陷没舟航，曲求祭祀，损害人命之事。 并仰具状，经本院投押，用铁版一片，长一尺二寸，阔七寸，朱书此符，下镇兴祆之地，其龙蜃即时移居。 若黑杀真君闻龙蜃触符，即亲下伏之。 若渡江海，用纸书佩之，不受水厄，大辟水怪。 亦能镇宅，除灾验怪。 用左手大指搯亥上诀，诵咒书之，并用生砂。 咒曰： 黑杀真君，光化日月，威镇乾坤。 行符摄录，断绝鬼门。 游行天下，收捉鬼神。 行神布炁，扫除五瘟。 左右吏兵，三五将军。 雷公霹雳，电掣云奔。 刀剑如雨，队仗如云。 吐牙努力，破碎其形。 九州社令，血食之兵。 神符降令，法到奉行。 果不从命，杀不容情。 夔龙赫奕，红霞紫庭。 急急如上清律令勑。 右诵咒十八遍书成 又咒曰： 黑杀大力神，无边济法界。 擒魔束邪精，遍游周天界。 驱龙入江海，动达苦幽济。 金剑斩祆凶，鬼邪当自弭。 急急如上清律令勑。 右诵咒二十一遍，噀水一口於符上，了放诀。 上清五岳真形符 夫上清五岳真形符者，入山能伏狼虎，入水能伏龙蜃。",
      "translated_text": "Thus did the Celestial Emperor take pity, bestowing this sacred talisman. Have it transcribed in seal script and burned to ashes. Take seven willow twigs, each carved with the character for \"child,\" and steep them in ashless wine. Drink three doses daily, and within ten days the worms shall perish, and the body gradually restore itself. Those afflicted with such conditions must submit a written petition to this institute, where their circumstances shall be recorded and presented to the Celestial Emperor. A memorial shall also be dispatched to the sacred mountains and rivers to seek absolution. Only then may this talisman be transcribed, given to the sufferer, and swallowed according to the prescribed method. Additionally, transcribe twenty-one copies of this talisman, affix them to the four corners of the dwelling, and carry one on the person. Auspicious dreams shall soon follow, and the Perfected Ones of the Highest Clarity shall descend with true qi to guard the body. Wearing this talisman ensures protection of life, defense of the person, averts misfortune, and secures great fortune for the household.\n\nThis talisman must be transcribed with cinnabar, using the left thumb to press the \"zi\" position as the mudra while reciting the incantation. The incantation reads:\n\nThe Seven Stars of the Northern Dipper,\nJade Perfected, divine and numinous.\nGreedy Wolf and Great Gate,\npreserve life and grant enduring glory.\nSalary Star and Literary Curve,\nbestow wisdom upon your servant.\nIntegrity Star and Martial Tune,\nguard your servant in peace.\nBroken Soldier and Auxiliary Star,\nshield your servant’s form.\nEver dwell in fortune,\neternally abide in blessed longevity.\nInscribe in the register of life,\nstrike from the ledger of death.\nSpirit clear, qi refreshed,\npenetrating the hidden and obscure.\nCommand demons, subdue ghosts,\nall malevolent forces topple and fall.\nThose who cultivate the Dao and refine the true,\nmay their aspirations be fulfilled.\nThe Seven Primes extend their protection,\nascending to the Purple Court.\nThe spirit lords of the five viscera,\neach safeguard in tranquility.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation fourteen times to complete the transcription.\n\nAnother incantation reads:\nGreat Sage of the Seven Primes,\nsupreme deities of the heavens.\nGrant eternal longevity,\nthe Three Corpses flee in disarray.\nThe mighty divine general, Lifting Ram,\nseals the gate of death.\nDhāraṇī scatters flowers,\nprolonging the years of life.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite seven times, spray water once upon the talisman, and release the mudra.\n\n**The Divine Talisman of the Three Terraces of Highest Clarity**\nThe **Divine Talisman of the Three Terraces of Highest Clarity** embodies the constellation of great peace and fortune, governing all affairs. When one’s fate aligns with this stellar configuration, yet their fortune remains obstructed, malignant stars cast their baleful influence, repeatedly inviting official disputes, pestilence, and jaundice to the household. The eldest son often falls ill, women endure difficult childbirth, and ancestral enemies or creditors exact their due in life or wealth, with no means of escape. Submit a written petition to this institute, whereupon this true talisman shall be transcribed on yellow silk and worn upon the head. Immediately, the baleful stars shall withdraw, and vengeful ghosts shall not intrude.\n\nThis talisman is the hidden treasure of the heavens, the most true and precious. Using the left thumb to press the \"chen\" position as the mudra, recite the incantation while transcribing. The incantation reads:\n\nThree Terraces Star Lords,\nguard my form.\nWith celestial cover,\npurple qi flows smoothly.\nThe Nine Primes gather,\nsevering and subduing with might.\nThe Great One bends to me,\nthe *River Chart* and Six Classics.\nHighest Perfected Kings,\nsoaring through the heavens, self-sealed.\nFree from sorrow, Origin Prime,\nilluminating the essence of the embryo.\nFour fierce steeds arrayed,\nbanners, drums, and golden bells.\nMighty Celestial Armored Soldiers,\nthe Six Jia and Six Ding.\nRoaming the world,\nconcealing my form.\nWhat disaster dares appear?\nWhat ghost dares glare?\nThose who cast baleful eyes shall perish,\nthose who glare shall fall.\nA single talisman,\nand Heaven shall not see my form.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation fourteen times to complete the transcription.\n\nAnother incantation reads:\nThe Three Terraces bring me forth,\nmy life granted longevity.\nThe Three Terraces nurture me,\nthe Celestial Emperor protects and sustains.\nThe Three Terraces guard me,\neternal peace and tranquility.\nDecreed to the Mighty Ridge below,\norigin, prosperity, great benefit, and virtue.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation forty-nine times, spray water once upon the talisman, and release the mudra.\n\n**The Divine Talisman of the Black Killer of Highest Clarity**\nThe **Divine Talisman of the Black Killer of Highest Clarity** remedies the mischief of water monsters, river dragons, and sea serpents that stir winds and waves, capsizing boats and demanding sacrifices, thereby harming lives. Submit a written petition to this institute, whereupon an iron plaque, one foot and two inches in length and seven inches in width, shall be inscribed with this talisman in cinnabar and placed to suppress the site of the malevolent activity. The dragon or serpent shall immediately relocate. When the Black Killer Perfected Lord hears of a dragon or serpent violating the talisman, he shall personally descend to subdue it. When crossing rivers or seas, transcribe the talisman on paper and wear it to avoid water calamities and repel aquatic monsters. It also pacifies households and dispels disasters and strange occurrences.\n\nUsing the left thumb to press the \"hai\" position as the mudra, recite the incantation while transcribing, and use cinnabar. The incantation reads:\n\nBlack Killer Perfected Lord,\nyour radiance transforms sun and moon,\nyour might stabilizes Heaven and Earth.\nWielding talismans to command and record,\nsealing the gates of ghosts.\nRoaming the world,\ncapturing and subduing spirits.\nDivine soldiers deploy qi,\nsweeping away the Five Pestilences.\nLeft and right officers and soldiers,\nthe Three and Five Generals.\nThunder Lords and lightning bolts,\ncharging through clouds.\nSwords like rain,\nbanners and weapons like clouds.\nSpitting fangs and exerting strength,\nshattering their forms.\nThe Earth Gods of the Nine Provinces,\nthe blood-fed soldiers.\nThe talisman’s decree descends,\nthe law is obeyed.\nThose who defy,\nshall be slain without mercy.\nKui and Dragon resplendent,\nred clouds and the Purple Court.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation eighteen times to complete the transcription.\n\nAnother incantation reads:\nBlack Killer, mighty divine,\nboundlessly aiding the Dharma realm.\nSeizing demons, binding evil spirits,\ntraversing the celestial spheres.\nDriving dragons into rivers and seas,\nreaching the suffering in hidden realms.\nGolden swords sever malevolent forces,\nghosts and demons shall yield.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation twenty-one times, spray water once upon the talisman, and release the mudra.\n\n**The Divine Talisman of the True Forms of the Five Peaks of Highest Clarity**\nThe **Divine Talisman of the True Forms of the Five Peaks of Highest Clarity** subdues wolves and tigers when entering mountains and tames dragons and serpents when entering water.",
      "overlap_context": "isman of the Seven Primes of the Northern Dipper of Highest Clarity**\nThe **Divine Talisman of the Seven Primes of the Northern Dipper of Highest Clarity** remedies the lingering consequences of past evil deeds, ancestral curses, and transmitted consumptive illnesses that spread contagiously, defying all medical treatment, until the body withers and the limbs waste away. If one’s fate is not yet exhausted, the affliction may first pass to descendants, perpetuating an unending cycle of suffering.",
      "start_char": 3913,
      "end_char": 5189,
      "start_sentence": 227,
      "end_sentence": 316,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.67867588996887,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清天枢院回车毕道正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "佩之吉祥，不遭患难。 及虫蚁损害屋宇、飞乌入屋作怪、虫蛇出现，并仰具状，经本院投押，用梓木板，长二尺四寸，阔一尺二寸，朱书此符，钉於宅上，其怪自坏，虫蚁自去，永不为害也。 若佩之，保身护命，辟诸危难。 修行之士，切须佩之，免有魔障。 此符用左手大指搯已上为诀，诵咒书之。 咒曰： 五岳真形，受天禹经。 大洞魔王，九丑元灵。 战魔捉鬼，降伏祆精。 天丁力士，吐马云增、速送冤灵。 甲乙戊己，壬癸庚辛。 丙丁摄炎，六罗大千。 元罡九网，合元归神。 总广上曜，太虚太清。 上帝盖护，土地安宁。 太微六甲，混合乾元。 八九神符，下镇山川，勑至奉行。 急急如上清律令勑。 右诵咒一十四遍书成。 又咒曰： 五岳大灵符，收擒灭恶趣。 若有犯我者，天车衰地车。 风雷行火电，猛将伏魔诛。 劫付魁罡下，骑鬼奉天驱。 急急如上清律令勑。 右诵咒一十八遍，噀水一口於符上，了放诀。 上清天罡神符 夫上清天罡神符者，治人间精邪、恶毒蛊气、鬼胎鬼炁传行人道，损害人命。 及诸为祆，一切邪神，在人宅舍非理执占不去。 及牛瘟，六畜瘟灾。 并仰具状，经本院投押，皆用朱书此符安镇，立获吉祥。 及书佩带，延寿辟恶，除三尸，去九虫，不受瘟祸，剪鬼交，并治小儿夜啼惊叫。 颠邪、山岚瘴气、五般痁疾、诸般疾苦，皆能辟伏。 用左手大指搯子上为诀，诵咒书之。 咒曰： 天罡大神，九九七真。 元命太乙，杀鬼氛氲。 九州分野，太白尊星。 周行六合，炎炎火铃。 八威吐毒，伏鬼不刑。 三十五万，食鬼吞精。 幽冥大赫，降魔伏灵。 大千世界，总气上兵。 何神不佑，何鬼敢停。 泰山丈人，扬扬虚霐。 讦恶之鬼，尽使刀兵。 神符永镇。 万鬼不宁。 急急如上清律令勑。 右诵咒八遍书成。 又咒曰： 三十六天歪，天中大神王。 炎帝烈我血，赐我为上黄。 七总太元君，为吾驱祸殃。 真炁受雷火，老公伏火光。 急急如上清律令勑。 右诵咒二十一遍，噀水一口於符上，了放诀。 上清天枢院回车毕道正法卷上竟 上清天枢院回车毕道正法卷中",
      "translated_text": "Wearing it brings auspiciousness and averts calamities. It prevents damage to houses from insects and ants, strange occurrences when birds fly into dwellings, and the appearance of snakes and vermin. In such cases, submit a petition to this court for registration, then inscribe this talisman on a catalpa wood board, two feet and four inches in length and one foot and two inches in width, using cinnabar. Nail it to the residence, and the strange phenomena will dissolve, insects and ants will depart, and they shall never cause harm again. If worn on the person, it protects the body and safeguards life, repelling all dangers. Those who cultivate the Dao must wear it to avoid demonic obstructions.\n\nTo inscribe this talisman, form the mudra by pressing the left thumb against the upper joint of the index finger, recite the incantation, and write. The incantation reads:\nThe true forms of the Five Peaks,\nreceived from the Heavenly Yu’s scriptures.\nGreat Cavern’s Demon King,\nNine Shameful Primal Spirits.\nVanquishing demons, seizing ghosts,\nsubduing malevolent spirits.\nHeavenly Ding soldiers,\nspitting forth horse-clouds and augmenting—swiftly dispatch vengeful spirits.\nJia Yi, Wu Ji, Ren Gui, Geng Xin.\nBing Ding command the flames,\nSix Netherworlds of the Great Thousand.\nPrimal Dipper’s ninefold net,\nuniting the primal to return to the spirit.\nGathering the radiance of the Upper Luminaries,\nGreat Void and Great Clarity.\nThe Emperor’s sheltering canopy,\nthe land’s peace and tranquility.\nSupreme Tenuity’s Six Jia,\nmerging with Qian’s primal origin.\nEight-nine divine talismans,\ndescend to guard mountains and rivers.\nAs decreed, execute without delay.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation fourteen times to complete the inscription.\n\nAnother incantation reads:\nGreat talisman of the Five Peaks,\nseizing and annihilating evil destinies.\nShould any transgress against me,\nheavenly and earthly chariots shall crush them.\nWind and thunder, fire and lightning,\nfierce generals subdue and execute demons.\nBound to the Dipper’s stem,\nriding ghosts to serve Heaven’s command.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation eighteen times, spray water once upon the talisman, and release the mudra.\n\n**The Divine Talisman of the Celestial Dipper of Highest Clarity**\nThe **Divine Talisman of the Celestial Dipper of Highest Clarity** remedies human afflictions caused by spectral perversity, malignant poisonous *gu* qi, ghostly fetuses, and demonic qi transmitted to travelers, harming their lives. It also addresses all manner of malevolent forces, every perverse spirit that unlawfully occupies and refuses to leave human dwellings, as well as cattle plagues and pestilences affecting the six livestock. Submit a petition to this court for registration, then inscribe this talisman with cinnabar for installation and consecration—auspiciousness shall be immediately attained. When inscribed and worn, it prolongs life, repels evil, expels the Three Corpses, eliminates the Nine Worms, averts pestilential misfortune, severs ghostly bonds, and treats nighttime crying and fright in children. It also cures madness, miasmic mountain vapors, the five types of *zhan* illnesses, and all manner of ailments, repelling and subduing them all.\n\nTo inscribe this talisman, form the mudra by pressing the left thumb against the upper joint of the index finger, recite the incantation, and write. The incantation reads:\nGreat spirit of the Celestial Dipper,\nnine nines and seven perfected.\nPrimal life of the Great Unity,\nslaying ghostly miasmas.\nThe nine provinces’ domains,\nVenerable Star of Venus.\nTraversing the six directions,\nflaming fire bells.\nEight mights spitting poison,\nsubduing ghosts without punishment.\nThree hundred fifty thousand,\ndevouring ghosts and consuming essences.\nGreat brilliance of the netherworld,\nsubduing demons and vanquishing spirits.\nThe Great Thousand World,\nall qi as the Upper Army.\nWhat spirit does not protect?\nWhat ghost dares linger?\nThe Venerable of Mount Tai,\nresplendent in the void’s radiance.\nGhosts that slander the virtuous,\nall shall be met with blades.\nThe divine talisman eternally guards.\nTen thousand ghosts find no peace.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation eight times to complete the inscription.\n\nAnother incantation reads:\nThirty-six deviant heavens,\ngreat divine kings of the celestial realm.\nFlame Emperor scorches my blood,\nbestowing upon me the title of Supreme Yellow.\nSeven Lords of the Great Primal,\ndrive misfortune away for me.\nTrue qi receives thunder and fire,\nthe Old Duke subdues the fire’s glow.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation twenty-one times, spray water once upon the talisman, and release the mudra.\n\nHere ends the first scroll of *The Orthodox Methods of the Highest Clarity’s Celestial Pivot Court’s Returning Chariot Dao*.\nHere begins the second scroll of *The Orthodox Methods of the Highest Clarity’s Celestial Pivot Court’s Returning Chariot Dao*.",
      "overlap_context": "words sever malevolent forces,\nghosts and demons shall yield.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation twenty-one times, spray water once upon the talisman, and release the mudra.\n\n**The Divine Talisman of the True Forms of the Five Peaks of Highest Clarity**\nThe **Divine Talisman of the True Forms of the Five Peaks of Highest Clarity** subdues wolves and tigers when entering mountains and tames dragons and serpents when entering water.",
      "start_char": 5189,
      "end_char": 6010,
      "start_sentence": 317,
      "end_sentence": 375,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.047176361083984,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清天枢院回车毕道正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "布气法 至诚到处，向日焚香，仰祝曰：具职位某，仰告太阳帝君：臣某行天枢院天心正正法，救治万民疾苦，布气安神。 今乞特赐慈悲，愿降真气，入臣身中。 泥丸百节，五脏六腑，浩然充满。 凡治生灵，愿无不效。 毕，志心唯一，呜天鼓七下，开目向日，两手各搯中指第三节，便向日取气一口吞之。 念咒七遍，然后吞此第二口也。 再搯右手，念咒七遍。 又取一口气吞之，便将两手交对口上，咒七遍。 又取真气一口，吹两诀上。 周而复始，如此为之者三。 咒曰：风疼风裹去，气痛随气灭。 凡有患人，令在东南方，西北向。 师在西北，东南向，对面坐。 令患人按定痛处，不得放。 先嗽一声，便取气一口，未得吞下，便安两手如前诀，咒七遍。 令再嗽声，取气吞下，再咒如前。 轻者三五次，重五七次，必效。 咒水法 浄心争意，两手中指按掌心文，请五方二十八宿： 谨请东方角亢之星精真形，仗剑持符，护吾身形。 谨请南方井鬼之星精真形，仗剑持符，护吾身形。 谨请西方奎娄之星精真形，仗剑持符，护吾身形。 谨请北方斗牛之星精真形，仗剑持符，护吾身形。 谨请中央七星之精黄之真形，仗剑持符，护吾身形。 五方真气入吾此水。 此水非常之水，上清无极大道自然之水，能除疾病，能救苦厄。 吾此水一点落处，皆成清浄。 若是正神，着此水者，广大神通。 若是祆怪，着此水者，身如大火所烧。 此水皆是上天真人降真气所成，何邪不伏，何鬼敢形。 当吾者死，背吾者亡。 神水到处，万鬼伏藏。 咒曰： 魁元乾元，利贞游贞。 太虚请勑，昆仑天户。 急急如上清律令。 三七遍。 右用洒浄，则荡诸邪秽，吞符，则莫不立应。 时行瘟疫，可洒宅舍内外。 及有病，煎煮汤散，其效乃信，无所不用也。 取劳虫法 凡人患传尸疾，未及一百二十日者，则先虔请正一道士作醮三日，书符三道，依后法与患人服之。 至第四日，预备铛一只，煎油五斤以上，用白绢一疋，缚患人於柱上。 用生丝左线三条，各长四尺四寸，每条桃木上缚符一道，令患人以人参汤吞下。 一道令人把定，候符收线，入腹中系，用尺斡开口，急拔出符，虫在上。 如此三度，取虫三条，皆作声入油煎了，乃安。 一条两条，断必死。 第一符 用绢半寸方，以朱书。 左手午上为诀，念咒书，以蜡丸之。 於第一日丑时服之，乳香汤下。 念咒三遍书成。 咒曰： 天灵三光神，令我受赐命。 令受勑斩汝，劫至法奉行。 第二符 用绢半寸方，以朱书，左手申上为诀，念咒书之，以蜡为丸。 於第二日午时服之，乳香汤下。 念咒三遍乃书成。 咒曰： 本为汝我损，我今辟合汝。 如是诸飞天，流浪饮尸鬼。 第三符 用绢半寸方，以朱书。 左手亥上为诀，念咒书，以蜡为丸。 至第三日亥时服，乳香汤下。 念咒三遍书成。 咒曰： 太上大道君，受我保身形。 吉庆降天符，太一合元真。 治病法 发至七日了可治。 发时，两手中指搯掌中心，看患人，持咒七遍。 令嗽一声，取气一口在壁，三度咒之。 令患人忌五辛、毒物各七日。 咒曰： 安蚕神符贴蚕室内 镇宅神符 移肿毒",
      "translated_text": "**Method for Directing Qi**\n\nAt a place of utmost sincerity, face the sun and burn incense. Look up and pray:\n\n*\"[State your rank and name], reverently addressing the Great Sun Emperor: I, [your name], practice the Orthodox Methods of the Highest Clarity’s Celestial Pivot Court to relieve the suffering of all people and direct qi to pacify spirits. Today, I humbly beseech your compassion, that you bestow true qi into my body. May my Mud-Pill Palace, all joints, the five viscera, and six bowels be filled and brimming with its vastness. In treating all living beings, may there be no failure.\"*\n\nConclude with focused devotion. Strike the Heavenly Drum seven times, open your eyes toward the sun, and press the third joint of each middle finger with your thumbs. Draw in a breath of qi from the sun and swallow it. Recite the incantation seven times, then swallow a second breath. Press your right hand again, recite the incantation seven times, and take in a third breath. Cross both hands before your mouth, recite the incantation seven times, then draw in true qi and blow it onto the two mudras. Repeat this cycle three times in full.\n\nThe incantation reads:\n*\"Wind-pain departs with the wind,\nqi-pain vanishes with the qi.\"*\n\nFor those afflicted, have them sit in the southeast, facing northwest. The practitioner stands in the northwest, facing southeast, seated opposite. Instruct the patient to press firmly on the painful area without releasing. First, have them cough once, then draw in a breath of qi—do not swallow it yet. Assume the mudra as before, recite the incantation seven times, then have them cough again, swallow the qi, and recite the incantation once more. For mild cases, three to five repetitions suffice; for severe cases, five to seven. Efficacy is certain.\n\n---\n\n**Method for Enchanting Water**\n\nPurify the mind and focus the intent. Press the center of each palm with the middle fingers and invoke the twenty-eight constellations of the five directions:\n\n*\"Reverently summon the true form of the star essence of Horn and Neck in the East, wielding swords and talismans to guard my body.\nReverently summon the true form of the star essence of Well and Ghost in the South, wielding swords and talismans to guard my body.\nReverently summon the true form of the star essence of Straddler and Harvester in the West, wielding swords and talismans to guard my body.\nReverently summon the true form of the star essence of Dipper and Ox in the North, wielding swords and talismans to guard my body.\nReverently summon the true form of the Yellow Essence of the Seven Stars of the Center, wielding swords and talismans to guard my body.\nMay the true qi of the five directions enter this water.\"*\n\nThis is no ordinary water—it is the natural water of the Highest Clarity’s Boundless Dao, capable of dispelling illness and rescuing from suffering. Wherever a drop of this water falls, all becomes pure. If a true spirit touches it, their divine power expands. If a demonic entity touches it, their body burns as if consumed by fire. This water is formed from the true qi bestowed by the Perfected of the Upper Heavens. What evil would not submit? What ghost would dare appear? Those who oppose me shall die; those who turn away shall perish. Where this divine water arrives, the myriad ghosts hide in submission.\n\nThe incantation reads:\n*\"Kui-Yuan, Qian-Yuan, Li-Zhen, You-Zhen.\nSupreme Void, I invoke your decree,\nGate of Kunlun’s Heavenly Portal.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\"*\n\nRecite it twenty-one times. Sprinkle this water to cleanse all defilements; swallow talismans with it, and none will fail to respond. During epidemics, sprinkle it inside and outside dwellings. For the sick, boil it into decoctions or powders—its efficacy is undeniable, and there is no purpose for which it cannot be used.\n\n---\n\n**Method for Extracting Consumptive Worms**\n\nFor those suffering from corpse-transmitted illness within one hundred and twenty days, first earnestly invite a Zhengyi Daoist to perform a three-day jiao ritual. Prepare three talismans and administer them to the patient as follows.\n\nOn the fourth day, prepare a cauldron with at least five *jin* of heated oil and a bolt of white silk to bind the patient to a pillar. Use three left-spun silk threads, each four *chi* and four *cun* long. Affix one talisman to each thread on a peachwood stick, and have the patient swallow them with ginseng decoction. One thread is held steady as the talisman draws the thread into the abdomen. Use a ruler to pry open the patient’s mouth, swiftly pull out the talisman, and the worm will be upon it. Repeat this three times to extract three worms, which will shriek as they fall into the oil and fry. Only then is the patient safe. If only one or two worms are extracted, death is certain.\n\n**First Talisman**\nUse a half-*cun* square of silk, inscribed in cinnabar. Form the mudra with the left hand on the *wu* position, recite the incantation, and seal it in a wax pill. Administer at the *chou* hour of the first day with frankincense decoction. Recite the incantation three times to complete the inscription.\n\nThe incantation reads:\n*\"Divine spirits of the Three Lights of Heaven,\ngrant me the mandate of life.\nBy this decree, I sever you—\nthe calamity arrives, the method is executed.\"*\n\n**Second Talisman**\nUse a half-*cun* square of silk, inscribed in cinnabar. Form the mudra with the left hand on the *shen* position, recite the incantation, and seal it in a wax pill. Administer at the *wu* hour of the second day with frankincense decoction. Recite the incantation three times to complete the inscription.\n\nThe incantation reads:\n*\"Originally, you harmed me—\nnow I expel and unite with you.\nLike all flying heavens,\nyou wander as corpse-drinking ghosts.\"*\n\n**Third Talisman**\nUse a half-*cun* square of silk, inscribed in cinnabar. Form the mudra with the left hand on the *hai* position, recite the incantation, and seal it in a wax pill. Administer at the *hai* hour of the third day with frankincense decoction. Recite the incantation three times to complete the inscription.\n\nThe incantation reads:\n*\"Great Lord of the Supreme Dao,\nreceive my protection of this form.\nAuspicious blessings descend with the Heavenly Talisman,\nthe Great One unites with the Primordial Perfected.\"*\n\n---\n\n**Method for Treating Illness**\n\nThe illness may be treated after seven days of onset. When it flares, press the center of each palm with the middle fingers while observing the patient. Recite the incantation seven times, have the patient cough once, and draw in a breath of qi toward the wall, reciting the incantation three times over it. Instruct the patient to avoid the five pungent foods and toxic substances for seven days.\n\nThe incantation reads:\n*(Untranslated fragments follow as given in the original:)*\n*\"Talisman for Pacifying Silkworm Spirits (to be affixed inside the silkworm chamber)\nTalisman for Securing the Household\nTalisman for Dispersing Swelling and Toxins\"*",
      "overlap_context": " qi receives thunder and fire,\nthe Old Duke subdues the fire’s glow.\nSwiftly, swiftly, as decreed by the Highest Clarity’s statutes and commands.\n\nRecite the incantation twenty-one times, spray water once upon the talisman, and release the mudra.\n\nHere ends the first scroll of *The Orthodox Methods of the Highest Clarity’s Celestial Pivot Court’s Returning Chariot Dao*.\nHere begins the second scroll of *The Orthodox Methods of the Highest Clarity’s Celestial Pivot Court’s Returning Chariot Dao*.",
      "start_char": 6010,
      "end_char": 7259,
      "start_sentence": 376,
      "end_sentence": 455,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.34156322479248,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清天枢院回车毕道正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "肿毒虽七八分者，亦可治。 诀在左手午上，按定痛处，咒曰： 汝是毒，何损人肉，吾今送汝上刀冈。 急急如律令勑。 咒七遍移诀，令嗽一声。 取气一亡吹在地上，乃以脚灭之。 治瘟说 治瘟自有法中常仪。 初入门，仍先用两手中指搯掌心咒曰：闭天目，一切鬼神不见。 此是为患人布气之法。 到患人林前曰：行疫年王、行病使者：此子行不善道，天令汝等巡历。 此子今改过，归奉大道。 吾已奏闻上帝，牒城隍讫。 如不系天符勾取，可急收药毒、气毒前去，不得少停，恐天赦将至，如违，的不容情，急急奉行。 治鬼邪法 患人身，须得实年月日时。 右手仗剑，先搯诀，搯年上，咒四十九遍，嘤水一口於患人身上。 若轻便住； 如未住，则箔生月上，咒四十九遍，噀水一口於患人身。 或尚未全退，则生日生时，并同前法为之，周而复始，待报应乃已。 咒曰： 天劫上赦，急令绝恶，急煞急缚。 右恐不得月日时，只如子生，便用子上。 此乃天中四刺缚邪法也。 更以乳香汤下北斗七元符三台符也。 治心邪血邪草灵丹方 神桃七个，乳香半两，辰砂半两，酸枣仁半两，当归半两，地黄半两，雄黄半两。 右七味为末，以蜡为九，如梧桐子大。 每服二十一九，并符七道。 临时看甚符，亦作丸。 子、丈夫，灯心汤下； 妇人，红花汤下。 治颠邪行持及断鬼神秘法 下元生人，行诸不善。 发骄慢心，恣纵淫杀。 常生轻谤，行不孝道。 悭贪不足，而生妄心。 既有妄心，即惊其神。 烦恼妄想，忧苦身心。 是以邪魅乘虚而来，以投其隙。 精邪下鬼，百怪千妖。 侵克形魂，叫笑不常。 喜怒不定，精神恍惚。 或歌或舞，或悲或啼。 饮食太过，不识尊卑、千条万纪。 或因冢墓不安，祭杞不谨。 居处凶地，伐树成灾。 不可不知也。 试论其状，即辩其源矣。",
      "translated_text": "For swellings and toxins that have reached seventy or eighty percent severity, treatment is still possible. The method: place the finger-tally on the *wu* position of the left hand, press firmly on the painful area, and recite the incantation:\n\n*\"You are toxin—how dare you harm human flesh?\nI now dispatch you to the Blade Ridge.\"*\n\n*\"Swiftly, swiftly, as decreed by statute and command!\"*\n\nRecite the incantation seven times, then shift the finger-tally and have the patient cough once. Draw in a breath of *qi* and blow it onto the ground, then extinguish it with the foot.\n\n**Method for Treating Pestilence**\nThe treatment of pestilence follows established ritual protocols. Upon entering the door, first press the center of each palm with the middle fingers and recite:\n\n*\"Seal the Heavenly Eye—let no ghost or spirit see.\"*\n\nThis is the method for deploying *qi* for the patient. Before the patient’s dwelling, declare:\n\n*\"Plague Year King, Disease Enforcer:\nThis child has strayed from the Dao/Way.\nHeaven has sent you to patrol.\nNow this child repents and returns to the Great Dao/Way.\nI have memorialized the Celestial Emperor and filed a petition with the City God.\nIf this is not by Heaven’s talismanic summons, then swiftly withdraw your medicinal toxins and *qi* toxins.\nDo not linger, for Heaven’s pardon is imminent.\nDisobedience will not be tolerated.\nSwiftly comply!\"*\n\n**Method for Treating Ghostly Afflictions**\nFor the patient’s body, the exact year, month, day, and hour of birth must be obtained. Hold a sword in the right hand, first form the finger-tally, then press the tally on the year position and recite the incantation forty-nine times. Spray a mouthful of water onto the patient’s body.\n\nIf the condition lightens, cease treatment. If not, shift the tally to the position of the birth month and recite the incantation forty-nine times, spraying water onto the patient’s body. If the affliction has not fully receded, proceed to the birth day and birth hour, repeating the method in sequence until a response is achieved.\n\nThe incantation reads:\n*\"By Heaven’s amnesty, swiftly sever evil!\nSwiftly slay, swiftly bind!\"*\n\nIf the birth month, day, or hour is unknown, use the *zi* position for those born in the *zi* hour. This is the \"Four Heavenly Stabs\" method for binding evil. Additionally, administer the Northern Dipper’s Seven Origins Talisman and the Three Terraces Talisman with frankincense decoction.\n\n**Herbal Spirit Elixir Formula for Heart and Blood Afflictions**\nIngredients:\nSeven divine peaches, half a *liang* of frankincense, half a *liang* of cinnabar, half a *liang* of sour jujube kernels, half a *liang* of tangkuei, half a *liang* of rehmannia, half a *liang* of realgar.\n\nGrind the seven ingredients into powder, form into pills with wax the size of *wutong* seeds. Take twenty-one pills per dose, along with seven talismans. Select the appropriate talisman at the time and incorporate it into the pill. For children and men, administer with rush pith decoction; for women, with safflower decoction.\n\n**Secret Method for Managing Madness and Severing Ghostly Influences**\nThose born in the Lower Era who commit myriad transgressions—arrogance, indulgence in lust and killing, habitual slander, filial impiety, miserliness, and insatiable greed—generate deluded thoughts. Such thoughts disturb the spirit, giving rise to vexation, false imaginings, and bodily suffering. Thus, malevolent entities seize the opportunity to invade, exploiting the vulnerabilities. Essence-corrupting demons, lower ghosts, and a thousand specters assail the form and soul, causing erratic laughter, unsteady moods, disorientation, or singing and dancing, weeping and wailing. Excessive eating, loss of propriety, and disregard for social norms may ensue. These afflictions may also arise from restless graves, careless ancestral rites, inauspicious dwellings, or the calamity of felling sacred trees. One must not remain ignorant of these causes.\n\nBy examining the symptoms, the source may be discerned.",
      "overlap_context": "nt. Recite the incantation seven times, have the patient cough once, and draw in a breath of qi toward the wall, reciting the incantation three times over it. Instruct the patient to avoid the five pungent foods and toxic substances for seven days.\n\nThe incantation reads:\n*(Untranslated fragments follow as given in the original:)*\n*\"Talisman for Pacifying Silkworm Spirits (to be affixed inside the silkworm chamber)\nTalisman for Securing the Household\nTalisman for Dispersing Swelling and Toxins\"*",
      "start_char": 7259,
      "end_char": 7973,
      "start_sentence": 456,
      "end_sentence": 504,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.54256296157837,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清天枢院回车毕道正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "心病属火，乃面赤，叫笑声高，多嗔少喜。 肝病属木，乃面青，饮酒太过，悲忧不止。 肺病属金，乃面白，持刃行凶，常言斗杀。 脾病属土，色黄，饮食太过，而常称不绝。 肾病属水，忧悲不常，多拆衣服，低头咬齿状，若怕羞是也。 此乃五脏受邪之证，先须行持，以符服之。 然后随其本脏，用药攻之，无不效矣。 识鬼邪 睁目咬牙凶横，自刑之鬼也。 歌舞叫笑，山魈之鬼也。 呼神唤鬼，咬器物者，客亡之鬼也。 或嗔或喜，社庙之鬼也。 咬牙叫唤，声如忍痛，落水之鬼也。 恐惧生人，精物之鬼也。 怕日羞明，血死产难之鬼也。 多好游走，树木之鬼也。 自刑觅死，冤债之鬼也。 多好眠睡，狱死之鬼也。 至於持诵看经，而轻慢经典； 叹气呻吟，心气有忧，多言虚诈，失志歌舞，嗔喜不定，亦邪鬼之候矣。 凡验鬼祟，即依此式，无有不实。 若欲知其有病无病，即验其眼目； 上视或青或白，鲜浄者，无患如常者，并虚诈也。 凡欲治颠邪，即先令投状。 次关住处灵祇，牒本属城隍，差借吏兵去防护。 然后入斗存身，行持具威仪，前去看验。 依科行法，不得任性。 见患人须和柔训化，勿伤神气，乃使不生狂恶，故全其理也。 入斗存身行持秘法 凡治颠邪凶恶之鬼，切须斋心沐浴，先行持而往。 至彼，亦不可散心，恐顽愚下鬼无所知识，敢有不从，致失威仪，黩上帝之命。 虽久而终就擒捉，亦性行持。 若是每行持，面东焚香，正身端立，用两手大指各搯上清诀，从脑后转至眉心； 分直从胸前下，叉腰，默咒曰： 吾身中功曹使者，当召出吾身中十二时辰、阳平二十四气、七十二候、左三魂、右七魄、一万二千精光神、二万二千形影神、三万三千毛窍神、心神、脾神、肺神、肝神、肾神，各具威仪，与吾吉庆，赐吾大道，令吾身形化为上清玄都三十六洞大伏魔法师，顶远游冠，身披绛绡服，执圭朱履，身坐玉局。 汝等灵神卫吾左右，上使红光盖吾，下使祥云围达，前至某处某人家，考察邪鬼，治病除祆，使令邪魔万鼠自诛，凶恶不见，疾病削除。 南灵覆护，变形玉虚。 急急如上清律令勑。 咒毕，面东噀水一口，乘於身上。 再焚香，面南叩齿，具位姓名，首： 南极天府星君。 南极天相星君。 南极天梁星君。 南极天同星君。 南极天枢星君。 南极天机星君。 南极万寿星君。 南极三明夫人。 南极火铃将军。 臣某今日吉庆长斋，修行无量，度 人济世，除祆破邪立正。 伏望南府星君。 特赐神光，卫护身形。 使者三千人，火铃将军，下护臣身，令得长生。 急急如上清律令。 咒毕叩齿，依仪式步罡，一步念一星君丁罡： 天府星君。 天相星君。",
      "translated_text": "Heart afflictions pertain to fire—manifesting as flushed complexion, loud laughter and shouts, frequent anger, and rare joy. Liver afflictions pertain to wood—manifesting as a greenish hue, excessive drinking, and unceasing sorrow. Lung afflictions pertain to metal—manifesting as a pale complexion, brandishing blades to commit violence, and constant talk of fighting and killing. Spleen afflictions pertain to earth—manifesting as a yellowish hue, excessive eating, and incessant boasting. Kidney afflictions pertain to water—manifesting as erratic sorrow, frequent tearing of clothes, hanging head and gnashing teeth, or a shamefaced demeanor. These are the signs of the five viscera assailed by malevolent forces. First, one must perform rituals and administer talismanic remedies. Then, according to the affected viscus, apply medicinal treatment—none shall fail to take effect.\n\n**Identifying Ghostly Malevolence:**\nGlaring eyes and gnashing teeth with ferocity—these are ghosts of self-inflicted harm.\nSinging, dancing, shouting, and laughing—these are mountain specter ghosts.\nCalling upon spirits and ghosts, biting objects—these are wandering deceased ghosts.\nMoods shifting between anger and joy—these are shrine and temple ghosts.\nGnashing teeth and wailing, voices as if enduring pain—these are drowned ghosts.\nFearful of living people—these are essence-devouring ghosts.\nAverse to daylight and ashamed of brightness—these are ghosts of blood-death or difficult childbirth.\nProne to roaming—these are tree spirits.\nSeeking death through self-harm—these are ghosts of grievance and debt.\nInclined to excessive sleep—these are ghosts of prison death.\n\nAs for those who recite or read scriptures yet treat them with disdain;\nSighing and groaning, troubled in heart and qi, speaking deceitfully;\nLosing resolve and singing or dancing, moods shifting between anger and joy—\nthese too are signs of ghostly malevolence.\n\nTo examine ghostly afflictions, follow this method—none shall prove false. To discern whether one is ill or not, observe the eyes: if they gaze upward, turning green or white, and appear unusually clear, there is no affliction; if they seem normal, it is all deception.\n\n**Treating Madness and Malevolence:**\nFirst, have the afflicted submit a written statement. Next, secure the local deities’ protection, file a petition with the city god of the jurisdiction, and dispatch divine officers and soldiers for defense. Then, enter the Dipper to embody the self, perform the ritual with full dignity, and proceed to examine the afflicted. Follow the prescribed methods strictly, without indulging personal inclinations. When addressing the afflicted, instruct them gently and soothingly, lest their spirit be harmed—this prevents violent outbursts and preserves their inherent nature.\n\n**Secret Ritual for Entering the Dipper and Embodying the Self:**\nWhen treating ghosts of madness and ferocity, one must purify the heart and bathe in ritual purity before proceeding. Upon arrival, remain focused, lest crude and ignorant ghosts, lacking understanding, dare to disobey, leading to a loss of dignity and profaning the mandate of the Supreme Emperor. Though it may take time, they will ultimately be captured—such is the nature of ritual practice.\n\nFor each ritual performance, face east and burn incense. Stand upright and centered, using the thumbs to form the Shangqing mudra, tracing from the back of the head to the brow; then separate the hands and lower them straight before the chest, clasping the waist. Silently recite the incantation:\n\n*\"Within my body, the Attendant Functionaries, I summon forth the twelve hours of my body, the twenty-four yang breaths, the seventy-two seasonal nodes, the three hun souls on the left, the seven po souls on the right, the twelve thousand spirits of radiant essence, the twenty-two thousand spirits of form and shadow, the thirty-three thousand spirits of the pores, the spirit of the heart, the spirit of the spleen, the spirit of the lungs, the spirit of the liver, the spirit of the kidneys—all arrayed in dignity. Grant me auspicious fortune, bestow upon me the Great Dao, and transform my body into that of the Great Exorcist of the Thirty-Six Caverns of the Mystic Capital of Shangqing, crowned with the Far-Wandering Cap, robed in crimson silk, holding the jade tablet, shod in vermilion. Seated upon the Jade Bureau, may you, divine spirits, guard my left and right. Above, let the red light shield me; below, let auspicious clouds encircle me. Proceed to the home of so-and-so in such-and-such place to investigate malevolent ghosts, cure illness, and eradicate evil, compelling all wicked demons to self-destruct and all ferocity to vanish, cutting away sickness. May the Southern Numinosity protect me, and my form be transformed into the Jade Void.\"*\n\n*\"Swiftly, swiftly, in accordance with the statutes and decrees of Shangqing!\"*\n\nAfter the incantation, face east and spray a mouthful of water over the body. Burn incense again, face south, and click the teeth. State your rank and name, then invoke:\n\n*\"Star Lord of the Southern Pole Heavenly Mansion,\nStar Lord of the Southern Pole Heavenly Appearance,\nStar Lord of the Southern Pole Heavenly Beam,\nStar Lord of the Southern Pole Heavenly Union,\nStar Lord of the Southern Pole Heavenly Pivot,\nStar Lord of the Southern Pole Heavenly Mechanism,\nStar Lord of the Southern Pole Myriad Longevities,\nLady of the Three Luminaries of the Southern Pole,\nFire-Bell General of the Southern Pole—*\n\n*Your servant, so-and-so, today observes auspicious fortune and maintains perpetual purification, cultivating boundless practice to deliver beings and save the world, dispelling evil and vanquishing malevolence to establish rectitude. Humbly beseech the Star Lords of the Southern Mansion to bestow divine radiance and guard my form. May three thousand attendants and the Fire-Bell General descend to protect my body, granting me longevity.\"*\n\n*\"Swiftly, swiftly, in accordance with the statutes and decrees of Shangqing!\"*\n\nAfter the incantation, click the teeth and proceed with the ritual steps, reciting the name of one Star Lord with each step of the Dipper:\n*\"Star Lord of the Heavenly Mansion,\nStar Lord of the Heavenly Appearance...\"*",
      "overlap_context": "mons, lower ghosts, and a thousand specters assail the form and soul, causing erratic laughter, unsteady moods, disorientation, or singing and dancing, weeping and wailing. Excessive eating, loss of propriety, and disregard for social norms may ensue. These afflictions may also arise from restless graves, careless ancestral rites, inauspicious dwellings, or the calamity of felling sacred trees. One must not remain ignorant of these causes.\n\nBy examining the symptoms, the source may be discerned.",
      "start_char": 7974,
      "end_char": 9056,
      "start_sentence": 505,
      "end_sentence": 562,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.29846119880676,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清天枢院回车毕道正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "天机星君。 天同星君。 天枢星君。 天梁星君。 步毕，执剑咒日： 某日功曹使者，吾遣汝上天，速至天门。 遣汝入地，速至地户。 遣汝入水，速至水府。 吾今不遣汝上天，不遣汝入地，不遣汝入水，遣汝速至某处某家，告示某人住处司命土地、干系等神，祇，并本属城隍，差来兵将，仰防御本所，前来看验某人疾患。 须管精严，无令秽触，有失威仪。 次念天灵地灵，天地交并。 功曹神将，不得留停。 速去速来，吾在坛前卓剑相待。 急急如上清律令。 咒毕，便将剑卓在地，二手十指相叉，喝一声：去。 凡入患人家，才入门，见人便收却头巾，直上厅上正坐。 才坐时，便用二手中指搯掌心为诀，布气一口於四方，便咒曰： 吾是元皇之孙，太上之子。 北斗与我为所使，周行禹步，天吏所使。 左侍青龙，右侍白虎。 三清上帝，密布真炁。 敢有祆气恶逆之鬼，当不伏者，金罗铁网，酆都处死。 急急如律令勑。 咒七遍了，便於周回收气一口，吹在二手内。 便重搯诀，令痛。 咒曰： 天为我父，地为我母，日月为我兄弟，七星为我朋友。 六甲将军，手执钺斧。 地甲将军，严持锺鼓。 三台前行，禽宿后使。 吾与天为臣，受天所使。 斩邪吞魔，缚祆摄鬼。 指呼为命，调理刚气。 上天符命，土地皆至，急急奉行。 东方",
      "translated_text": "Star Lord of the Heavenly Mechanism,\nStar Lord of the Heavenly Union,\nStar Lord of the Heavenly Pivot,\nStar Lord of the Heavenly Beam.\n\nUpon completing the steps, grasp the sword and recite the incantation:\n*\"Day-Functionary Messenger of [this] day, I dispatch you to ascend to Heaven—swiftly reach the Heavenly Gate.\nI dispatch you to enter the Earth—swiftly reach the Earthly Portal.\nI dispatch you to enter the Waters—swiftly reach the Watery Mansion.\nNow, I do not dispatch you to ascend to Heaven, nor to enter the Earth, nor to enter the Waters.\nI dispatch you swiftly to [such-and-such] place, to the household of [so-and-so],\nto notify the Controller of Destiny, the Local Earth God, the relevant deities, the *qi* spirits,\nalong with the city god of this jurisdiction and the soldiers and generals sent forth,\nto command them to defend this site and come forth to examine the illness of [so-and-so].\nYou must be meticulous and strict, allowing no defilement to touch, lest dignity be lost.\"*\n\nNext recite:\n*\"Heavenly numen, Earthly numen—Heaven and Earth unite in convergence.\nFunctionary spirits and generals, you may not tarry.\nGo swiftly, return swiftly—I await you before the altar, sword planted in readiness.\nSwiftly, swiftly, in accordance with the statutes and decrees of Shangqing!\"*\n\nUpon finishing the incantation, plant the sword into the ground, interlock the fingers of both hands, and shout: *\"Go!\"*\n\nWhen entering the afflicted person’s home, upon crossing the threshold, remove your headscarf at once upon seeing anyone, proceed directly to the main hall, and sit upright. As you take your seat, press the middle fingers of both hands into your palms to form the mudra, exhale a breath of *qi* to the four directions, and recite:\n*\"I am the grandson of the Primordial August One, the child of the Most High.\nThe Northern Dipper is at my command; I tread the Yu Steps, sent forth by the Heavenly Officers.\nTo my left attends the Azure Dragon, to my right the White Tiger.\nThe Three Clarities’ Lords secretly deploy true *qi*.\nShould any demonic *qi* or perverse ghosts refuse to submit,\nthe Golden Net and Iron Web shall consign them to Fengdu for execution.\nSwiftly, swiftly, as decreed by the statutes!\"*\n\nRecite this seven times, then draw in a breath from all around and exhale it into your cupped hands. Press the mudra again until it pains, and recite:\n*\"Heaven is my father, Earth my mother,\nthe Sun and Moon my brothers, the Seven Stars my friends.\nThe Generals of the Six Jia wield axes,\nthe Earthly Jia Generals sternly bear gongs and drums.\nThe Three Terraces lead the way; the Avian Constellations follow as messengers.\nI am Heaven’s servant, sent forth by Heaven’s command.\nI sever evil, devour demons, bind malevolence, and capture ghosts.\nMy pointing and calling are as decrees; I regulate the *qi* of the firm.\nBy the talismanic command of Highest Heaven, all earth gods must hasten to comply.\nSwiftly, swiftly, carry this out!\"*\n\n*[East]*",
      "overlap_context": "beseech the Star Lords of the Southern Mansion to bestow divine radiance and guard my form. May three thousand attendants and the Fire-Bell General descend to protect my body, granting me longevity.\"*\n\n*\"Swiftly, swiftly, in accordance with the statutes and decrees of Shangqing!\"*\n\nAfter the incantation, click the teeth and proceed with the ritual steps, reciting the name of one Star Lord with each step of the Dipper:\n*\"Star Lord of the Heavenly Mansion,\nStar Lord of the Heavenly Appearance...\"*",
      "start_char": 9056,
      "end_char": 9569,
      "start_sentence": 563,
      "end_sentence": 597,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.98284888267517,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清天枢院回车毕道正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "东方青帝青童君，执锺击鼓，速缚兴祆之鬼，入金罗之狱，受罪无情，急成公案。 并令如前，受天符命。 目视东方，喝云：去。 南方 南方赤帝赤童君，手执雷电，速缚兴祆之鬼，入无了之狱，重罪无情，急成公案。 并令如前，受天符命。 目视南方，喝云：去。 西方 西方白帝白童君，手执钺斧，速缚兴祆之鬼，入陷海之狱，受罪无情，急成公案。 并令如前，受天符命。 目视西方，喝云：去。 北方 北方黑帝黑童君，手执帝锺，速缚兴祆之鬼，入无牵之狱，受罪无情，急成公案。 并令如前，受天符命。 目视北方，喝云：去。",
      "translated_text": "East:\nThe Azure Emperor and Azure Youth Lord of the East, wielding gongs and striking drums, swiftly bind the demons that stir malevolence, casting them into the Golden Net Prison. Let them suffer punishment without mercy, and swiftly bring the case to judgment. As before, they receive the talismanic command of Heaven. Gaze toward the East and shout: *\"Begone!\"*\n\nSouth:\nThe Vermilion Emperor and Vermilion Youth Lord of the South, wielding thunder and lightning, swiftly bind the demons that stir malevolence, casting them into the Endless Prison. Let them suffer grievous punishment without mercy, and swiftly bring the case to judgment. As before, they receive the talismanic command of Heaven. Gaze toward the South and shout: *\"Begone!\"*\n\nWest:\nThe White Emperor and White Youth Lord of the West, wielding battle-axes, swiftly bind the demons that stir malevolence, casting them into the Drowning Sea Prison. Let them suffer punishment without mercy, and swiftly bring the case to judgment. As before, they receive the talismanic command of Heaven. Gaze toward the West and shout: *\"Begone!\"*\n\nNorth:\nThe Black Emperor and Black Youth Lord of the North, wielding the Emperor’s Gong, swiftly bind the demons that stir malevolence, casting them into the Inescapable Prison. Let them suffer punishment without mercy, and swiftly bring the case to judgment. As before, they receive the talismanic command of Heaven. Gaze toward the North and shout: *\"Begone!\"*",
      "overlap_context": ".\nThe Generals of the Six Jia wield axes,\nthe Earthly Jia Generals sternly bear gongs and drums.\nThe Three Terraces lead the way; the Avian Constellations follow as messengers.\nI am Heaven’s servant, sent forth by Heaven’s command.\nI sever evil, devour demons, bind malevolence, and capture ghosts.\nMy pointing and calling are as decrees; I regulate the *qi* of the firm.\nBy the talismanic command of Highest Heaven, all earth gods must hasten to comply.\nSwiftly, swiftly, carry this out!\"*\n\n*[East]*",
      "start_char": 9569,
      "end_char": 9819,
      "start_sentence": 598,
      "end_sentence": 612,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.171023607254028,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清天枢院回车毕道正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "中央 中央黄帝黄童君，手执金槌，速缚兴祆之鬼，入长停之狱，受罪无情，急成公案。 并令如前，受天符命。 目视天，喝云：去。 其颠邪人必自叫唤，便云：左右统兵助法神将，为吾擒出。 便令其家人引患人至厅下，其患人即伏。 便咒曰患人才出，用玉清诀： 天灵地灵，天地交并。 受差将吏，无辄容情。 擒捉鬼贼，速至阶前。 急急如律令。 咒七遍，患人至阶下，便云：直日狱卒，为吾擒捉鬼贼。 便咒曰： 上天勑令，速缚魔精。 随行狱卒，无辄容情。 急依天命，勘伏招情。 当吾步下，元亨利贞。 急急如律令。 咒三遍，息人自坐。 才坐便问，令说因依。 如不伏，便喝云：为枷。 却便咒七遍。 上清诀。 咒曰： 上天奉命，玉帝魁荣。 枷下邪鬼，有逆上清。 九天玄籍，无辄容情。 急急如律令。 患人自如檐物矣。 再问不伏，两手并作玉皇诀，喝云：为吾棚。 却用紫微印咒七遍。 咒曰： 天灵天荣，吾奉上清勑。 绷却鬼贼，抵拒有刑。 魁罡置斗，无辄容情。 急急如律令。 患人只自立如绷，再问令说。 不伏便云：为吾打脚，两脚一同。 便咒曰：勘鬼诀。 上天勑命，枷禁邪精。 行刑狱卒，不得容情。 并天符命，依勑奉行。 急急如律令。",
      "translated_text": "Center:\nThe Yellow Emperor and Yellow Youth Lord of the Center, wielding a golden mallet, swiftly bind the demons that stir malevolence, casting them into the Everlasting Prison. Let them suffer punishment without mercy, and swiftly bring the case to judgment. As before, they receive the talismanic command of Heaven. Gaze toward the heavens and shout: *\"Begone!\"*\n\nWhen the afflicted person cries out in distress, command: *\"Left and Right Marshal Generals, divine warriors aiding the Dao, seize and bring them forth!\"* Then instruct the household to lead the afflicted to the hall below, where they will prostrate themselves.\n\nRecite the incantation as the afflicted emerges, using the Jade Purity Mudra:\n*\"Heavenly spirit, earthly spirit,\nHeaven and Earth conjoin in power.\nOfficers dispatched by decree,\nShow no leniency, spare no mercy.\nSeize the demonic thieves,\nSwiftly bring them before the steps.\nHasten! As the statutes command.\"*\n\nRecite the incantation seven times. When the afflicted reaches the steps, command: *\"Gaolers of the Day’s Prison, seize the demonic thieves for me!\"*\n\nRecite the incantation:\n*\"By decree of the Supreme Heaven,\nSwiftly bind the demonic essence.\nGaolers on duty, show no leniency,\nHasten to obey Heaven’s command,\nExamine and subdue their defiance.\nBeneath my steps—\nPrimordial, flourishing, harmonious, steadfast.\nHasten! As the statutes command.\"*\n\nRecite the incantation three times. The afflicted will then sit of their own accord. Once seated, question them and bid them confess the cause. If they refuse to comply, shout: *\"Place them in the cangue!\"* Then recite the incantation seven times.\n\nUse the Supreme Purity Mudra.\nRecite the incantation:\n*\"By Heaven’s mandate,\nThe Radiant Emperor of Jade holds sway.\nDemons in the cangue,\nDefiant against the Supreme Purity,\nBound by the Mystic Registers of the Nine Heavens,\nShow no leniency, spare no mercy.\nHasten! As the statutes command.\"*\n\nThe afflicted will then behave as though bound by the cangue. If they still refuse to confess, form the Jade Emperor Mudra with both hands and shout: *\"Bind them for me!\"* Then use the Purple Tenuity Seal and recite the incantation seven times.\n\nRecite the incantation:\n*\"Heavenly spirit, heavenly glory,\nI act by decree of the Supreme Purity.\nBind the demonic thieves,\nResistance brings punishment.\nThe Dipper’s might and the Demon-Quelling Star,\nShow no leniency, spare no mercy.\nHasten! As the statutes command.\"*\n\nThe afflicted will stand as though tightly bound. Question them again and bid them confess. If they still refuse, command: *\"Beat their feet—both at once!\"*\n\nRecite the incantation:\n*\"Interrogation Mudra of Demons.\nBy decree of the Supreme Heaven,\nThe cangue restrains demonic essence.\nGaolers executing punishment,\nShow no leniency, spare no mercy.\nBy Heaven’s talismanic command,\nAct in accordance with the decree.\nHasten! As the statutes command.\"*",
      "overlap_context": "wiftly bring the case to judgment. As before, they receive the talismanic command of Heaven. Gaze toward the West and shout: *\"Begone!\"*\n\nNorth:\nThe Black Emperor and Black Youth Lord of the North, wielding the Emperor’s Gong, swiftly bind the demons that stir malevolence, casting them into the Inescapable Prison. Let them suffer punishment without mercy, and swiftly bring the case to judgment. As before, they receive the talismanic command of Heaven. Gaze toward the North and shout: *\"Begone!\"*",
      "start_char": 9820,
      "end_char": 10311,
      "start_sentence": 613,
      "end_sentence": 655,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.078519582748413,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清天枢院回车毕道正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "患人只自叫，问因依不伏，便使黄蜂之咒三遍：勘鬼诀。 太魔太灵，魁光七星。 九气真元，永了上咛。 奉命如命，火急奉行。 急急如律令。 患人如又不伏，便云：为吾缚上铜柱，铜汁铁丸灌之。 咒七遍：勘鬼诀。 太微太微，赤炼铜汁。 九天永辜，受罪无劫。 再生再死，上帝勑摄。 并令狱卒，食鬼饮血。 急急如律令。 患人叫苦，便问因依。 斩鬼法 用灭妖鬼诀，两手并作。 如斩鬼便将律验法云：汝今得此罪，罪当斩。 便云：当院刽子，为吾斩鬼。 咒曰： 天帝严勑，受命刽官。 领天符命，无辄容情。 神锋两刃，诚恶去除。 领赴坛下，一剑去诛。 急急如律令。 咒七遍了，便云：推出凌迟。 鬼咒曰：七遍。 天帝勑行，天甲天丁。 鬼犯重罪，粉骨碎形。 奉天勑命，法到奉行。 急急如律令。 断鬼咒用勘鬼诀 天帝勑行，立法无情。 三天符下，受罪当刑。 奉天勑命，法到奉行。 急急如律令。 配鬼咒用配鬼诀 鬼犯恶罪，心受无情。 当行律令，配赴海营。 上天勑命，依法奉行。 辄有不伏，粉骨碎形。 急急如律令。 七遍。",
      "translated_text": "If the afflicted cries out but still refuses to confess when questioned, recite the Yellow Wasp Incantation three times: *Interrogation Mudra of Demons.*\n\n*\"Great Demon, Great Spirit,\nRadiance of the Seven Stars of the Dipper.\nTrue Primal Qi of the Nine Heavens,\nEternally bound by the Supreme Decree.\nBy command as command,\nAct with utmost urgency.\nHasten! As the statutes command.\"*\n\nIf the afflicted still refuses to confess, command: *\"Bind them to the bronze pillar and pour molten bronze and iron pellets upon them!\"*\n\nRecite the incantation seven times: *Interrogation Mudra of Demons.*\n*\"Great Tenuity, Great Tenuity,\nMolten bronze searing red.\nEternally condemned by the Nine Heavens,\nEnduring punishment without reprieve.\nDie again and again,\nBy decree of the Supreme Emperor.\nSummon the gaolers,\nTo feast on ghosts and drink their blood.\nHasten! As the statutes command.\"*\n\nWhen the afflicted cries out in suffering, question them again for their confession.\n\n**Method for Beheading the Ghost**\nUse the *Mudra for Annihilating Demonic Ghosts*, forming it with both hands. To execute the ghost, declare in accordance with the statutory verification: *\"You have incurred this guilt, and your guilt warrants beheading.\"*\n\nThen command: *\"Executioner of this court, behead the ghost for me!\"*\n\nRecite the incantation:\n*\"By stern decree of the Heavenly Emperor,\nThe executioner receives his charge.\nBearing the Heavenly Talisman’s command,\nShow no leniency, spare no mercy.\nThe divine blade’s twin edges,\nSever evil and cast it away.\nEscort them beneath the altar’s steps,\nAnd with a single stroke, execute them.\nHasten! As the statutes command.\"*\n\nAfter reciting the incantation seven times, command: *\"Drag them forth for dismemberment!\"*\n\nRecite the *Ghost Incantation* seven times:\n*\"By decree of the Heavenly Emperor,\nThe Heavenly Armored Ones, the Heavenly Soldiers.\nThe ghost has committed grievous crimes,\nGround to dust, its form shattered.\nBy the Heavenly Decree’s command,\nEnforce the law as ordered.\nHasten! As the statutes command.\"*\n\n**Incantation for Severing the Ghost** – Use the *Interrogation Mudra of Demons.*\n*\"By decree of the Heavenly Emperor,\nThe law is established without mercy.\nUnder the Three Heavenly Talismans,\nThe guilty shall receive their punishment.\nBy the Heavenly Decree’s command,\nEnforce the law as ordered.\nHasten! As the statutes command.\"*\n\n**Incantation for Exiling the Ghost** – Use the *Mudra for Exiling Ghosts.*\n*\"The ghost has committed vile crimes,\nIts heart devoid of mercy.\nBy the statutes’ command,\nExile it to the Sea Garrison.\nBy decree of the Supreme Heaven,\nEnforce the law as ordered.\nShould it resist,\nGrind its bones to dust, shatter its form.\nHasten! As the statutes command.\"*",
      "overlap_context": "re no mercy.\nHasten! As the statutes command.\"*\n\nThe afflicted will stand as though tightly bound. Question them again and bid them confess. If they still refuse, command: *\"Beat their feet—both at once!\"*\n\nRecite the incantation:\n*\"Interrogation Mudra of Demons.\nBy decree of the Supreme Heaven,\nThe cangue restrains demonic essence.\nGaolers executing punishment,\nShow no leniency, spare no mercy.\nBy Heaven’s talismanic command,\nAct in accordance with the decree.\nHasten! As the statutes command.\"*",
      "start_char": 10312,
      "end_char": 10756,
      "start_sentence": 656,
      "end_sentence": 696,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.356334209442139,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清天枢院回车毕道正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "自擒坐鬼贼咒至此，咒每念了，即噀水一口云：灭也。 遥治颠邪心法 凡是室女、妇人不欲见者，咒水了，令取一盏，洗手面了，与患人洗手面。 自洗手时，用两手搯玉皇诀，咒七遍，七吹入水内也。 咒曰： 神天龙手，千魔自去。 设位大罗，啸咏洞歌。 急急如上清律令。 咒毕，剔诀於水中。 诀目 太清诀二指上勘鬼诀二指中。 玉清诀中指上玉皇诀中指中。 卓剑诀中指下上清诀四指中。 紫微诀四指中配鬼诀小指中。 灭鬼诀小指下。 欲往治邪，先烧关引及帖榜，与本家土地司命门前，五道干系等神祇候，仍牒城隍借兵，收擒看守。 用了，即再用牒交还。 收管讫，通明报应。 布气咒 乾元天灵，甲乙丙丁。 戊己太一，壬癸守形。 朱雀覆护，寿命长生。 身中功曹，三五将军。 左右神人，今日吉庆。 得道至妙，使我通灵。 荡除秽气，凶恶不宁。 神清气爽，得道修贞。 急急如上清律令。 上清天枢院回车毕道正法卷中竟 上清天枢院回车毕道正法卷下 勘灶经验状式 若有人投状，先焚香，用二手指各搯亥上为诀，叉定二腰，叩齿三通，望地吹气一口，再叩齿三通，望中取气一口吞之，便咒曰：天灵地灵，天地差兵。 吾奉玉皇，纠察邪精。 王民投状，事有恳情。 当院功曹，辄敢久停。 速追司命，勾祸鬼名。 速去速来，吾在坛前卓剑相待。 急急如律令。 喝一声：去。",
      "translated_text": "From the *Incantation for Capturing the Seated Ghost-Thief* to this point, after each recitation, spray a mouthful of water and declare: *\"Extinguished!\"*\n\n**Method for Distant Treatment of Madness and Malevolence**\nFor any maiden or woman one does not wish to see, after consecrating the water, have them take a bowl to wash their hands and face, then let the afflicted wash theirs. While washing the hands, form the *Jade Emperor Mudra* with both hands, recite the incantation seven times, and blow seven times into the water.\n\n**Incantation:**\n*\"Divine hands of the Heavenly Dragon,\nA thousand demons flee of their own accord.\nEstablished in the Great Luo,\nChanting the cavern’s hymns in song.\"*\n*Swiftly, swiftly, as the Upper Clarity statutes command.*\n\nUpon completion, flick the mudra into the water.\n\n**Mudra Guide:**\n*Upper Clarity Mudra* – two fingers raised; *Interrogation Mudra of Ghosts* – two fingers centered.\n*Jade Clarity Mudra* – middle finger raised; *Jade Emperor Mudra* – middle finger centered.\n*Thrusting Sword Mudra* – middle finger lowered; *Upper Clarity Mudra* – four fingers centered.\n*Purple Tenuity Mudra* – four fingers centered; *Exiling Ghost Mudra* – little finger centered.\n*Extinguishing Ghost Mudra* – little finger lowered.\n\nBefore proceeding to treat malevolence, first burn the *Pass Permit* and post the *Notice Placard* before the local Earth God, the Controller of Fate, and the Five Roads’ relevant deities. Simultaneously, file a petition to the City God to borrow troops for apprehension and custody. Once used, file another petition to return them. After securing the entity, report the outcome clearly.\n\n**Incantation for Dispersing Qi:**\n*\"Primordial Heaven’s numen,\nJia Yi Bing Ding.\nWu Ji and the Great Unity,\nRen Gui guard the form.\nVermilion Bird’s shelter,\nLongevity and immortal life.\nBody’s Attendants,\nGenerals of Three and Five.\nDivine persons left and right,\nAuspicious fortune this day.\nAttaining the Dao’s subtlety,\nGrant me communion with the spirits.\nSweep away foul qi,\nBanish malevolence and unrest.\nSpirit clear, qi refreshed,\nAttain the Dao and cultivate integrity.\"*\n*Swiftly, swiftly, as the Upper Clarity statutes command.*\n\nHere ends the *Middle Scroll of the Upper Clarity Heavenly Pivot Institute’s Returning Chariot and Completing the Dao Orthodox Methods*.\nHere begins the *Lower Scroll of the Upper Clarity Heavenly Pivot Institute’s Returning Chariot and Completing the Dao Orthodox Methods*.\n\n**Verification Form for Stove Inspection**\nIf someone submits a petition, first burn incense, form the mudra by raising both index fingers to the *Hai* position, clasp the waist, knock the teeth three times, blow a breath toward the ground, knock the teeth three times again, draw a breath from the center and swallow it, then recite:\n\n**Incantation:**\n*\"Heaven’s numen, Earth’s numen,\nHeaven and Earth dispatch their troops.\nI act by the Jade Emperor’s decree,\nTo investigate and restrain malevolent spirits.\nWang Min submits a petition,\nWith earnest matters to bring.\nAttendants of this institute,\nDare not delay.\nSwiftly summon the Controller of Fate,\nTo summon the names of calamity’s ghosts.\nGo swiftly, return swiftly,\nI stand before the altar, sword drawn, awaiting.\"*\n*Swiftly, swiftly, as the statutes command.*\n\nShout: *\"Go!\"*",
      "overlap_context": "ans,\nThe guilty shall receive their punishment.\nBy the Heavenly Decree’s command,\nEnforce the law as ordered.\nHasten! As the statutes command.\"*\n\n**Incantation for Exiling the Ghost** – Use the *Mudra for Exiling Ghosts.*\n*\"The ghost has committed vile crimes,\nIts heart devoid of mercy.\nBy the statutes’ command,\nExile it to the Sea Garrison.\nBy decree of the Supreme Heaven,\nEnforce the law as ordered.\nShould it resist,\nGrind its bones to dust, shatter its form.\nHasten! As the statutes command.\"*",
      "start_char": 10757,
      "end_char": 11318,
      "start_sentence": 697,
      "end_sentence": 735,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.610212087631226,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清天枢院回车毕道正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "咒了，便将投状看於甚字上，便认有无鬼祟为祸。 度事理，依天律勑条施行。 如些小事，只送所属，或付本家承事之神。 凡若应差鬼神兵将，即写某庙差来兵将。 於后押字上，使都天法主印印之，令用香酒茶果供养。 候病安，用香纸送於本庙烧化。 投状用金钱六贴、马十二疋、香烛等。 本院神将如见凶者，切莫与给，虽安乐，寿不永也。 切须子细，慎勿容易损人功行。 此乃龙汉元年，上清真境太上道君，召天官追摄人间灶君司命勘鞫令，通说灾祸邪鬼之由，判属天枢院救治施行也。 投状式 具州县乡里保社坊巷居住，弟子姓某。 右某，伏为某人，见年若干岁，月日时生。 自从某年月已来，某疾不安，累经医治，并未痊安。 切虑有祸祟事入于此，多被阻隔，致令药饵无灵。 今则无可投告，谨具状，申 上清天枢院，伏乞 指挥，依法救治施行。 谨状。 年　月　日　同前，姓某状。",
      "translated_text": "After reciting the incantation, examine the petition to identify the character upon which the issue hinges, thereby discerning whether malevolent spirits or misfortune are at fault. Assess the circumstances and proceed in accordance with the celestial statutes and decrees. For minor matters, dispatch them to the appropriate authority or entrust them to the household’s attending deities. Whenever summoning ghostly soldiers or divine generals, specify which temple’s forces are being deployed. Affix the seal of the Lord of Universal Dharma upon the signature space, and provide offerings of incense, wine, tea, and fruit. Once the affliction is resolved, burn incense and paper offerings at the temple of origin. The petition requires six sheets of spirit money, twelve paper horses, and incense with candles.\n\nIf the divine generals of this institute observe inauspicious signs, do not grant the petition—even if the supplicant appears at ease, their longevity will not endure. Exercise utmost care; never lightly diminish another’s merit and practice. This originates from the First Dragon Han Era, when the Supreme Dao Lord of the Upper Clarity Realm summoned the celestial officials to pursue and interrogate the Stove Lord and Controller of Fate regarding the causes of human calamities and malevolent spirits, delegating their adjudication and remedy to the Celestial Pivot Institute.\n\n**Petition Format:**\n[Petitioner’s] residence: [State], [County], [Township], [Village], [Neighborhood], [Lane].\nDisciple [Family Name, Given Name] respectfully submits:\n\nRegarding [Name of Afflicted], currently aged [Number] years, born on the [Day] of the [Month] at the [Hour].\nSince [Year, Month], [Name] has suffered from [Illness], enduring repeated medical treatments without recovery. Fearing that misfortune or malevolent spirits have intruded, causing obstructions that render remedies ineffective, I now have no recourse but to humbly submit this petition to the Upper Clarity Celestial Pivot Institute, beseeching your command to administer lawful relief.\n\nRespectfully submitted.\n[Year] [Month] [Day]\n[Petitioner’s Family Name, Given Name] petitions.",
      "overlap_context": "**Incantation:**\n*\"Heaven’s numen, Earth’s numen,\nHeaven and Earth dispatch their troops.\nI act by the Jade Emperor’s decree,\nTo investigate and restrain malevolent spirits.\nWang Min submits a petition,\nWith earnest matters to bring.\nAttendants of this institute,\nDare not delay.\nSwiftly summon the Controller of Fate,\nTo summon the names of calamity’s ghosts.\nGo swiftly, return swiftly,\nI stand before the altar, sword drawn, awaiting.\"*\n*Swiftly, swiftly, as the statutes command.*\n\nShout: *\"Go!\"*",
      "start_char": 11318,
      "end_char": 11680,
      "start_sentence": 736,
      "end_sentence": 755,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.259909391403198,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清天枢院回车毕道正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "验状法 州字与军字同 如无州字，则天枢院二字同用。 点污是三代，家先有愿，门前五道不安。 东南方古墓神，家收圆明之物。 及三七日内，曾将血物归，倡鬼为灾。 犯重 是中房内户下，有女伏尸骨，深七尺。 及七年内，至亲血死伤亡，宅土不安，及此房飞尸女殃鬼。 挑起 南方树木五通之鬼，因陪於食物而来，兼西方飞土神。 注失 五通香火山魈，三代家先客亡，自刑女鬼，河道殁亡，城隍社伯之神。 县字 点污是宅神不安，城隍有愿，星辰临命此方。 山神阴土不安，外人惊动之也。 犯重 是南方游土，十年内作犯太岁。 家先有愿，及绯紫之神为祸，因在外饮食而病。 挑起 门前客死，男伤亡，及阴阳构不明，灶君不安。 观寺净愿动，及客中落胎鬼。 注失 绯紫之神，传尸劳鬼，父母咒咀，北方亲友之鬼。 门神宅土不安，灶神有愿。 乡字 点污五庙有愿，东北方亲知。 药毒之鬼，血蛊，血尸，飞劳之鬼。 犯重 门下东方，十步伏尸石精，及家神有宗祖传病之鬼。 挑起 至亲人咒咀於南方庙堂，命犯星杀，作犯宅土。 注失 伏尸古冢之鬼，古画功德，异物为精，家收劳死症疗之鬼衣物等。 保字 点污旧庙之神，功德愿动，及血尸女鬼，二七日东方食物，承鬼伤入宅。 犯重 灶第三口下，有男枯骨，及自刑女鬼。 北方河道伤亡，古墓之神。 注失 西方旧庙神，作犯宅土井灶，惊动门前自刑鬼，女伤亡。 里字 点污河道男伤亡之鬼，北方树木五通之神，北方铜象之精，灶神有愿。 犯重 游神五通，西方浮土，丧车之神，鬼家物，铜铁之物，命犯必死。 不在治。 挑起 是山魈木客之鬼，宅有愿，土府不安，客死女伤亡之鬼。 南方疗痉疾之鬼，外入僧寺，咒咀星辰临命，五道不安，父母之鬼。 投状 如姓与名忘记不书者，西方古墓，五通客亡鬼，并犯土药毒鬼。 点污父母之鬼，家行暗昧，不存父母，上天所赐之祸。 犯重 宗祖有愿，星杀为灾。 叔伯父祖之鬼，堂下伏尸，古物石精。 挑起 宗祖咒咀庙神，口有谀谩谤易之过。 主必死，不治。 注失",
      "translated_text": "**Verification Petition Method**\n\nThe character *zhou* (州) shares the same form as *jun* (军). If *zhou* is absent, the two characters *Tianshu Yuan* (天枢院) may be used interchangeably.\n\n**Stains (点污):**\nThree generations of ancestral spirits, unfulfilled vows to household deities, disturbances along the five pathways before the gate.\nThe spirit of an ancient tomb in the southeast, household possession of round and luminous objects.\nWithin twenty-one days, the return of blood-tainted items, or the affliction of singing ghosts.\n\n**Grievous Offenses (犯重):**\nBeneath the threshold of the central chamber lies the buried remains of a woman, seven feet deep.\nWithin seven years, the violent death of a close blood relative, unsettled earth of the dwelling, or the haunting of this chamber by flying corpses or female calamity ghosts.\n\n**Provocation (挑起):**\nThe five-tongued ghosts of southern trees, drawn by offerings of food, along with the flying earth spirits of the west.\n\n**Neglect (注失):**\nFive-tongued spirits of incense and mountain specters, three generations of ancestral spirits, wandering dead, self-inflicted female ghosts, those perished in riverways, and the deities of city gods and earth altars.\n\n**County (县):**\n**Stains:**\nDisturbances among household deities, unfulfilled vows to the city god, stars and constellations aligned over this direction.\nUnsettled mountain spirits and yin earth, disturbed by outsiders.\n\n**Grievous Offenses:**\nWandering earth spirits of the south, offenses against the Grand Year within a decade.\nUnfulfilled vows to ancestral spirits, and the affliction of crimson-purple deities, illness arising from external consumption.\n\n**Provocation:**\nDeaths before the gate, male violent deaths, unresolved yin-yang conflicts, unsettled stove deities.\nDisturbances in monastic vows, or wandering ghosts of miscarried fetuses.\n\n**Neglect:**\nCrimson-purple deities, consumptive ghosts of transmitted corpses, parental curses, ghosts of northern kin.\nUnsettled door and household deities, unfulfilled vows to the stove god.\n\n**Township (乡):**\n**Stains:**\nUnfulfilled vows to the five temples, kin from the northeast.\nGhosts of poisoned medicine, blood curses, blood corpses, and flying consumptive ghosts.\n\n**Grievous Offenses:**\nWithin ten paces east of the gate, buried remains of stone spirits, and ancestral spirits transmitting hereditary afflictions.\n\n**Provocation:**\nCurses from close kin in southern temples, fate entangled with baleful stars, offenses against the dwelling’s earth.\n\n**Neglect:**\nGhosts of ancient tombs and buried remains, old painted merit offerings, anomalous objects as spirits, household possession of clothing or items from those who died of consumptive illnesses.\n\n**Neighborhood (保):**\n**Stains:**\nSpirits of old temples, disturbed merit vows, female blood corpses, consumption of eastern food within fourteen days, bearing ghost-inflicted wounds into the dwelling.\n\n**Grievous Offenses:**\nBeneath the third mouth of the stove, the withered bones of a man, and self-inflicted female ghosts.\nNorthern riverway deaths, spirits of ancient tombs.\n\n**Neglect:**\nWestern spirits of old temples, offenses against the dwelling’s earth, wells, and stoves, disturbances by self-inflicted ghosts before the gate, female violent deaths.\n\n**Village (里):**\n**Stains:**\nGhosts of male riverway deaths in the north, five-tongued spirits of northern trees, spirits of northern bronze statues, unfulfilled vows to the stove god.\n\n**Grievous Offenses:**\nWandering spirits and five-tongued deities, floating earth of the west, spirits of funeral carts, ghostly household items, bronze and iron objects—fate doomed to death.\n**Beyond remedy.**\n\n**Provocation:**\nMountain specters and wood-dwelling ghosts, unfulfilled vows to the dwelling, unsettled earth deities, ghosts of female violent deaths.\nSouthern ghosts of convulsive illnesses, entry into monastic temples, curses from stars aligned over fate, disturbances along the five pathways, parental ghosts.\n\n**Petition Submission:**\nIf the surname or given name is forgotten and left unrecorded, the affliction stems from western ancient tombs, five-tongued wandering ghosts, or offenses by earth-bound poison ghosts.\n\n**Stains:**\nParental ghosts, household conduct in darkness, neglect of parents—heaven-sent calamities.\n\n**Grievous Offenses:**\nUnfulfilled vows to ancestral spirits, baleful stars as afflictions.\nGhosts of paternal uncles and grandfathers, buried remains beneath the hall, ancient objects and stone spirits.\n\n**Provocation:**\nAncestral curses upon temple deities, transgressions of flattery, deceit, slander, or false accusations.\n**Fate doomed to death, beyond remedy.**\n\n**Neglect.**",
      "overlap_context": "h] at the [Hour].\nSince [Year, Month], [Name] has suffered from [Illness], enduring repeated medical treatments without recovery. Fearing that misfortune or malevolent spirits have intruded, causing obstructions that render remedies ineffective, I now have no recourse but to humbly submit this petition to the Upper Clarity Celestial Pivot Institute, beseeching your command to administer lawful relief.\n\nRespectfully submitted.\n[Year] [Month] [Day]\n[Petitioner’s Family Name, Given Name] petitions.",
      "start_char": 11681,
      "end_char": 12580,
      "start_sentence": 756,
      "end_sentence": 814,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.40214705467224,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清天枢院回车毕道正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "土黄，土箭，土瘟，山魈，社伯，河道女亡，东北方蛊气之鬼。 名 妇人氏弟同。 点污父母兄弟，传尸之鬼，山魈为祸，客堂伏尸。 家不积善，有过父母，至亲咒咀，北方树木神，古铜铁之精，必死不治。 犯重 外祖之鬼，观寺亲友咒咀，死气入宅，北方债主之鬼，客亡，家收兵器，山魈、甍瓦之祟，鼓响之声，鱼龞之精，南方自伤之鬼，井泉女鬼。 患人名字 妇女氏弟同。 点污南方，饮食受患，西北方旧庙，神堂后，西方伏尸，女□之鬼。 犯重 先祖有愿，朋友鬼客死伤亡，星辰正照，宿世冤家债主取命。 死不在治，必死三人。 注失 星辰有临有愿，命犯短命。 北方丧车鬼，五道勾起西南蛊鬼。 死不治也。 患年月日时 点污星宿照命，宅有伏尸，山精古怪，丘陵古墓，井泉之鬼。 犯重 山神为祟，坑秽之神，厨下冤死鬼，药毒伤亡，灶土不安。 挑起 五通伏尸鬼，西南方传尸，亲友、僧尼咒诅，家收铜铁之物成精。 注失 东一房下有古兵器，水精之怪，竹木青黄之兆为笑，及自刑鬼女人。 神字 神字在上者，一行中，在上第一字是。 客亡女□鬼自伤，山魈、古庙神，五道有愿，土府不安。 在下 一行中，在下第一字是。 暗死女鬼，神寺咒咀之鬼，西方祖墓神，二年内打煞物命。 点污 五通宗祖承事之鬼，他人祖父母之鬼，在宅执占地业为灾。 犯重 夜魇之鬼，东方饮食受患，家收古器之物为妖，产死之鬼。 挑起 传尸之鬼，衣物飞虫入宅，南方花果之神。 死不在治。 注失",
      "translated_text": "**Earth Afflictions:**\nEarth-yellow, earth-arrows, earth-pestilence, mountain imps, earth-altar elders, river-way female ghosts, northeast direction’s gu-qi ghosts. **Name:** Women with the same clan name. **Stains:** Parental and sibling ghosts, corpse-transmitted ghosts, mountain imps as calamities, guest-hall concealed corpses. **Household failing to accumulate goodness, offenses against parents, curses from closest kin, northern tree spirits, ancient bronze and iron essences—fated to die, beyond remedy.** **Grievous Offenses:** Maternal ancestral ghosts, curses from temple-visiting kin and friends, dead qi entering the dwelling, northern debt-collecting ghosts, wandering ghosts, household-stored weapons, mountain imps, tile-and-brick hauntings, drum-like sounds, fish-and-turtle spirits, southern self-injury ghosts, well-and-spring female ghosts.\n\n**Afflicted Person’s Name:** Women with the same clan name. **Stains:** Southern direction, afflictions through food and drink, northwest’s old temples, behind the spirit hall, western concealed corpses, female [missing character] ghosts. **Grievous Offenses:** Ancestral unfulfilled vows, ghosts of deceased friends and wandering dead, stars directly aligned, past-life creditors claiming lives. **Death beyond remedy, three deaths inevitable.** **Neglect:** Stars aligned with unfulfilled vows, fate doomed to short life. **Northern funeral-cart ghosts, five pathways summoning southwestern gu ghosts—death beyond remedy.**\n\n**Afflicted Year, Month, Day, and Hour:** **Stains:** Stars and constellations aligned over fate, dwelling with concealed corpses, mountain spirits and ancient anomalies, hill-and-grave ghosts, well-and-spring ghosts. **Grievous Offenses:** Mountain spirits as hauntings, pit-and-filth deities, kitchen ghosts of unnatural deaths, poison-induced fatalities, stove-earth disturbances. **Provocation:** Five-tongued concealed-corpse ghosts, southwestern corpse-transmitted afflictions, curses from kin, monks, and nuns, household-stored bronze and iron objects turning into spirits. **Neglect:** Eastern chamber concealing ancient weapons, water spirits, bamboo and wood omens of green and yellow laughter, and self-punishing female ghosts.\n\n**Divine Character:**\nIf the divine character is at the top, it is the first character in the first line. **Wandering female [missing character] ghosts of self-injury, mountain imps, ancient temple spirits, five pathways with unfulfilled vows, earth-mansion disturbances.**\n\nIf at the bottom, it is the first character in the last line. **Unnaturally deceased female ghosts, temple-cursing ghosts, western ancestral-tomb spirits, objects of lethal harm within two years.** **Stains:** Five-tongued ancestral ghosts of service, others’ paternal and maternal ancestral ghosts seizing household land as calamities. **Grievous Offenses:** Nightmare ghosts, eastern afflictions through food and drink, household-stored ancient objects turning into demons, childbirth-death ghosts. **Provocation:** Corpse-transmitted ghosts, clothing and flying insects entering the dwelling, southern flower-and-fruit spirits. **Death beyond remedy.** **Neglect.**",
      "overlap_context": "oison ghosts.\n\n**Stains:**\nParental ghosts, household conduct in darkness, neglect of parents—heaven-sent calamities.\n\n**Grievous Offenses:**\nUnfulfilled vows to ancestral spirits, baleful stars as afflictions.\nGhosts of paternal uncles and grandfathers, buried remains beneath the hall, ancient objects and stone spirits.\n\n**Provocation:**\nAncestral curses upon temple deities, transgressions of flattery, deceit, slander, or false accusations.\n**Fate doomed to death, beyond remedy.**\n\n**Neglect.**",
      "start_char": 12580,
      "end_char": 13235,
      "start_sentence": 815,
      "end_sentence": 853,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.660448789596558,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清天枢院回车毕道正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "水陆神愿动，父母咒咀山精、青黄之精也。 丘陵古墓坟之神。 鬼字 在上，东南庙神，正厅中，下有男伏尸。 三七日内，主见怪物为灾。 在下 百里庙神，咒咀有愿，西北方河道伤亡宗祖之鬼。 点污 星辰有愿，兄弟之鬼，南方尸鬼、木神，客死伤亡，自刑枉死之祟。 犯重 五通香火之神，西南方作犯土府，太岁为灾，惊动司命。 挑起 是魇死鬼，兵死，囚禁伤亡，家收古物，下逆於上。 注失 西方亲人送物，有女殃，蛊毒鬼，水怪，河潭龙蜃之妖。 祸字 在上，南方自伤女鬼，花木之精，井灶不明，家先有愿。 在下 兄弟、祖父母鬼，自生咒咀，用心之过，天神收摄。 必死不治。 点污 南北方咒咀，神祇之愿，亲人发动、邪道为灾，及暗死女鬼。 犯重 祖先亲人传尸鬼，宿世冤家债主负命，执占之鬼，五通倡亡伤神。 挑起 因将血物，引东方倡鬼入宅为祸，司命家先不安。 注失 犯山神阴土不安，恶星临命，五通古庙有愿。 祟字 在上，有他人香火混杂房中，内有自刑女鬼，井泉之神。 在下 有外人承事香火，古墓伏尸，传劳之鬼，先亡有愿，宅土不安。 点污 叔伯、外祖神，山鬼，树木精，门前五道。 犯重 客死女鬼，篱下西四尺，有暗昧之精，刀剑之鬼。 死不治。 挑起",
      "translated_text": "Waters and lands stir with divine vows—ghosts of parents’ curses, mountain spirits, and the essences of blue and yellow. Spirits of ancient graves on hills and mounds. **The character \"ghost\" appears above:** southeastern temple deities, those in the central hall, with male corpse-spirits lying beneath. Within twenty-one days, strange apparitions will bring disaster.\n\n**Below:** temple deities within a hundred *li*, curses bound by vows, northwestern riverine ghosts of drowned ancestral kin. **Stains:** stars bearing vows, ghosts of brothers, southern corpse-spirits and tree deities, those who died as strangers or by self-inflicted harm, and the hauntings of wrongful death. **Grievous Offenses:** deities of the Five Paths worshipped with incense, southwestern transgressions against earthly authorities, the Year-Star bringing calamity, startling the Controller of Fate. **Provocation:** nightmare ghosts of the strangled, those slain in war, deaths in prison, households storing ancient objects, subordinates rebelling against superiors. **Neglect:** western kin sending gifts, women bearing misfortune, poison-curse ghosts, water demons, riverine dragons and miasmic serpents.\n\n**The character \"misfortune\" appears above:** southern female ghosts of self-injury, spirits of flowers and trees, wells and hearths obscured, ancestral vows lingering. **Below:** ghosts of brothers and grandparents, self-inflicted curses, faults of intent, celestial deities seizing control. **Death beyond remedy.** **Stains:** northern and southern curses, vows to deities, kin stirring trouble, heterodox paths bringing disaster, and unnaturally deceased female ghosts. **Grievous Offenses:** ancestral kin as corpse-transmitted ghosts, creditors from past lives claiming lives owed, possessive ghosts, spirits of the Five Paths leading the departed to harm deities. **Provocation:** bringing blood offerings to lure eastern singing ghosts into the dwelling as calamity, unsettling the Controller of Fate and household ancestors. **Neglect:** offending mountain deities and yin earth, malevolent stars descending upon fate, vows to ancient temples of the Five Paths.\n\n**The character \"haunting\" appears above:** others’ incense mingling in the chamber, female ghosts of self-injury within, deities of wells and springs. **Below:** outsiders tending incense, ancient graves with corpse-spirits, consumptive ghosts, the departed bearing vows, the dwelling’s earth unsettled. **Stains:** uncles, maternal ancestors, mountain ghosts, tree spirits, the Five Paths before the gate. **Grievous Offenses:** female ghosts of stranger-death, obscure spirits four feet west of the fence, ghosts of blades and swords. **Death beyond remedy.** **Provocation:**",
      "overlap_context": "thal harm within two years.** **Stains:** Five-tongued ancestral ghosts of service, others’ paternal and maternal ancestral ghosts seizing household land as calamities. **Grievous Offenses:** Nightmare ghosts, eastern afflictions through food and drink, household-stored ancient objects turning into demons, childbirth-death ghosts. **Provocation:** Corpse-transmitted ghosts, clothing and flying insects entering the dwelling, southern flower-and-fruit spirits. **Death beyond remedy.** **Neglect.**",
      "start_char": 13235,
      "end_char": 13802,
      "start_sentence": 854,
      "end_sentence": 891,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.91735553741455,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清天枢院回车毕道正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "西方花果游戏之神，宅土不安，众神有愿，百日内曾见怪物。 注失 是作犯宅土，伤死之鬼，浄神有愿，触犯大神。 邪字 在上，五方古墓神，先亡为祸，岳神有愿，司命不安。 在下 有愿，三界争神不安，心口无凭，乃天为患。 死不治。 点污 天神有愿，北方咒咀，山魑及父母为灾。 犯重 兵死鬼，南方路死、伤亡、恶死女鬼，及束方游戏五通鬼。 挑起 门神，五通，树木排紫神，城隍有愿为祸。 注失 狱死鬼，女尸血亡，山精猛烈之神，五神不安。 妖字 在上者，传尸病，祖父鬼，宅见恶怪，星辰有愿，林下伏尸女鬼。 在下 河道伤亡，出猖鬼，北方毒蛊女尸之鬼，药物之精。 点污 堂前伏尸，父母亲墓宅不利，古物书画之怪。 死不可治。 犯重 因买患人衣物得病，女殃暴败死之鬼。 西南蛊毒精。 挑起",
      "translated_text": "The deities of floral and fruited play from the West unsettle the dwelling’s earth, with many spirits bearing vows and strange apparitions seen within a hundred days. **Neglect:** this constitutes an offense against the dwelling’s earth, with ghosts of violent death, the Pure Deities bearing vows, and provocation of the Great Spirits.\n\n**The character \"perversity\" appears above:** the deities of ancient tombs from the Five Directions, ancestral dead bringing misfortune, the Mountain Deities bearing vows, the Controller of Fate unsettled. **Below:** vows unfulfilled, the Three Realms’ spirits in contention, the heart and mouth unreliable—this is Heaven’s affliction. **Death beyond remedy.** **Stains:** Heavenly deities bearing vows, northern curses, mountain demons and parents bringing calamity. **Grievous Offenses:** ghosts of those slain in war, southern roadside deaths, violent and ill-fated female ghosts, and eastern wandering Five Paths ghosts of play. **Provocation:** the Gate Deities, the Five Paths, the arrayed spirits of trees, the City God bearing vows bringing misfortune. **Neglect:** ghosts of prison death, female corpses drained of blood, fierce mountain spirits, the Five Spirits unsettled.\n\n**The character \"sorcery\" appears above:** consumptive disease, ancestral ghosts, the dwelling beset by evil omens, stars bearing vows, female ghosts of corpse-spirits beneath the groves. **Below:** riverine deaths, rampant ghosts, northern female corpses of poison and curses, spirits of medicinal substances. **Stains:** corpse-spirits before the hall, parents’ graves and dwelling inauspicious, ancient objects and calligraphy as omens. **Death beyond remedy.** **Grievous Offenses:** illness contracted from purchasing a sufferer’s garments, female ghosts of sudden ruin and violent death. **Southwestern spirits of poison and curses.** **Provocation.**",
      "overlap_context": "mber, female ghosts of self-injury within, deities of wells and springs. **Below:** outsiders tending incense, ancient graves with corpse-spirits, consumptive ghosts, the departed bearing vows, the dwelling’s earth unsettled. **Stains:** uncles, maternal ancestors, mountain ghosts, tree spirits, the Five Paths before the gate. **Grievous Offenses:** female ghosts of stranger-death, obscure spirits four feet west of the fence, ghosts of blades and swords. **Death beyond remedy.** **Provocation:**",
      "start_char": 13802,
      "end_char": 14178,
      "start_sentence": 892,
      "end_sentence": 918,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.465465307235718,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清天枢院回车毕道正法.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "石精，铜铁兽象之怪，墓神，山神，河神，客猖鬼，古冢祟。 注失 岳神有愿，兄弟咒咀，邪道鬼吏，五猖山石之神。 怪字 在上者，三代家先客亡女鬼，土地不安，河道猖殇鬼，血蛊神。 在下 山魈、火殃死鬼，血死伤亡伏尸，绯紫之神，东北方饮食得患。 点污 幽暗鬼，西方水精，北方槐树、皂木之神。 死不治。 犯重 兵死阵亡鬼，五道相句，宅土有愿，北方咒咀，飞尸鬼。 挑起 厨厕自刑女鬼，东西方古庙神，沟井不明之鬼。 注失 二年内打死物命，七世冤债，星辰暗煞临命也。 魍字劳字同。 在上者，先世不孝父母之罪，东南毒山精之鬼，客死伤亡。 在下 五方蛊毒气，树木游神，山魈，石精，水魅，河道恶死之鬼。 点污 十年作犯太岁，阴宅不安，父母宗祖之鬼，门神不安。 犯重 血尸五通山魈为祸，狐狸之精，井灶不明。 挑起 魇死鬼，传尸劳鬼，南方饮食，北方祖母古墓之神。 注失 父母祖先祟，山魈古冢之神，新死之鬼，北方古墓土鬼。 魉字 在上，山魈、猴精之鬼，同司命，猖伤、客亡、自缢之鬼，传尸劳瘵。 在下 旧宅下承事之神，东西游戏花果之鬼，钉铁之精。 点污 一年内，买道僧衣物，浄神有愿，星辰照命，扫第之精。 犯重 横死鬼伏尸，祖先传病鬼，五道山神为祸。 挑起 外祖父母入宅，同先祖父母司命，为灾受患。 上清天枢院回车毕道正法卷下竟",
      "translated_text": "**Stone spirits**, specters of bronze, iron, and beastly forms, tomb deities, mountain gods, river gods, wandering rampant ghosts, hauntings of ancient barrows. **Neglect:** mountain gods bearing vows, brothers’ curses, demonic path spirits and ghostly officials, the Five Rampant gods of mountains and stones.\n\n**The character \"specter\" appears above:** female ghosts of three generations’ wandering dead, earth deities unsettled, riverine rampant ghosts of premature death, blood-curse spirits. **Below:** mountain imps, fire-calamity death ghosts, blood-death and violent-death corpse-spirits, crimson and violet deities, afflictions from food and drink in the northeast. **Stains:** ghosts of gloom, western water spirits, northern spirits of locust and soapberry trees. **Death beyond remedy.** **Grievous Offenses:** ghosts of those slain in battle, the Five Paths’ mutual entanglements, dwelling earth bearing vows, northern curses, flying corpse-ghosts. **Provocation:** female ghosts of self-harm in kitchens and latrines, eastern and western spirits of ancient temples, ghosts of murky ditches and wells. **Neglect:** killing living beings within two years, seven generations’ karmic debts, baleful stars darkly converging upon one’s fate.\n\n**The characters \"wraith\" and \"consumption\" are equivalent.** **Above:** sins of unfiliality toward parents in past lives, ghosts of southeastern poisonous mountain spirits, deaths from wandering or violence. **Below:** the five directions’ qi of curses and poisons, wandering tree spirits, mountain imps, stone spirits, water sprites, ghosts of violent death in riverways. **Stains:** offending the Grand Year for a decade, yin dwellings unsettled, ghosts of parents and ancestors, gate deities disturbed. **Grievous Offenses:** blood-corpses and the Five Penetrations’ mountain imps wreaking havoc, fox spirits, murky wells and hearths. **Provocation:** nightmare death ghosts, consumptive disease ghosts, southern food and drink, northern ancestral grandmothers’ spirits of ancient tombs. **Neglect:** hauntings by parents and ancestors, mountain imps and spirits of ancient barrows, newly deceased ghosts, northern earth spirits of ancient tombs.\n\n**The character \"demon\" appears above:** mountain imps, monkey spirits, those sharing fate with the Controller of Destiny, rampant harm, wandering death, self-hanged ghosts, consumptive disease. **Below:** deities served beneath old dwellings, eastern and western playful ghosts of flowers and fruit, spirits of nails and iron. **Stains:** within one year, purchasing Daoist or monastic garments, vows upon purity deities, stars illuminating one’s fate, spirits of sweeping the residence. **Grievous Offenses:** violent-death ghosts and corpse-spirits, ancestral ghosts transmitting disease, the Five Paths’ mountain gods wreaking havoc. **Provocation:** maternal grandparents entering the dwelling, sharing fate with ancestral grandparents’ Controller of Destiny, suffering calamity and affliction.\n\n*Here ends the Lower Scroll of the Orthodox Rites of the Heavenly Pivot Institute’s Turning the Wheel.*",
      "overlap_context": "se-spirits beneath the groves. **Below:** riverine deaths, rampant ghosts, northern female corpses of poison and curses, spirits of medicinal substances. **Stains:** corpse-spirits before the hall, parents’ graves and dwelling inauspicious, ancient objects and calligraphy as omens. **Death beyond remedy.** **Grievous Offenses:** illness contracted from purchasing a sufferer’s garments, female ghosts of sudden ruin and violent death. **Southwestern spirits of poison and curses.** **Provocation.**",
      "start_char": 14178,
      "end_char": 14802,
      "start_sentence": 919,
      "end_sentence": 957,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.83486294746399,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\方法类\\上清天枢院回车毕道正法.txt",
        "category": "方法类"
      }
    }
  ]
}