{
  "source_id": "上清太一帝君太丹隐书解胞十二结节图诀",
  "source_file": "chunked_daozang\\上清太一帝君太丹隐书解胞十二结节图诀.json",
  "total_chunks": 3,
  "total_original_chars": 3052,
  "total_translated_chars": 17320,
  "total_translation_time": 90.88186502456665,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\上清太一帝君太丹隐书解胞十二结节图诀.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "*The Upper Clarity Scripture of the Great Vermilion Hidden Book of the Supreme Unity Lord of the Grand Monad: Diagram and Oral Instructions for Untying the Twelve Knots of the Primordial Womb*\n\n**Scripture Title:** *The Upper Clarity Scripture of the Great Vermilion Hidden Book of the Supreme Unity Lord of the Grand Monad: Diagram and Oral Instructions for Untying the Twelve Knots of the Primordial Womb*\nAuthor unknown, approximately dating to the Northern and Southern Dynasties. Compiled as an excerpt from *The Great Vermilion Hidden Book*. One scroll. Base text from *The Orthodox Daoist Canon*, Section Zheng Yi.\n\n---\n\nThe life of a person transforms from the primordial womb and takes form through the essence of blood. Thus, after birth, the womb continues to knot, and after formation, the blood ceases to flow. That which does not flow—the Supreme Unity Lord blends and harmonizes it, causing it to remain. The womb possesses twelve knotted nodes, entwining and solidifying the Five Viscera. When the Five Viscera are obstructed, the knots cannot be untied, nor the nodes removed. Hence, human illness arises from the stagnation of nodes, and human death from the solidification of knots.\n\nOn one’s life-destiny day or the eight solar terms, one should invoke the Supreme Unity Lord to blend and harmonize, commanding the hundred spirits to untie the stubborn knots within the womb and the dead nodes of deep-rooted entanglement. The womb has twelve knots, and within it, twelve nodes. The nodes reside within the knots. Those who do not know how to untie the womb’s knots and nodes will not escape death. Those who constantly untie them attain longevity.\n\nThe knots of the upper womb:\n1. Within the Mud-Pill Palace,\n2. Within the mouth,\n3. Within the cheeks,\n4. Within the eyes—\nthese four knots of the womb reside in the upper region.\n\nThe knots of the middle womb:\n1. Within the Five Viscera,\n2. Within the Great Granary,\n3. Within the large intestine,\n4. Within the small intestine—\nthese four knots of the womb reside in the middle region.\n\nThe knots of the lower womb:\n1. Within the Bladder,\n2. Within the yin organ,\n3. Within the posterior gate,\n4. Within the two feet—\nthese four knots of the womb reside in the lower region.\n\nThe method for untying the knots: Enter a chamber, close the door, and engage in visualization. First recite the names of the hundred spirits below the Supreme Unity Lord, then proceed to untie the knots in sequence. This method is the Way of the Supreme Unity Lord blending with the twenty-four spirits to untie knots and expel corpse-qi.\n\nOn one’s life-destiny day or the eight solar terms, at noon or midnight, sit upright facing the direction of one’s life-destiny. Join the hands, compose the mind, and knock the teeth twenty-four times, saying:\n\n*\"Male disciple [Name], humbly invokes the Womb Father and Womb Mother. On the day of my birth, the three accumulations of stagnant blood transformed into twelve great knots. Today, on my life-destiny day, I reverently summon the gods of the Three Nines and the Twenty-Four Perfected Ones to untie the three barriers and twelve knots.\"*\n\nThe invocation of the summoned:\n*\"In the east, the Azure Emperor at the Carved Beam’s Edge, whose name is Qingping...\"*\n\nThe Five Emperors of the Five Directions, each corresponding to their directional color, may be adorned with suitable hues:\n\nThe Red Emperor of the South, Changlaijue, styled Nanhe.\nThe White Emperor of the West, Zhang’anxing, styled Xihua.\nThe Black Emperor of the North, Baochengchang, styled Beifa.\nThe Old Master of the Mysterious Unity, Lin Xufu, styled Ling Shidao, clad in green—hereafter, attire follows the annotations; otherwise, colors may be chosen as appropriate.\n\nThe Three Pristine Lords, Laozhangshang, styled Shengdao, clad in plain white.\nThe Left Immortal of the Orthodox Unity, Zhong Chengzi, also named Dibin, styled Sihua, clad in purple.\nThe Right Immortal of the Orthodox Unity, Qu Youzi, also named Guangxian, styled Linghe, clad in pale red.\nThe Lesser Lad of the Grand Tenuity, Gan Jingjing, styled Huiyuanzhi, also named Sanjinjiao or Duizizhen, clad in crimson.\n\nThe Upper Womb’s Inner Perfected Ones, numbering nine, merge with the nine qi to form the Nine Lords, who untie the knots at the Upper Barrier. When the four knots of the Upper Barrier dissolve, the flow of essences and blood is restored, the register of longevity is inscribed above, and one becomes an Imperial Immortal forever.\n\nThe Venerable Deity of the Supreme Unity, Wuyoushou, styled Guihuichang, also named Xianming or Jipin, clad in deep purple.\nThe Right Unsurpassed Duke, Xuanyuanshu, styled Hefuzi, also named Yuansu Jun or Shen Gongzi, clad in pale red.\nThe Right White Prime of Cavernous Yang, Yu Lingbiao, styled Xuanyi Jue, also named Zhu Jing or Qicheng, clad in crimson.\nThe Central Director of Destinies, the Venerable Lord Limingchu, styled Xuandu Qing, also named Shenzong or Linghua, clad in purple.\nThe Peach Lord of the Gate of Destiny, Haidaokang, styled Hejingyan, also named Mingwang or Baogen, clad in pale red.\nThe Celestial Emperor of the Mud-Pill Palace, Shangyi Chizi Xuanningtian, styled Sanyuanxian, also named Bowushang or Boshi Hua, clad in crimson.\nThe Minister of the Celestial Emperor of the Mud-Pill Palace, Zhaole Jing, styled Zhong Xuansheng, also named Qifei or Changfu, clad in purple.\nThe Cinnabar Sovereign of the Crimson Palace’s Central Elixir Field, Shen Yunzhu, styled Zinan Dan, also named Shengshang Bo or Shiyun Ju, clad in pale crimson.\nThe Assistant Sovereign of the Crimson Palace, Zhongguang Jian, styled Sihua Ling, also named Youche Bo or Dong Shi Hua, clad in crimson.\n\nThe Nine Perfected Ones of the Central Womb, forming the Nine Lords, revolve the nine qi of the spirit to transform and enter the Crimson Palace. The great knots of the five viscera, the large and small intestines, all dissolve; the four knots disperse and flourish. The Central Barrier is harmonized, its flow directed to the Great Granary. A thousand calamities and ten thousand misfortunes vanish in an instant. One’s name is inscribed in the register of life above, and one remains forever free from disaster.\n\nThe Lower One of the Gate of Destiny, Huangting Yuanshi Mingjing, styled Yuanyang Chang, also named Ying’er Tai or Boshi Yuan, clad in purple.\nThe Guardian and Protector of the Yellow Court, Guishang Ming, styled Guxia Xuan, also named Chengshen Bo or Chengguang Sheng, clad in red-yellow.\nThe First Lord of the White Qi within the Womb, Wuxuanzi, styled Yushang Sheng, clad in plain white.\nThe Second Lord of the Green Qi within the Knots, Anyanchang, styled Hehe Ying, clad in green.\nThe Third Lord of the Black Qi within the Nodes, Binlaisheng, styled Jingshang Men, clad in black.\nThe Fourth Lord of the Yellow Qi within the Womb, Zumingche, styled Shenwuji, clad in yellow.\nThe Fifth Lord of the Red Qi within the Blood, Hunlizi, styled Shubaojian, clad in crimson.\nThe Sixth Lord, the Upper Mysterious Primordial Father, Gaotongsheng, styled Zuo Huiming, clad in pale purple.\nThe Seventh Lord, the Lower Mysterious Primordial Mother, Shu Huowang, styled You Huiguang, clad in crimson.\n\nThe Nine Lords of the Lower Womb, the Inner Perfected Ones of the Embryo, generate and transform the nine qi, which are the nine souls. When the nine souls form knots of essence within the embryo, the nodes harden, causing one’s lifespan to be short and leading to an early demise. Today, on one’s life-destiny day, as at the time of one’s initial birth, one beseeches the dissolution of the twelve roots of death. One’s name is inscribed in the Jade Register above, the Five Talismans enter the body, and the nine qi are pacified below. One attains eternal continuity, the Nine Palaces open above, and the Nine Barriers open below.\n\nAfter reciting the ritual twice, conclude by harmonizing the mind and regulating the breath, ensuring the voice does not falter or stumble. Then, with eyes closed, visualize and invoke the Celestial Emperor of the Supreme Ultimate’s Purple Chamber, Feng Lingfan, styled Lü Changling, also named Qiling or Shen Zhangren.\n\nThus invoke thrice, then visualize the Nine True Lords who untie the knots: the Azure Emperor of the East at the Carved Beam’s Edge and the twenty-seven others, down to the Primordial Mother Shu Huowang, all clad in crimson robes and yellow headscarves. The yellow headscarves resemble the shape of a traveler’s cap. Their forms are like those of infants, varying in height. If the practitioner cannot memorize or visualize even a few of them, they may enter the chamber and proceed according to the text.\n\nThereafter, the colors of mountains, clouds, qi, and figures may be chosen as appropriate. Next, lead the Supreme Ultimate’s Purple Chamber to face north toward the Celestial Emperor, each kneeling in reverence, and say:\n\n“The Nine of the Upper Barrier, beginning with the Azure Emperor at the Carved Beam’s Edge; the Nine of the Central Barrier, beginning with the Supreme Unity’s Wuyoushou; and the Nine of the Lower Barrier, beginning with the Lower One of the Yellow Court, Huangting Mingjing—twenty-seven in total—today, by the qi of destiny, swallow inwardly. The Three Barriers open above; each barrier has twenty-four knots, and each knot has twenty-four sinews. The sinews are now severed, the knots dissolved. The essences and blood surge upward, filling the Mud-Pill Palace; the Jade Fluid flows downward, nourishing the hundred spirits. Today, [Name] is inscribed in the Celestial Register as a Longevous Divine Immortal.”\n\nUpon completion, visualize the Supreme Unity summoning the practitioner to ascend before the Celestial Emperor. The Celestial Emperor says: “The knots of the embryo are now unblocked; the light shines within and permeates without. You are granted longevity, and your destiny shall not falter. You may now merge with my form.”\n\nThe Celestial Emperor then opens his mouth, and the practitioner suddenly enters, arriving at the Celestial Emperor’s Palace of the Six Harmonies.\n\nWithin the Celestial Emperor’s Palace of the Six Harmonies, there resides the Supreme Divine One, named Chong Mingkong, styled You Liaowu. He addresses the practitioner, saying: “You may now consume the essence of the sun.” The practitioner then gathers the solar essence and ingests it, swallowing nine times before stopping.\n\nPresently, the twenty-seven Perfected Ones, previously seen, stand arrayed to the practitioner’s left and right. The twenty-seven Perfected Ones declare: “[Name]’s embryonic register is now dissolved; all impure qi is expelled. Your countenance shines with jade-like luster, your body permeates the Great Void. You shall enjoy longevity for millions of years, your destiny aligned with the Celestial Emperor’s.”\n\nNext, visualize the Celestial Emperor offering this invocation: “In heaven, united with the Perfected—this is [Name]’s body. In heaven, united with the numinous—this is [Name]’s form.” After a long while, the visualization is complete.\n\nThis is the Nine Lords’ Convergence, wherein the hundred spirits are inwardly transformed, the embryonic knots untied, the three barriers opened and harmonized. Above, it accords with the Six Harmonies; alongside, it merges with the Radiant Celestial Emperor. The destiny register is altered, qi stabilizes within the Mud-Pill Palace, and upon receiving the talisman of longevity, one becomes a Heavenly Immortal.\n\nOnce the visualization is fully accomplished, loosen the hair, comb it anew, untie and retie the garments, and wash the hands and feet.\n\nWithin the Celestial Emperor’s Mud-Pill Palace lies another Palace of the Six Harmonies, wherein dwells the Imperial Supreme Unity Lord, named Chong Mingkong, styled You Liaowu. Those who know this may regenerate their decayed bones, cause the five viscera to flourish, and remain unafraid for life. In moments of fear, face north and call this name thrice, reciting: *“Luo A Chong Mingkong, Lei Feng You Liaowu, born of the Celestial Emperor’s form, protect [Name] and dispel all sorrow.”* Upon completion, it shall be as though a thousand companions stand beside you.\n\nThe Supreme Unity states: “Humans possess three hun-souls, which benefit one’s preservation; they also possess seven po-souls, which harm one’s destiny. The seven po-souls dwell beneath the left eye by day and beneath the nose by night.” For those who practice the Dao and wish to sleep, first press the right fingernail to the left eye’s underside and the philtrum, each thirty-seven times—this is most efficacious, for it is the method to restrain the seven po-souls.\n\nThe Celestial Emperor says: “The Supreme Unity’s *Precious Mystic Jade Canon* is concealed within the Flowery Chambers of the Five Marchmounts. Those without immortal registers may neither hear nor behold it. Those who see it shall live; those who practice it shall ascend. Thus, solemn oaths are sworn, binding one’s celestial authenticity to prevent its dissemination or deviation.”\n\nSince the Heavenly Worthy reveres the immortals, this Dao is kept profoundly secret. It is not transmitted to those without immortal bones, nor revealed to those lacking utmost sincerity. As the scripture states: *“The disciple receives with reverence.”* The transmission of scriptures follows the master’s instruction; receiving the scripture and applying it is the disciple’s path.\n\nDuring transmission, both master and disciple observe a seven-day fast, or ten days, with an additional eight-day purification fast preceding and following—this is called the *Announcement Fast*. In ancient times, oaths were sealed with blood and severed hair, altars were erected, and Heaven was invoked to ensure secrecy and fidelity. Today, one may substitute gold rings and azure silk for the body’s hair and flesh, arranging them in a separate retreat while invoking the Supreme August One.\n\nThe ritual requires three gold rings, bright and radiant, and nine feet of azure silk to substitute for the threefold covenant—alternatively, twenty-seven feet may be used. The scripture must be copied in duplicate, one for the master and one for the disciple. All items for the oath must be prepared and may not be privately used for personal gain.\n\nAs the *Central Scripture of the Supreme* states: *“The master imparts the scriptural practice, hence the disciple is called the ‘living recipient.’ Through study, sincerity is unified; through oaths sworn to Heaven, the spirits are bound; through shared joys and sorrows, the bond equals life and death. Only then may one be tested and ultimately ascend together to the immortal courts.”*\n\nThereafter, bow and receive the teaching, perform the oath in a secluded chamber, and honor the three covenants with reverence. Distinguish the earnestness of your devotion, treasure the scripture’s secrecy, and practice its essential teachings. With unwavering sincerity, respect the master and scripture, and never allow negligence in your heart. Only thus may one speak of communion with the divine and the covenant of Dao and virtue.\n\nThose who uphold the scripture and conceal its Dao, who act in accordance with its oaths, shall have their names inscribed on jade tablets and their records written in the Supreme Ultimate’s celestial register. Should one violate this Dao, their seven ancestors shall suffer the trials of the Wind Blade, their Mystic Mother endure the calamity of fetal dissolution, their body become a lowly ghost, and their lineage be extinguished. They shall be crushed beneath the stones of Mount Lianmeng and cast into the River of Accumulated Nights. Alas! Let those with hearts take heed and guard this secrecy.\n\nThese are the covenant commands of the Supreme Perfected, expounded by Celestial Master Zhang in the *Cinnabar Radiance Scripture*. Such are the solemn oaths of caution.\n\nThose who receive the Dao of the Supreme Celestial Emperor shall proceed thus, and so it is recorded for practice.\n\nThe three gold rings seal the oath of the Three Origins. The twenty-seven feet of azure silk serve as the ceremonial cloth, binding the oath of the Celestial Emperor’s twenty-four spirits. Five ounces of red silk seal the oath of the Five Divine Lords. Two packets of blended incense serve as the medium for invoking the spirits and exchanging qi. One brush, one hundred sheets of paper, and one ounce of cinnabar are used to inscribe the oath.\n\nThese five items are to be contained in vessels and kept from exposure, all prepared by the scripture’s recipient. Once the disciple has copied the text, they shall present the scripture and offerings to the master’s chamber to receive it. Only after the oath may it be practiced.\n\nThose who practice without receiving the oath, as per the *Female Azure Scripture*, shall lose both luminaries. Those who receive but do not practice shall suffer celestial calamities. Those who practice but divulge it shall endure the Wind Blade’s trials. Those who transmit it to the unworthy shall cause their seven generations of parents to suffer. Such are the decrees of the *Mystic Capital’s Ghostly Statutes* and the *Female Azure Scripture*.\n\nHere ends the *Supreme Clarity Supreme Unity Celestial Emperor’s Great Cinnabar Hidden Writ: Diagram and Oral Instructions for Dissolving the Twelve Embryonic Knots*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清太一帝君太丹隐书解胞十二结节图诀 经名：上清太一帝君太丹隐书解胞十二结节图诀。 撰人不详，约出於南北期。 系摘录《大丹隐书》改编而成。 一卷。 底本出处：《正统道藏》正一部。 上清太一帝君太丹隐书解胞十二结节图诀 夫人生由胞胎以自变，禀血精以自成，故既生而胞胎更结，既成而血液不留。 不留者，帝君混合则已留住之矣。 胞胎有十二结节，盘固五内，五内滞碍，结不可解，节不可除，故人之病也，由节滞也，人之死也，由结固也。 常以本命日，若八节日，上请帝君与太一混合，约制百神，而解胞中牢坚之结，盘根之死节也。 胞有十二结，内又有十二节，节在结内，人不知解胞结节者，亦不免死矣。 恒解之者长生。 胞上结，一在泥丸中，二在口中，三在颊中，四在目中，此胞之四结在上部。 胞中结，一在五藏中，二在太仓中，三在大肠中，四在小肠中，此胞之四结在中部。 胞下结，一在膀胱中，二在阴中，三在后门中，四在两足中，此胞之四结在下部。 解结之法，入室闭户存思，先读帝君以下百神名字，再过毕，乃按次解结。 此法是帝君太一混合二十四神，解结除尸气之道也。 兆以本命日，若八节日，日中夜半时任意也，正坐向本命之方，接手端心，叩齿二十四通，曰：男生某甲，上启胞父胞母，始生之日，三积留血，化为十二大结，今本命之日，谨请三九之神，二十四真人，解三关十二结。 请言所召： 东方青帝雕梁际，字青平。",
      "translated_text": "*The Upper Clarity Scripture of the Great Vermilion Hidden Book of the Supreme Unity Lord of the Grand Monad: Diagram and Oral Instructions for Untying the Twelve Knots of the Primordial Womb*\n\n**Scripture Title:** *The Upper Clarity Scripture of the Great Vermilion Hidden Book of the Supreme Unity Lord of the Grand Monad: Diagram and Oral Instructions for Untying the Twelve Knots of the Primordial Womb*\nAuthor unknown, approximately dating to the Northern and Southern Dynasties. Compiled as an excerpt from *The Great Vermilion Hidden Book*. One scroll. Base text from *The Orthodox Daoist Canon*, Section Zheng Yi.\n\n---\n\nThe life of a person transforms from the primordial womb and takes form through the essence of blood. Thus, after birth, the womb continues to knot, and after formation, the blood ceases to flow. That which does not flow—the Supreme Unity Lord blends and harmonizes it, causing it to remain. The womb possesses twelve knotted nodes, entwining and solidifying the Five Viscera. When the Five Viscera are obstructed, the knots cannot be untied, nor the nodes removed. Hence, human illness arises from the stagnation of nodes, and human death from the solidification of knots.\n\nOn one’s life-destiny day or the eight solar terms, one should invoke the Supreme Unity Lord to blend and harmonize, commanding the hundred spirits to untie the stubborn knots within the womb and the dead nodes of deep-rooted entanglement. The womb has twelve knots, and within it, twelve nodes. The nodes reside within the knots. Those who do not know how to untie the womb’s knots and nodes will not escape death. Those who constantly untie them attain longevity.\n\nThe knots of the upper womb:\n1. Within the Mud-Pill Palace,\n2. Within the mouth,\n3. Within the cheeks,\n4. Within the eyes—\nthese four knots of the womb reside in the upper region.\n\nThe knots of the middle womb:\n1. Within the Five Viscera,\n2. Within the Great Granary,\n3. Within the large intestine,\n4. Within the small intestine—\nthese four knots of the womb reside in the middle region.\n\nThe knots of the lower womb:\n1. Within the Bladder,\n2. Within the yin organ,\n3. Within the posterior gate,\n4. Within the two feet—\nthese four knots of the womb reside in the lower region.\n\nThe method for untying the knots: Enter a chamber, close the door, and engage in visualization. First recite the names of the hundred spirits below the Supreme Unity Lord, then proceed to untie the knots in sequence. This method is the Way of the Supreme Unity Lord blending with the twenty-four spirits to untie knots and expel corpse-qi.\n\nOn one’s life-destiny day or the eight solar terms, at noon or midnight, sit upright facing the direction of one’s life-destiny. Join the hands, compose the mind, and knock the teeth twenty-four times, saying:\n\n*\"Male disciple [Name], humbly invokes the Womb Father and Womb Mother. On the day of my birth, the three accumulations of stagnant blood transformed into twelve great knots. Today, on my life-destiny day, I reverently summon the gods of the Three Nines and the Twenty-Four Perfected Ones to untie the three barriers and twelve knots.\"*\n\nThe invocation of the summoned:\n*\"In the east, the Azure Emperor at the Carved Beam’s Edge, whose name is Qingping...\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 583,
      "start_sentence": 0,
      "end_sentence": 20,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.774177074432373,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太一帝君太丹隐书解胞十二结节图诀.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "五方五帝，随方色，取宜设色 南方赤帝长来觉，字南和。 西方白帝彰安幸，字西华。 北方黑帝保成昌，字北伐。 玄一老子林虚夫，字灵时道。 服绿，已下服色依注说，余并取宜设色。 三素老君牢张上，字生道。 服素。 正一左仙人仲成子。 一名帝宾，字四华，服紫。 正一右仙人曲又子。 一名光贤，字灵和，浅红服。 太微小童干景精，字会元子。 一名三衿交，一名对帝真，绛服。 上胎内真等，有九人，外合九气，是为九君，为甲上解结。 结在上关，四结解散，津血流源，长上生籍，永为帝仙。 太一尊神务犹收，字归会昌。 一名鲜明，一名寄频，服深紫。 右无英公子玄元叔，字合符子。 一名元素君，一名神公子，浅红服。 右白元洞阳君郁灵标，字玄夷绝。 一名朱精，一名启成，绛服。 中央司命丈人君理明初，字玄度卿。 一名神宗，一名灵华，服紫。 命门桃君孩道康，字合精延。 一名命王，一名胞根，浅红服。 泥丸天帝君上一赤子玄凝天，字三元先。 一名伯无上，一名伯史华，绛服。 泥丸天帝卿肇勒精，字中玄生。 一名起非，一名常扶，服紫。 绛宫心丹田宫中元丹皇君神运珠，字子南丹。 一名生上伯，一名史云拘，浅绛服。 绛宫辅皇中一卿中光坚，字四化灵。 一名幽车伯，一名董史华，绛服。 中胎九真，是为九君，回灵九气，化入绛宫，五藏大结，大肠小肠，皆当化散，四结分昌，中关调利，流注太仓，千灾万祸，一时灭亡，记上生录，永无灾殃。 命门下一黄庭元王始明精，字元阳昌。 一名婴儿胎，一名伯史原，服紫。 黄庭保镇弼卿归上明，字谷下玄。 一名承申伯，一名承光生，赤黄服。 第一胎中白气君务玄子，字育尚生。 素服。 第二结中青气君案延昌，字合和婴。 服青。 第三节中黑气君斌来生，字精上门。 服皂。 第四胞中黄气君祖明车，字神无极。 服黄。 第五血中赤气君混离子，字叔保坚。 绛服。 第六上玄元父君高同生，字左回明。 浅紫服。 第七下玄玄母君叔火王，字右回光。 绛服。 下胎九君，胞胎内真，生化九气，州是为九魂，九魂精结，胞中节坚，使甲不寿，中年陨颠。 今日本命，如往初生，乞得解散，十二死根，名上玉籍，五符入身，下镇九气，永得缠绵，上开九宫，下开九关。 礼读再过，都毕，当和心下气，勿令音辍而蹇也。 又闭目存呼太极紫房天皇大帝君逢凌梵，字履昌灵，一名七灵，一名神丈人。 如此祝之，三又存三九结解真君，东方青帝雕梁际等，下诣玄母叔火王等二十七人，同着朱衣黄巾。 黄巾者，似远游冠之状也。 貌如婴儿，有无长短。 若兆不能谙识一二存念者，可入室按文施行之。 已后山色、云炁、人物，并取宜设色。 次引太极紫房，并北面对太帝君，而各长跪，其言曰：上关雕梁际等九人，中关太一务犹收等九人，下关下一黄庭始明精等九人，三九二十七人，即日缘气内咽，上开三关，关有二十四结，结有二十四筋，筋即已断，结已解散，津血上冲，径满泥丸，玉液下顺，哺养百神，即日某甲名上帝籍，长生神仙。 毕，又存太一召兆，上诣帝君前。 帝君曰：胞结已通，光内彻外，使尔长生，命不倾坠，汝可合我形中矣。 帝君因开口，觉我忽入帝君口中，径到帝君六合宫中。",
      "translated_text": "The Five Emperors of the Five Directions, each corresponding to their directional color, may be adorned with suitable hues:\n\nThe Red Emperor of the South, Changlaijue, styled Nanhe.\nThe White Emperor of the West, Zhang’anxing, styled Xihua.\nThe Black Emperor of the North, Baochengchang, styled Beifa.\nThe Old Master of the Mysterious Unity, Lin Xufu, styled Ling Shidao, clad in green—hereafter, attire follows the annotations; otherwise, colors may be chosen as appropriate.\n\nThe Three Pristine Lords, Laozhangshang, styled Shengdao, clad in plain white.\nThe Left Immortal of the Orthodox Unity, Zhong Chengzi, also named Dibin, styled Sihua, clad in purple.\nThe Right Immortal of the Orthodox Unity, Qu Youzi, also named Guangxian, styled Linghe, clad in pale red.\nThe Lesser Lad of the Grand Tenuity, Gan Jingjing, styled Huiyuanzhi, also named Sanjinjiao or Duizizhen, clad in crimson.\n\nThe Upper Womb’s Inner Perfected Ones, numbering nine, merge with the nine qi to form the Nine Lords, who untie the knots at the Upper Barrier. When the four knots of the Upper Barrier dissolve, the flow of essences and blood is restored, the register of longevity is inscribed above, and one becomes an Imperial Immortal forever.\n\nThe Venerable Deity of the Supreme Unity, Wuyoushou, styled Guihuichang, also named Xianming or Jipin, clad in deep purple.\nThe Right Unsurpassed Duke, Xuanyuanshu, styled Hefuzi, also named Yuansu Jun or Shen Gongzi, clad in pale red.\nThe Right White Prime of Cavernous Yang, Yu Lingbiao, styled Xuanyi Jue, also named Zhu Jing or Qicheng, clad in crimson.\nThe Central Director of Destinies, the Venerable Lord Limingchu, styled Xuandu Qing, also named Shenzong or Linghua, clad in purple.\nThe Peach Lord of the Gate of Destiny, Haidaokang, styled Hejingyan, also named Mingwang or Baogen, clad in pale red.\nThe Celestial Emperor of the Mud-Pill Palace, Shangyi Chizi Xuanningtian, styled Sanyuanxian, also named Bowushang or Boshi Hua, clad in crimson.\nThe Minister of the Celestial Emperor of the Mud-Pill Palace, Zhaole Jing, styled Zhong Xuansheng, also named Qifei or Changfu, clad in purple.\nThe Cinnabar Sovereign of the Crimson Palace’s Central Elixir Field, Shen Yunzhu, styled Zinan Dan, also named Shengshang Bo or Shiyun Ju, clad in pale crimson.\nThe Assistant Sovereign of the Crimson Palace, Zhongguang Jian, styled Sihua Ling, also named Youche Bo or Dong Shi Hua, clad in crimson.\n\nThe Nine Perfected Ones of the Central Womb, forming the Nine Lords, revolve the nine qi of the spirit to transform and enter the Crimson Palace. The great knots of the five viscera, the large and small intestines, all dissolve; the four knots disperse and flourish. The Central Barrier is harmonized, its flow directed to the Great Granary. A thousand calamities and ten thousand misfortunes vanish in an instant. One’s name is inscribed in the register of life above, and one remains forever free from disaster.\n\nThe Lower One of the Gate of Destiny, Huangting Yuanshi Mingjing, styled Yuanyang Chang, also named Ying’er Tai or Boshi Yuan, clad in purple.\nThe Guardian and Protector of the Yellow Court, Guishang Ming, styled Guxia Xuan, also named Chengshen Bo or Chengguang Sheng, clad in red-yellow.\nThe First Lord of the White Qi within the Womb, Wuxuanzi, styled Yushang Sheng, clad in plain white.\nThe Second Lord of the Green Qi within the Knots, Anyanchang, styled Hehe Ying, clad in green.\nThe Third Lord of the Black Qi within the Nodes, Binlaisheng, styled Jingshang Men, clad in black.\nThe Fourth Lord of the Yellow Qi within the Womb, Zumingche, styled Shenwuji, clad in yellow.\nThe Fifth Lord of the Red Qi within the Blood, Hunlizi, styled Shubaojian, clad in crimson.\nThe Sixth Lord, the Upper Mysterious Primordial Father, Gaotongsheng, styled Zuo Huiming, clad in pale purple.\nThe Seventh Lord, the Lower Mysterious Primordial Mother, Shu Huowang, styled You Huiguang, clad in crimson.\n\nThe Nine Lords of the Lower Womb, the Inner Perfected Ones of the Embryo, generate and transform the nine qi, which are the nine souls. When the nine souls form knots of essence within the embryo, the nodes harden, causing one’s lifespan to be short and leading to an early demise. Today, on one’s life-destiny day, as at the time of one’s initial birth, one beseeches the dissolution of the twelve roots of death. One’s name is inscribed in the Jade Register above, the Five Talismans enter the body, and the nine qi are pacified below. One attains eternal continuity, the Nine Palaces open above, and the Nine Barriers open below.\n\nAfter reciting the ritual twice, conclude by harmonizing the mind and regulating the breath, ensuring the voice does not falter or stumble. Then, with eyes closed, visualize and invoke the Celestial Emperor of the Supreme Ultimate’s Purple Chamber, Feng Lingfan, styled Lü Changling, also named Qiling or Shen Zhangren.\n\nThus invoke thrice, then visualize the Nine True Lords who untie the knots: the Azure Emperor of the East at the Carved Beam’s Edge and the twenty-seven others, down to the Primordial Mother Shu Huowang, all clad in crimson robes and yellow headscarves. The yellow headscarves resemble the shape of a traveler’s cap. Their forms are like those of infants, varying in height. If the practitioner cannot memorize or visualize even a few of them, they may enter the chamber and proceed according to the text.\n\nThereafter, the colors of mountains, clouds, qi, and figures may be chosen as appropriate. Next, lead the Supreme Ultimate’s Purple Chamber to face north toward the Celestial Emperor, each kneeling in reverence, and say:\n\n“The Nine of the Upper Barrier, beginning with the Azure Emperor at the Carved Beam’s Edge; the Nine of the Central Barrier, beginning with the Supreme Unity’s Wuyoushou; and the Nine of the Lower Barrier, beginning with the Lower One of the Yellow Court, Huangting Mingjing—twenty-seven in total—today, by the qi of destiny, swallow inwardly. The Three Barriers open above; each barrier has twenty-four knots, and each knot has twenty-four sinews. The sinews are now severed, the knots dissolved. The essences and blood surge upward, filling the Mud-Pill Palace; the Jade Fluid flows downward, nourishing the hundred spirits. Today, [Name] is inscribed in the Celestial Register as a Longevous Divine Immortal.”\n\nUpon completion, visualize the Supreme Unity summoning the practitioner to ascend before the Celestial Emperor. The Celestial Emperor says: “The knots of the embryo are now unblocked; the light shines within and permeates without. You are granted longevity, and your destiny shall not falter. You may now merge with my form.”\n\nThe Celestial Emperor then opens his mouth, and the practitioner suddenly enters, arriving at the Celestial Emperor’s Palace of the Six Harmonies.",
      "overlap_context": "nock the teeth twenty-four times, saying:\n\n*\"Male disciple [Name], humbly invokes the Womb Father and Womb Mother. On the day of my birth, the three accumulations of stagnant blood transformed into twelve great knots. Today, on my life-destiny day, I reverently summon the gods of the Three Nines and the Twenty-Four Perfected Ones to untie the three barriers and twelve knots.\"*\n\nThe invocation of the summoned:\n*\"In the east, the Azure Emperor at the Carved Beam’s Edge, whose name is Qingping...\"*",
      "start_char": 584,
      "end_char": 1956,
      "start_sentence": 21,
      "end_sentence": 86,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.40731430053711,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太一帝君太丹隐书解胞十二结节图诀.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "帝君六合宫中，又有太上神，名重冥空，字幽寥无，因告兆曰：可食日精矣。 兆即取日精食之，作九咽止。 须臾，见向二十七真人，皆在兆左右立。 二十七真人曰：某甲胎籍已解，秽气皆除，面已玉泽，体洞太虚，长生亿万，帝君同符。 又存帝君祝曰： 天上同真，是甲之身，天上同灵，是甲之形。 良久，都毕也。 此为九君混合，内化百神，解胞散结，开利三关，上符六合，并景帝君，变化命籍，气镇泥丸，长生受符，方为天仙者也。 存思都毕，乃更散发，更梳头解衣，更结衣，洗手足。 帝君泥丸中，又有六合宫，宫中有帝皇太一君，名重冥空，字幽寥无。 兆知之者，朽骨更生，五藏生华，终身不畏怖。 畏怖之时，北向呼此名三过，祝曰： 罗阿重冥空，雷风幽寥无，上生帝君形，佑兆使无忧。 毕，如与千人同侣。 太一曰：人有三魂，利人之存，人有七魄，害人之命，七魄朝在人左目下，暮在鼻人中下。 学道者欲卧，先以右手爪按左目下及人中，各三七过，甚佳，此制七魄之道也。 帝君曰：太一宝玄玉经，太上真人藏於五岳华房之内，非有仙籍者，不得闻见此也。 见之者生，行之者仙。 是故重为盟誓，束其天真，以防宣泄流布离行耳。 自天尊贵仙，幽秘此道，非仙骨者不授也，无至诚者不闻也。 故经曰：师受者礼焉。 经之传也，从师而受，受经而用弟子道也。 传授之际，各斋七日，或十日，先后又曰告斋，各复八日也。 古者盟誓，皆歃血断发，立坛告天，以为不宣示信之约也。 今自可以金青丝之陈，以代发肤之体耳，列於别靖，祝启上皇。 法用金镮三枚，鲜明赤而有光者，青缯九尺，以代三契之盟，亦可相连为二十七尺耳。 受经当写为两通，修一几一也。 盟物备录，不得私用以自营也。 故太上中经曰：夫师因经业，故称之曰生受者，习焉以同其诚，推盟誓天，固神告灵，缠绵忧乐，义齐死生，於是始验克终，俱期仙庭者矣。 尔乃束拜谘受，修盟曲室，尊卑以显三契，分别孜孜之心，宝经藏密，施行要言，诚存专一，保敬师经，方寸敢怠，如此始可与言神灵之交，道德之契矣。 奉经而秘其道，行事而遵其誓，则上以刊名於玉简，书帝录於太极。 若违其道也，则七祖受风刀之考，玄母受胎零之害，身为下鬼，门亦堙灭，摙蒙山之石，以投积夜之河。 悲夫，有心之子，其慎秘也哉。 此太上真人契令，张天师演出於丹景经中，有是慎盟之书也。 受太上帝君之道，用事如此，故记而施行焉。 金镮三枚，盟三元之誓也。 青缯二十七尺，帛也，盟帝君二十四神之誓也。 赤丝五两，以盟五神公子之誓也。 和香二裹，以为告灵交气之因也。 笔一枝，纸一百，丹一两，书盟也。 右五种，以物器盛之，不宣露也，皆受经者具也。 弟子写毕，乃赍经及信，来诣师室而受经。 受经毕，乃得施用耳。 不盟受而窃行之者，按女青诏书，失两明也。 受而不行者，有天灾考也。 行而宣泄者，有风刀灾考也。 传非其人，七世父母受其考也。 此玄都鬼律女青诏书之旨。 上清太一帝君太丹隐书解胞十二结节图诀竟",
      "translated_text": "Within the Celestial Emperor’s Palace of the Six Harmonies, there resides the Supreme Divine One, named Chong Mingkong, styled You Liaowu. He addresses the practitioner, saying: “You may now consume the essence of the sun.” The practitioner then gathers the solar essence and ingests it, swallowing nine times before stopping.\n\nPresently, the twenty-seven Perfected Ones, previously seen, stand arrayed to the practitioner’s left and right. The twenty-seven Perfected Ones declare: “[Name]’s embryonic register is now dissolved; all impure qi is expelled. Your countenance shines with jade-like luster, your body permeates the Great Void. You shall enjoy longevity for millions of years, your destiny aligned with the Celestial Emperor’s.”\n\nNext, visualize the Celestial Emperor offering this invocation: “In heaven, united with the Perfected—this is [Name]’s body. In heaven, united with the numinous—this is [Name]’s form.” After a long while, the visualization is complete.\n\nThis is the Nine Lords’ Convergence, wherein the hundred spirits are inwardly transformed, the embryonic knots untied, the three barriers opened and harmonized. Above, it accords with the Six Harmonies; alongside, it merges with the Radiant Celestial Emperor. The destiny register is altered, qi stabilizes within the Mud-Pill Palace, and upon receiving the talisman of longevity, one becomes a Heavenly Immortal.\n\nOnce the visualization is fully accomplished, loosen the hair, comb it anew, untie and retie the garments, and wash the hands and feet.\n\nWithin the Celestial Emperor’s Mud-Pill Palace lies another Palace of the Six Harmonies, wherein dwells the Imperial Supreme Unity Lord, named Chong Mingkong, styled You Liaowu. Those who know this may regenerate their decayed bones, cause the five viscera to flourish, and remain unafraid for life. In moments of fear, face north and call this name thrice, reciting: *“Luo A Chong Mingkong, Lei Feng You Liaowu, born of the Celestial Emperor’s form, protect [Name] and dispel all sorrow.”* Upon completion, it shall be as though a thousand companions stand beside you.\n\nThe Supreme Unity states: “Humans possess three hun-souls, which benefit one’s preservation; they also possess seven po-souls, which harm one’s destiny. The seven po-souls dwell beneath the left eye by day and beneath the nose by night.” For those who practice the Dao and wish to sleep, first press the right fingernail to the left eye’s underside and the philtrum, each thirty-seven times—this is most efficacious, for it is the method to restrain the seven po-souls.\n\nThe Celestial Emperor says: “The Supreme Unity’s *Precious Mystic Jade Canon* is concealed within the Flowery Chambers of the Five Marchmounts. Those without immortal registers may neither hear nor behold it. Those who see it shall live; those who practice it shall ascend. Thus, solemn oaths are sworn, binding one’s celestial authenticity to prevent its dissemination or deviation.”\n\nSince the Heavenly Worthy reveres the immortals, this Dao is kept profoundly secret. It is not transmitted to those without immortal bones, nor revealed to those lacking utmost sincerity. As the scripture states: *“The disciple receives with reverence.”* The transmission of scriptures follows the master’s instruction; receiving the scripture and applying it is the disciple’s path.\n\nDuring transmission, both master and disciple observe a seven-day fast, or ten days, with an additional eight-day purification fast preceding and following—this is called the *Announcement Fast*. In ancient times, oaths were sealed with blood and severed hair, altars were erected, and Heaven was invoked to ensure secrecy and fidelity. Today, one may substitute gold rings and azure silk for the body’s hair and flesh, arranging them in a separate retreat while invoking the Supreme August One.\n\nThe ritual requires three gold rings, bright and radiant, and nine feet of azure silk to substitute for the threefold covenant—alternatively, twenty-seven feet may be used. The scripture must be copied in duplicate, one for the master and one for the disciple. All items for the oath must be prepared and may not be privately used for personal gain.\n\nAs the *Central Scripture of the Supreme* states: *“The master imparts the scriptural practice, hence the disciple is called the ‘living recipient.’ Through study, sincerity is unified; through oaths sworn to Heaven, the spirits are bound; through shared joys and sorrows, the bond equals life and death. Only then may one be tested and ultimately ascend together to the immortal courts.”*\n\nThereafter, bow and receive the teaching, perform the oath in a secluded chamber, and honor the three covenants with reverence. Distinguish the earnestness of your devotion, treasure the scripture’s secrecy, and practice its essential teachings. With unwavering sincerity, respect the master and scripture, and never allow negligence in your heart. Only thus may one speak of communion with the divine and the covenant of Dao and virtue.\n\nThose who uphold the scripture and conceal its Dao, who act in accordance with its oaths, shall have their names inscribed on jade tablets and their records written in the Supreme Ultimate’s celestial register. Should one violate this Dao, their seven ancestors shall suffer the trials of the Wind Blade, their Mystic Mother endure the calamity of fetal dissolution, their body become a lowly ghost, and their lineage be extinguished. They shall be crushed beneath the stones of Mount Lianmeng and cast into the River of Accumulated Nights. Alas! Let those with hearts take heed and guard this secrecy.\n\nThese are the covenant commands of the Supreme Perfected, expounded by Celestial Master Zhang in the *Cinnabar Radiance Scripture*. Such are the solemn oaths of caution.\n\nThose who receive the Dao of the Supreme Celestial Emperor shall proceed thus, and so it is recorded for practice.\n\nThe three gold rings seal the oath of the Three Origins. The twenty-seven feet of azure silk serve as the ceremonial cloth, binding the oath of the Celestial Emperor’s twenty-four spirits. Five ounces of red silk seal the oath of the Five Divine Lords. Two packets of blended incense serve as the medium for invoking the spirits and exchanging qi. One brush, one hundred sheets of paper, and one ounce of cinnabar are used to inscribe the oath.\n\nThese five items are to be contained in vessels and kept from exposure, all prepared by the scripture’s recipient. Once the disciple has copied the text, they shall present the scripture and offerings to the master’s chamber to receive it. Only after the oath may it be practiced.\n\nThose who practice without receiving the oath, as per the *Female Azure Scripture*, shall lose both luminaries. Those who receive but do not practice shall suffer celestial calamities. Those who practice but divulge it shall endure the Wind Blade’s trials. Those who transmit it to the unworthy shall cause their seven generations of parents to suffer. Such are the decrees of the *Mystic Capital’s Ghostly Statutes* and the *Female Azure Scripture*.\n\nHere ends the *Supreme Clarity Supreme Unity Celestial Emperor’s Great Cinnabar Hidden Writ: Diagram and Oral Instructions for Dissolving the Twelve Embryonic Knots*.",
      "overlap_context": "ngevous Divine Immortal.”\n\nUpon completion, visualize the Supreme Unity summoning the practitioner to ascend before the Celestial Emperor. The Celestial Emperor says: “The knots of the embryo are now unblocked; the light shines within and permeates without. You are granted longevity, and your destiny shall not falter. You may now merge with my form.”\n\nThe Celestial Emperor then opens his mouth, and the practitioner suddenly enters, arriving at the Celestial Emperor’s Palace of the Six Harmonies.",
      "start_char": 1956,
      "end_char": 3134,
      "start_sentence": 87,
      "end_sentence": 135,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.70037364959717,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清太一帝君太丹隐书解胞十二结节图诀.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}