{
  "source_id": "上清太玄鉴诫论",
  "source_file": "chunked_daozang\\上清太玄鉴诫论.json",
  "total_chunks": 6,
  "total_original_chars": 4087,
  "total_translated_chars": 21600,
  "total_translation_time": 121.42253232002258,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太平部\\上清太玄鉴诫论.txt",
    "category": "正统道藏太平部"
  },
  "full_translation": "**The Supreme Clarity Treatise on the Great Mystery’s Mirror of Admonitions**\n\n*Scripture Title:* *The Supreme Clarity Treatise on the Great Mystery’s Mirror of Admonitions*\n*Composed by Jin Hou Shanyuan*\n*One fascicle*\n*Source of the base text:* *Daoist Canon of the Orthodox Unity Tradition, Supreme Peace Section*\n\n---\n\n**The Supreme Clarity Treatise on the Great Mystery’s Mirror of Admonitions**\n*Composed by the Divine Dweller of Guye Mountain, the Cavernous Master of the Great Mystery*\n\n**Eulogy:**\nStraight words hold the ultimate truth—why fear the judgments of men?\nPointing the way to the path of cool clarity, lifting one from the pit of karmic fire.\nNot seeking the weight of the noble, who fears the scorn of the petty?\nSpeech and silence align with Heaven’s principle; a loyal heart speaks of universal peace.\n\nThe Great Dao is silent and formless, vast and without image.\nPrimal harmony blended before the dawn of the Great Beginning;\nmysterious subtlety endowed beyond Heaven and Earth.\nNaturally empty and without, life arises from the realm of form.\nWithin the profound obscurity of sensed images, the law adheres to the principle of utter stillness.\nTrue qi transforms into truth, true essence transforms into spirit;\nspirit and truth unite with the Dao.\n\nThe Dao is One.\nOne gives rise to Two, Two gives rise to Three, Three gives rise to the myriad things.\nAmong the myriad things, [humankind] is the most numinous and noble—\nnoble in the cultivation of truth.\nTruth is constancy.\nYet in daily life, people remain unaware.\nAwareness resides in the heart of the human.\nThe heart is the spirit within the Gate of Joy.\nWithin the spirit lies truth, truth’s root is perfect clarity.\nNature arises from purity, yet follows emotions into disorder,\nturning away from right and true.\n\nYou do not reflect on whence you came in life, nor whither you go in death.\nLet go of thoughts of the past, cease pondering the future—\nyou remain in the dark.\nSeize the present moment, and it will grant you\nunfettered ease, radiant and unobstructed,\nto become a person of clarity.\nNeither Heaven nor Earth can claim you, ghosts and spirits have no jurisdiction.\nYour body like the great void, your nature without peer.\nAbiding in yang yet unscorched, dwelling in yin yet uncorrupted.\nWater and fire cannot harm you, mountains and seas cannot bar your way.\nYou penetrate Heaven and Earth, pierce metal and stone.\nSolitary and self-contained, your singular form roams free.\nTransforming into the radiance of sun and moon,\nyou become the perfect Dharma-body.\n\nThose who attain this know its reality.\nWithout straying from the path, they avoid lifelong error.\nPreserving the sagely work in full,\nthey transcend life and escape death.\nWhy is this so?\n\nJust as casting bronze or iron statues requires a mold,\nso too does the cultivation of immortality depend on a master.\nTheir finger-pointings and profound mechanisms\nclearly distinguish host and guest, movement and stillness,\npurity and turbidity, ascent and descent, floating and sinking—\nthe three essentials within and without.\nWhere this method exists, all merges into oneness.\n\nIn the midst of pure and tranquil cultivation,\nnothing is not done within the realm of activity.\nYet grasping this wondrous mechanism\nnaturally entails obstacles.\nThe subtle and marvelous method cannot be recklessly spoken;\nin brief, at the critical moment,\ndiscern the great and small, the fine and minute within the compass,\ndistinguishing correctly without error,\nso that even unto death and throughout life, no hindrance remains.\n\nShould one follow this method,\nthe celestial mechanism shall be transmitted thereafter.\nThe Most High said: *\"To see the small is called clarity.\"*\nAnd again: *\"To die yet not perish is called longevity.\"*\nMaster Pingshu said: *\"Even a hair’s deviation fails to form the elixir.\"*\nAnd further: *\"Discuss it in detail with the immortals,\nbut do not speak carelessly to delude the masses,\nleading others into the cycle of birth and death,\nand thus misleading their very lives.\nIf such a heart exists within you,\nHeaven and Earth will not protect you.\nYour left eye shall weep pus, your right eye blood;\nyour body shall be severed into ten thousand pieces,\nforever cast into Fengdu,\nnever to receive rebirth in the world.\"*\n\nThere are those of dull roots and shallow wisdom\nwho harbor disbelief, fostering strife between self and others.\nIn secret, they spread praise and slander,\nhaving pilfered a phrase or two of cryptic words,\ntwisting them in black and white to confuse others.\nThey themselves do not practice, yet urge others toward purity,\nall while behaving like beasts—\ntheir understanding fit only to graze,\nclinging to wine, lust, wealth, and temper,\nunable to sever stinginess, greed, jealousy, or envy.\nDay after day, they cling to wives and children,\nindulging in idle chatter and vulgar speech—\nhow can they ever attain true awakening?\nWithout treading the path in truth and practice,\nhow can they not ruin their future?\n\nA hymn declares:\nJealousy turns to wrath in rebirth,\nlewdness strips the heart of kindness.\nDay by day, they chase the path of profit,\nhour by hour, they cling to the red dust.\nSwine and dogs remain their constant companions,\nfoxes and raccoons their nightly kin.\nIf lustful thoughts remain unsevered,\nhow dare they speak of celestial truth?\n\nAll Daoists who seek immortal cultivation\nmust rely on resolute generosity—\na single blade, two clean cuts,\nsevering love, parting from kin,\ndispelling passion, forsaking desire,\ndiminishing thoughts, forgetting schemes,\npure as ice, flawless as jade,\nsingle-minded and unwavering.\nSeek masters, inquire of the Dao,\ncultivate with steadfast sincerity.\n\nThe Most High has said:\nThough surrounded by splendor,\ndwell in transcendent ease.\n\"Transcendent ease\" means to distance oneself and not reside therein.\n\nAnother scripture states:\nFor those who cultivate the Dao,\nseclusion in deep mountains and secluded grottoes,\ncut off from fowl and hound,\nsevering right and wrong,\nturning the mind inward—\nno need for external seeking.\nOnly when all thoughts cease to arise,\nall entanglements remain unstained,\ncan one become a true renunciant,\na carefree person of the Dao.\n\nFrom ancient times to the present,\nnever has one clung to a wife and attained the Dao,\nnor embraced a child and ascended as an immortal.\nNow I admonish you:\nrestrain your anger,\nfor it constantly kindles fire.\nYet some cite Liezi, who attained the Dao while at home.\nFools who know not the truth—\nLiezi was a great sage,\na recluse in his own home.\nDo not think you, too, can become a recluse.\n\nA hymn declares:\nWords soar like dragons before them,\ndeeds limp like rags behind.\nThough immortality remains unachieved,\nkarmic deeds are already set.\nLustful as wild birds,\nlecherous beyond mountain beasts—\nif your heart remains that of a beast,\ndo not dream of heaven’s favor.\n\nWhen first embarking on the path,\nburning incense and making vows,\nseeking masters and inquiring of the Dao—\nall those fine words spoken,\nyet when put to the test, they fail to fit.\nThe mouth does not match the heart.\nThough I might explain the wondrous Dao,\nreveal the celestial mechanism,\nI thought you a man I had nurtured,\nonly to find you but a common being.\nNow, having barely grasped some minor dharma,\nyou grow slick and crafty,\nmocking others with poetry and verse,\nyour heart filled with cunning,\nyour intent devoid of kindness,\nboasting of your own superiority,\nestablishing your own sect.\nAmong the Daoists of this world,\nhow can such \"worthy gentlemen\"\nnot provoke cold laughter?\n\nDay after day, they deceive heaven and earth,\nbetray righteousness, forsake loyalty,\nturn kindness into resentment,\nboast of sudden enlightenment,\nclaiming their hearts have opened,\ncursing masters, reviling ancestors—\nall without a trace of wrongdoing.\nDo not speak of \"no wrongdoing\"—\njust try to provoke them,\nand see how they drag you before the magistrate,\nready to thrash your donkey’s hide.\n\nKnow this:\nthe lives of all people\nare moved by the great Dao,\nwhich silently observes their good and evil.\n\nThe scripture says:\nThe net of heaven is vast,\nloose yet never failing.\nBehold the present world—\nbeauty and ugliness,\nwealth and nobility,\npoverty and lowliness—\nall stem from seeds sown in past lives.\nYou claim to have grasped the celestial mechanism,\nasserting all things are without hindrance,\nyet one day, heaven’s punishment will come,\nstriking you deaf, blind, lame, and crippled.\nIn such a state, how will you transform?\nHow will you apply the Dao?\n\nWithout merit or practice,\nyou dare seek to become an immortal—\nyet I fear you will not comply,\ndefying heaven and earth,\nacting in secret without kindness,\nindulging in lust, coveting gain,\nbreaking precepts, violating vows.\nWith such deeds and sins,\none day heaven will break your heels,\ncondemning your corpse to the underworld’s lash,\nendless remorse without end.\n\nI bestow upon you this karmic mirror,\nonly to see you later as a painted-brow insect,\na monstrous being with a human body and beastly face,\nprovoking laughter and shame.\nDare not speak of the Dao or discuss cultivation,\nfor if you do not believe now,\ntime will reveal the truth to all.\n\nA hymn declares:\nThose who study the Dao without resolve\nmerely wield clever tongues.\nEver restless as a galloping horse,\never unruly as a mischievous ape,\nlurking with lustful demons in secret,\nboasting of purity before others.\nWith such deep karmic retribution,\none day heaven’s judgment will fall.\n\nDaoists,\nsuch beings seek the truth\nwith the heart of one who murders masters and fathers,\nturn from the Dao\nwith the intent of a lecher who defiles kin.\nWhy is this so?\nHaving sought the truth and obtained the dharma,\nthey return to harbor resentment,\ngratitude forgotten,\ngrudges ever in mind—\nis this not the malice of one who murders masters and fathers?\n\nThough they study the Dao,\nif greed and love remain unsevered,\nlustful thoughts unremoved,\nconstantly behaving with the understanding of swine and dogs,\nacting with the manners of oxen and donkeys—\nis this not the intent of one who defiles kin?\n\nThe Buddha said:\nAll men are my fathers,\nall women are my mothers.\nWith such conduct,\nhow can they hope to be good people?\nDay after day, they toy with me,\nprovoking my anger,\nyet I remain unmoved.\nWhy unmoved?\nFools are like dung—\nwithout dung, plants and trees cannot grow.\nWithout fools, the wise would not emerge.\n\nYet some beings harass and harm,\nspreading slander and strife,\nboasting of their own cleverness.\nSo you, too, are clever,\nhaving learned some minor dharma.\nAble to gallop about,\nstealing a phrase or two,\nthey wield it like a blade to behead—\nknow that kindness arises from harm.\n\nA hymn declares:\nBestowing kindness breeds harm,\ncompassion turns to enmity.\nMorning to night, lost in wine and lust,\nday after day, craving rank and foul.\nBorrowing another’s fire,\nyet failing to extinguish one’s own smoke.\nI urge you: abandon cunning,\nfor the blue heavens watch and reflect.\n\nThere are those who,\nhaving barely obtained the dharma,\nfail to comprehend it,\nyet rush to entrust me with such celestial secrets,\nwarning, \"Do not recklessly transmit this to others.\"\nSoon after, they betray me,\nestablishing their own sects,\nslandering the ancient worthies.\nKnow this:\nit is better to strangle one than to teach one,\nfor such unprincipled conduct\nis but a hammer for hell’s foundation.\n\nBefore they can cultivate the Dao,\nthey first commit sins,\neven selling the Dao for a living,\nhoarding dharma for sustenance.\nTea comes, tea-talk;\nwine comes, wine-words.\nGathering in twos and threes,\nthey gossip and criticize,\ndiscussing others’ strengths and flaws,\nnever reflecting on their own.\nThat lifeless body of yours—\nwhere will it tumble when it falls?\nAt every turn, your face shifts like a monkey’s.\n\nThe Dao is thus—yet in all this, nothing is accomplished. How can one be so frivolous, yet still insist on becoming an immortal? Rare is the one unmoved by the eight winds; even in silence, you come to vex me with such stifling gloom.\n\nWith such madness and inversion, the wild heart unchecked, desire unsevered—you are like a wingless bee, flitting from sweetness to sweetness, limbs entangled, unable to right yourself. You stumble on level ground, then shift the blame: *\"Fate did not favor me, this life was not meant for profit.\"* Have you not heard the ancients say: *\"Heaven and earth care not for all things—one seeks death, not life.\"*\n\nWhen urged toward immortality, you claim it is all predestined fate, that you lack the fortune. Yet you forget: every person has their share, each is perfectly luminous. The scripture says: *\"Abide in non-desire to perceive its mystery; abide in desire to perceive its manifestations.\"* Desire and non-desire—both arise from the human heart. This is called *\"same origin, different names.\"* Different—each distinct. Why is this so?\n\nAbide ever in non-desire to still the heart, thereby opening the Heavenly Eye to recognize the wondrous awareness of the numinous void—your spirit-chamber radiant, solitary and whole, drifting beyond the world of forms. Transformed into a luminous-eyed celestial immortal, this is what it means to say: *\"Every person has their share, each is perfectly luminous.\"*\n\nDisciples of the Dao, let me present you with a case for immortal cultivation. Do not harbor disbelief; examine it closely. If you fail to complete it in this life, do not hope for the next. Should you return, you may find yourself tangled in some unknown stable’s trough, wallowing in filth. Have you not heard: *\"To lose the human form is to be barred for ten thousand kalpas\"*? If you still doubt, go where none can see, clasp your hands, and ponder deeply.\n\n**Verse:**\nWith eloquent words you speak of merit,\nYet dwell ever amid wine and sensuality.\nUnversed in the sacred teachings,\nYou establish your own sect’s ways.\nYour nature stained by red dust,\nYour body trapped in the fiery household.\nOne misguided thought at death’s door,\nAnd you plunge forever into the abyss of emptiness.\n\nDisciples, how many among you truly practice the Dao, severing ties of kinship and love? Day by day, you are like a stray donkey, leaving no trace on the shore, loitering around the monastery, clamoring and quarreling, tongues wagging, flailing in chaos, indulging in reckless abandon, vying over self and others. Yet when questioned, you fall silent, feigning virtue, saying nothing of substance—merely winning an empty reputation, grand in appearance but hollow, even if you were to ram heaven and earth, nothing would be seen.\n\nSpeak not of your *\"original face\"*—what is this *\"original face\"* of yours? A blind beast, nothing more. Before you lies a path to liberation, yet you refuse to seek it, instead deceiving and confusing others. Though your body has left the household life, your heart remains entangled in worldly thoughts. In the presence of others, you posture and perform; when alone, you sigh in secret. With such weak resolve and indecision, you are like a muddy sow, dragging filth behind you, neither capable nor swift, mumbling and stammering. How can you not squander the offerings of the ten directions’ patrons? What will you repay them with in the end?\n\nYou have but one recourse: to pull the plow or bear the yoke—this will be your karmic retribution in the next life. Yet when scolded, you retort: *\"A single child leaving home brings offerings from all the heavens.\"* Disciples, to practice the Dao with such a heart is like painting a cake—shameless. You flaunt your so-called cultivation, claiming *\"no words, no teachings,\"* but who told you this? You shiftless wretch, what did you accomplish the day you left home? Have you no care for your own nature and life, so quick to believe others’ words?\n\nIf *\"no words, no teachings\"* is the way, then the entire *Great Treasury of Scriptures* is but a deception. The Most High said: *\"I attained the true Dao not by nature alone, but through learning.\"* Lord Lü said: *\"Without a teacher’s guidance, this matter is difficult to know.\"* If there are no words, no transmission, then the sages of antiquity were also liars. You claim *\"non-action and purity\"* as cultivation, yet Master Leran said: *\"Non-action and purity are two cartloads of dung.\"* If you deny they are dung, then your entire body—from head to toe—is but a heap of foul, maggot-ridden filth.\n\n**Ancient Verse:**\nThe upper orifices—eye gunk and phlegm,\nThe middle orifices—mucus and saliva,\nThe lower orifices—feces and urine.\nEssence, fluids, blood, flesh,\nBones, skin, hair—are these not filth, maggot-food?\n\nYet you speak of *\"true purity in cultivation.\"* True purity is the lofty, boundless Great Mystery, still and formless. True purity is the luminous Dharma-eye, casting off the false to return to the real, recognizing the original luminous pearl of spirit, exchanging the mortal coil for the immortal, shedding the impure bones. Your body becomes like empty space, your nature like the sun and moon—this is called purity. All filth cannot defile it.\n\nAs for *\"non-action,\"* what non-action do you guard? Each day you are like a pile of chaff. Now you sit in meditation, face twisted in anger, dredging up idle thoughts from a thousand years past, your mind a clamor. Yet you still claim *\"non-action.\"* Throughout the twelve hours—hauling firewood, carrying water, dressing, eating, walking, sitting, lying down—how is any of this non-action? Even your bowels and bladder press upon you, and soon you rush to the dung heap. This is not non-action.\n\nTrue non-action is to recognize the solitary, numinous awareness beyond the world, the celestial truth—bright as the blazing sun, radiant as the autumn moon, illuminating heaven and earth with crystalline clarity, unstained by dust. Only when you grasp this teaching can you be called *\"pure and non-active.\"* Ignorant of the sages’ true meaning, you mistake laziness for cultivation, like a boundary marker—neither pulled forward nor pushed back. You shiftless wretch, so dull and weak, unable to discern truth from falsehood. I reckon even heaven has no use for such inept immortals.\n\n**Verse:**\nWhere is the true treasure?\nVainly you boast and tangle in vines.\nKnowing only the nest of the sparrow,\nHow could you see the whale or roc?\nShort in conduct, you brag of cunning,\nYour merits undone by self-praise.\nWithout deceit, your evil karma\nWould not multiply ten thousandfold.\n\nThen there are those who stray even further from reason, like solitary herbs in the monastery. No comings or goings, doors sealed each day. When a patron arrives with alms, you scurry to greet them, nimble as a monkey, yet dare to show no reverence to the Perfected Ones. To all wise and discerning gentlemen of the ten directions: when you later encounter such clueless fools, kick them to the ground, split their noses with wooden pegs, pry open their donkey lips to pour in thin excrement, then flush them with urine—such beings, so estranged from true principle, defile the Perfected Ones.\n\nThe Ode says:\nA flock of mortals blindly throngs,\nChasing waves into the muddy ford.\nThey slight the Lord of Darkest Mystery,\nDefile the Most High with meat and wine.\nUnclear of the true and proper teaching,\nThey delude themselves and enter deviant gates.\nIn death they suffer the ceaseless torments,\nTheir bodies pierced by ten thousand swords.\n\nO Daoist assembly, it is not that I lack compassion—it is that you lack humaneness, and so I rage against you. It is that you possess the perception of beasts, and so I treat you as mere creatures.\n\nNow I earnestly exhort you to avoid future sorrow. Bitter words are good medicine; harsh speech is loyal advice. Why is this so? Good words are not sweet; sweet words are not good. Those who embrace true goodness gain the blessings of Heaven; those who commit the gravest evil suffer the torments of Hell. The tally of karmic offenses is clear—it all depends on what one does. In the pursuit of the Dao, hesitation is fatal: one stroke severs all, as cleanly as a blade through iron. Turn your heart, awaken, and become a carefree, unbound wanderer.\n\nConsider the gravity of life and death. Even if you have children and grandchildren in throngs, gold and silver filling your storehouses, in the end it all comes to nothing. This treasure of life cannot be bought with wealth, nor can this matter of life and death be taken on by one’s children. Like climbers on a steep slope, each must strive for themselves. Be sincere and cautious, banish all doubt, accumulate merit and deeds, sever the deviant and uphold the true, refine the spirit to merge with the Dao, until the Dao unites with the spirit in truth. Utmost mystery, utmost wonder, utmost purity, utmost subtlety—exhaust all effort in this. Such is the essential path of cultivating practice and studying immortality.\n\nThe Ode says:\nEyes strain to see children and grandchildren,\nGold and silver fill the storehouse.\nBut when the hour of life and death arrives,\nBoth matters dissolve into emptiness.\nHearken early to seek the true path,\nOpen the eye of wisdom to see clearly.\nThe radiance of spirit shines bright as the sun,\nSoaring to the Palace of Supreme Numinosity.\n\nAnother Ode says:\nAll rests in the Primordial Ancestor,\nAll returns to the Most High’s school.\nEvery head receives its mandate,\nEvery thing connects in mutual resonance.\nIt embraces the image of Qian’s origin,\nContains the great beginning within.\nTo fathom the ancient root,\nRecognize the Palace of Fivefold Clarity.\n\nThe *Mirror of Supreme Clarity’s Admonitions and Warnings* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清太玄鉴诫论 经名：上清太玄鉴诫论。 金侯善渊撰。 一卷。 底本出处：《正统道藏》太平部。 上清太玄鉴诫论 姑射山神居洞太玄子撰 颂曰 直言至诀贞，何必惧人情。 指引清凉路，提携业火坑。 不图君子重，孰怕小儿轻。 语默依天理，忠心话普平。 夫大道寂寂无形，寥寥无象，元和混太始之先，玄微禀天地之外，自然虚无，生从有象。 象感杳冥之中，法至空寂之理，真气变真，真精变神，神真合道。 道者，一也。 一生二，二生三，三生万物。 万物之中，﹝人﹞最灵最贵，贵在修真。 真者，常也。 为人日用而不知。 知者，至在人之心也。 心者，兑中之神是也。 神中有真，真本圆明，性从清净，随情错乱，背反正真。 不念你生从何来，死归何去，且过去事休思，未来事莫想，你不明。 取现前一着，管交你脱脱洒洒，露露堂堂地，做个分明底汉。 天地不收，鬼神不管，身若太空，性同无侣，在阳而不焦，托阴而不腐，水火不能害，山海无由阻，通天透地，穿金贯石，孤然自在，独体逍遥，变个日月光明，便是圆满法身。 如此者，知其实也，未兔迁途，终身有悮。 全其圣功，可以超生出死。 何以故？",
      "translated_text": "**The Supreme Clarity Treatise on the Great Mystery’s Mirror of Admonitions**\n\n*Scripture Title:* *The Supreme Clarity Treatise on the Great Mystery’s Mirror of Admonitions*\n*Composed by Jin Hou Shanyuan*\n*One fascicle*\n*Source of the base text:* *Daoist Canon of the Orthodox Unity Tradition, Supreme Peace Section*\n\n---\n\n**The Supreme Clarity Treatise on the Great Mystery’s Mirror of Admonitions**\n*Composed by the Divine Dweller of Guye Mountain, the Cavernous Master of the Great Mystery*\n\n**Eulogy:**\nStraight words hold the ultimate truth—why fear the judgments of men?\nPointing the way to the path of cool clarity, lifting one from the pit of karmic fire.\nNot seeking the weight of the noble, who fears the scorn of the petty?\nSpeech and silence align with Heaven’s principle; a loyal heart speaks of universal peace.\n\nThe Great Dao is silent and formless, vast and without image.\nPrimal harmony blended before the dawn of the Great Beginning;\nmysterious subtlety endowed beyond Heaven and Earth.\nNaturally empty and without, life arises from the realm of form.\nWithin the profound obscurity of sensed images, the law adheres to the principle of utter stillness.\nTrue qi transforms into truth, true essence transforms into spirit;\nspirit and truth unite with the Dao.\n\nThe Dao is One.\nOne gives rise to Two, Two gives rise to Three, Three gives rise to the myriad things.\nAmong the myriad things, [humankind] is the most numinous and noble—\nnoble in the cultivation of truth.\nTruth is constancy.\nYet in daily life, people remain unaware.\nAwareness resides in the heart of the human.\nThe heart is the spirit within the Gate of Joy.\nWithin the spirit lies truth, truth’s root is perfect clarity.\nNature arises from purity, yet follows emotions into disorder,\nturning away from right and true.\n\nYou do not reflect on whence you came in life, nor whither you go in death.\nLet go of thoughts of the past, cease pondering the future—\nyou remain in the dark.\nSeize the present moment, and it will grant you\nunfettered ease, radiant and unobstructed,\nto become a person of clarity.\nNeither Heaven nor Earth can claim you, ghosts and spirits have no jurisdiction.\nYour body like the great void, your nature without peer.\nAbiding in yang yet unscorched, dwelling in yin yet uncorrupted.\nWater and fire cannot harm you, mountains and seas cannot bar your way.\nYou penetrate Heaven and Earth, pierce metal and stone.\nSolitary and self-contained, your singular form roams free.\nTransforming into the radiance of sun and moon,\nyou become the perfect Dharma-body.\n\nThose who attain this know its reality.\nWithout straying from the path, they avoid lifelong error.\nPreserving the sagely work in full,\nthey transcend life and escape death.\nWhy is this so?",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 461,
      "start_sentence": 0,
      "end_sentence": 27,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.334996223449707,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\上清太玄鉴诫论.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "如铜铁铸像，须用范模。 若以修仙，须凭师匠，指诀玄机，分明主客、动静、清浊、升降、浮沉、三要内外，有无此法者，混而归一。 至在清净修炼，莫不向有为中作。 得此法妙机，由然有碍。 玄微妙法，不可乱说，略而言之，临危一着，认取规中大小细微，辨正无差，至死终身无碍。 若依此法，后付天机。 太上曰：见小曰明。 又曰：死而不亡谓之寿。 平叔曰：毫发差殊不结丹。 又曰：共神仙子细论，你却莫道，妄言惑众，随人生死，悮人性命。 若有如此之心，天地不佑，左眼滴脓，右眼滴血，锉身万段，永堕酆都，世不受生。 有一等钝根浅智，心生不信，竞起人我，暗地裹说是说非，知他那裹偷得一两句迷言谜语，皂黑角裹转转地惑人，自己不行劝人清净，常作畜生行当，吃草见识，酒色财气不除，悭贪嫉妬不断。 每日家中偎妻抱子，游言野语，岂能成其正觉。 若不真履实践，岂不误了前程。",
      "translated_text": "Just as casting bronze or iron statues requires a mold,\nso too does the cultivation of immortality depend on a master.\nTheir finger-pointings and profound mechanisms\nclearly distinguish host and guest, movement and stillness,\npurity and turbidity, ascent and descent, floating and sinking—\nthe three essentials within and without.\nWhere this method exists, all merges into oneness.\n\nIn the midst of pure and tranquil cultivation,\nnothing is not done within the realm of activity.\nYet grasping this wondrous mechanism\nnaturally entails obstacles.\nThe subtle and marvelous method cannot be recklessly spoken;\nin brief, at the critical moment,\ndiscern the great and small, the fine and minute within the compass,\ndistinguishing correctly without error,\nso that even unto death and throughout life, no hindrance remains.\n\nShould one follow this method,\nthe celestial mechanism shall be transmitted thereafter.\nThe Most High said: *\"To see the small is called clarity.\"*\nAnd again: *\"To die yet not perish is called longevity.\"*\nMaster Pingshu said: *\"Even a hair’s deviation fails to form the elixir.\"*\nAnd further: *\"Discuss it in detail with the immortals,\nbut do not speak carelessly to delude the masses,\nleading others into the cycle of birth and death,\nand thus misleading their very lives.\nIf such a heart exists within you,\nHeaven and Earth will not protect you.\nYour left eye shall weep pus, your right eye blood;\nyour body shall be severed into ten thousand pieces,\nforever cast into Fengdu,\nnever to receive rebirth in the world.\"*\n\nThere are those of dull roots and shallow wisdom\nwho harbor disbelief, fostering strife between self and others.\nIn secret, they spread praise and slander,\nhaving pilfered a phrase or two of cryptic words,\ntwisting them in black and white to confuse others.\nThey themselves do not practice, yet urge others toward purity,\nall while behaving like beasts—\ntheir understanding fit only to graze,\nclinging to wine, lust, wealth, and temper,\nunable to sever stinginess, greed, jealousy, or envy.\nDay after day, they cling to wives and children,\nindulging in idle chatter and vulgar speech—\nhow can they ever attain true awakening?\nWithout treading the path in truth and practice,\nhow can they not ruin their future?",
      "overlap_context": "ched, dwelling in yin yet uncorrupted.\nWater and fire cannot harm you, mountains and seas cannot bar your way.\nYou penetrate Heaven and Earth, pierce metal and stone.\nSolitary and self-contained, your singular form roams free.\nTransforming into the radiance of sun and moon,\nyou become the perfect Dharma-body.\n\nThose who attain this know its reality.\nWithout straying from the path, they avoid lifelong error.\nPreserving the sagely work in full,\nthey transcend life and escape death.\nWhy is this so?",
      "start_char": 461,
      "end_char": 816,
      "start_sentence": 28,
      "end_sentence": 41,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.715906381607056,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\上清太玄鉴诫论.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "颂曰 嫉妬转生嗔，邪淫性不仁。 朝朝贪利路，日日恋红尘。 猪狗常为伴，狐狸日夜亲。 色心犹未断，何幸论天真。 道众欲要修仙，须凭慷慨，一刀两段，割爱离亲，除情去欲，损念忘机，冰清玉洁，一志无疑，参师访道，志诚坚修。 太上曰：虽有荣观，燕处超然。 超然者，远避不居也。 又经曰：但凡修道，避静深山幽玄石洞，绝於鸡犬，断却是非，一心内觅，无劳外求。 是谓诸念不生，万缘不染，方可做个出家儿，便是个无碍底闲人道众。 自古至今，也无一个偎妻成道，抱子登仙。 余今劝你，却然忿怒，常当发火，却言列子在家成道时。 不晓事汉，列子是大圣人，也在家为隐士，你莫待也做个隐士去也。 颂曰 说者飞龙前，行之跛氅后。 修仙果未成，作业功先就。 贪淫似野禽，好色过山默。 当作畜生心，勿思天地佑。 当本之日，烧香发愿，求师访道也。 人言人语说得来，觅缝不着，元来口头不似心头。 便教我与他说开妙道，凿破天机。 我也唤则是个人养底汉，却元来是个众生，如今稍悟得些小法度，便早滑头捏怪，把他人便着诗词嘲拨，心生狡行，意作不仁，多能己胜，自立门风。 道众世中有这般贤士，怎不教人冷笑。 更每日间瞒天昧地，背义负心，恩返生怨，自夸顿悟，道我心开，骂师呵祖，并无罪过。 休道无罪过，你且试触着，这管交你大人厅下，看打你那驴孔也。 无不道人之性命，皆因大道所运，暗察人之善恶。 经云：天网恢恢，疏而不失。 你见今世好丑、富贵、贫贱，所因前世修种到来。 你早道了达天机，却道诸事无碍，有日天罚，教你耳聋眼瞎瘫尰，似恁地如何转变，怎生体用。 全无功行，便早要做神仙，却怕你不肯，违天负地，暗地不仁，贪色好讨，破戒犯愿。 似恁地作业造罪，有日天开跟折，罚你那死尸管下稍，懊无尽期。 我为你授了这业积累观子满，后教你那画眉虫、养个人身兽面底怪物，却教人擘口笑时着惭么。 更不敢论道说修行，怕你不信时，久后交人识看着。 颂曰 学道无刚烈，空将巧论舌。 常存意马颠，每使心猿劣。 暗地色情魔，人前夸净洁。 亏心业报深，有日天公折。 道众，此等众生，求真有杀师害父之心，背道有淫亲污戚之意。 何以故？ 求真问道得法，返生冤报，恩不挂怀，怨常在念，岂不是杀师害父之邪。 既然学道，贪爱不断，色心不除，常作猪狗见识，牛驴行当，岂不是淫亲污戚之意。 佛言一切男儿是我父，一切女人是我母。 似恁这般作为，更望做好人，每日家由更玩弄我，你待恼我，我更不愀，何为不愀？ 愚辈似粪土之为，若无粪土，草木不生。 若无愚辈，贤人不发。 被一等众生厮恼厮害，说是说非，更早自夸伶利，是则你也伶利，会得些小法也。 能驰骋偷得一两句言语，便使灭门断头，可知道恩生於害。 颂曰 布惠恩生害，慈悲返作冤。 朝朝迷酒色，日日恋腥膻。 又取他人火，不除自己烟。 劝君休狡佞，照鉴有青天。 更有得法一等，才时得法，未能解悟、却早到付嘱我如此天机，不可乱传与人，及至背我，他早别立门风，毁谤先贤。 可知道教成一个，不如拾杀一个，似这般没前程行当，岂不是打地狱底朴子。 未能修行学道，早先作业造罪，更兼卖道为生，积法求食，茶来茶言，酒来酒语，两两三三，一攒一簇，更说是说非，道人长短，却不自斟酌，那死人身躯，到哩哩呿去攧地，动不动变了猴狲脸。",
      "translated_text": "A hymn declares:\nJealousy turns to wrath in rebirth,\nlewdness strips the heart of kindness.\nDay by day, they chase the path of profit,\nhour by hour, they cling to the red dust.\nSwine and dogs remain their constant companions,\nfoxes and raccoons their nightly kin.\nIf lustful thoughts remain unsevered,\nhow dare they speak of celestial truth?\n\nAll Daoists who seek immortal cultivation\nmust rely on resolute generosity—\na single blade, two clean cuts,\nsevering love, parting from kin,\ndispelling passion, forsaking desire,\ndiminishing thoughts, forgetting schemes,\npure as ice, flawless as jade,\nsingle-minded and unwavering.\nSeek masters, inquire of the Dao,\ncultivate with steadfast sincerity.\n\nThe Most High has said:\nThough surrounded by splendor,\ndwell in transcendent ease.\n\"Transcendent ease\" means to distance oneself and not reside therein.\n\nAnother scripture states:\nFor those who cultivate the Dao,\nseclusion in deep mountains and secluded grottoes,\ncut off from fowl and hound,\nsevering right and wrong,\nturning the mind inward—\nno need for external seeking.\nOnly when all thoughts cease to arise,\nall entanglements remain unstained,\ncan one become a true renunciant,\na carefree person of the Dao.\n\nFrom ancient times to the present,\nnever has one clung to a wife and attained the Dao,\nnor embraced a child and ascended as an immortal.\nNow I admonish you:\nrestrain your anger,\nfor it constantly kindles fire.\nYet some cite Liezi, who attained the Dao while at home.\nFools who know not the truth—\nLiezi was a great sage,\na recluse in his own home.\nDo not think you, too, can become a recluse.\n\nA hymn declares:\nWords soar like dragons before them,\ndeeds limp like rags behind.\nThough immortality remains unachieved,\nkarmic deeds are already set.\nLustful as wild birds,\nlecherous beyond mountain beasts—\nif your heart remains that of a beast,\ndo not dream of heaven’s favor.\n\nWhen first embarking on the path,\nburning incense and making vows,\nseeking masters and inquiring of the Dao—\nall those fine words spoken,\nyet when put to the test, they fail to fit.\nThe mouth does not match the heart.\nThough I might explain the wondrous Dao,\nreveal the celestial mechanism,\nI thought you a man I had nurtured,\nonly to find you but a common being.\nNow, having barely grasped some minor dharma,\nyou grow slick and crafty,\nmocking others with poetry and verse,\nyour heart filled with cunning,\nyour intent devoid of kindness,\nboasting of your own superiority,\nestablishing your own sect.\nAmong the Daoists of this world,\nhow can such \"worthy gentlemen\"\nnot provoke cold laughter?\n\nDay after day, they deceive heaven and earth,\nbetray righteousness, forsake loyalty,\nturn kindness into resentment,\nboast of sudden enlightenment,\nclaiming their hearts have opened,\ncursing masters, reviling ancestors—\nall without a trace of wrongdoing.\nDo not speak of \"no wrongdoing\"—\njust try to provoke them,\nand see how they drag you before the magistrate,\nready to thrash your donkey’s hide.\n\nKnow this:\nthe lives of all people\nare moved by the great Dao,\nwhich silently observes their good and evil.\n\nThe scripture says:\nThe net of heaven is vast,\nloose yet never failing.\nBehold the present world—\nbeauty and ugliness,\nwealth and nobility,\npoverty and lowliness—\nall stem from seeds sown in past lives.\nYou claim to have grasped the celestial mechanism,\nasserting all things are without hindrance,\nyet one day, heaven’s punishment will come,\nstriking you deaf, blind, lame, and crippled.\nIn such a state, how will you transform?\nHow will you apply the Dao?\n\nWithout merit or practice,\nyou dare seek to become an immortal—\nyet I fear you will not comply,\ndefying heaven and earth,\nacting in secret without kindness,\nindulging in lust, coveting gain,\nbreaking precepts, violating vows.\nWith such deeds and sins,\none day heaven will break your heels,\ncondemning your corpse to the underworld’s lash,\nendless remorse without end.\n\nI bestow upon you this karmic mirror,\nonly to see you later as a painted-brow insect,\na monstrous being with a human body and beastly face,\nprovoking laughter and shame.\nDare not speak of the Dao or discuss cultivation,\nfor if you do not believe now,\ntime will reveal the truth to all.\n\nA hymn declares:\nThose who study the Dao without resolve\nmerely wield clever tongues.\nEver restless as a galloping horse,\never unruly as a mischievous ape,\nlurking with lustful demons in secret,\nboasting of purity before others.\nWith such deep karmic retribution,\none day heaven’s judgment will fall.\n\nDaoists,\nsuch beings seek the truth\nwith the heart of one who murders masters and fathers,\nturn from the Dao\nwith the intent of a lecher who defiles kin.\nWhy is this so?\nHaving sought the truth and obtained the dharma,\nthey return to harbor resentment,\ngratitude forgotten,\ngrudges ever in mind—\nis this not the malice of one who murders masters and fathers?\n\nThough they study the Dao,\nif greed and love remain unsevered,\nlustful thoughts unremoved,\nconstantly behaving with the understanding of swine and dogs,\nacting with the manners of oxen and donkeys—\nis this not the intent of one who defiles kin?\n\nThe Buddha said:\nAll men are my fathers,\nall women are my mothers.\nWith such conduct,\nhow can they hope to be good people?\nDay after day, they toy with me,\nprovoking my anger,\nyet I remain unmoved.\nWhy unmoved?\nFools are like dung—\nwithout dung, plants and trees cannot grow.\nWithout fools, the wise would not emerge.\n\nYet some beings harass and harm,\nspreading slander and strife,\nboasting of their own cleverness.\nSo you, too, are clever,\nhaving learned some minor dharma.\nAble to gallop about,\nstealing a phrase or two,\nthey wield it like a blade to behead—\nknow that kindness arises from harm.\n\nA hymn declares:\nBestowing kindness breeds harm,\ncompassion turns to enmity.\nMorning to night, lost in wine and lust,\nday after day, craving rank and foul.\nBorrowing another’s fire,\nyet failing to extinguish one’s own smoke.\nI urge you: abandon cunning,\nfor the blue heavens watch and reflect.\n\nThere are those who,\nhaving barely obtained the dharma,\nfail to comprehend it,\nyet rush to entrust me with such celestial secrets,\nwarning, \"Do not recklessly transmit this to others.\"\nSoon after, they betray me,\nestablishing their own sects,\nslandering the ancient worthies.\nKnow this:\nit is better to strangle one than to teach one,\nfor such unprincipled conduct\nis but a hammer for hell’s foundation.\n\nBefore they can cultivate the Dao,\nthey first commit sins,\neven selling the Dao for a living,\nhoarding dharma for sustenance.\nTea comes, tea-talk;\nwine comes, wine-words.\nGathering in twos and threes,\nthey gossip and criticize,\ndiscussing others’ strengths and flaws,\nnever reflecting on their own.\nThat lifeless body of yours—\nwhere will it tumble when it falls?\nAt every turn, your face shifts like a monkey’s.",
      "overlap_context": "ting them in black and white to confuse others.\nThey themselves do not practice, yet urge others toward purity,\nall while behaving like beasts—\ntheir understanding fit only to graze,\nclinging to wine, lust, wealth, and temper,\nunable to sever stinginess, greed, jealousy, or envy.\nDay after day, they cling to wives and children,\nindulging in idle chatter and vulgar speech—\nhow can they ever attain true awakening?\nWithout treading the path in truth and practice,\nhow can they not ruin their future?",
      "start_char": 817,
      "end_char": 2125,
      "start_sentence": 42,
      "end_sentence": 97,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.00314903259277,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\上清太玄鉴诫论.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "道罢了，却没一事，似恁么不乾重，更由自要作神仙。 难得你八风吹不动，待不语来，和我一场憋闷。 似恁么颠之倒怪，狂心不除，色心不断，真似没趐翎底蜜蜂儿，一甜来，两甜去，被他糊倒脚手，整理不得，平地上吃一交，没奈何推道命不中役转利汉。 岂不闻古人言云：万事不干天与地，自家求死不求生。 及至劝着言道神仙，皆是宿缘，自己无福，却不道人人有分，个个圆明。 经云：常无欲以观其妙，常有欲以观其徼。 有欲无欲，皆是人之心也。 是谓同出而异名。 异者，各异也。 何以故？",
      "translated_text": "The Dao is thus—yet in all this, nothing is accomplished. How can one be so frivolous, yet still insist on becoming an immortal? Rare is the one unmoved by the eight winds; even in silence, you come to vex me with such stifling gloom.\n\nWith such madness and inversion, the wild heart unchecked, desire unsevered—you are like a wingless bee, flitting from sweetness to sweetness, limbs entangled, unable to right yourself. You stumble on level ground, then shift the blame: *\"Fate did not favor me, this life was not meant for profit.\"* Have you not heard the ancients say: *\"Heaven and earth care not for all things—one seeks death, not life.\"*\n\nWhen urged toward immortality, you claim it is all predestined fate, that you lack the fortune. Yet you forget: every person has their share, each is perfectly luminous. The scripture says: *\"Abide in non-desire to perceive its mystery; abide in desire to perceive its manifestations.\"* Desire and non-desire—both arise from the human heart. This is called *\"same origin, different names.\"* Different—each distinct. Why is this so?",
      "overlap_context": "han to teach one,\nfor such unprincipled conduct\nis but a hammer for hell’s foundation.\n\nBefore they can cultivate the Dao,\nthey first commit sins,\neven selling the Dao for a living,\nhoarding dharma for sustenance.\nTea comes, tea-talk;\nwine comes, wine-words.\nGathering in twos and threes,\nthey gossip and criticize,\ndiscussing others’ strengths and flaws,\nnever reflecting on their own.\nThat lifeless body of yours—\nwhere will it tumble when it falls?\nAt every turn, your face shifts like a monkey’s.",
      "start_char": 2125,
      "end_char": 2344,
      "start_sentence": 98,
      "end_sentence": 107,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.2428812980651855,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\上清太玄鉴诫论.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "常以无欲静心，明开天眼，认取灵虚妙觉，神室光明，孤然独体，物外飘飘，化个莹目天仙，便是人人有分，个个圆明。 道众，我与你做个修仙的公案，勿生不信，子细推寻。 今生不了，莫望来生。 来则也来裹，知他谁家槽头尾厮溷去邪。 不道一失人身，万劫不复，怕你不信时，没人处托手，心头子细思量去。 颂曰 口辩说其功，常居酒色丛。 未能通圣教，自己立门风。 性染红尘裹，身居火院中。 临危一念错，永劫堕沉空。 道众，然有几个修行，离亲割爱底，每日家由一似浪驴，不着滩迹，巡庵厮哄，斗赀合舌，七颠八倒，放轧九百，争人争我地。 及至问着，不言不语，诈作好人，又全不说一事，空赢得个名字，大争眼底，双撞天地也不见。 更早说本来面目，不道你本来面目，是个甚的物，是瞎畜生。 你眼前放个出路处，不肯寻觅，却捏怪惑人。 身则出家，心常在念，向有人处做身做分，及至没人处，暗地裹却打长出气。 似恁么不刚志，无决断，一似打泥母猪，拖泥带水，不济不溜，唵唵啖啖，岂不虚受了十方施主供养，不道你下稍，着甚填还他。 你则有一法，拽犁□驮，便是你来生因果。 及至骂着，却道一子出家，诸天送供。 道众，似这般心学道，一似画底似，不识羞耻。 由自更卖弄，却道修行，也无言无说，是那个邪畜生说与你来。 没转利汉，你当年之日出家时，勾干个甚么事来。 却不道你性命如何也，便早信人之言。 既道无言无说时，这《大藏经》尽是诳人邪教。 太上曰：吾得真道，非为自然，学而得之。 吕公曰：不因师指，此事难知。 既道无言无授，上古圣人亦是谩语。 又说我清净无为，便是修行。 乐然曰：清净无为，两车粪土。 你既道不是粪土时，你浑身上下尽是一堆臭秽蛆食。 古颂云：上边窍，有眵相，中间窍，有涕唾，下间窍，有屎尿。 精津血肉，觔骨皮毛，屎尿岂不是秽物蛆食。 却不道修行要真清真净。 真清者，太玄高渺，寂湛无形。 真净者，明通法眼，弃假还真，认取本来一点神珠，换释凡胎，弃除浊骨，体若虚空，性同日月，名为清净，一切秽物并不能污染。 若论无为，你守那个无为，每日一似秕谷堆。 今澄身打坐，怒觜脸腮，把积古千年闲事尽都思量起来，心上闹嘈嘈地，更由自说无为。 你及至十二时中，般柴运水，着衣吃饭，行居坐卧，百端动用，怎得无为。 又被大小二便蹙你着，又却早往粪堆头走。 却不道这无为，要认取孤然灵觉，物外天真，明如赫日，光似秋蟾，射乾坤皎然无物，照天地莹净无尘。 若达此教，方可是个清静无为。 不知圣人正义，却学乖慵懒惰，一似分界堠子，牵不向前，推不向后。 没转利汉，不知好弱，不辩邪真，我想算上天，也无这般不伶利底神仙。 颂曰 真宝又何曾，虚脾斗葛藤。 自知巢鴳，岂见海鲸鹏。 行短夸机巧，功亏街己能。 不因多謟诈，恶业万重增。 更有一等不近道理底，庵舍中一似独活草也。 无个来往，见每日家闭门塞户，见个送道粮人来，脚手轻便，荒忙迎接，一似猴狲挐得，更由敢对上真无礼。 告十方聪明伶利底君子，待后来见这般不晓事汉，后脚踏翻地，着裂鼻木纽起驴唇灌些稀屎，然后着尿冲，与此辈众生不通正理，触污上真。",
      "translated_text": "Abide ever in non-desire to still the heart, thereby opening the Heavenly Eye to recognize the wondrous awareness of the numinous void—your spirit-chamber radiant, solitary and whole, drifting beyond the world of forms. Transformed into a luminous-eyed celestial immortal, this is what it means to say: *\"Every person has their share, each is perfectly luminous.\"*\n\nDisciples of the Dao, let me present you with a case for immortal cultivation. Do not harbor disbelief; examine it closely. If you fail to complete it in this life, do not hope for the next. Should you return, you may find yourself tangled in some unknown stable’s trough, wallowing in filth. Have you not heard: *\"To lose the human form is to be barred for ten thousand kalpas\"*? If you still doubt, go where none can see, clasp your hands, and ponder deeply.\n\n**Verse:**\nWith eloquent words you speak of merit,\nYet dwell ever amid wine and sensuality.\nUnversed in the sacred teachings,\nYou establish your own sect’s ways.\nYour nature stained by red dust,\nYour body trapped in the fiery household.\nOne misguided thought at death’s door,\nAnd you plunge forever into the abyss of emptiness.\n\nDisciples, how many among you truly practice the Dao, severing ties of kinship and love? Day by day, you are like a stray donkey, leaving no trace on the shore, loitering around the monastery, clamoring and quarreling, tongues wagging, flailing in chaos, indulging in reckless abandon, vying over self and others. Yet when questioned, you fall silent, feigning virtue, saying nothing of substance—merely winning an empty reputation, grand in appearance but hollow, even if you were to ram heaven and earth, nothing would be seen.\n\nSpeak not of your *\"original face\"*—what is this *\"original face\"* of yours? A blind beast, nothing more. Before you lies a path to liberation, yet you refuse to seek it, instead deceiving and confusing others. Though your body has left the household life, your heart remains entangled in worldly thoughts. In the presence of others, you posture and perform; when alone, you sigh in secret. With such weak resolve and indecision, you are like a muddy sow, dragging filth behind you, neither capable nor swift, mumbling and stammering. How can you not squander the offerings of the ten directions’ patrons? What will you repay them with in the end?\n\nYou have but one recourse: to pull the plow or bear the yoke—this will be your karmic retribution in the next life. Yet when scolded, you retort: *\"A single child leaving home brings offerings from all the heavens.\"* Disciples, to practice the Dao with such a heart is like painting a cake—shameless. You flaunt your so-called cultivation, claiming *\"no words, no teachings,\"* but who told you this? You shiftless wretch, what did you accomplish the day you left home? Have you no care for your own nature and life, so quick to believe others’ words?\n\nIf *\"no words, no teachings\"* is the way, then the entire *Great Treasury of Scriptures* is but a deception. The Most High said: *\"I attained the true Dao not by nature alone, but through learning.\"* Lord Lü said: *\"Without a teacher’s guidance, this matter is difficult to know.\"* If there are no words, no transmission, then the sages of antiquity were also liars. You claim *\"non-action and purity\"* as cultivation, yet Master Leran said: *\"Non-action and purity are two cartloads of dung.\"* If you deny they are dung, then your entire body—from head to toe—is but a heap of foul, maggot-ridden filth.\n\n**Ancient Verse:**\nThe upper orifices—eye gunk and phlegm,\nThe middle orifices—mucus and saliva,\nThe lower orifices—feces and urine.\nEssence, fluids, blood, flesh,\nBones, skin, hair—are these not filth, maggot-food?\n\nYet you speak of *\"true purity in cultivation.\"* True purity is the lofty, boundless Great Mystery, still and formless. True purity is the luminous Dharma-eye, casting off the false to return to the real, recognizing the original luminous pearl of spirit, exchanging the mortal coil for the immortal, shedding the impure bones. Your body becomes like empty space, your nature like the sun and moon—this is called purity. All filth cannot defile it.\n\nAs for *\"non-action,\"* what non-action do you guard? Each day you are like a pile of chaff. Now you sit in meditation, face twisted in anger, dredging up idle thoughts from a thousand years past, your mind a clamor. Yet you still claim *\"non-action.\"* Throughout the twelve hours—hauling firewood, carrying water, dressing, eating, walking, sitting, lying down—how is any of this non-action? Even your bowels and bladder press upon you, and soon you rush to the dung heap. This is not non-action.\n\nTrue non-action is to recognize the solitary, numinous awareness beyond the world, the celestial truth—bright as the blazing sun, radiant as the autumn moon, illuminating heaven and earth with crystalline clarity, unstained by dust. Only when you grasp this teaching can you be called *\"pure and non-active.\"* Ignorant of the sages’ true meaning, you mistake laziness for cultivation, like a boundary marker—neither pulled forward nor pushed back. You shiftless wretch, so dull and weak, unable to discern truth from falsehood. I reckon even heaven has no use for such inept immortals.\n\n**Verse:**\nWhere is the true treasure?\nVainly you boast and tangle in vines.\nKnowing only the nest of the sparrow,\nHow could you see the whale or roc?\nShort in conduct, you brag of cunning,\nYour merits undone by self-praise.\nWithout deceit, your evil karma\nWould not multiply ten thousandfold.\n\nThen there are those who stray even further from reason, like solitary herbs in the monastery. No comings or goings, doors sealed each day. When a patron arrives with alms, you scurry to greet them, nimble as a monkey, yet dare to show no reverence to the Perfected Ones. To all wise and discerning gentlemen of the ten directions: when you later encounter such clueless fools, kick them to the ground, split their noses with wooden pegs, pry open their donkey lips to pour in thin excrement, then flush them with urine—such beings, so estranged from true principle, defile the Perfected Ones.",
      "overlap_context": "aven and earth care not for all things—one seeks death, not life.\"*\n\nWhen urged toward immortality, you claim it is all predestined fate, that you lack the fortune. Yet you forget: every person has their share, each is perfectly luminous. The scripture says: *\"Abide in non-desire to perceive its mystery; abide in desire to perceive its manifestations.\"* Desire and non-desire—both arise from the human heart. This is called *\"same origin, different names.\"* Different—each distinct. Why is this so?",
      "start_char": 2344,
      "end_char": 3574,
      "start_sentence": 108,
      "end_sentence": 157,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.61749076843262,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\上清太玄鉴诫论.txt",
        "category": "正统道藏太平部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "颂曰 苍生谩一群，逐浪入泥津。 挫弱玄元主，荤非太上尊。 不明真正教，自昧入邪门。 死受无间苦，刚锋万剑身。 道众，不是我不慈悲，为你不仁，和我忿外，为你畜生见识，和我待作众生行当。 余今直劝兔你后忧，苦口是良药，逆耳作忠言。 何以故？ 善言不美，美言不善。 直善者获天堂之福，至恶者遭地狱之殃。 罪业分明，至在人为，学道抹捷，一刀两段，斩丁截铁，回心省悟，做个逍遥自在闲人去。 念生死事大，直饶儿女成群，金银满库，到头终是一场落空。 这性命之珍，财帛也买不得。 这生死，儿女也替不得。 如人上坡，各自努力，至诚谨慎，勿生不信之心，积功累行，诀正除邪，炼神合道，道契神真，至玄至妙，至清至微，尽其功焉。 是谓修行学仙之要也。 颂曰 极目见儿孙，金银满库中。 一朝生死到，两事总归空。 闻早寻真路，搜开慧目通。 神光辉日灿，飞上太灵宫。 又颂曰 尽在玄元祖，都归太上宗。 头头皆受命，物物总相通。 包廓乾元象，含容大始中。 欲穷知古蒂，认取五明宫。 上清太玄鉴诫论竟",
      "translated_text": "The Ode says:\nA flock of mortals blindly throngs,\nChasing waves into the muddy ford.\nThey slight the Lord of Darkest Mystery,\nDefile the Most High with meat and wine.\nUnclear of the true and proper teaching,\nThey delude themselves and enter deviant gates.\nIn death they suffer the ceaseless torments,\nTheir bodies pierced by ten thousand swords.\n\nO Daoist assembly, it is not that I lack compassion—it is that you lack humaneness, and so I rage against you. It is that you possess the perception of beasts, and so I treat you as mere creatures.\n\nNow I earnestly exhort you to avoid future sorrow. Bitter words are good medicine; harsh speech is loyal advice. Why is this so? Good words are not sweet; sweet words are not good. Those who embrace true goodness gain the blessings of Heaven; those who commit the gravest evil suffer the torments of Hell. The tally of karmic offenses is clear—it all depends on what one does. In the pursuit of the Dao, hesitation is fatal: one stroke severs all, as cleanly as a blade through iron. Turn your heart, awaken, and become a carefree, unbound wanderer.\n\nConsider the gravity of life and death. Even if you have children and grandchildren in throngs, gold and silver filling your storehouses, in the end it all comes to nothing. This treasure of life cannot be bought with wealth, nor can this matter of life and death be taken on by one’s children. Like climbers on a steep slope, each must strive for themselves. Be sincere and cautious, banish all doubt, accumulate merit and deeds, sever the deviant and uphold the true, refine the spirit to merge with the Dao, until the Dao unites with the spirit in truth. Utmost mystery, utmost wonder, utmost purity, utmost subtlety—exhaust all effort in this. Such is the essential path of cultivating practice and studying immortality.\n\nThe Ode says:\nEyes strain to see children and grandchildren,\nGold and silver fill the storehouse.\nBut when the hour of life and death arrives,\nBoth matters dissolve into emptiness.\nHearken early to seek the true path,\nOpen the eye of wisdom to see clearly.\nThe radiance of spirit shines bright as the sun,\nSoaring to the Palace of Supreme Numinosity.\n\nAnother Ode says:\nAll rests in the Primordial Ancestor,\nAll returns to the Most High’s school.\nEvery head receives its mandate,\nEvery thing connects in mutual resonance.\nIt embraces the image of Qian’s origin,\nContains the great beginning within.\nTo fathom the ancient root,\nRecognize the Palace of Fivefold Clarity.\n\nThe *Mirror of Supreme Clarity’s Admonitions and Warnings* concludes.",
      "overlap_context": ". No comings or goings, doors sealed each day. When a patron arrives with alms, you scurry to greet them, nimble as a monkey, yet dare to show no reverence to the Perfected Ones. To all wise and discerning gentlemen of the ten directions: when you later encounter such clueless fools, kick them to the ground, split their noses with wooden pegs, pry open their donkey lips to pour in thin excrement, then flush them with urine—such beings, so estranged from true principle, defile the Perfected Ones.",
      "start_char": 3575,
      "end_char": 4005,
      "start_sentence": 158,
      "end_sentence": 184,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.508108615875244,
      "metadata": {
        "source_file": "dao\\正统道藏太平部\\上清太玄鉴诫论.txt",
        "category": "正统道藏太平部"
      }
    }
  ]
}