{
  "source_id": "上清三真旨要玉诀",
  "source_file": "chunked_daozang\\上清三真旨要玉诀.json",
  "total_chunks": 14,
  "total_original_chars": 12490,
  "total_translated_chars": 63353,
  "total_translation_time": 334.98013281822205,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清三真旨要玉诀.txt",
    "category": "玉诀类"
  },
  "full_translation": "**The Essential Jade Instructions of the Three Perfected Ones of Supreme Clarity**\n\n*Title:* *The Essential Jade Instructions of the Three Perfected Ones of Supreme Clarity*\n*Author:* Unknown, approximately dated to the Northern and Southern Dynasties. Compiled from early Supreme Clarity School scriptures and oral instructions. Liu Shipei believed this text to be a missing volume of Tao Hongjing’s *Hidden Instructions for Ascending to Perfection*. The original number of fascicles is unknown; two versions survive: (1) Dunhuang manuscript P.2576V, and (2) the *Daoist Canon of the Zhengtong Era*, under the *Jade Instructions* category of the *Cavernous Mystery Division*. Both are incomplete. The present text is a collated reconstruction.\n\n---\n\n**The Essential Jade Instructions of the Three Perfected Ones of Supreme Clarity**\n*(Preceding text missing)*\n\nDon the *Primordial Seamless Robe of Colored Chapters*, hold the essence of the sun in the left hand and the radiance of the moon in the right, and fill the mud-palace of my upper mansion. Thrice invoke the Supreme Treasure Perfected One. The Great Void bestows the five *qi* to flow with essence, refining and observing my body. Swallow the five flavors five times, then raise the head and recite the incantation:\n\n*\"Supreme Perfected Sovereign,\nFive Thearchs of the Great Void,\nGuard my mud-palace,\nMysteriously reflect the five forms.\nThe Three Luminaries shine brightly,\nSun and moon illumine with clarity.\nFlying clouds and flowing auroras\nInfuse and refine jade essence.\nCultivate countenance, preserve the *po*,\nSpirit and soul spontaneously arise.\nA thousand transformations, ten thousand changes,\nAscend to the Purple Court.\"*\n\nWhen finished, guide the *qi* five times and cease.\n\nAfter reciting the five directional invocations, rub the palms and wipe the eyes. After five years of such practice, the face will assume a golden countenance, the five viscera will flourish with blossoms, the jade storehouse will preserve *qi*, and the Dao of immortality will be achieved. The Three Palaces will all be harmonious, the true numina will manifest in form, riding the void and mounting the mist to soar through the Great Empyrean. This must be practiced in secrecy; do not transmit it lightly.\n\nFor those who cultivate the supreme method, reciting it ten thousand times to seek the numinous and attain immortality: on the days of the eight solar terms, inscribe a memorial on the sacred peak of one’s life-destiny and present it to the Jade Clarity. After three years without lapse, one’s name will be recorded in the Azure Palace, registered with the Jade Thearch, attended by jade blossoms, and welcomed by the Golden Dawn. This jade essence true instruction is the treasured scripture of the Thearch-Lord. Whoever obtains this instruction will ascend as an immortal in a calculated number of days. To recklessly divulge the divine text is to invite judgment upon the nine ancestral generations, body destroyed and form extinguished, eternally sealed in the River Source. Only through secret cultivation does the Way not speak falsely.\n\nOn the summer solar term, at the life-destiny peak, face due south at noon. Strike the teeth thirty-two times and softly recite the incantation while looking upward:\n\n*\"Mysterious essence, yang brightness,\nPrimordial Thearch’s numinous power,\nFour seasons, eight *qi*,\nWeave and traverse the celestial warp.\nWhite Prime descends in death,\nPrimordial Florescence infuses life.\nPresent the memorial to the sacred peak,\nRecorded and heard in Jade Clarity.\nSupreme Thearch and August One,\nInscribe the name of the True Self.\nHumbly await imperial decree,\nBody to audience in the Purple Court.\nThe Three Offices and Nine Bureaus,\nNone dare not heed with reverence.\"*\n\nWhen finished, swallow *qi* nine times and cease. Turn north, kneel, and read the memorial incantation as below. Then bury the memorial on a precipitous peak.\n\nOn the autumnal commencement, at noon, face southwest. Strike the teeth thirty-two times and softly recite the incantation while looking upward:\n\n*\"Flowing flames shoot in four directions,\nFlying radiance heralds dawn.\nEight *qi* intermingle and shine,\nAligned with the descent of the celestial warp.\nThe Nine Beginnings announce the morning,\nResponding above to the Thearch’s numen.\nPresent the memorial to the sacred peak,\nEastern Florescence records the name.\nEternally guard the mysterious chamber,\nRevel in the radiance of the Purple Court.\nThe Three Offices and Nine Bureaus\nRank me among the long-lived,\nTo share repose with heaven,\nEternally preserve the Yellow Tranquility.\"*\n\nWhen finished, swallow *qi* nine times and cease. Turn north, kneel, and read the memorial incantation as below. Then bury the memorial.\n\nOn the autumnal equinox, at noon, face west. Strike the teeth thirty-two times and softly recite the incantation while looking upward:\n\n*\"Lesser yin initiates the movement,\nEight paths open and unfold.\nThe Three Images follow in sequence,\nWeaving and traversing the celestial beam.\nThe Primordial Beginning commands rectification,\nHarmonizing the four directions.\nPresent the memorial to the mysterious peak,\nHeard above in Jade Capital.\nThe Supreme Thearch and August One\nInscribe the name in the Flourishing Void.\nThe Three Offices descend in death,\nThe Nine Bureaus follow in prosperity.\nFrom this time onward,\nThe Three Realms will welcome and receive,\nRiding the void, mounting the mist,\nSoaring through the Great Empyrean.\"*\n\nWhen finished, swallow *qi* nine times and cease. Turn north, kneel, and read the memorial incantation as below. Then bury the memorial.\n\nOn the winteral commencement, at noon, face northwest. Strike the teeth thirty-two times and recite the incantation while looking upward:\n\n*\"Mysterious yin governs the morning,\nFour movements revolve heaven.\nEight *qi* intermingle and traverse,\nThree and five complete their cycle.\nThe Thearch issues the decree,\nAuspicious day heralds dawn.\nPresent the name to the Pure Palace,\nTo supplement the imperial ministers.\nReceive heaven’s mandate and follow fate,\nBow in audience before the Jade Dawn.\nNorthern Feng descends in death,\nSouthern Palace records the name.\"*\n\nWhen finished, swallow *qi* nine times and cease. Turn north, kneel, and read the memorial incantation as below. Then bury the memorial.\n\nOn the winter solstice, at noon, face north. Strike the teeth thirty-two times and recite the incantation while looking upward:\n\n*\"Yin essence excites *qi*,\nFeathered dawn rides the darkness.\nTwo radiance descend in alternation,\nRevolving and traversing the celestial warp.\nNine Thearchs move in unison,\nExchanging and adorning true names.\nPresent the memorial to be heard above,\nInscribed and registered in the Jade Court.\nThe Five Peaks and Three Offices\nSecure my life with awe.\nShare radiance with the sun,\nShare tranquility with heaven.\"*\n\nWhen finished, swallow *qi* nine times and cease. Kneel and read the memorial incantation as below. Then bury the memorial.\n\nOn the vernal commencement, at noon, face northeast. Strike the teeth thirty-two times and recite the incantation while looking upward:\n\n*\"Yang essence announces the beginning,\nMysterious *qi* shoots at dawn.\nTwo movements intermingle and shine,\nThree and five return to the true.\nThe Thearch issues the decree,\nRevealing to me the numinous scripture.\nPresent the memorial to the divine peak,\nEternally preserve the flying immortal.\nThe Three Offices and Nine Bureaus\nCross me over the River Source.\nName entered in the Thearch’s register,\nEternally a jade guest.\"*\n\nWhen the incantation is finished, swallow *qi* nine times and cease. Turn north, kneel, and read the memorial incantation as below. Then bury the memorial.\n\nOn the vernal equinox, at noon, face east. Strike the teeth thirty-two times and recite the incantation while looking upward:\n\n*\"Heaven’s essence spreads *qi*,\nVast and pure, flowing with clarity.\nRiding the *wei* to govern the morning,\nRevolving through the five stars.\nYellow Register reflects the soul,\nEastern Florescence preserves life.\nEternally enjoy boundlessness,\nBeginning of kalpas without end.\nPresent the memorial to the Jade Gate,\nNorthern Thearch records the name.\nRoam the mysterious heights,\nFloat in the radiance of Purple Clarity.\"*\n\nWhen finished, swallow *qi* nine times, then turn north, kneel, and read the memorial incantation as prescribed. Then bury the memorial.\n\nOn the day of the summer solstice, at noon, face southeast. Strike the teeth thirty-two times and recite while looking upward:\n\n*\"Eight *qi* interlace and bind,\nAligning positions to dance in heaven.\nFive revolutions, seven turns—\nTransformation arises in an instant.\nThrice refined, ninefold tested,\nForm renewed, years made young.\nCrossing radiant light, enwrapped in glory,\nEternally preserve the highest immortals.\"*\n\nWhen finished, swallow *qi* nine times and cease. Turn north, kneel, and read the memorial incantation as prescribed. Then bury the memorial.\n\nThe Highest Purple Void Jade Sovereign of the Great Cavern’s Three Luminaries, Disciple of the Eastern Peak’s Master of Mystic Stillness, He Xuanming, aged fifty-six, styled Zifangguo, born in the first month, having received the Three Sincerities, respectfully petitions to open the sacred mountains of the Five Peaks, the Three Offices, Nine Bureaus, and Twelve River Sources. This humble servant, Xuan, presents his name to the Jade Clarity in memorial.\n\nInscribe in vermilion on a silver tablet, face north to read it, then bury the tablet beneath the Dark Mystery Crag, ensuring no one discovers it.\n\nFace north, bow twice, kneel, and read the memorial to completion. Then strike the teeth nine times and softly recite the incantation:\n\n*\"Primal Thearch Sovereign,\nHighest Jade Perfected,\nGolden Immortals, Father and Mother,\nJade Florescence, Purple Dawn.\nGovernor of the myriad *qi*,\nInspector of the true, leader of immortals.\nIn the Upper Azure Palace,\nSeal the numinous immortals.\nName fixed in the celestial register,\nPresented before the Thearch.\nReverently open the Nine Bureaus,\nThree Offices, and River Sources.\nName entered in the Azure Register,\nEternally preserved in perpetuity.\"*\n\nWhen finished, bury the memorial.\n\nThese are the plain words and wondrous formulas of the Thearch Lord, transmitted only to those of bone predestined for immortality. At each seasonal node, perform the above rite, completing twenty-four burials of the inscribed tablet in the sacred peaks over three years. Then the True Sovereign will record the name, and the Thearch will assign twelve jade lads and twelve jade maidens. To recklessly divulge this treasure formula is to invite the annihilation of oneself and one’s descendants. Strictly observe the mystic statutes and guard this practice in secrecy.\n\nThe Jade Essence Formula states: Should you conceal your studies and purify yourself in the mountains, on a *ren* or *gui* day, carve the Nine Heavens Jade Script in black on green stone and bury it in the east of your dwelling. At the moment of burial, face east, strike the teeth nine times, and recite:\n\n*\"Green Obscurity, Green Obscurity,\nSpirit Peak of Mount Tai,\nNine *qi* dense with essence,\nEternally numinous in dark mystery.\nThree Fields of indigo waves,\nFour limbs, six eyes—\nPalace of the Highest Perfected,\nProclaimed throughout the four quarters.\nThousand spirits, myriad essences,\nAll submit in reverence.\nThe Jade Thearch commands:\nThose who transgress shall be executed.\"*\n\nWhen finished, bury the stone nine feet deep.\n\nThis is the Thearch Lord’s Jade Script method for subduing spirits, as follows:\n\nThis Jade Script was received by the Heavenly Thearch Lord from the Nine Heavens Venerable of the Nine Heavens. Inscribed in black on green stone and buried east of one’s dwelling mountain, it subdues myriad demons and summons perfected immortals to appear, with jade maidens guarding the form. Guard this secret closely.\n\nThe Jade Essence Formula states: On a *jia* or *yi* day, carve the Nine Heavens Jade Script in green on red stone and bury it south of your dwelling mountain. At the moment of burial, face south, strike the teeth nine times, and recite:\n\n*\"Vermilion Yang essence,\nSouthern Flame of myriad spirits,\nDense mist nurturing the whirlwind,\nDescending into dark obscurity.\nThe Thearch’s palace holds rank,\nFloating life in Yellow Tranquility.\nFrom heaven above,\nDare none fail to heed.\nThose who transgress shall be executed,\nThose who offend shall be punished.\"*\n\nWhen finished, bury the stone nine feet deep.\n\nThis is the Jade Thearch Lord’s Jade Script method for subduing spirits, as follows:\n\nThis Jade Script was received by the Thearch Lord from the Nine Heavens Venerable of the Nine Heavens. Inscribed in green on red stone and buried south of one’s dwelling mountain, it subdues myriad demons and summons perfected immortals to appear, with jade maidens guarding the form. Upon attaining the true sequence of Jade Essence, one ascends to heaven in broad daylight. Guard this secret closely.\n\nThe Jade Essence Formula states: On a *wu* or *ji* day, carve the Nine Heavens Jade Script in yellow on white stone and bury it west of your dwelling mountain. At the moment of burial, face west, strike the teeth nine times, and recite:\n\n*\"White vastness knits the net,\nPale clouds, dark slopes.\nMyriad spirits of the Western Peak,\nRiding *qi* on flowing waves.\nThe Primal Beginning proclaims the command,\nGoverning the Three Florences.\nFour quarters, eight *qi*—\nAll become my domain.\nThose who transgress shall be slain,\nThose who offend shall lament.\"*\n\nWhen finished, bury the stone nine feet deep.\n\nThis is the Jade Thearch Lord’s Jade Script method for subduing spirits, as follows:\n\nThis Jade Script was received by the Thearch Lord from the Nine Heavens Venerable of the Nine Heavens. Inscribed in yellow on white stone and buried west of one’s dwelling mountain, it subdues myriad demons and summons perfected immortals to appear, with jade maidens guarding the body. The Jade Script reveals itself, enabling ascent to heaven in broad daylight. Guard this secret closely.\n\nThe Jade Essence Formula states: On a *geng* or *xin* day, carve the Nine Heavens Jade Script in white on black stone and bury it north of your dwelling mountain. At the moment of burial, face north, strike the teeth nine times, and recite:\n\n*\"Northern Mount Heng,\nEssence of the Star of Longevity,\nDark vastness, black radiance,\nHarmonizing *qi* to release numinosity.\nThe Thearch commands,\nJade Script subdues life.\nThree Paths display might—\nNone dare transgress lightly.\nAll must heed the decree,\nRestore your true forms.\"*\n\nWhen finished, bury the stone nine feet deep.\n\nThis is the Jade Thearch Lord’s Jade Script method for subduing spirits, as follows:\n\nThis Jade Script was received by the Thearch Lord from the Nine Heavens Venerable of the Nine Heavens. Inscribed in white on black stone and buried north of one’s dwelling mountain, it subdues myriad demons and summons perfected immortals to appear, with jade maidens guarding the form. The true formula reveals itself, enabling ascent to heaven in broad daylight. Guard this secret closely.\n\nThe Jade Essence Formula states: On a *bing* or *ding* day, carve the Nine Heavens Jade Script in red on yellow stone and bury it at the center of your dwelling mountain. At the moment of burial, face the *wang* direction, strike the teeth nine times, and recite:\n\n*\"Yellow *qi*, Mystic Song,\nGoverning the Five Directions.\nAbove, the Primal Decree descends,\nSubduing demons and vanquishing lords.\nThe Earl of Hua assists,\nSharing the same fate as the demonic.\nHeavenly Unity, Thearch’s numen,\nReceiving the command of the Nine Yang.\nPrimal Beginning Jade Script,\nSubdues spirits in the Central Palace.\"*\n\nWhen finished, bury the stone nine feet deep.\n\nThis is the Jade Thearch Lord’s Jade Script method for subduing spirits, as follows:\n\nThis Jade Script was received by the Thearch Lord from the Nine Heavens Venerable of the Nine Heavens. Inscribed in vermilion on yellow stone and buried at the center of one’s dwelling mountain, it subdues myriad demons and summons perfected immortals to appear, with jade maidens guarding the body. The true sequence reveals itself, enabling ascent to heaven in broad daylight. Guard this secret closely.\n\nThe Jade Essence Mountain-Subduing Method to the right was received by the Thearch Lord from the Nine Heavens Venerable—an oral transmission of utmost secrecy. In accordance with the statutes of the Supreme Perfected, it may be transmitted only once every seven hundred years to those whose bones are predestined to receive it. Those without jade names must not rashly disclose or lightly reveal this divine scripture; violators will bring calamity upon their seven ancestral generations and annihilation upon their own bodies. Let the recipient be vigilant.\n\nThis secret scripture is to be reverently practiced. For the transmission of its true oral instructions, in accordance with the luminous statutes, one must provide: a golden fish, a jade dragon, forty feet of azure silk, nine pairs of golden buttons, and one hundred feet of silk bearing the recipient’s life-tally, all as pledges of faith before the Nine Heavens. The oath is to be sworn in a secluded chamber during the Muqing Fast. Only then may the transmission proceed. Should the pledge be broken, both master and disciple shall share the same punishment. Let all who receive this transmission from the ghostly officials proceed with utmost caution.\n\n---\n\n*Precious Divine Jade Scripture on the Rising and Resting of the Queen Mother of the West*\nCopied by the Lady of Purple Tenuity\n\nUpon waking at night, immediately close both eyes, click the teeth nine times, and swallow saliva three times. Then press the tongue against the throat, shake the head and neck seven times, and with the hands, rub the sides of the nose—left and right, up and down—dozens of times. Softly recite the incantation:\n\n*\"Nine Heavens Thearch,\nThree Origins protect the infant.\nThe Supreme deploys the flower,\nJade chamber emits essence.\nSeven gates summon spirits,\nNine chambers receive illumination.\nEars keen, eyes clear,\nCommuning with the Perfected, penetrating the numinous.\nThe mountain within heaven,\nHarmonious qi in balance.\nCloud-demeanored Maid,\nBright Lad of radiant wisdom.\nMysterious hearing, resplendent,\nHundred halls gleaming.\nPreserve harmony in the Upper Origin,\nWandering the Golden Court.\nFive viscera radiant,\nEars and eyes ever-vital.\nSpirit terrace stands firm,\nPillars and beams unshaken.\nSeven po refined,\nThree hun in yellow serenity.\nThe Great One takes my hand,\nWalking beside me.\nFive Elders merge as one,\nWu Ying aids the encampment.\nMyriad evils vanish,\nMyriad wishes fulfilled.\nSun and moon guard the gates,\nHeart roams with auspicious stars.\nWhat the immortal longs for is proclaimed—\nTen thousand spirits heed with reverence.\"*\n\nUpon waking, perform this pressing and incantation without fail. Let it not be forgotten. Though the true Dao may be attained, this practice must still be observed continually.\n\nThis is the superior method of *The Supreme Western Queen Mother’s Precious Scripture on the Jade Rites of Rising and Resting*. It sharpens the ears and brightens the eyes, strengthening perception and memory. The nose remains balanced and clear, free from mucus and filth. The four directions and eight reaches become luminous, the face retains a youthful glow, the hun and po are governed, and all demons are repelled—this is the wondrous Dao of the Perfected One’s rising and resting.\n\nIt is called \"rising and resting\" because these are the practices to be observed upon waking and before sleep. Upon completion, rub the face and eyes with both hands until slightly warm, making this a regular habit to be performed frequently.\n\nThe Divine Mother said: When a person grows old, the skin of the face begins first beneath the eyes. When the body’s qi wanes, it starts between the nostrils. These two places are the windows of the skin and the passes of qi’s power. Thus, the rites of rising and resting are practiced constantly to protect the skin and preserve the harmony and vigor of qi.\n\n*The Western Queen Mother’s Precious Scripture of Jade on Life Without Death*\nCopied by the Lady of Purple Tenuity\n\nThe Scripture of Jade on Life Without Death states:\nHands part the blossoming courtyard’s side,\nLingering in harmony with the celestial Perfected.\nAbove, enter the chambers of the spirit,\nJade valleys fill the celestial mountains.\nThe inner source reveals the mysterious numen,\nMyriad demons wipe themselves away.\nEternal life without death,\nJade registers return to the Lord Emperor.\nThrough you, harmony with the celestial Perfected,\nPress this hidden mountain’s source.\n\nThe celestial Perfected resides between the brows, at the inner corners of the eyes. A fraction below the celestial Perfected lies the upper chamber of spirit conduction. The inner source is at the root of the philtrum above the upper lip, within the small hollow beside the nostrils—this is the gate where the mysterious numen extinguishes demons. The blossoming courtyard lies below the brows, at their central point, the bridge of luminous vision.\n\nAt dawn upon rising and at dusk before sleep, swiftly close the eyes, turn the tongue toward the throat, and swallow saliva three times. Then press these three places, each twenty-seven times, applying gentle pressure without lifting the hands. Make this a constant practice, and one will attain life without death, summon spirits, achieve luminous vision, and block the paths of all ghosts.\n\nAfter pressing, softly recite the incantation:\nSupreme Void Sovereign,\nDisperse the jade courtyard.\nThe golden chamber gleams resplendent,\nThe jasper terrace lush and verdant.\nI seize the three paths,\nExtinguishing demons and birthing spirits.\nSince I am without death,\nI am also without birth.\nEver abiding in freedom,\nReversing age to return to infancy.\nHun and po refined and supple,\nThe five spirits at peace.\nThe whirling gale conveys the numinous carriage,\nNorthward I visit Jade Purity.\nAscending to the Great Void,\nMerging with the sun,\nI become a Perfected One,\nThe Lord Emperor unites in darkness.\nThe Three Voids receive my proclamation,\nMyriad spirits heed with reverence.\n\nIn the time of Duke Zhuang of Chu, there was a market overseer named Song Yuanfu, a man of good heart who constantly swept the marketplace. After some time, a beggar appeared in the market, staying for a month. Each morning, he would beg while singing:\nHeaven bestows the golden blossom,\nThe inner source reveals the hidden mystery.\nJade valleys join the mysterious realm,\nJasper and void mutually support.\nThe celestial Perfected stands above the sun,\nFlying elixir spouts wondrous numen.\nAt dawn, press the celestial steed,\nWandering to the divine and mysterious abode.\nThe immortal enters the chamber,\nWiping away all demons.\n\nBefore leaving, he inscribed these words on the market gate. No one in the Chu marketplace understood them, but Yuanfu suddenly grasped their meaning and suspected the beggar was an immortal—though he did not comprehend the song’s purport. He knelt and earnestly entreated, persisting for a long time. The beggar finally told him: \"I am indeed a Perfected One. These words are the Queen Mother of Kunlun’s *Precious Dao of Life Without Death*. Those who know it do not die.\" He then transmitted the essential and secret methods to Yuanfu. After twenty years of practice, Yuanfu ascended to heaven in broad daylight. Now he resides in the Dark Realm, holding the rank of Immortal Minister.\n\nThe beggar in the Chu marketplace was none other than the Perfected One of the Southern Marchmount, Red Pine, who had divided his form and spread his shadow to temporarily dwell in the dust and filth, wandering through the clamor and impurity to summon hidden encounters.\n\n*The Pure Numinous Perfected One, Master Pei, on the Scripture of Divine Treasures*\nTo seek the essential Dao, first clarify the eyes and sharpen the ears, for they are the masters of all affairs. Moreover, the ears and eyes are the ladder to seek the Perfected and the gate to gather the numinous. Success and failure depend on them, and life and death are determined by them. Now this scripture is copied and presented for practical use.\n\n*The Superior Chapter on Dispelling Demons* states:\nFrequently press and restrain the ears on both sides, but do not overdo it—this is called \"tending the city walls\" and \"inscribing the imperial register.\"\nAlso, frequently press the sides of the nose, but only in moderation—this is called \"irrigating the central marchmount\" and \"inscribing the emperor’s records.\"\nThese two methods were spoken by Lady Li of the Illustrious Numen of Fangzhang Terrace on the night of the twelfth day of the ninth month.\n\nThe Dao says: Constantly press the small hollows behind the brows twenty-seven times. Also, rub the area beneath the eyes and above the cheekbones with the palms and fingers, and pull the ears thirty times. Rub frequently without fixed times. Upon completion, stroke the forehead upward twenty-seven times, beginning between the brows and moving into the hairline. Swallow saliva as often as desired. Practicing this regularly will clarify the eyes day by day, and within a year, one may read at night. It may also be done discreetly at the philtrum without revealing the method.\n\nThe small hollows behind the brows are the mansion of the Upper Six Harmonies, governing the generation of eye radiance, the harmony and luster of essence and light, the preservation of the pupil’s clarity, and the refinement of the celestial orbs—this is the supreme Dao of the Perfected One’s rising and resting. It is also called *The Perfected One’s Constant Abiding Inner Scripture*.\n\nThe Perfected One sighed and said: \"If you wish to read at night, constantly cultivate the *Constant Abiding*.\" The reason the Perfected One can observe all directions and illuminate the eight distant reaches is truly the clarity of the *Constant Abiding*’s methods.\n\nThe area beneath the eyes and above the cheekbones is the chamber of decisive clarity, the returning-infancy supreme Dao. Pulling the ears is the art of deep illumination.\n\nThus, when the blood flows smoothly through the gates of regulation, no blemishes arise upon the skin, the eyes’ radiance shines darkly and profoundly, and harmony and spirit flourish in abundance. Now, when a person approaches old age, it seldom begins anywhere but in the ears and eyes. Moreover, the signs of aging in the body also first appear beside the outer corners of the eyes.\n\nThe secret of cultivating the true Dao lies in concentrating the spirit and settling the breath at dawn and dusk. After a long while, place the hands upon the forehead, inwardly visualize the infant, the dual luminaries of sun and moon, and the joy of the Upper Prime. Begin at the brows and count three cycles of nine, ceasing only when the count is complete. This is called *The Way of the Hands Paying Homage to the Three Primes to Fortify the Brain and Strengthen the Hair*.\n\nStroke the four sides of the head with the hands, smoothing the hair into place and gathering it together—only let it be done thoroughly. In this way, the blood of the head flows freely, and wind-dampness does not congeal. When all is complete, press the four corners of the eyes eighteen times, until the light is perceived with perfect clarity. This is the method for examining the spirit of the eyes. Practiced over time, it enables one to see the hundred spirits.\n\nThe *Red-Writing Scripture* states: \"Often cover the mouth and nose with the hands, gaze intently through the eyes for a long while, and let fluid arise within the palms. Then use the hands to rub the face and eyes. Practicing this constantly will make the body fragrant.\"\n\nThe *Celestial Pass Jade Scripture of the Most High* states: \"Often press the corners of the eyes near the nose with the hands, holding the breath while doing so. Cease when the qi flows through, then exhale and begin anew. Practicing this constantly will enable the eyes to perceive with penetrating clarity.\"\n\nThe two preceding passages were transmitted by Lady Wei of the Southern Peak.\n\nThe *Three-Five Sequential Practice Scripture of the Cinnabar-Writing Purple Book* states: \"When sitting, close the eyes and inwardly visualize the five viscera and the intestines and stomach. Practicing this over time will naturally bring clarity and distinctness.\"\n\nThe *Great Simplicity Scripture of the Cinnabar Radiance* states: \"On the face, it is always desirable to rub with both hands until warm, following the contours up and down until thoroughly covered. This will give the face a lustrous glow and prevent wrinkles and blemishes. Practicing this for five years will make the complexion like that of a young maiden—this is what is meant by the qi of mountains and rivers flowing freely and remaining ever full without depletion.\"\n\nThe *Scripture of the Cinnabar Radiance* states: \"First rub the two hands together until hot, then use them to wipe the face and eyes. Afterward, stroke the hair with the hands as if combing it. Alternate the two arms, rubbing them with the hands, to prevent the hair from turning white and the vessels from becoming superficial and enlarged.\"\n\nThe *Massage Section of the Essence and Radiance of the Great Cavern True Scripture* states: \"When rising from bed, sit upright and regulate the breath. First clasp the hands together and raise them to cover the back of the neck. Then tilt the head back to look upward, straining the neck against the hands. Do this three or four times to harmonize the essence and circulate the blood, preventing the intrusion of wind-qi. Practicing this over time will prevent death and illness. Furthermore, bend and stretch the body, extend the hands to the four extremities, arch the back, and pull the sides, moving and shaking all the joints—each three times.\n\nUpon rising, first use a handkerchief or thick cloth to wipe the mouth on all sides and behind the ears until thoroughly warm. Then stroke the head with the hands, smoothing the hair as if combing it, leaving no part untouched. After a long while, rub the two hands together and use them to tend to the face and eyes. Practiced over time, this will brighten the eyes and prevent evil qi from assailing them, keeping the body free from grime and grease, and dispelling filth. When all is complete, swallow the saliva thirty times to guide the inner fluids.\"\n\nThe preceding passage is from the *Essence and Radiance of the Great Cavern Scripture*.\n\nThe *Jade Scripture of Reversed Womb Massage of the Queen Mother of the West*, transcribed by Lady Purple Tenuity.\n\nThe Dao of nurturing life takes the ears and eyes as its foundation. Scattered vision dims the eyes, and excessive worry blocks the ears—these two afflictions arise from within and congeal into illness, not from external misfortunes invading from without.\n\nWhat is called \"the difficulty of hearing the Dao\" does not lie in hearing the Dao itself, but in practicing it; yet even practicing the Dao is not so difficult as bringing it to completion. If the ears and eyes are disordered by stray thoughts and one does not dispel hardship, then even if one’s feet tread the halls of immortals and one’s hands grasp the dragon’s reins, it will still be of no benefit.\n\nThe Reversed Womb Massage should be performed regularly on yang days—the first day of the lunar month is a yang day. On the morning and night of each yang day, when lying in bed at night and upon awakening before rising in the morning, swiftly close the eyes and face the direction of one’s life destiny. Rub the two palms together until slightly warm, then use them to wipe and press the eyes and ear openings on both sides. Cross the hands so they meet at the nape of the neck, repeating this nine times. Next, visualize within each eye a cloud of three colors—purple, red, and yellow—each descending into the two ears. After a long while, recite the following incantation:\n\n*\"Triple clouds of the eye pupils, Radiant Lords of Vision,\nBrilliant and luminous, they infuse essence,\nOpening and connecting the divine spirits.\nGreat Mystery’s cloud insignia, Jade Numinosity’s unfolding scripture,\nGuard and benefit the twin gates,\nUnseal and penetrate the nine portals.\nAll joints respond in resonance,\nRevolving fluids ascend to the Mud Pill.\nThe body ascends to the Jade Palace,\nRanked among the highest perfected.\"*\n\nAfter the incantation, swallow the saliva three times, then open the eyes. Make this a regular practice; on yang days, whether sitting or rising, one may perform this at any time, not only at dawn and dusk. Practicing this for three years will sharpen the ears and brighten the eyes.\n\nWhen combing the hair, always face the direction of one’s life destiny. At the start of combing, recite the following incantation:\n\n*\"Great Thearch disperses numinosity,\nFive Elders return the spirit,\nMysterious flower of the Mud Pill,\nPreserves essence and ensures its longevity.\nOn the left, the hidden moon is restrained;\nOn the right, the sun’s root is drawn.\nThe six harmonies refine and purify,\nA hundred spirits receive grace.\"*\n\nPerform this regularly to prevent head and brain pain.\n\nThe *Scripture of the Supreme Ultimate’s Verdant Efflorescence* states: When combing the hair, face the direction of one’s ruling earthly branch. At the start of combing, recite softly:\n\n*\"Mud Pill’s mysterious flower,\nPreserves essence and ensures its longevity.\nOn the left, the hidden moon;\nOn the right, the sun’s root.\nThe six harmonies refine and purify,\nA hundred spirits receive grace.\"*\n\nAfter reciting, swallow the saliva three times. Practicing this regularly will prevent hair loss and stimulate new growth. Frequently change combs, using one with many teeth but without causing pain. One may also have an attendant comb the hair to ensure thoroughness, thereby preventing blood stasis and strengthening the hair roots.\n\nThe above two methods were taught by An Jiuhua for daily practice.\n\nWhen sitting or lying down, always direct the nostrils toward one’s life destiny; the same applies when eating and drinking. If unable to face one’s life destiny, orienting toward the northeast or northwest is also beneficial, for these two directions are the gateways of heaven and earth’s hun and po souls.\n\nFurthermore, when lying down, gently rock the body from side to side several dozen times. Then, pressing both hands behind, lift the head toward the sky and rock left and right twenty-one times. Afterward, sit upright, raise the hands toward heaven, and remain so for a long while. Next, rub the palms together and wipe the eyes, extending the motion to the ears, and pause again for\n\nThe Supreme Primordial of the Great Origin, the Purple Heaven of the Nine Capitals, governs the hun-soul and protects life—O Lofty and Pure Perfected One. I don the supreme method and receive the teachings of the Great Mystery. May I attain long life and enduring vision, my body ascending as an immortal. May the tombs remain eternally at peace, the gates of ghostly litigation sealed. May my hun and po souls be harmonious and joyful, evil qi dispersed like smoke. Should demonic spirits, wangliang, or any malevolent beings dare offend my spirit, may the Northern Emperor rebuke and restrain them, drawing their qi into the abyss. May I be recorded in the registers of the Supreme Sovereign and reverently presented to the Jade Dawn.\n\nRecite this invocation twice, then knock the teeth together three times, and the dreams of tombs and deceased household spirits shall no longer recur. This is the Northern Emperor’s secret prayer; those of sincere and virtuous intent may all practice it. For those frequently afflicted by inauspicious dreams, this method may be applied, thereby vanishing ghostly qi and scattering evil spirits.\n\nIf the arms fail to move, it is due to wind-toxin qi lodged within the meridians, binding and numbing the bones. Acupuncture and moxibustion are fitting remedies, and the Northern Emperor’s prayer of bending and turning may also be employed. If practiced a hundred times, the illness will dissipate. First, gently massage the afflicted arm with one hand for a long while. Then, close the eyes, inwardly gaze, swallow saliva three times, and knock the teeth together three times. Silently recite:\n\nSupreme Four Mysteries, Five Flowers and Six Courts, Three Hun and Seven Po, Heavenly Pass and Earthly Essence, Divine Palace\n\nThis incantation also reverses inauspicious dreams, transforming them into auspicious omens. The above was revealed by the Lady of Right Radiance on the night of the thirteenth day of the eleventh month.\n\nThe celestial patterns and numinous pivot are the destinations of those who attain penetrating insight. With a heart serene and luminous, the spirit savors the void, chewing and absorbing the Supreme Harmony. The body’s qi becomes pure and boundless, whereupon jade chimes resound, and the myriad sounds are silently summoned.\n\nQi is the vessel and artisan of spirit and illumination, the primordial abyss of purity and turbidity. Abiding in the mysterious, Heaven becomes clear; dwelling within the person, the body endures. Life and death, waxing and waning—all proceed from the art of nurturing and guiding.\n\nTo practice the Six Qi Absorption, always face the northeast at dawn, during the *chou* and *yin* hours, for this is when Heaven’s seasons begin. One must align with this direction at this time. As the rosy glow of the Great Auroral Division arises and the Cinnabar Sun gives birth to light, the numinous radiance dawns, and the Vermilion Essence begins to shine.\n\nFirst, visualize the sun as an egg within the Mud Pill Palace. Then exhale one breath, imagining the qi as black—this is called the Corpse Qi. Next, exhale a second breath, visualizing the qi as white—this is the Old Qi. Then exhale a third breath, imagining the qi as gray—this is the Death Qi. Each exhalation should be prolonged. Having expelled these three colors, one has thus exhaled the Six Qi.\n\nAfterward, slowly inhale the Yellow Qi four times. Upon completion, swallow saliva three times—this constitutes one full cycle. Then visualize the sun within the Mud Pill Palace ascending and emerging from the eyes, positioning itself nine inches before the face. Gaze inward as if seeing it, then inhale the Red Qi seven times. After seven inhalations, swallow saliva three times and cease. Rise and sit, moving and stretching the four limbs, bending and extending to harmonize the joints and meridians. This completes the practice.\n\nWhen visualizing and swallowing saliva, ensure it appears green. At night, one may also visualize the moon within the Mud Pill Palace, following the same method as for the sun. For lunar visualization, the period from the first night to the fifteenth day of the month is optimal. From the sixteenth to the thirtieth day, the moon’s qi wanes, and the Celestial Embryo contracts—do not visualize the moon at night during this time.\n\nThis method is supremely subtle. Those who practice it become immortals, for it enables the refinement of prenatal breathing, the cultivation of luminous perfection, the summoning of the Five Swallows, and the attainment of natural harmony. The hun-soul returns to the Crimson Mansion, and the po-soul retreats to the Mud Pill Palace—thus is longevity achieved. How could this compare to grasping the yin qi of dark valleys, seeking the swift spirits of galloping steeds, traversing the sea in search of passage, or driving a feathered carriage upon a volcano? Be cautious, be most cautious!\n\nThe above is from *The West Queen Mother’s Narrative Instructions*.\n\nOn the night of the fourth day of the seventh month in the third year of the Xingning era (Yichou), the Lord of Life, Eastern Minister, descended with seven attendants. One bore a purple bannered staff, another a floral pennant, one held the Ten Absolute Numinous Sashes, another carried a satchel of inscribed talismans, and three bore a white ivory box—within it appeared to be books. One attendant grasped a flowing-gold fire bell, and all were clad in vermilion robes. The Lord of Life appeared far younger than his two brothers, wearing a green brocade embroidered skirt, a purple feathered cloak, and a hibiscus crown. His two brothers accompanied him, standing in attendance until bidden to sit. They conversed at length.\n\nOn the night of the sixth day of the seventh month, the Lord of Life descended again. After a long while, he instructed in writing: \"If one must model oneself upon the mysterious and uphold the image, maintaining purity and stillness in rare moments, then one may transcend the hidden depths, fold one’s wings, and nest in lofty seclusion. By savoring the profound and tasting the sublime, one’s spirit harmonizes with the highest. Like a still pool or a towering peak, one delves into the jade scriptures, playing with treasures to quicken the spirit. Abandoning worldly attachments, one tunes the zither of pure numen, clarifying the luminous within the void. The Five Ways become manifest, and form dissolves into the waves of transformation. Desires merge with the insipid, and the empty and obscure thoroughfare becomes a realm of no seeing, no hearing. Only then may one ascend to the subtle perfection of the true, reawakening the mysterious awareness. With inner virtue rounded and outer numinous signs fulfilled, one may at last drive the cloud chariot to the heavens and inscribe the Lord of Life’s cinnabar register.\n\nYet if one’s essence scatters amidst a myriad thoughts, life cannot be firmly rooted. If qi follows the dusty waves and the heart does not dwell in truth, one merely wearies body and spirit among the groves and peaks—truly, this is a grievous error before enlightenment. The Way is subtle yet easy to seek, yet arduous and difficult to attain.\"\n\nAt midnight on the fifth day of the lunar month, visualize the solar orb within the heart, drawing the sun in through the mouth so that its light illumines the heart’s interior. When its radiance merges with the sun’s, you will feel warmth in the heart and a rosy glow suffusing the body. After this union, recite the invocation:\n\n*\"Great luminosity nurtures essence,\nWithin, the cinnabar heart is refined.\nLight and radiance merge as one—\nDivine spirits come seeking.\"*\n\nUpon completion, swallow saliva nine times.\n\nRepeat this practice on the fifteenth, twentieth, and twenty-ninth days of the month. Through this, the adept gains clarity and keen perception, all senses become fresh and lucid, the face radiates jade-like luster, and the body gleams with golden sheen. After five years of practice, the Supreme Unity will dispatch a jeweled chariot to welcome the adept, ascending to the Great Empyrean. While frequent practice is essential, it need not be confined to these specific days.\n\nThe above method is recorded in the *Scripture on Dispelling Demons*, from the inner teachings of the Red Lord of the Southern Prison.\n\nIt further states: When partaking of meals, avoid speaking of death or exposing food, lest malevolent qi gather. Bathe frequently, and on each *jiazi* day, perform a full ablution; if not, do so at the start of each month to attain spiritual communion. The obstacle is not the frequency of bathing, but the practitioner’s inability to persist. By washing away the stench of the corpse, true qi enters the body.\n\nThe above was commanded by the Mystic Master, Lady Wei, for practical application.\n\nThe *Scripture of the Nine Transformations and Ten Transmutations for Renewal* states: When treading upon filth or contentious places, first perform a ritual bath to purify the body and dispel impurities. The method employs ten ounces of bamboo leaves and four ounces of peeled white peach bark, boiled in one *hu* and two *dou* of clear water in a cauldron, ensuring it does not boil over. Once cooled to a suitable temperature, use the water to bathe, and all defilements will dissolve. This not only removes impurities but also prevents dampness, numbness, sores, and itching.\n\nBamboo is hollow, plain, and inwardly white, while peach repels evil and expels filth—hence these two substances are used to cleanse the body’s impurities. When celestial beings descend to the mortal realm and return, they invariably use this water for self-purification. Compared to worldly talismanic waters, incantations, or external rinses, this method is unparalleled. While bathing with it is most effective, it should not be used for washing the hair. This refined essence for refining the corpse is precisely suited for bathing the body—a truly wondrous and secret technique.\n\nThe above was commanded by the Lady of the Purple Tenuity Palace of the Mystic Dragon Feather Court for practical use.\n\nOn the tenth, seventeenth, and twenty-seventh days of each month, at the hour of *ren ding* (night’s stillness), gaze at the mouth of the Northern Dipper and behold the great star within. Then, addressing the Celestial Master and Libationer, bow twice and declare:\n\n*\"Your servant [Name], kowtowing in reverence, humbly petitions for transmission, beseeching the gift of longevity.\"*\n\nAt dusk, press the corners of the eyes and visualize the divine light, ensuring it shines with a radiant red-yellow hue—this is auspicious. Never forget this practice. Though the body is one, the spirits are myriad; they must not be disordered.\n\nBefore sleep, meditate upon the body’s spirits; upon rising, do the same. These are the three methods.\n\nThe above is recorded in the *Essentials of the Dao*.\n\nAt the first crow of the rooster, before rising, first bend the left hand to lick the salt from the finger, then extend the right hand to gaze at the salted finger, rubbing them together while reciting:\n\n*\"The daughter of the Queen Mother of the West is named Yi Yu. She bestows upon me the cinnabar elixir, which I receive into my mouth, accumulating essence to polish my form.\"*\n\nAt every cock’s crow, swallow saliva twice seven times to dispel the dimness of the eyes, drawing forth their radiant essence so that one’s vision may penetrate ten thousand *li* and perceive all four directions. After swallowing saliva twice seven times, rub the eyes with the fingers twice seven times to prevent drowsiness—this is what is meant by *\"spitting on the hands and rubbing the eyes with Yang Brightness.\"*\n\nThe above is recorded in the *Nine Capitals*.\n\nNext, tap the teeth, sounding the drum of the Heavenly Gate thirty-six times. Then swish the divine springwater and swallow it three times—this is called *\"sounding the Heavenly Drum\"* and visualizes the myriad spirits of the body.\n\nThe above is recorded in various texts.\n\nUpon rising at dawn, sit facing east. Rub the hands together until warm, then rub the forehead upward to the top of the head, repeating this eighteen times—this is called *\"Muddy Pellet.\"* Next, rub the hands together again until warm, then rub the face, passing into the hairline three times. If one can thoroughly rub the entire body, it is even better—this is called *\"Dry Bathing.\"*\n\nNext, after rubbing the hands and touching the forehead, clasp the ears with the hands and pull them upward and downward fourteen times to ensure lifelong hearing. Then, contracting the nose and holding the breath, use the right hand to pull the left ear from above the head fourteen times, then the left hand to pull the right ear fourteen times—this grants longevity.\n\nWhen dressing, one should don the belt facing *wu-ji*. For example:\n- During the *jia-xu* decade, face *yin*;\n- During the *jia-yin* decade, face *wu*;\n- During the *jia-shen* decade, face *zi*;\n- During the *jia-wu* decade, face *xu*;\n- During the *jia-chen* decade, face *shen*;\n- During the *jia-zi* decade, face *chen*.\n\nThis is what is meant by *\"donning the belt facing* wu-ji*\"* to remain perpetually free from cold.\n\nWhen walking, always step forward first with the left foot while saying *\"Qian,\"* then with the right foot while saying *\"Yuan,\"* then with the left foot while saying *\"Heng,\"* then with the right foot while saying *\"Li,\"* and finally with the left foot while saying *\"Zhen.\"* This completes the sequence—it is called *\"Walking the Qian-Yuan.\"*\n\nWhen making a request, state your name aloud:\n*\"Left-aligned spirit, right-aligned spirit, Earth Controller of Destiny, Azure Lady, sever [Name]’s entry in the register of death. Gatekeeper Lord, grant this to the Lady.\"*\n\nIf assent is given, repeat it quietly, ensuring the voice does not carry too far.\n\nWhen relieving oneself, face the direction of the Six *Ding*. For example:\n- During the *jia-zi* decade, face *ding-mao* (east);\n- During the *jia-xu* decade, face *chou*;\n- During the *jia-shen* decade, face *hai*;\n- During the *jia-wu* decade, face *you*;\n- During the *jia-chen* decade, face *wei*;\n- During the *jia-yin* decade, face *si*.\n\nThis is what is meant by *\"facing the Six Ding when relieving oneself.\"*\n\nThe above eight methods are recorded in the *Scripture of Spontaneity*.\n\nBefore eating or drinking, first state your name and declare:\n*\"I establish my body as the Dao, my body as the Heavenly Repository. Dao Father, Dao Mother, Perfected Ones, Immortals, Divine Ones, Sages—I join with you in this meal. Divine youths and jade maidens attend at my left, holding my immortal register, granting me boundless life.\"*\n\nThe above is recorded in the *Essentials of the Dao*.\n\n**Method for Absorbing the Essence of the Sun and Moon:**\nOn the first day of the lunar month, when the sun has risen three *zhang* high, gaze toward it, clench the fists, and perform the *Yu Step*. From afar, draw in the sun’s essence with the mouth twenty-four times and swallow it. If three people enter a plague-stricken household in this manner, no illness will afflict those accompanying them. Practicing this regularly ensures longevity.\n\nOn the third day of the lunar month, when the moon rises in the *geng* position, clench the fists, walk southwest, face the moon, perform the *Yu Step*, and from afar draw in the moon’s essence with the mouth twenty-four times, swallowing it. This ensures a year free from illness. It also allows one to enter households of the deceased, for the sun and moon illuminate all impurities.\n\nThe above two methods—*\"eating the sun and drinking the moon\"*—dissolve all *qi*.\n\n*\"Born together with the Dao, dwelling with the spirits in the same hall, Perfected One [Name], who dares speak of my demise?\"*\nRecite this when the ears ring.\n\n*\"Dwelling with the Dao, sharing a chamber with the spirits, Perfected One [Name], may my lifespan match heaven and earth.\"*\nRecite this at the first cock’s crow.\n\n*\"Sharing a chamber with the Dao, sharing merit with the spirits, Perfected One [Name], may my lifespan unite with heaven and earth.\"*\nRecite this at the second cock’s crow.\n\nWhen traveling at night, invoke *\"Heavenly Peng\"* to stand before you and repel tigers and wolves.\n\nRecite this when walking at night.\n\nAt dawn and dusk, face north. First visualize the *qi* of the five viscera:\n- The *qi* of the liver as true blue,\n- The *qi* of the heart as true red,\n- The *qi* of the lungs as true white,\n- The *qi* of the kidneys as true black,\n- The *qi* of the spleen as true yellow.\n\nOnce the *qi* of the five viscera is settled, tap the teeth thirty-six times and recite:\n*\"Heavenly Peng, Heavenly Peng, Nine Origins Slaying Youth, Five Ding Controllers, Gao Diao Northern Duke, Seven Governors Eight Spirits, Supreme One Dispels Misfortune, Long-Skulled Giant Beast, Grasping the Emperor’s Bell, White Owl of the Three Mornings, Sternly Driving the Kui Dragon Chariot, Mighty Sword Divine King, Slaying Demons and Erasing Traces, Purple Qi Riding the Sky, Cinnabar Clouds Blazing Forth, Devouring Demons and Consuming Ghosts, Body Transverse Drinking the Wind, Azure Tongue Green Teeth, Four-Eyed Old Man, Heavenly Ding Warriors, Mighty South Warding Off Misfortune, Heavenly Couriers Rousing Fury, Mighty North Biting the Blade, Three Hundred Thousand Soldiers, Guarding My Ninefold Gates, Repelling Corpses a Thousand *Li* Away, Further Dispelling Inauspiciousness. Should any petty ghost dare approach to harm me, seize the Heavenly Great Axe and sever the five forms of ghosts. The Fiery Emperor scorches their blood, the Northern Emperor burns their bones, the Four Brightnesses shatter their skeletons, Heavenly Strategy annihilates their kind. With a single stroke of the divine blade, ten thousand ghosts scatter.\"*\n\nRecite this incantation to ward off ghosts, tapping the teeth once for every four lines.\n\nAll ghosts under heaven submit in awe. Should any seek to harm you, they will vanish upon hearing this incantation. The Great Demon of the Northern Emperor constantly fears this prayer. Those who regularly employ it may traverse the world unopposed, with gods and ghosts submitting in obedience.\n\nDo not recklessly reveal the existence of this incantation method; keep it secret and practice it diligently.\n\nThe master’s oral instructions state: If the body is not pure and refined, one must not lightly perform the incantation rites. You ought to be cautious of this.\n\nRegularly at cock’s crow, clench the fists, raise the Celestial Pillar, and tap the teeth twice seven times. Envision the Twelve Parent Deities encircling the head, the Twenty-Four Divine Persons arrayed upon the body, and the Twenty-Four Sages surrounding the earth beneath you. Then, press the left heel against the anus, clench the fists tightly once more, curl the tongue back toward the throat, hold the breath, and visualize the Kingly *qi* before you. Envision all the gods of heaven and earth, the spirits of mountains and rivers, the Five Peaks, and all living beings coming to pay homage to you—from heaven to earth, none dare not tremble in submission. Only then release the breath.\n\n*Right: The Great One’s Celestial Encompassing Prohibition.*\n\nThe *po* soul by day resides beneath the left eye, and at dusk beneath the nose in the philtrum. Regularly at dawn and dusk, press with the second finger of the right hand three times while softly reciting:\n\nThe seven *po* are refined and purified,\nUnmoving and unyielding,\nEver conjoined with the three *hun*,\nConcealed within the Imperial Court.\nThey preserve harmony of the Three Origins,\nCommuning with the true and penetrating the numinous.\nAll misfortune vanishes,\nAnd I attain longevity,\nBecoming a Perfected One,\nAscending to the Celestial Court.\n\n*Right: The Great One’s Method for Restraining the Seven *Po*.* Practice this regularly, and the three *hun* will be guarded, the seven *po* will remain at peace, and death shall never come. Perform this without others witnessing.\n\nWhen entering a purification chamber or sacred space, first expel and dispel ghosts and illnesses. Guard against all trials, then relax the inner palace and recite, facing north and tapping the teeth thirty-six times. Softly address the Jade Clarity’s Resplendent Primordial Sovereign:\n\nThe Great Demon Kings of the Six Heavens,\nBound in the desolate void,\nGiant beasts of crimson armor,\nPoisonous dragons with four throats,\nWhite rats howling upward,\nBrandishing claws and shaking bristles,\nMyriad spirits lurking in darkness—\nVanquish evil and shatter demons.\nThe Heavenly Soldiers are as one,\nThe Five Peaks pay homage.\nWind and fire launch their assault,\nThe Nine Heavens fan the whirlwind.\nBehold!\n\nThen, straighten the spine, close the eyes, refine the countenance and essence, harmonize the Three Palaces, and visualize the Six Courts. The Imperial Lord holds court, his ministers and aides all radiant. Harmonize the *qi* and fluids, pay homage to the Nine Numinous Ones, the Five Spirits rest in succession, the springs of saliva overflow, the White Prime awakens the true, the Dark Flower spreads its life. The cavernous radiance shines in secret, the Four Powers are balanced, the inner treasure gleams brightly. Sing and delight in the Cavernous Clarity, the Primal Simplicity arrays its charts, and longevity shall never falter.\n\nOn one’s natal day or in places where the heart trembles, close the passes and refine the thoughts, tap the teeth thrice, regulate the breath, face north, and softly intone:\n\n*Roluona chao, Fangnai guanlian,*\n*Banmu bo dui, Danmo ju she,*\n*Hecha bai shu, Danli da mo,*\n*Zhenfu guangfu, Xuling zhi xiao,*\n*Zonglan jixiong, Fa dong chang you,*\n*Wumian zhongpin, Lingkuo fan tiao,*\n*Baifang qian tu, Moneng huo liao,*\n*Tiandi qidu, Shu yun neng diao.*\n\n*Right: These two passages are from the* Incantations of the *Jade Register of the Eight Luminaries of the Cavernous Realms of Golden Mystery.* Do not recite them lightly; be cautious.\n\nFor extreme cold: Inhale through the nose, swallow the *qi* thrice without exhaling, and cease once the *qi* is drawn in.\n\nFor extreme heat: Inhale through the nose, swallow the *qi* twice slowly, first drawing in through the nose, then exhaling through the mouth. The heat will subside.\n\n*Right: These two passages are from the* Scripture of Qi Circulation by Master Huang.\n\nAt that time, eighty-five thousand vajra spirits acted as Dharma protectors, subduing the minds of both the hidden and the manifest, and spoke this incantation:\n\nLightning fire illumines the void,\nDivine radiance brightens the obscure.\nPoisonous dragons crouch at the four quarters,\nSpiritual tigers encircle the eight directions.\nThe headscarf bears the Seven Stars,\nThe feet tread upon Dipper and Ox.\nThe divine blade arrays the constellations,\nThe golden hook gleams with essence.\nThe foremost wields mighty soldiers,\nStriding through the void.\nSever the center of demonic evil,\nAnnihilate the wandering spirits below.\nTear out the liver, extract the gall,\nInvert the intestines, sever the vessels.\nCut left, strike right,\nBoil and decapitate the rear.\nSever the root of demonic *qi*,\nBind and restrain all grudges.\nThe ghost-eating messengers,\nCrush and devour them alive.\nSorcerers and shamans with drums and songs,\nDrinking blood and eating flesh,\nFoul of form and stinking of bone,\n*Wangliang* spirits overturned.\nRank and filthy, base and vile,\nHearts and forms full of flattery and slander.\nThe divine pestle shatters their skulls,\nThe golden blade slits their bellies.\nThose who conceal evil and hide harm,\nSuddenly submit.\nIn the left hand, the golden talisman,\nIn the right, the ledger of sins.\nThe Great One’s golden bell,\nThe Jade Emperor’s jade scepter.\nThose who know their faults yet do not reform,\nHang their heads and sever themselves.\nWhat demon does not perish?\nWhat spirit does not vanish?\nThe Six Spirits do not hide,\nThe Seven Stars spill blood.\nAbove, the Heavenly Master,\nBelow, the vajras.\nTogether they subdue the *qi*,\nMouths spewing divine radiance.\nDrink from the Cinnabar Pool,\nFeed upon the Mysterious Frost.\nThe Five Viscera bloom with flowers,\nAbiding forever, unending.\n\nAt that time, the Great Ghost King with four eyes and a body like lightning, together as Dharma protectors, dispelled inauspiciousness, guarded the ritual space, detected deceit and corrected faults, subdued evil men and all external paths, and those lacking faith. They spoke this incantation:\n\nDivine wind sweeps away dust,\nUprooting the roots of evil.\nThe Six Heavens lose their essence,\nThe Five Poisons perish their grudges.\nGolden head and iron teeth,\nDevouring ghosts and vanishing souls.\nPeach light arrays the doors,\nTwin luminaries shine upon the gates.\nShooting stars and killing *qi*,\nRadiant and fearless.\nThe hundred vessels flow like rivers,\nThe seven meridians are regulated.\nThe spirit is at peace, the body is balanced,\nAbiding forever, undying.\n\n*Right: These two incantations are from the* Supreme Jade Clarity Scripture*, Chapter Seven, \"The Dao Transforms the Four Barbarians.\"*\n\nThe *Hymn of the Fengdu Palace* states:\n\nZhou’s end marks the divine emperor,\nIn truth, affairs meet heavy calamity.\nFlaming like smoke in the sky,\nBursting like radiant blossoms.\nWucheng girds the divine blade,\nSerene illumination swallows the Clear River.\nThe Gate of Heaven overlooks the Cinnabar Well,\nCloud Gate looms precipitously.\nThe Seven Wrongs connect to the wondrous canopy,\nLinked and winding, they spread demons.\nThe Six Heavens cross the northern path—\nThis is the abode of ghosts and spirits.\n\nThese are the names of the Six Heavenly Palaces. Reciting them dispels ghostly and demonic influences.\n\nSilent communion conveys inspired feeling,\nMysterious *qi* stirs the resonant tone.\nThough the lofty wheel is uneven,\nFrom ten thousand fathoms, they still come seeking.\nThe diligent Daoist disciples,\nHarmonizing spirit and contracting the numinous lapel,\nSurrender to the transformations of the floating world,\nThe heart’s standard planted in the secluded forest.\nTogether we await the journey beyond principle,\nAnd with one another, still the eastern peak.\n\nHere the heart’s longing is expressed,\nits karmic bonds conveyed.\nCommanding the chariot to vast Feng E,\nfree traces transcend the nether realm.\nIn emptiness, things exist of themselves;\nwithin existence, nothing remains constant.\nRealizing the words at the boundary of being and non-being,\ntogether we meet at the Hao Bridge.\nThe eye perceives, the profound understanding dawns—\nthe principles of ghosts and spirits are forgotten of themselves.\n\nThis discourse concerns the subtle essence of humans and ghosts.\n\nMount Luofeng lies in the northern *gui* region, its height two thousand six hundred *li*, its circumference thirty thousand *li*. Beneath the mountain lies a grotto-heaven, its circumference fifteen thousand *li*. Both above and below, ghostly and divine palaces stand. On the mountain are six palaces; within the grotto, six more—each palace spanning a thousand *li* in circumference. These are the Six Heavenly Palaces of ghosts and spirits.\n\nThe palaces above the mountain are the outer courts; those within the grotto, the inner courts—their systems are the same.\n\nThe first is the Zhōu Jué Yīn Heavenly Palace;\nthe second, the Tài Shā Liàng Shì Zōng Heavenly Palace;\nthe third, the Míng Chén Nài Fàn Wǔ Chéng Heavenly Palace;\nthe fourth, the Tián Zhào Zuì Qì Heavenly Palace;\nthe fifth, the Zōng Líng Qī Fēi Heavenly Palace;\nthe sixth, the Gǎn Sī Lián Wǎn Lǚ Heavenly Palace.\n\nReciting these Six Heavenly Palaces, one then knocks the teeth six times and lies down—warding off all ghostly and demonic *qi*.\n\nWhen the worthy and the sages depart this world, they first pass through the third, the Míng Chén Heavenly Palace, to receive their affairs. Fortune and misfortune, good and ill, all life’s transgressions and harms, are governed by the fourth, the Tián Zhào Heavenly Palace, where the Lord of the Northern Dipper presides.\n\nThe ghostly officials intone:\n\nI am a disciple of the Most High, governing below the Six Heavens. The officials of the Six Heavens are under my command—not merely under my command, but under the dominion of the Most High. I know the names of the Six Heavenly Palaces, and thus attain long life. Should any dare to transgress, the Most High shall sever your form.\n\n*(From the fifth scroll of* Zhen’gao Chan Youwei: *Elucidating the Subtle and Obscure.)*\n\nHere ends the *Essential Jade Instructions of the Three Perfected Ones of Highest Clarity*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清三真旨要玉诀 经名：上清三真旨要玉诀。 撰人不详，约出朴南北期。 系慕集早期上清派修行经诀而成。 刘师培以为此书即陶弘景《登真隐诀》之缺卷。 原书卷数不详，现存两种文本。 一、敦煌P2576V 号抄本； 二、《正统道藏》洞玄部玉诀类。 两本均有残缺。 今合并为一#1。 上清三真旨要玉诀 （前缺文） 色元缝章衣，左手捧日精，右手执月光，填我上府泥丸宫中，三呼上宝真人，太虚资五炁流精，陶观我身，使五味口五咽，上仰咒曰： 高上真皇，五帝太虚，保我泥丸，玄映五形，三光朗耀，日月洞明，飞云流霞，陶注玉精，练容保魄，神魂自生，千变万化，升於紫庭。 毕，引炁五过止。 五方命咒毕，摩两掌，拭两目，如此五年，面发金容，五内华生，玉藏保炁，神仙道成，三宫咸畅，真灵见形，乘空驾虚，白日升天。 惟在密修，慎勿轻传。 夫修上法诵万遍之道，希真致灵，以求神仙者，当以八节之日，授刺灵山本命之岳，列奏玉清，三年勿失，则名书青宫，札系玉皇，玉华侍卫，金晨奉迎。 此玉精真决，帝君宝篇，有得此决，计日升仙，妄泄神文，考及九玄，身没形残，长闭河源，惟在密修，道不虚言。 夏节之日，於本命岳，正中南向，叩齿卅二通，仰微咒曰：玄精阳明，元始帝灵，四景八炁，纬度天经，白元落死，元英注生，奏简灵岳，录闻玉清，高上帝尊，记甲真名，伏须告御，身谒紫庭，三官九府，靡不慎听。 毕，咽炁九过止，还北向长跪，读简咒如后讫，埋简於绝岩之峰。 立秋之日正中，向西南叩齿卅二通，仰微咒曰：流炎四射，飞景启明，八炁交焕，齐落天经，九始告晨，上应帝灵，奏简灵岳，东华记名，长保玄室，晏景紫庭，三官九府，列我长生，与天同休，永保黄宁。 毕，咽炁九过止，还北向长跪，读简咒同后法讫，埋简。 秋分之日正中，西向叩齿卅二通，仰微咒曰：少阴造运，八道开张，三象顺回，纬度天梁，元始勒正，齐契四乡，奏简玄岳，上闻玉京，上帝高尊，记名无英，三官落死，九府顺昌，自尔之后，三界司迎，乘虚驾烟，飞行太空。 毕，咽炁九过止，还北向长跪，读简咒如后法讫，埋简。 立冬之日正中，西北向叩齿卅二通，仰咒曰：玄阴御晨，四运回天，八炁交度，三五周还，上帝告命，日吉启辰，奏名清宫，上补帝臣，承天顺命，拜谒玉晨，北酆落死，南宫度名。 毕，咽炁九过止，还北向长跪，读简咒如后法讫，埋简。 冬至之日正中，北向叩齿卅二通，仰咒曰：阴精激炁，羽晨乘冥，二景交落，运度天经，九帝齐运，换采真名，奏札上闻，记契玉庭，五岳三司，威定我生，与日同光，与天同宁。 毕，咽炁九过止，长跪读简咒如法讫，埋简。 立春之日正中，东北向叩齿三十二通，仰咒曰：阳精告始，玄炁射晨，二运交焕，三五反真，上帝有命，告我灵篇，投简神岳，永保飞仙，三官九府，度我河源，名参帝籍，长为玉宾。 咒毕，咽炁九过止，还北向长跪，读简咒同后法讫，埋简。 春分之日正中，东向叩齿三十二通，仰咒曰：天精炁布，浩素流清，乘御晨，回历五星，黄录映魂，东华保生，长享无极，亿劫肇龄，奏简玉阙，北帝落名，游历玄高，浮景紫清。",
      "translated_text": "**The Essential Jade Instructions of the Three Perfected Ones of Supreme Clarity**\n\n*Title:* *The Essential Jade Instructions of the Three Perfected Ones of Supreme Clarity*\n*Author:* Unknown, approximately dated to the Northern and Southern Dynasties. Compiled from early Supreme Clarity School scriptures and oral instructions. Liu Shipei believed this text to be a missing volume of Tao Hongjing’s *Hidden Instructions for Ascending to Perfection*. The original number of fascicles is unknown; two versions survive: (1) Dunhuang manuscript P.2576V, and (2) the *Daoist Canon of the Zhengtong Era*, under the *Jade Instructions* category of the *Cavernous Mystery Division*. Both are incomplete. The present text is a collated reconstruction.\n\n---\n\n**The Essential Jade Instructions of the Three Perfected Ones of Supreme Clarity**\n*(Preceding text missing)*\n\nDon the *Primordial Seamless Robe of Colored Chapters*, hold the essence of the sun in the left hand and the radiance of the moon in the right, and fill the mud-palace of my upper mansion. Thrice invoke the Supreme Treasure Perfected One. The Great Void bestows the five *qi* to flow with essence, refining and observing my body. Swallow the five flavors five times, then raise the head and recite the incantation:\n\n*\"Supreme Perfected Sovereign,\nFive Thearchs of the Great Void,\nGuard my mud-palace,\nMysteriously reflect the five forms.\nThe Three Luminaries shine brightly,\nSun and moon illumine with clarity.\nFlying clouds and flowing auroras\nInfuse and refine jade essence.\nCultivate countenance, preserve the *po*,\nSpirit and soul spontaneously arise.\nA thousand transformations, ten thousand changes,\nAscend to the Purple Court.\"*\n\nWhen finished, guide the *qi* five times and cease.\n\nAfter reciting the five directional invocations, rub the palms and wipe the eyes. After five years of such practice, the face will assume a golden countenance, the five viscera will flourish with blossoms, the jade storehouse will preserve *qi*, and the Dao of immortality will be achieved. The Three Palaces will all be harmonious, the true numina will manifest in form, riding the void and mounting the mist to soar through the Great Empyrean. This must be practiced in secrecy; do not transmit it lightly.\n\nFor those who cultivate the supreme method, reciting it ten thousand times to seek the numinous and attain immortality: on the days of the eight solar terms, inscribe a memorial on the sacred peak of one’s life-destiny and present it to the Jade Clarity. After three years without lapse, one’s name will be recorded in the Azure Palace, registered with the Jade Thearch, attended by jade blossoms, and welcomed by the Golden Dawn. This jade essence true instruction is the treasured scripture of the Thearch-Lord. Whoever obtains this instruction will ascend as an immortal in a calculated number of days. To recklessly divulge the divine text is to invite judgment upon the nine ancestral generations, body destroyed and form extinguished, eternally sealed in the River Source. Only through secret cultivation does the Way not speak falsely.\n\nOn the summer solar term, at the life-destiny peak, face due south at noon. Strike the teeth thirty-two times and softly recite the incantation while looking upward:\n\n*\"Mysterious essence, yang brightness,\nPrimordial Thearch’s numinous power,\nFour seasons, eight *qi*,\nWeave and traverse the celestial warp.\nWhite Prime descends in death,\nPrimordial Florescence infuses life.\nPresent the memorial to the sacred peak,\nRecorded and heard in Jade Clarity.\nSupreme Thearch and August One,\nInscribe the name of the True Self.\nHumbly await imperial decree,\nBody to audience in the Purple Court.\nThe Three Offices and Nine Bureaus,\nNone dare not heed with reverence.\"*\n\nWhen finished, swallow *qi* nine times and cease. Turn north, kneel, and read the memorial incantation as below. Then bury the memorial on a precipitous peak.\n\nOn the autumnal commencement, at noon, face southwest. Strike the teeth thirty-two times and softly recite the incantation while looking upward:\n\n*\"Flowing flames shoot in four directions,\nFlying radiance heralds dawn.\nEight *qi* intermingle and shine,\nAligned with the descent of the celestial warp.\nThe Nine Beginnings announce the morning,\nResponding above to the Thearch’s numen.\nPresent the memorial to the sacred peak,\nEastern Florescence records the name.\nEternally guard the mysterious chamber,\nRevel in the radiance of the Purple Court.\nThe Three Offices and Nine Bureaus\nRank me among the long-lived,\nTo share repose with heaven,\nEternally preserve the Yellow Tranquility.\"*\n\nWhen finished, swallow *qi* nine times and cease. Turn north, kneel, and read the memorial incantation as below. Then bury the memorial.\n\nOn the autumnal equinox, at noon, face west. Strike the teeth thirty-two times and softly recite the incantation while looking upward:\n\n*\"Lesser yin initiates the movement,\nEight paths open and unfold.\nThe Three Images follow in sequence,\nWeaving and traversing the celestial beam.\nThe Primordial Beginning commands rectification,\nHarmonizing the four directions.\nPresent the memorial to the mysterious peak,\nHeard above in Jade Capital.\nThe Supreme Thearch and August One\nInscribe the name in the Flourishing Void.\nThe Three Offices descend in death,\nThe Nine Bureaus follow in prosperity.\nFrom this time onward,\nThe Three Realms will welcome and receive,\nRiding the void, mounting the mist,\nSoaring through the Great Empyrean.\"*\n\nWhen finished, swallow *qi* nine times and cease. Turn north, kneel, and read the memorial incantation as below. Then bury the memorial.\n\nOn the winteral commencement, at noon, face northwest. Strike the teeth thirty-two times and recite the incantation while looking upward:\n\n*\"Mysterious yin governs the morning,\nFour movements revolve heaven.\nEight *qi* intermingle and traverse,\nThree and five complete their cycle.\nThe Thearch issues the decree,\nAuspicious day heralds dawn.\nPresent the name to the Pure Palace,\nTo supplement the imperial ministers.\nReceive heaven’s mandate and follow fate,\nBow in audience before the Jade Dawn.\nNorthern Feng descends in death,\nSouthern Palace records the name.\"*\n\nWhen finished, swallow *qi* nine times and cease. Turn north, kneel, and read the memorial incantation as below. Then bury the memorial.\n\nOn the winter solstice, at noon, face north. Strike the teeth thirty-two times and recite the incantation while looking upward:\n\n*\"Yin essence excites *qi*,\nFeathered dawn rides the darkness.\nTwo radiance descend in alternation,\nRevolving and traversing the celestial warp.\nNine Thearchs move in unison,\nExchanging and adorning true names.\nPresent the memorial to be heard above,\nInscribed and registered in the Jade Court.\nThe Five Peaks and Three Offices\nSecure my life with awe.\nShare radiance with the sun,\nShare tranquility with heaven.\"*\n\nWhen finished, swallow *qi* nine times and cease. Kneel and read the memorial incantation as below. Then bury the memorial.\n\nOn the vernal commencement, at noon, face northeast. Strike the teeth thirty-two times and recite the incantation while looking upward:\n\n*\"Yang essence announces the beginning,\nMysterious *qi* shoots at dawn.\nTwo movements intermingle and shine,\nThree and five return to the true.\nThe Thearch issues the decree,\nRevealing to me the numinous scripture.\nPresent the memorial to the divine peak,\nEternally preserve the flying immortal.\nThe Three Offices and Nine Bureaus\nCross me over the River Source.\nName entered in the Thearch’s register,\nEternally a jade guest.\"*\n\nWhen the incantation is finished, swallow *qi* nine times and cease. Turn north, kneel, and read the memorial incantation as below. Then bury the memorial.\n\nOn the vernal equinox, at noon, face east. Strike the teeth thirty-two times and recite the incantation while looking upward:\n\n*\"Heaven’s essence spreads *qi*,\nVast and pure, flowing with clarity.\nRiding the *wei* to govern the morning,\nRevolving through the five stars.\nYellow Register reflects the soul,\nEastern Florescence preserves life.\nEternally enjoy boundlessness,\nBeginning of kalpas without end.\nPresent the memorial to the Jade Gate,\nNorthern Thearch records the name.\nRoam the mysterious heights,\nFloat in the radiance of Purple Clarity.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1254,
      "start_sentence": 0,
      "end_sentence": 31,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.31748390197754,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清三真旨要玉诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "毕，咽炁九过，还北向长跪，读简咒如法讫，埋简。 立夏之日正中，东南叩齿三十二通，仰睨曰：八炁维络，整位舞天，五迥七转，变化忽然，三练九试，改容易年，济景光缠，永保上仙。 毕，咽炁九过止，还北长跪，读简咒如法讫，埋简。 高上紫虚玉皇大洞三景弟子，东岳玄静先生何玄明，年五十六岁，字子方国，以正月生，被三诚，应为臣谨开五岳灵山真神，三官九府十二河源讫，臣玄名上奏玉清。 右朱书银刺上，北向读刺毕，刺玄岩之下，勿令人得之。 北向再拜，长跪读简毕，又叩齿九通，微咒曰：元始帝皇，高上玉真，金仙父母，玉华紫晨，万气总司，鉴真领仙，上校青宫，符灵神仙，名定录札，列奏帝前，谨开九府，三官河源，度名青篇，永保长存。 毕，埋简。 此帝君素语妙决，传有骨分应仙之人。 每至节辄如上法，令三年得廿四过投刺灵岳，则真皇注名，帝给玉童玉女各十二人。 轻泄宝决，罪灭子身，明慎玄科，秘而奉修。 玉精决言：子能隐学清齐山岳，当以壬癸之日，刻青石黑书九天玉文，埋所住东方，临埋时东向叩齿九通，咒曰：青辱青辱，太山灵岳，九炁郁精，长灵幽黑，三田蓝波，四脚六目，上真宫宅，四域普告，千灵万精，靡不慎伏，玉帝有命，干者刑戮。 毕，埋石深九尺。 此帝君玉文填神上法，文如左： 此天帝君受九天丈人九天玉文，以黑书青石以埋所住岳东方，制万魔，致神仙真人来见，玉女卫形，慎勿传。 玉精决言：当以甲乙之日，刻赤石以青书九天玉文，埋所住岳南方，临埋时〔南〕#2向叩齿九通，咒曰：赤丹阳精，南霍万灵，郁箫育飙，垂幽入冥。 帝官有位，浮命黄宁，自天以下，敢不慎听，有干者戮，有犯者刑。 毕，埋石深九尺。 此玉帝君玉文填神上法，〔文〕#3如左： 此帝君受九天丈人九天玉文，以青书赤石，以填所住岳南方，制万魔，致神仙真人来见，玉女卫形。 得玉精真次，白日升天，秘慎勿传。 玉精决言：当以戊己之日，刻白石以黄书九天玉文，埋所住岳西方，临埋时西向叩齿九通，咒曰：白浩结罗，素云玄阿，西岳万精，乘炁逸波，元始告命，制御三华，四域八炁，悉为我家，有干者斩，有犯者嗟。 毕，埋石深九尺。 此帝君玉文填神上法，文如左： 此帝君受九天丈人九天玉文，以黄书白石，填所住岳西方，制万魔，致仙真人来见，玉女卫身，玉文自明，白日升天，秘勿传。 玉精央言：当以庚辛之日，刻黑石以白书九天玉文，埋所住岳北方，临埋时北向叩齿九通，咒曰：北方恒山，辰星之精，玄茫黑点，协炁放灵，上帝有命，玉文填生，三道扬威，所制不轻，宜各慎令，复尔真形。 毕，埋石深九尺。 此帝君玉文填神上法，文如左： 此帝君受九天丈人九，天玉文，以白书黑石，填所住岳北方，以制万魔，致神仙真人来见，玉女卫形，真决自明，白日升天，秘勿传。 玉精央言：当以丙丁之日，刻黄石以赤书九天玉文，埋所住岳中央，临埋时向王叩齿九通，咒曰：黄炁玄嵩，捴御五方，上垂元令，制妖伏王，于华伯扶，与魔同凶，天一帝灵，受命九阳，元始玉文，填神中宫。 毕，埋石深九尺。 此帝君玉文填神上法，文如左： 此帝君受九天丈人九天玉文，以朱书黄石，填所住岳中央，制万魔，致神仙真人来见，玉女卫身，真次自明，白日升天，秘慎勿传。",
      "translated_text": "When finished, swallow *qi* nine times, then turn north, kneel, and read the memorial incantation as prescribed. Then bury the memorial.\n\nOn the day of the summer solstice, at noon, face southeast. Strike the teeth thirty-two times and recite while looking upward:\n\n*\"Eight *qi* interlace and bind,\nAligning positions to dance in heaven.\nFive revolutions, seven turns—\nTransformation arises in an instant.\nThrice refined, ninefold tested,\nForm renewed, years made young.\nCrossing radiant light, enwrapped in glory,\nEternally preserve the highest immortals.\"*\n\nWhen finished, swallow *qi* nine times and cease. Turn north, kneel, and read the memorial incantation as prescribed. Then bury the memorial.\n\nThe Highest Purple Void Jade Sovereign of the Great Cavern’s Three Luminaries, Disciple of the Eastern Peak’s Master of Mystic Stillness, He Xuanming, aged fifty-six, styled Zifangguo, born in the first month, having received the Three Sincerities, respectfully petitions to open the sacred mountains of the Five Peaks, the Three Offices, Nine Bureaus, and Twelve River Sources. This humble servant, Xuan, presents his name to the Jade Clarity in memorial.\n\nInscribe in vermilion on a silver tablet, face north to read it, then bury the tablet beneath the Dark Mystery Crag, ensuring no one discovers it.\n\nFace north, bow twice, kneel, and read the memorial to completion. Then strike the teeth nine times and softly recite the incantation:\n\n*\"Primal Thearch Sovereign,\nHighest Jade Perfected,\nGolden Immortals, Father and Mother,\nJade Florescence, Purple Dawn.\nGovernor of the myriad *qi*,\nInspector of the true, leader of immortals.\nIn the Upper Azure Palace,\nSeal the numinous immortals.\nName fixed in the celestial register,\nPresented before the Thearch.\nReverently open the Nine Bureaus,\nThree Offices, and River Sources.\nName entered in the Azure Register,\nEternally preserved in perpetuity.\"*\n\nWhen finished, bury the memorial.\n\nThese are the plain words and wondrous formulas of the Thearch Lord, transmitted only to those of bone predestined for immortality. At each seasonal node, perform the above rite, completing twenty-four burials of the inscribed tablet in the sacred peaks over three years. Then the True Sovereign will record the name, and the Thearch will assign twelve jade lads and twelve jade maidens. To recklessly divulge this treasure formula is to invite the annihilation of oneself and one’s descendants. Strictly observe the mystic statutes and guard this practice in secrecy.\n\nThe Jade Essence Formula states: Should you conceal your studies and purify yourself in the mountains, on a *ren* or *gui* day, carve the Nine Heavens Jade Script in black on green stone and bury it in the east of your dwelling. At the moment of burial, face east, strike the teeth nine times, and recite:\n\n*\"Green Obscurity, Green Obscurity,\nSpirit Peak of Mount Tai,\nNine *qi* dense with essence,\nEternally numinous in dark mystery.\nThree Fields of indigo waves,\nFour limbs, six eyes—\nPalace of the Highest Perfected,\nProclaimed throughout the four quarters.\nThousand spirits, myriad essences,\nAll submit in reverence.\nThe Jade Thearch commands:\nThose who transgress shall be executed.\"*\n\nWhen finished, bury the stone nine feet deep.\n\nThis is the Thearch Lord’s Jade Script method for subduing spirits, as follows:\n\nThis Jade Script was received by the Heavenly Thearch Lord from the Nine Heavens Venerable of the Nine Heavens. Inscribed in black on green stone and buried east of one’s dwelling mountain, it subdues myriad demons and summons perfected immortals to appear, with jade maidens guarding the form. Guard this secret closely.\n\nThe Jade Essence Formula states: On a *jia* or *yi* day, carve the Nine Heavens Jade Script in green on red stone and bury it south of your dwelling mountain. At the moment of burial, face south, strike the teeth nine times, and recite:\n\n*\"Vermilion Yang essence,\nSouthern Flame of myriad spirits,\nDense mist nurturing the whirlwind,\nDescending into dark obscurity.\nThe Thearch’s palace holds rank,\nFloating life in Yellow Tranquility.\nFrom heaven above,\nDare none fail to heed.\nThose who transgress shall be executed,\nThose who offend shall be punished.\"*\n\nWhen finished, bury the stone nine feet deep.\n\nThis is the Jade Thearch Lord’s Jade Script method for subduing spirits, as follows:\n\nThis Jade Script was received by the Thearch Lord from the Nine Heavens Venerable of the Nine Heavens. Inscribed in green on red stone and buried south of one’s dwelling mountain, it subdues myriad demons and summons perfected immortals to appear, with jade maidens guarding the form. Upon attaining the true sequence of Jade Essence, one ascends to heaven in broad daylight. Guard this secret closely.\n\nThe Jade Essence Formula states: On a *wu* or *ji* day, carve the Nine Heavens Jade Script in yellow on white stone and bury it west of your dwelling mountain. At the moment of burial, face west, strike the teeth nine times, and recite:\n\n*\"White vastness knits the net,\nPale clouds, dark slopes.\nMyriad spirits of the Western Peak,\nRiding *qi* on flowing waves.\nThe Primal Beginning proclaims the command,\nGoverning the Three Florences.\nFour quarters, eight *qi*—\nAll become my domain.\nThose who transgress shall be slain,\nThose who offend shall lament.\"*\n\nWhen finished, bury the stone nine feet deep.\n\nThis is the Jade Thearch Lord’s Jade Script method for subduing spirits, as follows:\n\nThis Jade Script was received by the Thearch Lord from the Nine Heavens Venerable of the Nine Heavens. Inscribed in yellow on white stone and buried west of one’s dwelling mountain, it subdues myriad demons and summons perfected immortals to appear, with jade maidens guarding the body. The Jade Script reveals itself, enabling ascent to heaven in broad daylight. Guard this secret closely.\n\nThe Jade Essence Formula states: On a *geng* or *xin* day, carve the Nine Heavens Jade Script in white on black stone and bury it north of your dwelling mountain. At the moment of burial, face north, strike the teeth nine times, and recite:\n\n*\"Northern Mount Heng,\nEssence of the Star of Longevity,\nDark vastness, black radiance,\nHarmonizing *qi* to release numinosity.\nThe Thearch commands,\nJade Script subdues life.\nThree Paths display might—\nNone dare transgress lightly.\nAll must heed the decree,\nRestore your true forms.\"*\n\nWhen finished, bury the stone nine feet deep.\n\nThis is the Jade Thearch Lord’s Jade Script method for subduing spirits, as follows:\n\nThis Jade Script was received by the Thearch Lord from the Nine Heavens Venerable of the Nine Heavens. Inscribed in white on black stone and buried north of one’s dwelling mountain, it subdues myriad demons and summons perfected immortals to appear, with jade maidens guarding the form. The true formula reveals itself, enabling ascent to heaven in broad daylight. Guard this secret closely.\n\nThe Jade Essence Formula states: On a *bing* or *ding* day, carve the Nine Heavens Jade Script in red on yellow stone and bury it at the center of your dwelling mountain. At the moment of burial, face the *wang* direction, strike the teeth nine times, and recite:\n\n*\"Yellow *qi*, Mystic Song,\nGoverning the Five Directions.\nAbove, the Primal Decree descends,\nSubduing demons and vanquishing lords.\nThe Earl of Hua assists,\nSharing the same fate as the demonic.\nHeavenly Unity, Thearch’s numen,\nReceiving the command of the Nine Yang.\nPrimal Beginning Jade Script,\nSubdues spirits in the Central Palace.\"*\n\nWhen finished, bury the stone nine feet deep.\n\nThis is the Jade Thearch Lord’s Jade Script method for subduing spirits, as follows:\n\nThis Jade Script was received by the Thearch Lord from the Nine Heavens Venerable of the Nine Heavens. Inscribed in vermilion on yellow stone and buried at the center of one’s dwelling mountain, it subdues myriad demons and summons perfected immortals to appear, with jade maidens guarding the body. The true sequence reveals itself, enabling ascent to heaven in broad daylight. Guard this secret closely.",
      "overlap_context": "he teeth thirty-two times and recite the incantation while looking upward:\n\n*\"Heaven’s essence spreads *qi*,\nVast and pure, flowing with clarity.\nRiding the *wei* to govern the morning,\nRevolving through the five stars.\nYellow Register reflects the soul,\nEastern Florescence preserves life.\nEternally enjoy boundlessness,\nBeginning of kalpas without end.\nPresent the memorial to the Jade Gate,\nNorthern Thearch records the name.\nRoam the mysterious heights,\nFloat in the radiance of Purple Clarity.\"*",
      "start_char": 1254,
      "end_char": 2552,
      "start_sentence": 32,
      "end_sentence": 63,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.78105711936951,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清三真旨要玉诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "右玉精填岳上法，帝君受於九天丈人，口口之决。 依上真玄科，七百年听传其骨应之人，自无玉名，不得妄宣、轻泄神文，考延七祖，殃灭子身，受者慎焉。 秘文奉行。 传真决素语之要，依明科，皆资金鱼、玉龙、青文四十尺，金钮九双，本命之缯百尺，以誓九天之信。 告盟穆清斋幽室，然后传。 违信，师及弟子同罪，鬼官传受之身，各详慎而行。 西王母宝神起居玉经 紫微夫人抄出 夜卧觉常更，又急闭两目，叩齿九通，咽唾三过毕，反舌向喉中，乃摇动头项七过，以手案鼻之边，左右上下数十过，微咒之曰： 九天上帝，三元保婴，太上运华，玉室发精，七门召神，九房受明，耳聪目彻，通真达灵，天中之岳，和气调平，骄女云仪，明童英明，玄聪朗朗，百轩零零，保和上元，徘徊金庭，五藏曜华，耳目常生，神台讲峙，柱梁不倾，七魄藻练，三魂黄宁，太一携手，与我共并，五老混合，无英辅营，万凶消灭，万愿必成，日月守门，心徊景星，仙望所告，万神敬听。 卧觉辄案咒如此，勿忘之也。 真道虽成，故常行焉。",
      "translated_text": "The Jade Essence Mountain-Subduing Method to the right was received by the Thearch Lord from the Nine Heavens Venerable—an oral transmission of utmost secrecy. In accordance with the statutes of the Supreme Perfected, it may be transmitted only once every seven hundred years to those whose bones are predestined to receive it. Those without jade names must not rashly disclose or lightly reveal this divine scripture; violators will bring calamity upon their seven ancestral generations and annihilation upon their own bodies. Let the recipient be vigilant.\n\nThis secret scripture is to be reverently practiced. For the transmission of its true oral instructions, in accordance with the luminous statutes, one must provide: a golden fish, a jade dragon, forty feet of azure silk, nine pairs of golden buttons, and one hundred feet of silk bearing the recipient’s life-tally, all as pledges of faith before the Nine Heavens. The oath is to be sworn in a secluded chamber during the Muqing Fast. Only then may the transmission proceed. Should the pledge be broken, both master and disciple shall share the same punishment. Let all who receive this transmission from the ghostly officials proceed with utmost caution.\n\n---\n\n*Precious Divine Jade Scripture on the Rising and Resting of the Queen Mother of the West*\nCopied by the Lady of Purple Tenuity\n\nUpon waking at night, immediately close both eyes, click the teeth nine times, and swallow saliva three times. Then press the tongue against the throat, shake the head and neck seven times, and with the hands, rub the sides of the nose—left and right, up and down—dozens of times. Softly recite the incantation:\n\n*\"Nine Heavens Thearch,\nThree Origins protect the infant.\nThe Supreme deploys the flower,\nJade chamber emits essence.\nSeven gates summon spirits,\nNine chambers receive illumination.\nEars keen, eyes clear,\nCommuning with the Perfected, penetrating the numinous.\nThe mountain within heaven,\nHarmonious qi in balance.\nCloud-demeanored Maid,\nBright Lad of radiant wisdom.\nMysterious hearing, resplendent,\nHundred halls gleaming.\nPreserve harmony in the Upper Origin,\nWandering the Golden Court.\nFive viscera radiant,\nEars and eyes ever-vital.\nSpirit terrace stands firm,\nPillars and beams unshaken.\nSeven po refined,\nThree hun in yellow serenity.\nThe Great One takes my hand,\nWalking beside me.\nFive Elders merge as one,\nWu Ying aids the encampment.\nMyriad evils vanish,\nMyriad wishes fulfilled.\nSun and moon guard the gates,\nHeart roams with auspicious stars.\nWhat the immortal longs for is proclaimed—\nTen thousand spirits heed with reverence.\"*\n\nUpon waking, perform this pressing and incantation without fail. Let it not be forgotten. Though the true Dao may be attained, this practice must still be observed continually.",
      "overlap_context": "t deep.\n\nThis is the Jade Thearch Lord’s Jade Script method for subduing spirits, as follows:\n\nThis Jade Script was received by the Thearch Lord from the Nine Heavens Venerable of the Nine Heavens. Inscribed in vermilion on yellow stone and buried at the center of one’s dwelling mountain, it subdues myriad demons and summons perfected immortals to appear, with jade maidens guarding the body. The true sequence reveals itself, enabling ascent to heaven in broad daylight. Guard this secret closely.",
      "start_char": 2553,
      "end_char": 2982,
      "start_sentence": 64,
      "end_sentence": 75,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.34013342857361,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清三真旨要玉诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "此《太上西王母宝神起居玉经》上法也。 令人耳目聪明强识也。 朗鼻中调平，不生洟秽，四乡八彻，面有童颜，制魂录魄，却辟万魔，此是真人起居之妙道也。 所以名之为起居者，起居当行之故也。 毕，又以两手拭面目，令小热以为常，每欲数之也。 阿母云：人之将老，面皮先从两目下始。 又人之体裹炁少者，先从两鼻间始也。 谓此二处皮裹之户牖，炁力之关津，故起居常行此法，以辟皮而炁力常保康和也。 西王母宝生无死玉经 紫微夫人抄出 无死玉经曰：手披华庭侧，迁延〔和〕#4天真，上入神间房，玉谷填天山，〔内〕#5源玄灵见，万魔自拭身，长生永无死，玉籍反帝君，由兆和天真，按#6此幽山源。 天真在两眉之间，眉内两角也，天真在一分下耳，是引灵之上房矣。 内原在鼻下人中之上本侧，在鼻下小入孔谷中也，是玄灵灭魔之门户矣。 华庭在两眉之下，对眉之中央，是彻〔视〕#7之津梁也。 旦将起，暮将卧，便急闭目，以舌反向喉中，咽唾三过，急以手案此三处各三九过，当阴案之，勿举手也。 以为常，令人长生无死，降灵彻视，塞灭万鬼之道。 手案既毕，而微咒曰： 太上虚皇，开散玉庭，金房煌朗，翠台郁青，我摄三道，灭鬼生灵，我既无死，亦能无生，常生〔自在〕#8，回老反婴，魂魄柔练，五神安宁，回飙灵输，北谒玉清，上升太无，与日合并，遂为真人，帝君合冥，三无所告，万神敬听。 有楚庄公时市长宋原甫者，有善心，恒自扫除一市中，久乃〔有〕#9一乞食人，入市经月，旦乞歌辞曰：天挺生金华，内源彰阴耶，玉谷参玄乡，琼无互扶罗，天真立日上，飞〔药〕#10吐灵妙，清晨案天马，徊驾神玄家，仙人来入室，又以拭百魔。 临去，又题市门如此。 楚一市人无解者，而原甫意中忽悟，疑是仙人，但不解其歌旨耳。 遂乃叩头谘请，久久不已，乞人告之曰：吾实真人者也，此言是昆仑王母宝生无死之道，知者使人不死。 遂授原甫要法施密央，积廿年，原甫白日升天，今在玄州，位为仙卿。 楚市乞人，是南岳真人赤松子矣，分形布影，假适尘浊，游#11眺嚣秽，招延冥会也。 清灵真人裴君说神宝经 求要道，先令目清耳聪，为事主也。 且耳目是寻真之梯级，综灵之门户，得失系之而立，存亡须之而办也。 今钞经相示，可施用也。 消魔上篇曰：耳欲得数案抑其左右，示令无数，所谓营#12治城郭，名书皇籍。 鼻亦欲数得案其左右，唯令数耳，所谓灌溉中岳，名书帝录。 此二条出方丈台昭灵李夫人口次，九月十二日夜喻。 道日，恒以手案两眉后小穴中三九过，又以手心及指摩目下权上，以手提耳，行三十过，摩唯令数无时节也。 毕，辄以手逆乘额三九过，从眉中始，乃上行入发际中，口傍咽唾多少无数也。 如此常行，目日清明，一年可夜书。 亦可於人中密为之，勿语其状。 眉后小空中，为上无六合之府，主化生眼晖，和莹精光，长珠彻童，保练目辰，是真人坐起之上道也。 一名曰真人常居内经。 真人喭曰：子欲夜书，常修常居矣。 真人所以能旁观四达，使八遐照朗者，寔常居之数明也。 目下权上，是决明保室归婴至道，以手提耳行者，深明映之术也。",
      "translated_text": "This is the superior method of *The Supreme Western Queen Mother’s Precious Scripture on the Jade Rites of Rising and Resting*. It sharpens the ears and brightens the eyes, strengthening perception and memory. The nose remains balanced and clear, free from mucus and filth. The four directions and eight reaches become luminous, the face retains a youthful glow, the hun and po are governed, and all demons are repelled—this is the wondrous Dao of the Perfected One’s rising and resting.\n\nIt is called \"rising and resting\" because these are the practices to be observed upon waking and before sleep. Upon completion, rub the face and eyes with both hands until slightly warm, making this a regular habit to be performed frequently.\n\nThe Divine Mother said: When a person grows old, the skin of the face begins first beneath the eyes. When the body’s qi wanes, it starts between the nostrils. These two places are the windows of the skin and the passes of qi’s power. Thus, the rites of rising and resting are practiced constantly to protect the skin and preserve the harmony and vigor of qi.\n\n*The Western Queen Mother’s Precious Scripture of Jade on Life Without Death*\nCopied by the Lady of Purple Tenuity\n\nThe Scripture of Jade on Life Without Death states:\nHands part the blossoming courtyard’s side,\nLingering in harmony with the celestial Perfected.\nAbove, enter the chambers of the spirit,\nJade valleys fill the celestial mountains.\nThe inner source reveals the mysterious numen,\nMyriad demons wipe themselves away.\nEternal life without death,\nJade registers return to the Lord Emperor.\nThrough you, harmony with the celestial Perfected,\nPress this hidden mountain’s source.\n\nThe celestial Perfected resides between the brows, at the inner corners of the eyes. A fraction below the celestial Perfected lies the upper chamber of spirit conduction. The inner source is at the root of the philtrum above the upper lip, within the small hollow beside the nostrils—this is the gate where the mysterious numen extinguishes demons. The blossoming courtyard lies below the brows, at their central point, the bridge of luminous vision.\n\nAt dawn upon rising and at dusk before sleep, swiftly close the eyes, turn the tongue toward the throat, and swallow saliva three times. Then press these three places, each twenty-seven times, applying gentle pressure without lifting the hands. Make this a constant practice, and one will attain life without death, summon spirits, achieve luminous vision, and block the paths of all ghosts.\n\nAfter pressing, softly recite the incantation:\nSupreme Void Sovereign,\nDisperse the jade courtyard.\nThe golden chamber gleams resplendent,\nThe jasper terrace lush and verdant.\nI seize the three paths,\nExtinguishing demons and birthing spirits.\nSince I am without death,\nI am also without birth.\nEver abiding in freedom,\nReversing age to return to infancy.\nHun and po refined and supple,\nThe five spirits at peace.\nThe whirling gale conveys the numinous carriage,\nNorthward I visit Jade Purity.\nAscending to the Great Void,\nMerging with the sun,\nI become a Perfected One,\nThe Lord Emperor unites in darkness.\nThe Three Voids receive my proclamation,\nMyriad spirits heed with reverence.\n\nIn the time of Duke Zhuang of Chu, there was a market overseer named Song Yuanfu, a man of good heart who constantly swept the marketplace. After some time, a beggar appeared in the market, staying for a month. Each morning, he would beg while singing:\nHeaven bestows the golden blossom,\nThe inner source reveals the hidden mystery.\nJade valleys join the mysterious realm,\nJasper and void mutually support.\nThe celestial Perfected stands above the sun,\nFlying elixir spouts wondrous numen.\nAt dawn, press the celestial steed,\nWandering to the divine and mysterious abode.\nThe immortal enters the chamber,\nWiping away all demons.\n\nBefore leaving, he inscribed these words on the market gate. No one in the Chu marketplace understood them, but Yuanfu suddenly grasped their meaning and suspected the beggar was an immortal—though he did not comprehend the song’s purport. He knelt and earnestly entreated, persisting for a long time. The beggar finally told him: \"I am indeed a Perfected One. These words are the Queen Mother of Kunlun’s *Precious Dao of Life Without Death*. Those who know it do not die.\" He then transmitted the essential and secret methods to Yuanfu. After twenty years of practice, Yuanfu ascended to heaven in broad daylight. Now he resides in the Dark Realm, holding the rank of Immortal Minister.\n\nThe beggar in the Chu marketplace was none other than the Perfected One of the Southern Marchmount, Red Pine, who had divided his form and spread his shadow to temporarily dwell in the dust and filth, wandering through the clamor and impurity to summon hidden encounters.\n\n*The Pure Numinous Perfected One, Master Pei, on the Scripture of Divine Treasures*\nTo seek the essential Dao, first clarify the eyes and sharpen the ears, for they are the masters of all affairs. Moreover, the ears and eyes are the ladder to seek the Perfected and the gate to gather the numinous. Success and failure depend on them, and life and death are determined by them. Now this scripture is copied and presented for practical use.\n\n*The Superior Chapter on Dispelling Demons* states:\nFrequently press and restrain the ears on both sides, but do not overdo it—this is called \"tending the city walls\" and \"inscribing the imperial register.\"\nAlso, frequently press the sides of the nose, but only in moderation—this is called \"irrigating the central marchmount\" and \"inscribing the emperor’s records.\"\nThese two methods were spoken by Lady Li of the Illustrious Numen of Fangzhang Terrace on the night of the twelfth day of the ninth month.\n\nThe Dao says: Constantly press the small hollows behind the brows twenty-seven times. Also, rub the area beneath the eyes and above the cheekbones with the palms and fingers, and pull the ears thirty times. Rub frequently without fixed times. Upon completion, stroke the forehead upward twenty-seven times, beginning between the brows and moving into the hairline. Swallow saliva as often as desired. Practicing this regularly will clarify the eyes day by day, and within a year, one may read at night. It may also be done discreetly at the philtrum without revealing the method.\n\nThe small hollows behind the brows are the mansion of the Upper Six Harmonies, governing the generation of eye radiance, the harmony and luster of essence and light, the preservation of the pupil’s clarity, and the refinement of the celestial orbs—this is the supreme Dao of the Perfected One’s rising and resting. It is also called *The Perfected One’s Constant Abiding Inner Scripture*.\n\nThe Perfected One sighed and said: \"If you wish to read at night, constantly cultivate the *Constant Abiding*.\" The reason the Perfected One can observe all directions and illuminate the eight distant reaches is truly the clarity of the *Constant Abiding*’s methods.\n\nThe area beneath the eyes and above the cheekbones is the chamber of decisive clarity, the returning-infancy supreme Dao. Pulling the ears is the art of deep illumination.",
      "overlap_context": "n in yellow serenity.\nThe Great One takes my hand,\nWalking beside me.\nFive Elders merge as one,\nWu Ying aids the encampment.\nMyriad evils vanish,\nMyriad wishes fulfilled.\nSun and moon guard the gates,\nHeart roams with auspicious stars.\nWhat the immortal longs for is proclaimed—\nTen thousand spirits heed with reverence.\"*\n\nUpon waking, perform this pressing and incantation without fail. Let it not be forgotten. Though the true Dao may be attained, this practice must still be observed continually.",
      "start_char": 2982,
      "end_char": 4236,
      "start_sentence": 76,
      "end_sentence": 115,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.77140712738037,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清三真旨要玉诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "於是理门血散，皮兆不生，目华玄照，和精神盈矣。 夫人之将老，鲜不先始於耳目也。 又老形兆，亦发始於目际之左右也#13。 夫修真之诀，每以旦夕凝神定息，良久以手乘额上，内存赤子，日月双明，上元欢喜，三九始眉，数毕乃止。 此谓手朝三元固脑坚发之道也。 头四面以手乘之，顺发就结，唯令多也，於是头血流散，风湿不凝。 都毕，以手按目四眦二九，觉令〔见〕#14光分明，是检眼神之道，久久为之，得见百灵。 《赤字经》#15曰：常能以手掩口鼻，临目彻视久许时，手中生液，追以手摩面目，常行之，使人体香。 《太上天关玉经》曰：常以手按目近鼻之两眦，闭气为之，气通辄止，吐而复始，常行之，眼能洞观也。 右二条南狱魏夫人所出。 《丹字紫书三五顺行经》曰：坐欲闭目内视，存见五脏肠胃，久行之，自得分明了了也。 《太素丹景经》曰：一面之上，常欲得两手摩拭之使热，高下随形，皆使极匝，令人面有光泽，皱斑不生，行之五年，色如少女，所谓山川通气，常盈不没。 《丹景经》曰：先当摩切两手令热，然后以拭面目，毕乃顺手摩发，如理栉之状，两臂〔亦〕#16更互以手摩之，使发不白，脉不浮大#17。 《大洞真经精景按摩篇》曰：卧起当平气正坐，先叉两手，乃度掩项后，因仰面视上，与项争，使#18项与两手争也，为之三四止，使人精和血通，风气不入，能久行之，不死不病。 又屈动身体，申手四极，反张侧掣，动播百关，为之各三。 卧起，先以手巾若厚帛，拭口四面及耳后，使圆匝热，温温然也，顺发摩头#19，若理栉之无在也，良久摩两手以治面目，久行之，使人目明而邪气不干，形体不垢腻，去秽也。 都毕，而咽液三十过，以导内液。 右一条出《大洞精景经》中也。 西王母反胎按摩玉经#20 紫微夫人抄出",
      "translated_text": "Thus, when the blood flows smoothly through the gates of regulation, no blemishes arise upon the skin, the eyes’ radiance shines darkly and profoundly, and harmony and spirit flourish in abundance. Now, when a person approaches old age, it seldom begins anywhere but in the ears and eyes. Moreover, the signs of aging in the body also first appear beside the outer corners of the eyes.\n\nThe secret of cultivating the true Dao lies in concentrating the spirit and settling the breath at dawn and dusk. After a long while, place the hands upon the forehead, inwardly visualize the infant, the dual luminaries of sun and moon, and the joy of the Upper Prime. Begin at the brows and count three cycles of nine, ceasing only when the count is complete. This is called *The Way of the Hands Paying Homage to the Three Primes to Fortify the Brain and Strengthen the Hair*.\n\nStroke the four sides of the head with the hands, smoothing the hair into place and gathering it together—only let it be done thoroughly. In this way, the blood of the head flows freely, and wind-dampness does not congeal. When all is complete, press the four corners of the eyes eighteen times, until the light is perceived with perfect clarity. This is the method for examining the spirit of the eyes. Practiced over time, it enables one to see the hundred spirits.\n\nThe *Red-Writing Scripture* states: \"Often cover the mouth and nose with the hands, gaze intently through the eyes for a long while, and let fluid arise within the palms. Then use the hands to rub the face and eyes. Practicing this constantly will make the body fragrant.\"\n\nThe *Celestial Pass Jade Scripture of the Most High* states: \"Often press the corners of the eyes near the nose with the hands, holding the breath while doing so. Cease when the qi flows through, then exhale and begin anew. Practicing this constantly will enable the eyes to perceive with penetrating clarity.\"\n\nThe two preceding passages were transmitted by Lady Wei of the Southern Peak.\n\nThe *Three-Five Sequential Practice Scripture of the Cinnabar-Writing Purple Book* states: \"When sitting, close the eyes and inwardly visualize the five viscera and the intestines and stomach. Practicing this over time will naturally bring clarity and distinctness.\"\n\nThe *Great Simplicity Scripture of the Cinnabar Radiance* states: \"On the face, it is always desirable to rub with both hands until warm, following the contours up and down until thoroughly covered. This will give the face a lustrous glow and prevent wrinkles and blemishes. Practicing this for five years will make the complexion like that of a young maiden—this is what is meant by the qi of mountains and rivers flowing freely and remaining ever full without depletion.\"\n\nThe *Scripture of the Cinnabar Radiance* states: \"First rub the two hands together until hot, then use them to wipe the face and eyes. Afterward, stroke the hair with the hands as if combing it. Alternate the two arms, rubbing them with the hands, to prevent the hair from turning white and the vessels from becoming superficial and enlarged.\"\n\nThe *Massage Section of the Essence and Radiance of the Great Cavern True Scripture* states: \"When rising from bed, sit upright and regulate the breath. First clasp the hands together and raise them to cover the back of the neck. Then tilt the head back to look upward, straining the neck against the hands. Do this three or four times to harmonize the essence and circulate the blood, preventing the intrusion of wind-qi. Practicing this over time will prevent death and illness. Furthermore, bend and stretch the body, extend the hands to the four extremities, arch the back, and pull the sides, moving and shaking all the joints—each three times.\n\nUpon rising, first use a handkerchief or thick cloth to wipe the mouth on all sides and behind the ears until thoroughly warm. Then stroke the head with the hands, smoothing the hair as if combing it, leaving no part untouched. After a long while, rub the two hands together and use them to tend to the face and eyes. Practiced over time, this will brighten the eyes and prevent evil qi from assailing them, keeping the body free from grime and grease, and dispelling filth. When all is complete, swallow the saliva thirty times to guide the inner fluids.\"\n\nThe preceding passage is from the *Essence and Radiance of the Great Cavern Scripture*.\n\nThe *Jade Scripture of Reversed Womb Massage of the Queen Mother of the West*, transcribed by Lady Purple Tenuity.",
      "overlap_context": "led *The Perfected One’s Constant Abiding Inner Scripture*.\n\nThe Perfected One sighed and said: \"If you wish to read at night, constantly cultivate the *Constant Abiding*.\" The reason the Perfected One can observe all directions and illuminate the eight distant reaches is truly the clarity of the *Constant Abiding*’s methods.\n\nThe area beneath the eyes and above the cheekbones is the chamber of decisive clarity, the returning-infancy supreme Dao. Pulling the ears is the art of deep illumination.",
      "start_char": 4236,
      "end_char": 4972,
      "start_sentence": 116,
      "end_sentence": 135,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.50971794128418,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清三真旨要玉诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "养生之道，以耳目为主，杂视则目暗，广忧则耳闭，此二病从中来而结疾，非外客之假祸也。 所谓闻道难也，非闻道之难，行道难也，非行道之难，而终道难矣。 若夫耳目乱想，不遣艰难，虽复足蹑仙阁，手攀龙辕，犹无益也。 反胎按摩#21，常以阳日。 月一日为阳。 每阳日之旦，阳日之夜，夜卧觉，旦将起，急闭目向本命之方，以两手掌相摩切，令小热，各左右拭按两目就#22耳门，令两掌相交，会於项中九过，又存两目中各有紫赤黄三色云气，各下入两耳中，良久，阴祝曰： 眼瞳三云，明目真君，英明注精，开通帝神，太玄云仪，玉灵敷篇，保利双阙，启彻九门，百节应响，回液泥丸，身升玉官，列为上真。 祝毕，咽液三过，毕乃开目。 以为常，阳日坐起，常可行此，不必旦暮也。 行之三年，耳目聪明。 理发常向本命，既栉发之始，而阴祝曰： 太帝散灵，五老反神，泥丸玄华，保精长存，左拘隐月，右引日根，六合清炼，百神受恩。 毕。 常#23行之，使人头脑不痛。",
      "translated_text": "The Dao of nurturing life takes the ears and eyes as its foundation. Scattered vision dims the eyes, and excessive worry blocks the ears—these two afflictions arise from within and congeal into illness, not from external misfortunes invading from without.\n\nWhat is called \"the difficulty of hearing the Dao\" does not lie in hearing the Dao itself, but in practicing it; yet even practicing the Dao is not so difficult as bringing it to completion. If the ears and eyes are disordered by stray thoughts and one does not dispel hardship, then even if one’s feet tread the halls of immortals and one’s hands grasp the dragon’s reins, it will still be of no benefit.\n\nThe Reversed Womb Massage should be performed regularly on yang days—the first day of the lunar month is a yang day. On the morning and night of each yang day, when lying in bed at night and upon awakening before rising in the morning, swiftly close the eyes and face the direction of one’s life destiny. Rub the two palms together until slightly warm, then use them to wipe and press the eyes and ear openings on both sides. Cross the hands so they meet at the nape of the neck, repeating this nine times. Next, visualize within each eye a cloud of three colors—purple, red, and yellow—each descending into the two ears. After a long while, recite the following incantation:\n\n*\"Triple clouds of the eye pupils, Radiant Lords of Vision,\nBrilliant and luminous, they infuse essence,\nOpening and connecting the divine spirits.\nGreat Mystery’s cloud insignia, Jade Numinosity’s unfolding scripture,\nGuard and benefit the twin gates,\nUnseal and penetrate the nine portals.\nAll joints respond in resonance,\nRevolving fluids ascend to the Mud Pill.\nThe body ascends to the Jade Palace,\nRanked among the highest perfected.\"*\n\nAfter the incantation, swallow the saliva three times, then open the eyes. Make this a regular practice; on yang days, whether sitting or rising, one may perform this at any time, not only at dawn and dusk. Practicing this for three years will sharpen the ears and brighten the eyes.\n\nWhen combing the hair, always face the direction of one’s life destiny. At the start of combing, recite the following incantation:\n\n*\"Great Thearch disperses numinosity,\nFive Elders return the spirit,\nMysterious flower of the Mud Pill,\nPreserves essence and ensures its longevity.\nOn the left, the hidden moon is restrained;\nOn the right, the sun’s root is drawn.\nThe six harmonies refine and purify,\nA hundred spirits receive grace.\"*\n\nPerform this regularly to prevent head and brain pain.",
      "overlap_context": "ands together and use them to tend to the face and eyes. Practiced over time, this will brighten the eyes and prevent evil qi from assailing them, keeping the body free from grime and grease, and dispelling filth. When all is complete, swallow the saliva thirty times to guide the inner fluids.\"\n\nThe preceding passage is from the *Essence and Radiance of the Great Cavern Scripture*.\n\nThe *Jade Scripture of Reversed Womb Massage of the Queen Mother of the West*, transcribed by Lady Purple Tenuity.",
      "start_char": 4972,
      "end_char": 5378,
      "start_sentence": 136,
      "end_sentence": 149,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.38417911529541,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清三真旨要玉诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "《太极绿华经》曰：理发欲向王地，既栉〔发〕#24之始，而微祝曰： 泥丸玄华，保精长存，左为隐月，右为日根，六合清炼，百神受恩。 毕，咽液三遍。 能〔常〕#25行之，使发不落而日生。 当数易栉，栉之取多而不使痛。 亦可令侍者栉取多也，於是血脉不滞，发根常坚。 右二条安九华所告令施用。 坐卧常欲鼻孔向本命，饮食亦然，若不得向本命，常向东北及西北亦佳，此二处是天地魂魄之门津也。 又卧常自左右摇动身体，数十过毕，又两手据后面，举头向天，左右摇动二十一过毕，平坐举手指天，良久毕。 又摩两掌以拭目，傍至两耳，又良久，阴祝曰： 前搏后指，天帝上客，左盻右顾，长生大度，仰头喘食，太一相极，却目龙隐，司命同翰，饮食胎元，交阙昆仑，徊倒双忌，真人同志。 祝毕，暂引气闭之，存脐中赤气大如珠，出外入鼻中，如此三过，按摩之道都毕，使人百关通利，长生不病。 《紫度炎光内视中方》曰：常欲目闭而卧，安身微气，使如卧状，令我并人不觉也，乃内视远－听四方，令我耳目注万里之外，久行之，亦自见万里之外事，精心为之，乃见百万里卧事也。 又耳亦常闻金玉之音，丝竹之声，此妙法也。 四方者，总其言耳，当先一方而内注视听，初为之实无仿髴，久久神自入妙。 《大洞真经高上内章》遏邪大祝上法曰：每当经危险之路，鬼庙之间，意有疑难之处，心有微忌，勅所经履者，乃当反舌内向喉，咽液三过毕，以左手第二、第三指捻两鼻孔下人中之本，鼻中鬲孔之内际也，三十六过，即手急按，勿举指计数也，鼻中鬲之际名曰山源，一名鬼井，一名神池，一名邪根，一名魂台也。 捻毕，因叩齿七通，又进手心以掩鼻，於是临目，乃祝曰： 朱乌凌天，神威内张，山源四镇，鬼井逃亡，神池吐气，邪根伏藏，魂台四明，琼房零琅，玉真巍峨，坐镇明堂，手晖紫霞，头建神光，执咏洞经，三十九章，中有辟邪龙虎，截狱斩岗，猛狩奔牛，衔刀吞枪，揭山攫天，神雀毒龙，六头吐火，啖鬼之王，电猜雷父，掣星流横，枭磕驳灼，逆风横行，天禽罗阵，皆在我傍，吐火万丈，以除不祥，群精启道，封落山乡，千神百灵，并首叩颗，泽尉捧炉，为我烧香，所在所经，万神奉迎。 毕，又叩齿三通，乃开目，除去左手。 〔手〕#26按山源则鬼井门闭，手薄神池则邪根散分，手临魂台则玉真守关，於是感激灵根，天兽来卫，千精震伏，莫干我真。 此自然之理，〔使〕#27忽尔而然也。 鼻下山源，是一身之疵津，真邪之通府，不真者所以生邪气，为真者所以遏万邪，在我运摄之耳，故吉凶兆焉。 明堂中亦一身之神池，死生之形府，七魄元室，三魂灵宅，存其神可以眇乎内观，废其道所以致乎朽烂，故由我御，慎顺其卫，生悔吝定也。 右四条，出《大洞真经》高上首章。 太虚真人曰：风病之所生，生於丘坟阴湿，三泉壅滞，是故地官以水气相激，多作风痹，风痹之重者举体不遂，轻者半身不遂，或失手足也。 常梦在东北及西北经故居，或见灵床处所，正欲与冢气接耳。 墓之东北为绝命，西北为九厄，此皆冢讼之凶地，若见亡者於其间，益验也。 若每遇此梦者，卧觉当正面向上，三琢齿而祝曰：",
      "translated_text": "The *Scripture of the Supreme Ultimate’s Verdant Efflorescence* states: When combing the hair, face the direction of one’s ruling earthly branch. At the start of combing, recite softly:\n\n*\"Mud Pill’s mysterious flower,\nPreserves essence and ensures its longevity.\nOn the left, the hidden moon;\nOn the right, the sun’s root.\nThe six harmonies refine and purify,\nA hundred spirits receive grace.\"*\n\nAfter reciting, swallow the saliva three times. Practicing this regularly will prevent hair loss and stimulate new growth. Frequently change combs, using one with many teeth but without causing pain. One may also have an attendant comb the hair to ensure thoroughness, thereby preventing blood stasis and strengthening the hair roots.\n\nThe above two methods were taught by An Jiuhua for daily practice.\n\nWhen sitting or lying down, always direct the nostrils toward one’s life destiny; the same applies when eating and drinking. If unable to face one’s life destiny, orienting toward the northeast or northwest is also beneficial, for these two directions are the gateways of heaven and earth’s hun and po souls.\n\nFurthermore, when lying down, gently rock the body from side to side several dozen times. Then, pressing both hands behind, lift the head toward the sky and rock left and right twenty-one times. Afterward, sit upright, raise the hands toward heaven, and remain so for a long while. Next, rub the palms together and wipe the eyes, extending the motion to the ears, and pause again for",
      "overlap_context": "e eyes.\n\nWhen combing the hair, always face the direction of one’s life destiny. At the start of combing, recite the following incantation:\n\n*\"Great Thearch disperses numinosity,\nFive Elders return the spirit,\nMysterious flower of the Mud Pill,\nPreserves essence and ensures its longevity.\nOn the left, the hidden moon is restrained;\nOn the right, the sun’s root is drawn.\nThe six harmonies refine and purify,\nA hundred spirits receive grace.\"*\n\nPerform this regularly to prevent head and brain pain.",
      "start_char": 5379,
      "end_char": 6634,
      "start_sentence": 150,
      "end_sentence": 177,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.218553304672241,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清三真旨要玉诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "太元上玄，九都紫天，理魂护命，高素真人，我佩上法，受教太玄，长生久视，身飞体仙，冢墓永安，鬼讼塞关，魂魄和悦，恶气不烟，妖魅魍魉，敢干我神，北帝呵制，收气入渊，得录上皇，谨奏玉晨。 如此者再祝，又三叩齿，则不复梦冢墓及家死鬼也。 此北帝秘祝，有心好事者，皆可行之。 若经常得恶梦不祥者，皆可按行此法，於是鬼气灭亡，邪魅散形也。 手臂不援者，沈於风毒气在脉中，结附痹骨使然耳，自宜针灸则愈，又宜按北帝曲折之祝，若行之百过，疾亦消除也。 先以一手徐徐按摩疾臂，良久毕，乃临目内视，咽液三过，叩齿三通，心微祝曰： 太上四玄，五华六庭，三魂七魄，天关地精，神府营卫，天胎上明，四支百神，九节万灵，受录玉晨，刊书玉城，玉女侍身，玉童护命，永齐二景，飞仙上清，长与日月，年俱后倾，超腾升仙，得整太平，流风结痾，注鬼五龙#28，魍魉冢气，阴气相回，凌我四支，干我盛衰，太上天丁，龙虎耀威，斩鬼不祥，风邪即摧，考注匿讼，百毒隐非，使我复常，日月同晖，考注见犯，北辰收摧，如有干试，千明上威。 毕。 《太上录淳散华经》上按摩法，常以生气时咽液二七过，毕按体所痛处，向王而祝曰： 左玄右玄，三神合真，左黄右黄，六华相当，风气恶疾，伏匿四方，玉液流泽，上下宣通，内遣水火，辟除不祥，长生飞仙，身常休强。 毕又咽液二七遍，常如此则无疾，又当急按所痛处二十一过也。 右一条，十月二十二日沧浪云林宫右英夫人所出。 《消魔上灵经》曰：若体中不宁，当反舌塞喉，漱津咽掖无数，须臾不宁之痾自即除也，当时亦当觉体中宽软也。 右一条，出《消魔上灵经叔》中。 梦寐不真，魄协邪气以挠其心，欲伺我神之间伏也。 每遇恶梦，但北向启太上大道君，具言其状，不过四五，则自消绝也。 青童君口诀曰：夜遇恶梦非好觉，当即反枕而祝曰： 太灵玉女，侍真卫魂，六宫金童，来守生门，化恶反善，上书三元，使我长生，乘景驾云。 毕，咽液七过，叩齿七通，而更卧。 如此四五，亦自都绝也。",
      "translated_text": "The Supreme Primordial of the Great Origin, the Purple Heaven of the Nine Capitals, governs the hun-soul and protects life—O Lofty and Pure Perfected One. I don the supreme method and receive the teachings of the Great Mystery. May I attain long life and enduring vision, my body ascending as an immortal. May the tombs remain eternally at peace, the gates of ghostly litigation sealed. May my hun and po souls be harmonious and joyful, evil qi dispersed like smoke. Should demonic spirits, wangliang, or any malevolent beings dare offend my spirit, may the Northern Emperor rebuke and restrain them, drawing their qi into the abyss. May I be recorded in the registers of the Supreme Sovereign and reverently presented to the Jade Dawn.\n\nRecite this invocation twice, then knock the teeth together three times, and the dreams of tombs and deceased household spirits shall no longer recur. This is the Northern Emperor’s secret prayer; those of sincere and virtuous intent may all practice it. For those frequently afflicted by inauspicious dreams, this method may be applied, thereby vanishing ghostly qi and scattering evil spirits.\n\nIf the arms fail to move, it is due to wind-toxin qi lodged within the meridians, binding and numbing the bones. Acupuncture and moxibustion are fitting remedies, and the Northern Emperor’s prayer of bending and turning may also be employed. If practiced a hundred times, the illness will dissipate. First, gently massage the afflicted arm with one hand for a long while. Then, close the eyes, inwardly gaze, swallow saliva three times, and knock the teeth together three times. Silently recite:\n\nSupreme Four Mysteries, Five Flowers and Six Courts, Three Hun and Seven Po, Heavenly Pass and Earthly Essence, Divine Palace",
      "overlap_context": " or northwest is also beneficial, for these two directions are the gateways of heaven and earth’s hun and po souls.\n\nFurthermore, when lying down, gently rock the body from side to side several dozen times. Then, pressing both hands behind, lift the head toward the sky and rock left and right twenty-one times. Afterward, sit upright, raise the hands toward heaven, and remain so for a long while. Next, rub the palms together and wipe the eyes, extending the motion to the ears, and pause again for",
      "start_char": 6634,
      "end_char": 7456,
      "start_sentence": 178,
      "end_sentence": 197,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.626410484313965,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清三真旨要玉诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "此祝亦反恶梦，而更为吉祥也。 右十一月十三日夜右英夫人所出。 夫玄象灵枢，达观所适，冲心秀朗，虚浪神味，咀吸太和，体气清寥，於是琼振奏响，万籁冥招矣。 夫气者神明之器匠，清浊之宗渊，处玄则天清，在人则身存。 夫生死亏盈，盖顺乎摄御之间也。 欲服六气，常以向晓面#29丑寅之际，因以天时造始#30，必以方面此之时也。 太霞部晖，丹阳诞光，灵景启晨，朱精发明之始也。 先存日如鸡子在泥丸中，毕乃吐出一气，存气为黑色，名之尸气也； 次吐二气，存气白色，名之故气也； 次吐三气，存气为苍色，为之死气也。 思以其气吐，亦良久也。 凡出三色，合吐六气也。 毕，又徐徐纳引黄气四过，毕辄咽液三过，为之三毕，乃存泥丸中日上从目中出，当口前，令相去面九寸，临目仿髴如见之，复乘日#31纳引，取赤气七过，七过毕，复咽液三过止，乃起坐，动摇四体，俯仰屈申，令关脉调转，都毕也。 存咽液，须令青色。 夜亦可存月在泥丸中，如存日法。 若存月，当以月一日夜至十五日佳，从十六日至三十日是月气衰损，天胎亏缩，不可以夜存月也。 此法至妙，能行者神仙，所以吐纳胎漱，呼吸明真，呼召五咽，体得自然，魂还绛宅，魄归泥丸，所以长生也。 岂同操幽谷之阴气，求奔马之灵神，步涉海以求济，策毛车於火山。 可不慎哉，可不慎哉。 右出《西王母叙诀》。 乙丑岁兴宁三年七月四日夜，司命东卿君来降，侍从七人入户。 其一人执紫旎之节，其一人执华旛，一人执十绝灵婶，一人带录#32章囊，三人捧白牙箱，箱中似书也，其一人握流金火铃，侍人并朱衣。 司命君形甚少於二弟，着青锦绣裙，紫毛帔巾，芙蓉冠，二弟并同来侍立，命坐乃坐耳，言语良久。 七月六日夜，司命君又降，良久，喻书曰：若必范玄秉象，清静罕时，遂拔群幽藻，戢翼高栖，感味上契，渊停岳峙，萧寥玉篇，玩宝神生，遗放俗恋，调弹清灵，澄景虚中，五道发明，色绝化浪，欲与淡并，空洞冥衢，无视无听，尔乃远齐妙真，重起玄觉，明德内圆，灵摽外足矣，终能策云軿以赴霄，书司命之丹录耳。 若精散万念，为生不固，气随尘波，心不真舍，适足劳身神於林岫，实有误於未觉也。 其道微而易寻，其道艰而难得乎。",
      "translated_text": "This incantation also reverses inauspicious dreams, transforming them into auspicious omens. The above was revealed by the Lady of Right Radiance on the night of the thirteenth day of the eleventh month.\n\nThe celestial patterns and numinous pivot are the destinations of those who attain penetrating insight. With a heart serene and luminous, the spirit savors the void, chewing and absorbing the Supreme Harmony. The body’s qi becomes pure and boundless, whereupon jade chimes resound, and the myriad sounds are silently summoned.\n\nQi is the vessel and artisan of spirit and illumination, the primordial abyss of purity and turbidity. Abiding in the mysterious, Heaven becomes clear; dwelling within the person, the body endures. Life and death, waxing and waning—all proceed from the art of nurturing and guiding.\n\nTo practice the Six Qi Absorption, always face the northeast at dawn, during the *chou* and *yin* hours, for this is when Heaven’s seasons begin. One must align with this direction at this time. As the rosy glow of the Great Auroral Division arises and the Cinnabar Sun gives birth to light, the numinous radiance dawns, and the Vermilion Essence begins to shine.\n\nFirst, visualize the sun as an egg within the Mud Pill Palace. Then exhale one breath, imagining the qi as black—this is called the Corpse Qi. Next, exhale a second breath, visualizing the qi as white—this is the Old Qi. Then exhale a third breath, imagining the qi as gray—this is the Death Qi. Each exhalation should be prolonged. Having expelled these three colors, one has thus exhaled the Six Qi.\n\nAfterward, slowly inhale the Yellow Qi four times. Upon completion, swallow saliva three times—this constitutes one full cycle. Then visualize the sun within the Mud Pill Palace ascending and emerging from the eyes, positioning itself nine inches before the face. Gaze inward as if seeing it, then inhale the Red Qi seven times. After seven inhalations, swallow saliva three times and cease. Rise and sit, moving and stretching the four limbs, bending and extending to harmonize the joints and meridians. This completes the practice.\n\nWhen visualizing and swallowing saliva, ensure it appears green. At night, one may also visualize the moon within the Mud Pill Palace, following the same method as for the sun. For lunar visualization, the period from the first night to the fifteenth day of the month is optimal. From the sixteenth to the thirtieth day, the moon’s qi wanes, and the Celestial Embryo contracts—do not visualize the moon at night during this time.\n\nThis method is supremely subtle. Those who practice it become immortals, for it enables the refinement of prenatal breathing, the cultivation of luminous perfection, the summoning of the Five Swallows, and the attainment of natural harmony. The hun-soul returns to the Crimson Mansion, and the po-soul retreats to the Mud Pill Palace—thus is longevity achieved. How could this compare to grasping the yin qi of dark valleys, seeking the swift spirits of galloping steeds, traversing the sea in search of passage, or driving a feathered carriage upon a volcano? Be cautious, be most cautious!\n\nThe above is from *The West Queen Mother’s Narrative Instructions*.\n\nOn the night of the fourth day of the seventh month in the third year of the Xingning era (Yichou), the Lord of Life, Eastern Minister, descended with seven attendants. One bore a purple bannered staff, another a floral pennant, one held the Ten Absolute Numinous Sashes, another carried a satchel of inscribed talismans, and three bore a white ivory box—within it appeared to be books. One attendant grasped a flowing-gold fire bell, and all were clad in vermilion robes. The Lord of Life appeared far younger than his two brothers, wearing a green brocade embroidered skirt, a purple feathered cloak, and a hibiscus crown. His two brothers accompanied him, standing in attendance until bidden to sit. They conversed at length.\n\nOn the night of the sixth day of the seventh month, the Lord of Life descended again. After a long while, he instructed in writing: \"If one must model oneself upon the mysterious and uphold the image, maintaining purity and stillness in rare moments, then one may transcend the hidden depths, fold one’s wings, and nest in lofty seclusion. By savoring the profound and tasting the sublime, one’s spirit harmonizes with the highest. Like a still pool or a towering peak, one delves into the jade scriptures, playing with treasures to quicken the spirit. Abandoning worldly attachments, one tunes the zither of pure numen, clarifying the luminous within the void. The Five Ways become manifest, and form dissolves into the waves of transformation. Desires merge with the insipid, and the empty and obscure thoroughfare becomes a realm of no seeing, no hearing. Only then may one ascend to the subtle perfection of the true, reawakening the mysterious awareness. With inner virtue rounded and outer numinous signs fulfilled, one may at last drive the cloud chariot to the heavens and inscribe the Lord of Life’s cinnabar register.\n\nYet if one’s essence scatters amidst a myriad thoughts, life cannot be firmly rooted. If qi follows the dusty waves and the heart does not dwell in truth, one merely wearies body and spirit among the groves and peaks—truly, this is a grievous error before enlightenment. The Way is subtle yet easy to seek, yet arduous and difficult to attain.\"",
      "overlap_context": "re and moxibustion are fitting remedies, and the Northern Emperor’s prayer of bending and turning may also be employed. If practiced a hundred times, the illness will dissipate. First, gently massage the afflicted arm with one hand for a long while. Then, close the eyes, inwardly gaze, swallow saliva three times, and knock the teeth together three times. Silently recite:\n\nSupreme Four Mysteries, Five Flowers and Six Courts, Three Hun and Seven Po, Heavenly Pass and Earthly Essence, Divine Palace",
      "start_char": 7456,
      "end_char": 8328,
      "start_sentence": 198,
      "end_sentence": 223,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.71526551246643,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清三真旨要玉诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "月五日夜半，存日象在心中，日从口入也，使照一心之内，与日共光，相会毕，当觉心暖，霞晖映验，良久乃祝曰： 太明育精，内炼丹心，光晖合映，神真来寻。 毕，咽液九过。 到十五日、二十日、二十九日，复如上作，使人开明聪察，百关鲜彻，面有玉光，体有金泽，行之五年，太一遣宝车来迎，上登太霄。 行之唯欲数，不必此数日作也。 右一条出《消魔经》中南狱赤君内法。 又曰：临食上勿道死事，勿露食物，来众邪气。 又数澡浴，每至甲子日当沐，不尔当以每月旦，使人通灵。 浴不患数，患人不能耳，荡炼尸臭，而真气来入。 右玄师魏夫人所勅，使施用。 《太上九变十化易新经》曰：若履殗秽及诸不争处，当先澡浴盥沐，解形以除之，其法用竹叶十两，桃皮削取白四两，以清水一斛二斗，於釜中煮之，勿令沸出，适寒温，以浴形，即万秽消除也。 既以除秽，又辟湿痹疮痒之疾。 且竹虚素而内白，桃即却邪而斥秽，故用此二物以消形中之滓秽也。 天人下游既反，未曾不用此水以自荡也。 至於世间符水祝漱外舍之近术，皆莫比於此方也。 若浴者益佳，但不用此水以沐耳，炼尸之素浆，正宜以浴身耳，真奇秘也。 右玄龙羽宫紫微王夫人所勅令用之。 常以月十日、十七日、二十七日，夜人定时，视北斗口中有大星，便称天师、祭酒臣某，稽首再拜，谨白通达，乞赐长生。 常以黄昏按目眦，存神光，令晃昱赤黄则吉，勿忘也。 形一神万，不可得乱。 欲卧，当卧念身神，欲起，当起念身神。 此三法。 右出《道要》中。",
      "translated_text": "At midnight on the fifth day of the lunar month, visualize the solar orb within the heart, drawing the sun in through the mouth so that its light illumines the heart’s interior. When its radiance merges with the sun’s, you will feel warmth in the heart and a rosy glow suffusing the body. After this union, recite the invocation:\n\n*\"Great luminosity nurtures essence,\nWithin, the cinnabar heart is refined.\nLight and radiance merge as one—\nDivine spirits come seeking.\"*\n\nUpon completion, swallow saliva nine times.\n\nRepeat this practice on the fifteenth, twentieth, and twenty-ninth days of the month. Through this, the adept gains clarity and keen perception, all senses become fresh and lucid, the face radiates jade-like luster, and the body gleams with golden sheen. After five years of practice, the Supreme Unity will dispatch a jeweled chariot to welcome the adept, ascending to the Great Empyrean. While frequent practice is essential, it need not be confined to these specific days.\n\nThe above method is recorded in the *Scripture on Dispelling Demons*, from the inner teachings of the Red Lord of the Southern Prison.\n\nIt further states: When partaking of meals, avoid speaking of death or exposing food, lest malevolent qi gather. Bathe frequently, and on each *jiazi* day, perform a full ablution; if not, do so at the start of each month to attain spiritual communion. The obstacle is not the frequency of bathing, but the practitioner’s inability to persist. By washing away the stench of the corpse, true qi enters the body.\n\nThe above was commanded by the Mystic Master, Lady Wei, for practical application.\n\nThe *Scripture of the Nine Transformations and Ten Transmutations for Renewal* states: When treading upon filth or contentious places, first perform a ritual bath to purify the body and dispel impurities. The method employs ten ounces of bamboo leaves and four ounces of peeled white peach bark, boiled in one *hu* and two *dou* of clear water in a cauldron, ensuring it does not boil over. Once cooled to a suitable temperature, use the water to bathe, and all defilements will dissolve. This not only removes impurities but also prevents dampness, numbness, sores, and itching.\n\nBamboo is hollow, plain, and inwardly white, while peach repels evil and expels filth—hence these two substances are used to cleanse the body’s impurities. When celestial beings descend to the mortal realm and return, they invariably use this water for self-purification. Compared to worldly talismanic waters, incantations, or external rinses, this method is unparalleled. While bathing with it is most effective, it should not be used for washing the hair. This refined essence for refining the corpse is precisely suited for bathing the body—a truly wondrous and secret technique.\n\nThe above was commanded by the Lady of the Purple Tenuity Palace of the Mystic Dragon Feather Court for practical use.\n\nOn the tenth, seventeenth, and twenty-seventh days of each month, at the hour of *ren ding* (night’s stillness), gaze at the mouth of the Northern Dipper and behold the great star within. Then, addressing the Celestial Master and Libationer, bow twice and declare:\n\n*\"Your servant [Name], kowtowing in reverence, humbly petitions for transmission, beseeching the gift of longevity.\"*\n\nAt dusk, press the corners of the eyes and visualize the divine light, ensuring it shines with a radiant red-yellow hue—this is auspicious. Never forget this practice. Though the body is one, the spirits are myriad; they must not be disordered.\n\nBefore sleep, meditate upon the body’s spirits; upon rising, do the same. These are the three methods.\n\nThe above is recorded in the *Essentials of the Dao*.",
      "overlap_context": "rtue rounded and outer numinous signs fulfilled, one may at last drive the cloud chariot to the heavens and inscribe the Lord of Life’s cinnabar register.\n\nYet if one’s essence scatters amidst a myriad thoughts, life cannot be firmly rooted. If qi follows the dusty waves and the heart does not dwell in truth, one merely wearies body and spirit among the groves and peaks—truly, this is a grievous error before enlightenment. The Way is subtle yet easy to seek, yet arduous and difficult to attain.\"",
      "start_char": 8329,
      "end_char": 8942,
      "start_sentence": 224,
      "end_sentence": 246,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.622843027114868,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清三真旨要玉诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "鸡呜欲起，先屈左手啖盐指，直右手瞰盐指，以相摩，并祝曰：西王母女名益愈，赐我丹药，受之於口，积精摩形。 常以鸡呜，二七咽液，除目芒芒，致其精光，彻视万里，备见四方。 咽液二七过，以指摩目二七，令人目不瞑，所谓唾手阳明摩目者也。 右出九都中。 次啄齿，口为天门鼓，三十六啄，纵漱醴泉，三咽之，名曰呜天鼓，存身万神也。 右出众书中。 旦起便东坐，以两手相摩令热，以手摩额，上至头上，满二九十八止，名曰泥丸也。 次两手相摩令热，以摩面，入发中，三周而止，能尽摩身躯又佳，名曰乾浴也。 次两手相摩，乘额讫，以手叉两耳，极上下之二七止，令人终已不聋。 次缩鼻闭气，以右手从头上引左耳二七，复以左手从头上引右耳二七止，令人长生。 次起着衣，当衣带戊己。 假令甲戌旬，向寅地； 甲寅旬，向午地； 甲申旬，向子地； 甲午旬，向戌地； 甲辰旬，向申地； 甲子旬，向辰地。 所谓衣带戊己，长不寒也。 次起行，当先前左足，因言乾，次前右足，因言元，次前左足，便言亨，次前右足，便言利，次前左足，便言贞。 如此毕矣，名曰行步乾元也。 诣请自说姓名，左直神，右直神，土司命，青夫人，绝某甲死籍，入门君，与夫人。 可诺，亦窃言之，勿令声高彻也。 溲便向六丁。 假令甲子旬，向丁卯，溲向卯地； 甲戌旬，向丑地； 甲申旬，向亥地； 甲午旬，向酉地； 甲辰旬，向未地； 甲寅旬，向巳地。 所谓溲便六丁所向也。 右八条出《自然经》中。 欲饮食，先说姓名，建身为道，身为天府，道父道母，真人仙人，神人圣人，我合共饮食，神男玉女，侍在左侧，持我仙录，生生无极。 右出《道要》中。 服日月精法，月朔旦，日出高三丈许，遥望见便握固禹步，以口遥引取日精二七十四口，咽之。 可将三人入瘟病家，他病终不能着所将从人，经常之，令人老寿。 月生三日，月出於庚上，两手握固西南行，向月禹步，以口遥饮月精二七十四咽之，终年无疾病。 亦可入丧家，日月照瑕秽。 右此二条，食日饮月，万气皆消除也。 与道俱生，与神同堂，真人某甲，常谁言亡。 右耳呜说语。 与道同居，与神同室，真人某甲，寿命天地相毕。 右前呜说之。 与道同室，与神同功，真人某甲，寿命天地同合。 右后呜说之。 每欲夜行，呼天蓬，当我者前，兼辟虎狼。 右夜行说之。 常以朝暮北向，先存五藏气，想肝气正青，心气正赤，肺气正白，肾气正黑，脾气正黄，思五藏气定，叩齿三十六通，祝曰： 天蓬天蓬，九元杀童，五丁都司，高刁北公，七政八灵，太上浩凶，长颅巨兽，手把帝钟，素枭三晨，严驾夔龙，威剑神王，斩邪灭踪，紫气乘天，丹霞赫冲，吞魔食鬼，横身饮风，苍舌绿齿，四目老翁，天丁力士，威南御凶，天驺激戾，威北衔锋，三十万兵，卫我九重，辟尸千里，又却不祥，敢有小鬼，欲来见戕，攫天大斧，斩鬼五形，炎帝烈血，北帝然骨，四明破骸，天猷灭类，神刀一下，万鬼自溃。 右祝鬼，四言一叩齿为节也。 天下万鬼，莫不威伏，有欲来害者，闻此祝即便消灭，北帝大魔，常畏此祝，常能用之，可横行天下，神鬼伏从。",
      "translated_text": "At the first crow of the rooster, before rising, first bend the left hand to lick the salt from the finger, then extend the right hand to gaze at the salted finger, rubbing them together while reciting:\n\n*\"The daughter of the Queen Mother of the West is named Yi Yu. She bestows upon me the cinnabar elixir, which I receive into my mouth, accumulating essence to polish my form.\"*\n\nAt every cock’s crow, swallow saliva twice seven times to dispel the dimness of the eyes, drawing forth their radiant essence so that one’s vision may penetrate ten thousand *li* and perceive all four directions. After swallowing saliva twice seven times, rub the eyes with the fingers twice seven times to prevent drowsiness—this is what is meant by *\"spitting on the hands and rubbing the eyes with Yang Brightness.\"*\n\nThe above is recorded in the *Nine Capitals*.\n\nNext, tap the teeth, sounding the drum of the Heavenly Gate thirty-six times. Then swish the divine springwater and swallow it three times—this is called *\"sounding the Heavenly Drum\"* and visualizes the myriad spirits of the body.\n\nThe above is recorded in various texts.\n\nUpon rising at dawn, sit facing east. Rub the hands together until warm, then rub the forehead upward to the top of the head, repeating this eighteen times—this is called *\"Muddy Pellet.\"* Next, rub the hands together again until warm, then rub the face, passing into the hairline three times. If one can thoroughly rub the entire body, it is even better—this is called *\"Dry Bathing.\"*\n\nNext, after rubbing the hands and touching the forehead, clasp the ears with the hands and pull them upward and downward fourteen times to ensure lifelong hearing. Then, contracting the nose and holding the breath, use the right hand to pull the left ear from above the head fourteen times, then the left hand to pull the right ear fourteen times—this grants longevity.\n\nWhen dressing, one should don the belt facing *wu-ji*. For example:\n- During the *jia-xu* decade, face *yin*;\n- During the *jia-yin* decade, face *wu*;\n- During the *jia-shen* decade, face *zi*;\n- During the *jia-wu* decade, face *xu*;\n- During the *jia-chen* decade, face *shen*;\n- During the *jia-zi* decade, face *chen*.\n\nThis is what is meant by *\"donning the belt facing* wu-ji*\"* to remain perpetually free from cold.\n\nWhen walking, always step forward first with the left foot while saying *\"Qian,\"* then with the right foot while saying *\"Yuan,\"* then with the left foot while saying *\"Heng,\"* then with the right foot while saying *\"Li,\"* and finally with the left foot while saying *\"Zhen.\"* This completes the sequence—it is called *\"Walking the Qian-Yuan.\"*\n\nWhen making a request, state your name aloud:\n*\"Left-aligned spirit, right-aligned spirit, Earth Controller of Destiny, Azure Lady, sever [Name]’s entry in the register of death. Gatekeeper Lord, grant this to the Lady.\"*\n\nIf assent is given, repeat it quietly, ensuring the voice does not carry too far.\n\nWhen relieving oneself, face the direction of the Six *Ding*. For example:\n- During the *jia-zi* decade, face *ding-mao* (east);\n- During the *jia-xu* decade, face *chou*;\n- During the *jia-shen* decade, face *hai*;\n- During the *jia-wu* decade, face *you*;\n- During the *jia-chen* decade, face *wei*;\n- During the *jia-yin* decade, face *si*.\n\nThis is what is meant by *\"facing the Six Ding when relieving oneself.\"*\n\nThe above eight methods are recorded in the *Scripture of Spontaneity*.\n\nBefore eating or drinking, first state your name and declare:\n*\"I establish my body as the Dao, my body as the Heavenly Repository. Dao Father, Dao Mother, Perfected Ones, Immortals, Divine Ones, Sages—I join with you in this meal. Divine youths and jade maidens attend at my left, holding my immortal register, granting me boundless life.\"*\n\nThe above is recorded in the *Essentials of the Dao*.\n\n**Method for Absorbing the Essence of the Sun and Moon:**\nOn the first day of the lunar month, when the sun has risen three *zhang* high, gaze toward it, clench the fists, and perform the *Yu Step*. From afar, draw in the sun’s essence with the mouth twenty-four times and swallow it. If three people enter a plague-stricken household in this manner, no illness will afflict those accompanying them. Practicing this regularly ensures longevity.\n\nOn the third day of the lunar month, when the moon rises in the *geng* position, clench the fists, walk southwest, face the moon, perform the *Yu Step*, and from afar draw in the moon’s essence with the mouth twenty-four times, swallowing it. This ensures a year free from illness. It also allows one to enter households of the deceased, for the sun and moon illuminate all impurities.\n\nThe above two methods—*\"eating the sun and drinking the moon\"*—dissolve all *qi*.\n\n*\"Born together with the Dao, dwelling with the spirits in the same hall, Perfected One [Name], who dares speak of my demise?\"*\nRecite this when the ears ring.\n\n*\"Dwelling with the Dao, sharing a chamber with the spirits, Perfected One [Name], may my lifespan match heaven and earth.\"*\nRecite this at the first cock’s crow.\n\n*\"Sharing a chamber with the Dao, sharing merit with the spirits, Perfected One [Name], may my lifespan unite with heaven and earth.\"*\nRecite this at the second cock’s crow.\n\nWhen traveling at night, invoke *\"Heavenly Peng\"* to stand before you and repel tigers and wolves.\n\nRecite this when walking at night.\n\nAt dawn and dusk, face north. First visualize the *qi* of the five viscera:\n- The *qi* of the liver as true blue,\n- The *qi* of the heart as true red,\n- The *qi* of the lungs as true white,\n- The *qi* of the kidneys as true black,\n- The *qi* of the spleen as true yellow.\n\nOnce the *qi* of the five viscera is settled, tap the teeth thirty-six times and recite:\n*\"Heavenly Peng, Heavenly Peng, Nine Origins Slaying Youth, Five Ding Controllers, Gao Diao Northern Duke, Seven Governors Eight Spirits, Supreme One Dispels Misfortune, Long-Skulled Giant Beast, Grasping the Emperor’s Bell, White Owl of the Three Mornings, Sternly Driving the Kui Dragon Chariot, Mighty Sword Divine King, Slaying Demons and Erasing Traces, Purple Qi Riding the Sky, Cinnabar Clouds Blazing Forth, Devouring Demons and Consuming Ghosts, Body Transverse Drinking the Wind, Azure Tongue Green Teeth, Four-Eyed Old Man, Heavenly Ding Warriors, Mighty South Warding Off Misfortune, Heavenly Couriers Rousing Fury, Mighty North Biting the Blade, Three Hundred Thousand Soldiers, Guarding My Ninefold Gates, Repelling Corpses a Thousand *Li* Away, Further Dispelling Inauspiciousness. Should any petty ghost dare approach to harm me, seize the Heavenly Great Axe and sever the five forms of ghosts. The Fiery Emperor scorches their blood, the Northern Emperor burns their bones, the Four Brightnesses shatter their skeletons, Heavenly Strategy annihilates their kind. With a single stroke of the divine blade, ten thousand ghosts scatter.\"*\n\nRecite this incantation to ward off ghosts, tapping the teeth once for every four lines.\n\nAll ghosts under heaven submit in awe. Should any seek to harm you, they will vanish upon hearing this incantation. The Great Demon of the Northern Emperor constantly fears this prayer. Those who regularly employ it may traverse the world unopposed, with gods and ghosts submitting in obedience.",
      "overlap_context": " kowtowing in reverence, humbly petitions for transmission, beseeching the gift of longevity.\"*\n\nAt dusk, press the corners of the eyes and visualize the divine light, ensuring it shines with a radiant red-yellow hue—this is auspicious. Never forget this practice. Though the body is one, the spirits are myriad; they must not be disordered.\n\nBefore sleep, meditate upon the body’s spirits; upon rising, do the same. These are the three methods.\n\nThe above is recorded in the *Essentials of the Dao*.",
      "start_char": 8943,
      "end_char": 10199,
      "start_sentence": 247,
      "end_sentence": 296,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.12602257728577,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清三真旨要玉诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "不可妄言有此祝法，常秘而行之。 师口诀曰：身未精洁，不可轻行咒法，子宜慎之。 常以鸡呜时握固，戴天柱，叩齿二七通，思十二父母绕头，思二十四神人布在身，思二十四贤在地绕身，便以左脚踵塞大孔，更急握固，反舌向喉中，闭气，思王气在前，思天下神祇、山川五岳精灵神官，下及一切万民，皆来朝己，从天至地，莫不震伏者，毕乃通息。 右太一包天大禁法。 魄昼日在左目下，暮在鼻下人中，常以旦暮，以右手第二指阴按之三过，微祝曰： 七魄澡炼，不动不倾，长与三魂，隐伏帝庭，保和三元，通真达灵，万凶消灭，我得长生，遂为真人，上升天庭。 右太一制七魄法，常行之，三魂保守，七魄长安，无复死时，常行之，勿使人见。 若登斋入室，当先驱除以辟鬼病，又防百试，乃宽内府而祝之，北向叩齿三十六通，乃微言於玉清琼元君曰： 六天大魔王，受制幽寥无，巨兽赤甲，毒龙四喉，白鼠仰呜，奋爪振豪，万精幽匿，灭邪破妖，天丁一如，五岳启朝，风火征伐，九天扇飙，照矣。 於是重挺闭视，澡练容精，调研三宫，存一六庭，帝君撰晏，卿辅并明，和适气液，朝谒九灵，五神安迭，津源流盈，白元启真，无英布生，洞景潜朗，四德以平，晖皓内宝，歌玩洞清，太素列图，寿亦不倾。 本命之日，及有心震之地，闭关精思，叩齿三过，安气呼吸，正身北向，心存而微言曰： 罗勒那朝，方奈关练，班目勃队，惮漠巨蛇，赫察白鼠，丹梨大魔，真馥广敷，虚灵峙霄，总览吉凶，发洞畅幽，舞眄众品，领括繁条，百方千涂，莫不豁寥，天地齐度，孰云能雕。 右二条出《洞真金玄八景玉箓》咒法，不可轻咒，慎之。 大寒者以鼻取气，三咽不息，为咽取气即止矣。 大热者以鼻取气，再咽令迟，亦先鼻内气，后口呼出气，热即止。 右二条出《黄子行气经》中。 尔时八万五千金刚神为护法，故调伏幽明二众之心，而说咒曰： 雷火明空，神光朗幽，毒龙四据，灵虎八周，头巾七星，足踏斗牛，神刀列宿，金钩耀精，元首威兵，腾步虚行，中绝妖邪，下灭游精，抽肝出胆，翻肠绝脉，左斩右到，煎烹后馘，截妖气原，收束众怨，啖鬼使者，摧拉生吞，巫俗歌鼓，饮血食肉，形膻骨臭，魍魉翻覆，腥躁秽贱，心形谄讟，神杵碎首，金刀刎腹，藏凶匿害，忽来降伏，左秉金符，右持罪目，太一金铃，虚皇玉节，知过不改，悬首自截，何妖不丧，何精不灭，六神不藏，七星裂血，上有天师，下有金刚，齐称降气，口吐灵芒，饮以丹池，饴以玄霜，五藏生华，长存不疆。 尔时大鬼王四目电身，同为护法，消灭不祥，守卫道场，察奸纠过，降伏恶人，及诸外道，无止信者，而说咒曰： 神风拂尘，倾拔邪根，六天丧精，五毒亡冤，金头铁齿，啖鬼亡魂，桃光列户，双景曜门，奔星杀气，朗然无畏，百脉川流，七经调理，神安体平，长存不死。 右二咒出《太上玉清经》第七《道化四夷品》。 酆都宫颂曰： 纣绝标帝神，谅事遘重阿，炎如霄中烟，勃若曜景华，武城带神锋，恬照吞清河，阊阖临丹井，云门郁嵯峨，七非通奇盖，连宛亦敷魔，六天横北道，此是鬼神家。 此六天之宫名，诵之辟鬼邪也。 寂通寄兴感，玄气摄动音，高轮虽参差，万仞故来寻，萧萧研道子，合神契灵衿，委顺浪世化，心标窈窕林，同期理外游，相与静东岑。",
      "translated_text": "Do not recklessly reveal the existence of this incantation method; keep it secret and practice it diligently.\n\nThe master’s oral instructions state: If the body is not pure and refined, one must not lightly perform the incantation rites. You ought to be cautious of this.\n\nRegularly at cock’s crow, clench the fists, raise the Celestial Pillar, and tap the teeth twice seven times. Envision the Twelve Parent Deities encircling the head, the Twenty-Four Divine Persons arrayed upon the body, and the Twenty-Four Sages surrounding the earth beneath you. Then, press the left heel against the anus, clench the fists tightly once more, curl the tongue back toward the throat, hold the breath, and visualize the Kingly *qi* before you. Envision all the gods of heaven and earth, the spirits of mountains and rivers, the Five Peaks, and all living beings coming to pay homage to you—from heaven to earth, none dare not tremble in submission. Only then release the breath.\n\n*Right: The Great One’s Celestial Encompassing Prohibition.*\n\nThe *po* soul by day resides beneath the left eye, and at dusk beneath the nose in the philtrum. Regularly at dawn and dusk, press with the second finger of the right hand three times while softly reciting:\n\nThe seven *po* are refined and purified,\nUnmoving and unyielding,\nEver conjoined with the three *hun*,\nConcealed within the Imperial Court.\nThey preserve harmony of the Three Origins,\nCommuning with the true and penetrating the numinous.\nAll misfortune vanishes,\nAnd I attain longevity,\nBecoming a Perfected One,\nAscending to the Celestial Court.\n\n*Right: The Great One’s Method for Restraining the Seven *Po*.* Practice this regularly, and the three *hun* will be guarded, the seven *po* will remain at peace, and death shall never come. Perform this without others witnessing.\n\nWhen entering a purification chamber or sacred space, first expel and dispel ghosts and illnesses. Guard against all trials, then relax the inner palace and recite, facing north and tapping the teeth thirty-six times. Softly address the Jade Clarity’s Resplendent Primordial Sovereign:\n\nThe Great Demon Kings of the Six Heavens,\nBound in the desolate void,\nGiant beasts of crimson armor,\nPoisonous dragons with four throats,\nWhite rats howling upward,\nBrandishing claws and shaking bristles,\nMyriad spirits lurking in darkness—\nVanquish evil and shatter demons.\nThe Heavenly Soldiers are as one,\nThe Five Peaks pay homage.\nWind and fire launch their assault,\nThe Nine Heavens fan the whirlwind.\nBehold!\n\nThen, straighten the spine, close the eyes, refine the countenance and essence, harmonize the Three Palaces, and visualize the Six Courts. The Imperial Lord holds court, his ministers and aides all radiant. Harmonize the *qi* and fluids, pay homage to the Nine Numinous Ones, the Five Spirits rest in succession, the springs of saliva overflow, the White Prime awakens the true, the Dark Flower spreads its life. The cavernous radiance shines in secret, the Four Powers are balanced, the inner treasure gleams brightly. Sing and delight in the Cavernous Clarity, the Primal Simplicity arrays its charts, and longevity shall never falter.\n\nOn one’s natal day or in places where the heart trembles, close the passes and refine the thoughts, tap the teeth thrice, regulate the breath, face north, and softly intone:\n\n*Roluona chao, Fangnai guanlian,*\n*Banmu bo dui, Danmo ju she,*\n*Hecha bai shu, Danli da mo,*\n*Zhenfu guangfu, Xuling zhi xiao,*\n*Zonglan jixiong, Fa dong chang you,*\n*Wumian zhongpin, Lingkuo fan tiao,*\n*Baifang qian tu, Moneng huo liao,*\n*Tiandi qidu, Shu yun neng diao.*\n\n*Right: These two passages are from the* Incantations of the *Jade Register of the Eight Luminaries of the Cavernous Realms of Golden Mystery.* Do not recite them lightly; be cautious.\n\nFor extreme cold: Inhale through the nose, swallow the *qi* thrice without exhaling, and cease once the *qi* is drawn in.\n\nFor extreme heat: Inhale through the nose, swallow the *qi* twice slowly, first drawing in through the nose, then exhaling through the mouth. The heat will subside.\n\n*Right: These two passages are from the* Scripture of Qi Circulation by Master Huang.\n\nAt that time, eighty-five thousand vajra spirits acted as Dharma protectors, subduing the minds of both the hidden and the manifest, and spoke this incantation:\n\nLightning fire illumines the void,\nDivine radiance brightens the obscure.\nPoisonous dragons crouch at the four quarters,\nSpiritual tigers encircle the eight directions.\nThe headscarf bears the Seven Stars,\nThe feet tread upon Dipper and Ox.\nThe divine blade arrays the constellations,\nThe golden hook gleams with essence.\nThe foremost wields mighty soldiers,\nStriding through the void.\nSever the center of demonic evil,\nAnnihilate the wandering spirits below.\nTear out the liver, extract the gall,\nInvert the intestines, sever the vessels.\nCut left, strike right,\nBoil and decapitate the rear.\nSever the root of demonic *qi*,\nBind and restrain all grudges.\nThe ghost-eating messengers,\nCrush and devour them alive.\nSorcerers and shamans with drums and songs,\nDrinking blood and eating flesh,\nFoul of form and stinking of bone,\n*Wangliang* spirits overturned.\nRank and filthy, base and vile,\nHearts and forms full of flattery and slander.\nThe divine pestle shatters their skulls,\nThe golden blade slits their bellies.\nThose who conceal evil and hide harm,\nSuddenly submit.\nIn the left hand, the golden talisman,\nIn the right, the ledger of sins.\nThe Great One’s golden bell,\nThe Jade Emperor’s jade scepter.\nThose who know their faults yet do not reform,\nHang their heads and sever themselves.\nWhat demon does not perish?\nWhat spirit does not vanish?\nThe Six Spirits do not hide,\nThe Seven Stars spill blood.\nAbove, the Heavenly Master,\nBelow, the vajras.\nTogether they subdue the *qi*,\nMouths spewing divine radiance.\nDrink from the Cinnabar Pool,\nFeed upon the Mysterious Frost.\nThe Five Viscera bloom with flowers,\nAbiding forever, unending.\n\nAt that time, the Great Ghost King with four eyes and a body like lightning, together as Dharma protectors, dispelled inauspiciousness, guarded the ritual space, detected deceit and corrected faults, subdued evil men and all external paths, and those lacking faith. They spoke this incantation:\n\nDivine wind sweeps away dust,\nUprooting the roots of evil.\nThe Six Heavens lose their essence,\nThe Five Poisons perish their grudges.\nGolden head and iron teeth,\nDevouring ghosts and vanishing souls.\nPeach light arrays the doors,\nTwin luminaries shine upon the gates.\nShooting stars and killing *qi*,\nRadiant and fearless.\nThe hundred vessels flow like rivers,\nThe seven meridians are regulated.\nThe spirit is at peace, the body is balanced,\nAbiding forever, undying.\n\n*Right: These two incantations are from the* Supreme Jade Clarity Scripture*, Chapter Seven, \"The Dao Transforms the Four Barbarians.\"*\n\nThe *Hymn of the Fengdu Palace* states:\n\nZhou’s end marks the divine emperor,\nIn truth, affairs meet heavy calamity.\nFlaming like smoke in the sky,\nBursting like radiant blossoms.\nWucheng girds the divine blade,\nSerene illumination swallows the Clear River.\nThe Gate of Heaven overlooks the Cinnabar Well,\nCloud Gate looms precipitously.\nThe Seven Wrongs connect to the wondrous canopy,\nLinked and winding, they spread demons.\nThe Six Heavens cross the northern path—\nThis is the abode of ghosts and spirits.\n\nThese are the names of the Six Heavenly Palaces. Reciting them dispels ghostly and demonic influences.\n\nSilent communion conveys inspired feeling,\nMysterious *qi* stirs the resonant tone.\nThough the lofty wheel is uneven,\nFrom ten thousand fathoms, they still come seeking.\nThe diligent Daoist disciples,\nHarmonizing spirit and contracting the numinous lapel,\nSurrender to the transformations of the floating world,\nThe heart’s standard planted in the secluded forest.\nTogether we await the journey beyond principle,\nAnd with one another, still the eastern peak.",
      "overlap_context": "eavenly Strategy annihilates their kind. With a single stroke of the divine blade, ten thousand ghosts scatter.\"*\n\nRecite this incantation to ward off ghosts, tapping the teeth once for every four lines.\n\nAll ghosts under heaven submit in awe. Should any seek to harm you, they will vanish upon hearing this incantation. The Great Demon of the Northern Emperor constantly fears this prayer. Those who regularly employ it may traverse the world unopposed, with gods and ghosts submitting in obedience.",
      "start_char": 10199,
      "end_char": 11521,
      "start_sentence": 297,
      "end_sentence": 321,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.234782218933105,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清三真旨要玉诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "此申情，寄之来缘也。 命驾广酆阿，逸迹超冥乡，空中自有物，有中亦无常，悟言有无际，相与会濠梁，目击玄解了，鬼神理自忘。 此论人鬼之幽致也。 罗酆山在北方癸地，山高二千六百里，周回三万里，其山之下有洞天在，周回一万五千里，其上下并有鬼神宫室，山上有六宫，洞中有六宫，一宫辄周回千里，是为六天鬼神之宫。 山上为外宫，洞中为内宫，制度等耳。 一纣绝阴天宫，二泰杀谅事宗天宫，三明晨耐犯武城天宫，四恬照罪气 天宫，五宗灵七非天宫，六敢司连宛屡 天宫。 念此六天之宫，乃叩齿六下，乃 卧，辟诸鬼邪之气。 贤人圣人去世，先 经明晨第三天宫受事，祸福吉凶，诸命 罪害，由恬照第四天宫，北斗君治此 中。 鬼官祝曰：",
      "translated_text": "Here the heart’s longing is expressed,\nits karmic bonds conveyed.\nCommanding the chariot to vast Feng E,\nfree traces transcend the nether realm.\nIn emptiness, things exist of themselves;\nwithin existence, nothing remains constant.\nRealizing the words at the boundary of being and non-being,\ntogether we meet at the Hao Bridge.\nThe eye perceives, the profound understanding dawns—\nthe principles of ghosts and spirits are forgotten of themselves.\n\nThis discourse concerns the subtle essence of humans and ghosts.\n\nMount Luofeng lies in the northern *gui* region, its height two thousand six hundred *li*, its circumference thirty thousand *li*. Beneath the mountain lies a grotto-heaven, its circumference fifteen thousand *li*. Both above and below, ghostly and divine palaces stand. On the mountain are six palaces; within the grotto, six more—each palace spanning a thousand *li* in circumference. These are the Six Heavenly Palaces of ghosts and spirits.\n\nThe palaces above the mountain are the outer courts; those within the grotto, the inner courts—their systems are the same.\n\nThe first is the Zhōu Jué Yīn Heavenly Palace;\nthe second, the Tài Shā Liàng Shì Zōng Heavenly Palace;\nthe third, the Míng Chén Nài Fàn Wǔ Chéng Heavenly Palace;\nthe fourth, the Tián Zhào Zuì Qì Heavenly Palace;\nthe fifth, the Zōng Líng Qī Fēi Heavenly Palace;\nthe sixth, the Gǎn Sī Lián Wǎn Lǚ Heavenly Palace.\n\nReciting these Six Heavenly Palaces, one then knocks the teeth six times and lies down—warding off all ghostly and demonic *qi*.\n\nWhen the worthy and the sages depart this world, they first pass through the third, the Míng Chén Heavenly Palace, to receive their affairs. Fortune and misfortune, good and ill, all life’s transgressions and harms, are governed by the fourth, the Tián Zhào Heavenly Palace, where the Lord of the Northern Dipper presides.\n\nThe ghostly officials intone:",
      "overlap_context": " dispels ghostly and demonic influences.\n\nSilent communion conveys inspired feeling,\nMysterious *qi* stirs the resonant tone.\nThough the lofty wheel is uneven,\nFrom ten thousand fathoms, they still come seeking.\nThe diligent Daoist disciples,\nHarmonizing spirit and contracting the numinous lapel,\nSurrender to the transformations of the floating world,\nThe heart’s standard planted in the secluded forest.\nTogether we await the journey beyond principle,\nAnd with one another, still the eastern peak.",
      "start_char": 11521,
      "end_char": 11834,
      "start_sentence": 322,
      "end_sentence": 336,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.788909673690796,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清三真旨要玉诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "吾是太上弟子，下统六天，六天之 官，是吾所部，不但所部，乃太上之所 主，吾知六天宫名，是故长生，敢有犯 者，太上斩汝形。 右出《真诰阐幽微》第五卷中。 上清三真旨要玉诀竟 #1案敦煌P-2576V号唐写本，首尾均残缺，无标题。 残存经文399 行，前215行文字不见於《道藏》，后半部分则与《道藏》本《上清三真旨要玉诀》相同。 今以敦煌本前半部分 与《道藏》本合校为一本，但仍有残缺。 又《道藏》所收 《洞真西王母宝神起居经》，其内容文字与本书基本相同，可作参校。 #2『南』字据上下文义补。 #3『文』字据上下文例补。 #4『和』字据《宝神经》补。 #5『内』字据《宝神经》补。 #6『按』字原作『紫』，据《宝神经》改。 #7『视』字据《宝神经》补。 #8『自在』二字据《宝神经》补。 #9『有』字据《宝神经》补。 #10『药』字据《宝神经》补。 #11『游』字原作『旋』，据《宝神经》改。 #12『营』字原作『莹』，据《宝神经》改。 #13敦煌本第215行至此。 以下改用《道藏》本为底本，用敦 煌本参校。 只校补道藏本误漏字。 #14『见』字据敦煌本补。 #15敦煌本『赤字经』作『原景赤字经』。 #16『亦』字据敦煌本补。 #17敦煌本『大』字作『水』。 #18道藏本『使』字下衍『力』字，据敦煌本删。 #19道藏本『头』 字误作『项』，据敦煌本改。 #20道藏本『反胎』误作『及中胎』，据敦煌本改。 #21道藏本『摩』字下衍『经』字，据敦煌本删。 #22道藏本『就』字误作『笼』，据敦煌本改。 #23#25『常』字据敦煌本补。 #24『发』字据敦煌本补。 #26『手』字据敦煌本补。 #27『使』字据敦煌本补。 #28『五龙』原本作『五飞』，据《宝神经》改。 #29『面』字敦煌本作『向』 #30『造始』，敦煌本作一『告』字。 #31『日』字道藏本误作『目』，据敦煌本改。 #32道藏本『录』误作『绿』，据敦煌本改。",
      "translated_text": "I am a disciple of the Most High, governing below the Six Heavens. The officials of the Six Heavens are under my command—not merely under my command, but under the dominion of the Most High. I know the names of the Six Heavenly Palaces, and thus attain long life. Should any dare to transgress, the Most High shall sever your form.\n\n*(From the fifth scroll of* Zhen’gao Chan Youwei: *Elucidating the Subtle and Obscure.)*\n\nHere ends the *Essential Jade Instructions of the Three Perfected Ones of Highest Clarity*.",
      "overlap_context": "eavenly Palace.\n\nReciting these Six Heavenly Palaces, one then knocks the teeth six times and lies down—warding off all ghostly and demonic *qi*.\n\nWhen the worthy and the sages depart this world, they first pass through the third, the Míng Chén Heavenly Palace, to receive their affairs. Fortune and misfortune, good and ill, all life’s transgressions and harms, are governed by the fourth, the Tián Zhào Heavenly Palace, where the Lord of the Northern Dipper presides.\n\nThe ghostly officials intone:",
      "start_char": 11834,
      "end_char": 12722,
      "start_sentence": 337,
      "end_sentence": 381,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.543367385864258,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\上清三真旨要玉诀.txt",
        "category": "玉诀类"
      }
    }
  ]
}