{
  "source_id": "上方天尊说真元通仙道经",
  "source_file": "chunked_daozang\\上方天尊说真元通仙道经.json",
  "total_chunks": 10,
  "total_original_chars": 8431,
  "total_translated_chars": 52233,
  "total_translation_time": 290.9114603996277,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\本文类\\上方天尊说真元通仙道经.txt",
    "category": "本文类"
  },
  "full_translation": "The *Zhenyuan Tongxian Daojing* Spoken by the Heavenly Venerable of the Upper Realm\n\n**Title:** *Zhenyuan Tongxian Daojing* Spoken by the Heavenly Venerable of the Upper Realm. Author unknown. One scroll. Base text from the *Zhengtong Daoist Canon*, Dongzhen Section, Benwen Category.\n\n---\n\n### The Heavenly Venerable of the Upper Realm Speaks the *Zhenyuan Tongxian Daojing*\n#### The Supreme Virtue Descends from the Great Ultimate (First Chapter)\n\nIn the boundless expanse of the Upper Realm’s true primordiality, there exists a heaven born of the unified qi, a land of the Nine Purities’ spontaneity. It nurtures the three-luminous herbs and plants the seven-jeweled trees. Its crimson walls rise in radiant splendor, its jade towers blaze with brilliance. Verdant palaces and purple-pure halls stand in majestic array; green-jade portals and vermilion gates gleam resplendent. Dragon chants and phoenix melodies resound, crimson mists swirl in molten flow, and azure clouds billow in layered grandeur. All is the congealing of the Great Primordial, the transformation of the true primordial, the sacred inner sanctum where the Heavenly Venerable alone is exalted.\n\nAt that time, the Heavenly Venerable bore ten august titles: the Heavenly Master of the Upper Realm’s Qian-Yuan Supreme Sage, the Celestial Sovereign of the Great Primordial’s Upper Perfection, the Law King of the Nine Yangs’ Supreme True Primordial, the Enlightened Immortal Lord of the Three Caverns’ Opening Transformation, the Merciful and Benevolent Great Constant of the Ten Heavens’ Pure Propagation, the Wondrous Dao’s Harmonizing Highest Emperor, the Most Revered of Upper Virtue Who Absolves Sins and Purifies the Heavens, the Heavenly Venerable of the Upper Realm’s Limitless Supreme Numinous Treasure, the Heavenly Venerable of the Upper Realm’s Limitless Supreme Dao and Virtue, the Heavenly Venerable of the Upper Realm’s Compassionate Salvation from Suffering, and the Heavenly Venerable of the Upper Realm’s Jade Clarity and Luminous Augustness.\n\nHis imperial consorts and divine maidens attended with ritual propriety, striking the law drums and chiming the flowered bells. The celestial maidens that followed bore the wondrous offerings of void-dispersing silk, held vermilion tassels and azure sashes with crimson-clouded regalia, raised the nine-heavenly flowered mushrooms, and unfurled the five-luminous feathered fans.\n\nThe Heavenly Venerable ascended the Thousand-Radian Cloud Palace, mounting the Seven-Treasure Throne, seated upon a luminous jade mat of rattan-light and radiant gold. Presently, the Limitless Flying Heavenly Divine King of the Upper Realm, the Great Sage of Eternal Life, the Boundless Highest-Ranked Great Spirit Who Cherishes Life and Delivers Beings, along with the thirty-two Heavenly Lords, their ministers, and the stellar officials and perfected immortals, the great balance-dispelling calamities and the celestial-spanning Miroku divine immortals and numinous officers—an innumerable host—all presented themselves before the celestial throne, paying homage.\n\nThe guardians of the Dao brandished their swords with clanging steel, while the demon-expelling immortals raised banners in blazing glory. Then, golden portals emitted true incense, wafting into the Great Desert and drifting above the unified qi. It cast celestial radiance, illuminating the Dao’s domain and shining resplendent within the eight directions.\n\nThereupon, the Ten-Flowered Immortal Lords, gazing upon the imperial light, rode cloud-dragons to arrive at the gates of the Great Luo’s flying Brahma. They returned to their morning duties, ushered into the phoenix-paved court. The natural heavenly winds blew solemnly, stirring the nine-dragon flowers. Immortal music resounded in harmonious melody, echoing the eight-luan hymns. The divine breeze played the yellow blossoms’ rhythm, while the numinous abyss revealed the azure flowers’ hue.\n\nThe assembled lords performed their rites, gazing upon the sacred countenance—like the crimson dawn’s radiant glow, dazzling and majestic—enshrined in profound dignity, its brilliance too blinding to behold directly.\n\nThen, the Great Luminous Immortal Lord of the Upper Realm stepped forth and proclaimed: “Your servants have observed the Heavenly Venerable and Highest Emperor descending into the flowing-radiance palace, moving through the congealed-splendor halls, unfolding the four seasons’ course, and presiding over the seven governances’ offices. The immortal scriptures reveal the pure and true winds; the decrees admonish the divine primordial’s transformations. Your compassionate light shines universally, and your sagely grace extends evenly. We bow our heads and come to pay court in the imperial court. We humbly beseech your imperial compassion to bestow mercy. We dare to inquire of the Great Ultimate’s workings—without the Highest Emperor’s supreme illumination, how could its teachings be so resplendently bestowed? We reverently await the sagely jade utterance.”\n\nThereupon, the Heavenly Venerable concealed the mysterious darkness within the void, concentrated quiescence within spontaneity, blended the true primordial amid existence, and ordered the great simplicity within the unborn. Dissolving the proclamations of names and forms, he harmonized with the chapters of the subtle and formless. After a long while, he spoke:\n\n“From whence does the supreme virtue arise? It descends from the Great Ultimate. The Great Ultimate encompasses all beyond heaven and earth, first dwelling within the primordial chaos. From the void, it generates being; from turbidity, it returns to clarity. When gathered, its source is unfathomable; when dispersed, its forms are manifest. Thus, it reveals the shining constellations, nurtures the myriad things, its power drawn from the unified qi, its blessings extending across the nine realms. Wherever transformation reaches, none exists without it.\n\nVast and boundless is the true imperial essence; vast and infinite is the primordial unity. It stabilizes the three powers and subordinates the five phases. The enduring heavens and lasting earth dwell within the Great Ultimate’s embrace. The sun’s yang and the moon’s yin flourish beneath the true primordial’s governance. Those who attain the great thereby achieve harmony and longevity; those who lose it wither prematurely. Within the great expanse, all named beings transform in accordance with its changes and look up to its transformations.\n\nThe true unity’s primordial qi generates and transforms in boundless measure—I cannot name its nature, so I forcibly call it the Dao. The Dao’s virtue is vast and cannot be without [omission]. I ascribe its origin to the mysterious sages. Its virtue, when broadly expounded, is clearly evident, resembling the true light’s radiant splendor. Even the divine books and secret scrolls—what more could they add?\n\nIt is said: The mysterious sages complete their chapters—how wondrous and boundless! They reveal the teachings to heaven, earth, and humanity, their virtue unceasing. Yet your servants, in their ignorance, are insufficient to comprehend the celestial plan. Today, we are most fortunate to encounter the Highest Emperor’s exalted virtue and sagely wisdom, his great illumination and penetrating insight. We now wish to hear the great teachings, daring to present them before the imperial presence. We humbly hope for your gracious attention.”\n\nHe replied: “What the mysterious sages esteem are three virtues. The first expounds supreme virtue; the next, luminous conduct; and the third, the teachings of conduct and prohibitions against wrongdoing. Though these three teachings differ in name, they never deviate from the Great Ultimate. All uniformly descend virtue to enact the subtle and wondrous transformations of the Dao. This is what we in the Upper Realm hold most precious.”\n\nShould one fail to follow the subtle transformations of the Dao, how then could one advance upon the Way of True Primordial qi? Alas! How indeed could it be possible?\n\nThereupon, the immortals of the Upper Realm, led by the Venerable Guangling, raised their voices in praise of this grand discourse, extolling its profound words:\n\n“The azure depths stretch boundless,\nThe cloud-palaces gleam resplendent.\nWithin them dwells sagely wisdom,\nUnfolding the dragon-script of celestial decree.\nThe Great Ultimate flows vast,\nTrue Primordial qi shines like jade.\nVirtue descends with name,\nIts transformations boundless through the Dao.\nLuminous teachings shine forth,\nMysterious guidance spreads far.\nThose who can inherit this—\nAre the ministers who serve the Upper Realm.”\n\nThen the Heavenly Venerable addressed the assembled immortals of the Three Nets, saying: “What the celestial work esteems above all is guidance and instruction. To universally deliver gods and humans, all may attain the utmost subtlety—departing from form, aligning with non-action. Thus freed from the sufferings of birth, transformation, descent, and mortality, they may obtain the Way of refined True Primordial qi. Today, I shall instruct the Purple Empyrean; can you, my disciples, follow?”\n\nThereupon, the assembled immortals pledged to obey the imperial decree. At that moment, the incense burners paused, emitting auspicious smoke, and flowers bloomed in fragrant mist. The immortal soldiers set forth on their path, bearing banners that fluttered in formation. The celestial guards led the way, wielding swords that gleamed with divine radiance. The immortals, in their ranks, attended the imperial procession. Phoenix canopies billowed, dragon chariots rumbled. Ascending the five-cloud imperial carriage, the ministers drove nine-spotted leviathans. Crimson wheels lingered as clouds and mist bore them aloft; white cranes soared as wind and haze intertwined. The yellow gates rose in tiers, the azure heavens stretched distant. The first chime of the qing bell rang out, and immortal melodies rose in graceful turns. The cymbals and bells dispersed, and celestial music resounded with resonant harmony. Jade maidens waved their banners, emerging from the mysterious void; golden youths beat time, descending upon the Purple Void.\n\nThe Heavenly Venerable of the Upper Realm expounded the *Scripture of the Way of True Primordial Communion with Immortals*. The *Power Returns to the Plain Non-Being* chapter states:\n\nWithin the realm of Purple Clarity, the land of azure clouds, amid the celestial mists, there resides the Supreme August One. Leaning upon a jade table of the Yellow Dragon, his celestial bearing is majestic. Seated within the golden chariot of the White Unicorn, the sound of its bells rings clear. True Persons flank the axle, flying through the misty hubs. Divine immortals guide the carriage, treading upon the rushing clouds. Winds flutter the dragon banners; clouds swirl around the crane-feathered robes. They step through the Gate of Clear Yang, ascending the Heaven of Flying Spirits, entering the realm of the Three Radiant Ones—the wondrous and true domain of Purple Empyrean. Suddenly, melodious voices drift by, their pure tones floating and free. The assembled immortals draw near to listen; the Venerable Guangling gazes from afar. Clouds bear the Crane Terrace into the distance; winds lead the starry banners into formation. Among them, the presiding master is named the Immortal Lord of Pure Capital. Gazing upon the cloud-borne carriage, he pays homage before the imperial seat:\n\n*“We revere the Most Sagely One,\nWhose immortal journey graces Purple Clarity.\nThe nine-sun chariot turns in graceful arcs,\nTen-flowered clouds trail in its wake.\nToday, we are most fortunate to encounter your presence.\nDaring to hope for the celestial grace,\nWe humbly beseech your divine attention,\nAnd pray for your compassion.”*\n\nThereupon, the Heavenly Venerable granted their prayer. At that time, the perfected ones presented the jade-green imperial regalia, descending from the imperial palace. They raised the Purple Clarity imperial carriage, arriving at the royal court. Naturally, clouds and mountains formed in towering majesty; the qi of the Dao flowed and transformed, the immortal gardens vast and shimmering. The capital of rosy clouds, the halls of auspicious mist—corridors echoed in the distant haze, palace courtyards gleamed with radiance. Jade flowers drifted down amid the clouds; crimson staffs scattered in the courtyard below. Azure dragons offered treasures in the ponds; white deer bore lingzhi herbs along the railings. Divine simurghs wove through the crimson steps; celestial unicorns exhaled fragrance upon the jade terraces.\n\nThe Supreme August One ascended the throne of carved jade; cloud officials attended in the golden hall. Thereupon, the Immortal Lord offered incense and presented offerings, extending the rites to all the perfected ones. Once the vegetarian feast was arranged, the Heavenly Venerable and Supreme August One addressed the Immortal Lord, saying:\n\n*“We receive the mandate of the Jade Clarity Lord,\nEntrusted with the honor of the Upper Realm’s throne.\nDelighting in the principle of Great Communion with the Radiant and True,\nWe govern the celestial administration and the boundless Way of Primordial qi.\nGazing down upon the multitudes,\nWhat strategy could be lacking?\nYet they lose virtue and stray from the Primordial,\nFailing to return to the Great Plain of Simplicity.”*\n\nThe ceaseless descent of mortals fills Us with profound sorrow. Then, We summoned the radiant light of flying spirits to assemble the hosts of all heavens. Desiring to reckon the myriad perfected ones, We traversed the Nine Heavens, dispatching the stalwart officials of the True to bestow transformation through teaching.\n\nMoreover, the sagely lord’s instruction is to transform by aligning with virtue. This virtue is that by which Heaven and Earth attain harmony, the ten thousand classes of beings come into existence, and men, if they follow it, ascend to immortality. In the era when the sagely lord’s virtue and teaching prevailed, none among gods or men could fathom it—only the True Sovereign recognized it and inscribed it upon the Jade Capital. Tracing its great origin, virtue is held most precious. Consider the ten directions’ immortal lords: though they have not heard the True Scriptures, by their virtue they have attained great accomplishment, and now they rank among the immortal courts—surely the ultimate of virtue.\n\nThe Immortal Lord said: *“Your servant, trembling with awe, reverently gazes upon Your august presence, having emerged from the golden palaces of the Nine Empyreans to convene with the immortals at the corners of the Jade Capital. Your singular decree of great strategy descends to instruct us, your servants. We humbly wish to hear: of the Ten Heavenly Lords, what meritorious deeds did they perform in the past to become Heavenly Kings today? Your servant knows not how this came to be. We beseech the Most Sagely One to graciously bestow compassion. Overwhelmed with trepidation, we await Your celestial judgment.”*\n\nThe reply came: *“To establish virtue is what the Supreme Most venerates. To lose virtue is what the August Emperor forbids. Thus, those who perfect virtue through cultivation and harmonious refinement—those who concentrate spirit and qi—may then ascend to the Jade Throne. Without the ceaseless accumulation of merit through practice, how could one attain the celestial rank? Now, let Us inquire of you all: We may freely expound upon the highest good. The virtuous lords of old, while still among men, all mastered the Three Tombs’ classics and understood the Seven Divisions’ scriptures. Their vast virtue and universal salvation elevated their spirits to the ten directions.*\n\n*The Supreme August Lord of the Upper Realm’s Primordial Void Immortal Court once practiced supreme virtue, showing compassion to the people of his land. The Venerable Virtue Immortal Lord of the Lower Realm’s Myriad Transformations Heavenly Court formerly administered virtuous governance, loyally serving the sagely lord. The Dawn Radiance Immortal Lord of the Eastern Florescence’s Divine Transformation Heavenly Court once practiced filial piety and fraternal duty, his heart set on acts of life-saving. The Vermilion Radiance Immortal Lord of the Southern Culmen’s Vermilion Yang Luminous Heavenly Court early cultivated virtuous deeds, achieving world-transcending merit. The Pure Harmony Immortal Lord of the Western Numinous’s Primordial Purity Heavenly Court; he illuminated the Dharma of awakening, practiced lofty and pure conduct, expounded the Three Vehicles’ models, and inaugurated the Four Schools’ strategies. The Primordial Darkness Immortal Lord of the Northern True’s Primordial Abyss Heavenly Court refined inner and outer elixirs, followed the protection of yin and yang, unfolded the Four Assistants’ origins, and revered the Three Caverns’ mysteries. The Luminous Script Immortal Lord of the Northeastern Dawn’s Central Completion Heavenly Court bore the rise and fall of Heaven’s movements, harmonized the waxing and waning of temporal things, recited the Three Sovereigns’ teachings, and practiced the Five Constants’ Dao. The Advancing Dao Immortal Lord of the Southeastern Peace’s Vermilion Florescence Heavenly Court established temples to deliver beings, practiced ritual teachings to save the dead, propagated the Nine Heavens’ Dharma, and received the Three Realms’ registers. The Vermilion Florescence Immortal Lord of the Earthly Domain’s Vast Peace Heavenly Court initially transmitted the writings of the Master of Penetrating Mystery, ultimately revering the principles of the Perfected One of Cavernous Spirit. He relinquished harm to embrace beneficial nature, abided in non-action while advancing spontaneity. At intervals, he guided and led to nourish qi and flavor; at times, he breathed to return primordial essence. He penetrated the principles of the Cavernous True and Cavernous Mystery, aligning with the wondrous transformative source of the primordial spirit. The Dark Origin Immortal Lord of the Heavenly Pillar’s Supreme Purity Joyous Heavenly Court once advanced his heart in the Celestial Lord of Destiny’s teachings and diligently applied himself to the statutes of the Primordial Dao. Knowing black and white, he employed the Mysterious Female; ingesting celestial qi, he transmitted spirit. He consumed immortal medicines to subdue yin’s corporeal soul, refined the divine elixir to transmute yang’s ethereal soul. He absorbed the clarity of the Two Luminaries and Seven Origins, embraced the harmony of the Eight Vastnesses and Five Wefts. Thus, he preserved the true unity of the primordial qi, discerned the first and ninth yang lines. Therefore, the elixir formed within, and his conduct was perfected without.*\n\n*All these lords of old refined spirit, refined qi, refined form, refined substance. Without hesitation, they consumed and ingested, studying the writings of the Flame Emperor. With reasoned regulation, they practiced the books of the Yellow Emperor. Thus, their virtue filled the lower realms, their thoughts purified and wearied of the world. Their bodies transformed, their spirits shed, they ascended as immortals inscribed in white script. Riding the cloud paths, they roamed freely to the Purple Culmen, returning to the Primordial of Great Simplicity. Yet even so, they had not heard the cloud-script True Writings.”*\n\nThereupon, the Immortal Lord of the Pure Capital, reverently bearing the Heavenly grace, said: *“Vast indeed is virtue! Your servants have all received Your teaching.”*\n\nAt that time, the Purple Void Perfected One of the Upper Realm, his Dao-qi pure and majestic, his immortal countenance divinely radiant, his green hair crowned with a yellow cap, his crane-feather cloak and cloud robes, stepped forth, performed the rites, and addressed the Heavenly Venerable: *“Your servant humbly observes that our Master, the August Emperor, radiates sagely virtue in the Phoenix Tower and vibrates divine scriptures across the cloudy heavens, gathering the source of all wonders and extending the vastness of numinous hearing. Your servant’s wish is that the imperial carriage might descend upon Kunlun, universally bestowing compassionate instruction and grandly inaugurating the Dharma’s words. We beseech Your sagely judgment; may the Heavenly might specially permit it.”*\n\nThe reply came: *“To convey the subtle and penetrate the wondrous is to transmit the true and orthodox of former masters. To utter words that propagate the Dao is to bestow the mandate of future sages. Since you have inquired, the duty lies in delivering beings. This is the supreme good—how could We refuse?”*\n\nThen, the Lords of the Nine Empyreans and the Kings of the Ten Poles were commanded to don robes embroidered with mountain patterns and array their ranks with starry banners, the celestial soldiers and immortal hosts of the Upper Realm. Bearing the jade-green parasols of the Heavenly procession, they trod the purple void’s cloud paths. The chiming tones of jade bells ceased at the Heavenly Gate, the panpipes’ music arose in unison at the Earthly Portal. The palace halls congealed to return to their origin; the pools and ponds flowed to revert to their source. Clouds swirled in numinous brilliance; winds moved in radiant splendor. Pointing afar to Kunlun, the immortals journeyed and arrived.\n\n*The Heavenly Venerable of the Upper Realm expounds the Scripture of the True Origin’s Communion with Immortality*\n*True Origin’s Communion with Immortality, Lower Scroll*\n\nNow, the Nine Pures stretch into the distant, enfolding the heavens of Kunlun.\n\nOne qi congeals in primordial unity, gracing the peaks of Xian by the limpid streams. The celestial mountains rise in towering majesty; the brook’s waters ripple and flow, their clear currents encircling the cloud-wreathed divine pavilions and celestial cities. Amidst the mist and clouds, the hosts of the manifold heavens assemble, their regalia arrayed with the jade-green parasols of the Heavenly procession, ocarinas and flutes harmonizing with the music of jade and stone. Solemnly attending the Heavenly Thearch’s imperial carriage, they enter together the Mystic Flower’s numinous park. All is wreathed in purple mists of divine transformation, the cloud-gate palaces and dragon courts. The yang essence coalesces and takes form, the immortal officials ascending the phoenix-paved terraces. They mount the jade altar and ascend the jeweled throne, the perfected attendants and celestial guards reverently standing by the imperial dais.\n\nThereupon, the Perfected of the Purple Void and the attendants of the immortal palaces strike the bells and sound the chimes, burn incense and scatter blossoms, chant the jade-toned hymns, and present the golden ceremonial silks. Prostrating in reverence, they await the sacred instruction. The Heavenly Venerable of the Upper Realm then addresses the assembly of the Perfected of the Purple Void:\n\n\"Of old, the profound and boundless True Origin arose from the Great Dao, commencing at the inception of the Primordial Void. Though the Spirit was One, its form was beyond description. At the dawn of the Grand Beginning, in the Upper Nine, it congealed into the celestial script. Those who comprehend it are naturally revered. Before the wondrous and nameless Supreme Thearch, it first inaugurated the unfolding of the Primordial Chaos. It ordained the Perfected Sovereign of the Heavenly Truth to succeed the era of the Dragon Han. Thus, the cloud-scriptures established their decree, prized within the immortal capital—not as vain or frivolous words, but as profound and resplendent texts. I, by fortune, have inherited the teachings of the Great Cavern and now administer the rites of enlightenment. Should you pose your question, I shall now expound upon it.\"\n\nAt this, the Perfected, hearing the master’s compassionate instruction, bowed twice, knelt in reverence, and prostrated, saying: \"I have heard that the virtue of Heaven is most profound, unfolding the Dao without end. Having received your luminous instruction regarding the Origin of Virtue, I now humbly request the cloud-scriptures, hoping for your gracious permission. Gazing upon your sagely virtue, I beseech the descent of your dharma-sound.\"\n\nThe Heavenly Venerable replied: \"How magnificent is your inquiry! Without profound contemplation, who could fathom such matters? Though my earlier words briefly illuminated the Way, its depth remains unplumbed. Now, I shall expound further for you.\n\nThe Great Void is boundless; the Perfected are self-so. The wondrous subtlety of the vast and undifferentiated, the profound mystery of the Primordial Chaos—these are the lords of luminous images and the forgetting of forms, the origin of the wondrously non-existent and the subtly existent. They cannot be known through sight or hearing, nor grasped through transmission or application. Only the treasure of the formless true spirit is the source of the Primordial Simplicity’s essence. Thus, the qi of this precious source is spirit yet without interval. Supreme is this qi, its unity all-pervading: above, it becomes the vast and boundless gale; below, it sustains the teeming and abundant flow. Within the winds and marshes, the primordial qi abides. How vast is the Mystic Void, the numinous yang’s celestial abyss!\n\nThe Mystic One is named Father, endowed with the potent yang’s qi of the One and the Non-Radiant. The Primordial Perfected of the Cavernous Yin embodies the yielding earth’s softness. The True One is called Mother, receiving the feminine white essence of the One. The two halves unite to form the Supreme One. The Supreme One deploys its transformations through divine metamorphosis; the Three Ones generate the Jade Infant, while the Nine Ones complete the full image. The ministers pay homage to the Imperial One as their sovereign.\n\nThus, the One Qi congeals in primordial unity, establishing the foundation of the Nine Yangs. Its qi is pure and void, subtle and indistinct. In the unfathomable workings of the obscure and dark, the Supreme Harmony’s numbers arise. At the inception of change and transformation, there were the Ancient Perfected. Next came the Supreme Lofty Perfected. In the era of antiquity, at the division of the primordial chaos, they exhorted the Spirit Thearch to descend and ordain the separation of the pure and the turbid. Thus, though not by ability, they were able; though not by necessity, it was so. Thereafter, they unfolded the Dao, elucidated the numinous scriptures, recorded and transmitted their teachings—also known as the cloud-scriptures. They pacified and stabilized the celestial realms, presiding over the center, governing the Eight Extremities, and engendering the Five Constants. Thus, the Three Powers and Nine Qi bestowed their grace upon the True Origin. The Cavernous Perfected transformed the workings of spirit, water, wood, fire, earth, and metal, shaping forms upon the earth. The Primordial Numinous revolved the qi of wind, fire, summerheat, dampness, dryness, and cold, distributing the mysterious across the heavens. Their transformations flowed through the seasons, and the generation of beings was thereby assured.\n\nThe Greater Yin, Lesser Yin, and Supreme Yin succeed one another; the Lesser Yang, Yang Brightness, and Supreme Yang follow in turn. Ending and beginning anew, they emulate the linked rings. They are the origin of the most divine and the lord of wondrous transformation.\n\nLater, the Cavernous Spirit of the Primordial Chaos and Supreme Ultimate Thearch divided their radiance across the ages. The Cavernous Perfected of the Primordial Origin again commanded the Perfected Sovereign of the Mystic Dao to inscribe the cloud-scriptures, designating them as the True Writ. Their words transcend the florid embellishments of the Radiant and the Prodigious; their principles enfold the intent of the Profound and Obscure. Engraved upon crimson crystal jade and adorned with azure auroral characters, they are the celestial teachings of the heavenly order, not the common words of the mundane world. Enshrined within a cinnabar-sealed pouch and placed upon a verdant auroral pedestal, their divine radiance descends and gathers, resembling clouds and mist. Secretly sealed within the Jade Treasury of the Perfected King of the Divine Empyrean Heaven, they were guarded by the Celestial Void Immortals, who marshaled the valiant celestial soldiers to protect the precious scriptures of the cloud-scriptures and True Writ.\n\nAt the kalpa of the Kaihuang era, the August High One of the Great Existence issued a decree from the Heaven of Equal Purity, specially proclaiming my mandate. The Celestial Prime Minister of the Supreme Mystery Capital and the Perfected Lord of the Heavenly Pivot were commanded to open the jeweled pedestal, retrieve the untransmitted scripture, and bestow it upon me. Having received and expressed my gratitude, I withdrew, thereby attaining the boundless capacity for enlightenment—what teachings could surpass this? This is the most wondrous and divine scripture of the Heavenly Venerable of the Great Veil, a treasure none can equal.\n\nWhen the great kalpa turns and the time of the Nine Sixes arrives, it shall be the year of advancing its power. Then, one may ascend the cloud chariot, follow the wind-drawn steeds, and promulgate these cloud-scriptures as an eternal teaching, universally bestowing deliverance upon humanity—is this not fitting? Should the celestial and terrestrial beings recite and comprehend them, they may complete their practice in a single day. By the imperial decree, they shall be summoned to transcend the mortal world. Escaping the苦海 of suffering, they shall ascend the immortal realms of unending light. Riding the azure simurgh’s chariot, they shall enter the Purple Obscurity’s capital, pay homage at the Crimson Gate’s palace, and wander the Mystic Orchard’s gardens. There, they shall commune with the origin of the Dao’s qi and the Perfected, delighting in the wondrous and unfathomable transformations. Is not this sagely achievement most excellent?\"\n\nThereupon, the august commissioner of the imperial destiny and the scribe of the immortals transmitted the Crimson Jade Book of the Supreme Void. Its radiant brilliance gathered and coalesced into resplendent hues, which they bestowed upon the Perfected of the Purple Void.\n\nThe Perfected received it, and with reverent invocation and solemn prayer, proclaimed to the Heavenly Venerable: \"Your lofty virtue, vast and towering, seeks to spread the profound mysteries of the cloud-script, thus revealing them to the assembly of heaven and humanity. To rescue the benighted and corrupt of this age, and to emulate the equalizing transformations of the Dao—such is the Heavenly Compassion’s teaching, a singular act of merciful bestowal. Yet I humbly consider my own capacities, though still unrefined and incomplete. Having received the Heavenly Mandate, how dare I not comply? Now, in solemn obedience, I shall reverently proclaim it:\n\nIf one truly wishes to magnify these ancient cloud-scriptures and celestial writings, to illuminate the Dao of the Cavern-Real, the Primordial Origin, and the Mystic Communion—then let virtue suffuse the immortal canons, for nothing is beyond attainment. With my full merit, I shall respond to the karmic tide and deliver humankind. Truly, as you have said, is this not magnificent?\n\nThe *Cavern-Real Primordial Writ of the Cloud-Scriptures: Opening the Source of the Dao* states:\n\nThe cloud-scriptures of the Three Heavens, the wondrous and true One,\nVast and silent, dim and obscure,\nElusive and boundless, of being and non-being intertwined.\nThe Dao is great and boundless, naturally nameless.\nThe primordial chaos knows no limit, whence the Five Ultimates arose.\nStill and desolate, the divine qi first stirred;\nQuiescent and active, it responds and purifies anew.\nThe Mystic Lord fashions all things, the Yellow Mother conceives souls.\nIn the harmony of primordial qi, forms take shape and divide.\nThe First Azure inaugurates the covenant, inscribing the Eight Gates.\nThrough them, the myriad beings are enlivened, and the fluid of life nourishes the sentient.\nThe imperial origin flourishes, not through writing yet written,\nPervading all, in every direction weaving the warp of scripture.\nQi circulates and nurtures all, from ancient times to the present.\nThe immortals’ virtue suffuses, their conduct perfectly harmonized.\nThey refine and solidify the peaks, infusing the root of true qi.\nThe Mud-Pill Emperor’s Unity, the Cinnabar Infant of Yang,\nThe Crimson Palace resplendent, the Yellow Court of Grand Harmony—\nWhen merit and conduct are both complete, they ascend to the Upper Capital.\nThe Great Luo stretches boundlessly, the Jade Clarity’s palace.\nThe Teaching Lord imparts his instructions, whether in absence or presence.\nThe Nine Perfected have awakened, the Mandate’s origin profound and luminous.\n\nThe *Scripture of Wondrous Oneness of Being and Non-Being*:\nThe feminine and masculine as one, qi transforms and engenders spirit.\nThe true and constant Primordial Beginning, the mystic source’s transforming mist.\nSubtly entering wondrous being, vastly abiding in heaven and earth.\nIn solemn contemplation of the Sage Lord, preserving the true and numinous.\nThe Yin Morning’s Grand Inception, the Yang Splendor’s qi exalted.\nLight floats in Brahmanic radiance, grandly journeying to meet the welcoming.\nThe emptiness and cavernous are revered, treasuring this precious attainment.\nThe divine phoenix dances, the jade fields and pure gold.\nThe Three Flowers and Cinnabar Mystery, the Nine Gates arrayed in heaven.\nOh, the divine transformation! All attain eternal life.\n\nThe *Scripture of the Cavern-Real Primordial Dao*:\nThe cavernous communicates with the true, the Non-Exalted and White Origin.\nThe vast spirits leap forth, the Five Emperors’ expansive immortals.\nShaking the Nine Abysses, wondrously transforming and enlivening all.\nBody and triumph unite, in accord with the divine source.\nWithin, the soaring clouds, azure mists and purple haze.\nBoundless and merged, crystalline and towering.\nRefining the Six Radiant Ones, cultivating the Yellow Mystery.\nEternally bearing form and spirit, ascending to the vast and great.\n[Untranslatable characters].\"\n\nThe radiant essence coalesces, the grand qi flourishes in splendor.\nThe Way advances in sequence, its intent directed toward the profound.\nThe Eight Trigrams and Nine Palaces align, the Five Agents and Six Harmonies converge.\nThe brine channels gleam bright, wondrous jade congeals upon the waves.\nThe great qi surges vast, attaining the true Primordial Dao.\n\nThereupon, the Purple Void Perfected One bowed in reverence and withdrew.\nDriving his spirit-steed, he trod the hues of cloud and mist.\nStriking the immortal music, he stirred the celestial sounds of heaven’s harmony.\nThe attendants bearing azure banners and yellow pennants emerged,\naccompanied by officers in star-crowned caps and cloud-woven robes.\nAll the retinue of officials trod upon the emerald haze.\nAs the mist and clouds wafted gently, the celestial gates were unlocked.\n\nAt that time, the host of divine immortals and perfected beings of the many heavens\nhad repeatedly received the sublime discourses of the August Void’s great compassion.\nThey declared: “We, your servants, are most fortunate to encounter such sacred grace.\nProclaimed are the wondrous transformations of the true spirits,\nand made clear is the Dao of primordial qi that permeates and quickens all life.”\nThus, the great assembly, deeply reverent, extolled the majestic and virtuous teachings.\nThey then chanted in unison the *Steps of the Void*,\ntheir voices rising as one like celestial immortals amid the clouds,\nsoaring forth from the grotto-heaven.\nIn the ethereal and natural realm, they roamed freely, venerating the Numinous Treasure.\nIn the distant kalpas of primordial creation, these cloud-script texts were transmitted.\nLuminous indeed is the principle that pervades the mysterious,\nand manifest is the unfolding of the Cavern-Real.\nThe great penetration flows through the wondrous origin,\nthe divine transformations adapt to the pure and dark.\nWhat is the meaning of this? It is simply to deliver humankind.\nThose who return to the ultimate transformation\nshall ascend on clouds to attend the imperial throne.\n\nThe perfected immortals then bowed in gratitude and withdrew,\neach riding clouds back to their celestial abodes.\nAt that moment, the jade dragons raised their heads,\ntheir roars resounding with the force of mist-laden radiance.\nThe golden simurghs lifted their voices,\ntheir songs weaving the dance of heaven’s harmony.\nThe divine immortals of the Highest Heaven, their majesty solemn,\nbrandished the Nine-Palace treasure swords and unfurled the Ten Transcendent spirit-pennants.\nOur Supreme Heavenly Venerable One, serene and joyful,\nrode the jade-reined spirit-dragon, bearing the jeweled canopy of harmonious bells.\nThe celestial maidens, graceful and fair,\nheld jade vases of lotus, their pure fragrance rich and pervasive.\nThe immortal maidens, elegant and radiant,\ngrasped golden censers of wondrous grottoes, their auspicious vapors curling and dense.\nThey waved the banners of the Great Transformation’s wondrous observation,\nand struck the jade-light rhythm of the True Flower.\nThe morning attendants sang and played music, its notes resonant and clear.\nThe divine guards marched forth, banners and flags fluttering.\nAuspicious winds whispered, stirring sleeves and setting jade pendants chiming.\nFelicitous clouds drifted gently, encircling the chariot wheels and swirling about rainbow robes.\nPreparing to return to the celestial palace,\nthey first ascended beyond the Starry River.\n\nThereupon, the azure registers inscribed with phoenix script were recorded,\nand the cinnabar crucibles stilled the dragon-script incense.\nAlas! The clouds of Kunlun soared,\nraining down osmanthus blossoms in joyous abandon.\nThe echoes of the altar’s rites dissolved,\nthe clashing of golden cymbals fading into stillness.\nThe image of the celestial pole’s wondrous transformation,\nthe form of the divine abyss’s profound obscurity—\nneither wind nor dew’s domain,\nthe mystery of presence and absence.\nThe true origin returns to the foundation of the Great Beginning,\nthe empty void reverts to the nameless root.\n\nThe Supreme Heavenly Venerable One concluded the *Scripture of the True Origin’s Permeating Immortal Dao*.\n\nAt that time, the Most High addressed Gong Ziming:\n“I have heard that learning progresses through discipleship, and the Dao is transmitted by a master.\nThough disciples may begin their studies under a teacher,\nthe pursuit of ultimate truth arises from innate nature.\nThus, even Bo Le cannot drive a dull nag and make it a unicorn,\nnor can a master craftsman hew rotten wood into a ridgepole.\nFor truly, rotten wood cannot be carved,\nand a wall of dung and earth cannot be plastered.”\n\nThe *Record of the True Origin* states:\n“The ancestral masters of the teaching were serene and without action,\ndevoted solely to the pursuit of longevity.\nAlas, sentient beings are deluded by the snares of desire and attachment—\nhow could they be without fault?\nThe supreme sages, moved by compassion, constantly strive to save humankind.\nWhen people in the world suffer bodily disharmony,\nmild cases become illness, and severe ones turn to disease.\nAmid misfortunes and calamities, or when assailed by demonic influences,\nthey should face the northwest celestial gate, burn incense, and reverently recite the ten sacred titles:\nFirst, the Supreme Heavenly Master of the Qian Origin;\nSecond, the Central August Supreme True Dharma King;\nThird, the Supreme Sovereign of the Nine Yangs and True Origin;\nFourth, the Supreme Transcendent Lord of the Three Caverns’ Transformative Teaching;\nFifth, the Merciful and Compassionate Great Constant Wondrous Dao of the Ten Heavens’ Flourishing Sagely Talent;\nSixth, the Supreme Venerable of Pure Forgiveness and Virtue, Responding to All Heavens’ Titles;\nSeventh, the Supreme Numinous Treasure Heavenly Venerable One of the Boundless Above;\nEighth, the Supreme Heavenly Venerable One of the Dao and Virtue of the Boundless Above;\nNinth, the Heavenly Venerable One of Universal Compassion and Salvation from Suffering of the Above;\nTenth, the Heavenly Venerable One of the Jade Void and Luminous August of the Above.\n\nProstrating in reverence, we recall the celestial titles of the Heavenly Venerables,\ninscribed within the jade cases of the Daoist canon.\nIn the blessed lands of the mortal realm, people propagate the scriptures of the Most High.”\n\nWith reverent devotion and sincere faith, the living shall receive blessings; with incense and floral offerings, the departed shall ascend to heaven. May all people of the world together partake in this luminous efficacy. When petitioning for talismanic water, one shall likewise receive healing. Thus, the talisman is the token of Heaven; water is one aspect of the Dao. If the Dao enters the belly through birth, natural well-being follows.\n\nOn days such as *jiazi*, *jiayin*, *jiachen*, *jiawu*, *jiashen*, and *jiaxu*, with wholehearted devotion, pay homage to the hosts of the Sagely Divine Kings of Wisdom of the Above, the Heavenly Generals of the Balanced Heavens, and the Divine Lads of the True Origin and Medicinal Immortals. May they deign to descend, deploy divine *qi*, treat illnesses, expel malevolence, and eradicate calamities and misfortunes. The prayers and vows expressed in the following passages all follow this precedent and need not be reiterated.\n\nOn the days of the Three Primes and the Eight Festivals, inscribe in azure ink the cloud-seal script of the True Origin of the Above. Recite the incantation:\n\n*\"The Primordial Beginning is spontaneous,\nAzure Yang shrouded in darkness,\nMysterious transformation, empty and vast,\nBoundless and formless.\nCondensing *qi* to stabilize the realm,\nFragrant through the world in name.\nEncompassing all heavens,\nNurturing the myriad spirits.\nCloud chambers and golden nets,\nTowering in the Supreme Clarity.\nTwelve supreme grades,\nInscribed with primordial essence.\nJade tones penetrate the subtle,\nMysterious echoes resound like jade.\nChanting and intoning issue forth,\nThe Imperial Perfected descends to the court.\nCurved reflections hang like branches,\nI offer to the Supreme Spirits.\nAttaining rank equal to Heaven,\nThe Three Luminaries merge in brilliance.\nEternally preserving the Great Void,\nUnshaken through kalpas.\"*\n\n*Swiftly, swiftly, in accordance with the statutes and decrees of the Supreme Lord Emperor.*\n\nWithin each person’s sixty-day cycle of *jiazi*, all procedures are to be fully observed. Next, on days such as *yichou*, *yimao*, *yisi*, *yiwei*, *yiyou*, and *yihai*, with wholehearted devotion, pay homage to the hosts of the Mighty Divine Kings, the Heavenly Generals of Celestial Might, and the Supreme Mystery Lads. Following this, on days such as *bingzi*, *bingyin*, *bingchen*, *bingwu*, *bingshen*, and *bingxu*, with wholehearted devotion, pay homage to the hosts of the Sagacious Divine Kings, the Heavenly Generals of Great Might, and the Supreme Origin Lads. Continuing, on days such as *dingchou*, *dingmao*, *dingsi*, *dingwei*, *dingyou*, and *dinghai*, with sincere devotion, pay homage to the hosts of the Majestic Divine Kings, the Heavenly Generals of the Above, and the Supreme Void Lads. Proceeding to days such as *wuzi*, *wuyin*, *wuchen*, *wuwu*, *wushen*, and *wuxu*, with wholehearted devotion, pay homage to the hosts of the Auspicious Divine Kings, the Heavenly Generals of Celestial Communication, and the Supreme Emptiness Lads. Further, on days such as *jichou*, *jimao*, *jisi*, *jiwei*, *jiyou*, and *jihai*, with sincere devotion, pay homage to the hosts of the Virtuous Divine Kings, the Heavenly Generals of Celestial Radiance, and the Supreme Immortal Lads. Additionally, on days such as *gengzi*, *gengyin*, *gengchen*, *gengwu*, *gengshen*, and *gengxu*, with sincere devotion, pay homage to the hosts of the Numinous Divine Kings, the Heavenly Generals of Celestial Wisdom, and the Supreme Perfected Lads. Moreover, on days such as *xinchou*, *xinmao*, *xinsi*, *xinwei*, *xinyou*, and *xinhai*, with sincere devotion, pay homage to the hosts of the Revered Divine Kings, the Heavenly Generals of Celestial Numinosity, and the Supreme Wisdom Lads. Again, on days such as *renzi*, *renyin*, *renchen*, *renwu*, *renshen*, and *renxu*, with sincere devotion, pay homage to the hosts of the Manifest Divine Kings, the Heavenly Generals of Celestial Fruition, and the Supreme Auspicious Lads. Finally, on days such as *guichou*, *guimao*, *guisi*, *guiyou*, and *guihai*, with sincere devotion, pay homage to the hosts of the Communicative Divine Kings, the Heavenly Generals of the Celestial Canopy, and the Supreme Virtue Lads.\n\nWithin the above six cycles of *jiazi*, pay homage to the hosts of the True Origin divine immortals. The prayers and vows expressed are all identical. They deliver and protect all beings, ensuring peaceful fruition. If one ingests the talisman, it can dispel misfortune. Not only does it dispel misfortune and disperse calamity, but it also cures illnesses and heals diseases. Only through single-minded, devout faith can one receive the methods of the Nine Perfected. If one wears it, it can protect the body. Not only does it protect the body and preserve the spirit, but it also bestows blessings and eliminates misfortune. Moreover, it is inscribed with golden names on purple slips, written in green characters upon the Jade Capital. Once a person attains well-being, it is called the Great Field of Blessing. Within this Field of Blessing, one may cultivate the Supreme True Origin Dao, and upon fulfilling the practices, ascend as an immortal.\n\nAccording to the *Scripture of the Sagely Chronicle*, if one pays homage and recites the ten titles of the Heavenly Venerable of the Above on the twenty-ninth day of each month, one shall not fall into hell in the future. The *Scripture of Anticipatory Cultivation* states: At the time of death, the virtuous shall be reborn in the natural domain of the Above, ascending according to their wishes. Furthermore, the *Preface to the Chart of Heavenly Officials* states: The Dao is fundamentally empty and nonexistent, yet through the obscure and indistinct, things come into being. The primordial *qi* of things is originally harmonious; it first rides the transformations of movement to differentiate forms. The subtle images of essence become manifest, arranging palaces and towers in the pure realms. The hidden essences silently congeal, opening grotto-heavens in the famous mountains. The Primordial Sovereign precedes the Lord of Images, uniquely transforming and standing alone as the True Master. Profoundly tranquil and still, it responds when stimulated—how majestic!\n\nThe *Scripture of the Jade Capital* declares: The myriad immortals of the Ten Flowers gather, forming palaces with purple mist. How luminous are the sagely ones, for their virtue and power are thus accomplished. Thus, the Proclaimed King is without preference yet without exclusion; the Most High is without action yet without inaction. The Mysterious Sovereign rode a white deer to ascend to heaven; the Yellow Emperor mounted a fiery dragon to depart the world. Dwelling high in golden halls, resting in jade terraces, they all knew the Dao of long life—this is surely not false.\n\nThose who cultivate the Dao and practice virtue encompass five aspects. First, cultivating the Dao within the body entails calming the heart and expanding one’s nature, cherishing *qi* and nurturing the spirit, reducing selfishness and curbing desires, thereby prolonging life and extending years. All falsity is eradicated, and one’s virtue becomes the conduct of a true person. Second, cultivating the Dao within the family entails a father’s kindness, a son’s filial piety, an elder brother’s friendliness, a younger brother’s deference, a husband’s trustworthiness, and a wife’s virtue. With harmony above and below, one’s virtue becomes the method of abundance. Third, cultivating the Dao within the village entails respecting the elderly, nurturing the young, instructing the ignorant and unrefined, so that the hundred surnames live in harmony, with trust and reverence above and below. Such virtue endures long.\n\nOne cultivates the Dao within the state by ensuring the ruler’s trustworthiness and the ministers’ loyalty, the court free from obstruction, ritual and music naturally flourishing, the hundred officials fulfilling their duties, calamities and disorders never arising, and the myriad treasures abundant and ripe—such virtue becomes full and substantial. One cultivates the Dao throughout the world by transforming without speech, governing without instruction, acting with simplicity and non-action, harmonizing all into great unity, so that every household merits enfeoffment, and transformation extends even to foreign lands—such virtue becomes all-pervading.\n\nThose who advance the Dao and establish virtue live; those who violate the Dao and oppose virtue die. Thus, Heaven possesses the Four Controller stars, located between *Xu* and *Wei*, beside the Human star, to oversee humanity. The two *Siming* stars govern one’s merits and faults, years and lifespan, rewards and deprivations. The two *Silu* stars govern one’s official rank, emoluments, clothing, and sustenance. The two *Siwei* stars govern one’s arrogance, dissipation, and impropriety. The two *Sifei* stars govern one’s perversity, delusion, and selfishness.\n\nHow luminous is Heaven’s manifestation of these! It bestows and withdraws its officers accordingly. The mirror of the sun shines here—how could one not reflect upon and understand this?\n\n*Shangfang Tianyi Zun Shuo Zhenyuan Tongxian Dao Jing Shiyin, Upper Scroll*\n\nPhonetic Annotations:\n\n*Upper Scroll*\nZī. Pronounced *jié*.\nChuāng. Pronounced *chuāng*.\nFú. Pronounced *fú*.\nBǐ. Pronounced *sè*.\nShù. Pronounced *shòu* (injure-meet cut).\nChuī. Pronounced *chǐ-wěi* cut.\nGào. Pronounced *gù*.\nYǒu jiàn. Pronounced *jí-xiàn* cut.\nWú jiàn. Same as above.\nJiàn. Pronounced *xiàn*.\nÀi. Pronounced *yù-gài* cut.\nZhù. Pronounced *zhōng-shù* cut.\n\n*Middle Scroll*\nGǒng. Pronounced *gòng*.\nHào. Pronounced *hào*.\nHàn. Pronounced *hàn*.\nLěi. Pronounced *lì-wěi* cut.\nJīn. Pronounced *jīn*.\nYī. Pronounced *yū-jì* cut.\nYì. Pronounced *yáng-rù* cut.\n\n*Lower Scroll*\nXiàn. Pronounced *hú-diǎn* cut.\nDū. Pronounced *dū*.\nSī. Pronounced *xiāng-shǐ* cut.\nSì. Pronounced *sì*.\nDù. Pronounced *yì*.\nShì. Pronounced *shì*.\nYì. Pronounced *yè*.\nGāo. Pronounced *gāo*.\nJiè. Pronounced *jiè*.\nDài. Pronounced *dài*.\nWú. Pronounced *wú*.\nTài. Pronounced *tài*.\nYuè. Pronounced *yuè*.\nZào. Pronounced *zào*.\nChū. Pronounced *chū*.\nDí. Pronounced *dí*.\nZhōng. Pronounced *zhōng*.\nTài. Pronounced *tài*.\nBiāo. Pronounced *qì*.\nQián. Pronounced *qián*.\nMáng. Pronounced *máng*.\nShéng. Pronounced *shéng*.\nJiǔ. Pronounced *jiǔ*.\nYǒu. Pronounced *yǒu*.\nHè. Pronounced *hè*.\nYǐn. Pronounced *yǐn*.\nQì. Pronounced *qì*.\nYǎo. Pronounced *yǎo*.\nGōng. Pronounced *gōng*.\nHuì. Pronounced *huì*.\nWáng. Pronounced *wáng*.\nYáng. Pronounced *yáng*.\nChén. Pronounced *chén*.\nShì. Pronounced *hào*.\nShēn. Pronounced *shēn*.\nYáo. Pronounced *qīng*.\nHuáng. Pronounced *huáng*.\nBào. Pronounced *bào*.\nFāng. Pronounced *xiāng*.\nTǎn. Pronounced *chǒu*.\nHū. Pronounced *xiān*.\nGào. Pronounced *gào*.\nYīn. Pronounced *yīn*.\nShàng. Pronounced *shàng*.\nMíng. Pronounced *míng*.\nSù. Pronounced *sù*.\nYuè. Pronounced *yuè*.\nLóng. Pronounced *lóng*.\nDòng. Pronounced *dòng*.\nÀo. Pronounced *ào*.\n\nLǔ. Pronounced *lǔ*.\nGǎo. Pronounced *gǔlǎo* (ancient reading).\nKǎo. Pronounced *kǎo*.\nQiāo. Pronounced *qínüè*.\nHáng. Pronounced *xiàlàng*.\nTuò. Pronounced *tǔwò*.\nHuáng. Pronounced *huáng*.\n\n#1 \"Cannot be without\": likely should read \"cannot be without a name.\"\n#2 Above \"original truth,\" two characters are likely missing.\n#3 The character \"thing\" is supplied based on the context above and below.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上方天一尊说真元通仙道经 经名：上方天专说真元通仙道经。 撰者不详。 一卷。 底本出处：《正统道藏》洞真部本文类。 上方天一尊说真元通仙道经 太极降德上篇 粤有上方真元浩浩，一炁化均之天，九清自然之国。 生三秀之草，植七宝之树，赤城庆蔼以腾腾，玉楼辉煌而赫赫，翠华阙庭，紫真宫掖，碧琐彤扉，龙乐凤乐，绛霞溶溶，青云迭迭。 皆太元凝结，真元变化，禁中之宸，独尊其内。 尔时天宸尊称十号，所为我上方乾元至圣天师，中皇太元上真法王，九阳太皇真元教主，元上三洞开化仙君，十天清衍圣才慈悯大常· 妙道化均上帝，诸天应号清诤赦罪上德至尊，上方无极太上灵宝天尊，上方无极太上道德天尊，上方褊慈救苦天尊，上方玉虚明皇天尊。 其皇闱神女，制礼侍奉，枞法鼓，铿华锺。 次诸天女，执舍虚散丝殊妙之庆，持朱缨青绶绛云之节，建九天华芝，开五明羽扇。 天尊升千光云殿，登七珍宝座，於藤光洞明白金颢色瑶席之上。 俄尔，上方无极飞天神王长生大圣，无量上品好生度人至真大神，三十二天君臣辅佑星官真人，大钧消灾弥罗比天神仙灵官，无鞅之众，皆奉天颜，来朝几前。 护道神人剑铁锵锵，驱邪仙戍旌旗赫赫。 是时金阙发真香，腾于太漠，飘扬于一炁之上。 射天光，照于道域，晃朗于八纮之中。 於是十华仙君，各瞻帝光，乘云龙而来格大罗飞梵之门。 归命侍晨，引朝凤墀。 自然天风肃肃，吹九龙之花。 仙乐嗈嗈，啸八鸾之曲。 灵飙鼓黄英之律，神渊着青华之色。 诸君设礼，瞻望圣颜，犹朱霞晖暧，煌煌奕奕，深居尊严之像，眩晃而奚能仰视。 於是，上方大明仙君，出斑告曰：臣等伏观天尊上帝，陆降流晖之殿，出入凝华之阙，施张四时之运，掌握七政之司，仙文示清真之风，法令警神元之化。 慈光普照，圣恩均被。 臣等稽首，来朝帝廷。 欲望皇慈垂悯，敢问太极之运，非上帝至高至明，安得赫然垂训乎？ 臣等恭听上圣玉音。 於是天尊蕴玄冥於虚无，凝寂默於自然，混真元於有间，理太素於无生。 泯以名色之诰，契以希夷之篇。 良久已而言曰：上德何从来？ 盖降於太极。 夫太极也者，大包天地之表，先居混沌之中。 自虚而产有，因浊而复清。 归之则罔穷其所，播之则咸着其像。 故见曜罗宿，茂毓方物，功资一炁，泽被九垓，是以化物所至，无不由之。 莽莽者，帝真也。 浩浩乎，元一焉。 以其安三才而臣五行矣。 且长天久地，宾居太极之问。 阳日阴星，熙朝真元之下。 故得之大者，遂冲和而久视。 失之鲜者，渐桔槁而夙已。 但大方之内，有名之属，莫不通其变而仰其化。 盖真一元炁，生化荡荡，吾未名其然，强名曰道。 道之德大，不可无＃１，吾称肇于玄圣。 其德广之，攸论昭然，肖真光灿彩，虽神书秘札，复何其加焉。 曰：玄圣成章，神哉无疆。 示天上人问，其德无间。 奈臣倥恫，不足以解天猷。 今者幸甚，伏遇上帝隆德圣才，太明洞鉴。 臣辈今欲闻其大教，上干宸造，敢望曲贻天听。 曰：夫玄圣所尚，其德者三。 始一论上德，次一论明行，又一其所论，又行而禁非。 然三者之为教，亡所不同。 各观其论，则名异也。 名虽或异，而未尝有违於太极，率同降德，为通玄微妙之变，吾上方贵之。",
      "translated_text": "The *Zhenyuan Tongxian Daojing* Spoken by the Heavenly Venerable of the Upper Realm\n\n**Title:** *Zhenyuan Tongxian Daojing* Spoken by the Heavenly Venerable of the Upper Realm. Author unknown. One scroll. Base text from the *Zhengtong Daoist Canon*, Dongzhen Section, Benwen Category.\n\n---\n\n### The Heavenly Venerable of the Upper Realm Speaks the *Zhenyuan Tongxian Daojing*\n#### The Supreme Virtue Descends from the Great Ultimate (First Chapter)\n\nIn the boundless expanse of the Upper Realm’s true primordiality, there exists a heaven born of the unified qi, a land of the Nine Purities’ spontaneity. It nurtures the three-luminous herbs and plants the seven-jeweled trees. Its crimson walls rise in radiant splendor, its jade towers blaze with brilliance. Verdant palaces and purple-pure halls stand in majestic array; green-jade portals and vermilion gates gleam resplendent. Dragon chants and phoenix melodies resound, crimson mists swirl in molten flow, and azure clouds billow in layered grandeur. All is the congealing of the Great Primordial, the transformation of the true primordial, the sacred inner sanctum where the Heavenly Venerable alone is exalted.\n\nAt that time, the Heavenly Venerable bore ten august titles: the Heavenly Master of the Upper Realm’s Qian-Yuan Supreme Sage, the Celestial Sovereign of the Great Primordial’s Upper Perfection, the Law King of the Nine Yangs’ Supreme True Primordial, the Enlightened Immortal Lord of the Three Caverns’ Opening Transformation, the Merciful and Benevolent Great Constant of the Ten Heavens’ Pure Propagation, the Wondrous Dao’s Harmonizing Highest Emperor, the Most Revered of Upper Virtue Who Absolves Sins and Purifies the Heavens, the Heavenly Venerable of the Upper Realm’s Limitless Supreme Numinous Treasure, the Heavenly Venerable of the Upper Realm’s Limitless Supreme Dao and Virtue, the Heavenly Venerable of the Upper Realm’s Compassionate Salvation from Suffering, and the Heavenly Venerable of the Upper Realm’s Jade Clarity and Luminous Augustness.\n\nHis imperial consorts and divine maidens attended with ritual propriety, striking the law drums and chiming the flowered bells. The celestial maidens that followed bore the wondrous offerings of void-dispersing silk, held vermilion tassels and azure sashes with crimson-clouded regalia, raised the nine-heavenly flowered mushrooms, and unfurled the five-luminous feathered fans.\n\nThe Heavenly Venerable ascended the Thousand-Radian Cloud Palace, mounting the Seven-Treasure Throne, seated upon a luminous jade mat of rattan-light and radiant gold. Presently, the Limitless Flying Heavenly Divine King of the Upper Realm, the Great Sage of Eternal Life, the Boundless Highest-Ranked Great Spirit Who Cherishes Life and Delivers Beings, along with the thirty-two Heavenly Lords, their ministers, and the stellar officials and perfected immortals, the great balance-dispelling calamities and the celestial-spanning Miroku divine immortals and numinous officers—an innumerable host—all presented themselves before the celestial throne, paying homage.\n\nThe guardians of the Dao brandished their swords with clanging steel, while the demon-expelling immortals raised banners in blazing glory. Then, golden portals emitted true incense, wafting into the Great Desert and drifting above the unified qi. It cast celestial radiance, illuminating the Dao’s domain and shining resplendent within the eight directions.\n\nThereupon, the Ten-Flowered Immortal Lords, gazing upon the imperial light, rode cloud-dragons to arrive at the gates of the Great Luo’s flying Brahma. They returned to their morning duties, ushered into the phoenix-paved court. The natural heavenly winds blew solemnly, stirring the nine-dragon flowers. Immortal music resounded in harmonious melody, echoing the eight-luan hymns. The divine breeze played the yellow blossoms’ rhythm, while the numinous abyss revealed the azure flowers’ hue.\n\nThe assembled lords performed their rites, gazing upon the sacred countenance—like the crimson dawn’s radiant glow, dazzling and majestic—enshrined in profound dignity, its brilliance too blinding to behold directly.\n\nThen, the Great Luminous Immortal Lord of the Upper Realm stepped forth and proclaimed: “Your servants have observed the Heavenly Venerable and Highest Emperor descending into the flowing-radiance palace, moving through the congealed-splendor halls, unfolding the four seasons’ course, and presiding over the seven governances’ offices. The immortal scriptures reveal the pure and true winds; the decrees admonish the divine primordial’s transformations. Your compassionate light shines universally, and your sagely grace extends evenly. We bow our heads and come to pay court in the imperial court. We humbly beseech your imperial compassion to bestow mercy. We dare to inquire of the Great Ultimate’s workings—without the Highest Emperor’s supreme illumination, how could its teachings be so resplendently bestowed? We reverently await the sagely jade utterance.”\n\nThereupon, the Heavenly Venerable concealed the mysterious darkness within the void, concentrated quiescence within spontaneity, blended the true primordial amid existence, and ordered the great simplicity within the unborn. Dissolving the proclamations of names and forms, he harmonized with the chapters of the subtle and formless. After a long while, he spoke:\n\n“From whence does the supreme virtue arise? It descends from the Great Ultimate. The Great Ultimate encompasses all beyond heaven and earth, first dwelling within the primordial chaos. From the void, it generates being; from turbidity, it returns to clarity. When gathered, its source is unfathomable; when dispersed, its forms are manifest. Thus, it reveals the shining constellations, nurtures the myriad things, its power drawn from the unified qi, its blessings extending across the nine realms. Wherever transformation reaches, none exists without it.\n\nVast and boundless is the true imperial essence; vast and infinite is the primordial unity. It stabilizes the three powers and subordinates the five phases. The enduring heavens and lasting earth dwell within the Great Ultimate’s embrace. The sun’s yang and the moon’s yin flourish beneath the true primordial’s governance. Those who attain the great thereby achieve harmony and longevity; those who lose it wither prematurely. Within the great expanse, all named beings transform in accordance with its changes and look up to its transformations.\n\nThe true unity’s primordial qi generates and transforms in boundless measure—I cannot name its nature, so I forcibly call it the Dao. The Dao’s virtue is vast and cannot be without [omission]. I ascribe its origin to the mysterious sages. Its virtue, when broadly expounded, is clearly evident, resembling the true light’s radiant splendor. Even the divine books and secret scrolls—what more could they add?\n\nIt is said: The mysterious sages complete their chapters—how wondrous and boundless! They reveal the teachings to heaven, earth, and humanity, their virtue unceasing. Yet your servants, in their ignorance, are insufficient to comprehend the celestial plan. Today, we are most fortunate to encounter the Highest Emperor’s exalted virtue and sagely wisdom, his great illumination and penetrating insight. We now wish to hear the great teachings, daring to present them before the imperial presence. We humbly hope for your gracious attention.”\n\nHe replied: “What the mysterious sages esteem are three virtues. The first expounds supreme virtue; the next, luminous conduct; and the third, the teachings of conduct and prohibitions against wrongdoing. Though these three teachings differ in name, they never deviate from the Great Ultimate. All uniformly descend virtue to enact the subtle and wondrous transformations of the Dao. This is what we in the Upper Realm hold most precious.”",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1247,
      "start_sentence": 0,
      "end_sentence": 57,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.68611454963684,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\上方天尊说真元通仙道经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "如其弗从玄变，固欲进真元之道，噫嘻也欤，将安能乎？ 於是，上方仙君，而子广灵，仰赞宏论，称扬愒言：天渊苍苍，云宫皇皇。 中有圣才，攸启龙章。 太极浩荡，真元琳琅。 德降有名，通变无疆。 高论昭昭，玄迪扬扬。 能承之者，臣朝上方。 於是天尊复为三罗仙曹之众曰：夫天功所贵，导诱为先。 普度天人，咸臻至妙。 离於有像，适於无为。 免生化陆降之苦，得精真元灵之道。 今将拟训紫霄，兆等还能逝夫。 於是，众仙愿奉帝裁。 时炉停瑞谒，花发祥烟。 仙兵征路，执旌旗而翼翼。 天丁导引，持剑铁而恍恍。 仙君之属，奉承法驾。 凤盖飘飘，龙车刮。 上陆五云之銮舆，臣驭九斑之鳞蚪。 丹输徘徊兮，云霞捧出。 白鹤翱翔兮，风烟晻映。 黄阙参差，碧天杳渺。 击磬初鸣，举仙音而宛转。 钹锺才散，作天乐而铿锵。 玉女麾幢，肇从玄漠之中。 金童鼓节，来临紫虚之上。 上方天一尊说真元通仙道经 德归素无中篇 若夫紫清之境，碧云之乡，仙云之中，爰有太皇。 凭黄龙之玉几，天姿穆穆。 处白鳞之金辖，銮声间间。 真人翼辕，飞行烟毂。 神仙导驾，从履云飕。 风飘飘而龙旗，云苒苒而绕鹤氅。 步阙清阳飞神之天，入三景紫霄妙真之界。 忽闻华音，清声飘逸。 诸仙迩听，广灵遥观。 则云捧鹤台而远，风引星旗而班。 於中主者，号清都仙君。 瞻望云舆，参礼几前：恭惟至圣，仙游紫清。 曲回九阳之车，垂軴十华之云。 今者伏遇，臣之幸甚。 敢希天造，赐降臣所。 伏丐留神，少加矜悯。 於是，天尊抑如其梼。 是时，诸真奉翠华仙仗，降自皇宫，擎紫清帝辇，来履王府。 自然凝结，云山巍峨。 道炁流化，仙苑浩涆。 太霞之京，祥烟之宇。 廊应杳霭，宫廷晖耀。 琼花飘落於云间，绛节缤纷於庭下。 苍龙献宝于池沼，白鹿衔芝于栏槛，神鸾穿卉于丹墀，天麟喷香于玉砌。 上帝升座于瑶局，云官侍奉于金殿。 於是，仙君上香奉膳，以逮诸真，设斋既已，天尊上帝而谓仙君曰：吾受命玉清之主，获任上方之尊，乐大通景真之理，统天政泛元之道。 俯视群生，也不猷何略？ 失德迷元，亡归太素。",
      "translated_text": "Should one fail to follow the subtle transformations of the Dao, how then could one advance upon the Way of True Primordial qi? Alas! How indeed could it be possible?\n\nThereupon, the immortals of the Upper Realm, led by the Venerable Guangling, raised their voices in praise of this grand discourse, extolling its profound words:\n\n“The azure depths stretch boundless,\nThe cloud-palaces gleam resplendent.\nWithin them dwells sagely wisdom,\nUnfolding the dragon-script of celestial decree.\nThe Great Ultimate flows vast,\nTrue Primordial qi shines like jade.\nVirtue descends with name,\nIts transformations boundless through the Dao.\nLuminous teachings shine forth,\nMysterious guidance spreads far.\nThose who can inherit this—\nAre the ministers who serve the Upper Realm.”\n\nThen the Heavenly Venerable addressed the assembled immortals of the Three Nets, saying: “What the celestial work esteems above all is guidance and instruction. To universally deliver gods and humans, all may attain the utmost subtlety—departing from form, aligning with non-action. Thus freed from the sufferings of birth, transformation, descent, and mortality, they may obtain the Way of refined True Primordial qi. Today, I shall instruct the Purple Empyrean; can you, my disciples, follow?”\n\nThereupon, the assembled immortals pledged to obey the imperial decree. At that moment, the incense burners paused, emitting auspicious smoke, and flowers bloomed in fragrant mist. The immortal soldiers set forth on their path, bearing banners that fluttered in formation. The celestial guards led the way, wielding swords that gleamed with divine radiance. The immortals, in their ranks, attended the imperial procession. Phoenix canopies billowed, dragon chariots rumbled. Ascending the five-cloud imperial carriage, the ministers drove nine-spotted leviathans. Crimson wheels lingered as clouds and mist bore them aloft; white cranes soared as wind and haze intertwined. The yellow gates rose in tiers, the azure heavens stretched distant. The first chime of the qing bell rang out, and immortal melodies rose in graceful turns. The cymbals and bells dispersed, and celestial music resounded with resonant harmony. Jade maidens waved their banners, emerging from the mysterious void; golden youths beat time, descending upon the Purple Void.\n\nThe Heavenly Venerable of the Upper Realm expounded the *Scripture of the Way of True Primordial Communion with Immortals*. The *Power Returns to the Plain Non-Being* chapter states:\n\nWithin the realm of Purple Clarity, the land of azure clouds, amid the celestial mists, there resides the Supreme August One. Leaning upon a jade table of the Yellow Dragon, his celestial bearing is majestic. Seated within the golden chariot of the White Unicorn, the sound of its bells rings clear. True Persons flank the axle, flying through the misty hubs. Divine immortals guide the carriage, treading upon the rushing clouds. Winds flutter the dragon banners; clouds swirl around the crane-feathered robes. They step through the Gate of Clear Yang, ascending the Heaven of Flying Spirits, entering the realm of the Three Radiant Ones—the wondrous and true domain of Purple Empyrean. Suddenly, melodious voices drift by, their pure tones floating and free. The assembled immortals draw near to listen; the Venerable Guangling gazes from afar. Clouds bear the Crane Terrace into the distance; winds lead the starry banners into formation. Among them, the presiding master is named the Immortal Lord of Pure Capital. Gazing upon the cloud-borne carriage, he pays homage before the imperial seat:\n\n*“We revere the Most Sagely One,\nWhose immortal journey graces Purple Clarity.\nThe nine-sun chariot turns in graceful arcs,\nTen-flowered clouds trail in its wake.\nToday, we are most fortunate to encounter your presence.\nDaring to hope for the celestial grace,\nWe humbly beseech your divine attention,\nAnd pray for your compassion.”*\n\nThereupon, the Heavenly Venerable granted their prayer. At that time, the perfected ones presented the jade-green imperial regalia, descending from the imperial palace. They raised the Purple Clarity imperial carriage, arriving at the royal court. Naturally, clouds and mountains formed in towering majesty; the qi of the Dao flowed and transformed, the immortal gardens vast and shimmering. The capital of rosy clouds, the halls of auspicious mist—corridors echoed in the distant haze, palace courtyards gleamed with radiance. Jade flowers drifted down amid the clouds; crimson staffs scattered in the courtyard below. Azure dragons offered treasures in the ponds; white deer bore lingzhi herbs along the railings. Divine simurghs wove through the crimson steps; celestial unicorns exhaled fragrance upon the jade terraces.\n\nThe Supreme August One ascended the throne of carved jade; cloud officials attended in the golden hall. Thereupon, the Immortal Lord offered incense and presented offerings, extending the rites to all the perfected ones. Once the vegetarian feast was arranged, the Heavenly Venerable and Supreme August One addressed the Immortal Lord, saying:\n\n*“We receive the mandate of the Jade Clarity Lord,\nEntrusted with the honor of the Upper Realm’s throne.\nDelighting in the principle of Great Communion with the Radiant and True,\nWe govern the celestial administration and the boundless Way of Primordial qi.\nGazing down upon the multitudes,\nWhat strategy could be lacking?\nYet they lose virtue and stray from the Primordial,\nFailing to return to the Great Plain of Simplicity.”*",
      "overlap_context": "rial presence. We humbly hope for your gracious attention.”\n\nHe replied: “What the mysterious sages esteem are three virtues. The first expounds supreme virtue; the next, luminous conduct; and the third, the teachings of conduct and prohibitions against wrongdoing. Though these three teachings differ in name, they never deviate from the Great Ultimate. All uniformly descend virtue to enact the subtle and wondrous transformations of the Dao. This is what we in the Upper Realm hold most precious.”",
      "start_char": 1247,
      "end_char": 2068,
      "start_sentence": 58,
      "end_sentence": 113,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.237737894058228,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\上方天尊说真元通仙道经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "陆降罔息，吾深悼之。 然后飞灵瑞之光，以召诸天之众。 欲计万真，游行九天，劲之真官，将施教化。 且圣君之教，以化契德。 其德也者，故地天以之泰，品汇以之生，人若由之，以其登仙。 昔圣君之德教时，天人无喻者，惟真皇识之，书于玉京。 原其大宗，以德为贵。 如十方仙君，其於真文则未闻，及其德也则大成，今阶列仙府，盖德之至也。 曰：臣窃惶惧，虔仰尊仪，出九霄金阙之上，会诸仙玉京之隅。 特章太猷，降诲臣等。 愿闻十天君者，昔作奚善，今为天王，臣匪知其然也。 欲望上圣曲赐矜怜，臣惶骇之至，谨埃天裁。 曰：夫建德者，太上所贵也。 失德者，上帝其禁之。 是故应德成之者，及乎调守交炼。 爱凝神气者，然后而朝玉宸矣。 匪其行行累功者，天位安得而有之。 夤乃有讯於诸君，故我可肆於上善。 积善诸君，昔在人间，皆通三坟之典，亦明七部之经。 广德兼济，神升十方。 夫上方皇极太洞天府冲虚仙君者，尝作上德，慈爱国人。 下方针中万化天府崇德仙君者，昔为德政，忠事圣君。 东华青阳神化天府晨晖仙君者，尝行孝悌，救生之行心南极丹阳炎明天府朱晖仙君者，夙为善德，出世之功。 西灵太素颢德天府清和仙君者； 明解悟之法，行清高之行，述三乘之范，开四宗之猷。 北真太渊玄一天府元冥仙君者，炼内外之丹，从阴阳之卫，演四辅之源，宗三洞之奥。 艮乡太昱中成天府明文仙君者，任天运之俯仰，齐时物之兴衰，诵三皇之教，行五常之道。 巽界大宁丹华天府进道仙君者，建像宇而度生，行科教而济死，弘九天之法，受三境之箓。 坤域广宁承柔天府朱华仙君者，初祖述於通玄仙伯之书，终宗法於洞灵真人之旨。 捐有害而取利性，处无为而推自然。 间导引以资气味，时呼吸以还元精。 晋洞真洞玄之理，符始神妙化之源。 乾维太昊清乐天府幽源仙君者，尝进心於司命天尊之训，亦勤志於混元大道之科。 知黑白而用玄牝服天炁而传精神。 饵仙药以制伏阴魄，炼神丹以点化阳魂。 纳二景七元之爽，抱八宏五纬之和。 於是，存真一元一之炁，辨初九上九之爻，故得丹成於中已，而行完於外如。 诸君昔者皆炼神炼气，炼形炼质。 饮饵匪疑，学炎帝之文。 调摄有理，习轩后之书。 故德备下方，思清厌世，身化神蜕，白书仙去。 逐乘云路，逍遥紫极，所归太素之元。 为无以加况犹未闻云篆真文。 於是清都仙君，仰荷天恩曰：广哉德也，而臣等均受教矣。 是时，上方紫虚真人，道炁清伟，仙颜神秀，绿发黄冠，鹤氅云裳，出班设礼，上白天尊曰：臣切伏观吾师上帝，圣德晖宣於凤阙，神章振发於云天，集众妙之源，极广灵之听。 臣意愿法驾贶降昆仑，普垂慈诲，大启法言。 望赐圣裁，天威特许。 曰：夫变微通妙者，述先师之正真。 发言弘道者，锡后圣之命元。 既子有讯，务在度人。 斯为胜善，吾宁拒之？ 时命九霄之君、十极之王，衣山纹之服，列星旗之队，上方天兵神仙之师。 奉翠华天仗，步紫虚云路。 琅音初辍於天关，箫声齐启於地户。 凝结宫廷而复本，流化池沼以还元。 云旋灵，风行熠熠。 遥指昆仑，仙游而适矣。 上方天一尊说真元通仙道经 真元通仙下篇 夫惟九清渺邈，蕴昆仑之天。",
      "translated_text": "The ceaseless descent of mortals fills Us with profound sorrow. Then, We summoned the radiant light of flying spirits to assemble the hosts of all heavens. Desiring to reckon the myriad perfected ones, We traversed the Nine Heavens, dispatching the stalwart officials of the True to bestow transformation through teaching.\n\nMoreover, the sagely lord’s instruction is to transform by aligning with virtue. This virtue is that by which Heaven and Earth attain harmony, the ten thousand classes of beings come into existence, and men, if they follow it, ascend to immortality. In the era when the sagely lord’s virtue and teaching prevailed, none among gods or men could fathom it—only the True Sovereign recognized it and inscribed it upon the Jade Capital. Tracing its great origin, virtue is held most precious. Consider the ten directions’ immortal lords: though they have not heard the True Scriptures, by their virtue they have attained great accomplishment, and now they rank among the immortal courts—surely the ultimate of virtue.\n\nThe Immortal Lord said: *“Your servant, trembling with awe, reverently gazes upon Your august presence, having emerged from the golden palaces of the Nine Empyreans to convene with the immortals at the corners of the Jade Capital. Your singular decree of great strategy descends to instruct us, your servants. We humbly wish to hear: of the Ten Heavenly Lords, what meritorious deeds did they perform in the past to become Heavenly Kings today? Your servant knows not how this came to be. We beseech the Most Sagely One to graciously bestow compassion. Overwhelmed with trepidation, we await Your celestial judgment.”*\n\nThe reply came: *“To establish virtue is what the Supreme Most venerates. To lose virtue is what the August Emperor forbids. Thus, those who perfect virtue through cultivation and harmonious refinement—those who concentrate spirit and qi—may then ascend to the Jade Throne. Without the ceaseless accumulation of merit through practice, how could one attain the celestial rank? Now, let Us inquire of you all: We may freely expound upon the highest good. The virtuous lords of old, while still among men, all mastered the Three Tombs’ classics and understood the Seven Divisions’ scriptures. Their vast virtue and universal salvation elevated their spirits to the ten directions.*\n\n*The Supreme August Lord of the Upper Realm’s Primordial Void Immortal Court once practiced supreme virtue, showing compassion to the people of his land. The Venerable Virtue Immortal Lord of the Lower Realm’s Myriad Transformations Heavenly Court formerly administered virtuous governance, loyally serving the sagely lord. The Dawn Radiance Immortal Lord of the Eastern Florescence’s Divine Transformation Heavenly Court once practiced filial piety and fraternal duty, his heart set on acts of life-saving. The Vermilion Radiance Immortal Lord of the Southern Culmen’s Vermilion Yang Luminous Heavenly Court early cultivated virtuous deeds, achieving world-transcending merit. The Pure Harmony Immortal Lord of the Western Numinous’s Primordial Purity Heavenly Court; he illuminated the Dharma of awakening, practiced lofty and pure conduct, expounded the Three Vehicles’ models, and inaugurated the Four Schools’ strategies. The Primordial Darkness Immortal Lord of the Northern True’s Primordial Abyss Heavenly Court refined inner and outer elixirs, followed the protection of yin and yang, unfolded the Four Assistants’ origins, and revered the Three Caverns’ mysteries. The Luminous Script Immortal Lord of the Northeastern Dawn’s Central Completion Heavenly Court bore the rise and fall of Heaven’s movements, harmonized the waxing and waning of temporal things, recited the Three Sovereigns’ teachings, and practiced the Five Constants’ Dao. The Advancing Dao Immortal Lord of the Southeastern Peace’s Vermilion Florescence Heavenly Court established temples to deliver beings, practiced ritual teachings to save the dead, propagated the Nine Heavens’ Dharma, and received the Three Realms’ registers. The Vermilion Florescence Immortal Lord of the Earthly Domain’s Vast Peace Heavenly Court initially transmitted the writings of the Master of Penetrating Mystery, ultimately revering the principles of the Perfected One of Cavernous Spirit. He relinquished harm to embrace beneficial nature, abided in non-action while advancing spontaneity. At intervals, he guided and led to nourish qi and flavor; at times, he breathed to return primordial essence. He penetrated the principles of the Cavernous True and Cavernous Mystery, aligning with the wondrous transformative source of the primordial spirit. The Dark Origin Immortal Lord of the Heavenly Pillar’s Supreme Purity Joyous Heavenly Court once advanced his heart in the Celestial Lord of Destiny’s teachings and diligently applied himself to the statutes of the Primordial Dao. Knowing black and white, he employed the Mysterious Female; ingesting celestial qi, he transmitted spirit. He consumed immortal medicines to subdue yin’s corporeal soul, refined the divine elixir to transmute yang’s ethereal soul. He absorbed the clarity of the Two Luminaries and Seven Origins, embraced the harmony of the Eight Vastnesses and Five Wefts. Thus, he preserved the true unity of the primordial qi, discerned the first and ninth yang lines. Therefore, the elixir formed within, and his conduct was perfected without.*\n\n*All these lords of old refined spirit, refined qi, refined form, refined substance. Without hesitation, they consumed and ingested, studying the writings of the Flame Emperor. With reasoned regulation, they practiced the books of the Yellow Emperor. Thus, their virtue filled the lower realms, their thoughts purified and wearied of the world. Their bodies transformed, their spirits shed, they ascended as immortals inscribed in white script. Riding the cloud paths, they roamed freely to the Purple Culmen, returning to the Primordial of Great Simplicity. Yet even so, they had not heard the cloud-script True Writings.”*\n\nThereupon, the Immortal Lord of the Pure Capital, reverently bearing the Heavenly grace, said: *“Vast indeed is virtue! Your servants have all received Your teaching.”*\n\nAt that time, the Purple Void Perfected One of the Upper Realm, his Dao-qi pure and majestic, his immortal countenance divinely radiant, his green hair crowned with a yellow cap, his crane-feather cloak and cloud robes, stepped forth, performed the rites, and addressed the Heavenly Venerable: *“Your servant humbly observes that our Master, the August Emperor, radiates sagely virtue in the Phoenix Tower and vibrates divine scriptures across the cloudy heavens, gathering the source of all wonders and extending the vastness of numinous hearing. Your servant’s wish is that the imperial carriage might descend upon Kunlun, universally bestowing compassionate instruction and grandly inaugurating the Dharma’s words. We beseech Your sagely judgment; may the Heavenly might specially permit it.”*\n\nThe reply came: *“To convey the subtle and penetrate the wondrous is to transmit the true and orthodox of former masters. To utter words that propagate the Dao is to bestow the mandate of future sages. Since you have inquired, the duty lies in delivering beings. This is the supreme good—how could We refuse?”*\n\nThen, the Lords of the Nine Empyreans and the Kings of the Ten Poles were commanded to don robes embroidered with mountain patterns and array their ranks with starry banners, the celestial soldiers and immortal hosts of the Upper Realm. Bearing the jade-green parasols of the Heavenly procession, they trod the purple void’s cloud paths. The chiming tones of jade bells ceased at the Heavenly Gate, the panpipes’ music arose in unison at the Earthly Portal. The palace halls congealed to return to their origin; the pools and ponds flowed to revert to their source. Clouds swirled in numinous brilliance; winds moved in radiant splendor. Pointing afar to Kunlun, the immortals journeyed and arrived.\n\n*The Heavenly Venerable of the Upper Realm expounds the Scripture of the True Origin’s Communion with Immortality*\n*True Origin’s Communion with Immortality, Lower Scroll*\n\nNow, the Nine Pures stretch into the distant, enfolding the heavens of Kunlun.",
      "overlap_context": " Venerable and Supreme August One addressed the Immortal Lord, saying:\n\n*“We receive the mandate of the Jade Clarity Lord,\nEntrusted with the honor of the Upper Realm’s throne.\nDelighting in the principle of Great Communion with the Radiant and True,\nWe govern the celestial administration and the boundless Way of Primordial qi.\nGazing down upon the multitudes,\nWhat strategy could be lacking?\nYet they lose virtue and stray from the Primordial,\nFailing to return to the Great Plain of Simplicity.”*",
      "start_char": 2068,
      "end_char": 3299,
      "start_sentence": 114,
      "end_sentence": 173,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.07363152503967,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\上方天尊说真元通仙道经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "一炁混凝，秀琳溪之岘。 天山嵯峨，溪水潺湲，清流环引，神阁云城o 烟云之中，诸天之众，仪仗列翠华之节，埙箎 和玉石之音。 只奉天帝法驾，俱入玄华灵囿。 皆紫烟神变，云阙龙庭。 阳精结化，仙官凤墀。 上升玉坛，而登宝座，天真侍卫，钦承几前。 於是，紫虚真人及仙宫侍晨，铿锺击磬，焚香散花，歌玉音之章，进金币之仪，稽首归依，恭俟诲焉。 我上方天尊，而为紫虚真人之众曰：昔渊兮真元，来从大道，肇虚玄之首，神一而容不书； 开太初之际，上九而凝成篆。 其识之者，自然尊也。 册妙无上帝，先启之鸿蒙之运； 命天真皇人，亚纪之龙汉之年。 则云章建言，为仙京所贵，非嚣嚣之辞，乃郁郁之文。 吾幸承大洞之训，辄行开化之科。 如汝发问，今将论之。 是时，真人闻师慈诲，再拜长跪，稽首而言：臣闻天德至玄，开道无穷。 若夫德元，既闻明训，拟请云篆，幸蒙恩许。 瞻望圣德，特降法音。 曰：盛矣哉，如子之问也。 不有玄思，孰能讯之以此。 然前言略明，其道未若，今为尔再广之。 夫大空无极，真人自然。 寥廓浑沦之妙，太虚蒙昧之奥，明像明忘之主，妙无妙有之宗。 非视听而可知，虽传用而曷得。 惟无形真神之珍，乃太素元精之源。 故珍源之炁，神而无间。 君哉炁也，其通者一，上为浩浩之飙，下承沃沃之泛。 风泽之中，元炁存焉。 大哉玄虚，灵阳天渊。 玄一名父，禀雄一无英之炁。 元真＃２洞阴坤柔。 真一称母，受雌一白元之精。 两半同成，合为太一。 太一布化而神变，三一生成於玉婴，分列九一以全像，臣朝帝一以为尊。 是以一气混凝，九阳肇基，其炁清虚，幽渺惚悦。 杳冥运播，太和数生，变易初化，有古真人。 次号无上高真，於有古之时，胚判混沌，劝神帝降运，以分清浊。 故非能而能，非然而然，然后演道，遂明灵篆，纪书垂训，亦号云章。 安镇天境，主持中央，统御八极，生成五常。 故三才九炁，恩被真元。 洞真化神水木火土金之运，成形于地。 元灵轮风火暑湿燥寒之炁，布玄于天。 变流於时，物生固有。 厥阴、少阴，太阴之徙； 少阳、阳明、太阳之继。 终而复始，肖循连环。 为至神之宗，妙化之君者也。 后洞神混元太极之帝，分辉於世时也。 洞真元尊复命玄皇大道君，特书云章，署为真文。 言亡英诞之华，理蕴玄冥之旨。 刻赤晶之玉，贲碧霞之字。 乃天伦之训，非世常之辞。 盛以丹销之囊，置以青霞之岌。 神光降集，状若云烟。 秘封神霄天真王玉府。 中相太虚仙，统帅刚烈天兵，营卫宝科云篆真文。 至开皇之劫时，高上大有之尊，诏下钧天，特旨宣吾。 命太玄都省仙公、天枢上相真君，发宝华之岌，取未传之书，遂锡於我。 受谢而退，即得开导无穷，而何教矣。 此大罗天尊至神太奇之篆，非若孰能当之。 如临大运，遇时九六，其力进之年也。 乃能发云轩，从风驷，垂斯云篆，永以为训，普行度人，不亦可乎。 使夫天人诵解，由之一日行完。 夫惟下诏，则拜帝宣越人世。 离滔天之苦海，凌不夜之仙墟。 乘青鸾之舆，入紫冥之京，朝丹阙之宫，游玄圃之苑。 遂道炁通真之元，乐不神妙无之化。 惟此圣功，宁无佳乎。 於是，委皇极祚灵，掌书仙者，传太无赤玉之书，光芒荣射，集然而成华色，以付紫虚真人。",
      "translated_text": "One qi congeals in primordial unity, gracing the peaks of Xian by the limpid streams. The celestial mountains rise in towering majesty; the brook’s waters ripple and flow, their clear currents encircling the cloud-wreathed divine pavilions and celestial cities. Amidst the mist and clouds, the hosts of the manifold heavens assemble, their regalia arrayed with the jade-green parasols of the Heavenly procession, ocarinas and flutes harmonizing with the music of jade and stone. Solemnly attending the Heavenly Thearch’s imperial carriage, they enter together the Mystic Flower’s numinous park. All is wreathed in purple mists of divine transformation, the cloud-gate palaces and dragon courts. The yang essence coalesces and takes form, the immortal officials ascending the phoenix-paved terraces. They mount the jade altar and ascend the jeweled throne, the perfected attendants and celestial guards reverently standing by the imperial dais.\n\nThereupon, the Perfected of the Purple Void and the attendants of the immortal palaces strike the bells and sound the chimes, burn incense and scatter blossoms, chant the jade-toned hymns, and present the golden ceremonial silks. Prostrating in reverence, they await the sacred instruction. The Heavenly Venerable of the Upper Realm then addresses the assembly of the Perfected of the Purple Void:\n\n\"Of old, the profound and boundless True Origin arose from the Great Dao, commencing at the inception of the Primordial Void. Though the Spirit was One, its form was beyond description. At the dawn of the Grand Beginning, in the Upper Nine, it congealed into the celestial script. Those who comprehend it are naturally revered. Before the wondrous and nameless Supreme Thearch, it first inaugurated the unfolding of the Primordial Chaos. It ordained the Perfected Sovereign of the Heavenly Truth to succeed the era of the Dragon Han. Thus, the cloud-scriptures established their decree, prized within the immortal capital—not as vain or frivolous words, but as profound and resplendent texts. I, by fortune, have inherited the teachings of the Great Cavern and now administer the rites of enlightenment. Should you pose your question, I shall now expound upon it.\"\n\nAt this, the Perfected, hearing the master’s compassionate instruction, bowed twice, knelt in reverence, and prostrated, saying: \"I have heard that the virtue of Heaven is most profound, unfolding the Dao without end. Having received your luminous instruction regarding the Origin of Virtue, I now humbly request the cloud-scriptures, hoping for your gracious permission. Gazing upon your sagely virtue, I beseech the descent of your dharma-sound.\"\n\nThe Heavenly Venerable replied: \"How magnificent is your inquiry! Without profound contemplation, who could fathom such matters? Though my earlier words briefly illuminated the Way, its depth remains unplumbed. Now, I shall expound further for you.\n\nThe Great Void is boundless; the Perfected are self-so. The wondrous subtlety of the vast and undifferentiated, the profound mystery of the Primordial Chaos—these are the lords of luminous images and the forgetting of forms, the origin of the wondrously non-existent and the subtly existent. They cannot be known through sight or hearing, nor grasped through transmission or application. Only the treasure of the formless true spirit is the source of the Primordial Simplicity’s essence. Thus, the qi of this precious source is spirit yet without interval. Supreme is this qi, its unity all-pervading: above, it becomes the vast and boundless gale; below, it sustains the teeming and abundant flow. Within the winds and marshes, the primordial qi abides. How vast is the Mystic Void, the numinous yang’s celestial abyss!\n\nThe Mystic One is named Father, endowed with the potent yang’s qi of the One and the Non-Radiant. The Primordial Perfected of the Cavernous Yin embodies the yielding earth’s softness. The True One is called Mother, receiving the feminine white essence of the One. The two halves unite to form the Supreme One. The Supreme One deploys its transformations through divine metamorphosis; the Three Ones generate the Jade Infant, while the Nine Ones complete the full image. The ministers pay homage to the Imperial One as their sovereign.\n\nThus, the One Qi congeals in primordial unity, establishing the foundation of the Nine Yangs. Its qi is pure and void, subtle and indistinct. In the unfathomable workings of the obscure and dark, the Supreme Harmony’s numbers arise. At the inception of change and transformation, there were the Ancient Perfected. Next came the Supreme Lofty Perfected. In the era of antiquity, at the division of the primordial chaos, they exhorted the Spirit Thearch to descend and ordain the separation of the pure and the turbid. Thus, though not by ability, they were able; though not by necessity, it was so. Thereafter, they unfolded the Dao, elucidated the numinous scriptures, recorded and transmitted their teachings—also known as the cloud-scriptures. They pacified and stabilized the celestial realms, presiding over the center, governing the Eight Extremities, and engendering the Five Constants. Thus, the Three Powers and Nine Qi bestowed their grace upon the True Origin. The Cavernous Perfected transformed the workings of spirit, water, wood, fire, earth, and metal, shaping forms upon the earth. The Primordial Numinous revolved the qi of wind, fire, summerheat, dampness, dryness, and cold, distributing the mysterious across the heavens. Their transformations flowed through the seasons, and the generation of beings was thereby assured.\n\nThe Greater Yin, Lesser Yin, and Supreme Yin succeed one another; the Lesser Yang, Yang Brightness, and Supreme Yang follow in turn. Ending and beginning anew, they emulate the linked rings. They are the origin of the most divine and the lord of wondrous transformation.\n\nLater, the Cavernous Spirit of the Primordial Chaos and Supreme Ultimate Thearch divided their radiance across the ages. The Cavernous Perfected of the Primordial Origin again commanded the Perfected Sovereign of the Mystic Dao to inscribe the cloud-scriptures, designating them as the True Writ. Their words transcend the florid embellishments of the Radiant and the Prodigious; their principles enfold the intent of the Profound and Obscure. Engraved upon crimson crystal jade and adorned with azure auroral characters, they are the celestial teachings of the heavenly order, not the common words of the mundane world. Enshrined within a cinnabar-sealed pouch and placed upon a verdant auroral pedestal, their divine radiance descends and gathers, resembling clouds and mist. Secretly sealed within the Jade Treasury of the Perfected King of the Divine Empyrean Heaven, they were guarded by the Celestial Void Immortals, who marshaled the valiant celestial soldiers to protect the precious scriptures of the cloud-scriptures and True Writ.\n\nAt the kalpa of the Kaihuang era, the August High One of the Great Existence issued a decree from the Heaven of Equal Purity, specially proclaiming my mandate. The Celestial Prime Minister of the Supreme Mystery Capital and the Perfected Lord of the Heavenly Pivot were commanded to open the jeweled pedestal, retrieve the untransmitted scripture, and bestow it upon me. Having received and expressed my gratitude, I withdrew, thereby attaining the boundless capacity for enlightenment—what teachings could surpass this? This is the most wondrous and divine scripture of the Heavenly Venerable of the Great Veil, a treasure none can equal.\n\nWhen the great kalpa turns and the time of the Nine Sixes arrives, it shall be the year of advancing its power. Then, one may ascend the cloud chariot, follow the wind-drawn steeds, and promulgate these cloud-scriptures as an eternal teaching, universally bestowing deliverance upon humanity—is this not fitting? Should the celestial and terrestrial beings recite and comprehend them, they may complete their practice in a single day. By the imperial decree, they shall be summoned to transcend the mortal world. Escaping the苦海 of suffering, they shall ascend the immortal realms of unending light. Riding the azure simurgh’s chariot, they shall enter the Purple Obscurity’s capital, pay homage at the Crimson Gate’s palace, and wander the Mystic Orchard’s gardens. There, they shall commune with the origin of the Dao’s qi and the Perfected, delighting in the wondrous and unfathomable transformations. Is not this sagely achievement most excellent?\"\n\nThereupon, the august commissioner of the imperial destiny and the scribe of the immortals transmitted the Crimson Jade Book of the Supreme Void. Its radiant brilliance gathered and coalesced into resplendent hues, which they bestowed upon the Perfected of the Purple Void.",
      "overlap_context": "rtal. The palace halls congealed to return to their origin; the pools and ponds flowed to revert to their source. Clouds swirled in numinous brilliance; winds moved in radiant splendor. Pointing afar to Kunlun, the immortals journeyed and arrived.\n\n*The Heavenly Venerable of the Upper Realm expounds the Scripture of the True Origin’s Communion with Immortality*\n*True Origin’s Communion with Immortality, Lower Scroll*\n\nNow, the Nine Pures stretch into the distant, enfolding the heavens of Kunlun.",
      "start_char": 3299,
      "end_char": 4543,
      "start_sentence": 174,
      "end_sentence": 243,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.41402316093445,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\上方天尊说真元通仙道经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "真人受之，神伏雅祝，彰闻天尊：上德巍巍，欲广云篆之奥，故示天人之众。 救时之昧弊，肖道之化均。 则天慈教育，固特行悯赐。 切念臣力，虽诀未备。 盖承天旨，何敢不遵。 今谨奉命，恭为宣扬。 曰：必欲弘兹古篆云章，以明洞真元始玄通之道。 德洽仙经，非若无可。 与我全功，应运度人。 诚如子言，不其伟欤。 洞真元文云篆玄科道源开题之章三天云篆，玄一妙真。 莽莽默默，杳杳冥冥。 悦惚绵绵，有无绳绳。 道大茫茫，自然亡名。 溟涬奚极，洎五太成。 寂兮寥兮，神炁肇伸。 静兮动兮，应变重清。 玄君造物，黄母孕魂。 冲和氤氲，甄像丕分。 始青开盟，标题八门。 通生万汇，液濡有情。 皇元奭墿，非文而文。 靡所不在，方方纬经。 炁运徧毓，古今继承。 仙人德洽，行惟混凝。 制泽固岳，点真炁根。 泥丸帝一，丹元阳婴。 绛宫赫奕，太和黄庭。 功行俱足，云升上京。 大罗渺渺，玉清之宫。 教主垂训，粤亡粤存。 九真既启，命元邃明。 有无妙一之章 雌雄元一，炁变生神。 真常太始，玄源化烟。 细入妙有，巨处乾坤。 郁想圣君，保真真灵。 阴晨泰始，阳华炁尊。 光浮梵瑞，隆游汶迎。 空洞攸尚，囊迪宝此。 神凤鼓舞，瑶田素金。 三华丹玄，九阍罗天。 神哉大化，咸度长生。 洞真元道之章 空洞通真，无英白元。 广灵跃出久五帝廓仙。 振贷九渊，妙变通生。 体与凯为，符契神源。 中逸云，青霞紫霭。 辽邈混融，猷晶高。 精炼六秀，修黄秘。 永载形神，上易广大。 ，。 颩，。",
      "translated_text": "The Perfected received it, and with reverent invocation and solemn prayer, proclaimed to the Heavenly Venerable: \"Your lofty virtue, vast and towering, seeks to spread the profound mysteries of the cloud-script, thus revealing them to the assembly of heaven and humanity. To rescue the benighted and corrupt of this age, and to emulate the equalizing transformations of the Dao—such is the Heavenly Compassion’s teaching, a singular act of merciful bestowal. Yet I humbly consider my own capacities, though still unrefined and incomplete. Having received the Heavenly Mandate, how dare I not comply? Now, in solemn obedience, I shall reverently proclaim it:\n\nIf one truly wishes to magnify these ancient cloud-scriptures and celestial writings, to illuminate the Dao of the Cavern-Real, the Primordial Origin, and the Mystic Communion—then let virtue suffuse the immortal canons, for nothing is beyond attainment. With my full merit, I shall respond to the karmic tide and deliver humankind. Truly, as you have said, is this not magnificent?\n\nThe *Cavern-Real Primordial Writ of the Cloud-Scriptures: Opening the Source of the Dao* states:\n\nThe cloud-scriptures of the Three Heavens, the wondrous and true One,\nVast and silent, dim and obscure,\nElusive and boundless, of being and non-being intertwined.\nThe Dao is great and boundless, naturally nameless.\nThe primordial chaos knows no limit, whence the Five Ultimates arose.\nStill and desolate, the divine qi first stirred;\nQuiescent and active, it responds and purifies anew.\nThe Mystic Lord fashions all things, the Yellow Mother conceives souls.\nIn the harmony of primordial qi, forms take shape and divide.\nThe First Azure inaugurates the covenant, inscribing the Eight Gates.\nThrough them, the myriad beings are enlivened, and the fluid of life nourishes the sentient.\nThe imperial origin flourishes, not through writing yet written,\nPervading all, in every direction weaving the warp of scripture.\nQi circulates and nurtures all, from ancient times to the present.\nThe immortals’ virtue suffuses, their conduct perfectly harmonized.\nThey refine and solidify the peaks, infusing the root of true qi.\nThe Mud-Pill Emperor’s Unity, the Cinnabar Infant of Yang,\nThe Crimson Palace resplendent, the Yellow Court of Grand Harmony—\nWhen merit and conduct are both complete, they ascend to the Upper Capital.\nThe Great Luo stretches boundlessly, the Jade Clarity’s palace.\nThe Teaching Lord imparts his instructions, whether in absence or presence.\nThe Nine Perfected have awakened, the Mandate’s origin profound and luminous.\n\nThe *Scripture of Wondrous Oneness of Being and Non-Being*:\nThe feminine and masculine as one, qi transforms and engenders spirit.\nThe true and constant Primordial Beginning, the mystic source’s transforming mist.\nSubtly entering wondrous being, vastly abiding in heaven and earth.\nIn solemn contemplation of the Sage Lord, preserving the true and numinous.\nThe Yin Morning’s Grand Inception, the Yang Splendor’s qi exalted.\nLight floats in Brahmanic radiance, grandly journeying to meet the welcoming.\nThe emptiness and cavernous are revered, treasuring this precious attainment.\nThe divine phoenix dances, the jade fields and pure gold.\nThe Three Flowers and Cinnabar Mystery, the Nine Gates arrayed in heaven.\nOh, the divine transformation! All attain eternal life.\n\nThe *Scripture of the Cavern-Real Primordial Dao*:\nThe cavernous communicates with the true, the Non-Exalted and White Origin.\nThe vast spirits leap forth, the Five Emperors’ expansive immortals.\nShaking the Nine Abysses, wondrously transforming and enlivening all.\nBody and triumph unite, in accord with the divine source.\nWithin, the soaring clouds, azure mists and purple haze.\nBoundless and merged, crystalline and towering.\nRefining the Six Radiant Ones, cultivating the Yellow Mystery.\nEternally bearing form and spirit, ascending to the vast and great.\n[Untranslatable characters].\"",
      "overlap_context": "nd wander the Mystic Orchard’s gardens. There, they shall commune with the origin of the Dao’s qi and the Perfected, delighting in the wondrous and unfathomable transformations. Is not this sagely achievement most excellent?\"\n\nThereupon, the august commissioner of the imperial destiny and the scribe of the immortals transmitted the Crimson Jade Book of the Supreme Void. Its radiant brilliance gathered and coalesced into resplendent hues, which they bestowed upon the Perfected of the Purple Void.",
      "start_char": 4543,
      "end_char": 5159,
      "start_sentence": 244,
      "end_sentence": 297,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.386146783828735,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\上方天尊说真元通仙道经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "，奭。 諹遆，邡志乎。 、，。 卤津暠暠，妙玉凝波。 大炁浩浩，获真元道。 於是，紫虚真人仰辞而退。 驱神驄兮，践破云霞之色。 鼓仙乐兮，振开天籁之声。 出青幢黄旛之士，引星弁云衣之吏。 从官之属，皆蹈翠烟。 烟云苒苒，放钥天关。 时诸天真神仙之众，屡受虚皇大慈高论。 称：臣等幸甚，伏遇圣恩。 宣真神变化之妙，明元炁通生之道。 故大众谅伏，巍巍德音。 遂赞扬步虚，同声举唱，若天仙云，飞出洞天。 缥缈自然国，逍遥灵宝尊。 在昔开皇劫，传今云篆文。 明哉贯玄理，或然敷洞真。 大通流妙元，神变适清冥。 兹义将何如，爰由欲度人。 人能归至化，云升侍帝宸。 诸仙辞谢而退，乘云各还天府。 是时，玉龙蹻首兮，吟出带霞之势。 金鸾引吭兮，鸣成舞天之歌。 钧天神仙，威仪肃然。 擢九宫宝剑、飞十绝灵旛。 我上方帝尊，熙怡如也。 乘神龙之玉辖，建和銮之宝盖。 天女娥娥，持芙蕖之玉壶，清香馥郁。 仙姬倩倩，执妙洞之金炉，瑞馤氤氲。 麾大化观妙之幢，鼓真华瑶光之节。 侍晨歌吹，音乐铿锵。 神戍征路，旌旗飘扬。 祥飙飁飁兮，动襟袖而鸣佩玉。 庆云苒苒兮，拥轩毂而绕霓裳。 欲返天阙之中，先进星河之上。 於是，青编纪凤文之箓，丹鼎息龙篆之香。 噫，昆仑云飞兮，雨桂华以悦然。 宫坛凝散兮，钹金声而安在。 天极妙化之像，神渊杳冥之状。 非风非露之乡，如存如亡之奥。 真元归太初之基，冲虚复无名之本。 上方天尊说真元通仙道经竟 太清时公告子明曰：吾闻学因徒进，道在师传。 徒弟虽然从师发蒙，寻其至理，出自天性。 故伯乐不能御驽聆为麒骥，良匠不能伐柠砾为栋梁。 盖其朽木不可雕也，粪土之墙不可村也。 《真元录》称：教祖先师，恬淡无为，专以长生为务。 奈何众生迷责爱之绿，乌得无罪。 上圣运慈悲之化，常善救人。 如人在世，身体违和。 轻则作疾，重则成病。 逮诸灾咎，或介鬼魔。 即当面向西北天门，焚香礼念十位尊号。 初号上方乾元至圣天师，次号中皇太无上真法王，又其次号九阳太皇真元教主，四号无上三洞开化仙君，五号十天清衍圣才慈悯大常妙道化均上帝，六号诸天应号清净赦罪上德至尊，七号上方无极太上灵宝天尊，八号上方无极太上道德天尊，九号上方徧慈救苦天尊，十号上方玉虚明皇天尊。 伏以道藏琅函，仙谥天尊之号。 尘寰福地，人弘太上之经。",
      "translated_text": "The radiant essence coalesces, the grand qi flourishes in splendor.\nThe Way advances in sequence, its intent directed toward the profound.\nThe Eight Trigrams and Nine Palaces align, the Five Agents and Six Harmonies converge.\nThe brine channels gleam bright, wondrous jade congeals upon the waves.\nThe great qi surges vast, attaining the true Primordial Dao.\n\nThereupon, the Purple Void Perfected One bowed in reverence and withdrew.\nDriving his spirit-steed, he trod the hues of cloud and mist.\nStriking the immortal music, he stirred the celestial sounds of heaven’s harmony.\nThe attendants bearing azure banners and yellow pennants emerged,\naccompanied by officers in star-crowned caps and cloud-woven robes.\nAll the retinue of officials trod upon the emerald haze.\nAs the mist and clouds wafted gently, the celestial gates were unlocked.\n\nAt that time, the host of divine immortals and perfected beings of the many heavens\nhad repeatedly received the sublime discourses of the August Void’s great compassion.\nThey declared: “We, your servants, are most fortunate to encounter such sacred grace.\nProclaimed are the wondrous transformations of the true spirits,\nand made clear is the Dao of primordial qi that permeates and quickens all life.”\nThus, the great assembly, deeply reverent, extolled the majestic and virtuous teachings.\nThey then chanted in unison the *Steps of the Void*,\ntheir voices rising as one like celestial immortals amid the clouds,\nsoaring forth from the grotto-heaven.\nIn the ethereal and natural realm, they roamed freely, venerating the Numinous Treasure.\nIn the distant kalpas of primordial creation, these cloud-script texts were transmitted.\nLuminous indeed is the principle that pervades the mysterious,\nand manifest is the unfolding of the Cavern-Real.\nThe great penetration flows through the wondrous origin,\nthe divine transformations adapt to the pure and dark.\nWhat is the meaning of this? It is simply to deliver humankind.\nThose who return to the ultimate transformation\nshall ascend on clouds to attend the imperial throne.\n\nThe perfected immortals then bowed in gratitude and withdrew,\neach riding clouds back to their celestial abodes.\nAt that moment, the jade dragons raised their heads,\ntheir roars resounding with the force of mist-laden radiance.\nThe golden simurghs lifted their voices,\ntheir songs weaving the dance of heaven’s harmony.\nThe divine immortals of the Highest Heaven, their majesty solemn,\nbrandished the Nine-Palace treasure swords and unfurled the Ten Transcendent spirit-pennants.\nOur Supreme Heavenly Venerable One, serene and joyful,\nrode the jade-reined spirit-dragon, bearing the jeweled canopy of harmonious bells.\nThe celestial maidens, graceful and fair,\nheld jade vases of lotus, their pure fragrance rich and pervasive.\nThe immortal maidens, elegant and radiant,\ngrasped golden censers of wondrous grottoes, their auspicious vapors curling and dense.\nThey waved the banners of the Great Transformation’s wondrous observation,\nand struck the jade-light rhythm of the True Flower.\nThe morning attendants sang and played music, its notes resonant and clear.\nThe divine guards marched forth, banners and flags fluttering.\nAuspicious winds whispered, stirring sleeves and setting jade pendants chiming.\nFelicitous clouds drifted gently, encircling the chariot wheels and swirling about rainbow robes.\nPreparing to return to the celestial palace,\nthey first ascended beyond the Starry River.\n\nThereupon, the azure registers inscribed with phoenix script were recorded,\nand the cinnabar crucibles stilled the dragon-script incense.\nAlas! The clouds of Kunlun soared,\nraining down osmanthus blossoms in joyous abandon.\nThe echoes of the altar’s rites dissolved,\nthe clashing of golden cymbals fading into stillness.\nThe image of the celestial pole’s wondrous transformation,\nthe form of the divine abyss’s profound obscurity—\nneither wind nor dew’s domain,\nthe mystery of presence and absence.\nThe true origin returns to the foundation of the Great Beginning,\nthe empty void reverts to the nameless root.\n\nThe Supreme Heavenly Venerable One concluded the *Scripture of the True Origin’s Permeating Immortal Dao*.\n\nAt that time, the Most High addressed Gong Ziming:\n“I have heard that learning progresses through discipleship, and the Dao is transmitted by a master.\nThough disciples may begin their studies under a teacher,\nthe pursuit of ultimate truth arises from innate nature.\nThus, even Bo Le cannot drive a dull nag and make it a unicorn,\nnor can a master craftsman hew rotten wood into a ridgepole.\nFor truly, rotten wood cannot be carved,\nand a wall of dung and earth cannot be plastered.”\n\nThe *Record of the True Origin* states:\n“The ancestral masters of the teaching were serene and without action,\ndevoted solely to the pursuit of longevity.\nAlas, sentient beings are deluded by the snares of desire and attachment—\nhow could they be without fault?\nThe supreme sages, moved by compassion, constantly strive to save humankind.\nWhen people in the world suffer bodily disharmony,\nmild cases become illness, and severe ones turn to disease.\nAmid misfortunes and calamities, or when assailed by demonic influences,\nthey should face the northwest celestial gate, burn incense, and reverently recite the ten sacred titles:\nFirst, the Supreme Heavenly Master of the Qian Origin;\nSecond, the Central August Supreme True Dharma King;\nThird, the Supreme Sovereign of the Nine Yangs and True Origin;\nFourth, the Supreme Transcendent Lord of the Three Caverns’ Transformative Teaching;\nFifth, the Merciful and Compassionate Great Constant Wondrous Dao of the Ten Heavens’ Flourishing Sagely Talent;\nSixth, the Supreme Venerable of Pure Forgiveness and Virtue, Responding to All Heavens’ Titles;\nSeventh, the Supreme Numinous Treasure Heavenly Venerable One of the Boundless Above;\nEighth, the Supreme Heavenly Venerable One of the Dao and Virtue of the Boundless Above;\nNinth, the Heavenly Venerable One of Universal Compassion and Salvation from Suffering of the Above;\nTenth, the Heavenly Venerable One of the Jade Void and Luminous August of the Above.\n\nProstrating in reverence, we recall the celestial titles of the Heavenly Venerables,\ninscribed within the jade cases of the Daoist canon.\nIn the blessed lands of the mortal realm, people propagate the scriptures of the Most High.”",
      "overlap_context": "ue, the Non-Exalted and White Origin.\nThe vast spirits leap forth, the Five Emperors’ expansive immortals.\nShaking the Nine Abysses, wondrously transforming and enlivening all.\nBody and triumph unite, in accord with the divine source.\nWithin, the soaring clouds, azure mists and purple haze.\nBoundless and merged, crystalline and towering.\nRefining the Six Radiant Ones, cultivating the Yellow Mystery.\nEternally bearing form and spirit, ascending to the vast and great.\n[Untranslatable characters].\"",
      "start_char": 5159,
      "end_char": 6090,
      "start_sentence": 298,
      "end_sentence": 355,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.81883096694946,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\上方天尊说真元通仙道经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "礼念恭信，则见存获庆； 香花供养，则已往生天。 普愿世人，同沾明验。 及请符水，仍得救治。 是故符者，天之信也。 水者，道之一也。 若生道入腹，自然康宁。 但遇甲子、甲寅、甲辰、甲午、甲申、甲戌等日，志心敬礼上方有智神王、均天天大将军、真元药仙上灵童子之众，望赐降临，行神布炁，治病驱邪，殄灭灾咎。 谓诸下文，所祝意愿，皆全此例，不须复称。 当三元八节之辰，青书上方真元云篆。 咒： 元始自然，青阳郁冥，玄化空洞，无量无形。 结炁凝国，芬世为名。 总覆诸天，普植万灵。 云房金罗，嵯峨上清。 十二极品，标题元精。 玉音彻微，玄响朗琼。 吟咏发出，帝真临庭。 曲映垂条，我享上灵。 与天齐位，三景合明。 永保太空，随劫无倾。 急急如太上帝君律令敕。 每於各人六十甲子旬中，式用悉全。 次於乙丑、乙卯、乙巳、乙未、乙酉、乙亥等日，志心敬礼有力神王、天力将军、上玄童子之众。 又其次，於丙子、丙寅、丙辰、丙午、丙申、丙戌等日，志心敬礼有慧神王、大威将军、上元童子之众。 继於丁丑，丁卯、丁巳、丁未、丁酉、丁亥等日，至心敬礼有威神王、天上将军、上虚童子之众。 绍於戊子，戊寅、戊辰、戊午、戊申、戊戌等日，志心敬礼有相神王、天通将军、上空童子之众。 及於己丑、己卯、己巳、己未、己酉、己亥等日，至心敬礼有德神王、天光将军、上仙童子之众。 兼於庚子、庚寅、庚辰、庚午、庚申、庚戌等日，至心敬礼有灵神王、天智将军、上真童子之众。 重於辛丑、辛卯、辛巳、辛未、辛酉、辛亥等日，至心敬礼有畏神王、天灵将军、上智童子之众。 再於壬子，壬、，壬辰，壬午、壬申、壬戌等日，至心敬礼有见神王、天果将军、上相童子之众。 复於癸丑，癸卯、癸巳、韦癸酉、癸亥等日，至心敬礼有通神王、天盖将军、上德童子之众。 以上六甲旬中，敬礼真元神仙之众。 所祝意愿，悉同无异。 救护群品，安乐果。 如人吞之，可以消灾。 非惟消灾散祸，兼善瘳疾愈病。 但专一志心之信，感授九真之方。 有人佩之，可以护身。 非惟护身保神，及能降福除殃。 抑亦金名紫简，绿字玉京者也。 凡人既得康宁，名曰大福田也。 於福田中可修无上真元之道，行满而升仙矣。 谨按《圣纪经》云：若人每月二十九日，礼念上方天尊十号者，将来不堕地狱之中。 又《预修经》言：善者临终之时，薪祖上方自然国内，随愿往生。 其次《天官图序》 云：夫道本虚无，因悦惚而有物＃３ 。 物炁元冲，始乘运化而分形。 精象玄着，列宫阙於清境。 幽质潜凝，开洞府於名山。 元皇先乎象帝，独化卓乎真宰。 湛尔冥寂，感而通焉，皇矣夫。 《玉京经》称：十华诸仙集，紫烟结成官。 明哉圣人，道德乃成。 故宣王无可而无不可，太上无为而无不为。 玄皇乘白鹿升天，黄帝跨火龙出世。 高居金殿，燕处瑶台，皆知长生之道，以此谅不诬矣。 夫修道作德者，凡有其五焉。 一修道於身者，所谓心闲性恢，爱气养神，少私寡欲，益寿延年，诸伪咸尽，其德乃真人之行。 一修道於家者，所谓父慈子孝，兄友弟顺，夫信妻贤，上下和睦，其德乃有余之方。 一修道於乡者，所谓尊奉耆艾，抚育童幼，教诲愚鄙，而百姓和集，上下信向，其德乃久长矣。",
      "translated_text": "With reverent devotion and sincere faith, the living shall receive blessings; with incense and floral offerings, the departed shall ascend to heaven. May all people of the world together partake in this luminous efficacy. When petitioning for talismanic water, one shall likewise receive healing. Thus, the talisman is the token of Heaven; water is one aspect of the Dao. If the Dao enters the belly through birth, natural well-being follows.\n\nOn days such as *jiazi*, *jiayin*, *jiachen*, *jiawu*, *jiashen*, and *jiaxu*, with wholehearted devotion, pay homage to the hosts of the Sagely Divine Kings of Wisdom of the Above, the Heavenly Generals of the Balanced Heavens, and the Divine Lads of the True Origin and Medicinal Immortals. May they deign to descend, deploy divine *qi*, treat illnesses, expel malevolence, and eradicate calamities and misfortunes. The prayers and vows expressed in the following passages all follow this precedent and need not be reiterated.\n\nOn the days of the Three Primes and the Eight Festivals, inscribe in azure ink the cloud-seal script of the True Origin of the Above. Recite the incantation:\n\n*\"The Primordial Beginning is spontaneous,\nAzure Yang shrouded in darkness,\nMysterious transformation, empty and vast,\nBoundless and formless.\nCondensing *qi* to stabilize the realm,\nFragrant through the world in name.\nEncompassing all heavens,\nNurturing the myriad spirits.\nCloud chambers and golden nets,\nTowering in the Supreme Clarity.\nTwelve supreme grades,\nInscribed with primordial essence.\nJade tones penetrate the subtle,\nMysterious echoes resound like jade.\nChanting and intoning issue forth,\nThe Imperial Perfected descends to the court.\nCurved reflections hang like branches,\nI offer to the Supreme Spirits.\nAttaining rank equal to Heaven,\nThe Three Luminaries merge in brilliance.\nEternally preserving the Great Void,\nUnshaken through kalpas.\"*\n\n*Swiftly, swiftly, in accordance with the statutes and decrees of the Supreme Lord Emperor.*\n\nWithin each person’s sixty-day cycle of *jiazi*, all procedures are to be fully observed. Next, on days such as *yichou*, *yimao*, *yisi*, *yiwei*, *yiyou*, and *yihai*, with wholehearted devotion, pay homage to the hosts of the Mighty Divine Kings, the Heavenly Generals of Celestial Might, and the Supreme Mystery Lads. Following this, on days such as *bingzi*, *bingyin*, *bingchen*, *bingwu*, *bingshen*, and *bingxu*, with wholehearted devotion, pay homage to the hosts of the Sagacious Divine Kings, the Heavenly Generals of Great Might, and the Supreme Origin Lads. Continuing, on days such as *dingchou*, *dingmao*, *dingsi*, *dingwei*, *dingyou*, and *dinghai*, with sincere devotion, pay homage to the hosts of the Majestic Divine Kings, the Heavenly Generals of the Above, and the Supreme Void Lads. Proceeding to days such as *wuzi*, *wuyin*, *wuchen*, *wuwu*, *wushen*, and *wuxu*, with wholehearted devotion, pay homage to the hosts of the Auspicious Divine Kings, the Heavenly Generals of Celestial Communication, and the Supreme Emptiness Lads. Further, on days such as *jichou*, *jimao*, *jisi*, *jiwei*, *jiyou*, and *jihai*, with sincere devotion, pay homage to the hosts of the Virtuous Divine Kings, the Heavenly Generals of Celestial Radiance, and the Supreme Immortal Lads. Additionally, on days such as *gengzi*, *gengyin*, *gengchen*, *gengwu*, *gengshen*, and *gengxu*, with sincere devotion, pay homage to the hosts of the Numinous Divine Kings, the Heavenly Generals of Celestial Wisdom, and the Supreme Perfected Lads. Moreover, on days such as *xinchou*, *xinmao*, *xinsi*, *xinwei*, *xinyou*, and *xinhai*, with sincere devotion, pay homage to the hosts of the Revered Divine Kings, the Heavenly Generals of Celestial Numinosity, and the Supreme Wisdom Lads. Again, on days such as *renzi*, *renyin*, *renchen*, *renwu*, *renshen*, and *renxu*, with sincere devotion, pay homage to the hosts of the Manifest Divine Kings, the Heavenly Generals of Celestial Fruition, and the Supreme Auspicious Lads. Finally, on days such as *guichou*, *guimao*, *guisi*, *guiyou*, and *guihai*, with sincere devotion, pay homage to the hosts of the Communicative Divine Kings, the Heavenly Generals of the Celestial Canopy, and the Supreme Virtue Lads.\n\nWithin the above six cycles of *jiazi*, pay homage to the hosts of the True Origin divine immortals. The prayers and vows expressed are all identical. They deliver and protect all beings, ensuring peaceful fruition. If one ingests the talisman, it can dispel misfortune. Not only does it dispel misfortune and disperse calamity, but it also cures illnesses and heals diseases. Only through single-minded, devout faith can one receive the methods of the Nine Perfected. If one wears it, it can protect the body. Not only does it protect the body and preserve the spirit, but it also bestows blessings and eliminates misfortune. Moreover, it is inscribed with golden names on purple slips, written in green characters upon the Jade Capital. Once a person attains well-being, it is called the Great Field of Blessing. Within this Field of Blessing, one may cultivate the Supreme True Origin Dao, and upon fulfilling the practices, ascend as an immortal.\n\nAccording to the *Scripture of the Sagely Chronicle*, if one pays homage and recites the ten titles of the Heavenly Venerable of the Above on the twenty-ninth day of each month, one shall not fall into hell in the future. The *Scripture of Anticipatory Cultivation* states: At the time of death, the virtuous shall be reborn in the natural domain of the Above, ascending according to their wishes. Furthermore, the *Preface to the Chart of Heavenly Officials* states: The Dao is fundamentally empty and nonexistent, yet through the obscure and indistinct, things come into being. The primordial *qi* of things is originally harmonious; it first rides the transformations of movement to differentiate forms. The subtle images of essence become manifest, arranging palaces and towers in the pure realms. The hidden essences silently congeal, opening grotto-heavens in the famous mountains. The Primordial Sovereign precedes the Lord of Images, uniquely transforming and standing alone as the True Master. Profoundly tranquil and still, it responds when stimulated—how majestic!\n\nThe *Scripture of the Jade Capital* declares: The myriad immortals of the Ten Flowers gather, forming palaces with purple mist. How luminous are the sagely ones, for their virtue and power are thus accomplished. Thus, the Proclaimed King is without preference yet without exclusion; the Most High is without action yet without inaction. The Mysterious Sovereign rode a white deer to ascend to heaven; the Yellow Emperor mounted a fiery dragon to depart the world. Dwelling high in golden halls, resting in jade terraces, they all knew the Dao of long life—this is surely not false.\n\nThose who cultivate the Dao and practice virtue encompass five aspects. First, cultivating the Dao within the body entails calming the heart and expanding one’s nature, cherishing *qi* and nurturing the spirit, reducing selfishness and curbing desires, thereby prolonging life and extending years. All falsity is eradicated, and one’s virtue becomes the conduct of a true person. Second, cultivating the Dao within the family entails a father’s kindness, a son’s filial piety, an elder brother’s friendliness, a younger brother’s deference, a husband’s trustworthiness, and a wife’s virtue. With harmony above and below, one’s virtue becomes the method of abundance. Third, cultivating the Dao within the village entails respecting the elderly, nurturing the young, instructing the ignorant and unrefined, so that the hundred surnames live in harmony, with trust and reverence above and below. Such virtue endures long.",
      "overlap_context": ", the Supreme Heavenly Venerable One of the Dao and Virtue of the Boundless Above;\nNinth, the Heavenly Venerable One of Universal Compassion and Salvation from Suffering of the Above;\nTenth, the Heavenly Venerable One of the Jade Void and Luminous August of the Above.\n\nProstrating in reverence, we recall the celestial titles of the Heavenly Venerables,\ninscribed within the jade cases of the Daoist canon.\nIn the blessed lands of the mortal realm, people propagate the scriptures of the Most High.”",
      "start_char": 6090,
      "end_char": 7382,
      "start_sentence": 356,
      "end_sentence": 415,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.94149661064148,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\上方天尊说真元通仙道经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "一修道於国者，所谓君信臣忠，朝不壅塞，礼乐自兴，百官称职，祸乱不生，万宝丰熟，其德乃充实矣。 一修道於天下者，所谓不言而化，不教而治，平易而无为，和一而大通，比屋可封，化被异域，其德乃周普矣。 如进道建德者生，违道反德者死。 故天有四司之星，在虚危之间，人星之侧，以司於人。 司命二星，主人之功过、年寿、赏夺。 司禄二星，主人之禄秩、衣食。 司危二星，主人之侨佚不正。 司非二星，主人之邪惑多私。 明哉，天惟显斯，陆降厥士。 日鉴在兹，岂不尔思明乎哉。 上方天一尊说真元通仙道经 释音 上篇",
      "translated_text": "One cultivates the Dao within the state by ensuring the ruler’s trustworthiness and the ministers’ loyalty, the court free from obstruction, ritual and music naturally flourishing, the hundred officials fulfilling their duties, calamities and disorders never arising, and the myriad treasures abundant and ripe—such virtue becomes full and substantial. One cultivates the Dao throughout the world by transforming without speech, governing without instruction, acting with simplicity and non-action, harmonizing all into great unity, so that every household merits enfeoffment, and transformation extends even to foreign lands—such virtue becomes all-pervading.\n\nThose who advance the Dao and establish virtue live; those who violate the Dao and oppose virtue die. Thus, Heaven possesses the Four Controller stars, located between *Xu* and *Wei*, beside the Human star, to oversee humanity. The two *Siming* stars govern one’s merits and faults, years and lifespan, rewards and deprivations. The two *Silu* stars govern one’s official rank, emoluments, clothing, and sustenance. The two *Siwei* stars govern one’s arrogance, dissipation, and impropriety. The two *Sifei* stars govern one’s perversity, delusion, and selfishness.\n\nHow luminous is Heaven’s manifestation of these! It bestows and withdraws its officers accordingly. The mirror of the sun shines here—how could one not reflect upon and understand this?\n\n*Shangfang Tianyi Zun Shuo Zhenyuan Tongxian Dao Jing Shiyin, Upper Scroll*",
      "overlap_context": "family entails a father’s kindness, a son’s filial piety, an elder brother’s friendliness, a younger brother’s deference, a husband’s trustworthiness, and a wife’s virtue. With harmony above and below, one’s virtue becomes the method of abundance. Third, cultivating the Dao within the village entails respecting the elderly, nurturing the young, instructing the ignorant and unrefined, so that the hundred surnames live in harmony, with trust and reverence above and below. Such virtue endures long.",
      "start_char": 7382,
      "end_char": 7625,
      "start_sentence": 416,
      "end_sentence": 428,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.427533149719238,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\上方天尊说真元通仙道经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "栥。 音节。 摐。 音窗。 翇。 音弗。 比。 音瑟。 戍。 伤遇切。 吹。 尺伪切。 告。 音梏。 有间。 吉苋切。 无间。 同上。 见音现。 馤。 於盖切。 軴。 中戍切。 中篇 羾。 音贡。 浩。 音浩。 涆。 音汗。 累。 力委切。 黅。 音金。 衣。 於既切。 熠羊入切。 下篇 岘。 胡典切。 阇。 音都。 思。 相史切。 汜。 音似。 斁。 音亦。 奭。 音适。 墿。 音液。 櫜。 音高。 。 音戒。 。 音待。 。 音无。 。 音太。 。 音悦。 。 音造。 。 音初。 。 音迪。 。 音中。 。 音汰。 颩。 音器。 。 音乾。 。 音芒。 。 音绳。 。 音九。 。 音有。 。 音赫。 。 音。 。 音气。 。 音杳。 。 音宫。 。 音会。 。 音亡。 。 音旸。 。 音晨。 奭。 音昊。 。 音申。 諹。 音青。 。 音惶。 。 音抱。 邡。 音相。 忐。 音丑。 乎。 音仙。 。 音诰。 。 音阴。 。 音上。 。 音明。 。 音素。 。 音粤。 。 音隆。 。 音洞。 。 音奥。",
      "translated_text": "Phonetic Annotations:\n\n*Upper Scroll*\nZī. Pronounced *jié*.\nChuāng. Pronounced *chuāng*.\nFú. Pronounced *fú*.\nBǐ. Pronounced *sè*.\nShù. Pronounced *shòu* (injure-meet cut).\nChuī. Pronounced *chǐ-wěi* cut.\nGào. Pronounced *gù*.\nYǒu jiàn. Pronounced *jí-xiàn* cut.\nWú jiàn. Same as above.\nJiàn. Pronounced *xiàn*.\nÀi. Pronounced *yù-gài* cut.\nZhù. Pronounced *zhōng-shù* cut.\n\n*Middle Scroll*\nGǒng. Pronounced *gòng*.\nHào. Pronounced *hào*.\nHàn. Pronounced *hàn*.\nLěi. Pronounced *lì-wěi* cut.\nJīn. Pronounced *jīn*.\nYī. Pronounced *yū-jì* cut.\nYì. Pronounced *yáng-rù* cut.\n\n*Lower Scroll*\nXiàn. Pronounced *hú-diǎn* cut.\nDū. Pronounced *dū*.\nSī. Pronounced *xiāng-shǐ* cut.\nSì. Pronounced *sì*.\nDù. Pronounced *yì*.\nShì. Pronounced *shì*.\nYì. Pronounced *yè*.\nGāo. Pronounced *gāo*.\nJiè. Pronounced *jiè*.\nDài. Pronounced *dài*.\nWú. Pronounced *wú*.\nTài. Pronounced *tài*.\nYuè. Pronounced *yuè*.\nZào. Pronounced *zào*.\nChū. Pronounced *chū*.\nDí. Pronounced *dí*.\nZhōng. Pronounced *zhōng*.\nTài. Pronounced *tài*.\nBiāo. Pronounced *qì*.\nQián. Pronounced *qián*.\nMáng. Pronounced *máng*.\nShéng. Pronounced *shéng*.\nJiǔ. Pronounced *jiǔ*.\nYǒu. Pronounced *yǒu*.\nHè. Pronounced *hè*.\nYǐn. Pronounced *yǐn*.\nQì. Pronounced *qì*.\nYǎo. Pronounced *yǎo*.\nGōng. Pronounced *gōng*.\nHuì. Pronounced *huì*.\nWáng. Pronounced *wáng*.\nYáng. Pronounced *yáng*.\nChén. Pronounced *chén*.\nShì. Pronounced *hào*.\nShēn. Pronounced *shēn*.\nYáo. Pronounced *qīng*.\nHuáng. Pronounced *huáng*.\nBào. Pronounced *bào*.\nFāng. Pronounced *xiāng*.\nTǎn. Pronounced *chǒu*.\nHū. Pronounced *xiān*.\nGào. Pronounced *gào*.\nYīn. Pronounced *yīn*.\nShàng. Pronounced *shàng*.\nMíng. Pronounced *míng*.\nSù. Pronounced *sù*.\nYuè. Pronounced *yuè*.\nLóng. Pronounced *lóng*.\nDòng. Pronounced *dòng*.\nÀo. Pronounced *ào*.",
      "overlap_context": "The two *Silu* stars govern one’s official rank, emoluments, clothing, and sustenance. The two *Siwei* stars govern one’s arrogance, dissipation, and impropriety. The two *Sifei* stars govern one’s perversity, delusion, and selfishness.\n\nHow luminous is Heaven’s manifestation of these! It bestows and withdraws its officers accordingly. The mirror of the sun shines here—how could one not reflect upon and understand this?\n\n*Shangfang Tianyi Zun Shuo Zhenyuan Tongxian Dao Jing Shiyin, Upper Scroll*",
      "start_char": 7625,
      "end_char": 7998,
      "start_sentence": 429,
      "end_sentence": 566,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.451922416687012,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\上方天尊说真元通仙道经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "卤。 音鲁。 暠古老切。 。 音考。 蹻。 其虐切。 吭。 下浪切。 。 吐卧切。 。 音皇。 ＃１不可无：疑当作『不可无名』 ＃２『元真』 上疑缺二字。 ＃３『物』字据上下文义补。",
      "translated_text": "Lǔ. Pronounced *lǔ*.\nGǎo. Pronounced *gǔlǎo* (ancient reading).\nKǎo. Pronounced *kǎo*.\nQiāo. Pronounced *qínüè*.\nHáng. Pronounced *xiàlàng*.\nTuò. Pronounced *tǔwò*.\nHuáng. Pronounced *huáng*.\n\n#1 \"Cannot be without\": likely should read \"cannot be without a name.\"\n#2 Above \"original truth,\" two characters are likely missing.\n#3 The character \"thing\" is supplied based on the context above and below.",
      "overlap_context": "Pronounced *huì*.\nWáng. Pronounced *wáng*.\nYáng. Pronounced *yáng*.\nChén. Pronounced *chén*.\nShì. Pronounced *hào*.\nShēn. Pronounced *shēn*.\nYáo. Pronounced *qīng*.\nHuáng. Pronounced *huáng*.\nBào. Pronounced *bào*.\nFāng. Pronounced *xiāng*.\nTǎn. Pronounced *chǒu*.\nHū. Pronounced *xiān*.\nGào. Pronounced *gào*.\nYīn. Pronounced *yīn*.\nShàng. Pronounced *shàng*.\nMíng. Pronounced *míng*.\nSù. Pronounced *sù*.\nYuè. Pronounced *yuè*.\nLóng. Pronounced *lóng*.\nDòng. Pronounced *dòng*.\nÀo. Pronounced *ào*.",
      "start_char": 7998,
      "end_char": 8086,
      "start_sentence": 567,
      "end_sentence": 582,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.4740233421325684,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\本文类\\上方天尊说真元通仙道经.txt",
        "category": "本文类"
      }
    }
  ]
}