{
  "source_id": "上方大洞真元阴阳陟降图书复解",
  "source_file": "chunked_daozang\\上方大洞真元阴阳陟降图书复解.json",
  "total_chunks": 7,
  "total_original_chars": 5422,
  "total_translated_chars": 30842,
  "total_translation_time": 161.04605317115784,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\灵图类\\上方大洞真元阴阳陟降图书复解.txt",
    "category": "灵图类"
  },
  "full_translation": "**Postscript to the *Chart of the Supreme Cavern’s True Primordial Yin-Yang Ascent and Descent***\n\n**Scripture Title:** *Recondite Explication of the Supreme Cavern’s True Primordial Yin-Yang Ascent and Descent Chart*. Author unknown. Two chapters bound in one volume. Base text from the *Daoist Canon of the Zhengtong Era*, *Cavernous Mystery Division*, *Numinous Charts Category*.\n\n---\n\n**Postscript to the *Chart of the Supreme Cavern’s True Primordial Yin-Yang Ascent and Descent***\n\nHow vast! The Qian and Kun are the great sovereign lords of the four seasons; Fu and Shen are the lesser parents of the myriad things. Thus, Qian begins its generation at *zi* and concludes with Kan at *yin*. Kun first brings forth at *wu* and completes with Li at *shen*. This accords with the celestial seasons.\n\nFrom *zi* to *si*, yang hardens and takes action; from *wu* to *hai*, yin lies horizontally and abides. Thus, among all things under heaven, there is not one that does not possess yin and yang. Moreover, the mutual resonance of yin and yang is the natural Dao.\n\nIt is also said: *zi*, *yin*, *chen*, *wu*, *shen*, and *xu* are the yang of Qian; *wei*, *si*, *chou*, *hai*, and *you* are the yin of Kun. Yang propels the Five Fortunes outward—\"outward\" meaning like land. The Five Fortunes are longevity, wealth, health, peace, and good virtue ending in destiny. Thus, yang is auspicious and bestows the Five Fortunes upon the outer and upper realms.\n\nYin conceals the Six Extremities and draws them downward—\"downward\" meaning below. The Six Extremities are misfortune, short life, premature death, illness, sorrow, and poverty—weakness and evil. Thus, yin is inauspicious and relegates the Six Extremities to retreat and decline.\n\nYin and yang are mutually seeking entities. Therefore, the exalted is the position of yang, and the lowly is the position of yin. It is also said: yang is the noble person, and yin is the petty person. Whether drumming or resting, weeping or singing, the dispositions of petty persons are exhausted therein. At times, the foolish below may harm the noble. When the noble person’s destiny has not yet come to fruition and contends with them by force, it leads to obstruction and unresolved entanglement.\n\nSince ancient times, noble persons who could not bear the petty and thus incurred calamity have been many. When the noble person knows there is nothing to be done, they say: \"Only through defilement, humiliation, and abasement does the Dao esteem.\" Thus, they humble their words, conceal their traces, act without contention. In this way, they ultimately evade the blame of petty persons.\n\n*Xunzi* said: \"That which follows its kind is called fortune; that which opposes its kind is called misfortune.\" *Guan Yinzi* said: \"Do not slight petty persons. Petty persons harm the state. Only by harmonizing with petty persons can one align with great persons.\" Great persons are those whose virtue matches heaven and earth.\n\nAll that is received in life and destiny arises from the endowment of yin and yang within. The tortoise hides within the sea, the White Prime revels in joy, water descends and fire resides without—after nine years, great accomplishment is achieved.\n\nTaking the sun and moon as the model for change, that which employs the one without separation is none other than Kan not departing from fire. As with humans: having crossed, life begins; not yet crossed, it ends.\n\nIn the creation of ancient characters, the curved river of yin’s feminine *qi* of the One can grant long life to people. It must rely on the fire of the solar palace and the water of the lunar mansion, uniting with the curved river of yang’s masculine crystal of the One. Thus, the One is born from the Two, and the Three Primes are completed—namely, the Primordial of Qian, the Primordial of Kun, and the Primordial of Humanity.\n\nHumans emulate the Two Modes to align with the Dao. Gao Xiangxian sang:\n\n*\"Have you not seen? Shu Tong served Wei Boyang,*\n*Together they laughed and entered the land of nothingness.*\n*Following the* Lianshan *they composed the* Cantongqi*,*\n*Leaving it as the eternal king of elixirs.\"*\n\nThe *Lianshan* was the original name of the *Book of Changes*. It is also said:\n\n*\"The sun is Li, the moon is Kan;*\n*Sun and moon as Change devour each other.*\n*When the golden crow dies, the jade hare is born;*\n*The myriad things arise from heaven and earth’s resonance.\"*\n\nThe *Book of Changes* says: \"Heaven and earth intermingle, and the myriad things transform in purity.\" Is this not what it refers to? The *Book of Rites* states: \"Only when heaven and earth unite do the myriad things flourish.\" The *Commentary* says: \"Neither yin alone nor yang alone can generate; only the union of the three brings forth life.\" The *Book of Documents* says: \"The Dao ascends and descends; only the perfected person embodies this.\"\n\nThus, the *Supreme Cavern Scripture of Great Purity* declares: \"Above, open the gate of immortality; below, seal the pass of death. The White Emperor of the Western Florescence becomes the spirit that gives me life.\"\n\nMeng the Banished Immortal, enlightened by the Dao of embracing the One, said first: \"Embody yin and yang within the indistinct and vague; discern movement and stillness within the subtle and profound.\" Second: \"Spirit is stored in the Celestial Valley; *qi* flows into the Cinnabar Prime.\" Third: \"When fire is kindled, it burns away all impurities; when water flows, it aids the hundred passes.\" How fitting!\n\nYet some discourse exceeds the bounds of yin and yang’s alternation—are they not to be feared? Little do they know: the myriad things bear yin and embrace yang, harmonizing through the *qi* of the center. This is acceptable.\n\nOnly by advancing in the Dao can one attain distant equality. If one acts in accordance with it, they can receive luminous blessings. Thus, when Jizi attained long life, he was marked as the first of the Five Fortunes, aspiring to the age of the tortoise and ranked among the Three Joys. What in the human realm is more esteemed than this?\n\nThe only concern is that practitioners of cultivation fail to revere their *qi*, honor their form, preserve their life, and cherish their spirit. This is the fault of self-inflicted decay. Alas!\n\n---\n\n**Chart of the Four Images**\n\nHow towering and great! Heaven and earth do not speak, yet the four seasons proceed, and the hundred creatures are born. Do not all things sprout in spring, grow in summer, mature in autumn, and store in winter?\n\nThus, the *Book of Changes* says: \"The myriad things emerge from Zhen\"—Zhen is the east. \"They are arrayed in Xun\"—Xun is the southeast. \"Arrayed\" means the myriad things are pure and orderly. \"Li is brightness\"—all things become visible; it is the trigram of the south. \"Kun is earth\"—all things receive nourishment therein. Thus, it is said: \"They are employed in Kun.\"\n\n**Chart of the Four Images (continued)**\n\nDui is the true autumn, the season in which all things delight—thus it is said: \"Joy is spoken of in Dui.\" They contend in Qian—Qian is the trigram of the northwest, signifying the struggle of yin and yang. Kan is water, the trigram of the true north, the trigram of toil, the place to which all things return—thus it is said: \"Toil is in Kan.\" Gen is the trigram of the northeast, where all things reach their completion and begin anew—thus it is said: \"Completion is spoken of in Gen.\"\n\nTherefore, the ancient sages, drawing upon the proper seasons of things, enriched and nourished the world, so that the multitudes never lacked. They harmonized with the sequence of the four seasons. The east corresponds to spring—*chun* (spring) means *chun* (stirring), for it brings forth the myriad things; this is sageliness. The south corresponds to summer—*xia* (summer) means *jia* (extension), for it nurtures, fosters, and sustains growth; this is benevolence. The west corresponds to autumn—*qiu* (autumn) means *chou* (sorrow), for in autumn, things are examined and guarded in due season; this is righteousness. The north corresponds to winter—*dong* (winter) means *zhong* (center), and *zhong* means *cang* (concealment).\n\nThe *Records* state: \"The Dao takes the four seasons as its handle, and thus affairs may be encouraged.\" The *Music* says: \"Spring creates, summer grows—this is benevolence; autumn gathers, winter stores—this is righteousness.\" Only the true person can align with these seasons through benevolence, righteousness, and the Dao.\n\nThus, the true person, hands clasped behind, sings:\n*\"Vast are the four seasons,\nBoundless is the single qi,\nRadiant are the sages.\"*\n\n**Chart of the Five Phases’ Transitions**\nThe Viscount of Ji said: \"Heaven bestowed upon Yu the *Hong Fan*’s nine categories, the first of which is the Five Phases.\" The saying that \"Heaven One generates water, Earth Two generates fire, Heaven Three generates wood, Earth Four generates metal, Heaven Five generates earth\" refers to the generative numbers of the Five Phases. The subsequent sequence—water as six, fire as seven, wood as eight, metal as nine, earth as ten—constitutes the completion numbers of the Five Phases.\n\nFurther, it is said: From the onset of spring, wood reigns; from the onset of summer, fire reigns; from the onset of autumn, metal reigns; from the onset of winter, water reigns—each for seventy-two days. At the end of each of the four seasons, earth reigns for eighteen days. This is the mutual succession of the Five Phases’ dominion.\n\nAgain, it is said: Water generates wood, wood generates fire, fire generates earth, earth generates metal, metal generates water—this is called the mutual generation of the Five Phases. Conversely, water overcomes fire, fire overcomes metal, metal overcomes wood, wood overcomes earth, earth overcomes water—this is called the mutual overcoming of the Five Phases.\n\nOnly Heaven generates the four seasons and Five Phases, while the sages named them. All things fill the space between heaven and earth, yet the greatest and most numerous among them are the Five Phases. In their application to humanity, none of these five can be lacking for life to persist.\n\nThe *Rites* state: \"The Five Phases form the essence, and thus affairs may be restored.\" Only those who possess the Dao can trace the source of the single qi and master the laws of the Five Phases’ transitions. If one internally loses the rectitude of the Three Origins and externally strays into the depravity of the Nine Orifices, death will surely follow—how true are these words!\n\nThe song says:\n*\"Great are the Five Phases,\nIn their relation to humanity!\nUsed with the Dao, they bring prosperity;\nWithout the Dao, they bring peril.\"*\n\nThis pattern of principles originates from the teachings of the Perfected One of True Yang:\n*\"Rushing forth, the great Dao roams the heavens,\nDrawing the three carts with sixteen oxen.\nThe Four Images and Five Phases gather in a single grasp—\nThen comes the pulling of sinews and the changing of bones.\"*\n\n**Chart of the Eight Trigrams and Six Changes**\nThe trigrams of the *Book of Changes* model the functions of heaven and earth. Qian above is heaven—Qian above represents heaven, in humanity the head, and below, the earth. Kun below is earth—Kun above represents heaven, in humanity the abdomen, and below, Kun.\n\nQian and Kun are the root of heaven and earth, the great parents of yin, yang, and the myriad things. Kan in heaven is the moon, in humanity the ears, and on earth, water. Li in heaven is the sun, in humanity the eyes, and on earth, fire.\n\nThus, the immortals use Qian and Kun as the cauldron and metal, Kan and Li as the medicinal substances. When the qi of heaven and earth, yin and yang, intermingle and harmonize, the myriad things are born and thrive, achieving unimpeded flow. *Tai* (Peace) means \"unobstructed.\" When heaven and earth unite, they descend sweet dew—this is called *Jiji* (Completion).\n\nFire flames upward, and water moistens downward, yet when water is placed above fire, it does not lose its nature. Once the principle of mutual completion is achieved, all endeavors reach perfection—thus, the great work of the world is accomplished. If one acts during the time of *Jiji*, one must proceed with reverent caution.\n\nWhen heaven and earth enclose and communicate in *Tai*, the four seasons contain their spiritual qi and Dao. When Kan and Li unite in *Jiji*, the hundred things attain their fixed forms. The Master of Azure Radiance instructed the Daoist: \"Have you not seen the bricks at the kiln’s head, shattered by rain? They have never endured water and fire. But if water and fire refine them into tiles, they endure among humanity for ten thousand years.\" Unfeeling clay vessels, once perfected by water and fire, become firm and indestructible—how much more should the cultivator of truth attain longevity!\n\nIt is further said: Zhen is the feet, Xun the thighs, Gen the mountain and hands, as well as the nose. The nose is the mountain of the face. The nose opens like the mouth, and mouth and nose communicate qi—thus, mountains and marshes communicate qi. Next, it is said: Dui is the marsh and the mouth.\n\nFormerly, the Yellow Emperor received the oral instructions of the Heavenly True Sovereign at Mount Jing, where he cast a tripod. The tripod’s three legs represented essence, qi, and spirit, sufficient to ascend the clouds. The scriptures say: \"When the primordial qi is transformed and refined, one becomes an immortal.\" The secret of ascending in flight lies in the *Gui Cang*.\n\nThe six changes refer to Qian progressing from the first yang to the top yang, and Kun from the first yin to the top yin. Whether there is change or no change in the middle, the time lies in the correct yang numbers of heaven. Observing the multitude of trigrams, all follow this pattern.\n\nLong ago, when the dragon emerged from the River, the eight trigrams revealed their images; when the lin was wounded in the marsh, the Ten Wings manifested their functions. The Master sang: *\"In the age of Tang and Yu, the lin and phoenix roamed—now is not their time, what do they seek? O lin, O lin, my heart is heavy.\"* Moreover, when the noble one meets their time, they mount their chariot; when they do not, they wander like tumbleweed. The Fisherman’s song says: *\"When the Canglang’s waters run clear, they can wash my cap’s tassels; when they run muddy, they can wash my feet.\"* Thus, those who know when to advance or retreat, to preserve or perish, and never lose their correctness—are they not the sages alone?\n\nYet, in the human realm, one must adapt to gains and losses, fullness and emptiness, moving with the times. *Fa Yan* states: *\"The sage is keen of perception, profound in wisdom, inheriting heaven and measuring the numinous, surpassing all mortals, weaving the patterns of all norms.\"*\n\n**Nine Palaces and Seven Primordials Diagram**\nHow wise were the ancients! The historians’ eulogies say: *\"The River Chart ordained Fu Xi; the Luo Script bestowed Yu.\"* It tells how Fu Xi first drew the dragon-horse bearing the River Chart to manifest the eight trigrams. Yu was granted the dark jade tablet, and the turtle-script emerged from the Luo River, whence he expounded the Nine Categories, detailing the numbers of the nine palaces: the sixth palace is Qian, the first palace Kan, the eighth palace Gen, the third palace Zhen, the fourth palace Xun, the ninth palace Li, the second palace Kun, the seventh palace Dui, and the central palace is five.\n\nNext, the colors of the nine palaces: only black must not be violated. For green-blue governs sores and ulcers, while red and yellow still arise from sorrow and illness. Observing the Way of Great Simplicity, only white is the beneficial direction. Each year and month, its pattern is greatly illuminated, fully recorded in annotated almanacs, shifting through the flying diagrams.\n\nSome say of the Upper, Middle, and Lower Primordials: to clarify the year-white, month-white, and day-white—the Way of the three yangs and three yins. Further, the Three Primordials: the celestial numbers are twenty-five—one, three, five, seven, nine; the terrestrial numbers are thirty—two, four, six, eight, ten. In total, fifty-five, from which the terrestrial ten, the terminal numbers, are excluded, leaving forty-five—namely, the Celestial Primordial, Human Primordial, and Terrestrial Primordial. Thus, the fifteen in crosswise and lengthwise arrangement are wondrous beyond measure.\n\nMoreover, as heaven and earth generate the myriad things, only the Human Primordial corresponds to the reckoning of the nine palaces, situated between the Celestial and Terrestrial Primordials. With this hard-won body, how could one not diligently advance in the Way? Would that not be perverse?\n\nThe Recluse of Mystery and Stillness states: The Dao of refining mercury and subduing cinnabar lies entirely in \"three on the left and seven on the right.\" Two and four serve as the shoulders, six and eight as the knees and feet. Nine is worn upon the head, one is trodden beneath the feet. The five palaces of the abdomen are august, with the central square complete when the auspicious arrival is in the center. The merit covers the eight directions, and the wondrous function is perfected through the Three Primordials.\n\nThus, there are the *Hetu* and *Luoshu*, which the sages took as their model. The character for Dao (道) in ancient script is composed of *yuan* (元) and *shou* (首), signifying the origin of all dharmas and the head of all sages. The character for virtue (德) is composed of *zhi* (直) and *xin* (心), denoting an upright heart and the contemplation of emptiness and forgetfulness.\n\nTo guide the benighted and align with the Great Principle is the Dao of the Former Masters. To attain the inner elixir of returning cinnabar and achieve merit without loss is the virtue of the superior adept. Applied to governing the state, it brings profound peace; applied to cultivating the self, it leads to enduring existence. Such is the ultimate attainment—is it not sublime?\n\nEmperor Ming of Tang regarded the *Tongxuan Daode Zhenjing*, the *Zhouyi*, and the *Nanhua Zhenjing* as the Three Profound Studies—was this not fitting?\n\n**Illustrated Charts of Immortal Cultivation and Realization of the True**\nHow extraordinary! To live between heaven and earth—even if granted a lifespan of a hundred years—is like a swift steed passing a crack. How many fail to nurture their allotted years? Alas!\n\nThe true person, however, is not thus. By perpetually establishing fasts and setting up jiao rites, and by repeatedly bestowing alms to relieve the multitude, they cultivate the Dao to instruct others, illuminating sincerity and revering their teacher. The perfected person, through virtue, attains communion with the divine; the superior adept, through subtlety, ascends to heaven. Without the study of immortal arts and the refinement of form, how could this be achieved?\n\nThose who diligently advance in the Great Cavern Dao will naturally move the eight directions of heaven and earth, causing the vital qi of the correct unity to descend from the sun, moon, and stars, flowing into the palaces of their body. The qi of the four seasons—spring’s warmth, summer’s heat, autumn’s chill, and winter’s cold—responds without speech and arrives unbidden.\n\nThus, by returning the qi of the upper heavens to govern the form of the great earth, auspicious clouds open at the Gate of Life, and propitious mists seal the Portal of Death. Thereupon, the luminous essence of flying mystery descends to stabilize the Mud Pill Palace and Crimson Palace within the human body, regulating the five qi, harmonizing the hundred spirits. After ten revolutions of returning numinosity and myriad qi uniting in transcendence—such is the immortal Dao, which treasures life and universally delivers beings.\n\nFortunate is the one who, having received deliverance in this embodied existence, attains eternal endurance through kalpas, fully partakes in the wondrous Dao, and is rightly called a perfected person. The perfected person who embodies the Dao moves through the world with lofty virtue, comprehends the myriad things with all-encompassing knowledge, and employs the divine without limitation.\n\nThe noble person is likewise. The Dao of the noble person lies in reverence, respect, kindness, and righteousness. It values guarding the feminine, enduring humiliation, and embracing impurity—this is the model of the highest wisdom, yet the common people often reverse it.\n\nThus, one of complete virtue acts when the moment is ripe, not waiting for the day to end. When the time is to stop, they stop; when the time is to act, they act. Their emergence and withdrawal always align with the opportune moment; their actions and concealment never conflict with adaptability. In advancement, they benefit the world; in retreat, they perfect themselves. The enlightened scholars of old were ever engaged in this—who was it, if not Master Zhuang?\n\nWhen the King of Chu marched on a distant campaign, his robes trailed in the mud like a turtle’s tail; when the Prime Minister of Liang flew into a rage, he was met with mockery as stale as a rotten rat. How worthy was Yanzi, content with a single basket of food in his humble alley! How sagely was Confucius, resting his arm as a pillow to drink plain water! Xu You delighted in the Dao by the banks of the Ying, while Bing Bo found fulfillment at Gongshou. These were all talents who transcended the mundane, scholars who embraced the profound.\n\nThus, the superior person aligns with the Dao, and Heaven naturally comes to their aid. The great Dao lies broad and level, not far from the self—cultivate it within, and one’s virtue becomes true. As jade must be carved to become a vessel, so must one study to grasp the Dao. The *Rites* states: \"The great Dao is not confined to any vessel.\" Here, the nine palaces are arranged thus: Li in the south, Kun in the southwest, Dui in the west, and the central palace, five, corresponds to Si. Next, the nine palaces and their associated colors—only black must not be violated. For green-blue governs sores and ulcers, while red and yellow arise from worry and illness. Observing the Dao of the Great Simplicity, only white serves as the beneficial direction. Each year and month, its pattern shines brightly, as recorded in annotated almanacs, shifting through the flying stars.\n\nSome speak of the Upper, Middle, and Lower Yuan, clarifying the whiteness of the year, month, and day—this is the Dao of the three yangs and three yins. Further, the three Yuans correspond to the celestial number twenty-five (one, three, five, seven, nine) and the terrestrial number thirty (two, four, six, eight, ten). Summing these gives fifty-five; subtracting the ten terminal numbers of earth leaves forty-five, which are the Heavenly Yuan, Human Yuan, and Earthly Yuan. Thus, the fifteenfold permutations in all directions are wondrous beyond measure.\n\nMoreover, as Heaven and Earth generate the myriad things, only the Human Yuan aligns with the nine palaces’ reckoning, situated between the Heavenly and Earthly Yuans. With this rare and precious body, how could one not hasten to advance in the Dao? Would that not be foolish indeed?\n\nThe Recluse of Mystery and Obscurity states: The Dao of refining mercury and subduing cinnabar lies entirely in \"three on the left and seven on the right.\" Two and four serve as the shoulders, six and eight as the knees and feet. Nine is worn upon the head, one is trodden beneath the feet. The five palaces of the abdomen are ruled by the radiant central square, thus completing the pattern. Its merit spans the eight directions, its wondrous function perfected through the three Yuans.\n\nThus, the *River Chart* and *Luo Scripture* were emulated by the sages. The character for Dao (道) in ancient script combines *yuan* (元) and *shou* (首), signifying the origin of all dharmas and the foremost of all sages. The character for virtue (德) combines *zhi* (直) and *xin* (心), denoting an upright heart and the contemplation of emptiness and forgetfulness.\n\nTo guide the ignorant and align with the Great Principle is the Dao of the Former Masters. To attain the inner elixir and achieve enduring accomplishment is the virtue of the superior adept. Applied to governing the state, it brings profound peace; applied to cultivating the self, it leads to eternal existence. Such attainment is the ultimate—how could it not be exalted?\n\nEmperor Ming of Tang regarded the *True Scripture of Penetrating Mystery and Virtue*, the *Book of Changes*, and the *True Scripture of Southern Florescence* as the Three Profound Studies—was this not fitting?\n\n**Illustrated Charts of Immortal Cultivation and True Refinement**\nHow extraordinary! For one born between Heaven and Earth, even if granted a lifespan of a hundred years, it passes like a horse galloping past a crack. Those who fail to nurture their allotted years—alas!\n\nThe perfected, however, are not thus. They constantly establish purification rites and perform offerings, frequently bestowing alms and aiding the multitude. Thus, they cultivate the Dao to instruct others, illuminating sincerity and revering their teachers. The perfected attain virtue and commune with the divine; superior adepts grasp the wondrous and ascend to Heaven. How could those who do not study immortality and refine their forms achieve this?\n\nWhenever one sits to advance in the Great Cavern’s Dao, they perceive the eight directions of Heaven and Earth, the descending vital qi of the sun, moon, stars, and Orthodox Unity, flowing into the palaces of their body. The four seasonal qi—spring’s warmth, summer’s heat, autumn’s chill, winter’s cold—respond without speech and arrive unbidden.\n\nThus, the adept harnesses Heaven’s qi to govern Earth’s form, whereupon auspicious clouds open at the Gate of Life and propitious mists seal the Portal of Death. Then, the luminous essence of Flying Mystery descends to stabilize the Crimson Palace of the Mud Pill, harmonizing the five qi and uniting the hundred spirits. After ten revolutions of the numinous and myriad qi coalescing, all attain immortality.\n\nThe immortal Dao treasures life, delivering countless beings. Fortunate is the one whose body receives deliverance, enduring through eternal kalpas, attaining the wondrous Dao, and being named a Perfected. The Perfected embodies the Dao, their lofty influence pervading the world, their knowledge encompassing the myriad things, their spiritual efficacy boundless.\n\nThe noble person is likewise. The Dao of the noble person lies in reverence, respect, kindness, and righteousness. It values guarding the feminine, embracing disgrace, enduring defilement—this is the model of the highest wisdom, yet the common people often oppose it. Thus, those who preserve virtue act upon opportunity without delay, stopping when the time is right, advancing when the time is right. Their conduct and withdrawal always align with timing, their actions and concealment never contravene adaptability. In advancement, they benefit all under Heaven; in retreat, they perfect themselves. The enlightened scholars of old invariably pursued this—who else but Master Zhuang?\n\nWhen the King of Chu led distant expeditions, he dragged the tails of turtles through mud; when the Prime Minister of Liang grew enraged, he was met with mockery for his rotten-mouse pride. How worthy was Yanzi, content with a single basket of food in his humble alley! How sagely was Confucius, resting his arm for a pillow and drinking plain water! Xu You delighted in the Dao by the banks of the Ying, while Bing Bo realized his ambition at Gongshou. These were all talents who transcended the mundane, scholars who revered the profound.\n\nThus, the superior person aligns with the Dao and is aided as if by Heaven itself. The great Dao lies broad and level, not far from the self—cultivate it within, and one’s virtue becomes true. As jade must be carved to become a vessel, so must one study to grasp the Dao. The *Rites* states: \"The great Dao is not confined to any vessel,\" yet it is present everywhere. Moreover, the golden scriptures teach: if one cherishes their form, preserves their spirit, values their qi, and secures their root, the body shall not decay in death, and in the end, one may ascend in flight—can this not be called immortality?\n\nThe charts of the Golden Gates in the celestial court are luminous indeed! The heavenly net ensnares all. For the gravest of sins, how could curses suffice? For the rarest of transgressions, how could punishment be light? Yet the radiance of Heaven and Earth endures—only through conduct and merit. The enlightened scholars of old all accumulated the merit of emptying the heart and refining the true, then amassed deeds to aid the state and save the people. As for those who mastered qi through non-action, they ascended to the ranks of the immortals, for they possessed wisdom vast and principles unmatched by the common crowd. Thus, their forms and spirits attained perfection, harmonizing with the primal origin.\n\nI have heard that on Mount Wei, which does not turn back, Prince Jin played his flute and ascended to the Silver River; by the Liao River, which flows but once, Lord Ding transformed into a crane and soared to the jade skies. Then he left behind his song:\n*\"Ding Lingwei, transformed into a crane, returns after a thousand years—*\n*the city walls remain, but the people are gone.*\n*Why not learn the Dao? Graves lie piled high.\"*\n\nLater, the cypress and juniper of Zhaozhou all became Buddhas, while Master Xu’s chickens and dogs all ascended as immortals. The scholar of Wu, in his lyrics, wrote:\n*\"Behold the youthful face, the preserved hair,*\n*soaring in flight, controlling shadows,*\n*bowing to the decree of Jingyang.\"*\n\nThe recluses said:\n*\"How grand is the empty-hearted Master Pang!*\n*How wondrous is the life-mastering Lord Xu!*\n*Their entire families ascended together into the azure clouds!\"*\n\nAh! The forest wind howls, the mountain stream murmurs. Plum and bamboo rustle, while phoenixes sing beyond the emerald heavens; pines stand dense, while [ ] barks amid the white clouds. Then, the feathered chariots and jade carriages emerge from being and enter non-being. I, your servant, approach the imperial capital, awaiting commands in the jeweled palace—all this is the result of reverently serving the true origin of the Great Cavern.\n\nAs the saying goes:\n*\"Bright, bright is the High Heaven,*\n*illuminating the earth below.*\n*When one’s merit is complete and virtue perfected,*\n*they leave the mortal dust,*\n*ride the auspicious mist,*\n*and pay homage at the gates of the Great Clarity.\"*\n\nHere concludes the *Chart of the Ascent and Descent of the True Origin of the Great Cavern in the Upper Realms, Yin and Yang*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上方大洞真元阴阳险降图书后解 经名：上、方大洞真元阴阳吵降图书复解。 撰人不详。 二篇同卷。 底本出处：《正统道藏》洞玄部灵图类。 上方大洞真元阴阳险降图书后解 大哉。 乾坤者，乃四时之大帝君； 复娠者，为万物之小父母。 故乾始生於子，而坎终於寅。 坤初产於午，而离毕於申。 此者，以应天时也。 盖其子至巳兮，阳即坚用之； 午之亥兮，阴即横舍之。 以知天下之物，无一物不具阴阳者。 且阴阳之相应，为自然之道也。 亦言子寅辰午申戌，乾之阳也； 未巳丑亥酉，坤之阴也。 阳推五福以类外，外犹陆也。 言五福，乃寿、富、康、宁、好，德终命也。 故阳为吉庆，而与五福外上也。 阴幽六极以类降，降者下也。 言六极为凶、短、折、疾、忧、贫，恶弱也。 故阴为凶殃，而与六极退下也。 凡阴阳者，相求之物也。 是以尊为阳位，卑为阴位。 又言阳为君子，阴为小人。 或鼓或罢，或泣或歌，小人之情状尽矣。 时乎下愚，或伤君子。 君子命未得时，与之力争，则致否结而不解矣。 自古君子，不忍於小人，以及祸害者常多。 死君子知其无如之何，则日：惟污辱卑下，道所贵也。 固孙辞晦迹，为而不争。 夫然，而终必免小人之咎尔。 《荀子》言：顺其类者谓之福，逆其类者谓之祸。 《关尹子》曰：勿轻小人，小人贼国，能善小人，然后能契大人。 大人也者，德配天地。 凡性命之受於中，皆阴阳之所以赋斯人也者。 为龟藏海内，白元宴嬉，水降火外，九年大成。 象日月以为易， 以一 一 为用者，其惟坎不离火也。 如人既济生耶，未济终焉。 古之制字，以阴之曲江雌一之气，能令人长生也。 必赖日宫之火，月府之水，姤於阳之曲江雄一之晶。 故一生於二，遂成三元，所为乾元、坤元、人元尔。 人法两仪，方合于道。 高象先歌曰：君不见，叔通从事魏伯阳，相将笑入无何乡，准《连山》作《参同契》，留为万古丹中王。 《连山》者，乃《易》之初名也。 又云：日为离兮月作坎，日月为易相吞啖，金乌死时玉兔生，万物生因天地感。 《易》曰：天地絪缊，万物化醇，其是之谓乎。 《礼》云：天地合而后万物兴焉。 《传》曰：独阴不生，独阳不生，独天不生，三合然后得生也。 《书》言：道有外降，惟真人象兹。 故《上清大洞真经》旨：上开仙户，下塞死关，白帝西华，为我生神。 孟谪仙明抱一之道，一言：体阴阳在恍惚之间，察动静於窕淇之内。 再言：神藏于天谷，气注于丹元。 三言：发火则焚其诸秽，水流则济于百关。 宜矣。 或谈踰焉阴阳代谢之表者，无乃惮诸。 殊不知万物负阴而抱阳，冲气以为和，可也。 惟进道则克延遐等，若人为则能承景祉，是故箕子将眉寿，标乎五福之初启，期以龟龄，列在三乐之内。 人间之所贵，奚其加於此？ 但患修行人，不能尊其气，贵其形，保其命，爱其神。 盖缘自取死坏者也，吁哉。 四象之图 巍巍乎大哉。 天地兮不言，而四时行焉，百物生焉。 百物皆春生夏长，秋成冬藏邪。 故《易》言：万物出乎震，震，东方也。 齐乎巽，巽，东南也。 齐也者，言万物之洁齐也。 离也者，明也，万物皆相见，南方之卦也。 坤也者，地也，万物皆致养焉，故曰致役乎坤。",
      "translated_text": "**Postscript to the *Chart of the Supreme Cavern’s True Primordial Yin-Yang Ascent and Descent***\n\n**Scripture Title:** *Recondite Explication of the Supreme Cavern’s True Primordial Yin-Yang Ascent and Descent Chart*. Author unknown. Two chapters bound in one volume. Base text from the *Daoist Canon of the Zhengtong Era*, *Cavernous Mystery Division*, *Numinous Charts Category*.\n\n---\n\n**Postscript to the *Chart of the Supreme Cavern’s True Primordial Yin-Yang Ascent and Descent***\n\nHow vast! The Qian and Kun are the great sovereign lords of the four seasons; Fu and Shen are the lesser parents of the myriad things. Thus, Qian begins its generation at *zi* and concludes with Kan at *yin*. Kun first brings forth at *wu* and completes with Li at *shen*. This accords with the celestial seasons.\n\nFrom *zi* to *si*, yang hardens and takes action; from *wu* to *hai*, yin lies horizontally and abides. Thus, among all things under heaven, there is not one that does not possess yin and yang. Moreover, the mutual resonance of yin and yang is the natural Dao.\n\nIt is also said: *zi*, *yin*, *chen*, *wu*, *shen*, and *xu* are the yang of Qian; *wei*, *si*, *chou*, *hai*, and *you* are the yin of Kun. Yang propels the Five Fortunes outward—\"outward\" meaning like land. The Five Fortunes are longevity, wealth, health, peace, and good virtue ending in destiny. Thus, yang is auspicious and bestows the Five Fortunes upon the outer and upper realms.\n\nYin conceals the Six Extremities and draws them downward—\"downward\" meaning below. The Six Extremities are misfortune, short life, premature death, illness, sorrow, and poverty—weakness and evil. Thus, yin is inauspicious and relegates the Six Extremities to retreat and decline.\n\nYin and yang are mutually seeking entities. Therefore, the exalted is the position of yang, and the lowly is the position of yin. It is also said: yang is the noble person, and yin is the petty person. Whether drumming or resting, weeping or singing, the dispositions of petty persons are exhausted therein. At times, the foolish below may harm the noble. When the noble person’s destiny has not yet come to fruition and contends with them by force, it leads to obstruction and unresolved entanglement.\n\nSince ancient times, noble persons who could not bear the petty and thus incurred calamity have been many. When the noble person knows there is nothing to be done, they say: \"Only through defilement, humiliation, and abasement does the Dao esteem.\" Thus, they humble their words, conceal their traces, act without contention. In this way, they ultimately evade the blame of petty persons.\n\n*Xunzi* said: \"That which follows its kind is called fortune; that which opposes its kind is called misfortune.\" *Guan Yinzi* said: \"Do not slight petty persons. Petty persons harm the state. Only by harmonizing with petty persons can one align with great persons.\" Great persons are those whose virtue matches heaven and earth.\n\nAll that is received in life and destiny arises from the endowment of yin and yang within. The tortoise hides within the sea, the White Prime revels in joy, water descends and fire resides without—after nine years, great accomplishment is achieved.\n\nTaking the sun and moon as the model for change, that which employs the one without separation is none other than Kan not departing from fire. As with humans: having crossed, life begins; not yet crossed, it ends.\n\nIn the creation of ancient characters, the curved river of yin’s feminine *qi* of the One can grant long life to people. It must rely on the fire of the solar palace and the water of the lunar mansion, uniting with the curved river of yang’s masculine crystal of the One. Thus, the One is born from the Two, and the Three Primes are completed—namely, the Primordial of Qian, the Primordial of Kun, and the Primordial of Humanity.\n\nHumans emulate the Two Modes to align with the Dao. Gao Xiangxian sang:\n\n*\"Have you not seen? Shu Tong served Wei Boyang,*\n*Together they laughed and entered the land of nothingness.*\n*Following the* Lianshan *they composed the* Cantongqi*,*\n*Leaving it as the eternal king of elixirs.\"*\n\nThe *Lianshan* was the original name of the *Book of Changes*. It is also said:\n\n*\"The sun is Li, the moon is Kan;*\n*Sun and moon as Change devour each other.*\n*When the golden crow dies, the jade hare is born;*\n*The myriad things arise from heaven and earth’s resonance.\"*\n\nThe *Book of Changes* says: \"Heaven and earth intermingle, and the myriad things transform in purity.\" Is this not what it refers to? The *Book of Rites* states: \"Only when heaven and earth unite do the myriad things flourish.\" The *Commentary* says: \"Neither yin alone nor yang alone can generate; only the union of the three brings forth life.\" The *Book of Documents* says: \"The Dao ascends and descends; only the perfected person embodies this.\"\n\nThus, the *Supreme Cavern Scripture of Great Purity* declares: \"Above, open the gate of immortality; below, seal the pass of death. The White Emperor of the Western Florescence becomes the spirit that gives me life.\"\n\nMeng the Banished Immortal, enlightened by the Dao of embracing the One, said first: \"Embody yin and yang within the indistinct and vague; discern movement and stillness within the subtle and profound.\" Second: \"Spirit is stored in the Celestial Valley; *qi* flows into the Cinnabar Prime.\" Third: \"When fire is kindled, it burns away all impurities; when water flows, it aids the hundred passes.\" How fitting!\n\nYet some discourse exceeds the bounds of yin and yang’s alternation—are they not to be feared? Little do they know: the myriad things bear yin and embrace yang, harmonizing through the *qi* of the center. This is acceptable.\n\nOnly by advancing in the Dao can one attain distant equality. If one acts in accordance with it, they can receive luminous blessings. Thus, when Jizi attained long life, he was marked as the first of the Five Fortunes, aspiring to the age of the tortoise and ranked among the Three Joys. What in the human realm is more esteemed than this?\n\nThe only concern is that practitioners of cultivation fail to revere their *qi*, honor their form, preserve their life, and cherish their spirit. This is the fault of self-inflicted decay. Alas!\n\n---\n\n**Chart of the Four Images**\n\nHow towering and great! Heaven and earth do not speak, yet the four seasons proceed, and the hundred creatures are born. Do not all things sprout in spring, grow in summer, mature in autumn, and store in winter?\n\nThus, the *Book of Changes* says: \"The myriad things emerge from Zhen\"—Zhen is the east. \"They are arrayed in Xun\"—Xun is the southeast. \"Arrayed\" means the myriad things are pure and orderly. \"Li is brightness\"—all things become visible; it is the trigram of the south. \"Kun is earth\"—all things receive nourishment therein. Thus, it is said: \"They are employed in Kun.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1218,
      "start_sentence": 0,
      "end_sentence": 71,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.350985527038574,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\灵图类\\上方大洞真元阴阳陟降图书复解.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "兑，正秋也，万物之所说也，故曰说言乎兑。 战乎乾，乾，西北之卦也，言阴阳之相薄也。 坎者，水也，正北方之卦也，劳卦也，万物之所归也，故曰：劳乎坎。 艮，东北之卦也，万物之所成终，而所成始也，故曰成言乎艮。 是以前圣资物之宜，膏润天下，兆民罔乏矣，而与四时合其序。 言东方者春，春之为言蠢也，产万物者，圣也。 南方者夏，夏之为言假也，养之长之假之，仁也。 西方者秋，秋之为言愁也，秋之以时察守，义者也。 北方者冬，冬之为言中也，中者藏也。 《记》云：道以四时为柄，故事可劝也。 《乐》云：春作夏长，仁也； 秋敛冬藏，义也。 盖由仁义道德者，其惟真人能如期。 是故真人负手而歌曰：四时其巨然，一气其浩然，圣者其昭然。 五行推移之图 箕子有言曰：天乃锡禹，《洪范》九畴，初一曰五行。 所为天一生水，地二生火，天三生木，地四生金，天五生土者，乃五行之生数耶。 其次伪：水数六，火数七，木数八，金数九，土数十者，为五行之成数矣。 又其次言：自立春木王，立夏火王，立秋金王，立冬水王，皆七十有二曰。 於四季月末，各取十有八曰，土王。 此之所为五行之王相已。 又其重言：水生木，木生火，火生土，土生金，金生水者，是名五行之相生然。 复有言：其水克火，火克金，金克木，木克土，土克水者，兹号五行之相克耳。 惟天生四时五行，圣人作之名焉。 言万物盈於天地之间，而其为物最大且多者，有五行矣。 其用於人也，非此五者不能以为生，而阙其一不可。 《礼》云：五行以为质，故事可复也。 惟有道者，推穷一气之源，迁徙五行之法。 若夫内失三元之正，外驰九窍之邪，盖昭然将死矣，亦其允言哉。 歌曰：大哉五行兮，之于其人兮，用之有道则昌兮，无道则殆。 而斯之文理，本正阳真人旨：奔开大道徧天游，牵动三车十六牛，四象五行一撮聚，更会抽筋换骨头。 八卦六变之图 易卦者，准天地之用。 上乾为天，言乾在上为天，在人为首，在下为地。 下坤为地，言坤在上为天，在人为腹，在下为坤。 乾坤者，天地之本，阴阳万物之大父母。 坎在天为月，在人为耳，在地为水。 离在天为日，在人为目，在地为火。 是故上仙以乾坤为鼎金，坎离为药物，则天地阴阳之气相交而和，其万物生成以为通泰。 泰者，通也。 故天地相合以降甘露，名日既济。 则火炎上而水润下，令水在火上，不失其性。 理既兼济，务得偕全，盖天下之能事毕矣。 若人因於既济之时，当畏慎如也。 故天地函而通泰，则四时函其神气道欤。 坎离交而既济，则百物成其形体定也。 青霞子示道人：君不见，窑头坏，随雨破，只是未曾经水火，若将水火烧成軏，留向人间千万年。 言无情瓦饭，因水火既济，犹坚而不毁，况修真之士，宁菲长生乎。 抑又言：其震为足，巽为股，艮为山为手，亦为鼻。 鼻者，面之山也。 鼻开似口，口鼻通气，故山泽通气是已。 次言：兑为泽为口。 昔者黄帝受天真皇人口诀，於荆山铸鼎，鼎分三足，所为精气神，足以登云霄。 经云：混化一气，练而变仙。 惟飞升之道，秘于《归藏》。 其六变者，言乾自初九之上九，坤从初六之上六。 或中有变无变，时在天阳正数，历观众卦，盖亦如之。",
      "translated_text": "**Chart of the Four Images (continued)**\n\nDui is the true autumn, the season in which all things delight—thus it is said: \"Joy is spoken of in Dui.\" They contend in Qian—Qian is the trigram of the northwest, signifying the struggle of yin and yang. Kan is water, the trigram of the true north, the trigram of toil, the place to which all things return—thus it is said: \"Toil is in Kan.\" Gen is the trigram of the northeast, where all things reach their completion and begin anew—thus it is said: \"Completion is spoken of in Gen.\"\n\nTherefore, the ancient sages, drawing upon the proper seasons of things, enriched and nourished the world, so that the multitudes never lacked. They harmonized with the sequence of the four seasons. The east corresponds to spring—*chun* (spring) means *chun* (stirring), for it brings forth the myriad things; this is sageliness. The south corresponds to summer—*xia* (summer) means *jia* (extension), for it nurtures, fosters, and sustains growth; this is benevolence. The west corresponds to autumn—*qiu* (autumn) means *chou* (sorrow), for in autumn, things are examined and guarded in due season; this is righteousness. The north corresponds to winter—*dong* (winter) means *zhong* (center), and *zhong* means *cang* (concealment).\n\nThe *Records* state: \"The Dao takes the four seasons as its handle, and thus affairs may be encouraged.\" The *Music* says: \"Spring creates, summer grows—this is benevolence; autumn gathers, winter stores—this is righteousness.\" Only the true person can align with these seasons through benevolence, righteousness, and the Dao.\n\nThus, the true person, hands clasped behind, sings:\n*\"Vast are the four seasons,\nBoundless is the single qi,\nRadiant are the sages.\"*\n\n**Chart of the Five Phases’ Transitions**\nThe Viscount of Ji said: \"Heaven bestowed upon Yu the *Hong Fan*’s nine categories, the first of which is the Five Phases.\" The saying that \"Heaven One generates water, Earth Two generates fire, Heaven Three generates wood, Earth Four generates metal, Heaven Five generates earth\" refers to the generative numbers of the Five Phases. The subsequent sequence—water as six, fire as seven, wood as eight, metal as nine, earth as ten—constitutes the completion numbers of the Five Phases.\n\nFurther, it is said: From the onset of spring, wood reigns; from the onset of summer, fire reigns; from the onset of autumn, metal reigns; from the onset of winter, water reigns—each for seventy-two days. At the end of each of the four seasons, earth reigns for eighteen days. This is the mutual succession of the Five Phases’ dominion.\n\nAgain, it is said: Water generates wood, wood generates fire, fire generates earth, earth generates metal, metal generates water—this is called the mutual generation of the Five Phases. Conversely, water overcomes fire, fire overcomes metal, metal overcomes wood, wood overcomes earth, earth overcomes water—this is called the mutual overcoming of the Five Phases.\n\nOnly Heaven generates the four seasons and Five Phases, while the sages named them. All things fill the space between heaven and earth, yet the greatest and most numerous among them are the Five Phases. In their application to humanity, none of these five can be lacking for life to persist.\n\nThe *Rites* state: \"The Five Phases form the essence, and thus affairs may be restored.\" Only those who possess the Dao can trace the source of the single qi and master the laws of the Five Phases’ transitions. If one internally loses the rectitude of the Three Origins and externally strays into the depravity of the Nine Orifices, death will surely follow—how true are these words!\n\nThe song says:\n*\"Great are the Five Phases,\nIn their relation to humanity!\nUsed with the Dao, they bring prosperity;\nWithout the Dao, they bring peril.\"*\n\nThis pattern of principles originates from the teachings of the Perfected One of True Yang:\n*\"Rushing forth, the great Dao roams the heavens,\nDrawing the three carts with sixteen oxen.\nThe Four Images and Five Phases gather in a single grasp—\nThen comes the pulling of sinews and the changing of bones.\"*\n\n**Chart of the Eight Trigrams and Six Changes**\nThe trigrams of the *Book of Changes* model the functions of heaven and earth. Qian above is heaven—Qian above represents heaven, in humanity the head, and below, the earth. Kun below is earth—Kun above represents heaven, in humanity the abdomen, and below, Kun.\n\nQian and Kun are the root of heaven and earth, the great parents of yin, yang, and the myriad things. Kan in heaven is the moon, in humanity the ears, and on earth, water. Li in heaven is the sun, in humanity the eyes, and on earth, fire.\n\nThus, the immortals use Qian and Kun as the cauldron and metal, Kan and Li as the medicinal substances. When the qi of heaven and earth, yin and yang, intermingle and harmonize, the myriad things are born and thrive, achieving unimpeded flow. *Tai* (Peace) means \"unobstructed.\" When heaven and earth unite, they descend sweet dew—this is called *Jiji* (Completion).\n\nFire flames upward, and water moistens downward, yet when water is placed above fire, it does not lose its nature. Once the principle of mutual completion is achieved, all endeavors reach perfection—thus, the great work of the world is accomplished. If one acts during the time of *Jiji*, one must proceed with reverent caution.\n\nWhen heaven and earth enclose and communicate in *Tai*, the four seasons contain their spiritual qi and Dao. When Kan and Li unite in *Jiji*, the hundred things attain their fixed forms. The Master of Azure Radiance instructed the Daoist: \"Have you not seen the bricks at the kiln’s head, shattered by rain? They have never endured water and fire. But if water and fire refine them into tiles, they endure among humanity for ten thousand years.\" Unfeeling clay vessels, once perfected by water and fire, become firm and indestructible—how much more should the cultivator of truth attain longevity!\n\nIt is further said: Zhen is the feet, Xun the thighs, Gen the mountain and hands, as well as the nose. The nose is the mountain of the face. The nose opens like the mouth, and mouth and nose communicate qi—thus, mountains and marshes communicate qi. Next, it is said: Dui is the marsh and the mouth.\n\nFormerly, the Yellow Emperor received the oral instructions of the Heavenly True Sovereign at Mount Jing, where he cast a tripod. The tripod’s three legs represented essence, qi, and spirit, sufficient to ascend the clouds. The scriptures say: \"When the primordial qi is transformed and refined, one becomes an immortal.\" The secret of ascending in flight lies in the *Gui Cang*.\n\nThe six changes refer to Qian progressing from the first yang to the top yang, and Kun from the first yin to the top yin. Whether there is change or no change in the middle, the time lies in the correct yang numbers of heaven. Observing the multitude of trigrams, all follow this pattern.",
      "overlap_context": " and the hundred creatures are born. Do not all things sprout in spring, grow in summer, mature in autumn, and store in winter?\n\nThus, the *Book of Changes* says: \"The myriad things emerge from Zhen\"—Zhen is the east. \"They are arrayed in Xun\"—Xun is the southeast. \"Arrayed\" means the myriad things are pure and orderly. \"Li is brightness\"—all things become visible; it is the trigram of the south. \"Kun is earth\"—all things receive nourishment therein. Thus, it is said: \"They are employed in Kun.\"",
      "start_char": 1218,
      "end_char": 2450,
      "start_sentence": 72,
      "end_sentence": 128,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.44714951515198,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\灵图类\\上方大洞真元阴阳陟降图书复解.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "昔龙出於河，则八卦宣其象，麟伤於泽，则十翼彰其用。 夫子歌曰：唐虞世兮麟凤游，今非其时来何求，麟兮麟兮我心忧。 且君子得其时则驾，不得其时则蓬累而行。 渔父歌曰：沧浪之水清兮，可以濯我缨，沧浪之水浊兮，可以濯我足。 故知进退存亡，而不失其正者，其唯圣人乎。 但因於人间损益盈虚，与时偕行。 《法言》曰：盖圣人聪明渊懿，继天测灵，冠乎草伦，经纬诸范。 九宫七元之图 贤哉，先哲史赞有云：河图命庖，洛书锡禹。 言伏义首画龙马，负於河图，以彰八卦。 禹锡玄圭，龟书出於洛水，爰演九畴，详其九官之数。 言六宫乾，一宫坎，八宫艮，三官震，四宫巽，九宫离，二官坤，七宫兑，中官五是巳。 次言九官方色，独＼黑不可犯之。 以碧绿所主于疮疡，赤黄仍生于忧病。 观乎太素之道，唯白为利方。 每岁迨月，其例巨明。 具载注历，推移飞诸。 或曰上元、中元、下元，将明年白、月白、日白，三阳三阴之道。 抑又次言：三元也者，乃天数二十有五，则一三五七九是也。 地数三十，则二四六八十为巳。 总计五十有五，内除地十终数外，凡四十有五，即天元、人元、地元耶。 故纵横十五，妙不可量。 且天地之生万物，惟人元配九宫之纪，在天元地元之问。 以难得之身，而匪坐进其道者？ 不亦迂乎。",
      "translated_text": "Long ago, when the dragon emerged from the River, the eight trigrams revealed their images; when the lin was wounded in the marsh, the Ten Wings manifested their functions. The Master sang: *\"In the age of Tang and Yu, the lin and phoenix roamed—now is not their time, what do they seek? O lin, O lin, my heart is heavy.\"* Moreover, when the noble one meets their time, they mount their chariot; when they do not, they wander like tumbleweed. The Fisherman’s song says: *\"When the Canglang’s waters run clear, they can wash my cap’s tassels; when they run muddy, they can wash my feet.\"* Thus, those who know when to advance or retreat, to preserve or perish, and never lose their correctness—are they not the sages alone?\n\nYet, in the human realm, one must adapt to gains and losses, fullness and emptiness, moving with the times. *Fa Yan* states: *\"The sage is keen of perception, profound in wisdom, inheriting heaven and measuring the numinous, surpassing all mortals, weaving the patterns of all norms.\"*\n\n**Nine Palaces and Seven Primordials Diagram**\nHow wise were the ancients! The historians’ eulogies say: *\"The River Chart ordained Fu Xi; the Luo Script bestowed Yu.\"* It tells how Fu Xi first drew the dragon-horse bearing the River Chart to manifest the eight trigrams. Yu was granted the dark jade tablet, and the turtle-script emerged from the Luo River, whence he expounded the Nine Categories, detailing the numbers of the nine palaces: the sixth palace is Qian, the first palace Kan, the eighth palace Gen, the third palace Zhen, the fourth palace Xun, the ninth palace Li, the second palace Kun, the seventh palace Dui, and the central palace is five.\n\nNext, the colors of the nine palaces: only black must not be violated. For green-blue governs sores and ulcers, while red and yellow still arise from sorrow and illness. Observing the Way of Great Simplicity, only white is the beneficial direction. Each year and month, its pattern is greatly illuminated, fully recorded in annotated almanacs, shifting through the flying diagrams.\n\nSome say of the Upper, Middle, and Lower Primordials: to clarify the year-white, month-white, and day-white—the Way of the three yangs and three yins. Further, the Three Primordials: the celestial numbers are twenty-five—one, three, five, seven, nine; the terrestrial numbers are thirty—two, four, six, eight, ten. In total, fifty-five, from which the terrestrial ten, the terminal numbers, are excluded, leaving forty-five—namely, the Celestial Primordial, Human Primordial, and Terrestrial Primordial. Thus, the fifteen in crosswise and lengthwise arrangement are wondrous beyond measure.\n\nMoreover, as heaven and earth generate the myriad things, only the Human Primordial corresponds to the reckoning of the nine palaces, situated between the Celestial and Terrestrial Primordials. With this hard-won body, how could one not diligently advance in the Way? Would that not be perverse?",
      "overlap_context": "ence, qi, and spirit, sufficient to ascend the clouds. The scriptures say: \"When the primordial qi is transformed and refined, one becomes an immortal.\" The secret of ascending in flight lies in the *Gui Cang*.\n\nThe six changes refer to Qian progressing from the first yang to the top yang, and Kun from the first yin to the top yin. Whether there is change or no change in the middle, the time lies in the correct yang numbers of heaven. Observing the multitude of trigrams, all follow this pattern.",
      "start_char": 2450,
      "end_char": 2953,
      "start_sentence": 129,
      "end_sentence": 153,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.733432054519653,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\灵图类\\上方大洞真元阴阳陟降图书复解.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "希夷处士文言：制汞伏砂之道，全在左三右七，二四为之膊肩，六八当为足膝，戴乎其九，履乎其一，腹皇五宫，嘉来中央而方备； 功盖八弦，妙用三元而可毕。 爰有河图、洛书，圣人则之。 蚓夫圣人履道作德，古文道字，从元从首，乃诸法之元，众圣之首也。 德字从直从心，为正直之心，虚忘之观尔。 凡开导辜生，通符大理者，为先师之道。 内得还丹，功成不丧也者，为上士之德而已。 以之治国，则缓乎平泰。 以之修身，则臻乎长存。 兹致之至，不其题欤。 唐明皇以《通玄道德真经》《周易》《南华真经》，为三玄之学，抑亦其宜哉。 修仙炼真之图 异哉，人生天地之间，借令果有百年之期，若驷之过隙也。 固弗能养其寿命者，吁乎。 惟夫真人则不然，以其常建斋而设醮，及焉屡博施而济众，是故修道以教人，明诚而奉师。 尸真人有德而适神，上士获妙而登天，非乎学仙炼形者，奚能是哉。 但凡坐进大洞之道者，即感天地八弦，日月星辰正一生气下降，流入其人身宫，县四时春温、夏炎、秋冻、冬寒之气，不言而善应，不召而自来。 故还将上天之气，以制大地之形，仍得庆云开于生门，祥烟塞于死户。 於是飞玄之晶，下镇人身泥丸绛宫，中理五气，混合百神，十转回灵，万气齐仙。 仙道贵生，无量度人。 幸矣生身受度，永劫长存，克沾妙道，方号至人。 体道至人，高风运世，知周万物，神用无方。 凡君子亦然。 君子之道，恭敬惠义邪。 贵乎守雌舍辱，受垢纳污，斯上智之范，生民常反之。 故全德之者，见机而作，不俟终日，时止即止，时行即行，出处常合於时机，行藏＇不乖於适变，进则兼济於天下，退则独善於身中。 古之达士，恒从事於斯矣，为谁？ 惟夫蒙庄也。",
      "translated_text": "The Recluse of Mystery and Stillness states: The Dao of refining mercury and subduing cinnabar lies entirely in \"three on the left and seven on the right.\" Two and four serve as the shoulders, six and eight as the knees and feet. Nine is worn upon the head, one is trodden beneath the feet. The five palaces of the abdomen are august, with the central square complete when the auspicious arrival is in the center. The merit covers the eight directions, and the wondrous function is perfected through the Three Primordials.\n\nThus, there are the *Hetu* and *Luoshu*, which the sages took as their model. The character for Dao (道) in ancient script is composed of *yuan* (元) and *shou* (首), signifying the origin of all dharmas and the head of all sages. The character for virtue (德) is composed of *zhi* (直) and *xin* (心), denoting an upright heart and the contemplation of emptiness and forgetfulness.\n\nTo guide the benighted and align with the Great Principle is the Dao of the Former Masters. To attain the inner elixir of returning cinnabar and achieve merit without loss is the virtue of the superior adept. Applied to governing the state, it brings profound peace; applied to cultivating the self, it leads to enduring existence. Such is the ultimate attainment—is it not sublime?\n\nEmperor Ming of Tang regarded the *Tongxuan Daode Zhenjing*, the *Zhouyi*, and the *Nanhua Zhenjing* as the Three Profound Studies—was this not fitting?\n\n**Illustrated Charts of Immortal Cultivation and Realization of the True**\nHow extraordinary! To live between heaven and earth—even if granted a lifespan of a hundred years—is like a swift steed passing a crack. How many fail to nurture their allotted years? Alas!\n\nThe true person, however, is not thus. By perpetually establishing fasts and setting up jiao rites, and by repeatedly bestowing alms to relieve the multitude, they cultivate the Dao to instruct others, illuminating sincerity and revering their teacher. The perfected person, through virtue, attains communion with the divine; the superior adept, through subtlety, ascends to heaven. Without the study of immortal arts and the refinement of form, how could this be achieved?\n\nThose who diligently advance in the Great Cavern Dao will naturally move the eight directions of heaven and earth, causing the vital qi of the correct unity to descend from the sun, moon, and stars, flowing into the palaces of their body. The qi of the four seasons—spring’s warmth, summer’s heat, autumn’s chill, and winter’s cold—responds without speech and arrives unbidden.\n\nThus, by returning the qi of the upper heavens to govern the form of the great earth, auspicious clouds open at the Gate of Life, and propitious mists seal the Portal of Death. Thereupon, the luminous essence of flying mystery descends to stabilize the Mud Pill Palace and Crimson Palace within the human body, regulating the five qi, harmonizing the hundred spirits. After ten revolutions of returning numinosity and myriad qi uniting in transcendence—such is the immortal Dao, which treasures life and universally delivers beings.\n\nFortunate is the one who, having received deliverance in this embodied existence, attains eternal endurance through kalpas, fully partakes in the wondrous Dao, and is rightly called a perfected person. The perfected person who embodies the Dao moves through the world with lofty virtue, comprehends the myriad things with all-encompassing knowledge, and employs the divine without limitation.\n\nThe noble person is likewise. The Dao of the noble person lies in reverence, respect, kindness, and righteousness. It values guarding the feminine, enduring humiliation, and embracing impurity—this is the model of the highest wisdom, yet the common people often reverse it.\n\nThus, one of complete virtue acts when the moment is ripe, not waiting for the day to end. When the time is to stop, they stop; when the time is to act, they act. Their emergence and withdrawal always align with the opportune moment; their actions and concealment never conflict with adaptability. In advancement, they benefit the world; in retreat, they perfect themselves. The enlightened scholars of old were ever engaged in this—who was it, if not Master Zhuang?",
      "overlap_context": "rs, are excluded, leaving forty-five—namely, the Celestial Primordial, Human Primordial, and Terrestrial Primordial. Thus, the fifteen in crosswise and lengthwise arrangement are wondrous beyond measure.\n\nMoreover, as heaven and earth generate the myriad things, only the Human Primordial corresponds to the reckoning of the nine palaces, situated between the Celestial and Terrestrial Primordials. With this hard-won body, how could one not diligently advance in the Way? Would that not be perverse?",
      "start_char": 2953,
      "end_char": 3616,
      "start_sentence": 154,
      "end_sentence": 181,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.932198524475098,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\灵图类\\上方大洞真元阴阳陟降图书复解.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "时楚王远征，辞曳泥龟之尾； 梁相生怒，遂陈腐鼠之讥。 贤哉颜子，箪食而在陋。 圣者孔父，肱枕而饮水。 许由悦道于颖阳，兵伯得志於工首。 斯皆超空之才，尚玄之士也。 是故上士适道，均天来辅。 尸大道坦坦，去身不远，修之於身，其德乃真。 盖玉不琢不成器，人不学不知道。 《礼》云：大道不器，是处九宫离，二官坤，七宫兑，中官五是巳。 次言九官方色，独＼黑不可犯之。 以碧绿所主于疮疡，赤黄仍生于忧病。 观乎太素之道，唯白为利方。 每岁迨月，其例巨明。 具载注历，推移飞诸。 或曰上元、中元、下元，将明年白、月白、日白，三阳三阴之道。 抑又次言：三元也者，乃天数二十有五，则一三五七九是也。 地数三十，则二四六八十为巳。 总计五十有五，内除地十终数外，凡四十有五，即天元、人元、地元耶。 故纵横十五，妙不可量。 且天地之生万物，惟人元配九宫之纪，在天元地元之问。 以难得之身，而匪坐进其道者？ 不亦迂乎。",
      "translated_text": "When the King of Chu marched on a distant campaign, his robes trailed in the mud like a turtle’s tail; when the Prime Minister of Liang flew into a rage, he was met with mockery as stale as a rotten rat. How worthy was Yanzi, content with a single basket of food in his humble alley! How sagely was Confucius, resting his arm as a pillow to drink plain water! Xu You delighted in the Dao by the banks of the Ying, while Bing Bo found fulfillment at Gongshou. These were all talents who transcended the mundane, scholars who embraced the profound.\n\nThus, the superior person aligns with the Dao, and Heaven naturally comes to their aid. The great Dao lies broad and level, not far from the self—cultivate it within, and one’s virtue becomes true. As jade must be carved to become a vessel, so must one study to grasp the Dao. The *Rites* states: \"The great Dao is not confined to any vessel.\" Here, the nine palaces are arranged thus: Li in the south, Kun in the southwest, Dui in the west, and the central palace, five, corresponds to Si. Next, the nine palaces and their associated colors—only black must not be violated. For green-blue governs sores and ulcers, while red and yellow arise from worry and illness. Observing the Dao of the Great Simplicity, only white serves as the beneficial direction. Each year and month, its pattern shines brightly, as recorded in annotated almanacs, shifting through the flying stars.\n\nSome speak of the Upper, Middle, and Lower Yuan, clarifying the whiteness of the year, month, and day—this is the Dao of the three yangs and three yins. Further, the three Yuans correspond to the celestial number twenty-five (one, three, five, seven, nine) and the terrestrial number thirty (two, four, six, eight, ten). Summing these gives fifty-five; subtracting the ten terminal numbers of earth leaves forty-five, which are the Heavenly Yuan, Human Yuan, and Earthly Yuan. Thus, the fifteenfold permutations in all directions are wondrous beyond measure.\n\nMoreover, as Heaven and Earth generate the myriad things, only the Human Yuan aligns with the nine palaces’ reckoning, situated between the Heavenly and Earthly Yuans. With this rare and precious body, how could one not hasten to advance in the Dao? Would that not be foolish indeed?",
      "overlap_context": " common people often reverse it.\n\nThus, one of complete virtue acts when the moment is ripe, not waiting for the day to end. When the time is to stop, they stop; when the time is to act, they act. Their emergence and withdrawal always align with the opportune moment; their actions and concealment never conflict with adaptability. In advancement, they benefit the world; in retreat, they perfect themselves. The enlightened scholars of old were ever engaged in this—who was it, if not Master Zhuang?",
      "start_char": 3616,
      "end_char": 3992,
      "start_sentence": 182,
      "end_sentence": 204,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.336152791976929,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\灵图类\\上方大洞真元阴阳陟降图书复解.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "希夷处士文言：制汞伏砂之道，全在左三右七，二四为之膊肩，六八当为足膝，戴乎其九，履乎其一，腹皇五宫，嘉来中央而方备； 功盖八弦，妙用三元而可毕。 爰有河图、洛书，圣人则之。 蚓夫圣人履道作德，古文道字，从元从首，乃诸法之元，众圣之首也。 德字从直从心，为正直之心，虚忘之观尔。 凡开导辜生，通符大理者，为先师之道。 内得还丹，功成不丧也者，为上士之德而已。 以之治国，则缓乎平泰。 以之修身，则臻乎长存。 兹致之至，不其题欤。 唐明皇以《通玄道德真经》《周易》《南华真经》，为三玄之学，抑亦其宜哉。 修仙炼真之图 异哉，人生天地之间，借令果有百年之期，若驷之过隙也。 固弗能养其寿命者，吁乎。 惟夫真人则不然，以其常建斋而设醮，及焉屡博施而济众，是故修道以教人，明诚而奉师。 尸真人有德而适神，上士获妙而登天，非乎学仙炼形者，奚能是哉。 但凡坐进大洞之道者，即感天地八弦，日月星辰正一生气下降，流入其人身宫，县四时春温、夏炎、秋冻、冬寒之气，不言而善应，不召而自来。 故还将上天之气，以制大地之形，仍得庆云开于生门，祥烟塞于死户。 於是飞玄之晶，下镇人身泥丸绛宫，中理五气，混合百神，十转回灵，万气齐仙。 仙道贵生，无量度人。 幸矣生身受度，永劫长存，克沾妙道，方号至人。 体道至人，高风运世，知周万物，神用无方。 凡君子亦然。 君子之道，恭敬惠义邪。 贵乎守雌舍辱，受垢纳污，斯上智之范，生民常反之。 故全德之者，见机而作，不俟终日，时止即止，时行即行，出处常合於时机，行藏＇不乖於适变，进则兼济於天下，退则独善於身中。 古之达士，恒从事於斯矣，为谁？ 惟夫蒙庄也。",
      "translated_text": "The Recluse of Mystery and Obscurity states: The Dao of refining mercury and subduing cinnabar lies entirely in \"three on the left and seven on the right.\" Two and four serve as the shoulders, six and eight as the knees and feet. Nine is worn upon the head, one is trodden beneath the feet. The five palaces of the abdomen are ruled by the radiant central square, thus completing the pattern. Its merit spans the eight directions, its wondrous function perfected through the three Yuans.\n\nThus, the *River Chart* and *Luo Scripture* were emulated by the sages. The character for Dao (道) in ancient script combines *yuan* (元) and *shou* (首), signifying the origin of all dharmas and the foremost of all sages. The character for virtue (德) combines *zhi* (直) and *xin* (心), denoting an upright heart and the contemplation of emptiness and forgetfulness.\n\nTo guide the ignorant and align with the Great Principle is the Dao of the Former Masters. To attain the inner elixir and achieve enduring accomplishment is the virtue of the superior adept. Applied to governing the state, it brings profound peace; applied to cultivating the self, it leads to eternal existence. Such attainment is the ultimate—how could it not be exalted?\n\nEmperor Ming of Tang regarded the *True Scripture of Penetrating Mystery and Virtue*, the *Book of Changes*, and the *True Scripture of Southern Florescence* as the Three Profound Studies—was this not fitting?\n\n**Illustrated Charts of Immortal Cultivation and True Refinement**\nHow extraordinary! For one born between Heaven and Earth, even if granted a lifespan of a hundred years, it passes like a horse galloping past a crack. Those who fail to nurture their allotted years—alas!\n\nThe perfected, however, are not thus. They constantly establish purification rites and perform offerings, frequently bestowing alms and aiding the multitude. Thus, they cultivate the Dao to instruct others, illuminating sincerity and revering their teachers. The perfected attain virtue and commune with the divine; superior adepts grasp the wondrous and ascend to Heaven. How could those who do not study immortality and refine their forms achieve this?\n\nWhenever one sits to advance in the Great Cavern’s Dao, they perceive the eight directions of Heaven and Earth, the descending vital qi of the sun, moon, stars, and Orthodox Unity, flowing into the palaces of their body. The four seasonal qi—spring’s warmth, summer’s heat, autumn’s chill, winter’s cold—respond without speech and arrive unbidden.\n\nThus, the adept harnesses Heaven’s qi to govern Earth’s form, whereupon auspicious clouds open at the Gate of Life and propitious mists seal the Portal of Death. Then, the luminous essence of Flying Mystery descends to stabilize the Crimson Palace of the Mud Pill, harmonizing the five qi and uniting the hundred spirits. After ten revolutions of the numinous and myriad qi coalescing, all attain immortality.\n\nThe immortal Dao treasures life, delivering countless beings. Fortunate is the one whose body receives deliverance, enduring through eternal kalpas, attaining the wondrous Dao, and being named a Perfected. The Perfected embodies the Dao, their lofty influence pervading the world, their knowledge encompassing the myriad things, their spiritual efficacy boundless.\n\nThe noble person is likewise. The Dao of the noble person lies in reverence, respect, kindness, and righteousness. It values guarding the feminine, embracing disgrace, enduring defilement—this is the model of the highest wisdom, yet the common people often oppose it. Thus, those who preserve virtue act upon opportunity without delay, stopping when the time is right, advancing when the time is right. Their conduct and withdrawal always align with timing, their actions and concealment never contravene adaptability. In advancement, they benefit all under Heaven; in retreat, they perfect themselves. The enlightened scholars of old invariably pursued this—who else but Master Zhuang?",
      "overlap_context": "fty-five; subtracting the ten terminal numbers of earth leaves forty-five, which are the Heavenly Yuan, Human Yuan, and Earthly Yuan. Thus, the fifteenfold permutations in all directions are wondrous beyond measure.\n\nMoreover, as Heaven and Earth generate the myriad things, only the Human Yuan aligns with the nine palaces’ reckoning, situated between the Heavenly and Earthly Yuans. With this rare and precious body, how could one not hasten to advance in the Dao? Would that not be foolish indeed?",
      "start_char": 3992,
      "end_char": 4655,
      "start_sentence": 205,
      "end_sentence": 232,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.602794408798218,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\灵图类\\上方大洞真元阴阳陟降图书复解.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "时楚王远征，辞曳泥龟之尾； 梁相生怒，遂陈腐鼠之讥。 贤哉颜子，箪食而在陋。 圣者孔父，肱枕而饮水。 许由悦道于颖阳，兵伯得志於工首。 斯皆超空之才，尚玄之士也。 是故上士适道，均天来辅。 尸大道坦坦，去身不远，修之於身，其德乃真。 盖玉不琢不成器，人不学不知道。 《礼》云：大道不器，是处皆在。 且金书垂训，人能爱其形，保其神，贵其气，固其根，身不死坏，终俟飞斯可矣，得不谓之仙尔。 臣朝金阙之图 明哉，天网罗人。 罪之大者，诅可这乎，孽之鲜者，县能易尔蚓乾、坤辅斓，惟行与功。 古之明道高士也者，皆累虚心炼真之功，次积助国救民之行。 至於专气无为，爰及其上仙，必也理哲巨方，独异於众人。 故得形神俱妙，参礼真元。 尝闻维山不回，子晋吹笙而上于银汉； 辽水一去，丁公化鹤以冲于琅霄。 而后示其歌曰：丁令威，化鹤千年今来归，城郭如故人民非，何不学仙冢累累。 逮乎赵州桧柏皆成佛，许君鸡犬悉登仙。 吴学士长短句称：看童颜葆发，全飞控影，拜旌阳诏。 逸人言：伟矣虚心庞处士，妙哉了命许真君，全家偕以陟青云。 题欤，林飙飒飒兮，溪溜泠泠兮。 梅竹兮，凤鸣碧落之表； 松相森森兮； □吠白云之际。 於是銮车羽驾，出有入无，臣朝帝京、听命琼阙尔，盖夤奉大洞真元之所致已。 时云：明明上天，照临下土。 人斯功满德就，离凡尘，乘瑞霭，拜谒太清之门。 上方大洞真元阴阳陟降图书复解竟",
      "translated_text": "When the King of Chu led distant expeditions, he dragged the tails of turtles through mud; when the Prime Minister of Liang grew enraged, he was met with mockery for his rotten-mouse pride. How worthy was Yanzi, content with a single basket of food in his humble alley! How sagely was Confucius, resting his arm for a pillow and drinking plain water! Xu You delighted in the Dao by the banks of the Ying, while Bing Bo realized his ambition at Gongshou. These were all talents who transcended the mundane, scholars who revered the profound.\n\nThus, the superior person aligns with the Dao and is aided as if by Heaven itself. The great Dao lies broad and level, not far from the self—cultivate it within, and one’s virtue becomes true. As jade must be carved to become a vessel, so must one study to grasp the Dao. The *Rites* states: \"The great Dao is not confined to any vessel,\" yet it is present everywhere. Moreover, the golden scriptures teach: if one cherishes their form, preserves their spirit, values their qi, and secures their root, the body shall not decay in death, and in the end, one may ascend in flight—can this not be called immortality?\n\nThe charts of the Golden Gates in the celestial court are luminous indeed! The heavenly net ensnares all. For the gravest of sins, how could curses suffice? For the rarest of transgressions, how could punishment be light? Yet the radiance of Heaven and Earth endures—only through conduct and merit. The enlightened scholars of old all accumulated the merit of emptying the heart and refining the true, then amassed deeds to aid the state and save the people. As for those who mastered qi through non-action, they ascended to the ranks of the immortals, for they possessed wisdom vast and principles unmatched by the common crowd. Thus, their forms and spirits attained perfection, harmonizing with the primal origin.\n\nI have heard that on Mount Wei, which does not turn back, Prince Jin played his flute and ascended to the Silver River; by the Liao River, which flows but once, Lord Ding transformed into a crane and soared to the jade skies. Then he left behind his song:\n*\"Ding Lingwei, transformed into a crane, returns after a thousand years—*\n*the city walls remain, but the people are gone.*\n*Why not learn the Dao? Graves lie piled high.\"*\n\nLater, the cypress and juniper of Zhaozhou all became Buddhas, while Master Xu’s chickens and dogs all ascended as immortals. The scholar of Wu, in his lyrics, wrote:\n*\"Behold the youthful face, the preserved hair,*\n*soaring in flight, controlling shadows,*\n*bowing to the decree of Jingyang.\"*\n\nThe recluses said:\n*\"How grand is the empty-hearted Master Pang!*\n*How wondrous is the life-mastering Lord Xu!*\n*Their entire families ascended together into the azure clouds!\"*\n\nAh! The forest wind howls, the mountain stream murmurs. Plum and bamboo rustle, while phoenixes sing beyond the emerald heavens; pines stand dense, while [ ] barks amid the white clouds. Then, the feathered chariots and jade carriages emerge from being and enter non-being. I, your servant, approach the imperial capital, awaiting commands in the jeweled palace—all this is the result of reverently serving the true origin of the Great Cavern.\n\nAs the saying goes:\n*\"Bright, bright is the High Heaven,*\n*illuminating the earth below.*\n*When one’s merit is complete and virtue perfected,*\n*they leave the mortal dust,*\n*ride the auspicious mist,*\n*and pay homage at the gates of the Great Clarity.\"*\n\nHere concludes the *Chart of the Ascent and Descent of the True Origin of the Great Cavern in the Upper Realms, Yin and Yang*.",
      "overlap_context": "t—this is the model of the highest wisdom, yet the common people often oppose it. Thus, those who preserve virtue act upon opportunity without delay, stopping when the time is right, advancing when the time is right. Their conduct and withdrawal always align with timing, their actions and concealment never contravene adaptability. In advancement, they benefit all under Heaven; in retreat, they perfect themselves. The enlightened scholars of old invariably pursued this—who else but Master Zhuang?",
      "start_char": 4655,
      "end_char": 5220,
      "start_sentence": 233,
      "end_sentence": 263,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.643340349197388,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\灵图类\\上方大洞真元阴阳陟降图书复解.txt",
        "category": "灵图类"
      }
    }
  ]
}