{
  "source_id": "上清洞玄明灯上经",
  "source_file": "chunked_daozang\\上清洞玄明灯上经.json",
  "total_chunks": 2,
  "total_original_chars": 2453,
  "total_translated_chars": 16671,
  "total_translation_time": 92.97017455101013,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\本文类\\上清洞玄明灯上经.txt",
    "category": "本文类"
  },
  "full_translation": "**The Supreme Clarity Cavernous Mystery Luminous Lamp Scripture**\n\n**Scripture Title:** *The Supreme Clarity Cavernous Mystery Luminous Lamp Scripture*. The author is unknown, likely composed during the Northern and Southern Dynasties or the Sui-Tang period. It expounds the methods of lamp-lighting and ritual recitation. One scroll.\n\n**Source of Base Text:** *Daoist Canon of the Zhengtong Era*, Cavernous Mystery Division, *Scriptural Texts* category.\n\n---\n\n**The Supreme Clarity Cavernous Mystery Luminous Lamp Scripture**\n\nThe Great Tenuity communicates the wondrous, radiant and penetrating through the distant and obscure. It continues the mysterious light of the Great Yang and unfolds the precious chapters of the luminous lamp. Originating in spontaneity, it receives the essence of the sun and moon’s brilliance. Gleaming in subtle obscurity, it scatters its radiance to illumine the void. There is no heaven it does not pervade, no darkness it does not illuminate, no realm it does not render mysterious. Unless one is of profound destiny, with seven generations of accumulated merit, this scripture cannot be glimpsed.\n\nThose who encounter it must treasure and exhort one another. To receive this scripture, one must swear golden, azure, and jade oaths, bestowed upon a precipitous cliff. If faith and covenant are lacking, or if one’s conduct is unexceptional, the careless and unworthy must not rashly transmit it. Those who wish to receive it must first declare their purification; only when numinous signs manifest may it be transmitted.\n\nThe Supreme Ultimate Highest Mystery Perfected One ascended the jade terrace of the Nine Empyreans. Bowing his head beneath the window lattice, he inquired of the Purple Palace Elder, seeking enlightenment and wisdom. With elbows and knees he hastened forward, and as the hours passed, the Elder at last spoke, saying: “What you ask is wondrous indeed.” Now, resplendent with the Seven Mysteries, I shall discern good and evil, expound the precious chapters of ritual recitation, and reveal the scripture’s essential purport.\n\nThe statutes of the lofty heavens are stern and severe, ever abiding in serene rosy clouds. To ascend their tiers, one must traverse beneath a canopy of mysterious clouds, guarded by flying dragons and celestial soldiers and feathered cavalry, who never rest day or night. Adorned with lapis lazuli, pearls, and jade, their radiance blazes brilliantly. Unless one is a Perfected of the Highest Realm, one cannot gaze upon these palace walls.\n\nTo delve into the empty and mysterious, to chew upon the flying roots, and to expound the precious chapters—nothing compares to purification and thanksgiving. And of all purifications and thanksgivings, none surpass the Supreme Clarity Cavernous Mystery’s rites of incense-burning, lamp-lighting, and ritual recitation.\n\nThe method of lamp-lighting requires spacing lamps at intervals of one *zhang* and five *chi*. Ten lamps are placed upon poles, and their purport is proclaimed aloud. The essential principle of the multitude of lamps is that a thousand lamps arrayed in order manifest solemnity, their number and sincerity a matter of intent.\n\nThe luminous lamps above symbolize the stars, and next they illumine the Seven Ancestors. Their subtlety is beyond expression. Cultivating this for three years, one may ascend to heaven in broad daylight.\n\nThe method of lamp-veneration begins by facing east, then west, then south, then north. Then, gazing upward to the celestial center, one venerates the center while reciting the true scripture. Those in the purification assembly chant the praises, and afterward, they arrange the incense and flames with reverence. Before the clouds disperse, one must not allow the smoke to cease.\n\nThis method is widely embraced, delivering beings from the suffering of dark nights and absolving the calamities of life and death. Devout disciples and those who look upward in faith—when their households are afflicted by misfortune or they urgently wish to establish purification rites for their own deliverance—should offer fine incense and pure oil, with weights and measures according to their means, and cultivate with diligent practice.\n\nThose who falter should contribute the incense and oil provided by the host to cover the costs of correction and to amend their transgressions.\n\nDisciples who cultivate the Dao daily grow impatient, expecting swift results, yet the response is slow. They then deem the Dao distant and empty, lamenting, “What can be done about fate?” If one cannot transcend the boundaries and scale the peaks, how can the Seven Ancestors descend with blessings?\n\nIf one retreats and fails to gather like-minded companions at home for purification rites and scriptural recitation, instead constantly racing about in frantic pursuit, amusing oneself with wine and song, one betrays the mysterious teachings above and falls into the abyss of ancestral transgressions. Slaughtering the three sacrificial animals to fulfill filial piety—alas, how grievous! It pains my heart.\n\nWhen fortune wanes and misfortune waxes, one blames the gods and the directions, praying to the void. This is like digging a well when already parched—what can be done? The suffering of the dead and the torment of pain extend to later generations. Even the hunger and illness of descendants stem from the failure of the present life to perform good deeds, surrendering to capricious thoughts and indulging in malice. Such are the consequences.\n\nFoolish and obstinate men hear compassionate admonitions like the cry of the phoenix in the sky or the flight of the wild goose, and they laugh like dogs. How lamentable! They do not believe in what is taught.\n\nIf you wish to prolong your years and abide forever, to dispel calamities and cure illness, to cultivate great virtue and seek the utmost truth, to release the Seven Mysteries, you should know the Supreme Clarity’s great precepts on the retribution of good and evil deeds. Combine this with ritual recitation, and then calamities may be averted, and the luminous Han may be ascended.\n\nThe method of lamp-veneration is simply to recite the incantations and prayers. There is no prohibition against rigorous and resolute practice.\n\nThe Supreme Ultimate Perfected One said: When venerating the Lamp King or performing the lamp procession, recite the following hymn:\n\n---\n\n**Hymn:**\n\nO vast is the Seven Treasures Palace,\nSpontaneously born of the lotus!\nResplendent, it opens the night’s radiance,\nSwiftly ascending the Great Rosy Clouds.\nGazing upward at the mysterious true gates,\nCloud towers rise in towering majesty.\nFlowing brilliance illumines the mysterious void,\nUrging the troops to conquer the myriad demons.\nDelivering from suffering and the snares of calamity,\nAfter kalpas bound in infancy,\nPurification rites ferry the Seven Ancestors,\nAccumulating blessings to moisten the disciple’s house.\n\nSupremely wondrous, it emits divine radiance,\nFormless, silent, and without shadow.\nBeyond the boundaries, without limit,\nVastly and universally it saves all.\nLifting and delivering from the Seven Mysteries’ suffering,\nIn boundless emptiness, one beholds eternal stillness.\nDelivering from the five obstructions and stagnations,\nResponding to karmic signs, one rides the clouds above.\nThe luminous lamp penetrates the ten directions,\nNo darkness remains unillumined.\n\nResplendent is the mysterious true hall,\nIts brilliance shining through the ten directions.\nVast and open, it dispels the depths of obstruction,\nReleasing the bodies of all in difficulty.\nThe Seven Ancestors and the Three Wretched Realms are freed,\nNo more sorrow or affliction remains.\nGreen canopies reflect the ten directions,\nSoaring and parting the waves of clouds.\nThe divine lamp suffuses the Nine Netherworlds,\nIts candlelight brightening the mountain valleys.\nThe pure body abides in the Six Assemblies’ Palace,\nLifetimes become those of immortals.\nEmpty smoke and all karmic conditions,\nFortune descends to dispel the myriad demons.\nSuffering souls respond and disperse,\nLike ice melting in flowing sands.\n\nAccumulated misfortunes do not cease of themselves—\nHow could they be the fault of a single day?\nThe Seven Ancestors suffer these calamities,\nEver abiding between rivers and seas.\nThe Perfected Ones, moved by this suffering,\nEmpty their hearts before the ninefold gates.\nBowing their heads, they venerate the mysterious lamp,\nInscribing their names in the Eastern Florescence Palace.\n\nUpon concluding the rites to the King, proceed with the recitation of the nineteen Lamp Hymns, as follows:\n\nA thousand Perfected Ones ascend the Jasper Towers,\nResplendent, piercing the cavernous void.\nGazing upward to the Venerable One of Non-Action,\nRosy clouds play amidst the heavens,\nIn purity and stillness, no hindrance remains,\nThe body radiates the light of the Seven Treasures.\n\nI serve as the helmsman of the sea-vessel,\nThus able to release the Three Bonds.\nThe night’s glow illumines the hidden valleys,\nThe suffering body is cleansed and opened,\nEmpty smoke disperses to the eight directions,\nBright illumination enters the Grand Tenuity.\nReciting the supreme teachings,\nFortune and blessings are truly majestic.\n\nDrifting, drifting, weaving through the open paths,\nSilent, silent, filling the eight mounds.\nFrom the Three Qin, cloud-shadows arise,\nIn emptiness, the Two Great Origins pair.\nGazing through the ten directions,\nFreely dispersing the suffering form.\n\nThe flying wheel suffuses the vast sky,\nWithout form, without trace.\nSoaring over Luoyang with the wheel’s flight,\nWhistling beyond the boundaries,\nClad in coarse robes, chanting the night’s glow,\nAll heavens surpass the great.\n\nFortune and misfortune arise not from others,\nTheir measure lies within your own self.\nIf merit is not accumulated early,\nDay and night, cultivate the field of blessings.\nReturn your life to the Dao of Non-Action,\nAnd in the end, you shall behold the True Perfected.\n\nResplendent, the radiant light shines,\nBright and clear, with no hidden depths.\nGlorious beyond the darkest nether,\nFortune descends, and blessings accumulate.\nIn orderly ranks, observing the ten directions,\nUniversally aiding all beings.\n\nI adorn my reins of Mystic Perfection,\nHand in hand, lifting the jade tally.\nThe bright lamp strikes the jasper bell,\nThe echoing response is already attained.\nIn a single day, I see the Three Attainments,\nReleasing my accumulated sorrows of lifetimes.\n\nTransferred to the Palace of Seven Treasures,\nThe wheel turns along the winding mountain valleys.\nHalting the carriage in the chamber of the green canopy,\nWho knows how many years have passed?\nSipping the essence of golden liquid,\nAfter ten thousand kalpas, I am but an infant in the register.\nLooking down upon the world of striving and competition,\nI know not what to make of it.\n\nThe mysterious radiance illumines the winding valleys,\nBright and clear, piercing the abyssal springs.\nFlowing brilliance intertwines in lush profusion,\nEncircling and filling Mount Feng.\nThe Seven Ancestors return to womb-life,\nAbiding forever in the Five-Colored Palace.\n\nLush and misty, the empty sky glows,\nVigorous and surging, entering the Grand Purity.\nHeavenly huntsmen and attendants on left and right,\nThe wheel turns toward the southern inclination.\nBeyond the nine years of illusion,\nMomentarily transcending the stone’s awakening spirit.\nThe Seven Ancestors attain womb-immortality,\nReborn in the Southern Palace.\n\nThe flying wheel suffuses the empty cavern,\nGazing down a thousand, ten thousand fathoms.\nWith a single stroke of insight,\nGathered smoke instantly scatters.\nThe body is light, the form is Non-Action,\nThe four directions brighten in response to the scene.\nThe hells and the Three Evil Paths,\nAll escape their bonds and fetters.\n\nWhistling and singing on the Ninefold Mystery Terrace,\nLofty peaks congeal in solemn stillness.\nThe mind and the six senses flow freely,\nNaturally abandoning the dust and defilement.\nRosy clouds illuminate the golden chamber,\nThe empty hall scatters the mysterious radiance.\nAccumulated resonance summons the descent of spirits,\nThough the form is solitary, the Dao is also divided.\nIn an instant, gazing across ten thousand kalpas,\nWho perceives the passing of countless eons?\n\nThe verdant garden flourishes with divine steps,\nCrimson jasper weaves through the flowing jade.\nThe wind stirs the empty sky’s jade,\nThe perching phoenix sings in the void.\nPurple mist coils through the winding halls,\nCinnabar radiance encircles the green carriage.\n\nFlying banners flourish with the mysterious canopy,\nFeathered standards gleam in the Purple Clarity.\nThe limpid scene at the edge of the nine skies,\nRoaming and playing in the Phoenix City.\nLooking back at the striving mortals,\nOne joy is shared with those of the morning’s birth.\n\nReining the soaring radiance,\nThe tranquil scene stretches beyond the wilds.\nWandering in search of the numinous ones,\nUniting forms in celebration at the edge of the sky.\nPushing open the vermilion jade gates,\nBright as the divine surge of peace.\n\nThe golden towers rise in towering splendor,\nTheir pure shadows free of dust and defilement.\nUnfurling the banners on the Mystic Loft Terrace,\nFulfilling my deepest wishes.\nShedding the difficulties of the Three Paths,\nPreserving and refining to secure old age.\n\nWisdom arises from the root of Non-Being,\nBright and clear, transcending the ten directions.\nWeaving emptiness to stand in the Mystic Empyrean,\nAll heavens draw from the flowing fragrance.\nIts wonder is beyond thought and discussion,\nEmpty resonance truly connects.\nBeing is not being, non-being is not without,\nNon-being and non-without encompass all.\n\nWisdom constantly observes the self,\nThe first step in learning the Dao.\nSubtly entering the Mystic Workshop,\nNaturally recording my spirit.\nThe Heavenly Worthy always protects and shelters,\nThe Demon King offers his pledge.\nResplendent, the Vajra body,\nTranscendent, the Supreme Immortal.\n\nWisdom generates the root of precepts,\nThe true Dao takes precepts as its master.\nThe Three Treasures arise from this,\nVenerated and transmitted by the lofty sages.\nSailing this deathless vessel,\nIn an instant, crossing the great expanse.\nAt this moment of expounding the precepts,\nAll immortals come to bow their heads.\n\n**Hymn of the Celestial Emperor of the Grand Tenuity at the Time of Receiving Precepts**\n\nWhenever lighting lamps, one should recite this text—not only when receiving precepts and lighting lamps.\n\nGently knock the teeth, making no sound for others to hear. All teeth are ears.\n\nThe Supreme One scatters to the ten directions,\nFlower lamps convey sincerity.\nAll heavens blaze resplendently,\nAll earths are bright and clear.\nMy body, too, is luminous,\nThe five viscera bloom with splendor.\nThe blazing scene illumines the Great Non-Being,\nDistant thoughts flourish in the Jade Clarity.\n\nCinnabar essence marvels at the Great Non-Being,\nThe mysterious yang resounds in the empty sky.\nEmbracing form, eradicating the roots of suffering,\nSubtle and wondrous, the thought of the True Perfected.\nHanging blossoms do not reveal their treasure,\nCauses and conditions do not manifest light.\nMy body is likewise,\nRiding transformation, entrusting to the flowing scene.\n\nThe night’s glow manifests the yang cinnabar,\nFar and bright, illuminating the numinous chamber.\nAll heavens universally shine,\nAll yin is already extinguished.\nMy spirit, too, is keen and bright,\nEver delighting in wisdom and insight.\nFreely adapting to the Dao’s movement,\nChanging and yielding to heaven’s power.\nRaising the form to tread the empty cavern,\nThe night’s candle blazes with flowing brilliance.\n\nThe Celestial Emperor of the Grand Tenuity says: Lighting lamps without reciting this text allows the Great Demon Mansion of the Six Heavens to cut short human lives. The jade lads and jade maidens of the eight directions’ heavens will not be sent to you. Flying celestial spirits will not descend upon you. The ten directions and three realms will not inscribe your name in the Eastern Florescence or Southern Palace. Your Seven Ancestors and parents will not receive the Dao of transformation and rebirth.\n\n**Incantation for Offering Food to Sentient Beings**\n\nDiligently cultivate the great Daoist methods,\nSincerity moves the Grand Obscurity.\nThe true descends, demonic illusions scatter,\nAll demons vanish in form.\nThe Seven Ancestors cross to the Southern Palace,\nYour own body ascends to the Highest Clarity.\nSince blessings are universally bestowed,\nOffer the Dharma-food to all sentient beings.\n\n**The Supreme Clarity Scripture of the Cavernous Mystery’s Bright Lamp concludes.**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清洞玄明灯上经 经名：上清洞玄明灯上经。 撰人不详，约出於南北朝或隋唐。 言燃灯礼诵法。 一卷。 底本出处：《正统道藏》洞玄部本文类。 上清洞玄明灯上经 夫太微通妙，朗彻遐幽，续太阳之玄光，演明灯之宝章，始於自然，禀日月之华精，皦景微冥，散晖朗空，无天不普，无幽不照，无界不玄，自非玄挺符会，七世积功，斯文不可而窥也。 兆遇之者，宝而勖焉。 夫受此经，赍明金青玉之誓，於绝崖而授之焉。 若阙信盟，又无殊行，悠悠之徒，勿妄宣示。 必欲受之者，皆先告斋，惟许虚灵瑞感，然后传之尔。 太极高玄真人，登九霄琼台，稽首窗轩之下，请问紫宸丈人，开蒙悟慧，肘步膝趋，时移晷刻，然后告之曰：所谘妙焉。 今以焕七玄以决善恶，演礼诵之宝章，相告经旨。 寻峻天科严烈，寔长静霞，举之梯级，常盖以玄云，卫以飞龙，天兵羽骑，昼夜无休。 凡饰以瑠璃珠玉，光瑛焕赫，自非上真，不能眄此宫墙矣。 夫研味虚玄，咀嚼飞根，披讲宝章，莫如斋谢。 斋谢莫若上清洞玄，烧香然灯礼诵也。 然灯法，间相去一丈五尺，以十灯着竿上，口宣其旨焉。 众灯之玄纲，千灯罗列如威仪，多少意诚也。 夫明灯上象星辰，次曜七祖，迹妙难宣，修之三年，白日升天。 礼灯之法，先向东，次向西，次向南，次向北，因仰天心存，而礼之中央，依真文之诵也。 同斋者唱赞，其后案严香火，於前云趣，勿使烟绝。 斯法广被，拔脱幽夜之苦，赦生死之灾。 虔向之子，仰信之夫，家横染考，疾欲建斋，以自拔脱者，当献以名香清油，斤两斗斛随意所奉，精修励行。 堕者当以主人所赍香油，充纠罚之费，以补阙愆。 兆辈修道，日迩望速而应迟，便谓道辽虚诞，命也如何，兆既不能超边绝巅，焉得七祖降福。 退不能於家延同志斋讲，常飞轮骤竞，以酒声自娱，上违玄教，中堕祖弥，宰三牲以笃孝，哀乎痛哉，令我心酸。 至於福消祸淫，便咎神明方位，祈祷冥漠，可谓临渴而凿井，奚所复逮哉。 死婴苦痛，殃流后代，至於子孙馁病，皆坐今世不行功善，委化任念，恣怀肆毒所招矣。 愚桀之夫，闻慈戒若融风之唳天，雉鹅之飞呜，犬而笑，良可哀乎，施之不信也。 兆欲延年长存，消灾救疾，修盛德，要至真，释七玄，宜知上清善贤施恶之报应大戒，兼之礼诵，然后灾祸可排，景汉可升也。 礼灯之法，政都礼咒而己，特欲苦厉拔标，所不禁也。 太极真人曰：若礼灯王及行灯，其颂如左： 太哉七宝宫，自然生莲华，炜烨开夜光，倏欻登太霞， 仰观玄真阙，云楼郁嵯峨，流焕曜玄空，催兵征万魔， 拔苦罗难中，积劫方婴牙，斋讲度七祖，积福润兆家。 太妙出神晖，无形寂无影，边荡无界外，豁然普济往， 举度七玄苦，寥寥睹长静，拔度五难滞，应感乘云上， 明灯彻十方，冥漆无不朗。 赫赫玄真堂，煌煌映十方， 寥豁沈塞开，洞释众难身，七祖三涂解，无复忧恼患， 绿盖映十方，飞举披云波，神灯蔼九冥，烛朗摄山阿， 梵身六会宫，世世为仙家，虚烟咸宿缘，福降消万魔， 苦魂应感散，冰离於流沙。 积祸不知已，岂是一日愆， 七祖受此殃，长在河海间，上真念是苦，虚心九重门， 稽首礼玄灯，度名东华宫。",
      "translated_text": "**The Supreme Clarity Cavernous Mystery Luminous Lamp Scripture**\n\n**Scripture Title:** *The Supreme Clarity Cavernous Mystery Luminous Lamp Scripture*. The author is unknown, likely composed during the Northern and Southern Dynasties or the Sui-Tang period. It expounds the methods of lamp-lighting and ritual recitation. One scroll.\n\n**Source of Base Text:** *Daoist Canon of the Zhengtong Era*, Cavernous Mystery Division, *Scriptural Texts* category.\n\n---\n\n**The Supreme Clarity Cavernous Mystery Luminous Lamp Scripture**\n\nThe Great Tenuity communicates the wondrous, radiant and penetrating through the distant and obscure. It continues the mysterious light of the Great Yang and unfolds the precious chapters of the luminous lamp. Originating in spontaneity, it receives the essence of the sun and moon’s brilliance. Gleaming in subtle obscurity, it scatters its radiance to illumine the void. There is no heaven it does not pervade, no darkness it does not illuminate, no realm it does not render mysterious. Unless one is of profound destiny, with seven generations of accumulated merit, this scripture cannot be glimpsed.\n\nThose who encounter it must treasure and exhort one another. To receive this scripture, one must swear golden, azure, and jade oaths, bestowed upon a precipitous cliff. If faith and covenant are lacking, or if one’s conduct is unexceptional, the careless and unworthy must not rashly transmit it. Those who wish to receive it must first declare their purification; only when numinous signs manifest may it be transmitted.\n\nThe Supreme Ultimate Highest Mystery Perfected One ascended the jade terrace of the Nine Empyreans. Bowing his head beneath the window lattice, he inquired of the Purple Palace Elder, seeking enlightenment and wisdom. With elbows and knees he hastened forward, and as the hours passed, the Elder at last spoke, saying: “What you ask is wondrous indeed.” Now, resplendent with the Seven Mysteries, I shall discern good and evil, expound the precious chapters of ritual recitation, and reveal the scripture’s essential purport.\n\nThe statutes of the lofty heavens are stern and severe, ever abiding in serene rosy clouds. To ascend their tiers, one must traverse beneath a canopy of mysterious clouds, guarded by flying dragons and celestial soldiers and feathered cavalry, who never rest day or night. Adorned with lapis lazuli, pearls, and jade, their radiance blazes brilliantly. Unless one is a Perfected of the Highest Realm, one cannot gaze upon these palace walls.\n\nTo delve into the empty and mysterious, to chew upon the flying roots, and to expound the precious chapters—nothing compares to purification and thanksgiving. And of all purifications and thanksgivings, none surpass the Supreme Clarity Cavernous Mystery’s rites of incense-burning, lamp-lighting, and ritual recitation.\n\nThe method of lamp-lighting requires spacing lamps at intervals of one *zhang* and five *chi*. Ten lamps are placed upon poles, and their purport is proclaimed aloud. The essential principle of the multitude of lamps is that a thousand lamps arrayed in order manifest solemnity, their number and sincerity a matter of intent.\n\nThe luminous lamps above symbolize the stars, and next they illumine the Seven Ancestors. Their subtlety is beyond expression. Cultivating this for three years, one may ascend to heaven in broad daylight.\n\nThe method of lamp-veneration begins by facing east, then west, then south, then north. Then, gazing upward to the celestial center, one venerates the center while reciting the true scripture. Those in the purification assembly chant the praises, and afterward, they arrange the incense and flames with reverence. Before the clouds disperse, one must not allow the smoke to cease.\n\nThis method is widely embraced, delivering beings from the suffering of dark nights and absolving the calamities of life and death. Devout disciples and those who look upward in faith—when their households are afflicted by misfortune or they urgently wish to establish purification rites for their own deliverance—should offer fine incense and pure oil, with weights and measures according to their means, and cultivate with diligent practice.\n\nThose who falter should contribute the incense and oil provided by the host to cover the costs of correction and to amend their transgressions.\n\nDisciples who cultivate the Dao daily grow impatient, expecting swift results, yet the response is slow. They then deem the Dao distant and empty, lamenting, “What can be done about fate?” If one cannot transcend the boundaries and scale the peaks, how can the Seven Ancestors descend with blessings?\n\nIf one retreats and fails to gather like-minded companions at home for purification rites and scriptural recitation, instead constantly racing about in frantic pursuit, amusing oneself with wine and song, one betrays the mysterious teachings above and falls into the abyss of ancestral transgressions. Slaughtering the three sacrificial animals to fulfill filial piety—alas, how grievous! It pains my heart.\n\nWhen fortune wanes and misfortune waxes, one blames the gods and the directions, praying to the void. This is like digging a well when already parched—what can be done? The suffering of the dead and the torment of pain extend to later generations. Even the hunger and illness of descendants stem from the failure of the present life to perform good deeds, surrendering to capricious thoughts and indulging in malice. Such are the consequences.\n\nFoolish and obstinate men hear compassionate admonitions like the cry of the phoenix in the sky or the flight of the wild goose, and they laugh like dogs. How lamentable! They do not believe in what is taught.\n\nIf you wish to prolong your years and abide forever, to dispel calamities and cure illness, to cultivate great virtue and seek the utmost truth, to release the Seven Mysteries, you should know the Supreme Clarity’s great precepts on the retribution of good and evil deeds. Combine this with ritual recitation, and then calamities may be averted, and the luminous Han may be ascended.\n\nThe method of lamp-veneration is simply to recite the incantations and prayers. There is no prohibition against rigorous and resolute practice.\n\nThe Supreme Ultimate Perfected One said: When venerating the Lamp King or performing the lamp procession, recite the following hymn:\n\n---\n\n**Hymn:**\n\nO vast is the Seven Treasures Palace,\nSpontaneously born of the lotus!\nResplendent, it opens the night’s radiance,\nSwiftly ascending the Great Rosy Clouds.\nGazing upward at the mysterious true gates,\nCloud towers rise in towering majesty.\nFlowing brilliance illumines the mysterious void,\nUrging the troops to conquer the myriad demons.\nDelivering from suffering and the snares of calamity,\nAfter kalpas bound in infancy,\nPurification rites ferry the Seven Ancestors,\nAccumulating blessings to moisten the disciple’s house.\n\nSupremely wondrous, it emits divine radiance,\nFormless, silent, and without shadow.\nBeyond the boundaries, without limit,\nVastly and universally it saves all.\nLifting and delivering from the Seven Mysteries’ suffering,\nIn boundless emptiness, one beholds eternal stillness.\nDelivering from the five obstructions and stagnations,\nResponding to karmic signs, one rides the clouds above.\nThe luminous lamp penetrates the ten directions,\nNo darkness remains unillumined.\n\nResplendent is the mysterious true hall,\nIts brilliance shining through the ten directions.\nVast and open, it dispels the depths of obstruction,\nReleasing the bodies of all in difficulty.\nThe Seven Ancestors and the Three Wretched Realms are freed,\nNo more sorrow or affliction remains.\nGreen canopies reflect the ten directions,\nSoaring and parting the waves of clouds.\nThe divine lamp suffuses the Nine Netherworlds,\nIts candlelight brightening the mountain valleys.\nThe pure body abides in the Six Assemblies’ Palace,\nLifetimes become those of immortals.\nEmpty smoke and all karmic conditions,\nFortune descends to dispel the myriad demons.\nSuffering souls respond and disperse,\nLike ice melting in flowing sands.\n\nAccumulated misfortunes do not cease of themselves—\nHow could they be the fault of a single day?\nThe Seven Ancestors suffer these calamities,\nEver abiding between rivers and seas.\nThe Perfected Ones, moved by this suffering,\nEmpty their hearts before the ninefold gates.\nBowing their heads, they venerate the mysterious lamp,\nInscribing their names in the Eastern Florescence Palace.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1269,
      "start_sentence": 0,
      "end_sentence": 47,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.73943066596985,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\上清洞玄明灯上经.txt",
        "category": "本文类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "右礼王竟，便行灯颂十九首，如左： 千真朝琼阙，朗彻洞虚空，仰存无为尊，飞霞戏云间， 清静无滞难，身生七宝光。 我为海船师，故能释三罗， 夜光通幽谷，苦身洗荡开，虚烟散八极，朗照入太微， 礼诵无上教，福庆真巍巍。 飘飘结落通，寂寂满八丘， 三秦生云影，虚无双太元，洞观极十方，逍遥散苦躯。 飞轮蔼太空，无形亦无迹，纵洛任飞轮，萧萧超界外， 被褐咏夜光，诸天悉胜太。 罪福不由他，量自由尔身， 积功若不早，晨夜建福田，归命无为道，终当见正真。 焕烂明光晖，朗彻无隐探，赫耀绝冥外，福降积福迁， 庠序观十方，普济一切人。 严我玄真辔，携手擎玉符， 明灯扣琼锺，应响已得无，一日见三达，释我积世忧。 迁延七宝官，回轮曲岳阿，息驾绿盖房，岂知年岁多， 漱吸金液精，万劫方婴册，下看荣竞中，不解可奈何。 玄晖映曲谷，豁朗彻渊泉，畅映流郁交，缠绕盈酆山， 七祖反胎生，长安五色宫。 蓊蔼亭空曜，郁勃入太清， 天狩左右使，回轮归南倾，怳惚九载外，暂超石启灵， 七祖获胎仙，南宫更受生。 飞轮蔼空洞，眄观千百仞， 理悟齐一挥，聚烟吸然散，身轻体无为，四朗应景焕， 地狱三恶道，悉得脱笼绊。 啸歌九玄台，崇岭凝凄凄， 心理六觉畅，自弃尘浊缘，流霞耀金室，虚堂散玄晖， 积感致灵降，形单道亦分，倏欻眄万劫，岂觉周亿椿。 秀圃蔚神阶，朱琼纬琳流，风鼓空同玉，栖翳虚凤呜， 紫烟缠曲宇，丹晖绕绿軿。 飞旗郁玄盖，羽节耀紫清， 澄景九霄际，遨游戏凤城，顾看荣竞子，一乐同朝生。 腾辔控玄晖，晏景洞野外，流浪寻灵人，合形庆霄际， 手披朱玉户，朗若神冲泰。 金阙郁嵯峨，清影无尘秽， 解旌玄阆台，适我良愿会，脱徙三涂难，保炼固年迈。 智慧起本无，朗朗超十方，结空峙玄霄，诸天挹流芳， 其妙难思议，虚感真寔通，有有无不有，无无无不容。 智慧常观身，学道之所先，眇眇入玄肆，自然录我神， 天尊常拥护，魔王为保言，晃晃金刚躯，超超太上仙。 智慧生戒根，真道戒为主，三宝由是兴，高圣所崇授， 泛此不死舟，倏欻济大有，当此说戒时，诸仙来稽首。 太微天帝受戒时颂 夫见然灯，皆当诵此文，不但受戒时然灯也。 叩齿微为之，勿令他闻声，凡口齿悉耳。 太上散十方，华灯通精诚，诸天皆赫然，诸地悉朗明， 我身亦光彻，五藏生华荣，炎景照太无，遐想繁玉清。 丹精奇太无，玄阳空中响，含形灭苦根，幽妙至真想， 垂华不现宝，因缘不光象，我身亦如之，乘化托流景。 夜光表阳丹，迢迢照灵室，诸天普光显，诸阴即已灭， 我神亦聪明，常玩智与慧，逍遥适道运，迁谢任天势， 举形蹑空洞，夜烛焕流萃。 太微天帝曰：徒然灯而不知诵此，六天大魔府不过人死命，八方诸天亦不遣玉童玉女，飞天神人不降於子矣，十方三界不度兆名於东华南宫，不受子七祖父母化生之道。 施食众生咒 勤修大道法，精诚感太冥，真降魔魅散，众妖皆灭形， 七祖度南宫、兆身升上清，既福无不普，法食施众生。 上清洞玄明灯上经竟",
      "translated_text": "Upon concluding the rites to the King, proceed with the recitation of the nineteen Lamp Hymns, as follows:\n\nA thousand Perfected Ones ascend the Jasper Towers,\nResplendent, piercing the cavernous void.\nGazing upward to the Venerable One of Non-Action,\nRosy clouds play amidst the heavens,\nIn purity and stillness, no hindrance remains,\nThe body radiates the light of the Seven Treasures.\n\nI serve as the helmsman of the sea-vessel,\nThus able to release the Three Bonds.\nThe night’s glow illumines the hidden valleys,\nThe suffering body is cleansed and opened,\nEmpty smoke disperses to the eight directions,\nBright illumination enters the Grand Tenuity.\nReciting the supreme teachings,\nFortune and blessings are truly majestic.\n\nDrifting, drifting, weaving through the open paths,\nSilent, silent, filling the eight mounds.\nFrom the Three Qin, cloud-shadows arise,\nIn emptiness, the Two Great Origins pair.\nGazing through the ten directions,\nFreely dispersing the suffering form.\n\nThe flying wheel suffuses the vast sky,\nWithout form, without trace.\nSoaring over Luoyang with the wheel’s flight,\nWhistling beyond the boundaries,\nClad in coarse robes, chanting the night’s glow,\nAll heavens surpass the great.\n\nFortune and misfortune arise not from others,\nTheir measure lies within your own self.\nIf merit is not accumulated early,\nDay and night, cultivate the field of blessings.\nReturn your life to the Dao of Non-Action,\nAnd in the end, you shall behold the True Perfected.\n\nResplendent, the radiant light shines,\nBright and clear, with no hidden depths.\nGlorious beyond the darkest nether,\nFortune descends, and blessings accumulate.\nIn orderly ranks, observing the ten directions,\nUniversally aiding all beings.\n\nI adorn my reins of Mystic Perfection,\nHand in hand, lifting the jade tally.\nThe bright lamp strikes the jasper bell,\nThe echoing response is already attained.\nIn a single day, I see the Three Attainments,\nReleasing my accumulated sorrows of lifetimes.\n\nTransferred to the Palace of Seven Treasures,\nThe wheel turns along the winding mountain valleys.\nHalting the carriage in the chamber of the green canopy,\nWho knows how many years have passed?\nSipping the essence of golden liquid,\nAfter ten thousand kalpas, I am but an infant in the register.\nLooking down upon the world of striving and competition,\nI know not what to make of it.\n\nThe mysterious radiance illumines the winding valleys,\nBright and clear, piercing the abyssal springs.\nFlowing brilliance intertwines in lush profusion,\nEncircling and filling Mount Feng.\nThe Seven Ancestors return to womb-life,\nAbiding forever in the Five-Colored Palace.\n\nLush and misty, the empty sky glows,\nVigorous and surging, entering the Grand Purity.\nHeavenly huntsmen and attendants on left and right,\nThe wheel turns toward the southern inclination.\nBeyond the nine years of illusion,\nMomentarily transcending the stone’s awakening spirit.\nThe Seven Ancestors attain womb-immortality,\nReborn in the Southern Palace.\n\nThe flying wheel suffuses the empty cavern,\nGazing down a thousand, ten thousand fathoms.\nWith a single stroke of insight,\nGathered smoke instantly scatters.\nThe body is light, the form is Non-Action,\nThe four directions brighten in response to the scene.\nThe hells and the Three Evil Paths,\nAll escape their bonds and fetters.\n\nWhistling and singing on the Ninefold Mystery Terrace,\nLofty peaks congeal in solemn stillness.\nThe mind and the six senses flow freely,\nNaturally abandoning the dust and defilement.\nRosy clouds illuminate the golden chamber,\nThe empty hall scatters the mysterious radiance.\nAccumulated resonance summons the descent of spirits,\nThough the form is solitary, the Dao is also divided.\nIn an instant, gazing across ten thousand kalpas,\nWho perceives the passing of countless eons?\n\nThe verdant garden flourishes with divine steps,\nCrimson jasper weaves through the flowing jade.\nThe wind stirs the empty sky’s jade,\nThe perching phoenix sings in the void.\nPurple mist coils through the winding halls,\nCinnabar radiance encircles the green carriage.\n\nFlying banners flourish with the mysterious canopy,\nFeathered standards gleam in the Purple Clarity.\nThe limpid scene at the edge of the nine skies,\nRoaming and playing in the Phoenix City.\nLooking back at the striving mortals,\nOne joy is shared with those of the morning’s birth.\n\nReining the soaring radiance,\nThe tranquil scene stretches beyond the wilds.\nWandering in search of the numinous ones,\nUniting forms in celebration at the edge of the sky.\nPushing open the vermilion jade gates,\nBright as the divine surge of peace.\n\nThe golden towers rise in towering splendor,\nTheir pure shadows free of dust and defilement.\nUnfurling the banners on the Mystic Loft Terrace,\nFulfilling my deepest wishes.\nShedding the difficulties of the Three Paths,\nPreserving and refining to secure old age.\n\nWisdom arises from the root of Non-Being,\nBright and clear, transcending the ten directions.\nWeaving emptiness to stand in the Mystic Empyrean,\nAll heavens draw from the flowing fragrance.\nIts wonder is beyond thought and discussion,\nEmpty resonance truly connects.\nBeing is not being, non-being is not without,\nNon-being and non-without encompass all.\n\nWisdom constantly observes the self,\nThe first step in learning the Dao.\nSubtly entering the Mystic Workshop,\nNaturally recording my spirit.\nThe Heavenly Worthy always protects and shelters,\nThe Demon King offers his pledge.\nResplendent, the Vajra body,\nTranscendent, the Supreme Immortal.\n\nWisdom generates the root of precepts,\nThe true Dao takes precepts as its master.\nThe Three Treasures arise from this,\nVenerated and transmitted by the lofty sages.\nSailing this deathless vessel,\nIn an instant, crossing the great expanse.\nAt this moment of expounding the precepts,\nAll immortals come to bow their heads.\n\n**Hymn of the Celestial Emperor of the Grand Tenuity at the Time of Receiving Precepts**\n\nWhenever lighting lamps, one should recite this text—not only when receiving precepts and lighting lamps.\n\nGently knock the teeth, making no sound for others to hear. All teeth are ears.\n\nThe Supreme One scatters to the ten directions,\nFlower lamps convey sincerity.\nAll heavens blaze resplendently,\nAll earths are bright and clear.\nMy body, too, is luminous,\nThe five viscera bloom with splendor.\nThe blazing scene illumines the Great Non-Being,\nDistant thoughts flourish in the Jade Clarity.\n\nCinnabar essence marvels at the Great Non-Being,\nThe mysterious yang resounds in the empty sky.\nEmbracing form, eradicating the roots of suffering,\nSubtle and wondrous, the thought of the True Perfected.\nHanging blossoms do not reveal their treasure,\nCauses and conditions do not manifest light.\nMy body is likewise,\nRiding transformation, entrusting to the flowing scene.\n\nThe night’s glow manifests the yang cinnabar,\nFar and bright, illuminating the numinous chamber.\nAll heavens universally shine,\nAll yin is already extinguished.\nMy spirit, too, is keen and bright,\nEver delighting in wisdom and insight.\nFreely adapting to the Dao’s movement,\nChanging and yielding to heaven’s power.\nRaising the form to tread the empty cavern,\nThe night’s candle blazes with flowing brilliance.\n\nThe Celestial Emperor of the Grand Tenuity says: Lighting lamps without reciting this text allows the Great Demon Mansion of the Six Heavens to cut short human lives. The jade lads and jade maidens of the eight directions’ heavens will not be sent to you. Flying celestial spirits will not descend upon you. The ten directions and three realms will not inscribe your name in the Eastern Florescence or Southern Palace. Your Seven Ancestors and parents will not receive the Dao of transformation and rebirth.\n\n**Incantation for Offering Food to Sentient Beings**\n\nDiligently cultivate the great Daoist methods,\nSincerity moves the Grand Obscurity.\nThe true descends, demonic illusions scatter,\nAll demons vanish in form.\nThe Seven Ancestors cross to the Southern Palace,\nYour own body ascends to the Highest Clarity.\nSince blessings are universally bestowed,\nOffer the Dharma-food to all sentient beings.\n\n**The Supreme Clarity Scripture of the Cavernous Mystery’s Bright Lamp concludes.**",
      "overlap_context": "tune descends to dispel the myriad demons.\nSuffering souls respond and disperse,\nLike ice melting in flowing sands.\n\nAccumulated misfortunes do not cease of themselves—\nHow could they be the fault of a single day?\nThe Seven Ancestors suffer these calamities,\nEver abiding between rivers and seas.\nThe Perfected Ones, moved by this suffering,\nEmpty their hearts before the ninefold gates.\nBowing their heads, they venerate the mysterious lamp,\nInscribing their names in the Eastern Florescence Palace.",
      "start_char": 1270,
      "end_char": 2560,
      "start_sentence": 48,
      "end_sentence": 105,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.23074388504028,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\本文类\\上清洞玄明灯上经.txt",
        "category": "本文类"
      }
    }
  ]
}