{
  "source_id": "上清河图内玄经",
  "source_file": "chunked_daozang\\上清河图内玄经.json",
  "total_chunks": 11,
  "total_original_chars": 12191,
  "total_translated_chars": 77656,
  "total_translation_time": 408.7197256088257,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\上清河图内玄经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Clarity Inner Mystery Scripture of the River Chart**\n\n**Scripture Title:** *The Supreme Clarity Inner Mystery Scripture of the River Chart*. Author unknown, approximately composed during the mid-to-late Eastern Jin dynasty. A foundational scripture of the early Supreme Clarity tradition. Contains sections such as *The Secret Taboo Names of the Great One*, *The Nine August Treasure Registers of the River Chart*, and *Essential Methods for Observing the Stars*. Two scrolls in total. Source of base text: *Daoist Canon of the Zhengtong Era*, Orthodox Section, Part One.\n\n---\n\n### *The Supreme Clarity Inner Mystery Scripture of the River Chart, Scroll One*\n\nThe mysterious masters and sagely artisans, transmitting from generation to generation, have sensed this flourishing age. When its radiance wanes and fades, the cycles of good and evil alternate—now declining, now rising; sinking, then reviving; severed, yet reconnecting. Arrogance and negligence forever sever good causes, while single-minded reverence and secrecy nurture the growth of virtue. Through virtue, one may perceive the Dao’s response, and where the response gathers, anomalies arise. Anomalies lead to communion with the divine, and divine masters bequeath sacred texts—secret graphs and essential writings—naturally manifesting to cleanse filth and dispel dust. Silent recognition and adherence bring longevity and transcendence, delivering the self and saving all beings. The Three Vehicles unfold in mutual exposition, neither the hidden nor the manifest discarded. Those who defy the Dao sink into ruin, and the suffering of ruin is grievous. Each should heed this warning, remaining vigilant to the end as at the beginning, for only then do they align with the Dao.\n\nAll natural true writings exist inherently in the void. Thus, they may soar or sink, conceal or reveal. Dragons, horses, tortoises, and fish bear the charts and images, all born from the beginningless, emerging in response to karmic resonance. Their manifestations vary, yet only virtue is their companion. Those who attain them come later, though the writings have long preceded them. What is obtained today is shared with those who receive them—all inscribed on jade and gold tablets, meticulously carved and secretly preserved. Mastery comes through recitation, memorization, and profound understanding. Through recitation and cultivation, one may also transcribe them in cinnabar on silk, wearing them on the body to guard against forgetfulness. In urgency, one may consult them, and their practice dispels calamities, averts misfortune, and extends blessings. With unwavering diligence over time, one ascends to the ranks of sagely transcendents.\n\nDisciples must maintain purity and reverence when invoking the mysterious and petitioning the divine. These teachings must never be rashly transmitted to the unworthy, for reckless disclosure invites profound misfortune. All should exercise caution, upholding secrecy and adherence.\n\n---\n\n### *The Secret Taboo Names of the Great One (II)*\n\nThe Great One is the child of the Dao. When the Dao responds to the resonance of beings, it manifests the divine and generates the One. The One, through divine guidance, gives rise to and completes all things, boundless and infinite. For learners, the first step is to awaken and cultivate this, thereby attaining utmost authenticity. Authentic sages transmit it to guide later learners. Later learners, through compliance and awakening, unite with those who came before, and in this unity, they merge with the Dao.\n\nThe Three Powers, the Five Virtues, and the nine august numinous spirits arise from transformation and serve as the foundation for saving all beings. This Great One, the Three and Five, and the Nine Spirits are the ultimate source of the Dao. The One governs both the hidden and the manifest, serving as the origin of the formless. The Two represents the primordial exchange of qi, giving rise to Heaven, Earth, and Humanity. Humanity possesses varying degrees of acuity, and Heaven and Earth respond accordingly, forming three grades. Separation and union produce the Five, and the tripling of three yields the Nine, wherein all transformations are complete. Refining the insubstantial into the substantial, and penetrating the interrelation of being and non-being, all depends on the perfected person.\n\nHumanity follows Earth, Earth follows Heaven, Heaven follows the Dao, and the Dao follows spontaneity. The Three Powers possess form and are capable of practicing the Dao. Through practicing the Dao to its ultimate end, one ascends to the level of spontaneity. Though their ranks differ, all share a single source. Thus, the spirit of the Great One is most revered and exalted, giving birth to Heaven and establishing Earth, and bringing forth all beings.\n\nThose who do not receive the original source of the River Chart, do not wear the true graphs, do not recognize the primordial Great One, do not preserve the Five Spirits, do not uphold the Three Ones, and do not serve the Nine August Ones shall be unable to perform the Great Petition. The Great Petition’s invocations and supplications must encompass all directions. The most exalted and sacred taboo names, the hidden names of the inner spirits—without receiving them from a master, one must not rashly practice them. Practice should follow proper transmission, and transmission requires seeking a master. When the karmic conditions align to receive the text, one must adhere to the rites of the Mysterious Covenant.\n\nUnder the rites of the Mysterious Covenant, no one may arbitrarily perform any method or forcibly undertake its practice. Practicing it improperly incurs guilt, harming both oneself and others. Those who sincerely wish to practice must discreetly seek an enlightened master and obtain the rites of the Mysterious Covenant. Purify the heart and cleanse the self, and the encounter will occur naturally. Follow the precepts to prepare the petitions, and once the memorials are presented, perform the jiao offering with utmost sincerity. Be reverent and discreet, for violations invite investigation and punishment. Diligence and devotion over time bring blessings, and accumulated blessings cultivate virtue, which endures with the Dao.\n\nThe most revered spirit of the Great One has the taboo name *Wuyou Shou*, the style *Gui Huichang*, and alternate names *Jieming* and *Jipin*. Through the accumulation of virtuous causes, one may encounter these true taboo names. Silently recognize and inwardly preserve them, reciting them in secret during movement and stillness. Whatever one seeks or desires, focus the mind and direct the intention—yet one must not reveal them to others. If shared with the unworthy, both parties incur guilt. To avoid guilt and attain blessings, silently preserve them in the heart. Constantly visualize the radiant image of the Great One’s spirit, resplendent and extraordinary, by one’s side—whether sitting or walking, in leisure or urgency, day and night. Through unwavering contemplation, misfortune dissipates and fortune arrives. Over time, one may converse with the spirit, and speech and form will merge, becoming one.\n\nThose unable to maintain constant visualization may focus on it at night, within the Sixfold Palace of the self. Enter between the eyebrows and retreat one inch to reach the Hall of Light; two inches to reach the Grotto Chamber. The Grotto Chamber lies to the south, the Hall of Light to the north—this is the Sixfold Palace, above which is the Palace of the Supreme Ultimate. The Great One dwells in the Palace of the Supreme Ultimate by day and in the Sixfold Palace by night. Constantly preserving this practice brings daily renewal of merit and conduct, and demons dare not intrude. Without knowledge of the Great One, even virtuous deeds performed in vain will be corrupted by evil, and one’s cultivation will bear no fruit. For learners seeking accomplishment, preserving the One is of utmost urgency.\n\n---\n\n### *The Nine August Treasure Registers (III)*\n\n**First:** The Yang Brightness Star, the Jade August Nine Dawn Lords. The Celestial Pivot Star—this is the spirit-soul of Yang Brightness. Opposite the northwest gate of Yang Brightness is the August Lady of the Supreme Realized Ones.\n\n**Second:** The Yin Essence Star, the Jade August North Supreme Dawn Lord. The Celestial Rotation Star—this is the spirit-soul of Yin Essence. Opposite the west gate of Yin Essence is the August Lady of the Supreme Mystery.\n\n**Third:** The Perfected Person Star, the Jade August Lord of Immortal Florescence. The Celestial Mechanism Star—this is the essence-spirit of the Perfected Person. Opposite the southeast gate of the Perfected Person is the Primordial August Lady.\n\n**Fourth:** The Profound Darkness Star, the Jade August Lord of the Soaring Canopy. The Celestial Balance Star—this is the essence-spirit of Profound Darkness. Opposite the east gate of Profound Darkness is the August Lady of Florescence.\n\n**Fifth:** The Cinnabar Prime Star, the Jade August Lord of the Seven Dawns of the Golden Bushel. The Jade Pivot Star—this is the essence-spirit of Cinnabar Prime. Opposite the northeast gate of Cinnabar Prime is the Median August Lady.\n\n**Sixth:** The Northern Culmen Star, the Jade August Lord of the Flying Florescence of the North. The Kaiyang Star—this is the essence-spirit of the Northern Culmen. Opposite the north gate of the Northern Culmen is the August Lady of Dawn Florescence and Primordial Augustness.\n\n**Seventh:** The Celestial Pass Star, the Jade August Lord of the Ninefold Prime and Northern Canopy. The Radiant Light Star—this is the luminous essence-spirit of the Celestial Pass. The south gate of the Celestial Pass faces downward toward the Northern Culmen, where the August Lady of the Numinous resides.\n\n**Eighth:** The Auxiliary Star, the Jade August Lord of the Nine Dawns. The Cavernous Brightness Star—this is the essence-spirit of the Auxiliary Star, Yang Brightness. Opposite the west gate of the Auxiliary Star, above the Celestial Pass, is the August Lady of the Thearch.\n\n**Ninth:** The Adjuvant Star, the Jade August Lord of the True Prime. The Hidden Prime Star—this is the luminous and empty essence-spirit of the Adjuvant Star. Opposite the southeast gate of the Adjuvant Star is the August Lady of the Supreme.\n\nThe Nine August Ones and Nine August Ladies correspond to and manifest through the stars, revealing subtleties by their radiance to guide the myriad branches back to the source. Though the ten thousand kinds are manifold, none depart from the Nine. Thus, they are ordered in sequence, with yin and yang paired in opposition.\n\nFor those who wish to visualize and wear the talismanic chart, make offerings, pay homage, meditate to perceive the true forms, and seek their desires, prepare a pure white silk half-scroll, one foot in width and one foot two inches in length. Use light blue for the base stars and light black for the essence-spirits. The attire and exhaled qi of the August Lords and Ladies should follow the annotations. The transmitted talismanic charts and texts worn by the master must not be inscribed; record them according to the preceding format as follows:\n\n*Chart Title: [Year], [Month], [Day], [Hour] of the Great Year. [Province], [Commandery], [County], [Village], [Residence]. Male/Female, [Official Rank], [Name], age [Number], born in the year [Year Stem-Branch], month [Month], day [Day], with the [Nayin] of [Celestial Stem], affiliated with [Mountain] and [Star]. In [Province], [Commandery], [Village], [Mountain Forest], [Abode], from the master [Male/Female Perfected Person/Teacher’s Name], received the concealed names of the Nine August Ones, the formula for longevity and deathlessness, and the Nine Palaces’ numinous officials to guard the body, repel evil, and admit rectitude, assembling together before the Jade Thearch. No violation is permitted, as per the statutes of the Great Mysterious Capital.*\n\n**Yang Brightness Grand Marshal’s Mansion:** Nine hundred twenty ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robed messengers, jade lads and jade maidens—ninety-nine hundred million myriad persons.\n\n**Yin Essence Grand Minister’s Mansion:** Five hundred fifty ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robed messengers, jade lads and jade maidens—ninety-nine hundred million myriad persons.\n\n**Perfected Person Controller of Destinies’ Mansion:** Seven hundred seventy ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robed messengers, jade lads and jade maidens—ninety-nine hundred million myriad persons.\n\n**Profound Darkness Mobile Strike Mansion:** Eight hundred ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robed messengers, jade lads and jade maidens—ninety-nine hundred million myriad persons.\n\n**Cinnabar Prime Dipper Lord’s Mansion:** Seven hundred twenty ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robed messengers, jade lads and jade maidens—ninety-nine hundred million myriad persons.\n\n**Northern Culmen Grand Constancy Mansion:** Seven hundred seventy ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robed messengers, jade lads and jade maidens—ninety-nine hundred million myriad persons.\n\n**Celestial Pass Supreme Thearch’s Mansion:** Nine hundred ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robed messengers, jade lads and jade maidens—ninety-nine hundred million myriad persons.\n\n**Auxiliary Heavenly Honored Jade Thearch’s Mansion:** Nine hundred ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robed messengers, jade lads and jade maidens—ninety-nine hundred million myriad persons.\n\n**Adjuvant Supreme Thearch True Minister’s Mansion:** Nine hundred ninety ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robed messengers, jade lads and jade maidens—ninety-nine hundred million myriad persons.\n\nThe talismans are to be inscribed in cinnabar.\n\n**First, the Yang Brightness Star:** Heaven’s Grand Marshal, who rectifies and governs transgressions, oversees the Nine Heavens’ Perfected Ones above, supervises the Five Peaks’ flying immortals in the middle, and leads the Perfected Persons of later learners below, weighing the merits and faults of heaven, earth, spirits, and numina. Its domain spans nine hundred twenty *li*, where the Perfected Person of the Dipper’s True Abode in the Azure City, named Upper Numinous, with the style *Shaking Heaven’s Mallet*, wears a Nine Dawns Jade Crown, azure feathered flying robes, and holds the Mysterious Chart of the Dipper, seated within the jade tower. Those who know its inner name will be illuminated by the Jade Dawn and soar through the Great Void.\n\n**Second, the Yin Essence Star:** Heaven’s Grand Minister, who governs emoluments and ranks, oversees the celestial lodges above and leads the myriad spirits below, as well as those who study immortality. Its domain spans five hundred fifty *li*, where the Perfected Person of the Five-Colored Jade Tower, the Lifting Bushel, titled the Northern Supreme Divine Lord, named *Nurturing Infant*, with the style *Stimulating Bright Light*, wears a Dark Essence Jade Crown, dark feathered flying robes, and holds a five-colored feathered tally.\n\n**Third, the Perfected Person Star:** Heaven’s Minister of Works, who governs immortals and transcendents, oversees the Nine Heavens’ lofty Perfected Ones above, supervises the Five Peaks’ numinous immortals in the middle, and leads those who study the Dao below. Its domain spans seven hundred seventy *li*, where the Perfected Person of the Yellow Terrace Jade Tower, the Treading Dipper, titled the Divine Lord of Immortal Florescence, named *Returning to the Multitude*, with the style *Dwelling in Reverent Tread*, wears a Flying Dawn Treasure Crown, azure feathered flying robes, and holds the Azure Register of the Dipper’s Center.\n\n**Fourth, the Profound Darkness Star:** Heaven’s Mobile Strike General, who punishes rebels, oversees the Nine Heavens’ ghosts and spirits above, commands the Northern Thearch’s Three Offices in the middle, and supervises the myriad multitudes below. Its domain spans eight hundred *li*, where the Perfected Person of the Vermilion Terrace Jade Tower, the Pacing Central Dipper, titled the August Lord of the Soaring Canopy of the Profound, named *Pivot of Darkness*, with the style *Shaking Heaven’s Pillar*, wears a Three Florescence Treasure Dawn Crown, cinnabar brocade flying robes, and holds the tally of life’s numina.\n\n**Fifth, the Cinnabar Prime Star:** Heaven’s Dipper Lord, who oversees the registers of official rank and destiny. Above, he governs the myriad registers of the Nine Heavens; in the middle, he commands the ledgers of ghosts and spirits; below, he presides over the registers of those who study the Perfected and the destinies of the multitudes. None in the heavens or upon the earth escape his governance. Its domain spans seven hundred and twenty *li*, where the Perfected Person of the Plain Terrace Golden Tower, Treader of the Celestial Threads, titled the Golden Chief of the Seven Dawns Lord, named *Upper Opening*, with the style *Transforming the Five Paths*, wears a Seven Treasures Flying Heaven Crown, white brocade flying skirts, and holds the Azure Mystery Registers.\n\n**Sixth, the Northern Culmen Star:** Heaven’s Grand Constancy, who oversees advancement. Above, he governs the Supreme Perfected of the Nine Heavens; in the middle, he commands the Flying Immortals of the Five Peaks; below, he presides over the ranks of scholars. Its domain spans seven hundred and seventy *li*, where the Perfected Person of the Mystic Terrace Jade Tower, Pacing the Celestial Web, titled the Northern Dawn Flying Splendor Lord, named *Bright Numen*, with the style *Prospering the Upper Prime*, wears a Flying Essence Splendor Crown, purple brocade flying robes, and holds the Jade Baton of the Dipper.\n\n**Seventh, the Celestial Pass Star:** Heaven’s Supreme Thearch, who governs the mechanisms of heaven and earth, the length of the four seasons, and the cycles of prosperity, decline, and kalpas. Its domain spans nine hundred *li*, where the Perfected Person of the Nine-Tiered Jade Tower, Rider of the Dragon, titled the All-Numinous Nine Prime Northern Canopy Dawn Lord, named *Mystic Pivot*, with the style *Opening Heaven’s Path*, wears a Nine Prime Crown, nine-hued brocade robes, and holds the Radiant Spirit Baton.\n\n**Eighth, the Auxiliary Stars:** The stars of the Heavenly Venerable Jade Thearch, the constant yang, who oversees the Flying Immortals. Above, he governs the Nine Heavens; below, he commands the Nine Earths, the divine officials of the Five Peaks and Four Waterways. Its domain spans nine hundred and ninety *li*, where the Perfected Person of the Purple Qi Jade Tower, Wanderer of the Three Destinies, titled the Thearch-Venerable Nine Dawns Lord, named *Essence of Constancy*, with the style *Empty Upper Opening, Upright Extension*, wears a Flying Essence Jade Crown, nine-hued phoenix robes, and holds the Fire Bell.\n\n**Ninth, the Adjuvant Stars:** The stars of the Supreme Thearch Perfected Person, the hidden emptiness, who governs boundless transformations. Its domain spans nine hundred and ninety *li*, where the Perfected Person of the Jade Terrace Purple Cincture, Wanderer of the Three Yangs, titled the Thearch-Perfected Prime Dawn Lord, named *Dark Emptiness*, with the style *Mystic Yang Radiance, Dark and Vast*, wears a Flying Heaven Jade Crown, nine-dragon robes, and holds the Thearch’s Edict.\n\n---\n\n**First, the Celestial Pivot Star:** Within the Prime Dipper Palace dwells the Mystic Supreme Perfected August Lady, named *Bright Permeation*, with the style *Infant Nurturance*, whose true name is [omitted]. She wears a Flying Spirit Splendor topknot, a three-hued skirt of purple, yellow, and azure, and a sash with nine bells. Her mouth ever emits azure *qi*, its light pouring into the Yang Brightness Star.\n\n**Second, the Celestial Whirl Star:** Within the Mystic Chief Palace dwells the Numinous Essence Supreme Mystery August Lady, named *Mystic Mirror*, with the style *Fuming Radiance*, whose true name is [omitted]. She wears a flying brocade skirt and a phoenix-patterned brocade cloak, with a numinous flying purple sash. Her mouth ever emits black *qi*, its light pouring into the Yin Essence Star.\n\n**Third, the Celestial Mechanism Star:** Within the Supreme Essence Palace dwells the Numinous Consort Prime August Lady, named *Constant Brightness*, with the style *Transforming Clouds*, whose true name is [omitted]. She wears a Morning Infant Treasure Crown and a flying spirit bright-light brocade robe, with a six-mountain flying dawn sash. Her mouth ever emits yellow *qi*, its light pouring into the Perfected Person Star.\n\n**Fourth, the Celestial Balance Star:** Within the Webbed Culmen Palace dwells the Supreme Numinous Divine Consort Splendor August Lady, named *Opening Life*, with the style *Moving Brightness*, whose true name is [omitted]. She wears a seven-tiered jade crown and a crimson phoenix-patterned robe, with a golden true jade-light sash. Her mouth ever emits red *qi*, its light pouring into the Profound Darkness Star.\n\n**Fifth, the Jade Balance Star:** Within the Numinous Pass Palace dwells the Northern Supreme Golden Canopy Central August Lady, named *Prime Square*, with the style *Divine Martiality*, whose true name is [omitted]. She wears a purple dawn flying splendor crown and a nine-hued robe, with a divine tiger jade-patterned sash. Her mouth ever emits white *qi*, its light pouring into the Cinnabar Prime Star.\n\n**Sixth, the Opening Yang Star:** Within the Purple Culmen Palace dwells the Peaceful Upper Dawn Splendor Prime August Lady, named *Jade Prime*, with the style *Splendor Root*, whose true name is [omitted]. She wears a jade dawn advancing-worthy crown and a flying azure robe, with a flowing-gold fire bell sash. Her mouth ever emits green *qi*, its light pouring into the Northern Culmen Star.\n\n**Seventh, the Jade Light Star:** Within the Heaven-Moving Palace dwells the Jade Splendor Numinous August Lady, named *Celebrating Prime*, with the style *Final Convergence*, whose true name is [omitted]. She wears a flying splendor cloud topknot, a seven-hued night-luminous cloud brocade skirt, and a nine-hued brocade cloak, with a heavenly might numinous jade baton sash. Her mouth ever emits red *qi*, its light pouring into the Celestial Pass Star.\n\n**Eighth, the Cavern Brightness Star:** Within the True Emptiness Palace dwells the Supreme Brightness August Lady, named *Dark Ascent*, with the style *Prime Tone*, whose true name is [omitted]. She wears a cloud topknot and a flying net-cloud robe, with a nine-light sash. Her mouth ever emits azure *qi*, its light pouring into the Auxiliary Stars.\n\n**Ninth, the Hidden Prime Star:** Within the Constant Treasure Palace dwells the Empty Mystery Transforming Numinous Supreme August Lady, named *Dark Permeation*, with the style *Myriad Radiance*, whose true name is [omitted]. She wears a seven-tiered jade crown and an azure-patterned brocade skirt, with a nine-light night-candle sash. Her mouth ever emits black *qi*, its light pouring into the Adjuvant Stars.\n\n---\n\nTo accuse another’s wrongs and clarify one’s own rightness, to suppress another’s evil and extend one’s own goodness, to reproach oneself rather than resent others, to comprehend principle and each seek blessing—thus eliminating transgressions and prolonging fortune—one petitions the Heavenly Grand Commandant, the First Jade Thearch.\n\nFor those studying the offices of yin and yang to seek rank and emolument, one petitions the Heavenly Grand Steward, the Second Jade Thearch.\n\nFor those studying the Dao in hopes of becoming immortals, to communicate with spirits and attain sagehood, one petitions the Heavenly Minister of Works, the Third Jade Thearch.\n\nTo subdue the malevolence of humans and ghosts, to punish and execute the wicked and perverse in the hidden and manifest realms, one petitions the Heavenly Mobile Strike General, the Fourth Jade Thearch.\n\nTo establish merit and build virtue, to increase one’s lifespan and prolong one’s years, one petitions the Dipper Lord, the Fifth Jade Thearch.\n\nTo alleviate distress, illness, and hardship, to beseech relief and exemption, one petitions the Heavenly Grand Constancy, the Sixth Jade Thearch.\n\nWhen heaven and earth are obstructed and *qi* conditions are unbalanced, one petitions the Heavenly Supreme Thearch, the Seventh Jade Thearch.\n\nTo dispel and avert manifold disasters, to ascend above and tread below, one petitions the Heavenly Jade Thearch, the Eighth Jade Thearch.\n\nFor boundless transformations to respond and save all, one petitions the Supreme Thearch, the Ninth Jade Thearch.\n\nThe inner names and hidden styles of the Nine Thearchs and Nine August Ladies—those who know them shall extend their lifespan by seven thousand years.\n\nEach evening at dusk, one observes and visualizes the august forms and majestic radiance of the Jade Thearchs and August Ladies, recalling their inner names and hidden styles. With focused contemplation, if one succeeds in beholding the eighth and ninth stars, one’s lifespan shall become boundless.\n\nThe Nine Thearchs and Nine August Ladies are the refined essences of the nine *qi*, the numinous spirits of the Nine Heavens, the wondrous manifestations of the Nine Stars, and the awe-inspiring deities of the Nine Transformations. Men and women who study the Dao, wear and offer them in ritual, and in all activities—whether coming or going, sitting or reclining—meditate upon the true, shall find that in times of sorrow or joy, illness or hardship, they bring healing and support, cultivate the self and aid others. By constantly bearing them in mind, disasters dissolve, misfortunes scatter, and profound blessings commune with the divine.\n\nIn times of urgent need, inscribe the talisman in cinnabar on bamboo or silk according to the method, face north, bow twice, and ingest it with well-flower water. After completing one cycle of nine watches, a dose of one or two measures, taken thrice, will cure illness—then one may cease. There is no other incantation; one need only hold the nine hidden names in mind. Diligently performing good deeds without slackening for nine years will assuredly grant divine transcendence.\n\nThe essentials of the Jade Thearch must not be recklessly disclosed; cultivate them in secrecy, and one shall attain the rank of Perfected Person and Primordial Lord, associating with the supreme sages—the Three Pure Ones and the Primordial Perfected of Yuanshi. Upon receiving this, inscribe it on silk and illustrate it, presenting it with reverent petition. By secretly preserving the hidden names in one’s heart, one shall achieve immortality.\n\nWhen receiving the *Hetu*, one must first petition the inner names of the Nine Thearchs. After observing a nine-day, seven-day, three-day, or one-day retreat as circumstances permit, submit a petition to announce the transmission. Within three days, in a mountain retreat, altar hall, or secluded chamber—wherever it is pure and tranquil—present the memorial as follows:\n\nThe Most High Master of the Cavernous Law of [Your] Peak, the Perfected of the Nine Palaces, your humble servant [Your Name], bows twice and respectfully addresses:\n\nThe Most High Boundless Dao, the Supreme Non-Being and Perfectly True Heavenly Worthy; the Lofty Myriad Perfected, the Jade Dawn Dao Lord; the Great Emperor of Fusang, the Divine King of Yang Valley; the Thearchs and Emperors of all heavens; the Nine August Lords of the Posterior Saints and Nine Mysteries before the Golden Portal of the Jade Palace; the Prime Minister, the Azure Lad and Supreme Perfected; the Great Master of the Mysterious Center; and all luminous spirits within and beyond the Three Realms:\n\nSince the beginningless kalpas, your servant has revolved through cycles of good affinity, attaining this humble and ordinary form. By grace, I have heard the wondrous Dharma, received its secret essentials, and bear its profound indebtedness. Through fortunate karmic convergence, I have traversed many lands. On the [day] of [month] in the year [year], in the [prefecture], [commandery], [county], and [village], I received from the male/female master [Name] the precious scripture of the *Hetu*, the hidden names of the Supreme Clarity, and the practice of wearing and cultivating them.\n\nToday, I have witnessed the strictness of the Dharma’s prohibitions against reckless transmission and the requirement to seek worthy recipients, yet I cannot withhold it. Now, in the [prefecture], [commandery], [county], and [village]—or presently residing in [location]—the male/female Daoist [Name], in the mountain retreat or hall of [prefecture], [commandery], [county], and [village], has submitted a petition seeking to receive it. Their sincerity and earnestness are fully sufficient, and their worthiness is evident.\n\nYet your servant, being dull and obscured, has not yet attained spiritual penetration. Discerning others is ever difficult, and I dare not presume to guarantee secrecy. Thus, in strict adherence to the precepts and methods, I solemnly transmit the true teaching, announcing this sacred transmission to the mysterious overseers.\n\nI humbly pray that the Most High Boundless Dao and Heavenly Worthy, pervading all within the Three Realms, may command all divine beings to descend with responsive numinosity, rewarding the resolve to perform good deeds. After this transmission, may the recipient reform past transgressions and cultivate future conduct, with divine Perfected protecting them and evil demons daring not intrude. May they encounter virtuous companions, subdue malevolent forces, open their hearts to enlightenment, and align their actions with the true.\n\nYour disciple [Name], vowing to focus the mind and return to the source, shall not dare to drift with the currents. Through ascetic practice and reverent adherence, I shall first relinquish all faults, rescue my kin, and establish new merits. I swear never to scheme for glory or desire, nor indulge in treachery or licentiousness. I shall sever ties with thieves and robbers, block the paths of recklessness, refrain from killing or lewdness, falsehood or theft, arrogance or violence. I shall guard the One and preserve the Three, practice the Five and embody the Seven, and perfect the Nine Treasures and Ten Virtues. I shall purify the filth of jealousy and envy, wash away the dust of yin oppression, not suppress the worthy or betray the Way of the master, not revile or insult anyone, nor reveal essential teachings. I shall not mourn excessively in grief, nor collude with women to usurp the true, nor indulge in drunken singing to disrupt propriety, nor deceive others with harsh words, nor act cunningly toward spirits or belittle beings. I shall not rely on high status to bully the lowly, steal or alter scriptures, tamper with diagrams or decrees, slander sacred texts, create my own methods, lead others astray, or misguide the masses. For all such past transgressions, I beseech forgiveness; henceforth, I shall not dare to repeat them.\n\nI implore the lofty sages and great deities—the Jade Dawn Great Emperor and the Great Master of the Mysterious Center—to deign to witness this. May they command the benevolent spirits of the ten directions and the officials of the Three Realms to follow the karmic sequence, protect and bestow compassion. In great mercy and magnanimity, may they perfect goodness and bestow blessings, purify the turbid, enlighten the ignorant, secure the imperiled, and reconnect the severed.\n\nMay your servant’s talents and wisdom be outstanding, spared from all disasters, with lifespan prolonged and virtue harmonized with the Perfected. May my ancestors of a hundred million generations ascend to the Hall of Blessings, and may all kin—inner and outer—attain peace. May my transformative deeds and merits be unimpeded wherever I tread, my wisdom illuminate all, and my constant preservation be boundless. May my descendants flourish, their wisdom exceptional, their heavenly and earthly ranks enduring and secure. May the Dao’s influence spread widely, and may all—seen and unseen—receive its grace.\n\nShould my prayers be granted, I shall inscribe this profound mercy in my heart. Though my presumption knows no bounds and may offend your majesty, I prostrate myself in shame and trepidation. Relying on the grace of your benevolence, I nourish this withered form, diligently purifying myself in reverence, awaiting the response of the wondrous gate. I exhaust my sincere devotion, awaiting the verification of divine efficacy.\n\nYour servant and [Name], together, pledge our bodies and minds, aspiring to the ultimate. We shall not betray what has been declared.\n\nWe beseech the Most High and Perfectly True Heavenly Worthy, the Lofty Myriad Perfected and Jade Dawn Dao Lord, to bestow your compassionate discernment.\n\nYour foolish servant, through the Nine Thearchs’ divine officials, the Flying Dragon Riders, and the Embroidered Robe Envoys, respectfully presents this memorial for the male/female Daoist [Name], petitioning to receive the precious scripture of the *Hetu*, the hidden names of the Supreme Clarity. A vermilion memorial is hereby submitted to the Supreme Three Heavens, the Nine Thearchs, and the Jade Emperor’s Three Primordial Courts, awaiting your decree.\n\nYour servant [Name], with utmost reverence and trepidation, prostrates and bows repeatedly to make this known.\n\nYour servant, of the surname [Name], hails from [State], [Commandery], [County], now belonging to [State], [Commandery], [County].\n\nTo the Supreme Primordial Great Dao of the Utmost Origin, the Most Perfectly True Heavenly Worthy of the Primordial Origin, the Lofty Myriad Perfected and Jade Dawn Dao Lord, the Great Emperor of Fusang and Lord of the Sun Valley, the Thearchs and Emperors of the Myriad Heavens, and the Golden Gate and Jade Steps of the Nine Mysterious Imperial Lords of Later Sagely Worthies:\n\nOn the day and hour of the [Year-Star] in the [Month] of the [Year], at the mountain forest abode in the village of [State], [Commandery], [County].\n\nThe memorial body is made of yellow silk, one *chi* in length and two *chi* and four or five *cun* in width, with the content adjusted to fit. The beginning is left blank for one line. On the next line, the character *tai* (太) is placed above the central division, and *shang* (上) below it. Below this, three characters per *cun* are written in sequence. The column headers are marked in vermilion, each extending five *fen* outward, and bordered with vermilion. Within the columns, nine *cun* accommodate twenty-seven characters as the standard.\n\nAfter the initial prostration, the remaining space is left blank. On the next line, the character *yan* (言) is written one character below the top, with the rest left blank. On the following line, the divisions are filled sequentially to the edge of the column, ensuring no misalignment within the borders. After the border, three lines are left blank, followed by the servant’s name [Name]. Three lines later, the Year-Star’s surname is recorded. In the central line, the forty-five characters from *Tai Shang* (太上) to *Bi Xia* (陛下) are written in smaller script, divided into three sections\n\nHere follows the translation of *Shangqing Hetu Neixuan Jing*, Scroll the Lower:\n\n---\n\n**Corrections and Emendations:**\n*#2* The character *dai* (帶, \"to wear\") is supplied based on context.\n*#3* The character *guan* (冠, \"crown\") was mistakenly written as *fu* (符, \"talisman\") in the original.\n*#4* The character *qun* (裙, \"skirt\") was mistakenly written as *chen* (晨, \"morning\") in the original.\n*#5* The character *yun* (云, \"to say\") is supplied from the *Shangqing Hetu Baolu*.\n*#6* The character *xie* (懈, \"slack\") was mistakenly written as *jie* (解, \"to untie\") in the original.\n\n---\n\n**Incense, Lamps, and Prayer of Thanksgiving (Fourfold)**\n\nNine lamps are lit: seven with oil, two with incense, arrayed universally toward the north.\n\nA mat is spread south of the lamps, upon which nine trays of jujubes are set. Nine slices of dried meat are placed atop the jujubes, and nine measures of salt are positioned behind the trays. Nine cups of wine are arranged before the trays.\n\nAnother mat is laid separately, facing the lamps, where the incense burner is placed. The disciple kneels in reverence, offers incense nine times, and with eyes closed, visualizes the Nine Star Spirits in the heavens above.\n\nUpon completion, the disciple strikes the teeth nine times and rises.\n\nThe disciple, a servant of the Three Treasures, [Name], now respectfully invokes:\n\nThe Imperial Seat of the Auxiliary Star, Purple Qi Jade Tower, Imperial Lord of the Nine Mornings, August Sovereign, and the August Consort, the High August Left Consort;\nThe Supreme Lord of the Corrective Star, Jade Tower of the Purple Palace, Imperial Perfected One of the Primordial Dawn, August Sovereign, and the August Consort, the High August Right Consort;\nThe Youthful Star of Greed and Life, Yang Brightness, Supreme Palace of the Azure City, Jade Tower of the Nine Mornings, August Sovereign, and the August Consort, the Inner Concubine of Escaped Primordial Qi;\nThe Gate of Greatness in the Ox and Boar, Yin Essence of the Middle Primordial Palace, Five-Colored Jade Tower of the Northern Dawn, August Sovereign, and the August Consort, the Inner Concubine of Transformed Form;\nThe Star of Emolument in the Tiger and Dog, Perfected One of the True Primordial Palace, Yellow Terrace Jade Tower, Lord of Immortal Splendor, August Sovereign of the Flowering Dawn, and the August Consort, the Mother of the Upper Primordial;\nThe Star of Literature in the Rabbit and Rooster, Dark Obscurity of the Mystic Tie, Crimson Terrace Jade Tower of the Dark Supreme, Flying Canopy of the Mystic Dawn, August Sovereign, and the August Consort, the Inner Concubine of the Originating Primordial;\nThe Star of Integrity in the Dragon and Monkey, Cinnabar Primordial Ridge, White Terrace of the Golden Jade Tower, Golden Chief of the Seven Mornings, August Sovereign, and the August Consort, the Eldest Maiden of the Dipper;\nThe Star of Valor in the Serpent and Ram, Northern Buttress of the Dark Record, Dark Terrace Jade Tower, Northern Asterism of Flying Splendor, August Sovereign, and the August Consort, the Middle Maiden of the Dipper;\nThe Star of Ruin in the Horse and Life, Celestial Pass of the Heavenly Assembly, Nine-Tiered Jade Tower, Sovereign of the Total Spirit of the Nine Primordials, August Sovereign of the Northern Canopy, and the August Consort, the Youngest Maiden of the Dipper.\n\nRespectfully invoked are the Seven Numinous Great Spirits, the Nine Essences of the Imperial Dawn, the Four August Ones who bend their gaze in condescension. May they, in compassion for this sincere heart, deign to descend in cloud-borne chariots, their sacred radiance stirring.\n\nTogether with the Lord of Central Harmony, the Lord of Myriad Blessings, the Lord of Extended Longevity, the Lord of Cherished Life, the Lord of Bright Calculation, the Lord of Preserved Records, the Lord of Fixed Destiny, the Lord of Rewarding Goodness, the Lord of Answering Wishes, the Divine Lads and Jade Maidens, the Direct Talismans and Direct Officers, the Perfected Generals and Cavalry Attendants, and all their official retinues—may they all descend upon this open altar within [Name]’s village, observe the earnest devotion of this supplicant, and partake of this humble offering.\n\nThis servant, [Name], shares a bond of Dao and righteousness with [Name], enduring and karmically linked, their affection akin to flesh and blood, their hearts united in devotion.\n\n[Name] surrenders life to the Nine August High Ones, the Seven Sacred Great Spirits, the Supreme Perfection of the Great Dao, and the Venerable Lords.\n\nThis servant, [Name], with awe and trepidation, bows twice in reverence.\n\nFurther, the wine is poured into cups, lifted three times, and offered thrice, completing nine offerings of wine, thus fulfilling the ninefold libation.\n\nThe disciple, a servant of the Three Treasures, [Name], now addresses the Seven Numinous Great Spirits, the Nine Essences of the Imperial Dawn, the Illustrious High Ones, the Lords of Virtue and Power, and all the Perfected Spirits:\n\nToday, with utmost sincerity, [Name], of [State], [Commandery], [County], [Village], [Residence], presents this written petition, humbly reciting as follows.\n\nThis servant prostrates in hope that all the divine luminaries will reflect upon these words and, together with the modest offerings now set forth, accept the life-bound silken banners of [X] feet, presented before the Jade Mechanism of the August Sovereign and Consort corresponding to [Name]’s destiny. May they redeem and ransom [Name]’s fated expiration, beseeching the grace of renewal.\n\nMay the August Sovereigns and Consorts, moved by this sincere plea, partake of these humble offerings and bear witness to this covenant.\n\nIt is humbly prayed that the assembled spirits will exhort the August Sovereigns and Consorts to bestow compassionate grace, respond to this entreaty, and grant [Name] perpetual freedom from calamitous illness, sparing them from the sorrow of mortal affliction, delivering them from unforeseen misfortune. May all disasters dissolve, every endeavor align with the heart’s desire, and every aspiration be fulfilled. May this sincere devotion be conveyed through this servant.\n\nThis servant, though unworthy, has presumptuously joined the true teaching, aspiring to propagate the mysterious wind, to succor all beings, placing others before self, and never daring to slacken.\n\nNow, unable to contain this earnest and reverent devotion, this servant ventures to present this humble plea.\n\nYet human life is ever in motion, truly beset by many [lacuna]. Through ignorance and darkness, one strays from the true path, leading to delusion and loss of the correct Way.\n\nUpon reflection, principle resides in the realm of existence, and one cannot be without mind. What the mind pursues must be to dispel darkness and seek illumination. Illumination must be polished and brought forth by the sacred and numinous. When the mysterious reward is granted, the sacred permits gratitude; when the divine permits mercy, mercy arises from sincerity. Gratitude is tied to the purification of the heart. When the heart is exhausted, repentance for boundless transgressions begins; when sincerity is complete, the rites of offering must be respectfully presented. When the rites are perfected, divine protection will surely arrive; when transgressions are absolved, virtuous wishes will surely harmonize.\n\nIn accordance with this principle, this servant dares to lay bare this sincere heart.\n\nThe ancient sages offered sacrifices to Heaven in the wilds and to Earth in the open, gazing in reverence toward mountains and rivers. The former sages bequeathed these rites in their external counsels, and later sages upheld them to perfect virtue. As for invoking the Five Elders to pray to the Great One, summoning the Eight Numinous Ones to attract the Six Spirits—these mysteries were already expounded in the inner teachings, and the luminous decrees followed to propagate the Dao. Ranks and positions are ordered, their wonder lying in the absence of deviation.\n\nThus, in offering and cultivation, one acts according to intent, presenting gifts in due season. The noble do not disdain abundance, nor do the humble restrict themselves to frugality.\n\nAzure silk adorned with *lin* and *feng* birds, jade-like wine and nectar of jasper—these are the provisions of those who ascend to the heights, not the means of the lowly and impoverished.\n\nAs for the offerings of swans and egrets to the Supreme Emperor, or the tender *ping* and *zao* herbs presented to the august deities—these are not rites this humble servant may perform, nor are they the ultimate expression of this sincere devotion.\n\nThis humble servant, though impoverished, has prepared according to the law offerings of wine, dried meats, salt, and fermented beans, and kindled lamps to illuminate and invoke the radiant numen. I burn incense to ascend my prayers, hoping for a response. Thus, I purify my body and spirit, entrusting my fate to the Mysterious Ultimate, exhausting the cinnabar sincerity of my devotion, undeterred by the meagerness of these humble offerings.\n\nI humbly beseech the luminous spirits, the great sages, the perfected and august deities to bestow their compassionate protection and fulfill my earnest supplications. This servant fears that my transgressions are grave while my merits are slight, that I may soon suffer calamity and affliction, my life imperiled, my descendants lost, and all my aspirations thwarted.\n\nNow, relying on the Mysterious Perfection to bring good to completion without abandonment, I have meticulously cleansed myself, washing body and heart, offering myself first to atone for all transgressions.\n\nFrom the beginningless world through countless kalpas, I have transmigrated without cease—now as man, now as woman—until this present life. At times, my nature has been base and obscured, my resolve reckless and wild. I have failed to believe in the Great Dao, failed to revere the divine. As a child, I was unfilial; as a father, unkind. As a ruler, I lacked the Way; as a minister, loyalty. As an elder brother, I was unfraternal; as a younger, discordant. As an elder, I was careless; as a youth, irreverent. As a teacher, I was disrespected; as a disciple, negligent. As a friend, I was unrighteous; as a companion, insincere. As an aunt, I was unkind; as a wife, irreverent. As a mother, unloving; as a sister-in-law, undutiful. To my maternal uncles, I was disrespectful; to my paternal uncles, unbenevolent. To my sisters-in-law, I was unyielding; to my concubines, arrogant. With my spouse, I was disharmonious; among my children, unjust. Within, I was restless; without, unclear. To my superiors, I was unruly; to my subordinates, impure. To the lowly, I was insolent; to the noble, corrupt. As a man, I was unclean; as a woman, unchaste. I failed to grasp the principles of righteousness, failed to comprehend the subtle wonders. I was ignorant of the Mysterious Origin, entangled in worldly affairs, my thoughts mired in the dusty paths, forgetting to transcend the sea of俗. The five passions and six desires disturbed my spirit; the three poisons and seven accumulations confounded my heart. My deeds lacked focus, my choices were inconsistent, my conduct wavering. Heretical thoughts filled my mind, the Dao’s influence waned, and the world’s standards crumbled. My body and years declined, my transgressions accumulated daily. In action, I disregarded benefit; in stillness, I neglected precepts. Profound blessings and great goodness I never considered; vast calamities and grievous evils I committed day and night.\n\nAt times, in urgency, I briefly upheld the Dao, only to forget the True when circumstances eased. I acted perversely, indulging my will without restraint. Sometimes, I relied on power and influence, wielding authority with arrogance. At others, I undermined the Dao and corrupted virtue, harming rulers and kin, destroying scriptures and diagrams, assaulting my teachers, injuring my peers, slaughtering friends, oppressing all beings, and scorning the spirits. I desecrated tombs, opened coffins, mutilated corpses, punished ghosts, disturbed bones, and startled the dead, causing pain to my companions and distress to heaven and humanity. I hacked at spirit tablets, burned shrines, secretly plotted rebellion while outwardly feigning obedience. I envied those superior to me, slandered the loyal and steadfast, unleashed cruelty, suppressed the worthy, abandoned friends, tormented my homeland, slandered the good, mocked the talented, hoarded for myself, and refused to give to others. I seized from all quarters to enrich myself alone, devoured the people’s livelihood, and extorted in myriad ways, never satisfied, encroaching upon gods and men.\n\nAt times, I exploited my status or wealth to bully the lowly and orphaned, or seized what others loved, severing the six relations, cutting off kin, and isolating neighbors. I violated the nine degrees of kinship, indulged in myriad perversions, lost all restraint, schemed without scruple, cursed others, and falsely accused the virtuous. I railed and reviled, invoking ghosts and spirits, pointing at the sun and moon, and lodging complaints with the stars. I encouraged others to do evil, failed to teach the young, acted recklessly in darkness, and watched others succeed or fail. I indulged in lust and wine, adorned myself for vanity, my heart and mind inverted, my nature coarse, cruel, and violent. My laughter and tears were erratic, my conduct unchecked. I struck out in all directions, overturning all before me. At times, my hands committed violence; at others, I abetted others’ cruelty. I recklessly offended gods and men, disturbed the pure and tranquil, and arrogantly defied the luminous spirits. I criticized the scriptures and teachings, slandered the true Dharma, betrayed promises, deceived with cunning, flattered with seductive words, and fawned with insincerity. I was wrathful and resentful, cruel and domineering, arrogant and overbearing, my greed growing daily. I gambled for victory, mocked the weak, deceived the court and the countryside, and ridiculed the inner chambers. Outwardly, I feigned integrity while inwardly harboring treachery, manipulating right and wrong to advance my ends. I forcibly claimed the stars, boasted of my divination, falsely predicted fortune and misfortune, and acted duplicitously, praising to the face and slandering behind the back. With honeyed words and false smiles, I misled my homeland and disrupted my ancestral state. I disrespected the virtuous, rejected loyal advice, secretly envied the excellent, and covertly harmed the capable. I impersonated gods and spirits, falsely invoked the celestial, spoke deceitfully, and bewitched the people, stirring heaven and earth, startling the divine. I blocked roads, separated mother and child, obstructed the good, and suppressed the virtuous. I stockpiled medicines to wish illness upon others, hoarded coffins to await their deaths, disparaged others’ learning while praising my own, fabricated empty doctrines, and misapplied a single method, failing to grasp the subtleties of transformation and harboring doubts. I used public office for private gain, misled later generations, delighted in foulness, and shunned purity. I galloped in the hunt, cursed the wind and rain, committed robbery and theft, and shot arrows at heaven and earth.\n\nMy transgressions—whether hidden or manifest, mortal or spiritual—are known throughout the unseen and visible realms. I have defied reason, violated the scriptures, broken the laws and precepts. Above, I have betrayed the Three Luminaries, the Four Seasons, and the Five Phases; below, I have offended the myriad phenomena, the Nine Palaces, and the Six Jia. In between, I have disturbed the local deities, the spirits of tombs and dwellings, the souls of my ancestors, the hearth and gate gods, the spirits of roads and thresholds, and all the deities of the paths I have trodden. Wherever I have gone, I have neglected sacrifices, violated harmony, and broken prohibitions, accumulating transgressions in every place.\n\nShould some transgressions be committed knowingly, others by unwitting error; some under coercion by others, others self-wrought in body and mind; some endured without remorse, others repented yet unatoned; some atoned yet repeated, never fully reformed; some long exiled by fate’s probing, never truly reformed; some accrued day by day, month by month, boundless and immeasurable, beyond full recounting—\n\nOr entangled by kinship, tainted by inner and outer influences, where men and women, young and old, all kinfolk, in past lives and this, share in guilt, each leading the other astray. Some conspire together, some act at the behest of superiors, some bound by mutual pledges, sowing the roots of sin in others, their karmic ties unseen.\n\nOr wavering in resolve, failing trials, incurring the wrath of gods and ghosts, entangling masters and disciples in misfortune; old grudges unresolved, new faults compounding, growing ever more intricate.\n\nOr once enslaved, made to serve Hu, Yi, Man, Mo, Rong, Di, Qiang, fish and birds, insects and beasts, demons and malevolent spirits—creatures coarse and vile—devouring one another in endless cycles of vengeance unfulfilled.\n\nThe offenses listed here are but a fraction, unending through kalpas, beyond memory or reckoning. Whether committed or not, one cannot discern, for all are recorded in the Two Palaces and the Seventy-Four Bureaus, their cases reviewed by the Three Primes and the One Hundred Twenty Offices. With guilt so deep, judgment lies beyond measure—fearing that in a single day, one may return to dust, and even minor matters may fall short of worldly expectations.\n\nNow, I entrust my fate to the Nine August Great Sage Honored Deities, beseeching their supreme virtue to bestow protection. May they grant compassion, commanding the Envoys of the Five Peaks to dispatch their agents, tracing the roots of my transgressions to dissolve all records of guilt and entanglements, pardoning my exile, severing the roots of evil, washing away accumulated offenses and burdens. May they guide my faithful heart, open the path of goodness, let the flow of upright qi flourish, and grant the protection of noble spirits.\n\nMay all my past offenses be cleansed, present faults erased, and future wrongs never arise. May my resolve to do good grow daily, my aspiration for higher learning never wane, and my study of scriptures and precepts begin anew from this day.\n\nMay the Lords of the Three Realms, the Five Emperors, the Six Jia, the Nine Palaces, and the Mystic Continent’s Cavern Masters, along with the countless immortals and sages, all benevolent spirits, heed my plea. Take note of my earnest repentance, pity my resolve to renew myself, accept my vow to encourage goodness, and fulfill my sincere devotion. May the Overseers of the All-Heaven Judgment Bureau, the Bureaus of Longevity and Fortune, together erase my name from the Black Register and inscribe it in the Azure Script. May all disasters be averted, my lifespan extended, and lasting blessings secured for my family’s prosperity. May malevolent omens dissipate, all good wishes be granted, dreams be true, tombs and dwellings peaceful, calamities cease, and inner and outer realms harmonize—revealing the efficacy of the mysterious and divine, repaying my deepest hopes.\n\nNow, as I continue my words, let them remain measured and concise.\n\nI offer wine once more, thrice in all.\n\nI, [Name], humbly address the Nine August Honored Deities, the Seven Illustrious Spirits, and all the righteous gods. Born of humble origins in the mundane world, untrained in subtle Dharma, I fear my offerings may lack propriety, my words coarse and excessive, offending your majesty, my conduct violating ritual, my actions deeply flawed. I dread failure and the return of blame.\n\nMay your luminous spirits graciously look upon me with compassion, pitying my inadequacies, fostering my good intentions, and sparing me from punishment. May past offenses be pardoned, and all my wishes fulfilled.\n\nShould I have further desires, I shall express them as I will.\n\nFrom the day I receive your grace, I shall offer sincere rites as prescribed, just as tonight.\n\nI prostrate myself, praying that the luminous great spirits and all true officials bestow their compassion, guiding me toward goodness, delighting in my devotion. May all my petitions and wishes be heard, and tonight’s pleas granted as my heart desires—so that I may forever bear the boundless grace of your renewal.\n\nNow, I beseech your vast blessings to saturate my being. I offer the remaining wine, asking you to drink and let the divine qi descend upon me, fulfilling my good intentions.\n\nI take this cup of wine, belonging to the star governing my life, and drink it.\n\nI, [Name], address the Nine August Great Deities, the Illustrious and Exalted, the Lords of Dao and Virtue, and all benevolent spirits. Regarding [Name]’s matter of [specific request], bound by Dao and righteousness, I have presumptuously entreated your majesty to witness my plea for some time. I dare not delay your divine presence further. May you return to your respective offices, settle your spirits, and resume your thrones, bestowing divine grace to extend blessings and longevity. I command the local earth deities, the household spirits, the officials of halls and chambers, to safeguard [Name] and myself, permanently erasing our accumulated sins and renewing our fortunes. May all requests be granted as stated, all wishes fulfilled, and my devotion never in vain. Should future petitions arise, I humbly await your return.\n\nI, [Name], in awe and reverence, bow twice in prostration.\n\nSend off the deities in due order, bowing as you do.\n\nWhen sending off the deities, one may simply bow twice, then kneel and kowtow, beseeching the grace of their ascent. If further words are needed, speak them privately as you wish, then rise and close the incense burner.\n\nIf the ritual follows immediately after the matter’s resolution, do not close the incense burner; instead, proceed with the offering. After the offering concludes, then close the incense burner.\n\nUpon completing the offering, pour a small amount of the first cup of wine onto the ground—no need to empty it.\n\nIf treating an illness, take the cup belonging to the patient’s governing star and let them drink.\n\nIf no illness or misfortune afflicts others, have them all step outside, perform rites of respect, and present the wine.\n\nDo not involve strangers or arouse suspicion, lest both parties incur offense.\n\nOnly those known and trusted without doubt may partake.\n\nIf, after the matter’s resolution, a separate offering is held at another time—whether for oneself or another, to seek blessings or grace—once the invocation of spirits concludes, strike the teeth and open the incense burner.\n\nIf entering the altar hall, rinse and recite the incantation according to the proper method.\n\nFor those whose cultivation is shallow and who have not yet received the transmission of sacred texts from the Dao, they may mutually initiate and guide one another, establishing virtue and merit. On an auspicious day and at a propitious hour, they may pray for profound grace, first giving thanks for past transgressions.\n\nLife arises from the nine *qi*, completion from the nine heavens, learning from the nine disciplines, and rank culminates in the nine grades. Immortals and sages each possess their own scriptures and methods; if one’s practice is incomplete, one cannot avoid fault. Whatever one undertakes must begin with repentance for sins, and only then will grace and protection arrive unbidden.\n\nTo seek blessings, proceed from the subtle to the manifest—thus, begin with *Yangming* and proceed to the *Fubi*. To remove transgressions, proceed from the manifest to the subtle—thus, begin with the *Fubi* and proceed to *Yangming*. The efficacy of repentance lies in its sincerity; the opening words must convey the ebb and flow of intention. When receiving tasks or seeking grace, follow the original decree from the celestial court. The primary repentance should be uniform, and the rites of welcoming and sending off should not differ. In times of peril, the repentance may be abbreviated.\n\n**Essential Methods for Observing the Stars**\n\nAfter receiving the taboo names of the Nine August Ones, on a clear night, invoke the heavens and diligently observe the Northern Dipper. Visualize and memorize the order of the stars, their inner and outer names, and imagine the descent of the deities, speaking with them in your mind. Next, seek the *Fubi* stars, striving to perceive their forms. With focused concentration and reverent gaze, you will eventually behold them.\n\nThe observation of stars must be kept secret; do not let others know. If questioned, respond vaguely. Do not reveal anything, whether you see them or not—utter no word of it. Only the heart and eyes may share this knowledge.\n\nWhen observing the stars, purify your body and *qi*. If defiled, bathe; if impure, change your garments. Clothing should be fragrant, and both inner and outer aspects immaculate. Where incense burns, invoke the mysterious spirits. Study the scriptures and charts carefully, memorizing them clearly before gazing outward. Do not speak carelessly or boastfully, and do not gather many people—only two or three like-minded companions. If a companion lacks the proper resolve, do not observe with them; each should practice separately, without visiting or inquiring of one another.\n\nIf fatigued, intoxicated, sated, or after conjugal union, or if one’s *qi* is unsettled, do not look upon the stars. Furthermore, if offerings, repentance rites, prostrations, or prayers for grace yield no signs over time, it is due to a lack of observation. Though one may not yet see the stars, sincerity and devotion will gradually bring results. Persist without slackening, and you will surely attain clarity. Once seen, the deities will descend, the offerings will prove efficacious, and boundless aid will follow. If one does not diligently study and observe the stars with a focused mind, demonic forces may assail them, inauspicious omens arise, and offerings will be wasted, laboring in vain while incurring transgressions. Those of resolute intent should take heed and be warned.\n\nThe nine stars govern distinct regions, and their configurations foretell fortune or misfortune in travel, residence, and all undertakings. Both Daoists and laypeople must examine them carefully to determine what is fitting, whether to proceed or withdraw, to transform failure into success, to seek the worthy and find them, to consult the sagely and encounter them. All actions will be upright and enduringly auspicious.\n\nIn serving the Nine August Sovereign Lords, whether by day or night, in movement or stillness, eating, drinking, or conjugal union, constantly visualize their presence. In every posture and gesture, never forget them. After nine years, the deities will descend, and you will receive the secret of eternal life.\n\nThe center of the heavens is called the Northern Asterism, comprising five stars. The first, the great star, is named *Tianshu* (Celestial Pivot), the Mother. The second is the Son, the third the Crown Prince, the fourth the Second Son, and the fifth is called *Beiji* (Northern Pole), born of *Tianyi* (Heavenly One). *Taiyi* (Great One) resides in the Purple Palace. To the east of the Purple Palace are eight stars, to the west seven, arrayed as vassal ministers. At its center lies the Purple Tenuity Palace, where *Taiyi* dwells, governing the five officials and the twenty-eight constellations. The five planets—Metal, Wood, Water, Fire, and Earth—correspond to the five stars, and the five stars correspond to the five phases. The Northern Dipper belongs to *Taiyi*, and *Taiyi* is the Pole, occupying the most exalted position.\n\nThe nine stars of the Northern Dipper guard *Taiyi*, and their auspices—whether fortunate or ill—are determined as follows:\n\nThe Northern Pole is the hollow center of the heavens. The Northern Pole lies south of this hollow, and the hollow lies north of the Northern Pole, hence it is called the Northern Asterism, around which all stars revolve.\n\n1. The first star is the head of the Dipper, named *Tianshu* (Celestial Pivot), also called the *Zhengxing* (Principal Star) or *Tanlang* (Greedy Wolf). It holds the position of Imperial Censor and represents the heavens and the sun, governing yang virtue and symbolizing the Son of Heaven. Its domain is *Xuzhou*, corresponding to the constellations *Bishu*, *Kui*, and *Lou*, and it governs the fifth earthly branch (*chen*), associated with Jupiter.\n\n2. The second star is *Dixuan* (Celestial Rotator), also called the *Faxing* (Law Star) or *Jumen* (Great Gate). It holds the position of Grand Marshal and represents the earth and the moon, governing yin punishment and symbolizing the Queen. Its domain is *Liangzhou* (later divided into *Yizhou*), corresponding to the constellations *Wei*, *Mao*, and *Bi*, and it governs the fifth branch (*hai*), associated with the Grand White Star.\n\n3. The third star is *Renji* (Human Axis), also called the *Mingxing* (Life Star) or *Lucun* (Salary Storage). It holds the position of Chamberlain for the Palace Revenues and represents humanity, governing calamities. Its domain is *Jizhou*, corresponding to the constellations *Shen*, *Jing*, *Gui*, and *Liu*, and it governs the fifth branch (*xu*), associated with Mars.\n\n4. The fourth star is *Wuquan* (Material Balance), also called the *Faxing* (Punishment Star) or *Wenqu* (Literary Curvature). It holds the position of Minister of Education and Grand Master of Ceremonies and represents the four seasons, governing the punishment of the unrighteous. Its domain is *Jingzhou*, corresponding to the constellations *Qixing*, *Zhang*, *Yi*, and *Zhen*, and it governs the fifth branch (*mao*), associated with Mercury.\n\n5. The fifth star is *Yuheng* (Jade Balance), also called the *Shaxing* (Execution Star) or *Lianzhen* (Upright Integrity). It holds the position of Grand Herald and governs the execution of the guilty. Its domain is *Yanzhou*, corresponding to the constellations *Jiao*, *Kang*, *Di*, and *Fang*, and it governs the fifth branch (*chen*), associated with Saturn.\n\n6. The sixth star is *Kaiyang* (Opening Yang), also called the *Weixing* (Danger Star) or *Wuqu* (Martial Curvature). It holds the position of Commandant of Justice and governs the sustenance of grain. Its domain is *Yangzhou*, corresponding to the constellations *Xin*, *Wei*, and *Ji*, and it governs the five colors, associated with Jupiter.\n\n7. The seventh star is *Yaoguang* (Luminous Jade), also called the *Buxing* (Department Star) or *Pojun* (Breaking Army). It holds the position of Commandant of the Capital and governs warfare. Its domain is *Yuzhou*, corresponding to the constellations *Dou*, *Niu*, *Nü*, *Xu*, and *Wei*, and it governs the fifth branch (*wu*), associated with Venus.\n\n8. The eighth star is the *Waifu* (Outer Assistant), located below the sixth star of the Northern Dipper, approximately one *cun* away.\n\n9. The ninth star is the *Neifu* (Inner Assistant), a single star above the third star of the Northern Dipper, which is not ordinarily visible. If seen, it portends the attainment of divine sagehood.\n\nWhen divining the eight stars, examine their positions within their domains. If a star’s position portends disaster or its domain suffers harm, one should avoid it. For minor afflictions, perform exorcisms, cultivate merit, establish rites, and offer repentance to invoke grace—all in secret, without speaking of it. Thus, misfortune will dissipate, and blessings will gather.\n\nVirtue is the myriad of good deeds. Though the myriad practices bear myriad names, their essentials number nine: first, refraining from killing; second, refraining from licentiousness; third, refraining from falsehood; fourth, refraining from theft; fifth, refraining from perversity; sixth, refraining from wrath; seventh, refraining from envy; eighth, refraining from arrogance; ninth, refraining from stagnation. These are the Nine Virtues, possessed by those who attain the Dao.\n\nThe Nine Meritorious Deeds are these: first, releasing life and rescuing the dying; second, rewarding chastity and encouraging purity; third, offering loyalty and demonstrating trustworthiness; fourth, bestowing alms and eliminating greed; fifth, moderating wine and upholding integrity; sixth, reconciling disputes and admonishing strife; seventh, prohibiting villainy and halting jealousy; eighth, respecting and loving both high and low; ninth, alleviating sorrow and resolving distress. These are the Nine Meritorious Deeds, impartial and selfless.\n\nMerit is cultivated outwardly, while virtue is established inwardly. With inner foundation and outer practice, the divine will surely descend upon you in secret. Those of exceptional talent and diligent practice may verify this in silence; transmit it only to those of like mind, and reveal it to no others. Observe the differences, and let your heart discern their significance. By this method, the efficacy of past and present may be known. Those lacking merit and practice will perceive it dimly, or their eyes may be deceived by malevolent spirits, seeing what seems but is not—proclaiming misfortune as fortune, or fortune as misfortune—contradicting the scriptures. In such cases, one should reflect on one’s transgressions and repent inwardly before observing again.\n\n1. The first is the Lady of the Supreme Palace, the Hidden and Concealed Consort of the Primordial, surnamed Yanming, with the taboo name Taiyi Fatǎn, styled Xing Zhengfu. Her true name is [omitted]. She wears a yellow brocade mantle and a vermilion-and-indigo flying skirt, her hair bound in a cloud-like topknot—later eight topknots are the same.\n\n2. The second is the Lady of the Middle Prime Palace, the Womb-Protecting and Form-Transforming Consort, surnamed Kaiguan, with the taboo name Taiyi Sanlai Píng, styled Luozhu Ying. Her true name is [omitted]. She wears a blue-green brocade mantle and a green-feathered flying skirt.\n\n3. The third is the Holy Mother of the True Prime Palace, Mistress of the Six Concealments and Seven Hiding-Places, surnamed Mingmeng, with the taboo name Taiyi Lingyi, styled Chong Shuangzhao. Her true name is [omitted]. She wears a blue-green brocade mantle and an embroidered-feather patterned skirt.\n\n4. The fourth is the Lady of the Hidden Light Palace, the Concealing Radiance and Veiling Brilliance Consort of the Middle Prime, surnamed Kaoyao, with the taboo name Taiyi Qilie, styled Heng Danpan. Her true name is [omitted]. She wears a purple brocade mantle and a yellow-flowered feathered skirt.\n\n5. The fifth is the Great Maiden of the Net-Spirit Palace, the Body-Transforming and Brilliance-Altering Maiden of the Dipper’s Center, surnamed Xuanlu, with the taboo name Taiyi Yushu, styled Chou Qiulan. Her true name is [omitted]. She wears a vermilion brocade mantle and a purple-and-indigo flying skirt.\n\n6. The sixth is the Middle Maiden of the Bright Record Palace, the Concealing Traces and Dispersing Brilliance Maiden of the Dipper’s Center, surnamed Feilian, with the taboo name Taiyi Qijing, styled Baoding Ling. Her true name is [omitted]. She wears a vermilion brocade mantle and a blue-green embroidered flying skirt.\n\n7. The seventh is the Youngest Maiden of the Barrier Assembly Palace, the Multiform and Brilliance-Dividing Maiden of the Dipper’s Center, surnamed Wengchong, with the taboo name Taiyi Yumo, styled Tian Fan Shu. Her true name is [omitted]. She wears a cinnabar brocade mantle and a blue-green-flowered feathered skirt.\n\n8. The eighth is the Left Lady of the High Emperor’s Seat Palace, the Sun-and-Moon-Transforming and Water-and-Fire-Transforming Consort of the Dipper’s Center, surnamed Changming, with the taboo name Taiyi Shiqizhu, styled Luomaohua. Her true name is [omitted]. She wears a purple brocade mantle and an embroidered-feather flying cinnabar skirt.\n\n9. The ninth is the Right Lady of the Supreme Venerable Palace, the Metal-and-Stone and Mountains-and-Rivers-Transforming Consort of the Dipper’s Center, surnamed Konghuang, with the taboo name Taiyi Aixiu, styled Yun Yuxuan. Her true name is [omitted]. She wears a green brocade mantle and a kingfisher-feather patterned skirt.\n\nThe above are the Nine Imperial Lords and the Nine Hidden Consorts of the Dipper’s Central Palace, along with their Yin names. When invoking or reciting them, mention only their titles and names, without describing their attire, mantles, or hairstyles.\n\nIf you can master the Nine Yin [names] of the Imperial Lords, you will ascend at dawn to the heavens and be enfeoffed as a Perfected One of the Highest Clarity. Throughout your life, you will be spared the disasters of mourning and calamity. The spirits of the Great Yin will guard and attend you, and the myriad numinous beings will bow in reverence. You will divide your form and disperse your transformations, merging with Heaven and Earth.\n\nThese Nine Ladies of the Great Yin are the Yin officials and spirits of the Imperial Lords. If you practice the Dao, untie karmic knots, present talismans to the celestial registers, pacify the hun-soul, control the po-soul, transform and generate the body’s spirit and qi, and refine essence to seek longevity—yet remain ignorant of the names of the Imperial Consorts and fail to practice the Nine Yin to achieve union—you will never attain immortality.\n\nOne *cun* inward from the space between the eyebrows lies the Hall of Light, a perfect square of one *cun*, where the Nine Yin Consorts of the Imperial Lord constantly reside. Always on the even days of the month, during the hours of living qi, burn incense and enter a separate chamber. Sit or recline as you wish, close your eyes for a long while, and visualize the Imperial Lord seated in the Purple Chamber of the Supreme Ultimate. Then visualize the Five Spirits of Taiyi within the Six Harmonies, the Nine Stars of the Northern Dipper within your heart, and the Nine Yin Consorts within the Hall of Light. Next, visualize the Luminous Essence Lad of the Grand Tenuity standing before the Imperial Lord, the lad holding the Five Talismans in his left hand and the Five Registers in his right. Then visualize your own form standing behind the lad. Afterward, visualize the Nine Yin Consorts ascending from the Hall of Light into the Purple Chamber of the Supreme Ultimate, standing in a horizontal line behind you in order. Then visualize the Five Spirits of Taiyi ascending from the Six Harmonies into the Purple Chamber of the Supreme Ultimate, standing in a horizontal line behind the Nine Yin Consorts.\n\nOnce all is complete, the Imperial Lord and the host of spirits suddenly merge into one, transforming into a single being resembling a newborn infant, named the Eternal Lad, styled Transformation. In his left hand he holds the Nine Stars, on his head he wears the sun, and in his mouth he holds the moon. The lad illuminates your entire body with the light of the sun, moon, and Nine Stars, penetrating you inside and out. You will feel your body suffused with red, ablaze like fire, with no distinction between inner and outer—all radiant and luminous.\n\nThis is the myriad transformations of the Imperial Lord, Taiyi, and the Nine Yin in union. After a long while, conclude by knocking the teeth twenty-four times and swallowing saliva nine times. Then softly intone the incantation:\n\n\"Radiant spirit of the Grotto-Heaven,\nrevolving and illuminating the Purple Clarity,\nNine Mornings of the Dark Yin,\nconcealed and submerged in the unfathomable.\nLadies of the Dipper’s midst,\nThree Maidens dispersing their forms...\"\n\nThe divine consorts transform within, and the myriad things instantly take form. Lightning flashes and thunder crashes, clouds and mists flow like ringing bells. Nine transformations and ten evolutions give rise to cinnabar and bring forth verdant hues. The Nine Maidens of Taiyi unite in harmonious fusion, while the Lad of Impermanence roams freely, vanishing into the void and weaving through the obscure.\n\nAdorned in brocade capes and resplendent sleeves, their skirts of purple feathers take flight. To their left, they bear concealed talismans; to their right, tiger-patterned sashes. They hold the Dipper in their mouths and wear fire upon their heads, grasping the banner of absolutes. Beside them, they command the Eight Winds, and from all four directions, they draw forth radiant clouds. Roaming the celestial net, they dissolve the Seven Origins, concealing mountains and rivers. They turn the Five Celestial Bodies, eclipsing the sun’s brilliance, and the constellations lose their true forms.\n\nDividing into a hundred shapes, their transformed bodies enter a thousand. In fire, they become fire; in forests, they become forests. In water, they become water; in mountains, they become mountains. What is sought arrives in an instant; what is summoned appears before one. In the blink of an eye, desires are fulfilled, and with a glance, all is attained. A thousand kinds and ten thousand things follow the heart’s command.\n\nThe Imperial Lord takes form, and the Supreme Jade Clarity of Tai Shang shares the same radiance. The Primordial Hero and the Four Scripts of White Origin endure with heaven and earth, preserving and nurturing my body. Whatever the mouth utters, transformations follow intent. Jade lads attend in service, jade maidens hold towels, divine consorts offer incense, and the Four Perfected share the same carriage. Every matter and thing conforms to my words.\n\n*The Inner Mystery Scripture of the River Chart of Supreme Clarity* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上清河图内玄经 经名：上清河图内玄经。 撰人不详，约出於东晋南期。 系早期上清派经典。 有太一密讳、河图九皇宝箓、观星要法等篇。 二卷。 底本出处：《正统道藏》正一部。 上清河图内玄经卷上 玄师圣匠#1，代代相传，感至斯盛，光歇兹泯，往返善恶，一废一兴，沈而更举，绝而重联，悠悠骄慢，永隔良因，专专谨密，增长善绿，缘善能感，玄应重臻，臻则有异，异则通神，神师灵典，秘字要文，自然降见，荡垢消尘，嘿识遵奉，长生神仙，济身救物，三乘互陈，幽显无弃，不顺自沦，沦苦可痛，各宜畏旃，慎终如始，乃合道焉。 凡自然真文，皆空中本有，是以或飞或沈，或隐或显，龙马龟鱼，所负图象，皆生无始，随感现出，出现参差，唯善是与。 得之者在后，其文久在前，今之所得，得与者同，悉金玉简札，镂写秘藏，谙忆究解。 存诵修行，亦以缣素，朱书佩身，备有遗忘。 急则寻详，行之消灾，却祸延福，久习不怠，登圣真仙。 师资斋洁，启玄告灵，非人忽传，妄泄殃深，明各加慎，密而遵承也。 太一秘讳二 太一者，道之子也。 道应物之感，现神生一，一神接导，生成一切，无穷无极。 为学之先，先觉习此，以成至真，真圣相传，以引后学。 后学后觉顺从，与先为一，与先为一，乃与道同。 三才五德，九皇尊灵，变化之所起，救群品所资，此太一、三五及九神，道之源极也。 一则总统幽显，为无象之宗，二则玄元始交气，为天地人，人有利钝平，天地应之为三品，离合为五，三三合九，变化备具，炼无炼有，有无洞达，由乎至人。 人法地，地法天，天法道，道法自然。 三才有形，堪能行道，行道究竟，阶同自然，差次虽五，共归一源。 故太一之神，最尊最贵，生天立地，成人物也。 凡不受河图本源，不佩真字，不识本源太一，不存五神，不守三一，不事九皇，皆不得行大谢。 大谢请召，启告周徧，尊极灵讳，内神隐名，不经师受，慎勿妄修。 修用宜受，受之诣师，而因缘得文，当依玄盟之仪。 依玄盟之仪，人不可妄作一法，强冒行之。 行之得罪，陷己误人。 必愿奉行，当密寻明师，及觅玄盟之仪，精心洁己，自然相遇。 依科先具启告，表奏既竟，设醮献诚，唯谨唯密，有违则考臻，能勤能笃，久顺则福至，福至积德，与道俱存。 太一尊神，讳务犹收，字归会昌，一名解明，一名寄频。 因缘积善，遇此真讳，密识心存，动静潜咒，乞愿所求，随心愿念，不得告人。 若非其人，彼此得罪。 欲免罪期福，嘿识存之，恒见太一尊神光象，炜烨异常，在己左右，或坐或行，缓急日夜，谛存不忘，则凶消吉至，久必对言，言合形同，共为一也。 不能昼夜恒存者，可夕存之，在己身六合宫中。 入两眉间却入一寸为明堂，二寸为洞房，洞房南，明堂北，是六合宫，上有太极宫。 太一昼居太极，夜居六合也。 常能存此，功行日新，魔不敢犯。 若不知太一，空行功德，为邪所破，德业无成矣。 学者求成，存一为急也。 九皇宝箓三 第一阳明星，玉皇九晨君。 天枢星，此阳明之魂神也，对阳明西北门，上真皇夫人。 第二阴精星，玉皇北上晨君。 天旋星，此阴精之魂神也，对阴精西门，上玄皇夫人。",
      "translated_text": "**The Supreme Clarity Inner Mystery Scripture of the River Chart**\n\n**Scripture Title:** *The Supreme Clarity Inner Mystery Scripture of the River Chart*. Author unknown, approximately composed during the mid-to-late Eastern Jin dynasty. A foundational scripture of the early Supreme Clarity tradition. Contains sections such as *The Secret Taboo Names of the Great One*, *The Nine August Treasure Registers of the River Chart*, and *Essential Methods for Observing the Stars*. Two scrolls in total. Source of base text: *Daoist Canon of the Zhengtong Era*, Orthodox Section, Part One.\n\n---\n\n### *The Supreme Clarity Inner Mystery Scripture of the River Chart, Scroll One*\n\nThe mysterious masters and sagely artisans, transmitting from generation to generation, have sensed this flourishing age. When its radiance wanes and fades, the cycles of good and evil alternate—now declining, now rising; sinking, then reviving; severed, yet reconnecting. Arrogance and negligence forever sever good causes, while single-minded reverence and secrecy nurture the growth of virtue. Through virtue, one may perceive the Dao’s response, and where the response gathers, anomalies arise. Anomalies lead to communion with the divine, and divine masters bequeath sacred texts—secret graphs and essential writings—naturally manifesting to cleanse filth and dispel dust. Silent recognition and adherence bring longevity and transcendence, delivering the self and saving all beings. The Three Vehicles unfold in mutual exposition, neither the hidden nor the manifest discarded. Those who defy the Dao sink into ruin, and the suffering of ruin is grievous. Each should heed this warning, remaining vigilant to the end as at the beginning, for only then do they align with the Dao.\n\nAll natural true writings exist inherently in the void. Thus, they may soar or sink, conceal or reveal. Dragons, horses, tortoises, and fish bear the charts and images, all born from the beginningless, emerging in response to karmic resonance. Their manifestations vary, yet only virtue is their companion. Those who attain them come later, though the writings have long preceded them. What is obtained today is shared with those who receive them—all inscribed on jade and gold tablets, meticulously carved and secretly preserved. Mastery comes through recitation, memorization, and profound understanding. Through recitation and cultivation, one may also transcribe them in cinnabar on silk, wearing them on the body to guard against forgetfulness. In urgency, one may consult them, and their practice dispels calamities, averts misfortune, and extends blessings. With unwavering diligence over time, one ascends to the ranks of sagely transcendents.\n\nDisciples must maintain purity and reverence when invoking the mysterious and petitioning the divine. These teachings must never be rashly transmitted to the unworthy, for reckless disclosure invites profound misfortune. All should exercise caution, upholding secrecy and adherence.\n\n---\n\n### *The Secret Taboo Names of the Great One (II)*\n\nThe Great One is the child of the Dao. When the Dao responds to the resonance of beings, it manifests the divine and generates the One. The One, through divine guidance, gives rise to and completes all things, boundless and infinite. For learners, the first step is to awaken and cultivate this, thereby attaining utmost authenticity. Authentic sages transmit it to guide later learners. Later learners, through compliance and awakening, unite with those who came before, and in this unity, they merge with the Dao.\n\nThe Three Powers, the Five Virtues, and the nine august numinous spirits arise from transformation and serve as the foundation for saving all beings. This Great One, the Three and Five, and the Nine Spirits are the ultimate source of the Dao. The One governs both the hidden and the manifest, serving as the origin of the formless. The Two represents the primordial exchange of qi, giving rise to Heaven, Earth, and Humanity. Humanity possesses varying degrees of acuity, and Heaven and Earth respond accordingly, forming three grades. Separation and union produce the Five, and the tripling of three yields the Nine, wherein all transformations are complete. Refining the insubstantial into the substantial, and penetrating the interrelation of being and non-being, all depends on the perfected person.\n\nHumanity follows Earth, Earth follows Heaven, Heaven follows the Dao, and the Dao follows spontaneity. The Three Powers possess form and are capable of practicing the Dao. Through practicing the Dao to its ultimate end, one ascends to the level of spontaneity. Though their ranks differ, all share a single source. Thus, the spirit of the Great One is most revered and exalted, giving birth to Heaven and establishing Earth, and bringing forth all beings.\n\nThose who do not receive the original source of the River Chart, do not wear the true graphs, do not recognize the primordial Great One, do not preserve the Five Spirits, do not uphold the Three Ones, and do not serve the Nine August Ones shall be unable to perform the Great Petition. The Great Petition’s invocations and supplications must encompass all directions. The most exalted and sacred taboo names, the hidden names of the inner spirits—without receiving them from a master, one must not rashly practice them. Practice should follow proper transmission, and transmission requires seeking a master. When the karmic conditions align to receive the text, one must adhere to the rites of the Mysterious Covenant.\n\nUnder the rites of the Mysterious Covenant, no one may arbitrarily perform any method or forcibly undertake its practice. Practicing it improperly incurs guilt, harming both oneself and others. Those who sincerely wish to practice must discreetly seek an enlightened master and obtain the rites of the Mysterious Covenant. Purify the heart and cleanse the self, and the encounter will occur naturally. Follow the precepts to prepare the petitions, and once the memorials are presented, perform the jiao offering with utmost sincerity. Be reverent and discreet, for violations invite investigation and punishment. Diligence and devotion over time bring blessings, and accumulated blessings cultivate virtue, which endures with the Dao.\n\nThe most revered spirit of the Great One has the taboo name *Wuyou Shou*, the style *Gui Huichang*, and alternate names *Jieming* and *Jipin*. Through the accumulation of virtuous causes, one may encounter these true taboo names. Silently recognize and inwardly preserve them, reciting them in secret during movement and stillness. Whatever one seeks or desires, focus the mind and direct the intention—yet one must not reveal them to others. If shared with the unworthy, both parties incur guilt. To avoid guilt and attain blessings, silently preserve them in the heart. Constantly visualize the radiant image of the Great One’s spirit, resplendent and extraordinary, by one’s side—whether sitting or walking, in leisure or urgency, day and night. Through unwavering contemplation, misfortune dissipates and fortune arrives. Over time, one may converse with the spirit, and speech and form will merge, becoming one.\n\nThose unable to maintain constant visualization may focus on it at night, within the Sixfold Palace of the self. Enter between the eyebrows and retreat one inch to reach the Hall of Light; two inches to reach the Grotto Chamber. The Grotto Chamber lies to the south, the Hall of Light to the north—this is the Sixfold Palace, above which is the Palace of the Supreme Ultimate. The Great One dwells in the Palace of the Supreme Ultimate by day and in the Sixfold Palace by night. Constantly preserving this practice brings daily renewal of merit and conduct, and demons dare not intrude. Without knowledge of the Great One, even virtuous deeds performed in vain will be corrupted by evil, and one’s cultivation will bear no fruit. For learners seeking accomplishment, preserving the One is of utmost urgency.\n\n---\n\n### *The Nine August Treasure Registers (III)*\n\n**First:** The Yang Brightness Star, the Jade August Nine Dawn Lords. The Celestial Pivot Star—this is the spirit-soul of Yang Brightness. Opposite the northwest gate of Yang Brightness is the August Lady of the Supreme Realized Ones.\n\n**Second:** The Yin Essence Star, the Jade August North Supreme Dawn Lord. The Celestial Rotation Star—this is the spirit-soul of Yin Essence. Opposite the west gate of Yin Essence is the August Lady of the Supreme Mystery.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1232,
      "start_sentence": 0,
      "end_sentence": 45,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.74150037765503,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清河图内玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "第三真人星，玉皇主仙华晨君。 天机星，此真人魄精也，对真人东南门，元皇夫人。 第四玄冥星，玉皇玄上飞盖晨君。 天权星，此玄冥魄精也，对玄冥东门，华皇夫人。 第五丹元星，玉皇金魁七晨君。 玉衡星，此丹元魄灵也，对丹元东北门，中皇夫人。 第六北极星，玉皇北晨飞华君。 闿阳星，此北极魄灵也，对北极北门，晨华元皇夫人。 第七天关星，玉皇总灵九元北盖晨君。 瑶光星，此天关魂精大明也，天关南门，下对北极，灵皇夫人。 第八辅星，玉皇帝尊九晨君。 洞明星，此辅星魂精阳明也，对辅星西门，在天关上，帝皇夫人。 第九弼星，玉皇帝真元晨君。 隐元星，此弼星之魄明空灵也，对弼星东南门，上皇夫人。 右九皇、九夫人，应感寄星，因光示妙，引末归源。 万品多端，不离乎九，是故次第阴阳相对。 欲存神佩图，供养礼拜，思想见真，以求所愿，可精素半幅，令广一尺，长一尺二寸，以轻青为本星，以轻黑为魂魄，皇君夫人服色吐气，依如题注。 师相传所佩图文，悉不得题，准前号后录，书之如法： 某图号年太岁某月朔日时，某州郡县乡里，男女官姓名，年若干，岁字某月日生，纳音某帝子支，属某岳某星，於某州郡乡里山林馆舍，从师男女真人先生姓名，受九皇隐讳，长生不死之诀，九府灵官防卫某身，却邪纳正，同会玉帝之前，不得有违，如太玄都律令。 阳明太尉府九百二十品九亿万诸灵官、飞龙骑吏、绣衣使者、玉童玉女，九九亿亿万人。 阴精上宰府五百五十品九亿万诸灵官、飞龙骑吏、绣衣使者、玉童玉女，九九亿亿万人。 真人司命府七百七十品九亿万诸灵官、飞龙骑吏、绣衣使者、玉童玉女，九九亿亿万人。 玄冥游击府八百品九亿万诸灵官、飞龙骑吏、绣衣使者、玉童玉女九九亿亿万人。 丹元斗君府七百二十品九亿万诸灵官、飞龙骑吏、绣衣使者、玉童玉女九九亿亿万人。 北极太常府七百七十品九亿万诸灵官、飞龙骑吏、绣衣使者、玉童玉女，九九亿亿万人。 天关上帝府九百品九亿万诸灵官、飞龙骑吏、绣衣使者、玉童玉女，九九亿亿万人。 辅天尊玉帝府九百品九亿万诸灵官、飞龙骑吏、绣衣使者、玉童玉女，九九亿亿万人。 弼太帝真卿府九百九十品九亿万诸灵官、飞龙骑吏、绣衣使者、玉童玉女，九九亿亿万人。 符并朱书。 一阳明星，天之太尉，司正主非，上总九天上真，中监五岳飞仙，下领后学真人，天地神灵功过轻重。 围九百二十里，有青城玉楼据斗真人，姓上灵，讳摇天槌，九晨玉冠，青羽飞裳，执斗玄图，坐楼中。 知内讳者，玉晨下映，飞行太空。 二阴精星，天之上宰，主禄位，上总天宿，下领万灵，及学仙之人。 围五百五十里，有五色玉楼举魁真人，号北上神君，姓育婴，讳激明光，玄精玉冠，玄羽飞裳，执五色羽节。 三真人星，天之司空，主神仙，上总九天高真，中监五岳灵仙，下领学道之人。 围七百七十里，有黄台玉楼履斗真人，号主仙华神君，姓归，讳处众踖，飞晨宝冠，青羽飞裳，执斗中青箓。 四玄冥星，天之游击，主伐逆，上总九天鬼神，中领北帝三官，下监万兆。 围八百里，有朱台玉楼步中斗真人，号玄上飞盖晨君，姓冥枢，讳摇天柱，三华宝晨冠，丹锦飞裳，执命灵之节。",
      "translated_text": "**Third:** The Perfected Person Star, the Jade August Lord of Immortal Florescence. The Celestial Mechanism Star—this is the essence-spirit of the Perfected Person. Opposite the southeast gate of the Perfected Person is the Primordial August Lady.\n\n**Fourth:** The Profound Darkness Star, the Jade August Lord of the Soaring Canopy. The Celestial Balance Star—this is the essence-spirit of Profound Darkness. Opposite the east gate of Profound Darkness is the August Lady of Florescence.\n\n**Fifth:** The Cinnabar Prime Star, the Jade August Lord of the Seven Dawns of the Golden Bushel. The Jade Pivot Star—this is the essence-spirit of Cinnabar Prime. Opposite the northeast gate of Cinnabar Prime is the Median August Lady.\n\n**Sixth:** The Northern Culmen Star, the Jade August Lord of the Flying Florescence of the North. The Kaiyang Star—this is the essence-spirit of the Northern Culmen. Opposite the north gate of the Northern Culmen is the August Lady of Dawn Florescence and Primordial Augustness.\n\n**Seventh:** The Celestial Pass Star, the Jade August Lord of the Ninefold Prime and Northern Canopy. The Radiant Light Star—this is the luminous essence-spirit of the Celestial Pass. The south gate of the Celestial Pass faces downward toward the Northern Culmen, where the August Lady of the Numinous resides.\n\n**Eighth:** The Auxiliary Star, the Jade August Lord of the Nine Dawns. The Cavernous Brightness Star—this is the essence-spirit of the Auxiliary Star, Yang Brightness. Opposite the west gate of the Auxiliary Star, above the Celestial Pass, is the August Lady of the Thearch.\n\n**Ninth:** The Adjuvant Star, the Jade August Lord of the True Prime. The Hidden Prime Star—this is the luminous and empty essence-spirit of the Adjuvant Star. Opposite the southeast gate of the Adjuvant Star is the August Lady of the Supreme.\n\nThe Nine August Ones and Nine August Ladies correspond to and manifest through the stars, revealing subtleties by their radiance to guide the myriad branches back to the source. Though the ten thousand kinds are manifold, none depart from the Nine. Thus, they are ordered in sequence, with yin and yang paired in opposition.\n\nFor those who wish to visualize and wear the talismanic chart, make offerings, pay homage, meditate to perceive the true forms, and seek their desires, prepare a pure white silk half-scroll, one foot in width and one foot two inches in length. Use light blue for the base stars and light black for the essence-spirits. The attire and exhaled qi of the August Lords and Ladies should follow the annotations. The transmitted talismanic charts and texts worn by the master must not be inscribed; record them according to the preceding format as follows:\n\n*Chart Title: [Year], [Month], [Day], [Hour] of the Great Year. [Province], [Commandery], [County], [Village], [Residence]. Male/Female, [Official Rank], [Name], age [Number], born in the year [Year Stem-Branch], month [Month], day [Day], with the [Nayin] of [Celestial Stem], affiliated with [Mountain] and [Star]. In [Province], [Commandery], [Village], [Mountain Forest], [Abode], from the master [Male/Female Perfected Person/Teacher’s Name], received the concealed names of the Nine August Ones, the formula for longevity and deathlessness, and the Nine Palaces’ numinous officials to guard the body, repel evil, and admit rectitude, assembling together before the Jade Thearch. No violation is permitted, as per the statutes of the Great Mysterious Capital.*\n\n**Yang Brightness Grand Marshal’s Mansion:** Nine hundred twenty ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robed messengers, jade lads and jade maidens—ninety-nine hundred million myriad persons.\n\n**Yin Essence Grand Minister’s Mansion:** Five hundred fifty ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robed messengers, jade lads and jade maidens—ninety-nine hundred million myriad persons.\n\n**Perfected Person Controller of Destinies’ Mansion:** Seven hundred seventy ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robed messengers, jade lads and jade maidens—ninety-nine hundred million myriad persons.\n\n**Profound Darkness Mobile Strike Mansion:** Eight hundred ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robed messengers, jade lads and jade maidens—ninety-nine hundred million myriad persons.\n\n**Cinnabar Prime Dipper Lord’s Mansion:** Seven hundred twenty ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robed messengers, jade lads and jade maidens—ninety-nine hundred million myriad persons.\n\n**Northern Culmen Grand Constancy Mansion:** Seven hundred seventy ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robed messengers, jade lads and jade maidens—ninety-nine hundred million myriad persons.\n\n**Celestial Pass Supreme Thearch’s Mansion:** Nine hundred ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robed messengers, jade lads and jade maidens—ninety-nine hundred million myriad persons.\n\n**Auxiliary Heavenly Honored Jade Thearch’s Mansion:** Nine hundred ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robed messengers, jade lads and jade maidens—ninety-nine hundred million myriad persons.\n\n**Adjuvant Supreme Thearch True Minister’s Mansion:** Nine hundred ninety ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robed messengers, jade lads and jade maidens—ninety-nine hundred million myriad persons.\n\nThe talismans are to be inscribed in cinnabar.\n\n**First, the Yang Brightness Star:** Heaven’s Grand Marshal, who rectifies and governs transgressions, oversees the Nine Heavens’ Perfected Ones above, supervises the Five Peaks’ flying immortals in the middle, and leads the Perfected Persons of later learners below, weighing the merits and faults of heaven, earth, spirits, and numina. Its domain spans nine hundred twenty *li*, where the Perfected Person of the Dipper’s True Abode in the Azure City, named Upper Numinous, with the style *Shaking Heaven’s Mallet*, wears a Nine Dawns Jade Crown, azure feathered flying robes, and holds the Mysterious Chart of the Dipper, seated within the jade tower. Those who know its inner name will be illuminated by the Jade Dawn and soar through the Great Void.\n\n**Second, the Yin Essence Star:** Heaven’s Grand Minister, who governs emoluments and ranks, oversees the celestial lodges above and leads the myriad spirits below, as well as those who study immortality. Its domain spans five hundred fifty *li*, where the Perfected Person of the Five-Colored Jade Tower, the Lifting Bushel, titled the Northern Supreme Divine Lord, named *Nurturing Infant*, with the style *Stimulating Bright Light*, wears a Dark Essence Jade Crown, dark feathered flying robes, and holds a five-colored feathered tally.\n\n**Third, the Perfected Person Star:** Heaven’s Minister of Works, who governs immortals and transcendents, oversees the Nine Heavens’ lofty Perfected Ones above, supervises the Five Peaks’ numinous immortals in the middle, and leads those who study the Dao below. Its domain spans seven hundred seventy *li*, where the Perfected Person of the Yellow Terrace Jade Tower, the Treading Dipper, titled the Divine Lord of Immortal Florescence, named *Returning to the Multitude*, with the style *Dwelling in Reverent Tread*, wears a Flying Dawn Treasure Crown, azure feathered flying robes, and holds the Azure Register of the Dipper’s Center.\n\n**Fourth, the Profound Darkness Star:** Heaven’s Mobile Strike General, who punishes rebels, oversees the Nine Heavens’ ghosts and spirits above, commands the Northern Thearch’s Three Offices in the middle, and supervises the myriad multitudes below. Its domain spans eight hundred *li*, where the Perfected Person of the Vermilion Terrace Jade Tower, the Pacing Central Dipper, titled the August Lord of the Soaring Canopy of the Profound, named *Pivot of Darkness*, with the style *Shaking Heaven’s Pillar*, wears a Three Florescence Treasure Dawn Crown, cinnabar brocade flying robes, and holds the tally of life’s numina.",
      "overlap_context": "e Nine August Treasure Registers (III)*\n\n**First:** The Yang Brightness Star, the Jade August Nine Dawn Lords. The Celestial Pivot Star—this is the spirit-soul of Yang Brightness. Opposite the northwest gate of Yang Brightness is the August Lady of the Supreme Realized Ones.\n\n**Second:** The Yin Essence Star, the Jade August North Supreme Dawn Lord. The Celestial Rotation Star—this is the spirit-soul of Yin Essence. Opposite the west gate of Yin Essence is the August Lady of the Supreme Mystery.",
      "start_char": 1233,
      "end_char": 2528,
      "start_sentence": 46,
      "end_sentence": 83,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.67489194869995,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清河图内玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "五丹元星，天之斗君，主禄命籍，上总九天诸箓，中统鬼神簿目，下领学真兆真命籍，诸天诸地，莫不总统。 围七百二十里，有素台金楼蹑纪真人，号金魁七晨君，姓上开，讳变五道，七宝飞天冠，白锦飞裙，执青玄箓籍。 六北极星，天之太常，主升进，上总九天上真，中统五岳飞仙，下领学者阶级。 围七百七十里，有玄台玉楼步纲真人，号北晨飞华君，姓明灵，讳昌上元，飞精华冠，紫锦飞裳，执斗玉策。 七天关星，天之上帝，主天地机运，四时长短，否泰劫会。 围九百里，有九层玉楼乘龙真人，号总灵九元北盖晨君，姓玄枢，讳开天徒，九元冠，九色锦裳，执晖神之策。 八辅星，天尊玉帝之星，日常阳也，主飞仙，上总九天，下领九地，五岳四渎神仙之官。 围九百九十里，有紫气玉楼游行三命真人，号帝尊九晨君，姓精常，讳空上开正延，飞精玉冠，九色凤衣，执火铃。 九弼星，太帝真人星，日空隐也，主变化无方。 围九百九十里，有玉台紫绾徘徊三阳真人，号帝真元晨君，姓幽空，讳冥阳晖幽寥，飞天玉冠，九龙衣，执帝章。 一天枢星元斗宫中魁精玄上真皇夫人，姓明通，讳婴育，真名 ，飞灵华颓之髻，紫黄青三色裙，带九铃绶，口恒吐青炁，光注阳明星。 二天璇星玄魁官中灵精上玄皇夫人，姓玄镜，讳郁勃光，真名 ，飞锦罗裙凤文锦帔，带灵飞紫绶，口恒吐黑炁，光注阴精星。 三天机星上精宫中灵妃元皇夫人，姓常明，讳化云，真名 ，戴晨婴宝冠，飞灵明光锦，带六山飞晨绶，口恒吐黄炁，光注真人星。 四天权星纲极宫中上灵神妃华皇夫人，姓开生，讳运明，真名 ，七称玉冠，绯罗凤文，〔带〕#2金真玉光，口恒吐赤炁，光注玄冥星。 五玉衡星灵关宫中北上金盖中皇夫人，姓元方，讳神武，真名 ，紫晨飞华冠#3，九色，带神虎玉文，口恒吐白炁，光注丹元星。 六闿阳星紫极宫中安上晨华元皇夫人，姓玉元，讳华根，真名 ，玉晨进贤冠，飞青，带流金火铃，口恒吐绿炁，光注北极星。 七瑶光星运天官中玉华灵皇夫人，姓庆元，讳终会，真名 ，飞华云颓髻，七色夜光云锦裙#4九色锦帔，带天威灵玉策，口恒吐赤炁，光注天关星。 八洞明星真空宫中太明皇夫人，姓幽升，讳元韵，真名 ，颓〔云〕#5髻，飞罗云，带九光绶，口怛吐青炁，光注辅星。 九隐元星常宝宫中空玄变灵上皇夫人，姓冥通，讳万光，真名 ，七称玉冠，青文锦裙，带九光夜烛，口恒吐黑炁，光注弼星。 一诉彼之非，明此之是，遏他之恶，申己之善，自责而不怨人，通理而各祈佑，除罪延福，告请天之太尉第一玉皇君。 二阴阳学官，干禄求位，告请天之上宰第二玉皇君。 三学道期仙，通神达圣，告请天之司空第三玉皇君。 四制服人鬼恶逆，诛伐幽显凶邪，告请天之游击第四玉皇君。 五立功建德，益算延年，告请天之斗君第五玉皇君。 六屈滞疾厄，乞申希免，告请天之太常第六玉皇君。 七天地否激，炁候不调，告请天之上帝第七玉皇君。 八禳却众灾，飞上履下，告请天之玉帝第八玉皇君。 九变化无方，应救一切，告请太帝第九玉皇君。 右九皇君、九夫人内姓隐讳，知之延寿七千年。",
      "translated_text": "**Fifth, the Cinnabar Prime Star:** Heaven’s Dipper Lord, who oversees the registers of official rank and destiny. Above, he governs the myriad registers of the Nine Heavens; in the middle, he commands the ledgers of ghosts and spirits; below, he presides over the registers of those who study the Perfected and the destinies of the multitudes. None in the heavens or upon the earth escape his governance. Its domain spans seven hundred and twenty *li*, where the Perfected Person of the Plain Terrace Golden Tower, Treader of the Celestial Threads, titled the Golden Chief of the Seven Dawns Lord, named *Upper Opening*, with the style *Transforming the Five Paths*, wears a Seven Treasures Flying Heaven Crown, white brocade flying skirts, and holds the Azure Mystery Registers.\n\n**Sixth, the Northern Culmen Star:** Heaven’s Grand Constancy, who oversees advancement. Above, he governs the Supreme Perfected of the Nine Heavens; in the middle, he commands the Flying Immortals of the Five Peaks; below, he presides over the ranks of scholars. Its domain spans seven hundred and seventy *li*, where the Perfected Person of the Mystic Terrace Jade Tower, Pacing the Celestial Web, titled the Northern Dawn Flying Splendor Lord, named *Bright Numen*, with the style *Prospering the Upper Prime*, wears a Flying Essence Splendor Crown, purple brocade flying robes, and holds the Jade Baton of the Dipper.\n\n**Seventh, the Celestial Pass Star:** Heaven’s Supreme Thearch, who governs the mechanisms of heaven and earth, the length of the four seasons, and the cycles of prosperity, decline, and kalpas. Its domain spans nine hundred *li*, where the Perfected Person of the Nine-Tiered Jade Tower, Rider of the Dragon, titled the All-Numinous Nine Prime Northern Canopy Dawn Lord, named *Mystic Pivot*, with the style *Opening Heaven’s Path*, wears a Nine Prime Crown, nine-hued brocade robes, and holds the Radiant Spirit Baton.\n\n**Eighth, the Auxiliary Stars:** The stars of the Heavenly Venerable Jade Thearch, the constant yang, who oversees the Flying Immortals. Above, he governs the Nine Heavens; below, he commands the Nine Earths, the divine officials of the Five Peaks and Four Waterways. Its domain spans nine hundred and ninety *li*, where the Perfected Person of the Purple Qi Jade Tower, Wanderer of the Three Destinies, titled the Thearch-Venerable Nine Dawns Lord, named *Essence of Constancy*, with the style *Empty Upper Opening, Upright Extension*, wears a Flying Essence Jade Crown, nine-hued phoenix robes, and holds the Fire Bell.\n\n**Ninth, the Adjuvant Stars:** The stars of the Supreme Thearch Perfected Person, the hidden emptiness, who governs boundless transformations. Its domain spans nine hundred and ninety *li*, where the Perfected Person of the Jade Terrace Purple Cincture, Wanderer of the Three Yangs, titled the Thearch-Perfected Prime Dawn Lord, named *Dark Emptiness*, with the style *Mystic Yang Radiance, Dark and Vast*, wears a Flying Heaven Jade Crown, nine-dragon robes, and holds the Thearch’s Edict.\n\n---\n\n**First, the Celestial Pivot Star:** Within the Prime Dipper Palace dwells the Mystic Supreme Perfected August Lady, named *Bright Permeation*, with the style *Infant Nurturance*, whose true name is [omitted]. She wears a Flying Spirit Splendor topknot, a three-hued skirt of purple, yellow, and azure, and a sash with nine bells. Her mouth ever emits azure *qi*, its light pouring into the Yang Brightness Star.\n\n**Second, the Celestial Whirl Star:** Within the Mystic Chief Palace dwells the Numinous Essence Supreme Mystery August Lady, named *Mystic Mirror*, with the style *Fuming Radiance*, whose true name is [omitted]. She wears a flying brocade skirt and a phoenix-patterned brocade cloak, with a numinous flying purple sash. Her mouth ever emits black *qi*, its light pouring into the Yin Essence Star.\n\n**Third, the Celestial Mechanism Star:** Within the Supreme Essence Palace dwells the Numinous Consort Prime August Lady, named *Constant Brightness*, with the style *Transforming Clouds*, whose true name is [omitted]. She wears a Morning Infant Treasure Crown and a flying spirit bright-light brocade robe, with a six-mountain flying dawn sash. Her mouth ever emits yellow *qi*, its light pouring into the Perfected Person Star.\n\n**Fourth, the Celestial Balance Star:** Within the Webbed Culmen Palace dwells the Supreme Numinous Divine Consort Splendor August Lady, named *Opening Life*, with the style *Moving Brightness*, whose true name is [omitted]. She wears a seven-tiered jade crown and a crimson phoenix-patterned robe, with a golden true jade-light sash. Her mouth ever emits red *qi*, its light pouring into the Profound Darkness Star.\n\n**Fifth, the Jade Balance Star:** Within the Numinous Pass Palace dwells the Northern Supreme Golden Canopy Central August Lady, named *Prime Square*, with the style *Divine Martiality*, whose true name is [omitted]. She wears a purple dawn flying splendor crown and a nine-hued robe, with a divine tiger jade-patterned sash. Her mouth ever emits white *qi*, its light pouring into the Cinnabar Prime Star.\n\n**Sixth, the Opening Yang Star:** Within the Purple Culmen Palace dwells the Peaceful Upper Dawn Splendor Prime August Lady, named *Jade Prime*, with the style *Splendor Root*, whose true name is [omitted]. She wears a jade dawn advancing-worthy crown and a flying azure robe, with a flowing-gold fire bell sash. Her mouth ever emits green *qi*, its light pouring into the Northern Culmen Star.\n\n**Seventh, the Jade Light Star:** Within the Heaven-Moving Palace dwells the Jade Splendor Numinous August Lady, named *Celebrating Prime*, with the style *Final Convergence*, whose true name is [omitted]. She wears a flying splendor cloud topknot, a seven-hued night-luminous cloud brocade skirt, and a nine-hued brocade cloak, with a heavenly might numinous jade baton sash. Her mouth ever emits red *qi*, its light pouring into the Celestial Pass Star.\n\n**Eighth, the Cavern Brightness Star:** Within the True Emptiness Palace dwells the Supreme Brightness August Lady, named *Dark Ascent*, with the style *Prime Tone*, whose true name is [omitted]. She wears a cloud topknot and a flying net-cloud robe, with a nine-light sash. Her mouth ever emits azure *qi*, its light pouring into the Auxiliary Stars.\n\n**Ninth, the Hidden Prime Star:** Within the Constant Treasure Palace dwells the Empty Mystery Transforming Numinous Supreme August Lady, named *Dark Permeation*, with the style *Myriad Radiance*, whose true name is [omitted]. She wears a seven-tiered jade crown and an azure-patterned brocade skirt, with a nine-light night-candle sash. Her mouth ever emits black *qi*, its light pouring into the Adjuvant Stars.\n\n---\n\nTo accuse another’s wrongs and clarify one’s own rightness, to suppress another’s evil and extend one’s own goodness, to reproach oneself rather than resent others, to comprehend principle and each seek blessing—thus eliminating transgressions and prolonging fortune—one petitions the Heavenly Grand Commandant, the First Jade Thearch.\n\nFor those studying the offices of yin and yang to seek rank and emolument, one petitions the Heavenly Grand Steward, the Second Jade Thearch.\n\nFor those studying the Dao in hopes of becoming immortals, to communicate with spirits and attain sagehood, one petitions the Heavenly Minister of Works, the Third Jade Thearch.\n\nTo subdue the malevolence of humans and ghosts, to punish and execute the wicked and perverse in the hidden and manifest realms, one petitions the Heavenly Mobile Strike General, the Fourth Jade Thearch.\n\nTo establish merit and build virtue, to increase one’s lifespan and prolong one’s years, one petitions the Dipper Lord, the Fifth Jade Thearch.\n\nTo alleviate distress, illness, and hardship, to beseech relief and exemption, one petitions the Heavenly Grand Constancy, the Sixth Jade Thearch.\n\nWhen heaven and earth are obstructed and *qi* conditions are unbalanced, one petitions the Heavenly Supreme Thearch, the Seventh Jade Thearch.\n\nTo dispel and avert manifold disasters, to ascend above and tread below, one petitions the Heavenly Jade Thearch, the Eighth Jade Thearch.\n\nFor boundless transformations to respond and save all, one petitions the Supreme Thearch, the Ninth Jade Thearch.\n\nThe inner names and hidden styles of the Nine Thearchs and Nine August Ladies—those who know them shall extend their lifespan by seven thousand years.",
      "overlap_context": "s and spirits above, commands the Northern Thearch’s Three Offices in the middle, and supervises the myriad multitudes below. Its domain spans eight hundred *li*, where the Perfected Person of the Vermilion Terrace Jade Tower, the Pacing Central Dipper, titled the August Lord of the Soaring Canopy of the Profound, named *Pivot of Darkness*, with the style *Shaking Heaven’s Pillar*, wears a Three Florescence Treasure Dawn Crown, cinnabar brocade flying robes, and holds the tally of life’s numina.",
      "start_char": 2529,
      "end_char": 3807,
      "start_sentence": 84,
      "end_sentence": 112,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.478549003601074,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清河图内玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "常夕夕观之，想见皇君、夫人形相威光，忆其姓讳，谛存心，得见第八、第九二星，延寿无穷。 九皇、九夫人，是九气之魂精，九天之魄灵，九星之妙象，九化之威神。 男女学道，佩带醮之，出入行来，坐卧思真，忧喜疾厄，救疾扶衰，修身济物，恒存识之，灾消祸散，厚福通神。 有急之日，竹素依法朱笔书符，向北再拜，井花水服之。 起一周九更始，一两三忧除疾愈，便可止息。 无他咒言，唯存九讳。 勤立善功，九年不懈#6，必获神通。 玉皇要旨，慎勿妄宣，密而修之，位为真人元君，交游上圣三清元始真人。 受之裂素立图，启告而传，秘讳心存，则成仙也。 凡受河图，先请九皇内讳，对斋九日、七日、三日、一日，随时施行，投辞启告，三日限竟，山馆坛堂，唯清闲静，乃奏表如左： 太上某洞法师某岳先生九宫真人臣某等，稽首再拜，上言 太上无极大道、无上无为至真天尊、高上万真玉晨道君、扶桑大帝旸谷神王、诸天帝皇、后圣九玄帝君金阙玉陛下，上相青童太极真人、玄中大法师，三界内外一切明灵，臣无始之劫，轮转善缘，得以凡庸，叨闻妙法，参受秘要，铭荷唯深，良因幸会，游涉诸方，某年某月某日某时，於某州郡县乡里中，从男女师名，受河图宝文上清隐讳，佩带修行。 蒙见今日法禁严密，不得妄传，复索种人，又不得闭。 今有某州郡县乡里，或今居某，男女道士姓名，於某州郡县乡里山林馆，投辞求受，至诚慊款，足充贤明。 但臣以寓蔽，神智未通，知人常难，实敢保秘，谨依科法，清严传真，启告灵秘，委玄监察。 伏愿 太上大道无极天尊，遍勒三界一切神明，降应感之灵，奖建善之志，付授之后，改往修来，神真拥护，邪魔敢干，良人相遇，凶丑归降，使情开意悟，动静合真。 某弟子名也 ，约当专心返源，不敢随逐流沫，苦行遵承，首舍众衅，拯拔眷属，造立新功，誓不谋图荣欲，奸宄肆心，当杜塞劫贼之缘，防遏恣纵之路，不杀不淫，不妄不窃，不骄不暴，守一存三，行五体七，备九宝十，精遣妬之垢，洗阴虐之尘，不抑绝贤良，不背伐师道，不骂辱一切，泄露要言，不冒户哀恸，不协女叨真，不酣歌乱正，不唝嗃欺人，不鬼黠轻物，不恃高凌卑，不盗略经书，不改易图诰，不奔毁圣文，不自作一法，不迷惑忘归，不疑误万姓，先有斯罪，悉乞原除，自今已后，不敢又犯。 仰希高圣大神，玉晨大帝，玄中法师，同垂鉴映，勅十方善神，三界官属，随顺缘次，防护降矜，大慈含弘，善成善贷，荡浊以清，济愚以智，保使危者获安，断者更续。 令某才识英拔，免度众灾，寿命延长，与真合德，亿曾万祖，超升福堂，表裹亲疏，一切同泰，行化立功，触地无碍，智照毕周，常存无极，子孙繁昌，智惠殊特，天爵人位，长久安全，道业广被，幽显荷恩。 蒙如所请，铭镂玄慈，干渎罔极，触忤威灵，俯仰惭惶，进退忓栗，凭估与善之泽，荑荣已枯之姿，方勤洁己之威，敬俟妙门之应，罄沥丹志，恭验神效。 臣与某或等，同沦身心，俱期至极，不负所陈。 恩惟 太上至真天尊，高上万真玉晨道君，分别垂哀。 臣愚谨因九皇灵官、飞龙骑吏、绣衣使者，操臣为男女道士姓名，拜授河图宝文上清隐讳，朱表一通，上诣无上三天九皇玉帝三元曹，伏须告报。",
      "translated_text": "Each evening at dusk, one observes and visualizes the august forms and majestic radiance of the Jade Thearchs and August Ladies, recalling their inner names and hidden styles. With focused contemplation, if one succeeds in beholding the eighth and ninth stars, one’s lifespan shall become boundless.\n\nThe Nine Thearchs and Nine August Ladies are the refined essences of the nine *qi*, the numinous spirits of the Nine Heavens, the wondrous manifestations of the Nine Stars, and the awe-inspiring deities of the Nine Transformations. Men and women who study the Dao, wear and offer them in ritual, and in all activities—whether coming or going, sitting or reclining—meditate upon the true, shall find that in times of sorrow or joy, illness or hardship, they bring healing and support, cultivate the self and aid others. By constantly bearing them in mind, disasters dissolve, misfortunes scatter, and profound blessings commune with the divine.\n\nIn times of urgent need, inscribe the talisman in cinnabar on bamboo or silk according to the method, face north, bow twice, and ingest it with well-flower water. After completing one cycle of nine watches, a dose of one or two measures, taken thrice, will cure illness—then one may cease. There is no other incantation; one need only hold the nine hidden names in mind. Diligently performing good deeds without slackening for nine years will assuredly grant divine transcendence.\n\nThe essentials of the Jade Thearch must not be recklessly disclosed; cultivate them in secrecy, and one shall attain the rank of Perfected Person and Primordial Lord, associating with the supreme sages—the Three Pure Ones and the Primordial Perfected of Yuanshi. Upon receiving this, inscribe it on silk and illustrate it, presenting it with reverent petition. By secretly preserving the hidden names in one’s heart, one shall achieve immortality.\n\nWhen receiving the *Hetu*, one must first petition the inner names of the Nine Thearchs. After observing a nine-day, seven-day, three-day, or one-day retreat as circumstances permit, submit a petition to announce the transmission. Within three days, in a mountain retreat, altar hall, or secluded chamber—wherever it is pure and tranquil—present the memorial as follows:\n\nThe Most High Master of the Cavernous Law of [Your] Peak, the Perfected of the Nine Palaces, your humble servant [Your Name], bows twice and respectfully addresses:\n\nThe Most High Boundless Dao, the Supreme Non-Being and Perfectly True Heavenly Worthy; the Lofty Myriad Perfected, the Jade Dawn Dao Lord; the Great Emperor of Fusang, the Divine King of Yang Valley; the Thearchs and Emperors of all heavens; the Nine August Lords of the Posterior Saints and Nine Mysteries before the Golden Portal of the Jade Palace; the Prime Minister, the Azure Lad and Supreme Perfected; the Great Master of the Mysterious Center; and all luminous spirits within and beyond the Three Realms:\n\nSince the beginningless kalpas, your servant has revolved through cycles of good affinity, attaining this humble and ordinary form. By grace, I have heard the wondrous Dharma, received its secret essentials, and bear its profound indebtedness. Through fortunate karmic convergence, I have traversed many lands. On the [day] of [month] in the year [year], in the [prefecture], [commandery], [county], and [village], I received from the male/female master [Name] the precious scripture of the *Hetu*, the hidden names of the Supreme Clarity, and the practice of wearing and cultivating them.\n\nToday, I have witnessed the strictness of the Dharma’s prohibitions against reckless transmission and the requirement to seek worthy recipients, yet I cannot withhold it. Now, in the [prefecture], [commandery], [county], and [village]—or presently residing in [location]—the male/female Daoist [Name], in the mountain retreat or hall of [prefecture], [commandery], [county], and [village], has submitted a petition seeking to receive it. Their sincerity and earnestness are fully sufficient, and their worthiness is evident.\n\nYet your servant, being dull and obscured, has not yet attained spiritual penetration. Discerning others is ever difficult, and I dare not presume to guarantee secrecy. Thus, in strict adherence to the precepts and methods, I solemnly transmit the true teaching, announcing this sacred transmission to the mysterious overseers.\n\nI humbly pray that the Most High Boundless Dao and Heavenly Worthy, pervading all within the Three Realms, may command all divine beings to descend with responsive numinosity, rewarding the resolve to perform good deeds. After this transmission, may the recipient reform past transgressions and cultivate future conduct, with divine Perfected protecting them and evil demons daring not intrude. May they encounter virtuous companions, subdue malevolent forces, open their hearts to enlightenment, and align their actions with the true.\n\nYour disciple [Name], vowing to focus the mind and return to the source, shall not dare to drift with the currents. Through ascetic practice and reverent adherence, I shall first relinquish all faults, rescue my kin, and establish new merits. I swear never to scheme for glory or desire, nor indulge in treachery or licentiousness. I shall sever ties with thieves and robbers, block the paths of recklessness, refrain from killing or lewdness, falsehood or theft, arrogance or violence. I shall guard the One and preserve the Three, practice the Five and embody the Seven, and perfect the Nine Treasures and Ten Virtues. I shall purify the filth of jealousy and envy, wash away the dust of yin oppression, not suppress the worthy or betray the Way of the master, not revile or insult anyone, nor reveal essential teachings. I shall not mourn excessively in grief, nor collude with women to usurp the true, nor indulge in drunken singing to disrupt propriety, nor deceive others with harsh words, nor act cunningly toward spirits or belittle beings. I shall not rely on high status to bully the lowly, steal or alter scriptures, tamper with diagrams or decrees, slander sacred texts, create my own methods, lead others astray, or misguide the masses. For all such past transgressions, I beseech forgiveness; henceforth, I shall not dare to repeat them.\n\nI implore the lofty sages and great deities—the Jade Dawn Great Emperor and the Great Master of the Mysterious Center—to deign to witness this. May they command the benevolent spirits of the ten directions and the officials of the Three Realms to follow the karmic sequence, protect and bestow compassion. In great mercy and magnanimity, may they perfect goodness and bestow blessings, purify the turbid, enlighten the ignorant, secure the imperiled, and reconnect the severed.\n\nMay your servant’s talents and wisdom be outstanding, spared from all disasters, with lifespan prolonged and virtue harmonized with the Perfected. May my ancestors of a hundred million generations ascend to the Hall of Blessings, and may all kin—inner and outer—attain peace. May my transformative deeds and merits be unimpeded wherever I tread, my wisdom illuminate all, and my constant preservation be boundless. May my descendants flourish, their wisdom exceptional, their heavenly and earthly ranks enduring and secure. May the Dao’s influence spread widely, and may all—seen and unseen—receive its grace.\n\nShould my prayers be granted, I shall inscribe this profound mercy in my heart. Though my presumption knows no bounds and may offend your majesty, I prostrate myself in shame and trepidation. Relying on the grace of your benevolence, I nourish this withered form, diligently purifying myself in reverence, awaiting the response of the wondrous gate. I exhaust my sincere devotion, awaiting the verification of divine efficacy.\n\nYour servant and [Name], together, pledge our bodies and minds, aspiring to the ultimate. We shall not betray what has been declared.\n\nWe beseech the Most High and Perfectly True Heavenly Worthy, the Lofty Myriad Perfected and Jade Dawn Dao Lord, to bestow your compassionate discernment.\n\nYour foolish servant, through the Nine Thearchs’ divine officials, the Flying Dragon Riders, and the Embroidered Robe Envoys, respectfully presents this memorial for the male/female Daoist [Name], petitioning to receive the precious scripture of the *Hetu*, the hidden names of the Supreme Clarity. A vermilion memorial is hereby submitted to the Supreme Three Heavens, the Nine Thearchs, and the Jade Emperor’s Three Primordial Courts, awaiting your decree.",
      "overlap_context": "ditions are unbalanced, one petitions the Heavenly Supreme Thearch, the Seventh Jade Thearch.\n\nTo dispel and avert manifold disasters, to ascend above and tread below, one petitions the Heavenly Jade Thearch, the Eighth Jade Thearch.\n\nFor boundless transformations to respond and save all, one petitions the Supreme Thearch, the Ninth Jade Thearch.\n\nThe inner names and hidden styles of the Nine Thearchs and Nine August Ladies—those who know them shall extend their lifespan by seven thousand years.",
      "start_char": 3807,
      "end_char": 5063,
      "start_sentence": 113,
      "end_sentence": 138,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.92179989814758,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清河图内玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "臣某诚惶诚恐，顿首顿首，再拜以闻 臣姓某，属某州郡县，今属某郡县。 太上元极大道、元上元为至真天尊、高上万真玉晨道君、扶桑大帝旸谷神王、诸天帝皇、后圣九玄帝君金关玉陛下。 太岁某月某日时，於某州郡县乡里山林馆。 凡表体以黄素，长一尺，广二尺四五寸，计事状取容，人多加之。 前空一行，次行作太字在分上，次上字在分下，下以次计一寸三字，朱分书阑头，各出五分，以朱郭周，阑中九寸二十七字为则。 前再拜下，长短悉空之。 次行去上一字作言，下空之。 次行历分书空上行极分，阑内勿差降也。 后以阑后空三行，题臣某姓名，后三行记太岁姓，中央一行细书太上至陛下四十五字，三分题记，上三寸书太上，三寸空之，下三寸后行题太岁，后分减三行，其中言太上尊位，皆悬一字。 若逼行下三寸以还，皆上行三寸，以外悬书如法。 自名勿露，重名勿分，勿令尊位极下下有余字，乃为通耳。 若拜下以闻有余，长短悉空之，勿拭汰，勿佳儳，误得洗治。 三字之外，并都易去，依争经法，更新洁分明书也。 读表毕，乃笔镇上操复如法，唯未复炉。 仍读箓前鞠，令次受后诸官。 每一官，师云度，弟子伏称名受，受竟，起再拜，亦可九拜。 毕，拜伏，师咒勅讳符曰： 玉皇九君，夫人九神，却邪辅正，炼伪成真，忧病廓散，功业日新，保某得道，长为上宾。 毕，卷授与弟子，男左手，女右手，取绕腰后，度三过，插怀中。 又拜，九叩抟，都毕。 师起，上香，复炉出。 出后设醮，亦可前后择王相之辰，依按如左。 上清河图内玄经卷上 #1此句前疑有缺题及缺文。",
      "translated_text": "Your servant [Name], with utmost reverence and trepidation, prostrates and bows repeatedly to make this known.\n\nYour servant, of the surname [Name], hails from [State], [Commandery], [County], now belonging to [State], [Commandery], [County].\n\nTo the Supreme Primordial Great Dao of the Utmost Origin, the Most Perfectly True Heavenly Worthy of the Primordial Origin, the Lofty Myriad Perfected and Jade Dawn Dao Lord, the Great Emperor of Fusang and Lord of the Sun Valley, the Thearchs and Emperors of the Myriad Heavens, and the Golden Gate and Jade Steps of the Nine Mysterious Imperial Lords of Later Sagely Worthies:\n\nOn the day and hour of the [Year-Star] in the [Month] of the [Year], at the mountain forest abode in the village of [State], [Commandery], [County].\n\nThe memorial body is made of yellow silk, one *chi* in length and two *chi* and four or five *cun* in width, with the content adjusted to fit. The beginning is left blank for one line. On the next line, the character *tai* (太) is placed above the central division, and *shang* (上) below it. Below this, three characters per *cun* are written in sequence. The column headers are marked in vermilion, each extending five *fen* outward, and bordered with vermilion. Within the columns, nine *cun* accommodate twenty-seven characters as the standard.\n\nAfter the initial prostration, the remaining space is left blank. On the next line, the character *yan* (言) is written one character below the top, with the rest left blank. On the following line, the divisions are filled sequentially to the edge of the column, ensuring no misalignment within the borders. After the border, three lines are left blank, followed by the servant’s name [Name]. Three lines later, the Year-Star’s surname is recorded. In the central line, the forty-five characters from *Tai Shang* (太上) to *Bi Xia* (陛下) are written in smaller script, divided into three sections",
      "overlap_context": "o bestow your compassionate discernment.\n\nYour foolish servant, through the Nine Thearchs’ divine officials, the Flying Dragon Riders, and the Embroidered Robe Envoys, respectfully presents this memorial for the male/female Daoist [Name], petitioning to receive the precious scripture of the *Hetu*, the hidden names of the Supreme Clarity. A vermilion memorial is hereby submitted to the Supreme Three Heavens, the Nine Thearchs, and the Jade Emperor’s Three Primordial Courts, awaiting your decree.",
      "start_char": 5063,
      "end_char": 5702,
      "start_sentence": 139,
      "end_sentence": 163,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.650795698165894,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清河图内玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "#2『带』字据前后文补。 #3『冠』字原本误作『符』。 #4『裙』字原本误作『晨』。 #5『云』字据《上清河图宝录》补。 #6『懈』字原本误作『解』。 上清河图内玄经卷下 香灯谢文四 安九灯，七灯然油，二灯然香，普列北方。 某灯南施一席，设九盘枣，九片脯安枣上，九处盐着盘后，九柸酒置盘前。 某又别施一席，向灯安香按，某长跪，九上香，仍临目存见九星神在天上。 毕，叩齿九通起。 某称三宝弟子臣姓名，今谨奉请： 辅星帝席宫紫炁玉楼帝尊九晨皇君、皇夫人高皇左夫人； 弼星上尊官玉楼紫馆帝真元晨皇君、皇夫人高皇右夫人； 贪狼子生阳明太上宫青城玉楼九晨皇君、皇夫人逃元内妃； 巨门丑亥阴精中元宫五色玉楼北晨皇君、皇夫人化形内嫔； 禄存寅戌真人真元宫黄台玉楼主仙华晨皇君、皇夫人上元母； 文曲卯酉玄冥纽幽宫朱台玉楼玄上飞盖晨皇君、皇夫人由元内妃； 廉贞辰申丹元冈神宫素台金玉楼金魁七晨皇君、皇夫人斗中大女； 武曲己未北但纪明宫玄台玉楼北辰飞华皇君、皇夫人斗中中女； 破军午生天关关会宫九层玉楼总灵九元北盖皇君、皇夫人斗中少女。 谨请七灵大神，九精帝晨，四尊纡鉴，垂愍至心，赐降云驾，动圣光仪。 与中和君、万福君、延寿君、好生君、明算君、保录君、定命君、赏善君、应愿君，从神童玉女、直符直事真官、正神将军骑吏，一切官属，俱降此某里中露坛墠之上，察某翘仰之情，歆某贫微之礼。 臣某与某道义相延，终始有因，情同骨血，齐心投地。 某归命九皇高尊，七圣大灵，大道至真，诸君丈人。 臣某诚惶诚恐，稽首再拜。 更上酒酌柸，令得三拈三上酒，合得九拈，成九献橙毕。 称三宝弟子臣某，上启七灵大神，九精帝晨，明灵高尊，道德诸君，一切正神。 某今谨有同义，某州郡县乡里姓名，即日操墨辞，谨读如列。 某伏愿一切神明，鉴映辞言，并某今设微礼，谨操本命缯彩如干尺，某诣所属第如干皇君、夫人随人命所属次第玉机前，乞拔赎某应绝之命，请更造之恩。 伏愿某皇君、夫人，咸共哀某丹唱心，飨某今设此微礼，共垂证盟。 仰希众灵嘱劝所属某皇君、夫人，特赐以慈恩，降以应感，使某永免厄疾，无复死病之忧，得脱於非横之祸，众灾消弭，所向谐心，触愿如志，丹诚慊款，因臣以闻。 臣以愚庸，谬参真教，志扬玄风，救护一切，先人后己，不敢有懈。 今不胜虔心懃款，谨为冒昧上陈。 但人生运动，实自多□，良由愚暗，任用乖真，致使迷涂失正。 伏寻理在有境，不得无心，心之所务，唯当去暗就明，明须莹发，由乎圣神，玄奖既应，圣许祀谢，神许开矜，开矜由於诚款，祀谢关於洗心，心尽则应首悔无量之罪，诚款则宜敬献祭馔之仪，仪整则神佑必至，罪释则善愿必谐。 仰缘斯理，敢布丹心。 夫郊天祀地，望祭山川，前圣垂之於外谟，后睿尊之以成德，至於请五老而祈太一，招八灵而致六神，玄真既着之於内科，明诰继之以弘道，品位有序，妙在无邪。 是以奉修称意，随时进献，贵不厌丰，贱不拘俭。 故碧帛驎凤，玉醴琼浆，乃高通者之所办，非卑窘者之所参。 若乃鸿鹭之羞上帝，苹藻之荐尊神威严，非微臣之所宜行，愚款之所表至。",
      "translated_text": "Here follows the translation of *Shangqing Hetu Neixuan Jing*, Scroll the Lower:\n\n---\n\n**Corrections and Emendations:**\n*#2* The character *dai* (帶, \"to wear\") is supplied based on context.\n*#3* The character *guan* (冠, \"crown\") was mistakenly written as *fu* (符, \"talisman\") in the original.\n*#4* The character *qun* (裙, \"skirt\") was mistakenly written as *chen* (晨, \"morning\") in the original.\n*#5* The character *yun* (云, \"to say\") is supplied from the *Shangqing Hetu Baolu*.\n*#6* The character *xie* (懈, \"slack\") was mistakenly written as *jie* (解, \"to untie\") in the original.\n\n---\n\n**Incense, Lamps, and Prayer of Thanksgiving (Fourfold)**\n\nNine lamps are lit: seven with oil, two with incense, arrayed universally toward the north.\n\nA mat is spread south of the lamps, upon which nine trays of jujubes are set. Nine slices of dried meat are placed atop the jujubes, and nine measures of salt are positioned behind the trays. Nine cups of wine are arranged before the trays.\n\nAnother mat is laid separately, facing the lamps, where the incense burner is placed. The disciple kneels in reverence, offers incense nine times, and with eyes closed, visualizes the Nine Star Spirits in the heavens above.\n\nUpon completion, the disciple strikes the teeth nine times and rises.\n\nThe disciple, a servant of the Three Treasures, [Name], now respectfully invokes:\n\nThe Imperial Seat of the Auxiliary Star, Purple Qi Jade Tower, Imperial Lord of the Nine Mornings, August Sovereign, and the August Consort, the High August Left Consort;\nThe Supreme Lord of the Corrective Star, Jade Tower of the Purple Palace, Imperial Perfected One of the Primordial Dawn, August Sovereign, and the August Consort, the High August Right Consort;\nThe Youthful Star of Greed and Life, Yang Brightness, Supreme Palace of the Azure City, Jade Tower of the Nine Mornings, August Sovereign, and the August Consort, the Inner Concubine of Escaped Primordial Qi;\nThe Gate of Greatness in the Ox and Boar, Yin Essence of the Middle Primordial Palace, Five-Colored Jade Tower of the Northern Dawn, August Sovereign, and the August Consort, the Inner Concubine of Transformed Form;\nThe Star of Emolument in the Tiger and Dog, Perfected One of the True Primordial Palace, Yellow Terrace Jade Tower, Lord of Immortal Splendor, August Sovereign of the Flowering Dawn, and the August Consort, the Mother of the Upper Primordial;\nThe Star of Literature in the Rabbit and Rooster, Dark Obscurity of the Mystic Tie, Crimson Terrace Jade Tower of the Dark Supreme, Flying Canopy of the Mystic Dawn, August Sovereign, and the August Consort, the Inner Concubine of the Originating Primordial;\nThe Star of Integrity in the Dragon and Monkey, Cinnabar Primordial Ridge, White Terrace of the Golden Jade Tower, Golden Chief of the Seven Mornings, August Sovereign, and the August Consort, the Eldest Maiden of the Dipper;\nThe Star of Valor in the Serpent and Ram, Northern Buttress of the Dark Record, Dark Terrace Jade Tower, Northern Asterism of Flying Splendor, August Sovereign, and the August Consort, the Middle Maiden of the Dipper;\nThe Star of Ruin in the Horse and Life, Celestial Pass of the Heavenly Assembly, Nine-Tiered Jade Tower, Sovereign of the Total Spirit of the Nine Primordials, August Sovereign of the Northern Canopy, and the August Consort, the Youngest Maiden of the Dipper.\n\nRespectfully invoked are the Seven Numinous Great Spirits, the Nine Essences of the Imperial Dawn, the Four August Ones who bend their gaze in condescension. May they, in compassion for this sincere heart, deign to descend in cloud-borne chariots, their sacred radiance stirring.\n\nTogether with the Lord of Central Harmony, the Lord of Myriad Blessings, the Lord of Extended Longevity, the Lord of Cherished Life, the Lord of Bright Calculation, the Lord of Preserved Records, the Lord of Fixed Destiny, the Lord of Rewarding Goodness, the Lord of Answering Wishes, the Divine Lads and Jade Maidens, the Direct Talismans and Direct Officers, the Perfected Generals and Cavalry Attendants, and all their official retinues—may they all descend upon this open altar within [Name]’s village, observe the earnest devotion of this supplicant, and partake of this humble offering.\n\nThis servant, [Name], shares a bond of Dao and righteousness with [Name], enduring and karmically linked, their affection akin to flesh and blood, their hearts united in devotion.\n\n[Name] surrenders life to the Nine August High Ones, the Seven Sacred Great Spirits, the Supreme Perfection of the Great Dao, and the Venerable Lords.\n\nThis servant, [Name], with awe and trepidation, bows twice in reverence.\n\nFurther, the wine is poured into cups, lifted three times, and offered thrice, completing nine offerings of wine, thus fulfilling the ninefold libation.\n\nThe disciple, a servant of the Three Treasures, [Name], now addresses the Seven Numinous Great Spirits, the Nine Essences of the Imperial Dawn, the Illustrious High Ones, the Lords of Virtue and Power, and all the Perfected Spirits:\n\nToday, with utmost sincerity, [Name], of [State], [Commandery], [County], [Village], [Residence], presents this written petition, humbly reciting as follows.\n\nThis servant prostrates in hope that all the divine luminaries will reflect upon these words and, together with the modest offerings now set forth, accept the life-bound silken banners of [X] feet, presented before the Jade Mechanism of the August Sovereign and Consort corresponding to [Name]’s destiny. May they redeem and ransom [Name]’s fated expiration, beseeching the grace of renewal.\n\nMay the August Sovereigns and Consorts, moved by this sincere plea, partake of these humble offerings and bear witness to this covenant.\n\nIt is humbly prayed that the assembled spirits will exhort the August Sovereigns and Consorts to bestow compassionate grace, respond to this entreaty, and grant [Name] perpetual freedom from calamitous illness, sparing them from the sorrow of mortal affliction, delivering them from unforeseen misfortune. May all disasters dissolve, every endeavor align with the heart’s desire, and every aspiration be fulfilled. May this sincere devotion be conveyed through this servant.\n\nThis servant, though unworthy, has presumptuously joined the true teaching, aspiring to propagate the mysterious wind, to succor all beings, placing others before self, and never daring to slacken.\n\nNow, unable to contain this earnest and reverent devotion, this servant ventures to present this humble plea.\n\nYet human life is ever in motion, truly beset by many [lacuna]. Through ignorance and darkness, one strays from the true path, leading to delusion and loss of the correct Way.\n\nUpon reflection, principle resides in the realm of existence, and one cannot be without mind. What the mind pursues must be to dispel darkness and seek illumination. Illumination must be polished and brought forth by the sacred and numinous. When the mysterious reward is granted, the sacred permits gratitude; when the divine permits mercy, mercy arises from sincerity. Gratitude is tied to the purification of the heart. When the heart is exhausted, repentance for boundless transgressions begins; when sincerity is complete, the rites of offering must be respectfully presented. When the rites are perfected, divine protection will surely arrive; when transgressions are absolved, virtuous wishes will surely harmonize.\n\nIn accordance with this principle, this servant dares to lay bare this sincere heart.\n\nThe ancient sages offered sacrifices to Heaven in the wilds and to Earth in the open, gazing in reverence toward mountains and rivers. The former sages bequeathed these rites in their external counsels, and later sages upheld them to perfect virtue. As for invoking the Five Elders to pray to the Great One, summoning the Eight Numinous Ones to attract the Six Spirits—these mysteries were already expounded in the inner teachings, and the luminous decrees followed to propagate the Dao. Ranks and positions are ordered, their wonder lying in the absence of deviation.\n\nThus, in offering and cultivation, one acts according to intent, presenting gifts in due season. The noble do not disdain abundance, nor do the humble restrict themselves to frugality.\n\nAzure silk adorned with *lin* and *feng* birds, jade-like wine and nectar of jasper—these are the provisions of those who ascend to the heights, not the means of the lowly and impoverished.\n\nAs for the offerings of swans and egrets to the Supreme Emperor, or the tender *ping* and *zao* herbs presented to the august deities—these are not rites this humble servant may perform, nor are they the ultimate expression of this sincere devotion.",
      "overlap_context": "acter *yan* (言) is written one character below the top, with the rest left blank. On the following line, the divisions are filled sequentially to the edge of the column, ensuring no misalignment within the borders. After the border, three lines are left blank, followed by the servant’s name [Name]. Three lines later, the Year-Star’s surname is recorded. In the central line, the forty-five characters from *Tai Shang* (太上) to *Bi Xia* (陛下) are written in smaller script, divided into three sections",
      "start_char": 5703,
      "end_char": 6972,
      "start_sentence": 164,
      "end_sentence": 204,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.430394649505615,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清河图内玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "某今刷贫依法，供办酒脯盐豉等味，然灯照曜，以秉发皇灵，烧香腾启，以仰期感应。 是以濯浣身神，投命玄极，竭其归仰之丹心，不愿轻微之菲陋。 伏愿明灵大圣，至真尊神，特赐愍佑，副其翘勤。 臣恐谴重功微，方罹殃考，性命难保，子孙难得，所向乖心。 今仰凭玄真善成无弃，谨自整洁，洗濯身心，为某首舍众衅。 某从无始世界以来，经劫无数，或为男女人，至于今生转轮未息。 或尝运性鄙蔽，立志猖狂，不信大道，不敬神明，为子不孝，为父不慈，为君不道，为臣不忠，为兄不友，为弟不和，为长不慎，为幼不恭，为师主不敬，为弟子不谨，为朋俦不义，为宾友不诚，为姑不笃，为妇不虔，为母不爱，为姨不敦，为舅氏不穆，为伯叔不仁，为娣姒不顺，为妾媵不谦，为夫妻不睦，为嫡庶不平，为内不静，为外不明，为上不轨，为下不清，为贱不逊，为贵不廉，为男不洁，为女不贞，不达义方，不了妙趣，芒昧玄宗，留连世务，尘路思着，俗海忘超，五情六欲，触荡精神，三毒七积，挠乱心志，业行不专，取舍非一，进退无恒，异端盈臆，道风既亏，世范又缺，身与年衰，衅随日结，动不顾利，静不修戒，深福大善，永不议作，巨祸洪恶，日夜竞为。 或有急之日暂存道，小宽之辰辄忘真，返逆无状，纵横肆心。 或凭威乘势，恃宠强梁，或毁道败德，杀害君亲，破坏经图，攻伐师尊，诛伤同气，杀戮友朋，酷虐万类，轻誷百灵。 或发泄冢墓，开他棺椁，刑尸罚鬼，惊骸动神，欺灭侪党，痛感天人。 或斩斫神主，焚烧社庙，阴怀谋逆，阳论顺命，嫉妬胜己，谗谤忠贞，纵逞楚毒，抑绝贤明，捐交弃好，苦克邦乡，谮善长恶，讪诮才良，悭贪益己，不愿施人，割夺四辈，唯润一身，食啖百姓，受取万端，得无厌足，侵略人神。 或藉贵怙富，凌贱孤贫，或略人所爱，离隔六亲，分绝骨肉，断遏四邻。 或蒸通九属，淫犯万殊，恣溢失度，謟忌无拘，强相咒咀，妄加善人，叫唤骂詈，牵引鬼神，指斥日月，告诉星辰。 或劝人作恶，不教童蒙，暗任纵横，观人成败。 或好色耽酒，丽饰自玩，胸心颠倒，粗恶险暴，歌哭无常，举止不觉，掊击东西，翻覆南北。 或手肆凶逆，或侠他行虐，或妄触人神，叨忤清净，慠突明灵，评论经教，诽诮正法，违负信约，欺诱娇诈，妖媚谀佞。 或嗔恚忿恨，残克自高，唝嗃并势，贪婪日结。 或戏谑胜负，冈蔑尪微，诳惑朝野，嘲调闺帏。 或外伪刚直，内怀曲刃，干知是非，以退为进，强占星宿，卜相自衒，妄期祸福，表里无信，面誉背毁，巧言令色，误脱家邦，破乱宗国。 或不敬明德，不纳忠言，阴嫉高胜，潜害英能。 或假托神鬼，诈称天灵，窃予妄言，妖惑百姓，扇动天地，骇怛神明。 或断截人路，逼迮母子，闭塞人善良，抑绝人休美。 或积药思人病，蓄棺愿老死，訾人学方，自誉己业，虚造生空，妄作一法，不达权化，谬怀疑贰。 或因公行私，迷误后世，好乐臭腥，忌要芳净。 或驰骋田猎，呵骂风雨，奸盗劫贼，刺射天地。 阴罪阴过，阳罪阳过，死罪死过，幽显遍知，反理违经，犯律破戒，上负三光四时五行，下忤万象九宫六甲，中触里域神祇，冢宅精灵，先亡魂爽，井灶门庭，出入户路，履历庄衢，经涉失祀，所在违和，处处犯禁，种种成□。",
      "translated_text": "This humble servant, though impoverished, has prepared according to the law offerings of wine, dried meats, salt, and fermented beans, and kindled lamps to illuminate and invoke the radiant numen. I burn incense to ascend my prayers, hoping for a response. Thus, I purify my body and spirit, entrusting my fate to the Mysterious Ultimate, exhausting the cinnabar sincerity of my devotion, undeterred by the meagerness of these humble offerings.\n\nI humbly beseech the luminous spirits, the great sages, the perfected and august deities to bestow their compassionate protection and fulfill my earnest supplications. This servant fears that my transgressions are grave while my merits are slight, that I may soon suffer calamity and affliction, my life imperiled, my descendants lost, and all my aspirations thwarted.\n\nNow, relying on the Mysterious Perfection to bring good to completion without abandonment, I have meticulously cleansed myself, washing body and heart, offering myself first to atone for all transgressions.\n\nFrom the beginningless world through countless kalpas, I have transmigrated without cease—now as man, now as woman—until this present life. At times, my nature has been base and obscured, my resolve reckless and wild. I have failed to believe in the Great Dao, failed to revere the divine. As a child, I was unfilial; as a father, unkind. As a ruler, I lacked the Way; as a minister, loyalty. As an elder brother, I was unfraternal; as a younger, discordant. As an elder, I was careless; as a youth, irreverent. As a teacher, I was disrespected; as a disciple, negligent. As a friend, I was unrighteous; as a companion, insincere. As an aunt, I was unkind; as a wife, irreverent. As a mother, unloving; as a sister-in-law, undutiful. To my maternal uncles, I was disrespectful; to my paternal uncles, unbenevolent. To my sisters-in-law, I was unyielding; to my concubines, arrogant. With my spouse, I was disharmonious; among my children, unjust. Within, I was restless; without, unclear. To my superiors, I was unruly; to my subordinates, impure. To the lowly, I was insolent; to the noble, corrupt. As a man, I was unclean; as a woman, unchaste. I failed to grasp the principles of righteousness, failed to comprehend the subtle wonders. I was ignorant of the Mysterious Origin, entangled in worldly affairs, my thoughts mired in the dusty paths, forgetting to transcend the sea of俗. The five passions and six desires disturbed my spirit; the three poisons and seven accumulations confounded my heart. My deeds lacked focus, my choices were inconsistent, my conduct wavering. Heretical thoughts filled my mind, the Dao’s influence waned, and the world’s standards crumbled. My body and years declined, my transgressions accumulated daily. In action, I disregarded benefit; in stillness, I neglected precepts. Profound blessings and great goodness I never considered; vast calamities and grievous evils I committed day and night.\n\nAt times, in urgency, I briefly upheld the Dao, only to forget the True when circumstances eased. I acted perversely, indulging my will without restraint. Sometimes, I relied on power and influence, wielding authority with arrogance. At others, I undermined the Dao and corrupted virtue, harming rulers and kin, destroying scriptures and diagrams, assaulting my teachers, injuring my peers, slaughtering friends, oppressing all beings, and scorning the spirits. I desecrated tombs, opened coffins, mutilated corpses, punished ghosts, disturbed bones, and startled the dead, causing pain to my companions and distress to heaven and humanity. I hacked at spirit tablets, burned shrines, secretly plotted rebellion while outwardly feigning obedience. I envied those superior to me, slandered the loyal and steadfast, unleashed cruelty, suppressed the worthy, abandoned friends, tormented my homeland, slandered the good, mocked the talented, hoarded for myself, and refused to give to others. I seized from all quarters to enrich myself alone, devoured the people’s livelihood, and extorted in myriad ways, never satisfied, encroaching upon gods and men.\n\nAt times, I exploited my status or wealth to bully the lowly and orphaned, or seized what others loved, severing the six relations, cutting off kin, and isolating neighbors. I violated the nine degrees of kinship, indulged in myriad perversions, lost all restraint, schemed without scruple, cursed others, and falsely accused the virtuous. I railed and reviled, invoking ghosts and spirits, pointing at the sun and moon, and lodging complaints with the stars. I encouraged others to do evil, failed to teach the young, acted recklessly in darkness, and watched others succeed or fail. I indulged in lust and wine, adorned myself for vanity, my heart and mind inverted, my nature coarse, cruel, and violent. My laughter and tears were erratic, my conduct unchecked. I struck out in all directions, overturning all before me. At times, my hands committed violence; at others, I abetted others’ cruelty. I recklessly offended gods and men, disturbed the pure and tranquil, and arrogantly defied the luminous spirits. I criticized the scriptures and teachings, slandered the true Dharma, betrayed promises, deceived with cunning, flattered with seductive words, and fawned with insincerity. I was wrathful and resentful, cruel and domineering, arrogant and overbearing, my greed growing daily. I gambled for victory, mocked the weak, deceived the court and the countryside, and ridiculed the inner chambers. Outwardly, I feigned integrity while inwardly harboring treachery, manipulating right and wrong to advance my ends. I forcibly claimed the stars, boasted of my divination, falsely predicted fortune and misfortune, and acted duplicitously, praising to the face and slandering behind the back. With honeyed words and false smiles, I misled my homeland and disrupted my ancestral state. I disrespected the virtuous, rejected loyal advice, secretly envied the excellent, and covertly harmed the capable. I impersonated gods and spirits, falsely invoked the celestial, spoke deceitfully, and bewitched the people, stirring heaven and earth, startling the divine. I blocked roads, separated mother and child, obstructed the good, and suppressed the virtuous. I stockpiled medicines to wish illness upon others, hoarded coffins to await their deaths, disparaged others’ learning while praising my own, fabricated empty doctrines, and misapplied a single method, failing to grasp the subtleties of transformation and harboring doubts. I used public office for private gain, misled later generations, delighted in foulness, and shunned purity. I galloped in the hunt, cursed the wind and rain, committed robbery and theft, and shot arrows at heaven and earth.\n\nMy transgressions—whether hidden or manifest, mortal or spiritual—are known throughout the unseen and visible realms. I have defied reason, violated the scriptures, broken the laws and precepts. Above, I have betrayed the Three Luminaries, the Four Seasons, and the Five Phases; below, I have offended the myriad phenomena, the Nine Palaces, and the Six Jia. In between, I have disturbed the local deities, the spirits of tombs and dwellings, the souls of my ancestors, the hearth and gate gods, the spirits of roads and thresholds, and all the deities of the paths I have trodden. Wherever I have gone, I have neglected sacrifices, violated harmony, and broken prohibitions, accumulating transgressions in every place.",
      "overlap_context": "dance, nor do the humble restrict themselves to frugality.\n\nAzure silk adorned with *lin* and *feng* birds, jade-like wine and nectar of jasper—these are the provisions of those who ascend to the heights, not the means of the lowly and impoverished.\n\nAs for the offerings of swans and egrets to the Supreme Emperor, or the tender *ping* and *zao* herbs presented to the august deities—these are not rites this humble servant may perform, nor are they the ultimate expression of this sincere devotion.",
      "start_char": 6972,
      "end_char": 8217,
      "start_sentence": 205,
      "end_sentence": 230,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.34113144874573,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清河图内玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "或知而故为，或谬误不觉，或被迫从人，或身心自构，或忍而无悔，或悔而未谢，或谢而又犯，未能长革，或久谪衅探，未能永悛，或日积月深，无限无量，不可具陈，或中表相牵，内外相染，男女大小，一切眷属，后世今生，俱有罪过，更相延误。 或同谋共作，或尊上使为，或悬相要拟，傍生罪根，因缘在彼，自不觉知。 或操不坚，被试不过，神鬼遘怨，师徒连祸，先仇宿对，方未解释，后晚结咎，稍复滋繁。 或尝为奴婢，役使胡夷蛮貊，戎狄氏羌，鱼乌虫兽，魔邪精魅，穷粗极丑，更相食啖，雠报未终。 所陈条目，略而未尽，回环历劫，不可忆知，犯与不犯，不自分别，各在两宫七十四部，事简三元百二十曹，结咎既深，考在不测，将虑一日一奄同尘壤，小事云处世规图，惧不如心。 某今投命九皇大圣尊神，仰凭至德，特乞降佑，赐垂慈恩，令五岳使者，即颁下所由，随源料理，罪文咎结，一切解除，以宥其谪，断绝恶根，积衅累愆，悉蒙洗荡，辅导信心，开通善路，正气流滋，贵神保护。 某已往之衅都洗，即今之愆悉除，当来之尤不生，从善之志日进，上学之愿无退，修经习戒，以今为始。 三界五帝六甲九宫玄洲灵洞主土真官，无量仙圣一切善神，赐纳臣言，同记今请，矜某首洗之丹心，愍某自新之慊志，采臣劝善之誓言，副臣归仰之丹诚，令都天监司过君，延生之局增福之司，咸共削某黑簿，注名青文，令众灾度脱，寿命延长，长保福庆，合门兴隆，凶妖消散，善愿咸从，梦想真正，冢宅安宁，止殃灭注，内外同休，以显玄神明信之验，以酬某元元之心。 随意续言，每在省约。 某又一上酒毕，各三过止。 臣某重启九皇尊神，七圣明灵，一切正神，臣以刍陋，生长流俗，不闲妙法，恐所施失仪，言辞饕餮，触忤威灵，进止违典，举事□深，惧不能相济，还婴咎责。 特愿明灵曲垂照愍，哀矜不及，奖成善心，不加谴罚，宿衅蒙原，臣所愿皆得谐心。 欲有愿乐，随意言之。 某荷恩之日，并依科重献诚礼，一如今夕。 某伏愿明灵大神，一切真官，同垂慈恩，共赐开导，与善相因，神灵奖悦，所启所愿，即蒙御闻，今夜所请，必遂如心，则仰荷明神更造之恩。 今乞洪泽浃润某身，请以余杯，赐某饮进，令神炁降洽，善愿克谐。 取此人命所属酒一杯，与饮之。 臣上启九皇大神，明灵高尊，道德诸君，一切善神，向有某甲为某事云，臣与道义，因缘冒昧干请，仰屈威灵临鉴已久，不敢稽淹神驾，愿各还本官，安神复御，垂神流恩，以景福祚延长，约勅所在土地真官，宅舍善吏，堂宇僚局，明各荣卫某身及臣，使积罪永除，福名更始，令所请如启，所愿必遂，不孤至向，须后有请，仰希重降。 臣某诚惶诚恐，稽首再拜。 送神，依次拜送。 拜送神，亦可都再拜而已，仍伏叩头，乞升车之恩，必副元元之情，欲有所言，随人意密道毕，起复炉。 若度事后即醮，未可复炉，仍设醮，醮竟，复炉也。 醮毕，取第一杯酒少许灌地，不必令尽。 若欲以治病，病人所属星杯，可取与饮之。 无病厄者，悉出外，赋作礼敬进之。 勿及异人疑怪，彼此得罪。 其所识，悉笃信无嫌者，皆得分之。 若度事之后，别时设醮，或自为、为人乞愿请恩，并存神竟，扣齿发炉。",
      "translated_text": "Should some transgressions be committed knowingly, others by unwitting error; some under coercion by others, others self-wrought in body and mind; some endured without remorse, others repented yet unatoned; some atoned yet repeated, never fully reformed; some long exiled by fate’s probing, never truly reformed; some accrued day by day, month by month, boundless and immeasurable, beyond full recounting—\n\nOr entangled by kinship, tainted by inner and outer influences, where men and women, young and old, all kinfolk, in past lives and this, share in guilt, each leading the other astray. Some conspire together, some act at the behest of superiors, some bound by mutual pledges, sowing the roots of sin in others, their karmic ties unseen.\n\nOr wavering in resolve, failing trials, incurring the wrath of gods and ghosts, entangling masters and disciples in misfortune; old grudges unresolved, new faults compounding, growing ever more intricate.\n\nOr once enslaved, made to serve Hu, Yi, Man, Mo, Rong, Di, Qiang, fish and birds, insects and beasts, demons and malevolent spirits—creatures coarse and vile—devouring one another in endless cycles of vengeance unfulfilled.\n\nThe offenses listed here are but a fraction, unending through kalpas, beyond memory or reckoning. Whether committed or not, one cannot discern, for all are recorded in the Two Palaces and the Seventy-Four Bureaus, their cases reviewed by the Three Primes and the One Hundred Twenty Offices. With guilt so deep, judgment lies beyond measure—fearing that in a single day, one may return to dust, and even minor matters may fall short of worldly expectations.\n\nNow, I entrust my fate to the Nine August Great Sage Honored Deities, beseeching their supreme virtue to bestow protection. May they grant compassion, commanding the Envoys of the Five Peaks to dispatch their agents, tracing the roots of my transgressions to dissolve all records of guilt and entanglements, pardoning my exile, severing the roots of evil, washing away accumulated offenses and burdens. May they guide my faithful heart, open the path of goodness, let the flow of upright qi flourish, and grant the protection of noble spirits.\n\nMay all my past offenses be cleansed, present faults erased, and future wrongs never arise. May my resolve to do good grow daily, my aspiration for higher learning never wane, and my study of scriptures and precepts begin anew from this day.\n\nMay the Lords of the Three Realms, the Five Emperors, the Six Jia, the Nine Palaces, and the Mystic Continent’s Cavern Masters, along with the countless immortals and sages, all benevolent spirits, heed my plea. Take note of my earnest repentance, pity my resolve to renew myself, accept my vow to encourage goodness, and fulfill my sincere devotion. May the Overseers of the All-Heaven Judgment Bureau, the Bureaus of Longevity and Fortune, together erase my name from the Black Register and inscribe it in the Azure Script. May all disasters be averted, my lifespan extended, and lasting blessings secured for my family’s prosperity. May malevolent omens dissipate, all good wishes be granted, dreams be true, tombs and dwellings peaceful, calamities cease, and inner and outer realms harmonize—revealing the efficacy of the mysterious and divine, repaying my deepest hopes.\n\nNow, as I continue my words, let them remain measured and concise.\n\nI offer wine once more, thrice in all.\n\nI, [Name], humbly address the Nine August Honored Deities, the Seven Illustrious Spirits, and all the righteous gods. Born of humble origins in the mundane world, untrained in subtle Dharma, I fear my offerings may lack propriety, my words coarse and excessive, offending your majesty, my conduct violating ritual, my actions deeply flawed. I dread failure and the return of blame.\n\nMay your luminous spirits graciously look upon me with compassion, pitying my inadequacies, fostering my good intentions, and sparing me from punishment. May past offenses be pardoned, and all my wishes fulfilled.\n\nShould I have further desires, I shall express them as I will.\n\nFrom the day I receive your grace, I shall offer sincere rites as prescribed, just as tonight.\n\nI prostrate myself, praying that the luminous great spirits and all true officials bestow their compassion, guiding me toward goodness, delighting in my devotion. May all my petitions and wishes be heard, and tonight’s pleas granted as my heart desires—so that I may forever bear the boundless grace of your renewal.\n\nNow, I beseech your vast blessings to saturate my being. I offer the remaining wine, asking you to drink and let the divine qi descend upon me, fulfilling my good intentions.\n\nI take this cup of wine, belonging to the star governing my life, and drink it.\n\nI, [Name], address the Nine August Great Deities, the Illustrious and Exalted, the Lords of Dao and Virtue, and all benevolent spirits. Regarding [Name]’s matter of [specific request], bound by Dao and righteousness, I have presumptuously entreated your majesty to witness my plea for some time. I dare not delay your divine presence further. May you return to your respective offices, settle your spirits, and resume your thrones, bestowing divine grace to extend blessings and longevity. I command the local earth deities, the household spirits, the officials of halls and chambers, to safeguard [Name] and myself, permanently erasing our accumulated sins and renewing our fortunes. May all requests be granted as stated, all wishes fulfilled, and my devotion never in vain. Should future petitions arise, I humbly await your return.\n\nI, [Name], in awe and reverence, bow twice in prostration.\n\nSend off the deities in due order, bowing as you do.\n\nWhen sending off the deities, one may simply bow twice, then kneel and kowtow, beseeching the grace of their ascent. If further words are needed, speak them privately as you wish, then rise and close the incense burner.\n\nIf the ritual follows immediately after the matter’s resolution, do not close the incense burner; instead, proceed with the offering. After the offering concludes, then close the incense burner.\n\nUpon completing the offering, pour a small amount of the first cup of wine onto the ground—no need to empty it.\n\nIf treating an illness, take the cup belonging to the patient’s governing star and let them drink.\n\nIf no illness or misfortune afflicts others, have them all step outside, perform rites of respect, and present the wine.\n\nDo not involve strangers or arouse suspicion, lest both parties incur offense.\n\nOnly those known and trusted without doubt may partake.\n\nIf, after the matter’s resolution, a separate offering is held at another time—whether for oneself or another, to seek blessings or grace—once the invocation of spirits concludes, strike the teeth and open the incense burner.",
      "overlap_context": "he Three Luminaries, the Four Seasons, and the Five Phases; below, I have offended the myriad phenomena, the Nine Palaces, and the Six Jia. In between, I have disturbed the local deities, the spirits of tombs and dwellings, the souls of my ancestors, the hearth and gate gods, the spirits of roads and thresholds, and all the deities of the paths I have trodden. Wherever I have gone, I have neglected sacrifices, violated harmony, and broken prohibitions, accumulating transgressions in every place.",
      "start_char": 8217,
      "end_char": 9463,
      "start_sentence": 231,
      "end_sentence": 258,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.66477108001709,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清河图内玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "若入坛堂，漱咒如法。 凡学士功轻，未能得道传授灵文，更相开度，建德立功，良时吉日祈请玄恩，同先谢过。 生由九炁，成由九天，学由九业，品极九阶，仙真及圣，各有经法，习之未周，不能免咎，有所云为皆悔罪为端，然后恩佑不求自至。 求福以着入微，故先阳明至辅弼，除罪以微至着，故先辅弼以至阳明。 谢文贵赋，前辞消息，受事请恩，依源廷诏，唯首谢正同，迎送不异。 危急修之，可略谢耳。 观星要法 凡受九皇讳后，良夜请天，恒谛观北斗，存识次第内外姓名，思见神降，与己语言。 次觅辅弼，令得见形，精心注仰，久自睹之。 观星唯密，勿令他知，或有问者，余言答之，不得泄露，通其所视，见与不见，皆莫出言，心之与眼相知而已。 观星之时，洗净身炁，垢则沐浴，秽则易衣。 衣服芬馨，内外净洁，烧香所止，存启玄灵，熟看经图，分明忆识，然后出视，勿忽遑高言，又勿多人，同志可三耳。 同志才非，亦勿与共，各处为之，勿相访问。 有事劳倦，醉饱交接，调和未平，皆勿仰观。 又醮祭谢过，礼拜乞恩，积久无征，由於不观。 观虽未见，诚至心感，稍稍懃之，永不懈退，必获了然，见则神降，醮礼即验，兼济无穷。 不能精心习学仰观，魔来坏人，凶怪相动，醮礼空费，劳而罪臻。 有志之人，明相警戒。 九星所摄，各有分野，占候吉凶，往来出入住止，求须营理，道俗皆当精察，以定所宜，可否去就，回败为成，寻贤得贤，访圣得圣，所作利贞，长保元吉矣。 事九皇王君，昼夜行卧坐息，饮食交接云为，恒思见之，俯仰屈伸，念念不忘，九年神降，受长生之诀也。 天中心号北辰，有五星。 第一大星，名天枢，为母，第二天子，第三太子，第四次子，第五名北极，天一所生。 太一所居止在紫宫。 紫宫东八星，西七星，列为藩臣，中央紫微宫，太一常舍，为五官二十八宿，金木水火土属五星，五星五属，北斗属太一，太一为极，位居最尊。 北斗九星宿卫太一，占其吉凶善恶，诀如左。 北极空洞正天之中，北极在此空之南，此空之在北极之北，故曰北辰，众星共之。 第一为魁头，名天枢天，一名正星，字贪狼，位御史中丞，为天为日，主阳德，天子象，以壁室奎娄为徐州，主五子，岁星。 第二地璇，一名法星，字巨门，位大司马，为地为月，主阴刑，女主象，以胃昴毕赀为梁州，后分为益州，主五亥，太皇星。 第三人玑，一名命星，字禄存，位少府，为人道，主祸，以参井鬼柳为冀州，主五戌，荧惑星。 第四物权，一名伐星，字文曲，位司徒光禄，为四时，主伐无道，以七星张翼轸为荆州，主五卯，辰星。 第五玉衡，一名杀星，字廉贞，位大鸿胪，为杀有罪，以角亢氏房为兖州，主五辰，镇星。 第六闿阳，一名危星，字武曲，位廷尉，为食谷，以心尾箕为扬州，主五色，岁星。 第七瑶光，一名部星，字破军，位执金吾，为兵，以斗牛女虚危为豫州，主五午，白星。 第八为外辅，在北斗第六星下，相去一寸许。 第九为内辅，一星在北斗第三星上，不可得见，见之长成神圣也。 占八星，审同里，其位有灾，其境有害，皆宜避之。 小则厌禳，修功德，立礼醮来恩，密而勿言，祸消福集矣。",
      "translated_text": "If entering the altar hall, rinse and recite the incantation according to the proper method.\n\nFor those whose cultivation is shallow and who have not yet received the transmission of sacred texts from the Dao, they may mutually initiate and guide one another, establishing virtue and merit. On an auspicious day and at a propitious hour, they may pray for profound grace, first giving thanks for past transgressions.\n\nLife arises from the nine *qi*, completion from the nine heavens, learning from the nine disciplines, and rank culminates in the nine grades. Immortals and sages each possess their own scriptures and methods; if one’s practice is incomplete, one cannot avoid fault. Whatever one undertakes must begin with repentance for sins, and only then will grace and protection arrive unbidden.\n\nTo seek blessings, proceed from the subtle to the manifest—thus, begin with *Yangming* and proceed to the *Fubi*. To remove transgressions, proceed from the manifest to the subtle—thus, begin with the *Fubi* and proceed to *Yangming*. The efficacy of repentance lies in its sincerity; the opening words must convey the ebb and flow of intention. When receiving tasks or seeking grace, follow the original decree from the celestial court. The primary repentance should be uniform, and the rites of welcoming and sending off should not differ. In times of peril, the repentance may be abbreviated.\n\n**Essential Methods for Observing the Stars**\n\nAfter receiving the taboo names of the Nine August Ones, on a clear night, invoke the heavens and diligently observe the Northern Dipper. Visualize and memorize the order of the stars, their inner and outer names, and imagine the descent of the deities, speaking with them in your mind. Next, seek the *Fubi* stars, striving to perceive their forms. With focused concentration and reverent gaze, you will eventually behold them.\n\nThe observation of stars must be kept secret; do not let others know. If questioned, respond vaguely. Do not reveal anything, whether you see them or not—utter no word of it. Only the heart and eyes may share this knowledge.\n\nWhen observing the stars, purify your body and *qi*. If defiled, bathe; if impure, change your garments. Clothing should be fragrant, and both inner and outer aspects immaculate. Where incense burns, invoke the mysterious spirits. Study the scriptures and charts carefully, memorizing them clearly before gazing outward. Do not speak carelessly or boastfully, and do not gather many people—only two or three like-minded companions. If a companion lacks the proper resolve, do not observe with them; each should practice separately, without visiting or inquiring of one another.\n\nIf fatigued, intoxicated, sated, or after conjugal union, or if one’s *qi* is unsettled, do not look upon the stars. Furthermore, if offerings, repentance rites, prostrations, or prayers for grace yield no signs over time, it is due to a lack of observation. Though one may not yet see the stars, sincerity and devotion will gradually bring results. Persist without slackening, and you will surely attain clarity. Once seen, the deities will descend, the offerings will prove efficacious, and boundless aid will follow. If one does not diligently study and observe the stars with a focused mind, demonic forces may assail them, inauspicious omens arise, and offerings will be wasted, laboring in vain while incurring transgressions. Those of resolute intent should take heed and be warned.\n\nThe nine stars govern distinct regions, and their configurations foretell fortune or misfortune in travel, residence, and all undertakings. Both Daoists and laypeople must examine them carefully to determine what is fitting, whether to proceed or withdraw, to transform failure into success, to seek the worthy and find them, to consult the sagely and encounter them. All actions will be upright and enduringly auspicious.\n\nIn serving the Nine August Sovereign Lords, whether by day or night, in movement or stillness, eating, drinking, or conjugal union, constantly visualize their presence. In every posture and gesture, never forget them. After nine years, the deities will descend, and you will receive the secret of eternal life.\n\nThe center of the heavens is called the Northern Asterism, comprising five stars. The first, the great star, is named *Tianshu* (Celestial Pivot), the Mother. The second is the Son, the third the Crown Prince, the fourth the Second Son, and the fifth is called *Beiji* (Northern Pole), born of *Tianyi* (Heavenly One). *Taiyi* (Great One) resides in the Purple Palace. To the east of the Purple Palace are eight stars, to the west seven, arrayed as vassal ministers. At its center lies the Purple Tenuity Palace, where *Taiyi* dwells, governing the five officials and the twenty-eight constellations. The five planets—Metal, Wood, Water, Fire, and Earth—correspond to the five stars, and the five stars correspond to the five phases. The Northern Dipper belongs to *Taiyi*, and *Taiyi* is the Pole, occupying the most exalted position.\n\nThe nine stars of the Northern Dipper guard *Taiyi*, and their auspices—whether fortunate or ill—are determined as follows:\n\nThe Northern Pole is the hollow center of the heavens. The Northern Pole lies south of this hollow, and the hollow lies north of the Northern Pole, hence it is called the Northern Asterism, around which all stars revolve.\n\n1. The first star is the head of the Dipper, named *Tianshu* (Celestial Pivot), also called the *Zhengxing* (Principal Star) or *Tanlang* (Greedy Wolf). It holds the position of Imperial Censor and represents the heavens and the sun, governing yang virtue and symbolizing the Son of Heaven. Its domain is *Xuzhou*, corresponding to the constellations *Bishu*, *Kui*, and *Lou*, and it governs the fifth earthly branch (*chen*), associated with Jupiter.\n\n2. The second star is *Dixuan* (Celestial Rotator), also called the *Faxing* (Law Star) or *Jumen* (Great Gate). It holds the position of Grand Marshal and represents the earth and the moon, governing yin punishment and symbolizing the Queen. Its domain is *Liangzhou* (later divided into *Yizhou*), corresponding to the constellations *Wei*, *Mao*, and *Bi*, and it governs the fifth branch (*hai*), associated with the Grand White Star.\n\n3. The third star is *Renji* (Human Axis), also called the *Mingxing* (Life Star) or *Lucun* (Salary Storage). It holds the position of Chamberlain for the Palace Revenues and represents humanity, governing calamities. Its domain is *Jizhou*, corresponding to the constellations *Shen*, *Jing*, *Gui*, and *Liu*, and it governs the fifth branch (*xu*), associated with Mars.\n\n4. The fourth star is *Wuquan* (Material Balance), also called the *Faxing* (Punishment Star) or *Wenqu* (Literary Curvature). It holds the position of Minister of Education and Grand Master of Ceremonies and represents the four seasons, governing the punishment of the unrighteous. Its domain is *Jingzhou*, corresponding to the constellations *Qixing*, *Zhang*, *Yi*, and *Zhen*, and it governs the fifth branch (*mao*), associated with Mercury.\n\n5. The fifth star is *Yuheng* (Jade Balance), also called the *Shaxing* (Execution Star) or *Lianzhen* (Upright Integrity). It holds the position of Grand Herald and governs the execution of the guilty. Its domain is *Yanzhou*, corresponding to the constellations *Jiao*, *Kang*, *Di*, and *Fang*, and it governs the fifth branch (*chen*), associated with Saturn.\n\n6. The sixth star is *Kaiyang* (Opening Yang), also called the *Weixing* (Danger Star) or *Wuqu* (Martial Curvature). It holds the position of Commandant of Justice and governs the sustenance of grain. Its domain is *Yangzhou*, corresponding to the constellations *Xin*, *Wei*, and *Ji*, and it governs the five colors, associated with Jupiter.\n\n7. The seventh star is *Yaoguang* (Luminous Jade), also called the *Buxing* (Department Star) or *Pojun* (Breaking Army). It holds the position of Commandant of the Capital and governs warfare. Its domain is *Yuzhou*, corresponding to the constellations *Dou*, *Niu*, *Nü*, *Xu*, and *Wei*, and it governs the fifth branch (*wu*), associated with Venus.\n\n8. The eighth star is the *Waifu* (Outer Assistant), located below the sixth star of the Northern Dipper, approximately one *cun* away.\n\n9. The ninth star is the *Neifu* (Inner Assistant), a single star above the third star of the Northern Dipper, which is not ordinarily visible. If seen, it portends the attainment of divine sagehood.\n\nWhen divining the eight stars, examine their positions within their domains. If a star’s position portends disaster or its domain suffers harm, one should avoid it. For minor afflictions, perform exorcisms, cultivate merit, establish rites, and offer repentance to invoke grace—all in secret, without speaking of it. Thus, misfortune will dissipate, and blessings will gather.",
      "overlap_context": "et them drink.\n\nIf no illness or misfortune afflicts others, have them all step outside, perform rites of respect, and present the wine.\n\nDo not involve strangers or arouse suspicion, lest both parties incur offense.\n\nOnly those known and trusted without doubt may partake.\n\nIf, after the matter’s resolution, a separate offering is held at another time—whether for oneself or another, to seek blessings or grace—once the invocation of spirits concludes, strike the teeth and open the incense burner.",
      "start_char": 9463,
      "end_char": 10717,
      "start_sentence": 259,
      "end_sentence": 295,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.446136236190796,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清河图内玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "功德者，万善也。 万行万名，大要唯九： 一者不杀，二者不淫，三者不妄，四者不盗，五者不邪，六者不恚，七者不嫉，八者不慢，九者不滞。 此为九德，得道者也。 一者放生救死，二者赏贞劝洁，三者献忠效信，四者布施除贪，五者节酒守正，六者和释谏诤，七者禁奸止妬，八者敬爱尊卑，九者通忧解患。 此为九功，公无私也。 功行乎外，德定乎内，内立外修，神必密降子。 高才勤行，闭口自验，心传同志，非人勿泄，观见异同，心疏亿之。 此方前后验否可知，无功行者，见之不明，或为邪精化乱其眼，见似而非，言凶反吉，吉更成凶，与书乖越，宜省过内首，然后复观也。 一太上宫中帝君变隐逃元内妃，姓延明，讳太一法坦，字幸正扶，真名 ，衣黄锦帔丹青飞裙，颓云髻。 后八髻同。 二中元宫中帝君保胎化形内嫔，姓开关，讳太一三来瓫，字罗朱婴，真名 ，衣青锦帔绿羽飞裙。 三真元宫中帝君六遁七隐上元圣母，姓溟蒙，讳太一灵夷，字冲双兆，真名 ，衣青锦帔绣羽华裙。 四纽幽宫中帝君匿景藏光中元内妃，姓开耀，讳太一七烈，字横单盘，真名 ，衣紫锦帔黄华羽裙。 五纲神宫中帝君变体易景斗中大女，姓玄路，讳太一郁书，字畴丘兰，真名 ，衣朱锦帔紫青飞裙。 六纪明宫中帝君隐迹散景斗中中女，姓棐廉，讳太一炁精，字抱定陵，真名 ，衣朱锦帔青绣飞裙。 七关会宫中帝君分景万形斗中少女，姓翁重，讳太一郁默，字天凡婌，真名 ，衣丹锦帔青华羽裙。 八帝席宫中帝君化日月水火斗中高皇左夫人，姓常明，讳太一石启珠，字络茂华，真名 ，衣紫锦帔绣羽飞丹裙。 九上尊官中帝君化金石山河斗中高皇右夫人，姓空黄，讳太一爱修，字云育玄，真名 ，衣绿锦帔翠羽华裙。 右九帝君九星斗中宫隐妃九阴名字。 若祝说之时，但说位号名字耳，勿道着衣帔及头结下也。 子能知帝君九阴者，升晨上天，位为上清真人。 兆在世终身不受哭己灾殃，太阴之神卫从，万灵之精拜谒，分形散变，混合天地。 此太阴九妃者，乃帝君之阴官神也。 兆行道解结，奉符上籍，安魂制魄，化生体神道炁，延精以求长生，而不知帝妃之名字，行九阴以混合者，亦万不得仙也。 两眉间却入一寸为明堂，明堂正方一寸，帝君太阴九妃常居其中。 恒以月之偶日，斋用生炁时，烧香入别室，坐卧任意，暝目良久，存帝君安坐在太极紫房中，又存太一五神在六合中，又存北斗九星在心中，又存太阴九妃在明堂中，又存太微童子干景精对立帝君前，童子左手把五符，右手把五籍，又存兆之形立童子后，又存太阴九妃从明堂中，上入太极紫房中，以次横列立兆后，又存太一五神从六合中，上入太极紫房中，以次横列，立太阴九妃后。 都毕，於是帝君众神倏欻一合大变，共为一人，一人如婴儿始生之状，名曰无常童子，字变化，左手把九星，头戴日，口衔月，童子以日月九星之光，映熏兆一身，内外洞彻，自觉兆一身通赤，如火之炎，无复表裹，表裹皆炯炯然也。 此为帝君太一九阴混合变化万形也。 良久毕，叩齿二十四通，咽液九过，乃微祝曰： 洞天神光，回曜紫清，玄阴九晨，  隐沦绝冥，斗中夫人，三女散形，",
      "translated_text": "Virtue is the myriad of good deeds. Though the myriad practices bear myriad names, their essentials number nine: first, refraining from killing; second, refraining from licentiousness; third, refraining from falsehood; fourth, refraining from theft; fifth, refraining from perversity; sixth, refraining from wrath; seventh, refraining from envy; eighth, refraining from arrogance; ninth, refraining from stagnation. These are the Nine Virtues, possessed by those who attain the Dao.\n\nThe Nine Meritorious Deeds are these: first, releasing life and rescuing the dying; second, rewarding chastity and encouraging purity; third, offering loyalty and demonstrating trustworthiness; fourth, bestowing alms and eliminating greed; fifth, moderating wine and upholding integrity; sixth, reconciling disputes and admonishing strife; seventh, prohibiting villainy and halting jealousy; eighth, respecting and loving both high and low; ninth, alleviating sorrow and resolving distress. These are the Nine Meritorious Deeds, impartial and selfless.\n\nMerit is cultivated outwardly, while virtue is established inwardly. With inner foundation and outer practice, the divine will surely descend upon you in secret. Those of exceptional talent and diligent practice may verify this in silence; transmit it only to those of like mind, and reveal it to no others. Observe the differences, and let your heart discern their significance. By this method, the efficacy of past and present may be known. Those lacking merit and practice will perceive it dimly, or their eyes may be deceived by malevolent spirits, seeing what seems but is not—proclaiming misfortune as fortune, or fortune as misfortune—contradicting the scriptures. In such cases, one should reflect on one’s transgressions and repent inwardly before observing again.\n\n1. The first is the Lady of the Supreme Palace, the Hidden and Concealed Consort of the Primordial, surnamed Yanming, with the taboo name Taiyi Fatǎn, styled Xing Zhengfu. Her true name is [omitted]. She wears a yellow brocade mantle and a vermilion-and-indigo flying skirt, her hair bound in a cloud-like topknot—later eight topknots are the same.\n\n2. The second is the Lady of the Middle Prime Palace, the Womb-Protecting and Form-Transforming Consort, surnamed Kaiguan, with the taboo name Taiyi Sanlai Píng, styled Luozhu Ying. Her true name is [omitted]. She wears a blue-green brocade mantle and a green-feathered flying skirt.\n\n3. The third is the Holy Mother of the True Prime Palace, Mistress of the Six Concealments and Seven Hiding-Places, surnamed Mingmeng, with the taboo name Taiyi Lingyi, styled Chong Shuangzhao. Her true name is [omitted]. She wears a blue-green brocade mantle and an embroidered-feather patterned skirt.\n\n4. The fourth is the Lady of the Hidden Light Palace, the Concealing Radiance and Veiling Brilliance Consort of the Middle Prime, surnamed Kaoyao, with the taboo name Taiyi Qilie, styled Heng Danpan. Her true name is [omitted]. She wears a purple brocade mantle and a yellow-flowered feathered skirt.\n\n5. The fifth is the Great Maiden of the Net-Spirit Palace, the Body-Transforming and Brilliance-Altering Maiden of the Dipper’s Center, surnamed Xuanlu, with the taboo name Taiyi Yushu, styled Chou Qiulan. Her true name is [omitted]. She wears a vermilion brocade mantle and a purple-and-indigo flying skirt.\n\n6. The sixth is the Middle Maiden of the Bright Record Palace, the Concealing Traces and Dispersing Brilliance Maiden of the Dipper’s Center, surnamed Feilian, with the taboo name Taiyi Qijing, styled Baoding Ling. Her true name is [omitted]. She wears a vermilion brocade mantle and a blue-green embroidered flying skirt.\n\n7. The seventh is the Youngest Maiden of the Barrier Assembly Palace, the Multiform and Brilliance-Dividing Maiden of the Dipper’s Center, surnamed Wengchong, with the taboo name Taiyi Yumo, styled Tian Fan Shu. Her true name is [omitted]. She wears a cinnabar brocade mantle and a blue-green-flowered feathered skirt.\n\n8. The eighth is the Left Lady of the High Emperor’s Seat Palace, the Sun-and-Moon-Transforming and Water-and-Fire-Transforming Consort of the Dipper’s Center, surnamed Changming, with the taboo name Taiyi Shiqizhu, styled Luomaohua. Her true name is [omitted]. She wears a purple brocade mantle and an embroidered-feather flying cinnabar skirt.\n\n9. The ninth is the Right Lady of the Supreme Venerable Palace, the Metal-and-Stone and Mountains-and-Rivers-Transforming Consort of the Dipper’s Center, surnamed Konghuang, with the taboo name Taiyi Aixiu, styled Yun Yuxuan. Her true name is [omitted]. She wears a green brocade mantle and a kingfisher-feather patterned skirt.\n\nThe above are the Nine Imperial Lords and the Nine Hidden Consorts of the Dipper’s Central Palace, along with their Yin names. When invoking or reciting them, mention only their titles and names, without describing their attire, mantles, or hairstyles.\n\nIf you can master the Nine Yin [names] of the Imperial Lords, you will ascend at dawn to the heavens and be enfeoffed as a Perfected One of the Highest Clarity. Throughout your life, you will be spared the disasters of mourning and calamity. The spirits of the Great Yin will guard and attend you, and the myriad numinous beings will bow in reverence. You will divide your form and disperse your transformations, merging with Heaven and Earth.\n\nThese Nine Ladies of the Great Yin are the Yin officials and spirits of the Imperial Lords. If you practice the Dao, untie karmic knots, present talismans to the celestial registers, pacify the hun-soul, control the po-soul, transform and generate the body’s spirit and qi, and refine essence to seek longevity—yet remain ignorant of the names of the Imperial Consorts and fail to practice the Nine Yin to achieve union—you will never attain immortality.\n\nOne *cun* inward from the space between the eyebrows lies the Hall of Light, a perfect square of one *cun*, where the Nine Yin Consorts of the Imperial Lord constantly reside. Always on the even days of the month, during the hours of living qi, burn incense and enter a separate chamber. Sit or recline as you wish, close your eyes for a long while, and visualize the Imperial Lord seated in the Purple Chamber of the Supreme Ultimate. Then visualize the Five Spirits of Taiyi within the Six Harmonies, the Nine Stars of the Northern Dipper within your heart, and the Nine Yin Consorts within the Hall of Light. Next, visualize the Luminous Essence Lad of the Grand Tenuity standing before the Imperial Lord, the lad holding the Five Talismans in his left hand and the Five Registers in his right. Then visualize your own form standing behind the lad. Afterward, visualize the Nine Yin Consorts ascending from the Hall of Light into the Purple Chamber of the Supreme Ultimate, standing in a horizontal line behind you in order. Then visualize the Five Spirits of Taiyi ascending from the Six Harmonies into the Purple Chamber of the Supreme Ultimate, standing in a horizontal line behind the Nine Yin Consorts.\n\nOnce all is complete, the Imperial Lord and the host of spirits suddenly merge into one, transforming into a single being resembling a newborn infant, named the Eternal Lad, styled Transformation. In his left hand he holds the Nine Stars, on his head he wears the sun, and in his mouth he holds the moon. The lad illuminates your entire body with the light of the sun, moon, and Nine Stars, penetrating you inside and out. You will feel your body suffused with red, ablaze like fire, with no distinction between inner and outer—all radiant and luminous.\n\nThis is the myriad transformations of the Imperial Lord, Taiyi, and the Nine Yin in union. After a long while, conclude by knocking the teeth twenty-four times and swallowing saliva nine times. Then softly intone the incantation:\n\n\"Radiant spirit of the Grotto-Heaven,\nrevolving and illuminating the Purple Clarity,\nNine Mornings of the Dark Yin,\nconcealed and submerged in the unfathomable.\nLadies of the Dipper’s midst,\nThree Maidens dispersing their forms...\"",
      "overlap_context": "hird star of the Northern Dipper, which is not ordinarily visible. If seen, it portends the attainment of divine sagehood.\n\nWhen divining the eight stars, examine their positions within their domains. If a star’s position portends disaster or its domain suffers harm, one should avoid it. For minor afflictions, perform exorcisms, cultivate merit, establish rites, and offer repentance to invoke grace—all in secret, without speaking of it. Thus, misfortune will dissipate, and blessings will gather.",
      "start_char": 10717,
      "end_char": 11965,
      "start_sentence": 296,
      "end_sentence": 326,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.74135899543762,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清河图内玄经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "神妃内化，万物立成，电光雷激，  云雾流铃，九变十化，生丹起青， 太一九女，合化混停，无常纵遁，  沦虚绾冥，锦帔华袂，紫羽飞裙， 左佩隐符，右带虎文，衔火戴斗，  手把绝幡，傍麾八风，四掣景云， 逍遥天纲，化荡七元，蔽伏山河，  巅回五辰，日有塞晖，列宿失真， 分形作百，化躯入千，在火为火，  入林为林，居水为水，入山为山， 所求忽至，所召已前，倏欻适心，  盻目立臻，千种万物，随心所言， 帝君在形，太上玉晨，元英同景，  四文白元，永生天地，保养我身， 口有所道，随意化迁，玉童奉侍，  玉华执巾，神妃献香，四真同轩， 事事物物，皆如我言。 上清河图内玄经竟",
      "translated_text": "The divine consorts transform within, and the myriad things instantly take form. Lightning flashes and thunder crashes, clouds and mists flow like ringing bells. Nine transformations and ten evolutions give rise to cinnabar and bring forth verdant hues. The Nine Maidens of Taiyi unite in harmonious fusion, while the Lad of Impermanence roams freely, vanishing into the void and weaving through the obscure.\n\nAdorned in brocade capes and resplendent sleeves, their skirts of purple feathers take flight. To their left, they bear concealed talismans; to their right, tiger-patterned sashes. They hold the Dipper in their mouths and wear fire upon their heads, grasping the banner of absolutes. Beside them, they command the Eight Winds, and from all four directions, they draw forth radiant clouds. Roaming the celestial net, they dissolve the Seven Origins, concealing mountains and rivers. They turn the Five Celestial Bodies, eclipsing the sun’s brilliance, and the constellations lose their true forms.\n\nDividing into a hundred shapes, their transformed bodies enter a thousand. In fire, they become fire; in forests, they become forests. In water, they become water; in mountains, they become mountains. What is sought arrives in an instant; what is summoned appears before one. In the blink of an eye, desires are fulfilled, and with a glance, all is attained. A thousand kinds and ten thousand things follow the heart’s command.\n\nThe Imperial Lord takes form, and the Supreme Jade Clarity of Tai Shang shares the same radiance. The Primordial Hero and the Four Scripts of White Origin endure with heaven and earth, preserving and nurturing my body. Whatever the mouth utters, transformations follow intent. Jade lads attend in service, jade maidens hold towels, divine consorts offer incense, and the Four Perfected share the same carriage. Every matter and thing conforms to my words.\n\n*The Inner Mystery Scripture of the River Chart of Supreme Clarity* concludes.",
      "overlap_context": " and outer—all radiant and luminous.\n\nThis is the myriad transformations of the Imperial Lord, Taiyi, and the Nine Yin in union. After a long while, conclude by knocking the teeth twenty-four times and swallowing saliva nine times. Then softly intone the incantation:\n\n\"Radiant spirit of the Grotto-Heaven,\nrevolving and illuminating the Purple Clarity,\nNine Mornings of the Dark Yin,\nconcealed and submerged in the unfathomable.\nLadies of the Dipper’s midst,\nThree Maidens dispersing their forms...\"",
      "start_char": 11965,
      "end_char": 12269,
      "start_sentence": 327,
      "end_sentence": 336,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.628396272659302,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\上清河图内玄经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}