{
  "source_id": "上玄高真延寿赤书",
  "source_file": "chunked_daozang\\上玄高真延寿赤书.json",
  "total_chunks": 7,
  "total_original_chars": 6310,
  "total_translated_chars": 39432,
  "total_translation_time": 202.57971668243408,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\上玄高真延寿赤书.txt",
    "category": "方法类"
  },
  "full_translation": "**The *Red Writ of the Supreme Mystery’s Lofty Perfected for Prolonging Life***\n\n**Title:** *The Red Writ of the Supreme Mystery’s Lofty Perfected for Prolonging Life*\n**Author:** Pei Xuan of the Tang Dynasty\n**Volume:** One\n**Source:** *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, Methods Category\n\n---\n\n**Memorial Presenting the Red Writ for Prolonging Life**\n*Memorial from Pei Xuan, Hermit of Mount Zhongnan, to the Throne*\n\nYour subject has heard that what illuminates the eight wilds is the sun, and what resounds through ten thousand ages is the Dao. Thus, true clarity does not arise from antiquity alone, nor does the body of virtue lie beyond oneself. For this reason, the sage purifies the heart to attain the Supreme Dao as effortlessly as treading upon level ground.\n\nNow, qi has no fixed form, yet it aligns with the constancy of the Dao—yielding yet unyielding, elusive yet inescapable. In its subtlety, it may seem small, but in its vastness, it is boundless. Your humble subject, fortunate to live in an age of sagely rule, has been granted the honor of emulating the recluses Chao and You. Dwelling in the heart of the mountains, where the transformative power of the Dao moistens all things, I have pored over the classics of the Ru and sought the subtle truths of Daoist scriptures. Therein, I encountered the Perfected Words of the Immortals for preserving life, and my thoughts turned to the eternal longevity of the sovereign and his kin. These Perfected Words, though veiled in secrecy and obscured by the dust of ages, are as clear as the mirror of Heaven. Yet, fearing that my private devotion might weary the sagely gaze, I have distilled their essence, giving voice to their true resonance. What is presented here is but a single thread of their luminous whole, a modest offering of what little I have grasped. For joy eases accomplishment, and what is seen does not unsettle the common mind—this is the very Dao of imperial supremacy.\n\nAs the scriptures say: *\"When kings and lords attain the One, they become the standard for all under Heaven.\"* These are no empty words! This work is indeed the ladder by which the Supreme Mystery’s Ancient Perfected ascend to eternal life. Thus, I have titled it *The Red Writ of the Supreme Mystery’s Lofty Perfected for Prolonging Life*.\n\nThe \"Red Writ\" signifies, above, the stellar fire that aids the virtue of Earth; in the middle, the vermilion brilliance of high summer; and below, the crimson sincerity of your humble subject’s devotion. The *Numinous Scripture* states: *\"To bring peace to the realm and turn calamity into fortune, one must employ the Red Writ of the Five Elders as a talisman.\"* Now, as the Three Qi blaze in their seasonal splendor and the divine time of celebration descends, I dare to present this *Writ for Prolonging Life*, hoping to express the rites of felicitous offering.\n\nProstrate, I contemplate Your Majesty, the *August Emperor of the Kaiyuan Era, Sagely in Culture, Divine in Martiality, Who Models Heaven and Embodies the Supreme Dao*—Your Dao fills the vastness of Heaven, Your sheltering grace knows no partiality, Your virtue flows through the depth of Earth, and Your radiance is without end. You do not disdain the words of a shepherd boy; how could You scorn the humble speech of a grass-cutter? If these words are not cast aside as worthless, it will be the great fortune of all under Heaven!\n\nThis scroll contains eight chapters, comprising several thousand characters—all the profound utterances of the myriad sages and lofty Perfected. Held in the palm, it suffices to reveal the Dao of long life.\n\n---\n\n**1. The Rushing Brilliance of the Eastern Marchmount**\n\nYu and Lin are the spirits of the Great Yang and Great Yin, respectively. The Controller of Destinies of the Eastern Marchmount says: *\"By day, visualize the sun; by night, visualize the moon, as if in a small ring. Envision the sun as crimson, radiating nine beams of purple light; envision the moon as yellow, emitting ten beams of white light. Place the sun to the left and the moon to the right, allowing the two luminous essences to merge with the pupils of the eyes and circulate their qi. Swallow the saliva without count, and silently practice this method to gather and refine the generative essence, harmonizing the hun and po. The Six Ding spirits will attend you, and heavenly soldiers will stand guard.\"*\n\nThe Supreme Perfected of the Highest Realms have always kept this secret between sleeve and elbow, transmitting it under solemn oath.\n\nThe Lady of the Southern Culmen says: *\"Visualize within the heart a sun of purple light, the size of a coin, crimson and bearing nine beams. Let it rise from the heart, ascend through the throat to the teeth, then return to the stomach. After a long while, close your eyes—you will perceive the heart, intestines, and stomach with clarity. Exhale, rinse the mouth with saliva, and swallow thirty-nine times before stopping. Practice this thrice daily. After ten years, you will cast no shadow at noon, repel all malign influences, and become an immortal.\"*\n\nThe Lord of the Western City says: *\"Constantly visualize the moon within the Mud Pill. At night, absorb the moon’s radiance as you would the sun’s. Envision the moon with ten beams of white light, descending from the brain into the throat, then returning to the stomach—just as with the sun. The Mud Pill is the spirit of the brain, the most revered among the body’s spirits.\"*\n\nThe *Inner Methods of the Red Lord, Perfected of the Great Void*, states: *\"On the fifth night of each month, at midnight, visualize the moon within the heart. Let the sun enter through the mouth, illuminating the heart’s interior until their lights merge. When complete, you will feel warmth in the heart. After long practice, silently recite the incantation...\"*\n\nGreat Brilliance nurtures the elixir, refining essence within to forge gold. Their radiance merges and reflects, and the true spirit comes to seek you. Upon completing the recitation, swallow saliva up to nine times.\n\nOn the fifteenth and twenty-ninth days of each month, repeat the above method. This enables one to perceive light with clarity, the face to glow with jade-like radiance, and the body to be moistened with golden luster. After fifteen years of practice, the Most High will dispatch a treasure chariot to welcome you. Cultivation should be frequent, not bound to specific days.\n\nThe oral instructions of the Daoist of the Azure Ox say: *\"At night, before sleep, visualize the sun above the forehead and the moon above the navel—this repels a thousand ghosts and ten thousand malign influences.\"* This method is profoundly efficacious.\n\n*The Preface to the Five Talismans of the Numinous Treasure* states: *\"To ascend as an immortal, one must summon the spirits of the body. If there is any disorder, call upon the spirit of the affected part to remedy it—results will be immediate.\"*\n\nThe ears, nose, and tongue each govern their own domains, with spirits residing in distinct palaces; thus, each is invoked by a separate name:\n- Spirit of the eyebrows: Heavenly Cloud\n- Spirit of the brain: Primal First\n- Spirit of the whiskers: Eastern King Father\n- Spirit of the ears: Delicate Maiden\n- Spirit of the eyes: Heroic Brilliance\n- Spirit of the hair: Longevity\n- Spirit of the nose: Penetrating Reed\n- Spirit of the mouth: Cinnabar Pearl\n- Spirit of the tongue: Cinnabar Yellow\n- Spirit of the teeth: Guardian\n- Spirit of the throat: Martial Rush\n- Spirit of the shoulders: Profound Spirit\n- Spirit of the hands: Yin of the Hun-soul\n- Spirit of the heart: Kissing Pottery\n- Spirit of the lungs: Overseeing\n- Spirit of the gallbladder: Seizing\n- Spirit of the stomach: Obstructing\n- Spirit of the spleen: Assisting\n- Spirit of the kidneys: Flowing\n- Spirit of the navel: Jade Spirit\n- Spirit of the Cinnabar Field: Treasured Essence\n- Spirit of the large intestine: Supporting\n- Spirit of the small intestine: Beam\n- Spirit of the intestines: Exhausted Hero\n- Spirit of the belly: Yin\n- Spirit of the knees: Region\n- Spirit of the shins: Confucius\n- Spirit of the feet: Heaven-Standing Valiant One\n\nBefore sleep, always first visualize these spirits—ghosts and malevolent beings cannot then deceive you. Visualizing them on the last day of the lunar month, the first day, the quarter moons, and the full moon is especially effective.\n\n**Purifying the Heart and Inner Taboos, Second Chapter**\n\nThe *Records of Dengdu* states: One must avoid speaking of the study of the Dao. Why? Words uttered outwardly will surely invite ghosts and malevolent beings to afflict a person, bringing illness. If one’s body is not yet perfected, one cannot but be cautious. The *Oral Instructions of the Sacred Mother of Shuling* says: Those who study immortality must be prudent in speech, for the mountain spirits and the hundred spirits will test them. Liu Jing also ascended as an immortal by employing this method.\n\nThe *Laozi’s Scripture on Nurturing the Spirit* states: When rinsing the mouth, one must avoid facing north or northwest, for the Dark Palace of Fengdu lies in the *hai* direction, and thus one must avoid doing so by the water’s edge. Many who fall ill cannot be saved—there is indeed a reason for this. If afflicted, recite the names of the Six Palaces to be spared. The names of the Six Palaces are recorded in the third chapter. One must strictly avoid gazing upon images above the water’s surface, for it often brings illness.\n\nIt further states: To chant or sing while feigning sleep is to invite misfortune. If one exposes oneself and is stricken by severe illness, there will be no regret. It also says: When combing one’s hair, one must not face north, for this brings great remorse. To let loose one’s hair is to draw near to the Yin Lord, allowing ghosts to take advantage. Even stepping on filth will cause emaciation and lingering illness.\n\nThe Lady of South Marchmount says: One’s bedchamber must be fragrant and clean. If unclean, one will be disturbed by stale *qi*, and the study of the Dao will be difficult to accomplish—this is deeply forbidden. It also says: When sleeping in the woods, one should choose a high place. If high, earthly *qi* will not reach, and the breath of ghosts will not invade. Otherwise, ghostly *qi* will rise from the ground to assail a person. The woods should be three feet and six inches high, for ghosts, being formless, cling to objects to manifest. Thus, at three feet and six inches, ghostly *qi* cannot reach. The ancient historian Yong once saw a ghost clinging to the ground, blowing through a tube at people—those who study the Dao must be especially cautious.\n\nThe oral instructions of the immortal Chen Anshi say: When combing one’s hair or partaking in food and drink upon one’s mat, one must not allow those who are not of the Dao to see or approach. If seen, the ghostly forms of the profane and the dead will invade one’s spirit. This is why those who dwell in the mountains seek to distance themselves from such people. Guard this secret!\n\nThe *True Radiance* states: Those who cultivate life must not weep excessively or spit often, for both deplete the fluids and drain the essence, leaving the throat and brain empty and exhausted. Thus, the perfected ones constantly practice breath regulation and saliva swallowing to restore their vitality.\n\nThe ancient master of the mysteries says: One cannot bathe too frequently—the fault lies in people’s inability to do so. Washing away foulness and grime allows true *qi* to arrive.\n\nThe *True Reports* states: On *jiayin* and *gengshen* days, corpse-ghosts vie to disturb the spirit—these are days of restlessness and impurity. One must not engage in intimate conversation or laughter with women on such days. Dispel all desires on these days to preserve one’s primordial auspiciousness.\n\nThe oral instructions of the immortal Liu Gang say: Those who seek immortality must not lie with women on the following days: the first day of the first lunar month, the third day of the second month, the ninth day of the third month, the second day of the sixth month, the sixth day of the ninth month, and the third day of the twelfth month. On these days, if one engages in intercourse, the Six Corpses will disorder the viscera, blood will seep, the Three Hun will lose their guard, and spirit and *qi* will wither away, leading to death over time—this is why these days are forbidden. On such days, if one does not restrain oneself, the blood will seep, and the female palace, being in *yin* and *shen* (which clash), will cause the sun to emerge from the red pupil of the eye. Thus, the female corpse summons the male, and the male corpse summons the female, bringing reciprocal calamity, harming the spirit, and breaking the essence. Though one may not perceive the clash, the numinous is already damaged, for the Three Corpses wage war within the eyes, causing blood to flow into the Mud Pill Palace. On these days, one must absolutely avoid seeing favored concubines or beloved women. The immortal masters simply follow this Way to attain longevity.\n\nThe Perfected One of Purple Yang says: Infrequent bathing is the nature of the *po*. To go against the *po* and return to the true is to refine one’s turbid *po*—otherwise, one will perish of one’s own accord.\n\nThe *Secret Instructions of the Great Cavern* states: If one dreams at night and feels content upon waking, it is a fortunate omen. Upon waking, one should rub the eyes twenty-one times, then click the teeth twenty-one times, and softly recite the incantation:\n\n*\"Supreme High Essence, Radiant Spirits of the Three Emperors.\nThe Vermilion Palace shines clearly, reporting auspicious omens.\nThe Three Origins soothe the *po*, the Heavenly Sovereign receives the scripture.\nAll endeavors harmonize, ascending to the Upper Clarity.\nEver accompanied by Jade Maidens, together we meet in the Purple Court.\nAll ill dreams become auspicious.\"*\n\n**Outer Prohibitions for Purifying the Spirit, Third Chapter**\n\n*The Dengdu Record* states: If one knows the names of the Six Palaces of Dengdu, then the hundred ghosts dare not harm them. When going out, first face north and softly recite the incantation three times:\n\n*\"I am a disciple of the Supreme High, governing the Six Heavens below. The officials of the Six Heavens are under my command—not only under my command, but also under the dominion of the Supreme High. I know the names of the Six Heavenly Officials, which ensure my long life. Should any dare to transgress, the Supreme High will sever your form.\"*\n\nThe names of the Six Palaces are:\nFirst Palace: *Zhoujue Yintian* Official\nSecond Palace: *Taisha Liangshi Zongtian* Official\nThird Palace: *Mingchen Nai Fan Wucheng Tian* Official\nFourth Palace: *Tianhei Zuiqi Tian* Palace\nFifth Palace: *Zongling Qifei Tian* Official\nSixth Palace: *Gansi Lian Wanlü Tian* Official\n\nAfter reciting, click the teeth sixty times before going out, to repel the qi of the myriad evils. Practicing this for ten days will erase one’s name from the register of the dead and grant rebirth in the Southern Palace.\n\n*The Scripture of the Great Cinnabar of the Cavern Chamber* states: Evil dreams arise from three causes—first, the *po*-demon; second, the testing of the heart; third, the corpse-thief. To dispel them, upon waking, press the philtrum with the left hand twenty-one times, click the teeth twenty-one times, and recite the incantation:\n\n*\"Great Cavern, True and Mysterious, Zhang refines the Three Hun.\nThe first hun swiftly guards the Seven Po,\nThe second hun swiftly guards the Mud-Pill Palace,\nThe third hun receives the heart’s command.\nSwiftly invoke the Supreme High Primordial Lord:\n‘Just now, an inauspicious dream arose—\nthe Seven Po’s wandering corpse came to join with the source of evil.\nHasten to summon Peach-Kang to protect life,\ndispel the malign essence, and turn misfortune into fortune.\nNo cause for life or death remains.’\"*\n\nPracticing this without cease, one will sit and perceive the auspicious and inauspicious events of the future.\n\n*The Dengdu Record* states: When walking at night, one should constantly sound the Heavenly Drum, without a fixed number of strikes. This can repel the hundred ghosts, for evil spirits all fear the sound of clicking teeth and thus dare not approach. Formerly, Master Bao of Qi suffered from wind, and his teeth naturally clicked together. When ghosts came to claim him, they heard the sound of his clicking teeth and kept their distance. He lived to one hundred thirty years, crossing spring ice without sinking until his end.\n\nIt is said: If even the clicking of teeth in the wind achieves this, how much more so for those who deliberately practice it?\n\n**Concealing the Mysterious and Hooking the Spirits, Fourth Chapter**\n\n*The Declarations of the Perfected* states: The Dao of nurturing life begins with recognizing one’s own form, visualizing it with utmost clarity until it stands vividly before the eyes. On the face, the radiance of the sun and moon shines forth, illuminating the entire form. Place the sun on the left and the moon on the right, nine inches from the face. After visualization, click the teeth three times and softly recite the incantation:\n\n*\"Primordial Womb, Supreme Perfected,\nTwin Effulgences of the Two Mysteries,\nOn the right, embrace the Seven Po,\nOn the left, embrace the Three Hun.\nConcentrate on my spirit luminants!\nLet them ever abide with my form.\"*\n\nAfter reciting, click the teeth twenty-one times and swallow saliva seven times. This is called the method of the *Celestial Lord Recording the Form, Restraining the Hun, and Controlling the Po*, enabling one to become an immortal and live forever without dying.\n\nFurthermore, in all matters of visualizing spirits and practicing the arts of the perfected immortals, the bedding and mats one uses must be kept fresh and clean, avoiding any stains or filth, lest the Three Hun and Seven Po take residence therein—this is deeply forbidden.\n\n*The Scripture of the Three and Five in Harmonious Practice* states: When sitting, close the eyes and inwardly visualize the five viscera and intestines. With prolonged practice, one will perceive them with perfect clarity.\n\n*The Method of Inward Vision in the Crimson Radiance of the Purple Empyrean* states: Whenever going out, settle the body, close the eyes, and inwardly gaze while listening afar to the four directions, focusing vision and hearing upon places a thousand miles away. With concentrated effort, one will eventually see events a hundred miles distant. The \"four directions\" are a general term—one should begin by focusing on one direction for vision and hearing. Initially, there may be no tangible result, but with prolonged sincerity, one will naturally enter the wondrous and summon the true.\n\nLady Wang of Yunlin said: The Dao of the perfected immortals takes the ears and eyes as its foundation. Prolonged gazing strains the eyes, and excessive listening dulls the ears—this malady arises from within and rushes outward, with no other cause. At midnight, first close the eyes, face east, and with the thumbs behind the palms, wipe toward the ear openings, crossing the hands at the nape of the neck twenty-seven times. Visualize three colored qi—purple, cyan, and crimson—emerging before the eyes. This is the inner pressing of the Three Pure Clouds to irrigate and unite with the Youthful Lad. Recite the yin incantation:\n\n*\"Eye Lads of the Three Clouds,\nTrue Lords of the Two Eyes,\nHeroic and luminous, they concentrate essence,\nOpening and penetrating the pure spirit.\nCloud Emblem of the Great Mystery,\nSpiritual Steeds soaring lightly,\nProtect and benefit the Twin Gates,\nUnseal and illuminate the Nine Portals.\nThe hundred joints respond in resonance,\nMorning saliva flies the body,\nAscending to the Jade Palace,\nEnnobled as Supreme Perfected.\"*\n\nAfter reciting, swallow saliva fifty times. With prolonged practice, one will see clearly for a thousand miles. This is also the Dao of the true immortals, not merely for brightening the ears and eyes.\n\nThe Perfected of Azure Spirit said: In the method of guarding the Mysterious and White, sit calmly and visualize black qi in the Mud-Pill Palace, white qi in the heart, and yellow qi in the navel, all arising like clouds to cover the body. They then transform into a great fire, burning the body inside and out. If practiced from dawn to noon, it enables one to live forever without dying. These methods complement one another; practicing them in alternation yields even greater benefit.\n\nThe Lord of Preserving Life said: When a person concentrates the heart in bowing, the bow reaches the heart. During circular movement, the furnace is activated, with left and right motions as if conducting affairs. This is called *inwardly refining the Great Mystery, practicing the work of emptiness, perching in the Three Palaces, and reclining in the divine mansion*. Formerly, Lord Zhao practiced this and moved the Supreme High to descend, whereupon he ascended as an immortal.\n\n**Preserving Life and Calming Qi, Fifth Chapter**\n\nMaster Pei’s *Scripture of Preserving the Spirit* states: When a person grows old, it seldom begins anywhere but the ears and eyes. The area below the eyes and above the cheekbones is where the *Brightness-Centered Preservation of Life* returns to infancy. Rub this area with the hands in endless cycles—this is called the *Dao of Circulating Blood, Dispersing Wrinkles, Harmonizing Essence, and Preserving the Spirit to Sustain Life*.\n\nThe text further states: Place the hands upon the forehead, inwardly envisioning a youthful figure or the twin luminaries of sun and moon. Repeat this upward and downward motion, accumulating counts until three nines are reached—this is called *the hands paying homage to the Three Origins, the Dao of fortifying the brain and strengthening the hair*. Encompass the four sides of the head with both hands, smoothing the hair and untying knots, ensuring thoroughness. Thus, the blood of the head flows and disperses, and wind-dampness does not congeal.\n\nWhen complete, press the four corners of the eyes with the hands, reaching two nines in total. This enables the eyes to perceive light—*the Dao of inspecting the spirit of the eyes*. With prolonged practice, one may behold the hundred spirits. It is even better if the hands never leave the face; even accomplished perfected beings do not abandon this.\n\nThe *Scripture of Great Simplicity and Cinnabar Radiance* states: Upon the face, one should constantly rub with both hands, ensuring warmth across all areas, which grants the face a lustrous glow. Practicing this for five years, the complexion becomes like that of a maiden—*the flowing qi of mountains and rivers, ever full and never depleted*.\n\nThe *Scripture of the Supreme High’s Opening of Heaven* states: One should frequently press the corners of the eyes near the nose with the hands, holding the breath while doing so. Cease when the qi flows through, then exhale and repeat. With constant practice, one gains the ability to perceive the hidden and distant.\n\nMaster Yang, when awakening at night, would always knock his teeth seven times and swallow saliva nine times. Upon completion, he would press the sides of his nose with his hands, moving left and right, up and down, counting to ten repetitions. He would softly recite the incantation:\n\n*\"Supreme High’s Four Luminaries, the Nine Gates radiate brilliance.\nThe two eyes, dark and penetrating, connect with the true and reach the numinous.\nThe Mysterious Terrace in Heaven, flowing qi harmonized and balanced.\nThe Cloud Maiden’s graceful bearing, the eye-child’s keen clarity.\nFlowering wisdom, bright and resplendent, a hundred visions clear and distant.\nPreserving harmony in the Upper Origin, wandering the Nine Citadels.\nThe five viscera take root, ears and eyes naturally arise.\nThe Heavenly Terrace, lush and pure, its beams and pillars unwavering.\nThe seven po refined and tempered, the three hun at peace.\nThe Red Child seizes the radiance, ever at my side.\nShould any dare obstruct my ears and eyes, the Supreme High shall crush them with flowing bells.\nTen thousand evils vanish, all wishes fulfilled.\nSun and moon guard the gates, the heart harbors the five stars.\nThe True Sovereign’s invocation, all echoes heed with reverence.\"*\n\nUpon awakening, recite this without fail. It grants the face a youthful countenance, restrains the po and records the hun, repels a thousand demons, and causes the seven apertures to flow freely, the complexion blooming like the flower of Shun. This is the wondrous Dao of the perfected being’s daily practice.\n\nUpon completion, swallow saliva nine times. The Red Child of Stone Radiance constantly rubs the mouth and nose, then the eyes. Over time, the hands generate fluid, which is then used to rub the eyes. Daily practice makes the body fragrant and the form light.\n\nThe *Scripture of the Supreme High’s Flourishing Radiance* states: At the time of living qi, swallow saliva twice seven times. Upon completion, press the painful areas of the body, facing the direction of life, and recite the incantation:\n\n*\"Left Mysterious, Right Mysterious, the Three Spirits unite as one.\nLeft Yellow, Right Yellow, the Six Radiances align.\nWind-qi and malignant illnesses, subdued in the four directions.\nJade Maidens flow with grace, above and below freely coursing.\nInternally dispatching water and fire, externally repelling misfortune.\nEverlasting life and flying transcendence, the body ever at rest and strong.\"*\n\nUpon completion of the recitation, swallow saliva twelve times, then swiftly press the afflicted area thirty times—thus shall illness and hernia never arise.\n\nThe *Scripture of Internal Radiance* states: Upon rising from bed, first wipe the chest and forehead with silk until warm, then stroke the head in the direction of the hair’s growth. After a long while, rub the face and eyes with both hands and swallow saliva thirty times. With prolonged practice, the eyes grow bright, noxious qi cannot enter, and the body remains forever at peace.\n\nThe *Perfect Scripture of the Great Cavern* says: When rising externally, sit upright and regulate the breath. Cover the head with both hands, gaze upward, and contend against the hands with force three or four times—this harmonizes essence and circulates blood, preventing wind-qi from entering. With long practice, one neither sickens nor ages.\n\nLady Li of Fangzhang, the Illustrious Spirit, says: Frequently press the ears on both sides to sharpen hearing. This is called \"tending the city walls\"—one must inscribe it in the register of the named scholars. Often press the sides of the nose to balance the qi. This is called \"without haste, irrigate the Central Peak\"—inscribe it in the Emperor’s records.\n\nThe *Scripture of the Supreme Ultimate* states: When combing the hair, face the direction of the ruler. At the first stroke, softly recite the incantation:\n*\"Mud-Pill Palace’s mysterious blossom, preserving essence ever abiding.\nRight as the hidden moon, left as the sun’s root.\nThe Six Harmonies purified and refined—\nthe hundred spirits receive grace.\"*\nUpon completion, swallow saliva three times. With regular practice, the hair does not fall but grows instead.\n\nIt further says: Frequently change the parting of the hair, combing often without causing pain. One may also have an attendant comb it—more is better. Thus the blood flows unimpeded, and the hair roots remain firm. Have the attendant wash their hands before combing, lest they defile the Celestial Palace.\n\nThe *True Reports* states: Combing the hair should be broad and frequent to circulate qi and blood and disperse wind-dampness. Changing the part often is even better—there is no need to loosen the hair. The *Scripture of the Cinnabar Landscape* says: Alternately rub the hair and comb it until warm. Also, alternately rub the arms with the hands to prevent the hair from whitening and the vessels from floating outward.\n\n*Register of the Hidden and Eternal Diagram, Sixth Scroll*\nThe *True Reports* states: The Dao of long life requires eliminating illness, preventing harm to the body, and avoiding depletion of blood, brain, and marrow, as well as stagnation of fluids and filth. Without first removing illness, even the consumption of medicinal foods and the practice of qi-cultivation are of no benefit. There was once a woman of the Huangfu clan who loved the divine immortals and constantly absorbed the essence of the sun and moon. After thirty years, she felt no benefit. Later, she met the Perfected One of South Mountain Peak, who taught her: \"You cannot ascend as an immortal because you have illness—your brain palace is deficient. Take medicine to dispel sickness and cultivate the practice.\" After eighteen years, she ascended in broad daylight.\n\nThe *Scripture of the Nine Transformations and Ten Transmutations of the Supreme High* states: If one treads upon hidden chamber milk-blood, one must immediately bathe to dispel it. The method uses ten ounces of bamboo leaves and four ounces of white peach bark, boiled in one *hu* and two *dou* of water until bubbling. Strain and bathe with the liquid, adjusting the temperature—thus all filth is dissolved. This not only removes impurity but deeply prevents warm impediment, sores, and itching. When celestial beings descend to wander below and return to the upper realms, they invariably use this water to dispel impurity.\n\nMaster Shen Yi’s oral instructions say: When ingesting divine medicine, do not face north—this is a great taboo. On *hai* and *zi* days, do not spit, lest essence scatter, qi disorder, and lifespan be harmed, rendering the medicine’s power as dust. The *Oral Instructions of the Yellow Mountain Lord* state: When taking medicinal substances, avoid eating garlic, pomegranate seeds, pig’s liver, and dog’s head. For every catty consumed, one’s lifespan is reduced by a hundred days—beware of this.\n\nThe Director of Destiny of Shuqing says: When ingesting immortal medicines, always face the direction of your life destiny. Upon completion, do not speak of death or inauspicious matters, lest you offend the fetal spirit and render the medicine useless. The Ninth Radiance’s Peaceful Consort says: When about to eat, do not speak of ugly matters. When bathing, constantly visualize the Six Ding spirits to fulfill your wishes. The *Book of Rites* also says: \"Do not desire [to speak of] such things when eating\"—there is good reason for this. It further says: Do not leave food exposed, lest various noxious qi gather. Many have fallen ill or faced incurable conditions due to fondness for food—truly, the harm of exposed food is real. \"Exposed food\" refers to food that is not properly covered.\n\n*Seventh Scroll: Cultivating True Qi in Seclusion*\nThe Left Consort of Purple Tenuity’s *Admonitory Writings* states: The ears and eyes are the ladder rungs for seeking the Perfected—success or failure depends on them. How can they be treated lightly? Press the small cavities behind both eyebrows twenty-seven times, then rub the temples with the hands and rotate the ears thirty times. The rubbing should be done without fixed timing. Upon completion, sweep the forehead with the hands twenty-seven times, beginning between the eyebrows and moving upward into the hairline. Then swallow saliva, in no fixed amount. With regular practice, the ears and eyes grow bright, and within a year, one can read at night. This may also be done discreetly at the philtrum without revealing the method.\n\nIt further says: The small cavities behind the eyebrows are the palace of the Upper Prime and Six Harmonies. When the eyes’ radiance is harmonious and lustrous, the essence-light shines like a pearl, ever youthful—this is the supreme Dao of the Perfected One’s sitting and rising. The *Internal Scripture of the Perfected One’s Constant Abode* states: If you wish to read at night, cultivate the Constant Abode. The reason the Perfected One can see in all four directions, the eight reaches, and even the palm of the hand is the principle of the Constant Abode.\n\nIt further says: Beneath the canopy of flowering brilliance, extend harmony to the celestial Perfected. Entering the valley’s ravine, fill the source of the Celestial Mountain—thus the empty and numinous can see the myriad ghosts, and the machinations of the wicked are extinguished. Above, harmonize with the celestial Perfected; below, press the mountain’s source. The \"mountain source\" is the high point at the initial entry of the nostrils. The \"celestial Perfected\" is the space between the eyebrows, at the corners of the brows. The \"mountain source\" is the root of the philtrum below the nose. The \"ravine\" is the small valley slightly within the nose. The \"Flowery Court\" lies below the two eyebrows—it is the bridge for penetrating vision. The \"Celestial Perfected\" is the upper chamber for drawing in the numinous. Morning and evening, constantly swallow saliva twenty-seven times and press these points with the hands—this is the Dao of attaining numinous clarity, seeing through all, and blocking the myriad evils.\n\nThe incantation states:\n\"Open the celestial court, grant me eternal life.\nSee through ten thousand miles, let soul and spirit return to infancy.\nBanish ghosts and expel evil, summon a thousand numinous beings.\nAscend to the Great Clarity, merge with the sun.\nAttain the rank of Perfected, inscribe your name in the mysterious register.\"\n\n*Essential Methods for Cultivating Perfection*, Chapter Eight:\nThose who study the Dao must first restrain and regulate soul and spirit, eliminate the ghostly corpse. On the days of the new and full moon, the Gengshen day, and the Jiayin day, one should purify the heart, bathe, sit upright on a mat, and remain awake—this is even better. With cinnabar brush, mark the left eye below the outer canthus; with realgar brush, mark the right side below the nose, allowing it to slightly enter the valley. After marking, first knock the teeth three times and softly recite the incantation:\n\"Lofty scenes fly in mystery, cinnabar and realgar disperse mist.\nQi seizes the insubstantial evil, corpse-filth sinks and vanishes.\nHarmonize the hun-soul, refine the po-spirit, elevate the form to merge with the Perfected.\nGrant me immortality, eternal preservation of myriad years,\nkeen insight and penetrating vision, enduring prosperity and smooth passage.\"\nAfter reciting, knock the teeth three times, swallow saliva three times, and press with the third finger of the right hand below the right nostril, and with the second finger of the left hand pinch below the left eye, each seven times until complete. Pressing these two places in secret seals the gates through which the seven po-spirits and wandering corpse roam. They are the bridges through which iron essence and malevolent spirits invade, thus receiving the essence of cinnabar and realgar to block the paths of corpse-ghosts. This is the supreme method of the Great Ultimate. Practicing it constantly harmonizes and softens the hun and po, scatters and severs corpse-filth, and leads to long life and transcendence as a divine immortal.\n\nThe Purple Void Primordial Lady states: On the fourth day of the first month, the eighth day of the second month, the fifteenth day of the third month, the sixth day of the sixth month, the seventh day of the seventh month, the eighth day of the eighth month, the ninth day of the ninth month, the fifth day of the tenth month, the third day of the eleventh month, and the second day of the twelfth month—on these days, the Supreme Jade Dawn Lord ascends the Jade Cloud Forest Chamber of the mountain, surveying the four directions of the world. Those with aspirations for distant journeys should, on these days before sunrise, face north and bow twice, stating their intentions, swallowing saliva thirty-six times, and all wishes will be granted.\n\nThe Ninth Radiance Peaceful Consort states: When entering a quiet chamber, first step forward with the right foot, then bring the left foot to align with it. In walking, proceed as if presenting a report to a superior, ensuring it reaches the ears above.\n\n*Essential Methods for Cultivating Perfection* states: On the five Mao days, one should purify the heart, enter the chamber facing east, mentally visualize bowing and invoking the spirits, regulate the breath to greet and sense the divine luminaries. Whatever is expressed with sincerity will be granted. Those who persist in this will have Jade Maidens descend to attend them. It also states: On one’s birth day, face east, knock the teeth three times, mentally visualize bowing twice, and softly recite the incantation:\n\"Great One, guard life, the three qi merge with the Perfected.\nThe chamber’s womb holds the lofty scene, mother mysterious and father primordial.\nYou gave birth to my five viscera, gathered my essence and spirit.\nBelow, irrigate the Jade Flower; to the left, smile at the Golden Dawn.\nGrant me divine transcendence, command spirits and employ the numinous.\nConstantly preserve the smooth passage, soaring through the ten heavens.\"\nAfter reciting, mentally bow to the four directions, knock the teeth three times, and swallow saliva three times. This is called the Supreme Method of the Hidden Morning Audience for the Embryonic Origin. Practicing it constantly secures the hun and po, leading to long life and transcendence as a divine immortal.\n\nIt also states: On Jiazi days and the first day of the month, one should bathe to attain spiritual communion. It further states: On the eight seasonal nodes, one should purify the heart, speak only of good deeds, and be vigilant against anger or the exercise of punitive authority—these are great taboos for heaven and humanity. Be cautious and auspicious.\n\n*The Scripture of the Great Elixir of Perfection* states: On the second day of the second month, the third day of the third month, the eighth day of the eighth month, the ninth day of the ninth month, and the tenth day of the tenth month at night, within the bedchamber, visualize the secrets of the Grotto-Heaven. Remaining awake is auspicious. That evening, the Jade Maidens of the Protective Scriptures, bearing the Great Ultimate’s canonical prohibitions, will observe you from the void. On that night, burn incense and maintain reverent focus as if awaiting something. Sit outside, visualize, or read scriptures, concentrating on the Perfected within your thoughts. Do not engage in other affairs. Over time, you will be received by masters and friends, ascending to heaven.\n\nIt also states: When activating the furnace, do not look back, for doing so misleads the assembled Perfected and causes true qi to invite demonic responses. The Perfected of the Great Ultimate who recite the *Five Thousand Character Scripture of the Dao and Virtue* ten thousand times will be welcomed by cloud chariots and attain long life.\n\nThe Perfected Meng Deran states: Before sleeping at night, first recite the *Inner Radiance Scripture of the Yellow Court* once to pacify the hun and po. Practicing this for ten years leads to long life and transcendence as a divine immortal.\n\nThe Lady Jiang of the Northern Peak states: Reciting this scripture also keeps one free from illness—it is the Way of not dying.\n\nHere ends the *Red Writ for Prolonging Life by the Lofty Perfected of the Supreme Mystery*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上玄高真延寿赤书 上玄高真延寿赤书 经名：上玄高真延寿赤书。 唐·裴铉撰。 一卷。 底本出处：《正统道藏》洞神部方法类。 进延寿赤书表 唐终南山林臣裴铉上表 臣闻明流八荒者，日也； 声飞万古者，道也。 故贞明不出於古先，德身岂远於身外？ 是以圣人洗心，以至道如蹴踟焉。 然则气无形端，有若道准固，以柔郑，逃之无因，取兴则小，其弘则大。 微臣幸逢尧运，忝预巢由，服志中岩，有易润泽，因编於儒典，薄求於道书，见仙家保命之真言，思君亲永寿而无极，真言秘旨，累翳缣网，诚则天鉴昭回，私心惧劳圣览，是以披历精要，载腾真声，进明白於一贯，退光宣於少得，故乐者易成功，见之不骇俗，诚皇极之道也。 经所谓王侯得一以为天下贞者，不空言哉！ ，斯盖上玄老真延龄永寿之前梯也。 因以名日《上玄高真延寿赤书》焉。 赤书者，上以明星火资於土德，中以殷仲夏之朱明，下以达微臣之丹恳也。 灵经云：俾国太平，转灾成福，当用五老赤书作镇也。 今属三气炳节降庆神期，敢献延寿之书，冀申诞贺之礼。 伏惟开元圣文神武法天至道皇帝陛下，道满天大，覆焘无私，德通坤厚，光载罔极，不耻牧童之词，岂愧刍莞之言？ 言不贱废，天下幸甚！ 书一轴，凡八篇，积数千字，皆众圣高真之至言也，在掌握之内，足见长生之道焉。 郁璘前奔第一 郁仪太阳之精神也，结璘太阴之精神也。 东卿司命曰：昼存日，夜存月，如小环焉。 存日赤色，紫光九芒矣； 存月黄色，有白光十芒矣。 而日居左，月居右，令二景与目瞳合气相通也。 因咽无数液，密行此道，以摄运生精，理和魂魄六丁奉侍，天兵警护。 此上真太上高真常在囊肘之问，信誓而传也。 南极夫人曰：存心中有紫光日象如钱许，赤色有九芒，从心中上出喉一至齿间而还胃中。 如此良久，临目自见中心肠胃分明，乃吐气漱液，因咽三十九过止。 一日三为之，行十年，日中无影辟百邪，神仙矣。 西城王君曰：恒存月在泥丸中，夜服月华，如存日法，存月有十芒，白色，从脑中下入喉而回入胃中，犹服日耳。 泥丸，脑神也，身神中至尊也。 《太虚真人赤君内法》曰：每月五日夜半存月在心中，日从口入，使照一心之内，光明合会。 毕，当觉心暖。 久之，密祝曰：",
      "translated_text": "**The *Red Writ of the Supreme Mystery’s Lofty Perfected for Prolonging Life***\n\n**Title:** *The Red Writ of the Supreme Mystery’s Lofty Perfected for Prolonging Life*\n**Author:** Pei Xuan of the Tang Dynasty\n**Volume:** One\n**Source:** *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, Methods Category\n\n---\n\n**Memorial Presenting the Red Writ for Prolonging Life**\n*Memorial from Pei Xuan, Hermit of Mount Zhongnan, to the Throne*\n\nYour subject has heard that what illuminates the eight wilds is the sun, and what resounds through ten thousand ages is the Dao. Thus, true clarity does not arise from antiquity alone, nor does the body of virtue lie beyond oneself. For this reason, the sage purifies the heart to attain the Supreme Dao as effortlessly as treading upon level ground.\n\nNow, qi has no fixed form, yet it aligns with the constancy of the Dao—yielding yet unyielding, elusive yet inescapable. In its subtlety, it may seem small, but in its vastness, it is boundless. Your humble subject, fortunate to live in an age of sagely rule, has been granted the honor of emulating the recluses Chao and You. Dwelling in the heart of the mountains, where the transformative power of the Dao moistens all things, I have pored over the classics of the Ru and sought the subtle truths of Daoist scriptures. Therein, I encountered the Perfected Words of the Immortals for preserving life, and my thoughts turned to the eternal longevity of the sovereign and his kin. These Perfected Words, though veiled in secrecy and obscured by the dust of ages, are as clear as the mirror of Heaven. Yet, fearing that my private devotion might weary the sagely gaze, I have distilled their essence, giving voice to their true resonance. What is presented here is but a single thread of their luminous whole, a modest offering of what little I have grasped. For joy eases accomplishment, and what is seen does not unsettle the common mind—this is the very Dao of imperial supremacy.\n\nAs the scriptures say: *\"When kings and lords attain the One, they become the standard for all under Heaven.\"* These are no empty words! This work is indeed the ladder by which the Supreme Mystery’s Ancient Perfected ascend to eternal life. Thus, I have titled it *The Red Writ of the Supreme Mystery’s Lofty Perfected for Prolonging Life*.\n\nThe \"Red Writ\" signifies, above, the stellar fire that aids the virtue of Earth; in the middle, the vermilion brilliance of high summer; and below, the crimson sincerity of your humble subject’s devotion. The *Numinous Scripture* states: *\"To bring peace to the realm and turn calamity into fortune, one must employ the Red Writ of the Five Elders as a talisman.\"* Now, as the Three Qi blaze in their seasonal splendor and the divine time of celebration descends, I dare to present this *Writ for Prolonging Life*, hoping to express the rites of felicitous offering.\n\nProstrate, I contemplate Your Majesty, the *August Emperor of the Kaiyuan Era, Sagely in Culture, Divine in Martiality, Who Models Heaven and Embodies the Supreme Dao*—Your Dao fills the vastness of Heaven, Your sheltering grace knows no partiality, Your virtue flows through the depth of Earth, and Your radiance is without end. You do not disdain the words of a shepherd boy; how could You scorn the humble speech of a grass-cutter? If these words are not cast aside as worthless, it will be the great fortune of all under Heaven!\n\nThis scroll contains eight chapters, comprising several thousand characters—all the profound utterances of the myriad sages and lofty Perfected. Held in the palm, it suffices to reveal the Dao of long life.\n\n---\n\n**1. The Rushing Brilliance of the Eastern Marchmount**\n\nYu and Lin are the spirits of the Great Yang and Great Yin, respectively. The Controller of Destinies of the Eastern Marchmount says: *\"By day, visualize the sun; by night, visualize the moon, as if in a small ring. Envision the sun as crimson, radiating nine beams of purple light; envision the moon as yellow, emitting ten beams of white light. Place the sun to the left and the moon to the right, allowing the two luminous essences to merge with the pupils of the eyes and circulate their qi. Swallow the saliva without count, and silently practice this method to gather and refine the generative essence, harmonizing the hun and po. The Six Ding spirits will attend you, and heavenly soldiers will stand guard.\"*\n\nThe Supreme Perfected of the Highest Realms have always kept this secret between sleeve and elbow, transmitting it under solemn oath.\n\nThe Lady of the Southern Culmen says: *\"Visualize within the heart a sun of purple light, the size of a coin, crimson and bearing nine beams. Let it rise from the heart, ascend through the throat to the teeth, then return to the stomach. After a long while, close your eyes—you will perceive the heart, intestines, and stomach with clarity. Exhale, rinse the mouth with saliva, and swallow thirty-nine times before stopping. Practice this thrice daily. After ten years, you will cast no shadow at noon, repel all malign influences, and become an immortal.\"*\n\nThe Lord of the Western City says: *\"Constantly visualize the moon within the Mud Pill. At night, absorb the moon’s radiance as you would the sun’s. Envision the moon with ten beams of white light, descending from the brain into the throat, then returning to the stomach—just as with the sun. The Mud Pill is the spirit of the brain, the most revered among the body’s spirits.\"*\n\nThe *Inner Methods of the Red Lord, Perfected of the Great Void*, states: *\"On the fifth night of each month, at midnight, visualize the moon within the heart. Let the sun enter through the mouth, illuminating the heart’s interior until their lights merge. When complete, you will feel warmth in the heart. After long practice, silently recite the incantation...\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 890,
      "start_sentence": 0,
      "end_sentence": 38,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.06721496582031,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\上玄高真延寿赤书.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "大明育丹，精内炼金。 光辉合映，真神来寻。 诵毕，咽液数极於九。 每月十五日、二十九日，复行如上法。 使人听察光彻，面有玉光，体润金泽。 行之十五年，太上遣宝车来迎。 修之务欲数，不必事须此日。 青牛道士口诀曰：暮卧存日在额上，月在脐上，辟千鬼万邪。 秘验。 《灵宝五符序》曰：欲登仙当召身神，或有乖处，以呼所在神以治之，立效也。 谓耳、鼻、舌各司，神宫殊贯，故别呼名焉。 眉神名天云，脑神名元先，须神名东王父，耳神名娇女，目神名英明，发神名长寿，鼻神名通卢，口神名丹珠，舌神名丹黄，齿神名卫士，喉神名武奔，肩神名郁灵，手神名魂阴，心神名吻陶，肺神名临临，胆神名获获，胃神名阻阻，脾神名裨裨，肾神名浏浏，脐神名玉灵，丹田神名藏精，大肠神名托托，小肠神名梁梁，肠神名穷英，肚神名阴阴，膝神名区区，陉神名孔子，足神名立天力士。 常欲将寐先存之，鬼物不能奸也。 晦朔日弦望存之，尤佳也。",
      "translated_text": "Great Brilliance nurtures the elixir, refining essence within to forge gold. Their radiance merges and reflects, and the true spirit comes to seek you. Upon completing the recitation, swallow saliva up to nine times.\n\nOn the fifteenth and twenty-ninth days of each month, repeat the above method. This enables one to perceive light with clarity, the face to glow with jade-like radiance, and the body to be moistened with golden luster. After fifteen years of practice, the Most High will dispatch a treasure chariot to welcome you. Cultivation should be frequent, not bound to specific days.\n\nThe oral instructions of the Daoist of the Azure Ox say: *\"At night, before sleep, visualize the sun above the forehead and the moon above the navel—this repels a thousand ghosts and ten thousand malign influences.\"* This method is profoundly efficacious.\n\n*The Preface to the Five Talismans of the Numinous Treasure* states: *\"To ascend as an immortal, one must summon the spirits of the body. If there is any disorder, call upon the spirit of the affected part to remedy it—results will be immediate.\"*\n\nThe ears, nose, and tongue each govern their own domains, with spirits residing in distinct palaces; thus, each is invoked by a separate name:\n- Spirit of the eyebrows: Heavenly Cloud\n- Spirit of the brain: Primal First\n- Spirit of the whiskers: Eastern King Father\n- Spirit of the ears: Delicate Maiden\n- Spirit of the eyes: Heroic Brilliance\n- Spirit of the hair: Longevity\n- Spirit of the nose: Penetrating Reed\n- Spirit of the mouth: Cinnabar Pearl\n- Spirit of the tongue: Cinnabar Yellow\n- Spirit of the teeth: Guardian\n- Spirit of the throat: Martial Rush\n- Spirit of the shoulders: Profound Spirit\n- Spirit of the hands: Yin of the Hun-soul\n- Spirit of the heart: Kissing Pottery\n- Spirit of the lungs: Overseeing\n- Spirit of the gallbladder: Seizing\n- Spirit of the stomach: Obstructing\n- Spirit of the spleen: Assisting\n- Spirit of the kidneys: Flowing\n- Spirit of the navel: Jade Spirit\n- Spirit of the Cinnabar Field: Treasured Essence\n- Spirit of the large intestine: Supporting\n- Spirit of the small intestine: Beam\n- Spirit of the intestines: Exhausted Hero\n- Spirit of the belly: Yin\n- Spirit of the knees: Region\n- Spirit of the shins: Confucius\n- Spirit of the feet: Heaven-Standing Valiant One\n\nBefore sleep, always first visualize these spirits—ghosts and malevolent beings cannot then deceive you. Visualizing them on the last day of the lunar month, the first day, the quarter moons, and the full moon is especially effective.",
      "overlap_context": "n returning to the stomach—just as with the sun. The Mud Pill is the spirit of the brain, the most revered among the body’s spirits.\"*\n\nThe *Inner Methods of the Red Lord, Perfected of the Great Void*, states: *\"On the fifth night of each month, at midnight, visualize the moon within the heart. Let the sun enter through the mouth, illuminating the heart’s interior until their lights merge. When complete, you will feel warmth in the heart. After long practice, silently recite the incantation...\"*",
      "start_char": 890,
      "end_char": 1281,
      "start_sentence": 39,
      "end_sentence": 52,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.24641227722168,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\上玄高真延寿赤书.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "洗心内忌第二 《邓都记》曰：忌言学道。 何则？ 言出於外，鬼物必犯於人，使人疾病。 谓体或未真，不可不慎焉。 《束陵圣母口诀》曰：学仙慎言有多术，为山神百精所试也。 刘景亦用此术升仙矣。 《老君养神经》曰：如涵忌向北及向西北。 为郦都阴宫在亥焉，故於澜上忌。 遇疾多不救者，抑有由矣。 或遇疾急诵六宫名乃免耳。 六官名具在第三篇。 切忌涵观上象，多疾也。 又曰：假寐而咏歌，亦谓之请祸。 若暴露俾人遇恶疾，不悔也。 又曰：理发忌向北，大悔也。 谓散发近诉於阴君，鬼物得其便耳。 而履垢亦令人消瘦疗疾也。 南岳夫人曰：卧室务其芳洁，不洁则受故气之乱，学事难成，深忌之。 又曰：卧林务欲高，高则地气不及，鬼吹不侵，不尔，鬼气侵人常依地而上也。 林高三尺六寸。 然鬼无形皆附物以为珍。 故林高三尺六寸，而鬼气不能及也。 古之史永见鬼附地，以管吹人，学者故切慎之。 仙人陈安世口诀曰：理发及饮食茵席勿令非道者见近，见则尸俗魄形鬼来侵我神也，所以柄山者欲远之耳，秘之！ 《真皓》曰：养生之人不过泣及多唾耳，泄之皆谓损液漏津，使喉脑空竭，是以真人常吐纳咽液以复命焉。 古玄师曰：浴不厌数，患人不能耳。 荡练臭秽而真气至。 《真诰》曰：凡甲寅、庚申之日，尸鬼竞乱精神，躁秽之辰也，不可与女子执调及言笑耳。 是日遣诸欲，保元吉也。 仙人刘纲口诀曰：求仙者勿与女子正月元日、二月三日、三月九日、六月二日、九月六日、十二月三日，是日御女，六尸乱藏，血溃，三魂失守，神气凋逝，积以致毙，所以忌也。 此日者匪以藏，血溃而女官在寅申相刑，则日出於目朱童之中，是以女尸招男，男尸招女，祸害往复，丧神破精，虽人不自觉刑而灵已损，由三尸战於眼中，流血於泥丸也。 至其日，宠姬要女固不可相见耳。 仙师但终此道而长生。 紫阳真人曰：沐浴不数，魄之性也。 违魄反真，练其浊魄，自亡矣。 《大洞秘诀》曰：夜梦而心中自以为佳则吉感。 外觉当摩两月二七过，然后叩齿二七通，微咒曰： 太上高精，三帝丹灵。 绛官明彻，吉感告情。 三元柔魄，天皇受经。 所向谐合，飞升上清。 常与玉女，俱会紫庭。 恶梦咸吉也。 清神外禁第三",
      "translated_text": "**Purifying the Heart and Inner Taboos, Second Chapter**\n\nThe *Records of Dengdu* states: One must avoid speaking of the study of the Dao. Why? Words uttered outwardly will surely invite ghosts and malevolent beings to afflict a person, bringing illness. If one’s body is not yet perfected, one cannot but be cautious. The *Oral Instructions of the Sacred Mother of Shuling* says: Those who study immortality must be prudent in speech, for the mountain spirits and the hundred spirits will test them. Liu Jing also ascended as an immortal by employing this method.\n\nThe *Laozi’s Scripture on Nurturing the Spirit* states: When rinsing the mouth, one must avoid facing north or northwest, for the Dark Palace of Fengdu lies in the *hai* direction, and thus one must avoid doing so by the water’s edge. Many who fall ill cannot be saved—there is indeed a reason for this. If afflicted, recite the names of the Six Palaces to be spared. The names of the Six Palaces are recorded in the third chapter. One must strictly avoid gazing upon images above the water’s surface, for it often brings illness.\n\nIt further states: To chant or sing while feigning sleep is to invite misfortune. If one exposes oneself and is stricken by severe illness, there will be no regret. It also says: When combing one’s hair, one must not face north, for this brings great remorse. To let loose one’s hair is to draw near to the Yin Lord, allowing ghosts to take advantage. Even stepping on filth will cause emaciation and lingering illness.\n\nThe Lady of South Marchmount says: One’s bedchamber must be fragrant and clean. If unclean, one will be disturbed by stale *qi*, and the study of the Dao will be difficult to accomplish—this is deeply forbidden. It also says: When sleeping in the woods, one should choose a high place. If high, earthly *qi* will not reach, and the breath of ghosts will not invade. Otherwise, ghostly *qi* will rise from the ground to assail a person. The woods should be three feet and six inches high, for ghosts, being formless, cling to objects to manifest. Thus, at three feet and six inches, ghostly *qi* cannot reach. The ancient historian Yong once saw a ghost clinging to the ground, blowing through a tube at people—those who study the Dao must be especially cautious.\n\nThe oral instructions of the immortal Chen Anshi say: When combing one’s hair or partaking in food and drink upon one’s mat, one must not allow those who are not of the Dao to see or approach. If seen, the ghostly forms of the profane and the dead will invade one’s spirit. This is why those who dwell in the mountains seek to distance themselves from such people. Guard this secret!\n\nThe *True Radiance* states: Those who cultivate life must not weep excessively or spit often, for both deplete the fluids and drain the essence, leaving the throat and brain empty and exhausted. Thus, the perfected ones constantly practice breath regulation and saliva swallowing to restore their vitality.\n\nThe ancient master of the mysteries says: One cannot bathe too frequently—the fault lies in people’s inability to do so. Washing away foulness and grime allows true *qi* to arrive.\n\nThe *True Reports* states: On *jiayin* and *gengshen* days, corpse-ghosts vie to disturb the spirit—these are days of restlessness and impurity. One must not engage in intimate conversation or laughter with women on such days. Dispel all desires on these days to preserve one’s primordial auspiciousness.\n\nThe oral instructions of the immortal Liu Gang say: Those who seek immortality must not lie with women on the following days: the first day of the first lunar month, the third day of the second month, the ninth day of the third month, the second day of the sixth month, the sixth day of the ninth month, and the third day of the twelfth month. On these days, if one engages in intercourse, the Six Corpses will disorder the viscera, blood will seep, the Three Hun will lose their guard, and spirit and *qi* will wither away, leading to death over time—this is why these days are forbidden. On such days, if one does not restrain oneself, the blood will seep, and the female palace, being in *yin* and *shen* (which clash), will cause the sun to emerge from the red pupil of the eye. Thus, the female corpse summons the male, and the male corpse summons the female, bringing reciprocal calamity, harming the spirit, and breaking the essence. Though one may not perceive the clash, the numinous is already damaged, for the Three Corpses wage war within the eyes, causing blood to flow into the Mud Pill Palace. On these days, one must absolutely avoid seeing favored concubines or beloved women. The immortal masters simply follow this Way to attain longevity.\n\nThe Perfected One of Purple Yang says: Infrequent bathing is the nature of the *po*. To go against the *po* and return to the true is to refine one’s turbid *po*—otherwise, one will perish of one’s own accord.\n\nThe *Secret Instructions of the Great Cavern* states: If one dreams at night and feels content upon waking, it is a fortunate omen. Upon waking, one should rub the eyes twenty-one times, then click the teeth twenty-one times, and softly recite the incantation:\n\n*\"Supreme High Essence, Radiant Spirits of the Three Emperors.\nThe Vermilion Palace shines clearly, reporting auspicious omens.\nThe Three Origins soothe the *po*, the Heavenly Sovereign receives the scripture.\nAll endeavors harmonize, ascending to the Upper Clarity.\nEver accompanied by Jade Maidens, together we meet in the Purple Court.\nAll ill dreams become auspicious.\"*\n\n**Outer Prohibitions for Purifying the Spirit, Third Chapter**",
      "overlap_context": "- Spirit of the large intestine: Supporting\n- Spirit of the small intestine: Beam\n- Spirit of the intestines: Exhausted Hero\n- Spirit of the belly: Yin\n- Spirit of the knees: Region\n- Spirit of the shins: Confucius\n- Spirit of the feet: Heaven-Standing Valiant One\n\nBefore sleep, always first visualize these spirits—ghosts and malevolent beings cannot then deceive you. Visualizing them on the last day of the lunar month, the first day, the quarter moons, and the full moon is especially effective.",
      "start_char": 1282,
      "end_char": 2176,
      "start_sentence": 53,
      "end_sentence": 97,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.39209818840027,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\上玄高真延寿赤书.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "《邓都记》曰：有知邓都六官名，则百鬼不敢为珍。 欲外常先向北微其音再三咒曰： 吾是太上弟子，下统六天。 六天之官是吾所部，不但所部，乃太上之所主。 吾知六天官名，是吾长生，敢有犯者，太上斩汝形。 第一宫名纣绝阴天官，第二官名泰杀谅事宗天官，第三宫名明辰耐犯武城天官，第四宫名恬黑罪气天宫，第五宫名宗灵七非天官，第六官名敢司连宛屡天官。 诵毕，啄齿六十通乃外，辟万邪之气。 行之弥旬，死籍削注，生於南官耳。 《洞房太丹经》曰：恶梦者，一曰魄妖，二曰心试，三曰尸贼。 欲消之方，觉后以左手按人中二七过，叩齿二七通，咒曰： 大洞真玄，张炼三魂。 第一魂速守七魄，第二魂速守泥丸，第三魂受心节度。 速启太上元君曰：向遇不祥之梦，是七魄游尸来协邪源，急召桃康护命，消灭恶精，去凶成吉。 生死无因，行之不已，坐见将来休咎之事矣。 《邓都记》曰：夜行常呜天鼓，亦无至跟数也，可以辟百鬼，邪魅皆畏啄齿之声，是故不能犯人。 昔鲍生息风，齿自相啄，鬼物来录者闻叩齿之声皆远之，年一百三十岁履春冰而溺终。 议曰：叩风齿犹尚如此，何况道卫之人故叩齿者乎？ 藏密钩神第四 《真诰》曰：养生之道，先欲识己之形，存之极令准的，存在目前矣。 面上恒日月之光，洞，照一形也，使日在左，月在右，去面前九寸。 存毕，乃啄齿三通，微咒曰： 元胎上真，双景二玄，右抱七魄，左抱三魂，念我神明！ 与形常存。 诵毕，又啄齿三七通，咽液七过，此名帝君录形拘魂制魄之道，使人神仙长生不死也。 又凡存．神行真仙之事者，服玩茵席，皆务新洁，忌於点污，为三魂七魄或柄其中矣，深忌之。 《紫书三五顺行经》曰：入坐时，欲闭目内视，存见五藏肠胃。 久行之，得分明通也。 《紫度炎光内视中法》曰：每外，安身闭目内视，远听四方，注视万里之外。 精心为之，乃见百里外事也。 四方者，总其言耳，当先起一方而注视听，初为之实无髻实，久久诚自入妙而招真也。 云林王夫人曰：仙真之道，以耳目为主，视久则目间，听广则耳闭，此病从内而外奔也，非复有他。 至夜半，先闭目，束向，以手大指后掌各左右拭就耳门，使两掌但交会於项中三九过，存目中当有紫青绛三色气出目前，此是内按三素云以灌合童子。 阴咒曰： 眼童三云，两目真君，英明注精，开通清神，太玄云仪，灵骄翩翩，保利双阙，启彻九门，百节应响，朝液飞身，上升玉宫，列为上真。 咒毕，咽液五十度。 久为之，视彻千里也。 此亦真仙之道，不空明耳目而已。 青灵真人曰：守玄白之道，常坐外任意，存泥丸中有黑气，存心中有白气，存脐中有黄气，俱生如云以覆身，因变成大火，又烧身通洞内外，如一早行或达於午，使人长生不死。 此法互相出入，参而行之，益为佳也。 保命君曰：夫人心存拜，拜及心，旋行之时皆发炉，左右如行事状，谓内研太玄行虚业，栖自三宫，偃逸神府也。 昔赵公行之，感太上来降而登仙矣。 宝神平气第五 裴君《保神经》曰：人将老，鲜不先始於耳目也。 目下顿上，是央明保命归婴之所矣。 以手旋之，往复无数，是谓通血散皱，和精保神之生道也。",
      "translated_text": "*The Dengdu Record* states: If one knows the names of the Six Palaces of Dengdu, then the hundred ghosts dare not harm them. When going out, first face north and softly recite the incantation three times:\n\n*\"I am a disciple of the Supreme High, governing the Six Heavens below. The officials of the Six Heavens are under my command—not only under my command, but also under the dominion of the Supreme High. I know the names of the Six Heavenly Officials, which ensure my long life. Should any dare to transgress, the Supreme High will sever your form.\"*\n\nThe names of the Six Palaces are:\nFirst Palace: *Zhoujue Yintian* Official\nSecond Palace: *Taisha Liangshi Zongtian* Official\nThird Palace: *Mingchen Nai Fan Wucheng Tian* Official\nFourth Palace: *Tianhei Zuiqi Tian* Palace\nFifth Palace: *Zongling Qifei Tian* Official\nSixth Palace: *Gansi Lian Wanlü Tian* Official\n\nAfter reciting, click the teeth sixty times before going out, to repel the qi of the myriad evils. Practicing this for ten days will erase one’s name from the register of the dead and grant rebirth in the Southern Palace.\n\n*The Scripture of the Great Cinnabar of the Cavern Chamber* states: Evil dreams arise from three causes—first, the *po*-demon; second, the testing of the heart; third, the corpse-thief. To dispel them, upon waking, press the philtrum with the left hand twenty-one times, click the teeth twenty-one times, and recite the incantation:\n\n*\"Great Cavern, True and Mysterious, Zhang refines the Three Hun.\nThe first hun swiftly guards the Seven Po,\nThe second hun swiftly guards the Mud-Pill Palace,\nThe third hun receives the heart’s command.\nSwiftly invoke the Supreme High Primordial Lord:\n‘Just now, an inauspicious dream arose—\nthe Seven Po’s wandering corpse came to join with the source of evil.\nHasten to summon Peach-Kang to protect life,\ndispel the malign essence, and turn misfortune into fortune.\nNo cause for life or death remains.’\"*\n\nPracticing this without cease, one will sit and perceive the auspicious and inauspicious events of the future.\n\n*The Dengdu Record* states: When walking at night, one should constantly sound the Heavenly Drum, without a fixed number of strikes. This can repel the hundred ghosts, for evil spirits all fear the sound of clicking teeth and thus dare not approach. Formerly, Master Bao of Qi suffered from wind, and his teeth naturally clicked together. When ghosts came to claim him, they heard the sound of his clicking teeth and kept their distance. He lived to one hundred thirty years, crossing spring ice without sinking until his end.\n\nIt is said: If even the clicking of teeth in the wind achieves this, how much more so for those who deliberately practice it?\n\n**Concealing the Mysterious and Hooking the Spirits, Fourth Chapter**\n\n*The Declarations of the Perfected* states: The Dao of nurturing life begins with recognizing one’s own form, visualizing it with utmost clarity until it stands vividly before the eyes. On the face, the radiance of the sun and moon shines forth, illuminating the entire form. Place the sun on the left and the moon on the right, nine inches from the face. After visualization, click the teeth three times and softly recite the incantation:\n\n*\"Primordial Womb, Supreme Perfected,\nTwin Effulgences of the Two Mysteries,\nOn the right, embrace the Seven Po,\nOn the left, embrace the Three Hun.\nConcentrate on my spirit luminants!\nLet them ever abide with my form.\"*\n\nAfter reciting, click the teeth twenty-one times and swallow saliva seven times. This is called the method of the *Celestial Lord Recording the Form, Restraining the Hun, and Controlling the Po*, enabling one to become an immortal and live forever without dying.\n\nFurthermore, in all matters of visualizing spirits and practicing the arts of the perfected immortals, the bedding and mats one uses must be kept fresh and clean, avoiding any stains or filth, lest the Three Hun and Seven Po take residence therein—this is deeply forbidden.\n\n*The Scripture of the Three and Five in Harmonious Practice* states: When sitting, close the eyes and inwardly visualize the five viscera and intestines. With prolonged practice, one will perceive them with perfect clarity.\n\n*The Method of Inward Vision in the Crimson Radiance of the Purple Empyrean* states: Whenever going out, settle the body, close the eyes, and inwardly gaze while listening afar to the four directions, focusing vision and hearing upon places a thousand miles away. With concentrated effort, one will eventually see events a hundred miles distant. The \"four directions\" are a general term—one should begin by focusing on one direction for vision and hearing. Initially, there may be no tangible result, but with prolonged sincerity, one will naturally enter the wondrous and summon the true.\n\nLady Wang of Yunlin said: The Dao of the perfected immortals takes the ears and eyes as its foundation. Prolonged gazing strains the eyes, and excessive listening dulls the ears—this malady arises from within and rushes outward, with no other cause. At midnight, first close the eyes, face east, and with the thumbs behind the palms, wipe toward the ear openings, crossing the hands at the nape of the neck twenty-seven times. Visualize three colored qi—purple, cyan, and crimson—emerging before the eyes. This is the inner pressing of the Three Pure Clouds to irrigate and unite with the Youthful Lad. Recite the yin incantation:\n\n*\"Eye Lads of the Three Clouds,\nTrue Lords of the Two Eyes,\nHeroic and luminous, they concentrate essence,\nOpening and penetrating the pure spirit.\nCloud Emblem of the Great Mystery,\nSpiritual Steeds soaring lightly,\nProtect and benefit the Twin Gates,\nUnseal and illuminate the Nine Portals.\nThe hundred joints respond in resonance,\nMorning saliva flies the body,\nAscending to the Jade Palace,\nEnnobled as Supreme Perfected.\"*\n\nAfter reciting, swallow saliva fifty times. With prolonged practice, one will see clearly for a thousand miles. This is also the Dao of the true immortals, not merely for brightening the ears and eyes.\n\nThe Perfected of Azure Spirit said: In the method of guarding the Mysterious and White, sit calmly and visualize black qi in the Mud-Pill Palace, white qi in the heart, and yellow qi in the navel, all arising like clouds to cover the body. They then transform into a great fire, burning the body inside and out. If practiced from dawn to noon, it enables one to live forever without dying. These methods complement one another; practicing them in alternation yields even greater benefit.\n\nThe Lord of Preserving Life said: When a person concentrates the heart in bowing, the bow reaches the heart. During circular movement, the furnace is activated, with left and right motions as if conducting affairs. This is called *inwardly refining the Great Mystery, practicing the work of emptiness, perching in the Three Palaces, and reclining in the divine mansion*. Formerly, Lord Zhao practiced this and moved the Supreme High to descend, whereupon he ascended as an immortal.\n\n**Preserving Life and Calming Qi, Fifth Chapter**\n\nMaster Pei’s *Scripture of Preserving the Spirit* states: When a person grows old, it seldom begins anywhere but the ears and eyes. The area below the eyes and above the cheekbones is where the *Brightness-Centered Preservation of Life* returns to infancy. Rub this area with the hands in endless cycles—this is called the *Dao of Circulating Blood, Dispersing Wrinkles, Harmonizing Essence, and Preserving the Spirit to Sustain Life*.",
      "overlap_context": "e teeth twenty-one times, and softly recite the incantation:\n\n*\"Supreme High Essence, Radiant Spirits of the Three Emperors.\nThe Vermilion Palace shines clearly, reporting auspicious omens.\nThe Three Origins soothe the *po*, the Heavenly Sovereign receives the scripture.\nAll endeavors harmonize, ascending to the Upper Clarity.\nEver accompanied by Jade Maidens, together we meet in the Purple Court.\nAll ill dreams become auspicious.\"*\n\n**Outer Prohibitions for Purifying the Spirit, Third Chapter**",
      "start_char": 2176,
      "end_char": 3425,
      "start_sentence": 98,
      "end_sentence": 142,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.711024045944214,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\上玄高真延寿赤书.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "又曰：以手乘额上，内存童子若日月双明，上下数积三九乃止，此谓手朝三元，固脑坚发之道也。 头四面以两手乘之，顺发就结，唯令多也。 於是头血流散，风湿不凝。 都毕，以手按目四毗，凡至二九，令目见光者，检眼神之道，久为之，得见百灵。 又使手不离面益佳，已成高真犹不废之。 《太素丹景经》曰：一面之上，常欲两手摩之，高下皆使热，令人面有光泽。 行之五年，色如处女，所谓山川行气，常盈不没也。 《太上开天经》曰：常宜以手按目近鼻之两毗，闭气为之，气通辄止，吐而复如。 恒行之，能洞观幽远焉。 杨真人夜外觉，常叩齿七通，咽液九过。 毕，以手按鼻之两边左右上下，数至十遍，微咒曰：太上四明，九门发辉。 两目玄彻，通真达灵，天中玄台，流气调平。 娇女云仪，眼童英明。 华聪晃朗，百度眇清。 保和上元，徘徊九城。 五藏植根，耳目自生。 天台郁素，梁柱不倾。 七魄澡练，三魂安宁。 赤子擭景，辄与我并。 有敢掩我耳目，太上当摧以流铃。 万凶消灭，所愿必成。 日月守门，心藏五星。 真皇所祝，群响敬听。 外觉，辄诵於此，勿失一迹也。 令人面有童颜，制魄录魂，去辟千魔，七孔分流，色如舜华，真人起居之妙道。 毕，咽津九过，石景赤子常以手摩口鼻，临目。 久之，手中生液，进以摩两目，日行之使人体香身轻。 《太上发华经》曰：常以生气时咽液二七过。 毕，按体所痛处，向生，气咒曰： 左玄右玄，三神合真。 左黄右黄，六华相当。 风气恶疾，伏匿四方。 玉女流泽，上下宣通。 内遣水火，外辟不祥。 长生飞仙，身常休强。",
      "translated_text": "The text further states: Place the hands upon the forehead, inwardly envisioning a youthful figure or the twin luminaries of sun and moon. Repeat this upward and downward motion, accumulating counts until three nines are reached—this is called *the hands paying homage to the Three Origins, the Dao of fortifying the brain and strengthening the hair*. Encompass the four sides of the head with both hands, smoothing the hair and untying knots, ensuring thoroughness. Thus, the blood of the head flows and disperses, and wind-dampness does not congeal.\n\nWhen complete, press the four corners of the eyes with the hands, reaching two nines in total. This enables the eyes to perceive light—*the Dao of inspecting the spirit of the eyes*. With prolonged practice, one may behold the hundred spirits. It is even better if the hands never leave the face; even accomplished perfected beings do not abandon this.\n\nThe *Scripture of Great Simplicity and Cinnabar Radiance* states: Upon the face, one should constantly rub with both hands, ensuring warmth across all areas, which grants the face a lustrous glow. Practicing this for five years, the complexion becomes like that of a maiden—*the flowing qi of mountains and rivers, ever full and never depleted*.\n\nThe *Scripture of the Supreme High’s Opening of Heaven* states: One should frequently press the corners of the eyes near the nose with the hands, holding the breath while doing so. Cease when the qi flows through, then exhale and repeat. With constant practice, one gains the ability to perceive the hidden and distant.\n\nMaster Yang, when awakening at night, would always knock his teeth seven times and swallow saliva nine times. Upon completion, he would press the sides of his nose with his hands, moving left and right, up and down, counting to ten repetitions. He would softly recite the incantation:\n\n*\"Supreme High’s Four Luminaries, the Nine Gates radiate brilliance.\nThe two eyes, dark and penetrating, connect with the true and reach the numinous.\nThe Mysterious Terrace in Heaven, flowing qi harmonized and balanced.\nThe Cloud Maiden’s graceful bearing, the eye-child’s keen clarity.\nFlowering wisdom, bright and resplendent, a hundred visions clear and distant.\nPreserving harmony in the Upper Origin, wandering the Nine Citadels.\nThe five viscera take root, ears and eyes naturally arise.\nThe Heavenly Terrace, lush and pure, its beams and pillars unwavering.\nThe seven po refined and tempered, the three hun at peace.\nThe Red Child seizes the radiance, ever at my side.\nShould any dare obstruct my ears and eyes, the Supreme High shall crush them with flowing bells.\nTen thousand evils vanish, all wishes fulfilled.\nSun and moon guard the gates, the heart harbors the five stars.\nThe True Sovereign’s invocation, all echoes heed with reverence.\"*\n\nUpon awakening, recite this without fail. It grants the face a youthful countenance, restrains the po and records the hun, repels a thousand demons, and causes the seven apertures to flow freely, the complexion blooming like the flower of Shun. This is the wondrous Dao of the perfected being’s daily practice.\n\nUpon completion, swallow saliva nine times. The Red Child of Stone Radiance constantly rubs the mouth and nose, then the eyes. Over time, the hands generate fluid, which is then used to rub the eyes. Daily practice makes the body fragrant and the form light.\n\nThe *Scripture of the Supreme High’s Flourishing Radiance* states: At the time of living qi, swallow saliva twice seven times. Upon completion, press the painful areas of the body, facing the direction of life, and recite the incantation:\n\n*\"Left Mysterious, Right Mysterious, the Three Spirits unite as one.\nLeft Yellow, Right Yellow, the Six Radiances align.\nWind-qi and malignant illnesses, subdued in the four directions.\nJade Maidens flow with grace, above and below freely coursing.\nInternally dispatching water and fire, externally repelling misfortune.\nEverlasting life and flying transcendence, the body ever at rest and strong.\"*",
      "overlap_context": "an immortal.\n\n**Preserving Life and Calming Qi, Fifth Chapter**\n\nMaster Pei’s *Scripture of Preserving the Spirit* states: When a person grows old, it seldom begins anywhere but the ears and eyes. The area below the eyes and above the cheekbones is where the *Brightness-Centered Preservation of Life* returns to infancy. Rub this area with the hands in endless cycles—this is called the *Dao of Circulating Blood, Dispersing Wrinkles, Harmonizing Essence, and Preserving the Spirit to Sustain Life*.",
      "start_char": 3426,
      "end_char": 4047,
      "start_sentence": 143,
      "end_sentence": 177,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.273113489151,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\上玄高真延寿赤书.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "诵毕，咽液十二遍，乃急按所苦处三十度，永无疾疝也。 《内景经》曰：卧起先帛拭胸项目，使温然，因顺发摩顶。 良久两手拭面目，咽液三十过。 久行之，使人目明，邪气不入，体永宁。 《大洞真经》曰：外起当正坐平气，以两手掩头，目仰视，与手争力三四止，使人精和血通，风气不入。 能久行之，不病不老也。 方丈昭灵李夫人曰：耳欲得数抑其左右，亦令人听彻。 所谓营治城郭，当得名书生籍。 鼻欲按其左右准令数，使人气平。 所谓无卒使溉灌中岳，名书帝录。 《太极经》曰：理发宜向王地，因栉发之始而微咒一曰： 泥丸玄华，保精长存。 右为隐月，左为日根。 六合清练，百神受恩。 诵毕，咽液三过。 常行之，发不落，而生矣。 又曰：常数易栉处，栉多而不使痛，亦可令侍者栉之，取多佳也。 於是血流不滞，发根常坚。 令侍者濯手，然令栉，不然污天宫也。 《真诰》曰：栉发欲弘多，通气血，散风湿也。 数易栉愈良多，可不须解发也。 《丹景经》曰：以手更摩发及理栉似热。 两臂亦更互以手摩之，使发不白及脉不浮外也。 注藏永图第六 《真诰》曰：长生之道，当去疾，不使体有亏邪，及血少脑臧，津秽滞也。 不先去疾，虽服食行气无益。 昔有皇甫女，好神仙，常吸引日月，以三十载都不觉少益，后遇南岳真人教之：子不得升仙者，子有疾，脑官亏，服去病药，修持其事。 后十八年，白日上升矣。 《太上九变十化易经》曰：若履掩室乳血，当急盥浴以解。 法用竹叶十两，桃白皮四两，右以水一斛二斗，煮一沸扬出，通寒温以浴，则万秽消也。 匪以除秽，深辟温痹创痒之病。 天人下游，将还上界，未曾不用此水以解秽也。 仙人沈义口诀曰：服神药勿向北方，大忌之。 亥子日，不可唾，亡精乱气，臧损年命，药力如土。 《黄山君诀》曰：服药物不欲食蒜、石榴子、堵肝、犬头，计食一斤，损算一百日，宜慎之。 束卿司命曰：服仙药常向本命服，毕，勿道死凶事，犯伤胎神，徒服无益。 九华安妃曰：临食，勿言丑事。 沐浴常存六丁，令所愿丰。 《礼》亦云：临食不欲，良有以焉。 又曰：勿令露食，来众邪气。 人因好食而遇疾或难救者，信露食之邪犯露食者，谓不欲特造失覆之物也。 阴行真气第七 紫微左夫人《喻书》曰：耳目是寻真梯级，得失系之，岂轻易邪？ 宜以手按两眉后小穴中二九过，又以手摩两倾上，手旋耳三十过，摩惟令无时节也。 毕，以手乘额三九过，从眉中始乃上行入发际是，因咽液，多少无数也。 如此常行，耳目自明，一年可夜书。 亦可於人中密为之，勿语其状。 又曰：眉后小穴中为上元六合之府，眼晖和莹，精光长珠彻童，保炼目神，是真人坐起之上道矣。 一曰真人常居内经曰：子欲夜书，当修常居，真人所以能旁观四达八避视掌中者，常居之理也。 又曰：被华盖之侧，延和天真，入山涧之谷，填天山之源，则虚灵可见万鬼，灭奸所为，仰和天真，俯按山源也。 山源，鼻孔中初入高者也。 又曰：天真，两眉之问眉之角也。 山源，是鼻下人中之本。 侧在鼻下小入谷中。 华庭在两眉之下，是彻视之津梁。 天真是引灵之上房。 晨暮常咽液三九，以手阴按之，令人致灵彻视，杜遏万邪之道也。",
      "translated_text": "Upon completion of the recitation, swallow saliva twelve times, then swiftly press the afflicted area thirty times—thus shall illness and hernia never arise.\n\nThe *Scripture of Internal Radiance* states: Upon rising from bed, first wipe the chest and forehead with silk until warm, then stroke the head in the direction of the hair’s growth. After a long while, rub the face and eyes with both hands and swallow saliva thirty times. With prolonged practice, the eyes grow bright, noxious qi cannot enter, and the body remains forever at peace.\n\nThe *Perfect Scripture of the Great Cavern* says: When rising externally, sit upright and regulate the breath. Cover the head with both hands, gaze upward, and contend against the hands with force three or four times—this harmonizes essence and circulates blood, preventing wind-qi from entering. With long practice, one neither sickens nor ages.\n\nLady Li of Fangzhang, the Illustrious Spirit, says: Frequently press the ears on both sides to sharpen hearing. This is called \"tending the city walls\"—one must inscribe it in the register of the named scholars. Often press the sides of the nose to balance the qi. This is called \"without haste, irrigate the Central Peak\"—inscribe it in the Emperor’s records.\n\nThe *Scripture of the Supreme Ultimate* states: When combing the hair, face the direction of the ruler. At the first stroke, softly recite the incantation:\n*\"Mud-Pill Palace’s mysterious blossom, preserving essence ever abiding.\nRight as the hidden moon, left as the sun’s root.\nThe Six Harmonies purified and refined—\nthe hundred spirits receive grace.\"*\nUpon completion, swallow saliva three times. With regular practice, the hair does not fall but grows instead.\n\nIt further says: Frequently change the parting of the hair, combing often without causing pain. One may also have an attendant comb it—more is better. Thus the blood flows unimpeded, and the hair roots remain firm. Have the attendant wash their hands before combing, lest they defile the Celestial Palace.\n\nThe *True Reports* states: Combing the hair should be broad and frequent to circulate qi and blood and disperse wind-dampness. Changing the part often is even better—there is no need to loosen the hair. The *Scripture of the Cinnabar Landscape* says: Alternately rub the hair and comb it until warm. Also, alternately rub the arms with the hands to prevent the hair from whitening and the vessels from floating outward.\n\n*Register of the Hidden and Eternal Diagram, Sixth Scroll*\nThe *True Reports* states: The Dao of long life requires eliminating illness, preventing harm to the body, and avoiding depletion of blood, brain, and marrow, as well as stagnation of fluids and filth. Without first removing illness, even the consumption of medicinal foods and the practice of qi-cultivation are of no benefit. There was once a woman of the Huangfu clan who loved the divine immortals and constantly absorbed the essence of the sun and moon. After thirty years, she felt no benefit. Later, she met the Perfected One of South Mountain Peak, who taught her: \"You cannot ascend as an immortal because you have illness—your brain palace is deficient. Take medicine to dispel sickness and cultivate the practice.\" After eighteen years, she ascended in broad daylight.\n\nThe *Scripture of the Nine Transformations and Ten Transmutations of the Supreme High* states: If one treads upon hidden chamber milk-blood, one must immediately bathe to dispel it. The method uses ten ounces of bamboo leaves and four ounces of white peach bark, boiled in one *hu* and two *dou* of water until bubbling. Strain and bathe with the liquid, adjusting the temperature—thus all filth is dissolved. This not only removes impurity but deeply prevents warm impediment, sores, and itching. When celestial beings descend to wander below and return to the upper realms, they invariably use this water to dispel impurity.\n\nMaster Shen Yi’s oral instructions say: When ingesting divine medicine, do not face north—this is a great taboo. On *hai* and *zi* days, do not spit, lest essence scatter, qi disorder, and lifespan be harmed, rendering the medicine’s power as dust. The *Oral Instructions of the Yellow Mountain Lord* state: When taking medicinal substances, avoid eating garlic, pomegranate seeds, pig’s liver, and dog’s head. For every catty consumed, one’s lifespan is reduced by a hundred days—beware of this.\n\nThe Director of Destiny of Shuqing says: When ingesting immortal medicines, always face the direction of your life destiny. Upon completion, do not speak of death or inauspicious matters, lest you offend the fetal spirit and render the medicine useless. The Ninth Radiance’s Peaceful Consort says: When about to eat, do not speak of ugly matters. When bathing, constantly visualize the Six Ding spirits to fulfill your wishes. The *Book of Rites* also says: \"Do not desire [to speak of] such things when eating\"—there is good reason for this. It further says: Do not leave food exposed, lest various noxious qi gather. Many have fallen ill or faced incurable conditions due to fondness for food—truly, the harm of exposed food is real. \"Exposed food\" refers to food that is not properly covered.\n\n*Seventh Scroll: Cultivating True Qi in Seclusion*\nThe Left Consort of Purple Tenuity’s *Admonitory Writings* states: The ears and eyes are the ladder rungs for seeking the Perfected—success or failure depends on them. How can they be treated lightly? Press the small cavities behind both eyebrows twenty-seven times, then rub the temples with the hands and rotate the ears thirty times. The rubbing should be done without fixed timing. Upon completion, sweep the forehead with the hands twenty-seven times, beginning between the eyebrows and moving upward into the hairline. Then swallow saliva, in no fixed amount. With regular practice, the ears and eyes grow bright, and within a year, one can read at night. This may also be done discreetly at the philtrum without revealing the method.\n\nIt further says: The small cavities behind the eyebrows are the palace of the Upper Prime and Six Harmonies. When the eyes’ radiance is harmonious and lustrous, the essence-light shines like a pearl, ever youthful—this is the supreme Dao of the Perfected One’s sitting and rising. The *Internal Scripture of the Perfected One’s Constant Abode* states: If you wish to read at night, cultivate the Constant Abode. The reason the Perfected One can see in all four directions, the eight reaches, and even the palm of the hand is the principle of the Constant Abode.\n\nIt further says: Beneath the canopy of flowering brilliance, extend harmony to the celestial Perfected. Entering the valley’s ravine, fill the source of the Celestial Mountain—thus the empty and numinous can see the myriad ghosts, and the machinations of the wicked are extinguished. Above, harmonize with the celestial Perfected; below, press the mountain’s source. The \"mountain source\" is the high point at the initial entry of the nostrils. The \"celestial Perfected\" is the space between the eyebrows, at the corners of the brows. The \"mountain source\" is the root of the philtrum below the nose. The \"ravine\" is the small valley slightly within the nose. The \"Flowery Court\" lies below the two eyebrows—it is the bridge for penetrating vision. The \"Celestial Perfected\" is the upper chamber for drawing in the numinous. Morning and evening, constantly swallow saliva twenty-seven times and press these points with the hands—this is the Dao of attaining numinous clarity, seeing through all, and blocking the myriad evils.",
      "overlap_context": "ion, press the painful areas of the body, facing the direction of life, and recite the incantation:\n\n*\"Left Mysterious, Right Mysterious, the Three Spirits unite as one.\nLeft Yellow, Right Yellow, the Six Radiances align.\nWind-qi and malignant illnesses, subdued in the four directions.\nJade Maidens flow with grace, above and below freely coursing.\nInternally dispatching water and fire, externally repelling misfortune.\nEverlasting life and flying transcendence, the body ever at rest and strong.\"*",
      "start_char": 4047,
      "end_char": 5325,
      "start_sentence": 178,
      "end_sentence": 234,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.15255117416382,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\上玄高真延寿赤书.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "咒曰： 开通天廷，使我长生。 彻视万里，魂魄复婴。 灭鬼去邪，来致千灵。 上升太清，与日合并。 得补真人，列象玄名。 对时习真第八 《真诰》曰：夫学道先检制魂魄，消灭鬼尸，常以晦朔日、庚申、甲寅日当清心沐浴，正席危坐，得不寐者益善，以真朱笔点左目毗下，以雄黄笔点右鼻下，令小半入谷里，点毕先叩齿三通，微咒曰： 上景飞玄，朱黄散烟，气摄虚邪，尸秽沈泯，和魂练魄，举形合真，令我不死，万寿永全，聪明彻视，长亨利津。 诵毕，叩齿三通，咽液三过，及以右手第三指按右鼻孔下，左手第二指捻左目下，各七过当尽。 阴按此二处，是七魄游尸之门户也。 铁精贼邪之津梁，故受朱黄之精，塞尸鬼之路也。 太极上法，常能行之，则魂魄和柔，尸秽散绝，长生神仙矣。 紫虚元君曰：常以正月四日、二月八日、三月十五日、六月六日、七月七日、八月八日、九月九日、十月五日、十一月三日、十二月二日，是日太上玉晨君登山玉霄林房，四陌天下，有远游之心者，宜以此日日未出时向北再拜，自陈所怀，咽液三十六度，愿无不从也。 九华安妃曰：入室静户先前右足，后进左足，令与右齐。 及趋行，如使人陈启，通达上闻。 《真诰》曰：五卯日常当斋心，入室束向，心存拜存神，平气朝感神明，亦适意所陈，罔不从愿，恒如此者，玉女降侍。 又曰：常以本命日向束方叩齿三通，存心再拜而微咒曰： 太一慎生，三气合真。 室胎上景，母玄父元。 生我五藏，摄我精神。 下灌玉华，左笑金晨。 令我神仙，役灵使神。 常保利津，飞行十天。 诵毕，又心拜四方，叩齿三通，咽液三过。 此名太上祝生隐朝胎元之道也。 常能行之，令魂魄保守，长生神仙。 又曰：至甲子及朔日，当沐浴使人通灵。 又曰：八节日，当斋心，谋言必以善事，慎不可以其日震怒及行威刑，皆天人大忌也。 切慎之吉。 《太丹真经》曰：常以二月二日、三月三日、八月八日、九月九日、十月十日夜，於寝室存思洞中诀事，不眠者吉也。 其夕，卫经玉女将太极典禁於空中而察子也。 是夜烧香，精苦如有所待也。 坐外存思，或读经书，念真在思，唯不可以施他事，久久下为师友接人升天矣。 又曰：发炉时勿反顾，顾则误众真，真气致邪应也。 太极真人读道德五千文万遍，则云车来迎，长生矣。 真人孟德然曰：暮卧先读《黄庭内景经》一遍，使魂魄安逸。 行之十年，长生神仙矣。 北岳蒋夫人云：读此经亦使人无病，是不死之道也。 上玄高真延寿赤书竟",
      "translated_text": "The incantation states:\n\"Open the celestial court, grant me eternal life.\nSee through ten thousand miles, let soul and spirit return to infancy.\nBanish ghosts and expel evil, summon a thousand numinous beings.\nAscend to the Great Clarity, merge with the sun.\nAttain the rank of Perfected, inscribe your name in the mysterious register.\"\n\n*Essential Methods for Cultivating Perfection*, Chapter Eight:\nThose who study the Dao must first restrain and regulate soul and spirit, eliminate the ghostly corpse. On the days of the new and full moon, the Gengshen day, and the Jiayin day, one should purify the heart, bathe, sit upright on a mat, and remain awake—this is even better. With cinnabar brush, mark the left eye below the outer canthus; with realgar brush, mark the right side below the nose, allowing it to slightly enter the valley. After marking, first knock the teeth three times and softly recite the incantation:\n\"Lofty scenes fly in mystery, cinnabar and realgar disperse mist.\nQi seizes the insubstantial evil, corpse-filth sinks and vanishes.\nHarmonize the hun-soul, refine the po-spirit, elevate the form to merge with the Perfected.\nGrant me immortality, eternal preservation of myriad years,\nkeen insight and penetrating vision, enduring prosperity and smooth passage.\"\nAfter reciting, knock the teeth three times, swallow saliva three times, and press with the third finger of the right hand below the right nostril, and with the second finger of the left hand pinch below the left eye, each seven times until complete. Pressing these two places in secret seals the gates through which the seven po-spirits and wandering corpse roam. They are the bridges through which iron essence and malevolent spirits invade, thus receiving the essence of cinnabar and realgar to block the paths of corpse-ghosts. This is the supreme method of the Great Ultimate. Practicing it constantly harmonizes and softens the hun and po, scatters and severs corpse-filth, and leads to long life and transcendence as a divine immortal.\n\nThe Purple Void Primordial Lady states: On the fourth day of the first month, the eighth day of the second month, the fifteenth day of the third month, the sixth day of the sixth month, the seventh day of the seventh month, the eighth day of the eighth month, the ninth day of the ninth month, the fifth day of the tenth month, the third day of the eleventh month, and the second day of the twelfth month—on these days, the Supreme Jade Dawn Lord ascends the Jade Cloud Forest Chamber of the mountain, surveying the four directions of the world. Those with aspirations for distant journeys should, on these days before sunrise, face north and bow twice, stating their intentions, swallowing saliva thirty-six times, and all wishes will be granted.\n\nThe Ninth Radiance Peaceful Consort states: When entering a quiet chamber, first step forward with the right foot, then bring the left foot to align with it. In walking, proceed as if presenting a report to a superior, ensuring it reaches the ears above.\n\n*Essential Methods for Cultivating Perfection* states: On the five Mao days, one should purify the heart, enter the chamber facing east, mentally visualize bowing and invoking the spirits, regulate the breath to greet and sense the divine luminaries. Whatever is expressed with sincerity will be granted. Those who persist in this will have Jade Maidens descend to attend them. It also states: On one’s birth day, face east, knock the teeth three times, mentally visualize bowing twice, and softly recite the incantation:\n\"Great One, guard life, the three qi merge with the Perfected.\nThe chamber’s womb holds the lofty scene, mother mysterious and father primordial.\nYou gave birth to my five viscera, gathered my essence and spirit.\nBelow, irrigate the Jade Flower; to the left, smile at the Golden Dawn.\nGrant me divine transcendence, command spirits and employ the numinous.\nConstantly preserve the smooth passage, soaring through the ten heavens.\"\nAfter reciting, mentally bow to the four directions, knock the teeth three times, and swallow saliva three times. This is called the Supreme Method of the Hidden Morning Audience for the Embryonic Origin. Practicing it constantly secures the hun and po, leading to long life and transcendence as a divine immortal.\n\nIt also states: On Jiazi days and the first day of the month, one should bathe to attain spiritual communion. It further states: On the eight seasonal nodes, one should purify the heart, speak only of good deeds, and be vigilant against anger or the exercise of punitive authority—these are great taboos for heaven and humanity. Be cautious and auspicious.\n\n*The Scripture of the Great Elixir of Perfection* states: On the second day of the second month, the third day of the third month, the eighth day of the eighth month, the ninth day of the ninth month, and the tenth day of the tenth month at night, within the bedchamber, visualize the secrets of the Grotto-Heaven. Remaining awake is auspicious. That evening, the Jade Maidens of the Protective Scriptures, bearing the Great Ultimate’s canonical prohibitions, will observe you from the void. On that night, burn incense and maintain reverent focus as if awaiting something. Sit outside, visualize, or read scriptures, concentrating on the Perfected within your thoughts. Do not engage in other affairs. Over time, you will be received by masters and friends, ascending to heaven.\n\nIt also states: When activating the furnace, do not look back, for doing so misleads the assembled Perfected and causes true qi to invite demonic responses. The Perfected of the Great Ultimate who recite the *Five Thousand Character Scripture of the Dao and Virtue* ten thousand times will be welcomed by cloud chariots and attain long life.\n\nThe Perfected Meng Deran states: Before sleeping at night, first recite the *Inner Radiance Scripture of the Yellow Court* once to pacify the hun and po. Practicing this for ten years leads to long life and transcendence as a divine immortal.\n\nThe Lady Jiang of the Northern Peak states: Reciting this scripture also keeps one free from illness—it is the Way of not dying.\n\nHere ends the *Red Writ for Prolonging Life by the Lofty Perfected of the Supreme Mystery*.",
      "overlap_context": "e brows. The \"mountain source\" is the root of the philtrum below the nose. The \"ravine\" is the small valley slightly within the nose. The \"Flowery Court\" lies below the two eyebrows—it is the bridge for penetrating vision. The \"Celestial Perfected\" is the upper chamber for drawing in the numinous. Morning and evening, constantly swallow saliva twenty-seven times and press these points with the hands—this is the Dao of attaining numinous clarity, seeing through all, and blocking the myriad evils.",
      "start_char": 5325,
      "end_char": 6323,
      "start_sentence": 235,
      "end_sentence": 274,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.737302541732788,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\上玄高真延寿赤书.txt",
        "category": "方法类"
      }
    }
  ]
}