{
  "source_id": "上阳子金丹大要列仙志",
  "source_file": "chunked_daozang\\上阳子金丹大要列仙志.json",
  "total_chunks": 7,
  "total_original_chars": 3049,
  "total_translated_chars": 18555,
  "total_translation_time": 103.68226909637451,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\上阳子金丹大要列仙志.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**The Record of Immortals from the *Essential Teachings on the Golden Elixir* by Master Shangyang**\n\n**Title:** *The Record of Immortals from the Essential Teachings on the Golden Elixir by Master Shangyang*\nCompiled by Chen Zhixu of the Yuan dynasty. Originally an appendix to the *Essential Teachings on the Golden Elixir*, later separated into an independent volume.\nSource text: *Daoist Canon of the Zhengtong Era*, Tai Xuan Section.\n\n---\n\n### **The Record of Immortals from the *Essential Teachings on the Golden Elixir* by Master Shangyang**\n\n**The Lord Emperor of Donghua**\nSurnamed Wang, his generation and given name are unknown; some say his name was Xuanfu. He attained the Dao of Laozi, later concealing himself on Kunlun Mountain, then dwelling in the Purple Palace Grotto-Heaven of Wutai Mountain, styling himself the Lord of Lesser Yang. In the Niyang Grotto of Zhongnan Mountain, he transmitted the Dao to Zhongli Quanzhen. Born on the fifteenth day of the sixth month, he ascended on the sixteenth day of the tenth month.\n\n**The Lord Emperor of Zhengyang**\nSurnamed Zhongli, named Quan, styled Yunfang, with the sobriquet Master Zhengyang. A native of Xianyang in Jingzhao. Served as a general under the Han, but due to military setbacks, he entered Zhongnan Mountain, where he encountered the Lord of Lesser Yang and received the Supreme Dao. He concealed himself on Yangjiao Mountain in Jinzhou. Upon achieving the Dao, the Heavenly Emperor bestowed upon him the title *True Person of the Left Palace of the Great Ultimate*. He bound his hair with twin stars, wore oak leaves, and called himself the *Unfettered Wanderer of the World*. His poems circulated in the world. Later, by the Li River, he transmitted the Dao to Lü Chunyang. Born on the fifteenth day of the fourth month, he ascended on the eighteenth day of the fifth month.\n\n**The Lord Emperor of Chunyang**\nSurnamed Lü, named Yan, styled Dongbin, with the sobriquet Master Chunyang. His ancestors resided in Zhaoxian Village, Yongle Town, Manzhe County, Xijing Henan Prefecture (present-day Fan County, Puzhou). Born on the fourteenth day of the fourth month at the Hour of Si in the fourteenth year of the Tianbao era (755 CE) of the Tang, though some say he was born in the Bingzi year of the Zhenyuan era under Emperor Dezong. His father served as prefect of Haizhou, and Lü settled there with his family. Through the imperial examinations, he was appointed magistrate of Dehua in Jiangzhou.\n\nLater, wandering through Mount Lu and roaming along the Li River, he encountered Zhengyang, who transmitted the Dao to him, and to this day remains in the world. The Heavenly Emperor issued an edict appointing him as the Nine Heavens’ Inspector of Immortals. On the twentieth day of the fifth month, he composed a poem upon receiving the edict, containing the line: *\"To rectify the celestial registers of divine immortals.\"* The world thereafter took this day as his ascension. His collection of poems and lyrics, *The Complete Works*, circulates in the world. He transmitted the Dao to Hai Chan and Chongyang.\n\nBorn on the fourteenth day of the fourth month, he ascended on the twentieth day of the fifth month.\n\n**The Lord Emperor of Hai Chan**\nSurnamed Liu, named Cao, styled Zongcheng, with the sobriquet Master Hai Chan, later changing his name to Xuanying. A native of Yanshan. He served in the Liao court, rising to the rank of prime minister. Upon encountering Chunyang, he immediately resigned his ministerial seal, feigning madness to wander far in Qinzhou. Chunyang transmitted to him the alchemical Dao, whereupon he composed a poem: *\"I cast aside a fiery household of three thousand souls, / Dismissed the gate guards of a hundred myriad homes.\"* Later, having attained the Dao, he concealed his traces between Mount Zhongnan and Mount Taihua. He transmitted the Golden Elixir to Dong Ningyang and Zhang Ziyang.\n\nBorn on the fourteenth day of the twelfth month, he ascended on the fifteenth day of the sixth month.\n\n**The Lord Emperor of Chongyang**\nSurnamed Wang, named Zhongfu, styled Yunqing. He later changed his name to Shixiong, styled Dewei. After entering the Dao, he altered his name to Zhe, styled Zhiming, with the sobriquet Master Chongyang. A native of Dawei Village, Xianyang. Born in the second year of the Zhenghe era (1112 CE) of Emperor Huizong of the Song.\n\nOn the twenty-second day of the twelfth month in the *renchen* year, at Ganhe Town in Zhongnan County, he encountered Pure Yang, who transmitted oral instructions to him. Thereupon he composed forty-eight poems beginning with verses on their first meeting. The following year, *gengchen*, he met Pure Yang again at Liquan and further received the Dao of the Golden Elixir. He then took up cave-dwelling practice, naming his abode the \"Tomb of the Living Dead.\" Later, he built a hut alongside He Yuchan and Li Lingyang. Initially, Shi Chuhou, Liu Tongwei, and Yan Chuchang successively received the Dao from him. Later, he burned his hut and journeyed east beyond the Pass, arriving at Ninghai Prefecture, where he transmitted the Golden Elixir’s Dao to Dan Yang. He also instructed Qiu Changchun, Tan Changzhen, Sun Bu’er, Wang Yuyang, Liu Changsheng, and Hao Taigu. He then entrusted the five secret scrolls transmitted by Pure Yang entirely to these seven disciples.\n\nHis works *Complete Anthology of the Quanzhen School (Former and Latter Collections)*, *The Concealed Light Collection*, *The Cloudy Peaks Collection*, and *The Ten Transformations of Pear-Division* circulate in the world. He ascended on the twenty-second day of the twelfth month and the fourth day of the first month.\n\n**Perfected Lord Dan Yang**\nSurnamed Ma, named Yu, styled Xuanbao, with the sobriquet Master Dan Yang. Earlier named Congyi, styled Yifu. A native of Ninghai Prefecture. Born in the first year of the Tianhui era (1123 CE) of Emperor Taizong of Jin, corresponding to the fifth year of the Xuanhe era of Emperor Huizong of Song. Born on the twentieth day of the fifth month. His family was wealthy, earning him the epithet \"Ma Half-the-Prefecture.\" He married Lady Sun and fathered three sons: Tingzhen, Tingrui, and Tinggui.\n\nIn the seventh year of the Dading era (1167 CE), *dinghai*, Chongyang arrived, and upon seeing Ma eat a melon starting from the stem, the Master found it strange and inquired. Chongyang replied: *\"Fragrance emerges from within the foul; sweetness arises from the bitter.\"* Ma further asked: *\"What is the Dao called?\"* Chongyang answered: *\"Where the Five Phases do not reach, before father and mother were born.\"* Thereupon Ma invited him home to receive instruction.\n\nIn the *wuzi* year (1168 CE), he entrusted family affairs to his three sons and left home. Chongyang transmitted to him the five secret scrolls of the Golden Elixir received from Pure Yang, along with oral instructions. Ma then shaved his head into three topknots and cultivated the Dao to perfection. Through the *Ten Transformations of Pear-Division*, he endured much hardship. Among those seeking the Dao at the time were Li Dacheng, Zhao Penglai, and Han Qingfu, but only Song Piyun grasped the essence of the Master’s Golden Elixir and thus attained the Dao first.\n\nHis works *The Gold and Jade Collection*, *The Gradual Awakening Collection*, *The Practice and Transformation Collection*, *The Attainment of the Dao Collection*, *The Perfect Completion Collection*, *The Subtle Essence Collection*, and recorded sayings all circulate in the world. Among the Seven Perfected, he was the foremost teacher. Born on the twentieth day of the fifth month, he ascended on the twenty-second day of the twelfth month.\n\n**Perfected Lord Changzhen**\nSurnamed Tan, named Chuduan, styled Tongzheng, with the sobriquet Master Changzhen. A native of Ninghai Prefecture. Initially named Yu, styled Boyu.\n\nBorn on the first day of the third month in the first year of the Jin Taizong reign (13th year of the *guimao* cycle). In middle age, he suffered from wind-bi syndrome and became a disciple of Chongyang. Each morning, Chongyang would pour the leftover water from his ablutions for him to wash his face; after a long time, his illness was cured, and he was then instructed in the Dao. Due to the weight of his past karmic deeds, he once encountered a drunken ruffian who struck him, breaking his teeth and drawing blood, yet he did not reproach him. Danyang, upon hearing of this, said: \"One blow dissolves the karma of many lives.\" Upon attaining the Dao, the final lines of his poem read: *The yang spirit surges forth, returning alone.* He wrote these words and then passed away, with an extraordinary fragrance filling the room for several days. His *Collection of Water and Clouds* circulates in the world. Born on the first day of the third month, he ascended on the first day of the fourth month.\n\n**Perfected Lord Changsheng**\nSurnamed Liu, named Chuxuan, styled Tongmiao, with the sobriquet Master Changsheng. A native of Wuguan Village in Donglai. Born in the seventh year of the Jin Xizong’s Huangtong reign (the seventeenth year of the Song Gaozong’s Shaoxing reign), on the twelfth day of the seventh month. In the ninth year of the Jin Shizong’s Dading reign (the fifth year of the Song Xiaozong’s Qiandao reign), he became a disciple of Chongyang. Upon attaining the Dao, on the sixth day of the second month in the third year of the Song Ningzong’s Jiatai reign (the *guihai* year), he gathered his followers with the sound of a drum, rested his head upon his arm, and passed away. His six literary collections—*Immortal Music*, *Great Void*, *Pan Yang*, *With the Dust*, *Peace and Leisure*, and *Cultivating the True*—along with his *Commentary on the Dao and Its Virtue*, *Exposition of the Yin Talisman*, and *Explanation of the Yellow Court* remain in the world. Born on the twelfth day of the seventh month, he ascended on the sixth day of the second month.\n\n**Perfected Lord Changchun**\nSurnamed Qiu, named Chuji, styled Tongmi, with the sobriquet Master Changchun. A native of Bindu in Qixia County, Dengzhou. Born on the nineteenth day of the first month in the eighth year of the Jin Xizong’s Huangtong reign (the eighteenth year of the Song Gaozong’s Shaoxing reign). At the age of twenty, he became a disciple of Chongyang. At twenty-seven, he entered Panhan, where he dwelled in a cave to cultivate the Dao.\n\nAt thirty-three, he returned to dwell in Mount Longmen of Longzhou, enduring austerities as he had at Pan Brook. After attaining the Dao, at forty-two he answered the summons of Jin Shizong to reside at court. At sixty-two, when Qi and Lu fell to the Song, Emperor Ningzong summoned him, but he did not go. At sixty-five, he was received by Emperor Chengjis, as detailed in the *Record of Auspicious Assembly* and his memorial responses. For his deeds in averting disasters and relieving droughts, he became a meritorious minister of the Yuan dynasty. His *Pan Brook* and *Crying the Dao* collections, along with the *Record of the Western Journey*, remain in the world. In the dinghai year, on the ninth day of the seventh month, the Master ascended the hall to address the assembly, leaving behind a gatha on the matter of life and death before sitting in transformation. Born on the nineteenth day of the first month, he ascended on the ninth day of the seventh month.\n\n**Perfected Lord Yuyang**\nSurnamed Wang, named Chuyi, styled Yuyang, with the sobriquet Master Sanyang. A native of Dongmou in Ninghai. Born on the eighteenth day of the third month in the second year of the Jin Huangtong reign (renxu). He received the Dao from Chongyang and dwelled in Yun’guang Cave, where his resolve and conduct were firm and austere. After attaining the Dao, he displayed great numinous wonders: converting people, expelling demons, toppling bandits, shattering stones, projecting his spirit in dreams, summoning rain, shaking peaks, boiling chickens to summon cranes, reviving the dead, and restoring the withered. Jin Shizong, hearing his name, summoned him for an audience and was greatly pleased. Envious rivals poisoned him with aconite, but the Master entered water, which receded, and he did not die. His *Yunguang Collection* and *Record of Manifest Wonders* remain in the world. Born on the eighteenth day of the third month, he ascended on the twenty-second day of the fourth month.\n\n**Perfected Lord Guangning**\nSurnamed Hao, named Datong, styled Taigu, with the sobriquet Master Guangning. A native of Ninghai. Born on the third day of the first month in the third year of the Jin Xizong’s Tianchun reign (gengshen). A man of great wealth, he became a disciple of Chongyang.\n\nInitially named Lin, with the sobriquet Master Tranquil. Though he entered the Dao, his resolve was not one of austere discipline, until Changzhen and Yuyang urged and inspired him. At Mount Qi, he encountered a divine person who [bestowed upon him] the oral instructions of the Golden Elixir and changed his name and sobriquet to those he bears now. He then wandered through Zhao and Wei, cultivating the Dao until his practice was perfected, whereupon he left behind his verses and departed. His *Collection of Taigu*, *Heart Sutra*, *Sutra of Salvation from Suffering*, *Diagrams of the Great Transformation of the Yi*, and *Direct Teachings in Plain Words* circulate in the world. Born on the third day of the first month, he ascended on the thirtieth day of the twelfth month.\n\n**Perfected Lady of Pristine Serenity**\nSurnamed Sun, named Bu’er, with the sobriquet Lady of Pristine Serenity. A native of Ninghai. Born on the fifth day of the first month in the first year of the Song Huizong’s Xuanhe reign (jihai). Her father, Sun Zhongxian, arranged her marriage to Ma Yifu of the prefecture, with whom she had three sons. Chongyang, through the division of ten pears, transformed the couple, whereupon the Immortal Maiden left her home to study the Dao. She dwelled in Phoenix Immortal Grotto in Luoyang to cultivate her practice. The couple often urged one another on, and both attained the Dao. Her poems and lyrics circulate in the world.\n\nBorn on the fifth day of the first month, he ascended on the twenty-ninth day of the twelfth month.\n\n**Perfected Lord of the Yellow Chamber**\nSurnamed Song, named Youdao, styled Defang, with the sobriquet Lord of the Yellow Chamber. A native of Mianyang Prefecture. Proficient in all ritual methods, he could summon clouds with talismans when none were present, or part the clouds to reveal the Dipper when they obscured the sky—hence his contemporary title, Perfected One Who Parts the Clouds. One day, he encountered [Wang] Danyang, who transmitted to him the secret formulas of the Golden Elixir’s fire phases. After two years of practice, he attained the ability to duplicate his body without dying. Later, he journeyed to the Eastern Sea, where, during the time when Chinggis Khan of the Great Yuan summoned Master Qiu of Changchun, he served as the foremost among the eighteen who assisted in the journey. Emperor Shizu bestowed upon him the title Perfected One Who Propagates the Dao and Parts the Clouds to Vastly Teach, and Emperor Wuzong further honored him as Perfected One of Mystic Penetration, Supreme Dao, Venerable Culture, and Illuminating Transformation. Later, he transmitted the Supreme Dao to Perfected Lord Li of Great Emptiness, and the Lord of the Yellow Chamber vanished without a trace. Some say he passed away in a seated posture at Changchun [Palace] in Yan.\n\n**Perfected Lord of Great Emptiness**\nSurnamed Li, named Jue, styled Shuangyu. A native of Chongqing Prefecture in Shu. Having received the Golden Elixir’s Dao from the Lord of the Yellow Chamber, he changed his name to Qizhen and adopted the sobriquet Great Emptiness. He then retreated to the Wuyi Mountains in Shaowu to cultivate the Golden Elixir in seclusion. After seven months, with his attainment nearly complete, he began his return journey, passing through Longhu. The previous evening, someone at the Yu Altar dreamed of a perfected one’s arrival, though the region had long suffered drought and prayers had gone unanswered. The next day, the Perfected Lord indeed arrived, but none recognized him—only the dreamer saw a poor Daoist and declared, “This is the one.” The crowd begged for rain, and a timely downpour followed. He then traveled to Yuzhen Hermitage in Zhenzhou, where he sat in a walled garden. Later, he emerged and transmitted the Dao to Zhang Ziqiong, charging him: “The Golden Elixir should be cultivated in seclusion; the Great Dao ought to be passed to others.” Thereafter, he entered Mount Qingcheng and vanished without a trace. Born on the tenth day of the first month, he attained the Dao on the fifteenth day of the eighth month.\n\n**Perfected Lord Ziqiong**\nSurnamed Zhang, named Mo, styled Junfan. A native of Dexing in Raozhou. Upon hearing the Dao, he changed his name to Daoxin. Initially, Perfected Lord of Great Emptiness happened to lodge at Xichun Palace in Anren, where Ziqiong sought the transmission of the Golden Elixir, but Great Emptiness refused. Later, while at the market, he saw Ziqiong give thirty coins to a beggar and declared, “Now it may be transmitted.” Thereupon, he imparted the Dao of the Golden Elixir to him. The following year, they met again in Zhenzhou, where the full fire phases were completed. After grasping the essentials, Ziqiong later transmitted the Supreme Dao to Master Yuan Du of Zhao and then withdrew into seclusion. Born on the second day of the tenth month, he attained the Dao on the twenty-fifth day of the twelfth month.\n\n**Perfected Lord Yuan Du**\nSurnamed Zhao, named Youqin, styled Yuan Du. A native of Rao Commandery. As a descendant of the Zhao clan, he lost his family in a fire in his youth and early developed a fondness for the mountains and forests. Exceptionally intelligent, he mastered astronomy, geography, and the arts of divination. Upon receiving the Great Dao of the Golden Elixir from Master Ziqiong, he combed through the classics and scriptures, composing the treatise *Three Teachings as One Family*, which he titled *Dao and Buddha Share a Common Source*. He also authored *Questions on the Golden Elixir* and other works that circulated in the world. In the autumn of the *jisi* year, while residing in Hengyang, he transmitted the wondrous Dao of the Golden Elixir in its entirety to Shangyangzi. Born on the eighteenth day of the sixth month.\n\n*Here concludes the *Records of the Essential Golden Elixir and the Lineage of Immortals*.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "上阳子金丹大要列仙志 经名：上阳子金丹大要列仙志。 元陈致虚撰。 原系《金丹大要》之附录，后分出别为一卷。 底本出处：《正统道藏》太玄部。 上阳子金丹大要列仙志 东华帝君 姓王，不知其世代名号，或云名玄甫。 得老子之道，后隐昆仑山，复居五台山紫府洞天，自称少阳君。 於终南山凝阳洞，以道授锺离正阳。 六月十五日生，十月十六日上升。 正阳帝君 姓锺离，名权，字云房，号正阳子。 京兆咸阳人。 仕汉为将军，因兵失利，入终南山，遇少阳君，授以至道。 隐晋州羊角山。 道成，天〔帝〕封号太极左宫真人。 乃束双星，衣槲叶，自称天下都散汉。 有诗行世。 后於澧水以道授纯阳。 四月十五日生，五月十八日上升。 纯阳帝君 姓吕，名岩，字洞宾，号纯阳子。 祖居西京河南府满柘县永乐镇招贤里，今曰蒲州坂县。 生於天宝十四年乙未四月十四日巳时，一云生唐德宗贞元丙子。 从父海州刺史，因家焉。 以科举授江州德化令。",
      "translated_text": "**The Record of Immortals from the *Essential Teachings on the Golden Elixir* by Master Shangyang**\n\n**Title:** *The Record of Immortals from the Essential Teachings on the Golden Elixir by Master Shangyang*\nCompiled by Chen Zhixu of the Yuan dynasty. Originally an appendix to the *Essential Teachings on the Golden Elixir*, later separated into an independent volume.\nSource text: *Daoist Canon of the Zhengtong Era*, Tai Xuan Section.\n\n---\n\n### **The Record of Immortals from the *Essential Teachings on the Golden Elixir* by Master Shangyang**\n\n**The Lord Emperor of Donghua**\nSurnamed Wang, his generation and given name are unknown; some say his name was Xuanfu. He attained the Dao of Laozi, later concealing himself on Kunlun Mountain, then dwelling in the Purple Palace Grotto-Heaven of Wutai Mountain, styling himself the Lord of Lesser Yang. In the Niyang Grotto of Zhongnan Mountain, he transmitted the Dao to Zhongli Quanzhen. Born on the fifteenth day of the sixth month, he ascended on the sixteenth day of the tenth month.\n\n**The Lord Emperor of Zhengyang**\nSurnamed Zhongli, named Quan, styled Yunfang, with the sobriquet Master Zhengyang. A native of Xianyang in Jingzhao. Served as a general under the Han, but due to military setbacks, he entered Zhongnan Mountain, where he encountered the Lord of Lesser Yang and received the Supreme Dao. He concealed himself on Yangjiao Mountain in Jinzhou. Upon achieving the Dao, the Heavenly Emperor bestowed upon him the title *True Person of the Left Palace of the Great Ultimate*. He bound his hair with twin stars, wore oak leaves, and called himself the *Unfettered Wanderer of the World*. His poems circulated in the world. Later, by the Li River, he transmitted the Dao to Lü Chunyang. Born on the fifteenth day of the fourth month, he ascended on the eighteenth day of the fifth month.\n\n**The Lord Emperor of Chunyang**\nSurnamed Lü, named Yan, styled Dongbin, with the sobriquet Master Chunyang. His ancestors resided in Zhaoxian Village, Yongle Town, Manzhe County, Xijing Henan Prefecture (present-day Fan County, Puzhou). Born on the fourteenth day of the fourth month at the Hour of Si in the fourteenth year of the Tianbao era (755 CE) of the Tang, though some say he was born in the Bingzi year of the Zhenyuan era under Emperor Dezong. His father served as prefect of Haizhou, and Lü settled there with his family. Through the imperial examinations, he was appointed magistrate of Dehua in Jiangzhou.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 393,
      "start_sentence": 0,
      "end_sentence": 26,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.064907789230347,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\上阳子金丹大要列仙志.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "因纵步庐山，游澧水之上，遇正阳授道，至今在世。 天帝颁诏为九天采访使，五月二十日奉诏诗云，纠司天上神仙籍之句，世就以此日为上升。 有诗词名《浑成集》，行于世。 以道授海蟾、重阳。 四月十四日生，五月二十日上升。 海蟾帝君 姓刘，名操，字宗成，号海蟾子，又改名玄英。 燕山人。 仕辽，登宰相。 因遇纯阳，即辞相印，佯狂远游於秦州。 纯阳授以丹道，乃作诗云：抛离火院三千口，屏去门兵百万家。 后道成，遁迹於终南、太华之间。 以金丹授董凝阳、张紫阳。 十二月十四日生，六月十五日上升。 重阳帝君 姓王，名中孚，字允卿。 又易名世雄，字德威。 后入道，改名哲，字知明，号重阳子。 咸阳大魏村人也。 生宋徽宗政和二年。",
      "translated_text": "Later, wandering through Mount Lu and roaming along the Li River, he encountered Zhengyang, who transmitted the Dao to him, and to this day remains in the world. The Heavenly Emperor issued an edict appointing him as the Nine Heavens’ Inspector of Immortals. On the twentieth day of the fifth month, he composed a poem upon receiving the edict, containing the line: *\"To rectify the celestial registers of divine immortals.\"* The world thereafter took this day as his ascension. His collection of poems and lyrics, *The Complete Works*, circulates in the world. He transmitted the Dao to Hai Chan and Chongyang.\n\nBorn on the fourteenth day of the fourth month, he ascended on the twentieth day of the fifth month.\n\n**The Lord Emperor of Hai Chan**\nSurnamed Liu, named Cao, styled Zongcheng, with the sobriquet Master Hai Chan, later changing his name to Xuanying. A native of Yanshan. He served in the Liao court, rising to the rank of prime minister. Upon encountering Chunyang, he immediately resigned his ministerial seal, feigning madness to wander far in Qinzhou. Chunyang transmitted to him the alchemical Dao, whereupon he composed a poem: *\"I cast aside a fiery household of three thousand souls, / Dismissed the gate guards of a hundred myriad homes.\"* Later, having attained the Dao, he concealed his traces between Mount Zhongnan and Mount Taihua. He transmitted the Golden Elixir to Dong Ningyang and Zhang Ziyang.\n\nBorn on the fourteenth day of the twelfth month, he ascended on the fifteenth day of the sixth month.\n\n**The Lord Emperor of Chongyang**\nSurnamed Wang, named Zhongfu, styled Yunqing. He later changed his name to Shixiong, styled Dewei. After entering the Dao, he altered his name to Zhe, styled Zhiming, with the sobriquet Master Chongyang. A native of Dawei Village, Xianyang. Born in the second year of the Zhenghe era (1112 CE) of Emperor Huizong of the Song.",
      "overlap_context": "rs resided in Zhaoxian Village, Yongle Town, Manzhe County, Xijing Henan Prefecture (present-day Fan County, Puzhou). Born on the fourteenth day of the fourth month at the Hour of Si in the fourteenth year of the Tianbao era (755 CE) of the Tang, though some say he was born in the Bingzi year of the Zhenyuan era under Emperor Dezong. His father served as prefect of Haizhou, and Lü settled there with his family. Through the imperial examinations, he was appointed magistrate of Dehua in Jiangzhou.",
      "start_char": 393,
      "end_char": 690,
      "start_sentence": 27,
      "end_sentence": 46,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.97331953048706,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\上阳子金丹大要列仙志.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "壬辰十二月二十二日，於终南县甘河镇，遇纯阳授口诀，有诗四十八上始遭逢之句。 明年庚辰，醴泉再遇，复得金丹之道。 乃作穴居修行，名活死人墓。 又与和玉蟾、李灵阳结庵而坐。 初，有史处厚、刘通微、严处常，相继受道。 后焚其庵，东出关，抵宁海州，以金丹之道授与丹阳。 又授丘长春、谭长真、孙不二、王玉阳、刘长生、郝太古。 乃以纯阳所授秘诀五篇，尽付七人。 有《全真前后集》、《韬光集》、《云中集》、《分梨十化说》行于世。 十二月二十二日，正月初四日上升。 丹阳真君 姓马，名钰，字玄宝，号丹阳子。 先名从义，字宜甫。 宁海州人。 生金太宗天会元年癸卯，即宋徽宗宣和五年也。 五月二十日生。 家富，号马半州。 娶孙氏，生三子，曰庭珍、庭瑞、庭珪。 大定七年丁亥，重阳至，因食瓜从蒂起，师怪而询之。 重阳曰：香从臭内出，甜向苦中来。 复叩云：何名道？ 重阳曰：五行不到处，父母未生前。 乃请归家，师之。 戊子岁，以家事付三子而出家。 重阳以所得纯阳金丹秘诀五篇授之，并口指其诀。 遂顶三髦，而修行成道。 因分梨十化，多受辛苦。 时求道者，有李大乘、赵蓬莱、韩清甫等，唯宋披云得师金丹之旨，乃先成道。 有《金玉集》、《渐悟集》、《行化集》、《成道集》、《圆成集》、《精微集》及语录，一皆行于世。 七真之内，皆多师也。 五月二十日生，十二月二十二日上升。 长真真君 姓谭，名处端，字通正，号长真子。 宁海州人。 初名玉，字伯玉。",
      "translated_text": "On the twenty-second day of the twelfth month in the *renchen* year, at Ganhe Town in Zhongnan County, he encountered Pure Yang, who transmitted oral instructions to him. Thereupon he composed forty-eight poems beginning with verses on their first meeting. The following year, *gengchen*, he met Pure Yang again at Liquan and further received the Dao of the Golden Elixir. He then took up cave-dwelling practice, naming his abode the \"Tomb of the Living Dead.\" Later, he built a hut alongside He Yuchan and Li Lingyang. Initially, Shi Chuhou, Liu Tongwei, and Yan Chuchang successively received the Dao from him. Later, he burned his hut and journeyed east beyond the Pass, arriving at Ninghai Prefecture, where he transmitted the Golden Elixir’s Dao to Dan Yang. He also instructed Qiu Changchun, Tan Changzhen, Sun Bu’er, Wang Yuyang, Liu Changsheng, and Hao Taigu. He then entrusted the five secret scrolls transmitted by Pure Yang entirely to these seven disciples.\n\nHis works *Complete Anthology of the Quanzhen School (Former and Latter Collections)*, *The Concealed Light Collection*, *The Cloudy Peaks Collection*, and *The Ten Transformations of Pear-Division* circulate in the world. He ascended on the twenty-second day of the twelfth month and the fourth day of the first month.\n\n**Perfected Lord Dan Yang**\nSurnamed Ma, named Yu, styled Xuanbao, with the sobriquet Master Dan Yang. Earlier named Congyi, styled Yifu. A native of Ninghai Prefecture. Born in the first year of the Tianhui era (1123 CE) of Emperor Taizong of Jin, corresponding to the fifth year of the Xuanhe era of Emperor Huizong of Song. Born on the twentieth day of the fifth month. His family was wealthy, earning him the epithet \"Ma Half-the-Prefecture.\" He married Lady Sun and fathered three sons: Tingzhen, Tingrui, and Tinggui.\n\nIn the seventh year of the Dading era (1167 CE), *dinghai*, Chongyang arrived, and upon seeing Ma eat a melon starting from the stem, the Master found it strange and inquired. Chongyang replied: *\"Fragrance emerges from within the foul; sweetness arises from the bitter.\"* Ma further asked: *\"What is the Dao called?\"* Chongyang answered: *\"Where the Five Phases do not reach, before father and mother were born.\"* Thereupon Ma invited him home to receive instruction.\n\nIn the *wuzi* year (1168 CE), he entrusted family affairs to his three sons and left home. Chongyang transmitted to him the five secret scrolls of the Golden Elixir received from Pure Yang, along with oral instructions. Ma then shaved his head into three topknots and cultivated the Dao to perfection. Through the *Ten Transformations of Pear-Division*, he endured much hardship. Among those seeking the Dao at the time were Li Dacheng, Zhao Penglai, and Han Qingfu, but only Song Piyun grasped the essence of the Master’s Golden Elixir and thus attained the Dao first.\n\nHis works *The Gold and Jade Collection*, *The Gradual Awakening Collection*, *The Practice and Transformation Collection*, *The Attainment of the Dao Collection*, *The Perfect Completion Collection*, *The Subtle Essence Collection*, and recorded sayings all circulate in the world. Among the Seven Perfected, he was the foremost teacher. Born on the twentieth day of the fifth month, he ascended on the twenty-second day of the twelfth month.\n\n**Perfected Lord Changzhen**\nSurnamed Tan, named Chuduan, styled Tongzheng, with the sobriquet Master Changzhen. A native of Ninghai Prefecture. Initially named Yu, styled Boyu.",
      "overlap_context": "r to Dong Ningyang and Zhang Ziyang.\n\nBorn on the fourteenth day of the twelfth month, he ascended on the fifteenth day of the sixth month.\n\n**The Lord Emperor of Chongyang**\nSurnamed Wang, named Zhongfu, styled Yunqing. He later changed his name to Shixiong, styled Dewei. After entering the Dao, he altered his name to Zhe, styled Zhiming, with the sobriquet Master Chongyang. A native of Dawei Village, Xianyang. Born in the second year of the Zhenghe era (1112 CE) of Emperor Huizong of the Song.",
      "start_char": 690,
      "end_char": 1275,
      "start_sentence": 47,
      "end_sentence": 81,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.28848910331726,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\上阳子金丹大要列仙志.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "生金太宗元年癸卯三月初一日。 中年患风痹，师事重阳。 每旦重阳以盥余令以洗面，久而疾愈，乃授以道。 以宿业重，因遇醉徒驱击，折齿流血，师皆不问。 丹阳闻曰：一拳消尽多生业。 道成，有诗后句云：涌出阳神独自归。 书毕而逝，异香满室者数日。 有《水云集》行於世。 三月初一日生，四月初一日上升。 长生真君 姓刘，名处玄，字通妙，号长生子。 东莱武官庄人。 生金熙宗皇统七年丁卯，即宋高宗绍兴十七年也，七月十二日生。 大定九年，即宋孝宗乾道五年，师重阳。 道成，於宋宁宗癸亥嘉泰三年二月初六，呜鼓集众，曲肱而逝。 有《仙乐》、《太虚》、《盘阳》、《同尘》、《安闲》、《修真》文集六，及《 道德注》、《阴符演》、《黄庭述》留世。 七月十二日生，二月初六日上升。 长春真君 姓邱，名处机，字通密，号长春子。 登州栖霞县滨都人。 生金熙宗皇统八年戊辰，即宋高宗绍兴十八年正月十九日生。 二十岁师重阳。 二十七岁乃入磻汉，穴居修行。",
      "translated_text": "Born on the first day of the third month in the first year of the Jin Taizong reign (13th year of the *guimao* cycle). In middle age, he suffered from wind-bi syndrome and became a disciple of Chongyang. Each morning, Chongyang would pour the leftover water from his ablutions for him to wash his face; after a long time, his illness was cured, and he was then instructed in the Dao. Due to the weight of his past karmic deeds, he once encountered a drunken ruffian who struck him, breaking his teeth and drawing blood, yet he did not reproach him. Danyang, upon hearing of this, said: \"One blow dissolves the karma of many lives.\" Upon attaining the Dao, the final lines of his poem read: *The yang spirit surges forth, returning alone.* He wrote these words and then passed away, with an extraordinary fragrance filling the room for several days. His *Collection of Water and Clouds* circulates in the world. Born on the first day of the third month, he ascended on the first day of the fourth month.\n\n**Perfected Lord Changsheng**\nSurnamed Liu, named Chuxuan, styled Tongmiao, with the sobriquet Master Changsheng. A native of Wuguan Village in Donglai. Born in the seventh year of the Jin Xizong’s Huangtong reign (the seventeenth year of the Song Gaozong’s Shaoxing reign), on the twelfth day of the seventh month. In the ninth year of the Jin Shizong’s Dading reign (the fifth year of the Song Xiaozong’s Qiandao reign), he became a disciple of Chongyang. Upon attaining the Dao, on the sixth day of the second month in the third year of the Song Ningzong’s Jiatai reign (the *guihai* year), he gathered his followers with the sound of a drum, rested his head upon his arm, and passed away. His six literary collections—*Immortal Music*, *Great Void*, *Pan Yang*, *With the Dust*, *Peace and Leisure*, and *Cultivating the True*—along with his *Commentary on the Dao and Its Virtue*, *Exposition of the Yin Talisman*, and *Explanation of the Yellow Court* remain in the world. Born on the twelfth day of the seventh month, he ascended on the sixth day of the second month.\n\n**Perfected Lord Changchun**\nSurnamed Qiu, named Chuji, styled Tongmi, with the sobriquet Master Changchun. A native of Bindu in Qixia County, Dengzhou. Born on the nineteenth day of the first month in the eighth year of the Jin Xizong’s Huangtong reign (the eighteenth year of the Song Gaozong’s Shaoxing reign). At the age of twenty, he became a disciple of Chongyang. At twenty-seven, he entered Panhan, where he dwelled in a cave to cultivate the Dao.",
      "overlap_context": ", *The Attainment of the Dao Collection*, *The Perfect Completion Collection*, *The Subtle Essence Collection*, and recorded sayings all circulate in the world. Among the Seven Perfected, he was the foremost teacher. Born on the twentieth day of the fifth month, he ascended on the twenty-second day of the twelfth month.\n\n**Perfected Lord Changzhen**\nSurnamed Tan, named Chuduan, styled Tongzheng, with the sobriquet Master Changzhen. A native of Ninghai Prefecture. Initially named Yu, styled Boyu.",
      "start_char": 1275,
      "end_char": 1674,
      "start_sentence": 82,
      "end_sentence": 104,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.290427207946777,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\上阳子金丹大要列仙志.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "三十三岁复居陇州龙门山，苦行如磻溪时。 道成之后，四十二岁赴金世宗召馆。 六十二岁齐鲁入于宋，宁宗召师，不赴。 六十五岁成吉思皇帝召见，详见《庆会录》 对策。 禳灾救旱等事，为元朝功臣。 有《磻汉》、《呜道》文集二，《西游记》行于世。 丁亥岁七月初九日，师升堂示众，以生死事留颂坐化。 正月十九日生，七月初九日上升。 玉阳真君 姓王，名处一，字玉阳，号伞阳子。 宁海东牟人。 生金皇统二年壬戌三月十八日。 师重阳受道，居云光洞，志行确苦。 道成，大着神异，度人逐鬼，踣盗碎石，出神入梦，召雨撼峰，烹鸡降鹤，起死嘘枯。 金世宗闻其名，召对，大副宸衷。 嫉者饮之鸩，师归入水，水涸而不死。 有《云光集》、《显异录》行于世。 三月十八日生，四月二十二日上升。 广宁真君 姓郝，名大通，字太古，号广宁子。 宁海人。 生金熙宗天春三年庚申正月初三日。 巨富。 师事重阳。",
      "translated_text": "At thirty-three, he returned to dwell in Mount Longmen of Longzhou, enduring austerities as he had at Pan Brook. After attaining the Dao, at forty-two he answered the summons of Jin Shizong to reside at court. At sixty-two, when Qi and Lu fell to the Song, Emperor Ningzong summoned him, but he did not go. At sixty-five, he was received by Emperor Chengjis, as detailed in the *Record of Auspicious Assembly* and his memorial responses. For his deeds in averting disasters and relieving droughts, he became a meritorious minister of the Yuan dynasty. His *Pan Brook* and *Crying the Dao* collections, along with the *Record of the Western Journey*, remain in the world. In the dinghai year, on the ninth day of the seventh month, the Master ascended the hall to address the assembly, leaving behind a gatha on the matter of life and death before sitting in transformation. Born on the nineteenth day of the first month, he ascended on the ninth day of the seventh month.\n\n**Perfected Lord Yuyang**\nSurnamed Wang, named Chuyi, styled Yuyang, with the sobriquet Master Sanyang. A native of Dongmou in Ninghai. Born on the eighteenth day of the third month in the second year of the Jin Huangtong reign (renxu). He received the Dao from Chongyang and dwelled in Yun’guang Cave, where his resolve and conduct were firm and austere. After attaining the Dao, he displayed great numinous wonders: converting people, expelling demons, toppling bandits, shattering stones, projecting his spirit in dreams, summoning rain, shaking peaks, boiling chickens to summon cranes, reviving the dead, and restoring the withered. Jin Shizong, hearing his name, summoned him for an audience and was greatly pleased. Envious rivals poisoned him with aconite, but the Master entered water, which receded, and he did not die. His *Yunguang Collection* and *Record of Manifest Wonders* remain in the world. Born on the eighteenth day of the third month, he ascended on the twenty-second day of the fourth month.\n\n**Perfected Lord Guangning**\nSurnamed Hao, named Datong, styled Taigu, with the sobriquet Master Guangning. A native of Ninghai. Born on the third day of the first month in the third year of the Jin Xizong’s Tianchun reign (gengshen). A man of great wealth, he became a disciple of Chongyang.",
      "overlap_context": "ended on the sixth day of the second month.\n\n**Perfected Lord Changchun**\nSurnamed Qiu, named Chuji, styled Tongmi, with the sobriquet Master Changchun. A native of Bindu in Qixia County, Dengzhou. Born on the nineteenth day of the first month in the eighth year of the Jin Xizong’s Huangtong reign (the eighteenth year of the Song Gaozong’s Shaoxing reign). At the age of twenty, he became a disciple of Chongyang. At twenty-seven, he entered Panhan, where he dwelled in a cave to cultivate the Dao.",
      "start_char": 1674,
      "end_char": 2043,
      "start_sentence": 105,
      "end_sentence": 128,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.659692287445068,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\上阳子金丹大要列仙志.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "初名璘，号恬然子。 虽入道而志不苦励，长真、玉阳劝激之。 至岐山，遇神人〔授〕与金丹口诀，为改今名号。 遂游赵魏间，修行道成，留颂而逝。 有《太古集》、《心经》、《救苦经》、《解大易图》及《示教直言》行世。 正月初三日生，十二月三十日上升。 清静元君 姓孙，名不二，号清静散人。 宁海人也。 生宋徽宗宣一和元年己亥正月初五日。 父孙忠显，俾适州之马宜甫，生三子。 重阳主以分梨十化宜甫夫妇，仙姑出家学道，居洛阳风仙洞修行。 夫妇每自相激励，俱成道。 有诗词行世。",
      "translated_text": "Initially named Lin, with the sobriquet Master Tranquil. Though he entered the Dao, his resolve was not one of austere discipline, until Changzhen and Yuyang urged and inspired him. At Mount Qi, he encountered a divine person who [bestowed upon him] the oral instructions of the Golden Elixir and changed his name and sobriquet to those he bears now. He then wandered through Zhao and Wei, cultivating the Dao until his practice was perfected, whereupon he left behind his verses and departed. His *Collection of Taigu*, *Heart Sutra*, *Sutra of Salvation from Suffering*, *Diagrams of the Great Transformation of the Yi*, and *Direct Teachings in Plain Words* circulate in the world. Born on the third day of the first month, he ascended on the thirtieth day of the twelfth month.\n\n**Perfected Lady of Pristine Serenity**\nSurnamed Sun, named Bu’er, with the sobriquet Lady of Pristine Serenity. A native of Ninghai. Born on the fifth day of the first month in the first year of the Song Huizong’s Xuanhe reign (jihai). Her father, Sun Zhongxian, arranged her marriage to Ma Yifu of the prefecture, with whom she had three sons. Chongyang, through the division of ten pears, transformed the couple, whereupon the Immortal Maiden left her home to study the Dao. She dwelled in Phoenix Immortal Grotto in Luoyang to cultivate her practice. The couple often urged one another on, and both attained the Dao. Her poems and lyrics circulate in the world.",
      "overlap_context": ", and he did not die. His *Yunguang Collection* and *Record of Manifest Wonders* remain in the world. Born on the eighteenth day of the third month, he ascended on the twenty-second day of the fourth month.\n\n**Perfected Lord Guangning**\nSurnamed Hao, named Datong, styled Taigu, with the sobriquet Master Guangning. A native of Ninghai. Born on the third day of the first month in the third year of the Jin Xizong’s Tianchun reign (gengshen). A man of great wealth, he became a disciple of Chongyang.",
      "start_char": 2043,
      "end_char": 2267,
      "start_sentence": 129,
      "end_sentence": 142,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.822065591812134,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\上阳子金丹大要列仙志.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "正月初五日生，十二月二十九日上升。 黄房公 姓宋，名有道，字德方，号黄房公。 沔阳府人氏。 行诸阶法，无云则能以符而与云，有云则能披云而见斗，故时号披云真人。 一日遇丹阳，授以金丹火候秘诀。 行之两年，能贰其身弗死你因进东海，适皇元太祖成吉思皇帝，召长春邱师叔时，公与十八人为之辅行之首。 世祖皇帝封通玄弘教披云真人，武宗皇帝加封玄通至道崇文明化大真人。 后以至道授太虚李真人，而黄房公莫知所终。 或云在燕之长春〔宫〕坐逝。 太虚真人 姓李，名珏，字双玉。 蜀之崇庆府人。 既得黄房公金丹之道，改名栖真，号太虚。 即往邵武之武夷，潜修金丹。 七阅月而道将成，乃回途，道经龙虎。 先夕，雩坛有梦真人至者，时久旱析祷弗应。 次日真人果至，众皆弗知，唯梦者见一贫道人来，曰：是此人也。 众请祈雨，应时雾霈。 而去至真州玉虚庵，结园而坐。 后出圆，以道授张紫琼既，嘱曰：金丹宜潜修，大道当授人。 后云入青城，莫知所终。 正月初十日生，八月十五日成道。 紫琼真人 姓张，名模，字君范。 饶州德兴人也。 后闻道，改名道心。 初，太虚真人偶寓安仁熙春宫，紫琼求授金丹，太虚弗与。 继而适市，因见施丐钱三十文，乃曰可授已。 遂以金丹之道付之。 次年复会真州，始全火侯。 紫琼既闻真要，后以至道授于缘督赵公，乃即隐去。 十月初二日生，十二月二十五日成道。 缘督真人 姓赵，讳友钦，字缘督。 饶郡人也。 为赵宗子，幼遭劫火，蚤有山林之趣。 极聪敏，天文经纬、地理术数，莫不精通。 及得紫琼师授以金丹大道，乃搜群书经传，作三教一家之文，名之曰《仙佛同源》。 又作《金丹难问》等书行於世。 己巳之秋，寓衡阳，以金丹妙道悉付上阳子。 六月十八日生。 上阳子金丹大要列仙志竟",
      "translated_text": "Born on the fifth day of the first month, he ascended on the twenty-ninth day of the twelfth month.\n\n**Perfected Lord of the Yellow Chamber**\nSurnamed Song, named Youdao, styled Defang, with the sobriquet Lord of the Yellow Chamber. A native of Mianyang Prefecture. Proficient in all ritual methods, he could summon clouds with talismans when none were present, or part the clouds to reveal the Dipper when they obscured the sky—hence his contemporary title, Perfected One Who Parts the Clouds. One day, he encountered [Wang] Danyang, who transmitted to him the secret formulas of the Golden Elixir’s fire phases. After two years of practice, he attained the ability to duplicate his body without dying. Later, he journeyed to the Eastern Sea, where, during the time when Chinggis Khan of the Great Yuan summoned Master Qiu of Changchun, he served as the foremost among the eighteen who assisted in the journey. Emperor Shizu bestowed upon him the title Perfected One Who Propagates the Dao and Parts the Clouds to Vastly Teach, and Emperor Wuzong further honored him as Perfected One of Mystic Penetration, Supreme Dao, Venerable Culture, and Illuminating Transformation. Later, he transmitted the Supreme Dao to Perfected Lord Li of Great Emptiness, and the Lord of the Yellow Chamber vanished without a trace. Some say he passed away in a seated posture at Changchun [Palace] in Yan.\n\n**Perfected Lord of Great Emptiness**\nSurnamed Li, named Jue, styled Shuangyu. A native of Chongqing Prefecture in Shu. Having received the Golden Elixir’s Dao from the Lord of the Yellow Chamber, he changed his name to Qizhen and adopted the sobriquet Great Emptiness. He then retreated to the Wuyi Mountains in Shaowu to cultivate the Golden Elixir in seclusion. After seven months, with his attainment nearly complete, he began his return journey, passing through Longhu. The previous evening, someone at the Yu Altar dreamed of a perfected one’s arrival, though the region had long suffered drought and prayers had gone unanswered. The next day, the Perfected Lord indeed arrived, but none recognized him—only the dreamer saw a poor Daoist and declared, “This is the one.” The crowd begged for rain, and a timely downpour followed. He then traveled to Yuzhen Hermitage in Zhenzhou, where he sat in a walled garden. Later, he emerged and transmitted the Dao to Zhang Ziqiong, charging him: “The Golden Elixir should be cultivated in seclusion; the Great Dao ought to be passed to others.” Thereafter, he entered Mount Qingcheng and vanished without a trace. Born on the tenth day of the first month, he attained the Dao on the fifteenth day of the eighth month.\n\n**Perfected Lord Ziqiong**\nSurnamed Zhang, named Mo, styled Junfan. A native of Dexing in Raozhou. Upon hearing the Dao, he changed his name to Daoxin. Initially, Perfected Lord of Great Emptiness happened to lodge at Xichun Palace in Anren, where Ziqiong sought the transmission of the Golden Elixir, but Great Emptiness refused. Later, while at the market, he saw Ziqiong give thirty coins to a beggar and declared, “Now it may be transmitted.” Thereupon, he imparted the Dao of the Golden Elixir to him. The following year, they met again in Zhenzhou, where the full fire phases were completed. After grasping the essentials, Ziqiong later transmitted the Supreme Dao to Master Yuan Du of Zhao and then withdrew into seclusion. Born on the second day of the tenth month, he attained the Dao on the twenty-fifth day of the twelfth month.\n\n**Perfected Lord Yuan Du**\nSurnamed Zhao, named Youqin, styled Yuan Du. A native of Rao Commandery. As a descendant of the Zhao clan, he lost his family in a fire in his youth and early developed a fondness for the mountains and forests. Exceptionally intelligent, he mastered astronomy, geography, and the arts of divination. Upon receiving the Great Dao of the Golden Elixir from Master Ziqiong, he combed through the classics and scriptures, composing the treatise *Three Teachings as One Family*, which he titled *Dao and Buddha Share a Common Source*. He also authored *Questions on the Golden Elixir* and other works that circulated in the world. In the autumn of the *jisi* year, while residing in Hengyang, he transmitted the wondrous Dao of the Golden Elixir in its entirety to Shangyangzi. Born on the eighteenth day of the sixth month.\n\n*Here concludes the *Records of the Essential Golden Elixir and the Lineage of Immortals*.*",
      "overlap_context": "rst month in the first year of the Song Huizong’s Xuanhe reign (jihai). Her father, Sun Zhongxian, arranged her marriage to Ma Yifu of the prefecture, with whom she had three sons. Chongyang, through the division of ten pears, transformed the couple, whereupon the Immortal Maiden left her home to study the Dao. She dwelled in Phoenix Immortal Grotto in Luoyang to cultivate her practice. The couple often urged one another on, and both attained the Dao. Her poems and lyrics circulate in the world.",
      "start_char": 2267,
      "end_char": 2976,
      "start_sentence": 143,
      "end_sentence": 185,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.583367586135864,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\上阳子金丹大要列仙志.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}