{
  "source_id": "丹论诀旨心鉴",
  "source_file": "chunked_daozang\\丹论诀旨心鉴.json",
  "total_chunks": 7,
  "total_original_chars": 5682,
  "total_translated_chars": 33233,
  "total_translation_time": 171.8216416835785,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\丹论诀旨心鉴.txt",
    "category": "众术类"
  },
  "full_translation": "**The *Danlun Juezhi Xinjian* (Mirror of the Essentials of Alchemical Discourse)**\n\n**Scripture Title:** *Danlun Juezhi Xinjian* (*Mirror of the Essentials of Alchemical Discourse*). One scroll. Originally attributed to Zhang Yuande, likely composed in the late Tang or Five Dynasties period. Base text from the *Zhengtong Daoist Canon*, under the *Dongshen* section, category of *Miscellaneous Arts*.\n\n---\n\n### **Preface and Essential Formulas (Chapter One)**\n\nThe *Cantong Qi* states: \"The arts are vast and numerous, numbering in the thousands.\" Yet the marvel of the Great Elixir lies solely in the two substances—lead and mercury—as the supreme medicines, not in the four yellows or eight minerals. If the qi of mineral drugs enters these two, it becomes highly toxic, and all who consume it perish.\n\nMercury, though naturally occurring in humans, requires the qi of yin and yang, refined through water and fire, to form the Great Elixir. Ingesting it grants longevity. But if one uses alum, sulfur, or cinnabar—calcined and sublimated into medicine—it becomes highly toxic, gradually harming the body. Such substances may dissolve copper and corrode iron, yet how could they be fit for consumption? Even alum alone can slay tigers—a dire warning indeed.\n\nGenerally, those who learn even a minor alchemical method claim few in the world possess such knowledge. If they administer the elixir to others, sudden and unnatural deaths may occur, a tragedy most lamentable! Thereafter, skeptics arise, decrying that \"mineral elixirs provoke sores, ulcers, and swellings.\" Such misguided individuals slander the efficacy of the Golden Elixir, declaring it unfit for consumption.\n\nAs for stalactites and the like, it is best not to ingest them. One must not indulge in sensual pleasures and force their consumption, for such recklessness has led to countless premature deaths. One should carefully examine purgative medicines, employing them to induce elimination. Consuming *fangji* (stephania root), mallow, and licorice decoctions will gradually expel toxins, allowing the Great Medicine to be safely ingested.\n\nThe Great Elixir is the primordial, authentic qi of Heaven and Earth, the sustenance of the Supreme Sovereign and the host of immortals. It encompasses the Four Symbols to take form, relying on Qian and Kun to transform itself. When condensed into crimson and violet hues, it becomes the Elixir—known as *Zhengyang* (True Yang), *Zhuanyang* (Exclusive Yang), and *Yuanyang* (Primordial Yang)—the One-Return Elixir. How could such a process be easily grasped?\n\nDevoted Daoist adepts must carefully preserve this knowledge, transmitting it only to the worthy, that the Way may not perish.\n\nHeaven’s generative transformations align with the Three Powers, following the *Yijing*’s symbolic hexagrams and the cyclical rhythms of yin and yang. The Great Elixir is achieved through the grand completion of a year, the measured movements of the sun and moon. Thus it is attainable, and the ancient immortals all ascended by this means.\n\nLongevity and eternal vision—when the common folk hear of this, they clap their hands in mocking laughter. But the wise, upon hearing it once, comprehend and align with the true origin. Fearing my own inadequacy, I cite the *Song of the Three Sages* as proof and clarify it through the *Discourse on the Golden Elixir*, sparing further redundant explanations.\n\nThe Return Elixir is refined by the revolutions of the sun and moon, returning to its original essence and reverting to the color of cinnabar. Thus it is called the *Return Elixir*.\n\nThere are three grades of elixirs:\n1. *Zhengyang Dan* (True Yang Elixir), the Upper Return;\n2. *Zhuanyang Dan* (Exclusive Yang Elixir), the Middle Return;\n3. *Yuanyang Dan* (Primordial Yang Elixir).\n\nThough three in name, they are one in essence, all belonging to the lineage of the Great Return. Without knowing this mystery, one cannot speak of the methods for cultivating the Elixir.\n\nFurthermore, merely boiling cinnabar in brine to subdue mercury alone is insufficient. Why? Because it is solitary yin without yang, gradually harming the body and failing to attain the position of True Yang. Some use *cengci* (a mineral preparation) to kill mercury and combine male and female forms, yet this is also unfit for consumption. Such methods are passed down through mutual transmission, but they are not the true, sagely medicines. Why? Because all eight minerals are toxic.\n\nThe *Jinbi Jing* states: \"Discard the five alums and do not use the eight minerals.\" The formula declares: \"Do not use medicines; use the Five Phases.\" This is the ultimate principle!\n\n---\n\n### **On Clarifying Distinctions (Chapter Two)**\n\nThree *liang* of sulfur can control one *jin* of mercury, proving mercury’s power is inferior to sulfur’s. The strength of one *liang* of mercury is like that of an ox; thus, one *liang* of sulfur can control five *liang* of mercury, again showing mercury’s weakness before sulfur.\n\nBy this logic, the Great Elixir does not use sulfur but true lead. Five *liang* of true lead can control two *jin* of mercury, demonstrating mercury’s inferiority to true lead. Thus, yin is subdued by yang, not the reverse—this is the true principle.\n\nThe supreme Way seeks longevity and the cultivation of the true mind. Without the Great Elixir, one cannot attain the Dao. If one suddenly encounters this formula, it is only through the accumulation of great merit that such secret texts are revealed. If transmitted to the unworthy, seven generations of ancestors will suffer calamity, and descendants will be harmed.\n\nIn refining the Great Elixir, the key does not lie in the flavors of the medicines but in the precise mastery of the Five Phases, the clarity of *Yijing* symbolism, the discernment of seasonal transitions, the knowledge of the sun and moon’s movements, and the interplay of yin and yang. These are the essentials of immortality and the foundation of the Dao. One must not trust the eight minerals or four yellows, for they are not the wondrous medicines of longevity.\n\nLead and mercury are the root of the Great Elixir, the origin of the Five Phases, and the sovereign of the eight minerals. Gold’s nature is cold, residing in yang—it is the single yang within Kan. Mercury is born within cinnabar. Stone’s nature is hot, residing in yin—it is the double yin within Li. The gold within lead is true lead.\n\nThus, yin and yang unite. Yang is the ruler, yin the minister—the principle of stone floating and metal sinking is evident. When ruler and minister harmonize, floating and sinking attain balance, and the medicines combine. This is the wondrous essence of immortality.\n\nWithout knowing the ruler and minister, or distinguishing their true natures, one may waste a thousand gold pieces and still fail to attain the Dao. Only by understanding the ruler and minister, aligning with the essentials of Qian and Kun, will the art of the Great Elixir become clear.\n\nMoreover, lead serves as the ruler, guiding the five viscera; mercury serves as the minister, slaying the Three Thieves, communicating with the divine, and illuminating the Four Seas. Thus, the *Xuanren Jue* states: \"Use lead without using lead, for the five metals are born within lead.\"\n\n\"Use lead without using lead, for the five metals emerge from within lead.\" This is the most profound of sayings. The wise examine and understand it, then know the Dao may be accomplished.\n\n\"Use lead without using lead\"—lead is the essence of the five metals, the fine catalyst of the seven treasures. Now, the Great Elixir is coeval with heaven and earth, yet the five metals are strictly forbidden in lead. With what, then, shall they be refined?\n\nThe *Song of the Five Metals* states: \"Take Yellow Sprout as the root.\" What is Yellow Sprout? And what vessel should be used? Yellow Sprout is not lead, yet it is not apart from lead.\n\nHu Gangzi asked: \"With what is it made?\" And again: \"If not the five metals and eight stones, what gives rise to it?\"\n\nMaster Wei answered: \"To sow grain, one must use millet. Without like kind, nothing can be achieved. If one uses the five metals and eight stones, it is like a fox or hare giving birth to a horse, or a sparrow hatching a phoenix—what difference is there from mending a cauldron with glue or treating illness with wild aconite? Different kinds do not share the same nature; how can they unite as one body? To transmute metal, one must use metal; to refine silver, one must use silver. Only when Yellow Sprout is obtained within lead does one know this Dao as intimate.\n\nIf the lead is true, it does not lose its minister; if the lead is not true, its mercury will not be intimate. The White Tiger serves as the brain, Yellow Sprout as the root, the Green-Waisted Messenger, and the Red-Blooded General—this is cinnabar within blue-green mercury, not the use of azurite.\n\nIf one attains this art, guard it well. Should it be leaked, one’s lifespan will be cut short, and calamity will befall one’s descendants.\" The *Yin Fu Jing* states: \"The master says: Do not share it with those who walk a different path. Keep it secret, lest misfortune be invited.\"\n\nThose who aspire to the Dao, moved by utmost sincerity, may comprehend its meaning and know the Great Dao is difficult to seek, rarely grasped by the world. The world’s people are foolish and deluded, blind to its principles. Though they pore over alchemical texts, none succeed. Why? First, they have not met a true master; second, they rely on vague imaginings and proceed on their own—many are of this sort.\n\nI once saw Sima Xiyi on Mount Song refining the Great Elixir. Delighted, I sought him out and asked, but the firing had already lasted five months. When I questioned him, he remained secretive. How could I clarify this Dao? I feared this man’s emptiness would waste days, and after long observation, saw no success.\n\nHe claimed: \"The Great Dao has three aspects, two internal and one external to observe.\" Thus, he used realgar within lead and mercury. This was not the wondrous subtlety of the Great Medicine, merely chasing shadows and following texts on his own.\n\nI also saw Master Li Zixu add sulfur to the two ingredients, likewise claiming one aspect was internal to observe. Neither of these two had the correct understanding; their transmissions were flawed.\n\nI pitied and lamented them: their natures were impure, their edges unrefined, and they strayed from the path, isolating themselves, ultimately gaining no longevity. That \"one internal to observe\" refers to the Wuji crucible. These men did not comprehend it, yet proceeded in vain, their hair turning white in futility. Had they not met me, it would not have been my fault—it was simply that their Dao did not align.\n\nThe *Song of the Five Metals* states: \"It is not that the medicine lacks sanctity, but that the medicine may not be correct. Do not fear the medicine lacks numinosity, but that the medicine may not be true.\"\n\nIf the wise comprehend this principle, they are true, spiritually attuned immortals. What worry is there that the Dragon-Tiger Great Elixir will not be achieved? Truly, one may hold the sun and moon in hand, and creation follows the heart—this is no empty saying.\n\nAs for the Elixir, the *True Writ of Dragon and Tiger* states: \"The Tiger is true lead; the Dragon is true mercury. Reverse lead to become Yellow Sprout; reverse mercury to become true mercury. True lead does not wither; true mercury does not fly.\" This is not the mercury of the mundane world, having transcended all worldly dust.\n\nThe *Song of Ma Ziran* says:\n\"Mercury lives, cinnabar dies;\nLead, through the numinous sprout, is.\nEmerging as the Returned Elixir,\nThe deluded cannot grasp it.\nMercury and cinnabar differ—\nThe deluded use them clumsily.\nIf one understands this true source,\nOne may transcend the vulgar world.\"\n\nLater scholars, if they do not meet a true master, will not receive the transmission!\n\nThe oral formula states: Take eight ounces of lead as yang, as Qian, as the Tiger; and eight ounces of mercury as yin, as Kun, as the Green Dragon. These two substances are capable of transformation.\n\nLead is also yin, originally black—water is one yin. Yet it contains one yang line. Mercury is wood, three; cinnabar is fire, two. Fire contains yin. Thus, the medicine inherently possesses yin and yang, mutually restraining and subduing, becoming the supreme medicine. These two numinous substances are the true images of heaven and earth’s yin and yang. How could the eight stones and four yellows serve as the Elixir?\n\nThe wise should consider this carefully. This is the true mother of all ancient immortals and transcendents. Thus, Qian and Kun, firm and yielding, unite Dragon and Tiger. Eight ounces belong to Qian, eight ounces to Kun. One ounce has four parts, each part six *zhu*. One part corresponds to one hexagram, one ounce to four hexagrams, and eight ounces to thirty-two hexagrams. Qian’s eight ounces correspond to thirty-two hexagrams, as do Kun’s eight ounces, together forming sixty-four hexagrams—the root of the Dao.\n\nTwo eights make one *jin*, corresponding to sixty-four hexagrams. There are three hundred eighty-four *zhu*, symbolizing a year’s three hundred sixty days. The ancient immortals observed the *Yi*’s images, uniting Qian and Kun, aligning with the solar terms. A year’s great cycle completes the celestial revolution. How could the four yellows and eight stones correspond to Qian’s image?\n\nThe oral formula states: \"Yellow Sprout one, mercury two, wood three, fire two, water one, metal four, earth five—modeling heaven and earth.\" Herein lies the principle: neither solitary yin nor solitary yang will suffice.\n\nAnother formula states: \"White metal as ruler is the essence of black metal, the position of the west, the essence of the great yang.\" The *Jinbi Jing* says: \"Refine silver from lead, and numinous substances arise of themselves. In the ash pool’s blazing heat, lead sinks and silver floats.\"\n\n\"When purity reveals the treasure, the Yellow Sprout may be wrought. It is also cryptically called *Yellow Light*, or *Yellow Sprout*, or *Autumn Stone*. Autumn is the position of the west, and *Stone* is the name of the trigram *Dui*; its nature is yin, yet within yin lies yang—this is the supreme medicinal sprout of long life, the origin of the ten thousand things, hence called *sprout*. When green, through the action of fire, turns white and then yellow, it is named *Yellow Sprout*. The Prince of Huainan called it *Autumn Stone*; Wang Yang obtained it and named it *Yellow Sprout*; the Perfected One Mu Gu called it *Returned Elixir*.\n\nFrom *The Essence of the Supreme Elixir’s Discourse, Chapter on the Heart-Mirror of Joyful Unity*:\n'What numinous power do these two substances possess that they may serve as the Great Elixir?'\nThe Perfected One replied: 'Gold, refined nine times from lead, receives its full measure of water and fire qi. Mercury, in the midst of the Great Yang, receives its full measure of qi. These two substances, each having received qi in full from yin and yang, are gathered by the sage as the Great Medicine. Harmonized and placed in an earthen vessel, with water and fire ascending and descending above and below, the work is completed—through a thousand transformations and ten thousand changes, they must not encounter their like nor follow their kind. When the dragon hums, clouds arise; when the tiger roars, winds are born. The Dao’s mutual resonance cannot occur without proper pairing. If one mixes in miscellaneous minerals, hoping to transmute them into treasure, even after eons it will not succeed. This is the method of the Perfected Ones of the Great Antiquity, not to be transmitted even for a thousand gold. Thus is the Golden Elixir proven!'\n\n*Discourse on the Golden Elixir, Chapter Three*\"\n\nThe cinnabar is the essence of the Great Yang, having originally received the true qi of the Great Yang. Through fire, it turns white, standing at the head of the Azure Emperor’s domain, taking the name of mercury—this is wood born of fire, containing inherent virtue that attains numinosity. Lead, transformed from black essence, holds the proper position of west and bedrock-metal, for metal gives rise to water, and water to wood. These two substances naturally match each other—without the utmost numinosity and sageliness, how could the elixir be formed?\n\nCommon fools often ask: how can consuming the Golden Elixir grant longevity and enduring vision? I have long pitied and lamented them. Since ancient times, all Perfected Ones and sages cultivated the elixir for long life—though hundreds of thousands knew of it, could they truly disbelieve? They point to Qin Shihuang and Han Wudi, yet the numinous power of the Great Elixir cannot save those who bring ruin upon themselves. Long ago, Liu Xuanmu served Master Wei, tending the fire for a year, but his reckless doubts led him to miss the Way and die young. Xu Jingxiu, diligent in heart and accumulating virtue, never resting from dawn to dusk, received the elixir from his teacher and attained immortality on Mount Taibai, where he has lived for over a thousand years. These two men—one doubted what should not be doubted—separated by a foot, yet worlds apart in attainment. Gain and loss, success and failure, are as distant as cloud and mud. This analogy should suffice to inspire belief.\n\nWhen yang spring emerges and the seasonal decree unfolds, the myriad things receive the qi of spring—flowers fall, seeds form, and through this qi, they bear fruit fit for human consumption. Is this not visible to the eye and natural in its workings? Even the five grains sustain human life, yet how can one witness their effects and still deny them? How much more so the supreme elixir and numinous cinnabar—consuming them transforms mortal bones into those of a Perfected One!\n\nYet世人 remain deluded, forgetting their purpose, disbelieving and neglecting cultivation, failing to encounter the Way and thus failing to act. They squander a hundred lifetimes, sinking through countless kalpas—how tragic! Coveting glory and fame, pursuing sensual desires, bound by the snares of reputation and profit, their forms wither and their essences decay. The Three Officials seize their lives, and the courts of the underworld impose punishment—how then can they attain longevity? Those who scheme deceitfully, harming others to build their own fortunes, or who seize another’s merit to advance their own ends—how could they ever encounter a Perfected One to transmit the teachings?\n\nOnly by refining the heart, calming the mind, and gathering the passions to return to the Dao can one meet such a teacher. Those who slander the virtuous, disturb the innocent—how could they ever hear of these truths? Even the five grains, though decaying matter, nourish spirit and qi to sustain life—how much more so the divine elixir, with its primal and mysterious virtue, which exchanges mortal flesh for the immortal, sheds sickly form, preserves youth, and extends life? To you I speak of these things—what is seen is known! I need not expound at length, for such details would only burden the discourse. The remaining subtleties and mysteries of the void are all inscribed upon the golden tablets.\n\nXu Jun, Master Wei, and Lord Chungan—these three each mastered the supreme arts and were disciples of the immortals. Xie Xuanchong and Su Tang, the two youths, were likewise adepts of feather-transformation and golden elixirs, known to all—what need is there to speak further of them? Moreover, in famous mountains and bustling markets, there are often those who dwell beyond the mundane, concealing their names and identities amidst the worldly crowd. Unless one shares the same Dao, how could one recognize them? Be cautious—do not lightly disclose or slight these matters, lest you incur fault and bring slander upon the golden elixir and the sages, plunging yourself into the prison of a thousand kalpas!\n\nHave you not heard what the *Cantong qi* says: \"Gold and cinnabar serve as the foundation, harmonized with mercury.\" These two substances are inherently numinous! And again: \"If one does not use medicinal herbs but the Five Phases, these are none other than Metal, Wood, Water, Fire, and Earth.\" Have you not also heard: \"White Horse Tooth is fine cinnabar; at *mao* and *you*, the two eights unite as one.\" Or that Huainan refined *qiushi*, and the Yellow Emperor praised *jinhua*? And further: \"Lead is not the sprout, the sprout is not lead; true lead and true cinnabar, when subdued and refined, become one family.\" As the fire cycles near nine revolutions, the Yellow Sprout is thus formed. Or that \"fire flowers into white medicine, red flowers flow as mercury,\" and the stones naturally correspond? \"Flowing pearls enter the body, the tiger devours them—who knows where to find the Golden Lord?\"\n\nSince ancient times, those who refine the elixir have struggled to fathom the nature of lead and mercury. Yet if one grasps this principle, the work of refinement becomes spontaneously numinous. \"A solitary yang cannot transform alone; a solitary yin cannot achieve completion. Originally, these two substances were one—naturally, they transform the body and reveal its brightness.\" When dragon and tiger meet, how could they not attend to one another? \"White liquid and the other mutually consume, consuming each other as husband and wife.\" Following their transformation, the Yellow Sprout is born, ever dependent on the Later Earth. If one obtains the Purple River Chariot, one becomes the herald of immortals.\n\nOnce the divine elixir’s secret is mastered, its numinous use lies within one’s power. \"Life and death rest in my hands\"—ponder this, and you will know it to be true. Without the proper method, refining the elixir will only exhaust the heart and spirit year after year. Do not waste effort on dead lead and mercury, casting your labor to the dust. \"Within the heavens, earth, sun, and moon, the divine medicine is called the Golden Lord. The Golden Lord is none other than lead, originally concealed within it.\" Clearly I tell you this, yet the deluded remain heedless. \"To fix mercury within lead, the golden flowers roughly correspond—yet these flowers are not the medicine, and to pursue them is to squander effort in vain.\"\n\nThese are the arts of immortals—how could they not be profoundly efficacious? Study the *Cantong qi* closely, and follow the ancient categories in harmony. Once you grasp the principle of true lead, your practice will surely reach its culmination. \"Lead and mercury unite with heaven and earth to refine the Great Return Elixir. When the elixir is complete, the sprout appears of itself—without this, success is truly difficult.\" The True One of Great Antiquity spoke thus; now, having witnessed it, I rejoice. Only then does one know the spirits do not deceive, and one must trust that the Dao will bring peace. \"Within it lies the five-colored numen, its transformations subduing all patterns. After ten months, the embryo emerges—whoever beholds it is awestruck.\"\n\nI report to you, child of glory: a hundred years wither and decay. Why idly abandon the world, listlessly letting the Dao slip away? Who says your words are empty, your principles mere rambling? I see the dust of Mount Nan, piled over the years into a mountain. Amidst the vast苦 sea, birth and death churn as waves. Since ancient times, even the dwellings of emperors and kings—what remains of them today?\n\n\"In the crucible, the white liquid transforms; the Yellow Sprout gradually takes form.\" Recall the day they first met—how difficult it was to discern the shape of mercury! \"When yang reaches its extreme, yin fire is born; when fire wanes, yang qi merges. Of itself, it becomes the Purple River Chariot—consuming it grants longevity.\"\n\nIn the first month, the white liquid congeals like snow; in the second, it resembles milk curdling into butter, slowly solidifying. By the third month, the medicine is half-contained, buds unfurling like dangling pearls. In the fourth, the two substances embrace, like blood being infused. By the fifth, they soar and cling to their mother, their cries mournful. In the sixth, they reach the womb, yin qi severed—its color distinct, like that of a gosling. In the seventh, yin descends, receiving qi, hands and feet stiffening. By the eighth, the organs and viscera form, blood congealing like gold. In the ninth, residual pearls grow hair; by the tenth, mother and child are poised to part. At this time, the mother is weary, but the child’s body is whole—its complexion still as snow.\n\nAfter the lead sheds its placenta, its surface is white as snow. Further temper it in the crucible, a process called \"nursing with milk,\" which delights the skin and flesh. Expel the child’s toxic qi according to the method. When the medicine is complete, it turns crimson—after sixty days, the toxins are purged, and it may be consumed. This medicine, like a child in the womb, sharpens the spirit and clarifies the bones and flesh.\n\nI urge you, seeker: you must be meticulous. Do not idly squander your days and months. The subtleties herein cannot be fully expressed; there is an order—do not neglect or transgress it. If you can refine the Yellow Sprout to completion, its transformative power will never cease. Consuming it grants longevity, turns white hair black, produces silver, aids the lonely and inept. The virtuous who obtain it never falter in their practice. In harmony with the Dao, they delve into past causes, transmitting it only to the worthy, whose hearts are true.\n\nThose who lack the Dao—if they incur fault, they will sink into calamity, even if they gain it, misfortune will assail them. To grasp the workings of creation is no easy task; it cannot be casually transmitted. Have you not heard the ancients’ words? To recklessly transmit it brings disaster upon seven generations. You must believe, not doubt. Only those whose kidneys are luminous and unobstructed will attain it.\n\nToday, I charge you with a thousand cautions—remember them clearly, as if bound by a solemn pact. \"Yang begins its return in the eleventh month, when the fire is first applied. Yin arises in the fifth month, after yang reaches its peak from the eleventh to the fourth month. The crucible is entrusted to the central *wu* and *ji* (Earth). Within the earthen cauldron, above and below interact—guard it diligently, secure it to prevent escape. Observe the seasons and nodes without fail.\"\n\n\"Dragon and tiger race together; the infant is tranquil, its countenance youthful. The mother’s nurturing determines her own plumpness or emaciation, and the child’s completion depends on the mother’s aid.\" When yang reaches *qian*, yin reaches *kun*; *qian* embodies the four images, the gate of the *Yi*. The sixty-four hexagrams are revered in the midst of practice.\n\nDragon and tiger spray each other, mutually devouring; in this fixed position they arise and abide. Water and fire serve as mediators, gathering my soul; yin and yang nurture me through dawn and dusk. The eight solar terms shift between cold and warmth—watch closely as the yellow sprout’s root gradually takes form. Day by day, the mother’s gratitude quickens; through this, the fruit solidifies and the true gate is established. For a thousand autumns and ten thousand years, it begets descendants—guard it in secrecy, take care, and speak no further of it.\n\nThis Dao is profound and subtle, beyond words. The people of this age mock it as turbid and confused. Better to dwell in seclusion among markets and villages than to reveal the wondrous elixir to the vulgar, who upon seeing it would slander it with reckless speech. You must remember: conceal it well, as if sealing it in a golden casket. The art of longevity is passed only to those who walk the Way, for heaven’s officials have already recorded their names.\n\n**Chapter Four: The Essence of the Great Return Elixir**\nTo speak of the Return Elixir is to speak of an elixir that, when ingested, grants transcendence. Since ancient times, the immortals of heaven have preserved this treasure, bestowing it upon the human realm. It was transmitted to the Yellow Emperor, who, having attained it, ascended to heaven in broad daylight at Mount Dinghu. The ancient immortals who achieved this are too numerous to name individually.\n\nThe Return Elixir is forged from the most potent medicines: the mysterious pearl of cinnabar, the numinous marvels of golden lead and mercurial tiger. There exists a celestial Return Elixir, naturally formed in the mountains where the sun’s back faces yin and its front faces yang. Cinnabar is born only in the south, never in the northern lands. The natural Return Elixir arises when flowing mercury embraces the Golden Elder and conceives. Where cinnabar is found, lead and silver also exist. After four thousand three hundred and twenty years, the elixir matures—male on the left, female on the right—with cinnabar above and malachite below, cradling the qi of the sun and moon, yin and yang. After another four thousand three hundred and twenty years, its base turns black, and the celestial Return Elixir of the immortals is complete.\n\nFor earthbound immortals, refining lead and mercury takes but a year. Fire is applied in the eleventh month, when yang first revives, and the elixir is completed by the following eleventh month—a cycle mirroring the celestial immortals, heavenly beings, and sages who partake of the natural Return Elixir. Thus, the natural Return Elixir is consumed by immortals, heavenly beings, and sages, while modern practitioners emulate this process to achieve the same end. Ingesting it grants longevity and transformation, equaling the heavens in merit.\n\n**Question:** Why does a single year mirror the celestial cycle of the Return Elixir’s formation?\n**Answer:** In the heavens, one day and night equals five years among humans. Here below, one year consists of twelve months, three hundred sixty days, one month of thirty days, and one day of twelve hours—totaling three hundred sixty hours per month. Thus, a year comprises four thousand three hundred twenty hours, mirroring the celestial formation of the natural Return Elixir. This method, passed down by the true immortals of the heavens, allows those on earth who follow the proper discipline to refine the essence of the sun and moon, the qi of the four seasons, and achieve longevity through ingestion. The superior practitioner aligns with truth, transforming and ascending; the middling practitioner becomes an earthbound immortal; the inferior practitioner attains extended life without death. The gateway of ingestion has its own distinct methods.\n\n**Chapter Five: The Mysterious Record**\n\nChisongzi said: The essence of cinnabar contains both white and vermilion. When it embraces fire and turns white, it is the White Tiger; when it is called vermilion, it is the Fire Elixir. Mercury is born within cinnabar—these three share a single body. The White Tiger is metal, symbolizing the *gen* of the western direction, containing the auspiciousness of the five colors and encompassing the marvels of the eight minerals. Lead is the White Tiger, matched as an equal to mercury. These two substances serve as sovereign and minister; heaven and earth as husband and wife, as mother and child. Refined with divine subtlety, they do not belong to the Three Yellows nor to the category of the eight minerals. Distinctly shaped by creation and cultivated through refinement, they become the Return Elixir.\n\nIn the past, I encountered a Daoist who transmitted this teaching to me. After practicing it in accordance with the method, I attained transformation and ascension. I dare to sing its secrets in verse:\n\nA divine art, wondrous and hard to fathom,\nLead and mercury—unknown to men.\nLead and mercury are the essence of heaven and earth,\nThe power of yin and yang, the strength of heaven and earth.\nTheir merit returns to *wu* and *ji*,\nAble to generate all sustenance.\nAll things rely on the work of earth,\nFor earth is the ultimate mother,\nNurturing all her children,\nAnd children, too, are rooted in their mother.\nThe Three Substances naturally attain numinosity,\nThe two *qi* flow directly from the mysterious origin.\nTheir efficacy lies in fortifying the city walls,\nTheir task in discerning firmness and softness.\nSuccess depends on human achievement,\nDerived from what the heart recalls.\nWhen the heart is numinous, the elixir becomes numinous;\nWhen the heart is deluded, the elixir remains unfathomable.\nThe supreme Dao resides in an empty heart,\nWithin the mysterious, its wonders never cease.\nThose of wisdom who grasp its source\nShall one day ascend on cloud-borne wings.\n\nThe verse of the Four Noble Sons of the Liang Dynasty states:\nLead and mercury unite in divine work,\nTheir union returns to the supreme mystery.\nWholly within the Five Phases,\nFully encompassed by the wisdom of the Three Powers.\nThe immortals leave this gateway of perfection,\nIngestion makes one extraordinary.\nIf one attains the true lead’s gate,\nOne’s spirit becomes one with nature.\n\nHere ends *The Heart-Mirror of Elixir Discourse and Secret Essentials*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "丹论诀旨心鉴 经名：丹论诀曰心鉴。 一卷。 原题账元德撰，应出於晚唐五代。 底本出处：《正统道藏》洞神部众术类。 丹论诀旨心鉴 序诀章第一 《参同契》云：诸术甚众多，千条有万余。 即知大丹之妙，唯铅汞二物为至药也，非用四黄八石。 若大丹有石药之气入二物中，即有大毒，凡言死。 水银固生人，即须阴阳之气，水火结成为大丹，服之长生。 若用矾石、硫黄、炮砂等，燠伏为药，服之有大毒，久久损人，乃有食铜坏铁之功，岂堪服食？ □矾石有杀虎之能，此可为深戒。 大凡学得传受一小法。 即言世人少双，将丹与人服之，倏有夭横之毙，深可哀之！ ．自后见者生嫌，皆云丹石发於疮廊瘫肿，盖此谬惑之徒，毁谤金丹之功不可服饵。 凡石乳之辈，能不食为妙，不可以徇情色，强而服之，致枉夭者，百有百矣！ ．宜审省解之药，须宣泻，吃防己、葵菜、甘草汤，渐出之，可服大药也。 且大丹是天地玄元正真之气，太皇众仙之食，包四象以成形，依乾坤而自化，结成红紫，色变为丹，名曰正阳、专阳、元阳，一还丹也，岂可容易而会？ 奉道君子，审而保之，传付得人，道不废矣！ 天生造化，用合三才，依易象布卦节，顺阴阳之气候，一年之大终，日月之度数，而成丹也，固可得之，古仙皆因此而成仙也。 长生久视，凡者闻之抚掌大笑，智者一闻悟解，大契真元。 余恐不才，故引《三圣真人歌》证之，《金丹论》明之，更不烦重他说。 夫还丹者，被日月运成，还其本元，却归本丹砂之色，名曰还丹。 丹有三等．．一名正阳丹，上元也； 二名专阳丹，中还也； 次名元阳丹。 本一体而三品，并大还之宗也。 不知此妙，不可言其修丹之卫事也。 又单以卤水煮伏丹砂，独伏水银，并不可，何也？ 孤阴无阳也。 久久损人，不是正阳之位。 又有用曾雌杀水银雄雌成之，亦不堪服食。 此互相传受，非真圣之良药者，何也？ 八石俱有毒也。 《金碧经》云：损去五矾，不用八石。 诀云：不用药，用五行。 此为理之至要者矣！ 明辩章第二 夫硫黄三两，能制水银一斤，故知汞力不如硫黄。 汞一两之力，如牛一头，即知硫黄一两，制水银五两，水银力不如硫黄也。 如此说功力，大丹不用硫黄，用真铅也真铅五两，能制水银二斤，水银力不如真铅也。 故阴伏阳，非阳能伏阴，此之为反也。 夫至道求长生，养志修真，不得大丹，终无得理。 忽遇此诀，皆多积福，方得知此秘文若传非人，皆七祖受殃，及损子孙。 凡修大丹，不在药味，事在五行精究，易象分明，辩节序之运移，知日月度数，阴阳相使，神仙之要，合道之宗。 辄不可信八石四黄，非长生之妙药。 夫铅汞，大丹之根，五行之本，八石之主。 金性玲，居其阳，坎中一阳也。 汞即生於朱中是也； 石性热，居其阴离中二阴也。 铅中金，真铅也。 故曰阴阳相合，所以阳即是君，阴即是臣，石浮金沉之义，明矣！ ．君臣相得，浮沉得度，药物和合，即神仙之妙要也。 若不知君臣，不辩朋本类，徒费千金，终无得理。 必知君臣，合君臣乾坤之要，大丹之术自明矣！ ．且以铅为君，能引五藏； 以汞为臣，能杀三贼，通於神明，光于四海，故《玄人诀》云：用铅不用铅，五金生於铅中；",
      "translated_text": "**The *Danlun Juezhi Xinjian* (Mirror of the Essentials of Alchemical Discourse)**\n\n**Scripture Title:** *Danlun Juezhi Xinjian* (*Mirror of the Essentials of Alchemical Discourse*). One scroll. Originally attributed to Zhang Yuande, likely composed in the late Tang or Five Dynasties period. Base text from the *Zhengtong Daoist Canon*, under the *Dongshen* section, category of *Miscellaneous Arts*.\n\n---\n\n### **Preface and Essential Formulas (Chapter One)**\n\nThe *Cantong Qi* states: \"The arts are vast and numerous, numbering in the thousands.\" Yet the marvel of the Great Elixir lies solely in the two substances—lead and mercury—as the supreme medicines, not in the four yellows or eight minerals. If the qi of mineral drugs enters these two, it becomes highly toxic, and all who consume it perish.\n\nMercury, though naturally occurring in humans, requires the qi of yin and yang, refined through water and fire, to form the Great Elixir. Ingesting it grants longevity. But if one uses alum, sulfur, or cinnabar—calcined and sublimated into medicine—it becomes highly toxic, gradually harming the body. Such substances may dissolve copper and corrode iron, yet how could they be fit for consumption? Even alum alone can slay tigers—a dire warning indeed.\n\nGenerally, those who learn even a minor alchemical method claim few in the world possess such knowledge. If they administer the elixir to others, sudden and unnatural deaths may occur, a tragedy most lamentable! Thereafter, skeptics arise, decrying that \"mineral elixirs provoke sores, ulcers, and swellings.\" Such misguided individuals slander the efficacy of the Golden Elixir, declaring it unfit for consumption.\n\nAs for stalactites and the like, it is best not to ingest them. One must not indulge in sensual pleasures and force their consumption, for such recklessness has led to countless premature deaths. One should carefully examine purgative medicines, employing them to induce elimination. Consuming *fangji* (stephania root), mallow, and licorice decoctions will gradually expel toxins, allowing the Great Medicine to be safely ingested.\n\nThe Great Elixir is the primordial, authentic qi of Heaven and Earth, the sustenance of the Supreme Sovereign and the host of immortals. It encompasses the Four Symbols to take form, relying on Qian and Kun to transform itself. When condensed into crimson and violet hues, it becomes the Elixir—known as *Zhengyang* (True Yang), *Zhuanyang* (Exclusive Yang), and *Yuanyang* (Primordial Yang)—the One-Return Elixir. How could such a process be easily grasped?\n\nDevoted Daoist adepts must carefully preserve this knowledge, transmitting it only to the worthy, that the Way may not perish.\n\nHeaven’s generative transformations align with the Three Powers, following the *Yijing*’s symbolic hexagrams and the cyclical rhythms of yin and yang. The Great Elixir is achieved through the grand completion of a year, the measured movements of the sun and moon. Thus it is attainable, and the ancient immortals all ascended by this means.\n\nLongevity and eternal vision—when the common folk hear of this, they clap their hands in mocking laughter. But the wise, upon hearing it once, comprehend and align with the true origin. Fearing my own inadequacy, I cite the *Song of the Three Sages* as proof and clarify it through the *Discourse on the Golden Elixir*, sparing further redundant explanations.\n\nThe Return Elixir is refined by the revolutions of the sun and moon, returning to its original essence and reverting to the color of cinnabar. Thus it is called the *Return Elixir*.\n\nThere are three grades of elixirs:\n1. *Zhengyang Dan* (True Yang Elixir), the Upper Return;\n2. *Zhuanyang Dan* (Exclusive Yang Elixir), the Middle Return;\n3. *Yuanyang Dan* (Primordial Yang Elixir).\n\nThough three in name, they are one in essence, all belonging to the lineage of the Great Return. Without knowing this mystery, one cannot speak of the methods for cultivating the Elixir.\n\nFurthermore, merely boiling cinnabar in brine to subdue mercury alone is insufficient. Why? Because it is solitary yin without yang, gradually harming the body and failing to attain the position of True Yang. Some use *cengci* (a mineral preparation) to kill mercury and combine male and female forms, yet this is also unfit for consumption. Such methods are passed down through mutual transmission, but they are not the true, sagely medicines. Why? Because all eight minerals are toxic.\n\nThe *Jinbi Jing* states: \"Discard the five alums and do not use the eight minerals.\" The formula declares: \"Do not use medicines; use the Five Phases.\" This is the ultimate principle!\n\n---\n\n### **On Clarifying Distinctions (Chapter Two)**\n\nThree *liang* of sulfur can control one *jin* of mercury, proving mercury’s power is inferior to sulfur’s. The strength of one *liang* of mercury is like that of an ox; thus, one *liang* of sulfur can control five *liang* of mercury, again showing mercury’s weakness before sulfur.\n\nBy this logic, the Great Elixir does not use sulfur but true lead. Five *liang* of true lead can control two *jin* of mercury, demonstrating mercury’s inferiority to true lead. Thus, yin is subdued by yang, not the reverse—this is the true principle.\n\nThe supreme Way seeks longevity and the cultivation of the true mind. Without the Great Elixir, one cannot attain the Dao. If one suddenly encounters this formula, it is only through the accumulation of great merit that such secret texts are revealed. If transmitted to the unworthy, seven generations of ancestors will suffer calamity, and descendants will be harmed.\n\nIn refining the Great Elixir, the key does not lie in the flavors of the medicines but in the precise mastery of the Five Phases, the clarity of *Yijing* symbolism, the discernment of seasonal transitions, the knowledge of the sun and moon’s movements, and the interplay of yin and yang. These are the essentials of immortality and the foundation of the Dao. One must not trust the eight minerals or four yellows, for they are not the wondrous medicines of longevity.\n\nLead and mercury are the root of the Great Elixir, the origin of the Five Phases, and the sovereign of the eight minerals. Gold’s nature is cold, residing in yang—it is the single yang within Kan. Mercury is born within cinnabar. Stone’s nature is hot, residing in yin—it is the double yin within Li. The gold within lead is true lead.\n\nThus, yin and yang unite. Yang is the ruler, yin the minister—the principle of stone floating and metal sinking is evident. When ruler and minister harmonize, floating and sinking attain balance, and the medicines combine. This is the wondrous essence of immortality.\n\nWithout knowing the ruler and minister, or distinguishing their true natures, one may waste a thousand gold pieces and still fail to attain the Dao. Only by understanding the ruler and minister, aligning with the essentials of Qian and Kun, will the art of the Great Elixir become clear.\n\nMoreover, lead serves as the ruler, guiding the five viscera; mercury serves as the minister, slaying the Three Thieves, communicating with the divine, and illuminating the Four Seas. Thus, the *Xuanren Jue* states: \"Use lead without using lead, for the five metals are born within lead.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1228,
      "start_sentence": 0,
      "end_sentence": 57,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.614139556884766,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\丹论诀旨心鉴.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "用铅不用铅，五金自出铅中。 此至玄之言也。 贤者审而知之，方知道可成也。 用铅不用铅，铅者五金之精髓，七宝之良媒。 夫大丹，乃与天地而齐毕，五金切忌於铅，将何物而制之？ 《五金歌》日：以黄芽为根，黄芽是何物？ 又欲用何鼎器？ 黄芽不是铅，不离铅中作。 胡刚子问日：用何物作？ 又云：不用五金八石，用何物而生？ 魏生答日：种禾当用粟，非类不可成也。 若以五金八石为之，即狐兔不乳马，骛雀不生凤，何异将胶补釜，医病用野葛乎？ 异类不同种，安能合体居，点金须用金，花银须用银。 黄芽铅裹得，方知此道亲。 铅若是真，不失家臣； 铅若不真，其汞不亲。 白虎作脑，黄芽为根，青腰使者，赤血将军，此青汞中有丹砂也，非用曾青也。 若人得此术，可保重之，若泄之，当臧寿，殃子孙。 《阴符》云：师者言：不同道者，秘之，恐招殃咎也。 夫慕道之人，至诚感神，晓会其义，方知大道难求，世人罕会。 世人愚迷，不见其义，虽精览方书，一无成者，何也？ 一且不遇至人明师，二乃措意罔象自为，多有此辈。 余曾嵩山见司马希夷修大丹，喜乃问访之，火已五月，余问之，伊又秘，奈何欲明此道，恐此子虚为累日，久见之不成也。 他又云：大道有三般，二内一人看，遂於铅汞中用雄黄也。 果非大药之妙，只是罔象寻文自为。 又见李尊师子虚，於二味中入硫黄，亦言内用一人看。 此二子并非正解，传处俟也。 余愍而哀之，二子根性不纯，熟边不反，徒自孤我，终无得年。 且内一人看，即戊己之鼎，此子不了，虚而为之，徒经皓首，果不遇余，非余之过，皆道不合。 人《五金歌》日：不是药不圣，恐药而不正，不怕药不神，恐药而不真。 若智者晓会此义，是正真通灵真人也，何愁龙虎大丹不成。 可谓日月在手，造化由心，真实不虚之说耳。 丹者，《龙虎真文》云：虎者真铅也，龙者真汞也，反铅为黄芽，反水银为真汞，真铅不枯，真汞不飞。 即此，非世问水银也。 已出一切尘俗耳。 《马自然歌诀》云：汞生水银死，铅因灵芽是，出世为还丹，迷人不能委。 汞与水银别，迷人用之拙，若了此真源，可以凡俗隔。 后之学者，固不遇真师传矣！ ．诀日：用铅八两，为阳为乾为虎，又水银八两，为阴为坤为青龙，此二物能变化。 为铅，亦阴也，本黑，水一阴也。 又一爻阳也，水银，木也，三也，为朱砂，火也，火数二，火中阴也。 故药自有阴阳，递相制伏，为於至药，此二灵物，是天地阴阳之正象，岂凡八石四黄为丹乎？ 智者详之，．此太古一切真人仙人，真境真母也，故言乾坤刚柔，配合龙虎，八两属乾，八两属坤，一两有四分，分有六铢，一分应一卦，一两应四卦，八两有三十二卦。 乾八以应三十二卦，坤八亦应三十二卦，合六十四卦，道之本也。 二八共一斤，以应六十四卦，铢有三百八十四，象一年三百六十日。 古仙观易象，合乾坤，应为於节候，一年大毕，合周天数。 岂更有四黄八石，何以合之乾象乎？ 口诀云：黄芽一，水银二，木三人二，水一金四土五，法天象地。 此中矣，孤阴亦不可，孤阳亦不可。 又诀云：白金为君，本黑金精也，西方之位，太阳之精，《金碧经》云：炼银於铅，神物自生，灰池炎铄，铅沈银浮。",
      "translated_text": "\"Use lead without using lead, for the five metals emerge from within lead.\" This is the most profound of sayings. The wise examine and understand it, then know the Dao may be accomplished.\n\n\"Use lead without using lead\"—lead is the essence of the five metals, the fine catalyst of the seven treasures. Now, the Great Elixir is coeval with heaven and earth, yet the five metals are strictly forbidden in lead. With what, then, shall they be refined?\n\nThe *Song of the Five Metals* states: \"Take Yellow Sprout as the root.\" What is Yellow Sprout? And what vessel should be used? Yellow Sprout is not lead, yet it is not apart from lead.\n\nHu Gangzi asked: \"With what is it made?\" And again: \"If not the five metals and eight stones, what gives rise to it?\"\n\nMaster Wei answered: \"To sow grain, one must use millet. Without like kind, nothing can be achieved. If one uses the five metals and eight stones, it is like a fox or hare giving birth to a horse, or a sparrow hatching a phoenix—what difference is there from mending a cauldron with glue or treating illness with wild aconite? Different kinds do not share the same nature; how can they unite as one body? To transmute metal, one must use metal; to refine silver, one must use silver. Only when Yellow Sprout is obtained within lead does one know this Dao as intimate.\n\nIf the lead is true, it does not lose its minister; if the lead is not true, its mercury will not be intimate. The White Tiger serves as the brain, Yellow Sprout as the root, the Green-Waisted Messenger, and the Red-Blooded General—this is cinnabar within blue-green mercury, not the use of azurite.\n\nIf one attains this art, guard it well. Should it be leaked, one’s lifespan will be cut short, and calamity will befall one’s descendants.\" The *Yin Fu Jing* states: \"The master says: Do not share it with those who walk a different path. Keep it secret, lest misfortune be invited.\"\n\nThose who aspire to the Dao, moved by utmost sincerity, may comprehend its meaning and know the Great Dao is difficult to seek, rarely grasped by the world. The world’s people are foolish and deluded, blind to its principles. Though they pore over alchemical texts, none succeed. Why? First, they have not met a true master; second, they rely on vague imaginings and proceed on their own—many are of this sort.\n\nI once saw Sima Xiyi on Mount Song refining the Great Elixir. Delighted, I sought him out and asked, but the firing had already lasted five months. When I questioned him, he remained secretive. How could I clarify this Dao? I feared this man’s emptiness would waste days, and after long observation, saw no success.\n\nHe claimed: \"The Great Dao has three aspects, two internal and one external to observe.\" Thus, he used realgar within lead and mercury. This was not the wondrous subtlety of the Great Medicine, merely chasing shadows and following texts on his own.\n\nI also saw Master Li Zixu add sulfur to the two ingredients, likewise claiming one aspect was internal to observe. Neither of these two had the correct understanding; their transmissions were flawed.\n\nI pitied and lamented them: their natures were impure, their edges unrefined, and they strayed from the path, isolating themselves, ultimately gaining no longevity. That \"one internal to observe\" refers to the Wuji crucible. These men did not comprehend it, yet proceeded in vain, their hair turning white in futility. Had they not met me, it would not have been my fault—it was simply that their Dao did not align.\n\nThe *Song of the Five Metals* states: \"It is not that the medicine lacks sanctity, but that the medicine may not be correct. Do not fear the medicine lacks numinosity, but that the medicine may not be true.\"\n\nIf the wise comprehend this principle, they are true, spiritually attuned immortals. What worry is there that the Dragon-Tiger Great Elixir will not be achieved? Truly, one may hold the sun and moon in hand, and creation follows the heart—this is no empty saying.\n\nAs for the Elixir, the *True Writ of Dragon and Tiger* states: \"The Tiger is true lead; the Dragon is true mercury. Reverse lead to become Yellow Sprout; reverse mercury to become true mercury. True lead does not wither; true mercury does not fly.\" This is not the mercury of the mundane world, having transcended all worldly dust.\n\nThe *Song of Ma Ziran* says:\n\"Mercury lives, cinnabar dies;\nLead, through the numinous sprout, is.\nEmerging as the Returned Elixir,\nThe deluded cannot grasp it.\nMercury and cinnabar differ—\nThe deluded use them clumsily.\nIf one understands this true source,\nOne may transcend the vulgar world.\"\n\nLater scholars, if they do not meet a true master, will not receive the transmission!\n\nThe oral formula states: Take eight ounces of lead as yang, as Qian, as the Tiger; and eight ounces of mercury as yin, as Kun, as the Green Dragon. These two substances are capable of transformation.\n\nLead is also yin, originally black—water is one yin. Yet it contains one yang line. Mercury is wood, three; cinnabar is fire, two. Fire contains yin. Thus, the medicine inherently possesses yin and yang, mutually restraining and subduing, becoming the supreme medicine. These two numinous substances are the true images of heaven and earth’s yin and yang. How could the eight stones and four yellows serve as the Elixir?\n\nThe wise should consider this carefully. This is the true mother of all ancient immortals and transcendents. Thus, Qian and Kun, firm and yielding, unite Dragon and Tiger. Eight ounces belong to Qian, eight ounces to Kun. One ounce has four parts, each part six *zhu*. One part corresponds to one hexagram, one ounce to four hexagrams, and eight ounces to thirty-two hexagrams. Qian’s eight ounces correspond to thirty-two hexagrams, as do Kun’s eight ounces, together forming sixty-four hexagrams—the root of the Dao.\n\nTwo eights make one *jin*, corresponding to sixty-four hexagrams. There are three hundred eighty-four *zhu*, symbolizing a year’s three hundred sixty days. The ancient immortals observed the *Yi*’s images, uniting Qian and Kun, aligning with the solar terms. A year’s great cycle completes the celestial revolution. How could the four yellows and eight stones correspond to Qian’s image?\n\nThe oral formula states: \"Yellow Sprout one, mercury two, wood three, fire two, water one, metal four, earth five—modeling heaven and earth.\" Herein lies the principle: neither solitary yin nor solitary yang will suffice.\n\nAnother formula states: \"White metal as ruler is the essence of black metal, the position of the west, the essence of the great yang.\" The *Jinbi Jing* says: \"Refine silver from lead, and numinous substances arise of themselves. In the ash pool’s blazing heat, lead sinks and silver floats.\"",
      "overlap_context": " one may waste a thousand gold pieces and still fail to attain the Dao. Only by understanding the ruler and minister, aligning with the essentials of Qian and Kun, will the art of the Great Elixir become clear.\n\nMoreover, lead serves as the ruler, guiding the five viscera; mercury serves as the minister, slaying the Three Thieves, communicating with the divine, and illuminating the Four Seas. Thus, the *Xuanren Jue* states: \"Use lead without using lead, for the five metals are born within lead.\"",
      "start_char": 1228,
      "end_char": 2452,
      "start_sentence": 58,
      "end_sentence": 107,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.79483962059021,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\丹论诀旨心鉴.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "洁白见宝，可造黄金芽。 又隐言名黄轻，又日黄芽，又名秋石。 秋是西方之位，石是兑长之名，其性阴，阴中阳也，是长生之至药芽，是万物之初也，故号芽。 绿因白被火变色黄，故名黄芽。 淮南王号秋石，王阳得之名黄芽，木古真人名还丹。 《至丹论诀旨心鉴诀喜一。 ：二物何灵，而堪为大丹？ 真人日：金於铅中九炼，受其水火气足，水银於太阳中受气足，此二物各於阴阳中受气毕，故圣人采之为大药，相和入土器中，上下水火升降，功毕千变万化，勿遇相类相从。 龙吟云起，虎啸风生，道之交感，非类不可。 若以杂石药参杂，意希化宝，举浩劫而不成。 此二物太古真人之法，千金不可传也。 故金丹证之矣！ . 金丹论章第三",
      "translated_text": "\"When purity reveals the treasure, the Yellow Sprout may be wrought. It is also cryptically called *Yellow Light*, or *Yellow Sprout*, or *Autumn Stone*. Autumn is the position of the west, and *Stone* is the name of the trigram *Dui*; its nature is yin, yet within yin lies yang—this is the supreme medicinal sprout of long life, the origin of the ten thousand things, hence called *sprout*. When green, through the action of fire, turns white and then yellow, it is named *Yellow Sprout*. The Prince of Huainan called it *Autumn Stone*; Wang Yang obtained it and named it *Yellow Sprout*; the Perfected One Mu Gu called it *Returned Elixir*.\n\nFrom *The Essence of the Supreme Elixir’s Discourse, Chapter on the Heart-Mirror of Joyful Unity*:\n'What numinous power do these two substances possess that they may serve as the Great Elixir?'\nThe Perfected One replied: 'Gold, refined nine times from lead, receives its full measure of water and fire qi. Mercury, in the midst of the Great Yang, receives its full measure of qi. These two substances, each having received qi in full from yin and yang, are gathered by the sage as the Great Medicine. Harmonized and placed in an earthen vessel, with water and fire ascending and descending above and below, the work is completed—through a thousand transformations and ten thousand changes, they must not encounter their like nor follow their kind. When the dragon hums, clouds arise; when the tiger roars, winds are born. The Dao’s mutual resonance cannot occur without proper pairing. If one mixes in miscellaneous minerals, hoping to transmute them into treasure, even after eons it will not succeed. This is the method of the Perfected Ones of the Great Antiquity, not to be transmitted even for a thousand gold. Thus is the Golden Elixir proven!'\n\n*Discourse on the Golden Elixir, Chapter Three*\"",
      "overlap_context": "la states: \"Yellow Sprout one, mercury two, wood three, fire two, water one, metal four, earth five—modeling heaven and earth.\" Herein lies the principle: neither solitary yin nor solitary yang will suffice.\n\nAnother formula states: \"White metal as ruler is the essence of black metal, the position of the west, the essence of the great yang.\" The *Jinbi Jing* says: \"Refine silver from lead, and numinous substances arise of themselves. In the ash pool’s blazing heat, lead sinks and silver floats.\"",
      "start_char": 2452,
      "end_char": 2735,
      "start_sentence": 108,
      "end_sentence": 121,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.28657841682434,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\丹论诀旨心鉴.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "夫丹砂，太阳之精，本受太阳之正气，因火变白，居青帝之首，为汞之名，是木生于火，自含德而至灵。 铅本黑精化，为西方庚辛正位，是以金生水，水生于木，二物自相匹敌，若非至灵至圣，何以成丹乎？ 大凡愚人或言，岂有饵金丹而长生久视？ 余尝愍而伤之，自古真人圣者，皆修炼药长生，虽百千万人皆知之，岂有不信乎？ 皆指秦皇汉武，然大丹之灵，不救自刑之祸。 昔刘玄穆事魏先生，看火一年，妄情有疑，遂不遇而早夭； 徐景休勤心积德，不息昏旭，师受以药，长生于仙，在太白山，亦一千余岁。 此二子疑以不疑，咫尺万里，得与不得，云泥有殊。 今喻而言之，足可信矣1．且阳春既发，令节已行，万物承春之气，花落子孕，感气而实，堪人食之。 此气非目击自然乎1．且五谷而可济人之命，然目击而不见乎！ ．况至药灵丹，服之而可变骨为真人矣！ ．自是世人迷忘所计，不信不修，不遇不为，已虚度百生，沈累多劫，是足伤乎！ ．贪荣显，求色欲，以名利所系，形枯质朽，三官夺命，被阴司诛罚，又何以得长生乎？ 又狡计多非，损己败正，夺人功而成自家业，又何遇至人传受乎？ 修心静念，摄情归道，则可遇矣！ ．若谤毁先德，侵扰无辜，又何而闻之？ 夫五谷尚能滋神气养命，是败腐之物，犹延人益生，岂况神丹，而元玄德之功，换凡肌，脱病质，驻颜益命乎？ 与子论之，目击可知耳！ ．不欲广陈委细，事涉繁词，其余妙旨清虚，尽着金简。",
      "translated_text": "The cinnabar is the essence of the Great Yang, having originally received the true qi of the Great Yang. Through fire, it turns white, standing at the head of the Azure Emperor’s domain, taking the name of mercury—this is wood born of fire, containing inherent virtue that attains numinosity. Lead, transformed from black essence, holds the proper position of west and bedrock-metal, for metal gives rise to water, and water to wood. These two substances naturally match each other—without the utmost numinosity and sageliness, how could the elixir be formed?\n\nCommon fools often ask: how can consuming the Golden Elixir grant longevity and enduring vision? I have long pitied and lamented them. Since ancient times, all Perfected Ones and sages cultivated the elixir for long life—though hundreds of thousands knew of it, could they truly disbelieve? They point to Qin Shihuang and Han Wudi, yet the numinous power of the Great Elixir cannot save those who bring ruin upon themselves. Long ago, Liu Xuanmu served Master Wei, tending the fire for a year, but his reckless doubts led him to miss the Way and die young. Xu Jingxiu, diligent in heart and accumulating virtue, never resting from dawn to dusk, received the elixir from his teacher and attained immortality on Mount Taibai, where he has lived for over a thousand years. These two men—one doubted what should not be doubted—separated by a foot, yet worlds apart in attainment. Gain and loss, success and failure, are as distant as cloud and mud. This analogy should suffice to inspire belief.\n\nWhen yang spring emerges and the seasonal decree unfolds, the myriad things receive the qi of spring—flowers fall, seeds form, and through this qi, they bear fruit fit for human consumption. Is this not visible to the eye and natural in its workings? Even the five grains sustain human life, yet how can one witness their effects and still deny them? How much more so the supreme elixir and numinous cinnabar—consuming them transforms mortal bones into those of a Perfected One!\n\nYet世人 remain deluded, forgetting their purpose, disbelieving and neglecting cultivation, failing to encounter the Way and thus failing to act. They squander a hundred lifetimes, sinking through countless kalpas—how tragic! Coveting glory and fame, pursuing sensual desires, bound by the snares of reputation and profit, their forms wither and their essences decay. The Three Officials seize their lives, and the courts of the underworld impose punishment—how then can they attain longevity? Those who scheme deceitfully, harming others to build their own fortunes, or who seize another’s merit to advance their own ends—how could they ever encounter a Perfected One to transmit the teachings?\n\nOnly by refining the heart, calming the mind, and gathering the passions to return to the Dao can one meet such a teacher. Those who slander the virtuous, disturb the innocent—how could they ever hear of these truths? Even the five grains, though decaying matter, nourish spirit and qi to sustain life—how much more so the divine elixir, with its primal and mysterious virtue, which exchanges mortal flesh for the immortal, sheds sickly form, preserves youth, and extends life? To you I speak of these things—what is seen is known! I need not expound at length, for such details would only burden the discourse. The remaining subtleties and mysteries of the void are all inscribed upon the golden tablets.",
      "overlap_context": "not encounter their like nor follow their kind. When the dragon hums, clouds arise; when the tiger roars, winds are born. The Dao’s mutual resonance cannot occur without proper pairing. If one mixes in miscellaneous minerals, hoping to transmute them into treasure, even after eons it will not succeed. This is the method of the Perfected Ones of the Great Antiquity, not to be transmitted even for a thousand gold. Thus is the Golden Elixir proven!'\n\n*Discourse on the Golden Elixir, Chapter Three*\"",
      "start_char": 2735,
      "end_char": 3298,
      "start_sentence": 122,
      "end_sentence": 140,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.431992053985596,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\丹论诀旨心鉴.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "徐君、魏先生，淳干公，此三人各通至术，并神仙之徒。 谢玄冲、苏躺二子，亦羽化金丹之客，人皆知之，何言及矣！ ．况名山郾市，往往有物外之流，混俗世问，自韬姓字，非其道同，如何得知之请审？ 非言勿轻泄侮，令子得罪，将谤金丹与圣人，令子沈千劫之囚矣！ ．子不闻《参同契》云：金与砂为主，禀和於水银。 即二物自灵矣！ ．又闻不用药用五行，即具金木水火土也。 又不闻：白马牙，好丹砂，卯酉二八和两家。 又淮南炼秋石，黄帝美金华。 又铅不是芽，芽不是铅，真铅真丹砂，伏炼成一家。 巡火近九转，然成黄芽。 又火花白药，花红流汞，石自相同。 流珠入体虎吞食，不知何处认金公。 又自古烧丹者，难穷铅汞情，若人知此理，修制自通灵。 又孤阳不独化。 孤阴不独成，本来同二物，‘自有变身明。 又龙虎相逢遇，何时不自顾，白液共相吞，相吞作夫妇。 随化成黄芽，逐时依后土，若得紫河车，便是神仙倡。 又神丹修得诀，神用便由人，生杀在我手，参详定为真。 修丹不得术，终岁损心神，莫炼枯铅汞，抛功与土尘。 又天地日月中，神药号金公，金公尔是铅，本向铅裹蒙。 分明向君说，迷者又忽忽，点汞安铅裹，金花约略同，此花不是药，徒自枉抛功。 此者神仙术，何曾不大通，熟念《参同契》，仍依古类融，但得真铅理，修持必见终。 又铅汞合天地，修作大还丹，丹成芽自见，非此实为难。 太古真人说，如今得见欢，方知神不诳，须信道将安。 中有五彩灵，变化伏其般，十月脱胎出，令人见可观。 为报荣华子，百年凋与残，何空弃世，兀兀道将阑。 孰说君犹，词虚理更漫。 唠见南山尘，积年为丘山。 茫茫苦海中，生死成波澜，自古帝王居，至今何足看。 又白液炉中化，黄芽变渐成，忆初相见日，难看水银形。 阳极生阴火，火衰阳气并，自变紫河车，服食堪长生。 又一个月，白液初凝恰如雪； 两个月，似乳为酥渐渐结； 三个月，半含药绽垂珠劣； 四个月，二物抱持如点血； 五个月，飞腾恋母声呜咽； 六个月，行到子宫阴气绝，色似鹅儿分明别； 七个月，垂阴受气手足厥； 八个月，欲成藏府金凝血； 九个月，点点残珠长毛发，十个月，母子分明欲相别。 此时母困子体全，似见颜容尚如雪。 铅脱胞后，铅面肉白如雪。 更向炉中温养之，名为食乳肌肤悦，出儿毒气当依诀。 药已成，入赤色，六十日出毒服食。 此药如儿在母胎，精神爽朗分肌骨。 劝君学者须精微，莫枉悠悠抛日月。 此中妙，不能说，有次第，莫亏越，但能修得黄芽成，变转之功不休歇。 食长生，换白发，有白银，救孤拙，仁者得之修不阙。 与道契，宿绿探，传之得人正在心。 非道者，罪将沈，得亦为灾祸害侵。 关造化，不容易，取次不得轻传付。 君不闻古人语，妄有传之殃七祖。 君须信，不在疑，肾者通明必得之。 今日嘱君千万意，历历结盟当记之。 阳初复，十一月用下火也。 阴起妮，十一月至四月阳极，至五月一阴生，转大也。 炉寄中央戊己。 土鼎中，上下互相奏谨守，固之勿令走，消息不失看节候。 有龙有虎相奔骤，婴儿寂寂颜初幼，由母养之母肥瘦，子成因母长相救。 阳极乾，阴极坤，乾四象，易之门，六十四卦修中尊。",
      "translated_text": "Xu Jun, Master Wei, and Lord Chungan—these three each mastered the supreme arts and were disciples of the immortals. Xie Xuanchong and Su Tang, the two youths, were likewise adepts of feather-transformation and golden elixirs, known to all—what need is there to speak further of them? Moreover, in famous mountains and bustling markets, there are often those who dwell beyond the mundane, concealing their names and identities amidst the worldly crowd. Unless one shares the same Dao, how could one recognize them? Be cautious—do not lightly disclose or slight these matters, lest you incur fault and bring slander upon the golden elixir and the sages, plunging yourself into the prison of a thousand kalpas!\n\nHave you not heard what the *Cantong qi* says: \"Gold and cinnabar serve as the foundation, harmonized with mercury.\" These two substances are inherently numinous! And again: \"If one does not use medicinal herbs but the Five Phases, these are none other than Metal, Wood, Water, Fire, and Earth.\" Have you not also heard: \"White Horse Tooth is fine cinnabar; at *mao* and *you*, the two eights unite as one.\" Or that Huainan refined *qiushi*, and the Yellow Emperor praised *jinhua*? And further: \"Lead is not the sprout, the sprout is not lead; true lead and true cinnabar, when subdued and refined, become one family.\" As the fire cycles near nine revolutions, the Yellow Sprout is thus formed. Or that \"fire flowers into white medicine, red flowers flow as mercury,\" and the stones naturally correspond? \"Flowing pearls enter the body, the tiger devours them—who knows where to find the Golden Lord?\"\n\nSince ancient times, those who refine the elixir have struggled to fathom the nature of lead and mercury. Yet if one grasps this principle, the work of refinement becomes spontaneously numinous. \"A solitary yang cannot transform alone; a solitary yin cannot achieve completion. Originally, these two substances were one—naturally, they transform the body and reveal its brightness.\" When dragon and tiger meet, how could they not attend to one another? \"White liquid and the other mutually consume, consuming each other as husband and wife.\" Following their transformation, the Yellow Sprout is born, ever dependent on the Later Earth. If one obtains the Purple River Chariot, one becomes the herald of immortals.\n\nOnce the divine elixir’s secret is mastered, its numinous use lies within one’s power. \"Life and death rest in my hands\"—ponder this, and you will know it to be true. Without the proper method, refining the elixir will only exhaust the heart and spirit year after year. Do not waste effort on dead lead and mercury, casting your labor to the dust. \"Within the heavens, earth, sun, and moon, the divine medicine is called the Golden Lord. The Golden Lord is none other than lead, originally concealed within it.\" Clearly I tell you this, yet the deluded remain heedless. \"To fix mercury within lead, the golden flowers roughly correspond—yet these flowers are not the medicine, and to pursue them is to squander effort in vain.\"\n\nThese are the arts of immortals—how could they not be profoundly efficacious? Study the *Cantong qi* closely, and follow the ancient categories in harmony. Once you grasp the principle of true lead, your practice will surely reach its culmination. \"Lead and mercury unite with heaven and earth to refine the Great Return Elixir. When the elixir is complete, the sprout appears of itself—without this, success is truly difficult.\" The True One of Great Antiquity spoke thus; now, having witnessed it, I rejoice. Only then does one know the spirits do not deceive, and one must trust that the Dao will bring peace. \"Within it lies the five-colored numen, its transformations subduing all patterns. After ten months, the embryo emerges—whoever beholds it is awestruck.\"\n\nI report to you, child of glory: a hundred years wither and decay. Why idly abandon the world, listlessly letting the Dao slip away? Who says your words are empty, your principles mere rambling? I see the dust of Mount Nan, piled over the years into a mountain. Amidst the vast苦 sea, birth and death churn as waves. Since ancient times, even the dwellings of emperors and kings—what remains of them today?\n\n\"In the crucible, the white liquid transforms; the Yellow Sprout gradually takes form.\" Recall the day they first met—how difficult it was to discern the shape of mercury! \"When yang reaches its extreme, yin fire is born; when fire wanes, yang qi merges. Of itself, it becomes the Purple River Chariot—consuming it grants longevity.\"\n\nIn the first month, the white liquid congeals like snow; in the second, it resembles milk curdling into butter, slowly solidifying. By the third month, the medicine is half-contained, buds unfurling like dangling pearls. In the fourth, the two substances embrace, like blood being infused. By the fifth, they soar and cling to their mother, their cries mournful. In the sixth, they reach the womb, yin qi severed—its color distinct, like that of a gosling. In the seventh, yin descends, receiving qi, hands and feet stiffening. By the eighth, the organs and viscera form, blood congealing like gold. In the ninth, residual pearls grow hair; by the tenth, mother and child are poised to part. At this time, the mother is weary, but the child’s body is whole—its complexion still as snow.\n\nAfter the lead sheds its placenta, its surface is white as snow. Further temper it in the crucible, a process called \"nursing with milk,\" which delights the skin and flesh. Expel the child’s toxic qi according to the method. When the medicine is complete, it turns crimson—after sixty days, the toxins are purged, and it may be consumed. This medicine, like a child in the womb, sharpens the spirit and clarifies the bones and flesh.\n\nI urge you, seeker: you must be meticulous. Do not idly squander your days and months. The subtleties herein cannot be fully expressed; there is an order—do not neglect or transgress it. If you can refine the Yellow Sprout to completion, its transformative power will never cease. Consuming it grants longevity, turns white hair black, produces silver, aids the lonely and inept. The virtuous who obtain it never falter in their practice. In harmony with the Dao, they delve into past causes, transmitting it only to the worthy, whose hearts are true.\n\nThose who lack the Dao—if they incur fault, they will sink into calamity, even if they gain it, misfortune will assail them. To grasp the workings of creation is no easy task; it cannot be casually transmitted. Have you not heard the ancients’ words? To recklessly transmit it brings disaster upon seven generations. You must believe, not doubt. Only those whose kidneys are luminous and unobstructed will attain it.\n\nToday, I charge you with a thousand cautions—remember them clearly, as if bound by a solemn pact. \"Yang begins its return in the eleventh month, when the fire is first applied. Yin arises in the fifth month, after yang reaches its peak from the eleventh to the fourth month. The crucible is entrusted to the central *wu* and *ji* (Earth). Within the earthen cauldron, above and below interact—guard it diligently, secure it to prevent escape. Observe the seasons and nodes without fail.\"\n\n\"Dragon and tiger race together; the infant is tranquil, its countenance youthful. The mother’s nurturing determines her own plumpness or emaciation, and the child’s completion depends on the mother’s aid.\" When yang reaches *qian*, yin reaches *kun*; *qian* embodies the four images, the gate of the *Yi*. The sixty-four hexagrams are revered in the midst of practice.",
      "overlap_context": "hese truths? Even the five grains, though decaying matter, nourish spirit and qi to sustain life—how much more so the divine elixir, with its primal and mysterious virtue, which exchanges mortal flesh for the immortal, sheds sickly form, preserves youth, and extends life? To you I speak of these things—what is seen is known! I need not expound at length, for such details would only burden the discourse. The remaining subtleties and mysteries of the void are all inscribed upon the golden tablets.",
      "start_char": 3298,
      "end_char": 4510,
      "start_sentence": 141,
      "end_sentence": 201,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.854737997055054,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\丹论诀旨心鉴.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "龙虎相喷自相吞，立生定位此中存，水火为媒掬我魂，阴阳养我明晨昏，八节运移寒与温，看看渐交黄芽根。 日日相催母感恩，因之结实立真门，千秋万岁生子孙，审藏秘慎勿须论。 此道玄微未可言，时人笑道浊昏浑。 宁可探居市与村，莫将妙药示凡者，见之谤之言语谊。 君切记，秘而藏之可金匮，长生之术传道人，自有天官录名字。 大还丹宗旨章第四 夫言还丹者，即可服食而仙也，自古之天人留此卫，降下人间，传付黄帝，黄帝得之，白日鼎湖升仙。 若古往神仙，不一一具言也。 夫论还丹，皆至药而为之，即丹砂之玄珠，金铅汞虎之灵异，有上仙自然之还丹，生太阳背阴向阳之山。 丹砂皆生南方，不生北方之地，自然还丹，是流汞抱金公而孕也。 有丹砂处皆有铅及银，四千三百二十年丹成，左雄右雌，上有丹砂，下有曾青，抱持日月阴阳气，四千三百二十年，故乃黑足，而成上仙天人还丹。 下界神仙，修炼铅汞一年成。 取十一月一阳生而下火，至来年十一月成丹，象上界仙人、天人、圣人取食者还丹。 故为自然还丹，是仙人、天人、圣人取食之，今修者象而成之大千之数，服之亦长生羽化，与天同功。 问日：何以一年象之天生还丹之数？ 答曰：上界】 日一夜，为人问五年，且人间一年十二月，三百六十日，一月三十日，又一日十二时，一月三百六十时，合一年四千三百二十时，象天生自然还丹。 此亦上界真仙，流传人问，有依法度，日月精气，四时运移，得成服之，皆延年上升。 上士修真契理，羽化上升； 中士服之地仙； 下士延年长生不死。 服食之门，别有法矣！ . 玄记章第五",
      "translated_text": "Dragon and tiger spray each other, mutually devouring; in this fixed position they arise and abide. Water and fire serve as mediators, gathering my soul; yin and yang nurture me through dawn and dusk. The eight solar terms shift between cold and warmth—watch closely as the yellow sprout’s root gradually takes form. Day by day, the mother’s gratitude quickens; through this, the fruit solidifies and the true gate is established. For a thousand autumns and ten thousand years, it begets descendants—guard it in secrecy, take care, and speak no further of it.\n\nThis Dao is profound and subtle, beyond words. The people of this age mock it as turbid and confused. Better to dwell in seclusion among markets and villages than to reveal the wondrous elixir to the vulgar, who upon seeing it would slander it with reckless speech. You must remember: conceal it well, as if sealing it in a golden casket. The art of longevity is passed only to those who walk the Way, for heaven’s officials have already recorded their names.\n\n**Chapter Four: The Essence of the Great Return Elixir**\nTo speak of the Return Elixir is to speak of an elixir that, when ingested, grants transcendence. Since ancient times, the immortals of heaven have preserved this treasure, bestowing it upon the human realm. It was transmitted to the Yellow Emperor, who, having attained it, ascended to heaven in broad daylight at Mount Dinghu. The ancient immortals who achieved this are too numerous to name individually.\n\nThe Return Elixir is forged from the most potent medicines: the mysterious pearl of cinnabar, the numinous marvels of golden lead and mercurial tiger. There exists a celestial Return Elixir, naturally formed in the mountains where the sun’s back faces yin and its front faces yang. Cinnabar is born only in the south, never in the northern lands. The natural Return Elixir arises when flowing mercury embraces the Golden Elder and conceives. Where cinnabar is found, lead and silver also exist. After four thousand three hundred and twenty years, the elixir matures—male on the left, female on the right—with cinnabar above and malachite below, cradling the qi of the sun and moon, yin and yang. After another four thousand three hundred and twenty years, its base turns black, and the celestial Return Elixir of the immortals is complete.\n\nFor earthbound immortals, refining lead and mercury takes but a year. Fire is applied in the eleventh month, when yang first revives, and the elixir is completed by the following eleventh month—a cycle mirroring the celestial immortals, heavenly beings, and sages who partake of the natural Return Elixir. Thus, the natural Return Elixir is consumed by immortals, heavenly beings, and sages, while modern practitioners emulate this process to achieve the same end. Ingesting it grants longevity and transformation, equaling the heavens in merit.\n\n**Question:** Why does a single year mirror the celestial cycle of the Return Elixir’s formation?\n**Answer:** In the heavens, one day and night equals five years among humans. Here below, one year consists of twelve months, three hundred sixty days, one month of thirty days, and one day of twelve hours—totaling three hundred sixty hours per month. Thus, a year comprises four thousand three hundred twenty hours, mirroring the celestial formation of the natural Return Elixir. This method, passed down by the true immortals of the heavens, allows those on earth who follow the proper discipline to refine the essence of the sun and moon, the qi of the four seasons, and achieve longevity through ingestion. The superior practitioner aligns with truth, transforming and ascending; the middling practitioner becomes an earthbound immortal; the inferior practitioner attains extended life without death. The gateway of ingestion has its own distinct methods.\n\n**Chapter Five: The Mysterious Record**",
      "overlap_context": "cauldron, above and below interact—guard it diligently, secure it to prevent escape. Observe the seasons and nodes without fail.\"\n\n\"Dragon and tiger race together; the infant is tranquil, its countenance youthful. The mother’s nurturing determines her own plumpness or emaciation, and the child’s completion depends on the mother’s aid.\" When yang reaches *qian*, yin reaches *kun*; *qian* embodies the four images, the gate of the *Yi*. The sixty-four hexagrams are revered in the midst of practice.",
      "start_char": 4510,
      "end_char": 5140,
      "start_sentence": 202,
      "end_sentence": 224,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.8350567817688,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\丹论诀旨心鉴.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "赤松了曰：丹砂之精，有白有朱，含火得白是虎，号朱是火丹，丹中生汞，三者同一体也。 白虎金，象西方之艮，含五彩之瑞，包八石之异。 铅是白虎，与汞为匹敌也。 二物为之君臣，天地为夫妻，为子母，神而妙之，不与三黄同，不与八石类。 迥然造化而修制之，为还丹也。 余昔遇道人传授，修之合符，已至羽化，敢歌诀之。 歌曰：神术妙难测，铅汞人不识，铅汞天地精，阴阳天地力，功归於戊己，能生一切食。 万物用土功，土是母之极，母养一切子，子亦因母植。 三物自通灵，二气玄元直，功在城垣固，务在坚柔识。 必在於人成，由人所心忆，心灵药自灵，心迷药难测。 至道至心虚，玄中妙难息，智了得宗源，他年致云翼。 梁朝四公子诀有歌曰：铅汞合神功，交归太玄旨，全在五行中，尽入三才智。 神仙留至门，服食令人异，若得真铅门，神同自然矣。 丹论诀旨心鉴竟",
      "translated_text": "Chisongzi said: The essence of cinnabar contains both white and vermilion. When it embraces fire and turns white, it is the White Tiger; when it is called vermilion, it is the Fire Elixir. Mercury is born within cinnabar—these three share a single body. The White Tiger is metal, symbolizing the *gen* of the western direction, containing the auspiciousness of the five colors and encompassing the marvels of the eight minerals. Lead is the White Tiger, matched as an equal to mercury. These two substances serve as sovereign and minister; heaven and earth as husband and wife, as mother and child. Refined with divine subtlety, they do not belong to the Three Yellows nor to the category of the eight minerals. Distinctly shaped by creation and cultivated through refinement, they become the Return Elixir.\n\nIn the past, I encountered a Daoist who transmitted this teaching to me. After practicing it in accordance with the method, I attained transformation and ascension. I dare to sing its secrets in verse:\n\nA divine art, wondrous and hard to fathom,\nLead and mercury—unknown to men.\nLead and mercury are the essence of heaven and earth,\nThe power of yin and yang, the strength of heaven and earth.\nTheir merit returns to *wu* and *ji*,\nAble to generate all sustenance.\nAll things rely on the work of earth,\nFor earth is the ultimate mother,\nNurturing all her children,\nAnd children, too, are rooted in their mother.\nThe Three Substances naturally attain numinosity,\nThe two *qi* flow directly from the mysterious origin.\nTheir efficacy lies in fortifying the city walls,\nTheir task in discerning firmness and softness.\nSuccess depends on human achievement,\nDerived from what the heart recalls.\nWhen the heart is numinous, the elixir becomes numinous;\nWhen the heart is deluded, the elixir remains unfathomable.\nThe supreme Dao resides in an empty heart,\nWithin the mysterious, its wonders never cease.\nThose of wisdom who grasp its source\nShall one day ascend on cloud-borne wings.\n\nThe verse of the Four Noble Sons of the Liang Dynasty states:\nLead and mercury unite in divine work,\nTheir union returns to the supreme mystery.\nWholly within the Five Phases,\nFully encompassed by the wisdom of the Three Powers.\nThe immortals leave this gateway of perfection,\nIngestion makes one extraordinary.\nIf one attains the true lead’s gate,\nOne’s spirit becomes one with nature.\n\nHere ends *The Heart-Mirror of Elixir Discourse and Secret Essentials*.",
      "overlap_context": " down by the true immortals of the heavens, allows those on earth who follow the proper discipline to refine the essence of the sun and moon, the qi of the four seasons, and achieve longevity through ingestion. The superior practitioner aligns with truth, transforming and ascending; the middling practitioner becomes an earthbound immortal; the inferior practitioner attains extended life without death. The gateway of ingestion has its own distinct methods.\n\n**Chapter Five: The Mysterious Record**",
      "start_char": 5140,
      "end_char": 5491,
      "start_sentence": 225,
      "end_sentence": 238,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.004297256469727,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\丹论诀旨心鉴.txt",
        "category": "众术类"
      }
    }
  ]
}