{
  "source_id": "九天应元雷声普化天尊玉枢宝忏",
  "source_file": "chunked_daozang\\九天应元雷声普化天尊玉枢宝忏.json",
  "total_chunks": 4,
  "total_original_chars": 3314,
  "total_translated_chars": 22673,
  "total_translation_time": 115.16643953323364,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\威仪类\\九天应元雷声普化天尊玉枢宝忏.txt",
    "category": "威仪类"
  },
  "full_translation": "*The Jade Pivot Precious Repentance of the Nine Heavens Responsive Primordial Thunder-Sound Universal Transformation Heavenly Worthy*\n\n**Title:** *The Jade Pivot Precious Repentance of the Nine Heavens Responsive Primordial Thunder-Sound Universal Transformation Heavenly Worthy*\n**Author:** Unknown\nTwo repentance texts in one fascicle.\n**Source text:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Weiyi* Category.\n\n---\n\n*The Jade Pivot Precious Repentance of the Nine Heavens Responsive Primordial Thunder-Sound Universal Transformation Heavenly Worthy*\n\nThe ritual proceeds according to protocol.\n\nYour servant, [Name] of such-and-such office, with reverence and awe, bows his head to the ground, prostrates himself, and again bows to address the assembly:\n\nThe Three Clarities Supreme Lords,\nThe Ten Poles Lofty Perfected,\nThe Most High Divine Empyrean,\nThe Eight Chambers August Lords,\nThe Nine Heavens Responsive Primordial Thunder-Sound Universal Transformation Heavenly Worthy,\nThe Ministers, Masters, Envoys, and Attendants of the Nine Heavens Responsive Primordial Palace,\nAll the Sagely Perfected of the Jade Empyrean’s Inner Courts,\nThe Eastern and Western Hua Terraces,\nThe Mysterious Halls and Wondrous Pavilions,\nThe Four Palaces and Six Courts,\nThe Bureaus and Offices in their array,\nThe Sagely Perfected and Immortals who assist in transformation and govern affairs,\nThe Envoys of the Nine Heavens Thunder Gate,\nThe Registrars of Correction and Record,\nThe Inspectors of Integrity,\nThe Directors of the Bureau of Excess Punishment,\nThe Directors of the Bureau of Accumulated Detention,\nThe Directors of the Bureau of Hidden Grievances,\nThe Directors of the Bureau of Karmic Retribution,\nThe Thunder Master, Radiant Barge True Lord,\nThe Unerring Judge and Registrars,\nThe Officials of the Thunder Department,\nThe True Spirits of the Three Realms—\n\nMay Your vast compassion turn and gaze upon us with luminous discernment.\n\nYour devoted servant [Name] humbly presents this offering.\n\nHear now the Crimson Writs of Jade Characters—of old, the Primordial Beginning opened the Azure Vault to deliver humankind. The Phoenix Script and Dragon Charts—our Patriarch Master unfolded transformation from the Divine Empyrean. With reverence we recall the Great Sage of the Nine Heavens’ Pure Radiance, the incarnate transformation of the Jade Pure True King, whose forms pervade the Ten Directions and whose mind spans the Three Realms, who rescues sentient beings from suffering and lifts the submerged lands from their depths. Across the Thirty-Six Heavens, each heaven yields to His sovereign authority; through the Fifteen Hundred Kalpas, each kalpa unfolds His compassionate transformation. Should one but summon the slightest sincerity in invocation, all ten thousand vows shall accord with the heart.\n\nWe reflect anew upon ourselves—through kalpas uncounted, we have borne the dust of toil; through lives manifold, we have accumulated the filth of karma. Greed, wrath, delusion, and desire sprout in the space between standing and acting; killing, stealing, sexual misconduct, and deceit take shape in the instant of thought’s arising. Three transgressions of the body, four of the mouth—each fault of others becomes a hundred of our own, each fault of self a thousand. This leaky, illusory form harbors boundless offenses; the sea of right and wrong stretches wide, the mountain of self and others looms high. Without recourse to repentance and exaltation, how may we presume upon mercy and pardon?\n\nWith reverence we recall the Nine Heavens’ Responsive Primordial Thunder-Voice Universal Transformation Heavenly Worthy, Father of all beings, Master of the ten thousand spirits. Moved by those lost upon the path, He gazes with discernment upon those who turn toward Him, never forgetting the vows sworn in the Great Canopy, and graciously assents to the humble exaltation of this petty servant. From afar He halts His floating chariot in the empty sky, deigning to review our records. We, Your servants, presumptuously brave Your celestial majesty; our lowly hearts can scarcely contain their fervent longing. In utmost sincerity and deepest devotion, we direct our single-minded intent to prostrate in homage.\n\nThe Heavenly Worthy of Golden Countenance and Jade Form—\nWith devoted heart we take refuge and bow in homage.\n\nWithin the Sacred Precincts of Jade Purity, in the Celestial Palace of the Clear Subtlety Heaven, amid the Verdant Canopy and Misty Terrace, above the Forest of Purity and Clouds of Radiance, He manifests the semblance of conditioned existence, wielding the divine powers of the Unbounded. He expounds the true and mysterious, shattering the barriers of being and non-being, form and emptiness. He delivers and uplifts all classes of beings, erasing distinctions of wisdom and folly, high and low. His wondrous functioning eludes scrutiny; His numinous mechanism defies measure. Vast compassion, vast vows, Great Sage, Great Compassion, immeasurable deliverer of humankind—Primordial Heavenly Worthy of the Origin.\nWith devoted heart we take refuge and bow in homage.\n\nWithin the True Precincts of Supreme Purity, in the Celestial Palace of the Yu-Yu Heaven, amid the Purple Tenuity Jade Terrace, above the Dark Capital and Jade Metropolis, He inherits the lineage of the Primordial Sovereign of Emptiness, surpassing the root and stock of the Western Na玉国. Within the grain of millet, the pearl, He draws forth the essence of the true and mysterious; in the Fragrant Grove Garden, He repeatedly discourses upon the secret essentials of the guideposts. His wondrous virtue defies thought; His divine powers elude discourse.\n\nGreat Compassion, Great Vows, Great Sage, Great Mercy, immeasurable deliverer of humankind—Numinous Treasure Heavenly Worthy.\nWith devoted heart we take refuge and bow in homage.\n\nWithin the Transcendent Precincts of Supreme Purity, in the Celestial Palace of the Great Crimson Heaven, high above the towering Golden Portals, far beyond the boundless layers of cloud and sky.\nBorn across measureless kalpas, He expounds the Dharma amid twelve thousand heavens. Five thousand secret words fuse the wondrous Dao of the Three Powers; eighty and more salvations gather the multitudes of the Six Destinies. His sagely virtue lofty and exalted, His mysterious efficacy vast and profound.\n\nGreat Compassion, Great Vows, Great Sage, Great Mercy, immeasurable deliverer of humankind—Incarnate Heavenly Worthy.\nLet each devotee reverently believe and\nwith devoted heart take refuge in the Dao-Treasures of the Ten Directions, vowing that all beings may turn their minds toward them and offer sincere homage;\nwith devoted heart take refuge in the Sutra-Treasures of the Ten Directions, vowing that all beings may awaken understanding and receive, uphold, recite, and chant;\nwith devoted heart take refuge in the Master-Treasures of the Ten Directions, vowing that all beings may universally ascend the Dharma-bridge, free from all obstacles.\n\nLet all within the ritual precinct each direct their minds and perform repentance according to the Dharma.\n\nAt that time, the Heavenly Worthy of Universal Transformation through the Thunderous Voice of the Nine Heavens was in the Jade Purity Heaven, together with the Celestial Sovereigns of the Ten Directions, assembled upon the seven-jeweled layered terrace of Jade Brahma. Then the Thunder Master, Elder Hao, stepped forth from the ranks and addressed Him, requesting the proclamation of the essentials of the Dao.\n\nThereupon, the Heavenly Worthy sat upon the Nine-Phoenix Cinnabar Cloud Throne, raised the Golden Radiance Ruyi in His hand, and expounded the *Jade Pivot Precious Sutra*. At the hour of *si*, the Heavenly Worthy declared: \"In future ages, should any among the multitude of beings hear My name and silently contemplate it in their minds, uttering the invocation 'Heavenly Worthy of Universal Transformation through the Thunderous Voice of the Nine Heavens'—whether once, thirty-five times, or a thousand or ten thousand times—I shall manifest My form. Throughout the Ten Directions and the Three Realms, I shall direct My mind, ensuring that all who invoke My name attain their desires. Across the Ten Directions and Three Realms, in all heavens and earths, the sun, moon, and stars, mountains, rivers, grasses, and trees, creatures that fly, crawl, or move, whether sentient or insentient, devas, dragons, ghosts, and spirits—should any hear the names of these beings and any fail to comply, I shall sever their heads, carve out their hearts, and reduce them to fine dust.\"\n\n\"Now, Your disciples, so-and-so and others, having received boundless grace across kalpas and been transformed across lifetimes, regret that our foolish and deluded natures have accumulated deep and weighty transgressions. How dare we not confess and repent? Seeking original forgiveness, we follow the sacred teachings, exerting ourselves in remorseful reflection, praying to extinguish sins and dispel transgressions, hoping to avert calamities and accumulate blessings. As the mind responds to thoughts, may we realize sageliness and attain perfection.\"\n\n\"We reverently beseech the Heavenly Worthy’s great compassion, the Heavenly Worthy’s great sagacity, Parent of all beings, Master of the myriad spirits, to bestow the radiance of Your grace. Witness our repentance, that our prayers may be answered and our communion realized.\"\n\n\"We, Your humble servants, reverently and devotedly prostrate in homage.\"\n\nWith devoted heart we take refuge and bow in homage to the Heavenly Worthy of the Nine Heavens’ Responsive Origin Prefecture, Supreme Jade Purity King, who manifests His form to fill the Ten Directions and discourses upon the Dao seated upon the Nine Phoenixes. Above the thirty-six heavens, He peruses the precious scriptures and examines the jade texts. Fifteen hundred kalpas ago, He held the rank of Supreme Perfected and wielded the authority of Great Transformation. Raising the Golden Radiance Ruyi, He proclaims the *Jade Pivot Precious Sutra*. Those who defy Him are reduced to fine dust; His commands are swift as wind and fire. With a pure and tranquil mind, He fulfills His great vows; with the power of wisdom, He subdues all demons. He governs the Five Thunders and directs His mind across the Three Realms. Parent of all beings, Master of the myriad spirits, Great Sage, Great Mercy, Supreme Sovereign, Supreme Dao—Heavenly Worthy of Universal Transformation through the Thunderous Voice of the Nine Heavens.\n\nEach bows once.\n\n\"We, the Dharma assembly, with devoted hearts take refuge in body, spirit, and life to the Divine Empyrean, offering sincerity to the Jade Prefecture. Again, we recall that Your disciples, so-and-so and others, of impure mortal substance, mere walking corpses of flesh, have accumulated sins as vast as mountains and seas across kalpas to this day. In mind, the three evil deeds: greed, hatred, and delusion. In body, the three evil deeds: killing, stealing, and sexual misconduct. In speech, the four evil deeds: frivolous speech, falsehood, divisive words, and harsh language. Whether arising in thought or moving in mind, we have indulged in unwholesome actions, offending Heaven and Earth, defiling the sun and moon, reviling wind and rain, exposing ourselves to the stars, betraying rulers and teachers, dishonoring parents, deceiving friends and acquaintances, scorning neighbors, harming living beings, wasting grain, using false weights and measures, deceiving sages, enforcing cruel laws, injuring birds and beasts, engaging in clandestine lust and theft, aiding the wicked, coveting honor, oppressing the weak, incurring the wrath of Heaven and Earth, provoking the jealousy of ghosts and the hatred of spirits.\"\n\n\"From this day forward, we repent and vow to take refuge forever. We humbly pray for the universal bestowal of compassion, the gracious granting of forgiveness, shelter and protection, and the gift of life and wholeness.\"\n\n\"We, Your humble servants, with devoted hearts prostrate and bow in gratitude to the Supreme Orthodox Three Treasures.\"\n\nEach recites the *Nine Heavens’ Decree* and bows once.\n\nWith devoted heart we take refuge and bow in homage to the Heavenly Worthy of Universal Transformation through the Thunderous Voice of the Nine Heavens—nine invocations, nine bows.\n\n\"We, the Dharma assembly, with devoted hearts take refuge in body, spirit, and life to the Divine Empyrean, offering sincerity to the Jade Prefecture. Again, we recall that Your disciples, so-and-so and others, of impure mortal substance, mere walking corpses of flesh, have accumulated sins as vast as mountains and seas across kalpas to this day. Perhaps we suffer from the inauspiciousness of the Five Phases, the malevolence of the Nine Luminaries, encountering years of punishment and conflict, fated clashes, or adversity in our undertakings, peril in our actions. Perhaps we are bedridden with chronic illness or oppressed by persistent afflictions. Perhaps we are afflicted by curses, oaths, or the consequences of unpaid debts. Transgressions from three lifetimes, enmities from different kalpas. Perhaps in our own cultivation, others have altered the site, offending the Nine Mounds’ Earth Sovereigns. Yellowing of the body, life-threatening perils, official talismans, malicious speech, the Sword Peak, Flying廉, the twenty-four positions, the twelve hundred spirits—any movement may provoke disputes and lawsuits.\"\n\n\"From this day forward, we repent and vow to take refuge forever. We humbly pray for the universal bestowal of compassion, the gracious granting of forgiveness, shelter and protection, and the gift of life and wholeness.\"\n\n\"We, Your humble servants, with devoted hearts prostrate and bow in gratitude to the Supreme Orthodox Three Treasures.\"\n\nHaving completed the recitation of the *Nine Heavens’ Edicts*, all bow once.\n\nWith devoted hearts, we take refuge and pay homage:\nTo the *Celestial Worthy of Universal Transformation Through the Thunder’s Resonance of the Nine Heavens’ Response to the Primordial*, nine prostrations with nine invocations.\n\nWe, the ritual assembly, with devoted hearts take refuge in body, refuge in spirit, refuge in life.\nTo the *Divine Empyrean*, we offer sincerity at the *Jade Treasury*.\n\nWe earnestly reflect upon us, Your disciples—beings of impure flesh, mere walking corpses—who, across kalpas until now, have amassed sins as vast as mountains and seas.\nPerhaps we have provoked the wrath of celestial demons, earthly sprites, mountain spirits, or stone specters; the malevolent qi of the Five Phases; the demonic forces of the Three Realms; or the vengeful grudges of temple and shrine spirits.\nPerhaps we have been afflicted by omens sent by crows or rats, curses passed by serpents or insects, or malicious acts like hurling bricks or tiles, casting shadows, or transmitting slanderous whispers.\nPerhaps we have suffered from plagues and contagions, lingering consumptive ailments, vengeful qi of the dead, or ancestral tomb disputes.\nPerhaps our marriages have been inauspicious, our descendants difficult to conceive, our water-and-land rites obstructed, or our karmic retribution inescapable.\nPerhaps we have endured warfare and slaughter, floods and fires, banditry and pillage, or famine and displacement.\n\nFrom this day forward, we repent and vow to take refuge forever.\nWe humbly pray for the universal bestowal of compassion, the gracious granting of forgiveness, shelter and protection, and the gift of life and wholeness.\nWe, Your humble servants, with devoted hearts prostrate and bow in gratitude to the *Supreme Orthodox Three Treasures*.\n\nHaving completed the recitation of the *Nine Heavens’ Edicts*, all bow once.\n\nWith devoted hearts, we take refuge and pay homage:\nTo the *Celestial Worthy of Universal Transformation Through the Thunder’s Resonance of the Nine Heavens’ Response to the Primordial*, nine prostrations with nine invocations.\n\nWe, the ritual assembly, with devoted hearts take refuge in body, refuge in spirit, refuge in life to the *Divine Empyrean*, offering sincerity at the *Jade Treasury*.\n\nWe earnestly reflect upon us, Your disciples—beings of impure flesh, mere walking corpses—who, across kalpas until now, have amassed sins as vast as mountains and seas.\nFortune and misfortune, longevity and premature death, honor and disgrace, prosperity and decay, wealth and emolument, fame and gain, right and wrong, self and others—\nwhether we seek immortality and the Dao, or strive to benefit beings and aid the people, each of our aspirations may be fulfilled, without thwarting our vows.\nYet we fear that in our transgressions, we have committed a thousand faults and ten thousand errors, their depth growing with each passing day, never once confessed.\nPerhaps we have harmed sentient beings or injured living creatures.\nPerhaps we have strayed from the Dao, violated precepts, or transgressed against the teachings.\nHaving been inscribed in the ledgers of life and death, our deeds are recorded in the annals of judgment.\n\nFrom this day forward, we repent and vow to take refuge forever.\nWe humbly pray for the universal bestowal of compassion, the gracious granting of forgiveness, shelter and protection, and the gift of life and wholeness.\nWe, Your humble servants, with devoted hearts prostrate and bow in gratitude to the *Supreme Orthodox Three Treasures*.\n\n*Step into the Void*—with each prostration, one bow.\n\nWith devoted hearts, we take refuge and pay homage:\nTo the *Celestial Worthy of Primordial Unity and Longevity of the Southern Culmen, Sovereign of the Celestial Mandate*;\nTo the *Celestial Worthy of Great Unity and Salvation from Suffering of the Azure Culmen of the Eastern Summit*;\nTo the *Celestial Worthy of the Nine Heavens’ Measureless Master, Deliverer of Lives from the Vermilion Mound*;\nTo the *Celestial Worthy of the Nine Heavens’ Thunder Ancestor, Remover of Disasters and Benefactor of Beings*;\nTo the *Celestial Worthy of the Great Heavenly Emperor of the Jade Green Palace, Guardian Against Kalpic Catastrophes*;\nTo the *Celestial Worthy of the Supreme Great Unity of the Six Heavens’ Abyssal Cavern, Subduer of Demons*;\nTo the *Celestial Worthy of the Heavenly Lord of the Six Waves, Bestower of Dharma and Nourisher of All*;\nTo the *Celestial Worthy of the Marvelous Transformation of the Nine Heavens’ Response, Inspector of Realized Beings and Protector of the Dao*;\nTo the *Celestial Worthy of the Divine Empyrean’s Jade Treasury, Judge of the Palace*;\nTo the *Celestial Worthy of the Jade Treasury’s Attendant, Prime Minister, and Right Minister*;\nTo the *True Lords of the Five Thunder Envoys’ Court*;\nTo the *Heavenly Lord Thunder Master, the Radiant Elder*;\nTo the *Heavenly Lord Thunder Count, the Azure Emperor*;\nTo the *Immortal Assembly of the Jade Pivot Chancery*;\nTo all the *Perfected and Immortals of the Nine Heavens’ Response to the Primordial Palace*;\nTo the *Generals of the Nine Heavens’ Thunder*;\nTo the *Generals of the Five Directions’ Thunder*;\nTo the *Generals of the Eight Directions’ Cloud and Thunder*;\nTo the *Envoys of the Nine Heavens’ Thunder Gate*;\nTo the *Envoys of the Five Directions’ Barbarian Thunder*;\nTo the *Marshal of the Thunder Department’s General Staff*;\nTo the *Officials of the Investigation and Auditing Bureau*;\nTo the *Ministers of the Detention and Arrest Bureau*;\nTo the *Ministers of the Dark Grievances and Retribution Bureau*;\nTo the *Judges of the Deception-Prevention Bureau and the Thunder Department’s Assembly of Officials*;\nTo all the *Perfected, Immortals, and Officials of the Thunder Department’s Various Bureaus*.\n\nHaving completed the rites, all kneel in long prostration to take refuge and repent.\n\nWe, the ritual assembly, with devoted hearts take refuge in body, refuge in spirit, refuge in life to the *Divine Empyrean*, offering sincerity at the *Jade Treasury*.\nWe reverently recall that the Nine Celestial Thrones govern the cosmos, and the various bureaus assist the transformations of the Primordial; the Three Realms drift and wander, while the ranked departments aid the sagely and luminous.\nThis is the pivot of thunder and lightning, the balance of power over beings and things.\nWe earnestly reflect upon ourselves—foolish beings dwelling in this fleeting world—\nwhether our greed, anger, and ignorance remain unsevered, or our thoughts, words, and deeds contradict one another, acting wantonly without shame or remorse.\nWhether we commit transgressions through sight or hearing, or teach others through imagination and thought, we repent for each and every root of sin.\n\nWe humbly pray that the Nine Heavens’ penetrating gaze and the compassion of the assembled sages may bestow the boundless grace of the primordial net, the vast blessings of the Dharma rain.\nMay all sins, great or small, be washed away.\nMay the three karmic actions be purified, the six senses cleansed, blessings extended to all existence, and grace pervade the ten directions.\n\nWe, Your humble servants, with devoted hearts prostrate and bow in gratitude to the *Supreme Orthodox Three Treasures*.\n\n*Ode to the Unsurpassed Jade Clarity King*—Upon Hearing the Sutra:\nHaving heard the sutra, may all beings deeply enter the Dharma gate and take refuge with faith and reverence.\nHaving heard the sutra, may all beings have their myriad sins eradicated and their virtuous sprouts grow.\nHaving heard the sutra, may all beings forever sever delusion and constantly return to the true Dao.\n\nWe have heard that the Dao encompasses heaven and earth, and humanity receives the yin and yang.\nOur existence and sustenance depend upon compassion, and our transgressions may be absolved through reflection.\nWe, Your servants, have come to venerate the *Celestial Worthies*, extolling their sacred names.\nWith a single thought, we beseech the heavens and invoke their mandate; with our entire being, we prostrate in refuge.\nWe reverently hope that the *Celestial Worthies*, in their great sagacity and great compassion, will pardon the faults of a thousand lives and ten thousand kalpas, and bestow the true qi of the Five Thunders.\nMay our heartfelt prayers be answered, our aspirations fulfilled, our desires granted, and our exorcisms effective.\nIn this life and the next, may we always encounter the true cause.\nMay the sentient and insentient alike ascend to the shore of the Dao.\n\nWe prostrate and take refuge in the boundless Great Dao.\n\nThus concludes the *Jade Pivot Precious Repentance to the Celestial Worthy of Universal Transformation Through the Thunder’s Resonance of the Nine Heavens’ Response to the Primordial*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "九天应元雷声普化天尊玉枢宝忏 经名：九天应元雷声普化天专玉枢宝忏。 撰人不祥。 二忏同卷。 底本出处：《正统道藏》洞真部威仪类。 九天应元雷声普化天尊玉枢宝忏 法事如仪 具职臣姓某，诚惶诚恐稽首顿首再拜奏启：三清上帝，十极高真，高上神霄，八宸上帝，九天应元雷声普化天尊，九天应元府卿师使相一切圣真，玉霄内院中司东西华台玄馆妙阁四府六院分曹列局赞化掌事一切圣真神仙，九天雷门使者，纠录典者，廉访典者，掠剩司大夫主者，积逮司大夫主者，幽枉司大夫主者，报应司大夫主者，雷师皓舫真君，莫赚判官典者，雷部官众，三界真灵。 恭望洪慈，洞回昭鉴。 入意臣",
      "translated_text": "*The Jade Pivot Precious Repentance of the Nine Heavens Responsive Primordial Thunder-Sound Universal Transformation Heavenly Worthy*\n\n**Title:** *The Jade Pivot Precious Repentance of the Nine Heavens Responsive Primordial Thunder-Sound Universal Transformation Heavenly Worthy*\n**Author:** Unknown\nTwo repentance texts in one fascicle.\n**Source text:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Weiyi* Category.\n\n---\n\n*The Jade Pivot Precious Repentance of the Nine Heavens Responsive Primordial Thunder-Sound Universal Transformation Heavenly Worthy*\n\nThe ritual proceeds according to protocol.\n\nYour servant, [Name] of such-and-such office, with reverence and awe, bows his head to the ground, prostrates himself, and again bows to address the assembly:\n\nThe Three Clarities Supreme Lords,\nThe Ten Poles Lofty Perfected,\nThe Most High Divine Empyrean,\nThe Eight Chambers August Lords,\nThe Nine Heavens Responsive Primordial Thunder-Sound Universal Transformation Heavenly Worthy,\nThe Ministers, Masters, Envoys, and Attendants of the Nine Heavens Responsive Primordial Palace,\nAll the Sagely Perfected of the Jade Empyrean’s Inner Courts,\nThe Eastern and Western Hua Terraces,\nThe Mysterious Halls and Wondrous Pavilions,\nThe Four Palaces and Six Courts,\nThe Bureaus and Offices in their array,\nThe Sagely Perfected and Immortals who assist in transformation and govern affairs,\nThe Envoys of the Nine Heavens Thunder Gate,\nThe Registrars of Correction and Record,\nThe Inspectors of Integrity,\nThe Directors of the Bureau of Excess Punishment,\nThe Directors of the Bureau of Accumulated Detention,\nThe Directors of the Bureau of Hidden Grievances,\nThe Directors of the Bureau of Karmic Retribution,\nThe Thunder Master, Radiant Barge True Lord,\nThe Unerring Judge and Registrars,\nThe Officials of the Thunder Department,\nThe True Spirits of the Three Realms—\n\nMay Your vast compassion turn and gaze upon us with luminous discernment.\n\nYour devoted servant [Name] humbly presents this offering.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 274,
      "start_sentence": 0,
      "end_sentence": 9,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.914613723754883,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\九天应元雷声普化天尊玉枢宝忏.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "闻赤书玉字，昔元始开碧落以度人。 凤篆龙章，我祖师由神霄而阐化。 恭惟九天贞明之大圣，玉清真王之化身，分形十方，运心三界，拯众生之苦恼，挈下土之沉沦。 三十六天，天天归主宰之权。 千五百劫，劫劫运慈悲之化。 苟致寸忱而称念，悉令万愿以从心。 重念某等亿劫尘劳，多生业垢，贪嗔痴爱萌於立身行己之间，杀盗邪淫形於举心动念之际。 身三口四，人百己千，有漏幻躯才无边罪障，是非海阔，人我山高，非仗忏扬，曷叨恩宥。 恭惟九天应元雷声普化天尊，为群生父，为万灵师。 矜念迷途，鉴观归向，不忘大罗之誓愿，特允小兆之赞扬。 遥驻浮空曲，垂省录。 臣干冒天威，下情无任激切俟。 恩之至虔，运一诚志心朝礼。 金容玉相天尊 志心皈命礼 玉清圣境，清微天宫，郁罗萧台之中，森罗浄雾之上。 现有为之梵相，具无极之神通。 敷演真玄，破无有色空之碍。 拯提趣类，绝智愚高下之分。 妙用难窥，灵机罔测。 大悲大愿，大圣大慈，无量度人，元始天尊。 志心皈命礼 上清真境，禹余天宫，紫微琼台之中，玄都玉京之上。 接元始虚皇之统系，超西那玉国之根苗。 入黍米珠，尽挹真玄之精粹。 在香林苑，屡谈秘要之荃蹄。 妙德难思，神通莫议。 。",
      "translated_text": "Hear now the Crimson Writs of Jade Characters—of old, the Primordial Beginning opened the Azure Vault to deliver humankind. The Phoenix Script and Dragon Charts—our Patriarch Master unfolded transformation from the Divine Empyrean. With reverence we recall the Great Sage of the Nine Heavens’ Pure Radiance, the incarnate transformation of the Jade Pure True King, whose forms pervade the Ten Directions and whose mind spans the Three Realms, who rescues sentient beings from suffering and lifts the submerged lands from their depths. Across the Thirty-Six Heavens, each heaven yields to His sovereign authority; through the Fifteen Hundred Kalpas, each kalpa unfolds His compassionate transformation. Should one but summon the slightest sincerity in invocation, all ten thousand vows shall accord with the heart.\n\nWe reflect anew upon ourselves—through kalpas uncounted, we have borne the dust of toil; through lives manifold, we have accumulated the filth of karma. Greed, wrath, delusion, and desire sprout in the space between standing and acting; killing, stealing, sexual misconduct, and deceit take shape in the instant of thought’s arising. Three transgressions of the body, four of the mouth—each fault of others becomes a hundred of our own, each fault of self a thousand. This leaky, illusory form harbors boundless offenses; the sea of right and wrong stretches wide, the mountain of self and others looms high. Without recourse to repentance and exaltation, how may we presume upon mercy and pardon?\n\nWith reverence we recall the Nine Heavens’ Responsive Primordial Thunder-Voice Universal Transformation Heavenly Worthy, Father of all beings, Master of the ten thousand spirits. Moved by those lost upon the path, He gazes with discernment upon those who turn toward Him, never forgetting the vows sworn in the Great Canopy, and graciously assents to the humble exaltation of this petty servant. From afar He halts His floating chariot in the empty sky, deigning to review our records. We, Your servants, presumptuously brave Your celestial majesty; our lowly hearts can scarcely contain their fervent longing. In utmost sincerity and deepest devotion, we direct our single-minded intent to prostrate in homage.\n\nThe Heavenly Worthy of Golden Countenance and Jade Form—\nWith devoted heart we take refuge and bow in homage.\n\nWithin the Sacred Precincts of Jade Purity, in the Celestial Palace of the Clear Subtlety Heaven, amid the Verdant Canopy and Misty Terrace, above the Forest of Purity and Clouds of Radiance, He manifests the semblance of conditioned existence, wielding the divine powers of the Unbounded. He expounds the true and mysterious, shattering the barriers of being and non-being, form and emptiness. He delivers and uplifts all classes of beings, erasing distinctions of wisdom and folly, high and low. His wondrous functioning eludes scrutiny; His numinous mechanism defies measure. Vast compassion, vast vows, Great Sage, Great Compassion, immeasurable deliverer of humankind—Primordial Heavenly Worthy of the Origin.\nWith devoted heart we take refuge and bow in homage.\n\nWithin the True Precincts of Supreme Purity, in the Celestial Palace of the Yu-Yu Heaven, amid the Purple Tenuity Jade Terrace, above the Dark Capital and Jade Metropolis, He inherits the lineage of the Primordial Sovereign of Emptiness, surpassing the root and stock of the Western Na玉国. Within the grain of millet, the pearl, He draws forth the essence of the true and mysterious; in the Fragrant Grove Garden, He repeatedly discourses upon the secret essentials of the guideposts. His wondrous virtue defies thought; His divine powers elude discourse.",
      "overlap_context": ",\nThe Directors of the Bureau of Excess Punishment,\nThe Directors of the Bureau of Accumulated Detention,\nThe Directors of the Bureau of Hidden Grievances,\nThe Directors of the Bureau of Karmic Retribution,\nThe Thunder Master, Radiant Barge True Lord,\nThe Unerring Judge and Registrars,\nThe Officials of the Thunder Department,\nThe True Spirits of the Three Realms—\n\nMay Your vast compassion turn and gaze upon us with luminous discernment.\n\nYour devoted servant [Name] humbly presents this offering.",
      "start_char": 274,
      "end_char": 761,
      "start_sentence": 10,
      "end_sentence": 37,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.094177961349487,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\九天应元雷声普化天尊玉枢宝忏.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "大悲大愿，大圣大慈，无量度人，灵宝天尊。 志心皈命礼 太清仙境，大赤天宫，巍巍金阙之高，渺渺重霄之上。 降生於无量数劫，说法於万二千天。 五千秘言，融三才之妙道。 八十余度，接六趣之众生。 圣德崇高，玄功广博。 大悲大愿，大圣大慈，无量度人，降生天尊。 按人各恭信 志心归依十方道宝，当愿众生起心回向，一切信礼。 志心归依十方经宝，当愿众生心开悟解，受持念诵。 志心归依十方师宝，当愿众生普上法桥，元有障碍。 道场众等人各运心礼忏如法 尔时，九天应元雷声普化天尊在玉清天中，与十方诸天帝君，集於玉梵七宝层台。 时有雷师皓翁，越班上白，请宣道要。 於是，天尊坐九凤丹霞之宸，手举金光明之如意，为说玉枢宝经。 巳时，天尊言：若未来世，有诸众生，得闻吾名，但冥心默想作是念，言九天应元雷声普化天尊，或一声，或五七声，或千百声，吾即化形。 十方运心三界，使称名者咸得如意。 十方三界，诸天诸地，日月星辰，山河草木，飞走蠢动，若有知若无知，天龙鬼神，闻诸众生。 一称吾名，如有不顺者，馘首刳心，化为微尘。 以今弟子某等，旷劫受恩，累生蒙化，恨以愚迷之性，积成深重之愆，敢不忏陈。 以干原赦，爰遵教典，力致悔思，祈灭罪以消愆，冀禳灾而集福。 随心应念，证圣成真。 仰惟天尊大慈，天尊大圣，为群生父，为万灵师，俯赐恩光。 鉴今忏悔，庶令所祷，克遂感通。 臣等虔恭，志心朝礼。 志心皈命礼 九天应元府，无上玉清王，化形而满十方，谈道而趺九凤。 三十六天之上，阅宝笈，考琼书。 千五百劫之先，位上真，权大化。 手举金光如意，宣说玉枢宝经。 不顺化作微尘，发号疾如风火。 以清静心而弘大愿，以智惠力而伏诸魔。 总司五雷，运心三界。 群生父，万灵师，大圣大慈，至皇至道，九天应元雷声普化天尊。 毕各一拜 臣法众等，志心皈身皈神皈命神霄，投诚玉府。 重念弟子某等，凡胎浊质，走肉行尸，历劫迨今，罪如山海。 心三恶业，贪嗔愚痴。 身三恶业，杀盗邪淫。 口四恶业，绮语妄言，两舌恶骂。 或起念动心，恣行不善，搪突天地，秽亵日月，毁呵风雨，裸触星辰，背负君师、逆辱父母，欺心朋旧，做睨亲邻，杀害孳生，抛掷米谷，大秤小斗，欺罔圣贤，酷法残刑，伤戕禽畜，私淫暗盗，逞毒助凶，贪诸所荣，欺诸所弱，天嗔地怒，鬼妬神憎。 从今忏谢，永誓归依。 恭愿普运慈悲，曲垂原赦，绥之庇覆，锡以生全。 臣等志心稽首，礼谢无上正真三宝。 众讳九天诰毕各一拜。 志心皈命礼 九天应元雷声普化天尊，九声九拜。 臣法众等志心，皈身皈神皈命神霄，投诚玉府。 重念弟子某等，凡胎浊质，走肉行尸，历劫迨今，罪如山海。 或虑五行奇赛，九曜嵚()，年逢刑冲，运值克战，行藏坎()，动用凶危。 或沉痾伏枕，痼疾压身。 或盟诅咒誓之所招，或债垛负偿之所致。 三世结衅，异劫兴仇。 或自己兴修，他人改卜，有犯九垒土皇。 身黄命煞，官符赤口，剑锋飞廉，二十四位，千二百神，动致口牙，易生狱讼。 从今忏谢，永誓归依。 恭愿普运慈悲，曲垂原赦，绥之庇覆，锡以生全。 臣等志心稽首，礼谢无上正真三宝。",
      "translated_text": "Great Compassion, Great Vows, Great Sage, Great Mercy, immeasurable deliverer of humankind—Numinous Treasure Heavenly Worthy.\nWith devoted heart we take refuge and bow in homage.\n\nWithin the Transcendent Precincts of Supreme Purity, in the Celestial Palace of the Great Crimson Heaven, high above the towering Golden Portals, far beyond the boundless layers of cloud and sky.\nBorn across measureless kalpas, He expounds the Dharma amid twelve thousand heavens. Five thousand secret words fuse the wondrous Dao of the Three Powers; eighty and more salvations gather the multitudes of the Six Destinies. His sagely virtue lofty and exalted, His mysterious efficacy vast and profound.\n\nGreat Compassion, Great Vows, Great Sage, Great Mercy, immeasurable deliverer of humankind—Incarnate Heavenly Worthy.\nLet each devotee reverently believe and\nwith devoted heart take refuge in the Dao-Treasures of the Ten Directions, vowing that all beings may turn their minds toward them and offer sincere homage;\nwith devoted heart take refuge in the Sutra-Treasures of the Ten Directions, vowing that all beings may awaken understanding and receive, uphold, recite, and chant;\nwith devoted heart take refuge in the Master-Treasures of the Ten Directions, vowing that all beings may universally ascend the Dharma-bridge, free from all obstacles.\n\nLet all within the ritual precinct each direct their minds and perform repentance according to the Dharma.\n\nAt that time, the Heavenly Worthy of Universal Transformation through the Thunderous Voice of the Nine Heavens was in the Jade Purity Heaven, together with the Celestial Sovereigns of the Ten Directions, assembled upon the seven-jeweled layered terrace of Jade Brahma. Then the Thunder Master, Elder Hao, stepped forth from the ranks and addressed Him, requesting the proclamation of the essentials of the Dao.\n\nThereupon, the Heavenly Worthy sat upon the Nine-Phoenix Cinnabar Cloud Throne, raised the Golden Radiance Ruyi in His hand, and expounded the *Jade Pivot Precious Sutra*. At the hour of *si*, the Heavenly Worthy declared: \"In future ages, should any among the multitude of beings hear My name and silently contemplate it in their minds, uttering the invocation 'Heavenly Worthy of Universal Transformation through the Thunderous Voice of the Nine Heavens'—whether once, thirty-five times, or a thousand or ten thousand times—I shall manifest My form. Throughout the Ten Directions and the Three Realms, I shall direct My mind, ensuring that all who invoke My name attain their desires. Across the Ten Directions and Three Realms, in all heavens and earths, the sun, moon, and stars, mountains, rivers, grasses, and trees, creatures that fly, crawl, or move, whether sentient or insentient, devas, dragons, ghosts, and spirits—should any hear the names of these beings and any fail to comply, I shall sever their heads, carve out their hearts, and reduce them to fine dust.\"\n\n\"Now, Your disciples, so-and-so and others, having received boundless grace across kalpas and been transformed across lifetimes, regret that our foolish and deluded natures have accumulated deep and weighty transgressions. How dare we not confess and repent? Seeking original forgiveness, we follow the sacred teachings, exerting ourselves in remorseful reflection, praying to extinguish sins and dispel transgressions, hoping to avert calamities and accumulate blessings. As the mind responds to thoughts, may we realize sageliness and attain perfection.\"\n\n\"We reverently beseech the Heavenly Worthy’s great compassion, the Heavenly Worthy’s great sagacity, Parent of all beings, Master of the myriad spirits, to bestow the radiance of Your grace. Witness our repentance, that our prayers may be answered and our communion realized.\"\n\n\"We, Your humble servants, reverently and devotedly prostrate in homage.\"\n\nWith devoted heart we take refuge and bow in homage to the Heavenly Worthy of the Nine Heavens’ Responsive Origin Prefecture, Supreme Jade Purity King, who manifests His form to fill the Ten Directions and discourses upon the Dao seated upon the Nine Phoenixes. Above the thirty-six heavens, He peruses the precious scriptures and examines the jade texts. Fifteen hundred kalpas ago, He held the rank of Supreme Perfected and wielded the authority of Great Transformation. Raising the Golden Radiance Ruyi, He proclaims the *Jade Pivot Precious Sutra*. Those who defy Him are reduced to fine dust; His commands are swift as wind and fire. With a pure and tranquil mind, He fulfills His great vows; with the power of wisdom, He subdues all demons. He governs the Five Thunders and directs His mind across the Three Realms. Parent of all beings, Master of the myriad spirits, Great Sage, Great Mercy, Supreme Sovereign, Supreme Dao—Heavenly Worthy of Universal Transformation through the Thunderous Voice of the Nine Heavens.\n\nEach bows once.\n\n\"We, the Dharma assembly, with devoted hearts take refuge in body, spirit, and life to the Divine Empyrean, offering sincerity to the Jade Prefecture. Again, we recall that Your disciples, so-and-so and others, of impure mortal substance, mere walking corpses of flesh, have accumulated sins as vast as mountains and seas across kalpas to this day. In mind, the three evil deeds: greed, hatred, and delusion. In body, the three evil deeds: killing, stealing, and sexual misconduct. In speech, the four evil deeds: frivolous speech, falsehood, divisive words, and harsh language. Whether arising in thought or moving in mind, we have indulged in unwholesome actions, offending Heaven and Earth, defiling the sun and moon, reviling wind and rain, exposing ourselves to the stars, betraying rulers and teachers, dishonoring parents, deceiving friends and acquaintances, scorning neighbors, harming living beings, wasting grain, using false weights and measures, deceiving sages, enforcing cruel laws, injuring birds and beasts, engaging in clandestine lust and theft, aiding the wicked, coveting honor, oppressing the weak, incurring the wrath of Heaven and Earth, provoking the jealousy of ghosts and the hatred of spirits.\"\n\n\"From this day forward, we repent and vow to take refuge forever. We humbly pray for the universal bestowal of compassion, the gracious granting of forgiveness, shelter and protection, and the gift of life and wholeness.\"\n\n\"We, Your humble servants, with devoted hearts prostrate and bow in gratitude to the Supreme Orthodox Three Treasures.\"\n\nEach recites the *Nine Heavens’ Decree* and bows once.\n\nWith devoted heart we take refuge and bow in homage to the Heavenly Worthy of Universal Transformation through the Thunderous Voice of the Nine Heavens—nine invocations, nine bows.\n\n\"We, the Dharma assembly, with devoted hearts take refuge in body, spirit, and life to the Divine Empyrean, offering sincerity to the Jade Prefecture. Again, we recall that Your disciples, so-and-so and others, of impure mortal substance, mere walking corpses of flesh, have accumulated sins as vast as mountains and seas across kalpas to this day. Perhaps we suffer from the inauspiciousness of the Five Phases, the malevolence of the Nine Luminaries, encountering years of punishment and conflict, fated clashes, or adversity in our undertakings, peril in our actions. Perhaps we are bedridden with chronic illness or oppressed by persistent afflictions. Perhaps we are afflicted by curses, oaths, or the consequences of unpaid debts. Transgressions from three lifetimes, enmities from different kalpas. Perhaps in our own cultivation, others have altered the site, offending the Nine Mounds’ Earth Sovereigns. Yellowing of the body, life-threatening perils, official talismans, malicious speech, the Sword Peak, Flying廉, the twenty-four positions, the twelve hundred spirits—any movement may provoke disputes and lawsuits.\"\n\n\"From this day forward, we repent and vow to take refuge forever. We humbly pray for the universal bestowal of compassion, the gracious granting of forgiveness, shelter and protection, and the gift of life and wholeness.\"\n\n\"We, Your humble servants, with devoted hearts prostrate and bow in gratitude to the Supreme Orthodox Three Treasures.\"",
      "overlap_context": "lestial Palace of the Yu-Yu Heaven, amid the Purple Tenuity Jade Terrace, above the Dark Capital and Jade Metropolis, He inherits the lineage of the Primordial Sovereign of Emptiness, surpassing the root and stock of the Western Na玉国. Within the grain of millet, the pearl, He draws forth the essence of the true and mysterious; in the Fragrant Grove Garden, He repeatedly discourses upon the secret essentials of the guideposts. His wondrous virtue defies thought; His divine powers elude discourse.",
      "start_char": 761,
      "end_char": 2008,
      "start_sentence": 38,
      "end_sentence": 96,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.515092611312866,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\九天应元雷声普化天尊玉枢宝忏.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "众哗九天诰毕各一拜。 志心皈命礼 九天应元雷声普化天尊，九声九拜。 臣法众等，志心皈身皈神皈命。 神霄，投 诚玉府。 重念弟子某等，凡胎浊质，走肉行尸，历劫迨今，罪如山海。 或卢天妖地魈，山精石怪，五行妖祟，三界魔凶，及庙社伤亡冤雠执对。 乌鼠送妖，蛇虫嫁孽，抛砖掷瓦，送影传声。 或瘟广传染，蛊瘵缠绵，故气伏尸，冢讼墓注。 或婚姻不顺，嗣息难招，水陆经从，劫数难这。 或兵戈杀戮，水火漂焚，盗贼侵凌，饥荒流荡。 从今忏谢，永誓皈依。 恭愿普运慈悲，曲垂原赦，绥之庇覆，锡以生全。 臣等志心稽首，礼谢无上正真三宝。 众哗九天诰毕各一拜 志心皈命礼 九天应元雷声普化天尊，九声九拜。 臣法众等，志心皈身皈神皈命神霄，投诚玉府。 重念弟子某等，凡胎浊质，走肉行尸，历劫迨今，罪如山海。 罪福寿夭，宠辱荣枯，财禄利名，是非人我。 或希仙学道，或利物济民，各有所求，咸令至遂，毋使愿违。 切虑俟犯，故为千愆万过，日深月远，曾未披陈。 或损 害有情，侵伤物类。 或迷真背道，犯戒违科。 既附隶於生死之书，实惨舒於简阅之笔。 从今忏谢，永誓皈依。 恭愿普运慈悲，曲垂原赦，绥之庇覆，锡以生全。 臣等志心稽首，礼谢无上正真三宝。 步虚　每一礼一拜 志心皈命礼 南极长生大帝统天元圣天尊， 束极青华大帝太一救苦天尊， 九天可韩丈人朱陵度命天尊， 九天雷祖大帝除灾济物天尊， 碧玉宫太一大天帝保制劫运天尊， 六天洞渊大帝伏魔上上太乙天尊， 六波天主帝君普施法润天尊， 九天采访使真君应元保运妙化天尊， 神霄玉府判府天尊， 玉府侍中仆射上相右卿， 五雷使院真君， 雷师皓爷天君， 雷伯青帝天君， 玉枢舍人官曹仙众， 九天应元府卿师使相一切仙真， 九天雷公将军， 五方雷公将军， 八方云雷将军， 九天雷门使者， 五方蛮雷使者， 雷部总兵使者， 紏录廉访典者， 掠剩司积逮司大夫， 幽枉司报应司大夫， 莫赚判官雷部官众， 雷部真仙诸司官属。 礼足各长跪皈命忏悔 臣法众等，志心皈身皈神皈命神霄，投诚玉府。 仰惟九宸御极，诸司赞元化之尊，三界浮游，列部佐贞明之圣。 是为雷霆之枢要，乃持人物之权衡。 重念某等，凡兹下愚，寄于浮世。 或贪嗔痴之未断，或心口意之相违，任性所为，不知惭愧。 或见闻而自作，或想念以教他，种种罪根，一一忏谢。 恭愿九天洞鉴，列圣垂慈。 元纲流汗漫之恩，法雨沛汪洋之泽，罪无大小，咸乞荡除。 冀三业以镯消，俾六根而清浄，福资万有，恩被十方。 臣等志心稽首，礼谢 无上正真三宝。 讳无上玉清王偈　闻经 闻经已后，当愿众生深入法门，归依信礼。 闻经已后，当愿众生万罪荡除，善芽增长。 闻经已后，当愿众生永断执迷，常归正道。 臣闻道包天地，人禀阴阳，生成仰赖於慈悲， 过咎许容於省悟。 臣等向来朝礼 天尊，称扬圣号，一念祈 天而请命，五体投地以皈依。 恭望 天尊大圣，天尊大慈，赦千生万劫之愆，赐五雷正一之炁。 臣等随心所祝，应念而成。 所求者遂，所感者通，所欲者从，所禳者却。 此世他生，常遇正因。 有识无情，同登 道岸。 稽首皈依无极大道。 向来 九天应元雷声普化天卑玉枢宝忏竟",
      "translated_text": "Having completed the recitation of the *Nine Heavens’ Edicts*, all bow once.\n\nWith devoted hearts, we take refuge and pay homage:\nTo the *Celestial Worthy of Universal Transformation Through the Thunder’s Resonance of the Nine Heavens’ Response to the Primordial*, nine prostrations with nine invocations.\n\nWe, the ritual assembly, with devoted hearts take refuge in body, refuge in spirit, refuge in life.\nTo the *Divine Empyrean*, we offer sincerity at the *Jade Treasury*.\n\nWe earnestly reflect upon us, Your disciples—beings of impure flesh, mere walking corpses—who, across kalpas until now, have amassed sins as vast as mountains and seas.\nPerhaps we have provoked the wrath of celestial demons, earthly sprites, mountain spirits, or stone specters; the malevolent qi of the Five Phases; the demonic forces of the Three Realms; or the vengeful grudges of temple and shrine spirits.\nPerhaps we have been afflicted by omens sent by crows or rats, curses passed by serpents or insects, or malicious acts like hurling bricks or tiles, casting shadows, or transmitting slanderous whispers.\nPerhaps we have suffered from plagues and contagions, lingering consumptive ailments, vengeful qi of the dead, or ancestral tomb disputes.\nPerhaps our marriages have been inauspicious, our descendants difficult to conceive, our water-and-land rites obstructed, or our karmic retribution inescapable.\nPerhaps we have endured warfare and slaughter, floods and fires, banditry and pillage, or famine and displacement.\n\nFrom this day forward, we repent and vow to take refuge forever.\nWe humbly pray for the universal bestowal of compassion, the gracious granting of forgiveness, shelter and protection, and the gift of life and wholeness.\nWe, Your humble servants, with devoted hearts prostrate and bow in gratitude to the *Supreme Orthodox Three Treasures*.\n\nHaving completed the recitation of the *Nine Heavens’ Edicts*, all bow once.\n\nWith devoted hearts, we take refuge and pay homage:\nTo the *Celestial Worthy of Universal Transformation Through the Thunder’s Resonance of the Nine Heavens’ Response to the Primordial*, nine prostrations with nine invocations.\n\nWe, the ritual assembly, with devoted hearts take refuge in body, refuge in spirit, refuge in life to the *Divine Empyrean*, offering sincerity at the *Jade Treasury*.\n\nWe earnestly reflect upon us, Your disciples—beings of impure flesh, mere walking corpses—who, across kalpas until now, have amassed sins as vast as mountains and seas.\nFortune and misfortune, longevity and premature death, honor and disgrace, prosperity and decay, wealth and emolument, fame and gain, right and wrong, self and others—\nwhether we seek immortality and the Dao, or strive to benefit beings and aid the people, each of our aspirations may be fulfilled, without thwarting our vows.\nYet we fear that in our transgressions, we have committed a thousand faults and ten thousand errors, their depth growing with each passing day, never once confessed.\nPerhaps we have harmed sentient beings or injured living creatures.\nPerhaps we have strayed from the Dao, violated precepts, or transgressed against the teachings.\nHaving been inscribed in the ledgers of life and death, our deeds are recorded in the annals of judgment.\n\nFrom this day forward, we repent and vow to take refuge forever.\nWe humbly pray for the universal bestowal of compassion, the gracious granting of forgiveness, shelter and protection, and the gift of life and wholeness.\nWe, Your humble servants, with devoted hearts prostrate and bow in gratitude to the *Supreme Orthodox Three Treasures*.\n\n*Step into the Void*—with each prostration, one bow.\n\nWith devoted hearts, we take refuge and pay homage:\nTo the *Celestial Worthy of Primordial Unity and Longevity of the Southern Culmen, Sovereign of the Celestial Mandate*;\nTo the *Celestial Worthy of Great Unity and Salvation from Suffering of the Azure Culmen of the Eastern Summit*;\nTo the *Celestial Worthy of the Nine Heavens’ Measureless Master, Deliverer of Lives from the Vermilion Mound*;\nTo the *Celestial Worthy of the Nine Heavens’ Thunder Ancestor, Remover of Disasters and Benefactor of Beings*;\nTo the *Celestial Worthy of the Great Heavenly Emperor of the Jade Green Palace, Guardian Against Kalpic Catastrophes*;\nTo the *Celestial Worthy of the Supreme Great Unity of the Six Heavens’ Abyssal Cavern, Subduer of Demons*;\nTo the *Celestial Worthy of the Heavenly Lord of the Six Waves, Bestower of Dharma and Nourisher of All*;\nTo the *Celestial Worthy of the Marvelous Transformation of the Nine Heavens’ Response, Inspector of Realized Beings and Protector of the Dao*;\nTo the *Celestial Worthy of the Divine Empyrean’s Jade Treasury, Judge of the Palace*;\nTo the *Celestial Worthy of the Jade Treasury’s Attendant, Prime Minister, and Right Minister*;\nTo the *True Lords of the Five Thunder Envoys’ Court*;\nTo the *Heavenly Lord Thunder Master, the Radiant Elder*;\nTo the *Heavenly Lord Thunder Count, the Azure Emperor*;\nTo the *Immortal Assembly of the Jade Pivot Chancery*;\nTo all the *Perfected and Immortals of the Nine Heavens’ Response to the Primordial Palace*;\nTo the *Generals of the Nine Heavens’ Thunder*;\nTo the *Generals of the Five Directions’ Thunder*;\nTo the *Generals of the Eight Directions’ Cloud and Thunder*;\nTo the *Envoys of the Nine Heavens’ Thunder Gate*;\nTo the *Envoys of the Five Directions’ Barbarian Thunder*;\nTo the *Marshal of the Thunder Department’s General Staff*;\nTo the *Officials of the Investigation and Auditing Bureau*;\nTo the *Ministers of the Detention and Arrest Bureau*;\nTo the *Ministers of the Dark Grievances and Retribution Bureau*;\nTo the *Judges of the Deception-Prevention Bureau and the Thunder Department’s Assembly of Officials*;\nTo all the *Perfected, Immortals, and Officials of the Thunder Department’s Various Bureaus*.\n\nHaving completed the rites, all kneel in long prostration to take refuge and repent.\n\nWe, the ritual assembly, with devoted hearts take refuge in body, refuge in spirit, refuge in life to the *Divine Empyrean*, offering sincerity at the *Jade Treasury*.\nWe reverently recall that the Nine Celestial Thrones govern the cosmos, and the various bureaus assist the transformations of the Primordial; the Three Realms drift and wander, while the ranked departments aid the sagely and luminous.\nThis is the pivot of thunder and lightning, the balance of power over beings and things.\nWe earnestly reflect upon ourselves—foolish beings dwelling in this fleeting world—\nwhether our greed, anger, and ignorance remain unsevered, or our thoughts, words, and deeds contradict one another, acting wantonly without shame or remorse.\nWhether we commit transgressions through sight or hearing, or teach others through imagination and thought, we repent for each and every root of sin.\n\nWe humbly pray that the Nine Heavens’ penetrating gaze and the compassion of the assembled sages may bestow the boundless grace of the primordial net, the vast blessings of the Dharma rain.\nMay all sins, great or small, be washed away.\nMay the three karmic actions be purified, the six senses cleansed, blessings extended to all existence, and grace pervade the ten directions.\n\nWe, Your humble servants, with devoted hearts prostrate and bow in gratitude to the *Supreme Orthodox Three Treasures*.\n\n*Ode to the Unsurpassed Jade Clarity King*—Upon Hearing the Sutra:\nHaving heard the sutra, may all beings deeply enter the Dharma gate and take refuge with faith and reverence.\nHaving heard the sutra, may all beings have their myriad sins eradicated and their virtuous sprouts grow.\nHaving heard the sutra, may all beings forever sever delusion and constantly return to the true Dao.\n\nWe have heard that the Dao encompasses heaven and earth, and humanity receives the yin and yang.\nOur existence and sustenance depend upon compassion, and our transgressions may be absolved through reflection.\nWe, Your servants, have come to venerate the *Celestial Worthies*, extolling their sacred names.\nWith a single thought, we beseech the heavens and invoke their mandate; with our entire being, we prostrate in refuge.\nWe reverently hope that the *Celestial Worthies*, in their great sagacity and great compassion, will pardon the faults of a thousand lives and ten thousand kalpas, and bestow the true qi of the Five Thunders.\nMay our heartfelt prayers be answered, our aspirations fulfilled, our desires granted, and our exorcisms effective.\nIn this life and the next, may we always encounter the true cause.\nMay the sentient and insentient alike ascend to the shore of the Dao.\n\nWe prostrate and take refuge in the boundless Great Dao.\n\nThus concludes the *Jade Pivot Precious Repentance to the Celestial Worthy of Universal Transformation Through the Thunder’s Resonance of the Nine Heavens’ Response to the Primordial*.",
      "overlap_context": "talismans, malicious speech, the Sword Peak, Flying廉, the twenty-four positions, the twelve hundred spirits—any movement may provoke disputes and lawsuits.\"\n\n\"From this day forward, we repent and vow to take refuge forever. We humbly pray for the universal bestowal of compassion, the gracious granting of forgiveness, shelter and protection, and the gift of life and wholeness.\"\n\n\"We, Your humble servants, with devoted hearts prostrate and bow in gratitude to the Supreme Orthodox Three Treasures.\"",
      "start_char": 2009,
      "end_char": 3361,
      "start_sentence": 97,
      "end_sentence": 185,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.642555236816406,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\九天应元雷声普化天尊玉枢宝忏.txt",
        "category": "威仪类"
      }
    }
  ]
}