{
  "source_id": "仙都志",
  "source_file": "chunked_daozang\\仙都志.json",
  "total_chunks": 17,
  "total_original_chars": 13978,
  "total_translated_chars": 84011,
  "total_translation_time": 479.19824147224426,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\记传类\\仙都志.txt",
    "category": "记传类"
  },
  "full_translation": "**The *Xian Du Gazetteer***\n\n**Title:** *Xian Du Gazetteer* (*Gazetteer of the Immortal Capital*). Compiled by Chen Xingding of the Yuan dynasty. Two fascicles.\n\n**Source Text:** From the *Zhengtong Daoist Canon*, Dongxuan Section, Record and Biography Category.\n\n---\n\n### **Preface to the *Xian Du Gazetteer***\n\nGazetteers of territorial administration trace their origins to the *Tribute of Yu* and find completion in the *Offices of Regions*. Yet while waters have their courses and commanderies their records, this *Xian Du Gazetteer* arises for such a purpose.\n\nXian Du, a realm of eastern splendor, is chronicled in Daoist scriptures as a grotto-heaven for prayerful transcendence. Its legacy begins with the Yellow Emperor’s emergence, flourishes under Tang foundations, and is ennobled by Song bestowals—its auspicious omens and numinous signs repeatedly gracing the sagely courts.\n\nDuring the *Yanyou* era, the upright scholar Zhao Xuyi arrived bearing the imperial seal to oversee its affairs. Mountains and rivers, flora and stone, all basked in singular favor—its solitary peaks heightened, its limpid streams deepened.\n\nResiding on the mountain, Master Chen took up his brush for this compilation, recording its transformations and marvels in exhaustive detail. Surely, this is a service to this sacred peak!\n\nI have heard that Penglai, though glimpsed, is ever swept away by the wind, and Peach Blossom Spring, once entered, loses its path. How then can all famed mountains and great rivers be traversed by every person? Yet this work, born of direct witness, preserves the Dao within—allowing one to wander its wonders from a reclining seat.\n\nWritten on the full moon of the fifth month, *Zhizheng* 8 (*wuzǐ* year).\n\n---\n\n### **Xian Du Gazetteer, Fascicle One**\n\nCompiled by Chen Xingding of Yuxu Hermitage, styled Shaowei.\nCollated by Wu Mingyi of Du Feng Mountain, styled Zhongyi.\n\n**Xian Du Gazetteer, Fascicle One**\n\nXian Du Mountain, known in antiquity as Jinyun Mountain, is listed in the Daoist canon as the twenty-ninth of the Thirty-Six Grotto-Heavens, named the *Xuandu Qixian Dongtian* (\"Mystic Capital Grotto-Heaven of Praying Immortals\"). It spans three hundred *li* in circumference and is said to be where the Yellow Emperor ascended on a fiery dragon. At its summit stands a stone chamber, traditionally held to be the gateway to the grotto-heaven.\n\nThe *Records of the Grand Historian* note that *Jinyun* was originally the name of the Yellow Emperor’s summer palace. Zhang Shoujie explains that Jinyun County in Kuai Prefecture was his enfeoffment. The *Taiping Imperial Survey* records that the Tang established Jinyun County and later renamed Kuai Prefecture as Jinyun Commandery, owing to the presence of Jinyun Mountain. The present county lies twenty-three *li* west of the mountain.\n\nThe *Illustrated Classic* recounts that on the eighth day of the sixth month in the seventh year of the *Tianbao* era (748 CE), a radiant cloud arose from the source of Li Creek, blanketing the summit of Solitary Peak in Xian Du Mountain. From within the cloud came the resonant chimes of immortal elixirs, accompanied by the flight of phoenixes and cranes. Suddenly, a chorus of \"Long live the Emperor!\" echoed from the mountain, and the nine neighboring peaks all responded. The clamor endured from the *shen* hour (3–5 PM) until the *hai* hour (9–11 PM) before subsiding. Prefect Miao Fengqian memorialized the event to the throne, prompting the mountain’s renaming.\n\nSolitary Peak, also called Xian Du Stone, is described in Xie Lingyun’s *Record of Famous Mountains*: \"Beside Jinyun Mountain stands a solitary stone, towering into the clouds to a height of two hundred *zhang*. Three sides overlook water, and its circumference measures one hundred and sixty *zhang* in height. At its summit lies a lake where lotuses bloom. Nearby is a crag called Stepping-in-Emptiness Mountain. From afar, it appears lower than Stepping-in-Emptiness, but upon closer inspection, Stepping-in-Emptiness is revealed to stand beneath it.\" The *Old Record of Dongyang* calls it Danfeng Mountain (\"Cinnabar Peak\"). Legend holds that the Yellow Emperor once ascended this mountain in a dragon-drawn chariot, and traces of its wheel ruts remain. From the Tang poet Bai Juyi onward, renowned scholars of past and present have left behind numerous inscriptions.\n\nStepping-in-Emptiness Mountain lies before Xian Du Mountain, directly opposite Yuxu Palace. Its layered ridges soar into the void, enveloped by surrounding peaks. A cluster of smaller peaks, arrayed like the Northern Dipper, is named the Dipper Crags. Xie Lingyun’s *Record of Famous Mountains* states: \"Atop the central crag rises a peak several dozen *zhang* high, resembling either a lotus blossom or a ram’s horn.\" Local elders say the Yellow Emperor once refined elixirs here. Liu Cheng’s *Record of Mountains and Waters* calls it Jinyun Terrace, the Yellow Emperor’s alchemical site. The *Treatise on Geography* identifies Jinyun Hall as the capital of the Three Heavens. The summit is level and expansive, resembling an altar—this is the very place.\n\nBoy’s Peak stands beside Solitary Peak, its form like a bamboo shoot. At the waist of Solitary Peak is a cavity resembling a navel, and this peak aligns with it, hence its name. The *Old Gazetteer of Kuocang* records: \"Beside Solitary Peak, a sheer stone stands, called Boy’s Peak.\"\n\nFine Mountain lies west of Xian Du Mountain, to the left of Dawn Valley. During the *Shaoxing* era of the Song, Transport Commissioner Li Shiju once visited Xian Du and passed the mountain residence of the Xu family. In a poem, he wrote: \"Layered mansions face upon face with Fine Mountain,\" from which the name derives. Later, Master Zhu Xi of Hui’an sojourned here, further enhancing its renown.\n\nHidden Truth Grotto is situated at the summit of Stepping-in-Emptiness Mountain, opposite Solitary Peak. The grotto’s entrance is framed by intricate rock formations resembling windows and doors. Its sheer inaccessibility makes it rarely visited. According to the *Prefectural Gazetteer*, it was the cultivation site of Master Liu Yinzhen of the Tang.\n\nImmortal Water Grotto lies at the foot of Stepping-in-Emptiness Mountain. The *Prefectural Gazetteer* also calls it Mirror Cliff Grotto. Within, a spring emerges from a crevice in the cliff, dripping into a stone basin—its flow never ceases, even in severe drought. It was the cultivation site of Master Zhou Jingfu of the Tang, and many eminent figures have left inscribed records of their visits on its cliffs.\n\nGolden Dragon Grotto is located east of Stepping-in-Emptiness Mountain. Two interconnected caverns within are bright and spacious. The *Old Gazetteer* states: \"The grotto’s depths are unfathomable; Daoists call it a grotto-heaven.\" In the fourth year of the *Tianxi* era of the Song (1020 CE), a golden dragon jade tablet was cast into it.\n\nHeavenly Hall Grotto lies east of Xian Du Mountain, to the left of Twin Dragon Grotto. Its lofty heights make it seldom visited. On the grotto’s stone wall, two circular cavities are aligned: the right is shallow, the left deep, said to be the dwelling of dragons. Prayers for rain here are always answered. Beside the grotto are two stone basins: the left holds clear water that perpetually overflows, while the right contains turbid water that sometimes recedes. They are called the Sun and Moon Springs. Behind the mountain is another grotto, commonly called Heavenly Hall Mountain. A meditation hall was built within, named *Qingxu* (\"Pure Emptiness\").\n\nForgetting-Return Grotto is situated west of Xian Du Mountain, large enough to seat dozens. Outside the grotto, a stone juts over the stream. Visitors who ascend it take in the full splendor of Xian Du, so captivating that one forgets to return—hence the name Forgetting-Return Terrace.\n\nDawn Valley Grotto, also called Ni Weng Grotto, overlooks Lian Creek. Its flanking cliffs are wondrously shaped, facing Solitary Peak. The *Prefectural Gazetteer* states: \"The valley lies west of Xian Du Mountain. At first, it is dark and narrow, but further in, stone chambers and grotto dwellings open into spacious halls. As it faces east, it receives the first light of dawn, hence the name Dawn Valley.\" On the eastern cliff is an aperture the size of a basin. At dawn, sunlight streams through, casting a dazzling five-colored glow within, while outside, the clear waves shimmer like molten gold. Some claim Ni Weng Grotto lies half a *li* east of Jinyun County, but this is erroneous. During the *Jiatai* era of the Song, the prefectural scholar Chen Baipeng wrote in his *Supplementary Gazetteer*: \"The grotto properly belongs to Dawn Valley beside Lian Creek in Xian Du Mountain.\" On the cliff are inscribed three large characters, said to be the seal script of Li Yangbing. Upon examination, the valley bears the carved characters *Chu Yang Gu* (\"Dawn Valley\") in regular script, and *Ni Weng Dong* (\"Ni Weng Grotto\") in seal script. Local elders say a certain Magistrate Ni once dwelled here, though his name is now lost. During the *Qiandao* era, Prefect Qian Yu inscribed a poem on Xian Du, writing: \"Dawn Valley is none other than Fusang Valley; within the grotto, Ni Weng beckons me.\" Thus, it is clear that Ni Weng Grotto is Dawn Valley.\n\nThe Cloud Hall Grotto is also recorded.\n\nThe mountains here abound in grottoes and caverns, yet only six have long been renowned.\n\n**Twin Dragons Grotto** lies east of Solitary Peak, to the left of the Temple of Numinous Moisture. A massive boulder spans the mountain stream, beneath which a hollow passage allows human passage. Even in severe droughts, its clear flow never fails. During the *Shaoxing* era of the Song, when a prolonged drought struck, Daoist Master You of Jade Clarity observed the cloud formations and came upon this spot, where two enormous serpents coiled beneath the stone, drinking without cease. He prayed for rain, and thunderstorms soon followed, drenching the entire region. Thus the grotto gained its name, and a shrine was established in its honor. To the left within the grotto lies a dark crevice that tunnels upward; once, someone entered with a torch but could not reach its end. To this day, prayers for rain here are invariably answered, and at times, flashes of lightning appear. The deep pool before the grotto is the ancient *Youlong Hong* (\"Wandering Dragon Pool\"), also called *Longhong Grotto*. Song scholars Hu Zhitong and Grand Academician Wang Shipeng both composed poems in its praise.\n\n**Crouching Tiger Crag** stands west of Solitary Peak, to the right of the academy. A small stone mountain resembles a crouching tiger, also known as *Zhushi* (\"Perched Lion\") Crag.\n\n**Soaring Luan Peak** rises south of Solitary Peak, to the left of the Waveling Pavilion. At its summit, two stones take the form of *luan* and crane, wings spread as if in flight—hence its popular name, *Yacha* (\"Forked\") Crag.\n\n**Numinous Tortoise Stone** lies north of Solitary Peak, beside the boundary marker of Xian Du. At the mountain’s base, a massive boulder stands upright, shaped like a great tortoise with head raised. Locals gauge its dryness or dampness to predict rain or shine.\n\n**Little Penglai** sits below Lian Creek. According to the *Prefectural Gazetteer*, it lies west of Xian Du. At the heart of its pool is a small isle, strewn with strange rocks and rare trees. To the south, a stone cliff rises some hundred *ren* high, where eminent officials carved poems on the rock to commemorate its scenic beauty. Visitors who row in by boat feel as though they have entered the fairy realms of Penglai. Minister Lou Yue of Siming inscribed *Little Penglai* in large characters on a stele, which was once sheltered by a pavilion—now in ruins. Nearby stands **Clasped Palms Grotto**, spacious enough for dozens. High on the cliff face, over ten cavities align like strung beads, called **Great Bead Crag**. To the east rises another crag, broad above and narrow below, known as **Rain Cape Crag**.\n\n**Little Red Cliff** stands above the Riverstone Pool. The *Prefectural Gazetteer* places it east of Xian Du: a sheer cliff rises by the stream, nearly a thousand *chi* high, its peaks and ridges strangely elegant. Beneath the cliff, a hollow opens into a deep, limpid pool of unfathomable depth. Boating here feels far removed from the mortal world. A short distance downstream, another crag bears the same name. Minister He Dan of the prefecture inscribed *Little Red Cliff* in stone upon the cliff face. Though the locations differ, the names coincide, so both are recorded here.\n\n**Immortal and Monk Crag** lies on the western bank of Little Red Cliff. Stones stand tall and dense along the stream’s edge, some resembling the figures of immortals or Buddhist monks. Much of Jade Clarity Mountain’s land lies nearby, and ancient records often used *Immortal Stone* as a boundary marker.\n\n**Yellow Vulture Red Crag** stands on the eastern slope of Xian Du Mountain. A cliff rises steeply, stretching dozens of *xun*, its cavities and hollows vivid with five-colored hues. From afar, it resembles brocade; up close, it glows like sunset clouds. Today, locals have established a farming community at its base.\n\n**Celestial Master Crag** faces Red Crag across the way. At its base lies a grotto large enough for twenty people, with a dark crevice leading straight down to the stream. Elders say that in times of drought, people would come here to request incense from the ancestral temple of the Perfected True Protector of the Realm, Celestial Master, and their prayers were answered. A hall was built before the grotto, hence its name. Later, the hall’s foundations were swept away by water, yet villagers still face the grotto in worship.\n\n**Eastern Meng Crag** stands to the left of Dawn Valley. Strange stones rise and fall along the edge of a deep pool, where boats may navigate. Beyond the sea lies an immortal mountain called *Eastern Meng*. The southern mountain of Mount Tai is also named *Eastern Meng*, though the origin of this crag’s name remains unclear. Some say the crag faces east, and as the sun rises, water and light intertwine, giving it the name *Eastern Meng*—also reflecting the meaning of *Dawn Valley*. It is uncertain which explanation is correct.\n\n**Jade Rice Crag** lies to the right of Dawn Valley. Halfway up the mountain, a stone juts out like a mound of rice. Below the crag is a cave resembling a turtle’s mouth; when rain approaches, mist rises from the rock like steam from cooking, and when the stream surges, the cave emits sounds like a boiling cauldron. The *Old Gazetteer of Kuocang* calls it *Azure Cloud Grotto*, also known as *Zhang Gong’s Favor*, though its origins are unknown.\n\n**Yang Lang Grotto** lies behind Dawn Valley, beside the post road. The grotto has two levels, upper and lower, with space for over twenty people. Elders say a certain Yang Lang once lived here, healing travelers with talismans and medicines. Later generations, in remembrance, built a shrine within.\n\n**Immortal Crag Grotto** lies north of Fine Mountain, above Immortal Crag Market. Halfway up the mountain is a grotto, deep and spacious, capable of holding over a hundred people. Today, locals have established a farming community within.\n\n**Cloud-Ladder Grotto** stands west of Xian Du Mountain, facing Rain Cape Crag. A hollow beneath the crag resembles steps, ascending from the mountain’s base to its midsection for over sixty *zhang*, also called *Long Pavilion*. In its deeper recesses, locals once built houses, now in ruins.\n\n**Ding Lake** is the lake atop Solitary Peak, where lotuses once grew. From the Tang and Song dynasties onward, eminent officials’ poems and inscriptions all refer to it as *Ding Lake*.\n\n**Lianjin Creek** originates from Great Basin Mountain and is called *Lianjin* (\"Gold-Refining\") upon reaching Xian Du. Stones in the water connect seamlessly to the base of Solitary Peak, smooth as whetstone. The banks face each other across over thirty *zhang*, yet the water is only a *chi* deep. According to the *Prefectural Gazetteer*, the village in Xian Du is called *Lianjin Village*, the stream *Lianjin Creek*, and the ford *Lianjin Wave*, though their origins remain unrecorded.\n\nAccording to Tang dynasty’s Wei Jia in his *Inscription of Mount Xiandu*: \"Cinnabar caves rise beside it; golden streams flow below.\" Also, from the *Mysterious Ruins Record* by Master Hidden Truth of the Tang: \"By Lianjin Creek’s banks, one may wash their cap strings.\" Thus, the name *Lianjin* is ancient indeed.\n\n**Jinhua Pool** lies in the deep reaches below Lianjin Creek. Local elders say that petals from the golden lotuses of Ding Lake once drifted here, hence its name. **Lian Creek**, further downstream from Jinhua Pool, shimmers like raw silk, thus its name. According to the *Prefectural Gazetteer*, it lies west of Xiandu, before the Chaoyang Valley Grotto. In its waters are imprints of giant footprints, hoofmarks of dogs and horses, and a stone well of unfathomable depth.\n\n**Cinnabar Well** stands at the southwest corner of Jade Treasury’s main hall. Master Hidden Truth once drew its water to refine elixirs. To this day, its spring remains clear and sweet, warm in winter and cool in summer, never drying even in drought nor overflowing in flood.\n\n**Jade Spring Pool** lies below Double Dragon Cave, its waters pure as jade. **Release Pool**, outside Jade Void Palace, is fed by the broad and deep ravine waters and has long served as a place for releasing living creatures. Another such pool exists before Miao Ting Abbey.\n\n**Heavenly Pond** sits atop the mountain behind Heavenly Hall Cave, never drying in winter or summer.\n\n**Comb-Water Weaving** is a single slab of stone in the great stream above Little Penglai, spanning over thirty *xun* between its banks. When waters recede, the remaining flow parts around it for passage. Locals call it *Bridal Sedan Rock*.\n\n**Mallet-Head Stone** lies in Lianjin Creek, named for its resemblance.\n\n**Temples and Abbeys**\n**Jade Void Palace** stands in the heart of Mount Xiandu, the very site of the Mystic Capital’s Grotto-Heaven where the Yellow Emperor ascended to immortality. In the *Wuzi* year of Tianbao (748 CE), due to auspicious omens of colored clouds and immortal music above Solitary Peak, Prefect Miao Fengqian memorialized the throne. The emperor decreed Xiandu Mountain a sacred precinct, forbidding logging, hunting, or fishing within its three hundred *li* circumference. A shrine to the Yellow Emperor was built, and seven Daoist priests were annually ordained to tend its incense fires. In the *Yisi* year of Zhiping (1065 CE), the Song court bestowed its present name. In the *Gengzi* year of Xuanhe (1120 CE), it was destroyed by bandits.\n\nDaoist priest You Dacheng, upon the former foundations, once more planned its reconstruction. At that time, the abbey faced east with its back to the west, but practitioners of yin-yang arts declared that this resembled a tiger’s glare and that the orientation violated ritual propriety. Thus, in the *Gengshen* year of Jingding (1260 CE), Prefect An Liu, by imperial decree, commanded Daoist priest Chen Guanding to relocate and reorient the abbey. In less than a year, the work was completed.\n\nIn the *Gengshen* year of Yanyou (1319 CE), Daoist priest Zhao Siqi received an imperial commission, bearing the seal and robes bestowed by the throne as *Tidian* (Supervisor) of Jade Void Palace at Mount Xiandu in Chuzhou Circuit, a fifth-rank office overseeing the abbey’s affairs. He further received an imperial edict for its protection, restoring its proper cosmic alignment, and was granted official placards by the Jixian Institute, the Celestial Master and Orthodox Unity Sect’s Grand Master of the Dao, and the Grand Preceptor and Supreme Minister, Great Patriarch of the Mystic Teaching, each to be perpetually observed. From this time forth, the abbey’s gates regained their former dignity.\n\nThe abbey’s halls and structures are listed below:\n\n**Hall of the Golden Portal and Luminous Yang**, its plaque inscribed by Ye Sichang of the prefecture.\n**Shrine of the Yellow Emperor**, its plaque in seal script by Li Yangbing, magistrate of Jinyun County during the Tang.\n**Hall of the Flying Celestial Dharma Wheel Repository**, established in the *Jimao* year of Qiandao (1169 CE) by Daoist priest Li Boxiang, its scale grand and elegant, its plaque inscribed by Chen Yi of the prefecture.\n**Palace of Heavenly Unity and True Felicity**.\n**Hall of the Three Primes and Three Officials**.\n\n**Shrine of the Divine Lord of Zitong**.\n**Shrine of the Grotto-Heaven Immortals**.\n**Shrine of the Jade Purity Perfected Official**.\n**Hall of the Flourishing Teachings**, its plaque inscribed by He Chuan of the prefecture.\n**Hall of Hidden Perfection**, its plaque inscribed by Han Yongxi; Wu Jun once left a poem here. Now it enshrines images of the immortals Zhong and Lü. The abbot’s chamber plaque reads: *#1 Heaven Unfolds a Painting*, inscribed at age nine by Zhu Huang, fifth-generation descendant of Master Wen.\n**Hall of Wind and Rain**, its plaque inscribed by Zhao Mengfu of Wuxing.\n**Golden Lotus Pavilion**, its plaque inscribed by Yu Ji of Shu Commandery.\n**Gate of the Jade Purity Palace**, its seal-script plaque by Zhao Ting of Dongyang.\n**Gate of the Grotto-Heaven for Invoking Immortals**, its seal-script plaque by Qian Shueyou of the county.\n**Gate of Mount Xiandu**, its plaque inscribed by Zhao Mengfu.\n**Pavilion of a Fleeting Cloud**, named after Bai Juyi’s poem *A Fleeting Cloud and a Solitary Stone*.\n**Pavilion of the Returning Waves**, situated above the Golden Flower Pool, its plaque inscribed by He Zongyao of the prefecture.\n**Veranda of Xiandu’s Transformation**.\n**Veranda of Vying Splendor**.\n**Veranda of Gathering Fragrance**.\n**Veranda of Refining Jade**.\n**Pavilion of the Perching Crane**, located outside the Grotto-Heaven Gate.\n**Pavilion of Reflecting Waters**, situated above the Release Life Pond.\n**Pavilion of Forgetting Return**, before the Cave of Forgetting Return.\n**Temple of the Wondrous Court**, on the eastern slope of Mount Xiandu, above the Golden Dragon Grotto. Built in the first year of *Chengtong* (860 CE) by the Recluse Master Liu of Hidden Perfection, who also constructed the *Mystic Wasteland* behind it. In the third year of *Qianfu* (876 CE), his disciple Zhu Huisi petitioned the court for a temple plaque, which was granted the name *Xiandu*. In the first year of *Jingfu* (892 CE), Luo Yin of Jiangdong composed its record. In the second year of *Zhiping* (1065 CE) of the Song, it was renamed as it is today. In the first year of *Huangqing* (1312 CE) of the Yuan, the Daoist priest Chen Huaiyu of Mystic Wonder and Preserved Perfection reverently received an imperial edict restoring its rank as *Jia Yi* (First-Second Grade), with hereditary incense offerings, thereby reviving its prosperity.\n\n**Academy of the Solitary Peak**, west of the Lianjin Stream, directly facing the Solitary Peak. In the *Renyin* year of *Chunxi* (1182 CE) of the Song, Master Zhu Xi of Huian, bearing the credentials of the Ever-Normal Granary, submitted a memorial impeaching the prefectural governor but received no response. He lingered in these mountains awaiting the imperial decree, remarking that this would be a fitting place for secluded cultivation. In the *Wuzi* year of *Shaoding* (1228 CE), Ye Sichang, Duke of the State of the prefecture, first established a ritual hall here as a place for lectures and discourse. In the *Dingmao* year of *Xianchun* (1277 CE), Qian Shueyou, Minister of the county, expanded it upon the old site. The entire foundation is part of Mount Yuxu.\n\n**Temple of Numinous Blessings**, before the Double Dragon Grotto, dedicated to the spirit of the Double Dragons. The *Prefectural Gazetteer* states: In the seventh year of *Xianchun* (1271 CE) of the Song, Magistrate Chen Shaoru prayed for rain and received a response; he reported this to the throne and was granted an imperial plaque for the temple. To this day, when the local gentry and commoners pray for rain, their pleas are invariably answered. The old temple was quite cramped, and it has since been regularly renovated.\n\n**Temple of Marquis Zhao**, west of Mount Xiandu, beside the Ladder Cloud Grotto. According to the *Prefectural Gazetteer*, the temple is in Xiandu Township, and the entire region reveres it. The marquis was Zhao Bing of the Later Han. Before the temple lies a stone resembling a boat; the *Prefectural Gazetteer* notes: There is a stone like a vessel, commonly called *Marquis Zhao’s Boat*, while others resemble a staff, shoes, or jars, all named after the marquis. According to the *Biographies of Magicians* in the *History of the Eastern Han*, Zhao Bing, styled Gong’a, was a native of Dongyang. Skilled in southern magic, he valued purity and frugality, offering libations to spirits with east-flowing water, dried mulberry bark as jerky, and curing illnesses with remarkable efficacy. He later entered Zhang’an (present-day Taizhou), where the people revered him as a deity. After his death, a shrine was established in his honor. To this day, mosquitoes and gnats do not enter it. Another commentary states: The original shrine of Bing was in Yongkang County of Muzhou, commonly called the *Temple of Marquis Zhao*. In the Jiangnan region, the *Zhao Hou Prohibitive Methods* for healing illnesses are still transmitted, and it is said that the present *Zhengyi* lineage’s altars bestow the *Zhao Hou Prohibitive Qi Registers*—this refers to the so-called *Zhao Hou Prohibitive Masters*. Astrologers also speak of the *Zhao Hou Transformation Day*. Further, according to the *Dongyang Gazetteer*, the *Temple of the Marquis of Wushang* in Yongkang County is dedicated to Zhao Bing of the Later Han, with accounts matching those in the histories. The *County Records* state: He served the Han as Grand General. The temple has no stele or inscription for reference, only the ancient clerical-script characters *Temple of the Marquis of Wushang*. The *Prefectural Gazetteer* also mentions the *Temple of Numinous Well-Being* in Qingtian County, which is the Temple of Marquis Zhao of Jinyun County. Originally, the marquis’s temple received offerings at White Crane Mountain in Linhai County of Taizhou. In the seventh year of *Yuanfeng* (1084 CE) of the Song, it was granted the plaque *Spirit of Accumulated Seals, Numinous Favor, Manifest Protection, Vast Benevolence, Majestic and Mighty King*. Now, considering the historical evolution of Jinyun: In the first year of *Shengli* (698 CE) of the Tang, the territory of present-day Lishui (formerly Kuocang County) and Yongkang County was divided to establish Jinyun County. This temple is only half a league from the Yongkang border. Upon examination, this land was indeed part of ancient Yongkang. The deity’s numinous efficacy is omnipresent, and though neighboring counties also have shrines, none are as distinguished as this temple, which possesses stone images as a testament. To this day, the temple remains free of mosquitoes and gnats, the region produces no leeches or conches, and prayers for relief from floods, droughts, plagues, and epidemics are invariably answered. Is this not the ancestral temple? Among the immortals: **Master Jing Fuzhou**, a Daoist of Xiandu.\n\nIn the Tang *Dali* era (766–779 CE), he dwelt within the Immortal Waters Grotto, practicing grain avoidance and meditative repose for over a hundred years before ascending as an immortal. Today, the Jade Void Palace preserves a stone inscription bearing Lu Guimeng’s poem and preface, titled *Mirror Cliff: Abode of Master Zhou*, which may be consulted. Here follows the text:\n\nWithin the Immortal Capital Mountain of Chuzhou, a cavern lies halfway up its slope. Gazing down, it resembles a mirror—hence its name, Mirror Cliff. The grotto stands two hundred feet above the earth, accessible only by bamboo ladder. Its interior spans a square *zhang*, where stalactite water drips ceaselessly. The Yellow Emperor’s disciple, Master Zhou Jingfu, resided here. For eighty years, he consumed no grain, burning only a censer of *jiangzhen* incense each day while reciting the *Scripture of the Numinous Treasure for Salvation*. When Lord Duan Ke of Dongmou served as prefect of the region, he heard of Master Zhou’s renown and ascended the ladder to visit him. “You have dwelt here long,” he remarked. “Can you measure the stalactite water that drips day and night?” Master Zhou replied, “I have estimated it: over a full day and night, it amounts to one *hu* and a half.” The lord marveled and treated him with reverence. Thirteen years after parting, a traveler from Chuzhou reported that Master Zhou still lived. Longing to glimpse his Dao but finding no means, Lord Duan composed a poem in tribute:\n\n*I hear your body is lighter than cranes,*\n*Your stone chamber silent, shared only with clouds.*\n*At dawn, you carve fragrant aloeswood;*\n*At night, you chant alone from celestial scriptures.*\n*Ten caves’ essences you’ve inhaled in full;*\n*Your autumn hair, unkempt, remains unbrushed.*\n*Knowing you’ll soon join the Suspended Pearl Assembly,*\n*I wonder when you’ll ride east on a white carp.*\n\nPi Rixiu, Gentleman for Literary Composition, responded with a matching poem:\n\n*Eighty years dwelling in Mirror Cliff,*\n*Beneath a deer-hide cap, your form like snow.*\n*Though your bed chills with clouds coiled round the pillow,*\n*What harm if scriptures dampen from dripping stalactites?*\n*Apes at the stream pause to peer into the abyss;*\n*Visitors on the green ladder rest by perilous pines.*\n*Why must petty clerks, like crows, remain earthbound?*\n*I long to hoist sail toward the Immortal Capital.*\n\nThe *Old Anthology of Kuocang* records the same text as the stone inscription.\n\n**Recluse Liu, Master of Hidden Reality**, named Chujing, styled Daoyou, hailed from Pengcheng in Peiguo. His ancestors had fled to Suichang and settled there. Though his family pursued Confucian scholarship, the Master was precocious from childhood, well-versed in the classics, and traveled among famous mountains. There, he encountered a perfected being who transmitted to him the Dao of exhalation and inhalation. Once summoned to court and granted a purple robe, he retired to Hidden Reality Cliff on Immortal Capital Mountain, where he built a hut beside the Golden Dragon Grotto—today’s Wondrous Court Abbey. His disciples numbered in the hundreds, and seekers from afar arrived daily without fail. When his followers wished to sculpt his likeness, a wine-loving Daoist appeared and completed the task. The Master detained him for ten days of feasting, then gifted him thirty *zhu* of gold upon his departure. As they parted before the Golden Dragon Grotto, the Daoist instructed, “When you return, look beneath your inkstone.” Upon doing so, he found a slip of paper inscribed:\n\n*You gave me gold; I grant you truth:*\n*Truth embraces form; form perfects spirit.*\n\nBeneath lay the gold, untouched. At once enlightened, the Master prepared a transcendent tomb behind his hut, guarding his resolve. On the *xinyou* day of the sixth month in the fourteenth year of *Xiantong* (873 CE), he shed his mortal form. That same day, he was posthumously enfeoffed as Prefect of the Mystic Tomb. Lu Qinguang eulogized his statue:\n\n*Essence of utmost numinosity,*\n*Abyss of the Great Dao—*\n*Its simplicity unscattered,*\n*Its spirit wholly preserved.*\n*Alas, worldly men,*\n*Driven by desires, toil endlessly,*\n*So their primordial embryo*\n*Flees in the blink of an eye.*\n*Only the Master, serene and untroubled,*\n*Dissolved ten thousand cares.*\n*Not a single thing*\n*Could deceive his perfect truth.*\n*Even his form and qi*\n*Required a cocoon’s release—*\n*How then could a clay effigy*\n*Embody the divine man?*\n\nYears later, a villager encountered him in the Xiang-Han region and relayed the news to his disciples. They opened the tomb to find only his staff and sandals. Both episodes confirm his deliverance as a *shijie* immortal. His empty tomb remains behind Wondrous Court Abbey. Another eulogy for his statue reads:\n\n*Returning to the One, boundless,*\n*His spirit transcends spirit.*\n*This sculpted image remains,*\n*Yet it is not the Master’s truth.*\n*The Master’s truth*\n*Transcends this body,*\n*Emerging from being, entering nonbeing,*\n*None may draw near.*\n\n**End of Scroll One of *Records of Immortal Capital***\n*(Events sourced from the* Prefecture Gazetteer*; eulogies from* Old Gazetteer of Kuocang*).*\n\n**Scroll Two of *Records of Immortal Capital***\n*Compiled by Chen Xingding, Abbot of Jade Void Palace and Lesser Asterism;*\n*Collated by Wu Mingyi Zhongyi, Mountain Chief of Solitary Peak, Fan’gang.*\n\n**Recluses**\nImmortal Capital, a grotto-heaven for seeking transcendence, has never lacked lofty-minded recluses through the ages.\n\nSince before the Xuanhe era of the Song, Jade Void Palace suffered from banditry, and its earlier history cannot be verified. Thereafter, figures such as You Dacheng frequently propagated the teachings, enhancing the mountain’s prestige. Their profound virtue and pure renown are here recorded in summary.\n\nYou Dacheng, a native of Lecheng, single-handedly restored the palace after its destruction by bandits. He carried forward the former legacy, enlightening later disciples, and was particularly skilled in the art of geomancy. He chose his burial site on a branch mountain of Immortal Capital, vowing: *\"My descendants, generation after generation, shall inherit this calling and become teachers of heaven and humanity.\"* His words proved prophetic—his lineage endured for eight generations until the end of the Song, when his tomb was encroached upon by local settlers and the You clan nearly vanished.\n\nLou Dadu and Huang Jiansu, both natives of the prefecture, vigorously propagated the true Daoist teachings, widely promoting the mysteries of the Way. Li Boxiang, a man of Jianchuan, embodied an ancient and lofty Daoist spirit, expanding the construction of the Flying Celestial Dharma Wheel, unmatched in the eastern Zhe region. Liu Yanyong of Shaowei petitioned for the remission of excessive taxes, while Wu Ruochong, his fellow disciple, was recognized for his meritorious service in the Daoist arts.\n\nHong Duanben, styled Gaoxi; Ye Baohe, styled Zhujian; Zhan Xuyi, styled Ji’an; and Chen Guanding, styled Chushan—all natives of Lishui—formed a four-generation lineage of master and disciple. Inheriting the orthodox transmission of the Great Dao, they became leaders of the Daoist community. Master Chushan, in particular, altered the orientation of the palace halls, leaving many notable achievements.\n\nLin Tianren, styled Hengzhou, a native of Kunyang, was once appointed *Xiuzhi Lang*. Witnessing the vicissitudes of time, he turned his heart to the study of the Dao. He compiled Daoist scriptures, refined liturgical texts, and frequently conducted grand Yellow Register fasts. On one occasion during an alchemical ritual, he manifested a divine presence—radiant light in nine hues filled the walls, and in an instant, heaven and earth became luminous, visible to all the people.\n\nXie Tianyu, styled Langu, a native of Jinhua, was deeply devoted to the Daoist arts and greatly advanced the lineage’s teachings. Whether praying for rain or dispelling drought, summoning thunder to strike unworthy temples, he accomplished all without raising his voice, as if answers came in echo. His reputation endures to this day.\n\nXu Yuanshan, styled Zilin, a native of Lishui, was a Daoist of Jade Void Palace. During the Jingding era of the Song, he was summoned to court to pray for snow. Taking a white brush, he inscribed a five-petaled design on blue paper and presented it, declaring: *\"By the hour of chen tomorrow, snow will fall—all in five-petaled flakes.\"* When the appointed time arrived, it came to pass. He was granted the title *Master of Purple Tenuity and Benevolent Aid*.\n\nThe events are recorded in the prefectural gazetteer.\n\nDuring the Yuan dynasty, the Celestial Master was summoned for his virtuous character, and his Dao was honored, allowing him to oversee Jade Void Palace to nurture longevity. In the *dade* year of *jiachen*, without illness, Xu Yuanshan transformed, leaving behind a farewell verse: *\"I was originally a transcendent of Penglai, having dwelt in the world for seventy-nine years. Laughing, I point toward Dinghu to return—gazing into the cavern heavens, even the azure sky cannot hold me.\"*\n\nZhao Sicheck, styled Xuyi, a native of Longquan, studied the Dao at Jade Void Palace in his youth. In maturity, he wandered through famous mountains and twice sought instruction from Perfected Master Du of Nangu. When he journeyed to the imperial capital, eminent officials and high ministers all held him in reverence. He was granted an imperial commission, bestowed a seal, and appointed to a fifth-rank position as abbot—this was the true beginning of such appointments. He was repeatedly entrusted with imperial incense, dispatched by post to regions including Huai, Shu, Jing, Xiang, Jiang, Zhe, Huguang, Min, Hai, and Sibo. Later, he resided at Dayuanxing Yongshou Palace in Jiqing, Shengyuan Abbey on Jichou Mountain in Huzhou, Baihe Abbey in Pingjiang, and was repeatedly honored with imperial decrees, receiving the title *Master of Mysterious Clarity, Dao-Pervading, and Void Unity, Perfected Adept of the Teachings*. In the winter of the *gengchen* year following *zhiyuan*, he transformed at Baihe Abbey, and his sword and sandals were interred at Jichou.\n\nLi Dening, styled Shouyi, a native of Kuocheng, once served as vice-director of Daoist affairs in Sanqu and deputy overseer of Jade Void Palace for over forty years, taking the restoration of dilapidation and the rectification of abuses as his personal duty. In the *gengyin* year of *zhiyuan*, his merit in exempting taxes was prominently displayed. On the *yimao* day of the first month in the *yiyou* year of *zhizheng*, he suddenly called for brush and paper, writing a farewell verse: *\"Embracing virtue in tranquility, preserving unity to achieve perfection—sky empty, moon bright, I roam freely in the Upper Clarity.\"* Having written this, he cast aside the brush and transformed. The grasses and trees...\n\nThe Golden Lotus Flower, according to the *Prefectural Gazetteer*, grows in a lake atop the stone summit of Xiandu Mountain, where a solitary rock thrusts into the sky. Local elders tell that golden lotus petals once drifted down from above. Dragon’s Beard Grass thrives on the cliffs of Solitary Peak. The old *Gazetteer* records: when the Yellow Emperor ascended in a dragon-drawn chariot, his ministers clung to the dragon’s whiskers as it rose; the whiskers fell and transformed into this grass. The Ancient Longevity Pines stand at the summit of Solitary Peak, their trunks thick enough to embrace, evergreen through all seasons—proof of the deep moisture of Solitary Peak’s Cauldron Lake.\n\nAmong the flora, many serve as medicinal herbs. Mountain hermits and rustic elders gather them, though their forms and flavors differ, and few know their names. Now, following the *Materia Medica*, we list below those species recorded therein—though not all are native to this land nor grow in abundance—to showcase the fine beauty of this renowned mountain:\n\n*Polygonatum*, *Acorus*, chrysanthemum, *Asparagus cochinchinensis*, *Ophiopogon japonicus*, *Plantago* seed, *Rehmannia*, *Achyranthes*, *Dioscorea*, *Coix*, *Morinda*, *Trichosanthes* root, *Dendrobium*, *Eupatorium*, *Selaginella*, *Gentiana*, *Inula*, *Senecio*, *Paeonia*, *Artemisia*, *Trachelospermum*, *Artemisia capillaris*, *Mosla*, *Tripterygium*, indigo, *Sedum*, *Pueraria* root, *Solanum lyratum*, *Epimedium*, *Clematis*, *Sophora flavescens*, *Angelica sinensis*, *Tetrapanax*, *Dichroa*, *Polygonum multiflorum*, *Lonicera*, *Paeonia lactiflora*, *Dianthus*, *Cibotium*, *Euchresta*, *Pharbitis*, *Anethum*, lily, *Imperata* root, *Dioscorea hypoglauca*, *Ricinus*, *Phymatodes*, *Arisaema*, *Curculigo*, *Anemarrhena*, mugwort, *Aristolochia*, *Valeriana*, *Artemisia anomala*, *Siegesbeckia*, *Pinellia*, *Isatis*, *Clinopodium*, *Cyperus* root, *Eriocaulon*, *Drynaria*, *Trichosanthes cucumeroides*, *Belamcanda*, *Ampelopsis*, *Euphorbia lathyris*, *Celosia* seed, *Rubus*, *Phytolacca*, *Siegesbeckia*, *Carpesium*, *Hemerocallis* root, *Prunella*, *Xanthium*, *Lycoperdon*, *Eupatorium*, *Skimmia*, *Placenta hominis*, *Schisandra*, *Aquilaria*, *Euphorbia pekinensis*, *Vaccaria*, *Stephania*, *Syringa*, *Rumex*, *Cirsium* root, *Asarum*, *Aconitum*, duckweed, *Elsholtzia*, *Perilla*, *Euonymus*, *Mentha*, *Equisetum*, *Oenanthe*, *Houttuynia*, *Abutilon*, *Commelina*, *Tribulus*, *Boehmeria*, *Zizania*, *Typha*, *Miscanthus*, *Musa* root, *Verbena*, *Kochia*, *Euphorbia*, *Artemisia stelleriana*, *Platycodon*, *Duchesnea*, *Eclipta*, *Aconitum*, pine resin, maple resin, *Firmiana* seed, *Acanthopanax*, *Lycium* bark, *Morus* bark, *Broussonetia* fruit, *Sophora* fruit, *Quercus* fruit, *Galla chinensis*, *Lycium* fruit, *Prunus japonica* seed, *Lindera*, *Phellodendron*, *Evodia*, *Cornus*, *Rosa laevigata*, *Melia*, *Gleditsia*, *Melia azedarach*, *Melia azedarach* (repeated), *Melia* flower, *Vitex*, *Photinia*, *Uncaria*, *Gardenia*, *Sapium*, *Cudrania*, *Salix*, *Zanthoxylum*, *Toxicodendron*, *Cunninghamia*, rice, millet, *Dolichos*, *Vigna angularis*, mung bean, barley, wheat, sesame, *Papaver*, pear, jujube, lotus seed, *Euryale*, pomegranate peel, *Castanea* burr, peach kernel, plum, persimmon calyx, *Actinidia*, loquat leaf, onion seed, lettuce, *Sonchus*, water celery, *Eleocharis*, alfalfa, *Artemisia*, mustard, garlic, leek, shepherd’s purse.\n\nCarved steles and inscribed verses accompany the Temple of the Yellow Emperor, where four large characters are engraved upon the stone.\n\nThe Tang dynasty magistrate of Jinyun, Li Yangbing, inscribed in seal script. The stele originally stood behind the Jade Void Palace but was later transported by county residents to the local academy. During the Qingli era, the *Record of the Academy* composed by Tun Suizhan was engraved on its reverse—this stone remains extant today.\n\nThe Tang dynasty’s Wei Jia composed the *Inscription of Mount Xiandu*, with seal script by Qian Shuyou (a Song dynasty figure). The Tang dynasty prefect Li Jizhen authored another *Inscription of Mount Xiandu*, with seal script by Zhao Bi’yuan (a former Song figure). The Tang poet Lu Guimeng’s *Poem on Mirror Cliff and the Abode of Master Zhou, with Preface*. In the second year of the Zhiping era of the Song, the Jade Void Palace was renamed by imperial decree, with the edict and ministry documents carved in stone.\n\nWu Shuo of Qiantang’s *Account of Accompanying Prefect Liu Dazhong on an Excursion to Mount Xiandu*. Sub-prefect Ding Zongdan’s *Poem on the Jade Void Palace at Mount Xiandu*. Prefect Xie Ji’s *Poem in Response to Transport Commissioner Li Shiju*. The county native Xiang Ying’s *Record of the Jade Void Palace’s Exemption from Taxes and Corvée*. The Hanlin Academician and Minister Zou Jingchu’s *Poem on Visiting the Jade Void Palace, with Postscript*. The Registrar of the Court of Imperial Sacrifices Wu Dashao’s *Poem for the Magistrate Zhan Xuyi*. Du Huizhi’s *Account of a Journey to Mount Xiandu*. Prefect Zhao Bi’yuan’s *Account of a Journey to Mount Xiandu*. Prefect An Liu’s *Petition to Alter the Palace’s Orientation*. The county native Qian Shuyou’s *Record of the Reconstruction of the Jade Void Palace*. The county magistrate Wu Zuwen’s *Poem on Solitary Peak*. Chen Renyu of Xianju’s *Poem on Visiting Mount Xiandu*, with his younger brother, the county magistrate Shao’ruo’s *Postscript*. All the above, from Wu Shuo of Qiantang to the magistrate Shao’ruo, were figures of the Song dynasty.\n\nDuring the Yuan dynasty, the magistrate of Jinyun, Shi Gu, and the emissary Xie Lei, along with Xu Yuanjin, composed *Poems on Praying for Rain*. The Yuan dynasty’s imperial edicts for the protection of the Jade Void Palace, including the full texts of the primary and secondary *Jia* and *Yi* documents, were carved in stone. All the above are located at the Jade Void Palace.\n\nThe *Stele Record of the Mystic Ruins* by the Recluse Master Liu. The Yuan dynasty’s imperial edicts for the protection of Miaoting Abbey, including the full texts of the primary and secondary *Jia* and *Yi* documents, were carved in stone. All the above are located at Miaoting Abbey.\n\nThe transport commissioner Ye Qingchen composed the *Inscription of Solitary Peak*, carved into the cliff at its base. During the Qingli era, Transport Commissioner Ma Xun; during the Huangyou era, Transport Commissioner Su Shun; during the Yuanfeng era, the Grand Guardian Zhao Qingxian; and over forty other renowned officials of past and present recorded the dates of their mountain excursions, all carved into the cliff at the Immortal’s Water Grotto. During the Qingli era, the county deputy Mao Weizhan accompanied Transport Commissioner Liu Yu on an excursion to Mount Xiandu, with his account carved into the cliff at the foot of Mount Buxu.\n\nDuring the Jiayou era, Shen Shen of Kuaiji; during the Xuanhe era, Liu Changqing of Kaifeng; during the Shaoxing era, Yu Siping of Qiantang; and over twenty other renowned officials of past and present recorded the dates of their mountain excursions, all carved into the cliff at the Valley of First Dawn. During the Shaoxing era, Guo Qifu, Jiang Shanzhao, Zhao Shanfu, and Yang Jing were dispatched by imperial decree to *Record the Prayer for Rain at Mount Xiandu*, carved into the cliff at Mirror Cliff. During the Jiading era, Liu Yuangang, Guo Leiqing, and others’ *Account of a Journey to Mount Xiandu* was carved into the cliff outside the Valley of First Dawn.\n\nThe three characters \"Little Penglai\" were inscribed by Lou Lun of Mingzhou, with a stele erected in the mountains. The county native Huang Bangyan’s *Poem on Solitary Peak* was carved into the cliff at Boy’s Peak. The county magistrate Wang Tan’s *Song of Little Penglai* was carved into the cliff. All the above, from Vice Transport Commissioner Ye Qingchen to County Magistrate Wang Tan, were figures of the Song dynasty.\n\nThe three regular-script characters \"Immortal’s Water Cliff\" were carved into the cliff within the grotto. The three large regular-script characters \"Valley of First Dawn\" were carved into the cliff within the valley. The three seal-script characters \"Master Ni’s Grotto\"—some say inscribed by Li Yangbing—were carved into the cliff before the grotto. The three seal-script characters \"Hidden Truth Grotto,\" \"Golden Dragon Grotto,\" the three clerical-script characters \"Heavenly Hall Grotto,\" and the three regular-script characters \"Forgetting Return Grotto\" were all carved into their respective grottoes.\n\nThe inscriptions and records of the mountain’s steles and cliff carvings have been noted above; below are excerpts of their texts. All poems and compositions by ancient and modern renowned figures are published separately.\n\n---\n\n**Inscription of Mount Xiandu**\nComposed by Wei Xiang of the Tang\n\nLofty stands the Immortal’s Capital,\nTowering above all peaks, rivaling Mount Song.\nErect to the right, hewn in the east,\nIt rises from the earth, straight and square,\nScraping the heavens, vast and high.\nA sacred pool crowns its summit,\nAuspicious clouds gather within.\nA jade altar soars a thousand fathoms,\nA pillar upholding the four bounds.\nThe eye cannot reach its end,\nNor can winged flight traverse its expanse.\nMyriad hills hasten in obeisance,\nWhere immortals convene in assembly.\nThe Yellow Emperor once sought it,\nPiercing the azure ridges.\nCinnabar caves rise beside it,\nGolden streams flow below.\nSunlight kindles the rosy clouds,\nMoonlight dissolves the mist.\nIts soil is untouched by dust,\nIts trees host no wandering flocks.\nDwelling in seclusion yet unobscured,\nHolding to the One, it stands mighty.\nEchoing the ten thousand ages,\nThe nine harmonies resound in emptiness.\nA propitious name returns,\nGrand rites are here performed.\nTo record and admonish,\nTo pray and commune in gratitude.\nNone is higher than compassion,\nThe work of Creation itself.\nThe primordial chaos shaped its form,\nThe fertile earth nurtured its spirit.\nCrowned among mountains,\nSolitary and towering.\nStanding tall to pierce the heavens,\nIts vapors swirl in the azure void.\nMists congeal at the cinnabar caves,\nRosy clouds streak the cloud-screen.\nAbove, it grates the nine heavens,\nBeside, it obstructs the five stars.\nThe dragon’s beard remains unseen,\nThe phoenix’s pipes are heard at times.\nDescending from the sacred and martial,\nSeeking it without rest.\nVainly hearing of desolate governance,\nNever prolonging life.\nThings possess their distinctions,\nThus the ancients inscribed this.\nHere I engrave these words,\nA beacon for Jinyun.\n\n---\n\n**Inscription of Mount Xiandu**\nComposed by Zhang Lu\n\nMount Xiandu possesses a mountain,\nA mountain among ten thousand mountains.\nIt ascends a thousand fathoms,\nLost in the depths of mist and clouds.\nRound as a measuring tool,\nLofty, piercing the clouded shade.\nA landmark for the realm below,\nThe origin of the Emperor’s image.\nIs it the sun? Is it the moon?\nTen thousand things, a thousand years.\nThe great eastern bulwark,\nGuarded by rivers and marshes on four sides.\nCreation knows no bounds,\nIts origins unknowable.\nClear mists linger,\nThe night’s fog disperses, revealing the grotto.\nWith the semblance of topknots and tresses,\nThe immortals descend.\nGathering qi in swirling mists,\nSpiritual birds circle in return.\nForever apart from worldly dust,\nNot stirring the slightest speck.\nAt its summit, the heavens startle,\nA limpid lake lies above.\n\nFew mortals reach this place—who could describe its form?\nSunlight pierces the clouds, wind scatters mist into flight.\nLike rain falling through empty air, a fine spray dampens the robes.\nFrom the valley comes the sound of pines; the pool mirrors dawn’s glow.\nNow and again, cranes alight—none know where they go.\n\nThe Tang endured a hundred years; Xuanzong embodied the primal.\nHis \"Long Live the Emperor\" echoed to the heavens above.\nThe imperial virtue shone bright; here stands his shrine.\nEver do we cherish the Yellow Emperor, who perfected his work upon this land.\nThe cinnabar turtle endures; the dragon soars ten thousand li.\nHis deeds fill the gazetteers; his Dao towers in the annals of history.\nNo immortal visage remains—only the stream flows on.\n\nWithin the hundred Yue, this mountain stands supreme.\nAs if within a pot of immortals, yet beyond the realm of form.\nStraight yet not leaning, lofty yet not perilous.\nFrom ancient times to now, it stands alone above the sea.\n\n---\n\n**Inscription by Ye Qingchen, Vice Commissioner of the Zhejiang Circuit**\nThe Yellow Emperor’s chariot tracks and horse prints spanned the realm.\nWhen his elixir was complete, clouds arose—thus was this auspicious mountain named.\nThe ascent of this solitary peak was surely destined.\n\nAs I oversaw the transport of grain through the two Zhe regions and toured the Kuocang Mountains,\nI personally sought the immortal traces of Xiandu.\nMoved by the folly of Qin and Han, which measured not their own limits,\nI reined my horse by the stream and inscribed this stele upon the mountain’s shade.\n\nOh, how resplendent was the Dao, how exalted the Emperor’s primacy!\nThrice he ascended, fivefold his achievements—his virtue whole, his merit vast.\nShedding his mortal coil, he loathed the world, riding clouds to heaven.\nHe tamed the flying dragons, reaching the August Sky.\nYet Qin’s tyranny and Han’s extravagance waged endless wars, their reigns drowned in sorrow.\nForgetting this ancient lesson, they stumbled upon the cliffs.\nHere, the divine immortals stand aloof, their solitary grace untouched.\n\n---\n\n**Poems Inscribed**\n\n**By Bai Juyi, Academician of the Secretariat**\nThe Yellow Emperor’s banners and standards never returned;\nA lone cloud, a solitary stone, stands towering.\nAt times, wind stirs the waves of Ding Lake,\nScattering them as raindrops across the clear sky.\n\n**By Xu Ning, Former Presented Scholar**\nHeaven and earth stretch boundless through past and present—\nHow many have sought the immortal precincts of Xiandu?\nArriving, one sees only the mountain’s rise and fall,\nNever knowing the lake’s depth.\n\n**Two Poems by Cao Tang, Vice Commissioner and Academician**\nThe peach blossoms of Huayang wither in the east;\nThe Yellow Emperor ascended, leaving the six palaces behind.\nHis banners and standards silently welcomed him to the azure vault;\nThe sound of reed pipes and songs drifted from distant Kongtong.\nHis robes and cap remain buried beneath the moon of Qiao Mountain;\nHis sword and sandals follow the winds of the Eastern Sea.\nGazing at the dragon’s whiskers, one cannot grasp them—\nRed mists scatter, Ding Lake lies empty.\n\nWhere the Yellow Emperor ascended, the years blur into green.\nA solitary peak seems to block the sun; a single pillar props up the sky.\nStrange stones harbor nesting cranes; idle clouds hint at immortals.\nDing Lake is lost from sight—only a few lotus stems remain.\n\n**By Lu Guimeng, Recluse of Rivers and Lakes**\nI hear your body is lighter than a crane’s,\nDwelling in a stone chamber with clouds, free of worldly ties.\nAt dawn, you carve fragrant persimmons;\nAlone at night, you chant scriptures of the azure void.\nThe essence of ten caves you absorb in flight;\nA single autumnal lock of hair remains unkempt.\nKnowing you’ve entered the assembly of the Suspended Pearl,\nSoon you’ll ride a white carp.\n\n*(From the* Xiandu Annals*: Jingyan is the Immortal’s Water Grotto.)*\n\n**By Pi Rixiu, Erudite of the Court of Imperial Sacrifices**\nFor eighty years and more, you’ve dwelled in Jingyan,\nA deer-skin cap beneath your snowy locks.\nThe bed grows cold, unbearable with clouds coiled round the pillow;\nThe scriptures dampen—no matter if stalactites drip upon their cases.\nThe drinking ape peers back from the abyss;\nThe green ladder leans against a perilous fir, its climber at rest.\nHow could a petty clerk, bound like a crow,\nEver hope to set sail for Xiandu?\n\n**By Li Jianzhong, Vice Commissioner of the Two Zhe Circuits**\nMajestic, the mountain of Xiandu;\nSolemn, the palace of the Yellow Emperor.\nA colossal stone overlooks the vast marsh,\nA thousand fathoms piercing the high vault.\nIt arose at the dawn of creation, bearing the work of the Maker.\nDeep enough to coil the fertile earth, sheer as if slicing the soaring swan.\nThe cloud-wrapped path remains; the alchemical tripod’s edge is empty.\nEmerald moss glistens in the crevices; fragrant lotus leaves bloom red.\nThe ascending dragon clings, proud and fierce;\nThe flying phoenix cries, its voice ringing.\nI, who serve in the Bureau of Immortals, have long compared it to Penglai’s might.\nAs stars shift past Weinu, the wind-borne chariot nears the eastern sky.\nArriving, I feel my bones and flesh refreshed,\nAs if borne aloft on wings.\nWorldly affairs are but dust and haze;\nA single breath returns to the primordial vastness.\nHow distant the sagely Dao—\nVast as the mysterious workings of creation.\nWith golden tablets, I offer utmost sincerity;\nWith jade inscriptions, I record an age’s labor.\nWhen my work is done, I’ll lay aside cap and sword,\nAnd dwell in peace upon this mountain.\n\n---\n\n**By Liang Ding, Prefectural Aide**\nThe Yellow Emperor’s stone of ascension,\nIts lofty name rivals the Dipper and Ox.\nIts solitary root slants over the water;\nIts chill hue knows not autumn.\nTiny beside the clustered peaks,\nRound as a measuring tool.\nAt dawn, it obstructs the setting moon;\nIn clear skies, it intercepts the falling stars.\nPerilous yet steadfast, surpassing Kunlun’s gates,\nOne who climbs it should glimpse Yuzhou.\nMy love for it knows no end—\nThe sun sets, yet I linger.\n\n**Three Poems by Sun He, Academician and Vice Commissioner**\n\n**I**\nJade towers and gem palaces wreathed in purple mist,\nThe phoenix’s immortal music still lingers.\nThree thousand years have passed since the events of Ding Lake;\nThe green stalagmite stands ten thousand fathoms tall.\nIt stands erect, allowing no common weeds to grow;\nIts sheer form repels the dust of the vulgar world.\nWhere now are the rainbow banners and crimson staffs?\nOnly the lotus flowers bring tidings of the divine.\n\n**II**\nNo way to hang even a strand of ivy,\nYet the Creator’s chisel must have labored here.\nIts jade-like form points straight to the Milky Way’s descent;\nIts cassia shadow divides the tides of the Eastern Sea.\nFive thousand feet from earth—what worth is that?\nThree hundred li from heaven—still not high enough.\nBy the Yellow Emperor’s tracks, the traces remain;\nAtop the Dipper, a ladder of feathers ascends.\n\n**III**\nThe Yellow Emperor ascended and never returned,\nLeaving only this stone among men.\nA thousand fathoms of misty height prop up the red sun;\nFor ten thousand ages, it towers above the crowd.\nDamp mists and lovely blossoms weary the palace maidens;\nLeaning on clouds, the towering trees idle the Feathered Forest.\nYet men of this age do not believe in the path of flight—\nThe dragon’s tracks and whiskers are there for the climbing.\n\n**By Wang Hanzhang, Prefect**\nFor three years I governed this land, revering its sacred traces,\nYet never found the chance to draw near.\nEver do I linger, gazing at its paintings,\nFor truly, the sun-drying toad dwells in the void.\nClouds gather at the lake’s summit, untouched by dust;\nCranes stand upon the pines, the path beyond reach.\nSpring passes by Creekside; few partake of its fare—\nThe ancient altar lies desolate, veiled in rain.\n\n**Two Poems by Zhou Qiming, Vice Minister of the Court of Imperial Sacrifices, of This Prefecture**\n\nHow deep is the Cauldron Lake?\nIt stands like the Dipper, pointing to the empty vault.\nThe thunderbolt’s cleaving cannot diminish it—\nThe lotus blooms ever higher.\n\nTo ascend, one must ride the crane;\nTo bear the weight, rely upon the turtle’s back.\nA thousand fathoms—□ □ □—\nWhen shall another follow our path?\n\nThe toad, a pillar propping the heavens,\nFrom afar seems to tread the void in step.\nAwaiting the climb to the ridge’s end to view Mount Hua’s peak,\nAgain one sees its towering majesty piercing the sky.\n\n---\n\n**Two Poems by Zeng Hui, Erudite of the Court of Imperial Sacrifices and Archivist, Acting Prefect**\n\nOften I unfurled the painted scrolls;\nNow, glad to arrive at the Immortals’ Capital.\nI take in all the mist and rosy clouds,\nAnd only then know the artist’s skill.\n\nA single pillar upholds the heavens,\nFrom the earth it rises, ruling the Three Luminaries.\nMoss seals the carriage tracks,\nLotus fragrance drifts over the Cauldron Lake.\n\nThe wind arrives from the sea realms,\nThe sun is welcomed upon the cloud thoroughfare.\nLike bamboo shoots, a thousand fathoms straight,\nLike indigo, spreading on all sides.\n\nIts beauty channels creation’s work,\nIts height defies all grasping hands.\nThunder and rain birth the crag’s treasures,\nStars and constellations watch the distant alchemical furnace.\n\nJinhua shames the scolded stone,\nThe Jade Maidens gaze at the tossed arrows.\nThe ancient altar still stands,\nIts stele overgrown, half its characters lost.\n\nNever did I lose my way like Ruan Zhao,\nNor weary of drunkenness with Ma Gu.\nBeyond the dust, its name stands apart,\nIn the void, its shadow stands alone.\n\nIt mocks Qin’s inscriptions on Mount Tai,\nAnd disdains Shun’s burial in Cangwu.\nIn summer, the wind fills the air;\nIn autumn, the frost does not wither the grass.\n\nThe void-treading song drifts from feathered guests,\nDripping jade wets the woodcutter’s clothes.\nAlone it is hailed as the leader of Yingzhou—\nI chant as I behold the prefect’s seal.\n\nFor over a decade, Yingzhou’s wind and moon,\nBound, I left the cloud hall to govern this prefecture.\nNow, arriving at the deepest mist and rosy clouds,\nClearly, the scenery is the Immortals’ Capital.\n\n---\n\n**By Chen Ruozhuo, Prefect**\n\nFrom the earth it rises, upholding the heavens,\nIts roots coil over acres of mist.\nNature’s craft forges its abrupt majesty,\nIts tracks near, as if carved and chiseled.\n\nSteep and sheer, it leans on nothing,\nSolitary and lofty, none can match its height.\nFrom here the Yellow Emperor departed—\nWho knows how many thousand years have passed?\n\n---\n\n**By Liu Shen, Vice Director of the Bureau of Literary Composition and Fiscal Commissioner of the Two Zhe Circuits**\n\nAlone it rises above the peaks,\nA fathom round in its circumference.\nA thousand fathoms, it stoutly anchors the earth,\nTen thousand fathoms, it props up the heavens.\n\nAmid lake waves, stars stir at the horizon’s edge,\nLotus blooms emerge where the sun’s rays descend.\nOne day I shall ride a cloud-borne crane,\nTo meet immortals atop the loftiest peak.\n\n**By Hu Zhidao**\n\nThe Immortals’ Capital, an ancient grotto-heaven,\nIts cloud-gate towers rise in solemn grandeur.\nNewly appointed, I rejoice in its completion,\nWhere azure tiles gleam like scales in ordered rows.\n\nThat night, I lodged in the silent chamber,\nAnd in the sixth month, all heat dissolved.\nPine winds arose in the midnight hour,\nStartling my pillow—dreams turned restless.\n\nHeaven’s breath sighed through the void,\nJade flutes chimed in crystalline clarity.\nPhoenix songs harmonized with celestial tones,\nCranes danced, keeping perfect time.\n\nWho is to say these were not the immortals,\nFeasting, then parting with jade pendants’ chime?\nAll my life, I’ve known only zither and flute,\nBut here, a thousand thoughts dissolved in an instant.\n\n*(Written after spending the night in the Immortals’ Capital, where the sound of pines seemed to echo the ringing of jade ornaments—so clear and resonant it felt as though celestial pendants chimed. I rose early to witness it.)*\n\n**By Li Hou, a man of immortal talent,**\nWhose grasp holds the cosmos entire.\nHis ancient seal-script boasts bold majesty,\nIron strokes bound with golden clasps.\n\nHe inscribed the Yellow Emperor’s shrine,\nWhere the hall’s daylight brims with primal power.\nOne imagines him at the moment of inscription—\nCloud and marsh swallowed eight or ninefold.\n\nOn storm-wrought nights, tradition tells,\nDragons and serpents writhe in ink.\nStrange lights burst from the crag’s treasures,\nGrasses and trees steeped in undying luster.\n\nSpirits, vexed by his command,\nSuddenly lost their hold.\nThey fled with the mist in swift ascent,\nVanishing from the mortal world.\n\nInquiring among mountain folk,\nI found the stone inscriptions still intact.\nWho could renew them with ease,\nAs if moving them with a mere turn of the wrist?\n\n*(Inscription for the Hall of the Yellow Emperor, written in Li Yangyong’s seal-script)*\n\nSpeak not of immortals’ affairs as distant and vague—\nFor now, wander the dusty world and harmonize with its light.\nWho could know that this true retreat today\nWould become the very land of ascension in years to come?\n\nAfter morning rites at the jade altar, clouds fill my sleeves;\nIn dreams, I return to the golden palace where moonlight spills across the corridors.\nThis journey feels as though I tread the azure heavens,\nFaintly hearing the chanting of grotto hymns.\n\n*(Inscription for the Hall of Hidden Truth)*\n\nThe Yellow Emperor rode clouds to the imperial realm,\nLeaving only wheel-ruts locked in the vault of heaven.\nWhere now are the vast alchemical crucibles?\nThe trailing rainbow banners fade beyond sight.\n\nYet this land of streams and peaks gains grandeur,\nTruly, grasses and trees bask in its radiant grace.\nI stand long at the railing, gazing—\nHow could I not, with feeling, recall the Lord of Chu?\n\n*(Inscription for the Pavilion of Gazing at Snow)*\n\nA hundred years pass like a gallop on horseback,\nYet in leisure, one may still cultivate life’s essence.\nThe crimson gates of the Pure Capital are not so distant—\nA foot of field, an inch of dwelling, well-tended.\n\nSilently preserve the Three Officials’ presence,\nGuard vigilantly lest the Five Peaks topple.\nOne day, when merit is complete and ascension assured,\nI shall follow the wind’s chariot to Penglai’s isles.\n\n*(Inscription for the Chamber of Cultivation)*\n\nFor years, ensnared by worldly mechanisms,\nMy form and spirit grew ever more common.\nOf late, my dreams and soul have cleared—\nNow, I find surpassing delight in forests and foothills.\n\nThe prefecture’s peaks coil like a maiden’s braids,\nAll vivid before my eyes.\nCold jade’s chill darts forth,\nThe essence of beauty—one could cup it in hand.\n\nComposing poems in the triple-heat of summer,\nA cool wind rises from the secluded valley.\nI fear it may blow through my robes,\nTransforming them into cloud-woven brocade.\n\nWhile others sweat and toil in pursuit,\nI ascend and descend in carefree chase.\n\n*(Inscription for the Pavilion of Vying Beauty)*\n\nThe immortals’ days and months pass slowly,\nSpring’s blossoms ever fragrant.\nI long to pluck jasper and jade blooms,\nTo chew the rich marrow of clouds.\n\nYet I fear the depth of floral mist,\nIts fragrance soaking my robes.\nSeated, reciting verses, my heart still unfulfilled,\nMy dreams return to the distant mountain door.\n\n*(Inscription for the Pavilion of Plucking Fragrance)*\n\nThe hymn of the Lady of Purple Tenuity sings:\n*\"Auspicious clouds coil the cinnabar furnace, refining jade into eightfold radiance.\"*\n\nBeyond the gate, no worldly carriages,\nOnly clarity lingering in the eye.\nAt dawn, I ascend the rosy-gate tower,\nIts eight windows all aglow with emptiness.\n\nThe Three Lights shine resplendent,\nAll phenomena laid bare without concealment.\nBehold the alchemical brush at play—\nCloud-script, all heaven-wrought.\n\n*(Inscription for the Chamber of Radiant Illumination)*\n\nThe *Yellow Court Scripture* says:\n*\"The Three Lights’ brilliance enters your chamber.\"*\n\nAscending the towering heights, treading layered peaks,\nThe cloud-steps stretch near a hundred feet.\nA lifetime of dust-clad feet—\nHow many times have I reached such a place?\n\nHere stands a crag, untouched,\nAs though heaven itself had carved it.\nJade springs spill from the stone altar,\nRaindrops scattering into cold jade.\n\nI come to prepare tea,\nBoiling nectar in a pine-wood cauldron.\nThe lingering sweetness fills mouth and cheek,\nEnough to rouse the drunken soul.\n\nEver do I cherish the crane-haired elder,\nWho, like Zhou Jing, once dwelled here—\nNow, gazing all around, only empty walls remain.\nIt seems he departed in an immortal’s flight,\nLeaving only mountain crows to guard the place.\n\n*(Inscription for the Immortal Water Grotto)*\n\nFine mountains are like old friends,\nJoyfully meeting their brows and features.\nLike combing morning tresses,\nRed and green hues vie in charm.\n\nHow much more for one who loves mountains—\nGrasping the brush, delighted to compose.\nA crag yawns open,\nInviting unhurried steps.\n\nThis pure excursion is not without merit,\nIn such a sublime realm, one feasts on beauty.\nSweeping the stone, I sit as evening chills,\nThick verdure dampening cap and sandals.\n\nFine blossoms prolong spring’s delay,\nScattering crimson mists in profusion.\nWhere do the immortals dwell?\nI fear I’ve strayed into Peach Blossom Spring.\n\nI lingered the whole day,\nWaiting only for the mountain moon to rise.\nFollowing the flowing stream home,\nI no longer recall the path I came by.\n\n*(Inscription for the Grotto of Forgotten Return)*\n\nMountain mists rise in lush verdure,\nStream waters flow in boundless expanse.\nThe world’s people, ever-changing,\nShift like autumn grasses.\n\nWondrous, the Three Grotto-Heavens,\nTheir linked paths deep and secluded.\nThe sunlit crag catches the dawn’s first rays,\nRevealing the break of Fusang’s day.\n\nWho can feast on ninefold blossoms,\nTo keep their complexion ever fair?\nThe immortals shed their earthly husks and depart,\nLeaving no trace to trace.\n\nI come, content in my ascent,\nSeeking hidden wonders with care.\nA sorrowful whistle—hearing the valley apes,\nA chirruping chorus—listening to the calling crows.\n\nAll my life’s pent-up frustrations,\nHere, at last, are swept away.\nSoon, I shall cast aside my official tablet,\nTo wander boundlessly beyond the eight wilds.\n\n*(Inscription for the Valley of First Light, also called the Grotto of Ni Fang)*\n\nHow towering is this mountain!\nI long to climb, grasping vines and creepers.\nStrange rocks crouch like tigers,\nAncient plants arch like rainbows.\n\nWithin lies an ancient grotto-heaven,\nCleaved as though by heaven’s hand.\nSince the dawn of creation,\nSun and moon have marked its dusk and dawn.\n\nHere, the divine dragon coils in repose,\nThunder-jades gleam in dense array.\nWhenever drought parches the land,\nThe mountain elders must offer prayers.\n\n*(Inscription for the Grotto of the Divine Dragon)*\n\nAmidst sweeping glances, layered clouds arise,\nOlive branches dance, the hundred rivers flow reversed.\n\nWhen shall I bid farewell to fish and shrimp,\nTo rise with thunder, soaring into the boundless vast?\n\n*(Inscription for Dragon’s Abyss Grotto, now called Zanlong Grotto)*\n\n**Prefect Liu Can**\n\nHere the ancient emperor ascended as immortal,\nHis rainbow banner never to return.\nBeyond the lone peak, beyond the azure ridges,\nIt stands erect amid the purple haze.\n\nAbove and below, its form is a pillar of the earth,\nAll around, its shadow turns like a ring.\nIts roots seem to entwine with the sea’s embrace,\nIts summit strains to breach heaven’s gate.\n\nA lotus emerges from the lake’s distant heart,\nMoss mottles the wheel-ruts’ edge.\nBeside it lies the alchemist’s cauldron,\nBelow, one gazes upon the ethereal mountain.\n\nHow could apes or monkeys ever reach this place?\nYet phoenixes and simurghs may freely ascend.\nBy day, it boasts a name of subtle renown,\nBut reciting its grandeur daunts even the bold.\n\nCrow’s Gorge lacks true numinosity,\nOrchid Rock scorns idle leisure.\nHere in Jinyun, where wanderers roam,\nIts wonders surpass all within the mortal realm.\n\n**County Registrar, Collator of Books Mao Weizhan**\n\nSteep and towering, the abode of immortals,\nI come seeking its mist-laden depths.\nBelow, it coils through the ninefold earth,\nAbove, it yields not to the thronging peaks.\n\nGazing upon its marvels by day,\nEven grasping the green cliffs seems impossible.\nWhen might one descend beneath the lotus leaves,\nSealed for all time by moss-woven patterns?\n\nThe past is as elusive as drifting clouds,\nYet the path remains, silent but marked.\nWhere now the distant Mount Qiao?\nI shall follow and ascend with the dragon.\n\n**Transport Commissioner Su Shunyuan Qiuweng**\n\nDragon chariots and phoenix carriages enter jade laughter,\nBy the wheel-ruts, high-hung wonders none may climb.\nOnly the wind stirs the eternal waters of Ding Lake,\nAs blue lotus petals fall among men.\n\n**Zhexi Inspector of Wuxing Shen Gua Cunzhong**\n\nMoss seals the imperial path upon the green mountain,\nThe crane-drawn chariot soared to distant skies, never to return.\nOnly on autumn moonlit nights by the Silver River,\nDo the mists and waves of Ding Lake reach mortal ears.\n\n**County Native, National University Student Hu Fen Ziwen**\n\nA bird’s path coils through the empty sky,\nPine roots embrace the living stone.\nFeathered beings divide their dwellings,\nWhile the cries of chickens and dogs are heard.\n\n**Zhexi Judicial Commissioner, Ruxu Yang Jie Cigong (Three Poems)**\n\nA path leads into the immortal capital,\nYet who has reached Ding Lake?\nThe autumn wind blows fiercely at night—\nHas it blown away the azure lotus?\n\nAsk the way through yellow and jade,\nPierce the clouds to enter the purple clarity.\nWithin the woods, pines turn to stone,\nBeyond the gate, jade forms the city walls.\n\nThe Daoist does not love the mountain,\nYet having left the world, he has grown old.\nThough he knows the traces of chariot tracks,\nHe does not recognize the dragon’s-beard grass.\n\n**Prefect Liu Jing Juji**\n\nStone walls and cloud-pavilions embrace Floating Hill,\nHere once dwelled the Perfected One of ancient Kuazhou.\nIf one could cast the immortal’s map to vie in wonders,\nWho would know the joy of wandering a grotto-heaven?\n\n**Qin Prince’s Nephew, Inscription at the Yellow Emperor’s Shrine**\n\n**Daguan Era**\n\nI cross the stream to seek a desolate village,\nWhere peaks surge like ten thousand galloping horses.\nThe spring’s lush hues follow the thunder’s clearing,\nMisty vapors veil the mountains, still dim with dusk.\n\nJade towers and golden palaces once filled the earth,\nNow half the pines bear the scars of axes.\nTo cleanse the world of dust and filth,\nWould that a single torch of kalpa-fire could burn it all!\n\nTravelers bow in reverence, their horses kneeling,\nI can speak of the wondrous truths of Xiandu.\nThe awe of his divine might lingers, stern as if he were present,\nEven now, from his terrace, the shrine honors Xuanyuan.\n\nIn those days, he robed himself and faced the south,\nHis creations drawn from Qian and Kun.\nHe cleaved the primal chaos to begin the human age,\nFirst establishing the roots of the world’s divisions.\n\nFeng Hou and the shepherds came in succession,\nUnfurling divine strategies to shape the formless.\nFirst, he sought the Way from Guangchengzi,\nLater, he secretly aligned with Zhonghuang Jun.\n\nHis merits and virtue vast, beyond compare,\nNearly rivaling the Creator in bestowed grace.\nFrom distant Tang Yao to the fiery destiny of the Yan,\nFor ten thousand years, sage-sons and divine grandsons endured.\n\nThe Perfected One ruled the world with the eternal Dao,\nHis ascension so effortless it scarcely merits discussion.\nYet from the One Qi arose the ten thousand things—\nWhy then divide heaven and humanity?\n\nFu Xi’s eight trigrams were already broken,\nNü Wa sought to mend them, but the task was too great.\nHe drifted back alone to the Pure Capital,\nGathering creation’s essence into perfect wholeness.\n\nBefore the shrine, the immortal stone stands through the ages,\nTowering between heaven and earth, vying in majesty.\nDing Lake may be glimpsed but never reached,\nIts intent to leave later ages with no path to climb.\n\nWithin the summit’s mystic palace, called the Mud Pill,\nA natural road leads to the union of heaven.\nWhen this body’s inner and outer qi converge,\nOne transcends life and death in a single bow.\n\nSilently, the four seasons turn without anomaly—\nObserve the sun and moon: who swallows, who spits?\nEven now, by the lake’s edge, wind and rain are sent forth,\nGrasses and trees sway like banners and pennants.\n\nTen-foot red fungi drift down,\nA jade-green stream plunges into a glass basin.\nNo need for horse hooves or chariot tracks—\nThough lost in Xiang’s wilds, the Way remains.\n\nAt night, the mountain springs roar through a hundred valleys,\nThe music of Dongting Lake can still be heard.\nThe ancient hues of mountains and rivers hold profound meaning—\nWho will clear the source and illuminate the root?\n\nI speak of the subtle and the simple, returning to purity,\nNo need for disputation or surging waves.\nLet it be.\n\n**County Native, Hubei Transport Commissioner Hu Sheng Zishang**\n\nDing Lake cannot be seen,\nOnly a lone peak stands, towering.\nIt endures through all ages,\nIts qi overawing the surrounding mountains.\n\nThe Yellow Emperor long attained immortality,\nRiding a flying dragon on his journeys.\nTo this day, common tales persist,\nPointing to the path where his chariot passed.\n\nMuch like the cypress of his ascension,\nOr the pursuit of the white deer’s trail.\nSuch talk is often dismissed as absurd,\nYet the sight of it would truly be childlike.\n\nBut consider this mountain’s marvels—\nTruly, it is a fitting palace for immortals.\nThe sound of water comes like tinkling wind,\nHarmonizing with ten thousand pines.\n\nThe traveler’s pillow long unsettled,\nFlutes and reeds fill the empty void.\nI suspect these are the Nine Harmonies,\nYet not found in the Two Classics.\nI fear only the banners of Chiyou,\nFlashing and clamorous, unfurling like long rainbows.\nThough he alone could not die,\nHow could he bear to see the people suffer?\nBehold the Battle of Zhuolu—\nFor ten thousand ages, they have reaped its fruits.\nWhat is Ding Lake to speak of?\nThe Emperor’s virtue spans the vault of heaven.\n\n**Vice Magistrate of Yanling, Ding Zongdan of Shaoxing**\n\nIn the world, thirty-six grotto-heavens,\nJinyun is the twenty-ninth realm.\nAncient trees pierce the sky, bearing cloud-palaces,\nThe true and numinous near—called the Immortals’ Capital.\nA lone peak stands sheer, two thousand feet,\nJade-green, towering in solitude against the sky.\nGazing up to its mist-wreathed summit,\nOnce named Ding Lake for the Miao tribes.\nOld tales say the Yellow Emperor halted his chariot here,\nClouds paired, winds harnessed, passing this way.\nIn a stone cauldron, he refined cinnabar into elixir,\nThen rode a dragon to the Emperor’s realm in but a moment.\nBeyond the purple void and azure firmament,\nHis ministers had no path to grasp the dragon’s whiskers.\nThe Tang dynasty’s Son of Heaven, of Li’s line,\nHis virtue matched Heaven’s will, bringing auspicious signs.\nAuspicious mists and propitious vapors spread like ministering clouds,\nNine transmissions in the mountains, ten thousand years’ acclamation.\nStep into the void, peaks face each other, clouds break and continue,\nEast and west, their heights and depths diverge.\nBy the stream’s secluded path, ascend the raven’s trail,\nAbove lies Mirror Cliff, like a square pot.\nWithin the rock, dripping stalactites weep,\nForming hollows like upturned basins.\nEach day and night, a *hu* and a half of water,\nNeither flooding in rains nor drying in drought.\nLu Wang once recorded Zhou Jingfu,\nWho fasted, consumed auroras, a follower of the Yellow and Lao.\nDwelling in truth, wondrously entering the assembly of suspended pearls,\nHe hid here for over eighty years.\nThrough the ages, seas and mulberries have changed,\nThe immortals’ traces—are they still, or gone?\nThough Stone Gate’s waterfall is said to be fine,\nThis place’s wonders are not easily matched.\nNature has so concentrated its divine beauty,\nEven a master painter’s hand could scarcely capture it.\nThese accounts emerge from illustrated classics and auspicious poems.\n\n**Transmitted by Langzhong of Qiantang, Wu Shuo**\n\nIt has long been said that Ding Lake is a fine abode,\nThis journey makes me wish to reach the Pure Capital.\nJade bamboo shoots rise a thousand *xun*,\nGolden lotuses, ten *zhang* tall, have fallen to earth.\nBy the river, I long to sleep beneath a single pillar,\nToday, by the sea and mountains, I rejoice to know Penglai.\nI must purchase goose-city silk,\nTo paint a water-and-ink scroll of Penglai’s shores.\n\n**Han Yuanji of Shangrao, Three Poems for Master Fu of the Stream**\n\nBeyond the balustrade, wind high, frost moon bright,\nIn Step-in-Void Mountain, the sound of stepping into the void.\nThe qin silenced, candles carved through the long night,\nAgain, one asks of man—this dream is clear.\n\nThe Feng and Shan sacrifices left only an undying name,\nIn Huaqing Palace, they longed for longevity.\nIdle clouds spread as man’s auspices,\nAgain, the mountains resound with ten thousand years’ acclamation.\n\nDragons and tigers drove the battle at Banquan,\nThe tripod cast at Mount Jing, then ascension to heaven.\nWherever the Yellow Emperor passed, traces remain—\nHow could a lord not learn to seek immortality?\n\n**Transport Commissioner Li Shiju**\n\nPassing beneath the Immortals’ Capital,\nThe stream deep, grasses and trees at leisure.\nFarmers’ affairs shift with sun and shade,\nThis heart is bound to their harvest’s plenty.\nWho carved this thousand-*xun* stone?\nClouds veil the ten thousand-fold mountains.\nThe royal journey has its limits—\nHow could one ascend further?\n\nAcross the four seas, no dust, warhorses idle,\nRice, millet, mulberries—green circles all.\nWho knows it is all the lord’s power?\nLayered mansions face the fine mountains.\n\n**The above were composed at the Xu family’s mountain retreat in Xiandu, seen in the old *Kuozhang Continued Collection*; now Prefect Zhongwen of Yun has composed in this rhyme.**\n\n**Prefect of the Prefecture, Xie Ji of Yangxia, in harmonious response**\n\nThe carriage of office gleams afar,\nThe court’s chariot has no leisure.\nInquiries and inspections press urgently,\nReducing taxes is of utmost concern.\nDeparture and stay find voice in lofty song,\nSun and shade face the fine mountains.\nThough briefly lodged in the prefect’s sash,\nThe immortal realm is not for climbing.\n\nThe aged lean on staffs, young boys idle,\nDistant huts by clear streams, green waters encircle.\nVying to see the curtained carriage, yet shunning the relay,\nIn stillness, no clappers or drums—only love for the green mountains.\n\n**Zhejiang Eastern Transport Commissioner, Master Zhu Xi of Hui’an, in pursuit of the Xu family mountain retreat’s rhyme**\n\nA lone cloud from the cave-mouth, its intent at ease,\nNo hindrance to official duties, like linked rings.\nUnsaddling, lingering on the stone steps, forgetting to return,\nThe azure stream and tall bamboos seem like home.\n\n**Native of the Prefecture, Wu Jinwei, Five Poems on Wandering Xiandu**\n\nA minor post drives me, dreading official dispatches,\nGold softens, summer’s heat fouls the journey.\nReturning, I resolve to seek the true realm,\nThe path to Xiandu—no fear of its winding ways.\n\nBefore the chariot-trace peak, I briefly rest,\nAt the cave’s mouth, forgetting to return.\nThose who chase fame and profit, restless,\nRarely set foot in Xiandu.\n\nA yellow-capped Daoist, old and gaunt,\nFacing me, discoursing on the mysterious—nothing to say.\nHe urges me not to sink in the sea of office,\nFor in this world, there is also Xiandu.\n\nThe stone bamboo is said to be eight hundred *zhang*,\nDing Lake’s immortal gone for thousands of years.\nI doubt these two matters have any governance,\nBut believe Xiandu is a grotto-heaven.\n\nMountain rains lightly dust the earth,\nBefore the gate, cranes cry shrilly to greet me.\nThus, I dream a Xiandu dream,\nThen seek traces to find the hidden truth.\n\n**Prefect Xu Yin of Jue Min, in harmonious response, Shaoxing**\n\nXiandu’s traces linger in old books,\nWhen I wish to return, I’ll ask the way again.\nSuddenly, new poems come like paintings,\nMountain paths and wild trails need no winding.\n\nMountain cranes complain of no place to seek,\nAt the cave’s mouth, clouds return, yet I cannot.\nRecalling Xiandu’s old paths,\nStone bridges, moss-slick, footprints few.\n\nThe jade-faced immortal, never aging, never gaunt,\nIn this place, worldly honor and disgrace are absent.\nLast night’s mist and clouds slightly dispersed,\nAs if resenting the imperial carriage’s retinue.\n\nThe Yellow Emperor attained immortality and left from here,\nDing Lake’s tales have passed through many years.\nDragon’s whiskers fell to earth, becoming spring grass,\nEven now, they do not ascend to heaven.\n\nThe path back to Peach Blossom Spring is said to be dustless,\nOnly to avoid the world’s people.\nImmortals’ affairs are vast and vague like this—\nDing Lake’s chariot traces may not be true.\n\n**Prefect Wu Fu, in pursuit of the rhyme**\n\nComing to visit Xiandu’s ancient Jade Void,\nBefore the mountain, a traveler points the lost way.\nMist and rosy clouds stretch far, a lone peak soars,\nPines and bamboos dense, a single path winds.\n\nLeaning on a staff, step by step into the emerald haze,\nBeneath Step-in-Void Mountain, long forgetting to return.\n\nAmidst secluded dwelling, there should be recluses of the forest,\nYet why are such men rare in recent times?\nI hear that atop the mountain lies Ding Lake—\nDo the lotus flowers still resemble those of old?\n\nAfter Xuanyuan’s departure, only chariot tracks remain,\nI suspect these mountains and rivers are the very same as the ancient capital.\nThe man has ridden the dragon and gone, never to return,\nOnly a pair of cranes linger, their years unknown.\n\nSitting here, I suddenly feel the mortal world far removed,\nAt last I believe that within the gourd lies another heaven.\nFrom ancient times to now, those who have climbed this mountain—\nHow many are left to pass down its tales?\nFew, I know, have trodden such sacred ground as you,\nYet in death, your new poems serve as a true likeness.\n\n*Record of the Immortals’ Capital, Scroll the Lower, concludes*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "仙都志 经名：仙都志。 元代陈性定编。 二卷。 底本出处：《正统道藏》洞玄部记传类。 仙都志序 疆理之书，肇於禹贡而具於职方，然水有经，郡邑有乘，此《仙都志》所由作也。 仙都，东昊胜，事在道家书，为祈仙洞天，爰自发迹轩辕，由唐建，宋锡名，荐祉符瑞，屡臻圣朝。 延佑问，贞士赵虚一载奉玺书来领厘事山川草木昭被宠光独峰炼溪，若增而高浚而深也。 住山陈君此一载笔于编，沿革瑰奇，巨细毕录，其有功兹山者欤。 吾闻蓬莱在望而风辄弘去，桃源既入而路忽迷，则名山大川岂人人之所能周览哉。 此编目击道存可以卧游矣。 至正戊子五月既望。 仙都志卷上 玉虚住山少微陈性定此一编集 独峰山长番阳吴明义仲谊校正 山川",
      "translated_text": "**The *Xian Du Gazetteer***\n\n**Title:** *Xian Du Gazetteer* (*Gazetteer of the Immortal Capital*). Compiled by Chen Xingding of the Yuan dynasty. Two fascicles.\n\n**Source Text:** From the *Zhengtong Daoist Canon*, Dongxuan Section, Record and Biography Category.\n\n---\n\n### **Preface to the *Xian Du Gazetteer***\n\nGazetteers of territorial administration trace their origins to the *Tribute of Yu* and find completion in the *Offices of Regions*. Yet while waters have their courses and commanderies their records, this *Xian Du Gazetteer* arises for such a purpose.\n\nXian Du, a realm of eastern splendor, is chronicled in Daoist scriptures as a grotto-heaven for prayerful transcendence. Its legacy begins with the Yellow Emperor’s emergence, flourishes under Tang foundations, and is ennobled by Song bestowals—its auspicious omens and numinous signs repeatedly gracing the sagely courts.\n\nDuring the *Yanyou* era, the upright scholar Zhao Xuyi arrived bearing the imperial seal to oversee its affairs. Mountains and rivers, flora and stone, all basked in singular favor—its solitary peaks heightened, its limpid streams deepened.\n\nResiding on the mountain, Master Chen took up his brush for this compilation, recording its transformations and marvels in exhaustive detail. Surely, this is a service to this sacred peak!\n\nI have heard that Penglai, though glimpsed, is ever swept away by the wind, and Peach Blossom Spring, once entered, loses its path. How then can all famed mountains and great rivers be traversed by every person? Yet this work, born of direct witness, preserves the Dao within—allowing one to wander its wonders from a reclining seat.\n\nWritten on the full moon of the fifth month, *Zhizheng* 8 (*wuzǐ* year).\n\n---\n\n### **Xian Du Gazetteer, Fascicle One**\n\nCompiled by Chen Xingding of Yuxu Hermitage, styled Shaowei.\nCollated by Wu Mingyi of Du Feng Mountain, styled Zhongyi.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 302,
      "start_sentence": 0,
      "end_sentence": 16,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.080894470214844,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\仙都志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "仙都山，古名缙云山。 按道书洞天三十六所，其仙都第二十九，名玄都祈仙洞天，周回三百里，黄帝驾火龙上升处，山巅有石屋，世传为洞天之门。 《史记》载：缙云本黄帝夏宫之名。 张守节云：枯州缙云县，其所封也。 《太平寰宇记》：唐置缙云县。 又以枯州为缙云郡，盖以其地有缙云山故也。 今县在山之西二十三里。 《图经》云：唐天宝七年六月八日有彩云起於李溪源，覆远缙云山独峰之顶，云中仙药响亮，鸾鹤飞舞，俄闻山呼万岁者，九诸山皆应。 自申至亥乃息。 刺史苗奉倩上其事于朝，救改今名。 独峰山，一名仙都石，谢灵运《名山记》云：缙云山旁有孤石，屹然干云，二百丈，三面临水，周围一百六十高丈，顶有湖，生莲花，有岩相近，名步虚山，远而望之，低於步虚，迫而视之，步虚居其下。 旧《东阳记》：一名丹峰山。 昔黄帝尝乘龙车登此山，辙迹犹存。 自唐白乐天以下，古今名贤，留题有什。 步虚山，在仙都山前，正与玉虚宫相对，迭蟑倚空，群峰掩映。 又有小峰列如北斗，名日斗岩。 谢灵运《名山记》云：中岩上有峰，高数十丈，或如莲花，或如羊角。 古老云：黄帝尝炼丹于此。 刘澄《山水记》云：缙云台，黄帝炼丹之所。 《舆地志》云：缙云堂即三天于都。 山巅平敞，有若坛惮，是其地也。 童子峰，在独峰侧，其状如笋。 独峰之腰有窍若脐，此峰平脐，故名。 括苍旧志云：独峰山旁，一石峭立，谓之童子峰。 好山，在仙都山西，初旸谷左。 宋绍兴问转运使李士举尝游仙都，过徐氏山居，赋诗有：华屋重重对好山之句，由是得名。 后晦庵朱先生弥节于此，其名益着。 隐真洞，在步虚山巅，与独峰相对，洞口岩石玲珑宛若窗牖，峻绝难跻，罕有到者。 按《郡志》云：唐刘隐真先生修炼之所。 仙水洞，在步虚山麓，《郡志》一名镜岩洞。 中有泉出自崖窦问，滴于石池，虽大旱不竭。 唐周景复先生修炼之所。 名公磨崖记游者众。 金龙洞，在步虚山东，中有二洞相连，通明开敞。 旧志云：洞深不可测，道家谓洞天，即此也。 宋天禧四年投金龙玉简於其中。 天堂洞，在仙都山东，双龙洞左，高峻，人迹罕到。 洞中石壁正面列二圆穴，右者浅而左者深，有龙居之，旱祷必应。 洞旁又二石洼，左者水清常溢，右者水浊，或缩名日月泉。 山后别有一洞，俗呼为天堂山，内筑精舍，扁日清虚。 忘归洞，在仙都山西，可坐数十人，洞外有石耸出溪流之上，游者登览尽得仙都之胜，使人忘归，名忘归台。 初旸谷洞，一名倪翁洞。 临於练溪之上，左右岩石奇怪，对望独峰。 《郡志》云：谷在仙都山西，初入颇阴隘，少进有石室洞房，虚敞可居，以东向先得日，故名初旸。 正东石壁有窍，大如盘盂，初旸光射室中，烂然五采，其外晴波万斛，有如烁金。 或云倪翁洞在缙云县东半里，讹也。 宋嘉泰问，郡人陈百朋《续志》云：洞正属仙都山练溪旁初旸谷中。 崖上有洞名三大字，或云李阳冰篆，今考谷中有磨崖初旸谷三楷字，倪翁洞三篆字，古老相传昔有倪长官隐居于此，今失其名。 宋乾道问郡守钱竽题仙都诗云：初旸便是扶桑谷，洞裹倪翁招我来。 则知倪翁洞即初旸谷明矣。 又日云堂洞。",
      "translated_text": "**Xian Du Gazetteer, Fascicle One**\n\nXian Du Mountain, known in antiquity as Jinyun Mountain, is listed in the Daoist canon as the twenty-ninth of the Thirty-Six Grotto-Heavens, named the *Xuandu Qixian Dongtian* (\"Mystic Capital Grotto-Heaven of Praying Immortals\"). It spans three hundred *li* in circumference and is said to be where the Yellow Emperor ascended on a fiery dragon. At its summit stands a stone chamber, traditionally held to be the gateway to the grotto-heaven.\n\nThe *Records of the Grand Historian* note that *Jinyun* was originally the name of the Yellow Emperor’s summer palace. Zhang Shoujie explains that Jinyun County in Kuai Prefecture was his enfeoffment. The *Taiping Imperial Survey* records that the Tang established Jinyun County and later renamed Kuai Prefecture as Jinyun Commandery, owing to the presence of Jinyun Mountain. The present county lies twenty-three *li* west of the mountain.\n\nThe *Illustrated Classic* recounts that on the eighth day of the sixth month in the seventh year of the *Tianbao* era (748 CE), a radiant cloud arose from the source of Li Creek, blanketing the summit of Solitary Peak in Xian Du Mountain. From within the cloud came the resonant chimes of immortal elixirs, accompanied by the flight of phoenixes and cranes. Suddenly, a chorus of \"Long live the Emperor!\" echoed from the mountain, and the nine neighboring peaks all responded. The clamor endured from the *shen* hour (3–5 PM) until the *hai* hour (9–11 PM) before subsiding. Prefect Miao Fengqian memorialized the event to the throne, prompting the mountain’s renaming.\n\nSolitary Peak, also called Xian Du Stone, is described in Xie Lingyun’s *Record of Famous Mountains*: \"Beside Jinyun Mountain stands a solitary stone, towering into the clouds to a height of two hundred *zhang*. Three sides overlook water, and its circumference measures one hundred and sixty *zhang* in height. At its summit lies a lake where lotuses bloom. Nearby is a crag called Stepping-in-Emptiness Mountain. From afar, it appears lower than Stepping-in-Emptiness, but upon closer inspection, Stepping-in-Emptiness is revealed to stand beneath it.\" The *Old Record of Dongyang* calls it Danfeng Mountain (\"Cinnabar Peak\"). Legend holds that the Yellow Emperor once ascended this mountain in a dragon-drawn chariot, and traces of its wheel ruts remain. From the Tang poet Bai Juyi onward, renowned scholars of past and present have left behind numerous inscriptions.\n\nStepping-in-Emptiness Mountain lies before Xian Du Mountain, directly opposite Yuxu Palace. Its layered ridges soar into the void, enveloped by surrounding peaks. A cluster of smaller peaks, arrayed like the Northern Dipper, is named the Dipper Crags. Xie Lingyun’s *Record of Famous Mountains* states: \"Atop the central crag rises a peak several dozen *zhang* high, resembling either a lotus blossom or a ram’s horn.\" Local elders say the Yellow Emperor once refined elixirs here. Liu Cheng’s *Record of Mountains and Waters* calls it Jinyun Terrace, the Yellow Emperor’s alchemical site. The *Treatise on Geography* identifies Jinyun Hall as the capital of the Three Heavens. The summit is level and expansive, resembling an altar—this is the very place.\n\nBoy’s Peak stands beside Solitary Peak, its form like a bamboo shoot. At the waist of Solitary Peak is a cavity resembling a navel, and this peak aligns with it, hence its name. The *Old Gazetteer of Kuocang* records: \"Beside Solitary Peak, a sheer stone stands, called Boy’s Peak.\"\n\nFine Mountain lies west of Xian Du Mountain, to the left of Dawn Valley. During the *Shaoxing* era of the Song, Transport Commissioner Li Shiju once visited Xian Du and passed the mountain residence of the Xu family. In a poem, he wrote: \"Layered mansions face upon face with Fine Mountain,\" from which the name derives. Later, Master Zhu Xi of Hui’an sojourned here, further enhancing its renown.\n\nHidden Truth Grotto is situated at the summit of Stepping-in-Emptiness Mountain, opposite Solitary Peak. The grotto’s entrance is framed by intricate rock formations resembling windows and doors. Its sheer inaccessibility makes it rarely visited. According to the *Prefectural Gazetteer*, it was the cultivation site of Master Liu Yinzhen of the Tang.\n\nImmortal Water Grotto lies at the foot of Stepping-in-Emptiness Mountain. The *Prefectural Gazetteer* also calls it Mirror Cliff Grotto. Within, a spring emerges from a crevice in the cliff, dripping into a stone basin—its flow never ceases, even in severe drought. It was the cultivation site of Master Zhou Jingfu of the Tang, and many eminent figures have left inscribed records of their visits on its cliffs.\n\nGolden Dragon Grotto is located east of Stepping-in-Emptiness Mountain. Two interconnected caverns within are bright and spacious. The *Old Gazetteer* states: \"The grotto’s depths are unfathomable; Daoists call it a grotto-heaven.\" In the fourth year of the *Tianxi* era of the Song (1020 CE), a golden dragon jade tablet was cast into it.\n\nHeavenly Hall Grotto lies east of Xian Du Mountain, to the left of Twin Dragon Grotto. Its lofty heights make it seldom visited. On the grotto’s stone wall, two circular cavities are aligned: the right is shallow, the left deep, said to be the dwelling of dragons. Prayers for rain here are always answered. Beside the grotto are two stone basins: the left holds clear water that perpetually overflows, while the right contains turbid water that sometimes recedes. They are called the Sun and Moon Springs. Behind the mountain is another grotto, commonly called Heavenly Hall Mountain. A meditation hall was built within, named *Qingxu* (\"Pure Emptiness\").\n\nForgetting-Return Grotto is situated west of Xian Du Mountain, large enough to seat dozens. Outside the grotto, a stone juts over the stream. Visitors who ascend it take in the full splendor of Xian Du, so captivating that one forgets to return—hence the name Forgetting-Return Terrace.\n\nDawn Valley Grotto, also called Ni Weng Grotto, overlooks Lian Creek. Its flanking cliffs are wondrously shaped, facing Solitary Peak. The *Prefectural Gazetteer* states: \"The valley lies west of Xian Du Mountain. At first, it is dark and narrow, but further in, stone chambers and grotto dwellings open into spacious halls. As it faces east, it receives the first light of dawn, hence the name Dawn Valley.\" On the eastern cliff is an aperture the size of a basin. At dawn, sunlight streams through, casting a dazzling five-colored glow within, while outside, the clear waves shimmer like molten gold. Some claim Ni Weng Grotto lies half a *li* east of Jinyun County, but this is erroneous. During the *Jiatai* era of the Song, the prefectural scholar Chen Baipeng wrote in his *Supplementary Gazetteer*: \"The grotto properly belongs to Dawn Valley beside Lian Creek in Xian Du Mountain.\" On the cliff are inscribed three large characters, said to be the seal script of Li Yangbing. Upon examination, the valley bears the carved characters *Chu Yang Gu* (\"Dawn Valley\") in regular script, and *Ni Weng Dong* (\"Ni Weng Grotto\") in seal script. Local elders say a certain Magistrate Ni once dwelled here, though his name is now lost. During the *Qiandao* era, Prefect Qian Yu inscribed a poem on Xian Du, writing: \"Dawn Valley is none other than Fusang Valley; within the grotto, Ni Weng beckons me.\" Thus, it is clear that Ni Weng Grotto is Dawn Valley.\n\nThe Cloud Hall Grotto is also recorded.",
      "overlap_context": ", and Peach Blossom Spring, once entered, loses its path. How then can all famed mountains and great rivers be traversed by every person? Yet this work, born of direct witness, preserves the Dao within—allowing one to wander its wonders from a reclining seat.\n\nWritten on the full moon of the fifth month, *Zhizheng* 8 (*wuzǐ* year).\n\n---\n\n### **Xian Du Gazetteer, Fascicle One**\n\nCompiled by Chen Xingding of Yuxu Hermitage, styled Shaowei.\nCollated by Wu Mingyi of Du Feng Mountain, styled Zhongyi.",
      "start_char": 302,
      "end_char": 1536,
      "start_sentence": 17,
      "end_sentence": 67,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.448442220687866,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\仙都志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "右山中岩洞固多，自来唯六洞着名。 双龙洞，在独峰之东，灵泽庙左，盘石横跨山涧中，其下空洞通人，虽大旱清流不竭。 宋绍兴问久旱，玉虚道士游先生望云气，至其所见二巨蛇盘旋石下，饮水不去，遂祝之雷雨，随至合境沾足，由是得名，立祠祀之。 洞内左有阴穴横穿而上，昔尝有人明炬而进，莫穷其源，至今早梼必应。 时行沛泽，或见雷光。 洞前涧水深处，即古所谓游龙泓，又日龙泓洞。 宋人胡志通大魁王十朋俱有题咏。 状虎岩，在独峰之西，书院之右，有小石山如虎铨伏，一名驻狮岩。 翔鸾峰，在独峰之南，回澜亭左，山巅有二石，状如鸾鹤，展翅翔舞，俗呼为丫叉岩。 灵龟石，在独峰之北，仙都界石之旁，山麓有巨石倚立，宛若大龟，昂首而上，乡人验其燥湿以占雨旸。 小蓬莱，在练溪之下，按《郡志》云：在仙都之西。 潭心有小岛，上多怪石奇树，潭之南有石壁，高可百仞，名公镌歌咏于崖以记登览之胜。 游者泛舟而入，恍若蓬瀛之境。 参政四明楼公钥大书小蓬莱三字刊于碑，以亭覆之，今废。 傍有合掌洞，可容数十人。 石壁高处横列十余穴，若玑贯组，名大组岩。 其东复耸一岩，上广下敛，日雨蓑岩。 小赤壁，在川石潭上，按《郡志》云：在仙都之东，濒溪壁立，高可千尺，峰峦奇秀，壁下空洞，潭水凝湛，莫测其深，泛舟而游，迥出尘外。 迩流一舍余，亦有一岩，郡人参政何公澹书小赤壁三字磨于崖。 虽地异而名同，故并录于此。 仙释岩，在小赤壁之西岸，有石挺然森列于溪之许，问有状如仙人释子之像者，玉虚山地多在其侧而古籍常以仙人石为界。 黄僇赤岩，在仙都山之东麓，有崖壁立，横亘数十寻，岩窦给讶，色绚五彩，远望如云锦，近视若霞销，今土人立田社於岩下。 天师岩，与赤岩对峙，岩下有洞可立二十人，内有阴穴直下通于溪。 古老云：昔人值早，往元真护国天师祖庙请香火于兹，致梼获应，遂建殿于洞前，因名。 其岩厥后殿址荡于水，至今乡人犹望洞而祀之。 东蒙岩，在初旸谷左，有石低昂奇怪，聚立于深潭之滨，岩下可以泛舟，海上有仙山日：东蒙。 泰岳之南山名东蒙，此岩之名莫详所出。 或云岩正朝东，太阳将晖，水光互映，而日东蒙，亦取初旸之义，二字未知孰是。 玉饭岩，在初旸谷右，山半有石，突起如饭，岩下有穴，宛若鳌门，天将雨则岩上雾气如炊，溪流暴涨则门内有如釜沸之声。 《括苍旧志》云：一名碧云洞，又号张公宠。 莫详所由。 杨郎洞，在初旸谷后，驿道之旁，洞中高下二级，可容二十余人。 古老相传昔有杨郎居此，以符药济惠於往来者，后人思之，立祠于中。 仙岩洞，在好山之北，仙岩市上，山半有洞，深旷高明可立百余人。 今市民立田社于中。 梯云洞，在仙都山西，与雨衰岩对峙，岩下空洞若磴，自山根循至山腰长六十余丈，一名长亭。 其上深敞处土人尝构屋於中，近废。 鼎湖，即独峰顶上湖也。 尝生莲花。 按唐宋以来，名公题咏，并以鼎湖称之。 炼金溪，源出大盆山，至仙都，则名炼金。 水中有石与独峰之根连续一片，其平如砥，两岸相望阔三十余丈而水深仅尺许。 按《郡志》仙都之里曰炼金里，溪日炼金溪，渡日炼金波，然莫考其所出。",
      "translated_text": "The mountains here abound in grottoes and caverns, yet only six have long been renowned.\n\n**Twin Dragons Grotto** lies east of Solitary Peak, to the left of the Temple of Numinous Moisture. A massive boulder spans the mountain stream, beneath which a hollow passage allows human passage. Even in severe droughts, its clear flow never fails. During the *Shaoxing* era of the Song, when a prolonged drought struck, Daoist Master You of Jade Clarity observed the cloud formations and came upon this spot, where two enormous serpents coiled beneath the stone, drinking without cease. He prayed for rain, and thunderstorms soon followed, drenching the entire region. Thus the grotto gained its name, and a shrine was established in its honor. To the left within the grotto lies a dark crevice that tunnels upward; once, someone entered with a torch but could not reach its end. To this day, prayers for rain here are invariably answered, and at times, flashes of lightning appear. The deep pool before the grotto is the ancient *Youlong Hong* (\"Wandering Dragon Pool\"), also called *Longhong Grotto*. Song scholars Hu Zhitong and Grand Academician Wang Shipeng both composed poems in its praise.\n\n**Crouching Tiger Crag** stands west of Solitary Peak, to the right of the academy. A small stone mountain resembles a crouching tiger, also known as *Zhushi* (\"Perched Lion\") Crag.\n\n**Soaring Luan Peak** rises south of Solitary Peak, to the left of the Waveling Pavilion. At its summit, two stones take the form of *luan* and crane, wings spread as if in flight—hence its popular name, *Yacha* (\"Forked\") Crag.\n\n**Numinous Tortoise Stone** lies north of Solitary Peak, beside the boundary marker of Xian Du. At the mountain’s base, a massive boulder stands upright, shaped like a great tortoise with head raised. Locals gauge its dryness or dampness to predict rain or shine.\n\n**Little Penglai** sits below Lian Creek. According to the *Prefectural Gazetteer*, it lies west of Xian Du. At the heart of its pool is a small isle, strewn with strange rocks and rare trees. To the south, a stone cliff rises some hundred *ren* high, where eminent officials carved poems on the rock to commemorate its scenic beauty. Visitors who row in by boat feel as though they have entered the fairy realms of Penglai. Minister Lou Yue of Siming inscribed *Little Penglai* in large characters on a stele, which was once sheltered by a pavilion—now in ruins. Nearby stands **Clasped Palms Grotto**, spacious enough for dozens. High on the cliff face, over ten cavities align like strung beads, called **Great Bead Crag**. To the east rises another crag, broad above and narrow below, known as **Rain Cape Crag**.\n\n**Little Red Cliff** stands above the Riverstone Pool. The *Prefectural Gazetteer* places it east of Xian Du: a sheer cliff rises by the stream, nearly a thousand *chi* high, its peaks and ridges strangely elegant. Beneath the cliff, a hollow opens into a deep, limpid pool of unfathomable depth. Boating here feels far removed from the mortal world. A short distance downstream, another crag bears the same name. Minister He Dan of the prefecture inscribed *Little Red Cliff* in stone upon the cliff face. Though the locations differ, the names coincide, so both are recorded here.\n\n**Immortal and Monk Crag** lies on the western bank of Little Red Cliff. Stones stand tall and dense along the stream’s edge, some resembling the figures of immortals or Buddhist monks. Much of Jade Clarity Mountain’s land lies nearby, and ancient records often used *Immortal Stone* as a boundary marker.\n\n**Yellow Vulture Red Crag** stands on the eastern slope of Xian Du Mountain. A cliff rises steeply, stretching dozens of *xun*, its cavities and hollows vivid with five-colored hues. From afar, it resembles brocade; up close, it glows like sunset clouds. Today, locals have established a farming community at its base.\n\n**Celestial Master Crag** faces Red Crag across the way. At its base lies a grotto large enough for twenty people, with a dark crevice leading straight down to the stream. Elders say that in times of drought, people would come here to request incense from the ancestral temple of the Perfected True Protector of the Realm, Celestial Master, and their prayers were answered. A hall was built before the grotto, hence its name. Later, the hall’s foundations were swept away by water, yet villagers still face the grotto in worship.\n\n**Eastern Meng Crag** stands to the left of Dawn Valley. Strange stones rise and fall along the edge of a deep pool, where boats may navigate. Beyond the sea lies an immortal mountain called *Eastern Meng*. The southern mountain of Mount Tai is also named *Eastern Meng*, though the origin of this crag’s name remains unclear. Some say the crag faces east, and as the sun rises, water and light intertwine, giving it the name *Eastern Meng*—also reflecting the meaning of *Dawn Valley*. It is uncertain which explanation is correct.\n\n**Jade Rice Crag** lies to the right of Dawn Valley. Halfway up the mountain, a stone juts out like a mound of rice. Below the crag is a cave resembling a turtle’s mouth; when rain approaches, mist rises from the rock like steam from cooking, and when the stream surges, the cave emits sounds like a boiling cauldron. The *Old Gazetteer of Kuocang* calls it *Azure Cloud Grotto*, also known as *Zhang Gong’s Favor*, though its origins are unknown.\n\n**Yang Lang Grotto** lies behind Dawn Valley, beside the post road. The grotto has two levels, upper and lower, with space for over twenty people. Elders say a certain Yang Lang once lived here, healing travelers with talismans and medicines. Later generations, in remembrance, built a shrine within.\n\n**Immortal Crag Grotto** lies north of Fine Mountain, above Immortal Crag Market. Halfway up the mountain is a grotto, deep and spacious, capable of holding over a hundred people. Today, locals have established a farming community within.\n\n**Cloud-Ladder Grotto** stands west of Xian Du Mountain, facing Rain Cape Crag. A hollow beneath the crag resembles steps, ascending from the mountain’s base to its midsection for over sixty *zhang*, also called *Long Pavilion*. In its deeper recesses, locals once built houses, now in ruins.\n\n**Ding Lake** is the lake atop Solitary Peak, where lotuses once grew. From the Tang and Song dynasties onward, eminent officials’ poems and inscriptions all refer to it as *Ding Lake*.\n\n**Lianjin Creek** originates from Great Basin Mountain and is called *Lianjin* (\"Gold-Refining\") upon reaching Xian Du. Stones in the water connect seamlessly to the base of Solitary Peak, smooth as whetstone. The banks face each other across over thirty *zhang*, yet the water is only a *chi* deep. According to the *Prefectural Gazetteer*, the village in Xian Du is called *Lianjin Village*, the stream *Lianjin Creek*, and the ford *Lianjin Wave*, though their origins remain unrecorded.",
      "overlap_context": "nation, the valley bears the carved characters *Chu Yang Gu* (\"Dawn Valley\") in regular script, and *Ni Weng Dong* (\"Ni Weng Grotto\") in seal script. Local elders say a certain Magistrate Ni once dwelled here, though his name is now lost. During the *Qiandao* era, Prefect Qian Yu inscribed a poem on Xian Du, writing: \"Dawn Valley is none other than Fusang Valley; within the grotto, Ni Weng beckons me.\" Thus, it is clear that Ni Weng Grotto is Dawn Valley.\n\nThe Cloud Hall Grotto is also recorded.",
      "start_char": 1536,
      "end_char": 2797,
      "start_sentence": 68,
      "end_sentence": 110,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.26940846443176,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\仙都志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "据唐韦加《仙都山铭》日：丹穴傍起，金溪下融。 又唐隐真先生《玄墟志》日：炼金溪畔，足以濯缨。 则炼金之名古矣。 金华潭，在炼金溪下深处。 古老相传鼎湖金莲花瓣尝飘坠于此，因而得名。 练溪，又在金华潭之下，水光若练，故名。 按《郡志》云：在仙都之西，初旸谷洞前。 水中有大人迹犬马蹄痕。 又有石井，深不可测。 丹井，在玉库正殿之西南隅。 隐真先生尝汲以炼丹一至今泉清味甘，冬温夏寒，虽早撩不枯滥。 玉泉池，在双龙洞下，其色玉洁。 放生池，在玉虚官外，以婶涧水既广且＇深，自昔为放生之所。 其，一在妙庭观前。 天塘，在天堂洞后山顶，冬夏不竭。 梳水织，在小蓬莱上大溪中一，两岸相接唯片石状。 榈阔三十余寻，水落石出之时，余波分派而流以渡。 俗呼为偶轿岩。 朴头石，在炼金溪中，以状似而名之。 祠字 玉虚官，在仙都山中，即玄都祈仙洞天黄帝飞升之地。 自唐天宝戊子以独峰彩零仙乐之瑞，刺史苗奉倩奏闻敕封仙都山，周回三百里禁樵采捕届它、！ 猎，建黄帝祠宇，岁度道士七人以奉香火。 宋治平乙巳改赐今名。 宣和庚子毁于寇。",
      "translated_text": "According to Tang dynasty’s Wei Jia in his *Inscription of Mount Xiandu*: \"Cinnabar caves rise beside it; golden streams flow below.\" Also, from the *Mysterious Ruins Record* by Master Hidden Truth of the Tang: \"By Lianjin Creek’s banks, one may wash their cap strings.\" Thus, the name *Lianjin* is ancient indeed.\n\n**Jinhua Pool** lies in the deep reaches below Lianjin Creek. Local elders say that petals from the golden lotuses of Ding Lake once drifted here, hence its name. **Lian Creek**, further downstream from Jinhua Pool, shimmers like raw silk, thus its name. According to the *Prefectural Gazetteer*, it lies west of Xiandu, before the Chaoyang Valley Grotto. In its waters are imprints of giant footprints, hoofmarks of dogs and horses, and a stone well of unfathomable depth.\n\n**Cinnabar Well** stands at the southwest corner of Jade Treasury’s main hall. Master Hidden Truth once drew its water to refine elixirs. To this day, its spring remains clear and sweet, warm in winter and cool in summer, never drying even in drought nor overflowing in flood.\n\n**Jade Spring Pool** lies below Double Dragon Cave, its waters pure as jade. **Release Pool**, outside Jade Void Palace, is fed by the broad and deep ravine waters and has long served as a place for releasing living creatures. Another such pool exists before Miao Ting Abbey.\n\n**Heavenly Pond** sits atop the mountain behind Heavenly Hall Cave, never drying in winter or summer.\n\n**Comb-Water Weaving** is a single slab of stone in the great stream above Little Penglai, spanning over thirty *xun* between its banks. When waters recede, the remaining flow parts around it for passage. Locals call it *Bridal Sedan Rock*.\n\n**Mallet-Head Stone** lies in Lianjin Creek, named for its resemblance.\n\n**Temples and Abbeys**\n**Jade Void Palace** stands in the heart of Mount Xiandu, the very site of the Mystic Capital’s Grotto-Heaven where the Yellow Emperor ascended to immortality. In the *Wuzi* year of Tianbao (748 CE), due to auspicious omens of colored clouds and immortal music above Solitary Peak, Prefect Miao Fengqian memorialized the throne. The emperor decreed Xiandu Mountain a sacred precinct, forbidding logging, hunting, or fishing within its three hundred *li* circumference. A shrine to the Yellow Emperor was built, and seven Daoist priests were annually ordained to tend its incense fires. In the *Yisi* year of Zhiping (1065 CE), the Song court bestowed its present name. In the *Gengzi* year of Xuanhe (1120 CE), it was destroyed by bandits.",
      "overlap_context": "g Lake*.\n\n**Lianjin Creek** originates from Great Basin Mountain and is called *Lianjin* (\"Gold-Refining\") upon reaching Xian Du. Stones in the water connect seamlessly to the base of Solitary Peak, smooth as whetstone. The banks face each other across over thirty *zhang*, yet the water is only a *chi* deep. According to the *Prefectural Gazetteer*, the village in Xian Du is called *Lianjin Village*, the stream *Lianjin Creek*, and the ford *Lianjin Wave*, though their origins remain unrecorded.",
      "start_char": 2797,
      "end_char": 3257,
      "start_sentence": 111,
      "end_sentence": 135,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.307490825653076,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\仙都志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "道士游大成．乃即旧基，再谋营造。 时官东坐西向，阴阳者流谓虎瞰而角法宜改。 为景定庚申，郡守安刘取朝旨，命道士陈观定迁宫地向，不期年而告成。 元延佑，庚申，道士赵嗣棋钦受宣命，佩服颁降处州路仙都山玉虚宫提点所五品印章，主领宫事。 再奉玺书护持，改复甲乙，及蒙集贤院暨天师正一教主大真人、特进上卿玄教大宗师，各给榜据，俾永遵守。 一由是官门增重旧观。 本官殿宇开列于左。 金阙寥阳宝殿，郡人叶嗣昌书额。 黄帝祠宇，唐缙云县令李阳冰篆额。 飞天法输藏殿，宋朝乾道己卯，道士李伯祥创立法输，规模宏美，郡人陈沂书扁。 天一真庆行宫。 三元三官圣堂。",
      "translated_text": "Daoist priest You Dacheng, upon the former foundations, once more planned its reconstruction. At that time, the abbey faced east with its back to the west, but practitioners of yin-yang arts declared that this resembled a tiger’s glare and that the orientation violated ritual propriety. Thus, in the *Gengshen* year of Jingding (1260 CE), Prefect An Liu, by imperial decree, commanded Daoist priest Chen Guanding to relocate and reorient the abbey. In less than a year, the work was completed.\n\nIn the *Gengshen* year of Yanyou (1319 CE), Daoist priest Zhao Siqi received an imperial commission, bearing the seal and robes bestowed by the throne as *Tidian* (Supervisor) of Jade Void Palace at Mount Xiandu in Chuzhou Circuit, a fifth-rank office overseeing the abbey’s affairs. He further received an imperial edict for its protection, restoring its proper cosmic alignment, and was granted official placards by the Jixian Institute, the Celestial Master and Orthodox Unity Sect’s Grand Master of the Dao, and the Grand Preceptor and Supreme Minister, Great Patriarch of the Mystic Teaching, each to be perpetually observed. From this time forth, the abbey’s gates regained their former dignity.\n\nThe abbey’s halls and structures are listed below:\n\n**Hall of the Golden Portal and Luminous Yang**, its plaque inscribed by Ye Sichang of the prefecture.\n**Shrine of the Yellow Emperor**, its plaque in seal script by Li Yangbing, magistrate of Jinyun County during the Tang.\n**Hall of the Flying Celestial Dharma Wheel Repository**, established in the *Jimao* year of Qiandao (1169 CE) by Daoist priest Li Boxiang, its scale grand and elegant, its plaque inscribed by Chen Yi of the prefecture.\n**Palace of Heavenly Unity and True Felicity**.\n**Hall of the Three Primes and Three Officials**.",
      "overlap_context": "ds and immortal music above Solitary Peak, Prefect Miao Fengqian memorialized the throne. The emperor decreed Xiandu Mountain a sacred precinct, forbidding logging, hunting, or fishing within its three hundred *li* circumference. A shrine to the Yellow Emperor was built, and seven Daoist priests were annually ordained to tend its incense fires. In the *Yisi* year of Zhiping (1065 CE), the Song court bestowed its present name. In the *Gengzi* year of Xuanhe (1120 CE), it was destroyed by bandits.",
      "start_char": 3257,
      "end_char": 3531,
      "start_sentence": 136,
      "end_sentence": 147,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.419141292572021,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\仙都志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "梓潼帝君行祠。 洞天仙官祠。 玉虚真官祠。 衍教堂，郡人何传书扁。 隐真堂，韩永锡书扁，昊俊尝留题，今奉锺吕诸仙像，方丈扁日#1，天开图画，文公五代孙朱煌九岁书。 风雨堂，昊兴赵孟俯书扁。 金莲绾，蜀郡虞集书扁。 玉虚宫门，东阳赵霆篆额。 祈仙洞天门，邑人潜说友篆额。 仙都山门，赵孟俯书额。 片云亭，取乐天片云孤石之咏为名。 回澜亭，在金华潭上，郡人何宗姚书扁。 仙都蜕轩。 竞秀轩。 撷芳轩。 练玉轩。 驻鹤亭，在洞天门外。 照水亭，在放生池上。 忘归亭，在忘归洞前。 妙庭观，在仙都山东，金龙洞上，唐成通元年隐真刘先生所建，又筑玄墟於其后。 乾符三年，门人朱惠思诣阙请观额，蒙锡以仙都之号。 景福元年，江东罗隐作记，宋治平二年，改赐今名。 元皇庆元年，玄妙葆真道士陈怀玉钦奉玺书复为甲乙，世袭香火，由是振兴。 独峰书院，在炼金溪西，正对独峰。 宋淳熙壬寅，晦庵朱先生持常平节上疏，劾台守未报，徜徉于此山，以伺朝旨，有於此藏修为宜之语。 绍定戊子，郡人开国叶公嗣昌始就此创礼殿为讲贯之所。 咸淳丁卯，邑人尚书潜公说友，即旧址而广大之。 基址并系玉虚山也。 灵泽庙，在双龙洞前，即双龙之灵。 《郡志》云：宋咸淳七年，知县陈绍若梼雨有感，保奏敕赐庙额，至今士民祈雨辄应，古庙甚隘，恒定新之。 赵侯庙，在仙都山西，梯云洞侧。 按《郡志》：庙在仙都乡，一方咸敬奉之。 侯乃后汉赵炳也。 庙前有石如船，《郡志》云：石有如舟者，俗呼为赵侯船，或如杖、如履、如瓮，皆以侯名。 按东汉方术传赵炳，字公阿，东阳人。 能为越方，贵尚清俭，祀神以东流水为酌，削桑皮为脯，疗病皆除。 东入章安，今台州也。 百姓神服，既殁，遂立祠焉。 至今蚊纳不入。 又传注日：炳故祠在姿州永康县东，俗呼为赵侯祠。 江南犹传赵侯禁法以疗疾，云今正一宗坛给赵侯禁气录，即此所谓赵侯禁师者是，而历家亦有赵侯化日。 又按《东阳志》永康县乌伤侯庙，乃后汉赵炳也。 事与史同，《县经》云：仕汉至大将军。 庙无碑碣可考，但有古隶书乌伤侯庙数字。 又《郡志》青田县灵康行祠，即缙云县赵侯庙也。 初侯庙食于台州临海县白鹤山，宋元丰七年赐额积封灵顺显佑广惠威烈王。 今按缙云沿革，唐圣历元年折括苍县今丽水也及永康县地置缙云县，此庙至永康界才半舍，考之此地实永康故地，神之显灵，无所不在，虽邻邑皆有祠，无如此庙有石像可表。 至今庙中无蚊纳，境内不生蛭螺，水旱疾疫，梼之必应，岂非祖庙耶。 神仙 景复周先生，仙都道士也。",
      "translated_text": "**Shrine of the Divine Lord of Zitong**.\n**Shrine of the Grotto-Heaven Immortals**.\n**Shrine of the Jade Purity Perfected Official**.\n**Hall of the Flourishing Teachings**, its plaque inscribed by He Chuan of the prefecture.\n**Hall of Hidden Perfection**, its plaque inscribed by Han Yongxi; Wu Jun once left a poem here. Now it enshrines images of the immortals Zhong and Lü. The abbot’s chamber plaque reads: *#1 Heaven Unfolds a Painting*, inscribed at age nine by Zhu Huang, fifth-generation descendant of Master Wen.\n**Hall of Wind and Rain**, its plaque inscribed by Zhao Mengfu of Wuxing.\n**Golden Lotus Pavilion**, its plaque inscribed by Yu Ji of Shu Commandery.\n**Gate of the Jade Purity Palace**, its seal-script plaque by Zhao Ting of Dongyang.\n**Gate of the Grotto-Heaven for Invoking Immortals**, its seal-script plaque by Qian Shueyou of the county.\n**Gate of Mount Xiandu**, its plaque inscribed by Zhao Mengfu.\n**Pavilion of a Fleeting Cloud**, named after Bai Juyi’s poem *A Fleeting Cloud and a Solitary Stone*.\n**Pavilion of the Returning Waves**, situated above the Golden Flower Pool, its plaque inscribed by He Zongyao of the prefecture.\n**Veranda of Xiandu’s Transformation**.\n**Veranda of Vying Splendor**.\n**Veranda of Gathering Fragrance**.\n**Veranda of Refining Jade**.\n**Pavilion of the Perching Crane**, located outside the Grotto-Heaven Gate.\n**Pavilion of Reflecting Waters**, situated above the Release Life Pond.\n**Pavilion of Forgetting Return**, before the Cave of Forgetting Return.\n**Temple of the Wondrous Court**, on the eastern slope of Mount Xiandu, above the Golden Dragon Grotto. Built in the first year of *Chengtong* (860 CE) by the Recluse Master Liu of Hidden Perfection, who also constructed the *Mystic Wasteland* behind it. In the third year of *Qianfu* (876 CE), his disciple Zhu Huisi petitioned the court for a temple plaque, which was granted the name *Xiandu*. In the first year of *Jingfu* (892 CE), Luo Yin of Jiangdong composed its record. In the second year of *Zhiping* (1065 CE) of the Song, it was renamed as it is today. In the first year of *Huangqing* (1312 CE) of the Yuan, the Daoist priest Chen Huaiyu of Mystic Wonder and Preserved Perfection reverently received an imperial edict restoring its rank as *Jia Yi* (First-Second Grade), with hereditary incense offerings, thereby reviving its prosperity.\n\n**Academy of the Solitary Peak**, west of the Lianjin Stream, directly facing the Solitary Peak. In the *Renyin* year of *Chunxi* (1182 CE) of the Song, Master Zhu Xi of Huian, bearing the credentials of the Ever-Normal Granary, submitted a memorial impeaching the prefectural governor but received no response. He lingered in these mountains awaiting the imperial decree, remarking that this would be a fitting place for secluded cultivation. In the *Wuzi* year of *Shaoding* (1228 CE), Ye Sichang, Duke of the State of the prefecture, first established a ritual hall here as a place for lectures and discourse. In the *Dingmao* year of *Xianchun* (1277 CE), Qian Shueyou, Minister of the county, expanded it upon the old site. The entire foundation is part of Mount Yuxu.\n\n**Temple of Numinous Blessings**, before the Double Dragon Grotto, dedicated to the spirit of the Double Dragons. The *Prefectural Gazetteer* states: In the seventh year of *Xianchun* (1271 CE) of the Song, Magistrate Chen Shaoru prayed for rain and received a response; he reported this to the throne and was granted an imperial plaque for the temple. To this day, when the local gentry and commoners pray for rain, their pleas are invariably answered. The old temple was quite cramped, and it has since been regularly renovated.\n\n**Temple of Marquis Zhao**, west of Mount Xiandu, beside the Ladder Cloud Grotto. According to the *Prefectural Gazetteer*, the temple is in Xiandu Township, and the entire region reveres it. The marquis was Zhao Bing of the Later Han. Before the temple lies a stone resembling a boat; the *Prefectural Gazetteer* notes: There is a stone like a vessel, commonly called *Marquis Zhao’s Boat*, while others resemble a staff, shoes, or jars, all named after the marquis. According to the *Biographies of Magicians* in the *History of the Eastern Han*, Zhao Bing, styled Gong’a, was a native of Dongyang. Skilled in southern magic, he valued purity and frugality, offering libations to spirits with east-flowing water, dried mulberry bark as jerky, and curing illnesses with remarkable efficacy. He later entered Zhang’an (present-day Taizhou), where the people revered him as a deity. After his death, a shrine was established in his honor. To this day, mosquitoes and gnats do not enter it. Another commentary states: The original shrine of Bing was in Yongkang County of Muzhou, commonly called the *Temple of Marquis Zhao*. In the Jiangnan region, the *Zhao Hou Prohibitive Methods* for healing illnesses are still transmitted, and it is said that the present *Zhengyi* lineage’s altars bestow the *Zhao Hou Prohibitive Qi Registers*—this refers to the so-called *Zhao Hou Prohibitive Masters*. Astrologers also speak of the *Zhao Hou Transformation Day*. Further, according to the *Dongyang Gazetteer*, the *Temple of the Marquis of Wushang* in Yongkang County is dedicated to Zhao Bing of the Later Han, with accounts matching those in the histories. The *County Records* state: He served the Han as Grand General. The temple has no stele or inscription for reference, only the ancient clerical-script characters *Temple of the Marquis of Wushang*. The *Prefectural Gazetteer* also mentions the *Temple of Numinous Well-Being* in Qingtian County, which is the Temple of Marquis Zhao of Jinyun County. Originally, the marquis’s temple received offerings at White Crane Mountain in Linhai County of Taizhou. In the seventh year of *Yuanfeng* (1084 CE) of the Song, it was granted the plaque *Spirit of Accumulated Seals, Numinous Favor, Manifest Protection, Vast Benevolence, Majestic and Mighty King*. Now, considering the historical evolution of Jinyun: In the first year of *Shengli* (698 CE) of the Tang, the territory of present-day Lishui (formerly Kuocang County) and Yongkang County was divided to establish Jinyun County. This temple is only half a league from the Yongkang border. Upon examination, this land was indeed part of ancient Yongkang. The deity’s numinous efficacy is omnipresent, and though neighboring counties also have shrines, none are as distinguished as this temple, which possesses stone images as a testament. To this day, the temple remains free of mosquitoes and gnats, the region produces no leeches or conches, and prayers for relief from floods, droughts, plagues, and epidemics are invariably answered. Is this not the ancestral temple? Among the immortals: **Master Jing Fuzhou**, a Daoist of Xiandu.",
      "overlap_context": "Yang**, its plaque inscribed by Ye Sichang of the prefecture.\n**Shrine of the Yellow Emperor**, its plaque in seal script by Li Yangbing, magistrate of Jinyun County during the Tang.\n**Hall of the Flying Celestial Dharma Wheel Repository**, established in the *Jimao* year of Qiandao (1169 CE) by Daoist priest Li Boxiang, its scale grand and elegant, its plaque inscribed by Chen Yi of the prefecture.\n**Palace of Heavenly Unity and True Felicity**.\n**Hall of the Three Primes and Three Officials**.",
      "start_char": 3532,
      "end_char": 4587,
      "start_sentence": 148,
      "end_sentence": 197,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.70376896858215,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\仙都志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "唐大历问居仙水洞中，辟谷宴坐，百有余年，后仙去。 今玉虚宫有石刻陆龟蒙题镜岩周尊师所居诗并序可考。 今录之：处州仙都山，山之半有洞，下望之如鉴，目之日镜。 岩去地二百尺，上者以竹梯为级，中如方丈，内有乳水滴沥。 黄老徒周君景复居焉。 迨八十年不食乎粟，日唯焚降真香一灶，读《灵宝度人经》而已。 东牟段公柯昔为州之日，闻其名，梯室以造之，且曰君居此久矣，乳水之滴昼夜，可知量乎？ 周君日：某常揣之，尽昼与夜，乃一斛加半焉。 公异而礼之。 后柯别十三年，处人过说周君尚存，吟想其道，无由以睹。 因寄题诗云：见说身轻鹤不如，石房无倡共云居。 清晨自削灵香柿，独夜空吟碧落书。 十洞飞精应遍吸，一茎秋发未曾梳。 知君便入悬珠会，早晚东骑白鲤鱼。 着作郎皮日休和诗云：八十余年住镜岩，鹿皮巾下雪举形。 床寒不奈云萦枕，经润何妨乳滴函。 饮涧猿回窥绝洞，绿梯人歇倚危杉。 如何计吏穷於乌，欲望仙都举一帆。 括苍旧集所载与石刻同。 隐真刘先生，名处静，字道游，沛国彭城人。 其先避地遂昌因家焉。 世宗儒业，先生幼而颖悟，博览群书，游涉名山，得遇至人授以吐纳之道。 尝召见赐绊衣，退居仙都山隐真岩结庐金龙洞侧。 今妙庭观也。 弟子数百人，有自远方来谒者，无虚日，门人欲塑其像，一日，有嗜酒道人来成之，先生留饮，旬日陕黄金三十铢赠其行，相送金龙洞前，约先生曰：子归首视砚下。 及回，乃得片纸，书云：子与吾金，吾授子真真抱子形形全子神十六字曩元金在焉。 於是顿悟，遂预筑玄墟于庐后，自护其志。 咸通十四年六月辛酉解化。 当日归封玄墟刺史。 卢虔罐赞其像日：至灵之精，大道之渊，其朴靡散，其神则全。 嗟夫世人，嗜欲驰役，故使元胎，莫留瞬息，惟师恬泊，万虑泯泯，岂有一物，能奸至真。 伊厥形气，尚资蜕舍，胡为神人，土偶为者。 后数年有乡人於襄汉问见之，语其弟子，启墓视之，所存惟杖履。 二事益尸解也。 今空墓在妙庭观后。 复有塑像赞云：返一无边，神之又神。 遗此塑像，非先生真，先生之真，不存此身，出有入无，莫与之亲。 仙都志卷上竟 事迹出《郡志》，赞烦出《括苍旧志》。 仙都志卷下 玉虚住山少微陈性定此一编集　独峰山长番阳吴明义仲谊校正 高士 仙都乃祈仙洞天高尚之士，代所不乏。",
      "translated_text": "In the Tang *Dali* era (766–779 CE), he dwelt within the Immortal Waters Grotto, practicing grain avoidance and meditative repose for over a hundred years before ascending as an immortal. Today, the Jade Void Palace preserves a stone inscription bearing Lu Guimeng’s poem and preface, titled *Mirror Cliff: Abode of Master Zhou*, which may be consulted. Here follows the text:\n\nWithin the Immortal Capital Mountain of Chuzhou, a cavern lies halfway up its slope. Gazing down, it resembles a mirror—hence its name, Mirror Cliff. The grotto stands two hundred feet above the earth, accessible only by bamboo ladder. Its interior spans a square *zhang*, where stalactite water drips ceaselessly. The Yellow Emperor’s disciple, Master Zhou Jingfu, resided here. For eighty years, he consumed no grain, burning only a censer of *jiangzhen* incense each day while reciting the *Scripture of the Numinous Treasure for Salvation*. When Lord Duan Ke of Dongmou served as prefect of the region, he heard of Master Zhou’s renown and ascended the ladder to visit him. “You have dwelt here long,” he remarked. “Can you measure the stalactite water that drips day and night?” Master Zhou replied, “I have estimated it: over a full day and night, it amounts to one *hu* and a half.” The lord marveled and treated him with reverence. Thirteen years after parting, a traveler from Chuzhou reported that Master Zhou still lived. Longing to glimpse his Dao but finding no means, Lord Duan composed a poem in tribute:\n\n*I hear your body is lighter than cranes,*\n*Your stone chamber silent, shared only with clouds.*\n*At dawn, you carve fragrant aloeswood;*\n*At night, you chant alone from celestial scriptures.*\n*Ten caves’ essences you’ve inhaled in full;*\n*Your autumn hair, unkempt, remains unbrushed.*\n*Knowing you’ll soon join the Suspended Pearl Assembly,*\n*I wonder when you’ll ride east on a white carp.*\n\nPi Rixiu, Gentleman for Literary Composition, responded with a matching poem:\n\n*Eighty years dwelling in Mirror Cliff,*\n*Beneath a deer-hide cap, your form like snow.*\n*Though your bed chills with clouds coiled round the pillow,*\n*What harm if scriptures dampen from dripping stalactites?*\n*Apes at the stream pause to peer into the abyss;*\n*Visitors on the green ladder rest by perilous pines.*\n*Why must petty clerks, like crows, remain earthbound?*\n*I long to hoist sail toward the Immortal Capital.*\n\nThe *Old Anthology of Kuocang* records the same text as the stone inscription.\n\n**Recluse Liu, Master of Hidden Reality**, named Chujing, styled Daoyou, hailed from Pengcheng in Peiguo. His ancestors had fled to Suichang and settled there. Though his family pursued Confucian scholarship, the Master was precocious from childhood, well-versed in the classics, and traveled among famous mountains. There, he encountered a perfected being who transmitted to him the Dao of exhalation and inhalation. Once summoned to court and granted a purple robe, he retired to Hidden Reality Cliff on Immortal Capital Mountain, where he built a hut beside the Golden Dragon Grotto—today’s Wondrous Court Abbey. His disciples numbered in the hundreds, and seekers from afar arrived daily without fail. When his followers wished to sculpt his likeness, a wine-loving Daoist appeared and completed the task. The Master detained him for ten days of feasting, then gifted him thirty *zhu* of gold upon his departure. As they parted before the Golden Dragon Grotto, the Daoist instructed, “When you return, look beneath your inkstone.” Upon doing so, he found a slip of paper inscribed:\n\n*You gave me gold; I grant you truth:*\n*Truth embraces form; form perfects spirit.*\n\nBeneath lay the gold, untouched. At once enlightened, the Master prepared a transcendent tomb behind his hut, guarding his resolve. On the *xinyou* day of the sixth month in the fourteenth year of *Xiantong* (873 CE), he shed his mortal form. That same day, he was posthumously enfeoffed as Prefect of the Mystic Tomb. Lu Qinguang eulogized his statue:\n\n*Essence of utmost numinosity,*\n*Abyss of the Great Dao—*\n*Its simplicity unscattered,*\n*Its spirit wholly preserved.*\n*Alas, worldly men,*\n*Driven by desires, toil endlessly,*\n*So their primordial embryo*\n*Flees in the blink of an eye.*\n*Only the Master, serene and untroubled,*\n*Dissolved ten thousand cares.*\n*Not a single thing*\n*Could deceive his perfect truth.*\n*Even his form and qi*\n*Required a cocoon’s release—*\n*How then could a clay effigy*\n*Embody the divine man?*\n\nYears later, a villager encountered him in the Xiang-Han region and relayed the news to his disciples. They opened the tomb to find only his staff and sandals. Both episodes confirm his deliverance as a *shijie* immortal. His empty tomb remains behind Wondrous Court Abbey. Another eulogy for his statue reads:\n\n*Returning to the One, boundless,*\n*His spirit transcends spirit.*\n*This sculpted image remains,*\n*Yet it is not the Master’s truth.*\n*The Master’s truth*\n*Transcends this body,*\n*Emerging from being, entering nonbeing,*\n*None may draw near.*\n\n**End of Scroll One of *Records of Immortal Capital***\n*(Events sourced from the* Prefecture Gazetteer*; eulogies from* Old Gazetteer of Kuocang*).*\n\n**Scroll Two of *Records of Immortal Capital***\n*Compiled by Chen Xingding, Abbot of Jade Void Palace and Lesser Asterism;*\n*Collated by Wu Mingyi Zhongyi, Mountain Chief of Solitary Peak, Fan’gang.*\n\n**Recluses**\nImmortal Capital, a grotto-heaven for seeking transcendence, has never lacked lofty-minded recluses through the ages.",
      "overlap_context": " ancient Yongkang. The deity’s numinous efficacy is omnipresent, and though neighboring counties also have shrines, none are as distinguished as this temple, which possesses stone images as a testament. To this day, the temple remains free of mosquitoes and gnats, the region produces no leeches or conches, and prayers for relief from floods, droughts, plagues, and epidemics are invariably answered. Is this not the ancestral temple? Among the immortals: **Master Jing Fuzhou**, a Daoist of Xiandu.",
      "start_char": 4587,
      "end_char": 5494,
      "start_sentence": 198,
      "end_sentence": 240,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.16439127922058,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\仙都志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "自宋宣和以前，玉虚厄於寇，固不可考。 厥后若游大成等往往阐扬宗教，增重山门，盛德清名，用叔其要。 游大成，乐成人，宫因寇毁，独力重完，克绍前猷，发明后学，尤精地理之术。 自卜寿藏於仙都之支山，誓日：吾家犹子枝孙，世世绍袭，当为天人师。 后果符是言，传之八世，至宋末，坟为土寓所侵而游氏殆绝焉。 楼大度、黄见素，皆邑人，丕扇真风，广彰玄教。 李伯祥，剑川人，道风高古，增建飞天法轮甲於浙左。 刘延用，少微人，奏免浮税，武若冲同门友，表树玄勋。 洪端本，号高溪，叶葆和，号竹涧。 詹虚一，号寄庵。 陈观定，号楚山。 皆丽水人，四世师弟子也。 袭大道之正传，皆玄门之领袖，楚山君改易官向，勋迹尤多。 林天任，号横舟，昆阳人。 昔授修职郎，际陵谷变迁，归心玄学，遂采摭道典，竞离教科，屡阐黄录大斋。 尝於施炼之夕显大神，光垣赫九色，一旦天彻地，民具尔瞻。 谢天与，号兰谷，金华人。 精崇道法，弘赞宗乘。 如梼雨祈晴，兴雷伐庙，不动声色，如响斯答，人到于今称焉。 徐元珊，号梓林，丽水人。 为玉虚道士。 宋景定间应诏祈雪，用粉笔书青纸为五出者，以进日：翼日辰时必雪，皆五出。 及期，果然。 赐号紫微惠济先生。",
      "translated_text": "Since before the Xuanhe era of the Song, Jade Void Palace suffered from banditry, and its earlier history cannot be verified. Thereafter, figures such as You Dacheng frequently propagated the teachings, enhancing the mountain’s prestige. Their profound virtue and pure renown are here recorded in summary.\n\nYou Dacheng, a native of Lecheng, single-handedly restored the palace after its destruction by bandits. He carried forward the former legacy, enlightening later disciples, and was particularly skilled in the art of geomancy. He chose his burial site on a branch mountain of Immortal Capital, vowing: *\"My descendants, generation after generation, shall inherit this calling and become teachers of heaven and humanity.\"* His words proved prophetic—his lineage endured for eight generations until the end of the Song, when his tomb was encroached upon by local settlers and the You clan nearly vanished.\n\nLou Dadu and Huang Jiansu, both natives of the prefecture, vigorously propagated the true Daoist teachings, widely promoting the mysteries of the Way. Li Boxiang, a man of Jianchuan, embodied an ancient and lofty Daoist spirit, expanding the construction of the Flying Celestial Dharma Wheel, unmatched in the eastern Zhe region. Liu Yanyong of Shaowei petitioned for the remission of excessive taxes, while Wu Ruochong, his fellow disciple, was recognized for his meritorious service in the Daoist arts.\n\nHong Duanben, styled Gaoxi; Ye Baohe, styled Zhujian; Zhan Xuyi, styled Ji’an; and Chen Guanding, styled Chushan—all natives of Lishui—formed a four-generation lineage of master and disciple. Inheriting the orthodox transmission of the Great Dao, they became leaders of the Daoist community. Master Chushan, in particular, altered the orientation of the palace halls, leaving many notable achievements.\n\nLin Tianren, styled Hengzhou, a native of Kunyang, was once appointed *Xiuzhi Lang*. Witnessing the vicissitudes of time, he turned his heart to the study of the Dao. He compiled Daoist scriptures, refined liturgical texts, and frequently conducted grand Yellow Register fasts. On one occasion during an alchemical ritual, he manifested a divine presence—radiant light in nine hues filled the walls, and in an instant, heaven and earth became luminous, visible to all the people.\n\nXie Tianyu, styled Langu, a native of Jinhua, was deeply devoted to the Daoist arts and greatly advanced the lineage’s teachings. Whether praying for rain or dispelling drought, summoning thunder to strike unworthy temples, he accomplished all without raising his voice, as if answers came in echo. His reputation endures to this day.\n\nXu Yuanshan, styled Zilin, a native of Lishui, was a Daoist of Jade Void Palace. During the Jingding era of the Song, he was summoned to court to pray for snow. Taking a white brush, he inscribed a five-petaled design on blue paper and presented it, declaring: *\"By the hour of chen tomorrow, snow will fall—all in five-petaled flakes.\"* When the appointed time arrived, it came to pass. He was granted the title *Master of Purple Tenuity and Benevolent Aid*.",
      "overlap_context": "e may draw near.*\n\n**End of Scroll One of *Records of Immortal Capital***\n*(Events sourced from the* Prefecture Gazetteer*; eulogies from* Old Gazetteer of Kuocang*).*\n\n**Scroll Two of *Records of Immortal Capital***\n*Compiled by Chen Xingding, Abbot of Jade Void Palace and Lesser Asterism;*\n*Collated by Wu Mingyi Zhongyi, Mountain Chief of Solitary Peak, Fan’gang.*\n\n**Recluses**\nImmortal Capital, a grotto-heaven for seeking transcendence, has never lacked lofty-minded recluses through the ages.",
      "start_char": 5494,
      "end_char": 5994,
      "start_sentence": 241,
      "end_sentence": 264,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.075745820999146,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\仙都志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "事具郡志。 元以好人召天师，尊其道俾，领玉虚以养寿。 大德甲辰无疾珊化，留愒日：本是蓬莱仙子，住世七十九年，笑指鼎湖归去，洞观无得苍天。 赵嗣棋，字虚一，龙泉人。 幼学道玉虚，既壮，遍游名山，再参南谷杜真人。 观光上国，名公巨卿无不敬爱，钦受宣命，赐印，视五品甲乙住持实始于此。 又数钦捧御香，驰驿淮蜀荆襄江浙湖广闽海思播等处，后住集庆大元兴永寿宫，湖州计筹山升元观，平江白鹤观，累奉纶音，锡号玄明通道虚一先生教门真士。 至元后庚辰冬解化于白鹤，藏剑履于计筹。 李德宁，字守一，括城人。 尝判三衢道教主贰玉虚四十余年，兴废补弊为己任。 至元庚寅免税之功九着。 至正乙酉正月乙未忽索褚笔书愒云：抱德而宁，守一而成，天空月明，逍遥上清。 书已，掷笔而化。 草木",
      "translated_text": "The events are recorded in the prefectural gazetteer.\n\nDuring the Yuan dynasty, the Celestial Master was summoned for his virtuous character, and his Dao was honored, allowing him to oversee Jade Void Palace to nurture longevity. In the *dade* year of *jiachen*, without illness, Xu Yuanshan transformed, leaving behind a farewell verse: *\"I was originally a transcendent of Penglai, having dwelt in the world for seventy-nine years. Laughing, I point toward Dinghu to return—gazing into the cavern heavens, even the azure sky cannot hold me.\"*\n\nZhao Sicheck, styled Xuyi, a native of Longquan, studied the Dao at Jade Void Palace in his youth. In maturity, he wandered through famous mountains and twice sought instruction from Perfected Master Du of Nangu. When he journeyed to the imperial capital, eminent officials and high ministers all held him in reverence. He was granted an imperial commission, bestowed a seal, and appointed to a fifth-rank position as abbot—this was the true beginning of such appointments. He was repeatedly entrusted with imperial incense, dispatched by post to regions including Huai, Shu, Jing, Xiang, Jiang, Zhe, Huguang, Min, Hai, and Sibo. Later, he resided at Dayuanxing Yongshou Palace in Jiqing, Shengyuan Abbey on Jichou Mountain in Huzhou, Baihe Abbey in Pingjiang, and was repeatedly honored with imperial decrees, receiving the title *Master of Mysterious Clarity, Dao-Pervading, and Void Unity, Perfected Adept of the Teachings*. In the winter of the *gengchen* year following *zhiyuan*, he transformed at Baihe Abbey, and his sword and sandals were interred at Jichou.\n\nLi Dening, styled Shouyi, a native of Kuocheng, once served as vice-director of Daoist affairs in Sanqu and deputy overseer of Jade Void Palace for over forty years, taking the restoration of dilapidation and the rectification of abuses as his personal duty. In the *gengyin* year of *zhiyuan*, his merit in exempting taxes was prominently displayed. On the *yimao* day of the first month in the *yiyou* year of *zhizheng*, he suddenly called for brush and paper, writing a farewell verse: *\"Embracing virtue in tranquility, preserving unity to achieve perfection—sky empty, moon bright, I roam freely in the Upper Clarity.\"* Having written this, he cast aside the brush and transformed. The grasses and trees...",
      "overlap_context": "ho. His reputation endures to this day.\n\nXu Yuanshan, styled Zilin, a native of Lishui, was a Daoist of Jade Void Palace. During the Jingding era of the Song, he was summoned to court to pray for snow. Taking a white brush, he inscribed a five-petaled design on blue paper and presented it, declaring: *\"By the hour of chen tomorrow, snow will fall—all in five-petaled flakes.\"* When the appointed time arrived, it came to pass. He was granted the title *Master of Purple Tenuity and Benevolent Aid*.",
      "start_char": 5994,
      "end_char": 6319,
      "start_sentence": 265,
      "end_sentence": 278,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.491894483566284,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\仙都志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "金莲花，按《郡志》：石顶有湖生莲花仙都山孤石撑空，。 古老相传，尝有金莲花瓣飘落。 龙须草，产于独峰崖上。 旧《志》云：黄帝驾龙上升，群臣攀龙髯而上，髯坠，化为草。 寿松古相，生于独峰之顶。 木皆合抱，四时长青，可见独峰有鼎湖之润深也。 草木可药者往往见，山翁野叟采取，形殊味别，莫识其名。 今按本草载所有者，虽非土产，亦不广生，姑列其品目于后，以表名山之嘉秀云。 黄精、莒蒲、菊花、天门冬、麦门冬、车前子、地黄、牛膝、薯积、苍苜仁、巴戟天、括楼根、石斛、庵兰、卷梧、草龙胆、旋覆花、草央明、芍爷、青蒿、络石、茵陈蒿、石香棻、紫金藤、蓝实、景天、葛根、石龙卜、仙灵皮、岁灵仙、苦参、当归、通草、常山、何首乌、忍冬藤、芍药、瞿麦、狗脊、山豆根、牵牛子、薇香子、百合、茅根、草藓、篦麻子、金星草、天南星、仙茅、藐楔、艾叶、马兜铃、马啼香、刘寄奴、半夏、大青、剪草、莎草根、谷精草、骨碎补、王瓜、射干、白敛、续随子、鹦冠子、覆盆子、商陆、稀签、鹤虱、萱草根、夏枯草、草耳 实、马勃、泽兰、茵芋、紫河车、五味子、白木、大汗、王不留行、防己、杜华卢、羊蹄、大小蓟根、细辛、鬼旧、水萍、香蕾、紫苏、鬼箭羽、薄苛、木寥、马芹、淡竹叶、马齿苋、冬葵子、沙参、紫葛、茹蕃、灯心草、三白草、牛劳子、苎根、菰根、曹草、甘蕉根、马鞭草、地肤子、杜着、白蒿、桔梗、蛇每、旱莲草、草乌头、松脂、枫脂、梧实、五加皮、地骨皮、桑白皮、楮实、槐实、橡实、五陪子、枸杞子、郁李仁、乌药、黄蘗、茱萸、山茱萸、金樱子、金铃子、木仅、皂荚、苦榛、苦榛、练子花、蔓荆子、石楠、钓藤、栀子、乌柏木、择木皮、水杨叶、秦椒、乾漆、杉材、稻米、粟、白扁豆、赤豆、绿豆、大麦、小麦、白油麻、婴子粟、梨、枣、藕实、鹦头、石榴皮、栗楔、桃仁、梅实、柿蒂、藤梨、枇杷叶、葱实、白苣、苦贾、水芹、乌芋、苜蓿、嵩、芥、蒜、韭、荠。 碑碣并题咏 黄帝祠宇，石刻四大字。",
      "translated_text": "The Golden Lotus Flower, according to the *Prefectural Gazetteer*, grows in a lake atop the stone summit of Xiandu Mountain, where a solitary rock thrusts into the sky. Local elders tell that golden lotus petals once drifted down from above. Dragon’s Beard Grass thrives on the cliffs of Solitary Peak. The old *Gazetteer* records: when the Yellow Emperor ascended in a dragon-drawn chariot, his ministers clung to the dragon’s whiskers as it rose; the whiskers fell and transformed into this grass. The Ancient Longevity Pines stand at the summit of Solitary Peak, their trunks thick enough to embrace, evergreen through all seasons—proof of the deep moisture of Solitary Peak’s Cauldron Lake.\n\nAmong the flora, many serve as medicinal herbs. Mountain hermits and rustic elders gather them, though their forms and flavors differ, and few know their names. Now, following the *Materia Medica*, we list below those species recorded therein—though not all are native to this land nor grow in abundance—to showcase the fine beauty of this renowned mountain:\n\n*Polygonatum*, *Acorus*, chrysanthemum, *Asparagus cochinchinensis*, *Ophiopogon japonicus*, *Plantago* seed, *Rehmannia*, *Achyranthes*, *Dioscorea*, *Coix*, *Morinda*, *Trichosanthes* root, *Dendrobium*, *Eupatorium*, *Selaginella*, *Gentiana*, *Inula*, *Senecio*, *Paeonia*, *Artemisia*, *Trachelospermum*, *Artemisia capillaris*, *Mosla*, *Tripterygium*, indigo, *Sedum*, *Pueraria* root, *Solanum lyratum*, *Epimedium*, *Clematis*, *Sophora flavescens*, *Angelica sinensis*, *Tetrapanax*, *Dichroa*, *Polygonum multiflorum*, *Lonicera*, *Paeonia lactiflora*, *Dianthus*, *Cibotium*, *Euchresta*, *Pharbitis*, *Anethum*, lily, *Imperata* root, *Dioscorea hypoglauca*, *Ricinus*, *Phymatodes*, *Arisaema*, *Curculigo*, *Anemarrhena*, mugwort, *Aristolochia*, *Valeriana*, *Artemisia anomala*, *Siegesbeckia*, *Pinellia*, *Isatis*, *Clinopodium*, *Cyperus* root, *Eriocaulon*, *Drynaria*, *Trichosanthes cucumeroides*, *Belamcanda*, *Ampelopsis*, *Euphorbia lathyris*, *Celosia* seed, *Rubus*, *Phytolacca*, *Siegesbeckia*, *Carpesium*, *Hemerocallis* root, *Prunella*, *Xanthium*, *Lycoperdon*, *Eupatorium*, *Skimmia*, *Placenta hominis*, *Schisandra*, *Aquilaria*, *Euphorbia pekinensis*, *Vaccaria*, *Stephania*, *Syringa*, *Rumex*, *Cirsium* root, *Asarum*, *Aconitum*, duckweed, *Elsholtzia*, *Perilla*, *Euonymus*, *Mentha*, *Equisetum*, *Oenanthe*, *Houttuynia*, *Abutilon*, *Commelina*, *Tribulus*, *Boehmeria*, *Zizania*, *Typha*, *Miscanthus*, *Musa* root, *Verbena*, *Kochia*, *Euphorbia*, *Artemisia stelleriana*, *Platycodon*, *Duchesnea*, *Eclipta*, *Aconitum*, pine resin, maple resin, *Firmiana* seed, *Acanthopanax*, *Lycium* bark, *Morus* bark, *Broussonetia* fruit, *Sophora* fruit, *Quercus* fruit, *Galla chinensis*, *Lycium* fruit, *Prunus japonica* seed, *Lindera*, *Phellodendron*, *Evodia*, *Cornus*, *Rosa laevigata*, *Melia*, *Gleditsia*, *Melia azedarach*, *Melia azedarach* (repeated), *Melia* flower, *Vitex*, *Photinia*, *Uncaria*, *Gardenia*, *Sapium*, *Cudrania*, *Salix*, *Zanthoxylum*, *Toxicodendron*, *Cunninghamia*, rice, millet, *Dolichos*, *Vigna angularis*, mung bean, barley, wheat, sesame, *Papaver*, pear, jujube, lotus seed, *Euryale*, pomegranate peel, *Castanea* burr, peach kernel, plum, persimmon calyx, *Actinidia*, loquat leaf, onion seed, lettuce, *Sonchus*, water celery, *Eleocharis*, alfalfa, *Artemisia*, mustard, garlic, leek, shepherd’s purse.\n\nCarved steles and inscribed verses accompany the Temple of the Yellow Emperor, where four large characters are engraved upon the stone.",
      "overlap_context": " rectification of abuses as his personal duty. In the *gengyin* year of *zhiyuan*, his merit in exempting taxes was prominently displayed. On the *yimao* day of the first month in the *yiyou* year of *zhizheng*, he suddenly called for brush and paper, writing a farewell verse: *\"Embracing virtue in tranquility, preserving unity to achieve perfection—sky empty, moon bright, I roam freely in the Upper Clarity.\"* Having written this, he cast aside the brush and transformed. The grasses and trees...",
      "start_char": 6319,
      "end_char": 7129,
      "start_sentence": 279,
      "end_sentence": 290,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.390746355056763,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\仙都志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "唐缙云令李阳冰篆。 碑石元在玉虚宫后，为县人辇置邑庠。 庆历问於碑阴刊屯虽瞻所撰学记，今石尚存焉。 唐韦加撰《仙都山铭》，潜说友篆。 港前宋人。 唐刺史李季贞撰《仙都山铭》赵必愿篆。 赵前宋人。 唐陆龟蒙《题镜岩周尊师所居诗并序》。 宋治平二年改赐玉虚宫，敕黄及省剖部符。 刻石 钱塘昊说《陪郡守刘大中游仙都记》。 通判丁宗旦《题仙都山玉虚官诗》。 郡守谢伋《和运使李士举诗》。 郡人项鹦撰《玉虚官免税役记》。 太学尚书邹景初《游玉虚宫诗并跋》。 太常寺簿昊大韶《赠知官詹虚一诗》。 杜晦之《游仙都记》。 郡守赵必愿《游仙都记》。 郡守安刘判《申请改宫向状》。 邑人潜说友撰《重建玉虚官记》。 邑令昊祖文《题独峰诗》。 仙居陈仁玉《游仙都诗》、弟邑令绍若《跋》。 已上钱塘具说至邑令绍若俱宋时人。 元缙云县尹石谷谢雷使徐元缙《祈雨诗》。 元玺书大护持玉虚宫复甲乙正副全文刻石。 已上并在玉虚宫。 隐真刘先生《玄墟碑志》。 元玺书护持妙庭观复甲乙正副全文刻石。 已上在妙庭观。 转运使叶清臣撰《独峰山铭》，磨崖于峰下。 庆历问运使马寻、皇佑问运使苏公舜、元元丰间少保赵清献公扑，及前后名公四十余人，各记游山岁月并磨崖于仙水洞中。 庆历问邑尉毛维瞻陪转运使留瑜游仙都记，磨崖于步虚山麓。 嘉佑间会稽沈绅、宣和问开封刘公长卿、绍兴问钱塘虞公似平，及前后名公二十余人，各记游山岁月，并磨崖于初旸谷中。 绍兴间郭契敷、蒋善昭、赵善诗、杨景奉诏诣《仙都祈雨记》磨崖于镜岩。 嘉定问留元刚、郭磊卿等《游仙都记》，磨崖于初旸谷外石壁上。 小蓬莱三字，四明楼轮书，立碑在山中。 邑人黄邦彦《题独峰诗》，磨崖于童子峰。 邑令王坛《小蓬莱歌》磨崖于石壁。 已上转运副使叶清臣至邑令王坛俱宋时人。 仙水岩三楷字，磨崖于洞中。 初旸谷三大楷字，磨崖于谷中。 倪爷洞三大篆字，或云李阳冰书，磨崖于洞前。 隐真洞三篆字、金龙洞三篆字、天堂洞三隶字、忘归洞三楷字，并磨崖于其洞。 右山中碑码磨崖名目已见于前，今摘其铭记略存于后，所有古今名公题咏诗集另刊。 都山铭 唐韦翔撰 亭亭仙都，峻极维嵩，屹立俱右，削成淅东。 发地直方，磨霄穹崇，灵沼在上，祥云积中。 圭坛千仞，柱宁四封。 目视不及，翰飞靡穷。 群阜奔走，列仙会同。 黄帝彼访，碧岭是冲。 丹穴傍起，金溪下融。 日照霞附。 月映销蒙。 壤绝栖尘，木无寓丛。 居幽不昧，守一而雄。 万寿报响，九成来空。 嘉名来复，展礼斯洪。 录作惩止，年祈感通。 莫高匪慈，造物之功。 玄混播形，厚载孕灵。 雄冠群山，孤高亭亭。 挺立参天，氲氲青冥。 岚凝丹穴，霞驳云屏。 上磨九霄，旁碍五星。 龙髯莫睹，凤管时听。 降自穆武，求之靡宁。 徒闻荒政，曾不延龄。 物有殊异，昔人乃铭。 爰勒斯文，缙云之炯。 张鹭撰 仙都有山，山出万山。 直上千寻，□烟霞深。 圆如等抽，高突云阴。 标表下国，权舆象帝。 日欤月欤，万有千岁。 东西大镇，川泽四卫。 造化无垠，莫知往制。 晴岚依依，宿雾洞开。 髻鬃有像，神仙下来。 撷气氲氲，灵乌环回。 永殊尘杂，不鼓纤埃。 绝顶霄愕，澄湖在上。",
      "translated_text": "The Tang dynasty magistrate of Jinyun, Li Yangbing, inscribed in seal script. The stele originally stood behind the Jade Void Palace but was later transported by county residents to the local academy. During the Qingli era, the *Record of the Academy* composed by Tun Suizhan was engraved on its reverse—this stone remains extant today.\n\nThe Tang dynasty’s Wei Jia composed the *Inscription of Mount Xiandu*, with seal script by Qian Shuyou (a Song dynasty figure). The Tang dynasty prefect Li Jizhen authored another *Inscription of Mount Xiandu*, with seal script by Zhao Bi’yuan (a former Song figure). The Tang poet Lu Guimeng’s *Poem on Mirror Cliff and the Abode of Master Zhou, with Preface*. In the second year of the Zhiping era of the Song, the Jade Void Palace was renamed by imperial decree, with the edict and ministry documents carved in stone.\n\nWu Shuo of Qiantang’s *Account of Accompanying Prefect Liu Dazhong on an Excursion to Mount Xiandu*. Sub-prefect Ding Zongdan’s *Poem on the Jade Void Palace at Mount Xiandu*. Prefect Xie Ji’s *Poem in Response to Transport Commissioner Li Shiju*. The county native Xiang Ying’s *Record of the Jade Void Palace’s Exemption from Taxes and Corvée*. The Hanlin Academician and Minister Zou Jingchu’s *Poem on Visiting the Jade Void Palace, with Postscript*. The Registrar of the Court of Imperial Sacrifices Wu Dashao’s *Poem for the Magistrate Zhan Xuyi*. Du Huizhi’s *Account of a Journey to Mount Xiandu*. Prefect Zhao Bi’yuan’s *Account of a Journey to Mount Xiandu*. Prefect An Liu’s *Petition to Alter the Palace’s Orientation*. The county native Qian Shuyou’s *Record of the Reconstruction of the Jade Void Palace*. The county magistrate Wu Zuwen’s *Poem on Solitary Peak*. Chen Renyu of Xianju’s *Poem on Visiting Mount Xiandu*, with his younger brother, the county magistrate Shao’ruo’s *Postscript*. All the above, from Wu Shuo of Qiantang to the magistrate Shao’ruo, were figures of the Song dynasty.\n\nDuring the Yuan dynasty, the magistrate of Jinyun, Shi Gu, and the emissary Xie Lei, along with Xu Yuanjin, composed *Poems on Praying for Rain*. The Yuan dynasty’s imperial edicts for the protection of the Jade Void Palace, including the full texts of the primary and secondary *Jia* and *Yi* documents, were carved in stone. All the above are located at the Jade Void Palace.\n\nThe *Stele Record of the Mystic Ruins* by the Recluse Master Liu. The Yuan dynasty’s imperial edicts for the protection of Miaoting Abbey, including the full texts of the primary and secondary *Jia* and *Yi* documents, were carved in stone. All the above are located at Miaoting Abbey.\n\nThe transport commissioner Ye Qingchen composed the *Inscription of Solitary Peak*, carved into the cliff at its base. During the Qingli era, Transport Commissioner Ma Xun; during the Huangyou era, Transport Commissioner Su Shun; during the Yuanfeng era, the Grand Guardian Zhao Qingxian; and over forty other renowned officials of past and present recorded the dates of their mountain excursions, all carved into the cliff at the Immortal’s Water Grotto. During the Qingli era, the county deputy Mao Weizhan accompanied Transport Commissioner Liu Yu on an excursion to Mount Xiandu, with his account carved into the cliff at the foot of Mount Buxu.\n\nDuring the Jiayou era, Shen Shen of Kuaiji; during the Xuanhe era, Liu Changqing of Kaifeng; during the Shaoxing era, Yu Siping of Qiantang; and over twenty other renowned officials of past and present recorded the dates of their mountain excursions, all carved into the cliff at the Valley of First Dawn. During the Shaoxing era, Guo Qifu, Jiang Shanzhao, Zhao Shanfu, and Yang Jing were dispatched by imperial decree to *Record the Prayer for Rain at Mount Xiandu*, carved into the cliff at Mirror Cliff. During the Jiading era, Liu Yuangang, Guo Leiqing, and others’ *Account of a Journey to Mount Xiandu* was carved into the cliff outside the Valley of First Dawn.\n\nThe three characters \"Little Penglai\" were inscribed by Lou Lun of Mingzhou, with a stele erected in the mountains. The county native Huang Bangyan’s *Poem on Solitary Peak* was carved into the cliff at Boy’s Peak. The county magistrate Wang Tan’s *Song of Little Penglai* was carved into the cliff. All the above, from Vice Transport Commissioner Ye Qingchen to County Magistrate Wang Tan, were figures of the Song dynasty.\n\nThe three regular-script characters \"Immortal’s Water Cliff\" were carved into the cliff within the grotto. The three large regular-script characters \"Valley of First Dawn\" were carved into the cliff within the valley. The three seal-script characters \"Master Ni’s Grotto\"—some say inscribed by Li Yangbing—were carved into the cliff before the grotto. The three seal-script characters \"Hidden Truth Grotto,\" \"Golden Dragon Grotto,\" the three clerical-script characters \"Heavenly Hall Grotto,\" and the three regular-script characters \"Forgetting Return Grotto\" were all carved into their respective grottoes.\n\nThe inscriptions and records of the mountain’s steles and cliff carvings have been noted above; below are excerpts of their texts. All poems and compositions by ancient and modern renowned figures are published separately.\n\n---\n\n**Inscription of Mount Xiandu**\nComposed by Wei Xiang of the Tang\n\nLofty stands the Immortal’s Capital,\nTowering above all peaks, rivaling Mount Song.\nErect to the right, hewn in the east,\nIt rises from the earth, straight and square,\nScraping the heavens, vast and high.\nA sacred pool crowns its summit,\nAuspicious clouds gather within.\nA jade altar soars a thousand fathoms,\nA pillar upholding the four bounds.\nThe eye cannot reach its end,\nNor can winged flight traverse its expanse.\nMyriad hills hasten in obeisance,\nWhere immortals convene in assembly.\nThe Yellow Emperor once sought it,\nPiercing the azure ridges.\nCinnabar caves rise beside it,\nGolden streams flow below.\nSunlight kindles the rosy clouds,\nMoonlight dissolves the mist.\nIts soil is untouched by dust,\nIts trees host no wandering flocks.\nDwelling in seclusion yet unobscured,\nHolding to the One, it stands mighty.\nEchoing the ten thousand ages,\nThe nine harmonies resound in emptiness.\nA propitious name returns,\nGrand rites are here performed.\nTo record and admonish,\nTo pray and commune in gratitude.\nNone is higher than compassion,\nThe work of Creation itself.\nThe primordial chaos shaped its form,\nThe fertile earth nurtured its spirit.\nCrowned among mountains,\nSolitary and towering.\nStanding tall to pierce the heavens,\nIts vapors swirl in the azure void.\nMists congeal at the cinnabar caves,\nRosy clouds streak the cloud-screen.\nAbove, it grates the nine heavens,\nBeside, it obstructs the five stars.\nThe dragon’s beard remains unseen,\nThe phoenix’s pipes are heard at times.\nDescending from the sacred and martial,\nSeeking it without rest.\nVainly hearing of desolate governance,\nNever prolonging life.\nThings possess their distinctions,\nThus the ancients inscribed this.\nHere I engrave these words,\nA beacon for Jinyun.\n\n---\n\n**Inscription of Mount Xiandu**\nComposed by Zhang Lu\n\nMount Xiandu possesses a mountain,\nA mountain among ten thousand mountains.\nIt ascends a thousand fathoms,\nLost in the depths of mist and clouds.\nRound as a measuring tool,\nLofty, piercing the clouded shade.\nA landmark for the realm below,\nThe origin of the Emperor’s image.\nIs it the sun? Is it the moon?\nTen thousand things, a thousand years.\nThe great eastern bulwark,\nGuarded by rivers and marshes on four sides.\nCreation knows no bounds,\nIts origins unknowable.\nClear mists linger,\nThe night’s fog disperses, revealing the grotto.\nWith the semblance of topknots and tresses,\nThe immortals descend.\nGathering qi in swirling mists,\nSpiritual birds circle in return.\nForever apart from worldly dust,\nNot stirring the slightest speck.\nAt its summit, the heavens startle,\nA limpid lake lies above.",
      "overlap_context": "*Cunninghamia*, rice, millet, *Dolichos*, *Vigna angularis*, mung bean, barley, wheat, sesame, *Papaver*, pear, jujube, lotus seed, *Euryale*, pomegranate peel, *Castanea* burr, peach kernel, plum, persimmon calyx, *Actinidia*, loquat leaf, onion seed, lettuce, *Sonchus*, water celery, *Eleocharis*, alfalfa, *Artemisia*, mustard, garlic, leek, shepherd’s purse.\n\nCarved steles and inscribed verses accompany the Temple of the Yellow Emperor, where four large characters are engraved upon the stone.",
      "start_char": 7129,
      "end_char": 8460,
      "start_sentence": 291,
      "end_sentence": 374,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.10144019126892,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\仙都志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "人罕戾止，孰阀其状。 日烛云披，风飘液飞。 如雨雨空，微洒沾衣。 谷来松音，潭影曙晖。 往往鹤戾，不知所归。 唐垂百年，玄宗体元。 响应万岁，声闻上天。 帝祚明德，祠堂在· 焉。 永怀轩后，功成此地。 丹鳌犹存，龙升万里。 事列方志，道高青史。 无复仙容，空流溪水。 百越之内，此山为大。 恍若壶中，疑生象外。 直而不倚，高而不殆。 古往今来，独立沧海。 宋转运副使叶清臣撰 黄帝车辙马迹周遍万国，丹成云起，．因瑞名山。 则独峰之登，固宜有是。 会将漕二浙行部括苍道士，仙都亲访灵迹，慨然感秦汉之不自度也。 驻马溪上，勒铭山阴。 於黄显思道崇帝先隆三迈、五，功丰德全，脱履厌世，乘云上天，师彼飞龙格于皇天，虐秦侈汉鏖，兵事边流痛刻下溺祚穷年忘是古训，跋于岩巅，宜尔灵仙，孤风妇然。 题咏 中书舍人白居易乐天 黄帝旌幢去不回，片云孤石独崔鬼。 有时风激鼎湖浪，散作晴天雨点来。 前进士徐凝 天地茫茫成古今，仙都凡有几人寻。 到来唯见山高下，只是不知湖浅深。 运使起居舍人曹唐二首 蟠桃花老华阳东，轩后登真谢六官。 旌节暗迎归碧落，笙歌遥听隔崆峒。 衣冠留葬桥山月，剑履将随浪海风。 看却龙髯攀不得，红霞零落鼎湖空。 黄帝登真处，青青不记年。 孤峰疑碍日，一柱独擎天。 石怪长栖鹤，云闲若有仙。 鼎湖看不见，零落数枝莲。 江湖散人陆龟蒙鲁望题镜岩周尊师所居 见说身轻鹤不如，石房无倡共云居。 清晨自削灵香柿，独夜空吟碧落书。 十洞飞精应遍吸，一茎秋发未曾梳。 知君便入悬珠会，早晚来骑白鲤鱼。 序载仙都志中镜岩即仙水洞。 太常博士皮日休袭美和 八十余年住镜岩，鹿皮巾下雪髟髟。 床寒不奈云萦枕，经润何妨乳滴函。 饮碉猿回窥绝洞，绿梯人歇倚危杉。 如何计吏穷於乌，欲望仙都举一帆。 两浙转运副使李建中 岩岩仙都山，肃肃黄帝宫。 巨石临广泽，千仞凌高穹。 肇当融结初，全得造化功。 深可蟠厚壤，峭疑截冥鸿。 云饼去路存，丹鼎遗边空。 抽润草心碧，敷香莲叶红。 升龙扳娇娇，飞凤呜味嚷。 而我集仙署，尝比瀛洲雄。 星移委女间，风驾析木束。 到觉毛骨爽，坐如羽翼冲。 万事皆氛埃，一气归鸿蒙。 遐哉上圣道，邈与玄化同。 金简奠至诚，玉书铭代工。 功成解冠剑，栖息期此中。 郡倅梁鼎 黄帝升天石，高名壮斗牛。 孤根斜照水，寒色不知秋。 藐与群峰并，圆如一抽。 晓妨残月下，晴落星流。 危定胜昆闱，登应见沃洲。 爱深无尽处，日极更迟留。 起居舍人转运使孙何三首 贝阙琳宫紫雾深，凤凰仙乐尚惜惜。 鼎湖往事三千载，石笋青春一万寻。 挺立不教凡草长，削成应兔俗尘侵。 霓旌绛节知何处，空有莲花送好音。 薜荔无因挂一毫，化工镌削亦应劳。 圭形直指明河落，桂影遥分涨海涛。 发地五千何足贵，去天三百未为高。 轩辕辙边今犹在，斗上丹梯着羽袍。 黄帝升天去不还，空留片石在人问。 千寻杳杳撑红日，万古峨峨出众山。 湿雾好花宫女困，倚云乔木羽林闲。 时人不信飞升路，辙迹龙髯竟可攀。 刺史王含章 三年为郡仰灵踪，咫尺无因到此中。 长是徘徊看图画，果然晒蟀在虚空。 云归湖顶尘难染，鹤立松梢路莫通。 春过碧溪人饭少，古坛牢落雨蒙蒙。",
      "translated_text": "Few mortals reach this place—who could describe its form?\nSunlight pierces the clouds, wind scatters mist into flight.\nLike rain falling through empty air, a fine spray dampens the robes.\nFrom the valley comes the sound of pines; the pool mirrors dawn’s glow.\nNow and again, cranes alight—none know where they go.\n\nThe Tang endured a hundred years; Xuanzong embodied the primal.\nHis \"Long Live the Emperor\" echoed to the heavens above.\nThe imperial virtue shone bright; here stands his shrine.\nEver do we cherish the Yellow Emperor, who perfected his work upon this land.\nThe cinnabar turtle endures; the dragon soars ten thousand li.\nHis deeds fill the gazetteers; his Dao towers in the annals of history.\nNo immortal visage remains—only the stream flows on.\n\nWithin the hundred Yue, this mountain stands supreme.\nAs if within a pot of immortals, yet beyond the realm of form.\nStraight yet not leaning, lofty yet not perilous.\nFrom ancient times to now, it stands alone above the sea.\n\n---\n\n**Inscription by Ye Qingchen, Vice Commissioner of the Zhejiang Circuit**\nThe Yellow Emperor’s chariot tracks and horse prints spanned the realm.\nWhen his elixir was complete, clouds arose—thus was this auspicious mountain named.\nThe ascent of this solitary peak was surely destined.\n\nAs I oversaw the transport of grain through the two Zhe regions and toured the Kuocang Mountains,\nI personally sought the immortal traces of Xiandu.\nMoved by the folly of Qin and Han, which measured not their own limits,\nI reined my horse by the stream and inscribed this stele upon the mountain’s shade.\n\nOh, how resplendent was the Dao, how exalted the Emperor’s primacy!\nThrice he ascended, fivefold his achievements—his virtue whole, his merit vast.\nShedding his mortal coil, he loathed the world, riding clouds to heaven.\nHe tamed the flying dragons, reaching the August Sky.\nYet Qin’s tyranny and Han’s extravagance waged endless wars, their reigns drowned in sorrow.\nForgetting this ancient lesson, they stumbled upon the cliffs.\nHere, the divine immortals stand aloof, their solitary grace untouched.\n\n---\n\n**Poems Inscribed**\n\n**By Bai Juyi, Academician of the Secretariat**\nThe Yellow Emperor’s banners and standards never returned;\nA lone cloud, a solitary stone, stands towering.\nAt times, wind stirs the waves of Ding Lake,\nScattering them as raindrops across the clear sky.\n\n**By Xu Ning, Former Presented Scholar**\nHeaven and earth stretch boundless through past and present—\nHow many have sought the immortal precincts of Xiandu?\nArriving, one sees only the mountain’s rise and fall,\nNever knowing the lake’s depth.\n\n**Two Poems by Cao Tang, Vice Commissioner and Academician**\nThe peach blossoms of Huayang wither in the east;\nThe Yellow Emperor ascended, leaving the six palaces behind.\nHis banners and standards silently welcomed him to the azure vault;\nThe sound of reed pipes and songs drifted from distant Kongtong.\nHis robes and cap remain buried beneath the moon of Qiao Mountain;\nHis sword and sandals follow the winds of the Eastern Sea.\nGazing at the dragon’s whiskers, one cannot grasp them—\nRed mists scatter, Ding Lake lies empty.\n\nWhere the Yellow Emperor ascended, the years blur into green.\nA solitary peak seems to block the sun; a single pillar props up the sky.\nStrange stones harbor nesting cranes; idle clouds hint at immortals.\nDing Lake is lost from sight—only a few lotus stems remain.\n\n**By Lu Guimeng, Recluse of Rivers and Lakes**\nI hear your body is lighter than a crane’s,\nDwelling in a stone chamber with clouds, free of worldly ties.\nAt dawn, you carve fragrant persimmons;\nAlone at night, you chant scriptures of the azure void.\nThe essence of ten caves you absorb in flight;\nA single autumnal lock of hair remains unkempt.\nKnowing you’ve entered the assembly of the Suspended Pearl,\nSoon you’ll ride a white carp.\n\n*(From the* Xiandu Annals*: Jingyan is the Immortal’s Water Grotto.)*\n\n**By Pi Rixiu, Erudite of the Court of Imperial Sacrifices**\nFor eighty years and more, you’ve dwelled in Jingyan,\nA deer-skin cap beneath your snowy locks.\nThe bed grows cold, unbearable with clouds coiled round the pillow;\nThe scriptures dampen—no matter if stalactites drip upon their cases.\nThe drinking ape peers back from the abyss;\nThe green ladder leans against a perilous fir, its climber at rest.\nHow could a petty clerk, bound like a crow,\nEver hope to set sail for Xiandu?\n\n**By Li Jianzhong, Vice Commissioner of the Two Zhe Circuits**\nMajestic, the mountain of Xiandu;\nSolemn, the palace of the Yellow Emperor.\nA colossal stone overlooks the vast marsh,\nA thousand fathoms piercing the high vault.\nIt arose at the dawn of creation, bearing the work of the Maker.\nDeep enough to coil the fertile earth, sheer as if slicing the soaring swan.\nThe cloud-wrapped path remains; the alchemical tripod’s edge is empty.\nEmerald moss glistens in the crevices; fragrant lotus leaves bloom red.\nThe ascending dragon clings, proud and fierce;\nThe flying phoenix cries, its voice ringing.\nI, who serve in the Bureau of Immortals, have long compared it to Penglai’s might.\nAs stars shift past Weinu, the wind-borne chariot nears the eastern sky.\nArriving, I feel my bones and flesh refreshed,\nAs if borne aloft on wings.\nWorldly affairs are but dust and haze;\nA single breath returns to the primordial vastness.\nHow distant the sagely Dao—\nVast as the mysterious workings of creation.\nWith golden tablets, I offer utmost sincerity;\nWith jade inscriptions, I record an age’s labor.\nWhen my work is done, I’ll lay aside cap and sword,\nAnd dwell in peace upon this mountain.\n\n---\n\n**By Liang Ding, Prefectural Aide**\nThe Yellow Emperor’s stone of ascension,\nIts lofty name rivals the Dipper and Ox.\nIts solitary root slants over the water;\nIts chill hue knows not autumn.\nTiny beside the clustered peaks,\nRound as a measuring tool.\nAt dawn, it obstructs the setting moon;\nIn clear skies, it intercepts the falling stars.\nPerilous yet steadfast, surpassing Kunlun’s gates,\nOne who climbs it should glimpse Yuzhou.\nMy love for it knows no end—\nThe sun sets, yet I linger.\n\n**Three Poems by Sun He, Academician and Vice Commissioner**\n\n**I**\nJade towers and gem palaces wreathed in purple mist,\nThe phoenix’s immortal music still lingers.\nThree thousand years have passed since the events of Ding Lake;\nThe green stalagmite stands ten thousand fathoms tall.\nIt stands erect, allowing no common weeds to grow;\nIts sheer form repels the dust of the vulgar world.\nWhere now are the rainbow banners and crimson staffs?\nOnly the lotus flowers bring tidings of the divine.\n\n**II**\nNo way to hang even a strand of ivy,\nYet the Creator’s chisel must have labored here.\nIts jade-like form points straight to the Milky Way’s descent;\nIts cassia shadow divides the tides of the Eastern Sea.\nFive thousand feet from earth—what worth is that?\nThree hundred li from heaven—still not high enough.\nBy the Yellow Emperor’s tracks, the traces remain;\nAtop the Dipper, a ladder of feathers ascends.\n\n**III**\nThe Yellow Emperor ascended and never returned,\nLeaving only this stone among men.\nA thousand fathoms of misty height prop up the red sun;\nFor ten thousand ages, it towers above the crowd.\nDamp mists and lovely blossoms weary the palace maidens;\nLeaning on clouds, the towering trees idle the Feathered Forest.\nYet men of this age do not believe in the path of flight—\nThe dragon’s tracks and whiskers are there for the climbing.\n\n**By Wang Hanzhang, Prefect**\nFor three years I governed this land, revering its sacred traces,\nYet never found the chance to draw near.\nEver do I linger, gazing at its paintings,\nFor truly, the sun-drying toad dwells in the void.\nClouds gather at the lake’s summit, untouched by dust;\nCranes stand upon the pines, the path beyond reach.\nSpring passes by Creekside; few partake of its fare—\nThe ancient altar lies desolate, veiled in rain.",
      "overlap_context": "he moon?\nTen thousand things, a thousand years.\nThe great eastern bulwark,\nGuarded by rivers and marshes on four sides.\nCreation knows no bounds,\nIts origins unknowable.\nClear mists linger,\nThe night’s fog disperses, revealing the grotto.\nWith the semblance of topknots and tresses,\nThe immortals descend.\nGathering qi in swirling mists,\nSpiritual birds circle in return.\nForever apart from worldly dust,\nNot stirring the slightest speck.\nAt its summit, the heavens startle,\nA limpid lake lies above.",
      "start_char": 8460,
      "end_char": 9836,
      "start_sentence": 375,
      "end_sentence": 463,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.882896184921265,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\仙都志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "郡人太常丞周启明昭回二首 鼎湖深几许，斗立向空牢。 霹雳削不得，芙蓉生更高。 飞升须驾鹤，负荷欲凭鳌。 千仞□ □ □ ，何当继我曹。 蟀既撑天一柱雄，遥看高与步虚同。 待登绝陇观华顶，又见巍巍峻插空。 太常博士直史馆知郡曾会二首 时常展画图，今喜到仙都○ 尽得烟霞景，方知手笔厅。 擎天成一柱，镇地出三昊。 苔片封车辙，莲香泛鼎湖。 占风来海国，迎日上云衢。 似笋千寻直，如蓝四面铺。 秀能通造化，高岂得搏扶。 雷雨生岩宝，星辰远药炉。 金华惭叱石，玉女望投壶。 观古坛尤在，碑荒字半无。 未曾迷阮肇，何倦醉麻姑。 尘外标名异，空中立影孤。 笑秦铭泰岳，嫌舜葬苍梧。 夏月风长满，秋霜草不枯。 步虚昤羽客，滴翠湿樵夫。 独称瀛洲倡，吟看典郡符。 瀛洲风月十年余，束出云堂典郡符。 更到烟霞最深处，分明景物是仙都。 郡守陈若拙 发地便擎天，根盘数亩烟。 化工成突兀，辙迩似雕镌。 峭拔殊无倚，孤高众莫肩。 轩辕从此去，知复几千年。 着作佐郎两浙运使柳绅 独出诸峰表，周围一丈圆。 千寻雄镇地，万仞上擎天。",
      "translated_text": "**Two Poems by Zhou Qiming, Vice Minister of the Court of Imperial Sacrifices, of This Prefecture**\n\nHow deep is the Cauldron Lake?\nIt stands like the Dipper, pointing to the empty vault.\nThe thunderbolt’s cleaving cannot diminish it—\nThe lotus blooms ever higher.\n\nTo ascend, one must ride the crane;\nTo bear the weight, rely upon the turtle’s back.\nA thousand fathoms—□ □ □—\nWhen shall another follow our path?\n\nThe toad, a pillar propping the heavens,\nFrom afar seems to tread the void in step.\nAwaiting the climb to the ridge’s end to view Mount Hua’s peak,\nAgain one sees its towering majesty piercing the sky.\n\n---\n\n**Two Poems by Zeng Hui, Erudite of the Court of Imperial Sacrifices and Archivist, Acting Prefect**\n\nOften I unfurled the painted scrolls;\nNow, glad to arrive at the Immortals’ Capital.\nI take in all the mist and rosy clouds,\nAnd only then know the artist’s skill.\n\nA single pillar upholds the heavens,\nFrom the earth it rises, ruling the Three Luminaries.\nMoss seals the carriage tracks,\nLotus fragrance drifts over the Cauldron Lake.\n\nThe wind arrives from the sea realms,\nThe sun is welcomed upon the cloud thoroughfare.\nLike bamboo shoots, a thousand fathoms straight,\nLike indigo, spreading on all sides.\n\nIts beauty channels creation’s work,\nIts height defies all grasping hands.\nThunder and rain birth the crag’s treasures,\nStars and constellations watch the distant alchemical furnace.\n\nJinhua shames the scolded stone,\nThe Jade Maidens gaze at the tossed arrows.\nThe ancient altar still stands,\nIts stele overgrown, half its characters lost.\n\nNever did I lose my way like Ruan Zhao,\nNor weary of drunkenness with Ma Gu.\nBeyond the dust, its name stands apart,\nIn the void, its shadow stands alone.\n\nIt mocks Qin’s inscriptions on Mount Tai,\nAnd disdains Shun’s burial in Cangwu.\nIn summer, the wind fills the air;\nIn autumn, the frost does not wither the grass.\n\nThe void-treading song drifts from feathered guests,\nDripping jade wets the woodcutter’s clothes.\nAlone it is hailed as the leader of Yingzhou—\nI chant as I behold the prefect’s seal.\n\nFor over a decade, Yingzhou’s wind and moon,\nBound, I left the cloud hall to govern this prefecture.\nNow, arriving at the deepest mist and rosy clouds,\nClearly, the scenery is the Immortals’ Capital.\n\n---\n\n**By Chen Ruozhuo, Prefect**\n\nFrom the earth it rises, upholding the heavens,\nIts roots coil over acres of mist.\nNature’s craft forges its abrupt majesty,\nIts tracks near, as if carved and chiseled.\n\nSteep and sheer, it leans on nothing,\nSolitary and lofty, none can match its height.\nFrom here the Yellow Emperor departed—\nWho knows how many thousand years have passed?\n\n---\n\n**By Liu Shen, Vice Director of the Bureau of Literary Composition and Fiscal Commissioner of the Two Zhe Circuits**\n\nAlone it rises above the peaks,\nA fathom round in its circumference.\nA thousand fathoms, it stoutly anchors the earth,\nTen thousand fathoms, it props up the heavens.",
      "overlap_context": "he dragon’s tracks and whiskers are there for the climbing.\n\n**By Wang Hanzhang, Prefect**\nFor three years I governed this land, revering its sacred traces,\nYet never found the chance to draw near.\nEver do I linger, gazing at its paintings,\nFor truly, the sun-drying toad dwells in the void.\nClouds gather at the lake’s summit, untouched by dust;\nCranes stand upon the pines, the path beyond reach.\nSpring passes by Creekside; few partake of its fare—\nThe ancient altar lies desolate, veiled in rain.",
      "start_char": 9837,
      "end_char": 10289,
      "start_sentence": 464,
      "end_sentence": 496,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.429197072982788,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\仙都志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "湖浪动星际，荷花生日边。 终当驾云鹤，绝顶会神仙。 胡志道 仙都古洞天，云阙高嗥嗥。 新官欣然成，碧瓦灿鳞列。 我时宿噤房，六月失烦热。 松声起中夜，梦枕忽惊辗。 天籁呜虚徐，玉箫递玲彻。 凤歌谐律吕，鹤舞想应节。 安知非群仙，宴罢摇佩决。 从来筝笛耳，一洗万想灭。 已上夜宿仙都闻松声问发音韵琅琅飘然若铿锵环佩，早起识之。 李侯神仙才，宇宙在其手。 古篆夸雄奇，铁柱贯金钮。 标榜黄帝祠，宇昼气浑厚。 想当落笔时，云梦吞八九。 每传风雨夜，蜿蜿龙蛇走。 光怪发岩宝，草木润不朽。 鬼物烦摄诃，一旦忽失守。 随烟遽飞腾，无复世问有。 因访山中人，石刻尚仍旧。 谁能一新之，易若运诸肘。 右黄帝祠宇李阳永篆 休说神仙事眇茫，出游尘世且和光。 谁知今日真栖地，便是他年羽化乡。 朝罢玉坛云满袖，梦回金阙月侵廊。 兹游似觉青冥上，隐隐微闻咏洞章。 右隐真堂 黄帝乘云至帝乡，空留辙迩锁穹苍。 茫茫丹鼎知何在，曳曳霓旌不可望。 乞得溪山增气象，真成草木被恩光。 我来娣目凭栏久，是可无情忆楚襄。 右望雪阁 百年日月马上过，赢得闲中可理生。 绛阙清都非渺漠，寸田尺宅得经营。 默存长使三官在，急守须防五岳倾。 他日功成定仙去，愿随风驭到蓬瀛。 右可理室 几年困尘机，厥状浸成俗。 比来梦魂清，胜赏得林麓。 郡峰绾姻鬓，炯炯皆在目。 寒碧冷相射，秀气还可掬。 哦诗三伏中，清风起幽谷。 只恐吹我衣，化为云锦服。 汗流籍提辈，上下相追逐。 右竞秀轩 仙家日月迟，春物长芳菲。 欲撷琼瑶英，咀嚼云腴肥。 只恐花雾深，香气湿我衣。 坐哦心未惬，归梦远岩扉。 右撷芳轩 上清之章口撷芳长引八骞林。 晓诵黄庭经，暮歌紫芝曲。 若欲童子颜，轩中勤练玉。 珊衣络霞青，云鬓颓翼绿。 功用信如许，庶可追妙躅。 右练玉轩 紫微夫人之歌日庆云缠丹炉练玉飞八琼。 门外无俗驾，眼中有余清。 上登晓烧阙，八窗皆虚明。 三光焕尔照，万象无隐情。 试观弄丹笔，云篆俱天成。 右焕照室 黄庭经日三光焕照入子室。 升巍蹑层巅，云陛近百尺。 平生尘土足，到此还几历。 有岩中杆然，斧凿若天划。 玉泉出石坛，雨点散寒碧。 我来供茗事，松鼎煮琼液。 余甘生齿颊，可以醒醉魄。 永怀鹤发翕，谓周景复尝居于此四顾但空壁。 似闻便仙去，山问护留乌。 右仙水洞 好山如故人，欣然见眉宇。 又如梳晓鬓，红绿相媚妩。 况兹爱山者，握笔喜临赋。 有岩巉然开，欲陆纵赛步。 清游亦不恶，胜境得饱妖。 扫石坐晚冻，浓翠湿冠屦。 好花续春迟，纷纷杂红雾。 仙家在何许，恐入桃源误。 竟为弥日留，直待山月吐。 馒寻流水归，不记来时路。 右忘归洞 山岚郁苍苍，溪水流浩浩。 纷然世上人，换易如秋草。 奇哉三洞天，连路极深窈。 阳崖射朝曦，先见扶桑晓。 谁能餐九华，颜色端使好。 仙够蝉蜕去，遗迩不可考。 我来惬登临，幽事费寻讨。 悲啸闻涧猿，啁晰听啼乌。 平生愤懑忆，到此始一扫。 行将袖手版，汗漫游八表。 右初旸谷又名倪访洞 兹山何巍巍，欲上扪萝鸢。 怪石虎踞蹲，老卉虹天桥。 中有古洞天，割然若天造。 爰从开辟来，日月自昏晓。 神龙此垫蟠，雷玉吐森森。 每逢岁旱乾，山老必见梼。",
      "translated_text": "Amid lake waves, stars stir at the horizon’s edge,\nLotus blooms emerge where the sun’s rays descend.\nOne day I shall ride a cloud-borne crane,\nTo meet immortals atop the loftiest peak.\n\n**By Hu Zhidao**\n\nThe Immortals’ Capital, an ancient grotto-heaven,\nIts cloud-gate towers rise in solemn grandeur.\nNewly appointed, I rejoice in its completion,\nWhere azure tiles gleam like scales in ordered rows.\n\nThat night, I lodged in the silent chamber,\nAnd in the sixth month, all heat dissolved.\nPine winds arose in the midnight hour,\nStartling my pillow—dreams turned restless.\n\nHeaven’s breath sighed through the void,\nJade flutes chimed in crystalline clarity.\nPhoenix songs harmonized with celestial tones,\nCranes danced, keeping perfect time.\n\nWho is to say these were not the immortals,\nFeasting, then parting with jade pendants’ chime?\nAll my life, I’ve known only zither and flute,\nBut here, a thousand thoughts dissolved in an instant.\n\n*(Written after spending the night in the Immortals’ Capital, where the sound of pines seemed to echo the ringing of jade ornaments—so clear and resonant it felt as though celestial pendants chimed. I rose early to witness it.)*\n\n**By Li Hou, a man of immortal talent,**\nWhose grasp holds the cosmos entire.\nHis ancient seal-script boasts bold majesty,\nIron strokes bound with golden clasps.\n\nHe inscribed the Yellow Emperor’s shrine,\nWhere the hall’s daylight brims with primal power.\nOne imagines him at the moment of inscription—\nCloud and marsh swallowed eight or ninefold.\n\nOn storm-wrought nights, tradition tells,\nDragons and serpents writhe in ink.\nStrange lights burst from the crag’s treasures,\nGrasses and trees steeped in undying luster.\n\nSpirits, vexed by his command,\nSuddenly lost their hold.\nThey fled with the mist in swift ascent,\nVanishing from the mortal world.\n\nInquiring among mountain folk,\nI found the stone inscriptions still intact.\nWho could renew them with ease,\nAs if moving them with a mere turn of the wrist?\n\n*(Inscription for the Hall of the Yellow Emperor, written in Li Yangyong’s seal-script)*\n\nSpeak not of immortals’ affairs as distant and vague—\nFor now, wander the dusty world and harmonize with its light.\nWho could know that this true retreat today\nWould become the very land of ascension in years to come?\n\nAfter morning rites at the jade altar, clouds fill my sleeves;\nIn dreams, I return to the golden palace where moonlight spills across the corridors.\nThis journey feels as though I tread the azure heavens,\nFaintly hearing the chanting of grotto hymns.\n\n*(Inscription for the Hall of Hidden Truth)*\n\nThe Yellow Emperor rode clouds to the imperial realm,\nLeaving only wheel-ruts locked in the vault of heaven.\nWhere now are the vast alchemical crucibles?\nThe trailing rainbow banners fade beyond sight.\n\nYet this land of streams and peaks gains grandeur,\nTruly, grasses and trees bask in its radiant grace.\nI stand long at the railing, gazing—\nHow could I not, with feeling, recall the Lord of Chu?\n\n*(Inscription for the Pavilion of Gazing at Snow)*\n\nA hundred years pass like a gallop on horseback,\nYet in leisure, one may still cultivate life’s essence.\nThe crimson gates of the Pure Capital are not so distant—\nA foot of field, an inch of dwelling, well-tended.\n\nSilently preserve the Three Officials’ presence,\nGuard vigilantly lest the Five Peaks topple.\nOne day, when merit is complete and ascension assured,\nI shall follow the wind’s chariot to Penglai’s isles.\n\n*(Inscription for the Chamber of Cultivation)*\n\nFor years, ensnared by worldly mechanisms,\nMy form and spirit grew ever more common.\nOf late, my dreams and soul have cleared—\nNow, I find surpassing delight in forests and foothills.\n\nThe prefecture’s peaks coil like a maiden’s braids,\nAll vivid before my eyes.\nCold jade’s chill darts forth,\nThe essence of beauty—one could cup it in hand.\n\nComposing poems in the triple-heat of summer,\nA cool wind rises from the secluded valley.\nI fear it may blow through my robes,\nTransforming them into cloud-woven brocade.\n\nWhile others sweat and toil in pursuit,\nI ascend and descend in carefree chase.\n\n*(Inscription for the Pavilion of Vying Beauty)*\n\nThe immortals’ days and months pass slowly,\nSpring’s blossoms ever fragrant.\nI long to pluck jasper and jade blooms,\nTo chew the rich marrow of clouds.\n\nYet I fear the depth of floral mist,\nIts fragrance soaking my robes.\nSeated, reciting verses, my heart still unfulfilled,\nMy dreams return to the distant mountain door.\n\n*(Inscription for the Pavilion of Plucking Fragrance)*\n\nThe hymn of the Lady of Purple Tenuity sings:\n*\"Auspicious clouds coil the cinnabar furnace, refining jade into eightfold radiance.\"*\n\nBeyond the gate, no worldly carriages,\nOnly clarity lingering in the eye.\nAt dawn, I ascend the rosy-gate tower,\nIts eight windows all aglow with emptiness.\n\nThe Three Lights shine resplendent,\nAll phenomena laid bare without concealment.\nBehold the alchemical brush at play—\nCloud-script, all heaven-wrought.\n\n*(Inscription for the Chamber of Radiant Illumination)*\n\nThe *Yellow Court Scripture* says:\n*\"The Three Lights’ brilliance enters your chamber.\"*\n\nAscending the towering heights, treading layered peaks,\nThe cloud-steps stretch near a hundred feet.\nA lifetime of dust-clad feet—\nHow many times have I reached such a place?\n\nHere stands a crag, untouched,\nAs though heaven itself had carved it.\nJade springs spill from the stone altar,\nRaindrops scattering into cold jade.\n\nI come to prepare tea,\nBoiling nectar in a pine-wood cauldron.\nThe lingering sweetness fills mouth and cheek,\nEnough to rouse the drunken soul.\n\nEver do I cherish the crane-haired elder,\nWho, like Zhou Jing, once dwelled here—\nNow, gazing all around, only empty walls remain.\nIt seems he departed in an immortal’s flight,\nLeaving only mountain crows to guard the place.\n\n*(Inscription for the Immortal Water Grotto)*\n\nFine mountains are like old friends,\nJoyfully meeting their brows and features.\nLike combing morning tresses,\nRed and green hues vie in charm.\n\nHow much more for one who loves mountains—\nGrasping the brush, delighted to compose.\nA crag yawns open,\nInviting unhurried steps.\n\nThis pure excursion is not without merit,\nIn such a sublime realm, one feasts on beauty.\nSweeping the stone, I sit as evening chills,\nThick verdure dampening cap and sandals.\n\nFine blossoms prolong spring’s delay,\nScattering crimson mists in profusion.\nWhere do the immortals dwell?\nI fear I’ve strayed into Peach Blossom Spring.\n\nI lingered the whole day,\nWaiting only for the mountain moon to rise.\nFollowing the flowing stream home,\nI no longer recall the path I came by.\n\n*(Inscription for the Grotto of Forgotten Return)*\n\nMountain mists rise in lush verdure,\nStream waters flow in boundless expanse.\nThe world’s people, ever-changing,\nShift like autumn grasses.\n\nWondrous, the Three Grotto-Heavens,\nTheir linked paths deep and secluded.\nThe sunlit crag catches the dawn’s first rays,\nRevealing the break of Fusang’s day.\n\nWho can feast on ninefold blossoms,\nTo keep their complexion ever fair?\nThe immortals shed their earthly husks and depart,\nLeaving no trace to trace.\n\nI come, content in my ascent,\nSeeking hidden wonders with care.\nA sorrowful whistle—hearing the valley apes,\nA chirruping chorus—listening to the calling crows.\n\nAll my life’s pent-up frustrations,\nHere, at last, are swept away.\nSoon, I shall cast aside my official tablet,\nTo wander boundlessly beyond the eight wilds.\n\n*(Inscription for the Valley of First Light, also called the Grotto of Ni Fang)*\n\nHow towering is this mountain!\nI long to climb, grasping vines and creepers.\nStrange rocks crouch like tigers,\nAncient plants arch like rainbows.\n\nWithin lies an ancient grotto-heaven,\nCleaved as though by heaven’s hand.\nSince the dawn of creation,\nSun and moon have marked its dusk and dawn.\n\nHere, the divine dragon coils in repose,\nThunder-jades gleam in dense array.\nWhenever drought parches the land,\nThe mountain elders must offer prayers.\n\n*(Inscription for the Grotto of the Divine Dragon)*",
      "overlap_context": "racks near, as if carved and chiseled.\n\nSteep and sheer, it leans on nothing,\nSolitary and lofty, none can match its height.\nFrom here the Yellow Emperor departed—\nWho knows how many thousand years have passed?\n\n---\n\n**By Liu Shen, Vice Director of the Bureau of Literary Composition and Fiscal Commissioner of the Two Zhe Circuits**\n\nAlone it rises above the peaks,\nA fathom round in its circumference.\nA thousand fathoms, it stoutly anchors the earth,\nTen thousand fathoms, it props up the heavens.",
      "start_char": 10290,
      "end_char": 11670,
      "start_sentence": 497,
      "end_sentence": 597,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.762893199920654,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\仙都志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "顾盼层云生，橄舞百川倒。 何时谢鱼虾，昂雷腾浩渺。 右龙泓洞今名赞龙洞　　郡守刘参 古帝此登仙，霓旌不复还。 孤票苍岭外，屹立紫烟问。 上下形端柱，周回影转环。 根疑连海娇，顶欲突天关。 莲出湖心迥，苔漫辙边斑。 傍存炼丹釜，低瞰步虚山。 猿狄何能到，鸾凤自可攀。 昼矜名手眇，吟怯巨题艰。 鸦荡非灵异，兰岩鄙宴闲。 缙云游览处，胜盘申人寰。 邑簿校书郎毛维瞻 峭拔神仙宅，来寻烟水重。 深应盘九地，高不让群峰。 瞻对奇胜昼，扪绿直岂容。 几时莲叶下，终古藓纹封。 往事云难问，无言路有踪。 桥山杳何处，侍从此攀龙。 转运使苏舜元求翁 龙车凤辇入瑶笑，辙边高悬不可攀。 唯有风吹鼎湖永，青莲花叶落人问。 两浙察访使吴兴沈括存中 苔封辇路上青山，鹤驭辽天去不还。 惟有银河秋月夜，鼎湖烟浪到人问。 邑人国子洞业胡份子文 乌道盘空上，松根抱石生。 羽人分两舍，鸡犬自闻声。 两浙提刑濡须杨杰次公三首 有路入仙都，何人到鼎湖。 秋风夜来急，吹落碧莲无。 问路从黄碧，穿云入紫清。 林间松化石，门外玉为城。 道士非爱山，出家今已老。 虽知车辙迹，不识龙髯草。 郡守刘泾巨济 石城云屋抱浮丘，正是真人旧括州。 会掷仙图争少胜，不知身到洞天游。 津阳王侄题黄帝祠身　　　大观 我渡溪水寻荒村，群峰势若万马奔。 酣酣春色雷初霁，霭霭野气山犹昏。 琼楼金阙涤地尽，松相半带斤斧痕。 要还清争扫尘浊，一炬劫火安得焚。 行人鞠翠口马拜，仙都妙理吾能言。 威神可畏凛如在，自台今亦祠轩辕。 当年垂衣正南面，制作取盘乾与坤。 凿开鸿蒙肇人纪，首为区宇立本根。 风后方牧来联翩，神机开辟施无根。 初传问道广成子，后乃密契中皇君。 功高德大不可拟，几与造物分遗恩。 遥遥唐尧逮炎运，万年圣子兼神孙。 至人御世用常道，飞升轻举安足论。 爰从一气生万物，奈何已把天人分。 伏羲八封昼已破，女娲欲补理亦繁。 飘然独返清都去，却敛造化归全浑。 庙前仙石表今古，屹立霄壤争雄尊。 鼎湖可望不可见，意令后世难攀援。 顶中玄宫号泥丸，自然有路朝天合。 此身内外神气合，俯仰自超生死门。 默运四时无诡异，试观日月谁吐吞。 柢今湖边送风雨，草木吹动旗与婶。 飘落十丈红菌旧，碧溪下插玻璃盆。 马蹄车辙不须有，虽迷襄野道自存。 岩泉夜发百谷响，洞庭乐声犹可闻。 山川古色藏妙意，谁与开涤明根源。 我谈希夷返淳朴，不假辩说波涛翻。 郡人湖北提举胡升子上 鼎湖不可见，巍然但孤峰。 特立亘万古，气压诸山雄。 黄帝久得仙，游行跨飞龙。 至今世俗传，尚指辇路通。 颇如升天桧，追求白鹿踪。 常言贵荒唐，厥见真儿童。 顾惟此山奇，实宜仙所宫。 水声来玲风。 和以万本松。",
      "translated_text": "Amidst sweeping glances, layered clouds arise,\nOlive branches dance, the hundred rivers flow reversed.\n\nWhen shall I bid farewell to fish and shrimp,\nTo rise with thunder, soaring into the boundless vast?\n\n*(Inscription for Dragon’s Abyss Grotto, now called Zanlong Grotto)*\n\n**Prefect Liu Can**\n\nHere the ancient emperor ascended as immortal,\nHis rainbow banner never to return.\nBeyond the lone peak, beyond the azure ridges,\nIt stands erect amid the purple haze.\n\nAbove and below, its form is a pillar of the earth,\nAll around, its shadow turns like a ring.\nIts roots seem to entwine with the sea’s embrace,\nIts summit strains to breach heaven’s gate.\n\nA lotus emerges from the lake’s distant heart,\nMoss mottles the wheel-ruts’ edge.\nBeside it lies the alchemist’s cauldron,\nBelow, one gazes upon the ethereal mountain.\n\nHow could apes or monkeys ever reach this place?\nYet phoenixes and simurghs may freely ascend.\nBy day, it boasts a name of subtle renown,\nBut reciting its grandeur daunts even the bold.\n\nCrow’s Gorge lacks true numinosity,\nOrchid Rock scorns idle leisure.\nHere in Jinyun, where wanderers roam,\nIts wonders surpass all within the mortal realm.\n\n**County Registrar, Collator of Books Mao Weizhan**\n\nSteep and towering, the abode of immortals,\nI come seeking its mist-laden depths.\nBelow, it coils through the ninefold earth,\nAbove, it yields not to the thronging peaks.\n\nGazing upon its marvels by day,\nEven grasping the green cliffs seems impossible.\nWhen might one descend beneath the lotus leaves,\nSealed for all time by moss-woven patterns?\n\nThe past is as elusive as drifting clouds,\nYet the path remains, silent but marked.\nWhere now the distant Mount Qiao?\nI shall follow and ascend with the dragon.\n\n**Transport Commissioner Su Shunyuan Qiuweng**\n\nDragon chariots and phoenix carriages enter jade laughter,\nBy the wheel-ruts, high-hung wonders none may climb.\nOnly the wind stirs the eternal waters of Ding Lake,\nAs blue lotus petals fall among men.\n\n**Zhexi Inspector of Wuxing Shen Gua Cunzhong**\n\nMoss seals the imperial path upon the green mountain,\nThe crane-drawn chariot soared to distant skies, never to return.\nOnly on autumn moonlit nights by the Silver River,\nDo the mists and waves of Ding Lake reach mortal ears.\n\n**County Native, National University Student Hu Fen Ziwen**\n\nA bird’s path coils through the empty sky,\nPine roots embrace the living stone.\nFeathered beings divide their dwellings,\nWhile the cries of chickens and dogs are heard.\n\n**Zhexi Judicial Commissioner, Ruxu Yang Jie Cigong (Three Poems)**\n\nA path leads into the immortal capital,\nYet who has reached Ding Lake?\nThe autumn wind blows fiercely at night—\nHas it blown away the azure lotus?\n\nAsk the way through yellow and jade,\nPierce the clouds to enter the purple clarity.\nWithin the woods, pines turn to stone,\nBeyond the gate, jade forms the city walls.\n\nThe Daoist does not love the mountain,\nYet having left the world, he has grown old.\nThough he knows the traces of chariot tracks,\nHe does not recognize the dragon’s-beard grass.\n\n**Prefect Liu Jing Juji**\n\nStone walls and cloud-pavilions embrace Floating Hill,\nHere once dwelled the Perfected One of ancient Kuazhou.\nIf one could cast the immortal’s map to vie in wonders,\nWho would know the joy of wandering a grotto-heaven?\n\n**Qin Prince’s Nephew, Inscription at the Yellow Emperor’s Shrine**\n\n**Daguan Era**\n\nI cross the stream to seek a desolate village,\nWhere peaks surge like ten thousand galloping horses.\nThe spring’s lush hues follow the thunder’s clearing,\nMisty vapors veil the mountains, still dim with dusk.\n\nJade towers and golden palaces once filled the earth,\nNow half the pines bear the scars of axes.\nTo cleanse the world of dust and filth,\nWould that a single torch of kalpa-fire could burn it all!\n\nTravelers bow in reverence, their horses kneeling,\nI can speak of the wondrous truths of Xiandu.\nThe awe of his divine might lingers, stern as if he were present,\nEven now, from his terrace, the shrine honors Xuanyuan.\n\nIn those days, he robed himself and faced the south,\nHis creations drawn from Qian and Kun.\nHe cleaved the primal chaos to begin the human age,\nFirst establishing the roots of the world’s divisions.\n\nFeng Hou and the shepherds came in succession,\nUnfurling divine strategies to shape the formless.\nFirst, he sought the Way from Guangchengzi,\nLater, he secretly aligned with Zhonghuang Jun.\n\nHis merits and virtue vast, beyond compare,\nNearly rivaling the Creator in bestowed grace.\nFrom distant Tang Yao to the fiery destiny of the Yan,\nFor ten thousand years, sage-sons and divine grandsons endured.\n\nThe Perfected One ruled the world with the eternal Dao,\nHis ascension so effortless it scarcely merits discussion.\nYet from the One Qi arose the ten thousand things—\nWhy then divide heaven and humanity?\n\nFu Xi’s eight trigrams were already broken,\nNü Wa sought to mend them, but the task was too great.\nHe drifted back alone to the Pure Capital,\nGathering creation’s essence into perfect wholeness.\n\nBefore the shrine, the immortal stone stands through the ages,\nTowering between heaven and earth, vying in majesty.\nDing Lake may be glimpsed but never reached,\nIts intent to leave later ages with no path to climb.\n\nWithin the summit’s mystic palace, called the Mud Pill,\nA natural road leads to the union of heaven.\nWhen this body’s inner and outer qi converge,\nOne transcends life and death in a single bow.\n\nSilently, the four seasons turn without anomaly—\nObserve the sun and moon: who swallows, who spits?\nEven now, by the lake’s edge, wind and rain are sent forth,\nGrasses and trees sway like banners and pennants.\n\nTen-foot red fungi drift down,\nA jade-green stream plunges into a glass basin.\nNo need for horse hooves or chariot tracks—\nThough lost in Xiang’s wilds, the Way remains.\n\nAt night, the mountain springs roar through a hundred valleys,\nThe music of Dongting Lake can still be heard.\nThe ancient hues of mountains and rivers hold profound meaning—\nWho will clear the source and illuminate the root?\n\nI speak of the subtle and the simple, returning to purity,\nNo need for disputation or surging waves.\nLet it be.\n\n**County Native, Hubei Transport Commissioner Hu Sheng Zishang**\n\nDing Lake cannot be seen,\nOnly a lone peak stands, towering.\nIt endures through all ages,\nIts qi overawing the surrounding mountains.\n\nThe Yellow Emperor long attained immortality,\nRiding a flying dragon on his journeys.\nTo this day, common tales persist,\nPointing to the path where his chariot passed.\n\nMuch like the cypress of his ascension,\nOr the pursuit of the white deer’s trail.\nSuch talk is often dismissed as absurd,\nYet the sight of it would truly be childlike.\n\nBut consider this mountain’s marvels—\nTruly, it is a fitting palace for immortals.\nThe sound of water comes like tinkling wind,\nHarmonizing with ten thousand pines.",
      "overlap_context": "\n\nHow towering is this mountain!\nI long to climb, grasping vines and creepers.\nStrange rocks crouch like tigers,\nAncient plants arch like rainbows.\n\nWithin lies an ancient grotto-heaven,\nCleaved as though by heaven’s hand.\nSince the dawn of creation,\nSun and moon have marked its dusk and dawn.\n\nHere, the divine dragon coils in repose,\nThunder-jades gleam in dense array.\nWhenever drought parches the land,\nThe mountain elders must offer prayers.\n\n*(Inscription for the Grotto of the Divine Dragon)*",
      "start_char": 11671,
      "end_char": 12811,
      "start_sentence": 598,
      "end_sentence": 674,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.799957513809204,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\仙都志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "客枕久未稳，笙箫满虚空。 颇疑九成音，不在二典中。 但恐蚩尤旗，晔哗舒长虹。 虽能独不死，忍视斯民穷。 君看涿鹿战，万古蒙其功。 鼎湖何足道； 帝德弥苍穹。 通判延陵丁宗旦绍兴 世上洞天三十六，缙云第二十九区。 古木参天驾云屋，总真灵迩号仙都。 独峰壁立二千尺，凌空耸翠屹然孤。 仰瞻绝顶烟岚际，曾开苗莒名鼎湖。 旧说轩辕驻车辙，云骈风驭经此涂。 石釜炼鳌丹砂就，乘龙帝乡才须臾。 紫虚碧落超尘世，侍臣无路攀龙须。 唐朝天子仙李裔，德格天心来瑞符。 祥烟嘉气卿云布，山中九传万岁呼。 步虚对峙云断续，东西互云高下殊。 涧边幽径登乌道，上有镜岩如方壶。 岩中乳水沥嵌怜，滴石成穴如仰盂。 水一昼夜斛加半，潦不泛溢早不枯。 鲁望曾记周景复，绝粒餐霞黄老徒。 栖真妙入悬珠会，八十余年隐此居。 千古寥寥桑海变，仙迹渺邈还有无。 石门瀑布虽云好，此间殊胜未易俱。 特然造化钟神秀，虎头妙手亦难图。 事迹出於图经吉诗。 郎中钱塘吴说传明 佳住从来说鼎湖，兹游直欲到清都。 参天玉笋千寻许，堕地金莲十丈无。 江观便思眠一柱，海山今喜识方壶。 直须买取鹅城绢，要画沧洲水墨图。 上饶韩元吉甫涧先生　三首同 槛外风高霜月明，步虚山裹步虚声。 罢琴刻烛初长夜，又得人问一梦清。 封禅空余不死名，华清宫裹望长生。 闲云布作人问瑞，更有山呼万岁声。 龙虎驱驰战阪泉，荆山鼎就更升天。 轩辕到处存遗迹，忍使君王不学仙。 运使李士举 道出仙都下，溪深草木闲。 阴晴老农事，丰稔此心关。 谁削千寻石，云藏万迭山。 王程元有限，那得更跻攀。 四海无尘战马闲，稻粱桑拓绿回环。 不知尽是君王力，华屋重重对好山。 已上过仙都徐氏山居，见旧括苍续集今郡忠云文公作韵也。 郡守阳夏谢伋景惠和 荡节光华远，朝车那得闲。 咨询元自急，省敛赤相关。 去住存高咏，晴阴对好山。 深暂糜郡绂，仙境不同攀。 耄倪扶杖小童闲，远舍清溪碧水环。 争看亦帷仍避传，静无柠鼓爱青山。 浙东提举朱熹晦庵先生追和徐氏山居韵 出岫孤云意自闲，不妨王事似连环。 解鞍盘砖忘归去，碧涧修筠似故山。 郡人吴谨微游仙都五首 薄宦驱人畏简书，金柔暑浊倦征途。 归来有意寻真境，路入仙都不惮迂。 辙迹峰前聊息迹，忘归洞口未能归。 往来名利憧憧者，着脚仙都亦自稀。 黄冠道士老而瘦，相对谈玄一事无。 劝我莫教沉宦海，人问亦自有仙都。 石笋古传八百丈，鼎湖仙去几千年。 我疑二事无从政，但信仙都是洞天。 山下霏微雨洒尘，门前嘹唳鹤迎人。 遂成一觉仙都梦，更访遗踪得隐真。 郡守许尹觉民和　　绍兴 仙都踪迹想遗书，我欲归时更问途。 忽得新诗如见画，山蹊野径不须迂。 山中鹤怨无寻处，洞口云归未得归。 忆着仙都旧时路，石梁苔涩履痕稀。 玉貌仙人老不瘦，世问荣辱此中无。 烟云昨夜微销铄，似怪题舆车骑都。 黄帝得仙从此去，鼎湖传说几经年。 龙髯堕地成春草，直到如今不上天。 桃源归路争无尘，只是当时避世人。 仙事茫茫类如此，鼎湖辙迹恐非真。 郡守吴芾追和 来访仙都古玉虚，山前有客指迷途。 烟霞渺渺孤峰绝，松竹森森一径迂。 策杖行行入翠微，步虚山下久忘归。",
      "translated_text": "The traveler’s pillow long unsettled,\nFlutes and reeds fill the empty void.\nI suspect these are the Nine Harmonies,\nYet not found in the Two Classics.\nI fear only the banners of Chiyou,\nFlashing and clamorous, unfurling like long rainbows.\nThough he alone could not die,\nHow could he bear to see the people suffer?\nBehold the Battle of Zhuolu—\nFor ten thousand ages, they have reaped its fruits.\nWhat is Ding Lake to speak of?\nThe Emperor’s virtue spans the vault of heaven.\n\n**Vice Magistrate of Yanling, Ding Zongdan of Shaoxing**\n\nIn the world, thirty-six grotto-heavens,\nJinyun is the twenty-ninth realm.\nAncient trees pierce the sky, bearing cloud-palaces,\nThe true and numinous near—called the Immortals’ Capital.\nA lone peak stands sheer, two thousand feet,\nJade-green, towering in solitude against the sky.\nGazing up to its mist-wreathed summit,\nOnce named Ding Lake for the Miao tribes.\nOld tales say the Yellow Emperor halted his chariot here,\nClouds paired, winds harnessed, passing this way.\nIn a stone cauldron, he refined cinnabar into elixir,\nThen rode a dragon to the Emperor’s realm in but a moment.\nBeyond the purple void and azure firmament,\nHis ministers had no path to grasp the dragon’s whiskers.\nThe Tang dynasty’s Son of Heaven, of Li’s line,\nHis virtue matched Heaven’s will, bringing auspicious signs.\nAuspicious mists and propitious vapors spread like ministering clouds,\nNine transmissions in the mountains, ten thousand years’ acclamation.\nStep into the void, peaks face each other, clouds break and continue,\nEast and west, their heights and depths diverge.\nBy the stream’s secluded path, ascend the raven’s trail,\nAbove lies Mirror Cliff, like a square pot.\nWithin the rock, dripping stalactites weep,\nForming hollows like upturned basins.\nEach day and night, a *hu* and a half of water,\nNeither flooding in rains nor drying in drought.\nLu Wang once recorded Zhou Jingfu,\nWho fasted, consumed auroras, a follower of the Yellow and Lao.\nDwelling in truth, wondrously entering the assembly of suspended pearls,\nHe hid here for over eighty years.\nThrough the ages, seas and mulberries have changed,\nThe immortals’ traces—are they still, or gone?\nThough Stone Gate’s waterfall is said to be fine,\nThis place’s wonders are not easily matched.\nNature has so concentrated its divine beauty,\nEven a master painter’s hand could scarcely capture it.\nThese accounts emerge from illustrated classics and auspicious poems.\n\n**Transmitted by Langzhong of Qiantang, Wu Shuo**\n\nIt has long been said that Ding Lake is a fine abode,\nThis journey makes me wish to reach the Pure Capital.\nJade bamboo shoots rise a thousand *xun*,\nGolden lotuses, ten *zhang* tall, have fallen to earth.\nBy the river, I long to sleep beneath a single pillar,\nToday, by the sea and mountains, I rejoice to know Penglai.\nI must purchase goose-city silk,\nTo paint a water-and-ink scroll of Penglai’s shores.\n\n**Han Yuanji of Shangrao, Three Poems for Master Fu of the Stream**\n\nBeyond the balustrade, wind high, frost moon bright,\nIn Step-in-Void Mountain, the sound of stepping into the void.\nThe qin silenced, candles carved through the long night,\nAgain, one asks of man—this dream is clear.\n\nThe Feng and Shan sacrifices left only an undying name,\nIn Huaqing Palace, they longed for longevity.\nIdle clouds spread as man’s auspices,\nAgain, the mountains resound with ten thousand years’ acclamation.\n\nDragons and tigers drove the battle at Banquan,\nThe tripod cast at Mount Jing, then ascension to heaven.\nWherever the Yellow Emperor passed, traces remain—\nHow could a lord not learn to seek immortality?\n\n**Transport Commissioner Li Shiju**\n\nPassing beneath the Immortals’ Capital,\nThe stream deep, grasses and trees at leisure.\nFarmers’ affairs shift with sun and shade,\nThis heart is bound to their harvest’s plenty.\nWho carved this thousand-*xun* stone?\nClouds veil the ten thousand-fold mountains.\nThe royal journey has its limits—\nHow could one ascend further?\n\nAcross the four seas, no dust, warhorses idle,\nRice, millet, mulberries—green circles all.\nWho knows it is all the lord’s power?\nLayered mansions face the fine mountains.\n\n**The above were composed at the Xu family’s mountain retreat in Xiandu, seen in the old *Kuozhang Continued Collection*; now Prefect Zhongwen of Yun has composed in this rhyme.**\n\n**Prefect of the Prefecture, Xie Ji of Yangxia, in harmonious response**\n\nThe carriage of office gleams afar,\nThe court’s chariot has no leisure.\nInquiries and inspections press urgently,\nReducing taxes is of utmost concern.\nDeparture and stay find voice in lofty song,\nSun and shade face the fine mountains.\nThough briefly lodged in the prefect’s sash,\nThe immortal realm is not for climbing.\n\nThe aged lean on staffs, young boys idle,\nDistant huts by clear streams, green waters encircle.\nVying to see the curtained carriage, yet shunning the relay,\nIn stillness, no clappers or drums—only love for the green mountains.\n\n**Zhejiang Eastern Transport Commissioner, Master Zhu Xi of Hui’an, in pursuit of the Xu family mountain retreat’s rhyme**\n\nA lone cloud from the cave-mouth, its intent at ease,\nNo hindrance to official duties, like linked rings.\nUnsaddling, lingering on the stone steps, forgetting to return,\nThe azure stream and tall bamboos seem like home.\n\n**Native of the Prefecture, Wu Jinwei, Five Poems on Wandering Xiandu**\n\nA minor post drives me, dreading official dispatches,\nGold softens, summer’s heat fouls the journey.\nReturning, I resolve to seek the true realm,\nThe path to Xiandu—no fear of its winding ways.\n\nBefore the chariot-trace peak, I briefly rest,\nAt the cave’s mouth, forgetting to return.\nThose who chase fame and profit, restless,\nRarely set foot in Xiandu.\n\nA yellow-capped Daoist, old and gaunt,\nFacing me, discoursing on the mysterious—nothing to say.\nHe urges me not to sink in the sea of office,\nFor in this world, there is also Xiandu.\n\nThe stone bamboo is said to be eight hundred *zhang*,\nDing Lake’s immortal gone for thousands of years.\nI doubt these two matters have any governance,\nBut believe Xiandu is a grotto-heaven.\n\nMountain rains lightly dust the earth,\nBefore the gate, cranes cry shrilly to greet me.\nThus, I dream a Xiandu dream,\nThen seek traces to find the hidden truth.\n\n**Prefect Xu Yin of Jue Min, in harmonious response, Shaoxing**\n\nXiandu’s traces linger in old books,\nWhen I wish to return, I’ll ask the way again.\nSuddenly, new poems come like paintings,\nMountain paths and wild trails need no winding.\n\nMountain cranes complain of no place to seek,\nAt the cave’s mouth, clouds return, yet I cannot.\nRecalling Xiandu’s old paths,\nStone bridges, moss-slick, footprints few.\n\nThe jade-faced immortal, never aging, never gaunt,\nIn this place, worldly honor and disgrace are absent.\nLast night’s mist and clouds slightly dispersed,\nAs if resenting the imperial carriage’s retinue.\n\nThe Yellow Emperor attained immortality and left from here,\nDing Lake’s tales have passed through many years.\nDragon’s whiskers fell to earth, becoming spring grass,\nEven now, they do not ascend to heaven.\n\nThe path back to Peach Blossom Spring is said to be dustless,\nOnly to avoid the world’s people.\nImmortals’ affairs are vast and vague like this—\nDing Lake’s chariot traces may not be true.\n\n**Prefect Wu Fu, in pursuit of the rhyme**\n\nComing to visit Xiandu’s ancient Jade Void,\nBefore the mountain, a traveler points the lost way.\nMist and rosy clouds stretch far, a lone peak soars,\nPines and bamboos dense, a single path winds.\n\nLeaning on a staff, step by step into the emerald haze,\nBeneath Step-in-Void Mountain, long forgetting to return.",
      "overlap_context": "e Yellow Emperor long attained immortality,\nRiding a flying dragon on his journeys.\nTo this day, common tales persist,\nPointing to the path where his chariot passed.\n\nMuch like the cypress of his ascension,\nOr the pursuit of the white deer’s trail.\nSuch talk is often dismissed as absurd,\nYet the sight of it would truly be childlike.\n\nBut consider this mountain’s marvels—\nTruly, it is a fitting palace for immortals.\nThe sound of water comes like tinkling wind,\nHarmonizing with ten thousand pines.",
      "start_char": 12812,
      "end_char": 14155,
      "start_sentence": 675,
      "end_sentence": 757,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.37959384918213,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\仙都志.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "幽栖宜有林中士，何事斯人近世稀。 闻道山巅有鼎湖，莲花还似旧时无。 轩辕去后空车辙，疑此山川即旧都。 人已乘龙去不还，尚余双鹤不知年。 坐来顿觉尘寰隔，始信壶中别有天。 登览兹山古到今，流传今有几何人。 如君圣践悬知少，死有新诗为写真。 仙都志卷下竟",
      "translated_text": "Amidst secluded dwelling, there should be recluses of the forest,\nYet why are such men rare in recent times?\nI hear that atop the mountain lies Ding Lake—\nDo the lotus flowers still resemble those of old?\n\nAfter Xuanyuan’s departure, only chariot tracks remain,\nI suspect these mountains and rivers are the very same as the ancient capital.\nThe man has ridden the dragon and gone, never to return,\nOnly a pair of cranes linger, their years unknown.\n\nSitting here, I suddenly feel the mortal world far removed,\nAt last I believe that within the gourd lies another heaven.\nFrom ancient times to now, those who have climbed this mountain—\nHow many are left to pass down its tales?\nFew, I know, have trodden such sacred ground as you,\nYet in death, your new poems serve as a true likeness.\n\n*Record of the Immortals’ Capital, Scroll the Lower, concludes*",
      "overlap_context": "d to be dustless,\nOnly to avoid the world’s people.\nImmortals’ affairs are vast and vague like this—\nDing Lake’s chariot traces may not be true.\n\n**Prefect Wu Fu, in pursuit of the rhyme**\n\nComing to visit Xiandu’s ancient Jade Void,\nBefore the mountain, a traveler points the lost way.\nMist and rosy clouds stretch far, a lone peak soars,\nPines and bamboos dense, a single path winds.\n\nLeaning on a staff, step by step into the emerald haze,\nBeneath Step-in-Void Mountain, long forgetting to return.",
      "start_char": 14155,
      "end_char": 14286,
      "start_sentence": 758,
      "end_sentence": 765,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.490339279174805,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\仙都志.txt",
        "category": "记传类"
      }
    }
  ]
}