{
  "source_id": "侍帝晨东华上佐司命杨君传记",
  "source_file": "chunked_daozang\\侍帝晨东华上佐司命杨君传记.json",
  "total_chunks": 8,
  "total_original_chars": 5668,
  "total_translated_chars": 35007,
  "total_translation_time": 186.8587362766266,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\侍帝晨东华上佐司命杨君传记.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**Record of Attendant Yang to the Morning Emperor, Eastern Florescence’s Supreme Assistant Controller of Destiny**\n\n**Scripture Title:** *Record of Attendant Yang to the Morning Emperor, Eastern Florescence’s Supreme Assistant Controller of Destiny*\n**Volume:** One\n**Source Text:** *Zhengtong Daoist Canon*, Orthodox Section, Part One\n\n---\n\nThe *Record of Attendant Yang to the Morning Emperor, Eastern Florescence’s Supreme Assistant Controller of Destiny*:\nThe Perfected Consort of the Nine Florescence Palace of the Purple Clarity Upper Palace, bestower of scriptures, bore the surname Yang, with the personal name Xihe, and was a disciple of the Lady of Southern Marchmount. He was also the master of Xu Xianhou and the transmitter of the *Scriptures of the Morning Emperor’s Salvation*.\n\nBorn in the ninth month of the gengyin year of the fifth reign of Emperor Cheng of Jin (330 CE), he served as a secretary in the residence of Emperor Jianwen. The host of Perfected Ones began descending frequently in the early Xingning era (363 CE). By the third year, the yichou year (365 CE), the Consort An descended to the mortal realm. Thereafter, they descended repeatedly, though their affairs remained obscure, as if destined to lay aside their swords and conceal their transformations.\n\nIn the thirteenth year of the Taiyuan era, the wuzi year (388 CE), he ascended upon clouds and rode dragons to the west, where he paid homage to the Grand Primordium, and to the north, where he attended the Jade Clarity. There, he was entrusted with the affairs of the celestial chariot, assisted the Four Auxiliaries, attended the Morning Emperor in person, and oversaw the offices of spirits and gods across the vastness of Wu and Yue. Yet his records have not been widely revealed to the world.\n\n---\n\nThe Perfected Consort of the Nine Florescence Palace:\nOn the night of the twenty-fifth day of the sixth month in the third year of the Xingning era, the yichou year (365 CE), the Lady Wang of the Purple Tenuity descended, accompanied by a divine maiden. The maiden wore a cloud-brocade robe, crimson above and azure below, its patterns radiant and resplendent. At her waist hung a green embroidered sash, from which dangled over ten small bells, some azure, some yellow, interspersed in alternation. From her left side hung a jade pendant, much like those worn in the mortal world, though slightly smaller. Her garments shimmered with a luminous sheen, illuminating the chamber as if sunlight were refracted through mica.\n\nHer cloud-like tresses were meticulously arranged into a topknot, with the remaining hair cascading down to her waist. Her fingers bore gold and silver rings, and white pearls adorned her arms. She appeared to be around thirteen or fourteen years of age. Flanking her were two attendants: one dressed in vermilion, bearing a green patterned satchel and holding a brocade pouch. The pouch measured about one or two *chi* in length and contained some ten scrolls. Its mouth was sealed with a white jade clasp, upon which was inscribed: *\"Purple Prime Elixir Chapters of the Divine Tiger of Jade Clarity.\"*\n\nThe other attendant wore azure robes and carried a white box, bound with crimson cords, resembling ivory in shape. Both attendants appeared to be around seventeen or eighteen, exquisitely adorned. The divine maiden and her attendants possessed radiant complexions, lustrous as jade, and their presence suffused the air with the fragrance of five incenses, like the scent of burning aloeswood.\n\nWhen they first entered the chamber, they followed behind the Lady of Purple Tenuity. As the Lady crossed the threshold, she announced: \"Today, a noble guest has come to visit and discuss matters of affinity.\" Thereupon, Xihe rose to his feet. The Lady said: \"There is no need to stand on ceremony today; you may simply sit and exchange courtesies.\" The Lady sat facing south, while Xihe sat that evening upon the lower couch, facing west. The divine maiden then approached and sat beside him, facing east, each performing the ritual gesture with their left hand.\n\nAfter the courtesies were exchanged, the Lady of Purple Tenuity said: \"This is the youngest child of the Golden Terrace Lady, the Primordial Perfected Sovereign of the Grand Void.\" The Primordial Sovereign of the Grand Void had once dispatched her to Mount Gui to study the Dao of the Upper Clarity. Upon mastering the Dao, she received the scriptures of the Most High and was appointed the Perfected Consort of the Nine Florescence Palace of the Purple Clarity Upper Palace. Thus, she was granted the surname An, the personal name Yupin, and the style Lingxiao.\n\nThe Lady of Purple Tenuity then asked Xihe: \"Have you ever seen such a person in the mortal world?\" Xihe replied: \"Her numinous majesty and lofty refinement defy comparison.\" The Lady laughed heartily, asking: \"And what of you, Xihe?\" He did not respond further.\n\nThe Perfected Consort of Purple Clarity sat in silence for a long while. In her hand, she held three dates, their color like dried dates but larger in shape, without pits and lacking the taste of dates, resembling pears instead. She first offered one to Xihe, then gave another to the Lady of Purple Tenuity, keeping the last for herself, instructing them to eat. After they had consumed them, a long while passed before the Perfected Consort asked Xihe: \"How old are you, and in which month were you born?\" Xihe promptly replied: \"I am thirty-six years old, born in the ninth month of the gengyin year.\"\n\nThe Perfected Consort then said: \"Your master, the Lady of Southern Perfection, wields authority as Controller of Destiny, her Dao lofty and wondrous, embodying the ancestral virtue of the august and good. I have long heard of your virtuous reputation and never imagined that today I would have the karmic affinity to meet you. Our joy in this meeting of unseen destinies is like the entwining of pines and creepers.\" Xihe, addressing her by name, replied: \"Mired in the dust of the lower world, my nature is base and my spirit distant. Without the karmic connection to receive your reverence, I have rashly incurred your numinous descent. My joy is boundless, and I can only hope for your instruction to dispel my ignorance. This has been my lifelong aspiration.\"\n\nThe Perfected Consort said: \"Your words should not be so modest. Such self-deprecation is hardly fitting.\" After another long silence, she declared: \"I wish to compose a written message to bestow upon you. Would you be willing to transcribe my humble thoughts?\" Xihe replied: \"I shall obey your command.\" He immediately prepared paper and brush, and as the Perfected Consort spoke, he transcribed her poem:\n\n> The numinous pass stands firm in the empty void,\n> The jade terrace refines the dense mists of Yu.\n> The Purple Palace rides the green radiance,\n> The numinous observatory gleams, towering and majestic.\n> Within the vermilion chambers of the jade portico,\n> The supreme virtue blazes like crimson clouds.\n> Below, I rinse my mouth with the essence of the divine flask,\n> Above, I grasp the azure blossoms of the celestial banners.\n> I bathe my feet in the Jade Heavenly Pool,\n> And pluck the zither by the Herdboy’s River.\n> Then I urge my cloud-borne chariot,\n> And rein the dragons along the dark slopes.\n> I shake my robes amidst the dust and filth,\n> And lift my skirts to tread the waves of light.\n> I vow to bind myself to the mountains and marshes,\n> That hardness and softness may harmonize in compliance.\n> Together we shall ascend the realm of dual purity,\n> Where the Dao of the Upper Perfected knows no deviation.\n> The Purple Tenuity gathers in wise counsel,\n> And the songs of acceptance bring abundant blessings.\n\nWhen Xi He had finished writing, she took it up to examine, then said: \"Now I gift this to you, to proclaim my cinnabar heart—do not speak of it thus. Should there be anything in your mind that remains unclear, you may discreetly inquire.\"\n\nThe Lady of Purple Tenuity then said: \"I shall compose another sheet of writing for your enlightenment, to show you a single good deed.\" Xi He again spread paper and dipped her brush, and the Lady dictated this poem:\n\n> The Two Images float within and without,\n> The dark qi is truly divided at the center.\n> The hidden meeting requires no chariot—\n> What we await is the precious attainment of the Real.\n> The Southern Marchmount forges luminous gold,\n> While the distant gaze tilts at perilous eaves.\n> Noble virtue soars, illumined by flying rosy clouds,\n> And thus moves the numinous folk of the Empyrean.\n> Mounting the terrace, we recline amidst layered curtains,\n> Together in the feast, we grasp the crimson clouds.\n> Looking up, I sigh at the boundary of heaven and man—\n> Within the reckoning, green naturally abides.\n> The supreme Dao is truly without deviation,\n> While dust and filth are not what is heard!\n> With shared vision, we perceive the eternal image,\n> Raising our voices in song for your sake.\n\nWhen she had finished writing, the Lady of Purple Tenuity took it up to read. After perusing it, she said: \"I give this to you. Today, through me, you become the host of the green cause, and I the guest of your intent’s counsel.\"\n\nThe Lady of Purple Tenuity then said: \"Tomorrow, the Lady of the Southern Marchmount shall return, and I shall go with the Perfected Consort to welcome her at the cloud’s edge. If she does not return tomorrow, it will be a matter of several days.\"\n\nAfter a long while, the Lady of Purple Tenuity said: \"I depart now. Tomorrow, I shall come with the Perfected Consort to visit you.\" She then descended her alms bowl and vanished from sight. The Perfected Consort lingered briefly behind, saying: \"The hidden feelings are not yet settled, the vital intent not yet forgotten—I imagine you will both chant these verses. Tomorrow, I shall return again.\" She then took Xi He’s hand and descended in form. Before she had passed through the doorway, she suddenly disappeared.\n\nOn the evening of the twenty-sixth day of the sixth month, the host of perfected beings arrived in procession, as follows:\n\nThe Lady Sovereign of Purple Tenuity...\n\nThe Perfected Consort of Nine Radiance of the Upper Palace of Purple Clarity,\nThe Perfected Master Xi Yang of Purple Yang,\nThe Lady Sovereign of Life-Destiny of the Upper Perfected, the Southern Marchmount,\nThe Lord of Mao Peak,\nThe Perfected of Pure Numinosity,\nThe Lesser Lord of Mao Peak.\n\nThere was also one person, very young in years, with an extraordinary beard, wearing a lotus crown, clad in vermilion robes, with white pearls sewn along the seams, and girded with a sword. None had ever seen this person before. He came often to discuss matters of Mount Jinting, conversing with the host of perfected beings. There were also things that could not be understood, yet he bowed in reverence to the three female perfected—Lady Sovereign of Purple Tenuity, Lady of Purple Clarity, and the Southern Perfected—and spoke with them as equals. It was said he was Wang Ziqiao, the Perfected of Mount Tongxiang. He did not speak with Xi He at all.\n\nPreviously, when perfected beings first descended, they initially did not immediately converse with Xi He. Each sat for a long while, until the Perfected Consort of Purple Clarity said: \"I would trouble your hand once more, Illustrious Lord, to inscribe something with brush, that we may disperse intent and forget words—would this be permissible?\" Xi He then spread out paper and waited to receive it. The Perfected Consort slowly spoke, and he recorded her words:\n\n\"I am the youngest beloved daughter of the Primordial Lord, the Lady of Grand Void Li. Long ago, I first studied the Dao on Tortoise Terrace, received jade scriptures from the Most High, bore the tiger register of the Purple Emperor, and wielded the jade scepter of the Five Thearchs. I was granted the scriptures and became a consort of the Upper Perfected, to wander and traverse the Jade Clarity. Often, I personally fanned the Nine Nets, my feet treading the Dark Chamber. My cloud-form roams the numinous void, gazing upward to grasp the root of the sun.\"\n\nEntering the feast of the Seven Palaces, departing with reins of cloud-chariots. Treading the Three Luminaries to ascend together, scattering radiant clouds to soar in flying carriages. Not that I could not choose the Upper Chambers, seek out the Purple Youths, find a worthy companion in the Jade Palace, or pair with a lofty spirit to become a couple—indeed, I have drawn near to the wondrous friends among the imperial ministers. Yet I simply follow the turning of the mechanism, submit to the reckoning of fate, bend down to mirror the dust and foam, and descend in step with the dragons. I summoned the hidden and potent male, pursued the solitary and companionable flock. From past lives, we were bound by silent accord. Our names were fixed in the plain covenant of the Jade Realm; our principles aligned in dual blessings. Carrying the fan to journey, sharing gourd-cups of flavor, binding skirts in libation, gazing back at the assembly of peers—within, I concealed the true methods. Proceeding thus, my lot in the unseen was already determined. The Azure Writs of the Upper Prime were examined; therefore, the heart’s distinctions of noble and base were already equalized. The delight of facing the light was already fulfilled. To attain my wish and wander with joy, combining past and present intent—how could this not be fitting?\n\nYet this is merely the great lineage of the Two Images, the paired offices of inner and outer. Truly, it is not the means to transform and return to simplicity, to congeal in pure emptiness, to wield the spirit-knife. The Seven Burdens are left to fate; the Great Simplicity preserves the true. Unfolding the Luminous Simplicity of the Jade Clarity, this is called the Eight Voids. Flourishing in serene loftiness, luxuriant and soaring through the clouds, it makes the winds sing on the cloud-paths, dragons chant and tigers roar. The Heavenly Sovereign’s paired luminaries ascend far to the Starry Tower. Flying stars hurl their light; sun and moon illuminate the body. The mouth exhales dark mist; the eyes flash lightning. Above, I repose in the flawless chamber, roaming through the Jade Clarity. Hands grasp radiant clouds; feet tread the Golden Court. From this moment, in the instant of attaining the Dao, should one firmly exhaust inner and outer, aligning principle with metal and stone? Or should emotions entwine in dual affection, hearts united in the bedchamber’s intimacy? Why must one embrace the balance of years, engage in fleeting unions, defile the seven spirits, and grieve the maddened soul?\n\nThis is merely my inquiry into your lineage, Illustrious Lord—there is no impropriety. Now, my aspirations hold true feeling, already as one with yours. We should join our four-horse chariots in the Jade Void, pair our journey to the Northern Mystery. Together, we shall pluck crimson fruits in the Jade Garden, gather cinnabar blossoms in the Orchard of Yu, share drink from the waters of the Purple River, and bathe together on the shores of the Azure Pool. Clad in robes of purple down, crowned with solar coronets, we shall wander the Upper Clarity, jointly pay homage to the Three Primes. The Eight Luminaries emerge and descend; phoenixes circle the Dragon Terrace. Above, we sip golden marrow, chant the songs of the Jade Mystery. Floating in the void, we feast in high assembly at the Great Dawn. The Four Balances resound in song; the Fragrant Mother presents mist. Heads aligned, we gaze together, sashes intertwined in fellowship. Is this not joy? Is this not the fulfillment of ambition?\n\nIllustrious Lord, follow this meeting—my heart has no refusal. Moreover, I cannot turn from reality to darkness, idly indulging my breast’s inclinations.\" Having spoken, she took up the writing to examine it, saying: \"Now, with this text, I dispel your stagnant doubts.\" She finished speaking and laughed for a long while.\n\nThe Lady of the Purple Tenuity said: \"The Perfected Consort’s words are exhausted; the threads of affection are manifest. You can no longer harbor any reservations—this is the work of the unseen fate of the dark reckoning.\"\n\nThe Lady of the Southern Marchmount, having seen the written words, said: \"The unseen destiny stirs in resonance; the dark reckoning aligns. Responding to fate’s summons, bound by karmic affinity—this is the excellent affair of joining with the true. It merely demonstrates the name of paired counterparts, defining the offices of inner and outer. There is no need to blindly follow the world’s corrupt defilements or engage in the nearness of lewd impurity. To pair with a numinous consort and meet in radiance, to betroth the noble Perfected’s youngest daughter—thus, in this intimate union, there is great benefit for advancing one’s practice, and no fear of harm or severance. The thousand spirits may be made to witness; no further argument remains. The Perfected Consort must be capable of bearing this task; the cloud-chariot must be capable of joint harnessing. Long ago, I once spoke to you of this intent through the Lady of the Purple Tenuity. Now, your wish is fulfilled, which makes me rejoice. Be careful not to harbor doubts or scorn in your heart.\n\nYesterday, I saw the Lady Li of the Golden Terrace in the Clear Void, who said you still harbored doubts in your heart, your countenance and qi slightly resentful. To reject this undertaking would be a grave error. The Perfected Consort possesses the Inner True Cinnabar and Azure Jade Writs of the Spirit Tiger—these are not things your kind possesses. With true talent, you seek to transcribe them; how could she conceal them? Now, what does the Grand Minister grasp? Merely texts and patterns—will you surely ride the luminous jade clouds? If there is anything not yet understood, you should subtly inquire into its feasibility.\"\n\nThe Perfected Consort, seeing the Lady’s written words, laughed and said: \"Hand in hand on the paired terraces, sighing at the fine meeting of radiant cakes—how nearly equal is this!\"\n\nThe Perfected of the Clear Void presented a text, saying: \"The Way of the Yellow and Red, the method of blending qi—these are but one of the techniques Zhang Ling received to propagate and transform his lineage, not the affair of true persons. I have often seen those who practice this cut off their lineage, never one who cultivated this and attained life. Among millions, none have escaped being tested by this.\"\n\nAmong ten million, should one err and attain it, the attainment extends no further than mere immortality. Zhang Ling received this to teach the world, yet even Ling’s later transformations no longer practiced it.\n\nBeware of speaking of the lower Way of the turbid living, for it corrupts the upright qi of the true Empyrean. Those who harbor lustful desires, fix their minds on the contemplation of sensual forms, and yet attempt to practice the higher Way—these merely make plain the punishments of the Three Bureaus. This is what is called embracing jade to rush into fire, or burying a dog in a golden coffin.\n\nThe contemplation of sensual forms is called the Yellow and Red; the higher Way is called the Hidden Writ. That people remain so perplexed by this is truly lamentable.\n\nThe Lady of Purple Tenuity presented a text, saying: The Yellow Writ and Red Realm, though the secret essentials of long life, are in truth the lower arts of attaining life, not the discourse proper to those of the Upper Palace who feast on radiant cakes and banquet in the luminous Empyrean. This Way lies merely in nurturing and propagating life, not in the higher Way.\n\nThose who harbor lustful qi and yet attempt to practice it alongside the higher Way—such Hidden Writs are but the brush of the Water Bureau, the drum of the Three Bureaus. Neither the Mystic Support nor the Release of Gratitude can be relied upon. In short: purity invites the descent of the numinous; devotion commands the service of the spirits.\n\nWhat the Perfected value in pairing with the luminous is the preservation of this. When paired partners cherish one another, it is in the twofold luminosity; though named husband and wife, they do not engage in the nearness of husband and wife. This is but an empty name to display to the senses.\n\nShould the Yellow and Red linger in the heart, even the Perfected cannot be seen, nor the numinous beings approached. One toils in vain at the tasks, and the Three Bureaus will still exact their labor.\n\nAt cockcrow, the Lady of Southern Marchmount presented a text, saying: The cock has crowed; the green of affection deepens.\n\nThe Perfected of Purple Yang presented a text, saying: The Grand Void soars high and far, meeting in the manner of the rites of worthy reception. Inscribed in the unseen workings, you must guard your heart from doubt regarding the Yellow and Red.\n\nThe Lord of Mao Peak presented a text, saying:\nThe mystic standard touches the palace of luminous scenes,\nHarmonizing dust, the jade chime resounds.\nThe subtle chamber’s pure wind drifts—\nHow can one not be exhorted to this?\n\nWhen the words were finished, the Perfected each departed. The Perfected Consort lingered briefly behind, saying: I trouble you, Illustrious Lord, for one more discourse. And she presented a text, saying:\nForget cares, embrace simplicity;\nLet your radiant heart align in perfect accord.\nSoon you shall frequently attend the reverent purity of the Empyrean,\nJoining the flowing luminosity in the dark convergence of vision,\nUnfurling the luxuriant and leading forth the elegant.\nI deem your lofty and numinous brilliance\nTo have cast off stagnation and forgotten vulgarity.\n\nWhen the words were finished, she took his hand to descend. Before reaching the question of the corpse, she suddenly vanished.\n\nOn the twenty-ninth day of the sixth month, the Perfected Consort of Nine Flowers presented a text, saying:\nThe luminous converges in paired presence,\nClouds gather in the mystic descent.\nDragon’s elegance fills the five voids,\nPlucking jade within the towering chambers.\nA long song in the numinous caress,\nBrilliant and wondrous, the jade portals open afar.\nLeaving affairs to bid the world eternal farewell,\nRosy mists and crimson waves—\nLightning hastens to the purple perch.\nBeyond the shared resonance of purity,\nTogether we roam the cloudy peaks and vast cliffs—\nIs this not excellence? Is this not joy?\n\nThe sun is the fruit of the rosy mists;\nThe rosy mists are the essence of the sun.\nThough you have heard the method of ingesting the sun’s fruit,\nYou have not yet known the essence of dining on rosy mists.\nThe scriptures of dining on rosy mists are most secret;\nThe Way of summoning rosy mists is most easy.\nThis is called the method of embodying life to reflect the jade light of the Upper Clarity.\n\nThe eyes are the mirrors of the body;\nThe ears are the windows of the frame.\nExcessive seeing dims the mirror;\nExcessive hearing shuts the windows.\nI possess the stone for polishing mirrors\nAnd the art for clearing windows—\nThus one may penetrate the myriad numinous,\nPeer into the subtlest sounds, and perceive afar.\nIs this acceptable?\n\nThe face is the courtyard of the spirit;\nThe hair is the blossom of the brain.\nSorrow mars the face;\nConcealment within the brain whitens the hair.\nThus the inner essence is lost,\nAnd the cinnabar fluids are depleted.\nI possess the scripture for restoring the youthful face\nAnd the method for returning whiteness.\nIs this acceptable?\n\nEssence is the spirit of the body;\nClarity is the treasure of the frame.\n\nExcessive toil scatters essence;\nRivalrous striving dissipates clarity.\nThus age follows the fall of qi,\nAnd senility soon arrives.\nI possess the Dao for replenishing essence\nAnd the scripture for prolonging clarity—\nIs this acceptable?\n\nThese four ways are the inner texts of the Upper Clarity,\nVerified true chapters of immediate efficacy.\nI now wish to present them\nTo aid and augment your luminous illumination.\n\nWhen the transmission was complete, she took them to show\nXi He, who responded with murmurs of assent and entreaty.\n\nOn the twenty-ninth day of the sixth month, the Realized One of Tongwu descended again in silence. Xi He was commanded to write the day’s message:\n\n“The eight radiant realms and four distant poles—\nHow vast the numinous shores!\nRare words sprout like sharp blades;\nExquisite tones gather like ringing chimes.\nAt dawn, one soars through limpid purity;\nMysterious qi ascends to the heavens.\nThe body transcends the Jade Void;\nThe heart leaves behind all hardship and strife.\nOne sinks into stillness beyond the finest nets,\nCongeals harmony beyond the silent waves.\nSuch a person shall surely roam the boundless void,\nDwell together in the courts of the Realized.\nThe Three Primes may then be seen,\nAnd a crimson name may be established.\n\nBut if the heart drifts with errant waves,\nThe eyes fix upon the veils of form—\nIf in motion one shares the snares of the world,\nIn stillness divides with contention—\nThen the path to immortality stretches far,\nAnd the gates of rebirth remain barred.\nTake heed, child.”\n\nXi He finished writing, took up the text, and presented it.\n\nOn the night of the thirtieth day of the sixth month, the Perfected Consort of Nine Flowers descended together with the Lady of the Purple Tenuity and the Lady of South Marchmount. After sitting for a long while, the Perfected Consort commanded her attendant maidens to open her brocade satchel and take out two scrolls to present, bidding them be copied. The titles of the books are as follows:\n\n*The Esoteric Writ of the Jade Radiance and Purple Glow of Supreme Purity*\n*The Book of Returning to Dawnlight and Rejoining Childlike Splendor of Supreme Purity*\n\nThe above are the names of the two scrolls.\n\nOn the night of the first day of the seventh month, the Lady of the Purple Tenuity, the Lady of South Marchmount, the Perfected Consort of Nine Flowers, the Three Perfected Ones of the Clear and Numinous Wutong of Purple Tenuity, and the Second Lord Mao descended together. After a long while, Xi He then addressed the assembled spirits, seeking the art of securing her person, desiring to know the distinction between noble and base, the convergence of lifespan and fate, and the fixed limits of their measure.\n\nThereupon, the Perfected Consort smiled and, after a long pause, bestowed upon her this teaching: “On this day, the Radiant Lord possesses a nature both serene and untrammeled, secretly structuring the jadelike clarity. A lofty current from an orchid pool, a pure resonance in the golden palace—truly, one who can treasure and conceal the rare, whose inner truth shines in seclusion. You ascend the ladder of numinous scriptures, ride the numbers in accord with life. With unsullied virtue in the divine garden, a cinnabar record in the Jade Purity, you stir mist and pluck the sun’s rays, sound the distant drum of the hidden. You shall surely become one of the Three Exalted Ministers, attending the Celestial Emperor’s person, a high aide to the Four Assistants, bearing the commands of the Sagely Lord. You shall govern life and sever death, reward and punish spirits, command the thousand numina, seal mountains and summon clouds. Presiding over the harmonious qi of yin and yang, you shall be elevated as the lord of the spirits of Wu and Yue.\n\nAs for me, I emerged from the congealed vision of destiny, born of flourishing radiance. My spirit soars through the nine heavens, my empty tones weave the celestial chambers. Following the turning of the Four Awakenings, I ascend the mysterious ladder in shared likeness. My purple name is inscribed in the Supreme, my pure script in the Eight Effulgences. My spirit illumines the western glow, my virtue gleams within. Thus, I received the scriptures and rode the qi to assume the office of Perfected Consort. Moreover, I shall assist you in unifying the Three Huo, governing the myriad spirits, facing the Northern Emperor to command, restraining the calamities of Dengshan. We shall join sleeves in the empty chamber, ride the mist in the sevenfold auspicious convergence, and occupy the inner groves of the numinous forest.\n\nTherefore, when you were born in Yang, I found peace. Since I descended from the Mystery, and you received the scriptures in the Western Palace, from the north you harnessed the sun’s rays, rode the plow’s eastern shaft, grasped the reins and held the iron, exclusively governing the eastern frontier. The Three Offices presented the universal mandate of rivers and mountains, the Celestial Soldiers offered their might, and the Four Armored Ones guarded the passes. At this time, it was indeed the height of the Radiant Lord’s nobility, the grand spectacle of the true immortals. Among the Three Offices, there has long been a hidden saying: ‘Yang An, the Great Lord, oversees the destiny of the true spirits’—this refers to none other than us. Since the Sagely Emperor’s parallel reign began, twenty-eight years have passed. Twenty-two years hence, the Radiant Lord shall ride the dragon and mount the clouds, ascending to heaven in broad daylight. First, you shall proceed to the Western Palace of Supreme Purity, then pay court to the Jade Emperor of the Three Primes in the north, after which you shall be entrusted with the affairs of the eastern brush.\n\nThis is because your jadelike clarity and purple radiance of Purple Tenuity, your golden tones and empty command, have been commended by the Supreme Ultimate. Your dark virtue has risen above, no longer requiring the toil of diligent study or the traversing of mountains and rivers. If you were to exert yourself further in refinement, your spirit would become even more luminous and pure—yet this would hardly compare to the effortless attainment of today. In the present age, the world’s snares entangle all, and the distinctions between noble and base are mired in the dusty toils of gain and loss. Truly, these are not matters a perfected one should engage in. Rather, one should remain at ease, whether in hardship or prosperity, whether encountering adversity or fortune.\n\nWhen I see the Radiant Lord’s ease, I am truly delighted. When I witness the Radiant Lord’s adversity, my countenance grows sorrowful. These two sentiments manifest upon the face. Yet even this is insufficient to reach far—how much more does long sorrow weigh upon the heart? As for inner darkness aligning with shadows, guarding the mystery and cherishing the dusty world, mingling form with the chambers of the age—how could I, on account of fleeting transgressions or the brevity of lowly station, bring shame to the fixed essence of the true?\n\nYin and yang are the instruments of adversity and prosperity. The two images being arrayed, gain and loss intertwine—these are but the paths of coming and going. Those who dwell in the scorching turmoil of the world’s dust are but the sinful ghosts of the lower realms, the doomed natures hastening toward death. To reside in uselessness amid the clamor is to attain the unhewn simplicity of the true. To entrust oneself to the ordinary within and contemplate inwardly is the root and beginning of spirit immortality.\n\nWealth and nobility, indulgence and excess—these are the axes and saws that break the bones, akin to the carts and boats that carry the condemned. Glory and splendor, pride in the world, striving and vying for fleeting moments—these are sufficient only to invite transgression and calamity. Humiliation is the weapon that severs life; it is no fine thing. Thus, the lofty ones of antiquity, foreseeing the difficulty of avoiding fault and knowing the perils of wealth and nobility, retired to wander the deep forests and dwell in the renowned mountains. They chewed the harmonious qi, rinsed and bathed in clear streams, seeking to distance themselves from this evil edge and pursue abundant fortune. They transcended the entanglements of the self, preserving their pristine essence.\n\nWhy, then, should you strive so eagerly for the distinctions of noble and base among mortals, casting yourself into the marketplace of glory and disgrace? Moreover, the age now turns to warfare, and the three disasters converge daily. The divine winds approach, driving away the foul vapors. The bright metal of heaven mingles with filth in the muddy ditches, jewels and jade are defiled by dung to attract dust. Blood stains the garments, the turbid harms the true, and the mysterious path stretches far—this is the time. If you cannot endure the smoke of wind and fire, and wish to embrace the true in the secluded groves, you may seek the Way of the Unsheathed Sword to end yourself, or the gathering of silent retreat, the nearness of concealment and revelation. The moment will determine the course; the choice rests with the Radiant Lord.\n\nThe hidden reckoning above responds to destiny and meets in accord. The numinous scriptures of the Jade Terrace align with the true and merge with the radiance. Thus, my words are tender in speech, my heart resolved in writing. Do I sigh for you alone? No—this is but an illustration of the division of names and fates.”\n\nHaving finished writing, she took the text and gave it to Xi He, adding, “Ponder this, and your ailments shall soon improve.”\n\nTo the north we ascend the Gate of Mystic Truth,\nhand in hand we weave the lofty net.\nIncense smoke scatters across the Eight Radiant Lands,\nthe mystic wind stirs the crimson waves.\nGazing up, we transcend the Ford of Lang Garden;\nlooking down, we tread the slopes of Xiaoling’s ridge.\nJade flutes sing above the clouds,\nphoenixes cry through the ninefold distances.\nRiding the qi, we float through the great void—\nwhy then should we trample the mountains and rivers?\nWith golden tablets we summon the feathered spirits,\nmarshalling our forces to break the ten thousand demons.\nEmbracing the twin dawn glows,\na thousand pillars stand firm as infant teeth.\nThose who lose their truth and plunge into the halls of strife\nknow not what else to do.\nI raise my voice to the Palace of Great Radiance,\nwhere golden gates gleam in the Purple Clarity.\nResplendent chambers reflect the Great Simplicity,\ntheir four pavilions all of crimson jasper.\nTossing the wheel at the Ford of Empty Unity,\nwe gather the reins to dance the Green Plough.\nJade blossoms fly like cloud-canopies,\nthe Western Consorts unfurl brocade banners.\nSuddenly we leave the dusty, turbid shore,\nin an instant we arrive at the courtyard of the fair one.\nLong-awaited resonance brings timely descent—\nwhat was summoned now dwells in the unseen.\nRiding the phoenix, we play the music of dawn’s sky,\ntogether feasting in the cinnabar groves of Ying.\nDukes and lords remain distant and small—\nhow could they know the numinous power of the Perfected?\n\nThese two poems were transmitted on the twentieth day of the tenth month.\nHere concludes the record of the Attendant of the Lord of Dawn, transmitted by the Eastern Flower Sovereign and the Director of Destinies.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "侍帝晨东华上佐司命杨君传记 经名：侍帝晨束华上住司命场君传记。 一卷。 底本出处：《正统道藏》正一部。 侍帝晨东华上佐司命杨君传记 紫清上宫九华真妃授经君，姓杨，讳羲和，南岳夫人之弟子，许仙侯及帝晨度经之师也。 以晋成帝咸和五年庚寅岁九月生，为简文相府时舍人。 众真以兴宁初多来降，至三年乙丑岁安妃下嫔，此后数数降集，事边不显，云应解剑隐化。 以泰元十三年戊子岁，乃乘云驾龙，西谒太素，北朝玉清。 车妳执事，高佐四辅，侍晨帝躬，总括昊越鬼神之司，传记未显於世也。 九华真妃，晋兴宁三年岁在乙丑六月二十五日夜，紫微王夫人见降，又与一神女俱来。 神女着云锦杨，上丹下青，文采光鲜。 腰中有绿绣带，带系十余小铃，铃青色黄色，更相参厕。 左带玉佩，佩亦如世问佩。 但几小耳。 衣服鲦鲦，有光照朗室内，如日下映视云母形也。 云发鬓鬓，整顿绝伦作髻，乃在顶中又垂余发至腰许。 指着金银，白珠约臂。 视之，年可堪十三四许。 左右又有两侍女，其一侍女着朱衣，带青章囊，手中又持一锦囊。 囊长尺一二寸许，以盛书，书当有十许卷也。 以白玉检检囊口，见刻检上字云：玉清神虎内真紫元丹章。 其一侍女着青衣，捧一白箱，以绛带束络之，白箱似象牙形也。 二侍女年可堪十七八许，整饬非常。 神女及侍者颜容莹朗，鲜彻如玉，五香馥芬，如烧香婴气者也。 初来入户，在紫微夫人后行。 夫人既入户之始，仍见告日：今日有贵客来，相诣论好也。 於是羲和即起立，夫人日：今日可不须起，但当共坐自相向作礼耳。 夫人坐南向作礼耳。 羲和其夕先坐承床下西向，神女因见就同林坐束向，各以左手作礼。 作礼毕，紫微夫人日：此是太虚上真元君金台李夫人之少子也。 太虚元君昔遣诣龟山，学上清道，道成，受太上书，署为紫清上宫九华真妃者也。 於是赐姓为安，名郁嫔，字灵萧。 紫微夫人又问羲和：世上曾见有此人不。 羲和答日：灵尊高秀，无以为喻。 夫人因大笑：於尔何如，羲和不复答。 紫清真妃坐良久都不言，妃手中先握三枚枣，色如乾枣而形长大，内无核，亦不作枣味，有似如梨耳。 妃先以一枚见与，次以一枚与紫微夫人，自留一枚，语令各食之。 食之毕，良久移时，真妃问羲和：年已几，是何月生。 羲和登答：年三十六，庚寅岁九月生也。 真妃又日：君师南真夫人，司命秉权，至道高妙，备皇良德之宗也。 闻君德音甚久，不图今日得叔因绿，欢愿於冥运之会，依然有松罗之缠矣。 羲和乃称名答日：沉沦下俗尘染，其质高卑灵邈。 无绿禀敬，猥亏灵降，欣踊罔极，唯蒙启训，以松其暗济，羲和元元夙夜所愿也。 真妃日：君今语不得有谦饬，谦饬之辞，殊非所宜。 又良久，真妃具告日：欲作一纸文相赠者，便因君以笔运我鄙意，当可尔乎。 羲和答：奉命。 ＇即登纸染笔，登口见哑作诗日： 灵关坚空上，琼台炼郁罗。 紫宫乘绿景，灵观蔼嵯峨。 琅轩朱房内，上德焕绛霞。 俯漱灵瓶津，仰攘碧标华。 濯足玉天池，鼓她牵牛河。 遂策浊云驾，落龙辔玄阿。 振衣尘滓际，骞裳步景波。 愿为山泽结，刚柔顺以和。 相携双清内，上真道不邪。 紫微会良谋，唱纳享福多。",
      "translated_text": "**Record of Attendant Yang to the Morning Emperor, Eastern Florescence’s Supreme Assistant Controller of Destiny**\n\n**Scripture Title:** *Record of Attendant Yang to the Morning Emperor, Eastern Florescence’s Supreme Assistant Controller of Destiny*\n**Volume:** One\n**Source Text:** *Zhengtong Daoist Canon*, Orthodox Section, Part One\n\n---\n\nThe *Record of Attendant Yang to the Morning Emperor, Eastern Florescence’s Supreme Assistant Controller of Destiny*:\nThe Perfected Consort of the Nine Florescence Palace of the Purple Clarity Upper Palace, bestower of scriptures, bore the surname Yang, with the personal name Xihe, and was a disciple of the Lady of Southern Marchmount. He was also the master of Xu Xianhou and the transmitter of the *Scriptures of the Morning Emperor’s Salvation*.\n\nBorn in the ninth month of the gengyin year of the fifth reign of Emperor Cheng of Jin (330 CE), he served as a secretary in the residence of Emperor Jianwen. The host of Perfected Ones began descending frequently in the early Xingning era (363 CE). By the third year, the yichou year (365 CE), the Consort An descended to the mortal realm. Thereafter, they descended repeatedly, though their affairs remained obscure, as if destined to lay aside their swords and conceal their transformations.\n\nIn the thirteenth year of the Taiyuan era, the wuzi year (388 CE), he ascended upon clouds and rode dragons to the west, where he paid homage to the Grand Primordium, and to the north, where he attended the Jade Clarity. There, he was entrusted with the affairs of the celestial chariot, assisted the Four Auxiliaries, attended the Morning Emperor in person, and oversaw the offices of spirits and gods across the vastness of Wu and Yue. Yet his records have not been widely revealed to the world.\n\n---\n\nThe Perfected Consort of the Nine Florescence Palace:\nOn the night of the twenty-fifth day of the sixth month in the third year of the Xingning era, the yichou year (365 CE), the Lady Wang of the Purple Tenuity descended, accompanied by a divine maiden. The maiden wore a cloud-brocade robe, crimson above and azure below, its patterns radiant and resplendent. At her waist hung a green embroidered sash, from which dangled over ten small bells, some azure, some yellow, interspersed in alternation. From her left side hung a jade pendant, much like those worn in the mortal world, though slightly smaller. Her garments shimmered with a luminous sheen, illuminating the chamber as if sunlight were refracted through mica.\n\nHer cloud-like tresses were meticulously arranged into a topknot, with the remaining hair cascading down to her waist. Her fingers bore gold and silver rings, and white pearls adorned her arms. She appeared to be around thirteen or fourteen years of age. Flanking her were two attendants: one dressed in vermilion, bearing a green patterned satchel and holding a brocade pouch. The pouch measured about one or two *chi* in length and contained some ten scrolls. Its mouth was sealed with a white jade clasp, upon which was inscribed: *\"Purple Prime Elixir Chapters of the Divine Tiger of Jade Clarity.\"*\n\nThe other attendant wore azure robes and carried a white box, bound with crimson cords, resembling ivory in shape. Both attendants appeared to be around seventeen or eighteen, exquisitely adorned. The divine maiden and her attendants possessed radiant complexions, lustrous as jade, and their presence suffused the air with the fragrance of five incenses, like the scent of burning aloeswood.\n\nWhen they first entered the chamber, they followed behind the Lady of Purple Tenuity. As the Lady crossed the threshold, she announced: \"Today, a noble guest has come to visit and discuss matters of affinity.\" Thereupon, Xihe rose to his feet. The Lady said: \"There is no need to stand on ceremony today; you may simply sit and exchange courtesies.\" The Lady sat facing south, while Xihe sat that evening upon the lower couch, facing west. The divine maiden then approached and sat beside him, facing east, each performing the ritual gesture with their left hand.\n\nAfter the courtesies were exchanged, the Lady of Purple Tenuity said: \"This is the youngest child of the Golden Terrace Lady, the Primordial Perfected Sovereign of the Grand Void.\" The Primordial Sovereign of the Grand Void had once dispatched her to Mount Gui to study the Dao of the Upper Clarity. Upon mastering the Dao, she received the scriptures of the Most High and was appointed the Perfected Consort of the Nine Florescence Palace of the Purple Clarity Upper Palace. Thus, she was granted the surname An, the personal name Yupin, and the style Lingxiao.\n\nThe Lady of Purple Tenuity then asked Xihe: \"Have you ever seen such a person in the mortal world?\" Xihe replied: \"Her numinous majesty and lofty refinement defy comparison.\" The Lady laughed heartily, asking: \"And what of you, Xihe?\" He did not respond further.\n\nThe Perfected Consort of Purple Clarity sat in silence for a long while. In her hand, she held three dates, their color like dried dates but larger in shape, without pits and lacking the taste of dates, resembling pears instead. She first offered one to Xihe, then gave another to the Lady of Purple Tenuity, keeping the last for herself, instructing them to eat. After they had consumed them, a long while passed before the Perfected Consort asked Xihe: \"How old are you, and in which month were you born?\" Xihe promptly replied: \"I am thirty-six years old, born in the ninth month of the gengyin year.\"\n\nThe Perfected Consort then said: \"Your master, the Lady of Southern Perfection, wields authority as Controller of Destiny, her Dao lofty and wondrous, embodying the ancestral virtue of the august and good. I have long heard of your virtuous reputation and never imagined that today I would have the karmic affinity to meet you. Our joy in this meeting of unseen destinies is like the entwining of pines and creepers.\" Xihe, addressing her by name, replied: \"Mired in the dust of the lower world, my nature is base and my spirit distant. Without the karmic connection to receive your reverence, I have rashly incurred your numinous descent. My joy is boundless, and I can only hope for your instruction to dispel my ignorance. This has been my lifelong aspiration.\"\n\nThe Perfected Consort said: \"Your words should not be so modest. Such self-deprecation is hardly fitting.\" After another long silence, she declared: \"I wish to compose a written message to bestow upon you. Would you be willing to transcribe my humble thoughts?\" Xihe replied: \"I shall obey your command.\" He immediately prepared paper and brush, and as the Perfected Consort spoke, he transcribed her poem:\n\n> The numinous pass stands firm in the empty void,\n> The jade terrace refines the dense mists of Yu.\n> The Purple Palace rides the green radiance,\n> The numinous observatory gleams, towering and majestic.\n> Within the vermilion chambers of the jade portico,\n> The supreme virtue blazes like crimson clouds.\n> Below, I rinse my mouth with the essence of the divine flask,\n> Above, I grasp the azure blossoms of the celestial banners.\n> I bathe my feet in the Jade Heavenly Pool,\n> And pluck the zither by the Herdboy’s River.\n> Then I urge my cloud-borne chariot,\n> And rein the dragons along the dark slopes.\n> I shake my robes amidst the dust and filth,\n> And lift my skirts to tread the waves of light.\n> I vow to bind myself to the mountains and marshes,\n> That hardness and softness may harmonize in compliance.\n> Together we shall ascend the realm of dual purity,\n> Where the Dao of the Upper Perfected knows no deviation.\n> The Purple Tenuity gathers in wise counsel,\n> And the songs of acceptance bring abundant blessings.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1221,
      "start_sentence": 0,
      "end_sentence": 57,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.51129603385925,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\侍帝晨东华上佐司命杨君传记.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "羲和书讫，取视之，乃曰：今以相赠，以宣丹心，勿云云也。 若意中有不相解者，自可微访耳。 紫微夫人日：我复因尔作一纸文以相晓者，示一善事耳。 羲和又辟纸染笔，夫人见授诗日： 二象内外浮，玄气果中分。 冥会不待驾，所期贵得真。 南岳铸明金，眇观倾岌甍。 良德飞霞照，遂感灵霄人。 乘台稠袅寝，齐牢携绛云。 仰叹天人际，数中自有绿。 ，上道诚不邪，尘滓非！ 所闻。 同目感恒象，高唱为尔因。 书讫，紫微夫人取视，视毕曰：以此赠尔，今日於我，为因绿之主唱意之谋客矣。 紫微夫人又曰：明日南岳夫人当还，我当与妃共迎之於云际问，明日不还者，乃复数日事。 又良久，紫微夫人曰：我去矣，明日当与真妃俱来诣尔也。 觉下钵而失所在也，真妃小留在后而言曰：冥情未据，意气未忘，想君俱咏之耳，明日当复来。 乃取羲和手执之，而自下状，未出户之间，忽然不见。 六月二十六日夕，众真来疏，如左： 紫微王夫人，",
      "translated_text": "When Xi He had finished writing, she took it up to examine, then said: \"Now I gift this to you, to proclaim my cinnabar heart—do not speak of it thus. Should there be anything in your mind that remains unclear, you may discreetly inquire.\"\n\nThe Lady of Purple Tenuity then said: \"I shall compose another sheet of writing for your enlightenment, to show you a single good deed.\" Xi He again spread paper and dipped her brush, and the Lady dictated this poem:\n\n> The Two Images float within and without,\n> The dark qi is truly divided at the center.\n> The hidden meeting requires no chariot—\n> What we await is the precious attainment of the Real.\n> The Southern Marchmount forges luminous gold,\n> While the distant gaze tilts at perilous eaves.\n> Noble virtue soars, illumined by flying rosy clouds,\n> And thus moves the numinous folk of the Empyrean.\n> Mounting the terrace, we recline amidst layered curtains,\n> Together in the feast, we grasp the crimson clouds.\n> Looking up, I sigh at the boundary of heaven and man—\n> Within the reckoning, green naturally abides.\n> The supreme Dao is truly without deviation,\n> While dust and filth are not what is heard!\n> With shared vision, we perceive the eternal image,\n> Raising our voices in song for your sake.\n\nWhen she had finished writing, the Lady of Purple Tenuity took it up to read. After perusing it, she said: \"I give this to you. Today, through me, you become the host of the green cause, and I the guest of your intent’s counsel.\"\n\nThe Lady of Purple Tenuity then said: \"Tomorrow, the Lady of the Southern Marchmount shall return, and I shall go with the Perfected Consort to welcome her at the cloud’s edge. If she does not return tomorrow, it will be a matter of several days.\"\n\nAfter a long while, the Lady of Purple Tenuity said: \"I depart now. Tomorrow, I shall come with the Perfected Consort to visit you.\" She then descended her alms bowl and vanished from sight. The Perfected Consort lingered briefly behind, saying: \"The hidden feelings are not yet settled, the vital intent not yet forgotten—I imagine you will both chant these verses. Tomorrow, I shall return again.\" She then took Xi He’s hand and descended in form. Before she had passed through the doorway, she suddenly disappeared.\n\nOn the evening of the twenty-sixth day of the sixth month, the host of perfected beings arrived in procession, as follows:\n\nThe Lady Sovereign of Purple Tenuity...",
      "overlap_context": "en I urge my cloud-borne chariot,\n> And rein the dragons along the dark slopes.\n> I shake my robes amidst the dust and filth,\n> And lift my skirts to tread the waves of light.\n> I vow to bind myself to the mountains and marshes,\n> That hardness and softness may harmonize in compliance.\n> Together we shall ascend the realm of dual purity,\n> Where the Dao of the Upper Perfected knows no deviation.\n> The Purple Tenuity gathers in wise counsel,\n> And the songs of acceptance bring abundant blessings.",
      "start_char": 1222,
      "end_char": 1607,
      "start_sentence": 58,
      "end_sentence": 77,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.750205039978027,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\侍帝晨东华上佐司命杨君传记.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "紫清上宫九华真妃， 羲师紫阳真人， 上真司命南岳夫人， 茅中君， 清灵真人， 茅小君。 又有一人年甚少，整须非常，建芙蓉冠，着朱衣，以白珠缀衣缝，带剑。 都未尝见此人，来多论金庭山中事，与众真共语。 又有不可得解者，揖敬紫微、紫清、南真三女真人，共言平耳。 云是桐相山真人王子乔也，都不与羲和语。 又前后初有真人来见降者，初时皆自不即与其羲和共语耳。 各坐良久，紫清真妃曰：欲复烦明君之手，笔书一事，以散意忘言，可乎。 又羲和辟纸待授，真妃乃徐微言而受日：我是元君之少女太虚李夫人爱子也，昔初学真於龟台，受玉章于高上，荷虎录於紫皇，秉瑷铁於五帝，受书为上真之妃，以游行玉清也。 常数自手扇九罗，足蹑玄房。 霄形灵虚，仰攘日根。",
      "translated_text": "The Perfected Consort of Nine Radiance of the Upper Palace of Purple Clarity,\nThe Perfected Master Xi Yang of Purple Yang,\nThe Lady Sovereign of Life-Destiny of the Upper Perfected, the Southern Marchmount,\nThe Lord of Mao Peak,\nThe Perfected of Pure Numinosity,\nThe Lesser Lord of Mao Peak.\n\nThere was also one person, very young in years, with an extraordinary beard, wearing a lotus crown, clad in vermilion robes, with white pearls sewn along the seams, and girded with a sword. None had ever seen this person before. He came often to discuss matters of Mount Jinting, conversing with the host of perfected beings. There were also things that could not be understood, yet he bowed in reverence to the three female perfected—Lady Sovereign of Purple Tenuity, Lady of Purple Clarity, and the Southern Perfected—and spoke with them as equals. It was said he was Wang Ziqiao, the Perfected of Mount Tongxiang. He did not speak with Xi He at all.\n\nPreviously, when perfected beings first descended, they initially did not immediately converse with Xi He. Each sat for a long while, until the Perfected Consort of Purple Clarity said: \"I would trouble your hand once more, Illustrious Lord, to inscribe something with brush, that we may disperse intent and forget words—would this be permissible?\" Xi He then spread out paper and waited to receive it. The Perfected Consort slowly spoke, and he recorded her words:\n\n\"I am the youngest beloved daughter of the Primordial Lord, the Lady of Grand Void Li. Long ago, I first studied the Dao on Tortoise Terrace, received jade scriptures from the Most High, bore the tiger register of the Purple Emperor, and wielded the jade scepter of the Five Thearchs. I was granted the scriptures and became a consort of the Upper Perfected, to wander and traverse the Jade Clarity. Often, I personally fanned the Nine Nets, my feet treading the Dark Chamber. My cloud-form roams the numinous void, gazing upward to grasp the root of the sun.\"",
      "overlap_context": " sight. The Perfected Consort lingered briefly behind, saying: \"The hidden feelings are not yet settled, the vital intent not yet forgotten—I imagine you will both chant these verses. Tomorrow, I shall return again.\" She then took Xi He’s hand and descended in form. Before she had passed through the doorway, she suddenly disappeared.\n\nOn the evening of the twenty-sixth day of the sixth month, the host of perfected beings arrived in procession, as follows:\n\nThe Lady Sovereign of Purple Tenuity...",
      "start_char": 1607,
      "end_char": 1929,
      "start_sentence": 78,
      "end_sentence": 92,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.510734796524048,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\侍帝晨东华上佐司命杨君传记.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "入宴七阙，出辔云轮。 蹑三辰而俱升，散景霞以飞轩也。 非不能采择上室，访搜紫童，求玉宫之良俦，偶高灵而为双，接玄引奇友于帝卿矣。 直是我推机任会，应度历数，俯景尘沬，参龙下迈。 招冥求之雄，追得疋之党耳。 自宿命相与，乃有默会。 定名素契玉乡，，齐理二庆。 携扁而行，匏爵分味。 醮袅结裳，顾畴中会，内藏真方也。 推此而往，已定分冥。 简青书上元，是故善鄙之心，亦已齐矣。 对景之好，亦已成矣。 得愿而游欢兼昔旨，岂不宜乎。 然此自复是二象大宗，内外之配职耳。 实非所以变化反淡，凝清虚，刃灵刀。 七累遗任，太素保真。 启玉清单景，八空之谓也。 秀寂高清，郁举流霄。 使风歌云路，龙昤虎嗥。 天皇双景，远升辰楼。 飞星掷光，日月映躯。 口吐冥姻，眼电激光。 上寝瑕房，流行玉清。 手掣景云，足陆金庭。 若自此之时，在得道之顷。 为当固尽内外，理同金石。 情缠双好，齐心帏蟆耳。 奚必抱袁均年，有轻中之接，尘秽七神，悲魂狂魄乎。 盖是妾求氏族之於明君耳，非有邪也。 今可谓志怀真情，已如一方，当相与结驷玉虚，偶行北玄。 同攘绛实於玉圃，并采丹华於阅园，分饮於紫川之水，齐濯於碧池之滨。 紫华毛被，日冕容冠。 逍遥上清，俱朝三元。 八景出落，凤徘龙台。 仰嗽金髓，诵歌玉玄。 浮空寝宴，高会太晨。 四钧朗唱，香母奏姻。 齐首偶观，携带交群。 不亦乐乎，不亦得志乎。 明君其顺会，妾心无辞，且亦不得背实反冥，苟任胸怀矣。 哑毕，复自取视而言曰：今以此书相诣，盖豁其滞疑耳。 言毕，乃笑良久。 紫微夫人日：真妃之辞尽矣，论好之绿着矣。 尔亦不得复有所容也，玄运冥分使之然耳。 南岳夫人见哑书，日：冥期数感，玄运相适，应分来聘，亲构因绿，此携真之善事也。 盖示有偶对之名，定内外之职而已。 不必苟循世中之弊秽，而行淫浊之迩矣。 偶灵妃而接景，聘贵真之少女。 於是亲交，亦有大进业之益，益得而无伤绝之虑。 千神於是可使试观，不得复陈矣。 真旖必可克任，云轩必可俱驾也。 吾往曾因紫微夫人为汝遘及此意，今遂如愿，益使我欣欣。 慎复疑哂於心胸矣。 我昨见金台李夫人於清虚中，言尔尚有疑正之心，色气小有恨恨。 汝违此举，误人不小。 真妃有神虎内真丹青玉文，非尔所有者辈，良才求写，故当不为隐耳。 今上相擭何，但文章而已，将必乘景玉霄乎。 若有未悟者，宜微访可否。 真妃见夫人书言，乃笑而言日：携手双台悟，叹良会景饼同，几於此齐乎。 清灵真人授书曰：黄赤之道，混气之法，是张陵受教施化为种子之一术耳，非真人之事也。 吾数见行此而绝种，未见种此而得生矣。 百万之中，莫不尽被考者矣。",
      "translated_text": "Entering the feast of the Seven Palaces, departing with reins of cloud-chariots. Treading the Three Luminaries to ascend together, scattering radiant clouds to soar in flying carriages. Not that I could not choose the Upper Chambers, seek out the Purple Youths, find a worthy companion in the Jade Palace, or pair with a lofty spirit to become a couple—indeed, I have drawn near to the wondrous friends among the imperial ministers. Yet I simply follow the turning of the mechanism, submit to the reckoning of fate, bend down to mirror the dust and foam, and descend in step with the dragons. I summoned the hidden and potent male, pursued the solitary and companionable flock. From past lives, we were bound by silent accord. Our names were fixed in the plain covenant of the Jade Realm; our principles aligned in dual blessings. Carrying the fan to journey, sharing gourd-cups of flavor, binding skirts in libation, gazing back at the assembly of peers—within, I concealed the true methods. Proceeding thus, my lot in the unseen was already determined. The Azure Writs of the Upper Prime were examined; therefore, the heart’s distinctions of noble and base were already equalized. The delight of facing the light was already fulfilled. To attain my wish and wander with joy, combining past and present intent—how could this not be fitting?\n\nYet this is merely the great lineage of the Two Images, the paired offices of inner and outer. Truly, it is not the means to transform and return to simplicity, to congeal in pure emptiness, to wield the spirit-knife. The Seven Burdens are left to fate; the Great Simplicity preserves the true. Unfolding the Luminous Simplicity of the Jade Clarity, this is called the Eight Voids. Flourishing in serene loftiness, luxuriant and soaring through the clouds, it makes the winds sing on the cloud-paths, dragons chant and tigers roar. The Heavenly Sovereign’s paired luminaries ascend far to the Starry Tower. Flying stars hurl their light; sun and moon illuminate the body. The mouth exhales dark mist; the eyes flash lightning. Above, I repose in the flawless chamber, roaming through the Jade Clarity. Hands grasp radiant clouds; feet tread the Golden Court. From this moment, in the instant of attaining the Dao, should one firmly exhaust inner and outer, aligning principle with metal and stone? Or should emotions entwine in dual affection, hearts united in the bedchamber’s intimacy? Why must one embrace the balance of years, engage in fleeting unions, defile the seven spirits, and grieve the maddened soul?\n\nThis is merely my inquiry into your lineage, Illustrious Lord—there is no impropriety. Now, my aspirations hold true feeling, already as one with yours. We should join our four-horse chariots in the Jade Void, pair our journey to the Northern Mystery. Together, we shall pluck crimson fruits in the Jade Garden, gather cinnabar blossoms in the Orchard of Yu, share drink from the waters of the Purple River, and bathe together on the shores of the Azure Pool. Clad in robes of purple down, crowned with solar coronets, we shall wander the Upper Clarity, jointly pay homage to the Three Primes. The Eight Luminaries emerge and descend; phoenixes circle the Dragon Terrace. Above, we sip golden marrow, chant the songs of the Jade Mystery. Floating in the void, we feast in high assembly at the Great Dawn. The Four Balances resound in song; the Fragrant Mother presents mist. Heads aligned, we gaze together, sashes intertwined in fellowship. Is this not joy? Is this not the fulfillment of ambition?\n\nIllustrious Lord, follow this meeting—my heart has no refusal. Moreover, I cannot turn from reality to darkness, idly indulging my breast’s inclinations.\" Having spoken, she took up the writing to examine it, saying: \"Now, with this text, I dispel your stagnant doubts.\" She finished speaking and laughed for a long while.\n\nThe Lady of the Purple Tenuity said: \"The Perfected Consort’s words are exhausted; the threads of affection are manifest. You can no longer harbor any reservations—this is the work of the unseen fate of the dark reckoning.\"\n\nThe Lady of the Southern Marchmount, having seen the written words, said: \"The unseen destiny stirs in resonance; the dark reckoning aligns. Responding to fate’s summons, bound by karmic affinity—this is the excellent affair of joining with the true. It merely demonstrates the name of paired counterparts, defining the offices of inner and outer. There is no need to blindly follow the world’s corrupt defilements or engage in the nearness of lewd impurity. To pair with a numinous consort and meet in radiance, to betroth the noble Perfected’s youngest daughter—thus, in this intimate union, there is great benefit for advancing one’s practice, and no fear of harm or severance. The thousand spirits may be made to witness; no further argument remains. The Perfected Consort must be capable of bearing this task; the cloud-chariot must be capable of joint harnessing. Long ago, I once spoke to you of this intent through the Lady of the Purple Tenuity. Now, your wish is fulfilled, which makes me rejoice. Be careful not to harbor doubts or scorn in your heart.\n\nYesterday, I saw the Lady Li of the Golden Terrace in the Clear Void, who said you still harbored doubts in your heart, your countenance and qi slightly resentful. To reject this undertaking would be a grave error. The Perfected Consort possesses the Inner True Cinnabar and Azure Jade Writs of the Spirit Tiger—these are not things your kind possesses. With true talent, you seek to transcribe them; how could she conceal them? Now, what does the Grand Minister grasp? Merely texts and patterns—will you surely ride the luminous jade clouds? If there is anything not yet understood, you should subtly inquire into its feasibility.\"\n\nThe Perfected Consort, seeing the Lady’s written words, laughed and said: \"Hand in hand on the paired terraces, sighing at the fine meeting of radiant cakes—how nearly equal is this!\"\n\nThe Perfected of the Clear Void presented a text, saying: \"The Way of the Yellow and Red, the method of blending qi—these are but one of the techniques Zhang Ling received to propagate and transform his lineage, not the affair of true persons. I have often seen those who practice this cut off their lineage, never one who cultivated this and attained life. Among millions, none have escaped being tested by this.\"",
      "overlap_context": "the Lady of Grand Void Li. Long ago, I first studied the Dao on Tortoise Terrace, received jade scriptures from the Most High, bore the tiger register of the Purple Emperor, and wielded the jade scepter of the Five Thearchs. I was granted the scriptures and became a consort of the Upper Perfected, to wander and traverse the Jade Clarity. Often, I personally fanned the Nine Nets, my feet treading the Dark Chamber. My cloud-form roams the numinous void, gazing upward to grasp the root of the sun.\"",
      "start_char": 1929,
      "end_char": 2963,
      "start_sentence": 93,
      "end_sentence": 154,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.8849720954895,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\侍帝晨东华上佐司命杨君传记.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "千万之中，误有一人得之，得之远至於不死耳。 张陵承此，以教世耳，陵之变举，亦不行此矣。 尔慎言浊生之下道，坏真霄之正气也。 思怀淫欲，存心色观，而以兼行上道者，适足明三官罚耳。 所谓抱玉赴火，以金棺葬狗也。 色观谓之黄赤，上道谓之隐书。 人之难晓，乃至於此。 紫微夫人授书曰：夫黄书赤界，虽长生之秘要，实得生之下术也，非上宫天真流饼宴景之夫所得言也。 此道在於长养分生而已，非上道也。 有怀於淫气，兼以行之。 隐书者，适足握水官之笔，呜三官之鼓耳。 玄挺亦不可得恃，解谢亦不可得赖也。 要而言之，贞则灵降，专则神使矣。 夫真人之偶景者，所贵存乎。 匹偶相爱，在於二景，虽名之为夫妇，不行夫妇之迩也，是用虚名以示视听耳。 苟有黄赤存於胸中，真人亦不可得见，灵人亦不可得接。 徒劬劳於执事，亦有劳於三官矣。 鸡呜时，南岳夫人授书日：鸡既呜矣，论好之绿笃也。 紫阳真人授书曰：太虚远逸高毕，同接礼贤之义，着之於冥运，尔慎心系於黄赤之疑。 茅中君授书日：玄标触景府，和尘蔼玉振。 微房清风逸，迈可不勖之。 言毕，诸真人各去，真妃小留在后，曰：又烦明君为一辞也。 而授书日：忘怀简素，晖心齐契。 方当数亲虔清宇德，与流景合冥观会，理发领秀。 伏度明君高尚灵映，纵滞忘鄙耳。 言毕，而见持手而下将，未至尸之问，, 忽然失所在。 六月二十九日，九华真妃授书日：景应双集，云会玄落。 龙秀五空，采琼闱台。 长歌灵摸，焕启玉扉眇矣。 遗事与世长辞，霞妳绛波，电赴紫栖。 共担清响之外，同游云岫广崖，岂不善乎，岂不乐哉。 日者，霞之实。 霞者，日之精。 君虽闻服日实之法，未见知餐霞之精也。 夫餐霞之经甚秘，致霞之道甚易。 此谓体生玉光映上清之法也。 眼者，身之镜。 耳者，体之牖。 视多则镜昏，听众则牖闭。 妾有磨镜之石，央牖之术，即能彻洞万灵，眇察绝响，可乎。 面者，神之庭。 发者，脑之华。 心悲则面憔，脑臧则发素。 所以精元内丧，丹津损竭也。 妾有童面之经，还白之法，可乎。 精者，体之神。 明者，身之宝。",
      "translated_text": "Among ten million, should one err and attain it, the attainment extends no further than mere immortality. Zhang Ling received this to teach the world, yet even Ling’s later transformations no longer practiced it.\n\nBeware of speaking of the lower Way of the turbid living, for it corrupts the upright qi of the true Empyrean. Those who harbor lustful desires, fix their minds on the contemplation of sensual forms, and yet attempt to practice the higher Way—these merely make plain the punishments of the Three Bureaus. This is what is called embracing jade to rush into fire, or burying a dog in a golden coffin.\n\nThe contemplation of sensual forms is called the Yellow and Red; the higher Way is called the Hidden Writ. That people remain so perplexed by this is truly lamentable.\n\nThe Lady of Purple Tenuity presented a text, saying: The Yellow Writ and Red Realm, though the secret essentials of long life, are in truth the lower arts of attaining life, not the discourse proper to those of the Upper Palace who feast on radiant cakes and banquet in the luminous Empyrean. This Way lies merely in nurturing and propagating life, not in the higher Way.\n\nThose who harbor lustful qi and yet attempt to practice it alongside the higher Way—such Hidden Writs are but the brush of the Water Bureau, the drum of the Three Bureaus. Neither the Mystic Support nor the Release of Gratitude can be relied upon. In short: purity invites the descent of the numinous; devotion commands the service of the spirits.\n\nWhat the Perfected value in pairing with the luminous is the preservation of this. When paired partners cherish one another, it is in the twofold luminosity; though named husband and wife, they do not engage in the nearness of husband and wife. This is but an empty name to display to the senses.\n\nShould the Yellow and Red linger in the heart, even the Perfected cannot be seen, nor the numinous beings approached. One toils in vain at the tasks, and the Three Bureaus will still exact their labor.\n\nAt cockcrow, the Lady of Southern Marchmount presented a text, saying: The cock has crowed; the green of affection deepens.\n\nThe Perfected of Purple Yang presented a text, saying: The Grand Void soars high and far, meeting in the manner of the rites of worthy reception. Inscribed in the unseen workings, you must guard your heart from doubt regarding the Yellow and Red.\n\nThe Lord of Mao Peak presented a text, saying:\nThe mystic standard touches the palace of luminous scenes,\nHarmonizing dust, the jade chime resounds.\nThe subtle chamber’s pure wind drifts—\nHow can one not be exhorted to this?\n\nWhen the words were finished, the Perfected each departed. The Perfected Consort lingered briefly behind, saying: I trouble you, Illustrious Lord, for one more discourse. And she presented a text, saying:\nForget cares, embrace simplicity;\nLet your radiant heart align in perfect accord.\nSoon you shall frequently attend the reverent purity of the Empyrean,\nJoining the flowing luminosity in the dark convergence of vision,\nUnfurling the luxuriant and leading forth the elegant.\nI deem your lofty and numinous brilliance\nTo have cast off stagnation and forgotten vulgarity.\n\nWhen the words were finished, she took his hand to descend. Before reaching the question of the corpse, she suddenly vanished.\n\nOn the twenty-ninth day of the sixth month, the Perfected Consort of Nine Flowers presented a text, saying:\nThe luminous converges in paired presence,\nClouds gather in the mystic descent.\nDragon’s elegance fills the five voids,\nPlucking jade within the towering chambers.\nA long song in the numinous caress,\nBrilliant and wondrous, the jade portals open afar.\nLeaving affairs to bid the world eternal farewell,\nRosy mists and crimson waves—\nLightning hastens to the purple perch.\nBeyond the shared resonance of purity,\nTogether we roam the cloudy peaks and vast cliffs—\nIs this not excellence? Is this not joy?\n\nThe sun is the fruit of the rosy mists;\nThe rosy mists are the essence of the sun.\nThough you have heard the method of ingesting the sun’s fruit,\nYou have not yet known the essence of dining on rosy mists.\nThe scriptures of dining on rosy mists are most secret;\nThe Way of summoning rosy mists is most easy.\nThis is called the method of embodying life to reflect the jade light of the Upper Clarity.\n\nThe eyes are the mirrors of the body;\nThe ears are the windows of the frame.\nExcessive seeing dims the mirror;\nExcessive hearing shuts the windows.\nI possess the stone for polishing mirrors\nAnd the art for clearing windows—\nThus one may penetrate the myriad numinous,\nPeer into the subtlest sounds, and perceive afar.\nIs this acceptable?\n\nThe face is the courtyard of the spirit;\nThe hair is the blossom of the brain.\nSorrow mars the face;\nConcealment within the brain whitens the hair.\nThus the inner essence is lost,\nAnd the cinnabar fluids are depleted.\nI possess the scripture for restoring the youthful face\nAnd the method for returning whiteness.\nIs this acceptable?\n\nEssence is the spirit of the body;\nClarity is the treasure of the frame.",
      "overlap_context": "ed terraces, sighing at the fine meeting of radiant cakes—how nearly equal is this!\"\n\nThe Perfected of the Clear Void presented a text, saying: \"The Way of the Yellow and Red, the method of blending qi—these are but one of the techniques Zhang Ling received to propagate and transform his lineage, not the affair of true persons. I have often seen those who practice this cut off their lineage, never one who cultivated this and attained life. Among millions, none have escaped being tested by this.\"",
      "start_char": 2963,
      "end_char": 3791,
      "start_sentence": 155,
      "end_sentence": 201,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.717573165893555,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\侍帝晨东华上佐司命杨君传记.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "劳多则精散，营竞则明消。 所以老随气落，耄已及之。 妾有益精之道，延明之经，可乎。 此四道，乃上清内书，立验之真章也。 方欲献示，以补助君之明照耳。 授毕，取以见，与羲和，口答堆唯，乞请之。 六月二十九日，桐梧真人同来降复哑，令羲和书日：夫八朗四极，灵岸辽遐。 奇言吐颖．’瑷音集振。 晨飞浚清，玄气赴霄。 体迈玉虚，心遗艰锋。 沈滞於眇罗之外，凝和於寂波之表。 若此人者，必能游腾玄漠，同栖真庭矣。 三元可得而见，绛名可得而立耳。 如其心并愆浪，目击色袂，动与罔罟共启，静与争竞为分者，此乃适仙路邈，求生日阔也。 子其慎之。 羲和书毕取视，乃以见与。",
      "translated_text": "Excessive toil scatters essence;\nRivalrous striving dissipates clarity.\nThus age follows the fall of qi,\nAnd senility soon arrives.\nI possess the Dao for replenishing essence\nAnd the scripture for prolonging clarity—\nIs this acceptable?\n\nThese four ways are the inner texts of the Upper Clarity,\nVerified true chapters of immediate efficacy.\nI now wish to present them\nTo aid and augment your luminous illumination.\n\nWhen the transmission was complete, she took them to show\nXi He, who responded with murmurs of assent and entreaty.\n\nOn the twenty-ninth day of the sixth month, the Realized One of Tongwu descended again in silence. Xi He was commanded to write the day’s message:\n\n“The eight radiant realms and four distant poles—\nHow vast the numinous shores!\nRare words sprout like sharp blades;\nExquisite tones gather like ringing chimes.\nAt dawn, one soars through limpid purity;\nMysterious qi ascends to the heavens.\nThe body transcends the Jade Void;\nThe heart leaves behind all hardship and strife.\nOne sinks into stillness beyond the finest nets,\nCongeals harmony beyond the silent waves.\nSuch a person shall surely roam the boundless void,\nDwell together in the courts of the Realized.\nThe Three Primes may then be seen,\nAnd a crimson name may be established.\n\nBut if the heart drifts with errant waves,\nThe eyes fix upon the veils of form—\nIf in motion one shares the snares of the world,\nIn stillness divides with contention—\nThen the path to immortality stretches far,\nAnd the gates of rebirth remain barred.\nTake heed, child.”\n\nXi He finished writing, took up the text, and presented it.",
      "overlap_context": " the myriad numinous,\nPeer into the subtlest sounds, and perceive afar.\nIs this acceptable?\n\nThe face is the courtyard of the spirit;\nThe hair is the blossom of the brain.\nSorrow mars the face;\nConcealment within the brain whitens the hair.\nThus the inner essence is lost,\nAnd the cinnabar fluids are depleted.\nI possess the scripture for restoring the youthful face\nAnd the method for returning whiteness.\nIs this acceptable?\n\nEssence is the spirit of the body;\nClarity is the treasure of the frame.",
      "start_char": 3791,
      "end_char": 4065,
      "start_sentence": 202,
      "end_sentence": 217,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.122666358947754,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\侍帝晨东华上佐司命杨君传记.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "六月三十日夜，九华真妃，与紫微王夫人、南岳夫人同降。 真妃坐良久，乃命侍女发检囊之中出二卷书以见付，令写之。 书题如左： 《 上清玉霞紫映内观隐书》 《 上清还晨归童日晖中书》 右二卷名目 七月一日夜，紫微王夫人、南岳夫人、九华真妃、紫微桐梧清灵三真人、茅二君同降，．良久，羲和乃自陈於众灵，求安身之术； 欲知贵贱之分，年命之会，多少定限。 於是真妃乃笑，良久，见授书：此日明君，夷质虚闲，秘构玉朗。 兰渊高流，清响金宫。 可谓能珍宝藏奇，幽真内焕。 标梯灵篇，乘数顺生。 素德神园，丹录玉清。 兴烟拔景，冥鼓遐声也。 必三事大夫，侍晨帝躬高佐四辅，承制圣君。 理生断死，赏罚鬼神。 摄命千灵，封山召云。 主察阴阳之和气，而加为昊越鬼神之君也。 妾将挺命凝观，凭华而生。 灵飞九天，虚音织房，因运四觉，玄梯同象。 紫名太上，清文八景。 神映西晖，德朗内颖。 乃受书乘气，得为真妃之任矣。 又当助君总括三霍，综御万神。 对命北帝，制劫邓山。 又应相与擭袂，虚房乘烟，七元嘉会，希林内据因绿也。 是故君生於杨，我得安。 妾自发玄下造，君自受书於西宫，从北策景乘耕束辕，握旎秉铁，专制束蕃。 三官奉普河山启源。 天丁献武，四甲卫输。 当此之时，实明君之至贵，真仙之盛观也。 三官中常有暗谣云：杨安大君，董真命神，正我等之谓耳。 盖圣皇之方驾於今，有二十八年也。 后二十二年，明君将乘龙驾云，白日升天。 先诣上清西宫，北朝玉皇三元，然后乃得束翰执事矣。 此自是君玉朗紫微，金音虚领，为太极所旌。 乃玄德上挺，不复用勤学劬劳，涉足山川矣。 若为精勖之者，当小神清莹鲜矣，亦不甚今日不劳之举也。 今世俗萦网，贵贱之问，涉尘涂之役，在得失之津，信非真人所得经营。 乃自坦乎，艰泰之用任乎，遇否之顷耳。 见明君之逸，诚欣然也。 睹明君之否，诚戚颜也。 此二感，发於颜色之上也。 复未足以致远，悲抱长戚矣。 至於内冥偶景，并守玄好轾轮尘蔼，参形世室，妾岂以愆累浮卑少时之滞，而亏辱於当真之定质耶。 夫阴阳者，对否泰之用。 二象既罗，得失错综，此皆往来之径陌耳。 今人居风尘之焦盛者，乃多罪之下鬼，趣死之考质也。 夫处无用於嚣涂，乃得真之挺朴。 任凡庸以内观，乃灵仙之根始也。 盖富贵淫俪，是破骨之斧锯，有似载罪之舟车耳。 荣华矜世争竞邀，时适足以诲愆要。 辱为伐命之兵，非佳事也。 是故古之高人，览· 罪咎难预，知富贵之不可享矣。 遂肥逛长林，栖景名山。 咀嚼和气，漱濯清川。 欲远此恶边，自求多福。 超豁缠躬，保全至素者也。 君亦奚足大汲汲於人间之贵贱，投身於荣辱之肆哉。 且方交兵，日会三灾。 向臻神风，驱除臭气。 参天明金，生秽於泥渎，宝玉杀粪以招尘。 骞裳振血，浊真亏真，玄通远逸，是其时也。 君若不可耐风火之烟，欲抱真於幽林者，且可寻解剑之道自尽，出默之会，隐显之迩，临时分处，有任於明君矣。 冥数上感，有命而交。 灵书玉台，真契合景。 是以言婵於辞，心讫於笔，妾岂独叹於一人乎，盖示名分之判例也。 书讫，取以与羲和，复日：君省此，当少愈不。",
      "translated_text": "On the night of the thirtieth day of the sixth month, the Perfected Consort of Nine Flowers descended together with the Lady of the Purple Tenuity and the Lady of South Marchmount. After sitting for a long while, the Perfected Consort commanded her attendant maidens to open her brocade satchel and take out two scrolls to present, bidding them be copied. The titles of the books are as follows:\n\n*The Esoteric Writ of the Jade Radiance and Purple Glow of Supreme Purity*\n*The Book of Returning to Dawnlight and Rejoining Childlike Splendor of Supreme Purity*\n\nThe above are the names of the two scrolls.\n\nOn the night of the first day of the seventh month, the Lady of the Purple Tenuity, the Lady of South Marchmount, the Perfected Consort of Nine Flowers, the Three Perfected Ones of the Clear and Numinous Wutong of Purple Tenuity, and the Second Lord Mao descended together. After a long while, Xi He then addressed the assembled spirits, seeking the art of securing her person, desiring to know the distinction between noble and base, the convergence of lifespan and fate, and the fixed limits of their measure.\n\nThereupon, the Perfected Consort smiled and, after a long pause, bestowed upon her this teaching: “On this day, the Radiant Lord possesses a nature both serene and untrammeled, secretly structuring the jadelike clarity. A lofty current from an orchid pool, a pure resonance in the golden palace—truly, one who can treasure and conceal the rare, whose inner truth shines in seclusion. You ascend the ladder of numinous scriptures, ride the numbers in accord with life. With unsullied virtue in the divine garden, a cinnabar record in the Jade Purity, you stir mist and pluck the sun’s rays, sound the distant drum of the hidden. You shall surely become one of the Three Exalted Ministers, attending the Celestial Emperor’s person, a high aide to the Four Assistants, bearing the commands of the Sagely Lord. You shall govern life and sever death, reward and punish spirits, command the thousand numina, seal mountains and summon clouds. Presiding over the harmonious qi of yin and yang, you shall be elevated as the lord of the spirits of Wu and Yue.\n\nAs for me, I emerged from the congealed vision of destiny, born of flourishing radiance. My spirit soars through the nine heavens, my empty tones weave the celestial chambers. Following the turning of the Four Awakenings, I ascend the mysterious ladder in shared likeness. My purple name is inscribed in the Supreme, my pure script in the Eight Effulgences. My spirit illumines the western glow, my virtue gleams within. Thus, I received the scriptures and rode the qi to assume the office of Perfected Consort. Moreover, I shall assist you in unifying the Three Huo, governing the myriad spirits, facing the Northern Emperor to command, restraining the calamities of Dengshan. We shall join sleeves in the empty chamber, ride the mist in the sevenfold auspicious convergence, and occupy the inner groves of the numinous forest.\n\nTherefore, when you were born in Yang, I found peace. Since I descended from the Mystery, and you received the scriptures in the Western Palace, from the north you harnessed the sun’s rays, rode the plow’s eastern shaft, grasped the reins and held the iron, exclusively governing the eastern frontier. The Three Offices presented the universal mandate of rivers and mountains, the Celestial Soldiers offered their might, and the Four Armored Ones guarded the passes. At this time, it was indeed the height of the Radiant Lord’s nobility, the grand spectacle of the true immortals. Among the Three Offices, there has long been a hidden saying: ‘Yang An, the Great Lord, oversees the destiny of the true spirits’—this refers to none other than us. Since the Sagely Emperor’s parallel reign began, twenty-eight years have passed. Twenty-two years hence, the Radiant Lord shall ride the dragon and mount the clouds, ascending to heaven in broad daylight. First, you shall proceed to the Western Palace of Supreme Purity, then pay court to the Jade Emperor of the Three Primes in the north, after which you shall be entrusted with the affairs of the eastern brush.\n\nThis is because your jadelike clarity and purple radiance of Purple Tenuity, your golden tones and empty command, have been commended by the Supreme Ultimate. Your dark virtue has risen above, no longer requiring the toil of diligent study or the traversing of mountains and rivers. If you were to exert yourself further in refinement, your spirit would become even more luminous and pure—yet this would hardly compare to the effortless attainment of today. In the present age, the world’s snares entangle all, and the distinctions between noble and base are mired in the dusty toils of gain and loss. Truly, these are not matters a perfected one should engage in. Rather, one should remain at ease, whether in hardship or prosperity, whether encountering adversity or fortune.\n\nWhen I see the Radiant Lord’s ease, I am truly delighted. When I witness the Radiant Lord’s adversity, my countenance grows sorrowful. These two sentiments manifest upon the face. Yet even this is insufficient to reach far—how much more does long sorrow weigh upon the heart? As for inner darkness aligning with shadows, guarding the mystery and cherishing the dusty world, mingling form with the chambers of the age—how could I, on account of fleeting transgressions or the brevity of lowly station, bring shame to the fixed essence of the true?\n\nYin and yang are the instruments of adversity and prosperity. The two images being arrayed, gain and loss intertwine—these are but the paths of coming and going. Those who dwell in the scorching turmoil of the world’s dust are but the sinful ghosts of the lower realms, the doomed natures hastening toward death. To reside in uselessness amid the clamor is to attain the unhewn simplicity of the true. To entrust oneself to the ordinary within and contemplate inwardly is the root and beginning of spirit immortality.\n\nWealth and nobility, indulgence and excess—these are the axes and saws that break the bones, akin to the carts and boats that carry the condemned. Glory and splendor, pride in the world, striving and vying for fleeting moments—these are sufficient only to invite transgression and calamity. Humiliation is the weapon that severs life; it is no fine thing. Thus, the lofty ones of antiquity, foreseeing the difficulty of avoiding fault and knowing the perils of wealth and nobility, retired to wander the deep forests and dwell in the renowned mountains. They chewed the harmonious qi, rinsed and bathed in clear streams, seeking to distance themselves from this evil edge and pursue abundant fortune. They transcended the entanglements of the self, preserving their pristine essence.\n\nWhy, then, should you strive so eagerly for the distinctions of noble and base among mortals, casting yourself into the marketplace of glory and disgrace? Moreover, the age now turns to warfare, and the three disasters converge daily. The divine winds approach, driving away the foul vapors. The bright metal of heaven mingles with filth in the muddy ditches, jewels and jade are defiled by dung to attract dust. Blood stains the garments, the turbid harms the true, and the mysterious path stretches far—this is the time. If you cannot endure the smoke of wind and fire, and wish to embrace the true in the secluded groves, you may seek the Way of the Unsheathed Sword to end yourself, or the gathering of silent retreat, the nearness of concealment and revelation. The moment will determine the course; the choice rests with the Radiant Lord.\n\nThe hidden reckoning above responds to destiny and meets in accord. The numinous scriptures of the Jade Terrace align with the true and merge with the radiance. Thus, my words are tender in speech, my heart resolved in writing. Do I sigh for you alone? No—this is but an illustration of the division of names and fates.”\n\nHaving finished writing, she took the text and gave it to Xi He, adding, “Ponder this, and your ailments shall soon improve.”",
      "overlap_context": "h a person shall surely roam the boundless void,\nDwell together in the courts of the Realized.\nThe Three Primes may then be seen,\nAnd a crimson name may be established.\n\nBut if the heart drifts with errant waves,\nThe eyes fix upon the veils of form—\nIf in motion one shares the snares of the world,\nIn stillness divides with contention—\nThen the path to immortality stretches far,\nAnd the gates of rebirth remain barred.\nTake heed, child.”\n\nXi He finished writing, took up the text, and presented it.",
      "start_char": 4065,
      "end_char": 5279,
      "start_sentence": 218,
      "end_sentence": 285,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.16850686073303,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\侍帝晨东华上佐司命杨君传记.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "北登玄真阙，携手结高罗。 香烟散八景，玄风鼓绛波。 仰超琅园津，俯陌霄陵阿。 玉箫云上唱，凤呜洞九遐。 乘气浮太空，曷为蹑山河。 金节命羽灵，征兵折万魔。 齐抱二晨晖，千桩方婴牙。 丧真投竞室，不解可奈何。 仰吗太霞宫，金阙曜紫清。 华房映太素，四轩皆朱琼。 掷轮空同津，总辔舞绿耕。 玉华飞云盖，西妃运锦旌。 翻然尘浊涯，倏忽佳人庭。 宿感应期降，所招已在冥。 乘凤奏霄晨，共酣丹林婴。 公侯徒眇眇，安知真人灵。 右二篇十月二十日授。 侍帝晨东华上住司命场君传记竟",
      "translated_text": "To the north we ascend the Gate of Mystic Truth,\nhand in hand we weave the lofty net.\nIncense smoke scatters across the Eight Radiant Lands,\nthe mystic wind stirs the crimson waves.\nGazing up, we transcend the Ford of Lang Garden;\nlooking down, we tread the slopes of Xiaoling’s ridge.\nJade flutes sing above the clouds,\nphoenixes cry through the ninefold distances.\nRiding the qi, we float through the great void—\nwhy then should we trample the mountains and rivers?\nWith golden tablets we summon the feathered spirits,\nmarshalling our forces to break the ten thousand demons.\nEmbracing the twin dawn glows,\na thousand pillars stand firm as infant teeth.\nThose who lose their truth and plunge into the halls of strife\nknow not what else to do.\nI raise my voice to the Palace of Great Radiance,\nwhere golden gates gleam in the Purple Clarity.\nResplendent chambers reflect the Great Simplicity,\ntheir four pavilions all of crimson jasper.\nTossing the wheel at the Ford of Empty Unity,\nwe gather the reins to dance the Green Plough.\nJade blossoms fly like cloud-canopies,\nthe Western Consorts unfurl brocade banners.\nSuddenly we leave the dusty, turbid shore,\nin an instant we arrive at the courtyard of the fair one.\nLong-awaited resonance brings timely descent—\nwhat was summoned now dwells in the unseen.\nRiding the phoenix, we play the music of dawn’s sky,\ntogether feasting in the cinnabar groves of Ying.\nDukes and lords remain distant and small—\nhow could they know the numinous power of the Perfected?\n\nThese two poems were transmitted on the twentieth day of the tenth month.\nHere concludes the record of the Attendant of the Lord of Dawn, transmitted by the Eastern Flower Sovereign and the Director of Destinies.",
      "overlap_context": "the course; the choice rests with the Radiant Lord.\n\nThe hidden reckoning above responds to destiny and meets in accord. The numinous scriptures of the Jade Terrace align with the true and merge with the radiance. Thus, my words are tender in speech, my heart resolved in writing. Do I sigh for you alone? No—this is but an illustration of the division of names and fates.”\n\nHaving finished writing, she took the text and gave it to Xi He, adding, “Ponder this, and your ailments shall soon improve.”",
      "start_char": 5280,
      "end_char": 5505,
      "start_sentence": 286,
      "end_sentence": 303,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.192781925201416,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\侍帝晨东华上佐司命杨君传记.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}