{
  "source_id": "修真秘录—宋",
  "source_file": "chunked_daozang\\修真秘录—宋.json",
  "total_chunks": 5,
  "total_original_chars": 4052,
  "total_translated_chars": 24340,
  "total_translation_time": 114.1915671825409,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\修真秘录—宋.txt",
    "category": "方法类"
  },
  "full_translation": "**Esoteric Records of Cultivating the Dao**\n*Title: Esoteric Records of Cultivating the Dao*\n*Author: Fu Dukang of the Song Dynasty*\n*One fascicle*\n*Source text: \"Daoist Canon of the Zhengtong Era,\" Dongshen Section, Methods Category*\n\n**Esoteric Records of Cultivating the Dao**\n*Compiled by Fu Duren, Former Registrar of Fengyang County in Shang Prefecture*\n\n**On Dietary Suitability**\n\n**Question from the Aspiring Immortal:** For those who cultivate and nourish themselves, what foods may they consume to sate hunger without causing harm?\n\n**Response from the Perfected One:** Sour, salty, sweet, and bitter foods—each belongs to its proper season. Follow the sequence of spring, summer, autumn, and winter; do not act contrary to the organs. Excess in consumption leads to illness, just as moderation in restraint yields boundless benefit. The harms of improper diet have already been expounded; the benefits of suitable nourishment shall now be explained to you. Do not neglect these teachings—take them to heart.\n\nThe *Eight Essentials* states:\n- In spring, consume pungent foods, for pungency disperses.\n- In summer, consume salty foods, for saltiness moistens.\n- In late summer, consume sour foods, for sourness astringes.\n- In autumn, consume bitter foods, for bitterness firms.\n- In winter, consume sweet and rich foods, for sweetness harmonizes the center and promotes flesh, while richness seals the interstices and supplements the center.\n\nAll these benefit the five viscera and dispel pathogenic qi. These flavors of the four seasons, applied according to their suitability, nourish the organs, expel pathogens, and embody the Dao of nurturing life—unalterable in principle.\n\nThe *Rites*’ *Nei Ze* states: \"In harmonizing flavors, spring favors sourness, summer favors bitterness, autumn favors pungency, and winter favors saltiness, tempered with smooth and sweet.\" The commentary explains: \"Emphasize the flavors of the season to nourish their corresponding qi.\"\n\nThe classics say: \"In spring, avoid sour foods; in summer, avoid bitter foods.\" For each of the four seasons, store the season’s flavors—this refers to the vigor of qi. Reduce the season’s flavors to subdue excess qi. The *Nei Ze*’s emphasis on seasonal flavors addresses the fear of qi deficiency and emaciation, thus augmenting the season’s flavors to nourish qi.\n\nThe *Nei Ze* further states:\n- In spring, consume lamb, suckling pig, and the fat of *you* (ox fat). Spring corresponds to the flourishing of Wood. *Gao shi* (ox fat) pertains to the Earth phase of the central Ox. Wood restrains Earth; when Wood is abundant, Earth becomes dormant. Thus, the dormant fat is used to moderate qi, hence the use of ox fat.\n- In summer, consume *ju* (dried pheasant), *xiu* (dried fish), and *zao* (dog fat). *Ju* is dried pheasant; *xiu* is dried fish; *zao* is dog fat. The Dog belongs to the Metal phase of the West. Summer belongs to the Fire phase of the South. Fire restrains Metal; when Fire is abundant, Metal becomes dormant. Thus, dog fat is used to moderate qi.\n- In autumn, consume calf, *chen* (dust), and the fat of *xing* (goose fat). *Xing* is goose, which belongs to the Wood phase of the East. Autumn belongs to the Metal phase of the West. Metal restrains Wood; when Metal is abundant, Wood becomes dormant. Thus, goose fat is used.\n- In winter, consume *xian yu* (fresh game) and the fat of *shan* (mutton). *Gao shan* (mutton fat) pertains to the Sheep, which belongs to the Fire phase of the South. Winter belongs to the Water phase of the North. Water restrains Fire; when Water is abundant, Fire becomes dormant. Thus, dormant mutton fat is used.\n\nZheng (Xuan) comments: \"Lamb and suckling pig are plump at birth. Calf and *chen* are robust and full. *Ju* and *xiu* are dried by heat. Fish and wild geese settle when waters recede. These eight foods embody the qi of the four seasons and are especially suitable for human consumption. Thus, the dormant fats are used to harmonize and refine them.\"\n\nGenerally:\n- Ox pairs well with millet,\n- Sheep with glutinous millet,\n- Pig with broomcorn millet,\n- Dog with sorghum,\n- Fish with melon—\n\nfor their qi and flavors complement one another.\n\nThe *Rites of Zhou*’s *Offices of Heaven* states:\n- For grain-based meals (*shi qi*), observe spring’s warmth—rice should be warm.\n- For broths (*geng qi*), observe summer’s heat—broths should be hot.\n- For sauces (*jiang qi*), observe autumn’s coolness—sauces should be chilled.\n- For beverages (*yin qi*), observe winter’s cold—drinks should be cold.\n\nThe *Great Essentials* states:\n- The Liver is green; it benefits from sweetness. Polished rice, beef, and jujubes are sweet.\n- The Heart is red; it benefits from sourness. Sesame, dog meat, and plums are sour.\n- The Spleen is yellow; it benefits from saltiness. Soybeans, pork, and chestnuts are salty.\n- The Lungs are white; they benefit from bitterness. Wheat, mutton, and apricots are bitter.\n- The Kidneys are black; they benefit from pungency. Yellow millet, goose meat, and peaches are pungent.\n\nFor ailments of the:\n- Liver, consume sesame, wheat, dog meat, plums, and leeks.\n- Heart, consume wheat, mutton, apricots, and *qiu* (a type of vegetable).\n- Spleen, consume polished rice, beef, jujubes, and mallow.\n- Lungs, consume yellow millet, goose meat, peaches, and scallions.\n- Kidneys, consume soybeans, yellow millet, pork, chestnuts, and *lei* (a type of vegetable).\n\nThus, by carefully harmonizing the five flavors, the bones become straight, the sinews supple, qi and blood flow smoothly, and the interstices are sealed. In this way, qi and bones are refined.\n\nCarefully following the Dao/Way in accordance with its principles ensures the enduring fulfillment of Heaven’s mandate.\n\nMutton is highly warming; sheep’s head meat is neutral and governs dizziness from wind and epidemic illnesses. Sheep’s tripe strengthens stomach deficiency and damage, reduces frequent urination, and arrests spontaneous sweating. Sheep’s milk and cheese fortify the Lungs and benefit the Large Intestine. Sheep’s kidneys supplement deficiency and weakness, enriching the marrow.\n\nDog meat is warming and chiefly repairs the five viscera from taxation and injury. With prolonged consumption, it augments qi and strength, thickens the intestines and stomach, consolidates the lower burner, and fills the bone marrow. It must not be eaten roasted.\n\nBeef is neutral. Cow’s milk is sweet and cold, chiefly supplementing deficiency and emaciation while quenching thirst. Cow’s cheese governs alternating chills and fever, quenches thirst, and dispels heat in the chest. Cow’s ghee is cold, dispelling stagnant qi in the chest and benefiting the Large and Small Intestines.\n\nDeer’s head meat governs wasting-thirst and excessive dreaming. Deer meat chiefly supplements the center and augments qi and strength. Deer shank meat governs pain in the bone marrow. Prolonged consumption of deer meat makes one resistant to cold.\n\nRiver deer meat supplements the five viscera. Eaten from the eighth to the eleventh month, it surpasses mutton. Donkey meat governs manic wind, melancholy, and unhappiness, calming the heart’s qi. Beaver meat governs long-standing water distension near death; made into a thick soup, it is highly effective. Leopard meat is warming and sour, chiefly strengthening sinews, bones, will, and nature.\n\nRabbit meat is neutral; consuming it fattens the lower burner, strengthens stomach qi, and increases appetite. Male goose meat is sour and warming, chiefly descending qi, dispelling manic evil, and pacifying the five viscera and intestines while relieving wasting-thirst. Black male goose meat is sweet and warming, chiefly supplementing the center, arresting pain, and dispelling malign qi from the heart and abdomen. Black female goose meat is neutral and sweet, chiefly dispelling wind-cold-damp impediment, slackness and tension of the five, calming the fetus, and treating breast abscesses.\n\nWild goose meat is sweet and neutral, chiefly augmenting qi and lightening the body. Prolonged consumption promotes hair growth, confers resistance to aging, and prevents hunger. White duck meat is neutral, chiefly supplementing deficiency and emaciation, resolving toxic heat, harmonizing the viscera and bowels, and disinhibiting the waterways. Black duck must not be eaten.\n\nWild duck meat is salty and cold, chiefly supplementing the center and augmenting qi, harmonizing the viscera and bowels, dispelling visiting heat, and dispersing food. Best eaten after the ninth month, it expels abdominal worms, balances stomach qi, regulates the center, lightens the body, and may be consumed long-term, surpassing domestic duck.\n\nQuail is warming, supplementing the five viscera, augmenting the center and replenishing qi, solidifying sinews and bones, conferring resistance to cold and heat, and dispersing accumulations and concretions. Prolonged consumption does not induce aversion; it must not be eaten from the fourth to the eighth month.\n\nDried jujubes are sweet, acrid, and warming, chiefly governing malign qi in the heart and abdomen, pacifying the center, nourishing spleen qi, aiding the twelve channels, freeing the nine orifices, supplementing scant fluids, and calming great fright while strengthening the will. Prolonged consumption lightens the body, extends years, prevents hunger, and leads to immortality.\n\nChestnuts are salty and warming, chiefly augmenting qi, thickening the intestines and stomach, supplementing the Kidneys, and making one resistant to hunger. Eaten raw, they treat lumbar and leg ailments; they must not be steamed.\n\nPersimmons are sweet and cold, supplementing deficiency taxation and insufficiency. Dried persimmons thicken the intestines and stomach, fortify spleen qi, and disperse static blood. Red persimmons supremely supplement Lung qi and reconnect the qi of the channels and network vessels.\n\nMandarins are sour and cold, chiefly descending qi, opening the chest and diaphragm, dispersing phlegm and qi bind, and quenching thirst. Prolonged consumption dispels bad breath, lightens the body, and extends years. The peel is best when aged.\n\nDark plums are bitter and neutral, chiefly descending qi, dispelling vexing heat, pacifying the heart spirit, relieving pain in the limbs and trunk, treating hemiplegia and numbness, arresting diarrhea, curing somnolence, and relieving dry mouth.\n\nHawthorn is cold, benefiting heart qi and supplementing insufficiency in the middle burner. Cherries are neutral, chiefly regulating the center and augmenting spleen qi. Eaten in abundance, they cause no harm, improving complexion and beautifying the will and nature.\n\nGrapes are sweet and neutral, chiefly augmenting qi, doubling strength, strengthening the will, conferring resistance to hunger and cold, dispelling water between the intestines, and regulating the center. Prolonged consumption lightens the body and extends years.\n\nNectarines are warming, chiefly arresting wasting-thirst and somnolence; they must not be eaten in excess. Raspberry is sweet and neutral, chiefly augmenting qi and lightening the body, preventing the hair from turning white.\n\nSugarcane is sweet and neutral, chiefly augmenting qi, supplementing spleen qi, benefiting the Large Intestine, and quenching thirst. Scallions are acrid and warming, chiefly warming the center, arresting vomiting, and dispelling bad breath.\n\nLotus seeds are cold, chiefly governing insufficiency of the five viscera, damage to the center, and qi collapse, benefiting the twelve channels and twenty-five network vessels, augmenting blood and qi, inducing heart joy, quenching thirst, dispelling heat, supplementing the center, nourishing the spirit, and eliminating the hundred diseases. Prolonged consumption lightens the body, confers resistance to aging, and extends years.\n\nLotus root is cold, chiefly supplementing the center, augmenting qi and strength, nourishing the spirit, dispelling eye diseases, and with prolonged consumption, lightening the body, conferring resistance to aging and hunger, and extending years.\n\nFox nut chiefly supplements the center, cures the hundred diseases, augments essence in males, strengthens the will, and brightens the eyes. Water caltrop is neutral, chiefly pacifying the center, supplementing the viscera, and preventing hunger.\n\nTaro is neutral, chiefly relaxing the abdomen and stomach, dispelling dead flesh, and making one radiant. Water shield is cold, chiefly supplementing the five viscera, brightening the ears and eyes, disinhibiting the joints, freeing the blood vessels, and augmenting the spirit. Prolonged consumption prevents hunger and reverses gray hair.\n\nGoji berries are bitter and cold, chiefly governing malign qi and heat in the five viscera, dispersing qi in the chest and rib-side, dispelling visiting heat, wind impediment, firming sinews and bones, strengthening yin, disinhibiting the Large and Small Intestines, supplementing deficiency and damage, brightening the eyes, and augmenting essence qi. Prolonged consumption lightens the body and confers resistance to cold and heat.\n\nMallow is sweet and cold, harmonizing the Spleen. Prolonged consumption benefits bone qi and serves as the chief of the hundred vegetables. Bamboo shoots are sweet and cold, chiefly dispersing wasting-thirst, disinhibiting the waterways, and augmenting qi and strength; they must not be eaten long-term.\n\nAlfalfa is bitter and cold, benefiting the five viscera, lightening the body, and dispelling malign qi, various heat toxins, and heat from the Spleen and Stomach. It must not be eaten long-term, as it emaciates people.\n\nShepherd’s purse is sweet and warming, chiefly benefiting the Liver viscus, harmonizing the center, and brightening the eyes.\n\nThose who consume elixirs and mineral substances must not eat these foods in excess.\n\nField mustard is bitter and warming, chiefly dispersing food stagnation, downbearing qi, disinhibiting the five viscera, lightening the body, and augmenting qi.\n\nRadish is cold, disinhibiting the five viscera, lightening the body, and augmenting qi. Its root disperses food stagnation, downbears qi, eliminates wind from the five viscera, expels malign qi from the five viscera, and when consumed, whitens the teeth, refines the skin texture, beautifies the complexion, and counteracts calcium toxicity.\n\nWhite lettuce is bitter and cold, chiefly supplementing sinew and strength, disinhibiting the five viscera, freeing the channels and vessels, whitening the teeth, sharpening the senses, and reducing sleep.\n\nThe white part of scallions is acrid, warming, and balanced; consuming it in winter is highly beneficial, though it must not be eaten in excess by those with vacuity.\n\nThe green leaves of scallions are warming and govern the flesh, eliminating malign qi from the Liver, settling the center, disinhibiting the five viscera, augmenting the essence of the eyes, and counteracting the toxicity of the hundred medicinals.\n\nHorseradish is bitter and acrid, harmonizing the Heart and governing the bones, eliminating alternating cold and heat, dispelling water qi, warming the center, dissipating bound qi, lightening the body, and conferring resistance to aging. Those who cultivate the Dao consume it long-term to free the spirit, settle the hun-soul, augment qi and strength, and reconnect sinews and bones.\n\nChinese chives are acrid and sour, warming, governing the Heart and harmonizing the Liver; they may be consumed long-term to settle the five viscera, though they are not beneficial for the sick.\n\nPerilla seeds are acrid, chiefly directing counterflow qi downward, warming the center, and supplementing the marrow. Their leaves harmonize the center and eliminate malodorous qi.\n\nPurple perilla downbears qi and eliminates cold from the center.\n\nPeppermint is bitter and balanced, dispelling kidney qi and resolving taxation fatigue; it is not suitable for those recently ill.\n\nSchizonepeta is bitter and warming, repelling malign qi and eliminating taxation; it is not suitable for long-term consumption.\n\nEupatorium is warming, chiefly dispersing food stagnation, eliminating water retention, and dissipating toxic qi.\n\nCrown daisy is acrid and balanced, chiefly settling the qi of the Heart, nourishing the Spleen and Stomach, and dispersing food and drink; it must not be consumed frequently.\n\nElsholtzia is acrid and warming, dissipating water swelling, checking cholera, and dispelling heat wind; it must not be eaten in excess.\n\nBitter greens are bitter and cold, chiefly eliminating malign qi from the five viscera; prolonged consumption settles the Heart, augments qi, and reduces sleep.\n\nSpinach is balanced, chiefly replenishing the bone marrow, benefiting the five viscera, harmonizing the six bowels, untying bound qi in the channels and network vessels, brightening the ears and eyes, strengthening the bones, reducing sleep, and augmenting the Heart’s power. Prolonged consumption greatly benefits one, lightening the body and preventing aging while increasing resistance to hunger.\n\nFresh ginger is warming, chiefly dispelling phlegm and descending qi, removing foul qi from the chest, opening the spirit’s clarity, dispersing vexation and oppression, and stimulating the appetite.\n\nWater celery is cold, chiefly nourishing the spirit and augmenting strength, fattening and strengthening the body, and neutralizing the toxins of all medicines.\n\nWhite mugwort—now known as green mugwort—is acrid, chiefly supplementing the center and augmenting qi, nourishing the five viscera, promoting hair growth, and darkening it. Prolonged consumption lightens the body and prevents aging.\n\nSmall thistle root is sweet and warming, chiefly nourishing essence and preserving qi, fattening and moistening the body.\n\nWild lettuce is cold; prolonged consumption lightens the body, reduces sleep, harmonizes the twelve channels, and relieves vacuous heat qi from the five viscera. Long-term consumption greatly benefits one.\n\nWild celery is warming, chiefly addressing abdominal fullness, descending qi, dispersing food, and enhancing flavors with its sweet fragrance and savor.\n\n*Yuming* is balanced, chiefly brightening the eyes, lightening the body, and benefiting the five viscera.\n\n*Niulao* is cold, chiefly dispelling heat wind, relieving head and facial vexation and fullness, restoring mobility to the four limbs, and freeing the twelve channels. Prolonged consumption lightens the body.\n\nSpinach is cold, chiefly benefiting the five viscera and freeing the intestines and stomach. It is especially beneficial for those who consume cinnabar and minerals.\n\n*Zhuruoda* is balanced, chiefly supplementing the center, descending qi, and benefiting the five viscera.\n\nGlutinous millet is sweet, acrid, and warming, chiefly harmonizing the Lung and supplementing the center to augment qi.\n\nNon-glutinous rice is sweet, acrid, and bitter, chiefly relieving Heart vexation, stopping thirst, augmenting qi, halting diarrhea, harmonizing Stomach qi, and promoting muscle growth.\n\nStored non-glutinous rice chiefly supplements the center and augments qi, strengthens the sinews and bones, and frees the blood vessels. When cooked rice is soaked in water until sour and then consumed, it relaxes the qi of the five viscera and six bowels.\n\nWhite millet is sweet and cold, chiefly dispelling guest heat from the chest, harmonizing the five viscera and six bowels, and mending the sinews and bones. It may be consumed long-term.\n\nMillet is salty and cold, chiefly nourishing Kidney qi, dispelling bone impediment and heat in the center, and augmenting strength. Aged millet stops diarrhea and counteracts cinnabar and mineral toxins.\n\nSesame is sweet, chiefly augmenting strength and qi, promoting muscle growth, replenishing the bone marrow, strengthening the sinews and bones, treating metal wounds, and stopping pain. Prolonged consumption lightens the body and prolongs life.\n\nMung beans are sweet and sour, chiefly addressing vacuity emaciation, supplementing the five internal organs’ vacuity and fatigue, augmenting qi, settling the spirit, and coursing the twelve channels. Consumption thickens the Spleen and widens the abdomen; they may be consumed long-term.\n\nBarley is salty and cold, chiefly harmonizing the Heart, relieving wasting-thirst, dispelling vexation and heat, and augmenting and harmonizing the center. Prolonged consumption prevents graying hair.\n\nBuckwheat is sweet and cold, chiefly lightening the body and dispelling heat. Prolonged consumption increases strength and promotes vigorous movement. Among the five grains, buckwheat is supreme.\n\nWheat is sweet and cold, chiefly nourishing Liver qi, dispelling cold and heat, stopping thirst and vexation, supplementing the center and augmenting qi, harmonizing the five viscera, and regulating the channels and network vessels.\n\nCoix seed is sweet and warming, chiefly addressing sinew tension and hypertonicity, enduring wind-damp impediment, and descending qi. Prolonged consumption lightens the body, augments qi, dispels malign qi from the sinews and bones, frees the intestines and stomach, disperses water swelling, and increases appetite.\n\nRice is sweet and neutral, chiefly augmenting qi, supplementing the center, and harmonizing Spleen and Stomach qi.\n\nWhite beans are neutral, supplementing the five viscera, benefiting the center, and assisting the twelve channels. They may be consumed long-term.\n\nMalt sugar is sweet and warming, chiefly supplementing deficiency and fatigue, augmenting heart power, stopping thirst, treating throat and pharynx pain, and eliminating blood in saliva.\n\n**Monthly Dietary Guide**\n\nMaster Sixian asked: \"I have heard of foods suitable for each lunar station. I wish to be granted this method.\"\n\nThe Perfected One replied: \"Each lunar station has its corresponding suitable foods. If one selects and consumes them, they may also dispel illnesses. I now transmit this to you, that you may enlighten future generations.\"\n\n*The Treatise on Nourishing Life* states:\nIn the first month, on the *mao* day, consume copper fish to prevent epidemic diseases.\nIn the second month, at the Spring Equinox, consume tortoise to prevent roundworms and ensure descendants flourish.\nIn the third month, when the station is *Bi*, consume sturgeon to prevent infatuation with beauty and increase vigor. Observe two days before and after.\nIn spring’s three months, consume dog meat, and eat wheat before sour foods to prevent dental diseases. Prepare these on *jia* and *yi* days.\nIn the fourth month, when the station is *Xu*, consume parrot to brighten the eyes.\nIn the fifth month, at the Summer Solstice, consume mandarin duck. Observe two days before and after. Consume partridge, observing ten days before and after.\nIn the sixth month, when the station is *Fang*, consume wild pheasant to enhance yang and ensure descendants. In summer’s three months, consume pheasant and bitter foods, eating wheat first to prevent miasmic diseases. Prepare these on *bing* and *ding* days.\nIn the seventh month, consume *du* to promote descendants. Observe two days before and after. *Du* refers to wood scorpions.\nIn the eighth month, at the Autumn Equinox, consume *du* to prevent licentiousness, so that others hold one in awe. Observe two days before and after.\nIn the ninth month, when the station is *Jianxing*, consume wild goose to prevent miasmic diseases. On auspicious days, it strengthens sinews and bones. Observe two days before and after. In autumn’s three months, consume horse meat and pungent foods to prevent cold diseases. Prepare these on *geng* and *xin* days.\nIn the tenth month, when the station is *Yingshi*, consume various crows to refine the heart, prolong life, and enhance beauty. Observe two days before and after.\nIn the eleventh month, at the Winter Solstice, consume rabbit to prevent roundworms and ensure agile feet.\nOn the twelfth month’s sacrificial night, have someone hold pepper beside the well without speaking to others, then place the pepper into the well to dispel epidemic diseases. In winter’s three months, consume glutinous foods and salty flavors to prevent foot diseases. Prepare these on *ren* and *gui* days.\nRegularly, in the final three days of each month, eat at midnight without satiation.\n\n*Secret Records of Cultivating the Real* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "修真秘录 经名：修真秘录。 宋·符度扛撰。 一卷。 底本出处：《正统道藏》洞神部方法类。 修真秘录 前商州丰阳县主簿符度仁纂 食宜篇 思仙问曰：夫修养之士，何物所宜食之充饥得不伤损矣？ 真人曰：酸咸甘苦食之，各归其时，春夏秋冬顺之，勿逆其藏。 所食大过，成疾亦探。 节戒作方，延益无限。 其伤损之事，前已具言； 延益之宜，今为子说。 无令脱略，子宜志之。 《八素》云：春宜食辛，辛能散也。 夏宜食咸，咸能润也。 长夏宜食酸，酸能收也。 秋宜食苦，苦能坚也。 冬宜食甘肥，甘能缓中而长肌肉，肥能密理而补中。 皆益五藏而散邪气矣。 此四时之味，随所宜加之，食皆能益藏而除於邪，养生之道，可不移矣。 《礼记·内则》云：凡和春多酸，夏多苦，秋多辛，冬多咸，调以滑甘。 注云：多其时味以养其气也。 经曰：春无食酸，夏无食苦。 四时各臧时味者，谓气壮也。 减其时味以杀盛气，《内则》所云多其时味，恐气虚赢，故多其时味以养其气也。 《内则》云：春宜羔豚膳膏邮，春为木王。 膏狮，牛膏也。 牛中央土畜，木克土，木盛则土休废，用休废之膏，以节其气，故用牛膏邻也。 夏宜踞绣所留切膳膏躁，踞，乾雉也。 锈，乾鱼也。 躁，犬膏也。 犬属西方金也。 夏属南方火，火克金，火盛则金休废，故用犬膏，躁以节气也，秋宜犊尘膳膏腥膏腥，鹦也。 鹦属东方木，秋属西方金，金克木，金盛则木休废，故用鹦膏腥也。 冬宜鲜羽膳膏膻。 膏膻，羊也。 羊属南方火，冬属北方水，水克火，水盛则火休废，故用休废膏膻也。 郑云：彼羔豚物，生而肥。 犊尘物，盛而充。 踞绣膜呼早切，热而乾。 鱼雁水涸而性定。 此八物得四时之气，尤为人食之不胜。 是以用休废之脂膏煎和善之也。 凡牛宜徐，羊宜黍，豕宜稷，犬宜粱，鱼宜瓜，言其气味相成也。 《周礼·天官》云：凡食齐听音视春时，饭宜温也。 羹齐胝夏时，羹宜热也。 酱齐听秋时，酱宜冻也。 饮齐胝冬时。 饮宜寒也。 《太素》云：肝色青，宜食甘。 粳米饭、牛肉、枣，皆甘。 心色赤，宜食酸。 麻、犬肉、李，皆酸。 脾色黄，宜食咸。 大豆、猜肉、栗，皆咸。 肺色白，宜食苦。 麦、羊肉、杏、皆苦。 肾色黑，宜食辛。 黄黍、鹦肉、桃，皆辛。 又肝病者，宜食麻、麦、犬肉、李、韭。 心病者，宜食麦、羊肉、杳、球。 脾病者，宜食粳米、牛肉、枣、葵。 肺病者，宜食黄黍、鹦肉、桃、葱。 肾病者，宜食大豆、黄黍、猜肉、栗、蕾。 是故谨和五味，则骨正筋柔，气血以流，胜理以密。 如是则气骨以精。",
      "translated_text": "**Esoteric Records of Cultivating the Dao**\n*Title: Esoteric Records of Cultivating the Dao*\n*Author: Fu Dukang of the Song Dynasty*\n*One fascicle*\n*Source text: \"Daoist Canon of the Zhengtong Era,\" Dongshen Section, Methods Category*\n\n**Esoteric Records of Cultivating the Dao**\n*Compiled by Fu Duren, Former Registrar of Fengyang County in Shang Prefecture*\n\n**On Dietary Suitability**\n\n**Question from the Aspiring Immortal:** For those who cultivate and nourish themselves, what foods may they consume to sate hunger without causing harm?\n\n**Response from the Perfected One:** Sour, salty, sweet, and bitter foods—each belongs to its proper season. Follow the sequence of spring, summer, autumn, and winter; do not act contrary to the organs. Excess in consumption leads to illness, just as moderation in restraint yields boundless benefit. The harms of improper diet have already been expounded; the benefits of suitable nourishment shall now be explained to you. Do not neglect these teachings—take them to heart.\n\nThe *Eight Essentials* states:\n- In spring, consume pungent foods, for pungency disperses.\n- In summer, consume salty foods, for saltiness moistens.\n- In late summer, consume sour foods, for sourness astringes.\n- In autumn, consume bitter foods, for bitterness firms.\n- In winter, consume sweet and rich foods, for sweetness harmonizes the center and promotes flesh, while richness seals the interstices and supplements the center.\n\nAll these benefit the five viscera and dispel pathogenic qi. These flavors of the four seasons, applied according to their suitability, nourish the organs, expel pathogens, and embody the Dao of nurturing life—unalterable in principle.\n\nThe *Rites*’ *Nei Ze* states: \"In harmonizing flavors, spring favors sourness, summer favors bitterness, autumn favors pungency, and winter favors saltiness, tempered with smooth and sweet.\" The commentary explains: \"Emphasize the flavors of the season to nourish their corresponding qi.\"\n\nThe classics say: \"In spring, avoid sour foods; in summer, avoid bitter foods.\" For each of the four seasons, store the season’s flavors—this refers to the vigor of qi. Reduce the season’s flavors to subdue excess qi. The *Nei Ze*’s emphasis on seasonal flavors addresses the fear of qi deficiency and emaciation, thus augmenting the season’s flavors to nourish qi.\n\nThe *Nei Ze* further states:\n- In spring, consume lamb, suckling pig, and the fat of *you* (ox fat). Spring corresponds to the flourishing of Wood. *Gao shi* (ox fat) pertains to the Earth phase of the central Ox. Wood restrains Earth; when Wood is abundant, Earth becomes dormant. Thus, the dormant fat is used to moderate qi, hence the use of ox fat.\n- In summer, consume *ju* (dried pheasant), *xiu* (dried fish), and *zao* (dog fat). *Ju* is dried pheasant; *xiu* is dried fish; *zao* is dog fat. The Dog belongs to the Metal phase of the West. Summer belongs to the Fire phase of the South. Fire restrains Metal; when Fire is abundant, Metal becomes dormant. Thus, dog fat is used to moderate qi.\n- In autumn, consume calf, *chen* (dust), and the fat of *xing* (goose fat). *Xing* is goose, which belongs to the Wood phase of the East. Autumn belongs to the Metal phase of the West. Metal restrains Wood; when Metal is abundant, Wood becomes dormant. Thus, goose fat is used.\n- In winter, consume *xian yu* (fresh game) and the fat of *shan* (mutton). *Gao shan* (mutton fat) pertains to the Sheep, which belongs to the Fire phase of the South. Winter belongs to the Water phase of the North. Water restrains Fire; when Water is abundant, Fire becomes dormant. Thus, dormant mutton fat is used.\n\nZheng (Xuan) comments: \"Lamb and suckling pig are plump at birth. Calf and *chen* are robust and full. *Ju* and *xiu* are dried by heat. Fish and wild geese settle when waters recede. These eight foods embody the qi of the four seasons and are especially suitable for human consumption. Thus, the dormant fats are used to harmonize and refine them.\"\n\nGenerally:\n- Ox pairs well with millet,\n- Sheep with glutinous millet,\n- Pig with broomcorn millet,\n- Dog with sorghum,\n- Fish with melon—\n\nfor their qi and flavors complement one another.\n\nThe *Rites of Zhou*’s *Offices of Heaven* states:\n- For grain-based meals (*shi qi*), observe spring’s warmth—rice should be warm.\n- For broths (*geng qi*), observe summer’s heat—broths should be hot.\n- For sauces (*jiang qi*), observe autumn’s coolness—sauces should be chilled.\n- For beverages (*yin qi*), observe winter’s cold—drinks should be cold.\n\nThe *Great Essentials* states:\n- The Liver is green; it benefits from sweetness. Polished rice, beef, and jujubes are sweet.\n- The Heart is red; it benefits from sourness. Sesame, dog meat, and plums are sour.\n- The Spleen is yellow; it benefits from saltiness. Soybeans, pork, and chestnuts are salty.\n- The Lungs are white; they benefit from bitterness. Wheat, mutton, and apricots are bitter.\n- The Kidneys are black; they benefit from pungency. Yellow millet, goose meat, and peaches are pungent.\n\nFor ailments of the:\n- Liver, consume sesame, wheat, dog meat, plums, and leeks.\n- Heart, consume wheat, mutton, apricots, and *qiu* (a type of vegetable).\n- Spleen, consume polished rice, beef, jujubes, and mallow.\n- Lungs, consume yellow millet, goose meat, peaches, and scallions.\n- Kidneys, consume soybeans, yellow millet, pork, chestnuts, and *lei* (a type of vegetable).\n\nThus, by carefully harmonizing the five flavors, the bones become straight, the sinews supple, qi and blood flow smoothly, and the interstices are sealed. In this way, qi and bones are refined.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 998,
      "start_sentence": 0,
      "end_sentence": 67,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.081684112548828,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\修真秘录—宋.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "谨道如法，长有天命。 羊肉大热，羊头肉平，主风眩，疫疾。 羊肚，主补胃虚损，小便数，止虚汗。 羊乳酪，补肺利大肠。 羊肾，补虚弱，益髓。 犬肉，温。 主补五脏劳伤。 久服，益气力，厚肠胃，实下焦，填骨髓。 不可炙食。 牛肉，平。 牛乳，甘寒。 主补虚赢，止渴。 牛酪，主寒热，止渴，除胸中热。 牛酥，寒。 淘胸其客气，利大小肠。 鹿头肉，主消渴及多梦。 鹿肉，主补中，益气力。 鹿蹄肉，主骨髓中疼痛。 鹿久食令人耐寒。 獐肉，补五脏。 从八月到十一月食，胜羊肉。 驴肉，主风狂，忧愁不乐，能安心气。 端肉，主久水胀垂死，作羹食之大效。 豹肉，温酸。 主强筋骨志性。 谓肉，平。 食之肥下焦，强胃气，能食。 雄鹦肉，酸温。 主下气，去狂邪，安五脏、肠中消渴。 乌雄鹦肉，甘温。 主补中，止痛，除心腹恶气。 乌雌鹦肉，味平甘。 主除风寒湿痹，五缓六急，安胎及乳瘫。 雁肉，味甘平。 主益气，轻身。 久服长发，耐老不饥。 白鸭肉，。 平。 主补虚赢，消毒热，和藏府，利水道。 黑鸭不可食。 野鸭肉，味咸寒。 主补中益气，和藏府，除客热，消食。 九月后好食，消腹中虫，平胃气，调中，轻身。 可长食之，胜家鸭。 鹑，温。 补五藏，益中续气，实筋骨，耐寒暑，消结实。 长食令人不厌，四月已后，八月已前不中食。 乾枣，味甘，辛温。 主心腹邪气，安中，养脾气，助十二经脉，通九窍，补少津液，大惊强志。 久服轻身，延年不饥，成仙。 栗，味咸，温。 主益气，厚肠胃，补肾，令人耐饥。 生食，治腰脚，不宜蒸食。 柿，味甘寒。 补虚劳不足。 乾者厚肠胃，健脾气，消宿血。 红柿，至补肺气，续经络气。 橘子，味酸寒。 主下气，开胸膈痰疾结气，止渴。 久服，除口臭，轻身长年。 皮陈久者良。 乌梅，味苦，平。 主下气，除烦热，安心神，支体疼痛，偏枯不仁，止下痢，好睡，口乾。 捺，寒。 益心气，补中焦不足。 樱桃，平。 主调中，益脾气。 多食无损，令人好颜色，美志性。 蒲桃，味甘平。 主益气，倍力强志，耐饥寒，去肠问水，调中。 久服之，轻身延年。 林擒，温。 主止消渴，好睡，不可多食。 覆盆子，味甘平。 主益气轻身，令人发不白。 甘蔗，味甘平。 主益气，补脾气，利大肠，止渴。 豆葱，味辛温。 主温中，止呕吐，口臭。 莲子，寒。 主五藏不足，伤中气绝，利益十二经脉、二十五络，益血气，食之心欢，止渴，去热，补中，养神，除百病。 久服轻身，耐老延年。 藕，寒，主补中，益气力，养精神，除目病，久服轻身，耐老不饥，延年。 鸡头实，主补中，愈百病，益子精，强志，明目。 菱实，平。 主安中，补藏，令人不饥。 芋，平。 主宽缓腹胃，除死肌，令人悦泽。 档，寒。 主补五藏，明耳目，利关节，通血脉，益精神。 久食不饥，变白发。 枸杞，味苦寒。 主五内邪气热中，消胸胁气，除客热风痹，坚筋骨，强阴，利大小肠，补虚损，明目，益精气。 久服轻身，耐寒暑。 葵，味甘寒。 宜脾。 久食利骨气，为百菜主。 竹笑，味甘寒。 主消渴，利水道，益气力，不可久食。 苜蓿，味苦寒。 利五藏，轻身，去脾胃邪气诸热毒。 不可久食，瘦人。 荠，味甘温。 主利肝藏，和中，明目。",
      "translated_text": "Carefully following the Dao/Way in accordance with its principles ensures the enduring fulfillment of Heaven’s mandate.\n\nMutton is highly warming; sheep’s head meat is neutral and governs dizziness from wind and epidemic illnesses. Sheep’s tripe strengthens stomach deficiency and damage, reduces frequent urination, and arrests spontaneous sweating. Sheep’s milk and cheese fortify the Lungs and benefit the Large Intestine. Sheep’s kidneys supplement deficiency and weakness, enriching the marrow.\n\nDog meat is warming and chiefly repairs the five viscera from taxation and injury. With prolonged consumption, it augments qi and strength, thickens the intestines and stomach, consolidates the lower burner, and fills the bone marrow. It must not be eaten roasted.\n\nBeef is neutral. Cow’s milk is sweet and cold, chiefly supplementing deficiency and emaciation while quenching thirst. Cow’s cheese governs alternating chills and fever, quenches thirst, and dispels heat in the chest. Cow’s ghee is cold, dispelling stagnant qi in the chest and benefiting the Large and Small Intestines.\n\nDeer’s head meat governs wasting-thirst and excessive dreaming. Deer meat chiefly supplements the center and augments qi and strength. Deer shank meat governs pain in the bone marrow. Prolonged consumption of deer meat makes one resistant to cold.\n\nRiver deer meat supplements the five viscera. Eaten from the eighth to the eleventh month, it surpasses mutton. Donkey meat governs manic wind, melancholy, and unhappiness, calming the heart’s qi. Beaver meat governs long-standing water distension near death; made into a thick soup, it is highly effective. Leopard meat is warming and sour, chiefly strengthening sinews, bones, will, and nature.\n\nRabbit meat is neutral; consuming it fattens the lower burner, strengthens stomach qi, and increases appetite. Male goose meat is sour and warming, chiefly descending qi, dispelling manic evil, and pacifying the five viscera and intestines while relieving wasting-thirst. Black male goose meat is sweet and warming, chiefly supplementing the center, arresting pain, and dispelling malign qi from the heart and abdomen. Black female goose meat is neutral and sweet, chiefly dispelling wind-cold-damp impediment, slackness and tension of the five, calming the fetus, and treating breast abscesses.\n\nWild goose meat is sweet and neutral, chiefly augmenting qi and lightening the body. Prolonged consumption promotes hair growth, confers resistance to aging, and prevents hunger. White duck meat is neutral, chiefly supplementing deficiency and emaciation, resolving toxic heat, harmonizing the viscera and bowels, and disinhibiting the waterways. Black duck must not be eaten.\n\nWild duck meat is salty and cold, chiefly supplementing the center and augmenting qi, harmonizing the viscera and bowels, dispelling visiting heat, and dispersing food. Best eaten after the ninth month, it expels abdominal worms, balances stomach qi, regulates the center, lightens the body, and may be consumed long-term, surpassing domestic duck.\n\nQuail is warming, supplementing the five viscera, augmenting the center and replenishing qi, solidifying sinews and bones, conferring resistance to cold and heat, and dispersing accumulations and concretions. Prolonged consumption does not induce aversion; it must not be eaten from the fourth to the eighth month.\n\nDried jujubes are sweet, acrid, and warming, chiefly governing malign qi in the heart and abdomen, pacifying the center, nourishing spleen qi, aiding the twelve channels, freeing the nine orifices, supplementing scant fluids, and calming great fright while strengthening the will. Prolonged consumption lightens the body, extends years, prevents hunger, and leads to immortality.\n\nChestnuts are salty and warming, chiefly augmenting qi, thickening the intestines and stomach, supplementing the Kidneys, and making one resistant to hunger. Eaten raw, they treat lumbar and leg ailments; they must not be steamed.\n\nPersimmons are sweet and cold, supplementing deficiency taxation and insufficiency. Dried persimmons thicken the intestines and stomach, fortify spleen qi, and disperse static blood. Red persimmons supremely supplement Lung qi and reconnect the qi of the channels and network vessels.\n\nMandarins are sour and cold, chiefly descending qi, opening the chest and diaphragm, dispersing phlegm and qi bind, and quenching thirst. Prolonged consumption dispels bad breath, lightens the body, and extends years. The peel is best when aged.\n\nDark plums are bitter and neutral, chiefly descending qi, dispelling vexing heat, pacifying the heart spirit, relieving pain in the limbs and trunk, treating hemiplegia and numbness, arresting diarrhea, curing somnolence, and relieving dry mouth.\n\nHawthorn is cold, benefiting heart qi and supplementing insufficiency in the middle burner. Cherries are neutral, chiefly regulating the center and augmenting spleen qi. Eaten in abundance, they cause no harm, improving complexion and beautifying the will and nature.\n\nGrapes are sweet and neutral, chiefly augmenting qi, doubling strength, strengthening the will, conferring resistance to hunger and cold, dispelling water between the intestines, and regulating the center. Prolonged consumption lightens the body and extends years.\n\nNectarines are warming, chiefly arresting wasting-thirst and somnolence; they must not be eaten in excess. Raspberry is sweet and neutral, chiefly augmenting qi and lightening the body, preventing the hair from turning white.\n\nSugarcane is sweet and neutral, chiefly augmenting qi, supplementing spleen qi, benefiting the Large Intestine, and quenching thirst. Scallions are acrid and warming, chiefly warming the center, arresting vomiting, and dispelling bad breath.\n\nLotus seeds are cold, chiefly governing insufficiency of the five viscera, damage to the center, and qi collapse, benefiting the twelve channels and twenty-five network vessels, augmenting blood and qi, inducing heart joy, quenching thirst, dispelling heat, supplementing the center, nourishing the spirit, and eliminating the hundred diseases. Prolonged consumption lightens the body, confers resistance to aging, and extends years.\n\nLotus root is cold, chiefly supplementing the center, augmenting qi and strength, nourishing the spirit, dispelling eye diseases, and with prolonged consumption, lightening the body, conferring resistance to aging and hunger, and extending years.\n\nFox nut chiefly supplements the center, cures the hundred diseases, augments essence in males, strengthens the will, and brightens the eyes. Water caltrop is neutral, chiefly pacifying the center, supplementing the viscera, and preventing hunger.\n\nTaro is neutral, chiefly relaxing the abdomen and stomach, dispelling dead flesh, and making one radiant. Water shield is cold, chiefly supplementing the five viscera, brightening the ears and eyes, disinhibiting the joints, freeing the blood vessels, and augmenting the spirit. Prolonged consumption prevents hunger and reverses gray hair.\n\nGoji berries are bitter and cold, chiefly governing malign qi and heat in the five viscera, dispersing qi in the chest and rib-side, dispelling visiting heat, wind impediment, firming sinews and bones, strengthening yin, disinhibiting the Large and Small Intestines, supplementing deficiency and damage, brightening the eyes, and augmenting essence qi. Prolonged consumption lightens the body and confers resistance to cold and heat.\n\nMallow is sweet and cold, harmonizing the Spleen. Prolonged consumption benefits bone qi and serves as the chief of the hundred vegetables. Bamboo shoots are sweet and cold, chiefly dispersing wasting-thirst, disinhibiting the waterways, and augmenting qi and strength; they must not be eaten long-term.\n\nAlfalfa is bitter and cold, benefiting the five viscera, lightening the body, and dispelling malign qi, various heat toxins, and heat from the Spleen and Stomach. It must not be eaten long-term, as it emaciates people.\n\nShepherd’s purse is sweet and warming, chiefly benefiting the Liver viscus, harmonizing the center, and brightening the eyes.",
      "overlap_context": "d leeks.\n- Heart, consume wheat, mutton, apricots, and *qiu* (a type of vegetable).\n- Spleen, consume polished rice, beef, jujubes, and mallow.\n- Lungs, consume yellow millet, goose meat, peaches, and scallions.\n- Kidneys, consume soybeans, yellow millet, pork, chestnuts, and *lei* (a type of vegetable).\n\nThus, by carefully harmonizing the five flavors, the bones become straight, the sinews supple, qi and blood flow smoothly, and the interstices are sealed. In this way, qi and bones are refined.",
      "start_char": 998,
      "end_char": 2321,
      "start_sentence": 68,
      "end_sentence": 171,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.48180890083313,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\修真秘录—宋.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "服丹石人，不可多食。 蔓菁，味苦温。 主消食下气，利五藏，轻身益气。 萝卜，寒。 利五藏，轻身，益气。 根，消食下气，除五藏中风，炼五藏中恶气，服之令人白今，细肌理，美颜色，制钙毒。 白苣，味苦寒。 主补筋力，利五藏，通经脉，令人齿白，聪明，少睡。 葱白，味辛，温平。 冬月食之甚益人，不可多食，虚人。 葱青叶，温，归肉。 除肝邪，安中，利五藏，益目精，杀百药毒。 越，味苦辛。 宜心，归骨。 除寒热，去水气，温中，散结气，轻身耐老。 学道人长服之，通神安魂，益气力，续筋骨。 韭味辛酸，温。 归心，宜肝。 可久食，安五藏，不利病人。 荏子，味辛。 主咳逆，下气，温中，补髓。 叶调中，却臭气。 紫苏，下气，除寒中。 薄荷，味苦，平。 却肾气，解劳乏。 新病人不宜食。 刻芥，味苦温。 辟邪气，除劳。 不宜久食。 兰香，温。 主消食，去停水，散毒气。 筒蒿，味辛平。 主安心气，养脾胃，消饮食。 不可频食。 香需，味辛温。 散水肿，止霍乱，去热风。 不可多食。 苦菜，味苦寒。 主五藏邪气。 久服安心，益气，少卧。",
      "translated_text": "Those who consume elixirs and mineral substances must not eat these foods in excess.\n\nField mustard is bitter and warming, chiefly dispersing food stagnation, downbearing qi, disinhibiting the five viscera, lightening the body, and augmenting qi.\n\nRadish is cold, disinhibiting the five viscera, lightening the body, and augmenting qi. Its root disperses food stagnation, downbears qi, eliminates wind from the five viscera, expels malign qi from the five viscera, and when consumed, whitens the teeth, refines the skin texture, beautifies the complexion, and counteracts calcium toxicity.\n\nWhite lettuce is bitter and cold, chiefly supplementing sinew and strength, disinhibiting the five viscera, freeing the channels and vessels, whitening the teeth, sharpening the senses, and reducing sleep.\n\nThe white part of scallions is acrid, warming, and balanced; consuming it in winter is highly beneficial, though it must not be eaten in excess by those with vacuity.\n\nThe green leaves of scallions are warming and govern the flesh, eliminating malign qi from the Liver, settling the center, disinhibiting the five viscera, augmenting the essence of the eyes, and counteracting the toxicity of the hundred medicinals.\n\nHorseradish is bitter and acrid, harmonizing the Heart and governing the bones, eliminating alternating cold and heat, dispelling water qi, warming the center, dissipating bound qi, lightening the body, and conferring resistance to aging. Those who cultivate the Dao consume it long-term to free the spirit, settle the hun-soul, augment qi and strength, and reconnect sinews and bones.\n\nChinese chives are acrid and sour, warming, governing the Heart and harmonizing the Liver; they may be consumed long-term to settle the five viscera, though they are not beneficial for the sick.\n\nPerilla seeds are acrid, chiefly directing counterflow qi downward, warming the center, and supplementing the marrow. Their leaves harmonize the center and eliminate malodorous qi.\n\nPurple perilla downbears qi and eliminates cold from the center.\n\nPeppermint is bitter and balanced, dispelling kidney qi and resolving taxation fatigue; it is not suitable for those recently ill.\n\nSchizonepeta is bitter and warming, repelling malign qi and eliminating taxation; it is not suitable for long-term consumption.\n\nEupatorium is warming, chiefly dispersing food stagnation, eliminating water retention, and dissipating toxic qi.\n\nCrown daisy is acrid and balanced, chiefly settling the qi of the Heart, nourishing the Spleen and Stomach, and dispersing food and drink; it must not be consumed frequently.\n\nElsholtzia is acrid and warming, dissipating water swelling, checking cholera, and dispelling heat wind; it must not be eaten in excess.\n\nBitter greens are bitter and cold, chiefly eliminating malign qi from the five viscera; prolonged consumption settles the Heart, augments qi, and reduces sleep.",
      "overlap_context": "ots are sweet and cold, chiefly dispersing wasting-thirst, disinhibiting the waterways, and augmenting qi and strength; they must not be eaten long-term.\n\nAlfalfa is bitter and cold, benefiting the five viscera, lightening the body, and dispelling malign qi, various heat toxins, and heat from the Spleen and Stomach. It must not be eaten long-term, as it emaciates people.\n\nShepherd’s purse is sweet and warming, chiefly benefiting the Liver viscus, harmonizing the center, and brightening the eyes.",
      "start_char": 2321,
      "end_char": 2784,
      "start_sentence": 172,
      "end_sentence": 211,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.989050149917603,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\修真秘录—宋.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "轻身不老，耐饥。 蓝菜，平。 主填骨髓，利五藏，调六府，理经络结气，明耳目，使人骨健少睡，益心力。 久食大益人。 生姜，温。 去痰下气，去胸中臭气，通神明，散烦闷，开胃口。 水芹，寒。 养神益力，令人肥健，杀百药毒。 白蒿今青蒿也，味辛。 主补中益气，养五藏，长毛发，令黑。 久服轻身不老。 小蓟根，味甘温。 主养精保气，令人肥泽。 野苣，寒。 久食轻身，少睡，调十二经脉，利五藏虚热气。 长食，甚益人。 马芹，温。 主心腹满，下气消食，能调味，甘香美。 庾明，平。 主明目，轻身，利五藏。 牛劳，寒。 主去热风，头面烦满，四支不遂，通十二经脉。 久服轻身。 菠菱，寒。 主利五藏，通肠胃。 服丹石人食之甚良。 朱若达，平。 主补中下气，利五藏。 白黍米，味甘，辛温。 宜肺，主补中益气。 杭米，味甘，辛苦。 主心烦，止渴，益气，断下利，平胃气，长肌肉。 仓粳米，主补中益气，坚筋骨，通血脉。 炊饭水浸令酸，食之，缓五藏六腑气。 白粱米，味甘寒。 除胸中客热移易五藏六腑，续筋骨，可长食之。 粟米，味咸寒。 主养肾气，去骨痹热中，益气力。 陈者止利，压丹石毒。 胡麻，味甘。 主益力气，长肌肉，填骨髓，坚筋骨，治金疮，止痛。 久服轻身长年。 绿豆，味甘酸。 主虚赢，补五内虚乏，益气，安精神，行十二经脉。 食之脾厚肚宽，可长食之。 大麦，味咸寒。 宜心，主消渴，除烦热，益气调中。 久食，头不白。 积麦，味甘寒。 主轻身，除热。 久食令人多力健行。 五谷之中积麦为上。 小麦，味甘寒。 主养肝气，去寒热，止渴烦，补中益气，和五藏，调经络。 苍茧仁，味甘温。 主筋急拘挛，久风湿痹，下气。 久服，轻身益气，除筋骨中邪气，利肠胃，消水肿，令人能食。",
      "translated_text": "Spinach is balanced, chiefly replenishing the bone marrow, benefiting the five viscera, harmonizing the six bowels, untying bound qi in the channels and network vessels, brightening the ears and eyes, strengthening the bones, reducing sleep, and augmenting the Heart’s power. Prolonged consumption greatly benefits one, lightening the body and preventing aging while increasing resistance to hunger.\n\nFresh ginger is warming, chiefly dispelling phlegm and descending qi, removing foul qi from the chest, opening the spirit’s clarity, dispersing vexation and oppression, and stimulating the appetite.\n\nWater celery is cold, chiefly nourishing the spirit and augmenting strength, fattening and strengthening the body, and neutralizing the toxins of all medicines.\n\nWhite mugwort—now known as green mugwort—is acrid, chiefly supplementing the center and augmenting qi, nourishing the five viscera, promoting hair growth, and darkening it. Prolonged consumption lightens the body and prevents aging.\n\nSmall thistle root is sweet and warming, chiefly nourishing essence and preserving qi, fattening and moistening the body.\n\nWild lettuce is cold; prolonged consumption lightens the body, reduces sleep, harmonizes the twelve channels, and relieves vacuous heat qi from the five viscera. Long-term consumption greatly benefits one.\n\nWild celery is warming, chiefly addressing abdominal fullness, descending qi, dispersing food, and enhancing flavors with its sweet fragrance and savor.\n\n*Yuming* is balanced, chiefly brightening the eyes, lightening the body, and benefiting the five viscera.\n\n*Niulao* is cold, chiefly dispelling heat wind, relieving head and facial vexation and fullness, restoring mobility to the four limbs, and freeing the twelve channels. Prolonged consumption lightens the body.\n\nSpinach is cold, chiefly benefiting the five viscera and freeing the intestines and stomach. It is especially beneficial for those who consume cinnabar and minerals.\n\n*Zhuruoda* is balanced, chiefly supplementing the center, descending qi, and benefiting the five viscera.\n\nGlutinous millet is sweet, acrid, and warming, chiefly harmonizing the Lung and supplementing the center to augment qi.\n\nNon-glutinous rice is sweet, acrid, and bitter, chiefly relieving Heart vexation, stopping thirst, augmenting qi, halting diarrhea, harmonizing Stomach qi, and promoting muscle growth.\n\nStored non-glutinous rice chiefly supplements the center and augments qi, strengthens the sinews and bones, and frees the blood vessels. When cooked rice is soaked in water until sour and then consumed, it relaxes the qi of the five viscera and six bowels.\n\nWhite millet is sweet and cold, chiefly dispelling guest heat from the chest, harmonizing the five viscera and six bowels, and mending the sinews and bones. It may be consumed long-term.\n\nMillet is salty and cold, chiefly nourishing Kidney qi, dispelling bone impediment and heat in the center, and augmenting strength. Aged millet stops diarrhea and counteracts cinnabar and mineral toxins.\n\nSesame is sweet, chiefly augmenting strength and qi, promoting muscle growth, replenishing the bone marrow, strengthening the sinews and bones, treating metal wounds, and stopping pain. Prolonged consumption lightens the body and prolongs life.\n\nMung beans are sweet and sour, chiefly addressing vacuity emaciation, supplementing the five internal organs’ vacuity and fatigue, augmenting qi, settling the spirit, and coursing the twelve channels. Consumption thickens the Spleen and widens the abdomen; they may be consumed long-term.\n\nBarley is salty and cold, chiefly harmonizing the Heart, relieving wasting-thirst, dispelling vexation and heat, and augmenting and harmonizing the center. Prolonged consumption prevents graying hair.\n\nBuckwheat is sweet and cold, chiefly lightening the body and dispelling heat. Prolonged consumption increases strength and promotes vigorous movement. Among the five grains, buckwheat is supreme.\n\nWheat is sweet and cold, chiefly nourishing Liver qi, dispelling cold and heat, stopping thirst and vexation, supplementing the center and augmenting qi, harmonizing the five viscera, and regulating the channels and network vessels.\n\nCoix seed is sweet and warming, chiefly addressing sinew tension and hypertonicity, enduring wind-damp impediment, and descending qi. Prolonged consumption lightens the body, augments qi, dispels malign qi from the sinews and bones, frees the intestines and stomach, disperses water swelling, and increases appetite.",
      "overlap_context": "nd dissipating toxic qi.\n\nCrown daisy is acrid and balanced, chiefly settling the qi of the Heart, nourishing the Spleen and Stomach, and dispersing food and drink; it must not be consumed frequently.\n\nElsholtzia is acrid and warming, dissipating water swelling, checking cholera, and dispelling heat wind; it must not be eaten in excess.\n\nBitter greens are bitter and cold, chiefly eliminating malign qi from the five viscera; prolonged consumption settles the Heart, augments qi, and reduces sleep.",
      "start_char": 2784,
      "end_char": 3510,
      "start_sentence": 212,
      "end_sentence": 268,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.54623508453369,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\修真秘录—宋.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "秆米，味甘平。 主益气，补中，利脾胃气。 白豆，平。 补五藏，益中，助十二经脉，可长食之。 饴糖，味甘温。 主补虚乏，益心力，止渴，治喉咽痛，除唾血。 月宜篇 思仙问曰：尝闻月宿所宜食者，愿赐其法。 真人曰：每月宿下，各有所宜之物，人若择而食之，亦可除其疾疹矣。 今传於子，亦可晓示将来。 《养生论》云：正月卯日食铜鱼，使人无瘟病。 二月春分食龟，使人不蛔，子孙蕃息。 三月宿毕食鲔鱼，使人不随美色，多气力。 送迎各二日。 春三月食犬肉，又先酸麦，无齿病，因甲乙以具。 四月宿勖食鹦，使人目明。 五月夏至食呜鸭，送迎各二日。 食鹧枭，送迎十日。 六月宿房食野雉，使人阳多遂子孙矣。 夏三月食鹦雉及苦，先麦食之，无瘴病，因丙丁以具。 七月食蠹，使人宜子孙，送迎各二日。 蠹，木蜴也。 八月秋分食蠹，使人无病淫，众人畏之，送迎二日。 九月宿建星食雁，使人不病瘴。 得良辰，美筋骨，送迎二日。 秋三月食马肉及辛，食之无寒病，因庚辛以具。 十月宿营室食诸乌，使人烁心，益寿美色，送迎二日。 十一月冬至食兔，令人不蛔，利足不僵。 十二月腊夜，令人持椒外井傍，无与人言，内椒井中，除瘟病。 冬三月食乱及咸，食之无足病，因壬癸以具。 常以其月不尽三月，夕半食者无饱。 修真秘录竟",
      "translated_text": "Rice is sweet and neutral, chiefly augmenting qi, supplementing the center, and harmonizing Spleen and Stomach qi.\n\nWhite beans are neutral, supplementing the five viscera, benefiting the center, and assisting the twelve channels. They may be consumed long-term.\n\nMalt sugar is sweet and warming, chiefly supplementing deficiency and fatigue, augmenting heart power, stopping thirst, treating throat and pharynx pain, and eliminating blood in saliva.\n\n**Monthly Dietary Guide**\n\nMaster Sixian asked: \"I have heard of foods suitable for each lunar station. I wish to be granted this method.\"\n\nThe Perfected One replied: \"Each lunar station has its corresponding suitable foods. If one selects and consumes them, they may also dispel illnesses. I now transmit this to you, that you may enlighten future generations.\"\n\n*The Treatise on Nourishing Life* states:\nIn the first month, on the *mao* day, consume copper fish to prevent epidemic diseases.\nIn the second month, at the Spring Equinox, consume tortoise to prevent roundworms and ensure descendants flourish.\nIn the third month, when the station is *Bi*, consume sturgeon to prevent infatuation with beauty and increase vigor. Observe two days before and after.\nIn spring’s three months, consume dog meat, and eat wheat before sour foods to prevent dental diseases. Prepare these on *jia* and *yi* days.\nIn the fourth month, when the station is *Xu*, consume parrot to brighten the eyes.\nIn the fifth month, at the Summer Solstice, consume mandarin duck. Observe two days before and after. Consume partridge, observing ten days before and after.\nIn the sixth month, when the station is *Fang*, consume wild pheasant to enhance yang and ensure descendants. In summer’s three months, consume pheasant and bitter foods, eating wheat first to prevent miasmic diseases. Prepare these on *bing* and *ding* days.\nIn the seventh month, consume *du* to promote descendants. Observe two days before and after. *Du* refers to wood scorpions.\nIn the eighth month, at the Autumn Equinox, consume *du* to prevent licentiousness, so that others hold one in awe. Observe two days before and after.\nIn the ninth month, when the station is *Jianxing*, consume wild goose to prevent miasmic diseases. On auspicious days, it strengthens sinews and bones. Observe two days before and after. In autumn’s three months, consume horse meat and pungent foods to prevent cold diseases. Prepare these on *geng* and *xin* days.\nIn the tenth month, when the station is *Yingshi*, consume various crows to refine the heart, prolong life, and enhance beauty. Observe two days before and after.\nIn the eleventh month, at the Winter Solstice, consume rabbit to prevent roundworms and ensure agile feet.\nOn the twelfth month’s sacrificial night, have someone hold pepper beside the well without speaking to others, then place the pepper into the well to dispel epidemic diseases. In winter’s three months, consume glutinous foods and salty flavors to prevent foot diseases. Prepare these on *ren* and *gui* days.\nRegularly, in the final three days of each month, eat at midnight without satiation.\n\n*Secret Records of Cultivating the Real* concludes.",
      "overlap_context": "qi, dispelling cold and heat, stopping thirst and vexation, supplementing the center and augmenting qi, harmonizing the five viscera, and regulating the channels and network vessels.\n\nCoix seed is sweet and warming, chiefly addressing sinew tension and hypertonicity, enduring wind-damp impediment, and descending qi. Prolonged consumption lightens the body, augments qi, dispels malign qi from the sinews and bones, frees the intestines and stomach, disperses water swelling, and increases appetite.",
      "start_char": 3511,
      "end_char": 4078,
      "start_sentence": 269,
      "end_sentence": 300,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.09278893470764,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\修真秘录—宋.txt",
        "category": "方法类"
      }
    }
  ]
}