{
  "source_id": "修真太极混元指玄图",
  "source_file": "chunked_daozang\\修真太极混元指玄图.json",
  "total_chunks": 3,
  "total_original_chars": 2643,
  "total_translated_chars": 16286,
  "total_translation_time": 71.0287835597992,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\灵图类\\修真太极混元指玄图.txt",
    "category": "灵图类"
  },
  "full_translation": "**Cultivating the True: Supreme Ultimate Chaos-Origin Finger-Pointing-to-the-Mysterious Diagram**\n\n**Title:** *Cultivating the True: Supreme Ultimate Chaos-Origin Finger-Pointing-to-the-Mysterious Diagram*\nOne scroll. Author unknown, likely from the Song dynasty.\nSource text: *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Lingtu* (Numinous Diagrams) Category.\n\n**Secret Transmission of Embryonic Breathing: Five Gates**\n1. *Natural Embryonic Breathing Formula*: Practicing this enables one to shed the mortal husk and ascend as an immortal.\n2. *True Embryonic Breathing Formula*: Practicing this grants longevity and deathlessness, with clarity in departure and abiding.\n3. *Great Embryonic Breathing Formula*: Practicing this brings peace, extends years, reverses aging, and strengthens bones while lightening the body.\n4. *Chaos-Origin Embryonic Breathing Formula*: Practicing this reverses aging, transforming the skin to jade-like smoothness.\n5. *Embryonic Breathing Formula*: Practicing this merely dispels illness and nourishes the skin.\n\nThe above embryonic breathing formulas each align with the proper timing and correspond to the Five Phases. Within non-action, there is action. They do not rely on visualization or guided movement, nor do they require avoidance of taboos. Practiced for ten days, their effects manifest. The profound mechanisms and subtle principles are too vast to fully expound!\n\n**True Dragon-Tiger Conjugation Internal Elixir Diagram**\nThe essence of the heart conceals the true yang qi, called the *Yang Dragon*.\nThe qi of the kidneys bears the true unified water, called the *Yin Tiger*.\n\n**Secret Transmission of Internal Elixir: Seven Gates**\n1. *Purple Gold Elixir Formula*: Gathering the dragon-tiger internal elixir, with six hundred days of firing completed, and the water-fire balance perfected—this is called the *Purple Gold Elixir*. Once achieved, one may ascend.\n2. *Gold Elixir Formula*: Gathering the dragon-tiger to form the internal elixir, then refining it with the golden liquid returning elixir to complete the gold elixir firing—six hundred days fully accomplished—one may attain deathlessness.\n3. *Dragon-Tiger Internal Elixir Formula*: Refining to complete the firing in just three hundred days, one may achieve longevity.\n4. *Azure Gold Elixir Formula*: Refining the true qi of the liver to completion.\n5. *Crimson Gold Elixir Formula*: Refining the true qi of the heart to completion.\n6. *Western Florescence Elixir Formula*: Refining the true qi of the lungs to completion.\n7. *Supreme Mystery Elixir Formula*: Refining the true qi of the kidneys to completion.\n\nThe above internal elixir formulas operate within non-action yet contain action, without reliance on visualization or guided movement.\n- When the *Purple Gold Elixir* is achieved, one sheds the husk and ascends as an immortal.\n- When the *Gold Elixir* is achieved, one becomes a terrestrial spirit.\n- When the *Dragon-Tiger Elixir* is achieved, one attains longevity and deathlessness.\n- The remaining elixirs can reverse aging.\n- Gathering them may take a single day to complete, not years or decades.\n- A person with the elixir is like a dragon with a pearl—ascending and soaring freely, the power of the elixir.\n\n**Circulating Heaven Fire Timing Diagram**\n**Secret Transmission of Fire Timing: Five Gates, totaling six hundred chapters**\n1. *Circulating Heaven Hourly Fire*: The first fire timing. One hour seizes a year’s firing work.\n2. *Circulating Heaven Daily Fire*: The second fire timing. One day seizes a year’s firing work.\n3. *Circulating Heaven Monthly Fire*: The third fire timing. One month seizes a year’s firing work.\n4. *Circulating Heaven Qi Fire*: The fourth fire timing. One qi cycle seizes a year’s firing work.\n5. *Circulating Heaven Fire Timing*: The fifth fire timing. One year’s natural count completes one year’s work.\n\nThe above fire timings:\n- Refining form strengthens bones and lightens the body.\n- Refining essence reverses aging and restores youth.\n- Refining qi unites with the yang spirit.\n- Refining spirit returns to the true and enters the Dao.\nThe numbers of fire timings are profound and inexhaustible; the methods of firing are unpredictable in practice.\n\n**Elbow-Behind Flying Gold Essence Diagram**\n**Secret Transmission of Elbow-Behind Guard: Three Gates**\n1. *Elbow-Behind Flying Gold Essence Formula*: Using the true qi of the lungs to form the daily gold essence, striking through the three passes to directly enter the *Niwan* (Mud Pill Palace). When the marrow is full, the bones strengthen, naturally reversing aging. After the dragon-tiger internal elixir is formed, the kidney qi must subtly bear the true qi of the lungs, drawing it to the crown and combining it with the divine water to descend.\n2. *Elbow-Behind Technique Formula*: This uses the kidney qi to subtly bear the true qi of the lungs, passing only through the three passes to replenish the *Niwan*. It restores black hair and smooths wrinkled skin.\n3. *Returning Essence to Replenish the Brain Formula*: While guarding internally, one may still encounter external stimuli. Thus, one must regulate and refine to prevent leakage, returning essence to replenish the brain and attain longevity and deathlessness.\n\nThe above elbow-behind techniques prevent the kidney qi from transmitting to the five viscera. Instead, it passes behind the *Weilü* (Tail Gate) lower pass, then through the *Jiaji* (Spine Flank) middle pass, and finally enters the *Yujing* (Jade Capital) upper pass to fill the sea of marrow.\nFor those cultivating the true who gather the dragon-tiger and form the true elixir embryo in a single day, this technique must be practiced to draw out the yin lead afterward, thereby swiftly attaining pure yang. If one fails to awaken to the true Dao and does not recognize the dragon-tiger conjugation but merely seeks to reverse aging, practicing this guard will yield results before stopping.\n\n**Returning Elixir Diagram**\nFrom the *Weilü* (Tail Gate) pass, striking through the three passes to reach the *Niwan*, harmonizing with the divine water to descend and return to the elixir field—this is called the *Great Returning Elixir*.\nFrom the kidneys transmitting to the liver, the liver to the heart, the heart to the spleen, the spleen to the lungs, and circulating back to the elixir field—this is called the *Lesser Returning Elixir*.\n\n**Secret Transmission of Returning Elixir: Six Gates**\n1. *Nine Cycles Returning Elixir Formula*: Using the true qi of the five viscera and the field’s true qi, harmonizing with the divine water to descend into the elixir field—this is called the *Nine Cycles*. Once accomplished, one may immediately shed the husk and ascend as an immortal.\n2. *Seven Returns Elixir Formula*: With three yin and three yang, three returns, circulating day and night once through the three fields—this is called the *Seven Returns*. Once accomplished, one may immediately shed the husk and ascend as an immortal.\n3. *Great Returning Elixir Formula*: With the three fields circulating once in return—this is called the *Great Returning Elixir*. Once achieved, one not only attains longevity in the world but may also ascend with the mortal bones, becoming a feathered transcendent.\n\n**Lesser Returning Elixir Formula***: With the five viscera circulating once—this is called the *Lesser Returning Elixir*. Once accomplished, one not only attains peace and longevity but may also achieve long life and reverse aging.\n\n**Golden Liquid Returning Elixir Formula***: Using the true qi of the lungs combined with the divine water in the crown, called the *Golden Liquid*, descending to return to the mother field—this naturally transforms the bones to a golden hue, and the body radiates golden light.\n\n**Jade Liquid Returning Elixir Formula***: Using the true qi of the kidneys combined with the divine water in the heart, called the *Jade Liquid*, descending to return to the elixir field—this naturally refines the blood into essence, and the body becomes like a jade tree.\n\nThe above Returning Elixir formulas involve issuing forth and then returning to the original place—hence the name *Returning Elixir*. They are not mere rinsing of saliva or swallowing of spittle. For one without an inner elixir, the Returning Elixir can still transform the skin and alter one’s appearance. For one with an inner elixir, the Returning Elixir irrigates the true qi, hastening the attainment of pure yang. From the crown, it descends into the Yellow Court.\n\nAs the scripture states: *The Golden Liquid Returning Elixir returns from the kidneys to the Yellow Court—this is called the Jade Liquid Returning Elixir!*\n\n---\n\n**Illustrated Secret Methods for Refining the Form**\n\n**Secret Transmission of Refining the Form Methods** (Four Gates):\n\n1. **Solar Refining of the Form Formula***: With an inner elixir, using the pure yang qi within the elixir to refine the form—after a hundred days, one may naturally ascend and fly.\n\n2. **Lunar Refining of the Form Formula***: Using the true divine water in the crown to refine the form—after a hundred days, the blood transforms into essence; after a thousand days, the flesh transforms into qi.\n\n3. **Golden Liquid Refining of the Form Formula***: Using the true qi of the lungs combined with divine water, at the moment before the elixir returns, ascending to refine the body—one’s appearance becomes like a jade tree, and golden flowers appear before the eyes.\n\n4. **Jade Liquid Refining of the Form Formula***: Using the true qi of the kidneys to circulate through the five viscera, at the moment before the elixir returns, ascending and entering the four limbs—transforming the blood into essence, the skin like a jade tree, and the refined essence like jade, rendering one impervious to cold and heat.\n\nThis not only irrigates the elixir field and dissolves the sovereign fire but also steams the five viscera, aiding the generation of qi.\n\nThe above four methods for refining the form are fundamentally the same. Since ancient times, perfected beings have not wished to remain in the world with their forms but have preferred to shed the husk and become true persons. Yet refining the form also has its methods—it is simply that few attain them.\n\n---\n\n**Illustrated Methods for the Three Fields’ Mutual Accomplishment**\n\n**Secret Transmission of Mutual Accomplishment Methods** (Two Gates):\n\n1. **Mutual Accomplishment Formula***: With the qi of the kidneys subtly carrying the true qi of the lungs, both fly down the Pass, ascending to replenish the Mud Pill Palace. Once the Sea of Marrow is full, employing the method to harmonize with divine water and descend to return to the elixir field. Then, using the pure yang qi within the elixir to ascend—one ascent and one descent meeting beside the Double Towers—this is called *Mutual Accomplishment*. Each Mutual Accomplishment yields one grain of golden millet Returning Elixir. One grain of golden millet Returning Elixir produces one beam of golden light, emerging from between the skin and hair. With myriad beams of golden light, one may naturally shed the husk and ascend as an immortal.\n\n2. **Lesser Mutual Accomplishment Formula***: Using the fire kindled from the Returning Elixir—this is called *Lesser Mutual Accomplishment*. Each Lesser Mutual Accomplishment enables one to refine the form and remain in the world, forever impervious to cold and heat.\n\nThe above Mutual Accomplishment methods are not the rinsing and swallowing of saliva, nor the sending of intention to the lower field, nor the visualization of heart fire raising the intention to the Double Towers to meet the descending divine water—where the taste is sweet and the spirit refreshed. Naturally, when the true fire ascends, the body grows warm and the qi clear, rising of its own accord. The profound mechanism and wondrous subtleties are difficult to express in writing.\n\n---\n\n**Illustrated Methods for Refining Qi into Spirit and Audience at the Origin**\n\n**Secret Transmission of Refining Qi into Spirit and Audience at the Origin Methods** (Six Gates):\n\n1. **Refining Qi into Spirit and Audience at the Origin Formula***: Using the true qi within the elixir to refine the qi of the five viscera, ascending to become spirit and entering the Heavenly Palace.\n\n2. **Three Flowers Audience at the Origin Formula***: The pure yang within the elixir—one flower ascends to audience at the Heavenly Palace; the true yang within the heart—one flower ascends to audience at the Heavenly Palace; the correct yang within the kidneys—one flower ascends to audience at the Heavenly Palace.\n\n3. **Refining Liver Qi into Spirit Formula***: Using the pure yang qi within the elixir to refine the liver—enabling one to see ghosts and spirits with the eyes.\n\n4. **Refining Heart Qi into Spirit Formula***: Using the pure yang qi within the elixir to refine the heart—enabling one to know past events.\n\n5. **Refining Lung Qi into Spirit Formula***: Using the pure yang qi within the elixir to refine the lungs—enabling one to be forever impervious to cold and heat.\n\n6. **Refining Kidney Qi into Spirit Formula***: Using the pure yang qi within the elixir to refine the kidneys—enabling one to reverse aging and return to youth.\n\nThe above methods for refining qi require the presence of an elixir to refine the qi. When the qi is true, the spirit manifests of itself; when the spirit manifests, the Dao is naturally attained! If one merely visualizes with the heart fire, it is futile—like drawing a cake to satisfy hunger. The profound subtleties are difficult to expound.\n\n---\n\n**Illustrated Methods for Internal Visualization and Kindling the Fire, Exchanging Mortal for Immortal**\n\n**Secret Transmission of Internal Visualization and Kindling the Fire Methods** (Seven Gates):\n\nInternal visualization and kindling the fire to expel the Three Corpses,\nInternal visualization and kindling the fire to expel the Seven Po,\nInternal visualization and kindling the fire to subdue the myriad demons,\nInternal visualization and kindling the fire to slay the Five Ghosts,\nInternal visualization and kindling the fire to descend the Nine Worms,\nInternal visualization and kindling the fire to eliminate illnesses,\nInternal visualization and kindling the fire to refine the form and substance.\n\nAlso called *Burning the Body*.\n\nThe above methods for kindling the fire require the presence of an inner elixir to ignite the pure yang qi within the elixir—this is called the *true and correct fire*. If one takes the heart as the sovereign fire, the kidneys as the ministerial fire, and the bladder as the popular fire—this is called the *Threefold Samādhi True Fire*. Though called true fire, it is dim and unclear, not the internal visualization and kindling of fire from the inner elixir.\n\nWhen the inner elixir kindles the fire, ghosts and spirits dare not approach, and water and fire cannot harm. One sees it oneself—flames blazing ten thousand zhang within the fire!\n\n---\n\n**Illustrated Methods for Shedding the Husk, Ascending as an Immortal, Entering Sagehood, and Transcending the Mortal**\n\n**Secret Transmission of Shedding the Husk Methods** (Twelve Gates):\n\nWhen Master Zhongli achieved the Dao, he emerged from a seven-tiered pagoda;\nWhen Master Lü achieved the Dao, he emerged from a three-story red tower;\nWhen Master Haichan achieved the Dao, he emerged as a crane soaring through the Heavenly Gate;\n\nWhen the Yellow Emperor achieved the Dao, he emerged upon a fire dragon;\nWhen Perfected Master Shi achieved the Dao, he emerged from a forest of blossoms.\n\nThere are also those who depart by gazing at the moon and riding forth, or by the earth surging with five-colored clouds—these are not recorded here. For whether a Buddhist monk sits in transformation or a Daoist attains *shijie* (corpse liberation), if they have not first cultivated foundational work, and if their shedding of the husk arises from fixed concentration rather than spontaneous awakening at the Heavenly Gate, they become *guixian* (ghost immortals), not true *chunyang* (pure yang) immortals.\n\nIn truth, they are ghosts—refined and numinous ghosts, not pure yang immortals.\n\n*Illustrated Mysteries of Cultivating the True and the Supreme Ultimate Primordial* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "修真太极混元指玄图 经名：修真太极混元指玄图。 一卷。 不署撰人，疑出於宋代。 底本出处：《正统道藏》洞真部灵图类。 秘传胎息诀有五门 自然胎息诀第一，行之令人弃壳升仙。 真胎息诀第二，行之令人长生不死，去住分明。 大胎息诀第三，行之安乐延年，返老还童，而骨健身轻。 混元胎息诀第四，行之令人反老，换肌如玉。 胎息诀第五。 行之止得去除疾病，充悦肌肤。 右件胎息诀，明有时候，各有五行，无为中有为。 不说存想导引，不说避忌触犯，行之旬日见验，玄机奥旨，难尽难陈矣！ 真龙虎交媾内丹诀图 心液之上暗藏正阳之气曰阳龙　肾气之中暗负真一之水曰阴虎 秘传内丹诀有七门 紫金丹诀第一，采龙虎内丹，六百日火候并足，以水火既济了足，是曰紫金丹。 紫金丹就，当可上升。 金丹诀第二，采龙虎结内丹，次以金液还丹修炼，而成金丹火候，是六百日全备，当可不死。 龙虎内丹诀第三，修炼而成火候，止是三百日，子足当可长生。 青金丹诀第四，采肝真气修炼而成。 红金丹诀第五，采心真气修炼而成。 西华丹诀第六，采肺真气修炼而成。 太玄丹诀第七。 采肾真气修炼而成。 右件内丹诀，无为中有为，并不存想导引。 紫金丹就，弃壳升仙。 金丹就，陆地神恤。 龙虎丹就，长生不死。 余有一丹，自可返老。 采之一日而成，不说三年九载。 凡人有丹，如龙有珠，升腾自如，丹之功也。 周天火候诀图 秘传火候有五门，五门计六百篇 周天时火，火候第一。 以一时夺一年火功。 周天日火，火候第二。 以一日夺一年火功。 周天月火，火候第三。 以一月夺一年火功。 周天气火，火候第四。 以一气夺一年火功。 周天火候第五。 以一年本数行一年功。 右件火候，炼形则骨健身轻，炼精则还童返老，炼气则合就阳神，炼神则还真入道。 火候数多，玄妙难穷，火候法多，行持不测。 肘后飞金晶诀图、 秘传肘后卫有三门 肘后飞金晶诀第一，以肺真气而日金晶，三关一撞； 直入泥丸。 髓满令人骨健，自有反老之功。 兼以龙虎，既结内丹，须要肾气暗负肺之真气，抽之於顶中，配合神水下降。 肘后术诀第二，此是以肾气暗负肺之真气，止过三关，上补泥丸，令人髭鬓复黑，皱脸重舒。 还精补脑诀第三，方内卫，而对境未能无穴，当且调炼，不令走失，还精补脑，长生不死。 右件肘后术，是使肾气不传五脏，背过尾闻穴下关，次过夹脊中关，次入玉京上关，以填髓海。 如修真之士，既采龙虎，而一日成丹真胎，不可不行此术，以抽阴铅后起，是以早得纯阳。 若人不悟真道，不识龙虎交媾，止要返老，当行此卫，见效而止。 还丹诀图 自尾闲穴起，一撞三关，至泥丸，合和神水，下降复还丹田，曰大还丹。 自肾传肝，自肝传心，自心传脾，自脾传肺，周而复始，再至丹田，曰小还丹。 秘传还丹诀有六门 九转还丹诀第一，以五脏真气，田真气，合和神水下丹田，而日九转。 九转功就，立可弃壳升仙。 七返还丹诀第二，以三阴三阳三返，昼夜一循环，三田都过，而日七返。 七返功就，立可弃壳升仙。 大还丹诀第三，以三田返复，循环一次，而日大还丹。 大还丹就，不止长生在世，而亦升举尘骨，而日羽客矣。",
      "translated_text": "**Cultivating the True: Supreme Ultimate Chaos-Origin Finger-Pointing-to-the-Mysterious Diagram**\n\n**Title:** *Cultivating the True: Supreme Ultimate Chaos-Origin Finger-Pointing-to-the-Mysterious Diagram*\nOne scroll. Author unknown, likely from the Song dynasty.\nSource text: *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Lingtu* (Numinous Diagrams) Category.\n\n**Secret Transmission of Embryonic Breathing: Five Gates**\n1. *Natural Embryonic Breathing Formula*: Practicing this enables one to shed the mortal husk and ascend as an immortal.\n2. *True Embryonic Breathing Formula*: Practicing this grants longevity and deathlessness, with clarity in departure and abiding.\n3. *Great Embryonic Breathing Formula*: Practicing this brings peace, extends years, reverses aging, and strengthens bones while lightening the body.\n4. *Chaos-Origin Embryonic Breathing Formula*: Practicing this reverses aging, transforming the skin to jade-like smoothness.\n5. *Embryonic Breathing Formula*: Practicing this merely dispels illness and nourishes the skin.\n\nThe above embryonic breathing formulas each align with the proper timing and correspond to the Five Phases. Within non-action, there is action. They do not rely on visualization or guided movement, nor do they require avoidance of taboos. Practiced for ten days, their effects manifest. The profound mechanisms and subtle principles are too vast to fully expound!\n\n**True Dragon-Tiger Conjugation Internal Elixir Diagram**\nThe essence of the heart conceals the true yang qi, called the *Yang Dragon*.\nThe qi of the kidneys bears the true unified water, called the *Yin Tiger*.\n\n**Secret Transmission of Internal Elixir: Seven Gates**\n1. *Purple Gold Elixir Formula*: Gathering the dragon-tiger internal elixir, with six hundred days of firing completed, and the water-fire balance perfected—this is called the *Purple Gold Elixir*. Once achieved, one may ascend.\n2. *Gold Elixir Formula*: Gathering the dragon-tiger to form the internal elixir, then refining it with the golden liquid returning elixir to complete the gold elixir firing—six hundred days fully accomplished—one may attain deathlessness.\n3. *Dragon-Tiger Internal Elixir Formula*: Refining to complete the firing in just three hundred days, one may achieve longevity.\n4. *Azure Gold Elixir Formula*: Refining the true qi of the liver to completion.\n5. *Crimson Gold Elixir Formula*: Refining the true qi of the heart to completion.\n6. *Western Florescence Elixir Formula*: Refining the true qi of the lungs to completion.\n7. *Supreme Mystery Elixir Formula*: Refining the true qi of the kidneys to completion.\n\nThe above internal elixir formulas operate within non-action yet contain action, without reliance on visualization or guided movement.\n- When the *Purple Gold Elixir* is achieved, one sheds the husk and ascends as an immortal.\n- When the *Gold Elixir* is achieved, one becomes a terrestrial spirit.\n- When the *Dragon-Tiger Elixir* is achieved, one attains longevity and deathlessness.\n- The remaining elixirs can reverse aging.\n- Gathering them may take a single day to complete, not years or decades.\n- A person with the elixir is like a dragon with a pearl—ascending and soaring freely, the power of the elixir.\n\n**Circulating Heaven Fire Timing Diagram**\n**Secret Transmission of Fire Timing: Five Gates, totaling six hundred chapters**\n1. *Circulating Heaven Hourly Fire*: The first fire timing. One hour seizes a year’s firing work.\n2. *Circulating Heaven Daily Fire*: The second fire timing. One day seizes a year’s firing work.\n3. *Circulating Heaven Monthly Fire*: The third fire timing. One month seizes a year’s firing work.\n4. *Circulating Heaven Qi Fire*: The fourth fire timing. One qi cycle seizes a year’s firing work.\n5. *Circulating Heaven Fire Timing*: The fifth fire timing. One year’s natural count completes one year’s work.\n\nThe above fire timings:\n- Refining form strengthens bones and lightens the body.\n- Refining essence reverses aging and restores youth.\n- Refining qi unites with the yang spirit.\n- Refining spirit returns to the true and enters the Dao.\nThe numbers of fire timings are profound and inexhaustible; the methods of firing are unpredictable in practice.\n\n**Elbow-Behind Flying Gold Essence Diagram**\n**Secret Transmission of Elbow-Behind Guard: Three Gates**\n1. *Elbow-Behind Flying Gold Essence Formula*: Using the true qi of the lungs to form the daily gold essence, striking through the three passes to directly enter the *Niwan* (Mud Pill Palace). When the marrow is full, the bones strengthen, naturally reversing aging. After the dragon-tiger internal elixir is formed, the kidney qi must subtly bear the true qi of the lungs, drawing it to the crown and combining it with the divine water to descend.\n2. *Elbow-Behind Technique Formula*: This uses the kidney qi to subtly bear the true qi of the lungs, passing only through the three passes to replenish the *Niwan*. It restores black hair and smooths wrinkled skin.\n3. *Returning Essence to Replenish the Brain Formula*: While guarding internally, one may still encounter external stimuli. Thus, one must regulate and refine to prevent leakage, returning essence to replenish the brain and attain longevity and deathlessness.\n\nThe above elbow-behind techniques prevent the kidney qi from transmitting to the five viscera. Instead, it passes behind the *Weilü* (Tail Gate) lower pass, then through the *Jiaji* (Spine Flank) middle pass, and finally enters the *Yujing* (Jade Capital) upper pass to fill the sea of marrow.\nFor those cultivating the true who gather the dragon-tiger and form the true elixir embryo in a single day, this technique must be practiced to draw out the yin lead afterward, thereby swiftly attaining pure yang. If one fails to awaken to the true Dao and does not recognize the dragon-tiger conjugation but merely seeks to reverse aging, practicing this guard will yield results before stopping.\n\n**Returning Elixir Diagram**\nFrom the *Weilü* (Tail Gate) pass, striking through the three passes to reach the *Niwan*, harmonizing with the divine water to descend and return to the elixir field—this is called the *Great Returning Elixir*.\nFrom the kidneys transmitting to the liver, the liver to the heart, the heart to the spleen, the spleen to the lungs, and circulating back to the elixir field—this is called the *Lesser Returning Elixir*.\n\n**Secret Transmission of Returning Elixir: Six Gates**\n1. *Nine Cycles Returning Elixir Formula*: Using the true qi of the five viscera and the field’s true qi, harmonizing with the divine water to descend into the elixir field—this is called the *Nine Cycles*. Once accomplished, one may immediately shed the husk and ascend as an immortal.\n2. *Seven Returns Elixir Formula*: With three yin and three yang, three returns, circulating day and night once through the three fields—this is called the *Seven Returns*. Once accomplished, one may immediately shed the husk and ascend as an immortal.\n3. *Great Returning Elixir Formula*: With the three fields circulating once in return—this is called the *Great Returning Elixir*. Once achieved, one not only attains longevity in the world but may also ascend with the mortal bones, becoming a feathered transcendent.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1322,
      "start_sentence": 0,
      "end_sentence": 67,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.319109201431274,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\修真太极混元指玄图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "小还丹诀第四，以五脏循环一次，而日小还丹。 小还丹就，不止安乐延年，而亦长生返老。 金液还丹诀第五，以肺真气合顶中神水，而日金液，下还母田，自可骨相金色，而体出金光。 玉液还丹诀第六。 以肾真气合心中神水，而日玉液，下还丹田，自可换血为膏，而身如玉树。 右件还丹诀，是出而复还本处，而日还丹。 非漱津咽唾，如人无内丹，而还丹自可改易肌肤，变换容仪。 如人有内丹，而还丹浇灌真气，早为纯阳。 自顶中而下入黄庭。 经日：金液还丹，自肾中而复黄庭，日玉液还丹矣！ 炼形秘诀图 秘传炼形诀有四门 太阳炼形诀第一，有内丹，以丹中纯阳之气运而炼形，百日自可升飞。 太阴炼形诀第二，以顶中真神水，运而炼形百日血化为膏，千日肉化为气。 金液炼形诀第三，以肺中真气合神水，欲还丹而未还之际，升而炼形体，出如玉树之貌，而目见金花。 玉液炼形诀第四，以肾真气循环五脏，欲还未还之际，升而上，入四肢，变血为膏，肌如玉树，炼膏如玉，自耐寒暑。 不止浇灌丹田，而解其王火，而又熏蒸五脏，助其所生气也。 右件炼形有四，并无异。 自古上真，不愿留形住世，皆愿弃壳而为真人然以炼形亦为有诀，盖无其人也。 三田既济诀图 秘传既济诀有二门 既济诀第一，以肾气暗负肺之真气，皆飞下关，上补泥丸，髓海既实，用法致之，合和神水，下还丹田。 复以丹中纯阳之气上升，一升一降，相见於重楼之侧，而日既济。 既济一次，一粒金粟还丹。 一粒金粟还丹，一道金光，出於皮毛之问，金光万道，自可弃壳升仙。 小既济诀第二，以还丹中起火，而日小既济。 小既济一次，自可炼形住世，永耐寒暑。 右件既济诀，不是漱咽津唾，以意送之下田，存想心火，以意举之重楼当其神水下降，味甘神爽，自然降当其真火上升，体热气清，自然升起。 玄机妙旨，难以纸笔。 炼气成神朝元诀图 炼气成神朝元诀秘传有六门 炼气成神朝元诀第一，以丹中真气炼五脏之气，升而成神，上入天宫。 三花朝元诀第二，丹中纯阳，一花上朝天宫； 心中真阳，一花上朝天宫； 肾中正阳，一花上朝天宫。 炼肝气成神诀第三，以丹中纯阳之气炼肝，令人目视鬼神。 炼心气成神诀第四，以丹中纯阳之气炼心，令人心通前事。 炼肺气成神诀第五，以丹中纯阳之气炼肺，令人永耐寒暑。 炼肾气成神诀第六。 以丹中纯阳之气炼肾，令人返老还童。 右件炼气诀，须是有丹而可炼气。 气真神自现，神现道自得矣！ 若以心火存想，徒然而已，如画地为饼，岂可充饥，玄旨难陈。 内观起火仙凡交换图 秘传内观起火诀有七门 内观起火除三尸，内观起火除七魄，内观起火降群魔，内观起火杀五鬼，内观起火下九虫，内观起火除疾病，内观起火炼形质。 又日焚身。 右件起火诀，须是有内丹而起丹中纯阳之气，而曰正真之火。 若以心为君火，肾为臣火，膀胱为民火，是为三昧真火，虽曰真火，昧而不明，非此内丹者内观起火。 内丹起火，鬼神不敢近，水火不能害。 自己见之，炎炎万丈於火中矣！ 弃壳升仙入圣超凡图 秘传弃壳诀有一十二门 锺离道成，以七层宝塔出； 吕公道成，以三级红楼出； 海蟾子道成，以鹤冲天门出；",
      "translated_text": "**Lesser Returning Elixir Formula***: With the five viscera circulating once—this is called the *Lesser Returning Elixir*. Once accomplished, one not only attains peace and longevity but may also achieve long life and reverse aging.\n\n**Golden Liquid Returning Elixir Formula***: Using the true qi of the lungs combined with the divine water in the crown, called the *Golden Liquid*, descending to return to the mother field—this naturally transforms the bones to a golden hue, and the body radiates golden light.\n\n**Jade Liquid Returning Elixir Formula***: Using the true qi of the kidneys combined with the divine water in the heart, called the *Jade Liquid*, descending to return to the elixir field—this naturally refines the blood into essence, and the body becomes like a jade tree.\n\nThe above Returning Elixir formulas involve issuing forth and then returning to the original place—hence the name *Returning Elixir*. They are not mere rinsing of saliva or swallowing of spittle. For one without an inner elixir, the Returning Elixir can still transform the skin and alter one’s appearance. For one with an inner elixir, the Returning Elixir irrigates the true qi, hastening the attainment of pure yang. From the crown, it descends into the Yellow Court.\n\nAs the scripture states: *The Golden Liquid Returning Elixir returns from the kidneys to the Yellow Court—this is called the Jade Liquid Returning Elixir!*\n\n---\n\n**Illustrated Secret Methods for Refining the Form**\n\n**Secret Transmission of Refining the Form Methods** (Four Gates):\n\n1. **Solar Refining of the Form Formula***: With an inner elixir, using the pure yang qi within the elixir to refine the form—after a hundred days, one may naturally ascend and fly.\n\n2. **Lunar Refining of the Form Formula***: Using the true divine water in the crown to refine the form—after a hundred days, the blood transforms into essence; after a thousand days, the flesh transforms into qi.\n\n3. **Golden Liquid Refining of the Form Formula***: Using the true qi of the lungs combined with divine water, at the moment before the elixir returns, ascending to refine the body—one’s appearance becomes like a jade tree, and golden flowers appear before the eyes.\n\n4. **Jade Liquid Refining of the Form Formula***: Using the true qi of the kidneys to circulate through the five viscera, at the moment before the elixir returns, ascending and entering the four limbs—transforming the blood into essence, the skin like a jade tree, and the refined essence like jade, rendering one impervious to cold and heat.\n\nThis not only irrigates the elixir field and dissolves the sovereign fire but also steams the five viscera, aiding the generation of qi.\n\nThe above four methods for refining the form are fundamentally the same. Since ancient times, perfected beings have not wished to remain in the world with their forms but have preferred to shed the husk and become true persons. Yet refining the form also has its methods—it is simply that few attain them.\n\n---\n\n**Illustrated Methods for the Three Fields’ Mutual Accomplishment**\n\n**Secret Transmission of Mutual Accomplishment Methods** (Two Gates):\n\n1. **Mutual Accomplishment Formula***: With the qi of the kidneys subtly carrying the true qi of the lungs, both fly down the Pass, ascending to replenish the Mud Pill Palace. Once the Sea of Marrow is full, employing the method to harmonize with divine water and descend to return to the elixir field. Then, using the pure yang qi within the elixir to ascend—one ascent and one descent meeting beside the Double Towers—this is called *Mutual Accomplishment*. Each Mutual Accomplishment yields one grain of golden millet Returning Elixir. One grain of golden millet Returning Elixir produces one beam of golden light, emerging from between the skin and hair. With myriad beams of golden light, one may naturally shed the husk and ascend as an immortal.\n\n2. **Lesser Mutual Accomplishment Formula***: Using the fire kindled from the Returning Elixir—this is called *Lesser Mutual Accomplishment*. Each Lesser Mutual Accomplishment enables one to refine the form and remain in the world, forever impervious to cold and heat.\n\nThe above Mutual Accomplishment methods are not the rinsing and swallowing of saliva, nor the sending of intention to the lower field, nor the visualization of heart fire raising the intention to the Double Towers to meet the descending divine water—where the taste is sweet and the spirit refreshed. Naturally, when the true fire ascends, the body grows warm and the qi clear, rising of its own accord. The profound mechanism and wondrous subtleties are difficult to express in writing.\n\n---\n\n**Illustrated Methods for Refining Qi into Spirit and Audience at the Origin**\n\n**Secret Transmission of Refining Qi into Spirit and Audience at the Origin Methods** (Six Gates):\n\n1. **Refining Qi into Spirit and Audience at the Origin Formula***: Using the true qi within the elixir to refine the qi of the five viscera, ascending to become spirit and entering the Heavenly Palace.\n\n2. **Three Flowers Audience at the Origin Formula***: The pure yang within the elixir—one flower ascends to audience at the Heavenly Palace; the true yang within the heart—one flower ascends to audience at the Heavenly Palace; the correct yang within the kidneys—one flower ascends to audience at the Heavenly Palace.\n\n3. **Refining Liver Qi into Spirit Formula***: Using the pure yang qi within the elixir to refine the liver—enabling one to see ghosts and spirits with the eyes.\n\n4. **Refining Heart Qi into Spirit Formula***: Using the pure yang qi within the elixir to refine the heart—enabling one to know past events.\n\n5. **Refining Lung Qi into Spirit Formula***: Using the pure yang qi within the elixir to refine the lungs—enabling one to be forever impervious to cold and heat.\n\n6. **Refining Kidney Qi into Spirit Formula***: Using the pure yang qi within the elixir to refine the kidneys—enabling one to reverse aging and return to youth.\n\nThe above methods for refining qi require the presence of an elixir to refine the qi. When the qi is true, the spirit manifests of itself; when the spirit manifests, the Dao is naturally attained! If one merely visualizes with the heart fire, it is futile—like drawing a cake to satisfy hunger. The profound subtleties are difficult to expound.\n\n---\n\n**Illustrated Methods for Internal Visualization and Kindling the Fire, Exchanging Mortal for Immortal**\n\n**Secret Transmission of Internal Visualization and Kindling the Fire Methods** (Seven Gates):\n\nInternal visualization and kindling the fire to expel the Three Corpses,\nInternal visualization and kindling the fire to expel the Seven Po,\nInternal visualization and kindling the fire to subdue the myriad demons,\nInternal visualization and kindling the fire to slay the Five Ghosts,\nInternal visualization and kindling the fire to descend the Nine Worms,\nInternal visualization and kindling the fire to eliminate illnesses,\nInternal visualization and kindling the fire to refine the form and substance.\n\nAlso called *Burning the Body*.\n\nThe above methods for kindling the fire require the presence of an inner elixir to ignite the pure yang qi within the elixir—this is called the *true and correct fire*. If one takes the heart as the sovereign fire, the kidneys as the ministerial fire, and the bladder as the popular fire—this is called the *Threefold Samādhi True Fire*. Though called true fire, it is dim and unclear, not the internal visualization and kindling of fire from the inner elixir.\n\nWhen the inner elixir kindles the fire, ghosts and spirits dare not approach, and water and fire cannot harm. One sees it oneself—flames blazing ten thousand zhang within the fire!\n\n---\n\n**Illustrated Methods for Shedding the Husk, Ascending as an Immortal, Entering Sagehood, and Transcending the Mortal**\n\n**Secret Transmission of Shedding the Husk Methods** (Twelve Gates):\n\nWhen Master Zhongli achieved the Dao, he emerged from a seven-tiered pagoda;\nWhen Master Lü achieved the Dao, he emerged from a three-story red tower;\nWhen Master Haichan achieved the Dao, he emerged as a crane soaring through the Heavenly Gate;",
      "overlap_context": "ixir Formula*: With three yin and three yang, three returns, circulating day and night once through the three fields—this is called the *Seven Returns*. Once accomplished, one may immediately shed the husk and ascend as an immortal.\n3. *Great Returning Elixir Formula*: With the three fields circulating once in return—this is called the *Great Returning Elixir*. Once achieved, one not only attains longevity in the world but may also ascend with the mortal bones, becoming a feathered transcendent.",
      "start_char": 1323,
      "end_char": 2621,
      "start_sentence": 68,
      "end_sentence": 123,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.65042495727539,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\修真太极混元指玄图.txt",
        "category": "灵图类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "轩辕道成，以火龙出； 施真人道成，以花林出。 余有看月驾出，地踊五色云，今者不书录者，以僧子坐化，道人尸解，不下前功，上要弃壳，定中悟出天门者，皆为鬼仙，不能纯阳之仙。 其实鬼也，是为清灵之鬼，非为纯阳之仙也。 修真太极混元指玄图竟",
      "translated_text": "When the Yellow Emperor achieved the Dao, he emerged upon a fire dragon;\nWhen Perfected Master Shi achieved the Dao, he emerged from a forest of blossoms.\n\nThere are also those who depart by gazing at the moon and riding forth, or by the earth surging with five-colored clouds—these are not recorded here. For whether a Buddhist monk sits in transformation or a Daoist attains *shijie* (corpse liberation), if they have not first cultivated foundational work, and if their shedding of the husk arises from fixed concentration rather than spontaneous awakening at the Heavenly Gate, they become *guixian* (ghost immortals), not true *chunyang* (pure yang) immortals.\n\nIn truth, they are ghosts—refined and numinous ghosts, not pure yang immortals.\n\n*Illustrated Mysteries of Cultivating the True and the Supreme Ultimate Primordial* concludes.",
      "overlap_context": "neself—flames blazing ten thousand zhang within the fire!\n\n---\n\n**Illustrated Methods for Shedding the Husk, Ascending as an Immortal, Entering Sagehood, and Transcending the Mortal**\n\n**Secret Transmission of Shedding the Husk Methods** (Twelve Gates):\n\nWhen Master Zhongli achieved the Dao, he emerged from a seven-tiered pagoda;\nWhen Master Lü achieved the Dao, he emerged from a three-story red tower;\nWhen Master Haichan achieved the Dao, he emerged as a crane soaring through the Heavenly Gate;",
      "start_char": 2621,
      "end_char": 2737,
      "start_sentence": 124,
      "end_sentence": 128,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 5.059249401092529,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\灵图类\\修真太极混元指玄图.txt",
        "category": "灵图类"
      }
    }
  ]
}