{
  "source_id": "修真十书盘山语录",
  "source_file": "chunked_daozang\\修真十书盘山语录.json",
  "total_chunks": 14,
  "total_original_chars": 16177,
  "total_translated_chars": 87388,
  "total_translation_time": 421.7233793735504,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\方法类\\修真十书盘山语录.txt",
    "category": "方法类"
  },
  "full_translation": "*The Ten Books of Cultivating Perfection*\n*Title: The Ten Books of Cultivating Perfection*\nSixty *juan*, unattributed, likely composed during the Yuan dynasty. Base text from *Zhengtong Daoist Canon*, *Dongzhen* section, Methods category.\n\n*Recorded Sayings of Master Shi at Mount Pan, Volume 53*\n\nMaster Shi once expounded at Mount Pan, saying: Generally, those newly embarking on the Dao, if they immediately turn to places where words fail to grasp, will find nothing to hold, no support to rely upon, and doubt will surely arise. For if the mind lacks effort, faith will falter, and without faith, one cannot practice. Without practice, learning becomes chaotic and haphazard, and over time, one grows lax.\n\nNow, let me tell you this: Trust in what your eyes clearly see and your ears distinctly hear, and practice accordingly. From the ordinary, enter the wondrous—this will not lead you astray. Though they are but sounds and forms, they are the functioning of the Dao.\n\nWhat, then, is trustworthy? Do you not see the vast emptiness, the heavens and earth, the sun and moon, mountains and rivers, wind and clouds? These are all clearly visible before your eyes—they are the models for cultivation, the very gateway to entering the Dao.\n\nConsider how clouds emerge from mountains: they come and go without intent, drifting freely and at ease. Neither circumstances nor things can cling to them—so too should the mind of the Dao practitioner be.\n\nOr observe the wind as it stirs and animates the myriad things: it rushes forth and returns, utterly unobstructed, leaving no trace. Neither grasses nor forests can impede it—it sweeps past in an instant. So too should the mind of the Dao practitioner be.\n\nOr behold Mount Tai: towering and majestic, steadfast and unshaken. No thing can disturb it—so too should the mind of the Dao practitioner be.\n\nOr consider water: its nature is soft and yielding, flowing downward to benefit all beings. It does not contend with things but adapts to every shape, its essence pure and tranquil. When it gathers into rivers and seas, it embraces the hundred streams without distinction, containing all—fish, turtles, shrimp, and crabs—without exclusion. So too should the mind of the Dao practitioner be.\n\nOr look to the sun and moon: they illuminate wherever their light reaches, impartial and without selfishness, radiant in all directions, unobscured day and night, boundless in brilliance. So too should the mind of the Dao practitioner be.\n\nLike the heavens above, their essence is ever clear, and in their clarity, they embrace all. They cover without exception.\n\nLike the earth below, its essence is ever still, benefiting the ten thousand things without harm. So too should the mind of the Dao practitioner be.\n\nLike the vast emptiness, boundless and without limit, containing all—sentient and insentient, covering heaven and bearing earth—it embraces without discrimination. Neither moving nor still, neither existing nor non-existing, neither attached to nor separate from the ten thousand things, it embodies the clarity of heaven, the stillness of earth, the brightness of the sun and moon, and the transformations of the myriad things. The emptiness is one with all—so too should the mind of the Dao practitioner be.\n\nThe Dao is one with heaven and earth, and its functioning is thus. Constantly embody it, and when your effort matures, you will naturally comprehend it. In action, you will harmonize with the Dao, and there will be a master within.\n\nIf you dismiss words entirely and sever all thought, you will lose the way. Having entered the mysterious gate, each of you must strive diligently.\n\nSomeone asked: For beginners in cultivation, how does one enter the gateway of the mind?\n\nThe Master replied: Sever in one stroke all private attachments, scheming calculations, forward and backward deliberations, and the mind that entraps or ensnares others. Abandon entirely all clinging to wine, lust, wealth, and temper; to right and wrong, self and others; to craving, love, and desire; to selfishness, perversity, greed, and desire. Free from external burdens, the body becomes light and at ease. Free from internal defilements, the mind becomes light and at ease. With both inner and outer lightness, over time, purity will naturally arise, and false thoughts will vanish. Then, moment by moment, guard and attend to it: be cautious in speech, moderate in diet, and sparing in sleep. Inner and outer assist each other, and when the dust and grime are entirely cleansed, leaving not a single thing behind, in time, your original life-spirit will naturally manifest, and you will enjoy freedom and ease—this is the supreme Dao practitioner.\n\nThe Master instructed the assembly: The cultivator who attains the Dao in their hometown should not remain there. One who ascends to immortality after consuming meat and wine should not partake. Even if your family are immortals, do not cling to them. What others love, do not love; what others reject, do not reject. Do not mistake the impure for yourself. Even if you attain the Dao in sleep, do not indulge in sleep. Do not associate with unworthy companions, nor speak useless words. When things go well, do not rejoice; when they go ill, do not grieve. Learn from those better than yourself; teach those who are not. When others wrong you, it is fortune; when you wrong others, it is misfortune. Words beyond deeds are empty; deeds beyond words are real. Those with desires are bound to worldly affairs; those with a mind free of dust walk the immortal Dao. Those who humble themselves will rise; those who embrace poverty will grow rich. Return to the constant and harmonize with the Dao; follow principle and align with others. The true Dao should be practiced; deviant paths should not be entered. Penetrate the Dao and illuminate virtue; embody and perfect its use—this is called the Perfected.\n\nThe Master said: The cultivator must strictly avoid speaking of others’ strengths and weaknesses, or inquiring about their rise and fall. For all worldly matters unrelated to oneself, the mouth must not discuss them, nor the mind ponder them. Merely speaking of right and wrong is to obscure one’s own nature. If you focus solely on refining the mind and constantly examining your own faults, how will you have time to meddle in others’ affairs? In dealing with others, emulate their virtues and avoid their vices. Do not concern yourself with them, and gradually, you will reach a state of rest.\n\nThe Master said: Heaven and earth are the parents of the ten thousand things. The heavens cover all without exception; the earth bears all without distinction. How could they discriminate between good and bad? They cover and bear all equally, illuminating all alike.\n\nThus, those who stand above others do so by the mandate of Heaven, and ought to emulate Heaven’s all-covering embrace, nurturing, preserving, and cherishing all those beneath them, making no distinction of self and other, high and low. Those who stand beneath others likewise do so by Heaven’s decree, and ought to emulate Earth’s steadfast bearing, revering, honoring, and obeying those above them, never daring the slightest negligence. Since we dwell between Heaven and Earth, we must align with the Dao of Heaven and Earth. Otherwise, we act beyond our proper bounds, inviting punishment, misfortune, and calamity.\n\nThe Master said: Causes arise from fate, not from human contrivance. One must follow the natural course, accept one’s time, and await one’s destiny. Inner cultivation and outward conduct depend entirely on the mind. Only by applying effort oneself can one achieve merit. Whether one practices or not, each reaps what they sow. When the teaching’s gate remains closed, one must remain concealed, with the mind in communion with Heaven. Once the teaching’s gate opens, outward conduct must also accord with Heaven and serve others. There is no limit to the merit one may accumulate, nor to the breadth of one’s conduct. But all depends on the steadfastness of the mind—only then can one attain fulfillment.\n\nSomeone asked: If I devote three years of diligent practice, can I escape the cycle of rebirth?\nThe Master replied: Those who cultivate the Way must establish firm resolve, advancing with unceasing diligence to refine the mind. How can one presume to harbor expectations of future liberation? There was once a Daoist who, upon first leaving the household life, boasted: “The cycle of rebirth is trivial—I need only apply some effort to escape it.” Though he began with resolve, an incurable illness soon befell him, persisting for years and gradually eroding his determination. How could such an outcome arise from overweening ambition?\n\nThe Master said: Those who inquire into the Dao should never tire of questioning, just as a traveler on the road asks directions to avoid going astray. Without a teacher, even minor skills cannot be mastered—how much more so this great Dao, which cannot be seen or heard? Without encountering one at the outset, how can one awaken to it? Of all sufferings, none surpasses birth and death. Without drawing near to a perfected being, how can one be freed from them? Thus it is said: The ancients did not learn the Dao lightly; they served true masters until old age. Without knowing where to begin or drawing near to those who have attained realization, even with resolve and discipline, one will err in countless ways.\n\nThe Master said: Those who cultivate the Way must apply effort and exert strength to temper the deeply ingrained, biased thoughts and attachments that have long accumulated in the mind. One must relinquish them with difficulty, even to the point of being willing to abandon this very body—how much more so the attachments of the mind. All that is false and illusory must be eradicated entirely, and then no afflictions will remain. As for all external matters and things beyond the body, they are not worth dwelling upon. The comings and goings before one’s eyes are like mosquitoes and gnats—brushed away, they bring relief. But the attachments that are difficult to relinquish from the mind—there lies the seed of rebirth.\n\nWhen Master Changchun resided at Fanxi, tigers and leopards often passed by at night, coming and going at dawn and dusk. At first, he felt fear and wished to erect fences. But then he reflected: In such circumstances, if I feel fear and seek to shield myself, can I ever truly escape birth and death? He resolved to let go. Abiding in equanimity, he allowed life and death to take their course. His fear naturally vanished, and even amid the trials of life and death, he remained unmoved. All entanglements dissolved at once—this is the practice of what is most difficult to practice.\n\nThe Master said: Those who cultivate the Way should emulate only the good in others, never their faults, lest they lose themselves. Nor should they engage in mutual criticism, for harboring judgments distorts the mind and hinders progress. Rightness can overcome wrongness, but wrongness will always slander rightness. Those who constantly criticize others out of self-attachment fail to see their own faults and belong to heterodox teachings. With true insight, one must examine one’s own mind for bias and error, seeking out one’s own faults. Those who concern themselves with the faults of others are not true practitioners.\n\nIn a monastic community, people gather from all directions—how can they all be the same, each following an identical path? It is like Mount Tai, which encompasses all things: some are useless, some become useful, some stand alone, some cling to others, some are rare and auspicious plants, some are wild brambles and thorns. Though diverse, each follows its nature and unfolds in due order. The mountain stands majestically, making no distinctions, embracing all—flowing waters and strange rocks, lush forests and abundant grasses, beasts that run and birds that sing—all manifest the wondrous workings of the immortals. They mutually sustain one another, like hemp and reeds that stand straight without support. Heaven and Earth endure, and each attains fulfillment in its own way. If one seeks to cut down the tall to fill the short, or change blue to yellow, not only will none find peace, but their original nature will be lost.\n\nWhen the assembly discussed appointing a monastic leader, the Master said: Those who cultivate the Way and take up the role of monastic leadership must measure their strength, act with simplicity and ease, and live lightly. They must not, like worldly people, contend for fame and profit, lest they lose their original aspiration and forget the great matter of life and destiny. They should appear yielding outwardly while remaining steadfast within. When facing difficulties, they should endure with patience, transforming reluctance into willingness. When circumstances are fitting, they should find peace of mind. Abiding in stability, they should welcome those from all directions, benefiting themselves and others, cultivating both inner tranquility and virtuous action—thus fulfilling both aspects of practice. If they do not refine the mind but mistake external things for themselves, they will become greedy and narrow-minded, accumulating faults and worldly entanglements, thereby ruining their future.\n\nUpon arriving at Changzhen Abbey, the Master addressed the assembly one night: Beginners who leave the household life cannot yet stand alone. Though they rely on the monastic community or form bonds with fellow practitioners for mutual support to avoid bias, there are three kinds of companions: cloud friends, good friends, and reckless or eccentric friends.\n\nThose with noble aspirations, who refine their minds, investigate the consequences of sin and blessing, sever worldly attachments, and wander beyond the mundane—seeking like-minded companions and forming steadfast bonds—are called *cloud friends and rosy-cloud friends*. Their minds resemble clouds and rosy dawns, untouched by worldly affairs.\n\nOthers study scriptures and teachings, play the zither, read books, chant poetry, engage in lofty discussions, and debate right and wrong. These are called *good friends and wise friends*, for though they do not refine their minds, they do not commit evil either.\n\nThen there are those who neither cultivate their minds nor study scriptures, heedless of sin and blessing. Their words are perverse, their actions reckless. At the slightest provocation, they quarrel, boast wildly, flaunt their strength, bully the good, and band together in cliques. These are called *reckless friends and eccentric friends*.\n\nAfter these three kinds of people depart this life, each is assigned a place according to their deeds, receiving their due recompense. The *cloud friends and rosy-cloud friends* ascend into the formless, roaming the Jade Capital, becoming immortals or celestial officials. The *good friends and wise friends*, their worldly minds not yet extinguished, remain within the cycle of human existence, subject to repeated retribution. The *reckless friends and eccentric friends*, having consumed the offerings of the ten directions without accumulating merit to repay their debt, may fall into the Dark Realm or be reborn among beasts, enduring the suffering of transmigration. When such a fate befalls them, how can regret avail? The wise and discerning should ponder this carefully and seek the most advantageous path.\n\nThe Master, urging the assembly to dwell in monastic communities, said: The Perfected One of Danyang has a verse: *\"Those who study the Dao and dwell in monastic communities must measure their depth and explore its shallows, choosing the virtuous as their intimate companions. If they cannot yet grasp the ultimate principle, they should cling to its essence and uphold its core.\"* In monastic communities, practitioners guide one another, lifting the banner and grasping the essentials to cultivate together the supreme mind-ground and the great Dharma gate—no small matter.\n\nYet some, lacking insight and direction, neither seek wise companions nor dwell in monastic communities. They idly claim to wander, heedless of the mind-ground, traversing mountains and rivers, going south and north, wasting straw sandals. They only seek ease and convenience, fleeing at the slightest obstacle. Such renunciates know not what is most urgent for themselves, nor how to spend their days—merely chasing comfort. Little do they realize that ahead lies the inescapable reckoning of life and death. How will they withstand it? Can they afford to drift through days, squandering time? What did they renounce the household life for?\n\nThe Master said: Practitioners vary in their natures—some sharp, some dull. Those of dull nature should not be rigid but should dwell in monastic communities, humbly preserving their minds. By associating with those of clear understanding and bright minds, they will naturally be guided onto the path, gradually awakening. If one’s nature is dull and lacking in insight, yet one daily keeps company with the like-minded, entangling with worldly affairs, the worldly bonds grow strong. Over time, one inevitably strays from the path, or encounters demonic realms, falling into hell with no one to save them—a profound sorrow.\n\nThe Master said: Even those who have long dwelt in monastic communities, receiving daily instruction, may grow negligent and complacent, their resolve for the Dao waning as worldly affairs increase. They become unruly and reckless, unable to attain stillness. How much worse for those who wander alone in the world, their worldly passions lingering, entangled in desires, their path obstructed at every turn, unaware of their own plight. Even if they encounter sages, they cannot be transformed. With a hundred evasions and deceptions, they delude themselves and others, gradually sinking deeper. Their blessings diminish as their karma grows. If they would but turn back, they might yet be saved. But if they cling to the dust and turn from the Dao, there is no recourse—hell awaits without delay.\n\nThe Master, discussing those who dwell in mountains, said: A practitioner in the mountains must see through things as they arise and respond to circumstances as they come. Each response is like a single act—once passed, it is done. Once, a Daoist lived in the mountains, wearing clothes of grass and eating wild plants, vowing never to descend, believing he had shed all worldly burdens. One day, two men bearing weapons came seeking food. The master cooked mountain fruits to offer them. When the fruit softened, one man reached into the pot, tasted it, and angrily said, *\"Who would eat such fare?\"* He was about to overturn the pot. The master said nothing. Seeing the men’s anger and hearing their harsh words, he secretly devised a plan. On some pretext, he went outside, found his hidden staff, grasped it, and shouted, *\"Come out, you two! You won’t dare come near me!\"* The men stepped outside and laughed: *\"Living in the mountains has made you so aggressive. You’d be better off descending to become a layman.\"* They left, and suddenly vanished from sight. The master then suspected they were sages testing him and could only regret his failure.\n\nThe Master, discussing the unmoving mind, said: Once, in Shandong, a practitioner boasted to his master that he had extinguished the fire of ignorance. The master said, *\"If the fire of ignorance is extinguished, the mind does not move—then you are a good person.\"* Later, the master secretly sent someone to test him. At dusk, the visitor arrived to find the hermitage gate closed. He loudly struck the door with his staff, and the master, hearing the harsh tone, reluctantly opened it. The visitor’s manner was violent, and upon entering the hall, he did not remove his shoes but leapt onto the seat, utterly lacking in courtesy. The master grew furious and severely rebuked him. The visitor clasped his hands and smiled: *\"I dared not act so—your master sent me to test your truly unmoving mind. Before the test was even complete, it was already revealed. No need for further trial.\"* The master was greatly ashamed and had no reply.\n\nGenerally, those who cultivate the Way may have some skill, but how dare they take pride in it? In an unguarded moment, their true state is revealed. Only when one’s heart is like cold ashes and their form withered do they lack the thought of self-praise—yet once self-praise arises, their true state is already exposed. Even if one attains unshakable stillness, there is still something beyond.\n\nSomeone asked, *\"What of the practice of those who dwell in seclusion?\"*\nThe master said: *\"Once, when Master Changchun was in the capital, he passed by a Daoist abbey. Behind it lived a recluse in a walled garden. The community was holding a ritual feast when someone reported to the Perfected One: ‘The master in the garden wishes to speak with you.’ The Perfected One decreed that they should meet after the feast. Unexpectedly, the Perfected One later went out and sought the recluse in his garden. He struck the gate loudly several times with his staff. The recluse, assuming it was an ordinary visitor, responded in anger. The Perfected One then turned away. After the feast, the community again requested a meeting, but the Perfected One said: ‘I have already tested him. His mind is still present—he is not yet ready for discourse.’ And so he departed.*\n\n*Generally, dwelling in stillness is for the sake of the work of nature and life—consolidating, securing, and nurturing one’s inner power is the true task. Meeting circumstances without disturbance is the test. Here, the sound of the gate being struck is the circumstance; the response is the mind. If the mind forgets the self, it is like cold ashes—even if there is light, there is no great flame. To meet circumstances without disturbance, responding with tranquility, is to have skill in the mind. Now, if a mere empty sound stirs the heart, how can one pass through all adverse circumstances? Though dwelling in seclusion, what use is it? Accepting others’ offerings, how can one repay such debt? It would be better to refine this stubborn heart among the community. One day, when the gold is fully smelted, one becomes a person of true insight.\"*\n\nThe master said: *\"Once, beneath the hall of the Perfected One of Longevity, there was a kitchen attendant. The community praised him for his gentleness and humility, saying they had never seen him lose his composure. The Perfected One, knowing this, had him tested. Secretly, someone moved the kitchen utensils to another place early in the morning. When the attendant went to prepare congee, he washed the rice and filled the pot, then urgently searched for the ladle and scoop but could not find them. The pot boiled over, and he grew greatly agitated. The Perfected One saw this and taught: ‘Even if it all spills out, these are merely external things—why disturb the heart?’ The attendant then awoke, bowed in gratitude, and that was all.*\n\n*The master, while overseeing work, addressed all present: ‘Once, beneath the hall of Master Shu, there was a man named Zhang the Immortal, skilled in carpentry. He never opposed others, was humble and yielding, and no one had ever seen anger on his face. The community praised and admired him, so they asked the Perfected One about him. The Perfected One said: “Not yet—he must be tested. It is like unrefined gold: without testing, one cannot know its authenticity.” One day, he was ordered to make a meditation bench. He assented and began the work. Before it was finished, he was told to make doors and windows as well. He reluctantly complied, but already showed signs of impatience. Before half the work was done, he was ordered to make several boxes. He refused, arguing before the Perfected One that he should finish one task before starting another. The Perfected One then said: “Previously, the community praised you for never opposing others and never losing your composure—today, the test has revealed the truth.”*\n\n*For those who cultivate the Way, when refining the mind and responding to affairs, the inner self must first be settled, at ease and harmonious. Externally, one responds to matters with perfect accuracy. What comes first, what comes later? Respond to what is urgent, even if it means grinding one’s bones to dust—only the mind must not move. Whether it is this task or that, these are but temporary things, without fixed substance. The mind must die; the mechanism must be alive. Simply respond to what is urgent in the moment, steadily and calmly, without disturbance or dullness—this is what is meant by “constantly responding, constantly still.”*\n\n*The master, seeing some lose composure during work, said: “For those who cultivate the Way, though external conditions are illusory, one cannot fail to respond. Responding without self, the mind’s essence is empty space. When affairs arise, there is no obstruction—just as empty space is unobstructed by the ten thousand things, and the ten thousand things do not obstruct empty space. Like the myriad forms and beings between heaven and earth, all move and act without hindrance. If the mind clings to the self, when affairs arise, there must be opposition. Then there is friction, and one cannot pass through swiftly. Stumbling and colliding, the self’s mind is disturbed. Once the mind is disturbed, there is no peace. Though one toils all day, it is labor without achievement.*\n\n*Living among the community and engaging in work, one must guard the self’s mind and not be easily moved. Constantly examine one’s own faults, never mind others’ wrongs—this is the work of cultivation. When the moment comes, one must take responsibility. The ten thousand circumstances and dusts of the world do not chase after them—the self is clear and bright, untroubled by any demon. Passing through life thus, with an unretreatant initial resolve, one naturally attains great merit.”*\n\nThe master, hearing someone discuss dwelling in a walled garden—building a hut within, enclosing it with a wall, and opening a small window for food to be delivered—said: *\"This is to sever ties with friends and devote oneself entirely to secluded cultivation. One day, the community asked him to come out and move about freely. An old friend saw him and asked: ‘Brother, what have you gained from your time in stillness? Can you maintain it amidst the bustle? Have you truly reached the point of unshakable stillness?’ The man was haughty and remained silent for a long time. His friend then said: ‘I have a touchstone to distinguish truth from falsehood. Let me test the heart you’ve cultivated in these years of seclusion—what do you say?’ The man replied: ‘What is there to say of stillness?’ The friend said: ‘If that is so, you will go forth with fur and horns, repaying the debt of others’ offerings.’ The man grew furious and began to curse. The friend laughed and said: ‘This is what you’ve gained in the garden—indeed, the test has revealed it.’ The man was so enraged that he severed ties with his friend for life.\"*\n\nThis man had never tempered his mind amidst circumstances—merely sitting in stillness for a hundred years would yield nothing. It was like whipping a horse to make it stand still: once the rope was loosened, it would bolt as before.\n\nThe Master said: Once, during a rainstorm at the Hall of Restraint, the manager called for general labor, summoning all without regard for age or youth. The crowd rushed to respond, save for one old immortal who remained seated, unmoving. When the task was done and all gathered in assembly to mock the old immortal, someone reported this to the Perfected Lord of Long Spring. The Lord rebuked them, saying: \"How much can one destroy falsehood to reveal truth? One who has truly tempered the mind to its resting place is like a priceless pearl. Let each act according to the state of their own heart.\"\n\nIn the teachings, what is rare is to find one who has truly attained.\n\nSomeone asked: \"When I walk or sit alone in the mountains, I personally witness mountain spirits foretelling future events—is this real?\"\n\nThe Master said: The common mind clings to the ten thousand dusts, dull and unclear. When beginners leave the household life, they grind away the dust of the heart. If by chance they attain stillness and suddenly encounter a tranquil state, they generate strange visions—demonic faces and spectral forms. Taking these as the true ground of the heart, they rejoice without cease. Some see themselves foretelling future events; others hear voices in the void predicting things that later come to pass; still others encounter departed masters, true spirits, or immortals who appear before them to instruct their hearts. If one clings to these experiences, it is already falling into delusion. If not abandoned, they nurture a sickness of the heart for which there is no cure.\n\nHave you not heard the ancients say: \"Perception, awareness, and knowledge are themselves afflictions\"? Moreover, all that is seen with the eyes, heard with the ears, or conceived in the mind belongs to the realm of sound and form. Have you not read in the ancient scriptures: \"It cannot be seen when looked for, cannot be heard when listened for, cannot be expressed in words, cannot be reached by thought\"? To take what appears in sound and form as real is to fall into the demonic path.\n\nOnce, a Daoist in meditation suddenly tasted wine in his mouth and dreamed of someone delivering wine. The next day, wine was indeed brought to him. This was merely the heart’s emptiness evoking a spiritual response—nothing extraordinary. To take it as real is to fall into delusion.\n\nAnother Daoist, while sitting, suddenly found his spirit departing his body. It wandered several hundred paces away before returning, only to see his original form still seated upright. This happened several times, yet it was nothing extraordinary—no different from ordinary thoughts wandering outward, merely clearer in detail. To regard it as an achievement is to fall into delusion.\n\nAs the saying goes: \"Of all auspicious signs, none compares to ordinary peace and stability.\" This accords with the Dao.\n\nThe Master said: In stillness, the visions encountered by practitioners are manifold, all conjured by their own consciousness, arising in quietude to seduce the sovereign mind. Have you not heard the ancients say: \"All appearances are illusory\"? When the heart seeks to dispel consciousness, consciousness remains and transforms into forms—demonic faces, spectral shapes—disturbing the lord of the mind. If the lord remains unmoved, seeing as if not seeing, embodying emptiness, with nothing to grasp, the visions naturally dissipate. Without a realm to invade, nothing can be corrupted.\n\nOnce, a Daoist who had attained rest for his heart was sitting one day when suddenly countless evil spirits descended from the sky. The man steadied his heart, making his body like the vastness of space. In profound unknowing, he resolved to let his body live or die as fate willed. The demons scattered of their own accord. With the sovereign present and utterly still, what demon could remain? The deluded mind had not yet been exhausted, so these appearances manifested. When the nature of reality is perfectly clear, they vanish of themselves.\n\nThe Master said: Once, a gardener heard people speak of the \"ground of being.\" Entering the garden, he wished to see this ground, and as his mind dwelled on the thought, it manifested in response—though he did not know it was false. What is heard with the ears belongs to sound; what is seen with the eyes belongs to form; what is imagined in the heart belongs to delusion. Thus he saw golden youths and jade maidens, true immortals and sages appearing in broad daylight—yet all were illusory realms, fabrications of deluded thought. Taking them as the \"ground of being,\" he could not dispel them, muddling through his life, ensnared by delusion and possession.\n\nHe did not understand that the \"ground of being\" is what the ancients called the place where the heart’s activity reaches perfect stability and rest. It is like preparing a dwelling place: clearing away brambles, sweeping aside rubble, leveling the ground so it is fit to inhabit—this is called the \"ground of being.\" For the practitioner, when the heart-ground is stable and untroubled by circumstances, it is an unshakable ground; when the ten thousand dusts cannot stain it, it is a pure ground; when one’s original dharmakāya is revealed, radiant and self-sustaining, it is a luminous ground. All talk of the \"ground of being\" has its limits. When one reaches the place without location, without direction, beyond names and words—this is what is called \"mysterious beyond the mysterious.\" How could what is seen with the eyes, heard with the ears, or conceived in the mind ever suffice?\n\nSomeone asked: \"This student has always held that the matter of life and death is of utmost importance, yet my seeking has brought no clarity. What is the meaning of this?\"\n\nThe Master said: When a single thought does not arise, there is no death. Those who cannot do this are burdened by emotions in the heart and dust on the nature, endlessly manipulating life and death. Seeking liberation, they chase after each transgression, pursuing it again and again until not a trace remains. The source is fundamentally pure—neither following sound nor chasing form, at ease everywhere, empty and carefree, enduring as heaven and earth, the true sovereign becomes self-evident.\n\nWhen the heart is upright, all things are upright; when the heart is crooked, all things are crooked. With a sovereign within, what others love, one does not love; what others despise, one does not despise. All old habits are turned around. When the six senses are empty, the true sovereign abides in stillness—what fear of life and death remains?\n\nIf one reaches such a state, yet finds oneself unable to gather or restrain, unable to contain or conceal—like one possessed by some malevolent spirit—racing outward in wild abandon, drifting recklessly, this is the scattering of spirit and qi, losing mastery over oneself. Taking this for true joy or true delight, one fails to recognize that joy without joy is the true joy, and delight without delight is the true delight.\n\nThe ancients would sing and dance as they walked, yet even in that moment, they were dissolving stagnation and parting from attachments, finding their own delight therein. How could they ever indulge the heart in reckless abandon, deceiving and bewildering the world?\n\nThe master, during a discussion on the opening of wisdom’s treasury, spoke of the surging forth of its source: \"For one on the path of cultivation, the initial departure from sensory realms is like a mirror suddenly polished bright. When wisdom’s treasury opens, thoughts form into verses without effort—yet one must not cling to them. If the heart’s seal is fixed, functioning without response, it becomes wild wisdom, devoid of merit, merely the operation of spirit, not the essence of the Dao.\"\n\n\"Do not gallop about, mistaking it for skill. Only through nurturing and refinement does merit arise.\"\n\nSomeone asked, \"I will not ask about the past or future—what is the present mind?\"\n\nThe master looked straight ahead and said, \"This is not the present.\"\n\nThen, lowering his head, he said, \"This is not the present.\"\n\nAgain, he asked, \"Do you understand?\"\n\nThe person smiled and said, \"I do not.\"\n\nThe master replied, \"Even with eyes wide open, you fail to recognize the present—how then can you speak of past or future?\"\n\nAnother asked, \"The past is not pursued, the future not anticipated—what of the present?\"\n\nThe master said, \"Extinguish movement but not illumination. Further, you must grasp *who* it is that extinguishes movement. Once attained, the power rests in your hands—whether to extinguish or not is yours to decide.\"\n\nAnother asked, \"What is the stabilization of nature?\"\n\nThe master shifted his seat forward, sat upright in silence for a long while, then said, \"What stabilization of nature do you ask about?\"\n\nThe person did not comprehend. A nearby elder rose and bowed in gratitude.\n\nThe master said, \"Zhang drinks the wine, but Li becomes drunk.\"\n\nThe person still did not awaken.\n\nThe master said, \"Scholars do not sleep, for their work is the refinement of the heart. If the heart is not gathered, what use is there? Those who gamble, play chess, spin thread, or grind grain—staying awake all night—are they those who attain the Dao? Such people, driven by profit in every moment, are lured by greed, their minds disturbed like mosquitoes biting the skin. Thus, they cannot sleep. The cultivator is not like this. Sleep is but one desire; if not transformed, it breeds delusion, obscuring clarity, belonging to the yin realm. Like one guarding against thieves, sitting vigilant—thieves will retreat of their own accord. Focus on refining the heart, lest it drift into dissipation. This heart, fundamentally without fixed form, is bright in yang and dark in yin. When familiar realms dissolve, there is non-doing and purity; the pearl of nature shines clearly—this is why one remains awake day and night.\"\n\nThe master said, \"Cultivators struggle with this stubborn heart. From beginningless time, the bones of cyclic existence have piled like mountains. Through ten thousand births and deaths, only now does one awaken to past errors, seeking liberation. Thus, by day one dares not eat, by night one dares not sleep—refining this stubborn heart until every worldly inversion is overturned, only then can it be of use. Without refining the heart, even if one sees others not sleeping and imitates them, thoughts arise like hairs, igniting like sparks at the slightest touch. What use is a hundred years without sleep? If the stubborn heart remains, one is still bound to the cycle. To transform this heart, whether in movement or stillness, moment by moment, shatter this stubborn heart to pieces—only then can it be of service. The original true spirit is akin to heaven and earth. Then, in motion it is the Dao, in stillness it is the Dao; speaking it is the Dao, silence is the Dao. What else is there to seek? This is the carefree Daoist.\"\n\nSomeone asked, \"Those who cultivate from the beginning must first establish resolve—what is resolve?\"\n\nThe master said, \"In every moment—whether in movement or stillness, in all circumstances, in walking, standing, sitting, or lying down—let every thought be of the Dao. Unshaken by demons, unmoved by harm, whether in ease or adversity, iron-faced or otherwise, one stakes this body without hesitation, advancing single-mindedly without fear of life or death. This is a person of resolve.\"\n\nThus, the sutra says: \"Those who practice with vigor have resolve.\"\n\nThe master said, \"Cultivators must establish resolve and integrity. Yet when resolve and integrity are set, one may become rigid. Rigidity makes one inflexible in matters. When one becomes adaptable in matters, one may grow complacent, letting days pass idly. Thus, scholars are as numerous as ox hairs, but those who attain are as rare as qilin horns. Generally, those who study the Dao must first return to the ancestral source, decisively establish resolve and integrity, recognize adaptability, practice single-mindedly and diligently—persisting without cease, there is nothing that cannot be achieved.\"\n\nThe master said, \"The Daoist refines the heart like forging gold into a chicken. Though its form resembles a chicken, its heart remains unmoved, standing apart from the flock. Though chickens may be combative, none dare approach. One who embodies the Dao has a heart like cold ashes, a body like a withered tree. Though the hearts of the world may be contentious, none dare contend with them.\"\n\nThus, the sutra says: \"Only because they do not contend does the world have none who can contend with them.\"\n\nSomeone asked, \"The supreme matter is complete in everyone—why refine it further?\"\n\nThe master said, \"The unrefined heart is like ore containing silver—before smelting, it is but a stubborn stone. Placed in the great blazing furnace, impurities are burned away, the true substance separated. Once refined into gold, it no longer returns to the furnace.\"\n\nThe practitioner of cultivation is likewise thus. The heart shrouded in ignorance and clinging is like unrefined ore—take resolve as the great blazing furnace, wisdom as the black charcoal, and refine it with ardent devotion until not a trace remains. What emerges is one’s own originally unimpeded, primal heart. Once made true, it is no longer false. Guard it well, preserve it steadfastly, and when you comprehend its use, this is the priceless, ever-bright pearl of ancient perfection.\n\nThe master said: Those who have long studied the Dao must discipline themselves for the benefit of others, silently accumulating merit and conduct. If the heart remains deluded and one acts without principle, not only does this disgrace the teachings, but one also invites calamity upon oneself. Whether in body or speech, if one is neither pure nor frugal, one differs not from the common folk. To enjoy the sweat and blood of the ten directions is no easy gain—what is taken in joy must be repaid in suffering. When the hour of birth and death arrives, there will be no tricks left to evade it. Since you dwell within this gate, how can you not refine the heart?\n\nSomeone asked: Everyone seeks joy—why do Daoists embrace suffering?\n\nThe master said: Worldly people know not true joy. They take what pleases the heart as joy, yet desire leads them into suffering, and they mistake suffering for joy. Daily, they scheme and calculate, seeking worldly pleasures. When they fail, sorrow and distress entangle their spirits, leaving them forever restless—this is the greatest suffering. The practitioner of the Dao seeks not worldly joy but holds the great Dao in the heart. Encountering suffering, they do not suffer; without suffering, they abide in constant joy, their hearts at ease. Where there is joy, there is suffering; where there is no joy, there is no suffering. A heart free of joy and suffering—this is true joy.\n\nSomeone asked: Why do practitioners of the Dao willingly endure poverty and hardship?\n\nThe master said: If one merely accepts poverty, hunger, and cold as right, then the beggars in the streets and the destitute would all be immortals. The practitioner of cultivation takes virtue and power as the heart, purity and stillness as the mind, cutting away deceit and falsehood, greed and reckless action—all dispelled in an instant. Forgetting form and self, they give no thought to external things. Thus it is said:\n*A robe to cover skin and flesh—what need for fine or coarse?*\n*Food to fill the belly—what need for refined or plain?*\nTheir sole concern is the inquiry into birth and death and the refinement of the heart, so they do not cling to the suffering of the body.\n\nThe master said: The practitioner of cultivation gains a measure of skill and develops a sense of superiority; with full mastery, this sense grows tenfold. Yet with superiority comes the mark of self, and the self’s arrogance becomes a great obstacle. How can one reach the realm of an empty heart? If extinguished, it must be rekindled with even greater intensity. Place your body and mind beneath all things, always yielding to others, and reflect that you are inferior in ten thousand ways—only then can the heart of pride and superiority be cast aside. When the heart is like the vast emptiness, there is no self; without self, one accords with the Dao.\n\nThe master said: The practitioner of cultivation gathers in the heart as if it were a carved wooden statue seated in the hall—whether no one is present all day, or whether it is draped and adorned, or offered incense and flowers, or slandered by passersby, it remains thus. Only this wooden statue, spiritually awakened and sagely, vividly illuminates virtue and power, yet does not cling to any affair or thing.\n\nSomeone asked: My thoughts follow one after another, impossible to sweep away—how can this be right?\n\nThe master said: Sweeping the heart-ground daily only stirs more unrest. If you wish the heart-ground to be still, strike down the handle of the broom.\n\nThe questioner bowed in gratitude.\n\nThe master said: When practitioners first leave the household life, it is for the sake of this great matter of life and destiny. Yet with the passing years, they unknowingly become moved by things and instead learn verbal tricks and a hundred kinds of skills, serving as slaves and maids. How can one know this? Whenever there is a skill, one must display it before others—is this not being enslaved by others? How can it be the work of a master of purity and non-action? Thus it is said: The wise use things, while the foolish are used by them. The skillful are not employed by the skillful, but the clumsy are; the eloquent speak, while the silent listen carefully and ponder. Who is busy? Who is at leisure? Those who wish to cultivate must keep the heart-ground clear yet appear foolish—then all the clever in the world will serve them.\n\nSomeone asked: Practitioners speak of knowing and awakening, yet also call it a sickness—what is the meaning?\n\nThe master said: True knowing is knowing without knowing; true awakening is awakening without awakening. The original true spirit, once obscured, only now awakens—this is called awakening. All knowledge and perception arise from this. To speak of having knowing and awakening, and to desire constant knowing and constant awakening, is to bind and burn oneself without cause. Yet if one remains entirely without knowing or awakening, one slips into another shell. Once awakened to the fundamental truth, knowing and awakening become tools—use them when needed, but do not make them constant.\n\nSomeone asked: What is the awakened nature of the practitioner?\n\nThe master said: Pointing east and drawing west—stop such empty gestures and apply real effort instead. Consider the passions, desires, afflictions, self, and ignorance that dwell in the heart and before the eyes. It is like a vast, slippery well of crystal before you—if you do not watch your step even for a moment, you will fall in and never escape for ten thousand kalpas. If you see it clearly and recognize the danger, then as you prepare to step forward, swiftly retreat and watch carefully—this is your awakened nature. If you have clearly fallen into the snares of self and others yet still point to emptiness and speak of the ultimate, what use is such awakened nature?\n\nSomeone asked: Among those who have left the household life, some study the public cases of the ancients, some study the scriptures, and some say that reflecting on the mind in the ancient teachings—are these correct?\n\nThe master said: Those who cultivate the Way originally refine themselves to ascend from the mundane to the sacred, yet since leaving the household life, they refuse to take this as their task. Instead, they search only among the words of the ancients, making a living within the characters on paper—counting lines and tallying ink, entangling themselves in vines and creepers. They exhaust all effort, but what good does it do? When Old Yanluo summons them, not a single phrase will serve, not a single word will avail. If even a single word is of no use, then one who knows nothing of worldly affairs yet passes through life in drunken oblivion is somewhat closer to the mark. Take the effort spent in such chasing and turn it toward your own fundamental task—then you will not have wasted your time.\n\nWhat is this fundamental task? It is simply this: the one who governs the body, that single spark of numinous clarity received from the Dao. From ancient times to the present, its purity has ever been thus—what more could you desire? When you have personally verified and understood this principle, it becomes the proof of transcending the mundane and entering the sacred. If you can truly believe this, then begin your practice at once. This is your own case—why count the treasures of others? Quickly turn inward and apply it to yourself, and from this day forward, you will not be deceived by others.\n\nThe master said: Those who cultivate the Way, if their true eye is not opened and their inherent mechanism does not activate, but they only seek on the traces of others and speculate on their words, will never find the right path. It is like a blind man hearing others describe the light of the sun and moon—he will never see it for himself, only imagining it. This is because he has never applied effort to his own mind.\n\nSomeone asked: Formerly, I heard that Master Danyang attained the Way swiftly through awakening to death—what is the meaning of this?\n\nThe master said: Those who cultivate the Way should regard this body as a condemned prisoner being dragged to the marketplace, each step bringing them closer to death. With death as their constant thought, they relinquish all things. Though sounds, sights, and the splendor of the world surround them, their eyes see nothing, their ears hear nothing, and every thought is forgotten. Even this body is abandoned—how much more all else? Refining the mind in this way brings swift attainment. In death, one finds life, neither born nor dying. For beginners in the Way, rescuing themselves from birth and death should be their sole concern. A single breath not taken, and one is already in the realm of death—each must save the other, and none can afford to procrastinate.\n\nWhen the master was gravely ill and could not recover, he addressed all present: Those who cultivate the Way must first see through the emptiness of all external conditions, then recognize this body as but a heap of dust. In daily affairs, be free and at ease; at the time of departure, you will surely attain liberation. Formerly, at Dongshan, an abbot lay dying, lingering in prolonged suffering, unable to free himself. He sent someone to ask True Man Changchun: \"In the past, I was attached to external conditions and never cultivated my mind amid the objects of the world—this is why I now suffer and cannot attain liberation.\" Changchun sent back these words: \"The body is not yours; the nature is fundamentally empty. When not a single thought arises, the whole body is released.\" Upon hearing this, the abbot seemed to awaken. He instructed his fellow disciples: \"I was deluded by external conditions, and thus my mind remained unrefined. My cultivation was indecisive. Now I urge you all to apply yourselves diligently to refining body and mind, and to investigate this great matter of birth and death.\" With these words, he passed away.\n\nThere was also a Daoist who, at the point of death, could not depart. He asked those around him: \"How can I go?\" Someone said: \"Imagine you are a true person.\" He imagined for several days but still could not go. Another said: \"Imagine emptiness.\" Again, he could not go. An old immortal heard of this and came to see him. The man recounted the previous suggestions, saying he still could not depart. The old immortal rebuked him: \"What did you come with? What are you imagining now? Simply await your fate—when the time comes, you will go.\" Upon hearing this, the sick man bowed in gratitude and passed away.\n\nGenerally, for those who cultivate the Way, all external conditions are provisional tools for the present, but one’s own fundamental reality must be cultivated in earnest. If you can pass through worldly affairs with freedom and ease, how could you not be free at the time of departure? If you are attached and stained by things and affairs, how could you be free at the time of departure? Urgently refine yourself in the face of birth and death—who knows when that day will come? What good are external conditions then? Each of you, reflect on this.\n\nWhen a certain Daoist fell ill, the master addressed all present: Those who cultivate the Way regulate their diet, maintain regularity in movement and stillness, and keep their minds and spirits at peace, without reckless actions. If they fall ill, it is Heaven’s decree—how dare they refuse it? It may also be the unfolding of their own karmic destiny, or the result of past causes manifesting as this illness. First, recognize that the four great elements are all illusory. If there is sickness, let it be sick; if there is death, let it be death. Remain calm and composed, and let things transform as they will. If the mind is not fixed on illness, a severe illness may become mild, and a mild illness may be cured. When the self-nature is peaceful and harmonious, foul and turbid qi disperse. This is repaying the debt of illness, passing through another barrier. If you do not understand this, the mind will not be at peace. At the slightest ailment, the mind becomes frantic, crying out in pain, cursing heaven and earth, resenting others for not supporting you, blaming them for not seeking a doctor, reproaching them for not preparing medicine, scolding them for not visiting. All the while, you give rise to ignorance, darkening the mind with karmic actions—nothing you do is right. Do you not know that your birth and death are already determined? Even if you rush about in panic, can you escape? With the mind in turmoil, you cannot find peace. Do you not know that the mind is the master of the body? If the mind is not at rest, the whole body is in chaos. Have you not heard the ancients say: \"When the mind is distracted and the thoughts scattered, the gates of hell open\"—you bring misfortune upon yourself. In such a state of mind, a mild illness becomes severe, and a severe illness leads to death, for the nature is befouled and disordered.\n\nIf in all matters you lack restraint and excess leads to illness, then the illness is self-inflicted, and you alone must bear it—whom else can you blame? If you cultivate the mind-ground, you will never act thus. Ponder this well.\n\nSomeone asked: *\"Daoists also fall ill—how is this different?\"*\nThe Master replied: *\"Long ago, Master Danyang fell ill, yet physicians could not read his pulse. Master Huqiu sat in meditation, yet physiognomists could not discern his true nature. Why? Because when the mind is not attached to things, the workings of creation cannot alter it; when the nature is not bound to any school, even spirits cannot fathom it—how much less can ordinary physicians or diviners? This is what sets them apart from common people.\"*\n\nThe Master said: *\"Those who cultivate the Dao model themselves on heaven and earth in their daily conduct, ever pure and ever still, luminous yet unobscured. They aid beings and benefit life, though they mingle amidst the ten thousand conditions and myriad circumstances. Their true source remains serene and undisturbed, without interruption. Thus they naturally attain liberation from the bonds of birth and death. This is the great matter of karmic causation. Yet how pitiful are those who fail to awaken! Lacking inner mastery, their desires assail them from within while the senses and their objects lure them from without. They cannot act freely, and the four kinds of birth revolve endlessly, the six paths of rebirth churn without cease. Even if they were to change their very skin, they could never be as they are today.\"*\n\nSomeone asked: *\"If one is said to harmonize with the world yet not cling to things, how is this possible?\"*\nThe Master replied: *\"Heaven is heaven, earth is earth, mountains are mountains, waters are waters, things are things, and I am I. Though one mingles with the world, how can one truly cling to it?\"*\n\nSomeone asked: *\"Do future blessings and misfortunes truly exist?\"*\nThe Master said: *\"Do not ask about the future—let us speak of the present. When you generate a good thought, wishing to burn incense and bow before the sacred, your hand lifts the incense as your heart makes vows for your family’s peace, longevity, and fortune—this is not the mind of true goodness. Though you may seek blessings, even if received, you will not know it. For those who cultivate goodness, the reward is hidden, and thus none perceive it. But if you harbor an evil thought, raising a knife to kill, the moment the intention arises, you have already incurred the debt of a life for a life. This cannot be evaded in the realm of clarity and perfect justice. You may scheme in secret, believing it unseen, but soon your deeds will be exposed, and you will repay the debt—this is not seeking misfortune yet finding it. For evil brings manifest retribution, and this is an evident truth for all to see. Moreover, heaven observes what humans cannot—where can you flee? You cannot but be cautious.*\n\n*Someone asked: ‘People speak of heaven and hell—do they truly exist?’*\nThe Master replied: *\"Heaven is the yang realm, governing goodness and blessings. Hell is the yin realm, governing evil and misfortune. The ancients established heaven and hell as reflections of the human mind. One’s actions resonate in the unseen. If one is ever pure and ever still, benefiting all beings and practicing goodness with clarity and unwavering resolve, one belongs to the yang realm. But if one engages in all manner of evil, deceit, and injustice, following perverse paths, one belongs to the yin realm. Ignorance and darkness grow unchecked, filth and defilement accumulate—all recorded in the black ledger, intolerable to gods and humans alike. When the mind is afflicted and myriad sufferings assail, with no one to save you, that is hell. The ancients said: ‘A clear mind and tranquil intent are the path to heaven; a scattered mind and chaotic thoughts are the gate to hell.’ It is like hearing from a trustworthy person that bandits lie in wait along the road, often harming travelers. If you believe the warning and turn back, you will avoid harm. But if you dismiss it and stumble forward drunk, reaching the mountains unscathed is mere luck—if bandits truly lurk, you will fall into their trap, and regret will come too late. The teachings on hell follow the same principle. Generally, doing evil is never better than doing good. Even if goodness brings no reward, what fault is there? But if you persist in evil, calamity will surely strike. If you fail to repent even when the consequences are plain before you, how much less will you foresee what lies in the unseen?\"*\n\nSomeone asked: *\"It is said that karma spans three lifetimes—is this true?\"*\nThe Master replied: *\"Have you not heard the ancients say: ‘When delusion is ended, karmic obstacles are fundamentally empty; while delusion remains, one must repay past debts.’ Long ago, a man suffered from a festering sore, the pain unbearable, pus and blood flowing endlessly. Seeking solitude, he hanged himself. Such a person, neither understanding his own nature nor willing to endure the karmic debt of pus and blood from a past life, though he took his own life, would only be reborn to repay it. How do we know this was past karma? Once there was a high official—let us not speak his name, but the principle of cause and effect suffices. Cruel and tyrannical by nature, he would beat his servants at the slightest displeasure. One day, he suddenly felt an itch on his buttocks. Scratching it, he tore away the skin, and soon flesh and blood split open, as if freshly flogged, the pain unbearable until he died. Thus we know that the debt of pus and blood must be repaid. Not only this, but even minor likes and dislikes, slander, beatings, quarrels, and grudges held at first sight—all are old karmic entanglements from past lives. In this life, one must repay them willingly, accepting and enduring without complaint. This is how debts are settled. But if you contend and refuse to repay, the debt only deepens, the enmity compounds, and there will be no end to it. Moreover, heaven favors repayment, and even in human affairs, every injury and grievance is but a karmic debt. Once, when Master Changchun resided at Changzhen Abbey, a great army returned from the north, and he hid to avoid them. He encountered a nobleman, an old acquaintance whose family had long practiced the Dao. The man said his wife had been captured and that he wished to spend his entire fortune to ransom her and let her leave the household to take vows. He sought the Master’s guidance...\"*\n\nThe Master firmly declined the proposal. By the time they had finished discussing it, the troops had already marched far away. Later, the nobleman asked why the Master had refused. The Master replied: \"Your wife and the man who captured her share a three-year karmic debt from a past life. Now that they have met again, it is the fulfillment of that previous cause. After three years, she will be released and come here to leave the household and take vows.\" Indeed, three years later, she was set free, donned the hairpin and robes of a Daoist, and came to the abbey to pay her respects to the Master. Because she had long practiced goodness, she was able to enter the Dao. Only then did the nobleman believe and bow in gratitude.\n\nThe Master said: \"The Dao cannot be expressed in words; it only points to good and evil. Goodness establishes the unexcelled cause for transcending the world—there is heaven, no hell. Evil leads to endless suffering—there is hell, no heaven. These two paths arise from delusion or awakening: awakening brings instantaneous sagehood, while delusion leads to eternal sinking. Having attained a human form, how can one not reflect on this?\"\n\nSomeone asked: \"What are fortune and misfortune?\"\nThe Master replied: \"Piling wood makes a forest; piling stones makes a mountain; piling water makes a sea; piling goodness makes fortune; piling evil makes misfortune. The source of fortune and misfortune lies in the mind alone. Once accumulated, how can one not be cautious?\"\n\nAnother asked: \"How can one escape the cycle of karmic retribution?\"\nThe Master said: \"Karmic retribution belongs to the shell of yin and yang. If you break free from this shell, then there is no karmic retribution. What is the shell of yin and yang? Any trace of selfish desire or wickedness in the mind belongs to the yin shell; any trace of good intention belongs to the yang shell. Within yin, there is evil retribution; within yang, there is good retribution. But if you have refined your mind until it is like empty space—utterly without good or evil, without the slightest entanglement—then you become the master. Fortune and misfortune cannot touch you; cause and effect cannot bind you. This is a person who has broken free from the shell of yin and yang.\n\nThose who remain in the household life never have a single ancient thought in their hearts. All twelve hours of the day, they scheme for wealth and profit, engage in life-and-death struggles, deceive and entrap others, their minds shrouded in ignorance and dark karma. They are trapped within the yin shell, unable to reach the yang path. How then can they break free from the shell of yin and yang to attain freedom from karmic retribution? Is it not difficult? You have created this fate yourself—how can you escape it? Thus, when you lower your head and close your eyes, you leave it to King Yama to decide.\"\n\nSomeone asked: \"What exactly determines one’s future rebirth?\"\n\nThe master said: A person’s lifetime is spent following their emotions to shape their own mold for the next life. Those who do good forge a mold of goodness; those who do evil forge a mold of evil. This continues until the end of this karmic body, when the original nature departs the kalpa. This shell is like molten iron poured into the self-made mold by the Creator—whether as a human or as another being, one reaps what one has sown. Does the Creator intend for you to become an animal? Does the Creator intend for you to enter the six realms? It is the shell you have forged in this life, trapping you within it with no escape. First there is this nature, then there is this form. For example, the cruel become snakes; the stingy become dogs; the lustful and murderous become swine; the greedy and violent become wolves. Generally, all follow this pattern. Between heaven and earth, the myriad forms and shapes are beyond description. Thus the ancients said: \"In harmony with metal and stone, one transforms into metal and stone; in harmony with water and fire, one transforms into water and fire.\" Their words are true. In an instant, one may lose the human form and not regain it for ten thousand kalpas—why not reflect on this?\n\nThe master addressed the assembly: In the midst of others, all that one does and acts upon will bear karmic retribution. Those who embody the Dao attain the Dao; those who perform good deeds gain blessings; those who commit evil deeds suffer misfortune. Those who love others are loved in return; those who are trustworthy are trusted; those who benefit others are benefited; those who harm others are harmed. Those who exalt themselves are humbled by others; those who humble themselves are elevated. Those who disdain others are disdained; those who respect others are respected. Those who hate others are hated; those who seek precedence are contested; those who act with strength are opposed. Thus it is said: Plant orchids and you reap fragrance; plant millet and you reap grain—all follow the principle of karmic retribution. If one harbors a mind of profit and employs deceit to win others’ hearts, one loses authenticity.\n\nThe master said: If the heart has not yet penetrated the Dao, one may travel a thousand miles to seek a teacher and inquire, and if the connection is as precise as a needle meeting a magnet, the mind-ground becomes clear, all doubts vanish. Then, whether dwelling in a walled garden, residing by a forest spring, begging in the marketplace, or establishing a temple, one may settle the mind and guard the Dao without deviation or corruption—this is the superior practitioner of the true. There are those who leave the household life, yet their nature remains unclear. Lazy in inquiry, proud and competitive, clinging to their own views, they feign the appearance of high attainment, neglecting merit and losing conduct. Both sides come to nothing. They deceive others into offering alms, never considering how their own virtue can repay such gifts. Such people are unfit to dwell in gardens or beg for food; when the time of life and death arrives, they are of no use. This is because they refuse to work at the root. Even after a hundred years, they achieve nothing.\n\nThe master said: In the past, when I dwelled in the mountains, I shut my door for over a decade, avoiding all human affairs. My heart was set on stillness, yet I accumulated no merit or conduct. Sitting alone where no one disturbed me, untouched by circumstances or things, how could this heart discern formation or decay? It was merely passing time in emptiness. If heaven does not benefit beings, the four seasons cease to turn; if earth does not benefit beings, the myriad things fail to grow. If one cannot benefit oneself and others, what merit is there? Thus Master Changchun said: \"In movement, bring peace to people and benefit beings.\" This accords with the Dao of heaven and earth.\n\nSomeone asked: For those who cultivate the Dao, every moment must be free from delusion—how can one achieve this?\n\nThe master said: At the beginning, before the heart is refined, one does not know how to gather or release. Encountering circumstances or things, one clings to them entirely, renewing in the morning and decaying by evening, persisting until exhausted before ceasing. Unaware of oneself, one is deluded. It is like rebirth—unconsciously slipping into another shell, remaining until the karmic debt is repaid before returning. This is delusion. If one relies solely on knowledge and awareness, one is deluded by knowledge and awareness. The cultivator who can examine themselves in every moment of the twelve hours, untouched by even a speck of emotional dust, lightly passing through circumstances and things, is free from delusion.\n\nThe master said: The paths of the ordinary and the sage are the same; the difference lies only in clarity or delusion. Clarity makes one a sage; delusion makes one ordinary. The heart of the ordinary person refuses to sever emotional attachments, abandon falsity, or eliminate evil. Drifting with circumstances, swayed by emotions, they seek momentary pleasure, accumulating kalpas of suffering, never reflecting, never awakening.\n\nThe master said: The cultivator who remains unblemished in their fundamental nature, applies effort in conduct, swiftly passes through external things, remains unattached to human affairs, does not entertain the slightest deviant thought, leaves no trace of dust, and abides in luminous emptiness—neither clinging to emptiness nor existence, neither grasping dharma-appearances nor self-views—who gathers the light of all beings and, over time, mutually enhances inner and outer, will perceive the realm of the sages and worthies. What doubt remains?\n\nThe master said: The cultivator must first clarify their fundamental nature, then master the teachings. If the fundamental nature is unclear, it is like a person without eyes—unable to distinguish the path, every step is mistaken. If the teachings are not understood, it is like a person with eyes sitting in darkness—prone to partiality and attachment. One must master both self and teachings to respond perfectly. If neither is mastered, it is like sitting in great darkness without eyes—when will one ever emerge?\n\nThe master said: If the cultivator’s mysterious pass remains unopened and the mind-ground unclear, their karmic consciousness cannot attain non-action, for they lack merit and virtue. They should therefore engage in active practice within the teachings, cultivating according to their capacity, establishing deeds, welcoming those who come, maintaining humility, respecting teachers and friends, constantly practicing kindness, and eliminating selfishness and deceit. Over time, as familiarity deepens and progress is made day by day, there will naturally come a point of breakthrough.\n\nWorse still is the state of one who, like a roof with empty eaves at both ends, can neither attain non-action nor engage in action—merely drifting through days without merit or practice, planting their feet in seclusion, savoring sweetness with their mouth, idly meddling in worldly affairs, thrusting themselves into clamor, indulging body and mind without fear of divine judgment, and calculating their days ahead.\n\nHave you not heard the words of True Man Changchun: *\"To cultivate the mind-ground, wholly cast aside worldly affairs. To exert effort in the teachings is to stir up worldly toil.\"* If you pass your days in idle routine, reflect upon yourself—what manner of person are you?\n\nA physician once asked: *\"I have practiced medicine and revived over a hundred dying souls. What karmic fruit does this bear?\"*\nThe master replied: *\"Even if you saved every person in the world, it would not compare to saving yourself from the cycle of birth and death. Worldly blessings have their limits, but if you cultivate to the point of transcending birth and death, this merit is boundless.\"*\n\nA craftsman asked: *\"I built a great hall without seeking payment. With such sincerity, what karmic fruit will I receive?\"*\nThe master replied: *\"It is not as meritorious as a person of purity sitting in silent meditation for a single hour. Merit from action decays, but merit from non-action does not.\"*\n\nSomeone asked: *\"What are merit and practice?\"*\nThe master replied: *\"Closing the mouth is merit; opening the mouth is practice. To attain it in silence, without joy or worry, in the stillness of sealed lips and forgotten words—seeking no recognition, concealing one’s light—this is closing the mouth as merit. To offer expedient means, teach others to practice, benefit all beings, and guide them to the true Dao—this is opening the mouth as practice.\"*\n\nAnother asked: *\"The teachings of the world each claim their own truth, distinguishing themselves from others. How can we know which is orthodox and which is heterodox?\"*\nThe master replied: *\"There are two paths: one of cultivation, and one of worldly engagement. To cultivate this mind is to make it as pure as heaven and earth, as luminous as the sun and moon, as ceaselessly transformative as the four seasons. One who embodies this and returns to the root need not ask what lies beyond—this itself is the functioning of the true Dao. Only those who cultivate can attain it. As for those who recite scriptures flawlessly with their lips and adorn themselves with the trappings of practice, making themselves pleasing to all—these are merely those who engage with the world through the teachings. What do branches, flowers, and leaves have to do with cultivation? What do they have to do with the true Dao? These are temporary expedients. Moreover, if their hearts are filled with contention over self and others, wealth and gain—if their minds are no different from those of ordinary people—how can they attain the Dao? I speak of the Daoist teaching. Let those with clear eyes discern it.*\n\n*This has both substance and function, transcending self and other. It is the true mind, upright and unchanging, received since before the existence of heaven and earth—neither existent nor non-existent. All sages, ancient and modern, and all Daoist masters in the world have attained this before putting it to use. The thousands of scriptures and countless sutras, even the entire *Great Treasury of Scriptures*, speak only of this. Heaven operates through it, earth operates through it, and even the ten thousand things of the world, the boundless expanse of emptiness, are governed by this very principle. One who comprehends it is not led astray by any circumstance, not swayed by any thought, not deceived by the six senses. This is the daily practice of immortals, the conduct of sages, the path of those who advance in the Dao.\"*\n\nSomeone asked: *\"Those who cultivate often speak of eliminating emotions and desires. What lies beyond this?\"*\nThe master replied: *\"When emotions are eliminated to the point of no emotion, and desires are gone to the point of no desire—what do you suppose harmonizes with this?\"*\n\nAnother asked: *\"How can one who cultivates attain purity and stillness?\"*\nThe master replied: *\"A mind that does not chase after things is a peaceful mind. A mind that does not grasp at things is an empty mind. A mind that is both peaceful and empty is purity and stillness—this is the Dao.\"*\n\nSomeone asked: *\"Daoists often speak of the Golden Elixir. What is it?\"*\nThe master replied: *\"It is the original true nature. Because it is swift, sharp, bright, and transformative—melting and merging—it is called *gold*. Having undergone refinement, perfected and complete, indestructible for ten thousand kalpas, it is called *elixir*. Its essence is like empty space, radiant within and without, untouched by the slightest attachment, unstained by a single speck of dust, shining brilliantly in all directions. Thus, the ancestral masters said:*\n*‘The original true nature is called the Golden Elixir,*\n*Refined in the furnace of the four temporal states,*\n*Unstained, unthinking, free of delusion,*\n*It naturally rolls forth to the immortal’s altar.’*\n\n*Some in the world say the Golden Elixir is created through tangible forms and bound to emotions and desires. This is the view of hell-dwellers, the work of the licentious and perverse—deviating from the human path and entering the realm of beasts.\"*\n\nThe master continued: *\"In daily life, let the mind remain undivided in thought, the intent not wander outward. Release without dissipation, restrain without constraint. Illuminate the mind and recognize the Dharma, abandoning cunning and transcending emptiness. In the twelve hours of the day, let each thought be present—yet if you cling to the present, this is not the principle; if you depart from the present, there is no such place. Harmonize movement and stillness, know going and coming, let go of everything, free of entanglements and obstacles—this is the person of carefree ease. But all words fall short; you must discern for yourself.\"*\n\nSomeone asked: *\"I am old and cannot study much. I beg you to speak a single phrase on the most profound and wondrous truth.\"*\nThe master replied: *\"Let go of your seeking for the most profound and wondrous truth—then it is already so.\"*\n\nAnother asked: *\"What is the profound and wondrous?\"*\nThe master replied: *\"Who taught you to ask this?\"*\nThe person joined their hands and said: *\"I came up with the question myself.\"*\nThe master replied: *\"Then you already understand.\"*\nThe person laughed and bowed.\n\nSomeone asked: *\"It is said, ‘To know the One is to complete all things.’ It is also said, ‘Embrace the Origin and guard the One.’ What is this One?\"*\n\nThe master said: *\"This is the undifferentiated nature in its unbroken wholeness, the moment before distinctions arise. Once you know of its existence, you fall into calculation—and thus cannot be one with it. One gives rise to two, two to three, three to the myriad things. How can you guard it? Better to harmonize with the state where even ‘one’ does not exist. Thus, the ancestral master said: ‘To embrace the Origin and guard the One is the work of practice, but in the end, even ‘one’ is absent for eternity.’ In this place where even ‘one’ is absent, your own original nature becomes clear—yet it is not nothingness. As the sutra says: ‘To know emptiness as not empty, to know form as not form—this is called illumination.’\"*\n\nThe master said: *\"The cultivator should keep the mind constantly free of affairs, upright and centered, investigating at every moment the original destiny of the self. When the true place is clearly understood without obscurity, and you merge with the vastness of empty space—only then is this the heart of one who walks the Dao. Through accumulating days and piling up merit, spiritual verification will naturally arise. Thus, seeing all manner of activity, it is better to rest and investigate the self. If the mind is always fixed on external things, drifting through days in habit, it differs not from the mundane heart.\"*\n\nThe master said: *\"When the cultivator suddenly stills the dusty mind and forgets worldly concerns, the original true source of the self stands revealed alone—this is the primordial master who has always been. One naturally assumes the carefree ease of self-possession. All dharma realms are penetrated at once. If you reach this state, you must conceal your light and hide your traces. The more you protect and nurture it, the greater the merit. But if you intentionally display it, you unknowingly diminish its radiance.\"*\n\nSomeone asked: *\"What are good and evil?\"*\nThe master replied: *\"All kind intentions are good; all resentful thoughts are evil. The good that others do not know is the greatest good; the evil that others do not know is the greatest evil. Where neither good nor evil is contemplated, there lies something beyond.\"*\n\nSomeone asked: *\"When one reaches the state of purity and non-action, is this thorough realization?\"*\nThe master replied: *\"Spoken in terms of substance, this seems correct but is not. When you arrive at the true place, it cannot be spoken, cannot be thought, cannot be known by knowing, cannot be recognized by recognizing. Only when wonder ceases in wordlessness do you begin to correspond. It is neither attached to movement nor stillness, nor separate from them—how can it be defined as non-action or purity?\"*\n\nThe master said: *\"Those who walk the Dao embrace simplicity and contain purity, silently penetrating and subtly moving. They eliminate emotions and abandon desires, reducing and preserving, acting without self-interest, handling affairs with clarity. They yield to others and humble themselves, cultivating benevolence and accumulating virtue. Even the slightest fault must be removed; the most minute merit must be accumulated. Right and wrong are both dissolved; mind and dharma are both forgotten. Then the mechanism of the beyond naturally opens.\"*\n\nThe master said: *\"The cultivator investigates where all affairs are untouched, where all dusts are unstained, where one merges with heaven and earth. Penetrating this, the precelestial does not oppose the postcelestial but accords with the timing of heaven. If heaven does not oppose it, how much less do people, how much less do ghosts and spirits?\"*\n\nSomeone asked: *\"Are seeing, hearing, eating, breathing, grasping, walking, and thinking the nature?\"*\nThe master replied: *\"The Dao-nature is not identical with these, yet it does not depart from them. In movement and stillness, speech and silence, it is the function of nature—not the substance of nature. The substance is neither movement nor stillness, neither speech nor silence. The ancients said: ‘To know the great Dao, one must know its source, which does not leave movement and stillness, speech and silence.’ If you take movement and stillness, speech and silence as the nature, you mistake the servant for the master. The master commands the servant—how could the servant command the master? All raising of hands, moving of feet, speaking, seeing, hearing—thousands of forms and myriad postures, even long stillness—are all servants, not the master. The master in the hall cannot be clearly shown outside, yet when you grasp its function, you naturally assume the role of master.\"*\n\nThe master said: *\"My Dao is secretly transmitted. It cannot be sought with intention, nor attained without intention. It is known through not-knowing, attained through not-attaining. Some in the world seek the Dao through appearances, words, demeanor, or dharma forms—none grasp its wholeness. They do not realize the Dao leaves no traces. To seek it in the near is not the Dao. Investigate instead: from where does this nearness arise? Knowing its origin, you see it is neither sound nor form, neither fabrication nor demeanor, neither dharma form. It abides within—yet it cannot be known or recognized. It is simply this original completeness, truly real, uniting with heaven and earth, sages and spirits, the myriad things. Such a great matter—how could it be seen by those tainted with dust or those who reveal their traces?\"*\n\nThe master said: *\"The essential wonder transmitted by the true teachers of the beyond, when applied in action, secretly accords with the will of heaven. How can one cling to a single aspect and call it the Dao? Observing closely, the ancients’ methods differed, yet the wondrous source of their spirit was never distinct. Thus, the function of the human mind: in the eyes, it sees; in the ears, it hears; in the mouth, it speaks; in the mind, it thinks; in the hands, it grasps; in the feet, it walks. The uses differ, but the substance of the mind is not separate. How much more is this true of the master’s secret teaching—transmitted beyond words, where the paths of thought and speech are cut off. Only the awakened grasp it—this is the wondrous secret of the true teacher’s transmission.\"*\n\nSomeone asked: *\"All forms and shapes differ—how can they be seen as one?\"*\nThe master replied: *\"Heaven is the Dao, earth is the Dao, the myriad things are all the Dao. That is the Dao, this is the Dao—though forms differ, none are excluded. How can they not be one?\"*\n\nThe master said: *\"Non-action is the way of heaven; action is the way of humans. To be non-active is to be like heaven; to be active is to be like humans. Like a carrying pole—when both ends are balanced, it is steady. If one end is dropped, it tilts. If both ends are released, even the pole is gone, and you return to the original place.\"*\n\nThe master said: *\"The Dao is present everywhere—everywhere is the Dao, every form is true. It depends only on how you apply it in the moment; what other matter could there be? Yet the dust of human minds is thick with obstructions. Not understanding the root, they pluck leaves and seek branches, drifting with the waves and chasing the currents. Few turn back in time; most remain lost in delusion. Even if they delve deeply, they do not seek what is real. Twisting and fabricating, they see ghosts and spirits, piling heads upon heads, turning backward and gazing in confusion. They do not awaken to the illusory, limited nature of the body, nor to how fleeting time is. When a single breath does not return—what then?\"*\n\nThe master said: *\"For one who cultivates the Way, conduct and retreat should follow one’s lot, acceptance and rejection should suit the moment. Humility is the heart; uprightness is the rule. Examine the source of movement and stillness, regulate the use of seeing and hearing. Cut off all at once, and with a single thought abide in true constancy—then through endless kalpas, there will be no decay or ruin.\"*\n\nSomeone asked: *\"How should one who cultivates the Way protect and sustain the matters of nature and life?\"*\nThe master replied: *\"Amid the ten thousand dusts and ten thousand affairs, though entangled and bound, even if you harmonize with them, you must still maintain mastery and not be swept away. Let affairs not obstruct the mind, nor the mind obstruct affairs. Guard it like the eye—if even the finest speck of dust approaches, close it and refuse to receive. Protect it thus, and over time, merit will appear. But if the mind receives anything, it will be led away by external things, and you will lose mastery.\"*\n\nSomeone asked: *\"What is the Dao of true constancy?\"*\nThe master replied: *\"Set aside ‘true constancy’ for now. Throughout the twelve hours of the day, examine your own mind-ground. When thoughts and concerns arise, what are they? When they have arisen, are they deluded or upright? If deluded, extinguish them at once. If upright, employ them rightly. What is delusion? All preemptive thinking when there is no matter at hand—this is false and illusory. What is uprightness? When there is a matter before you—receiving things, benefiting beings, respecting superiors, pacifying the multitude—all good intentions not for one’s own sake—these are upright thoughts. In stillness, the body is at peace; in activity, the function is correct. Neither indulgent nor restrained, neither day nor night, not the slightest obscurity—constantly responsive, constantly still, level and steady—this is the Dao of true constancy.\"*\n\nSomeone asked: *\"Is freedom from defilement and attachment, unrestrained spontaneity, in accord with the Dao?\"*\nThe master replied: *\"To intend freedom from attachment is already attachment. To intend freedom from defilement is still attachment to non-defilement. As soon as you seek stillness and concentration, you fall into the root of intention. To indulge or rely on others is to be deluded by false views. Non-defilement and non-attachment are but medicine. When there is no illness, remove the medicine. If the illness departs but the medicine remains, it becomes a medicinal illness. Only when the paths of thought and speech are cut off do you arrive home. Cease asking about the journey.\"*\n\n*End of Volume Fifty-Three of the* Pan Shan Record *from the* Ten Books on Cultivating the Real.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "修真十书 经名：修真十书。 六十卷，不着编者，应出于元代。 底本出处：《正统道藏》洞真部方法类。 修真十书盘山语录卷之五十三 时老师在盘山普说云：大凡初机学道之人，若便向言不得处理会，无着摸，没依倚，必生疑。 为心上没工夫，便信不及，则必不能行，行不得则胡学乱学，久而退怠。 今且说与汝等：眼前见得底、耳裹听得底信得及处，行去从厅入妙，亦不误你，虽是声色，便是道之用也。 如何是信得及处？ 汝岂不见许大虚空，及天地、日月、山水、风云，此不是眼前分明见得底，便是修行底榜样，便是入道底门庭也。 且如云之出山，无心往来，飘飘自在，境上物上，挂他不住，道人之心亦当如是。 又如风之鼓动、吹嘘万物，忽往忽来，略无滞碍，不留景迹，草木丛林碍他不住，划然过去，道人之心亦当如是。 又如太山，巍巍峨峨，稳稳当当，不摇不动，一切物来触他不得，道人之心亦当如是。 又如水之物性柔就下，利益群品, 不与物竞，随方就圆，本性澄淡，至於积成江海，容纳百川，不分彼此，鱼鳌虾蟹，尽数包容，道人之心，亦当如是。 又如日月，容光必照，至公无私，明白四达，昼夜不昧，晃郎无边，道人之心亦当如是。 如天之在上，其体常清，清而能容，无所不覆； 地之在下，其体常静，万有利而一不害，道人之心亦当如是。 如虚空广大无边际，无所不容，无所不包，有识无情，天盖地载，包而不辨，非动非静，不有不无，不即万事，不离万事，有天之清，有地之静，有日月之明，有万物之变化，虚空一如也，道人之心亦当如是。 道同天地，其用若此。 常体其中，工夫到日自然会得，动用合道，自有主者。 若便不见言，思路绝处则失之矣。 既入玄门，各宜勉之。 或问：初学修炼，心地如何入门？ 师云：把从来私情眷恋、图谋计较、前思后筹、坑人陷人底心一刀两段着，又把所着底酒色财气、是非人我、攀绿爱念、私心邪心、利心欲心，一一罢尽。 外无所累，则身轻快，内无染着，则心轻快。 内外轻快，久久纯熟，自无妄念，更时时刻刻护持照顾，慎言语、节饮食、省眠睡，表裹相助，尘垢净尽，一物不留，他时自然显露自己本命元神，受用自在，便是个元上道人也。 师示众云：修行之人，乡中便了道也休住，酒肉食了飞升也休吃，眷属便是神仙也休恋。 众人爱底休爱，人都非底莫非。 自己浑是莫认，睡裹得道也休睡。 不是好伴休合，无益之言莫说。 遇事成时休喜，遇事坏时莫忧。 胜如己者学之，不如己者教之。 人亏己者福也，己亏人者祸也，言过行者虚也，行胜言者实也。 有欲情者人事也，无尘心者仙道也。 肯低下者高也，肯贫穷者富也。 返常合道，顺理合人，正道宜行，邪门莫入，通道明德，体用圆成，是谓全真也。 师云：修行之人，大忌说人长短是非、及人问兴废。 一切世事非干己者，口不可论，心不可思，但说是非，便是昧了自己。 若专炼心，常搜己过，那得工夫，管他家屋底事。 但凡为人，须有好处，宜相仿效他。 人恶处，自当回避，更莫关心，渐到休歇也。 师云：天地者，万物之父母也。 天无不盖，地无不载，岂分别这个好、那个恶？ 一般盖载，一般照临。",
      "translated_text": "*The Ten Books of Cultivating Perfection*\n*Title: The Ten Books of Cultivating Perfection*\nSixty *juan*, unattributed, likely composed during the Yuan dynasty. Base text from *Zhengtong Daoist Canon*, *Dongzhen* section, Methods category.\n\n*Recorded Sayings of Master Shi at Mount Pan, Volume 53*\n\nMaster Shi once expounded at Mount Pan, saying: Generally, those newly embarking on the Dao, if they immediately turn to places where words fail to grasp, will find nothing to hold, no support to rely upon, and doubt will surely arise. For if the mind lacks effort, faith will falter, and without faith, one cannot practice. Without practice, learning becomes chaotic and haphazard, and over time, one grows lax.\n\nNow, let me tell you this: Trust in what your eyes clearly see and your ears distinctly hear, and practice accordingly. From the ordinary, enter the wondrous—this will not lead you astray. Though they are but sounds and forms, they are the functioning of the Dao.\n\nWhat, then, is trustworthy? Do you not see the vast emptiness, the heavens and earth, the sun and moon, mountains and rivers, wind and clouds? These are all clearly visible before your eyes—they are the models for cultivation, the very gateway to entering the Dao.\n\nConsider how clouds emerge from mountains: they come and go without intent, drifting freely and at ease. Neither circumstances nor things can cling to them—so too should the mind of the Dao practitioner be.\n\nOr observe the wind as it stirs and animates the myriad things: it rushes forth and returns, utterly unobstructed, leaving no trace. Neither grasses nor forests can impede it—it sweeps past in an instant. So too should the mind of the Dao practitioner be.\n\nOr behold Mount Tai: towering and majestic, steadfast and unshaken. No thing can disturb it—so too should the mind of the Dao practitioner be.\n\nOr consider water: its nature is soft and yielding, flowing downward to benefit all beings. It does not contend with things but adapts to every shape, its essence pure and tranquil. When it gathers into rivers and seas, it embraces the hundred streams without distinction, containing all—fish, turtles, shrimp, and crabs—without exclusion. So too should the mind of the Dao practitioner be.\n\nOr look to the sun and moon: they illuminate wherever their light reaches, impartial and without selfishness, radiant in all directions, unobscured day and night, boundless in brilliance. So too should the mind of the Dao practitioner be.\n\nLike the heavens above, their essence is ever clear, and in their clarity, they embrace all. They cover without exception.\n\nLike the earth below, its essence is ever still, benefiting the ten thousand things without harm. So too should the mind of the Dao practitioner be.\n\nLike the vast emptiness, boundless and without limit, containing all—sentient and insentient, covering heaven and bearing earth—it embraces without discrimination. Neither moving nor still, neither existing nor non-existing, neither attached to nor separate from the ten thousand things, it embodies the clarity of heaven, the stillness of earth, the brightness of the sun and moon, and the transformations of the myriad things. The emptiness is one with all—so too should the mind of the Dao practitioner be.\n\nThe Dao is one with heaven and earth, and its functioning is thus. Constantly embody it, and when your effort matures, you will naturally comprehend it. In action, you will harmonize with the Dao, and there will be a master within.\n\nIf you dismiss words entirely and sever all thought, you will lose the way. Having entered the mysterious gate, each of you must strive diligently.\n\nSomeone asked: For beginners in cultivation, how does one enter the gateway of the mind?\n\nThe Master replied: Sever in one stroke all private attachments, scheming calculations, forward and backward deliberations, and the mind that entraps or ensnares others. Abandon entirely all clinging to wine, lust, wealth, and temper; to right and wrong, self and others; to craving, love, and desire; to selfishness, perversity, greed, and desire. Free from external burdens, the body becomes light and at ease. Free from internal defilements, the mind becomes light and at ease. With both inner and outer lightness, over time, purity will naturally arise, and false thoughts will vanish. Then, moment by moment, guard and attend to it: be cautious in speech, moderate in diet, and sparing in sleep. Inner and outer assist each other, and when the dust and grime are entirely cleansed, leaving not a single thing behind, in time, your original life-spirit will naturally manifest, and you will enjoy freedom and ease—this is the supreme Dao practitioner.\n\nThe Master instructed the assembly: The cultivator who attains the Dao in their hometown should not remain there. One who ascends to immortality after consuming meat and wine should not partake. Even if your family are immortals, do not cling to them. What others love, do not love; what others reject, do not reject. Do not mistake the impure for yourself. Even if you attain the Dao in sleep, do not indulge in sleep. Do not associate with unworthy companions, nor speak useless words. When things go well, do not rejoice; when they go ill, do not grieve. Learn from those better than yourself; teach those who are not. When others wrong you, it is fortune; when you wrong others, it is misfortune. Words beyond deeds are empty; deeds beyond words are real. Those with desires are bound to worldly affairs; those with a mind free of dust walk the immortal Dao. Those who humble themselves will rise; those who embrace poverty will grow rich. Return to the constant and harmonize with the Dao; follow principle and align with others. The true Dao should be practiced; deviant paths should not be entered. Penetrate the Dao and illuminate virtue; embody and perfect its use—this is called the Perfected.\n\nThe Master said: The cultivator must strictly avoid speaking of others’ strengths and weaknesses, or inquiring about their rise and fall. For all worldly matters unrelated to oneself, the mouth must not discuss them, nor the mind ponder them. Merely speaking of right and wrong is to obscure one’s own nature. If you focus solely on refining the mind and constantly examining your own faults, how will you have time to meddle in others’ affairs? In dealing with others, emulate their virtues and avoid their vices. Do not concern yourself with them, and gradually, you will reach a state of rest.\n\nThe Master said: Heaven and earth are the parents of the ten thousand things. The heavens cover all without exception; the earth bears all without distinction. How could they discriminate between good and bad? They cover and bear all equally, illuminating all alike.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1230,
      "start_sentence": 0,
      "end_sentence": 43,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.75734329223633,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\修真十书盘山语录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "故凡在人上者，乃是天命教在上，当似天一般盖覆、安养、存恤一切在下底人，不可分你我尊卑。 凡在人下者，亦是天命分定在下，当似地一般承奉於天，敬仰听从在上之人，不敢分毫怠慢。 既在天地之问，必须合天地之道也，不然则分外妄作，有刑罚凶祸矣。 师云：因绿有数，非乃人为，必顺自然，安时待命。 内功外行，全在自心，自能着力，自己有功。 行与不行，各各自得，教门不开，须当隐伏，心与天通。 教门既开，外功亦应合天应人。 功不厌多，行不厌广，但在此心坚固，乃可成就也。 或问曰：某下三年死工夫，可以脱得轮回么？ 师云：修行之人，当立庾定志，时时刻刻精进炼心，不预未来，岂敢内存胜心，便望超脱。 昔有道人初出家来，乃大言云：某观输回小可，着些工夫便是免了。 有志下功，不测笃疾缠身，数年不愈，渐消其志。 此岂可以胜心为之哉？ 师云：参道之人不厌参问，如人行路，勤问则不迷。 人问小技，无师则不得，况兹大道，视之不见，听之不闻，初机不遇，凭何了悟。 苦中之大，莫过生死，不亲近至人，如何免得。 故有云：古人学道非草草，侍奉真师直到老。 若不知下手去处，又不亲近达人，虽有志行持，千差万错矣。 师云：修行人把自己从来心上染习得偏重底念虑，着工夫用气力缎炼，难舍着舍去，乃至此身限到也要舍，况在心上底。 但是虚妄，一一除尽，便无烦恼碍也。 若身外底一切事、一切物，不足留心。 眼前来往，与蚊奋相似，拂去则快便。 自心上难遣底遣去者，那裹便是输回种子也。 昔长春真人在墦溪时，常有虎豹，寅夜往来，晨夕出入，或生怖惧，即欲藩篱。 复自思惟如此境界，有此怖惧，便欲遮护，毕竟生死回避得么？ 却便休去。 兀兀腾腾，任生任死，怖心自然无之，以至生死境中，巍然不动，种种结缚，一时解脱。 此是难行处行也。 师云：修行人但见人事好处效仿者，不可见他人过，却失了自己。 也不得递相是非，但存是非，自心不正，久进不得。 正能掩邪，邪常谤正，凡有我相常谤人者，不明自己，及是外道邪宗也。 若有正知正见，必於自己心上体究偏邪、搜求过失，若管他非，非正人也。 凡住丛林，云集方来，岂得人人一等，个个同条。 喻如泰山，万物毕备，有不材者，有成材者，有特立者，有依附者，有灵苗瑞草也，有荒榛刻棘。 种种不同，随性任运，自有次第。 山体巍然，元无拣择，一一含摄，流水种石，茂林丰草，兽走禽呜，尽如神仙妙用。 彼各相资，如蓬如麻，不扶自直，天地长久，各得成就。 若欲绝长补短，变青作黄，岂惟各不得安，抑亦失其本性也。 师因众议住持山门，乃云：修行之人住持山门，须量气力，运动简省，轻快过日，不可与世俗一般，争名竞利，却失了当初本心，却忘了性命大事因绿。 当权外而实内，遇难处宁奈，愈磨炼此心，不肯处肯者，若处当者得心安，稳处不动，接待十方，自利利他，安心积行二功行两全矣。 若不炼心，认物为我底，则一向怪贪，习性窄隘，罪过寻俗，误却前程矣。 师到长真观，夜坐对众普说云：初心出家，未能独立，虽仗丛林，或结伴道友，递相扶持，不至偏颇。 然有三等：有云朋霞友，有良朋知友，有狂朋怪友。",
      "translated_text": "Thus, those who stand above others do so by the mandate of Heaven, and ought to emulate Heaven’s all-covering embrace, nurturing, preserving, and cherishing all those beneath them, making no distinction of self and other, high and low. Those who stand beneath others likewise do so by Heaven’s decree, and ought to emulate Earth’s steadfast bearing, revering, honoring, and obeying those above them, never daring the slightest negligence. Since we dwell between Heaven and Earth, we must align with the Dao of Heaven and Earth. Otherwise, we act beyond our proper bounds, inviting punishment, misfortune, and calamity.\n\nThe Master said: Causes arise from fate, not from human contrivance. One must follow the natural course, accept one’s time, and await one’s destiny. Inner cultivation and outward conduct depend entirely on the mind. Only by applying effort oneself can one achieve merit. Whether one practices or not, each reaps what they sow. When the teaching’s gate remains closed, one must remain concealed, with the mind in communion with Heaven. Once the teaching’s gate opens, outward conduct must also accord with Heaven and serve others. There is no limit to the merit one may accumulate, nor to the breadth of one’s conduct. But all depends on the steadfastness of the mind—only then can one attain fulfillment.\n\nSomeone asked: If I devote three years of diligent practice, can I escape the cycle of rebirth?\nThe Master replied: Those who cultivate the Way must establish firm resolve, advancing with unceasing diligence to refine the mind. How can one presume to harbor expectations of future liberation? There was once a Daoist who, upon first leaving the household life, boasted: “The cycle of rebirth is trivial—I need only apply some effort to escape it.” Though he began with resolve, an incurable illness soon befell him, persisting for years and gradually eroding his determination. How could such an outcome arise from overweening ambition?\n\nThe Master said: Those who inquire into the Dao should never tire of questioning, just as a traveler on the road asks directions to avoid going astray. Without a teacher, even minor skills cannot be mastered—how much more so this great Dao, which cannot be seen or heard? Without encountering one at the outset, how can one awaken to it? Of all sufferings, none surpasses birth and death. Without drawing near to a perfected being, how can one be freed from them? Thus it is said: The ancients did not learn the Dao lightly; they served true masters until old age. Without knowing where to begin or drawing near to those who have attained realization, even with resolve and discipline, one will err in countless ways.\n\nThe Master said: Those who cultivate the Way must apply effort and exert strength to temper the deeply ingrained, biased thoughts and attachments that have long accumulated in the mind. One must relinquish them with difficulty, even to the point of being willing to abandon this very body—how much more so the attachments of the mind. All that is false and illusory must be eradicated entirely, and then no afflictions will remain. As for all external matters and things beyond the body, they are not worth dwelling upon. The comings and goings before one’s eyes are like mosquitoes and gnats—brushed away, they bring relief. But the attachments that are difficult to relinquish from the mind—there lies the seed of rebirth.\n\nWhen Master Changchun resided at Fanxi, tigers and leopards often passed by at night, coming and going at dawn and dusk. At first, he felt fear and wished to erect fences. But then he reflected: In such circumstances, if I feel fear and seek to shield myself, can I ever truly escape birth and death? He resolved to let go. Abiding in equanimity, he allowed life and death to take their course. His fear naturally vanished, and even amid the trials of life and death, he remained unmoved. All entanglements dissolved at once—this is the practice of what is most difficult to practice.\n\nThe Master said: Those who cultivate the Way should emulate only the good in others, never their faults, lest they lose themselves. Nor should they engage in mutual criticism, for harboring judgments distorts the mind and hinders progress. Rightness can overcome wrongness, but wrongness will always slander rightness. Those who constantly criticize others out of self-attachment fail to see their own faults and belong to heterodox teachings. With true insight, one must examine one’s own mind for bias and error, seeking out one’s own faults. Those who concern themselves with the faults of others are not true practitioners.\n\nIn a monastic community, people gather from all directions—how can they all be the same, each following an identical path? It is like Mount Tai, which encompasses all things: some are useless, some become useful, some stand alone, some cling to others, some are rare and auspicious plants, some are wild brambles and thorns. Though diverse, each follows its nature and unfolds in due order. The mountain stands majestically, making no distinctions, embracing all—flowing waters and strange rocks, lush forests and abundant grasses, beasts that run and birds that sing—all manifest the wondrous workings of the immortals. They mutually sustain one another, like hemp and reeds that stand straight without support. Heaven and Earth endure, and each attains fulfillment in its own way. If one seeks to cut down the tall to fill the short, or change blue to yellow, not only will none find peace, but their original nature will be lost.\n\nWhen the assembly discussed appointing a monastic leader, the Master said: Those who cultivate the Way and take up the role of monastic leadership must measure their strength, act with simplicity and ease, and live lightly. They must not, like worldly people, contend for fame and profit, lest they lose their original aspiration and forget the great matter of life and destiny. They should appear yielding outwardly while remaining steadfast within. When facing difficulties, they should endure with patience, transforming reluctance into willingness. When circumstances are fitting, they should find peace of mind. Abiding in stability, they should welcome those from all directions, benefiting themselves and others, cultivating both inner tranquility and virtuous action—thus fulfilling both aspects of practice. If they do not refine the mind but mistake external things for themselves, they will become greedy and narrow-minded, accumulating faults and worldly entanglements, thereby ruining their future.\n\nUpon arriving at Changzhen Abbey, the Master addressed the assembly one night: Beginners who leave the household life cannot yet stand alone. Though they rely on the monastic community or form bonds with fellow practitioners for mutual support to avoid bias, there are three kinds of companions: cloud friends, good friends, and reckless or eccentric friends.",
      "overlap_context": "y examining your own faults, how will you have time to meddle in others’ affairs? In dealing with others, emulate their virtues and avoid their vices. Do not concern yourself with them, and gradually, you will reach a state of rest.\n\nThe Master said: Heaven and earth are the parents of the ten thousand things. The heavens cover all without exception; the earth bears all without distinction. How could they discriminate between good and bad? They cover and bear all equally, illuminating all alike.",
      "start_char": 1230,
      "end_char": 2475,
      "start_sentence": 44,
      "end_sentence": 86,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.27370023727417,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\修真十书盘山语录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "凡有志节，炼心地，究罪福，绝尘俗，逍遥方外，同志相求，遂为笃友，此等谓之云朋霞友，以其心与云霞相似，尘事碍他不得故也。 又有习学经教，琴书昤咏，高谈阔论，褒贬是非，此等谓之良朋知友，以其不炼心、亦不能作恶故也。 又有一等不治心地，不看经书，不顾罪福，出语乖讹，作事诳荡，触着一毛便起争斗，夸狂逞俊，恃力持胜，欺压善良，相率成党，此等谓之狂朋怪友。 此三等人身谢之后各有安置去处，随其功业，各得受报。 其云朋霞友，升入无形，游燕玉京，或为神仙，或为天官。 其良朋知友，尘心未尽，不出人伦，往复受报。 其狂朋怪友，受了十方供养，全无功德填还口债，或堕邓都，或堕旁生输回苦趣，若到如斯，悔之何及？ 聪明达人，细细思之，各寻长便。 师因劝众住丛林，乃云：丹阳真人有词云：学道住丛林，校浅量探，选择其善作知音，如是未能明至理，挈领提衾。 凡在丛林，递相指发，提纲振领，共修无上心地，大法门非小事。 有等无见趣底，不寻知友，不住丛林，馒说云游，不论心地，千山万水，南去北来，空费草鞋，只寻便宜自在处，触着磕着，又早走。 如此出家，不知甚么是自己紧切处，不知怎生过日，只图自在便是了也。 殊不知，前面有底生死，决定到来，看你着甚枝梧。 岂可因循过日，虚度时光也。 当初出家，图个甚么？ 师云：修行之人，性有利钝，性钝之人不可坚执，宜住丛林，低下存心，与达理明心底人结绿纯熟，自然引领入道，渐次开悟。 若自性钝滞，又无见趣，每日与同类相从，交结尘俗，尘绿熟，久必退道，或遭魔境作地狱，见无人救援，一向沈堕，深可痛哉。 师云：出家人久居丛林，朝夕训诲，尚且乖疏因循不进，道心渐臧，尘事日增，放荡猖狂，不能虚静。 况在俗中孤行独立，尘情荏苒，爱境缠绵，障道因绿，头头皆是，不自知觉，虽遇圣贤，不能劝化。 百端扭捏，诳惑闻间，迤迄沈沦，福消业长，渐渍探重。 若肯回头，犹能救得。 合尘背道，无可奈何，地狱不速矣。 师因人议：住山乃修行之人，物来要识破，境来要应过，应过一番，便同应过一举。 昔有道人住山，草衣木食，誓不下山，以为屏尽尘俗之累。 一日，或有二人各持兵仗来索饮食，先生便煮山果以待之，果及软，其一人就釜中手取而尝，怒而言曰：此等与人食？ 便欲触去釜底。 先生初不言，见此二人怒色兼以恶言激切，先生密谋，乃因事出外，探得所藏之棒，手按大呼云：二人出来，尔等未必近得我。 二人出门笑曰：先生住山，养成如此胜心，不如下山作俗人去。 二人遂行，望之忽不见。 先生方疑是圣贤校勘，悔之而已。 此是境上试不过也。 师因众议不动心，乃云：昔山东有道人，於师父处自言炼尽无明火。 师云：无明火尽则心不动，便是好人。 他日，师父密遣试之。 日暮，造门，庵门已闭，其人厉声以杖大击其门，先生内应已声不顺，勉强开门，来人形状躁暴，先生见之，颜色已动。 又至堂上，其人不解屦，跳上坐，殊无礼貌，先生大怒，深责其人。 其人拱手笑日：某非敢如此，师父使来校勘先生不动底真心，今未及试已见矣，不须再勘。 其人大暂，无言可对。",
      "translated_text": "Those with noble aspirations, who refine their minds, investigate the consequences of sin and blessing, sever worldly attachments, and wander beyond the mundane—seeking like-minded companions and forming steadfast bonds—are called *cloud friends and rosy-cloud friends*. Their minds resemble clouds and rosy dawns, untouched by worldly affairs.\n\nOthers study scriptures and teachings, play the zither, read books, chant poetry, engage in lofty discussions, and debate right and wrong. These are called *good friends and wise friends*, for though they do not refine their minds, they do not commit evil either.\n\nThen there are those who neither cultivate their minds nor study scriptures, heedless of sin and blessing. Their words are perverse, their actions reckless. At the slightest provocation, they quarrel, boast wildly, flaunt their strength, bully the good, and band together in cliques. These are called *reckless friends and eccentric friends*.\n\nAfter these three kinds of people depart this life, each is assigned a place according to their deeds, receiving their due recompense. The *cloud friends and rosy-cloud friends* ascend into the formless, roaming the Jade Capital, becoming immortals or celestial officials. The *good friends and wise friends*, their worldly minds not yet extinguished, remain within the cycle of human existence, subject to repeated retribution. The *reckless friends and eccentric friends*, having consumed the offerings of the ten directions without accumulating merit to repay their debt, may fall into the Dark Realm or be reborn among beasts, enduring the suffering of transmigration. When such a fate befalls them, how can regret avail? The wise and discerning should ponder this carefully and seek the most advantageous path.\n\nThe Master, urging the assembly to dwell in monastic communities, said: The Perfected One of Danyang has a verse: *\"Those who study the Dao and dwell in monastic communities must measure their depth and explore its shallows, choosing the virtuous as their intimate companions. If they cannot yet grasp the ultimate principle, they should cling to its essence and uphold its core.\"* In monastic communities, practitioners guide one another, lifting the banner and grasping the essentials to cultivate together the supreme mind-ground and the great Dharma gate—no small matter.\n\nYet some, lacking insight and direction, neither seek wise companions nor dwell in monastic communities. They idly claim to wander, heedless of the mind-ground, traversing mountains and rivers, going south and north, wasting straw sandals. They only seek ease and convenience, fleeing at the slightest obstacle. Such renunciates know not what is most urgent for themselves, nor how to spend their days—merely chasing comfort. Little do they realize that ahead lies the inescapable reckoning of life and death. How will they withstand it? Can they afford to drift through days, squandering time? What did they renounce the household life for?\n\nThe Master said: Practitioners vary in their natures—some sharp, some dull. Those of dull nature should not be rigid but should dwell in monastic communities, humbly preserving their minds. By associating with those of clear understanding and bright minds, they will naturally be guided onto the path, gradually awakening. If one’s nature is dull and lacking in insight, yet one daily keeps company with the like-minded, entangling with worldly affairs, the worldly bonds grow strong. Over time, one inevitably strays from the path, or encounters demonic realms, falling into hell with no one to save them—a profound sorrow.\n\nThe Master said: Even those who have long dwelt in monastic communities, receiving daily instruction, may grow negligent and complacent, their resolve for the Dao waning as worldly affairs increase. They become unruly and reckless, unable to attain stillness. How much worse for those who wander alone in the world, their worldly passions lingering, entangled in desires, their path obstructed at every turn, unaware of their own plight. Even if they encounter sages, they cannot be transformed. With a hundred evasions and deceptions, they delude themselves and others, gradually sinking deeper. Their blessings diminish as their karma grows. If they would but turn back, they might yet be saved. But if they cling to the dust and turn from the Dao, there is no recourse—hell awaits without delay.\n\nThe Master, discussing those who dwell in mountains, said: A practitioner in the mountains must see through things as they arise and respond to circumstances as they come. Each response is like a single act—once passed, it is done. Once, a Daoist lived in the mountains, wearing clothes of grass and eating wild plants, vowing never to descend, believing he had shed all worldly burdens. One day, two men bearing weapons came seeking food. The master cooked mountain fruits to offer them. When the fruit softened, one man reached into the pot, tasted it, and angrily said, *\"Who would eat such fare?\"* He was about to overturn the pot. The master said nothing. Seeing the men’s anger and hearing their harsh words, he secretly devised a plan. On some pretext, he went outside, found his hidden staff, grasped it, and shouted, *\"Come out, you two! You won’t dare come near me!\"* The men stepped outside and laughed: *\"Living in the mountains has made you so aggressive. You’d be better off descending to become a layman.\"* They left, and suddenly vanished from sight. The master then suspected they were sages testing him and could only regret his failure.\n\nThe Master, discussing the unmoving mind, said: Once, in Shandong, a practitioner boasted to his master that he had extinguished the fire of ignorance. The master said, *\"If the fire of ignorance is extinguished, the mind does not move—then you are a good person.\"* Later, the master secretly sent someone to test him. At dusk, the visitor arrived to find the hermitage gate closed. He loudly struck the door with his staff, and the master, hearing the harsh tone, reluctantly opened it. The visitor’s manner was violent, and upon entering the hall, he did not remove his shoes but leapt onto the seat, utterly lacking in courtesy. The master grew furious and severely rebuked him. The visitor clasped his hands and smiled: *\"I dared not act so—your master sent me to test your truly unmoving mind. Before the test was even complete, it was already revealed. No need for further trial.\"* The master was greatly ashamed and had no reply.",
      "overlap_context": "ngs for themselves, they will become greedy and narrow-minded, accumulating faults and worldly entanglements, thereby ruining their future.\n\nUpon arriving at Changzhen Abbey, the Master addressed the assembly one night: Beginners who leave the household life cannot yet stand alone. Though they rely on the monastic community or form bonds with fellow practitioners for mutual support to avoid bias, there are three kinds of companions: cloud friends, good friends, and reckless or eccentric friends.",
      "start_char": 2475,
      "end_char": 3692,
      "start_sentence": 87,
      "end_sentence": 124,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.926398754119873,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\修真十书盘山语录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "大抵修行人虽有工夫，岂敢自矜，不觉时便勘脱其实。 到灰心槁形，则却无自夸之念，既自夸，便勘脱矣。 便直饶到得不动，向上更有事在。 或问曰：守圆之人其功如何？ 师云：昔长春师父在京时，行至一观，后有坐园者。 其众修斋，次，有人覆真人言：圆中先生欲与真人语。 真人法旨，令斋毕相见去。 不意间，真人因出外，寻及圆所，以杖大击其门数声，园中先生以为常人，怒而应之，真人便回。 斋毕，众人复请以相见，真人曰：已试过也，此人我心尚在，未可与语。 遂去之。 大抵居静本为性命事，大收拾固济涵养为功，遇境不动，乃是验也。 今此击门之声是境，应者是心，心若忘我，如同灰灭，有明亦无大焰。 遇境不动，安祥应过，便是心上有工夫也。 今闻些子虚声，便早动心，一切恶境怎生过去。 虽居圆中，济甚么事。 受人供养，口债怎生还得，却不如於众中琢磨，炼此顽心，他日镶尽金出，却是个有见趣底人也。 师云：昔长生真人堂下有当厨者，众皆许其柔和低下，未曾见动心。 真人知之，令人试之，密使人早晨於厨所用什物，移之他处。 其人造粥，渍米及釜，急求匕杓不得，以至溢出，乃大动心。 真人见之，教云：有饶溢尽，只是外物，何销坏心。 其人方省，礼谢而已。 师因有作务，普说云：昔束堂下有张仙者，善能木匠，不曾逆人，谦卑柔顺，未尝见怒形於色，众皆许可而尝赞叹，遂问於真人。 真人曰：未也试过，则可喻比黄金不炼过，不知真伪。 一日令造坐榻，其人应声而作。 工未毕，又令作门窗，亦姑随之，已有慢意。 工未及半，又令作合子数个，其人便不肯，遂於真人前辨正，欲了却一事更作一事。 真人乃云：前因众人许汝能应人不逆，未曾动心，今日却试脱也。 修行之人至如炼心应事，内先有主，自在安和，外应於事，百发百中。 何者为先，何者为后，从紧处应，粉骨碎身，惟心莫动。 至如先作这一件又如何，先作那一件又如何，供是假物，有甚定体。 心要死，机要活，只据目前紧处应将去，平平稳稳，不动不昧，此所谓常应常静也。 师因作务有动心者，乃云：修行之人，外绿虽假，不可不应。 应而无我，心体虚空，事来无碍，则虚空无碍万事，万事不碍虚空，如天地问万象万物皆自动作，俱无障碍。 若心存我相，事来必对，便有触拨，急过不得，筑着磕着，便动自心，自心既动，平稳不得，虽作苦终日，劳而无功也。 居大众中，及有作务，专防自心，不可易动。 常搜己过，莫管他非，乃是功行事，临头上便要承当。 诸境万尘，不逐他去，自已明了，一切莫魔。 如此过目，初心不退，自获大功也。 师因人论居圆环堵也，中起一屋，筑园墙园之，别开小牖以通饮食，使人供送也。 绝交友专圆意修行也。 一日，众人请出，随意行止。 其旧友见而问曰：师兄向静处得来底，於闹处可有未？ 知师兄得到端的不动处也未？ 其人傲然，良久不言。 友人进云：某有试金石，可辩真伪，师兄试你数年静处得来底心，看如何也？ 其人云：静处有甚么可说。 友人曰：似恁么则披毛带角，还他人口债去也。 其人忿然大怒，以至出骂，友人笑曰：此是园中得来底，果试出矣。 其人遂怒，终身绝交。",
      "translated_text": "Generally, those who cultivate the Way may have some skill, but how dare they take pride in it? In an unguarded moment, their true state is revealed. Only when one’s heart is like cold ashes and their form withered do they lack the thought of self-praise—yet once self-praise arises, their true state is already exposed. Even if one attains unshakable stillness, there is still something beyond.\n\nSomeone asked, *\"What of the practice of those who dwell in seclusion?\"*\nThe master said: *\"Once, when Master Changchun was in the capital, he passed by a Daoist abbey. Behind it lived a recluse in a walled garden. The community was holding a ritual feast when someone reported to the Perfected One: ‘The master in the garden wishes to speak with you.’ The Perfected One decreed that they should meet after the feast. Unexpectedly, the Perfected One later went out and sought the recluse in his garden. He struck the gate loudly several times with his staff. The recluse, assuming it was an ordinary visitor, responded in anger. The Perfected One then turned away. After the feast, the community again requested a meeting, but the Perfected One said: ‘I have already tested him. His mind is still present—he is not yet ready for discourse.’ And so he departed.*\n\n*Generally, dwelling in stillness is for the sake of the work of nature and life—consolidating, securing, and nurturing one’s inner power is the true task. Meeting circumstances without disturbance is the test. Here, the sound of the gate being struck is the circumstance; the response is the mind. If the mind forgets the self, it is like cold ashes—even if there is light, there is no great flame. To meet circumstances without disturbance, responding with tranquility, is to have skill in the mind. Now, if a mere empty sound stirs the heart, how can one pass through all adverse circumstances? Though dwelling in seclusion, what use is it? Accepting others’ offerings, how can one repay such debt? It would be better to refine this stubborn heart among the community. One day, when the gold is fully smelted, one becomes a person of true insight.\"*\n\nThe master said: *\"Once, beneath the hall of the Perfected One of Longevity, there was a kitchen attendant. The community praised him for his gentleness and humility, saying they had never seen him lose his composure. The Perfected One, knowing this, had him tested. Secretly, someone moved the kitchen utensils to another place early in the morning. When the attendant went to prepare congee, he washed the rice and filled the pot, then urgently searched for the ladle and scoop but could not find them. The pot boiled over, and he grew greatly agitated. The Perfected One saw this and taught: ‘Even if it all spills out, these are merely external things—why disturb the heart?’ The attendant then awoke, bowed in gratitude, and that was all.*\n\n*The master, while overseeing work, addressed all present: ‘Once, beneath the hall of Master Shu, there was a man named Zhang the Immortal, skilled in carpentry. He never opposed others, was humble and yielding, and no one had ever seen anger on his face. The community praised and admired him, so they asked the Perfected One about him. The Perfected One said: “Not yet—he must be tested. It is like unrefined gold: without testing, one cannot know its authenticity.” One day, he was ordered to make a meditation bench. He assented and began the work. Before it was finished, he was told to make doors and windows as well. He reluctantly complied, but already showed signs of impatience. Before half the work was done, he was ordered to make several boxes. He refused, arguing before the Perfected One that he should finish one task before starting another. The Perfected One then said: “Previously, the community praised you for never opposing others and never losing your composure—today, the test has revealed the truth.”*\n\n*For those who cultivate the Way, when refining the mind and responding to affairs, the inner self must first be settled, at ease and harmonious. Externally, one responds to matters with perfect accuracy. What comes first, what comes later? Respond to what is urgent, even if it means grinding one’s bones to dust—only the mind must not move. Whether it is this task or that, these are but temporary things, without fixed substance. The mind must die; the mechanism must be alive. Simply respond to what is urgent in the moment, steadily and calmly, without disturbance or dullness—this is what is meant by “constantly responding, constantly still.”*\n\n*The master, seeing some lose composure during work, said: “For those who cultivate the Way, though external conditions are illusory, one cannot fail to respond. Responding without self, the mind’s essence is empty space. When affairs arise, there is no obstruction—just as empty space is unobstructed by the ten thousand things, and the ten thousand things do not obstruct empty space. Like the myriad forms and beings between heaven and earth, all move and act without hindrance. If the mind clings to the self, when affairs arise, there must be opposition. Then there is friction, and one cannot pass through swiftly. Stumbling and colliding, the self’s mind is disturbed. Once the mind is disturbed, there is no peace. Though one toils all day, it is labor without achievement.*\n\n*Living among the community and engaging in work, one must guard the self’s mind and not be easily moved. Constantly examine one’s own faults, never mind others’ wrongs—this is the work of cultivation. When the moment comes, one must take responsibility. The ten thousand circumstances and dusts of the world do not chase after them—the self is clear and bright, untroubled by any demon. Passing through life thus, with an unretreatant initial resolve, one naturally attains great merit.”*\n\nThe master, hearing someone discuss dwelling in a walled garden—building a hut within, enclosing it with a wall, and opening a small window for food to be delivered—said: *\"This is to sever ties with friends and devote oneself entirely to secluded cultivation. One day, the community asked him to come out and move about freely. An old friend saw him and asked: ‘Brother, what have you gained from your time in stillness? Can you maintain it amidst the bustle? Have you truly reached the point of unshakable stillness?’ The man was haughty and remained silent for a long time. His friend then said: ‘I have a touchstone to distinguish truth from falsehood. Let me test the heart you’ve cultivated in these years of seclusion—what do you say?’ The man replied: ‘What is there to say of stillness?’ The friend said: ‘If that is so, you will go forth with fur and horns, repaying the debt of others’ offerings.’ The man grew furious and began to curse. The friend laughed and said: ‘This is what you’ve gained in the garden—indeed, the test has revealed it.’ The man was so enraged that he severed ties with his friend for life.\"*",
      "overlap_context": "ter, hearing the harsh tone, reluctantly opened it. The visitor’s manner was violent, and upon entering the hall, he did not remove his shoes but leapt onto the seat, utterly lacking in courtesy. The master grew furious and severely rebuked him. The visitor clasped his hands and smiled: *\"I dared not act so—your master sent me to test your truly unmoving mind. Before the test was even complete, it was already revealed. No need for further trial.\"* The master was greatly ashamed and had no reply.",
      "start_char": 3692,
      "end_char": 4919,
      "start_sentence": 125,
      "end_sentence": 173,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.7878155708313,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\修真十书盘山语录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "此人盖不曾境上炼心，唯静坐百年，终无是处，但如击马而止者，解其绳，则奔驰如旧矣。 师云：昔束堂下遇雨，知事人普请不择老幼搬逐，众皆竞应，惟一老仙安坐不出。 事毕，大众团坐，欲斜老仙，有言於长春真人者，真人呵之云：坏尽伪坏直几何，一人炼心端的到休歇处，如宝珠无价，且量各人心地用事去。 大抵教门中以得人为奇也。 或问曰：某於山中独行独坐，亲见山神报未来事，是真么？ 师云：常人之心，依着万尘，蒙昧不明。 初机出家，磨炼尘心，偶然得静，乍得静境，便生别个景象，神头鬼面，认得心地，乃自欢喜，歌无不休。 或有自见知未来事者，或空中闻人预报前事及有应验者，或有亲过去师真神人来到目前嘱付心地事者，若有心承认，便是着邪，若不除去，养成心病，无法可疗。 岂不闻古人云：见闻觉知，亦是病患。 况是眼见耳闻心思底，皆属声色境界。 岂不闻古人经云：视之不可见，听之不可闻，言之不可及，思之不能至也。 今於声色上认为真，便是落邪道也。 昔有道人静坐中，或觉口中有酒味，又梦见人送酒，明日果有人送酒来。 此是心空神应，不为奇特，认之则为着邪道也。 又有道人，坐中忽然神出，外游数百步复回，乃见本形依然端坐，如是数次、亦不为奇特，乃与平常念头出外一般，只为些子分明。 若认为功，便是着邪也。 俚语云：万般祥瑞不如无平常安稳，却合道。 师云：修行之人，静中境界甚有多般，皆由自己识神所化，因静而现，诱引心君。 岂不闻古人云：凡所有相，皆是虚妄。 心欲遣识，识神尚在，便化形像，神头鬼面，或乱心主。 若主不动，见如不见，体同虚空，无处捉摸，自然消散，无境可魔，无物可坏也。 昔有道人，心得休歇，一日坐间，忽见恶鬼无数，乘空而来，其人安定此心体若太空，冥然不辨，拚此身任死任生，其魔自散。 为有主在，寂然不动，岂有魔魅。 妄心未尽，故显此相，体性湛然，则泯自矣。 师云：昔有住园者，闻人说地面，既入园中，要见地面，心存此念，随念应现，不知是假。 耳裹闻底属声，眼裹见低属色，心上想低属妄。 便见金童玉女、真仙圣贤，现形白日，亲亦是虚妄境界。 妄念所作，便认是地面，更不可破除，馒糊一世，着邪着祟。 殊不知地面是古人心行到平稳休歇处，故有此名。 如人住处，治平荆棘，扫除瓦砾，其地平整可以居止，名为地面。 修行之人，心地平稳，事触不动，便是个不动地面； 万尘染他不得，便是个清净地面； 露出自己亘初法身一分分朗朗，承当得，便是个圆明地面。 凡言地面，亦有边际去处，若到无地位、无方所、绝名言处，乃所谓玄之又玄也，如此，岂可以眼见耳闻心想底便是了哉？ 或问曰：学人本谓生死事大，求之不明，其意如何？ 师云：一念无生即无死也，不能如此者，盖为心上有情，性上有尘，搬弄生死不停，欲求解脱，随过即追，追之又追，以至丝毫不存。 源本清净，不逐声、不逐色，随处自在，虚静潇洒，天长地久，自明真宰。 盖心正则事事正，心邪则事事邪，内既有主，则人爱底不爱，人嫌底不嫌，从来旧习，般般勒转，六识既空，真宰常静，更有何生死可惧。",
      "translated_text": "This man had never tempered his mind amidst circumstances—merely sitting in stillness for a hundred years would yield nothing. It was like whipping a horse to make it stand still: once the rope was loosened, it would bolt as before.\n\nThe Master said: Once, during a rainstorm at the Hall of Restraint, the manager called for general labor, summoning all without regard for age or youth. The crowd rushed to respond, save for one old immortal who remained seated, unmoving. When the task was done and all gathered in assembly to mock the old immortal, someone reported this to the Perfected Lord of Long Spring. The Lord rebuked them, saying: \"How much can one destroy falsehood to reveal truth? One who has truly tempered the mind to its resting place is like a priceless pearl. Let each act according to the state of their own heart.\"\n\nIn the teachings, what is rare is to find one who has truly attained.\n\nSomeone asked: \"When I walk or sit alone in the mountains, I personally witness mountain spirits foretelling future events—is this real?\"\n\nThe Master said: The common mind clings to the ten thousand dusts, dull and unclear. When beginners leave the household life, they grind away the dust of the heart. If by chance they attain stillness and suddenly encounter a tranquil state, they generate strange visions—demonic faces and spectral forms. Taking these as the true ground of the heart, they rejoice without cease. Some see themselves foretelling future events; others hear voices in the void predicting things that later come to pass; still others encounter departed masters, true spirits, or immortals who appear before them to instruct their hearts. If one clings to these experiences, it is already falling into delusion. If not abandoned, they nurture a sickness of the heart for which there is no cure.\n\nHave you not heard the ancients say: \"Perception, awareness, and knowledge are themselves afflictions\"? Moreover, all that is seen with the eyes, heard with the ears, or conceived in the mind belongs to the realm of sound and form. Have you not read in the ancient scriptures: \"It cannot be seen when looked for, cannot be heard when listened for, cannot be expressed in words, cannot be reached by thought\"? To take what appears in sound and form as real is to fall into the demonic path.\n\nOnce, a Daoist in meditation suddenly tasted wine in his mouth and dreamed of someone delivering wine. The next day, wine was indeed brought to him. This was merely the heart’s emptiness evoking a spiritual response—nothing extraordinary. To take it as real is to fall into delusion.\n\nAnother Daoist, while sitting, suddenly found his spirit departing his body. It wandered several hundred paces away before returning, only to see his original form still seated upright. This happened several times, yet it was nothing extraordinary—no different from ordinary thoughts wandering outward, merely clearer in detail. To regard it as an achievement is to fall into delusion.\n\nAs the saying goes: \"Of all auspicious signs, none compares to ordinary peace and stability.\" This accords with the Dao.\n\nThe Master said: In stillness, the visions encountered by practitioners are manifold, all conjured by their own consciousness, arising in quietude to seduce the sovereign mind. Have you not heard the ancients say: \"All appearances are illusory\"? When the heart seeks to dispel consciousness, consciousness remains and transforms into forms—demonic faces, spectral shapes—disturbing the lord of the mind. If the lord remains unmoved, seeing as if not seeing, embodying emptiness, with nothing to grasp, the visions naturally dissipate. Without a realm to invade, nothing can be corrupted.\n\nOnce, a Daoist who had attained rest for his heart was sitting one day when suddenly countless evil spirits descended from the sky. The man steadied his heart, making his body like the vastness of space. In profound unknowing, he resolved to let his body live or die as fate willed. The demons scattered of their own accord. With the sovereign present and utterly still, what demon could remain? The deluded mind had not yet been exhausted, so these appearances manifested. When the nature of reality is perfectly clear, they vanish of themselves.\n\nThe Master said: Once, a gardener heard people speak of the \"ground of being.\" Entering the garden, he wished to see this ground, and as his mind dwelled on the thought, it manifested in response—though he did not know it was false. What is heard with the ears belongs to sound; what is seen with the eyes belongs to form; what is imagined in the heart belongs to delusion. Thus he saw golden youths and jade maidens, true immortals and sages appearing in broad daylight—yet all were illusory realms, fabrications of deluded thought. Taking them as the \"ground of being,\" he could not dispel them, muddling through his life, ensnared by delusion and possession.\n\nHe did not understand that the \"ground of being\" is what the ancients called the place where the heart’s activity reaches perfect stability and rest. It is like preparing a dwelling place: clearing away brambles, sweeping aside rubble, leveling the ground so it is fit to inhabit—this is called the \"ground of being.\" For the practitioner, when the heart-ground is stable and untroubled by circumstances, it is an unshakable ground; when the ten thousand dusts cannot stain it, it is a pure ground; when one’s original dharmakāya is revealed, radiant and self-sustaining, it is a luminous ground. All talk of the \"ground of being\" has its limits. When one reaches the place without location, without direction, beyond names and words—this is what is called \"mysterious beyond the mysterious.\" How could what is seen with the eyes, heard with the ears, or conceived in the mind ever suffice?\n\nSomeone asked: \"This student has always held that the matter of life and death is of utmost importance, yet my seeking has brought no clarity. What is the meaning of this?\"\n\nThe Master said: When a single thought does not arise, there is no death. Those who cannot do this are burdened by emotions in the heart and dust on the nature, endlessly manipulating life and death. Seeking liberation, they chase after each transgression, pursuing it again and again until not a trace remains. The source is fundamentally pure—neither following sound nor chasing form, at ease everywhere, empty and carefree, enduring as heaven and earth, the true sovereign becomes self-evident.\n\nWhen the heart is upright, all things are upright; when the heart is crooked, all things are crooked. With a sovereign within, what others love, one does not love; what others despise, one does not despise. All old habits are turned around. When the six senses are empty, the true sovereign abides in stillness—what fear of life and death remains?",
      "overlap_context": "inguish truth from falsehood. Let me test the heart you’ve cultivated in these years of seclusion—what do you say?’ The man replied: ‘What is there to say of stillness?’ The friend said: ‘If that is so, you will go forth with fur and horns, repaying the debt of others’ offerings.’ The man grew furious and began to curse. The friend laughed and said: ‘This is what you’ve gained in the garden—indeed, the test has revealed it.’ The man was so enraged that he severed ties with his friend for life.\"*",
      "start_char": 4919,
      "end_char": 6135,
      "start_sentence": 174,
      "end_sentence": 211,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.91974401473999,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\修真十书盘山语录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "若到如此田地，却有一向没收没拾、伏藏不住、似着邪祟底一般。 向外驰骋，狂狂荡荡，便是神气散乱，作主不得，便认作真欢真乐，却不知无欢之欢乃真欢也，无乐之乐乃真乐也。 学古之人行歌立舞，殊不知当时亦是解枯释别有得处，以此自乐，岂肯纵心颠蹶，以诳惑人世哉？ 师因众论智藏开时，辞源涌出，乃云：修行之人，初心离境，如镜乍明，智藏忽开，举意成章，不可住着。 若心印定，不感而用，变成狂惠，则了无功，只是神用，非道体也。 不可驰骋以为伎能，但涵养则有功也。 或问曰：未来过去则不问，如何是见在心？ 师正视云：此不是见在。 复低头云：此不是见在。 又问云：你会得也未？ 其人笑云：会不得。 师云：大开眼着一个见在也不识，更说甚过去未来。 或问曰：既往者不追，未来者不预，见在当如何？ 师云：灭动不灭照，更要会得这个灭动底是谁，得则权柄在手，灭也由你，不灭也由你。 或问曰：如何是定性？ 师乃移位近前，正身默坐良久云：你问甚么定性？ 其人不省，傍有先生起而稽首谢之。 师云：张公吃酒李公醉。 其人尚未悟之。 师云：学者不寐，本以炼心为事，若不收心，济甚么事。 至如赌博、奕棋、纺绩、罗磨之人，夜夜不睡，则是得道底人也？ 此等之人，十二时中利心诱引，只是贪财搅扰心灵，如蚊奋喱肤，故不得眠。 修行之人不同於此，睡是一欲，若不换过，滋长邪妄，暗昧不通，盖属阴界。 如人防盗，端然坐待，其盗自退。 专以炼心，恐致流荡，谓此一心，本无定体，在阳则明，在阴则暗，熟境不存，无为清净，性珠明了，此所以昼夜不寐也。 师云：修行之人，为此顽心。 自从无始以来，轮回败骨，如山之积，万生万死，以至今日方省前非，欲求解脱。 是以昼不敢食，夜不敢眠。 炼此顽心，要般般尚俗颊倒，方可中用。 若不炼心，见人不睡也，如此做造，心念如毛，触着便发烟火，至如百年不睡，济甚么事。 顽心不尽，依旧轮回。 欲要换过此心，不论昼夜，时时刻刻，动裹静裹，把这一片顽心裂教粉碎去，方可受用。 元本真灵与天地相似，然后动也是道，静也是道，开口也是道，合口也是道，要别求甚么，便是个脱洒底道人也。 或问曰：自来修行之人，必先立志，如何是志？ 师云：每在动处、静处、一切境界裹，行住坐卧，念念在道，逢魔不变，遇害不迁，安稳处亦如此，铁脸处亦如此，拚此一身，更无回顾，精进直前，生死不惧，便是个有志底人。 故经云：强行者有志。 师云：修行之人须要立志节，及至有志节，却为固执，固执则事物上不通变，及至事物上变得，却便因循过日也。 以此，学者如牛毛，达者如麟角。 大抵学道之人先要归宗祖，决要有志节，须要识通变，专一勤行，久而不已无不成也。 师云：道人炼心，如铸金作鸡，形像虽与鸡一般，而心常不动，独立於鸡群，鸡虽好斗，无有敢近傍者。 体道之人，心若聚寒灰，形如曳槁木，天下之心虽有好争者，不敢为争矣。 故经云：夫惟不争，故天下莫能与之争。 或问云： 向上一事，人人俱足，更缎炼作甚么？ 师云：凡心未炼，喻如石铍中有白金，未经缎炼，只是顽石。 置之大冷洪炉，炼去滓秽，分出真物，既已成金，．不复为炉。",
      "translated_text": "If one reaches such a state, yet finds oneself unable to gather or restrain, unable to contain or conceal—like one possessed by some malevolent spirit—racing outward in wild abandon, drifting recklessly, this is the scattering of spirit and qi, losing mastery over oneself. Taking this for true joy or true delight, one fails to recognize that joy without joy is the true joy, and delight without delight is the true delight.\n\nThe ancients would sing and dance as they walked, yet even in that moment, they were dissolving stagnation and parting from attachments, finding their own delight therein. How could they ever indulge the heart in reckless abandon, deceiving and bewildering the world?\n\nThe master, during a discussion on the opening of wisdom’s treasury, spoke of the surging forth of its source: \"For one on the path of cultivation, the initial departure from sensory realms is like a mirror suddenly polished bright. When wisdom’s treasury opens, thoughts form into verses without effort—yet one must not cling to them. If the heart’s seal is fixed, functioning without response, it becomes wild wisdom, devoid of merit, merely the operation of spirit, not the essence of the Dao.\"\n\n\"Do not gallop about, mistaking it for skill. Only through nurturing and refinement does merit arise.\"\n\nSomeone asked, \"I will not ask about the past or future—what is the present mind?\"\n\nThe master looked straight ahead and said, \"This is not the present.\"\n\nThen, lowering his head, he said, \"This is not the present.\"\n\nAgain, he asked, \"Do you understand?\"\n\nThe person smiled and said, \"I do not.\"\n\nThe master replied, \"Even with eyes wide open, you fail to recognize the present—how then can you speak of past or future?\"\n\nAnother asked, \"The past is not pursued, the future not anticipated—what of the present?\"\n\nThe master said, \"Extinguish movement but not illumination. Further, you must grasp *who* it is that extinguishes movement. Once attained, the power rests in your hands—whether to extinguish or not is yours to decide.\"\n\nAnother asked, \"What is the stabilization of nature?\"\n\nThe master shifted his seat forward, sat upright in silence for a long while, then said, \"What stabilization of nature do you ask about?\"\n\nThe person did not comprehend. A nearby elder rose and bowed in gratitude.\n\nThe master said, \"Zhang drinks the wine, but Li becomes drunk.\"\n\nThe person still did not awaken.\n\nThe master said, \"Scholars do not sleep, for their work is the refinement of the heart. If the heart is not gathered, what use is there? Those who gamble, play chess, spin thread, or grind grain—staying awake all night—are they those who attain the Dao? Such people, driven by profit in every moment, are lured by greed, their minds disturbed like mosquitoes biting the skin. Thus, they cannot sleep. The cultivator is not like this. Sleep is but one desire; if not transformed, it breeds delusion, obscuring clarity, belonging to the yin realm. Like one guarding against thieves, sitting vigilant—thieves will retreat of their own accord. Focus on refining the heart, lest it drift into dissipation. This heart, fundamentally without fixed form, is bright in yang and dark in yin. When familiar realms dissolve, there is non-doing and purity; the pearl of nature shines clearly—this is why one remains awake day and night.\"\n\nThe master said, \"Cultivators struggle with this stubborn heart. From beginningless time, the bones of cyclic existence have piled like mountains. Through ten thousand births and deaths, only now does one awaken to past errors, seeking liberation. Thus, by day one dares not eat, by night one dares not sleep—refining this stubborn heart until every worldly inversion is overturned, only then can it be of use. Without refining the heart, even if one sees others not sleeping and imitates them, thoughts arise like hairs, igniting like sparks at the slightest touch. What use is a hundred years without sleep? If the stubborn heart remains, one is still bound to the cycle. To transform this heart, whether in movement or stillness, moment by moment, shatter this stubborn heart to pieces—only then can it be of service. The original true spirit is akin to heaven and earth. Then, in motion it is the Dao, in stillness it is the Dao; speaking it is the Dao, silence is the Dao. What else is there to seek? This is the carefree Daoist.\"\n\nSomeone asked, \"Those who cultivate from the beginning must first establish resolve—what is resolve?\"\n\nThe master said, \"In every moment—whether in movement or stillness, in all circumstances, in walking, standing, sitting, or lying down—let every thought be of the Dao. Unshaken by demons, unmoved by harm, whether in ease or adversity, iron-faced or otherwise, one stakes this body without hesitation, advancing single-mindedly without fear of life or death. This is a person of resolve.\"\n\nThus, the sutra says: \"Those who practice with vigor have resolve.\"\n\nThe master said, \"Cultivators must establish resolve and integrity. Yet when resolve and integrity are set, one may become rigid. Rigidity makes one inflexible in matters. When one becomes adaptable in matters, one may grow complacent, letting days pass idly. Thus, scholars are as numerous as ox hairs, but those who attain are as rare as qilin horns. Generally, those who study the Dao must first return to the ancestral source, decisively establish resolve and integrity, recognize adaptability, practice single-mindedly and diligently—persisting without cease, there is nothing that cannot be achieved.\"\n\nThe master said, \"The Daoist refines the heart like forging gold into a chicken. Though its form resembles a chicken, its heart remains unmoved, standing apart from the flock. Though chickens may be combative, none dare approach. One who embodies the Dao has a heart like cold ashes, a body like a withered tree. Though the hearts of the world may be contentious, none dare contend with them.\"\n\nThus, the sutra says: \"Only because they do not contend does the world have none who can contend with them.\"\n\nSomeone asked, \"The supreme matter is complete in everyone—why refine it further?\"\n\nThe master said, \"The unrefined heart is like ore containing silver—before smelting, it is but a stubborn stone. Placed in the great blazing furnace, impurities are burned away, the true substance separated. Once refined into gold, it no longer returns to the furnace.\"",
      "overlap_context": "either following sound nor chasing form, at ease everywhere, empty and carefree, enduring as heaven and earth, the true sovereign becomes self-evident.\n\nWhen the heart is upright, all things are upright; when the heart is crooked, all things are crooked. With a sovereign within, what others love, one does not love; what others despise, one does not despise. All old habits are turned around. When the six senses are empty, the true sovereign abides in stillness—what fear of life and death remains?",
      "start_char": 6135,
      "end_char": 7388,
      "start_sentence": 212,
      "end_sentence": 256,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.32106375694275,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\修真十书盘山语录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "修行之人，亦复如此。 将来蒙昧染着之心便同顽铲，以志节为大冷，以惠照为黑炭，殷恋缎炼，一毫不存，炼出自己本初无碍底冥心。 既已成真，不复为假，当自保护，坚固收藏，会得受用，此便是亘古圆明底无价宝珠也。 师云：自来学道之人，必须苦己利他，暗积功行。 若复迷心，非理行事，不惟有辱教门，抑亦自招殃咎。 为身为口，不清不俭，与俗无异。 如受用十方汗血之物，未是便宜，乐中受了，苦中还他，生死到头，更无伎俩支吾。 既居门下，可不炼心。 或问：人皆取乐，道人就苦，何也？ 师云：世人不知真乐，以心肯处为乐，被欲心引在苦处，便认苦为乐，每日用心计度，专求世乐，不得，忧苦胶扰心灵，永无自在，是谓大苦。 学道之人不求世乐，心存大道，遇苦不苦，无苦则常乐，心得自在。 凡有乐则有苦，无乐则无苦，心无苦乐，乃所谓真乐也。 或问曰； 学道之人甘受贫寒，其理安在？ 师云：若但认贫苦饥寒为是，则街头贫子、艰难之人，尽是神仙也。 盖修行之人，＇以道德为心，以清静为念、削除诈伪，贪求妄作一时遣尽，忘形忘我，身外之物，未尝用心。 故有云：遮皮盖肉衣，更选甚好弱。 填肠塞肚饭，更择甚精粗。 唯究生死炼心为事，故不藉形骸之苦也。 师云：修行之人，有一分工夫，便有一分胜心，有十分工夫，便有十分胜心。 既有胜心，则有我相，我相胜心作大障碍，如何得到心空境界，灭也却要重添央烈。 把自己身心挫在万物之下，常居人后，自念千万不如人者，然后可以遣却矜胜之心。 心同太虚，则无我也，无我则与道相应矣。 师云：修行之人收拾自心，如一尊雕木圣像，坐在堂中，虽终日无人亦如此，应盖簇拥亦如此，香花供养亦如此，往来毁谤亦如此。 惟此，木像通灵通圣，活泼泼地明道德，一切事上物上却不住着也。 或问：某念念相续，扫除不尽，如何即是？ 师云：朝日扫心地，扫着越不静，若要心地静，击下曹蒂柄。 其人拜谢。 师云：修行人当初出家，为此性命事大。 岁久不觉为物所搬，却学口头仗俩、百种所能为奴作婢之事。 何以知之？ 但凡伎艺必欲人前程，似此不是为人所役也？ 岂是清净无为主人之事。 所以道智者所用而愚者用之，巧者不为巧者所使而拙者使之，辩者说之，默者、听者仔细详之。 孰忙孰闲？ 凡欲修行，心地明白而守愚拙，则天下之智巧者，皆为之使用矣。 或问曰：修行人有言知觉，又云是病，其旨如何？ 师云：真知以不知之知，真觉以不觉之觉。 元本真灵蒙昧，万却今方省悟，乃名为觉，一切知见，皆从此生。 若言有知有觉，又专欲常知常觉，乃是自缠自缚，无病自炙也。 若一向不知觉，却透入别壳也。 既悟本宗，知觉皆是用处，常用即用，不可为常也。 或问日：学人如何是觉性？ 师云：指东画西，这般虚头且休，不如下些实工夫去。 谓如心上有底、眼前有底情欲烦恼，人我无明等。 喻以面前有天眼大瑁璃滑井，若丝毫不照顾，便堕在裹面，万劫不得出，若先见，又识破，方欲下脚，急须退步照顾底，便是你觉性也。 若分明堕在人我穿裹，犹自指空画空，说向上事，如此干甚觉性事。 或问日：出家人学古人公案者，有学经书者，有云古教中照心是否？",
      "translated_text": "The practitioner of cultivation is likewise thus. The heart shrouded in ignorance and clinging is like unrefined ore—take resolve as the great blazing furnace, wisdom as the black charcoal, and refine it with ardent devotion until not a trace remains. What emerges is one’s own originally unimpeded, primal heart. Once made true, it is no longer false. Guard it well, preserve it steadfastly, and when you comprehend its use, this is the priceless, ever-bright pearl of ancient perfection.\n\nThe master said: Those who have long studied the Dao must discipline themselves for the benefit of others, silently accumulating merit and conduct. If the heart remains deluded and one acts without principle, not only does this disgrace the teachings, but one also invites calamity upon oneself. Whether in body or speech, if one is neither pure nor frugal, one differs not from the common folk. To enjoy the sweat and blood of the ten directions is no easy gain—what is taken in joy must be repaid in suffering. When the hour of birth and death arrives, there will be no tricks left to evade it. Since you dwell within this gate, how can you not refine the heart?\n\nSomeone asked: Everyone seeks joy—why do Daoists embrace suffering?\n\nThe master said: Worldly people know not true joy. They take what pleases the heart as joy, yet desire leads them into suffering, and they mistake suffering for joy. Daily, they scheme and calculate, seeking worldly pleasures. When they fail, sorrow and distress entangle their spirits, leaving them forever restless—this is the greatest suffering. The practitioner of the Dao seeks not worldly joy but holds the great Dao in the heart. Encountering suffering, they do not suffer; without suffering, they abide in constant joy, their hearts at ease. Where there is joy, there is suffering; where there is no joy, there is no suffering. A heart free of joy and suffering—this is true joy.\n\nSomeone asked: Why do practitioners of the Dao willingly endure poverty and hardship?\n\nThe master said: If one merely accepts poverty, hunger, and cold as right, then the beggars in the streets and the destitute would all be immortals. The practitioner of cultivation takes virtue and power as the heart, purity and stillness as the mind, cutting away deceit and falsehood, greed and reckless action—all dispelled in an instant. Forgetting form and self, they give no thought to external things. Thus it is said:\n*A robe to cover skin and flesh—what need for fine or coarse?*\n*Food to fill the belly—what need for refined or plain?*\nTheir sole concern is the inquiry into birth and death and the refinement of the heart, so they do not cling to the suffering of the body.\n\nThe master said: The practitioner of cultivation gains a measure of skill and develops a sense of superiority; with full mastery, this sense grows tenfold. Yet with superiority comes the mark of self, and the self’s arrogance becomes a great obstacle. How can one reach the realm of an empty heart? If extinguished, it must be rekindled with even greater intensity. Place your body and mind beneath all things, always yielding to others, and reflect that you are inferior in ten thousand ways—only then can the heart of pride and superiority be cast aside. When the heart is like the vast emptiness, there is no self; without self, one accords with the Dao.\n\nThe master said: The practitioner of cultivation gathers in the heart as if it were a carved wooden statue seated in the hall—whether no one is present all day, or whether it is draped and adorned, or offered incense and flowers, or slandered by passersby, it remains thus. Only this wooden statue, spiritually awakened and sagely, vividly illuminates virtue and power, yet does not cling to any affair or thing.\n\nSomeone asked: My thoughts follow one after another, impossible to sweep away—how can this be right?\n\nThe master said: Sweeping the heart-ground daily only stirs more unrest. If you wish the heart-ground to be still, strike down the handle of the broom.\n\nThe questioner bowed in gratitude.\n\nThe master said: When practitioners first leave the household life, it is for the sake of this great matter of life and destiny. Yet with the passing years, they unknowingly become moved by things and instead learn verbal tricks and a hundred kinds of skills, serving as slaves and maids. How can one know this? Whenever there is a skill, one must display it before others—is this not being enslaved by others? How can it be the work of a master of purity and non-action? Thus it is said: The wise use things, while the foolish are used by them. The skillful are not employed by the skillful, but the clumsy are; the eloquent speak, while the silent listen carefully and ponder. Who is busy? Who is at leisure? Those who wish to cultivate must keep the heart-ground clear yet appear foolish—then all the clever in the world will serve them.\n\nSomeone asked: Practitioners speak of knowing and awakening, yet also call it a sickness—what is the meaning?\n\nThe master said: True knowing is knowing without knowing; true awakening is awakening without awakening. The original true spirit, once obscured, only now awakens—this is called awakening. All knowledge and perception arise from this. To speak of having knowing and awakening, and to desire constant knowing and constant awakening, is to bind and burn oneself without cause. Yet if one remains entirely without knowing or awakening, one slips into another shell. Once awakened to the fundamental truth, knowing and awakening become tools—use them when needed, but do not make them constant.\n\nSomeone asked: What is the awakened nature of the practitioner?\n\nThe master said: Pointing east and drawing west—stop such empty gestures and apply real effort instead. Consider the passions, desires, afflictions, self, and ignorance that dwell in the heart and before the eyes. It is like a vast, slippery well of crystal before you—if you do not watch your step even for a moment, you will fall in and never escape for ten thousand kalpas. If you see it clearly and recognize the danger, then as you prepare to step forward, swiftly retreat and watch carefully—this is your awakened nature. If you have clearly fallen into the snares of self and others yet still point to emptiness and speak of the ultimate, what use is such awakened nature?\n\nSomeone asked: Among those who have left the household life, some study the public cases of the ancients, some study the scriptures, and some say that reflecting on the mind in the ancient teachings—are these correct?",
      "overlap_context": "ious, none dare contend with them.\"\n\nThus, the sutra says: \"Only because they do not contend does the world have none who can contend with them.\"\n\nSomeone asked, \"The supreme matter is complete in everyone—why refine it further?\"\n\nThe master said, \"The unrefined heart is like ore containing silver—before smelting, it is but a stubborn stone. Placed in the great blazing furnace, impurities are burned away, the true substance separated. Once refined into gold, it no longer returns to the furnace.\"",
      "start_char": 7388,
      "end_char": 8640,
      "start_sentence": 257,
      "end_sentence": 304,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.30194664001465,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\修真十书盘山语录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "师云：修行人本炼自己从凡入圣，出家以来却不肯以为事，只向他古人言句上搜寻，纸上文字裹做活计，寻行数墨，藤葛自缠，费尽工夫，济甚么事。 及至阎老唤来，一句也使不得，一字也使不得。 一字使不得，却不如百事不知、酩酊过目底却有些似，把如着恁寻趁底工夫，向自己本分事上寻趁，则不到得虚度时光。 如何是己本分事，只这主张形骸底，一点灵明从道裹禀受得来。 自古及今，清争常然，更嫌少甚，自征理得明白，便是超凡入圣底凭据，若信得及，便截日下功理会，自家亦如此公案，更数他人珍宝作甚么。 快便自受用去，管取今以后不被人瞒也。 师云：修行之人，正眼不开，员机不发，但向别人踪迹上寻觅，言句上裁度，终无是处。 喻如无眼人，虽闻人说日月之光，终不自见，只是想像。 盖不曾向自己心上着工夫也。 或问日：昔闻丹阳师父以悟死而了道速，其旨若何？ 师云：修行之人，当观此身如一死囚，牵挽入市，步步近死，以死为念，事事割拚，虽有声色，境物纷华，周匝围绕，目无所见，耳无所闻，念念尽忘。 此身亦舍，何况其他，以此炼心，故见功疾，死中得活，不生不死。 学道初机，救护生死，当作是念。 人生顷刻一息不来，便是死地，递相救拔，不可因循也。 师因有病者至极不能得去，乃普说云：修行之人，先须识破万绿虚幻，次要识破此个形骸一堆尘土，平日事上脱洒，临行必得自在。 昔东山有一庵主，临终缠绵淹延，不能脱离，使人问长春真人：往日但着於外绿，物境上未曾修炼，以此缠绵，不得解脱。 乃寄与语云：身非我有，性本虚空，一念不生，全身放下。 庵主闻此语，若有省，乃嘱众弟兄云：我以外缘所昧，以此心地无功，修行不决，今劝汝等，各各下功修炼身心，究此生死大事去。 言讫遂终。 又有一道人，临死不央，询问众人日：我如何去得？ 或曰：想师真其人。 想数日又去不得，或曰：想虚空者。 其人又去不得。 有一老仙闻而视之，其人举似前想底事，今亦去不得，老仙呵曰：来时有个甚，去后想个甚，安以待命，时至则行矣。 病人闻语，稽首谢之而卒。 大抵修行人，一切外绿目前权用，自己本实，要实下工，物裹事裹过得脱洒，临行怎得不脱洒。 物上事上滞着染着，临行怎得脱洒。 急当修炼生死，难防有日到来，外绿何济，各请思之。 师因有一道人病，普说云：修行之人饮食有节，动静有常，心神安泰，别无妄作，偶然得病便是天命，岂敢不受。 亦有自己运数之行，或因宿缘有此病魔。 先要识破这个四大一一是假，病则教他病，死则教他死，心意宁奈，从他变化。 心不在病，则重病得轻，轻病则愈，自性安和，恶浊气散，亦是还了病债，亦是冲过一重关节。 若不解此，心必不安，但有病患，即心狂乱，声唤不止，叫痛叫疼，怨天恨地，又怨人不扶持，恨人不求医，慎人不合药，责人不问候，一向专起无明，黑暗业心，见底无有是处，不知自己生死已有定数，假饶张张皇皇，还免得么？ 分外心乱，不自安稳，又不知心是身之主人，心亦不宁，遍身皆乱，岂不闻古人云：心荒意乱，地狱之门，分外招愆。 如此处心，轻病即重，重病即死，浊乱其性故也。",
      "translated_text": "The master said: Those who cultivate the Way originally refine themselves to ascend from the mundane to the sacred, yet since leaving the household life, they refuse to take this as their task. Instead, they search only among the words of the ancients, making a living within the characters on paper—counting lines and tallying ink, entangling themselves in vines and creepers. They exhaust all effort, but what good does it do? When Old Yanluo summons them, not a single phrase will serve, not a single word will avail. If even a single word is of no use, then one who knows nothing of worldly affairs yet passes through life in drunken oblivion is somewhat closer to the mark. Take the effort spent in such chasing and turn it toward your own fundamental task—then you will not have wasted your time.\n\nWhat is this fundamental task? It is simply this: the one who governs the body, that single spark of numinous clarity received from the Dao. From ancient times to the present, its purity has ever been thus—what more could you desire? When you have personally verified and understood this principle, it becomes the proof of transcending the mundane and entering the sacred. If you can truly believe this, then begin your practice at once. This is your own case—why count the treasures of others? Quickly turn inward and apply it to yourself, and from this day forward, you will not be deceived by others.\n\nThe master said: Those who cultivate the Way, if their true eye is not opened and their inherent mechanism does not activate, but they only seek on the traces of others and speculate on their words, will never find the right path. It is like a blind man hearing others describe the light of the sun and moon—he will never see it for himself, only imagining it. This is because he has never applied effort to his own mind.\n\nSomeone asked: Formerly, I heard that Master Danyang attained the Way swiftly through awakening to death—what is the meaning of this?\n\nThe master said: Those who cultivate the Way should regard this body as a condemned prisoner being dragged to the marketplace, each step bringing them closer to death. With death as their constant thought, they relinquish all things. Though sounds, sights, and the splendor of the world surround them, their eyes see nothing, their ears hear nothing, and every thought is forgotten. Even this body is abandoned—how much more all else? Refining the mind in this way brings swift attainment. In death, one finds life, neither born nor dying. For beginners in the Way, rescuing themselves from birth and death should be their sole concern. A single breath not taken, and one is already in the realm of death—each must save the other, and none can afford to procrastinate.\n\nWhen the master was gravely ill and could not recover, he addressed all present: Those who cultivate the Way must first see through the emptiness of all external conditions, then recognize this body as but a heap of dust. In daily affairs, be free and at ease; at the time of departure, you will surely attain liberation. Formerly, at Dongshan, an abbot lay dying, lingering in prolonged suffering, unable to free himself. He sent someone to ask True Man Changchun: \"In the past, I was attached to external conditions and never cultivated my mind amid the objects of the world—this is why I now suffer and cannot attain liberation.\" Changchun sent back these words: \"The body is not yours; the nature is fundamentally empty. When not a single thought arises, the whole body is released.\" Upon hearing this, the abbot seemed to awaken. He instructed his fellow disciples: \"I was deluded by external conditions, and thus my mind remained unrefined. My cultivation was indecisive. Now I urge you all to apply yourselves diligently to refining body and mind, and to investigate this great matter of birth and death.\" With these words, he passed away.\n\nThere was also a Daoist who, at the point of death, could not depart. He asked those around him: \"How can I go?\" Someone said: \"Imagine you are a true person.\" He imagined for several days but still could not go. Another said: \"Imagine emptiness.\" Again, he could not go. An old immortal heard of this and came to see him. The man recounted the previous suggestions, saying he still could not depart. The old immortal rebuked him: \"What did you come with? What are you imagining now? Simply await your fate—when the time comes, you will go.\" Upon hearing this, the sick man bowed in gratitude and passed away.\n\nGenerally, for those who cultivate the Way, all external conditions are provisional tools for the present, but one’s own fundamental reality must be cultivated in earnest. If you can pass through worldly affairs with freedom and ease, how could you not be free at the time of departure? If you are attached and stained by things and affairs, how could you be free at the time of departure? Urgently refine yourself in the face of birth and death—who knows when that day will come? What good are external conditions then? Each of you, reflect on this.\n\nWhen a certain Daoist fell ill, the master addressed all present: Those who cultivate the Way regulate their diet, maintain regularity in movement and stillness, and keep their minds and spirits at peace, without reckless actions. If they fall ill, it is Heaven’s decree—how dare they refuse it? It may also be the unfolding of their own karmic destiny, or the result of past causes manifesting as this illness. First, recognize that the four great elements are all illusory. If there is sickness, let it be sick; if there is death, let it be death. Remain calm and composed, and let things transform as they will. If the mind is not fixed on illness, a severe illness may become mild, and a mild illness may be cured. When the self-nature is peaceful and harmonious, foul and turbid qi disperse. This is repaying the debt of illness, passing through another barrier. If you do not understand this, the mind will not be at peace. At the slightest ailment, the mind becomes frantic, crying out in pain, cursing heaven and earth, resenting others for not supporting you, blaming them for not seeking a doctor, reproaching them for not preparing medicine, scolding them for not visiting. All the while, you give rise to ignorance, darkening the mind with karmic actions—nothing you do is right. Do you not know that your birth and death are already determined? Even if you rush about in panic, can you escape? With the mind in turmoil, you cannot find peace. Do you not know that the mind is the master of the body? If the mind is not at rest, the whole body is in chaos. Have you not heard the ancients say: \"When the mind is distracted and the thoughts scattered, the gates of hell open\"—you bring misfortune upon yourself. In such a state of mind, a mild illness becomes severe, and a severe illness leads to death, for the nature is befouled and disordered.",
      "overlap_context": " and recognize the danger, then as you prepare to step forward, swiftly retreat and watch carefully—this is your awakened nature. If you have clearly fallen into the snares of self and others yet still point to emptiness and speak of the ultimate, what use is such awakened nature?\n\nSomeone asked: Among those who have left the household life, some study the public cases of the ancients, some study the scriptures, and some say that reflecting on the mind in the ancient teachings—are these correct?",
      "start_char": 8640,
      "end_char": 9858,
      "start_sentence": 305,
      "end_sentence": 339,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.715248107910156,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\修真十书盘山语录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "若事事不节，过分成病，是病因自作、自作自受，更怨他谁。 心地下工夫，必不如此，各请思之。 或问：道人亦有病，如何是别处？ 师云：昔者丹阳师有疾，而医者不能诊其脉，壶丘子端坐，而相者不能得其真，何也？ 心不在物，造化莫能移，性不着宗，鬼神莫测，况医卜之凡乎？ 此与常人异也。 师云：修行人日用体天法地，常清常静，明而不昧，济物利生，虽混於万缘诸境之间，真源湛寂，无有间断，自得出离生死结缚。 此是一段大事因缘。 奈何不悟之人，中无主宰，欲情攻於内，根尘诱於外，不得自由，四生从此而输回，六道因兹而走作，换却头皮，难同　今日也。 或问：既言和光同尘，却道不着事，如何？ 师云：天是天，地是地，山是山，水是水，物是物，我是我，虽与混同，如何相着得。 或问：未来罪福，还有也无，师云：未来且莫问，据见在言之，你发一善心，欲於圣前焚香礼拜，以手拈香，其心发愿，愿家眷平安、添寿添福，此不是作善底心。 使望得福，虽得福亦不知，盖修善者明修暗报，故未尝有知者。 若你发一恶念，将刀杀人，才举此心，便承当偿命，此必不可於分明至公处作得。 伺其暗昧不测中造下，不久败露，便当偿命，此不是望罪得罪，其得罪却明知。 盖作恶者暗作明报，此则现在人为必然分明之事，况天伺察人所不知者，何方逃之？ 不可不戒。 或问日：天堂地狱从来有说，还真否？ 师云：天堂者，阳界，主善主福。 地狱者，阴界，主恶主祸。 古人立个天堂地狱，出自人心，人行所为，冥然相应。 谓如常清常净，利益一切诸善奉行，明白不昧，便属阳界。 种种诸恶，坑陷不平，旁生邪道，便属阴界。 无明黑暗，逐旋增长，滓秽尘垢，皆属黑簿，人神不容。 心若懊恼，众苦交煎，无人救援，便是地狱。 古人云：心清意静天堂之路，心荒意乱地狱之门。 喻如有一明真闻人，传说有杀人贼拦截行路，往往害玉人，心信从，退步一行，后必无害，若心不信，酩酊前进，及至山中，无事则已，若实有贼，即落奸徒，便悔之何及？ 地狱之说，亦如此义。 大抵为恶不如作善，善纵无报，有何罪过，恶道强行，凶祸及矣。 目前明白尚无改悔，何况幽冥，岂得预知也。 或问曰：有人云业通三世，果有否？ 师云：岂不闻古人有言：了即业障本来空，未了应须还宿债。 昔有人背生恶疮，痛不可忍，脓众交流，寻於无人处自缢而死。 似此之人，自己性分又不了，又不肯承受宿世脓血债负，虽自致死，再出头来亦是偿他。 何以知此为宿业邪？ 昔有一显官，不欲言其姓名，但道因果足矣，其性酷虐，但不喜，随从奴仆即加捶挞，一日坐尻上忽生痒痛，搔之则去皮，渐次血肉分裂，如新拷掠者，痛不可加，以致命终，以是知脓血债负必然还报。 岂止此事，乃至大小喜怒、毁谤、打骂、是非、见面相嫌，皆是前因所结旧冤，现世要还须当欢喜承受，不敢辨证，承当忍奈，便是还讫。 但有争竞，便是抵债不还，积累更深，冤冤重结，永无了期。 况复天意好还，乃至人问恩怨相伤，无非冤债。 昔长春真人住长真观日，忽值大兵北还，远藏匿以避。 逢一贵宦，与真人素相识者，家世奉道，自言夫人被虏，欲罄家资，赎令出家，拜问。",
      "translated_text": "If in all matters you lack restraint and excess leads to illness, then the illness is self-inflicted, and you alone must bear it—whom else can you blame? If you cultivate the mind-ground, you will never act thus. Ponder this well.\n\nSomeone asked: *\"Daoists also fall ill—how is this different?\"*\nThe Master replied: *\"Long ago, Master Danyang fell ill, yet physicians could not read his pulse. Master Huqiu sat in meditation, yet physiognomists could not discern his true nature. Why? Because when the mind is not attached to things, the workings of creation cannot alter it; when the nature is not bound to any school, even spirits cannot fathom it—how much less can ordinary physicians or diviners? This is what sets them apart from common people.\"*\n\nThe Master said: *\"Those who cultivate the Dao model themselves on heaven and earth in their daily conduct, ever pure and ever still, luminous yet unobscured. They aid beings and benefit life, though they mingle amidst the ten thousand conditions and myriad circumstances. Their true source remains serene and undisturbed, without interruption. Thus they naturally attain liberation from the bonds of birth and death. This is the great matter of karmic causation. Yet how pitiful are those who fail to awaken! Lacking inner mastery, their desires assail them from within while the senses and their objects lure them from without. They cannot act freely, and the four kinds of birth revolve endlessly, the six paths of rebirth churn without cease. Even if they were to change their very skin, they could never be as they are today.\"*\n\nSomeone asked: *\"If one is said to harmonize with the world yet not cling to things, how is this possible?\"*\nThe Master replied: *\"Heaven is heaven, earth is earth, mountains are mountains, waters are waters, things are things, and I am I. Though one mingles with the world, how can one truly cling to it?\"*\n\nSomeone asked: *\"Do future blessings and misfortunes truly exist?\"*\nThe Master said: *\"Do not ask about the future—let us speak of the present. When you generate a good thought, wishing to burn incense and bow before the sacred, your hand lifts the incense as your heart makes vows for your family’s peace, longevity, and fortune—this is not the mind of true goodness. Though you may seek blessings, even if received, you will not know it. For those who cultivate goodness, the reward is hidden, and thus none perceive it. But if you harbor an evil thought, raising a knife to kill, the moment the intention arises, you have already incurred the debt of a life for a life. This cannot be evaded in the realm of clarity and perfect justice. You may scheme in secret, believing it unseen, but soon your deeds will be exposed, and you will repay the debt—this is not seeking misfortune yet finding it. For evil brings manifest retribution, and this is an evident truth for all to see. Moreover, heaven observes what humans cannot—where can you flee? You cannot but be cautious.*\n\n*Someone asked: ‘People speak of heaven and hell—do they truly exist?’*\nThe Master replied: *\"Heaven is the yang realm, governing goodness and blessings. Hell is the yin realm, governing evil and misfortune. The ancients established heaven and hell as reflections of the human mind. One’s actions resonate in the unseen. If one is ever pure and ever still, benefiting all beings and practicing goodness with clarity and unwavering resolve, one belongs to the yang realm. But if one engages in all manner of evil, deceit, and injustice, following perverse paths, one belongs to the yin realm. Ignorance and darkness grow unchecked, filth and defilement accumulate—all recorded in the black ledger, intolerable to gods and humans alike. When the mind is afflicted and myriad sufferings assail, with no one to save you, that is hell. The ancients said: ‘A clear mind and tranquil intent are the path to heaven; a scattered mind and chaotic thoughts are the gate to hell.’ It is like hearing from a trustworthy person that bandits lie in wait along the road, often harming travelers. If you believe the warning and turn back, you will avoid harm. But if you dismiss it and stumble forward drunk, reaching the mountains unscathed is mere luck—if bandits truly lurk, you will fall into their trap, and regret will come too late. The teachings on hell follow the same principle. Generally, doing evil is never better than doing good. Even if goodness brings no reward, what fault is there? But if you persist in evil, calamity will surely strike. If you fail to repent even when the consequences are plain before you, how much less will you foresee what lies in the unseen?\"*\n\nSomeone asked: *\"It is said that karma spans three lifetimes—is this true?\"*\nThe Master replied: *\"Have you not heard the ancients say: ‘When delusion is ended, karmic obstacles are fundamentally empty; while delusion remains, one must repay past debts.’ Long ago, a man suffered from a festering sore, the pain unbearable, pus and blood flowing endlessly. Seeking solitude, he hanged himself. Such a person, neither understanding his own nature nor willing to endure the karmic debt of pus and blood from a past life, though he took his own life, would only be reborn to repay it. How do we know this was past karma? Once there was a high official—let us not speak his name, but the principle of cause and effect suffices. Cruel and tyrannical by nature, he would beat his servants at the slightest displeasure. One day, he suddenly felt an itch on his buttocks. Scratching it, he tore away the skin, and soon flesh and blood split open, as if freshly flogged, the pain unbearable until he died. Thus we know that the debt of pus and blood must be repaid. Not only this, but even minor likes and dislikes, slander, beatings, quarrels, and grudges held at first sight—all are old karmic entanglements from past lives. In this life, one must repay them willingly, accepting and enduring without complaint. This is how debts are settled. But if you contend and refuse to repay, the debt only deepens, the enmity compounds, and there will be no end to it. Moreover, heaven favors repayment, and even in human affairs, every injury and grievance is but a karmic debt. Once, when Master Changchun resided at Changzhen Abbey, a great army returned from the north, and he hid to avoid them. He encountered a nobleman, an old acquaintance whose family had long practiced the Dao. The man said his wife had been captured and that he wished to spend his entire fortune to ransom her and let her leave the household to take vows. He sought the Master’s guidance...\"*",
      "overlap_context": "Even if you rush about in panic, can you escape? With the mind in turmoil, you cannot find peace. Do you not know that the mind is the master of the body? If the mind is not at rest, the whole body is in chaos. Have you not heard the ancients say: \"When the mind is distracted and the thoughts scattered, the gates of hell open\"—you bring misfortune upon yourself. In such a state of mind, a mild illness becomes severe, and a severe illness leads to death, for the nature is befouled and disordered.",
      "start_char": 9858,
      "end_char": 11095,
      "start_sentence": 340,
      "end_sentence": 380,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.50714945793152,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\修真十书盘山语录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "真人悦然不可其事，议间，兵去已远。 他日贵宦且询不可之意，真人日：夫人与昨虏之主人有三年宿债，今既相对，乃前绿也，三年后却还，来此出家。 后果三年放还，得簪裳，出家，来诣观参见真人。 以从来奉善却得入道，贵宦方信，拜谢而已。 师云：道无言说，惟指善恶，善则成就无上出世因绿，有天堂，无地狱。 恶则堕落无边苦趣，有地狱，无天堂。 分此两途，盖由迷悟，悟则剎那成圣，迷则永劫沈沦。 幸得人身，宁不思之。 或问：如何是祸福？ 师云：积木成林，积石成山，积水成海，积善成福，积恶成祸。 祸福之源，本自一心，积心方成，可不慎之。 或问：如何出得罪福因果？ 师云：罪福因果，属阴阳之壳，若你出得阴阳之壳，则无罪福因果也。 如何是阴阳壳？ 但凡心上一毫头许私邪利欲恶便属阴壳，有一毫头许善念便属阳壳，在阴则有恶报，在阳则有善报。 若曾炼心体如虚空，初无善、无恶、无丝毫挂碍处，作得主则祸福着他不得，因果缠他不着，便是个出阴阳壳底人也。 在家之人未曾有一古念在心，十二时中只图财图利，你死我活，坑人陷人，一片无明，黑暗业心，只堕在阴壳裹，阳道上也去不得，怎生出得阴阳壳，便待要无罪福无因果，不亦难乎？ 你自造下，怎生沉得，所以低头合眼，教他阎老理会去也。 或问：未来托生之下端的如何？",
      "translated_text": "The Master firmly declined the proposal. By the time they had finished discussing it, the troops had already marched far away. Later, the nobleman asked why the Master had refused. The Master replied: \"Your wife and the man who captured her share a three-year karmic debt from a past life. Now that they have met again, it is the fulfillment of that previous cause. After three years, she will be released and come here to leave the household and take vows.\" Indeed, three years later, she was set free, donned the hairpin and robes of a Daoist, and came to the abbey to pay her respects to the Master. Because she had long practiced goodness, she was able to enter the Dao. Only then did the nobleman believe and bow in gratitude.\n\nThe Master said: \"The Dao cannot be expressed in words; it only points to good and evil. Goodness establishes the unexcelled cause for transcending the world—there is heaven, no hell. Evil leads to endless suffering—there is hell, no heaven. These two paths arise from delusion or awakening: awakening brings instantaneous sagehood, while delusion leads to eternal sinking. Having attained a human form, how can one not reflect on this?\"\n\nSomeone asked: \"What are fortune and misfortune?\"\nThe Master replied: \"Piling wood makes a forest; piling stones makes a mountain; piling water makes a sea; piling goodness makes fortune; piling evil makes misfortune. The source of fortune and misfortune lies in the mind alone. Once accumulated, how can one not be cautious?\"\n\nAnother asked: \"How can one escape the cycle of karmic retribution?\"\nThe Master said: \"Karmic retribution belongs to the shell of yin and yang. If you break free from this shell, then there is no karmic retribution. What is the shell of yin and yang? Any trace of selfish desire or wickedness in the mind belongs to the yin shell; any trace of good intention belongs to the yang shell. Within yin, there is evil retribution; within yang, there is good retribution. But if you have refined your mind until it is like empty space—utterly without good or evil, without the slightest entanglement—then you become the master. Fortune and misfortune cannot touch you; cause and effect cannot bind you. This is a person who has broken free from the shell of yin and yang.\n\nThose who remain in the household life never have a single ancient thought in their hearts. All twelve hours of the day, they scheme for wealth and profit, engage in life-and-death struggles, deceive and entrap others, their minds shrouded in ignorance and dark karma. They are trapped within the yin shell, unable to reach the yang path. How then can they break free from the shell of yin and yang to attain freedom from karmic retribution? Is it not difficult? You have created this fate yourself—how can you escape it? Thus, when you lower your head and close your eyes, you leave it to King Yama to decide.\"\n\nSomeone asked: \"What exactly determines one’s future rebirth?\"",
      "overlap_context": "reover, heaven favors repayment, and even in human affairs, every injury and grievance is but a karmic debt. Once, when Master Changchun resided at Changzhen Abbey, a great army returned from the north, and he hid to avoid them. He encountered a nobleman, an old acquaintance whose family had long practiced the Dao. The man said his wife had been captured and that he wished to spend his entire fortune to ransom her and let her leave the household to take vows. He sought the Master’s guidance...\"*",
      "start_char": 11095,
      "end_char": 11620,
      "start_sentence": 381,
      "end_sentence": 399,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.908846139907837,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\修真十书盘山语录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "师云； 人生一世，随情自造，成个来世底模子，作善底造下个善模子，作恶底造下个恶模子，以至尽此报身一性离劫。 这个壳子如铁镕成金汁，造物者倾在自造底模子裹，或为人，或旁生，自作自受去也。 造物者岂有心教你作旁生？ 岂有心教你为六道？ 是你一生自造底壳，落在其中逃闪不得。 先有此性，便有此物，谓如狼毒者为蛇，悭吝者为犬，淫杀者为豕，贪暴者为狼，大抵皆类此。 天地之问万形万状，不可言尽，故古人云：同於金石，化为金石； 同於水火，化为水火。 其言信也。 瞬息之问，一失人身，万劫不复，曷不思之？ 师示众云：人生於众，所为所作无不报应，谓如体道者得道，作福者得福，作孽者得孽，爱人者人爱之，信实者人信之，利人者人利之，害人者人害之，自高则人抑之，低下者人下之，慢人者人慢之，敬人者人敬之，恶人者人恶之，欲先则人争之，自强则人敌之。 故云种兰得香，种粟得粮，皆报应之理也。 若存利心，娇诈为之以取人心，则失真矣。 师云：学道心若未通，不远千里求师参问，傥若针芥相投，心地明白，更无疑虑，然后或居园堵，或寄林泉，或乞市中，或立宫观，安心守道，更无变坏，此修真之上士也。 有一等出家，性又不明，更懒参问，心高好胜，自执己是，诈装高道，亏功失行，两下落空，骇人供养，不思己德如何销受，如此之人，住园也不是，乞食也不是，生死到来都不中用。 盖不肯於根蒂上下工夫也。 直至百年，无有是处。 师云：往昔栖山时，终日杜门，不接人事十有余年，以静为心，全无功行。 向没人处独坐，无人触着，不遇境，不遇物，此心如何见得成坏，便是空过时光。 若天不利物，则四时不行，地不利物，则万物不生，不能自利利他，有何功德。 故长春真人云：动则安人利物。 盖与天地之道相合也。 或问曰：修行之人头头要不昧，如何得不昧？ 师云：初心未炼，出入不知，不会收纵，遇境遇物，一向着将去，朝新暮故，直待困了方休，不明自己，便是昧了也。 便与托生一般，不知不觉透在别个壳子裹，直待报尽方回，此为昧了故也。 若专用知用觉，又被知觉昧了也。 修行之人若能二六时中点检自己，不被一尘情点污，境上物上轻快过去，便是不昧也。 师云：凡圣同途，只因明昧，明之则圣，昧之则凡。 凡人之心，不肯剑情去执，弃妄除邪，逐境迁流，随情宛转，取一时之乐，积万劫之殃，不省不思，莫觉莫悟。 师云：修行人本宗上无亏，行业上用意，物境上速过去，人事裹不住着，邪念不起纤毫不立，微尘不染晃朗虚明，不着空，不着有，不执法相，不执我见，兼众人之光明，久久相资，融通表裹，便见圣贤地位，更有甚可疑也。 师云：修行人先要明自己本宗，次要通教化。 若本宗不通，如人无目，不分道路，举足差讹。 若教化不明，如人有目而坐黑暗中，则有偏执。 我见须要俱通，方得员应，若俱不通，如大暗中坐而又无目，何时得出也。 师云：修行人若玄关不通，心地不明，则其业识不能无为者，盖为无福德故也。 乃当於有为处教门中，随分用功立事，接待方来，低下存心，恭敬师友，常行方便，屏去私邪，久久绿熟，日进一日，自有透得处。",
      "translated_text": "The master said: A person’s lifetime is spent following their emotions to shape their own mold for the next life. Those who do good forge a mold of goodness; those who do evil forge a mold of evil. This continues until the end of this karmic body, when the original nature departs the kalpa. This shell is like molten iron poured into the self-made mold by the Creator—whether as a human or as another being, one reaps what one has sown. Does the Creator intend for you to become an animal? Does the Creator intend for you to enter the six realms? It is the shell you have forged in this life, trapping you within it with no escape. First there is this nature, then there is this form. For example, the cruel become snakes; the stingy become dogs; the lustful and murderous become swine; the greedy and violent become wolves. Generally, all follow this pattern. Between heaven and earth, the myriad forms and shapes are beyond description. Thus the ancients said: \"In harmony with metal and stone, one transforms into metal and stone; in harmony with water and fire, one transforms into water and fire.\" Their words are true. In an instant, one may lose the human form and not regain it for ten thousand kalpas—why not reflect on this?\n\nThe master addressed the assembly: In the midst of others, all that one does and acts upon will bear karmic retribution. Those who embody the Dao attain the Dao; those who perform good deeds gain blessings; those who commit evil deeds suffer misfortune. Those who love others are loved in return; those who are trustworthy are trusted; those who benefit others are benefited; those who harm others are harmed. Those who exalt themselves are humbled by others; those who humble themselves are elevated. Those who disdain others are disdained; those who respect others are respected. Those who hate others are hated; those who seek precedence are contested; those who act with strength are opposed. Thus it is said: Plant orchids and you reap fragrance; plant millet and you reap grain—all follow the principle of karmic retribution. If one harbors a mind of profit and employs deceit to win others’ hearts, one loses authenticity.\n\nThe master said: If the heart has not yet penetrated the Dao, one may travel a thousand miles to seek a teacher and inquire, and if the connection is as precise as a needle meeting a magnet, the mind-ground becomes clear, all doubts vanish. Then, whether dwelling in a walled garden, residing by a forest spring, begging in the marketplace, or establishing a temple, one may settle the mind and guard the Dao without deviation or corruption—this is the superior practitioner of the true. There are those who leave the household life, yet their nature remains unclear. Lazy in inquiry, proud and competitive, clinging to their own views, they feign the appearance of high attainment, neglecting merit and losing conduct. Both sides come to nothing. They deceive others into offering alms, never considering how their own virtue can repay such gifts. Such people are unfit to dwell in gardens or beg for food; when the time of life and death arrives, they are of no use. This is because they refuse to work at the root. Even after a hundred years, they achieve nothing.\n\nThe master said: In the past, when I dwelled in the mountains, I shut my door for over a decade, avoiding all human affairs. My heart was set on stillness, yet I accumulated no merit or conduct. Sitting alone where no one disturbed me, untouched by circumstances or things, how could this heart discern formation or decay? It was merely passing time in emptiness. If heaven does not benefit beings, the four seasons cease to turn; if earth does not benefit beings, the myriad things fail to grow. If one cannot benefit oneself and others, what merit is there? Thus Master Changchun said: \"In movement, bring peace to people and benefit beings.\" This accords with the Dao of heaven and earth.\n\nSomeone asked: For those who cultivate the Dao, every moment must be free from delusion—how can one achieve this?\n\nThe master said: At the beginning, before the heart is refined, one does not know how to gather or release. Encountering circumstances or things, one clings to them entirely, renewing in the morning and decaying by evening, persisting until exhausted before ceasing. Unaware of oneself, one is deluded. It is like rebirth—unconsciously slipping into another shell, remaining until the karmic debt is repaid before returning. This is delusion. If one relies solely on knowledge and awareness, one is deluded by knowledge and awareness. The cultivator who can examine themselves in every moment of the twelve hours, untouched by even a speck of emotional dust, lightly passing through circumstances and things, is free from delusion.\n\nThe master said: The paths of the ordinary and the sage are the same; the difference lies only in clarity or delusion. Clarity makes one a sage; delusion makes one ordinary. The heart of the ordinary person refuses to sever emotional attachments, abandon falsity, or eliminate evil. Drifting with circumstances, swayed by emotions, they seek momentary pleasure, accumulating kalpas of suffering, never reflecting, never awakening.\n\nThe master said: The cultivator who remains unblemished in their fundamental nature, applies effort in conduct, swiftly passes through external things, remains unattached to human affairs, does not entertain the slightest deviant thought, leaves no trace of dust, and abides in luminous emptiness—neither clinging to emptiness nor existence, neither grasping dharma-appearances nor self-views—who gathers the light of all beings and, over time, mutually enhances inner and outer, will perceive the realm of the sages and worthies. What doubt remains?\n\nThe master said: The cultivator must first clarify their fundamental nature, then master the teachings. If the fundamental nature is unclear, it is like a person without eyes—unable to distinguish the path, every step is mistaken. If the teachings are not understood, it is like a person with eyes sitting in darkness—prone to partiality and attachment. One must master both self and teachings to respond perfectly. If neither is mastered, it is like sitting in great darkness without eyes—when will one ever emerge?\n\nThe master said: If the cultivator’s mysterious pass remains unopened and the mind-ground unclear, their karmic consciousness cannot attain non-action, for they lack merit and virtue. They should therefore engage in active practice within the teachings, cultivating according to their capacity, establishing deeds, welcoming those who come, maintaining humility, respecting teachers and friends, constantly practicing kindness, and eliminating selfishness and deceit. Over time, as familiarity deepens and progress is made day by day, there will naturally come a point of breakthrough.",
      "overlap_context": "death struggles, deceive and entrap others, their minds shrouded in ignorance and dark karma. They are trapped within the yin shell, unable to reach the yang path. How then can they break free from the shell of yin and yang to attain freedom from karmic retribution? Is it not difficult? You have created this fate yourself—how can you escape it? Thus, when you lower your head and close your eyes, you leave it to King Yama to decide.\"\n\nSomeone asked: \"What exactly determines one’s future rebirth?\"",
      "start_char": 11620,
      "end_char": 12857,
      "start_sentence": 400,
      "end_sentence": 436,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.31016182899475,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\修真十书盘山语录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "不胜如两头空檐，不能无为，不能有为，因循度日，无功无行，隐处着脚，甜处着口，闲管世事，闹处出头，恣纵身心，不惧神明，打算有日。 岂不闻长春真人云：心地下功，全抛世事。 教门用力，大起尘劳。 目循过日，请自思之，是何人也？ 或有医者问云：某行医道，活死者百余人，其果如何？ 师云：只饶救尽天下人，亦不如救自己生死去，世问福报有尽限，自己修炼到无生死处，此福无量。 或有一匠人问云：某修大殿不征功价，如此诚心，合有何果？ 师云：不如清净人默坐一时辰，盖有为之福有坏，无为之福无坏。 或问曰：如何是功行？ 师云：合口为功，开口为行。 默而得之，无喜无虑，缄口忘言处，不求人知，韬光晦边，此是合口为功。 施诸方便，教人行持，利益群生，指引正道，是开口为行。 或问日：天下立教，各说异端，自是非他，邪正未知谁是？ 师云：此有两端：有修炼者，有应世者。 修炼此心，如天地一般清诤，日月一般明白，四时一般运化，能体其事，能归其根，更莫问向上如何，只此便是正道之作用也。 唯修炼者能之。 若口头念诵得如法，身上装束得作相，个个堪看，便人人见喜，此是教门中应世底。 枝梢花叶，干甚修炼事，干甚正道事，此是权时使用，况兼心上争人我、争财、争利，心与俗人一般，怎生得道。 我是道教也。 明目者识之。 这个有体用，没你我，正正当当底真心，自从亘古未有天地已前禀受得来，不可道有，不可道无，古今圣贤、天下老道，人皆得此，然后受用，千经万论及至《大藏经》，只是说这些子。 上天也由这个，入地也由这个，乃至天地万物，虚空无尽际，亦是此个消息主宰也。 会得底，不被一切境引将去，不被一切念虑搬弄，不被六根馒过。 这个便是神仙底日用，便是圣贤底行踪，便是前程道子也。 或问：修行之人多说除情去欲，此以上更有甚么？ 师云：除了情到无情，去了欲到无欲，无情无欲底，则你道合这个是甚么？ 或问：修行之人如何得清静？ 师云：心不逐物谓之安心，心不受物谓之虚心。 心安而虚，便是清静，便是道也。 或问曰：道家常论金丹，如何即是？ 师云：本来真性，即是也。 以其快利刚明，变化融液，故名金； 曾经煅炼，圆成具足，万劫不坏，故名丹。 体若虚空，表裹莹彻，一毫不挂，一尘不染，辉辉晃晃，照应无方。 故祖师云：本来真性号金丹，四假为炉炼作团，不染不思除妄想，自然辊出赴仙坛。 世之人有言：金丹於有形象处造作。 及关情欲，此地狱之见，乃淫邪之所为，是乖人道、入旁生之趣矣。 师云：凡日用者，心无离念，意不外游，放而不逸，制而不拘，明心识法，去智离空，十二时中念念现前，若滞现前，亦非其理，若离现前，无有是处，会动静、知去来，般般放下，无挂无碍，便是逍遥自在底人也。 但说皆非，自当消息。 或问：某老迈不能多学，乞师向上极玄极妙处说一句。 师云：把你这个求无上极玄极妙底去了，则便是也。 或问曰：如何是玄妙？ 师云：谁教你作此问？ 其人拱手云：弟子自出意来。 师云：惫么则你自会也。 其人笑而稽首。 或问曰：识得一，万事毕。 又有云，抱元守一，一者是甚么？",
      "translated_text": "Worse still is the state of one who, like a roof with empty eaves at both ends, can neither attain non-action nor engage in action—merely drifting through days without merit or practice, planting their feet in seclusion, savoring sweetness with their mouth, idly meddling in worldly affairs, thrusting themselves into clamor, indulging body and mind without fear of divine judgment, and calculating their days ahead.\n\nHave you not heard the words of True Man Changchun: *\"To cultivate the mind-ground, wholly cast aside worldly affairs. To exert effort in the teachings is to stir up worldly toil.\"* If you pass your days in idle routine, reflect upon yourself—what manner of person are you?\n\nA physician once asked: *\"I have practiced medicine and revived over a hundred dying souls. What karmic fruit does this bear?\"*\nThe master replied: *\"Even if you saved every person in the world, it would not compare to saving yourself from the cycle of birth and death. Worldly blessings have their limits, but if you cultivate to the point of transcending birth and death, this merit is boundless.\"*\n\nA craftsman asked: *\"I built a great hall without seeking payment. With such sincerity, what karmic fruit will I receive?\"*\nThe master replied: *\"It is not as meritorious as a person of purity sitting in silent meditation for a single hour. Merit from action decays, but merit from non-action does not.\"*\n\nSomeone asked: *\"What are merit and practice?\"*\nThe master replied: *\"Closing the mouth is merit; opening the mouth is practice. To attain it in silence, without joy or worry, in the stillness of sealed lips and forgotten words—seeking no recognition, concealing one’s light—this is closing the mouth as merit. To offer expedient means, teach others to practice, benefit all beings, and guide them to the true Dao—this is opening the mouth as practice.\"*\n\nAnother asked: *\"The teachings of the world each claim their own truth, distinguishing themselves from others. How can we know which is orthodox and which is heterodox?\"*\nThe master replied: *\"There are two paths: one of cultivation, and one of worldly engagement. To cultivate this mind is to make it as pure as heaven and earth, as luminous as the sun and moon, as ceaselessly transformative as the four seasons. One who embodies this and returns to the root need not ask what lies beyond—this itself is the functioning of the true Dao. Only those who cultivate can attain it. As for those who recite scriptures flawlessly with their lips and adorn themselves with the trappings of practice, making themselves pleasing to all—these are merely those who engage with the world through the teachings. What do branches, flowers, and leaves have to do with cultivation? What do they have to do with the true Dao? These are temporary expedients. Moreover, if their hearts are filled with contention over self and others, wealth and gain—if their minds are no different from those of ordinary people—how can they attain the Dao? I speak of the Daoist teaching. Let those with clear eyes discern it.*\n\n*This has both substance and function, transcending self and other. It is the true mind, upright and unchanging, received since before the existence of heaven and earth—neither existent nor non-existent. All sages, ancient and modern, and all Daoist masters in the world have attained this before putting it to use. The thousands of scriptures and countless sutras, even the entire *Great Treasury of Scriptures*, speak only of this. Heaven operates through it, earth operates through it, and even the ten thousand things of the world, the boundless expanse of emptiness, are governed by this very principle. One who comprehends it is not led astray by any circumstance, not swayed by any thought, not deceived by the six senses. This is the daily practice of immortals, the conduct of sages, the path of those who advance in the Dao.\"*\n\nSomeone asked: *\"Those who cultivate often speak of eliminating emotions and desires. What lies beyond this?\"*\nThe master replied: *\"When emotions are eliminated to the point of no emotion, and desires are gone to the point of no desire—what do you suppose harmonizes with this?\"*\n\nAnother asked: *\"How can one who cultivates attain purity and stillness?\"*\nThe master replied: *\"A mind that does not chase after things is a peaceful mind. A mind that does not grasp at things is an empty mind. A mind that is both peaceful and empty is purity and stillness—this is the Dao.\"*\n\nSomeone asked: *\"Daoists often speak of the Golden Elixir. What is it?\"*\nThe master replied: *\"It is the original true nature. Because it is swift, sharp, bright, and transformative—melting and merging—it is called *gold*. Having undergone refinement, perfected and complete, indestructible for ten thousand kalpas, it is called *elixir*. Its essence is like empty space, radiant within and without, untouched by the slightest attachment, unstained by a single speck of dust, shining brilliantly in all directions. Thus, the ancestral masters said:*\n*‘The original true nature is called the Golden Elixir,*\n*Refined in the furnace of the four temporal states,*\n*Unstained, unthinking, free of delusion,*\n*It naturally rolls forth to the immortal’s altar.’*\n\n*Some in the world say the Golden Elixir is created through tangible forms and bound to emotions and desires. This is the view of hell-dwellers, the work of the licentious and perverse—deviating from the human path and entering the realm of beasts.\"*\n\nThe master continued: *\"In daily life, let the mind remain undivided in thought, the intent not wander outward. Release without dissipation, restrain without constraint. Illuminate the mind and recognize the Dharma, abandoning cunning and transcending emptiness. In the twelve hours of the day, let each thought be present—yet if you cling to the present, this is not the principle; if you depart from the present, there is no such place. Harmonize movement and stillness, know going and coming, let go of everything, free of entanglements and obstacles—this is the person of carefree ease. But all words fall short; you must discern for yourself.\"*\n\nSomeone asked: *\"I am old and cannot study much. I beg you to speak a single phrase on the most profound and wondrous truth.\"*\nThe master replied: *\"Let go of your seeking for the most profound and wondrous truth—then it is already so.\"*\n\nAnother asked: *\"What is the profound and wondrous?\"*\nThe master replied: *\"Who taught you to ask this?\"*\nThe person joined their hands and said: *\"I came up with the question myself.\"*\nThe master replied: *\"Then you already understand.\"*\nThe person laughed and bowed.\n\nSomeone asked: *\"It is said, ‘To know the One is to complete all things.’ It is also said, ‘Embrace the Origin and guard the One.’ What is this One?\"*",
      "overlap_context": "ound unclear, their karmic consciousness cannot attain non-action, for they lack merit and virtue. They should therefore engage in active practice within the teachings, cultivating according to their capacity, establishing deeds, welcoming those who come, maintaining humility, respecting teachers and friends, constantly practicing kindness, and eliminating selfishness and deceit. Over time, as familiarity deepens and progress is made day by day, there will naturally come a point of breakthrough.",
      "start_char": 12857,
      "end_char": 14093,
      "start_sentence": 437,
      "end_sentence": 484,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.66273617744446,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\修真十书盘山语录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "师云：乃是混成之性，无分别之时也。 既知有此，即堕於数，则不能一矣。 一便生二，二便生三，三生万，如何守得，不若和一也无。 故祖师云：抱元守一是工夫，地久天长一也无。 向这个一也无处，却明出自己本分来，却不无也。 故经云：知空不空，知色不色，名为照了。 师云：修行人常常心上无事，正正当当，每日时时刻刻体究自己本命元辰，端的处明白不昧，与虚空打作一团，如此才是道人底心也。 积日累功自有灵验，所以见种种作为，不如休歇体究自己去。 若一向物上用心，因循过日，却与俗心无异也。 师云：修行之人尘心顿歇，俗虑消忘，孤然显出自己本元真宗，便是从来先天底主人，自承当得逍遥自在。 种种法界，一时透彻。 若到此地，才要韬光晦迩，保护涵养之多则功多，若举意显扬，不觉暗损光明矣。 或问曰：如何是善恶？ 师云．．一切好心皆为善，一切不平心皆为恶。 人不知之善－为大善，人不知之恶为大恶。 善恶都不思处，别有向上在。 或问：若到清净无为处，是彻也未？ 师云：此以体言，似是而非也。 到於端的，则不可言，不可思，不可以知知，不可以识识。 妙绝无言，方始相应，不即动静，不离动静，岂可以无为清静而定之哉。 师云：夫为道者，抱朴含淳，潜通默运，除情去欲，损损存存，於物无私，作事明白，曲己从人，修仁蕴德，丝毫之过必除，细微之功必积，是非俱泯，心法两忘，向上之机自然达矣。 师云：学道人於万事不干处，诸尘不染处，与天地相通处，向这裹体究，彻则先天弗违后天而奉天时，天且不违，而况於人乎，况於鬼神乎。 或问：视听食息、手拈足行心思，此是性否？ 师云：道性不即此，是不离此，是动静语默，是性之用，非性之体。 体则非动非静、非语非默。 古人有言，大道要知宗祖，不离动静语默。 若认动静语默，便是认奴作主。 主能使奴，奴岂使主哉？ 一切抬手动足言语视听。 千状万态，及良久不动，皆是奴仆，非主人也。 主人堂上终不得明示外，然得其用使者，则自承当作主人矣。 师云：吾道密传，不可以有心求，不可以无心得，以不知而知，以无得而得。 世之或者以眼色求道、言语求道、威仪求道、法相求道，俱不得其大全。 殊不知道无踪迹，以迩求之，非道也。 复究此边自何而来，知其所来，则又非声色，非做造，非威仪，非法相者，存於中，盖．不可知知识识也。 只是这个本分圆成，真真实实，合天地、合圣贤、合鬼神、合万物。 如此一大事因绿，岂容尘垢声闻露迩而能见之哉？ 师云：向上师真所传要妙，行事之际密合天意，岂可执一端便为道哉？ 以迩观之，古人用处各各不同，妙本灵源未尝有异。 故人心之用，在目为见，在耳为闻，在口为言，在心为思，在手为拈，在足为行，使用不同，心体无别。 况今师密旨所谓教外别传，言思路绝，悟者自得，乃是真师密传之妙也。 或问：万形万状各各不同，怎生一体同观得？ 师云：天是道，地是道，万物皆是道。 彼亦是道，此亦是道，形像虽殊，并无不在，如何不同得？ 师云：无为者，天道也。 有为者。 人道也。 无为同天，有为同人，如人檐物，两头俱在则平稳，脱却一头即偏也，若两头俱脱去，和檐子也无，却到来本处。",
      "translated_text": "The master said: *\"This is the undifferentiated nature in its unbroken wholeness, the moment before distinctions arise. Once you know of its existence, you fall into calculation—and thus cannot be one with it. One gives rise to two, two to three, three to the myriad things. How can you guard it? Better to harmonize with the state where even ‘one’ does not exist. Thus, the ancestral master said: ‘To embrace the Origin and guard the One is the work of practice, but in the end, even ‘one’ is absent for eternity.’ In this place where even ‘one’ is absent, your own original nature becomes clear—yet it is not nothingness. As the sutra says: ‘To know emptiness as not empty, to know form as not form—this is called illumination.’\"*\n\nThe master said: *\"The cultivator should keep the mind constantly free of affairs, upright and centered, investigating at every moment the original destiny of the self. When the true place is clearly understood without obscurity, and you merge with the vastness of empty space—only then is this the heart of one who walks the Dao. Through accumulating days and piling up merit, spiritual verification will naturally arise. Thus, seeing all manner of activity, it is better to rest and investigate the self. If the mind is always fixed on external things, drifting through days in habit, it differs not from the mundane heart.\"*\n\nThe master said: *\"When the cultivator suddenly stills the dusty mind and forgets worldly concerns, the original true source of the self stands revealed alone—this is the primordial master who has always been. One naturally assumes the carefree ease of self-possession. All dharma realms are penetrated at once. If you reach this state, you must conceal your light and hide your traces. The more you protect and nurture it, the greater the merit. But if you intentionally display it, you unknowingly diminish its radiance.\"*\n\nSomeone asked: *\"What are good and evil?\"*\nThe master replied: *\"All kind intentions are good; all resentful thoughts are evil. The good that others do not know is the greatest good; the evil that others do not know is the greatest evil. Where neither good nor evil is contemplated, there lies something beyond.\"*\n\nSomeone asked: *\"When one reaches the state of purity and non-action, is this thorough realization?\"*\nThe master replied: *\"Spoken in terms of substance, this seems correct but is not. When you arrive at the true place, it cannot be spoken, cannot be thought, cannot be known by knowing, cannot be recognized by recognizing. Only when wonder ceases in wordlessness do you begin to correspond. It is neither attached to movement nor stillness, nor separate from them—how can it be defined as non-action or purity?\"*\n\nThe master said: *\"Those who walk the Dao embrace simplicity and contain purity, silently penetrating and subtly moving. They eliminate emotions and abandon desires, reducing and preserving, acting without self-interest, handling affairs with clarity. They yield to others and humble themselves, cultivating benevolence and accumulating virtue. Even the slightest fault must be removed; the most minute merit must be accumulated. Right and wrong are both dissolved; mind and dharma are both forgotten. Then the mechanism of the beyond naturally opens.\"*\n\nThe master said: *\"The cultivator investigates where all affairs are untouched, where all dusts are unstained, where one merges with heaven and earth. Penetrating this, the precelestial does not oppose the postcelestial but accords with the timing of heaven. If heaven does not oppose it, how much less do people, how much less do ghosts and spirits?\"*\n\nSomeone asked: *\"Are seeing, hearing, eating, breathing, grasping, walking, and thinking the nature?\"*\nThe master replied: *\"The Dao-nature is not identical with these, yet it does not depart from them. In movement and stillness, speech and silence, it is the function of nature—not the substance of nature. The substance is neither movement nor stillness, neither speech nor silence. The ancients said: ‘To know the great Dao, one must know its source, which does not leave movement and stillness, speech and silence.’ If you take movement and stillness, speech and silence as the nature, you mistake the servant for the master. The master commands the servant—how could the servant command the master? All raising of hands, moving of feet, speaking, seeing, hearing—thousands of forms and myriad postures, even long stillness—are all servants, not the master. The master in the hall cannot be clearly shown outside, yet when you grasp its function, you naturally assume the role of master.\"*\n\nThe master said: *\"My Dao is secretly transmitted. It cannot be sought with intention, nor attained without intention. It is known through not-knowing, attained through not-attaining. Some in the world seek the Dao through appearances, words, demeanor, or dharma forms—none grasp its wholeness. They do not realize the Dao leaves no traces. To seek it in the near is not the Dao. Investigate instead: from where does this nearness arise? Knowing its origin, you see it is neither sound nor form, neither fabrication nor demeanor, neither dharma form. It abides within—yet it cannot be known or recognized. It is simply this original completeness, truly real, uniting with heaven and earth, sages and spirits, the myriad things. Such a great matter—how could it be seen by those tainted with dust or those who reveal their traces?\"*\n\nThe master said: *\"The essential wonder transmitted by the true teachers of the beyond, when applied in action, secretly accords with the will of heaven. How can one cling to a single aspect and call it the Dao? Observing closely, the ancients’ methods differed, yet the wondrous source of their spirit was never distinct. Thus, the function of the human mind: in the eyes, it sees; in the ears, it hears; in the mouth, it speaks; in the mind, it thinks; in the hands, it grasps; in the feet, it walks. The uses differ, but the substance of the mind is not separate. How much more is this true of the master’s secret teaching—transmitted beyond words, where the paths of thought and speech are cut off. Only the awakened grasp it—this is the wondrous secret of the true teacher’s transmission.\"*\n\nSomeone asked: *\"All forms and shapes differ—how can they be seen as one?\"*\nThe master replied: *\"Heaven is the Dao, earth is the Dao, the myriad things are all the Dao. That is the Dao, this is the Dao—though forms differ, none are excluded. How can they not be one?\"*\n\nThe master said: *\"Non-action is the way of heaven; action is the way of humans. To be non-active is to be like heaven; to be active is to be like humans. Like a carrying pole—when both ends are balanced, it is steady. If one end is dropped, it tilts. If both ends are released, even the pole is gone, and you return to the original place.\"*",
      "overlap_context": "your seeking for the most profound and wondrous truth—then it is already so.\"*\n\nAnother asked: *\"What is the profound and wondrous?\"*\nThe master replied: *\"Who taught you to ask this?\"*\nThe person joined their hands and said: *\"I came up with the question myself.\"*\nThe master replied: *\"Then you already understand.\"*\nThe person laughed and bowed.\n\nSomeone asked: *\"It is said, ‘To know the One is to complete all things.’ It is also said, ‘Embrace the Origin and guard the One.’ What is this One?\"*",
      "start_char": 14093,
      "end_char": 15349,
      "start_sentence": 485,
      "end_sentence": 532,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.336671590805054,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\修真十书盘山语录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "师云：道无不在，头头皆是，色色皆真，惟在自己临时驱用，更别有甚么事。 奈人心尘绿障重，不解根源，摘叶寻枝，随波逐浪，回机者少，迷执者多。 纵有钻研，不求真实，纽捏造作，见鬼见神，头上安头，颠回倒顾，不悟幻身有限，光景难留，一息不来，如之何也？ 师云：修行人行藏任分，取舍随宜，低下为心，中正为则，审动静之源，节视听之用，一斩齐断，一念真常，永劫绵绵乃无变坏。 或问：修行之人，性命之事如何护持？ 师云：若在万尘万事境界裹面，来去缠缚，虽相应和，要自作得主不一向逐他去，事不碍心，心不碍事，如护眼睛，但有纤尘，合眼不受，如此保护，久久见功。 但心有受，却被他物引将去也，便作主不得。 或问日：如何是真常之道？ 师云：真常且置一壁，你向二六时中理会自己心地，看念虑生时是个甚么，念虑既生时是邪是正，邪念则便泯灭着，正念则当用着。 如何是邪念？ 凡无事时一切预先思虑，皆是邪妄。 如何是正念？ 目前有事合接物利生、敬上安众，种种善心不为己事，皆是正念也。 其静则体安，其动则用正，不纵不拘，无昼无夜，丝毫不昧，常应常静，平平稳稳，便是真常之道也。 或问：思无染着，放旷任绿，合道也未？ 师云：起心无着便是有着，有心无染亦着无染，才欲静定，已堕意根，纵任依他亦惑邪见，无染无着等是医药，无病药除，病去药存，终成药病。 言思路绝方始到家，罢问程途矣。 修真十书盘山语录卷之五十三竟",
      "translated_text": "The master said: *\"The Dao is present everywhere—everywhere is the Dao, every form is true. It depends only on how you apply it in the moment; what other matter could there be? Yet the dust of human minds is thick with obstructions. Not understanding the root, they pluck leaves and seek branches, drifting with the waves and chasing the currents. Few turn back in time; most remain lost in delusion. Even if they delve deeply, they do not seek what is real. Twisting and fabricating, they see ghosts and spirits, piling heads upon heads, turning backward and gazing in confusion. They do not awaken to the illusory, limited nature of the body, nor to how fleeting time is. When a single breath does not return—what then?\"*\n\nThe master said: *\"For one who cultivates the Way, conduct and retreat should follow one’s lot, acceptance and rejection should suit the moment. Humility is the heart; uprightness is the rule. Examine the source of movement and stillness, regulate the use of seeing and hearing. Cut off all at once, and with a single thought abide in true constancy—then through endless kalpas, there will be no decay or ruin.\"*\n\nSomeone asked: *\"How should one who cultivates the Way protect and sustain the matters of nature and life?\"*\nThe master replied: *\"Amid the ten thousand dusts and ten thousand affairs, though entangled and bound, even if you harmonize with them, you must still maintain mastery and not be swept away. Let affairs not obstruct the mind, nor the mind obstruct affairs. Guard it like the eye—if even the finest speck of dust approaches, close it and refuse to receive. Protect it thus, and over time, merit will appear. But if the mind receives anything, it will be led away by external things, and you will lose mastery.\"*\n\nSomeone asked: *\"What is the Dao of true constancy?\"*\nThe master replied: *\"Set aside ‘true constancy’ for now. Throughout the twelve hours of the day, examine your own mind-ground. When thoughts and concerns arise, what are they? When they have arisen, are they deluded or upright? If deluded, extinguish them at once. If upright, employ them rightly. What is delusion? All preemptive thinking when there is no matter at hand—this is false and illusory. What is uprightness? When there is a matter before you—receiving things, benefiting beings, respecting superiors, pacifying the multitude—all good intentions not for one’s own sake—these are upright thoughts. In stillness, the body is at peace; in activity, the function is correct. Neither indulgent nor restrained, neither day nor night, not the slightest obscurity—constantly responsive, constantly still, level and steady—this is the Dao of true constancy.\"*\n\nSomeone asked: *\"Is freedom from defilement and attachment, unrestrained spontaneity, in accord with the Dao?\"*\nThe master replied: *\"To intend freedom from attachment is already attachment. To intend freedom from defilement is still attachment to non-defilement. As soon as you seek stillness and concentration, you fall into the root of intention. To indulge or rely on others is to be deluded by false views. Non-defilement and non-attachment are but medicine. When there is no illness, remove the medicine. If the illness departs but the medicine remains, it becomes a medicinal illness. Only when the paths of thought and speech are cut off do you arrive home. Cease asking about the journey.\"*\n\n*End of Volume Fifty-Three of the* Pan Shan Record *from the* Ten Books on Cultivating the Real.",
      "overlap_context": "Dao, earth is the Dao, the myriad things are all the Dao. That is the Dao, this is the Dao—though forms differ, none are excluded. How can they not be one?\"*\n\nThe master said: *\"Non-action is the way of heaven; action is the way of humans. To be non-active is to be like heaven; to be active is to be like humans. Like a carrying pole—when both ends are balanced, it is steady. If one end is dropped, it tilts. If both ends are released, even the pole is gone, and you return to the original place.\"*",
      "start_char": 15350,
      "end_char": 15936,
      "start_sentence": 533,
      "end_sentence": 550,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.994553804397583,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\修真十书盘山语录.txt",
        "category": "方法类"
      }
    }
  ]
}