{
  "source_id": "元始天尊说药王救八十一难真经",
  "source_file": "chunked_daozang\\元始天尊说药王救八十一难真经.json",
  "total_chunks": 3,
  "total_original_chars": 2570,
  "total_translated_chars": 16212,
  "total_translation_time": 67.60203528404236,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏续道藏\\元始天尊说药王救八十一难真经.txt",
    "category": "正统道藏续道藏"
  },
  "full_translation": "**The Supreme Venerable Sovereign’s Scripture on the Medicine King Saving from Eighty-One Calamities**\n\n**Scripture Title:** *The Supreme Venerable Sovereign’s Scripture on the Medicine King Saving from Eighty-One Calamities*\n*Author unknown; likely composed during the Song or Yuan dynasties. One fascicle.*\n*Source of base text: Wanli Continuation of the Daoist Canon.*\n\n---\n\nAt that time, the Supreme Venerable Sovereign was in the Eight Radiant Heavens of the Great Brahma Heaven, where he summoned the myriad perfected immortals of the ten directions and three realms, along with an innumerable host of sages, to expound the wondrous and most true Dharma for delivering beings without limit.\n\nFrom the assembly, a perfected one named Deliverer from Suffering stepped forward, holding a tablet and kneeling reverently. He addressed the Heavenly Worthy, saying: \"I have heard that in the high antiquity, people seldom fell ill and lived for a thousand years. Yet in this present age, multitudes suffer calamities, their years cut short. What is the cause of this? I humbly beseech the Heavenly Worthy, the Great Sage, to expound the reason for the assembly, that we may hear the supreme Dao.\"\n\nThe Heavenly Worthy replied: \"You, Deliverer from Suffering, have asked on behalf of sentient beings about this cause. I shall now explain it to you—listen carefully.\n\nIn high antiquity, people revered the great Dao and cultivated the root of their nature. They did not kill or harm, neither envied nor resented, neither desired nor coveted, neither indulged in lust nor stole. Their words were free of deceit, their speech void of malice. They made no distinctions between self and others, nor contended with things. Their natures were pure and simple, their forms and essences firmly preserved. Thus, they knew no disasters, and their lifespans extended, reaching a hundred, a thousand, or even more years.\n\nIn recent ages, beings have shown no reverence for Heaven and Earth, nor awe for the divine. Their hearts breed envy, their minds give rise to greed and wrath. They kill and harm life, benefit themselves at others’ expense. They use large measures for taking and small for giving, deceiving the ignorant. Their mouths spew slander and double-tongued words, adorned with false and deceptive speech. They bully the weak with their strength, oppress the poor with their wealth. They defile the good and harm the virtuous. With a thousand transgressions and ten thousand faults, retribution swiftly follows.\n\nThus, Heaven dispatches the Five Pestilence Envoys and the officers and soldiers of disease to descend with calamities, scattering afflictions. Some suffer wind-stroke, some cold damage, some epidemics, some diarrhea, some dysentery, some fiery eyes, some malignant sores—all manner of illnesses. Their minds grow confused, their bodies restless. They lie bedridden, seeking remedies in vain. The mild recover in ten days; the severe may languish for months. When transgressions accumulate beyond measure, they endure year after year, their illnesses lingering without cure, until they perish. Those not yet fifty, in the prime of life, meet untimely deaths—all due to the causes of unwholesomeness, leading to such outcomes.\"\n\nThe perfected one again addressed the Heavenly Worthy: \"You have opened your compassion to enlighten the ignorant. Yet the beings of this desire realm, unaware of prohibitions, commit offenses and cannot escape the net of law. When calamities descend, or even when they meet with demonic deaths, by what means may they be saved? I humbly implore the Heavenly Worthy, in your great mercy, to bestow the virtue of cherishing life, to widely open the gate of salvation, and to take pity on the benighted, sparing them from disasters.\"\n\nThereupon, the Heavenly Worthy further instructed the perfected one: \"These calamities cannot be saved without medicine, nor cured without healing. In ancient times, there was a divine physician of Qin, renowned as the state’s healer. He thoroughly understood medicine and deeply grasped the principles of the pulse. Known as the Divine Responding King Bian Que, he accumulated boundless merit through his service to the spirits. By imperial decree, he was enfeoffed as the Numinous Responding Medicine King.\n\nThis true lord’s profound silence penetrates Heaven and Earth; his wondrous efficacy moves ghosts and spirits. He universally saves the multitudes, his name known throughout the world. He possesses the *True Scripture for Saving from Eighty-One Calamities*, which should be transmitted to the world. Those who circulate, read, and recite it may avoid afflictions.\n\nIf there are good men and believing women who request this true scripture, sincerely enshrine it, and reverently make offerings, they shall forever remain free from disasters and suffer few illnesses in their lifetimes. Should they encounter a day of calamity, they may establish a ritual arena in a quiet place, purify and prepare incense, flowers, lamps, and candles, and invite Daoist priests—or recite the *Scripture for Saving from Calamities* themselves—three, five, or even dozens or hundreds of times. Thereby, they will move the Numinous Responding True Lord to silently bestow divine elixirs and wondrous medicines. In dreams, they may receive acupuncture and moxibustion treatments, and their illnesses will vanish, their misfortunes be washed away. Their bodies will become light and healthy, their forms restored to normal. For all who suffer calamities, they should urgently burn incense and recite the scripture, and peace will come within days.\"\n\nThen follows the verification of the Numinous Responding True Lord’s salvation from eighty-one calamities:\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from wind, cold, summerheat, and dampness calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from mountain miasma and pestilential qi calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from human wind and paralysis calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from wind-stroke and loss of speech calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from cold damage and common cold calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from seasonal epidemic calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from yang toxin and eruptive rash calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from lingering malaria calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from dysentery and abdominal pain calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from unceasing diarrhea calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from cholera with vomiting and diarrhea calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from vomiting and retching calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from large intestine constipation calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from urinary blockage calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from five taxations and seven injuries calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from coughing and consumptive depletion calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from consumptive and corpse-like consumption calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from food stagnation and fluid retention calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from all qi blockage and obstruction calamities.\"\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from accumulations and masses with fullness and oppression calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from water swelling and drum-like distension calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from belching and dyspeptic discomfort calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from regurgitation and food reversal calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from esophageal obstruction and blockage calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from nine types of heart pain calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from colicky intestinal and abdominal pain calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from headache and vertigo calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from lumbar and hypochondriac pain calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from phlegm-rheum and phlegm syncope calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from panting distension and wheezing calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from night sweats and seminal emission calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from five types of strangury and turbid urine calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from jaundice and black jaundice calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from impediment qi and leg atrophy calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from malevolent spirits and manic madness calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from fright palpitations and fearful throbbing calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from small intestine cold mounting calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from vomiting blood and nosebleed calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from intestinal afflux and hemorrhoid-fistula calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from glomus lumps and abdominal masses calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from numbness in hands and feet calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from deafness and hearing loss calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from eye pain and visual impairment calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from toothache calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from breast abscess and throat impediment calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from loss of voice and speechlessness calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from bloody urine and bloody stool calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from malignant sores and clove sores calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from carbuncles on the back calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from scrofula and toxic swellings calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from bone-adhering abscesses calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from scabies, favus, sores, and ringworm calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from chronic sores on the shank calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from sinew and bone pain calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from tetanus from wounds calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from knife and axe injuries calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from falls and traumatic injuries calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from scalding and burning calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from accidental swallowing of copper and iron calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from accidental swallowing of needles calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from accidental poisoning by gu calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from accidental food poisoning calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from accidental medicinal poisoning calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from all women’s diseases calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from menstrual blockage calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from red and white vaginal discharge calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from antepartum and postpartum calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from difficult birth and breech presentation calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from retained placenta calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from flooding and spotting calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from breast abscess and obstructed lactation calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from childhood wind epilepsy calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from double tongue and wooden tongue calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from acute and chronic fright wind calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from pox and black dimples calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from pox sores and ulceration calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from gan-illness and glomus lumps calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from unceasing vomiting and diarrhea calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from noma calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from prolapsed rectum calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from all illnesses and diseases calamities.\n\nThus, the Perfected Lord, wondrously numinous and penetrating,\nIs the supreme sage among physicians, the supreme spirit among medicines.\nFrom the Primordial Beginning’s ancestral qi, qi is divided and bodies are divided,\nOne qi divides into three, three qi unite in form.\nThree threes make nine, nine nines regenerate,\nEighty-one qi unite with the Dao in truth.\nWith this as his vow, he vows to save the world’s people,\nAbove, to heal the nation’s destiny; below, to succor the living.\nTo treat the sick and ailing, universally save the multitude of beings.\nIf there are those who invoke him, holding to recitation with sincerity,\nDisasters and calamities will be eliminated, and peace and tranquility forever preserved.\n\nThe Heavenly Worthy concluded the sutra and returned to Jade Purity.\nShould one read and recite this sutra, offering water and presenting flowers,\nIts efficacy will be swift and responsive.\nWith this sutra in the home, the household will be peaceful.\nWearing this sutra, no disasters will arise.\nTo treat it with irreverence and contempt will bring misfortune upon oneself.\n\nThereupon, the Perfected Lord of Salvation from Suffering and all the perfected immortals,\nThe sacred assembly of the ten directions, having heard this sutra,\nWere all greatly joyful, believing, receiving, and practicing it.\n\nThe Heavenly Worthy of Primordial Beginning concluded *The Numinous Responding Medicine King’s Sutra of Salvation from Eighty-One Calamities*.\n\n[1] The character \"身\" here appears to be superfluous.\n[2] There may be an omission at this point.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "元始天尊说药王救八十一难经 经名：元始天尊说药王救八十一难经。 撰人不详，似出於宋元以复。 一卷。 底本出处：《万历续道藏》。 元始天尊说药王救八十一难经 尔时，元始天尊在大罗天上八景天中，召集十方三界万亿真仙，无鞅圣众，说无量度人至真妙法。 时於会中，有一真人，名曰救苦，越班而出，执简长跪，上白天尊曰：伏闻上古人民，少染疾病，寿延千岁。 今时世人，多生患难，天促年龄，是何因缘，惟愿天尊大圣，为众演说，得闻至道。 天尊告曰：汝等救苦，能为众生问其因缘，吾当为说，汝等谛听。 夫上古之人，遵崇大道，修省本源。 不杀不害，不嫉不妬，不欲不贪，不淫不盗，言无诳妄，口无恶声，不分人我，不与物争。 体性淳朴，形质固守，故无灾难，遂得寿命延长，享及百千余岁。 近世众生，不敬天地，不惧神明。 心生嫉妬，意起贪嗔。 杀生害命，利己损人。 大斗小秤，瞒昧愚民。 恶口两舌，绮言诳语。 倚强波弱，伏富吞贫。 淫污良善，损害好人。 万过千愆，果报速生。 以致上天遣差五瘟使者，行病吏兵，降下灾殃，散与病患。 或中风，或伤寒，或瘟疫，或泄泻，或痢疾，或火眼，或恶疮，诸般病症，使身心身#1恍惚，形体不宁，卧枕着床，无所求效。 轻者旬日痊疴，重者个月□痾。 至於过愆满盈，经年累月，缠绵不愈，以及丧命陨身。 年未半百，少壮夭亡，皆是不善之因，以致如斯。 真人再告天尊曰：特开慈悯，开示愚蒙。 凡今欲界众生，不知禁戒，有犯罪愆难逃宪网，遣降患难，或至妖亡，何由救免？ 伏望天尊大慈，普施好生之德，广开救济之门，矜怜愚昧，免遭灾难。 於是，天尊重告真人曰：此难匪医不救，匪医不疗。 昔有秦神，时为国医，源洞晓医，深明脉理，号称神应王扁鹊，为神最罪#2，积功无量，勑封灵应药王。 真君玄默通乎天地，妙用动乎鬼神，普济群生，名传天下。 有《救八十一难真经》，当传世人，流通看诵，可免患难。 若有善男信女，请此真经，至诚安奉，虔心供养，即得永世无灾，平生少病。 如遇有灾之日，即於静处建立道场，洁备香花灯烛，请命道士，或自持念《救难真经》三过五过乃至数十百过，致感灵应真君默送灵丹妙药，梦寐针炙调治，遂得疾病消除，灾厄洗涤，身躯轻健，形体如常。 凡有患难，急当焚香诵经，指日平安。 於是说灵应真君救八十一难应验曰： 灵应药王扁鹊君，能救风寒暑湿难。 灵应药王扁鹊君，能救山岚瘴气难。 灵应药王扁鹊君，能救人风瘫痪难。 灵应药王扁鹊君，能救中风不语难。 灵应药王扁鹊君，能救感冒伤寒难。 灵应药王扁鹊君，能救天行瘟疫难。 灵应药王扁鹊君，能救阳毒班疹难。 灵应药王扁鹊君，能救疟疾缠绵难。 灵应药王扁鹊君，能救痢疾腹痛难。 灵应药王扁鹊君，能救泄泻不止难。 灵应药王扁鹊君，能救霍乱吐泻难。 灵应药王扁鹊君，能救呕吐恶哕难。 灵应药王扁鹊君，能救大肠秘结难。 灵应药王扁鹊君，能救小便不通难。 灵应药王扁鹊君，能救五劳七伤难。 灵应药王扁鹊君，能救咳嗽虚损难。 灵应药王扁鹊君，能救痨瘵尸痨难。 灵应药王扁鹊君，能救伤食停饮难。 灵应药王扁鹊君，能救诸气闭塞难。",
      "translated_text": "**The Supreme Venerable Sovereign’s Scripture on the Medicine King Saving from Eighty-One Calamities**\n\n**Scripture Title:** *The Supreme Venerable Sovereign’s Scripture on the Medicine King Saving from Eighty-One Calamities*\n*Author unknown; likely composed during the Song or Yuan dynasties. One fascicle.*\n*Source of base text: Wanli Continuation of the Daoist Canon.*\n\n---\n\nAt that time, the Supreme Venerable Sovereign was in the Eight Radiant Heavens of the Great Brahma Heaven, where he summoned the myriad perfected immortals of the ten directions and three realms, along with an innumerable host of sages, to expound the wondrous and most true Dharma for delivering beings without limit.\n\nFrom the assembly, a perfected one named Deliverer from Suffering stepped forward, holding a tablet and kneeling reverently. He addressed the Heavenly Worthy, saying: \"I have heard that in the high antiquity, people seldom fell ill and lived for a thousand years. Yet in this present age, multitudes suffer calamities, their years cut short. What is the cause of this? I humbly beseech the Heavenly Worthy, the Great Sage, to expound the reason for the assembly, that we may hear the supreme Dao.\"\n\nThe Heavenly Worthy replied: \"You, Deliverer from Suffering, have asked on behalf of sentient beings about this cause. I shall now explain it to you—listen carefully.\n\nIn high antiquity, people revered the great Dao and cultivated the root of their nature. They did not kill or harm, neither envied nor resented, neither desired nor coveted, neither indulged in lust nor stole. Their words were free of deceit, their speech void of malice. They made no distinctions between self and others, nor contended with things. Their natures were pure and simple, their forms and essences firmly preserved. Thus, they knew no disasters, and their lifespans extended, reaching a hundred, a thousand, or even more years.\n\nIn recent ages, beings have shown no reverence for Heaven and Earth, nor awe for the divine. Their hearts breed envy, their minds give rise to greed and wrath. They kill and harm life, benefit themselves at others’ expense. They use large measures for taking and small for giving, deceiving the ignorant. Their mouths spew slander and double-tongued words, adorned with false and deceptive speech. They bully the weak with their strength, oppress the poor with their wealth. They defile the good and harm the virtuous. With a thousand transgressions and ten thousand faults, retribution swiftly follows.\n\nThus, Heaven dispatches the Five Pestilence Envoys and the officers and soldiers of disease to descend with calamities, scattering afflictions. Some suffer wind-stroke, some cold damage, some epidemics, some diarrhea, some dysentery, some fiery eyes, some malignant sores—all manner of illnesses. Their minds grow confused, their bodies restless. They lie bedridden, seeking remedies in vain. The mild recover in ten days; the severe may languish for months. When transgressions accumulate beyond measure, they endure year after year, their illnesses lingering without cure, until they perish. Those not yet fifty, in the prime of life, meet untimely deaths—all due to the causes of unwholesomeness, leading to such outcomes.\"\n\nThe perfected one again addressed the Heavenly Worthy: \"You have opened your compassion to enlighten the ignorant. Yet the beings of this desire realm, unaware of prohibitions, commit offenses and cannot escape the net of law. When calamities descend, or even when they meet with demonic deaths, by what means may they be saved? I humbly implore the Heavenly Worthy, in your great mercy, to bestow the virtue of cherishing life, to widely open the gate of salvation, and to take pity on the benighted, sparing them from disasters.\"\n\nThereupon, the Heavenly Worthy further instructed the perfected one: \"These calamities cannot be saved without medicine, nor cured without healing. In ancient times, there was a divine physician of Qin, renowned as the state’s healer. He thoroughly understood medicine and deeply grasped the principles of the pulse. Known as the Divine Responding King Bian Que, he accumulated boundless merit through his service to the spirits. By imperial decree, he was enfeoffed as the Numinous Responding Medicine King.\n\nThis true lord’s profound silence penetrates Heaven and Earth; his wondrous efficacy moves ghosts and spirits. He universally saves the multitudes, his name known throughout the world. He possesses the *True Scripture for Saving from Eighty-One Calamities*, which should be transmitted to the world. Those who circulate, read, and recite it may avoid afflictions.\n\nIf there are good men and believing women who request this true scripture, sincerely enshrine it, and reverently make offerings, they shall forever remain free from disasters and suffer few illnesses in their lifetimes. Should they encounter a day of calamity, they may establish a ritual arena in a quiet place, purify and prepare incense, flowers, lamps, and candles, and invite Daoist priests—or recite the *Scripture for Saving from Calamities* themselves—three, five, or even dozens or hundreds of times. Thereby, they will move the Numinous Responding True Lord to silently bestow divine elixirs and wondrous medicines. In dreams, they may receive acupuncture and moxibustion treatments, and their illnesses will vanish, their misfortunes be washed away. Their bodies will become light and healthy, their forms restored to normal. For all who suffer calamities, they should urgently burn incense and recite the scripture, and peace will come within days.\"\n\nThen follows the verification of the Numinous Responding True Lord’s salvation from eighty-one calamities:\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from wind, cold, summerheat, and dampness calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from mountain miasma and pestilential qi calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from human wind and paralysis calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from wind-stroke and loss of speech calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from cold damage and common cold calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from seasonal epidemic calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from yang toxin and eruptive rash calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from lingering malaria calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from dysentery and abdominal pain calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from unceasing diarrhea calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from cholera with vomiting and diarrhea calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from vomiting and retching calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from large intestine constipation calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from urinary blockage calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from five taxations and seven injuries calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from coughing and consumptive depletion calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from consumptive and corpse-like consumption calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from food stagnation and fluid retention calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from all qi blockage and obstruction calamities.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1286,
      "start_sentence": 0,
      "end_sentence": 55,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.158287048339844,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\元始天尊说药王救八十一难真经.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "灵应药王扁鹊君，能救积聚痞满难。 灵应药王扁鹊君，能救水肿鼓胀难。 灵应药王扁鹊君，能救嗳气嘈杂难。 灵应药王扁鹊君，能救翻胃倒食难。 灵应药王扁鹊君，能救膈噎不通难。 灵应药王扁鹊君，能救九种心疼难。 灵应药王扁鹊君，能救绞肠腹痛难。 灵应药王扁鹊君，能救头疼眩晕难。 灵应药王扁鹊君，能救腰胁疼痛难。 灵应药王扁鹊君，能救痰饮痰厥难。 灵应药王扁鹊君，能救喘胀哮齁难。 灵应药王扁鹊君，能救盗汗遗精难。 灵应药王扁鹊君，能救五淋白浊难。 灵应药王扁鹊君，能救黄疸黑疸难。 灵应药王扁鹊君，能救痹气脚痿难。 灵应药王扁鹊君，能救邪祟颠狂难。 灵应药王扁鹊君，能救惊悸怔仲难。 灵应药王扁鹊君，能救小肠寒疝难。 灵应药王扁鹊君，能救吐血血难。 灵应药王扁鹊君，能救肠辟痔瘘难。 灵应药王扁鹊君，能救痞块症瘕难。 灵应药王扁鹊君，能救手足麻木难。 灵应药王扁鹊君，能救耳聋不听难。 灵应药王扁鹊君，能救眼疼不明难。 灵应药王扁鹊君，能救牙齿疼痛难。 灵应药王扁鹊君，能救乳鹅喉痹难。 灵应药王扁鹊君，能救失音不语难。 灵应药王扁鹊君，能救尿血便血难。 灵应药王扁鹊君，能救恶疮疔肿难。 灵应药王扁鹊君，能救发背恶疮难。 灵应药王扁鹊君，能救疗疬肿毒难。 灵应药王扁鹊君，能救附骨廱疽难。 灵应药王扁鹊君，能救疥癞疮癣难。 灵应药王扁鹊君，能救臁腿顽疮难。 灵应药王扁鹊君，能救觔骨疼痛难。 灵应药王扁鹊君，能救破伤生风难。 灵应药王扁鹊君，能救刀斧规伤难。 灵应药王扁鹊君，能救跌扑损伤难。 灵应药王扁鹊君，能救汤火炀烧难。 灵应药王扁鹊君，能救误吞铜铁难。 灵应药王扁鹊君，能救误吞针刺难。 灵应药王扁鹊君，能救误中蛊毒难。 灵应药王扁鹊君，能救误吃食毒难。 灵应药王扁鹊君，能救误服药毒难。 灵应药王扁鹊君，能救妇人诸病难。 灵应药王扁鹊君，能救月闭不通难。 灵应药王扁鹊君，能救赤白带下难。 灵应药王扁鹊君，能救胎前产后难。 灵应药王扁鹊君，能救难产逆生难。 灵应药王扁鹊君，能救胎衣不下难。 灵应药王扁鹊君，能救血崩恶漏难。 灵应药王扁鹊君，能救吹乳膈乳难。 灵应药王扁鹊君，能救小儿风痫难。 灵应药王扁鹊君，能救重舌木舌难。 灵应药王扁鹊君，能救急慢惊风难。 灵应药王扁鹊君，能救痘疹黑靥难。 灵应药王扁鹊君，能救痘疔溃烂难。 灵应药王扁鹊君，能救疳疾痞块难。 灵应药王扁鹊君，能救吐泻不止难。 灵应药王扁鹊君，能救走马牙疳难。 灵应药王扁鹊君，能救脱肛不收难。 灵应药王扁鹊君，能救一切疾病难。 於是真君，玄妙通灵，医中至圣，药中至神。 元始祖炁，分炁分身，一炁分三，三炁合形。 三三九数，九九复生，八十一炁，与道合真。 以此为愿，愿救世人，上医国祚，下拯生民，治疗病患，普救群生。 若有告者，持诵虔诚，消灾消难，永保安宁。 天尊说经已毕，还於玉清。 若人看诵此经者，能酌水献花，其验速应。 家有此经，人口安宁。 佩带此经，灾难不生。 亵渎轻慢，反殃其身。 於是救苦真人及诸真仙，十方圣众，闻说此经，皆大欢喜，信受奉行。 元始天尊说灵应药王救八十一难真经竟",
      "translated_text": "The Numinous Responding Medicine King, Lord Bian Que,\nCan save from accumulations and masses with fullness and oppression calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from water swelling and drum-like distension calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from belching and dyspeptic discomfort calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from regurgitation and food reversal calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from esophageal obstruction and blockage calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from nine types of heart pain calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from colicky intestinal and abdominal pain calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from headache and vertigo calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from lumbar and hypochondriac pain calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from phlegm-rheum and phlegm syncope calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from panting distension and wheezing calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from night sweats and seminal emission calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from five types of strangury and turbid urine calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from jaundice and black jaundice calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from impediment qi and leg atrophy calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from malevolent spirits and manic madness calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from fright palpitations and fearful throbbing calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from small intestine cold mounting calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from vomiting blood and nosebleed calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from intestinal afflux and hemorrhoid-fistula calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from glomus lumps and abdominal masses calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from numbness in hands and feet calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from deafness and hearing loss calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from eye pain and visual impairment calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from toothache calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from breast abscess and throat impediment calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from loss of voice and speechlessness calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from bloody urine and bloody stool calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from malignant sores and clove sores calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from carbuncles on the back calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from scrofula and toxic swellings calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from bone-adhering abscesses calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from scabies, favus, sores, and ringworm calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from chronic sores on the shank calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from sinew and bone pain calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from tetanus from wounds calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from knife and axe injuries calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from falls and traumatic injuries calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from scalding and burning calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from accidental swallowing of copper and iron calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from accidental swallowing of needles calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from accidental poisoning by gu calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from accidental food poisoning calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from accidental medicinal poisoning calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from all women’s diseases calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from menstrual blockage calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from red and white vaginal discharge calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from antepartum and postpartum calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from difficult birth and breech presentation calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from retained placenta calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from flooding and spotting calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from breast abscess and obstructed lactation calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from childhood wind epilepsy calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from double tongue and wooden tongue calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from acute and chronic fright wind calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from pox and black dimples calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from pox sores and ulceration calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from gan-illness and glomus lumps calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from unceasing vomiting and diarrhea calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from noma calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from prolapsed rectum calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from all illnesses and diseases calamities.\n\nThus, the Perfected Lord, wondrously numinous and penetrating,\nIs the supreme sage among physicians, the supreme spirit among medicines.\nFrom the Primordial Beginning’s ancestral qi, qi is divided and bodies are divided,\nOne qi divides into three, three qi unite in form.\nThree threes make nine, nine nines regenerate,\nEighty-one qi unite with the Dao in truth.\nWith this as his vow, he vows to save the world’s people,\nAbove, to heal the nation’s destiny; below, to succor the living.\nTo treat the sick and ailing, universally save the multitude of beings.\nIf there are those who invoke him, holding to recitation with sincerity,\nDisasters and calamities will be eliminated, and peace and tranquility forever preserved.\n\nThe Heavenly Worthy concluded the sutra and returned to Jade Purity.\nShould one read and recite this sutra, offering water and presenting flowers,\nIts efficacy will be swift and responsive.\nWith this sutra in the home, the household will be peaceful.\nWearing this sutra, no disasters will arise.\nTo treat it with irreverence and contempt will bring misfortune upon oneself.\n\nThereupon, the Perfected Lord of Salvation from Suffering and all the perfected immortals,\nThe sacred assembly of the ten directions, having heard this sutra,\nWere all greatly joyful, believing, receiving, and practicing it.\n\nThe Heavenly Worthy of Primordial Beginning concluded *The Numinous Responding Medicine King’s Sutra of Salvation from Eighty-One Calamities*.",
      "overlap_context": "s and seven injuries calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from coughing and consumptive depletion calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from consumptive and corpse-like consumption calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from food stagnation and fluid retention calamities.\n\nThe Numinous Responding Medicine King, Lord Bian Que,\nCan save from all qi blockage and obstruction calamities.\"",
      "start_char": 1287,
      "end_char": 2693,
      "start_sentence": 56,
      "end_sentence": 129,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.092684030532837,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\元始天尊说药王救八十一难真经.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "#1此『身』字疑衍。 #2此处疑有脱漏。",
      "translated_text": "[1] The character \"身\" here appears to be superfluous.\n[2] There may be an omission at this point.",
      "overlap_context": "aceful.\nWearing this sutra, no disasters will arise.\nTo treat it with irreverence and contempt will bring misfortune upon oneself.\n\nThereupon, the Perfected Lord of Salvation from Suffering and all the perfected immortals,\nThe sacred assembly of the ten directions, having heard this sutra,\nWere all greatly joyful, believing, receiving, and practicing it.\n\nThe Heavenly Worthy of Primordial Beginning concluded *The Numinous Responding Medicine King’s Sutra of Salvation from Eighty-One Calamities*.",
      "start_char": 2693,
      "end_char": 2717,
      "start_sentence": 130,
      "end_sentence": 131,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.3510642051696777,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\元始天尊说药王救八十一难真经.txt",
        "category": "正统道藏续道藏"
      }
    }
  ]
}