{
  "source_id": "元阳子金液集",
  "source_file": "chunked_daozang\\元阳子金液集.json",
  "total_chunks": 6,
  "total_original_chars": 5422,
  "total_translated_chars": 29874,
  "total_translation_time": 144.25776553153992,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\方法类\\元阳子金液集.txt",
    "category": "方法类"
  },
  "full_translation": "*The Collected Writings on the Golden Elixir of Master Yuanyang*\n\n**Title:** *The Collected Writings on the Golden Elixir of Master Yuanyang*\n**Author:** Master Yuanyang, the Daoist alchemist Yang Shenwei of the mid-to-late Tang dynasty. The collection contains thirty-one poems on the Golden Elixir and the Reverted Cinnabar, each with annotations by an unknown commentator. It expounds the Way of external alchemy.\n**Volume:** One.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* section, *Methods* category.\n\n---\n\nTrue yin and true yang are the true Dao,\nYet they lie before your eyes—why seek them afar?\nThe common crowd year after year burns and refines the Reverted Cinnabar,\nAnd when they glimpse blue or yellow, they claim their elixir is fine.\n\n**True yin** refers to the north’s *ren* and *gui* waters, the origin of the Five Phases. The Lord of Yin states: \"The true qi of the north becomes the River Chariot; the east’s *jia* and *yi* generate golden sand.\" This single substance is the root of the Five Phases. The oral formula says: \"In the north there is water; within the water lies metal. When the metal first takes form, it is called the metal of *geng* and *xin*, and its trigram belongs to *Kan*.\"\n\n**True yang** is the Fire Star of the south. Born from *jia* and *yi*, it resides in *bing* and *ding*. The Fire Driller could kindle its light, transforming the raw into the cooked—this is called the essence of the Great Yang, and its trigram belongs to *Li*, containing cinnabar and mercury. The people of this age cannot comprehend it. Failing to grasp its principle, they take miscellaneous substances—even cinnabar and mercury—and refine them into a supreme medicine. When they suddenly see blue or yellow hues, they declare their elixir excellent.\n\nA person of resolve must adhere to the method and model,\nLest they waste their spirit and mind—strive to perceive the Dao.\nIf only they knew to seek the true Yellow Sprout,\nOne who partakes of it shall live without aging.\n\n**Annotation:** A person of resolve must understand the rules and follow them, for these rules are the mechanism of Heaven and Earth. The movement of the celestial patterns, the progression and retreat of the fire times—all must align like linked pearls or joined jades, now gathering, now dispersing, flowing in and out, threading through inner and outer, perfectly attuned without the slightest error. Timing the measurements precisely yields the supreme medicine. As the ancient formula says: \"Failure lies in withdrawal and addition; success lies in receiving the radiance.\"\n\nWhen the supreme treasure is attained, it is called the true Yellow Sprout. It is not crafted from several substances but is formed from the essence of Heaven and Earth, the subtle and wondrous qi congealed. Few can comprehend this, hence the admonition: \"Lest they waste their spirit and mind—strive to perceive the Dao.\" The Yellow Sprout is not the same as worldly lead; vain effort and toil yield no result. Wasted time turns hair white—where then to seek the leisurely Red Pine?\n\nThe Yellow Sprout is not the black lead or yellow cinnabar of the world, refined through burning. It emerges from within the Great Yang, born of emptiness and nothingness, returning to the Central Palace, the position of the Yellow Emperor. As the *Daodejing* says: \"Its form is like dust on a bright window.\" Thus, it is not a thing possessed by common households; only Huainanzi and Red Pine knew of it. Red Pine is none other than the Prince of Huainan. The formula states: \"The Prince of Huainan refined autumn stone, summoned the Yellow Emperor, and praised the golden flower—there is no other Way.\" If a person of resolve does not know this true formula, they will vainly spend their life with white hair.\n\nTherefore, one must receive it from a master of the body, for the master is the oral formula. The divine water and flowery pond are rare in the world, their transmission forbidden to the vulgar. Yet they are likened to worldly lead and mercury to prevent doubt. The divine water and flowery pond emerge from within the Great Yang, the essence of fire, gathered and used by immortals, called divine water and flowery pond. Its essence congeals white, like horse-tooth niter, before being subdued by fire. After refinement, it is called the golden liquid flowery pond, named true lead, also called White Tiger. Once refined, mercury loses its black color.\n\nIf one wishes to halt the fire, the response lies within a foot’s reach. This is an oral formula, difficult to transmit in writing. Immortals take black lead and mercury, extracting a divine talisman resembling white snow, to prevent doubt. But using black lead and mercury is not the true method. Even if one encounters a perfected person and follows them all day, if their nature does not align with the supreme Way, the secret formula of defense will never be transmitted. It is only that the person’s root nature does not harmonize with the supreme Way. Yet the sages do not wish to sever its transmission for later generations, so only one person is passed it every three or two hundred years.\n\nThose who study the Way must broadly cultivate hidden virtue, revering their Daoist master as they would their parents, unwavering from beginning to end, sparing no effort. Only then may they receive transmission. As the *Cantong Qi* says: \"To have only the name of loving the Way without the resolve to refine the elixir, to harbor great resentment over minor faults—such a person is far from the Dao.\"\n\nThe Green Dragon pursues the Tiger, the Tiger follows the Dragon; the Red Bird meets in harmonious song. Regulating qi and moving fire, they follow the Palace of Li; cinnabar enters the belly, and the body ascends of itself. The Green Dragon is wood, positioned in the Eastern Palace of Jia and Yi, governed by the trigram Zhen, containing within it the qi of Li, the essence of the Great Yang, the will of the Red Bird. Its nature is fierce and swift; the sages call it mercury. The White Tiger is the metal spirit of the West, positioned above Geng and Xin, governed by the trigram Dui. This metal has no form or substance; it is born in the northern waters of Ren and Gui. After forging and refinement, it forever loses its black color, named White Tiger, also called golden liquid. This substance can overcome the wood of Jia and Yi in the East. When the two natures clash, there is a sound like thunder, startling the senses, with stars and radiance flowing. At this moment, they naturally unite, their bodies like crystal.\n\nBefore their union, its color is congealed white. After consuming the essence of wood, its color transforms into that of Jia and Yi—the Green Dragon. Regulating qi and moving fire, they rise from the Palace of Li. From the first yang line of the hexagram Fu, they proceed in sequence, cycling endlessly, like linked pearls or joined jades, now gathering, now dispersing, threading through inner and outer without fixed abode. If the movement and timing err, retreat and do not proceed; regardless of years or months, it will never succeed. As the *Cantong Qi* says: \"On the third day, the moon emerges at Geng, shaped like a hook. On the eighth day, the upper arc is level as a string. On the fifteenth day, the Qian body is complete. On the sixteenth day, it begins to wane. By the twenty-third day, it is the lower arc. By the twenty-seventh day, it vanishes—this is called extinction.\" These numbers are part of the oral formula.\n\nWhen the Great Yang first rises over Peach Mountain in the Eastern Capital, it corresponds to the You hour in the Central Kingdom, when the cock’s crow ceases. Only the Xu, Hai, and Zi hours are the places of silence. Common people hear only a few sounds but do not discern the three-hour principle. If one understands the method of the cock’s crow, even the Milky Way will be a companion. When the moon first appears, it shines for only twenty-four days, with three days of dimness before and after. Those who study the Way but do not know this essential point will vainly expend their life’s utmost effort, lost beyond knowing.\n\nThe profound meaning of the Five Phases is hard to grasp; Dragon and Tiger lie hidden in Kan and Li. Though the arts of returning elixir number in the hundreds, the most wondrous requires the golden flowery pond. The Five Phases are metal, wood, water, fire, and earth. The Dragon is hidden in the Palace of Kan and Li. The Li trigram has two yang lines and one yin, its inner emptiness receiving the Dragon. The Dragon is fire, fire is mercury, named the Maiden. Upon seeing the White Tiger, she immediately conceives; after ten months, they naturally give birth, white metal born in water.\n\nThe Kan trigram has two yin lines and one yang; metal lies hidden in water, its form unseen. There is only one method to extract it, called true lead. This is the dual nature of water and fire, the yin and yang, with nothing else involved. As the *Yinfu Jing* says: \"Though the methods of golden elixir number in the hundreds, the key lies in the formula of divine water and flowery pond.\"\n\nWhen the Li Dragon flickers and sparks with golden stars, its profound radiance harbors the essence of supreme refinement. It responds to the four seasons, giving life to all things, and when its work spans three years, it preserves and extends life. Melting azure waters into soaring clouds, fire refines golden blossoms, blending qi into purity. Once the Flowery Pond is refined and the Tiger appears, the cyclical nodes advance and retreat, transforming into light yellow.\n\nSuch is the secret—fully revealed.\n\nCinnabar’s position is not inherently red; arranged through the four seasons, it resides in the southern abode. The flowing pearl’s nature has no fixed dwelling; if one recognizes its origin, it resembles autumn stone. Cinnabar here refers solely to white metal, not red, its position aligned with the south. The flowing pearl is quicksilver. Its nature is fierce and swift, requiring autumn stone to restrain it before it can be stabilized. Autumn stone’s flavor encompasses bitter, pungent, sour, sweet, and salty—the five tastes complete, its qi sufficient to manifest the five colors. An ancient song says:\n\n*A single substance bears five hues,*\n*Forever the immortal’s reward.*\n\nThe true qi of solar essence and lunar brilliance, conceiving and nurturing the child, is divinely wondrous. When transformation nears its end, you shall witness it yourself—clearly transmuting into bright window dust.\n\nSolar essence is the essence of the great yang, born in wood and transformed by fire into earth. Earth is fire’s child, hence the Five Phases’ fire. Fire transformed into earth becomes the supreme medicine, known only to sages. Lunar brilliance is white metal, called the Jade Hare, born in water. The secret says:\n\n*Lunar brilliance belongs to Kan, moving through emptiness,*\n*When water nourishes it, the essence is attained.*\n*Its refined qi enables transformations,*\n*Resonating with the primordial substance, timely and efficacious.*\n*Frost flies, the gorge gleams, congealing like snow,*\n*The pristine body solidifies, its form like the night’s stars.*\n*If true yin is refined and the Tiger appears,*\n*The Wood Dragon harmonizes, their affinity profound.*\n\nThis speaks of white metal as the crucible’s qi, the waxing and waning of the two arcs. On the eighth day, the waxing crescent holds half a catty of metal, aligned with *ding*. By the fifteenth day, the *qian* body is complete, the three and five forming a perfect radiance. On the twenty-third day, the waning crescent holds half a catty of water, totaling sixteen ounces, each ounce twenty-four *zhu*, amounting to three hundred eighty-four *zhu*—corresponding to the three hundred eighty-four lines of the sixty-four hexagrams, each *zhu* matching a line. A year has three hundred sixty days, with twenty-four solar terms, aligning with heaven’s great numbers, called the celestial tally.\n\nThe crucible corresponds to the waxing and waning arcs, embodying *qian* and *kun*, giving birth to all things. The *Yinfu Jing* says: *\"There exists a wondrous vessel, its qi explored to form the crucible, from which all phenomena arise.\"* The *Jinbi Jing* states: *\"The divine chamber is the pivot of the elixir, not the world’s base metals.\"* When the elixir is complete, it resembles bright window dust. Ingested, it permeates the three cinnabar fields. Thus it is said: *\"The Yellow Emperor obtained it, first fortifying the three palaces, then governing the myriad states.\"* Since ancient times, sages who consumed this medicine attained the Dao and longevity—no other medicine exists. Those of aspiration should practice accordingly.\n\nDo not rely on the lead-mercury school;\nThe golden elixir’s secret is unknown even to sages.\nDo not mistake worldly lead and mercury,\nDebating fire times in vain contention.\n\nLead is the water of the north, the beginning of the Five Phases, its number one, its color black. The secret says:\n\n*The essence of the Black Emperor of the north,*\n*A formless body in constant flux.*\n*If it encounters the Three Households’ substance,*\n*The Maiden is instantly startled.*\n\nThis substance is true mercury. Lead is born in water, aligned with the *li* qi. The *Qiantong Jue* states: *\"Metal does not reveal its form; mercury does not display its talent.\"* The sage’s secret method models the mysterious and profound qi, refining its wondrous essence into the medicine for eternal life. The unknowing refer to autumn stone—also called white metal. It flows and glides, thus it is no ordinary substance, not crafted from worldly materials. Those of aspiration, when refining the supreme medicine, should not use cinnabar or mercury—this is the most refined and wondrous method. It speaks solely of white metal, retaining the mysterious and profound qi. White metal and mercury are the sage’s true secret.\n\nHeaven-born dual substances correspond to emptiness,\nServing as wife, child, and husband.\nThe gate of three and five is only sun and moon,\nDividing *mao* and *you* as their initial seats.\n\nThe heaven-born dual substances are yin and yang qi. The sage, through method and fire timing, names them the fire-seeker’s aliases. The subtle and wondrous qi solidifies into the supreme medicine—the essence of sun and moon. The sun is the husband, the moon the wife, the medicine the child, the child being the essence of sun and moon. Consuming this essence, one’s years equal the sun and moon. Three and five are the numbers of earth and wood. Three is wood, five is earth. Wood contains fire, fire transforms into earth—this is the supreme medicine. Ingested in the central palace, it distinguishes *mao* and *you*. *Mao* is the east’s *jia* and *yi*, its position in *bing* and *ding*. *You* is the west’s *geng* and *xin*, metal in water; after refinement, its color congeals as white, and it can consume wood’s essence, thus metal overcomes wood. The initial seat begins with the *fu* hexagram, the yang line first arising, its movement reaching the *li* palace, then vanishing in the *kan* palace. The great yang first emerges at Fusang, ascending to the *dui* palace, then setting in the west. The yang line gradually wanes, the yin line flourishes—this is called extinction. These principles are difficult to expound; since ancient times, not one Daoist practitioner has understood them. The key lies in oral transmission, hard to convey in writing—called the celestial tally, the spirit of great destruction.\n\nThe supreme medicine, nurtured by heaven’s natural endowment, forms a body from harmonious qi. Wealth and nobility arise from embracing the five colors; the heart knows lead and mercury unite as kin. The supreme medicine is harmonious qi. Nurturing metal with mercury, the existent merges with the nonexistent. One and none together are called the Dao. The existent is the Tiger; the nonexistent is the Dragon.\n\nMaster Tao states: Those who refine emptiness progress to refining cinnabar; those who refine cinnabar unite with the supreme Dao. An ancient formula says: *\"A single thing bears five hues— / Forever the immortal’s fortune.\"* This speaks only of this one substance, white metal. When cultivated, it displays five colors, its radiance dazzling the eye. Through forging and refinement, its precious nature becomes manifest.\n\nMaster Tao, in refining treasures and discerning treasures, is called a Perfected One when the worthy attain the Dao. *\"Heaven and Earth do not permit mutual avoidance— / The resolute know their place in the cosmos.\"* After ten months, mother and child separate; how could the worthy ever force the circulation of qi?\n\nHeaven and Earth are the upper and lower crucibles. The lid symbolizes Heaven, holding half a catty of metal; the base symbolizes Earth, with its measure of three and five. Three hundred eighty-four grains make one catty—this is called Heaven and Earth. When Heaven is blocked and Earth sealed, water and fire arise spontaneously, and spirit-essence appears—no disorder or loss may occur. When the ten months are complete, the form naturally takes shape; how could one ever force the movement of qi? Once the medicine is perfected and the body formed, it enters the great *geng* crucible, circling the Red Crow for three years—then the Dao is fulfilled. Those who partake of it share the lifespan of Heaven and Earth.\n\nThe profound and obscure cannot be distinguished; the gate of lead and mercury is difficult to reveal. The world does not comprehend its origin—examine the utmost conduct, and it will naturally appear. The profound and obscure are the medicine’s fundamental nature. Though its names are myriad, the Dao practitioner must not mistake true and false. The gate of lead and mercury cannot be spoken of in terms of its origin. The Dao student must deeply grasp yin and yang, carefully observe the five phases—then the truth will naturally become clear.\n\nWhen the resolute transmit this teaching, even father and son may not meet. Even if one finds the right person, they may not embody its truth—it cannot be sought through mere intention. Though some study the Dao, they only delight in smelting gold and refining silver, never seeking the Way of abiding in the world and attaining longevity. Some say this Way is utterly unknown. Such intentions are far from the truth.\n\n*\"The infant, vacant and unknowable— / In vain one wearies the spirit, suffering in delusion.\"* Only by comprehending the sage’s words does the luminous path to Heaven become clear. The deluded, clinging to their own ways, employ other substances in vain pursuit of the supreme Dao. Regardless of years spent, they never succeed, exhausting their spirits until their hair turns white. But if one grasps the words of the Perfected, follows the guiding principle, and refines the medicine to completion, ascending to Heaven is no difficulty.\n\nThree and four dwell together in one chamber; one and two form a wedded pair. Only with a worthy matchmaker may they unite, their bond deepening through mutual exchange. Three is the spirit of Wood; four is the spirit of Metal. These two become husband and wife—mercury enters metal, dwelling together in one chamber, requiring a worthy matchmaker. That matchmaker is the fire spirit of the southern *bing* and *ding*. Without this essential knowledge, one labors in vain.\n\nFloating and sinking, indistinct and elusive—how can the deluded discern its nature? They wait in vain, their years stretching far.\n\nTo know when the numinous medicine will be complete, the yang number must culminate in nine revolutions. Gold sinks and stone floats—common folk do not understand this, and the deluded find it even harder to approach.\n\nWhen refined through nine revolutions, the number of utmost yang, it radiates crimson and violet, called the Great Return Elixir. Is this not effortless? The celestial mechanism unfolds, and one becomes deathless.\n\nThe obscure interplay of yin and yang defies comprehension; the Azure Dragon and White Tiger contend with one another. As the year draws to a close, their transformations unfold— the White Tiger subdues the Dragon, and the Dragon gradually wanes.\n\nThe Way of yin and yang is difficult to fathom at its source. If one trusts in a hundred methods, one will achieve nothing in the end. When Dragon and Tiger are formed, they consume one another. The White Tiger restrains the Dragon, and they engage in mutual struggle. The mercury seeks to flee, but is bound by water, unable to escape—thus it becomes the supreme treasure.\n\nHeaven, the father, and Earth, the venerable mother— the Vermilion Bird of the South and the Dark Warrior of the North. As the year ends and time passes, all become earth. Where then shall one seek the Dragon and Tiger?\n\nHeaven is the father, Earth the mother—this signifies that the white metal serves as the crucible. The Vermilion Bird of the South is the fire spirit, known as lead. When the refining is complete, all return to earth—this is the principle of the Dragon and Tiger’s respiration.\n\nThree unite in righteous harmony as one clan, constantly drinking the radiance of the sun and moon within. Once the Three Flowers have passed and the gold reliquefies, nine revolutions require the work of years.\n\nThe \"three persons\" are water, fire, and metal. Their ancestral origin is the sun, the essence of great yang, and the moon, the essence of the Jade Hare. They come and go, illuminating within, leaving their essence in the crucible, transforming and returning to the chamber of Earth.\n\nThe Three Flowers is another name for fire; when it encounters the liquid gold, it must not be grasped. As the two unite and the years pass, the elixir is surely completed.\n\nThe Azure Dragon’s true nature resides in the Eastern Palace, paired with Heaven and Earth in the Thunder position. Once the White Tiger appears from this union, how could the flowing pearl refuse to follow?\n\nThe Azure Dragon is the east, *jia* and *yi*, dwelling in the Thunder Palace. Its number is three, its color azure, ruling the third month of spring. It is the yang qi of mercury, capable of spreading branches and flourishing. As heavenly qi descends and earthly qi ascends, within the Wood Palace lies its father—this is called the Azure Dragon.\n\nThe White Tiger is the spirit of the Seven Killings, able to overcome Wood. The Wood Dragon seeks to flee but is restrained by Metal and cannot escape. The Wood Dragon is true mercury. As soon as the fire qi stirs, it is gradually gathered and returned to its original palace—hence it is called the Returned Elixir. This is the principle of Metal and Wood’s mutual return.\n\nWhen Dragon and Tiger are refined through five revolutions, the fragrance of chrysanthemums gradually arises in the furnace. Now is the proper time for refinement—do not regret the passing years.\n\nIn cultivating the Great Elixir, one’s will must be steadfast as a mountain valley. One abandons grain and ceases cooking, devoting oneself day and night with single-minded focus, timing each moment without error. One disregards gain and loss, hoping only for the elixir’s completion. When auspicious signs appear at the furnace, the fragrance is like that of chrysanthemums.\n\nTo recognize cinnabar as the essence of Wood, move it to the western position to join with Metal. Where shall ordinary people seek its traces? Within the indistinct and elusive, in the profound and obscure.\n\nCinnabar is originally the essence of Wood, its essence being the departure from darkness—thus it is called mercury. Vaguely indistinct, within it lies substance. Profoundly obscure, within it lies essence. This principle is profound and difficult to fathom at its root.\n\nThose who awaken are like one who retraces their steps from a fork in the road, while those lost on the path find it arduous to seek the way. The three unite in operation from a single origin—how could their true nature ever depart from their ancestral source?\n\nAwakening is not difficult, but the lost path is not easily found. The \"three persons\" are water, fire, and metal—affairs of a single origin, known only to the sage.\n\nOne person exists, and one does not—Metal Lord is the wife, and Wood is the husband. The profound mystery is unfathomable; how could a determined scholar ever dare to speak of diagrams?\n\nThe \"one who exists\" is Metal Lord; the \"one who does not\" is the Azure Dragon. This principle is so profound that it cannot be conveyed through diagrams. Those who study this must be diligent and steadfast, forgetting hunger and weariness, sparing no effort, and carefully heeding the master’s instructions.\n\nEven if one encounters a perfected being and discusses it all day, if one’s own root-nature does not resonate with the supreme Way, how can one succeed? Before attaining the supreme Way, even determined scholars feel utterly lost. Once attained, finding someone to transmit it to is rarer than one in ten thousand.\n\nThose who have mastered it must not conceal the great Way. Later learners, puffed up with arrogance, seek only silver to benefit the world and never pursue the medicine that sustains life. Such people are truly pitiable, wasting their lives in vain.\n\nSome say this Way does not exist, but this is because their vital qi is not pure, and perverse qi mingles with it—thus they remain distant from the Way.\n\nThese thirty verses are resplendent in every line, each word revealing principle. Though I, in my foolishness, have annotated the text, the matter remains one and the same in its essence. It teaches people not to use mercury, cinnabar, or the five metals with tangible form in cultivating the supreme Way. The root of the supreme medicine is not among the few things of this world.\n\nLater learners must carefully examine this matter. If they do not depart from its imagery, they may yet be loyal ministers and filial children. Those who do not seek the true are truly to be pitied.\n\nThe profound heavens vast and boundless pair with the yellow earth; male essence harmonizes and unites in the same chamber. The white liquid in the furnace transforms with the moon—those who ingest it become pure of heart and cool within.\n\nHeaven and earth, profound and yellow, are the two qi of yin and yang. Male essence is mercury; white liquid is metal. United in one place, they become the yellow and white, resembling the form of a chicken. Placed in the crucible and refined, they then change color and become the elixir. Those who consume it can slay the Three Corpses, expel the Nine Worms, and remain free from affliction—such a one is called a true person.\n\nWho can determine the origin of Metal and Wood’s mutual harm? The Five Phases return and connect of their own accord.\n\nIn the world, all conceal the white of yin-fire—\nwho can recognize the lead of yellow sprouts?\nMetal can overcome Wood, yet fire lies hidden within Wood;\nfire can dissolve Metal—\nthe Five Phases reverse and yet complete one another.\n\nFrom *zi* to *wu* is mutual generation;\nfrom *wu* to *xu* is mutual conquest.\nSuch cycles of connection and reversal\nare contained in the oral transmission of the formula.\n\nIn the world, lead and mercury do not depend on each other—\nthe resolute know they reside in *kan* and *li*.\nThe wise conceal what others cannot see;\nHuainan’s secrets were refined in the Flowery Pond.\n\nWhen the world asks of lead and mercury,\nthey lie hidden in the viscera, unclassified—\nthose who ingest them pass with the dregs,\nnever entering the Flowery Pond of the cinnabar field.\nThis Flowery Pond is the divine water.\n\nWithin the formula, the Flowery Pond is white metal;\nthe method is not recorded in medical texts—it resides in the heart.\nBathing requires transmission; no other method exists—\nthe yang number returns, transformed into yin.\n\nThe golden body is mercury,\nyet not in the form of mercury.\nTo refine the medicine, one must master the formula;\nwithout a teacher, do not attempt the furnace.\n\nIf the method of divine water is not transmitted,\nyear after year, it flies away.\nWhen the ninefold elixir nears completion as the year ends,\nopening the furnace, one suddenly sees the red blossom of the medicine.\n\nWater and fire transform together into earth—\nwhere then can mortals seek the Golden Lord?\nWhen the yang number is fulfilled and the furnace is opened,\nit resembles the morning glow, its color crimson-yellow,\nreturning to the Central Palace—\nthe two substances, water and fire, both become earth.\n\nLead and mercury, passed down through the ages, are rare;\ncinnabar of jade-like quality, clad in snow.\nVague and indistinct, it dwells within your own house—\nday after day, you look yet do not see.\n\nCinnabar-mercury is not red;\nthe ancients spoke only of white cinnabar,\nalso called \"white horse-tooth cinnabar\"—\nonly the true Metal of the West is genuine.\n\nWhen the returning elixir enters the mouth, the body becomes light;\nit dissolves long-standing illness and expels demonic essence.\nFrom this point, desire and attachment no longer cling—\nit transforms the foolish, severing worldly passions.\n\nWhen the supreme elixir enters the mouth,\nthe Three Corpses die at once,\nleaving one free from contamination—\nsuch a one is called a true person.\n\nWho awakens to the numinous elixir transcending worldly dust,\nwhere the Three Flowers converge and consort with the Dragon?\nBehold those who have refined elixirs before and after—\nthousands, even tens of thousands, have been led astray.\n\nThe Three Flowers are fire.\nIf one can harmonize and direct them,\nthe Azure Dragon arises of itself.\n\nThe Five Phases inverted in defense—\nthe Dragon emerges from within fire.\nThe Five Phases not proceeding in order—\nthe Tiger is born from within water.\n\nCast silver into water, pour water into silver—\nit is both water and silver.\n\nThe *Gold Fluid* of Yuan Yangzi is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "元阳子金液集 经名：元阳子金液集。 撰者元阳子，即中晚唐炼丹家羊参微。 集中载其金液还丹诗三十一首，皆有注解，注者不详。 官悚外丹之道。 一卷。 底本出处：《正统道藏》洞真部方法显。 元阳子金液集 真阴真阳是真道，只在眼前何远讨。 凡流岁岁烧还丹，或见青黄自云好。 真阴者，圣人只说北方壬癸水，是五行之首。 阴君曰：北方正气为河车，束方甲乙生金砂。 说此一物者，为五行之首。 诀曰：北方有水，水中有金，金始堤防，水中有金，呼名为庚辛之金，其卦属坎官也。 真阳者，南方荧惑星是也。 生自甲乙，寄位丙丁。 燧人能发其光，变化生为熟，名为太阳之精，卦属离官，内有砂汞。 时人不可知之。 世人不达其理，遂将杂物及朱砂水银，修之为至药，忽见青黄之色，自言其药好矣。 志士应须承法则，莫损心神须见道。 但知求得真黄芽，人得食之寿无老。 注曰：志士须知规则，而行规则者，即是天地之机也。 运动法象，火侯进退，皆似连珠合璧，忽聚或散，往来出入，贯串内外，相应更无差失，测候及时，即成至药。 古诀云：失在抽添。 得在受熙。",
      "translated_text": "*The Collected Writings on the Golden Elixir of Master Yuanyang*\n\n**Title:** *The Collected Writings on the Golden Elixir of Master Yuanyang*\n**Author:** Master Yuanyang, the Daoist alchemist Yang Shenwei of the mid-to-late Tang dynasty. The collection contains thirty-one poems on the Golden Elixir and the Reverted Cinnabar, each with annotations by an unknown commentator. It expounds the Way of external alchemy.\n**Volume:** One.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* section, *Methods* category.\n\n---\n\nTrue yin and true yang are the true Dao,\nYet they lie before your eyes—why seek them afar?\nThe common crowd year after year burns and refines the Reverted Cinnabar,\nAnd when they glimpse blue or yellow, they claim their elixir is fine.\n\n**True yin** refers to the north’s *ren* and *gui* waters, the origin of the Five Phases. The Lord of Yin states: \"The true qi of the north becomes the River Chariot; the east’s *jia* and *yi* generate golden sand.\" This single substance is the root of the Five Phases. The oral formula says: \"In the north there is water; within the water lies metal. When the metal first takes form, it is called the metal of *geng* and *xin*, and its trigram belongs to *Kan*.\"\n\n**True yang** is the Fire Star of the south. Born from *jia* and *yi*, it resides in *bing* and *ding*. The Fire Driller could kindle its light, transforming the raw into the cooked—this is called the essence of the Great Yang, and its trigram belongs to *Li*, containing cinnabar and mercury. The people of this age cannot comprehend it. Failing to grasp its principle, they take miscellaneous substances—even cinnabar and mercury—and refine them into a supreme medicine. When they suddenly see blue or yellow hues, they declare their elixir excellent.\n\nA person of resolve must adhere to the method and model,\nLest they waste their spirit and mind—strive to perceive the Dao.\nIf only they knew to seek the true Yellow Sprout,\nOne who partakes of it shall live without aging.\n\n**Annotation:** A person of resolve must understand the rules and follow them, for these rules are the mechanism of Heaven and Earth. The movement of the celestial patterns, the progression and retreat of the fire times—all must align like linked pearls or joined jades, now gathering, now dispersing, flowing in and out, threading through inner and outer, perfectly attuned without the slightest error. Timing the measurements precisely yields the supreme medicine. As the ancient formula says: \"Failure lies in withdrawal and addition; success lies in receiving the radiance.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 452,
      "start_sentence": 0,
      "end_sentence": 24,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.263245820999146,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\元阳子金液集.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "得至成宝，号为真黄芽者。 且不以几物制造，得成此物。 是天地之精，微妙之气结成。 几人极难会，所以云莫损心神须见道。 黄芽不与世铅同，徒以劳神不见功。 虚失光阴生白首，何处悠悠访赤松。 黄芽者，不是世问黑铅、黄丹烧成。 黄芽出自太阳之内，从虚无而生，归在中官，黄帝之位。 《道德经》云：状若明窗尘。 故非世人家所有之物，淮南子、赤松子知之。 赤松子者，即是淮南王也。 诀云：淮南王，炼秋石。 呼黄帝，美金花，更无别道。 志士不知此真诀，徒自一生白首。 所以受之归身师，师者是口诀也。 神水华池世所稀，流传不许俗人知。 还将世上凡铅汞，相似令教人不疑。 神水华池者，出自太阳之内，为火之精，仙人探用，号为神水华池。 其精凝白，似马牙硝，未伏火者。 若经炼之后，呼为金液华池，名为真铅，亦名白虎。 若修之后，即汞无黑色。 若要住火，感应只在咫尺问。 此在口诀，难以书传。 仙人将黑铅和水银，探神符白雪相似，令教人不疑。 如用黑铅水银，皆不是真法，纵遇至人，终日相随，与至道不相契，终不传付此卫注诀，只要世人悟会。 自是人之根性，与至道不相契会，圣人终不欲令其绝於后代，所以三百二百年方传一人。 夫学道之人，切须广修阴德，见於道师，敬如父母，首尾相似，不辞辛勤，得此方可传授。 《参同契》云：虚有好道之名，殊无炼丹之志。 未有小失，便起大怨，如此之人，去道远矣。 青龙逐虎虎随龙，赤禽交会声唱当。 调气运火逐离宫，丹砂入腹身自冲。 青龙者，是木也，位在束方甲乙之官，卦主震，内含离气，为太阳之精，赤禽之志。 其性猛急，圣人呼为汞。 白虎者，是西方金神，位在庚辛之上，卦在兑。 此金无形质，生北方壬癸水中，煅炼之后，则永无黑色，名为白虎，亦名金液。 此物能克束方甲乙之木，当两情相克之时，自有声爆动惊人，星曜流晖。 当此之时，即便交会，自然相合，体似增璃。 未交会，其色凝白。 食木精之后，色乃方变为甲乙之色，青龙也。 调气运火，逐离官起，自复卦一阳爻生，相次运行，周而复始，连珠合璧，或聚或散，往来贯串，出入无定。 若运行度差错，即退而不要，无论年月，终不成也。 《参同契》云：三日，月出庚，状象钩。 八日，上弦平如绳。 十五日，乾体就。 十六日，相次缺。 至二十三日，为之下弦。 到二十七日，没也。 故云灭没也。 此数合在口诀。 太阳初出东都桃山，上应中国酉时，鸡尽呜。 唯有戌、亥、子三时，是绝声之处。 世人只听几声，未辨三时之说。 但解明鸡法，霄汉亦相伴矣。 月初出之时，前后各余三日，只明二十四日。 学道之人，不知此要，徒用一生至功，而迷者不可知矣。 五行深妙义难知，龙虎隐藏在坎离。 还丹之术数过百，最妙须得金华池。 五行者，是金木水火土。 龙藏者，藏在坎离官。 离卦二阳一阴，内虚受其龙也。 龙者火也，火者汞也，名为妮女。 若见白虎，即便受胎，十月满足，自然相生，白金生水中。 坎卦二阴一阳爻，金在水中，不现其形。 唯有一法，探而取之，名为真铅。 即是水火二性，为之阴阳，更无维物。 《阴符经》云：金丹之衍数过百，要在神水华池诀。",
      "translated_text": "When the supreme treasure is attained, it is called the true Yellow Sprout. It is not crafted from several substances but is formed from the essence of Heaven and Earth, the subtle and wondrous qi congealed. Few can comprehend this, hence the admonition: \"Lest they waste their spirit and mind—strive to perceive the Dao.\" The Yellow Sprout is not the same as worldly lead; vain effort and toil yield no result. Wasted time turns hair white—where then to seek the leisurely Red Pine?\n\nThe Yellow Sprout is not the black lead or yellow cinnabar of the world, refined through burning. It emerges from within the Great Yang, born of emptiness and nothingness, returning to the Central Palace, the position of the Yellow Emperor. As the *Daodejing* says: \"Its form is like dust on a bright window.\" Thus, it is not a thing possessed by common households; only Huainanzi and Red Pine knew of it. Red Pine is none other than the Prince of Huainan. The formula states: \"The Prince of Huainan refined autumn stone, summoned the Yellow Emperor, and praised the golden flower—there is no other Way.\" If a person of resolve does not know this true formula, they will vainly spend their life with white hair.\n\nTherefore, one must receive it from a master of the body, for the master is the oral formula. The divine water and flowery pond are rare in the world, their transmission forbidden to the vulgar. Yet they are likened to worldly lead and mercury to prevent doubt. The divine water and flowery pond emerge from within the Great Yang, the essence of fire, gathered and used by immortals, called divine water and flowery pond. Its essence congeals white, like horse-tooth niter, before being subdued by fire. After refinement, it is called the golden liquid flowery pond, named true lead, also called White Tiger. Once refined, mercury loses its black color.\n\nIf one wishes to halt the fire, the response lies within a foot’s reach. This is an oral formula, difficult to transmit in writing. Immortals take black lead and mercury, extracting a divine talisman resembling white snow, to prevent doubt. But using black lead and mercury is not the true method. Even if one encounters a perfected person and follows them all day, if their nature does not align with the supreme Way, the secret formula of defense will never be transmitted. It is only that the person’s root nature does not harmonize with the supreme Way. Yet the sages do not wish to sever its transmission for later generations, so only one person is passed it every three or two hundred years.\n\nThose who study the Way must broadly cultivate hidden virtue, revering their Daoist master as they would their parents, unwavering from beginning to end, sparing no effort. Only then may they receive transmission. As the *Cantong Qi* says: \"To have only the name of loving the Way without the resolve to refine the elixir, to harbor great resentment over minor faults—such a person is far from the Dao.\"\n\nThe Green Dragon pursues the Tiger, the Tiger follows the Dragon; the Red Bird meets in harmonious song. Regulating qi and moving fire, they follow the Palace of Li; cinnabar enters the belly, and the body ascends of itself. The Green Dragon is wood, positioned in the Eastern Palace of Jia and Yi, governed by the trigram Zhen, containing within it the qi of Li, the essence of the Great Yang, the will of the Red Bird. Its nature is fierce and swift; the sages call it mercury. The White Tiger is the metal spirit of the West, positioned above Geng and Xin, governed by the trigram Dui. This metal has no form or substance; it is born in the northern waters of Ren and Gui. After forging and refinement, it forever loses its black color, named White Tiger, also called golden liquid. This substance can overcome the wood of Jia and Yi in the East. When the two natures clash, there is a sound like thunder, startling the senses, with stars and radiance flowing. At this moment, they naturally unite, their bodies like crystal.\n\nBefore their union, its color is congealed white. After consuming the essence of wood, its color transforms into that of Jia and Yi—the Green Dragon. Regulating qi and moving fire, they rise from the Palace of Li. From the first yang line of the hexagram Fu, they proceed in sequence, cycling endlessly, like linked pearls or joined jades, now gathering, now dispersing, threading through inner and outer without fixed abode. If the movement and timing err, retreat and do not proceed; regardless of years or months, it will never succeed. As the *Cantong Qi* says: \"On the third day, the moon emerges at Geng, shaped like a hook. On the eighth day, the upper arc is level as a string. On the fifteenth day, the Qian body is complete. On the sixteenth day, it begins to wane. By the twenty-third day, it is the lower arc. By the twenty-seventh day, it vanishes—this is called extinction.\" These numbers are part of the oral formula.\n\nWhen the Great Yang first rises over Peach Mountain in the Eastern Capital, it corresponds to the You hour in the Central Kingdom, when the cock’s crow ceases. Only the Xu, Hai, and Zi hours are the places of silence. Common people hear only a few sounds but do not discern the three-hour principle. If one understands the method of the cock’s crow, even the Milky Way will be a companion. When the moon first appears, it shines for only twenty-four days, with three days of dimness before and after. Those who study the Way but do not know this essential point will vainly expend their life’s utmost effort, lost beyond knowing.\n\nThe profound meaning of the Five Phases is hard to grasp; Dragon and Tiger lie hidden in Kan and Li. Though the arts of returning elixir number in the hundreds, the most wondrous requires the golden flowery pond. The Five Phases are metal, wood, water, fire, and earth. The Dragon is hidden in the Palace of Kan and Li. The Li trigram has two yang lines and one yin, its inner emptiness receiving the Dragon. The Dragon is fire, fire is mercury, named the Maiden. Upon seeing the White Tiger, she immediately conceives; after ten months, they naturally give birth, white metal born in water.\n\nThe Kan trigram has two yin lines and one yang; metal lies hidden in water, its form unseen. There is only one method to extract it, called true lead. This is the dual nature of water and fire, the yin and yang, with nothing else involved. As the *Yinfu Jing* says: \"Though the methods of golden elixir number in the hundreds, the key lies in the formula of divine water and flowery pond.\"",
      "overlap_context": " for these rules are the mechanism of Heaven and Earth. The movement of the celestial patterns, the progression and retreat of the fire times—all must align like linked pearls or joined jades, now gathering, now dispersing, flowing in and out, threading through inner and outer, perfectly attuned without the slightest error. Timing the measurements precisely yields the supreme medicine. As the ancient formula says: \"Failure lies in withdrawal and addition; success lies in receiving the radiance.\"",
      "start_char": 452,
      "end_char": 1691,
      "start_sentence": 25,
      "end_sentence": 90,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.198291063308716,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\元阳子金液集.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "离龙烁动迸金星，杳杳含光蕴至精。 港应四时生万物，运穷三载保延龄。 消镕碧水飞云泳，火烁金花混气清。 炼出华池逢虎后，节符进退变黄轻。 如斯之诀，甚至露矣。 丹砂其位元非赤，四季排来在南宅。 流珠本性无定居，若识其原似秋石。 丹砂者，本只说白金一味，元非赤色，配位在南方，流珠者即是流汞也。 其性猛急，须以秋石制之，方可得住。 秋石味能苦辛酸甜咸，五味气足，能具五色。 古歌日：一物有五彩，永作仙人禄。 日魂月华二气真，含胎育子自堪神。 变转欲终君自见，分明化作明窗尘。 日魂者，是太阳之精，生在木有火，火化而成土，土是火之子，故云五行火。 火化为土，为之至药，圣人独知之。 月华者即是白金名，号为玉兔，生在水中。 诀日：月华属坎自虚行，水沃之时得至精。 精气遂能成变化，感通元质应时灵。 霜飞峡洁凝如雪，素体凝新体夜星。 若炼真阴逢虎后，木龙和会契同情。 此说一味白金为鼎气，上下两弦。 八日上弦，金半斤，于丁上。 十五日乾体就，三五圆晖。 二十三日下弦，数三五，水半斤，有一十六两，一两有二十四铢，计三百八十四铢爻，应三百八十四爻，为六十四卦，一铢应一爻，一年有三百六十日，内有二十四气，应天之大数，谓之天符。 其鼎应上下两弦，为之乾坤，能生万物。 《阴符》云：爰有奇器，探气为之，鼎始生万象。 《金碧》云：神室者，丹之枢纽，非世问五金。 其丹如成，状若明窗尘，服之贯入三丹田中是也。 所以云：黄帝得之，先固三官，后理万国。 自古圣人皆服此药，得道长生，更无别药，志士从而行之。 铅汞一门不可依，金丹秘诀圣无知。 莫将世上凡铅汞，论年运火竞相持。 铅者，北方之水，五行之初，其数一，其色黑。 诀云：北方黑帝精，一身无定形。 若逢三户物，妮女当时惊。 此物名真汞。 铅者生在水中，与离气。 《潜通诀》云：金不露形，汞不呈才。 圣人诀法象，彩玄冥之气，成其妙质，为住世之药圣。 无知者，秋石是也。 亦名白金。 能流能滑，故非凡物，不是世问凡物制造。 志士如修至药，不用朱砂水银，最为精妙者也。 本只说白金一味，留住玄冥之气，白金与汞，是圣人真诀矣。 天生二物应虚无，为妻为子复为夫。 三五之门唯日月，能分卯酉座为初。 天生二物者，即是阴阳二气，圣人以法象运动火侯，故名为探火者之异名。 微妙之气，结实成其至药，即是日月之精。 日为夫，月为妻，药为子，子是日月之精。 人食此精，与日月齐年。 三五者，是土木之数。 三者木也，五者土也。 木中有火，火化为土，谓之至药。 服在中官，能分卯酉。 卯者，束方甲乙，位在丙丁。 酉者，西方庭辛，金在水中，煅炼之后，其色凝白，又能食木精，所以得金克木。 座为初者，起自复卦，阳爻初生，行度至离官，没在坎官，太阳初出在扶桑，上行兑官，没於西上，阳爻渐衰，阴爻正王，谓之灭没。 此数者难申说，自古学道之人，无一知者。 要在口诀，难以书传，谓之天符，大杀之神。 含养天然禀至神，冲和之气结成身。 富贵只绿怀五彩，心知铅汞共成亲。 至神之药，是冲和之气，将金养汞，以有合无。 一有一无谓之道。 有者虎也，无者龙也。",
      "translated_text": "When the Li Dragon flickers and sparks with golden stars, its profound radiance harbors the essence of supreme refinement. It responds to the four seasons, giving life to all things, and when its work spans three years, it preserves and extends life. Melting azure waters into soaring clouds, fire refines golden blossoms, blending qi into purity. Once the Flowery Pond is refined and the Tiger appears, the cyclical nodes advance and retreat, transforming into light yellow.\n\nSuch is the secret—fully revealed.\n\nCinnabar’s position is not inherently red; arranged through the four seasons, it resides in the southern abode. The flowing pearl’s nature has no fixed dwelling; if one recognizes its origin, it resembles autumn stone. Cinnabar here refers solely to white metal, not red, its position aligned with the south. The flowing pearl is quicksilver. Its nature is fierce and swift, requiring autumn stone to restrain it before it can be stabilized. Autumn stone’s flavor encompasses bitter, pungent, sour, sweet, and salty—the five tastes complete, its qi sufficient to manifest the five colors. An ancient song says:\n\n*A single substance bears five hues,*\n*Forever the immortal’s reward.*\n\nThe true qi of solar essence and lunar brilliance, conceiving and nurturing the child, is divinely wondrous. When transformation nears its end, you shall witness it yourself—clearly transmuting into bright window dust.\n\nSolar essence is the essence of the great yang, born in wood and transformed by fire into earth. Earth is fire’s child, hence the Five Phases’ fire. Fire transformed into earth becomes the supreme medicine, known only to sages. Lunar brilliance is white metal, called the Jade Hare, born in water. The secret says:\n\n*Lunar brilliance belongs to Kan, moving through emptiness,*\n*When water nourishes it, the essence is attained.*\n*Its refined qi enables transformations,*\n*Resonating with the primordial substance, timely and efficacious.*\n*Frost flies, the gorge gleams, congealing like snow,*\n*The pristine body solidifies, its form like the night’s stars.*\n*If true yin is refined and the Tiger appears,*\n*The Wood Dragon harmonizes, their affinity profound.*\n\nThis speaks of white metal as the crucible’s qi, the waxing and waning of the two arcs. On the eighth day, the waxing crescent holds half a catty of metal, aligned with *ding*. By the fifteenth day, the *qian* body is complete, the three and five forming a perfect radiance. On the twenty-third day, the waning crescent holds half a catty of water, totaling sixteen ounces, each ounce twenty-four *zhu*, amounting to three hundred eighty-four *zhu*—corresponding to the three hundred eighty-four lines of the sixty-four hexagrams, each *zhu* matching a line. A year has three hundred sixty days, with twenty-four solar terms, aligning with heaven’s great numbers, called the celestial tally.\n\nThe crucible corresponds to the waxing and waning arcs, embodying *qian* and *kun*, giving birth to all things. The *Yinfu Jing* says: *\"There exists a wondrous vessel, its qi explored to form the crucible, from which all phenomena arise.\"* The *Jinbi Jing* states: *\"The divine chamber is the pivot of the elixir, not the world’s base metals.\"* When the elixir is complete, it resembles bright window dust. Ingested, it permeates the three cinnabar fields. Thus it is said: *\"The Yellow Emperor obtained it, first fortifying the three palaces, then governing the myriad states.\"* Since ancient times, sages who consumed this medicine attained the Dao and longevity—no other medicine exists. Those of aspiration should practice accordingly.\n\nDo not rely on the lead-mercury school;\nThe golden elixir’s secret is unknown even to sages.\nDo not mistake worldly lead and mercury,\nDebating fire times in vain contention.\n\nLead is the water of the north, the beginning of the Five Phases, its number one, its color black. The secret says:\n\n*The essence of the Black Emperor of the north,*\n*A formless body in constant flux.*\n*If it encounters the Three Households’ substance,*\n*The Maiden is instantly startled.*\n\nThis substance is true mercury. Lead is born in water, aligned with the *li* qi. The *Qiantong Jue* states: *\"Metal does not reveal its form; mercury does not display its talent.\"* The sage’s secret method models the mysterious and profound qi, refining its wondrous essence into the medicine for eternal life. The unknowing refer to autumn stone—also called white metal. It flows and glides, thus it is no ordinary substance, not crafted from worldly materials. Those of aspiration, when refining the supreme medicine, should not use cinnabar or mercury—this is the most refined and wondrous method. It speaks solely of white metal, retaining the mysterious and profound qi. White metal and mercury are the sage’s true secret.\n\nHeaven-born dual substances correspond to emptiness,\nServing as wife, child, and husband.\nThe gate of three and five is only sun and moon,\nDividing *mao* and *you* as their initial seats.\n\nThe heaven-born dual substances are yin and yang qi. The sage, through method and fire timing, names them the fire-seeker’s aliases. The subtle and wondrous qi solidifies into the supreme medicine—the essence of sun and moon. The sun is the husband, the moon the wife, the medicine the child, the child being the essence of sun and moon. Consuming this essence, one’s years equal the sun and moon. Three and five are the numbers of earth and wood. Three is wood, five is earth. Wood contains fire, fire transforms into earth—this is the supreme medicine. Ingested in the central palace, it distinguishes *mao* and *you*. *Mao* is the east’s *jia* and *yi*, its position in *bing* and *ding*. *You* is the west’s *geng* and *xin*, metal in water; after refinement, its color congeals as white, and it can consume wood’s essence, thus metal overcomes wood. The initial seat begins with the *fu* hexagram, the yang line first arising, its movement reaching the *li* palace, then vanishing in the *kan* palace. The great yang first emerges at Fusang, ascending to the *dui* palace, then setting in the west. The yang line gradually wanes, the yin line flourishes—this is called extinction. These principles are difficult to expound; since ancient times, not one Daoist practitioner has understood them. The key lies in oral transmission, hard to convey in writing—called the celestial tally, the spirit of great destruction.\n\nThe supreme medicine, nurtured by heaven’s natural endowment, forms a body from harmonious qi. Wealth and nobility arise from embracing the five colors; the heart knows lead and mercury unite as kin. The supreme medicine is harmonious qi. Nurturing metal with mercury, the existent merges with the nonexistent. One and none together are called the Dao. The existent is the Tiger; the nonexistent is the Dragon.",
      "overlap_context": "ite Tiger, she immediately conceives; after ten months, they naturally give birth, white metal born in water.\n\nThe Kan trigram has two yin lines and one yang; metal lies hidden in water, its form unseen. There is only one method to extract it, called true lead. This is the dual nature of water and fire, the yin and yang, with nothing else involved. As the *Yinfu Jing* says: \"Though the methods of golden elixir number in the hundreds, the key lies in the formula of divine water and flowery pond.\"",
      "start_char": 1691,
      "end_char": 2944,
      "start_sentence": 91,
      "end_sentence": 154,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.47460341453552,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\元阳子金液集.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "陶真人云：练空者至於炼砂，炼砂者合於至道。 古诀云．．一物有五彩，永作仙人禄。 只是说此一味白金，修炼之时，而有五色，光明照目，煅炼得成，即见其宝。 陶真人修宝炼宝，见宝别宝，贤人得道，谓之真人也。 乾坤不许相为避，志士元知在天地。 十月养成子母分，贤者何曾更运气。 乾坤，上下釜也。 上盖象天，金有半斤，下坐象地，金数三五。 铢有三百八十四，应一斤，为之乾坤。 天否地闭，水火自生，神精现焉，不得乱失。 十月满足，自然成形质者，何曾更运其气。 药成体就，却入大庚合内，周游赤乌，经营三载，其道毕矣。 人得食者，寿同天地。 玄黄冥寞不可辩，铅汞之门义难显。 世人不晓定其原，细视至行自然见。 玄黄者，药之本体。 名字极多，学道者不可辫真假铅汞之门，不可说其原来处。 学道人切在深会阴阳，细视五行，自然相见。 志士相传，父子难遇，纵此得其人，难体其事，不可以意求之。 纵有学道，只是好烧金炼银，终不求住世长生之道。 或云终无知此道。 如此用意，去真远矣。 婴儿漠漠不可悟，徒以劳神虚见苦。 但知会得圣人言，即是分明上天路。 愚迷之意，不可操持。 遂用他物修营至道，无论年月，终无成者，自劳其神，至於白首。 如会至人之言，准其绳墨，修炼得成，上天何难。 三四同居共一室，一二夫妻为偶匹。 要假良媒方得亲，遂使交游情意密。 三者木神也，四者金神也。 二物为夫妇之道，汞入金中，同居一室，须要良媒。 良媒者，即南方丙丁火神也。 不知此要，虚受辛苦。 浮沉恍惚性难辨，俟取迷徒年月远。",
      "translated_text": "Master Tao states: Those who refine emptiness progress to refining cinnabar; those who refine cinnabar unite with the supreme Dao. An ancient formula says: *\"A single thing bears five hues— / Forever the immortal’s fortune.\"* This speaks only of this one substance, white metal. When cultivated, it displays five colors, its radiance dazzling the eye. Through forging and refinement, its precious nature becomes manifest.\n\nMaster Tao, in refining treasures and discerning treasures, is called a Perfected One when the worthy attain the Dao. *\"Heaven and Earth do not permit mutual avoidance— / The resolute know their place in the cosmos.\"* After ten months, mother and child separate; how could the worthy ever force the circulation of qi?\n\nHeaven and Earth are the upper and lower crucibles. The lid symbolizes Heaven, holding half a catty of metal; the base symbolizes Earth, with its measure of three and five. Three hundred eighty-four grains make one catty—this is called Heaven and Earth. When Heaven is blocked and Earth sealed, water and fire arise spontaneously, and spirit-essence appears—no disorder or loss may occur. When the ten months are complete, the form naturally takes shape; how could one ever force the movement of qi? Once the medicine is perfected and the body formed, it enters the great *geng* crucible, circling the Red Crow for three years—then the Dao is fulfilled. Those who partake of it share the lifespan of Heaven and Earth.\n\nThe profound and obscure cannot be distinguished; the gate of lead and mercury is difficult to reveal. The world does not comprehend its origin—examine the utmost conduct, and it will naturally appear. The profound and obscure are the medicine’s fundamental nature. Though its names are myriad, the Dao practitioner must not mistake true and false. The gate of lead and mercury cannot be spoken of in terms of its origin. The Dao student must deeply grasp yin and yang, carefully observe the five phases—then the truth will naturally become clear.\n\nWhen the resolute transmit this teaching, even father and son may not meet. Even if one finds the right person, they may not embody its truth—it cannot be sought through mere intention. Though some study the Dao, they only delight in smelting gold and refining silver, never seeking the Way of abiding in the world and attaining longevity. Some say this Way is utterly unknown. Such intentions are far from the truth.\n\n*\"The infant, vacant and unknowable— / In vain one wearies the spirit, suffering in delusion.\"* Only by comprehending the sage’s words does the luminous path to Heaven become clear. The deluded, clinging to their own ways, employ other substances in vain pursuit of the supreme Dao. Regardless of years spent, they never succeed, exhausting their spirits until their hair turns white. But if one grasps the words of the Perfected, follows the guiding principle, and refines the medicine to completion, ascending to Heaven is no difficulty.\n\nThree and four dwell together in one chamber; one and two form a wedded pair. Only with a worthy matchmaker may they unite, their bond deepening through mutual exchange. Three is the spirit of Wood; four is the spirit of Metal. These two become husband and wife—mercury enters metal, dwelling together in one chamber, requiring a worthy matchmaker. That matchmaker is the fire spirit of the southern *bing* and *ding*. Without this essential knowledge, one labors in vain.\n\nFloating and sinking, indistinct and elusive—how can the deluded discern its nature? They wait in vain, their years stretching far.",
      "overlap_context": ", hard to convey in writing—called the celestial tally, the spirit of great destruction.\n\nThe supreme medicine, nurtured by heaven’s natural endowment, forms a body from harmonious qi. Wealth and nobility arise from embracing the five colors; the heart knows lead and mercury unite as kin. The supreme medicine is harmonious qi. Nurturing metal with mercury, the existent merges with the nonexistent. One and none together are called the Dao. The existent is the Tiger; the nonexistent is the Dragon.",
      "start_char": 2944,
      "end_char": 3587,
      "start_sentence": 155,
      "end_sentence": 188,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.295223712921143,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\元阳子金液集.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "欲知灵药何日成，阳数终须归九转。 金沉石浮，世人不知解，迷徒之人更难亲。 炼变至九转，极阳之数，红紫射人，号为大还之丹，岂非容易，天机张而不死矣。 阴阳冥寞不可知，青龙白虎自相持。 年终变转自相瞰，白虎制龙龙渐希。 阴阳之道，难究其原。 若信百方，终无所成。 成龙虎，两相饮食。 白虎制龙，两相交持。 其汞欲飞，被水相拘留，汞去不得，即成至宝也。 乾天为父坤老母，南方朱雀北玄武。 年终岁久俱成土，时人何处寻龙虎。 乾者为天为父，坤者为地为母，此意白金为鼎器也。 南朱雀，火神也，名为铅。 修炼功毕，俱成於土，即是龙虎呼吸之理也。 三人义合同为宗，常饮日月照其中。 已过三花金再液，九转须终岁月功。 三人者，即是水火金三物也。 其宗祖日者，太阳之精，月者，玉兔之精。 往来照曜其中，留精於鼎内，化归坤室。 三花者，火之异名，遇金液不可拾也。 两相交会，岁月将满，其丹铃成也。 青龙本质在束宫，配合乾坤震位中。 白虎自兹相见后，流珠那肯不相从。 青龙者，束方甲乙，位居震官，其数三，其色青，王春之三月，汞阳气，能布枝条芳荣，天气下降，地气上腾，即木官中有其父，号为青龙。 白虎者，七杀之神，能克木，木龙欲走，被金制之，不能去也。 木龙者即是真汞。 火气才动，渐被收之，还被归本官，故云还丹也。 金木相返之义。 龙虎修来五转强，炉中渐觉菊花香。 如今修炼正当节，莫恨悠悠岁月长。 夫修大丹，志意岩谷，休粮停厨，昼夜精心专思，漏刻抽喊无差。 不辞得失，希望丹成。 临炉瑞应，香气如菊花也。 欲识丹砂是木精，移来西位与金并。 凡人何处寻踪迹，恍惚中问在杳冥。 丹砂本是木之精，精是离黑，故名汞。 恍恍惚惚，其中有物。 杳杳冥冥，其中有精。 此义深远，难究其根也。 悟者犹如返歧踪，迷途不易寻路苦。 三人运合同一原，本性何曾离宗祖。 悟者非难，迷途不易。 三人即水火金三物，事同一原，唯圣人独知之矣。 一人本有一人无，金公为妇木为夫。 玄冥深奥不可度，志士何曾肯语图。 一人有者，即是金公也。 一人无者，即是青龙也。 其义深远之事一学者不可语图。 夫学此事者，切须勤苦志，亡心饥罢寝，不辞辛勤，审察师旨。 纵遇至人，终日话论，自己根性不契至道，如何得成。 志士未得至道之时，亦甚茫然。 及至得了，觅人传付，犹万万中不遇一人。 学得之者，不可闭其大道矣。 后来学者心自喷唷我慢，只求乾银济世之宝，终不求济命之药。 如此之人，实可痛乎，虚弃一世。 或云终无此道，盖为正气不真，邪气参杂，则与道为隔也。 此诀三十首，句句华秀，字字显理。 偶以愚情注解其文，重迭事同一原，令人不用水银朱砂，及五金有质之物，修营至道。 至药根本，不是世间几物。 后来学者，切宜细详其事，不出象中，忝为忠臣孝子，不解寻真，实为苦哉。 玄天汪汪配地黄，男精和合并同房。 白液炉中随月化，时人服者莹心冻。 天地玄黄，是阴阳二气，男精汞也，白液者金也。 合归一处，为之黄白，象鸡形。 入鼎烧之，然后变色成丹。 人得食者，能杀三尸，去九虫，令人无所染，谓之真人也。 金木相伤谁定原，五行相返自相连。",
      "translated_text": "To know when the numinous medicine will be complete, the yang number must culminate in nine revolutions. Gold sinks and stone floats—common folk do not understand this, and the deluded find it even harder to approach.\n\nWhen refined through nine revolutions, the number of utmost yang, it radiates crimson and violet, called the Great Return Elixir. Is this not effortless? The celestial mechanism unfolds, and one becomes deathless.\n\nThe obscure interplay of yin and yang defies comprehension; the Azure Dragon and White Tiger contend with one another. As the year draws to a close, their transformations unfold— the White Tiger subdues the Dragon, and the Dragon gradually wanes.\n\nThe Way of yin and yang is difficult to fathom at its source. If one trusts in a hundred methods, one will achieve nothing in the end. When Dragon and Tiger are formed, they consume one another. The White Tiger restrains the Dragon, and they engage in mutual struggle. The mercury seeks to flee, but is bound by water, unable to escape—thus it becomes the supreme treasure.\n\nHeaven, the father, and Earth, the venerable mother— the Vermilion Bird of the South and the Dark Warrior of the North. As the year ends and time passes, all become earth. Where then shall one seek the Dragon and Tiger?\n\nHeaven is the father, Earth the mother—this signifies that the white metal serves as the crucible. The Vermilion Bird of the South is the fire spirit, known as lead. When the refining is complete, all return to earth—this is the principle of the Dragon and Tiger’s respiration.\n\nThree unite in righteous harmony as one clan, constantly drinking the radiance of the sun and moon within. Once the Three Flowers have passed and the gold reliquefies, nine revolutions require the work of years.\n\nThe \"three persons\" are water, fire, and metal. Their ancestral origin is the sun, the essence of great yang, and the moon, the essence of the Jade Hare. They come and go, illuminating within, leaving their essence in the crucible, transforming and returning to the chamber of Earth.\n\nThe Three Flowers is another name for fire; when it encounters the liquid gold, it must not be grasped. As the two unite and the years pass, the elixir is surely completed.\n\nThe Azure Dragon’s true nature resides in the Eastern Palace, paired with Heaven and Earth in the Thunder position. Once the White Tiger appears from this union, how could the flowing pearl refuse to follow?\n\nThe Azure Dragon is the east, *jia* and *yi*, dwelling in the Thunder Palace. Its number is three, its color azure, ruling the third month of spring. It is the yang qi of mercury, capable of spreading branches and flourishing. As heavenly qi descends and earthly qi ascends, within the Wood Palace lies its father—this is called the Azure Dragon.\n\nThe White Tiger is the spirit of the Seven Killings, able to overcome Wood. The Wood Dragon seeks to flee but is restrained by Metal and cannot escape. The Wood Dragon is true mercury. As soon as the fire qi stirs, it is gradually gathered and returned to its original palace—hence it is called the Returned Elixir. This is the principle of Metal and Wood’s mutual return.\n\nWhen Dragon and Tiger are refined through five revolutions, the fragrance of chrysanthemums gradually arises in the furnace. Now is the proper time for refinement—do not regret the passing years.\n\nIn cultivating the Great Elixir, one’s will must be steadfast as a mountain valley. One abandons grain and ceases cooking, devoting oneself day and night with single-minded focus, timing each moment without error. One disregards gain and loss, hoping only for the elixir’s completion. When auspicious signs appear at the furnace, the fragrance is like that of chrysanthemums.\n\nTo recognize cinnabar as the essence of Wood, move it to the western position to join with Metal. Where shall ordinary people seek its traces? Within the indistinct and elusive, in the profound and obscure.\n\nCinnabar is originally the essence of Wood, its essence being the departure from darkness—thus it is called mercury. Vaguely indistinct, within it lies substance. Profoundly obscure, within it lies essence. This principle is profound and difficult to fathom at its root.\n\nThose who awaken are like one who retraces their steps from a fork in the road, while those lost on the path find it arduous to seek the way. The three unite in operation from a single origin—how could their true nature ever depart from their ancestral source?\n\nAwakening is not difficult, but the lost path is not easily found. The \"three persons\" are water, fire, and metal—affairs of a single origin, known only to the sage.\n\nOne person exists, and one does not—Metal Lord is the wife, and Wood is the husband. The profound mystery is unfathomable; how could a determined scholar ever dare to speak of diagrams?\n\nThe \"one who exists\" is Metal Lord; the \"one who does not\" is the Azure Dragon. This principle is so profound that it cannot be conveyed through diagrams. Those who study this must be diligent and steadfast, forgetting hunger and weariness, sparing no effort, and carefully heeding the master’s instructions.\n\nEven if one encounters a perfected being and discusses it all day, if one’s own root-nature does not resonate with the supreme Way, how can one succeed? Before attaining the supreme Way, even determined scholars feel utterly lost. Once attained, finding someone to transmit it to is rarer than one in ten thousand.\n\nThose who have mastered it must not conceal the great Way. Later learners, puffed up with arrogance, seek only silver to benefit the world and never pursue the medicine that sustains life. Such people are truly pitiable, wasting their lives in vain.\n\nSome say this Way does not exist, but this is because their vital qi is not pure, and perverse qi mingles with it—thus they remain distant from the Way.\n\nThese thirty verses are resplendent in every line, each word revealing principle. Though I, in my foolishness, have annotated the text, the matter remains one and the same in its essence. It teaches people not to use mercury, cinnabar, or the five metals with tangible form in cultivating the supreme Way. The root of the supreme medicine is not among the few things of this world.\n\nLater learners must carefully examine this matter. If they do not depart from its imagery, they may yet be loyal ministers and filial children. Those who do not seek the true are truly to be pitied.\n\nThe profound heavens vast and boundless pair with the yellow earth; male essence harmonizes and unites in the same chamber. The white liquid in the furnace transforms with the moon—those who ingest it become pure of heart and cool within.\n\nHeaven and earth, profound and yellow, are the two qi of yin and yang. Male essence is mercury; white liquid is metal. United in one place, they become the yellow and white, resembling the form of a chicken. Placed in the crucible and refined, they then change color and become the elixir. Those who consume it can slay the Three Corpses, expel the Nine Worms, and remain free from affliction—such a one is called a true person.\n\nWho can determine the origin of Metal and Wood’s mutual harm? The Five Phases return and connect of their own accord.",
      "overlap_context": "er may they unite, their bond deepening through mutual exchange. Three is the spirit of Wood; four is the spirit of Metal. These two become husband and wife—mercury enters metal, dwelling together in one chamber, requiring a worthy matchmaker. That matchmaker is the fire spirit of the southern *bing* and *ding*. Without this essential knowledge, one labors in vain.\n\nFloating and sinking, indistinct and elusive—how can the deluded discern its nature? They wait in vain, their years stretching far.",
      "start_char": 3588,
      "end_char": 4886,
      "start_sentence": 189,
      "end_sentence": 256,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.88690948486328,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\元阳子金液集.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "世上共藏阴火白，谁能识得黄芽铅。 金能克木，木中藏火，火能消金，五行相返，又能相成。 从子到午，是相生。 自午至戌，是相克。 如斯相连相返之事，合在口诀所传。 世间铅汞不相依，志士元知在坎离。 贤者共藏人不见，淮南修秘在华池。 世问几铅汞，且藏府无类，服者随滓而下，终不入丹田中华池者，即神水也。 诀内华池是白金，不载方书诀在心。 、沐浴须传外无法，阳数还令反作阴。 金体水银也，非作水银形。 炼药须通诀，无师莫护施。 不传神水法，由来岁岁飞。 九转丹成岁欲终，开炉忽见药花红。 水火变来俱作土，时人何处觅金公。 阳数日满开炉鼎，状如朝霞，其色红赤黄，归在中官，水火二物，俱化成土也。 铅汞相传世所希，丹砂玉质雪为衣。 朦胧只在君家舍，日日君看君不知。 砂汞非赤色，古人只说白丹砂，亦为名白马牙砂，只是西方金是真也。 还丹入口身自轻，能销久病去祆精。 贪爱自兹无所染，能改愚人世与情。 至丹入口，三尸并死，令人无所染，谓之真人也。 谁悟灵丹出世尘，三花合会与龙亲。 君看前后炼丹者，误煞千人与万人。 三花者，火也。 如能运合，青龙自生。 五行颠倒卫，龙从火裹出。 五行不顺行，虎向水中生。 将银投水，将水投银，是水是银。 元阳子金液集竟",
      "translated_text": "In the world, all conceal the white of yin-fire—\nwho can recognize the lead of yellow sprouts?\nMetal can overcome Wood, yet fire lies hidden within Wood;\nfire can dissolve Metal—\nthe Five Phases reverse and yet complete one another.\n\nFrom *zi* to *wu* is mutual generation;\nfrom *wu* to *xu* is mutual conquest.\nSuch cycles of connection and reversal\nare contained in the oral transmission of the formula.\n\nIn the world, lead and mercury do not depend on each other—\nthe resolute know they reside in *kan* and *li*.\nThe wise conceal what others cannot see;\nHuainan’s secrets were refined in the Flowery Pond.\n\nWhen the world asks of lead and mercury,\nthey lie hidden in the viscera, unclassified—\nthose who ingest them pass with the dregs,\nnever entering the Flowery Pond of the cinnabar field.\nThis Flowery Pond is the divine water.\n\nWithin the formula, the Flowery Pond is white metal;\nthe method is not recorded in medical texts—it resides in the heart.\nBathing requires transmission; no other method exists—\nthe yang number returns, transformed into yin.\n\nThe golden body is mercury,\nyet not in the form of mercury.\nTo refine the medicine, one must master the formula;\nwithout a teacher, do not attempt the furnace.\n\nIf the method of divine water is not transmitted,\nyear after year, it flies away.\nWhen the ninefold elixir nears completion as the year ends,\nopening the furnace, one suddenly sees the red blossom of the medicine.\n\nWater and fire transform together into earth—\nwhere then can mortals seek the Golden Lord?\nWhen the yang number is fulfilled and the furnace is opened,\nit resembles the morning glow, its color crimson-yellow,\nreturning to the Central Palace—\nthe two substances, water and fire, both become earth.\n\nLead and mercury, passed down through the ages, are rare;\ncinnabar of jade-like quality, clad in snow.\nVague and indistinct, it dwells within your own house—\nday after day, you look yet do not see.\n\nCinnabar-mercury is not red;\nthe ancients spoke only of white cinnabar,\nalso called \"white horse-tooth cinnabar\"—\nonly the true Metal of the West is genuine.\n\nWhen the returning elixir enters the mouth, the body becomes light;\nit dissolves long-standing illness and expels demonic essence.\nFrom this point, desire and attachment no longer cling—\nit transforms the foolish, severing worldly passions.\n\nWhen the supreme elixir enters the mouth,\nthe Three Corpses die at once,\nleaving one free from contamination—\nsuch a one is called a true person.\n\nWho awakens to the numinous elixir transcending worldly dust,\nwhere the Three Flowers converge and consort with the Dragon?\nBehold those who have refined elixirs before and after—\nthousands, even tens of thousands, have been led astray.\n\nThe Three Flowers are fire.\nIf one can harmonize and direct them,\nthe Azure Dragon arises of itself.\n\nThe Five Phases inverted in defense—\nthe Dragon emerges from within fire.\nThe Five Phases not proceeding in order—\nthe Tiger is born from within water.\n\nCast silver into water, pour water into silver—\nit is both water and silver.\n\nThe *Gold Fluid* of Yuan Yangzi is now complete.",
      "overlap_context": "two qi of yin and yang. Male essence is mercury; white liquid is metal. United in one place, they become the yellow and white, resembling the form of a chicken. Placed in the crucible and refined, they then change color and become the elixir. Those who consume it can slay the Three Corpses, expel the Nine Worms, and remain free from affliction—such a one is called a true person.\n\nWho can determine the origin of Metal and Wood’s mutual harm? The Five Phases return and connect of their own accord.",
      "start_char": 4887,
      "end_char": 5430,
      "start_sentence": 257,
      "end_sentence": 286,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.13949203491211,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\元阳子金液集.txt",
        "category": "方法类"
      }
    }
  ]
}