{
  "source_id": "元阳子五假论",
  "source_file": "chunked_daozang\\元阳子五假论.json",
  "total_chunks": 4,
  "total_original_chars": 1787,
  "total_translated_chars": 9984,
  "total_translation_time": 52.83190846443176,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\元阳子五假论.txt",
    "category": "方法类"
  },
  "full_translation": "*The Five Simulacra of Master Yuanyang*\n**Text Title:** *The Five Simulacra of Master Yuanyang*\nAuthor unknown. Two chapters in one scroll.\nBase text from: *Daoist Canon of the Zhengtong Era*, *Methods* section of the *Dongshen* Department.\n\nFor those who cultivate the body and nurture life, who study the Dao and seek immortality—if their practice has not yet borne merit, yet they hold but a single thought, they shall surely attain accomplishment. Should their merit remain incomplete, and they dwell in the fleeting world, they may encounter demonic specters, malevolent spirits, ghosts, and spectral beings. These entities, perceiving the simulacrum, will flee in terror, daring not approach to bring harm.\n\nSimply follow my incantations: burn incense, observe abstinence, calm the mind, and silently recite. For each simulacrum, chant the incantation for forty-nine days. Should calamity, peril, or misfortune draw near, swiftly recite it once in silence, grasp an object, and cast it aside to evade. One may roam as a spirit, divide the form, or transform the body, concealing oneself within wood or fire, burrowing into metal to dissolve, or submerging in water to feign drowning. Thus, when disaster or danger approaches, one may instantly cast it aside and escape.\n\nThis is a celestial mechanism, meant to be transmitted only by word of mouth. Yet I fear that earnest seekers in this world may forget, so I have recorded it to leave for posterity. Do not recklessly disclose it to the unworthy, those who debase the Dao. Should you withhold it from those who ought to receive it, misfortune will first befall your nine generations of ancestors. If you transmit it indiscriminately, revealing this celestial secret, your nine clans will be buried in ruin, and you shall forever remain a lowly ghost, unable to receive rebirth.\n\n**First Simulacrum: Metal**\nThe west, *geng* and *xin*, domain of the White Tiger’s spirit.\nThe exalted Venus of the Nine Luminaries, guardian of the Purple Tenuity’s numinous star.\nLord of life, it fortifies the marrow and solidifies the body. The seven *po* souls do not stray; with three calls, it arrives, and with seven summons, it returns to the body.\nIt severs the self with blades, mends bones, and reconnects sinews.\nLater, it transforms the body, dispelling suffering and peril.\nHeed my incantation, and it shall act as commanded.\n\n**Incantation:**\nThe west, *geng* and *xin*, the Mysterious Perfected of the Grand Tenuity.\nWithin, it corresponds to the six viscera, transmuting into the Lung Spirit.\nManifesting in the supreme, roaming the Cinnabar Field.\nIt steadfastly guards my life, serving the immortal’s use.\nSwiftly, swiftly, as the law commands!\n\nFor the incantation, on *geng* and *xin* days at the hour of *you*, burn incense and begin the recitation—do not open the mouth, but press the tongue against the upper palate and contemplate it thus. Maintain this for forty-nine days. Should misfortune or peril arise, regardless of time or place, whether moving or still, silently recite it once. Grasping a blade, freely divide the body; though no red blood flows, only a white essence emerges, congealing without spilling. Afterward, it naturally returns, reconnecting and restoring as before.\n\n**Second Wooden Talisman**\nThe Azure Dragon of the east, belonging to *jia* and *yi*.\nResponding to spring’s command, the celestial host of Jupiter.\nIt generates its *qi*, radiant as fragrant herbs.\nWithin, it corresponds to the Liver Spirit, occupying the office of the Chancellor.\nShould I face peril, with three calls it manifests.\nIt divides and transforms the body, roaming afar.\nTo return to its original place, it appears upon beholding an object.\n\n**Incantation:**\nThe east, *jia* and *yi*, chamber of the Azure Dragon.\nMetal and wood take form, reverting to flesh and bone.\nTrue metal steadfastly guards, never straying from left or right.\nDivide the body and conceal it; through thought, it returns.\nSwiftly, swiftly, as the law commands!\n\nThe incantation is to be recited on a *geng* or *xin* day at the *mao* hour, with incense burned and the words silently murmured, inaudible to others. Thought alone is paramount, and it may be maintained for forty-nine days. Should misfortune arise, regardless of time or season, swiftly recite it in silence—whether walking, standing, or sitting—just once. Upon encountering wood, conceal the body within it to evade disaster, then divide and depart. To return, focus upon the original wood, and it will restore you to your former place.\n\n**Third Water Talisman**\nThe north, *ren* and *gui*, the position of *hai* and *zi*.\nThe Dark Warrior presides, generating myriad moistures.\nIts luster overflows with glory, corresponding within to the Kidney Spirit.\nAdorned as the Lady of the Register, root of life and destiny.\nBlood is called the \"water number,\" transmuting and refining essence-*qi*.\nOriginally of the Yang, it harbors fire within Yin, aiding the floating world.\nShould I face peril, three calls summon its presence.\nSeven invocations follow the body, entering water without drowning.\nEarth and wood sustain it; soul and spirit each reside apart.\nThe Three Peng submit, entering the Nine Realms.\n\n**Incantation:**\nThe Perfected of stars and constellations, the Dark Warrior attends the body.\nThe Curved Array lends left support; the Azure Dragon assists.\nThe White Tiger upholds; the Soaring Serpent mounts beneath.\nFollowing my form, through thought it returns.\nSwiftly, swiftly, as the law commands!\n\nTo invoke the incantation, choose a *geng* or *xin* day at the *zi* hour. Light incense and begin the recitation, refraining from speaking aloud—only silently intone it once. This may be maintained for forty-nine days. Should misfortune arise, regardless of whether walking, standing, sitting, or reclining, silently recite it once, then enter water, and the calamity shall be averted. There is no limit to the days one may remain submerged in safety. When ready to return, visualize the *qi* of the Kidney, and naturally emerge from the water, free from disaster.\n\n**Fire Proxy, Fourth**\nThe Vermilion Bird of the South governs *bing* and *ding*. Mars blazes fiercely, the Fire Spirit in its full might. It burns away the Three Peng, and the Six Spirits stand eternal guard. The hun and po become pure and clear, the Six Roots firm and unshaken, inwardly aligned with the Heart Lord. Should I face peril, three calls summon its presence, never departing from my side. *Bing* and *ding* are fire; *ren* and *gui* are destruction. I enter the proxy, and my spirit-soul remains undying. My body is water; my life is earth. Earth and water contend, yet fire does not consume me.\n\n**Incantation:**\nThe *bing* and *ding* of the South, the Crimson Dragon attends.\nYin spirits withdraw; Yang officials do not receive.\nThrough thought it returns; through use it fulfills the day.\nSwiftly, swiftly, as the law commands!\n\nInvoke the incantation on a *geng* or *xin* day at the *wu* hour. Light incense and begin the recitation, ensuring no one hears. Silent contemplation is paramount. This may be maintained for forty-nine days. Should misfortune strike, regardless of the hour, swiftly enter a quiet chamber and settle your surroundings. Silently recite the incantation once, grasping bamboo or wood. All demons and malevolent spirits will flee. Then hold your breath and cease all movement, feigning death. Unaware, your family will believe you have passed. Let your body lie as if lifeless, covered in cloth. As your spirit wanders freely, allow them to proceed with burial. Your hun, po, and spirit remain still and unmoved. Your form follows the flame and returns; though the blaze may rage, it cannot burn you. When the fire subsides and the smoke clears, no trace of you shall be found.\n\n**Earth Proxy, Fifth**\nThe Center governs *wu* and *ji*, the seat of all spirits. The Three Hun nurture earth, and earth gives birth to all things. Things transform and become *qi*; the Three Hun follow form. The Seven Po accompany the body, preserving my life and destiny. Cultivate earth, and nurturing earth brings forth life. Things transform and take shape; the Four Symbols return to earth. Through earth, life is sustained. Three calls summon its presence; seven invocations return it to the body, dispelling calamity. Heed my incantation, and your form shall shift with your will.\n\n**Incantation:**\nThe *wu* and *ji* of the Center, primordial *qi* concealed within.\nYellow stands firm; through its movement, order is restored.\nCinnabar Yang does not refuse; Vermilion Yin shares its purpose.\nThrough my birth, I attain fulfillment; my four limbs are enriched by earth, lest excess arise.\nSwiftly, swiftly, as the law commands!\n\nInvoke the incantation on a *geng* or *xin* day at the *chen* hour. Light incense and begin the recitation, ensuring no one hears. This may be maintained for forty-nine days. Should misfortune arise, regardless of the hour or whether walking, standing, sitting, or reclining, silently recite it once. Grasp an object, conceal yourself within the earth or a wall, and remain unseen. The object you hold shall serve as your likeness, rising and departing in your stead to evade the cycle of suffering. Once the peril has passed, return to your true form.\n\nThe Five Proxies comprise the method by which immortals conceal themselves in the world. Transmitted through the ages, they must not be divulged—this is the secret truth of cultivation. Should later scholars of resolve undertake this practice, they must recite with unwavering focus, avoiding any transgression. Those who hear of this method yet fail to master it must carefully maintain their recitation, lest they recklessly reveal heavenly secrets.\n\nThe *Concealment Method of the Perfected of Changbai Mountain, Yuan Yangzi*, is imparted to those of the Daoist heart. Follow it faithfully, and its efficacy shall be undeniable.\n\nThus concludes the *Five Proxies Discourse of Yuan Yangzi*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "元阳子五假论 经名：元阳子五假论。 撰人不详。 二篇同卷。 底本出处：《正统道藏》洞神部方法类。 元阳子五假论 夫修身养命、学道求仙志人，若修行未有功行，但存一念，必以成就。 功行未满，但住浮世或有邪魔、魍魉百魅、鬼怪精灵，见入於假，尽乃奔走，不敢奔来，作其患难。 但依吾祝咒，焚香斋戒，静心默念，每假祝咒，各持四十九日。 但有灾厄险难临身，速於默念一遍，以手捉一物而投避。 或作游神，或分形化体，隐入木火之内，钻潜身入金中解，假水中下存溺。 其有灾厄临险，当时投避除。 以是天机，只合口口相传。 余恐在世志学之人，必有悟忘，遂乃录写，传留於世。 勿以泄漏，传薄器之辈、败道之徒。 遇人不得隐匿，先又殃及九祖。 不择人传，毁漏天机，沉埋九族，永为下鬼，不能受生。 金假第一 西方庚辛，白虎之神。 九曜之尊太白，守位紫微灵星。 惟命之主，体髓坚牢，七魄莫离，三呼即至，七召归体。 刀剑分身，接骨续筋。 后以化体，除其苦厄。 听吾祝咒，应命而行。 咒曰：西方庚辛，太微玄真。 内应六腑，化为肺神。 见於无上，游於丹田。 固护我命，用之神仙。 急急如律令勑。",
      "translated_text": "*The Five Simulacra of Master Yuanyang*\n**Text Title:** *The Five Simulacra of Master Yuanyang*\nAuthor unknown. Two chapters in one scroll.\nBase text from: *Daoist Canon of the Zhengtong Era*, *Methods* section of the *Dongshen* Department.\n\nFor those who cultivate the body and nurture life, who study the Dao and seek immortality—if their practice has not yet borne merit, yet they hold but a single thought, they shall surely attain accomplishment. Should their merit remain incomplete, and they dwell in the fleeting world, they may encounter demonic specters, malevolent spirits, ghosts, and spectral beings. These entities, perceiving the simulacrum, will flee in terror, daring not approach to bring harm.\n\nSimply follow my incantations: burn incense, observe abstinence, calm the mind, and silently recite. For each simulacrum, chant the incantation for forty-nine days. Should calamity, peril, or misfortune draw near, swiftly recite it once in silence, grasp an object, and cast it aside to evade. One may roam as a spirit, divide the form, or transform the body, concealing oneself within wood or fire, burrowing into metal to dissolve, or submerging in water to feign drowning. Thus, when disaster or danger approaches, one may instantly cast it aside and escape.\n\nThis is a celestial mechanism, meant to be transmitted only by word of mouth. Yet I fear that earnest seekers in this world may forget, so I have recorded it to leave for posterity. Do not recklessly disclose it to the unworthy, those who debase the Dao. Should you withhold it from those who ought to receive it, misfortune will first befall your nine generations of ancestors. If you transmit it indiscriminately, revealing this celestial secret, your nine clans will be buried in ruin, and you shall forever remain a lowly ghost, unable to receive rebirth.\n\n**First Simulacrum: Metal**\nThe west, *geng* and *xin*, domain of the White Tiger’s spirit.\nThe exalted Venus of the Nine Luminaries, guardian of the Purple Tenuity’s numinous star.\nLord of life, it fortifies the marrow and solidifies the body. The seven *po* souls do not stray; with three calls, it arrives, and with seven summons, it returns to the body.\nIt severs the self with blades, mends bones, and reconnects sinews.\nLater, it transforms the body, dispelling suffering and peril.\nHeed my incantation, and it shall act as commanded.\n\n**Incantation:**\nThe west, *geng* and *xin*, the Mysterious Perfected of the Grand Tenuity.\nWithin, it corresponds to the six viscera, transmuting into the Lung Spirit.\nManifesting in the supreme, roaming the Cinnabar Field.\nIt steadfastly guards my life, serving the immortal’s use.\nSwiftly, swiftly, as the law commands!",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 463,
      "start_sentence": 0,
      "end_sentence": 28,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.283199310302734,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\元阳子五假论.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "其祝咒，庚辛日酉时，焚香起念，不得开口，以舌柱上胶，想念之可以，持四十九日。 如有灾厄，不畎时日行，住坐默想念一遍，以手执刀，任乃分身，并无赤血，虽有白膏，而出凝结不流，过后却返，自然接续归还。 木假第二 东方青龙，属於甲乙。 应春之令，岁星之兵。 能生其气，芳药光荣。 内应肝神，丞相之位。 吾若有难，三呼即现。 分化身形，远游诸处。 要归本位，见物而至。 咒曰：东方甲乙，青龙之室。 金木相形，返为骨肉。 真金镇定，莫离左右。 分身隐匿，思之返至。 急急如律令。",
      "translated_text": "For the incantation, on *geng* and *xin* days at the hour of *you*, burn incense and begin the recitation—do not open the mouth, but press the tongue against the upper palate and contemplate it thus. Maintain this for forty-nine days. Should misfortune or peril arise, regardless of time or place, whether moving or still, silently recite it once. Grasping a blade, freely divide the body; though no red blood flows, only a white essence emerges, congealing without spilling. Afterward, it naturally returns, reconnecting and restoring as before.\n\n**Second Wooden Talisman**\nThe Azure Dragon of the east, belonging to *jia* and *yi*.\nResponding to spring’s command, the celestial host of Jupiter.\nIt generates its *qi*, radiant as fragrant herbs.\nWithin, it corresponds to the Liver Spirit, occupying the office of the Chancellor.\nShould I face peril, with three calls it manifests.\nIt divides and transforms the body, roaming afar.\nTo return to its original place, it appears upon beholding an object.\n\n**Incantation:**\nThe east, *jia* and *yi*, chamber of the Azure Dragon.\nMetal and wood take form, reverting to flesh and bone.\nTrue metal steadfastly guards, never straying from left or right.\nDivide the body and conceal it; through thought, it returns.\nSwiftly, swiftly, as the law commands!",
      "overlap_context": "ers the self with blades, mends bones, and reconnects sinews.\nLater, it transforms the body, dispelling suffering and peril.\nHeed my incantation, and it shall act as commanded.\n\n**Incantation:**\nThe west, *geng* and *xin*, the Mysterious Perfected of the Grand Tenuity.\nWithin, it corresponds to the six viscera, transmuting into the Lung Spirit.\nManifesting in the supreme, roaming the Cinnabar Field.\nIt steadfastly guards my life, serving the immortal’s use.\nSwiftly, swiftly, as the law commands!",
      "start_char": 464,
      "end_char": 691,
      "start_sentence": 29,
      "end_sentence": 43,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.624750137329102,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\元阳子五假论.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "其祝咒，取庚辛日卯时，焚香默念，不令人闻，思之为上，可持四十九日。 如有灾厄，不以时侯晨，速以默念，不俱行住坐外，默念一遍，逢木将身隐於其中，自免灾祸，分身而去。 却要归时，思於旧木，便还归去，返至本处。 水假第三 北方壬癸，亥子之位。 玄武为君，能生万润。 光泽荣溢，内应於肾。 列女之容，性命根宗。 血为水号，变炼精气。 本属是阳，阴中有火，济於浮世。 吾若有灾，三呼应现。 七召随身，入水不溺。 土木扶持，魂魄各居。 三彭自伏，入於九域。 咒曰：星辰之真，玄武随身。 勾陈左助，青龙辅弼。 白虎扶持，腾蛇跨下。 随吾躯形，思之还返。 急急如律令勑。",
      "translated_text": "The incantation is to be recited on a *geng* or *xin* day at the *mao* hour, with incense burned and the words silently murmured, inaudible to others. Thought alone is paramount, and it may be maintained for forty-nine days. Should misfortune arise, regardless of time or season, swiftly recite it in silence—whether walking, standing, or sitting—just once. Upon encountering wood, conceal the body within it to evade disaster, then divide and depart. To return, focus upon the original wood, and it will restore you to your former place.\n\n**Third Water Talisman**\nThe north, *ren* and *gui*, the position of *hai* and *zi*.\nThe Dark Warrior presides, generating myriad moistures.\nIts luster overflows with glory, corresponding within to the Kidney Spirit.\nAdorned as the Lady of the Register, root of life and destiny.\nBlood is called the \"water number,\" transmuting and refining essence-*qi*.\nOriginally of the Yang, it harbors fire within Yin, aiding the floating world.\nShould I face peril, three calls summon its presence.\nSeven invocations follow the body, entering water without drowning.\nEarth and wood sustain it; soul and spirit each reside apart.\nThe Three Peng submit, entering the Nine Realms.\n\n**Incantation:**\nThe Perfected of stars and constellations, the Dark Warrior attends the body.\nThe Curved Array lends left support; the Azure Dragon assists.\nThe White Tiger upholds; the Soaring Serpent mounts beneath.\nFollowing my form, through thought it returns.\nSwiftly, swiftly, as the law commands!",
      "overlap_context": "ying the office of the Chancellor.\nShould I face peril, with three calls it manifests.\nIt divides and transforms the body, roaming afar.\nTo return to its original place, it appears upon beholding an object.\n\n**Incantation:**\nThe east, *jia* and *yi*, chamber of the Azure Dragon.\nMetal and wood take form, reverting to flesh and bone.\nTrue metal steadfastly guards, never straying from left or right.\nDivide the body and conceal it; through thought, it returns.\nSwiftly, swiftly, as the law commands!",
      "start_char": 692,
      "end_char": 959,
      "start_sentence": 44,
      "end_sentence": 62,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.038156270980835,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\元阳子五假论.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "其祝咒，取庚辛日子时，焚香起念，不得开口，只以默念一遍，可持四十九日。 如有灾厄，不以行住坐卧，默念一遍，将身入水，免其灾厄，不以多少日数水下安居。 却要返归，想，於肾气，自以出水，免其灾厄。 火假第四 南方朱雀，位属丙丁。 荧惑惑曜，火神炎盛。 烧除三彭，六神永护。 魂魄澄净，六根坚牢内属心主。 吾若有难，三呼即至，不离左右。 丙丁是火，壬癸是杀。 吾入於假，魂神不朽。 我身是水，我命是土。 土水相刑，火不侵体。 咒曰：南方丙丁，赤龙俱停。 阴神避位，阳官不迎。 思之返至，用之日成。 急急如律令勑。 其祝咒，取庚辛日午时，焚香起念，不令人闻，思之为上，可持四十九日。 如有灾厄，不拘时辰，速入静室中安外，默念祝咒一遍，手握竹木而外，百魅千妖，悉皆而走。 便以闭息绝气，假作身死。 家人不晓，将谓殂身。 任将停於没，以衣盖覆，以衣盖覆，分作游神，任令葬。 其神魂魄，神主默然，而全不动摇。 其体随焰而返，归崁虽盛，不能烧之。 火消姻玲，觅之无踪。 土假第五 中央戊己，万神之位。 三魂养土，土能生物。 物化变气，三魂随形。 七魄逐体，吾全身命。 念土之修，养土能生。 物化变形，四象归土。 得土而生，三呼即至，七召归躯，除其灾厄。 听吾祝咒，随形化体。 咒日：中央戊己，内藏元气。 黄色立坚，运之可理。 丹阳莫辞，朱阴共义。 生我得达，四肢黄益，勿令大起。 急急如律令勑。 其祝咒，取庚辛日辰时，焚香起念，不得人闻，可持四十九日。 如有灾厄，不拘时辰，行住坐外，只用默念一遍，可以捉一物，隐地入墙，人可不见。 其所捉物，代为形影，起而去，免避轮回。 换过难了，却返归还。 右五假篇，是神仙隐世之法，留传於世，不可泄漏，秘密之真修。 如有后学志士，默念修养，坚心持念，无令触犯。 今闻其法终不成，审而持念，念不得乱泄天机。 长白山真人元阳子隐身法，传与有道心人，依此行用，无不验矣。 元阳子五假论竟",
      "translated_text": "To invoke the incantation, choose a *geng* or *xin* day at the *zi* hour. Light incense and begin the recitation, refraining from speaking aloud—only silently intone it once. This may be maintained for forty-nine days. Should misfortune arise, regardless of whether walking, standing, sitting, or reclining, silently recite it once, then enter water, and the calamity shall be averted. There is no limit to the days one may remain submerged in safety. When ready to return, visualize the *qi* of the Kidney, and naturally emerge from the water, free from disaster.\n\n**Fire Proxy, Fourth**\nThe Vermilion Bird of the South governs *bing* and *ding*. Mars blazes fiercely, the Fire Spirit in its full might. It burns away the Three Peng, and the Six Spirits stand eternal guard. The hun and po become pure and clear, the Six Roots firm and unshaken, inwardly aligned with the Heart Lord. Should I face peril, three calls summon its presence, never departing from my side. *Bing* and *ding* are fire; *ren* and *gui* are destruction. I enter the proxy, and my spirit-soul remains undying. My body is water; my life is earth. Earth and water contend, yet fire does not consume me.\n\n**Incantation:**\nThe *bing* and *ding* of the South, the Crimson Dragon attends.\nYin spirits withdraw; Yang officials do not receive.\nThrough thought it returns; through use it fulfills the day.\nSwiftly, swiftly, as the law commands!\n\nInvoke the incantation on a *geng* or *xin* day at the *wu* hour. Light incense and begin the recitation, ensuring no one hears. Silent contemplation is paramount. This may be maintained for forty-nine days. Should misfortune strike, regardless of the hour, swiftly enter a quiet chamber and settle your surroundings. Silently recite the incantation once, grasping bamboo or wood. All demons and malevolent spirits will flee. Then hold your breath and cease all movement, feigning death. Unaware, your family will believe you have passed. Let your body lie as if lifeless, covered in cloth. As your spirit wanders freely, allow them to proceed with burial. Your hun, po, and spirit remain still and unmoved. Your form follows the flame and returns; though the blaze may rage, it cannot burn you. When the fire subsides and the smoke clears, no trace of you shall be found.\n\n**Earth Proxy, Fifth**\nThe Center governs *wu* and *ji*, the seat of all spirits. The Three Hun nurture earth, and earth gives birth to all things. Things transform and become *qi*; the Three Hun follow form. The Seven Po accompany the body, preserving my life and destiny. Cultivate earth, and nurturing earth brings forth life. Things transform and take shape; the Four Symbols return to earth. Through earth, life is sustained. Three calls summon its presence; seven invocations return it to the body, dispelling calamity. Heed my incantation, and your form shall shift with your will.\n\n**Incantation:**\nThe *wu* and *ji* of the Center, primordial *qi* concealed within.\nYellow stands firm; through its movement, order is restored.\nCinnabar Yang does not refuse; Vermilion Yin shares its purpose.\nThrough my birth, I attain fulfillment; my four limbs are enriched by earth, lest excess arise.\nSwiftly, swiftly, as the law commands!\n\nInvoke the incantation on a *geng* or *xin* day at the *chen* hour. Light incense and begin the recitation, ensuring no one hears. This may be maintained for forty-nine days. Should misfortune arise, regardless of the hour or whether walking, standing, sitting, or reclining, silently recite it once. Grasp an object, conceal yourself within the earth or a wall, and remain unseen. The object you hold shall serve as your likeness, rising and departing in your stead to evade the cycle of suffering. Once the peril has passed, return to your true form.\n\nThe Five Proxies comprise the method by which immortals conceal themselves in the world. Transmitted through the ages, they must not be divulged—this is the secret truth of cultivation. Should later scholars of resolve undertake this practice, they must recite with unwavering focus, avoiding any transgression. Those who hear of this method yet fail to master it must carefully maintain their recitation, lest they recklessly reveal heavenly secrets.\n\nThe *Concealment Method of the Perfected of Changbai Mountain, Yuan Yangzi*, is imparted to those of the Daoist heart. Follow it faithfully, and its efficacy shall be undeniable.\n\nThus concludes the *Five Proxies Discourse of Yuan Yangzi*.",
      "overlap_context": "n its presence.\nSeven invocations follow the body, entering water without drowning.\nEarth and wood sustain it; soul and spirit each reside apart.\nThe Three Peng submit, entering the Nine Realms.\n\n**Incantation:**\nThe Perfected of stars and constellations, the Dark Warrior attends the body.\nThe Curved Array lends left support; the Azure Dragon assists.\nThe White Tiger upholds; the Soaring Serpent mounts beneath.\nFollowing my form, through thought it returns.\nSwiftly, swiftly, as the law commands!",
      "start_char": 960,
      "end_char": 1741,
      "start_sentence": 63,
      "end_sentence": 110,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.885802745819092,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\元阳子五假论.txt",
        "category": "方法类"
      }
    }
  ]
}