{
  "source_id": "先天斗母奏告玄科",
  "source_file": "chunked_daozang\\先天斗母奏告玄科.json",
  "total_chunks": 7,
  "total_original_chars": 6228,
  "total_translated_chars": 41255,
  "total_translation_time": 231.40817284584045,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏续道藏\\先天斗母奏告玄科.txt",
    "category": "正统道藏续道藏"
  },
  "full_translation": "**Precelestial Dipper Mother’s Memorial to the Mysterious Rites**\n*Scripture Title:* Precelestial Dipper Mother’s Memorial to the Mysterious Rites. Author unknown, approximately composed between the Song and Yuan dynasties. A liturgical text of the Shenxiao tradition for venerating the Precelestial Dipper Mother. One fascicle. Base text from the *Wanli Continuation of the Daoist Canon*.\n\n---\n\n**Precelestial Dipper Mother’s Memorial to the Mysterious Rites**\n\nThe ritual begins. The Pace of Yu is invoked. The master traces the Nine Phoenix Talismans, flies the incantatory hand seals over the water vessel, and burns the Nine Phoenix Talismans.\n\nI have heard that when the whale’s waves enter the sacred, they dispel the dust of the Five Turbidities; when the phoenix’s script transcends the mundane, it may summon the qi of the Nine Heavens. As the Li fire first ignites, the earthly realm is already purified. Today, I burn incense to summon the Nine Phoenix Generals for Breaking Defilement, the Five Emperors and Five Dragon Lords of the Five Directions, the Lords of Heavenly Virtue and Lunar Virtue, the Mighty Divine Spirits of the Qi of Life and the Qi of Flourishing, the Officers and Soldiers of the Cavernous Talismans and Great Mystery, the Lady of the Flowery Pond for Scriptural Ablutions, the Azure-Water Embroidered-Robe Envoys, and all the officials, generals, officers, and soldiers of the Bureau for Dispelling Malevolence and the Office for Purification. I beseech each to wield their talismans, swords, and staves, descending to infuse my water with true qi, sweeping away defilement this very moment. May a thousand evils retreat without trace, ten thousand perversities vanish without shadow. May they move heaven and earth, stir gods and ghosts. By this power of cleansing and purification, may thunder roar and winds rain, establishing this realm of clarity and stillness. With focused intent, I invoke their awe-inspiring transformations. The scriptures and secret incantations are now solemnly proclaimed.\n\nThe assembly recites the *Purification of Heaven and Earth Mantra* and the *Talisman for Purifying the Altar*. The master silently intones the incantation to transform the altar.\n\nI solemnly command: Let the altar embody the Eight Trigrams, concealing within the revolving jade pivot. Let the Twenty-Eight Constellations be arrayed across the four directions. First, seal the demonic paths; next, leave open the human gate. Above, open the gate of heaven; below, close the door of earth. May malevolence be eradicated, and the Dao’s qi ascend and spread—all in accordance with the primordial decrees.\n\nThe talisman of sincerity is burned. As the jade censer gathers the numinous winds, the curling smoke expresses reverent devotion. The precious characters form flying clouds and talismanic script, conveying the sincerity of this memorial. The work of the heart-ground, the profound transformations of nature—today, I respectfully offer the true talisman into the incense burner. Illuminating the Dao and virtue, uniting the unfathomable yin and yang, what is preserved becomes spirit, what passes is transformed. At the sight of a single wisp of smoke, its might resounds and its numen soars. Already bathed in the assembly of the ten thousand spirits, the celestial winds scatter their traces, the stellar fires are heard from afar. Following the true canon, I now intone the secret incantation.\n\nThe master performs the Three Bows and offers incense. The assembly recites the *Incense Mantra*:\n\nJade radiance scatters its splendor,\nNine qi congeal in the smoke.\nThe fragrant clouds weave densely,\nPiercing straight to the Nine Heavens.\nThe Golden Lad attendant of incense,\nThe Jade Maiden transmitter of words—\nFor this servant, they convey the memorial,\nHeard before the Celestial Emperor.\nAll prayers and vows,\nAre granted as spoken.\n\nThe master performs the Three Bows, kneels to invoke the master, and burns the talisman.\n\nProstrate, I consider: when the Dipper stands in solemn majesty, the sincerity of this memorial—where goodness is master—relies entirely on the master’s guiding power. Without a master, none cross over; only the Dao is followed. Here below, I present my petition.\n\nThe appointed heir and orphaned disciple [Name] reverently burns incense of faith and devoutly memorializes the Three Treasures of Dao, Scriptures, and Master; the Primordial Beginning and the Ten Thousand Spirits; the Supreme Perfected; the Three Realms’ Primordial Lords; the Jade Emperor of the Golden Portal of the Vast Heaven; the Celestial Father and Heavenly Emperor, Lord of the Dharma of the Brahma-Qi Heavenly Sovereign; the Celestial Mother of the Brahma-Qi Heavenly Sovereign; the Heavenly Emperor, Father of the Dipper; the Heavenly Lord of the Dragon Han Era; the Great Emperor of the Purple Tenuity at the Center of Heaven’s North Pole; the Great Emperor of the Celestial Sovereign of the Star Palace of Gouchen; the August Thearch of the Earth, the Queen of the Sacred Soil Who Bears the Law of Heaven; the Perfected King of Divine Empyrean and Great Emperor of Longevity; the Great Emperor of the Eastern Culmen and Azure Brilliance; the Heavenly Worthy of Universal Transformation Through the Thunderous Voice of the Nine Heavens’ Response; the Great Emperor, Ancestor of the Nine Heavens’ Thunder; the Dipper Mother, Heavenly Empress of Purple Radiance; the Great Sage of the Mālaya Heaven, Heavenly Worthy of the Dao Mother of Perfect Illumination; the Great Heavenly Emperor of the Supreme Clarity’s Purple Tenuity and Azure Jade Palace; the Great Emperor of the Six Heavens’ Abyssal Caverns; the Lord Emperor of the Six Waves of Heaven; the Perfected Lord of the Nine Heavens’ Controller of the Han; the Perfected Lord of the Nine Heavens’ Inspector; the Heavenly Emperors of the Myriad Heavens; the Lofty Perfected Who Preside Over the Dharma; the True Lords of the Ten Poles and Ten Floras; the Divine Immortals of the *Scriptures and Registers of the Jeweled Chapters and Precious Repositories*; the Eleven Great Stellar Lords of the Supreme Clarity; the Six Stellar Lords of the Southern Dipper Who Extend Longevity; the Nine August Lords of the Northern Dipper Who Dispel Calamities; the Three Stellar Lords of the Eastern, Western, and Central Dippers; the Myriad Stellar Forms and Hosts of Perfected Beings of the Entire Heavens; the Great Sage of the Celestial Stem and Stellar Lord of Astral Brilliance; the Stellar Lord of My Inborn Destiny in This Life; the Divine Immortals and Myriad Divine Officials Within the Dipper; the Three Great Emperors of the Three Origins and Three Grades; the Perfected Lords of the Northern Culmen, the Celestial Stalwart, and the Celestial Guardian Who Assists the Sage; the Perfected Lord of the Northern Culmen’s Protection and the Sage, the Great Emperor of the Dark Heaven; the Ancestral Master, Supreme Mystery’s Prime Minister, and Perfected Lord of the Orthodox Unity; the Immortal Elder of the Left Palace of the Supreme Ultimate; the Perfected Lord, Master of the True Purity and Bright Dao; the Three Perfected Lords, Ancestral Masters of the Canopy; the Three Mao Lords of the Supreme Clarity Who Govern Life; the Ancestral Master, Fire Master Wang the Perfected Lord; the Perfected Lord, King of Numinous Kindness; the Ancestral Master, Zhang the Perfected Lord of Empty Tranquility; the Ancestral Master, the Realized Man Who Converted the Western Barbarians; the Ancestral Master, the Realized Man Agni; the Ancestral Master, the Iron Ox Sage; the Ancestral Master, the Chan Master Yixing; the Ancestral Master, the Realized Man of Universal Brilliance, Academician of the Hanlin; the Ancestral Master, the White Realized Man of the Purple Clarity and Bright Dao; the Lineage Master, the Lazy Ox Master; the Lineage Master, the Demon-Quelling Female Immortal Master; the Lineage Master, the Great Dharma Master of Pure Far-Reaching Proclamation of the Yuan Reception; the Lineage Master, the Great Dharma Master of Responsive Brilliance; the Great Dharma Master of Kind Brilliance; the Perfected Man of the Upper Officials of Western Shu; the Perfected Man of the Supreme Ultimate’s Thunderous Transcendence; the Perfected Man Zhong of Guozhou, Mighty and Kind; the Perfected Man Liu of the Illuminating Response of the Utmost Tranquility and Perfect Virtue; the Perfected Man Shi of the Iron Mountain of the Flowery Pearl; the Perfected Man Mo of the Moon Tripod, Scattered Officer of Divine Empyrean; the Three Perfected Masters of the Scriptural Preceptors; the Hosts of Immortals Who Transmit and Receive the Orthodox Unity of the Pure Subtlety, Numinous Treasure, and Moral Dao—\n\nI envision the phoenix chariots and crane carriages alighting gracefully upon the altar, the dragon cakes and phoenix teas presented reverently upon the tables. The master’s radiance descends; pure tea is offered.\n\nScattering flowers, the master performs the Three Bows, offers incense, and kneels again.\n\nThe appointed heir and descendant of the Mysterious Lineage, the humble disciple [Name], kowtows and bows twice to memorialize:\n\nProstrate, I pray: may the master’s robes billow like the Dipper’s handle, arriving from the Central Heaven to halt his steps. The brewed tea expresses my mortal sincerity, fulfilling a disciple’s reverence for the master. May the master’s seat be briefly settled, silently aiding the ritual procedures.\n\nProstrate, I reflect: this disciple’s nature is coarse and unworthy, born of the Brahma Palace’s lineage. In ascending lead and descending mercury, I know not the methods of cultivation; in ascending the purple and scaling the clear, I fathom not the principles of memorializing. Relying on the master’s secret guidance, I am thus able to exhaustively proclaim the ritual procedures. Having received the master’s words, I dare not delay in unfolding them.\n\nI humbly memorialize: regarding the intentions and heartfelt sincerity brought forth, I reverently disclose them. I vow to firmly pursue salvation and beneficence, for the matter pertains to cherishing life. This heart’s sincerity brooks no refusal. I respectfully present the Heart Chapter to the Dipper Mother, to be heard in the Great Brahma Heavenly Palace. The memorial and documents are prepared for the Dipper’s府; all must be memorialized according to the Dharma.\n\nMy heartfelt words are revealed; may they reach the lofty and wise. Prostrate, I pray: may boundless compassion be bestowed, and step-by-step guidance be granted. In seeking and responding, may I be corrected by those who possess the Dao. Whatever is prayed for, may it be fulfilled through utmost sincerity.\n\nI earnestly await the master’s decree, to be transmitted to the master’s abode. May the talismanic commands be proclaimed, and my sincere words be made manifest. Humbly awaiting your gracious favor, I dare not presume to express my gratitude. Temporarily stationed at the altar, I preside over the memorial. When the ritual is complete, I will uphold my foolish sincerity to see the master off.\n\nRecite: *The Heavenly Worthy of the Luminous Essential Decree*.\n\nPerform the Three Bows, recite the *Mantra of Golden Light*, the master transforms into a deity, paces the asterisms, and summons the generals.\n\nHeaven and Earth are vast, thus they cherish all things without neglect. The sun and moon are lofty and bright, thus they surely illuminate even the smallest glimmer. Though the cloudy passes are distant, the Heavenly Ears hear from afar. Today, at the Thunder Bureau, I burn incense to summon the talismanic envoys of the Three Realms, the Four Directly Serving Merit Officers, the Earth Gods of the Altar’s Precincts, and the Responsive Spirits. Hear this summons and hasten to the altar to receive instructions.\n\nSwiftly! Secretly recite the mantra: *In the profound and obscure, Heaven and Earth are born together. Scattered, they become qi; gathered, they take form. At a call, they arrive; at a summons, they attend. To disobey my command is to rebel against the Supreme Clarity. Swiftly, swiftly, as decreed by statute and ordinance!*\n\nHaving just issued the summons, I imagine they have already arrived at the altar. I humbly trouble them to carry my incense and ascend to summon: the Yang Spirit of the Nine Heavens’ Command, the Swift Fire Decree Lord Deng; the Yin Thunder Marshal of the Nine Heavens’ Command, the Mighty Officer Lord Xin; the Stellar Lord of the Nine Heavens’ Commanding Stem, the Swift and Responsive Messenger Zhang; the Great Thunder King of the Jade Sound and Brahma Tone; the Myriad Thunder Gods of Proclamation and Transformation; and all the officials, generals, and soldiers of this altar. Hear this summons and hasten to the altar. I reverently request that you array your solemn majesty, marshal your ranks, and receive this purified altar’s talismanic command. Guard the altar’s precincts, manifesting in awe-inspiring radiance to universally sweep away all pernicious influences. Solemnly welcome the Dipper’s Perfected to descend and witness, enabling my heartfelt words to be silently conveyed. Reveal good and ill fortune, and manifest the Dao’s transformations. Each must attend to your duties; none may neglect your posts. Greatly manifest retribution, and act in accordance with the decrees.\n\nThe altar talisman is transformed as all recite the incantation:\nThe jade altar stands towering,\nsoaring high into the Great Tenuity.\nGolden-armored iron cavalry,\na hundred million myriad encircling.\nSweep away demonic vapors,\nexterminate all evil and wrong.\nPurify the cloud-paths,\ndescend to the celestial steps.\nSwiftly, swiftly, as in the statutes and decrees!\n\nProclamation of the Two Brahma Talismans:\nMay our hearts soar beyond the realm of forms to reverently welcome the descent of the Nine Heavens’ chariot. May our gaze be drawn to the sagely ones within the Dipper, our necks leaning upon the messengers to drive their conveyance. Now, as this true talisman is issued, we supplicate the Dipper’s Jade Brahma Honored Heavenly Louluo King, the Wondrous Brahma Honored Heavenly Qieluo King, the Great Brahma Heavenly Palace Direct Talisman Attendant Lin, the Yang Bearer Attendant, the Dhāraṇī Attendant Geng, the Dipper’s Intermediary Steward, the Dipper’s Seven Primes Divine Generals of Life-Prolonging, Longevity-Bestowing, Decline-Supporting, Calamity-Averting, Disaster-Dispersing, Misfortune-Dissolving, and Destiny-Enhancing, the Nine Heavens Flying Swift Response Messenger Zhang Divine Lord, the Dipper’s Karmic Knot-Unraveling and Grievance-Resolving Special Envoy Yin Yuan Master of the Earth Bureau’s Grand Year, the Dipper’s Twenty-Four Calamities-Resolving Numinous Officials, the Seven Primes True Lamps Life-Destiny Divining Divine Clerks, the Eight Gates Vigilant Response Great Gods, the Dipper Mansion’s Dark Ministry Ranked Officials, the Ritual Register’s Transcendent Numinous Officials and Clerks, this altar’s assisting divine soldiers, the deities of this locale’s city god temples and earth-altars, the household incense-and-fire Controller of Destiny and Earth Gods, the talisman-wielders of the Three Realms, the Four Duty Functionaries, and all gods attending the altar to fulfill their duties and respond in reverence.\n\nWe look up, awaiting their manifestation in accordance with the talisman, their numinous efficacy activated by decree, descending to the dharma altar to faithfully transmit our sincere entreaties.\n\nInvocation:\nResponding to the moment, hasten to the perception, Heavenly Worthy.\n\nThe master silently intones:\n\nOṃ li dong, tsa li hūṃ. Oṃ lang □ nie □.\n\nNow issuing the Primordial Descending True Talisman, we reverently invoke:\nThe Jade Brahma Venerable Heavenly Lóluó King,\nThe Wondrous Brahma Venerable Heavenly Qiéluó King,\nThe Great Brahma Heavenly Palace Direct Talisman Forest Messenger,\nThe Dipper’s Yang-Bearing Goat Attendant,\nThe Dhāraṇī Geng Messenger,\nThe Dipper’s Communication Attendant,\nThe Nine Heavens’ Flying Swift Response Messenger, Divine Lord Zhang,\nThe Dipper Mansion’s Dark Ministry Ranked Officials.\n\nHaving bathed in your numinous power and descended, may you deign to heed our humble entreaties.\n\nOn this day, for the purpose of prayer and exorcism, so-and-so prostrates beneath your altar, petitioning the Dipper’s Perfected Ones. We humbly beseech your vast compassion to bestow wondrous salvation, sweeping clean the clouded thoroughfares and manifesting the true realm. May our heartfelt pleas be conveyed, ascending to the Dipper Palace, entreating your gracious light to descend in inspection.\n\nAs the precious tripod’s incense burns, may it rise to meet the hovering cloud-canopy; as the silver lamps’ floral wicks bloom, may they radiate in splendor with the stellar precincts. Transform darkness into light, purge foul vapors into purity.\n\nWe now reverently perform the True Talisman of Illuminating Lamps, the stellar configurations of the Dipper’s handle manifesting fortune and misfortune. May the lush, layered Brahma-qi descend upon five-colored auspicious clouds, may the radiant three-five points of propitious light shift the stars of the entire heavens. May the Dao-qi descend with the incantation, may the true light circulate in accord with the talisman, that our practice may swiftly manifest clear response.\n\nTemporarily pause your celestial adornments, deign to bestow your inspection.\n\nWe reverently perform the ritual in accordance with the Dharma.\n\n**Proclaim the Descending Talisman.**\n\nAll recite the incantation:\nThe Seven Primes descend, heeding our petition.\nThe lamps’ light reveals fortune and misfortune.\nBy the power of the mighty deities,\nmay all wishes align with the heart.\nIn union with the Dao, attaining perfection.\n\n**Invocation:**\nManifesting Wondrous Transformation, Heavenly Worthy.\n\nVisualize in accordance with the secret instructions.\n\nThe assembly recites the Lamp-Transforming Incantation:\nBy the Emperor’s decree,\nthe Dipper’s lamps are kindled.\nThe Seven Stars descend,\nilluminating all beings.\nLeft Assistant and Right Guardian,\nmanifest your numinous power.\nHeavenly Marshal Tianpeng,\ncommands the celestial soldiers.\nHeavenly Thunder Messengers,\nthe Six Jia and Six Ding.\nMysterious Warrior Great Sage,\nthe Three Terraces Venerable Stars.\nSeize illness, dispel misfortune,\nreverse death to restore life.\nHeaven’s mighty power descends,\nslaying and beheading demonic spirits.\nGather the hun-soul, reattach the body,\npacify the seven po.\nWith one illumination of the Dipper’s lamp,\nmay body and dwelling shine brightly.\nSwiftly, swiftly, in accordance with the statutes and ordinances!\n\n**Invocation:**\nUniversally Illuminating Lamp Light, Heavenly Worthy.\n\nMay the lamps’ stellar radiance intermingle with the luminous glow of pearls and jade.\nMay the Yang-Bearing Goat and Dhāraṇī advance with steps upon the jade stairs.\nMay the Communication Attendant precede the Brahma Palace’s chariot.\n\nWe reverently perform the Primordial Descending Numinous Secret Script, hastening to the Dipper’s mouth. May a single sincerity pierce the Primordial Sovereign, ascending to be heard before the Emperor. May the upright qi flow through the original destiny, silently fulfilling the earnestness of our devotion, coming to heal urgent calamities.\n\nMay the cloud paths be purified, celestial processions swiftly traverse the skies; may the heavenly thoroughfares be leveled, rainbow-clad figures descend to the human realm.\n\nDare we not reverently burn the precious script, focusing our intent upon the jade altar? We beseech your gracious light to condescend in descent.\n\nThe master bows thrice and offers incense.\n\nThe officiant, so-and-so, prostrates again, thrice revealing the heart’s incense, most reverently and sincerely memorializing:\nThe Nine Heavens’ Thunder Ancestor Great Emperor,\nThe Great Brahma Precelestial Qian-Primordial Vast Light Dipper Mother, Purple Radiance Golden Venerable Sacred Virtue Heavenly Queen,\nThe Luminous Dao Mother Heavenly Worthy,\nThe Supreme Heavenly Palace of the Great Net Heaven’s Central Heavenly Star Lord,\nThe Illuminator of Myriad Dharmas, Ancestral Master, Northern Culmen Purple Tenuity Great Emperor,\nThe Celestial August Emperor of the Gouchen Star Palace,\nThe Jade Dipper’s Left Palace, Highest Jade August Star Emperor,\nThe Great Numinous Eightfold Radiance Primordial Lady,\nThe Jade Dipper’s Right Palace, Northern Culmen Primordial Minister Great Emperor,\nThe Seven Primes’ Supreme Dao Primordial Lady,\nThe Purple Culmen Heavenly Hero Greedy Wolf Supreme Star Lord,\nThe Purple Culmen Heavenly Task Gigantic Gate Primordial Star Lord,\nThe Purple Culmen Heavenly Pillar Prosperity-Preserving Chaste Star Lord,\nThe Purple Culmen Heavenly Heart Literary Brilliance Binding Star Lord,\nThe Purple Culmen Heavenly Quail Upright Chaste Net Star Lord,\nThe Purple Culmen Heavenly Assistant Military Brilliance Discipline Star Lord,\nThe Purple Culmen Heavenly Impetus Breaking Army Pass Star Lord,\nThe Purple Culmen Heavenly Inner Cavern Brightness Outer Assistant Star Lord,\nThe Purple Culmen Heavenly Hidden Primordial Right Guardian Star Lord,\nThe Nine August Consorts, Concubines, Mothers, and Daughters, Celestial Cadre of the Heavenly Stem Great Sages,\nThe Myriad Perfected Nodal Star Lords,\nThe Supreme Clarity Eleven Great Luminaries Star Lords,\nThe Supreme Clarity Presiding Illuminator of My Natal Destiny Star Lord,\nThe Greater and Lesser Two Cycles, Two Limits, Prosperity Horse, and Two Treasuries Star Lords,\nThe Eight Womb-Born Divine Generals,\nAll the Attendant Illuminators and Presiding Stellar Governors,\nThe Dipper’s Thousand Perfected, Myriad Sages, Arrayed Luminaries, and Host of Perfected Ones.\n\nWe reverently beseech your Dao compassion to condescend in inspection.\n\nWe have heard that the ancestral qi wondrously divides, nurturing the people and establishing the ultimate; the earthly origin conceives substance, the myriad sages’ mother supporting heaven. Entrusted with governance through radiant illumination, relying upon the embrace of the myriad phenomena, we now humbly petition, wholly depending upon your responsive grace.\n\nToday, for so-and-so’s petition of exorcism and deliverance, our duty lies in expounding the teachings, our aspiration in aiding others. Having received the petition, it is fitting to present it in memorial.\n\nWe reflect that our mortal, foolish, and impure nature has yet to penetrate the true; self-examination often lacks cultivation, the profound principles yet to glimpse the subtle and wondrous. We wholly rely upon the Dao’s power to draw forth and guide the ignorant.\n\nReverently considering the Nine Heavens’ Thunder Ancestor, the Great Brahma Precelestial Qian-Primordial Vast Light Dipper Mother, the Purple Radiance Golden Venerable Sacred Virtue Heavenly Queen, the Luminous Dao Mother Heavenly Worthy—your Dharma bodies spanning kalpas, golden lotus auspicious forms, transforming across the Three Realms, upholding the precincts of the Two Emperors, nurturing all beings, governing the Seven Primes’ positions. Your radiance precedes the sun and moon, your majestic might subdues thunder and lightning. All who receive yin and yang equally partake of your transformation and nurturance.\n\nNow, for so-and-so, whose body is afflicted by illness and suffering, whose heart yearns for the true lineage, we pray for blessings to dispel calamities, specially establishing the altar to perform the rites. Looking up, we receive your guidance, achieving the propagation of your teachings. Having received this sincere petition, it is impossible to refuse. We vow to diligently benefit and save, reverently performing the memorial and exorcism.\n\nMay the incense-attending immortal maidens swiftly reach the boundless and pure realm; may the true numina deign to glance downward, temporarily departing the heavenly palace and Brahma abode to descend.\n\nWe, with utmost reverence and awe, kowtow and prostrate again, reverently welcoming the arrival of your sacred presence.\n\nRespectfully stated.\n\nThe ritual assembly recites the *Golden Light Mantra*, burns the *Purple Radiance Cloud Talisman*, while the master visualizes the secret instructions within.\n\nWith both hands forming the *Dipper Mudra*, first welcoming the left *Dipper Mudra*, they pay homage with the *Brahma Sound*:\n\n*Namo ratna traya ya, tara ṇa—*\n*Mālī jīlī tu—*\n*Nīng yīng tí wéi yīng nǎ dōng wéi tuó,*\n*Pó luō yē lī, pó tuō lī, pó luō ā mù qí sà pó tú sè shì,*\n*Pán tuó pán tuó svāhā.*\n\nThen welcoming the right mudra:\n*Oṃ hrīḥ, oṃ hrīḥ hrīḥ hrīḥ,*\n*Oṃ oṃ hrī, oṃ hrī, oṃ hrī,*\n*Hūṃ hūṃ svāhā.*\n\nReturning to the left mudra:\n*Oṃ hūṃ traṭ taṭ ya ta,*\n*Āḷa gā mó, mó la gā mó,*\n*Sū tú mó, zhī pó luō mó,*\n*Mó hē pó luó mó, mó lì— mó,*\n*Oṃ traṭ yē nǎ— mó,*\n*Namo suī dū dì, jí jí fèng Yuánshǐ Shàngdì Pílúzhēnà Dàshèngzhǔ chì.*\n\nThen welcoming the right mudra:\n*Oṃ hūṃ hūṃ traṭ lī lī, traṭ lī lī,*\n*— yē lī svāhā.*\n\nReturning to the left mudra:\n*Oṃ hūṃ traṭ lī, nán— lī,*\n*— — lī lǜ lìng svāhā.*\n\nThen welcoming the right mudra:\n*Oṃ nǎ— — — lú lū svāhā.*\n\nWith hands crossed, they recite the *Eight Buddha-Mothers Mantra*:\n*Nī là mā dū mó,*\n*Bā dǎ hé là dū mó,*\n*Mā gā— bā là dū mó,*\n*— bā là dū mó,*\n*Dá— dá— — dū mó,*\n*Wū dá— dū mó,*\n*Wū bā— nǎ dū mó,*\n*Dá— dá— dū mó,*\n*Oṃ mā lī jiē— svāhā.*\n\nFollowing the left hand’s *Dipper Seal*, they circulate qi seven times:\n*Hā svā— jiē lī mā oṃ.*\n\nReversing with the right hand’s *Dipper Seal*, they circulate qi seven times.\n\nThe master completes the visualization and proceeds:\nBowing, they welcome and invite as prescribed in the ritual protocol.\n\nThe ordained disciple, humble descendant of the mysterious lineage, so-and-so, with sincere devotion prostrates and pays homage:\n\nOn the day when asuras warred in heaven,\nWhen apocalyptic fires raged through the human realm,\nFour heads manifested divine transformations,\nEight arms extended, wielding the power of the Dao.\nEver roaming before the sun and moon,\nStanding alone amidst the three realms of blades and warfare,\nRadiant with awe-inspiring majesty,\nPerfect in wondrous form,\nYou lift sentient beings beyond all suffering.\nThough the vast void may end,\nYour original vow remains boundless.\nGreat Compassion, Great Vow, Great Sage, Great Mercy—\nNine Heavens’ Thunder Ancestor, Great Emperor,\nSolar Palace’s Radiant Emperor,\nLunar Mansion’s Supreme Sovereign,\nHoly and Benevolent Primordial Dipper Mother, Purple Radiance Golden Honored One,\nSacred Virtue’s Resplendent Radiance Heavenly Queen,\nMārīcī, Heaven’s Great Sage, Perfect Illumination Dao Mother, Heavenly Worthy.\n\nThe disciple so-and-so, with sincere devotion, prostrates and pays homage:\n\nIn the Western Land of India,\nAmidst the Great Wisdom Light,\nTrue Emptiness, Wondrous Form—Dharma King and Master,\nSupreme Primordial Heavenly Mother Sovereign,\nWhere golden light blazes, sun and moon dim their splendor,\nWhen the jeweled vajra spins, ghosts and spirits lose their hue.\nManifesting divine traces in the mortal world,\nGuarding the sacred chariot in Jambudvīpa,\nWhen sentient beings face peril,\nMerely invoking the name of the Great Being,\nYou respond to cries and come to relieve suffering.\nGreat Compassion, Great Vow, Great Sage, Great Mercy—\nSacred Virtue’s Resplendent Radiance Heavenly Queen,\nSavior from All Perils, Mārīcī, Heaven’s Great Sage, Perfect Illumination Dao Mother, Heavenly Worthy.\n\nThe ritual protocol concludes.\n\nThe disciple humbly gazes upward, beseeching:\nGreat Compassion, transcending the realm of life and death,\nUtmost Spirit, Supreme Sage, seeing through the machinations of ghosts and spirits,\nWe pray that your divine power shields and protects us,\nDispelling the thousand calamities and ten thousand misfortunes.\nWe, daring to approach your majesty,\nAre overwhelmed with reverence.\nGazing toward heaven, longing for your sacred presence,\nWe earnestly await your gracious command.\nBowing again, we respectfully speak:\nHaving performed the rites of invitation,\nWe trust you will grace us with your presence.\nAs the Dipper’s radiance divides,\nEarth spirits surround your seat,\nJewels align like jade and pearls,\nIlluminating the nine smokes of the central land.\nWith a glance, the Dao is present,\nOffering the first spring grasses of Yangxian.\nBowing in reverence,\nWe present fragrant tea and incense.\n\nScattering flowers.\n\nThe ordained disciple, humble descendant of the mysterious lineage, so-and-so, bows again and petitions:\nTo the Ten Supreme Perfected of the Wondrous Dao of Emptiness,\nBrahma-Qi Dragon Han Heavenly Lords,\nPurple Radiance Golden Honored One, Sacred Virtue Heavenly Queen,\nMārīcī, Heaven’s Great Emperor,\nDipper Mansion’s Stellar Constellations and Luminous Hosts,\nTrue Sovereigns overseeing our destined stars,\nJade Brahma Heaven’s *Louluo* King,\nWondrous Brahma Heaven’s *Qialou* King,\nGreat Brahma Heaven’s Direct Attendant Forest Messengers,\nAncestral Masters, Lineage Masters, Scriptural Masters, and the Three Masters of Transmission,\nThunder Gods, Heavenly Generals, and all mighty numina,\nLamp altars descending to witness,\nAssembled host of perfected beings,\nWe humbly beseech your heavenly compassion to shine forth in clear witness.\n\nWe have heard:\nWhen the primordial qi first unfolded,\nMyriad spirits arrayed themselves.\nHeaven’s height, earth’s depth,\nCombined the yin and yang in their forging.\nSun’s illumination, moon’s presence,\nDivided the marvelous workings of day and night.\nLooking up, we revere the Dipper’s Pole as the true governor of heaven’s work,\nAligned with the Seven Governors and Five Phases,\nPivot of creation,\nCommanding the myriad spirits and ruling the Three Realms,\nGuiding the warp and weft of heaven and earth.\nBowing at the jade steps,\nThe first libation of wine is poured.\n\nScattering flowers.\n\nThe ordained disciple, humble descendant of the mysterious lineage, so-and-so, petitions:\nTo the Ten Supreme Perfected of the Wondrous Dao of Emptiness,\nBrahma-Qi Dragon Han Heavenly Lords,\nPurple Radiance Golden Honored One, Sacred Virtue Heavenly Queen,\nMārīcī, Heaven’s Great Sage, Perfect Illumination Dao Mother, Heavenly Worthy,\nDipper Mansion’s Stellar Constellations and Luminous Hosts,\nTrue Sovereigns overseeing our destined stars,\nJade Brahma Heaven’s *Louluo* King,\nWondrous Brahma Heaven’s *Qialou* King,\nGreat Brahma Heaven’s Direct Attendant Forest Messengers,\nAncestral Masters, Lineage Masters, Scriptural Masters, and the Three Masters of Transmission,\nThunder Gods, Heavenly Generals, and all mighty numina,\nLamp altars descending to witness,\nAssembled host of perfected beings,\nWe humbly beseech your heavenly compassion to shine forth in clear witness.\n\nWe have heard:\nThe Dao expounds the profound and subtle,\nRooted in the primordial qi’s wondrous mystery.\nThe stars’ radiance shines upon the Purple Pole,\nRevealing the Northern Dipper’s palace of the Seven Primes.\nLuminous and bright, the spirit chamber’s numinous clarity,\nDeep and abyssal, the spring’s utmost profundity.\nSilver lamps gleam with splendor,\nJade talismans waft with smoke.\nWe offer refined libations and pure wine,\nStriving for utmost sincerity.\nCrowned with auspicious clouds, draped in sun and moon,\nWe wish to always behold your honored presence.\nThus, we present the fragrant chalice,\nPouring the second libation.\n\nScattering blossoms,\n\nLineage-disciple, the remote descendant of the Mysterious and Profound, your humble servant [Name], with utmost sincerity, reverently invokes the Ten Supreme Perfected of the Wondrous Dao of Emptiness and Non-Being, the Celestial Lord of the Dragon Han and Father of the Dipper, the Great Emperor of Heaven and Mother of the Dipper Mo Li, the Heavenly Honored One of the Luminous Dao and Mother of the Round Brightness, the Nine August Sovereigns of the Northern Dipper’s Great Dao, the Original Stellar Spirits of the Circumpolar Constellations and One’s Own Destiny, the Two August Kings of the Jade Mystery and Brahmā Heavens, the Dipper’s Intermediary Tongue-Containing Deity, the Forest Envoys of the Great Brahmā Heavenly Palace, the Patriarchs and Perfected Masters, the Thunder Gods and Celestial Generals, and the assembled host of perfected beings who descend to witness the lamp altar.\n\nWe humbly beseech the Dao’s compassion to shine forth in clear witness.\n\nWe have heard:\nThe Great Dao is formless, wondrously gathering in emptiness to respond to all things.\nWhen ordinary folk harbor desires, they spread their robes to present their pleas.\nGazing afar at the radiance of the Yellow Dao,\nwe perceive the subtle workings of its vast transformative power.\nWe pray that the Most Perfected may take pity,\nthat the August Emperor may bestow great favor—\nwhat disaster would not be extinguished?\nWhat blessing would not be attained?\nMay we ever rely upon the Dao’s sheltering shade,\nwhere all we face comes to fruition,\nall we do finds harmony.\nIn action and repose alike, may we depend upon your numinous grace.\nThus, with utmost sincerity,\nwe present the three libations of wine.\n\nScattering blossoms,\n\nThe humble servant [Name], lineage-disciple and remote descendant of the Mysterious and Profound, with utmost sincerity, reverently invokes the Nine Heavens’ Thunder Ancestor, the Primordial Heavenly Brahmā of the Qian Origin and Vast Light, the Dipper Mother, the Golden August and Purple Radiance Honored Heavenly Empress of Sagely Virtue, and the Heavenly Honored One of the Luminous Dao and Mother of the Round Brightness.\nWith this true incense,\nwe universally offer homage.\n\nWe have heard:\nUtmost numinosity, utmost sageliness—\neven ghosts and spirits cannot fathom their mystery.\nUtmost sageliness, utmost compassion—\ntranscending the paths of life and death that do not touch them.\nMajestic and resplendent,\ntheir wondrous forms perfectly fused,\nonce in the kingdom ruled by the Zhou,\nthey made vast vows.\nBathed in the warm jade pool,\nthey manifested as golden lotuses,\ngiving birth to nine sons\nwho govern all beings.\nAscending to dwell in the august center,\nthey serve as the wellspring of all life.\nDissolving karmic enmity, releasing opposition—\nlike the nine suns melting the ice mountains.\nDelivering from distress, supporting the frail—\ncausing the Seven Primes to revolve in the depths of the abyss.\nStanding alone amid the calamities of war,\never roaming before the heavens of sun and moon,\nthey guide all beings,\nliberating them from every suffering.\n\nWe have further heard:\nThe August Star of the Purple Tenuity,\nencircled by all stars,\nis the chief of the celestial pivot,\ntruly the office of the tongue and voice.\nSince it deigns to shine upon us,\nhow dare we fail to revere and serve it?\nReflecting humbly,\nwe were wondrously divided from the primordial qi\nand born into the human realm.\nOur form and appearance,\nall depend upon the refining and forging of creation.\nYet as days and months pass,\nwe have strayed from the diligence of incense and offerings.\nEvery action bears a hundred faults,\nno moment holds a single good.\nNow, in feeble offering of our morning audience,\nwe look up to implore your vast protection.\nThus, we present words of self-confession,\nhoping for the blessing of renewal.\nPrecious woods burn as incense,\nlamps gleam with jade-like blossoms.\nWe perform the triple bows to pray for grace,\nknock our heads to the Northern Star in reverence.\nBowing low, we present our sincere devotion;\nlooking up, we long for your pure radiance.\nWe reverently pray that the imperial heart may take pity,\nthat the sagely decree may be proclaimed:\nerasing the ledger of sins,\nextinguishing the roots of evil—\nlet it be announced in the palaces of sun and moon.\nStriking our names from the register of death,\ninscribing them in the celestial records of life—\nlet it shine upon the Dipper’s pole in the immortals’ courts.\nFirmly rooting blessings, forever extinguishing misfortune,\ntruly securing our life’s pulse, eternally extending our lifespan.\nMay salary not be interrupted,\nmay horses not perish in vain.\nLike joined jade disks, like linked pearls,\nmay radiance illumine our bodies.\nMay our destiny be refined, our souls cast anew,\nstrengthened within the fiery prison of the mundane world.\nThrough the four seasons, may joyous qi ever arrive;\nby the seven luminaries, may yin and yang never falter.\nMay wood flourish and metal cut away calamity,\nmay fire’s flames subside and water’s grace flow.\nMay earth’s thickness nurture growth,\nmay qi rise with auspicious omens.\nMay the heavens’ decree avert harm from punishments,\nmay the spirits’ wrath turn away from fury.\nMay fortune, longevity, health, and peace prevail,\nwith no more strange portents arising from the hairline.\nMay nurturing transformation and growth\never receive the descent of our destiny’s true spirits.\nWe, lacking talent and crude in learning,\nhave presumptuously practiced the methods of the teachings.\nOn the day we received the registers and transmitted talismans,\nwe pledged to break the bonds of karmic debt.\nWe vowed to diligently aid beings for the benefit of others,\nand thus permitted memorials to be sent aloft.\nWhen ordinary folk harbor desires,\nheaven’s will must comply.\nAll the original memorials from the heart,\nwe now respectfully proclaim.\n\nProclaim the memorial.\nProstrate in reverence.\n\nUpon reviewing the memorial as submitted, all has been duly reported and presented. The Great Dao is impartial and will surely grant its inspection. Yet this humble servant remains unclear of fortune’s signs and must therefore cast divination and dispatch talismans. May the gracious decree be swiftly bestowed to fulfill the common folk’s devotion. Whether fortune or misfortune, obscurity or adversity, blessing or calamity, doubt or anxiety—may the four directions be clearly designated, and retribution distinctly manifested.\n\nRise and step forth to summon the generals.\nRaise the Talisman of Five-Colored Auspicious Clouds.\nDispatch the memorial talisman.\n\nWe, prostrate in reverence, acknowledge the nine-tiered golden gates of the lofty Brahma-Heaven, where a single intent of sincere devotion exhausts the most reverent and humble of faith. In strict accordance with the sacred canons, we now present and bow before the talismanic memorial. Having already submitted it at the jade steps, it is fitting to burn it at the cloud-post station. Today, we invoke and beseech:\n\nThe Jade Brahma Venerable Heavenly Louluo King,\nThe Wondrous Brahma Venerable Heavenly Qieluo King,\nThe Nine Heavens’ Gang Celestial Swift Retribution Envoys—Messenger Zhang,\nThe Dipper’s Yang-Bearing Tuoluo Twin Envoys,\nThe Dipper’s Intermediary Steward,\nThe Three Realms’ Merit Officers and Talisman Envoys,\nThe Word-Offering Incense Fire Controller of Destiny and Local Earth Deities,\nThe Altar’s Official Generals and Responsive Deities—\n\nUpon hearing this invocation, may they swiftly manifest their majestic power. As there are documents at the altar, they shall now be proclaimed.\n\nProclaim the memorial document.\nUnseal the Heavenly Talisman.\n\nHaving just recited and declared the talismanic memorial, we trust that, bathed in the awe of thunderous might, it will surely receive luminous scrutiny. Yet the Gang winds and vast qi cannot be traversed by mortal form, and the Dipper’s Palace and Thunder Bureau possess divine power that may be reached. We urgently beseech them to ride clouds and mount mist, stride across the void, and soar aloft. With a single cast of the fire bell, its radiance illuminates the eight wilds; with a single flight of thunder’s light, it ascends through the Three Realms. Proceed directly to the Crimson Heaven’s gates, hasten straight to the Purple Ultimate’s walls, open the immortal realm of canonical rites, and reach the golden throne of the august seat. May the sincerity of the common folk be conveyed, imperial edicts brilliantly issued, and the originally descended talismanic memorial swiftly carried upward. The incumbent, reverently bearing the Emperor’s mandate, wields the seal and talismans, holding sole authority over thunder’s commands and governing the Dipper’s Palace in matters of memorials and expiations. Let decrees descend swift as shooting stars, and methods spread rapid as wind and mist. The Three Realms shall not delay, and retribution shall be made manifest in a single moment.\n\nThe dispatch is complete.\n\nThe preceding merits of supplication and offerings, directed upward to the stellar perfected, turning the Dipper and shifting the stars, are all reliant on virtuous deeds. For all who sincerely partake in this rite, we humbly pray that heaven be clear and earth tranquil, all dharmas harmoniously regulated, the world at peace and the state secure, and all beings universally sustained. As for this humble self, may the great creation’s unfathomable grace shield me from unforeseen calamities, and may the sun’s light dispel misfortune, bringing only fitting blessings. Like a river’s flow, may fortune arrive in full, and should peril or danger loom, may it be wholly averted by this support. The preceding merits of supplication and offerings, directed upward to the Dipper’s perfected, aid in the realization of the supreme Dao for all who sincerely partake in this rite.\n\nThe Precelestial Dipper Mother’s Memorial Rite of the Mysterious Canon is now concluded.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "先天斗母奏告玄科 经名：先天斗母奏告玄科。 撰人不详，约出於宋元之际。 系神霄派礼拜先天斗母之科仪。 一卷。 底本出处：《万历续道藏》。 先天斗母奏告玄科 举，步虚，师剔九凤罡，飞诀于水盂，焚九凤符。 臣闻鲸波入圣，能除五浊之尘，凤篆超凡，可降九清之炁，离火初焚，坤舆已肃，以今焚香告召九凤破秽大将军、五方五帝五龙君、天德月德君、生炁旺炁方大力威神、洞罡太玄吏兵华池文浴夫人、沧水绣衣使者、荡凶院解秽局一行官将吏兵，并请各各持符仗剑，降布真炁入吾水中，阞今荡秽，务俾千邪屏迹，万怪灭踪，动天地，感鬼神，藉此蠲洁之力，鼓雷霆，润风雨，建兹清静之场，注想一专，威灵多变，经章秘咒，谨用宣扬。 众诵净天地咒，梵净坛符，师密咒化坛。 谨敕坛存八卦，内藏璇玑，二十八宿，分布四维，先塞鬼路，次留人门，上开天门，下闭地户，凶恶灭迹，道炁升布，一如元降律令。 焚信香符切以玉炉灵风聚烟，式表钦崇之敬，宝字飞云结篆，能通奏告之诚，心地工夫，性渊造化，以今谨奉真符，投入香火炉中，明道德无为，合阴阳不测，存者神，过者化，才瞻一缕之飞，赫厥声擢厥灵，已沐万神之集，天风散影，星火遥闻，谨按真诠，用杨秘咒。 师三礼上香，众诵香咒。 玉华散彩，九炁凝烟。 香云密罗， 径冲九天。 侍香金童，传言玉女。 为臣通奏，上闻帝前。 所祈所愿， 咸赐如言。",
      "translated_text": "**Precelestial Dipper Mother’s Memorial to the Mysterious Rites**\n*Scripture Title:* Precelestial Dipper Mother’s Memorial to the Mysterious Rites. Author unknown, approximately composed between the Song and Yuan dynasties. A liturgical text of the Shenxiao tradition for venerating the Precelestial Dipper Mother. One fascicle. Base text from the *Wanli Continuation of the Daoist Canon*.\n\n---\n\n**Precelestial Dipper Mother’s Memorial to the Mysterious Rites**\n\nThe ritual begins. The Pace of Yu is invoked. The master traces the Nine Phoenix Talismans, flies the incantatory hand seals over the water vessel, and burns the Nine Phoenix Talismans.\n\nI have heard that when the whale’s waves enter the sacred, they dispel the dust of the Five Turbidities; when the phoenix’s script transcends the mundane, it may summon the qi of the Nine Heavens. As the Li fire first ignites, the earthly realm is already purified. Today, I burn incense to summon the Nine Phoenix Generals for Breaking Defilement, the Five Emperors and Five Dragon Lords of the Five Directions, the Lords of Heavenly Virtue and Lunar Virtue, the Mighty Divine Spirits of the Qi of Life and the Qi of Flourishing, the Officers and Soldiers of the Cavernous Talismans and Great Mystery, the Lady of the Flowery Pond for Scriptural Ablutions, the Azure-Water Embroidered-Robe Envoys, and all the officials, generals, officers, and soldiers of the Bureau for Dispelling Malevolence and the Office for Purification. I beseech each to wield their talismans, swords, and staves, descending to infuse my water with true qi, sweeping away defilement this very moment. May a thousand evils retreat without trace, ten thousand perversities vanish without shadow. May they move heaven and earth, stir gods and ghosts. By this power of cleansing and purification, may thunder roar and winds rain, establishing this realm of clarity and stillness. With focused intent, I invoke their awe-inspiring transformations. The scriptures and secret incantations are now solemnly proclaimed.\n\nThe assembly recites the *Purification of Heaven and Earth Mantra* and the *Talisman for Purifying the Altar*. The master silently intones the incantation to transform the altar.\n\nI solemnly command: Let the altar embody the Eight Trigrams, concealing within the revolving jade pivot. Let the Twenty-Eight Constellations be arrayed across the four directions. First, seal the demonic paths; next, leave open the human gate. Above, open the gate of heaven; below, close the door of earth. May malevolence be eradicated, and the Dao’s qi ascend and spread—all in accordance with the primordial decrees.\n\nThe talisman of sincerity is burned. As the jade censer gathers the numinous winds, the curling smoke expresses reverent devotion. The precious characters form flying clouds and talismanic script, conveying the sincerity of this memorial. The work of the heart-ground, the profound transformations of nature—today, I respectfully offer the true talisman into the incense burner. Illuminating the Dao and virtue, uniting the unfathomable yin and yang, what is preserved becomes spirit, what passes is transformed. At the sight of a single wisp of smoke, its might resounds and its numen soars. Already bathed in the assembly of the ten thousand spirits, the celestial winds scatter their traces, the stellar fires are heard from afar. Following the true canon, I now intone the secret incantation.\n\nThe master performs the Three Bows and offers incense. The assembly recites the *Incense Mantra*:\n\nJade radiance scatters its splendor,\nNine qi congeal in the smoke.\nThe fragrant clouds weave densely,\nPiercing straight to the Nine Heavens.\nThe Golden Lad attendant of incense,\nThe Jade Maiden transmitter of words—\nFor this servant, they convey the memorial,\nHeard before the Celestial Emperor.\nAll prayers and vows,\nAre granted as spoken.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 575,
      "start_sentence": 0,
      "end_sentence": 19,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.659757375717163,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\先天斗母奏告玄科.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "法师三礼，长跪启师，焚符。 伏以维壮，有斗当严，奏告之诚，主善为师，全赖提撕之力，无师不度，惟道是从，门下奏受。 具职嗣孤弟子某，谨焚信香，虔诚上奏道经师宝、元始万神、无上至真、三境元尊、昊天金阙玉皇上帝、主法梵炁天皇天父天帝法主、梵炁天皇天母、天帝斗父、龙汉天君、紫微中天北极大帝、勾陈星宫天皇大帝，承天效法后土皇地祇、神霄真王长生大帝、东极青华大帝、九天应元雷声普化天尊、九天雷祖大帝、斗母紫光天后、摩利天大圣圆明道母天尊、上清紫微碧玉宫太一大天帝、六天洞渊大帝、六波天主帝君、九天可韩司丈人真君、九天采访使真君、诸天天帝、主法高真、十极十华真宰、琼章宝藏经箓神仙、上清十一大曜星君、南斗六司延寿星君、北斗九皇解厄星君、东西中三斗星君、普天星象万象群真、天罡大圣奎光星君，道光主照某当生本命星君、斗中神仙诸灵官众、三元三品三官大帝、北极天蓬天猷翊圣真君、北极佑圣真君玄天大帝、祖师泰玄上相正一真君、太极左宫仙翁、真净明道师真君、华盖祖师三仙真君、上清三茅司命真君、祖师火师汪真君、宣封灵惠王真君、祖师虚靖张真君、祖师西番教化真人、祖师阿迦利真人、祖师铁牛圣者、祖师一行禅师、祖师翰林学士普光真人、祖师紫清明道白真人、宗师懒牛先生、宗师降魔女仙师、宗师元受宣教清远大法师、宗师应光大法师、惠光大法师、西蜀上官真人、太极超雷上相万真人、果州威惠锺真人、冲靖至德照应都录刘真人、蕊珠铁山石真人、神霄散吏月鼎莫真人、经籍度师三真人、清微灵宝道德正一承流袭庆历代度人仙众，伏想鸾车鹤驾，翩翩款驻於坛场，凤饼龙团，翼翼荐陈於几席，师驭光临，净茶进献。 举散花，师三礼，上香，再跪。 具职嗣派玄玄孙臣某顿首再拜上告：伏愿飘裾涛斗柄，远从中天弭节而来，瀹茗表凡诚，庸尽弟子事师之敬，暂安师席，默赞教科。 伏念臣某质并樗材，派宗梵府，升铅降汞，罔知修炼之方，遡紫凌清，莫究奏陈之旨，赖师造之密加汲引，故教科之可罄宣扬，既奉来词，敢稽敷露，臣谨奏，为入意向来情悃，恭对披宣，臣誓坚利济，事属好生，详此心诚，不容拒抑，谨为拜贡斗母心章，上闻大梵天宫，具笺斗府牒札，合属依法奏告，情悃已露，谅达高明，伏愿浩浩垂慈，循循善诱，相求相应，就有道而正焉 ，所祷所祈，遂至诚而感也 ，专祈师旨，下谕师垣，承符命以宣扬，俾忱词而昭格，拱希恩贶，敢昧谢言，暂驻坛场，主盟奏告，俟法事之云周，秉愚诚而奉送，臣顿首再拜谨言。 举：开明旨要天尊。 三礼，金光咒，师变神，步呈，召将。 天地广大，故爱物而不遗，日月高明，宜容光而必照，云关虽远，天耳遥闻，以今雷霆都司，焚香关召三界符使、四直功曹、直坛土地只应等神，闻今关召火速到坛，有事指挥。 疾，密咒存至杳杳冥冥，天地同生，散则成炁，聚则成形，闻呼则至，遇召即临，有违吾命，如逆上清，急急如律令！ 适伸召请，想已到坛，仰烦为吾赍香，上召九天运令阳神欻火律令邓天君、九天掌令阴雷都督猛吏辛天君、九天行令罡神飞捷报应使者张神君、玉音大梵雷王，鸣令宣化亿万雷神、本坛官将一切吏兵，闻今关召，疾速到坛，伏请严肃威仪，整齐队仗，承此洁坛符命，翊卫坛场，即化现於威光，普扫除於氛秽，祗迎斗真而降鉴，俾令词悃以潜通，昭示吉凶，显扬道化，各慎尔仪，毋旷厥职，大彰报应，准令奉行。",
      "translated_text": "The master performs the Three Bows, kneels to invoke the master, and burns the talisman.\n\nProstrate, I consider: when the Dipper stands in solemn majesty, the sincerity of this memorial—where goodness is master—relies entirely on the master’s guiding power. Without a master, none cross over; only the Dao is followed. Here below, I present my petition.\n\nThe appointed heir and orphaned disciple [Name] reverently burns incense of faith and devoutly memorializes the Three Treasures of Dao, Scriptures, and Master; the Primordial Beginning and the Ten Thousand Spirits; the Supreme Perfected; the Three Realms’ Primordial Lords; the Jade Emperor of the Golden Portal of the Vast Heaven; the Celestial Father and Heavenly Emperor, Lord of the Dharma of the Brahma-Qi Heavenly Sovereign; the Celestial Mother of the Brahma-Qi Heavenly Sovereign; the Heavenly Emperor, Father of the Dipper; the Heavenly Lord of the Dragon Han Era; the Great Emperor of the Purple Tenuity at the Center of Heaven’s North Pole; the Great Emperor of the Celestial Sovereign of the Star Palace of Gouchen; the August Thearch of the Earth, the Queen of the Sacred Soil Who Bears the Law of Heaven; the Perfected King of Divine Empyrean and Great Emperor of Longevity; the Great Emperor of the Eastern Culmen and Azure Brilliance; the Heavenly Worthy of Universal Transformation Through the Thunderous Voice of the Nine Heavens’ Response; the Great Emperor, Ancestor of the Nine Heavens’ Thunder; the Dipper Mother, Heavenly Empress of Purple Radiance; the Great Sage of the Mālaya Heaven, Heavenly Worthy of the Dao Mother of Perfect Illumination; the Great Heavenly Emperor of the Supreme Clarity’s Purple Tenuity and Azure Jade Palace; the Great Emperor of the Six Heavens’ Abyssal Caverns; the Lord Emperor of the Six Waves of Heaven; the Perfected Lord of the Nine Heavens’ Controller of the Han; the Perfected Lord of the Nine Heavens’ Inspector; the Heavenly Emperors of the Myriad Heavens; the Lofty Perfected Who Preside Over the Dharma; the True Lords of the Ten Poles and Ten Floras; the Divine Immortals of the *Scriptures and Registers of the Jeweled Chapters and Precious Repositories*; the Eleven Great Stellar Lords of the Supreme Clarity; the Six Stellar Lords of the Southern Dipper Who Extend Longevity; the Nine August Lords of the Northern Dipper Who Dispel Calamities; the Three Stellar Lords of the Eastern, Western, and Central Dippers; the Myriad Stellar Forms and Hosts of Perfected Beings of the Entire Heavens; the Great Sage of the Celestial Stem and Stellar Lord of Astral Brilliance; the Stellar Lord of My Inborn Destiny in This Life; the Divine Immortals and Myriad Divine Officials Within the Dipper; the Three Great Emperors of the Three Origins and Three Grades; the Perfected Lords of the Northern Culmen, the Celestial Stalwart, and the Celestial Guardian Who Assists the Sage; the Perfected Lord of the Northern Culmen’s Protection and the Sage, the Great Emperor of the Dark Heaven; the Ancestral Master, Supreme Mystery’s Prime Minister, and Perfected Lord of the Orthodox Unity; the Immortal Elder of the Left Palace of the Supreme Ultimate; the Perfected Lord, Master of the True Purity and Bright Dao; the Three Perfected Lords, Ancestral Masters of the Canopy; the Three Mao Lords of the Supreme Clarity Who Govern Life; the Ancestral Master, Fire Master Wang the Perfected Lord; the Perfected Lord, King of Numinous Kindness; the Ancestral Master, Zhang the Perfected Lord of Empty Tranquility; the Ancestral Master, the Realized Man Who Converted the Western Barbarians; the Ancestral Master, the Realized Man Agni; the Ancestral Master, the Iron Ox Sage; the Ancestral Master, the Chan Master Yixing; the Ancestral Master, the Realized Man of Universal Brilliance, Academician of the Hanlin; the Ancestral Master, the White Realized Man of the Purple Clarity and Bright Dao; the Lineage Master, the Lazy Ox Master; the Lineage Master, the Demon-Quelling Female Immortal Master; the Lineage Master, the Great Dharma Master of Pure Far-Reaching Proclamation of the Yuan Reception; the Lineage Master, the Great Dharma Master of Responsive Brilliance; the Great Dharma Master of Kind Brilliance; the Perfected Man of the Upper Officials of Western Shu; the Perfected Man of the Supreme Ultimate’s Thunderous Transcendence; the Perfected Man Zhong of Guozhou, Mighty and Kind; the Perfected Man Liu of the Illuminating Response of the Utmost Tranquility and Perfect Virtue; the Perfected Man Shi of the Iron Mountain of the Flowery Pearl; the Perfected Man Mo of the Moon Tripod, Scattered Officer of Divine Empyrean; the Three Perfected Masters of the Scriptural Preceptors; the Hosts of Immortals Who Transmit and Receive the Orthodox Unity of the Pure Subtlety, Numinous Treasure, and Moral Dao—\n\nI envision the phoenix chariots and crane carriages alighting gracefully upon the altar, the dragon cakes and phoenix teas presented reverently upon the tables. The master’s radiance descends; pure tea is offered.\n\nScattering flowers, the master performs the Three Bows, offers incense, and kneels again.\n\nThe appointed heir and descendant of the Mysterious Lineage, the humble disciple [Name], kowtows and bows twice to memorialize:\n\nProstrate, I pray: may the master’s robes billow like the Dipper’s handle, arriving from the Central Heaven to halt his steps. The brewed tea expresses my mortal sincerity, fulfilling a disciple’s reverence for the master. May the master’s seat be briefly settled, silently aiding the ritual procedures.\n\nProstrate, I reflect: this disciple’s nature is coarse and unworthy, born of the Brahma Palace’s lineage. In ascending lead and descending mercury, I know not the methods of cultivation; in ascending the purple and scaling the clear, I fathom not the principles of memorializing. Relying on the master’s secret guidance, I am thus able to exhaustively proclaim the ritual procedures. Having received the master’s words, I dare not delay in unfolding them.\n\nI humbly memorialize: regarding the intentions and heartfelt sincerity brought forth, I reverently disclose them. I vow to firmly pursue salvation and beneficence, for the matter pertains to cherishing life. This heart’s sincerity brooks no refusal. I respectfully present the Heart Chapter to the Dipper Mother, to be heard in the Great Brahma Heavenly Palace. The memorial and documents are prepared for the Dipper’s府; all must be memorialized according to the Dharma.\n\nMy heartfelt words are revealed; may they reach the lofty and wise. Prostrate, I pray: may boundless compassion be bestowed, and step-by-step guidance be granted. In seeking and responding, may I be corrected by those who possess the Dao. Whatever is prayed for, may it be fulfilled through utmost sincerity.\n\nI earnestly await the master’s decree, to be transmitted to the master’s abode. May the talismanic commands be proclaimed, and my sincere words be made manifest. Humbly awaiting your gracious favor, I dare not presume to express my gratitude. Temporarily stationed at the altar, I preside over the memorial. When the ritual is complete, I will uphold my foolish sincerity to see the master off.\n\nRecite: *The Heavenly Worthy of the Luminous Essential Decree*.\n\nPerform the Three Bows, recite the *Mantra of Golden Light*, the master transforms into a deity, paces the asterisms, and summons the generals.\n\nHeaven and Earth are vast, thus they cherish all things without neglect. The sun and moon are lofty and bright, thus they surely illuminate even the smallest glimmer. Though the cloudy passes are distant, the Heavenly Ears hear from afar. Today, at the Thunder Bureau, I burn incense to summon the talismanic envoys of the Three Realms, the Four Directly Serving Merit Officers, the Earth Gods of the Altar’s Precincts, and the Responsive Spirits. Hear this summons and hasten to the altar to receive instructions.\n\nSwiftly! Secretly recite the mantra: *In the profound and obscure, Heaven and Earth are born together. Scattered, they become qi; gathered, they take form. At a call, they arrive; at a summons, they attend. To disobey my command is to rebel against the Supreme Clarity. Swiftly, swiftly, as decreed by statute and ordinance!*\n\nHaving just issued the summons, I imagine they have already arrived at the altar. I humbly trouble them to carry my incense and ascend to summon: the Yang Spirit of the Nine Heavens’ Command, the Swift Fire Decree Lord Deng; the Yin Thunder Marshal of the Nine Heavens’ Command, the Mighty Officer Lord Xin; the Stellar Lord of the Nine Heavens’ Commanding Stem, the Swift and Responsive Messenger Zhang; the Great Thunder King of the Jade Sound and Brahma Tone; the Myriad Thunder Gods of Proclamation and Transformation; and all the officials, generals, and soldiers of this altar. Hear this summons and hasten to the altar. I reverently request that you array your solemn majesty, marshal your ranks, and receive this purified altar’s talismanic command. Guard the altar’s precincts, manifesting in awe-inspiring radiance to universally sweep away all pernicious influences. Solemnly welcome the Dipper’s Perfected to descend and witness, enabling my heartfelt words to be silently conveyed. Reveal good and ill fortune, and manifest the Dao’s transformations. Each must attend to your duties; none may neglect your posts. Greatly manifest retribution, and act in accordance with the decrees.",
      "overlap_context": "lowing the true canon, I now intone the secret incantation.\n\nThe master performs the Three Bows and offers incense. The assembly recites the *Incense Mantra*:\n\nJade radiance scatters its splendor,\nNine qi congeal in the smoke.\nThe fragrant clouds weave densely,\nPiercing straight to the Nine Heavens.\nThe Golden Lad attendant of incense,\nThe Jade Maiden transmitter of words—\nFor this servant, they convey the memorial,\nHeard before the Celestial Emperor.\nAll prayers and vows,\nAre granted as spoken.",
      "start_char": 576,
      "end_char": 1928,
      "start_sentence": 20,
      "end_sentence": 32,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 48.87974953651428,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\先天斗母奏告玄科.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "化结坛符，众唪咒： 玉坛巍巍，高耸太微。 金甲铁骑， 百亿万围。 扫除妖氛，剿灭邪非。 肃清云路，下降天墀。 急急如律令！ 告二梵符 伏愿心驰象外之天，敬迓九天而降驾，引睇斗中之圣，项凭使者以驱车，以今颁告真符，上请斗中玉梵尊天喽啰王、妙梵尊天伽喽王、大梵天宫直符林使者、擎羊杨使者、陀罗耿使者、斗中通事舍人、斗中延生保命扶衰度厄消灾散祸益算七元神将、九天飞捷报应使者张神君、斗下解冤结颛使者地司太岁殷元师、斗中解二十四厄灵官、七元真灯掌课命神吏、八门警策报应大神、斗府玄曹列职官众、法箓中仙灵官吏、本坛将佐神兵、本属城隍庙社之神、家居香火司命土地等神、三界符者、四值功曹、临坛效职祗应等神，仰望随符显化，准敕通灵，下降法坛，通传诚悃。 举：随机赴感天尊。 师密念：",
      "translated_text": "The altar talisman is transformed as all recite the incantation:\nThe jade altar stands towering,\nsoaring high into the Great Tenuity.\nGolden-armored iron cavalry,\na hundred million myriad encircling.\nSweep away demonic vapors,\nexterminate all evil and wrong.\nPurify the cloud-paths,\ndescend to the celestial steps.\nSwiftly, swiftly, as in the statutes and decrees!\n\nProclamation of the Two Brahma Talismans:\nMay our hearts soar beyond the realm of forms to reverently welcome the descent of the Nine Heavens’ chariot. May our gaze be drawn to the sagely ones within the Dipper, our necks leaning upon the messengers to drive their conveyance. Now, as this true talisman is issued, we supplicate the Dipper’s Jade Brahma Honored Heavenly Louluo King, the Wondrous Brahma Honored Heavenly Qieluo King, the Great Brahma Heavenly Palace Direct Talisman Attendant Lin, the Yang Bearer Attendant, the Dhāraṇī Attendant Geng, the Dipper’s Intermediary Steward, the Dipper’s Seven Primes Divine Generals of Life-Prolonging, Longevity-Bestowing, Decline-Supporting, Calamity-Averting, Disaster-Dispersing, Misfortune-Dissolving, and Destiny-Enhancing, the Nine Heavens Flying Swift Response Messenger Zhang Divine Lord, the Dipper’s Karmic Knot-Unraveling and Grievance-Resolving Special Envoy Yin Yuan Master of the Earth Bureau’s Grand Year, the Dipper’s Twenty-Four Calamities-Resolving Numinous Officials, the Seven Primes True Lamps Life-Destiny Divining Divine Clerks, the Eight Gates Vigilant Response Great Gods, the Dipper Mansion’s Dark Ministry Ranked Officials, the Ritual Register’s Transcendent Numinous Officials and Clerks, this altar’s assisting divine soldiers, the deities of this locale’s city god temples and earth-altars, the household incense-and-fire Controller of Destiny and Earth Gods, the talisman-wielders of the Three Realms, the Four Duty Functionaries, and all gods attending the altar to fulfill their duties and respond in reverence.\n\nWe look up, awaiting their manifestation in accordance with the talisman, their numinous efficacy activated by decree, descending to the dharma altar to faithfully transmit our sincere entreaties.\n\nInvocation:\nResponding to the moment, hasten to the perception, Heavenly Worthy.\n\nThe master silently intones:",
      "overlap_context": "r ranks, and receive this purified altar’s talismanic command. Guard the altar’s precincts, manifesting in awe-inspiring radiance to universally sweep away all pernicious influences. Solemnly welcome the Dipper’s Perfected to descend and witness, enabling my heartfelt words to be silently conveyed. Reveal good and ill fortune, and manifest the Dao’s transformations. Each must attend to your duties; none may neglect your posts. Greatly manifest retribution, and act in accordance with the decrees.",
      "start_char": 1929,
      "end_char": 2275,
      "start_sentence": 33,
      "end_sentence": 43,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.397480010986328,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\先天斗母奏告玄科.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "唵哩咚 咤哩吽 唵啷□啮□ 适颁元降真符，上请玉梵尊天喽啰王、妙梵尊天伽喽王、大梵天宫直符林使者、斗中擎羊杨使者、陀罗耿使者、斗中通事舍人、九天飞捷报应使者张神君、斗府玄曹列职官众，既沐威神而下降，愿听凡悃以告陈，以今奉为祈禳，某皈投坛下，奏告斗真，仰冀洪慈，曲垂妙济，愿为扫荡云衢，变现真境，通传情悃，上达斗宫，乞赐恩光，俯垂降鉴，宝鼎香焚，高接徘徊之云盖，银缸花结，交辉灿烂之星垣，化暗昧而作光明，蠲氛秽而为清净，臣谨告行燃灯真符，法像星罡，显明休咎，伏愿蓊郁百千重之梵炁，飞来五色之祥云，荧煌三五点之祥光，移下一天之星斗，道炁随咒而下降，真光合符以周流，庶俾行持，立彰昭报，暂停仙佩，特赐鉴观，臣谨虔恭告行如法。 告星坦符。 众念咒： 七元下降，准臣告闻，灯光明暗，知吉知凶，威神之力，万愿从心，与道合真， 举：阐扬妙化天尊。 存想在秘旨内。 法众念变灯咒： 上帝有敕，点发斗灯。 七星来降， 照护群生。 左辅右弼，显现威灵。 天蓬元帅，统领天兵。 天雷使者， 六甲六丁。 玄武大圣，三台尊星。 摄病除祸，回死作生。 天降威力， 诛斩妖精。 收魂附体，七魄安宁。 斗灯一照，身宅光明。 急急如律令！ 举：灯光普照天尊 伏愿灯光星彩，交辉珠璧之光，擎羊陀罗，特进瑶阶之步，通事舍人，前驱梵府之车，臣谨告行元降通灵秘篆，速诣斗口，一诚实贯於元皇，上闻帝前，正炁流通於原命，默副皈依之恳，来医急难之灾，云路肃清，仙仗交驰於空际，天衢平垣，霓裳下降於人间，臣敢不恭焚宝篆，注想瑶坛，愿赐恩光，曲垂降驾。 师三礼上香。 具位臣某再拜，三露心香，至恭虔诚上奏九天雷祖大帝、大梵先天乾元巨光斗母紫光金尊圣德天后、圆明道母天尊、太罗天上太虚宫中中天星主、照万法祖师北极紫微太皇大帝、勾陈星宫天皇大帝、玉斗左宫高上玉皇尊星大帝、大灵八景元君、玉斗右宫北极元卿大帝，七元上道元君、紫极天英贪狼太星君、紫极天任巨门元星君、紫极天柱禄存贞星君、紫极天心文昌纽星君、紫极天禽廉贞纲星君、紫极天辅武曲纪星君、紫极天冲破军关星君、紫极天内洞明外辅星君、紫极天蓬隐元右弼星君、九皇夫人妃嫔母女仙眷天罡大圣、万真节度星君、上清十一大曜星君、上清主照某当生本命星君、大小二运二限禄马二库星君、胎生八位神将、旁临正照一切星宰、斗中千真万圣列曜群真，恭望道慈，俯垂降鉴，臣闻祖炁妙分，毓生民而立极，坤元孕质，万圣母以天，属统御於光踱，赖包涵於万汇，几兹折恳，全仗感孚，以今某投旬禳度事，臣职惟演教，志在济人，既领来词，理宜敷奏，伏念臣凡愚浊质，体未洞真，省躬每缺於熏修，至理未窥於窍妙，全资道力，汲引愚蒙，恭惟九天雷祖、大梵先天乾元巨光斗母、紫光金尊圣德天后、圆明道母天尊，浩劫法身，金莲瑞相，化形三界，总持二帝之垣，子育群生，宰制七元之位，光耀前游於日月，威芒下制於雷霆，凡禀阴阳，均沾化育，今为某身婴疾患，心慕真宗，祈降福以消灾，特建坛而阐事，仰承鋾铸，获遂揄扬，兹领词忱，理难抑拒，誓勤利济，恪为奏禳，伏愿仙女侍香，径达无为清虚之境，真灵下盼，暂离天宫梵府而来，臣诚惶诚恐，稽首顿首再拜，恭迎圣驾之至，谨言。",
      "translated_text": "Oṃ li dong, tsa li hūṃ. Oṃ lang □ nie □.\n\nNow issuing the Primordial Descending True Talisman, we reverently invoke:\nThe Jade Brahma Venerable Heavenly Lóluó King,\nThe Wondrous Brahma Venerable Heavenly Qiéluó King,\nThe Great Brahma Heavenly Palace Direct Talisman Forest Messenger,\nThe Dipper’s Yang-Bearing Goat Attendant,\nThe Dhāraṇī Geng Messenger,\nThe Dipper’s Communication Attendant,\nThe Nine Heavens’ Flying Swift Response Messenger, Divine Lord Zhang,\nThe Dipper Mansion’s Dark Ministry Ranked Officials.\n\nHaving bathed in your numinous power and descended, may you deign to heed our humble entreaties.\n\nOn this day, for the purpose of prayer and exorcism, so-and-so prostrates beneath your altar, petitioning the Dipper’s Perfected Ones. We humbly beseech your vast compassion to bestow wondrous salvation, sweeping clean the clouded thoroughfares and manifesting the true realm. May our heartfelt pleas be conveyed, ascending to the Dipper Palace, entreating your gracious light to descend in inspection.\n\nAs the precious tripod’s incense burns, may it rise to meet the hovering cloud-canopy; as the silver lamps’ floral wicks bloom, may they radiate in splendor with the stellar precincts. Transform darkness into light, purge foul vapors into purity.\n\nWe now reverently perform the True Talisman of Illuminating Lamps, the stellar configurations of the Dipper’s handle manifesting fortune and misfortune. May the lush, layered Brahma-qi descend upon five-colored auspicious clouds, may the radiant three-five points of propitious light shift the stars of the entire heavens. May the Dao-qi descend with the incantation, may the true light circulate in accord with the talisman, that our practice may swiftly manifest clear response.\n\nTemporarily pause your celestial adornments, deign to bestow your inspection.\n\nWe reverently perform the ritual in accordance with the Dharma.\n\n**Proclaim the Descending Talisman.**\n\nAll recite the incantation:\nThe Seven Primes descend, heeding our petition.\nThe lamps’ light reveals fortune and misfortune.\nBy the power of the mighty deities,\nmay all wishes align with the heart.\nIn union with the Dao, attaining perfection.\n\n**Invocation:**\nManifesting Wondrous Transformation, Heavenly Worthy.\n\nVisualize in accordance with the secret instructions.\n\nThe assembly recites the Lamp-Transforming Incantation:\nBy the Emperor’s decree,\nthe Dipper’s lamps are kindled.\nThe Seven Stars descend,\nilluminating all beings.\nLeft Assistant and Right Guardian,\nmanifest your numinous power.\nHeavenly Marshal Tianpeng,\ncommands the celestial soldiers.\nHeavenly Thunder Messengers,\nthe Six Jia and Six Ding.\nMysterious Warrior Great Sage,\nthe Three Terraces Venerable Stars.\nSeize illness, dispel misfortune,\nreverse death to restore life.\nHeaven’s mighty power descends,\nslaying and beheading demonic spirits.\nGather the hun-soul, reattach the body,\npacify the seven po.\nWith one illumination of the Dipper’s lamp,\nmay body and dwelling shine brightly.\nSwiftly, swiftly, in accordance with the statutes and ordinances!\n\n**Invocation:**\nUniversally Illuminating Lamp Light, Heavenly Worthy.\n\nMay the lamps’ stellar radiance intermingle with the luminous glow of pearls and jade.\nMay the Yang-Bearing Goat and Dhāraṇī advance with steps upon the jade stairs.\nMay the Communication Attendant precede the Brahma Palace’s chariot.\n\nWe reverently perform the Primordial Descending Numinous Secret Script, hastening to the Dipper’s mouth. May a single sincerity pierce the Primordial Sovereign, ascending to be heard before the Emperor. May the upright qi flow through the original destiny, silently fulfilling the earnestness of our devotion, coming to heal urgent calamities.\n\nMay the cloud paths be purified, celestial processions swiftly traverse the skies; may the heavenly thoroughfares be leveled, rainbow-clad figures descend to the human realm.\n\nDare we not reverently burn the precious script, focusing our intent upon the jade altar? We beseech your gracious light to condescend in descent.\n\nThe master bows thrice and offers incense.\n\nThe officiant, so-and-so, prostrates again, thrice revealing the heart’s incense, most reverently and sincerely memorializing:\nThe Nine Heavens’ Thunder Ancestor Great Emperor,\nThe Great Brahma Precelestial Qian-Primordial Vast Light Dipper Mother, Purple Radiance Golden Venerable Sacred Virtue Heavenly Queen,\nThe Luminous Dao Mother Heavenly Worthy,\nThe Supreme Heavenly Palace of the Great Net Heaven’s Central Heavenly Star Lord,\nThe Illuminator of Myriad Dharmas, Ancestral Master, Northern Culmen Purple Tenuity Great Emperor,\nThe Celestial August Emperor of the Gouchen Star Palace,\nThe Jade Dipper’s Left Palace, Highest Jade August Star Emperor,\nThe Great Numinous Eightfold Radiance Primordial Lady,\nThe Jade Dipper’s Right Palace, Northern Culmen Primordial Minister Great Emperor,\nThe Seven Primes’ Supreme Dao Primordial Lady,\nThe Purple Culmen Heavenly Hero Greedy Wolf Supreme Star Lord,\nThe Purple Culmen Heavenly Task Gigantic Gate Primordial Star Lord,\nThe Purple Culmen Heavenly Pillar Prosperity-Preserving Chaste Star Lord,\nThe Purple Culmen Heavenly Heart Literary Brilliance Binding Star Lord,\nThe Purple Culmen Heavenly Quail Upright Chaste Net Star Lord,\nThe Purple Culmen Heavenly Assistant Military Brilliance Discipline Star Lord,\nThe Purple Culmen Heavenly Impetus Breaking Army Pass Star Lord,\nThe Purple Culmen Heavenly Inner Cavern Brightness Outer Assistant Star Lord,\nThe Purple Culmen Heavenly Hidden Primordial Right Guardian Star Lord,\nThe Nine August Consorts, Concubines, Mothers, and Daughters, Celestial Cadre of the Heavenly Stem Great Sages,\nThe Myriad Perfected Nodal Star Lords,\nThe Supreme Clarity Eleven Great Luminaries Star Lords,\nThe Supreme Clarity Presiding Illuminator of My Natal Destiny Star Lord,\nThe Greater and Lesser Two Cycles, Two Limits, Prosperity Horse, and Two Treasuries Star Lords,\nThe Eight Womb-Born Divine Generals,\nAll the Attendant Illuminators and Presiding Stellar Governors,\nThe Dipper’s Thousand Perfected, Myriad Sages, Arrayed Luminaries, and Host of Perfected Ones.\n\nWe reverently beseech your Dao compassion to condescend in inspection.\n\nWe have heard that the ancestral qi wondrously divides, nurturing the people and establishing the ultimate; the earthly origin conceives substance, the myriad sages’ mother supporting heaven. Entrusted with governance through radiant illumination, relying upon the embrace of the myriad phenomena, we now humbly petition, wholly depending upon your responsive grace.\n\nToday, for so-and-so’s petition of exorcism and deliverance, our duty lies in expounding the teachings, our aspiration in aiding others. Having received the petition, it is fitting to present it in memorial.\n\nWe reflect that our mortal, foolish, and impure nature has yet to penetrate the true; self-examination often lacks cultivation, the profound principles yet to glimpse the subtle and wondrous. We wholly rely upon the Dao’s power to draw forth and guide the ignorant.\n\nReverently considering the Nine Heavens’ Thunder Ancestor, the Great Brahma Precelestial Qian-Primordial Vast Light Dipper Mother, the Purple Radiance Golden Venerable Sacred Virtue Heavenly Queen, the Luminous Dao Mother Heavenly Worthy—your Dharma bodies spanning kalpas, golden lotus auspicious forms, transforming across the Three Realms, upholding the precincts of the Two Emperors, nurturing all beings, governing the Seven Primes’ positions. Your radiance precedes the sun and moon, your majestic might subdues thunder and lightning. All who receive yin and yang equally partake of your transformation and nurturance.\n\nNow, for so-and-so, whose body is afflicted by illness and suffering, whose heart yearns for the true lineage, we pray for blessings to dispel calamities, specially establishing the altar to perform the rites. Looking up, we receive your guidance, achieving the propagation of your teachings. Having received this sincere petition, it is impossible to refuse. We vow to diligently benefit and save, reverently performing the memorial and exorcism.\n\nMay the incense-attending immortal maidens swiftly reach the boundless and pure realm; may the true numina deign to glance downward, temporarily departing the heavenly palace and Brahma abode to descend.\n\nWe, with utmost reverence and awe, kowtow and prostrate again, reverently welcoming the arrival of your sacred presence.\n\nRespectfully stated.",
      "overlap_context": "ntroller of Destiny and Earth Gods, the talisman-wielders of the Three Realms, the Four Duty Functionaries, and all gods attending the altar to fulfill their duties and respond in reverence.\n\nWe look up, awaiting their manifestation in accordance with the talisman, their numinous efficacy activated by decree, descending to the dharma altar to faithfully transmit our sincere entreaties.\n\nInvocation:\nResponding to the moment, hasten to the perception, Heavenly Worthy.\n\nThe master silently intones:",
      "start_char": 2275,
      "end_char": 3591,
      "start_sentence": 44,
      "end_sentence": 69,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.06353950500488,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\先天斗母奏告玄科.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "法众念金光咒，焚紫光云篆，师存想秘旨内。 两手握斗诀，迎左斗诀，礼梵音： 哪嗼啰咀哪，哆啰□□，嚤哩吱哩咜□，咛嘤啼唯嘤哪咚唯陀，嘙啰吔哩，嘙咜哩，嘙啰啊目祈萨嘙徒瑟誓，盘陀盘陀娑诃。 迎右诀 唵哩吽，唵哩吽哩吽，唵唵哩，唵哩，唵哩，吽吽娑诃。 迎左诀 唵吽咤怛呮陀，阿啰迦嚤，摩啰迦摩，苏屠摩，吱嘙啰摩，摩诃婆罗摩，摩利□摩，唵怛吔哪□摩，囔谟粹都帝急急奉 元始上帝毗卢遮那大圣主敕。 迎右诀 唵吽吽咤哩哩，咤哩哩，□吔哩娑诃，　　迎左诀 唵吽咤哩，喃□哩，□□哩律令娑诃， 迎右诀 唵哪□□□嚧噜娑婆诃，两手交合念八佛母咒 你辣吗都摩，巴打曷刺都摩， 吗嘎□叭辣都摩，□叭辣都摩， 哒□哒□□都摩，呜哒□都摩， 呜叭□哪都摩，哒□哒□都摩， 唵吗哩嗟□娑诃 顺　左手斗印一炁七遍 诃娑□嗟哩吗唵。 逆　右手斗印一炁七遍。 师存想完　却：礼　迎请礼诰如法 嗣教玄玄孙臣某志心皈命礼： 天上修罗交战日，人间劫火洞然时，四头应化显神通，八臂垂雄施道力，常游日月二天前，独立刀兵三界内，威光赫奕，妙相圆融，接能众生超离诸苦，太虚有尽，本愿无穷，大悲大愿大圣大慈九天雷祖大帝，日宫太阳帝君，月府太阴皇君，圣惠先天斗母紫光金尊，圣德巨光天后，摩利天大圣圆明道母天尊。 臣某等志心皈命礼： 西天竺国、大智光中，真空妙相法王师、无上玄元天母主，金光烁处，日月潜辉，宝杵旋时，鬼神失色，显灵踪於尘世，卫圣驾於闱浮，众生有难，若称名大士，寻声来救苦，大悲大愿大圣大慈圣德巨光天后、救一切难摩利天大圣圆明道母天尊。 礼诰完。 臣恭望大慈大悲，超生死不相干之地，至灵至圣，了鬼神窥不破之机，伏愿神通加护我，千灾万祸悉消除，臣干冒威严，下情无任不胜，瞻天望圣激切，祈恳俯俟恩命之至，再拜谨言，适伸拜请，谅沐光临，伏以斗极分辉，地神拥座，珠联璧合，照齐州九点之烟，目击道存，进阳羡先春之草，恭祈顿首，奉献香茶。 散花 嗣教玄玄孙臣某再拜，上启虚无妙道十极高真、梵炁龙汉天君、紫光金尊圣德天后、摩利天大帝、斗府星垣列曜群真、本命元辰照临真宰、玉梵尊天喽啰王、妙梵尊天伽喽王、大梵天宫直符林使者、祖师宗师经籍度三师列位真人、雷神天将一切威灵，灯筵降鉴与会众真，恭望天慈洞垂昭鉴。 臣闻一炁肇开，万灵布列，天高地厚，合阴阳掏铸之功。 日照月临，分昼夜运行之妙，仰惟斗极实宰天功，同七政而共五行，枢机造化，统万灵而威三界，纲纪乾坤，拜首玉阶，酒行初献。 散花 嗣教玄玄孙臣某，上启虚无妙道十极高真、梵炁龙汉天君、紫光金尊圣德天后、摩利天大圣圆明道母天尊、斗府星垣列曜群真，本命元辰临照真宰、玉梵尊天喽啰王、妙梵尊天#1喽王、大梵天宫直符林使者、祖师宗师经籍度三师真人、雷神天将一切威灵、灯筵降鉴与会群真，恭望天慈洞垂照鉴。 臣闻道演玄微，本一炁先天之妙，星辉紫极，见七元北斗之宫，昭昭神室之灵明，洞洞泉极之渊邃，银缸焕彩，玉篆腾烟，荐蕴藻酌演污，惟欲精於诚意，冠祥云披日月，愿常见於尊仪，爰奉芳樽，酒行亚献。",
      "translated_text": "The ritual assembly recites the *Golden Light Mantra*, burns the *Purple Radiance Cloud Talisman*, while the master visualizes the secret instructions within.\n\nWith both hands forming the *Dipper Mudra*, first welcoming the left *Dipper Mudra*, they pay homage with the *Brahma Sound*:\n\n*Namo ratna traya ya, tara ṇa—*\n*Mālī jīlī tu—*\n*Nīng yīng tí wéi yīng nǎ dōng wéi tuó,*\n*Pó luō yē lī, pó tuō lī, pó luō ā mù qí sà pó tú sè shì,*\n*Pán tuó pán tuó svāhā.*\n\nThen welcoming the right mudra:\n*Oṃ hrīḥ, oṃ hrīḥ hrīḥ hrīḥ,*\n*Oṃ oṃ hrī, oṃ hrī, oṃ hrī,*\n*Hūṃ hūṃ svāhā.*\n\nReturning to the left mudra:\n*Oṃ hūṃ traṭ taṭ ya ta,*\n*Āḷa gā mó, mó la gā mó,*\n*Sū tú mó, zhī pó luō mó,*\n*Mó hē pó luó mó, mó lì— mó,*\n*Oṃ traṭ yē nǎ— mó,*\n*Namo suī dū dì, jí jí fèng Yuánshǐ Shàngdì Pílúzhēnà Dàshèngzhǔ chì.*\n\nThen welcoming the right mudra:\n*Oṃ hūṃ hūṃ traṭ lī lī, traṭ lī lī,*\n*— yē lī svāhā.*\n\nReturning to the left mudra:\n*Oṃ hūṃ traṭ lī, nán— lī,*\n*— — lī lǜ lìng svāhā.*\n\nThen welcoming the right mudra:\n*Oṃ nǎ— — — lú lū svāhā.*\n\nWith hands crossed, they recite the *Eight Buddha-Mothers Mantra*:\n*Nī là mā dū mó,*\n*Bā dǎ hé là dū mó,*\n*Mā gā— bā là dū mó,*\n*— bā là dū mó,*\n*Dá— dá— — dū mó,*\n*Wū dá— dū mó,*\n*Wū bā— nǎ dū mó,*\n*Dá— dá— dū mó,*\n*Oṃ mā lī jiē— svāhā.*\n\nFollowing the left hand’s *Dipper Seal*, they circulate qi seven times:\n*Hā svā— jiē lī mā oṃ.*\n\nReversing with the right hand’s *Dipper Seal*, they circulate qi seven times.\n\nThe master completes the visualization and proceeds:\nBowing, they welcome and invite as prescribed in the ritual protocol.\n\nThe ordained disciple, humble descendant of the mysterious lineage, so-and-so, with sincere devotion prostrates and pays homage:\n\nOn the day when asuras warred in heaven,\nWhen apocalyptic fires raged through the human realm,\nFour heads manifested divine transformations,\nEight arms extended, wielding the power of the Dao.\nEver roaming before the sun and moon,\nStanding alone amidst the three realms of blades and warfare,\nRadiant with awe-inspiring majesty,\nPerfect in wondrous form,\nYou lift sentient beings beyond all suffering.\nThough the vast void may end,\nYour original vow remains boundless.\nGreat Compassion, Great Vow, Great Sage, Great Mercy—\nNine Heavens’ Thunder Ancestor, Great Emperor,\nSolar Palace’s Radiant Emperor,\nLunar Mansion’s Supreme Sovereign,\nHoly and Benevolent Primordial Dipper Mother, Purple Radiance Golden Honored One,\nSacred Virtue’s Resplendent Radiance Heavenly Queen,\nMārīcī, Heaven’s Great Sage, Perfect Illumination Dao Mother, Heavenly Worthy.\n\nThe disciple so-and-so, with sincere devotion, prostrates and pays homage:\n\nIn the Western Land of India,\nAmidst the Great Wisdom Light,\nTrue Emptiness, Wondrous Form—Dharma King and Master,\nSupreme Primordial Heavenly Mother Sovereign,\nWhere golden light blazes, sun and moon dim their splendor,\nWhen the jeweled vajra spins, ghosts and spirits lose their hue.\nManifesting divine traces in the mortal world,\nGuarding the sacred chariot in Jambudvīpa,\nWhen sentient beings face peril,\nMerely invoking the name of the Great Being,\nYou respond to cries and come to relieve suffering.\nGreat Compassion, Great Vow, Great Sage, Great Mercy—\nSacred Virtue’s Resplendent Radiance Heavenly Queen,\nSavior from All Perils, Mārīcī, Heaven’s Great Sage, Perfect Illumination Dao Mother, Heavenly Worthy.\n\nThe ritual protocol concludes.\n\nThe disciple humbly gazes upward, beseeching:\nGreat Compassion, transcending the realm of life and death,\nUtmost Spirit, Supreme Sage, seeing through the machinations of ghosts and spirits,\nWe pray that your divine power shields and protects us,\nDispelling the thousand calamities and ten thousand misfortunes.\nWe, daring to approach your majesty,\nAre overwhelmed with reverence.\nGazing toward heaven, longing for your sacred presence,\nWe earnestly await your gracious command.\nBowing again, we respectfully speak:\nHaving performed the rites of invitation,\nWe trust you will grace us with your presence.\nAs the Dipper’s radiance divides,\nEarth spirits surround your seat,\nJewels align like jade and pearls,\nIlluminating the nine smokes of the central land.\nWith a glance, the Dao is present,\nOffering the first spring grasses of Yangxian.\nBowing in reverence,\nWe present fragrant tea and incense.\n\nScattering flowers.\n\nThe ordained disciple, humble descendant of the mysterious lineage, so-and-so, bows again and petitions:\nTo the Ten Supreme Perfected of the Wondrous Dao of Emptiness,\nBrahma-Qi Dragon Han Heavenly Lords,\nPurple Radiance Golden Honored One, Sacred Virtue Heavenly Queen,\nMārīcī, Heaven’s Great Emperor,\nDipper Mansion’s Stellar Constellations and Luminous Hosts,\nTrue Sovereigns overseeing our destined stars,\nJade Brahma Heaven’s *Louluo* King,\nWondrous Brahma Heaven’s *Qialou* King,\nGreat Brahma Heaven’s Direct Attendant Forest Messengers,\nAncestral Masters, Lineage Masters, Scriptural Masters, and the Three Masters of Transmission,\nThunder Gods, Heavenly Generals, and all mighty numina,\nLamp altars descending to witness,\nAssembled host of perfected beings,\nWe humbly beseech your heavenly compassion to shine forth in clear witness.\n\nWe have heard:\nWhen the primordial qi first unfolded,\nMyriad spirits arrayed themselves.\nHeaven’s height, earth’s depth,\nCombined the yin and yang in their forging.\nSun’s illumination, moon’s presence,\nDivided the marvelous workings of day and night.\nLooking up, we revere the Dipper’s Pole as the true governor of heaven’s work,\nAligned with the Seven Governors and Five Phases,\nPivot of creation,\nCommanding the myriad spirits and ruling the Three Realms,\nGuiding the warp and weft of heaven and earth.\nBowing at the jade steps,\nThe first libation of wine is poured.\n\nScattering flowers.\n\nThe ordained disciple, humble descendant of the mysterious lineage, so-and-so, petitions:\nTo the Ten Supreme Perfected of the Wondrous Dao of Emptiness,\nBrahma-Qi Dragon Han Heavenly Lords,\nPurple Radiance Golden Honored One, Sacred Virtue Heavenly Queen,\nMārīcī, Heaven’s Great Sage, Perfect Illumination Dao Mother, Heavenly Worthy,\nDipper Mansion’s Stellar Constellations and Luminous Hosts,\nTrue Sovereigns overseeing our destined stars,\nJade Brahma Heaven’s *Louluo* King,\nWondrous Brahma Heaven’s *Qialou* King,\nGreat Brahma Heaven’s Direct Attendant Forest Messengers,\nAncestral Masters, Lineage Masters, Scriptural Masters, and the Three Masters of Transmission,\nThunder Gods, Heavenly Generals, and all mighty numina,\nLamp altars descending to witness,\nAssembled host of perfected beings,\nWe humbly beseech your heavenly compassion to shine forth in clear witness.\n\nWe have heard:\nThe Dao expounds the profound and subtle,\nRooted in the primordial qi’s wondrous mystery.\nThe stars’ radiance shines upon the Purple Pole,\nRevealing the Northern Dipper’s palace of the Seven Primes.\nLuminous and bright, the spirit chamber’s numinous clarity,\nDeep and abyssal, the spring’s utmost profundity.\nSilver lamps gleam with splendor,\nJade talismans waft with smoke.\nWe offer refined libations and pure wine,\nStriving for utmost sincerity.\nCrowned with auspicious clouds, draped in sun and moon,\nWe wish to always behold your honored presence.\nThus, we present the fragrant chalice,\nPouring the second libation.",
      "overlap_context": "ing received this sincere petition, it is impossible to refuse. We vow to diligently benefit and save, reverently performing the memorial and exorcism.\n\nMay the incense-attending immortal maidens swiftly reach the boundless and pure realm; may the true numina deign to glance downward, temporarily departing the heavenly palace and Brahma abode to descend.\n\nWe, with utmost reverence and awe, kowtow and prostrate again, reverently welcoming the arrival of your sacred presence.\n\nRespectfully stated.",
      "start_char": 3592,
      "end_char": 4912,
      "start_sentence": 70,
      "end_sentence": 104,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 48.16736650466919,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\先天斗母奏告玄科.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "散花 嗣教玄玄孙臣某，重诚上启虚无妙道十极高真、斗父龙汉天君、斗母摩利天大帝圆明道母天尊，北斗九皇大道君、周天星宿本命元辰、玉妙二梵天王、斗中通事含人、大梵天宫林使者、祖师师真、雷神官将、灯筵启格与会群真，恭望道慈俯垂昭鉴。 臣闻大道无形，妙集虚而应物，凡民有欲，辄敷衽以陈情，遥瞻黄道之辉，密运洪钓之化，伏愿至真垂悯，上帝弘恩，何灾不灭，何福不臻，终始永依於道荫，所向者成，所为者合，行藏均赖於灵休，爰竭一诚，酒陈三献。 散花 具位嗣教玄玄孙臣某，重诚上启九天雷祖、大梵先天乾元巨光斗母、紫光金尊圣德天后、圆明道母天尊、仗此真香，普同供养。 臣闻至灵至圣，了鬼神窥不破之机，大圣大慈，超生死不相干之路，威灵赫奕，妙相圆融，昔在周御国中，发弘誓愿，澡盥温玉池内，化现金莲，是生九子，统领群伦，飞居中极之尊，用作众生之生，解冤释对，如九日照耀于冰山，度厄扶衰，使七元运转於浚极，独立刀兵劫界，常游日月天前，接引众生，超离诸苦。 又闻紫微尊星，众星环拱，元是枢机之首，实为喉舌之司，既在照临，敢忘钦奉，伏念某妙分一炁，获在人伦，予貌肖形，举藉鋾镕之造，时易日屡，乖违香火之勤，动有百愆，居无片善，庸展鳝朝之礼，仰干鸿庇之私，辄陈自忏之辞，满望维新之祉，香焚宝木，灯灿瑶花，致三肃以祈恩，叩北辰而拜首，俯陈丹悃，仰企清光，恭愿宸衷轸念，圣旨宣传，除罪簿，灭恶根，诞告於日宫月府，落死名，上生籍，照冲於斗极仙曹，固福根而永灭祸根，实命脉而长延寿脉，禄无冲破，马不空亡，如合璧，如连珠，辉映於身躬，限位曰鋾魂曰铸魄，□#2坚於火宅樊笼，四时运而喜气常臻，七政□#3而阴阳不忒，木敷荣而金削厄，火息焰而水流恩，土厚栽培，气兴善瑞，天首绝刑冲之害，神首回凶怒之威，福寿康宁，无复毛头生怪状，化育长养，常蒙本命降真灵，臣素乏材疏，叨行科法，祈受箓传符之日，当分环破券之时，誓勤济物以利人，爰许飞章而上奏，凡民有欲，天意必从，所有元降心章，谨当宣读。 宣章。 俯伏。",
      "translated_text": "Scattering blossoms,\n\nLineage-disciple, the remote descendant of the Mysterious and Profound, your humble servant [Name], with utmost sincerity, reverently invokes the Ten Supreme Perfected of the Wondrous Dao of Emptiness and Non-Being, the Celestial Lord of the Dragon Han and Father of the Dipper, the Great Emperor of Heaven and Mother of the Dipper Mo Li, the Heavenly Honored One of the Luminous Dao and Mother of the Round Brightness, the Nine August Sovereigns of the Northern Dipper’s Great Dao, the Original Stellar Spirits of the Circumpolar Constellations and One’s Own Destiny, the Two August Kings of the Jade Mystery and Brahmā Heavens, the Dipper’s Intermediary Tongue-Containing Deity, the Forest Envoys of the Great Brahmā Heavenly Palace, the Patriarchs and Perfected Masters, the Thunder Gods and Celestial Generals, and the assembled host of perfected beings who descend to witness the lamp altar.\n\nWe humbly beseech the Dao’s compassion to shine forth in clear witness.\n\nWe have heard:\nThe Great Dao is formless, wondrously gathering in emptiness to respond to all things.\nWhen ordinary folk harbor desires, they spread their robes to present their pleas.\nGazing afar at the radiance of the Yellow Dao,\nwe perceive the subtle workings of its vast transformative power.\nWe pray that the Most Perfected may take pity,\nthat the August Emperor may bestow great favor—\nwhat disaster would not be extinguished?\nWhat blessing would not be attained?\nMay we ever rely upon the Dao’s sheltering shade,\nwhere all we face comes to fruition,\nall we do finds harmony.\nIn action and repose alike, may we depend upon your numinous grace.\nThus, with utmost sincerity,\nwe present the three libations of wine.\n\nScattering blossoms,\n\nThe humble servant [Name], lineage-disciple and remote descendant of the Mysterious and Profound, with utmost sincerity, reverently invokes the Nine Heavens’ Thunder Ancestor, the Primordial Heavenly Brahmā of the Qian Origin and Vast Light, the Dipper Mother, the Golden August and Purple Radiance Honored Heavenly Empress of Sagely Virtue, and the Heavenly Honored One of the Luminous Dao and Mother of the Round Brightness.\nWith this true incense,\nwe universally offer homage.\n\nWe have heard:\nUtmost numinosity, utmost sageliness—\neven ghosts and spirits cannot fathom their mystery.\nUtmost sageliness, utmost compassion—\ntranscending the paths of life and death that do not touch them.\nMajestic and resplendent,\ntheir wondrous forms perfectly fused,\nonce in the kingdom ruled by the Zhou,\nthey made vast vows.\nBathed in the warm jade pool,\nthey manifested as golden lotuses,\ngiving birth to nine sons\nwho govern all beings.\nAscending to dwell in the august center,\nthey serve as the wellspring of all life.\nDissolving karmic enmity, releasing opposition—\nlike the nine suns melting the ice mountains.\nDelivering from distress, supporting the frail—\ncausing the Seven Primes to revolve in the depths of the abyss.\nStanding alone amid the calamities of war,\never roaming before the heavens of sun and moon,\nthey guide all beings,\nliberating them from every suffering.\n\nWe have further heard:\nThe August Star of the Purple Tenuity,\nencircled by all stars,\nis the chief of the celestial pivot,\ntruly the office of the tongue and voice.\nSince it deigns to shine upon us,\nhow dare we fail to revere and serve it?\nReflecting humbly,\nwe were wondrously divided from the primordial qi\nand born into the human realm.\nOur form and appearance,\nall depend upon the refining and forging of creation.\nYet as days and months pass,\nwe have strayed from the diligence of incense and offerings.\nEvery action bears a hundred faults,\nno moment holds a single good.\nNow, in feeble offering of our morning audience,\nwe look up to implore your vast protection.\nThus, we present words of self-confession,\nhoping for the blessing of renewal.\nPrecious woods burn as incense,\nlamps gleam with jade-like blossoms.\nWe perform the triple bows to pray for grace,\nknock our heads to the Northern Star in reverence.\nBowing low, we present our sincere devotion;\nlooking up, we long for your pure radiance.\nWe reverently pray that the imperial heart may take pity,\nthat the sagely decree may be proclaimed:\nerasing the ledger of sins,\nextinguishing the roots of evil—\nlet it be announced in the palaces of sun and moon.\nStriking our names from the register of death,\ninscribing them in the celestial records of life—\nlet it shine upon the Dipper’s pole in the immortals’ courts.\nFirmly rooting blessings, forever extinguishing misfortune,\ntruly securing our life’s pulse, eternally extending our lifespan.\nMay salary not be interrupted,\nmay horses not perish in vain.\nLike joined jade disks, like linked pearls,\nmay radiance illumine our bodies.\nMay our destiny be refined, our souls cast anew,\nstrengthened within the fiery prison of the mundane world.\nThrough the four seasons, may joyous qi ever arrive;\nby the seven luminaries, may yin and yang never falter.\nMay wood flourish and metal cut away calamity,\nmay fire’s flames subside and water’s grace flow.\nMay earth’s thickness nurture growth,\nmay qi rise with auspicious omens.\nMay the heavens’ decree avert harm from punishments,\nmay the spirits’ wrath turn away from fury.\nMay fortune, longevity, health, and peace prevail,\nwith no more strange portents arising from the hairline.\nMay nurturing transformation and growth\never receive the descent of our destiny’s true spirits.\nWe, lacking talent and crude in learning,\nhave presumptuously practiced the methods of the teachings.\nOn the day we received the registers and transmitted talismans,\nwe pledged to break the bonds of karmic debt.\nWe vowed to diligently aid beings for the benefit of others,\nand thus permitted memorials to be sent aloft.\nWhen ordinary folk harbor desires,\nheaven’s will must comply.\nAll the original memorials from the heart,\nwe now respectfully proclaim.\n\nProclaim the memorial.\nProstrate in reverence.",
      "overlap_context": "on the Purple Pole,\nRevealing the Northern Dipper’s palace of the Seven Primes.\nLuminous and bright, the spirit chamber’s numinous clarity,\nDeep and abyssal, the spring’s utmost profundity.\nSilver lamps gleam with splendor,\nJade talismans waft with smoke.\nWe offer refined libations and pure wine,\nStriving for utmost sincerity.\nCrowned with auspicious clouds, draped in sun and moon,\nWe wish to always behold your honored presence.\nThus, we present the fragrant chalice,\nPouring the second libation.",
      "start_char": 4913,
      "end_char": 5747,
      "start_sentence": 105,
      "end_sentence": 113,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.733559131622314,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\先天斗母奏告玄科.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "按如章奏，已具告陈，大道无私，必垂省览，但臣未明休咎，所当布占投符，愿恩命之速颁，副凡民之皈向，吉凶晦吝，福祸忧疑，指定四方，分明报应。 起身步呈召将， 起五色祥云符， 遣章符。 伏以九重金阙，居巍巍大梵之天，一意丹诚，罄翼翼小心之信，谨遵教典，进拜符章，已奏对於玉阶，当贡焚於云驿，以今上请玉梵尊天喽啰王、妙梵尊天伽喽王、九天罡神飞捷报应使者张使者、斗中擎羊陀罗二使者、斗中通事舍人、三界功曹符使、词居香火司命土地等神、本坛官将祇应等神，闻今上请，速现威灵，坛有牒文，合行宣读。 宣责章牒 开天符 适伸符牒，已对敷宣，谅沐雷威，必垂昭鉴，然则罡风灏炁，非凡体以能通，斗府雷司，有威神而可达，速请乘云驾雾，跨景凌空，火铃一掷，而光照入#4荒，雷光一飞，而升腾三界，径诣丹天之阙，直趋紫极之垣，启典奏之仙乡，通金尊之御座，凡诚得达，敕旨焕颁，元降符章，速操上进，当职钦承帝命，掌握印符，专雷霆号令之权，司斗府奏禳之事，令下疾如星火，法布迅若风烟，三界不许稽延，一时明彰报应。 发遣完。 向来奏告功德，上祈星真，转斗移星，同赖善功，一切信礼，伏愿天清地宁，万法咸祈於调理，世安国泰，群生总赖於周旋，矧在微躯，伏蒙大造非横出於莫测，见晛日消，福庆无不其宜，如川方至，或倾危殆，全仗扶持，向来奏告功德，上翼斗真证无上道，一切信礼。 先天斗母奏告玄科竟 #1据前后文此脱字当为『伽』。 #2#3 此字不明，暂以□代之。 #4 『入』，当为『八』之误。",
      "translated_text": "Upon reviewing the memorial as submitted, all has been duly reported and presented. The Great Dao is impartial and will surely grant its inspection. Yet this humble servant remains unclear of fortune’s signs and must therefore cast divination and dispatch talismans. May the gracious decree be swiftly bestowed to fulfill the common folk’s devotion. Whether fortune or misfortune, obscurity or adversity, blessing or calamity, doubt or anxiety—may the four directions be clearly designated, and retribution distinctly manifested.\n\nRise and step forth to summon the generals.\nRaise the Talisman of Five-Colored Auspicious Clouds.\nDispatch the memorial talisman.\n\nWe, prostrate in reverence, acknowledge the nine-tiered golden gates of the lofty Brahma-Heaven, where a single intent of sincere devotion exhausts the most reverent and humble of faith. In strict accordance with the sacred canons, we now present and bow before the talismanic memorial. Having already submitted it at the jade steps, it is fitting to burn it at the cloud-post station. Today, we invoke and beseech:\n\nThe Jade Brahma Venerable Heavenly Louluo King,\nThe Wondrous Brahma Venerable Heavenly Qieluo King,\nThe Nine Heavens’ Gang Celestial Swift Retribution Envoys—Messenger Zhang,\nThe Dipper’s Yang-Bearing Tuoluo Twin Envoys,\nThe Dipper’s Intermediary Steward,\nThe Three Realms’ Merit Officers and Talisman Envoys,\nThe Word-Offering Incense Fire Controller of Destiny and Local Earth Deities,\nThe Altar’s Official Generals and Responsive Deities—\n\nUpon hearing this invocation, may they swiftly manifest their majestic power. As there are documents at the altar, they shall now be proclaimed.\n\nProclaim the memorial document.\nUnseal the Heavenly Talisman.\n\nHaving just recited and declared the talismanic memorial, we trust that, bathed in the awe of thunderous might, it will surely receive luminous scrutiny. Yet the Gang winds and vast qi cannot be traversed by mortal form, and the Dipper’s Palace and Thunder Bureau possess divine power that may be reached. We urgently beseech them to ride clouds and mount mist, stride across the void, and soar aloft. With a single cast of the fire bell, its radiance illuminates the eight wilds; with a single flight of thunder’s light, it ascends through the Three Realms. Proceed directly to the Crimson Heaven’s gates, hasten straight to the Purple Ultimate’s walls, open the immortal realm of canonical rites, and reach the golden throne of the august seat. May the sincerity of the common folk be conveyed, imperial edicts brilliantly issued, and the originally descended talismanic memorial swiftly carried upward. The incumbent, reverently bearing the Emperor’s mandate, wields the seal and talismans, holding sole authority over thunder’s commands and governing the Dipper’s Palace in matters of memorials and expiations. Let decrees descend swift as shooting stars, and methods spread rapid as wind and mist. The Three Realms shall not delay, and retribution shall be made manifest in a single moment.\n\nThe dispatch is complete.\n\nThe preceding merits of supplication and offerings, directed upward to the stellar perfected, turning the Dipper and shifting the stars, are all reliant on virtuous deeds. For all who sincerely partake in this rite, we humbly pray that heaven be clear and earth tranquil, all dharmas harmoniously regulated, the world at peace and the state secure, and all beings universally sustained. As for this humble self, may the great creation’s unfathomable grace shield me from unforeseen calamities, and may the sun’s light dispel misfortune, bringing only fitting blessings. Like a river’s flow, may fortune arrive in full, and should peril or danger loom, may it be wholly averted by this support. The preceding merits of supplication and offerings, directed upward to the Dipper’s perfected, aid in the realization of the supreme Dao for all who sincerely partake in this rite.\n\nThe Precelestial Dipper Mother’s Memorial Rite of the Mysterious Canon is now concluded.",
      "overlap_context": ", lacking talent and crude in learning,\nhave presumptuously practiced the methods of the teachings.\nOn the day we received the registers and transmitted talismans,\nwe pledged to break the bonds of karmic debt.\nWe vowed to diligently aid beings for the benefit of others,\nand thus permitted memorials to be sent aloft.\nWhen ordinary folk harbor desires,\nheaven’s will must comply.\nAll the original memorials from the heart,\nwe now respectfully proclaim.\n\nProclaim the memorial.\nProstrate in reverence.",
      "start_char": 5748,
      "end_char": 6396,
      "start_sentence": 114,
      "end_sentence": 127,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.506720781326294,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\先天斗母奏告玄科.txt",
        "category": "正统道藏续道藏"
      }
    }
  ]
}