{
  "source_id": "全真清规",
  "source_file": "chunked_daozang\\全真清规.json",
  "total_chunks": 7,
  "total_original_chars": 6117,
  "total_translated_chars": 37472,
  "total_translation_time": 184.66942286491394,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\全真清规.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Complete Perfection Monastic Regulations**\n\n**Title:** *The Complete Perfection Monastic Regulations*. Compiled by Lu Daohe during the Yuan-Ming transition period. One fascicle. Source text from *The Orthodox Daoist Canon*, Proper Section I.\n\n**The Complete Perfection Monastic Regulations**\nCompiled by Lu Daohe, the Master Tongxuan of Chun’an in Yaojiang\n\n**Guidelines for Novices**\nWhen a novice first leaves the secular world, they must seek a enlightened teacher and formally submit to their guidance. Once ordained, they must obey their master’s instructions to mature into a true practitioner.\n\nWhen a master accepts a disciple, they first assess the depth of the novice’s innate goodness and wisdom, observe the moral character of their family lineage, and evaluate the disciple’s own talents. Only then may they be accepted.\n\nFirst, the novice must shed worldly attachments, change their attire, and cultivate the demeanor of an immortal, embodying the Daoist spirit. Through instruction and discipline, they will eventually attain distinction.\n\nAs the Most High said: *\"To constantly embody the model is called mysterious virtue, for one becomes the standard for all under Heaven.\"*\n\nA *model* is the law, the rule, the pattern, the plumb line for the world. Such standards have existed since antiquity, while monastic halls have arisen in recent times.\n\nAn enlightened master, when accepting and instructing disciples, begins with concrete practices before guiding them toward the formless. Disciples from noble lineages who diligently cultivate these teachings will attain realization.\n\nYet if a deluded master, lacking understanding, instructs disciples in the formless from the outset, both teacher and student will remain ignorant, sinking deeper into confusion. Though they rely on the teachings in life, in death they will fall into the icy abyss, repaying their karmic debts through endless rebirth.\n\nThose of sincere aspiration should seek an enlightened master, paying morning and evening respects, listening and obeying, studying scriptures, and upholding the monastic regulations.\n\nFrom dawn till dusk, they burn incense, light lamps, offer thanks to Heaven and Earth, and pay homage to the sages and immortals while serving their master with reverence. Once these duties are complete, they collect their thoughts, sit upright in stillness, free from distracting thoughts, straighten their spine, place the right foot beneath the left, clasp their hands in silence, turn their mind inward, and close their eyes in meditation—whether for one or two watches of the night—as their daily practice.\n\nWhen the fifth watch approaches but the morning bell has not yet sounded, they must rise early, wash their face, comb their hair, dress, and attend to the assembly. As the first bell rings in the hall, the novices enter and line up inside. At the second bell, the senior monks enter and line up outside. When the third bell ceases, the officiant enters and stands at the center.\n\nAfter the recitation of scriptures, the novices exit first. During processions and scripture recitations, novices lead, and this order is observed in all halls. Once the recitation concludes, the officiant takes their seat, and the novices bow deeply, calling for a full bow from the assembly. All sit, tea is served, and once the cups are cleared, the assembly disperses.\n\nThe novices then enter their master’s chamber, prostrate, and bow, awaiting instructions—whether to study scriptures or sweep the floor, each task assigned accordingly.\n\nWhen encountering elders, they clasp their hands over their heart, stand to the side with a slight bow, and remain attentive until the elder passes before turning away. When guests arrive, they must first bow, announce their presence to the elders, and prepare tea. They first greet the host, then the guest, standing with clasped hands. They first clear the guest’s cup, then the host’s. If the guest rises, they open the door and roll up the curtain, following the host and guest out.\n\nWhen accompanying their master, they must not sit beside them but stand with clasped hands. In all comings and goings, they bow to their peers. When receiving anything, they bow in gratitude. They must not be self-righteous, nor speak recklessly, but dispel distracting thoughts, cultivate kindness, contemplate the Dao, and aspire to truth.\n\nThey walk with measured steps and speak in a low voice. They aid those in distress, welcome travelers, maintain a broad and compassionate heart, act with gentleness and love, benefit others, accumulate merit through virtuous deeds, and uphold these practices—thus the Dao is not far.\n\n**Order of Ordination**\nWhen renouncing the secular world and receiving the Daoist topknot and robe, the ordination implements are placed upon the altar of the Patriarch. The assembly sits in a circle, bidding farewell to worldly kin, and changing into their new attire, shoes, and socks.\n\nKneeling before the Patriarch, the ordaining master combs their hair and bestows the topknot and robe. The assembly enters the hall, begins the scripture recitation, and leads the prayers of blessing. Standing before the incense table, the officiant reads the proclamation, bows three times to offer incense, then retreats to perform six bows. After the prayers conclude, they enter the Hall of True Officials to recite scriptures, bowing before the Patriarch in the same manner.\n\nOnce the recitation ends, the assembly sits again, and incense and candles are arranged properly. Before their master, the ordaining master leads the initiate forward to kneel, bow three times to receive the incense, then bow again to approach. The master hands them the proclamation, which they kneel to read aloud, then receive the transmission of the Dao from their master.\n\nThey bow three more times, prostrate, then carry the incense and candle table to each elder in turn, offering incense as before. After the rites conclude, they enter the refectory, bow three times before the Patriarch’s altar, and the assembly bows six times on either side to encourage the meal. After the meal, they rise to see off the guests, then return to express gratitude in the kitchen.\n\nIn daily conduct, they should act with flexibility, endure hardship for others’ benefit, subdue the mind and extinguish distracting thoughts, respect their master and serve their peers, avoid worldly attachments, constantly examine their faults, focus on cultivating their nature, seek guidance from elders, and strictly uphold the monastic regulations.\n\n**Etiquette for Traveling and Seeking Masters**\nWhen traveling to various regions, one must not only seek virtuous masters but also ensure their ordination implements are properly arranged.\n\nUpon first arriving at the monastery, one should look for the characters \"息肩\" (Resting Shoulders) or \"驻鹤\" (Perching Crane) on the western corridor and rest there. If intending to stay long-term, the carrying pole is laid flat; if merely passing through, the ends may be uneven. Leaning against the wall, one takes the outer robe and drapes it over the left arm. If the head monastic receptionist emerges from the main hall, one dons the outer robe and exchanges bows as host and guest. If asked about one’s origins, one replies: \"From such-and-such abbey in such-and-such prefecture, under Master So-and-so, of the such-and-such surname.\" The response should be: \"From such-and-such place, such-and-such prefecture, of the such-and-such surname.\" Once the exchange concludes, one is invited inside. If staying only for the day, all belongings except bedding are packed away. After spreading the mat and arranging the bowl, one washes the feet and changes clothes. One then meets the receptionist again, bowing and saying: \"Today, I humbly wish the Venerable Receptionist great fortune in health and well-being. Having long heard of your secluded transcendence, I have come especially to pay my respects. I am deeply grateful for your kindness in receiving me, providing a mat, and setting out my bowl.\" With a bow, one proceeds to meet the monastery’s director, offering salutations: \"Today, I humbly wish the Esteemed Director, the Perfected One, abundant purity and blessings. Having long heard of the vastness of your Dao-inspired virtue, I have come to gaze upon your honored presence. I am profoundly grateful for your kindness in receiving me, providing a mat, and setting out my bowl.\" With a bow, after tea is served, one rises to express thanks: \"Just now, I lightly intruded upon your quarters. I am deeply moved by your gracious hospitality in preparing tea, and my heart is filled with boundless gratitude.\" With a bow, the formalities conclude, and one returns to one’s mat. The director responds: \"The monastery is honored by your crane-like presence. We regret not having welcomed you properly.\" Then, rising to urge one to stay, the director says: \"The monastery is quiet, and our hall and kitchen are humble. We dare hope that the noble one will linger like a crane, uplifting the monastery’s Dao-inspired virtue. Our longing and admiration are beyond words.\" With a bow, the rules of the monastic hall and the seniority of ordination are observed.\n\nUpon receiving new members, one must first observe them for three days. Only then may they be invited into the storehouse hall to verify their credentials, confirming where and when they took their master and received the Dao. Their details are recorded in the blue register. Afterward, they are assigned a sleeping mat. Consulting the blue register, their names are arranged by seniority, and each is shown their designated place. Thus, one knows oneself and others, and observes the precepts and ordination seniority. In all matters—whether entering the hall, ascending the platform, walking, standing, sitting, or lying down—one must yield to those of higher rank or greater seniority, respecting the order of precepts and ordination. Follow the monastery’s hierarchy while upholding the proper deference of the religious life.\n\n**Rules for Sitting the Alms-Bowl**\nThe practice of sitting the alms-bowl begins on the first day of the tenth month, gathering the assembly. It continues past the Winter Solstice until the middle of the first lunar month of the new year, lasting one hundred days as the standard. Those who enter the hall do so of their own volition. Each comes solely for their own sake, for the great matter of life and death is urgent, and impermanence arrives swiftly. They examine and refine one another, inquiring of the master’s virtue and adhering to the rules. During the alms-bowl session, there is movement and stillness: when moving, one may proceed slowly; when still, one must remain so. If someone grows drowsy, nodding or swaying, the bowl monitor first patrols with the warning tablet, placing it on the offender’s shoulder. After three strikes, it is removed, and the offender rises gently to continue patrolling, replacing the next violator. If, before the session ends, the bell has not sounded, the stillness tablet remains unchanged, and one leaves or enters without cause, speaks, or disturbs the order, they shall be disciplined.\n\n1. For those who violate the above rules, the assistant bowl monitor shall report the matter, and the bowl monitor shall administer discipline. First offense: reprimand before the hall. Second offense: tea penalty. Third offense: expulsion from the hall. Severe violations shall be addressed according to the monastery’s regulations and ancestral precedents.\n\n2. The twelve alms-bowl sessions day and night correspond to the twelve hours. The three stillnesses and nine movements align with the Three Origins and Nine Qi, also known as the three returns and nine cycles.\n\n3. Each day at the fifth watch, the *yin* hour, upon hearing the board signaling the end of stillness, all wash and rinse, pay homage to the immortals, and venerate the sages. At the *mao* hour, morning gruel is taken. At the *chen* hour, mixed sitting. At the *si* hour, the stillness bell rings three times, and all sit in meditation, cultivating practice as prescribed. At the *wu* hour, one attends the meal. At the *wei* hour, mixed sitting. At the *shen* hour, as before, one enters stillness. At the *you* hour, evening audience. At the *xu* hour, mixed sitting with tea. At the *hai* hour, as before, one enters stillness, cultivating practice as prescribed. At the *zi* hour, singing and reciting poetry to resist the demon of sleep. The bowl monitor leads, repeating each piece three times—no more. At the *chou* hour, the session ends, and all may act as they please. The assistant bowl monitor must remain vigilant, ensuring no one lingers too long. Each must cultivate a sincere and respectful heart.\n\n**The Three Unmovings**\nIn the great assembly of the monastery, there are always guest managers and duty monks to respond to exchanges, welcome guests, and see them off. The assembly must not stir, lest they disrupt the hall’s order.\n\n1. **Unmoving in Meditation**\n   Clarify the celestial mind, regulate the breath to harmonize primordial qi, investigate the original nature, and silently activate the mysterious mechanism. The body, like the great void, remains unshaken and unmoved. Let others come and go; each cultivates a sincere heart and sits in meditation as prescribed.\n\n2. **Unmoving in Recitation**\n   Each directs their mind, maintaining solemn dignity. Regulate the voice and qi, focus the thoughts, and comprehend the meaning. Listen with the ears, observe with the eyes, harmonize the sounds, and follow one another. Let others come and go; each returns to devotion and recites the scriptures as prescribed.\n\n3. **Unmoving at Meals**\n   Contemplate the Dao and reflect on the true. The mind is clear, the intent serene. Spirit settled, qi harmonized, one silently receives the offering. Unfold the alms-bowl without sound, ascend the hall without speech. Let others be long or short; each cultivates reverence and sits at meals as prescribed.\n\n**The Substance and Function of the Complete Truth**\nThe ancestral masters established the teachings, and the immortals and sages delivered sentient beings, opening the gateway to the Great Vehicle and the essential ford of myriad wonders. They guided beings to return to the origin and comprehend principle, awakening the deluded mind to preserve the true. Value loyalty in clarity and stillness, and strive to perfect the nature in simplicity and purity. Deeply understand the brevity of life, and attain the supreme joy of eternal spring. Thus, do not cling to profit or fame, nor entangle yourself in worldly affairs. Comprehend the great essence, and let the heart be as pure as gold and jade. Nurture the primordial mechanism, and let the aspiration be as steadfast as stone and as clear as ice. Aid others and benefit all things, harmonizing the one principle to achieve universal penetration. Refine the self and return to the origin, embodying myriad virtues in perfect balance. Whether one is a stubborn practitioner or a master of the round mechanism, there should be no discrimination, no contention, no pride, and no fault-finding. Dwell in the jade-like abode, and mingle in the cloud-like hall. Do not scrutinize others’ faults or shortcomings; instead, eliminate one’s own arrogance and obstinacy. The heart is free and at ease, adapting to circumstances with harmony. The capacity is vast and unobstructed, gentle and kind in all places. When attending meals morning and evening, one should fold the hands, cultivate a sincere heart, and sit in silence. When paying homage to the sages at dawn and dusk, one must raise the fists, walk slowly, and proceed with measured steps. Those who embody the higher way maintain solemn dignity; those who dwell in the lower stream act with reckless abandon. When secretly inquiring into the true mechanism and investigating the mysterious essentials, one must revere the master with utmost respect and sincerity, and inquire of the Dao with earnest devotion. Comprehend the myriad principles to return to the origin, and concentrate the one true to manifest its wondrous function. Open the Dao-eye wide, and abide in silent illumination of the subtle. Penetrate the celestial mind, and respond with introspection to the numinous stirrings. In adversity, contain and endure; when offended, refrain from ridicule. Humble the heart and respect one’s fellow practitioners; restrain the self and patiently await the unworthy. In all matters of studying the teachings and discussing the scriptures, one should thoroughly explore the spiritual source and root, not merely engage in empty chatter or idle speculation. Penetrate beyond the intent of the sages’ hearts, and merge with the original nature of one’s own being. Only through precise inquiry and clear discernment does one attain the ultimate learning. Mastery of the profound and the broad brings joy in non-action. The heart is orderly, the nature is lucid, and the true joy is boundless. Qi harmonizes with the spirit, and stillness stands alone, the body in unity with the great void. Like water, it is level, clear, gentle, and yielding; like clouds, it is ethereal, drifting, and unfolding. To attain the Dao and understand the heart, one must truly practice the authentic work.\n\nGuard against recklessness and dissipation, and you will not fall into deviation or perversity; abide in sincerity and solidity, and you will fully return to central uprightness. Discard your own faults, and ever delight in peace and harmony; do not assert your own rightness, and who will contend with you? When emotions dissolve, the heart is at leisure; when dust is cleansed, filth is purified.\n\nIn managing affairs and making plans, do not act alone with arbitrary authority; in public duties and undertakings, follow the common summons of the community. Cunning and laziness, deceit and guile, lead to moral corruption and invite transgression; jealousy, envy, and deceit bring ruin to the body and loss of life. Pursuing sensory pleasures and seeking to outdo others keeps one in the realm of the ordinary; quelling attachment to self and others leads to sagehood.\n\nThus, the greatly enlightened accumulate hidden virtues, and true persons secretly cultivate merit. Constantly preserve the qi of the Dao, and avoid the winds of the mundane. Let your precepts be precise and strict, cutting off the four wrongs and the eight consciousnesses; let your practice be continuous and refined, decisively attaining the nine transformations and six penetrations. Indulging in desire and admiration draws one into demonic realms; gluttony and craving cast one into the realm of hungry ghosts.\n\nSit in constant stillness, and wisdom’s torch shines; do not give free rein to emotions, lest you fall into delusion. Let your aspiration abide in equality, your heart delight in sameness. When encountering things, do not harbor private obscurity; in responding to conditions, strive to act with impartial loyalty. In all conduct, movement and stillness must follow the seasons, with foresight guiding action; deviations must be swiftly corrected, and errors promptly redressed.\n\nA crooked heart leads to contention everywhere; a settled nature wins the trust and submission of all. Arrogance and haughtiness make the nature frivolous; flattery, sloth, and deceit thin one’s allotted fortune. The superior person nurtures qi with generosity and cultivates dignity; the lofty and wise humble themselves to self-mastery. Do not dishonor the purity of the teachings, nor violate the hall’s rules to incur punishment and disgrace. Reverently embody past causes, and all should conduct themselves with refined solemnity.\n\nMerge spirit to solidify your hold, and preserve original qi without precedence. Realize the golden lotus, and ascend to the jade realm. Together wander in the unbegun of the mysterious origin, and share the joy of the primordial before heaven and earth.\n\nAh! Heaven is round, earth is square—they accord with compass and square; nature is numinous, life is abundant—they unite with the golden immortals.\n\n*The Alchemy of the Bowl Chamber*\n\nThe vast sea of the Complete Reality Dao, the profound heart of immortals and sages—within it, the Great Ultimate is made clear, and within it lies hidden the celestial realm of the pot. The aperture of the eyes connects to the center, like a numinous spring welling upward; the heart of the bowl penetrates to the depths, causing the divine water to rise and flow.\n\nIn lofty clarity, one looks up to the empty center’s governance; in the abode of supreme goodness, one dwells in the soft compliance of the deep spring. When waves cease, the heart is like limpid blue water; when winds and billows are stilled, the nature’s body is the golden lotus. With single-mindedness, deep and still, unwavering; with three minds, clear and limpid, unchanging.\n\nDo not let the current roll, and you will be at peace in cessation and stability; if you still your breath, you may then be square or round. Now, sitting in the bowl to cultivate stillness, entering the chamber to refine merit—there is emptiness within that brings thorough penetration, and from the solid, one achieves perfect comprehension. Gather heaven and earth within a half-sheng cauldron; conceal emotions and nature within a single bowl chamber. Merge with the ancestral qi of the mysterious origin, and stir the true wind of kalpas past.\n\nAll dharmas thoroughly penetrate—oh, how solemn and pure the crimson towers! All dusts are utterly cleansed—oh, how bright and immaculate the numinous palace! Cloud companions unite in heart with reverence; rosy-friend comrades harmonize in aspiration to join as one.\n\nIn general, gathering thoughts and calming the mind, returning emotions and recovering nature—daily life must above all be peaceful and regular, and eating and drinking must never be excessive. When the deluded mind is extinguished, the original spirit shines in quiescent illumination; when the true breath is regulated, the life of wisdom merges with the primordial.\n\nWhen entering meditation, contain your light and silently empty the heart; when emerging from stillness, slowly turn your gaze inward and exit samadhi. The sleep demon suddenly arrives, and no one notices their head nodding and body swaying; the dullness hindrance abruptly comes, and few recognize their mouth gaping and breath scattering.\n\nPatrolling vigilance lies in alertness and rousing; hanging the plaque must uphold correction and rectification. Always return to humility and gentleness; do not obscure yourself with obstinacy. This is for cultivating life and death—do not engage in disputes over self and others. Be sure to rise from dullness and distraction, and shake off torpor to rouse the spirit.\n\nFirst bow reverently to the immortals and sages, then turn to thank the benevolent and kind. Let awe and joy arise, but never anger or resentment. Naturally, the heart will be at peace, and joy will fill the pot’s interior with spring’s warmth.\n\nRestraining the self to repay virtue is the mark of the superior person; harboring resentment and returning hatred is the way of the petty. Do not assert your own rightness and act in vain deceit; reflect on your faults and nurture simplicity and sincerity.\n\nExamining the rules of the former sages and the bowl’s meaning as taught by the patriarchs: returning metal to its root is the bowl’s source; emotions returning to nature is the bowl’s principle. Round and undifferentiated, it images the primal heaven; empty within, it is like the great beginning. All the myriad things are complete within it; all transformations are fully contained therein.\n\nIf there is leakage, one sinks unawares; if there is not a single drop, one suddenly rises. When ice is clear and still, one awakens to returning to the source; when the bowl floats and sinks, one understands the return to the self. Generally, use the nonexistent to illustrate the existent, and borrow the solid to embody the empty. Polishing and refining must come from teachers and friends; thorough comprehension requires diligent effort.\n\nOne must inquire into the state before father and mother were born, and constantly turn the light inward to the beginning of diligent body and mind. The truly pure-hearted scholar must be humble and draw near; strange friends and reckless companions must be gently and submissively kept at a distance.\n\nMaster Hu’s jar and window—true joy without limit; Yanzi’s bamboo bowl and gourd—supreme joy in abundance. Emulate the sages and immortals, who dwell in seclusion with subtle closeness; follow the true persons, who live in marketplaces with profound abiding.\n\nAttain tranquility and delight in serenity; examine the bowl chamber, the monastic community, and the company of fellow practitioners. Through kalpas, rarely encountered; from past lives, difficult to meet. Refining the true in the empty azure—oh, together delighting in the beginning of blue! The empty chamber generates whiteness—oh, together abiding in the great simplicity!\n\nFrom beginning to end, from dawn to dusk, the middle period must not be altered; at completion, one may freely go or stay. The carefree superior person’s heart is open and soars with the drifting white clouds; the anxious inferior person’s nature is obscured and lost in the dark mist.\n\nTwice daily, continuously nurturing the spirit; a hundred days, peacefully solidifying qi. Morning and evening, move slowly and relax. Food can connect qi; clothing suffices to ward off cold. Excessive use disorders the viscera; moderation keeps spirit and qi constantly at peace.\n\nWith bitter resolve, refine diligently, abandoning sleep and forgetting meals. Constantly in quiescent illumination, willingly endure the grind; returning to the true, observe and strive with the body. Nurture qi and spirit until they are settled and unified, and naturally, nature and life are both preserved.\n\nThe One pervades the Three Powers; the wondrous gate of the Limitless opens wide. Six penetrations, four directions—all spacious as the Great Void. Thus may the alms of the faithful be requited, and the host’s hospitality be fully repaid. Swiftly transcend delusion and illusion, forever delighting in true reverence.\n\nAlas! Escape the realm of birth and death, surpass the cosmos of creation. Roam and chant in the primordial, carefree within the Great Image; wander the boundless, rejoicing in the true origin. How expansive—perfect in reality and supreme! How majestic—standing alone, revered above all.\n\nHaving entered the Mystery Gate, one must follow its teachings and laws. To ascend the Dao’s shore, one must board the Vessel of Compassion.\n\n**Notice of Punishments by the Venerable Founder, Emperor Chongyang of the Quanzhen Tradition**\n\nThe principle of the Dao abides in the profound obscurity above the Supreme Ultimate—how could it be easily perceived? Thus, many seek it, but few awaken. The Way of emptiness and non-action, the vast and spontaneous qi of Heaven and Earth, the interplay of yin and yang giving rise to the myriad forms—how distant it seems across the ages!\n\nYet, like a vine clinging to a solitary path, one must not deviate in movement or bearing. Now, having secured this auspicious place and privately established this sacred hall, I have gathered virtuous companions from a thousand leagues and united faithful friends from all directions. Therefore, I establish these teachings and rules, humbly inviting your perusal:\n\n1. Violators of national law shall be expelled.\n2. Those who steal property and send it to their superiors shall have their robes and alms bowls burned and be expelled.\n3. Those who spread gossip, disturb the hall, or incite the assembly shall be caned and expelled.\n4. Those who indulge in wine, lust, wealth, anger, or meat—even in one of these—shall be expelled.\n5. Those who are cunning, lazy, jealous, or deceitful shall be expelled.\n6. Those who are arrogant, unruly, or refuse to follow the assembly shall be punished with fasting.\n7. Those who speak boastfully, act rashly, or with violence shall be punished with incense offerings.\n8. Those who tell strange tales, jest idly, or leave the hermitage without cause shall be punished with oil offerings.\n9. Those who neglect their duties, act cunningly, or are lazy shall be punished with tea offerings.\n10. Those who commit minor offenses shall be punished with prostrations.\n\nRespectfully, I address all fellow practitioners: by these laws, wherever three walk together, one may be my teacher. Dwelling in one chamber, we labor together in words and transformation, yet the law does not burden the most virtuous, and firmness does not exceed the utmost softness. The sage examines himself thrice daily—how great is this!\n\nFortunate to meet a wise teacher and encounter the sacred teachings, if we do not practice them, how can we be called the highest good? I hereby clarify these rules for the entire hall, urging constant vigilance to avoid transgression.\n\nAfter these prohibitions, men and women must not intermingle, nor may one indulge the heart’s desires. Beware lest the offerings of patrons from all directions become difficult to repay, lest one fail to cherish even an inch of time, lest one waste it in vain.\n\nDiligently cultivate with care, that the heart of the Dao may become steadfast. Without discipline, one risks losing the path ahead—ponder this deeply.\n\n**Notice.**\n**Proclamation of Liaozhenzi upon Ascending the Hall.**\n\nHere follows the translation:\n\n---\n\nIndeed, the Mysterious Origin and Sacred Ancestor flung wide the gates of all wonders; the Great Dao of Perfect Realization spread the teachings that transform and nurture all beings. The jade-maidens of Yao Pond—seven golden lotuses of Chongyang; the jasper groves of Lang Garden—ten thousand jade blossoms of Changchun. Though branches diverge and twigs differ, all leaves return to the root in the end. Though schools drift apart and streams stray, all rivers flow back to the sea at last.\n\nIn every quarter, teachings are established, gathering cloud-friends from the four seas; in every place, affinities are cultivated, assembling rosy companions from the three mountains. Thatched huts and grassy cottages become halls of precious jade and palaces of lapis; paper robes and hempen garments are graced with starry crowns and lunar pendants. Truly, “humans can magnify the Dao,” unfolding the model of the ancient sages. Naturally, the Dao’s methods respond to people, opening the eyes of later generations.\n\nIn the Hall of Perfect Realization, not a single thought entangles the heart; at the gate of the myriad practices, all may now apply their strength. Those above should abide in broad kindness; those below should ever hold reverence and compliance. Contentious dust-minds do not reveal the family style of the Mysterious; Dao-eyes follow one another, preserving the living practice of Danyang.\n\nOnce immortals beyond the world, now kin within the gate; dwelling in the world, they cultivate the fruit of the Dao together, transcending the ordinary to join the ranks of immortals. The immortal who has left the household—with clear eyes, they delve deeply; the resolute one who has departed the dust—with a sincere heart, they examine closely.\n\nWishing to expound further on the secret mysteries, yet mindful of the long standing of the immortal assembly, I bow to the cloud-friends and pray they take care.\n\n**Proclamation of Rules by the Perfected One of Eternal Spring**\n\nThose who dwell in hermitages should embody purity, emptiness, coolness, and tranquility—unfettered, solitary, and serene. Seeing the nature is the essence; nurturing life is the function. Gentleness and weakness are the norm; humility and harmony are virtue. Compassion is the foundation; skillful means are the gate.\n\nAmong the assembly, always remain lowly; in stillness, never stir dusty emotions. For all worldly toils, apply effort within your capacity—do not exceed. For every garment and every meal, use no more than necessary. Calculate the hermitage’s provisions—do not hoard surplus. For personal clothing and belongings, do not covet. If the common property has surplus, relieve the poverty of passing travelers in distress. Use it for alms-gathering elsewhere or to prepare vegetarian feasts.\n\nIn the twelve hours, do not cling to the illusory; always seek to illuminate the real. Sweep away dust and grime, scour pots and draw water, carry firewood and cook meals. Remove selfish thoughts; do not arouse anger. Each should occupy a chamber, settle the mind, and cultivate the Dao. Each has their assigned duty—take up one task. Exchange and temper the true nature, but do not cling to it as a tool, nor pass judgment on one another.\n\nStrictly subdue the heart, pare away self and others, extinguish sound and form, leave behind form and intellect, and abide in profound desirelessness. When encountering followers of the Three Teachings, treat them with equanimity—do not harbor negligence or disdain.\n\nDo not leave the hermitage without cause. At dusk, bolt the door early; at dawn, open it late. Receive those who bring offerings with ordinary courtesy; if none come, do not waver in mind. For wandering practitioners who pass by, if after three days they are of lofty wisdom, invite them to stay; if they lack aspiration, let them journey elsewhere. Next, verify their credentials and documents, and examine their circumstances closely. If unclear, beware of hidden deceit—untrustworthy individuals may bring instability.\n\nBe especially wary of a certain kind of Daoist—foolish disciples and cunning impostors. With a single misleading word, they may stain the assembly, damage the hermitage, and spread slander. Such ones should be expelled immediately.\n\nIf someone seeks to leave the household and join the hermitage, do not hastily admit them. First observe their Dao-qi, then their awakening to the Dao. Consider their ancestral family’s virtue or vice, and the depth of their own conduct. Guide the wise; restrain the dull. For any tasks within the hermitage, first consult the hermitage master, then discuss with the entire assembly.\n\nIn leaving the household, regardless of time or age, if one clarifies principle and illuminates the mind, they are worthy of being called an exalted person. In seeking alms for the Dao, do not falsely invoke the name of a master, nor privately claim affiliation with a hermitage. Taking offerings from patrons for personal use is to secretly deceive the common property. Heaven observes and judges—there will be no light punishment. Thus, this proclamation is posted for all to know.\n\n**Proclaimed on the ___ day of this month**\n**Letter from Langranzi**\n\nThe human body is hard to obtain; birth in the Middle Land is hard to attain; encountering the true Dharma is hard to meet. To possess all three is a fortune beyond measure. Moreover, now that the various immortals have appeared in the world, establishing ladders to ascend the heavens and boats to cross the sea of suffering, silently revealing the mysterious mechanism—how can one not respond?\n\nAwaken fiercely to the swiftness of time; suddenly realize the fleeting clamor of the world. In thought after thought, yearn for the mysterious wind of the ancient sages; in step after step, emulate the return to simplicity of the enlightened ones. Cast aside the fiery pit to tread the cool and refreshing ground; liberate from worldly toil to dwell forever in the realm of freedom.\n\nDo not wait until old age approaches—who knows what comes after this life? Once awakened, one must cut decisively like severing iron or steel—do not drag like water and mud. Correct wrongs and follow what is right—one stroke, two segments. If greed and anger are not severed, how can the field of the heart be clear and still? Only by cutting off love and desire can the vessel of the Dharma be perfected.\n\nWithout realizing the true heart, one remains in illusion and dream. Break free from the net of attachment; leap out of the cage of the ordinary. Then ascend to the immortal realm of the Purple Palace, forever escaping the strange allure of the red dust.\n\nA single staff of goosefoot, drifting across the three thousand worlds of clouds and waters; half a patchwork robe, visiting the twelve grotto-heavens. In the gate of purity and stillness, on the path of non-action, the flavor of the Dharma nourishes the body, and true joy is fully revealed.\n\nReclining in a thatched hall, drinking the pure wind to push open the gate of mystery; dwelling idly in a clay hut, savoring the bright moon to grasp the marrow of yin and yang. Though wives, concubines, children, and grandchildren may be like roosting birds; gold, silver, pearls, and jade are like passing clouds before the eyes.\n\nThus, rejoicing in relinquishing worldly ties, one returns to the grotto-realm; once the lute-string is snapped, the spilled water cannot be gathered again. Parents, wife, and sons—each follows what is convenient. From this day forth, they become as strangers on the road, forever guests in a foreign land. Those who leave the household life harbor no slothful heart; those who remain in it may follow their scattered destinies as they will. Such is the aspiration.\n\nWith reverence, I offer this humble missive, praying you cherish well-being. Here ends the *Pure Regulations of the Complete Realization*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "全真清规 经名：全真清规。 元明间陆道和编集。 一卷。 底本出处：《正统道藏》正一部。 全真清规 姚江春庵通玄子陆道和编集 指蒙规式 大凡初真童蒙出家，寻问明师，然后投礼，既然出家听从师训，长必成人。 师接弟子，先问悟透善根浅深，又观祖上门风善恶，便看本人才不才，方可收录。 先要脱俗，改妆衣服，仙风道气，教而训之，后必有异。 太上云：常知楷式，是谓玄德，能为天下式。 式者，天下法式也，规矩也，模样也，绳墨也。 式从古有，堂自近兴。 明师接人教而训之，先从有为，后学无为。 高门良子时时习之，有所得也。 而无所悟愚迷之师接度弟子，自无所知，教他无为，蠢之又蠢，迷之又迷，生赖教门，死入寒池，填还口债，永劫轮回。 有志之人，亲奉明师，朝参暮礼，听而从之，习学经典，遵守清规。 日至黄昏，烧香上灯，礼谢天地，朝拜圣贤，侍奉师尊。 诸事既了，收敛身心，端身静坐，无起妄想，坚起脊梁，右脚在下，抄手静默，心不外想，瞑目而坐，或一更二更，此为功课。 睡至五更未开静时，切宜早起，洗面梳头，穿衣侍众。 待殿上钟声初通响时，童子上殿列班在内。 二通钟声，耆宿上殿列班在外。 三通钟绝尽，主者上殿，居於正中。 诵经已毕，童子先出。 行道诵经，童子在前，诸殿班次亦复如是。 诵经已了，主者入座，童子躬身，便呼圆揖，大众俱坐，便过茶汤，收酸了毕，大众都散。 童子再入师父房内，稽首作揖，听从师命，或学经教，或去扫地，各有事干。 但见尊长，叉手在心，侧身并拱，傍边侍立，侍尊长已过，方可回身。 或见客人，必先稽首，通报尊长，准备茶汤。 先迎主人，后过客人，叉手侍立。 先收客酸。 后收主醆，客若起身，先出开门卷帘，客主出而后随之。 或随师出入，不可同坐，叉手侍立。 但凡出入，稽首朋众，一切授物，稽首谢之。 不可自是，不得妄言，去除杂念，常行慈善，念道思真。 行须缓步，语话低声，救济患难，接待往来，心量宽弘，慈爱柔和，济物利人，积功累行，依此行持，道不远矣。 簪披次序 弃俗簪披，先将簪冠道具等安於祖师案上，大众圆坐，拜辞俗亲，更换衣服鞋袜等事。 跪在祖师之前，引度之师梳头簪披，道众上殿开启诵经，引领祝圣。 立於香案前，表白读词，三拜上香，复退六拜，祝念已毕，入真官堂诵经。 行礼祖师之前，亦复如是。 诵经已毕，大众复坐，香烛如法。 本师之前，引度领进，跪在师前，三拜迎香，再拜向前，亲手递词，跪在师前表白，接而读之，听从本师授道。 又再三拜，稽首已毕，抬香烛案去就尊长，逐一之前，各各拈香并同如前。 行礼已毕，次入斋堂，受供祖师之前，炷香三拜，大众两边炷香六拜，劝斋。 斋毕起座送客，送客回来，再向厨中并行谢之。 日用所行，诸事方便，苦己利人，降心灭念，敬师奉友，毋起俗情，常检己过，性上用心，参请前辈，谨守清规。 游方礼师 既游诸方，不访师德，且要道具整肃。",
      "translated_text": "**The Complete Perfection Monastic Regulations**\n\n**Title:** *The Complete Perfection Monastic Regulations*. Compiled by Lu Daohe during the Yuan-Ming transition period. One fascicle. Source text from *The Orthodox Daoist Canon*, Proper Section I.\n\n**The Complete Perfection Monastic Regulations**\nCompiled by Lu Daohe, the Master Tongxuan of Chun’an in Yaojiang\n\n**Guidelines for Novices**\nWhen a novice first leaves the secular world, they must seek a enlightened teacher and formally submit to their guidance. Once ordained, they must obey their master’s instructions to mature into a true practitioner.\n\nWhen a master accepts a disciple, they first assess the depth of the novice’s innate goodness and wisdom, observe the moral character of their family lineage, and evaluate the disciple’s own talents. Only then may they be accepted.\n\nFirst, the novice must shed worldly attachments, change their attire, and cultivate the demeanor of an immortal, embodying the Daoist spirit. Through instruction and discipline, they will eventually attain distinction.\n\nAs the Most High said: *\"To constantly embody the model is called mysterious virtue, for one becomes the standard for all under Heaven.\"*\n\nA *model* is the law, the rule, the pattern, the plumb line for the world. Such standards have existed since antiquity, while monastic halls have arisen in recent times.\n\nAn enlightened master, when accepting and instructing disciples, begins with concrete practices before guiding them toward the formless. Disciples from noble lineages who diligently cultivate these teachings will attain realization.\n\nYet if a deluded master, lacking understanding, instructs disciples in the formless from the outset, both teacher and student will remain ignorant, sinking deeper into confusion. Though they rely on the teachings in life, in death they will fall into the icy abyss, repaying their karmic debts through endless rebirth.\n\nThose of sincere aspiration should seek an enlightened master, paying morning and evening respects, listening and obeying, studying scriptures, and upholding the monastic regulations.\n\nFrom dawn till dusk, they burn incense, light lamps, offer thanks to Heaven and Earth, and pay homage to the sages and immortals while serving their master with reverence. Once these duties are complete, they collect their thoughts, sit upright in stillness, free from distracting thoughts, straighten their spine, place the right foot beneath the left, clasp their hands in silence, turn their mind inward, and close their eyes in meditation—whether for one or two watches of the night—as their daily practice.\n\nWhen the fifth watch approaches but the morning bell has not yet sounded, they must rise early, wash their face, comb their hair, dress, and attend to the assembly. As the first bell rings in the hall, the novices enter and line up inside. At the second bell, the senior monks enter and line up outside. When the third bell ceases, the officiant enters and stands at the center.\n\nAfter the recitation of scriptures, the novices exit first. During processions and scripture recitations, novices lead, and this order is observed in all halls. Once the recitation concludes, the officiant takes their seat, and the novices bow deeply, calling for a full bow from the assembly. All sit, tea is served, and once the cups are cleared, the assembly disperses.\n\nThe novices then enter their master’s chamber, prostrate, and bow, awaiting instructions—whether to study scriptures or sweep the floor, each task assigned accordingly.\n\nWhen encountering elders, they clasp their hands over their heart, stand to the side with a slight bow, and remain attentive until the elder passes before turning away. When guests arrive, they must first bow, announce their presence to the elders, and prepare tea. They first greet the host, then the guest, standing with clasped hands. They first clear the guest’s cup, then the host’s. If the guest rises, they open the door and roll up the curtain, following the host and guest out.\n\nWhen accompanying their master, they must not sit beside them but stand with clasped hands. In all comings and goings, they bow to their peers. When receiving anything, they bow in gratitude. They must not be self-righteous, nor speak recklessly, but dispel distracting thoughts, cultivate kindness, contemplate the Dao, and aspire to truth.\n\nThey walk with measured steps and speak in a low voice. They aid those in distress, welcome travelers, maintain a broad and compassionate heart, act with gentleness and love, benefit others, accumulate merit through virtuous deeds, and uphold these practices—thus the Dao is not far.\n\n**Order of Ordination**\nWhen renouncing the secular world and receiving the Daoist topknot and robe, the ordination implements are placed upon the altar of the Patriarch. The assembly sits in a circle, bidding farewell to worldly kin, and changing into their new attire, shoes, and socks.\n\nKneeling before the Patriarch, the ordaining master combs their hair and bestows the topknot and robe. The assembly enters the hall, begins the scripture recitation, and leads the prayers of blessing. Standing before the incense table, the officiant reads the proclamation, bows three times to offer incense, then retreats to perform six bows. After the prayers conclude, they enter the Hall of True Officials to recite scriptures, bowing before the Patriarch in the same manner.\n\nOnce the recitation ends, the assembly sits again, and incense and candles are arranged properly. Before their master, the ordaining master leads the initiate forward to kneel, bow three times to receive the incense, then bow again to approach. The master hands them the proclamation, which they kneel to read aloud, then receive the transmission of the Dao from their master.\n\nThey bow three more times, prostrate, then carry the incense and candle table to each elder in turn, offering incense as before. After the rites conclude, they enter the refectory, bow three times before the Patriarch’s altar, and the assembly bows six times on either side to encourage the meal. After the meal, they rise to see off the guests, then return to express gratitude in the kitchen.\n\nIn daily conduct, they should act with flexibility, endure hardship for others’ benefit, subdue the mind and extinguish distracting thoughts, respect their master and serve their peers, avoid worldly attachments, constantly examine their faults, focus on cultivating their nature, seek guidance from elders, and strictly uphold the monastic regulations.\n\n**Etiquette for Traveling and Seeking Masters**\nWhen traveling to various regions, one must not only seek virtuous masters but also ensure their ordination implements are properly arranged.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1151,
      "start_sentence": 0,
      "end_sentence": 49,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.69998335838318,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\全真清规.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "初到入院，便看西廊有息肩二字或驻鹤二字，於此便歇。 或久住，檐子平放。 或经过，头高头低。 靠在壁上，便取氅衣搭在左手。 或有直堂知客出来，便穿氅衣，稽首宾主。 或问来历，某州某观师某姓，答曰：某处、某州、某姓。 问答已毕，请入。 若旦过，除铺盖外，并皆入包。 铺单了毕，洗足更衣。 复见知客，行礼曰：即日恭惟知宾大德先生起居多福，某久闻仙隐，特来瞻仰，荷蒙收录，铺单展钵，不胜感激之至。 稽首。 领见主者，礼曰：即日恭惟提点真人起居清福，某久闻道风广博，特来座下瞻仰尊颜，荷蒙收录，铺单展锋，不胜感激之至。 稽首。 或留茶毕，起身相谢：适间轻践方丈，荷蒙煎点，下情无任激切屏营之至。 稽首。 行礼已毕，归单。 主者答曰：山门有幸，鹤驾来临，有失迎接，不胜云云。 又起单相留曰：院门寂寥，堂厨淡薄，敢望高士久留鹤驾，起助道风，无任攀恋望恩之至。 稽首。 堂门戒腊",
      "translated_text": "Upon first arriving at the monastery, one should look for the characters \"息肩\" (Resting Shoulders) or \"驻鹤\" (Perching Crane) on the western corridor and rest there. If intending to stay long-term, the carrying pole is laid flat; if merely passing through, the ends may be uneven. Leaning against the wall, one takes the outer robe and drapes it over the left arm. If the head monastic receptionist emerges from the main hall, one dons the outer robe and exchanges bows as host and guest. If asked about one’s origins, one replies: \"From such-and-such abbey in such-and-such prefecture, under Master So-and-so, of the such-and-such surname.\" The response should be: \"From such-and-such place, such-and-such prefecture, of the such-and-such surname.\" Once the exchange concludes, one is invited inside. If staying only for the day, all belongings except bedding are packed away. After spreading the mat and arranging the bowl, one washes the feet and changes clothes. One then meets the receptionist again, bowing and saying: \"Today, I humbly wish the Venerable Receptionist great fortune in health and well-being. Having long heard of your secluded transcendence, I have come especially to pay my respects. I am deeply grateful for your kindness in receiving me, providing a mat, and setting out my bowl.\" With a bow, one proceeds to meet the monastery’s director, offering salutations: \"Today, I humbly wish the Esteemed Director, the Perfected One, abundant purity and blessings. Having long heard of the vastness of your Dao-inspired virtue, I have come to gaze upon your honored presence. I am profoundly grateful for your kindness in receiving me, providing a mat, and setting out my bowl.\" With a bow, after tea is served, one rises to express thanks: \"Just now, I lightly intruded upon your quarters. I am deeply moved by your gracious hospitality in preparing tea, and my heart is filled with boundless gratitude.\" With a bow, the formalities conclude, and one returns to one’s mat. The director responds: \"The monastery is honored by your crane-like presence. We regret not having welcomed you properly.\" Then, rising to urge one to stay, the director says: \"The monastery is quiet, and our hall and kitchen are humble. We dare hope that the noble one will linger like a crane, uplifting the monastery’s Dao-inspired virtue. Our longing and admiration are beyond words.\" With a bow, the rules of the monastic hall and the seniority of ordination are observed.",
      "overlap_context": "bility, endure hardship for others’ benefit, subdue the mind and extinguish distracting thoughts, respect their master and serve their peers, avoid worldly attachments, constantly examine their faults, focus on cultivating their nature, seek guidance from elders, and strictly uphold the monastic regulations.\n\n**Etiquette for Traveling and Seeking Masters**\nWhen traveling to various regions, one must not only seek virtuous masters but also ensure their ordination implements are properly arranged.",
      "start_char": 1151,
      "end_char": 1517,
      "start_sentence": 50,
      "end_sentence": 69,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.118377208709717,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\全真清规.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "接众者先须旦过三日，然后请入库厅，看验文凭，某处某年某月某日投师授道。 书录青册。 然后安单，便看青册，排名排姓，各看排单，知己知人，便遵戒腊。 前后必让尊卑远近，上殿登堂，依次序而行，行住坐卧，分长幼而居，各守戒腊，莫犯高低。 依院门之次序，行方外之尊卑。 坐钵规式 夫坐钵者，自十月初一日为始集众，过冬至新年正月中旬满散，百日为则。 如入堂者，各请情愿。 本来各各专为自己，生死事大，无常迅速，递相究竟琢磨，参问师德，听从规矩。 钵有动静，动则许容徐徐运动，静则不然。 如有神昏点头，摇撼身屈，主钵先行巡牌，以牌挂在昏者身上，三击而退，然后轻轻取牌，徐徐起身，巡究他人后犯者替。 或钵未终，钟未呜，静牌未换，无故出入，语话动摇，不依规矩者，并行责罚。 一　如有违犯前项事者，副钵举行，主钵责罚。 初犯白堂，再犯罚茶，三犯出堂，重者并行清规祖师则例。 一　昼夜十二钵，以按十二时。 三静九混，以按三元九气，又日三返九还。 一　每日至五更寅时，闻开静板响，各请洗漱，朝真礼圣。 卯时早斋。 辰时混坐。 巳时静钟三通，各各静坐，如法用功。 午时赴斋？ 未时混坐。 申时如前入静。 酉时晚参。 戌时混坐茶汤。 亥时如前入静，用功如法。 子时歌咏，教演诗词，以敌睡魔。 主钵先举，每行三遍，不可以多。 丑时放参，各请随意。 副钵专一提钵，不可久沈，人各诚敬心 三不起身 夫不起身者，大众常住，自有知客，或有直堂应答酬酢，迎接宾客，相送往来，众不可动，以乱堂式。 一  打坐不起。 澄湛天心，调息元和，究竟本来，默运玄机，体若太虚，不摇不动，任从来往，人各诚心，静坐如法。 二　诵经不起。 人各运心，威仪整肃，调声运气，心思意解，耳闻目视，音声相和，前后相随，任人来往，各自皈依，诵经如法。 三　赴斋不起。 念道思真，心清意静，神定气和，静默受供，展钵无声，登堂不语，任他短长，人各恭敬，斋坐如法。 全真体用 祖师设教，仙圣度人，开大乘之门径，通众妙之要津。 俾归元而造理，警心妄以全真。 贵忠心於清静，务圆性於朴淳。 深明短景，至乐长春。 故不挂利名，毋黏世事。 明大体，金洁玉莹为心； 养元机，介石洁冰为志。 济人利物，融一理以周通； 炼己还元，总万德而中备。 任其偏执之徒，修证圆机之士，无辨无争，不矜不是也。 清居琳宇，混处云堂。 莫觑他非过短，当除自是强梁。 心脱洒，随方和顺； 量豁畅，到处温良。 早晚赴斋，当拱手诚心而默坐； 朝昏参圣，务擎拳缓步以趋锵。 体上达，威仪整肃； 居下流，举措荒唐。 逮乎密叩真机，参同玄要，奉师至敬笃恭，问道精诚虔告。 晓万理以还元，凝一真而妙用。 豁开道眼，安然默照於妙微； 莹彻天心，感应返观於灵激。 逆则含容，犯休讥诮。 低心敬承乎同袍，克己静待乎不肖。 大凡参详教典，讲习经书，当实穷灵源根本，毋虚嘲口鼓之乎。 彻圣心之意外，融自性之元初。 参问精明，方为绝学，穷通博贯，始乐无为。 心条达性，玲珑自然，真乐无极，气融冲神。 寂默卓尔，体同太虚。 若水之平清柔顺，如云之缥缈卷舒。 原夫欲其达道了心，全在实行真功。",
      "translated_text": "Upon receiving new members, one must first observe them for three days. Only then may they be invited into the storehouse hall to verify their credentials, confirming where and when they took their master and received the Dao. Their details are recorded in the blue register. Afterward, they are assigned a sleeping mat. Consulting the blue register, their names are arranged by seniority, and each is shown their designated place. Thus, one knows oneself and others, and observes the precepts and ordination seniority. In all matters—whether entering the hall, ascending the platform, walking, standing, sitting, or lying down—one must yield to those of higher rank or greater seniority, respecting the order of precepts and ordination. Follow the monastery’s hierarchy while upholding the proper deference of the religious life.\n\n**Rules for Sitting the Alms-Bowl**\nThe practice of sitting the alms-bowl begins on the first day of the tenth month, gathering the assembly. It continues past the Winter Solstice until the middle of the first lunar month of the new year, lasting one hundred days as the standard. Those who enter the hall do so of their own volition. Each comes solely for their own sake, for the great matter of life and death is urgent, and impermanence arrives swiftly. They examine and refine one another, inquiring of the master’s virtue and adhering to the rules. During the alms-bowl session, there is movement and stillness: when moving, one may proceed slowly; when still, one must remain so. If someone grows drowsy, nodding or swaying, the bowl monitor first patrols with the warning tablet, placing it on the offender’s shoulder. After three strikes, it is removed, and the offender rises gently to continue patrolling, replacing the next violator. If, before the session ends, the bell has not sounded, the stillness tablet remains unchanged, and one leaves or enters without cause, speaks, or disturbs the order, they shall be disciplined.\n\n1. For those who violate the above rules, the assistant bowl monitor shall report the matter, and the bowl monitor shall administer discipline. First offense: reprimand before the hall. Second offense: tea penalty. Third offense: expulsion from the hall. Severe violations shall be addressed according to the monastery’s regulations and ancestral precedents.\n\n2. The twelve alms-bowl sessions day and night correspond to the twelve hours. The three stillnesses and nine movements align with the Three Origins and Nine Qi, also known as the three returns and nine cycles.\n\n3. Each day at the fifth watch, the *yin* hour, upon hearing the board signaling the end of stillness, all wash and rinse, pay homage to the immortals, and venerate the sages. At the *mao* hour, morning gruel is taken. At the *chen* hour, mixed sitting. At the *si* hour, the stillness bell rings three times, and all sit in meditation, cultivating practice as prescribed. At the *wu* hour, one attends the meal. At the *wei* hour, mixed sitting. At the *shen* hour, as before, one enters stillness. At the *you* hour, evening audience. At the *xu* hour, mixed sitting with tea. At the *hai* hour, as before, one enters stillness, cultivating practice as prescribed. At the *zi* hour, singing and reciting poetry to resist the demon of sleep. The bowl monitor leads, repeating each piece three times—no more. At the *chou* hour, the session ends, and all may act as they please. The assistant bowl monitor must remain vigilant, ensuring no one lingers too long. Each must cultivate a sincere and respectful heart.\n\n**The Three Unmovings**\nIn the great assembly of the monastery, there are always guest managers and duty monks to respond to exchanges, welcome guests, and see them off. The assembly must not stir, lest they disrupt the hall’s order.\n\n1. **Unmoving in Meditation**\n   Clarify the celestial mind, regulate the breath to harmonize primordial qi, investigate the original nature, and silently activate the mysterious mechanism. The body, like the great void, remains unshaken and unmoved. Let others come and go; each cultivates a sincere heart and sits in meditation as prescribed.\n\n2. **Unmoving in Recitation**\n   Each directs their mind, maintaining solemn dignity. Regulate the voice and qi, focus the thoughts, and comprehend the meaning. Listen with the ears, observe with the eyes, harmonize the sounds, and follow one another. Let others come and go; each returns to devotion and recites the scriptures as prescribed.\n\n3. **Unmoving at Meals**\n   Contemplate the Dao and reflect on the true. The mind is clear, the intent serene. Spirit settled, qi harmonized, one silently receives the offering. Unfold the alms-bowl without sound, ascend the hall without speech. Let others be long or short; each cultivates reverence and sits at meals as prescribed.\n\n**The Substance and Function of the Complete Truth**\nThe ancestral masters established the teachings, and the immortals and sages delivered sentient beings, opening the gateway to the Great Vehicle and the essential ford of myriad wonders. They guided beings to return to the origin and comprehend principle, awakening the deluded mind to preserve the true. Value loyalty in clarity and stillness, and strive to perfect the nature in simplicity and purity. Deeply understand the brevity of life, and attain the supreme joy of eternal spring. Thus, do not cling to profit or fame, nor entangle yourself in worldly affairs. Comprehend the great essence, and let the heart be as pure as gold and jade. Nurture the primordial mechanism, and let the aspiration be as steadfast as stone and as clear as ice. Aid others and benefit all things, harmonizing the one principle to achieve universal penetration. Refine the self and return to the origin, embodying myriad virtues in perfect balance. Whether one is a stubborn practitioner or a master of the round mechanism, there should be no discrimination, no contention, no pride, and no fault-finding. Dwell in the jade-like abode, and mingle in the cloud-like hall. Do not scrutinize others’ faults or shortcomings; instead, eliminate one’s own arrogance and obstinacy. The heart is free and at ease, adapting to circumstances with harmony. The capacity is vast and unobstructed, gentle and kind in all places. When attending meals morning and evening, one should fold the hands, cultivate a sincere heart, and sit in silence. When paying homage to the sages at dawn and dusk, one must raise the fists, walk slowly, and proceed with measured steps. Those who embody the higher way maintain solemn dignity; those who dwell in the lower stream act with reckless abandon. When secretly inquiring into the true mechanism and investigating the mysterious essentials, one must revere the master with utmost respect and sincerity, and inquire of the Dao with earnest devotion. Comprehend the myriad principles to return to the origin, and concentrate the one true to manifest its wondrous function. Open the Dao-eye wide, and abide in silent illumination of the subtle. Penetrate the celestial mind, and respond with introspection to the numinous stirrings. In adversity, contain and endure; when offended, refrain from ridicule. Humble the heart and respect one’s fellow practitioners; restrain the self and patiently await the unworthy. In all matters of studying the teachings and discussing the scriptures, one should thoroughly explore the spiritual source and root, not merely engage in empty chatter or idle speculation. Penetrate beyond the intent of the sages’ hearts, and merge with the original nature of one’s own being. Only through precise inquiry and clear discernment does one attain the ultimate learning. Mastery of the profound and the broad brings joy in non-action. The heart is orderly, the nature is lucid, and the true joy is boundless. Qi harmonizes with the spirit, and stillness stands alone, the body in unity with the great void. Like water, it is level, clear, gentle, and yielding; like clouds, it is ethereal, drifting, and unfolding. To attain the Dao and understand the heart, one must truly practice the authentic work.",
      "overlap_context": " returns to one’s mat. The director responds: \"The monastery is honored by your crane-like presence. We regret not having welcomed you properly.\" Then, rising to urge one to stay, the director says: \"The monastery is quiet, and our hall and kitchen are humble. We dare hope that the noble one will linger like a crane, uplifting the monastery’s Dao-inspired virtue. Our longing and admiration are beyond words.\" With a bow, the rules of the monastic hall and the seniority of ordination are observed.",
      "start_char": 1517,
      "end_char": 2765,
      "start_sentence": 70,
      "end_sentence": 139,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.36280393600464,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\全真清规.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "戒狂放则不堕偏邪，处厚实则了归中正。 去己非、常乐安和； 不自是、谁与争竞。 情泯则心闲，尘清则垢净。 处治规划，毋独主以专行； 公务作为，随常住之普请。 奸猾慵狡，则败德招愆； 嫉妬欺瞒，则丧身失命。 逐声色好胜则凡，忌人我息中则圣。 是以大达多多阴德，真人暗暗偷功。 常存道气，回避俗风。 戒行精严，断无四非八识； 功夫绵密，决证九转六通。 恣爱慕，逐邪魔之境； 贪口腹，堕饿鬼之中。 常寂坐而慧烛，莫肆情而迷蒙。 志存平等，心乐齐同。 见物休怀私昧，应缘力务公忠。 切要行止顺时，云为先烛； 偏倚速改，差过早复。 心弯曲则处处争差，性停当则人人信伏。 猖狂骄傲，性必轻浮； 佞慢诈欺，命思薄福。 上士厚气以敦颐，高明卑谦而自牧。 毋忝教法清高，莫犯堂规罚辱。 敬体前因，各宜雅肃。 融精神以固守，持元气以不先。 体证金莲，果登玉境。 同逍遥玄元之未始，共快乐象帝之先天。 咦，天圆地方应规矩，性灵命丰合金仙。 钵室赋 全真道海，仙圣心渊。 於中明太极，向裹隐壶天。 窍眼通中，象灵泉而上涌； 钵心透底，使神水之升涎。 高明处则仰虚中主宰，上善居则柔顺乎渊泉。 息波浪则心如碧水，静风涛则性体金莲。 一志湛寂而不变，三心澄澈以无迁。 毋滚流则安於止定，若静息则可以方圆。 原夫坐钵习定，入室修功，有虚中而洞达，从实处以圆通。 会天地於半升铛内，潜情性於一钵室中。 融玄元之祖气，鼓浩劫之真风。 万法彻通兮肃清绛阙，诸尘净尽兮皎洁灵宫。 云朋心一而敬比，霞友志和以合同。 大凡摄念潜心，返情复性，起居最要安常，餐饮切休过盛。 妄心灭而寂照元神，真息调而融冲慧命。 入坐时含光默默以虚心，开静时返视徐徐而出定。 睡魔倏至，人人不觉头点身摇； 昏障忽来，个个鲜知口开气迸。 巡行专在於警提，挂牌务存於救正。 当自返以谦柔，休昧己而强硬。 本为生死修持，毋生人我辩竞。 切宜起离昏散，抖搜精神。 恭身先拜仙圣，回首次谢志仁。 当生惧喜，毋起怒嗔。 自然心中安泰，快乐壶内熙春。 克己报德，实於上士； 强怀反恨，真是小人。 莫自是徒为虚诈，当省非厚养朴淳。 详夫先圣规矩，祖师钵义。 金返本乃钵之源，情归性乃钵之理。 钵圆混以象乾元，中虚犹太始。 森罗悉备其中，造化皆全个裹。 因有透漏，不觉而沈； 由无点滴，忽然而起。 冰澄湛而悟归源，钵浮沈而明返己。 大抵以无喻有，假实体虚。 琢磨必从师友，了达须下功夫。 当参明父母未生之始，常返照身心彻勤之初。 实纯志士，须谦卑而遵近； 怪友狂朋，必柔顺以远疏。 壶公瓮牖，真乐无极； 颜子箪瓢，至乐有余。 体圣仙隐几而密处，效真人阛堵以渊居。 得乎安静，乐乎恬如，审乎钵室，连单丛林，知识共处。 历劫希逢，宿生难遇。 空碧炼真兮，共乐始青； 虚室生白兮，同安太素。 自始了终，从朝至暮。 中期不可改移，圆满任从去住。 闲闲上智，心豁畅飘逸白云； 戚戚下愚，性执蔽迷蒙黑雾。 二时绵密育神灵，百日安常凝气固。 旦夕缓舒。 食可接气，衣堪御寒。 过用则脏腑失理，调停则神气常安。 苦志精修，废寝忘餐。 常寂照甘心磨炼，返真观舍身努力。 养得气神一定，自然性命双全。",
      "translated_text": "Guard against recklessness and dissipation, and you will not fall into deviation or perversity; abide in sincerity and solidity, and you will fully return to central uprightness. Discard your own faults, and ever delight in peace and harmony; do not assert your own rightness, and who will contend with you? When emotions dissolve, the heart is at leisure; when dust is cleansed, filth is purified.\n\nIn managing affairs and making plans, do not act alone with arbitrary authority; in public duties and undertakings, follow the common summons of the community. Cunning and laziness, deceit and guile, lead to moral corruption and invite transgression; jealousy, envy, and deceit bring ruin to the body and loss of life. Pursuing sensory pleasures and seeking to outdo others keeps one in the realm of the ordinary; quelling attachment to self and others leads to sagehood.\n\nThus, the greatly enlightened accumulate hidden virtues, and true persons secretly cultivate merit. Constantly preserve the qi of the Dao, and avoid the winds of the mundane. Let your precepts be precise and strict, cutting off the four wrongs and the eight consciousnesses; let your practice be continuous and refined, decisively attaining the nine transformations and six penetrations. Indulging in desire and admiration draws one into demonic realms; gluttony and craving cast one into the realm of hungry ghosts.\n\nSit in constant stillness, and wisdom’s torch shines; do not give free rein to emotions, lest you fall into delusion. Let your aspiration abide in equality, your heart delight in sameness. When encountering things, do not harbor private obscurity; in responding to conditions, strive to act with impartial loyalty. In all conduct, movement and stillness must follow the seasons, with foresight guiding action; deviations must be swiftly corrected, and errors promptly redressed.\n\nA crooked heart leads to contention everywhere; a settled nature wins the trust and submission of all. Arrogance and haughtiness make the nature frivolous; flattery, sloth, and deceit thin one’s allotted fortune. The superior person nurtures qi with generosity and cultivates dignity; the lofty and wise humble themselves to self-mastery. Do not dishonor the purity of the teachings, nor violate the hall’s rules to incur punishment and disgrace. Reverently embody past causes, and all should conduct themselves with refined solemnity.\n\nMerge spirit to solidify your hold, and preserve original qi without precedence. Realize the golden lotus, and ascend to the jade realm. Together wander in the unbegun of the mysterious origin, and share the joy of the primordial before heaven and earth.\n\nAh! Heaven is round, earth is square—they accord with compass and square; nature is numinous, life is abundant—they unite with the golden immortals.\n\n*The Alchemy of the Bowl Chamber*\n\nThe vast sea of the Complete Reality Dao, the profound heart of immortals and sages—within it, the Great Ultimate is made clear, and within it lies hidden the celestial realm of the pot. The aperture of the eyes connects to the center, like a numinous spring welling upward; the heart of the bowl penetrates to the depths, causing the divine water to rise and flow.\n\nIn lofty clarity, one looks up to the empty center’s governance; in the abode of supreme goodness, one dwells in the soft compliance of the deep spring. When waves cease, the heart is like limpid blue water; when winds and billows are stilled, the nature’s body is the golden lotus. With single-mindedness, deep and still, unwavering; with three minds, clear and limpid, unchanging.\n\nDo not let the current roll, and you will be at peace in cessation and stability; if you still your breath, you may then be square or round. Now, sitting in the bowl to cultivate stillness, entering the chamber to refine merit—there is emptiness within that brings thorough penetration, and from the solid, one achieves perfect comprehension. Gather heaven and earth within a half-sheng cauldron; conceal emotions and nature within a single bowl chamber. Merge with the ancestral qi of the mysterious origin, and stir the true wind of kalpas past.\n\nAll dharmas thoroughly penetrate—oh, how solemn and pure the crimson towers! All dusts are utterly cleansed—oh, how bright and immaculate the numinous palace! Cloud companions unite in heart with reverence; rosy-friend comrades harmonize in aspiration to join as one.\n\nIn general, gathering thoughts and calming the mind, returning emotions and recovering nature—daily life must above all be peaceful and regular, and eating and drinking must never be excessive. When the deluded mind is extinguished, the original spirit shines in quiescent illumination; when the true breath is regulated, the life of wisdom merges with the primordial.\n\nWhen entering meditation, contain your light and silently empty the heart; when emerging from stillness, slowly turn your gaze inward and exit samadhi. The sleep demon suddenly arrives, and no one notices their head nodding and body swaying; the dullness hindrance abruptly comes, and few recognize their mouth gaping and breath scattering.\n\nPatrolling vigilance lies in alertness and rousing; hanging the plaque must uphold correction and rectification. Always return to humility and gentleness; do not obscure yourself with obstinacy. This is for cultivating life and death—do not engage in disputes over self and others. Be sure to rise from dullness and distraction, and shake off torpor to rouse the spirit.\n\nFirst bow reverently to the immortals and sages, then turn to thank the benevolent and kind. Let awe and joy arise, but never anger or resentment. Naturally, the heart will be at peace, and joy will fill the pot’s interior with spring’s warmth.\n\nRestraining the self to repay virtue is the mark of the superior person; harboring resentment and returning hatred is the way of the petty. Do not assert your own rightness and act in vain deceit; reflect on your faults and nurture simplicity and sincerity.\n\nExamining the rules of the former sages and the bowl’s meaning as taught by the patriarchs: returning metal to its root is the bowl’s source; emotions returning to nature is the bowl’s principle. Round and undifferentiated, it images the primal heaven; empty within, it is like the great beginning. All the myriad things are complete within it; all transformations are fully contained therein.\n\nIf there is leakage, one sinks unawares; if there is not a single drop, one suddenly rises. When ice is clear and still, one awakens to returning to the source; when the bowl floats and sinks, one understands the return to the self. Generally, use the nonexistent to illustrate the existent, and borrow the solid to embody the empty. Polishing and refining must come from teachers and friends; thorough comprehension requires diligent effort.\n\nOne must inquire into the state before father and mother were born, and constantly turn the light inward to the beginning of diligent body and mind. The truly pure-hearted scholar must be humble and draw near; strange friends and reckless companions must be gently and submissively kept at a distance.\n\nMaster Hu’s jar and window—true joy without limit; Yanzi’s bamboo bowl and gourd—supreme joy in abundance. Emulate the sages and immortals, who dwell in seclusion with subtle closeness; follow the true persons, who live in marketplaces with profound abiding.\n\nAttain tranquility and delight in serenity; examine the bowl chamber, the monastic community, and the company of fellow practitioners. Through kalpas, rarely encountered; from past lives, difficult to meet. Refining the true in the empty azure—oh, together delighting in the beginning of blue! The empty chamber generates whiteness—oh, together abiding in the great simplicity!\n\nFrom beginning to end, from dawn to dusk, the middle period must not be altered; at completion, one may freely go or stay. The carefree superior person’s heart is open and soars with the drifting white clouds; the anxious inferior person’s nature is obscured and lost in the dark mist.\n\nTwice daily, continuously nurturing the spirit; a hundred days, peacefully solidifying qi. Morning and evening, move slowly and relax. Food can connect qi; clothing suffices to ward off cold. Excessive use disorders the viscera; moderation keeps spirit and qi constantly at peace.\n\nWith bitter resolve, refine diligently, abandoning sleep and forgetting meals. Constantly in quiescent illumination, willingly endure the grind; returning to the true, observe and strive with the body. Nurture qi and spirit until they are settled and unified, and naturally, nature and life are both preserved.",
      "overlap_context": "inquiry and clear discernment does one attain the ultimate learning. Mastery of the profound and the broad brings joy in non-action. The heart is orderly, the nature is lucid, and the true joy is boundless. Qi harmonizes with the spirit, and stillness stands alone, the body in unity with the great void. Like water, it is level, clear, gentle, and yielding; like clouds, it is ethereal, drifting, and unfolding. To attain the Dao and understand the heart, one must truly practice the authentic work.",
      "start_char": 2765,
      "end_char": 3982,
      "start_sentence": 140,
      "end_sentence": 228,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.355308294296265,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\全真清规.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "一贯三才，无极妙阙，六通四达，有太虚宽。 可报檀那信供，足酬主者安单。 顿超妄幻，永乐真惧。 噫，脱生灭之境界，超造化之乾坤。 游咏先天而逍遥大象，彷徨无极而快乐真元。 绰绰然全真而最上，巍巍乎独立以尊先。 既处玄门，当遵教法。 欲超道岸，必假慈航。 教主重阳帝君责罚榜 夫道之理者，杳冥太极之上，岂可易见。 故天下寻者多，悟者少。 空虚无为之道，乾坤浩浩自然之气，阴阳光而生物像有作，柰何今万古远矣。 且以藤纳孤行而自分也，动止形仪不可违也。 兹者以得居善地，私结圣堂，率千里而来之善侣，合十方有信之良朋。 故立教规，幸希笑览： 一、犯国法遣出。 二、偷盗财物遗送尊长者，烧毁衣钵罚出。 三、说是谈非、扰堂闹众者，竹篦罚出。 四、酒色财气食荤，但犯一者罚出。 五、奸猾慵狡、嫉姤欺瞒者罚出。 六、猖狂骄傲、动不随众者罚斋。 七、高言大语、作事躁暴者罚香。 八、说怪事戏言、无故出庵门者罚油。 九、干事不专、奸猾慵懒者罚茶。 十、犯事轻者并行罚拜。 右伏以遍请知音，今依此法，三人行必有我师焉。 一室而居，与骛子勤劳言化而自我，法不加於上善，刚不过於至柔。 圣人三省其身，可谓大矣。 幸遇明师，善逢圣教，若不教行，岂为上善。 晓示合堂，常加觉察，毋致违犯。 依此禁戒之后，不得男女混杂，纵心恣意。 切恐十方施主饮食难消，不念寸阴可惜，不得虚度。 谨慎修持，庶得道心坚固。 不戒恐失前程，请细思详。 谨榜。 了真子升堂文",
      "translated_text": "The One pervades the Three Powers; the wondrous gate of the Limitless opens wide. Six penetrations, four directions—all spacious as the Great Void. Thus may the alms of the faithful be requited, and the host’s hospitality be fully repaid. Swiftly transcend delusion and illusion, forever delighting in true reverence.\n\nAlas! Escape the realm of birth and death, surpass the cosmos of creation. Roam and chant in the primordial, carefree within the Great Image; wander the boundless, rejoicing in the true origin. How expansive—perfect in reality and supreme! How majestic—standing alone, revered above all.\n\nHaving entered the Mystery Gate, one must follow its teachings and laws. To ascend the Dao’s shore, one must board the Vessel of Compassion.\n\n**Notice of Punishments by the Venerable Founder, Emperor Chongyang of the Quanzhen Tradition**\n\nThe principle of the Dao abides in the profound obscurity above the Supreme Ultimate—how could it be easily perceived? Thus, many seek it, but few awaken. The Way of emptiness and non-action, the vast and spontaneous qi of Heaven and Earth, the interplay of yin and yang giving rise to the myriad forms—how distant it seems across the ages!\n\nYet, like a vine clinging to a solitary path, one must not deviate in movement or bearing. Now, having secured this auspicious place and privately established this sacred hall, I have gathered virtuous companions from a thousand leagues and united faithful friends from all directions. Therefore, I establish these teachings and rules, humbly inviting your perusal:\n\n1. Violators of national law shall be expelled.\n2. Those who steal property and send it to their superiors shall have their robes and alms bowls burned and be expelled.\n3. Those who spread gossip, disturb the hall, or incite the assembly shall be caned and expelled.\n4. Those who indulge in wine, lust, wealth, anger, or meat—even in one of these—shall be expelled.\n5. Those who are cunning, lazy, jealous, or deceitful shall be expelled.\n6. Those who are arrogant, unruly, or refuse to follow the assembly shall be punished with fasting.\n7. Those who speak boastfully, act rashly, or with violence shall be punished with incense offerings.\n8. Those who tell strange tales, jest idly, or leave the hermitage without cause shall be punished with oil offerings.\n9. Those who neglect their duties, act cunningly, or are lazy shall be punished with tea offerings.\n10. Those who commit minor offenses shall be punished with prostrations.\n\nRespectfully, I address all fellow practitioners: by these laws, wherever three walk together, one may be my teacher. Dwelling in one chamber, we labor together in words and transformation, yet the law does not burden the most virtuous, and firmness does not exceed the utmost softness. The sage examines himself thrice daily—how great is this!\n\nFortunate to meet a wise teacher and encounter the sacred teachings, if we do not practice them, how can we be called the highest good? I hereby clarify these rules for the entire hall, urging constant vigilance to avoid transgression.\n\nAfter these prohibitions, men and women must not intermingle, nor may one indulge the heart’s desires. Beware lest the offerings of patrons from all directions become difficult to repay, lest one fail to cherish even an inch of time, lest one waste it in vain.\n\nDiligently cultivate with care, that the heart of the Dao may become steadfast. Without discipline, one risks losing the path ahead—ponder this deeply.\n\n**Notice.**\n**Proclamation of Liaozhenzi upon Ascending the Hall.**",
      "overlap_context": "orning and evening, move slowly and relax. Food can connect qi; clothing suffices to ward off cold. Excessive use disorders the viscera; moderation keeps spirit and qi constantly at peace.\n\nWith bitter resolve, refine diligently, abandoning sleep and forgetting meals. Constantly in quiescent illumination, willingly endure the grind; returning to the true, observe and strive with the body. Nurture qi and spirit until they are settled and unified, and naturally, nature and life are both preserved.",
      "start_char": 3982,
      "end_char": 4599,
      "start_sentence": 229,
      "end_sentence": 264,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.530162572860718,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\全真清规.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "切以玄元圣祖，广开众妙之门； 大道全真，善化覃生之教。 瑶池仙子，重阳金莲七朵； 阆苑琼林，长春玉花万叶。 虽则枝分梢异，到了万叶归根。 然则派别流差，必竟百川还海。 方方设教，会四海之云朋； 处处兴缘，聚三山之霞友。 茅庵草舍，普修宝殿琳官； 纸袄麻衣，恩赐星冠月佩。 可谓人能弘道，阐先圣之规模。 自然道法应人，开后世之眼目。 了真堂上，元无一点萦心； 万行门头，正好诸人着力。 在上者当处宽慈，在下者常存敬顺。 尘心争辩，不显体玄之家风。 道眼相从，依旧丹阳之活计。 宿为物外之仙属，今作门中之法眷。 住世同修道果，超凡共列仙班。 出家仙子，青眼研穷； 离尘烈士，赤心照察。 欲待广谈秘奥，仍妨久立仙班。 稽首云朋，伏惟珍重。 长春真人规榜 夫住庵者，清虚冷澹，潇洒寂寥，见性为体，养命为用。 柔弱为常，谦和为德，慈悲为本，方便为门。 在众者常存低下，处静者勿起尘情。 所有尘劳，量力运用，不可过度。 每一衣一食，不过而用之。 每计庵粮，不可积剩。 治身衣物，不可贪求。 或常住之物有余者，济赡往来经过贫难之士。 或於他处行缘，或以备斋设会。 十二时中，不着於假，常要明真。 扫除尘垢，刷釜汲水，担薪炊膳，除己私意，勿起嗔心。 各处一室，澄心办道，各分局次，当占一科。 或以互换调炼真性，不得执着为用，亦不得递相是非。 谨要降心，削除人我，泯於声色，离形去智，湛然无欲。 见三教门人，须当平待，不得怠慢心。 无事不得出庵舍，晚夕早扃其户，寅旦晚启其门。 有送供者平常接待，无施利者勿生二心。 凡有游历之士，旦过三日，是高明者举进住坐，无志气者他处游行。 次验脚色公据，详察缘由。 若不分明，其间恐有隐匿，诈伪之人不稳便。 更防一等道人，愚徒之辈，奸诈之人，一言相惑，点污徒众，破除庵舍，常谈诽谤，便合遣出。 若有投庵出家者，不得擅便引进，先观道气，次看悟道，或祖上家风善恶，及自己德行浅深。 高明者携之，愚蠢者抑之。 或於庵中干办等事，先问庵主，次与合堂道众评论。 出家无问早晚，不择老幼，但泄理明心者，堪为上人也。 凡有化道，不得诈托师家名目，亦不得私心指托庵舍。 取要檀越等物，自己用度，便是私瞒常住。 上天鉴察，必无轻谴，故兹榜示，各宜知悉。 今月　　日示 朗然子家书 夫人身难得，中土难生，正法难遇，全此三者，幸莫大焉。 况今诸仙出世，立登天之梯凳，渡苦海之舟船，默露玄机，不可不应。 猛悟光阴迅速，顿知世境浮嚣。 念念慕古圣之玄风，头头效达人之返朴。 随掷火坑，便步清凉之地； 解脱尘劳，永居自在之乡。 莫待老之将至，宁知身后如何。 既悟 须当斩钉截铁，休教洒水拖泥。 改非从是，一刀两段。 若不断於贪嗔，怎得心田清静。 须当绝乎爱欲，乃得法器圆成。 不了真心，终归幻梦，掣开爱网，跳出凡笼。 便超紫府仙乡，永脱红尘异趣。 一条藜杖，泛云水之三千； 半片衲衣，访洞天之十二。 清静门中，无为路上，法味滋身，洞然真乐。 宴坐茅堂，饮清风而推开玄妙之门； 闲居土屋，赏明月而把握阴阳之髓。 虽则妻妾儿孙，如同栖之宿乌； 金银珠玉，似过眼之浮云。",
      "translated_text": "Here follows the translation:\n\n---\n\nIndeed, the Mysterious Origin and Sacred Ancestor flung wide the gates of all wonders; the Great Dao of Perfect Realization spread the teachings that transform and nurture all beings. The jade-maidens of Yao Pond—seven golden lotuses of Chongyang; the jasper groves of Lang Garden—ten thousand jade blossoms of Changchun. Though branches diverge and twigs differ, all leaves return to the root in the end. Though schools drift apart and streams stray, all rivers flow back to the sea at last.\n\nIn every quarter, teachings are established, gathering cloud-friends from the four seas; in every place, affinities are cultivated, assembling rosy companions from the three mountains. Thatched huts and grassy cottages become halls of precious jade and palaces of lapis; paper robes and hempen garments are graced with starry crowns and lunar pendants. Truly, “humans can magnify the Dao,” unfolding the model of the ancient sages. Naturally, the Dao’s methods respond to people, opening the eyes of later generations.\n\nIn the Hall of Perfect Realization, not a single thought entangles the heart; at the gate of the myriad practices, all may now apply their strength. Those above should abide in broad kindness; those below should ever hold reverence and compliance. Contentious dust-minds do not reveal the family style of the Mysterious; Dao-eyes follow one another, preserving the living practice of Danyang.\n\nOnce immortals beyond the world, now kin within the gate; dwelling in the world, they cultivate the fruit of the Dao together, transcending the ordinary to join the ranks of immortals. The immortal who has left the household—with clear eyes, they delve deeply; the resolute one who has departed the dust—with a sincere heart, they examine closely.\n\nWishing to expound further on the secret mysteries, yet mindful of the long standing of the immortal assembly, I bow to the cloud-friends and pray they take care.\n\n**Proclamation of Rules by the Perfected One of Eternal Spring**\n\nThose who dwell in hermitages should embody purity, emptiness, coolness, and tranquility—unfettered, solitary, and serene. Seeing the nature is the essence; nurturing life is the function. Gentleness and weakness are the norm; humility and harmony are virtue. Compassion is the foundation; skillful means are the gate.\n\nAmong the assembly, always remain lowly; in stillness, never stir dusty emotions. For all worldly toils, apply effort within your capacity—do not exceed. For every garment and every meal, use no more than necessary. Calculate the hermitage’s provisions—do not hoard surplus. For personal clothing and belongings, do not covet. If the common property has surplus, relieve the poverty of passing travelers in distress. Use it for alms-gathering elsewhere or to prepare vegetarian feasts.\n\nIn the twelve hours, do not cling to the illusory; always seek to illuminate the real. Sweep away dust and grime, scour pots and draw water, carry firewood and cook meals. Remove selfish thoughts; do not arouse anger. Each should occupy a chamber, settle the mind, and cultivate the Dao. Each has their assigned duty—take up one task. Exchange and temper the true nature, but do not cling to it as a tool, nor pass judgment on one another.\n\nStrictly subdue the heart, pare away self and others, extinguish sound and form, leave behind form and intellect, and abide in profound desirelessness. When encountering followers of the Three Teachings, treat them with equanimity—do not harbor negligence or disdain.\n\nDo not leave the hermitage without cause. At dusk, bolt the door early; at dawn, open it late. Receive those who bring offerings with ordinary courtesy; if none come, do not waver in mind. For wandering practitioners who pass by, if after three days they are of lofty wisdom, invite them to stay; if they lack aspiration, let them journey elsewhere. Next, verify their credentials and documents, and examine their circumstances closely. If unclear, beware of hidden deceit—untrustworthy individuals may bring instability.\n\nBe especially wary of a certain kind of Daoist—foolish disciples and cunning impostors. With a single misleading word, they may stain the assembly, damage the hermitage, and spread slander. Such ones should be expelled immediately.\n\nIf someone seeks to leave the household and join the hermitage, do not hastily admit them. First observe their Dao-qi, then their awakening to the Dao. Consider their ancestral family’s virtue or vice, and the depth of their own conduct. Guide the wise; restrain the dull. For any tasks within the hermitage, first consult the hermitage master, then discuss with the entire assembly.\n\nIn leaving the household, regardless of time or age, if one clarifies principle and illuminates the mind, they are worthy of being called an exalted person. In seeking alms for the Dao, do not falsely invoke the name of a master, nor privately claim affiliation with a hermitage. Taking offerings from patrons for personal use is to secretly deceive the common property. Heaven observes and judges—there will be no light punishment. Thus, this proclamation is posted for all to know.\n\n**Proclaimed on the ___ day of this month**\n**Letter from Langranzi**\n\nThe human body is hard to obtain; birth in the Middle Land is hard to attain; encountering the true Dharma is hard to meet. To possess all three is a fortune beyond measure. Moreover, now that the various immortals have appeared in the world, establishing ladders to ascend the heavens and boats to cross the sea of suffering, silently revealing the mysterious mechanism—how can one not respond?\n\nAwaken fiercely to the swiftness of time; suddenly realize the fleeting clamor of the world. In thought after thought, yearn for the mysterious wind of the ancient sages; in step after step, emulate the return to simplicity of the enlightened ones. Cast aside the fiery pit to tread the cool and refreshing ground; liberate from worldly toil to dwell forever in the realm of freedom.\n\nDo not wait until old age approaches—who knows what comes after this life? Once awakened, one must cut decisively like severing iron or steel—do not drag like water and mud. Correct wrongs and follow what is right—one stroke, two segments. If greed and anger are not severed, how can the field of the heart be clear and still? Only by cutting off love and desire can the vessel of the Dharma be perfected.\n\nWithout realizing the true heart, one remains in illusion and dream. Break free from the net of attachment; leap out of the cage of the ordinary. Then ascend to the immortal realm of the Purple Palace, forever escaping the strange allure of the red dust.\n\nA single staff of goosefoot, drifting across the three thousand worlds of clouds and waters; half a patchwork robe, visiting the twelve grotto-heavens. In the gate of purity and stillness, on the path of non-action, the flavor of the Dharma nourishes the body, and true joy is fully revealed.\n\nReclining in a thatched hall, drinking the pure wind to push open the gate of mystery; dwelling idly in a clay hut, savoring the bright moon to grasp the marrow of yin and yang. Though wives, concubines, children, and grandchildren may be like roosting birds; gold, silver, pearls, and jade are like passing clouds before the eyes.",
      "overlap_context": "d transgression.\n\nAfter these prohibitions, men and women must not intermingle, nor may one indulge the heart’s desires. Beware lest the offerings of patrons from all directions become difficult to repay, lest one fail to cherish even an inch of time, lest one waste it in vain.\n\nDiligently cultivate with care, that the heart of the Dao may become steadfast. Without discipline, one risks losing the path ahead—ponder this deeply.\n\n**Notice.**\n**Proclamation of Liaozhenzi upon Ascending the Hall.**",
      "start_char": 4599,
      "end_char": 5823,
      "start_sentence": 265,
      "end_sentence": 339,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.96980881690979,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\全真清规.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "是以喜舍家缘，便归洞府，断弦不续，泼水难收。 父母妻男，各从方便。 自今如陌路之人，永作他乡之客。 彼出家者，并无怠惰之心； 今在家者，一任分飞之意。 故所愿也。 谨奉鄙书，伏惟珍重。 全真清规竟",
      "translated_text": "Thus, rejoicing in relinquishing worldly ties, one returns to the grotto-realm; once the lute-string is snapped, the spilled water cannot be gathered again. Parents, wife, and sons—each follows what is convenient. From this day forth, they become as strangers on the road, forever guests in a foreign land. Those who leave the household life harbor no slothful heart; those who remain in it may follow their scattered destinies as they will. Such is the aspiration.\n\nWith reverence, I offer this humble missive, praying you cherish well-being. Here ends the *Pure Regulations of the Complete Realization*.",
      "overlap_context": "the twelve grotto-heavens. In the gate of purity and stillness, on the path of non-action, the flavor of the Dharma nourishes the body, and true joy is fully revealed.\n\nReclining in a thatched hall, drinking the pure wind to push open the gate of mystery; dwelling idly in a clay hut, savoring the bright moon to grasp the marrow of yin and yang. Though wives, concubines, children, and grandchildren may be like roosting birds; gold, silver, pearls, and jade are like passing clouds before the eyes.",
      "start_char": 5823,
      "end_char": 5918,
      "start_sentence": 340,
      "end_sentence": 347,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.632978677749634,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\全真清规.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}