{
  "source_id": "养性延命录",
  "source_file": "chunked_daozang\\养性延命录.json",
  "total_chunks": 14,
  "total_original_chars": 14149,
  "total_translated_chars": 74903,
  "total_translation_time": 404.51344561576843,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\养性延命录.txt",
    "category": "方法类"
  },
  "full_translation": "*The Record of Nurturing Life and Extending Lifespan*\nBy Tao Hongjing of the Liang Dynasty\nTwo fascicles\n\n**Source of the Base Text:** *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, Methods Category\n**Collated Editions:**\n1. *The Seven Bamboo Tablets of the Cloudy Satchel*, included in Fascicle 33\n2. *Essential Writings from the Daoist Canon*, included in the second collection\n\n**Preface to *The Record of Nurturing Life and Extending Lifespan***\n\nAll beings endowed with *qi* and spirit are noble, yet none surpass humanity in worth. What humanity holds most dear is life itself. Life is the root of spirit, while form is its vessel. When spirit is overtaxed, it is exhausted; when form is overburdened, it perishes. If one can still the mind in emptiness and tranquility, quieting thoughts through non-action, absorb primordial *qi* after midnight, and practice *daoyin* in a secluded chamber, nurturing life without neglect while supplementing with fine medicines, then a lifespan of a hundred years is but the natural allotment. Yet those who indulge in sensual pleasures, exhaust their wit in pursuit of wealth and rank, cling to gains and losses in their hearts, or remain restless and unable to free themselves—who disregard propriety and moderation in diet—how can such as these escape the calamity of premature death?\n\nIn moments of respite from meditation, I have perused *The Essential Collection of Nurturing Life*. This compilation was assembled by scholars such as Qian Yan and Zhang Zhan of the Daoist groves, alongside Qi Ping and Huang Shan—all keen and extraordinary minds devoted to preserving and cultivating life. Some gathered the precepts of immortals and perfected beings on longevity, while others adopted the arts of Peng Keng and the Old Lord for extending years. From the time of Fuxi and the Yellow Emperor down to the Wei and Jin dynasties, whatever benefited nurturing life or risked harm to later years was recorded in the original texts. Here, I have distilled the essential methods, pruned the excess, and organized them into thematic sections, dividing the work into two fascicles with three chapters each. Entitled *The Record of Nurturing Life and Extending Lifespan*, this work aims to aid those with affinity for such teachings, hoping thereby to benefit all beings.\n\nSome claim this book was compiled by Sun Simiao.\n\n**Fascicle One of *The Record of Nurturing Life and Extending Lifespan***\nCompiled by Tao the Recluse of Huayang\n\n**Chapter One: Teachings and Admonitions**\n\nThe *Divine Farmer’s Classic* states: Those who eat grains gain wisdom and clarity. Those who consume minerals grow plump and lustrous, never aging—this refers to refining the Five Minerals. Those who eat *zhi* mushrooms extend their years without dying. Those who ingest primordial *qi* cannot be buried by earth or slain by heaven. Thus, those who consume medicinal substances differ from heaven, standing alongside the sun and moon.\n\nThe *Daoist Scripture of Primordial Unity* states: The valley spirit does not die. Master Heshang says: *Gu* means nurturing; to nurture the spirit is to avoid death. The spirit governs the five viscera. The liver stores the *hun*, the lungs store the *po*, the heart stores the spirit, the kidneys store essence, and the spleen stores will. When the five viscera are all damaged, the five spirits depart. This is called the Mysterious Female. It speaks of the undying Dao, which lies in the Mysterious Female. *Xuan* is heaven, and in humans, it is the nose. *Pin* is earth, and in humans, it is the mouth. Heaven feeds humans with the five *qi*, which enter through the nose and are stored in the heart. The five *qi* are pure and subtle, becoming spirit, intelligence, voice, and the five natures. Their ghost is called the *hun*. The *hun* is yang; it enters and exits through the human nose, communicating with heaven—thus the nose is *xuan*. Earth feeds humans with the five flavors, which enter through the mouth and are stored in the stomach. The five flavors are turbid and stagnant, forming the body’s frame, bones, flesh, blood vessels, and the six emotions. Their ghost is called the *po*. The *po* is yin; it enters and exits through the mouth, communicating with earth—thus the mouth is *pin*. The gate of the Mysterious Female is called the root of heaven and earth. *Root* means origin. It speaks of the gates of the nose and mouth, which are the source of the primordial *qi* of heaven and earth, through which it comes and goes. It is continuous as if existing, yet the breath of the nose and mouth should be soft and subtle, as if present yet also as if absent. In using it, one must not be hasty. When employing *qi*, one should be relaxed and unhurried, not urgent, hurried, or laborious.\n\nThe *Hunyuan Daode Jing* states: \"Birth\" means that emotions and desires emerge from the five viscera, the *hun* is settled and the *po* is tranquil—thus life arises. \"Entering death\" means that emotions and desires penetrate the chest and diaphragm, essence scatters and spirit is deluded—thus death ensues. Those who follow life number thirteen; those who follow death number thirteen. This speaks of the categories of life and death, each numbering thirteen, which are called the nine chambers and four gates.\n\nIn life, the eyes do not recklessly gaze, the ears do not recklessly listen, the nose does not recklessly inhale, the mouth does not recklessly speak, the hands do not recklessly grasp, the feet do not recklessly walk, and essence is not recklessly expended. In death, the opposite holds true.\n\nAs humans live, all their movements lead to the thirteen paths of death. Those who seek life yet act contrary to this reach the thirteen paths of death. Why is this so? Because their pursuit of life is too excessive. The reason their movements lead to death is that their striving for life is overly intense. Departing from the Dao and rebelling against heaven, reckless actions lose their proper order.\n\nIt is said that those who skillfully nurture life do not encounter rhinoceroses or tigers when traveling on land, nor are they harmed by weapons when entering battle. The rhinoceros has nowhere to thrust its horn, the tiger has nowhere to place its claws, and weapons have nowhere to lodge their blades. Why is this so? Because they avoid the paths of death—because they do not transgress the thirteen paths of death.\n\nThe *Zhuangzi*’s \"Nourishing Life\" chapter states: \"Our life has limits,\" to which Xiang Xiu comments: \"The scope of life, each with its own bounds.\" \"Yet knowledge has no limits.\" Ji Kang says: \"To desire without reflection is the movement of nature. To recognize and then respond is the function of knowledge. When nature moves, encountering things appropriately suffices, leaving no surplus of knowledge; following sensations without seeking, one becomes weary yet does not cease.\" Thus, the world’s afflictions lie in the exhaustion of knowledge, not in the movement of nature.\n\n\"To pursue the limitless with the limited is perilous,\" as Guo Xiang notes: \"Using a finite nature to chase boundless knowledge, how can one not be exhausted?\" \"Having already exhausted oneself through knowledge, to then employ knowledge to attack it is yet more perilous,\" as Xiang Xiu says: \"Already exhausted by knowledge, to further employ knowledge is yet more perilous.\"\n\nThe *Zhuangzi* states: \"Those who comprehend the essence of life do not strive for what life cannot provide,\" to which Xiang Xiu comments: \"What life cannot provide are the affairs of nature.\" Zhang Zhan adds: \"When the principle of life is naturally preserved, to pursue what lies beyond one’s allotted share is to chase the limitless with the limited.\"\n\n\"Those who comprehend the essence of fate do not strive for what knowledge cannot control,\" as Xiang Xiu says: \"This refers to death when one’s fate is exhausted.\" Zhang Zhan notes: \"Following the principle of life’s natural course and exhausting one’s allotted span, how can knowledge know what lies beyond?\"\n\nThe *Liezi* states: \"In youth, do not neglect diligent practice; in adulthood, do not fail to seize the moment; in maturity, be content with poverty; in old age, reduce desires. Calm the mind and labor the body—this is the method of nurturing life.\"\n\nThe *Liezi* further states: \"The fullness and emptiness of the body’s unity ebb and flow in harmony with heaven and earth, responding to the myriad things.\" Zhang Zhan comments: \"Humans share *qi* with yin and yang.\" \"Harmonize it at the beginning, harmonize it at the end; still the spirit and extinguish thoughts—this is the Dao of life. When beginning and end are harmonized, the spirit and will do not scatter.\"\n\nThe *Hunyuan Miaozhen Jing* states: \"Humans often lose the Dao, not the Dao losing humans. Humans often depart from life, not life departing from humans. Thus, those who mingle with life must be cautious not to lose the Dao. Those who practice the Dao must be cautious not to lose life, ensuring that the Dao and life guard each other, and life and the Dao preserve one another.\"\n\nThe *Huanglao Jing Xuanshi* states: \"The Dao of heaven enacts transformation, enduring with the myriad things without end. The Dao of humans enacts transformation, yet form and spirit perish. To circulate spirit and expend essence—when essence is exhausted, decay follows. Form fundamentally generates essence, and essence arises from spirit. Not expending life’s resources, one can thus unite virtue with heaven. Not transforming with spirit, one can thus align with the Dao’s pattern.\"\n\nThe *Xuanshi* further states: \"Those who transform through form belong to the category of corpse liberation. Spirit and form separate, and the two do not remain together, like birds flying into the sea and becoming clams, following the yin and yang *qi* of late autumn. Those who transform through *qi* may yet hope for life; those who transform through form are deeply to be feared.\"\n\nYan Junping’s *Laozi Zhigui* states: \"Let the mind wander in emptiness and stillness, focus the will on the subtle and wondrous, entrust thoughts to desirelessness, and return plans to non-action—thus one can comprehend life, extend lifespan, and endure with the Dao.\"\n\nThe *Dayou Jing* states: Some doubt, saying: \"All begin equally from the boundless, receive *qi* from yin and yang, bear form and *po* in heaven and earth, and rely on sustenance and breath for growth—yet there are the foolish and the wise, the strong and the weak, the long-lived and the short-lived. Is this heaven’s doing or man’s?\" The explanation is: \"Whether one’s form is foolish or wise is determined by heaven. Strength, weakness, long life, or early death are determined by humans. The Dao of heaven is natural; the Dao of humans is self-made.\"\n\n\"Those whose fetal *qi* is full at the beginning, whose milk and food are abundant in infancy, whose nourishment is sufficient in youth, and whose sounds and colors are moderate in adulthood will be strong and long-lived. Those whose fetal *qi* is depleted at the beginning, whose milk and food are insufficient in infancy, whose nourishment is excessive in youth, and whose sounds and colors are unrestrained in adulthood will be weak and short-lived. If one’s growth is complete and nurtured with proper guidance, one’s years cannot be measured.\"\n\nThe *Daoji* states: \"That human lifespans vary in length is not natural; it is all due to carelessness in self-preservation, immoderate eating and drinking, excessive indulgence, acting contrary to yin and yang, the *hun* and spirit not being guarded, essence being exhausted and life declining, and the hundred diseases sprouting—thus one does not complete one’s natural lifespan.\"\n\nThe *Hetu Dishi Meng* states: \"Those who defy the seasons meet misfortune; those who follow the seasons meet good fortune. In spring and summer, delight in high mountains; in autumn and winter, dwell in low, secluded places. This brings good fortune, abundant blessings, and boundless longevity.\"\n\nThe *Weishu Baoyu Ming* states: \"The methods of the ancients for treating illness involved harmonizing with sweet springs, moistening with primordial *qi*, using medicines neither pungent nor bitter but sweet and flavorful, and taking them regularly. This caused fluids to flow through the five viscera, connect to the heart and lungs, and ensure lifelong freedom from illness.\"\n\nThe *Kongzi Jiayu* states: \"Those who eat meat are brave and fierce, like tigers and wolves. Those who consume *qi* are spiritually luminous and long-lived, like immortals and sacred turtles. Those who eat grains are wise but short-lived—such is man. Those who eat nothing do not die and become spirits, relying solely on breath without thought or care.\"\n\nThe *Commentary* says: \"Those of mixed diet attract the hundred diseases and malevolent spirits. The less one eats, the more the mind opens and the years increase; the more one eats, the more the mind is obstructed and the years diminish.\"\n\nThe Grand Historian Sima Tan said: \"The spirit is the root of life; the body is its vessel. Excessive use of the spirit exhausts it; excessive labor of the body destroys it. When spirit and body prematurely decline, to desire longevity like heaven and earth is unheard of. Thus, what enables man to live is the spirit; what the spirit relies upon is the body. When spirit and body part, death ensues—once dead, one cannot revive; once parted, they cannot reunite. Therefore, the sage values this deeply.\n\nThe Dao of nurturing life has a unifying principle, though few fully grasp its essence. Yet if one merely considers how to oppose common customs, one treads the path of victory, gaining more than half the benefit. Those with intent—can they not reflect on this?\"\n\nThe *Xiaoyou Jing* states: \"Few thoughts, few intentions, few desires, few affairs, few words, few laughs, few sorrows, few joys, few likes, few dislikes, few attachments, few aversions—practicing these twelve *fews* is the comprehensive key to nurturing life. Excessive thought endangers the spirit; excessive intention scatters the will; excessive desire harms resolve; excessive affairs fatigue the body; excessive speech depletes *qi*; excessive laughter injures the viscera; excessive sorrow cowers the heart; excessive joy overflows the mind; excessive delight leads to forgetfulness, errors, and chaos; excessive anger unsettles the hundred vessels; excessive attachment leads to obsession and disorder; excessive aversion brings emaciation and joylessness. Failing to eliminate these twelve *excesses* is the root of life’s ruin. Those who avoid excess approach the great plan of the perfected.\n\nThe extravagant and indolent live long; the strange and diligent die young—such is the difference between dissipation and stinginess. Farmers live long; the pampered die young—such is the proof of few or many desires. Recluses fall ill rarely; wanderers suffer often—such is the divergence of simplicity and complexity. Thus, worldly men compete for profit, while Daoists seldom scheme.\"\n\nHu Zhao said: \"The eyes should not gaze upon improper colors; the ears should not listen to foul words; the nose should not face rank odors; the mouth should not taste poisonous or pungent flavors; the heart should not plot deceitful schemes—these bring disgrace to the spirit and shorten life. Moreover, sighing habitually or wailing day and night invites misfortune and invites evil. Ordinary people cannot be without desires or affairs, but one should harmonize the mind, reduce thoughts, calm the body, and lessen worries. First, eliminate what disturbs the spirit and violates nature—this is one method of conserving the spirit.\"\n\nThe *Huangting Jing* states: \"Wash the spiritual root with the clear waters of the Jade Pool; those who cultivate this may endure forever. This is called *natural* eating and drinking. *Natural* refers to the Flowery Pool—the saliva in the mouth. When breath is regulated and swallowed, hunger ceases.\"\n\nThe *Laojun Yinshi Neijie* says: \"Saliva transforms into sweet springs, gathers as jade nectar, flows as the Flowery Pool, scatters as floating essence, and descends as sweet dew. Thus, the mouth is the Flowery Pool, containing sweet springs. Rinsing and swallowing it moistens the viscera, nourishes the body, benefits the hundred vessels, and sustains the myriad spirits, joints, and hair—life arises from this.\"\n\nThe *Zhong Jing* states: \"The tranquil live long; the restless die young. Tranquility that cannot nurture may still grant longevity; restlessness that is cultivated can extend years. Yet tranquility is easy to govern, while restlessness is hard to manage. Those who fully follow the proper methods of nurture may cultivate both tranquility and restlessness.\"\n\nHan Rong Yuanchang said: \"Wine is the essence of the five grains, the pinnacle of flavor—yet it can also harm. Fine things are hard to manage and easy to overindulge in; one must be cautious in nurturing life.\"\n\nShao Zhongzhan said: \"The five grains fill the body but cannot extend life; the hundred medicines cure illness and prolong years but are not palatable. What is palatable and fills the body is prized by worldly men; what is bitter and extends life is treasured by Daoists.\"\n\nThe *Suwen* states: The Yellow Emperor asked Qi Bo: \"I have heard that the people of high antiquity lived to a hundred years without decline in movement—was their blood and *qi* still abundant? Yet today, people begin to decline at fifty—is this due to the times, or have men lost the way?\"\n\nQi Bo replied: \"The people of high antiquity who understood the Dao modeled themselves on yin and yang, harmonized with arts and calculations, and followed the methods of chamber arts. Their eating and drinking were moderated, their rising and resting were regulated, and they did not act recklessly. Thus, they could accompany the spirit, fulfill their natural lifespan, and live beyond a hundred years. Today’s people are not so: they take wine as broth, treat recklessness as normal, enter the chamber while drunk, exhaust their essence with desire, dissipate their true *qi* with indulgence, fail to maintain fullness, do not timely manage the spirit, seek to please the heart, and wander in yin and yang. Their daily life and conduct lack moderation—thus they decline at fifty.\"\n\nLaozi said: \"Man’s great term is a hundred years as the limit; those who regulate and protect it may reach a thousand. It is like using oil—whether on a small or large lamp. While the crowd speaks grandly, I speak softly; while the crowd is troubled, I remember little; while the crowd is violent, I do not anger. I do not burden my mind with worldly affairs or pursue official rank. Serene and effortless, my spirit and *qi* fill naturally—this is the medicine of immortality, unknown to the world. Do not say the unseen is obscure; heaven knows the hearts of men.\"\n\n\"Do not dismiss the unseen as obscure—spirits perceive human form. Whispered words in the heart, ghosts hear human voice. Violate a thousand prohibitions, and the earth claims one’s body.\n\nMan performs yang goodness, and good people repay it. Man performs yin goodness, and ghosts and spirits repay it. Man commits yang evil, and bandits or men punish him. Man commits yin evil, and ghosts and spirits punish him. Thus, heaven does not deceive man—it responds like a shadow; earth does not deceive man—it echoes like a sound.\n\nLaozi said: Those who cultivate goodness and accumulate virtue yet encounter misfortune suffer the lingering calamities of their ancestors; those who violate prohibitions and commit evil yet encounter fortune inherit the residual blessings of their ancestors.\n\n*The Treatise on Illnesses by Renowned Physicians* states: People do not live out their natural lifespan but often die prematurely, all because they fail to cherish themselves—indulging in anger, contention, and unbridled desires, pursuing fame and profit, amassing toxins to assault the spirit, internally injuring the marrow, externally wasting the sinews and flesh. When blood and *qi* are nearly depleted, the meridians become obstructed, the flesh and texture grow porous, and only demonic illnesses are invited. True *qi* wanes daily, while pathogenic *qi* waxes. This is no different from pouring the vast ocean into a flickering flame or collapsing a towering peak to dam a trickling stream—easier said than done, yet far worse than these.\n\nPengzu said: The Dao is not in complexity. Simply refrain from thinking of clothing, food, sound, color, victory, defeat, loss, gain, honor, or disgrace. Let the heart not labor, the body not exhaust itself, and regularly practice *daoyin*, absorb *qi*, and embrace embryonic breathing—thus one may attain a thousand years. Those who seek boundless longevity must ingest the supreme medicine.\n\nZhongchang Tong said: Dissolve the six emotions and five natures; have a heart yet not think with it, a mouth yet not speak with it, a body yet not rest in it. Find peace in what is peaceful yet remain unattached; delight in what is delightful yet feel no love. Pursue this path, and one will not notice the days lengthening or things changing. Such was the way of Pengzu and Laozi—how else could they, though of the same kind as others, attain lifespans unlike others?\n\nChen Jiyuanfang said: Most illnesses and premature deaths stem from diet. The harm of diet surpasses that of sensual indulgence. Sensual pleasures may be cut off for years, but diet cannot be abandoned for a single day. Its benefits are great, yet so are its harms. Excess injures, moderation nourishes.\n\nZhang Zhan said: Those who suddenly lose wealth and status, though not struck by external evil, suffer internal spiritual injury and will surely die—not from external demonic harm, but from the inner searing of ice and fire, leading to collapse, internal damage, and vomiting blood. Those who rise to riches then fall into poverty, though not struck by external evil, will see their skin wither, sinews protrude, and limbs contract and twist. The harm of wealth and poverty to man is like that of power and status—diseases and afflictions merely wear away the body.\n\nMovement overcomes cold; stillness overcomes heat. To be capable of both movement and stillness is the way to longevity. When essence and *qi* are pure and tranquil, they merge with the Dao.\n\n*Zhuangzi* said: The true person does not dream in sleep.\n*Shenzi* said: One who has no affairs by day will not dream at night.\n\nDaoist Master Zhang, over a hundred years old, was remarkably robust. He said: The way of nurturing life lies in avoiding prolonged walking, sitting, standing, gazing, or listening; avoiding excessive eating and drinking, deep intoxication, great sorrow, or profound grief—this is what it means to achieve harmony. Those who attain harmony will surely live long.\n\n*The Scripture of Immortals* states: My life is in my hands, not in heaven’s. Yet fools do not understand this. The Dao is the essence of life; the causes of all illnesses and pathogenic winds lie in indulging desires and emotions without self-restraint, leading to depletion and harm. Like withered, rotten wood that snaps in the wind or a crumbling bank that collapses at the first touch of water, if one cannot take medicine, merely treasuring essence and moderating emotions may still grant a lifespan of one or two hundred years.\n\nZhang Zhan’s *Collected Writings on Nurturing Life* states: The great essentials of nurturing life are: first, conserve the spirit; second, cherish *qi*; third, nurture the body; fourth, practice *daoyin*; fifth, regulate speech; sixth, moderate diet; seventh, harmonize the bedchamber; eighth, counter convention; ninth, use medicine; tenth, observe prohibitions. Beyond these, further principles may be briefly noted.\n\nThe Daoist of the Green Ox said: Do not seek to please others, for those who please others do not live long. Simply avoid straining beyond one’s strength. Lifting heavy weights, drawing strong bows, digging earth, or laboring to exhaustion without rest leads to the fatigue and depletion of sinews and bones. Yet labor and toil are preferable to idleness and pleasure. From dawn to dusk, one should always be engaged in some activity, pausing only when utterly spent, then resuming after rest. This is no different from *daoyin*. Flowing water does not stagnate, and a door hinge does not rot because they are constantly in motion.\n\nAfter eating, do not sit or stand idly—walk and move to disperse the food. Otherwise, one will suffer from undigested accumulations, numbness in the limbs, facial pallor, and a shortened lifespan.\n\nHuangfu Long asked the Daoist of the Green Ox—whose surname was Feng and given name Junda—about his method of nurturing life. The general principles were: Keep the body regularly active, eat sparingly, avoid overexertion, prevent excessive depletion, reduce rich and heavy foods, limit salt and sour flavors, curb thoughts, temper joy and anger, abandon reckless pursuits, and be cautious in the bedchamber. Emperor Wu practiced this and found it effective.\n\nPengzu said: Though one may not know the methods, simply nurturing life with reason can grant a lifespan of a hundred and twenty years. Those who fall short do so through self-injury. With a slight understanding of the Dao, one may live two hundred and forty years; with the addition of medicinal aids, four hundred and eighty years.\"\n\nJi Kang also said: When guiding and nurturing life with reason, one may live a thousand years at best, or a hundred years at least.\n\nPengzu said: The method of nurturing longevity is simply to avoid harm. Winter warmth and summer coolness, maintaining harmony with the four seasons—this is how one adapts the body.\n\nPengzu said: Heavy clothing and thick bedding, leaving the body idle and untested, invite wind and cold illnesses. Rich flavors, cured meats, drunkenness, and overindulgence lead to accumulations and obstructions. Alluring beauty and a house full of concubines bring depletion and ruin. Seductive sounds and mournful music, though pleasing to the heart and ear, lead to dissipation and delusion. Galloping excursions and hunting on the plains result in reckless madness. Scheming for victory, seizing the weak, and exploiting disorder breed arrogance and idleness—these are the failings even of sages and worthies. Yet the tools of nurturing life, like fire and water, must not be misused, lest they become harmful.\n\nPengzu said: Those who do not understand the Dao may take medicines recklessly, damaging their blood and qi, leaving their flesh porous and marrow hollow. Already weakened within, they are then assailed by external influences—wind, cold, wine, and lust—bringing forth illness. If one’s foundation were full and firm, how could disease arise?\n\nAn immortal said: No sin is greater than lust, no calamity greater than greed, no fault greater than slander. These three are the chariots of misfortune: in small measure, they endanger the person; in great measure, they endanger the family. Those who wish to prolong life and minimize illness must never squander essence to the point of premature decay, never indulge in excessive warmth to the point of consuming the marrow, never endure extreme cold to the point of harming the flesh, never cough or spit to the point of losing vital fluids, never gasp suddenly to the point of startling the soul, never weep long to the point of grieving the spirit, never rage to the point of distressing the mind, never brood to the point of mental confusion. Those who can follow this Dao may attain long life.\n\n**Dietary Admonitions, Chapter Two**\n\nA Perfected One said: Though one may take medicines regularly, without knowing the art of nurturing life, it is still difficult to attain longevity. The Way of nurturing life abhors eating to fullness and then immediately exerting oneself, as well as sitting for long periods—both shorten life. One should engage in light labor, but never to the point of exhaustion or beyond one’s capacity. After eating, one should stroll leisurely, finding joy in some activity. Thus, flowing water does not stagnate, nor do door hinges rot, for they are in constant motion. Therefore, one should not eat at night. After a meal, one should walk in the courtyard as if covering several *li*—this is excellent. Eating to fullness and then lying down breeds a hundred illnesses, as undigested food accumulates. Eat little but often, avoiding large, hard-to-digest meals. Maintain a state of being neither too full nor too hungry—always as if slightly sated in hunger, slightly hungry in satiety.\n\nThus, those who nurture life eat only when truly hungry and drink only when truly thirsty. If one waits until ravenous to eat, the meal will be excessive; if one waits until parched to drink, the intake will be too great. After eating, one should walk, and after walking, have someone massage the abdomen with powder for several hundred strokes—this is greatly beneficial.\n\nThe Daoist of the Green Ox said: Do not eat to excess; thus, the Daoist eats only when hungry. Do not drink to excess; thus, the Daoist drinks only when thirsty. After eating, walk several hundred steps—this is most beneficial. After the evening meal, walk about five *li* before lying down, and illness will be dispelled.\n\nIn eating, first consume hot foods, then warm, then cold. After eating hot or warm foods, if no cold food is available, swallow one or two mouthfuls of cold water—this is most effective. If one can remember this constantly, it is a key method of nurturing life.\n\nBefore eating, lightly inhale and swallow the qi once or twice—this prevents illness.\n\nA Perfected One said: Hot food harms the bones, cold food harms the organs. Hot things scald the lips, cold things pain the teeth. After eating, pacing about promotes longevity. Do not speak loudly after a full meal. Drinking heavily blocks the blood vessels; drunkenness scatters the spirit.\n\nIn spring, eat pungent foods; in summer, sour; in autumn, bitter; in winter, salty. These all assist the five viscera, enrich the blood and qi, and ward off illness. Yet even sour, salty, sweet, and bitter foods must not be consumed to excess.\n\nDo not eat liver in spring, heart in summer, lungs in autumn, kidneys in winter, or spleen in any of the four seasons. If one can avoid these five viscera, it is especially harmonious with Heaven’s principle.\n\nSwallows must not be eaten, for they may be swallowed by dragons and serpents in water; nor should they be killed.\n\nEating to fullness and then exposing oneself to the elements causes back pain. Do not drink too much alcohol, for excess leads to vomiting, which is harmful.\n\nAfter drinking, do not stand in the wind or use a fan—both harm the person.\n\nDo not eat honey with plums, as it harms the five viscera.\n\nDo not force oneself to eat while drunk, as it may cause paralysis, abscesses, or sores.\n\nSexual intercourse while drunk and full may cause facial blemishes and coughing; in severe cases, it may rupture the visceral channels and shorten life.\n\nIn eating, it is best to keep food consistently warm, as it is easily digested—better than habitual cold food.\n\nIn all eating, cooked is better than raw, and less is better than more.\n\nEating to fullness and then riding a horse may cause mental derangement.\n\nDo not gulp water hastily, as it may cause qi disorders or water accumulation.\n\nDo not eat cheese after consuming yogurt, as it may turn to blood phlegm or bloody urine.\n\nAfter eating hot food, do not wash the face if sweating, as it causes loss of complexion and a sensation like insects crawling on the skin.\n\nAfter eating hot food, do not rinse the mouth with vinegar or fermented grain water, as it causes bad breath and bleeding gums.\n\nHorse sweat, breath, or hair entering food can also harm a person.\n\nDo not eat parrot, rabbit, or dog meat together.\n\nCured meat soaked by water dripping from a rotting thatched roof is called \"depressed cured meat\"—eating it harms the person.\n\nAfter prolonged hunger, do not eat to fullness, as it may cause accumulation disorders.\n\nEating to fullness and then exposing oneself at night without covering may cause sudden death from cholera.\n\nAfter recovering from an illness, do not eat raw fish, as it may cause unending dysentery.\n\nDo not eat dairy products after raw fish, as it may breed worms.\n\nDo not eat dried ginger after rabbit meat, as it may cause cholera.\n\nWhen eating meat, do not select the fattiest portion from the top, for if many have already gazed upon it, the eater may develop *qi* stagnation or *zheng* and *li* disorders—this applies to all foods.\n\nDo not eat raw fruit on an empty stomach, as it causes heat above the diaphragm, consumptive fever, and paralysis.\n\nCovering food with copper vessels causes condensation to drip into the food, and eating it leads to sores and deep abscesses.\n\nEating hot food while still chilled from cold exposure may cause piercing wind.\n\nDo not wash your face with cold water while still heated from drinking alcohol, as it causes facial sores.\n\nDo not wash your hair after eating to fullness, as it leads to head wind.\n\nEating barley with pork for more than three meals generates heat wind.\n\nDo not store dried cured meat among glutinous rice, as eating it obstructs the *qi*.\n\nIf dried cured meat does not move when burned over fire but only stirs after being removed, and upon tearing it reveals intertwined sinews, eating it harms or even kills the person.\n\nIf a sheep’s shoulder blade contains flesh resembling pearls, called \"suspended sinew,\" eating it causes epilepsy.\n\nEating any damp food that does not cast a reflection causes *zheng* disorders and abdominal distension.\n\nAfter sudden illness, drinking alcohol without restraint generates heat above the diaphragm.\n\nAfter recovering from illness, do not eat raw jujubes, mutton, or raw vegetables, as it damages the complexion permanently, often leading to death, and causes steaming heat above the diaphragm.\n\nAfter eating hot, greasy pastries, do not drink cold vinegar or fermented grain water, as it may cause loss of voice or throat obstruction.\n\nEating raw scallions with honey harms the person.\n\nBeware of dried cured meat that moves on its own when exposed to water—it kills.\n\nDo not eat jerky that refuses to dry when sun-cured.\n\nDo not eat sheep’s liver with Sichuan pepper, as it harms the heart.\n\nEating cucumber with mutton generates heat.\n\nExcessive drinking and meat consumption, called \"fat stupidity,\" leads to madness and recklessness.\n\nThose who nourish themselves with good medicine and the five grains are called \"middling scholars,\" yet they still suffer illnesses.\n\nThose who consume *qi*, preserve essence, and cultivate spirit are called \"superior scholars,\" attaining longevity equal to heaven.\n\n**Miscellaneous Admonitions on Avoiding Harm and Seeking Goodness**\n\nProlonged gazing injures the blood, prolonged exposure injures the *qi*, prolonged standing injures the bones, prolonged walking injures the sinews, and prolonged sitting injures the flesh. Excessive longing or ambition harms a person, as do sorrow, grief, excessive joy, unresolved anger, relentless desires, and constant worries. Cold and heat imbalances harm a person, as does the failure to harmonize yin and yang.\n\nAll intercourse must follow the methods of *daoyin*. If one avoids these harmful practices and masters the arts of yin and yang, this is the Way of immortality.\n\nGreat joy makes the *qi* soar, while great sorrow blocks it.\n\nExcessive ejaculation depletes a person’s strength, excessive gazing blinds the eyes, excessive sleep disturbs the heart, and overindulgence in rich food causes diarrhea.\n\nOrdinary people only know to crave the five flavors, unaware that primordial *qi* can be consumed. Sages, knowing the five flavors cause illness, do not indulge in them, and understanding primordial *qi* can be ingested, remain silent to preserve essence, allowing *qi* to respond naturally.\n\nIf saliva is not swallowed, the sea of *qi* dries; if the sea dries, bodily fluids are depleted. Thus, consuming primordial *qi* and drinking from the sweet spring is the foundation of longevity.\n\nIrregular bathing is inauspicious. Bathing together as husband and wife is inauspicious. After bathing, or when drunk or full, returning from a long journey, or exhausted, one must not engage in bedroom affairs—doing so causes illness; be vigilant.\n\nDo not sleep with your head facing north, as it disturbs the six spirits, causing sorrow and forgetfulness.\n\nDo not straddle wells—this has been a major taboo since ancient times.\n\nIf you see a low wall within ten paces, do not sit with your back to it, lest the wind blow and cause epilepsy or itching.\n\nDo not stare at the sun or moon for long, as it impairs vision.\n\nAfter sweating heavily, do not suddenly remove clothes, as carelessness often leads to partial wind and hemiplegia.\n\nAfter bathing, do not expose your head to wind, or you may contract severe wind or piercing wind.\n\nAfter exposure to cold, do not warm your face over a fire, as it causes emaciation and wind dizziness.\n\nAfter sweating, do not sit with legs dangling for long, as it leads to blood impediment, heavy feet, and lumbar pain.\n\nDo not enter water with sweaty feet, as it causes bone impediment or hidden spasms.\n\nHolding urine for too long causes cold knees and cold impediment.\n\nAfter eating hot food and sweating, do not expose yourself to wind, as it causes *zheng* disorders, headaches, dry eyes, and excessive sleepiness.\n\nBefore sleeping, do not sing or chant, as it is inauspicious.\n\nUpon waking, do not speak loudly, as it harms the *qi*.\n\nIf a bird flies into you, do not eat it; if it has an open mouth or sores under its feathers, do not eat it either.\n\nWashing your head with hot water and rinsing with cold causes head wind.\n\nDo not place a fire stove beside your head while sleeping, as it makes the head heavy, the eyes red, and the nose dry.\n\nDo not place a lamp beside your head after sleeping, as it disturbs the six spirits.\n\nIn winter, keep the feet warm and the head cool; in spring and autumn, keep both head and feet cool—this is the sage’s constant method.\n\nEating immediately after crying leads to *qi* disorders.\n\nDo not cover your head while sleeping outdoors. Women must not sit with legs splayed—this is a major taboo.\n\nDo not spit too far, as it causes lung disease, making the hands heavy, the back sore, and inducing coughing.\n\nIf someone is having a nightmare, do not shine a light on them, as it may cause death; calling them in the dark brings good fortune, but do not approach or wake them abruptly.\n\nDo not sleep with your mouth open for long, as it leads to wasting-thirst and loss of complexion.\n\nUpon waking, do not wash your face with cold water, as it causes dry eyes, blindness, and excessive tearing.\n\nWhen traveling in the heat, do not wash your face upon encountering a river, as it causes dark moles.\n\nAfter waking suddenly from sleep, do not drink water and lie down again, as it causes water impediment.\n\nAfter sweating from an illness, do not drink cold water, as it harms the heart and abdomen, preventing recovery.\n\nDo not see or smell a decaying corpse on an empty stomach, as the *qi* enters the nose and causes illness.\n\nBefore viewing a corpse, drink wine and chew garlic to ward off toxic *qi*.\n\nFor young children, do not let them point at the moon, lest sores form behind both ears that threaten to sever them—these are called \"moon-eclipse sores.\" Pound toad into powder and apply it, and they will heal; moreover, no other sores will arise.\n\nPregnant women must not be near those with fox-like odor, as it causes swelling in the mother.\n\nDo not urinate outdoors beneath the eaves, as it disturbs the six spirits and brings unease.\n\nWhen sleeping, in spring and summer keep the head toward the east, in autumn and winter toward the west—this brings benefit.\n\nWhen a man is hungry, he should urinate sitting; when full, standing—this keeps him free from illness.\n\nWhen sleeping, curl the knees and lie on the side to strengthen one’s *qi* and vitality.\n\nWhen lying down, turn frequently and speak softly with gentle laughter; speak as little as possible, and never raise the voice.\n\nIn spring, sleep early and rise early; in summer and autumn, retire late and rise early; in winter, sleep early and rise late—all bring benefit.\n\nThough one should rise early, do not do so before the crow of the rooster; though one may rise late, do not do so after sunrise.\n\nIn winter, Heaven and Earth are closed, and yang *qi* is stored. Do not labor to the point of sweating, lest yang *qi* be dispersed and harm the person.\n\nAfter washing the hair, do not tie it up in the wind, nor lie down with a wet head, as this causes head-wind, dizziness, stupor, hair loss, facial swelling, toothache, and deafness.\n\nDo not wear damp or sweaty clothes for long, as this breeds sores and wind-itching ulcers.\n\nLord Lao said: On the first day of the first month, stand in the courtyard facing the *yin* direction, bow twice, and recite: \"So-and-so year upon year receives the grace of the Great Dao. By the Mysterious Gate of the Grand Clarity, I pray to repay the debts of the past year.\" Men and women should each recite this three times. Practicing this Way regularly prolongs life.\n\nThe Mysterious Woman has a method for purifying the spirit; Huainan reveres the rites of divine favor—all seek to embody the true numinous and protect the true life. The esoteric essentials of the immortals’ scriptures teach that one should constantly visualize in the heart a *qi* as large as a goose egg, crimson within and yellow without, to ward off all evil and extend life.\n\nTo repel all evil and malevolent spirits, constantly visualize a raging fire as large as a bushel, blazing with brilliant light—then no evil will dare approach, and one may enter even plague-ridden places.\n\nBefore sleeping at night, always visualize red *qi* on the outside and white *qi* on the inside, covering the body to repel all evil spirits and demons.\n\nLord Lao said: Those who seek the Dao must not commit the five rebellions or six inauspicious acts; those who do will meet with misfortune.\nUrinating or defecating toward the west is the first rebellion; toward the north, the second; toward the sun, the third; toward the moon, the fourth; and gazing upward at the sky or stars, the fifth.\n\nRising at night without protecting the body is the first inauspicious act; rising at dawn without guarding the will, the second; cursing or reviling the honored, the third; using the foot to stir fire, the fourth; coupling with a spouse in daylight, the fifth; and stealing from or harming one’s teacher, the sixth.\n\nWhen rising in the morning, always speak of good things, and Heaven will grant you fortune. Do not sigh or sing idly, for this is called \"inviting calamity.\"\n\nBeware of singing outside the grove, for it invites misfortune; of prostrating outside the gate, for it invites lung afflictions; of discussing food and drink while lying down, for it invites illness; and of striking plates with chopsticks, for it invites misfortune.\n\nThe spirit that governs the hidden resides to the left of the mouth; if one harbors secret misfortune, this spirit reports it to Heaven, and Heaven then examines one’s soul and spirit.\n\nThe spirit that governs killing resides to the right of the mouth; if one speaks evil words, this spirit reports it to the Controller of Fate, who records it. When the sins are full, one is put to death.\n\nThese two spirits monitor the mouth—how can one not be cautious in speech when seeking nothing but fault in others?\n\nThe tongue is the soldier of the body, and good and evil arise from it—thus it is what Daoists most guard against.\n\nConsuming jade spring prolongs life and eliminates the hundred diseases. Jade spring is the saliva in the mouth. At the crow of the rooster, dawn, noon, dusk, twilight, and midnight—seven times in a day and night—rinse the mouth with jade spring and swallow it. Each time, fill the mouth and swallow, and it will extend life.\n\nHair is the culmination of blood; teeth, the culmination of bone.\n\nNails are the culmination of sinews. Combing the hair a thousand times prevents it from turning white; tapping the teeth morning and evening prevents decay; trimming the nails frequently prevents the sinews from weakening.\n\nOne should often look in the mirror, which is called \"preserving the form.\" Form and spirit preserve each other—this is its meaning. If one merely admires one’s appearance and cherishes vanity, it is better not to look at all.\n\nOn the following days— the first day of the first month, the second day of the second month, the third day of the third month, the eighth day of the fourth month, the fifth day of the fifth month, the twenty-seventh day of the sixth month, the eleventh day of the seventh month, the eighth day of the eighth month, the twenty-first day of the ninth month, the fourteenth day of the tenth month, the eleventh day of the eleventh month, and the thirtieth day of the twelfth month—one should gather wolfberry leaves, boil them into a decoction, and bathe in it. This will make the skin lustrous, prevent illness, and delay aging.\n\nDuring a lunar eclipse, one should perform rescue rites to save lives and avert misfortune. Saving ten thousand lives is equal in merit to Heaven’s work. Heaven does not delight in killing; the sages emulate this. Those who do not delight in killing assist Heaven and Earth in nurturing life, thus attracting abundant fortune.\n\nGood dreams may be spoken of; bad dreams should be kept silent—this nurtures one’s nature and prolongs life.\n\n*Record of Nurturing Nature and Prolonging Life, Volume One (conclusion)*\n\n*Record of Nurturing Nature and Prolonging Life, Volume Two*\n*Compiled by Tao Hongjing of Huayang*\n\n**Chapter Four: Qi Ingestion for Healing Illness**\n\nThe *Yuanyang Jing* states: Regularly inhale qi through the nose, hold it in the mouth, swish it until full, then use the tongue to guide it past the lips and teeth before swallowing. Achieving a thousand swallows in a day and night is most excellent. One should eat sparingly, for excessive food causes qi to rebel, blocking the hundred vessels. When the vessels are blocked, qi cannot flow, and illness arises.\n\nThe *Xuanshi* states: Will is the commander of qi; qi is the filling of the body. Those who act with virtue preserve their life; those who act with vice lose their form. Thus, the method of circulating qi requires moderation in diet, movement of the body, and harmonization of qi and blood. Proceed lightly and cease before overdoing; do not lose control. If qi surges abruptly, restore it gently. The posture resembles swallowing: hold the body upright, focus the mind, and firmly guard the inner and outer. Close the upper and lower passages, allowing spirit to permeate the limbs and bones, regulating and smoothing them. With disciplined cultivation, the *guanyuan* fills and the feet grow firm, and all pathogenic influences depart naturally.\n\nPeng Zu said: Regularly hold the breath and inhale, from dawn until noon. Then kneel and sit, wipe the eyes, massage the body, lick the lips, swallow saliva, and ingest qi dozens of times before rising to walk, speak, or laugh. If fatigue or discomfort arises, perform *daoyin* and hold the breath to attack the affliction. One must visualize the body—head, face, nine orifices, five viscera, four limbs, even the tips of the hair—directing qi to each part. When the qi feels like clouds moving through the body, rising from the nose and mouth and reaching the fingertips, the true spirit becomes clear and harmonious. No needles, medicines, moxibustion, or acupuncture are needed.\n\nTo cure all illnesses through qi circulation, focus the mind on the affected area. For headaches, direct the mind to the head; for foot pain, direct it to the feet. Harmonize the qi to attack the ailment, and it will dissipate over time. If struck by cold from seasonal qi, hold the breath to induce sweating; when sweat covers the body, the illness will resolve.\n\nThough holding and circulating qi is essential for healing, one must first understand its principles and practice on an empty stomach, not when full. If qi becomes stagnant and fails to flow freely, it may cause sores—like a spring that must not be dammed. Consuming raw fish, raw vegetables, fatty meats, or failing to dispel anger, sorrow, and worry before circulating qi may cause counterflow of qi.\n\nThose learning qi circulation should proceed gradually.\n\nLiu Jun’an said: Ingesting the living and expelling the dead ensures longevity—this means inhaling through the nose is \"living\" and exhaling through the mouth is \"dead.\" Those who cannot ingest qi should practice from morning to night without ceasing, slowly and gently inhaling through the nose and exhaling through the mouth—this is called \"expelling the old and taking in the new.\"\n\nThe *Qi Ingestion Classic* states: The Dao is qi. Preserving qi is attaining the Dao; attaining the Dao is enduring existence. Spirit is essence. Preserving essence brings spiritual clarity; spiritual clarity brings longevity. Essence is the flowing river of blood and vessels, the numinous spirit guarding the bones. When essence departs, the bones wither, and death follows. Thus, in cultivating the Dao, one must treasure essence.\n\nFrom midnight to noon is the time of living qi; from noon to midnight is the time of dead qi. During the living qi period, lie flat on your back, close your eyes, and clench your fists as an infant does—pressing the thumb with the four fingers. Hold the breath without exhaling, counting to two hundred in the mind before releasing the breath through the mouth. Increase the count daily. In this way, body and spirit unite, the five viscera are at peace, and one can hold the breath to two hundred fifty. The \"flower canopy\" (the brows) brightens, ears and eyes grow sharp, the whole body remains free of illness, and no evil can assail one.\n\nIn circulating qi, inhale through the nose and exhale through the mouth, drawing it gently—this is called \"long breathing.\" There is one way to inhale and six ways to exhale. Inhalation is simply drawing in breath. The six exhalations are *chui* (blowing), *hu* (breathing), *xi* (sighing), *he* (exhaling), *xu* (hissing), and *si* (swallowing)—all methods of expelling qi.\n\nHuman breathing naturally follows this pattern. For long-breathing exhalation techniques, use *chui* in cold times and *hu* in warm times. To treat illnesses precisely: *chui* dispels wind, *hu* dispels heat, *xi* dispels vexation, *he* descends qi, *xu* disperses stagnation, and *si* relieves exhaustion. When people are exhausted, they often sigh (*xu* and *si*). Daoists practicing qi circulation generally avoid *xu* and *si*, for these are signs of long-breathing fatigue. This method is preserved for both men and women, originating from the *Immortal Classic*.\n\nBefore circulating qi, remove the hairs from the nose—this is the path to communion with the spirit. Do not draw qi during heavy dew, harsh winds, extreme cold, or intense heat.\n\nThe *Mingyi Lun* states: The origin of illness lies in the five labors. Once the five labors are exerted, the two viscera are first damaged—heart and kidneys receive evil, and all organs and bowels fall ill.\n\nThe five labors are:\n1. Will labor,\n2. Thought labor,\n3. Heart labor,\n4. Worry labor,\n5. Fatigue labor.\n\nThe five labors give rise to the six extremes:\n1. Qi extreme,\n2. Blood extreme,\n3. Sinew extreme,\n4. Bone extreme,\n5. Essence extreme,\n6. Marrow extreme.\n\nThe six extremes become the seven injuries, which transform into the seven pains. The seven pains cause illness, leading to an excess of pathogenic qi and a deficiency of upright qi. One becomes absent-minded, forgetful, sorrowful, and joyless. Food no longer nourishes, the skin loses its luster, and the hair turns white and withers. In severe cases, one may suffer from great wind, hemiplegia, sinew contraction, limb spasms, joint blockages, emaciation, shortness of breath, and pain in the waist and legs—all caused by early marriage, excessive expenditure of essence, insufficient blood and qi, and extreme exhaustion.\n\nIllness arises from the five viscera; one must identify its root. Those who do not understand should not attempt treatment.\n\nFor heart-viscera illness, where the body experiences cold and heat, use the *hu* and *chui* exhalations to expel it.\n\nFor lung-viscera illness, where the chest and back feel distended and full, use the *xu* exhalation to expel it. For spleen-viscera illness, where the body experiences wandering wind, persistent itching, and pain, use the *xi* exhalation to expel it. For liver-viscera illness, where the eyes ache and one feels sorrowful and joyless, use the *he* exhalation to expel it.\n\nThe twelve methods of regulating qi above all require drawing qi in through the nose and expelling it through the mouth, ensuring the sound of the breath follows the specific exhalations: *chui*, *hu*, *xu*, *he*, *xi*, and *yan*. If the afflicted practice these methods with reverence and focus, there will be no illness that is not cured—this is the essential art of longevity.\n\n**Chapter Five: Daoist Exercises and Massage**\n\nThe *Daoist Exercises Classic* states: At dawn before rising, first click the teeth thirty-four times, close the eyes, clench the fists, swish the mouth full of saliva, and swallow it three times. Then hold the breath to the utmost limit, and only after reaching the limit exhale slowly. Repeat this three times. Next, rise and assume the posture of a crouching wolf or a craning crow, shaking the body left and right without holding the breath, again to the utmost limit, three times. Then rise and descend to the grove, clench the fists without holding the breath, stamp the heels three times, raise one hand while lowering the other, again without holding the breath, to the utmost limit three times. Next, clasp the hands behind the neck and twist the body left and right, without holding the breath, three more times. Then stretch both legs and clasp the hands, leaning forward and backward, to the utmost limit three times. All these should be practiced morning and evening; frequent practice is especially beneficial.\n\nAt dawn, rub the palms together until hot and press them over the eyes three times. Then, with the fingers, scratch the four corners of the eyes to brighten the vision. According to the classic, securing the Gate of the Hun and controlling the Door of the Po is called \"clenching the fists,\" which stabilizes the hun and po and secures their gates. This is the method to preserve essence, brighten the eyes, prolong life, and restore black hair. If one clenches the fists all day, noxious qi and all poisons cannot enter.\n\n**Method of Clenching the Fists:** Bend the thumb beneath the four fingers and grasp it. With persistent practice, the eyes will no longer involuntarily open. Some say this prevents demonic possession.\n\nThe *Inner Explanation* states: The six that harm the body are: first, essence; second, saliva; third, tears; fourth, mucus; fifth, sweat; and sixth, urine. Their harm varies in degree. If one can go all day without spitting or sniffling, one should swish the mouth when full and swallow the saliva. If one constantly holds a jujube pit in the mouth and swallows the saliva, it generates a lovable qi and produces body fluids—this is of great importance. (Note: It is the fluids that are swallowed, not the pit.) Each morning, click the teeth thirty-six times—up to three hundred is even better—to strengthen the teeth and prevent pain. Then, stir the tongue to swish the mouth’s fluids, filling the mouth and swallowing three times. Next, rub the Shaoyang meridian of the fingers until hot and press them over the eyes, completing fourteen cycles to brighten the vision.\n\nEvery morning upon rising, clasp the hands over the ears and vigorously rub them up and down fourteen times to prevent deafness. Then, click the teeth, swish the Jade Spring three times and swallow, contract the nose, hold the breath, and with the right hand pull the left ear from above the head fourteen times. Repeat with the left hand pulling the right ear fourteen times to prolong life and prevent deafness. Next, pull the temples’ hair upward fourteen times, then grasp all the hair with both hands, pulling upward with full force fourteen times to promote the circulation of blood and qi and prevent the hair from turning white.\n\nAnother method: Rub the hands until hot and massage the face from top to bottom to dispel noxious qi and give the face a radiant glow. Another method: Rub the hands until hot and vigorously massage the body from top to bottom—this is called \"dry bathing,\" which enables one to withstand wind and cold, seasonal heat, headaches, and all illnesses. Before retiring at night, always rub the body with both hands—this is also called \"dry bathing\" and wards off wind and evil qi.\n\nSit upright, support the head with the left hand, and with the right hand reach upward as far as possible, then shake the body and hand together three times. Repeat with the right hand supporting the head and the left hand reaching upward to relieve sleep-induced lethargy.\n\nBefore sunrise in the morning, face south and sit upright. With both hands supporting the thighs, shake vigorously three times to give the face a radiant glow. Before washing and combing in the morning, sit upright, grasp the right hand with the left on the left thigh, and push forward and pull back with full force three times. Repeat with the right hand grasping the left on the right thigh. Next, clasp the hands and push forward with full force three times, then clasp the hands before the chest, push the elbows forward with full force three times. Straighten the left arm and bend the right arm as if drawing a bow of one *hu* and five *dou* capacity, exerting full strength. Repeat the bow-drawing posture with the right hand. Next, with the right hand on the ground and the left hand reaching upward as if supporting the sky, exert full force; repeat with the left hand on the ground. Then, clench the fists and thrust forward, each side twenty-one times. Next, clench the left hand and reach behind the back to grasp the fingers three times with full force; repeat with the right hand. This treats fatigue and qi stagnation in the back, arms, and elbows—frequent practice is especially beneficial.\n\nAt dawn after turning over, use a long staff to support the armpit, let the left foot hang in front of the grove, and slowly rise to full height, pulling the left foot fifty-seven times. Repeat with the right foot. This treats leg qi, pain and oppression, cold qi between the waist and kidneys, cold impediment, and cold knees and feet—all are addressed by this. Practicing this three times at dawn and dusk is even better. Avoid doing this when overly full or suppressing the urge to urinate.\n\nIf no staff is available for the pulling exercise, simply ensure the foot being pulled does not touch the ground—supporting oneself with a hand on an object will suffice.\n\nMorning and evening, comb the hair a full thousand strokes to greatly dispel head wind and prevent the hair from turning white. After combing, rub the crown of the head with salt blossoms and raw sesame oil for even better results. If *Divine Brightness Ointment* is available, rubbing it in is excellent.\n\nWhen washing and combing in the morning, knock the teeth one hundred and sixty times, and whenever saliva arises, swallow it. Then rinse the mouth with water, and further clean the teeth with tooth powder. Next, take a small half-measure of slightly fermented, clear rice-wash, swish it thoroughly, and spit it out to wash the eyes with the rinsing water. Afterward, close the eyes and wash the face with cold water—be sure no cold water enters the eyes. This method strengthens the teeth, brightens the eyes without tearing, and permanently prevents tooth decay.\n\nWhen washing the face at dawn and rinsing the mouth, swallow one or two mouthfuls of cold water to clarify the mind, dispel heat from the chest, and resolve oppression.\n\nHua Tuo of Qiao County was skilled in nurturing life. His disciples Wu Pu of Guangling and Fan A of Pengcheng received his teachings. Hua Tuo told Wu Pu: \"The human body requires movement, but one must not overexert. Constant motion digests the grain qi, circulates the blood and vessels, and prevents illness—like a door hinge that does not rot. The immortals of old and the Daoist Junqian of the Han dynasty practiced *daoyin* for health, performing bear hangs and crane stretches, pulling and extending the waist and limbs, and moving all the joints to seek longevity.\"\n\n\"I have a technique called the *Five Animals Play*: first the tiger, second the deer, third the bear, fourth the ape, and fifth the crow. These exercises eliminate illness, benefit the limbs, and serve as regular *daoyin*. When the body feels unwell, perform one of the animal plays until a slight sweat appears, then stop. Dust the body lightly with powder, and one will feel light and at ease, with the stomach ready for food.\"\n\nWu Pu practiced this and lived to over ninety, with keen hearing and vision, strong and complete teeth, and an appetite like that of a youth.\n\n**Tiger Play**: Crouch on all fours, spring forward three times, then backward twice. Extend the waist, stretch the legs to the side, look up to the sky, then return to the crouch and move forward and backward, seven times each.\n\n**Deer Play**: Crouch on all fours, stretch the neck and look back, left three times and right twice. Extend and retract the left and right legs, three and two times respectively.\n\n**Bear Play**: Lie flat on the back, clasp the knees with both hands, lift the head, and roll to the left to touch the ground seven times, then to the right seven times. Squat and push the ground with the hands to the left and right.\n\n**Ape Play**: Grasp an object and hang, stretching and contracting the body up and down seven times. Hook an object with the feet and hang, left and right seven times each. Stand on the hands, pull the body back, and press the head down, seven times each.\n\n**Crow Play**: Stand on both hands, lift one foot, stretch both arms, raise the eyebrows, and exert force fourteen times each. Sit and extend the legs, pull the toes seven times each, and retract and extend the arms fourteen times each.\n\nThe *Five Animals Play* should be performed according to one’s strength, stopping when sweat appears. After sweating, dust the body lightly with powder to digest grain qi, boost vitality, and eliminate all illnesses. Those who persist in this practice will surely attain longevity.\n\nThere is another method: sit calmly before eating and self-massage. Interlace the fingers, stretch the arms and thighs, and guide the flow of all vessels—this is more effective than medicine. Sit upright, look up to the sky, and exhale to instantly dissolve the qi of food and drink or drunkenness. Practicing this in summer keeps one cool and prevents heat.\n\n---\n\n**Chapter Six: On the Benefits and Harms of Sexual Union**\n\nThe Dao treasures essence: when expended, it gives life to others; when retained, it sustains the self. Sustaining the self leads to seeking transcendence and immortality; giving life to others fulfills one’s duty and then retreats. Yet fulfilling duty and retreating may entangle one in desire, becoming a grave peril. Why recklessly expend and waste it, unaware of the mounting loss, until exhaustion and life’s decline?\n\nHeaven and Earth possess yin and yang, which humans value. Valuing them in accord with the Dao requires only caution against waste.\n\nPengzu said: \"The superior person sleeps apart; the middling person uses separate covers. Consuming a thousand doses of medicine is not as good as sleeping alone.\" Sensual indulgence blinds the eyes, noise deafens the ears, and rich flavors dull the palate. If one can regulate and express the Dao, appropriately adjusting its flow and blockage, one may increase longevity.\n\n**Daily Taboo**: Do not eat to fullness at dusk. Sleeping after a full nighttime meal shortens a day’s lifespan.\n\n**Monthly Taboo**: Do not drink to intoxication at dusk. Sleeping after nighttime drunkenness shortens a month’s lifespan.\n\n**Yearly Taboo**: Avoid sexual union at dusk. Each union shortens a year’s lifespan, and recovery is impossible.\n\n**Lifelong Taboo**: Protect qi at dusk. Sleeping with the mouth open at night loses qi and allows evil to enter through the mouth.\n\nThe *Cai Nü* asked Pengzu: \"Should a person at sixty guard essence and maintain unity?\"\n\nPengzu replied: \"No. A man should not be without a woman. Without a woman, his thoughts stir, thoughts stir and the spirit labors, and spirit labor shortens lifespan. If one’s thoughts are truly upright, it is best to have no desires—yet this is nearly impossible. Forcibly suppressing and restraining them is difficult to maintain and easy to lose, causing seminal leakage, turbid urine, and even ghostly unions. Moreover, if qi is not aroused, the yang path weakens.\n\nWhen wishing to unite with a woman, first stir and arouse to strengthen the yang. Then proceed slowly, allowing her to receive yin qi. The yin qi will push the yang, and soon it will strengthen naturally. Use it when strong, but proceed slowly and sparsely. When essence stirs, regulate it; close the essence, slow the breath, close the eyes, lie still, and guide the body’s qi. Then one may unite with another woman. Each arousal should involve a different partner—changing partners can lead to longevity. If one unites with the same woman, her yin qi will be weak, and the benefit will be slight.\n\nThe yang path is like fire; the yin path is like water. Water can control fire...\"\n\nWhen yin also consumes yang, and its use is unceasing, yin qi hums against yang, causing yang to turn to harm. What is gained does not compensate for what is lost.\n\nYet if one can unite with twelve women without emission, it will grant an aged man a youthful countenance. If one unites with ninety-three women without emission, one may live ten thousand years.\n\nWhen essence is scant, illness follows; when essence is exhausted, death ensues. One must restrain and be cautious.\n\nFrequent union with occasional emission allows essence and qi to grow anew, preventing depletion. But if one emits with each union, essence cannot accumulate, and the path of essence will be exhausted.\n\nThose who frequently unite at home do so because each union without emission preserves the essence of a single emission. If emission occurs, frequent union becomes impossible. Even if one emits only twice a month, essence and qi will naturally regenerate, though slowly and subtly, unable to rise swiftly—far inferior to frequent union without emission.\n\nThe \"Gathering Maiden\" was a young adept who understood nurturing life. At one hundred seventy years, she appeared as a girl of fifteen. The King of Yin served her and sought the Way from Peng Zu.\n\nPeng Zu said: The reason debauchery shortens life is not the work of ghosts or spirits, but rather vulgar intent, stirred essence, and reckless emission to satisfy another’s desire. Exhausting oneself without restraint harms rather than nourishes, leading to madness, wasting thirst, epilepsy, or malignant sores—all from loss of essence. After each emission, one should practice guiding and drawing to replenish the loss. Without this, blood, vessels, marrow, and brain daily diminish. Wind and dampness invade, giving rise to illness, for common people know not the proper balance of replenishment and release.\n\nPeng Zu said: No man should be without a woman, nor woman without a man. Those who live alone and long for union harm their longevity, invite a hundred illnesses, and may even be joined by ghostly spirits. Losing essence once in such cases is as damaging as a hundred losses.\n\nIf seeking a child—one long-lived, wise, prosperous, and noble—emitting essence on a lunar-mansion day is most auspicious. The lunar-mansion days are recorded below.\n\nTian Lao said: All humans bear the Five Constants and share the same form, yet differ in rank and fortune. This arises from the union of parents under the eight stars of yin and yang, when yin and yang fail to align with the proper time.\n\nIf the union does not occur on a lunar-mansion day but falls at the right time, the child will be of superior quality. If neither condition is met, the child will be an ordinary person. Union on a lunar-mansion day—even if not at the proper time—may still produce a noble child and benefit the parents, a most auspicious sign.\n\nThe eight stars are: Chamber, Net, Well, Ghost, Willow, Spread, Heart, and Dipper. When the moon lodges in these stars, one may unite in yin and yang to seek a child.\n\nThe second, third, fifth, ninth, and twentieth days of the lunar month are days of flourishing life-energy. Union on these days multiplies vitality fivefold, sparing blood and qi and preventing illness. On these flourishing days, after midnight and before the cock’s crow, one should gently caress the Jade Spring, sip the Jade Nectar, and playfully engage.\n\nIf these days coincide with the seasonal stems—spring’s *jia-yin* and *yi-mao*, summer’s *bing-wu* and *ding-wei*, autumn’s *geng-shen* and *xin-you*, winter’s *ren-zi* and *gui-hai*—the benefits are even greater.\n\nTo conceive a son, wait until one, three, or five days after the woman’s menstrual flow ceases, then choose a flourishing day. At the hour when qi is born, after midnight, emit essence. The child will be male, long-lived, wise, and noble.\n\nThe flourishing days are: spring’s *jia* and *yi*, summer’s *bing* and *ding*, autumn’s *geng* and *xin*, winter’s *ren* and *gui*.\n\nIn nurturing life, the essential principle lies in treasuring essence. If one emits twice a month, aligning with the twenty-four solar terms in a year, one may live to one hundred twenty. With the addition of medicinal supplements, one may attain longevity.\n\nThe trouble is that in youth, people do not know the Way; even if they know, they do not trust or practice it. Only in old age do they begin to understand, but by then it is too late, and illness is hard to cure. Yet even late in life, if one can preserve oneself, one may still extend years and add to life. If one practices the Way in youth and prime, immortality may be hoped for.\n\nThe *Scripture of Immortals* says: The Dao of dual cultivation for man and woman lies in deep insertion without moving essence. Visualize a red hue within the navel, as large as a parrot’s egg, then slowly withdraw. When essence stirs, retreat. Practicing this dozens of times in a day and night will enhance longevity. Man and woman should each still their minds and focus together, requiring intense concentration.\n\nDaoist Liu Jing said: In spring, emit essence once every three days; in summer and autumn, twice a month; in winter, constantly retain essence without emission. Heaven’s Dao conceals yang in winter; those who emulate this attain longevity. One emission in winter equals a hundred in spring.\n\nMaster Ji Dao said: At sixty, one should entirely abstain from the bedchamber. If one can unite without emitting essence, one may still engage with women. If one cannot, complete avoidance is best. No hundred medicines compare to this practice in securing long life.\n\nThe *Daoist Grove* states: The root of life is the foundation of existence. Next in importance is this Way. Though one may take potent medicines, practice breath control and guiding, and cultivate myriad methods, without knowing the root of life, it is like a tree with lush branches and leaves but no roots—it cannot live long. The root of life lies in the affairs of the bedchamber.\n\nThus the sage said: To attain longevity, one must follow the source of life. The affairs of the bedchamber can give life or take it. Like water and fire, those who know their use may nurture life; those who do not may die instantly.\n\nUnion is especially forbidden when drunk or sated—this is a great taboo, harming a hundredfold. If one unites while suppressing the urge to urinate, it may cause strangury, difficult urination, pain in the stem, or stiffness in the lower abdomen.\n\nAfter great anger and intercourse, one may develop carbuncles and deep abscesses.\n\n*The Daoist Mechanism* states: Taboos in the bedchamber include the dark and new moons, the first and last quarters, full moons, solar and lunar eclipses, fierce winds, violent rain, earthquakes, thunder, lightning, and extreme cold or heat. On the days when the seasons change in spring, summer, autumn, and winter, and during the five days of transition between them, one must not engage in yin-yang union. The prohibitions are especially strict on one’s birth year, month, and day. When yin and yang are in conflict, union must not occur—it harms the blood and qi, drains the upright and admits the perverse, greatly injuring the true qi. Beware of this.\n\nOne must not engage in the bedchamber after newly washing the hair, after exhaustion from travel, or in states of great joy or anger.\n\nPengzu said: The subtleties of regulation must be understood. One must also avoid great cold, great heat, fierce winds, heavy rain, deep snow, solar and lunar eclipses, earthquakes, and thunderclaps—these are the heavenly taboos. Drunkenness, satiety, joy, anger, sorrow, grief, fear, and dread—these are the human taboos. Sacred mountains and rivers, altars of soil and grain, and places near wells and stoves—these are the earthly taboos. Having avoided these three taboos, there are also auspicious days: in spring, *jia* and *yi* days; in summer, *bing* and *ding* days; in autumn, *geng* and *xin* days; in winter, *ren* and *gui* days; and in the last month of each season, *wu* and *ji* days. These are the days of flourishing vitality. Union on such days brings long life, and any children conceived will surely be long-lived. Violating these taboos leads to illness, and children born will be ill-fated and short-lived.\n\nLaozi said: Returning the essence to replenish the brain can achieve agelessness.\n\n*The Scripture of Zidu* states: In the method of emission, one must enter weakly and withdraw strongly. What does this mean? Insert the jade stem between the zither strings and wheat sprouts, then withdraw when it is swollen and large—this is weak entry and strong withdrawal. Regulate this until eighty movements are completed, and the yang number is fulfilled, which is the sublime method.\n\nLaozi said: Weak entry and strong withdrawal is the art of nurturing life. Strong entry and weak withdrawal will abruptly end a good life—this is what it means.\n\n*Yangxing Yanming Lu*, Volume Two, concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "生延命录》。 梁·陶弘景撰。 二卷。 底本出处：《正统道藏》洞神部方法类。 参校版本：一、《云笈七签》，收入该书卷三十三。 二、《道藏精华录》本，收入该书第二集。 养性延命录序 夫禀气含灵，唯人为贵#1人所贵者，盖贵为生。 生者神之本，形者神之具。 神大用则竭，形大劳则毙。 若能游心虚静，息虑无为，服元气於子后，时导引於闲室，摄养无亏，兼饵良药，则百年耆寿，是常分也。 如恣意以耽声色，役智而图富贵，得丧恒切於怀#2，躁挠未能自遣，不拘礼度，饮食无节，如斯之流，宁免夭伤之患也。 余因止观微暇，聊复披览《养生要集》。 其集乃钱彦、张湛道林之徒，翟平、黄山之辈，咸是好事英奇，志在宝育，或鸠集仙经真人寿考之规，或得采彭铿老君长龄之术，上自农黄以来，下及魏晋之际，但有益於养生及招损於后患#3，诸本先皆记录，今略取要法，删弃繁芜，类聚篇题，分为上下两卷，卷有三篇，号为《养性延命录》，拟补助於有绿，冀凭绿以济物耳。 或云此书孙思邈所集。 #1为：《云笈七签》作『於』。 #2得丧怛切於怀：《云笈七签》作『得丧萦於怀抱』。 #3及招损於后患：《云笈七签》作『乃无损於后患』。 养性延命录卷上 华阳陶隐居集",
      "translated_text": "*The Record of Nurturing Life and Extending Lifespan*\nBy Tao Hongjing of the Liang Dynasty\nTwo fascicles\n\n**Source of the Base Text:** *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, Methods Category\n**Collated Editions:**\n1. *The Seven Bamboo Tablets of the Cloudy Satchel*, included in Fascicle 33\n2. *Essential Writings from the Daoist Canon*, included in the second collection\n\n**Preface to *The Record of Nurturing Life and Extending Lifespan***\n\nAll beings endowed with *qi* and spirit are noble, yet none surpass humanity in worth. What humanity holds most dear is life itself. Life is the root of spirit, while form is its vessel. When spirit is overtaxed, it is exhausted; when form is overburdened, it perishes. If one can still the mind in emptiness and tranquility, quieting thoughts through non-action, absorb primordial *qi* after midnight, and practice *daoyin* in a secluded chamber, nurturing life without neglect while supplementing with fine medicines, then a lifespan of a hundred years is but the natural allotment. Yet those who indulge in sensual pleasures, exhaust their wit in pursuit of wealth and rank, cling to gains and losses in their hearts, or remain restless and unable to free themselves—who disregard propriety and moderation in diet—how can such as these escape the calamity of premature death?\n\nIn moments of respite from meditation, I have perused *The Essential Collection of Nurturing Life*. This compilation was assembled by scholars such as Qian Yan and Zhang Zhan of the Daoist groves, alongside Qi Ping and Huang Shan—all keen and extraordinary minds devoted to preserving and cultivating life. Some gathered the precepts of immortals and perfected beings on longevity, while others adopted the arts of Peng Keng and the Old Lord for extending years. From the time of Fuxi and the Yellow Emperor down to the Wei and Jin dynasties, whatever benefited nurturing life or risked harm to later years was recorded in the original texts. Here, I have distilled the essential methods, pruned the excess, and organized them into thematic sections, dividing the work into two fascicles with three chapters each. Entitled *The Record of Nurturing Life and Extending Lifespan*, this work aims to aid those with affinity for such teachings, hoping thereby to benefit all beings.\n\nSome claim this book was compiled by Sun Simiao.\n\n**Fascicle One of *The Record of Nurturing Life and Extending Lifespan***\nCompiled by Tao the Recluse of Huayang",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 506,
      "start_sentence": 0,
      "end_sentence": 19,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.965638637542725,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养性延命录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "教诚篇第一 《神农经》曰：食谷者，智慧聪明。 食石者，肥泽不老。 谓炼五石也。 食芝者，延年不死。 食元气者，地不能埋，天不能杀。 是故食药者，与天相异，日月并列。 《混元道经》曰：谷神不死，河上公曰：谷，养也，能养神则不死。 神为五藏之神。 肝藏魂，肺藏魄，心藏神，肾藏精，脾藏志。 五藏尽伤，则五神去。 是谓玄牝。 言不死之道，在於玄牝。 玄，天也，天於人为鼻。 牝，地也，地於人为口。 天食人以五气，从鼻入藏於心。 五气清微，为精神、聪明、音声、五性。 其鬼日魂。 魂者，雄也。 出入人鼻，与天通户故鼻为玄也。 地食人以五味，从口入藏於胃。 五味浊滞，为形骸、骨肉、血脉、六情。 其鬼日魄。 魄者，雌也。 出入於口，与地通，故口为牝也。 玄牝之门，是谓天地根。 根，原也。 言鼻口之门，乃是天地之元气，所从往来也。 绵绵若存，鼻口呼嗡喘息，当绵绵微妙，若可存，复若无有也。 用之不勤。 用气当宽舒，不当急疾、勤劳。",
      "translated_text": "**Chapter One: Teachings and Admonitions**\n\nThe *Divine Farmer’s Classic* states: Those who eat grains gain wisdom and clarity. Those who consume minerals grow plump and lustrous, never aging—this refers to refining the Five Minerals. Those who eat *zhi* mushrooms extend their years without dying. Those who ingest primordial *qi* cannot be buried by earth or slain by heaven. Thus, those who consume medicinal substances differ from heaven, standing alongside the sun and moon.\n\nThe *Daoist Scripture of Primordial Unity* states: The valley spirit does not die. Master Heshang says: *Gu* means nurturing; to nurture the spirit is to avoid death. The spirit governs the five viscera. The liver stores the *hun*, the lungs store the *po*, the heart stores the spirit, the kidneys store essence, and the spleen stores will. When the five viscera are all damaged, the five spirits depart. This is called the Mysterious Female. It speaks of the undying Dao, which lies in the Mysterious Female. *Xuan* is heaven, and in humans, it is the nose. *Pin* is earth, and in humans, it is the mouth. Heaven feeds humans with the five *qi*, which enter through the nose and are stored in the heart. The five *qi* are pure and subtle, becoming spirit, intelligence, voice, and the five natures. Their ghost is called the *hun*. The *hun* is yang; it enters and exits through the human nose, communicating with heaven—thus the nose is *xuan*. Earth feeds humans with the five flavors, which enter through the mouth and are stored in the stomach. The five flavors are turbid and stagnant, forming the body’s frame, bones, flesh, blood vessels, and the six emotions. Their ghost is called the *po*. The *po* is yin; it enters and exits through the mouth, communicating with earth—thus the mouth is *pin*. The gate of the Mysterious Female is called the root of heaven and earth. *Root* means origin. It speaks of the gates of the nose and mouth, which are the source of the primordial *qi* of heaven and earth, through which it comes and goes. It is continuous as if existing, yet the breath of the nose and mouth should be soft and subtle, as if present yet also as if absent. In using it, one must not be hasty. When employing *qi*, one should be relaxed and unhurried, not urgent, hurried, or laborious.",
      "overlap_context": ". Here, I have distilled the essential methods, pruned the excess, and organized them into thematic sections, dividing the work into two fascicles with three chapters each. Entitled *The Record of Nurturing Life and Extending Lifespan*, this work aims to aid those with affinity for such teachings, hoping thereby to benefit all beings.\n\nSome claim this book was compiled by Sun Simiao.\n\n**Fascicle One of *The Record of Nurturing Life and Extending Lifespan***\nCompiled by Tao the Recluse of Huayang",
      "start_char": 506,
      "end_char": 894,
      "start_sentence": 20,
      "end_sentence": 50,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.679764986038208,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养性延命录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "《混元道德经》曰：出生谓情欲出於五内，魂定魄静，故生也入死谓情欲入於胸臆，精散神惑，故死也。 生之徒十有三，死之徒十有三。 言生死之类，各十有三，谓之九家而四关也。 其生也，目不妄视，耳不妄总，鼻不妄噢，口不妄言，手不妄持，足不妄行，精不妄施。 其死也，反是。 人之生也，动皆之死地十有三。 人欲求生，动作反之，十有三之死地。 夫何故？ 以其求生之厚也。 所以动之死地者，以其求生之活之太厚也。 远道反天，妄行失纪。 盖闻善摄生者，陆行不遇兕虎，入军不被甲兵。 兕无所投其角，虎无所措其爪，兵无所容其刃。 夫何故？ 以其无死地。 以其不犯上十有三之死地也。 《庄子·养生篇》曰：吾生也有涯，向秀曰：生之所察一各有极#1也。 而智也无涯。 嵇康曰：夫不虑而欲，性之动也。 识而发感，智之用也。 性动者，遇物而当足，则无余智，从感不求，倦而不已。 故世之所患，但在於智困，不在性动也。 以有涯随无涯，殆已； 郭象曰：以有限之性寻无趣之智，安得而不困哉。 已而为智者，殆而已矣。 向秀曰：已困於智矣。 又为智以攻之者，又殆矣。 《庄子》曰：达生之情者，不务生之所无以为； 向秀曰：生之所无以为者，性之事也。 张湛曰：生理自全，为分外所为，此是以有涯随无涯也。 达命之情者，不务智之所无奈何。 向秀曰：命尽而死者是。 张湛曰：乘生顺之理，穷所察分，岂智所知何也。 《列子》曰：少不勤行，壮不竞时，长而安贫，老而寡欲，闲心劳形，养生之方也。 《列子》曰：一体之盈虚，消息皆通於天地，应於万类。 张湛曰：人与阴阳通气。 和之於始，和之於终，静神灭想，生之道也。 始终和，则神志#2不散。 《混元妙真经》曰：人常失道，非道失人。 人常去生，非生去人。 故杂生者，慎勿失道。 为道者，慎己失生，使道与生相守，生与道相保。 《黄老经玄示》曰：天道施化，与万物无穷； 人道施化，形神消亡。 转神施精，精竭故衰。 形本生精，精生於神。 不以生施，故能与天合德； 不与神化，故能与道同式。 《玄示》曰：以形化者，尸解之类。 神与形离，二者不俱，遂象飞乌入海为蛤，而随季秋阴阳之气。 以气化者，生可冀也； 以形化者，甚可畏也。 严君平《老子指归》曰：游心於虚静，结志於微妙，委虑於无欲，归计#3於无为，故能达生延命，与道为久。 《大有经》曰：或疑者云，始同起於无外，终受气於阴阳，载形魄於天地，资生长於食息，而有愚有智，有强有弱，有寿有夭，天耶？ 人耶？ 解者曰：夫形生愚智，天也。 强弱寿夭，人也。 天道自然，人道自己。 始而胎气充实，生而乳食有余，长而滋味不足，壮而声色有节者，强而寿．。 始而胎气虚耗，生而乳食不足，长而滋味有余，壮而声色自放者，弱而夭。 生长全足，加之导养，年未可量。 《道机》曰：人生而命有长短者，非自然也，皆由将身不谨，饮食过差，淫泱无度，作逆阴阳，魂神不守，精竭命衰，百病萌生，故不终其寿。 《河图帝视萌》曰：侮天时者凶，顺天时者吉。 春夏乐山高处，秋冬居卑深藏，吉利多福，寿考无穷。 《维书宝予命》曰：古人治病之方，和以醴泉，润以元气，药不辛不苦，甘甜多味，常能服之，津流五藏，系在心肺，终身无患。",
      "translated_text": "The *Hunyuan Daode Jing* states: \"Birth\" means that emotions and desires emerge from the five viscera, the *hun* is settled and the *po* is tranquil—thus life arises. \"Entering death\" means that emotions and desires penetrate the chest and diaphragm, essence scatters and spirit is deluded—thus death ensues. Those who follow life number thirteen; those who follow death number thirteen. This speaks of the categories of life and death, each numbering thirteen, which are called the nine chambers and four gates.\n\nIn life, the eyes do not recklessly gaze, the ears do not recklessly listen, the nose does not recklessly inhale, the mouth does not recklessly speak, the hands do not recklessly grasp, the feet do not recklessly walk, and essence is not recklessly expended. In death, the opposite holds true.\n\nAs humans live, all their movements lead to the thirteen paths of death. Those who seek life yet act contrary to this reach the thirteen paths of death. Why is this so? Because their pursuit of life is too excessive. The reason their movements lead to death is that their striving for life is overly intense. Departing from the Dao and rebelling against heaven, reckless actions lose their proper order.\n\nIt is said that those who skillfully nurture life do not encounter rhinoceroses or tigers when traveling on land, nor are they harmed by weapons when entering battle. The rhinoceros has nowhere to thrust its horn, the tiger has nowhere to place its claws, and weapons have nowhere to lodge their blades. Why is this so? Because they avoid the paths of death—because they do not transgress the thirteen paths of death.\n\nThe *Zhuangzi*’s \"Nourishing Life\" chapter states: \"Our life has limits,\" to which Xiang Xiu comments: \"The scope of life, each with its own bounds.\" \"Yet knowledge has no limits.\" Ji Kang says: \"To desire without reflection is the movement of nature. To recognize and then respond is the function of knowledge. When nature moves, encountering things appropriately suffices, leaving no surplus of knowledge; following sensations without seeking, one becomes weary yet does not cease.\" Thus, the world’s afflictions lie in the exhaustion of knowledge, not in the movement of nature.\n\n\"To pursue the limitless with the limited is perilous,\" as Guo Xiang notes: \"Using a finite nature to chase boundless knowledge, how can one not be exhausted?\" \"Having already exhausted oneself through knowledge, to then employ knowledge to attack it is yet more perilous,\" as Xiang Xiu says: \"Already exhausted by knowledge, to further employ knowledge is yet more perilous.\"\n\nThe *Zhuangzi* states: \"Those who comprehend the essence of life do not strive for what life cannot provide,\" to which Xiang Xiu comments: \"What life cannot provide are the affairs of nature.\" Zhang Zhan adds: \"When the principle of life is naturally preserved, to pursue what lies beyond one’s allotted share is to chase the limitless with the limited.\"\n\n\"Those who comprehend the essence of fate do not strive for what knowledge cannot control,\" as Xiang Xiu says: \"This refers to death when one’s fate is exhausted.\" Zhang Zhan notes: \"Following the principle of life’s natural course and exhausting one’s allotted span, how can knowledge know what lies beyond?\"\n\nThe *Liezi* states: \"In youth, do not neglect diligent practice; in adulthood, do not fail to seize the moment; in maturity, be content with poverty; in old age, reduce desires. Calm the mind and labor the body—this is the method of nurturing life.\"\n\nThe *Liezi* further states: \"The fullness and emptiness of the body’s unity ebb and flow in harmony with heaven and earth, responding to the myriad things.\" Zhang Zhan comments: \"Humans share *qi* with yin and yang.\" \"Harmonize it at the beginning, harmonize it at the end; still the spirit and extinguish thoughts—this is the Dao of life. When beginning and end are harmonized, the spirit and will do not scatter.\"\n\nThe *Hunyuan Miaozhen Jing* states: \"Humans often lose the Dao, not the Dao losing humans. Humans often depart from life, not life departing from humans. Thus, those who mingle with life must be cautious not to lose the Dao. Those who practice the Dao must be cautious not to lose life, ensuring that the Dao and life guard each other, and life and the Dao preserve one another.\"\n\nThe *Huanglao Jing Xuanshi* states: \"The Dao of heaven enacts transformation, enduring with the myriad things without end. The Dao of humans enacts transformation, yet form and spirit perish. To circulate spirit and expend essence—when essence is exhausted, decay follows. Form fundamentally generates essence, and essence arises from spirit. Not expending life’s resources, one can thus unite virtue with heaven. Not transforming with spirit, one can thus align with the Dao’s pattern.\"\n\nThe *Xuanshi* further states: \"Those who transform through form belong to the category of corpse liberation. Spirit and form separate, and the two do not remain together, like birds flying into the sea and becoming clams, following the yin and yang *qi* of late autumn. Those who transform through *qi* may yet hope for life; those who transform through form are deeply to be feared.\"\n\nYan Junping’s *Laozi Zhigui* states: \"Let the mind wander in emptiness and stillness, focus the will on the subtle and wondrous, entrust thoughts to desirelessness, and return plans to non-action—thus one can comprehend life, extend lifespan, and endure with the Dao.\"\n\nThe *Dayou Jing* states: Some doubt, saying: \"All begin equally from the boundless, receive *qi* from yin and yang, bear form and *po* in heaven and earth, and rely on sustenance and breath for growth—yet there are the foolish and the wise, the strong and the weak, the long-lived and the short-lived. Is this heaven’s doing or man’s?\" The explanation is: \"Whether one’s form is foolish or wise is determined by heaven. Strength, weakness, long life, or early death are determined by humans. The Dao of heaven is natural; the Dao of humans is self-made.\"\n\n\"Those whose fetal *qi* is full at the beginning, whose milk and food are abundant in infancy, whose nourishment is sufficient in youth, and whose sounds and colors are moderate in adulthood will be strong and long-lived. Those whose fetal *qi* is depleted at the beginning, whose milk and food are insufficient in infancy, whose nourishment is excessive in youth, and whose sounds and colors are unrestrained in adulthood will be weak and short-lived. If one’s growth is complete and nurtured with proper guidance, one’s years cannot be measured.\"\n\nThe *Daoji* states: \"That human lifespans vary in length is not natural; it is all due to carelessness in self-preservation, immoderate eating and drinking, excessive indulgence, acting contrary to yin and yang, the *hun* and spirit not being guarded, essence being exhausted and life declining, and the hundred diseases sprouting—thus one does not complete one’s natural lifespan.\"\n\nThe *Hetu Dishi Meng* states: \"Those who defy the seasons meet misfortune; those who follow the seasons meet good fortune. In spring and summer, delight in high mountains; in autumn and winter, dwell in low, secluded places. This brings good fortune, abundant blessings, and boundless longevity.\"\n\nThe *Weishu Baoyu Ming* states: \"The methods of the ancients for treating illness involved harmonizing with sweet springs, moistening with primordial *qi*, using medicines neither pungent nor bitter but sweet and flavorful, and taking them regularly. This caused fluids to flow through the five viscera, connect to the heart and lungs, and ensure lifelong freedom from illness.\"",
      "overlap_context": "he gate of the Mysterious Female is called the root of heaven and earth. *Root* means origin. It speaks of the gates of the nose and mouth, which are the source of the primordial *qi* of heaven and earth, through which it comes and goes. It is continuous as if existing, yet the breath of the nose and mouth should be soft and subtle, as if present yet also as if absent. In using it, one must not be hasty. When employing *qi*, one should be relaxed and unhurried, not urgent, hurried, or laborious.",
      "start_char": 895,
      "end_char": 2174,
      "start_sentence": 51,
      "end_sentence": 115,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.025596618652344,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养性延命录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "《孔子家语》曰：食肉者勇敢而悍，虎狼之类。 食气者神明而寿，仙人、灵龟是也。 食谷者智慧而夭； 人也。 不食者不死而神。 直任喘息而无思虑。 《传》曰：杂食者，百病妖邪所锺，所食愈少，心愈开，年愈益； 所食愈多，心愈塞，年愈损焉。 太史公司马谈曰：夫神者，生之本； 形者，生之具也。 神大用则竭，形大劳则毙。 神形早衰，欲与天地长久，非所闻也。 故人所以生者，神也。 神之所托者，形也。 神形离别则死，死者不可复生，离者不可复返，故乃圣人重之。 夫养生之道，有都领大归，未能具其会者，但思每与俗反，则间践胜辙，获过半之功矣。 有心之徒，可不察欤。 《小有经》曰：少思、少念、少欲、少事、少语、少笑、少愁、少乐、少喜、少怒、少好、少恶，行此十二少，养生之都契也。 多思则神殆，多念则志散，多欲则损志，多事则形疲，多语则气争，多笑则伤藏，多愁则心慑，多乐则意溢，多喜则忘错僭乱，多怒则百脉不定，多好则专迷不治，多恶则憔煎无欢，此十二多不除，丧生之本也。 无多者，几乎真人大计。 奢懒者寿，怪勤者夭，放散劬吝之异也。 田夫寿，膏粱夭，嗜欲少多之验也。 处士少疾，游子多患，事务繁简之殊也。 故俗人竞利，道士罕营。 胡昭曰：目不欲视不正之色，耳不欲听丑秽之言，鼻不欲向膻腥之气，口不欲尝毒刺#5之味，心不欲谋欺诈之事，此辱神损寿。 又居常而叹息，晨夜而吟啸，干正来邪也。 夫常人不得无欲，又复不得无事，但当和心少念，静身损虑，先去乱神犯性#6，此则啬神之一术也。 《黄庭经》曰：玉池清水灌灵根，审能修之可长存，名日饮食自然。 自然者，则是华池。 华池者，口中唾也。 呼吸如法，咽之则不饥也。 《老君尹氏内解》曰：唾者，凌为醴泉，聚为玉浆，流为华池，散为精浮，降为甘露。 故口为华池，中有醴泉，漱而咽之，溉藏润身，流利百脉，化养万神、支节、毛发，宗之而生也。 《中经》曰：静者寿，躁者夭。 静而不能养臧寿，躁而能养延年。 然静易御，躁难将，尽顺养之宜者，则静亦可养，躁亦可养。 韩融元长曰：酒者，五谷之华，味之至也，亦能损人。 然美物难将而易过，养性所宜慎之。 邵仲湛曰：五谷充肌体而不能益寿，百药疗疾延年而不甘口。 甘口充肌者，俗人所珍； 苦口延年者，道士之所宝。 《素问》曰：黄帝问岐伯曰：余闻上古之人，春秋皆百岁而动作不衰； 谓血气犹盛也。 今时之人，年始半百动作皆衰者，时世异耶？ 将人之失耶？ 岐伯曰：上古之人，其知道者，法则阴阳，和於术数，房中交接之法。 饮食有节，起居有度，不妄动作。 故能#7与神俱，尽终其天命，寿过百岁。 今时之人则不然，以酒为浆，以妄为常，醉以入房，以欲竭其精，以好散其真，不知持满，不时御神，务快其心，游於阴阳，生治起居，无节无度，故半百而衰也。 老君曰：人生大期，百年为限，节护之者，可至千岁。 如膏之用，小灶与大耳。 众人大言而我小语，众人多烦而我少记，众人悸暴而我不怒，不以人事累意，不修仕禄之业#8，淡然无为，神气自满，以为不死之药，天下莫我知也。 无谓幽冥，天知人情。",
      "translated_text": "The *Kongzi Jiayu* states: \"Those who eat meat are brave and fierce, like tigers and wolves. Those who consume *qi* are spiritually luminous and long-lived, like immortals and sacred turtles. Those who eat grains are wise but short-lived—such is man. Those who eat nothing do not die and become spirits, relying solely on breath without thought or care.\"\n\nThe *Commentary* says: \"Those of mixed diet attract the hundred diseases and malevolent spirits. The less one eats, the more the mind opens and the years increase; the more one eats, the more the mind is obstructed and the years diminish.\"\n\nThe Grand Historian Sima Tan said: \"The spirit is the root of life; the body is its vessel. Excessive use of the spirit exhausts it; excessive labor of the body destroys it. When spirit and body prematurely decline, to desire longevity like heaven and earth is unheard of. Thus, what enables man to live is the spirit; what the spirit relies upon is the body. When spirit and body part, death ensues—once dead, one cannot revive; once parted, they cannot reunite. Therefore, the sage values this deeply.\n\nThe Dao of nurturing life has a unifying principle, though few fully grasp its essence. Yet if one merely considers how to oppose common customs, one treads the path of victory, gaining more than half the benefit. Those with intent—can they not reflect on this?\"\n\nThe *Xiaoyou Jing* states: \"Few thoughts, few intentions, few desires, few affairs, few words, few laughs, few sorrows, few joys, few likes, few dislikes, few attachments, few aversions—practicing these twelve *fews* is the comprehensive key to nurturing life. Excessive thought endangers the spirit; excessive intention scatters the will; excessive desire harms resolve; excessive affairs fatigue the body; excessive speech depletes *qi*; excessive laughter injures the viscera; excessive sorrow cowers the heart; excessive joy overflows the mind; excessive delight leads to forgetfulness, errors, and chaos; excessive anger unsettles the hundred vessels; excessive attachment leads to obsession and disorder; excessive aversion brings emaciation and joylessness. Failing to eliminate these twelve *excesses* is the root of life’s ruin. Those who avoid excess approach the great plan of the perfected.\n\nThe extravagant and indolent live long; the strange and diligent die young—such is the difference between dissipation and stinginess. Farmers live long; the pampered die young—such is the proof of few or many desires. Recluses fall ill rarely; wanderers suffer often—such is the divergence of simplicity and complexity. Thus, worldly men compete for profit, while Daoists seldom scheme.\"\n\nHu Zhao said: \"The eyes should not gaze upon improper colors; the ears should not listen to foul words; the nose should not face rank odors; the mouth should not taste poisonous or pungent flavors; the heart should not plot deceitful schemes—these bring disgrace to the spirit and shorten life. Moreover, sighing habitually or wailing day and night invites misfortune and invites evil. Ordinary people cannot be without desires or affairs, but one should harmonize the mind, reduce thoughts, calm the body, and lessen worries. First, eliminate what disturbs the spirit and violates nature—this is one method of conserving the spirit.\"\n\nThe *Huangting Jing* states: \"Wash the spiritual root with the clear waters of the Jade Pool; those who cultivate this may endure forever. This is called *natural* eating and drinking. *Natural* refers to the Flowery Pool—the saliva in the mouth. When breath is regulated and swallowed, hunger ceases.\"\n\nThe *Laojun Yinshi Neijie* says: \"Saliva transforms into sweet springs, gathers as jade nectar, flows as the Flowery Pool, scatters as floating essence, and descends as sweet dew. Thus, the mouth is the Flowery Pool, containing sweet springs. Rinsing and swallowing it moistens the viscera, nourishes the body, benefits the hundred vessels, and sustains the myriad spirits, joints, and hair—life arises from this.\"\n\nThe *Zhong Jing* states: \"The tranquil live long; the restless die young. Tranquility that cannot nurture may still grant longevity; restlessness that is cultivated can extend years. Yet tranquility is easy to govern, while restlessness is hard to manage. Those who fully follow the proper methods of nurture may cultivate both tranquility and restlessness.\"\n\nHan Rong Yuanchang said: \"Wine is the essence of the five grains, the pinnacle of flavor—yet it can also harm. Fine things are hard to manage and easy to overindulge in; one must be cautious in nurturing life.\"\n\nShao Zhongzhan said: \"The five grains fill the body but cannot extend life; the hundred medicines cure illness and prolong years but are not palatable. What is palatable and fills the body is prized by worldly men; what is bitter and extends life is treasured by Daoists.\"\n\nThe *Suwen* states: The Yellow Emperor asked Qi Bo: \"I have heard that the people of high antiquity lived to a hundred years without decline in movement—was their blood and *qi* still abundant? Yet today, people begin to decline at fifty—is this due to the times, or have men lost the way?\"\n\nQi Bo replied: \"The people of high antiquity who understood the Dao modeled themselves on yin and yang, harmonized with arts and calculations, and followed the methods of chamber arts. Their eating and drinking were moderated, their rising and resting were regulated, and they did not act recklessly. Thus, they could accompany the spirit, fulfill their natural lifespan, and live beyond a hundred years. Today’s people are not so: they take wine as broth, treat recklessness as normal, enter the chamber while drunk, exhaust their essence with desire, dissipate their true *qi* with indulgence, fail to maintain fullness, do not timely manage the spirit, seek to please the heart, and wander in yin and yang. Their daily life and conduct lack moderation—thus they decline at fifty.\"\n\nLaozi said: \"Man’s great term is a hundred years as the limit; those who regulate and protect it may reach a thousand. It is like using oil—whether on a small or large lamp. While the crowd speaks grandly, I speak softly; while the crowd is troubled, I remember little; while the crowd is violent, I do not anger. I do not burden my mind with worldly affairs or pursue official rank. Serene and effortless, my spirit and *qi* fill naturally—this is the medicine of immortality, unknown to the world. Do not say the unseen is obscure; heaven knows the hearts of men.\"",
      "overlap_context": "utumn and winter, dwell in low, secluded places. This brings good fortune, abundant blessings, and boundless longevity.\"\n\nThe *Weishu Baoyu Ming* states: \"The methods of the ancients for treating illness involved harmonizing with sweet springs, moistening with primordial *qi*, using medicines neither pungent nor bitter but sweet and flavorful, and taking them regularly. This caused fluids to flow through the five viscera, connect to the heart and lungs, and ensure lifelong freedom from illness.\"",
      "start_char": 2175,
      "end_char": 3411,
      "start_sentence": 116,
      "end_sentence": 168,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.73068881034851,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养性延命录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "无谓间昧，神见人形。 心言小语，鬼闻人声。 犯禁满千，地收人形。 人为阳善，吉人报之。 人为阴善，鬼神报之。 人为阳恶，贼．人治之。 人为阴恶，鬼神治之。 故天不欺人依以影，地不欺人依以响。 老君曰：人修善积德而遇其凶祸者，受先人之余殃也； 犯禁为恶而遇其福者，蒙先人之余殃也。 《名医叔病论》曰：世人不终耆寿，咸多夭段者，皆由不自爱惜，忿争尽意，邀名射利，聚毒攻神，内伤骨髓，外贬#10筋肉，血气将无，经脉便拥，肉理#11空疏，唯招蛊#12疾，正气日衰，邪气日盛矣。 不异举沧波以注燸火，颓华岭而断涓流，语其易也，甚於兹矣。 彭祖曰：道不在烦，但能不思衣，不思食，不思声，不思色，不思胜，不思负，不思失，不思得，不思荣，不思辱，心不劳，形不极，常导引纳气胎息尔，可得千岁。 欲长生无限者，当服上药。 仲长统日； 荡六情五性，有心而不以之思，有口而不以之言，有体而不以之安，安之而能迁，乐之而不爱，以之图之，不知日之益也，不知物之易也。 其彭祖、老聘庶几，不然彼何为与人者同类，而与人者异寿？ 陈纪元方曰：百病横夭，多由饮食。 饮食之患，过於声色。 声色可绝之瑜年，饮食不可废之一日。 为益亦多，为患亦切。 多则切伤，少则增益。 张湛云：凡脱贵势者，虽不中邪，精神内伤，身必死亡。 非妖祸外侵，直由冰炭内煎，则自崩伤中呕血也。 始富后贫，虽不中邪，皮焦筋出，委辟为挛。 贫富之於人利害，犹於权势，故病疹损於形骸而已。 动胜寒，静胜热，能动能静，所以长生。 精气清静，乃与道合。 《庄子》曰：真人其寝不梦。 《慎子》云：昼无事者，夜不梦。 张道人年百数十，甚翘壮也。 云：养性之道，莫久行、久坐、久外、久视、久听，莫强食饮，莫大沉醉，莫大愁忧，莫大哀思，此所谓能中和。 能中和者，必久寿也。 《仙经》曰：我命在我不在天。 但愚人不能知此。 道为生命之要，所以致百病风邪者，皆由恣意极情，不知自惜，故虚损生也。 譬如枯朽之木，遇风即折； 将崩之岸，值水先颓。 今若不能服药，但知爱精节情，亦得一二百年寿也。 张湛《养生集·叔》曰：养生大要一日啬神，二曰爱气，三日养形，四日导引，五曰言语，六日饮食，七日房室，八日反俗，九曰医药，十日禁忌。 过此已往，义可略焉。 青牛道士言：人不欲使乐，乐人不寿。 但当莫强健为力所不任。 举重引强，掘地苦作，倦而不息，以致筋骨疲竭耳。 然於劳苦胜於逸乐也。 能从朝至暮，常有所为，使之不息乃快，但觉极当息，息复为之。 此与导引无异也。 夫流水不腐，户枢不朽者，以其劳动数故也。 饱食不用坐与外，欲得行步，务作以散之。 不尔，使人得积聚不消之疾，及手足痹蹶，面目党奸，必损年寿也。 皇甫隆问青牛道士，青牛道士姓封，字君达。 其养性法则可施用#13。 大略云：体欲常劳，食欲常少，劳无过极，少无过虚，去肥浓，节咸酸，臧思虑，损喜怒，除驰逐，慎房室。 武帝行之有效。 彭祖曰：人之受气，虽不知方术，但养之得理，常寿之一百二十岁。 不得此者，皆伤之也。 小复晓道，可得二百四十岁，复微加药物，可得四百八十岁。",
      "translated_text": "\"Do not dismiss the unseen as obscure—spirits perceive human form. Whispered words in the heart, ghosts hear human voice. Violate a thousand prohibitions, and the earth claims one’s body.\n\nMan performs yang goodness, and good people repay it. Man performs yin goodness, and ghosts and spirits repay it. Man commits yang evil, and bandits or men punish him. Man commits yin evil, and ghosts and spirits punish him. Thus, heaven does not deceive man—it responds like a shadow; earth does not deceive man—it echoes like a sound.\n\nLaozi said: Those who cultivate goodness and accumulate virtue yet encounter misfortune suffer the lingering calamities of their ancestors; those who violate prohibitions and commit evil yet encounter fortune inherit the residual blessings of their ancestors.\n\n*The Treatise on Illnesses by Renowned Physicians* states: People do not live out their natural lifespan but often die prematurely, all because they fail to cherish themselves—indulging in anger, contention, and unbridled desires, pursuing fame and profit, amassing toxins to assault the spirit, internally injuring the marrow, externally wasting the sinews and flesh. When blood and *qi* are nearly depleted, the meridians become obstructed, the flesh and texture grow porous, and only demonic illnesses are invited. True *qi* wanes daily, while pathogenic *qi* waxes. This is no different from pouring the vast ocean into a flickering flame or collapsing a towering peak to dam a trickling stream—easier said than done, yet far worse than these.\n\nPengzu said: The Dao is not in complexity. Simply refrain from thinking of clothing, food, sound, color, victory, defeat, loss, gain, honor, or disgrace. Let the heart not labor, the body not exhaust itself, and regularly practice *daoyin*, absorb *qi*, and embrace embryonic breathing—thus one may attain a thousand years. Those who seek boundless longevity must ingest the supreme medicine.\n\nZhongchang Tong said: Dissolve the six emotions and five natures; have a heart yet not think with it, a mouth yet not speak with it, a body yet not rest in it. Find peace in what is peaceful yet remain unattached; delight in what is delightful yet feel no love. Pursue this path, and one will not notice the days lengthening or things changing. Such was the way of Pengzu and Laozi—how else could they, though of the same kind as others, attain lifespans unlike others?\n\nChen Jiyuanfang said: Most illnesses and premature deaths stem from diet. The harm of diet surpasses that of sensual indulgence. Sensual pleasures may be cut off for years, but diet cannot be abandoned for a single day. Its benefits are great, yet so are its harms. Excess injures, moderation nourishes.\n\nZhang Zhan said: Those who suddenly lose wealth and status, though not struck by external evil, suffer internal spiritual injury and will surely die—not from external demonic harm, but from the inner searing of ice and fire, leading to collapse, internal damage, and vomiting blood. Those who rise to riches then fall into poverty, though not struck by external evil, will see their skin wither, sinews protrude, and limbs contract and twist. The harm of wealth and poverty to man is like that of power and status—diseases and afflictions merely wear away the body.\n\nMovement overcomes cold; stillness overcomes heat. To be capable of both movement and stillness is the way to longevity. When essence and *qi* are pure and tranquil, they merge with the Dao.\n\n*Zhuangzi* said: The true person does not dream in sleep.\n*Shenzi* said: One who has no affairs by day will not dream at night.\n\nDaoist Master Zhang, over a hundred years old, was remarkably robust. He said: The way of nurturing life lies in avoiding prolonged walking, sitting, standing, gazing, or listening; avoiding excessive eating and drinking, deep intoxication, great sorrow, or profound grief—this is what it means to achieve harmony. Those who attain harmony will surely live long.\n\n*The Scripture of Immortals* states: My life is in my hands, not in heaven’s. Yet fools do not understand this. The Dao is the essence of life; the causes of all illnesses and pathogenic winds lie in indulging desires and emotions without self-restraint, leading to depletion and harm. Like withered, rotten wood that snaps in the wind or a crumbling bank that collapses at the first touch of water, if one cannot take medicine, merely treasuring essence and moderating emotions may still grant a lifespan of one or two hundred years.\n\nZhang Zhan’s *Collected Writings on Nurturing Life* states: The great essentials of nurturing life are: first, conserve the spirit; second, cherish *qi*; third, nurture the body; fourth, practice *daoyin*; fifth, regulate speech; sixth, moderate diet; seventh, harmonize the bedchamber; eighth, counter convention; ninth, use medicine; tenth, observe prohibitions. Beyond these, further principles may be briefly noted.\n\nThe Daoist of the Green Ox said: Do not seek to please others, for those who please others do not live long. Simply avoid straining beyond one’s strength. Lifting heavy weights, drawing strong bows, digging earth, or laboring to exhaustion without rest leads to the fatigue and depletion of sinews and bones. Yet labor and toil are preferable to idleness and pleasure. From dawn to dusk, one should always be engaged in some activity, pausing only when utterly spent, then resuming after rest. This is no different from *daoyin*. Flowing water does not stagnate, and a door hinge does not rot because they are constantly in motion.\n\nAfter eating, do not sit or stand idly—walk and move to disperse the food. Otherwise, one will suffer from undigested accumulations, numbness in the limbs, facial pallor, and a shortened lifespan.\n\nHuangfu Long asked the Daoist of the Green Ox—whose surname was Feng and given name Junda—about his method of nurturing life. The general principles were: Keep the body regularly active, eat sparingly, avoid overexertion, prevent excessive depletion, reduce rich and heavy foods, limit salt and sour flavors, curb thoughts, temper joy and anger, abandon reckless pursuits, and be cautious in the bedchamber. Emperor Wu practiced this and found it effective.\n\nPengzu said: Though one may not know the methods, simply nurturing life with reason can grant a lifespan of a hundred and twenty years. Those who fall short do so through self-injury. With a slight understanding of the Dao, one may live two hundred and forty years; with the addition of medicinal aids, four hundred and eighty years.\"",
      "overlap_context": "se who regulate and protect it may reach a thousand. It is like using oil—whether on a small or large lamp. While the crowd speaks grandly, I speak softly; while the crowd is troubled, I remember little; while the crowd is violent, I do not anger. I do not burden my mind with worldly affairs or pursue official rank. Serene and effortless, my spirit and *qi* fill naturally—this is the medicine of immortality, unknown to the world. Do not say the unseen is obscure; heaven knows the hearts of men.\"",
      "start_char": 3411,
      "end_char": 4665,
      "start_sentence": 169,
      "end_sentence": 225,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.885918378829956,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养性延命录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "嵇康亦云：导养得理，上可寿千岁，下可寿百年。 彭祖曰：养寿之法，但莫伤之而已。 夫冬温夏冻，不失四时之和，所以适身也。 彭祖曰：重衣厚褥，体不劳苦，以致风寒之疾。 厚味脯腊，醉饱厌妖，以致聚结之病。 美色妖丽，嫔妾盈房，以致虚损之祸。 淫声哀音，怡心悦耳，以致荒耽之惑。 驰骋游观，弋猎原野，以致发狂之失。 谋得战胜，兼弱取乱，以致骄逸之败。 盖圣贤或失其理也。 然养生之具，譬犹水火不可失适，反为害耳。 彭祖曰：人不知道，径#14服药损伤，血气不足，肉理空疏，髓脑不实，内已先病，故为外物所犯，风寒酒色，以发之耳。 若本充实，岂有病乎！ 仙人曰：罪莫大於淫，祸莫大於贪，咎莫大於谗。 此三者，祸之车，小则危身，大则危家。 若欲延年少病者，诚勿施精命夭残，勿大温消骨髓，勿大寒伤肌肉，勿咳唾失肥液，勿卒呼惊魂魄，勿久泣神悲戚，勿患怒神不乐，勿念内志恍惚。 能行此道，可以长生。 食诫篇第二 真人曰：虽常服药物，而不知养性之术，亦难以长生也。 养性之道，不欲饱食便外及终日久坐，皆损寿也。 人欲小劳，但莫至疲及强所不能堪胜耳。 人食毕，当行步踌躇，有所修为为快也。 故流水不腐，户枢不朽蠹，以其劳动数故也。 故人不要夜食，食毕但当行中庭如数里可佳。 饱食即卧生百病，不消成积聚也。 食欲少而数，不欲顿多难消，常如饱中饥，饥中饱。 故养性者，先饥乃食，先渴而饮。 恐觉饥乃食，食必多盛； 渴乃饮，饮必过。 食毕当行，行毕使人以粉摩腹，数百过，大益也。 青牛道士言：食不欲过饱，故道士先饥而食也。 饮不欲过多，故道士先渴而饮也。 食毕行数百步，中益也。 暮食毕行五里许乃卧，令人除病。 凡食，先欲得食热食，次食温暖食，次冷食。 食热暖食讫，如无玲食者，即吃玲水一两咽，甚妙。 若能恒记，即是养性之要法也。 凡食，欲得先微吸取气，咽一两咽乃食，主无病。 真人言：热食伤骨，冷食伤藏，热物灼唇，玲物痛齿。 食讫踟局长生。 饱食勿大语。 大饮则血脉闭，大醉则神散。 春宜食辛，夏宜食酸，秋宜食苦，冬宜食咸，此皆助五藏，益血气，辟诸病。 食酸咸甜苦，即不得过分食。 春不食肝，夏不食心，秋不食肺，冬不食肾，四季不食脾，如能不食此五藏，尤顺天理。 燕不可食，入水为蛟蛇所吞，亦不宜杀之。 饱食讫即外成病背疼。 饮酒不欲多，多即吐，吐不佳。 醉外不可当风，亦不可用扇，皆损人。 白蜜勿合李子同食，伤五内。 醉不可强食，令人发瘫疽、生疮。 醉饱交接，小者令人面奸、咳嗽，不幸伤绝藏脉，损命。 凡食，欲得恒温暖，宜入易消，胜於习玲。 凡食，皆熟胜於生，少胜於多。 饱食走马成心痴。 饮水勿忽咽之，成气病及水癖。 人食酪，勿食醉，变为血痰及尿血。 食热食汗出，勿洗面，令人失颜色，面如虫行。 食热食讫，勿以醋浆漱口，令人口臭及血齿。 马汗息及马毛入食中，亦能害人。 鹦、免、犬肉，不可合食。 烂茆屋上水滴浸者脯，名日郁脯，食之损人。 久饥不得饱食，饱食成癖病。 饱食夜外失覆，多霍乱死。 时病新差，勿食生鱼，成痢不止。 食生鱼，勿食乳酪，变成虫。 食兔肉，勿食乾姜，成霍乱。",
      "translated_text": "Ji Kang also said: When guiding and nurturing life with reason, one may live a thousand years at best, or a hundred years at least.\n\nPengzu said: The method of nurturing longevity is simply to avoid harm. Winter warmth and summer coolness, maintaining harmony with the four seasons—this is how one adapts the body.\n\nPengzu said: Heavy clothing and thick bedding, leaving the body idle and untested, invite wind and cold illnesses. Rich flavors, cured meats, drunkenness, and overindulgence lead to accumulations and obstructions. Alluring beauty and a house full of concubines bring depletion and ruin. Seductive sounds and mournful music, though pleasing to the heart and ear, lead to dissipation and delusion. Galloping excursions and hunting on the plains result in reckless madness. Scheming for victory, seizing the weak, and exploiting disorder breed arrogance and idleness—these are the failings even of sages and worthies. Yet the tools of nurturing life, like fire and water, must not be misused, lest they become harmful.\n\nPengzu said: Those who do not understand the Dao may take medicines recklessly, damaging their blood and qi, leaving their flesh porous and marrow hollow. Already weakened within, they are then assailed by external influences—wind, cold, wine, and lust—bringing forth illness. If one’s foundation were full and firm, how could disease arise?\n\nAn immortal said: No sin is greater than lust, no calamity greater than greed, no fault greater than slander. These three are the chariots of misfortune: in small measure, they endanger the person; in great measure, they endanger the family. Those who wish to prolong life and minimize illness must never squander essence to the point of premature decay, never indulge in excessive warmth to the point of consuming the marrow, never endure extreme cold to the point of harming the flesh, never cough or spit to the point of losing vital fluids, never gasp suddenly to the point of startling the soul, never weep long to the point of grieving the spirit, never rage to the point of distressing the mind, never brood to the point of mental confusion. Those who can follow this Dao may attain long life.\n\n**Dietary Admonitions, Chapter Two**\n\nA Perfected One said: Though one may take medicines regularly, without knowing the art of nurturing life, it is still difficult to attain longevity. The Way of nurturing life abhors eating to fullness and then immediately exerting oneself, as well as sitting for long periods—both shorten life. One should engage in light labor, but never to the point of exhaustion or beyond one’s capacity. After eating, one should stroll leisurely, finding joy in some activity. Thus, flowing water does not stagnate, nor do door hinges rot, for they are in constant motion. Therefore, one should not eat at night. After a meal, one should walk in the courtyard as if covering several *li*—this is excellent. Eating to fullness and then lying down breeds a hundred illnesses, as undigested food accumulates. Eat little but often, avoiding large, hard-to-digest meals. Maintain a state of being neither too full nor too hungry—always as if slightly sated in hunger, slightly hungry in satiety.\n\nThus, those who nurture life eat only when truly hungry and drink only when truly thirsty. If one waits until ravenous to eat, the meal will be excessive; if one waits until parched to drink, the intake will be too great. After eating, one should walk, and after walking, have someone massage the abdomen with powder for several hundred strokes—this is greatly beneficial.\n\nThe Daoist of the Green Ox said: Do not eat to excess; thus, the Daoist eats only when hungry. Do not drink to excess; thus, the Daoist drinks only when thirsty. After eating, walk several hundred steps—this is most beneficial. After the evening meal, walk about five *li* before lying down, and illness will be dispelled.\n\nIn eating, first consume hot foods, then warm, then cold. After eating hot or warm foods, if no cold food is available, swallow one or two mouthfuls of cold water—this is most effective. If one can remember this constantly, it is a key method of nurturing life.\n\nBefore eating, lightly inhale and swallow the qi once or twice—this prevents illness.\n\nA Perfected One said: Hot food harms the bones, cold food harms the organs. Hot things scald the lips, cold things pain the teeth. After eating, pacing about promotes longevity. Do not speak loudly after a full meal. Drinking heavily blocks the blood vessels; drunkenness scatters the spirit.\n\nIn spring, eat pungent foods; in summer, sour; in autumn, bitter; in winter, salty. These all assist the five viscera, enrich the blood and qi, and ward off illness. Yet even sour, salty, sweet, and bitter foods must not be consumed to excess.\n\nDo not eat liver in spring, heart in summer, lungs in autumn, kidneys in winter, or spleen in any of the four seasons. If one can avoid these five viscera, it is especially harmonious with Heaven’s principle.\n\nSwallows must not be eaten, for they may be swallowed by dragons and serpents in water; nor should they be killed.\n\nEating to fullness and then exposing oneself to the elements causes back pain. Do not drink too much alcohol, for excess leads to vomiting, which is harmful.\n\nAfter drinking, do not stand in the wind or use a fan—both harm the person.\n\nDo not eat honey with plums, as it harms the five viscera.\n\nDo not force oneself to eat while drunk, as it may cause paralysis, abscesses, or sores.\n\nSexual intercourse while drunk and full may cause facial blemishes and coughing; in severe cases, it may rupture the visceral channels and shorten life.\n\nIn eating, it is best to keep food consistently warm, as it is easily digested—better than habitual cold food.\n\nIn all eating, cooked is better than raw, and less is better than more.\n\nEating to fullness and then riding a horse may cause mental derangement.\n\nDo not gulp water hastily, as it may cause qi disorders or water accumulation.\n\nDo not eat cheese after consuming yogurt, as it may turn to blood phlegm or bloody urine.\n\nAfter eating hot food, do not wash the face if sweating, as it causes loss of complexion and a sensation like insects crawling on the skin.\n\nAfter eating hot food, do not rinse the mouth with vinegar or fermented grain water, as it causes bad breath and bleeding gums.\n\nHorse sweat, breath, or hair entering food can also harm a person.\n\nDo not eat parrot, rabbit, or dog meat together.\n\nCured meat soaked by water dripping from a rotting thatched roof is called \"depressed cured meat\"—eating it harms the person.\n\nAfter prolonged hunger, do not eat to fullness, as it may cause accumulation disorders.\n\nEating to fullness and then exposing oneself at night without covering may cause sudden death from cholera.\n\nAfter recovering from an illness, do not eat raw fish, as it may cause unending dysentery.\n\nDo not eat dairy products after raw fish, as it may breed worms.\n\nDo not eat dried ginger after rabbit meat, as it may cause cholera.",
      "overlap_context": "d sour flavors, curb thoughts, temper joy and anger, abandon reckless pursuits, and be cautious in the bedchamber. Emperor Wu practiced this and found it effective.\n\nPengzu said: Though one may not know the methods, simply nurturing life with reason can grant a lifespan of a hundred and twenty years. Those who fall short do so through self-injury. With a slight understanding of the Dao, one may live two hundred and forty years; with the addition of medicinal aids, four hundred and eighty years.\"",
      "start_char": 4665,
      "end_char": 5898,
      "start_sentence": 226,
      "end_sentence": 292,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.70928621292114,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养性延命录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "人食肉，不用取上头最肥者，必众人先目之，食者变成结气及症疠，食皆然。 空腹勿食生果，令人膈上热，骨蒸，作瘫廊。 铜器盖食，汗出落食中，食之发疮肉疽。 触寒未解食热食，亦作刺风。 饮酒热未解，勿以玲水洗面，令人面发疮。 饱食勿沐发，沐发令人作头风。 祷麦和堵肉食，不过三顿成热风。 乾脯勿置林米饶中，食之闭气。 乾脯火烧不动，出火始动，擘之筋缕相交者，食之患人或杀人。 羊胛中有肉如珠子者，名羊悬筋，食之患癫病。 诸湿食不见形影者，食之成症，腹胀。 暴疾后不周饮酒，膈上变热。 新病差不用食生枣、羊肉、生菜，损颜色，终身不复，多致死，膈上热蒸。 凡食热脂饼物，不用饮玲醋、浆水，善失声若咽。 生葱白合蜜食，害人。 切忌乾脯得水自动，杀人。 曝肉作脯，不肯燥勿食。 羊肝，勿合椒食，伤人心。 胡瓜合羊肉食之发热。 多酒食肉，名日痴脂，忧狂无但。 食良药、五谷充悦者，名日中士，犹虑疾苦。 食气，保精存神，名日上士，与天同年。 杂诚忌禳害祈善篇第三 久视伤血，久外伤气，久立伤骨，久行伤筋，久坐伤肉凡远思强健伤人，忧志悲哀伤人，喜乐过差伤人，忿怒不解伤人，汲汲所愿伤人，戚戚所患伤人，寒热失节伤人，阴阳不交伤人。 凡交须依导引诸术。 若能避众伤之事而复阴阳之术，则是不死之道。 大乐气飞扬，大愁气不通。 用精令人气力乏，多视令人目盲，多睡令人心烦，贪美食令人泄痢。 俗人但知贪於五味，不知元气可饮。 圣人知五味之生病#15 ，故不贪，知元气可服，故闭口不言，精气自应也。 唾不咽则海#16 不润，海不润则津液乏，是知服元气，饮醴泉，乃延年之本也。 沐浴无常不吉。 夫妇同沐浴不吉，新沐浴及醉饱，远行归还，大疲倦，并不可行房室之事，生病，切慎之。 丈夫勿头北外，令人六神不安，多愁忘。 勿歧井，今古大忌。 若见十步地墙，勿顺墙坐外，被风吹，发癫痒疾。 勿怒目久视日月，失目明。 凡大汗忽脱衣，不慎多患偏风，半身不遂。 新沐浴了，不得露头当风，不幸得大风刺风疾。 触寒来，勿临面火上，成瘠，起风眩。 凡汗，勿跤状悬脚，久成血痹，足重，腰疼。 凡脚汗，勿入水，作骨痹，亦作遁痉。 久忍小便，膝玲兼成玲痹。 凡食热物汗出，勿荡风，发症头痛，令人目涩，饶睡。 凡欲眠，勿歌咏，不祥。 起眠讫，勿大语，损人气。 凡飞乌投人，不可食焉，若开口及毛下有疮，并不可食之。 凡热治洗头，玲水濯，成头风。 凡人外，头边勿安火炉，令人头重、目赤、鼻乾。 凡外讫，头边勿安灯，令人六神不安。 冬日温足冻脑，春秋脑足俱冻，此乃圣人之常法也。 凡新哭泣讫便食，即成气病。 夜外勿覆头，妇人勿歧鳌坐，大忌。 凡若唾不用远，远即成肺病，令人手重、背疼、咳嗽。 凡人魇，勿点灯照，定魇死，暗唤之即吉，亦不可近前及急唤。 凡人卧勿开口，久成消渴，并失血色。 凡旦起勿以玲水开目洗面，令人目涩，失明，饶汨。 凡行途中触热，逢河勿洗面，生乌奸。 人睡讫忽觉，勿饮水更卧，成水痹。 凡时病新汗解，勿饮玲水，损人心腹，不平复。 凡空腹不可见闻臭尸，气入鼻令人成病。 凡欲见死尸，皆须先饮酒及咬蒜辟毒气。",
      "translated_text": "When eating meat, do not select the fattiest portion from the top, for if many have already gazed upon it, the eater may develop *qi* stagnation or *zheng* and *li* disorders—this applies to all foods.\n\nDo not eat raw fruit on an empty stomach, as it causes heat above the diaphragm, consumptive fever, and paralysis.\n\nCovering food with copper vessels causes condensation to drip into the food, and eating it leads to sores and deep abscesses.\n\nEating hot food while still chilled from cold exposure may cause piercing wind.\n\nDo not wash your face with cold water while still heated from drinking alcohol, as it causes facial sores.\n\nDo not wash your hair after eating to fullness, as it leads to head wind.\n\nEating barley with pork for more than three meals generates heat wind.\n\nDo not store dried cured meat among glutinous rice, as eating it obstructs the *qi*.\n\nIf dried cured meat does not move when burned over fire but only stirs after being removed, and upon tearing it reveals intertwined sinews, eating it harms or even kills the person.\n\nIf a sheep’s shoulder blade contains flesh resembling pearls, called \"suspended sinew,\" eating it causes epilepsy.\n\nEating any damp food that does not cast a reflection causes *zheng* disorders and abdominal distension.\n\nAfter sudden illness, drinking alcohol without restraint generates heat above the diaphragm.\n\nAfter recovering from illness, do not eat raw jujubes, mutton, or raw vegetables, as it damages the complexion permanently, often leading to death, and causes steaming heat above the diaphragm.\n\nAfter eating hot, greasy pastries, do not drink cold vinegar or fermented grain water, as it may cause loss of voice or throat obstruction.\n\nEating raw scallions with honey harms the person.\n\nBeware of dried cured meat that moves on its own when exposed to water—it kills.\n\nDo not eat jerky that refuses to dry when sun-cured.\n\nDo not eat sheep’s liver with Sichuan pepper, as it harms the heart.\n\nEating cucumber with mutton generates heat.\n\nExcessive drinking and meat consumption, called \"fat stupidity,\" leads to madness and recklessness.\n\nThose who nourish themselves with good medicine and the five grains are called \"middling scholars,\" yet they still suffer illnesses.\n\nThose who consume *qi*, preserve essence, and cultivate spirit are called \"superior scholars,\" attaining longevity equal to heaven.\n\n**Miscellaneous Admonitions on Avoiding Harm and Seeking Goodness**\n\nProlonged gazing injures the blood, prolonged exposure injures the *qi*, prolonged standing injures the bones, prolonged walking injures the sinews, and prolonged sitting injures the flesh. Excessive longing or ambition harms a person, as do sorrow, grief, excessive joy, unresolved anger, relentless desires, and constant worries. Cold and heat imbalances harm a person, as does the failure to harmonize yin and yang.\n\nAll intercourse must follow the methods of *daoyin*. If one avoids these harmful practices and masters the arts of yin and yang, this is the Way of immortality.\n\nGreat joy makes the *qi* soar, while great sorrow blocks it.\n\nExcessive ejaculation depletes a person’s strength, excessive gazing blinds the eyes, excessive sleep disturbs the heart, and overindulgence in rich food causes diarrhea.\n\nOrdinary people only know to crave the five flavors, unaware that primordial *qi* can be consumed. Sages, knowing the five flavors cause illness, do not indulge in them, and understanding primordial *qi* can be ingested, remain silent to preserve essence, allowing *qi* to respond naturally.\n\nIf saliva is not swallowed, the sea of *qi* dries; if the sea dries, bodily fluids are depleted. Thus, consuming primordial *qi* and drinking from the sweet spring is the foundation of longevity.\n\nIrregular bathing is inauspicious. Bathing together as husband and wife is inauspicious. After bathing, or when drunk or full, returning from a long journey, or exhausted, one must not engage in bedroom affairs—doing so causes illness; be vigilant.\n\nDo not sleep with your head facing north, as it disturbs the six spirits, causing sorrow and forgetfulness.\n\nDo not straddle wells—this has been a major taboo since ancient times.\n\nIf you see a low wall within ten paces, do not sit with your back to it, lest the wind blow and cause epilepsy or itching.\n\nDo not stare at the sun or moon for long, as it impairs vision.\n\nAfter sweating heavily, do not suddenly remove clothes, as carelessness often leads to partial wind and hemiplegia.\n\nAfter bathing, do not expose your head to wind, or you may contract severe wind or piercing wind.\n\nAfter exposure to cold, do not warm your face over a fire, as it causes emaciation and wind dizziness.\n\nAfter sweating, do not sit with legs dangling for long, as it leads to blood impediment, heavy feet, and lumbar pain.\n\nDo not enter water with sweaty feet, as it causes bone impediment or hidden spasms.\n\nHolding urine for too long causes cold knees and cold impediment.\n\nAfter eating hot food and sweating, do not expose yourself to wind, as it causes *zheng* disorders, headaches, dry eyes, and excessive sleepiness.\n\nBefore sleeping, do not sing or chant, as it is inauspicious.\n\nUpon waking, do not speak loudly, as it harms the *qi*.\n\nIf a bird flies into you, do not eat it; if it has an open mouth or sores under its feathers, do not eat it either.\n\nWashing your head with hot water and rinsing with cold causes head wind.\n\nDo not place a fire stove beside your head while sleeping, as it makes the head heavy, the eyes red, and the nose dry.\n\nDo not place a lamp beside your head after sleeping, as it disturbs the six spirits.\n\nIn winter, keep the feet warm and the head cool; in spring and autumn, keep both head and feet cool—this is the sage’s constant method.\n\nEating immediately after crying leads to *qi* disorders.\n\nDo not cover your head while sleeping outdoors. Women must not sit with legs splayed—this is a major taboo.\n\nDo not spit too far, as it causes lung disease, making the hands heavy, the back sore, and inducing coughing.\n\nIf someone is having a nightmare, do not shine a light on them, as it may cause death; calling them in the dark brings good fortune, but do not approach or wake them abruptly.\n\nDo not sleep with your mouth open for long, as it leads to wasting-thirst and loss of complexion.\n\nUpon waking, do not wash your face with cold water, as it causes dry eyes, blindness, and excessive tearing.\n\nWhen traveling in the heat, do not wash your face upon encountering a river, as it causes dark moles.\n\nAfter waking suddenly from sleep, do not drink water and lie down again, as it causes water impediment.\n\nAfter sweating from an illness, do not drink cold water, as it harms the heart and abdomen, preventing recovery.\n\nDo not see or smell a decaying corpse on an empty stomach, as the *qi* enters the nose and causes illness.\n\nBefore viewing a corpse, drink wine and chew garlic to ward off toxic *qi*.",
      "overlap_context": " thatched roof is called \"depressed cured meat\"—eating it harms the person.\n\nAfter prolonged hunger, do not eat to fullness, as it may cause accumulation disorders.\n\nEating to fullness and then exposing oneself at night without covering may cause sudden death from cholera.\n\nAfter recovering from an illness, do not eat raw fish, as it may cause unending dysentery.\n\nDo not eat dairy products after raw fish, as it may breed worms.\n\nDo not eat dried ginger after rabbit meat, as it may cause cholera.",
      "start_char": 5898,
      "end_char": 7121,
      "start_sentence": 293,
      "end_sentence": 354,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 69.29328346252441,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养性延命录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "凡小兄不用令指月，两耳后生疮欲#17 断，名月蚀疮，捣虾蟆末傅即差，并别余疮并不生。 凡产妇不可见狐臭人，能令产妇着肿。 凡人外不用於窗裤下，令人六神不安。 凡卧，春夏欲得头向束，秋冬头向西，有所利益。 凡丈夫饥欲得坐小便，饱则立小便，令人无病。 凡人睡，欲得屈膝侧外，益人气力。 凡卧欲得数转侧，微语笑，欲令至少语，莫令声高大。 春欲得暝卧早起，夏秋欲得侵夜卧早起，冬欲得早卧晏起，皆有所益。 虽云早起莫在鹦呜前，晏起莫在日出后。 冬日天地闭，阳气藏，人不欲劳作汗出，发泄阳气，损人。 新沐欲讫，勿当风结髻#18 ，勿以湿头卧，使人患头风，眩闷，发颓，面肿，齿痛，耳聋。 湿衣及汗衣，皆不可久着，令发疮及患风疡痒。 老君曰：正月旦中庭向寅地，再拜咒曰：某甲年年受大道之恩，太清玄门愿还某甲去岁之年。 男女皆三通自咒。 常行此道，延年。 玄女有清神之法，淮南崇祠宠之规，咸欲体合真灵，护卫真生者。 仙经秘要，常存念心中有气大如鹦子，内赤外黄，辟众邪延年也。 欲却众邪百鬼，常存念为炎火如斗，煌煌光明，则百邪不敢干人，可入瘟疫之中。 暮卧，常存作赤气在外，白气在内，以覆身，辟众邪鬼魅。 老君曰：凡人求道，勿犯五逆六不祥，有犯者凶。 大小便向西一逆，向北二逆，向日三逆，向月四逆，仰视天及星辰五逆。 夜起保形一不祥，日一起慎志．二不祥，向宠骂晋三不祥，以足内火四不祥，夫妻昼合五不祥，盗患师父六不祥。 凡人旦起恒言善事，天与之福，勿言奈何歌啸，名曰请祸。 慎勿上林外歌凶，始外伏肺凶，饮食伏状凶，以匙筋击盘上凶。 司阴之神在人口左，人有阴祸，司阴白之於天，天则考人魂魄。 司杀之神在人口右，人有恶言，司杀白之於司命，司命记之，罪满即杀。 二神监口，唯向人求非，安可不慎言？ 舌者身之兵，善恶由之而生，故道家所忌。 食玉泉者，令人延年，除百病。 玉泉者，口中唾也。 鹦呜、平旦、日中、日哺、黄昏、夜半时，一日一夕，凡七漱玉泉食之，每食辄满口咽之，延年。 发，血之穷。 齿，骨之穷。",
      "translated_text": "For young children, do not let them point at the moon, lest sores form behind both ears that threaten to sever them—these are called \"moon-eclipse sores.\" Pound toad into powder and apply it, and they will heal; moreover, no other sores will arise.\n\nPregnant women must not be near those with fox-like odor, as it causes swelling in the mother.\n\nDo not urinate outdoors beneath the eaves, as it disturbs the six spirits and brings unease.\n\nWhen sleeping, in spring and summer keep the head toward the east, in autumn and winter toward the west—this brings benefit.\n\nWhen a man is hungry, he should urinate sitting; when full, standing—this keeps him free from illness.\n\nWhen sleeping, curl the knees and lie on the side to strengthen one’s *qi* and vitality.\n\nWhen lying down, turn frequently and speak softly with gentle laughter; speak as little as possible, and never raise the voice.\n\nIn spring, sleep early and rise early; in summer and autumn, retire late and rise early; in winter, sleep early and rise late—all bring benefit.\n\nThough one should rise early, do not do so before the crow of the rooster; though one may rise late, do not do so after sunrise.\n\nIn winter, Heaven and Earth are closed, and yang *qi* is stored. Do not labor to the point of sweating, lest yang *qi* be dispersed and harm the person.\n\nAfter washing the hair, do not tie it up in the wind, nor lie down with a wet head, as this causes head-wind, dizziness, stupor, hair loss, facial swelling, toothache, and deafness.\n\nDo not wear damp or sweaty clothes for long, as this breeds sores and wind-itching ulcers.\n\nLord Lao said: On the first day of the first month, stand in the courtyard facing the *yin* direction, bow twice, and recite: \"So-and-so year upon year receives the grace of the Great Dao. By the Mysterious Gate of the Grand Clarity, I pray to repay the debts of the past year.\" Men and women should each recite this three times. Practicing this Way regularly prolongs life.\n\nThe Mysterious Woman has a method for purifying the spirit; Huainan reveres the rites of divine favor—all seek to embody the true numinous and protect the true life. The esoteric essentials of the immortals’ scriptures teach that one should constantly visualize in the heart a *qi* as large as a goose egg, crimson within and yellow without, to ward off all evil and extend life.\n\nTo repel all evil and malevolent spirits, constantly visualize a raging fire as large as a bushel, blazing with brilliant light—then no evil will dare approach, and one may enter even plague-ridden places.\n\nBefore sleeping at night, always visualize red *qi* on the outside and white *qi* on the inside, covering the body to repel all evil spirits and demons.\n\nLord Lao said: Those who seek the Dao must not commit the five rebellions or six inauspicious acts; those who do will meet with misfortune.\nUrinating or defecating toward the west is the first rebellion; toward the north, the second; toward the sun, the third; toward the moon, the fourth; and gazing upward at the sky or stars, the fifth.\n\nRising at night without protecting the body is the first inauspicious act; rising at dawn without guarding the will, the second; cursing or reviling the honored, the third; using the foot to stir fire, the fourth; coupling with a spouse in daylight, the fifth; and stealing from or harming one’s teacher, the sixth.\n\nWhen rising in the morning, always speak of good things, and Heaven will grant you fortune. Do not sigh or sing idly, for this is called \"inviting calamity.\"\n\nBeware of singing outside the grove, for it invites misfortune; of prostrating outside the gate, for it invites lung afflictions; of discussing food and drink while lying down, for it invites illness; and of striking plates with chopsticks, for it invites misfortune.\n\nThe spirit that governs the hidden resides to the left of the mouth; if one harbors secret misfortune, this spirit reports it to Heaven, and Heaven then examines one’s soul and spirit.\n\nThe spirit that governs killing resides to the right of the mouth; if one speaks evil words, this spirit reports it to the Controller of Fate, who records it. When the sins are full, one is put to death.\n\nThese two spirits monitor the mouth—how can one not be cautious in speech when seeking nothing but fault in others?\n\nThe tongue is the soldier of the body, and good and evil arise from it—thus it is what Daoists most guard against.\n\nConsuming jade spring prolongs life and eliminates the hundred diseases. Jade spring is the saliva in the mouth. At the crow of the rooster, dawn, noon, dusk, twilight, and midnight—seven times in a day and night—rinse the mouth with jade spring and swallow it. Each time, fill the mouth and swallow, and it will extend life.\n\nHair is the culmination of blood; teeth, the culmination of bone.",
      "overlap_context": "traveling in the heat, do not wash your face upon encountering a river, as it causes dark moles.\n\nAfter waking suddenly from sleep, do not drink water and lie down again, as it causes water impediment.\n\nAfter sweating from an illness, do not drink cold water, as it harms the heart and abdomen, preventing recovery.\n\nDo not see or smell a decaying corpse on an empty stomach, as the *qi* enters the nose and causes illness.\n\nBefore viewing a corpse, drink wine and chew garlic to ward off toxic *qi*.",
      "start_char": 7121,
      "end_char": 7936,
      "start_sentence": 355,
      "end_sentence": 387,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.927226305007935,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养性延命录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "爪，筋之穷。 千过梳发发不白，朝夕啄齿齿不齲，爪不数截筋不替。 人常数欲照镜，谓之存形，形与神相存，此其意也。 若矜容颜色自爱饭，不如勿照。 凡人常以正月一日、二月二日、三月三日、四月八日、五月日、六月二十七日、七月十一日、八月八日、九月二十一日、十月十四日、十一月十一日、十二月三十日，但常以此日取枸杞菜，煮作汤沐浴，令人光泽，不病，不老。 月蚀宜救，活人除殃。 活万人与天同功。 天不好杀，圣人则之。 不好杀者，是助天地长养，故招胜福。 善梦可说，恶梦默之，则养性延年也。 养性延命录卷上竟 #1极：《云笈七让》作『涯』。 #2志：四库本《云笈七签》作『气』。 #3计：《云笈七签》作『指』。 #4夭：原作r天」，据《云笈七签》改。 #5刺：《云笈七签》作『辣』。 #6性：《云笈七签》『性』下有『之事』一字。 #7能：《云笈七签》、《素问》一能」下并有『形字』。 #8不修仕禄之业：《云笈七签》作『不修君臣之义』。 #9贼：《云笈七签》作『正』。 #10贬：《云笈七笔》作『乏』。 #11肉理：《云笈七签》作『内里』。 #12蛊：《云笈七镶》作『众』。 #13其养性法则可施用：《云笈七签》此句为注文。 #14径：《云笈七签》作『经』。 #15生病：《云笈七签》作『毒焉』。 #16海：《云笈七签》作『气海』。 下同。 #17欲：原作『是』，据《云笈七签》改。 ． #18结髻：原作『湿语』，据《云笈七签》改。 养性延命录卷下 华阳陶隐居集",
      "translated_text": "Nails are the culmination of sinews. Combing the hair a thousand times prevents it from turning white; tapping the teeth morning and evening prevents decay; trimming the nails frequently prevents the sinews from weakening.\n\nOne should often look in the mirror, which is called \"preserving the form.\" Form and spirit preserve each other—this is its meaning. If one merely admires one’s appearance and cherishes vanity, it is better not to look at all.\n\nOn the following days— the first day of the first month, the second day of the second month, the third day of the third month, the eighth day of the fourth month, the fifth day of the fifth month, the twenty-seventh day of the sixth month, the eleventh day of the seventh month, the eighth day of the eighth month, the twenty-first day of the ninth month, the fourteenth day of the tenth month, the eleventh day of the eleventh month, and the thirtieth day of the twelfth month—one should gather wolfberry leaves, boil them into a decoction, and bathe in it. This will make the skin lustrous, prevent illness, and delay aging.\n\nDuring a lunar eclipse, one should perform rescue rites to save lives and avert misfortune. Saving ten thousand lives is equal in merit to Heaven’s work. Heaven does not delight in killing; the sages emulate this. Those who do not delight in killing assist Heaven and Earth in nurturing life, thus attracting abundant fortune.\n\nGood dreams may be spoken of; bad dreams should be kept silent—this nurtures one’s nature and prolongs life.\n\n*Record of Nurturing Nature and Prolonging Life, Volume One (conclusion)*\n\n*Record of Nurturing Nature and Prolonging Life, Volume Two*\n*Compiled by Tao Hongjing of Huayang*",
      "overlap_context": "ue is the soldier of the body, and good and evil arise from it—thus it is what Daoists most guard against.\n\nConsuming jade spring prolongs life and eliminates the hundred diseases. Jade spring is the saliva in the mouth. At the crow of the rooster, dawn, noon, dusk, twilight, and midnight—seven times in a day and night—rinse the mouth with jade spring and swallow it. Each time, fill the mouth and swallow, and it will extend life.\n\nHair is the culmination of blood; teeth, the culmination of bone.",
      "start_char": 7936,
      "end_char": 8591,
      "start_sentence": 388,
      "end_sentence": 420,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.598901033401489,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养性延命录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "服气疗病篇第四 《元阳经》曰：常以鼻纳气，含而漱满，舌料唇齿咽之，一日一夜得千咽甚佳。 当少饮食，饮食多则气逆，百脉闭，百脉闭则气不行，气不行则生病。 《玄示》曰：志者，气之帅也。 气者，体之充也。 善者遂其生，恶者丧其形。 故行气之法，少食自节，动其形，和其气血，因轻而止之，勿过失，突复而还之，其状若咽，正体端形，心意专一，固守中外，上下俱闭，神周形骸调畅，四溢修守，关元满而足实，因之而众邪自出。 彭祖曰：常闭气纳息，从平旦至日中，乃跪坐拭目，摩摄身体，舐唇咽唾，服气数十，乃起行言笑。 其偶有疲倦不安，便导引闭气，以攻所患，必存其身，头面九窍，五藏四肢，至於发端，皆令所在。 觉其气云行体中，起於鼻口，下达十指末，则澄和真神，不须针药灸刺。 凡行气欲除百病，随所在作念之。 头痛念头，足痛念足，和气往攻之，从时至时，便自消矣。 时气中冷，可闭气以取汗，汗出辄周身则解矣。 行气闭气，虽是治身之要，然当先达解其理，又宜空虚不可饱满。 若气有结滞，不得空流，或致发疮，譬如泉源不可壅遏。 若食生鱼、生菜、肥肉，及喜怒忧患不除而以行气，令人发上气。 凡欲学行气，皆当以渐。 刘君安曰：食生吐死，可以长存，谓鼻纳气为生，口吐气为死也。 凡人不能服气，从朝至暮，常习不息，徐而舒之，常令鼻纳口吐，所谓吐故纳新也。 《服气经》曰：道者，气也。 保气则得道，得道则长存。 神者，精也。 保精则神明，神明则长生。 精者，血脉之川流，守骨之灵神也。 精去则骨枯，骨枯则死矣。 是以为道，务宝其精，从夜半至日中为生气，从日中后至夜半为死气，常以生气时正僵#1卧，瞑目握固，握固者，如婴儿之拳手，以四指押拇指也。 闭气不息，於心中数至二百，乃口吐气出之，日增息。 如此身神具，五藏安，能闭气至二百五十，华盖明，华盖，眉也。 耳目聪明，举身无病，邪不干人也。 凡行气，以鼻纳气，以口吐气，微而引之，名日长息。 纳气有一，吐气有六。 纳气一者谓吸也。 吐气有六者，谓吹、呼、唏、呵、嘘、咽，皆出气也。 凡人之息，一呼一吸，元有此数。 欲为长息吐气之法，时寒可吹，时温可呼。 委曲治病，吹以去风，呼以去热，唏以去烦，呵以下气，嘘以散滞，咽以解极。 凡人极者，则多嘘咽。 道家行气，率不欲嘘咽。 嘘咽者，长息之心也，此男女俱存法，法出於《仙经》。 行气者，先除鼻中毛，所谓通神之路。 若天露恶风、猛寒大热时，勿取气。 《明医论》云：疾之所起，自生五劳，五劳既用，二藏先损，心肾受邪，府藏俱病。 五劳者，一日志劳，二曰思劳，三曰心劳，四日忧劳，五日疲劳。 五劳则生六极，一日气极，二日血极，三日筋极，四日骨极，五曰精极，六曰髓极。 六极即为七伤，七伤故变为七痛，七痛为病，令人邪气多，正气少，忽忽喜忘，悲伤不乐，饮食不生，肌肤颜色无泽，发白枯槁。 甚者令人得大风偏枯，筋缩，四肢拘急，挛缩，百关隔塞，赢瘦短气，腰脚疼痛，此由早娶用精过差，血气不足，极劳之所致也。 凡病之来，不离於五藏，事＇须识根，不识者勿为之耳。 心藏病者，体有冷热，呼吹二气出之。",
      "translated_text": "**Chapter Four: Qi Ingestion for Healing Illness**\n\nThe *Yuanyang Jing* states: Regularly inhale qi through the nose, hold it in the mouth, swish it until full, then use the tongue to guide it past the lips and teeth before swallowing. Achieving a thousand swallows in a day and night is most excellent. One should eat sparingly, for excessive food causes qi to rebel, blocking the hundred vessels. When the vessels are blocked, qi cannot flow, and illness arises.\n\nThe *Xuanshi* states: Will is the commander of qi; qi is the filling of the body. Those who act with virtue preserve their life; those who act with vice lose their form. Thus, the method of circulating qi requires moderation in diet, movement of the body, and harmonization of qi and blood. Proceed lightly and cease before overdoing; do not lose control. If qi surges abruptly, restore it gently. The posture resembles swallowing: hold the body upright, focus the mind, and firmly guard the inner and outer. Close the upper and lower passages, allowing spirit to permeate the limbs and bones, regulating and smoothing them. With disciplined cultivation, the *guanyuan* fills and the feet grow firm, and all pathogenic influences depart naturally.\n\nPeng Zu said: Regularly hold the breath and inhale, from dawn until noon. Then kneel and sit, wipe the eyes, massage the body, lick the lips, swallow saliva, and ingest qi dozens of times before rising to walk, speak, or laugh. If fatigue or discomfort arises, perform *daoyin* and hold the breath to attack the affliction. One must visualize the body—head, face, nine orifices, five viscera, four limbs, even the tips of the hair—directing qi to each part. When the qi feels like clouds moving through the body, rising from the nose and mouth and reaching the fingertips, the true spirit becomes clear and harmonious. No needles, medicines, moxibustion, or acupuncture are needed.\n\nTo cure all illnesses through qi circulation, focus the mind on the affected area. For headaches, direct the mind to the head; for foot pain, direct it to the feet. Harmonize the qi to attack the ailment, and it will dissipate over time. If struck by cold from seasonal qi, hold the breath to induce sweating; when sweat covers the body, the illness will resolve.\n\nThough holding and circulating qi is essential for healing, one must first understand its principles and practice on an empty stomach, not when full. If qi becomes stagnant and fails to flow freely, it may cause sores—like a spring that must not be dammed. Consuming raw fish, raw vegetables, fatty meats, or failing to dispel anger, sorrow, and worry before circulating qi may cause counterflow of qi.\n\nThose learning qi circulation should proceed gradually.\n\nLiu Jun’an said: Ingesting the living and expelling the dead ensures longevity—this means inhaling through the nose is \"living\" and exhaling through the mouth is \"dead.\" Those who cannot ingest qi should practice from morning to night without ceasing, slowly and gently inhaling through the nose and exhaling through the mouth—this is called \"expelling the old and taking in the new.\"\n\nThe *Qi Ingestion Classic* states: The Dao is qi. Preserving qi is attaining the Dao; attaining the Dao is enduring existence. Spirit is essence. Preserving essence brings spiritual clarity; spiritual clarity brings longevity. Essence is the flowing river of blood and vessels, the numinous spirit guarding the bones. When essence departs, the bones wither, and death follows. Thus, in cultivating the Dao, one must treasure essence.\n\nFrom midnight to noon is the time of living qi; from noon to midnight is the time of dead qi. During the living qi period, lie flat on your back, close your eyes, and clench your fists as an infant does—pressing the thumb with the four fingers. Hold the breath without exhaling, counting to two hundred in the mind before releasing the breath through the mouth. Increase the count daily. In this way, body and spirit unite, the five viscera are at peace, and one can hold the breath to two hundred fifty. The \"flower canopy\" (the brows) brightens, ears and eyes grow sharp, the whole body remains free of illness, and no evil can assail one.\n\nIn circulating qi, inhale through the nose and exhale through the mouth, drawing it gently—this is called \"long breathing.\" There is one way to inhale and six ways to exhale. Inhalation is simply drawing in breath. The six exhalations are *chui* (blowing), *hu* (breathing), *xi* (sighing), *he* (exhaling), *xu* (hissing), and *si* (swallowing)—all methods of expelling qi.\n\nHuman breathing naturally follows this pattern. For long-breathing exhalation techniques, use *chui* in cold times and *hu* in warm times. To treat illnesses precisely: *chui* dispels wind, *hu* dispels heat, *xi* dispels vexation, *he* descends qi, *xu* disperses stagnation, and *si* relieves exhaustion. When people are exhausted, they often sigh (*xu* and *si*). Daoists practicing qi circulation generally avoid *xu* and *si*, for these are signs of long-breathing fatigue. This method is preserved for both men and women, originating from the *Immortal Classic*.\n\nBefore circulating qi, remove the hairs from the nose—this is the path to communion with the spirit. Do not draw qi during heavy dew, harsh winds, extreme cold, or intense heat.\n\nThe *Mingyi Lun* states: The origin of illness lies in the five labors. Once the five labors are exerted, the two viscera are first damaged—heart and kidneys receive evil, and all organs and bowels fall ill.\n\nThe five labors are:\n1. Will labor,\n2. Thought labor,\n3. Heart labor,\n4. Worry labor,\n5. Fatigue labor.\n\nThe five labors give rise to the six extremes:\n1. Qi extreme,\n2. Blood extreme,\n3. Sinew extreme,\n4. Bone extreme,\n5. Essence extreme,\n6. Marrow extreme.\n\nThe six extremes become the seven injuries, which transform into the seven pains. The seven pains cause illness, leading to an excess of pathogenic qi and a deficiency of upright qi. One becomes absent-minded, forgetful, sorrowful, and joyless. Food no longer nourishes, the skin loses its luster, and the hair turns white and withers. In severe cases, one may suffer from great wind, hemiplegia, sinew contraction, limb spasms, joint blockages, emaciation, shortness of breath, and pain in the waist and legs—all caused by early marriage, excessive expenditure of essence, insufficient blood and qi, and extreme exhaustion.\n\nIllness arises from the five viscera; one must identify its root. Those who do not understand should not attempt treatment.\n\nFor heart-viscera illness, where the body experiences cold and heat, use the *hu* and *chui* exhalations to expel it.",
      "overlap_context": " lives is equal in merit to Heaven’s work. Heaven does not delight in killing; the sages emulate this. Those who do not delight in killing assist Heaven and Earth in nurturing life, thus attracting abundant fortune.\n\nGood dreams may be spoken of; bad dreams should be kept silent—this nurtures one’s nature and prolongs life.\n\n*Record of Nurturing Nature and Prolonging Life, Volume One (conclusion)*\n\n*Record of Nurturing Nature and Prolonging Life, Volume Two*\n*Compiled by Tao Hongjing of Huayang*",
      "start_char": 8591,
      "end_char": 9827,
      "start_sentence": 421,
      "end_sentence": 468,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.91885423660278,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养性延命录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "肺藏病者，胸背胀满，嘘气出之。 脾藏病者，体上游风，习习身痒、疼问，唏气出之。 肝藏病者，眼疼，愁忧不乐，呵气出之。 已上十二种调气法，依常以鼻引气，口中吐气，当令气声逐字吹、呼、嘘、呵、唏、咽吐之。 若患者依此法，皆须恭敬用心为之，无有不差愈病，长生要术。 导引按摩篇第五 《导引经》云：清旦未起，先啄齿二七，闭目握固，漱满唾，三咽气，寻闭不息自极，极乃徐徐出气，满三止； 便起狼踞鸦顾，左右自摇，亦不息自极，复三； 便起下林，握固不息，顿踵三还，上一手，下一手，亦不息自极三； 又叉手项上，左右自了捩，　　不息复三； 又伸两足及叉手前却，自极复三。 皆当朝暮为之，能数尤善。 平旦以两手掌相摩令热，熨眼三过，次又以指搔#2目四毗，令人目明。 按经文拘魂门，制魄户，名日握固，与魂魄安门户也。 此固精明目留年还白之法，若能终日握之，邪气百毒不得入。 握固法：屈大拇指於四小指下，把之。 积习不止，眼中亦不复开。 一说云：令人不遭魔魅。 《内解》云：一曰精，二曰唾，三曰汨，四曰涕，五曰汗，六曰溺，皆所以损人也。 但为损者，有轻重耳。 人能终日不涕唾，随有漱满咽之。 若恒含枣核咽之，令人爱气生津液，此大要也。 谓取津液，非咽核也。 常每旦啄齿三十六通，能至三百弥佳，令人齿坚不痛。 次则以舌搅漱口中津液，满口咽之，三过止。 次摩指少阳令热，以熨目，满二七止，令人目明。 每旦初起，以两手叉两耳极上下，热授之二七止，令人耳不聋。 次又啄齿漱玉泉三咽，缩鼻闭气，右手从头上引左耳二七，复以左手从头上引右耳二七止，令人延年不聋。 次又引两鬓发举之一七，则总取发，两手向上，极势台上一七，令人血气通，头不白。 又法，摩手令热，以摩面从上至下，去邪气，令人面上有光彩。 又法，摩手令热，雷摩身体，从上至下，名曰乾浴，令人胜风寒，时气热，头痛，百病皆除。 夜欲外时，常以两手揩摩身体，名曰乾浴，辟风邪。 峻坐，以左手托头，仰右手，向头上尽势托，以身并手，振动三，右手托头，振动亦三，除人睡闷。 平旦日未出前，面向南峻坐，两手托陛，尽势振动三，令人面有光泽。 平旦起未梳洗前，峻坐，以左手握右手於左陛上，前却尽势授左陛三。 又以右手握左手於右陛上，前却授右陛亦三。 次又叉两手向前，尽势推三次，叉两手向胸前，以两肘向前，尽势三次，直引左臂，拳曲右臂，如挽一斛五斗弓势，尽力为之，右手挽弓势亦然。 次以右手托地，左手仰托天尽势，右亦如然。 次拳两手向前筑，各三七。 次拳左手尽势，向背上握指三，右手亦如之。 疗背膊臂肘劳气，数为之弥佳。 平旦便转讫，以一长柱杖策腋，垂左脚於林前，徐峻，尽势掣左脚五七，右亦如之。 疗脚气，疼闷，腰肾问冷气，冷痹及膝冷脚冷，并主之。 日夕三掣弥佳。 勿大饱及忍小便。",
      "translated_text": "For lung-viscera illness, where the chest and back feel distended and full, use the *xu* exhalation to expel it. For spleen-viscera illness, where the body experiences wandering wind, persistent itching, and pain, use the *xi* exhalation to expel it. For liver-viscera illness, where the eyes ache and one feels sorrowful and joyless, use the *he* exhalation to expel it.\n\nThe twelve methods of regulating qi above all require drawing qi in through the nose and expelling it through the mouth, ensuring the sound of the breath follows the specific exhalations: *chui*, *hu*, *xu*, *he*, *xi*, and *yan*. If the afflicted practice these methods with reverence and focus, there will be no illness that is not cured—this is the essential art of longevity.\n\n**Chapter Five: Daoist Exercises and Massage**\n\nThe *Daoist Exercises Classic* states: At dawn before rising, first click the teeth thirty-four times, close the eyes, clench the fists, swish the mouth full of saliva, and swallow it three times. Then hold the breath to the utmost limit, and only after reaching the limit exhale slowly. Repeat this three times. Next, rise and assume the posture of a crouching wolf or a craning crow, shaking the body left and right without holding the breath, again to the utmost limit, three times. Then rise and descend to the grove, clench the fists without holding the breath, stamp the heels three times, raise one hand while lowering the other, again without holding the breath, to the utmost limit three times. Next, clasp the hands behind the neck and twist the body left and right, without holding the breath, three more times. Then stretch both legs and clasp the hands, leaning forward and backward, to the utmost limit three times. All these should be practiced morning and evening; frequent practice is especially beneficial.\n\nAt dawn, rub the palms together until hot and press them over the eyes three times. Then, with the fingers, scratch the four corners of the eyes to brighten the vision. According to the classic, securing the Gate of the Hun and controlling the Door of the Po is called \"clenching the fists,\" which stabilizes the hun and po and secures their gates. This is the method to preserve essence, brighten the eyes, prolong life, and restore black hair. If one clenches the fists all day, noxious qi and all poisons cannot enter.\n\n**Method of Clenching the Fists:** Bend the thumb beneath the four fingers and grasp it. With persistent practice, the eyes will no longer involuntarily open. Some say this prevents demonic possession.\n\nThe *Inner Explanation* states: The six that harm the body are: first, essence; second, saliva; third, tears; fourth, mucus; fifth, sweat; and sixth, urine. Their harm varies in degree. If one can go all day without spitting or sniffling, one should swish the mouth when full and swallow the saliva. If one constantly holds a jujube pit in the mouth and swallows the saliva, it generates a lovable qi and produces body fluids—this is of great importance. (Note: It is the fluids that are swallowed, not the pit.) Each morning, click the teeth thirty-six times—up to three hundred is even better—to strengthen the teeth and prevent pain. Then, stir the tongue to swish the mouth’s fluids, filling the mouth and swallowing three times. Next, rub the Shaoyang meridian of the fingers until hot and press them over the eyes, completing fourteen cycles to brighten the vision.\n\nEvery morning upon rising, clasp the hands over the ears and vigorously rub them up and down fourteen times to prevent deafness. Then, click the teeth, swish the Jade Spring three times and swallow, contract the nose, hold the breath, and with the right hand pull the left ear from above the head fourteen times. Repeat with the left hand pulling the right ear fourteen times to prolong life and prevent deafness. Next, pull the temples’ hair upward fourteen times, then grasp all the hair with both hands, pulling upward with full force fourteen times to promote the circulation of blood and qi and prevent the hair from turning white.\n\nAnother method: Rub the hands until hot and massage the face from top to bottom to dispel noxious qi and give the face a radiant glow. Another method: Rub the hands until hot and vigorously massage the body from top to bottom—this is called \"dry bathing,\" which enables one to withstand wind and cold, seasonal heat, headaches, and all illnesses. Before retiring at night, always rub the body with both hands—this is also called \"dry bathing\" and wards off wind and evil qi.\n\nSit upright, support the head with the left hand, and with the right hand reach upward as far as possible, then shake the body and hand together three times. Repeat with the right hand supporting the head and the left hand reaching upward to relieve sleep-induced lethargy.\n\nBefore sunrise in the morning, face south and sit upright. With both hands supporting the thighs, shake vigorously three times to give the face a radiant glow. Before washing and combing in the morning, sit upright, grasp the right hand with the left on the left thigh, and push forward and pull back with full force three times. Repeat with the right hand grasping the left on the right thigh. Next, clasp the hands and push forward with full force three times, then clasp the hands before the chest, push the elbows forward with full force three times. Straighten the left arm and bend the right arm as if drawing a bow of one *hu* and five *dou* capacity, exerting full strength. Repeat the bow-drawing posture with the right hand. Next, with the right hand on the ground and the left hand reaching upward as if supporting the sky, exert full force; repeat with the left hand on the ground. Then, clench the fists and thrust forward, each side twenty-one times. Next, clench the left hand and reach behind the back to grasp the fingers three times with full force; repeat with the right hand. This treats fatigue and qi stagnation in the back, arms, and elbows—frequent practice is especially beneficial.\n\nAt dawn after turning over, use a long staff to support the armpit, let the left foot hang in front of the grove, and slowly rise to full height, pulling the left foot fifty-seven times. Repeat with the right foot. This treats leg qi, pain and oppression, cold qi between the waist and kidneys, cold impediment, and cold knees and feet—all are addressed by this. Practicing this three times at dawn and dusk is even better. Avoid doing this when overly full or suppressing the urge to urinate.",
      "overlap_context": "from great wind, hemiplegia, sinew contraction, limb spasms, joint blockages, emaciation, shortness of breath, and pain in the waist and legs—all caused by early marriage, excessive expenditure of essence, insufficient blood and qi, and extreme exhaustion.\n\nIllness arises from the five viscera; one must identify its root. Those who do not understand should not attempt treatment.\n\nFor heart-viscera illness, where the body experiences cold and heat, use the *hu* and *chui* exhalations to expel it.",
      "start_char": 9827,
      "end_char": 10961,
      "start_sentence": 469,
      "end_sentence": 513,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.943279504776,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养性延命录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "掣如无杖，但遣所掣脚不着地，手扶一物亦得。 晨夕以梳梳头满一千梳，大去头风，令人发不白。 梳讫，以盐花及生麻油搓头顶上，弥佳。 如有神明膏，搓之甚佳。 旦欲梳洗时，叩齿一百六十，随有津液便咽之。 讫，以水漱口，又更以盥末揩齿，即含取微醉、清浆半小合许熟漱，取盥汤吐洗两目。 讫，闭目以冷水洗面，必不得遣冷水入眼中，此法齿得坚今，目明无汨，永无匡齿。 平旦洗面时漱口讫，咽一两咽冷水，令人心明争，去胸臆中热。 谯国华佗，善养生，弟子广陵昊普、彭城樊阿，受术於佗。 佗语普曰：人体欲得劳动，但不当使极耳。 人身常摇动，则谷气消，血脉流通，病不生，譬犹户枢不朽是也。 古之仙者及汉时有道士君倩，为导引之卫，作熊经鸿顾，引挽腰体，动诸关节，以求难老也。 吾有一术，名曰五禽戏：一曰虎，二曰鹿，三曰熊，四曰猿，五曰乌，亦以除疾，兼利手足，以常#3导引。 体中不快，因起作一禽之戏，遣微汗出即止，以粉徐身，即身体轻便，腹中思食。 昊普行之，年九十余岁，耳目聪明，牙齿坚完，吃食如少壮也。 虎戏者，四肢距地，前三踯，却二踯，长引腰，侧脚，仰天，即返距行，前却，各七过也。 鹿戏者，四肢距地，引项反顾，左三右二，伸左右脚，伸缩亦三亦二也。 熊戏者，正仰，以两手抱膝下，举头，左僻地七，右亦七，蹲地，以手左右托地。 猿戏者，攀物自悬，伸缩身体，上下一七，以脚拘物自悬，左右七，手钩却立，按头各七。 乌戏者，双立手，翘一足，伸两臂，扬眉，用力各二七，坐伸脚，手挽足趾各七，缩伸二臂各七也。 夫五禽戏法，任力为之，以汗出为度。 有汗，以粉徐身，消谷气，益气力，除百病，能存行之者，必得延年。 又有法：安坐，未食前，自按摩。 以两手相叉，伸臂股，导引诸脉，胜如汤药。 正坐，仰天呼出，饮食醉饱之气立销。 夏天为之，令人冻，不热。 御女损益篇第六 道以精为宝，施之则生人，留之则生身．’生身则求度在仙位，生人则功遂而身退，功遂而身退，则陷欲以为剧。 何死妄施而废弃，损不觉多，故疲劳而命堕。 天地有阴阳，阴阳人所贵，贵之合於道，但当慎无费。 彭祖曰：上士别林，中士异被。 服药千裹，不如独外。 色使目盲，声使耳聋，味使口爽，苟能节宣其道，适抑扬其通塞者，可以增寿。 一日之忌，暮食无饱。 夜饱食眠，损一日之寿。 一月之忌，暮饮无醉。 夜醉外，损一月之寿。 一岁之忌，暮须远内。 一交损一岁之寿，养之不复。 终身之忌，暮须护气。 暮外习闭口，开口失气，又邪从口入。 采女问彭祖曰：人年六十，当闭精守一，为可尔否？ 彭祖曰：不然。 男不欲无女，无女则意动，意动则神劳，神劳则损寿。 若念真正，无可思而大佳，然而万无一焉。 有强郁闭之，难持易失，使人漏精尿浊，以致鬼交之病。 又欲令气未感动，阳道垂弱。 欲以御女者，先摇动令其强起，但徐徐接之，令得阴气，阴气推之，须臾自强，强而用之，务令迟疏。 精动而正，闭精缓息，瞑目偃外，导引身体，更复可御他女。 欲一动则辄易人，易人可长生。 若御一女，阴气既微，为益亦少。 又阳道法火，阴道法水，水能制火；",
      "translated_text": "If no staff is available for the pulling exercise, simply ensure the foot being pulled does not touch the ground—supporting oneself with a hand on an object will suffice.\n\nMorning and evening, comb the hair a full thousand strokes to greatly dispel head wind and prevent the hair from turning white. After combing, rub the crown of the head with salt blossoms and raw sesame oil for even better results. If *Divine Brightness Ointment* is available, rubbing it in is excellent.\n\nWhen washing and combing in the morning, knock the teeth one hundred and sixty times, and whenever saliva arises, swallow it. Then rinse the mouth with water, and further clean the teeth with tooth powder. Next, take a small half-measure of slightly fermented, clear rice-wash, swish it thoroughly, and spit it out to wash the eyes with the rinsing water. Afterward, close the eyes and wash the face with cold water—be sure no cold water enters the eyes. This method strengthens the teeth, brightens the eyes without tearing, and permanently prevents tooth decay.\n\nWhen washing the face at dawn and rinsing the mouth, swallow one or two mouthfuls of cold water to clarify the mind, dispel heat from the chest, and resolve oppression.\n\nHua Tuo of Qiao County was skilled in nurturing life. His disciples Wu Pu of Guangling and Fan A of Pengcheng received his teachings. Hua Tuo told Wu Pu: \"The human body requires movement, but one must not overexert. Constant motion digests the grain qi, circulates the blood and vessels, and prevents illness—like a door hinge that does not rot. The immortals of old and the Daoist Junqian of the Han dynasty practiced *daoyin* for health, performing bear hangs and crane stretches, pulling and extending the waist and limbs, and moving all the joints to seek longevity.\"\n\n\"I have a technique called the *Five Animals Play*: first the tiger, second the deer, third the bear, fourth the ape, and fifth the crow. These exercises eliminate illness, benefit the limbs, and serve as regular *daoyin*. When the body feels unwell, perform one of the animal plays until a slight sweat appears, then stop. Dust the body lightly with powder, and one will feel light and at ease, with the stomach ready for food.\"\n\nWu Pu practiced this and lived to over ninety, with keen hearing and vision, strong and complete teeth, and an appetite like that of a youth.\n\n**Tiger Play**: Crouch on all fours, spring forward three times, then backward twice. Extend the waist, stretch the legs to the side, look up to the sky, then return to the crouch and move forward and backward, seven times each.\n\n**Deer Play**: Crouch on all fours, stretch the neck and look back, left three times and right twice. Extend and retract the left and right legs, three and two times respectively.\n\n**Bear Play**: Lie flat on the back, clasp the knees with both hands, lift the head, and roll to the left to touch the ground seven times, then to the right seven times. Squat and push the ground with the hands to the left and right.\n\n**Ape Play**: Grasp an object and hang, stretching and contracting the body up and down seven times. Hook an object with the feet and hang, left and right seven times each. Stand on the hands, pull the body back, and press the head down, seven times each.\n\n**Crow Play**: Stand on both hands, lift one foot, stretch both arms, raise the eyebrows, and exert force fourteen times each. Sit and extend the legs, pull the toes seven times each, and retract and extend the arms fourteen times each.\n\nThe *Five Animals Play* should be performed according to one’s strength, stopping when sweat appears. After sweating, dust the body lightly with powder to digest grain qi, boost vitality, and eliminate all illnesses. Those who persist in this practice will surely attain longevity.\n\nThere is another method: sit calmly before eating and self-massage. Interlace the fingers, stretch the arms and thighs, and guide the flow of all vessels—this is more effective than medicine. Sit upright, look up to the sky, and exhale to instantly dissolve the qi of food and drink or drunkenness. Practicing this in summer keeps one cool and prevents heat.\n\n---\n\n**Chapter Six: On the Benefits and Harms of Sexual Union**\n\nThe Dao treasures essence: when expended, it gives life to others; when retained, it sustains the self. Sustaining the self leads to seeking transcendence and immortality; giving life to others fulfills one’s duty and then retreats. Yet fulfilling duty and retreating may entangle one in desire, becoming a grave peril. Why recklessly expend and waste it, unaware of the mounting loss, until exhaustion and life’s decline?\n\nHeaven and Earth possess yin and yang, which humans value. Valuing them in accord with the Dao requires only caution against waste.\n\nPengzu said: \"The superior person sleeps apart; the middling person uses separate covers. Consuming a thousand doses of medicine is not as good as sleeping alone.\" Sensual indulgence blinds the eyes, noise deafens the ears, and rich flavors dull the palate. If one can regulate and express the Dao, appropriately adjusting its flow and blockage, one may increase longevity.\n\n**Daily Taboo**: Do not eat to fullness at dusk. Sleeping after a full nighttime meal shortens a day’s lifespan.\n\n**Monthly Taboo**: Do not drink to intoxication at dusk. Sleeping after nighttime drunkenness shortens a month’s lifespan.\n\n**Yearly Taboo**: Avoid sexual union at dusk. Each union shortens a year’s lifespan, and recovery is impossible.\n\n**Lifelong Taboo**: Protect qi at dusk. Sleeping with the mouth open at night loses qi and allows evil to enter through the mouth.\n\nThe *Cai Nü* asked Pengzu: \"Should a person at sixty guard essence and maintain unity?\"\n\nPengzu replied: \"No. A man should not be without a woman. Without a woman, his thoughts stir, thoughts stir and the spirit labors, and spirit labor shortens lifespan. If one’s thoughts are truly upright, it is best to have no desires—yet this is nearly impossible. Forcibly suppressing and restraining them is difficult to maintain and easy to lose, causing seminal leakage, turbid urine, and even ghostly unions. Moreover, if qi is not aroused, the yang path weakens.\n\nWhen wishing to unite with a woman, first stir and arouse to strengthen the yang. Then proceed slowly, allowing her to receive yin qi. The yin qi will push the yang, and soon it will strengthen naturally. Use it when strong, but proceed slowly and sparsely. When essence stirs, regulate it; close the essence, slow the breath, close the eyes, lie still, and guide the body’s qi. Then one may unite with another woman. Each arousal should involve a different partner—changing partners can lead to longevity. If one unites with the same woman, her yin qi will be weak, and the benefit will be slight.\n\nThe yang path is like fire; the yin path is like water. Water can control fire...\"",
      "overlap_context": "cial.\n\nAt dawn after turning over, use a long staff to support the armpit, let the left foot hang in front of the grove, and slowly rise to full height, pulling the left foot fifty-seven times. Repeat with the right foot. This treats leg qi, pain and oppression, cold qi between the waist and kidneys, cold impediment, and cold knees and feet—all are addressed by this. Practicing this three times at dawn and dusk is even better. Avoid doing this when overly full or suppressing the urge to urinate.",
      "start_char": 10961,
      "end_char": 12221,
      "start_sentence": 514,
      "end_sentence": 565,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.324296951293945,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养性延命录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "阴亦消阳，久用不止，阴气嗡阳，阳则转损，所得不补所失。 但能御十二女子而复不泄者、令人老有美色。 若御九十三女而不泄者，年万岁。 凡精少则病，精尽则死。 不可不忍，不可不慎。 数交而时一泄，精气随长，不能使人虚损。 若数交接则泻精，精不得长益，则行精尽矣。 在家所以数数交接者，一动不泻则赢得一泻之精，减即不能数交接。 但一月辄再泻精，精气亦自然生长，但 迟微不能速起，不如数交接不泻之速也。 采女者，少得道，知养性，年一百七十岁，视如十五。 殷王奉事之年，问道於彭祖也。 彭祖曰：奸淫所以使人不寿者，非是鬼神所为也，直由用意俗猥，精动欲泄，务副彼心，竭力无厌，不以相生，反以相害，或惊狂消渴，或癫痴恶疮，为失精之故。 但施泻辄导引，以补其处。 不尔，血脉髓脑日损，风湿犯之，则生疾病，由俗人不知补泻之宜故也。 彭祖曰：凡男不可无女，女不可无男。 若孤独而思交接者，损人寿，生百病，鬼魅因之共交，失精而一当百。 若欲求子，令子长命，贤明富贵，取月宿日施精大佳。 月宿日，直录之於后。 天老曰：人生俱含五常，形法复同，而有尊卑贵贱者，皆由父母合八星阴阳，阴阳不得其时中也。 不合宿，或得其时，人中上也。 不合宿，不得其时，财为凡夫矣。 合宿交会者，非生子富贵，亦利己身，大吉之兆。 八星者，室、参、井、鬼、柳、张、心、斗。 月宿在此星可以合阴阳，求子。 月二日、三日、五日、九日、二十日，此是王相生气日，交会各五倍，血气不伤，令人无病。 仍以王相日，半夜后，鹅呜前，徐徐弄玉泉，饮玉浆戏之。 若合用春甲寅、乙卯，夏丙午、丁未，秋庚申、辛酉，冬壬子、癸亥，与上件月宿日合者，尤益佳。 若欲求子，待女人月经绝后一日、三日、五日择中王相日，以气生时，夜半之后乃施精，有子皆男，必有寿贤明。 其王相日，谓春甲乙、夏丙丁、秋庚辛、冬壬癸。 凡养生，要在於爱精。 若能一月再施精，一岁二十四气施精，皆得寿百二十岁。 若加药饵，则可长生。 所患人年少时不知道，知道亦不能信行，至老乃始知道，便以晚矣，病难养也。 虽晚而能自保，犹得延年益寿。 若少壮而能行道者，仙可冀矣。 《仙经》曰：男女俱仙之道，深内勿动精，思脐中赤色大如鹦子，乃徐徐出入，精动便退，一旦一夕可数十为之，令人益寿。 男女各息意共存之，唯须猛念。 道人刘京云：春三日一施精，夏及秋一月再施精，冬常闭精勿施。 夫天道，冬藏其阳，人能法之，故得长生。 冬一施，当春百。 剂道人言：人年六十便当都绝房内。 若能接而不施精者，可御女耳。 若自度不办者，都远之为上。 服药百种，不如此事可得久年也。 《道林》云：命本者，生命之根本。 次在此道，虽服大药及呼吸导引，备修万道，而不知命之根本。 根本者，如树木，但有繁枝茂叶而无根本，不得久活也。 命本者，房中之事也。 故圣人云：欲得长生，当由所生。 房中之事，能生人能煞人。 譬如水火，知用之者，可以养生，不能用之者，立可死矣。 交接尤禁醉饱，大忌，损人百倍。 欲小便忍之右以交接，令人得淋病，或小便难，茎中痛，小腹强。",
      "translated_text": "When yin also consumes yang, and its use is unceasing, yin qi hums against yang, causing yang to turn to harm. What is gained does not compensate for what is lost.\n\nYet if one can unite with twelve women without emission, it will grant an aged man a youthful countenance. If one unites with ninety-three women without emission, one may live ten thousand years.\n\nWhen essence is scant, illness follows; when essence is exhausted, death ensues. One must restrain and be cautious.\n\nFrequent union with occasional emission allows essence and qi to grow anew, preventing depletion. But if one emits with each union, essence cannot accumulate, and the path of essence will be exhausted.\n\nThose who frequently unite at home do so because each union without emission preserves the essence of a single emission. If emission occurs, frequent union becomes impossible. Even if one emits only twice a month, essence and qi will naturally regenerate, though slowly and subtly, unable to rise swiftly—far inferior to frequent union without emission.\n\nThe \"Gathering Maiden\" was a young adept who understood nurturing life. At one hundred seventy years, she appeared as a girl of fifteen. The King of Yin served her and sought the Way from Peng Zu.\n\nPeng Zu said: The reason debauchery shortens life is not the work of ghosts or spirits, but rather vulgar intent, stirred essence, and reckless emission to satisfy another’s desire. Exhausting oneself without restraint harms rather than nourishes, leading to madness, wasting thirst, epilepsy, or malignant sores—all from loss of essence. After each emission, one should practice guiding and drawing to replenish the loss. Without this, blood, vessels, marrow, and brain daily diminish. Wind and dampness invade, giving rise to illness, for common people know not the proper balance of replenishment and release.\n\nPeng Zu said: No man should be without a woman, nor woman without a man. Those who live alone and long for union harm their longevity, invite a hundred illnesses, and may even be joined by ghostly spirits. Losing essence once in such cases is as damaging as a hundred losses.\n\nIf seeking a child—one long-lived, wise, prosperous, and noble—emitting essence on a lunar-mansion day is most auspicious. The lunar-mansion days are recorded below.\n\nTian Lao said: All humans bear the Five Constants and share the same form, yet differ in rank and fortune. This arises from the union of parents under the eight stars of yin and yang, when yin and yang fail to align with the proper time.\n\nIf the union does not occur on a lunar-mansion day but falls at the right time, the child will be of superior quality. If neither condition is met, the child will be an ordinary person. Union on a lunar-mansion day—even if not at the proper time—may still produce a noble child and benefit the parents, a most auspicious sign.\n\nThe eight stars are: Chamber, Net, Well, Ghost, Willow, Spread, Heart, and Dipper. When the moon lodges in these stars, one may unite in yin and yang to seek a child.\n\nThe second, third, fifth, ninth, and twentieth days of the lunar month are days of flourishing life-energy. Union on these days multiplies vitality fivefold, sparing blood and qi and preventing illness. On these flourishing days, after midnight and before the cock’s crow, one should gently caress the Jade Spring, sip the Jade Nectar, and playfully engage.\n\nIf these days coincide with the seasonal stems—spring’s *jia-yin* and *yi-mao*, summer’s *bing-wu* and *ding-wei*, autumn’s *geng-shen* and *xin-you*, winter’s *ren-zi* and *gui-hai*—the benefits are even greater.\n\nTo conceive a son, wait until one, three, or five days after the woman’s menstrual flow ceases, then choose a flourishing day. At the hour when qi is born, after midnight, emit essence. The child will be male, long-lived, wise, and noble.\n\nThe flourishing days are: spring’s *jia* and *yi*, summer’s *bing* and *ding*, autumn’s *geng* and *xin*, winter’s *ren* and *gui*.\n\nIn nurturing life, the essential principle lies in treasuring essence. If one emits twice a month, aligning with the twenty-four solar terms in a year, one may live to one hundred twenty. With the addition of medicinal supplements, one may attain longevity.\n\nThe trouble is that in youth, people do not know the Way; even if they know, they do not trust or practice it. Only in old age do they begin to understand, but by then it is too late, and illness is hard to cure. Yet even late in life, if one can preserve oneself, one may still extend years and add to life. If one practices the Way in youth and prime, immortality may be hoped for.\n\nThe *Scripture of Immortals* says: The Dao of dual cultivation for man and woman lies in deep insertion without moving essence. Visualize a red hue within the navel, as large as a parrot’s egg, then slowly withdraw. When essence stirs, retreat. Practicing this dozens of times in a day and night will enhance longevity. Man and woman should each still their minds and focus together, requiring intense concentration.\n\nDaoist Liu Jing said: In spring, emit essence once every three days; in summer and autumn, twice a month; in winter, constantly retain essence without emission. Heaven’s Dao conceals yang in winter; those who emulate this attain longevity. One emission in winter equals a hundred in spring.\n\nMaster Ji Dao said: At sixty, one should entirely abstain from the bedchamber. If one can unite without emitting essence, one may still engage with women. If one cannot, complete avoidance is best. No hundred medicines compare to this practice in securing long life.\n\nThe *Daoist Grove* states: The root of life is the foundation of existence. Next in importance is this Way. Though one may take potent medicines, practice breath control and guiding, and cultivate myriad methods, without knowing the root of life, it is like a tree with lush branches and leaves but no roots—it cannot live long. The root of life lies in the affairs of the bedchamber.\n\nThus the sage said: To attain longevity, one must follow the source of life. The affairs of the bedchamber can give life or take it. Like water and fire, those who know their use may nurture life; those who do not may die instantly.\n\nUnion is especially forbidden when drunk or sated—this is a great taboo, harming a hundredfold. If one unites while suppressing the urge to urinate, it may cause strangury, difficult urination, pain in the stem, or stiffness in the lower abdomen.",
      "overlap_context": " strengthen naturally. Use it when strong, but proceed slowly and sparsely. When essence stirs, regulate it; close the essence, slow the breath, close the eyes, lie still, and guide the body’s qi. Then one may unite with another woman. Each arousal should involve a different partner—changing partners can lead to longevity. If one unites with the same woman, her yin qi will be weak, and the benefit will be slight.\n\nThe yang path is like fire; the yin path is like water. Water can control fire...\"",
      "start_char": 12221,
      "end_char": 13449,
      "start_sentence": 566,
      "end_sentence": 619,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.71061420440674,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养性延命录.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "大志怒后交接，令人 发瘫疽。 《道机》：房中禁忌，日月晦朔，上下弦望，日月蚀，大风恶雨，地动，雷电，霹雳，大寒暑。 春夏秋冬节变之日，送迎五日之中，不行阴阳，本命行年月日忌禁之尤重。 阴阳交错不可合，损血气，泻正纳邪，所伤正气甚矣，戒之。 新沐头，新行疲倦，大喜怒，皆不可行房室。 彭祖曰：消息之情，不可不知也。 又须当避大寒、大热、大风、大雨、大雪、日月蚀、地动、雷震，此是天忌也。 醉饱、喜怒忧愁、悲哀恐惧，此人忌也。 山川神只、社稷井鳌之处，此为地忌也．既避些二忌。 又有吉日，春甲乙、夏丙丁，秋庚辛，冬壬癸，四季之月戊己，皆王相之日也。 宜用嘉会，令人长生，有子必寿。 其犯此忌，既致疾，生子亦凶夭短命。 老子曰：还精补脑，可得不老矣。 《子都经》曰：施泻之法，须当弱入强出？ 何谓弱入强出？ 纳玉茎於琴弦麦齿之问，及洪大便出之，弱纳之，是谓弱入强出。 消息之，令满八十动，则阳数备，即为妙也。 老子曰：弱入强出，知生之术。 强入弱出，良命乃卒，此之谓也。 养性延命录卷下竟 #1僵：《云笈七签》作『偃』。 #2搔：《云笈七签》作『按』。 #3常：《三国志·华佗传》作『当』。",
      "translated_text": "After great anger and intercourse, one may develop carbuncles and deep abscesses.\n\n*The Daoist Mechanism* states: Taboos in the bedchamber include the dark and new moons, the first and last quarters, full moons, solar and lunar eclipses, fierce winds, violent rain, earthquakes, thunder, lightning, and extreme cold or heat. On the days when the seasons change in spring, summer, autumn, and winter, and during the five days of transition between them, one must not engage in yin-yang union. The prohibitions are especially strict on one’s birth year, month, and day. When yin and yang are in conflict, union must not occur—it harms the blood and qi, drains the upright and admits the perverse, greatly injuring the true qi. Beware of this.\n\nOne must not engage in the bedchamber after newly washing the hair, after exhaustion from travel, or in states of great joy or anger.\n\nPengzu said: The subtleties of regulation must be understood. One must also avoid great cold, great heat, fierce winds, heavy rain, deep snow, solar and lunar eclipses, earthquakes, and thunderclaps—these are the heavenly taboos. Drunkenness, satiety, joy, anger, sorrow, grief, fear, and dread—these are the human taboos. Sacred mountains and rivers, altars of soil and grain, and places near wells and stoves—these are the earthly taboos. Having avoided these three taboos, there are also auspicious days: in spring, *jia* and *yi* days; in summer, *bing* and *ding* days; in autumn, *geng* and *xin* days; in winter, *ren* and *gui* days; and in the last month of each season, *wu* and *ji* days. These are the days of flourishing vitality. Union on such days brings long life, and any children conceived will surely be long-lived. Violating these taboos leads to illness, and children born will be ill-fated and short-lived.\n\nLaozi said: Returning the essence to replenish the brain can achieve agelessness.\n\n*The Scripture of Zidu* states: In the method of emission, one must enter weakly and withdraw strongly. What does this mean? Insert the jade stem between the zither strings and wheat sprouts, then withdraw when it is swollen and large—this is weak entry and strong withdrawal. Regulate this until eighty movements are completed, and the yang number is fulfilled, which is the sublime method.\n\nLaozi said: Weak entry and strong withdrawal is the art of nurturing life. Strong entry and weak withdrawal will abruptly end a good life—this is what it means.\n\n*Yangxing Yanming Lu*, Volume Two, concludes.",
      "overlap_context": "of the bedchamber.\n\nThus the sage said: To attain longevity, one must follow the source of life. The affairs of the bedchamber can give life or take it. Like water and fire, those who know their use may nurture life; those who do not may die instantly.\n\nUnion is especially forbidden when drunk or sated—this is a great taboo, harming a hundredfold. If one unites while suppressing the urge to urinate, it may cause strangury, difficult urination, pain in the stem, or stiffness in the lower abdomen.",
      "start_char": 13449,
      "end_char": 13951,
      "start_sentence": 620,
      "end_sentence": 643,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.800096273422241,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养性延命录.txt",
        "category": "方法类"
      }
    }
  ]
}