{
  "source_id": "养生咏玄集",
  "source_file": "chunked_daozang\\养生咏玄集.json",
  "total_chunks": 11,
  "total_original_chars": 7901,
  "total_translated_chars": 44427,
  "total_translation_time": 226.1365945339203,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\养生咏玄集.txt",
    "category": "方法类"
  },
  "full_translation": "**Yangsheng Yongxuan Ji**\n\n**Title:** *Yangsheng Yongxuan Ji* (*Chanting the Mysteries: A Collection on Nurturing Life*). Author unknown. One fascicle. Based on the text from the *Zhengtong Daoist Canon*, *Dongshen* section, Methods category.\n\n**Preface to *Yangsheng Yongxuan Ji***\nTo \"chant the mysteries\" is to intone the profound depths of the unseen. By delving into the obscure to grasp principle and seeking truth in the indistinct, one gathers the essence of all wonders and distills the essential convergence of the myriad scriptures. The words are direct yet their meaning upright, the Dao entering the realm of profound mystery; the purport seems distant yet its intent is luminous, its influence preserving the legacy of the highest ancestors. It guides the restless striving of dragon and tiger toward unity, revealing the subtle mysteries of the Dark Female, free from all grasping. It directly points to the ultimate return, establishing wondrous efficacy. It rightly expounds the teachings of opening and closing, clarifying the fundamental distinctions between departure and approach. Encompassing the revolving mystery, it ascends and descends in boundless vastness. Thus, the inferior scholar claps in delight, while the superior scholar diligently practices, perfecting the integrity of spirit and qi to ultimately dissolve the illusory reflections of root and dust. Truly, how heavy is the pearl and jade, how light the nature and life! Would one not exhaustively unravel the mystery of stilling movement and calming the breath, only to indulge the fleeting passage of radiant light and the departure of the soul? How deeply lamentable!\n\nThese chants of the mystery are indeed the essential methods for attaining longevity and transcending the world. Such as the sacred talismans of the Mysterious Origin Emperor, forever concealed within the pillow; the divine formulas of the Prince of Huainan, secretly stored behind the elbow. These are the most revered and treasured words of the highest sages. Should a scholar encounter them, they must guard and cherish them with utmost secrecy and care.\n\n**Yangsheng Yongxuan Ji**\n\n**Rong and Wei Qi**\nThe two qi complete each other, and the Dao begins to arise.\nForm and appearance take shape, yet none exists solely from one qi alone.\nOnly when *rong* and *wei* are harmonized does life persist.\nThus it is said: the two qi complete each other to give birth—this is the Dao.\nThe Dao is life.\nAs Laozi said: the Dao cannot be seen, so it is revealed through life.\nLife cannot be eternal, so the Dao is employed to preserve it.\nIntermingled, they flow from a single source.\nThis is the fusion of the two qi—harmonious qi dwelling together in one origin, for they perpetually generate.\nYin and yang stimulate and depend on each other.\nReceiving the two qi, form and substance take shape; containing the two qi, life and growth are established. All this arises from the mutual stimulation of yin and yang, which nourishes nature and life.\nWithout harmony and gentleness, there is conflict.\nIf the two qi contend and fail to harmonize, they stir disorder in the five viscera and extinguish life.\nThus the *Classic* states: \"When yin hesitates at yang, the lines wage war.\"\nHence, there is no purely yang man or purely yin woman.\nHeaven is wholly yang yet bears yin dew; earth is wholly yin yet embraces yang essence.\nThus, heaven and earth rely on yin and yang to transform and generate the myriad things.\nThe *Book of Changes* says: \"Qian is male, Kun is female.\" Therefore, human relations fully emulate the patterns of heaven and earth.\n\n**Rong Qi**\nRong qi does not arise in isolation,\nRong qi is clear yang.\nThe *Neiguan Jing* states: \"Qi that is clear and swift is called *rong*.\"\nWithin the human body, it cannot stand alone, hence it does not arise in isolation.\nClear yang, empty and subtle, depends on yin for its existence.\nYin qi gathers, and yang rests upon it; yang qi abides, and yin relies on it.\nThus it is said: yang depends on yin for its existence, for they complete each other.\nFrom this, the first signs of the embryo take form.\nWhen the two qi interact, the fetus begins to take shape.\nUpon leaving the womb, life begins with the inception of rong qi.\nRefining it to return to the origin follows a distinct path.\nAmid the two qi, one refines and returns to the original source of pure, unified, and serene qi. By separately cultivating and removing impurities, one achieves the fullness of yang, and rong unites with the Dao in truth.\n\n**Wei Qi**\nWei qi originally arises from yang qi.\nWei is turbid.\nThe *Neiguan Jing* states: \"Qi that is turbid and slow is called *wei*.\"\nIt fundamentally arises from the interaction of primordial qi, which gives rise to the physical body. Once the body exists, the nature of wei qi becomes evident, thus wei derives from rong.\nThe colored body takes shape within the womb.\nOnce form and substance emerge, they receive the influence of the two qi and dwell within the womb.\nSilently mirroring heaven and earth, it arranges the palaces.\nThe human body subtly reflects the pattern of heaven and earth.\nThus the *Neiguan Jing* says: \"The eyes are the sun and moon, the hair is the stars, the eyebrows are the canopy, the head is Kunlun. The palaces are arrayed, and the spirit is settled.\"\nThis is what is meant.\nFrom this, it condenses and refines with exquisite precision.\n\nFrom this, essence and blood congeal and refine to form substance, so finely wrought as to be measurable, thus fulfilling their function.\n\nNow, human *wei* qi possesses two designations:\nFirst, essence and blood congeal and refine to form substance.\nSecond, it flows in unison with *rong* qi, circulating to sustain life.\n\nKnow then that the human body serves as the ground for cultivating the true, deserving its title as the most numinous of beings.\nHow could one fail to cherish it, grow indolent, and seek what flees?\n\nThis *wei* qi also mirrors the Three Powers:\nFirst, congealing and refining to form substance, it images Earth;\nSecond, where *rong* and *wei* unite, the daily harmonizing qi images Man;\nThird, the true essence of life resides in the Upper Cinnabar Field, the palace of pure yang, imaging Heaven.\nReceiving these three qi to sustain life, the Dao naturally returns to it, for the body embodies the Three Powers and treads the Way.\n\n**Hun and Po**\nThus, when the two qi contain harmony, life takes root.\n*Hun* is the true essence of yang;\n*Po* is the true essence of yin.\nThese two essences dwell in the Mud-Pill Palace, bearing the two qi without separation, and the spirit abides within them—thus life takes root.\n\nLaozi said: \"The myriad things bear yin and embrace yang, achieving harmony through the Dao.\"\nAt first, they are called *hun* and *po*, responding to the true numen.\n\nZichan said: \"At birth, one is called *po*; once alive, one is called *hun*.\"\nThus, the arising of the two qi is none other than *hun* and *po* responding to the true numen.\nYet in life, with its myriad transformations and changes, there is birth and death—none transcend the Three Clarities, drifting through the various destinies. The pivot of gain and loss lies precisely here.\n\nIn heaven, the sun and moon fully manifest their images:\nThe sun and moon are the *hun* and *po* of heaven and earth.\nThus, *hun* is the sun, governing the day, the true essence of heaven;\n*Po* is the moon, governing the night, the true essence of earth.\nKnow then that brightness and darkness share a single source, circulating and communicating.\nThus, the *hun* and *po* of humans fully manifest their images in the sun and moon.\n\nThe Prince of Huainan said: \"The qi of heaven forms *hun*; the qi of earth forms *po*.\"\nThe *Neijing of the Five Viscera* also states: \"The father’s essence becomes *hun*; the mother’s essence becomes *po*.\"\nThis principle is manifestly clear.\n\n**The Myriad Transformations All Arise from Guarding the One**\nThe myriad transformations are but the heart’s extinguishing, driving *hun* and *po* to manifest in life.\nThus, the sages established countless scriptures and teachings to instruct the multitudes, revealing the method of guarding the One to still all delusions.\n\n**Hun**\nThe yang essence of *hun* is called \"spirit-metal.\"\n*Hun* is the true essence of yang.\nThus, yang essence is the metal of spirit, and the sages made it the dharma-body, linking and transmitting it to communicate with the true.\n\nMaster Han said: \"Without utmost essence, one cannot transform into utmost spirit.\"\nBaopuzi said: \"Laozi is the *hun* of heaven, conceived by the essence of the sun, transforming into a wondrous body—thus manifesting the essence of utmost yang.\"\n\n**Resonance and Hidden Signs Operate in the Heart**\nWhen the heart moves, qi turns—hence it is called \"hidden signs,\" clarifying resonance.\nIf one attains perfect penetration by stilling all delusions,\nqi unites with spirit, and transformation arises.\n\n**The Numinous Light Shines, Shedding All Yin**\nOnce true essence is complete and numinous union achieved, one roams freely in the unending light, shedding the golden yin substance.\nThus, the sages received and mastered it to communicate with numinous transformation.\n\n**Po**\nThe yin qi surges and blends, responding to yang.\nWhen circumstances stir the heart, resonance arises.\nWhen the two come together, harmony flows like nectar.\n\n**Pursuing the Mysterious Here Is Not True Application**\nPursuing the mysterious through reckless indulgence causes the two qi to diverge—this is not the method of true application, but a violation of the Dao’s true principle.\n\n**Hun Does Not Soar, Po Does Not Hinder**\nWhen *hun* does not soar and *po* does not hinder, they respond to the heart’s function.\nIf *hun* does not fly, *po* does not respond—\nfor the heart governs departure and abiding, the root of life and death.\nThe principle of cultivating life is found nowhere else.\n\n**Valley Spirit**\nThe Sage Ancestor at Hangu Pass revealed the Valley Spirit.\n\nAt Hangu Pass, the Sage Ancestor expounded the *Dao De Jing*’s five thousand words to Yin Xi, the Pass Keeper, establishing principles through images and revealing the Valley Spirit. He stripped away superficial distortions to illuminate its profound mysteries. Its meaning runs deep and ever-renews through the ages. How could its subtleties ever be exhausted? Even with great clarity, none can fathom its vast source—hence it is called \"deep and ever-renewing.\" This speaks of the sutra’s profound obscurity.\n\nIf you seek it within yourself,\ncasting aside words to grasp the principle and upholding the method of practice within—this is not found beyond the Valley.\nThen you are one enlightened in this very life.\nSuch realization transcends distinctions of superiority, inferiority, or existence and nonexistence. If one is truly perceptive, enlightenment may dawn in a single lifetime, for the alchemy of fruition belongs to all beings.\n\n**Why Does the Valley Conceal Such Marvelous Spirit?**\nThe Valley is the sign of the two qi’s nurturing transformation.\nAll depends on the Valley’s embrace of true essence.\nTrue essence is the essence of the two qi.\nIt does not reside in the Mud Pill Palace—this is why the Valley conceals such marvelous spirit.\nIf essence scatters, spirit departs.\n\nOnly when they find their proper interdependence,\nwhen spirit and qi rely upon each other, inseparable and undissipated,\ndoes their union give rise to sound.\nWhen they unite and resonate with the marvelous spirit, life becomes manifest—then words arise.\n\n**Spirit**\nProfoundly still, it comes without reliance.\nIn utter tranquility, before it inhabits the four great elements, spirit roams the Supreme Ultimate, unattached. Only when it descends into the body does the marvelous become evident, life take root, and the foundational form of the Dao mirror heaven and earth.\nThrough countless lifetimes, in action and repose, it responds with perfect clarity.\n\nLaozi said: \"Invisible when seen, inaudible when heard, intangible when grasped.\"\nThe *Book of Changes* states: \"That which cannot be fathomed in yin and yang is called spirit.\"\nThus we know it cannot be measured by thought—how could words ever fully express it?\n\n**Passing Through the Mysterious Valley, the Multitude of Spirits Return**\nHaving passed through the Mysterious Valley,\nthe eyes perceive form, the ears hear sound,\nthe nose detects fragrance, the tongue distinguishes taste,\nthe mind cherishes desires, the body senses cold and heat—\nits transformations are manifold, hence it is said \"the multitude of spirits return.\"\n\n**Now You Recognize the Path of Returning to the Origin**\nThe Way of returning to the origin,\nthe method of extinguishing the heart and embracing the One,\nlies in uniting practice with the Dao—not through excessive effort.\nIt does not depend on traversing distant paths.\nIts essence is not remote or subtle;\nboth substance and function are illuminated, merging with the Dao.\n\n**Returning to the Origin**\nWhen qi wanes and form withers, spirit diminishes.\n\n**Human Decline and the Return to the Origin**\nHuman decline and aging arise from the stains of desires, leading to injury and ruin, and thus to frequent setbacks. The *Scripture of Western Ascension* states: \"As fire arises from wood, it returns to burn the wood to ash.\" The *Scripture of the Hidden Correspondence* also says: \"The heart is born of things.\" This is what is meant. Returning to the origin is the truest path. When qi is complete and spirit is whole, the Dao may be perfected. The Perfected One of Great White Mountain said: \"The old revert to youth, the strong return to infancy.\" This clarifies the meaning of returning to the origin and reverting to the primordial.\n\n**Mending Faults and Recognizing the Great Peril**\nOnly when the work of mending faults is accomplished does one gradually align with the Dao. Mending faults means repairing the past errors of indulgence and dissipation. When this work is complete, one aligns with the path of returning to the origin. To \"recognize anew\" is to reaffirm the return to the origin. There are two aspects to returning to the origin: first, mending faults, which is seeking the fullness of qi to return to the true; second, \"recognizing anew,\" for the origin is the return to the primordial source. Laozi said: \"My great affliction is that I have a body. If I had no body, what affliction would I have?\" Thus, Laozi did not regard preserving the body as the ultimate goal.\n\n**The Union of Spirit and Qi**\nSpirit and qi must not part, for they depend on each other. Spirit without qi is like a fish separated from its spring; qi without spirit is like a lamp without flame—they cannot be separated. This is made clear to dispel the doubts of the world. When spirit unites with qi, it transforms into formlessness. The principle of being and non-being is not to be clung to rigidly. If this is deeply understood, scholars’ doubts will fade, for people differ in wisdom and clarity, some profound, some shallow.\n\n**The Distinction Between the Sage and the Common**\nThe sage does not see external forms, does not hear external sounds, does not contemplate external matters—spirit congeals and qi unites. The common person, by contrast, takes ruin as their heart and exhausts spirit through laborious thought. Thus, the sage practices the union of spirit and qi. Without severing the furnace of spirit, how could one know this? If alignment is not yet achieved, spirit and qi will not unite. It is like a cat hunting a mouse: like responds to like, and qi seeks its kind. From this, one may form the embryo and nurture the infant, transform the foul substance of the body, reverse aging and restore youth, refine the turbid and solidified form. Some ignite fire to burn the body, some transmute into golden bones, some shed impurities and stagnation, some condense true suchness. Entering the wondrous gate of non-duality, one exhausts the infinite principle. Only when spirit and qi unite do they produce responsive function. Their destination, whether profound or shallow, determines the mastery of the transformative Dao.\n\n**Embracing the Profound and Holding to the One**\nThe essential practice is embracing the profound and holding to the One—spirit and qi embracing, merging into oneness. Laozi said: \"Hold to the One as the model for all under heaven.\" And again: \"The adept holds without losing, calculates without need of counting rods.\" Zhuangzi also said: \"When one is attuned to the One, all matters are complete.\" Without comprehending the true primordial Dao, how can there be communication?\n\n**The Empty Mind Sees Truth**\nOnly when the mind-ground is empty can truth be seen. Emptiness means emptying the heart. Thus, Laozi’s *Thirteen* and the *Scripture of Emptiness* expound upon the thirteen types of those born into the world, as revealed in the *Five Thousand Characters*. These thirteen all return to emptiness as the highest good. When the mind-ground is empty, one seeks to embrace the true One. Truly, the functions of the myriad things are not the same. Scholars follow many paths, and profound teachings vary. Thus, the Dao of emptiness and holding to the One differs from the uses of the myriad things.\n\n**Embryonic Breathing**\nWhen the harmonious Dao is mastered, wholeness is attained. Harmony arises from the blending of the two qi, where constructive and protective energies converge. If one applies this to the convergence of constructive and protective qi, one aligns with the most profound principle, attaining the meeting point of life’s Dao. This is called the abstruse principle of embryonic breathing. To grasp the principle of profound mystery is to clarify the method of true abiding. How can one who dwells in the womb like a newborn child attain this? Without the hundred grains, how could life arise? Carefully examine the practice—its method is natural. Understanding the Dao of the newborn child reveals the mechanism of embryonic breathing. Naturally, one comprehends spirit’s congealment and the cessation of thoughts. The sage is born of this and relies on it to achieve completion. Without grasping its essential pivot, the great affliction cannot be removed. The path of return reaches this point where no method can be spoken, yet the source of returning aligns with its application in due time. Applying it in practice, there is no error.\n\nMaster Qizhen said: \"When my qi is inwardly sealed, my body enjoys long peace.\" The method of embryonic breathing is entirely the natural Dao. One safeguards the true breath, continuous and subtle, coming and going imperceptibly, neither allowing stillness nor restlessness to disturb, seeking only tranquility. Practicing day and night without interruption, as days pass and months turn, the true person does not leave the chamber. When the embryo is fully formed, the Dao is perfected. Laozi said: \"Subtle and continuous, it is used without exhaustion.\" This principle, when clearly understood, severs all distractions, establishing the ultimate and giving rise to luminous wisdom. When one reaches the state of stability, the water of stability is born, irrigating the five viscera and generating radiant light. This is called true water, not the turbid fluids of saliva. This is the essential method for preserving form and abiding in the world. The *Inscription of the Three Abidings* states: \"If the heart abides, qi abides; if qi abides, form abides. When all three abide, my life is in my hands, not in heaven’s.\"\n\n**Nature**\nWater’s nature is humble and yielding; fire’s nature is strong and ascending. Water and fire each belong to nature, illustrating the principle of their mutual generation to clarify the natural Dao of spirit and qi. Water descends to the lowly, fire rises to the heights—each corresponds to its nature. Thus, qi can steam upward, and fluids can moisten downward. The two interact and respond to each other: qi ascends to generate fluids, fluids descend to generate qi. Nurturing the body, they transform through mutual influence.\n\nThus, their names correspond precisely, not by human coercion. Their mutual interaction and resonance share a common nature—this interaction, where water and fire converge to produce resonance, mirrors external phenomena. Consider water and fire: when fire heats a cauldron, water vapor arises, revealing the resonance of the great Dao as entirely natural. Let no divergent paths obscure the principle that endures of itself.\n\nSince the fundamental nature of the Dao is self-so, nothing is sought from without. Heaven covers and earth bears; male begets and female conceives; ruler and minister, father and child—all follow the natural reckoning. Not belonging to disparate paths or distinct kinds, yet able to harmonize thus, the Way of the Returned Elixir becomes manifest! The principle of the original source is illuminated!\n\n**Dragon and Tiger**\nWhen dragon and tiger share a source in restless strife,\nThe dragon, elusive and ever-changing, neither fixed in being nor non-being, mirrors the marvel of spirit. The tiger, fierce in nature and unyielding in strength, in turn embodies the essence of qi. The sage blends spirit and qi into one, thus mastering the mechanism of their subjugation. The common folk, however, conduct them separately within and without, breeding the ceaseless agitation that sets dragon soaring and tiger fleeing, no longer bound to one another.\n\nOnly when gathered to excess do they scatter.\nOnce form takes shape, spirit and qi are preserved in full—yet allured by desires, they decline into frailty and decay. When original qi is exhausted, spirit has nowhere to lodge, leading to death. Thus it is said: when gathered to excess, they scatter.\n\nFirst, the tiger must be restrained as the pivotal mechanism;\nTo tame the dragon, first restrain the tiger.\n\nThus the *Classic of the Hidden Correspondence* states: \"To capture and control lies in qi.\" For it is by preserving qi in its entirety that its function is made manifest. Thereby the dragon lies concealed, and both hold fast. When the tiger is subdued and the dragon harbors, both rely on themselves and return to the Dao of True Unity.\n\nThe *Song of the Great Emperor Lao* says:\n*\"When the tiger is subdued, the dragon too harbors;\nFirst tame the dragon, then subdue the tiger.\nOnce the River Chariot’s work is complete,\nNo need for dikes or barriers to resist.\"*\n\nThis reveals the function of capture.\n\n**Refining yang to dissolve yin**\n*\"When yang is refined, yin dissolves—this shifts the world;\nRefining yang consumes the yin substance.\"*\n\nThe method of refining yang to dissolve yin was transmitted by the Heavenly Perfected Sovereign to the Yellow Emperor as the Three-One Oral Formula—this is its Dao. If spirit and qi merge, yang refines itself and yin dissolves of its own accord, all according to natural principle. Is it not the interplay of yin and yang that makes it so?\n\nThe *Yellow Court Classic* states: *\"The primordial One refines the hun and po.\"* Its principle is profoundly abstruse; few grasp its depth, hence it is said to be rare in the world.\n\n*\"The numinous text and wondrous formula are best followed faithfully.\"*\nThe *Numinous Text* refers to the *Golden Tablet*; the *Wondrous Formula* is the Three-One Method. These all originate from the secret treasury, ascending into the Mysterious Capital—unless one is a perfected person, this Dao is not transmitted.\n\nThe transformative principle of refining yang to dissolve yin fundamentally communicates through the mechanism of emptiness and non-being. How could ordinary people attain it?\n\n*\"Yang, by nature restless and hard to restrain—\"*\nYet to restrain it is not one-sided; the Dao may be fully realized without being fettered or isolated to achieve its wondrous function.\n\nThe *Mysterious Rigidity* states: *\"If a person retains even a fraction of yang, they do not die; if they retain even a fraction of yin, they do not become immortal.\"*\n\n**Recognize the supreme mechanism of the numinous origin**\nThe numinous origin possesses a supreme mechanism, which is the pivotal key to restraining restlessness. The Perfected Master of Grand White says: *\"When the mysterious mechanism arrives, the body endures; when it departs, the body perishes.\"*\n\n**Upper Cinnabar Field**\n*\"Palace gates layered upon layered, named the Jade Capital—\"*\nThe *Jade Capital* refers to the Muddy Pellet Palace. The Upper Cinnabar Field contains nine interconnected palace gates, hence it is said that *\"palace gates layered upon layered.\"*\n\n*\"Where the Reverted Elixir is accomplished—the Yang Crucible.\"*\nThe *Reverted Elixir* is true essence. The Upper Cinnabar Field is the palace of pure yang, the sole repository of the Reverted Elixir—all people possess it, hence it is called *\"where the Reverted Elixir is accomplished—the Yang Crucible.\"*\n\n*\"The divine passage through the spine serves as the thoroughfare—\"*\nThis palace has two channels flanking the spine, descending to the Cinnabar Field and Sea of Qi, through which true essence flows, transforming and harmonizing qi to respond to leakage.\n\n*\"Below, it corresponds to the Gate of Origin—no cause for concern.\"*\nThe *Gate of Origin* is the Lower Cinnabar Field, the gateway for the leakage of essence and qi. When a person engages in yin-yang intercourse, true essence descends to this gate, where harmonized qi coalesces into congealed essence to serve the spirit’s function. This gate is the mouth of a hundred convergences, connecting to all the viscera, the four limbs, sinews, and vessels—like the pores of lotus roots, it is the site of qi transformation, hence it is called the *Gate of Origin*. If the upper corresponds to the lower, the Daoist need not be concerned.\n\n**Middle Cinnabar Field**\n\nAt the *jian-shen* command, it corresponds to the Middle Field—\n*Jian-shen* refers to the Zhongyuan Festival in the seventh month, which also aligns with the human Middle Cinnabar Field. This governs the three burners: heart, lungs, and liver. The *three burners* are the heart, lungs, and liver, the palace of respiration. As this is under the jurisdiction of the Middle Cinnabar Field, it is called the *Palace of Life*. Here, fluids descend to moisten and reach their destination.\n\nWithin stands the *Spirit Terrace*, where the true sovereign abides—\nThe *Spirit Terrace* is one of the five viscera, the heart. The true spirit anchors here as its palace, hence it is said to house the true sovereign. Through cultivation, the present is realized. Attaining lightness and peace, if one understands the movement and function of the true spirit, then cultivation manifests in the present, and with lightness and peace, all worries and afflictions vanish forever.\n\n**Lower Cinnabar Field**\nBalanced harmony nurtures the Lower Cinnabar Field—\nThe *Lower Cinnabar Field* is the Sea of Qi, three inches below the navel. *Balanced harmony* refers to the flourishing of unified qi, where constructive and defensive qi merge, hence the name *harmonized qi*. This qi circulates through the five viscera and four limbs, ever gathering in the Lower Cinnabar Field, thus called the *Sea of Qi*. Yet when the heart stirs with action, yielding to lustful desires, true essence from the Upper Cinnabar Field descends to the Lower Cinnabar Field, transforming harmonized qi. Once this qi is transformed, it is then depleted—how could the Dao remain obscure?\n\nWhen the two qi converge, all responds in resonance—\nThis speaks of the mutual arousal of male and female passions, leading to the act of cloud and rain. All arises from natural resonance, even unto the formation of conception. As true primordial essence undergoes transformation, those who cultivate life must guard it with care, seeking the method of restraint. Thus, the *Tai Bai True Scripture* states: *\"Retaining essence within the body gives life to the body; releasing essence into another gives life to another.\"* When this primordial qi merges with that primordial qi, and the other takes form, this one suffers loss—hence the utmost caution is required.\n\nExamine closely the convergence of heaven and earth—\nThe yin and yang qi of heaven and earth interact, generating transformation. Indeed, the principle of yin-yang’s cyclical movement is self-evident, as when qi rises to steam the One into rain, and rain descends to moisten, giving rise to the myriad things. Yet by closely observing the convergence of heaven and earth, the revolutions of sun and moon, one clarifies the model and comprehends the principle of impartiality.\n\n**Profound Mystery**\nThe Upper Mystery subtly communes with the Lower Mystery—\n\nThe Upper Mystery is the gate; the Lower Mystery, the barrier. If the Upper Mystery does not cease, then the lower desires are difficult to eliminate—thus it is said that upper and lower subtly commune.\n\nMovement and stillness have ever been of one nature. In motion and rest, above and below respond, their qi interflowing—hence the illumination of the Profound Mystery, discussed here in tandem with the mind’s method. As when the dragon’s chant summons clouds, or the tiger’s roar stirs wind, all follow their kind and find their place. Thus the Upper and Lower Mysteries, in application, are equal to the mind’s method, mutually aiding and assisting—all is of one principle.\n\nDiminish and nurture the Upper Mystery to bring about its dissolution. Through single-minded focus, gradually seek this dissolution. Laozi said: “A tree of arm-spanning girth grows from a tender shoot; a nine-tiered terrace rises from heaped earth.” Thus the process of diminution and nurture follows the same pattern. When cultivation reaches the spirit, harmonizing qi with the true, the embryo is complete—then naturally the heart follows the breath to its end, and qi arises with each exhalation. As the dusty realms dissolve, all entanglements are severed.\n\nThe *Treatise on Embryonic Breathing* states: “The embryo forms within primordial qi; warmth is born from the nose.” All lies in the single-minded application of dissolution—hence it is known as daily renewal. This is what is meant.\n\nThe Lower Mystery achieves the same merit—Laozi said: “What follows one after another.” As for the Yin Elixir, many deceive contemporary practitioners; those who truly attain it are few, while those who lose it are many. Most transmissions contain errors. Few attain it, while many who rely on flawed texts meet early death, failing to embody the original source and mistaking falsehood for truth. Once the mind stirs, it is like wildfire fed with flames—once ablaze, how can it be steadied? Thus the profound subtleties of the Dao arise from the mind’s method. If agitation stirs, qi surges wildly—how can this initial practice of the Dao instead harm life? Without understanding the deeper meaning of the *Double Mystery*, one vainly exhausts the efforts of Yin Elixir. To speak of the flavorless as if it were flavorless is also futile. If it is truly flavorless, why practice at all? Hence it is said to be futile.\n\nThe *Yellow Court Classic* states: “For long life, be most cautious in the bedchamber—haste turns life into death, making the spirits weep.” The perfected ones of Wangwu, Luo, Hu Gangzi, Yuanyang, and other immortals did not solely rely on Yin Elixir. They employed the mutual fusion of Dao and body, the method of spirit concentration. If beginners force themselves to practice, they may die prematurely, drifting ever farther from the Dao. The farther one drifts, the more the Dao manifests—how then can life endure? Thus the method of Yin Elixir was originally for transcending the dusty world. The ancient sages, fearing that true practitioners might not fully grasp it, presented it as an ordinary path, revealing the wonders of Yin Elixir. Its principle models heaven and earth, ascending yin and descending yang. What it forbids is the unruly mind, for when a man engages with a woman, he first loses his essence—practicing thus brings illness and hastens death. External factors such as the phases of the moon, wind and rain, hunger and satiety, joy and anger, exertion and rest must also be avoided. When a woman has her menstrual cycle, the six days following are governed by the three yang numbers—union during this time produces a son; the three yin numbers produce a daughter. In a month, these six days require both partners to descend in harmony to achieve success. From these calculations of yin and yang, one may also discern poverty and wealth, nobility and lowliness—its principles are self-evident.\n\n**Mysterious Pass**\nThe Pass that excels at closing cannot be opened—Laozi said: “One who excels at closing needs no bolt, yet none can open it.” The Mysterious Pass is not merely the heart; if one understands the method of skillful closure to penetrate the profound, only then does it earn the name of Mysterious Pass. The art of skillful closure is the method of the mind-ground. Thus the numinous youth may come and go freely. The numinous youth is the title of one who attains the Dao. If one grasps the principle of the Mysterious Pass, one comprehends the way of skillful closure. Whether coming or going, one masters the essential method and attains lightness and ease. Once the six dusts are severed, the path of mystery opens. The six dusts are the eyes, ears, nose, tongue, body, and mind—each has perceptions that stain them. Thus the Mysterious Pass excels at closure to dissolve these illusory dusts. Where the will reaches, mystery upon mystery unfolds. From this, life and death no longer pertain. Without the stains of dust and perception, how can there be attachment to coming or going? When mind and method are both forgotten, gain and loss dissolve together.\n\nMaster Xizhen said: “A hundred evils cannot disturb its rectitude; a thousand movements cannot disturb its clarity.” Thus life and death do not pertain to it.\n\n**Mysterious Pearl**\nHow can the Mysterious Pearl be compared to worldly pearls? It is not a pearl outside the body, like a jade disk—hence it is said to be easily sought. The rhapsody states: “Movement is the pivot of the Dao; stillness is the lotus of the heart. Jade light does not shine, yet the utmost truth does not waver.” Those who awaken will know it as the tally of life. If one comprehends the profound principle of the pearl, one understands the essential convergence of life and thus holds the tally. Unobscured and unclouded, it responds to transformations—Laozi said: “Unobscured and unclouded, mystery upon mystery.” This reveals the original substance of the Mysterious Pearl, which corresponds and changes. Movement becomes a flaw, entangling and obstructing. When the mind moves, it chases after conditions—this is the flaw of the Mysterious Pearl. Thus it is said: “Movement becomes a flaw, entangling and obstructing,” and the Mysterious Pearl cannot become perfectly luminous.\n\n**Gate of the Mysterious Female**\nThe Gate of the Mysterious Female is the numinous pass of communion with truth. The Mysterious Gate is the abode of spirit; the Female Gate is the great pass. This is the great essential of cultivation—hence it is called the numinous pass. Laozi said: “The valley spirit does not die; this is called the Mysterious Female. The gate of the Mysterious Female is called the root of heaven and earth.” Without awakening to the Gate of the Mysterious Female, the practice of life-cultivation becomes difficult. If one does not grasp its principle, treating spirit and essence as the lock and key, then the endeavor of cultivation has no foundation. Those who practice haphazardly, like rowing against the current, may apply effort but fail to reach the true Dao. Laozi said: “Governing a great state is like cooking a small fish.” The principle of balancing firmness and gentleness must be properly applied. Only after passing this rapids are there no more rapids. Once effort is perfected, one forever leaves worry and toil, dwelling in constant tranquility—hence it is said there are no more rapids.\n\n**Mysterious Gate**\nThe nine caves and three mountains are known to few.\n\nThe nine caves and three mountains are the islands within the sea, where immortals gather and reside. Those who have mastered the profoundest learning often conceal themselves there, and thus these are cited to illustrate the origin of attaining the Dao, revealing that the Mysterious Gate is the pivotal essence of life-cultivation. The nine caves and three mountains also symbolize the three elixir fields and nine orifices of the human body. One must traverse this path to study and refine the truth.\n\nShould one follow the Mysterious Gate to its end, all paths converge as one; if lost, every movement becomes misguided. Below, it connects to the Purple Palace and the Florid Canopy—the Florid Canopy being the lungs, the Purple Palace the kidney palace and sea of qi. For the Mysterious Gate’s opening and closing all correspond in resonance.\n\nGaining or losing, transcending the mundane is not transcending the mundane. If one attains the subtlety of the spirit’s abode, it endures—hence it is called transcending the mundane. If one loses the root of pure simplicity, wandering through the six destinies, it is said not to transcend the mundane.\n\n**Gate of the Mysterious Female**\nAll orifices open because the Mysterious Female’s gate opens. The Mysterious Female’s gate is the great pass. When all orifices unfold, even the sinews, vessels, five viscera, and life-pass all respond in unison. Yet if one remains unaware as qi and fluids ebb, leading to decline and aging, how can one uphold the Dao and seek life?\n\nSpirit and essence depart from here as if hastened. Once the Mysterious Female’s gate opens, it drains essence and qi. When essence and qi are depleted, the spirit gradually darkens, and perilous decay ensues.\n\nSecuring the pass and pivot is foremost. Those who cultivate life must first close the heavenly pass, making this their primary task. Those who are deluded often invite calamity. If one fails to comprehend the principle of opening and closing, merely indulging in sensory pleasures, then myriad misfortunes arise, cold and heat invade, and even the crown of the head perishes—all stemming from this.\n\n**Cutting Off the Single Source**\nCutting off the single source is a subtle matter: severing the yin path to open the yang gate is the initial mechanism of the Dao. Laozi’s *Treatise on Embryonic Breathing and Subtle Essence* states: “Mysterious and yet more mysterious is my life’s gate.” The *Classic of the Unseen Correspondence* also says: “Cut off the single source, and one’s strength becomes tenfold. Thrice returning day and night, one’s strength becomes a hundredfold.” Without effort, one gains a hundredfold advantage—this is the cutting off of the single source.\n\nHarmonizing and preserving the white principle governs the spirit’s mechanism. Harmonizing means regulating the source; preserving lies in the spirit’s mechanism operating in accord. If one remains attached to old habits, if thoughts are not extinguished and restraint is lacking, allowing dissipation to come and go, this is not the Dao.\n\nIn an instant, conflict arises, and right and wrong appear. If spirit and qi move chaotically, giving rise to reckless actions, then turmoil and discord emerge, becoming the source of errors.\n\n**Heart**\nDefiled and following conditions, even sages cannot fathom it. The heart is the function of nature. Following conditions and being stained by circumstances, arising and ceasing without constancy—even sages cannot exhaust its depths.\n\nYet all methods and teachings ultimately communicate through it. Countless methods, from transcending death to entering life, are all cultivated through the heart, and none reach completion without it.\n\nRight and wrong, gain and loss all arise from this. All matters of right and wrong, whether grasped or abandoned, whether deluded or awakened, originate here. Returning to the root and reverting to the source, the Dao becomes ever more congruent. Returning to the root and reverting to the source, the Dao is the convergence of all scriptures; uniting with the Dao, one becomes one with it.\n\n**Nature**\nNature is the heart’s origin, sharing the same path. Nature cannot be seen; it is revealed through the heart. The heart does not manifest itself; it arises through nature. Since it arises from the heart, it is said to share the same path.\n\nRecognize the primordial yang to control the pivot of movement. Primordial yang is the qi of primordial harmony. It can restrain restlessness, thus serving as the pivot. This fully clarifies the heart’s method.\n\nRelying on the congealed body, it is established. Just as one depends on a house to avoid wind and frost, nature relies on the physical form to be established. Yet the heart, returning, arrives at emptiness and nothingness. When the heart accords with the wondrous track and practices the method, it is said to return to the wondrous emptiness of the origin.\n\nMovement is the heart—yet it moves without truly moving. Its movement responds to conditions, adapting without obstruction. Regarding the principle of all phenomena from beginning to end, knowing the arising and ceasing of others’ hearts, its subtlety is immeasurable, its merit unfathomable.\n\nTransformation is without transformation, designation without designation. In the mundane, it is called deluded thoughts swirling; in the sage, it is called the functioning of the true origin. In stillness, it is nature—yet stillness is not true stillness. The Dao of vanishing transformation, the mechanism of ceasing response, neither stained nor soiled, without dust or defilement.\n\nThe radiant true wind of the lofty sages flows boundlessly; the transformation of the utterly deluded returns to the root, towering and majestic. The matter is real, yet words cannot describe it; the Dao is exalted, yet its principle is hard to convey. The past and future boundaries are empty, resplendent in the vastness of the primordial, blending into the harmony of virtue. Within the wondrous lies the most wondrous, the mysterious within the mysterious. This is returning to the source of transformation, exhausting principle and fulfilling nature, where change is unfathomable.\n\n**Dharma**\nThe Dharma is fundamentally wordless, yet its principle is naturally thus. Unbound by movement or stillness, its principle remains ever thus. Yet it is known to be the pivot of all scriptures. The myriad treatises and thousands of sutras set forth by sages cannot exhaust the Dharma, for it is the essential pivot.\n\nIf one has keen insight into the profound subtleties, grasping the deep essence within the mysterious, this is the true principle of the Dao. Secretly, it becomes the wondrous talisman within the heart. The Dharma is the wondrous talisman of the heart’s source, the great essential for arising and ceasing in life and death. It cannot be lightly sought or arrogantly pursued, nor known through restlessness, nor learned through error, nor attained through recitation, nor reached through traversal.\n\nThough brightness and obscurity differ, it remains unchanged through ancient and modern times. The *True Word Secret* states: “To depart from death, first depart from life.” The principle of departure and retention is embodied and applied. Thus, the supreme perfected masters and the Most High’s Void Tradition may elucidate the three hearts or nine hearts, or reveal the one Dharma or myriad Dharmas. As for the imperial elixir formulas and the Jade Writ of the Azure Lad, their principles have a true return, their original source is without error. Clinging to stagnation and misapplying regulation, one cannot penetrate the wondrous; only by directly revealing the subtle and imperceptible can one grasp it.\n\nThe remaining transformations of the body and flights of form, the nurturing of the immortal embryo and the securing of life—even the mutual borrowing of the five phases, the constancy of movement and stillness, and the mutual Dao of the three bodies—all these are but branches and leaves, never reaching the root and trunk. This arises from receiving the Dao from teachers of varying depth, leading to attachments in principle based on what is seen and heard. One should earnestly seek deliverance, undaunted in seeking instruction and verification.\n\n*Yangsheng Yongxuan Ji* #1\n(Original text had 『而』; emended to 『致』 according to context.)",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "养生咏玄集 经名：养生咏玄集。 不着撰人。 一卷。 底本出处：《正统道藏》洞神部方法类。 养生咏玄集序 夫咏玄者，乃咏玄中深奥也。 窈冥取理，恍惚求真，撮众妙之英华，采群经之要会。 言止直而义．正，道入重玄； 旨似远而意明，风存上祖。 引龙虎同归之躁竞，显玄牝绝利之玄微。 直示指归，立成妙用。 正演开遮之说，明分去就之元。 回玄包罗，升沈浩渺。 故使下士抚掌，上士勤行，克成於神气全真，冀泯於根尘妄照。 诚知珠玉兮何重，性命兮何轻，宁不穷解分息动之玄，而纵流光走魄之逝，深可悲哉！ 此咏玄诗，实长生度世之法要也。 至如玄元帝之灵篆，常秘枕中； 淮南王之神方，密藏肘后。 盖上圣所遵所重乎至言也。 学者值遇，宜须秘慎，深自惜焉。 养生咏玄集 荣卫气 二气相成道始生， 夫姿形立兆，未有独分一气而获着生。 盖荣卫调和，方生存也。 故云二气相成始生者，道也。 道者，生也。 故老子云，道不可见，因生以明之。 生不可常，用道以守之。 浑融同处一源行。 二气浑融之谓，和气同处一源，以其生生也。 阴阳感激相须理， 禀二气而兆形质、含二气而着生成，此皆感激阴阳，资养性命。 不得和柔即战争。 忽二气争竞，不相和柔，即勃乱五脏，而息生焉。 故经云：阴疑於阳爻战。 是知无全阳之男，全阴之女。 故天为全阳而阴露，地属全阴而抱阳精。 盖天地阴阳相须，而化生万物。 《易》云乾男坤女，故人伦亦全法天象地矣。 荣气 荣气生来不独分， 荣气者，清阳也。 《内观经》云：气清而驶谓之荣。 在人身中不可独建，故不独分也。 清阳虚在赖阴存。 阴气聚而阳托，阳气存而阴赖。 故日阳赖阴存，以相成也。 从兹始得成胚兆， 夫二气相感，始成於胎孕。 解胎而生，亦自有荣气之始也。 炼取归元别有门。 於二气中淘炼，归於本源纯一清冷之气，别修除滓秽，成全阳，而荣与道同真矣。 卫气 卫气元从阳气来， 卫者，浊也。 《内观经》云：气浊而迟谓之卫。 本因元气交感方有形躯，既有形躯，士明卫气，故卫从荣来。 色身兆合处胞胎。 形质既兆，即禀二气之所感，处於胞胎也。 暗符天地排宫室， 人之一身，暗象天地。 故《内观经》云：眼为日月，发为星辰，眉为华盖，头为昆仑，布列官阙，安置精神。 此之谓也。 自此澄凝细可裁。",
      "translated_text": "**Yangsheng Yongxuan Ji**\n\n**Title:** *Yangsheng Yongxuan Ji* (*Chanting the Mysteries: A Collection on Nurturing Life*). Author unknown. One fascicle. Based on the text from the *Zhengtong Daoist Canon*, *Dongshen* section, Methods category.\n\n**Preface to *Yangsheng Yongxuan Ji***\nTo \"chant the mysteries\" is to intone the profound depths of the unseen. By delving into the obscure to grasp principle and seeking truth in the indistinct, one gathers the essence of all wonders and distills the essential convergence of the myriad scriptures. The words are direct yet their meaning upright, the Dao entering the realm of profound mystery; the purport seems distant yet its intent is luminous, its influence preserving the legacy of the highest ancestors. It guides the restless striving of dragon and tiger toward unity, revealing the subtle mysteries of the Dark Female, free from all grasping. It directly points to the ultimate return, establishing wondrous efficacy. It rightly expounds the teachings of opening and closing, clarifying the fundamental distinctions between departure and approach. Encompassing the revolving mystery, it ascends and descends in boundless vastness. Thus, the inferior scholar claps in delight, while the superior scholar diligently practices, perfecting the integrity of spirit and qi to ultimately dissolve the illusory reflections of root and dust. Truly, how heavy is the pearl and jade, how light the nature and life! Would one not exhaustively unravel the mystery of stilling movement and calming the breath, only to indulge the fleeting passage of radiant light and the departure of the soul? How deeply lamentable!\n\nThese chants of the mystery are indeed the essential methods for attaining longevity and transcending the world. Such as the sacred talismans of the Mysterious Origin Emperor, forever concealed within the pillow; the divine formulas of the Prince of Huainan, secretly stored behind the elbow. These are the most revered and treasured words of the highest sages. Should a scholar encounter them, they must guard and cherish them with utmost secrecy and care.\n\n**Yangsheng Yongxuan Ji**\n\n**Rong and Wei Qi**\nThe two qi complete each other, and the Dao begins to arise.\nForm and appearance take shape, yet none exists solely from one qi alone.\nOnly when *rong* and *wei* are harmonized does life persist.\nThus it is said: the two qi complete each other to give birth—this is the Dao.\nThe Dao is life.\nAs Laozi said: the Dao cannot be seen, so it is revealed through life.\nLife cannot be eternal, so the Dao is employed to preserve it.\nIntermingled, they flow from a single source.\nThis is the fusion of the two qi—harmonious qi dwelling together in one origin, for they perpetually generate.\nYin and yang stimulate and depend on each other.\nReceiving the two qi, form and substance take shape; containing the two qi, life and growth are established. All this arises from the mutual stimulation of yin and yang, which nourishes nature and life.\nWithout harmony and gentleness, there is conflict.\nIf the two qi contend and fail to harmonize, they stir disorder in the five viscera and extinguish life.\nThus the *Classic* states: \"When yin hesitates at yang, the lines wage war.\"\nHence, there is no purely yang man or purely yin woman.\nHeaven is wholly yang yet bears yin dew; earth is wholly yin yet embraces yang essence.\nThus, heaven and earth rely on yin and yang to transform and generate the myriad things.\nThe *Book of Changes* says: \"Qian is male, Kun is female.\" Therefore, human relations fully emulate the patterns of heaven and earth.\n\n**Rong Qi**\nRong qi does not arise in isolation,\nRong qi is clear yang.\nThe *Neiguan Jing* states: \"Qi that is clear and swift is called *rong*.\"\nWithin the human body, it cannot stand alone, hence it does not arise in isolation.\nClear yang, empty and subtle, depends on yin for its existence.\nYin qi gathers, and yang rests upon it; yang qi abides, and yin relies on it.\nThus it is said: yang depends on yin for its existence, for they complete each other.\nFrom this, the first signs of the embryo take form.\nWhen the two qi interact, the fetus begins to take shape.\nUpon leaving the womb, life begins with the inception of rong qi.\nRefining it to return to the origin follows a distinct path.\nAmid the two qi, one refines and returns to the original source of pure, unified, and serene qi. By separately cultivating and removing impurities, one achieves the fullness of yang, and rong unites with the Dao in truth.\n\n**Wei Qi**\nWei qi originally arises from yang qi.\nWei is turbid.\nThe *Neiguan Jing* states: \"Qi that is turbid and slow is called *wei*.\"\nIt fundamentally arises from the interaction of primordial qi, which gives rise to the physical body. Once the body exists, the nature of wei qi becomes evident, thus wei derives from rong.\nThe colored body takes shape within the womb.\nOnce form and substance emerge, they receive the influence of the two qi and dwell within the womb.\nSilently mirroring heaven and earth, it arranges the palaces.\nThe human body subtly reflects the pattern of heaven and earth.\nThus the *Neiguan Jing* says: \"The eyes are the sun and moon, the hair is the stars, the eyebrows are the canopy, the head is Kunlun. The palaces are arrayed, and the spirit is settled.\"\nThis is what is meant.\nFrom this, it condenses and refines with exquisite precision.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 958,
      "start_sentence": 0,
      "end_sentence": 65,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.063347816467285,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养生咏玄集.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "自此精血澄凝，以成形质，细可裁量，以通其用。 盖人之卫气，几有二名：一者精血澄凝，以成形质。 二者同荣气流行，而通手生也。 是知人之身者，因示修真之地，得乎最灵之称。 可不惜而怠惰，而求於逝也。 其卫气亦象三才，一者澄凝以成形质，象地也； 二者荣卫合处，日冲和之气，象人也； 三者真精命带，居上丹田全阳之官，以象其天也。 禀此三气，以通其生，而道自归之，体三才而履道也。 魂魄 是故二气含和即着生，魂者，阳真精也； 魄者，阴真精也。 二精处乎泥丸官，以带二气，不相离渍，而神明居之，生方着也。 老子曰：万物负阴抱阳，以成其道。 始名魂魄应真灵。 子产曰：人始日魄，既生场日魂。 是故二气发生，莫非魂魄而应真灵。 及其生也，万变千化，有生有死，无超跃三清，漂沦诸趣，得丧之机，实在此矣。 在天日月全通象， 日月者，天地魂魄也。 故魂者为日，主昼，天真精也。 魄者为月，主夜，地真精也。 是知明暗同源，往来通会。 盖人之魂魄，全通象於日月也。 淮南王曰：天之气成魂，地之气成魄。 又《五藏内镜》云：父之精气为魂，母之精气为魄。 其理昭然矣。 万化皆从守一宁。 万化者，盖心之所灭，而运役魂魄，着於生云。 故圣人设千经万卫，教化群品，显是守一之法，而息诸妄也。 魂 阳精魂主号神金， 魂者，阳真精也。 故阳精是神之金，圣人为之法体，递相系属，以通真也。 韩子云：非至精不能变至神。 抱朴子云：老君者，天之魂，感日精而孕，化成兆身，故显至阳之精也。 感应潜符运用心。 心动即气转，故云潜符，以明感应也。 若使圆通诸妄息， 若息诸妄，。 至於圆通，即气以合於神，而生变也。 灵光照耀脱全阴。 真精既备乃合灵，逍遥不夜，即脱坼金阴之质。 故圣．人禀御，以通灵变也。 魄 阴气冲融应感阳， 境动宜其心，而成感激也。 二来和会致流浆 二气既投，弗可致也。 穷玄偶此非真用， 穷玄者，随境放逸，致二气乖荡，即非真用之法，违道之真理也。 魂不飞扬魄不妨。 魂不飞扬魄不妨者，应心之用也。 魂既不飞，魄亦不应，盖心为去留之辖气，是生死之基，而修生之理，非此者未之有也。 谷神 圣祖函关显谷神。",
      "translated_text": "From this, essence and blood congeal and refine to form substance, so finely wrought as to be measurable, thus fulfilling their function.\n\nNow, human *wei* qi possesses two designations:\nFirst, essence and blood congeal and refine to form substance.\nSecond, it flows in unison with *rong* qi, circulating to sustain life.\n\nKnow then that the human body serves as the ground for cultivating the true, deserving its title as the most numinous of beings.\nHow could one fail to cherish it, grow indolent, and seek what flees?\n\nThis *wei* qi also mirrors the Three Powers:\nFirst, congealing and refining to form substance, it images Earth;\nSecond, where *rong* and *wei* unite, the daily harmonizing qi images Man;\nThird, the true essence of life resides in the Upper Cinnabar Field, the palace of pure yang, imaging Heaven.\nReceiving these three qi to sustain life, the Dao naturally returns to it, for the body embodies the Three Powers and treads the Way.\n\n**Hun and Po**\nThus, when the two qi contain harmony, life takes root.\n*Hun* is the true essence of yang;\n*Po* is the true essence of yin.\nThese two essences dwell in the Mud-Pill Palace, bearing the two qi without separation, and the spirit abides within them—thus life takes root.\n\nLaozi said: \"The myriad things bear yin and embrace yang, achieving harmony through the Dao.\"\nAt first, they are called *hun* and *po*, responding to the true numen.\n\nZichan said: \"At birth, one is called *po*; once alive, one is called *hun*.\"\nThus, the arising of the two qi is none other than *hun* and *po* responding to the true numen.\nYet in life, with its myriad transformations and changes, there is birth and death—none transcend the Three Clarities, drifting through the various destinies. The pivot of gain and loss lies precisely here.\n\nIn heaven, the sun and moon fully manifest their images:\nThe sun and moon are the *hun* and *po* of heaven and earth.\nThus, *hun* is the sun, governing the day, the true essence of heaven;\n*Po* is the moon, governing the night, the true essence of earth.\nKnow then that brightness and darkness share a single source, circulating and communicating.\nThus, the *hun* and *po* of humans fully manifest their images in the sun and moon.\n\nThe Prince of Huainan said: \"The qi of heaven forms *hun*; the qi of earth forms *po*.\"\nThe *Neijing of the Five Viscera* also states: \"The father’s essence becomes *hun*; the mother’s essence becomes *po*.\"\nThis principle is manifestly clear.\n\n**The Myriad Transformations All Arise from Guarding the One**\nThe myriad transformations are but the heart’s extinguishing, driving *hun* and *po* to manifest in life.\nThus, the sages established countless scriptures and teachings to instruct the multitudes, revealing the method of guarding the One to still all delusions.\n\n**Hun**\nThe yang essence of *hun* is called \"spirit-metal.\"\n*Hun* is the true essence of yang.\nThus, yang essence is the metal of spirit, and the sages made it the dharma-body, linking and transmitting it to communicate with the true.\n\nMaster Han said: \"Without utmost essence, one cannot transform into utmost spirit.\"\nBaopuzi said: \"Laozi is the *hun* of heaven, conceived by the essence of the sun, transforming into a wondrous body—thus manifesting the essence of utmost yang.\"\n\n**Resonance and Hidden Signs Operate in the Heart**\nWhen the heart moves, qi turns—hence it is called \"hidden signs,\" clarifying resonance.\nIf one attains perfect penetration by stilling all delusions,\nqi unites with spirit, and transformation arises.\n\n**The Numinous Light Shines, Shedding All Yin**\nOnce true essence is complete and numinous union achieved, one roams freely in the unending light, shedding the golden yin substance.\nThus, the sages received and mastered it to communicate with numinous transformation.\n\n**Po**\nThe yin qi surges and blends, responding to yang.\nWhen circumstances stir the heart, resonance arises.\nWhen the two come together, harmony flows like nectar.\n\n**Pursuing the Mysterious Here Is Not True Application**\nPursuing the mysterious through reckless indulgence causes the two qi to diverge—this is not the method of true application, but a violation of the Dao’s true principle.\n\n**Hun Does Not Soar, Po Does Not Hinder**\nWhen *hun* does not soar and *po* does not hinder, they respond to the heart’s function.\nIf *hun* does not fly, *po* does not respond—\nfor the heart governs departure and abiding, the root of life and death.\nThe principle of cultivating life is found nowhere else.\n\n**Valley Spirit**\nThe Sage Ancestor at Hangu Pass revealed the Valley Spirit.",
      "overlap_context": "b.\nOnce form and substance emerge, they receive the influence of the two qi and dwell within the womb.\nSilently mirroring heaven and earth, it arranges the palaces.\nThe human body subtly reflects the pattern of heaven and earth.\nThus the *Neiguan Jing* says: \"The eyes are the sun and moon, the hair is the stars, the eyebrows are the canopy, the head is Kunlun. The palaces are arrayed, and the spirit is settled.\"\nThis is what is meant.\nFrom this, it condenses and refines with exquisite precision.",
      "start_char": 959,
      "end_char": 1875,
      "start_sentence": 66,
      "end_sentence": 121,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.907628774642944,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养生咏玄集.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "圣祖於函关，为关令尹喜说《 道德经》 五千言，指象立· 端，显明谷神，削其浮讹以彰玄妙也。 深微历代事长新。 义理深微，卒何穷究？ 纵多分晓，莫尽洪源，故云深微。 历代事长新，言经文玄邃者也。 若於己上披寻得， 思理弃言，崇於己上行持之法，匪於谷外也。 便是今生了悟人。 契悟者不拘优劣及有无之分，若颖悟即一生了次，果陶属论於诸生也。 谷 因何隐至灵， 谷者，二气孕化之兆也。 都绿谷内抱真精。 真精者，二气之精。 莫处乎泥丸官，此乃因兹隐至灵。 若精散，即神去也。 如从得所相包系， 神气相须，各不离渍也。 和会依凭始有声。 和会各相依凭，以成其体。 既和会感至灵，即方明着生，即有声言者也。 神 板寂犹来无所依， 阗寂者，幽寂也即言神之未处四大，怛游太极，无所依附，及降兆於身始明，灵即立生，有道本体象乾坤。 几生行藏，皆能通应。 老子云：视之不见，听之不闻，搏之不得。 又《易》曰：阴阳不测之谓神。 即知其不以意度，宁足以言诠而明之也？ 因过玄谷众神归。 既过玄谷，眼即视色，耳能听声，鼻能嗅香，舌能别味，意怀贵爱，身受寒温，灵变多端，故云众神归也。 子今认得还元路， 返本还元之道，灭心抱一之法，铃在事兼道，匪多事而至也。 不计程途迥细微。 非步涉程途，以明其要，莫不探啧远妙，体用双明合道也。 返本还元 气衰形悴少精神，",
      "translated_text": "At Hangu Pass, the Sage Ancestor expounded the *Dao De Jing*’s five thousand words to Yin Xi, the Pass Keeper, establishing principles through images and revealing the Valley Spirit. He stripped away superficial distortions to illuminate its profound mysteries. Its meaning runs deep and ever-renews through the ages. How could its subtleties ever be exhausted? Even with great clarity, none can fathom its vast source—hence it is called \"deep and ever-renewing.\" This speaks of the sutra’s profound obscurity.\n\nIf you seek it within yourself,\ncasting aside words to grasp the principle and upholding the method of practice within—this is not found beyond the Valley.\nThen you are one enlightened in this very life.\nSuch realization transcends distinctions of superiority, inferiority, or existence and nonexistence. If one is truly perceptive, enlightenment may dawn in a single lifetime, for the alchemy of fruition belongs to all beings.\n\n**Why Does the Valley Conceal Such Marvelous Spirit?**\nThe Valley is the sign of the two qi’s nurturing transformation.\nAll depends on the Valley’s embrace of true essence.\nTrue essence is the essence of the two qi.\nIt does not reside in the Mud Pill Palace—this is why the Valley conceals such marvelous spirit.\nIf essence scatters, spirit departs.\n\nOnly when they find their proper interdependence,\nwhen spirit and qi rely upon each other, inseparable and undissipated,\ndoes their union give rise to sound.\nWhen they unite and resonate with the marvelous spirit, life becomes manifest—then words arise.\n\n**Spirit**\nProfoundly still, it comes without reliance.\nIn utter tranquility, before it inhabits the four great elements, spirit roams the Supreme Ultimate, unattached. Only when it descends into the body does the marvelous become evident, life take root, and the foundational form of the Dao mirror heaven and earth.\nThrough countless lifetimes, in action and repose, it responds with perfect clarity.\n\nLaozi said: \"Invisible when seen, inaudible when heard, intangible when grasped.\"\nThe *Book of Changes* states: \"That which cannot be fathomed in yin and yang is called spirit.\"\nThus we know it cannot be measured by thought—how could words ever fully express it?\n\n**Passing Through the Mysterious Valley, the Multitude of Spirits Return**\nHaving passed through the Mysterious Valley,\nthe eyes perceive form, the ears hear sound,\nthe nose detects fragrance, the tongue distinguishes taste,\nthe mind cherishes desires, the body senses cold and heat—\nits transformations are manifold, hence it is said \"the multitude of spirits return.\"\n\n**Now You Recognize the Path of Returning to the Origin**\nThe Way of returning to the origin,\nthe method of extinguishing the heart and embracing the One,\nlies in uniting practice with the Dao—not through excessive effort.\nIt does not depend on traversing distant paths.\nIts essence is not remote or subtle;\nboth substance and function are illuminated, merging with the Dao.\n\n**Returning to the Origin**\nWhen qi wanes and form withers, spirit diminishes.",
      "overlap_context": "es the two qi to diverge—this is not the method of true application, but a violation of the Dao’s true principle.\n\n**Hun Does Not Soar, Po Does Not Hinder**\nWhen *hun* does not soar and *po* does not hinder, they respond to the heart’s function.\nIf *hun* does not fly, *po* does not respond—\nfor the heart governs departure and abiding, the root of life and death.\nThe principle of cultivating life is found nowhere else.\n\n**Valley Spirit**\nThe Sage Ancestor at Hangu Pass revealed the Valley Spirit.",
      "start_char": 1876,
      "end_char": 2481,
      "start_sentence": 122,
      "end_sentence": 157,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.917710304260254,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养生咏玄集.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "人之衰老，为染嗜欲，以致伤败，而多砠落。 《西升经》云：如木自出火，还复自烧腐。 又《阴符经》云：心生於物。 此之谓也。 返本还元是最真。 气全神备，道可克成。 太白真人云：老者复丁，壮者返婴。 此盖明返本而还元者也。 补过功成方渐契， 补过者，为补从来耽淫销削之过，补之功成，方契返本之道也。 复知大患即吾身。 复知者，重明返本还元也。 返本还元几有二，初明补过，谓求全气而返真。 次云复知者，以其本乃归乎本元。 老子云：吾有大息，为吾有身。 及吾无身，吾有何息？ 依此而论，故老子不以全身为至也。 神与气合 神气相须不去离， 夫神之无气，若鱼之去泉，气之去神，如灯之无火，不可去离也。 深明翻恐世人疑。 将神合气，化入无形。 有无之理，亦不执滞。 若深明之，广学者疑惑，盖人有智识，明昧浅深者也。 且绿凡圣行持别， 圣人不视外色，不听外声，不思外事，神凝气合，几俗以责坏为心，劳神役智。 故圣人行神与气合之事也。 非绝神炉安得知。 傥去就之未归，即神气之不合，实如猫捕鼠，同声相应，同气相求。 自此则可结胎育婴，换帑之臭质，回颜返老，炼冗冗之凝躯。 或发火以焚身，或化金而成骨，或则脱落滓滞，或则凝撮真如，入不二之玄门，尽无穷之至理。 是知神与气合，方有滋应用，随其所归，是非深浅，而通变化之道者也。 抱 深玄抱一事为宗，神气相抱，混而为一之宗。 老子日：抱一为天下式。 又云：善抱不脱，善计不用筹策。 又庄子云：通於一，万事毕也。 未了真元道不通。 未请軏辖，宁得通和？ 心地虚无方见谛， 虚无者，虚无其心也。 故老子十三，《虚无经》所载，盖显五千文中生之徒十有三。 十三者，全明生之徒也。 所明十三，总归於虚以为善。 既心地虚无，以求抱真一也。 信知万物用非同。 学者多途，玄陈各异。 故云万物之用不同，虚无抱一之道者也。 胎息 用得冲和道自全， 冲和者，二气混同，荣卫合处。 若用及网卫，则契最玄之理，而着於会通，生道余也。 适名胎息理幽玄。 谓契重玄之理，即明真住之法也。 处胞赤子何当契， 靡由百谷，生自何存？ 细审行持法自然。 了认赤子之道，可明胎息之机。 自然理会神凝，心通念绝。 盖圣人禀之而生，凭之而成，苟不得其要枢，即难除其大息。 指归之路，届兹而无法可言，返本之源，应用而有期铃契。 体而用之，爻无·差失。 栖真子云：我气内闭我身长宁。 几修胎息之法，皆是自然之道，保任真息绵绵，来往微微，不得令静躁不怛，自以求乎安也。 昼夜修行不断，日往月来，真人自不出户。 若得真全胎结，其道至矣。 老子日：绵绵若存，用之不勤。 此理明绝诸虑，以定其至，而生慧昭然也。 若至定位，即生定水，灌溉五脏，生光华。 此日真水，非乎涎浊之液唾，此去留形住世之法要。 三住铭云：心若住，气亦住，气若住，形亦住。 三者尽住，即我命在我，不在於天矣。 自然 水性谦柔火性刚， 水火各属自然，盖论水火相生之理，以明神气自然之道也。 就卑炎上各相当。 就卑者，水之性，炎上者，火之体。 故气能蒸上，液能润下。 二物递相交感，气上蒸以生液，液下润而生气，固养一身，自兹感化。",
      "translated_text": "**Human Decline and the Return to the Origin**\nHuman decline and aging arise from the stains of desires, leading to injury and ruin, and thus to frequent setbacks. The *Scripture of Western Ascension* states: \"As fire arises from wood, it returns to burn the wood to ash.\" The *Scripture of the Hidden Correspondence* also says: \"The heart is born of things.\" This is what is meant. Returning to the origin is the truest path. When qi is complete and spirit is whole, the Dao may be perfected. The Perfected One of Great White Mountain said: \"The old revert to youth, the strong return to infancy.\" This clarifies the meaning of returning to the origin and reverting to the primordial.\n\n**Mending Faults and Recognizing the Great Peril**\nOnly when the work of mending faults is accomplished does one gradually align with the Dao. Mending faults means repairing the past errors of indulgence and dissipation. When this work is complete, one aligns with the path of returning to the origin. To \"recognize anew\" is to reaffirm the return to the origin. There are two aspects to returning to the origin: first, mending faults, which is seeking the fullness of qi to return to the true; second, \"recognizing anew,\" for the origin is the return to the primordial source. Laozi said: \"My great affliction is that I have a body. If I had no body, what affliction would I have?\" Thus, Laozi did not regard preserving the body as the ultimate goal.\n\n**The Union of Spirit and Qi**\nSpirit and qi must not part, for they depend on each other. Spirit without qi is like a fish separated from its spring; qi without spirit is like a lamp without flame—they cannot be separated. This is made clear to dispel the doubts of the world. When spirit unites with qi, it transforms into formlessness. The principle of being and non-being is not to be clung to rigidly. If this is deeply understood, scholars’ doubts will fade, for people differ in wisdom and clarity, some profound, some shallow.\n\n**The Distinction Between the Sage and the Common**\nThe sage does not see external forms, does not hear external sounds, does not contemplate external matters—spirit congeals and qi unites. The common person, by contrast, takes ruin as their heart and exhausts spirit through laborious thought. Thus, the sage practices the union of spirit and qi. Without severing the furnace of spirit, how could one know this? If alignment is not yet achieved, spirit and qi will not unite. It is like a cat hunting a mouse: like responds to like, and qi seeks its kind. From this, one may form the embryo and nurture the infant, transform the foul substance of the body, reverse aging and restore youth, refine the turbid and solidified form. Some ignite fire to burn the body, some transmute into golden bones, some shed impurities and stagnation, some condense true suchness. Entering the wondrous gate of non-duality, one exhausts the infinite principle. Only when spirit and qi unite do they produce responsive function. Their destination, whether profound or shallow, determines the mastery of the transformative Dao.\n\n**Embracing the Profound and Holding to the One**\nThe essential practice is embracing the profound and holding to the One—spirit and qi embracing, merging into oneness. Laozi said: \"Hold to the One as the model for all under heaven.\" And again: \"The adept holds without losing, calculates without need of counting rods.\" Zhuangzi also said: \"When one is attuned to the One, all matters are complete.\" Without comprehending the true primordial Dao, how can there be communication?\n\n**The Empty Mind Sees Truth**\nOnly when the mind-ground is empty can truth be seen. Emptiness means emptying the heart. Thus, Laozi’s *Thirteen* and the *Scripture of Emptiness* expound upon the thirteen types of those born into the world, as revealed in the *Five Thousand Characters*. These thirteen all return to emptiness as the highest good. When the mind-ground is empty, one seeks to embrace the true One. Truly, the functions of the myriad things are not the same. Scholars follow many paths, and profound teachings vary. Thus, the Dao of emptiness and holding to the One differs from the uses of the myriad things.\n\n**Embryonic Breathing**\nWhen the harmonious Dao is mastered, wholeness is attained. Harmony arises from the blending of the two qi, where constructive and protective energies converge. If one applies this to the convergence of constructive and protective qi, one aligns with the most profound principle, attaining the meeting point of life’s Dao. This is called the abstruse principle of embryonic breathing. To grasp the principle of profound mystery is to clarify the method of true abiding. How can one who dwells in the womb like a newborn child attain this? Without the hundred grains, how could life arise? Carefully examine the practice—its method is natural. Understanding the Dao of the newborn child reveals the mechanism of embryonic breathing. Naturally, one comprehends spirit’s congealment and the cessation of thoughts. The sage is born of this and relies on it to achieve completion. Without grasping its essential pivot, the great affliction cannot be removed. The path of return reaches this point where no method can be spoken, yet the source of returning aligns with its application in due time. Applying it in practice, there is no error.\n\nMaster Qizhen said: \"When my qi is inwardly sealed, my body enjoys long peace.\" The method of embryonic breathing is entirely the natural Dao. One safeguards the true breath, continuous and subtle, coming and going imperceptibly, neither allowing stillness nor restlessness to disturb, seeking only tranquility. Practicing day and night without interruption, as days pass and months turn, the true person does not leave the chamber. When the embryo is fully formed, the Dao is perfected. Laozi said: \"Subtle and continuous, it is used without exhaustion.\" This principle, when clearly understood, severs all distractions, establishing the ultimate and giving rise to luminous wisdom. When one reaches the state of stability, the water of stability is born, irrigating the five viscera and generating radiant light. This is called true water, not the turbid fluids of saliva. This is the essential method for preserving form and abiding in the world. The *Inscription of the Three Abidings* states: \"If the heart abides, qi abides; if qi abides, form abides. When all three abide, my life is in my hands, not in heaven’s.\"\n\n**Nature**\nWater’s nature is humble and yielding; fire’s nature is strong and ascending. Water and fire each belong to nature, illustrating the principle of their mutual generation to clarify the natural Dao of spirit and qi. Water descends to the lowly, fire rises to the heights—each corresponds to its nature. Thus, qi can steam upward, and fluids can moisten downward. The two interact and respond to each other: qi ascends to generate fluids, fluids descend to generate qi. Nurturing the body, they transform through mutual influence.",
      "overlap_context": "t is said \"the multitude of spirits return.\"\n\n**Now You Recognize the Path of Returning to the Origin**\nThe Way of returning to the origin,\nthe method of extinguishing the heart and embracing the One,\nlies in uniting practice with the Dao—not through excessive effort.\nIt does not depend on traversing distant paths.\nIts essence is not remote or subtle;\nboth substance and function are illuminated, merging with the Dao.\n\n**Returning to the Origin**\nWhen qi wanes and form withers, spirit diminishes.",
      "start_char": 2481,
      "end_char": 3800,
      "start_sentence": 158,
      "end_sentence": 236,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.623595237731934,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养生咏玄集.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "故名之各相当，非人所挤抑也。 交并感应皆相类， 交并者，水火相投而成感应，类象外之。 几水火，若炎釜，水气即生，盖显大道之感应，皆自然也。 莫教殊途理自长。 既知本体自然之道，故非外有所求。 且天覆地载，男生女孕，君臣父子，皆禀自然之数，非乎殊途异类之属，而能会和如此，即还丹之道昭矣！ 本元之理明矣！ 龙虎 龙虎同源躁竞时， 龙者隐显非常，有无不的，故象神之妙也。 虎者，其性劲励，其力刚强，复象气之为物也。 圣人混神气为一物也，故得制伏之机。 凡俗以内外各行，而生躁竞之息，遂政龙腾虎走，不相系属也。 祇应聚极却支离。 既立兆形，乃全其神气，皆以嗜欲所感，至於衰老脱削，元气既尽，即神无所投，致之死也，故日聚极则支离也。 先须制虎为枢辖， 欢降其龙，先须制虎。",
      "translated_text": "Thus, their names correspond precisely, not by human coercion. Their mutual interaction and resonance share a common nature—this interaction, where water and fire converge to produce resonance, mirrors external phenomena. Consider water and fire: when fire heats a cauldron, water vapor arises, revealing the resonance of the great Dao as entirely natural. Let no divergent paths obscure the principle that endures of itself.\n\nSince the fundamental nature of the Dao is self-so, nothing is sought from without. Heaven covers and earth bears; male begets and female conceives; ruler and minister, father and child—all follow the natural reckoning. Not belonging to disparate paths or distinct kinds, yet able to harmonize thus, the Way of the Returned Elixir becomes manifest! The principle of the original source is illuminated!\n\n**Dragon and Tiger**\nWhen dragon and tiger share a source in restless strife,\nThe dragon, elusive and ever-changing, neither fixed in being nor non-being, mirrors the marvel of spirit. The tiger, fierce in nature and unyielding in strength, in turn embodies the essence of qi. The sage blends spirit and qi into one, thus mastering the mechanism of their subjugation. The common folk, however, conduct them separately within and without, breeding the ceaseless agitation that sets dragon soaring and tiger fleeing, no longer bound to one another.\n\nOnly when gathered to excess do they scatter.\nOnce form takes shape, spirit and qi are preserved in full—yet allured by desires, they decline into frailty and decay. When original qi is exhausted, spirit has nowhere to lodge, leading to death. Thus it is said: when gathered to excess, they scatter.\n\nFirst, the tiger must be restrained as the pivotal mechanism;\nTo tame the dragon, first restrain the tiger.",
      "overlap_context": " yielding; fire’s nature is strong and ascending. Water and fire each belong to nature, illustrating the principle of their mutual generation to clarify the natural Dao of spirit and qi. Water descends to the lowly, fire rises to the heights—each corresponds to its nature. Thus, qi can steam upward, and fluids can moisten downward. The two interact and respond to each other: qi ascends to generate fluids, fluids descend to generate qi. Nurturing the body, they transform through mutual influence.",
      "start_char": 3800,
      "end_char": 4148,
      "start_sentence": 237,
      "end_sentence": 254,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.520007133483887,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养生咏玄集.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "故《阴符径》曰：擒之制在气。 盖全气以明其用者也。 便得龙潜两自持。 虎伏龙港，两自凭而归真一之道。 《太皇老歌》曰：虎伏龙亦港，条龙先伏虎。 但毕河车功，不用堤防拒。 盖显擒之用也。 炼阳销阴 阳炼阴销举世移， 炼阳魂销阴质也。 炼阳销阴之法，天真皇人传黄帝三一之诀，此其道也。 若神气相合，阳自炼，阴自销，此皆自然之理。 阴阳使其然哉！ 《黄庭经》云：玄元上一魂魄炼。 其理至所至玄，人罕得知其深奥，故曰举世稀也。 灵文妙诀好遵依。 灵文，金简之书； 妙诀，乃三一之法。 此皆起归秘藏，飞入玄都，非乎至人，不传斯道。 炼阳销阴之理化，本虚无之机通，云凡人何所至矣。 阳缘躁动难拘系， 歌拘系者理不偏，取道可双全，匪羁孤而成妙用也。 《玄刚》云：凡人余阳一分则不死，余阴一分则不仙也。 认取灵元上上机 灵元有上机，乃制躁动之枢要。 太白真人曰：玄机至则身存，机往则身丧也。 上丹田 宫阙重重号玉都， 玉都者，泥九官也。 上丹田有九处官阙，悉相通贯，故云官阙重重也。 还丹成就处阳炉 还丹者，真精也，上丹田乃全阳之官，独贮还丹之所，人皆有之，故云成就处阳炉也。 通神夹脊为衢道， 此官有二条豚，夹脊降下至丹田气海，以通真精，点化和气而应脱泄者也。 下应关元事不虞 关元者，乃下丹田，脱泄精气之关口也。 若人交感阴阳，则真精降下，至关口，点和气变为凝精，以应神用。 盖此关乃百聚之口，通诸脏腑及四肢筋脉，如藕丝窍，气化之所，故号关元也。 上若应下，而道者以为不虞矣。 中丹田",
      "translated_text": "Thus the *Classic of the Hidden Correspondence* states: \"To capture and control lies in qi.\" For it is by preserving qi in its entirety that its function is made manifest. Thereby the dragon lies concealed, and both hold fast. When the tiger is subdued and the dragon harbors, both rely on themselves and return to the Dao of True Unity.\n\nThe *Song of the Great Emperor Lao* says:\n*\"When the tiger is subdued, the dragon too harbors;\nFirst tame the dragon, then subdue the tiger.\nOnce the River Chariot’s work is complete,\nNo need for dikes or barriers to resist.\"*\n\nThis reveals the function of capture.\n\n**Refining yang to dissolve yin**\n*\"When yang is refined, yin dissolves—this shifts the world;\nRefining yang consumes the yin substance.\"*\n\nThe method of refining yang to dissolve yin was transmitted by the Heavenly Perfected Sovereign to the Yellow Emperor as the Three-One Oral Formula—this is its Dao. If spirit and qi merge, yang refines itself and yin dissolves of its own accord, all according to natural principle. Is it not the interplay of yin and yang that makes it so?\n\nThe *Yellow Court Classic* states: *\"The primordial One refines the hun and po.\"* Its principle is profoundly abstruse; few grasp its depth, hence it is said to be rare in the world.\n\n*\"The numinous text and wondrous formula are best followed faithfully.\"*\nThe *Numinous Text* refers to the *Golden Tablet*; the *Wondrous Formula* is the Three-One Method. These all originate from the secret treasury, ascending into the Mysterious Capital—unless one is a perfected person, this Dao is not transmitted.\n\nThe transformative principle of refining yang to dissolve yin fundamentally communicates through the mechanism of emptiness and non-being. How could ordinary people attain it?\n\n*\"Yang, by nature restless and hard to restrain—\"*\nYet to restrain it is not one-sided; the Dao may be fully realized without being fettered or isolated to achieve its wondrous function.\n\nThe *Mysterious Rigidity* states: *\"If a person retains even a fraction of yang, they do not die; if they retain even a fraction of yin, they do not become immortal.\"*\n\n**Recognize the supreme mechanism of the numinous origin**\nThe numinous origin possesses a supreme mechanism, which is the pivotal key to restraining restlessness. The Perfected Master of Grand White says: *\"When the mysterious mechanism arrives, the body endures; when it departs, the body perishes.\"*\n\n**Upper Cinnabar Field**\n*\"Palace gates layered upon layered, named the Jade Capital—\"*\nThe *Jade Capital* refers to the Muddy Pellet Palace. The Upper Cinnabar Field contains nine interconnected palace gates, hence it is said that *\"palace gates layered upon layered.\"*\n\n*\"Where the Reverted Elixir is accomplished—the Yang Crucible.\"*\nThe *Reverted Elixir* is true essence. The Upper Cinnabar Field is the palace of pure yang, the sole repository of the Reverted Elixir—all people possess it, hence it is called *\"where the Reverted Elixir is accomplished—the Yang Crucible.\"*\n\n*\"The divine passage through the spine serves as the thoroughfare—\"*\nThis palace has two channels flanking the spine, descending to the Cinnabar Field and Sea of Qi, through which true essence flows, transforming and harmonizing qi to respond to leakage.\n\n*\"Below, it corresponds to the Gate of Origin—no cause for concern.\"*\nThe *Gate of Origin* is the Lower Cinnabar Field, the gateway for the leakage of essence and qi. When a person engages in yin-yang intercourse, true essence descends to this gate, where harmonized qi coalesces into congealed essence to serve the spirit’s function. This gate is the mouth of a hundred convergences, connecting to all the viscera, the four limbs, sinews, and vessels—like the pores of lotus roots, it is the site of qi transformation, hence it is called the *Gate of Origin*. If the upper corresponds to the lower, the Daoist need not be concerned.\n\n**Middle Cinnabar Field**",
      "overlap_context": "less agitation that sets dragon soaring and tiger fleeing, no longer bound to one another.\n\nOnly when gathered to excess do they scatter.\nOnce form takes shape, spirit and qi are preserved in full—yet allured by desires, they decline into frailty and decay. When original qi is exhausted, spirit has nowhere to lodge, leading to death. Thus it is said: when gathered to excess, they scatter.\n\nFirst, the tiger must be restrained as the pivotal mechanism;\nTo tame the dragon, first restrain the tiger.",
      "start_char": 4148,
      "end_char": 4809,
      "start_sentence": 255,
      "end_sentence": 294,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.35211205482483,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养生咏玄集.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "建申令属应中田， 建申者，七月中元，亦应人之中丹田也。 一部三焦心肺肝。 三焦者，心、肺、肝也。 主喘息之府，此乃中丹田所管，故号生之府。 津液下润，而致于是也。 自有灵台驻真宰， 灵台者，五藏心之一藏也。 真神依附，以为官室，故云驻真宰也。 修持见在。 证轻安。 若知真神之动用，则修持见在证轻安，则永无忧息也。 下丹田 冲和运育下丹田， 下丹田者，脐下三寸气海是也。 冲和者，一气荣荣，气混卫气，故名和气。 其气运转於五藏、四肢，常奏於下丹田，故日气海也。 点化犹来道不玄。 心若动作，责着淫欲，即上丹田真精降至下丹田，点化和气，和气即化，遂乃弃损，而道岂玄也。 二气相投皆感应， 谓男女二情，交相感激，而有云雨施之事。 皆自然感应，乃至成于胎孕。 自真元之精成变化，在修生者宜须慎守，以求制御之法，故《太白真经》云：留精於身即生身，施精於人即生人。 移此元气结彼元气，彼既成形，此则受损，是知至慎於是也。 细寻运会地交天。 天地阴阳二气，相推而生变化。 盖阴阳有运会之理，不言而信，故云气上蒸一而雨泽，雨泽下润而万物化生。 但细推天地运合，日月回旋，以明法象，通乎无私之理。 重玄 上玄潜与下玄通，",
      "translated_text": "At the *jian-shen* command, it corresponds to the Middle Field—\n*Jian-shen* refers to the Zhongyuan Festival in the seventh month, which also aligns with the human Middle Cinnabar Field. This governs the three burners: heart, lungs, and liver. The *three burners* are the heart, lungs, and liver, the palace of respiration. As this is under the jurisdiction of the Middle Cinnabar Field, it is called the *Palace of Life*. Here, fluids descend to moisten and reach their destination.\n\nWithin stands the *Spirit Terrace*, where the true sovereign abides—\nThe *Spirit Terrace* is one of the five viscera, the heart. The true spirit anchors here as its palace, hence it is said to house the true sovereign. Through cultivation, the present is realized. Attaining lightness and peace, if one understands the movement and function of the true spirit, then cultivation manifests in the present, and with lightness and peace, all worries and afflictions vanish forever.\n\n**Lower Cinnabar Field**\nBalanced harmony nurtures the Lower Cinnabar Field—\nThe *Lower Cinnabar Field* is the Sea of Qi, three inches below the navel. *Balanced harmony* refers to the flourishing of unified qi, where constructive and defensive qi merge, hence the name *harmonized qi*. This qi circulates through the five viscera and four limbs, ever gathering in the Lower Cinnabar Field, thus called the *Sea of Qi*. Yet when the heart stirs with action, yielding to lustful desires, true essence from the Upper Cinnabar Field descends to the Lower Cinnabar Field, transforming harmonized qi. Once this qi is transformed, it is then depleted—how could the Dao remain obscure?\n\nWhen the two qi converge, all responds in resonance—\nThis speaks of the mutual arousal of male and female passions, leading to the act of cloud and rain. All arises from natural resonance, even unto the formation of conception. As true primordial essence undergoes transformation, those who cultivate life must guard it with care, seeking the method of restraint. Thus, the *Tai Bai True Scripture* states: *\"Retaining essence within the body gives life to the body; releasing essence into another gives life to another.\"* When this primordial qi merges with that primordial qi, and the other takes form, this one suffers loss—hence the utmost caution is required.\n\nExamine closely the convergence of heaven and earth—\nThe yin and yang qi of heaven and earth interact, generating transformation. Indeed, the principle of yin-yang’s cyclical movement is self-evident, as when qi rises to steam the One into rain, and rain descends to moisten, giving rise to the myriad things. Yet by closely observing the convergence of heaven and earth, the revolutions of sun and moon, one clarifies the model and comprehends the principle of impartiality.\n\n**Profound Mystery**\nThe Upper Mystery subtly communes with the Lower Mystery—",
      "overlap_context": "nd qi. When a person engages in yin-yang intercourse, true essence descends to this gate, where harmonized qi coalesces into congealed essence to serve the spirit’s function. This gate is the mouth of a hundred convergences, connecting to all the viscera, the four limbs, sinews, and vessels—like the pores of lotus roots, it is the site of qi transformation, hence it is called the *Gate of Origin*. If the upper corresponds to the lower, the Daoist need not be concerned.\n\n**Middle Cinnabar Field**",
      "start_char": 4809,
      "end_char": 5339,
      "start_sentence": 295,
      "end_sentence": 324,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.633481502532959,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养生咏玄集.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "上玄，门也； 下玄，关也。 谓上玄不止，即下欲难除也，故云上下潜通也。 动静由来事一同。 动止上下相应，而通其气，故以重玄明之，兼心法而论也。 至如龙吟云起，虎啸风生，皆以随类相从，各得其所。 故上玄下玄，应用等心法而兼济助，事同一也。 消息上玄令泯灭， 专一渐求泯灭。 老子云：合抱之木生於毫末，九层之台起於累土。 故消息亦皆如之。 若修至神，与气和真，全胎即自然心随息尽，气逐息生，尘境既消，系系都尽。 《胎息论》云：胎从元气中结，气从鼻中生温。 ＋在乎专用泯灭，故知日新。 此之谓也。",
      "translated_text": "The Upper Mystery is the gate; the Lower Mystery, the barrier. If the Upper Mystery does not cease, then the lower desires are difficult to eliminate—thus it is said that upper and lower subtly commune.\n\nMovement and stillness have ever been of one nature. In motion and rest, above and below respond, their qi interflowing—hence the illumination of the Profound Mystery, discussed here in tandem with the mind’s method. As when the dragon’s chant summons clouds, or the tiger’s roar stirs wind, all follow their kind and find their place. Thus the Upper and Lower Mysteries, in application, are equal to the mind’s method, mutually aiding and assisting—all is of one principle.\n\nDiminish and nurture the Upper Mystery to bring about its dissolution. Through single-minded focus, gradually seek this dissolution. Laozi said: “A tree of arm-spanning girth grows from a tender shoot; a nine-tiered terrace rises from heaped earth.” Thus the process of diminution and nurture follows the same pattern. When cultivation reaches the spirit, harmonizing qi with the true, the embryo is complete—then naturally the heart follows the breath to its end, and qi arises with each exhalation. As the dusty realms dissolve, all entanglements are severed.\n\nThe *Treatise on Embryonic Breathing* states: “The embryo forms within primordial qi; warmth is born from the nose.” All lies in the single-minded application of dissolution—hence it is known as daily renewal. This is what is meant.",
      "overlap_context": "e yin and yang qi of heaven and earth interact, generating transformation. Indeed, the principle of yin-yang’s cyclical movement is self-evident, as when qi rises to steam the One into rain, and rain descends to moisten, giving rise to the myriad things. Yet by closely observing the convergence of heaven and earth, the revolutions of sun and moon, one clarifies the model and comprehends the principle of impartiality.\n\n**Profound Mystery**\nThe Upper Mystery subtly communes with the Lower Mystery—",
      "start_char": 5339,
      "end_char": 5584,
      "start_sentence": 325,
      "end_sentence": 339,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.106938123703003,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养生咏玄集.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "下玄从此亦同功 老子云，前后之相随者也。 阴丹 阴丹多见赚时人， 一荒得者全少，失者至多。 都是传来托误文。 得者少，托误文者多见夭逝，不体本元，欢非真谛。 且几心既发，如猛火投焰，事既炽然，卒何固济？ 故道之玄妙，起自心法，既忽荡动，气亦奔腾，岂谓初机之道，返为害命！ 未晓重玄篇内旨， 未晓重玄之旨，徒枉阴丹之功。 味於无味亦徒云。 既若无味，则何用行持？ 故云亦徒云也《黄庭经》云：长生至慎房中。 急，何谓死作令神泣。 盖王屋真人、罗真人、狐刚子、元阳诸仙人，不可一一库啰庙翩阴丹盾独重玄< 用，道体交合，神凝之法。 若初学强, 自行持，而至中夭，与道愈失。 与道失，与道愈彰，生自何存也？ 故阴丹之法，本为绝尘之事，古圣人恐真者未遂了达，且居常道，故示之阴丹之妙。 其理法天象地，升阴降阳，所忌者以侄心难制，以女子交感而男子先脱其精，如此行之而疾病俱生，以运夭逝。 其外晦朔弦望，风雨饥饱，喜怒劳佚，次而忌之。 几女人有经后六日，合三阳数，与女人交合者，生男； 三阴数与女交合者，生女。 凡一月此六日，若是须二情齐降，方获成就。 自此阴阳算数，还知贫富贵贱，其理昭然矣。 玄关 无关善闭岂能开，老子日：善闭，无关键而不可开。 玄关者，不独称乎心也，若明善闭之法，以通玄妙，始得玄关之称。 盖善闭之道，即心地之法也。 妙使灵童出得来。 灵童者，得道之称也。 若契玄关之理，即达善闭之道。 或出或处，得妙便法要，至乎轻安也。 已绝六尘玄路启， 六尘者，谓眼、耳、鼻、舌、身、意六根，各有法识所染，是六尘。 故云玄关善闭，以求泯灭其尘妄。 若志之所至，即玄之又玄也。 自兹生死不相该。 无染尘识，安系去留？ 心法两忘，取损同泯。 栖真子云：百邪不能干其正，群动不能挠其清。 故生死不该属也。 玄珠 玄珠安比世问珠？ 非身外有珠，方璧之类也，故日居易求玄珠。 赋云：动为道枢，静为心荷，玉光不耀，至真不渝也。 悟者将知是命符。 若悟珠之至理，乃明生之要会，而与命符也。 不昧不明随应化， 老子云：不昧不明，玄之又玄。 盖显玄珠之本体相应，其通而变者也。 动为瑕玷即萦纡。 心动即随绿逐境，乃是玄珠之瑕玷。 故云动为瑕玷即萦纡，即玄珠不能莹彻也。 玄牝门 通真玄牝是灵关，玄门者，神庐也。 牝门者，大关也。 此修行之大要也，故云灵关。 老子云：谷神不死，是谓玄牝。 玄牝之门，是谓天地根也。 不悟修生事更难。 若不悟玄牝门，行持修生之理，与精神为关钥，即修生之事，无所可着也。 浪紧溯流功用到， 初行持者，乘舟到溯流，功用到则非常道。 老子日：理大国若烹小鲜。 宽猛之理，得其所也。 柢兹滩后更无滩。 若功用到，永离忧息，怛居安静，故云更无滩也。 玄门 九洞三山名少人，",
      "translated_text": "The Lower Mystery achieves the same merit—Laozi said: “What follows one after another.” As for the Yin Elixir, many deceive contemporary practitioners; those who truly attain it are few, while those who lose it are many. Most transmissions contain errors. Few attain it, while many who rely on flawed texts meet early death, failing to embody the original source and mistaking falsehood for truth. Once the mind stirs, it is like wildfire fed with flames—once ablaze, how can it be steadied? Thus the profound subtleties of the Dao arise from the mind’s method. If agitation stirs, qi surges wildly—how can this initial practice of the Dao instead harm life? Without understanding the deeper meaning of the *Double Mystery*, one vainly exhausts the efforts of Yin Elixir. To speak of the flavorless as if it were flavorless is also futile. If it is truly flavorless, why practice at all? Hence it is said to be futile.\n\nThe *Yellow Court Classic* states: “For long life, be most cautious in the bedchamber—haste turns life into death, making the spirits weep.” The perfected ones of Wangwu, Luo, Hu Gangzi, Yuanyang, and other immortals did not solely rely on Yin Elixir. They employed the mutual fusion of Dao and body, the method of spirit concentration. If beginners force themselves to practice, they may die prematurely, drifting ever farther from the Dao. The farther one drifts, the more the Dao manifests—how then can life endure? Thus the method of Yin Elixir was originally for transcending the dusty world. The ancient sages, fearing that true practitioners might not fully grasp it, presented it as an ordinary path, revealing the wonders of Yin Elixir. Its principle models heaven and earth, ascending yin and descending yang. What it forbids is the unruly mind, for when a man engages with a woman, he first loses his essence—practicing thus brings illness and hastens death. External factors such as the phases of the moon, wind and rain, hunger and satiety, joy and anger, exertion and rest must also be avoided. When a woman has her menstrual cycle, the six days following are governed by the three yang numbers—union during this time produces a son; the three yin numbers produce a daughter. In a month, these six days require both partners to descend in harmony to achieve success. From these calculations of yin and yang, one may also discern poverty and wealth, nobility and lowliness—its principles are self-evident.\n\n**Mysterious Pass**\nThe Pass that excels at closing cannot be opened—Laozi said: “One who excels at closing needs no bolt, yet none can open it.” The Mysterious Pass is not merely the heart; if one understands the method of skillful closure to penetrate the profound, only then does it earn the name of Mysterious Pass. The art of skillful closure is the method of the mind-ground. Thus the numinous youth may come and go freely. The numinous youth is the title of one who attains the Dao. If one grasps the principle of the Mysterious Pass, one comprehends the way of skillful closure. Whether coming or going, one masters the essential method and attains lightness and ease. Once the six dusts are severed, the path of mystery opens. The six dusts are the eyes, ears, nose, tongue, body, and mind—each has perceptions that stain them. Thus the Mysterious Pass excels at closure to dissolve these illusory dusts. Where the will reaches, mystery upon mystery unfolds. From this, life and death no longer pertain. Without the stains of dust and perception, how can there be attachment to coming or going? When mind and method are both forgotten, gain and loss dissolve together.\n\nMaster Xizhen said: “A hundred evils cannot disturb its rectitude; a thousand movements cannot disturb its clarity.” Thus life and death do not pertain to it.\n\n**Mysterious Pearl**\nHow can the Mysterious Pearl be compared to worldly pearls? It is not a pearl outside the body, like a jade disk—hence it is said to be easily sought. The rhapsody states: “Movement is the pivot of the Dao; stillness is the lotus of the heart. Jade light does not shine, yet the utmost truth does not waver.” Those who awaken will know it as the tally of life. If one comprehends the profound principle of the pearl, one understands the essential convergence of life and thus holds the tally. Unobscured and unclouded, it responds to transformations—Laozi said: “Unobscured and unclouded, mystery upon mystery.” This reveals the original substance of the Mysterious Pearl, which corresponds and changes. Movement becomes a flaw, entangling and obstructing. When the mind moves, it chases after conditions—this is the flaw of the Mysterious Pearl. Thus it is said: “Movement becomes a flaw, entangling and obstructing,” and the Mysterious Pearl cannot become perfectly luminous.\n\n**Gate of the Mysterious Female**\nThe Gate of the Mysterious Female is the numinous pass of communion with truth. The Mysterious Gate is the abode of spirit; the Female Gate is the great pass. This is the great essential of cultivation—hence it is called the numinous pass. Laozi said: “The valley spirit does not die; this is called the Mysterious Female. The gate of the Mysterious Female is called the root of heaven and earth.” Without awakening to the Gate of the Mysterious Female, the practice of life-cultivation becomes difficult. If one does not grasp its principle, treating spirit and essence as the lock and key, then the endeavor of cultivation has no foundation. Those who practice haphazardly, like rowing against the current, may apply effort but fail to reach the true Dao. Laozi said: “Governing a great state is like cooking a small fish.” The principle of balancing firmness and gentleness must be properly applied. Only after passing this rapids are there no more rapids. Once effort is perfected, one forever leaves worry and toil, dwelling in constant tranquility—hence it is said there are no more rapids.\n\n**Mysterious Gate**\nThe nine caves and three mountains are known to few.",
      "overlap_context": "llows the same pattern. When cultivation reaches the spirit, harmonizing qi with the true, the embryo is complete—then naturally the heart follows the breath to its end, and qi arises with each exhalation. As the dusty realms dissolve, all entanglements are severed.\n\nThe *Treatise on Embryonic Breathing* states: “The embryo forms within primordial qi; warmth is born from the nose.” All lies in the single-minded application of dissolution—hence it is known as daily renewal. This is what is meant.",
      "start_char": 5585,
      "end_char": 6765,
      "start_sentence": 340,
      "end_sentence": 409,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.122862815856934,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养生咏玄集.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "九洞三山者，海中所有之岛，乃仙人集居之所。 绝学至人多隐其问，故举以明得道之所由，显玄门是修生之枢要。 九洞三山，亦象人之三田九窍也。 尽经此路学修真。 玄门一路得尽同，若失之归即动皆非。 下连紫府通华盖， 华盖者，肺也。 紫府，肾官、气海也。 盖玄门开合，皆通应也。 得丧绝尘非绝尘。 若得神庐之妙则永，故云绝尘。 若丧淳朴之根，巡还六趣，即云非绝尘。 牝门 诸窍开因牝窍开， 牝门者，大关也。 诸窍开拆，至於筋脉五藏，命关皆悉相应。 脱漱气液，至於衰老，而无觉知，以崇其道，求乎生也。 精神自此去如催。 牝门既开，则出损精气。 精气若损，神渐昏蒙，而见危坏。 固关枢要将为首， 修生者因闭天关，次为其首也。 迷者多因致祸灾。 若不明开合之理，但责着滋味之感，则万祸入，寒暑侵，至於顶逝，皆由之也。 绝利一源 绝利一源事细微，绝阴路而启阳门，初机道也。 老子《胎息精微论》曰：玄之又玄，是我命门。 又《阴符经》云：绝利一源，用师十倍。 三返昼夜，用师万倍。 匪运而有甩师之倍。 盖绝一源於是也。 调和全白理神机。 调和，调源也。 全在神机运合者也。 若教依旧还贪着， 若念未尽，不能制止，荡逸去来，即非道也。 倏忽交争见是非。 若神气乱行，妄生动作，则暴乱生乎是非，政错误之由也。 心 染污随绿圣莫穷， 心者，性之用也。 随缘染境，起灭无常，是知圣莫穷也。 都来心法共伊通。 千方万法，至於出死入生，未有不因心而修学，至於成备者也。 是非得丧全由此， 万事是非，或拾或留，或迷或悟，皆由此也。 返本归源道愈同。 返其本，归其源，故道是群经之要会，与道合即同也。 性 性为心所本同途， 性不可见，由心明之。 心不自彰，因性方起。 既为心所起，故日同途。 认取元阳制动枢。 元阳者，元和之气。 能制躁动，故为枢也。 此全明心法也。 依附凝躯方建立， 人依屋宇，始免风霜； 性托形躯，方能建立也。 自心却返到虚无。 心契妙轨，以法行持，云归虚无之妙。 故云自心却返而归元也。 动即为心，乃之动而非动，其动则应见随机，变通无滞。 群品於始终之理，知他心起灭之端，妙不可量，功不可测。 化无所化，称莫以称。 在几即云妄想纷纭，在圣即日真元作用者也。 其静则为性，是知静则非静。 泯灭变化之道，消亡应现之机，不涅不缁，无尘无垢。 熙熙上圣之真风荡荡，极迷途之化本巍巍，事既实而言莫诠，道以崇而理难谕。 前际后际有空，焕乎浩浩之元，宛乎融融之德，妙中之妙，玄之又玄。 此盖归乎化源，而穷理尽性，变化莫测者也。 法 法本无言理自如，不拘动静，理自如如。 犹知自是众经枢。 圣人所设万论千经，说不可及法，乃无枢要也。 人有颖悟玄玄趣， 若得悟玄中深趣，即真道之谛理也。 秘向心头作妙符。 法者，心源之妙符，起生死之大要，非轻取轻傲求，非躁挠所能知，非讹所能学，非念诵而至，非步历而至。 明昧虽殊，古今不异。 《真言诀》云：去其死，先去其生。 去留之理，体而用之。 故高真教主，太上虚宗，或明於三心九心，或显於一法万法。 至於皇人丹诀，青童玉书，理有实归，本元是非，执滞调不讹，而经众妙，直露希夷。",
      "translated_text": "The nine caves and three mountains are the islands within the sea, where immortals gather and reside. Those who have mastered the profoundest learning often conceal themselves there, and thus these are cited to illustrate the origin of attaining the Dao, revealing that the Mysterious Gate is the pivotal essence of life-cultivation. The nine caves and three mountains also symbolize the three elixir fields and nine orifices of the human body. One must traverse this path to study and refine the truth.\n\nShould one follow the Mysterious Gate to its end, all paths converge as one; if lost, every movement becomes misguided. Below, it connects to the Purple Palace and the Florid Canopy—the Florid Canopy being the lungs, the Purple Palace the kidney palace and sea of qi. For the Mysterious Gate’s opening and closing all correspond in resonance.\n\nGaining or losing, transcending the mundane is not transcending the mundane. If one attains the subtlety of the spirit’s abode, it endures—hence it is called transcending the mundane. If one loses the root of pure simplicity, wandering through the six destinies, it is said not to transcend the mundane.\n\n**Gate of the Mysterious Female**\nAll orifices open because the Mysterious Female’s gate opens. The Mysterious Female’s gate is the great pass. When all orifices unfold, even the sinews, vessels, five viscera, and life-pass all respond in unison. Yet if one remains unaware as qi and fluids ebb, leading to decline and aging, how can one uphold the Dao and seek life?\n\nSpirit and essence depart from here as if hastened. Once the Mysterious Female’s gate opens, it drains essence and qi. When essence and qi are depleted, the spirit gradually darkens, and perilous decay ensues.\n\nSecuring the pass and pivot is foremost. Those who cultivate life must first close the heavenly pass, making this their primary task. Those who are deluded often invite calamity. If one fails to comprehend the principle of opening and closing, merely indulging in sensory pleasures, then myriad misfortunes arise, cold and heat invade, and even the crown of the head perishes—all stemming from this.\n\n**Cutting Off the Single Source**\nCutting off the single source is a subtle matter: severing the yin path to open the yang gate is the initial mechanism of the Dao. Laozi’s *Treatise on Embryonic Breathing and Subtle Essence* states: “Mysterious and yet more mysterious is my life’s gate.” The *Classic of the Unseen Correspondence* also says: “Cut off the single source, and one’s strength becomes tenfold. Thrice returning day and night, one’s strength becomes a hundredfold.” Without effort, one gains a hundredfold advantage—this is the cutting off of the single source.\n\nHarmonizing and preserving the white principle governs the spirit’s mechanism. Harmonizing means regulating the source; preserving lies in the spirit’s mechanism operating in accord. If one remains attached to old habits, if thoughts are not extinguished and restraint is lacking, allowing dissipation to come and go, this is not the Dao.\n\nIn an instant, conflict arises, and right and wrong appear. If spirit and qi move chaotically, giving rise to reckless actions, then turmoil and discord emerge, becoming the source of errors.\n\n**Heart**\nDefiled and following conditions, even sages cannot fathom it. The heart is the function of nature. Following conditions and being stained by circumstances, arising and ceasing without constancy—even sages cannot exhaust its depths.\n\nYet all methods and teachings ultimately communicate through it. Countless methods, from transcending death to entering life, are all cultivated through the heart, and none reach completion without it.\n\nRight and wrong, gain and loss all arise from this. All matters of right and wrong, whether grasped or abandoned, whether deluded or awakened, originate here. Returning to the root and reverting to the source, the Dao becomes ever more congruent. Returning to the root and reverting to the source, the Dao is the convergence of all scriptures; uniting with the Dao, one becomes one with it.\n\n**Nature**\nNature is the heart’s origin, sharing the same path. Nature cannot be seen; it is revealed through the heart. The heart does not manifest itself; it arises through nature. Since it arises from the heart, it is said to share the same path.\n\nRecognize the primordial yang to control the pivot of movement. Primordial yang is the qi of primordial harmony. It can restrain restlessness, thus serving as the pivot. This fully clarifies the heart’s method.\n\nRelying on the congealed body, it is established. Just as one depends on a house to avoid wind and frost, nature relies on the physical form to be established. Yet the heart, returning, arrives at emptiness and nothingness. When the heart accords with the wondrous track and practices the method, it is said to return to the wondrous emptiness of the origin.\n\nMovement is the heart—yet it moves without truly moving. Its movement responds to conditions, adapting without obstruction. Regarding the principle of all phenomena from beginning to end, knowing the arising and ceasing of others’ hearts, its subtlety is immeasurable, its merit unfathomable.\n\nTransformation is without transformation, designation without designation. In the mundane, it is called deluded thoughts swirling; in the sage, it is called the functioning of the true origin. In stillness, it is nature—yet stillness is not true stillness. The Dao of vanishing transformation, the mechanism of ceasing response, neither stained nor soiled, without dust or defilement.\n\nThe radiant true wind of the lofty sages flows boundlessly; the transformation of the utterly deluded returns to the root, towering and majestic. The matter is real, yet words cannot describe it; the Dao is exalted, yet its principle is hard to convey. The past and future boundaries are empty, resplendent in the vastness of the primordial, blending into the harmony of virtue. Within the wondrous lies the most wondrous, the mysterious within the mysterious. This is returning to the source of transformation, exhausting principle and fulfilling nature, where change is unfathomable.\n\n**Dharma**\nThe Dharma is fundamentally wordless, yet its principle is naturally thus. Unbound by movement or stillness, its principle remains ever thus. Yet it is known to be the pivot of all scriptures. The myriad treatises and thousands of sutras set forth by sages cannot exhaust the Dharma, for it is the essential pivot.\n\nIf one has keen insight into the profound subtleties, grasping the deep essence within the mysterious, this is the true principle of the Dao. Secretly, it becomes the wondrous talisman within the heart. The Dharma is the wondrous talisman of the heart’s source, the great essential for arising and ceasing in life and death. It cannot be lightly sought or arrogantly pursued, nor known through restlessness, nor learned through error, nor attained through recitation, nor reached through traversal.\n\nThough brightness and obscurity differ, it remains unchanged through ancient and modern times. The *True Word Secret* states: “To depart from death, first depart from life.” The principle of departure and retention is embodied and applied. Thus, the supreme perfected masters and the Most High’s Void Tradition may elucidate the three hearts or nine hearts, or reveal the one Dharma or myriad Dharmas. As for the imperial elixir formulas and the Jade Writ of the Azure Lad, their principles have a true return, their original source is without error. Clinging to stagnation and misapplying regulation, one cannot penetrate the wondrous; only by directly revealing the subtle and imperceptible can one grasp it.",
      "overlap_context": "rdly, like rowing against the current, may apply effort but fail to reach the true Dao. Laozi said: “Governing a great state is like cooking a small fish.” The principle of balancing firmness and gentleness must be properly applied. Only after passing this rapids are there no more rapids. Once effort is perfected, one forever leaves worry and toil, dwelling in constant tranquility—hence it is said there are no more rapids.\n\n**Mysterious Gate**\nThe nine caves and three mountains are known to few.",
      "start_char": 6765,
      "end_char": 8120,
      "start_sentence": 410,
      "end_sentence": 494,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.03537201881409,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养生咏玄集.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "其余化体飞形，育婴固命，乃至五行假借，动静得常，三身互道，往不废亦干枝叶。 殊未届其根株，盖受道於深浅之师，致理有见闻之执。 深宜济度，勿惮参承。 养生咏玄集 #1天：原作『而』，据文义改。",
      "translated_text": "The remaining transformations of the body and flights of form, the nurturing of the immortal embryo and the securing of life—even the mutual borrowing of the five phases, the constancy of movement and stillness, and the mutual Dao of the three bodies—all these are but branches and leaves, never reaching the root and trunk. This arises from receiving the Dao from teachers of varying depth, leading to attachments in principle based on what is seen and heard. One should earnestly seek deliverance, undaunted in seeking instruction and verification.\n\n*Yangsheng Yongxuan Ji* #1\n(Original text had 『而』; emended to 『致』 according to context.)",
      "overlap_context": "tion is embodied and applied. Thus, the supreme perfected masters and the Most High’s Void Tradition may elucidate the three hearts or nine hearts, or reveal the one Dharma or myriad Dharmas. As for the imperial elixir formulas and the Jade Writ of the Azure Lad, their principles have a true return, their original source is without error. Clinging to stagnation and misapplying regulation, one cannot penetrate the wondrous; only by directly revealing the subtle and imperceptible can one grasp it.",
      "start_char": 8120,
      "end_char": 8217,
      "start_sentence": 495,
      "end_sentence": 499,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.853538751602173,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\养生咏玄集.txt",
        "category": "方法类"
      }
    }
  ]
}