{
  "source_id": "内丹秘诀",
  "source_file": "chunked_daozang\\内丹秘诀.json",
  "total_chunks": 4,
  "total_original_chars": 3990,
  "total_translated_chars": 23184,
  "total_translation_time": 127.41260743141174,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\内丹秘诀.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**Secret Formulae of Internal Alchemy**\n\n**Title:** *Secret Formulae of Internal Alchemy*. Author unknown, likely composed before the Northern Song dynasty. One scroll. Source text: *Daoist Canon of the Zhengtong Era*, *Tai Xuan* Section.\n\n---\n\n### **Rhapsody on Internal Alchemy**\n*(Rhymed to \"Refining the Dragon and Tiger, Accordant with the Heavenly Dao\")*\n\nVast as the clouded sea, its paths lead to the Broad Cold Palace;\nThe giant clam nurtures its treasure, the sacred crow smelts the elixir.\nLead enfolds living gold—if one fully grasps the root and source,\nMercury gestates within cinnabar—truly, their union is no difficult task.\nThus can the dust be transformed, the common man ascend lightly,\nRescuing those withered by moxa’s decay.\n\nNow, the medicine must be sought within, the furnace refined in person.\nThe flying spirit-water drips its essence, pouring into the Flowery Pond in splashing torrents.\nWater and fire are drawn and added, yin and yang wielded like fans,\nCircling within three hundred and sixty days, traversing Kan and Li;\nAmid seventy-two seasonal nodes, driving thunder and racing lightning.\nDeep within the Nine Palaces, the tiger coils and the dragon crouches,\nUnlocking the gates of the Three Powers, forging the portals of the Eight Trigrams.\nAdvancing fire to activate the lines, beginning in winter and surging through summer;\nFollowing heaven to perfect things, from summer’s start to winter’s end.\nSilently moving the divine mechanism, subtly aligning with the sagely measure,\nConveying the twelvefold cycle, revolving the Three and Five,\nMastering yin and yang, subduing dragon and tiger.\nProbing the marvel of seven returns and nine reversions, refining fine gold below;\nGathering the essence of one water and two fires, returning above to the true earth.\nIs it not so? Having completed the cycle, it begins anew—from being to non-being,\nTransmuting the hard and soft medicines, filling the cauldron of heaven and earth.\nNourished by golden blossoms and jade fragments, cultivated by the Great Yang and Yin Talismans,\nIt governs creation within the bodily form, twinning the sagely image in dual transmission;\nConcentrating radiance within the grotto-realm, a single luminous pearl.\nIts wondrous workings operate in concealment, its true source secretly aligned.\nGradually, the red wine suffuses branches and leaves, the yellow vitality revives root and stem.\nThe dog feeds on dragon’s marrow, the man consumes cicada’s molt—\nTransmuting the mortal into the sagely.\nNot through some divergent worldly merit, but by halting the visage and preserving the countenance,\nUndiminished by the years of later heaven.\nThus the marrow congeals like frost-white snow, the bones transform into unyielding gold.\nThis floats beyond the net of vanity, pointing the way home through the boundless sky,\nUnbound by the hundred-and-six cycles of calamity, untroubled by the fleeting hours;\nEscaping beyond yin and yang, letting the passing years change as they will.\n\n**Take heed!**\nThe enlightened should draw near, the true essence may be preserved.\nPonder how swiftly fleeting life darkens—how can one not seize the moment early?\nBehold the rise and fall, honor and disgrace, along the long road to Chang’an’s northern hills.\n\n---\n\n### **Poem on the Yin Elixir**\nWorldly arts are called \"famed techniques,\"\nDaoist teachings are known as \"hidden scriptures.\"\nThe Three Peaks bequeath secret instructions,\nThe Five Characters reveal the true pivot.\nGuest and host must guard against premature movement,\nYin and yang prize harmonious accord.\nWith each regulation, let the *chong qi* flow smoothly,\nNever indulging the passions’ release.\nBeware that kindness may breed harm,\nPreserve the end as carefully as the beginning.\nWhen the Three Fields brim with golden liquid,\nThe mortal frame is exchanged for skin like ice.\n\n---\n\n### **Rhapsody on the Toad’s Returning Elixir**\n*(By Hai Chan Zi)*\n\nNow, the Returning Elixir is most revered, arising from Qian and Kun.\nIt employs the One Qi to array the Three Powers, commands the Five Phases to divide the Nine Luminaries.\nBlack and white intermingle, spraying the rain and dew of yin and yang;\nBlue and yellow unite, scattering the sun and moon to form the primordial chaos.\nWhen the crimson furnace is established and the true crucible set in place,\nLead borrows the womb of water, mercury rests in the intestines, free of dross.\nAbove, it does not seek the mountain’s depths; below, it does not seek the mortal dust.\nGathering *mao* and *you* at the Three Peaks, meeting Kan and Li on the two shores.\nOnce the wondrous existence is understood, the tortoise and snake naturally submit;\nHaving attained the realm of emptiness, the crow and hare spontaneously keep company.\n\nMoreover, the elixir that reverses aging—let not its opportunity slip away.\nEndlessly, it refines the golden visage; clearly, it transforms into jade-like substance.\nMoving, living—suddenly it hastens as *geng* and *xin*;\nActive, still—swiftly it divides as *jia* and *yi*.\nThe yellow sprouts flourish, the River Chariot endures.\nThe River Chariot is lent to the yellow sprouts, nurturing them;\nThe yellow sprouts’ roots connect to the River Chariot, bearing the person—\nAh! Life’s turning is distant.\nThe three *hun* wander—whose grotto do they return to?\nThe seven *po* linger—do they depart from my home?\nThrough repeated cycles of fortune and misfortune, the Three Ones—mother and child—cannot escape.\nEncountering heat and cold, the Two Eights—husband and wife—do not part.\n\nMarvelous indeed!\nThe distant path can be traversed at dawn—\nsource of the myriad vibrations,\nmanifest and hidden pivot of the mechanism.\nIt unravels and returns to the ancestor of the hundred streams,\nwhile within the sea of glory and splendor,\nall things in haste turn to ash.\nIn the silent vastness of the world,\nonly it alone does not become dust.\n\nI urge the wise to awaken to the Great Dao—\nhas Heaven ever been untrue?\nSee the *yin* and *yang* and conceal them in secrecy;\nhear of water and fire and guard them steadfastly.\nDo not procrastinate—how lamentable!\nOnce fallen into ruins,\nhow can one ever behold them again?\n\nThe Azure Dragon descends and coils round the White Tiger;\nthe Vermilion Bird soars and plunges into the Dark Warrior.\nAfter a thousand mornings, the fire-tending evokes divine merit—\nin broad daylight, one ascends to the Purple Court.\n\n*The Song of Utmost Truth*\nI tell you gentlemen the truth:\nthe stem of life has always lain in the true breath.\nIlluminating the body, it abides in emptiness yet is not empty;\nthe numinous realm, like Heaven, embraces the ten thousand things.\n\nThe Great One spreads its wonders—let man attain the One.\nHaving attained the One, guard it well and never lose it.\nIn an empty and tranquil chamber, the spirit dwells of itself;\nin the numinous palace, scorching and smelting dry the blood and fluids.\n\nOne sorrow, one joy, one thought, one care—\none indulgence, one toil, and the body gradually decays.\nHarming at dawn, damaging at dusk, deluded and unaware,\nqi scatters, the spirit has no place to rest.\nSlowly, slowly it wears away, gradually declining—\nwhen the primordial harmony is exhausted, the spirit departs.\n\nAll speak of walking meditation and sitting meditation as the same,\nbut while the sage may be thus, the common man is not.\nWasting time without cutting away the thorns,\nwho has ever heard of fine crops growing in a barren field?\n\nAfter nine years of gentle nurturing, the fire-tending is complete—\nthe mysterious response is effortless, and the spirit hastens.\nThe effortless mind is the true mind;\nin motion and stillness both forgotten, one departs from desire.\n\nSpirit is nature, qi is life.\nWhen the spirit does not stray outward, qi gradually settles.\nOriginally two things—yet which is closer?\nIf lost, what remains to grasp as the root?\n\nWith what does one first establish the foundation?\nAbide in non-action where non-action is—\nscenes in the mind must be swept away,\nspirit in dreams must be firmly held.\nNeither drifting nor congealing is the great essential;\nneither square nor round is the supreme subtlety.\nWhen the numinous source operates within, it becomes real;\nwhen breath scatters outward, it remains unfinished.\n\nPiercing metal and penetrating stone are not difficult—\nsitting in oblivion, standing in forgetfulness, swift as a flash.\nThis Dao is easy to know but hard to practice;\nwhen practice forgets itself, the Dao is complete.\n\nIf one takes breath-holding as the true matter,\ncounting breaths or following diagrams—both are mistaken.\nLately, one lays aside worldly toil,\nyet inwardly, the heart remains entangled—how is this different?\n\nJust observe an infant in the womb—\ndoes it secretly scheme and calculate?\nIt savors only the sweet dew,\nhunger and thirst dissolve, revealing true simplicity.\n\nIn later years, when merit is complete, one roams freely—\nbut at first, refining and washing require diligence and toil.\nYet within diligence and toil, there is no diligence—\nidly, idly, one need only nurture the primordial spirit.\n\nAlas! The heart will not allow idleness—\nin the end, whether one wanders or abides depends on the person.\nI now practice the bitterest of bitter austerities—\nclothed in grass, eating bark, solitary and still.\n\nIf one applies effort in idleness,\nhow can it compare to the vast cultivation of great samādhi?\nIf form and spirit cannot both be preserved,\none may complete life but cannot first complete nature.\n\nConcentrate qi to attain softness, and the spirit lingers long;\nthe true breath comes and goes, naturally at rest.\nContinuous and unbroken, it returns to the primordial root—\nwithout drawing from the numinous spring, it flows forever.\n\nThirty-six thousand days make the great work;\nwithin them lie the rhythms of yin and yang.\nSteaming and fusing the meridians, transforming sinew and bone,\neverywhere radiant and unobstructed.\n\nThe Three Corpses flee the yin abode of the corpse;\nthe myriad lands come to pay homage at the palace of the Red Emperor.\nI ask: whence comes the true person?\nFrom the beginning, he has dwelt only in the cinnabar terrace.\n\nIn former years, clouds and mist deeply obscured him;\ntoday, we meet, and the eye of Dao opens.\nThis is not a matter of a morning or an evening—\nit is my original truth, not a mere defense.\n\nFirm as metal and stone in the cold of winter,\nrepelling yin demons through the power of wisdom—\nall arises from tranquility and single-minded devotion,\nwhich is the Pure Land of Huaxu in this very age.\n\nDo not chase fame or pursue profit;\ncut off human attachments and be free of affairs.\nWhat use is a sky-reaching reputation?\nWhat value is there in riding horses or composing essays?\nSkill in zither, poetry, or lyrics—\nmastery of many arts only obstructs the path of cultivation.\n\nLike thin mist or light smoke,\nidly accompanying fallen blossoms and willow fluff,\nfloating and secluded between Heaven and Earth—\nwhen the time comes, they cannot become rain or dew.\n\nIf primordial qi does not abide, the spirit is not at peace;\na worm-eaten tree with no roots withers its branches and leaves.\nNo need to speak of tears, saliva, or essence-blood—\ngrasping the root and exhausting the source, all are the same.\n\nThis thing has never had a fixed position—\nits transformations at the moment depend on the heart’s intent.\nIn the body, when heat is felt, it becomes sweat;\nin the nose, when wind is felt, it becomes mucus;\nin the kidneys, when union is felt, it becomes essence;\nin the eyes, when sorrow is felt, it becomes tears.\nFlowing and circulating, it moistens the entire body—\nin the end, it does not depart from the spirit-water.\n\nIts wonder is hard to describe—few recognize it.\nIt nourishes all things with the green essence-qi.\nHalf a lifetime spent in procrastination—\nonly now does cultivation rely on spirit and qi.\n\nWhich is closer—name or self?\nWhen spirit and qi are not at peace, one labors in vain.\nPity the fine foundation—\na golden hall and jade chamber without a master.\n\nI urge you, master, to abide long—\nin utmost stillness and tranquility, there is no use.\nThe wondrous existence within emptiness is hard to grasp—\nnurturing the infant requires the mother.\n\nEnveloping keen discernment, yet remaining silent;\ngathering in the spirit, learning to be dull.\nWith a steadfast heart and single purpose, press forward—\nwhether achieved or not, strive to attain it.\n\n*Song of Ox-Cheek Master to Horse Recluse*\nHorse Recluse, Horse Recluse,\nyears ago, by the Basin’s shore,\nwe met in the season of late spring.\nHand in hand, we walked the red dust,\nsearching every grotto of Mount Lu.\n\nA hundred flowers vied in splendor amid fragrant groves and springs;\nten thousand peaks, like ink-splashed brows.\nOnly the twittering of birds was heard—\nno clamor of markets or towns.\n\nTwo gourds of wine beneath the eaves,\nresting by a stream.\nCarved gold cups of tender essence,\npurple jade plates of fresh fern.\nStriking flint to boil,\nplucking pine blossoms to garnish.\n\nDrinking seven or eight cups in a row,\nunaware of flushed ears.\nSuddenly, wisdom-nature pierced the mystery—\non the rocks, we sang wildly, shouting with joy.\n\nTen paces, five paces—strike a fit of madness,\nstumble and fall asleep at once.\nAwake, how long has passed?\nThe woodcutter says, \"Months already.\"\n\nCrouching again on the patterned stone,\nlungs and bowels drenched, spirit refreshed and joyful.\nThe jade dawn and cinnabar Han await their time—\nwhat need to speak of worldly profit or fame?\n\nHaving said this, I take leave of you.\nAfter parting, I enter the dark forest,\nseek the Pure Void,\nascend the Purple Terrace,\nwander the lush groves—\nwithin the gourd’s true realm, I roam free.\n\nThe world’s fleeting light presses on,\nothers laugh at my carefree ways.\nI conceal my brilliance and delight in obscurity,\nclad in green straw cloak and bamboo hat,\nholding a great iron ladle in hand,\nbegging for coins to buy wine and muddle through the Five Turbidities.\n\nSuddenly, I arrive beneath Mahu Mountain,\nwithin Jianchang Prefecture.\nAtop a wineshop, I see four men—\neach in tattered robes,\neach with the extraordinary bones of immortals.\nThey chant and sing loudly,\nseeming drunk yet not drunk.\n\nI ask a young attendant holding a sword,\nwho tells me: \"Master Zhongli, Master Lü, Liu Haichan, and Chen Qizi.\"\nThe four call to me: \"Come closer!\nYour celestial bones are rare and truly divine.\nFor decades, we’ve searched for worthy ones in vain—\nnow we shall transmit to you the secret of the Golden Elixir.\"\n\nThey say to me:\n\"In the dim and distant, there is essence;\nin the vague and indistinct, there is substance.\nThis substance is no ordinary substance,\nthis essence no ordinary essence.\nHeaven gains clarity from it,\nEarth gains tranquility,\nhumans gain spirit,\nall things gain life.\n\nSimply embrace the Origin and guard the One,\ntemper sharpness and resolve strife.\nHold the Seven-Star Sword,\nturn the Heavenly Gate and shift the Earth’s axis,\nharmonize yin and yang, unite Qian and Kun,\nopen the gates of Kan and Li,\nrelease the Dragon and Tiger to devour each other,\nawait the transformations of Wu and Ji—\nthen the work is complete, and the Elixir is formed.\n\nThis is the divine treasure of Heaven,\nthe rarest jewel among men,\nthe subtlest of subtleties,\nthe most revered of the revered.\nGuard it in secret,\npractice it with diligence.\"\n\nHorse Recluse, Horse Recluse,\nthis art is within reach of all,\nyet most are blinded by ignorance, their spirits dull,\nensnared by worldly desires,\nvaluing hearsay over sight.\nHow many truly understand?\n\nSome vainly preserve spirit in delusion,\nor swish saliva and swallow it.\nSome exhaust their bodies with daoyin,\nor sit in rigid stillness, holding their breath.\nSome inhale external winds,\nor endure hunger by fasting.\nSome externally refine lead and mercury,\nor sink into debauchery with yin elixirs.\nSome, having eaten their fill, prattle of emptiness—\nyet they are the true sinners,\nyet they speak of karma,\nspouting foreign gibberish.\n\nThey claim to divine fortunes,\nor expound on Chan’s mysteries,\nor transmit the teachings of Patriarch Bodhidharma.\nBut without refining the body, the spirit cannot abide—\nfleeting as dreams, illusory as flowers,\nthey vanish in an instant.\nAll claim to have gone to the Western Paradise,\nyet in the end, they turn to a pile of ashes.\n\nHorse Recluse, Horse Recluse,\nseek substance in the vague and indistinct,\nseek essence in the dim and distant.\nWhen form and spirit penetrate the Dao,\nonly you and I achieve true union.\n\n*Song of the Spirit Spring Well by Valley-Dwelling Master of the Rock*\nThe Valley Master has a Spirit Spring Well,\nconnecting to the peaks of Kunlun’s summit.\nIts waters, called \"fermented brew,\"\nsustain the lives of grasses and beings.\n\nThe well’s flow never ceases through the four seasons,\nthose who drink it find true delight.\nWithin, the twin wheels of sun and moon appear,\nthe Crow and Hare endlessly chase each other.\n\nThis well is seen by all,\nyet thousands upon thousands fail to draw from it.\nThose who draw too near fall in,\ndrowning without knowing death—\nthe well’s depths are unfathomable, its waters perilous.\n\nThe Valley Master has a wondrous bamboo pole,\nfound when bones were eternal.\nIts nodes are all unobstructed,\ndrawing water with effortless strength.\n\nNo bucket, no jar—\nonly the pole’s tip dares to dip.\nIt comes and goes without damage,\ndrawing water all day without fail.\n\nThis bamboo pole is precious,\nits water sweet as honey.\nThose who drink it when ill are healed,\nrelieving hunger and thirst with ease.\n\nA thousand scriptures and ten thousand discourses reveal the true secret—\nif one grasps the pole and the water, one must guard it closely.\nWithout a master’s guidance, it is hard to find.\nYet if one holds this bamboo pole and this spring’s water,\nit sustains those who cultivate and study.\n\nAt times, it reveals itself to people,\nyet not one turns their heart toward it.\n\nSpeaking of this well is no easy task—\nthose who draw too near are swallowed whole.\nOnly the Valley Master grasps its subtle meaning,\nskillfully drawing water and knowing its depths.\n\nNo haste, no force—\nonly a subtle art.\nWhen the water is full, withdraw it at once,\npouring it into a golden vase to steep pearls.\n\nNo danger, no loss—\njust the ordinary passing of days.\nOver years and months, it becomes spiritually attuned,\ntransforming old age into youth.\n\nThe Valley Master’s bamboo pole seems common,\nyet if others grasp it, it is truly rare.\nAt the well’s edge, they lose it—\namong ten thousand, scarcely one succeeds.\n\nOne bamboo pole, one spring well—\nworldly wealth is fleeting and hard to grasp,\nyet riches destroy men, and none know it.\nThe well’s water gives life, yet none seek it.\n\nWhen immortals reveal subtle truths,\nall speak of this,\nyet if one refines and consumes it day and night,\neating it preserves the form and averts death.\n\n*Poems of the Golden Tiger and White Dragon*\nBy Zhang Guo\n\nLead and mercury have been passed down for a hundred thousand autumns,\nhow many recognize them? How many cultivate?\nIf the world knew the divine medicine,\nimmortals would flow like water in Heaven.\n\nThe Great Dao is clearly before us,\nyet people fail to seek the true Lead.\nThe Yellow Sprout is the qi of Qian and Kun,\nthe root of divine water connects to mercury.\n\nThe Maiden, newly born, is drunk as mud,\na thousand mornings in the dark chamber, not bound by west or east.\nSincerely tend the fire day and night,\nlest the divine elixir’s qi be uneven.\n\nWhen Heaven and Earth first gave birth, the sun and moon were high,\nshaped like an egg, shaped like a peach.\nThe qi of yin and yang knows the seasons—\nonly after three years does it shed its womb.\n\nWhere does the world seek the Yellow Sprout?\nThis thing dwells within lead—it is my home.\nLead and mercury together form the true qi of Earth,\nonly after shedding the womb does one see the divine cinnabar.\n\nThe world abounds with Yellow Sprouts, yet none recognize them;\nthose who know the Yellow Sprout never suffer poverty.\nHow could the Yellow Sprout be known to the world?\nEven if known, none find the gate.\n\nThe cinnabar of the two qi lacks spirit,\nonly when true qi is refined with Yellow Light does it become real.\nWithin lead lies the mercury of the elixir—\npeople wander lost, straying from the path.\n\nHarmonized with Heaven and Earth, aligned with the Mysterious,\nmother and child unite, yet dare not speak.\nFirst mercury, then lead—this is the true Great Dao,\nlest the companionless crane ascends to Heaven.\n\nThis thing is passed down through the division of two and eight,\nin an auspicious year and month, placed steady in the furnace.\nA thousand mornings of fire-tending, knowing the seasons,\nlest the sprout forms while mercury remains un-dried.\n\nMercury resides in the Central Palace, the sprout in the South—\nfirst weigh carefully, lest they clash.\nThe Yellow Sprout is no hard-to-find medicine,\npeople’s ignorance alone keeps their lips unsealed.\n\nThe market teems with Yellow Sprouts, yet none return,\nwhile the world lightly feasts, chasing fleeting dust.\nNobles and ministers all know the true divine medicine,\nyet till death they covet, vying for dawn’s glow.\n\nSun and moon extend life, yet people rush in vain,\nthe true Dao is clear, not an endless yang.\nEvery household holds lead and mercury,\nyet deluded, they wander into vast emptiness.\n\nThe Five Movements are plain—simply inquire,\nmercury within lead holds the deepest principle.\nOnce you know lead and mercury exist in the world,\nfirmly pursue the Dao, hesitate no more.\n\nThe Great Dao leaves behind a scroll of scripture,\nnaturally matching to form its proper shape.\nHeaven-born lead and mercury—why seek elsewhere?\nWhy ask distant lands for the name of the medicine?\n\nTo use lead, one must blend it with mercury,\ntwo families wed, the maiden sings.\nWhen refined to half the Purple River Chariot,\nwhite clouds accompany the returning crane.\n\nThe Jia-Yi divine chart drives the workings of creation,\nthe hidden dragon knows this as fine lead-essence.\nClearly wrought—what difficulty lies in understanding?\nYet they dismiss it as immortals’ riddling words.\n\nGreen Dragon and White Tiger unite as an embryo,\nafter ten months, the furnace opens in full.\nThis is the Yellow Sprout’s oral transmission—\nwhere in the world can one find the Three Powers?\n\nLead and mercury dwell in Qian, not in mountains,\nthe Three Passes, day and night, are worth climbing.\nThough youth may indulge in careless abandon,\ngradually one sees the face of a ghost in the mirror.\n\nThe Dao must be pursued northward with the heart,\nthe Yellow Sprout grows within lead.\nCinnabar, the Maiden, is the true divine medicine—\ngaining a companion, they journey to the Great Peng.\n\nThe Great Dao never fails those who seek it,\nlead and mercury are clearly before us, yet cast aside like dust.\nDo not say the world lacks divine medicine—\nthe cinnabar of the two qi is true water and fire.\n\nThis thing is Heaven-born, yet people do not know,\nthe true qi of yin and yang exchanges Kan for Li.\nWithin the Kan Palace, five generations seek names and forms—\nrecognize the Yellow Sprout, and it becomes the foundation of sages.\n\nThe secret formula of the Inner Elixir—consummate.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "内丹秘诀 经名：内丹秘诀。 不着编者，疑出矜北宋以前。 一卷。 底本出处：《正统道藏》太玄部。 内丹赋 以丹炼龙虎，符契天道为韵。 云海漫漫，岐通广寒，毓巨蚌以怀宝，烁灵乌而化丹，铅裹生金，傥根源之尽识； 沙中孕汞，谅配合以非难。 用能化尘，凡於轻举，救着艾之衰残者也。 原夫药本自求，炉须躬炼，飞神水以沥液，注华池而激溅，水火抽添，阴阳运扇，周三百六旬之内，历坎经离； 瑜七十二候之中，驱雷走电。 深沈九宫，踞虎蟠龙，启三才之关键，造八卦之门塘，进火发爻、始因冬而浪夏； 顺天成物，爰自夏以终冬。 默运神机，潜符圣矩，输环十二，周旋三五，控制阴阳，降伏龙虎。 探七返九还之妙，下绩良金； 采一水二火之华，上归真土p岂不以既周复始，自有生无，化刚柔之药物，满乾坤之鼎炉，资之以金英玉屑，育之以阳大阴符，权造化於形身，两输圣象； 缢光明於洞府，一颗灵珠。 妙用潜施，真源暗契，渐赤酒於枝叶，沃黄苏於根蒂，犬饵龙骊，人餐蝉蜕，点凡为圣。 非差出世之功，驻貌留颜，不减后天之岁，．故得髓凝霜白，骨化金坚。 此浮华於密网，指归路於寥天，不拘百六之期，休嗟短晷； 逃出阴阳之外，任变流年。 勉哉！ ．达士宜亲，真精可保，念浮生之易暮，何知机之不早？ 君看荣辱与升沈，北郁丘珑长安道。 阴丹诗 尘世名房术，仙家号隐书，三峰贻秘旨，五字着真枢。 主客防先动，阴阳贵合符，每调冲气顺，无使欲情舒。 顾惠须生害，存终若慎初，三田金液满，凡质换冰肤。 海蟾子还丹赋 若夫还丹最尊，起自乾坤，使一气而三才列位，命五行而九曜齐分，黑白相兼，喷阴阳之雨露，青黄配合，散日月以胚浑。 当其建造红炉，并安真鼎，铅借水之胞胎，汞托肠而淇滓。 上不搜於山境，下不讨於凡尘，集卯酉於三峰，会坎离於两岸，既明妙有，龟蛇而那不依投，得达虚无，乌兔而自然相伴。 况乃却老之丹j延年莫失。 绵绵而点出金容，历历而化成琼质。 行兮生兮，俄然而走作庚辛； 动兮静兮，倏忽而驱分甲乙。 秀平黄牙，长乎河车，以河车河车本借於黄牙、养黄牙，黄牙根蒂接河车、载着人兮命转赊，三魂缭绕归谁洞，七魄徘徊去我家。 频经否泰，三一而子母难逃。 所遇炎冻，二八而夫妻莫去。",
      "translated_text": "**Secret Formulae of Internal Alchemy**\n\n**Title:** *Secret Formulae of Internal Alchemy*. Author unknown, likely composed before the Northern Song dynasty. One scroll. Source text: *Daoist Canon of the Zhengtong Era*, *Tai Xuan* Section.\n\n---\n\n### **Rhapsody on Internal Alchemy**\n*(Rhymed to \"Refining the Dragon and Tiger, Accordant with the Heavenly Dao\")*\n\nVast as the clouded sea, its paths lead to the Broad Cold Palace;\nThe giant clam nurtures its treasure, the sacred crow smelts the elixir.\nLead enfolds living gold—if one fully grasps the root and source,\nMercury gestates within cinnabar—truly, their union is no difficult task.\nThus can the dust be transformed, the common man ascend lightly,\nRescuing those withered by moxa’s decay.\n\nNow, the medicine must be sought within, the furnace refined in person.\nThe flying spirit-water drips its essence, pouring into the Flowery Pond in splashing torrents.\nWater and fire are drawn and added, yin and yang wielded like fans,\nCircling within three hundred and sixty days, traversing Kan and Li;\nAmid seventy-two seasonal nodes, driving thunder and racing lightning.\nDeep within the Nine Palaces, the tiger coils and the dragon crouches,\nUnlocking the gates of the Three Powers, forging the portals of the Eight Trigrams.\nAdvancing fire to activate the lines, beginning in winter and surging through summer;\nFollowing heaven to perfect things, from summer’s start to winter’s end.\nSilently moving the divine mechanism, subtly aligning with the sagely measure,\nConveying the twelvefold cycle, revolving the Three and Five,\nMastering yin and yang, subduing dragon and tiger.\nProbing the marvel of seven returns and nine reversions, refining fine gold below;\nGathering the essence of one water and two fires, returning above to the true earth.\nIs it not so? Having completed the cycle, it begins anew—from being to non-being,\nTransmuting the hard and soft medicines, filling the cauldron of heaven and earth.\nNourished by golden blossoms and jade fragments, cultivated by the Great Yang and Yin Talismans,\nIt governs creation within the bodily form, twinning the sagely image in dual transmission;\nConcentrating radiance within the grotto-realm, a single luminous pearl.\nIts wondrous workings operate in concealment, its true source secretly aligned.\nGradually, the red wine suffuses branches and leaves, the yellow vitality revives root and stem.\nThe dog feeds on dragon’s marrow, the man consumes cicada’s molt—\nTransmuting the mortal into the sagely.\nNot through some divergent worldly merit, but by halting the visage and preserving the countenance,\nUndiminished by the years of later heaven.\nThus the marrow congeals like frost-white snow, the bones transform into unyielding gold.\nThis floats beyond the net of vanity, pointing the way home through the boundless sky,\nUnbound by the hundred-and-six cycles of calamity, untroubled by the fleeting hours;\nEscaping beyond yin and yang, letting the passing years change as they will.\n\n**Take heed!**\nThe enlightened should draw near, the true essence may be preserved.\nPonder how swiftly fleeting life darkens—how can one not seize the moment early?\nBehold the rise and fall, honor and disgrace, along the long road to Chang’an’s northern hills.\n\n---\n\n### **Poem on the Yin Elixir**\nWorldly arts are called \"famed techniques,\"\nDaoist teachings are known as \"hidden scriptures.\"\nThe Three Peaks bequeath secret instructions,\nThe Five Characters reveal the true pivot.\nGuest and host must guard against premature movement,\nYin and yang prize harmonious accord.\nWith each regulation, let the *chong qi* flow smoothly,\nNever indulging the passions’ release.\nBeware that kindness may breed harm,\nPreserve the end as carefully as the beginning.\nWhen the Three Fields brim with golden liquid,\nThe mortal frame is exchanged for skin like ice.\n\n---\n\n### **Rhapsody on the Toad’s Returning Elixir**\n*(By Hai Chan Zi)*\n\nNow, the Returning Elixir is most revered, arising from Qian and Kun.\nIt employs the One Qi to array the Three Powers, commands the Five Phases to divide the Nine Luminaries.\nBlack and white intermingle, spraying the rain and dew of yin and yang;\nBlue and yellow unite, scattering the sun and moon to form the primordial chaos.\nWhen the crimson furnace is established and the true crucible set in place,\nLead borrows the womb of water, mercury rests in the intestines, free of dross.\nAbove, it does not seek the mountain’s depths; below, it does not seek the mortal dust.\nGathering *mao* and *you* at the Three Peaks, meeting Kan and Li on the two shores.\nOnce the wondrous existence is understood, the tortoise and snake naturally submit;\nHaving attained the realm of emptiness, the crow and hare spontaneously keep company.\n\nMoreover, the elixir that reverses aging—let not its opportunity slip away.\nEndlessly, it refines the golden visage; clearly, it transforms into jade-like substance.\nMoving, living—suddenly it hastens as *geng* and *xin*;\nActive, still—swiftly it divides as *jia* and *yi*.\nThe yellow sprouts flourish, the River Chariot endures.\nThe River Chariot is lent to the yellow sprouts, nurturing them;\nThe yellow sprouts’ roots connect to the River Chariot, bearing the person—\nAh! Life’s turning is distant.\nThe three *hun* wander—whose grotto do they return to?\nThe seven *po* linger—do they depart from my home?\nThrough repeated cycles of fortune and misfortune, the Three Ones—mother and child—cannot escape.\nEncountering heat and cold, the Two Eights—husband and wife—do not part.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 888,
      "start_sentence": 0,
      "end_sentence": 39,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.16425323486328,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\内丹秘诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "奇哉！ ．杳路能朝，万振之源，显秘枢机，解返百流之祖，荣华海内，忙忙而尽遣成灰，寂寞寰中，落落而独不为土。 劝英人须省悟大道，从来天岂负？ 见雌雄而密隐藏，闻水火而牢保护，莫因循，可惜许，一落丘墟，安能再睹？ 青龙降兮蟠白虎。 朱雀腾兮投玄武，千朝火候感神功，白日冲升归紫府。 至真歌 我谓诸君说端的，命蒂由来在真息，照体长存空不空，灵境同天容万物。 太一布妙人得一，得一善持慎勿失，官室虚闲神自居，灵府煎熬血液枯。 一悲一喜一思虑，一纵一劳形渐蠹，朝伤暮损迷不知，气乱精神无所据， 细细销磨渐渐衰，用竭元和神乃去。 尽道行禅坐亦禅，圣可如斯凡不然， 蹉跎不解去刑棘，未闻美稼出荒田。 九年温养火候足，玄应无心神乃速， 无心心即是真心，动静两忘为离欲。 神是性兮气是命，神不外驰气渐定， 本来二物更谁亲，失了将何为本柄。 初将何事立根基，处无为处是无为， 念中景象须除拨，梦裹精神牢执持。 不荡不凝为大要，不方不圆为至妙， 灵源内运即成真，呼吸外驰终未了。 透金贯石不为难，坐在立忘犹倏忽， 此道易知不易行，行忘所行道乃毕。 若将闭气为真事，数息按图俱未是， 比来放下谓尘劳，内又萦心两何异。 但看婴儿胎处时，岂解有心潜算计？ 一味酝酬甘露浆，饥渴消溶见真素。 他年功满乃逍遥，初时炼洒须勤苦， 勤苦之中又不勤，闲闲只要养元神。 奈何心使闲不得，到了纵横只在人， 我今苦中至苦行，草衣木食孤又静。 若於闲处用功夫，争似旷然修大定， 形神设使两难全，了命未能先了性。 专气致柔神久留，往来真息自休休， 绵绵迤迩归元本，不汲灵泉长自流。 三万六千为大功，阴阳节候在其中， 蒸融关脉变筋骨，处处光明无不通。 三彭走出阴尸宅，万国来朝赤帝官， 借问真人何处来，从来元只住丹台。 昔年云雾深遮蔽，今日相逢道眼开， 此非一朝与一夕，是我本真不是卫。 岁寒坚确如金石，战退阴魔因慧力， 皆由恬淡复精专，便是华胥清今国。 不为奔名与逐利，绝却人情都没事， 掀天声价又如何，骑马文章奚足贵，工巧琴诗与词赋，多能背了修行路。 恰如薄雾与轻姻，闲伴落花随柳絮，缥渺幽闲天地问，到了不能成雨露。 元气不住神不安，蠹木无根枝叶乾，休论涕唾与精血，执本穷源总一般。 此物何尝有定位，临时变化由心意，在体感热即为汗，在鼻感风即为涕， 在肾感合即为精，在目感悲即为泪，往来流转润一身，到头不出於神水。 神妙难言识者稀，滋生一切绿精气，半藏岁月太因循，比来修炼赖神气。 名与身兮竟孰亲？ 神气不安空苦辛，可怜一个好基趾，金殿玉堂无主人。 劝你主人长久住，至靖安闲无用处，无中妙有执捉难，癣养婴儿须藉母。 包藏俊辩复缄默，收卷精神学愚鲁，坚心一志向前程，成与未成期必取。 牛颊先生赠马处士歌 马处士，马处士，数年前，向盆浦，相逢正是三春时节，携手走红尘，寻遍庐山洞穴。 百花斗艳香林泉，万朵峰峦如黛泼，只闻禽乌声啾啾，不见郾市闹聒聒。 檐酒两葫芦，遇个溪边歇，黄金雕嫩精，紫玉采新蕨，旋敲石火烹，时折松花燕。 连饮七八锺，不觉两耳热，恍然慧性通希夷，石上狂歌叫快活。",
      "translated_text": "Marvelous indeed!\nThe distant path can be traversed at dawn—\nsource of the myriad vibrations,\nmanifest and hidden pivot of the mechanism.\nIt unravels and returns to the ancestor of the hundred streams,\nwhile within the sea of glory and splendor,\nall things in haste turn to ash.\nIn the silent vastness of the world,\nonly it alone does not become dust.\n\nI urge the wise to awaken to the Great Dao—\nhas Heaven ever been untrue?\nSee the *yin* and *yang* and conceal them in secrecy;\nhear of water and fire and guard them steadfastly.\nDo not procrastinate—how lamentable!\nOnce fallen into ruins,\nhow can one ever behold them again?\n\nThe Azure Dragon descends and coils round the White Tiger;\nthe Vermilion Bird soars and plunges into the Dark Warrior.\nAfter a thousand mornings, the fire-tending evokes divine merit—\nin broad daylight, one ascends to the Purple Court.\n\n*The Song of Utmost Truth*\nI tell you gentlemen the truth:\nthe stem of life has always lain in the true breath.\nIlluminating the body, it abides in emptiness yet is not empty;\nthe numinous realm, like Heaven, embraces the ten thousand things.\n\nThe Great One spreads its wonders—let man attain the One.\nHaving attained the One, guard it well and never lose it.\nIn an empty and tranquil chamber, the spirit dwells of itself;\nin the numinous palace, scorching and smelting dry the blood and fluids.\n\nOne sorrow, one joy, one thought, one care—\none indulgence, one toil, and the body gradually decays.\nHarming at dawn, damaging at dusk, deluded and unaware,\nqi scatters, the spirit has no place to rest.\nSlowly, slowly it wears away, gradually declining—\nwhen the primordial harmony is exhausted, the spirit departs.\n\nAll speak of walking meditation and sitting meditation as the same,\nbut while the sage may be thus, the common man is not.\nWasting time without cutting away the thorns,\nwho has ever heard of fine crops growing in a barren field?\n\nAfter nine years of gentle nurturing, the fire-tending is complete—\nthe mysterious response is effortless, and the spirit hastens.\nThe effortless mind is the true mind;\nin motion and stillness both forgotten, one departs from desire.\n\nSpirit is nature, qi is life.\nWhen the spirit does not stray outward, qi gradually settles.\nOriginally two things—yet which is closer?\nIf lost, what remains to grasp as the root?\n\nWith what does one first establish the foundation?\nAbide in non-action where non-action is—\nscenes in the mind must be swept away,\nspirit in dreams must be firmly held.\nNeither drifting nor congealing is the great essential;\nneither square nor round is the supreme subtlety.\nWhen the numinous source operates within, it becomes real;\nwhen breath scatters outward, it remains unfinished.\n\nPiercing metal and penetrating stone are not difficult—\nsitting in oblivion, standing in forgetfulness, swift as a flash.\nThis Dao is easy to know but hard to practice;\nwhen practice forgets itself, the Dao is complete.\n\nIf one takes breath-holding as the true matter,\ncounting breaths or following diagrams—both are mistaken.\nLately, one lays aside worldly toil,\nyet inwardly, the heart remains entangled—how is this different?\n\nJust observe an infant in the womb—\ndoes it secretly scheme and calculate?\nIt savors only the sweet dew,\nhunger and thirst dissolve, revealing true simplicity.\n\nIn later years, when merit is complete, one roams freely—\nbut at first, refining and washing require diligence and toil.\nYet within diligence and toil, there is no diligence—\nidly, idly, one need only nurture the primordial spirit.\n\nAlas! The heart will not allow idleness—\nin the end, whether one wanders or abides depends on the person.\nI now practice the bitterest of bitter austerities—\nclothed in grass, eating bark, solitary and still.\n\nIf one applies effort in idleness,\nhow can it compare to the vast cultivation of great samādhi?\nIf form and spirit cannot both be preserved,\none may complete life but cannot first complete nature.\n\nConcentrate qi to attain softness, and the spirit lingers long;\nthe true breath comes and goes, naturally at rest.\nContinuous and unbroken, it returns to the primordial root—\nwithout drawing from the numinous spring, it flows forever.\n\nThirty-six thousand days make the great work;\nwithin them lie the rhythms of yin and yang.\nSteaming and fusing the meridians, transforming sinew and bone,\neverywhere radiant and unobstructed.\n\nThe Three Corpses flee the yin abode of the corpse;\nthe myriad lands come to pay homage at the palace of the Red Emperor.\nI ask: whence comes the true person?\nFrom the beginning, he has dwelt only in the cinnabar terrace.\n\nIn former years, clouds and mist deeply obscured him;\ntoday, we meet, and the eye of Dao opens.\nThis is not a matter of a morning or an evening—\nit is my original truth, not a mere defense.\n\nFirm as metal and stone in the cold of winter,\nrepelling yin demons through the power of wisdom—\nall arises from tranquility and single-minded devotion,\nwhich is the Pure Land of Huaxu in this very age.\n\nDo not chase fame or pursue profit;\ncut off human attachments and be free of affairs.\nWhat use is a sky-reaching reputation?\nWhat value is there in riding horses or composing essays?\nSkill in zither, poetry, or lyrics—\nmastery of many arts only obstructs the path of cultivation.\n\nLike thin mist or light smoke,\nidly accompanying fallen blossoms and willow fluff,\nfloating and secluded between Heaven and Earth—\nwhen the time comes, they cannot become rain or dew.\n\nIf primordial qi does not abide, the spirit is not at peace;\na worm-eaten tree with no roots withers its branches and leaves.\nNo need to speak of tears, saliva, or essence-blood—\ngrasping the root and exhausting the source, all are the same.\n\nThis thing has never had a fixed position—\nits transformations at the moment depend on the heart’s intent.\nIn the body, when heat is felt, it becomes sweat;\nin the nose, when wind is felt, it becomes mucus;\nin the kidneys, when union is felt, it becomes essence;\nin the eyes, when sorrow is felt, it becomes tears.\nFlowing and circulating, it moistens the entire body—\nin the end, it does not depart from the spirit-water.\n\nIts wonder is hard to describe—few recognize it.\nIt nourishes all things with the green essence-qi.\nHalf a lifetime spent in procrastination—\nonly now does cultivation rely on spirit and qi.\n\nWhich is closer—name or self?\nWhen spirit and qi are not at peace, one labors in vain.\nPity the fine foundation—\na golden hall and jade chamber without a master.\n\nI urge you, master, to abide long—\nin utmost stillness and tranquility, there is no use.\nThe wondrous existence within emptiness is hard to grasp—\nnurturing the infant requires the mother.\n\nEnveloping keen discernment, yet remaining silent;\ngathering in the spirit, learning to be dull.\nWith a steadfast heart and single purpose, press forward—\nwhether achieved or not, strive to attain it.\n\n*Song of Ox-Cheek Master to Horse Recluse*\nHorse Recluse, Horse Recluse,\nyears ago, by the Basin’s shore,\nwe met in the season of late spring.\nHand in hand, we walked the red dust,\nsearching every grotto of Mount Lu.\n\nA hundred flowers vied in splendor amid fragrant groves and springs;\nten thousand peaks, like ink-splashed brows.\nOnly the twittering of birds was heard—\nno clamor of markets or towns.\n\nTwo gourds of wine beneath the eaves,\nresting by a stream.\nCarved gold cups of tender essence,\npurple jade plates of fresh fern.\nStriking flint to boil,\nplucking pine blossoms to garnish.\n\nDrinking seven or eight cups in a row,\nunaware of flushed ears.\nSuddenly, wisdom-nature pierced the mystery—\non the rocks, we sang wildly, shouting with joy.",
      "overlap_context": "yellow sprouts flourish, the River Chariot endures.\nThe River Chariot is lent to the yellow sprouts, nurturing them;\nThe yellow sprouts’ roots connect to the River Chariot, bearing the person—\nAh! Life’s turning is distant.\nThe three *hun* wander—whose grotto do they return to?\nThe seven *po* linger—do they depart from my home?\nThrough repeated cycles of fortune and misfortune, the Three Ones—mother and child—cannot escape.\nEncountering heat and cold, the Two Eights—husband and wife—do not part.",
      "start_char": 888,
      "end_char": 2191,
      "start_sentence": 40,
      "end_sentence": 98,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.740983963012695,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\内丹秘诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "十步五步打一癫，撷倒便睡，睡觉都来一饷问？ 樵人却道已经数个月。 盘花石上再开蹲，湿透肺肠神爽悦，玉霄丹汉的有期，谪利沽名何足说。 道却此言，与君相别。 别君后，入合皂，访清虚，登紫合，游郁木，壶中真境自逍遥。 尘世流光任催促，时人笑我馒落魄，晦迩韬光我自乐，衣挂绿蓑笠，编青箬，手中擎个大铁杓，觅钱沽酒混五浊口蓦然走到麻姑山下，建昌军裹，酒楼上见四个汉子，人人衣衫破弊，个个仙骨有异，长啸高吟，似醉非醉。 我问个捧剑者小童，言道锺离处士、吕先生、刘海蟾、陈七子，四人唤我道，近前来，道我天骨奇伟真神仙，数十年搜寻贤士未得，如是便传我金丹之秘。 向我道杳杳冥冥，其中有精，恍恍惚惚，其中有物，物非常物，精非常精，天得之清，地得之宁，人得之灵，万物得之生，但抱元守一，挫锐解纷，手持七星剑，回天关而转地轴，会阴阳而合乾坤，开坎离之门户，放龙虎之相吞，戊己之变化，俟功成而丹成。 此乃上天之灵宝，人中之殊珍，妙中之妙，尊中之尊，秘而慎之，行而在勤。 马处士，马处士，此个法术是人有分，只为识昧神昏，世欲沈坠，贵耳贱目，知者又能有几个？ 不是妄想存神，便是漱津咽唾，不是导引劳形，便是闭息枯坐，不是咽纳外风，便是休粮忍饿。 或即外烧铅汞，或即阴丹淫堕，或瞳饭了乱说虚空。 自是罪人，却言因果，番语胡言。 更云持课论，甚佛注禅机，传甚祖师达磨。 形不炼兮神不存，梦幻虚华瞥然过，人人尽道已往西方，元来化作一堆灰火。 马处士，马处士，向恍惚中求取物，杳冥中求取精，形神洞达，与道合真，惟君与我。 青城山后岩栖谷子灵泉井歌 谷子有一灵泉井，通彻昆仑山峰顶，中有水味号酝酗，济度草生活性命。 其水四季长不绝，世人得吃实快活，两轮日月现其间，乌兔交加无暂歇。 此井人人尽目睹，千千万万不解取，近着即便落其间，没溺之人不知死水省并全难质吃玉则沈沈觅死折说匹密歇行全坚数。 谷子有一妙竹竿，觅得之时骨永，心中节节皆通透，取水之时力又。 不使桶，非用瓶，只向竿头敢把，自使往来无损折，终朝取水不曾。 此竹竿，堪爱惜，抽出水味甜如，若人有病吃便安，能除饥渴难可。 千经万论露真诀，若是水竿须口，不因师指实难寻，时人若把即便一竿竹，一泉水，济度修学人不，有时显露向人问，不见一人回心。 说此井，不方探，近着之时尽没，唯有谷子得微旨，妙能取水识浮。 不销忙，非用力，自有些些微妙，水满之时即便抽，注入金瓶浸珠。 不曾危，不曾失，只么平平常日，年深日久自通灵，能变老容成少。 谷子竹竿似等闲，世人若把实然，才到井边须失落，万人难有一人一竿竹，一泉井，世人浮财难可，财物煞人人不知，井水活人人不。 但是神仙露微旨，个个无不说此，若人日夜炼来餐，吃着留形终不死。 金虎白龙诗 张果述 铅汞传来百万秋，几人认得几人修，若教世上知灵药，天上神仙似水流。 大道分明在目前，时人不会馒求铅，黄芽本是乾坤气，神水根基与汞连。 姥女初生醉似泥，千朝暗室不束西，虔心日夜勤调火，莫遗灵丹气不齐。 天地初生日月高，状如鸡子状如桃，阴阳直气知时节，直待三年始脱胞。",
      "translated_text": "Ten paces, five paces—strike a fit of madness,\nstumble and fall asleep at once.\nAwake, how long has passed?\nThe woodcutter says, \"Months already.\"\n\nCrouching again on the patterned stone,\nlungs and bowels drenched, spirit refreshed and joyful.\nThe jade dawn and cinnabar Han await their time—\nwhat need to speak of worldly profit or fame?\n\nHaving said this, I take leave of you.\nAfter parting, I enter the dark forest,\nseek the Pure Void,\nascend the Purple Terrace,\nwander the lush groves—\nwithin the gourd’s true realm, I roam free.\n\nThe world’s fleeting light presses on,\nothers laugh at my carefree ways.\nI conceal my brilliance and delight in obscurity,\nclad in green straw cloak and bamboo hat,\nholding a great iron ladle in hand,\nbegging for coins to buy wine and muddle through the Five Turbidities.\n\nSuddenly, I arrive beneath Mahu Mountain,\nwithin Jianchang Prefecture.\nAtop a wineshop, I see four men—\neach in tattered robes,\neach with the extraordinary bones of immortals.\nThey chant and sing loudly,\nseeming drunk yet not drunk.\n\nI ask a young attendant holding a sword,\nwho tells me: \"Master Zhongli, Master Lü, Liu Haichan, and Chen Qizi.\"\nThe four call to me: \"Come closer!\nYour celestial bones are rare and truly divine.\nFor decades, we’ve searched for worthy ones in vain—\nnow we shall transmit to you the secret of the Golden Elixir.\"\n\nThey say to me:\n\"In the dim and distant, there is essence;\nin the vague and indistinct, there is substance.\nThis substance is no ordinary substance,\nthis essence no ordinary essence.\nHeaven gains clarity from it,\nEarth gains tranquility,\nhumans gain spirit,\nall things gain life.\n\nSimply embrace the Origin and guard the One,\ntemper sharpness and resolve strife.\nHold the Seven-Star Sword,\nturn the Heavenly Gate and shift the Earth’s axis,\nharmonize yin and yang, unite Qian and Kun,\nopen the gates of Kan and Li,\nrelease the Dragon and Tiger to devour each other,\nawait the transformations of Wu and Ji—\nthen the work is complete, and the Elixir is formed.\n\nThis is the divine treasure of Heaven,\nthe rarest jewel among men,\nthe subtlest of subtleties,\nthe most revered of the revered.\nGuard it in secret,\npractice it with diligence.\"\n\nHorse Recluse, Horse Recluse,\nthis art is within reach of all,\nyet most are blinded by ignorance, their spirits dull,\nensnared by worldly desires,\nvaluing hearsay over sight.\nHow many truly understand?\n\nSome vainly preserve spirit in delusion,\nor swish saliva and swallow it.\nSome exhaust their bodies with daoyin,\nor sit in rigid stillness, holding their breath.\nSome inhale external winds,\nor endure hunger by fasting.\nSome externally refine lead and mercury,\nor sink into debauchery with yin elixirs.\nSome, having eaten their fill, prattle of emptiness—\nyet they are the true sinners,\nyet they speak of karma,\nspouting foreign gibberish.\n\nThey claim to divine fortunes,\nor expound on Chan’s mysteries,\nor transmit the teachings of Patriarch Bodhidharma.\nBut without refining the body, the spirit cannot abide—\nfleeting as dreams, illusory as flowers,\nthey vanish in an instant.\nAll claim to have gone to the Western Paradise,\nyet in the end, they turn to a pile of ashes.\n\nHorse Recluse, Horse Recluse,\nseek substance in the vague and indistinct,\nseek essence in the dim and distant.\nWhen form and spirit penetrate the Dao,\nonly you and I achieve true union.\n\n*Song of the Spirit Spring Well by Valley-Dwelling Master of the Rock*\nThe Valley Master has a Spirit Spring Well,\nconnecting to the peaks of Kunlun’s summit.\nIts waters, called \"fermented brew,\"\nsustain the lives of grasses and beings.\n\nThe well’s flow never ceases through the four seasons,\nthose who drink it find true delight.\nWithin, the twin wheels of sun and moon appear,\nthe Crow and Hare endlessly chase each other.\n\nThis well is seen by all,\nyet thousands upon thousands fail to draw from it.\nThose who draw too near fall in,\ndrowning without knowing death—\nthe well’s depths are unfathomable, its waters perilous.\n\nThe Valley Master has a wondrous bamboo pole,\nfound when bones were eternal.\nIts nodes are all unobstructed,\ndrawing water with effortless strength.\n\nNo bucket, no jar—\nonly the pole’s tip dares to dip.\nIt comes and goes without damage,\ndrawing water all day without fail.\n\nThis bamboo pole is precious,\nits water sweet as honey.\nThose who drink it when ill are healed,\nrelieving hunger and thirst with ease.\n\nA thousand scriptures and ten thousand discourses reveal the true secret—\nif one grasps the pole and the water, one must guard it closely.\nWithout a master’s guidance, it is hard to find.\nYet if one holds this bamboo pole and this spring’s water,\nit sustains those who cultivate and study.\n\nAt times, it reveals itself to people,\nyet not one turns their heart toward it.\n\nSpeaking of this well is no easy task—\nthose who draw too near are swallowed whole.\nOnly the Valley Master grasps its subtle meaning,\nskillfully drawing water and knowing its depths.\n\nNo haste, no force—\nonly a subtle art.\nWhen the water is full, withdraw it at once,\npouring it into a golden vase to steep pearls.\n\nNo danger, no loss—\njust the ordinary passing of days.\nOver years and months, it becomes spiritually attuned,\ntransforming old age into youth.\n\nThe Valley Master’s bamboo pole seems common,\nyet if others grasp it, it is truly rare.\nAt the well’s edge, they lose it—\namong ten thousand, scarcely one succeeds.\n\nOne bamboo pole, one spring well—\nworldly wealth is fleeting and hard to grasp,\nyet riches destroy men, and none know it.\nThe well’s water gives life, yet none seek it.\n\nWhen immortals reveal subtle truths,\nall speak of this,\nyet if one refines and consumes it day and night,\neating it preserves the form and averts death.\n\n*Poems of the Golden Tiger and White Dragon*\nBy Zhang Guo\n\nLead and mercury have been passed down for a hundred thousand autumns,\nhow many recognize them? How many cultivate?\nIf the world knew the divine medicine,\nimmortals would flow like water in Heaven.\n\nThe Great Dao is clearly before us,\nyet people fail to seek the true Lead.\nThe Yellow Sprout is the qi of Qian and Kun,\nthe root of divine water connects to mercury.\n\nThe Maiden, newly born, is drunk as mud,\na thousand mornings in the dark chamber, not bound by west or east.\nSincerely tend the fire day and night,\nlest the divine elixir’s qi be uneven.\n\nWhen Heaven and Earth first gave birth, the sun and moon were high,\nshaped like an egg, shaped like a peach.\nThe qi of yin and yang knows the seasons—\nonly after three years does it shed its womb.",
      "overlap_context": "or amid fragrant groves and springs;\nten thousand peaks, like ink-splashed brows.\nOnly the twittering of birds was heard—\nno clamor of markets or towns.\n\nTwo gourds of wine beneath the eaves,\nresting by a stream.\nCarved gold cups of tender essence,\npurple jade plates of fresh fern.\nStriking flint to boil,\nplucking pine blossoms to garnish.\n\nDrinking seven or eight cups in a row,\nunaware of flushed ears.\nSuddenly, wisdom-nature pierced the mystery—\non the rocks, we sang wildly, shouting with joy.",
      "start_char": 2191,
      "end_char": 3437,
      "start_sentence": 99,
      "end_sentence": 133,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.004183769226074,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\内丹秘诀.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "世人何处觅黄芽，此物铅中是我家，铅汞共成真地气，脱胞方始见灵砂。 满世黄芽人不识，识得黄芽家不贫，黄芽岂使世人识，纵识黄芽不得门。 二气丹砂不足灵，真成真气用黄轻，铅中有物丹中汞，人自迷津落路行。 合於天地合於玄，子母相并不敢言，先汞后铅真大道，莫教失伴鹤归天。 此物从分二八传，吉年吉月入炉安，千朝火候知时节，莫遣牙成汞不乾。 汞在中宫牙在南，先须斟酌莫教参，黄芽不是难求药，人自无知口不缄。 满市黄芽无不归，世人轻宴治尘微，公卿尽识真灵药，至死贪婪斗晓晖。 日月延人人自忙，分明真道不穷阳，家家尽有铅和汞，使得迷人入渺茫。 明明五运自推寻，汞在铅中理最深，铅汞既知人世有，坚须穷道莫沉吟。 大道遗留一卷经，自然匹配作仪形，天生铅汞人问有，何得他州问药名。 用铅须得汞相和，二姓为亲女唱歌，炼到紫河车半地，白云相伴鹤回过。 甲乙神驱造化图，港龙知是好铅酥，分明制出何难会，却道仙家谜语浮。 青龙白虎合为胎，十月炉中满始开，此是黄芽亲口诀，世人何处觅三才。 铅汞居乾不在山，三关昼夜好追攀，少年纵却疏狂性，渐觉廷赢作鬼颜。 道须心向北方穷，黄芽生长在铅中，丹砂姥女真灵药，得伴相将去大蓬。 大道从来不负人，分明铅汞弃如尘，莫言世上无灵药，二气丹砂水火真。 此物天生人不知，阴阳真气兑为离，坎宫五世求名姓，认得黄芽作圣基。 内丹秘诀竟",
      "translated_text": "Where does the world seek the Yellow Sprout?\nThis thing dwells within lead—it is my home.\nLead and mercury together form the true qi of Earth,\nonly after shedding the womb does one see the divine cinnabar.\n\nThe world abounds with Yellow Sprouts, yet none recognize them;\nthose who know the Yellow Sprout never suffer poverty.\nHow could the Yellow Sprout be known to the world?\nEven if known, none find the gate.\n\nThe cinnabar of the two qi lacks spirit,\nonly when true qi is refined with Yellow Light does it become real.\nWithin lead lies the mercury of the elixir—\npeople wander lost, straying from the path.\n\nHarmonized with Heaven and Earth, aligned with the Mysterious,\nmother and child unite, yet dare not speak.\nFirst mercury, then lead—this is the true Great Dao,\nlest the companionless crane ascends to Heaven.\n\nThis thing is passed down through the division of two and eight,\nin an auspicious year and month, placed steady in the furnace.\nA thousand mornings of fire-tending, knowing the seasons,\nlest the sprout forms while mercury remains un-dried.\n\nMercury resides in the Central Palace, the sprout in the South—\nfirst weigh carefully, lest they clash.\nThe Yellow Sprout is no hard-to-find medicine,\npeople’s ignorance alone keeps their lips unsealed.\n\nThe market teems with Yellow Sprouts, yet none return,\nwhile the world lightly feasts, chasing fleeting dust.\nNobles and ministers all know the true divine medicine,\nyet till death they covet, vying for dawn’s glow.\n\nSun and moon extend life, yet people rush in vain,\nthe true Dao is clear, not an endless yang.\nEvery household holds lead and mercury,\nyet deluded, they wander into vast emptiness.\n\nThe Five Movements are plain—simply inquire,\nmercury within lead holds the deepest principle.\nOnce you know lead and mercury exist in the world,\nfirmly pursue the Dao, hesitate no more.\n\nThe Great Dao leaves behind a scroll of scripture,\nnaturally matching to form its proper shape.\nHeaven-born lead and mercury—why seek elsewhere?\nWhy ask distant lands for the name of the medicine?\n\nTo use lead, one must blend it with mercury,\ntwo families wed, the maiden sings.\nWhen refined to half the Purple River Chariot,\nwhite clouds accompany the returning crane.\n\nThe Jia-Yi divine chart drives the workings of creation,\nthe hidden dragon knows this as fine lead-essence.\nClearly wrought—what difficulty lies in understanding?\nYet they dismiss it as immortals’ riddling words.\n\nGreen Dragon and White Tiger unite as an embryo,\nafter ten months, the furnace opens in full.\nThis is the Yellow Sprout’s oral transmission—\nwhere in the world can one find the Three Powers?\n\nLead and mercury dwell in Qian, not in mountains,\nthe Three Passes, day and night, are worth climbing.\nThough youth may indulge in careless abandon,\ngradually one sees the face of a ghost in the mirror.\n\nThe Dao must be pursued northward with the heart,\nthe Yellow Sprout grows within lead.\nCinnabar, the Maiden, is the true divine medicine—\ngaining a companion, they journey to the Great Peng.\n\nThe Great Dao never fails those who seek it,\nlead and mercury are clearly before us, yet cast aside like dust.\nDo not say the world lacks divine medicine—\nthe cinnabar of the two qi is true water and fire.\n\nThis thing is Heaven-born, yet people do not know,\nthe true qi of yin and yang exchanges Kan for Li.\nWithin the Kan Palace, five generations seek names and forms—\nrecognize the Yellow Sprout, and it becomes the foundation of sages.\n\nThe secret formula of the Inner Elixir—consummate.",
      "overlap_context": " to seek the true Lead.\nThe Yellow Sprout is the qi of Qian and Kun,\nthe root of divine water connects to mercury.\n\nThe Maiden, newly born, is drunk as mud,\na thousand mornings in the dark chamber, not bound by west or east.\nSincerely tend the fire day and night,\nlest the divine elixir’s qi be uneven.\n\nWhen Heaven and Earth first gave birth, the sun and moon were high,\nshaped like an egg, shaped like a peach.\nThe qi of yin and yang knows the seasons—\nonly after three years does it shed its womb.",
      "start_char": 3438,
      "end_char": 4041,
      "start_sentence": 134,
      "end_sentence": 151,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.503186464309692,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\内丹秘诀.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}