{
  "source_id": "内修十论",
  "source_file": "chunked_daozang\\内修十论.json",
  "total_chunks": 8,
  "total_original_chars": 7803,
  "total_translated_chars": 44711,
  "total_translation_time": 212.24185156822205,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\内修十论.txt",
    "category": "藏外"
  },
  "full_translation": "**Wang Chongyang’s Ten Discourses on Internal Cultivation**\n*Attributed to an anonymous author*\n\nWang Chongyang, disciple of the Eight Immortals’ Lü Chunyang, was a native of Xianyang in Shaanxi during the late Song and early Yuan dynasties. His seven direct disciples, the Seven Perfected, established the Quanzhen School. Zhang Sanfeng regarded these *Ten Discourses on Internal Cultivation* as the root of Taiji. The Venerable Wang Chongyang’s *Ten Discourses* likewise embody this principle. Those who receive these teachings in the mountains need not seek rare herbs or pluck immortal blossoms—here lies the elixir of longevity, the cinnabar of agelessness. Humbly transcribed here to guide later seekers of the Dao.\n\nBy spirit, one lays the foundation: purging filth, dispelling the dust of craving, and restoring the true state of purity and non-action. When spirit merges with the Great Void, the qi of yin-yang and the Five Phases unites with the qi of Heaven and Earth, becoming one—this is the Taiji of Heaven and Humanity as one. Through the movement of spirit’s transformation, natural harmony arises, seamless and continuous, endlessly shifting, profound and unfathomable—this is Taiji Boxing. Its myriad transformations, shaped by spirit, flow like drifting clouds and ceaseless currents, beginning without fixed form, concluding without set method. Free, unconstrained, at ease—this is the true Taiji Boxing, the natural endowment of humanity, born of the spirit’s transformation. To cultivate one’s innate gifts is to surpass the blue from which it springs. Clinging to old conventions and stagnation yields no new life. One must carry forth the true lineage and innovate to meet the future.\n\n---\n\n**I. On Sitting Meditation**\n\n**Original Text:**\nProlonged sitting wearies the body, which is neither reasonable nor beneficial—it may even breed illness. Yet if the mind does not cling to things and remains unmoving, this is the true foundation of stillness. Using this as the basis of stability, the heart-mind and qi harmonize, and with time, clarity and freshness deepen. By maintaining this awareness, one may discern the true from the false. If all arising thoughts are extinguished, and perception is forever severed, one enters the state of oblivious absorption. But if one indulges every thought without restraint, one differs not from the common person. If one merely severs good and evil without giving the mind direction, letting it drift aimlessly, awaiting self-stabilization, this is self-deception. If one engages in all manner of affairs while claiming the mind remains unstained—though the words sound virtuous, the conduct is deeply flawed. True learners must especially guard against this. Now, one quiets delusion without extinguishing awareness, abides in tranquility without clinging to emptiness, and practices with constancy to attain true insight. If doubts arise, allow them to be pondered until resolution is found and understanding dawns. This, too, is the root of wisdom. Once understanding is achieved, cease all thought—thinking harms the nature with cleverness, injuring the root for the sake of the branch. Though it may display brilliance for a moment, it ultimately undermines a legacy of ten thousand generations. All vexing, perverse, and chaotic thoughts must be eradicated upon arising. When one hears slander or praise, good or evil, dismiss them at once—do not let the mind receive them. To receive them is to fill the mind, and when the mind is full, the Dao has no place to dwell. All that is seen and heard should be as if unseen and unheard, so that the myriad things do not enter the mind. When the mind does not receive externals, it is called an empty mind. When the mind does not follow externals, it is called a peaceful mind. When the mind is peaceful and empty, the Dao naturally comes to reside.\n\n**Exegesis:**\nTo sit as if sitting is to guard a corpse. The living sit without lying down; the dead lie without sitting. A mere stinking skeleton—what use is there in discussing cultivation? One, two, three, four, five—two persons guard one earth. Unravel this meaning, and you are the patriarch of the Western Heaven. The \"two persons\" are the two pupils of the eyes, which do not stray outward; the spirit sits at the center, guarding the earth of the self, steadfast and immovable as Mount Tai—this is sitting. It is not a matter of the physical body but of building the foundation of one’s own spirit. Let bodily comfort determine the duration. The present is not the past; conditions differ across time. The method arises from the mind—naturally, it is the Dao. Sitting to seek understanding of the true principle through quiet reflection is the aim; halting thought to enter a dull void is a grave error in practice. To generate even a single stray thought is to invite illusory realms—this is called falling into demonic influence. The mind is like a mirror: a thousand forms and ten thousand appearances do not obscure its clarity. Let a thousand thoughts and ten thousand strands come and go—abiding in suchness without movement is the practice of sitting. Like an actor on stage, embodying joy, anger, sorrow, thought, grief, fear, and shock, the performer outwardly expresses these emotions, yet the inner world remains unmoved. Through stillness, non-action, and naturalness, wisdom arises. When the mind is absent, one sees yet does not see, hears yet does not hear, eats yet does not taste—sincerity begets efficacy, and efficacy begets clarity. Washing the mind with the mind, turning inward to illuminate, purging filth, halting thoughts to return to emptiness, and guarding the One—all things are accomplished. This surpasses ten thousand volumes of alchemical scriptures. Such is the natural, non-forced practice of sitting.\n\n---\n\n**II. On Emptying the Mind**\n\n**Original Text:**\nThe scriptures say: If one can empty the mind, it is not that one desires the Dao—the Dao naturally returns to them. With the inner mind free of attachments, outward conduct likewise requires no effort. Neither pure nor defiled, praise and blame cannot arise. Neither wise nor foolish, profit and harm cannot disturb. In truth, one abides in constancy amid adaptability, adjusting with the times. To be free of all burdens—this is wisdom. If one forces thought and action out of season or without cause, though one may appear unattached, this is not true learning. Why? The mind is like the eye: even a speck of dust entering it causes discomfort. If trivial matters occupy the mind, the mind becomes disturbed. Once disturbed, it is difficult to enter the gate of stillness. The essence of cultivating the Dao lies in urgently eliminating afflictions—if afflictions are not removed, stillness can never be attained. Like fertile fields overgrown with brambles, fine crops cannot flourish. Love, desire, and anxious thoughts are the brambles of the mind—if not cut away, concentration and wisdom will not arise. With no place to rest, the mind cannot find peace. Even if momentary peace is achieved, it will soon scatter into chaos.\n\nRise and fall as they may, ensure the mind remains unmoved; with long and patient cultivation, it will naturally attain ease and leisure. Whether by day or night, in walking, standing, sitting, or lying down, and in all dealings with affairs and interactions with others, one must intentionally calm the mind. If it has not yet found peace, one must nurture and protect it, avoiding all irritation and disturbance. Even a slight attainment of ease brings its own joy; gradually, through familiarity, one draws ever nearer to purity and transcendence.\n\nConsider cattle and horses, mere domestic beasts—if left unrestrained, they grow stubborn and refuse the yoke. Yet wild hawks and falcons, when tamed by human hands, remain docile at all times, naturally trained to obedience. The mind is no different: if left unchecked and unrestrained, it only grows coarse and scattered—how then can it perceive the subtle and wondrous?\n\n**Exegesis:** The mind is the void and true emptiness, the very essence of the Tathāgata. It is inherently pure, originally empty, solitary and without peer—this is the One Nature. When it encounters objective phenomena, the arising of a single thought gives rise to sensation, perception, volition, and consciousness—this is the human mind. A single thought reflects ten thousand forms; ten thousand thoughts arise from the mind. The empty mind is inherently unmoving; it is only consciousness that moves within it. The more thoughts arise, the void does not increase; with no thoughts, the void does not diminish. The principle of non-increase and non-diminution returns to the fundamental ground. Though ten thousand changes may unfold, they never depart from this ground; when the ground remains unchanging, even a thousand thoughts and ten thousand ideas are naturally harmonious. To perceive one’s mind as disordered is to create duality; the arising of thought is delusion, and duality is not the truth. The disturbance of consciousness is but the obstruction of a single thought; if no second disturbance arises, the mind remains purely sincere.\n\nA thousand thoughts, ten thousand strands—this one arises, that one subsides. A thousand come, a thousand go; ten thousand come, ten thousand depart. The mind is like a mirror: ten thousand thoughts arise from a single thought, and ten thousand thoughts dissolve within that single thought. The single thought of the empty mind remains sincere. Let a thousand thoughts and ten thousand strands come and go as they will; if no second thought arises, it is the purity of a single thought.\n\nLaozi embraced the primordial and guarded the One. Śākyamuni returned the ten thousand dharmas to the perfect clarity of the One Nature. Confucius embodied the purity of the One Thought. Great Shun mastered the One, and the ten thousand dharmas became clear. If one returns the single thought to no-thought, it is the wondrous awakening, the perfect clarity through which the ten thousand dharmas are understood. When the single thought returns to the void, the void returns to the wondrous and great spiritual power.\n\n**3. On Non-Attachment**\n\n**Question:** Those who pursue the Great Dao remain untainted amidst phenomena and undisturbed amidst activity. They act without fail in all matters yet abide in stillness at all times. Now, why do you alone shun activity to seek tranquility, separate movement to pursue stillness? Striving to control the mind only creates the distinction between movement and stillness. Fixating the mind on abiding is itself a form of grasping and rejecting—both flaws remain unrecognized. To cling to externals and call this the essential step of the Dao—how mistaken!\n\n**Answer:** To encompass all things is called great; to pervade all things is called the Dao. To remain untainted amidst phenomena and undisturbed amidst affairs—this is truly great, truly wondrous. Yet your understanding is not yet clear. Why? You see only the brilliance of brocade but do not comprehend the plainness of undyed silk.\n\nJust as one hears the crane’s soaring cry yet fails to recognize its prior nourishment in the valley’s grain, so too does the towering tree begin as the tiniest shoot. The sage’s spirit, concentrated to perfection, is cultivated through accumulated practice. Now you merely speak of the sage’s virtue yet do not comprehend how the sage attains virtue.\n\n**Exegesis:** The awakened nature of perception and cognition is called the Dao-mind. The Tathāgata’s mind is originally unstained. When observing objective phenomena and responding to sensory impressions, the moment a thought arises in consciousness—this is the human mind. The Dao-mind is inherently pure; the human mind is inherently still. Yet when the human mind clings to things, it is led astray by them. Greed and dualistic intention arise—this is the \"three minds and two intentions.\" Such is defilement. A single thought of pure sincerity, free from desire, is called non-defilement. In perfect equilibrium and stillness, when thoughts and desires subside, one recovers one’s original Dao-mind—this is the Dao of returning to emptiness and the wondrous existence, the constant absence of desire through which its mystery is observed. The luminous and unobscured Dao-mind is the innate radiance of wisdom, briefly termed \"wisdom-light.\" This light possesses responsive and interactive functions—what is called the solitary radiance of numinous light. Ordinary light, such as that of a lamp, has no such responsive function, serving only to generate heat and illumination. The lamp is the substance; light is its function. A lamp may be broken, but destroying light alone is impossible. Numinous light cannot be destroyed by any means, for its substance and function are both light, utterly without counterpart. It is not submerged in water, not burned by fire, not severed by blades, not altered by thunder, not scattered by fierce winds. When obscured by phenomena, it remains unillumined. Shattering appearances, removing things, and returning to emptiness—this is self-clarity, the perfect illumination of one’s nature. It is the removal of filth and dust, the cessation of thoughts, and the return to emptiness. This is the true life innate to every human being, the true faith and sincere spirit that illumines itself, attaining wondrous awakening and perfect penetration.\n\n**4. On Simplifying Affairs**\nThe practitioner of the Dao should above all simplify affairs. Know what is essential, discern what is weighty, and clarify what to retain or discard. Whatever is neither essential nor weighty should be entirely abandoned. Just as one may consume wine and meat, wear silks and brocades, hold fame and position, or possess gold and jade—these are all excesses of desire, not the true medicine for nurturing life. The multitude pursues them only to bring about their own ruin. How deeply deluded they are!\n\n**Exegesis**\nThe heart is fundamentally empty and still, serene and untrammeled, solitary and without peer—simplified. There is no perception, conception, volition, or consciousness; no eye, ear, nose, tongue, body, or mind; no form, sound, scent, taste, touch, or dharma; no realm of sight, no realm of consciousness—simplified. As the *Vajracchedikā Sūtra* states, “All sages and worthies are distinguished by the non-doing Dharma.” The *Heart Sūtra of Avalokiteśvara* declares that the wondrous principle of true emptiness, the non-doing Dharma, is the Buddha’s guiding thread. With a mind unmarked by impressions, one contemplates perfect freedom, and all dharmas are empty. Thus one attains great freedom, entering non-doing yet accomplishing all—this is the bodhisattva of great freedom. Observing the myriad phenomena, generating the myriad intentions, responding to the myriad affairs, producing the myriad transformations: what comes is present, what goes is absent, the heart unobstructed—simplified. Dwelling in the sea of humanity amid wind and waves, in the dust yet apart from the dust, in desire yet apart from desire, harmonizing with the world while concealing one’s brilliance, turning from phenomena to contemplate the heart, the heart like a mirror’s clarity—simplified.\n\n**5. On True Contemplation**\nTrue contemplation is the foreknowledge of the wise and the keen discernment of the capable. Every meal and every rest is a source of gain or loss; every action and every word may become the root of fortune or misfortune. Skillfully managing the branches is not as good as clumsily guarding the root. Observing the root to know the branches is not the impulse of restless striving. Restraining the heart and simplifying affairs is called “diminishing doing.” Only when the body is still and the heart at leisure can one contemplate the wondrous.\n\nYet the body of the Dao practitioner must rely on clothing and food. There are affairs that cannot be abandoned and things that cannot be discarded; one must receive them with an open mind and address them with clear eyes. Do not let them become obstacles, stirring up vexation. If affairs cause vexation, the sickness of the heart has already arisen—how can this be called a peaceful heart?\n\nClothing and food are the boat and oars of human life. To cross the sea, one must rely on boat and oars. Why, before crossing, would one first abandon clothing and food? The illusory is truly not worth pursuing, yet one cannot abruptly sever ties to illusion. Though there may be pursuit, do not generate a mind of gain or loss. Whether in activity or inactivity, the heart remains tranquil, seeking the same things as others yet not coveting them, obtaining the same things yet not hoarding them. Without covetousness, there is no worry; without hoarding, there is no loss. One’s traces may resemble others’, but the heart remains apart from the vulgar. This is the essential principle of conduct—one must strive to practice it.\n\n**Exegesis**\nThe eye sees what is before but not what is behind, sees the surface but not the interior. To inspect all things is to see, and seeing is awakening. The eye is merely a transparent organ of crystal; seeing belongs to the heart, not the eye. When the heart is not present, one looks but does not see—this is what is meant by true contemplation. Awakening to the wondrous existence of true emptiness is called contemplation, as in the *Heart Sūtra*’s Avalokiteśvara Bodhisattva. The *Daodejing* says, “Constantly without desire, one observes its mysteries; constantly with desire, one observes its manifestations.” With the eye of wisdom, one contemplates the mundane, seeing the heart and the surface simultaneously—this is called comprehensive contemplation. The Buddha, with supreme wisdom, observes that all sentient beings possess buddha-nature. Mundane contemplation sees only forms and appearances, not penetrating to the nature of the heart—this is called contemplation of appearances.\n\nTrue contemplation recognizes one’s original heart and knows one’s original nature, awakening to who the contemplator is. The contemplator of Avalokiteśvara Bodhisattva is the heart of Tathāgata; the contemplated is also the heart of Tathāgata. Contemplating the heart with the heart is contemplating ○ with ○—what is the object of contemplation? Without perception, conception, volition, or consciousness, without eye, ear, nose, tongue, body, or mind, what is there to contemplate? Turning inward to illuminate, turning back to hear one’s own nature, the hearer is awakening itself. Self-inquiry, self-awakening, self-realization: inwardly, no notions arise; outwardly, no heart of contemplation stirs. Contemplation is freedom, ease, and spontaneity—○. Illuminating the five aggregates as empty—○—thoughts do not generate appearances, the heart does not generate dharmas, non-doing is freedom, which is the natural void—○—of the great Dao.\n\nTo generate the notion of contemplation is to create an obstacle to the wondrous. With obstacles, what can one contemplate? The obscuring of contemplation dulls the contemplator. Without generating the notion of contemplation, one removes filth and dust, ceases thoughts, and returns to emptiness—○. All affairs are perfectly resolved, leaving not a single thing. The contemplation that does not contemplate is true contemplation.\n\n**6. On the Evil of Sensual Traces**\nThough the previous section severs karmic ties and simplifies affairs, some illnesses are difficult to eradicate—one must contemplate them according to the Dharma. If the illness of sensual desire is severe, know that all defilement by sensual forms arises from thought. If thought does not arise, there will ultimately be no affair of sensual forms. Know that sensual forms are empty externally, and the heart forgets sensual desire internally—when thought is forgotten, the heart is empty.\n\nOnly the wise, through skillful contemplation, attain understanding, delight in heaven’s decree, and know fate, thus free from the suffering of poverty and illness. The scriptures say, “Heaven and earth cannot alter their conduct; yin and yang cannot reverse their retribution.” From this, we know it is true fate—what is there to resent?\n\nIt is like a brave warrior encountering bandits: wielding his sword before him, the multitude of villains scatter in flight. Once merit is established, honor and emolument last a lifetime. Now, poverty, illness, and afflictions disturb my body like bandits. Immediately rectifying the heart makes one a brave warrior. Dispelling vexations and burdens is victory; serene and constant joy is honor and emolument.\n\nWhenever suffering comes to press upon my heart, if one does not oppose it thus, one will surely generate worry and burden—like a man encountering bandits who, instead of establishing merit, discards his armor, abandons his troops, flees, and incurs punishment. Forsaking joy for suffering—how pitiable!\n\nIf poverty and illness assail together, contemplate that this suffering arises from having a body. The scriptures say, “When I have no body, what suffering can I have?”\n\n**Exegesis**\nThe true emptiness of the Limitless is pure and utterly still; stillness reaches its extreme, and the Supreme Ultimate arises. The true emptiness of the Limitless—○. The Supreme Ultimate is the primordial undifferentiated qi. The Two Modes are the qi of heaven and earth’s transformations. The Imperial Ultimate is the qi of exchange—this is the material world, human society. From the undifferentiated qi onward, all is collectively called “form,” which arises from the transformation of emptiness.\n\nOn paper, there is only blankness; the artist transforms it into a painting—blank paper is the painting, the painting is blank paper. The Limitless transforms into the Supreme Ultimate—the Limitless is the Supreme Ultimate, the Supreme Ultimate is the Limitless. A single stroke creates all things. One transformation gives rise to heaven, earth, and the myriad beings. Heaven and earth and the myriad beings are nurtured and transformed by emptiness; blank paper is transformed into a painting by the artist. Heaven and earth and the myriad beings originate from emptiness, so emptiness is form, and form is emptiness. Without emptiness, form becomes water without a source, a tree without roots. Emptiness and form are one; emptiness gives birth to being, and being returns to emptiness. Today, six billion people on Earth will all become dust in a hundred years. Emptiness gives birth to illusory appearances, and the substance of appearances returns to emptiness. The nature of awakening is fundamentally empty, neither arising nor ceasing. The Yellow Emperor said: “Heaven and earth undergo material transformation, but the principles and qi have no end or beginning.” The six billion people in today’s human society are, in essence, the ashes of the dead moving about a hundred years hence. When the principles and qi depart from the body, they immediately perish. Heaven and earth and the myriad beings are all ephemeral material forms of true emptiness, their transformations ultimately void. The six billion people on Earth consume the planet daily; the planet’s life is also ephemeral, and when its resources are exhausted, it too will perish. All appearances are illusory. The human body is a temporary, illusory vessel. One wave recedes, another rises—like the Yangtze’s waves, where the new push forward and replace the old. The tide of humanity never ceases: one generation of emperors, one generation of ministers; emperors, generals, scholars, and beauties are but scenes in a film, vanishing without a trace when the time passes. Fame and fortune, wine and women, wealth and passion, the deep love of parents, the profound affection between spouses and children—none enter the flow of the true life ○. Whether you let go or not, it is all the same. Nothing is brought at birth, nothing taken at death—why sacrifice the true luminous life ○ for greed?\n\nAll conditioned things are like dreams, illusions, bubbles, shadows;\nLike dew and lightning, they should be seen as such.\n\n**7. On Supreme Stability**\n\nSupreme Stability is the ultimate departure from the mundane, the first foundation of attaining the Dao, the success of practicing stillness, and the completion of maintaining tranquility. The body is like withered wood, the mind like dead ashes—no grasping, no rejecting, the ultimate of quiescence. With no mind to stabilize, yet nothing is not stabilized. Thus it is called Supreme Stability.\n\nZhuangzi said: “When the universe is supremely stable, it emits celestial radiance.” The universe is the mind; celestial radiance is wisdom. The mind is the realm of the Dao; when emptiness and stillness reach their extreme, the Dao resides there and wisdom arises. Wisdom arises from one’s original nature, not from the person. Thus it is called celestial radiance. But due to the turbidity of greed and attachment, one falls into confusion. When the nature is confused, wisdom does not arise. Once wisdom arises, treasure and embrace it, and do not let excessive knowledge harm stability. It is not difficult to generate wisdom, but difficult to refrain from using it. Since ancient times, many have forgotten form, but few have forgotten fame. To have wisdom and not use it is to forget fame—few in the world attain this, hence it is difficult. To be noble without arrogance, wealthy without extravagance, is to be free from worldly faults, thus one can perpetually maintain wealth and nobility. To be stable and unmoving, to have wisdom and not use it, is to deeply realize the true and constant.\n\nZhuangzi said: “Knowing the Dao is easy; refraining from speaking of it is difficult.” To know and not speak is celestial; to know and speak is human. The ancients were celestial, not human. He also said: “Those in ancient times who cultivated the Dao used tranquility to nurture wisdom. When wisdom arose, they did not employ it as wisdom—this is called using wisdom to nurture tranquility. Wisdom and tranquility nurture each other, and harmony and principle emerge from one’s original nature.” Tranquility and wisdom are stability and insight; harmony and principle are virtue and the Dao. To have wisdom and not use it, to be at peace and tranquil, and to accumulate this over time, is to naturally become virtuous and attain the Dao. Naturally, one is unshaken by thunder splitting mountains, unafraid of blades crossing before one; one sees fame and profit as fleeting as a crack, and knows life and death as a bursting abscess. When the will is undivided, it coalesces into spirit; the mind’s emptiness and subtlety are inconceivable.\n\n**Exegesis**\nThe entire being of the self is inherently empty, numinous, and luminous—○ fundamentally unmoving and uniquely peerless. It is only the ideations and concepts born of the Dao-body that chase after the myriad desires of the world, pursuing them relentlessly and clinging without release. To awaken to the illusory nature of life: the fleeting pleasures of wine, sex, wealth, and passion vanish when the eyes close, and all becomes empty. To sacrifice the true luminous life for this foul skin-bag, enjoying momentary false happiness and enduring eternal true suffering—one believes the foul skin-bag is enjoying, but in truth, it is the nature of awakening that perceives. How can one not know that what is obscured is the wondrous luminous light! When stability, stillness, peace, and contemplation arise, wisdom naturally becomes clear; one suddenly realizes there is no true happiness in the human world, and even extreme joy leads to sorrow. Only the Dao-body ○ abides in ease, eternally radiant; knowing true happiness and abandoning false happiness, seeking principle and awakening to the true source, one understands the natural emptiness. All passes before the eyes, the body forever without trace. Without understanding the true principle, how can the mind be stable? To awaken to the illusory nature of society and life, to know that the unarising and unceasing is true emptiness—say a thousand things, speak ten thousand words, but only self-realization penetrates all dharmas. From ancient times to the present, using the mind to measure: emperors, generals, scholars, and beauties stand above the common people, shining brightly among the masses. But in the end, when all is seen, they are but dust and mud. Whether in Supreme Stability or not, it is all the same—why not naturally and freely awaken to the true and constant?\n\n**8. On Attaining the Dao**\n\n**8. On Attaining the Dao**\n\nThe Dao is a matter of divine marvel—spirit-like yet endowed with nature, empty yet without form. It follows and responds in ways beyond measure, its echoes and reflections ungraspable. One knows not why it is so, yet so it is. The utmost sages attained it in ancient times, and its wondrous methods have been transmitted to the present.\n\nThe Dao possesses profound power, gradually transforming body and spirit. When the body aligns with the Dao, it unites with spirit, and this is called the \"spirit-person.\" The spirit-nature is empty and harmonious, its essence unchanging and undying. As the body moves in accord with the Dao, it transcends birth and death. Concealed, the form merges with spirit; revealed, the spirit merges with qi. Thus, one may tread upon water and fire without harm, face the sun and moon without casting a shadow. Life and death lie within one’s own control, entry and exit occur without obstruction. The body, though but a humble vessel, is already most empty and wondrous—how much deeper and farther does its spiritual wisdom extend?\n\nThe *Scripture on the Generation of Spirit* states: \"When body and spirit unite as one, it becomes the true body.\" The *Western Ascension Scripture* says: \"When form and spirit merge as one, they endure forever.\" Yet the Dao of emptiness and nothingness varies in its power. When profound, it encompasses the body; when shallow, it reaches only the mind. Those who embody it become spirit-persons. Those who grasp it only in mind attain wisdom and awakening, yet their bodies still succumb to decay. Why is this? Wisdom is the function of the mind, and excessive use wearies it. At first, one delights in small insights, engaging in much debate, but this scatters spirit and qi, leaving no radiant light to nourish the body, leading to an early end. This is why the Dao is difficult to fully realize. The scriptures call this \"corpse liberation.\"\n\nThus, the great ones conceal their brilliance and hide their splendor to preserve wholeness. They concentrate spirit and treasure qi, practicing the Dao without intention. When spirit and Dao unite, this is called \"attaining the Dao.\" The scriptures say: \"One who is the same as the Dao, the Dao also attains.\" A mountain with jade causes the grasses and trees around it to never wither. A person who embraces the Dao causes the body to endure forever. Through long cultivation, their essence transforms to become one with spirit. Refining the body to subtlety, they merge with the Dao in darkness. Their wisdom illuminates boundlessly, their form transcends all limits. They employ the interplay of form and emptiness, achieving success beyond creation. True response knows no bounds—only virtue and the Dao.\n\nThe Dao is fundamentally without gain or loss; it is only that worldly people do not know its true essence. The essence of the Dao is the awakened nature bestowed upon humanity by the great Dao of emptiness and nothingness. Laozi called this awakened nature the sole great spirit within the natural world. Confucius spoke of the wondrously awakened and spiritually penetrating rational nature. Śākyamuni spoke of the supreme, right, and accumulated awakened mind bestowed upon all beings by heaven—a mind of vast spiritual power, mysterious and boundless. From the buddhas above to all living beings below, all possess buddha-wisdom. Those constrained by qi-endowment and obscured by worldly desires are called \"sentient beings.\" When the buddha-nature is not dimmed, unshaken by the myriad forms of the human world, one suddenly awakens to life—all is illusory and impermanent. Not seeking, not craving, this is called the \"awakened one.\" The deluded perceive loss where there is none; the enlightened see clarity where there is no gain.\n\nIts mystery and wonder are innate abilities, inherent in all, not achieved through cultivation or effort. It is originally the golden elixir, the precious pearl, but it falls into worldly conditions, buried by the dust of desire and impurity. Through one’s own wondrous luminous wisdom, one polishes away the dust and removes the filth of desire, and it immediately regains its clarity. Like an eye afflicted by illness, removing the obstruction restores its original brightness—medicine does not add to it. The Dao is gold within ore; refining it yields pure gold, which never returns to ore. Wood, once turned to ash, never becomes wood again. When the one nature is perfectly luminous, it abides eternally in the natural—this is called \"ultimate bliss,\" the \"immortal of great awakening that never perishes.\" For humans are the seeds of gods and buddhas; cultivation yields fruit. Attaining the true fruit is called \"attaining the Dao.\" Laozi said: \"The highest virtue is without attainment.\"\n\n**9. On the Pivotal Wings of Sitting in Forgetfulness**\n\nIf one wishes to cultivate the Dao and become a true person, one must first abandon perverse and deviant conduct. Sever all external affairs so they do not disturb the mind. Then, inwardly observe true awakening. When a single thought arises, it must be extinguished at once. As thoughts arise, so must they be extinguished, ensuring tranquility. Next, though not attached to desires, even wandering and chaotic thoughts must be entirely eliminated. Practice diligently day and night, without the slightest lapse.\n\nOnly extinguish the moving mind, not the illuminating mind. Simply concentrate the empty mind, not the fixated mind. Do not rely on any single method, yet keep the mind constantly present. This method is profoundly wondrous, its benefits deep. Without a predestined affinity for the Dao and unwavering faith, one cannot succeed.\n\nIf one’s heart is sincerely inclined toward the supreme Dao, with steadfast and earnest faith, one should first receive the three precepts and cultivate in accordance with them. Reverence at the end must be as at the beginning to attain the true Dao. The three precepts are: first, simplifying conditions; second, eliminating desires; third, calming the mind. Diligently practicing these three precepts without slackening, one need not seek the Dao, for the Dao will come of itself. The scriptures say: \"If a person can always remain pure, heaven and earth will all return to them.\" From this, can the essential method not be trusted?\n\nYet the ordinary mind is restless and competitive, its tendencies long established. Relying on the precepts to still the mind is exceedingly difficult. Sometimes one stills it but cannot hold it; sometimes one pauses briefly, only to lose it again. The struggle between departure and retention causes the whole body to sweat. With long and persistent practice, one gradually becomes adept.\n\nDo not abandon the work of a thousand lifetimes because of a momentary failure to gather the mind. Even a slight attainment of stillness allows one, in walking, standing, sitting, and lying down, or amidst affairs and clamor, to intentionally calm the mind. Whether occupied or at leisure, one should remain as if without mind. In quiet or in noise, one’s resolve should be singular.\n\nIf the mind is bound too tightly, it may generate illness and qi stagnation, leading to madness or delusion—these are the signs. If the mind does not move, one must also allow it freedom, maintaining a balance between tension and relaxation, always adjusting to what is fitting. Restrain without attachment, release without indulgence. In noise, there is no aversion; in affairs, there is no vexation—this is true samādhi.\n\nDo not, because one remains unperturbed amidst affairs, seek out more affairs. Do not, because one remains unmoved by external clamor, draw near to clamor. Regard the absence of affairs as one’s true dwelling, and the presence of affairs as mere responsive traces. Like water or a mirror, one meets things and reflects their forms. Only through skillful means can one enter samādhi. The swiftness or slowness of wisdom’s arising does not depend on human effort. Do not urgently seek wisdom within samādhi, for seeking wisdom harms one’s nature, and harming one’s nature precludes wisdom. When wisdom is not sought, it arises of itself—this is true wisdom. Though wise, one does not employ it, and true insight appears as foolishness. Thus, samādhi and wisdom mutually enhance one another, their beauty boundless.\n\nIf, within samādhi, thoughts arise, one may attract numerous demons and spirits, which manifest in accordance with the mind. Only when the mind in samādhi is suddenly unobstructed above and boundlessly open below do old karmic debts dissolve and new karma cease to form. Unentangled and free, one transcends the snares of the dusty world. With sustained practice, the Dao is naturally attained.\n\nThose who attain the Dao undergo five stages in the heart and seven signs in the body. The five stages of the heart are:\n1. More movement than stillness;\n2. Movement and stillness in equal measure;\n3. More stillness than movement;\n4. Stillness when unoccupied, yet movement when engaged in affairs;\n5. The heart in harmony with the Dao, unmoved by contact.\n\nOnly upon reaching this state does one find true peace, with all karmic defilements extinguished and afflictions no more.\n\nThe seven signs of the body are:\n1. Movement in accord with the seasons, countenance harmonious and joyful;\n2. Chronic illnesses vanish, body and mind refreshed and clear;\n3. Premature injuries are mended, one’s original nature and life restored;\n4. Lifespan extends for millennia, and one is called an immortal;\n5. The form is refined into qi, and one is called a perfected person;\n6. Qi is refined into spirit, and one is called a spirit person;\n7. Spirit merges with the Dao, and one is called a supreme person.\n\nIf, after long practice of calming the mind, one exhibits neither the five stages nor the seven signs, one’s impure and decaying form will return to emptiness. Though one may claim spiritual awakening or even attainment of the Dao, such assertions are unfounded.\n\n---\n\nThe eyes, ears, nose, tongue, body, and mind perceive objective sights, sounds, smells, tastes, touches, and thoughts, each generating attraction or aversion, their memories naturally differing. The myriad phenomena are etched within, and childhood recollections remain vivid. Forgetting and not forgetting occur naturally. Stillness is the innate capacity of life, requiring no conscious effort—original luminous wisdom arises, and ignorance vanishes of itself. Laozi said the natural is the Dao, non-action is the method, for the original state is inherently pure. Without attachment or insistence, allowing things to flow freely, the mind naturally holds neither forgetting nor non-forgetting. Non-action and non-interference leave all thoughts and perceptions unattended. It is like a host who dislikes guests; the guests, ashamed, depart of their own accord. If they do not depart, the host grows weary, and the guests uneasy. Clinging to thoughts disturbs the mind, but forgetting liberates consciousness. Random thoughts, boundless imaginings, fanciful ideas, wild cranes in leisurely flight, wandering freely without restraint—utter chaos and extreme motion are the natural state of samādhi. The world is originally without affairs; it is the ordinary person who seeks them. If the mind does not stir, whence arises disorder? To seek stillness is itself disorder. Neither thinking of movement nor stillness—what then is thought? Spontaneity is the method; naturalness is the Dao. Those who do not recognize their original mind and see their original nature cannot enter non-action. The awakened nature of perception, hearing, and cognition dissolves delusion in each thought.\n\n---\n\n**Inscription on Sitting in Forgetfulness**\n\nEver silent, the primordial qi remains unharmed;\nLittle thought, the lamp of wisdom shines within.\nNo anger, the hundred spirits harmonize and flow;\nNo vexation, the mind-ground is cool and clear.\nNo seeking, no flattery or fawning;\nNo clinging, adaptable as round or square.\nNot covetous—this is true wealth and nobility;\nNot careless—what fear of kings?\nTaste is cut off, and numinous springs descend of themselves;\nQi settled, true breath lengthens.\nAt touch, the form perishes and spirit wanders;\nIn thought, one dreams, leaving the corpse rigid.\nQi leaks, and the form returns to the grave;\nThoughts leak, and spirit hastens to the realm of death.\nOnly when the heart dies does spirit live;\nOnly when the corporeal soul perishes does the ethereal soul grow strong.\nThe subtleties of all things are difficult to fathom;\nTransformations do not depart from the true constant.\nSupreme essence hides in the indistinct;\nThe great image merges with the vast and vague.\nThe transformations of the Dao resemble the transformations of things;\nEven spirits cannot fathom its movements and concealments.\nNo drinking, no eating, no sleeping—\nThis is the true person’s sitting in forgetfulness.\n\nWhen the heart forgets thoughts and cares,\nOne transcends the desire realm.\nWhen the heart forgets conditions and objects,\nOne transcends the form realm.\nWhen the heart does not cling to emptiness,\nOne transcends the formless realm.\nLeaving these three realms behind,\nThe spirit dwells in the land of immortals and sages,\nAnd the nature abides in the realm of purity and emptiness.\n\nZhang Sanfeng said: These are the Ten Discourses of Ancestor Wang Chongyang. The Great Dao of Wuji is fully contained within them. In the Kongqing Grotto-Heaven, many immortals and perfected beings have come to wander. Those who left behind alchemical formulas and Daoist teachings did so with the intention of awakening the world and liberating people. The Ten Discourses of Ancestor Chongyang are based on this same principle. Having received these teachings in the mountains, why seek other elixir herbs or gather immortal blossoms? This is the medicine of longevity, the cinnabar of agelessness. Respectfully recorded to guide those who come after and love the Dao.\n\n---\n\nLüzu said: My nature has always been naturally so,\nOriginally dependent on me, not on heaven.\nAt midnight, the iron man reflects:\nLong life and immortality are made by human effort.\nA hundred years of human life are but a dream of Nanke;\nThe awakened one strikes the morning bell for themselves.\nThe Dao is transmitted by sages, but cultivation depends on oneself;\nVirtue is accumulated by people, but life is decreed by heaven.\nClouds over the sea obscure the path;\nThe awakened one takes a single step and does not stray from the Western Paradise.\nJoy, anger, sorrow, and thought are settled by the heart;\nThe seeds of sages, immortals, buddhas, and gods lie in the field of the heart.\nThe numinous sprout grows within the heart—\nSeeking it outside for a hundred thousand miles is futile.\n\nWithin, embrace the Origin and guard the One—\nThe One Nature, perfectly luminous, is one’s own.\nSeeking guests beyond the heart,\nClinging to methods not one’s own.\n\nA single body-mind gives birth to the ten thousand dharmas.\nThe Dao is fundamentally empty and non-being—what use are methods?\nThe heart is gold within the ore;\nMethods are the fire that refines it.\nWhen the gold is wrought,\nThere is no fire, no ore, and no gold.\n\nMatter is inherently without nature—\nThe name “gold” is but a sign.\nTrue gold is never tainted,\nYet ore confounds it with impurity.\nWhen the heart’s wisdom-fire arises,\nThe ore is purged, and gold is pure.\n\nAll contrived efforts are false fire;\nTrue fire springs from the root of wisdom.\nWithout burning, the ore vanishes of itself;\nWithout refining, it is gold already.\n\nCultivation is but a provisional name—\nTo grasp at methods is to obscure one’s own heart.\nAbandoning methods, one loses the meaning;\nNeither grasping nor abandoning, one’s own truth remains.\n\nSunlight is one’s inherent power;\nClouds and mist arise from without.\nThe heart is originally pure and still—\nObjective conditions are external causes.\nWhen moonlight shines, clouds and mist disperse;\nWhen the heart is clear, external causes vanish.\n\nNo need for contrived methods—\nIn non-action, my true self abides.\n\n*Closing the Ten Discourses on Inner Cultivation*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "王重阳内修十论 佚名 八仙吕纯阳之弟子--王重阳。 宋末元初，陕西咸阳人。 亲传弟子七真人立全真派。 张三丰以内修十论为太极根基。 王重阳祖师之十论，亦本斯旨也。 山中人得此训言，又何必另寻瑶草，别采仙花。 即此是长生药。 不老丹也。 恭录之，以示后之好道者。 以神筑基，去污除垢平息贪欲之念，复清静无为之真。 神合太虚，阴阳五行之气，合于天地阴阳五行之气为一体，即天人合一之太极。 以神化之动，自然圆合连贯，千变万化，神妙莫测，是为太极拳。 千变万化之式，神而化之，如行云流水、涛涛不断，起无定式，收无定法。 自由、自如、自在安然，是自然天赋人类自神所化之真太极拳。 发挥人人自我之天赋，青出于蓝，胜于蓝。 固守陈规、停滞不前，无新生命。 应续真宗，创新迎未来。 一、论打坐 【原文】坐久则身劳，既不合理，又反成病。 但心不着物，又得不动，此是真定正基。 用此为定，心气调和，久益清爽。 以此为念，则邪正可知。 若能心起皆灭，永断觉知，入于忘定。 倘任心所起，一无收制，则与凡夫不别。 若惟断善恶，心无指归，肆意浮游，待自定者，徒自误耳。 若遍行诸事，言心无所染，于言甚善，于行极非，真学之流，特宜戒此。 今则息妄而不灭照，宁静而不着空，行之有常，自得真见，事或有疑，且任思量。 令事得济，所疑复悟。 此亦生慧正根。 悟已则止，必莫有思。 思则以智害性，为子伤本。 虽骋一时之俊，终亏万代之业。 一切烦邪乱想，随觉即除。 若闻毁誉善恶等事，皆即拨去，莫将心受。 受之则心满，心满则道无所居。 所有见闻，如不见闻，即是诸事万物不入于心。 心不受外，名曰虚心。 心不遂外，名曰安心。 心安而虚，道自来居。 【释义】以坐为坐是守尸鬼。 活人坐不卧，死人卧不坐。 一具臭骨头，谈什么炼功课。 一二三四五，二人守一土。 解开此中意，便是西天祖。 二人者即二目瞳神不外驰，神坐中央戍己土，巍巍不动稳如泰山即是坐。 非肉体之功，是筑自我神基。 以身体舒适来定时间。 今非昔比，今古条件不一，法由心生，自然是道。 坐以静思求理悟真宗为念，停思断想入顽空是练功之大忌。 别生一念，幻境现前名为入魔。 心喻镜，千形万相不碍明。 千思万缕任来去，如如不动是坐功。 舞台角色，喜怒哀思悲恐惊，演员意表形相，内心世界无动于衷。 定静无为自然智慧生，心不在焉、视而弗见、听而弗闻，食而不知其味，即诚则灵，灵则明。 以自心洗自心，返观内照，去污除垢，止念还虚，守一万事毕，胜似丹经万卷。 此自然无为之坐。 二、论虚心 【原文】经曰：人能虚心，虚非欲道，道自归之。 内心既无住着，外行亦无所为。 非净非秽，故毁誉无从生。 非智非愚，故利害无由挠。 实则顺中为常，权则与时消息。 苟免诸累，是其智也。 若非时非事，役思强为者，自为不着，终非真学。 何耶？ 心如眼，纤毫入眼，眼即不安。 小事关心，心必动乱。 既有动乱，难入定门。 修道之要，急在除病，病若不除，终难得定。 犹如良田，荆棘不除，嘉禾不茂。 爱欲思虑，是心荆棘，若不剪除，定慧不生。 此心无所托，难以自安。 纵得暂安，还复散乱。",
      "translated_text": "**Wang Chongyang’s Ten Discourses on Internal Cultivation**\n*Attributed to an anonymous author*\n\nWang Chongyang, disciple of the Eight Immortals’ Lü Chunyang, was a native of Xianyang in Shaanxi during the late Song and early Yuan dynasties. His seven direct disciples, the Seven Perfected, established the Quanzhen School. Zhang Sanfeng regarded these *Ten Discourses on Internal Cultivation* as the root of Taiji. The Venerable Wang Chongyang’s *Ten Discourses* likewise embody this principle. Those who receive these teachings in the mountains need not seek rare herbs or pluck immortal blossoms—here lies the elixir of longevity, the cinnabar of agelessness. Humbly transcribed here to guide later seekers of the Dao.\n\nBy spirit, one lays the foundation: purging filth, dispelling the dust of craving, and restoring the true state of purity and non-action. When spirit merges with the Great Void, the qi of yin-yang and the Five Phases unites with the qi of Heaven and Earth, becoming one—this is the Taiji of Heaven and Humanity as one. Through the movement of spirit’s transformation, natural harmony arises, seamless and continuous, endlessly shifting, profound and unfathomable—this is Taiji Boxing. Its myriad transformations, shaped by spirit, flow like drifting clouds and ceaseless currents, beginning without fixed form, concluding without set method. Free, unconstrained, at ease—this is the true Taiji Boxing, the natural endowment of humanity, born of the spirit’s transformation. To cultivate one’s innate gifts is to surpass the blue from which it springs. Clinging to old conventions and stagnation yields no new life. One must carry forth the true lineage and innovate to meet the future.\n\n---\n\n**I. On Sitting Meditation**\n\n**Original Text:**\nProlonged sitting wearies the body, which is neither reasonable nor beneficial—it may even breed illness. Yet if the mind does not cling to things and remains unmoving, this is the true foundation of stillness. Using this as the basis of stability, the heart-mind and qi harmonize, and with time, clarity and freshness deepen. By maintaining this awareness, one may discern the true from the false. If all arising thoughts are extinguished, and perception is forever severed, one enters the state of oblivious absorption. But if one indulges every thought without restraint, one differs not from the common person. If one merely severs good and evil without giving the mind direction, letting it drift aimlessly, awaiting self-stabilization, this is self-deception. If one engages in all manner of affairs while claiming the mind remains unstained—though the words sound virtuous, the conduct is deeply flawed. True learners must especially guard against this. Now, one quiets delusion without extinguishing awareness, abides in tranquility without clinging to emptiness, and practices with constancy to attain true insight. If doubts arise, allow them to be pondered until resolution is found and understanding dawns. This, too, is the root of wisdom. Once understanding is achieved, cease all thought—thinking harms the nature with cleverness, injuring the root for the sake of the branch. Though it may display brilliance for a moment, it ultimately undermines a legacy of ten thousand generations. All vexing, perverse, and chaotic thoughts must be eradicated upon arising. When one hears slander or praise, good or evil, dismiss them at once—do not let the mind receive them. To receive them is to fill the mind, and when the mind is full, the Dao has no place to dwell. All that is seen and heard should be as if unseen and unheard, so that the myriad things do not enter the mind. When the mind does not receive externals, it is called an empty mind. When the mind does not follow externals, it is called a peaceful mind. When the mind is peaceful and empty, the Dao naturally comes to reside.\n\n**Exegesis:**\nTo sit as if sitting is to guard a corpse. The living sit without lying down; the dead lie without sitting. A mere stinking skeleton—what use is there in discussing cultivation? One, two, three, four, five—two persons guard one earth. Unravel this meaning, and you are the patriarch of the Western Heaven. The \"two persons\" are the two pupils of the eyes, which do not stray outward; the spirit sits at the center, guarding the earth of the self, steadfast and immovable as Mount Tai—this is sitting. It is not a matter of the physical body but of building the foundation of one’s own spirit. Let bodily comfort determine the duration. The present is not the past; conditions differ across time. The method arises from the mind—naturally, it is the Dao. Sitting to seek understanding of the true principle through quiet reflection is the aim; halting thought to enter a dull void is a grave error in practice. To generate even a single stray thought is to invite illusory realms—this is called falling into demonic influence. The mind is like a mirror: a thousand forms and ten thousand appearances do not obscure its clarity. Let a thousand thoughts and ten thousand strands come and go—abiding in suchness without movement is the practice of sitting. Like an actor on stage, embodying joy, anger, sorrow, thought, grief, fear, and shock, the performer outwardly expresses these emotions, yet the inner world remains unmoved. Through stillness, non-action, and naturalness, wisdom arises. When the mind is absent, one sees yet does not see, hears yet does not hear, eats yet does not taste—sincerity begets efficacy, and efficacy begets clarity. Washing the mind with the mind, turning inward to illuminate, purging filth, halting thoughts to return to emptiness, and guarding the One—all things are accomplished. This surpasses ten thousand volumes of alchemical scriptures. Such is the natural, non-forced practice of sitting.\n\n---\n\n**II. On Emptying the Mind**\n\n**Original Text:**\nThe scriptures say: If one can empty the mind, it is not that one desires the Dao—the Dao naturally returns to them. With the inner mind free of attachments, outward conduct likewise requires no effort. Neither pure nor defiled, praise and blame cannot arise. Neither wise nor foolish, profit and harm cannot disturb. In truth, one abides in constancy amid adaptability, adjusting with the times. To be free of all burdens—this is wisdom. If one forces thought and action out of season or without cause, though one may appear unattached, this is not true learning. Why? The mind is like the eye: even a speck of dust entering it causes discomfort. If trivial matters occupy the mind, the mind becomes disturbed. Once disturbed, it is difficult to enter the gate of stillness. The essence of cultivating the Dao lies in urgently eliminating afflictions—if afflictions are not removed, stillness can never be attained. Like fertile fields overgrown with brambles, fine crops cannot flourish. Love, desire, and anxious thoughts are the brambles of the mind—if not cut away, concentration and wisdom will not arise. With no place to rest, the mind cannot find peace. Even if momentary peace is achieved, it will soon scatter into chaos.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1267,
      "start_sentence": 0,
      "end_sentence": 74,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.725109815597534,
      "metadata": {
        "source_file": "dao\\藏外\\内修十论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "随起随灭，务令不动，久久调熟，自得安闲。 无论昼夜，行住坐卧，及应事接物，当须作意安之。 若未得安，即须赡养，莫有恼触。 少得安闲，即堪自乐，渐渐驯狎，惟益清远。 且牛马家畜也，放纵不收，犹自生梗，不受驾御； 鹰野鸟，为人把戏，终曰在手，自然调熟。 心亦如是，若纵任不收，惟益粗疏，何能观妙。 【释义】心是虚无真空○直系化分子○谓如来心。 本自清静、本来空、唯独无偶○谓一性。 感受客观物相，生一念即受想行识，谓之人心。 一念映万相，万想由心生。 虚心本自不动，只是意识在心内行。 意多，虚不增，无意，虚不减。 不增不减宗归○。 万变不离宗○，宗不变，千思万想正常能。 认为自心乱，即是有二生，起心即是妄，有二即非真。 生乱意识是一念之障，不生二乱，还是一念纯诚。 千思万缕、此伏彼起，来一千，去一千。 来一万、去一万。 心如镜如，千万之念是从一念生。 千万之念灭在一念中。 虚心之一念还是念诚。 千思万缕任来去，别生二念，即是一念纯诚。 老子抱元守一念。 释迦万法归一性圆明。 孔子贯一念纯诚。 大舜精一万法通。 若将一念归无念，即是妙觉圆明万法通。 一念还虚无，虚无还妙大神通。 三、论不染 【原文】或曰：夫为大道者，在物而心不染，处动而神不乱。 无事而不为，无时而不寂。 今独避动而取安，离动而求定。 劳于控制，乃有动静。 一心滞于住守，是成取舍，两病都未觉。 其外执，而谓道之阶要，何其谬耶？ 答曰：总物而称大，通物之谓道，在物而不染，处事而不乱，真为大矣，实为妙矣。 然吾子之见有所未明，何者？ 子徒见贝锦之辉煌，未晓如抽之素丝。",
      "translated_text": "Rise and fall as they may, ensure the mind remains unmoved; with long and patient cultivation, it will naturally attain ease and leisure. Whether by day or night, in walking, standing, sitting, or lying down, and in all dealings with affairs and interactions with others, one must intentionally calm the mind. If it has not yet found peace, one must nurture and protect it, avoiding all irritation and disturbance. Even a slight attainment of ease brings its own joy; gradually, through familiarity, one draws ever nearer to purity and transcendence.\n\nConsider cattle and horses, mere domestic beasts—if left unrestrained, they grow stubborn and refuse the yoke. Yet wild hawks and falcons, when tamed by human hands, remain docile at all times, naturally trained to obedience. The mind is no different: if left unchecked and unrestrained, it only grows coarse and scattered—how then can it perceive the subtle and wondrous?\n\n**Exegesis:** The mind is the void and true emptiness, the very essence of the Tathāgata. It is inherently pure, originally empty, solitary and without peer—this is the One Nature. When it encounters objective phenomena, the arising of a single thought gives rise to sensation, perception, volition, and consciousness—this is the human mind. A single thought reflects ten thousand forms; ten thousand thoughts arise from the mind. The empty mind is inherently unmoving; it is only consciousness that moves within it. The more thoughts arise, the void does not increase; with no thoughts, the void does not diminish. The principle of non-increase and non-diminution returns to the fundamental ground. Though ten thousand changes may unfold, they never depart from this ground; when the ground remains unchanging, even a thousand thoughts and ten thousand ideas are naturally harmonious. To perceive one’s mind as disordered is to create duality; the arising of thought is delusion, and duality is not the truth. The disturbance of consciousness is but the obstruction of a single thought; if no second disturbance arises, the mind remains purely sincere.\n\nA thousand thoughts, ten thousand strands—this one arises, that one subsides. A thousand come, a thousand go; ten thousand come, ten thousand depart. The mind is like a mirror: ten thousand thoughts arise from a single thought, and ten thousand thoughts dissolve within that single thought. The single thought of the empty mind remains sincere. Let a thousand thoughts and ten thousand strands come and go as they will; if no second thought arises, it is the purity of a single thought.\n\nLaozi embraced the primordial and guarded the One. Śākyamuni returned the ten thousand dharmas to the perfect clarity of the One Nature. Confucius embodied the purity of the One Thought. Great Shun mastered the One, and the ten thousand dharmas became clear. If one returns the single thought to no-thought, it is the wondrous awakening, the perfect clarity through which the ten thousand dharmas are understood. When the single thought returns to the void, the void returns to the wondrous and great spiritual power.\n\n**3. On Non-Attachment**\n\n**Question:** Those who pursue the Great Dao remain untainted amidst phenomena and undisturbed amidst activity. They act without fail in all matters yet abide in stillness at all times. Now, why do you alone shun activity to seek tranquility, separate movement to pursue stillness? Striving to control the mind only creates the distinction between movement and stillness. Fixating the mind on abiding is itself a form of grasping and rejecting—both flaws remain unrecognized. To cling to externals and call this the essential step of the Dao—how mistaken!\n\n**Answer:** To encompass all things is called great; to pervade all things is called the Dao. To remain untainted amidst phenomena and undisturbed amidst affairs—this is truly great, truly wondrous. Yet your understanding is not yet clear. Why? You see only the brilliance of brocade but do not comprehend the plainness of undyed silk.",
      "overlap_context": "s difficult to enter the gate of stillness. The essence of cultivating the Dao lies in urgently eliminating afflictions—if afflictions are not removed, stillness can never be attained. Like fertile fields overgrown with brambles, fine crops cannot flourish. Love, desire, and anxious thoughts are the brambles of the mind—if not cut away, concentration and wisdom will not arise. With no place to rest, the mind cannot find peace. Even if momentary peace is achieved, it will soon scatter into chaos.",
      "start_char": 1267,
      "end_char": 1929,
      "start_sentence": 75,
      "end_sentence": 113,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.77009654045105,
      "metadata": {
        "source_file": "dao\\藏外\\内修十论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "才闻鹤鸣之冲天，讵识先资于谷食。 蔽曰之干，起于毫末。 神凝至圣，积习而成。 今徒知言圣人之德，而不知圣人之所以德也。 【释义】见闻觉知之觉性谓之道心。 如来心○本自无染。 观客观物相，感受而后，意识一念生即人心。 道心本自清，人心本自静，人心爱物，被物所牵。 贪心二意生，这是三心二意。 此谓染，一念纯诚，不生贪欲之心谓不染。 一平二静，念欲平息，复我本来道心○，即是返虚无妙有之道，常无欲以观其妙，虚灵不昧之道心，即天赋灵明之妙智慧光，简称慧光。 光俱感应功能，谓灵光独耀。 曰光、灯光无感应功能，只有热、照明之用。 灯是体，光是用。 灯能破，单独的破坏光，是无能为力的。 灵光无法能破坏。 因体用皆光，唯独无偶。 入水不浸，入火不焚，刀砍不断、雷打不变，罡风吹不散。 被物相所蔽，不明。 破相、除物，还虚○自明，即一性圆明，即去污除垢，止念还虚○。 此人类人人自我之自然天赋之真生命○，真信真诚灵自明，妙觉灵明获圆通。 四、论简事 【原文】修道之人，莫若简事。 知其闭要，识其轻重，明其去取。 非要非重，皆应绝之。 犹人食有酒肉，衣有罗绮，身有名位，财有金玉，此皆情欲之余好，非益生之良药。 众皆徇之而自致亡败。 何迷之甚也。",
      "translated_text": "Just as one hears the crane’s soaring cry yet fails to recognize its prior nourishment in the valley’s grain, so too does the towering tree begin as the tiniest shoot. The sage’s spirit, concentrated to perfection, is cultivated through accumulated practice. Now you merely speak of the sage’s virtue yet do not comprehend how the sage attains virtue.\n\n**Exegesis:** The awakened nature of perception and cognition is called the Dao-mind. The Tathāgata’s mind is originally unstained. When observing objective phenomena and responding to sensory impressions, the moment a thought arises in consciousness—this is the human mind. The Dao-mind is inherently pure; the human mind is inherently still. Yet when the human mind clings to things, it is led astray by them. Greed and dualistic intention arise—this is the \"three minds and two intentions.\" Such is defilement. A single thought of pure sincerity, free from desire, is called non-defilement. In perfect equilibrium and stillness, when thoughts and desires subside, one recovers one’s original Dao-mind—this is the Dao of returning to emptiness and the wondrous existence, the constant absence of desire through which its mystery is observed. The luminous and unobscured Dao-mind is the innate radiance of wisdom, briefly termed \"wisdom-light.\" This light possesses responsive and interactive functions—what is called the solitary radiance of numinous light. Ordinary light, such as that of a lamp, has no such responsive function, serving only to generate heat and illumination. The lamp is the substance; light is its function. A lamp may be broken, but destroying light alone is impossible. Numinous light cannot be destroyed by any means, for its substance and function are both light, utterly without counterpart. It is not submerged in water, not burned by fire, not severed by blades, not altered by thunder, not scattered by fierce winds. When obscured by phenomena, it remains unillumined. Shattering appearances, removing things, and returning to emptiness—this is self-clarity, the perfect illumination of one’s nature. It is the removal of filth and dust, the cessation of thoughts, and the return to emptiness. This is the true life innate to every human being, the true faith and sincere spirit that illumines itself, attaining wondrous awakening and perfect penetration.\n\n**4. On Simplifying Affairs**\nThe practitioner of the Dao should above all simplify affairs. Know what is essential, discern what is weighty, and clarify what to retain or discard. Whatever is neither essential nor weighty should be entirely abandoned. Just as one may consume wine and meat, wear silks and brocades, hold fame and position, or possess gold and jade—these are all excesses of desire, not the true medicine for nurturing life. The multitude pursues them only to bring about their own ruin. How deeply deluded they are!",
      "overlap_context": " abiding is itself a form of grasping and rejecting—both flaws remain unrecognized. To cling to externals and call this the essential step of the Dao—how mistaken!\n\n**Answer:** To encompass all things is called great; to pervade all things is called the Dao. To remain untainted amidst phenomena and undisturbed amidst affairs—this is truly great, truly wondrous. Yet your understanding is not yet clear. Why? You see only the brilliance of brocade but do not comprehend the plainness of undyed silk.",
      "start_char": 1929,
      "end_char": 2448,
      "start_sentence": 114,
      "end_sentence": 141,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.010881662368774,
      "metadata": {
        "source_file": "dao\\藏外\\内修十论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "【释义】心本空寂、清静自如、唯独○无偶，简。 无受想行识，无眼耳鼻舌身意，无色声香味触法，无眼界无意识界，○简。 《金刚经》云，一切圣贤皆以无为法而有差别。 观世音心经，真空妙理无为法是佛纲。 以无印心，观自在○，万法皆空。 而获大自在，入无为无所不为，谓大自在菩萨。 观万象，生万意，应万事，生万变。 来则有，去则无，心无挂碍○简。 居人海乘风浪，在尘离尘，在欲离欲，和光混俗，背境观心，心喻镜明○简。 五、论真观 【原文】夫真观者，智士之先觉，能人之善察也。 一食一寐，俱为损益之源； 一行一言，堪作祸福之本。 巧持其末，不若拙守其本。 观本知末，又非躁竞之情。 收心简事，曰损有为。 体静心闲，方可观妙。 然修道之身，必资衣食。 事有不可废，物有不可弃者，须当虚襟以受之，明目而当之。 勿以为妨，心生烦躁。 若因事烦躁，心病已动，何名安心。 夫人事衣食，我之船舫也，欲渡于海，必资船舫。 因何未度，先废衣食。 虚幻实不足营为，然出离虚幻，未能遽绝。 虽有营求，莫生得失之心。 有事无事，心常安泰，与物同求不同贪，同得而不同积。 不贪故无忧，不积故无失。 迹每同人，心常异俗。 此言行之宗要，可力为之。 【释义】眼见前，不见后，见表不见内，视察一切，视者，觉也。 眼只是晶体透明之器官，见是心，非眼。 心不在焉，视而弗见，此处指真观。 觉彻悟真空之妙有谓之观。 即心经观自在菩萨。 道德经常无欲以观其妙，常有欲以观其窍。 慧眼观俗，见心同时也见表，谓之通观。 佛以无上妙智慧，观一切众生皆有佛性。 俗观只见色相，不透心性，谓之观相。 真观，认自本心，识自本性，在悟观者是谁。 观自在菩萨的观者是如来心○，被观者也是如来心○。 以心观心即以○观○，作何观想？ 无受想行识、无眼耳鼻舌身意，观何？ 返观内照，返闻自性，闻者即是觉。 自参自悟自觉，内不生观念，外不起观心。 观者，自在自如如即○。 照见五蕴皆空○，念不生相，心不生法，无为自在，即是自然虚无○大道。 起观想之念，生观妙之障。 有障观何，蔽观者昧。 不生观想之念，即去污除垢、止念还虚○。 万事毕了然无一物。 不观之观即真观。 六、论色迹恶 【原文】前节虽断缘简事，病有难除者，但依法观之。 若色病重者，当知染色都由想耳。 想若不生，终无色事。 当知色想外空，色心内忘，忘想心空。 惟有智者，善观而达识之，乐天知命，故不忧贫病之苦也。 经云：天地不能改其操，阴阳不能回其孽。 由此言之，真命也，又何怨焉。 譬如勇士逢贼，挥剑当前，群凶奔溃，功勋一立，荣禄终身。 今之贫病恼乱我身而寇贼也。 立刻正心，则勇士也。 恼累消除，则战胜也，湛然常乐，则荣禄也。 凡有苦事来迫我心，不以此敌之，必生忧累，如人逢贼，不立功勋，弃甲背军，逃亡获罪。 去乐就苦，何可悯哉。 若贫病交侵，当观此苦由我有身。 经曰：及吾无身，吾何有患。 【释义】无极真空纯至静，静到极点太极生。 无极真空○。 太极先天混元一气。 两仪，天地变易之气。 皇极交易之气，即物质世界，人类社会。 由混元一气开始统称为色，色由空转化而生。",
      "translated_text": "**Exegesis**\nThe heart is fundamentally empty and still, serene and untrammeled, solitary and without peer—simplified. There is no perception, conception, volition, or consciousness; no eye, ear, nose, tongue, body, or mind; no form, sound, scent, taste, touch, or dharma; no realm of sight, no realm of consciousness—simplified. As the *Vajracchedikā Sūtra* states, “All sages and worthies are distinguished by the non-doing Dharma.” The *Heart Sūtra of Avalokiteśvara* declares that the wondrous principle of true emptiness, the non-doing Dharma, is the Buddha’s guiding thread. With a mind unmarked by impressions, one contemplates perfect freedom, and all dharmas are empty. Thus one attains great freedom, entering non-doing yet accomplishing all—this is the bodhisattva of great freedom. Observing the myriad phenomena, generating the myriad intentions, responding to the myriad affairs, producing the myriad transformations: what comes is present, what goes is absent, the heart unobstructed—simplified. Dwelling in the sea of humanity amid wind and waves, in the dust yet apart from the dust, in desire yet apart from desire, harmonizing with the world while concealing one’s brilliance, turning from phenomena to contemplate the heart, the heart like a mirror’s clarity—simplified.\n\n**5. On True Contemplation**\nTrue contemplation is the foreknowledge of the wise and the keen discernment of the capable. Every meal and every rest is a source of gain or loss; every action and every word may become the root of fortune or misfortune. Skillfully managing the branches is not as good as clumsily guarding the root. Observing the root to know the branches is not the impulse of restless striving. Restraining the heart and simplifying affairs is called “diminishing doing.” Only when the body is still and the heart at leisure can one contemplate the wondrous.\n\nYet the body of the Dao practitioner must rely on clothing and food. There are affairs that cannot be abandoned and things that cannot be discarded; one must receive them with an open mind and address them with clear eyes. Do not let them become obstacles, stirring up vexation. If affairs cause vexation, the sickness of the heart has already arisen—how can this be called a peaceful heart?\n\nClothing and food are the boat and oars of human life. To cross the sea, one must rely on boat and oars. Why, before crossing, would one first abandon clothing and food? The illusory is truly not worth pursuing, yet one cannot abruptly sever ties to illusion. Though there may be pursuit, do not generate a mind of gain or loss. Whether in activity or inactivity, the heart remains tranquil, seeking the same things as others yet not coveting them, obtaining the same things yet not hoarding them. Without covetousness, there is no worry; without hoarding, there is no loss. One’s traces may resemble others’, but the heart remains apart from the vulgar. This is the essential principle of conduct—one must strive to practice it.\n\n**Exegesis**\nThe eye sees what is before but not what is behind, sees the surface but not the interior. To inspect all things is to see, and seeing is awakening. The eye is merely a transparent organ of crystal; seeing belongs to the heart, not the eye. When the heart is not present, one looks but does not see—this is what is meant by true contemplation. Awakening to the wondrous existence of true emptiness is called contemplation, as in the *Heart Sūtra*’s Avalokiteśvara Bodhisattva. The *Daodejing* says, “Constantly without desire, one observes its mysteries; constantly with desire, one observes its manifestations.” With the eye of wisdom, one contemplates the mundane, seeing the heart and the surface simultaneously—this is called comprehensive contemplation. The Buddha, with supreme wisdom, observes that all sentient beings possess buddha-nature. Mundane contemplation sees only forms and appearances, not penetrating to the nature of the heart—this is called contemplation of appearances.\n\nTrue contemplation recognizes one’s original heart and knows one’s original nature, awakening to who the contemplator is. The contemplator of Avalokiteśvara Bodhisattva is the heart of Tathāgata; the contemplated is also the heart of Tathāgata. Contemplating the heart with the heart is contemplating ○ with ○—what is the object of contemplation? Without perception, conception, volition, or consciousness, without eye, ear, nose, tongue, body, or mind, what is there to contemplate? Turning inward to illuminate, turning back to hear one’s own nature, the hearer is awakening itself. Self-inquiry, self-awakening, self-realization: inwardly, no notions arise; outwardly, no heart of contemplation stirs. Contemplation is freedom, ease, and spontaneity—○. Illuminating the five aggregates as empty—○—thoughts do not generate appearances, the heart does not generate dharmas, non-doing is freedom, which is the natural void—○—of the great Dao.\n\nTo generate the notion of contemplation is to create an obstacle to the wondrous. With obstacles, what can one contemplate? The obscuring of contemplation dulls the contemplator. Without generating the notion of contemplation, one removes filth and dust, ceases thoughts, and returns to emptiness—○. All affairs are perfectly resolved, leaving not a single thing. The contemplation that does not contemplate is true contemplation.\n\n**6. On the Evil of Sensual Traces**\nThough the previous section severs karmic ties and simplifies affairs, some illnesses are difficult to eradicate—one must contemplate them according to the Dharma. If the illness of sensual desire is severe, know that all defilement by sensual forms arises from thought. If thought does not arise, there will ultimately be no affair of sensual forms. Know that sensual forms are empty externally, and the heart forgets sensual desire internally—when thought is forgotten, the heart is empty.\n\nOnly the wise, through skillful contemplation, attain understanding, delight in heaven’s decree, and know fate, thus free from the suffering of poverty and illness. The scriptures say, “Heaven and earth cannot alter their conduct; yin and yang cannot reverse their retribution.” From this, we know it is true fate—what is there to resent?\n\nIt is like a brave warrior encountering bandits: wielding his sword before him, the multitude of villains scatter in flight. Once merit is established, honor and emolument last a lifetime. Now, poverty, illness, and afflictions disturb my body like bandits. Immediately rectifying the heart makes one a brave warrior. Dispelling vexations and burdens is victory; serene and constant joy is honor and emolument.\n\nWhenever suffering comes to press upon my heart, if one does not oppose it thus, one will surely generate worry and burden—like a man encountering bandits who, instead of establishing merit, discards his armor, abandons his troops, flees, and incurs punishment. Forsaking joy for suffering—how pitiable!\n\nIf poverty and illness assail together, contemplate that this suffering arises from having a body. The scriptures say, “When I have no body, what suffering can I have?”\n\n**Exegesis**\nThe true emptiness of the Limitless is pure and utterly still; stillness reaches its extreme, and the Supreme Ultimate arises. The true emptiness of the Limitless—○. The Supreme Ultimate is the primordial undifferentiated qi. The Two Modes are the qi of heaven and earth’s transformations. The Imperial Ultimate is the qi of exchange—this is the material world, human society. From the undifferentiated qi onward, all is collectively called “form,” which arises from the transformation of emptiness.",
      "overlap_context": " practitioner of the Dao should above all simplify affairs. Know what is essential, discern what is weighty, and clarify what to retain or discard. Whatever is neither essential nor weighty should be entirely abandoned. Just as one may consume wine and meat, wear silks and brocades, hold fame and position, or possess gold and jade—these are all excesses of desire, not the true medicine for nurturing life. The multitude pursues them only to bring about their own ruin. How deeply deluded they are!",
      "start_char": 2456,
      "end_char": 3724,
      "start_sentence": 142,
      "end_sentence": 214,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.2288179397583,
      "metadata": {
        "source_file": "dao\\藏外\\内修十论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "画是白纸，画家化而生画，白纸即画，画即白纸。 无极化太极，无极即太极，太极即无极。 不同的一画，画万物。 一化，化天地万物。 天地万物因空而育化，白纸因画家而化成画。 天地万物源生于空，所以空即是色，色即是空。 无空，色就成为无源之水，无本之木。 空色一体，空能生有，有归空。 当今地球上六十亿人，百年后皆化灰尘。 空生幻相，相质变归于空。 觉性本空，不生不灭。 黄帝曰：天地有质变，理气了无终始。 当今人类社会之六十亿人，实质是一百年后的骨灰在活动。 理气离体，当即立灭。 天地万物皆真空幻化无常的物质色相，质变皆无。 大地上六十亿人每天在吃地球，大地的生命也是无常之物，资源尽则亡。 凡所有相皆是虚妄。 人的躯体是暂存体幻化身。 一波下去一波上来，长江后浪推前浪，一波新人换旧人。 人潮永无了休，一潮天子一潮臣，帝王将相、才子佳人只不过是银幕电影，时过境迁影也无。 功名利禄、酒色财气、父母深恩、夫妻儿女之重爱，不入真生命○之流。 放手如是，不放手也如是。 生不带来，死不带去，何苦为了贪欲牺牲了真明命○。 一切有为法，如梦幻泡影。 如露亦如电，应作如是观。 七、论泰定 【原文】泰定者出俗之极也，致道之初基，习静之成功，持安之毕事。 形如槁木，心若死灰，无取无舍，寂灭之至。 无心以定，而无所不定。 故曰：泰定。 庄子曰：\"宇泰定者，发乎天光。 \"宇，心也，天光，慧也。 心为道之区宇，虚静至极，则道居而慧生。 慧生出本性，非是人有。 故曰：天光。 但以贪爱浊乱，遂至昏迷。 性迷则慧不生。 慧既生矣，宝而怀之，勿以多知而伤于定。 非生慧难，慧而不用难。 自古忘形者众，忘名者寡。 慧而不用，是忘名也，天下希及之，故为难。 贵能不骄，富能不奢，为无俗过，故得常守富贵。 定而不动，慧而不用，故得深证真常。 庄子曰：知道易，勿言难。 知而不言所以天。 知而言之所以人。 古之人天而不人。 又曰：古之治道者，以恬养智。 智生而无以智为也，谓之以智养恬。 智与恬交相养，而和理出其本性也。 恬智则定慧也，和理则道德也。 有智不用而安且恬，积而久之，自成道德。 自然震雷破山而不惊，白刃交前而不惧，视名利如过隙，知生死如溃瘤。 用志不分乃凝于神，心之虚妙，不可思议。 【释义】自我虚无灵明之通体，本自不动○唯独无偶。 只是道体所生之意识观念，对万紫千红千般欲念，穷追猛赶，贪之不舍。 悟透人生如幻，酒色财气眼前乐，两眼一闭万有空。 为这个臭皮囊牺牲真明命，享一时的假欢乐，受万年的真痛苦。 认为是臭皮囊在享乐，其实是觉性感受。 岂不知障蔽的是妙明光！ 定静安虑慧自明，顿悟人间无真乐，乐极都伤悲。 只有道体○，安然自在永放光明，知真乐弃假乐，求理悟真宗，明了自然空。 一切眼底过，身躯永无踪。 不明真道理，心态如何定。 悟透社会人生如幻，不生不灭是真空。 说一千道一万，自心彻悟万法通。 从古至今用心量，帝王将相，才子佳人，都在平民上，万民之中好荣光。 归根到底看结果，都是灰土泥巴像。 泰也如是，不泰也如是，何不自然自在悟真常。 八、论得道",
      "translated_text": "On paper, there is only blankness; the artist transforms it into a painting—blank paper is the painting, the painting is blank paper. The Limitless transforms into the Supreme Ultimate—the Limitless is the Supreme Ultimate, the Supreme Ultimate is the Limitless. A single stroke creates all things. One transformation gives rise to heaven, earth, and the myriad beings. Heaven and earth and the myriad beings are nurtured and transformed by emptiness; blank paper is transformed into a painting by the artist. Heaven and earth and the myriad beings originate from emptiness, so emptiness is form, and form is emptiness. Without emptiness, form becomes water without a source, a tree without roots. Emptiness and form are one; emptiness gives birth to being, and being returns to emptiness. Today, six billion people on Earth will all become dust in a hundred years. Emptiness gives birth to illusory appearances, and the substance of appearances returns to emptiness. The nature of awakening is fundamentally empty, neither arising nor ceasing. The Yellow Emperor said: “Heaven and earth undergo material transformation, but the principles and qi have no end or beginning.” The six billion people in today’s human society are, in essence, the ashes of the dead moving about a hundred years hence. When the principles and qi depart from the body, they immediately perish. Heaven and earth and the myriad beings are all ephemeral material forms of true emptiness, their transformations ultimately void. The six billion people on Earth consume the planet daily; the planet’s life is also ephemeral, and when its resources are exhausted, it too will perish. All appearances are illusory. The human body is a temporary, illusory vessel. One wave recedes, another rises—like the Yangtze’s waves, where the new push forward and replace the old. The tide of humanity never ceases: one generation of emperors, one generation of ministers; emperors, generals, scholars, and beauties are but scenes in a film, vanishing without a trace when the time passes. Fame and fortune, wine and women, wealth and passion, the deep love of parents, the profound affection between spouses and children—none enter the flow of the true life ○. Whether you let go or not, it is all the same. Nothing is brought at birth, nothing taken at death—why sacrifice the true luminous life ○ for greed?\n\nAll conditioned things are like dreams, illusions, bubbles, shadows;\nLike dew and lightning, they should be seen as such.\n\n**7. On Supreme Stability**\n\nSupreme Stability is the ultimate departure from the mundane, the first foundation of attaining the Dao, the success of practicing stillness, and the completion of maintaining tranquility. The body is like withered wood, the mind like dead ashes—no grasping, no rejecting, the ultimate of quiescence. With no mind to stabilize, yet nothing is not stabilized. Thus it is called Supreme Stability.\n\nZhuangzi said: “When the universe is supremely stable, it emits celestial radiance.” The universe is the mind; celestial radiance is wisdom. The mind is the realm of the Dao; when emptiness and stillness reach their extreme, the Dao resides there and wisdom arises. Wisdom arises from one’s original nature, not from the person. Thus it is called celestial radiance. But due to the turbidity of greed and attachment, one falls into confusion. When the nature is confused, wisdom does not arise. Once wisdom arises, treasure and embrace it, and do not let excessive knowledge harm stability. It is not difficult to generate wisdom, but difficult to refrain from using it. Since ancient times, many have forgotten form, but few have forgotten fame. To have wisdom and not use it is to forget fame—few in the world attain this, hence it is difficult. To be noble without arrogance, wealthy without extravagance, is to be free from worldly faults, thus one can perpetually maintain wealth and nobility. To be stable and unmoving, to have wisdom and not use it, is to deeply realize the true and constant.\n\nZhuangzi said: “Knowing the Dao is easy; refraining from speaking of it is difficult.” To know and not speak is celestial; to know and speak is human. The ancients were celestial, not human. He also said: “Those in ancient times who cultivated the Dao used tranquility to nurture wisdom. When wisdom arose, they did not employ it as wisdom—this is called using wisdom to nurture tranquility. Wisdom and tranquility nurture each other, and harmony and principle emerge from one’s original nature.” Tranquility and wisdom are stability and insight; harmony and principle are virtue and the Dao. To have wisdom and not use it, to be at peace and tranquil, and to accumulate this over time, is to naturally become virtuous and attain the Dao. Naturally, one is unshaken by thunder splitting mountains, unafraid of blades crossing before one; one sees fame and profit as fleeting as a crack, and knows life and death as a bursting abscess. When the will is undivided, it coalesces into spirit; the mind’s emptiness and subtlety are inconceivable.\n\n**Exegesis**\nThe entire being of the self is inherently empty, numinous, and luminous—○ fundamentally unmoving and uniquely peerless. It is only the ideations and concepts born of the Dao-body that chase after the myriad desires of the world, pursuing them relentlessly and clinging without release. To awaken to the illusory nature of life: the fleeting pleasures of wine, sex, wealth, and passion vanish when the eyes close, and all becomes empty. To sacrifice the true luminous life for this foul skin-bag, enjoying momentary false happiness and enduring eternal true suffering—one believes the foul skin-bag is enjoying, but in truth, it is the nature of awakening that perceives. How can one not know that what is obscured is the wondrous luminous light! When stability, stillness, peace, and contemplation arise, wisdom naturally becomes clear; one suddenly realizes there is no true happiness in the human world, and even extreme joy leads to sorrow. Only the Dao-body ○ abides in ease, eternally radiant; knowing true happiness and abandoning false happiness, seeking principle and awakening to the true source, one understands the natural emptiness. All passes before the eyes, the body forever without trace. Without understanding the true principle, how can the mind be stable? To awaken to the illusory nature of society and life, to know that the unarising and unceasing is true emptiness—say a thousand things, speak ten thousand words, but only self-realization penetrates all dharmas. From ancient times to the present, using the mind to measure: emperors, generals, scholars, and beauties stand above the common people, shining brightly among the masses. But in the end, when all is seen, they are but dust and mud. Whether in Supreme Stability or not, it is all the same—why not naturally and freely awaken to the true and constant?\n\n**8. On Attaining the Dao**",
      "overlap_context": "\nThe true emptiness of the Limitless is pure and utterly still; stillness reaches its extreme, and the Supreme Ultimate arises. The true emptiness of the Limitless—○. The Supreme Ultimate is the primordial undifferentiated qi. The Two Modes are the qi of heaven and earth’s transformations. The Imperial Ultimate is the qi of exchange—this is the material world, human society. From the undifferentiated qi onward, all is collectively called “form,” which arises from the transformation of emptiness.",
      "start_char": 3724,
      "end_char": 4968,
      "start_sentence": 215,
      "end_sentence": 284,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.68431544303894,
      "metadata": {
        "source_file": "dao\\藏外\\内修十论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "【原文】夫道者神异之事，灵而有性，虚而无象，随迎不测，影响莫求，不知其然而然。 至圣得之于古，妙法传之于今。 道有深力，徐易形神，形随道通，与神合一，谓之神人。 神性虚融，体无变灭，形以道通，故无生死。 隐则形同于神，显则神同于气。 所以踏水火而无害，对曰月而无影。 存亡在己，出入无间。 身为泽质，犹至虚妙，况其灵智益深益远乎。 生神经云：身神并一，则为真身。 又西升经云：形神合同，故能长久。 然虚无之道，力有浅深，深则兼被于形，浅则惟及于心。 被形者神人也。 及心者但得慧觉，而身不免谢。 何者？ 慧是心用，用多则心劳。 初得小慧，悦而多辩神气漏泄，无灵光润身，遂至早终，道故难备。 经云尸解，此之谓也。 是故大人舍光藏辉，以斯全备。 凝神宝气，学道无心，神与道合，谓之得道。 经云：同于道者，道亦得之。 山有玉，草木以之不凋。 人怀道，形骸以之永固。 资熏曰久，变质同神。 炼形入微，与道冥一。 智照无边，形超靡极。 总色空而为用，舍造化以成功。 真应无方，其惟道德。 【释义】道本无得无失，只因世人不知其真谛。 道体是虚无大道赋予人类之觉性。 老子说觉性是自然天地万物中唯一之大神。 孔子说妙觉灵通之理性。 释迦说天赋于众生之无上正翟积觉之心，是天赋的神通广大，玄妙无边之觉性。 上至诸佛，下至一切苍生，皆含佛智。 被气禀所拘，物欲蒙蔽者谓之众生。 佛性不昧，不被人间一切形形色色所转，顿悟人生，一切皆幻化无常之物，不求不贪谓之觉者。 迷者若失，实无失。 悟者明之，若得无得。 其神秘妙玄是天赋本能，人人如此，非筑修加功而成。 原是金丹宝珠，因落尘缘，被尘污欲垢所埋。 凭自妙明智慧，磨去尘污，除其欲垢，当即复明。 如眼疾，去障复明，是本明，医不增明。 道体矿中金，去矿精金，永不成矿，木若成灰，永不成木。 一性圆明，永恒自然中，谓之极乐，千千不灭大觉仙，因人是神佛之种子，修者结果。 得其正果谓得道，老子说上德无得。 九、论坐忘枢翼 【原文】夫欲修道成真，先去邪僻之行。 外事都绝，无以干心。 然后内观正觉。 觉一念起，即须除灭。 随起随灭，务令安静。 其次，虽非有贪着，浮游乱想，亦尽灭除。 昼夜勤行，须臾不替。 惟灭动心，不灭照心，但凝空心，不凝住心。 不依一法，而心常住。 此法玄妙，利益甚深。 自非夙有道缘，信心无二者不能。 若有心倾至道，信心坚切，先受三戒，依戒修行，敬终如始，乃得真道。 其三戒者：一曰简缘； 二曰除欲； 三曰静心。 勤行此三戒，而无懈退者，则无心求道，而道自来。 经曰：人能常清净，天地悉皆归。 由此言之，简要之法，可不信哉！ 然则凡心躁竞，其来固久，依戒息心，其事甚难。 或息之而不得，或暂停而旋失，去留交战，百体流汗。 久久行持，乃得调熟。 莫以暂收不得，遂废千生之业。 少得静己，则于行住坐卧之时，涉事喧闹之所，皆须作意安之。 有事无事，常若无心。 处静处喧，其志惟一。 如束心太急，则又成疾气，发狂痴，是其候也。 心若不动，又须放任宽急得中，常自调适。 制而无着，放而不逸。 处喧无恶，涉事无恼，此真定也。",
      "translated_text": "**8. On Attaining the Dao**\n\nThe Dao is a matter of divine marvel—spirit-like yet endowed with nature, empty yet without form. It follows and responds in ways beyond measure, its echoes and reflections ungraspable. One knows not why it is so, yet so it is. The utmost sages attained it in ancient times, and its wondrous methods have been transmitted to the present.\n\nThe Dao possesses profound power, gradually transforming body and spirit. When the body aligns with the Dao, it unites with spirit, and this is called the \"spirit-person.\" The spirit-nature is empty and harmonious, its essence unchanging and undying. As the body moves in accord with the Dao, it transcends birth and death. Concealed, the form merges with spirit; revealed, the spirit merges with qi. Thus, one may tread upon water and fire without harm, face the sun and moon without casting a shadow. Life and death lie within one’s own control, entry and exit occur without obstruction. The body, though but a humble vessel, is already most empty and wondrous—how much deeper and farther does its spiritual wisdom extend?\n\nThe *Scripture on the Generation of Spirit* states: \"When body and spirit unite as one, it becomes the true body.\" The *Western Ascension Scripture* says: \"When form and spirit merge as one, they endure forever.\" Yet the Dao of emptiness and nothingness varies in its power. When profound, it encompasses the body; when shallow, it reaches only the mind. Those who embody it become spirit-persons. Those who grasp it only in mind attain wisdom and awakening, yet their bodies still succumb to decay. Why is this? Wisdom is the function of the mind, and excessive use wearies it. At first, one delights in small insights, engaging in much debate, but this scatters spirit and qi, leaving no radiant light to nourish the body, leading to an early end. This is why the Dao is difficult to fully realize. The scriptures call this \"corpse liberation.\"\n\nThus, the great ones conceal their brilliance and hide their splendor to preserve wholeness. They concentrate spirit and treasure qi, practicing the Dao without intention. When spirit and Dao unite, this is called \"attaining the Dao.\" The scriptures say: \"One who is the same as the Dao, the Dao also attains.\" A mountain with jade causes the grasses and trees around it to never wither. A person who embraces the Dao causes the body to endure forever. Through long cultivation, their essence transforms to become one with spirit. Refining the body to subtlety, they merge with the Dao in darkness. Their wisdom illuminates boundlessly, their form transcends all limits. They employ the interplay of form and emptiness, achieving success beyond creation. True response knows no bounds—only virtue and the Dao.\n\nThe Dao is fundamentally without gain or loss; it is only that worldly people do not know its true essence. The essence of the Dao is the awakened nature bestowed upon humanity by the great Dao of emptiness and nothingness. Laozi called this awakened nature the sole great spirit within the natural world. Confucius spoke of the wondrously awakened and spiritually penetrating rational nature. Śākyamuni spoke of the supreme, right, and accumulated awakened mind bestowed upon all beings by heaven—a mind of vast spiritual power, mysterious and boundless. From the buddhas above to all living beings below, all possess buddha-wisdom. Those constrained by qi-endowment and obscured by worldly desires are called \"sentient beings.\" When the buddha-nature is not dimmed, unshaken by the myriad forms of the human world, one suddenly awakens to life—all is illusory and impermanent. Not seeking, not craving, this is called the \"awakened one.\" The deluded perceive loss where there is none; the enlightened see clarity where there is no gain.\n\nIts mystery and wonder are innate abilities, inherent in all, not achieved through cultivation or effort. It is originally the golden elixir, the precious pearl, but it falls into worldly conditions, buried by the dust of desire and impurity. Through one’s own wondrous luminous wisdom, one polishes away the dust and removes the filth of desire, and it immediately regains its clarity. Like an eye afflicted by illness, removing the obstruction restores its original brightness—medicine does not add to it. The Dao is gold within ore; refining it yields pure gold, which never returns to ore. Wood, once turned to ash, never becomes wood again. When the one nature is perfectly luminous, it abides eternally in the natural—this is called \"ultimate bliss,\" the \"immortal of great awakening that never perishes.\" For humans are the seeds of gods and buddhas; cultivation yields fruit. Attaining the true fruit is called \"attaining the Dao.\" Laozi said: \"The highest virtue is without attainment.\"\n\n**9. On the Pivotal Wings of Sitting in Forgetfulness**\n\nIf one wishes to cultivate the Dao and become a true person, one must first abandon perverse and deviant conduct. Sever all external affairs so they do not disturb the mind. Then, inwardly observe true awakening. When a single thought arises, it must be extinguished at once. As thoughts arise, so must they be extinguished, ensuring tranquility. Next, though not attached to desires, even wandering and chaotic thoughts must be entirely eliminated. Practice diligently day and night, without the slightest lapse.\n\nOnly extinguish the moving mind, not the illuminating mind. Simply concentrate the empty mind, not the fixated mind. Do not rely on any single method, yet keep the mind constantly present. This method is profoundly wondrous, its benefits deep. Without a predestined affinity for the Dao and unwavering faith, one cannot succeed.\n\nIf one’s heart is sincerely inclined toward the supreme Dao, with steadfast and earnest faith, one should first receive the three precepts and cultivate in accordance with them. Reverence at the end must be as at the beginning to attain the true Dao. The three precepts are: first, simplifying conditions; second, eliminating desires; third, calming the mind. Diligently practicing these three precepts without slackening, one need not seek the Dao, for the Dao will come of itself. The scriptures say: \"If a person can always remain pure, heaven and earth will all return to them.\" From this, can the essential method not be trusted?\n\nYet the ordinary mind is restless and competitive, its tendencies long established. Relying on the precepts to still the mind is exceedingly difficult. Sometimes one stills it but cannot hold it; sometimes one pauses briefly, only to lose it again. The struggle between departure and retention causes the whole body to sweat. With long and persistent practice, one gradually becomes adept.\n\nDo not abandon the work of a thousand lifetimes because of a momentary failure to gather the mind. Even a slight attainment of stillness allows one, in walking, standing, sitting, and lying down, or amidst affairs and clamor, to intentionally calm the mind. Whether occupied or at leisure, one should remain as if without mind. In quiet or in noise, one’s resolve should be singular.\n\nIf the mind is bound too tightly, it may generate illness and qi stagnation, leading to madness or delusion—these are the signs. If the mind does not move, one must also allow it freedom, maintaining a balance between tension and relaxation, always adjusting to what is fitting. Restrain without attachment, release without indulgence. In noise, there is no aversion; in affairs, there is no vexation—this is true samādhi.",
      "overlap_context": "sing is true emptiness—say a thousand things, speak ten thousand words, but only self-realization penetrates all dharmas. From ancient times to the present, using the mind to measure: emperors, generals, scholars, and beauties stand above the common people, shining brightly among the masses. But in the end, when all is seen, they are but dust and mud. Whether in Supreme Stability or not, it is all the same—why not naturally and freely awaken to the true and constant?\n\n**8. On Attaining the Dao**",
      "start_char": 4973,
      "end_char": 6210,
      "start_sentence": 285,
      "end_sentence": 358,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.004841804504395,
      "metadata": {
        "source_file": "dao\\藏外\\内修十论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "不以涉事无恼，故求多事。 不以外喧无动。 故来就喧。 以无事为真宅，以有事为应迹。 若水与镜，遇物见形。 善巧方便，惟能入定。 发慧迟速，则不由人。 勿于定中急急求慧。 求慧则伤性，伤性则无慧。 不求慧而慧自生，此真慧也。 慧而不用，实智若愚。 益资定慧，双美无极。 若定中念想，则多感众邪百魅，随心应现，惟今定心之上，豁然无覆； 定心之下，旷然无基； 旧孽曰消，新业不造； 无所缠碍，迥脱尘网，行而久之，自然得道。 夫得道之人，心身有五时七候。 心有五时者：一、动多静少； 二、动静相半； 三、静多动少； 四、无事则静，遇事仍动； 五、心与道合，触而不动。 心至此地，始得安乐。 罪垢灭尽，无复烦恼。 身有七候者：一、举动顺时，容色和悦； 二、宿疾普消，身心清爽； 三、填补夭伤，还元复命； 四、延数千岁，名曰仙人； 五、炼形为气，名曰真人； 六、炼气成神，名曰神人； 七、炼神合道，名曰至人。 若久学定心，身无五时七候者，促灵秽质，色谢归空，自云慧觉，复称成道，实所未然。 【释义】人的眼耳鼻舌身意，对客观的见闻觉知思想意识，好之恶之，记忆自然不同。 万象铭刻于衷，回忆童年历历在目。 忘与不忘是自然的。 静是生命本能，无需用意识去作为，本自灵明智慧生，愚昧自灭。 老子说自然是道，无为是法，因本自清静。 不执着，不以为然，放任自流，自然心态无忘无不忘之意。 自然无为对一切思想意识置之不理。 比喻主不喜客，客无颜自退。 不退主烦客不安。 意执不忘心不安，忘心态意识得解放。 胡思乱想、海阔天空，异想天开，野鹤闲游，信马游疆、放任自流、无动于衷。 乱之极，动之极，即是定静之自然。 天下本无事，庸人自找之，心不起乱，乱从何生？ 心欲求静，求者是乱。 不思动不思静，思想是何？ 自如是法，自然是道。 不认自本心识自本性者，难入无为，见闻觉知之觉性，念念自如妄自消。 十、论坐忘铭 【原文】常默元气不伤，少思慧烛内光。 不怒百神和畅，不恼心地清凉。 不求无谄无媚，不执可圆可方。 不贪便是富贵，不苟何惧君王。 味绝灵泉自降，气定真息曰长。 触则形毙神游，想则梦离尸僵。 气漏形归垄上，念漏神趋死乡。 心死方得神活，魄灭然后魂强。 博物难穷妙理，应化不离真常。 至精潜于恍惚，大象混于渺茫。 道化有如物化，鬼神莫测行藏。 不饮不食不寐，是谓真人坐忘。 心忘念虑。 即超欲界。 心忘缘境，即超色界。 心不着空，即超无色界。 离此三界，神居仙圣之乡，性在清虚之境矣。 张三丰曰：此王重阳祖师十论也。 无极大道，尽寓其中。 空青洞天，向多有仙真来游。 遗留丹诀道言以去者，此亦度人觉世之心。 重阳祖师之十论，亦本斯旨也。 山中人得此训言，又何必另寻瑶草，别采仙花。 即此是长生药、不老丹也。 恭录之，以示后之好道者。 【释义】吕祖说我性从来本自然，本来由我不由天。 夜半铁汉自思量，长生不死由人作。 人生百年南柯梦，觉者自我撞晨钟。 道在圣传修在己。 德在人积命由天。 苍海云横迷去路，悟者一步不离即西天。 喜怒哀思自心定，神圣仙佛种子自心田，灵苗生在自心内，外寻十万八千无觅处。",
      "translated_text": "Do not, because one remains unperturbed amidst affairs, seek out more affairs. Do not, because one remains unmoved by external clamor, draw near to clamor. Regard the absence of affairs as one’s true dwelling, and the presence of affairs as mere responsive traces. Like water or a mirror, one meets things and reflects their forms. Only through skillful means can one enter samādhi. The swiftness or slowness of wisdom’s arising does not depend on human effort. Do not urgently seek wisdom within samādhi, for seeking wisdom harms one’s nature, and harming one’s nature precludes wisdom. When wisdom is not sought, it arises of itself—this is true wisdom. Though wise, one does not employ it, and true insight appears as foolishness. Thus, samādhi and wisdom mutually enhance one another, their beauty boundless.\n\nIf, within samādhi, thoughts arise, one may attract numerous demons and spirits, which manifest in accordance with the mind. Only when the mind in samādhi is suddenly unobstructed above and boundlessly open below do old karmic debts dissolve and new karma cease to form. Unentangled and free, one transcends the snares of the dusty world. With sustained practice, the Dao is naturally attained.\n\nThose who attain the Dao undergo five stages in the heart and seven signs in the body. The five stages of the heart are:\n1. More movement than stillness;\n2. Movement and stillness in equal measure;\n3. More stillness than movement;\n4. Stillness when unoccupied, yet movement when engaged in affairs;\n5. The heart in harmony with the Dao, unmoved by contact.\n\nOnly upon reaching this state does one find true peace, with all karmic defilements extinguished and afflictions no more.\n\nThe seven signs of the body are:\n1. Movement in accord with the seasons, countenance harmonious and joyful;\n2. Chronic illnesses vanish, body and mind refreshed and clear;\n3. Premature injuries are mended, one’s original nature and life restored;\n4. Lifespan extends for millennia, and one is called an immortal;\n5. The form is refined into qi, and one is called a perfected person;\n6. Qi is refined into spirit, and one is called a spirit person;\n7. Spirit merges with the Dao, and one is called a supreme person.\n\nIf, after long practice of calming the mind, one exhibits neither the five stages nor the seven signs, one’s impure and decaying form will return to emptiness. Though one may claim spiritual awakening or even attainment of the Dao, such assertions are unfounded.\n\n---\n\nThe eyes, ears, nose, tongue, body, and mind perceive objective sights, sounds, smells, tastes, touches, and thoughts, each generating attraction or aversion, their memories naturally differing. The myriad phenomena are etched within, and childhood recollections remain vivid. Forgetting and not forgetting occur naturally. Stillness is the innate capacity of life, requiring no conscious effort—original luminous wisdom arises, and ignorance vanishes of itself. Laozi said the natural is the Dao, non-action is the method, for the original state is inherently pure. Without attachment or insistence, allowing things to flow freely, the mind naturally holds neither forgetting nor non-forgetting. Non-action and non-interference leave all thoughts and perceptions unattended. It is like a host who dislikes guests; the guests, ashamed, depart of their own accord. If they do not depart, the host grows weary, and the guests uneasy. Clinging to thoughts disturbs the mind, but forgetting liberates consciousness. Random thoughts, boundless imaginings, fanciful ideas, wild cranes in leisurely flight, wandering freely without restraint—utter chaos and extreme motion are the natural state of samādhi. The world is originally without affairs; it is the ordinary person who seeks them. If the mind does not stir, whence arises disorder? To seek stillness is itself disorder. Neither thinking of movement nor stillness—what then is thought? Spontaneity is the method; naturalness is the Dao. Those who do not recognize their original mind and see their original nature cannot enter non-action. The awakened nature of perception, hearing, and cognition dissolves delusion in each thought.\n\n---\n\n**Inscription on Sitting in Forgetfulness**\n\nEver silent, the primordial qi remains unharmed;\nLittle thought, the lamp of wisdom shines within.\nNo anger, the hundred spirits harmonize and flow;\nNo vexation, the mind-ground is cool and clear.\nNo seeking, no flattery or fawning;\nNo clinging, adaptable as round or square.\nNot covetous—this is true wealth and nobility;\nNot careless—what fear of kings?\nTaste is cut off, and numinous springs descend of themselves;\nQi settled, true breath lengthens.\nAt touch, the form perishes and spirit wanders;\nIn thought, one dreams, leaving the corpse rigid.\nQi leaks, and the form returns to the grave;\nThoughts leak, and spirit hastens to the realm of death.\nOnly when the heart dies does spirit live;\nOnly when the corporeal soul perishes does the ethereal soul grow strong.\nThe subtleties of all things are difficult to fathom;\nTransformations do not depart from the true constant.\nSupreme essence hides in the indistinct;\nThe great image merges with the vast and vague.\nThe transformations of the Dao resemble the transformations of things;\nEven spirits cannot fathom its movements and concealments.\nNo drinking, no eating, no sleeping—\nThis is the true person’s sitting in forgetfulness.\n\nWhen the heart forgets thoughts and cares,\nOne transcends the desire realm.\nWhen the heart forgets conditions and objects,\nOne transcends the form realm.\nWhen the heart does not cling to emptiness,\nOne transcends the formless realm.\nLeaving these three realms behind,\nThe spirit dwells in the land of immortals and sages,\nAnd the nature abides in the realm of purity and emptiness.\n\nZhang Sanfeng said: These are the Ten Discourses of Ancestor Wang Chongyang. The Great Dao of Wuji is fully contained within them. In the Kongqing Grotto-Heaven, many immortals and perfected beings have come to wander. Those who left behind alchemical formulas and Daoist teachings did so with the intention of awakening the world and liberating people. The Ten Discourses of Ancestor Chongyang are based on this same principle. Having received these teachings in the mountains, why seek other elixir herbs or gather immortal blossoms? This is the medicine of longevity, the cinnabar of agelessness. Respectfully recorded to guide those who come after and love the Dao.\n\n---\n\nLüzu said: My nature has always been naturally so,\nOriginally dependent on me, not on heaven.\nAt midnight, the iron man reflects:\nLong life and immortality are made by human effort.\nA hundred years of human life are but a dream of Nanke;\nThe awakened one strikes the morning bell for themselves.\nThe Dao is transmitted by sages, but cultivation depends on oneself;\nVirtue is accumulated by people, but life is decreed by heaven.\nClouds over the sea obscure the path;\nThe awakened one takes a single step and does not stray from the Western Paradise.\nJoy, anger, sorrow, and thought are settled by the heart;\nThe seeds of sages, immortals, buddhas, and gods lie in the field of the heart.\nThe numinous sprout grows within the heart—\nSeeking it outside for a hundred thousand miles is futile.",
      "overlap_context": " as if without mind. In quiet or in noise, one’s resolve should be singular.\n\nIf the mind is bound too tightly, it may generate illness and qi stagnation, leading to madness or delusion—these are the signs. If the mind does not move, one must also allow it freedom, maintaining a balance between tension and relaxation, always adjusting to what is fitting. Restrain without attachment, release without indulgence. In noise, there is no aversion; in affairs, there is no vexation—this is true samādhi.",
      "start_char": 6210,
      "end_char": 7463,
      "start_sentence": 359,
      "end_sentence": 440,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.16915488243103,
      "metadata": {
        "source_file": "dao\\藏外\\内修十论.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "内观抱元守一，一性圆明是自家。 有求心外客，有法非自家。 一个身心生万法。 道本虚无用法作什么？ 心是矿中金，法是炼金火，金成，无火、无矿、也无金。 物质本无性，符号名是金。 真金本无染，皆因矿混金。 自心有慧火，除矿金自精。 有为皆假火，真火自慧根。 不烧矿自灭，不炼本是金。 修炼是假名，取法昧自心。 舍法不知义，不取不舍自家真。 阳光是本能，云雾是外生。 自心本清静，客观是外因。 月照云雾散，心清除外因。 不用有为法，无为我自真。 内修十论结语",
      "translated_text": "Within, embrace the Origin and guard the One—\nThe One Nature, perfectly luminous, is one’s own.\nSeeking guests beyond the heart,\nClinging to methods not one’s own.\n\nA single body-mind gives birth to the ten thousand dharmas.\nThe Dao is fundamentally empty and non-being—what use are methods?\nThe heart is gold within the ore;\nMethods are the fire that refines it.\nWhen the gold is wrought,\nThere is no fire, no ore, and no gold.\n\nMatter is inherently without nature—\nThe name “gold” is but a sign.\nTrue gold is never tainted,\nYet ore confounds it with impurity.\nWhen the heart’s wisdom-fire arises,\nThe ore is purged, and gold is pure.\n\nAll contrived efforts are false fire;\nTrue fire springs from the root of wisdom.\nWithout burning, the ore vanishes of itself;\nWithout refining, it is gold already.\n\nCultivation is but a provisional name—\nTo grasp at methods is to obscure one’s own heart.\nAbandoning methods, one loses the meaning;\nNeither grasping nor abandoning, one’s own truth remains.\n\nSunlight is one’s inherent power;\nClouds and mist arise from without.\nThe heart is originally pure and still—\nObjective conditions are external causes.\nWhen moonlight shines, clouds and mist disperse;\nWhen the heart is clear, external causes vanish.\n\nNo need for contrived methods—\nIn non-action, my true self abides.\n\n*Closing the Ten Discourses on Inner Cultivation*",
      "overlap_context": "lves.\nThe Dao is transmitted by sages, but cultivation depends on oneself;\nVirtue is accumulated by people, but life is decreed by heaven.\nClouds over the sea obscure the path;\nThe awakened one takes a single step and does not stray from the Western Paradise.\nJoy, anger, sorrow, and thought are settled by the heart;\nThe seeds of sages, immortals, buddhas, and gods lie in the field of the heart.\nThe numinous sprout grows within the heart—\nSeeking it outside for a hundred thousand miles is futile.",
      "start_char": 7463,
      "end_char": 7684,
      "start_sentence": 441,
      "end_sentence": 457,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.6486334800720215,
      "metadata": {
        "source_file": "dao\\藏外\\内修十论.txt",
        "category": "藏外"
      }
    }
  ]
}