{
  "source_id": "冲虚通妙侍宸王先生家语",
  "source_file": "chunked_daozang\\冲虚通妙侍宸王先生家语.json",
  "total_chunks": 9,
  "total_original_chars": 6160,
  "total_translated_chars": 35570,
  "total_translation_time": 170.18617582321167,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\冲虚通妙侍宸王先生家语.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Conversations of Master Wang of the Palace Attendance, Transcendent and Wondrous**\n*Title:* *The Transcendent and Wondrous Conversations of Master Wang of the Palace Attendance of Kunxu*\n*Author:* Wang Wenjia of the Song Dynasty\n*One fascicle*\n*Source text:* *Zhengtong Daoist Canon*, Orthodox Section, Part One\n\n---\n\nMaster of the Palace Attendance said:\nIn former times, I wandered through over two hundred famous mountains. Once, arriving at the Pure Truth Grotto in Jinling—a place where the Tang-dynasty Master Ye cultivated the Dao—I found myself at dusk with no human habitation to rely upon. Gazing into the distance, I suddenly saw a lamp glowing in the mountains. Following its light, I came to a thatched hut, where all was silent and no one was present. My heart was greatly alarmed. Beneath the lamp, upon a table, lay a written text. Opening it, I saw it was titled *The Scripture of Hissing and Roaring Wind and Rain*. I thought it must belong to the Thunder Abode, and my mind was at ease. Taking brush and ink, I copied it onto a leaf. As I neared the end of my transcription, I suddenly heard the crowing of a cock. In an instant, an old woman emerged.\n\nI asked her name and surname. The old woman replied: \"I have no name or surname. This is the dwelling place of thunder and lightning. You cannot stay long.\" I asked: \"Why does the crowing of the cock bear this name?\" She said: \"It is the Golden Cock crowing within the earth.\" I awoke and departed. After no more than a few steps, I turned back, but the thatched hut had vanished. Soon, after traveling a little over a *li*, I arrived at the Grotto-Heaven. Thus, I obtained the Thunder Scripture, beginning with the Pure Grotto-Heaven.\n\nDisciple Yuan Tingzhi asked:\nMaster, you obtained the Thunder Scripture in the Grotto-Heaven. I suppose your celestial bearing and Daoist bones were favored by Heaven, which granted you this encounter. Yet in ancient times, one could not attain the Dao without a master. If one has no master, can one still practice?\n\nThe Master of the Palace Attendance said:\nBefore I obtained the Thunder Scripture, I had already met Master Wang by the Yangzi River, who taught me the Way of Flying the Spirit to Audience with the Emperor. Later, while wandering in the Pure Truth Grotto-Heaven, I obtained this scripture. After three years had passed, I again encountered Master Wang at the Junshan Inn. Later, passing by a Chan monastery, he asked me: \"How fares your cultivation of the Way of Flying the Spirit to Audience with the Emperor?\" I answered Master Wang: \"Three years ago, your disciple arrived at the Pure Truth Grotto-Heaven. As dusk fell, I lost my way and found myself in a desolate thatched hut, where a solitary lamp burned upon a lone table. There, I obtained *The Scripture of Hissing and Roaring Wind and Rain* and transcribed it onto my person. Here, I present it to you.\" Master Wang said: \"You are truly a destined immortal. The old woman was the Mother of Lightning. Since you have obtained this scripture, I shall now instruct you in its mysteries.\" When he had finished teaching, he summoned a messenger and gave instructions to the empty sky. This was my enlightenment under Master Wang’s guidance.\n\nA question was asked:\nWhen thunder is stirred and lightning aroused, what is the essential principle?\n\nThe answer:\nThunder and lightning are the commands of Heaven. They must not be rashly invoked unless the matter is urgent. It is like the Bureau of Military Affairs issuing an order to a regional office: those who receive it must act in accordance with the command. Yet people today, lacking innate predisposition and not having met a true master, pass down errors through hearsay. They follow diagrams to seek horses, heedless of the gravity of the matter. Some seek fame or reputation, others pursue profit or wealth, acting recklessly. They claim Heaven’s power as their own, yet when the moment comes, they accomplish nothing. Thunder possesses a precise mechanism; lightning, a decisive method. With a master’s guidance, response follows as echo to sound.\n\nA question was asked:\nAs for the messengers, where does their profound mystery lie?\n\nThe answer:\nThe transformations of thunder and lightning reach without limit. When the spirit moves, Heaven follows; when *qi* arrives, efficacy is near. Within the inner mystery of the unfathomable and indistinct, you enact the transformations of crashing thunder and surging power. From one comes two, from two comes three, from three come the ten thousand things. Manifesting wondrous function, it ascends to the azure vault and descends to the Yellow Springs—there is nowhere it cannot go. As the Chan school says: \"A thousand rivers hold water, a thousand rivers hold the moon; ten thousand miles without clouds, ten thousand miles of sky.\" This is precisely it.\n\nA question was asked:\nYour disciple has already received your instruction, which has dispelled my dullness. But what is the meaning of \"a thousand rivers hold water, a thousand rivers hold the moon; ten thousand miles without clouds, ten thousand miles of sky\"?\n\nThe answer:\nThis expounds the mystery of the messengers. Consider \"a thousand rivers hold water, a thousand rivers hold the moon.\" The original nature of humanity is like the bright moon—one point of perfect clarity, serene and unmoving, its numinous radiance pervading all. Yet people today know only the name of thunder and do not investigate its essence, the original spirit. Water is still water. The world sees only the moon’s form but not its wonder. Only when reflected in water does its nature become still. As for \"ten thousand miles without clouds, ten thousand miles of sky,\" the nature of humanity is fundamentally good, yet it is obscured by the seven emotions and six desires. If one can purify the heart and reduce desires, all obstacles vanish, and Heaven becomes visible everywhere.\n\nA question was asked:\nThe mystery within mystery has been clarified, and your guidance has dispelled my confusion. But how can one verify its efficacy in practice?\n\nThe answer:\nYour question is apt. When summoning thunder to act, first call the messenger to seek it. For thunder, lightning, wind, and rain are known only to the messenger. Thus, the method requires the messenger to serve as vanguard and sharp general.\n\nA question was asked:\nThe swiftness of the messengers is indeed divine. Yet when the ancestral palace issues forth, it can be employed in any direction. But in the vast emptiness, how can one verify the messenger’s arrival?\n\nThe answer:\nThe method requires stillness and silence. Knock the teeth, grasp the thunder tally, and summon according to the ritual. Silently recite the incantation, contain the light, and remain still. When the space between your brows itches, the messenger has arrived.\n\nA question was asked:\nFormerly, your disciple received your instruction and was taught the ritual method. While at the home of Chen Zishi in Yihuang, I saved a patient by silently summoning the messenger to slay the malevolent spirits. As I sat in meditation, a sudden gust of wind brushed against my feet. Later, I gave the talisman to the patient, who saw the messenger manifest in form. How does this verification differ from your teaching about the itching between the brows?\n\n---\n\nThe answer:\nThe thought arises from a single point, and the response manifests in one’s own body. The head is round, symbolizing Heaven; the feet are square, symbolizing Earth. The verification at the space between the brows means the messenger arrives through the Gate of Heaven. The verification at the feet means the messenger comes through the Door of Earth. Now, the forms, shadows, sounds, and echoes of malevolent spirits exist in the yang realm and are confined to the earth. Thus, when the messenger breaks through the Door of Earth to search for the spirits, the sign of moving thunder is felt from the space between the brows to the depths of the five viscera.\n\nA question was asked:\nYour explanation is correct. One day, while at home, I gave a talisman to save a woman in childbirth. As I summoned the general, my heart surged violently, my left eye twitched repeatedly, and when I dispatched the talisman and sent the messenger, my mind was unsettled. I thought the messenger had not arrived, which was why this occurred. The next morning, the family came to express their gratitude, saying the woman had seen a green-faced ghostly messenger with three eyes, fire blazing from them, circling her. She felt her body burning as if on fire, and soon after, she delivered a stillborn child. What does this signify?\n\nThe answer:\nThis is clear verification—how can you be so foolish?\n\nYour heart surged violently, for the moment your ancestral palace’s messenger emerged, the transmission reached your heart—hence the urgency. The green-faced, three-eyed apparition was your spirit transformed by the talisman. The twitching of your left eye: fire returning to the realm of wood. Thus the living mother was spared, while her child was lost. This principle is as clear as daylight—why so much doubt and questioning?\n\nA question was asked:\nThe swiftness of summoning thunder lies solely with the messenger—then what purpose do the Five Generals of Cheng Yong serve in the method?\n\nThe answer:\nThey are the primordial, indestructible spirit of the Prior Heaven, the very Yuan Shi you now revere. Cheng Yong is the sun and moon; the Five Generals are the five planets. Within the human body, the messenger is the primordial spirit. Cheng Yong is the primordial qi and primordial essence; the qi of the five viscera becomes the Five Generals. On earth, the messenger is the True Sovereign of Later Soil. Cheng Yong corresponds to the Nine Ramparts of Fengdu; the Five Generals correspond to the Five Peaks. For humans dwell at the center of Heaven and Earth, borrowing the Dipper’s revolution to harmonize the Three Powers—this is what is meant by “one aperture opened, ten thousand apertures open; one general efficacious, a hundred generals efficacious.”\n\nIn general, why is the messenger’s *gang* pacing singled out as “bubbling spring”?\nWater is born of Heaven. Between the second, third, fourth, fifth, and eighth palaces, Heaven and Earth, water and fire, thunder and wind, mountains and marshes—nothing is not encompassed. The pivot and mechanism lie in the position of *kui* and *gang*, which revolve and transform the creative workings of Heaven and Earth. The Five Generals serve as the messengers’ agents.\n\nAs the scripture says: “Through unity, all things are accomplished.” The profound mysteries of inner and outer realms truly arise from this.\n\nA question was asked:\nThe pivot and mechanism are called sun and moon—why then do they reside in *chen* and *xu*?\n\nThe answer:\nNot so. *Xu* is the sun’s pivot; *chen* is the moon’s mechanism. The key to yin and yang truly lies here. If the pivot of Heaven and Earth, sun and moon, and stars fails to turn, the Dao of Heaven and Earth is blocked. If scholars do not know the pivot, how can thunder be aroused? How can rain and sunshine be invoked? Within the human body, the Dipper’s pivot turns, and ten thousand transformations follow. As the scripture says: “Gently nudge the Dipper’s handle—forth pours the Silver River by the myriad bushels.” Such is the marvel.\n\nA question was asked:\nIf Cheng Yong is the sun and moon, and the Five Generals govern metal, wood, water, fire, and earth, how does the earth messenger govern and revolve?\n\nThe answer:\nThe messenger is intent. It is also the Great *Kui* of the Center, the Star of the Grand Overseer.\n\nThe *Tanlang* star is called the Star of the Grand Overseer; the messenger, receiving this qi, transforms and gives rise to the Grand Overseer—this is the pivot of the primordial True Qi of the Celestial Pole turning once. How could the celestial mechanism fail to follow? Thus, the messenger’s talisman employs the two taboo names *xin* and *yin*, for there is an explanation.\n\nA question was asked:\nYour explanation is thorough, Master, yet your disciple still does not understand.\n\nThe answer:\nIn Heaven, the Dipper follows the handle’s pointer to establish the lunar station. Within a single establishment, there are two qi and six seasonal divisions. If one can, in a single moment, gather the qi of an entire year, then when set in motion, all the affairs of that year—whether auspicious or ominous, rain or shine—are fully encompassed within it. The *Kui* is the Dipper’s head, the pivot of Heaven. Extending this principle, the 384 changing lines of the hexagrams truly originate here. You should follow the Dipper’s movement in your practice. Moreover, the twenty-eight constellations of the four directions each possess their own wood, fire, earth, metal, and water, while the Dipper resides at the center to harmonize the Seven Governors. Among the thirty-six qi, the *Kui* stands at the forefront, revolving them all.\n\nA question was asked:\nYour explanation is clear, Master. Yet why is it that today’s scholars, though they neither cultivate accumulation nor possess true learning...\n\nBy chance they practice and also achieve resonance—how is this so?\nI answer: First, it is due to luck; second, such a person’s fate and circumstances happen to align, yielding temporary efficacy. If you practice my method, you must thoroughly penetrate the inner workings to decisively determine external responses without doubt. When the thunder deities are untimely, if the method and incantation are authentic, what cannot be achieved?\n\nA question was asked:\nI have seen two fellow practitioners, You and Ping, who use the same method. Why is it that when they perform rituals, only six or seven out of ten succeed—what is the mechanism behind this?\nI answer: The Dao affinity of You and Ping is shallow, their practice of the method is not yet refined, and their hearts waver between doubt and belief. Thus, only six or seven out of ten succeed.\n\nA question was asked:\nAs for my own practice, I sit in meditation at dawn, setting a fixed time to await the response. Why is it that when I ascend the altar, the outcome does not match the talisman’s intent—what is the reason for this?\nI answer: Sitting in meditation merely uses the thunder deities as a talismanic token. When people have matters to address, they may petition the Emperor in one way, report to the master in another, or dispatch the generals in yet another. Even when setting a time, they cannot fix it precisely—sometimes choosing the *wei* or *shen* hour, other times the *hai* or *zi* hour—thus causing confusion and disorder, which is why the response does not arrive as scheduled. If you set the *shen* hour, then adhere to *shen*; if you set the *wei* hour, then adhere to *wei*—like the fire of Mount Li, which was agreed to be lit at a specific time. If it is not done so, trust is lost. Those who practice thunder methods must deeply reflect on this.\n\nA question was asked:\nSome say that petitioning the Emperor may lead to errors in practice—how is this?\nI answer: Petitioning the Emperor is effective only if you can project your own spirit to make the report. If you merely rely on written words, waiting for the master to compile and submit the petition, errors will inevitably occur.\n\nA question was asked:\nThe True Kings have teachings on acting at one’s discretion—does this mean petitions are unnecessary?\nI answer: Even with discretionary action, there are two considerations. For major afflictions that disturb human souls and destinies, or when malevolent dragons recklessly stir thunderstorms, harming people and things, as well as matters that should not be reported, discretionary action is permitted. However, if the matter concerns heavenly decrees, you must project your spirit to petition and await the imperial decree before acting.\n\nA question was asked:\nSome texts mention \"celestial mechanisms\" and \"thunder mechanisms\"—what do these mean?\nI answer: Indeed, they exist. The \"celestial mechanism\" refers to the rotation of the Dipper’s stars, the cycle of the twenty-eight constellations, the surging of the thirty-six leaps, and the clashing of the twenty-four *qi*’s *gangsha*, where mutual opposition and alignment can stir thunder and lightning. As for the \"thunder mechanism,\" it is the creation within the palm, the domain where divine thunder rises, falls, appears, and vanishes—observing where wind, clouds, thunder, rain, and lightning gather, and employing the flying *gang* wheel incantations to command the thunder deities.\n\nA question was asked:\nWhat is the essential method for refining the generals?\nI answer: The generals are a single *qi*. You emit your own *qi* to merge with Heaven’s *qi*. From this single *qi*, all other *qi* arise—these are the turbid *qi* within the human body. You must absorb Heaven’s pure *qi* and blend them thoroughly before refining. Refining *qi* relies entirely on the workings of the five waters and five fires. Without refinement, the *qi* of thunder lacks divinity.\n\nA question was asked:\nWhen commanding thunder, lightning, wind, and rain, one must verify the effects during seated practice to achieve efficacy.\nI answer: You must cultivate the work in your breath and verify the response in stillness. When clouds emerge, their *qi* is steaming; when rain arrives, its moisture is urgent. Before rain comes, the *qi* is scorching, and the bladder’s *qi* is tense. When lightning stirs, the eyes itch, and their light suddenly flashes. When thunder stirs, the three fields drip with sound, and the five viscera roar in an instant. The practitioner must swiftly ignite the heart’s fire to excite it, surge the kidney’s water to propel it, and first seal the five senses to internally verify the five phases—this is the method.\n\nA question was asked:\nWhenever I see you, Master, perform the practice, a fierce wind arises, followed by thunder and lightning—why is this?\nI answer: Fix your gaze, hold your breath, and face the *xun* direction. With your hand, stir the *gang* of the whirlwind fiercely, swallow three times, turn your body, and kick the wind wheel with your foot—passing from *xun* to *you*, exiting at *chou*—and the wind will rage. Thunder is not fierce without wind, rain does not form without wind, clouds do not rise without wind, and lightning does not move without wind. As for praying for rain, it relies entirely on the chaotic rising of the north wind to signal rain’s arrival—this is the subtlest method.\n\nA question was asked:\nMaster, you often stay in the palace, yet during snowfall, it is scorching summer—how is this possible?\nI answer: This transformation is the result of twenty years of my cultivation. After the summer solstice, *yin* is born within, and through this, the mercury tiger conceives. It is the subtle alignment of *qi* through the movement of my fingers, flawlessly merging the mysteries of *li* and *xu*.\n\nA question was asked:\nPraying for snow is considered difficult in the world. I thought that in winter, when cold congeals, it immediately turns to snow—why is it said to be difficult?\nI answer: After the winter solstice, the *yang* of creation begins, and the mechanism originates from *yang*. When the *yang qi* of the human body is dispersed, it is not easy to summon snow. The method involves moving the heart’s fire to excite the kidney’s water, then fiercely circulating the lung’s *qi* to generate it. Afterward, you must stir the wind cave, seal the *li* *qi*, and allow it to ferment.\n\nA question was asked:\nThe mechanism of killing and subduing is truly difficult to master.\nI answer: What is difficult about it? Simply mobilize your own killing *qi*, command the *gang* stars of Heaven, and harness the tiger and archer of the human realm. When these three unite with the spirit, their power will shake and subdue.\n\nA question was asked:\nI often see people praying, and when night falls, they see flashes of lightning, assuming that during the altar ritual, it must align with the talisman’s intent. Yet why do most fail?\nI answer:\n\nI answer: There is no other reason—only a lack of true cultivation. They do not consider from which direction the lightning stirs, where the thunder and rain arise, or where the skies remain clear. How can they take such signs as their standard? Thus, their self-deception is only natural.\n\nA question was asked:\nThe methods of praying for rain are many and varied. Why do some talismans work while others fail to bring response?\nI answer:\nPraying for rain is most critical in summer. The ancient sages and worthies never prayed for rain in spring, autumn, or winter. In the fourth lunar month, pure *yin* prevails, and *yin* governs affairs. If *yang* errs even slightly, drought and famine follow. Thus, the method of praying for rain was established to save the rice and millet. Today’s scholars, ignorant of the proper method, merely blame the talismans for their inefficacy.\n\nA question was asked:\nThe seventh and eighth months belong to autumn. Why do they also suffer from lack of rain or excessive sun? What is the reason for this?\nI answer:\nAutumn corresponds to *metal*, while the residual fire of summer flows westward, making it difficult to restrain. Moreover, fire and metal clash. If by chance the celestial divisions align with a drought-inducing *qi* cycle, even slight imbalance leads to disorder.\n\nA question was asked:\nIf this is so, how can one effect change?\nI answer:\nThe method lies in the practice of silent audience, which mediates between presence and absence to produce verification. Long ago, when I entered the capital for an audience, I twice encountered the Fire Master, who said: “You have been entrusted with a grave commission in the imperial court, so I have come to inform you. This year, Heaven’s decree ordains drought—it is not something you can pray away.” I then bowed and asked the Fire Master for instruction. He replied: “All the dragon pools and springs under Heaven have been sealed by the Jade Emperor. Even with talismans and methods, if the allotted number is not fulfilled, prayer will be in vain.” I pressed further, asking what he would teach me. He said: “On this journey, only the Yellow River remains unsealed. You should dispatch a summons to its spirit, borrowing water from the Yellow River to relieve the drought.” I followed his instruction upon arriving in the capital, and the court indeed commanded me to pray for rain. I issued a decree to the Thunder God, borrowing three feet of water from the Yellow River to save the land. Later, the capital reported that the rain that fell was muddy water. Thus, the Fire Master’s words proved true.\n\nA question was asked:\nMaster, you possess the bearing of an immortal and the bones of a Daoist, while I am but a common man. You have had extraordinary encounters with the Fire Master—what will I rely upon when I face doubts in the future?\nI answer:\nThe notion of immortal bearing and Daoist bones is not unfounded, yet the connection between Heaven and humanity is the same for all. If you lack the virtue to summon a master, you should enter your chamber, sit upright, and test your own destiny. Take, for example, the matter of praying for rain: when Heaven’s decree and the *qi* cycle are thus, it is difficult to verify the mechanism within oneself. One must observe whether urine flows or not. Press the tongue against the upper palate, swallow saliva, and stir the water of the gallbladder. The gallbladder is the Water of the Celestial One, the purest and most noble substance. When this water stirs, it excites the fire of the bladder. Fire rises and water descends—this is the principle of Heaven’s *qi* descending and Earth’s *qi* ascending. When *yin* and *yang* ascend and descend in harmony, rain falls in due measure. The Dragon of the Gallbladder resides in the great abyss of the bladder. When it inverts to draw forth water, responding to the moment, rain arrives. If one does not maintain unbroken continuity—if one merely stirs the gallbladder’s water to excite the bladder’s fire and then relies on urine to verify the effect—there will not only be no result but also cause for ridicule.\n\nA question was asked:\nThe subtlety of harmonizing ascent and descent is indeed profound. But how does one achieve the effect of unbroken continuity?\nI answer:\nFollow my words: sit in stillness and silence for three days to test the verification.\n\nA question was asked:\nI respectfully received your teaching and returned home to sit in stillness for three days, releasing all thoughts and refraining from all affairs. After completing the three days, I returned to seek your instruction.\nThe master said:\nHave you practiced what you were taught?\nI replied:\nI humbly present myself before you to receive further teaching.\nThe master said:\nWhat benefit did you gain from your sitting?\nI replied:\nFollowing your instruction, I only felt my body light and at ease, my mind and emotions clear and refreshed.\nThe master said:\nHow foolish you are—this *is* the effect. At the beginning of practice, one already feels thus. From three days to nine, to twenty-seven, to eighty-one, to one hundred twenty, to two hundred ten days—with prolonged practice, day by day and month by month, spirit and *qi* naturally coalesce. At the highest level, one may shed the mortal form and ascend to the origin; next, one may attain longevity and enduring vision; and further still, one may summon clouds and rain, command lightning and thunder, benefiting people and all things. What is there that cannot be achieved?\n\nA question was asked:\nRegarding the method of summoning rain, how does one apply the subtlety of unbroken continuity?\nI answer:\nIn the state of profound stillness, it is like the time of nurturing the dragon and cultivating the Dao. If one can sit with true accumulation of effort over time, the nature of Heaven becomes clear, and the still water settles. The Mercury Dragon conceals itself within, and when the Lead Tiger responds, *yin* and *yang* harmonize. When the ancestral *qi* stirs, it ascends to the great abyss, and the dragon within the body also rouses. Through this resonance, when one wishes for rain, it can pour forth at the mere thought. Yet if, during practice, one fails to nurture and sustain it—like cultivating lotuses on dry land or binding the void—how can success not be difficult?\n\nA question was asked:\nHeaven’s decree is lofty and unyielding. Even with inner cultivation, how can one influence it?\nI answer:\nThe decree lies with Heaven, but the intention to influence it depends on responding to the moment with adaptability. Before my journey to the capital, the local administration asked me to pray for rain. Before I began my practice, they had already performed numerous prayers without result. One day, in deep stillness, a messenger from the void silently reported: “Heaven’s decree ordains drought—no method can alter it. However, fifty *li* from the prefecture lies the Thunder Marsh, in the land of Jianchang and Xiuyuan. Though the Thunder God there has been commanded to seal the marsh, within the Daoist method, he may still be moved to act. You should use a talisman to summon him.”\n\nI awoke and immediately dispatched the talisman, commanding the messenger to pursue the matter. Returning to my seat, I vaguely saw an old master suddenly appear upon the altar. He drew a mouthful of ink—steeped in the essence of the sun—from the bowl and departed. Soon after, the sky and earth darkened, and a light rain fell for a brief moment before ceasing. Before I could react, the drought resumed.\n\nLater, I asked the messenger, who explained: “The old master was none other than the dragon spirit you had summoned. Though he had disobeyed the decree to emerge from his cave, the fleeting drizzle was merely the mouthful of pure water from the altar—a mere token of response within the method.”\n\nThereupon, I sent another memorial, flying it to the True King to petition for an imperial decree. The Son of Heaven’s edict was granted, and rain fell for three days before the drought returned.\n\nSomeone asked: “If a master such as yourself can achieve this, why then do the many ritual officers and Daoist priests of today—who fill every hall with their petitions—fail to produce any consistent response, despite their repeated memorials? What accounts for this?”\n\nI answered: “In general, the memorials they submit reach only a single destination and must not be overly elaborate.”\n\nMoreover, when people today have matters to address, they rush to the Drum of Petition. The heavens manifest drought through celestial reckoning, yet you submit memorials out of private whim—these must be relayed through the Censorate and transmitted down to prefectures and counties before any action is taken. By the time the imperial command arrives, would not the rain on that very day have been in vain? Thus, the Fire Master taught me the method of dispatching spirits to petition the Emperor on High. For the matter of praying for rain, it falls under the jurisdiction of the Heavenly Lord of Green Waves. One need only memorialize the Heavenly Lord, beseeching him to relay the plea to the Jade Emperor. Once the decree is granted, it descends to the True Palace of Earth, where the depths are opened to release water and rescue the withered land.\n\nSomeone asked: “Thunder shakes the earth for a hundred *li*—why then does it not extend everywhere, so that one district may receive rain while another does not, a third remains dry, and a fourth is drenched only to return to drought?”\n\nI answered: “When performing the ritual, first issue a summons to the local spirits of the ward and village to receive the rain. If the people of that square *li* are sincere and the village spirits come forth to welcome it, the memorialized rain will surely fall in torrents. But if the people of that district have accumulated evil to the point of drought and calamity, not a drop will descend, nor will the village spirits come to receive it. This principle is like dispatching an official in the mortal realm to bestow relief upon a locality: if the prefecture and county are well-governed, the relief will surely arrive; if the magistrates are derelict in duty, it will amount to nothing more than empty formalities.”\n\nSomeone asked: “The ancient masters held that praying for clear skies was more difficult than praying for rain—how does this method fare in practice?”\n\nI answered: “The workings of creation are but the turning of the mysterious within. When rain and floods linger, there are several explanations: first, the seasonal qi and celestial reckoning; second, the reckless stirring of clouds and rain by flood dragons and mirage-serpents; third, the failure of those responsible for harmonizing the elements, leading to prolonged deluges. Thus, such matters cannot be discussed in sweeping terms.”\n\nSomeone asked: “As you instruct, what is the proper method?”\n\nI answered: “The verification within one’s own body is of the utmost urgency.”\n\nBegin by circulating through the cycles of wu and ji, allowing the primordial qi to complete a full revolution and return to dusk. Then, settle into stillness and observe the inner alchemy. If, upon perception, there comes a response—where the heart-fire flames upward, the gall-water trickles downward, the whole body steams with vexing heat, and the throat itches slightly—then the celestial Dao must surely bring clear skies.\n\nSomeone asked: “The signs within the body are now understood. Yet when the celestial reckoning is disrupted or the harmonizing officials fail in their duty, or when the deluge stars linger for ten-day periods, how can one discern this?”\n\nI answered: “Those who harmonize and regulate—from the highest ministers to the local magistrates—are known by the governance they administer and the deeds they perform. Of old, it was said that when a wronged woman cried out, frost fell in the sixth month; when a single man suffered injustice, floods lasted nine years. By this reasoning, all becomes clear. As for deluges that persist for ten-day periods, dispatch Huangfu Kui of Heaven to bind them, and apply the law to restrain the flood dragons and mirage-serpents.”\n\nSomeone asked: “Dragons and mirages stir winds and summon rains—how can they cause such prolonged inundations? The schools of ritual employ talismanic scripts, written charms, and proclamations, with a thousand methods and ten thousand arts, yet cannot command the thunder gods to rouse clouds and rain. Why, then, can these creatures do so?”\n\nI answered: “Dragons and mirages dwell in the hidden depths of mountains, where they too have their local deities. When loyal and righteous men among the people neglect their sacrifices, these beings rise in the villages and hamlets, stirring clouds and rain to ruin fields and harm crops. By law, they should be dispatched to the Demon-Quelling General Qian for execution.”\n\nSomeone asked: “The inner verification and outer governance have been made clear. Yet in practicing the ritual methods, what is the essential point?”\n\nI answered: “For the method of praying for clear skies, establish an altar in the direction of the Fire Killer, set up the altar of governance, summon the thunder, and proceed. First, open the clouds and roll back the mists; then, ignite the fire cavern and seal the rain cavern.”\n\nSomeone asked: “How does one open the clouds and roll back the mists, ignite the fire cavern, and seal the rain cavern?”\n\nI answered: “To open the clouds and roll back the mists within the mysterious, gather all and return them to the tomb. Hold the breath for twenty-one cycles, briefly swallow the saliva, and ignite the fire cavern. Clench both fists tightly, tilt the face upward, and exhale forcefully fourteen times—this is how the fire cavern is ignited. For rain, hold the breath, press the tongue against the upper palate, swallow the saliva three times, and direct it straight to the cinnabar field.”\n\nSomeone asked: “The inner method is thus. What of the outer method?”\n\nI answered: “The method begins by selecting the inner general from the day’s heavenly stem and the outer general from the earthly branch of the day. When they overcome the southern direction, halt. Then observe the monthly sovereign’s element: if the daily sovereign overcomes the star, the ritual may proceed. Simply apply the mutual generation and overcoming of the five phases to verify it.”\n\nI said: “All that you have asked, my disciple, is essential to practice and wondrous in its resonance with humanity. You should follow my methods and perform them accordingly. All the mysteries within the talismans and the subtleties of the rituals have been fully revealed. But refine your heart in cultivation, conduct yourself with upright intention, and every action will strike true—nothing will be beyond your reach. Truly, this is the black pearl of the ocean of methods.”\n\nWith these words, I composed twenty-eight characters for my son-in-law, to be inscribed later by Zhonghe and entrusted to Huiyin Yuan Tingzhi:\n\n*My methods were never recklessly transmitted,\nFor I know the Dao’s law is wondrously profound.\nYour family is of the immortal seed—\nEnsure your descendants, generation upon generation, are worthy.*\n\n**Method:**\nBefore the separation of primordial chaos,\nWithout year, month, or hour,\nRely only on the signs to inform you—\nThis is the winter solstice of the human realm.\n\nThe discourse of Master Kunxu Tongmiao, Attendant of the Celestial King, concludes here.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "冲虚通妙侍宸王先生家话 经名：坤虚通妙侍宸王先生家话。 宋王文钾撰。 一卷。 底本出处：《正统道藏》正一部。 冲虚通妙侍宸王先生家话 侍宸曰：昔游名山二百余所，一到金陵清真洞，乃唐叶天师修真之地。 抵暮，四无人烟可依，远望山中忽有灯光，以此投奔灯光，到草舍间，寂然无人，予心大惊。 於灯下桌上，有一文字，启而视之，名曰：《嘘呵风雨之文》予意其必雷宅也，心方安，取笔墨以木叶录之。 录将毕，忽闻鸡呜之声，须臾一老姥出来。 予问其姓氏，老姥曰：予无姓氏，此乃雷霆所居之地，不可久留。 予问：鸡呜者何以有此氏，姥曰：乃地中金鸡呜。 予觉而出，不数步回望，不见草屋不久一里许，已到洞天。 予得雷书自清洞天始。 门人袁庭植问曰：师得雷书於洞天，想师仙风道骨，天假其绿，适其逢耳。 弟古者非师不度，若无师亦可行。 侍宸曰：予未得雷文之前，已遇汪君於杨子江，授予飞神谒帝之道，后游清真洞天得此文。 经三载之久，又遇汪君於军山店中，后过禅寺语余，所修飞神谒帝之道何如？ 余答汪君曰：三年前弟子到清真洞天，偶昏暮不知其所，荒落草舍之中，孤灯独桉之上，得《嘘呵风雨之文》遂於身中取简呈之。 汪君曰：化子真宿仙也，昔老姥乃电母也。 子既得其文，予当语汝於此方蒙指授。 授毕，乃召使者当空分付。 此余遇汪君点化。 问曰：动雷激霆，其要如何？ 答曰：雷霆者，天之号令，非紧切事务不可妄举。 譬如枢密院发一号令至某处制司，奉承者必须依号令而行。 今之人既无宿骨，不遇明师，以讹传讹，按图索骥，不问事之轻重。 或沽名买誉，或逐利贪财轻率行持，贪天之功以为己有，临事无成毕矣。 夫雷者有的然之机，霆者有截然之法。 得师指授，如响斯答。 问曰：且如使者，的碗玄妙，在於何处？ 答曰：雷霆变化，无远无迩。 神动天随，气至将灵。 子於内玄杳冥恍惚之中，作霹雳激博之化。 一生二，二生三，三生万物，发为妙用，上穷碧落，下至黄泉，无所往而不可。 昔禅宗有云：千江有水千江月，万里无云万里天。 即此是也。 问曰：弟子事师门，已荷发越愚钝，但千江有水千江月、万里无云万里天，其旨如何？ 答曰：此乃发挥使者之妙，且如千江有水千江月。 人之初性，譬犹明月，一点圆明，湛然不动，灵光徧照，今人但知有雷之名，而不究雷之体性元神也。 水，止水也。 世人但见月之形，而不知月之妙，盖得水以映之，其性即止矣。 万里无云万里天者，人性地本善，汩於七情六欲，倘能清心寡欲，诸障消除，其天随处可见矣。 问曰：玄中玄已，荷指迷用中，用何以取验？ 答曰：子之问是矣。 且如召雷行事之时，先召使者寻之。 盖雷霆风雨之处，惟使者知之，所以法要使者为先锋锐将。 问曰：使者之捷固已神矣。 且如祖宫一出，随方可以发用，第杳冥空寂，何以验使者之至否？ 答曰：法当静嘿，叩齿握雷局，依法召之，默念咒音，含光默默，眉问痒时，使者即至矣。 问曰：弟子昔蒙师指教，授以法诀，因在宜黄陈子寔家救病，亦冥冥召使者，诛其祸祟。 坐定，忽然玲风袭两足，后以符与病者，见使者现形。 此验何为与师眉间之说颇异？",
      "translated_text": "**The Conversations of Master Wang of the Palace Attendance, Transcendent and Wondrous**\n*Title:* *The Transcendent and Wondrous Conversations of Master Wang of the Palace Attendance of Kunxu*\n*Author:* Wang Wenjia of the Song Dynasty\n*One fascicle*\n*Source text:* *Zhengtong Daoist Canon*, Orthodox Section, Part One\n\n---\n\nMaster of the Palace Attendance said:\nIn former times, I wandered through over two hundred famous mountains. Once, arriving at the Pure Truth Grotto in Jinling—a place where the Tang-dynasty Master Ye cultivated the Dao—I found myself at dusk with no human habitation to rely upon. Gazing into the distance, I suddenly saw a lamp glowing in the mountains. Following its light, I came to a thatched hut, where all was silent and no one was present. My heart was greatly alarmed. Beneath the lamp, upon a table, lay a written text. Opening it, I saw it was titled *The Scripture of Hissing and Roaring Wind and Rain*. I thought it must belong to the Thunder Abode, and my mind was at ease. Taking brush and ink, I copied it onto a leaf. As I neared the end of my transcription, I suddenly heard the crowing of a cock. In an instant, an old woman emerged.\n\nI asked her name and surname. The old woman replied: \"I have no name or surname. This is the dwelling place of thunder and lightning. You cannot stay long.\" I asked: \"Why does the crowing of the cock bear this name?\" She said: \"It is the Golden Cock crowing within the earth.\" I awoke and departed. After no more than a few steps, I turned back, but the thatched hut had vanished. Soon, after traveling a little over a *li*, I arrived at the Grotto-Heaven. Thus, I obtained the Thunder Scripture, beginning with the Pure Grotto-Heaven.\n\nDisciple Yuan Tingzhi asked:\nMaster, you obtained the Thunder Scripture in the Grotto-Heaven. I suppose your celestial bearing and Daoist bones were favored by Heaven, which granted you this encounter. Yet in ancient times, one could not attain the Dao without a master. If one has no master, can one still practice?\n\nThe Master of the Palace Attendance said:\nBefore I obtained the Thunder Scripture, I had already met Master Wang by the Yangzi River, who taught me the Way of Flying the Spirit to Audience with the Emperor. Later, while wandering in the Pure Truth Grotto-Heaven, I obtained this scripture. After three years had passed, I again encountered Master Wang at the Junshan Inn. Later, passing by a Chan monastery, he asked me: \"How fares your cultivation of the Way of Flying the Spirit to Audience with the Emperor?\" I answered Master Wang: \"Three years ago, your disciple arrived at the Pure Truth Grotto-Heaven. As dusk fell, I lost my way and found myself in a desolate thatched hut, where a solitary lamp burned upon a lone table. There, I obtained *The Scripture of Hissing and Roaring Wind and Rain* and transcribed it onto my person. Here, I present it to you.\" Master Wang said: \"You are truly a destined immortal. The old woman was the Mother of Lightning. Since you have obtained this scripture, I shall now instruct you in its mysteries.\" When he had finished teaching, he summoned a messenger and gave instructions to the empty sky. This was my enlightenment under Master Wang’s guidance.\n\nA question was asked:\nWhen thunder is stirred and lightning aroused, what is the essential principle?\n\nThe answer:\nThunder and lightning are the commands of Heaven. They must not be rashly invoked unless the matter is urgent. It is like the Bureau of Military Affairs issuing an order to a regional office: those who receive it must act in accordance with the command. Yet people today, lacking innate predisposition and not having met a true master, pass down errors through hearsay. They follow diagrams to seek horses, heedless of the gravity of the matter. Some seek fame or reputation, others pursue profit or wealth, acting recklessly. They claim Heaven’s power as their own, yet when the moment comes, they accomplish nothing. Thunder possesses a precise mechanism; lightning, a decisive method. With a master’s guidance, response follows as echo to sound.\n\nA question was asked:\nAs for the messengers, where does their profound mystery lie?\n\nThe answer:\nThe transformations of thunder and lightning reach without limit. When the spirit moves, Heaven follows; when *qi* arrives, efficacy is near. Within the inner mystery of the unfathomable and indistinct, you enact the transformations of crashing thunder and surging power. From one comes two, from two comes three, from three come the ten thousand things. Manifesting wondrous function, it ascends to the azure vault and descends to the Yellow Springs—there is nowhere it cannot go. As the Chan school says: \"A thousand rivers hold water, a thousand rivers hold the moon; ten thousand miles without clouds, ten thousand miles of sky.\" This is precisely it.\n\nA question was asked:\nYour disciple has already received your instruction, which has dispelled my dullness. But what is the meaning of \"a thousand rivers hold water, a thousand rivers hold the moon; ten thousand miles without clouds, ten thousand miles of sky\"?\n\nThe answer:\nThis expounds the mystery of the messengers. Consider \"a thousand rivers hold water, a thousand rivers hold the moon.\" The original nature of humanity is like the bright moon—one point of perfect clarity, serene and unmoving, its numinous radiance pervading all. Yet people today know only the name of thunder and do not investigate its essence, the original spirit. Water is still water. The world sees only the moon’s form but not its wonder. Only when reflected in water does its nature become still. As for \"ten thousand miles without clouds, ten thousand miles of sky,\" the nature of humanity is fundamentally good, yet it is obscured by the seven emotions and six desires. If one can purify the heart and reduce desires, all obstacles vanish, and Heaven becomes visible everywhere.\n\nA question was asked:\nThe mystery within mystery has been clarified, and your guidance has dispelled my confusion. But how can one verify its efficacy in practice?\n\nThe answer:\nYour question is apt. When summoning thunder to act, first call the messenger to seek it. For thunder, lightning, wind, and rain are known only to the messenger. Thus, the method requires the messenger to serve as vanguard and sharp general.\n\nA question was asked:\nThe swiftness of the messengers is indeed divine. Yet when the ancestral palace issues forth, it can be employed in any direction. But in the vast emptiness, how can one verify the messenger’s arrival?\n\nThe answer:\nThe method requires stillness and silence. Knock the teeth, grasp the thunder tally, and summon according to the ritual. Silently recite the incantation, contain the light, and remain still. When the space between your brows itches, the messenger has arrived.\n\nA question was asked:\nFormerly, your disciple received your instruction and was taught the ritual method. While at the home of Chen Zishi in Yihuang, I saved a patient by silently summoning the messenger to slay the malevolent spirits. As I sat in meditation, a sudden gust of wind brushed against my feet. Later, I gave the talisman to the patient, who saw the messenger manifest in form. How does this verification differ from your teaching about the itching between the brows?\n\n---",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1236,
      "start_sentence": 0,
      "end_sentence": 52,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.612353801727295,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\冲虚通妙侍宸王先生家语.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "答曰：念头起於一点，报应验於一身。 头圆象天，足方象地。 眉间之验，使者从天门而来。 足下之验，使者从地户而至。 盖祟之形影声响，在於阳间，止於地矣。 此乃使者破地户搜祟而至，然动雷之验诀，於眉间以至五脏之内。 问曰：先生之说是矣。 弟子一日在家，给符救一产母，召将之间，心大冲冲，左目迭跳，发符遣使者，余心意不悦，意使者未至，是以如此。 次早产家谢云，产母见一青面鬼使，三目，眼中出火绕产母，身觉身如火热，未几产一死胎。 其意如何？ 答曰：此即明验，子何如是之愚？",
      "translated_text": "The answer:\nThe thought arises from a single point, and the response manifests in one’s own body. The head is round, symbolizing Heaven; the feet are square, symbolizing Earth. The verification at the space between the brows means the messenger arrives through the Gate of Heaven. The verification at the feet means the messenger comes through the Door of Earth. Now, the forms, shadows, sounds, and echoes of malevolent spirits exist in the yang realm and are confined to the earth. Thus, when the messenger breaks through the Door of Earth to search for the spirits, the sign of moving thunder is felt from the space between the brows to the depths of the five viscera.\n\nA question was asked:\nYour explanation is correct. One day, while at home, I gave a talisman to save a woman in childbirth. As I summoned the general, my heart surged violently, my left eye twitched repeatedly, and when I dispatched the talisman and sent the messenger, my mind was unsettled. I thought the messenger had not arrived, which was why this occurred. The next morning, the family came to express their gratitude, saying the woman had seen a green-faced ghostly messenger with three eyes, fire blazing from them, circling her. She felt her body burning as if on fire, and soon after, she delivered a stillborn child. What does this signify?\n\nThe answer:\nThis is clear verification—how can you be so foolish?",
      "overlap_context": "r has arrived.\n\nA question was asked:\nFormerly, your disciple received your instruction and was taught the ritual method. While at the home of Chen Zishi in Yihuang, I saved a patient by silently summoning the messenger to slay the malevolent spirits. As I sat in meditation, a sudden gust of wind brushed against my feet. Later, I gave the talisman to the patient, who saw the messenger manifest in form. How does this verification differ from your teaching about the itching between the brows?\n\n---",
      "start_char": 1236,
      "end_char": 1462,
      "start_sentence": 53,
      "end_sentence": 63,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.931025981903076,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\冲虚通妙侍宸王先生家语.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "心中冲冲，乃汝祖宫使者一出，便传於心，所以急也。 青面三目，乃汝神随符变化。 左目跳者，火归木乡。 所以生者，母所损厥子也。 此理照然，何必多疑多问？ 问曰：起雷之捷，不过使者，然法中程雍五将何用哉？ 答曰； 乃先天不坏之元神，即今所尊元始也。 程雍乃日月也，五将乃五星也，於人身使者乃元神也。 程雍乃元炁元精也，五脏之炁为五将也，在地使者为后土真皇。 程雍即酆都九垒，五将即岳也。 盖人居天地之中，借斗运转三才，此谓一窍通万窍通、一将灵百将灵是也。 大抵使者罡步，独称涌泉者何也？ 盖天生水，二三四五八官之间，天地水火雷风山泽，无所往而不备矣，枢机者，魁罡之位，斡旋天地造化者矣。 五将所以为使者，所役耳。 经云：通於一，万事毕。 内外之奥，实由此也。 问曰：枢机号日月，何以位居辰戌？ 答曰：不然，戌为日之枢，辰为月之机，阴阳关键实系乎此。 天地日月星辰运行，关键不通，天地之道闭矣。 学者不知关键，则雷霆何由而激？ 雨旸何由而祈？ 盖人身斗枢，一转万化随之。 经云：试将斗柄轻轻拨，泻下银河万斛珠。 即此妙也。 问曰：程雍既为日月，五将隶金木水火土，土使者如何斡运？ 答曰：使者意也。 又为中央大魁总监星也。",
      "translated_text": "Your heart surged violently, for the moment your ancestral palace’s messenger emerged, the transmission reached your heart—hence the urgency. The green-faced, three-eyed apparition was your spirit transformed by the talisman. The twitching of your left eye: fire returning to the realm of wood. Thus the living mother was spared, while her child was lost. This principle is as clear as daylight—why so much doubt and questioning?\n\nA question was asked:\nThe swiftness of summoning thunder lies solely with the messenger—then what purpose do the Five Generals of Cheng Yong serve in the method?\n\nThe answer:\nThey are the primordial, indestructible spirit of the Prior Heaven, the very Yuan Shi you now revere. Cheng Yong is the sun and moon; the Five Generals are the five planets. Within the human body, the messenger is the primordial spirit. Cheng Yong is the primordial qi and primordial essence; the qi of the five viscera becomes the Five Generals. On earth, the messenger is the True Sovereign of Later Soil. Cheng Yong corresponds to the Nine Ramparts of Fengdu; the Five Generals correspond to the Five Peaks. For humans dwell at the center of Heaven and Earth, borrowing the Dipper’s revolution to harmonize the Three Powers—this is what is meant by “one aperture opened, ten thousand apertures open; one general efficacious, a hundred generals efficacious.”\n\nIn general, why is the messenger’s *gang* pacing singled out as “bubbling spring”?\nWater is born of Heaven. Between the second, third, fourth, fifth, and eighth palaces, Heaven and Earth, water and fire, thunder and wind, mountains and marshes—nothing is not encompassed. The pivot and mechanism lie in the position of *kui* and *gang*, which revolve and transform the creative workings of Heaven and Earth. The Five Generals serve as the messengers’ agents.\n\nAs the scripture says: “Through unity, all things are accomplished.” The profound mysteries of inner and outer realms truly arise from this.\n\nA question was asked:\nThe pivot and mechanism are called sun and moon—why then do they reside in *chen* and *xu*?\n\nThe answer:\nNot so. *Xu* is the sun’s pivot; *chen* is the moon’s mechanism. The key to yin and yang truly lies here. If the pivot of Heaven and Earth, sun and moon, and stars fails to turn, the Dao of Heaven and Earth is blocked. If scholars do not know the pivot, how can thunder be aroused? How can rain and sunshine be invoked? Within the human body, the Dipper’s pivot turns, and ten thousand transformations follow. As the scripture says: “Gently nudge the Dipper’s handle—forth pours the Silver River by the myriad bushels.” Such is the marvel.\n\nA question was asked:\nIf Cheng Yong is the sun and moon, and the Five Generals govern metal, wood, water, fire, and earth, how does the earth messenger govern and revolve?\n\nThe answer:\nThe messenger is intent. It is also the Great *Kui* of the Center, the Star of the Grand Overseer.",
      "overlap_context": "n I dispatched the talisman and sent the messenger, my mind was unsettled. I thought the messenger had not arrived, which was why this occurred. The next morning, the family came to express their gratitude, saying the woman had seen a green-faced ghostly messenger with three eyes, fire blazing from them, circling her. She felt her body burning as if on fire, and soon after, she delivered a stillborn child. What does this signify?\n\nThe answer:\nThis is clear verification—how can you be so foolish?",
      "start_char": 1462,
      "end_char": 1951,
      "start_sentence": 64,
      "end_sentence": 91,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.276901960372925,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\冲虚通妙侍宸王先生家语.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "盖贪狼号为总监之星，使者禀此气而化生总监，即元始之真炁天枢一转。 何患天机不随？ 所以使者符用辛寅二讳者，盖有说也。 问曰：师之说详矣，而弟子尚未解答。 曰夫在天之斗随杓指建，一建之间有二炁六候，人能於一时一刻之中钻簇一岁之炁，运则一年酆凶雨旸之事，其数尽在是矣。 盖魁为斗之首，为天之枢，以此而推则三百八十四爻之变，动实基于此。 子宜随斗而行之，且四方二十八宿，各方自有木火土金水，斗居中央以齐七政，盖三十六之炁数，魁居其首而斡运焉。 问曰：师之说明矣。 何以今之学者，亦无修积，亦无实学。",
      "translated_text": "The *Tanlang* star is called the Star of the Grand Overseer; the messenger, receiving this qi, transforms and gives rise to the Grand Overseer—this is the pivot of the primordial True Qi of the Celestial Pole turning once. How could the celestial mechanism fail to follow? Thus, the messenger’s talisman employs the two taboo names *xin* and *yin*, for there is an explanation.\n\nA question was asked:\nYour explanation is thorough, Master, yet your disciple still does not understand.\n\nThe answer:\nIn Heaven, the Dipper follows the handle’s pointer to establish the lunar station. Within a single establishment, there are two qi and six seasonal divisions. If one can, in a single moment, gather the qi of an entire year, then when set in motion, all the affairs of that year—whether auspicious or ominous, rain or shine—are fully encompassed within it. The *Kui* is the Dipper’s head, the pivot of Heaven. Extending this principle, the 384 changing lines of the hexagrams truly originate here. You should follow the Dipper’s movement in your practice. Moreover, the twenty-eight constellations of the four directions each possess their own wood, fire, earth, metal, and water, while the Dipper resides at the center to harmonize the Seven Governors. Among the thirty-six qi, the *Kui* stands at the forefront, revolving them all.\n\nA question was asked:\nYour explanation is clear, Master. Yet why is it that today’s scholars, though they neither cultivate accumulation nor possess true learning...",
      "overlap_context": "in the human body, the Dipper’s pivot turns, and ten thousand transformations follow. As the scripture says: “Gently nudge the Dipper’s handle—forth pours the Silver River by the myriad bushels.” Such is the marvel.\n\nA question was asked:\nIf Cheng Yong is the sun and moon, and the Five Generals govern metal, wood, water, fire, and earth, how does the earth messenger govern and revolve?\n\nThe answer:\nThe messenger is intent. It is also the Great *Kui* of the Center, the Star of the Grand Overseer.",
      "start_char": 1951,
      "end_char": 2195,
      "start_sentence": 92,
      "end_sentence": 100,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.662068128585815,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\冲虚通妙侍宸王先生家语.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "偶然行持，亦得感应，此又何也？ 答曰：一则出於侥幸，二则斯人时运际遇偶然，符合取效一时。 子行吾法，端的须透内，用以决外应无疑。 雷神之不时，法诀一真，何施不可。 问曰：弟子见同坛游平二友，均是法也。 何以行事之时，十应六七，此机不可晓？ 答曰：游平二友道缘浅薄，法行未纯熟，疑信之心介乎方寸，以此故十应六七。 问曰：又如后学，明发坐遣，约定时日，以俟报应。 何以登坛之际，不合所符，其义又如何？ 答曰：坐遣者，不过雷神为符节。 今人有事，奏帝一说也，申师一说也，牒将一说也。 以至订期约，不能立定一时。 或以未申时，或以亥子时，故自为颠倒错乱，所以不能如期者此也。 约以申时则申，约以未时则未，譬如骊山之火约以一时。 因为不然，所以失信。 行雷法者，当痛思之。 问曰：或谓奏帝之说，有误行持，如何？ 答曰：奏帝之说，要能飞自己神以言奏则可，必其允否若止，凭笔墨待，师省类聚，奏呈之时，卒皆误也。 问曰：真王有便宜行事之教。 则不必奏矣。 答曰：虽有便宜行事，亦有两说。 大祟惑人魂命，孽蛟妄兴雷雨，损人害物，以及不当闻奏者，许令便宜行事。 若事涉天数，必当飞神入奏，请旨施行。 问曰：经中或有泥天机雷机者，此说如何？ 答曰：有之然随所用天机者，斗星旋转二十八宿之循，直三十六跃之激，薄二十四气之罡煞，相冲相射，方能激动雷霆，此天机也。 至如雷机者，乃掌中造化，寻神雷飞伏出没之所，看风云雷雨电所泊之宫，飞罡轮诀，役使雷神。 问曰：炼将之法，其要如何？ 答曰：将者，一炁也。 出吾之炁，以合天之炁。 一炁而生诸炁，盖人身所有浊炁也。 吸在天之清炁，混合既毕，必须炼之。 夫炼炁之炁，专凭运用五水五火之功。 盖雷不得受炼，其气不神也。 问曰：役雷电风雨之属，坐功之内，必须明验方可取效。 答曰：当於呼吸上运功夫，静定上验报应，云之出也。 其气蒸，雨之至也。 其溺急，雨之未至也。 其气炎，而膀胱之气急，电之动也。 其目痒眼光，忽然闪烁，雷之动也。 三田沥沥而响，五脏奖忽而呜。 行持之士，又当急心火以激之，涌动肾水以冲之，先闭五户内验五行，此其诀也。 问曰：弟子每见先生行持，狂风大作，雷电方至，何也？ 答曰：凝目闭气望巽方，手剔旋风罡猛，咽三转身，足剔风轮，过巽至酉出丑，其风大作矣。 盖雷无风不厉，雨无风不作，云无风不起，电无风不动。 第祈雨一节，止凭北风乱起，方觉雨至，乃至妙也。 问曰： 先生常在宫中，降雪之时乃炎天，何以如此？ 答曰：此造化乃老夫二十年所修，盖夏至阴生於内，以此汞虎交娠，乃颐指气，使之妙并不舛，离虚之玄也。 问曰：祈雪之妙，世以为难。 弟子谓冬凝寒，一冻即雪，而何以言其难也？ 答曰：冬至后一阳生造化之机肇於阳，人身阳气一泄，所以感召之非易耳。 法当运动心火，激动肾水，却猛运肺气生之，然后起风穴闭离气，以为酝酿。 问曰：杀伐之机实难的当。 答曰：何难之事，但能运自家之杀气，役天上之罡星，筹人问之虎射，三者既合神，威即震伐矣。 问曰：常见今人祈祷，每遇临夜，见电光闪烁，意於行坛之际必合符节，何以多误者何也？",
      "translated_text": "By chance they practice and also achieve resonance—how is this so?\nI answer: First, it is due to luck; second, such a person’s fate and circumstances happen to align, yielding temporary efficacy. If you practice my method, you must thoroughly penetrate the inner workings to decisively determine external responses without doubt. When the thunder deities are untimely, if the method and incantation are authentic, what cannot be achieved?\n\nA question was asked:\nI have seen two fellow practitioners, You and Ping, who use the same method. Why is it that when they perform rituals, only six or seven out of ten succeed—what is the mechanism behind this?\nI answer: The Dao affinity of You and Ping is shallow, their practice of the method is not yet refined, and their hearts waver between doubt and belief. Thus, only six or seven out of ten succeed.\n\nA question was asked:\nAs for my own practice, I sit in meditation at dawn, setting a fixed time to await the response. Why is it that when I ascend the altar, the outcome does not match the talisman’s intent—what is the reason for this?\nI answer: Sitting in meditation merely uses the thunder deities as a talismanic token. When people have matters to address, they may petition the Emperor in one way, report to the master in another, or dispatch the generals in yet another. Even when setting a time, they cannot fix it precisely—sometimes choosing the *wei* or *shen* hour, other times the *hai* or *zi* hour—thus causing confusion and disorder, which is why the response does not arrive as scheduled. If you set the *shen* hour, then adhere to *shen*; if you set the *wei* hour, then adhere to *wei*—like the fire of Mount Li, which was agreed to be lit at a specific time. If it is not done so, trust is lost. Those who practice thunder methods must deeply reflect on this.\n\nA question was asked:\nSome say that petitioning the Emperor may lead to errors in practice—how is this?\nI answer: Petitioning the Emperor is effective only if you can project your own spirit to make the report. If you merely rely on written words, waiting for the master to compile and submit the petition, errors will inevitably occur.\n\nA question was asked:\nThe True Kings have teachings on acting at one’s discretion—does this mean petitions are unnecessary?\nI answer: Even with discretionary action, there are two considerations. For major afflictions that disturb human souls and destinies, or when malevolent dragons recklessly stir thunderstorms, harming people and things, as well as matters that should not be reported, discretionary action is permitted. However, if the matter concerns heavenly decrees, you must project your spirit to petition and await the imperial decree before acting.\n\nA question was asked:\nSome texts mention \"celestial mechanisms\" and \"thunder mechanisms\"—what do these mean?\nI answer: Indeed, they exist. The \"celestial mechanism\" refers to the rotation of the Dipper’s stars, the cycle of the twenty-eight constellations, the surging of the thirty-six leaps, and the clashing of the twenty-four *qi*’s *gangsha*, where mutual opposition and alignment can stir thunder and lightning. As for the \"thunder mechanism,\" it is the creation within the palm, the domain where divine thunder rises, falls, appears, and vanishes—observing where wind, clouds, thunder, rain, and lightning gather, and employing the flying *gang* wheel incantations to command the thunder deities.\n\nA question was asked:\nWhat is the essential method for refining the generals?\nI answer: The generals are a single *qi*. You emit your own *qi* to merge with Heaven’s *qi*. From this single *qi*, all other *qi* arise—these are the turbid *qi* within the human body. You must absorb Heaven’s pure *qi* and blend them thoroughly before refining. Refining *qi* relies entirely on the workings of the five waters and five fires. Without refinement, the *qi* of thunder lacks divinity.\n\nA question was asked:\nWhen commanding thunder, lightning, wind, and rain, one must verify the effects during seated practice to achieve efficacy.\nI answer: You must cultivate the work in your breath and verify the response in stillness. When clouds emerge, their *qi* is steaming; when rain arrives, its moisture is urgent. Before rain comes, the *qi* is scorching, and the bladder’s *qi* is tense. When lightning stirs, the eyes itch, and their light suddenly flashes. When thunder stirs, the three fields drip with sound, and the five viscera roar in an instant. The practitioner must swiftly ignite the heart’s fire to excite it, surge the kidney’s water to propel it, and first seal the five senses to internally verify the five phases—this is the method.\n\nA question was asked:\nWhenever I see you, Master, perform the practice, a fierce wind arises, followed by thunder and lightning—why is this?\nI answer: Fix your gaze, hold your breath, and face the *xun* direction. With your hand, stir the *gang* of the whirlwind fiercely, swallow three times, turn your body, and kick the wind wheel with your foot—passing from *xun* to *you*, exiting at *chou*—and the wind will rage. Thunder is not fierce without wind, rain does not form without wind, clouds do not rise without wind, and lightning does not move without wind. As for praying for rain, it relies entirely on the chaotic rising of the north wind to signal rain’s arrival—this is the subtlest method.\n\nA question was asked:\nMaster, you often stay in the palace, yet during snowfall, it is scorching summer—how is this possible?\nI answer: This transformation is the result of twenty years of my cultivation. After the summer solstice, *yin* is born within, and through this, the mercury tiger conceives. It is the subtle alignment of *qi* through the movement of my fingers, flawlessly merging the mysteries of *li* and *xu*.\n\nA question was asked:\nPraying for snow is considered difficult in the world. I thought that in winter, when cold congeals, it immediately turns to snow—why is it said to be difficult?\nI answer: After the winter solstice, the *yang* of creation begins, and the mechanism originates from *yang*. When the *yang qi* of the human body is dispersed, it is not easy to summon snow. The method involves moving the heart’s fire to excite the kidney’s water, then fiercely circulating the lung’s *qi* to generate it. Afterward, you must stir the wind cave, seal the *li* *qi*, and allow it to ferment.\n\nA question was asked:\nThe mechanism of killing and subduing is truly difficult to master.\nI answer: What is difficult about it? Simply mobilize your own killing *qi*, command the *gang* stars of Heaven, and harness the tiger and archer of the human realm. When these three unite with the spirit, their power will shake and subdue.\n\nA question was asked:\nI often see people praying, and when night falls, they see flashes of lightning, assuming that during the altar ritual, it must align with the talisman’s intent. Yet why do most fail?\nI answer:",
      "overlap_context": "u should follow the Dipper’s movement in your practice. Moreover, the twenty-eight constellations of the four directions each possess their own wood, fire, earth, metal, and water, while the Dipper resides at the center to harmonize the Seven Governors. Among the thirty-six qi, the *Kui* stands at the forefront, revolving them all.\n\nA question was asked:\nYour explanation is clear, Master. Yet why is it that today’s scholars, though they neither cultivate accumulation nor possess true learning...",
      "start_char": 2195,
      "end_char": 3446,
      "start_sentence": 101,
      "end_sentence": 154,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.74774694442749,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\冲虚通妙侍宸王先生家语.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "答曰：无他，无实修耳。 不思某方电动，某方雷雨，某方晴明，何可以此为标的？ 所以自误者宜矣。 问曰：祈雨之法，门类最多，何以有是符无是应？ 答曰：祈雨之法，在夏为紧。 古先圣贤，春秋冬皆不祈雨。 孟夏月纯阴，主事阴，阳偶愆便至荒旱，所以立祈雨之法，以救禾稻尔。 今之学者，不知方法，徒咎符章之不验也。 问曰：七八月属秋，何以亦缺雨旸，此又何也？ 答曰：秋属金，夏之余火西流，以为难禁，况火之与金相克，偶值分野，当旱气运，不齐即乖舛矣。 问曰：若如此，又何以感动？ 答曰：法当默朝之法，以央有无之应验。 余昔入觐时，再遇火师曰：子行朝堂有重委，故来报汝，但今岁天数当示早灾，，非子之可以祈也。 遂叩火师，何以见教。 师曰：天下龙潭泉源，皆为玉帝封闭，虽有符法，其数未满，亦难祈也。 余再问师何以教我？ 曰：子此行，惟黄河不曾锁闭，惟宜檄使者，黄河借水苏旱而已。 余依训到京，朝廷果命祈雨。 余檄雷神，於黄河内借水三尺救旱，后京畿奏上，所降之雨皆泥水也。 以此见火师之言的也。 问曰：先生则有仙风道骨，於余特凡夫耳。 於先生则有火师奇遇，余他日倘有疑难将何恃哉？ 答曰：仙风道骨之说故是，然天人之接亦同。 子既无德感召师尊，则当入室端坐以验自己之造化足矣。 且如祈雨一节，天数如此，气数亦如此。 难验一身之机括，亦随法当看便溺之有无。 以舌拄上腭，咽津激动胆水。 盖胆为天一之水，至清至贵之物。 此水一动，激起膀胱之火。 火升水降，即天气下降地气上升之义也。 阴阳升降，雨泽调顺。 胆龙在膀胱之大渊，倒取水泽，应时便动，即雨之至。 若不作绵绵，若存以胆水激膀胱之火，便以溺通验，非惟无验，亦且贻笑也。 问曰：升降调燮之妙，固已妙矣。 但绵绵若存，何以取其效也？ 答曰：子依吾言，静坐端默三日，以试其验也。 问曰：谨授教归家，静坐三日，万念放下，一事不干。 坐满三日，再访座下。 师曰：子所受教，曾行之否？ 曰：敬此请教师前。 师曰：子之所坐之验，得何受用？ 曰：依训而行，不过身体轻松，情意清快而矣。 师曰：子如是之愚也，此即是矣。 初习之时，已觉如此，自此三日至九日，至二十七日，至八十一日，至一百二十日，至二百一十日，久久行之，日积月累，神气精自然混凝。 上可脱壳朝元，次可长生久视，又其次可以兴云致雨，役电鞭霆，济人利物，何所往而不可也。 问曰：且如致雨一节，何以发用绵绵若存之妙？ 答曰：昏昏默默之际，即如垫龙养道之时。 盖人能坐持真积力久，性天自澄，止水自定。 汞龙藏於其中，才感铅虎则阴阳调和。 祖气一发，即升大渊，身中之龙亦从而奋发。 以此感彼，欲雨之时，即可随念而滂沱矣。 第恐行持之际，不能存养，犹陆地生莲以茂缚空，岂不难哉。 问曰：天数高亢，虽持内修何以斡旋？ 答曰：数在天，固已定斡旋之念，又在临机应变。 如昔日未趋京时，郡治欲余祈雨。 未行持已前，郡家遍行祈祷不应。 一日静定，忽空中使者默报云：天数当旱，非法可治。 今郡近五十里有雷泽潭，在建昌秀源之地，此中雷神虽奉命封潭，於道法中亦能用力，宜以符命起之。",
      "translated_text": "I answer: There is no other reason—only a lack of true cultivation. They do not consider from which direction the lightning stirs, where the thunder and rain arise, or where the skies remain clear. How can they take such signs as their standard? Thus, their self-deception is only natural.\n\nA question was asked:\nThe methods of praying for rain are many and varied. Why do some talismans work while others fail to bring response?\nI answer:\nPraying for rain is most critical in summer. The ancient sages and worthies never prayed for rain in spring, autumn, or winter. In the fourth lunar month, pure *yin* prevails, and *yin* governs affairs. If *yang* errs even slightly, drought and famine follow. Thus, the method of praying for rain was established to save the rice and millet. Today’s scholars, ignorant of the proper method, merely blame the talismans for their inefficacy.\n\nA question was asked:\nThe seventh and eighth months belong to autumn. Why do they also suffer from lack of rain or excessive sun? What is the reason for this?\nI answer:\nAutumn corresponds to *metal*, while the residual fire of summer flows westward, making it difficult to restrain. Moreover, fire and metal clash. If by chance the celestial divisions align with a drought-inducing *qi* cycle, even slight imbalance leads to disorder.\n\nA question was asked:\nIf this is so, how can one effect change?\nI answer:\nThe method lies in the practice of silent audience, which mediates between presence and absence to produce verification. Long ago, when I entered the capital for an audience, I twice encountered the Fire Master, who said: “You have been entrusted with a grave commission in the imperial court, so I have come to inform you. This year, Heaven’s decree ordains drought—it is not something you can pray away.” I then bowed and asked the Fire Master for instruction. He replied: “All the dragon pools and springs under Heaven have been sealed by the Jade Emperor. Even with talismans and methods, if the allotted number is not fulfilled, prayer will be in vain.” I pressed further, asking what he would teach me. He said: “On this journey, only the Yellow River remains unsealed. You should dispatch a summons to its spirit, borrowing water from the Yellow River to relieve the drought.” I followed his instruction upon arriving in the capital, and the court indeed commanded me to pray for rain. I issued a decree to the Thunder God, borrowing three feet of water from the Yellow River to save the land. Later, the capital reported that the rain that fell was muddy water. Thus, the Fire Master’s words proved true.\n\nA question was asked:\nMaster, you possess the bearing of an immortal and the bones of a Daoist, while I am but a common man. You have had extraordinary encounters with the Fire Master—what will I rely upon when I face doubts in the future?\nI answer:\nThe notion of immortal bearing and Daoist bones is not unfounded, yet the connection between Heaven and humanity is the same for all. If you lack the virtue to summon a master, you should enter your chamber, sit upright, and test your own destiny. Take, for example, the matter of praying for rain: when Heaven’s decree and the *qi* cycle are thus, it is difficult to verify the mechanism within oneself. One must observe whether urine flows or not. Press the tongue against the upper palate, swallow saliva, and stir the water of the gallbladder. The gallbladder is the Water of the Celestial One, the purest and most noble substance. When this water stirs, it excites the fire of the bladder. Fire rises and water descends—this is the principle of Heaven’s *qi* descending and Earth’s *qi* ascending. When *yin* and *yang* ascend and descend in harmony, rain falls in due measure. The Dragon of the Gallbladder resides in the great abyss of the bladder. When it inverts to draw forth water, responding to the moment, rain arrives. If one does not maintain unbroken continuity—if one merely stirs the gallbladder’s water to excite the bladder’s fire and then relies on urine to verify the effect—there will not only be no result but also cause for ridicule.\n\nA question was asked:\nThe subtlety of harmonizing ascent and descent is indeed profound. But how does one achieve the effect of unbroken continuity?\nI answer:\nFollow my words: sit in stillness and silence for three days to test the verification.\n\nA question was asked:\nI respectfully received your teaching and returned home to sit in stillness for three days, releasing all thoughts and refraining from all affairs. After completing the three days, I returned to seek your instruction.\nThe master said:\nHave you practiced what you were taught?\nI replied:\nI humbly present myself before you to receive further teaching.\nThe master said:\nWhat benefit did you gain from your sitting?\nI replied:\nFollowing your instruction, I only felt my body light and at ease, my mind and emotions clear and refreshed.\nThe master said:\nHow foolish you are—this *is* the effect. At the beginning of practice, one already feels thus. From three days to nine, to twenty-seven, to eighty-one, to one hundred twenty, to two hundred ten days—with prolonged practice, day by day and month by month, spirit and *qi* naturally coalesce. At the highest level, one may shed the mortal form and ascend to the origin; next, one may attain longevity and enduring vision; and further still, one may summon clouds and rain, command lightning and thunder, benefiting people and all things. What is there that cannot be achieved?\n\nA question was asked:\nRegarding the method of summoning rain, how does one apply the subtlety of unbroken continuity?\nI answer:\nIn the state of profound stillness, it is like the time of nurturing the dragon and cultivating the Dao. If one can sit with true accumulation of effort over time, the nature of Heaven becomes clear, and the still water settles. The Mercury Dragon conceals itself within, and when the Lead Tiger responds, *yin* and *yang* harmonize. When the ancestral *qi* stirs, it ascends to the great abyss, and the dragon within the body also rouses. Through this resonance, when one wishes for rain, it can pour forth at the mere thought. Yet if, during practice, one fails to nurture and sustain it—like cultivating lotuses on dry land or binding the void—how can success not be difficult?\n\nA question was asked:\nHeaven’s decree is lofty and unyielding. Even with inner cultivation, how can one influence it?\nI answer:\nThe decree lies with Heaven, but the intention to influence it depends on responding to the moment with adaptability. Before my journey to the capital, the local administration asked me to pray for rain. Before I began my practice, they had already performed numerous prayers without result. One day, in deep stillness, a messenger from the void silently reported: “Heaven’s decree ordains drought—no method can alter it. However, fifty *li* from the prefecture lies the Thunder Marsh, in the land of Jianchang and Xiuyuan. Though the Thunder God there has been commanded to seal the marsh, within the Daoist method, he may still be moved to act. You should use a talisman to summon him.”",
      "overlap_context": "and subduing is truly difficult to master.\nI answer: What is difficult about it? Simply mobilize your own killing *qi*, command the *gang* stars of Heaven, and harness the tiger and archer of the human realm. When these three unite with the spirit, their power will shake and subdue.\n\nA question was asked:\nI often see people praying, and when night falls, they see flashes of lightning, assuming that during the altar ritual, it must align with the talisman’s intent. Yet why do most fail?\nI answer:",
      "start_char": 3446,
      "end_char": 4677,
      "start_sentence": 155,
      "end_sentence": 212,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.394035816192627,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\冲虚通妙侍宸王先生家语.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "余觉，遂以符命就，命使者追之。 再入坐，恍见一老子忽到坛上，以口吸盂中蔽太阳墨水一呷而去。 未几，天地晦冥，下微雨一霎而止。 觉不及，复旱。 后问使者，乃谓：老子者，不过所起龙神耳。 彼已违命出洞，所下一霎微雨，是坛上一呷浄水尔，不过为法中一报应。 於是，再遣章奏，飞告真王请旨，后得帝旨，降雨三日，方得复旱。 问曰：以师可以如是，且如今之法官道士，满前尽是，何以屡奏迭章不一，其为报应，并无效验，此又何也？ 答曰； 大抵奏章所上，径诣一处，不可繁冗。",
      "translated_text": "I awoke and immediately dispatched the talisman, commanding the messenger to pursue the matter. Returning to my seat, I vaguely saw an old master suddenly appear upon the altar. He drew a mouthful of ink—steeped in the essence of the sun—from the bowl and departed. Soon after, the sky and earth darkened, and a light rain fell for a brief moment before ceasing. Before I could react, the drought resumed.\n\nLater, I asked the messenger, who explained: “The old master was none other than the dragon spirit you had summoned. Though he had disobeyed the decree to emerge from his cave, the fleeting drizzle was merely the mouthful of pure water from the altar—a mere token of response within the method.”\n\nThereupon, I sent another memorial, flying it to the True King to petition for an imperial decree. The Son of Heaven’s edict was granted, and rain fell for three days before the drought returned.\n\nSomeone asked: “If a master such as yourself can achieve this, why then do the many ritual officers and Daoist priests of today—who fill every hall with their petitions—fail to produce any consistent response, despite their repeated memorials? What accounts for this?”\n\nI answered: “In general, the memorials they submit reach only a single destination and must not be overly elaborate.”",
      "overlap_context": " pray for rain. Before I began my practice, they had already performed numerous prayers without result. One day, in deep stillness, a messenger from the void silently reported: “Heaven’s decree ordains drought—no method can alter it. However, fifty *li* from the prefecture lies the Thunder Marsh, in the land of Jianchang and Xiuyuan. Though the Thunder God there has been commanded to seal the marsh, within the Daoist method, he may still be moved to act. You should use a talisman to summon him.”",
      "start_char": 4677,
      "end_char": 4897,
      "start_sentence": 213,
      "end_sentence": 222,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.364189386367798,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\冲虚通妙侍宸王先生家语.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "且如今人有事，便至登闻鼓院。 上以天数而示旱，汝以私意而妄奏，必至行下台部递至州县，究竟如何，方为施行。 若待上命，竟於是日而降雨，岂不悮哉。 是以火师教余飞神谒帝之道，所以祈雨一事，隶渌波天主治之，单单只奏天主，请恩转告玉帝，得旨竟下后土真宫，开潭放水以救焦枯。 问曰：雷震百里，何以不能遍及以至甲里有，乙里无，丙里无，至于丁里滂沱而复旱也。 答曰； 行持之时，先檄当坊里社迎接，绿为方里人民至诚，加以里社迎接，奏报其雨必骤。 若此方人民，造恶稔成旱劫，央无涓滴，社令亦不迎接。 此理譬如阳间遣官，到所在优恤，州邑如意则优恤必至，若吏牧不职，亦不过丈具尔。 问曰：上古宗师，以祈晴难於祈雨，今行此法果如何哉？ 答曰：造化则不过翻覆内玄，造化雨潦浸淫，亦有数说。 一则节候气数，二则蛟蜃孽龙妄兴云雨，三则调燮者失职，以至水潦直旬。 所以如此，不可一槩论也。 问曰：如师见教，其法当如何？ 答曰； 身中之验，极为紧切。",
      "translated_text": "Moreover, when people today have matters to address, they rush to the Drum of Petition. The heavens manifest drought through celestial reckoning, yet you submit memorials out of private whim—these must be relayed through the Censorate and transmitted down to prefectures and counties before any action is taken. By the time the imperial command arrives, would not the rain on that very day have been in vain? Thus, the Fire Master taught me the method of dispatching spirits to petition the Emperor on High. For the matter of praying for rain, it falls under the jurisdiction of the Heavenly Lord of Green Waves. One need only memorialize the Heavenly Lord, beseeching him to relay the plea to the Jade Emperor. Once the decree is granted, it descends to the True Palace of Earth, where the depths are opened to release water and rescue the withered land.\n\nSomeone asked: “Thunder shakes the earth for a hundred *li*—why then does it not extend everywhere, so that one district may receive rain while another does not, a third remains dry, and a fourth is drenched only to return to drought?”\n\nI answered: “When performing the ritual, first issue a summons to the local spirits of the ward and village to receive the rain. If the people of that square *li* are sincere and the village spirits come forth to welcome it, the memorialized rain will surely fall in torrents. But if the people of that district have accumulated evil to the point of drought and calamity, not a drop will descend, nor will the village spirits come to receive it. This principle is like dispatching an official in the mortal realm to bestow relief upon a locality: if the prefecture and county are well-governed, the relief will surely arrive; if the magistrates are derelict in duty, it will amount to nothing more than empty formalities.”\n\nSomeone asked: “The ancient masters held that praying for clear skies was more difficult than praying for rain—how does this method fare in practice?”\n\nI answered: “The workings of creation are but the turning of the mysterious within. When rain and floods linger, there are several explanations: first, the seasonal qi and celestial reckoning; second, the reckless stirring of clouds and rain by flood dragons and mirage-serpents; third, the failure of those responsible for harmonizing the elements, leading to prolonged deluges. Thus, such matters cannot be discussed in sweeping terms.”\n\nSomeone asked: “As you instruct, what is the proper method?”\n\nI answered: “The verification within one’s own body is of the utmost urgency.”",
      "overlap_context": "perial decree. The Son of Heaven’s edict was granted, and rain fell for three days before the drought returned.\n\nSomeone asked: “If a master such as yourself can achieve this, why then do the many ritual officers and Daoist priests of today—who fill every hall with their petitions—fail to produce any consistent response, despite their repeated memorials? What accounts for this?”\n\nI answered: “In general, the memorials they submit reach only a single destination and must not be overly elaborate.”",
      "start_char": 4897,
      "end_char": 5299,
      "start_sentence": 223,
      "end_sentence": 238,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.045689344406128,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\冲虚通妙侍宸王先生家语.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "当从戊己运转一番，使元气一周再暮，后而静定，看内炼如何。 如是觉而有报，则心火上炎，胆水沥下，遍身烦蒸，喉中微痒，则天道必晴霁矣。 问曰：身中之应固已知矣。 然干气数燮理失职，或潦星直旬，此又何以知之矣？ 答曰：燮调者，上至宰相，下至守令，观其所治之政，所行之事，即可见也。 昔闻匹妇衔冤，六月飞霜，一夫有屈，水潦九年。 以此推之，皆可见矣。 至於水潦直旬，当遣皇甫镢天以缚之，蛟蜃以法律治之。 问曰：蛟蜃兴风致雨，何以亦能如是之淫浸？ 法家以书篆符章，告行符檄，千门万艺，不能役雷神便兴云雨。 何以此等，即能如是？ 答曰蛟蜃藏於劣深山之中，亦有社令。 忠义之士居民失祭杞，便於乡坊兴起云雨，损人田畴，害人禾稼，法当遣命魔钱大将军以戮之。 问曰：内验外治，固已闻之。 但行持法度，其要如何？ 答曰：祈晴之法，当於火煞方上建坛，立治安卓召雷，行事先开云卷雾，起火穴塞雨穴而矣。 问曰：开云卷雾，起火穴塞雨穴，其法如何？ 答曰：开云卷雾於内玄，皆敛而归墓。 闭气三七息，略咽津起火穴。 以双手握固，仰面猛呼二七呵，乃起火穴也。 雨则闭气，以舌拄上腭，时咽津三口，直下丹田。 问曰：内用固如此，外用如何？ 答曰：其法於日干字上起内用生将，於日家地支字上起外将，克到南方即住。 又看月皇是何五行，如日皇克星，便可用事，但以五行生克验之。 师曰：如前子所问余，皆切於事而应於人之妙，子宜依吾法度而行之。 所有符中之奥，法中之妙，皆尽已矣。 但精心而修，端意而行，百发百中，无施不可，真所谓法海之骊珠也。 言讫，复以二十八字为吾婿，他日嘱仲和书付悔隐袁庭植。 吾法元来不妄传，信知道法妙玄玄。 君家自是神仙种，管取儿孙代代贤。 法用 混沌鸿蒙未判，无年无月无时，但凭消息报君知，便是人间冬至。 坤虚通妙侍宸王先生家话竟",
      "translated_text": "Begin by circulating through the cycles of wu and ji, allowing the primordial qi to complete a full revolution and return to dusk. Then, settle into stillness and observe the inner alchemy. If, upon perception, there comes a response—where the heart-fire flames upward, the gall-water trickles downward, the whole body steams with vexing heat, and the throat itches slightly—then the celestial Dao must surely bring clear skies.\n\nSomeone asked: “The signs within the body are now understood. Yet when the celestial reckoning is disrupted or the harmonizing officials fail in their duty, or when the deluge stars linger for ten-day periods, how can one discern this?”\n\nI answered: “Those who harmonize and regulate—from the highest ministers to the local magistrates—are known by the governance they administer and the deeds they perform. Of old, it was said that when a wronged woman cried out, frost fell in the sixth month; when a single man suffered injustice, floods lasted nine years. By this reasoning, all becomes clear. As for deluges that persist for ten-day periods, dispatch Huangfu Kui of Heaven to bind them, and apply the law to restrain the flood dragons and mirage-serpents.”\n\nSomeone asked: “Dragons and mirages stir winds and summon rains—how can they cause such prolonged inundations? The schools of ritual employ talismanic scripts, written charms, and proclamations, with a thousand methods and ten thousand arts, yet cannot command the thunder gods to rouse clouds and rain. Why, then, can these creatures do so?”\n\nI answered: “Dragons and mirages dwell in the hidden depths of mountains, where they too have their local deities. When loyal and righteous men among the people neglect their sacrifices, these beings rise in the villages and hamlets, stirring clouds and rain to ruin fields and harm crops. By law, they should be dispatched to the Demon-Quelling General Qian for execution.”\n\nSomeone asked: “The inner verification and outer governance have been made clear. Yet in practicing the ritual methods, what is the essential point?”\n\nI answered: “For the method of praying for clear skies, establish an altar in the direction of the Fire Killer, set up the altar of governance, summon the thunder, and proceed. First, open the clouds and roll back the mists; then, ignite the fire cavern and seal the rain cavern.”\n\nSomeone asked: “How does one open the clouds and roll back the mists, ignite the fire cavern, and seal the rain cavern?”\n\nI answered: “To open the clouds and roll back the mists within the mysterious, gather all and return them to the tomb. Hold the breath for twenty-one cycles, briefly swallow the saliva, and ignite the fire cavern. Clench both fists tightly, tilt the face upward, and exhale forcefully fourteen times—this is how the fire cavern is ignited. For rain, hold the breath, press the tongue against the upper palate, swallow the saliva three times, and direct it straight to the cinnabar field.”\n\nSomeone asked: “The inner method is thus. What of the outer method?”\n\nI answered: “The method begins by selecting the inner general from the day’s heavenly stem and the outer general from the earthly branch of the day. When they overcome the southern direction, halt. Then observe the monthly sovereign’s element: if the daily sovereign overcomes the star, the ritual may proceed. Simply apply the mutual generation and overcoming of the five phases to verify it.”\n\nI said: “All that you have asked, my disciple, is essential to practice and wondrous in its resonance with humanity. You should follow my methods and perform them accordingly. All the mysteries within the talismans and the subtleties of the rituals have been fully revealed. But refine your heart in cultivation, conduct yourself with upright intention, and every action will strike true—nothing will be beyond your reach. Truly, this is the black pearl of the ocean of methods.”\n\nWith these words, I composed twenty-eight characters for my son-in-law, to be inscribed later by Zhonghe and entrusted to Huiyin Yuan Tingzhi:\n\n*My methods were never recklessly transmitted,\nFor I know the Dao’s law is wondrously profound.\nYour family is of the immortal seed—\nEnsure your descendants, generation upon generation, are worthy.*\n\n**Method:**\nBefore the separation of primordial chaos,\nWithout year, month, or hour,\nRely only on the signs to inform you—\nThis is the winter solstice of the human realm.\n\nThe discourse of Master Kunxu Tongmiao, Attendant of the Celestial King, concludes here.",
      "overlap_context": "in. When rain and floods linger, there are several explanations: first, the seasonal qi and celestial reckoning; second, the reckless stirring of clouds and rain by flood dragons and mirage-serpents; third, the failure of those responsible for harmonizing the elements, leading to prolonged deluges. Thus, such matters cannot be discussed in sweeping terms.”\n\nSomeone asked: “As you instruct, what is the proper method?”\n\nI answered: “The verification within one’s own body is of the utmost urgency.”",
      "start_char": 5299,
      "end_char": 6054,
      "start_sentence": 239,
      "end_sentence": 271,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.152164459228516,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\冲虚通妙侍宸王先生家语.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}