{
  "source_id": "列仙传",
  "source_file": "chunked_daozang\\列仙传.json",
  "total_chunks": 29,
  "total_original_chars": 12686,
  "total_translated_chars": 73498,
  "total_translation_time": 393.97802209854126,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
    "category": "记传类"
  },
  "full_translation": "**Records of the Perfected Immortals**\n*Category: Biographical Records, Cavern of Perfection Division*\n\n**Title:** *Traditions of the Immortals*\nTwo fascicles. Originally attributed to Liu Xiang, Han Court Gentleman for Splendid Happiness.\n\n**Source of Base Text:** *Daoist Canon of the Zhengtong Era*, *Biographical Records* section of the *Cavern of Perfection Division*.\n**Collated with:** *Siku Quanshu* edition.\n\n---\n\n**Traditions of the Immortals, Fascicle One**\nBy Liu Xiang, Han Court Gentleman for Splendid Happiness\n\n**Chisongzi**\nChisongzi was the Rain Master in the time of Shennong. He ingested *shuiyu* (water jade) and taught its use to Shennong. He could enter fire and burn himself unharmed. Often he ascended Kunlun Mountain, dwelling in the stone chamber of the Queen Mother of the West, riding the winds and rains as they rose and fell. The youngest daughter of the Flame Emperor pursued him and, attaining immortality, departed with him. By the time of Gao Xin, he again served as Rain Master. The Rain Masters of today trace their origin to him.\n\n*O so distant, Chisongzi!*\n*O so ethereal, the maiden!*\nHand in hand they soared in flight,\nsuddenly aloft as one.\nThey cast themselves upon the long winds,\nin an instant winging to the Dark Garden.\nProfoundly attuned to *xun* and *kan* (wind and water),\nthey set the model for the office of Rain Master.\n\n**Ning Fengzi**\nNing Fengzi lived in the time of the Yellow Emperor. The age transmitted that he served as the Yellow Emperor’s Pottery Master. A man once passed by and, tending his kiln fires, could emit smoke of five colors. Over time, he taught this art to Fengzi. Fengzi amassed fire and burned himself, ascending and descending with the smoke and qi. When his ashes were examined, his bones remained intact. The people of that time buried him together on Mount Ning in the north, and so he was called Ning Fengzi.\n\n*Wondrous indeed, Fengzi,*\n*marvelously endowed by nature!*\nHis essence refined in the great furnace,\nhis qi flowing freely in five-hued smoke.\nHis bones left among the ashes,\nentombed on tranquil Mount Ning.\nMen beheld his traces,\nbut who could fathom his mysteries?\n\n**Ma Shihuang**\n\n**Ma Shihuang**\n\nMa Shihuang was a horse physician in the time of the Yellow Emperor. He understood the living and dying signs in a horse’s form, and whenever he treated them, they invariably recovered. Later, a dragon descended before him, ears drooping and mouth agape. Shihuang said, “This dragon is ill and knows I can heal it.” He then stitched its lower lip to its mouth and administered a decoction of licorice, whereupon it recovered. Thereafter, dragons with ailments would often emerge from the waves to seek his treatment. One day, a dragon bore Shihuang away upon its back.\n\n*Master Shihuang tended horses,*\n*never a flawed steed remained.*\n*His skill moved even dragons,*\n*his art spanned all creatures.*\n*In gratitude for his virtue,*\n*they bore him aloft with bridle in jaws.*\n*Soaring through the celestial river,*\n*he left behind only his legacy.*\n\n**Chi Jiang Ziyu**\n\nChi Jiang Ziyu was a man of the Yellow Emperor’s time. He ate no grains but subsisted on the flowers of a hundred herbs. By the reign of Emperor Yao, he worked as a carpenter, able to ascend and descend with the wind and rain. Often in the marketplace, he sold fishing lines, and so was also called *Father of the Line*.\n\n*The common folk live on grain,*\n*who enjoys such distant blessing?*\n*Ziyu transcended the world,*\n*feasting on blossoms, drinking dew.*\n*He entrusted himself to wind and rain,*\n*his steps light and free.*\n*He could wander the clouds,*\n*and cross the bounds of life.*\n\n**The Yellow Emperor**\n\nThe Yellow Emperor was styled Xuanyuan. He could summon the hundred spirits and command them at court. Though young, he could speak; though sagely, he foresaw all things, knowing the principles of creation. He called himself *Master of the Clouds* and bore the form of a dragon. He chose his own day of departure and took leave of his ministers. When he died, he was buried at Mount Qiao. The mountain collapsed, and his coffin was found empty, save for his sword and cap.\n\nThe *Book of Transcendents* states: The Yellow Emperor mined copper from Mount Shou and cast a tripod beneath Mount Jing. When the tripod was completed, a dragon descended with its whiskers trailing to welcome the Emperor, who then ascended to heaven. His ministers and officials all grasped the dragon’s whiskers and followed, clambering upward. The Emperor’s bow and the dragon’s whiskers snapped, and the bow fell. The ministers could not follow and, gazing up, wailed in sorrow. Thus, the place was later called *Tripod Lake*, and the bow was named *Crow’s Wail*.\n\n*Profound and divine,*\n*how vast the Emperor’s majesty!*\n*He governed the ten thousand things,*\n*and his name crowned a hundred kings.*\n\nThe Way transformed the Six Directions, its reckoning boundless and without limit. Though buried in semblance at Mount Qiao, he transcended to ascend the azure heavens.\n\n**Juequan**\nJuequan was a gatherer of herbs on Mount Huai. He favored eating pine seeds. His body grew hair several inches long, and his eyes became square. He could fly, outrunning galloping horses. He once gifted pine seeds to Emperor Yao, who had no time to consume them. These pines were the *jian* pine. Those of his time who partook of them all lived to two or three hundred years. Juequan, nourished by pine, moved with ease, his gaze sharp and square. His feet trod upon simurghs and phoenixes, his steps swift as soaring wine. He bestowed this divine recipe at Yao’s gate, a gift of this wondrous method. Those of perfect nature may decline it, but those of middling wisdom would do well to receive it.\n\n**Master Rongcheng**\nMaster Rongcheng claimed to be the teacher of the Yellow Emperor and was seen by King Mu of Zhou. He excelled in the arts of supplementation and guiding, drawing essence from the Mysterious Female. His essential teaching was that the Valley Spirit does not die—those who guard life and nurture qi. His white hair turned black again, and fallen teeth regrew, matters in which he was akin to Laozi. Some also say he was Laozi’s teacher. Diligent was Master Rongcheng, refining qi to achieve suppleness. Having attained the One in ancient times, he wandered alone, his light concealed. The Dao pierced the Yellow Court, and Bo Yang looked up to him as a peer. The gate of the Mysterious Female—this may well be sought.\n\n**Fanghui**\nFanghui was a recluse of Yao’s time. Yao summoned him to serve as a gatekeeper. He refined and consumed mica, also sharing it with the common folk who were ill. He concealed himself in the Five Oak Mountains. In the late reign of Xia Qi, he became a palace attendant. Once seized by bandits and shut in a chamber, he was pressed to impart the Dao. Fanghui transformed and escaped, then sealed the door with his own hand. The people of the time said: \"With a single pellet of Fanghui’s mud, one could seal a door forever unopened.\" Fanghui, his life preserved, hid himself among the Five Oaks. Chewing mica blossoms, his heart dwelled in emptiness. Though shut in a secluded chamber, he unbarred its heavy gates himself. The seal he pressed remained unbroken, never to fall.\n\n**Laozi**\nLaozi’s surname was Li, his given name Er, and his courtesy name Boyang. He was a native of Chen. Born in the Yin dynasty, he served as the Archivist beneath the Zhou pillars. He cherished the nurturing of essence and qi, valuing reception over bestowal.\n\nHe was later appointed Keeper of the Archives, holding the post for over eighty years—*Records of the Grand Historian* states over two hundred. At the time, he was known as a reclusive gentleman, posthumously titled \"the Wise.\" When Confucius journeyed to Zhou, he met Laozi and, recognizing him as a sage, took him as his teacher.\n\nLater, as the virtue of Zhou declined, Laozi departed in a carriage drawn by a green ox. Entering the land of Da Qin, he passed through the Western Pass, where the magistrate Yin Xi awaited and welcomed him. Knowing him to be a perfected one, Yin Xi pressed him to write a book, and so Laozi composed the *Dao De Jing* in two scrolls, upper and lower.\n\nLaozi embodied non-action, yet nothing lay beyond his action. The Dao unifies life and death, its traces entering the numinous and wondrous. Stopping the senses and turning the inner mirror, he merged with the obscure, transcending all bounds. His virtue harmonized with the primordial qi, his lifespan matching the Two Modes.\n\n**Magistrate Yin Xi**\nMagistrate Yin Xi of the Pass was a grandee of Zhou. Skilled in esoteric learning, he constantly refined his essence and consumed the flower of vitality, cultivating hidden virtue and practicing self-cultivation, unknown to his contemporaries. When Laozi journeyed west, Yin Xi first saw his aura of darkness and knew a perfected one would pass through. He sought him out and intercepted him, and indeed, it was Laozi. Laozi, recognizing his extraordinary nature, wrote a book and transmitted it to him. Later, they traveled together beyond the Flowing Sands, transforming the Hu barbarians—some say with *jujube seeds*—and none knew where they ultimately vanished.\n\nYin Xi also wrote nine chapters himself, titled *The Master of the Pass*. Yin Xi guarded the pass, embracing virtue as his duty. He rinsed his mouth with the sun’s radiance, gazing upward to contemplate the profound measure. Awaiting the qi of the perfected one, he alone awakened. Together they crossed the Flowing Sands, attaining the same wondrous end.\n\n**Master Juan**\nMaster Juan was a native of Qi. He favored consuming wood, absorbing its essence. After three hundred years, he appeared in Qi and composed the *Canon of Heaven and Man* in forty-eight chapters. Later, while fishing at Lotus Marsh, he caught a carp whose belly bore a talisman. He withdrew to Rock Mountain, where he could summon wind and rain. He received the Nine Immortals’ Method from Boyang.\n\nThe Prince of Huainan, Liu An, obtained his writings in his youth but could not fathom their meaning. His three-chapter *Zither Heart* was well-ordered.\n\nJuan the Elder consumed wood, enjoying a distant span of years. Once the Nine Immortals’ Method was transmitted, the Three Powers were set in order. The red carp delivered the talisman, and he commanded wind and clouds. Striking the zither in secluded cliffs, his lofty abode stood afar.\n\n**Lü Shang**\nLü Shang was a native of Jizhou.\n\nBorn with inner wisdom, he foresaw survival and ruin. To escape the chaos of King Zhou, he concealed himself in the eastern lands of Liaodong for forty years. Journeying west to Zhou, he hid in the Southern Mountains, fishing at Pan Creek for three years without catching a single fish. Those around him all said, \"You should stop.\" Lü Shang replied, \"This is not something you understand.\" Soon after, he indeed found the *Military Talisman* within a fish’s belly. King Wen dreamed of a sage and, hearing of Lü Shang, carried him back in his chariot. When King Wu later campaigned against Zhou, Lü Shang composed over a hundred chapters of *Secret Strategies*. He consumed灵芝 and earth marrow, living fully two hundred years before passing away. When trouble arose, he was not buried; later, his son Lü Ji interred him, but no body was found—only six chapters of the *Jade Talisman* remained in the coffin.\n\nLü Shang concealed himself in fishing, auspiciously obtaining the scaled talisman. Through a dream, he met the Lord of the West, riding together into service. His profound strategies aided the age, his body refined by sacred herbs. Praised through distant generations, how splendid the Heavenly Man!\n\n**Xiaofu**\nXiaofu was a native of Jizhou. In his youth, he mended shoes in the western Zhou marketplace for decades, unknown to others. Later, people marveled at his agelessness, and the curious sought his arts, but none succeeded. Only Liang Mu obtained his method for making fire. As he ascended the Three Bright Peaks to bid Liang Mu farewell, he arrayed dozens of fires and rose into the heavens. The people of the western towns widely worshipped him.\n\nXiaofu preserved his form, his years neither waning nor advancing. Liang Mu encountered him, their meeting transcending the void. Crimson flames spread their radiance, purple mist formed a canopy. Gazing upward, he ascended into the clouds, leaving worldly splendor behind.\n\n**Shimen**\nShimen was a disciple of Xiaofu. He, too, could command fire and consumed peach and plum blossoms. He served as the dragon master for Xia Kongjia. When Kongjia failed to heed his will, he killed and buried him in the wild. The next day, wind and rain came to greet him, and when it ceased, the mountain’s trees were all scorched. Kongjia offered sacrifices and prayed, but upon returning, he died on the road.\n\nShimen wielded fire, its might blazing and fierce. He reared dragons in secret, concealing his numinous wisdom. The Xia king oppressed him, his spirit enduring though his form perished. After wind and rain descended, he departed in solemn ascent.\n\n**Wu Guang**\nWu Guang was a man of the Xia era. His ears measured seven inches long. He loved the zither and consumed cattail and leek roots. When Tang of Yin was about to campaign against Zhou, he consulted Wu Guang. Guang said, \"This is not my affair.\" Tang asked, \"Who is suitable?\" He replied, \"I do not know.\" Tang said, \"What of Yi Yin?\" Guang answered, \"He is strong and endures disgrace—I know nothing beyond that.\" After Tang conquered Jie, he offered the realm to Guang, saying, \"The wise plan it, the martial achieve it, the benevolent dwell in it—this is the ancient Way. Why do you not accept it?\" He begged to serve as Guang’s minister.\n\nWu Guang declined, saying: \"To depose a ruler is not righteous; to kill men is not benevolent; to let others face peril while I enjoy the gains is not upright. I have heard that one who is not righteous does not accept its emoluments, and in an age without the Way, one does not tread its ranks—would I die for exalting myself? I cannot bear to remain in sight for long.\" Thereupon he carried a stone and drowned himself in the Liao River, then concealed himself. Over four hundred years later, he reappeared in the time of Wu Ding. Wu Ding wished to appoint him as minister, but he refused. Wu Ding sent a carriage to press him, yet without proper ritual, so Guang fled to Mount Fuliang. Later he wandered to Mount Shangfu. Wu Guang cultivated benevolence, consumed herbs to nurture his true nature, roamed obscurely beyond the world, and walked alone in constant equilibrium. Though Wu Ding was noble, Guang debated rank and would not serve. Carrying a stone to sink himself, he made his body as nothing.\n\n**Qiu Sheng**\nQiu Sheng was a man of unknown origin. In the time of Tang of Yin, he served as Minister of Wood. For over thirty years, he grew ever more vigorous, and all knew him as an extraordinary man, revering and following him as their teacher. He often ate pine resin and, on the northern mountain of Shixiang, built his own stone chamber. By the time of King Wu of Zhou, the king visited his chamber and made offerings to him. How wondrous was Qiu Sheng—his course could not be fathomed.\n\nTo cultivate the self and serve the lord, he grew stronger with age. His countenance shone bright, his virtue and magnanimity ever serene. King Wu made offerings to him upon the northern mountain.\n\n**Peng Zu**\nPeng Zu was a grandee of Yin. His surname was Qian, given name Keng, grandson of Emperor Zhuanxu and middle son of Lu Zhong. From the Xia to the end of Yin, he lived over eight hundred years. He often consumed cassia and lingzhi, skilled in guiding and pulling to circulate qi. In Liyang stood Peng Zu’s immortal chamber, where prayers for wind and rain in former times were never left unanswered. Two tigers were always by the shrine’s side; when the rites concluded, tiger tracks would appear upon the ground. Later, he ascended as an immortal and departed.\n\nHow vast the great immortal—none but Peng Zu in his time. His Dao ever renewed with transformation, enduring through the ages. Hidden in the mysterious chamber, his spirit manifested in wind and rain. When the two tigers roared, none dared mock or slight him.\n\n**Qiong Shu**\nQiong Shu was a scribe of Zhou. He could circulate qi to refine his form, boiling stone marrow to consume it, calling it \"stone stalactite.\" Living for several hundred years, he came and went within Mount Tai Shi, where an outer stone stood like a pillow. The eight delicacies shorten life, the five minerals prolong it. Qiong Shu attained this, refining marrow and ingesting essence. While others lived a hundred years, he walked with light steps. Resting in the central prison, strolling through immortal courts.\n\n**Jie Zitui**\nJie Zitui, surnamed Wang, given name Guang, was a man of Jin. He lived in reclusion, unknown. Delighting in Zhao Chengzi, he traveled with him.\n\nA yellow sparrow once alighted upon his gate, and Duke Wen of Jin, Chong'er, found it strange. Jie Zitui accompanied him into exile abroad for over a decade, enduring hardship without complaint. When they returned to Mount Jie, Bo Zichang came at dawn to call Zitui, saying, \"You may depart now.\" Zitui declined, taking his mother into the mountains, where he roamed with Bo Zichang. Later, Duke Wen sent thousands bearing jade and silk to honor him, yet he did not emerge. Thirty years after, he appeared on the shores of the Eastern Sea, selling fans to the king’s subjects. Decades later still, none knew his whereabouts.\n\nWang Guang lived in silence, his years long and distant. He aided the rise of a hegemon, dwelling among profound friends. Zitui’s toil was in service and yielding—what did he seek, what did he take? He followed his shadow to Mount Jie, wandering the eastern shores.\n\n**Ma Dan**\nMa Dan was a man of Jin from Geng. During the reign of Marquis Wen, he served as a grandee. By the time of Duke Xian, he again held the post of chief of the military secretariat. When Duke Xian of Jin destroyed Geng and killed the reverent crown prince, Dan departed. By the era of Zhao Xuanzi, he rode a comfortable carriage into the Jin capital, paying respects to the grandees. Lord Ling wished to employ him, pressing him without propriety. A fierce wind tore the roofs from houses, and Dan entered the whirlwind and vanished. The people of the north revered and sacrificed to him.\n\nMa Dan served Jin through its rises and falls. He attended Marquis Wen and left Duke Xian, his fame enduring beyond his time. When the net of fate was cast, he followed propriety into the swift wind. Alone he ascended, vanishing into the dark palace, his traces gone.\n\n**Ping Changsheng**\nPing Changsheng of Gucheng Village was of unknown origin. He died and revived many times, which people found unbelievable. Later, a great flood arose, claiming countless lives, yet Ping stood atop the broken gate of the mountain, shouting, \"Ping Changsheng is here!\" He declared that the rain and flood would cease in five days—and so it did. When the waters receded, those who climbed the mountain to offer sacrifices found only Ping’s clothes, belt, and sandals. Decades later, he reappeared as a gatekeeper in Huayin. The marvel of Gucheng, enigmatic and free, passed between life and death, his essence unchanged. His transformations transcended form; what did he care for rank or station? Briefly descending to the dust, he ultimately soared into the clouded chambers.\n\n**Lu Tong**\nLu Tong was the famed \"Madman of Chu,\" Jie Yu. He cultivated life, eating the fruit of the *qilumu* tree and the seeds of turnips. He wandered famous mountains, dwelling on the peaks of Mount Emei in Shu, where he was seen for generations. After hundreds of years, he departed.\n\nJie Yu delighted in the Dao, nurturing his nature in hidden radiance. He satirized Confucius, discoursing on the decline of the phoenix.\n\nInhaling qi to harmonize, preserving the heart in subtlety,\nHe strode the sacred peaks, his long whistle echoing on Mount Emei.\n\n**Ge You**\nGe You was a Qiang tribesman. During the reign of King Cheng of Zhou, he carved wooden sheep to sell. One day, he mounted a sheep and entered western Shu. The kings, marquises, and nobles of Shu pursued him, ascending Mount Sui. Mount Sui lies southwest of Mount Emei, its height boundless. Those who followed him never returned, all attaining the Dao of immortality. Thus, a local saying goes: *\"Obtain one peach from Mount Sui, and though you may not become immortal, you shall yet be proud.\"* Dozens of shrines stand at the mountain’s base, inscribed:\n*Wood may become sheep,\nSheep too may gain spirit.\nThe spirit rests in Ge You,\nUnfettered by any path.*\nSoaring high on Mount Sui,\nHe spread his wings and raised his voice.\nThose who knew defense became immortals,\nThose who gained the peach found glory.\n\n**The Two Jiang Fei**\nThe two Jiang Fei were of unknown origin. They appeared along the banks of the Jiang and Han rivers, where they encountered Zheng Jiaofu. Enamored at first sight, he did not know they were divine beings. He told his servant, *\"I wish to descend and ask for their pendants.\"* The servant replied, *\"The people here are skilled in speech. If you fail, you may regret it.\"* Jiaofu ignored him and went down, saying to the women, *\"You two must be weary.\"* They replied, *\"You, traveler, are the weary one—what weariness do we have?\"* Jiaofu said, *\"The orange is a pomelo; I fill my basket with bamboo shoots, set it adrift on the Han River, and let it float downstream. I follow along its banks, plucking the sacred mushrooms to eat, knowing my own presumption. I humbly ask for your pendants.\"* The two women said, *\"The orange is a pomelo; we fill our basket with reeds, set it adrift on the Han River, and let it float downstream. We follow along its banks, plucking the sacred mushrooms as well.\"* Then they untied their pendants and gave them to Jiaofu. Delighted, he received them and pressed them to his chest. After hurrying away for several dozen paces, he looked at the pendants—his bosom was empty. Turning back, the two women had vanished.\n\nThe divine consorts, radiant and free,\nAppeared at times along the river’s edge.\nIn graceful robes, they moved with measured step,\nTheir glancing eyes bestowing charm.\nJiaofu met them, spoke his heart’s desire—\nThe jade pendants cast aside, their fleeting forms untraced.\n\n**Fan Li**\nFan Li, styled Shaobo, was a native of Xu. He served the Zhou court under the tutelage of Grand Duke Wang. Fond of cassia-scented garments and drinking only water, he became a minister of Yue and aided Goujian in defeating Wu. Later, he boarded a light boat and entered the sea, changing his name and surname. He went to Qi, where he was known as Yazi. Over a hundred years later, he appeared in Tao, becoming the Lord of Tao Zhu. His wealth accumulated to hundreds of millions, and he was called Lord Tao Zhu. Later, he abandoned it all, sold medicine in Lanling, and was recognized by later generations for centuries.\n\nFan Li, steering cassia-scented oars,\nHis heart empty, his aspirations distant.\nTaught by Master Wang, he harbored both concealment and sorrow.\nThe dragon appeared in Yue’s land—\nHis work done, he turned away.\nShedding his sandals of a thousand gold,\nHe flowed with the Dao’s ebb and swell.\n\n**Qin Gao**\nQin Gao was a native of Zhao. He served as a retainer to King Kang of Song, playing the zither. Practicing the arts of Juan and Peng, he wandered between Jizhou and Zhuo (or Ma) Commandery. Over two hundred years later, he announced his intention to enter the Zhuo River to retrieve a dragon’s offspring. He instructed his disciples, *\"All must purify yourselves and wait by the water, setting up a shrine.\"* Sure enough, he rode a red carp and emerged, sitting within the shrine. Tens of thousands came to witness him. After staying for over a month, he reentered the water and departed.\n\nQin Gao, serene and poised, presided over music in Song’s palace.\nLeaving the world’s clamor, he drifted solitary,\nnow afloat, now submerged in Zhuo’s waters.\nEmerging, he leapt with lowered scales;\ndiving, he wove through clear, rushing currents.\nEntrusted to the water’s release,\nhis joy knew no bounds.\n\n**Kou Xian**\nKou Xian was a native of Song. He made his living by fishing, dwelling by the Sui River for over a hundred years. The fish he caught he sometimes released, sometimes sold, and sometimes ate. He always wore a cap and sash. Fond of planting lychee trees, he consumed their blossoms and fruit. When Duke Jing of Song inquired about his Way, he refused to reveal it, and the duke had him executed. Decades later, he appeared squatting at Song’s city gate, playing the zither for several days before departing. The people of Song honored him in every household.\n\nKou Xian cherished the Way—\nhis arts were not passed in vain.\nThough Duke Jing put him to death,\nhis corpse dissolved, his spirit ascended.\nFifty years passed,\nand he returned, plucking the zither.\nStraddling Song’s gate, he lingered,\nhis heart at ease with the five strings.\n\n**Prince Wangzi Qiao**\nPrince Wangzi Qiao was the eldest son of King Ling of Zhou. He delighted in playing the sheng, mimicking the phoenix’s cry. He wandered between the Yi and Luo Rivers. The Daoist master Fuqiu Gong carried him up Mount Songgao. Over thirty years later, when sought on the mountain, he appeared to Xiang Liang, saying: *\"Tell my family to await me on the seventh day of the seventh month at the summit of Mount Hou.\"* When the day arrived, he indeed rode a white crane to alight on the mountain’s peak, visible but unreachable. He raised his hand in farewell to the people of his time and departed after several days. Shrines were also established at the foot of Mount Hou and the summit of Mount Songgao.\n\nWondrous was Prince Wangzi,\nhis spirit roaming, his qi unclouded.\nHis sheng sang by the Yi and Luo,\nechoing the phoenix’s call.\nMoved by Fuqiu’s resonance,\nhand in hand they ascended.\nWielding his staff on the green cliffs,\nhe borrowed wings to journey alone.\n\n**Youbozi**\nYoubozi was a guest of the Su clan in Zhou. In winter, he always wore a single robe; in the height of summer, layered garments. His appearance changed with the years. Decades later, he grew more robust, yet none of his contemporaries recognized him.\n\nGenerations came to admonish and protect the Su clan, and their descendants received his blessings of power.\n\nA guest of Zhou, he concealed his countenance,\nerasing his traces in the dust of the world.\nIn summer, he donned layered garments;\nin winter, he shook off light flakes of snow.\nHis deeds never betrayed his roots,\nhis righteousness never sought solitary ease.\nThus he turned his gaze to the Zhou clan,\naiding them through hardship and peril.\n\n**Master Anqi**\nMaster Anqi was a native of Fu Village in Langye. He sold medicines by the Eastern Sea, and the people of his time all called him the \"Millennial Elder.\" When the First Emperor of Qin journeyed east, he requested an audience and spoke with him for three days and three nights. The emperor bestowed gold and jade discs worth tens of millions, which were left at the pavilion of Fu Village. Master Anqi departed, leaving behind a letter that read: \"I offer a pair of red jade ravens in return. Seek me on Mount Penglai in several years.\" The First Emperor then dispatched envoys—Xu Fu, Lu Sheng, and hundreds of others—into the sea. Before reaching Mount Penglai, they invariably encountered winds and waves and returned. Shrines were established in over ten places by the sea near the pavilion of Fu Village.\n\nAh, vast and empty was Anqi,\nhis form ethereal, his essence lofty and pure.\n\nRiding the light to align with nature, preserving qi to prolong life.\nIn fleeting enlightenment of the First Emperor of Qin, he left treasures at the pavilion of Fu Village.\nBound for Mount Penglai, his trace vanished in the limpid void.\n\n**Master Gui**\nMaster Gui was a man of Xianglin. His complexion was dark, yet at times white, at times yellow, at times red. The people of Nanhai saw him and revered him. He regularly consumed cassia and sunflower seeds, blending them with tortoise brain into a thousand pills weighing ten *jin*. For generations, cassia trees have borne witness to him. To this day, in the south of Jingzhou, cassia pills remain.\n\nAh, magnificent Master Gui,\nupright and steadfast in distant lands.\nThe numinous sunflower nourished within, the cinnabar cassia soothed without.\nHis countenance ever gentle, his radiance shone through the ages.\nThe Dao spread across the southeast, unbroken through generations.\n\n**Xiaqiu Zhong**\nXiaqiu Zhong was a man of Ning. He sold medicines in Ning for over a hundred years, and people considered him long-lived. When an earthquake struck and houses collapsed, Zhong and several dozen households in his village, their homes bordering the water, were all ruined. Zhong died, and the villagers cast his body into the water, taking his medicines to sell. Zhong, clad in furs, followed them, demanding his medicines back. Those who had discarded him grew fearful and kowtowed, begging for mercy. Zhong said: \"I regret that you have made others know of me. I shall depart.\" Later, he served as a courier for the king of the Fuyu Hu, returning once more to Ning. In the north, he was called the \"Banished Immortal.\"\n\nAh, Xiaqiu, master of the mysterious,\nbanished yet shedding his traces.\nMen die, and he too \"dies,\" yet how lightly he speaks of regret.\nWandering to observe the transformations of the world, why trouble the Hu couriers?\nIf one does not perceive the root, who would know he was banished?\n\n**The Wine Merchant**\nThe Wine Merchant was a man of the wine shop in the Liang market. His wine was always excellent and sold well, earning him ten thousand coins daily. When he was driven away for some offense, the shop’s wine turned sour and spoiled, leaving the owner impoverished. Many merchants in the Liang market offered their daughters in marriage to welcome him back. He came and went as he pleased.\n\nA century later, he returned to Liang as a magistrate, urging the people to plant more taro and greens. \"In three years,\" he said, \"there will be a great famine.\" And so it came to pass, yet the people of Liang did not perish. Five years later, he untied his official sash and departed, and none knew his end.\n\nThe Wine Merchant, Xiao Cui, lodged at a Liang tavern.\nWhat marked him as extraordinary?\nHis wine bore a singular, pure savor.\nBending to serve the times, he ensured the people never lacked.\nAt dawn, he loosed his seals and left—\nnone knew where he alighted.\n\n**Ren Guang**\nRen Guang was a man of Shangcai. Skilled in refining cinnabar, he sold it in the markets and streets. After eighty-nine years, it became known that he was the same Ren Guang of old, his face still as youthful as one in his thirties. Later, an elder recognized him as the one once summoned by Zhao Jianzi, who took him back to his domain. He often dwelled on Wu and Ti Mountains, and for three generations, none knew his whereabouts. The people of Jin regularly consumed his elixir.\n\nRen Guang of Shangcai,\nadept in refining divine cinnabar.\nThough his years spanned a century,\nhis countenance glowed with youthful hue.\nBriefly he attended Zhao Jianzi,\nthen followed his own ease.\nAscending the laddered peaks,\nhe soared to the clouds’ edge.\n\n**Xiao Shi**\nXiao Shi was a man of the time of Duke Mu of Qin. Skilled in playing the flute, he could summon peacocks and white cranes to his courtyard. The duke had a daughter named Nongyu, who admired him, and so the duke gave her to him in marriage. Daily, he taught Nongyu to mimic the phoenix’s cry. After several years, her playing resembled the phoenix’s voice, and phoenixes came to perch upon their roof. The duke built the Phoenix Terrace for them. The couple dwelled there for years without descending. One day, they both followed the phoenixes and flew away. Thus, the people of Qin built the Phoenix Maiden’s Shrine in Yong, where the sound of flutes could sometimes be heard.\n\nXiao Shi, master of the flute,\ndrew phoenixes and cranes to dance in his court.\nThe House of Ying favored their union,\nand she learned the phoenix’s song.\nThen they grasped the phoenix’s wings,\nsoaring into the lofty heavens.\nThe shrine preserves their memory,\nits lingering notes ever clear.\n\n**The Cock-Breeding Elder**\nThe Cock-Breeding Elder was a man of Luo. He lived at the foot of the northern mountain in Shixiang, raising chickens for over a hundred years. His flock numbered over a thousand, each given a name. At dusk, they roosted in the trees; by day, he released them. When he called their names, they came at his summons. Selling chickens and their chicks, he earned over a million coins, which he would leave behind. He then went to Wu, where he built a pond to raise fish. Later, he ascended Wu Mountain, where hundreds of white cranes and peacocks often gathered beside him.\n\nThough man and bird differ,\nthe Dao binds them as one.\nThe elder’s breath harmonized with all,\nherding chickens, tending fish.\nPerched in treetops, scales in water—\nsuch transformations endure,\nbestowed yet unchanging.\n\n**Zhu Zhong**\nZhu Zhong was a man of Kuaiji who often traded pearls in the Kuaiji market. During the reign of Empress Lü of Han, an edict was issued seeking three-inch pearls. Upon reading the proclamation, Zhu Zhong laughed and said, \"Now you shall have your worth.\" He presented a three-inch pearl at court and was rewarded with five hundred gold pieces. Princess Lu Yuan privately offered seven hundred gold for more pearls. Zhu Zhong then presented a four-inch pearl, placed it at the palace gate, and departed. An edict was issued to summon him from Kuaiji, but none knew his whereabouts. During Emperor Jing’s reign, he reappeared, offering dozens of three-inch pearls, then vanished again—none knew where he went.\n\nZhu Zhong, free of desire,\ndallied as a merchant.\nBending low to peer into the Black Dragon’s lair,\nhe plucked this midnight radiance.\nHis path began in Kuaiji,\ndazzling the capital of Xianyang.\nGiving without claiming virtue,\nhis fame grew through the ages.\n\n**Master Xiuyang**\nMaster Xiuyang was a man of Wei. He dwelled in a stone chamber on Huayin Mountain, where a suspended stone couch bore the marks of his long repose, worn deep into the rock. He ate little, occasionally consuming Solomon’s seal. Later, he sought an audience with Emperor Jing through the Dao. The emperor received him with courtesy and had him stay in the royal residence. After several years, the Dao remained unattained.\n\nA decree was issued to inquire when Master Xiuyang might depart. Before the words were fully spoken, he transformed upon his couch into a white sheep, its cheek inscribed: *\"Master Xiuyang bids farewell to the Son of Heaven.\"* Later, a stone sheep was placed upon the Spirit Terrace, but the sheep too vanished, its whereabouts unknown.\n\nProfound was Master Xiuyang,\nveiling his marvels, harboring spirit.\nHe pillowed on the stones of Mount Taihua,\nfeasting on yellow essence.\nThough Han’s rites were grand,\nthe Dao was not his path.\nAdapting to change, he took form,\nthen vanished in an instant.\n\n**Lord Jiqiu**\nLord Jiqiu was a Daoist of Mount Tai’s foothills. In Emperor Wu’s reign, he received rewards for his arts. His white hair turned black again, and fallen teeth regrew. Later, he departed.\n\nWhen the emperor toured the east and ascended Mount Tai, Lord Jiqiu donned a *zhangfu* cap and yellow robes, cradling a zither as he came to greet and bow before the emperor. Pointing, he warned: *\"Your Majesty must not ascend—you will injure your toes.\"* After several *li*, the emperor’s right toe indeed broke. The emperor concealed the injury, offering sacrifices before returning. A shrine was built for Lord Jiqiu, and attendants were appointed to serve him.\n\nSerene Jiqiu, penetrating the depths,\ncultivated the Dao on the sacred mountain.\nRefining form, cleansing essence,\nhe reversed age and restored youth.\nWhen Han Wu journeyed forth,\nhe came bearing his zither to welcome him.\nWarning against ascent,\nhe foresaw what was yet to be.\n\n**Cui Wenzi**\nCui Wenzi was a man of Mount Tai. His family had long revered the teachings of the Yellow Emperor and Laozi. Dwelling at the foot of Mount Qian, he later crafted the *Yellow Powder* and *Red Pellets*, establishing a shrine for Father Stone. He sold medicines in the city markets, claiming to be three hundred years old.\n\nWhen a plague struck and tens of thousands perished, the local magistrate sought his aid. Cui Wenzi, wielding a vermilion banner and carrying the *Yellow Powder*, paraded through the city gates. Those who drank the powder recovered instantly, and countless lives were saved. Later, he departed and sold the *Yellow Powder* in Shu. Thus, the world treasured Cui Wenzi’s *Red Pellets* and *Yellow Powder*, deeming them near-divine.\n\nMaster Cui attained the Dao,\nguardian of hidden mysteries.\nAs pestilence brought ruin,\nhis compassion grieved.\nWith crimson banner flashing,\ndivine medicine swiftly arrived.\nIn that moment, lives were preserved,\na legacy for all ages.\n\n*Records of the Immortals, Volume One—End*\n\n# *Records of the Immortals, Volume Two*\n\n**Red-Beard Master**\nRed-Beard Master was a native of Feng. The people of Feng transmitted accounts of him across generations, claiming he had been the fish warden under Duke Mu of Qin. He repeatedly foretold disasters, floods, and droughts along the borders of Feng, missing not one in ten. The court officials revered and followed him, welcoming him as their master. They studied under him, inquiring into his extraordinary abilities. He favored eating pine nuts, asparagus root, and mineral pitch; when his teeth fell out, new ones grew, and when his hair shed, it returned. After consuming the morning mist to the point of satiation, he departed and dwelled beneath Mount Hao for over a decade, after which none knew his whereabouts.\n\nRed-Beard left Feng,\nresting at the foot of Mount Hao.\nThree medicines he mastered,\nhis withered form renewed.\nIn vain they sought his teaching,\nfor none could prolong their years.\nHow could petty wisdom grasp\nthe span of vast longevity?\n\n**Dongfang Shuo**\nDongfang Shuo was a native of Yanci in Pingyuan. He dwelled for long in the capital, serving as a scribe for several decades. During the reign of Emperor Wu, he submitted a memorial on state affairs and was appointed Gentleman of the Palace. By the time of Emperor Zhao, some called him a sage, others an ordinary man. He engaged in conduct both profound and shallow, now speaking with loyalty, now uttering enigmatic words—none could fathom his intent. At the beginning of Emperor Xuan’s reign, he resigned his post as Gentleman to escape the turmoil of the age, leaving his official lodgings as the wind bore him away. Later, he was seen in Kuaiji, selling medicines by the Five Lakes. The wise suspected him to be the essence of Jupiter.\n\nDongfang, strange and far-reaching,\nblended with the customs of his time.\nNow a dragon, now a serpent—\nwhat cared he for honor or disgrace?\nHis lofty spirit soared beyond the clouds,\nunfettered, unbound.\nHe vanished into the Five Lakes,\nhis shadow leaping to the Valley of the Sun.\n\n**Lady Hook-Wing**\nLady Hook-Wing was a native of Qi, surnamed Zhao. In her youth, she favored purity and solitude.\n\nFor six years she lay bedridden, her right hand clenched in a fist, taking little food or drink. A diviner observing the qi declared: \"In the northeast there is the qi of a noble person.\" They sought her out and found her—her bearing and beauty were extraordinary. Emperor Wu pried open her hand and discovered a jade hook; immediately, her fingers unfurled. He took her into his favor, and she bore him Emperor Zhao. Later, Emperor Wu had her killed. When her body was laid in state, it remained uncorrupted and fragrant for a month. After Emperor Zhao ascended the throne, he reburied her. Inside her coffin, only a pair of silk slippers was found, so her palace was named *Hook-Wing*. Later, to avoid taboo, it was renamed *Yi Temple*. Within its chambers stands a shrine to her spirit.\n\nGentle and yielding, a frail beauty,\nher temple received the hook’s mandate.\nShe gave birth to an illustrious heir,\nthe imperial line flourished.\nWu’s folly, turning virtue to enmity—\nshe surrendered her life to execution,\nher corpse vanished, her fragrance lingered.\n\n**Calf Child**\nCalf Child was a native of Ye. In his youth, he lived on Black Mountain, gathering pine nuts and *fuling* mushrooms to consume as food. He lived for several hundred years, now appearing youthful, now aged, now handsome, now plain. People came to recognize him as an immortal. He often visited the home of Yang Du, who sold wine in the marketplace. Yang Du’s daughter had eyebrows that met and ears long and delicate. The people marveled at her, calling her a celestial being. One day, Calf Child arrived leading a yellow calf. The girl took a liking to him and stayed to serve him. She followed him to gather peaches and plums, returning after a single night—all the fruit was sweet and luscious. The townsfolk trailed them, but when they rushed out the gate, they could only seize the calf’s ears as it fled; no one could catch them. Later, she reappeared in the market for decades before departing. They were seen at the foot of Pan Mountain, selling peaches and plums in winter.\n\nCalf Child dwelled in the mountains,\ngathering pine nuts, consuming *fuling*.\nHis inner qi refined, his form transformed,\nwhite hair turned dark.\nYang’s daughter bore a rare countenance,\ntheir fates mysteriously aligned.\nMounting the numinous calf,\nthey vanished swift as lightning.\n\n**Dragon-Rider Ming**\nDragon-Rider Ming was a native of Huntin. At twenty, he found dragon hatchlings in a pond—over ten of them, resembling little officials on guard. He raised and fed them, building a thatched hut to watch over them. As the dragons grew, they gradually departed. Fifty years later, a flood destroyed his hut and swept it away. One day, he rode a dragon to Huntin and declared: \"I am the grandson of Feng Bochang. All within five hundred *li* of this place will surely perish.\" Those who believed him fled; those who did not called him a demon. In the eighth month, the waters indeed rose, drowning tens of thousands. Ming had tended the dragons, building his hut by the empty pond. He waited single-mindedly for their transformation, then rode the clouds away. Returning to his hometown, he urged them to flee swiftly. His warnings revealed disaster and fortune, yet his heart never left his kin.\n\n**Pillar Master**\nPillar Master’s origins are unknown.\n\nPillar Master ascended Rock Mountain with a Daoist, declaring that cinnabar lay there in quantities of tens of thousands of *jin*. The magistrate of Rong Mountain learned of this and sealed the mountain. The cinnabar then flowed forth like flying fire, and they permitted Pillar Master to take it. Magistrate Zhang Junming of the district consumed the cinnabar for three years, obtaining divine cinnabar that drifted like snow. After five years of ingestion, he gained the ability to fly and thus departed together with Pillar Master.\n\nPillar Master and his companion peered into the depths,\nThe Daoist’s essence pure and penetrating.\nMysterious resonance stirred the mountain,\nCinnabar emerged from the cavern.\nGlowing streams of crimson,\nFloating flurries of snow.\nThe magistrate awakened to truth,\nAnd in the end, they shared the same joy.\n\n**Garden Guest**\nGarden Guest was a man of Jiyin. His appearance was handsome and his nature kind; many in the district sought to wed their daughters to him, yet he never took a wife. He often cultivated five-colored fragrant herbs, accumulating them for decades and consuming their fruit. One day, a five-colored moth alighted upon the tip of his fragrant tree. The Guest gathered and spread them upon cloth, whereupon silkworms were born. When the time for silkworms came, a beautiful woman arrived at night, calling herself the Guest’s wife and explaining the state of the silkworms. The Guest tended them with her, yielding one hundred and twenty cocoons, each as large as a jar. Unwinding a single cocoon took sixty days to complete. When the task was done, they departed together, and none knew their whereabouts. Thus, the people of Jiyang established a shrine to the silkworm, erecting a temple in its honor. Some say he was of the Jiyang family of Chenliu.\n\nHow splendid was the Garden Guest,\nHis countenance radiant as morning blossoms.\nHe drew in the essence of the Dao above,\nAnd below, held the five petals.\nFragrant blooms in profusion,\nResplendent patterned moths.\nA virtuous maiden descended at night,\nMatched in virtue, they ascended afar.\n\n**Deerskin Elder**\nDeerskin Elder was a man of Zichuan. In his youth, he served as a minor carpenter in the prefectural office, able to craft implements with a mere gesture. Atop Mount Cen lay a divine spring, inaccessible to ordinary men.\n\nThe minor clerk reported to the prefect, requesting thirty carpenters with axes to construct a revolving wheel and suspended pavilion, their ingenuity flowing without end. In several dozen days, ladders and pathways took shape on all four sides. Ascending to the summit, they built a shrine hall, where Deerskin Elder took up residence, severing two of the pathways to secure his solitude. He ate lingzhi mushrooms and drank from the divine spring, dwelling thus for nearly seventy years. When the Zi River rose, he called three times to summon his clansmen and household—over sixty in number—and bade them ascend halfway up the mountain. The floodwaters surged, drowning an entire commandery, with tens of thousands lost. The minor clerk then took leave of his kin, sending them down the mountain. Clad in deerskin robes, he departed, returning once more to the pavilion. Over a hundred years later, he descended to sell medicine in the marketplace.\n\nDeerskin Elder’s inspired thoughts,\nHis wondrous craft enduring.\nThe soaring pavilion, suspended in delight,\nEmbraced above by the divine spring.\nSolemn and pure the sacred hall,\nTwo pathways sealed with care.\nHere one may dwell in tranquility,\nHere one may attain long years.\n\n**Chang Rong**\nChang Rong was a Daoist of Changshan. She claimed to be a descendant of the Yin kings. Feeding on the roots of bindweed, she wandered up and down the mountains. Those who saw her over two hundred years found her complexion still like that of a woman of twenty. She gathered purple grass, selling it to dyers to earn money, which she gave to orphans and widows. She lived thus through the ages, with tens of thousands honoring her shrine.\n\nThe Yin maiden forgot glory,\nNo lingering attachments remained.\nShe nurtured her gentle countenance,\nTransforming her radiant bearing.\nHer heart moved with the changes,\nHer days tempered by qi.\nSitting beyond rare treasures,\nShe bestowed kindness upon the orphaned and lowly.\n\n**Valley Elder**\nValley Elder was a man of Yong in Nanjun. Dwelling in the mountains, an immortal often stayed at his home. Once, when he went to buy melons, the immortal taught him to refine melon seeds, storing them with cassia, aconite, and angelica seeds, dividing them equally. After eating them for over twenty years, he gained the ability to run swiftly and ascend mountains or enter water as if walking on land. More than a hundred years later, he lived atop a remote mountain peak. He called to the elders below in the valley, recounting events from his earlier days. He said:\n\nValley Elder sought but one thing—\nto dwell in the secluded valley.\nBelow, he gazed upon clear streams;\nabove, dense vines and creeping moss enshrouded him.\nAn immortal guest lodged with him,\nguiding him with secret texts.\nHis form transcended dust and mist,\nyet his heart remained in the old customs.\n\n**Mountain Chart**\nMountain Chart was a man of Longxi. In his youth, he loved riding horses, but one threw him and broke his leg. A mountain Daoist taught him to take a powder of rehmannia, angelica, notopterygium, tu-huo, and sophora, and after a year of taking it, he lost his appetite for food, his ailment healed, and his body grew light. He pursued the Daoist and questioned him, who said he was a messenger of the Five Peaks sent to gather herbs from famous mountains. \"Follow me,\" he said, \"and I will make you immortal.\" Mountain Chart followed him for over sixty years. One day, he returned home to observe mourning for his mother. After the mourning period, he departed again, and none knew where he went.\n\nMountain Chart bore suffering,\nthrough ruin attaining wholeness.\nReceiving qi to animate his body,\nmedicine lightened his fate, extending his years.\nHe inscribed his grief on the wutong tree,\nyet Heaven’s love still bound him.\nAfter several cycles, he ascended on high,\nforever severed from the world’s green.\n\n**Valley Spring**\nValley Spring was a man of Liyang. During Emperor Cheng’s reign, he served as a Gentleman of the Palace, but fell ill and died—though his body did not grow cold. His family held the funeral and donned mourning robes, yet dared not seal the coffin. Three years later, he donned his cap and sash again and sat at the county gate. The townspeople were greatly alarmed. His family came to fetch him, but he refused to return home.\n\nThe coffin was opened, revealing garments but no corpse. He remained at the gate for three nights, then departed for Chang’an, where he stayed at the Heng Gate. People recognized him and pursued him to bring him back. He then left again for Mount Taibai, where a shrine was established upon the mountain. At times, he would come and stay overnight in his own shrine.\n\nAfter Valley Spring’s death, his body remained warm. The coffin lay sealed for five years before he appeared at the gate in full court attire. Gazing upon the empty casket, his form had vanished—only his robes remained. He left his traces on Mount Taibai, drawing in the primal root of qi.\n\n**Yin Sheng**\nYin Sheng was a beggar beneath the Wei Bridge in Chang’an. He often begged in the marketplace, but the people grew weary and tormented him, dousing him with filth. Yet when he returned to the alleys, his clothes remained as clean as before. The magistrates, learning of this, seized and beat him, binding him in stocks, but he soon reappeared in the marketplace begging. They shackled him again, intending to kill him, and only then did he depart. The household of those who had defiled him collapsed of its own accord, killing over ten people. Thus arose a saying in Chang’an: *\"See a beggar, give fine wine, to spare your house from ruin.\"*\n\nYin Sheng, the beggar—people loathed his persistence. Few recognized his true nature, and he endured repeated imprisonment and humiliation. Even the men of Huaiyin forgot their stinginess—how much more should we, of the immortal lineage? Spurning evil brought calamity upon their own homes.\n\n**Mao Nü**\nMao Nü, styled Yujian, dwelled in the mountains of Huayin. Hunters of successive generations had seen her—a figure covered in body hair. She claimed to have been a palace woman of the First Emperor of Qin. When the Qin fell, she fled into the mountains to escape disaster. There she encountered the Daoist Valley Spring, who taught her to eat pine needles. Thereafter, she knew neither hunger nor cold, and her body became as light as if she could fly. For over one hundred seventy years, the sound of her zither playing could be heard from the caves where she stayed. She said:\n\nMao Nü, graceful as jade, adapted and vanished with the times.\nA Perfected One bestowed the method—she feasted on pine blossoms and seeds.\nFrom ruin came fulfillment; her life stretched long and blessed.\nDelighting in cliffs and peaks, she found joy in zither and lute.\n\n**Zi Ying**\nZi Ying was a man of Shuxiang. Skilled at diving to catch fish, he once netted a red carp. Enamored of its fine color, he carried it home and placed it in his pond, feeding it grains of rice for a year. The carp grew over a *zhang* long, sprouted horns, and grew wings. Zi Ying, astonished, bowed in reverence. The fish spoke: *\"I have come to fetch you. Mount my back, and I will bear you to heaven.\"* At once, a great rain fell. Zi Ying climbed onto the fish’s back, and together they soared away. Year after year, he returned to his old home to eat and drink, visiting his wife and children. The fish would come again to welcome him, and this continued for seventy years. Thus, in Wu, every household carved images of the sacred fish, and a shrine was built to Zi Ying.\n\nZi Ying loved the water, making his living by roaming and fishing.\nA numinous scale came to him, splendid in hue.\nHe nurtured it, and it grew—horns sprouted, wings unfurled.\nThen it bore him on clouded glass, striding beyond the Great Ultimate.\n\n**Fu Lü**\nFu Lü’s origins are unknown.\n\nFu Lü often stayed in Ju, frequenting the shrines along the seacoast. Once, three immortals were casting melon-seeds in a shrine when they turned and called to him, ordering him to carry several dozen yellow and white melons. They bade him close his eyes, and when he awoke, he found himself on Mount Fangzhang, south of Mount Penglai. Thereafter, he would return to Ju to gather pearls and jade from Mount Fangzhang’s treasures and sell them, which he did for many years. One day, his head was shorn, and he wore a reddish-brown robe, his appearance grown old. When asked, he said it was because he had taken something from the temple. Yet after several years, his countenance became strong and fair again, his temples as dark as before.\n\nFu Lü inquired of the shrine’s spirits, and the three immortals were their envoys. In a moment’s slumber, he had traversed a thousand *li*. To take treasures and mar one’s form—this was no great shame. Mounting the dragon or riding the phoenix, he roamed free from beginning to end.\n\n**Wen Bin**\nWen Bin was a man of Taiqiu village. He made his living selling straw sandals. He would take a wife, only to abandon her after several decades. Once, an old woman he had once wed lived to over ninety, yet when she saw Bin again, he appeared even more robust than before. The woman bowed to him, weeping, but Bin declined, saying, “This is not fitting. On the morning of the first day of the new year, could you meet me at the western altar of the village shrine?” The old woman, though frail, traveled over ten *li* that night with her children and grandchildren and waited for him at the altar. After a moment, Bin arrived and exclaimed in surprise, “Do you cultivate the Dao?” Had he known, he would not have left her before. He taught her to consume chrysanthemum flowers, *difu*, mistletoe from mulberry trees, and pine nuts to replenish her *qi*. The woman, too, grew strong again, and they lived together for over a hundred more years.\n\nWen Bin nurtured life, drawing in the mysterious void.\nPine and chrysanthemum served as his sustenance, refining his form to radiant skin.\nHis former wife, drawn to the Dao, bowed and wept, tottering forward.\nHe revealed his error and imparted the art, extending her years by a hundred more.\n\n**Shangqiu Zixu**\nShangqiu Zixu was a man of Gaoyi. He enjoyed herding pigs and playing the *yu*. Though seventy years old, he had never married and showed no signs of aging. The villagers marveled at him and sought the Dao from him, asking for its essentials. He replied, “Simply eat the roots of *mujiang* and calamus, drink water, and you will neither hunger nor age.” Thus he passed through the generations, seen for over three hundred years. Nobles and wealthy families heard of this and took the herbs themselves, but none could persist for even a year, soon abandoning them in laziness, saying he must have some hidden protection.\n\nShangqiu dwelled in seclusion, repaying the casket with wondrous arts.\nThirsty, he drank from cold springs; hungry, he ate calamus roots.\nPlaying the *yu* while herding pigs, he stood out as extraordinary.\nContent in the Dao, he sought nothing, delighting in endless days.\n\n**Zizhu**\nZizhu spoke in the Chu dialect with a delicate voice, and none knew his origins.\n\nHe journeyed to the King of Jiangdu, declaring, “Master Ning once looked upon me, and I have been a guest for three hundred years, yet never been granted an audience.” The king took him for a madman. When asked where the master resided, he said, “On the summit of Longmei Mountain.” The king dispatched an officer to ascend the peak, where they found Master Ning—his body covered in hair, his ears broad, his hair unbound as he plucked the zither. Zizhu prostrated before him, and the officer delivered the king’s command. The master said, “This man is the ninth-generation descendant of my former neighbor. Moreover, I foresee three women in your household who will die violently—do not interfere in my affairs.” As his words ended, a great wind arose, and the officer fled down the mountain. By the time he returned, three women in the palace had indeed killed one another. The king sent offerings of the three sacrificial animals to establish a shrine there.\n\nZizhu retained his youth, his principles grounded in something profound.\nThe Ning Master’s shrine flourished, his zither echoing on Dragonbrow Peak.\nIn Dao they found accord, resolving subtle disputes.\nWith utmost effort in service, he inquired to illuminate his teacher’s wisdom.\n\n**Tao Angong**\nTao Angong was a master smelter of Liu’an. After repeatedly working the furnace, one day the fire scattered, rising in a purple column that pierced the heavens. Angong prostrated beneath the furnace, pleading for mercy. In an instant, a vermilion phoenix alighted upon the cold forge and said, “Angong, Angong, the cold forge communes with heaven. On the seventh day of the seventh month, you shall be fetched by a crimson dragon.” When the appointed day arrived, the red dragon descended amid a great rain. Angong mounted it and soared toward the southeast. The entire city—tens of thousands of people—gathered to see him off, bidding him farewell as one. He said:\n\nAngong stoked the flames, and violet fires blazed with radiant brilliance. A graceful vermilion phoenix arrived, bearing tidings of the appointed hour; resplendent in crimson, it coiled sinuously toward the destined day. The entire city gazed upward, turning back to bid him farewell.\n\n**Chi Fu**\nChi Fu was a man of Barong. He served as registrar of the Green Rooster Shrine. Skilled in refining cinnabar through water tempering, he consumed saltpeter with it for thirty years, reverting to the appearance of a youth—his hair and beard both turned red. Decades later, he ascended Mount Hua to gather *yu yuliang* as provisions, selling them between Cangwu and the Xiang River. For generations, people reported sightings of him. In his palm rested a red axe.\n\nChi Fu cultivated truth, his hair lustrous in Barong. Dwelling in the divine shrine, he refined cinnabar with devotion. Though his beard gleamed crimson, his face bloomed like a vermilion flower. Gathering herbs on the sacred mountain, he observed transformations in the distant south.\n\n**Hu Zixian**\nHu Zixian was a diviner at the pass of Hanzhong. Over a hundred years old, as he neared his departure, he called to an old tavern woman: “Prepare quickly! I shall accompany you to answer the call of the Prince of Zhongling.” That night, an immortal arrived bearing two straw dogs. Hu Zixian took one and gave the other to the tavern woman; mounting them, they became dragons. They ascended Mount Huayin, where he would often cry out from the summit: “Zixian and the tavern woman are here!”\n\nThe Three Spirits moved in hidden resonance, their response as precise as tallying tokens. Side by side, they rode the straw dogs, then sinuously vanished as dragons. Together they scaled the great Hua, proclaiming their worldly manifestation. Those who serve their lords with impropriety shall meet with retribution; those who act with virtue shall receive favor.\n\n**The Master of the Mirror-Carrying Case**\nThe Master of the Mirror-Carrying Case was of unknown origin. His speech resembled that of the people between Yan and Dai. He often carried a mirror-grinding case through the markets of Wu, polishing mirrors for a single coin. As he ground them, he would ask the owner if they suffered any ailments, then produce a purple pill to give them. All who received it were cured. Thus he lived for decades.\n\nWhen a great plague later struck, he went from house to house distributing medicine, saving tens of thousands of lives without accepting a single coin. The people of Wu then recognized him as a true transcendent. Later, he took up residence at the edge of a sheer cliff on Mount Wu, lowering medicine down to the people below. As he prepared to depart, he told those below: \"I return to Mount Penglai, where I shall send down divine water for you all.\" One morning, water appeared on the cliff—white in color, flowing down from between the rocks. Many who drank it were cured of their illnesses. Shrines were established in over ten locations in his honor.\n\nThe Mirror-Carrying Transcendent, dignified and refined,\nClad in coarse cloth yet radiant with inner grace.\nHis arts rivaled those of Bian Que,\nHis heart embraced the cosmos entire.\nHe drew forth the springs of Penglai,\nPouring them upon these lofty peaks.\nSoon to return to Penglai’s isles,\nThere to attain the lifespan of heaven.\n\n**Zhu Huang**\nZhu Huang was a native of Guangling. In his youth, he suffered from a virulent wasting disease. He sought out Ruan Qiu, a Daoist on Mount Sui. Taking pity on him, Ruan Qiu said: \"If you expel the Three Worms from your abdomen, you may cultivate the work of a true transcendent—this can be taught.\" Zhu Huang replied: \"If my illness is cured, I shall serve you as a disciple for thirty years, never daring to return home.\" Ruan Qiu gave him a seven-ingredient medicine, instructing him to take nine pills daily. After a hundred days, his illness passed in the form of several *dou* of liver- and spleen-like matter. After nursing himself for several dozen days, he grew robust and healthy, his mind and spirit growing ever clearer. Ruan Qiu then gave him the *Scripture of the Yellow Court*, instructing him to read it three times daily until he had mastered it and could contemplate its meaning. Thereafter, Ruan Qiu took Zhu Huang with him into the Jade Maiden Shrine on Mount Fuyang. After eighty years, they returned to their former abode—Zhu Huang’s white hair had turned black, and his temples now bore tresses over three *chi* long. He visited his family to eat, staying for several years before departing again. He remained thus until the end of Emperor Wu’s reign.\n\nZhu Huang’s infirmity faded,\nFortune and blessing drew near.\nThe true transcendent administered his medicine,\nAnd the Three Worms were all transformed.\nWith a heart emptied and spirit luminous,\nHe soared to praise in the unseen realms.\nHis hair, once hoary, turned black,\nTranscending to attain long life.\n\n**Huang Ruan Qiu**\nHuang Ruan Qiu was a Daoist on Mount Sui. Clad in furs with unbound hair, his ears measured seven *cun* in length, and his mouth was toothless. He could walk four hundred *li* in a day.\n\nOn the mountain, he cultivated scallions and lotuses for over a hundred years, unknown to others. Occasionally descending to sell medicine, Zhu Huang revealed his presence, and only then did people recognize him as a divine transcendent. When earthquakes or landslides severed the paths, he would forewarn those below, and the world revered him with sacrifices.\n\nAmidst the misty peaks of scallion-clad cliffs,\nHe made his dwelling in truth.\nClad in furs with unbound hair,\nHis light steps surpassed all bounds.\nEmbracing the Dao to nurture life,\nHis wondrous insight pierced the unseen.\nZhu Huang bore witness to his power,\nAnd warned the people below.\n\n**Nü Wan**\nNü Wan was a woman who sold wine in the market of Chen. Her brew was always exquisite. Once, an immortal passed her home to drink, leaving behind five scrolls of the *Plain Book* as collateral. Wan opened and read them, discovering methods for nurturing vitality and harmonizing union. Secretly transcribing their essentials, she arranged chambers to welcome young men, offering fine wine and lodging, practicing the techniques from the text. Thus, for thirty years, her complexion remained as youthful as a woman of twenty.\n\nYears later, the immortal returned and, laughing, said to Wan: *\"Stealing the Dao without a master, you have wings yet do not fly.\"* Thereupon, she abandoned her home to follow the immortal, and none knew where they went.\n\nThe essentials of the *Mysterious and Plain* lie near, drawn from the body itself.\nPeng Pin grasped them, and five scrolls were set forth.\nNü Wan harbored their wonders; an immortal guest arrived.\nPouring out the texts, she spread their teachings—together they soared beyond the dust.\n\n**Lingyang Ziming**\nLingyang Ziming was a man of Quan Village. Fond of fishing, he once hooked a white dragon in the whirling stream of Xuan Brook. Terrified, Ziming loosened the hook, bowed, and released it. Later, he caught a white fish whose belly contained a book, teaching him the methods of ingesting and consuming elixirs. Ziming then ascended Mount Huang, where he gathered the five mineral fats and boiled them in water to ingest. After three years, a dragon came to welcome him away, and he dwelled on Mount Lingyang for over a hundred years. The mountain rose over a thousand *zhang* above the earth; he would call down to those below, bidding them ascend halfway up the slope. He told them that a man named Zi’an from the stream would come, and asked whether Ziming’s fishing cart still remained. Over twenty years later, Zi’an died, and people buried him beneath Stone Mountain. A yellow crane came to perch in the tree beside his tomb, crying out Zi’an’s name.\n\nLingyang cast his line, the white dragon took the hook.\nAt last he gained the auspicious fish, and the numinous script guided his cultivation.\nFive minerals steeped in water, he ascended the mountain riding the rainbow.\nWhen Zi’an indeed perished, what did the crying crane seek?\n\n**Hanzi**\nHanzi claimed to be a man of Shu.\n\nHanzi delighted in setting his hound free. Once, the dog ran into a mountain cavern, and Hanzi followed it in, spending over ten nights within, traversing several hundred *li*. Emerging atop the mountain, he found terraces, halls, and palaces, with verdant pines standing dense and tall, and immortal officials standing guard in strict array. There, he saw his former wife, who was washing fish, and she gave Hanzi a sealed talisman and medicine, bidding him return and deliver them to Magistrate Qiao of Chengdu. When Magistrate Qiao opened the seal, he found fish roe within. He placed them in a pond, and after a year, they all took the form of dragons. The talisman was then sent back to the mountain. The hound’s coat turned crimson, and it grew long wings, ever accompanying Hanzi in his comings and goings. After over a hundred years, Hanzi remained on the mountain, descending only at times to protect his clan. The people of Shu built a shrine at the cavern’s mouth, where the sounds of drums and pipes and voices calling out were often heard. For thousands of *li* to the southwest, all revered this shrine.\n\nHanzi, in pursuit of his hound,\nentered the immortal cavern’s ground.\nTowering halls stood grand and bright,\nrows of pines in verdant height.\nTalisman and medicine he received,\nto and fro his ties he weaved.\nAt last he dwelled on peaks divine,\nwhere echoes rang in tones sublime.\n\nMuyu\n\nMuyu was a man of Nanheping Township in Julu. His mother, poor and lowly, worked as a midwife. Once, while attending a birth, she reached for the newborn, who at once opened its eyes, gazed at her, and laughed aloud. Terrified, she dreamed that night of a man in a tall hat and red robes standing guard over the child, saying: “This is the Lord of Life. He shall repay your kindness, and your son Muyu shall attain immortality.” His mother secretly believed and remembered this. Later, when she bore a son, she named him Muyu. The child she had delivered turned fifteen, when one night a carriage and horses arrived to take him away. Passing by his mother’s home, they called out: “Muyu, Muyu, come and be our driver!” Then they all departed together. Over twenty years later, a stork delivered a two-*chi* fish to his mother’s door at dawn. She hid it and told no one, selling the fish instead. After thirty years, he vanished entirely. His mother lived to be a hundred before she passed away.\n\nThe Lord of Life manifested his numinous power, and the mother was struck with terror. Thus was her kindness repaid, though the covenant remained unfulfilled. When the Dao had ripened through the three and five phases, a light-drawn chariot came to fetch him by night. In the end, virtue was requited, and she attained a distant, enduring lifespan.\n\nXuan Su\nXuan Su claimed to be a man of Hejian. He ingested croton beans and sold medicine in the marketplace—seven pills for a single coin, curing all ailments. The Prince of Hejian suffered from emaciation; after purchasing and taking the medicine, he passed more than ten serpents. When asked the principle behind the remedy, Su explained: “The prince’s affliction was the lingering calamity of six generations of accumulated misfortune, not something he himself had incurred.” The prince had once released a nursing doe—his own mother in a former life—his benevolence moving Heaven, and thus he was destined to encounter Su.\n\nAn elder retainer of the prince’s household said his father had seen Su in past generations, and that Su cast no shadow. The prince summoned Su at midday to observe him, and indeed, no shadow appeared. The prince wished to betroth his daughter to him, but Su fled by night. Later, he was seen beneath Mount Chang. His substance was void, his shadow vanished—such was Xuan Su in his time.\n\nHe spread virtue through divine pills, redeeming his debt through the doe. His Dao flourished in Hejian, where royal favor was deep and intimate. Unrestrained by soaring dragons, he transcended all bounds.\n\n**Eulogy:**\nThe *Book of Changes* speaks of the Great Ultimate, from which the Two Modes arise. Once the Two Modes are born, then come the people. With the people, life and death follow. The meaning of life and death is thus made manifest.\n\nAll things unfold in boundless profusion, merging into oneness, nothing left unprovided. How wondrous, how subtle, how refined, how minute—such matters cannot be exhaustively discussed one by one. The sage, looking up, observes the patterns of Heaven; looking down, he examines the models of Earth. The sun and moon move in their courses; the four seasons govern in turn. The five planets are regulated by the Supreme Subtlety, overseeing the wayward states, foretelling fortune and misfortune to warn the lords of the land. Movement and stillness, speech and response—correspondences flow in harmony, as they have since ancient times.\n\nThough Heaven does not speak, its transformations and deeds cannot be called nonexistent. The *Preface to the Book of Zhou* records that Sangjiao asked Master Juan: “There is death, yet there are also those who speak of divine transcendents—are these two things both true?” Master Juan replied: “They can indeed both be true.”\n\nThe *Canon of Filial Piety in Aid of the Numinous* states: “Beyond Heaven and Earth, the numinous pervades the void, just as the Five Peaks are established and the Three Terraces are set. The yang essence governs the outer, the yin essence governs the inner; qi ascends and descends, weaving through all beings. The Dao’s governance is not singular.”\n\nAs for plants and trees, they surely sprout in spring and wither in autumn—yet among trees there are pines, parasols, cedars, sandalwoods, and over a hundred and eighty other kinds; among grasses there are lingzhi, floating fruit, spirit ponds, Solomon’s seal, white talismans, bamboo shoots, and fire-warding herbs—tens of thousands that live long and never die. In the depths of winter, enduring frost and snow, they flourish without fading. If such things exist in this class, why marvel at the existence of transcendents?\n\nI once obtained the *Chart of Transcendents* compiled by Ruan Cang, a grandee of Qin, which records over seven hundred individuals from the Six Dynasties to the present. The First Emperor was fond of seeking transcendence, and though he nearly succeeded, the magicians gathered like mist, their prayers and sacrifices spreading far and wide. Most likely, they relied on the near to fabricate the distant, turning emptiness into substance—such things cannot be trusted.\n\nYet the *Yellow Register* of the Duke of Zhou records that the planet Venus descended to become a duke, and that the planet Jupiter transformed into the Duke of Ningshou, among other such accounts, not confined to a single source. The sages did not expound on such matters because they are without constancy. Nevertheless, though they sometimes manifest, the Dao cannot be abandoned. To reject and seal them away is still to uphold correctness.\n\nAs the *Analects* says of “the strange, the forceful, the chaotic, and the numinous,” its subtle purport may be discerned.\n\n*Accounts of Transcendents, Scroll the Lower, concludes.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真部记传类 列仙传 经名：列仙传。 二卷。 原题汉光绿大夫刘向撰。 底本出处：《正统道藏》洞真部记传类。 参校本：《四库全书》本。 列仙传卷上 汉光禄大夫刘向撰 赤松子 赤松子者，神农时雨师也。 服水玉，以教神农。 能入火自烧。 往往至昆仑山上，常止西王母石室中，随风雨上下。 炎帝少女追之，亦得仙俱去。 至高辛时复为雨师。 今之雨师本是焉。 眇眇赤松，飘飘少女。 接手翻飞，玲然双举。 纵身长风，俄翼玄圃。 妙达巽坎，作范司雨。 宁封子 宁封子者，黄帝时人也。 世传为黄帝陶正。 有人过之，为其掌火，能出五色烟。 久则以教封子。 封子积火自烧，而随烟气上下。 视其灰烬，犹有其骨。 时人共葬於宁北山中，故谓之宁封子焉。 奇矣封子，妙禀自然。 铄质洪炉，畅气五烟。 遗骨灰烬，寄坟宁山。 人睹其迹，恶识其玄。 马师皇",
      "translated_text": "**Records of the Perfected Immortals**\n*Category: Biographical Records, Cavern of Perfection Division*\n\n**Title:** *Traditions of the Immortals*\nTwo fascicles. Originally attributed to Liu Xiang, Han Court Gentleman for Splendid Happiness.\n\n**Source of Base Text:** *Daoist Canon of the Zhengtong Era*, *Biographical Records* section of the *Cavern of Perfection Division*.\n**Collated with:** *Siku Quanshu* edition.\n\n---\n\n**Traditions of the Immortals, Fascicle One**\nBy Liu Xiang, Han Court Gentleman for Splendid Happiness\n\n**Chisongzi**\nChisongzi was the Rain Master in the time of Shennong. He ingested *shuiyu* (water jade) and taught its use to Shennong. He could enter fire and burn himself unharmed. Often he ascended Kunlun Mountain, dwelling in the stone chamber of the Queen Mother of the West, riding the winds and rains as they rose and fell. The youngest daughter of the Flame Emperor pursued him and, attaining immortality, departed with him. By the time of Gao Xin, he again served as Rain Master. The Rain Masters of today trace their origin to him.\n\n*O so distant, Chisongzi!*\n*O so ethereal, the maiden!*\nHand in hand they soared in flight,\nsuddenly aloft as one.\nThey cast themselves upon the long winds,\nin an instant winging to the Dark Garden.\nProfoundly attuned to *xun* and *kan* (wind and water),\nthey set the model for the office of Rain Master.\n\n**Ning Fengzi**\nNing Fengzi lived in the time of the Yellow Emperor. The age transmitted that he served as the Yellow Emperor’s Pottery Master. A man once passed by and, tending his kiln fires, could emit smoke of five colors. Over time, he taught this art to Fengzi. Fengzi amassed fire and burned himself, ascending and descending with the smoke and qi. When his ashes were examined, his bones remained intact. The people of that time buried him together on Mount Ning in the north, and so he was called Ning Fengzi.\n\n*Wondrous indeed, Fengzi,*\n*marvelously endowed by nature!*\nHis essence refined in the great furnace,\nhis qi flowing freely in five-hued smoke.\nHis bones left among the ashes,\nentombed on tranquil Mount Ning.\nMen beheld his traces,\nbut who could fathom his mysteries?\n\n**Ma Shihuang**",
      "overlap_context": "",
      "start_char": 1,
      "end_char": 369,
      "start_sentence": 0,
      "end_sentence": 33,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.193296194076538,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "马师皇者，黄帝时马医也。 知马形生死之诊，治之辄愈。 后有龙下向之，垂耳张口。 皇日：此龙有病，知我能治。 乃缄其唇下口中，以甘草扬饮之而愈。 后数数有疾龙出其波，告而求治之。 一旦，龙负皇而去。 师皇典马，底无残驷。 精感掌龙，术兼殊类。 灵此报德，弥鳞衔辔。 振跃天汉，集有遗蔚。 赤将子舆 赤将子舆者，黄帝时人。 不食五谷而瞰百草花。 至尧帝时，为木工，能随风雨上下。 时时於市中卖缴，亦谓之缴父。 云： 蒸民粒食，孰享遐祚。 子舆拔俗，餐葩饮露。 托身风雨，遥然娇步。 云中可游，性命可度。 黄帝 黄帝者，号日轩辕。 能劾百神，朝而使之。 弱而能言，圣而预知，知物之纪。 自以为云师，有龙形。 自择亡日，与旱臣辞。 至於卒，还葬桥山。 山崩，柩空无尸，唯剑乌在焉。 仙书云：黄帝采首山之铜，铸鼎於荆山之下。 鼎成，有龙垂胡髯下迎帝，乃升天。 草臣百僚悉持龙髯，从帝而升攀，帝弓及龙髯，拔而弓坠，草臣不得从，仰#1而悲号，故后世以其处为鼎湖，名其弓为乌号焉。 神圣渊玄，邈哉帝皇。 堑莅万物，冠名百王。",
      "translated_text": "**Ma Shihuang**\n\nMa Shihuang was a horse physician in the time of the Yellow Emperor. He understood the living and dying signs in a horse’s form, and whenever he treated them, they invariably recovered. Later, a dragon descended before him, ears drooping and mouth agape. Shihuang said, “This dragon is ill and knows I can heal it.” He then stitched its lower lip to its mouth and administered a decoction of licorice, whereupon it recovered. Thereafter, dragons with ailments would often emerge from the waves to seek his treatment. One day, a dragon bore Shihuang away upon its back.\n\n*Master Shihuang tended horses,*\n*never a flawed steed remained.*\n*His skill moved even dragons,*\n*his art spanned all creatures.*\n*In gratitude for his virtue,*\n*they bore him aloft with bridle in jaws.*\n*Soaring through the celestial river,*\n*he left behind only his legacy.*\n\n**Chi Jiang Ziyu**\n\nChi Jiang Ziyu was a man of the Yellow Emperor’s time. He ate no grains but subsisted on the flowers of a hundred herbs. By the reign of Emperor Yao, he worked as a carpenter, able to ascend and descend with the wind and rain. Often in the marketplace, he sold fishing lines, and so was also called *Father of the Line*.\n\n*The common folk live on grain,*\n*who enjoys such distant blessing?*\n*Ziyu transcended the world,*\n*feasting on blossoms, drinking dew.*\n*He entrusted himself to wind and rain,*\n*his steps light and free.*\n*He could wander the clouds,*\n*and cross the bounds of life.*\n\n**The Yellow Emperor**\n\nThe Yellow Emperor was styled Xuanyuan. He could summon the hundred spirits and command them at court. Though young, he could speak; though sagely, he foresaw all things, knowing the principles of creation. He called himself *Master of the Clouds* and bore the form of a dragon. He chose his own day of departure and took leave of his ministers. When he died, he was buried at Mount Qiao. The mountain collapsed, and his coffin was found empty, save for his sword and cap.\n\nThe *Book of Transcendents* states: The Yellow Emperor mined copper from Mount Shou and cast a tripod beneath Mount Jing. When the tripod was completed, a dragon descended with its whiskers trailing to welcome the Emperor, who then ascended to heaven. His ministers and officials all grasped the dragon’s whiskers and followed, clambering upward. The Emperor’s bow and the dragon’s whiskers snapped, and the bow fell. The ministers could not follow and, gazing up, wailed in sorrow. Thus, the place was later called *Tripod Lake*, and the bow was named *Crow’s Wail*.\n\n*Profound and divine,*\n*how vast the Emperor’s majesty!*\n*He governed the ten thousand things,*\n*and his name crowned a hundred kings.*",
      "overlap_context": "lf, ascending and descending with the smoke and qi. When his ashes were examined, his bones remained intact. The people of that time buried him together on Mount Ning in the north, and so he was called Ning Fengzi.\n\n*Wondrous indeed, Fengzi,*\n*marvelously endowed by nature!*\nHis essence refined in the great furnace,\nhis qi flowing freely in five-hued smoke.\nHis bones left among the ashes,\nentombed on tranquil Mount Ning.\nMen beheld his traces,\nbut who could fathom his mysteries?\n\n**Ma Shihuang**",
      "start_char": 369,
      "end_char": 819,
      "start_sentence": 34,
      "end_sentence": 67,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.419155836105347,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "化周六合，数通无方。 假葬桥山，超升昊苍。 倔佺 倔佺者，槐山采药父也。 好食松实。 形体生毛，长数寸。 两目更方。 能飞，行逐走马。 以松子遗尧，尧不暇服也。 松者，简松也。 时人受服者，皆至二三百岁焉。 倔佺饵松，体逸眸方。 足蹑鸾凤，走超腾酿。 遗赠尧门，贻此神方。 尽性可辞，中智宜将。 容成公 容成公者，自称黄帝师，见於周穆王。 能善补导之事，取精於玄牝。 其要谷神不死，守生养气者也。 发白更黑，齿落更生，事与老子同。 亦云老子师也。 亹亹容城#2，专气致柔。 得一在昔，含光独游。 道贯黄庭，伯阳仰俦。 玄牝之门，庶几可求。 方回 方回者，尧时隐人也。 尧聘以为阎士。 炼食云母，亦与民人有病者。 隐於五柞山中。 夏启末，为宦士。 为人所劫，闭之室中，从求道。 回化而得去，更以方回掩封其户。 时人言：得回一丸泥涂门户，终不可开。 方回颐生，隐身五柞。 咀嚼云英，栖心隙漠。 却闭幽室，重关自廓。 印改掩封，终焉不落。 老子 老子姓李，名耳，字伯阳，陈人也。 生於殷时，为周柱下史。 好养精气，贵接而不施。",
      "translated_text": "The Way transformed the Six Directions, its reckoning boundless and without limit. Though buried in semblance at Mount Qiao, he transcended to ascend the azure heavens.\n\n**Juequan**\nJuequan was a gatherer of herbs on Mount Huai. He favored eating pine seeds. His body grew hair several inches long, and his eyes became square. He could fly, outrunning galloping horses. He once gifted pine seeds to Emperor Yao, who had no time to consume them. These pines were the *jian* pine. Those of his time who partook of them all lived to two or three hundred years. Juequan, nourished by pine, moved with ease, his gaze sharp and square. His feet trod upon simurghs and phoenixes, his steps swift as soaring wine. He bestowed this divine recipe at Yao’s gate, a gift of this wondrous method. Those of perfect nature may decline it, but those of middling wisdom would do well to receive it.\n\n**Master Rongcheng**\nMaster Rongcheng claimed to be the teacher of the Yellow Emperor and was seen by King Mu of Zhou. He excelled in the arts of supplementation and guiding, drawing essence from the Mysterious Female. His essential teaching was that the Valley Spirit does not die—those who guard life and nurture qi. His white hair turned black again, and fallen teeth regrew, matters in which he was akin to Laozi. Some also say he was Laozi’s teacher. Diligent was Master Rongcheng, refining qi to achieve suppleness. Having attained the One in ancient times, he wandered alone, his light concealed. The Dao pierced the Yellow Court, and Bo Yang looked up to him as a peer. The gate of the Mysterious Female—this may well be sought.\n\n**Fanghui**\nFanghui was a recluse of Yao’s time. Yao summoned him to serve as a gatekeeper. He refined and consumed mica, also sharing it with the common folk who were ill. He concealed himself in the Five Oak Mountains. In the late reign of Xia Qi, he became a palace attendant. Once seized by bandits and shut in a chamber, he was pressed to impart the Dao. Fanghui transformed and escaped, then sealed the door with his own hand. The people of the time said: \"With a single pellet of Fanghui’s mud, one could seal a door forever unopened.\" Fanghui, his life preserved, hid himself among the Five Oaks. Chewing mica blossoms, his heart dwelled in emptiness. Though shut in a secluded chamber, he unbarred its heavy gates himself. The seal he pressed remained unbroken, never to fall.\n\n**Laozi**\nLaozi’s surname was Li, his given name Er, and his courtesy name Boyang. He was a native of Chen. Born in the Yin dynasty, he served as the Archivist beneath the Zhou pillars. He cherished the nurturing of essence and qi, valuing reception over bestowal.",
      "overlap_context": "lcome the Emperor, who then ascended to heaven. His ministers and officials all grasped the dragon’s whiskers and followed, clambering upward. The Emperor’s bow and the dragon’s whiskers snapped, and the bow fell. The ministers could not follow and, gazing up, wailed in sorrow. Thus, the place was later called *Tripod Lake*, and the bow was named *Crow’s Wail*.\n\n*Profound and divine,*\n*how vast the Emperor’s majesty!*\n*He governed the ten thousand things,*\n*and his name crowned a hundred kings.*",
      "start_char": 820,
      "end_char": 1283,
      "start_sentence": 68,
      "end_sentence": 109,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.211012601852417,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "转为守藏史，积八十余年，《史记》云二百余年。 时称为隐君子，谧日聪。 仲尼至周，见老子，知其圣人，乃师之。 后周德衰，乃乘青牛车去。 入大秦，过西关，关令尹喜待而迎之。 知真人也，乃强使着书，作《道德经》，上下二卷。 老子无为，而无不为。 道一生死，迹入灵奇。 塞兑内镜，冥神绝涯。 德合元气，寿同两仪。 关令尹 关令尹喜者，周大夫也。 善内学，常服精华，隐德修行，时人莫知。 老子西游，喜先见其黑，知有真人当过，物色而遮之，果得老子。 老子亦知其奇，为着书授之。 后与老子俱游流沙化胡#3苣胜实，莫知其所终。 尹喜亦自着书九篇，号日《关令子》。 尹喜抱关，含德为务。 抱漱日华，仰玩玄度。 候气真人，介焉独悟。 俱济流沙，同归妙趣。 涓子 涓子者，齐人也。 好饵木，接食其精。 至三百年，乃见於齐。 着《天人经》四十八篇。 后钓於荷泽，得鲤鱼，腹中有符。 隐於岩山，能致风雨。 受伯阳九仙法。 淮南山#4安，少得其文，不能解其旨也。 其《琴心》三篇有条理焉。 涓老饵木，享兹遐纪。 九仙既传，三才乃理。 赤鲤投符，风云是使。 批琴幽岩，高楼遐峙。 吕尚 吕尚者，冀州人也。",
      "translated_text": "He was later appointed Keeper of the Archives, holding the post for over eighty years—*Records of the Grand Historian* states over two hundred. At the time, he was known as a reclusive gentleman, posthumously titled \"the Wise.\" When Confucius journeyed to Zhou, he met Laozi and, recognizing him as a sage, took him as his teacher.\n\nLater, as the virtue of Zhou declined, Laozi departed in a carriage drawn by a green ox. Entering the land of Da Qin, he passed through the Western Pass, where the magistrate Yin Xi awaited and welcomed him. Knowing him to be a perfected one, Yin Xi pressed him to write a book, and so Laozi composed the *Dao De Jing* in two scrolls, upper and lower.\n\nLaozi embodied non-action, yet nothing lay beyond his action. The Dao unifies life and death, its traces entering the numinous and wondrous. Stopping the senses and turning the inner mirror, he merged with the obscure, transcending all bounds. His virtue harmonized with the primordial qi, his lifespan matching the Two Modes.\n\n**Magistrate Yin Xi**\nMagistrate Yin Xi of the Pass was a grandee of Zhou. Skilled in esoteric learning, he constantly refined his essence and consumed the flower of vitality, cultivating hidden virtue and practicing self-cultivation, unknown to his contemporaries. When Laozi journeyed west, Yin Xi first saw his aura of darkness and knew a perfected one would pass through. He sought him out and intercepted him, and indeed, it was Laozi. Laozi, recognizing his extraordinary nature, wrote a book and transmitted it to him. Later, they traveled together beyond the Flowing Sands, transforming the Hu barbarians—some say with *jujube seeds*—and none knew where they ultimately vanished.\n\nYin Xi also wrote nine chapters himself, titled *The Master of the Pass*. Yin Xi guarded the pass, embracing virtue as his duty. He rinsed his mouth with the sun’s radiance, gazing upward to contemplate the profound measure. Awaiting the qi of the perfected one, he alone awakened. Together they crossed the Flowing Sands, attaining the same wondrous end.\n\n**Master Juan**\nMaster Juan was a native of Qi. He favored consuming wood, absorbing its essence. After three hundred years, he appeared in Qi and composed the *Canon of Heaven and Man* in forty-eight chapters. Later, while fishing at Lotus Marsh, he caught a carp whose belly bore a talisman. He withdrew to Rock Mountain, where he could summon wind and rain. He received the Nine Immortals’ Method from Boyang.\n\nThe Prince of Huainan, Liu An, obtained his writings in his youth but could not fathom their meaning. His three-chapter *Zither Heart* was well-ordered.\n\nJuan the Elder consumed wood, enjoying a distant span of years. Once the Nine Immortals’ Method was transmitted, the Three Powers were set in order. The red carp delivered the talisman, and he commanded wind and clouds. Striking the zither in secluded cliffs, his lofty abode stood afar.\n\n**Lü Shang**\nLü Shang was a native of Jizhou.",
      "overlap_context": " his life preserved, hid himself among the Five Oaks. Chewing mica blossoms, his heart dwelled in emptiness. Though shut in a secluded chamber, he unbarred its heavy gates himself. The seal he pressed remained unbroken, never to fall.\n\n**Laozi**\nLaozi’s surname was Li, his given name Er, and his courtesy name Boyang. He was a native of Chen. Born in the Yin dynasty, he served as the Archivist beneath the Zhou pillars. He cherished the nurturing of essence and qi, valuing reception over bestowal.",
      "start_char": 1283,
      "end_char": 1770,
      "start_sentence": 110,
      "end_sentence": 146,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.032738208770752,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "生而内智，预见存亡。 避纣之乱，隐於辽束四十年。 西适周，匿於南山，钓於墦溪，三年不获鱼。 比闻皆曰：可已矣。 尚曰：非尔所及也。 已而果得《兵钤》於鱼腹中。 文王梦得圣人，闻尚，遂载而归。 至武王伐纣，尝作《阴谋》百余篇。 服泽芝地髓，具二百年而告亡。 有难而不葬，后子伋葬之，无尸，唯有《玉钤》六篇在棺中云。 吕尚隐钓，瑞得赦鳞。 通梦西伯，同乘入臣。 沈谋籍世，芝体炼身。 远代所称，美哉天人。 啸父 啸父者，冀州人也。 少在西周市上补履数十年，人不知也。 后奇其不老，好事者造求其术，不能得也。 唯梁母得其作火法。 临上三亮上，与梁母别，列数十火而升。 西邑多奉祀之。 啸父驻形，年衰不迈。 梁母遇之，历虚启会。 丹火翼辉，紫烟成盖。 眇企升云，抑绝华泰。 师门 师门者，啸父弟子也。 亦能使火，食桃李葩。 为夏孔甲龙师。 孔甲不能顺其意，杀而埋之外野。 一日一风雨迎之，讫，则山木皆焚。 孔甲祠而梼之，还而道死。 师门使火，赫炎其势。 乃豢儿龙，潜灵隐惠。 夏王虐之，神存质毙。 风雨既降，肃尔高逝。 务光 务光者，夏时人也。 耳长七寸。 好琴，服蒲韭根。 殷汤将伐纣，因光而谋。 光曰：非吾事也。 汤曰：孰可？ 曰：吾不知也。 汤曰：伊尹何如？ 曰：强力忍诟，吾不知其他。 汤既克桀，以天下让於光，曰：智者谋之，武者遂之，仁者居之，古之道也。 吾子胡不遂之？ 请相吾子。",
      "translated_text": "Born with inner wisdom, he foresaw survival and ruin. To escape the chaos of King Zhou, he concealed himself in the eastern lands of Liaodong for forty years. Journeying west to Zhou, he hid in the Southern Mountains, fishing at Pan Creek for three years without catching a single fish. Those around him all said, \"You should stop.\" Lü Shang replied, \"This is not something you understand.\" Soon after, he indeed found the *Military Talisman* within a fish’s belly. King Wen dreamed of a sage and, hearing of Lü Shang, carried him back in his chariot. When King Wu later campaigned against Zhou, Lü Shang composed over a hundred chapters of *Secret Strategies*. He consumed灵芝 and earth marrow, living fully two hundred years before passing away. When trouble arose, he was not buried; later, his son Lü Ji interred him, but no body was found—only six chapters of the *Jade Talisman* remained in the coffin.\n\nLü Shang concealed himself in fishing, auspiciously obtaining the scaled talisman. Through a dream, he met the Lord of the West, riding together into service. His profound strategies aided the age, his body refined by sacred herbs. Praised through distant generations, how splendid the Heavenly Man!\n\n**Xiaofu**\nXiaofu was a native of Jizhou. In his youth, he mended shoes in the western Zhou marketplace for decades, unknown to others. Later, people marveled at his agelessness, and the curious sought his arts, but none succeeded. Only Liang Mu obtained his method for making fire. As he ascended the Three Bright Peaks to bid Liang Mu farewell, he arrayed dozens of fires and rose into the heavens. The people of the western towns widely worshipped him.\n\nXiaofu preserved his form, his years neither waning nor advancing. Liang Mu encountered him, their meeting transcending the void. Crimson flames spread their radiance, purple mist formed a canopy. Gazing upward, he ascended into the clouds, leaving worldly splendor behind.\n\n**Shimen**\nShimen was a disciple of Xiaofu. He, too, could command fire and consumed peach and plum blossoms. He served as the dragon master for Xia Kongjia. When Kongjia failed to heed his will, he killed and buried him in the wild. The next day, wind and rain came to greet him, and when it ceased, the mountain’s trees were all scorched. Kongjia offered sacrifices and prayed, but upon returning, he died on the road.\n\nShimen wielded fire, its might blazing and fierce. He reared dragons in secret, concealing his numinous wisdom. The Xia king oppressed him, his spirit enduring though his form perished. After wind and rain descended, he departed in solemn ascent.\n\n**Wu Guang**\nWu Guang was a man of the Xia era. His ears measured seven inches long. He loved the zither and consumed cattail and leek roots. When Tang of Yin was about to campaign against Zhou, he consulted Wu Guang. Guang said, \"This is not my affair.\" Tang asked, \"Who is suitable?\" He replied, \"I do not know.\" Tang said, \"What of Yi Yin?\" Guang answered, \"He is strong and endures disgrace—I know nothing beyond that.\" After Tang conquered Jie, he offered the realm to Guang, saying, \"The wise plan it, the martial achieve it, the benevolent dwell in it—this is the ancient Way. Why do you not accept it?\" He begged to serve as Guang’s minister.",
      "overlap_context": "om Boyang.\n\nThe Prince of Huainan, Liu An, obtained his writings in his youth but could not fathom their meaning. His three-chapter *Zither Heart* was well-ordered.\n\nJuan the Elder consumed wood, enjoying a distant span of years. Once the Nine Immortals’ Method was transmitted, the Three Powers were set in order. The red carp delivered the talisman, and he commanded wind and clouds. Striking the zither in secluded cliffs, his lofty abode stood afar.\n\n**Lü Shang**\nLü Shang was a native of Jizhou.",
      "start_char": 1770,
      "end_char": 2349,
      "start_sentence": 147,
      "end_sentence": 195,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.927441358566284,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "光辞曰：废上，非义也； 杀人，非仁也； 人犯其难，我享其利，非廉也。 吾闻非义不受其禄，无道之世不践其位，死於尊我？ 我不忍久见也。 遂负石自沈于寥水，已而自匿。 后四百余岁，至武丁时复见。 武丁欲以为相，不从。 武丁以舆迎而从逼，不以礼，遂投浮梁山。 后游尚父山。 务光自仁，服食养真。 冥游方外，独步常均。 武丁虽高，议位不臣。 负石自沉，虚无其身。 仇生 仇生者，不知何所人也。 当殷汤时，为木正。 三十余年而更壮，皆知其奇人也，咸共师奉之。 常食松脂，在尸乡北山上自作石室。 至周武王，幸其室而祀之。 异哉仇生，靡究其向。",
      "translated_text": "Wu Guang declined, saying: \"To depose a ruler is not righteous; to kill men is not benevolent; to let others face peril while I enjoy the gains is not upright. I have heard that one who is not righteous does not accept its emoluments, and in an age without the Way, one does not tread its ranks—would I die for exalting myself? I cannot bear to remain in sight for long.\" Thereupon he carried a stone and drowned himself in the Liao River, then concealed himself. Over four hundred years later, he reappeared in the time of Wu Ding. Wu Ding wished to appoint him as minister, but he refused. Wu Ding sent a carriage to press him, yet without proper ritual, so Guang fled to Mount Fuliang. Later he wandered to Mount Shangfu. Wu Guang cultivated benevolence, consumed herbs to nurture his true nature, roamed obscurely beyond the world, and walked alone in constant equilibrium. Though Wu Ding was noble, Guang debated rank and would not serve. Carrying a stone to sink himself, he made his body as nothing.\n\n**Qiu Sheng**\nQiu Sheng was a man of unknown origin. In the time of Tang of Yin, he served as Minister of Wood. For over thirty years, he grew ever more vigorous, and all knew him as an extraordinary man, revering and following him as their teacher. He often ate pine resin and, on the northern mountain of Shixiang, built his own stone chamber. By the time of King Wu of Zhou, the king visited his chamber and made offerings to him. How wondrous was Qiu Sheng—his course could not be fathomed.",
      "overlap_context": "g of Yin was about to campaign against Zhou, he consulted Wu Guang. Guang said, \"This is not my affair.\" Tang asked, \"Who is suitable?\" He replied, \"I do not know.\" Tang said, \"What of Yi Yin?\" Guang answered, \"He is strong and endures disgrace—I know nothing beyond that.\" After Tang conquered Jie, he offered the realm to Guang, saying, \"The wise plan it, the martial achieve it, the benevolent dwell in it—this is the ancient Way. Why do you not accept it?\" He begged to serve as Guang’s minister.",
      "start_char": 2349,
      "end_char": 2609,
      "start_sentence": 196,
      "end_sentence": 216,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.937457799911499,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "治身事君，老而更壮。 灼灼容颜，怡怡德量。 武王祠之，北山之上。 彭祖 彭祖者，殷大夫也。 姓钱名铿，帝颛顼之孙，陆终氏之中子。 历夏至殷末，八百余岁。 常食桂芝，善导引行气。 历阳有彭祖仙室，前世梼请风雨，莫不辄应。 常有两虎在祠左右，祠讫，地即有虎迹云。 后升仙而去。 遐哉硕仙，时惟彭祖。 道与化新，绵绵历古。 隐伦玄室，灵着风雨。 二虎啸时，莫我猜侮。 邛疏 邛疏者，周封史也。 能行气炼形，煮石髓而服之，谓之石锺乳。 至数百年，往来入太室山中，有外石状枕焉。 八珍促寿，五石延生。 那疏得之，炼髓饵精。 人以百年，行迈身轻。 寝息中狱，游步仙庭。 介子惟 介了推者，姓王名光，晋人也。 隐而无名。 悦赵成子，与游。",
      "translated_text": "To cultivate the self and serve the lord, he grew stronger with age. His countenance shone bright, his virtue and magnanimity ever serene. King Wu made offerings to him upon the northern mountain.\n\n**Peng Zu**\nPeng Zu was a grandee of Yin. His surname was Qian, given name Keng, grandson of Emperor Zhuanxu and middle son of Lu Zhong. From the Xia to the end of Yin, he lived over eight hundred years. He often consumed cassia and lingzhi, skilled in guiding and pulling to circulate qi. In Liyang stood Peng Zu’s immortal chamber, where prayers for wind and rain in former times were never left unanswered. Two tigers were always by the shrine’s side; when the rites concluded, tiger tracks would appear upon the ground. Later, he ascended as an immortal and departed.\n\nHow vast the great immortal—none but Peng Zu in his time. His Dao ever renewed with transformation, enduring through the ages. Hidden in the mysterious chamber, his spirit manifested in wind and rain. When the two tigers roared, none dared mock or slight him.\n\n**Qiong Shu**\nQiong Shu was a scribe of Zhou. He could circulate qi to refine his form, boiling stone marrow to consume it, calling it \"stone stalactite.\" Living for several hundred years, he came and went within Mount Tai Shi, where an outer stone stood like a pillow. The eight delicacies shorten life, the five minerals prolong it. Qiong Shu attained this, refining marrow and ingesting essence. While others lived a hundred years, he walked with light steps. Resting in the central prison, strolling through immortal courts.\n\n**Jie Zitui**\nJie Zitui, surnamed Wang, given name Guang, was a man of Jin. He lived in reclusion, unknown. Delighting in Zhao Chengzi, he traveled with him.",
      "overlap_context": "ing.\n\n**Qiu Sheng**\nQiu Sheng was a man of unknown origin. In the time of Tang of Yin, he served as Minister of Wood. For over thirty years, he grew ever more vigorous, and all knew him as an extraordinary man, revering and following him as their teacher. He often ate pine resin and, on the northern mountain of Shixiang, built his own stone chamber. By the time of King Wu of Zhou, the king visited his chamber and made offerings to him. How wondrous was Qiu Sheng—his course could not be fathomed.",
      "start_char": 2609,
      "end_char": 2928,
      "start_sentence": 217,
      "end_sentence": 243,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.703142881393433,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "日一有黄雀在门上，晋公子重耳异之，与出居外十余年，劳苦不辞。 及还介山，伯子常晨来呼推曰：可去矣。 推辞母入山中，从伯子常游。 从文公遣数千人以玉帛礼之，不出。 后三十年，见东海边，为王俗卖扇。 后数十年，莫知所在。 王光沈默，享年遐久。 出翼霸君，处契玄友。 推禄让勤，何求何取。 逐影介山，浪迹海右。 ． 马丹 马丹者，晋耿之人也。 当文候时，为大夫。 至献公时，复为幕府正。 献户公灭耿，杀恭太子，丹乃去。 至赵宣子时，乘安车入晋都，候诸大夫。 灵公欲仕之，逼不以礼。 有迅风发屋，丹入回风中而去。 北方人尊而祠之。 马丹官晋，与时汗隆。 事文去献，显没不穷。 密纲将设，从礼迅风。 杳然独上，绝迹玄宫。 平常生 谷城乡平常生者，不知何所人也。 数死复生，时人以为不然。 后大水出，所害非一，而平辄在缺门山头大呼，言：平常生在此。 云复水雨五日，必止。 止则上山求祠之，但见平衣被革带。 后数十年，复为华阴门卒。 谷城妙匹，谲达奇逸。 出生入死，不悄其质。 玄化忘形，贵贱奚恤。 暂降尘污，终腾云室。 陆通 陆通者，云楚狂接舆也。 好养生，食弃卢木实乃芜菁子。 游诸名山，在蜀峨媚山上，世世见之，历数百年去。 接舆乐道，养性潜辉。 见讽尼父，论以凤衰。",
      "translated_text": "A yellow sparrow once alighted upon his gate, and Duke Wen of Jin, Chong'er, found it strange. Jie Zitui accompanied him into exile abroad for over a decade, enduring hardship without complaint. When they returned to Mount Jie, Bo Zichang came at dawn to call Zitui, saying, \"You may depart now.\" Zitui declined, taking his mother into the mountains, where he roamed with Bo Zichang. Later, Duke Wen sent thousands bearing jade and silk to honor him, yet he did not emerge. Thirty years after, he appeared on the shores of the Eastern Sea, selling fans to the king’s subjects. Decades later still, none knew his whereabouts.\n\nWang Guang lived in silence, his years long and distant. He aided the rise of a hegemon, dwelling among profound friends. Zitui’s toil was in service and yielding—what did he seek, what did he take? He followed his shadow to Mount Jie, wandering the eastern shores.\n\n**Ma Dan**\nMa Dan was a man of Jin from Geng. During the reign of Marquis Wen, he served as a grandee. By the time of Duke Xian, he again held the post of chief of the military secretariat. When Duke Xian of Jin destroyed Geng and killed the reverent crown prince, Dan departed. By the era of Zhao Xuanzi, he rode a comfortable carriage into the Jin capital, paying respects to the grandees. Lord Ling wished to employ him, pressing him without propriety. A fierce wind tore the roofs from houses, and Dan entered the whirlwind and vanished. The people of the north revered and sacrificed to him.\n\nMa Dan served Jin through its rises and falls. He attended Marquis Wen and left Duke Xian, his fame enduring beyond his time. When the net of fate was cast, he followed propriety into the swift wind. Alone he ascended, vanishing into the dark palace, his traces gone.\n\n**Ping Changsheng**\nPing Changsheng of Gucheng Village was of unknown origin. He died and revived many times, which people found unbelievable. Later, a great flood arose, claiming countless lives, yet Ping stood atop the broken gate of the mountain, shouting, \"Ping Changsheng is here!\" He declared that the rain and flood would cease in five days—and so it did. When the waters receded, those who climbed the mountain to offer sacrifices found only Ping’s clothes, belt, and sandals. Decades later, he reappeared as a gatekeeper in Huayin. The marvel of Gucheng, enigmatic and free, passed between life and death, his essence unchanged. His transformations transcended form; what did he care for rank or station? Briefly descending to the dust, he ultimately soared into the clouded chambers.\n\n**Lu Tong**\nLu Tong was the famed \"Madman of Chu,\" Jie Yu. He cultivated life, eating the fruit of the *qilumu* tree and the seeds of turnips. He wandered famous mountains, dwelling on the peaks of Mount Emei in Shu, where he was seen for generations. After hundreds of years, he departed.\n\nJie Yu delighted in the Dao, nurturing his nature in hidden radiance. He satirized Confucius, discoursing on the decline of the phoenix.",
      "overlap_context": ", he came and went within Mount Tai Shi, where an outer stone stood like a pillow. The eight delicacies shorten life, the five minerals prolong it. Qiong Shu attained this, refining marrow and ingesting essence. While others lived a hundred years, he walked with light steps. Resting in the central prison, strolling through immortal courts.\n\n**Jie Zitui**\nJie Zitui, surnamed Wang, given name Guang, was a man of Jin. He lived in reclusion, unknown. Delighting in Zhao Chengzi, he traveled with him.",
      "start_char": 2928,
      "end_char": 3456,
      "start_sentence": 244,
      "end_sentence": 284,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.284165620803833,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "纳气以和，存心以微。 高步灵岳，长啸峨媚。 葛由 葛由者，羌人也。 周成王时，好刻木羊卖之。 一旦骑羊而入西蜀，蜀中王侯贵人追之，上绥山。 绥山在峨媚山西南，高无极也。 随之者不复还，皆得仙道。 故里谚曰：得绥山一桃，虽不得仙，亦足以豪。 山下立祠数十处云： 木可为羊，羊亦可灵。 灵在葛由，一致无经。 爰陆崇绥，舒翼扬声。 知卫者仙，得桃者荣。 江妃二女 江妃二女者，不知何所人也。 出游於江汉之湄，逢郑交甫，见而悦之，不知其神人也。 谓其仆曰：我欲下请其佩。 仆曰：此问之人皆习於辞，不得，恐罹悔焉。 交甫不听，遂下，与之言曰：二女劳矣。 二女曰：客子有劳，妾何劳之有？ 交甫曰：橘是柚也，我盛之以笋，令附汉水，将流而下。 我遵其傍，采其芝而茹之，以知吾为不逊也。 愿请子之佩。 二女曰：橘是柚也，我盛之以莒，令附汉水，将流而下。 我遵其旁，采其芝而如之。 遂手解佩与交甫。 交甫悦，受而怀之中当心。 趋去数十步，视佩，空怀无佩。 顾二女，忽然不见。 灵妃艳逸，时见江湄。 丽服微步，流盼生姿。 交甫遇之，凭情言私。 呜佩虚掷，绝影焉追。 范蠡 范蠡字少伯，徐人也。 事周，师太公望。 好服柱饮水，为越大夫，佐勾践破昊。 后乘轻舟入海，变名姓，适齐，为鸦夷子。 更后百余年，见於陶，为陶朱君。 财累亿万，号陶朱公。 后弃之，兰陵卖药，后人世世识见之。 范蠡御桂，心虚志远。 受业师望，载潜载惋。 龙见越乡，功遂身返。 屐脱千金，与道舒卷。 琴高 琴高者，赵人也。 以鼓琴为宋康王舍人。 行涓、彭之卫，浮游冀州、涿一作码郡之问。 二百余年后，辞入琢水中取龙子，与诸弟子期曰：皆洁斋，待於水傍设祠。 果乘赤鲤来，出坐祠中。 旦有万人观之。 留一月余，复入水去。",
      "translated_text": "Inhaling qi to harmonize, preserving the heart in subtlety,\nHe strode the sacred peaks, his long whistle echoing on Mount Emei.\n\n**Ge You**\nGe You was a Qiang tribesman. During the reign of King Cheng of Zhou, he carved wooden sheep to sell. One day, he mounted a sheep and entered western Shu. The kings, marquises, and nobles of Shu pursued him, ascending Mount Sui. Mount Sui lies southwest of Mount Emei, its height boundless. Those who followed him never returned, all attaining the Dao of immortality. Thus, a local saying goes: *\"Obtain one peach from Mount Sui, and though you may not become immortal, you shall yet be proud.\"* Dozens of shrines stand at the mountain’s base, inscribed:\n*Wood may become sheep,\nSheep too may gain spirit.\nThe spirit rests in Ge You,\nUnfettered by any path.*\nSoaring high on Mount Sui,\nHe spread his wings and raised his voice.\nThose who knew defense became immortals,\nThose who gained the peach found glory.\n\n**The Two Jiang Fei**\nThe two Jiang Fei were of unknown origin. They appeared along the banks of the Jiang and Han rivers, where they encountered Zheng Jiaofu. Enamored at first sight, he did not know they were divine beings. He told his servant, *\"I wish to descend and ask for their pendants.\"* The servant replied, *\"The people here are skilled in speech. If you fail, you may regret it.\"* Jiaofu ignored him and went down, saying to the women, *\"You two must be weary.\"* They replied, *\"You, traveler, are the weary one—what weariness do we have?\"* Jiaofu said, *\"The orange is a pomelo; I fill my basket with bamboo shoots, set it adrift on the Han River, and let it float downstream. I follow along its banks, plucking the sacred mushrooms to eat, knowing my own presumption. I humbly ask for your pendants.\"* The two women said, *\"The orange is a pomelo; we fill our basket with reeds, set it adrift on the Han River, and let it float downstream. We follow along its banks, plucking the sacred mushrooms as well.\"* Then they untied their pendants and gave them to Jiaofu. Delighted, he received them and pressed them to his chest. After hurrying away for several dozen paces, he looked at the pendants—his bosom was empty. Turning back, the two women had vanished.\n\nThe divine consorts, radiant and free,\nAppeared at times along the river’s edge.\nIn graceful robes, they moved with measured step,\nTheir glancing eyes bestowing charm.\nJiaofu met them, spoke his heart’s desire—\nThe jade pendants cast aside, their fleeting forms untraced.\n\n**Fan Li**\nFan Li, styled Shaobo, was a native of Xu. He served the Zhou court under the tutelage of Grand Duke Wang. Fond of cassia-scented garments and drinking only water, he became a minister of Yue and aided Goujian in defeating Wu. Later, he boarded a light boat and entered the sea, changing his name and surname. He went to Qi, where he was known as Yazi. Over a hundred years later, he appeared in Tao, becoming the Lord of Tao Zhu. His wealth accumulated to hundreds of millions, and he was called Lord Tao Zhu. Later, he abandoned it all, sold medicine in Lanling, and was recognized by later generations for centuries.\n\nFan Li, steering cassia-scented oars,\nHis heart empty, his aspirations distant.\nTaught by Master Wang, he harbored both concealment and sorrow.\nThe dragon appeared in Yue’s land—\nHis work done, he turned away.\nShedding his sandals of a thousand gold,\nHe flowed with the Dao’s ebb and swell.\n\n**Qin Gao**\nQin Gao was a native of Zhao. He served as a retainer to King Kang of Song, playing the zither. Practicing the arts of Juan and Peng, he wandered between Jizhou and Zhuo (or Ma) Commandery. Over two hundred years later, he announced his intention to enter the Zhuo River to retrieve a dragon’s offspring. He instructed his disciples, *\"All must purify yourselves and wait by the water, setting up a shrine.\"* Sure enough, he rode a red carp and emerged, sitting within the shrine. Tens of thousands came to witness him. After staying for over a month, he reentered the water and departed.",
      "overlap_context": "descending to the dust, he ultimately soared into the clouded chambers.\n\n**Lu Tong**\nLu Tong was the famed \"Madman of Chu,\" Jie Yu. He cultivated life, eating the fruit of the *qilumu* tree and the seeds of turnips. He wandered famous mountains, dwelling on the peaks of Mount Emei in Shu, where he was seen for generations. After hundreds of years, he departed.\n\nJie Yu delighted in the Dao, nurturing his nature in hidden radiance. He satirized Confucius, discoursing on the decline of the phoenix.",
      "start_char": 3457,
      "end_char": 4178,
      "start_sentence": 285,
      "end_sentence": 338,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.972978353500366,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "琴高晏晏，司乐宋宫。 离世孤逸，浮沉涿中。 出跃俯鳞，入藻清冲。 是任水解，其乐无穷。 寇先 寇先者，宋人也。 以钓鱼为业，居睢水旁百余年。 得鱼或放，或卖，或自食之。 常着冠带。 好种荔枝，食其葩实焉。 宋景公问其道，不告，即杀之。 数十年，踞宋城门，鼓琴数十日，乃去。 宋人家家奉杞焉。 寇先惜道，术不虚传。 景公戮之，尸解神迁。 历载五十，抚琴来旋。 夷俟宋门，畅意五弦。 王子乔 王子乔者，周灵王太子晋也。 好吹笙，作凤凰呜。 游伊、洛之问。 道士浮丘公接以上嵩高山。 三十余年后，求之於山上，见相良曰：告我家七月七日待我於堠氏山巅。 至时，果乘白鹤驻山头，望之不得到。 举手谢时人，数日而去。 亦立祠於猴氏山下及嵩高首焉。 妙哉王子，神游气爽。 笙歌伊洛，拟音凤响。 浮丘感应，接手俱上。 挥策青崖，假翰独往。 幼伯子 幼伯子者，周苏氏客也。 冬常着单衣，盛暑着懦垮。 形貌岁异。 后数十年更壮，时人莫知。",
      "translated_text": "Qin Gao, serene and poised, presided over music in Song’s palace.\nLeaving the world’s clamor, he drifted solitary,\nnow afloat, now submerged in Zhuo’s waters.\nEmerging, he leapt with lowered scales;\ndiving, he wove through clear, rushing currents.\nEntrusted to the water’s release,\nhis joy knew no bounds.\n\n**Kou Xian**\nKou Xian was a native of Song. He made his living by fishing, dwelling by the Sui River for over a hundred years. The fish he caught he sometimes released, sometimes sold, and sometimes ate. He always wore a cap and sash. Fond of planting lychee trees, he consumed their blossoms and fruit. When Duke Jing of Song inquired about his Way, he refused to reveal it, and the duke had him executed. Decades later, he appeared squatting at Song’s city gate, playing the zither for several days before departing. The people of Song honored him in every household.\n\nKou Xian cherished the Way—\nhis arts were not passed in vain.\nThough Duke Jing put him to death,\nhis corpse dissolved, his spirit ascended.\nFifty years passed,\nand he returned, plucking the zither.\nStraddling Song’s gate, he lingered,\nhis heart at ease with the five strings.\n\n**Prince Wangzi Qiao**\nPrince Wangzi Qiao was the eldest son of King Ling of Zhou. He delighted in playing the sheng, mimicking the phoenix’s cry. He wandered between the Yi and Luo Rivers. The Daoist master Fuqiu Gong carried him up Mount Songgao. Over thirty years later, when sought on the mountain, he appeared to Xiang Liang, saying: *\"Tell my family to await me on the seventh day of the seventh month at the summit of Mount Hou.\"* When the day arrived, he indeed rode a white crane to alight on the mountain’s peak, visible but unreachable. He raised his hand in farewell to the people of his time and departed after several days. Shrines were also established at the foot of Mount Hou and the summit of Mount Songgao.\n\nWondrous was Prince Wangzi,\nhis spirit roaming, his qi unclouded.\nHis sheng sang by the Yi and Luo,\nechoing the phoenix’s call.\nMoved by Fuqiu’s resonance,\nhand in hand they ascended.\nWielding his staff on the green cliffs,\nhe borrowed wings to journey alone.\n\n**Youbozi**\nYoubozi was a guest of the Su clan in Zhou. In winter, he always wore a single robe; in the height of summer, layered garments. His appearance changed with the years. Decades later, he grew more robust, yet none of his contemporaries recognized him.",
      "overlap_context": "zither. Practicing the arts of Juan and Peng, he wandered between Jizhou and Zhuo (or Ma) Commandery. Over two hundred years later, he announced his intention to enter the Zhuo River to retrieve a dragon’s offspring. He instructed his disciples, *\"All must purify yourselves and wait by the water, setting up a shrine.\"* Sure enough, he rode a red carp and emerged, sitting within the shrine. Tens of thousands came to witness him. After staying for over a month, he reentered the water and departed.",
      "start_char": 4179,
      "end_char": 4588,
      "start_sentence": 339,
      "end_sentence": 373,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.09135913848877,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "世世来诫佑苏氏，子孙得其福力也。 周客戢容，泯迹泥盘。 夏服重绩，冬振轻丸。 作不背本，义不独安。 乃眷周氏，佑其艰难。 安期先生 安期先生者，琅琊阜乡人也。 卖药於束海边，时人皆言千岁翁。 秦始皇束游，请见，与语三日三夜。 赐金璧，度数千万出於阜乡亭，皆置去。 留董曰，以赤玉乌一双为报，曰：后数年求我於蓬莱山。 始皇即遣使者徐市、卢生等数百人入海，未至蓬莱山，辄逢风波而还。 立祠阜乡亭海边十数处。 云： 寥寥安期，虚质高清。",
      "translated_text": "Generations came to admonish and protect the Su clan, and their descendants received his blessings of power.\n\nA guest of Zhou, he concealed his countenance,\nerasing his traces in the dust of the world.\nIn summer, he donned layered garments;\nin winter, he shook off light flakes of snow.\nHis deeds never betrayed his roots,\nhis righteousness never sought solitary ease.\nThus he turned his gaze to the Zhou clan,\naiding them through hardship and peril.\n\n**Master Anqi**\nMaster Anqi was a native of Fu Village in Langye. He sold medicines by the Eastern Sea, and the people of his time all called him the \"Millennial Elder.\" When the First Emperor of Qin journeyed east, he requested an audience and spoke with him for three days and three nights. The emperor bestowed gold and jade discs worth tens of millions, which were left at the pavilion of Fu Village. Master Anqi departed, leaving behind a letter that read: \"I offer a pair of red jade ravens in return. Seek me on Mount Penglai in several years.\" The First Emperor then dispatched envoys—Xu Fu, Lu Sheng, and hundreds of others—into the sea. Before reaching Mount Penglai, they invariably encountered winds and waves and returned. Shrines were established in over ten places by the sea near the pavilion of Fu Village.\n\nAh, vast and empty was Anqi,\nhis form ethereal, his essence lofty and pure.",
      "overlap_context": "ngzi,\nhis spirit roaming, his qi unclouded.\nHis sheng sang by the Yi and Luo,\nechoing the phoenix’s call.\nMoved by Fuqiu’s resonance,\nhand in hand they ascended.\nWielding his staff on the green cliffs,\nhe borrowed wings to journey alone.\n\n**Youbozi**\nYoubozi was a guest of the Su clan in Zhou. In winter, he always wore a single robe; in the height of summer, layered garments. His appearance changed with the years. Decades later, he grew more robust, yet none of his contemporaries recognized him.",
      "start_char": 4588,
      "end_char": 4804,
      "start_sentence": 374,
      "end_sentence": 388,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.015086889266968,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "乘光适性，保气延生。 聊悟秦始，遗宝阜亭。 将游蓬莱，绝影清泠。 桂父 桂父者，象林人也。 色黑，而时白，时黄，时赤。 南海人见而尊事之。 常服桂及葵，以龟脑和之，千丸十斤。 桂累世见之。 今荆州之南尚有桂丸焉。 伟哉桂父，挺直遐畿。 灵葵内润，丹桂外绥。 怡怡柔颜，代代同辉。 道播东南，奕世莫违。 瑕丘仲 瑕丘仲者，宁人也。 卖药於宁百余年，人以为寿矣。 地动舍坏，仲及里中数十家屋临水皆败。 仲死，民人取仲尸弃水中，收其药卖之。 仲披裘而从，诣之取药。 弃仲者惧，叩头求哀。 仲曰：恨汝使人知我耳。 吾去矣。 后为夫余胡王驿使，复来至宁。 北方谓之谪仙人焉。 瑕丘通玄，谪脱其迹。 人死亦死，泛焉言惜。 遨步观化，岂劳胡驿。 苟不睹本，谁知其谪。 酒客 酒客者，梁市上酒家人也。 作酒常美而售，日得万钱。 有过而逐之，主人酒常醉败，窍贫。 梁市中贾人多以女妻而迎之。 或去或来。",
      "translated_text": "Riding the light to align with nature, preserving qi to prolong life.\nIn fleeting enlightenment of the First Emperor of Qin, he left treasures at the pavilion of Fu Village.\nBound for Mount Penglai, his trace vanished in the limpid void.\n\n**Master Gui**\nMaster Gui was a man of Xianglin. His complexion was dark, yet at times white, at times yellow, at times red. The people of Nanhai saw him and revered him. He regularly consumed cassia and sunflower seeds, blending them with tortoise brain into a thousand pills weighing ten *jin*. For generations, cassia trees have borne witness to him. To this day, in the south of Jingzhou, cassia pills remain.\n\nAh, magnificent Master Gui,\nupright and steadfast in distant lands.\nThe numinous sunflower nourished within, the cinnabar cassia soothed without.\nHis countenance ever gentle, his radiance shone through the ages.\nThe Dao spread across the southeast, unbroken through generations.\n\n**Xiaqiu Zhong**\nXiaqiu Zhong was a man of Ning. He sold medicines in Ning for over a hundred years, and people considered him long-lived. When an earthquake struck and houses collapsed, Zhong and several dozen households in his village, their homes bordering the water, were all ruined. Zhong died, and the villagers cast his body into the water, taking his medicines to sell. Zhong, clad in furs, followed them, demanding his medicines back. Those who had discarded him grew fearful and kowtowed, begging for mercy. Zhong said: \"I regret that you have made others know of me. I shall depart.\" Later, he served as a courier for the king of the Fuyu Hu, returning once more to Ning. In the north, he was called the \"Banished Immortal.\"\n\nAh, Xiaqiu, master of the mysterious,\nbanished yet shedding his traces.\nMen die, and he too \"dies,\" yet how lightly he speaks of regret.\nWandering to observe the transformations of the world, why trouble the Hu couriers?\nIf one does not perceive the root, who would know he was banished?\n\n**The Wine Merchant**\nThe Wine Merchant was a man of the wine shop in the Liang market. His wine was always excellent and sold well, earning him ten thousand coins daily. When he was driven away for some offense, the shop’s wine turned sour and spoiled, leaving the owner impoverished. Many merchants in the Liang market offered their daughters in marriage to welcome him back. He came and went as he pleased.",
      "overlap_context": "age. Master Anqi departed, leaving behind a letter that read: \"I offer a pair of red jade ravens in return. Seek me on Mount Penglai in several years.\" The First Emperor then dispatched envoys—Xu Fu, Lu Sheng, and hundreds of others—into the sea. Before reaching Mount Penglai, they invariably encountered winds and waves and returned. Shrines were established in over ten places by the sea near the pavilion of Fu Village.\n\nAh, vast and empty was Anqi,\nhis form ethereal, his essence lofty and pure.",
      "start_char": 4804,
      "end_char": 5195,
      "start_sentence": 389,
      "end_sentence": 423,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.505558967590332,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "后百余岁来为梁丞，使民益种芋菜，曰：三年当大饥。 卒如其言，梁民不死。 五年，解印绶去，莫知其终焉。 酒客萧粹，寄沽梁肆。 何以标异？ 醇醴殊味。 屈身佐时，民用不匮。 解绂晨征，莫知所萃。 任光 任光者，上蔡人也。 善饵丹，卖於都市里问。 积八十九年，乃知是故时任光也，皆说如数十岁面颜。 后长老识之，赵简子。 聘与俱归。 常在梧．梯山上，三世不知所在。 晋人常服其丹也。 上蔡任光，能炼神丹。 年涉期颐，晔尔朱颜。 顷适赵子，纵任所安。 升轨相梯，高飞云端。 萧史 萧史者，秦穆公时人也。 善吹箫，能致孔雀、白鹤於庭。 穆公有女字弄玉，好之，公遂以女妻焉。 日教弄玉作凤鸣。 居数年，吹似凤声，凤凰来止其屋。 公为作凤台。 夫妇止其上，不下数年。 一旦，皆随凤凰飞去。 故秦人为作凤女祠於雍，宫中时有箫声而已。 萧史妙吹，凤雀舞庭。 嬴氏好合，乃习凤声。 遂攀凤翼，参翕高冥。 女祠寄想，遗音载清。 祝鸡翁 祝鸡饰者，洛人也。 居尸乡北山下，养鸡百余年。 鸡有千余头，皆立名字。 暮栖树上，昼放散之。 欲引呼名，即依呼而至。 卖鸡及子，得千余万，辄置钱去。 之昊，作养鱼池。 后升昊山，白鹤孔雀数百，常止其傍。 云： 人禽虽殊，道固相关。 祝翕傍通，牧鸡寄罐。 育鳞道洽，栖鸡树端。 物之致化，施而不刊。 朱仲 朱仲者，会稽人也，常於会稽市上贩珠。 汉高后时，下书募三寸珠。 仲读购书，笑曰：直值汝矣。 资三寸珠，诣阙上书。 珠好过度，即赐五百金。 鲁元公主复私以七百金，从仲求珠。 仲献四寸珠，送置於阙，即去。 下书会稽征聘，不知所在。 景帝时复来献三寸珠数十枚，辄去，不知所之。 云： 朱仲无欲，聊寄卖商。 俯窥骊龙，扪此夜光。 发迹会稽，曜奇咸阳。 施而不德，历世弥彰。 修羊公 修羊公者，魏人也。 在华阴山上石室中，有悬石榻，外其上，石尽穿陷。 略不食，时取黄精食之。 后以道干景帝。 帝礼之，使止王邸中。 数岁，道不可得。",
      "translated_text": "A century later, he returned to Liang as a magistrate, urging the people to plant more taro and greens. \"In three years,\" he said, \"there will be a great famine.\" And so it came to pass, yet the people of Liang did not perish. Five years later, he untied his official sash and departed, and none knew his end.\n\nThe Wine Merchant, Xiao Cui, lodged at a Liang tavern.\nWhat marked him as extraordinary?\nHis wine bore a singular, pure savor.\nBending to serve the times, he ensured the people never lacked.\nAt dawn, he loosed his seals and left—\nnone knew where he alighted.\n\n**Ren Guang**\nRen Guang was a man of Shangcai. Skilled in refining cinnabar, he sold it in the markets and streets. After eighty-nine years, it became known that he was the same Ren Guang of old, his face still as youthful as one in his thirties. Later, an elder recognized him as the one once summoned by Zhao Jianzi, who took him back to his domain. He often dwelled on Wu and Ti Mountains, and for three generations, none knew his whereabouts. The people of Jin regularly consumed his elixir.\n\nRen Guang of Shangcai,\nadept in refining divine cinnabar.\nThough his years spanned a century,\nhis countenance glowed with youthful hue.\nBriefly he attended Zhao Jianzi,\nthen followed his own ease.\nAscending the laddered peaks,\nhe soared to the clouds’ edge.\n\n**Xiao Shi**\nXiao Shi was a man of the time of Duke Mu of Qin. Skilled in playing the flute, he could summon peacocks and white cranes to his courtyard. The duke had a daughter named Nongyu, who admired him, and so the duke gave her to him in marriage. Daily, he taught Nongyu to mimic the phoenix’s cry. After several years, her playing resembled the phoenix’s voice, and phoenixes came to perch upon their roof. The duke built the Phoenix Terrace for them. The couple dwelled there for years without descending. One day, they both followed the phoenixes and flew away. Thus, the people of Qin built the Phoenix Maiden’s Shrine in Yong, where the sound of flutes could sometimes be heard.\n\nXiao Shi, master of the flute,\ndrew phoenixes and cranes to dance in his court.\nThe House of Ying favored their union,\nand she learned the phoenix’s song.\nThen they grasped the phoenix’s wings,\nsoaring into the lofty heavens.\nThe shrine preserves their memory,\nits lingering notes ever clear.\n\n**The Cock-Breeding Elder**\nThe Cock-Breeding Elder was a man of Luo. He lived at the foot of the northern mountain in Shixiang, raising chickens for over a hundred years. His flock numbered over a thousand, each given a name. At dusk, they roosted in the trees; by day, he released them. When he called their names, they came at his summons. Selling chickens and their chicks, he earned over a million coins, which he would leave behind. He then went to Wu, where he built a pond to raise fish. Later, he ascended Wu Mountain, where hundreds of white cranes and peacocks often gathered beside him.\n\nThough man and bird differ,\nthe Dao binds them as one.\nThe elder’s breath harmonized with all,\nherding chickens, tending fish.\nPerched in treetops, scales in water—\nsuch transformations endure,\nbestowed yet unchanging.\n\n**Zhu Zhong**\nZhu Zhong was a man of Kuaiji who often traded pearls in the Kuaiji market. During the reign of Empress Lü of Han, an edict was issued seeking three-inch pearls. Upon reading the proclamation, Zhu Zhong laughed and said, \"Now you shall have your worth.\" He presented a three-inch pearl at court and was rewarded with five hundred gold pieces. Princess Lu Yuan privately offered seven hundred gold for more pearls. Zhu Zhong then presented a four-inch pearl, placed it at the palace gate, and departed. An edict was issued to summon him from Kuaiji, but none knew his whereabouts. During Emperor Jing’s reign, he reappeared, offering dozens of three-inch pearls, then vanished again—none knew where he went.\n\nZhu Zhong, free of desire,\ndallied as a merchant.\nBending low to peer into the Black Dragon’s lair,\nhe plucked this midnight radiance.\nHis path began in Kuaiji,\ndazzling the capital of Xianyang.\nGiving without claiming virtue,\nhis fame grew through the ages.\n\n**Master Xiuyang**\nMaster Xiuyang was a man of Wei. He dwelled in a stone chamber on Huayin Mountain, where a suspended stone couch bore the marks of his long repose, worn deep into the rock. He ate little, occasionally consuming Solomon’s seal. Later, he sought an audience with Emperor Jing through the Dao. The emperor received him with courtesy and had him stay in the royal residence. After several years, the Dao remained unattained.",
      "overlap_context": "ouble the Hu couriers?\nIf one does not perceive the root, who would know he was banished?\n\n**The Wine Merchant**\nThe Wine Merchant was a man of the wine shop in the Liang market. His wine was always excellent and sold well, earning him ten thousand coins daily. When he was driven away for some offense, the shop’s wine turned sour and spoiled, leaving the owner impoverished. Many merchants in the Liang market offered their daughters in marriage to welcome him back. He came and went as he pleased.",
      "start_char": 5195,
      "end_char": 6004,
      "start_sentence": 424,
      "end_sentence": 493,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.900697708129883,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "有诏问修羊公能何日发，语未讫，床上化为白羊，题其脸曰：修羊公谢天子。 后置石羊於灵台上，羊后复去，不知所在。 卓矣修羊，韬奇含灵。 枕石大华，餐钴黄精。 汉礼虽隆，道非所经。 应变多质，忽尔隐形。 稷丘君 稷丘君者，太山下道士也。 武帝时以道术受赏赐。 发白再黑，齿落更生。 后罢去。 上东巡太山，稷丘君乃冠章甫，衣黄衣，拥琴来迎拜武帝，指帝：陛下勿上也，上必伤足指。 及数里，右足指果折。 上讳之，故但祠而还，为稷丘君立祠焉，为稷承奉之。 云： 穆丘洞彻，修道灵山。 炼形濯质，变白还年。 汉武行幸，携琴来延。 戒以升陆，逆睹未然。 崔文子 崔文子者，太山人也。 文子世好黄老事。 居潜山下，后作黄散赤丸，成石父祠。 卖药都市，自言三百岁。 后有疫气，民死者万计。 长吏之文所请救，文拥朱膳，系黄散，以徇人门，饮散者即愈，所活者万计。 后去，在蜀卖黄散，故世宝崔文赤丸黄散，实近於神焉。 崔子得道，卫兼秘奥。 气疠降丧，仁心攸悼。 朱婶电麾，神药捷到。 一时获全，永世作效。 列仙传卷上竟",
      "translated_text": "A decree was issued to inquire when Master Xiuyang might depart. Before the words were fully spoken, he transformed upon his couch into a white sheep, its cheek inscribed: *\"Master Xiuyang bids farewell to the Son of Heaven.\"* Later, a stone sheep was placed upon the Spirit Terrace, but the sheep too vanished, its whereabouts unknown.\n\nProfound was Master Xiuyang,\nveiling his marvels, harboring spirit.\nHe pillowed on the stones of Mount Taihua,\nfeasting on yellow essence.\nThough Han’s rites were grand,\nthe Dao was not his path.\nAdapting to change, he took form,\nthen vanished in an instant.\n\n**Lord Jiqiu**\nLord Jiqiu was a Daoist of Mount Tai’s foothills. In Emperor Wu’s reign, he received rewards for his arts. His white hair turned black again, and fallen teeth regrew. Later, he departed.\n\nWhen the emperor toured the east and ascended Mount Tai, Lord Jiqiu donned a *zhangfu* cap and yellow robes, cradling a zither as he came to greet and bow before the emperor. Pointing, he warned: *\"Your Majesty must not ascend—you will injure your toes.\"* After several *li*, the emperor’s right toe indeed broke. The emperor concealed the injury, offering sacrifices before returning. A shrine was built for Lord Jiqiu, and attendants were appointed to serve him.\n\nSerene Jiqiu, penetrating the depths,\ncultivated the Dao on the sacred mountain.\nRefining form, cleansing essence,\nhe reversed age and restored youth.\nWhen Han Wu journeyed forth,\nhe came bearing his zither to welcome him.\nWarning against ascent,\nhe foresaw what was yet to be.\n\n**Cui Wenzi**\nCui Wenzi was a man of Mount Tai. His family had long revered the teachings of the Yellow Emperor and Laozi. Dwelling at the foot of Mount Qian, he later crafted the *Yellow Powder* and *Red Pellets*, establishing a shrine for Father Stone. He sold medicines in the city markets, claiming to be three hundred years old.\n\nWhen a plague struck and tens of thousands perished, the local magistrate sought his aid. Cui Wenzi, wielding a vermilion banner and carrying the *Yellow Powder*, paraded through the city gates. Those who drank the powder recovered instantly, and countless lives were saved. Later, he departed and sold the *Yellow Powder* in Shu. Thus, the world treasured Cui Wenzi’s *Red Pellets* and *Yellow Powder*, deeming them near-divine.\n\nMaster Cui attained the Dao,\nguardian of hidden mysteries.\nAs pestilence brought ruin,\nhis compassion grieved.\nWith crimson banner flashing,\ndivine medicine swiftly arrived.\nIn that moment, lives were preserved,\na legacy for all ages.\n\n*Records of the Immortals, Volume One—End*",
      "overlap_context": "ng without claiming virtue,\nhis fame grew through the ages.\n\n**Master Xiuyang**\nMaster Xiuyang was a man of Wei. He dwelled in a stone chamber on Huayin Mountain, where a suspended stone couch bore the marks of his long repose, worn deep into the rock. He ate little, occasionally consuming Solomon’s seal. Later, he sought an audience with Emperor Jing through the Dao. The emperor received him with courtesy and had him stay in the royal residence. After several years, the Dao remained unattained.",
      "start_char": 6004,
      "end_char": 6452,
      "start_sentence": 494,
      "end_sentence": 525,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.307928323745728,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "＃１『仰』字据《四库全书》本《列仙传》（下简称《四库》本）补。 ＃２『城』字疑应作『成』。 ＃３『胡』字原文作『明』，据《四库》本改。 ＃４『山』字《四库》本作『王』。 汉光禄大夫刘向撰 赤须子 赤须子，丰人也，丰中传世见之，云秦穆公时主鱼吏也。 数道丰界灾害水早，十不失一。 臣下归向，迎而师之，从受业，问所长。 好食松实、天门冬、石脂，齿落更生，发堕再出。 服霞绝，后遂去昊山下，十余年，莫知所之。 赤须去丰，爰憩昊山。 三药并御，朽貌再鲜。 空往师之，而无使延。 顾问小智，岂识巨年。 东方朔 东方朔者，平原厌次人也。 久在昊中，为书师数十年。 武帝时上书说便宜，拜为郎。 至昭帝时，时人或谓圣人，或谓凡人。 作深浅显默之行，或忠言，或亏语，莫知其旨。 至宣帝初，弃郎以避乱世，置绩官舍，风飘之而去。 后见於会稽，卖药五湖。 智者疑其岁星精也。 东方奇达，混同时俗。 一龙一蛇，岂豫荣辱。 高韵冲霄，不羁不东。 沈迹五湖，腾影旸谷。 钩翼夫人 钩翼夫人者，齐人也。 姓赵。 少时好清冷。",
      "translated_text": "# *Records of the Immortals, Volume Two*\n\n**Red-Beard Master**\nRed-Beard Master was a native of Feng. The people of Feng transmitted accounts of him across generations, claiming he had been the fish warden under Duke Mu of Qin. He repeatedly foretold disasters, floods, and droughts along the borders of Feng, missing not one in ten. The court officials revered and followed him, welcoming him as their master. They studied under him, inquiring into his extraordinary abilities. He favored eating pine nuts, asparagus root, and mineral pitch; when his teeth fell out, new ones grew, and when his hair shed, it returned. After consuming the morning mist to the point of satiation, he departed and dwelled beneath Mount Hao for over a decade, after which none knew his whereabouts.\n\nRed-Beard left Feng,\nresting at the foot of Mount Hao.\nThree medicines he mastered,\nhis withered form renewed.\nIn vain they sought his teaching,\nfor none could prolong their years.\nHow could petty wisdom grasp\nthe span of vast longevity?\n\n**Dongfang Shuo**\nDongfang Shuo was a native of Yanci in Pingyuan. He dwelled for long in the capital, serving as a scribe for several decades. During the reign of Emperor Wu, he submitted a memorial on state affairs and was appointed Gentleman of the Palace. By the time of Emperor Zhao, some called him a sage, others an ordinary man. He engaged in conduct both profound and shallow, now speaking with loyalty, now uttering enigmatic words—none could fathom his intent. At the beginning of Emperor Xuan’s reign, he resigned his post as Gentleman to escape the turmoil of the age, leaving his official lodgings as the wind bore him away. Later, he was seen in Kuaiji, selling medicines by the Five Lakes. The wise suspected him to be the essence of Jupiter.\n\nDongfang, strange and far-reaching,\nblended with the customs of his time.\nNow a dragon, now a serpent—\nwhat cared he for honor or disgrace?\nHis lofty spirit soared beyond the clouds,\nunfettered, unbound.\nHe vanished into the Five Lakes,\nhis shadow leaping to the Valley of the Sun.\n\n**Lady Hook-Wing**\nLady Hook-Wing was a native of Qi, surnamed Zhao. In her youth, she favored purity and solitude.",
      "overlap_context": "k the powder recovered instantly, and countless lives were saved. Later, he departed and sold the *Yellow Powder* in Shu. Thus, the world treasured Cui Wenzi’s *Red Pellets* and *Yellow Powder*, deeming them near-divine.\n\nMaster Cui attained the Dao,\nguardian of hidden mysteries.\nAs pestilence brought ruin,\nhis compassion grieved.\nWith crimson banner flashing,\ndivine medicine swiftly arrived.\nIn that moment, lives were preserved,\na legacy for all ages.\n\n*Records of the Immortals, Volume One—End*",
      "start_char": 6452,
      "end_char": 6911,
      "start_sentence": 526,
      "end_sentence": 557,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.602904796600342,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "病卧六年，右手拳屈，饮食少。 望气者云：东北有贵人气，推而得之。 召到，姿色甚伟。 武帝披其手，得一玉钩，而手寻展。 遂幸而生昭帝。 后武帝害之，殡尸不玲而香一月问。 后昭帝即位，更葬之，棺内但有丝履，故名其宫日钩翼。 后避讳改为弋庙。 闱有神祠阁在焉。 婉婉弱媛，庙符授钩。 诞育嘉嗣，皇祚惟休。 武之不达，背德致仇。 委身受戮，尸灭芳流。 犊子 犊子者，邺人也。 少在黑山，采松子、狭苓饵而服之，且数百年，时壮时老，时好时丑，时人乃知其仙人也。 常过酣酒阳都家。 阳都女者，市中酷酒家女，眉生而连，耳细而长。 众以为异，皆言此天人也。 会犊子牵一黄犊来过，都女悦之，遂留相奉侍。 都女随犊子出取桃李，一宿而返，皆连兜甘美□ 。 邑中随伺逐之，出门共牵犊耳而走，人不能追也。 且还，复在市中数十年，乃去。 见潘山下，冬卖桃李。 云： 犊子山栖，采松饵苓。 妙气充内，变白易形。 阳氏奇表，数合理冥。 乃控灵犊，倏若电征。 骑龙呜 骑龙呜者，浑亭人也。 年二十，於池中求得龙子，状如守官者十余头。 养食，结草庐而守之。 龙长大，稍稍而去。 后五十余年，水坏其庐而去。 一旦骑龙来浑亭下，语云：冯伯昌孙也，此间人不去五百里，必当死。 信者皆去，不信者以为妖。 至八月果水至，死者万计。 骑呜养龙，结庐虚池。 专至俟化，乘云縿蛎。 纡辔故乡，告以速移。 洞镜灾祥，情眷不离。 主柱 主柱者，不知何所人也。",
      "translated_text": "For six years she lay bedridden, her right hand clenched in a fist, taking little food or drink. A diviner observing the qi declared: \"In the northeast there is the qi of a noble person.\" They sought her out and found her—her bearing and beauty were extraordinary. Emperor Wu pried open her hand and discovered a jade hook; immediately, her fingers unfurled. He took her into his favor, and she bore him Emperor Zhao. Later, Emperor Wu had her killed. When her body was laid in state, it remained uncorrupted and fragrant for a month. After Emperor Zhao ascended the throne, he reburied her. Inside her coffin, only a pair of silk slippers was found, so her palace was named *Hook-Wing*. Later, to avoid taboo, it was renamed *Yi Temple*. Within its chambers stands a shrine to her spirit.\n\nGentle and yielding, a frail beauty,\nher temple received the hook’s mandate.\nShe gave birth to an illustrious heir,\nthe imperial line flourished.\nWu’s folly, turning virtue to enmity—\nshe surrendered her life to execution,\nher corpse vanished, her fragrance lingered.\n\n**Calf Child**\nCalf Child was a native of Ye. In his youth, he lived on Black Mountain, gathering pine nuts and *fuling* mushrooms to consume as food. He lived for several hundred years, now appearing youthful, now aged, now handsome, now plain. People came to recognize him as an immortal. He often visited the home of Yang Du, who sold wine in the marketplace. Yang Du’s daughter had eyebrows that met and ears long and delicate. The people marveled at her, calling her a celestial being. One day, Calf Child arrived leading a yellow calf. The girl took a liking to him and stayed to serve him. She followed him to gather peaches and plums, returning after a single night—all the fruit was sweet and luscious. The townsfolk trailed them, but when they rushed out the gate, they could only seize the calf’s ears as it fled; no one could catch them. Later, she reappeared in the market for decades before departing. They were seen at the foot of Pan Mountain, selling peaches and plums in winter.\n\nCalf Child dwelled in the mountains,\ngathering pine nuts, consuming *fuling*.\nHis inner qi refined, his form transformed,\nwhite hair turned dark.\nYang’s daughter bore a rare countenance,\ntheir fates mysteriously aligned.\nMounting the numinous calf,\nthey vanished swift as lightning.\n\n**Dragon-Rider Ming**\nDragon-Rider Ming was a native of Huntin. At twenty, he found dragon hatchlings in a pond—over ten of them, resembling little officials on guard. He raised and fed them, building a thatched hut to watch over them. As the dragons grew, they gradually departed. Fifty years later, a flood destroyed his hut and swept it away. One day, he rode a dragon to Huntin and declared: \"I am the grandson of Feng Bochang. All within five hundred *li* of this place will surely perish.\" Those who believed him fled; those who did not called him a demon. In the eighth month, the waters indeed rose, drowning tens of thousands. Ming had tended the dragons, building his hut by the empty pond. He waited single-mindedly for their transformation, then rode the clouds away. Returning to his hometown, he urged them to flee swiftly. His warnings revealed disaster and fortune, yet his heart never left his kin.\n\n**Pillar Master**\nPillar Master’s origins are unknown.",
      "overlap_context": "in Kuaiji, selling medicines by the Five Lakes. The wise suspected him to be the essence of Jupiter.\n\nDongfang, strange and far-reaching,\nblended with the customs of his time.\nNow a dragon, now a serpent—\nwhat cared he for honor or disgrace?\nHis lofty spirit soared beyond the clouds,\nunfettered, unbound.\nHe vanished into the Five Lakes,\nhis shadow leaping to the Valley of the Sun.\n\n**Lady Hook-Wing**\nLady Hook-Wing was a native of Qi, surnamed Zhao. In her youth, she favored purity and solitude.",
      "start_char": 6911,
      "end_char": 7504,
      "start_sentence": 558,
      "end_sentence": 601,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.4095516204834,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "与道士共上岩山，言此有丹砂，可得数万斤。 容山长吏知而上山封之。 砂流出，飞如火，乃听柱取为。 邑令章君明饵砂三年，得神砂飞雪。 服之五年，能飞行，遂与柱俱去。 云： 主柱同窥，道士精彻。 玄感通山，丹砂出穴。 荧荧流丹，飘飘飞雪。 者长悟之，终然同悦。 园客 园客者，济阴人也。 姿貌好而性良，邑人多以女妻之，客终不取。 常种五色香草，积数十年，食其实。 一旦，有五色蛾止其香树末，客收而荐之以布，生桑蚕焉。 至蚕时，有好女夜至，自称客妻，道蚕状。 客与俱收蚕，得百二十头茧，皆如瓮大。 缫一茧，六十日始尽。 讫，则俱去，莫知所在。 故济阳人世祠桑蚕，设祠室焉。 或云陈留济阳氏。 美哉园客，颜哗朝华。 仰吸玄精，俯持五葩。 馥馥芳卉，采采文蛾。 淑女宵降，配德升遐。 鹿皮公 鹿皮公者，淄川人也。 少为府小吏木工，举手能成器械。 岑山上有神泉，人不能至也。",
      "translated_text": "Pillar Master ascended Rock Mountain with a Daoist, declaring that cinnabar lay there in quantities of tens of thousands of *jin*. The magistrate of Rong Mountain learned of this and sealed the mountain. The cinnabar then flowed forth like flying fire, and they permitted Pillar Master to take it. Magistrate Zhang Junming of the district consumed the cinnabar for three years, obtaining divine cinnabar that drifted like snow. After five years of ingestion, he gained the ability to fly and thus departed together with Pillar Master.\n\nPillar Master and his companion peered into the depths,\nThe Daoist’s essence pure and penetrating.\nMysterious resonance stirred the mountain,\nCinnabar emerged from the cavern.\nGlowing streams of crimson,\nFloating flurries of snow.\nThe magistrate awakened to truth,\nAnd in the end, they shared the same joy.\n\n**Garden Guest**\nGarden Guest was a man of Jiyin. His appearance was handsome and his nature kind; many in the district sought to wed their daughters to him, yet he never took a wife. He often cultivated five-colored fragrant herbs, accumulating them for decades and consuming their fruit. One day, a five-colored moth alighted upon the tip of his fragrant tree. The Guest gathered and spread them upon cloth, whereupon silkworms were born. When the time for silkworms came, a beautiful woman arrived at night, calling herself the Guest’s wife and explaining the state of the silkworms. The Guest tended them with her, yielding one hundred and twenty cocoons, each as large as a jar. Unwinding a single cocoon took sixty days to complete. When the task was done, they departed together, and none knew their whereabouts. Thus, the people of Jiyang established a shrine to the silkworm, erecting a temple in its honor. Some say he was of the Jiyang family of Chenliu.\n\nHow splendid was the Garden Guest,\nHis countenance radiant as morning blossoms.\nHe drew in the essence of the Dao above,\nAnd below, held the five petals.\nFragrant blooms in profusion,\nResplendent patterned moths.\nA virtuous maiden descended at night,\nMatched in virtue, they ascended afar.\n\n**Deerskin Elder**\nDeerskin Elder was a man of Zichuan. In his youth, he served as a minor carpenter in the prefectural office, able to craft implements with a mere gesture. Atop Mount Cen lay a divine spring, inaccessible to ordinary men.",
      "overlap_context": "ace will surely perish.\" Those who believed him fled; those who did not called him a demon. In the eighth month, the waters indeed rose, drowning tens of thousands. Ming had tended the dragons, building his hut by the empty pond. He waited single-mindedly for their transformation, then rode the clouds away. Returning to his hometown, he urged them to flee swiftly. His warnings revealed disaster and fortune, yet his heart never left his kin.\n\n**Pillar Master**\nPillar Master’s origins are unknown.",
      "start_char": 7504,
      "end_char": 7880,
      "start_sentence": 602,
      "end_sentence": 630,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.752962350845337,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "小吏白府君，请木工斤斧三十人作转轮悬阁，意思横生。 数十日梯道四问成，上其巅，作祠舍，留止其旁，绝其二问以自固。 食芝草，饮神泉，且七十年。 淄水来，三下呼宗族家室，得六十余人，令上山半。 水尽漂一郡，没者万计。 小吏乃辞遣宗家，令下山。 着鹿皮衣，遂去，复上阁。 后百余年，下卖药於市。 皮公兴思，妙巧缠绵。 飞阁悬趣，上抱神泉。 肃肃清庙，惜惜二问。 可以闲处，可以永年。 昌容 昌容者，常山道人也。 自称殷王子。 食蓬萦根，往来上下，见之者二百余年，而颜色如二十许人。 能致紫草，卖与染家，得钱以遗孤寡。 历世而然，奉祠者万计。 殷女忘荣，曾无遗恋。 怡我柔颜，改华标情。 心与化迁，日与气炼。 坐外奇货，惠及孤贱。 溪父 溪父者，南郡墉人也。 居山问，有仙人常止其家。 从买瓜，教之炼瓜子，与桂附子芷实共藏而对分，食之二十余年，能飞走，升山入水。 后百余年，居绝山顶，呼溪下父老，与道平生时事。 云：",
      "translated_text": "The minor clerk reported to the prefect, requesting thirty carpenters with axes to construct a revolving wheel and suspended pavilion, their ingenuity flowing without end. In several dozen days, ladders and pathways took shape on all four sides. Ascending to the summit, they built a shrine hall, where Deerskin Elder took up residence, severing two of the pathways to secure his solitude. He ate lingzhi mushrooms and drank from the divine spring, dwelling thus for nearly seventy years. When the Zi River rose, he called three times to summon his clansmen and household—over sixty in number—and bade them ascend halfway up the mountain. The floodwaters surged, drowning an entire commandery, with tens of thousands lost. The minor clerk then took leave of his kin, sending them down the mountain. Clad in deerskin robes, he departed, returning once more to the pavilion. Over a hundred years later, he descended to sell medicine in the marketplace.\n\nDeerskin Elder’s inspired thoughts,\nHis wondrous craft enduring.\nThe soaring pavilion, suspended in delight,\nEmbraced above by the divine spring.\nSolemn and pure the sacred hall,\nTwo pathways sealed with care.\nHere one may dwell in tranquility,\nHere one may attain long years.\n\n**Chang Rong**\nChang Rong was a Daoist of Changshan. She claimed to be a descendant of the Yin kings. Feeding on the roots of bindweed, she wandered up and down the mountains. Those who saw her over two hundred years found her complexion still like that of a woman of twenty. She gathered purple grass, selling it to dyers to earn money, which she gave to orphans and widows. She lived thus through the ages, with tens of thousands honoring her shrine.\n\nThe Yin maiden forgot glory,\nNo lingering attachments remained.\nShe nurtured her gentle countenance,\nTransforming her radiant bearing.\nHer heart moved with the changes,\nHer days tempered by qi.\nSitting beyond rare treasures,\nShe bestowed kindness upon the orphaned and lowly.\n\n**Valley Elder**\nValley Elder was a man of Yong in Nanjun. Dwelling in the mountains, an immortal often stayed at his home. Once, when he went to buy melons, the immortal taught him to refine melon seeds, storing them with cassia, aconite, and angelica seeds, dividing them equally. After eating them for over twenty years, he gained the ability to run swiftly and ascend mountains or enter water as if walking on land. More than a hundred years later, he lived atop a remote mountain peak. He called to the elders below in the valley, recounting events from his earlier days. He said:",
      "overlap_context": "est,\nHis countenance radiant as morning blossoms.\nHe drew in the essence of the Dao above,\nAnd below, held the five petals.\nFragrant blooms in profusion,\nResplendent patterned moths.\nA virtuous maiden descended at night,\nMatched in virtue, they ascended afar.\n\n**Deerskin Elder**\nDeerskin Elder was a man of Zichuan. In his youth, he served as a minor carpenter in the prefectural office, able to craft implements with a mere gesture. Atop Mount Cen lay a divine spring, inaccessible to ordinary men.",
      "start_char": 7880,
      "end_char": 8282,
      "start_sentence": 631,
      "end_sentence": 658,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.31897234916687,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "溪父何欲，欲在幽谷。 下临清涧，上翳委募。 仙客舍之，导以秘录。 形绝埃溘，心在旧俗。 山图 山图者，陇西人也。 少好乘马，马蹋之折脚。 山中道人教令服地黄、当归、羌活、独活、苦参散，服之一岁，而不嗜食，病愈身轻。 追道人问之，自言五岳使之名山采药。 能随吾，使汝不死。 山图追随之六十余年。 一日一归来，行母服於家问。 赛年复去，莫知所之。 山图抱患，因毁致全。 受气使身，药轻命延。 写哀坟梧，天爱犹缠。 数周高举，永绝俗绿。 谷春 谷春者，砾阳人也。 成帝时为郎，病死而尸不冷。 家发丧行服，犹不敢下钉。 三年，更着冠积，坐县门上。 邑中人大惊。 家人迎之，不肯随归。",
      "translated_text": "Valley Elder sought but one thing—\nto dwell in the secluded valley.\nBelow, he gazed upon clear streams;\nabove, dense vines and creeping moss enshrouded him.\nAn immortal guest lodged with him,\nguiding him with secret texts.\nHis form transcended dust and mist,\nyet his heart remained in the old customs.\n\n**Mountain Chart**\nMountain Chart was a man of Longxi. In his youth, he loved riding horses, but one threw him and broke his leg. A mountain Daoist taught him to take a powder of rehmannia, angelica, notopterygium, tu-huo, and sophora, and after a year of taking it, he lost his appetite for food, his ailment healed, and his body grew light. He pursued the Daoist and questioned him, who said he was a messenger of the Five Peaks sent to gather herbs from famous mountains. \"Follow me,\" he said, \"and I will make you immortal.\" Mountain Chart followed him for over sixty years. One day, he returned home to observe mourning for his mother. After the mourning period, he departed again, and none knew where he went.\n\nMountain Chart bore suffering,\nthrough ruin attaining wholeness.\nReceiving qi to animate his body,\nmedicine lightened his fate, extending his years.\nHe inscribed his grief on the wutong tree,\nyet Heaven’s love still bound him.\nAfter several cycles, he ascended on high,\nforever severed from the world’s green.\n\n**Valley Spring**\nValley Spring was a man of Liyang. During Emperor Cheng’s reign, he served as a Gentleman of the Palace, but fell ill and died—though his body did not grow cold. His family held the funeral and donned mourning robes, yet dared not seal the coffin. Three years later, he donned his cap and sash again and sat at the county gate. The townspeople were greatly alarmed. His family came to fetch him, but he refused to return home.",
      "overlap_context": " an immortal often stayed at his home. Once, when he went to buy melons, the immortal taught him to refine melon seeds, storing them with cassia, aconite, and angelica seeds, dividing them equally. After eating them for over twenty years, he gained the ability to run swiftly and ascend mountains or enter water as if walking on land. More than a hundred years later, he lived atop a remote mountain peak. He called to the elders below in the valley, recounting events from his earlier days. He said:",
      "start_char": 8282,
      "end_char": 8569,
      "start_sentence": 659,
      "end_sentence": 682,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.340576648712158,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "发棺，有衣无尸。 留门上三宿，去之长安，止横门上。 人知，追迎之。 复去之太白山，立祠於山上，时来至其祠中止宿焉。 谷春既死，停尸犹温。 棺阖五稔，端委於门。 顾视空柩，形逝衣存。 留轨太白，纳气玄根。 阴生 阴生者，长安中渭桥下乞儿也。 常止於市中乞，市人厌苦，以粪洒之。 旋复在里中，衣不见污如故。 长吏知之，械收击，着栓桔，而续在市中乞。 又械，欲杀之，乃去。 洒者之家室自坏，杀十余人。 故长安中谣曰：见乞儿，与美酒，以免破屋之咎。 阴生乞儿，人厌其黩。 识真者稀，累见囚辱。 淮阴忘吝，况我仙属。 恶肆殃及，自灾其屋。 毛女 毛女者，字玉姜。 在华阴山中，猎师世世见之。 形体生毛，自言秦始皇宫人也。 秦坏，流亡入山避难，遇道士谷春，教食松叶，遂不饥寒，身轻如飞。 百七十余年，所止岩中有鼓琴声。 云：",
      "translated_text": "The coffin was opened, revealing garments but no corpse. He remained at the gate for three nights, then departed for Chang’an, where he stayed at the Heng Gate. People recognized him and pursued him to bring him back. He then left again for Mount Taibai, where a shrine was established upon the mountain. At times, he would come and stay overnight in his own shrine.\n\nAfter Valley Spring’s death, his body remained warm. The coffin lay sealed for five years before he appeared at the gate in full court attire. Gazing upon the empty casket, his form had vanished—only his robes remained. He left his traces on Mount Taibai, drawing in the primal root of qi.\n\n**Yin Sheng**\nYin Sheng was a beggar beneath the Wei Bridge in Chang’an. He often begged in the marketplace, but the people grew weary and tormented him, dousing him with filth. Yet when he returned to the alleys, his clothes remained as clean as before. The magistrates, learning of this, seized and beat him, binding him in stocks, but he soon reappeared in the marketplace begging. They shackled him again, intending to kill him, and only then did he depart. The household of those who had defiled him collapsed of its own accord, killing over ten people. Thus arose a saying in Chang’an: *\"See a beggar, give fine wine, to spare your house from ruin.\"*\n\nYin Sheng, the beggar—people loathed his persistence. Few recognized his true nature, and he endured repeated imprisonment and humiliation. Even the men of Huaiyin forgot their stinginess—how much more should we, of the immortal lineage? Spurning evil brought calamity upon their own homes.\n\n**Mao Nü**\nMao Nü, styled Yujian, dwelled in the mountains of Huayin. Hunters of successive generations had seen her—a figure covered in body hair. She claimed to have been a palace woman of the First Emperor of Qin. When the Qin fell, she fled into the mountains to escape disaster. There she encountered the Daoist Valley Spring, who taught her to eat pine needles. Thereafter, she knew neither hunger nor cold, and her body became as light as if she could fly. For over one hundred seventy years, the sound of her zither playing could be heard from the caves where she stayed. She said:",
      "overlap_context": "ended on high,\nforever severed from the world’s green.\n\n**Valley Spring**\nValley Spring was a man of Liyang. During Emperor Cheng’s reign, he served as a Gentleman of the Palace, but fell ill and died—though his body did not grow cold. His family held the funeral and donned mourning robes, yet dared not seal the coffin. Three years later, he donned his cap and sash again and sat at the county gate. The townspeople were greatly alarmed. His family came to fetch him, but he refused to return home.",
      "start_char": 8569,
      "end_char": 8924,
      "start_sentence": 683,
      "end_sentence": 709,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.208009481430054,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "婉变玉姜，与时遁逸。 真人授方，餐松秀实。 因败获成，延命深吉。 得意岩岫，寄欢琴瑟。 子英 子英者，舒乡人也。 善入水捕鱼。 得赤鲤，爱其色好，持归着池中，数以米谷食之。 一年，长丈余，遂生角，有翅翼。 子英怪异，拜谢之。 鱼言：我来迎汝，汝上背，与汝俱升天。 即大雨。 子英上其鱼背，腾升而去。 岁岁来归故舍食饮，见妻子。 鱼复来迎之，如此七十年。 故昊中门户皆作神鱼，遂立子英祠。 子英乐水，游捕为职。 灵鳞来赴，有伟厥色。 养之长之，挺角传翼。 遂驾云璃，超步太极。 服闾 服闾者，不知何所人也。",
      "translated_text": "Mao Nü, graceful as jade, adapted and vanished with the times.\nA Perfected One bestowed the method—she feasted on pine blossoms and seeds.\nFrom ruin came fulfillment; her life stretched long and blessed.\nDelighting in cliffs and peaks, she found joy in zither and lute.\n\n**Zi Ying**\nZi Ying was a man of Shuxiang. Skilled at diving to catch fish, he once netted a red carp. Enamored of its fine color, he carried it home and placed it in his pond, feeding it grains of rice for a year. The carp grew over a *zhang* long, sprouted horns, and grew wings. Zi Ying, astonished, bowed in reverence. The fish spoke: *\"I have come to fetch you. Mount my back, and I will bear you to heaven.\"* At once, a great rain fell. Zi Ying climbed onto the fish’s back, and together they soared away. Year after year, he returned to his old home to eat and drink, visiting his wife and children. The fish would come again to welcome him, and this continued for seventy years. Thus, in Wu, every household carved images of the sacred fish, and a shrine was built to Zi Ying.\n\nZi Ying loved the water, making his living by roaming and fishing.\nA numinous scale came to him, splendid in hue.\nHe nurtured it, and it grew—horns sprouted, wings unfurled.\nThen it bore him on clouded glass, striding beyond the Great Ultimate.\n\n**Fu Lü**\nFu Lü’s origins are unknown.",
      "overlap_context": "ve generations had seen her—a figure covered in body hair. She claimed to have been a palace woman of the First Emperor of Qin. When the Qin fell, she fled into the mountains to escape disaster. There she encountered the Daoist Valley Spring, who taught her to eat pine needles. Thereafter, she knew neither hunger nor cold, and her body became as light as if she could fly. For over one hundred seventy years, the sound of her zither playing could be heard from the caves where she stayed. She said:",
      "start_char": 8924,
      "end_char": 9178,
      "start_sentence": 710,
      "end_sentence": 731,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.99369740486145,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 21,
      "original_text": "常止莒，往来海边诸祠中。 有三仙人於祠中博赌瓜，顾闻，令担黄白瓜数十头。 教令暝目，及觉，乃在方丈山，在蓬莱山南。 后往来莒，取方丈山上珍宝珠玉卖之，久矣。 一旦髡头，着赭衣，貌更老。 人问之，言坐取庙中物云。 后数年，貌更壮好，鬓发如往日时矣。 服问游祠，三仙是使。 假寐须臾，忽超千里。 纳宝毁形，未足多耻。 攀龙附凤，逍遥终始。 文宾 文宾者，太丘乡人也。 卖草履为业。 数取妪，数十年辄弃之。 后时故妪寿老年九十余，续见宾年更壮他时。 妪拜宾涕泣，宾谢曰：不宜。 至正月朝，傥能会乡亭西社中邪？ 妪老，夜从儿孙行十余里，坐社中待之。 须臾宾到，大惊：汝好道邪？ 知汝尔，前不去汝也。 教令服菊花、地肤、桑上寄生、松子，取以益气，妪亦更壮，复百余年见。 云： 文宾养生，纳气玄虚。 松菊代御，炼质鲜肤。 故妻好道，拜泣踟跚。 引过告术，延龄百余。 商丘子胥 商丘子胥者，高邑人也。 好牧豕吹竽。 年七十，不娶妇，而不老。 邑人多奇之，从受道，问其要。 言：但食木莒蒲根，饮水不饥不老。 如此传世，见之三百余年。 贵戚富室闻之，取而服之，不能终岁，辄止堕慢矣，谓将复有匿卫也。 商丘幽栖，报椟妙术。 渴饮寒泉，饥茹蒲木。 吹竽牧豕，卓荦奇出。 道足无求，乐兹永日。 子主 子主者，楚语而细音，不知何所人也。",
      "translated_text": "Fu Lü often stayed in Ju, frequenting the shrines along the seacoast. Once, three immortals were casting melon-seeds in a shrine when they turned and called to him, ordering him to carry several dozen yellow and white melons. They bade him close his eyes, and when he awoke, he found himself on Mount Fangzhang, south of Mount Penglai. Thereafter, he would return to Ju to gather pearls and jade from Mount Fangzhang’s treasures and sell them, which he did for many years. One day, his head was shorn, and he wore a reddish-brown robe, his appearance grown old. When asked, he said it was because he had taken something from the temple. Yet after several years, his countenance became strong and fair again, his temples as dark as before.\n\nFu Lü inquired of the shrine’s spirits, and the three immortals were their envoys. In a moment’s slumber, he had traversed a thousand *li*. To take treasures and mar one’s form—this was no great shame. Mounting the dragon or riding the phoenix, he roamed free from beginning to end.\n\n**Wen Bin**\nWen Bin was a man of Taiqiu village. He made his living selling straw sandals. He would take a wife, only to abandon her after several decades. Once, an old woman he had once wed lived to over ninety, yet when she saw Bin again, he appeared even more robust than before. The woman bowed to him, weeping, but Bin declined, saying, “This is not fitting. On the morning of the first day of the new year, could you meet me at the western altar of the village shrine?” The old woman, though frail, traveled over ten *li* that night with her children and grandchildren and waited for him at the altar. After a moment, Bin arrived and exclaimed in surprise, “Do you cultivate the Dao?” Had he known, he would not have left her before. He taught her to consume chrysanthemum flowers, *difu*, mistletoe from mulberry trees, and pine nuts to replenish her *qi*. The woman, too, grew strong again, and they lived together for over a hundred more years.\n\nWen Bin nurtured life, drawing in the mysterious void.\nPine and chrysanthemum served as his sustenance, refining his form to radiant skin.\nHis former wife, drawn to the Dao, bowed and wept, tottering forward.\nHe revealed his error and imparted the art, extending her years by a hundred more.\n\n**Shangqiu Zixu**\nShangqiu Zixu was a man of Gaoyi. He enjoyed herding pigs and playing the *yu*. Though seventy years old, he had never married and showed no signs of aging. The villagers marveled at him and sought the Dao from him, asking for its essentials. He replied, “Simply eat the roots of *mujiang* and calamus, drink water, and you will neither hunger nor age.” Thus he passed through the generations, seen for over three hundred years. Nobles and wealthy families heard of this and took the herbs themselves, but none could persist for even a year, soon abandoning them in laziness, saying he must have some hidden protection.\n\nShangqiu dwelled in seclusion, repaying the casket with wondrous arts.\nThirsty, he drank from cold springs; hungry, he ate calamus roots.\nPlaying the *yu* while herding pigs, he stood out as extraordinary.\nContent in the Dao, he sought nothing, delighting in endless days.\n\n**Zizhu**\nZizhu spoke in the Chu dialect with a delicate voice, and none knew his origins.",
      "overlap_context": "ink, visiting his wife and children. The fish would come again to welcome him, and this continued for seventy years. Thus, in Wu, every household carved images of the sacred fish, and a shrine was built to Zi Ying.\n\nZi Ying loved the water, making his living by roaming and fishing.\nA numinous scale came to him, splendid in hue.\nHe nurtured it, and it grew—horns sprouted, wings unfurled.\nThen it bore him on clouded glass, striding beyond the Great Ultimate.\n\n**Fu Lü**\nFu Lü’s origins are unknown.",
      "start_char": 9178,
      "end_char": 9729,
      "start_sentence": 732,
      "end_sentence": 772,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.998314142227173,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 22,
      "original_text": "诣江都王，自言：宁先生顾我，作客三百年，不得作直。 以为狂人也。 问先生所在，云在龙眉山上。 王遣吏将上龙眉山巅，见宁先生，毛身广耳，被发鼓琴。 主见之叩头，吏致王命，先生曰：此主，吾比舍九世孙。 且念汝家当有暴死女子三人，勿预吾事。 语竟，大风发，吏走下山。 比归，宫中相杀三人。 王遣三牲立祠焉。 子主挺年，理有所资。 宁主祠秀，扮琴龙眉。 以道相符，当与讼微。 匡事竭力，问昭我师。 陶安公 陶安公者，六安铸冶师也。 数行火，火一旦散，上行紫色冲天。 安公伏冶下求哀。 须臾，朱雀止冷上曰：安公安公，冷与天通。 七月七日，迎汝以赤龙。 至期，赤龙到，大雨，而安公骑之东南上。 一城邑数万人众，共送视之，皆与辞央。 云：",
      "translated_text": "He journeyed to the King of Jiangdu, declaring, “Master Ning once looked upon me, and I have been a guest for three hundred years, yet never been granted an audience.” The king took him for a madman. When asked where the master resided, he said, “On the summit of Longmei Mountain.” The king dispatched an officer to ascend the peak, where they found Master Ning—his body covered in hair, his ears broad, his hair unbound as he plucked the zither. Zizhu prostrated before him, and the officer delivered the king’s command. The master said, “This man is the ninth-generation descendant of my former neighbor. Moreover, I foresee three women in your household who will die violently—do not interfere in my affairs.” As his words ended, a great wind arose, and the officer fled down the mountain. By the time he returned, three women in the palace had indeed killed one another. The king sent offerings of the three sacrificial animals to establish a shrine there.\n\nZizhu retained his youth, his principles grounded in something profound.\nThe Ning Master’s shrine flourished, his zither echoing on Dragonbrow Peak.\nIn Dao they found accord, resolving subtle disputes.\nWith utmost effort in service, he inquired to illuminate his teacher’s wisdom.\n\n**Tao Angong**\nTao Angong was a master smelter of Liu’an. After repeatedly working the furnace, one day the fire scattered, rising in a purple column that pierced the heavens. Angong prostrated beneath the furnace, pleading for mercy. In an instant, a vermilion phoenix alighted upon the cold forge and said, “Angong, Angong, the cold forge communes with heaven. On the seventh day of the seventh month, you shall be fetched by a crimson dragon.” When the appointed day arrived, the red dragon descended amid a great rain. Angong mounted it and soared toward the southeast. The entire city—tens of thousands of people—gathered to see him off, bidding him farewell as one. He said:",
      "overlap_context": "erbs themselves, but none could persist for even a year, soon abandoning them in laziness, saying he must have some hidden protection.\n\nShangqiu dwelled in seclusion, repaying the casket with wondrous arts.\nThirsty, he drank from cold springs; hungry, he ate calamus roots.\nPlaying the *yu* while herding pigs, he stood out as extraordinary.\nContent in the Dao, he sought nothing, delighting in endless days.\n\n**Zizhu**\nZizhu spoke in the Chu dialect with a delicate voice, and none knew his origins.",
      "start_char": 9729,
      "end_char": 10033,
      "start_sentence": 773,
      "end_sentence": 794,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.55704402923584,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 23,
      "original_text": "安公纵火，紫炎洞熙。 翩翩朱雀，衔信告时，奕奕朱此，蜿然赴期。 倾城仰观，回首顾辞。 赤斧 赤斧者，巴戎人也。 为碧鸡祠主簿。 能作水顽炼丹，与硝石服之三十年，反如童子，毛发生皆赤。 后数十年，上华山，取禹余粮饵，卖之於苍梧、湘江问。 累世传见之。 手掌中有赤斧焉。 赤斧颐真，发秀戎巴。 寓迹神祠，顺炼丹砂。 发虽朱羹，颜晔丹葩。 采药灵山，观化南遐。 呼子先 呼子先者，汉中关下卜师也。 老寿百余岁，临去，呼酒家老妪曰：急装，当与妪共应中陵王。 夜有仙人持二茅狗来至，呼子先。 子先持一与酒家妪，得而骑之，乃龙也。 上华阴山。 常於山上大呼言：子先、酒家母在此。 云： 三灵潜感，应若符契。 方驾茅狗。 蜿尔龙逝。 参登大华，自称应世。 事君不端，会之有惠。 负局先生 负局先生者，不知何许人也。 语似燕代间人。 常负磨镜局徇昊市中，街磨镜一钱。 因磨之，辄问主人得无有疾苦者，辄出紫丸药以与之。 得者莫不愈。 如此数十年。",
      "translated_text": "Angong stoked the flames, and violet fires blazed with radiant brilliance. A graceful vermilion phoenix arrived, bearing tidings of the appointed hour; resplendent in crimson, it coiled sinuously toward the destined day. The entire city gazed upward, turning back to bid him farewell.\n\n**Chi Fu**\nChi Fu was a man of Barong. He served as registrar of the Green Rooster Shrine. Skilled in refining cinnabar through water tempering, he consumed saltpeter with it for thirty years, reverting to the appearance of a youth—his hair and beard both turned red. Decades later, he ascended Mount Hua to gather *yu yuliang* as provisions, selling them between Cangwu and the Xiang River. For generations, people reported sightings of him. In his palm rested a red axe.\n\nChi Fu cultivated truth, his hair lustrous in Barong. Dwelling in the divine shrine, he refined cinnabar with devotion. Though his beard gleamed crimson, his face bloomed like a vermilion flower. Gathering herbs on the sacred mountain, he observed transformations in the distant south.\n\n**Hu Zixian**\nHu Zixian was a diviner at the pass of Hanzhong. Over a hundred years old, as he neared his departure, he called to an old tavern woman: “Prepare quickly! I shall accompany you to answer the call of the Prince of Zhongling.” That night, an immortal arrived bearing two straw dogs. Hu Zixian took one and gave the other to the tavern woman; mounting them, they became dragons. They ascended Mount Huayin, where he would often cry out from the summit: “Zixian and the tavern woman are here!”\n\nThe Three Spirits moved in hidden resonance, their response as precise as tallying tokens. Side by side, they rode the straw dogs, then sinuously vanished as dragons. Together they scaled the great Hua, proclaiming their worldly manifestation. Those who serve their lords with impropriety shall meet with retribution; those who act with virtue shall receive favor.\n\n**The Master of the Mirror-Carrying Case**\nThe Master of the Mirror-Carrying Case was of unknown origin. His speech resembled that of the people between Yan and Dai. He often carried a mirror-grinding case through the markets of Wu, polishing mirrors for a single coin. As he ground them, he would ask the owner if they suffered any ailments, then produce a purple pill to give them. All who received it were cured. Thus he lived for decades.",
      "overlap_context": "ng prostrated beneath the furnace, pleading for mercy. In an instant, a vermilion phoenix alighted upon the cold forge and said, “Angong, Angong, the cold forge communes with heaven. On the seventh day of the seventh month, you shall be fetched by a crimson dragon.” When the appointed day arrived, the red dragon descended amid a great rain. Angong mounted it and soared toward the southeast. The entire city—tens of thousands of people—gathered to see him off, bidding him farewell as one. He said:",
      "start_char": 10033,
      "end_char": 10440,
      "start_sentence": 795,
      "end_sentence": 828,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.272282361984253,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 24,
      "original_text": "后大疫病，家至户到与药，活者万计，不取一钱。 昊人乃知其真人也。 后主昊山绝崖头，悬药下与人。 将欲去时，语下人曰：吾还蓬莱山，为汝曹下神水。 崖头一旦有水，白色，流从石问来下，服之多愈疾。 立祠十余处。 负局神端，披褐含秀。 术兼和鹊，心托宇宙。 引彼莱泉，灌此绝岫。 欲返蓬山，以齐天寿。 朱璜 朱璜者，广陵人也。 少病毒瘦，就睢山上道士阮丘。 丘怜之，言：卿除腹中三尸，有真人之业，可度教也。 璜曰：病愈，当为君作客三十年，不敢自还。 丘与璜七物药，日服九丸，百日病下如肝脾者数斗。 养之数十日，肥健，心意日更开朗。 与老君《黄庭经》，令日读三过，通之，能思其意。 丘遂与璜俱入浮阳山玉女祠。 且八十年，复见故处，白发尽黑，鬓更长三尺余。 过家#1食，止数年，复去。 如此至武帝末，故在焉。 朱璜寝痕，福祚相迎。 真人投药，三尸俱灵。 心虚神莹，腾赞幽冥。 毛赦发黑，超然长生。 黄阮丘 黄阮丘者，睢山上道士也。 衣裘被发，耳长七寸，口中无齿。 日行四百里。",
      "translated_text": "When a great plague later struck, he went from house to house distributing medicine, saving tens of thousands of lives without accepting a single coin. The people of Wu then recognized him as a true transcendent. Later, he took up residence at the edge of a sheer cliff on Mount Wu, lowering medicine down to the people below. As he prepared to depart, he told those below: \"I return to Mount Penglai, where I shall send down divine water for you all.\" One morning, water appeared on the cliff—white in color, flowing down from between the rocks. Many who drank it were cured of their illnesses. Shrines were established in over ten locations in his honor.\n\nThe Mirror-Carrying Transcendent, dignified and refined,\nClad in coarse cloth yet radiant with inner grace.\nHis arts rivaled those of Bian Que,\nHis heart embraced the cosmos entire.\nHe drew forth the springs of Penglai,\nPouring them upon these lofty peaks.\nSoon to return to Penglai’s isles,\nThere to attain the lifespan of heaven.\n\n**Zhu Huang**\nZhu Huang was a native of Guangling. In his youth, he suffered from a virulent wasting disease. He sought out Ruan Qiu, a Daoist on Mount Sui. Taking pity on him, Ruan Qiu said: \"If you expel the Three Worms from your abdomen, you may cultivate the work of a true transcendent—this can be taught.\" Zhu Huang replied: \"If my illness is cured, I shall serve you as a disciple for thirty years, never daring to return home.\" Ruan Qiu gave him a seven-ingredient medicine, instructing him to take nine pills daily. After a hundred days, his illness passed in the form of several *dou* of liver- and spleen-like matter. After nursing himself for several dozen days, he grew robust and healthy, his mind and spirit growing ever clearer. Ruan Qiu then gave him the *Scripture of the Yellow Court*, instructing him to read it three times daily until he had mastered it and could contemplate its meaning. Thereafter, Ruan Qiu took Zhu Huang with him into the Jade Maiden Shrine on Mount Fuyang. After eighty years, they returned to their former abode—Zhu Huang’s white hair had turned black, and his temples now bore tresses over three *chi* long. He visited his family to eat, staying for several years before departing again. He remained thus until the end of Emperor Wu’s reign.\n\nZhu Huang’s infirmity faded,\nFortune and blessing drew near.\nThe true transcendent administered his medicine,\nAnd the Three Worms were all transformed.\nWith a heart emptied and spirit luminous,\nHe soared to praise in the unseen realms.\nHis hair, once hoary, turned black,\nTranscending to attain long life.\n\n**Huang Ruan Qiu**\nHuang Ruan Qiu was a Daoist on Mount Sui. Clad in furs with unbound hair, his ears measured seven *cun* in length, and his mouth was toothless. He could walk four hundred *li* in a day.",
      "overlap_context": "ribution; those who act with virtue shall receive favor.\n\n**The Master of the Mirror-Carrying Case**\nThe Master of the Mirror-Carrying Case was of unknown origin. His speech resembled that of the people between Yan and Dai. He often carried a mirror-grinding case through the markets of Wu, polishing mirrors for a single coin. As he ground them, he would ask the owner if they suffered any ailments, then produce a purple pill to give them. All who received it were cured. Thus he lived for decades.",
      "start_char": 10440,
      "end_char": 10864,
      "start_sentence": 829,
      "end_sentence": 858,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.715824604034424,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 25,
      "original_text": "於山上种葱莲百余年，人不知也。 时下卖药，朱璜发明之，乃知其神#2人也。 地动山崩道绝，预戒下人，世共奉祠之。 葱蔼岩岭，实栖若人。 被裘散发，轻步绝伦。 含道养生，妙观通神。 发验朱璜，告褊下民。 女丸 女丸者，陈市上沽酒妇人也。 作酒常美，遇仙人过其家饮酒，以《素书》五卷为质。 丸开视其书，乃养性交接之卫。 丸私写其文要，更设房室，纳诸年少饮美酒，与止宿，行文书之法。 如此三十年，颜色更如二十时。 仙人数岁复来过，笑谓丸曰：盗道无师#3，有翅不飞。 遂弃家追仙人去，莫知所之。 云：",
      "translated_text": "On the mountain, he cultivated scallions and lotuses for over a hundred years, unknown to others. Occasionally descending to sell medicine, Zhu Huang revealed his presence, and only then did people recognize him as a divine transcendent. When earthquakes or landslides severed the paths, he would forewarn those below, and the world revered him with sacrifices.\n\nAmidst the misty peaks of scallion-clad cliffs,\nHe made his dwelling in truth.\nClad in furs with unbound hair,\nHis light steps surpassed all bounds.\nEmbracing the Dao to nurture life,\nHis wondrous insight pierced the unseen.\nZhu Huang bore witness to his power,\nAnd warned the people below.\n\n**Nü Wan**\nNü Wan was a woman who sold wine in the market of Chen. Her brew was always exquisite. Once, an immortal passed her home to drink, leaving behind five scrolls of the *Plain Book* as collateral. Wan opened and read them, discovering methods for nurturing vitality and harmonizing union. Secretly transcribing their essentials, she arranged chambers to welcome young men, offering fine wine and lodging, practicing the techniques from the text. Thus, for thirty years, her complexion remained as youthful as a woman of twenty.\n\nYears later, the immortal returned and, laughing, said to Wan: *\"Stealing the Dao without a master, you have wings yet do not fly.\"* Thereupon, she abandoned her home to follow the immortal, and none knew where they went.",
      "overlap_context": " infirmity faded,\nFortune and blessing drew near.\nThe true transcendent administered his medicine,\nAnd the Three Worms were all transformed.\nWith a heart emptied and spirit luminous,\nHe soared to praise in the unseen realms.\nHis hair, once hoary, turned black,\nTranscending to attain long life.\n\n**Huang Ruan Qiu**\nHuang Ruan Qiu was a Daoist on Mount Sui. Clad in furs with unbound hair, his ears measured seven *cun* in length, and his mouth was toothless. He could walk four hundred *li* in a day.",
      "start_char": 10864,
      "end_char": 11107,
      "start_sentence": 859,
      "end_sentence": 874,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.18906831741333,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 26,
      "original_text": "玄素有要，近取诸身。 彭聘得之，五卷以陈。 女丸蕴妙，仙客来臻。 倾书开引，双飞绝尘。 陵阳子明 陵阳子明者，铨乡人也。 好钓鱼，於旋溪钓得白龙。 子明惧，懈钩拜而放之。 后得白鱼，腹中有书，教子明服食之法。 子明遂上黄山，采五石脂，沸水而服之。 三年，龙来迎去，止陵阳山上百余年。 山去地千余丈，大呼下人，令上山半。 告言溪中子安当来，问子明钓车在否。 后二十余年，子安死，人取葬石山下。 有黄鹤来栖其冢旁树上，呜呼子安。 云： 陵阳垂钓，白龙衔钩。 终获瑞鱼，灵述是修。 五石溉水，腾山乘虹。 子安果没，呜鹤何求。 邗子 邗子者，自言蜀人也。",
      "translated_text": "The essentials of the *Mysterious and Plain* lie near, drawn from the body itself.\nPeng Pin grasped them, and five scrolls were set forth.\nNü Wan harbored their wonders; an immortal guest arrived.\nPouring out the texts, she spread their teachings—together they soared beyond the dust.\n\n**Lingyang Ziming**\nLingyang Ziming was a man of Quan Village. Fond of fishing, he once hooked a white dragon in the whirling stream of Xuan Brook. Terrified, Ziming loosened the hook, bowed, and released it. Later, he caught a white fish whose belly contained a book, teaching him the methods of ingesting and consuming elixirs. Ziming then ascended Mount Huang, where he gathered the five mineral fats and boiled them in water to ingest. After three years, a dragon came to welcome him away, and he dwelled on Mount Lingyang for over a hundred years. The mountain rose over a thousand *zhang* above the earth; he would call down to those below, bidding them ascend halfway up the slope. He told them that a man named Zi’an from the stream would come, and asked whether Ziming’s fishing cart still remained. Over twenty years later, Zi’an died, and people buried him beneath Stone Mountain. A yellow crane came to perch in the tree beside his tomb, crying out Zi’an’s name.\n\nLingyang cast his line, the white dragon took the hook.\nAt last he gained the auspicious fish, and the numinous script guided his cultivation.\nFive minerals steeped in water, he ascended the mountain riding the rainbow.\nWhen Zi’an indeed perished, what did the crying crane seek?\n\n**Hanzi**\nHanzi claimed to be a man of Shu.",
      "overlap_context": "turing vitality and harmonizing union. Secretly transcribing their essentials, she arranged chambers to welcome young men, offering fine wine and lodging, practicing the techniques from the text. Thus, for thirty years, her complexion remained as youthful as a woman of twenty.\n\nYears later, the immortal returned and, laughing, said to Wan: *\"Stealing the Dao without a master, you have wings yet do not fly.\"* Thereupon, she abandoned her home to follow the immortal, and none knew where they went.",
      "start_char": 11107,
      "end_char": 11382,
      "start_sentence": 875,
      "end_sentence": 896,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.378462553024292,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 27,
      "original_text": "好放犬子，时有犬走入山穴，邢子随入十余宿，行度数百里。 上出山头上，有台殿宫府，青松树森然，仙吏侍卫甚严。 见故妇主洗鱼，与邢子符一函并药，便使还与成都令乔君。 乔君发函，有鱼子也。 着池中养之一年，皆为龙形。 复送符还山上。 犬色更赤，有长翰，常随邢子往来。 百余年，遂留止山上。 时下来护其宗族。 蜀人立祠於穴口，常有鼓吹传呼声。 西南数千里共奉祠焉。 邢子寻犬，容入仙穴。 馆阁峨峨，青松列列。 受符传药，往来交结。 遂栖灵岑，音响昭彻。 木羽 木羽者，巨鹿南和平乡人也。 母贫贱，主助产。 尝探产妇儿，生便开目，视母大笑。 其母大怖。 夜梦见大冠赤积者守儿，言：此司命君也，当报汝恩，使汝子木羽得仙。 母阴信识之。 母后生儿，字之为木羽。 所探儿生年十五，夜有车马来迎去，遂过母家呼：木羽，木羽，为御来。 遂俱去。 后二十余年，鹳雀旦衔二尺鱼着母户上。 母匿不道而卖其鱼。 三十年乃没去。 母至百年乃终。",
      "translated_text": "Hanzi delighted in setting his hound free. Once, the dog ran into a mountain cavern, and Hanzi followed it in, spending over ten nights within, traversing several hundred *li*. Emerging atop the mountain, he found terraces, halls, and palaces, with verdant pines standing dense and tall, and immortal officials standing guard in strict array. There, he saw his former wife, who was washing fish, and she gave Hanzi a sealed talisman and medicine, bidding him return and deliver them to Magistrate Qiao of Chengdu. When Magistrate Qiao opened the seal, he found fish roe within. He placed them in a pond, and after a year, they all took the form of dragons. The talisman was then sent back to the mountain. The hound’s coat turned crimson, and it grew long wings, ever accompanying Hanzi in his comings and goings. After over a hundred years, Hanzi remained on the mountain, descending only at times to protect his clan. The people of Shu built a shrine at the cavern’s mouth, where the sounds of drums and pipes and voices calling out were often heard. For thousands of *li* to the southwest, all revered this shrine.\n\nHanzi, in pursuit of his hound,\nentered the immortal cavern’s ground.\nTowering halls stood grand and bright,\nrows of pines in verdant height.\nTalisman and medicine he received,\nto and fro his ties he weaved.\nAt last he dwelled on peaks divine,\nwhere echoes rang in tones sublime.\n\nMuyu\n\nMuyu was a man of Nanheping Township in Julu. His mother, poor and lowly, worked as a midwife. Once, while attending a birth, she reached for the newborn, who at once opened its eyes, gazed at her, and laughed aloud. Terrified, she dreamed that night of a man in a tall hat and red robes standing guard over the child, saying: “This is the Lord of Life. He shall repay your kindness, and your son Muyu shall attain immortality.” His mother secretly believed and remembered this. Later, when she bore a son, she named him Muyu. The child she had delivered turned fifteen, when one night a carriage and horses arrived to take him away. Passing by his mother’s home, they called out: “Muyu, Muyu, come and be our driver!” Then they all departed together. Over twenty years later, a stork delivered a two-*chi* fish to his mother’s door at dawn. She hid it and told no one, selling the fish instead. After thirty years, he vanished entirely. His mother lived to be a hundred before she passed away.",
      "overlap_context": "emained. Over twenty years later, Zi’an died, and people buried him beneath Stone Mountain. A yellow crane came to perch in the tree beside his tomb, crying out Zi’an’s name.\n\nLingyang cast his line, the white dragon took the hook.\nAt last he gained the auspicious fish, and the numinous script guided his cultivation.\nFive minerals steeped in water, he ascended the mountain riding the rainbow.\nWhen Zi’an indeed perished, what did the crying crane seek?\n\n**Hanzi**\nHanzi claimed to be a man of Shu.",
      "start_char": 11382,
      "end_char": 11772,
      "start_sentence": 897,
      "end_sentence": 925,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.66224193572998,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 28,
      "original_text": "司命挺灵，产母震惊。 乃要报了，契定未成。 道足三五，轻驷宵迎。 终然报德，久乃遐龄。 玄俗 玄俗者，自言河问人也。 饵巴豆。 卖药都市，七丸一钱，治百病。 河间王病瘦，买药服之，下蛇十余头。 问药意，俗云：王痕乃六世余殃下堕，即非王所招也。 王常放乳鹿，伶＃４母也，仁心感天，故当遭俗耳。 王家老舍人自言：父世见俗，俗形无影。 王乃呼俗日中看，实无影。 王欲以女配之，俗夜亡去。 后人见於常山下。 质虚影灭，时惟玄俗。 布德神丸，乃寄鹿赎。 道发河问，亲宠方渥。 腾龙不制，超然绝足。 赞曰：《易》称太极，是生两仪。 两仪生，然后有人民。 有人民，然后有生死。 生死之义着明矣。 盖万物施张，浑尔而就，亦无所不备焉。 神矣妙矣，精矣微矣，其事不可得一一论也。 圣人仰则观象於天，俯则观法於地。 日月运行，四时分治，五星受制於太微，监无道之国，吉凶预见，以戒土者。 动静言语，应效相通，有自来矣。 天然虽不言，其变化云为，不可谓之无也。 《周书》序：桑娇问涓子曰：有死亡而复云有神仙者，事两成邪？ 涓子曰：言固可两有耳。 《孝经援神契》言：不过天地，造灵洞虚，犹立五岳，设三台，阳精主外，阴精主内，精气上下，经纬人物，道治非一。 若夫草木，皆春生秋落必矣，而木有松、梧、柜、檀之伦百八十余种，草有芝英、萍实、灵沼、黄精、白符、竹霎、戒火，长生不死者万数。 盛冬之时，经霜历雪，蔚而不雕，见斯其类也。 何怪於有仙邪？ 余尝得秦大夫阮仓撰《仙图》，自六代迄今，有七百余人。 始皇好游仙之事，庶几有获，故方士雾集，祈祀弥布，殆必因迩托虚，寄空为实，不可信用也。 若周公《黄录》记太白下为王公，然岁星变为宁寿公等，所见非一家。 圣人所以不开其事者，以其无常。 然虽有时着，盖道不可弃，距而闭之，尚贞正也。 而《论语》云怪力乱神，其微旨可知矣。 列仙传卷下竟 ＃１原文无『家』字，据《四库》本补。 ＃２『神』字原文作『年』，据《四库》本改。 ＃３『师』字原文作『私』，据《四库》本改。 ＃４『伶』字原文作『麟』，据《四库》本改。",
      "translated_text": "The Lord of Life manifested his numinous power, and the mother was struck with terror. Thus was her kindness repaid, though the covenant remained unfulfilled. When the Dao had ripened through the three and five phases, a light-drawn chariot came to fetch him by night. In the end, virtue was requited, and she attained a distant, enduring lifespan.\n\nXuan Su\nXuan Su claimed to be a man of Hejian. He ingested croton beans and sold medicine in the marketplace—seven pills for a single coin, curing all ailments. The Prince of Hejian suffered from emaciation; after purchasing and taking the medicine, he passed more than ten serpents. When asked the principle behind the remedy, Su explained: “The prince’s affliction was the lingering calamity of six generations of accumulated misfortune, not something he himself had incurred.” The prince had once released a nursing doe—his own mother in a former life—his benevolence moving Heaven, and thus he was destined to encounter Su.\n\nAn elder retainer of the prince’s household said his father had seen Su in past generations, and that Su cast no shadow. The prince summoned Su at midday to observe him, and indeed, no shadow appeared. The prince wished to betroth his daughter to him, but Su fled by night. Later, he was seen beneath Mount Chang. His substance was void, his shadow vanished—such was Xuan Su in his time.\n\nHe spread virtue through divine pills, redeeming his debt through the doe. His Dao flourished in Hejian, where royal favor was deep and intimate. Unrestrained by soaring dragons, he transcended all bounds.\n\n**Eulogy:**\nThe *Book of Changes* speaks of the Great Ultimate, from which the Two Modes arise. Once the Two Modes are born, then come the people. With the people, life and death follow. The meaning of life and death is thus made manifest.\n\nAll things unfold in boundless profusion, merging into oneness, nothing left unprovided. How wondrous, how subtle, how refined, how minute—such matters cannot be exhaustively discussed one by one. The sage, looking up, observes the patterns of Heaven; looking down, he examines the models of Earth. The sun and moon move in their courses; the four seasons govern in turn. The five planets are regulated by the Supreme Subtlety, overseeing the wayward states, foretelling fortune and misfortune to warn the lords of the land. Movement and stillness, speech and response—correspondences flow in harmony, as they have since ancient times.\n\nThough Heaven does not speak, its transformations and deeds cannot be called nonexistent. The *Preface to the Book of Zhou* records that Sangjiao asked Master Juan: “There is death, yet there are also those who speak of divine transcendents—are these two things both true?” Master Juan replied: “They can indeed both be true.”\n\nThe *Canon of Filial Piety in Aid of the Numinous* states: “Beyond Heaven and Earth, the numinous pervades the void, just as the Five Peaks are established and the Three Terraces are set. The yang essence governs the outer, the yin essence governs the inner; qi ascends and descends, weaving through all beings. The Dao’s governance is not singular.”\n\nAs for plants and trees, they surely sprout in spring and wither in autumn—yet among trees there are pines, parasols, cedars, sandalwoods, and over a hundred and eighty other kinds; among grasses there are lingzhi, floating fruit, spirit ponds, Solomon’s seal, white talismans, bamboo shoots, and fire-warding herbs—tens of thousands that live long and never die. In the depths of winter, enduring frost and snow, they flourish without fading. If such things exist in this class, why marvel at the existence of transcendents?\n\nI once obtained the *Chart of Transcendents* compiled by Ruan Cang, a grandee of Qin, which records over seven hundred individuals from the Six Dynasties to the present. The First Emperor was fond of seeking transcendence, and though he nearly succeeded, the magicians gathered like mist, their prayers and sacrifices spreading far and wide. Most likely, they relied on the near to fabricate the distant, turning emptiness into substance—such things cannot be trusted.\n\nYet the *Yellow Register* of the Duke of Zhou records that the planet Venus descended to become a duke, and that the planet Jupiter transformed into the Duke of Ningshou, among other such accounts, not confined to a single source. The sages did not expound on such matters because they are without constancy. Nevertheless, though they sometimes manifest, the Dao cannot be abandoned. To reject and seal them away is still to uphold correctness.\n\nAs the *Analects* says of “the strange, the forceful, the chaotic, and the numinous,” its subtle purport may be discerned.\n\n*Accounts of Transcendents, Scroll the Lower, concludes.*",
      "overlap_context": " bore a son, she named him Muyu. The child she had delivered turned fifteen, when one night a carriage and horses arrived to take him away. Passing by his mother’s home, they called out: “Muyu, Muyu, come and be our driver!” Then they all departed together. Over twenty years later, a stork delivered a two-*chi* fish to his mother’s door at dawn. She hid it and told no one, selling the fish instead. After thirty years, he vanished entirely. His mother lived to be a hundred before she passed away.",
      "start_char": 11773,
      "end_char": 12622,
      "start_sentence": 926,
      "end_sentence": 971,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.07608962059021,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\列仙传.txt",
        "category": "记传类"
      }
    }
  ]
}