{
  "source_id": "北斗七元星灯仪",
  "source_file": "chunked_daozang\\北斗七元星灯仪.json",
  "total_chunks": 3,
  "total_original_chars": 2430,
  "total_translated_chars": 16712,
  "total_translation_time": 77.01285600662231,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\威仪类\\北斗七元星灯仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**The Rite of the Seven Luminaries of the Northern Dipper**\n\n**Scripture Title:** *The Rite of the Seven Luminaries of the Northern Dipper*. One fascicle.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Weiyi* Category.\n\n**The Rite of the Seven Luminaries of the Northern Dipper**\nThe ritual proceeds according to form.\n\nWe have heard that the Three Radiant Heavens, with the Nine Mornings as the origin of sacred *qi*, and the revolving governance of the Five Constants, with the Seven Governors as the primal axis, establish the pivot of the Supreme Ultimate and preside over the throat and tongue of the celestial vault. When they emit their splendor, the four seasons are harmonized; when they contain their luminance, the ten thousand norms are expanded. The thirty-six seasonal nodes gather at the Celestial Pass through kalpas unseen; the twelve hours distinguish the directions and earthly boundaries. Above the Purple Tenuity, they encircle the imperial throne in ever-heightening majesty; within the Yellow Path, they array the stellar courses without error. At times, they traverse obliquely beyond their stations, rectifying the epochs of yin-yang eclipses; at others, they summon the turning of the cosmic wheel, responding to the reckonings of the sun and moon’s shifts. Their numinous scrutiny reveals even the slightest detail; their profound penetration equalizes all categories. Thus, they enable the descent from death and ascent to life, illuminating the cinnabar script at the Southern Culmen; they prolong lifespan and augment destiny, inscribing the purple brush upon the Eastern Florescence. They illumine the households of accumulated goodness, perfectly aligning with the blessings of descending auspices.\n\nNow, so-and-so, having long inherited wondrous karmic affinity and been born in an age of prosperity, bears the Emperor’s profound regard and, moved by the dust-bound heart, knows no recourse. Thus, they invite true companions to reverently initiate the immortal rites, kindling and illuminating the lamps of the Northern Dipper of the Most High for the prolongation of life. They unfurl the ritual jade at the pole-star altar and array the silver vessels to establish the Dipper. Purple mists waft ethereally, concealing the body beneath the canopied splendor; cinnabar flames blaze resplendently, welcoming the hidden radiance of the Curved Array. We humbly pray that blossoms of good fortune may unfold and the ashes of floating calamities fall away. May fortune and emolument increase in grandeur, emitting numinous light within the realm of longevity; may auspiciousness arrive and settle, suffusing the lofty vastness with ascending *qi*.\n\nBowing in reverence, we take refuge and sincerely intone:\n*Numinous Lord Who Protects Life and Safeguards the Body.*\n\nWe, the assembled, with devoted hearts take refuge and commit our lives to the Great Sage of the Pivot Palace, the True August Sovereign of Greedy Wolf and Yang Brightness, and all the divine officials among the Dipper’s spirits.\n\nWe have heard that the flying mornings merge with the radiant heavens, and the Pivot Star holds authority over the kalpas’ gatherings; governing administration and correcting transgressions, Yang Brightness presides over the turning of the Jade Armillary. Above, they govern the transformations of the Nine Heavens; in the center, they oversee the numina of the Five Peaks; below, they regulate human relations and, peripherally, distinguish the ranks of all beings. They determine the mandate of life and death and scrutinize good and evil without partiality.\n\nNow, so-and-so, reverently offering the sincerity of their heart, devoutly follows the wondrous model, arranging the stellar forms of the Dipper’s pole and preparing the ritual of incense, flowers, and lamps. With devoted hearts, we take refuge and commit our lives to the Great Sage of the Pivot Palace, the True August Sovereign of Greedy Wolf and Yang Brightness.\n\nWe humbly pray that their radiance may turn and illuminate, opening the precious mirror upon the numinous chart; that they may inscribe emolument and add years, engraving living names upon the jade tablets. May past sins be erased from former kalpas, and blessings shade future descendants.\n\nBowing in reverence, we take refuge and sincerely intone:\n*Greedy Wolf prolongs life, the Four Numinous Ones return to the true.*\n*Flowing light descends in reflection, penetratingly illumining the mysterious darkness.*\n*The Seven Origins record destinies, firmly attending the numinous body.*\n*The numinous and true record the registers, the Upper Origin guards the form.*\n*May the hun and po be ever-preserved, ears and eyes undisturbed.*\n*Drawing in protection to sustain life, the primordial true flows and circulates.*\n*Preserving the true and natural, ascending to the Jade Capital.*\n\nWe, the assembled, with devoted hearts take refuge and commit our lives to the Great Sage of the Armillary Palace, the True August Sovereign of Giant Gate and Yin Essence, and all the divine officials among the Dipper’s spirits.\n\nWe have heard that the stars possess five gates, harmonizing with the Three Luminaries in distant radiance; the gates open in fourfold illumination, merging with the ten thousand *qi* to soar in splendor. They assess the promotions of the Celestial Treasury and govern the emolument and longevity of the myriad people. Escaping their profound scrutiny is impossible; truly, one relies upon their bright bridge.\n\nNow, so-and-so, having prepared the jade altar and hastened their sincerity to the Golden Portal, arranges the stellar forms of the Dipper’s pole and prepares the ritual of incense, flowers, and lamps. With devoted hearts, we take refuge and commit our lives to the Great Sage of the Armillary Palace, the True August Sovereign of Giant Gate and Yin Essence.\n\nWe humbly pray that the body may pass through a thousand calamities and life be extended with a hundred blessings; that the heavens open the divine precincts and *qi* gather in the true origin. May names be inscribed upon the azure tablets, firmly securing long years upon the kalpa-stone; may goodness be recorded upon the cinnabar terrace, augmenting lifespan with the divine camphor.\n\nBowing in reverence, we take refuge and sincerely intone:\n*Giant Gate averts calamity, the lofty and true numinous immortals.*\n*Flowing light shines in radiance, protecting life and prolonging years.*\n*The Seven Origins govern the registers, naturally attaining longevity.*\n*Eradicating hardships and dangers, disasters and difficulties shift away.*\n*The viscera and bowels become luminous, within and without free from transgression.*\n*Light and motion merge with the radiant heavens, conjoining with the spirits.*\n*Refining and transforming naturally, ascending to the Jade Capital.*\n\nWe, the assembled, with devoted hearts take refuge and commit our lives to the Great Sage of the Jade Armillary Palace, the True Person and August Sovereign of Emolument Existence, and all the divine officials among the Dipper’s spirits.\n\nWe have heard that resting beneath the canopied splendor, one merely knows the brightness of empty steps; abiding in the profound void, the marvels of the flying spirits remain unfathomable. Above the Eight Radiant Heavens and Nine Celestial Realms, the Dao accords with the pure registers to commune with the true; upon the heights of the Five Peaks and Four Waterways, the immortals are enrolled in the Yellow Terrace to receive their duties. How much more so for this lower realm, which truly looks up to their residual light.\n\nNow, so-and-so, having purified themselves in fasting and covenant, establishes the ritual altar, arranging the stellar forms of the Dipper’s pole and preparing the ritual of incense, flowers, and lamps. With devoted hearts, we take refuge and commit our lives to the Great Sage of the Jade Armillary Palace, the True Person and August Sovereign of Emolument Existence.\n\nWe humbly pray that blessings may accord with distant years and fortune be bestowed through vast kalpas.\n\nThree myriad myriad cycles of *jiazi*, earth enduring and heaven eternal; the twelve numinous gates, yang opening and yin closing. Serene in the white sun, savoring the harmony of the Unwrought. With bowed heads we take refuge and devoutly intone:\n\n*Luxun* preserves life, exalted perfected ones disperse the spirits.\nThe upright *qi* gathers and subdues, attending and guarding with reverent hospitality.\nThe Seven Primes are enrolled above, conveying the primordial true.\nFlowing forth in numinous clarity, they join the body with the cavernous ford.\nEver warding off inauspiciousness, inwardly guarding the form.\nErasing death to ascend life, unfolding with the spirits.\nPreserving and advancing naturally, ascending to the Jade Dawn.\n\nWe, the assembled, with devoted hearts take refuge and commit our lives to the August Sovereign of the Power Palace, the True Person of Wenchu-Xuanming, and the divine immortals and spirit officials of the Dipper.\n\nWe have heard that the Star Lord dwells in profound obscurity, his position governing swift movement. Concealed and subtly radiant, he presides over the Three Palaces of the Northern Emperor; rewarding good and punishing excess, he commands the five *qi* of the Black Spirits. At times he annihilates sudden calamities, launching fiery armor across the Six Heavens; at others he severs the disloyal, illuminating crimson troops at the four borders. All that moves or grows owes its birth and completion to him.\n\nNow, so-and-so, having purified the ritual altar and cleansed away dust and filth, arranges the stellar forms of the Dipper’s pole and prepares the ritual of incense, flowers, and lamps. With devoted hearts, we take refuge and commit our lives to the August Sovereign of the Power Palace, the True Person of Wenchu-Xuanming.\n\nWe humbly pray that sins be erased and transgressions removed, expunging names from the ghostly registers of the Nine Yin; that souls be bound and spirits restrained, obtaining the immortal formula of the Seven Returns. In action or stillness, may there be no fear of misfortune; in breath and sight, may there be the blessing of Great Harmony. Inheriting this supreme good, may wondrous fortune forever abound.\n\nWith bowed heads we take refuge and devoutly intone:\n*Wenchu* augments destiny, flowing truth disperses support.\nLight illumines the lower guard, unfolding with the form.\nThe Seven Primes cross the register, cavernously resplendent in the Mysterious Void.\nThey pacify and protect the spirit, safeguarding the body.\nAwesome in their numinous power, the true spirits ride the floating.\nClear vision within and without, they unite with the spirits.\nPreserving and refining naturally, ascending to the Jade Void.\n\nWe, the assembled, with devoted hearts take refuge and commit our lives to the August Sovereign of the Balance Palace, the True Person of Lianzhen-Danyuan, and the divine immortals and spirit officials of the Dipper.\n\nWe have heard that upon the misty heights of Kun Terrace, the seven gates intermingle their radiance; the concealed brilliance of the Golden Canopy subtly connects the Two Effulgences. The crimson tree bears fruits of white essence, while jade nectar congeals into the elixir of refinement. They review the records of the exalted perfected, governing the ledgers of ghosts and spirits; they oversee the rudiments of lesser learning, holding the key to life and death.\n\nNow, so-and-so, having cleansed the spirit and adhered to the ritual canons, arranges the stellar forms of the Dipper’s pole and prepares the ritual of incense, flowers, and lamps. With devoted hearts, we take refuge and commit our lives to the August Sovereign of the Balance Palace, the True Person of Lianzhen-Danyuan.\n\nWe humbly pray that good fortune tread the Three Primes, erasing the three disasters in fleeting shadows; that the Five Movements be harmoniously met, planting the five blessings in deep roots. Whether in office or honor, may one fully inherit the pure and lofty lineage; whether traveling as a merchant or sitting as a trader, may all become prosperous and flourishing families.\n\nWith bowed heads we take refuge and devoutly intone:\n*Lianzhen* dispels calamity, the Four Brightnesses open yang.\nThe exalted spirits disperse radiance, cavernously illuminating divine light.\nThe Seven Primes guard the register, the Controller of Destiny extends longevity.\nThe names are inscribed above, granting us enduring length.\nPreserving and fortifying life, removing misfortune and banishing ill fortune.\nThe divine perfected manifest their power, flowing forth into the cavernous realm.\nAchieving natural ascent, ascending to the Jade Hall.\n\nWe, the assembled, with devoted hearts take refuge and commit our lives to the August Sovereign of the Open Yang Palace, the True Person of Wuqu-Beiji, and the divine immortals and spirit officials of the Dipper.\n\nWe have heard that the Jade Tower gleams with splendor, concealing the flying radiance of the Celestial Pole’s star; the jade tablets shimmer with script, recording the revolving paths of the eternal Dao. They establish the steps of the Dharma Wheel, examining the diligence of supreme learning. Their flying brilliance illuminates the eight gates, leaving no darkness unlit; their cast radiance spans ten thousand miles, dissolving all barriers.\n\nNow, so-and-so, having entrusted their traces to the dusty world while dwelling in the realm of the Dao, arranges the stellar forms of the Dipper’s pole and prepares the ritual of incense, flowers, and lamps. With devoted hearts, we take refuge and commit our lives to the August Sovereign of the Open Yang Palace, the True Person of Wuqu-Beiji.\n\nWe humbly pray that a single thought may unlock ascent, with the myriad spirits in harmonious attendance. Pouring the Silver River across the azure vastness, may distant years be inscribed; towering the Ministerial Peaks in the jade heavens, may one forever ascend to long life. May kinship be harmonious, descendants joyful.\n\nWith bowed heads we take refuge and devoutly intone:\n*Wuqu* disperses misfortune, the mysterious radiance removes calamity.\nThe Three Lights shine brilliantly, the myriad *qi* flow unimpeded.\nThe Seven Primes inscribe the register, arrayed in the Dipper’s midst.\nExamining the body and protecting life, may misfortune never befall.\nThe Supreme Sovereign preserves the true, destiny and emolument without end.\nThe upright Dao endures forever, uniting with the spirits without limit.\nPreserving life naturally, ascending to the Jade Palace.\n\nWe, the assembled, with devoted hearts take refuge and commit our lives to the August Sovereign of the Jade Light Palace, the True Person of Pojun-Tianguan, and the divine immortals and spirit officials of the Dipper.\n\nWe have heard that as heaven revolves and earth turns, the Jade Light propels the cavernous wheel; as the Dipper establishes the stellar paths, the August Sovereign records the degrees of movement. His position is exalted among the Celestial Emperors, his might subdues the hordes of demons. Where the upright *qi* descends, the myriad things fulfill their nature of birth and completion; where his flying command points, the hundred evils have no form of escape.\n\nNow, so-and-so, having cleansed the altar and spread sincerity, arranges the stellar forms of the Dipper’s pole and prepares the ritual of incense, flowers, and lamps. With devoted hearts, we take refuge and commit our lives to the August Sovereign of the Jade Light Palace, the True Person of Pojun-Tianguan.\n\nWe humbly pray that the Dao accords with the Cinnabar Terrace, the Southern Dipper inscribing the characters of long life; that sins vanish from the Dark Bureau, the Northern Capital proclaiming the names of the deathless. May the four seasons be well-ordered, fully partaking in the blessings of radiant splendor; may the entire household, in their conduct, all be touched by the winds of purity.\n\nWith bowed heads we take refuge and devoutly intone:\nThe Seven Primes shelter and protect, Heavenly Worthies.\n*Pojun* aids the declining, conveying the mysterious true.\nThe Southern Controller preserves life, extending years and calming the body.\nThe Seven Primes govern the register, the numinous perfected honor names.\nArrayed among the exalted immortals, their blessings join and merge.\nThe cinnabar spirits disperse light, cavernously entering the Mysterious Obscurity.\nSoaring through the heavens, they share the same age with the spirits.\n\nThe life-preserving power flows naturally, ascending to the Jade Court.\nThe Rite of the Seven Stars’ Lamps of the Northern Dipper is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "北斗七元星灯仪 经名：北斗七元星灯仪。 一卷。 底本出处：《正统道藏》洞真部威仪类。 北斗七元星灯仪 法事如式 伏闻开明三景，九晨为梵炁之宗； 回度五常，七政乃元纲之首。 定枢机於太极，司喉舌於圆穹。 吐辉则调理四时，含耀而恢张万范。 三十六候，冥劫会於天关； 一十二时，辩方维於地纪。 紫微之上，拱帝座以弥高； 黄道之中，布星躔而不忒。 或旁行越位，正阴阳勃蚀之期； 或召运舞轮，应日月推移之数。 灵鉴而无毫不显，渊通而有类咸均。 故得落死上生，焕丹文於南极； 延龄益算，注紫笔於东华。 昭明积善之家，吻合降祥之庆。 今某人夙承妙瘾，生遇昌时，荷帝念以深深，抚尘心而罔措。 辄邀真侣，恭启仙科，点照太上北斗延生星灯。 法璇极以舒坛，布银缸而建斗。 紫烟缥缈，想华盖以藏身； 丹焰荧煌，迓勾陈而隐景。 伏愿花开善瑞，烬落浮灾。 福禄增崇，发灵光於寿域； 吉祥至止，霭冲炁於高闳。 稽首归依，虔诚赞咏：长生保命护身天尊。 臣众等志心皈命，枢宫大圣、贪狼阳明真皇君，斗中神仙诸灵官。 伏闻飞晨合景，枢星掌劫会之权； 司政紏非，阳明主璇玑之运。 上宰九天之化，中监五岳之灵，下总人伦，旁分品类。 定死生之有命，鉴善恶以无私。 今某人恭款刍心，虔依妙范，布斗极星辰之象，备香花灯供之仪，志心皈命枢宫大圣、贪狼阳明真皇君。 伏愿回光启耀，开宝鉴於灵图； 注禄添年，刻生名於玉简。 罪消昔劫，福荫后昆。 稽首归依，虔诚赞咏： 贪狼延生，回真四灵。 流光下映，洞焕玄冥。 七元纪籍，固侍体灵。 灵真纪录，上元卫形。 魂魄长守，耳目无惊。 摄卫扶命，胎真流行。 保真自然，上升玉京。 臣众等志心皈命，璇宫大圣、巨门阴精真皇君，斗中神仙诸灵官。 伏闻星有五门，协三光而远映； 门开四照，合万炁以腾辉。 校天府之升迁，主兆民之禄寿。 委质难逃於渊鉴，通津实赖於明梁。 今某人蒇事瑶坛，驰诚金阙，布斗极星辰之象，备香花灯供之仪，志心皈命璇宫大圣、巨门阴精真皇君。 伏愿身度千灾，命延百福，天开神宇，炁集真元。 碧简题名，固长年於劫石； 丹台纪善，增寿算於灵椿。 稽首归依，虔诚赞咏： 巨门度厄，高真灵仙。 流光辉映，保命延年。 七元主籍，自得长生。 消灭艰危，灾难移迁。 脏腑开明，内外无愆。 光运合景，与神同连。 炼化自然，上升玉京。 臣众等志心皈命，玑宫大圣、禄存真人真皇君，斗中神仙诸灵官。 伏闻偃息华盖，徒知空步之明； 潜洞太虚，莫测飞神之妙。 八景九天之上，道契清箓以通真； 五岳四渎之高，仙隶黄台而受事。 矧兹下土，实仰余光。 今某人洁己斋盟，法为坛墠，布斗极星辰之象，备香花灯供之仪，志心皈命机宫大圣、禄存真人真皇君。 伏 愿庆叶遐年，福资浩劫。",
      "translated_text": "**The Rite of the Seven Luminaries of the Northern Dipper**\n\n**Scripture Title:** *The Rite of the Seven Luminaries of the Northern Dipper*. One fascicle.\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Weiyi* Category.\n\n**The Rite of the Seven Luminaries of the Northern Dipper**\nThe ritual proceeds according to form.\n\nWe have heard that the Three Radiant Heavens, with the Nine Mornings as the origin of sacred *qi*, and the revolving governance of the Five Constants, with the Seven Governors as the primal axis, establish the pivot of the Supreme Ultimate and preside over the throat and tongue of the celestial vault. When they emit their splendor, the four seasons are harmonized; when they contain their luminance, the ten thousand norms are expanded. The thirty-six seasonal nodes gather at the Celestial Pass through kalpas unseen; the twelve hours distinguish the directions and earthly boundaries. Above the Purple Tenuity, they encircle the imperial throne in ever-heightening majesty; within the Yellow Path, they array the stellar courses without error. At times, they traverse obliquely beyond their stations, rectifying the epochs of yin-yang eclipses; at others, they summon the turning of the cosmic wheel, responding to the reckonings of the sun and moon’s shifts. Their numinous scrutiny reveals even the slightest detail; their profound penetration equalizes all categories. Thus, they enable the descent from death and ascent to life, illuminating the cinnabar script at the Southern Culmen; they prolong lifespan and augment destiny, inscribing the purple brush upon the Eastern Florescence. They illumine the households of accumulated goodness, perfectly aligning with the blessings of descending auspices.\n\nNow, so-and-so, having long inherited wondrous karmic affinity and been born in an age of prosperity, bears the Emperor’s profound regard and, moved by the dust-bound heart, knows no recourse. Thus, they invite true companions to reverently initiate the immortal rites, kindling and illuminating the lamps of the Northern Dipper of the Most High for the prolongation of life. They unfurl the ritual jade at the pole-star altar and array the silver vessels to establish the Dipper. Purple mists waft ethereally, concealing the body beneath the canopied splendor; cinnabar flames blaze resplendently, welcoming the hidden radiance of the Curved Array. We humbly pray that blossoms of good fortune may unfold and the ashes of floating calamities fall away. May fortune and emolument increase in grandeur, emitting numinous light within the realm of longevity; may auspiciousness arrive and settle, suffusing the lofty vastness with ascending *qi*.\n\nBowing in reverence, we take refuge and sincerely intone:\n*Numinous Lord Who Protects Life and Safeguards the Body.*\n\nWe, the assembled, with devoted hearts take refuge and commit our lives to the Great Sage of the Pivot Palace, the True August Sovereign of Greedy Wolf and Yang Brightness, and all the divine officials among the Dipper’s spirits.\n\nWe have heard that the flying mornings merge with the radiant heavens, and the Pivot Star holds authority over the kalpas’ gatherings; governing administration and correcting transgressions, Yang Brightness presides over the turning of the Jade Armillary. Above, they govern the transformations of the Nine Heavens; in the center, they oversee the numina of the Five Peaks; below, they regulate human relations and, peripherally, distinguish the ranks of all beings. They determine the mandate of life and death and scrutinize good and evil without partiality.\n\nNow, so-and-so, reverently offering the sincerity of their heart, devoutly follows the wondrous model, arranging the stellar forms of the Dipper’s pole and preparing the ritual of incense, flowers, and lamps. With devoted hearts, we take refuge and commit our lives to the Great Sage of the Pivot Palace, the True August Sovereign of Greedy Wolf and Yang Brightness.\n\nWe humbly pray that their radiance may turn and illuminate, opening the precious mirror upon the numinous chart; that they may inscribe emolument and add years, engraving living names upon the jade tablets. May past sins be erased from former kalpas, and blessings shade future descendants.\n\nBowing in reverence, we take refuge and sincerely intone:\n*Greedy Wolf prolongs life, the Four Numinous Ones return to the true.*\n*Flowing light descends in reflection, penetratingly illumining the mysterious darkness.*\n*The Seven Origins record destinies, firmly attending the numinous body.*\n*The numinous and true record the registers, the Upper Origin guards the form.*\n*May the hun and po be ever-preserved, ears and eyes undisturbed.*\n*Drawing in protection to sustain life, the primordial true flows and circulates.*\n*Preserving the true and natural, ascending to the Jade Capital.*\n\nWe, the assembled, with devoted hearts take refuge and commit our lives to the Great Sage of the Armillary Palace, the True August Sovereign of Giant Gate and Yin Essence, and all the divine officials among the Dipper’s spirits.\n\nWe have heard that the stars possess five gates, harmonizing with the Three Luminaries in distant radiance; the gates open in fourfold illumination, merging with the ten thousand *qi* to soar in splendor. They assess the promotions of the Celestial Treasury and govern the emolument and longevity of the myriad people. Escaping their profound scrutiny is impossible; truly, one relies upon their bright bridge.\n\nNow, so-and-so, having prepared the jade altar and hastened their sincerity to the Golden Portal, arranges the stellar forms of the Dipper’s pole and prepares the ritual of incense, flowers, and lamps. With devoted hearts, we take refuge and commit our lives to the Great Sage of the Armillary Palace, the True August Sovereign of Giant Gate and Yin Essence.\n\nWe humbly pray that the body may pass through a thousand calamities and life be extended with a hundred blessings; that the heavens open the divine precincts and *qi* gather in the true origin. May names be inscribed upon the azure tablets, firmly securing long years upon the kalpa-stone; may goodness be recorded upon the cinnabar terrace, augmenting lifespan with the divine camphor.\n\nBowing in reverence, we take refuge and sincerely intone:\n*Giant Gate averts calamity, the lofty and true numinous immortals.*\n*Flowing light shines in radiance, protecting life and prolonging years.*\n*The Seven Origins govern the registers, naturally attaining longevity.*\n*Eradicating hardships and dangers, disasters and difficulties shift away.*\n*The viscera and bowels become luminous, within and without free from transgression.*\n*Light and motion merge with the radiant heavens, conjoining with the spirits.*\n*Refining and transforming naturally, ascending to the Jade Capital.*\n\nWe, the assembled, with devoted hearts take refuge and commit our lives to the Great Sage of the Jade Armillary Palace, the True Person and August Sovereign of Emolument Existence, and all the divine officials among the Dipper’s spirits.\n\nWe have heard that resting beneath the canopied splendor, one merely knows the brightness of empty steps; abiding in the profound void, the marvels of the flying spirits remain unfathomable. Above the Eight Radiant Heavens and Nine Celestial Realms, the Dao accords with the pure registers to commune with the true; upon the heights of the Five Peaks and Four Waterways, the immortals are enrolled in the Yellow Terrace to receive their duties. How much more so for this lower realm, which truly looks up to their residual light.\n\nNow, so-and-so, having purified themselves in fasting and covenant, establishes the ritual altar, arranging the stellar forms of the Dipper’s pole and preparing the ritual of incense, flowers, and lamps. With devoted hearts, we take refuge and commit our lives to the Great Sage of the Jade Armillary Palace, the True Person and August Sovereign of Emolument Existence.\n\nWe humbly pray that blessings may accord with distant years and fortune be bestowed through vast kalpas.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1087,
      "start_sentence": 0,
      "end_sentence": 71,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.62676739692688,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\北斗七元星灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "三千万之甲子，地久天长； 一十二之灵门，阳开阴闭。 翛闲白日，宴味冲和。 稽首归依，虔诚赞咏： 禄存保命，高真散神。 正炁摄伏，侍卫敬宾。 七元上籍，运致元真。 流演灵明，契体洞津。 永辟不祥，内守身形。 削死上生，与神敷陈。 保举自然，上升玉晨。 臣众等志心皈命，权宫大圣、文曲玄冥真皇君，斗中神仙诸灵官。 伏闻星主渊冥，位司游击。 隐微潜耀，领北帝之三宫； 福善祸淫，摄黑灵之五炁。 或殄除凶勃，飞火甲於六天。 或剪馘不臣，耀朱兵於四鄙。 凡居动植，皆出生成。 今某人洒落坛场，肃清尘垢，布斗极星辰之象，备香花灯供之仪，志心皈命权宫大圣、文曲玄冥真皇君。 伏愿削罪除愆，落九阴之鬼录； 拘魂制魄，得七返之仙方。 行藏无非横之虞，视息合太和之庆。 承兹上善，永洽殊祥。 稽首归依，虔诚赞咏： 文曲益算，流真散扶。 光映下卫，与形同敷。 七元度籍，洞焕玄无。 镇护精神，保卫形躯。 威神可畏，真灵驾浮。 明视表裹，与神齐俱。 保－炼自然，上升玉虚。 臣众等志心皈命，衡宫大圣、廉贞丹元真皇君，斗中神仙诸灵官。 伏闻杳霭昆台之上，交映七门； 隐芒金盖之辉，潜通二景。 绛木结素华之实，琼津凝冶炼之膏。 校录上真，统摄鬼神之簿； 提纲下学，权舆生死之机。 今某人澡雪襟灵，遵承科简，布斗极星辰之象，备香花灯供之仪，志心皈命衡宫大圣、廉贞丹元真皇君。 伏愿善履三元，削三灾於短景； 顺迎五运，植五福於探根。 或在仕登荣，尽继清崇之世； 或行商坐贾，皆为富盛之家。 稽首归依，虔诚赞咏： 廉贞消灾，四明开阳。 上灵散辉，洞映神光。 七元卫籍，司命延昌。 明上纪名，使我绵长。 保固身命，除凶去殃。 神真吐威，流演洞乡。 克携自然，上升玉堂。 臣众等志心皈命，闿阳宫大圣、武曲北极真皇君，斗中神仙诸灵官。 伏闻玉楼炳景，隐飞华宸极之星； 琼简璨文，纪回度空常之道。 定法轮之阶级，考至学之功勤。 飞芒耀於八门，无幽不烛； 掷流光於万里，有碍皆通。 今某人委迹尘寰，宅心道域，布斗极星辰之象，备香花灯供之仪，志心皈命闿阳宫大圣、武曲北极星皇君。 伏愿一念关升，万灵佑序。 泻银河於碧汉，克注遐年； 耸臣岳於瑶空，永跻上寿。 姻亲和睦，嗣族欢娱。 稽首归依，虔诚赞咏： 武曲散祸，玄映除凶。 三光焕照，万炁流通。 七元注籍，列位斗中。 检身护命，灾难不逢。 上皇保真，命禄无终。 正道长存，与神无穷。 保命自然，上升玉宫。 臣众等志心皈命，瑶光宫大圣、破军天关真皇君，斗中神仙诸灵官。 伏闻天回地转，瑶光推空洞之轮； 斗建星躔，虚皇纪运行之度。 位尊上帝，威制群魔。 正炁所临，万物遂生成之性； 飞里所指，百邪无逃遁之形。 今某人涤垢舒坛，披诚奉教，布斗极星辰之象，备香花灯供之仪，志心皈命瑶光宫大圣、破军天关真皇君。 伏愿道契丹台，南斗注长生之字； 罪消幽府，北都诠不死之名。 四序营为，尽叶光华之庆； 全家视履，咸沾清净之风。 稽首归依，虔诚赞咏：七元覆护天尊。 破军扶衰，运致玄真。 南司保生，延寿体宁。 七元典籍，灵真荣名。 列位上仙，合庆连并。 丹灵散光，洞入玄冥。 腾霄飞翔，与神同龄。",
      "translated_text": "Three myriad myriad cycles of *jiazi*, earth enduring and heaven eternal; the twelve numinous gates, yang opening and yin closing. Serene in the white sun, savoring the harmony of the Unwrought. With bowed heads we take refuge and devoutly intone:\n\n*Luxun* preserves life, exalted perfected ones disperse the spirits.\nThe upright *qi* gathers and subdues, attending and guarding with reverent hospitality.\nThe Seven Primes are enrolled above, conveying the primordial true.\nFlowing forth in numinous clarity, they join the body with the cavernous ford.\nEver warding off inauspiciousness, inwardly guarding the form.\nErasing death to ascend life, unfolding with the spirits.\nPreserving and advancing naturally, ascending to the Jade Dawn.\n\nWe, the assembled, with devoted hearts take refuge and commit our lives to the August Sovereign of the Power Palace, the True Person of Wenchu-Xuanming, and the divine immortals and spirit officials of the Dipper.\n\nWe have heard that the Star Lord dwells in profound obscurity, his position governing swift movement. Concealed and subtly radiant, he presides over the Three Palaces of the Northern Emperor; rewarding good and punishing excess, he commands the five *qi* of the Black Spirits. At times he annihilates sudden calamities, launching fiery armor across the Six Heavens; at others he severs the disloyal, illuminating crimson troops at the four borders. All that moves or grows owes its birth and completion to him.\n\nNow, so-and-so, having purified the ritual altar and cleansed away dust and filth, arranges the stellar forms of the Dipper’s pole and prepares the ritual of incense, flowers, and lamps. With devoted hearts, we take refuge and commit our lives to the August Sovereign of the Power Palace, the True Person of Wenchu-Xuanming.\n\nWe humbly pray that sins be erased and transgressions removed, expunging names from the ghostly registers of the Nine Yin; that souls be bound and spirits restrained, obtaining the immortal formula of the Seven Returns. In action or stillness, may there be no fear of misfortune; in breath and sight, may there be the blessing of Great Harmony. Inheriting this supreme good, may wondrous fortune forever abound.\n\nWith bowed heads we take refuge and devoutly intone:\n*Wenchu* augments destiny, flowing truth disperses support.\nLight illumines the lower guard, unfolding with the form.\nThe Seven Primes cross the register, cavernously resplendent in the Mysterious Void.\nThey pacify and protect the spirit, safeguarding the body.\nAwesome in their numinous power, the true spirits ride the floating.\nClear vision within and without, they unite with the spirits.\nPreserving and refining naturally, ascending to the Jade Void.\n\nWe, the assembled, with devoted hearts take refuge and commit our lives to the August Sovereign of the Balance Palace, the True Person of Lianzhen-Danyuan, and the divine immortals and spirit officials of the Dipper.\n\nWe have heard that upon the misty heights of Kun Terrace, the seven gates intermingle their radiance; the concealed brilliance of the Golden Canopy subtly connects the Two Effulgences. The crimson tree bears fruits of white essence, while jade nectar congeals into the elixir of refinement. They review the records of the exalted perfected, governing the ledgers of ghosts and spirits; they oversee the rudiments of lesser learning, holding the key to life and death.\n\nNow, so-and-so, having cleansed the spirit and adhered to the ritual canons, arranges the stellar forms of the Dipper’s pole and prepares the ritual of incense, flowers, and lamps. With devoted hearts, we take refuge and commit our lives to the August Sovereign of the Balance Palace, the True Person of Lianzhen-Danyuan.\n\nWe humbly pray that good fortune tread the Three Primes, erasing the three disasters in fleeting shadows; that the Five Movements be harmoniously met, planting the five blessings in deep roots. Whether in office or honor, may one fully inherit the pure and lofty lineage; whether traveling as a merchant or sitting as a trader, may all become prosperous and flourishing families.\n\nWith bowed heads we take refuge and devoutly intone:\n*Lianzhen* dispels calamity, the Four Brightnesses open yang.\nThe exalted spirits disperse radiance, cavernously illuminating divine light.\nThe Seven Primes guard the register, the Controller of Destiny extends longevity.\nThe names are inscribed above, granting us enduring length.\nPreserving and fortifying life, removing misfortune and banishing ill fortune.\nThe divine perfected manifest their power, flowing forth into the cavernous realm.\nAchieving natural ascent, ascending to the Jade Hall.\n\nWe, the assembled, with devoted hearts take refuge and commit our lives to the August Sovereign of the Open Yang Palace, the True Person of Wuqu-Beiji, and the divine immortals and spirit officials of the Dipper.\n\nWe have heard that the Jade Tower gleams with splendor, concealing the flying radiance of the Celestial Pole’s star; the jade tablets shimmer with script, recording the revolving paths of the eternal Dao. They establish the steps of the Dharma Wheel, examining the diligence of supreme learning. Their flying brilliance illuminates the eight gates, leaving no darkness unlit; their cast radiance spans ten thousand miles, dissolving all barriers.\n\nNow, so-and-so, having entrusted their traces to the dusty world while dwelling in the realm of the Dao, arranges the stellar forms of the Dipper’s pole and prepares the ritual of incense, flowers, and lamps. With devoted hearts, we take refuge and commit our lives to the August Sovereign of the Open Yang Palace, the True Person of Wuqu-Beiji.\n\nWe humbly pray that a single thought may unlock ascent, with the myriad spirits in harmonious attendance. Pouring the Silver River across the azure vastness, may distant years be inscribed; towering the Ministerial Peaks in the jade heavens, may one forever ascend to long life. May kinship be harmonious, descendants joyful.\n\nWith bowed heads we take refuge and devoutly intone:\n*Wuqu* disperses misfortune, the mysterious radiance removes calamity.\nThe Three Lights shine brilliantly, the myriad *qi* flow unimpeded.\nThe Seven Primes inscribe the register, arrayed in the Dipper’s midst.\nExamining the body and protecting life, may misfortune never befall.\nThe Supreme Sovereign preserves the true, destiny and emolument without end.\nThe upright Dao endures forever, uniting with the spirits without limit.\nPreserving life naturally, ascending to the Jade Palace.\n\nWe, the assembled, with devoted hearts take refuge and commit our lives to the August Sovereign of the Jade Light Palace, the True Person of Pojun-Tianguan, and the divine immortals and spirit officials of the Dipper.\n\nWe have heard that as heaven revolves and earth turns, the Jade Light propels the cavernous wheel; as the Dipper establishes the stellar paths, the August Sovereign records the degrees of movement. His position is exalted among the Celestial Emperors, his might subdues the hordes of demons. Where the upright *qi* descends, the myriad things fulfill their nature of birth and completion; where his flying command points, the hundred evils have no form of escape.\n\nNow, so-and-so, having cleansed the altar and spread sincerity, arranges the stellar forms of the Dipper’s pole and prepares the ritual of incense, flowers, and lamps. With devoted hearts, we take refuge and commit our lives to the August Sovereign of the Jade Light Palace, the True Person of Pojun-Tianguan.\n\nWe humbly pray that the Dao accords with the Cinnabar Terrace, the Southern Dipper inscribing the characters of long life; that sins vanish from the Dark Bureau, the Northern Capital proclaiming the names of the deathless. May the four seasons be well-ordered, fully partaking in the blessings of radiant splendor; may the entire household, in their conduct, all be touched by the winds of purity.\n\nWith bowed heads we take refuge and devoutly intone:\nThe Seven Primes shelter and protect, Heavenly Worthies.\n*Pojun* aids the declining, conveying the mysterious true.\nThe Southern Controller preserves life, extending years and calming the body.\nThe Seven Primes govern the register, the numinous perfected honor names.\nArrayed among the exalted immortals, their blessings join and merge.\nThe cinnabar spirits disperse light, cavernously entering the Mysterious Obscurity.\nSoaring through the heavens, they share the same age with the spirits.",
      "overlap_context": "o their residual light.\n\nNow, so-and-so, having purified themselves in fasting and covenant, establishes the ritual altar, arranging the stellar forms of the Dipper’s pole and preparing the ritual of incense, flowers, and lamps. With devoted hearts, we take refuge and commit our lives to the Great Sage of the Jade Armillary Palace, the True Person and August Sovereign of Emolument Existence.\n\nWe humbly pray that blessings may accord with distant years and fortune be bestowed through vast kalpas.",
      "start_char": 1087,
      "end_char": 2332,
      "start_sentence": 72,
      "end_sentence": 158,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.26381850242615,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\北斗七元星灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "保命自然，上升玉庭。 北斗七元星灯仪竟",
      "translated_text": "The life-preserving power flows naturally, ascending to the Jade Court.\nThe Rite of the Seven Stars’ Lamps of the Northern Dipper is now complete.",
      "overlap_context": " intone:\nThe Seven Primes shelter and protect, Heavenly Worthies.\n*Pojun* aids the declining, conveying the mysterious true.\nThe Southern Controller preserves life, extending years and calming the body.\nThe Seven Primes govern the register, the numinous perfected honor names.\nArrayed among the exalted immortals, their blessings join and merge.\nThe cinnabar spirits disperse light, cavernously entering the Mysterious Obscurity.\nSoaring through the heavens, they share the same age with the spirits.",
      "start_char": 2332,
      "end_char": 2354,
      "start_sentence": 159,
      "end_sentence": 160,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.122270107269287,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\北斗七元星灯仪.txt",
        "category": "威仪类"
      }
    }
  ]
}