{
  "source_id": "北极真武佑圣真君礼文",
  "source_file": "chunked_daozang\\北极真武佑圣真君礼文.json",
  "total_chunks": 4,
  "total_original_chars": 4278,
  "total_translated_chars": 28139,
  "total_translation_time": 134.88346242904663,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\威仪类\\北极真武佑圣真君礼文.txt",
    "category": "威仪类"
  },
  "full_translation": "**Liturgical Text for the Northern Culmen Perfected Warrior, Protector of the Sacred, and True Lord**\n\nThe ritual proceedings commence in due form.\n\nWe humbly acknowledge that the celestial gates lie in distant obscurity, beyond the reach of mere words; yet the luminous symbol of Heaven may be approached through utmost sincerity. The divine power of the death-dealing spirit has long been renowned for its vastness, while its auspicious radiance universally bestows illumination. All who dwell beneath its shelter dare not forget their devotion.\n\nWith reverence, we invoke the Celestial Pacifier, True Warrior—Governor of the World and Fortune Spirit, Preceptor of the Jade Void, August Emperor of the Dark Heaven—whose numinous might blazes resplendent, whose majestic virtue towers sublime. As Great General of the Upper Firmament and Fortune Spirit of the Lower Realm, his sixfold penetration and fourfold opening leave no prayer unanswered. For all nations and multitudes, every supplication finds response.\n\nToday, the officiant [Name], having purified the sacred precinct and earnestly cultivated sincere devotion, gazes toward the Dark Culmen in reverent submission and lifts his gaze to the awe-inspiring countenance in worship. The incense smoke wafts ethereally, seeking silent communion through unwavering faith; the resonant chime of the qing bell soars aloft, evoking the lofty and far-reaching tones of the divine.\n\nWe humbly pray that the divine presence may manifest as if truly present, casting its gaze upon us in benevolent visitation. May it behold the depth of our devotion at this moment and erase the transgressions of many lifetimes. The ritual space stands solemn and immaculate; reverence and awe are duly observed. Facing the exalted Perfected Ones, we offer our wholehearted worship.\n\n**Invocation of the Heavenly Worthy of the Transformed Body from the Golden Portal**\n\nWith devoted heart, we prostrate and take refuge.\n\nMost Venerable and Most Sacred, without beginning or end, you govern the fifty billion Heavenly Lords and accumulate the qi of a hundred thousand myriad Brahma-realms. You establish the primordial teaching as its foundation and serve as the supreme master of the Dao’s ultimate lineage. Your dignified dharmic form radiates compassion; your resplendent aureole outshines sun and moon. In stillness, you expound the Dharma within the Palace of Five Luminaries, where the Perfected Immortals gather. In emptiness, you discourse on the sutras, wherein a single pearl contains worlds.\n\n*Response:*\nThe Heavenly Worthy of Primordial Commencement, Self-So and Spontaneous, of the Golden Portal within the Great Brahma Heaven.\n\nWith devoted heart, we prostrate and take refuge.\n\nForced to be named the Dao, you are honored as Sovereign, dwelling in the Seven Jeweled Terrace of the Upper Clarity and presiding as Lord of the Three Caverns and Nine Perfected. You broadly expound the Three Vehicles’ teachings and grandly open the gates of manifold mysteries. Your floral crown transmits myriad transformations; your cloud-like raiment glows with the hues of fivefold radiance. Ascending the Perfected and delivering the Sages, you serve as the hierarchical standard for all ranks. Protecting nations and pacifying households, you transcend the kalpas of beginning and end.\n\n*Response:*\nThe Heavenly Worthy of Numinous Treasure, the Jade Clarity Dao Lord of the Golden Portal within the Great Brahma Heaven.\n\nWith devoted heart, we prostrate and take refuge.\n\nVacuous and transformative, profoundly still and mysteriously penetrating, you serve as the Father of Teachings in the Grand Clarity and the King of Physicians in the Three Realms. You give life to the ten thousand kinds and govern the hosts of Perfected. You restore the dead to life, causing withered bones to receive grace; you dispatch talismans and fly charms, banishing demonic forces to their furthest bounds. Manifesting at Green Goat Mountain in Shu, you transmitted the Purple Qi at the Pass of Han. Restoring simplicity and returning to the uncarved block, you discoursed on the *Five Thousand Words of the Dao and Virtue*. Weighing transgressions and assessing merits, you preside over the Twelve Divisions of the Cavernous Spirit.\n\n*Response:*\nThe Heavenly Worthy of the Dao and Virtue, the Most High Lord Lao of the Golden Portal within the Great Brahma Heaven.\n\nThe Dao originates from the Mysterious Origin, its name residing before the Great Ultimate. You served the Heavenly Worthies at the dawn of the Crimson Clarity Kalpa and rectified the royal throne in the Kingdom of Serene Joy. Responding to the auspicious sign of sunlight, you revealed the source from which all existence flows. Your sacred descendants emerged, their numinous manifestations most revered and exalted.\n\n*Response:*\nThe August Heavenly Worthy of the Lofty Jade Emperor, the Sacred Father, True Lord of the Great Beginning, and the Sacred Mother, Primordial Lady of the Great Ultimate.\n\nWith devoted heart, we prostrate and take refuge.\n\nResponding to the transformations of the Mysterious Origin, the numinous brilliance of the Martial Star shines forth. You manifested eighty-one transformed bodies and traversed six million years. Auspicious signs unfolded like the bright sun; your spirit was nurtured in Serene Joy. Within that realm, you received the Threefold Qi and reposed in the Palace of Vast Cold. Your Dao matches the creative potency of Qian’s firmness; your virtue equals Kun’s nurturing capacity. The Dao and virtue originate from spontaneity; your awe-inspiring might subdues the myriad existents. You traverse the Six Directions and examine the Three Primes. Your vows are boundless; your divine works are supreme.\n\n*Response:*\nThe Celestial Pacifier, True Warrior—Governor of the World and Fortune Spirit, Preceptor of the Jade Void, August Emperor of the Dark Heaven.\n\nWithin the Palace of Vast Cold, you received the Three Qi; in the Heaven of Serene Joy, you were endowed with sunlight. Vacuous and transformative, you unite with spontaneity; your Dao and virtue are exalted beyond compare. Above, you match Qian’s firmness in generating the ten thousand things; below, you equal Kun’s nurturing capacity in sustaining the multitudes. Your majestic countenance blazes with ineffable wonder; you vow to sever demonic forces and deliver all beings.\n\nWe now recite the First Precept of Cultivating the Perfected: *\"One must not secretly scheme to harm others for personal gain.\"*\n\nReflecting upon my many lifetimes, I confess to having violated this precept. Today, I worship the exalted Perfected Ones with utmost sincerity, earnestly repenting. By the grace of the Dao, may universal pardon be bestowed.\n\n*\"Secretly scheming to harm others for personal gain—*\n*Boundless transgressions truly cannot escape.\"*\n\nNow, prostrating and taking refuge in the exalted Perfected Ones, I repent and vow to eradicate all karmic offenses.\n\nWith devoted heart, we prostrate and take refuge.\n\nIn the realm of the Great Brahma Heaven, within the Palace of Desirelessness, you assume provisional names to deliver beings and succor the world. Through six or seven cycles of spring and autumn, you perfected three thousand meritorious deeds. Your name ascended to the Jade Emperor; your rank was uniquely elevated as the Dark Warrior.\n\n*Response:*\nThe Celestial Pacifier, True Warrior—Governor of the World and Fortune Spirit, Preceptor of the Jade Void, August Emperor of the Dark Heaven.\n\nDescendant of immortals in the realm of the Great Brahma Heaven, transformed body within the Palace of Desirelessness. Delivering beings and succoring the world, you manifest divine power; dispatching talismans and flying charms, you propagate the Dao’s teachings. Even the tiniest creatures and fish receive your great creation; the humblest grasses and trees bear your vast grace. Your merits perfected and deeds fulfilled, you surpass the hosts of immortals; the Jade Emperor bestowed upon you the title of Dark Warrior.\n\nWe now recite the Second Precept of Cultivating the Perfected: *\"One must not kill living beings to satisfy the palate.\"*\n\nReflecting upon my many lifetimes, I confess to having violated this precept. Today, I worship the exalted Perfected Ones with utmost sincerity, earnestly repenting. By the grace of the Dao, may universal pardon be bestowed.\n\n*\"Killing living beings to satisfy the palate—*\n*Boundless transgressions truly cannot escape.\"*\n\nNow, prostrating and taking refuge in the exalted Perfected Ones, I repent and vow to eradicate all karmic offenses.\n\nWith utmost sincerity, I take refuge and prostrate in reverence.\n\nUpon the Five Clouds’ Throne, within the Palace of Eight Luminaries, I hearken to the resounding voice of the Golden Mouth and gaze upon the radiant countenance of the Jade Brow. Moved by the earnest supplications of sublime deeds, you perceive the unjust calamities afflicting the humble folk below. Within seven days, you sweep away demonic forces; beneath the Nine Springs, you liberate the stagnant souls.\n\n*Refrain:*\nThe True Martial of Heaven’s Pillar, Blessed Deity of the Age, Preceptor of Jade Void, August Minister of the Dark Warrior, Supreme Emperor of the Mysterious Heaven.\nYour divine might vast, your fame resounds in the Golden Towers; your talismanic commands, resplendent, descend from the Jade Firmament. Though your sacred presence briefly descends through the Three Heavens, you purge all demonic miasma in but seven days. Once more, you mount the Azure Dragon to ascend the sacred realm, bearing the imperial decree to guard the Mysterious Heaven. Exalted as the Supreme Great General, you forever extinguish evil and usher in the Dao’s qi.\n\nWe now recite the Third Precept of Cultivating the Perfected: *\"One must not indulge in licentiousness and defile the true, polluting the sacred qi.\"* Reflecting upon my many lifetimes, I confess to having violated this precept. Today, I worship the exalted Perfected Ones with utmost sincerity, earnestly repenting. By the grace of the Dao, may universal pardon be bestowed.\n\n*\"Defilement and licentiousness harm the true qi—*\n*Boundless transgressions truly cannot escape.\"*\n\nNow, prostrating and taking refuge in the exalted Perfected Ones, I repent and vow to eradicate all karmic offenses.\n\nWith utmost sincerity, I take refuge and prostrate in reverence.\n\nThe Four Saintly Marshals stand in rank, foremost among the Immortals of old. They execute the divine talismans of the Great Emperor and bear the sacred seals of the Mysterious Origin. Where evil arises, they annihilate it; no harm remains unremoved. Thunder roars, winds rush, clouds soar, and lightning sweeps.\n\n*Refrain:*\nThe True Martial of Heaven’s Pillar, Blessed Deity of the Age, Preceptor of Jade Void, August Minister of the Dark Warrior, Supreme Emperor of the Mysterious Heaven.\nThe Four Saintly Marshals, valiant and fierce, rank foremost among the Immortals, most noble and revered. Their crowns bear indigo locks, displaying majestic might; in hand, they wield divine blades to proclaim incantations. The Celestial Stem and Great Unity attend their command; the Earth Gods and City Gods heed their summons. Should demonic spirits or malevolent beings dare stand before them, lightning sweeps and thunder drives them all to annihilation.\n\nWe now recite the Fourth Precept of Cultivating the Perfected: *\"One must not undermine others’ achievements or sow discord among kin.\"* Reflecting upon my many lifetimes, I confess to having violated this precept. Today, I worship the exalted Perfected Ones with utmost sincerity, earnestly repenting. By the grace of the Dao, may universal pardon be bestowed.\n\n*\"Undermining success and scheming strife—*\n*Boundless transgressions truly cannot escape.\"*\n\nNow, prostrating and taking refuge in the exalted Perfected Ones, I repent and vow to eradicate all karmic offenses.\n\nWith utmost sincerity, I take refuge and prostrate in reverence.\n\nHis form towers a thousand *zhang*, his crown bears the Three Terraces. He responds to the constellations of Xu and Wei, embodying the qi of Water and Fire. Mounting the Azure Dragon and riding the Dark Steed, his manifestations are boundless. Ascending the Golden Towers and overshadowing Kunlun, his comings and goings defy measure.\n\n*Refrain:*\nThe True Martial of Heaven’s Pillar, Blessed Deity of the Age, Preceptor of Jade Void, August Minister of the Dark Warrior, Supreme Emperor of the Mysterious Heaven.\nThe Three Terraces shine boundlessly, his thousand-*zhang* majesty unmatched. The constellations of Xu and Wei unite their numinous essence; the qi of Water and Fire part their refined brilliance. Golden Towers and Kunlun rise and fall in his wake; the Azure Dragon and Dark Steed augment his divine might. His radiance illumines the Ten Directions; all beings in heaven and earth revere him.\n\nWe now recite the Fifth Precept of Cultivating the Perfected: *\"One must not slander the worthy or flaunt one’s own talents.\"* Reflecting upon my many lifetimes, I confess to having violated this precept. Today, I worship the exalted Perfected Ones with utmost sincerity, earnestly repenting. By the grace of the Dao, may universal pardon be bestowed.\n\n*\"Slandering the worthy to exalt oneself—*\n*Boundless transgressions truly cannot escape.\"*\n\nNow, prostrating and taking refuge in the exalted Perfected Ones, I repent and vow to eradicate all karmic offenses.\n\nWith utmost sincerity, I take refuge and prostrate in reverence.\n\nHis divine power is boundless, his transformations measureless. With unbound hair and bare feet, he displays his majestic countenance; he arrays the Dipper and aligns the Qian trigram, proclaiming incantations. His fingers direct the Celestial Stem, guarding all beings from the kalpa’s beginning to its end. Roaming between Heaven and Earth, he perfects the Dao above and below.\n\n*Refrain:*\nThe True Martial of Heaven’s Pillar, Blessed Deity of the Age, Preceptor of Jade Void, August Minister of the Dark Warrior, Supreme Emperor of the Mysterious Heaven.\nHis divine freedom is vast, his myriad transformations beyond naming. Robed in armor, he displays his majestic might; barefoot, he treads the Celestial Stem, his jade steps soaring. Above and below, he perfects the Dao’s qi; from kalpa’s end to its beginning, he severs demonic forces. Aligning Qian and arraying the Dipper, he proclaims his incantations; all ferocious demons bow their heads.\n\nWe now recite the Sixth Precept of Cultivating the Perfected: *\"One must not indulge in excessive drink or consume forbidden meats.\"* Reflecting upon my many lifetimes, I confess to having violated this precept. Today, I worship the exalted Perfected Ones with utmost sincerity, earnestly repenting. By the grace of the Dao, may universal pardon be bestowed.\n\n*\"Unrestrained drink and forbidden meat—*\n*Boundless transgressions truly cannot escape.\"*\n\nNow, prostrating and taking refuge in the exalted Perfected Ones, I repent and vow to eradicate all karmic offenses.\n\nWith utmost sincerity, I take refuge and prostrate in reverence.\n\nHe presides over the *ren* and *gui* directions, commands the *jia* and *geng* generals. Thunder Lords and Lightning Mothers lead the vanguard; Wind Masters and Rain Lords attend as his escort. The Eight Slayers guard before and behind; the Six Dings follow left and right. Where his divine blade points, snow and frost turn cold; when his black banner unfurls, clouds and mist coil.\n\n*Refrain:*\nThe True Martial of Heaven’s Pillar, Blessed Deity of the Age, Preceptor of Jade Void, August Minister of the Dark Warrior, Supreme Emperor of the Mysterious Heaven.\nIn the *ren* and *gui* quadrant lies his sacred abode; the *jia* and *geng* generals aid his divine might. Thunder Lords and Lightning Mothers shake mountains and rivers; Wind Masters and Rain Lords clear the paths. When his black banner unfurls, clouds and mist coil; where his divine blade points, snow and frost turn cold. His rainbow banners and sacred regalia descend from the distant skies; all spirits of the Three Realms bow in reverence.\n\nWe now recite the Seventh Precept of Cultivating the Perfected: *\"One must not covet without restraint or hoard wealth without distribution.\"* Reflecting upon my many lifetimes, I confess to having violated this precept. Today, I worship the exalted Perfected Ones with utmost sincerity, earnestly repenting. By the grace of the Dao, may universal pardon be bestowed.\n\n*\"Greedily hoarding wealth without release—*\n*Boundless transgressions truly cannot escape.\"*\n\nNow, prostrating and taking refuge in the exalted Perfected Ones, I repent and vow to eradicate all karmic offenses.\n\nWith utmost sincerity, I take refuge and prostrate in reverence.\n\nHis forms disperse and bodies scatter, pacifying nations and securing households. In an instant, he drives away pestilence; in a moment, he captures demons. All lingering illnesses find peace; all sunken souls in the netherworld are delivered.\n\n*Refrain:*\nThe True Martial of Heaven’s Pillar, Blessed Deity of the Age, Preceptor of Jade Void, August Minister of the Dark Warrior, Supreme Emperor of the Mysterious Heaven.\n\nPestilence is driven away, leaving no trace; demons are captured and chased, vanishing without a shadow. The afflictions of all beings find peace; the sunken souls of hell are delivered and uplifted. No merit surpasses the tranquility of households and nations; the living and the dead alike depend on boundless blessings. Descending to the mortal realm in response to offerings, you universally ferry sentient beings to the shore of the Dao.\n\nAccording to the Eighth Precept of Cultivating the True:\n*\"Thou shalt not befriend the unworthy nor dwell in filth and disorder.\"*\nI reflect that through many lives, I have violated this precept. Now, prostrating before the exalted Perfected Ones, I earnestly repent. By the grace of the Dao, may universal pardon be bestowed.\n\n*\"Befriending the unworthy, dwelling in filth—*\n*Boundless transgressions truly cannot escape.\"*\n\nNow, prostrating and taking refuge in the exalted Perfected Ones, I repent and vow to eradicate all karmic offenses.\n\nWith utmost sincerity, I take refuge and prostrate in reverence.\nPatrolling the Ten Caves, scrutinizing the myriad heavens, you punish the rebellious and dispel demonic miasma, bestow blessings upon the virtuous and chastise evil deeds. Expelling the perverse and aiding the upright, you assist the Celestial Thearch in refining the cosmos. Dispelling calamities and prolonging life, you plant the seeds of fortune and longevity for the people.\n\n*Refrain:*\nThe True Martial of Heaven’s Pillar, Blessed Deity of the Age, Preceptor of Jade Void, August Minister of the Dark Warrior, Supreme Emperor of the Mysterious Heaven.\n\nScrutinizing the heavens to punish the rebellious, patrolling the Ten Caves to assess the immortals. Punishing licentiousness and rewarding virtue with awe-inspiring authority, absolving sins and recording merits with boundless grace. Enacting the mandate to expel evil, your benevolence knows no limit; bestowing blessings upon the people, your beneficence is infinite. Having accomplished your tasks and fulfilled your duties, you return in auspicious radiance, lauded by all true immortals.\n\nAccording to the Ninth Precept of Cultivating the True:\n*\"Thou shalt not be disloyal or unfilial, faithless or unkind.\"*\nI reflect that through many lives, I have violated this precept. Now, prostrating before the exalted Perfected Ones, I earnestly repent. By the grace of the Dao, may universal pardon be bestowed.\n\n*\"Disloyal, unfilial, faithless, unkind—*\n*Boundless transgressions truly cannot escape.\"*\n\nNow, prostrating and taking refuge in the exalted Perfected Ones, I repent and vow to eradicate all karmic offenses.\n\nWith utmost sincerity, I take refuge and prostrate in reverence.\nSweet springs well forth as auspicious omens; divine dreams reveal your numinous presence. Your retinue boasts the might of dragons and beasts; your manifestations bear the forms of tortoise and serpent. Throughout the realm, from the Central Plains to the barbarian lands, prayers and offerings abound. From ancient times to the present, your miraculous responses are recounted by the multitudes.\n\n*Refrain:*\nThe True Martial of Heaven’s Pillar, Blessed Deity of the Age, Preceptor of Jade Void, August Minister of the Dark Warrior, Supreme Emperor of the Mysterious Heaven.\n\nSweet springs gush forth as treasured omens, dispelling the people’s afflictions with boundless celestial grace. Magnificent temples are erected in gratitude for your vast blessings; illustrious titles are repeatedly bestowed, illuminating your sagely virtue. Secretly aiding the highest to propagate the true teaching, your wondrous efficacy directly manifests to succor all beings. Your majestic presence, enshrined in images, pervades the Central Plains and barbarian lands alike; from ancient times to the present, reverent worship endures.\n\nAccording to the Tenth Precept of Cultivating the True:\n*\"Thou shalt not treat speech and laughter lightly nor act contrary to truth.\"*\nI reflect that through many lives, I have violated this precept. Now, prostrating before the exalted Perfected Ones, I earnestly repent. By the grace of the Dao, may universal pardon be bestowed.\n\n*\"Light laughter, reckless speech, untrue conduct—*\n*Boundless transgressions truly cannot escape.\"*\n\nNow, prostrating and taking refuge in the exalted Perfected Ones, I repent and vow to eradicate all karmic offenses.\n\nWith utmost sincerity, I take refuge and prostrate in reverence.\nThe Eastern Flower, Southern Dipper, Northern Culmen, Western Numinous, the Six Luminaries, Five Stars, and the thousand Perfected, myriad Sages. Their radiance illuminates the realm; their majestic power blazes across the high heavens. Some wield the authority over good and evil; others hold the reins of life and death. The true lords of the myriad heavens, the dragon palaces of the netherworld, blessed lands and famed mountains—innumerable hosts of sages.\n\nInvoking the Ten Directions’ Numinous Treasure Heavenly Worthy,\nWith utmost sincerity, I take refuge and prostrate in reverence.\nThe constellations of Xu and Wei, the essences of Water and Fire, the Divine Lords of the Celestial Gate and Earthly Axis, the immortals of Jade Maidens and Golden Lads. Wielding the black banners of authority, the stars of Kui and Gang mark the paths of retribution. The Six Ding and Six Jia, the hosts of Perfected and Eight Fiends, the ranked sages of the Five Thunders, the immortal officials and divine warriors, the valiant generals and spirit soldiers—all the majestic and numinous, the boundless hosts of sages. At a single chant, they follow the exalted sages, all guarding and aiding the divine work. Each awakens a heart of joy, bestowing the power of protection. Universally enhancing virtue and power, all attain the mystery of the formless. Ferrying sentient beings, they accomplish the supreme Dao.\n\nInvoking the Heavenly Worthy of Universal Transformation through Thunder,\nThe rites completed, to the Three Pure Ones and the Northern Culmen’s Protector, the Sage Lord, we earnestly repent:\nWe reverently invoke the Primordial Heaven’s Great Sage, the Most Numinous Lord of the Northern Wall’s Ren and Gui. May your boundless compassion unfold, sheltering all beings in the dharma realm. May your majestic power descend without limit, vanquishing all demons below. May your benevolent grace flow endlessly, liberating the sunken souls of evil destinies.\n\nSince time immemorial, we have transmigrated through birth and death until now. Lost in sound and form, sometimes existing, sometimes not, we have feigned truth and abandoned authenticity through cunning deceit. The seven emotions surge unceasingly; the ten karmic deeds deepen endlessly. Our faith falters, yielding to foolishness; our sincerity wavers, fostering laziness and neglect. We consume meat and wine, forgetting the precepts; we indulge in fame and profit, accumulating transgressions. Concealing schemes and manipulating numbers, we parade our abilities; covering faults and embellishing wrongs, we betray trust and conduct. Cursing wind and rain, we harbor resentment; slandering scriptures and defaming the Dao, we prolong ignorance. Cheating with scales and measures, we deceive; exposing ourselves to sun and stars, we forget defilement. The sea of desire and river of love are hard to escape; the bridge of the Dao and shore of the Way remain unattained. Having strayed into heterodox sects in this life, we fear sinking into bitter destinies in the next. Some are bound by celestial officials, stripped of lifespan and fortune; others are burdened by hell’s grudges. Our lives are as fleeting as morning dew, cause for alarm; our sins are as countless as the sands of a river, impossible to redeem.\n\nRelying on the exalted Perfected Ones’ compassion, we pray for mercy upon this deluded mortal world. Open wide the gate of great compassion, look down upon our repentant prostrations. May the power of the One Vehicle dissolve the obstacles of the six senses and ten evils. May the enmities of a hundred lives and three existences, the hatreds of both parties, be entirely repented.\n\nHaving repented, we take refuge in the supreme, true, and correct Three Treasures.\n\nWith utmost sincerity, we make our vows:\nFirst, may heaven and earth remain ever pure;\nSecond, may the sovereign’s reign endure ten thousand years;\nThird, may the nine generations of ancestors ascend to heaven;\nFourth, may the trials of Fengdu be forever concluded.\n\nFifth, may the two qi remain without flaw or rebellion;\nSixth, may the five grains all ripen in abundance.\nSeventh, may warfare cease for eternal kalpas;\nEighth, may the four seasons be free of plague and pestilence.\nNinth, may all beings escape the net of karma;\nTenth, may all who study the Dao attain immortality.\n\nHolding fast to these ten vows, we weave good affinity,\nrepenting all karmic obstacles for sentient beings.\nAspiring to accomplish the supreme Dao,\nwe pray the celestial mirror reflect mortal sentiments.\nWith boundless compassion as our boat and oar,\nmay all beings universally cross to the Dao’s shore.\n\nWe now come to praise all meritorious virtues,\nrepenting measureless transgressions and faults.\nWithin the celestial heart, beyond the heavens, and throughout the four directions,\nmay all universally attain the wondrous Dao.\n\nHaving made these vows, we take refuge and prostrate to the supreme, most true Three Treasures.\n\n**Chanting the Sutra – Dedication of Merit**\n\nWe humbly submit: a single sacred name\ncan dissolve kalpas of calamity.\nThe chanting of true names by the multitude\ncan prolong life after life of blessings.\nWords cannot exhaust their profundity,\nnor praise encompass their virtue.\nReverently following the subtle teachings,\nwe gaze upon the wondrous form.\nWith solemnity, we set forth the principle of praise and chant,\nfully expressing the sincerity of repentance.\nThough heaven’s hearing is not distant,\nwe hope human hearts may be moved.\nWe humbly pray: may your vast compassion be boundless,\nmindful of the pitiable condition of all beings.\nMay past wrongs be thoroughly cleansed,\nand all karmic debts from former lives be absolved.\nLet deeds of goodness be inscribed in cinnabar,\nand longevity extended upon jade tablets.\nMay kinfolk dwell in peace,\nforever abiding in the land of blessed years.\nMay the nine lineages be delivered,\nutterly departing the realm of darkness.\nIn attaining all blessings, what blessing would not be attained?\nIn extinguishing all disasters, what disaster would not be extinguished?\nMay a thousand spirits guard and protect,\nand ten thousand affairs proceed smoothly.\nShould these prayers accord with our foolish sincerity,\nhow dare we forget to offer gratitude?\nWe bow our heads in reverence, taking refuge,\nand with wholehearted devotion recite:\n*\"Boundless Blessings, Heavenly Worthy,\nInconceivable Meritorious Virtues!\"*\n\n**The Rite of Veneration for the Northern Culmen’s True Martial, Protector Sage Perfected Lord concludes.**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "北极真武佑圣真君礼文 书名：北极真武佑圣真君礼文。 撰人不祥。 一卷。 底本出处：《正统道藏》洞神部威仪类。 北极真武佑圣真君礼文 举法事如式 伏闻天关渺漠，非言语之能交。 乾象昭明，惟精诚之可格。 死神力夙称於广大，而祥光普赐於照临。 凡在庇麻，敢忘信奉。 恭惟镇天真武，治世福神，玉虚师相，玄天上帝，至灵赫赫，盛德巍巍。 称大将於上穹，为福神於下土。 六通四辟，无愿不从。 万国群生，有求皆应。 今斋官某，肃严蓬宇，敬运葵诚。 望玄极以皈依，仰威容而赞礼。 炉姻缥缈，期至信以潜通。 磬韵激扬，想洪音之高彻。 伏愿神明如在，盻蛮来临。 鉴此际之精虔，削多生之罪对。 道场严洁，诚敬肃将。 恭对高真，一心赞礼。 举金阙化身天尊 志心皈命礼。 至尊至圣，无古无今，统五十亿之天君，积百千万之梵炁。 立混成教本，作极道宗师。 端严法相现慈悲，璨烂圆光昭日月。 静中说法，五明宫内列真仙。 空裹谈经，一颗珠中藏世界。 和： 大罗天上金阙官中虚无自然元始天尊。 志心皈命礼。 强名日道，尊以为君，居上清七宝台，为三洞九真主。 广说三乘教，宏开众妙门。 花冠传万变之名，霞被焕五云之彩。 升真度圣，为上下之品阶。 保国宁家，超始终之劫运。 和： 大罗天上金阙官中玉宸道君灵宝天尊。 志心皈命礼。 虚无变化，冥寂玄通，为教父於泰清，作医王於三界， 生成万类，总领群真。 回骸起死而枯骨沾恩，走篆飞符而邪魔灭边。 显青羊，准於蜀国，度紫炁於函关。 还淳返朴，谈道德五千言。 校罪论功，为洞神十二部。 和： 大罗天．上金阙宫中太上老君，道德天尊。 志心皈命礼。 道本玄元始，名居太极先，事天尊於赤明劫初，正王位於静乐国内。 感日光之瑞应，示有本而有源。 生圣嗣之，神灵现至，尊而至重。 和： 圣父太初真君圣母太极元君高上玉皇天尊。 志心皈命礼。 玄元应化，武曲昭灵，变现八十一身，经历六百万岁。 祥开皎日，储神静乐。 国中炁受三无，托质广寒宫内。 道配乾刚之生育，德同坤厚之载持。 道德本於自然，威灵慑於万有。 周行六合，考校三元。 愿力无边，神功第一。 和： 镇天真武治世福神玉虚师相玄天上帝。 广寒宫裹锺三炁，静乐天中禀曰光。 虚无变化合自然，道德尊崇无与等。 上配乾刚生庶物，下同坤厚载黎元。 威容赫奕妙难思，誓断妖魔济群品。 谨按修真第一戒云：不得阴盗潜谋，害物利己。 伏念某多生以来，曾犯此戒。 今礼高真，虔诚忏悔。 仗此道恩，普垂赦宥。 暗计潜谋阴害物，无边罪业实难逃。 臣今皈命礼高真，忏悔愿除诸罪业。 志心皈命礼。 大罗境上，无欲宫中，易号假名，度人济物。 历春秋之六七，成功行於三千。 名上彻於玉皇，位特加於玄武。 和： 镇天真武治世福神玉虚师、相玄天上帝。 大罗境上神仙裔，无欲宫中变化身。 度人济物显神灵，走篆飞符兴道法。 细若虫鱼蒙大造，微虽草木荷洪恩。 功成行满冠群仙，玉帝加封玄武号。 谨按修真第二戒云：不得杀害含生，以充滋味。 伏念某多生以来，曾犯此戒。 今礼高真，虔诚忏悔。 仰仗道恩，普垂赦宥。 杀害含生充口腹，无边罪业实难逃。 臣今皈命礼高真，忏悔愿除诸罪业。",
      "translated_text": "**Liturgical Text for the Northern Culmen Perfected Warrior, Protector of the Sacred, and True Lord**\n\nThe ritual proceedings commence in due form.\n\nWe humbly acknowledge that the celestial gates lie in distant obscurity, beyond the reach of mere words; yet the luminous symbol of Heaven may be approached through utmost sincerity. The divine power of the death-dealing spirit has long been renowned for its vastness, while its auspicious radiance universally bestows illumination. All who dwell beneath its shelter dare not forget their devotion.\n\nWith reverence, we invoke the Celestial Pacifier, True Warrior—Governor of the World and Fortune Spirit, Preceptor of the Jade Void, August Emperor of the Dark Heaven—whose numinous might blazes resplendent, whose majestic virtue towers sublime. As Great General of the Upper Firmament and Fortune Spirit of the Lower Realm, his sixfold penetration and fourfold opening leave no prayer unanswered. For all nations and multitudes, every supplication finds response.\n\nToday, the officiant [Name], having purified the sacred precinct and earnestly cultivated sincere devotion, gazes toward the Dark Culmen in reverent submission and lifts his gaze to the awe-inspiring countenance in worship. The incense smoke wafts ethereally, seeking silent communion through unwavering faith; the resonant chime of the qing bell soars aloft, evoking the lofty and far-reaching tones of the divine.\n\nWe humbly pray that the divine presence may manifest as if truly present, casting its gaze upon us in benevolent visitation. May it behold the depth of our devotion at this moment and erase the transgressions of many lifetimes. The ritual space stands solemn and immaculate; reverence and awe are duly observed. Facing the exalted Perfected Ones, we offer our wholehearted worship.\n\n**Invocation of the Heavenly Worthy of the Transformed Body from the Golden Portal**\n\nWith devoted heart, we prostrate and take refuge.\n\nMost Venerable and Most Sacred, without beginning or end, you govern the fifty billion Heavenly Lords and accumulate the qi of a hundred thousand myriad Brahma-realms. You establish the primordial teaching as its foundation and serve as the supreme master of the Dao’s ultimate lineage. Your dignified dharmic form radiates compassion; your resplendent aureole outshines sun and moon. In stillness, you expound the Dharma within the Palace of Five Luminaries, where the Perfected Immortals gather. In emptiness, you discourse on the sutras, wherein a single pearl contains worlds.\n\n*Response:*\nThe Heavenly Worthy of Primordial Commencement, Self-So and Spontaneous, of the Golden Portal within the Great Brahma Heaven.\n\nWith devoted heart, we prostrate and take refuge.\n\nForced to be named the Dao, you are honored as Sovereign, dwelling in the Seven Jeweled Terrace of the Upper Clarity and presiding as Lord of the Three Caverns and Nine Perfected. You broadly expound the Three Vehicles’ teachings and grandly open the gates of manifold mysteries. Your floral crown transmits myriad transformations; your cloud-like raiment glows with the hues of fivefold radiance. Ascending the Perfected and delivering the Sages, you serve as the hierarchical standard for all ranks. Protecting nations and pacifying households, you transcend the kalpas of beginning and end.\n\n*Response:*\nThe Heavenly Worthy of Numinous Treasure, the Jade Clarity Dao Lord of the Golden Portal within the Great Brahma Heaven.\n\nWith devoted heart, we prostrate and take refuge.\n\nVacuous and transformative, profoundly still and mysteriously penetrating, you serve as the Father of Teachings in the Grand Clarity and the King of Physicians in the Three Realms. You give life to the ten thousand kinds and govern the hosts of Perfected. You restore the dead to life, causing withered bones to receive grace; you dispatch talismans and fly charms, banishing demonic forces to their furthest bounds. Manifesting at Green Goat Mountain in Shu, you transmitted the Purple Qi at the Pass of Han. Restoring simplicity and returning to the uncarved block, you discoursed on the *Five Thousand Words of the Dao and Virtue*. Weighing transgressions and assessing merits, you preside over the Twelve Divisions of the Cavernous Spirit.\n\n*Response:*\nThe Heavenly Worthy of the Dao and Virtue, the Most High Lord Lao of the Golden Portal within the Great Brahma Heaven.\n\nThe Dao originates from the Mysterious Origin, its name residing before the Great Ultimate. You served the Heavenly Worthies at the dawn of the Crimson Clarity Kalpa and rectified the royal throne in the Kingdom of Serene Joy. Responding to the auspicious sign of sunlight, you revealed the source from which all existence flows. Your sacred descendants emerged, their numinous manifestations most revered and exalted.\n\n*Response:*\nThe August Heavenly Worthy of the Lofty Jade Emperor, the Sacred Father, True Lord of the Great Beginning, and the Sacred Mother, Primordial Lady of the Great Ultimate.\n\nWith devoted heart, we prostrate and take refuge.\n\nResponding to the transformations of the Mysterious Origin, the numinous brilliance of the Martial Star shines forth. You manifested eighty-one transformed bodies and traversed six million years. Auspicious signs unfolded like the bright sun; your spirit was nurtured in Serene Joy. Within that realm, you received the Threefold Qi and reposed in the Palace of Vast Cold. Your Dao matches the creative potency of Qian’s firmness; your virtue equals Kun’s nurturing capacity. The Dao and virtue originate from spontaneity; your awe-inspiring might subdues the myriad existents. You traverse the Six Directions and examine the Three Primes. Your vows are boundless; your divine works are supreme.\n\n*Response:*\nThe Celestial Pacifier, True Warrior—Governor of the World and Fortune Spirit, Preceptor of the Jade Void, August Emperor of the Dark Heaven.\n\nWithin the Palace of Vast Cold, you received the Three Qi; in the Heaven of Serene Joy, you were endowed with sunlight. Vacuous and transformative, you unite with spontaneity; your Dao and virtue are exalted beyond compare. Above, you match Qian’s firmness in generating the ten thousand things; below, you equal Kun’s nurturing capacity in sustaining the multitudes. Your majestic countenance blazes with ineffable wonder; you vow to sever demonic forces and deliver all beings.\n\nWe now recite the First Precept of Cultivating the Perfected: *\"One must not secretly scheme to harm others for personal gain.\"*\n\nReflecting upon my many lifetimes, I confess to having violated this precept. Today, I worship the exalted Perfected Ones with utmost sincerity, earnestly repenting. By the grace of the Dao, may universal pardon be bestowed.\n\n*\"Secretly scheming to harm others for personal gain—*\n*Boundless transgressions truly cannot escape.\"*\n\nNow, prostrating and taking refuge in the exalted Perfected Ones, I repent and vow to eradicate all karmic offenses.\n\nWith devoted heart, we prostrate and take refuge.\n\nIn the realm of the Great Brahma Heaven, within the Palace of Desirelessness, you assume provisional names to deliver beings and succor the world. Through six or seven cycles of spring and autumn, you perfected three thousand meritorious deeds. Your name ascended to the Jade Emperor; your rank was uniquely elevated as the Dark Warrior.\n\n*Response:*\nThe Celestial Pacifier, True Warrior—Governor of the World and Fortune Spirit, Preceptor of the Jade Void, August Emperor of the Dark Heaven.\n\nDescendant of immortals in the realm of the Great Brahma Heaven, transformed body within the Palace of Desirelessness. Delivering beings and succoring the world, you manifest divine power; dispatching talismans and flying charms, you propagate the Dao’s teachings. Even the tiniest creatures and fish receive your great creation; the humblest grasses and trees bear your vast grace. Your merits perfected and deeds fulfilled, you surpass the hosts of immortals; the Jade Emperor bestowed upon you the title of Dark Warrior.\n\nWe now recite the Second Precept of Cultivating the Perfected: *\"One must not kill living beings to satisfy the palate.\"*\n\nReflecting upon my many lifetimes, I confess to having violated this precept. Today, I worship the exalted Perfected Ones with utmost sincerity, earnestly repenting. By the grace of the Dao, may universal pardon be bestowed.\n\n*\"Killing living beings to satisfy the palate—*\n*Boundless transgressions truly cannot escape.\"*\n\nNow, prostrating and taking refuge in the exalted Perfected Ones, I repent and vow to eradicate all karmic offenses.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1295,
      "start_sentence": 0,
      "end_sentence": 89,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.004467725753784,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\北极真武佑圣真君礼文.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "志心皈命礼。 五云座上，八景宫中，听金口之洪音，瞻玉毫之宝相。 因妙行殷勤之请，知下民枉横之灾。 扫邪魔於七日之中，释滞魄於九泉之下。 和： 镇天真武治世福神玉虚师相玄天上帝。 神通广大闻金阙，符命辉华降玉霄。 暂劳宝驾下三天，尽扫妖氛才七日。 复御苍龙朝圣境，载承教勑镇玄天。 尊为无上大将军，永灭邪魔臻道炁。 谨按修真第三戒云：不得淫邪败真，秽慢灵炁。 伏念某多生以来，曾犯此戒。 今礼高真，虔诚忏悔。 仰仗道恩，普垂赦宥。 秽浊淫邪伤正炁，无边罪业实难逃。 臣今皈命礼高真，忏悔愿除诸罪业。 志心皈命礼。 班联四圣，位冠旱仙，行大帝之灵符，佩玄元之宝印。 有妖必灭，无害不除。 雷动风行，云飞电扫。 和： 镇天真武治世福神玉虚师相玄天上帝。 班联四圣真勇猛，位冠群仙至贵尊。 顶披绀发示威容，手仗神锋宣咒法。 天罡太乙从驱役，社令城隍听指呼。 魔精妖怪敢当前，电扫雷驱皆灭迹。 谨按修真第四戒云：不得败人成功，析交离亲。 伏念某多生以来，曾犯此戒。 今礼高真，虔诚忏悔。 仰仗道恩，普垂赦宥。 败坏成功并斗谋，无边罪业实难逃。 臣今皈命礼高真，忏悔愿除诸罪业。 志心皈命礼。 身长千丈，顶戴三台，应虚危二宿之缠，禀水火两精之炁。 跨青虬而乘玄骏，显化无方。 朝金阙而覆昆仑，去来莫测。 和： 镇天真武治世福神玉虚师相玄天上帝。 三台辉映无边际，千丈容仪绝等伦。 虚危二宿合英灵，水火两精分秀气。 金阙昆仑随上下，青虬玄骏助威神。 光明遍照於十方，一切人天皆敬仰。 谨按修真第五戒云：不得谗毁贤良，露才扬己。 伏念某多生以来，曾犯此戒。 今礼高真，虔诚忏悔。 仰仗道恩，普垂赦宥。 谗毁贤良扬己德，无边罪业实难逃。 臣今皈命礼高真，忏悔愿除诸罪业。 志心皈命礼。 神通至大，变化无方，披发跣足俨威容，布斗交乾宣咒语。 魁罡激指，护群品於劫始劫终。 乾坤游行，臻道无於天上天下。 和： 镇天真武治世福神玉虚师相玄天上帝。 自在神通宜广大，亿千变化固难名。 衣袍披甲俨威容，跣足蹑罡腾玉步。 天上天下臻道炁，劫终劫始剪魔精。 交乾布斗咒言宣，一切狞妖皆缩首。 谨按修真第六戒云：不得饮酒过差，食肉违禁。 伏念某多生以来，曾犯此戒。 今礼高真，虔诚忏悔。 仰仗道恩，普垂赦宥。 乐酒无并食肉，无边罪业实难逃。 臣今皈命礼高真，忏悔愿除诸罪业。 志心皈命礼。 位居壬癸，将任甲庚，有雷公电母以先驱，有风伯雨师而为御。 八煞前遮而后拥，六丁左从而右随。 神锋指处雪霜寒，皂纛开时云雾卷。 和： 镇天真武治世福神玉虚师相玄天上帝。 壬癸一方居圣宅，甲庚二将助威神。 雷公电母震山川，风伯雨师清道路。 皂纛开时云雾卷，神锋指处雪霜寒。 霓旌宝节下遥空，三界万灵咸稽首。 谨按修真第七戒云：不得贪求无，积财不散。 伏念某多生以来，曾犯此戒。 今礼高真，虔诚忏悔。 仰仗道恩，普垂赦宥。 贪积货财怪不散，无边罪业实难逃。 臣今皈命礼高真，忏悔愿除诸罪业。 志心皈命礼。 分形散体，宁国安家，驱疫疠於须臾，捕妖魔於顷刻。 凡缠绵之疾苦，尽获安康。 应沉滞之冥魂，俱蒙超度。 和： 镇天真武治世福神玉虚师相玄天上帝。",
      "translated_text": "With utmost sincerity, I take refuge and prostrate in reverence.\n\nUpon the Five Clouds’ Throne, within the Palace of Eight Luminaries, I hearken to the resounding voice of the Golden Mouth and gaze upon the radiant countenance of the Jade Brow. Moved by the earnest supplications of sublime deeds, you perceive the unjust calamities afflicting the humble folk below. Within seven days, you sweep away demonic forces; beneath the Nine Springs, you liberate the stagnant souls.\n\n*Refrain:*\nThe True Martial of Heaven’s Pillar, Blessed Deity of the Age, Preceptor of Jade Void, August Minister of the Dark Warrior, Supreme Emperor of the Mysterious Heaven.\nYour divine might vast, your fame resounds in the Golden Towers; your talismanic commands, resplendent, descend from the Jade Firmament. Though your sacred presence briefly descends through the Three Heavens, you purge all demonic miasma in but seven days. Once more, you mount the Azure Dragon to ascend the sacred realm, bearing the imperial decree to guard the Mysterious Heaven. Exalted as the Supreme Great General, you forever extinguish evil and usher in the Dao’s qi.\n\nWe now recite the Third Precept of Cultivating the Perfected: *\"One must not indulge in licentiousness and defile the true, polluting the sacred qi.\"* Reflecting upon my many lifetimes, I confess to having violated this precept. Today, I worship the exalted Perfected Ones with utmost sincerity, earnestly repenting. By the grace of the Dao, may universal pardon be bestowed.\n\n*\"Defilement and licentiousness harm the true qi—*\n*Boundless transgressions truly cannot escape.\"*\n\nNow, prostrating and taking refuge in the exalted Perfected Ones, I repent and vow to eradicate all karmic offenses.\n\nWith utmost sincerity, I take refuge and prostrate in reverence.\n\nThe Four Saintly Marshals stand in rank, foremost among the Immortals of old. They execute the divine talismans of the Great Emperor and bear the sacred seals of the Mysterious Origin. Where evil arises, they annihilate it; no harm remains unremoved. Thunder roars, winds rush, clouds soar, and lightning sweeps.\n\n*Refrain:*\nThe True Martial of Heaven’s Pillar, Blessed Deity of the Age, Preceptor of Jade Void, August Minister of the Dark Warrior, Supreme Emperor of the Mysterious Heaven.\nThe Four Saintly Marshals, valiant and fierce, rank foremost among the Immortals, most noble and revered. Their crowns bear indigo locks, displaying majestic might; in hand, they wield divine blades to proclaim incantations. The Celestial Stem and Great Unity attend their command; the Earth Gods and City Gods heed their summons. Should demonic spirits or malevolent beings dare stand before them, lightning sweeps and thunder drives them all to annihilation.\n\nWe now recite the Fourth Precept of Cultivating the Perfected: *\"One must not undermine others’ achievements or sow discord among kin.\"* Reflecting upon my many lifetimes, I confess to having violated this precept. Today, I worship the exalted Perfected Ones with utmost sincerity, earnestly repenting. By the grace of the Dao, may universal pardon be bestowed.\n\n*\"Undermining success and scheming strife—*\n*Boundless transgressions truly cannot escape.\"*\n\nNow, prostrating and taking refuge in the exalted Perfected Ones, I repent and vow to eradicate all karmic offenses.\n\nWith utmost sincerity, I take refuge and prostrate in reverence.\n\nHis form towers a thousand *zhang*, his crown bears the Three Terraces. He responds to the constellations of Xu and Wei, embodying the qi of Water and Fire. Mounting the Azure Dragon and riding the Dark Steed, his manifestations are boundless. Ascending the Golden Towers and overshadowing Kunlun, his comings and goings defy measure.\n\n*Refrain:*\nThe True Martial of Heaven’s Pillar, Blessed Deity of the Age, Preceptor of Jade Void, August Minister of the Dark Warrior, Supreme Emperor of the Mysterious Heaven.\nThe Three Terraces shine boundlessly, his thousand-*zhang* majesty unmatched. The constellations of Xu and Wei unite their numinous essence; the qi of Water and Fire part their refined brilliance. Golden Towers and Kunlun rise and fall in his wake; the Azure Dragon and Dark Steed augment his divine might. His radiance illumines the Ten Directions; all beings in heaven and earth revere him.\n\nWe now recite the Fifth Precept of Cultivating the Perfected: *\"One must not slander the worthy or flaunt one’s own talents.\"* Reflecting upon my many lifetimes, I confess to having violated this precept. Today, I worship the exalted Perfected Ones with utmost sincerity, earnestly repenting. By the grace of the Dao, may universal pardon be bestowed.\n\n*\"Slandering the worthy to exalt oneself—*\n*Boundless transgressions truly cannot escape.\"*\n\nNow, prostrating and taking refuge in the exalted Perfected Ones, I repent and vow to eradicate all karmic offenses.\n\nWith utmost sincerity, I take refuge and prostrate in reverence.\n\nHis divine power is boundless, his transformations measureless. With unbound hair and bare feet, he displays his majestic countenance; he arrays the Dipper and aligns the Qian trigram, proclaiming incantations. His fingers direct the Celestial Stem, guarding all beings from the kalpa’s beginning to its end. Roaming between Heaven and Earth, he perfects the Dao above and below.\n\n*Refrain:*\nThe True Martial of Heaven’s Pillar, Blessed Deity of the Age, Preceptor of Jade Void, August Minister of the Dark Warrior, Supreme Emperor of the Mysterious Heaven.\nHis divine freedom is vast, his myriad transformations beyond naming. Robed in armor, he displays his majestic might; barefoot, he treads the Celestial Stem, his jade steps soaring. Above and below, he perfects the Dao’s qi; from kalpa’s end to its beginning, he severs demonic forces. Aligning Qian and arraying the Dipper, he proclaims his incantations; all ferocious demons bow their heads.\n\nWe now recite the Sixth Precept of Cultivating the Perfected: *\"One must not indulge in excessive drink or consume forbidden meats.\"* Reflecting upon my many lifetimes, I confess to having violated this precept. Today, I worship the exalted Perfected Ones with utmost sincerity, earnestly repenting. By the grace of the Dao, may universal pardon be bestowed.\n\n*\"Unrestrained drink and forbidden meat—*\n*Boundless transgressions truly cannot escape.\"*\n\nNow, prostrating and taking refuge in the exalted Perfected Ones, I repent and vow to eradicate all karmic offenses.\n\nWith utmost sincerity, I take refuge and prostrate in reverence.\n\nHe presides over the *ren* and *gui* directions, commands the *jia* and *geng* generals. Thunder Lords and Lightning Mothers lead the vanguard; Wind Masters and Rain Lords attend as his escort. The Eight Slayers guard before and behind; the Six Dings follow left and right. Where his divine blade points, snow and frost turn cold; when his black banner unfurls, clouds and mist coil.\n\n*Refrain:*\nThe True Martial of Heaven’s Pillar, Blessed Deity of the Age, Preceptor of Jade Void, August Minister of the Dark Warrior, Supreme Emperor of the Mysterious Heaven.\nIn the *ren* and *gui* quadrant lies his sacred abode; the *jia* and *geng* generals aid his divine might. Thunder Lords and Lightning Mothers shake mountains and rivers; Wind Masters and Rain Lords clear the paths. When his black banner unfurls, clouds and mist coil; where his divine blade points, snow and frost turn cold. His rainbow banners and sacred regalia descend from the distant skies; all spirits of the Three Realms bow in reverence.\n\nWe now recite the Seventh Precept of Cultivating the Perfected: *\"One must not covet without restraint or hoard wealth without distribution.\"* Reflecting upon my many lifetimes, I confess to having violated this precept. Today, I worship the exalted Perfected Ones with utmost sincerity, earnestly repenting. By the grace of the Dao, may universal pardon be bestowed.\n\n*\"Greedily hoarding wealth without release—*\n*Boundless transgressions truly cannot escape.\"*\n\nNow, prostrating and taking refuge in the exalted Perfected Ones, I repent and vow to eradicate all karmic offenses.\n\nWith utmost sincerity, I take refuge and prostrate in reverence.\n\nHis forms disperse and bodies scatter, pacifying nations and securing households. In an instant, he drives away pestilence; in a moment, he captures demons. All lingering illnesses find peace; all sunken souls in the netherworld are delivered.\n\n*Refrain:*\nThe True Martial of Heaven’s Pillar, Blessed Deity of the Age, Preceptor of Jade Void, August Minister of the Dark Warrior, Supreme Emperor of the Mysterious Heaven.",
      "overlap_context": "*\"One must not kill living beings to satisfy the palate.\"*\n\nReflecting upon my many lifetimes, I confess to having violated this precept. Today, I worship the exalted Perfected Ones with utmost sincerity, earnestly repenting. By the grace of the Dao, may universal pardon be bestowed.\n\n*\"Killing living beings to satisfy the palate—*\n*Boundless transgressions truly cannot escape.\"*\n\nNow, prostrating and taking refuge in the exalted Perfected Ones, I repent and vow to eradicate all karmic offenses.",
      "start_char": 1296,
      "end_char": 2654,
      "start_sentence": 90,
      "end_sentence": 175,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.223440408706665,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\北极真武佑圣真君礼文.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "疫疠驱除皆屏迹，邪魔捕逐尽亡踪。 众生疾苦获安康，地狱沉魂蒙救拔。 家国安宁功莫大，存亡依赖福无穷。 受人醮祭下尘寰，普度有情登道岸。 谨按修真第八戒云； 不得交友非贤，居处秽杂。 伏念某多生以来，曾犯此戒。 今礼高真，虔诚忏悔。 仰仗道恩，普垂赦宥。 交友非贤居秽杂，无边罪业实难逃。 臣今皈命礼高真，忏悔愿除诸罪业。 志心皈命礼。 巡游十洞，审察诸天，罚逆象而灭妖氛，祚善功而刑恶业。 除邪辅正，助上帝之鋾镕。 解厄延生，植下民之福寿。 和： 镇天真武治世福神玉虚师相玄天上帝。 审察诸天诛逆象，巡游十洞校群仙。 刑淫祚善震威权，赦罪录功垂巨泽。 禀命除邪恩莫极，为民植福利无穷。 功成事遂返祥光，大众真仙皆赞叹。 谨按修真第九戒云：不得不忠不孝，不信不仁。 伏念某多生以来，曾犯此戒。 今礼高真，虔诚忏悔。 仰仗道恩，普垂赦宥。 忠孝信仁如有失，无边罪业实难逃。 臣今皈命礼高真，忏悔愿除诸罪业。 志心皈命礼。 醴泉为瑞，神梦昭灵，导从有龙兽之雄，示现有龟蛇之象。 普天率土，祷祀遍於华夷。 亘古穷今，灵应传於兆庶。 和： 镇天真武治世福神玉虚师相玄天上帝。 发涌醴泉为瑞宝，蠲除民疾广天恩。 珍祠茂建答洪麻，徽号屡加昭圣德。 幽赞上穷扬正教，直彰妙用济群生。 威容像设遍华夷，一旦古穷今严敬祀。 谨按修真第十戒云：不得轻忽言笑，举动乖真。 伏念某多生以来，曾犯此戒。 今礼高真，虔诚忏悔。 仰仗道恩，普垂赦宥。 言笑轻狂乖举动，无边罪业实难逃。 臣今皈命礼高真，忏悔愿除诸罪业。 志心皈命礼。 东华南斗，北极西灵，六曜五星，千真万圣。 光耀照临於率土，威灵烜赫於高穹。 或司善恶之权，或执短长之柄。 诸天真宰，幽府龙宫。 福地名山，无鞅圣众。 举十方灵宝天尊 志心皈命礼。 虚危二宿，水火两精，天关地轴之神君，玉女金童之仙众。 皂纛执威权之柄，魁罡当激指之方。 六丁六甲，群真八煞，五雷列圣，仙官力士，猛将神兵，一切威灵，无边圣众。 一讽栩随於上圣，俱卫佑於神功。 各生欢喜之心，咸赐护持之力。 普增威德，俱证希夷。 度诸有情，成无上道。 举雷声普化天尊 礼毕三清上帝北极佑圣真君，臣等虔诚忏悔： 仰启元天大圣者，北方壬癸至灵君。 愿阐慈造广无边，法界众生蒙覆护。 愿阐威灵临有截，下方魔鬼悉消除。 愿垂惠泽济无穷，恶道沉魂俱解脱。 臣等自从无量劫，轮回生死至于今。 沉声滞色或有无，伪作丧真多巧诈。 扰扰七情难断绝，纷纷十业转增深。 信心弗固恣愚痴，诚意未孚多怠堕。 食啖荤腥忘禁戒，耽迷名利积愆尤。 藏机挟数街功能，文过饰非亏信行。 骂雨呵风生怨念，毁经谤法长无明。 高低秤尺或欺瞒，裸露日星忘触秽。 欲海爱河难出离，法桥道岸莫超升。 此生既误入邪宗，异世恐应沉苦趣。 或系天司除寿禄，或因地狱累仇雠。 命如朝露可惊惶，罪若河沙难拯拔。 仰仗高真垂悯恻，愿哀尘世自昏迷。 广开方便大慈门，俯鉴忏陈皈命礼。 十恶六根诸业障，一乘道力尽消除。 百生三世众冤仇，两舍恶心俱忏悔。 忏悔已，皈命无上正真三宝。 举志心发愿： 一愿天地常清净，二愿皇王寿万年。 三愿九祖尽生天，四愿酆都皆罢对。",
      "translated_text": "Pestilence is driven away, leaving no trace; demons are captured and chased, vanishing without a shadow. The afflictions of all beings find peace; the sunken souls of hell are delivered and uplifted. No merit surpasses the tranquility of households and nations; the living and the dead alike depend on boundless blessings. Descending to the mortal realm in response to offerings, you universally ferry sentient beings to the shore of the Dao.\n\nAccording to the Eighth Precept of Cultivating the True:\n*\"Thou shalt not befriend the unworthy nor dwell in filth and disorder.\"*\nI reflect that through many lives, I have violated this precept. Now, prostrating before the exalted Perfected Ones, I earnestly repent. By the grace of the Dao, may universal pardon be bestowed.\n\n*\"Befriending the unworthy, dwelling in filth—*\n*Boundless transgressions truly cannot escape.\"*\n\nNow, prostrating and taking refuge in the exalted Perfected Ones, I repent and vow to eradicate all karmic offenses.\n\nWith utmost sincerity, I take refuge and prostrate in reverence.\nPatrolling the Ten Caves, scrutinizing the myriad heavens, you punish the rebellious and dispel demonic miasma, bestow blessings upon the virtuous and chastise evil deeds. Expelling the perverse and aiding the upright, you assist the Celestial Thearch in refining the cosmos. Dispelling calamities and prolonging life, you plant the seeds of fortune and longevity for the people.\n\n*Refrain:*\nThe True Martial of Heaven’s Pillar, Blessed Deity of the Age, Preceptor of Jade Void, August Minister of the Dark Warrior, Supreme Emperor of the Mysterious Heaven.\n\nScrutinizing the heavens to punish the rebellious, patrolling the Ten Caves to assess the immortals. Punishing licentiousness and rewarding virtue with awe-inspiring authority, absolving sins and recording merits with boundless grace. Enacting the mandate to expel evil, your benevolence knows no limit; bestowing blessings upon the people, your beneficence is infinite. Having accomplished your tasks and fulfilled your duties, you return in auspicious radiance, lauded by all true immortals.\n\nAccording to the Ninth Precept of Cultivating the True:\n*\"Thou shalt not be disloyal or unfilial, faithless or unkind.\"*\nI reflect that through many lives, I have violated this precept. Now, prostrating before the exalted Perfected Ones, I earnestly repent. By the grace of the Dao, may universal pardon be bestowed.\n\n*\"Disloyal, unfilial, faithless, unkind—*\n*Boundless transgressions truly cannot escape.\"*\n\nNow, prostrating and taking refuge in the exalted Perfected Ones, I repent and vow to eradicate all karmic offenses.\n\nWith utmost sincerity, I take refuge and prostrate in reverence.\nSweet springs well forth as auspicious omens; divine dreams reveal your numinous presence. Your retinue boasts the might of dragons and beasts; your manifestations bear the forms of tortoise and serpent. Throughout the realm, from the Central Plains to the barbarian lands, prayers and offerings abound. From ancient times to the present, your miraculous responses are recounted by the multitudes.\n\n*Refrain:*\nThe True Martial of Heaven’s Pillar, Blessed Deity of the Age, Preceptor of Jade Void, August Minister of the Dark Warrior, Supreme Emperor of the Mysterious Heaven.\n\nSweet springs gush forth as treasured omens, dispelling the people’s afflictions with boundless celestial grace. Magnificent temples are erected in gratitude for your vast blessings; illustrious titles are repeatedly bestowed, illuminating your sagely virtue. Secretly aiding the highest to propagate the true teaching, your wondrous efficacy directly manifests to succor all beings. Your majestic presence, enshrined in images, pervades the Central Plains and barbarian lands alike; from ancient times to the present, reverent worship endures.\n\nAccording to the Tenth Precept of Cultivating the True:\n*\"Thou shalt not treat speech and laughter lightly nor act contrary to truth.\"*\nI reflect that through many lives, I have violated this precept. Now, prostrating before the exalted Perfected Ones, I earnestly repent. By the grace of the Dao, may universal pardon be bestowed.\n\n*\"Light laughter, reckless speech, untrue conduct—*\n*Boundless transgressions truly cannot escape.\"*\n\nNow, prostrating and taking refuge in the exalted Perfected Ones, I repent and vow to eradicate all karmic offenses.\n\nWith utmost sincerity, I take refuge and prostrate in reverence.\nThe Eastern Flower, Southern Dipper, Northern Culmen, Western Numinous, the Six Luminaries, Five Stars, and the thousand Perfected, myriad Sages. Their radiance illuminates the realm; their majestic power blazes across the high heavens. Some wield the authority over good and evil; others hold the reins of life and death. The true lords of the myriad heavens, the dragon palaces of the netherworld, blessed lands and famed mountains—innumerable hosts of sages.\n\nInvoking the Ten Directions’ Numinous Treasure Heavenly Worthy,\nWith utmost sincerity, I take refuge and prostrate in reverence.\nThe constellations of Xu and Wei, the essences of Water and Fire, the Divine Lords of the Celestial Gate and Earthly Axis, the immortals of Jade Maidens and Golden Lads. Wielding the black banners of authority, the stars of Kui and Gang mark the paths of retribution. The Six Ding and Six Jia, the hosts of Perfected and Eight Fiends, the ranked sages of the Five Thunders, the immortal officials and divine warriors, the valiant generals and spirit soldiers—all the majestic and numinous, the boundless hosts of sages. At a single chant, they follow the exalted sages, all guarding and aiding the divine work. Each awakens a heart of joy, bestowing the power of protection. Universally enhancing virtue and power, all attain the mystery of the formless. Ferrying sentient beings, they accomplish the supreme Dao.\n\nInvoking the Heavenly Worthy of Universal Transformation through Thunder,\nThe rites completed, to the Three Pure Ones and the Northern Culmen’s Protector, the Sage Lord, we earnestly repent:\nWe reverently invoke the Primordial Heaven’s Great Sage, the Most Numinous Lord of the Northern Wall’s Ren and Gui. May your boundless compassion unfold, sheltering all beings in the dharma realm. May your majestic power descend without limit, vanquishing all demons below. May your benevolent grace flow endlessly, liberating the sunken souls of evil destinies.\n\nSince time immemorial, we have transmigrated through birth and death until now. Lost in sound and form, sometimes existing, sometimes not, we have feigned truth and abandoned authenticity through cunning deceit. The seven emotions surge unceasingly; the ten karmic deeds deepen endlessly. Our faith falters, yielding to foolishness; our sincerity wavers, fostering laziness and neglect. We consume meat and wine, forgetting the precepts; we indulge in fame and profit, accumulating transgressions. Concealing schemes and manipulating numbers, we parade our abilities; covering faults and embellishing wrongs, we betray trust and conduct. Cursing wind and rain, we harbor resentment; slandering scriptures and defaming the Dao, we prolong ignorance. Cheating with scales and measures, we deceive; exposing ourselves to sun and stars, we forget defilement. The sea of desire and river of love are hard to escape; the bridge of the Dao and shore of the Way remain unattained. Having strayed into heterodox sects in this life, we fear sinking into bitter destinies in the next. Some are bound by celestial officials, stripped of lifespan and fortune; others are burdened by hell’s grudges. Our lives are as fleeting as morning dew, cause for alarm; our sins are as countless as the sands of a river, impossible to redeem.\n\nRelying on the exalted Perfected Ones’ compassion, we pray for mercy upon this deluded mortal world. Open wide the gate of great compassion, look down upon our repentant prostrations. May the power of the One Vehicle dissolve the obstacles of the six senses and ten evils. May the enmities of a hundred lives and three existences, the hatreds of both parties, be entirely repented.\n\nHaving repented, we take refuge in the supreme, true, and correct Three Treasures.\n\nWith utmost sincerity, we make our vows:\nFirst, may heaven and earth remain ever pure;\nSecond, may the sovereign’s reign endure ten thousand years;\nThird, may the nine generations of ancestors ascend to heaven;\nFourth, may the trials of Fengdu be forever concluded.",
      "overlap_context": "c offenses.\n\nWith utmost sincerity, I take refuge and prostrate in reverence.\n\nHis forms disperse and bodies scatter, pacifying nations and securing households. In an instant, he drives away pestilence; in a moment, he captures demons. All lingering illnesses find peace; all sunken souls in the netherworld are delivered.\n\n*Refrain:*\nThe True Martial of Heaven’s Pillar, Blessed Deity of the Age, Preceptor of Jade Void, August Minister of the Dark Warrior, Supreme Emperor of the Mysterious Heaven.",
      "start_char": 2655,
      "end_char": 4030,
      "start_sentence": 176,
      "end_sentence": 259,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.140703439712524,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\北极真武佑圣真君礼文.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "五愿二炁无愆伏，六愿五谷悉酆登。 七愿永劫息干戈，八愿四时无疫疠。 九愿众生离业纲，十愿学道总成仙。 总持十愿结良绿，忏悔众生诸业障。 发愿欲成无上道，愿回天鉴照凡情。 慈悲广为作舟航，普度众生登道岸。 尚来礼赞诸功德，忏悔无量罪愆尤。 天心天外四维中，普愿一切成妙道。 发愿已，皈命礼无上至真三宝。 讽经　回向 伏以一声圣号，能消劫劫之灾。 众咏真名，可长生生之福。 言之难尽，赞亦莫穷。 恭按冲科，仰瞻妙相。 严陈赞咏之理，备伸忏悔之诚。 惟天听之匪遥，冀人心之可格。 伏愿惟宏慈之莫大，念群品之可哀。 俾荡涤於前非，尽释赦於宿对。 丹书纪善，碧简延生。 眷属安宁，永处福龄之地。 九玄超度，尽离幽暗之乡。 以臻诸福，则何福不臻。 以灭诸灾，则何灾不灭。 千灵拥护，万事亨通。 倘副愚衷，敢忘效验。 稽首皈依，志心称念。 福生无量天尊，不可思议功德。 北极真武佑圣真君礼文竟",
      "translated_text": "Fifth, may the two qi remain without flaw or rebellion;\nSixth, may the five grains all ripen in abundance.\nSeventh, may warfare cease for eternal kalpas;\nEighth, may the four seasons be free of plague and pestilence.\nNinth, may all beings escape the net of karma;\nTenth, may all who study the Dao attain immortality.\n\nHolding fast to these ten vows, we weave good affinity,\nrepenting all karmic obstacles for sentient beings.\nAspiring to accomplish the supreme Dao,\nwe pray the celestial mirror reflect mortal sentiments.\nWith boundless compassion as our boat and oar,\nmay all beings universally cross to the Dao’s shore.\n\nWe now come to praise all meritorious virtues,\nrepenting measureless transgressions and faults.\nWithin the celestial heart, beyond the heavens, and throughout the four directions,\nmay all universally attain the wondrous Dao.\n\nHaving made these vows, we take refuge and prostrate to the supreme, most true Three Treasures.\n\n**Chanting the Sutra – Dedication of Merit**\n\nWe humbly submit: a single sacred name\ncan dissolve kalpas of calamity.\nThe chanting of true names by the multitude\ncan prolong life after life of blessings.\nWords cannot exhaust their profundity,\nnor praise encompass their virtue.\nReverently following the subtle teachings,\nwe gaze upon the wondrous form.\nWith solemnity, we set forth the principle of praise and chant,\nfully expressing the sincerity of repentance.\nThough heaven’s hearing is not distant,\nwe hope human hearts may be moved.\nWe humbly pray: may your vast compassion be boundless,\nmindful of the pitiable condition of all beings.\nMay past wrongs be thoroughly cleansed,\nand all karmic debts from former lives be absolved.\nLet deeds of goodness be inscribed in cinnabar,\nand longevity extended upon jade tablets.\nMay kinfolk dwell in peace,\nforever abiding in the land of blessed years.\nMay the nine lineages be delivered,\nutterly departing the realm of darkness.\nIn attaining all blessings, what blessing would not be attained?\nIn extinguishing all disasters, what disaster would not be extinguished?\nMay a thousand spirits guard and protect,\nand ten thousand affairs proceed smoothly.\nShould these prayers accord with our foolish sincerity,\nhow dare we forget to offer gratitude?\nWe bow our heads in reverence, taking refuge,\nand with wholehearted devotion recite:\n*\"Boundless Blessings, Heavenly Worthy,\nInconceivable Meritorious Virtues!\"*\n\n**The Rite of Veneration for the Northern Culmen’s True Martial, Protector Sage Perfected Lord concludes.**",
      "overlap_context": "stacles of the six senses and ten evils. May the enmities of a hundred lives and three existences, the hatreds of both parties, be entirely repented.\n\nHaving repented, we take refuge in the supreme, true, and correct Three Treasures.\n\nWith utmost sincerity, we make our vows:\nFirst, may heaven and earth remain ever pure;\nSecond, may the sovereign’s reign endure ten thousand years;\nThird, may the nine generations of ancestors ascend to heaven;\nFourth, may the trials of Fengdu be forever concluded.",
      "start_char": 4031,
      "end_char": 4429,
      "start_sentence": 260,
      "end_sentence": 287,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.514850854873657,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\北极真武佑圣真君礼文.txt",
        "category": "威仪类"
      }
    }
  ]
}