{
  "source_id": "华阳陶隐君内传",
  "source_file": "chunked_daozang\\华阳陶隐君内传.json",
  "total_chunks": 21,
  "total_original_chars": 14825,
  "total_translated_chars": 86837,
  "total_translation_time": 458.7999744415283,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\记传类\\华阳陶隐君内传.txt",
    "category": "记传类"
  },
  "full_translation": "**The Inner Biography of Master Tao of Huayang**\n\n**Text Title:** *The Inner Biography of Master Tao of Huayang*\n**Three fascicles.** Compiled by Jia Song of the Tang dynasty.\n**Source:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Biographies and Accounts* Category.\n\n---\n\n**Preface to the Biography of Master Tao of Huayang**\n*By Jia Song, the Hermit of Creeping Vines*\n\nSome ask: Master Zhenbai (Tao Hongjing) already appears in *The Book of Liang* under *Biographies of Eminent Recluses*. Why compile another biography now?\n\n*The Book of Liang* states: \"Master Tao’s personal name was Hongjing, styled Tongming, a native of Moling in Danyang. His mother dreamed of two celestial beings holding incense burners, and so forth. When Emperor Gao of Qi became regent, he was appointed tutor to the imperial princes. Though dwelling within the vermilion gates, he remained aloof from worldly affairs. In the tenth year of *Yongming*, he doffed his court robes at the Gate of the Divine Tiger and submitted a memorial resigning his stipend. The imperial edict granted his request. The court officials saw him off at the Pavilion of the Conquered Barbarians, where the banquet was most lavish—none since the lands east of the Yangtze had seen its like. Thereafter, he wandered through famous mountains in search of transcendent herbs. Whenever he passed through valleys and ravines, he would sit or lie among them. He was especially fond of the wind in the pines and planted them throughout his courtyard. When Emperor Wu of Liang ascended the throne, he exchanged letters with the master without cease, sending messengers several times a month. The people of the time called him ‘the Prime Minister in the Mountains.’ He passed away in the second year of *Datong* at the age of eighty-five. His complexion remained unchanged, and his limbs retained their flexibility, and so forth.\"\n\nThe reason for compiling this biography in full is to clarify what was too brief in the earlier account. Here, I have also included the biographies by Zheng Zhang and Shi Jun, collating them together.\n\nIt may be said: The biography of the master in *The Book of Liang* is like the *Records of the Historian*’s account of the Old Master (Laozi). Its brevity omits much, leaving the deeds of the immortal sage obscure and tangled. Han Fei was recorded alongside Laozi, and many have debated this pairing. Yet *The Book of Liang* places the master among Shen Lin, Ruan Xiaoxu, Fan Yuandan, and Ma—what a disparity!\n\nThe master’s knowledge penetrated past and present; his undertakings illuminated the world. His spirit dwelled in stillness, his essence roamed the mysterious pivot. He established the three ranks to purge falsity, divided the five regions to mirror the threads of destiny, composed the *Secret Instructions* to elucidate the essentials, and expounded the *True Admonitions* to honor celestial transmissions. Beyond the subtle and obscure, he soared through the realm of purity and emptiness—truly the Dong Hu of the Daoist tradition, the Confucius of the Way.\n\nMoreover, he expounded the ancient classics, immersed himself in the hundred schools, plumbed the patterns of heaven and earth and the stars, and mastered the arts of yin-yang and tortoise-shell divination. When comets appeared after the death of whales, when the moon was eclipsed in the land of unicorns, when bronze mountains collapsed and bells tolled in response, when silkworms spun their threads and the strings of the *shang* note snapped, when dragons sang and clouds arose, when tigers roared and winds stirred—these were the mysterious workings of nature, commonly called \"resonance.\" The master analyzed their subtleties, showing they were neither resonance nor mere coincidence.\n\nCould Shu Xiang, Zichan, Jing Fang, or Guo Pu compare to the master’s breadth of learning?\n\nIn the tenth year of *Yongming* of Qi, Minister Xie Lun of Wuxing heard that the master had resigned his post to retire at Huayang. On the road, he composed a *Biography*. Minister Xie’s *Biography* states: \"The master’s personal name was Hongjing, a native of Danyang. From childhood, he displayed exceptional conduct, keen perception, and vast knowledge. He thoroughly studied the Five Classics, the philosophers, and the histories. Skilled in calligraphy, he mastered the methods of past and present.\"\n\nIn his youth, he harbored ambitions of riding clouds and driving dragons, refusing marriage and officialdom. Yet with no means to sustain himself, he briefly served in a minor post as a tutor to the Prince of Yidu. Though dwelling within vermilion gates, he lived alone in a single chamber, seldom engaging with the outside world. Day and night, he transcribed and studied esoteric texts, dedicating over twenty years to the practice of dietary regimens. Gradually, he penetrated the profound and subtle, though much of his work remained secret. As his arts advanced, he cast off his official robes and settled on Mount Mao.\n\nHis bearing was luminous and refined, his gaze radiant; his frame was slender and tall, his neck and ears finely wrought—clearly set apart from the common crowd. Here ends Minister Xie’s *Biography*.\n\nThis account, along with that in the *History of Liang*, is exceedingly cursory. I cannot fathom why Minister Xie Lun, having heard of the master’s retreat to the mountains and feeling such admiration, would hastily compose a *Biography* en route, one so lacking in thorough investigation of his merits and deeds.\n\nTao Hongjing remarked: \"The *Biography* Wang Xizhi wrote of Master Xu was much the same.\" As that account was too sparse to be of use, Tao Yu (Hongjing’s nephew) compiled the *Original Records*. Yet even by the end of the Qi dynasty, many matters remained omitted or incomplete. Though Yu was the master’s nephew, his *Original Records* only approximated thoroughness, marred by a base literary style and excessive trivialities. He himself admitted: \"This is not yet a proper *Biography*; it merely records his conduct to prevent its loss.\" Why it ceased abruptly in the first year of *Yongyuan* remains unknown.\n\nLater, Pan Quanwen, a disciple of the master, continued the work. He wrote: \"Tao Yu’s *Original Records* end at the close of the Qi dynasty. For the subsequent twenty-odd years, no further records exist. I have thus compiled these annals year by year, leaving a fuller *Biography* to future scholars.\" Beginning in the first year of *Tianjian*, he recorded events until the summer of the seventh year, fourth month. At that time, the master changed his name and secretly journeyed to distant mountains. In the summer of the seventh year of *Tianjian*, the master traveled south under his new name, as detailed in the *Biography*. With no one aware of his whereabouts, Quanwen’s account also ends here.\n\nAlas! The two earlier *Biographies*—those in the *History of Liang* and by Minister Xie—are far too brief. The disciples’ compilations, meanwhile, lack coherence, nearly erasing the path of one who withdrew from the world, the traces of his pure cultivation and soaring spirit. Thus, drawing from the *Dengzhen Yinjue*, the *Zhen’gao*, the *Taiqing Jing*, and the master’s collected writings, I have pieced together these events and composed this work in three fascicles.\n\n*Hua Yang Tao Yinju Neizhuan*, Fascicle One\nCompiled by Biluo Ruzi Jia Song\n\nThe master’s personal name was Hongjing, styled Tongming, a native of Moling in Danyang. The *Original Records* state that his residence lay in Baiyang Alley. His lineage traces back to Emperor Yao. When Yao governed Jizhou, his family dwelt in Pingyang. The Western Han Chancellor Qingdi and the Eastern Han Minister of Works Dun were illustrious figures of this line. During Dong Zhuo’s burning of Luoyang, the thirteenth-generation ancestor, Chao, crossed the Yangtze, becoming a native of Danyang. The seventh-generation ancestor, Jun, served the Wu kingdom as General of the South, as the *Original Records* note: \"He was the younger brother of Huang, Inspector of Jiaozhou.\" He was enfeoffed as Marquis of Jurong. After Wu’s fall, the family moved north. During the Yongjia upheaval, they migrated south again. The *Original Records* state: \"Jun was the third son of the founding ancestor. During Yongjia, he served as Marshal to Sima Yue, Prince of Donghai, leading garrison troops to Xuchang. After their defeat, he returned south and became a staff officer under Wang Dun, the Grand Marshal. Dun petitioned to restore his household registration, and later, he was appointed Consultant to the Chariot and Horse General, though he declined. His grandfather, Pi, was upright and spirited, refusing office.\"\n\nHis great-grandfather, Xinggong, served as a clerk in the commandery. The *Original Records* note: \"He was versatile and adept at managing property. He was nominated as Filial and Incorrupt, appointed to Guangjin County.\" His grandfather, Long, stood seven *chi* and five *cun* tall, with a dignified bearing. Skilled in medicine, he devoted himself to healing. He accompanied Emperor Wu of Song in the campaign against Yao Hong and was enfeoffed as Marquis of Yuanfeng in Jin’an. The *Original Records* add: \"When Yan Jun sought his residence to expand a temple, he refused and resigned his post. Later, his title was revoked, and he was exiled to Guangzhou, eventually rising to Prefect of Xinhui.\"\n\nHis father, Zhenbao, styled Guozhong, was a renowned figure in Jiangdong. He served as Investigating Censor in the Southern Terrace and later as Chancellor of Xiaochang in Jiangxia. The *Original Records* state: \"He was also skilled in archery, understood medicine, and was widely read in the philosophers and histories. His bearing was elegant. He befriended Xiao Sihua, Wang Zhao, and Liu Bing.\" In the winter of the fourth year of *Yuanhui*, he was sent as an envoy to the northern court to foster goodwill between neighboring states. He composed a travelogue and poems.\n\nInitially, the master’s mother, Lady Hao—the *Original Records* name her Zhi Zhen, a native of Donghai—experienced an auspicious sign before his birth. She dreamed a blue dragon emerged from her bosom and soared into the eastern sky. The *Original Records* describe it thus: \"A blue dragon suddenly issued from her body, ascending straight into the heavens.\" The *History of Liang* records: \"She dreamed two celestial beings bearing an incense burner approached her, and soon after, she conceived.\" The accounts differ. Since the *Original Records* were compiled by the master’s nephew, Yu, how could such details escape the historians’ notice? Upon waking, she examined herself and found no injury. The next day, she told others: \"I shall bear an extraordinary son, though he will leave no descendants.\" Someone replied: \"Might he become an immortal?\" The *Original Records* add: \"Upon waking, she secretly told Zhou: 'I shall soon give birth to a son, one destined for greatness.'\" In the third year of *Xiaojian* of Song, on the thirtieth day of the fourth month, at midnight, the master was born. The *Original Records* specify: \"The year was *bingshen*, the day *jiaxu*. That year had an intercalary fifth month. The following dawn marked the Summer Solstice.\"\n\nAt dawn, his mother bathed and, feeling a slight discomfort in her body, rose. When the master was first born, he did not cry out in alarm. As soon as he could sit, he showed exceptional intelligence. At five or six, he was deeply fond of writing, and even when playing before the curtains, he would only hold brush and inkstone. By eight or nine, he had read over a thousand volumes and was quite skilled in composition. Upon reading the *Biographies of Divine Transcendents* by Ge Zhichuan of Yibu, he encountered the tale of the Eight Lords of Huainan.\n\nThe *Original Records* state: A village elder, the Ju family, lent him the sixth fascicle of Ge Hong’s *Biographies of Divine Transcendents*. He held the scroll to sleep at night, declaring: \"To climb the azure clouds and ride the white sun—how distant could it be?\" From then on, he became deeply devoted and awakened to a resolve for the life beyond the world. His bearing was lofty and untrammeled, his complexion luminous and refined. Whenever he went out, passersby would gather to watch, all saying: \"Young Master Tao is a fallen immortal from the Jade Capital.\" He would then take up a feather fan to shield himself, never putting it aside, even in winter.\n\nAt eleven, he composed a eulogy for Academician Wang Hao. The *Original Records* note: Hao was the son of Sima Zhao, the Chief Clerk of the Minister of Personnel. The master’s written response to Hao was as composed as that of a seasoned scholar.\n\nAt fifteen, he returned from the southern provinces. The *Original Records* state: At thirteen, his father followed Liu Bing, the Minister of Personnel, to Huainan. At fifteen, he returned to the capital and lodged at the residence of his maternal uncle, Xu Zhou. There, he composed *A Record of Mountain-Seeking*. The text of this *Record* is preserved in his collected works.\n\nUpon coming of age, the master refused to marry. He maintained purity and renounced desires, for his entire life never drawing near to sensual pleasures. He would say: \"I wish to keep my spirit untroubled.\" He stood seven *chi* and two *cun* tall, with sparse brows and a broad forehead. On his right shoulder was a purple mark the size of a coin. According to the *Later Sacred Register of the Golden Watchtower*, the Azure Lad remarked: \"These are all signs of an immortal.\" On his right thigh were several dozen black moles, arranged in the shape of the Big Dipper. He disliked meat and strong flavors, partaking only of green-grain rice. The *Biography of the Perfected One of Pure Emptiness* contains a recipe with *nan zhu* as the main ingredient—this was the diet of the highest immortals. He was deeply fond of the sound of pines, and wherever he lived, he would plant them himself. Feeling his reading had not yet reached ten thousand volumes, he supplemented it with esoteric texts. Thus, he rarely left the prefecture, declining all official summons.\n\nHis father had been close friends with Liu Bing, who served as Governor of Danyang. Bing’s son, Si, was renowned from a young age and deeply devoted to literature. The master befriended him, sharing carriages when they went out and meals when they dined.\n\nAt that time, the Song dynasty had lost its virtue, and Emperor Cangwu met his end. The *History of the Song* states: Emperor Yu, the eldest son of Emperor Ming, ascended the throne but ruled with madness and cruelty. He used Qi Gao as a target for archery, and upon Gao’s death, posthumously demoted him to Prince Cangwu. Xiao Daocheng established himself, and Emperor Shun remained in power. Shen Youzhi, the Governor of Jingzhou, raised troops in defiance. Daocheng entered the capital to secure the court. The *History of the Song* notes: Emperor Shun was the third son. As Qi Gao monopolized the power of deposition, half the realm resisted. Thus, Gao entered the capital to take control.\n\nThe Minister of Personnel, Yuan Yi, plotted with others at Stone Citadel to assassinate Daocheng, and Liu Bing was involved. They fled to Stone Citadel, taking their followers with them. The master, along with Han Ben and Mi Dan, drafted official documents. Daocheng led troops to crush Stone Citadel. The *History of the Song* records: The Minister of Personnel, Yuan Yi, conspired at Stone Citadel to kill Daocheng but failed and was soon annihilated. The *Original Records* state: At twenty-two, the master followed Liu of Danyang into Stone Citadel to support Yuan Yi’s cause. The master remained steadfast in his loyalty, never abandoning old ties. Even in peril and uncertainty, he did not seek to withdraw.\n\nAfterward, the master was able to leave. Si became a wandering monk. The *Original Records* note: That night, the city fell, and Si, along with his younger brother, barely escaped toward the capital. They were captured, and Si died in the prison of Jiankang. No one dared to look upon his body, but the master wept over it and personally arranged his burial. The *Original Records* add: The master personally collected his remains and buried them, mourning at the old grave.\n\nEarlier, Si had been one of the Four Companions of Emperor Shun, along with Jiang Chi and Chu Xuan, and had composed *Seven Linked Pearls in Praise of Song Virtue*, which was celebrated in his time. The original text was now lost. The master sighed and said: \"Whether wise or foolish, all perish within a hundred years. What matters is leaving behind a name to be cherished by later generations. Alas, Liu’s name and works are both lost!\" The *Original Records* state: After Liu Si’s flight from Stone Citadel, his writings were scattered. The master wished to compile them but could not recover them.\n\nThe following year, Daocheng was enfeoffed as Duke of Qi and granted the Nine Bestowments. The mandate of heaven was seen to have found its rightful recipient. The master, having long been allied with the Liu family, harbored deep unease. The *Original Records* note: After leaving Stone Citadel, the master wished to renounce the world and seek the mountains, but the transition between Song and Qi unsettled the realm. Bound by his ties to the Liu family, he remained anxious and troubled. He then sought an introduction through Ji Zhen to meet at Xinting, where he was warmly received and invited to stay within the tent.\n\nAfter Shen Youzhi was pacified, he returned to the Eastern Residence and served as tutor to Daocheng’s sons. The *Original Records* state: After Shen Youzhi’s defeat, he returned to the Eastern Residence and was appointed tutor to the fifth son, Ye, and the sixth son, Gui, while also managing the household records. At twenty-three, he was appointed Gentleman Attendant to the Prince of Baling. After Emperor Gao of Qi ascended the throne, he was appointed Gentleman Attendant to the Prince of Yuzhang. The *History of the Liang* states: When Emperor Gao served as regent, he appointed the master as tutor to the various princes. This is incorrect. The master knew he was being sidelined by those close to the emperor and declined the second appointment.\n\nThe following year, he accompanied the Prince of Ancheng to garrison Stone Citadel. At the beginning of Emperor Shizu’s reign, he was appointed Gentleman Attendant to the Prince of Yidu, with the title General of Vibrant Might. During the Qi dynasty, the Gentleman Attendants also oversaw the duties of the Secretariat.\n\nThe master’s compositions for auspicious and inauspicious occasions, both within and beyond the court—whether formal protocols, memorials, petitions, or official dispatches—surpassed all others. Whenever he dipped his brush to write, his words became the standard for all. *The Record of Origins* states: \"The master’s handling of ceremonial forms, memorials, and brushwork for both courtly and external affairs—including memorials, petitions, and dispatches—was unmatched. Several princes’ scribes and record-keepers came to study and adopt his work as their model.\" The various princes’ attendants seethed with envy and slander, yet the master remained untroubled, his demeanor ever serene.\n\nWhen the Prince of Guiyang ascended the Double Terrace, he hosted a feast for the imperial clan’s marquises and princes, along with their guests. The master, accompanying the Prince of Yidu, was among them. The Prince of Guiyang announced a poetic theme, drawing ten topics from a vessel. The master drew \"Water Immortal\" and was greatly pleased. His *Rhapsody* (recorded in full in the collected works) so moved Shen Yue and Ren Fang that they sighed: \"It is like gazing upon the autumn sea—one sees only boundless expanse, yet cannot fathom its depths.\" Such was the reverence he commanded.\n\nSoon after, he was appointed Palace Gentleman of the Left Guard, though contemporary opinion deemed the post beneath him.\n\nBedao Jing repeatedly spoke of him to Emperor Wu, who replied: \"The late emperor once personally held this office. Pei Songzhi was promoted from it to Gentleman Attendant, for I hold it in esteem—how could you not know?\" *The Primary Record* states: He was then twenty-nine years old.\n\nAs the new halls of the Azure Palace were completed, the emperor was keen on excursions and feasts. The master submitted a memorial with an ode, which was then acclaimed as unmatched. One day at Shitou, he fell into a trance, as if transported elsewhere, remaining unaware of all around him for seven days. When he suddenly recovered, he said: \"I witnessed most extraordinary things,\" but kept them secret, revealing nothing. *The Primary Record* states: At twenty-nine, while at Shitou, he suddenly fell ill, losing consciousness. He took no medicine, nor ate or drank, and after seven days abruptly recovered, claiming to have seen many visions. Thereafter, his complexion grew wan and haggard, and his speech became slow and halting.\n\nThat year, Sun Youyue of Shuyang first transmitted to the master the Daoist talismans and charts. Though said to be authentic transmissions, they had passed through many hands in copying, and he found them unsatisfactory. The following year, he journeyed to Mount Mao. *The Primary Record* states: In the year *wuchen*, he first went to Mount Mao. There, he sought out scriptures and methods, yet soon cast off his robes and departed, his quest for the Dao beginning in earnest. He obtained the original handwritten texts of the earlier adepts Yang and Xu from the Xingning era.\n\nAccording to the *True Records*: In the third year of Xingning of the Jin, the Perfected of Great Clarity, Lord Mao; the Perfected of Purple Yang, Lord Zhou; the Lady of the Purple Tenuity, Consort An of Nine Flowers; and other transcendents all descended upon Yang Xi at Mount Mao, while the father and son of the Xu family likewise received their teachings. Yang and Xu, moved by these revelations, left behind writings of luminous clarity. The master now obtained these texts—truly, Heaven had entrusted them to him. His heart leapt with reverence, as if he had beheld the Perfected in person. He then examined the correspondence of the Three Perfected and learned that much of what he had acquired was still incomplete or lost. He searched far and wide, and thus requested leave to travel east. He visited Lou Huiming at Mount Dahong, encountered Du Jingchan at Mount Taiping, and sought out the monk Zhong Yishan at Mount Chao. With humble words and earnest pleas, he obtained over ten scrolls in the hand of the Perfected.\n\nHe wandered for over two hundred days before returning to the capital. *The Primary Record* states: He traveled through mountains and rivers for over two hundred days before returning. Soon after, he set out again, seeking lost writings, and obtained many more. From Changshan in Dongyang to Tianmu in Wuxing, and through the renowned mountains of Yuqian, Linhai, and Sui’an, there was no peak he did not explore. His body was light and agile, and climbing posed no difficulty. When he encountered crumbling cliffs or sheer precipices, he would clamber up with ease. In secluded ravines or deep gorges, he would chant, bathe, and linger, sitting or lying among the flowers and herbs. Even when apes cried or birds roosted, he could not bring himself to leave, often spending nights alone among the deer. He often said: \"Though vermilion gates and spacious halls are splendid, I feel no desire to go there. Gazing upon towering crags and vast marshes, I know such places are hard to dwell in—yet I am always drawn to them, unable to explain why. It must be the work of the numinous.\"\n\nUpon his return to the capital, he was appointed Gentleman Consultant through the recommendation of the General of Vibrant Might. In his youth, the master had often said that the court and marketplace were no place for joy. As he grew older, witnessing the transitions from Song to Qi, he saw the times were not yet ripe, and so remained in a lowly position, drifting between wind and fire. But when he learned of the rising turmoil of war, he shook out his robes, turned eastward, and said: \"I depart.\" He often spoke of how within the great heavens there are thirty-six grotto-heavens. *The Transmission of Mao* states: Within the great heavens lie thirty-six grotto-heavens beneath the earth, and in the eight seas, the divine mountains also have their grotto-palaces, some a thousand *li* or five hundred *li* in extent, not counted among the thirty-six. On the left bank of the Yangtze, Mount Fulong is the eighth, called the Golden Altar Grotto of Flourishing Yang. The Three Lords Mao attained the Dao and dwelt there. \"I shall go there for good,\" he resolved.\n\nConfucius said: \"Seclude yourself to fulfill your aspirations; practice righteousness to realize the Way. I have heard these words, but never seen such a man.\" The master said: \"Today, my righteousness is fulfilled, and I have no further direction. Let me follow the path of seeking my aspirations.\" He then styled himself \"Recluse of Flourishing Yang.\" *The Primary Record* states: In his letters and documents, he used this name in place of his own—just as Shi’an was called \"Mysterious Repose\" and Zhichuan \"Embracer of Simplicity.\"\n\nThis was the tenth year of Yongming. *The Primary Record* states: The year *renshen*, when he was thirty-seven. The day of his departure drew near, and he instructed his attendants to leave the capital first. After bidding farewell at the ministry, he took his court robes and hung them at the Gate of the Divine Tiger, donning a deer-hide cap and walking out alone with a single attendant. He then took leave of Wang Yan, speaking of his plans. Yan said: \"His Majesty is most strict in governance and does not permit men to act in strange or lofty ways. If this incurs his displeasure, you will bring trouble upon yourself and thwart your mountain aspirations. What then?\" The master fell silent for a long while, then said: \"I act for myself, not for fame. If this is a concern, why proceed thus?\" He did not go to the ministry but submitted a memorial of resignation alone.\n\nZheng Zhang and Shi Jun said: In the tenth year of Yongming, the master removed his court robes at the Gate of the Divine Tiger, submitted a memorial to resign his stipend, and was granted leave by imperial decree. They knew the beginning but not the end. The memorial is recorded in full in the collected works.\n\nThe memorial having been submitted, an imperial rescript was issued in reply. The rescript’s full text is recorded in the collected works. As he prepared to depart, he took leave of the Prince of Yidu. Both were choked with sobs, unable to speak. Those around them dared not lift their gaze. Someone said to the Prince of Yidu: “Your Highness holds him in such deep affection and esteem—how can you allow him to go?” The prince replied: “This is the finest deed in the realm. The Son of Heaven has permitted him to withdraw from court service. How dare I oppose it?”\n\nHe presented a fur robe and a mirror as parting gifts and assigned several officials and servants to attend him in the mountains.\n\n*The Record of Origins* states: The master had formerly served as tutor to the Princes of Ancheng and Yidu and was on familiar terms with all the imperial princes, young and old alike. The Princes of Wuling, Poyang, Guiyang, and Hengyang each received him with exceptional warmth, and whenever he visited, their conversations would last the whole day. During the Yongtai era, he carefully avoided drawing attention to himself, consistently demonstrating his desire for retirement, and thus remained free of entanglement in worldly affairs. The Prince of Yidu, discerning from childhood and having known the master the longest, shared an especially close bond. The master, too, devoted himself wholeheartedly to guiding him. When he learned that the master intended to renounce the world, he repeatedly broke into tears. At their final parting, he spoke as before.\n\nSomeone again asked the Prince of Yidu: “How can you let him go?” The prince replied: “Recently, the Prince of Wuling sought to appoint him as a local administrator, but I argued strenuously to prevent it. Out of caution, I did not meet with the Prince of Wuling for three days. Now, this is the finest deed in the realm—how could I, out of personal attachment, delay his long-cherished withdrawal from court?” The next morning, a farewell gathering was held. He presented nine items—a fur robe and a mirror—as parting gifts, along with clothing, books, and a carriage for official travel. Five or six attendants accompanied him personally, seeing him as far as Hushu, while several officials and servants were permanently assigned to manage his affairs in the mountains, with messengers dispatched monthly.\n\nThe Princes of Wuling, Guiyang, and Poyang each sent poems and gifts, along with servants and supplies to assist him.\n\nOnce the master had boarded his boat to cross the river, the nobles and high officials of the Qi court gathered at the Zhenglu Pavilion to see him off. Raising their cups and waving their sleeves, they all declared: “Nothing like this has been seen east of the Yangtze in recent times—only today do we witness it. Even the Two Shus, who amassed wealth before returning to their fields, cannot be called lofty in comparison.” The master replied: “The First Emperor of Qin, the Founder of Han, Xiang Yu, and Sun Ce—all wielded power that shook the seas and dominated the heavens. Yet when their last breath faded, they became but clods of earth. How much more so for the likes of us? Dwelling high in the clouded peaks, seeking the hidden abodes of the immortals—this is my true purpose.”\n\nAs dusk fell, they parted. Even the charioteers rejoiced for him. Those who had come to see him off said to one another: “The solitary swan has soared beyond the heavens, while we remain bound to our grains, leaping and stumbling within the snares of the world.”\n\nThe following year, great chaos engulfed the Qi dynasty, and the Marquis of Xichang, Xiao Luan, murdered his sovereign. Only then did they recognize the master’s foresight.\n\n*Inner Biography of Master Hidden-Cinnabar of Huayang, Volume One* ends.\n*Inner Biography of Master Hidden-Cinnabar of Huayang, Volume Two* begins.\n\nMaster Biluo’s disciple, Jia Song, records:\n\nInitially, the Master sought the Great Mao and Middle Mao peaks at Mount Accumulated Gold, where the land was suited for cultivating the Supreme Dao. As the *True Instructions* states: “The Great Mao and Middle Mao peaks stand connected, with a long ridge between them called Linked Stone, known in ancient times as Mount Accumulated Gold. The place is fit for human dwelling—one should seek a water-adjacent site for a tranquil abode.” There, he settled, for the conditions were ripe for compounding the elixir and pursuing the Supreme Dao. On the western slope of the ridge, he established the Upper and Lower Halls of Huayang. The *Hidden Instructions on Ascending to Perfection* explains: “The Upper Hall is for refining emptiness and preserving the true; the Lower Hall is for concocting the elixir and preparing medicines.”\n\nHe wore a purple kerchief and a quilted cloak, and thrice received the *Lai* hempen robes. As the *Collected Scrolls* notes: “Someone once gifted him a red-silk quilt, which the Master rebuked and returned, saying, ‘Recently, someone presented me with three *Lai* robes from Jin’an—those were excellent.’” The hempen robes were woven with striped patterns: nine stripes on the left, ten on the right, following the method of the Two Radiant Ones.\n\nHis spirit dwelled in serene stillness, his essence roamed the farthest mysteries. Though he wandered alone in the rustling winds, exalted in his solitary truth, letters from kin and old friends, as well as visitors from near and far, continued to arrive—he could not entirely sever such ties. Once, he inscribed a poem on a paulownia leaf and sent it to the Prince of Yidu. Its closing lines read:\n\n*“Would that I were a pair of white wings,\nTo sweep forever the dust before me.”*\n\nSoon after, he dreamed one night that the Prince of Yidu had passed, and would be reborn in two years. The Master asked: *“Where shall you go?”*\n\nThe Prince replied, *“I do not know.”* He then inquired about matters among the spirits and ghosts. With clasped hands, they parted in sorrow. The Master urged him to stay longer, but the Prince said his finger pained him and he could not linger. The next day, the Master sent someone to the capital to make inquiries, only to learn that the Prince had already been murdered.\n\n*The Record of Origins* states: In the eleventh year of Yongming, the Prince of Yidu was appointed Governor of Nanyuzhou and stationed at Gushu. By the end of Yanxing, his fate was not of Heaven’s decree. On the eighteenth day of the eleventh month, the Master suddenly dreamed of the Prince as before. Awakening from sleep, he was struck with grief and astonishment. The following day, he dispatched someone to the capital to inquire, and learned that the Prince had been put to death on the tenth day of that same month.\n\nWhen Emperor Ming ascended the throne, he held the Master in deep admiration, sending frequent summons and offering a grand carriage and lavish gifts to welcome him to reside on Mount Jiang. The Master declined, and the matter was dropped.\n\n*The Record of Origins* states: In the third year of Emperor Ming of Song, officials were sent to insistently invite the Master to reside on Mount Jiang. The Master firmly refused, and through Jiang You’s memorial, the request was withdrawn. Thereafter, messengers came and went several times a month, bearing repeated gifts and offerings, granting whatever he desired.\n\nThe Master, in every matter, restrained and declined. Thereupon, a multi-storied tower was constructed atop the upper residence. At the beginning of the Yongyuan era, he ascended the tower to dwell in prolonged stillness.\n\n*The Record of Origins* states: In the fourth year, a layered tower was built, designed to sever worldly ties. In the first year of Yongyuan, he moved to reside there, abruptly cutting off all contact with the external world. Even the exchange of letters ceased. From then on, he was entirely secluded, with only one or two attendants for morning and evening service. His hidden radiance and concealed brilliance embodied the principle of \"non-action yet nothing left undone.\" The hall where he dwelled was tranquil, with no overgrowth of brambles. Though he had long lamented the distance to water, suddenly a spring gushed forth, lingzhi mushrooms flourished beneath the lower residence, sweet dew blanketed the Bright Terrace, and furred turtles swam in the front pond. White rats appeared in the medicinal hut—all grand omens of his attainment of the true Dao, and auspicious signs of sagely proximity.\n\nThat year, he commanded his disciples Dai Tan, Bing Ce, and Zhi Jian to bestow upon his follower Lu Jingyou of Wu Commandery the governance of Lian Stone Village along with ten *gu*. The world calls these *xi*; immortals call them *sai*. Nine represents the utmost yang, the position of a ruler. Ten signifies the completion of yin, used here as a regulatory measure. Confucius said: \"The Zhou possessed great *sai*, enriching the good.\" Thus, it was named the \"Ten *Sai*.\" The title conferred was \"Reclusive Scholar of Tranquil Abode.\" The text of the document is recorded in full in the collected works.\n\nAt that time, the Eastern Wei ruler failed in his duty, and the lands south of the Yangtze trembled in peril. *The Book of Qi* states: The deposed Emperor Donghun Hou, whose personal name was Baoxu, was cruel and savage upon ascending the throne. No precedent in history matched his atrocities—he disemboweled pregnant women, slaughtered commoners, and ventured out nearly thirty times a month, with no fixed destination, driving his retinue northward in chaotic haste. When he was to depart for the suburbs at dawn, he would drive officials and clerks before him, filling the roads with clamor and shouts. Wherever the sound of drums was heard, people fled in terror. Those who offended him were slain on the spot. Craftsmen and merchants abandoned their trades, and firewood-gatherers dared not tread the paths.\n\nSome abandoned their sick and cast aside the dead, leaving corpses unburied. The myriad people wailed in distress, their suffering exceeding even that of those mired in mud and ashes. When General Xiao Yan of the Eastern Expedition encamped at Stone Citadel, the righteous forces within the Eastern Wei’s Baota City wavered in hesitation. Observing the celestial signs, the Master discerned the turning of the times; gazing upon the hearts of the people, he pitied their suffering in the depths of calamity. Thus, he swiftly presented prophetic omens and sent letters to encourage and commend.\n\n*The Record of Origins* states: The Master had long noted the portents since the Yongyuan era. Upon hearing of the righteous army’s westward advance, he awaited its arrival day and night with eager anticipation. When it reached Xinlin, he immediately composed a missive in praise and dispatched his disciple Dai Mengzhi to deliver it by relay. The journey reached Zaojia Bridge, but the messenger could proceed no further. Later, upon ascending Stone Citadel, the Master sent Li Sigong to present a memorial, which was promptly answered. This occurred on the first day of the eleventh month. Though the imperial court remained heavily fortified, many, mindful of the Cui clan’s downfall, hesitated. The Master, however, remained unwavering, and all matters proceeded in orderly succession.\n\nDuring the investiture and abdication, Fan Yun and Shen Yue rode alongside to assist in the mandate, yet the name of the new dynasty remained undecided. The Master cited Wang Zinian’s *Returning Song*, which repeatedly spoke of \"water cleaving wood,\" and Wang Jun’s *Palindromic Divination*, both of which employed auspicious phrases. He further invoked three poems, all extolling the character *Liang* as the sign of the destined era. Indeed, all the prophetic omens concurred that *Liang* was the symbol of the mandate. When the time came for the proclamation, he again designated the bingyin day of the fourth month.\n\n*The Record of Origins* states: As spring gave way to early summer and the proclamation neared, Shen Yue announced the imperial decree and requested a fixed date. Though the Master had initially proposed a different day, he ultimately settled on the eighth day of the fourth month, bingyin. That evening, rain fell. *The Record of Origins* records: On the night of yichou, clouds gathered and rain drizzled, causing deep concern at court. By dawn, as the Master ascended the altar to kindle the sacred flames and complete the rites of succession, the imperial carriage returned to the palace, accompanied by the jubilant procession of officials. That very night, the rain poured down in torrents. The court sighed in awe, and none doubted the will of Heaven.\n\nAfter Emperor Wu of Liang ascended the throne, his reverence for the Master only deepened. He dispatched Zhu Sizhi and the palace attendant Huang Lu to the mountain with an urgent summons. The Master drew two oxen: one in the wild, content and free, the other adorned in embroidered robes, followed by a man wielding a knife and holding a rope. The Emperor remarked, \"Is this one to learn from the tortoise that drags its tail in the mud? How could such a creature be lured forth?\" He then wrote to the Master: \"Now that the burden of the imperial throne weighs upon me, I wish to become your disciple in earnest. Might this be possible?\" He further inquired about the duration of his reign: \"How long will my allotted span endure?\"\n\nThe Master replied, \"Twice the cycle of the celestial stems.\" Later, he added, \"Emperor Guangwu departed after forty-eight years; now, you shall ascend to seventy-seven before riding upon those white clouds.\" The Emperor reigned for forty-nine years, and all such foreknowledge proved true.\n\nThe Master diligently pursued the supreme Dao, mastering its essential principles with such swiftness that even the ascent of a ladder to the clouds or the reins of a chariot could not surpass it. His skill in medicine was unparalleled. He immersed himself in contemplation, with only cinnabar and orpiment as his gateways. In refining the nine-fold elixir of cinnabar, realgar was the chief ingredient. At that time, the Later Wei and Yuwen Tai were powerful, and the roads to Wudu were blocked, making realgar unattainable.\n\nIn the third year of the Tianjian era, the Master dreamed of someone saying, \"The elixir can still be made.\" That very night, the Emperor also dreamed of a figure who declared, \"With ambition but no tools, how can one act lightly?\" The verse echoed that of Emperor Wu of Han. Only after some time did he awaken to its meaning.\n\nThe imperial messenger, Attendant Huang Lu, informed the Master: \"I surmise that the elixir of the knife-point has yet to be completed, and the three great elixirs remain deficient. It is fitting to speak frankly to a true person of true heart, for there should be no difficulty in doing so.\" The Master initially demurred: \"Would I rather follow the path of Shao Jun?\" The Emperor then revealed to him the purport of his dream, whereupon he commanded his disciples Lu Yichong and Pan Yuanwen to open the eastern slopes of Mount Jijin as a site for transmutation and alchemy, carving stone to channel the mountain stream’s eastward flow.\n\nThe Master observed that among the ranks of elixirs, the many methods—such as the Nine Tripods and Nine Elixirs of the Yellow Emperor, or those recorded in the *Dengzhen Yinjue* (which notes that this formula derives from the *Taiqing Zhongjing* but has undergone alterations and corruptions, rendering it beyond the grasp of later generations)—along with the Nine Flowers of Zuo Ci (as the *Zhen’gao* states: \"Zuo Ci attained the benefits of the furnace fire’s Nine Flowers,\" referring to this), remain obscure in the world. Others, such as the Five Spirits, Seven Transformations, and techniques for summoning the divine essence and calling forth the soul, number nearly thirty varieties, yet these serve only to restore youth and prolong life, achieving no more than earthbound immortality. Some methods are flawed or incomplete, rendering them unreliable. Others are of low rank and limited scope, incapable of attaining lofty transcendence. The elixirs previously listed are all minor techniques of the Taiqing tradition, not the supreme methods of the Shangqing or Great Ultimate. Even the Guardians of the Void and Controllers of the Luminous Essence do not partake of these.\n\nThere are, moreover, two Gold Liquids, though their preparation presents obstacles. As the *Dengzhen Yinjue* records: the first is the Great One’s Gold Liquid, annotated by the *Baopuzi*. This could be achieved were it not for the lack of nitre, and without the true person’s handwritten instructions, its reliability remains uncertain. The second is the Taiqing Gold Liquid, transmitted by Anqi, but it requires brine and refined salt, which are difficult to procure in quantity, and its ritual demands sacrificial vessels, posing further impediments. Among the supreme methods of the loftiest immortals, there are four, yet the four ingredients remain undisclosed.\n\nThough formulas exist in the world, doubts persist of spurious attributions. The *Profound and Weighty* of Langxie, with its annotations in the *Dengzhen Yinjue*, records the scriptures of the Shangqing method. The *Exquisite and Subtle* of Quchen, also preserved in the *Dengzhen Yinjue*, contains the formulas of the Great Ultimate method. These two methods are not only beyond the grasp of lesser adepts, but both further require brine salt and nitre, which are difficult to obtain. Only the minerals and stones used in the Nine Cycles may be readily sought. The structure of its formula is concise, its words neither excessive nor verbose, and its meaning clear and comprehensible—thus one may seal one’s vow and devote oneself wholeheartedly.\n\nThe *Dengzhen Yinjue* states: the Nine-Cycled Divine Elixir, the *Ascending Void Scripture*, was transmitted by the Perfected of the Great Ultimate to Master Changli, who in turn transmitted it to Lord Wang, the Governor of All Perfected of Xicheng. Lord Wang then transmitted it to the Perfected of the Grand Prime. In the fourth year, Master Changli took residence east of the mountain range, entrusting Wang Faming with the care of the Upper Lodge, while Lu Yichong resided in the Lower Lodge, accompanied by Pan Yuanwen, Xu Lingzhen, and Yang Chaoyuan. That year, they tended to the furnace and crucible.\n\nThe following New Year’s Day, the crucible was opened without success. The *Collected Scrolls* states: In the fifth year of Tianjian, on the first day of the first lunar month, the crucible was opened—only the two uppermost yellow essences had lightly sublimated, while the remaining elixir’s verdant edges had just begun to glow crimson. On the Double Ninth, the furnace was relit, but the process repeatedly failed to align. The *Record of Origins* states: On the ninth day of the ninth month, the furnace was rekindled; from the moment the fire was lit, the crucible developed many fine cracks. Moreover, thunder shook the mountains, raising concerns that the essence might be startled and dissipate. Thus, further refinements were made, and the fire was not dared to burn fiercely. When the allotted time expired and the crucible was opened again, there was still no success. The *Record of Origins* states: At the year’s end, the crucible was opened as the deadline arrived, and the lower crucible had cracked.\n\nIn his daily life, the Master maintained a solemn demeanor, as if perpetually in purification. From the moment he began to refine his mind and conduct further alchemy, his vigilance only deepened. When lighting the crucible, he used a yang-burning mirror to kindle fire from the sun at midday—such was the precision of his devotion. By nature, he slept little and never napped during the day. At night, he would often sit until dawn. He was accustomed to reading by moonlight, but by this time, he had been so thoroughly smoked by the fumes. The *Dengzhen Yinjue* states: From the initial firing in the fourth year until the deadline expired, nearly twelve hundred *hu* of husks from Pangu Valley were consumed. At night, the elixir chamber was sealed to prevent the essence from being disturbed by dryness or contact, and thus the billowing smoke can well be imagined. When the fire below made it impossible to see the characters, the Emperor learned of this and sent *bolü* candles. The *Collected Scrolls* states: *Bolü* is the name of a foreign incense; burning it can brighten the eyes.\n\nThe Master believed that such an undertaking was no ordinary matter and required absolute seclusion, far from the noise of the world. Yet this mountain lay perilously close to the imperial court and the bustling market, its groves and forests too shallow and near—everyone spoke of it with expectations, which alchemists strictly forbid. The *Dengzhen Yinjue* states: This matter had become widely known in both court and countryside, with everyone harboring hopes—this was the greatest violation of taboo. Thus, he temporarily changed his surname to Yi and withdrew, journeying far to the east. He considered settling in central Jianjin, where the mountains and seas were vast and remote, and the people, unversed in the Dao, would regard his work as inconsequential, paying it no mind. \"If I were to feign death and depart,\" he thought, \"it would not be impossible—but that would only serve a minor path.\" Feigning death and departing refers to the lower method of *shijie* (corpse liberation), which would prevent him from returning to his homeland and preclude any further refinement of the elixir. Yet if he were to vanish abruptly, it could not serve as a teaching for posterity.\n\nThus, he petitioned Emperor Wu of Liang with his intentions, but the Emperor found it difficult to comply. The *Collected Scrolls* contains the Emperor’s reply, acknowledging his desire to relocate and seek a secluded site, consulting oracles and divination to determine whether the move should be carried out by men or by spirits. Yet even then, the Emperor hesitated, bound to the land, unable to let go. The Master, however, resolved to proceed directly, harboring no further doubts. Only in his heart did he calculate the way forward—no one else was aware.\n\nHaving maintained stillness in his retreat for fifty days, he severed all ties. Then, at midnight, he departed from the mountain—so dark was the sky that no one could see him. With two attendants bearing his belongings, he altered his name and rank to Wang Zhengguan, styling himself \"External Soldier.\" The actions of a Perfected One are beyond the discernment of ordinary minds; these names and titles must surely carry some profound significance.\n\nInitially intending to travel to Kuaiji or perhaps cross to Tiantai, he reached the Zhe River, where the tidal waves were fierce. Thus, he turned upstream to Shuyang and stayed briefly at Changshan. Hearing that the southern route was plagued by maritime raids, he advanced to Chiyan, lodging in a stone chamber by Quxi Stream. There, he dreamed of a voice saying: *\"If you seek the returning elixir, seek it between the Three Yong.\"* Reflecting upon this, he realized it referred to Yongjia, Yongning, and Yongkang. Earlier, when he first established his foundation at Zhuyang, it had been during the reigns of Yongming, Yongtai, and Yongyuan. The dream’s message must point to this very place. Yet if it meant Yongjia, Yongning, and Yongkang, why had his efforts there yielded no fruition? Setting out to investigate, villagers all told him: *\"Beyond this chamber, a hundred li uphill lies Lanzhong Mountain in Yongkang—its peaks are the most secluded and lofty.\"* The next morning, he went to survey the site. The mountain was indeed habitable, though the fields were sparse and gathering husks for fuel would be impossible. The *Collected Scrolls* notes: *\"The locals here must husk rice daily to sustain themselves, leaving no chaff to spare.\"*\n\nLater, he entered Qingzhang Mountain in Nanxi, drawn by its rice fields, and settled there. Yet famine and banditry plagued the land for years, disrupting his plans. The *Collected Scrolls* records: *\"This journey of his met with no fortune. Though he had traversed several coastal commanderies without incident, in recent years, no mountain was free of bandits. He tilled his own fields, only to face years of famine.\"* He then declared: *\"I once read in the* Five Marchmounts Atlas *that Mount Huo is the Bureau of Destiny, surely a dwelling place for immortals.\"* The *Record of Famous Mountains* states: *\"Mount Huo lies in Luojiang County, rising 3,400 zhang, its summit spanning 800 li. Here, the Eastern Minister of Destiny, Lord Mao, resides.\"* Thus, he set out by sea, passing Niucen and emerging at the river mouth. Gazing east toward Fusang, he sighed deeply: *\"As the saying goes, ‘Having seen the sea, all other waters seem small; having met a sage, all other words seem shallow.’ All my life, I have pursued every learning—today, I abandon it all.\"*\n\nMount Huo stretched six or seven hundred li, its peaks shrouded in clouds like ranks of soldiers. Its cliffs were jagged and towering, unlike any other place. The Master’s steps trod upon this sacred ground, his heart fixed upon the Mysterious Pass, and profound spiritual responses arose—yet these matters remain unrecorded. The land was sparsely populated, and again, the lack of husks posed a problem. The *Collected Scrolls* observes: *\"He traversed the region thoroughly, finding nowhere to settle.\"* He then returned by sea to Yongjia, reaching Tailiu, where the terrain seemed most auspicious. The *Hidden Instructions on Ascending Perfection* notes: *\"In the renchen year, sixth month, he sailed back to Yongjia’s Muliu Islet, where ancient fields lay abandoned. The islet stood alone in the sea, uninhabited, yet ideal for refinement.\"*\n\nJust then, the imperial envoy, Minister of Works Huiming, arrived to summon him back to his former mountain. The *Hidden Instructions* records: *\"By the eighth month, he reached Muliu, saw its potential, and began building a hut ashore. In the tenth month, Minister Huiming arrived. The Master wished to remain at Muliu temporarily to discuss matters, but after days of deliberation, Huiming refused. Thus, he accompanied him back.\"* Along the way, bandits were rampant, and the court pressed for the Master to proceed to the capital. Upon reaching Jinling, he pleaded illness and returned to Huayang. The court ordered the construction of Zhuyang Lodge for his residence, but he declined three times. The decree remained firm. The *Hidden Instructions* states: *\"In the jiawu year, he purchased the former residence of Prefect Xu and the Changsha Lodge of the Song, then had Pan Yuanwen and local officials oversee the construction of Zhuyang Lodge. Within the lodge, he built an eastern elixir chamber and a stillness courtyard, claiming to follow the traces of the Mysterious Continent.\"* The *Hidden Instructions* further notes: *\"Long ago, Li Ming refined the Nine-Cauldron Elixir here. Excavating the foundation revealed fragments of old pottery—his former implements.\"*\n\nSince his return from southern Huo, he had repeatedly attempted the cauldron work, but none succeeded. Yet it was not entirely without resemblance: each time he opened the cauldron, frost-like flowers appeared. His disciples believed this signaled success, but the Master, consulting alchemical texts, explained: *\"When the Langgan Elixir is complete, its flying flowers display thirty-seven hues; when the Quchen Elixir is complete, its flying flowers shimmer with a hundred chaotic colors, their radiance flowing and dazzling, dark and profound. When the Great Clarity Golden Liquid Elixir is complete, its flying flowers resemble shooting stars or the moon’s descent, their nine-colored clouds embroidered, their vapor like purple blossoms under the sun, their essence like azure mist in the light. When the Nine-Transmutation Elixir is complete, its flying essence gleams in nine colors, its radiance brilliant—otherwise, it is not yet achieved.\"* Over the years, what he obtained were only light, frosty flowers, their edges sharp as frost or snow, devoid of mixed hues. In the eighteenth year, he produced a substance of stern hardness, its brilliance surpassing previous attempts—yet it resembled only the fifth or sixth stage of flowering, like a sword’s edge or a vulture’s fang. The residue below was dry and black, crumbling like stars, burning with crimson and yellow smoke. The fire’s intensity varied, sometimes weak, sometimes fierce, and the crimson-yellow never ascended to form script.\n\nAt this time, Deng Yu lived on Mount Heng. The *Hidden Instructions* records: *\"A native of Yidu in Yiling, he was brought to the capital by Yang Gongze, Governor of Xiangzhou, in the fourth year of Tianjian. He resided temporarily on Mount Jiang and was later granted the implements for the Nine-Transmutation Elixir, ordered to return to the mountain to refine it.\"* The court provided him with the tools for the Nine-Transmutation Elixir. When the time came to open the cauldron, it contained stalactites, frost, and snow—its radiance dazzling, utterly free of杂色.\n\nDeng did not offer it in tribute but consumed it himself. The *Elixir Canon* states: *\"In the first month of the yiwei year, the cauldron was opened.\"* Above it were stalactites and frost-like snow, while the residue below formed nine layers of purple-black hue. Most who ingested it did so, yet the flying blossoms were given to no one, nor were they offered in tribute. He alone took them to the Southern Cliff to inquire, then concealed them all. Soon after, he fell ill. For eight days, he ailed, and on that evening, the winds and snows of Mount Heng suddenly cleared, revealing a momentary brightness.\n\nThe *Hidden Instructions* records: *\"At first, Master Deng’s complexion remained unchanged, but after three days, he lay still as if in repose, and over time, his body did not decay.\"* The *Elixir Formula* states: *\"When the elixir is complete and free of杂色 radiance, it is a toxic elixir—ingesting it causes a temporary death, from which one revives after a moment.\"* The *Elixir Canon* says: *\"If the elixir’s cycle is incomplete or its color imperfect, it is called a toxic elixir.\"* Thus, the *Great Clarity* warns: *\"Even a single liang, taken all at once, will cause a temporary death.\"* In ancient times, Wei Boyang and his disciples compounded an elixir, and one who consumed it died. The others departed, and upon their return, he had already gone. The Master harbored the heart of one who rides clouds and mounts dragons.\n\nHe once said: *\"At the age of twelve, while perusing the scriptures in the archives, I chanced upon a text copied on yellow silk by a certain Jun Xi, detailing the various elixir methods of the Great Clarity. From that moment, my resolve was firmly set.\"* When he reached eighteen, he received the supreme Dao and beheld the methods of the Supreme Clarity and Great Ultimate. He then scorned them and did not practice, so why would he now consume a toxic elixir to escape? All he had accumulated over the years, he buried and concealed.\n\nYet after eighteen years, though the flying blossoms bore no杂色, their radiance was extraordinary. He wished to test them by transmuting base metals into gold and silver to verify their efficacy. The *Elixir Canon* states: *\"Take ten jin of lead, place it in an iron vessel, and heat it fiercely until it boils thrice. Then add one zhu of the transmuting blossom to the lead and stir—immediately, it will become gold.\"* That evening, as he focused his mind in prayerful entreaty, he suddenly saw someone approach, shrouded as if in mist and clouds, who spoke: *\"Do not test it. Even if you do, you will not succeed. People today are too greedy—the moment they hear of gold and jade, they seek to make them, violating heavenly prohibitions. This is indeed a success, but it is not yet complete.\"* The figure then sighed and said: *\"Are there still those in the world who ascend to heaven in broad daylight?\"* Gradually, he added: *\"You will know through your own ingestion.\"* With these words, the figure vanished like a gust of wind. Thereafter, the Master did not attempt the test.\n\nThe Master often said: *\"The day of my departure will be like Mao Taiyuan’s departure from Xianyang.\"* The *Biography of the Perfected of Great Primordial* records: *\"When the Perfected departed from Xianyang, he arranged to meet his relatives and fellow villagers on that day. Precious feasts and wondrous music descended from the empty sky, and he then ascended with a thousand chariots and ten thousand riders, visible to all in the south.\"* And like Zhao Guangxin’s ascent at White Cliff. Ge Zhichuan’s *Biographies of Divine Transcendents* states: *\"Zhao Guangxin ascended to heaven in broad daylight at White Cliff Mountain in Kuaiji.\"* He wished to awaken the deluded and leave his name forever in the bamboo annals. Yet he lamented: *\"From the beginning, I feared that fate might be unkind and my aspirations unfulfilled.\"* At last, he sighed and said: *\"I once heard a secret teaching that there are nine obstacles to transcendence, and my name is among them. If I do not ascend at dawn in broad daylight, is it because my reputation in the mortal world still lingers?\"*\n\nThe Southern Perfected, the Venerable One, did not ascend lightly—for the Southern Perfected is the Lady Wei, Purple Void Primordial, who dissolved her form at midnight. As for the minor karmic ties, Xiao Miao’s transformation was also a dissolution. Xiao Ju, the son of Director Xu Yufu, transformed only after paying homage. The old path of the Mystic Master is truly one to be revered and followed.\n\nIn the fifth year of Putong, he again applied cinnabar to the cauldron and kindled the fire. On New Year’s Day of the following year, the jiazi day, the cauldron was opened. Its black radiance illuminated all, startling the heart and dazzling the eyes. The substance resembled the earlier one but was adorned with rainbow杂色. From the fourth year of Tianjian, when he first set his mind to this, until now, he had refined it seven times before it was complete.\n\nEarlier, the Minister of Personnel, Xie Lan, dreamed that someone told him: *\"The Master of Huayang has attained the Dao. Soon, his office will be to oversee the registers of immortals.\"* Not long after, a female relative named Qian, who also dwelled in Huayang, became the Master’s disciple, receiving scriptures and talismans. One day, she suddenly took leave. The Master asked where she was going, and Qian replied: *\"To become an honored guest in the Golden Towers.\"* The Master said: *\"Several of my disciples have already preceded me.\"* Qian said: *\"You will be the Supervisor of Waters for Penglai.\"* The Master then crossed the ridge to see her off and presented her with a poem.\n\nIn his later years, the Master’s pupils suddenly became square.\n\n*The Record of Master Zhou of Ziyang* states: The Master once encountered Huang Tai in the marketplace and, seeing his square pupils, knew him to be an immortal. He thus sought the transmission of the arts of longevity, whereupon Huang revealed himself as Lord Su of the Upper Realm of Xuanzhou. Some say that those with square pupils live ten thousand years. His gaze and voice were accompanied by strange and wondrous radiance. His literary style and bearing grew ever more refined and transcendent. Though he dwelt in a tower, even his disciples were forbidden to peer inside. He lived in the world for eighty-one years and departed this life on the twelfth day of the third month, the *guichou* day, in the second year of Datong of the Liang (536 CE). That morning, he composed a farewell address to announce his passing, which he presented to his disciples—the text is preserved in the collected works. At the *si* hour, he departed in perfect serenity, his limbs supple, his complexion unchanged, while rare fragrances and numinous vapors filled the mountains and valleys. When his disciples prepared to enshroud him, they found only his empty robes. In the initial stages of his transformation, his body appeared intact, but before long, only his cap, sword, and empty garments remained. On the fourteenth day, his empty coffin was interred at Leiping Mountain. Emperor Wu of Liang posthumously honored him as *Master of Integrity and Purity*. The Master designated his nephew Songqiao as his heir, who continued to reside in Huayang.\n\nWorks composed by the Master during his lifetime:\n- *The Flower of Learning* (100 juan)\n- *Prefaces and Commentaries on the Classic of Filial Piety and the Analects* (12 juan)\n- *Preface to the Three Ritual Classics* (1 juan)\n- *Preface to the Shangshu and Mao’s Poetry* (1 juan)\n- *Inner and Outer Collections of Filial Sons* (4 juan)\n- *Records of the Jade Casket* (3 juan)\n- *Eulogies on the Records of the Three Kingdoms* (1 juan)\n- *Commentary on the Baopuzi* (20 juan)\n- *Omissions in the Tales of the World* (2 juan)\n- *Records of Ancient and Modern Provinces and Commanderies* (3 juan)\n- *Continuation of the Anecdotes of Prince Kang of Linchuan* (2 juan)\n- *Brief Commentaries on the Books of the Grand Duke, Sun, and Wu* (2 juan)\n- *Essentials of Etiquette* (3 juan)\n- *New and Old Methods of the Seven Luminaries* (2 juan)\n- *Essentials for Divining Wind, Rain, Drought, Famine, and Pestilence* (1 juan)\n- *Essentials of Divination* (1 juan)\n- *Mysteries of the Numinous and Wondrous* (1 juan)\n- *Calendar of Auspicious and Inauspicious Days for All Affairs* (1 juan)\n- *Miscellaneous Arts of Calculation* (1 juan)\n*(Total: 166 juan)*\n\nWorks composed by the Master in the mountains:\n- *Hidden Instructions for Ascending to Perfection* (24 juan)\n- *True Writs and Embryonic Essentials* (10 juan)\n- *Commentary on the Classic of Materia Medica* (7 juan)\n- *One Hundred and One Emergency Remedies* (3 juan)\n- *Book of Dreams* (1 juan)\n- *Tested and Effective Prescriptions* (5 juan)\n- *Collected Methods for Golden Elixirs and Transmuting Cinnabar* (1 juan)\n- *Methods for Ingesting Mica and Various Stones* (1 juan)\n- *Methods for Ingesting Herbs and Miscellaneous Medicinals* (1 juan)\n- *Secret Methods for Abstaining from Grains* (1 juan)\n- *Essential Methods for Eliminating the Three Worms* (1 juan)\n- *Methods for Ingesting Qi and Guiding the Body* (1 juan)\n- *Methods for Averting Disasters Among Humans* (1 juan)\n*(Total: 57 juan)*\n\nDuring the Qi and Liang dynasties, hundreds of marquises, kings, dukes, and high ministers sought to study under the Master, yet he rejected them all. Only Xu Mian, Jiang You, Qiu Chi, Fan Yun, Jiang Yan, Ren Fang, Xiao Ziyun, Shen Yue, Xie Lun, Xie Lan, and Xie Ju—those who had early in life offered him the homage due a master—continued to receive his guidance even after his retreat from the world. Once, when Shen Yue fell ill, he resolved to resign his office and withdraw from public life. Upon recovering, however, he lingered on in his official post. The Master sent him a letter to rekindle his resolve, to which Shen replied: \"My superiors have not granted my request to retire.\" The Master sighed and said, \"This man is truly shallow and insubstantial. Those who delight in bells and tripods regard mountain valleys as places of exile, while those who cherish forests and streams see caps and sashes as fetters and shackles. If one probes to the subtleties, it is clear that bells and tripods cannot compare to mountain valleys. To cringe on the path of honor and disgrace, to tread within the snares of the world—how can this be mentioned in the same breath as roaming freely through groves and marshes, chewing on magic herbs and trees? Even with Shen Xiwen’s exalted rank, the Master still deemed him shallow, for he knew the true value of the\n\nThe *Collected Works of the Master of Creeping Vines*, compiled by Jia Song of the Young Scholar’s Studio\n\n**Imperial Edict of Enfeoffment from the Xuanhe Reign of the Song Dynasty**\n\nWe, having received the radiant mandate of the Jade Empyrean and grasped the sacred talisman of the Dragon Han, shall now propagate the numinous decree, exalt the transformative power of the Dao, elucidate the profound teachings of the subtlest doctrines, and extend felicitous destiny to the ranks of the perfected. The Overseer of Waters of Penglai, Tao Hongjing, has long adorned the frontier with his honorable silken robes, his essence refined at the gate of splendor. Though his spirit communes without entanglement, and though he dwells near in the mountains, his sincerity has long since resonated in the unseen, and his poetic gifts have already rendered him immortal upon the seas. How could one, gazing upon his virtue and renown, dare forget the sublime devotion that binds him? Thus, to bestow upon him the glory of a resplendent title and to perpetually bless his life with celestial grace, he shall be specially enfeoffed as **Zongyuan Lingjiao Perfected Realized One**.\n\n---\n\n**Inscription on the Stele of the Unbinding of the Realized One**\n*Composed by Xiao Lun, Prince of Shaoling*\n\nFor luminous jades and lustrous greens are not the common treasures of fat-laden baskets, just as soaring wings and leaping scales are not the mere playthings of garden ponds. How could one confine the heart to the narrow and the near, when it knows not the reason for its own boundlessness? Thus did the lofty hermit of Yingyang wash his ears in the Tang court’s stream, and thus did the steadfast recluse of Hanyin erase his traces in the Zhou era. The noble virtue and flowing influence of such men have long had their origins. And he who answers the call of the times to manifest his essence—is he not here before us?\n\nThe Master’s name was Hongjing, his courtesy name Tongming. He was originally from Pingyang in Jizhou. His ancestors descended from Emperor Yao of the Taotang clan; when Yao governed Pingyang in Jizhou, his lineage settled there. The dragon-horse appeared bearing the five-colored talisman, and the radiance of reverence displayed the eight auspicious hues. His light illumined all under heaven, and his just governance extended to every office. The wellspring of his lineage was vast and far-reaching, its threads long and unbroken.\n\nWhen the Han arose, his forebear served as the Right Marshal to Emperor Gaozu. His son, Qingdi, rose to the position of Chancellor. During the late Han, the family crossed south and first settled in Danyang. His seventh-generation ancestor, Jun, served the Wu kingdom as General Who Pacifies the South and Governor of Kezhou. His grandfather, Long, was a Military Advisor to the Southern Commandery under the Song. His father, Zhenbao, was Gentleman of the Palace to the Prince of Jian’an, both men of pure and frugal conduct, widely learned in literature and history.\n\nThe Master embodied the harmonious qi of primordial essence, nurturing a refined and profound nature. He encompassed the seven virtues and cultivated the nine powers, practicing benevolence and treading the path of righteousness. Like a mountain, he stood firm; like an abyss, he remained still. His towering integrity could not be glimpsed, his purity and depth could not be fathomed. His Daoist aura soared as high as the Milky Way, his transcendent spirit stretched as far as mist and clouds.\n\nAt six, he could read and compose essays. At seven, he recited tens of thousands of words from the *Classic of Filial Piety*, the *Mao Odes*, and the *Analects*. Even the young Yan Zhuang, who studied the ancient canons, or Liu Zhen, who read poetry and rhapsodies in his youth, pale in comparison to him. Thus did his reputation spread like the echoes of Qixi, and thus did the Yellow Emperor’s hymns find voice in him.\n\nA villager once obtained Ge Hong’s *Biographies of Divine Transcendents* and showed him the tales of the Eight Immortals of Huainan. He sighed and said, “Reading this book fills one with the spirit of soaring clouds.” From then on, he recited it day and night without cease.\n\nAt twenty-seven, he became the Literary Companion to the Prince of Yidu, overseeing all matters of record.\n\nThe court sought the Dao and pursued worthies, while the imperial forest summoned scholars—though the age made selection difficult, all agreed the right man had been found. Could Ruan Ji’s literary records prop Rang’s balance? How might Sun Chu’s rhetorical talents support the chariot’s hub? In the Qi era, the court favored palace construction, and as the old gardens of Green Creek were renovated and new halls erected, he submitted memorials and composed eulogies, his words and matters both surpassing excellence. His *Ode to the Joyful Office* outshone its predecessors, and his *Rhapsody on the Auspicious Blessing* clarified the imperial edict. The emperor perused them at length, praising them ever more, and appointed him Gentleman Attendant at Court.\n\nIn office, he was diligent day and night, observing the spring audiences and autumn petitions—such was the discipline of cangues and flogging. Yet the master had never sought glory; he often wished to resign, writing to kin and friends: “My long-held desire was to avoid the world of men. By forty, I would have fulfilled my resolve in the mountains and marshes. Now I am thirty-six, and time does not wait—does one not know the divine subtleties of the moment? To endure hardship for oneself is bitter indeed.” The following year, he submitted a memorial to resign, withdrawing his hairpin beyond the capital’s gates and untying his sash at the northern slopes of the mountains. Like Jiqu’s reclusive dwelling or the Marquis of Liu’s grain-abstinence, he emulated the ancients in transcending his age. Boarding his boat, he set forth eastward. The court bestowed inquiries, and eminent men saw him off. Compared to the two Fus, he embodied the four recluses, rising lightly as if across eras.\n\nStaff in hand, he journeyed afar, traversing famous peaks. Arriving at Jurong, he ascended Mao Ridge. Seeing this place as the palace of divine transcendents and the abode of numinous marvels, he never looked back and chose to dwell there. The master said: “The Master once said, ‘Live in reclusion to seek one’s resolve; practice righteousness to fulfill the Dao.’ I have heard these words but never seen such a person. Now that my righteousness is fulfilled, I no longer seek direction—let me join the pursuit of resolve.” Thus he called himself a recluse, like Ge Hong embracing simplicity or Huangfu Mi’s *Xuan Yan*. Leaning on cliffs and casting his shadow, he concealed his traces among the forests. Branches intertwined to form his hut, and he carved a path for his gate. Overhanging cliffs faced cascading streams, and the wind sighed through the trees. Deep ravines and sheer ridges wove mist and clouds. Pillowing on stone and rinsing his mouth with flowing water, mountain birds did not disturb him; gathering herbs, he met wild beasts that did not scatter. Carefree and unburdened, he roamed the hills. Serene as if lost, steadfast and unshakable.\n\nAs the Qi dynasty neared its end, Heaven’s mandate faltered. The southern lands and Luoyang valleys trembled in the *jiachen* year’s earthquake. The master, meditating on hidden patterns, foresaw its omens. Thus, he severed all correspondence near and far. What was once heard of Xia Fu was now witnessed in the master. When our Great Liang’s prosperous destiny arrived on schedule, receiving Heaven’s bright mandate, the Three Luminaries shone clearly, and the Four Seas grew tranquil. The master submitted a memorial in celebration, and thus trust and inquiries resumed.\n\nSince the *Tianjian* era, imperial decrees had often been issued, providing medicines and supplies without fail through the seasons. Such profound grace and favor were unmatched. After seven years, he briefly visited the Southern Marchmount. This mountain was the axis where the winds of fame gathered, the celestial pillar like Kunlun’s heavenly bastion. The Eight Pillars stood nearby, and the Nine Pure Ones were arrayed around it. Trees bore jade-like leaves, and grasses grew like chariots and cavalry. Leaving the world behind, he forgot to return.\n\nIn the eleventh year, an imperial edict dispatched the Left Minister Huiming to summon the master back to Mount Mao, granting him a separate residence. Even the descent of the Lord of the Gourd to the Celestial Elder or the Han emperor’s courtesies to the Old Man of the River could not surpass this day’s honor. Nurturing his resolve in the mountain’s embrace for many years, he cultivated life well, and numinous blessings descended. Fierce beasts did not lurk, and demons did not appear. His courtyard was free of brambles, much like Confucius’s neighborhood. Steps flowed with sacred springs, and nearby trees flourished. Then feathered transcendents wandered about, immortals ascended and descended, phoenixes and simurghs gathered, and magic mushrooms grew lush.\n\nIn the second year of *Datong*, the cyclical year *bingchen*, on the twelfth day of the third month (a *guichou* day), he departed this life at the age of eighty-one. The Son of Heaven mourned, and the Crown Prince grieved. An edict praised his virtues, posthumously appointing him Grand Master for Palace Attendants and conferring the posthumous title *Master of Integrity and Purity*. Such was the ritual.\n\nOn the fourteenth day of the same month, he was interred at Leiping Mountain in Jurong County, Danyang Commandery—like the Yellow Emperor’s burial of his robes and cap or Wangzi Qiao’s concealment of his sword in the crow, this day matched those precedents. The master’s bearing was profound and composed, his thoughts refined and rich. He embodied hidden virtue and upright fortune, yet did not cultivate mere propriety. Nearing middle age, he was no square confined by its rules. His brows and eyes were clear, his appearance fresh and pure. He neither forgot encouragement nor discouraged others, often practicing kindness and favor. He treasured time and loved ancient texts. His resolve was steadfast, his integrity enduring to white-haired age.\n\nAs for the *Hongbao* secrets of Huainan, the seismograph of Longxi, the *Taiyi Dunjia* texts, the *Nine Chapters* of calendrical calculations, the swift brushwork of Kong Rong, the marvelous *Fengjiao* divination of Zihua, the *Suwen* formulas of the Grand Granary, and the *Qin Cao* melodies of the Central Dispersed Master—he sought them all and mastered each. Even Yi’s archery, Xun’s *Fen* divination, Su’s oracle bones, and Guan’s milfoil—he grasped them at a glance without effort. Zhang Hua’s encyclopedic knowledge, Ma Jun’s ingenuity, Liu Xiang’s subtlety, and Ge Hong’s life-nurturing arts—he combined the talents of these worthies in one person.\n\nHis disciples, including Huan Famin, admired the distant winds of the Hou clan and cherished the lingering thoughts of Qiao Yang. They carved a dark stele to record his essence, spreading his fragrant reputation through the crimson clouds. Thus an inscription was composed:\n\nThe crow’s departure marks transformation,\nThe abandoned sword congeals spirit.\nWandering the purple empyrean,\nIlluminating the cinnabar groves.\nHis traces remain,\nHis winds may yet be followed.\nWho shall inherit this profound legacy?\n\nA man of virtue, his conduct surpasses all,\nHis great power renews daily.\nBright as a hanging mirror,\nLush as pure bamboo.\nHis person embodies the Dao,\nHis actions never stray from benevolence.\nOnce he roamed the court,\nAdorning the girdles of officials.\nWeary of governance,\nLaboring to guide the lost.\nHaving untied his sash,\nHe donned a mountain kerchief.\nFar he sought valleys and peaks,\nLoftily transcending the dust.\nHis heart held no worldly ties,\nHis reclusion did not sever truth.\n\nAmidst towering cliffs he built his abode,\nIn verdant grasses made his steadfast retreat.\nLike ice and jade, his years endured,\nHis essence preserved, defying age’s blight.\n\nThus arose his noble renown—\nA life of vigor, longevity, and ease.\nWhite waters flowed past his courtyard,\nSteep peaks loomed o’er the ravine.\nDew adorned the orchid steps,\nClouds wreathed the cassia beams.\nAs the sun slanted o’er the bamboo mat,\nBlossoms drifted past the window jar.\nShang Ping never returned,\nThe noble scion tarried not.\nSeas and mulberries shift their bounds,\nHills and valleys alter their form.\nYet this sturdy stele stands firm,\nHis fragrant legacy enduring ten thousand years.\n\n**Inscription on the Reverse of the Stele**\nBy Sima Daoyin Zimiao of Huanè, White Cloud Daoist of Huafeng, Tiantai\n\nGreat is the Dao’s origin—\nThe myriad spirits draw sustenance from its womb.\nIts spontaneity is elusive, unfathomable;\nIts generation and completion, veiled yet discernible in misty qi.\n\nAs for those who study scriptures and methods,\nWho refine their thoughts to stir profound resonance,\nWho harmonize and transmute the elixir,\nRefining body and spirit into unity—\nThough they may ascend the Three Clarities,\nFew since antiquity have attained perfection.\nYet one who gathers and embodies these,\nWho discerns and distinguishes them,\nWho dwells in stillness,\nWho practices with diligence—\nWas he not the Venerable Zhenbai?\n\nBorn with numinous qi,\nHe dreamed of a dragon’s ascent while still in the womb.\nHis bearing was noble, his spirit radiant,\nHis bone-record marked with the crane-immortal’s sign.\nHis mind was a luminous mirror,\nPenetrating all without omission.\nHis vessel was like a great bell,\nReceptive and responsive in its emptiness.\n\nThus the celestial scriptures’ true transmissions\nWere fully gathered at Zhaotai;\nArcane meanings and subtle words\nWere all entrusted to his numinous mind.\nHe compiled and categorized texts,\nExpanding them into comprehensive works.\nHe amplified the phoenix-script of golden writ,\nEnriched the dragon-seals of jade tablets,\nRevealed hidden mysteries of the past,\nDispelled ignorance in later learners.\nAs a teacher to the host of perfected,\nHe became a guiding light for a hundred generations.\n\nBeholding his painted likeness,\nThe Dao is present at a glance;\nPerusing his writings,\nHis spirit shines through the words.\nThough a thousand years may pass,\nHis essence may yet be grasped in a single morning.\n\nAs for the marvels of mystical resonance in meditation,\nThe safeguards of refining form and transcending mortality—\nThese I do not know,\nFor their principles defy detailed recounting.\n\nYet in cultivating his person and virtuous deeds,\nHe mastered the full spectrum of Daoist arts.\nBy the standards of the celestial ranks,\nHe far surpassed the true stages.\nThough his destiny followed a singular path,\nHis manifest and hidden ways diverged.\nHe responded to the dissolution of shadows,\nNever striving for dawn’s ascent.\nMysteriously ascending to the Upper Clarity,\nHis course remains beyond all measure.\n\nYet as he vanished like clouds at his desk,\nHis reed chamber still stands;\nHis sword of transcendence has not yet flown,\nThe hidden mound remains sealed.\nRevered in Dao, noble in virtue,\nHis legacy endures through all ages.\nThough we may seek his form through his writings,\nHe is no longer visible today.\nDynasties have changed in succession,\nMountains and eras have grown estranged.\nEver cherishing his immortal spirit,\nWe are moved to profound lament.\n\nAs Zimiao prepared to journey to Mount Heng,\nHe briefly sojourned at Maoshan,\nWhere he gathered with fellow practitioners of the Dao.\nShaoling composed a eulogy in his honor,\nAnd now I inscribe these words to preserve his deeds.\nThus I wield my clumsy brush,\nBriefly recounting the true path,\nRecording it on the stele’s reverse,\nTo illuminate the age for posterity.\n\nWritten on the thirteenth day of the ninth month, the year *jiazi* of the *Kaiyuan* reign, the twentieth year of the Great Tang.\n\n---\n\n**Epitaph**\nComposed by Prince Zhaoming of Liang\n\nIn the second year of *Datong*, the year of *jingshen* in the cyclical calendar,\nIn the third month, the twelfth day after the new moon of *renyin*,\nAt the hour of *sichou*,\nMaster Tao of Huayang Cave shed his cicada-shell at Zhuyang Lodge on Maoshan.\nThe Master’s personal name was Hongjing, his courtesy name Tongming,\nAnd he lived eighty-one years.\nHis limbs remained supple, his complexion unchanged.\nBy imperial decree, he was posthumously appointed *Zhongsan Dafu*,\nAnd granted the posthumous title *Zhenbai Xiansheng*.\nA court emissary was dispatched to oversee the funeral rites.\nOn the fourteenth day, at the hour of *sichou*,\nHe was interred at Mount Leiping.\n\nFor the true Dao, returning to emptiness is beauty;\nThe Way finds its truth in boundlessness.\nUnattached to life, he embodied great virtue;\nUnfearing of death, his valley spirit never perished.\nWondrous indeed—\nHis transformations between concealment and revelation,\nBeyond all mortal comprehension.\n\nThen the mountain cleft parted,\nA jade coffin descended from the heavens.\nSilver script ceased its whispering,\nFlowing pearls stilled their glow.\nA nine-jointed turtle gleamed in the sky,\nA thousand harmonies burned beneath the earth.\nThe immortals rejoiced in finding a companion,\nWhile his disciples mourned in the empty valleys.\n\nI once dwelt in the dust of the world,\nEarly encountering the arts of the ruined wall;\nNow, as tutor to the crown prince,\nI have repeatedly received the teachings of Fuqiu.\nClutching the talisman of his departure, I grieve;\nLonging for his transformed staff, I ache with sorrow.\nThus I compose this inscription:\n\nThe Dao without name,\nThe immortal who does not die—\nThere were Yuanfang of old,\nAnd Zichuan who shared his renown.\nEscaping form, dissolving transformation,\nSuch has ever been the way.\nHow splendid was the Master—\nEnrolled among the immortals, he returned to the origin.\nHis pear-like writings were passed by a hidden scribe,\nHis books conveyed by a merchant’s vessel.\nHis tiger chariot illumined the shadows,\nHis cast-off shell brushed the clouds.\nThe lingering blossoms gleam in the spring ravine,\nThe murmuring streams flow lushly through Maoling.\nOh, the boundless grotto-heaven—\nWhen shall the three white cranes return?\n\n---\n\n**Shen Yue’s Response to Master Huayang**\n\nThe Three Clarities may not be coveted,\nYet one realm still endures in emptiness.\nI wish only to turn back the light,\nTo rescue the imperiled and redeem the lost.\nIf granted the gift of the nine elixirs,\nWhat fear would I have of the six dragons’ flight?\nLong have I desired to seek the famed mountains,\nBut must wait until my children’s marriages are complete.\nThough these two matters are now settled,\nCountless others remain unresolved.\nSuddenly I hear the dragon chart has arrived,\nAnd see the dragon’s radiance overflowing.\nAt dawn, the Eight Primes open the earth,\nAnd a thousand households compose their odes.\nNever once has he shown his cap or tassels,\nNor combed his hair through wind and rain.\nThe jade chime resounds at the grotto gate,\nThe golden cicada gleams in the morning sun.\nThough no petty man repays his kindness,\nI have presumptuously received the rank of prefect.\nHow could I forget my lifelong aspirations?\nYet with no leisure to attend to them, I am filled with remorse.\nI have heard the superior man say\nThat a single *chi* of wood can soar to the heavens.\nCloud carriages do not touch the earth,\nAnd the immortal’s abode is rich with kindling.\nHe awaits the blossoming of the three sacred fungi,\nSitting as a hundred spirits pay homage.\nHis letters are borne by blue crows,\nHis honored guests arrive on dragon bridles.\nNot only do the divine peaches bear fruit,\nBut the great pillars of the earth wither.\nFeasting on jade, he halts the march of years,\nSwallowing auroras, he restores his youthful visage.\nDimly I recognize the trees of Qingqiu,\nAnd once more behold the sun of Fusang.\nResplendent, the shimmering mirage unfurls,\nTowering, the mountains and seas emerge.\n\n---\n\n**Su Chang of Houlu’s Eulogy for Master Tao’s Portrait**\n\nThe marvelous words of the alchemical pearl\nIlluminate the pages of his writings.\n\nAmid the haze of the three halls, his person recedes into the distance.\nAs the age declines and the Dao is lost, those who preserve their integrity are few.\nHis lament at life’s end became a *he* and *bian* for the world.\nHere concludes the second scroll of *The Inner Biography of Master Tao of Huayang*.\n\n#1 [Note: \"母\" likely a scribal error for \"毋.\"]",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "华阳陶隐居内传 经名：华阳陶隐居内传。 三卷。 唐代贾嵩撰。 底本出处：《正统道藏》洞真部记传类。 华阳陶隐居传序 薜萝孺子贾嵩撰 或日：贞白先生在《梁书· 高士传》，今而为传，何谓？ 《梁书》云：陶君讳弘景，字通明，丹阳秣陵人也。 母梦两天人手执香炉云云。 齐高作相，引为诸王侍读。 虽在朱门，不交外物。 永明十年脱朝服挂神虎门，上表辞禄。 韶许之。 公卿送之征虏亭，供帐甚盛，咸云江束以来未有斯事。 於是历名山寻诧仙药。 每经涧谷，必坐卧其问。 特爱松风，庭院皆植。 及梁武即位，书问不绝，月常信数。 时人谓为山中宰相。 大同二年卒，时年八十五，颜色不变，屈伸如常云云。 今具此传於注者，盖明其简略也。 此又兼郑障、史隽《陶传》同录於此。 曰：《梁书》之传先生，犹《史记》之述老氏也。 其叔事颇删略，俾仙圣行业不得昭着而纷纶其问。 韩非与老子同传，论之者多矣。 而《 梁书》 列先生在沈麟、阮孝绪、范元淡，马之问矣。 夫先生识洞古今，事炳山世，神栖寂泊，精骛玄枢，定三品以黜浮伪，分五域以镜区贯，着《隐诀》以析纲目，述《真诰》以旌降授。 激扬隐微之外，驰骋清虚之际，乃玄中之董狐，道家之尼父也。 况发挥坟典，游泳百家，穷天地星辰之文，究阴阳龟筮之术，至於鲸死彗出，麟国月蚀，铜山崩而钟铎响，蚕洱丝而商弦绝，龙昤云起，虎啸风生，此性理冥蒙，会谓之感，先生商榷其微，非感非应。 夫然将叔向、子产、京房、郭璞拟先生以为人博乎？ 齐永明十年，谢詹事沦自昊兴闻先生弃官隐华阳，乃於道中作《传》。 谢詹事作《传》云：先生讳弘景，丹阳人也。 幼标异操，听明多识，五经子史皆悉详究。 善书，得古今法。",
      "translated_text": "**The Inner Biography of Master Tao of Huayang**\n\n**Text Title:** *The Inner Biography of Master Tao of Huayang*\n**Three fascicles.** Compiled by Jia Song of the Tang dynasty.\n**Source:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Biographies and Accounts* Category.\n\n---\n\n**Preface to the Biography of Master Tao of Huayang**\n*By Jia Song, the Hermit of Creeping Vines*\n\nSome ask: Master Zhenbai (Tao Hongjing) already appears in *The Book of Liang* under *Biographies of Eminent Recluses*. Why compile another biography now?\n\n*The Book of Liang* states: \"Master Tao’s personal name was Hongjing, styled Tongming, a native of Moling in Danyang. His mother dreamed of two celestial beings holding incense burners, and so forth. When Emperor Gao of Qi became regent, he was appointed tutor to the imperial princes. Though dwelling within the vermilion gates, he remained aloof from worldly affairs. In the tenth year of *Yongming*, he doffed his court robes at the Gate of the Divine Tiger and submitted a memorial resigning his stipend. The imperial edict granted his request. The court officials saw him off at the Pavilion of the Conquered Barbarians, where the banquet was most lavish—none since the lands east of the Yangtze had seen its like. Thereafter, he wandered through famous mountains in search of transcendent herbs. Whenever he passed through valleys and ravines, he would sit or lie among them. He was especially fond of the wind in the pines and planted them throughout his courtyard. When Emperor Wu of Liang ascended the throne, he exchanged letters with the master without cease, sending messengers several times a month. The people of the time called him ‘the Prime Minister in the Mountains.’ He passed away in the second year of *Datong* at the age of eighty-five. His complexion remained unchanged, and his limbs retained their flexibility, and so forth.\"\n\nThe reason for compiling this biography in full is to clarify what was too brief in the earlier account. Here, I have also included the biographies by Zheng Zhang and Shi Jun, collating them together.\n\nIt may be said: The biography of the master in *The Book of Liang* is like the *Records of the Historian*’s account of the Old Master (Laozi). Its brevity omits much, leaving the deeds of the immortal sage obscure and tangled. Han Fei was recorded alongside Laozi, and many have debated this pairing. Yet *The Book of Liang* places the master among Shen Lin, Ruan Xiaoxu, Fan Yuandan, and Ma—what a disparity!\n\nThe master’s knowledge penetrated past and present; his undertakings illuminated the world. His spirit dwelled in stillness, his essence roamed the mysterious pivot. He established the three ranks to purge falsity, divided the five regions to mirror the threads of destiny, composed the *Secret Instructions* to elucidate the essentials, and expounded the *True Admonitions* to honor celestial transmissions. Beyond the subtle and obscure, he soared through the realm of purity and emptiness—truly the Dong Hu of the Daoist tradition, the Confucius of the Way.\n\nMoreover, he expounded the ancient classics, immersed himself in the hundred schools, plumbed the patterns of heaven and earth and the stars, and mastered the arts of yin-yang and tortoise-shell divination. When comets appeared after the death of whales, when the moon was eclipsed in the land of unicorns, when bronze mountains collapsed and bells tolled in response, when silkworms spun their threads and the strings of the *shang* note snapped, when dragons sang and clouds arose, when tigers roared and winds stirred—these were the mysterious workings of nature, commonly called \"resonance.\" The master analyzed their subtleties, showing they were neither resonance nor mere coincidence.\n\nCould Shu Xiang, Zichan, Jing Fang, or Guo Pu compare to the master’s breadth of learning?\n\nIn the tenth year of *Yongming* of Qi, Minister Xie Lun of Wuxing heard that the master had resigned his post to retire at Huayang. On the road, he composed a *Biography*. Minister Xie’s *Biography* states: \"The master’s personal name was Hongjing, a native of Danyang. From childhood, he displayed exceptional conduct, keen perception, and vast knowledge. He thoroughly studied the Five Classics, the philosophers, and the histories. Skilled in calligraphy, he mastered the methods of past and present.\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 672,
      "start_sentence": 0,
      "end_sentence": 34,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.870057821273804,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\华阳陶隐君内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "在人问便有乘云御龙之志，不肯婚官。 以资营未立，且薄游下位，为宜都王侍读。 虽处朱门，但独居一室，罕接外物。 昼夜寻写、研集奇奥，二十余年，稍就服食。 殆通幽洞微，其事多秘，於是业用渐进，乃拂、衣，止於茅山焉。 观其神仪明秀，吗睐有光，形细长．' 项，耳问娇睐，显然异众矣。 谢《传》讫此。 此《传》 并《梁书》弥为脱略。 吾不解谢沦既闻先生隐山，甚怀嗟赏！ 乃圻然道中作《传》，所宜详究功行，而卒然如此也。 陶斓乃云：王右军作许先生传者，正如此也。 《传》疏略不用，陶栩乃作本起录。 至齐末遂已亦事多遗阙。 斓先生，犹子也。 本起录乃粗似详究，而患文气太卑，叔述繁杂。 自云：今此未便为传，且撰行业以备遗失耳。 不知何绿至永元元年遂绝也。 其后潘泉文复踵其作，泉文，先生门人也。 自云：陶斓本起录讫於齐末，从此已后二十余年并未有题记，谨且随年载录，后撰《传》人自更详述。 始天监元年，至七年夏四月。 于时先生改名氏，潜访遐岳，天监七年夏四月先生改名南游，其事具於《传》中。 旁无知觉，於是泉文又绝笔於此。 呜呼！ □ ．前二《传》既太简，谓《梁书》及谢詹事所作《传》。 门人编录复无条贯，俾君子辟世之道，清真养翮之迹，其几乎磨灭欤？ 乃於《登真隐诀》及《真诰》 、《泰清经》、先生文集揣摩事迩，作三卷焉。 华阳陶隐居内传卷上 薜萝孺子贾嵩撰 先生讳弘景，字通明，丹阳秣陵人也。 《本起录》云：宅在白杨巷。 其命氏自帝尧。 帝尧治冀州，世居平阳。 ·西汉丞相青翟，束汉司空敦皆赫然有名，论董卓烧锥阳。 十三世祖超始渡江，是为丹阳人。 七世祖浚仕昊为镇南将军， 《本起录》云：即交州刺史璜之弟也。 封句容侯。 吴灭，入北。 永嘉之乱，南迁。 《本起录》云：世祖浚第三子也。 永嘉中为束海王越司马，领屯兵随王出许昌。 因败，仍复过江，为大将军王敦参军。 敦乃启分属籍，晚乃起为车骑丞相参军，不就。 高祖毗，清拔尚气不肯仕。 曾祖兴公为郡功曹。 《本起录》云：多才艺，颇营产殖。 举。 郡功曹，察孝廉，除广晋县。 祖隆，长七尺五寸，笑姿表，善药术，以拯救为劳。 从宋武帝破姚泓有功，封晋安原丰侯。 《本起录》云：颜峻就求宅以益寺，弗与，因辞官。 见赞削爵，徒广州，后稍迁新会郡。 父贞宝，字国重，为江束名人。 由南台侍御史作江夏孝昌相。 《本起录》云：亦善骑射，解药衍，博涉子史。 美风仪。 与萧思话、王钊、刘秉友善。 元徽四年冬，衔使虏庭，通邻国之好。 作游历记并诗。 初，先生母郝夫人 《本起录》云：夫人束海人，讳智湛。 及终，有异焉。 梦青龙自怀而出，挈空束上。 《本起录》云：有青龙忽从身出，直束向上升天。 《梁书》云：梦两天人手执香炉来至其所，已而有娠。 与此颇异。 《本起录》是先生犹子栩所作，其究详事理，岂漏於史官乎？ 逐视之，无尾。 明日谓人曰：当生非凡男，然必无后。 或对曰：无乃为仙乎？ . 《本起录》云：既觉，密语周：旋叉当生男儿，应出非几也。 以宋孝建三年四月三十日夜半先生诞焉。 《本＇起录》云：岁丙申，日甲戌。 此年闰五月。 明旦便是夏至。",
      "translated_text": "In his youth, he harbored ambitions of riding clouds and driving dragons, refusing marriage and officialdom. Yet with no means to sustain himself, he briefly served in a minor post as a tutor to the Prince of Yidu. Though dwelling within vermilion gates, he lived alone in a single chamber, seldom engaging with the outside world. Day and night, he transcribed and studied esoteric texts, dedicating over twenty years to the practice of dietary regimens. Gradually, he penetrated the profound and subtle, though much of his work remained secret. As his arts advanced, he cast off his official robes and settled on Mount Mao.\n\nHis bearing was luminous and refined, his gaze radiant; his frame was slender and tall, his neck and ears finely wrought—clearly set apart from the common crowd. Here ends Minister Xie’s *Biography*.\n\nThis account, along with that in the *History of Liang*, is exceedingly cursory. I cannot fathom why Minister Xie Lun, having heard of the master’s retreat to the mountains and feeling such admiration, would hastily compose a *Biography* en route, one so lacking in thorough investigation of his merits and deeds.\n\nTao Hongjing remarked: \"The *Biography* Wang Xizhi wrote of Master Xu was much the same.\" As that account was too sparse to be of use, Tao Yu (Hongjing’s nephew) compiled the *Original Records*. Yet even by the end of the Qi dynasty, many matters remained omitted or incomplete. Though Yu was the master’s nephew, his *Original Records* only approximated thoroughness, marred by a base literary style and excessive trivialities. He himself admitted: \"This is not yet a proper *Biography*; it merely records his conduct to prevent its loss.\" Why it ceased abruptly in the first year of *Yongyuan* remains unknown.\n\nLater, Pan Quanwen, a disciple of the master, continued the work. He wrote: \"Tao Yu’s *Original Records* end at the close of the Qi dynasty. For the subsequent twenty-odd years, no further records exist. I have thus compiled these annals year by year, leaving a fuller *Biography* to future scholars.\" Beginning in the first year of *Tianjian*, he recorded events until the summer of the seventh year, fourth month. At that time, the master changed his name and secretly journeyed to distant mountains. In the summer of the seventh year of *Tianjian*, the master traveled south under his new name, as detailed in the *Biography*. With no one aware of his whereabouts, Quanwen’s account also ends here.\n\nAlas! The two earlier *Biographies*—those in the *History of Liang* and by Minister Xie—are far too brief. The disciples’ compilations, meanwhile, lack coherence, nearly erasing the path of one who withdrew from the world, the traces of his pure cultivation and soaring spirit. Thus, drawing from the *Dengzhen Yinjue*, the *Zhen’gao*, the *Taiqing Jing*, and the master’s collected writings, I have pieced together these events and composed this work in three fascicles.\n\n*Hua Yang Tao Yinju Neizhuan*, Fascicle One\nCompiled by Biluo Ruzi Jia Song\n\nThe master’s personal name was Hongjing, styled Tongming, a native of Moling in Danyang. The *Original Records* state that his residence lay in Baiyang Alley. His lineage traces back to Emperor Yao. When Yao governed Jizhou, his family dwelt in Pingyang. The Western Han Chancellor Qingdi and the Eastern Han Minister of Works Dun were illustrious figures of this line. During Dong Zhuo’s burning of Luoyang, the thirteenth-generation ancestor, Chao, crossed the Yangtze, becoming a native of Danyang. The seventh-generation ancestor, Jun, served the Wu kingdom as General of the South, as the *Original Records* note: \"He was the younger brother of Huang, Inspector of Jiaozhou.\" He was enfeoffed as Marquis of Jurong. After Wu’s fall, the family moved north. During the Yongjia upheaval, they migrated south again. The *Original Records* state: \"Jun was the third son of the founding ancestor. During Yongjia, he served as Marshal to Sima Yue, Prince of Donghai, leading garrison troops to Xuchang. After their defeat, he returned south and became a staff officer under Wang Dun, the Grand Marshal. Dun petitioned to restore his household registration, and later, he was appointed Consultant to the Chariot and Horse General, though he declined. His grandfather, Pi, was upright and spirited, refusing office.\"\n\nHis great-grandfather, Xinggong, served as a clerk in the commandery. The *Original Records* note: \"He was versatile and adept at managing property. He was nominated as Filial and Incorrupt, appointed to Guangjin County.\" His grandfather, Long, stood seven *chi* and five *cun* tall, with a dignified bearing. Skilled in medicine, he devoted himself to healing. He accompanied Emperor Wu of Song in the campaign against Yao Hong and was enfeoffed as Marquis of Yuanfeng in Jin’an. The *Original Records* add: \"When Yan Jun sought his residence to expand a temple, he refused and resigned his post. Later, his title was revoked, and he was exiled to Guangzhou, eventually rising to Prefect of Xinhui.\"\n\nHis father, Zhenbao, styled Guozhong, was a renowned figure in Jiangdong. He served as Investigating Censor in the Southern Terrace and later as Chancellor of Xiaochang in Jiangxia. The *Original Records* state: \"He was also skilled in archery, understood medicine, and was widely read in the philosophers and histories. His bearing was elegant. He befriended Xiao Sihua, Wang Zhao, and Liu Bing.\" In the winter of the fourth year of *Yuanhui*, he was sent as an envoy to the northern court to foster goodwill between neighboring states. He composed a travelogue and poems.\n\nInitially, the master’s mother, Lady Hao—the *Original Records* name her Zhi Zhen, a native of Donghai—experienced an auspicious sign before his birth. She dreamed a blue dragon emerged from her bosom and soared into the eastern sky. The *Original Records* describe it thus: \"A blue dragon suddenly issued from her body, ascending straight into the heavens.\" The *History of Liang* records: \"She dreamed two celestial beings bearing an incense burner approached her, and soon after, she conceived.\" The accounts differ. Since the *Original Records* were compiled by the master’s nephew, Yu, how could such details escape the historians’ notice? Upon waking, she examined herself and found no injury. The next day, she told others: \"I shall bear an extraordinary son, though he will leave no descendants.\" Someone replied: \"Might he become an immortal?\" The *Original Records* add: \"Upon waking, she secretly told Zhou: 'I shall soon give birth to a son, one destined for greatness.'\" In the third year of *Xiaojian* of Song, on the thirtieth day of the fourth month, at midnight, the master was born. The *Original Records* specify: \"The year was *bingshen*, the day *jiaxu*. That year had an intercalary fifth month. The following dawn marked the Summer Solstice.\"",
      "overlap_context": "he tenth year of *Yongming* of Qi, Minister Xie Lun of Wuxing heard that the master had resigned his post to retire at Huayang. On the road, he composed a *Biography*. Minister Xie’s *Biography* states: \"The master’s personal name was Hongjing, a native of Danyang. From childhood, he displayed exceptional conduct, keen perception, and vast knowledge. He thoroughly studied the Five Classics, the philosophers, and the histories. Skilled in calligraphy, he mastered the methods of past and present.\"",
      "start_char": 672,
      "end_char": 1944,
      "start_sentence": 35,
      "end_sentence": 110,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.65341639518738,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\华阳陶隐君内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "诂日，母沐浴，体忘微苦，乃起。 先生始生，无惊啼。 始坐，殊警惠。 五六岁时酷爱学书，虽戏弄罗前，唯执笔砚。 八九岁时读书千余卷，颇善属文。 读义卜葛稚川《神仙传》，见淮南八公事。 《本起录》云：乡亲鞠氏舍得葛洪 《神仙传》弟．六一卷。 夜抱卷与寝，乃日：攀青云白日，其何云远？ 县是耽重信悟，官然有方外之志矣。 神表孤迈，肤色哲泽。 每出，路人辄聚观，咸日：陶郎是玉京中落仙。 乃执羽扇以自障蔽，虽冬月不除。 年十一，作王昊博士。 《本起录》云：昊是司徒长史钊之子。 作昊对答书，启如老成人。 十五自南州还， 《本起录》云：先生年十三，父随史部尚书刘秉之淮南。 十五归都，寓憩中外徐冑舍。 作寻山志。 其《志》云云，具集中。 先生既冠而不肯婚， 先生澡洁去嗜欲，盖一生全不迩於声色也。 且日：吾欲萧条其魂也。 长七尺二寸，疏眉长额，右肩有紫志如钱。 按《金阙后圣列纪》，青童君云：此皆仙相也。 右股有数十黑子，阑干如斗形。 不乐荤膻，唯进青锤饭。 《清虚真人传》内有方，以南烛为主，盖上仙所服饵也。 酷爱松声，居必手植。 常嫌读书未满万卷，乃以内书兼之。 於是少出州府，辟召皆不起。 初父与刘秉友善，秉为丹阳尹，其子俟，少知名，酷好文学。 先生复与之游，出则共载，食乃同味。 于时宋氏失德，苍梧王遇害， 《宋书》云：废帝昱，明帝长子也。 既即位，荒乱酷暴，以齐高帝复为射的，既遇害，进镒苍梧王。 萧道成立，顺帝仍执政。 荆州刺史沈攸之拥兵不从，道成入守朝廷。 《宋书》云：顺帝，第三子。 齐高既专废立，不从者半，齐高乃入守朝廷。 司徒袁集墟石头谋诛道成，刘秉预焉。 遂奔石头，以其属随。 先生与韩贲、麋淡同管文檄。 道成勒兵攻破石头。 《宋书》云：司徒袁柴拥石头谋诛道成，不果，旋见覆灭。 《本起录》云：先生年二十二，随刘丹阳入石头，就袁柴建事。 先生终始久要，不遗旧故，虽危疑息难，不求自退也。 先生乃得出，俟为沙门问行， 《本起录》云：尔夕城渍，俟与第●仅逃走向京。 为人所获，死建康狱。 人莫敢视，先生哭其尸，躬自收殡。 《本起录》云：先生躬自收．殡痉葬，杳硎旧慕●。 先是，俟与江驰、褚炫等俱为顺帝四友，作《宋德颂》连珠七警，当世称绝。 至是遂亡其本。 先生乃喟然叹日：人无愚智，同尽百年，所贵身名遗芳寄世，惜乎刘生名迩俱丧。 《本起录》云：刘俟既石头奔渍，文章皆零落。 先生欲为纂集，竟不能得。 明年，道成封齐公，假黄铁，天命识所归矣。 先生既常结刘氏，内怀忧惕。 《本起录》云：先生自石头出，仍欲弃世寻山，而正值宋齐之际，物情未安，既世结刘乐，怛怀忧惕。 乃因纪真求见於新亭，大相推爱，俾居帐内。 沈攸之平，从还束府，仍为其子侍读。 《本起录》云：沈伙之平，从还束府，使为弟五息晔、第六息贵侍读，兼知公闲管记事。 时年二十三，除巴陵王侍郎。 齐高帝既登极，除太尉豫章王侍郎。 《梁书》云：齐高帝作相，引为诸王侍读。 误矣。 先生知为帝之左右者排逐，再除不授。 明年，随安成王出镇石头。 世祖初拜振武将军宜都王侍读。 齐世，侍读皆总知记室参军。",
      "translated_text": "At dawn, his mother bathed and, feeling a slight discomfort in her body, rose. When the master was first born, he did not cry out in alarm. As soon as he could sit, he showed exceptional intelligence. At five or six, he was deeply fond of writing, and even when playing before the curtains, he would only hold brush and inkstone. By eight or nine, he had read over a thousand volumes and was quite skilled in composition. Upon reading the *Biographies of Divine Transcendents* by Ge Zhichuan of Yibu, he encountered the tale of the Eight Lords of Huainan.\n\nThe *Original Records* state: A village elder, the Ju family, lent him the sixth fascicle of Ge Hong’s *Biographies of Divine Transcendents*. He held the scroll to sleep at night, declaring: \"To climb the azure clouds and ride the white sun—how distant could it be?\" From then on, he became deeply devoted and awakened to a resolve for the life beyond the world. His bearing was lofty and untrammeled, his complexion luminous and refined. Whenever he went out, passersby would gather to watch, all saying: \"Young Master Tao is a fallen immortal from the Jade Capital.\" He would then take up a feather fan to shield himself, never putting it aside, even in winter.\n\nAt eleven, he composed a eulogy for Academician Wang Hao. The *Original Records* note: Hao was the son of Sima Zhao, the Chief Clerk of the Minister of Personnel. The master’s written response to Hao was as composed as that of a seasoned scholar.\n\nAt fifteen, he returned from the southern provinces. The *Original Records* state: At thirteen, his father followed Liu Bing, the Minister of Personnel, to Huainan. At fifteen, he returned to the capital and lodged at the residence of his maternal uncle, Xu Zhou. There, he composed *A Record of Mountain-Seeking*. The text of this *Record* is preserved in his collected works.\n\nUpon coming of age, the master refused to marry. He maintained purity and renounced desires, for his entire life never drawing near to sensual pleasures. He would say: \"I wish to keep my spirit untroubled.\" He stood seven *chi* and two *cun* tall, with sparse brows and a broad forehead. On his right shoulder was a purple mark the size of a coin. According to the *Later Sacred Register of the Golden Watchtower*, the Azure Lad remarked: \"These are all signs of an immortal.\" On his right thigh were several dozen black moles, arranged in the shape of the Big Dipper. He disliked meat and strong flavors, partaking only of green-grain rice. The *Biography of the Perfected One of Pure Emptiness* contains a recipe with *nan zhu* as the main ingredient—this was the diet of the highest immortals. He was deeply fond of the sound of pines, and wherever he lived, he would plant them himself. Feeling his reading had not yet reached ten thousand volumes, he supplemented it with esoteric texts. Thus, he rarely left the prefecture, declining all official summons.\n\nHis father had been close friends with Liu Bing, who served as Governor of Danyang. Bing’s son, Si, was renowned from a young age and deeply devoted to literature. The master befriended him, sharing carriages when they went out and meals when they dined.\n\nAt that time, the Song dynasty had lost its virtue, and Emperor Cangwu met his end. The *History of the Song* states: Emperor Yu, the eldest son of Emperor Ming, ascended the throne but ruled with madness and cruelty. He used Qi Gao as a target for archery, and upon Gao’s death, posthumously demoted him to Prince Cangwu. Xiao Daocheng established himself, and Emperor Shun remained in power. Shen Youzhi, the Governor of Jingzhou, raised troops in defiance. Daocheng entered the capital to secure the court. The *History of the Song* notes: Emperor Shun was the third son. As Qi Gao monopolized the power of deposition, half the realm resisted. Thus, Gao entered the capital to take control.\n\nThe Minister of Personnel, Yuan Yi, plotted with others at Stone Citadel to assassinate Daocheng, and Liu Bing was involved. They fled to Stone Citadel, taking their followers with them. The master, along with Han Ben and Mi Dan, drafted official documents. Daocheng led troops to crush Stone Citadel. The *History of the Song* records: The Minister of Personnel, Yuan Yi, conspired at Stone Citadel to kill Daocheng but failed and was soon annihilated. The *Original Records* state: At twenty-two, the master followed Liu of Danyang into Stone Citadel to support Yuan Yi’s cause. The master remained steadfast in his loyalty, never abandoning old ties. Even in peril and uncertainty, he did not seek to withdraw.\n\nAfterward, the master was able to leave. Si became a wandering monk. The *Original Records* note: That night, the city fell, and Si, along with his younger brother, barely escaped toward the capital. They were captured, and Si died in the prison of Jiankang. No one dared to look upon his body, but the master wept over it and personally arranged his burial. The *Original Records* add: The master personally collected his remains and buried them, mourning at the old grave.\n\nEarlier, Si had been one of the Four Companions of Emperor Shun, along with Jiang Chi and Chu Xuan, and had composed *Seven Linked Pearls in Praise of Song Virtue*, which was celebrated in his time. The original text was now lost. The master sighed and said: \"Whether wise or foolish, all perish within a hundred years. What matters is leaving behind a name to be cherished by later generations. Alas, Liu’s name and works are both lost!\" The *Original Records* state: After Liu Si’s flight from Stone Citadel, his writings were scattered. The master wished to compile them but could not recover them.\n\nThe following year, Daocheng was enfeoffed as Duke of Qi and granted the Nine Bestowments. The mandate of heaven was seen to have found its rightful recipient. The master, having long been allied with the Liu family, harbored deep unease. The *Original Records* note: After leaving Stone Citadel, the master wished to renounce the world and seek the mountains, but the transition between Song and Qi unsettled the realm. Bound by his ties to the Liu family, he remained anxious and troubled. He then sought an introduction through Ji Zhen to meet at Xinting, where he was warmly received and invited to stay within the tent.\n\nAfter Shen Youzhi was pacified, he returned to the Eastern Residence and served as tutor to Daocheng’s sons. The *Original Records* state: After Shen Youzhi’s defeat, he returned to the Eastern Residence and was appointed tutor to the fifth son, Ye, and the sixth son, Gui, while also managing the household records. At twenty-three, he was appointed Gentleman Attendant to the Prince of Baling. After Emperor Gao of Qi ascended the throne, he was appointed Gentleman Attendant to the Prince of Yuzhang. The *History of the Liang* states: When Emperor Gao served as regent, he appointed the master as tutor to the various princes. This is incorrect. The master knew he was being sidelined by those close to the emperor and declined the second appointment.\n\nThe following year, he accompanied the Prince of Ancheng to garrison Stone Citadel. At the beginning of Emperor Shizu’s reign, he was appointed Gentleman Attendant to the Prince of Yidu, with the title General of Vibrant Might. During the Qi dynasty, the Gentleman Attendants also oversaw the duties of the Secretariat.",
      "overlap_context": ", though he will leave no descendants.\" Someone replied: \"Might he become an immortal?\" The *Original Records* add: \"Upon waking, she secretly told Zhou: 'I shall soon give birth to a son, one destined for greatness.'\" In the third year of *Xiaojian* of Song, on the thirtieth day of the fourth month, at midnight, the master was born. The *Original Records* specify: \"The year was *bingshen*, the day *jiaxu*. That year had an intercalary fifth month. The following dawn marked the Summer Solstice.\"",
      "start_char": 1945,
      "end_char": 3253,
      "start_sentence": 111,
      "end_sentence": 182,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.53054738044739,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\华阳陶隐君内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "先生於吉凶内外栈启疏牒莫不绝众，凡濡毫落纸，人皆楷模之。 《本起录》云：先生於吉凶内外仪体·表笔，爰及栈疏启牒，莫不绝众。 数王书佐典书皆来承受，以为准格。 数王侍读咸切齿谗忌，先生处之怡怡如也。 桂阳王登双霞台，置酒召宗室侯王兼其客，先生从宜都豫焉。 桂阳采名颁号，各令为赋，真十题器中。 先生探获水仙，大惬意。 其《赋》云云，具集中。 沈约、任防读之，叹曰：如清秋观海，第见澶漫，宁测其深。 其心伏如此。 寻除左卫殿中将军，时论称屈。",
      "translated_text": "The master’s compositions for auspicious and inauspicious occasions, both within and beyond the court—whether formal protocols, memorials, petitions, or official dispatches—surpassed all others. Whenever he dipped his brush to write, his words became the standard for all. *The Record of Origins* states: \"The master’s handling of ceremonial forms, memorials, and brushwork for both courtly and external affairs—including memorials, petitions, and dispatches—was unmatched. Several princes’ scribes and record-keepers came to study and adopt his work as their model.\" The various princes’ attendants seethed with envy and slander, yet the master remained untroubled, his demeanor ever serene.\n\nWhen the Prince of Guiyang ascended the Double Terrace, he hosted a feast for the imperial clan’s marquises and princes, along with their guests. The master, accompanying the Prince of Yidu, was among them. The Prince of Guiyang announced a poetic theme, drawing ten topics from a vessel. The master drew \"Water Immortal\" and was greatly pleased. His *Rhapsody* (recorded in full in the collected works) so moved Shen Yue and Ren Fang that they sighed: \"It is like gazing upon the autumn sea—one sees only boundless expanse, yet cannot fathom its depths.\" Such was the reverence he commanded.\n\nSoon after, he was appointed Palace Gentleman of the Left Guard, though contemporary opinion deemed the post beneath him.",
      "overlap_context": " appointed the master as tutor to the various princes. This is incorrect. The master knew he was being sidelined by those close to the emperor and declined the second appointment.\n\nThe following year, he accompanied the Prince of Ancheng to garrison Stone Citadel. At the beginning of Emperor Shizu’s reign, he was appointed Gentleman Attendant to the Prince of Yidu, with the title General of Vibrant Might. During the Qi dynasty, the Gentleman Attendants also oversaw the duties of the Secretariat.",
      "start_char": 3253,
      "end_char": 3474,
      "start_sentence": 183,
      "end_sentence": 193,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.886949300765991,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\华阳陶隐君内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "庾道经亟言於武帝，帝曰：先帝昔亲作此官，裴松之从此转员外郎，吾之重也，卿那不知。 《本起录》云：时年二十九。 青汉官新成，帝锐意游宴，先生拜表献颂，于时称绝。 忽一日於石头恍然，若有所适，无所觉知者七日，乃豁然自差，云：睹见甚异事。 秘不得知。 《本起录》云：年二十九，於石头中忽得病，不知人，不服药，不饮食，经七日乃豁然自差，说多有所睹见。 从此容色疲悴，言音亦胱岩阐缓者矣。 是岁束阳孙游岳始授先生道家符图，虽云相承真本，而历经摹写，意所未惬。 明年游茅山。 《本起录》云：戊辰年始往茅山，按先生木披访经法，而拂衣长往，经始於是行也。 获前真杨、许兴宁中手书。 按《真诰》晋：兴宁三年太元真人茅君、紫阳真人周君、紫微夫人九华安妃及诸真仙并降杨君羲於茅山，及许长史父子皆同传哑，而杨、许感降，皆有文逵炳然。 先生於是并获，盖天付其人也。 诚心感跃，如亲睹灵＇人，o乃寻三真往来书疏，知所获者犹多亡阙，更搜访远近，於是启假而东，谒楼惠明於大洪山，遇杜京产於太平山，又寻沙门锺义山於晁山，皆卑辞膝请，获真人手迹十余卷。 游历二百余日，乃还都。 《本起录》云：游历山水二百余日，乃还。 未几复往，更求遗述，多有所得。 爰及东阳长山、昊兴天目，於潜、临海、遂安诸名山无不探历。 身本轻捷，登陆无艰。 每遇崩崖断壁，但寨绉跌越。 或逢幽岩深涧，便吟啸盥涤，盘桓坐卧，采掘花药，泊猿乌吟栖，尚不能去，往往独宿麋鹿中。 常言曰：见朱闱广厦，虽是华乐，而初无欲往之心。 望高岩广泽，亦知此难立。 正自恒欲往就，不解所以，必是绿使之然。 还都，由振武将军除奉朝请。 先生为兄时，每言朝市非乐。 既然长大，值宋齐相授，见时之未可，遂栖下位，盘桓风火，及是知兵灾纷起，乃振衣束顾，曰：去矣。 常言大天之内复有三十六洞天。 《茅传》云：大天之内有地中洞天三十六所，又八海中诸神山皆亦有洞官，或方千里、五百里，非三十六之例。 江左伏龙山乃其第八，谓之金坛华阳洞。 汉有三茅君得道，实居之。 吾其长往於此。 仲尼云：隐居以求其志，行义以达其道，吾闻其语，未见其人。 我今日义达，无复其方，请从求志之业。 乃自称华阳隐居。 《本起录》云：绖人问书疏，皆以此号代名。 亦犹士安之玄晏，稚川之抱朴。 是岁永明十年也。 《本起录》云：壬申年，时年三十七。 行有日矣，约左右令先出都。 吾辞省已，乃抱朝服挂神虎门，袭鹿巾，径出束一子。 因与王晏别，语及此事。 晏云：主上性至存严治，不许人作高奇事，脱致作旨，坐自贻咎，便恐违卿山志，如何？ 先生默思良久，曰：吾本为身，非为名，若有此虑，亦奚如此为？ 於是不诣省，直表辞而已。 郑障、史隽云：先生永明十年脱朝服挂神虎门，上表辞禄，诏许之。 此乃知其始，而不知其末也。 表云云，具集中。",
      "translated_text": "Bedao Jing repeatedly spoke of him to Emperor Wu, who replied: \"The late emperor once personally held this office. Pei Songzhi was promoted from it to Gentleman Attendant, for I hold it in esteem—how could you not know?\" *The Primary Record* states: He was then twenty-nine years old.\n\nAs the new halls of the Azure Palace were completed, the emperor was keen on excursions and feasts. The master submitted a memorial with an ode, which was then acclaimed as unmatched. One day at Shitou, he fell into a trance, as if transported elsewhere, remaining unaware of all around him for seven days. When he suddenly recovered, he said: \"I witnessed most extraordinary things,\" but kept them secret, revealing nothing. *The Primary Record* states: At twenty-nine, while at Shitou, he suddenly fell ill, losing consciousness. He took no medicine, nor ate or drank, and after seven days abruptly recovered, claiming to have seen many visions. Thereafter, his complexion grew wan and haggard, and his speech became slow and halting.\n\nThat year, Sun Youyue of Shuyang first transmitted to the master the Daoist talismans and charts. Though said to be authentic transmissions, they had passed through many hands in copying, and he found them unsatisfactory. The following year, he journeyed to Mount Mao. *The Primary Record* states: In the year *wuchen*, he first went to Mount Mao. There, he sought out scriptures and methods, yet soon cast off his robes and departed, his quest for the Dao beginning in earnest. He obtained the original handwritten texts of the earlier adepts Yang and Xu from the Xingning era.\n\nAccording to the *True Records*: In the third year of Xingning of the Jin, the Perfected of Great Clarity, Lord Mao; the Perfected of Purple Yang, Lord Zhou; the Lady of the Purple Tenuity, Consort An of Nine Flowers; and other transcendents all descended upon Yang Xi at Mount Mao, while the father and son of the Xu family likewise received their teachings. Yang and Xu, moved by these revelations, left behind writings of luminous clarity. The master now obtained these texts—truly, Heaven had entrusted them to him. His heart leapt with reverence, as if he had beheld the Perfected in person. He then examined the correspondence of the Three Perfected and learned that much of what he had acquired was still incomplete or lost. He searched far and wide, and thus requested leave to travel east. He visited Lou Huiming at Mount Dahong, encountered Du Jingchan at Mount Taiping, and sought out the monk Zhong Yishan at Mount Chao. With humble words and earnest pleas, he obtained over ten scrolls in the hand of the Perfected.\n\nHe wandered for over two hundred days before returning to the capital. *The Primary Record* states: He traveled through mountains and rivers for over two hundred days before returning. Soon after, he set out again, seeking lost writings, and obtained many more. From Changshan in Dongyang to Tianmu in Wuxing, and through the renowned mountains of Yuqian, Linhai, and Sui’an, there was no peak he did not explore. His body was light and agile, and climbing posed no difficulty. When he encountered crumbling cliffs or sheer precipices, he would clamber up with ease. In secluded ravines or deep gorges, he would chant, bathe, and linger, sitting or lying among the flowers and herbs. Even when apes cried or birds roosted, he could not bring himself to leave, often spending nights alone among the deer. He often said: \"Though vermilion gates and spacious halls are splendid, I feel no desire to go there. Gazing upon towering crags and vast marshes, I know such places are hard to dwell in—yet I am always drawn to them, unable to explain why. It must be the work of the numinous.\"\n\nUpon his return to the capital, he was appointed Gentleman Consultant through the recommendation of the General of Vibrant Might. In his youth, the master had often said that the court and marketplace were no place for joy. As he grew older, witnessing the transitions from Song to Qi, he saw the times were not yet ripe, and so remained in a lowly position, drifting between wind and fire. But when he learned of the rising turmoil of war, he shook out his robes, turned eastward, and said: \"I depart.\" He often spoke of how within the great heavens there are thirty-six grotto-heavens. *The Transmission of Mao* states: Within the great heavens lie thirty-six grotto-heavens beneath the earth, and in the eight seas, the divine mountains also have their grotto-palaces, some a thousand *li* or five hundred *li* in extent, not counted among the thirty-six. On the left bank of the Yangtze, Mount Fulong is the eighth, called the Golden Altar Grotto of Flourishing Yang. The Three Lords Mao attained the Dao and dwelt there. \"I shall go there for good,\" he resolved.\n\nConfucius said: \"Seclude yourself to fulfill your aspirations; practice righteousness to realize the Way. I have heard these words, but never seen such a man.\" The master said: \"Today, my righteousness is fulfilled, and I have no further direction. Let me follow the path of seeking my aspirations.\" He then styled himself \"Recluse of Flourishing Yang.\" *The Primary Record* states: In his letters and documents, he used this name in place of his own—just as Shi’an was called \"Mysterious Repose\" and Zhichuan \"Embracer of Simplicity.\"\n\nThis was the tenth year of Yongming. *The Primary Record* states: The year *renshen*, when he was thirty-seven. The day of his departure drew near, and he instructed his attendants to leave the capital first. After bidding farewell at the ministry, he took his court robes and hung them at the Gate of the Divine Tiger, donning a deer-hide cap and walking out alone with a single attendant. He then took leave of Wang Yan, speaking of his plans. Yan said: \"His Majesty is most strict in governance and does not permit men to act in strange or lofty ways. If this incurs his displeasure, you will bring trouble upon yourself and thwart your mountain aspirations. What then?\" The master fell silent for a long while, then said: \"I act for myself, not for fame. If this is a concern, why proceed thus?\" He did not go to the ministry but submitted a memorial of resignation alone.\n\nZheng Zhang and Shi Jun said: In the tenth year of Yongming, the master removed his court robes at the Gate of the Divine Tiger, submitted a memorial to resign his stipend, and was granted leave by imperial decree. They knew the beginning but not the end. The memorial is recorded in full in the collected works.",
      "overlap_context": "ce of Guiyang announced a poetic theme, drawing ten topics from a vessel. The master drew \"Water Immortal\" and was greatly pleased. His *Rhapsody* (recorded in full in the collected works) so moved Shen Yue and Ren Fang that they sighed: \"It is like gazing upon the autumn sea—one sees only boundless expanse, yet cannot fathom its depths.\" Such was the reverence he commanded.\n\nSoon after, he was appointed Palace Gentleman of the Left Guard, though contemporary opinion deemed the post beneath him.",
      "start_char": 3474,
      "end_char": 4626,
      "start_sentence": 194,
      "end_sentence": 241,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.70304250717163,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\华阳陶隐君内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "表既入，诏答。 诏云云，具集中。 将行，与宜都王别，彼此呜咽，各不能发】言。 左右莫能仰规。 或谓宜都王云：王相爱重如此，那听其去？ 王云：今为天下胜事，天子许其不臣，吾何敢然？ 以裘镜赠别，给在山吏役数人。 《本起录》云：先生昔为安成、宜都二王侍读，而通与诸王少长款狎。 武陵，鄱阳、桂阳、衡阳皆春遇殊常，每一往，辄言话终日。 永泰之世，慎避形进，怛示疏退，由是无声累。 宜都幼有识度，且待哑最久，弥尽亲密。 先生亦竭诚陪赞。 及闻先生当辞世绝俗，屡致涕泗，临行告别云云。 或谓宜都：那听其去？ 王曰：近武陵欲引其领郡五官，我苦论得免。 慎之，三日不与武陵相见。 今为天下胜事，我岂得以私情割其久仍停省？ 饯集明旦，裘镜九种赠别，给衣、书、车乘出使，亲侍左右五六人送至湖熟，吏役数人长给在山触事管理，书驿旬朔。 武陵、桂阳、鄱阳亦各赠诗并诸致遗人力经纪云云。 先生既命舢束川，齐公卿并送於征虏亭，举酒挥袂，皆云江束比来未有此事，乃今日见之。 二疏聚金归田园，亦何得称高？ 先生乃曰：秦皇、汉祖、楚羽、昊策，并势横海外，雄架天维，寸气不续，则为一丘之壤，况乎二三子之徒也？ 高居云岭，访真幽府，正为此耳。 日暮乃别，执御者亦献欢，送者相谓曰：孤鸿已摩天去，吾侪恋稻粱，跳踯网罗中。 明年齐大乱，西昌侯萧鸾弒其君，於是乎知先生预见之明也。 华阳陶隐居内传卷上竟 华阳陶隐居内传卷中",
      "translated_text": "The memorial having been submitted, an imperial rescript was issued in reply. The rescript’s full text is recorded in the collected works. As he prepared to depart, he took leave of the Prince of Yidu. Both were choked with sobs, unable to speak. Those around them dared not lift their gaze. Someone said to the Prince of Yidu: “Your Highness holds him in such deep affection and esteem—how can you allow him to go?” The prince replied: “This is the finest deed in the realm. The Son of Heaven has permitted him to withdraw from court service. How dare I oppose it?”\n\nHe presented a fur robe and a mirror as parting gifts and assigned several officials and servants to attend him in the mountains.\n\n*The Record of Origins* states: The master had formerly served as tutor to the Princes of Ancheng and Yidu and was on familiar terms with all the imperial princes, young and old alike. The Princes of Wuling, Poyang, Guiyang, and Hengyang each received him with exceptional warmth, and whenever he visited, their conversations would last the whole day. During the Yongtai era, he carefully avoided drawing attention to himself, consistently demonstrating his desire for retirement, and thus remained free of entanglement in worldly affairs. The Prince of Yidu, discerning from childhood and having known the master the longest, shared an especially close bond. The master, too, devoted himself wholeheartedly to guiding him. When he learned that the master intended to renounce the world, he repeatedly broke into tears. At their final parting, he spoke as before.\n\nSomeone again asked the Prince of Yidu: “How can you let him go?” The prince replied: “Recently, the Prince of Wuling sought to appoint him as a local administrator, but I argued strenuously to prevent it. Out of caution, I did not meet with the Prince of Wuling for three days. Now, this is the finest deed in the realm—how could I, out of personal attachment, delay his long-cherished withdrawal from court?” The next morning, a farewell gathering was held. He presented nine items—a fur robe and a mirror—as parting gifts, along with clothing, books, and a carriage for official travel. Five or six attendants accompanied him personally, seeing him as far as Hushu, while several officials and servants were permanently assigned to manage his affairs in the mountains, with messengers dispatched monthly.\n\nThe Princes of Wuling, Guiyang, and Poyang each sent poems and gifts, along with servants and supplies to assist him.\n\nOnce the master had boarded his boat to cross the river, the nobles and high officials of the Qi court gathered at the Zhenglu Pavilion to see him off. Raising their cups and waving their sleeves, they all declared: “Nothing like this has been seen east of the Yangtze in recent times—only today do we witness it. Even the Two Shus, who amassed wealth before returning to their fields, cannot be called lofty in comparison.” The master replied: “The First Emperor of Qin, the Founder of Han, Xiang Yu, and Sun Ce—all wielded power that shook the seas and dominated the heavens. Yet when their last breath faded, they became but clods of earth. How much more so for the likes of us? Dwelling high in the clouded peaks, seeking the hidden abodes of the immortals—this is my true purpose.”\n\nAs dusk fell, they parted. Even the charioteers rejoiced for him. Those who had come to see him off said to one another: “The solitary swan has soared beyond the heavens, while we remain bound to our grains, leaping and stumbling within the snares of the world.”\n\nThe following year, great chaos engulfed the Qi dynasty, and the Marquis of Xichang, Xiao Luan, murdered his sovereign. Only then did they recognize the master’s foresight.\n\n*Inner Biography of Master Hidden-Cinnabar of Huayang, Volume One* ends.\n*Inner Biography of Master Hidden-Cinnabar of Huayang, Volume Two* begins.",
      "overlap_context": "silent for a long while, then said: \"I act for myself, not for fame. If this is a concern, why proceed thus?\" He did not go to the ministry but submitted a memorial of resignation alone.\n\nZheng Zhang and Shi Jun said: In the tenth year of Yongming, the master removed his court robes at the Gate of the Divine Tiger, submitted a memorial to resign his stipend, and was granted leave by imperial decree. They knew the beginning but not the end. The memorial is recorded in full in the collected works.",
      "start_char": 4627,
      "end_char": 5211,
      "start_sentence": 242,
      "end_sentence": 268,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.202024221420288,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\华阳陶隐君内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "薜萝孺子贾嵩撰 初，先生以大茅、中茅问有积金岭，其地可修上道， 《真诰》云：大茅、中茅相连，长阿中有连石，古时名为积金山。 其处宜人住，可索有水处为居室静舍。 乃住，快可合丹，以修上道也。 乃於岭西立华阳上下馆。 《登真隐诀》云：上馆以研虚守真，下馆以炼丹治药。 袭紫皮巾被，三易徕条褐。 《集卷》云：有人遗红丝被，先生责而还之。 乃云：近有人遗晋安三易徕，甚佳。 褐者着条为之，左九条，右十条，法二景也。 神栖寂泊，精骛玄极。 虽萧萧独往，眇眇真贵，而亲旧书驿，远近参同，盖未能抑绝。 常题桐叶作诗肤寄宜都王。 其末云：愿为双白羽，长拂举前尘。 未几，夜梦宜都云已亡，复二年当受生。 先生曰； 何往？",
      "translated_text": "Master Biluo’s disciple, Jia Song, records:\n\nInitially, the Master sought the Great Mao and Middle Mao peaks at Mount Accumulated Gold, where the land was suited for cultivating the Supreme Dao. As the *True Instructions* states: “The Great Mao and Middle Mao peaks stand connected, with a long ridge between them called Linked Stone, known in ancient times as Mount Accumulated Gold. The place is fit for human dwelling—one should seek a water-adjacent site for a tranquil abode.” There, he settled, for the conditions were ripe for compounding the elixir and pursuing the Supreme Dao. On the western slope of the ridge, he established the Upper and Lower Halls of Huayang. The *Hidden Instructions on Ascending to Perfection* explains: “The Upper Hall is for refining emptiness and preserving the true; the Lower Hall is for concocting the elixir and preparing medicines.”\n\nHe wore a purple kerchief and a quilted cloak, and thrice received the *Lai* hempen robes. As the *Collected Scrolls* notes: “Someone once gifted him a red-silk quilt, which the Master rebuked and returned, saying, ‘Recently, someone presented me with three *Lai* robes from Jin’an—those were excellent.’” The hempen robes were woven with striped patterns: nine stripes on the left, ten on the right, following the method of the Two Radiant Ones.\n\nHis spirit dwelled in serene stillness, his essence roamed the farthest mysteries. Though he wandered alone in the rustling winds, exalted in his solitary truth, letters from kin and old friends, as well as visitors from near and far, continued to arrive—he could not entirely sever such ties. Once, he inscribed a poem on a paulownia leaf and sent it to the Prince of Yidu. Its closing lines read:\n\n*“Would that I were a pair of white wings,\nTo sweep forever the dust before me.”*\n\nSoon after, he dreamed one night that the Prince of Yidu had passed, and would be reborn in two years. The Master asked: *“Where shall you go?”*",
      "overlap_context": "to see him off said to one another: “The solitary swan has soared beyond the heavens, while we remain bound to our grains, leaping and stumbling within the snares of the world.”\n\nThe following year, great chaos engulfed the Qi dynasty, and the Marquis of Xichang, Xiao Luan, murdered his sovereign. Only then did they recognize the master’s foresight.\n\n*Inner Biography of Master Hidden-Cinnabar of Huayang, Volume One* ends.\n*Inner Biography of Master Hidden-Cinnabar of Huayang, Volume Two* begins.",
      "start_char": 5211,
      "end_char": 5518,
      "start_sentence": 269,
      "end_sentence": 286,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.97311782836914,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\华阳陶隐君内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "王曰：未知也。 因问鬼神中事云云。 乃相执悲别。 先生更留，云指痛不得久停。 明日俾出都参访，已遇害矣。 《本起录》云：永明十一年，宜都出为南豫州，镇姑熟。 延兴之末，例非天命。 先生以十一月十八日忽梦王云云。 先生眠觉，悲怛惊怪。 明日使人出都参访，云以此月十日致毙矣。 明帝即位，深相喜赏，诏劝日至，备安车厚礼迎出居蒋山。 先生拒之，乃已。 《本起录》云：宋明帝三年二月，劲迎先生出居蒋山。 先生固辞，并因江佑陈启，乃停。 从此使人往来，月有数四，饷赐重迭，随意所求。",
      "translated_text": "The Prince replied, *“I do not know.”* He then inquired about matters among the spirits and ghosts. With clasped hands, they parted in sorrow. The Master urged him to stay longer, but the Prince said his finger pained him and he could not linger. The next day, the Master sent someone to the capital to make inquiries, only to learn that the Prince had already been murdered.\n\n*The Record of Origins* states: In the eleventh year of Yongming, the Prince of Yidu was appointed Governor of Nanyuzhou and stationed at Gushu. By the end of Yanxing, his fate was not of Heaven’s decree. On the eighteenth day of the eleventh month, the Master suddenly dreamed of the Prince as before. Awakening from sleep, he was struck with grief and astonishment. The following day, he dispatched someone to the capital to inquire, and learned that the Prince had been put to death on the tenth day of that same month.\n\nWhen Emperor Ming ascended the throne, he held the Master in deep admiration, sending frequent summons and offering a grand carriage and lavish gifts to welcome him to reside on Mount Jiang. The Master declined, and the matter was dropped.\n\n*The Record of Origins* states: In the third year of Emperor Ming of Song, officials were sent to insistently invite the Master to reside on Mount Jiang. The Master firmly refused, and through Jiang You’s memorial, the request was withdrawn. Thereafter, messengers came and went several times a month, bearing repeated gifts and offerings, granting whatever he desired.",
      "overlap_context": "ds, exalted in his solitary truth, letters from kin and old friends, as well as visitors from near and far, continued to arrive—he could not entirely sever such ties. Once, he inscribed a poem on a paulownia leaf and sent it to the Prince of Yidu. Its closing lines read:\n\n*“Would that I were a pair of white wings,\nTo sweep forever the dust before me.”*\n\nSoon after, he dreamed one night that the Prince of Yidu had passed, and would be reborn in two years. The Master asked: *“Where shall you go?”*",
      "start_char": 5518,
      "end_char": 5749,
      "start_sentence": 287,
      "end_sentence": 301,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.115486145019531,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\华阳陶隐君内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "先生亦每事抑遣。 乃於上馆更建层楼。 永元初，乃登楼长静。 《本起录》云：四年，筑架层楼，规欲杜绝。 永元元年移住，便与物顿隔。 外闲简牍亦削去。 於是便与物顿隔，晨昏供侍一两人而已。 潜光隐耀，盖无为而无不为也。 所居堂静，榛芜不生。 常患去水稍远，至是飞溜涌出，灵芝秀於下馆，甘露被於昭台，毛龟泳於前塘。 白鼠见於药屋，皆致真之巨符，瑞圣之丕迩。 是岁命弟子戴坦、秉策、执简，授门人昊郡陆敬游建连石之邑并十贾。 世谓之锡，仙谓之赛。 九者阳极，君之位也。 十者阴终，以之制焉。 孔子日：周有大赛，善人是富。 故以十赛称焉。 为栖静处士。 其文日云云，具集中。 时束昏不君，江表危动。 《齐书》云：．废帝束昏侯讳宝巷，既即位，残忍酷暴，书契未闻，制剔孕妇，格煞百姓，每一月几三十余出，往无定处，束行驱北。 明旦应出郊，即驱逐史司，奔驰叫呼盈路，鼓声所闻，便徒铣奔走。 犯者皆手刃，工商废业，樵苏路断。",
      "translated_text": "The Master, in every matter, restrained and declined. Thereupon, a multi-storied tower was constructed atop the upper residence. At the beginning of the Yongyuan era, he ascended the tower to dwell in prolonged stillness.\n\n*The Record of Origins* states: In the fourth year, a layered tower was built, designed to sever worldly ties. In the first year of Yongyuan, he moved to reside there, abruptly cutting off all contact with the external world. Even the exchange of letters ceased. From then on, he was entirely secluded, with only one or two attendants for morning and evening service. His hidden radiance and concealed brilliance embodied the principle of \"non-action yet nothing left undone.\" The hall where he dwelled was tranquil, with no overgrowth of brambles. Though he had long lamented the distance to water, suddenly a spring gushed forth, lingzhi mushrooms flourished beneath the lower residence, sweet dew blanketed the Bright Terrace, and furred turtles swam in the front pond. White rats appeared in the medicinal hut—all grand omens of his attainment of the true Dao, and auspicious signs of sagely proximity.\n\nThat year, he commanded his disciples Dai Tan, Bing Ce, and Zhi Jian to bestow upon his follower Lu Jingyou of Wu Commandery the governance of Lian Stone Village along with ten *gu*. The world calls these *xi*; immortals call them *sai*. Nine represents the utmost yang, the position of a ruler. Ten signifies the completion of yin, used here as a regulatory measure. Confucius said: \"The Zhou possessed great *sai*, enriching the good.\" Thus, it was named the \"Ten *Sai*.\" The title conferred was \"Reclusive Scholar of Tranquil Abode.\" The text of the document is recorded in full in the collected works.\n\nAt that time, the Eastern Wei ruler failed in his duty, and the lands south of the Yangtze trembled in peril. *The Book of Qi* states: The deposed Emperor Donghun Hou, whose personal name was Baoxu, was cruel and savage upon ascending the throne. No precedent in history matched his atrocities—he disemboweled pregnant women, slaughtered commoners, and ventured out nearly thirty times a month, with no fixed destination, driving his retinue northward in chaotic haste. When he was to depart for the suburbs at dawn, he would drive officials and clerks before him, filling the roads with clamor and shouts. Wherever the sound of drums was heard, people fled in terror. Those who offended him were slain on the spot. Craftsmen and merchants abandoned their trades, and firewood-gatherers dared not tread the paths.",
      "overlap_context": "ering a grand carriage and lavish gifts to welcome him to reside on Mount Jiang. The Master declined, and the matter was dropped.\n\n*The Record of Origins* states: In the third year of Emperor Ming of Song, officials were sent to insistently invite the Master to reside on Mount Jiang. The Master firmly refused, and through Jiang You’s memorial, the request was withdrawn. Thereafter, messengers came and went several times a month, bearing repeated gifts and offerings, granting whatever he desired.",
      "start_char": 5749,
      "end_char": 6152,
      "start_sentence": 302,
      "end_sentence": 324,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.399369478225708,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\华阳陶隐君内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "或委病弃尸，不得殡葬。 万姓嗷嗷，甚乎涂炭之上。 征束将军萧衍军次石头，束昏宝台城义师颇怀犹豫。 先生上观天象，知时运之变，俯察人心，悯涂炭之苦，乃亟陈图谶，贻书赞奖。 《本起录》云：先生目永元已来深记向晦，闻义师西下，日夕以觊，及届于新林，便指毫赞奖，遣弟子戴猛之假道传送。 行达皂荚桥，不能得造。 ．至登石头，复使李嗣公仰奏，即获闻答。 时十一月朔日也。 台烁犹自严固，时人惩崔氏覆匮，多怀犹豫，先生不疑，庶事铃次也。 受封揖让之际，范云、沈约并乘策佐命，未知建国之号。 先生引王子年《归来歌中》水刃木处， 王子年《归来歌》亟论水刃木皆是羡词，兼引王君《回文识》焉。 荣牵三诗，并盛称梁字为应运之符。 及诸图谶并称梁字，为应运之符。 洎将昭告，复令用四月丙寅。 《本起录》云：至春末夏初，当就昭告，沈约宣旨，又请克日。 先生虽疏数日，而正拥四月八日丙寅也。 曜，既而复雨。 《本起录》云：乙丑夜凝云洒雨，朝廷深虑致疑。 诂朝迟明，登坛焚燎，受终礼毕，銮驾还官，百司陪庆。 冥夕之问，雨复滂沛。 朝廷怩腕，莫不谓天命矣。 梁武帝即位，弥加钦重。 使朱嗣之及舍人黄陆责劲至山，因召先生。 画二牛，一在野，甚自得，一衣以文绣，有人扣刀执绳以随。 帝日：是将学曳尾龟，宁有可致之理？ 乃与先生书日：今万乘为累，欲束向修弟子礼，其可得乎？ 因问享国之期日：吾历数奢促如何？ 先生启云：再环辰。 次又云：光武一去四八，今则直上七七，然后乘彼白云。 帝在祚四十九年，其预翰来兆，皆此类也。 先生眇寻上道，究括纲领，若梯景辔云之速，无加刀圭。 潜心注想，唯朱黄为阙。 营九转丹丹砂，雄黄最为主领。 于时后魏及宇文泰强盛，武都路梗，雄黄不可致也。 天监三年，夜梦有人云：丹亦可得作。 是夕帝亦梦人云：有志无具，於何轻举？ 式歌汉武帝。 久之方悟。",
      "translated_text": "Some abandoned their sick and cast aside the dead, leaving corpses unburied. The myriad people wailed in distress, their suffering exceeding even that of those mired in mud and ashes. When General Xiao Yan of the Eastern Expedition encamped at Stone Citadel, the righteous forces within the Eastern Wei’s Baota City wavered in hesitation. Observing the celestial signs, the Master discerned the turning of the times; gazing upon the hearts of the people, he pitied their suffering in the depths of calamity. Thus, he swiftly presented prophetic omens and sent letters to encourage and commend.\n\n*The Record of Origins* states: The Master had long noted the portents since the Yongyuan era. Upon hearing of the righteous army’s westward advance, he awaited its arrival day and night with eager anticipation. When it reached Xinlin, he immediately composed a missive in praise and dispatched his disciple Dai Mengzhi to deliver it by relay. The journey reached Zaojia Bridge, but the messenger could proceed no further. Later, upon ascending Stone Citadel, the Master sent Li Sigong to present a memorial, which was promptly answered. This occurred on the first day of the eleventh month. Though the imperial court remained heavily fortified, many, mindful of the Cui clan’s downfall, hesitated. The Master, however, remained unwavering, and all matters proceeded in orderly succession.\n\nDuring the investiture and abdication, Fan Yun and Shen Yue rode alongside to assist in the mandate, yet the name of the new dynasty remained undecided. The Master cited Wang Zinian’s *Returning Song*, which repeatedly spoke of \"water cleaving wood,\" and Wang Jun’s *Palindromic Divination*, both of which employed auspicious phrases. He further invoked three poems, all extolling the character *Liang* as the sign of the destined era. Indeed, all the prophetic omens concurred that *Liang* was the symbol of the mandate. When the time came for the proclamation, he again designated the bingyin day of the fourth month.\n\n*The Record of Origins* states: As spring gave way to early summer and the proclamation neared, Shen Yue announced the imperial decree and requested a fixed date. Though the Master had initially proposed a different day, he ultimately settled on the eighth day of the fourth month, bingyin. That evening, rain fell. *The Record of Origins* records: On the night of yichou, clouds gathered and rain drizzled, causing deep concern at court. By dawn, as the Master ascended the altar to kindle the sacred flames and complete the rites of succession, the imperial carriage returned to the palace, accompanied by the jubilant procession of officials. That very night, the rain poured down in torrents. The court sighed in awe, and none doubted the will of Heaven.\n\nAfter Emperor Wu of Liang ascended the throne, his reverence for the Master only deepened. He dispatched Zhu Sizhi and the palace attendant Huang Lu to the mountain with an urgent summons. The Master drew two oxen: one in the wild, content and free, the other adorned in embroidered robes, followed by a man wielding a knife and holding a rope. The Emperor remarked, \"Is this one to learn from the tortoise that drags its tail in the mud? How could such a creature be lured forth?\" He then wrote to the Master: \"Now that the burden of the imperial throne weighs upon me, I wish to become your disciple in earnest. Might this be possible?\" He further inquired about the duration of his reign: \"How long will my allotted span endure?\"\n\nThe Master replied, \"Twice the cycle of the celestial stems.\" Later, he added, \"Emperor Guangwu departed after forty-eight years; now, you shall ascend to seventy-seven before riding upon those white clouds.\" The Emperor reigned for forty-nine years, and all such foreknowledge proved true.\n\nThe Master diligently pursued the supreme Dao, mastering its essential principles with such swiftness that even the ascent of a ladder to the clouds or the reins of a chariot could not surpass it. His skill in medicine was unparalleled. He immersed himself in contemplation, with only cinnabar and orpiment as his gateways. In refining the nine-fold elixir of cinnabar, realgar was the chief ingredient. At that time, the Later Wei and Yuwen Tai were powerful, and the roads to Wudu were blocked, making realgar unattainable.\n\nIn the third year of the Tianjian era, the Master dreamed of someone saying, \"The elixir can still be made.\" That very night, the Emperor also dreamed of a figure who declared, \"With ambition but no tools, how can one act lightly?\" The verse echoed that of Emperor Wu of Han. Only after some time did he awaken to its meaning.",
      "overlap_context": "gnant women, slaughtered commoners, and ventured out nearly thirty times a month, with no fixed destination, driving his retinue northward in chaotic haste. When he was to depart for the suburbs at dawn, he would drive officials and clerks before him, filling the roads with clamor and shouts. Wherever the sound of drums was heard, people fled in terror. Those who offended him were slain on the spot. Craftsmen and merchants abandoned their trades, and firewood-gatherers dared not tread the paths.",
      "start_char": 6152,
      "end_char": 6918,
      "start_sentence": 325,
      "end_sentence": 363,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.552577257156372,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\华阳陶隐君内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "登使舍人黄陆告先生：想刀圭未就，三大丹有阙，宜及真人真心，无难言也。 先生初难之：吾宁学少君邪？ 帝复以梦旨告焉，乃命弟子陆逸冲、潘渊文开积金岭束，以为转炼之所，凿石通涧水束流矣。 先生以谓丹品，盖多黄帝九鼎九丹、 《登真隐诀》云：此方《泰清中经》而治变驳，非后人能究也。 王君虹景、 王君即清虚小有真人也。 左慈九华、 《真诰》日：左慈得炉火九华之益，即是也。 方未显於世。 五灵七变、神精召魂之属。 此例几三十许种，止还年及老远为地仙耳。 或方法舛略，难可凭用。 或品例卑近，不得高通。 前所列诸丹，皆泰清中小法，非上清太极。 冲虚控景之卫也。 复有二金液，亦营合有碍。 《登真隐诀》云．．一者太一金液，抱朴子所注。 此乃可就而阙在消石，兼无真人手迹，弥所未安。 二者即泰清金液，此乃安期所传，而用卤咸虏盥，此世难多，兼祭法用牢俎， 以为惮碍之也。 高真上法有四，而四药未显。",
      "translated_text": "The imperial messenger, Attendant Huang Lu, informed the Master: \"I surmise that the elixir of the knife-point has yet to be completed, and the three great elixirs remain deficient. It is fitting to speak frankly to a true person of true heart, for there should be no difficulty in doing so.\" The Master initially demurred: \"Would I rather follow the path of Shao Jun?\" The Emperor then revealed to him the purport of his dream, whereupon he commanded his disciples Lu Yichong and Pan Yuanwen to open the eastern slopes of Mount Jijin as a site for transmutation and alchemy, carving stone to channel the mountain stream’s eastward flow.\n\nThe Master observed that among the ranks of elixirs, the many methods—such as the Nine Tripods and Nine Elixirs of the Yellow Emperor, or those recorded in the *Dengzhen Yinjue* (which notes that this formula derives from the *Taiqing Zhongjing* but has undergone alterations and corruptions, rendering it beyond the grasp of later generations)—along with the Nine Flowers of Zuo Ci (as the *Zhen’gao* states: \"Zuo Ci attained the benefits of the furnace fire’s Nine Flowers,\" referring to this), remain obscure in the world. Others, such as the Five Spirits, Seven Transformations, and techniques for summoning the divine essence and calling forth the soul, number nearly thirty varieties, yet these serve only to restore youth and prolong life, achieving no more than earthbound immortality. Some methods are flawed or incomplete, rendering them unreliable. Others are of low rank and limited scope, incapable of attaining lofty transcendence. The elixirs previously listed are all minor techniques of the Taiqing tradition, not the supreme methods of the Shangqing or Great Ultimate. Even the Guardians of the Void and Controllers of the Luminous Essence do not partake of these.\n\nThere are, moreover, two Gold Liquids, though their preparation presents obstacles. As the *Dengzhen Yinjue* records: the first is the Great One’s Gold Liquid, annotated by the *Baopuzi*. This could be achieved were it not for the lack of nitre, and without the true person’s handwritten instructions, its reliability remains uncertain. The second is the Taiqing Gold Liquid, transmitted by Anqi, but it requires brine and refined salt, which are difficult to procure in quantity, and its ritual demands sacrificial vessels, posing further impediments. Among the supreme methods of the loftiest immortals, there are four, yet the four ingredients remain undisclosed.",
      "overlap_context": "xir of cinnabar, realgar was the chief ingredient. At that time, the Later Wei and Yuwen Tai were powerful, and the roads to Wudu were blocked, making realgar unattainable.\n\nIn the third year of the Tianjian era, the Master dreamed of someone saying, \"The elixir can still be made.\" That very night, the Emperor also dreamed of a figure who declared, \"With ambition but no tools, how can one act lightly?\" The verse echoed that of Emperor Wu of Han. Only after some time did he awaken to its meaning.",
      "start_char": 6918,
      "end_char": 7326,
      "start_sentence": 364,
      "end_sentence": 385,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.002623319625854,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\华阳陶隐君内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "世虽有其方，疑有假附。 琅讦渊重， 《登真隐》注具有其经□，是上清法。 曲晨精妙， 《登真隐诀》具有经方，是太极法。 二法非唯下识未敢措心，亦并须虏盐、消石，为难致也矣。 唯九转所用药石，皆可寻求。 制方之体，辞无浮长，历然可解，乃缄愿毕志。 《登真隐诀》云：九转神丹，升虚上经，是太极真人传长里先生，长里先生传西城总真王君，王君传太元真人也。 四年春，先生出居岭束，使王法明守上馆，陆逸冲居下馆，潘渊文、许灵真、杨超远从焉。 是岁有事于炉燧。",
      "translated_text": "Though formulas exist in the world, doubts persist of spurious attributions. The *Profound and Weighty* of Langxie, with its annotations in the *Dengzhen Yinjue*, records the scriptures of the Shangqing method. The *Exquisite and Subtle* of Quchen, also preserved in the *Dengzhen Yinjue*, contains the formulas of the Great Ultimate method. These two methods are not only beyond the grasp of lesser adepts, but both further require brine salt and nitre, which are difficult to obtain. Only the minerals and stones used in the Nine Cycles may be readily sought. The structure of its formula is concise, its words neither excessive nor verbose, and its meaning clear and comprehensible—thus one may seal one’s vow and devote oneself wholeheartedly.\n\nThe *Dengzhen Yinjue* states: the Nine-Cycled Divine Elixir, the *Ascending Void Scripture*, was transmitted by the Perfected of the Great Ultimate to Master Changli, who in turn transmitted it to Lord Wang, the Governor of All Perfected of Xicheng. Lord Wang then transmitted it to the Perfected of the Grand Prime. In the fourth year, Master Changli took residence east of the mountain range, entrusting Wang Faming with the care of the Upper Lodge, while Lu Yichong resided in the Lower Lodge, accompanied by Pan Yuanwen, Xu Lingzhen, and Yang Chaoyuan. That year, they tended to the furnace and crucible.",
      "overlap_context": "ted by the *Baopuzi*. This could be achieved were it not for the lack of nitre, and without the true person’s handwritten instructions, its reliability remains uncertain. The second is the Taiqing Gold Liquid, transmitted by Anqi, but it requires brine and refined salt, which are difficult to procure in quantity, and its ritual demands sacrificial vessels, posing further impediments. Among the supreme methods of the loftiest immortals, there are four, yet the four ingredients remain undisclosed.",
      "start_char": 7327,
      "end_char": 7562,
      "start_sentence": 386,
      "end_sentence": 396,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.778181076049805,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\华阳陶隐君内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "明年元日，开鼎无成。 《集卷》云：天监五年春正月旦开鼎，唯近上二黄轻华已飞，其余丹青始绿边焕赤也。 重九复燧，亟多不偶。 《本起录》云：九月九日复营，自起火鼎，多细坼，兼山中雷震，虑精华惊歇，更加补治，不敢烈火也。 限竟开鼎，复无成。 《本起录》云：年末限意开鼎，下鼎绕。 先生平居，凛然如斋戒。 自摄心转炼，弥能谨笃。 至於燃鼎，用阳燧日中取火，盖其精如此。 ．性少睡，未尝昼寝。 夜坐往往及晓。 常於月明读书，及是为积烟所熏。 《登真隐诀》云：四年初营，自起火至限竟，用盘谷糠几一千二百斛。 药屋入夜复虑精物干触，叉宜闭户，其烟气蓬勃可知矣。 火下欲不见字，帝知之，送波律烛。 《集卷》云：波律，外国香名，烧此可 以明目也。 先生以为营非常事，宜声迩旷绝，而此山密迩朝市，岩林浅近，人人皆云有望，是丹家酷忌。 《登真隐诀》云：此事朝野声迩显着，人人皆有望，此最犯戒忌之大也。 姑改服易氏，遐遁束迈。 当去建晋中，以其山海深旷，民不知道，见所云为，无关视听。 吾若委形枕杖，非不可为，是独济小道。 委形枕杖，此尸解下法，盖不得旋及故乡，无由更议营合。 若脱尔便逝，不可以为教迩。 乃以意启梁武，梁武难之。 《集卷》有帝答书，知欲徙卜，想谘请幽胜，谋及着龟，但迁徒之日为当使人，为当使鬼，犹蹑踏因地，其不灭也。 先生撰意直往，不复疑异。 唯是心计，旁无知觉。",
      "translated_text": "The following New Year’s Day, the crucible was opened without success. The *Collected Scrolls* states: In the fifth year of Tianjian, on the first day of the first lunar month, the crucible was opened—only the two uppermost yellow essences had lightly sublimated, while the remaining elixir’s verdant edges had just begun to glow crimson. On the Double Ninth, the furnace was relit, but the process repeatedly failed to align. The *Record of Origins* states: On the ninth day of the ninth month, the furnace was rekindled; from the moment the fire was lit, the crucible developed many fine cracks. Moreover, thunder shook the mountains, raising concerns that the essence might be startled and dissipate. Thus, further refinements were made, and the fire was not dared to burn fiercely. When the allotted time expired and the crucible was opened again, there was still no success. The *Record of Origins* states: At the year’s end, the crucible was opened as the deadline arrived, and the lower crucible had cracked.\n\nIn his daily life, the Master maintained a solemn demeanor, as if perpetually in purification. From the moment he began to refine his mind and conduct further alchemy, his vigilance only deepened. When lighting the crucible, he used a yang-burning mirror to kindle fire from the sun at midday—such was the precision of his devotion. By nature, he slept little and never napped during the day. At night, he would often sit until dawn. He was accustomed to reading by moonlight, but by this time, he had been so thoroughly smoked by the fumes. The *Dengzhen Yinjue* states: From the initial firing in the fourth year until the deadline expired, nearly twelve hundred *hu* of husks from Pangu Valley were consumed. At night, the elixir chamber was sealed to prevent the essence from being disturbed by dryness or contact, and thus the billowing smoke can well be imagined. When the fire below made it impossible to see the characters, the Emperor learned of this and sent *bolü* candles. The *Collected Scrolls* states: *Bolü* is the name of a foreign incense; burning it can brighten the eyes.\n\nThe Master believed that such an undertaking was no ordinary matter and required absolute seclusion, far from the noise of the world. Yet this mountain lay perilously close to the imperial court and the bustling market, its groves and forests too shallow and near—everyone spoke of it with expectations, which alchemists strictly forbid. The *Dengzhen Yinjue* states: This matter had become widely known in both court and countryside, with everyone harboring hopes—this was the greatest violation of taboo. Thus, he temporarily changed his surname to Yi and withdrew, journeying far to the east. He considered settling in central Jianjin, where the mountains and seas were vast and remote, and the people, unversed in the Dao, would regard his work as inconsequential, paying it no mind. \"If I were to feign death and depart,\" he thought, \"it would not be impossible—but that would only serve a minor path.\" Feigning death and departing refers to the lower method of *shijie* (corpse liberation), which would prevent him from returning to his homeland and preclude any further refinement of the elixir. Yet if he were to vanish abruptly, it could not serve as a teaching for posterity.\n\nThus, he petitioned Emperor Wu of Liang with his intentions, but the Emperor found it difficult to comply. The *Collected Scrolls* contains the Emperor’s reply, acknowledging his desire to relocate and seek a secluded site, consulting oracles and divination to determine whether the move should be carried out by men or by spirits. Yet even then, the Emperor hesitated, bound to the land, unable to let go. The Master, however, resolved to proceed directly, harboring no further doubts. Only in his heart did he calculate the way forward—no one else was aware.",
      "overlap_context": " by the Perfected of the Great Ultimate to Master Changli, who in turn transmitted it to Lord Wang, the Governor of All Perfected of Xicheng. Lord Wang then transmitted it to the Perfected of the Grand Prime. In the fourth year, Master Changli took residence east of the mountain range, entrusting Wang Faming with the care of the Upper Lodge, while Lu Yichong resided in the Lower Lodge, accompanied by Pan Yuanwen, Xu Lingzhen, and Yang Chaoyuan. That year, they tended to the furnace and crucible.",
      "start_char": 7562,
      "end_char": 8169,
      "start_sentence": 397,
      "end_sentence": 424,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.142077684402466,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\华阳陶隐君内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "称静斋五旬，一皆断绝。 乃以夜半出山，天大晦冥，人莫能见。 负岌以从者二人，改名氏日王整官、称外兵。 真人所为，非几识所辨。 此名氏官位当有玄旨耳。 初欲入刻，或度天台，至浙江，值潮波甚恶，乃上束阳，仍停长山。 闻南路有海掠不可行，稍进赤岩，宿瞿溪石室，梦人告云：欲求还丹，三永之问。 乃自思惟，知是永嘉、永宁、永康之际。 先生初造朱阳，创立基址，在永明、永泰、永元之中。 今梦旨当指此耳。 若是永嘉、永宁、永康，何营理之不证耶？ 因是出访，村人咸云：过此室，上百余里，至永康兰中山，最为高绝。 诘朝乃往经纪，山良可居，唯田少无议聚糠。 《集卷》云：此土居人合把稻，旦旦梼春，以给日用，收糠不可得也。 后入楠溪青幛山，爱其稻田，乃居。 会荒俭连岁不谐，兼寇掠充斥。 《集卷》云：先生因以此行皆不偶，自绿海数郡，从来晏如，二三年来无山不寇，先生亦仪田自作，复值岁饥。 乃日：尝闻《五岳图》云：霍山是司命府，必神仙所都。 《名山记》云：霍山在罗江县，高三千四百丈，上方八百里，束卿司命茅君所居。 乃自海道往焉，过牛岑，出海口，束望扶桑，乃慨然叹日：所谓观海难为水，游圣难为言。 平生侠无学而不学，今日一皆休矣。 霍山连略当六七百里，隐隐如阵云。 岩愕惊拔，特异他处。 先生足蹑真境，心注玄关，大有灵应感对，事秘不书。 亦人稀田寡，复以无糠为患。 《集卷》云：先生深历四面，无议投足。 复自海道还永嘉，至太溜，形势殊好。 《登真隐诀》云：壬辰年六月便乘海还永嘉木溜屿，乃大有古旧田摭，孤．立海中，都无人居，甚可营合。 会上使司徒慧明迎还旧岭。 《登真隐诀》云：八月至木溜，见其可居，始上岸起屋。 十月司徒慧明至，于时愿得且停木溜，与慧明商榷，往复积日，永不敢许，於是相随而还也。 道中书劫相望，仍欲先生至都下。 先生至晋陵，辞以疾，乃还华阳。 上使营朱阳绾以居，先生三让之，诏不从。 《登真隐诀》云：甲午年劲买故许长史宅、宋长沙馆，仍使潘渊文与村官师匠营起朱阳馆。 自於馆束建药屋静院，云蹑玄洲之迹。 《登真隐诀》云：昔李明於此下合九鼎丹，以外玄洲发掘基址，屡得破瓦器，乃其旧用。 自南霍还，鼎事累营，皆不谐。 乃非都无彷佛，每开鼎，皆获霜华。 门人会谓此为成，先生验丹家说，云：琅讦丹成，其飞华光彩三十七种； 曲晨丹成，其飞华百杂乱色，光照流焕，玄黑徘徊； 太清金液丹成，其飞华状奔月坠星，云绣九色，其气似紫华之见太阳，其精似青大之映景云； 九转丹成，则飞精九色，流光焕明，不尔未成也。 累年所得，皆轻华霏霏，或光明廉棱如霜雪，无杂色。 十八年所获严锷，光华过於前者，皆似五六出华，剑锋鸩齿，而下滓枯磕浃黑，碎之如星，焚作朱黄烟黑。 当犹火势或羸或猛，朱黄不得飞书。 时有邓郁之居南岳， 《登真隐诀》云：宜都夷陵人，天监四年湘州刺史杨公则携下都启闻进见，权住蒋山，后劲给九转药具，令还山营合。 劫给九转丹具，令营合。 限竟开鼎，上有钟乳，霜雪，光明照耀，永无杂色。",
      "translated_text": "Having maintained stillness in his retreat for fifty days, he severed all ties. Then, at midnight, he departed from the mountain—so dark was the sky that no one could see him. With two attendants bearing his belongings, he altered his name and rank to Wang Zhengguan, styling himself \"External Soldier.\" The actions of a Perfected One are beyond the discernment of ordinary minds; these names and titles must surely carry some profound significance.\n\nInitially intending to travel to Kuaiji or perhaps cross to Tiantai, he reached the Zhe River, where the tidal waves were fierce. Thus, he turned upstream to Shuyang and stayed briefly at Changshan. Hearing that the southern route was plagued by maritime raids, he advanced to Chiyan, lodging in a stone chamber by Quxi Stream. There, he dreamed of a voice saying: *\"If you seek the returning elixir, seek it between the Three Yong.\"* Reflecting upon this, he realized it referred to Yongjia, Yongning, and Yongkang. Earlier, when he first established his foundation at Zhuyang, it had been during the reigns of Yongming, Yongtai, and Yongyuan. The dream’s message must point to this very place. Yet if it meant Yongjia, Yongning, and Yongkang, why had his efforts there yielded no fruition? Setting out to investigate, villagers all told him: *\"Beyond this chamber, a hundred li uphill lies Lanzhong Mountain in Yongkang—its peaks are the most secluded and lofty.\"* The next morning, he went to survey the site. The mountain was indeed habitable, though the fields were sparse and gathering husks for fuel would be impossible. The *Collected Scrolls* notes: *\"The locals here must husk rice daily to sustain themselves, leaving no chaff to spare.\"*\n\nLater, he entered Qingzhang Mountain in Nanxi, drawn by its rice fields, and settled there. Yet famine and banditry plagued the land for years, disrupting his plans. The *Collected Scrolls* records: *\"This journey of his met with no fortune. Though he had traversed several coastal commanderies without incident, in recent years, no mountain was free of bandits. He tilled his own fields, only to face years of famine.\"* He then declared: *\"I once read in the* Five Marchmounts Atlas *that Mount Huo is the Bureau of Destiny, surely a dwelling place for immortals.\"* The *Record of Famous Mountains* states: *\"Mount Huo lies in Luojiang County, rising 3,400 zhang, its summit spanning 800 li. Here, the Eastern Minister of Destiny, Lord Mao, resides.\"* Thus, he set out by sea, passing Niucen and emerging at the river mouth. Gazing east toward Fusang, he sighed deeply: *\"As the saying goes, ‘Having seen the sea, all other waters seem small; having met a sage, all other words seem shallow.’ All my life, I have pursued every learning—today, I abandon it all.\"*\n\nMount Huo stretched six or seven hundred li, its peaks shrouded in clouds like ranks of soldiers. Its cliffs were jagged and towering, unlike any other place. The Master’s steps trod upon this sacred ground, his heart fixed upon the Mysterious Pass, and profound spiritual responses arose—yet these matters remain unrecorded. The land was sparsely populated, and again, the lack of husks posed a problem. The *Collected Scrolls* observes: *\"He traversed the region thoroughly, finding nowhere to settle.\"* He then returned by sea to Yongjia, reaching Tailiu, where the terrain seemed most auspicious. The *Hidden Instructions on Ascending Perfection* notes: *\"In the renchen year, sixth month, he sailed back to Yongjia’s Muliu Islet, where ancient fields lay abandoned. The islet stood alone in the sea, uninhabited, yet ideal for refinement.\"*\n\nJust then, the imperial envoy, Minister of Works Huiming, arrived to summon him back to his former mountain. The *Hidden Instructions* records: *\"By the eighth month, he reached Muliu, saw its potential, and began building a hut ashore. In the tenth month, Minister Huiming arrived. The Master wished to remain at Muliu temporarily to discuss matters, but after days of deliberation, Huiming refused. Thus, he accompanied him back.\"* Along the way, bandits were rampant, and the court pressed for the Master to proceed to the capital. Upon reaching Jinling, he pleaded illness and returned to Huayang. The court ordered the construction of Zhuyang Lodge for his residence, but he declined three times. The decree remained firm. The *Hidden Instructions* states: *\"In the jiawu year, he purchased the former residence of Prefect Xu and the Changsha Lodge of the Song, then had Pan Yuanwen and local officials oversee the construction of Zhuyang Lodge. Within the lodge, he built an eastern elixir chamber and a stillness courtyard, claiming to follow the traces of the Mysterious Continent.\"* The *Hidden Instructions* further notes: *\"Long ago, Li Ming refined the Nine-Cauldron Elixir here. Excavating the foundation revealed fragments of old pottery—his former implements.\"*\n\nSince his return from southern Huo, he had repeatedly attempted the cauldron work, but none succeeded. Yet it was not entirely without resemblance: each time he opened the cauldron, frost-like flowers appeared. His disciples believed this signaled success, but the Master, consulting alchemical texts, explained: *\"When the Langgan Elixir is complete, its flying flowers display thirty-seven hues; when the Quchen Elixir is complete, its flying flowers shimmer with a hundred chaotic colors, their radiance flowing and dazzling, dark and profound. When the Great Clarity Golden Liquid Elixir is complete, its flying flowers resemble shooting stars or the moon’s descent, their nine-colored clouds embroidered, their vapor like purple blossoms under the sun, their essence like azure mist in the light. When the Nine-Transmutation Elixir is complete, its flying essence gleams in nine colors, its radiance brilliant—otherwise, it is not yet achieved.\"* Over the years, what he obtained were only light, frosty flowers, their edges sharp as frost or snow, devoid of mixed hues. In the eighteenth year, he produced a substance of stern hardness, its brilliance surpassing previous attempts—yet it resembled only the fifth or sixth stage of flowering, like a sword’s edge or a vulture’s fang. The residue below was dry and black, crumbling like stars, burning with crimson and yellow smoke. The fire’s intensity varied, sometimes weak, sometimes fierce, and the crimson-yellow never ascended to form script.\n\nAt this time, Deng Yu lived on Mount Heng. The *Hidden Instructions* records: *\"A native of Yidu in Yiling, he was brought to the capital by Yang Gongze, Governor of Xiangzhou, in the fourth year of Tianjian. He resided temporarily on Mount Jiang and was later granted the implements for the Nine-Transmutation Elixir, ordered to return to the mountain to refine it.\"* The court provided him with the tools for the Nine-Transmutation Elixir. When the time came to open the cauldron, it contained stalactites, frost, and snow—its radiance dazzling, utterly free of杂色.",
      "overlap_context": " but the Emperor found it difficult to comply. The *Collected Scrolls* contains the Emperor’s reply, acknowledging his desire to relocate and seek a secluded site, consulting oracles and divination to determine whether the move should be carried out by men or by spirits. Yet even then, the Emperor hesitated, bound to the land, unable to let go. The Master, however, resolved to proceed directly, harboring no further doubts. Only in his heart did he calculate the way forward—no one else was aware.",
      "start_char": 8169,
      "end_char": 9416,
      "start_sentence": 425,
      "end_sentence": 474,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.289265632629395,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\华阳陶隐君内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "邓不以献奉，自饵之， 丹经说云：乙未正月开鼎。 云上有钟乳霜雪，下滓作九，紫黑色，多分人服之，而飞华都不与人，亦无献奉，独将往南岩问，一皆藏之也。 乃云病。 病八日，云是夕衡岳本风雪，忽暂明朗。 《登真隐诀》云：邓先生初云颜色如故，后三日安与中停置，积日尸不毁坏。 丹诀云：丹成无杂光彩，是毒丹，饵当暂死，须臾起去。 丹经云：丹数限未，色诊不全，皆名毒丹。 故《太清》云：顿服一两，亦即暂死。 昔魏伯阳与弟子合丹成，共一人服，服亦死。 余人行走，比还，，已去也。 先生有乘云御龙心。 自云年十二时，於渠阁法书中见郡惜以黄素写太清诸丹法，乃圻然有志。 及年二九，授上道，见上清太极法，遂鄙而不为，奚昆饵毒丹求遁去乎？ 累年所得，一皆埋藏。 而十八年飞华虽无杂色，光彩特异，欲试作黄白，以验成否。 丹经云：取铅十斤着铁器中，猛火煎之三沸，投丸转之华一铢於铅中搅之，须央立成黄金也。 是夕摄心乞感，忽见有人来，朦胧如烟云中，语云：不须试，试亦不得，今人多贪。 忽闻金玉可作便求，竟毁天禁，正此是成，但未都具足。 仍复作叹声，云：世中岂复有白日升天人？ 渐服自可知。 言讫，飒然束去。 於是乃不试。 先生常云：去世之日如茅太元之发咸阳， 《太元真人传》云：真人发咸阳时，约亲友乡人其日皆至，有珍骰异乐自空虚而至，既而从千乘万骑，而南人皆瞻睹也。 赵广信之翕刻白。 葛稚川《神仙传》云：赵广信於刻白山白日升天。 欲以晓悟迷方，永题竹史。 从来感遇，正恐挺运漕嘿，不得从志。 至是乃叹曰：昔闻幽说，云仙障有九，名居其一。 使吾不白日登晨者，盖三朝有浮名乎？ 南真高尊既非轻举， 南真，紫虚元君魏夫人也。 以夜半解化矣，o 小缘萧邈复是变解， 小据，许长史子玉斧也，因礼拜乃变逐。 玄师旧辙，诚宜仰遵也。 普通五年，复涂鼎起火。 明年正旦甲子开鼎，光黑照烛，动心焕目，形质似前者，而加以彩虹杂色。 始天监四年初有志於此，及是凡七营乃成。 先是，吏部尚书谢览梦人告曰：华阳先生得道，未久职位且掌录籍。 无几何，有女子侄钱亦居华阳，师事先生，授经及符图。 忽一日辞，先生问何之？ 钱曰：上宾于金阙。 先生曰：吾门人先吾去者数矣。 钱曰：师当为蓬莱都水监。 先生乃过岭送之，因赠诗云云。 先生晚岁眸子忽尔正方，",
      "translated_text": "Deng did not offer it in tribute but consumed it himself. The *Elixir Canon* states: *\"In the first month of the yiwei year, the cauldron was opened.\"* Above it were stalactites and frost-like snow, while the residue below formed nine layers of purple-black hue. Most who ingested it did so, yet the flying blossoms were given to no one, nor were they offered in tribute. He alone took them to the Southern Cliff to inquire, then concealed them all. Soon after, he fell ill. For eight days, he ailed, and on that evening, the winds and snows of Mount Heng suddenly cleared, revealing a momentary brightness.\n\nThe *Hidden Instructions* records: *\"At first, Master Deng’s complexion remained unchanged, but after three days, he lay still as if in repose, and over time, his body did not decay.\"* The *Elixir Formula* states: *\"When the elixir is complete and free of杂色 radiance, it is a toxic elixir—ingesting it causes a temporary death, from which one revives after a moment.\"* The *Elixir Canon* says: *\"If the elixir’s cycle is incomplete or its color imperfect, it is called a toxic elixir.\"* Thus, the *Great Clarity* warns: *\"Even a single liang, taken all at once, will cause a temporary death.\"* In ancient times, Wei Boyang and his disciples compounded an elixir, and one who consumed it died. The others departed, and upon their return, he had already gone. The Master harbored the heart of one who rides clouds and mounts dragons.\n\nHe once said: *\"At the age of twelve, while perusing the scriptures in the archives, I chanced upon a text copied on yellow silk by a certain Jun Xi, detailing the various elixir methods of the Great Clarity. From that moment, my resolve was firmly set.\"* When he reached eighteen, he received the supreme Dao and beheld the methods of the Supreme Clarity and Great Ultimate. He then scorned them and did not practice, so why would he now consume a toxic elixir to escape? All he had accumulated over the years, he buried and concealed.\n\nYet after eighteen years, though the flying blossoms bore no杂色, their radiance was extraordinary. He wished to test them by transmuting base metals into gold and silver to verify their efficacy. The *Elixir Canon* states: *\"Take ten jin of lead, place it in an iron vessel, and heat it fiercely until it boils thrice. Then add one zhu of the transmuting blossom to the lead and stir—immediately, it will become gold.\"* That evening, as he focused his mind in prayerful entreaty, he suddenly saw someone approach, shrouded as if in mist and clouds, who spoke: *\"Do not test it. Even if you do, you will not succeed. People today are too greedy—the moment they hear of gold and jade, they seek to make them, violating heavenly prohibitions. This is indeed a success, but it is not yet complete.\"* The figure then sighed and said: *\"Are there still those in the world who ascend to heaven in broad daylight?\"* Gradually, he added: *\"You will know through your own ingestion.\"* With these words, the figure vanished like a gust of wind. Thereafter, the Master did not attempt the test.\n\nThe Master often said: *\"The day of my departure will be like Mao Taiyuan’s departure from Xianyang.\"* The *Biography of the Perfected of Great Primordial* records: *\"When the Perfected departed from Xianyang, he arranged to meet his relatives and fellow villagers on that day. Precious feasts and wondrous music descended from the empty sky, and he then ascended with a thousand chariots and ten thousand riders, visible to all in the south.\"* And like Zhao Guangxin’s ascent at White Cliff. Ge Zhichuan’s *Biographies of Divine Transcendents* states: *\"Zhao Guangxin ascended to heaven in broad daylight at White Cliff Mountain in Kuaiji.\"* He wished to awaken the deluded and leave his name forever in the bamboo annals. Yet he lamented: *\"From the beginning, I feared that fate might be unkind and my aspirations unfulfilled.\"* At last, he sighed and said: *\"I once heard a secret teaching that there are nine obstacles to transcendence, and my name is among them. If I do not ascend at dawn in broad daylight, is it because my reputation in the mortal world still lingers?\"*\n\nThe Southern Perfected, the Venerable One, did not ascend lightly—for the Southern Perfected is the Lady Wei, Purple Void Primordial, who dissolved her form at midnight. As for the minor karmic ties, Xiao Miao’s transformation was also a dissolution. Xiao Ju, the son of Director Xu Yufu, transformed only after paying homage. The old path of the Mystic Master is truly one to be revered and followed.\n\nIn the fifth year of Putong, he again applied cinnabar to the cauldron and kindled the fire. On New Year’s Day of the following year, the jiazi day, the cauldron was opened. Its black radiance illuminated all, startling the heart and dazzling the eyes. The substance resembled the earlier one but was adorned with rainbow杂色. From the fourth year of Tianjian, when he first set his mind to this, until now, he had refined it seven times before it was complete.\n\nEarlier, the Minister of Personnel, Xie Lan, dreamed that someone told him: *\"The Master of Huayang has attained the Dao. Soon, his office will be to oversee the registers of immortals.\"* Not long after, a female relative named Qian, who also dwelled in Huayang, became the Master’s disciple, receiving scriptures and talismans. One day, she suddenly took leave. The Master asked where she was going, and Qian replied: *\"To become an honored guest in the Golden Towers.\"* The Master said: *\"Several of my disciples have already preceded me.\"* Qian said: *\"You will be the Supervisor of Waters for Penglai.\"* The Master then crossed the ridge to see her off and presented her with a poem.\n\nIn his later years, the Master’s pupils suddenly became square.",
      "overlap_context": "s* records: *\"A native of Yidu in Yiling, he was brought to the capital by Yang Gongze, Governor of Xiangzhou, in the fourth year of Tianjian. He resided temporarily on Mount Jiang and was later granted the implements for the Nine-Transmutation Elixir, ordered to return to the mountain to refine it.\"* The court provided him with the tools for the Nine-Transmutation Elixir. When the time came to open the cauldron, it contained stalactites, frost, and snow—its radiance dazzling, utterly free of杂色.",
      "start_char": 9416,
      "end_char": 10363,
      "start_sentence": 475,
      "end_sentence": 522,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.122116088867188,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\华阳陶隐君内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "《紫阳周君传》云：君常於市中遇黄泰者，见其眸子正方，乃知是仙人，因求乞长生之衍，乃自云是玄洲上卿苏君也。 或云眸子方，寿万岁。 顾吗皆有奇异光象。 文章气调，弥更英逸。 所居楼，虽入室弟子不许窥伺也，。 在世八十一年，以梁大同二年丙辰三月十二日癸丑解驾违世。 其曰请朝作告逝篇，示其门人， 其篇云云，具集中。 巳时恬然乃去，支体柔弱，颜色不变，异香奇灵缭绕山谷。 将敛，乃见空衣。 变解之道，初宛然见尸存，存未几，但冠剑及空衣存耳。 十四日定虚柩於雷平山。 梁武帝谧日贞白先生。 先生以犹子松乔为嗣，仍居华阳。 先生在世所着书： 《学花》一百卷 《孝经论语序注》十二卷 《三礼序》一卷．《汪尚书毛诗序》一卷 《孝子内外集》四卷《玉匮记》三卷 《三国志赞述》一卷 《抱朴子注》二十卷 《世语阙字》二卷《古今州郡记》三卷 《续临川康王世说》二卷 《撰太公孙昊书略注》二卷 《员仪集要》三卷 《七曜新旧术数》二卷 《风雨水旱饥疫占要》一卷 《卜筮略要》一卷《灵奇秘奥》一卷 《举百事吉凶历》一卷 《算数艺术杂事》一卷 右一百六十六卷 先生在山所着书： 《登真隐诀》二十四卷《真绌婴十卷 《本草经注》七卷《肘后百一方》三卷 《梦书》一卷《效验施用药方》五卷 《集金丹黄白方》一卷 《服云母诸石方》一卷 《服食草木杂药法》一卷 《断谷秘方》一卷 《消除三尸要法》一卷 《服气导引》一卷 《人问却灾患法》一卷 右五十七卷",
      "translated_text": "*The Record of Master Zhou of Ziyang* states: The Master once encountered Huang Tai in the marketplace and, seeing his square pupils, knew him to be an immortal. He thus sought the transmission of the arts of longevity, whereupon Huang revealed himself as Lord Su of the Upper Realm of Xuanzhou. Some say that those with square pupils live ten thousand years. His gaze and voice were accompanied by strange and wondrous radiance. His literary style and bearing grew ever more refined and transcendent. Though he dwelt in a tower, even his disciples were forbidden to peer inside. He lived in the world for eighty-one years and departed this life on the twelfth day of the third month, the *guichou* day, in the second year of Datong of the Liang (536 CE). That morning, he composed a farewell address to announce his passing, which he presented to his disciples—the text is preserved in the collected works. At the *si* hour, he departed in perfect serenity, his limbs supple, his complexion unchanged, while rare fragrances and numinous vapors filled the mountains and valleys. When his disciples prepared to enshroud him, they found only his empty robes. In the initial stages of his transformation, his body appeared intact, but before long, only his cap, sword, and empty garments remained. On the fourteenth day, his empty coffin was interred at Leiping Mountain. Emperor Wu of Liang posthumously honored him as *Master of Integrity and Purity*. The Master designated his nephew Songqiao as his heir, who continued to reside in Huayang.\n\nWorks composed by the Master during his lifetime:\n- *The Flower of Learning* (100 juan)\n- *Prefaces and Commentaries on the Classic of Filial Piety and the Analects* (12 juan)\n- *Preface to the Three Ritual Classics* (1 juan)\n- *Preface to the Shangshu and Mao’s Poetry* (1 juan)\n- *Inner and Outer Collections of Filial Sons* (4 juan)\n- *Records of the Jade Casket* (3 juan)\n- *Eulogies on the Records of the Three Kingdoms* (1 juan)\n- *Commentary on the Baopuzi* (20 juan)\n- *Omissions in the Tales of the World* (2 juan)\n- *Records of Ancient and Modern Provinces and Commanderies* (3 juan)\n- *Continuation of the Anecdotes of Prince Kang of Linchuan* (2 juan)\n- *Brief Commentaries on the Books of the Grand Duke, Sun, and Wu* (2 juan)\n- *Essentials of Etiquette* (3 juan)\n- *New and Old Methods of the Seven Luminaries* (2 juan)\n- *Essentials for Divining Wind, Rain, Drought, Famine, and Pestilence* (1 juan)\n- *Essentials of Divination* (1 juan)\n- *Mysteries of the Numinous and Wondrous* (1 juan)\n- *Calendar of Auspicious and Inauspicious Days for All Affairs* (1 juan)\n- *Miscellaneous Arts of Calculation* (1 juan)\n*(Total: 166 juan)*\n\nWorks composed by the Master in the mountains:\n- *Hidden Instructions for Ascending to Perfection* (24 juan)\n- *True Writs and Embryonic Essentials* (10 juan)\n- *Commentary on the Classic of Materia Medica* (7 juan)\n- *One Hundred and One Emergency Remedies* (3 juan)\n- *Book of Dreams* (1 juan)\n- *Tested and Effective Prescriptions* (5 juan)\n- *Collected Methods for Golden Elixirs and Transmuting Cinnabar* (1 juan)\n- *Methods for Ingesting Mica and Various Stones* (1 juan)\n- *Methods for Ingesting Herbs and Miscellaneous Medicinals* (1 juan)\n- *Secret Methods for Abstaining from Grains* (1 juan)\n- *Essential Methods for Eliminating the Three Worms* (1 juan)\n- *Methods for Ingesting Qi and Guiding the Body* (1 juan)\n- *Methods for Averting Disasters Among Humans* (1 juan)\n*(Total: 57 juan)*",
      "overlap_context": "n Huayang, became the Master’s disciple, receiving scriptures and talismans. One day, she suddenly took leave. The Master asked where she was going, and Qian replied: *\"To become an honored guest in the Golden Towers.\"* The Master said: *\"Several of my disciples have already preceded me.\"* Qian said: *\"You will be the Supervisor of Waters for Penglai.\"* The Master then crossed the ridge to see her off and presented her with a poem.\n\nIn his later years, the Master’s pupils suddenly became square.",
      "start_char": 10363,
      "end_char": 11027,
      "start_sentence": 523,
      "end_sentence": 565,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.935567617416382,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\华阳陶隐君内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "齐梁间侯王公卿从先生授业者数百人，一皆拒绝，唯徐勉、江佑、丘迟、范云、江淹、任防、萧子云、沈约、谢沦、谢览、谢举等，在世日早申拥簪之礼，绝迩之后提引不已？ 沈约尝因疾，遂有挂冠志。 疾愈，复留连簪绂。 先生封前书以激其志，约启云：上不许陈乞。 先生叹日：此公乃尔赛簿。 夫乐锺鼎者，以岩谷为槟逐。 恋山林者，视绂冕为桂桔。 若论臻其微，锺鼎不及岩谷，明矣。 胁肩於荣辱之途，翘足於罗网之问，与夫啸傲林泽，咀嚼芝木，可同日而言？ 即以沈休文之贵盛，先生欺为赛薄，是知道德贵矣。 唯奇谢览。 览年少自疑寿不永，先生曰：我在此，不使君子如此也。 先生作浑天象，高三尺许，天转地静，列宿度数，七曜行道，昏明中星，见伏早晚，以机转之，宛与天会。 云修道所须，非史官家事。 又因流水作自然漏刻，十二时循环自转，无劳守视。 先生冲深粹和，性不严毅，小大见之皆圻然乐悦，而真仪灵黑，自令人畏服。 门人承奉祇肃，有如宫廷。 入山之后，巾褐未尝离体。 每云：人之禀挺，命录实自悬天。 桐相之弃舍王宫，文成之褫斥侯服，三茅之违视绝胤，二许之遗室槟形，未必正由识见，兼是为运所引。 我从来遇诸机际，并几成而失。 永明中五过启禄，得辄差舛。 若不尔，岂得今日之事。 身中既有仙相，益使人守信弥笃。 而思识精深，凡所寻阅，皆人不至。 尤好五行、阴阳、风角、黑候、太一、遁甲、星历、算数、山川、地理、方国、物产，及医方、香药、分剂、虫乌、草木，考校名类，莫不毕该。 常言、我自不能为仲尼，而能教人作仲尼。 犹如管仲不能自霸，能使齐桓霸也。 华阳陶隐居内传卷中竟 华阳陶隐居内传卷下",
      "translated_text": "During the Qi and Liang dynasties, hundreds of marquises, kings, dukes, and high ministers sought to study under the Master, yet he rejected them all. Only Xu Mian, Jiang You, Qiu Chi, Fan Yun, Jiang Yan, Ren Fang, Xiao Ziyun, Shen Yue, Xie Lun, Xie Lan, and Xie Ju—those who had early in life offered him the homage due a master—continued to receive his guidance even after his retreat from the world. Once, when Shen Yue fell ill, he resolved to resign his office and withdraw from public life. Upon recovering, however, he lingered on in his official post. The Master sent him a letter to rekindle his resolve, to which Shen replied: \"My superiors have not granted my request to retire.\" The Master sighed and said, \"This man is truly shallow and insubstantial. Those who delight in bells and tripods regard mountain valleys as places of exile, while those who cherish forests and streams see caps and sashes as fetters and shackles. If one probes to the subtleties, it is clear that bells and tripods cannot compare to mountain valleys. To cringe on the path of honor and disgrace, to tread within the snares of the world—how can this be mentioned in the same breath as roaming freely through groves and marshes, chewing on magic herbs and trees? Even with Shen Xiwen’s exalted rank, the Master still deemed him shallow, for he knew the true value of the",
      "overlap_context": "ested and Effective Prescriptions* (5 juan)\n- *Collected Methods for Golden Elixirs and Transmuting Cinnabar* (1 juan)\n- *Methods for Ingesting Mica and Various Stones* (1 juan)\n- *Methods for Ingesting Herbs and Miscellaneous Medicinals* (1 juan)\n- *Secret Methods for Abstaining from Grains* (1 juan)\n- *Essential Methods for Eliminating the Three Worms* (1 juan)\n- *Methods for Ingesting Qi and Guiding the Body* (1 juan)\n- *Methods for Averting Disasters Among Humans* (1 juan)\n*(Total: 57 juan)*",
      "start_char": 11027,
      "end_char": 11688,
      "start_sentence": 566,
      "end_sentence": 595,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.297346591949463,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\华阳陶隐君内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "薜萝孺子贾嵩集 宋宣和封诰 朕膺琅霄之景命，握龙汉之宝符，盖将敷畅灵音，恢隆道化，阐微言於至教，荐休命于列真。 蓬莱都水监陶隐居振边荣罗，擢精华阙，神交无累，迩虽相於山中，诚感夙通，赋已仙於海上。 顾德名之莫拟，岂妙瘾之敢忘。 尚都显号之荣，永介涵生之祉。 可特封宗元翎教真人。 解真碑铭 邵陵王萧纶撰 夫夜光结绿，非肪筐之恒珍； 逸羽翔鳞，岂园池之近玩？ 宁期心於远大，盖不知其所以然也。 是以颖阳高蹈，洗耳於唐朝； 汉阴贞栖，灭迹於周代。 盛德流风，有自来矣。 应期而曜质者，其在兹乎？ 先生名弘景，字通明，本冀州平阳人。 其先出自帝尧陶唐氏之后，尧治冀州平阳，故因居此。 龙马见五色之符，钦明表八采之瑞。 光被于天下，允厘於庶职。 洪源厦远，系绪绵长。 汉兴，舍为高祖右司马。 子青翟，位至丞相。 后汉末南渡，始居丹阳。 七世祖浚，仕昊为镇南将军、刻州刺史。 祖隆，宋南中郎、参军事。 父贞宝，司徒建安王国侍郎，并立履清约，博涉文史。 先生含元精之和气，蓄浚讽之雅资，兼宣七善，总修九德，行仁蹈义，岳峙渊停，墙仞无以睹，清浊不能测，道风与星汉同高，胜气与烟霞共远。 六岁便解书，能属文。 七岁读《孝经》、《毛诗》、《论语》数万言。 曼倩幼习坟典，公干少读诗赋。 方之於古，彼有多惭。 是以岐疑流声，中黄着颂。 有乡人得葛洪《神仙传》，见淮南八公诸仙事，乃叹日：读此书使人有波云之气。 於是寝兴讽诵，晨昏不辍。 年二十七，为宜都王侍读，总知管记事。",
      "translated_text": "The *Collected Works of the Master of Creeping Vines*, compiled by Jia Song of the Young Scholar’s Studio\n\n**Imperial Edict of Enfeoffment from the Xuanhe Reign of the Song Dynasty**\n\nWe, having received the radiant mandate of the Jade Empyrean and grasped the sacred talisman of the Dragon Han, shall now propagate the numinous decree, exalt the transformative power of the Dao, elucidate the profound teachings of the subtlest doctrines, and extend felicitous destiny to the ranks of the perfected. The Overseer of Waters of Penglai, Tao Hongjing, has long adorned the frontier with his honorable silken robes, his essence refined at the gate of splendor. Though his spirit communes without entanglement, and though he dwells near in the mountains, his sincerity has long since resonated in the unseen, and his poetic gifts have already rendered him immortal upon the seas. How could one, gazing upon his virtue and renown, dare forget the sublime devotion that binds him? Thus, to bestow upon him the glory of a resplendent title and to perpetually bless his life with celestial grace, he shall be specially enfeoffed as **Zongyuan Lingjiao Perfected Realized One**.\n\n---\n\n**Inscription on the Stele of the Unbinding of the Realized One**\n*Composed by Xiao Lun, Prince of Shaoling*\n\nFor luminous jades and lustrous greens are not the common treasures of fat-laden baskets, just as soaring wings and leaping scales are not the mere playthings of garden ponds. How could one confine the heart to the narrow and the near, when it knows not the reason for its own boundlessness? Thus did the lofty hermit of Yingyang wash his ears in the Tang court’s stream, and thus did the steadfast recluse of Hanyin erase his traces in the Zhou era. The noble virtue and flowing influence of such men have long had their origins. And he who answers the call of the times to manifest his essence—is he not here before us?\n\nThe Master’s name was Hongjing, his courtesy name Tongming. He was originally from Pingyang in Jizhou. His ancestors descended from Emperor Yao of the Taotang clan; when Yao governed Pingyang in Jizhou, his lineage settled there. The dragon-horse appeared bearing the five-colored talisman, and the radiance of reverence displayed the eight auspicious hues. His light illumined all under heaven, and his just governance extended to every office. The wellspring of his lineage was vast and far-reaching, its threads long and unbroken.\n\nWhen the Han arose, his forebear served as the Right Marshal to Emperor Gaozu. His son, Qingdi, rose to the position of Chancellor. During the late Han, the family crossed south and first settled in Danyang. His seventh-generation ancestor, Jun, served the Wu kingdom as General Who Pacifies the South and Governor of Kezhou. His grandfather, Long, was a Military Advisor to the Southern Commandery under the Song. His father, Zhenbao, was Gentleman of the Palace to the Prince of Jian’an, both men of pure and frugal conduct, widely learned in literature and history.\n\nThe Master embodied the harmonious qi of primordial essence, nurturing a refined and profound nature. He encompassed the seven virtues and cultivated the nine powers, practicing benevolence and treading the path of righteousness. Like a mountain, he stood firm; like an abyss, he remained still. His towering integrity could not be glimpsed, his purity and depth could not be fathomed. His Daoist aura soared as high as the Milky Way, his transcendent spirit stretched as far as mist and clouds.\n\nAt six, he could read and compose essays. At seven, he recited tens of thousands of words from the *Classic of Filial Piety*, the *Mao Odes*, and the *Analects*. Even the young Yan Zhuang, who studied the ancient canons, or Liu Zhen, who read poetry and rhapsodies in his youth, pale in comparison to him. Thus did his reputation spread like the echoes of Qixi, and thus did the Yellow Emperor’s hymns find voice in him.\n\nA villager once obtained Ge Hong’s *Biographies of Divine Transcendents* and showed him the tales of the Eight Immortals of Huainan. He sighed and said, “Reading this book fills one with the spirit of soaring clouds.” From then on, he recited it day and night without cease.\n\nAt twenty-seven, he became the Literary Companion to the Prince of Yidu, overseeing all matters of record.",
      "overlap_context": "e who cherish forests and streams see caps and sashes as fetters and shackles. If one probes to the subtleties, it is clear that bells and tripods cannot compare to mountain valleys. To cringe on the path of honor and disgrace, to tread within the snares of the world—how can this be mentioned in the same breath as roaming freely through groves and marshes, chewing on magic herbs and trees? Even with Shen Xiwen’s exalted rank, the Master still deemed him shallow, for he knew the true value of the",
      "start_char": 11688,
      "end_char": 12298,
      "start_sentence": 596,
      "end_sentence": 631,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.697009801864624,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\华阳陶隐君内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "膀道求贤，禁林招士，朝难其选，咸日得人。 阮璃之书记不足扶衡，孙楚之辞才何以捧毂？ 齐代好治宫室，方修苑囿青溪旧馆，更就起筑，仍奏表上颂，辞事兼美，迈彼乐职之篇，谕乎景福之制。 帝省览久之，益以为善，除奉朝请。 恪居官次，夙夜惟夤，春朝秋请，是谓械扑者也。 先生本不希荣，常欲辞退，乃与亲友书日：畴昔之意，不愿处人问，年登四十，毕志山薮。 今已三十六矣，时不我借，知几其神乎？ 母#1。 为自苦也。 明年遂拜表自解，抽簪束都之外，解组北山之阿，同稷丘之栖隐，慕留侯之却粒。 便具舟橄，永言束迈。 朝迁锡问，时贤饯别。 祖以二疏，括兹四隐，超然轻举，异代同符尔。 乃杖策遐征，游践名岳。 既而到于句容，登於茅岭。 以此地神仙之宫府，灵异之栖托，往不知返，遂卜居焉。 先生日：夫子云：隐居以求其志，行义以达其道。 吾闻其语，未见其人。 今我义达，无复其方，请同求志之业，故自称隐居。 亦犹稚川之抱朴，士安之玄晏。 倚岩栖影，依林遁迹。 交柯结宇，刻径为门。 悬岸对溜，悲昤灌木。 深壑峭岭，组织烟霞。 枕石漱流，山禽无挠； 采药偶逢，野兽不乱。 逍遥闲旷，放浪丘陵。 咯然若丧，确乎难拔。 属齐末道丧，天命既否，水国洛谷，地震甲辰。 先生静思冥数，预识其兆。 於是近远书问，悉皆杜绝。 昔乃闻之夏甫，今则见之先生。 我大梁休运应期，受天明命，三辰开朗，四海宁谧。 先生奉表称庆，於是信问复通。 自天监已来，尝有劲旨，供给药饵，不乏岁时。 渥泽深恩，莫之与比。 先生七年暂从南岳，兹山也，辟闻风之地轴，若昆陵之天镇，八柱旁临，九纯问设，树有琅讦，草生车骑，遗世独往，是用忘归。 十一年有劲遗左右司徒惠明征先生还茅山，别给癣宇。 轩君之降情天老，汉帝之致礼河上，况於兹日，弗能尚也。 养志山阿，多历年所。 摄生既善，冥祥亦降。 猛兽不据，魑魅莫逢。 庭无荆棘，远同阙里。 阶吐神泉，逼扶疏勒。 於是羽人徘徊，仙客上下，鸾凤游集，芝英丰润矣。 以大同二年岁次丙辰三月壬寅朔十二日癸丑，告别迁化，春秋八十有一。 天子嗟惜，储皇斡悼。 有诏称誉，追赠中散大夫，谧日贞白先生，礼也。 以其月十四日定于丹阳郡句容县之雷平山，若轩辕之葬衣冠，如子乔之藏剑乌，比於兹日，可得符焉。 先生器宇凝深，思仪精赡，含章贞吉，不修廉隅。 年将中寿，匪瑜於矩。 眉目疏朗，仪貌鲜洁。 皇忘劝沮，多行德惠。 宝惜光景，爱好坟籍。 笃志励节，白首弥至。 若乃《淮南鸿宝》之诀，陇西地动之仪，太乙遁甲之书，《九章》历象之术，幼安银钩之敏，允南风角之妙，太仓《素问》之方，中散琴操之法，咸悉搜求，莫不精诣。 爰及羿射、荀棻，苏卜、管筮，一见便晓，皆不用心。 张华之博物，马均之巧思，对向之知微，葛洪之养性，兼此数贤，一人而已。 门人桓法闱等，慕遥风於堠氏，结遗想於乔阳，勒玄碑而相质，腾绛霄之流芳。 乃作铭日： 留乌表化，弃剑凝神，徘徊紫黑，照曜丹林，厥迹犹在，余风可遵。 谁其嗣此渊哉。 淑人高行迈种，盛德日新，朗犹悬镜，郁似贞筠，身以弘道，行不违仁。 昔游缨绂，颉顽捂绅，厌乎匡救，劳彼问津，亦既解组，乃袭山巾，远寻丘壑，高蹈风尘，情无缅世，隐不隔真。",
      "translated_text": "The court sought the Dao and pursued worthies, while the imperial forest summoned scholars—though the age made selection difficult, all agreed the right man had been found. Could Ruan Ji’s literary records prop Rang’s balance? How might Sun Chu’s rhetorical talents support the chariot’s hub? In the Qi era, the court favored palace construction, and as the old gardens of Green Creek were renovated and new halls erected, he submitted memorials and composed eulogies, his words and matters both surpassing excellence. His *Ode to the Joyful Office* outshone its predecessors, and his *Rhapsody on the Auspicious Blessing* clarified the imperial edict. The emperor perused them at length, praising them ever more, and appointed him Gentleman Attendant at Court.\n\nIn office, he was diligent day and night, observing the spring audiences and autumn petitions—such was the discipline of cangues and flogging. Yet the master had never sought glory; he often wished to resign, writing to kin and friends: “My long-held desire was to avoid the world of men. By forty, I would have fulfilled my resolve in the mountains and marshes. Now I am thirty-six, and time does not wait—does one not know the divine subtleties of the moment? To endure hardship for oneself is bitter indeed.” The following year, he submitted a memorial to resign, withdrawing his hairpin beyond the capital’s gates and untying his sash at the northern slopes of the mountains. Like Jiqu’s reclusive dwelling or the Marquis of Liu’s grain-abstinence, he emulated the ancients in transcending his age. Boarding his boat, he set forth eastward. The court bestowed inquiries, and eminent men saw him off. Compared to the two Fus, he embodied the four recluses, rising lightly as if across eras.\n\nStaff in hand, he journeyed afar, traversing famous peaks. Arriving at Jurong, he ascended Mao Ridge. Seeing this place as the palace of divine transcendents and the abode of numinous marvels, he never looked back and chose to dwell there. The master said: “The Master once said, ‘Live in reclusion to seek one’s resolve; practice righteousness to fulfill the Dao.’ I have heard these words but never seen such a person. Now that my righteousness is fulfilled, I no longer seek direction—let me join the pursuit of resolve.” Thus he called himself a recluse, like Ge Hong embracing simplicity or Huangfu Mi’s *Xuan Yan*. Leaning on cliffs and casting his shadow, he concealed his traces among the forests. Branches intertwined to form his hut, and he carved a path for his gate. Overhanging cliffs faced cascading streams, and the wind sighed through the trees. Deep ravines and sheer ridges wove mist and clouds. Pillowing on stone and rinsing his mouth with flowing water, mountain birds did not disturb him; gathering herbs, he met wild beasts that did not scatter. Carefree and unburdened, he roamed the hills. Serene as if lost, steadfast and unshakable.\n\nAs the Qi dynasty neared its end, Heaven’s mandate faltered. The southern lands and Luoyang valleys trembled in the *jiachen* year’s earthquake. The master, meditating on hidden patterns, foresaw its omens. Thus, he severed all correspondence near and far. What was once heard of Xia Fu was now witnessed in the master. When our Great Liang’s prosperous destiny arrived on schedule, receiving Heaven’s bright mandate, the Three Luminaries shone clearly, and the Four Seas grew tranquil. The master submitted a memorial in celebration, and thus trust and inquiries resumed.\n\nSince the *Tianjian* era, imperial decrees had often been issued, providing medicines and supplies without fail through the seasons. Such profound grace and favor were unmatched. After seven years, he briefly visited the Southern Marchmount. This mountain was the axis where the winds of fame gathered, the celestial pillar like Kunlun’s heavenly bastion. The Eight Pillars stood nearby, and the Nine Pure Ones were arrayed around it. Trees bore jade-like leaves, and grasses grew like chariots and cavalry. Leaving the world behind, he forgot to return.\n\nIn the eleventh year, an imperial edict dispatched the Left Minister Huiming to summon the master back to Mount Mao, granting him a separate residence. Even the descent of the Lord of the Gourd to the Celestial Elder or the Han emperor’s courtesies to the Old Man of the River could not surpass this day’s honor. Nurturing his resolve in the mountain’s embrace for many years, he cultivated life well, and numinous blessings descended. Fierce beasts did not lurk, and demons did not appear. His courtyard was free of brambles, much like Confucius’s neighborhood. Steps flowed with sacred springs, and nearby trees flourished. Then feathered transcendents wandered about, immortals ascended and descended, phoenixes and simurghs gathered, and magic mushrooms grew lush.\n\nIn the second year of *Datong*, the cyclical year *bingchen*, on the twelfth day of the third month (a *guichou* day), he departed this life at the age of eighty-one. The Son of Heaven mourned, and the Crown Prince grieved. An edict praised his virtues, posthumously appointing him Grand Master for Palace Attendants and conferring the posthumous title *Master of Integrity and Purity*. Such was the ritual.\n\nOn the fourteenth day of the same month, he was interred at Leiping Mountain in Jurong County, Danyang Commandery—like the Yellow Emperor’s burial of his robes and cap or Wangzi Qiao’s concealment of his sword in the crow, this day matched those precedents. The master’s bearing was profound and composed, his thoughts refined and rich. He embodied hidden virtue and upright fortune, yet did not cultivate mere propriety. Nearing middle age, he was no square confined by its rules. His brows and eyes were clear, his appearance fresh and pure. He neither forgot encouragement nor discouraged others, often practicing kindness and favor. He treasured time and loved ancient texts. His resolve was steadfast, his integrity enduring to white-haired age.\n\nAs for the *Hongbao* secrets of Huainan, the seismograph of Longxi, the *Taiyi Dunjia* texts, the *Nine Chapters* of calendrical calculations, the swift brushwork of Kong Rong, the marvelous *Fengjiao* divination of Zihua, the *Suwen* formulas of the Grand Granary, and the *Qin Cao* melodies of the Central Dispersed Master—he sought them all and mastered each. Even Yi’s archery, Xun’s *Fen* divination, Su’s oracle bones, and Guan’s milfoil—he grasped them at a glance without effort. Zhang Hua’s encyclopedic knowledge, Ma Jun’s ingenuity, Liu Xiang’s subtlety, and Ge Hong’s life-nurturing arts—he combined the talents of these worthies in one person.\n\nHis disciples, including Huan Famin, admired the distant winds of the Hou clan and cherished the lingering thoughts of Qiao Yang. They carved a dark stele to record his essence, spreading his fragrant reputation through the crimson clouds. Thus an inscription was composed:\n\nThe crow’s departure marks transformation,\nThe abandoned sword congeals spirit.\nWandering the purple empyrean,\nIlluminating the cinnabar groves.\nHis traces remain,\nHis winds may yet be followed.\nWho shall inherit this profound legacy?\n\nA man of virtue, his conduct surpasses all,\nHis great power renews daily.\nBright as a hanging mirror,\nLush as pure bamboo.\nHis person embodies the Dao,\nHis actions never stray from benevolence.\nOnce he roamed the court,\nAdorning the girdles of officials.\nWeary of governance,\nLaboring to guide the lost.\nHaving untied his sash,\nHe donned a mountain kerchief.\nFar he sought valleys and peaks,\nLoftily transcending the dust.\nHis heart held no worldly ties,\nHis reclusion did not sever truth.",
      "overlap_context": ". Thus did his reputation spread like the echoes of Qixi, and thus did the Yellow Emperor’s hymns find voice in him.\n\nA villager once obtained Ge Hong’s *Biographies of Divine Transcendents* and showed him the tales of the Eight Immortals of Huainan. He sighed and said, “Reading this book fills one with the spirit of soaring clouds.” From then on, he recited it day and night without cease.\n\nAt twenty-seven, he became the Literary Companion to the Prince of Yidu, overseeing all matters of record.",
      "start_char": 12298,
      "end_char": 13545,
      "start_sentence": 632,
      "end_sentence": 695,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.61821007728577,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\华阳陶隐君内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "结宇崇岩，贞栖茂草。 冰玉留年，精华却老。 乃有令闻，康庄寿考，白水过庭，危峰临洞，露缀兰阶，云生桂楝，日斜榈席，花落窗瓮，尚平未返，王孙不旋，海桑交易，陵谷变迁，丰碑有坚，遗芳万年。 碑阴记 天台华峰白云道士河内 司马道隐子微述 大哉道元，万灵资孕，其自然也，忽恍不测，其生成也，氤氲可知。 若夫禀习经法，精思涌感，调转丹液，形神炼化，归同一致，举异三清，自古所得，罕能尽善。 兼而聚之，鉴而辩之，静而居之，勤而行之者，皇惟贞白先生欤？ 盖特禀灵气，胎息见龙升之梦； 卓秀神仪，骨录表鹤仙之状。 心若明镜，洞鉴无遗。 器犹洪锺，虚受必应。 是以天经真传，备集於昭台； 奥义微言，咸诀於灵府。 纂类篇简，悉成部恢。 广金书之凤篆，益琅函之龙章，阐幽前秘，击蒙后学。 若诸真之下教，为百代之明师焉。 睹先生写貌之象，则道存目击； 览先生着述之义，则情见乎辞。 纵逾千载，亦可得之一朝矣。 至於思神密感之妙，炼形化度之卫，非我不知，理难详递。 敬以修身德业，受书道备，按夫科格，固超真阶。 命分殊途，显默异轨。 应从解景，不事登晨。 冥升上清，弗可得而测已。 然隐几云化，卢室仍存，代剑未飞，阴丘尚闭。 道尊德贵，终古不渝。 披文相质，乃今无睹。 朝代累革，山世转睽。 永怀仙烈，久增诚慨。 子微将游衡岳，暂憩茅山、与诸法义聚谋刻石，邵陵撰制美具当年，今以书勒，言全往行。 因运拙笔，聊述真猷，纪于碑阴，式昭年世。 时大唐开元二十年甲子九月十三日己巳书。 墓志铭 梁昭明太子撰 维大同二年，龙集景辰，克明三月，壬寅朔十二日癸丑巳时，华阳洞陶先生蝉蜕于茅山朱阳馆。 先生讳弘景，字通明，春秋八十有一。 屈申如恒，颜色不变。 有制，赠以中散大夫，谧日贞白先生。 遣舍人主书监护丧事。 十四日巳时定于雷平之山。 若夫真以归空为美，道以无涯为真，不知悦生，大德所以为生，不知恶死，谷神所以不死。 妙矣哉，隐显变化。 物莫能测。 既而岫开析石，天坠玉棺，银书息简，流珠罢，鳌九节丽於天中，千和焚於地下，仙官有得朋之喜，受学振空谷之悲。 余昔在粉壤，早逢圯上之术； 今篷元良，屡禀浮丘之教。 握留符而恻怆，思化杖而酸辛，乃为铭日：无名之道，不死为仙，亦有元放，兼称稚川，逃形解化，自昔固然。 琦欤夫子，受录归元，梨传宛吏，书因贾船。 虎车照景，蜕拂凌烟。 余花灼灿春涧，潺湲郁郁茅岭。 悠悠洞天，三仙白鹤，何时复旋。 沈约酬华阳先生 三清未可觊，一黑且空存。 所愿回光景，拯难拔危魂。 若蒙九丹赠，岂惧六龙奔。 早欲寻名山，须待婚嫁毕。 二事虽云已，此外复非一。 忽闻龙图至，仍睹龙光溢副。 朝首八元，开壤赋千室。 冠缨曾弗露，风雨未尝栉。 呜玉响洞门，金蝉映朝日。 暂无小人报，从叨令尹秩。 岂忘平生怀，靡监不遑恤。 侧闻上士说，尺木乃腾霄。 云骈不展地，仙居多丽樵。 外待三芝秀，坐对百神朝。 衔书必青乌，嘉客信龙镳。 非止灵桃实，方见大桩凋。 餐玉驻年龄，吞霞反容质。 眇识青丘树，回见扶桑日。 烂煜蜃云舒，嵚岂山海出。 后湖苏庠赞陶先生像 药珠妙言，字照编简。",
      "translated_text": "Amidst towering cliffs he built his abode,\nIn verdant grasses made his steadfast retreat.\nLike ice and jade, his years endured,\nHis essence preserved, defying age’s blight.\n\nThus arose his noble renown—\nA life of vigor, longevity, and ease.\nWhite waters flowed past his courtyard,\nSteep peaks loomed o’er the ravine.\nDew adorned the orchid steps,\nClouds wreathed the cassia beams.\nAs the sun slanted o’er the bamboo mat,\nBlossoms drifted past the window jar.\nShang Ping never returned,\nThe noble scion tarried not.\nSeas and mulberries shift their bounds,\nHills and valleys alter their form.\nYet this sturdy stele stands firm,\nHis fragrant legacy enduring ten thousand years.\n\n**Inscription on the Reverse of the Stele**\nBy Sima Daoyin Zimiao of Huanè, White Cloud Daoist of Huafeng, Tiantai\n\nGreat is the Dao’s origin—\nThe myriad spirits draw sustenance from its womb.\nIts spontaneity is elusive, unfathomable;\nIts generation and completion, veiled yet discernible in misty qi.\n\nAs for those who study scriptures and methods,\nWho refine their thoughts to stir profound resonance,\nWho harmonize and transmute the elixir,\nRefining body and spirit into unity—\nThough they may ascend the Three Clarities,\nFew since antiquity have attained perfection.\nYet one who gathers and embodies these,\nWho discerns and distinguishes them,\nWho dwells in stillness,\nWho practices with diligence—\nWas he not the Venerable Zhenbai?\n\nBorn with numinous qi,\nHe dreamed of a dragon’s ascent while still in the womb.\nHis bearing was noble, his spirit radiant,\nHis bone-record marked with the crane-immortal’s sign.\nHis mind was a luminous mirror,\nPenetrating all without omission.\nHis vessel was like a great bell,\nReceptive and responsive in its emptiness.\n\nThus the celestial scriptures’ true transmissions\nWere fully gathered at Zhaotai;\nArcane meanings and subtle words\nWere all entrusted to his numinous mind.\nHe compiled and categorized texts,\nExpanding them into comprehensive works.\nHe amplified the phoenix-script of golden writ,\nEnriched the dragon-seals of jade tablets,\nRevealed hidden mysteries of the past,\nDispelled ignorance in later learners.\nAs a teacher to the host of perfected,\nHe became a guiding light for a hundred generations.\n\nBeholding his painted likeness,\nThe Dao is present at a glance;\nPerusing his writings,\nHis spirit shines through the words.\nThough a thousand years may pass,\nHis essence may yet be grasped in a single morning.\n\nAs for the marvels of mystical resonance in meditation,\nThe safeguards of refining form and transcending mortality—\nThese I do not know,\nFor their principles defy detailed recounting.\n\nYet in cultivating his person and virtuous deeds,\nHe mastered the full spectrum of Daoist arts.\nBy the standards of the celestial ranks,\nHe far surpassed the true stages.\nThough his destiny followed a singular path,\nHis manifest and hidden ways diverged.\nHe responded to the dissolution of shadows,\nNever striving for dawn’s ascent.\nMysteriously ascending to the Upper Clarity,\nHis course remains beyond all measure.\n\nYet as he vanished like clouds at his desk,\nHis reed chamber still stands;\nHis sword of transcendence has not yet flown,\nThe hidden mound remains sealed.\nRevered in Dao, noble in virtue,\nHis legacy endures through all ages.\nThough we may seek his form through his writings,\nHe is no longer visible today.\nDynasties have changed in succession,\nMountains and eras have grown estranged.\nEver cherishing his immortal spirit,\nWe are moved to profound lament.\n\nAs Zimiao prepared to journey to Mount Heng,\nHe briefly sojourned at Maoshan,\nWhere he gathered with fellow practitioners of the Dao.\nShaoling composed a eulogy in his honor,\nAnd now I inscribe these words to preserve his deeds.\nThus I wield my clumsy brush,\nBriefly recounting the true path,\nRecording it on the stele’s reverse,\nTo illuminate the age for posterity.\n\nWritten on the thirteenth day of the ninth month, the year *jiazi* of the *Kaiyuan* reign, the twentieth year of the Great Tang.\n\n---\n\n**Epitaph**\nComposed by Prince Zhaoming of Liang\n\nIn the second year of *Datong*, the year of *jingshen* in the cyclical calendar,\nIn the third month, the twelfth day after the new moon of *renyin*,\nAt the hour of *sichou*,\nMaster Tao of Huayang Cave shed his cicada-shell at Zhuyang Lodge on Maoshan.\nThe Master’s personal name was Hongjing, his courtesy name Tongming,\nAnd he lived eighty-one years.\nHis limbs remained supple, his complexion unchanged.\nBy imperial decree, he was posthumously appointed *Zhongsan Dafu*,\nAnd granted the posthumous title *Zhenbai Xiansheng*.\nA court emissary was dispatched to oversee the funeral rites.\nOn the fourteenth day, at the hour of *sichou*,\nHe was interred at Mount Leiping.\n\nFor the true Dao, returning to emptiness is beauty;\nThe Way finds its truth in boundlessness.\nUnattached to life, he embodied great virtue;\nUnfearing of death, his valley spirit never perished.\nWondrous indeed—\nHis transformations between concealment and revelation,\nBeyond all mortal comprehension.\n\nThen the mountain cleft parted,\nA jade coffin descended from the heavens.\nSilver script ceased its whispering,\nFlowing pearls stilled their glow.\nA nine-jointed turtle gleamed in the sky,\nA thousand harmonies burned beneath the earth.\nThe immortals rejoiced in finding a companion,\nWhile his disciples mourned in the empty valleys.\n\nI once dwelt in the dust of the world,\nEarly encountering the arts of the ruined wall;\nNow, as tutor to the crown prince,\nI have repeatedly received the teachings of Fuqiu.\nClutching the talisman of his departure, I grieve;\nLonging for his transformed staff, I ache with sorrow.\nThus I compose this inscription:\n\nThe Dao without name,\nThe immortal who does not die—\nThere were Yuanfang of old,\nAnd Zichuan who shared his renown.\nEscaping form, dissolving transformation,\nSuch has ever been the way.\nHow splendid was the Master—\nEnrolled among the immortals, he returned to the origin.\nHis pear-like writings were passed by a hidden scribe,\nHis books conveyed by a merchant’s vessel.\nHis tiger chariot illumined the shadows,\nHis cast-off shell brushed the clouds.\nThe lingering blossoms gleam in the spring ravine,\nThe murmuring streams flow lushly through Maoling.\nOh, the boundless grotto-heaven—\nWhen shall the three white cranes return?\n\n---\n\n**Shen Yue’s Response to Master Huayang**\n\nThe Three Clarities may not be coveted,\nYet one realm still endures in emptiness.\nI wish only to turn back the light,\nTo rescue the imperiled and redeem the lost.\nIf granted the gift of the nine elixirs,\nWhat fear would I have of the six dragons’ flight?\nLong have I desired to seek the famed mountains,\nBut must wait until my children’s marriages are complete.\nThough these two matters are now settled,\nCountless others remain unresolved.\nSuddenly I hear the dragon chart has arrived,\nAnd see the dragon’s radiance overflowing.\nAt dawn, the Eight Primes open the earth,\nAnd a thousand households compose their odes.\nNever once has he shown his cap or tassels,\nNor combed his hair through wind and rain.\nThe jade chime resounds at the grotto gate,\nThe golden cicada gleams in the morning sun.\nThough no petty man repays his kindness,\nI have presumptuously received the rank of prefect.\nHow could I forget my lifelong aspirations?\nYet with no leisure to attend to them, I am filled with remorse.\nI have heard the superior man say\nThat a single *chi* of wood can soar to the heavens.\nCloud carriages do not touch the earth,\nAnd the immortal’s abode is rich with kindling.\nHe awaits the blossoming of the three sacred fungi,\nSitting as a hundred spirits pay homage.\nHis letters are borne by blue crows,\nHis honored guests arrive on dragon bridles.\nNot only do the divine peaches bear fruit,\nBut the great pillars of the earth wither.\nFeasting on jade, he halts the march of years,\nSwallowing auroras, he restores his youthful visage.\nDimly I recognize the trees of Qingqiu,\nAnd once more behold the sun of Fusang.\nResplendent, the shimmering mirage unfurls,\nTowering, the mountains and seas emerge.\n\n---\n\n**Su Chang of Houlu’s Eulogy for Master Tao’s Portrait**\n\nThe marvelous words of the alchemical pearl\nIlluminate the pages of his writings.",
      "overlap_context": "d legacy?\n\nA man of virtue, his conduct surpasses all,\nHis great power renews daily.\nBright as a hanging mirror,\nLush as pure bamboo.\nHis person embodies the Dao,\nHis actions never stray from benevolence.\nOnce he roamed the court,\nAdorning the girdles of officials.\nWeary of governance,\nLaboring to guide the lost.\nHaving untied his sash,\nHe donned a mountain kerchief.\nFar he sought valleys and peaks,\nLoftily transcending the dust.\nHis heart held no worldly ties,\nHis reclusion did not sever truth.",
      "start_char": 13545,
      "end_char": 14786,
      "start_sentence": 696,
      "end_sentence": 770,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 46.55820035934448,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\华阳陶隐君内传.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "云霾三馆，其人则远。 世衰道丧，完节者鲜。 临终之叹，作世和扁。 华阳陶隐居内传卷下竟 #1『母】 疑应为『 毋」。",
      "translated_text": "Amid the haze of the three halls, his person recedes into the distance.\nAs the age declines and the Dao is lost, those who preserve their integrity are few.\nHis lament at life’s end became a *he* and *bian* for the world.\nHere concludes the second scroll of *The Inner Biography of Master Tao of Huayang*.\n\n#1 [Note: \"母\" likely a scribal error for \"毋.\"]",
      "overlap_context": "es.\nNot only do the divine peaches bear fruit,\nBut the great pillars of the earth wither.\nFeasting on jade, he halts the march of years,\nSwallowing auroras, he restores his youthful visage.\nDimly I recognize the trees of Qingqiu,\nAnd once more behold the sun of Fusang.\nResplendent, the shimmering mirage unfurls,\nTowering, the mountains and seas emerge.\n\n---\n\n**Su Chang of Houlu’s Eulogy for Master Tao’s Portrait**\n\nThe marvelous words of the alchemical pearl\nIlluminate the pages of his writings.",
      "start_char": 14786,
      "end_char": 14846,
      "start_sentence": 771,
      "end_sentence": 775,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 2.472787857055664,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\记传类\\华阳陶隐君内传.txt",
        "category": "记传类"
      }
    }
  ]
}