{
  "source_id": "南华真经拾遗",
  "source_file": "chunked_daozang\\南华真经拾遗.json",
  "total_chunks": 3,
  "total_original_chars": 2903,
  "total_translated_chars": 15230,
  "total_translation_time": 75.84588718414307,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\玉诀类\\南华真经拾遗.txt",
    "category": "玉诀类"
  },
  "full_translation": "**Supplementary Notes to the *True Classic of Southern Florescence***\n\n**Title:** *Supplementary Notes to the True Classic of Southern Florescence*\n**Author:** Wang Pang of the Northern Song Dynasty\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, \"Jade Instructions\" category under the *Dongshen* section.\n\n---\n\n**Supplementary Notes to the *True Classic of Southern Florescence***\n*Compiled by Wang Yuanze of the Song Dynasty*\n\n### The Sacrificial Ox of the Grand Temple\nThe writings of Zhuang Zhou are but allegories; those who scrutinize his words without grasping their intent are the very ones who dispute his meaning. Zhuang Zhou said: \"Above, one must act without contrivance to employ the world; below, one must act with purpose to be employed by the world.\" Yet he deemed himself dwelling amid benighted rulers and chaotic ministers, thus exhausting his talents without revealing them. Who would claim that Zhuang Zhou’s words cannot be applied to the relations between ruler and minister, father and son? Yet in his time, he could never have been made to act.\n\nWhen he invoked the sacrificial ox of the Grand Temple to decline the Chu envoy’s invitation, he was merely using stark words to rebuff the mediocrities of a declining age. With Zhuang Zhou’s talent, how could he have been so deluded about the path of withdrawal as to fear only the ox? Rather, he was one of those whom Confucius called \"recluses who speak freely.\" Zhuang Zhou was likely such a man.\n\n### The *Spring and Autumn* as a Mirror of the Age\nThe sage engages in discourse but not debate; the various masters debate but do not discourse. Discourse is exposition and nothing more; discussion is evaluation and nothing more; debate is the weighing of right and wrong in affairs. Beyond the Six Directions, the sage leaves matters unaddressed. Within the Six Directions, the sage discourses but does not discuss.\n\nThe sage’s discourse is evident in the *Spring and Autumn*, which discusses but does not debate. The *Spring and Autumn*’s record of the age is merely discussion. The sage’s discussion is not by choice—how could it resemble the common folk, who vie to debate and display themselves?\n\n### Shade Asks Shadow\nIn Zhuangzi’s text, the shade twice questions the shadow. The shadow, though seemingly dependent on form, is in truth not so. Yet the ignorant assume that rising, sitting, bowing, and lifting depend on form—how could they know that the shadow does not truly rely on form?\n\nTo insist that the shadow depends on form, and form on the Creator, is to fail to comprehend spontaneous transformation. One who grasps spontaneous transformation knows that the shadow does not depend on form, nor form on the Creator—it culminates in nothingness. Thus it is said: \"How could one know why it is so or not so?\"\n\n### Dreaming of a Butterfly\nZhuangzi spoke of dreaming of a butterfly to express his contentment, and of fish to express his joy. The butterfly, small and fluttering, goes everywhere without hindrance; the fish, dwelling in the depths, preserves its life. Through these two creatures, he conveyed his sense of ease and delight, harmonizing all things in their diversity.\n\n### Goblet Words\nGoblet words are speech without fixed form.\n\nWords without unity flow forth endlessly, thus called \"daily arising.\" Speech that lacks unity yet emerges must have a root, hence \"harmonized with Heaven’s boundary.\" Heaven’s boundary is the wondrous root of spontaneity. Words rooted thus respond to change without limit, hence \"following the manifold.\" Words that respond to change without limit transcend the bounds of past and present, yet my speech knows no end—thus \"exhausting the years.\" Though Zhuang Zhou’s words may seem unbounded and diverse, they never depart from the root of the Dao. Thus Guo Xiang deemed him one who knew the root, for he understood Zhuangzi’s depth.\n\n### Miscellaneous Sayings\nWhat all things follow is the Dao. The Dao is that which things follow, yet it is nowhere absent. Thus, in greatness it never exceeds, and in minuteness it never omits. Each of the myriad things possesses its nature and capacity, which is why Zhuang Zhou’s writings speak of the kun and peng, the cicada and fledgling dove, the quail and wren, the ant and sheep, the fish and butterfly, the horse and ox, the mountain trees, and the like.\n\nThe root of the Dao lies before the Great Ultimate yet is not lofty; its foundation rests beneath the Six Poles yet is not deep. Before heaven and earth existed, it preceded their birth yet was not ancient. From antiquity it has endured, older than high antiquity yet not long-lived. The diversity of the ten thousand things is called abundance; unifying diversity is called greatness; possessing abundance is called great enterprise—this is the sage.\n\nOnly after form exists does name arise; only after name exists does division arise; only after division exists does adherence arise. Zhuangzi said: \"Once form and name are clear, adherence follows.\" Zhuangzi’s meaning—that one does not break Mo Ye blades, nor resent flying tiles, nor rage at empty boats—is the same.\n\nHeaven and earth possess great beauty yet do not speak; the four seasons have bright laws yet do not debate; the ten thousand things have completed principles yet do not explain. Thus Confucius wished to be wordless, saying: \"What does Heaven say? The four seasons proceed, the hundred things are born.\" Who but one who embodies the Dao could attain this?\n\nFollowing one’s nature is spontaneity; cultivating the Dao is contrivance. Spontaneity is Heaven; contrivance is man. What lies within spontaneity exists; what lies beyond contrivance does not. How can man take away what one has or add what one lacks? Thus, what one has is nature; what one lacks is what Zhuangzi called excess.\n\nVirtue is what one possesses. To add to what one already possesses is excess. Thus it is said: \"The joined toes and extra fingers arise from nature yet are excessive in virtue. The hanging wens and dangling tumors arise from form yet are excessive in nature.\"\n\nThe traces of the noble man may be limited or boundless, but the Dao of the sage knows no dullness or sharpness—this is what the people perceive. The noble man’s traces may be limited or boundless, yet his heart knows no difference between them. Thus it is said: \"Whether limited or boundless, one is joyful, for limitation and boundlessness are like the sequence of cold and heat, wind and rain.\"\n\nZhuangzi said: \"Do not let the artificial destroy the Mandate.\" The human Dao is called the artificial; the Heavenly Dao is called the Mandate. The Dao is like the year; the sage is like the seasons. Thus Zhuang Zhou composed *Autumn Floods* to speak of \"the time arriving\"—it is simply being timely. Yet petty scholars point to this and criticize it, no wonder they resent the summer insect’s inability to speak of ice or the well-frog’s inability to speak of the sea.\n\nZhuangzi said: \"Yan Hui has forgotten benevolence and righteousness, yet has not yet forgotten ritual and music.\" Benevolence and righteousness are forgotten first, ritual and music later—this implies benevolence and righteousness are not as profound as ritual and music. Here Zhuangzi first speaks of forgetting the inner, then the outer: benevolence and righteousness are inner, yet the outer—ritual and music—has not been forgotten. Only when inner and outer are forgotten can one attain \"sitting in forgetfulness.\" This is why his words differ.\n\nThe sage takes the necessary as unnecessary; the multitude takes the unnecessary as necessary. What does this mean? The great man’s words need not be reliable, his actions need not be resolute—this is taking the necessary as unnecessary. To insist that words be reliable and actions resolute is to take the unnecessary as necessary.\n\nSome of Zhuangzi’s words resemble those of sages and worthies; they cannot be entirely dismissed. The sage does not establish intent, yet intent always remains; does not assert the self, yet the self always exists. Moved only under compulsion, rising only when unavoidable—this is not acting with intent, not rising with self-assertion, but simply responding.\n\nZhuangzi said: \"That which things things is not thinged by things,\" which aligns with Xunzi’s words: \"One refined in the Dao things things.\" Stillness is the root; movement is the branch. The sage is one who is still and constant with things, moving and responsive to them. The multitude is one who is still and detached from things, moving and entangled with them. The sage things things; the multitude is thinged by things—this is the difference.\n\nConfucius said: \"The noble man studies to attain the Dao.\" Zhuang Zhou said: \"The Dao cannot be attained.\" Confucius said: \"As virtue, the *Doctrine of the Mean* is supreme.\" Zhuang Zhou said: \"Virtue cannot be reached.\" Why? Confucius spoke of what lies in man; Zhuang Zhou spoke of what lies in Heaven. If it lies in Heaven, how can the spontaneous Dao be attained? How can the self-possessed virtue be reached? If it lies in man, how can the profound Dao be attained? How can the ever-renewing virtue be reached? Only one who can attain may then not attain; only one who can reach may then not reach.\n\nZhuangzi’s writings delve into the mysteries of nature and destiny, unify the scattered threads of virtue and the Dao, aiming to dispel obscurity and replace it with clarity. Thus arise the teachings of returning to the root and restoring the Mandate, the words of smashing the bushel and breaking the scales.\n\nYet when the Dao resides in the heart and converges in the mind, inquiry into the Dao meets no response—what need is there for words?\n\nFor though silence may suffice to encompass the subtleties of the Dao, without speech there is no means to clarify it. Thus, only when compelled does one arise; only when moved does one act; only when pressed does one respond. Then, mounting the chariot of discourse, one bears the teachings onward, that scholars may grasp the meaning and forget the image, grasp the image and forget the words—this too is where Zhuangzi’s intent diverges from the world.\n\nZhuangzi speaks of the marsh pheasant confined in a pen, for it has lost its true nature. The perfected ones of antiquity could forget their cunning minds, still their external cares, align their hearts with the Great Void, and harmonize the Dao with the convergence of yin and yang. They took heaven and earth as a single morning, and distant ages as a single storehouse. None were deemed strange, so things could neither draw near nor grow distant—thus they emerged beyond all bounds, unlike the marsh pheasant trapped within its pen.\n\nZhuangzi said: \"The true person of old erred without regret, and when right did not rejoice\"—this shows that even sages are not without fault. To err without self-reproach is to be as one with Heaven. If one were to err as others do, there would be correction and no reluctance to change, and all would look up to such a one. Winter’s warmth and summer’s chill are Heaven and Earth’s errors—if even Heaven and Earth may err, how much more the sage?\n\nGreat fear is called dread; small fear is called anxiety. Zhuangzi said: \"Great dread is boundless; small anxiety is fretful.\" Zhuangzi’s writings penetrate the divisions of nature and destiny without allowing life and death, fortune and misfortune to disturb the heart. This is what brings him near to the sage—only one of luminous wisdom can attain such clarity. Reading the words of the sages may suffice to reach this, but failing to do so and sinking into Zhuang Zhou’s teachings instead would lead to great confusion.\n\nThe night’s qi endures when the myriad cares are stilled. If it does not settle and endure, one cannot attain morning clarity; to attain morning clarity is to return to the root of virtue. That which surpasses the sage and animates the myriad things is spirit; that which shares the sorrows of the myriad things is sageliness. Spirit without sageliness cannot act; sageliness without action cannot conceal.\n\nZhuang Zhou’s words exalt spirit and demean sageliness—this is an overcorrection of error. Zhuangzi said: \"From its root, from its source.\" The root is one, lying beneath the tree. The source is where the tree halts beside *gen*. The root emerges from the source, and the source clings to the root—they depend on each other to grow. Thus, the root is destiny, and the source is nature. Laozi said: \"Returning to the root is called stillness\"—this speaks of nature. \"Stillness is called returning to destiny\"—this speaks of the root.\n\nIn Zhuangzi’s writings, there are references to the true person and the perfected person: \"true\" speaks of their nature, while \"perfected\" speaks of the utmost in the human Dao. Clarity is the dispersion of spirit; spirit is the concealment of clarity. Thus, clarity arises from what spirit brings about, and so it is said that clarity cannot surpass spirit. Laozi said: \"The gate of Heaven opens and closes.\" Zhuangzi said: \"The gate of Heaven has no existence.\" Because the myriad things emerge from it, it is called \"opening and closing\"; because the myriad things are concealed within it, it is called \"nonexistence.\"\n\nZhuangzi’s words on the \"boundless deep\" refer to that which has no end, and beyond that, no end. The myriad things flourish and take form within it, so their limits cannot be seen. The myriad things are complete within heaven and earth, yet heaven and earth have no intention toward them—thus it is said: \"Great completeness.\" None is like heaven and earth, yet what do they seek? And yet they are greatly complete. The myriad things are also complete within my own body, yet I do not externally labor for them—thus it is said: \"One who knows great completeness seeks nothing.\" Being thus, one attains the Dao without loss and does not abandon it. How could one forsake the self to chase after things? Thus it is said: \"Lose nothing, discard nothing, do not exchange the self for things.\"\n\nZhuangzi said: \"There are names and realities—these are the dwellings of things.\" This means that in substance, it is substance; in function, it is function—this is how the myriad things arise. \"Without name or reality\" refers to the emptiness within things, where what is neither heard nor seen must gather in the void. What can be spoken or conceived only grows more distant; what is wordless and inconceivable is how the Dao draws near.\n\nZhuang Zhou’s writings convey the subtleties of the Dao, for his words seek to save nature and destiny before their dispersion and to awaken the world from its vulgar customs—how could this not be rooted in the Dao? The Dao is the sea; the sage is the hundred rivers. The Dao is the year; the sage is the seasons. Though the hundred rivers differ, what they share is the sea. Though the four seasons differ, what they share is the year. Though the Ways of Confucius, Mencius, Laozi, and Zhuangzi adapt to different times, in essence, do they not all return to this? To read Zhuangzi’s writings, seeking their meaning while forgetting their words—this may be called skillful reading.\n\n*Recovering the Lost Essentials of the True Classic of Southern Florescence* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "南华真经拾遗 经名：南华真经拾遗。 北宋王雱撰。 一卷。 底本出处：《正统道藏》洞神部玉诀类。 南华真经拾遗 宋王元泽集 太庙之牺 周之为书，特有寓而言耳，讨其文而不以意原之，此为周者之所以讼也。 周曰：上必无为而用天下，下必有为而为天下用。 又自以为处昏上乱相之间，故穷而无所见其材，孰为周之言皆不可措乎君臣父子之间？ 而遭世遇主终不可使有为也。 及其引太庙之牺以辞楚之聘使，彼盖危言拒衰世之常人尔。 夫以周之才，岂迷出处之方而专畏牺者哉？ 盖孔子所谓隐居放言者，周殆其人也。 春秋经世 圣人有论议无辨，诸子有辩无论议。 论者论说而止，议者议评而止，辨者辨其事之是非如何耳。 六合之外，圣人存而勿论。 六合之内，圣人论而不议。 圣人有论也，《春秋》议而不辨，《春秋》经世之迹，第议而已。 圣人有议也，圣人之有议，非得已也，岂若众人务辨以相示欤。 罔两问影 庄子之书两言罔两之问影，以影之为影，似待乎形而实不相待也。 而不知者以起坐俯仰为在形，岂知影寔不待於形欤。 夫以影必待形，形必待造物者，是不能冥於独化耳。 能冥於独化，则知影之不待形，形之不待造物，极於无有而已，故曰恶识其所以然不然。 梦为胡蝶 庄子以其自适则言梦为胡蝶，以其自乐则言如鱼之乐。 以胡蝶微小飞扬而无所不至矣，以鱼处深渺而能活其身矣，所以寓其自适自乐之意於二物，在於齐谐万物也。 卮言 卮言，不一之言也。",
      "translated_text": "**Supplementary Notes to the *True Classic of Southern Florescence***\n\n**Title:** *Supplementary Notes to the True Classic of Southern Florescence*\n**Author:** Wang Pang of the Northern Song Dynasty\n**Volume:** One\n**Source Text:** *Daoist Canon of the Zhengtong Era*, \"Jade Instructions\" category under the *Dongshen* section.\n\n---\n\n**Supplementary Notes to the *True Classic of Southern Florescence***\n*Compiled by Wang Yuanze of the Song Dynasty*\n\n### The Sacrificial Ox of the Grand Temple\nThe writings of Zhuang Zhou are but allegories; those who scrutinize his words without grasping their intent are the very ones who dispute his meaning. Zhuang Zhou said: \"Above, one must act without contrivance to employ the world; below, one must act with purpose to be employed by the world.\" Yet he deemed himself dwelling amid benighted rulers and chaotic ministers, thus exhausting his talents without revealing them. Who would claim that Zhuang Zhou’s words cannot be applied to the relations between ruler and minister, father and son? Yet in his time, he could never have been made to act.\n\nWhen he invoked the sacrificial ox of the Grand Temple to decline the Chu envoy’s invitation, he was merely using stark words to rebuff the mediocrities of a declining age. With Zhuang Zhou’s talent, how could he have been so deluded about the path of withdrawal as to fear only the ox? Rather, he was one of those whom Confucius called \"recluses who speak freely.\" Zhuang Zhou was likely such a man.\n\n### The *Spring and Autumn* as a Mirror of the Age\nThe sage engages in discourse but not debate; the various masters debate but do not discourse. Discourse is exposition and nothing more; discussion is evaluation and nothing more; debate is the weighing of right and wrong in affairs. Beyond the Six Directions, the sage leaves matters unaddressed. Within the Six Directions, the sage discourses but does not discuss.\n\nThe sage’s discourse is evident in the *Spring and Autumn*, which discusses but does not debate. The *Spring and Autumn*’s record of the age is merely discussion. The sage’s discussion is not by choice—how could it resemble the common folk, who vie to debate and display themselves?\n\n### Shade Asks Shadow\nIn Zhuangzi’s text, the shade twice questions the shadow. The shadow, though seemingly dependent on form, is in truth not so. Yet the ignorant assume that rising, sitting, bowing, and lifting depend on form—how could they know that the shadow does not truly rely on form?\n\nTo insist that the shadow depends on form, and form on the Creator, is to fail to comprehend spontaneous transformation. One who grasps spontaneous transformation knows that the shadow does not depend on form, nor form on the Creator—it culminates in nothingness. Thus it is said: \"How could one know why it is so or not so?\"\n\n### Dreaming of a Butterfly\nZhuangzi spoke of dreaming of a butterfly to express his contentment, and of fish to express his joy. The butterfly, small and fluttering, goes everywhere without hindrance; the fish, dwelling in the depths, preserves its life. Through these two creatures, he conveyed his sense of ease and delight, harmonizing all things in their diversity.\n\n### Goblet Words\nGoblet words are speech without fixed form.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 596,
      "start_sentence": 0,
      "end_sentence": 31,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.68837332725525,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\南华真经拾遗.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "言之不一，则动而愈出，故曰日出。 言不一而出之，必有本，故曰和以天倪。 天倪，自然之妙本也。 言有其本则应变而无极，故曰因以曼衍。 言应变无极则古今之年有时而穷尽，而吾之所言无时而极也，故曰所以穷年。 此周之为言虽放纵不一，而未尝离於道本也。 故郭象以周为知本者，所谓知庄子之深也。 杂说 万物之所道者，道也。 道者物之所道而无有不在，故在大则未尝有所过，而在细则未尝有所遗。 是以万物之才，性分中亦各有所取，而此庄周之为书而言及鲲鹏、蜩莺、斥鴳、鹪鹩、蚁羊、鱼蝶、马牛、山木之类也。 道之本在太极之先而不为高，根在六极之下而不为深。 未有天地也，先天地生而不为久。 自古以固存也，长於上古而不为寿。 万有不同谓之富，不同同之之谓大，富有之谓大业，此圣人也。 有形然后有名，有名然后有分，有分然后有守。 庄子曰：形名已明，分守次之。 庄子所谓不折镆铘，不怨飘瓦，与夫不怒虚舟之意同也。 天地有大美而不言，四时有明法而不议，万物有成理而不说。 是以孔子欲无言也，则曰天何言哉，四时行焉，百物生焉。 非体道者，孰能与此。 率性者自然也，修道者使然也。 自然者天也，使然者人也。 在自然之中者有也，在使然之外者无也，人安能夺其所有益其所无哉。 故所有者性也，所无者庄子之所谓侈也。 德者己之所有也，於己之所有人益之，是侈也。 故曰：骈拇枝指出乎性哉，而侈於德。 附赘县疣出乎形哉，而侈於性。 君子之迹有穷通，圣人之道无钝利，民之所见者然也。 君子之迹有穷通，其心则无穷通之异也。 故曰：穷亦乐，通亦乐，以穷通为寒暑风雨之序也。 庄子曰：无以故灭命，人道之谓故，天道之谓命。 道譬则岁也，圣譬则时也，庄周所以作《秋水》而言时至者，当其时而已。 奈曲士指此而非之，宜其愤夏虫之不可以语於冰，井蛙之不可以语於海也。 庄子言颜回忘仁义矣，未能忘礼乐。 仁义先忘而礼乐后忘，是仁义不如礼乐也。 此庄子先言忘内而后忘外，仁义内也，未能忘外，礼乐外也，内外忘然后能坐忘； 此其言之所以不同也。 圣人以必不必，众人以不必必。 何谓也？ 大人者言不必信，行不必果，必不必也。 言必信，行必果，以不必必也。 庄子之言有与圣贤相似者，不可全非而已矣。 圣人不自立意而意常存，不自有我而我常在，迫之而后动，不得已而后起，非有意而动也，非有我而起也，亦曰应之而已。 庄子曰物物者不物於物，与荀子精於道者物物之言相合也。 静者本也，动者末也。 静与物为常，动与物为应者圣人也。 静与物为离，动与物为构者众人也。 圣人物物，众人物於物，知斯而已矣。 孔子曰：君子学以致其道。 庄周曰：道不可致。 孔子曰：中庸之为德也，其至矣乎。 庄周曰：德不可至。 何也？ 曰：孔子言其在人，庄周言其在天。 以其在天则自然之道奚由致，而自得之德奚由至。 以其在人则深造之道不可致，何由得道？ 日新之德不至，何由得德？ 惟夫能致然后可以不致，惟夫能至然后可以不至。 庄周之书，究性命之幽，合道德之散，将以去其昏昏而易之以昭昭，此归根复命之说、剖斗折衡之言所以由是起矣。 虽然，道於心而会於意，则道问而无应，又奚俟於言者欤。",
      "translated_text": "Words without unity flow forth endlessly, thus called \"daily arising.\" Speech that lacks unity yet emerges must have a root, hence \"harmonized with Heaven’s boundary.\" Heaven’s boundary is the wondrous root of spontaneity. Words rooted thus respond to change without limit, hence \"following the manifold.\" Words that respond to change without limit transcend the bounds of past and present, yet my speech knows no end—thus \"exhausting the years.\" Though Zhuang Zhou’s words may seem unbounded and diverse, they never depart from the root of the Dao. Thus Guo Xiang deemed him one who knew the root, for he understood Zhuangzi’s depth.\n\n### Miscellaneous Sayings\nWhat all things follow is the Dao. The Dao is that which things follow, yet it is nowhere absent. Thus, in greatness it never exceeds, and in minuteness it never omits. Each of the myriad things possesses its nature and capacity, which is why Zhuang Zhou’s writings speak of the kun and peng, the cicada and fledgling dove, the quail and wren, the ant and sheep, the fish and butterfly, the horse and ox, the mountain trees, and the like.\n\nThe root of the Dao lies before the Great Ultimate yet is not lofty; its foundation rests beneath the Six Poles yet is not deep. Before heaven and earth existed, it preceded their birth yet was not ancient. From antiquity it has endured, older than high antiquity yet not long-lived. The diversity of the ten thousand things is called abundance; unifying diversity is called greatness; possessing abundance is called great enterprise—this is the sage.\n\nOnly after form exists does name arise; only after name exists does division arise; only after division exists does adherence arise. Zhuangzi said: \"Once form and name are clear, adherence follows.\" Zhuangzi’s meaning—that one does not break Mo Ye blades, nor resent flying tiles, nor rage at empty boats—is the same.\n\nHeaven and earth possess great beauty yet do not speak; the four seasons have bright laws yet do not debate; the ten thousand things have completed principles yet do not explain. Thus Confucius wished to be wordless, saying: \"What does Heaven say? The four seasons proceed, the hundred things are born.\" Who but one who embodies the Dao could attain this?\n\nFollowing one’s nature is spontaneity; cultivating the Dao is contrivance. Spontaneity is Heaven; contrivance is man. What lies within spontaneity exists; what lies beyond contrivance does not. How can man take away what one has or add what one lacks? Thus, what one has is nature; what one lacks is what Zhuangzi called excess.\n\nVirtue is what one possesses. To add to what one already possesses is excess. Thus it is said: \"The joined toes and extra fingers arise from nature yet are excessive in virtue. The hanging wens and dangling tumors arise from form yet are excessive in nature.\"\n\nThe traces of the noble man may be limited or boundless, but the Dao of the sage knows no dullness or sharpness—this is what the people perceive. The noble man’s traces may be limited or boundless, yet his heart knows no difference between them. Thus it is said: \"Whether limited or boundless, one is joyful, for limitation and boundlessness are like the sequence of cold and heat, wind and rain.\"\n\nZhuangzi said: \"Do not let the artificial destroy the Mandate.\" The human Dao is called the artificial; the Heavenly Dao is called the Mandate. The Dao is like the year; the sage is like the seasons. Thus Zhuang Zhou composed *Autumn Floods* to speak of \"the time arriving\"—it is simply being timely. Yet petty scholars point to this and criticize it, no wonder they resent the summer insect’s inability to speak of ice or the well-frog’s inability to speak of the sea.\n\nZhuangzi said: \"Yan Hui has forgotten benevolence and righteousness, yet has not yet forgotten ritual and music.\" Benevolence and righteousness are forgotten first, ritual and music later—this implies benevolence and righteousness are not as profound as ritual and music. Here Zhuangzi first speaks of forgetting the inner, then the outer: benevolence and righteousness are inner, yet the outer—ritual and music—has not been forgotten. Only when inner and outer are forgotten can one attain \"sitting in forgetfulness.\" This is why his words differ.\n\nThe sage takes the necessary as unnecessary; the multitude takes the unnecessary as necessary. What does this mean? The great man’s words need not be reliable, his actions need not be resolute—this is taking the necessary as unnecessary. To insist that words be reliable and actions resolute is to take the unnecessary as necessary.\n\nSome of Zhuangzi’s words resemble those of sages and worthies; they cannot be entirely dismissed. The sage does not establish intent, yet intent always remains; does not assert the self, yet the self always exists. Moved only under compulsion, rising only when unavoidable—this is not acting with intent, not rising with self-assertion, but simply responding.\n\nZhuangzi said: \"That which things things is not thinged by things,\" which aligns with Xunzi’s words: \"One refined in the Dao things things.\" Stillness is the root; movement is the branch. The sage is one who is still and constant with things, moving and responsive to them. The multitude is one who is still and detached from things, moving and entangled with them. The sage things things; the multitude is thinged by things—this is the difference.\n\nConfucius said: \"The noble man studies to attain the Dao.\" Zhuang Zhou said: \"The Dao cannot be attained.\" Confucius said: \"As virtue, the *Doctrine of the Mean* is supreme.\" Zhuang Zhou said: \"Virtue cannot be reached.\" Why? Confucius spoke of what lies in man; Zhuang Zhou spoke of what lies in Heaven. If it lies in Heaven, how can the spontaneous Dao be attained? How can the self-possessed virtue be reached? If it lies in man, how can the profound Dao be attained? How can the ever-renewing virtue be reached? Only one who can attain may then not attain; only one who can reach may then not reach.\n\nZhuangzi’s writings delve into the mysteries of nature and destiny, unify the scattered threads of virtue and the Dao, aiming to dispel obscurity and replace it with clarity. Thus arise the teachings of returning to the root and restoring the Mandate, the words of smashing the bushel and breaking the scales.\n\nYet when the Dao resides in the heart and converges in the mind, inquiry into the Dao meets no response—what need is there for words?",
      "overlap_context": "ess. Thus it is said: \"How could one know why it is so or not so?\"\n\n### Dreaming of a Butterfly\nZhuangzi spoke of dreaming of a butterfly to express his contentment, and of fish to express his joy. The butterfly, small and fluttering, goes everywhere without hindrance; the fish, dwelling in the depths, preserves its life. Through these two creatures, he conveyed his sense of ease and delight, harmonizing all things in their diversity.\n\n### Goblet Words\nGoblet words are speech without fixed form.",
      "start_char": 596,
      "end_char": 1865,
      "start_sentence": 32,
      "end_sentence": 92,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.865657567977905,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\南华真经拾遗.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "盖无言者虽足以尽道之妙，而不言者无以明，故不得已而后起，感而后动，迫而后应，则驾其所说而载之於后，而使夫学者得意则亡象，得象则亡言，此亦庄子之意有异於世也。 庄子言泽雉之处樊中，以其失於真性也。 古之至人则能忘其机心，息其外虑，心与太虚齐，道以阴阳会，以天地为一朝，以旷代为一府。 无人非为异，故物不得而亲，不得而疏，此其迭出於范围之外，而又非泽雉之在乎樊中也。 庄子曰古之真人过而弗悔，当而不得，则是圣人未尝无过也。 过而不自以为悔，与天同也。 若其与人同者，则有改过，不吝其更也，人皆仰之者矣。 冬而燠，夏而寒，天地之过也。 天地且有过，况圣人乎。 大恐之谓惧，小恐之谓惴，庄子曰：大恐漫漫，小恐惴惴。 庄子之书，其通性命之分而不以死生祸福动其心，其近圣人也，自非明智不能及此明知矣。 读圣人之说亦足以及此，不足以及此而陷溺於周之说，则其为乱大矣。 夜气存者，万虑息也。 不定以存者，谓不能朝彻也，能朝彻则所谓复德之本也。 神有甚於圣而鼓舞万物者神也，与万物同忧者圣也。 神不圣则不行，圣不行不藏。 庄周之言尚神而贱圣，矫枉之过也。 庄子曰：自本自根。 本者一，在於木下。 根者木止於艮旁，本出於根而根附於本，相须而生也。 故本者命也，根者性也。 老子曰归根曰静，以言性也。 静曰复命，以言本也。 庄子之书有言真人至人者，以真者言乎其性也，至者人道之至也。 明者神之散，神者明之藏，是明由神之所致也，故曰明不胜神。 老子曰：天门开阖。 庄子曰：天门无有。 以其万物由之而出，故曰开阖。 以其万物由之而藏，故曰无有。 庄子之言滓溟者，所谓无尽之际复无尽也。 万物芸芸而生成於中，所以不见其极也。 万物备之於天地之中，而天地非有意於万物也，故曰大备矣。 莫若天地，然奚求焉，而大备矣。 万物亦备於我身，而我非外更役物也，故曰知大备者无求。 如此则自得而不遗於道也，安能舍己而逐物欤。 故曰无失无弃，不以物易已也。 庄子曰有名有实是物之居者，所谓在体为体，在用为用，而万物之所由是也。 无名无实在物之虚者，所谓不闻不见而必集於虚是也。 可言可意言而愈疏者，无言无意而道所以亲也。 庄周之书，载道之妙也，盖其言救性命未散之初，而所以觉天下之世俗也，岂非不本於道乎。 夫道海也，圣人百川也，道岁也，圣人时也。 百川虽不同，而所同者海。 四时虽不同，而所同者岁。 孔孟老庄之道虽适时不同，而要其归则岂离乎此哉。 读庄子之书，求其意而忘其言，可谓善读者矣。 南华真经拾遗竟",
      "translated_text": "For though silence may suffice to encompass the subtleties of the Dao, without speech there is no means to clarify it. Thus, only when compelled does one arise; only when moved does one act; only when pressed does one respond. Then, mounting the chariot of discourse, one bears the teachings onward, that scholars may grasp the meaning and forget the image, grasp the image and forget the words—this too is where Zhuangzi’s intent diverges from the world.\n\nZhuangzi speaks of the marsh pheasant confined in a pen, for it has lost its true nature. The perfected ones of antiquity could forget their cunning minds, still their external cares, align their hearts with the Great Void, and harmonize the Dao with the convergence of yin and yang. They took heaven and earth as a single morning, and distant ages as a single storehouse. None were deemed strange, so things could neither draw near nor grow distant—thus they emerged beyond all bounds, unlike the marsh pheasant trapped within its pen.\n\nZhuangzi said: \"The true person of old erred without regret, and when right did not rejoice\"—this shows that even sages are not without fault. To err without self-reproach is to be as one with Heaven. If one were to err as others do, there would be correction and no reluctance to change, and all would look up to such a one. Winter’s warmth and summer’s chill are Heaven and Earth’s errors—if even Heaven and Earth may err, how much more the sage?\n\nGreat fear is called dread; small fear is called anxiety. Zhuangzi said: \"Great dread is boundless; small anxiety is fretful.\" Zhuangzi’s writings penetrate the divisions of nature and destiny without allowing life and death, fortune and misfortune to disturb the heart. This is what brings him near to the sage—only one of luminous wisdom can attain such clarity. Reading the words of the sages may suffice to reach this, but failing to do so and sinking into Zhuang Zhou’s teachings instead would lead to great confusion.\n\nThe night’s qi endures when the myriad cares are stilled. If it does not settle and endure, one cannot attain morning clarity; to attain morning clarity is to return to the root of virtue. That which surpasses the sage and animates the myriad things is spirit; that which shares the sorrows of the myriad things is sageliness. Spirit without sageliness cannot act; sageliness without action cannot conceal.\n\nZhuang Zhou’s words exalt spirit and demean sageliness—this is an overcorrection of error. Zhuangzi said: \"From its root, from its source.\" The root is one, lying beneath the tree. The source is where the tree halts beside *gen*. The root emerges from the source, and the source clings to the root—they depend on each other to grow. Thus, the root is destiny, and the source is nature. Laozi said: \"Returning to the root is called stillness\"—this speaks of nature. \"Stillness is called returning to destiny\"—this speaks of the root.\n\nIn Zhuangzi’s writings, there are references to the true person and the perfected person: \"true\" speaks of their nature, while \"perfected\" speaks of the utmost in the human Dao. Clarity is the dispersion of spirit; spirit is the concealment of clarity. Thus, clarity arises from what spirit brings about, and so it is said that clarity cannot surpass spirit. Laozi said: \"The gate of Heaven opens and closes.\" Zhuangzi said: \"The gate of Heaven has no existence.\" Because the myriad things emerge from it, it is called \"opening and closing\"; because the myriad things are concealed within it, it is called \"nonexistence.\"\n\nZhuangzi’s words on the \"boundless deep\" refer to that which has no end, and beyond that, no end. The myriad things flourish and take form within it, so their limits cannot be seen. The myriad things are complete within heaven and earth, yet heaven and earth have no intention toward them—thus it is said: \"Great completeness.\" None is like heaven and earth, yet what do they seek? And yet they are greatly complete. The myriad things are also complete within my own body, yet I do not externally labor for them—thus it is said: \"One who knows great completeness seeks nothing.\" Being thus, one attains the Dao without loss and does not abandon it. How could one forsake the self to chase after things? Thus it is said: \"Lose nothing, discard nothing, do not exchange the self for things.\"\n\nZhuangzi said: \"There are names and realities—these are the dwellings of things.\" This means that in substance, it is substance; in function, it is function—this is how the myriad things arise. \"Without name or reality\" refers to the emptiness within things, where what is neither heard nor seen must gather in the void. What can be spoken or conceived only grows more distant; what is wordless and inconceivable is how the Dao draws near.\n\nZhuang Zhou’s writings convey the subtleties of the Dao, for his words seek to save nature and destiny before their dispersion and to awaken the world from its vulgar customs—how could this not be rooted in the Dao? The Dao is the sea; the sage is the hundred rivers. The Dao is the year; the sage is the seasons. Though the hundred rivers differ, what they share is the sea. Though the four seasons differ, what they share is the year. Though the Ways of Confucius, Mencius, Laozi, and Zhuangzi adapt to different times, in essence, do they not all return to this? To read Zhuangzi’s writings, seeking their meaning while forgetting their words—this may be called skillful reading.\n\n*Recovering the Lost Essentials of the True Classic of Southern Florescence* concludes.",
      "overlap_context": "not attain; only one who can reach may then not reach.\n\nZhuangzi’s writings delve into the mysteries of nature and destiny, unify the scattered threads of virtue and the Dao, aiming to dispel obscurity and replace it with clarity. Thus arise the teachings of returning to the root and restoring the Mandate, the words of smashing the bushel and breaking the scales.\n\nYet when the Dao resides in the heart and converges in the mind, inquiry into the Dao meets no response—what need is there for words?",
      "start_char": 1865,
      "end_char": 2891,
      "start_sentence": 93,
      "end_sentence": 138,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.291856288909912,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\南华真经拾遗.txt",
        "category": "玉诀类"
      }
    }
  ]
}