{
  "source_id": "南华真经章句音义余事杂录",
  "source_file": "chunked_daozang\\南华真经章句音义余事杂录.json",
  "total_chunks": 8,
  "total_original_chars": 9166,
  "total_translated_chars": 53584,
  "total_translation_time": 261.42675590515137,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\玉诀类\\南华真经章句音义余事杂录.txt",
    "category": "玉诀类"
  },
  "full_translation": "**Miscellaneous Records on the *True Scripture of Southern Florescence***\n\n**Title:** *Miscellaneous Records on the *True Scripture of Southern Florescence* by Xu*\n**Author:** Chen Jingyuan of the Northern Song Dynasty\n**Volume:** Two fascicles\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, *Jade Instructions* Category\n\n---\n\n### *Miscellaneous Records on the *True Scripture of Southern Florescence*, Fascicle One*\n\n#### Three Discourses by Gongsun Long\nOf the original six discourses, only the three cited in the *Zhuangzi* are recorded here.\n\n---\n\n#### **Discourse on the White Horse**\n\n**Question:** May it be said that a white horse is not a horse?\n**Answer:** It may.\n\nThose who hear subtle words and illuminate the kingly Way do not fail to establish guest and host, to engage in exchange and response, to borrow a single thing as the origin of the myriad transformations, and to lodge their discourse in words to rectify the errors of self and other. Thus, they raise the example of the white horse to confound sameness and difference.\n\n**Question:** How so?\n**Answer:** \"Horse\" is that by which form is named; \"white\" is that by which color is named. To name form and color is not to name form alone; hence, it is said that a white horse is not a horse.\n\nThe form of a horse illustrates that the forms of the myriad things are all material and functional; the color of a horse exemplifies that the kinds of the myriad things each have near and distant relations. To nurture the myriad things is to bring the world into accord; to preserve near and distant relations in dealing with others is to incite rebellion within the seas.\n\nFor example, if one separates color from the naming of a horse, all horses respond; if one clings to whiteness in seeking a horse, only a white horse is obtained. Thus, to name the form of a horse while clinging to a single white color is not to name the multitude of horses.\n\n**Question:** If there is a white horse, it cannot be said there is no horse. That which cannot be said to be without a horse is not a horse. Since there is a white horse, it cannot be said there is no horse—then is a white horse not a horse? If having a white horse is having a horse, why is whiteness not a horse? If white and horse are conjoined yet white is not a horse, why is this so?\n\n**Answer:** In seeking a horse, a yellow or black horse may both be obtained; in seeking a white horse, a yellow or black horse may not be obtained. Among all things, those that are near are few, and those that are distant are many—just as whiteness is but one among the multitude of colors.\n\nThus, if one separates whiteness in seeking a horse, yellow and black horses both arrive; if one names a horse while including whiteness, all other colors depart. The Way of cherishing harmony is likewise.\n\nIf a white horse were indeed a horse, then what is sought would be one and the same, and what is sought would be whiteness, no different from a horse. If a white horse were considered to be a horse, it would be but one horse, its material no different from that of other horses—just as the ruler’s favored one is but a single person, his worth no different from that of others.\n\nThe human heart does not remain constant toward one ruler, just as the form of a horse is not confined to one color. Thus, when the ruler loves one, they draw near; when the ruler distances them, they rebel. How can one favor one’s kin and distance the world?\n\nWhat is sought is no different from a yellow or black horse—sometimes obtainable, sometimes not. Why is this? Obtainable and unobtainable are clearly distinct; thus, a yellow or black horse is one and the same. It may respond to \"having a horse\" but not to \"having a white horse\"—this proves that a white horse is not a horse.\n\nThough a yellow or black horse is each a single horse, no different from a horse, it cannot respond [to \"white horse\"]. Why can the multitude of horses not respond to \"white horse\"? White is not yellow, yellow is not white—the five colors are clearly distinct in their mutual exclusions.\n\nIf a ruler treats others with partiality, others will likewise respond with partiality and rebel against the ruler. Will they willingly obey the ruler’s command? Thus, one who clings to whiteness in naming a horse cannot truly summon the multitude of horses.\n\n**Question:** If having color is taken to mean a horse is not a horse, yet there are no colorless horses in the world, can it be said there are no horses in the world? If having color is taken to mean a horse is not a horse, yet all horses in the world have color, how can it be said there are no horses? Just as all people have near and distant relations, it cannot be said there are no people.\n\n**Answer:** Horses inherently have color, hence there are white horses. If horses had no color, there would be horses as such—how then could there be white horses? Thus, whiteness is not a horse.\n\nFor example, horses all have color, hence there are white horses. If horses were originally without color and there were only horses as such, then how could there be white horses? Just as people must arise from kinds and clans, hence there are distinctions between Hua and Yi, if there were originally no lineages and only people as such, how could there be near and distant relations? Thus, whiteness is itself itself, not a horse.\n\nA white horse is horse and white. Horse and white horse—hence it is said: a white horse is not a horse. Since white is not a horse, white and horse are two things. To combine two things into a single body is not to refer to it exclusively as a horse. Thus, using horse to illustrate white, a white horse is not a horse.\n\n**Question:** Before horse is conjoined with white, it is a horse; before white is conjoined with horse, it is white. Combining horse and white to name it \"white horse\" is to use what is not conjoined to name what is conjoined—this is impermissible. Thus, it is impermissible to say a white horse is not a horse.\n\nThis is the guest restating the host’s position and challenging it.\n\nHorse is of the same kind as horse; white is of the same kind as white—hence it is said they are conjoined. Horse is not conjoined with white to be a horse; white is not conjoined with horse to be white—hence it is said they are not conjoined. Combining horse and white to name it \"white horse\" is to forcibly use white color as the name for horse—this meaning is impermissible. Thus, it is impermissible to say a white horse is not a horse.\n\nThe above \"impermissible\" is the host’s position; the following \"impermissible\" is the guest’s challenge.\n\n**Question:** If having a white horse is having a horse, may having a white horse be said to be having a yellow horse?\n**Answer:** It may not.\n\nThe host questions the guest: If one firmly takes a white horse to be having a horse, can a white horse be said to be a yellow horse?\nThe guest replies: It may not.\n\n**Answer:** To take having a horse as distinct from having a yellow horse is to distinguish a yellow horse from a horse. To distinguish a yellow horse from a horse is to take a yellow horse as not a horse. If a white horse is taken to be having a horse, yet a yellow horse cannot be a white horse, then a yellow horse is not a horse. Those who cling rigidly to this have never avoided error.\n\nTo take a yellow horse as not a horse while taking a white horse as having a horse is like a flying creature entering a pond or a coffin and outer coffin being in separate places—this is the world’s perverse speech and disordered discourse.\n\nYellow and white are colors; the multitude of horses are forms. To forcibly take color as form is what is meant by \"a flying creature entering a pond.\" The yellow horse and white horse are both horses, yet to select the white and discard the yellow is what is meant by \"the coffin and outer coffin being in separate places.\" Generally, the coffin and outer coffin depend on one another, just as lips and teeth rely on each other—once the lips are gone, the teeth grow cold; they cannot be in separate places. The four barbarians guard the outer lands, while the Central States rely on the inner; when inner and outer depend on one another, the world is at peace. If one favors the Central States and estranges the barbarians, then the barbarians will rebel. To muster troops and attack distant lands, so that the people cannot bear the burden, is to throw the Central States into chaos. With inner division and outer rebellion, the coffin and outer coffin in separate places—then what one has favored cannot alone support the ruler. Thus, to discard the yellow and take the white is the height of perversity and disorder.\n\nIt is said: To have a white horse cannot be called having no horse—this is what is meant by \"separating the white.\" Without separation, to have a white horse cannot be called having a horse. Therefore, what makes having a horse is solely taking the horse as having a horse, not taking the white horse as having a horse. Thus, its being having a horse cannot be called \"horse-horse.\"\n\nThe guest says: To separate the white is to have a horse; not to separate is to have a non-horse. But if the form of the horse and the color of the horse are firmly conjoined, this is two horses sharing a single body, and cannot be called \"horse-horse.\" Hence, one speaks of \"white horse.\"\n\nIt is said: The white is not fixed to what it whitens—one may forget it. All things universally possess the color white, hence it is said \"not fixed to what it whitens.\" Since white is not fixed to the horse, the horse is not exclusively white. Thus, to forget color in seeking the horse is to have all horses respond. To forget partiality in cherishing others is to have all under heaven cherished.\n\nThe white horse speaks of white, fixing what it whitens—what is fixed to whiten is not white. What fixes white to the horse is the horse’s white; how can it be white on its own? The horse makes no rejection or selection of color, hence yellow and black follow in response. To speak simply of \"horse\" is to make no rejection or selection among colors. Without selection, the horse responds to all; without rejection, all colors are present.\n\nThus, the sage is serene and forgetful, governing things with emptiness. Therefore, nothing is not ordered, and principle is fully realized. The white horse makes a selection of color, so yellow and black horses are rejected by color. Thus, only the white horse alone can respond. To discard the yellow and take the white is to have all horses guard their own colors, each becoming distinct and departing. Thus, only the white horse alone responds.\n\nThe ruler who favors what is partial and estranges all under heaven causes all under heaven to guard their estrangement, each becoming distinct and rebelling. When all under heaven rebels, who will respond to the ruler’s command? Will it be those he favors? Those he favors alone respond, but his command only increases disaster and cannot quell disorder.\n\nWhat makes no rejection is not what makes a rejection. Thus, it is said: The white horse is not a horse. Not to select the white is not to reject the yellow. Not to reject color means that color and horse have no power to reject. Thus, it is said: What makes no rejection is not what makes a rejection.\n\nGenerally, yellow and white in the horse are like closeness and distance in people. To favor the close and turn away from the distant is to have the distant rebel. When the distant departs and rebels, the close cannot survive alone. Thus, it is said: The white horse is not a horse.\n\nTherefore, the sage empties the heart and illumines with mystery, unifying all principles. Embracing the six directions within the breast, his spirit鉴 is abundant; mirroring the ten thousand images within a square inch, his spirit grows ever more still. Thus, he can be among the close without attachment, among the distant without estrangement. Though he makes no selection of closeness or distance, he also does not abandon closeness or distance. This is how the four seas are equally close and the ten thousand states are united as one.\n\n**On Pointing at Things**\nThere is nothing that is not pointed at, yet pointing is not pointing. Things and I have distinct capacities, yet nothing does not point to another. Thus, it is said: There is nothing that is not pointed at. What points to another points to right and wrong. When this and that mutually displace each other, right and wrong become one, returning to no pointing. Thus, it is said: Yet pointing is not pointing.\n\nIf there were no pointing in the world, nothing could be called a thing. All pointing is called right and wrong. That there is nothing that is not pointed at means that the nature of all things necessarily involves mutual right and wrong. If there were no things of right and wrong in the world, then there would not be a single thing that could be called a thing. Thus, where there are things, there is mutual right and wrong. Therefore, there is nothing that is not pointed at.\n\nIf pointing is not pointing in the world, can things be called pointing? That there is nothing that is not pointed at, yet it is called \"not pointing,\" means that the world is equalized—how can things be called pointing? All things falsely point to one another, hence all pointing is not pointing.\n\nPointing is what the world does not possess; things are what the world possesses. To take what the world possesses as what the world does not possess is impermissible. There is not a single day when the world lacks things, nor a single thing that is not fitting. Thus, to forcibly take things as pointing is impermissible.\n\nIf there is no pointing in the world, things cannot be called pointing. That there is no right and wrong in the world means that each thing fits its fitting and cannot be called right and wrong. Thus, there is no right and wrong. That things cannot be called pointing means they are not pointing. For example, water and fire have distinct natures, each fitting its use. Since there is no right and wrong, how can they be called right and wrong?\n\nThat pointing is not pointing means there is nothing that is not pointed at. That is, the things that are not pointing all falsely point to one another. That there is no pointing in the world and things cannot be called pointing does not mean there is \"not pointing.\" That things cannot be called pointing means there is no right and wrong. Not only is there no right and wrong, there is also no absence of right and wrong. Thus, it is said: There is no \"not pointing.\"\n\nThat there is no \"not pointing\" means there is nothing that is not pointed at. That there is nothing that is not pointed at means that pointing is not pointing. Because there is no absence of right and wrong, the ten thousand things all mutually affirm and negate. Thus, it is said: That there is no \"not pointing\" means there is nothing that is not pointed at.\n\nWhen both right and wrong and the absence of right and wrong are forgotten, one may engage in right and wrong all day yet remain free of right and wrong. Thus it is said: \"There is nothing that is not pointed at, yet pointing is not pointing.\" The absence of pointing in the world arises from things each having their names and not serving as pointers. Things possess their realities and each has its name—like Wang Liang’s skill in driving or Li Shou’s mastery of calculation—each thing serves its own function. Take the ears and eyes, for example: neither can be dispensed with, so they do not serve as right and wrong. To call what does not serve as a pointer a \"pointer\" is to include what does not serve as a pointer. All things do not serve as pointers; yet when some are called pointers, it is because things mutually affirm and negate one another, and this affirmation and negation cannot be fixed. Thus, they do not serve as pointers. To say that because there is what does not serve as a pointer, there is nothing that does not serve as a pointer, is not permissible. *Zhi* (之) means \"to suit.\" What does not serve as a pointer refers to things; what is called \"nothing that does not serve as a pointer\" refers to pointing. Because things suit pointing, it is not permissible.\n\nMoreover, \"pointing\" encompasses all under heaven. Sometimes one thing has two names of right and wrong; sometimes things mutually point to one another—all are called \"encompassing.\" That there is no pointing in the world does not mean things can be called \"without pointing.\" That they cannot be called \"without pointing\" means there is no \"not pointing.\" The names of right and wrong arise from things mutually opposing one another. Thus, it is said that things cannot be called \"without,\" for among the ten thousand things there is no pointing, yet also no absence of pointing. Thus, it is said: \"There is no 'not pointing.'\" That there is no \"not pointing\" means there is nothing that is not pointed at. To say there is no right and wrong arises from things, yet there is nothing that is not pointed at. Therefore, the sage seeks the person within right and wrong and thereby attains the person free of right and wrong.\n\nPointing is not \"not pointing\"; pointing and things are not pointing. To call it \"pointing\" is not to say there is no pointing. Since pointing cannot serve as pointing for things, it is not pointing. If there were no things in the world to point, who would directly call it \"not pointing\"? If there were no things in the world, who would directly call it \"pointing\"? If there were no things and no pointing in the world, all would be still—who then would call pointing \"not pointing\"? Who would call pointing \"pointing\"? If there is pointing in the world but no things to point, who would directly call it \"not pointing\" or \"not pointing because there are no things\"? If there were pointing but no things to apply it to, who would call pointing \"not pointing\"? Who would say it is \"not pointing because there are no things\"? Clearly, there is originally no pointing.\n\nMoreover, pointing inherently is not pointing—why must it depend on things to serve as pointing? When mutually examined, pointing itself is without pointing; how then can it serve as pointing for things? Clearly, the ten thousand things are each distinct, each serving its own purpose, without right and wrong. Therefore, the sage maintains threefold silence, at ease and expansive, forgetting right and forgetting wrong, not pursuing one ability nor neglecting one thing.\n\n---\n\n**Imperial Edict of the Tianbao Era**\nBy the grace of august Heaven and the favor of the ancestral spirits, the rites of reverent illumination are preserved in the ancestral canon. Zhuangzi, Wenzi, Liezi, and Kangcangzi are ranked among the perfected immortals. Embracing this emptiness and purity, they followed the sacred teachings of the Primordial Sage and propagated the great Dao throughout the human realm. Henceforth, the *Zhuangzi* shall be titled the *True Scripture of Southern Florescence*, the *Liezi* the *True Scripture of Thoroughgoing Emptiness*, the *Wenzi* the *True Scripture of Pervasive Mystery*, and the *Kangcangzi* the *True Scripture of Penetrating Spirit*. Issued on the twentieth day of the second month, the first year of the Tianbao era.\n\n---\n\n**Preface to the *True Scripture of Southern Florescence***\n*By Guo Xiang*\n\nZhuangzi may be said to have known the root. Thus, he never concealed his wild words. His words, though without convergence, uniquely respond—yet to respond without convergence, even if apt, is of no use. Words that do not pertain to things and affairs, though lofty, cannot be put into practice. There is indeed a difference between this and those who remain still and unmoving, rising only when compelled. He may be called one who knows the mind without mind. When the mind is without contrivance, it responds to stimuli as they come, adapting to the moment, speaking only with caution. Thus, he embodied transformation, flowing through the ages and obscuring things. How could he have set up oppositions, encountered alone, and discoursed beyond the realm? This is why his work, though not canonical, stands at the head of the hundred schools.\n\nYet though Zhuangzi did not fully embody it, his words reached the utmost. They unify the thread of heaven and earth, order the natures of the ten thousand things, comprehend the transformations of life and death, and illuminate the Dao of inner sageliness and outer kingship. Above, he knew that creation has no things; below, he knew that things create themselves. His words are vast, his intent profound—uttermost Dao, subtle and refined, serene and unconstrained. Unconstrained yet not arrogant, thus it is said: \"Not knowing where righteousness leads, wildly roaming yet treading the great square.\" Chewing and rejoicing in simplicity, drumming the belly and wandering in boundlessness. The perfected person reaches the extreme of no attachments; filial piety and compassion ultimately end in mutual forgetting. Ritual and music return to one’s innate abilities; loyalty and trust arise from celestial radiance. Using this radiance, one’s simplicity naturally forms. Thus, the numinous vessel transforms alone in the realm of profound obscurity, its source deep and its flow long.\n\nTherefore, where its long waves surge and its lofty winds blow, it harmonizes with the fittingness of things and accords with the people’s wishes. It broadens the narrow, resolves entanglements, and without applying the work of detachment, disperses self-importance and boasting. Thus, reading his book, one feels transcendent, as if one has already attained it—traversing Kunlun, crossing the great void, and wandering the courts of the indistinct and vague. Even the greedy and restless, the ambitious and hasty, if they but briefly grasp its lingering fragrance and taste its overflowing stream, catching even a faint echo of its resonance, may yet feel vast and free, forgetting form and attaining self-contentment. How much more those who delve into its distant depths and savor its eternal years? Thus, it extends far and wide, pure and remote, departing from dust and returning to the ultimate obscurity.\n\n---\n\n**Preface to the *Subcommentary on the True Scripture of Southern Florescence***\n*By Cheng Xuanying*\n\nZhuangzi expounds the deep roots of virtue and power, elucidates the wondrous purport of the profound mystery, unfolds the tranquility of non-action, and clarifies the obscure obscurity of solitary transformation. He bridles the nine schools and encompasses the hundred masters, truly the ultimate teaching within the realm, the subtle words beyond images.\n\nThe man’s surname was Zhuang, given name Zhou, courtesy name Zixiu. He was born in Meng County of Suiyang in the state of Song, studied under Master Sangzi, and received the title \"Immortal of Southern Florescence.\" At the beginning of the Warring States period, as the declining Zhou dynasty neared its end, he lamented the meager karmic lot of the common people and grieved the erosion of the Dao and virtue. Thus, with fervent resolve, he composed this discourse. His words are vast and expansive, his purport profound and far-reaching—beyond the grasp of lesser scholars or the shallow-minded.\n\nThe term *zi* is an honorific for one of virtue; in ancient times, a teacher was called *zi*, and here it also serves as the title of the book. It is not merely the collective name for the three Inner Chapters but a general designation for the hundred schools. The term *Inner Chapters* signifies that \"inner\" is set in contrast to \"outer,\" while *chapters* refers to the binding of bamboo slips. In antiquity, bamboo was cured to make slips, bound with leather thongs to form chapters—akin to modern pages bound into scrolls. Thus, Yuan Kai stated: \"Great matters are recorded on *ce*, while minor ones suffice on slips.\" The Inner Chapters discuss the root of principle, while the Outer Chapters recount events and traces. Though events may be manifest, they are not understood without principle; though principle is subtle and obscure, it is not revealed without events. To first clarify the wondrous principle, the Inner Chapters are placed first. Since the principle in the Inner Chapters is profound, each chapter is given a distinct title beyond the text. Guo Xiang followed this by providing annotations directly beneath the titles, as in *Free and Easy Wandering* and *The Equality of Things*. From the Outer Chapters onward, titles are taken from the first two characters of each chapter, as in *Webbed Toes* and *Horses’ Hooves*.\n\nRegarding *Free and Easy Wandering*, interpretations have varied across the ages. Here, I broadly outline three key explanations. The first, by Gu Tongbo: *Xiao* means \"dissolving,\" *yao* means \"far.\" Dissolving the burdens of deliberate action and perceiving afar the principle of non-action, one wanders the world—hence *Free and Easy Wandering*. The second, by Zhi Daolin: \"Treating things as things without being ensnared by them, one is thus free, unbound by external constraints. The mysterious resonance is swift without haste, hence far-reaching in all directions. Wandering the world thus, it is called *Free and Easy Wandering*.\" The third, by Wang Mu’ye: \"*Free and Easy* is the name for unrestrained self-contentment. With perfect virtue inwardly full, one is ever at ease. Forgetting both self and things, where does one not penetrate? Wandering the world thus, it is called *Free and Easy Wandering*.\"\n\nThe Inner Chapters clarify the root of principle, while the Outer Chapters recount events and traces. The Miscellaneous Chapters intermingle principle and events. Though the Inner Chapters clarify the root of principle, they are not without events; though the Outer Chapters recount events, they contain profound principle. The division of teachings and chapters is based on what is predominant.\n\nThus, *Free and Easy Wandering* reveals the beginning: the scholar who attains the Dao possesses wisdom and virtue, bright and keen, all his undertakings harmonious, encountering things with ease—hence the title. The sage who is \"without dependence\" reflects circumstances like a mirror, discerning both provisional and real wisdom, thus able to equalize the myriad conditions—hence *The Equality of Things* follows. Having pointed to the hooves and the heavens, merging with the common things, with a mind serene and still, one can safeguard and nurture life—hence *The Secret of Caring for Life* follows. With good and evil both forgotten and the interplay of circumstances and wisdom perfected, one can navigate human affairs—hence *The Human World* follows. With inner virtue complete, one can extend it outwardly to engage with things, rising and falling with them while inwardly and outwardly in mysterious accord—hence *Signs of Full Virtue* follows. Like still water holding a reflection, engaging with things without attachment, forgetting virtue and form, uniting inner and outer to their utmost, one can shape and perfect the common lot—hence *The Great and Venerable Teacher* follows. The true sage of antiquity knew heaven and knew man, sharing the work of creation, at once quiescent and responsive, thus able to guide and govern the multitude—hence *Fit for Emperors and Kings* follows.\n\nFrom *Webbed Toes* onward, chapters are titled by their first two characters, with no further significance. I will not elaborate on their order.\n\nSince ancient times, recluses of the Jin and Han dynasties have all immersed themselves in this work. Its meanings require annotation, and its expositions are seamless. Yet their elegant words all seek the hidden depths. Though I, Xuanying, am unworthy and dull, I have studied it since youth, refining my understanding with deep thought for thirty years. Following Zi Xuan’s commentary on the thirty-three chapters, I have composed this subcommentary, totaling thirty scrolls. Though my words are crude and my intent clumsy, I have striven to convey the heart’s direction and return. I dare not bequeath this to later generations but merely record it to prevent forgetting.\n\n*Miscellaneous Records on the* True Scripture of Southern Florescence *(Part One Concluded)*\n*Miscellaneous Records on the* True Scripture of Southern Florescence *(Part Two)*\n\n**Ninefold Testimony of the Heart Precepts, with Preface**\n*Composed by Yang Sifu, Minister of Rites*\n\nSifu—foolish to the utmost, unaware of his own folly and thus perpetuating it. Ever carving and corrupting, seeking praise to adorn himself, he never discerned the swift and facile deceptions that branch into grand delusions, forming a marsh of profound stupidity. Restless in haste, he shunned stillness.\n\nUpon reading Zhuang Zhou’s account of the Nine Evidences of the Sage Confucius, tears streamed down his face. Pressing his hand to his heart, he felt shame and remorse, realizing at last that his expansions and contractions had missed their subtlety, his adaptations their essence. Fire scorched his innards; ice chilled his bones. Following the example of the girdle-bound scholar who composed precepts, he looked up in reverence to the leather-belted admonisher, savoring these words to curb his faults. Casting aside distractions, he took up brush and ink, addressing each matter as it arose, presuming to expound and praise. Though insufficient to fully elucidate the Sage’s work, this effort at least expresses his sighs of awe—all owing to the power of the Nine Evidences.\n\nNo peak rivals the height of Taihang; no abyss matches the depth of the ocean’s tides. Things cannot magnify themselves; they are magnified by others. People cannot name themselves; they are named by their deeds. Thus, people may mirror things, and deeds may mirror people. When things are mirrored, their beauty shines without flaw; when people are mirrored, their renown endures without limit. The text of the Nine Evidences is such a mirror for people.\n\nTo rescue is to prevent a fall; to support is to avert collapse. Discerning the auspicious path and the virtuous person is like taking good medicine for a grave illness or holding a lamp in the darkest night—endless in gratitude and wonder. Daring to draw parallels, I recall the teachings of Laozi, the divine efficacy of the *Yellow Court*. Reading it ten thousand times, one is certain to ascend. Yet the promise of ascension beguiles the ears of the vulgar. Why? The truly reclusive cultivate their forms, the Dao flowing through their limbs, virtue tilling their five viscera. Thus, the *Inner and Outer Scenes of the Yellow Court* are books for refining body and heart.\n\nPeople delight in the distant but not the near, despise what they see but not what they hear. They find the easy easy and the unchanging hard, the difficult difficult and the unchallenging simple. Thus, they fabricate palaces of blossoms to extend their doctrines, flaunt gates of jade to exalt their words. Those who align with the Dao attain it through the Dao; those who align with virtue attain it through virtue. Heart hands to heart, mouth transmits to mouth—the essence lies in reading the text and thereby cultivating the heart. Reading the scripture ten thousand times, ears grow sharp, eyes bright, spirit clear, qi refined, defense and nourishment harmonized, the six palaces at peace. Delusions no longer intrude; sinews and bones purify themselves. One joins the true companions of the Upper Clarity, becoming a transcendent of this world.\n\nTo name immortals as an analogy is to spur practitioners—yet one must not be bloated with fat, the chest stuffed with scheming, harboring right and wrong, concealing joy and anger. Mouthing the words of the *Yellow Court* while the heart strays from the gates of the azure heavens is like carving compass and square on frost or aligning curves and straight lines in clouds. What merit is there in such exertion? Thus, those who recite the *Yellow Court* do not practice its teachings.\n\nThis book of Nine Evidences, when recited ten thousand times and put into action, enables one to distinguish right from wrong, discern disgrace from doubt, sever deceit, and guard against peril. A hundred blessings gather. Then, one’s integrity rivals the green pine, one’s name shines like the sun, equaling the noble men of antiquity and becoming a paragon of the age. Unmatched in character, steadfast and resplendent, one must not be obstinate and aggressive, cunning and oppressive, treading empty paths and courting danger, delighting in flattery and clumsiness. To mouth the words of the Nine Evidences while lacking a single observable deed is like carving rotten wood—no axe can shape it—or tempering rusted iron, which never regains its luster. Such effort is vain, leaving no true trace.\n\nThe fish-trap exists for the fish; once the fish is caught, the trap is forgotten. Words exist for meaning; once the meaning is grasped, words are forgotten. Beware of losing the fish while clinging to the trap, or losing the meaning while clinging to words. Such is the man who reads the Nine Evidences but does not practice them. Medicine cures illness only if taken steadfastly; books heal the body only if practiced steadfastly. Steadfast to the utmost, there is nothing they cannot cure. Thus, preserving life and safeguarding destiny requires no less effort than the *Yellow Court*; with a heart serene and body at ease, the Dao flows even more deeply than the *Inner Scene*.\n\nTo renounce the ambition of fame and rescue others, aligning with those who dwell in seclusion and avoid affairs—this benefits many, not just oneself. Vast is the aid, enduring the Way of the Sage Confucius. Yet one must not tread the paths of the fortunate, cling to the carriages of elders, utter refined words while concealing true conduct, or seek to transcend self without selflessness. To share a drink is to taste the sweet dew and savor the magic mushroom—this is to ride the clouds and transform like a feather.\n\nThe *Virtue Classic* says: \"Cultivate it in the self, and one’s virtue becomes true.\" There has never been one who attained true virtue without cultivation. If one reveres it like the divine, looks up to it like the sun and moon, so that a single word uttered echoes a thousand miles and a single deed performed draws the world like wind—this is the fruit of self-cultivation. There has never been one who attained it without cultivation.\n\nSifu, now forty-one, has risen to the third rank. Many call this luck. Yet when it comes to lofty reputation and ample profit, most fear falling short. For six or seven years, he has harbored the wish to rescue others, beginning with rescuing himself. But his steps toward the misty clouds, treading the path of rosy dawn, have not brought him close enough to the Milky Way. He fears the grace of rain and dew may not be abundant—this is the greed for fame, not the fear of excess or the caution of one who guards against complacency, nor the wisdom of knowing advance and retreat, life and death. Such a heart remains unresolved.\n\nTo bear a debt is to invite bandits’ pursuit. To wait for others to rescue oneself—how can one then rescue oneself? Now, having cleansed his heart and washed his innards, he bears the weight of these virtuous words. Day and night, he trembles as if standing at a deep ravine. He must curb desires, cast off adornments, dispel emotions, and banish delusions. Until his hair turns white, he dares not slacken.\n\nConfucius said: \"The human heart is harder to know than Heaven, for Heaven has its seasons—spring, autumn, winter, summer—and its fixed times of dawn and dusk, while man, with his deep countenance and deeper emotions, remains unfathomable.\" Truly, these words are so.\n\nThere are those whose appearance is stern yet whose heart is gentle and compliant; those whose appearance is mild yet whose heart is cruel and fierce; those whose appearance is weak yet whose heart is resolute and bold; those whose appearance is firm yet whose heart is timid and fearful. Some speak fair words yet break their promises; some speak sparingly yet love to domineer; some draw near to ritual yet delight in excess; some boast of their vigor yet lack restraint.\n\nThere are those who display the belly of a gentleman yet harbor the heart of a petty man, who parade the patterns of tigers and leopards yet possess the nature of dogs and sheep. There are those who outwardly appear restless yet inwardly remain calm and composed, who do not flaunt their merits but secretly bestow kindness and grace. There are those who govern others with upright words and observe people with a straight path, who feed on dregs yet follow the times, who endure defilement and forsake the vulgar.\n\nThere are those who humble themselves before others, who yield in speech yet reflect deeply on their conduct—such are the differences of the heart. Thus, one cannot fully know another. The noble person observes others through these nine matters as a bright mirror gazes upon the face, where not even the finest detail is hidden, as flowing light illuminates objects, where neither curve nor straightness can escape.\n\nIf the other advances or does not advance, this reveals their nature; if one retreats or does not retreat, the other perceives it. Through thorough examination, one gains understanding in the heart, and with clear verification, it is stored in the eyes. If among the nine signs one roughly discerns even a single trait, it is like the first leaf of an orchid—who would say it bears no fragrance? Or the first branch of a cassia—surely it is a fine tree.\n\nIf two or three traits are discerned, it is like a fishing boat entering a creek, avoiding the muddy currents, or a woodcutter ascending a mountain, shunning the common path. If four or five traits are discerned, it is like the edge of a whetted blade, irresistibly sharp, or the radiance of fine jade, unmatched in beauty.\n\nIf six or seven traits are discerned, it is like gold and stone placed in the courtyard, delighting in refined music, or embroidered robes stored in a chest, a joy to behold. If eight or nine traits are discerned, it is like a black dragon emerging from the sea, its light piercing myriad layers, or the roc’s wings soaring high, its fame resounding through the six directions.\n\nIf one finds such a person, one should incline one’s heart toward them—who would not strive to emulate them? The lofty are drawn near, the lowly are lifted, the bent are straightened, the sunken are raised, the virtuous are followed as teachers, the humble are befriended, the close are cherished, the distant are treated with courtesy. One who can observe oneself thus is said to observe others as well.\n\nTo know the highest is to aspire; to know the lowest is to fear. Cui Ziyu had his *Seat Inscription*, Zhuge Liang had his *Admonition on Self-Examination*—both served to shackle deceit and restrain excess. I dare not presume to imitate the ancients by creating new titles, but wish only to follow them in carving away right and wrong. Thus, I name this *Nine Signs: A Heart’s Admonition*, to serve as a measure for unchanging conduct. What follows is but my humble continuation.\n\n**To Send Them on a Distant Mission and Observe Their Loyalty**\nTo observe their loyalty, one must test them with deception to know their heart. How can the heart be known? Some, when feigned estrangement drives them away, will harbor resentment in their words; some, when feigned suppression bends their will, will speak with bitterness; some, when falsely accused to stifle their virtues, will speak defiantly; some, when feigned rebuke breaks their edge, will speak insolently.\n\nIf one tempts them with profit, their conduct will waver; if one provokes them with subtle words, their heart will stir; if one appeals to their private interests, matters will be easily swayed; if one upholds impartiality, matters will become difficult. These eight are not the marks of loyalty.\n\nThe noble person’s heart is clear and boundless, yet the deceptive use of joy, anger, distance, or closeness may stir it. If one incites them without reason, probing their nature, one must await their words to gauge their depth. It is like tempering a blade on a whetstone or cutting jade with sand—if it remains unsullied by dye or unthinned by grinding, that is the Way of the noble person.\n\nThe petty man is narrow and base, difficult to enlighten. Not knowing that the wise use falsehood to sift truth, or emptiness to lure substance, he instead grows resentful and opens the gates of misfortune. Words are the sprouts of the heart—by observing them, one discerns gain and loss.\n\n**To Assign Them Nearby Tasks and Observe Their Respect**\nTo observe their respect, one must also employ feigned right and wrong, advance and retreat, to assail their heart, and their true nature will stand revealed. If one draws near and they do not lose propriety, distances them and they do not speak amiss, angers them and they do not lose courtesy, delights them and they do not lose composure; if they are neither careless nor contemptuous, neither jesting nor frivolous; if they enter a room with dignity, their countenance composed, and leave as if facing a distinguished guest; if in quietude they remain wary, and in jest they grow more solemn; if they do not rely on favor to act recklessly nor wield authority to indulge desires—this is the height of respect.\n\nBut if they act as though blind before the worthy or deaf to instruction, delighting in frivolity without shame, taking a lost demeanor as beauty—how can this be called respect? If they are flogged in the marketplace and grow lazy when treated with familiarity, arrogant when drawn close, impure when urged, and muddied when mixed; if their conduct lacks any principle and their words are not weighed thrice; if they fail in vigilance—none of this is respect.\n\nThus, when the noble person receives extraordinary favor, they must be wary of petty men; when they receive extraordinary fortune, they must guard against ruin through neglect of courtesy and loss of respect.\n\n**To Overwhelm Them with Tasks and Observe Their Ability**\nPeople are hard to trust, for those who boast of themselves are many. To assess talent, one must first test it. Entrust them with numerous duties, overwhelm their minds, and wait to see if they falter—thus one discerns the capable from the inferior.\n\nThe capable will govern with calm and surely succeed, not sowing discord to hatch schemes. They will be present yet seem absent, abundant yet appear sparse. If they seize opportunities to indulge their will or rely on affairs to impose on others; if their beginning and end conflict, their principles break, and their commands fail; if their grand strategies are complete in inception yet lacking in conclusion, and their certain achievements rise only to fall—such are not the marks of ability.\n\nIn the first year of the Taihe reign, the dingwei year, summer, the fourth month, the eleventh day, respectfully inscribed.\n\nWhen right and wrong arise in chaos, the ears and eyes know not what to follow; strategies multiply in conflict, and the heart cannot hold its ground. Lacking clarity and understanding, one becomes overwhelmed by affairs, sinking into distress as if drunk, unable to meet deadlines without scattering the mind and soul. Thus exhausted and weakened, how can one accomplish anything? The capable, however, remedy flaws as if ever insufficient, manage crises with ease, dwell amidst excellence without ostentation, and mend many flaws without ruin. Their achievements grow, yet they remain humble; their governance expands, yet they grow more cautious. They do not seek empty praise to advance themselves, nor are they swayed by deceitful schemes to harm the public—this is the essence of managing complexity.\n\n**Test them with sudden questions to assess their wisdom.**\nWhen asked unexpectedly about what they have not considered, if their responses are reasoned and coherent, this is wisdom. As the *Book of Songs* says: *\"Both enlightened and wise, they preserve themselves.\"* If one speaks without thought, how can it be called enlightenment? If one responds without propriety, how can it be called wisdom? The ability to answer sudden questions lies in adaptability. Even in distress, one who can adapt and think anew when at an impasse follows the Way of the noble person. As the saying goes: *\"Observe their words to know their wisdom,\"* for caution in speech ensures it is not lightly given. Only in times of change can one avoid relying on deceit or clinging to crookedness; those whose words are incisive yet principles clear, whose path is straight yet foresight far-reaching—these are the truly wise. But if one seizes upon words to form intentions, hastily creating steps for gain or loss; if one exploits opportunities for schemes, planting the seeds of arrogance—this is base and unworthy of being called wisdom.\n\nWater, in relation to man, stops when dammed and flows when released; the key lies in reinforcing the dikes and guarding against overflow. Human speech is like water, and the mouth is its dike—how can one not guard against overflow and harm? One must deliberate before speaking.\n\n**Press them with urgent demands to assess their trustworthiness.**\nWhat is easy in leisure becomes difficult under pressure—those who endure difficulty demonstrate trustworthiness. Trust is the guiding principle of all conduct, the linchpin of all virtues. Should it falter, it will surely invite calamity. Why? The three luminaries move without end, the four seasons proceed without speech—this is the trust of Heaven. Nurturing all things according to their high and low stations, fostering growth according to depth and shallowness—this is the trust of Earth. Manifesting sacred power in five colors, bearing auspicious omens in double rings—this is the trust of the sun. Shining like a mirror when hidden, waxing and waning like a hook—this is the trust of the moon. Discarding weapons and provisions to issue warnings, gazing upon the linchpin to uphold sincerity—this is the trust of man. If Heaven loses trust, cold and heat reverse; if Earth loses trust, all things wither; if the two luminaries lose trust, their light wanes. If man loses trust, virtue finds no home. The words of the noble person are trustworthy and verifiable, so resentment and blame stay far from them. The words of the petty person are false and unverifiable, thus unworthy of trust—would they not rather flee blame? Who, then, could save them?\n\n**Entrust them with wealth to assess their benevolence.**\nPlace great profit before them and observe their hearts in secret. If deceit does not arise, this is benevolence.\n\nA mirror of clarity is unstained by dust or grime;\nA spirit serene is unled astray by craving or desire.\nThose who esteem virtue and uphold righteousness—\ntheir mirror is surely bright;\nThose who honor ritual and draw near the worthy—\ntheir dust remains unmingled.\nNaturally pure and white as jade,\nradiant and clear as ice,\nwhat filth could ever taint them?\nWhat greed or lust could ever defile?\nThey stand towering like a wall of fathoms,\nunmatched by any thing—\nsuch is the noble person.\n\nAffairs may call for ease and adaptability,\nyet one must not cling rigidly to a single course.\nLet contentment be the heart’s measure,\nand all taking be guided by rightness.\nFor taking with rightness,\npeople will not deem one a beast.\nThe petty person’s heart is a bottomless ravine;\ntheir taking knows no rightness.\nFor taking without rightness,\npeople will surely revile them.\n\nAs the saying goes:\n*To master oneself and return to ritual is benevolence.*\nThis is restraint of the heart.\nFacing wealth yet not losing one’s resolve—\nthis approaches mastery of self;\nSeeing gain yet not altering one’s conduct—\nthis approaches return to ritual.\nFair forms undermine the resolve of upright scholars;\ngreat profit corrupts the hearts of the upright.\nBeware!\n\n**Warn them of peril to assess their integrity.**\nConfront them with urgency,\nwarn them of danger and distress—\nthose who hold fast to the center,\nwho firmly uphold what is right without wavering,\nshow integrity.\nThe noble person faces hardship without seeking escape,\nthus ennobling their integrity and righteousness.\nTo cling to life without rightness rather than embrace death,\nto preserve oneself by betraying integrity rather than perish—\nthis is to kill others to live,\nto destroy others to survive.\nThe noble person does not act thus.\n\nThe benevolent possess courage,\nfor righteousness lies within;\nThe petty possess courage,\nbut calamity lies within.\nThe noble person, though beset, does not forget ritual;\nthough imperiled, does not abandon integrity.\nThe petty person, when beset, alters their nature;\nwhen imperiled, betrays what is right.\nOnce rightness is betrayed,\nit is like plunging down a precipice into raging waves,\nor leaping from a cliff after a flying pellet—\nswift as thunder after the lightning’s flash,\nor an arrow loosed from a snapped bowstring.\nWhat is gone cannot be reclaimed;\nwhat is lost cannot be saved.\nWith careful thought and earnest reflection,\none avoids lifelong regret.\nTo dwell in sorrow after joy\nis to preserve the renown of great integrity.\n\nAs the saying goes:\n*Facing great trials yet unshaken—\nsuch is the noble person.*\nThe petty person lacks foresight;\nfearing calamity that presses near,\nthey seek only to preserve themselves,\nyet cannot safeguard their integrity.\n\n**Intoxicate them with wine to observe their restraint.**\nThough the mad draft loosens the tongue,\none who remains reverent before drunkenness\nshows restraint.\nThus three cups suffice to know when to stop;\na hundred bows honor the guest—\nno slanted cap betrays disorder,\nno overturned carriage brings regret,\nfor this is how one escapes the woes of wine.\nAs for wine’s effect on people:\nin moderation, it harmonizes the qi;\nin excess, it disorders the spirit.\nIt loosens the tongue’s restraint,\ndisturbs the tranquil heart.\nFoul words arise, voices grow louder;\nperverse deeds appear, and demeanor turns fierce.\nRight and wrong swarm like bees,\nsleeves are rolled, collars grasped—\nevil is followed like a current,\nand one knows not what they grasp.\nThey rush into fire and water,\nheedless of shame after drunkenness,\nplunging headlong into madness,\nunable to avert disaster before sobriety.\nSuch blind fools willingly fall into ruin,\nbringing sorrow upon themselves—\nyet what pity do they deserve?\n\nBut when goblets and platters are arrayed,\ncups fly in disarray,\nand one’s demeanor remains solemn,\ntheir conduct measured and dignified,\ntheir expression respectful and self-controlled,\ntheir face never slackening to offend—\nwhen they gauge their portion to share in joy,\ntheir capacity to meet the feast,\nfearing the loss of restraint—\nthis is the way of the wise.\n\nAs the saying goes:\n*Only with wine is there no limit—\nyet one must not descend into chaos.*\nEven the sage deeply warned against it.\n\n**Mix them with others to observe their demeanor.**\nDo not restrain women,\nbut mingle them among the company,\nand watch their laughter and speech—\nthus one knows their fondness for beauty.\nThose with arched brows and radiant charm,\ngraceful forms and lovely bearing—\ntheir cheeks outshine the lotus’s blush,\ntheir complexions rival ice and snow.\nGolden sparrows dangle from their hairpins,\njade pendants hang at their waists.\nTheir bright eyes stir the Wu Gorge’s depths,\ntheir gleaming teeth part like the Luo Goddess’s.\nTheir weeping could halt a galloping horse,\ntheir smile could topple a city.\nEven steadfast men are moved by them,\neven the resolute turn to look.\nFragrant winds draw forth their allure,\nand the heart grows restless, ill at ease;\nsunlight glints on their powdered faces,\nand the mind lingers, lost in thought.\nHow much more so for the common crowd?\n\nYet some can scorn such filth,\nbanish such enchanting beauty.\nTheir minds remain untouched,\ntheir natures untainted by strong temptation.\nThey feel shame at the songs of *Sangzhong*,\ngrief at the poems of *Xinglu*.\nBy night, they hold candles to avoid suspicion;\nby day, they lower their voices to enter a room.\nTheir actions do not burden themselves,\ntheir conduct does not defile their hearts.\nWithin the inner chambers, all is pure and tranquil;\ntheir virtue is refined and unadulterated.\nThey hear words as if from kin,\nyet regard such beauty as they would a foe.\nTo turn the heart that loves beauty\ntoward loving the worthy—\nthis is goodness.\nLet all people take heed!\n\n**Postscript**\nThe ancients did not speak lightly,\nfor they were ashamed if their conduct fell short.\nThough my understanding is shallow and dull,\nI have delighted in these teachings.\nNow, in my flawed compilation and explanation,\nI feel twice the weight upon my heart.\nThough these words exist,\nmy conduct does not match them.\nI daily reflect on these sayings,\nreading and amending them.\nThe discerning may fear that my actions fall short of my words—\nthey will worry for me.\nThe deluded may rejoice that my actions fall short of my words—\nthey will mock me.\nYet since a true person has spoken,\nhow could I abandon the Way mid-course?\nI must ensure that those who would mock me do not mock,\nthat those who would worry for me do not worry—\nthis will take time.\nThose who know me will see my heart;\nthose who do not know me—\nhow dare I speak of my aspirations?\nI must examine myself with vigilance and act accordingly.\n\n*Concluding the Miscellaneous Records of the Southern Florescence Scripture.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "南华真经余事杂录 经名：南华真经徐事杂录。 北宋陈景元撰。 二卷。 底本出处：《正统道藏》洞神部玉诀类。 南华真经余事杂录上 公孙龙论三首 元有六论，今祇录庄子所引三首。 白马论 白马非马，可乎？ 曰：可。 夫闻微言，明王道，莫不立宾主，致往复，假一物以为万化之宗，寄言论而齐彼我之谬，故举白马以混同异。 曰：何哉？ 曰：马者，所以命形也； 白者，所以命色也。 命形色者，非命形也，故曰白马非马。 马形者，喻万物之形皆材用也； 马色者，况万物种类各有亲疏也。 以养万物则天下归，存亲疏以待人则海内叛。 譬如离色命马，众马斯应，守白求马，唯得白马。 故命马形而守一白色者，非命众马也。 曰：有白马不可谓无马也，不可谓无马者，非马也。 既有白马不可谓之无马，则白马岂非马乎？ 有白马为有马，白之非马，何也。 白与马连而白非马，何故。 曰：求马，黄黑马皆可致； 求白马，黄黑马不可致。 凡物亲者少，疏者多，如一白之於众色也。 故离白求马，黄黑皆至，兼白命马，众色咸去。 怀柔之道亦犹此也。 使白马乃马也，是所求一也，所求一者白者。 不异马也。 设使白马乃为有马者，但是一马耳，其材不异众马也。 犹君之所私者，但是一人耳，其贤不异众人也。 人心不常於一君，亦犹马形不专於一色，故君之爱己则附之，君之疏己则叛之，何可私其亲党而疏於天下乎。 所求不异如黄黑马，有可有不可，何也。 可与不可，其相非明，故黄黑马一也。 而可以应有马，而不可以应有白马，是白马之非马审矣。 如黄黑马亦各一马，不异马也。 而不可以应。 众马不可以应白马者，何哉。 白非黄，黄非白，五色相非分明矣。 君既私以待人，人亦私以叛君，宁肯应君命乎。 故守白命马者非能致众马审矣。 曰：以马之有色为非马，天下非有无色之马也，天下无马可乎。 以马有色为非马者，天下马皆有色，岂无马乎。 犹人皆有亲疏，不可谓无人也。 曰：马固有色，故有白马。 使马无色，有马如已耳，安取白马。 故白者非马也。 如，而也。 马皆有色，故有白马耳。 若使马元无色，而独有马而已者，则马耳，安取白马乎？ 如人必因种类而生，故有华夷之别，若使元无氏族而独有人者，安取亲疏乎。 故白者自是自，非马者也。 白马者，马与白也。 马与白马也，故曰：白马非马也。 白既非马，则白与马二物矣，合二物以共体，则不可偏谓之马，故以马而喻白，则白马为非马也。 曰：马未与白为马，白未与马为白，合马与白复名白马，是相与以不相与为名，未可。 故曰白马非马未可。 此宾述主义而难之也。 马自与马为类，白自与白为类，故曰相与也。 马不与白为马，白不与马为白，故曰不相与也。 合马与白，复名白马，乃是强用白色以为马名，其义未可，故以白马为非马者未可也。 上之未可主义，下之未可宾难也。 曰：以有白马为有马，谓有白马为有黄马，可乎曰未可。 主责宾曰，定以白马为有马者，则白马可得为黄马乎。 宾曰，未可也。 曰：以有马为异有黄马，是异黄马於马也。 异黄马於马，是以黄马为非马。 既以白马为有马，而黄马不得为白马，则黄马为非马； 明执者未尝不失矣。 以黄马为非马，而以白马为有马，此飞者入池而棺椁异处，此天下之悖言乱辞也。",
      "translated_text": "**Miscellaneous Records on the *True Scripture of Southern Florescence***\n\n**Title:** *Miscellaneous Records on the *True Scripture of Southern Florescence* by Xu*\n**Author:** Chen Jingyuan of the Northern Song Dynasty\n**Volume:** Two fascicles\n**Source Text:** *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, *Jade Instructions* Category\n\n---\n\n### *Miscellaneous Records on the *True Scripture of Southern Florescence*, Fascicle One*\n\n#### Three Discourses by Gongsun Long\nOf the original six discourses, only the three cited in the *Zhuangzi* are recorded here.\n\n---\n\n#### **Discourse on the White Horse**\n\n**Question:** May it be said that a white horse is not a horse?\n**Answer:** It may.\n\nThose who hear subtle words and illuminate the kingly Way do not fail to establish guest and host, to engage in exchange and response, to borrow a single thing as the origin of the myriad transformations, and to lodge their discourse in words to rectify the errors of self and other. Thus, they raise the example of the white horse to confound sameness and difference.\n\n**Question:** How so?\n**Answer:** \"Horse\" is that by which form is named; \"white\" is that by which color is named. To name form and color is not to name form alone; hence, it is said that a white horse is not a horse.\n\nThe form of a horse illustrates that the forms of the myriad things are all material and functional; the color of a horse exemplifies that the kinds of the myriad things each have near and distant relations. To nurture the myriad things is to bring the world into accord; to preserve near and distant relations in dealing with others is to incite rebellion within the seas.\n\nFor example, if one separates color from the naming of a horse, all horses respond; if one clings to whiteness in seeking a horse, only a white horse is obtained. Thus, to name the form of a horse while clinging to a single white color is not to name the multitude of horses.\n\n**Question:** If there is a white horse, it cannot be said there is no horse. That which cannot be said to be without a horse is not a horse. Since there is a white horse, it cannot be said there is no horse—then is a white horse not a horse? If having a white horse is having a horse, why is whiteness not a horse? If white and horse are conjoined yet white is not a horse, why is this so?\n\n**Answer:** In seeking a horse, a yellow or black horse may both be obtained; in seeking a white horse, a yellow or black horse may not be obtained. Among all things, those that are near are few, and those that are distant are many—just as whiteness is but one among the multitude of colors.\n\nThus, if one separates whiteness in seeking a horse, yellow and black horses both arrive; if one names a horse while including whiteness, all other colors depart. The Way of cherishing harmony is likewise.\n\nIf a white horse were indeed a horse, then what is sought would be one and the same, and what is sought would be whiteness, no different from a horse. If a white horse were considered to be a horse, it would be but one horse, its material no different from that of other horses—just as the ruler’s favored one is but a single person, his worth no different from that of others.\n\nThe human heart does not remain constant toward one ruler, just as the form of a horse is not confined to one color. Thus, when the ruler loves one, they draw near; when the ruler distances them, they rebel. How can one favor one’s kin and distance the world?\n\nWhat is sought is no different from a yellow or black horse—sometimes obtainable, sometimes not. Why is this? Obtainable and unobtainable are clearly distinct; thus, a yellow or black horse is one and the same. It may respond to \"having a horse\" but not to \"having a white horse\"—this proves that a white horse is not a horse.\n\nThough a yellow or black horse is each a single horse, no different from a horse, it cannot respond [to \"white horse\"]. Why can the multitude of horses not respond to \"white horse\"? White is not yellow, yellow is not white—the five colors are clearly distinct in their mutual exclusions.\n\nIf a ruler treats others with partiality, others will likewise respond with partiality and rebel against the ruler. Will they willingly obey the ruler’s command? Thus, one who clings to whiteness in naming a horse cannot truly summon the multitude of horses.\n\n**Question:** If having color is taken to mean a horse is not a horse, yet there are no colorless horses in the world, can it be said there are no horses in the world? If having color is taken to mean a horse is not a horse, yet all horses in the world have color, how can it be said there are no horses? Just as all people have near and distant relations, it cannot be said there are no people.\n\n**Answer:** Horses inherently have color, hence there are white horses. If horses had no color, there would be horses as such—how then could there be white horses? Thus, whiteness is not a horse.\n\nFor example, horses all have color, hence there are white horses. If horses were originally without color and there were only horses as such, then how could there be white horses? Just as people must arise from kinds and clans, hence there are distinctions between Hua and Yi, if there were originally no lineages and only people as such, how could there be near and distant relations? Thus, whiteness is itself itself, not a horse.\n\nA white horse is horse and white. Horse and white horse—hence it is said: a white horse is not a horse. Since white is not a horse, white and horse are two things. To combine two things into a single body is not to refer to it exclusively as a horse. Thus, using horse to illustrate white, a white horse is not a horse.\n\n**Question:** Before horse is conjoined with white, it is a horse; before white is conjoined with horse, it is white. Combining horse and white to name it \"white horse\" is to use what is not conjoined to name what is conjoined—this is impermissible. Thus, it is impermissible to say a white horse is not a horse.\n\nThis is the guest restating the host’s position and challenging it.\n\nHorse is of the same kind as horse; white is of the same kind as white—hence it is said they are conjoined. Horse is not conjoined with white to be a horse; white is not conjoined with horse to be white—hence it is said they are not conjoined. Combining horse and white to name it \"white horse\" is to forcibly use white color as the name for horse—this meaning is impermissible. Thus, it is impermissible to say a white horse is not a horse.\n\nThe above \"impermissible\" is the host’s position; the following \"impermissible\" is the guest’s challenge.\n\n**Question:** If having a white horse is having a horse, may having a white horse be said to be having a yellow horse?\n**Answer:** It may not.\n\nThe host questions the guest: If one firmly takes a white horse to be having a horse, can a white horse be said to be a yellow horse?\nThe guest replies: It may not.\n\n**Answer:** To take having a horse as distinct from having a yellow horse is to distinguish a yellow horse from a horse. To distinguish a yellow horse from a horse is to take a yellow horse as not a horse. If a white horse is taken to be having a horse, yet a yellow horse cannot be a white horse, then a yellow horse is not a horse. Those who cling rigidly to this have never avoided error.\n\nTo take a yellow horse as not a horse while taking a white horse as having a horse is like a flying creature entering a pond or a coffin and outer coffin being in separate places—this is the world’s perverse speech and disordered discourse.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1253,
      "start_sentence": 0,
      "end_sentence": 72,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.54108762741089,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\南华真经章句音义余事杂录.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "黄白，色也，众马，形也，而强以色为形，飞者入池之谓也。 黄马白马同为马也，而取白弃黄，棺椁异处之谓也。 凡棺椁之相待，犹唇齿之相依，历亡齿寒，不可异处也。 夫四夷守外，诸夏待内，内外相依，天下安矣。 若乃私诸夏而疏夷狄； 则夷狄叛矣，勒兵伐远，人不堪会，则诸夏乱矣。 内离外叛，棺椁异所，则君之所私者，不能独辅君矣。 故弃黄取白，悖乱之甚矣。 曰：有白马不可谓无马者，离白之谓也。 不离者，有白马不可谓有马也。 故所以为有马者，独以马为有马耳，非有白马为有马，故其为有马也，不可以谓马马也。 宾曰，离白是为有马，不离实为非马。 但以马形马色坚相连属，便是二马共体，不可谓之马马，故连称白马也。 曰：白者不定所白，忘之而可也。 万物通有白色，故曰不定所白，白既不定在马，马亦不专於白，故忘色以求马，众马皆应矣，忘私以亲人，天下皆亲矣。 白马者言白，定所白也，定所白者，非白也。 定白在马者，乃马之白也； 安得自为白乎。 马者无去取於色，故黄黑次所以应。 直云马者，是於众色无所去取也，无取，故马无不应，无去，故色无不在。 是以圣人澹然忘怀，而以虚统物，故物无不治而理无不极。 白马者有去取於色，黄黑马皆所以色去，故唯白马独可以应耳。 去黄取白，则众马各守其色，自殊而去，故唯白马独应矣。 王者党其所私而疏天下，则天下各守其疏，自殊而叛矣。 天下俱叛，谁当应君命哉。 其应所私乎，所私独应，命适足以增祸，不能静乱也。 无去者，非有去也。 故曰白马非马。 不取於白者，是不去於黄也，不去於色则色之与马非有能去，故曰无去者，非有去也。 凡黄白之在马，犹亲疏之在人，私亲而背疏则疏者叛矣，疏者离叛则亲不能独存矣。 故曰白马非马。 是以圣人虚心玄照，理无不统，怀六合於胸中而灵鉴有余，镜万像於方寸而其神弥静。 故能处亲而无亲，在疏而无疏，虽不取於亲疏，亦不舍於亲疏，所以四海同亲，万国共贯也。 指物论 物莫非指，而指非指。 物我殊能，莫非相指，故曰物莫非指。 相指者，相是非也。 彼此相推，是非混一，归於无指，故曰，而指非指。 天下无指，物无可以谓物。 指皆谓是非也，所以物莫非指者，凡物之情必相是非，天下若无是非之物，则无一物而可谓之物。 是以有物即相是非，故物莫非指也。 非指者天下，而物可谓指乎。 物莫非指而又谓之非指者，天下齐焉，而物其可谓之指乎。 物物皆妄相指，故指皆非指也。 指也者，天下之所无也； 物也者，天下之所有也。 以天下之所有，为天下之所无，未可。 天下无一日而无物，无一物而非适，故强以物为指者，未可也。 天下无指，而物不可谓指也，所以天下无是非者，物各适其适，不可谓之是非，故无是非也，不可谓指者，非指也。 譬如水火殊性，各适其用，既无是非，安可谓之是非乎。 非指者，物莫非指也。 即夫非指之物，莫不妄相指也。 天下无指而物不可谓指者，非有非指也。 物不可谓指者，无是非也。 岂唯无是非乎，亦无无是非也。 故曰非有非指。 非有非指者，物莫非指也，物莫非指者，而指非指也。 以其无无是非，故万物莫不相是非，故曰非有非指者，物莫非指也。",
      "translated_text": "Yellow and white are colors; the multitude of horses are forms. To forcibly take color as form is what is meant by \"a flying creature entering a pond.\" The yellow horse and white horse are both horses, yet to select the white and discard the yellow is what is meant by \"the coffin and outer coffin being in separate places.\" Generally, the coffin and outer coffin depend on one another, just as lips and teeth rely on each other—once the lips are gone, the teeth grow cold; they cannot be in separate places. The four barbarians guard the outer lands, while the Central States rely on the inner; when inner and outer depend on one another, the world is at peace. If one favors the Central States and estranges the barbarians, then the barbarians will rebel. To muster troops and attack distant lands, so that the people cannot bear the burden, is to throw the Central States into chaos. With inner division and outer rebellion, the coffin and outer coffin in separate places—then what one has favored cannot alone support the ruler. Thus, to discard the yellow and take the white is the height of perversity and disorder.\n\nIt is said: To have a white horse cannot be called having no horse—this is what is meant by \"separating the white.\" Without separation, to have a white horse cannot be called having a horse. Therefore, what makes having a horse is solely taking the horse as having a horse, not taking the white horse as having a horse. Thus, its being having a horse cannot be called \"horse-horse.\"\n\nThe guest says: To separate the white is to have a horse; not to separate is to have a non-horse. But if the form of the horse and the color of the horse are firmly conjoined, this is two horses sharing a single body, and cannot be called \"horse-horse.\" Hence, one speaks of \"white horse.\"\n\nIt is said: The white is not fixed to what it whitens—one may forget it. All things universally possess the color white, hence it is said \"not fixed to what it whitens.\" Since white is not fixed to the horse, the horse is not exclusively white. Thus, to forget color in seeking the horse is to have all horses respond. To forget partiality in cherishing others is to have all under heaven cherished.\n\nThe white horse speaks of white, fixing what it whitens—what is fixed to whiten is not white. What fixes white to the horse is the horse’s white; how can it be white on its own? The horse makes no rejection or selection of color, hence yellow and black follow in response. To speak simply of \"horse\" is to make no rejection or selection among colors. Without selection, the horse responds to all; without rejection, all colors are present.\n\nThus, the sage is serene and forgetful, governing things with emptiness. Therefore, nothing is not ordered, and principle is fully realized. The white horse makes a selection of color, so yellow and black horses are rejected by color. Thus, only the white horse alone can respond. To discard the yellow and take the white is to have all horses guard their own colors, each becoming distinct and departing. Thus, only the white horse alone responds.\n\nThe ruler who favors what is partial and estranges all under heaven causes all under heaven to guard their estrangement, each becoming distinct and rebelling. When all under heaven rebels, who will respond to the ruler’s command? Will it be those he favors? Those he favors alone respond, but his command only increases disaster and cannot quell disorder.\n\nWhat makes no rejection is not what makes a rejection. Thus, it is said: The white horse is not a horse. Not to select the white is not to reject the yellow. Not to reject color means that color and horse have no power to reject. Thus, it is said: What makes no rejection is not what makes a rejection.\n\nGenerally, yellow and white in the horse are like closeness and distance in people. To favor the close and turn away from the distant is to have the distant rebel. When the distant departs and rebels, the close cannot survive alone. Thus, it is said: The white horse is not a horse.\n\nTherefore, the sage empties the heart and illumines with mystery, unifying all principles. Embracing the six directions within the breast, his spirit鉴 is abundant; mirroring the ten thousand images within a square inch, his spirit grows ever more still. Thus, he can be among the close without attachment, among the distant without estrangement. Though he makes no selection of closeness or distance, he also does not abandon closeness or distance. This is how the four seas are equally close and the ten thousand states are united as one.\n\n**On Pointing at Things**\nThere is nothing that is not pointed at, yet pointing is not pointing. Things and I have distinct capacities, yet nothing does not point to another. Thus, it is said: There is nothing that is not pointed at. What points to another points to right and wrong. When this and that mutually displace each other, right and wrong become one, returning to no pointing. Thus, it is said: Yet pointing is not pointing.\n\nIf there were no pointing in the world, nothing could be called a thing. All pointing is called right and wrong. That there is nothing that is not pointed at means that the nature of all things necessarily involves mutual right and wrong. If there were no things of right and wrong in the world, then there would not be a single thing that could be called a thing. Thus, where there are things, there is mutual right and wrong. Therefore, there is nothing that is not pointed at.\n\nIf pointing is not pointing in the world, can things be called pointing? That there is nothing that is not pointed at, yet it is called \"not pointing,\" means that the world is equalized—how can things be called pointing? All things falsely point to one another, hence all pointing is not pointing.\n\nPointing is what the world does not possess; things are what the world possesses. To take what the world possesses as what the world does not possess is impermissible. There is not a single day when the world lacks things, nor a single thing that is not fitting. Thus, to forcibly take things as pointing is impermissible.\n\nIf there is no pointing in the world, things cannot be called pointing. That there is no right and wrong in the world means that each thing fits its fitting and cannot be called right and wrong. Thus, there is no right and wrong. That things cannot be called pointing means they are not pointing. For example, water and fire have distinct natures, each fitting its use. Since there is no right and wrong, how can they be called right and wrong?\n\nThat pointing is not pointing means there is nothing that is not pointed at. That is, the things that are not pointing all falsely point to one another. That there is no pointing in the world and things cannot be called pointing does not mean there is \"not pointing.\" That things cannot be called pointing means there is no right and wrong. Not only is there no right and wrong, there is also no absence of right and wrong. Thus, it is said: There is no \"not pointing.\"\n\nThat there is no \"not pointing\" means there is nothing that is not pointed at. That there is nothing that is not pointed at means that pointing is not pointing. Because there is no absence of right and wrong, the ten thousand things all mutually affirm and negate. Thus, it is said: That there is no \"not pointing\" means there is nothing that is not pointed at.",
      "overlap_context": "sh a yellow horse from a horse is to take a yellow horse as not a horse. If a white horse is taken to be having a horse, yet a yellow horse cannot be a white horse, then a yellow horse is not a horse. Those who cling rigidly to this have never avoided error.\n\nTo take a yellow horse as not a horse while taking a white horse as having a horse is like a flying creature entering a pond or a coffin and outer coffin being in separate places—this is the world’s perverse speech and disordered discourse.",
      "start_char": 1253,
      "end_char": 2475,
      "start_sentence": 73,
      "end_sentence": 130,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.070611238479614,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\南华真经章句音义余事杂录.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "无是非亦无无是非两忘之，故终日是非而无是非，故曰物莫非指者，而指非指也。 天下无指者生於物之各有名，不为指也，物有其实而各有名，谓若王良善御，隶首善计，彼物各自为用。 譬之耳目，废一不可，故不为是非也。 不为指而谓之指，是兼不为指。 物皆不为指； 而或谓之指者，是彼此之物兼相是非，而是非莫定，故不为指也。 以有不为指之无不为指，未可。 之，适也。 有不为指谓物也，无不谓指谓指也。 以物适指故未可也。 且指者，天下之所兼。 或一物而有是非二名，或彼此更相为指，皆谓之兼也。 天下无指者，物不可谓无指也，不可谓无指者，非有非指也。 是非之名生於物相彼，故曰物不可谓无，即此万物无指而又无无指，故曰非有非指也。 非有非指者，物莫非指。 谓无是非者生於物，莫非指也。 是以圣人求人於是非之内，乃得无是非人也。 指非非指也，指与物非指也。 夫谓之指者，非无指也，指既不能与物为指，故非指也。 使天下无物指，谁径谓非指； 天下无物，谁径谓指。 设使天下无物无指，则寂然矣，谁谓指为非指乎。 谁谓指为指乎。 天下有指无物指，谁径非指，径谓无物非指。 设使有指而无物，可施指者，谁谓有指为非指乎？ 谁谓以无物故非指乎？ 明本无指也。 且夫指固自为非指，奚待於物而乃与为指。 反覆相推，则指自为无指，何能与物为指乎？ 明万物万殊，各自为物，各有所宜，无是非也。 是以圣人三默恬恢，忘是忘非，不奔一能，不遗一物也。 唐天宝手诏 昊天眷命，列祖降灵，休照之仪，存乎祖典。 庄子、文子、列子、亢仓子等，列在真仙，体兹虚白，师玄元之圣教，弘大道於人寰。 观其庄子，依旧号曰南华真经，列子号曰冲虚真经，文子号曰通玄真经，亢仓子号曰洞灵真经。 天宝元年二月二十日下。 南华真经序　　　　　　郭象撰 夫庄子者，可谓知本矣，故未始藏其狂言。 言虽无会而独应者也，夫应而非会则虽当无用，言非物事，则虽高不行，与夫寂然不动不得已而后起者固有间矣，斯可谓知无心者也。 夫心无为则随感而应，应随其时，言唯谨尔。 故与化为体，流万代而冥物，岂曾设对独遘而游谈乎方外哉，此其所以不经而为百家之冠也。 然庄生虽未体之，言则至矣。 通天地之统，序万物之性，达死生之变，而明内圣外王之道，上知造化无物，下知有物之自造也。 其言宏绰，其旨玄妙至至之道，融微旨雅，泰然遣放，放而不敖，故曰不知义之所适，猖狂妄行而蹈其大方，含哺而熙乎澹泊，鼓腹而游乎混茫。 至人极乎无亲，孝慈终於兼忘，礼乐复乎已能，忠信发乎天光，用其光则其朴自成，是以神器独化於玄冥之境而源深流长也。 故其长波之所荡，高风之所扇，畅乎物宜，适乎民愿，弘其鄙，解其悬，洒落之功未加而矜夸所以散，故观其书超然自以为已当，经昆仑，涉太虚，而游惚恍之庭矣。 虽复贪婪之人，进躁之士，暂而揽其余芳，味其溢流，彷佛其音影，犹足旷然有忘形自得之怀，况探其远情而玩永年者乎。 遂绵邈清遐，去离尘埃，而返冥极者也。 南华真经疏序　　　　成玄英撰 夫庄子者，所以申道德之深根，述重玄之妙旨，畅无为之恬惔，明独化之窅冥，钳键九流，括囊百氏，谅区中之至教，实象外之微言者也。",
      "translated_text": "When both right and wrong and the absence of right and wrong are forgotten, one may engage in right and wrong all day yet remain free of right and wrong. Thus it is said: \"There is nothing that is not pointed at, yet pointing is not pointing.\" The absence of pointing in the world arises from things each having their names and not serving as pointers. Things possess their realities and each has its name—like Wang Liang’s skill in driving or Li Shou’s mastery of calculation—each thing serves its own function. Take the ears and eyes, for example: neither can be dispensed with, so they do not serve as right and wrong. To call what does not serve as a pointer a \"pointer\" is to include what does not serve as a pointer. All things do not serve as pointers; yet when some are called pointers, it is because things mutually affirm and negate one another, and this affirmation and negation cannot be fixed. Thus, they do not serve as pointers. To say that because there is what does not serve as a pointer, there is nothing that does not serve as a pointer, is not permissible. *Zhi* (之) means \"to suit.\" What does not serve as a pointer refers to things; what is called \"nothing that does not serve as a pointer\" refers to pointing. Because things suit pointing, it is not permissible.\n\nMoreover, \"pointing\" encompasses all under heaven. Sometimes one thing has two names of right and wrong; sometimes things mutually point to one another—all are called \"encompassing.\" That there is no pointing in the world does not mean things can be called \"without pointing.\" That they cannot be called \"without pointing\" means there is no \"not pointing.\" The names of right and wrong arise from things mutually opposing one another. Thus, it is said that things cannot be called \"without,\" for among the ten thousand things there is no pointing, yet also no absence of pointing. Thus, it is said: \"There is no 'not pointing.'\" That there is no \"not pointing\" means there is nothing that is not pointed at. To say there is no right and wrong arises from things, yet there is nothing that is not pointed at. Therefore, the sage seeks the person within right and wrong and thereby attains the person free of right and wrong.\n\nPointing is not \"not pointing\"; pointing and things are not pointing. To call it \"pointing\" is not to say there is no pointing. Since pointing cannot serve as pointing for things, it is not pointing. If there were no things in the world to point, who would directly call it \"not pointing\"? If there were no things in the world, who would directly call it \"pointing\"? If there were no things and no pointing in the world, all would be still—who then would call pointing \"not pointing\"? Who would call pointing \"pointing\"? If there is pointing in the world but no things to point, who would directly call it \"not pointing\" or \"not pointing because there are no things\"? If there were pointing but no things to apply it to, who would call pointing \"not pointing\"? Who would say it is \"not pointing because there are no things\"? Clearly, there is originally no pointing.\n\nMoreover, pointing inherently is not pointing—why must it depend on things to serve as pointing? When mutually examined, pointing itself is without pointing; how then can it serve as pointing for things? Clearly, the ten thousand things are each distinct, each serving its own purpose, without right and wrong. Therefore, the sage maintains threefold silence, at ease and expansive, forgetting right and forgetting wrong, not pursuing one ability nor neglecting one thing.\n\n---\n\n**Imperial Edict of the Tianbao Era**\nBy the grace of august Heaven and the favor of the ancestral spirits, the rites of reverent illumination are preserved in the ancestral canon. Zhuangzi, Wenzi, Liezi, and Kangcangzi are ranked among the perfected immortals. Embracing this emptiness and purity, they followed the sacred teachings of the Primordial Sage and propagated the great Dao throughout the human realm. Henceforth, the *Zhuangzi* shall be titled the *True Scripture of Southern Florescence*, the *Liezi* the *True Scripture of Thoroughgoing Emptiness*, the *Wenzi* the *True Scripture of Pervasive Mystery*, and the *Kangcangzi* the *True Scripture of Penetrating Spirit*. Issued on the twentieth day of the second month, the first year of the Tianbao era.\n\n---\n\n**Preface to the *True Scripture of Southern Florescence***\n*By Guo Xiang*\n\nZhuangzi may be said to have known the root. Thus, he never concealed his wild words. His words, though without convergence, uniquely respond—yet to respond without convergence, even if apt, is of no use. Words that do not pertain to things and affairs, though lofty, cannot be put into practice. There is indeed a difference between this and those who remain still and unmoving, rising only when compelled. He may be called one who knows the mind without mind. When the mind is without contrivance, it responds to stimuli as they come, adapting to the moment, speaking only with caution. Thus, he embodied transformation, flowing through the ages and obscuring things. How could he have set up oppositions, encountered alone, and discoursed beyond the realm? This is why his work, though not canonical, stands at the head of the hundred schools.\n\nYet though Zhuangzi did not fully embody it, his words reached the utmost. They unify the thread of heaven and earth, order the natures of the ten thousand things, comprehend the transformations of life and death, and illuminate the Dao of inner sageliness and outer kingship. Above, he knew that creation has no things; below, he knew that things create themselves. His words are vast, his intent profound—uttermost Dao, subtle and refined, serene and unconstrained. Unconstrained yet not arrogant, thus it is said: \"Not knowing where righteousness leads, wildly roaming yet treading the great square.\" Chewing and rejoicing in simplicity, drumming the belly and wandering in boundlessness. The perfected person reaches the extreme of no attachments; filial piety and compassion ultimately end in mutual forgetting. Ritual and music return to one’s innate abilities; loyalty and trust arise from celestial radiance. Using this radiance, one’s simplicity naturally forms. Thus, the numinous vessel transforms alone in the realm of profound obscurity, its source deep and its flow long.\n\nTherefore, where its long waves surge and its lofty winds blow, it harmonizes with the fittingness of things and accords with the people’s wishes. It broadens the narrow, resolves entanglements, and without applying the work of detachment, disperses self-importance and boasting. Thus, reading his book, one feels transcendent, as if one has already attained it—traversing Kunlun, crossing the great void, and wandering the courts of the indistinct and vague. Even the greedy and restless, the ambitious and hasty, if they but briefly grasp its lingering fragrance and taste its overflowing stream, catching even a faint echo of its resonance, may yet feel vast and free, forgetting form and attaining self-contentment. How much more those who delve into its distant depths and savor its eternal years? Thus, it extends far and wide, pure and remote, departing from dust and returning to the ultimate obscurity.\n\n---\n\n**Preface to the *Subcommentary on the True Scripture of Southern Florescence***\n*By Cheng Xuanying*\n\nZhuangzi expounds the deep roots of virtue and power, elucidates the wondrous purport of the profound mystery, unfolds the tranquility of non-action, and clarifies the obscure obscurity of solitary transformation. He bridles the nine schools and encompasses the hundred masters, truly the ultimate teaching within the realm, the subtle words beyond images.",
      "overlap_context": "d wrong. Not only is there no right and wrong, there is also no absence of right and wrong. Thus, it is said: There is no \"not pointing.\"\n\nThat there is no \"not pointing\" means there is nothing that is not pointed at. That there is nothing that is not pointed at means that pointing is not pointing. Because there is no absence of right and wrong, the ten thousand things all mutually affirm and negate. Thus, it is said: That there is no \"not pointing\" means there is nothing that is not pointed at.",
      "start_char": 2475,
      "end_char": 3726,
      "start_sentence": 131,
      "end_sentence": 180,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.603227376937866,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\南华真经章句音义余事杂录.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "其人姓庄名周，字子休，生宋国睢阳蒙县，师长桑公子，受号南华仙人。 当战国之初，降衰周之末，叹苍生之业薄，伤道德之陵夷，乃慷慨发愤，爰着斯论。 其言大而博，其旨深而远，非下士之所闻，岂浅识之能究。 所言子者，是有德之嘉号，古人称师曰子，亦言子是书名。 非但三篇之总名，亦是百家之通题。 所言内篇者，内以待外立名，篇以编简为义，古者杀青为简，以韦为编，编简成篇，犹今连纸成卷也。 故元恺云，大事书之於策，小事简牍而已，内则谈於理本，外则语其事迹，事虽彰着，非理不通，理既幽微，非事莫显，欲先明妙理，故前标内篇，内篇理深，故每於文外别立篇目。 郭象仍於题下即注解之，逍遥齐物之类是也。 自外篇以去则取篇首二字为其题目，骈拇马蹄之类是也。 所言逍遥游者，古今解释不同，今泛举弦纲略为三释。 所言三者，第一，顾桐栢云，逍者销也，遥者远也，销尽有为累，远见无为理，以斯而游天下，故曰逍遥，第二，支道林云，物物而不物於物，故逍然不我待，玄感不疾而速，故遥然靡所不为，以斯而游天下，故曰逍遥游； 第三，王穆夜云，逍遥者，盖是放任自得之名也，至德内充，无时不适，忘怀应物，何往不通，以斯而游天下，故曰逍遥游。 内篇明於理本，外篇语其事迹，杂篇杂明於理事。 内篇虽明於理本，不无事迹，外篇虽明事迹，甚有妙理，但立教分篇据多论耳。 所以逍遥达初者，言达道之士智德明敏，所造皆适，遇物逍遥，故以逍遥命物； 夫无待圣人，照机若镜，既明权实之二智，故能大齐於万境，故以齐物次之； 既指马蹄天地，混同庶物，心灵凝澹，可以摄卫养生，故以养生主次之，既善恶两忘，境智俱妙，随变任化，可以处涉人间，故以人间世次； 之内德圆满，故能支离其德，外以接物，既而随物升降，内外冥契，故以德充符次之； 止水留鉴，接物无心，忘德忘形，契外会内之极，可以匠成庶品，故以大宗师次之，古之真圣知天知人，与造化同功，即寂即应，既而驱驭群品，故以应帝王次之。 骈拇以下，皆以篇名二字为题，既无别义。 今不复次篇之，而自古高士，晋汉逸人皆莫不耽骯为之。 义训须注，述无可间，然并有美辞，咸能索隐。 玄英不揆庸昧，少而习焉，研精覃思三十年矣。 依子玄所注三十三篇，辄为疏解，总三十卷，虽复词情疏拙，亦颇有心迹指归，不敢贻厥后人。 聊自记其遗忘耳。 南华真经徐事杂录上竟 南华真经余事杂录下",
      "translated_text": "The man’s surname was Zhuang, given name Zhou, courtesy name Zixiu. He was born in Meng County of Suiyang in the state of Song, studied under Master Sangzi, and received the title \"Immortal of Southern Florescence.\" At the beginning of the Warring States period, as the declining Zhou dynasty neared its end, he lamented the meager karmic lot of the common people and grieved the erosion of the Dao and virtue. Thus, with fervent resolve, he composed this discourse. His words are vast and expansive, his purport profound and far-reaching—beyond the grasp of lesser scholars or the shallow-minded.\n\nThe term *zi* is an honorific for one of virtue; in ancient times, a teacher was called *zi*, and here it also serves as the title of the book. It is not merely the collective name for the three Inner Chapters but a general designation for the hundred schools. The term *Inner Chapters* signifies that \"inner\" is set in contrast to \"outer,\" while *chapters* refers to the binding of bamboo slips. In antiquity, bamboo was cured to make slips, bound with leather thongs to form chapters—akin to modern pages bound into scrolls. Thus, Yuan Kai stated: \"Great matters are recorded on *ce*, while minor ones suffice on slips.\" The Inner Chapters discuss the root of principle, while the Outer Chapters recount events and traces. Though events may be manifest, they are not understood without principle; though principle is subtle and obscure, it is not revealed without events. To first clarify the wondrous principle, the Inner Chapters are placed first. Since the principle in the Inner Chapters is profound, each chapter is given a distinct title beyond the text. Guo Xiang followed this by providing annotations directly beneath the titles, as in *Free and Easy Wandering* and *The Equality of Things*. From the Outer Chapters onward, titles are taken from the first two characters of each chapter, as in *Webbed Toes* and *Horses’ Hooves*.\n\nRegarding *Free and Easy Wandering*, interpretations have varied across the ages. Here, I broadly outline three key explanations. The first, by Gu Tongbo: *Xiao* means \"dissolving,\" *yao* means \"far.\" Dissolving the burdens of deliberate action and perceiving afar the principle of non-action, one wanders the world—hence *Free and Easy Wandering*. The second, by Zhi Daolin: \"Treating things as things without being ensnared by them, one is thus free, unbound by external constraints. The mysterious resonance is swift without haste, hence far-reaching in all directions. Wandering the world thus, it is called *Free and Easy Wandering*.\" The third, by Wang Mu’ye: \"*Free and Easy* is the name for unrestrained self-contentment. With perfect virtue inwardly full, one is ever at ease. Forgetting both self and things, where does one not penetrate? Wandering the world thus, it is called *Free and Easy Wandering*.\"\n\nThe Inner Chapters clarify the root of principle, while the Outer Chapters recount events and traces. The Miscellaneous Chapters intermingle principle and events. Though the Inner Chapters clarify the root of principle, they are not without events; though the Outer Chapters recount events, they contain profound principle. The division of teachings and chapters is based on what is predominant.\n\nThus, *Free and Easy Wandering* reveals the beginning: the scholar who attains the Dao possesses wisdom and virtue, bright and keen, all his undertakings harmonious, encountering things with ease—hence the title. The sage who is \"without dependence\" reflects circumstances like a mirror, discerning both provisional and real wisdom, thus able to equalize the myriad conditions—hence *The Equality of Things* follows. Having pointed to the hooves and the heavens, merging with the common things, with a mind serene and still, one can safeguard and nurture life—hence *The Secret of Caring for Life* follows. With good and evil both forgotten and the interplay of circumstances and wisdom perfected, one can navigate human affairs—hence *The Human World* follows. With inner virtue complete, one can extend it outwardly to engage with things, rising and falling with them while inwardly and outwardly in mysterious accord—hence *Signs of Full Virtue* follows. Like still water holding a reflection, engaging with things without attachment, forgetting virtue and form, uniting inner and outer to their utmost, one can shape and perfect the common lot—hence *The Great and Venerable Teacher* follows. The true sage of antiquity knew heaven and knew man, sharing the work of creation, at once quiescent and responsive, thus able to guide and govern the multitude—hence *Fit for Emperors and Kings* follows.\n\nFrom *Webbed Toes* onward, chapters are titled by their first two characters, with no further significance. I will not elaborate on their order.\n\nSince ancient times, recluses of the Jin and Han dynasties have all immersed themselves in this work. Its meanings require annotation, and its expositions are seamless. Yet their elegant words all seek the hidden depths. Though I, Xuanying, am unworthy and dull, I have studied it since youth, refining my understanding with deep thought for thirty years. Following Zi Xuan’s commentary on the thirty-three chapters, I have composed this subcommentary, totaling thirty scrolls. Though my words are crude and my intent clumsy, I have striven to convey the heart’s direction and return. I dare not bequeath this to later generations but merely record it to prevent forgetting.\n\n*Miscellaneous Records on the* True Scripture of Southern Florescence *(Part One Concluded)*\n*Miscellaneous Records on the* True Scripture of Southern Florescence *(Part Two)*",
      "overlap_context": "eturning to the ultimate obscurity.\n\n---\n\n**Preface to the *Subcommentary on the True Scripture of Southern Florescence***\n*By Cheng Xuanying*\n\nZhuangzi expounds the deep roots of virtue and power, elucidates the wondrous purport of the profound mystery, unfolds the tranquility of non-action, and clarifies the obscure obscurity of solitary transformation. He bridles the nine schools and encompasses the hundred masters, truly the ultimate teaching within the realm, the subtle words beyond images.",
      "start_char": 3726,
      "end_char": 4670,
      "start_sentence": 181,
      "end_sentence": 207,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.097829341888428,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\南华真经章句音义余事杂录.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "九证心戒并序 礼部尚书杨嗣复撰 嗣复，愚之至也，不知愚而所以愚。 每雕讹斲弊，求多誉而自饰，曾未辩巧捷轻，曲为大妄之枝叶，作大愚之薮泽，但务躁进，不欲静止。 因读庄周书至孔圣九征，乃汶然流涕，扪心愧意，方觉弛张不得其妙，通变不得其精，於是火集中肠，冰寒肌骨。 同书绅之作戒，仰佩韦以自儆，赞味斯语，欲寡其过； 乃屏繁机，操笔砚，各随本事，妄有褒阐，虽不足发挥圣作，亦表吁嗟，尚其九征之力也。 太行莫并其高，溟津莫同其深。 且物不能自大，因人而大之； 人不能自名，因事而名之，即人可以鉴物，事可以鉴人。 物当鉴而振美无歜，人当鉴而垂誉无极，其九征之文，即鉴人者也。 救必坠。 扶必颠，登吉途辩吉士，如沉痾之服良药，昏夜之有灯烛，欣叹不尽。 敢引类而侔之，尝闻老氏教夸，黄庭神验，读之万徧，必得上升。 上升之言诱聋俗耳，何者。 真隐之士，自保形骸，道播四支，德耕五藏，故述黄庭内景外景； 并是修身修心之书。 以时人乐其远而不乐其近，贱其目而不贱其闻，故易於易而不易於不易，难於难而不难於不难，乃假立蕊宫，欲伸其说，虚张琼户，使重斯言。 所以同於道者，道以得之； 同於德者，德以得之。 以心付心，以口传口，其要在一读其文，即一修其心。 读经万徧，即耳聪目明，神清气灵，调卫理营，六府和平。 於是染妄不干，筋骸自洁，同上清之真侣，为出世之高人。 指名喻仙以励行者，未可脂肥满腹，营虑填胸，含蓄是非，包藏喜怒。 口念黄庭之字，心迷碧落之门，如刻规矩於冰霜，齐曲直於云雾，有何功德而自勤哉。 於是念黄庭之人，非修黄庭之事也。 此九征之书亦念至万徧，随而行之，即知正知非，辩辱辩疑，绝诈防机，百禄来依。 於是节贯青松，名高白日，同上古之君子，为当代之令人，风格难俦，贞华独立，未可刚愎好犯，憸虐居中，蹈虚迹危，甘佞乐拙。 口念九征之字，身无一行可观，如朽木强雕，难施斤斧，腐铁虽淬，终乏光辉，徒有虚劳而无实迹。 夫筌者所以在鱼，得鱼而忘筌； 言者所以在意，得意而忘言。 慎勿失鱼而空执其筌，失意而空守其言，此是读九征之夫，非行九征之士也。 如药能疗病，必坚服之； 书能治身，必坚行之。 坚之至，无不愈矣。 即存身保命，力不减於黄庭； 心淡体闲，道更融於内景。 以其拔驰名救物之志，同深居避事之徒，彼利一身，此利多人，弘济邈然，孔圣之道长矣。 而乃不践幸人之迹，长亲长者之车，口出雅言，腹包至行，常能外己，不私於身，还同饮，醴味芝，便是云行羽化。 德经曰：修之身，其德乃真。 未有己不修而有真德者也。 若使敬之如神明，仰之如日月，一言出而千里响应，一行着而四海趋风者，此修身而得之，未有不修而得之者也。 嗣复年四十一，造次至三品，人多称幸，凡得其如高名厚利，唯恐不及，自六七载有拯物之愿，先自拯之心。 但力步烟霄，蹑云霞之路，未足上亲天汉，恐雨露之恩不浓，此贪名也，非畏盈惧满，慎终之心也，非知进退存亡之心也。 如此心未决增。 负，乘致寇之迫，必待人而拯己，何力能自拯也。 今者洗心涤肠，祇荷德语，昼夜栗栗，若临深谷，必薄嗜捐华，祛情除妄，至于白首，不敢中废。",
      "translated_text": "**Ninefold Testimony of the Heart Precepts, with Preface**\n*Composed by Yang Sifu, Minister of Rites*\n\nSifu—foolish to the utmost, unaware of his own folly and thus perpetuating it. Ever carving and corrupting, seeking praise to adorn himself, he never discerned the swift and facile deceptions that branch into grand delusions, forming a marsh of profound stupidity. Restless in haste, he shunned stillness.\n\nUpon reading Zhuang Zhou’s account of the Nine Evidences of the Sage Confucius, tears streamed down his face. Pressing his hand to his heart, he felt shame and remorse, realizing at last that his expansions and contractions had missed their subtlety, his adaptations their essence. Fire scorched his innards; ice chilled his bones. Following the example of the girdle-bound scholar who composed precepts, he looked up in reverence to the leather-belted admonisher, savoring these words to curb his faults. Casting aside distractions, he took up brush and ink, addressing each matter as it arose, presuming to expound and praise. Though insufficient to fully elucidate the Sage’s work, this effort at least expresses his sighs of awe—all owing to the power of the Nine Evidences.\n\nNo peak rivals the height of Taihang; no abyss matches the depth of the ocean’s tides. Things cannot magnify themselves; they are magnified by others. People cannot name themselves; they are named by their deeds. Thus, people may mirror things, and deeds may mirror people. When things are mirrored, their beauty shines without flaw; when people are mirrored, their renown endures without limit. The text of the Nine Evidences is such a mirror for people.\n\nTo rescue is to prevent a fall; to support is to avert collapse. Discerning the auspicious path and the virtuous person is like taking good medicine for a grave illness or holding a lamp in the darkest night—endless in gratitude and wonder. Daring to draw parallels, I recall the teachings of Laozi, the divine efficacy of the *Yellow Court*. Reading it ten thousand times, one is certain to ascend. Yet the promise of ascension beguiles the ears of the vulgar. Why? The truly reclusive cultivate their forms, the Dao flowing through their limbs, virtue tilling their five viscera. Thus, the *Inner and Outer Scenes of the Yellow Court* are books for refining body and heart.\n\nPeople delight in the distant but not the near, despise what they see but not what they hear. They find the easy easy and the unchanging hard, the difficult difficult and the unchallenging simple. Thus, they fabricate palaces of blossoms to extend their doctrines, flaunt gates of jade to exalt their words. Those who align with the Dao attain it through the Dao; those who align with virtue attain it through virtue. Heart hands to heart, mouth transmits to mouth—the essence lies in reading the text and thereby cultivating the heart. Reading the scripture ten thousand times, ears grow sharp, eyes bright, spirit clear, qi refined, defense and nourishment harmonized, the six palaces at peace. Delusions no longer intrude; sinews and bones purify themselves. One joins the true companions of the Upper Clarity, becoming a transcendent of this world.\n\nTo name immortals as an analogy is to spur practitioners—yet one must not be bloated with fat, the chest stuffed with scheming, harboring right and wrong, concealing joy and anger. Mouthing the words of the *Yellow Court* while the heart strays from the gates of the azure heavens is like carving compass and square on frost or aligning curves and straight lines in clouds. What merit is there in such exertion? Thus, those who recite the *Yellow Court* do not practice its teachings.\n\nThis book of Nine Evidences, when recited ten thousand times and put into action, enables one to distinguish right from wrong, discern disgrace from doubt, sever deceit, and guard against peril. A hundred blessings gather. Then, one’s integrity rivals the green pine, one’s name shines like the sun, equaling the noble men of antiquity and becoming a paragon of the age. Unmatched in character, steadfast and resplendent, one must not be obstinate and aggressive, cunning and oppressive, treading empty paths and courting danger, delighting in flattery and clumsiness. To mouth the words of the Nine Evidences while lacking a single observable deed is like carving rotten wood—no axe can shape it—or tempering rusted iron, which never regains its luster. Such effort is vain, leaving no true trace.\n\nThe fish-trap exists for the fish; once the fish is caught, the trap is forgotten. Words exist for meaning; once the meaning is grasped, words are forgotten. Beware of losing the fish while clinging to the trap, or losing the meaning while clinging to words. Such is the man who reads the Nine Evidences but does not practice them. Medicine cures illness only if taken steadfastly; books heal the body only if practiced steadfastly. Steadfast to the utmost, there is nothing they cannot cure. Thus, preserving life and safeguarding destiny requires no less effort than the *Yellow Court*; with a heart serene and body at ease, the Dao flows even more deeply than the *Inner Scene*.\n\nTo renounce the ambition of fame and rescue others, aligning with those who dwell in seclusion and avoid affairs—this benefits many, not just oneself. Vast is the aid, enduring the Way of the Sage Confucius. Yet one must not tread the paths of the fortunate, cling to the carriages of elders, utter refined words while concealing true conduct, or seek to transcend self without selflessness. To share a drink is to taste the sweet dew and savor the magic mushroom—this is to ride the clouds and transform like a feather.\n\nThe *Virtue Classic* says: \"Cultivate it in the self, and one’s virtue becomes true.\" There has never been one who attained true virtue without cultivation. If one reveres it like the divine, looks up to it like the sun and moon, so that a single word uttered echoes a thousand miles and a single deed performed draws the world like wind—this is the fruit of self-cultivation. There has never been one who attained it without cultivation.\n\nSifu, now forty-one, has risen to the third rank. Many call this luck. Yet when it comes to lofty reputation and ample profit, most fear falling short. For six or seven years, he has harbored the wish to rescue others, beginning with rescuing himself. But his steps toward the misty clouds, treading the path of rosy dawn, have not brought him close enough to the Milky Way. He fears the grace of rain and dew may not be abundant—this is the greed for fame, not the fear of excess or the caution of one who guards against complacency, nor the wisdom of knowing advance and retreat, life and death. Such a heart remains unresolved.\n\nTo bear a debt is to invite bandits’ pursuit. To wait for others to rescue oneself—how can one then rescue oneself? Now, having cleansed his heart and washed his innards, he bears the weight of these virtuous words. Day and night, he trembles as if standing at a deep ravine. He must curb desires, cast off adornments, dispel emotions, and banish delusions. Until his hair turns white, he dares not slacken.",
      "overlap_context": "ars. Following Zi Xuan’s commentary on the thirty-three chapters, I have composed this subcommentary, totaling thirty scrolls. Though my words are crude and my intent clumsy, I have striven to convey the heart’s direction and return. I dare not bequeath this to later generations but merely record it to prevent forgetting.\n\n*Miscellaneous Records on the* True Scripture of Southern Florescence *(Part One Concluded)*\n*Miscellaneous Records on the* True Scripture of Southern Florescence *(Part Two)*",
      "start_char": 4670,
      "end_char": 5904,
      "start_sentence": 208,
      "end_sentence": 254,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.113592863082886,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\南华真经章句音义余事杂录.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "孔子曰：凡人心难知於天，天犹有春秋冬夏旦暮之期，人者厚貌深情不可测也。 诚哉是言。 有貌苦而心柔顺者，有貌和而心酷烈者，有貌弱而心劲悍者，有貌刚而心慑怯者。 或美其言而失信，寡其辞而好凌，近於礼而善腴，强其气而无节。 又有张君子之腹，陈小人之心，街虎豹之文，中犬羊之质。 又有外示躁挠，中实静安，不耀己功，阴施惠泽。 又有正言驭物，直道观人，哺糟顺时，受污舍俗。 又有礼下於人，言屈於己，顾胆其行，心之不同。 故不可悉识也，君子以此九事观人者，以明镜瞩颜，毫微莫隐，流光鉴物，曲直何逃。 彼之进不进，此知彼也； 此之退不退，彼知此也。 周於所验，已得於心，以验明周，故存於目，如於九征之中粗得一者，如兰生一叶，谁谓无芳； 桂长初条，宛然嘉木。 得二三者，如渔舟入浦，不揖浊流，樵客登山，不争俗路。 得四五者，如镜铘之刃，利不可当，璠瑛之辉，美不可并。 得六七者，如金石在庭，欣逢雅韵，黼黻居箧，喜观华章。 得八九者，如骊龙出海，光透万重，鹏翼高搏，声闻六合。 如得其人，即倾意而邻向，孰敢不勉以副思齐之至也。 高者附之，卑者举之，屈者伸之，沉者浮之，德者师之，谦者友之，亲者厚之，疏者礼之，能自观也，上之谓他人之所观也。 知上之上幕哉，知下之下惧哉。 崔子玉有座右铭，诸葛亮有审心戒，所以桎梏诳妄，羁铄满溢。 嗣复不敢类古人而创立题目，亦欲因古人而刊削是非，便以九征心戒为名，用绳准不迁之行。 正文之下，皆嗣复述耳。 时大和元年丁未岁夏四月十一日谨题。 远使之以观其忠 夫观其忠者，当以诈明之，可知心也。 何可知心矣。 或诈疏之而远，於己，言必恨； 或诈抑之而屈其心，言必残； 或诈诬之而遏其美，言必犯； 或诈摧之而折其芒，言必凌。 又若以利沽之，行必回； 微言激之，心必动； 以私私之，事必易； 以公公之，事必难。 此八者非，忠也。 夫君子之用心澄淡无际，而伪以喜怒远近之节。 非理鼓动，探彼性混，必待其词，观其厚薄，如淬锋以砺，剖璧凭砂，若涅而不淄，磨而不磷者，君子之道也。 小人狭劣难使大受，不知长者以谬淘真，将虚诱实，而乃辄生愁怨，大启祸门。 言是心苗，立观得失省之。 近使之以观其敬 夫观其敬者，亦伪以是非进退之节，而攻其心，即立如之矣。 如近之而不失节，远之而不失言，怒之而不失礼，乐之而不失容。 不慢易，不侮人，不戏言，不轻动。 入户必正，颜色，出门如见大宾，处之无嫌转加乎惊惕，纵之谑浪弥觉乎矜庄。 不恃宠而纵横，不仗威而逞欲，此为至敬也。 如见贤若瞽，闻化如聋，好玩无惭，失容为美，此何足以知敬也。 若挞于市又，狎之则怠为，附之则骄，撜之不清，混之必浊，而乃行无一操，言不三思，失之於周防，皆非敬也。 故君子蒙非常之遇，必慎戒小人； 蒙非常之幸，必颠覆以斯，忘礼而失敬也。 烦使之以观其能 人之难信，自伐者多。 当欲阅材，必先试验。 委之众务，烦挠其心，伫彼不周，用审优劣能者，当静理而必集，不构隙以萌机，处有若无，居多益寡，如或因缘逞志，凭事干人，或首尾相乖，纲断绝令。 十全之略，有始而无终，必就之功，已举而复坠。",
      "translated_text": "Confucius said: \"The human heart is harder to know than Heaven, for Heaven has its seasons—spring, autumn, winter, summer—and its fixed times of dawn and dusk, while man, with his deep countenance and deeper emotions, remains unfathomable.\" Truly, these words are so.\n\nThere are those whose appearance is stern yet whose heart is gentle and compliant; those whose appearance is mild yet whose heart is cruel and fierce; those whose appearance is weak yet whose heart is resolute and bold; those whose appearance is firm yet whose heart is timid and fearful. Some speak fair words yet break their promises; some speak sparingly yet love to domineer; some draw near to ritual yet delight in excess; some boast of their vigor yet lack restraint.\n\nThere are those who display the belly of a gentleman yet harbor the heart of a petty man, who parade the patterns of tigers and leopards yet possess the nature of dogs and sheep. There are those who outwardly appear restless yet inwardly remain calm and composed, who do not flaunt their merits but secretly bestow kindness and grace. There are those who govern others with upright words and observe people with a straight path, who feed on dregs yet follow the times, who endure defilement and forsake the vulgar.\n\nThere are those who humble themselves before others, who yield in speech yet reflect deeply on their conduct—such are the differences of the heart. Thus, one cannot fully know another. The noble person observes others through these nine matters as a bright mirror gazes upon the face, where not even the finest detail is hidden, as flowing light illuminates objects, where neither curve nor straightness can escape.\n\nIf the other advances or does not advance, this reveals their nature; if one retreats or does not retreat, the other perceives it. Through thorough examination, one gains understanding in the heart, and with clear verification, it is stored in the eyes. If among the nine signs one roughly discerns even a single trait, it is like the first leaf of an orchid—who would say it bears no fragrance? Or the first branch of a cassia—surely it is a fine tree.\n\nIf two or three traits are discerned, it is like a fishing boat entering a creek, avoiding the muddy currents, or a woodcutter ascending a mountain, shunning the common path. If four or five traits are discerned, it is like the edge of a whetted blade, irresistibly sharp, or the radiance of fine jade, unmatched in beauty.\n\nIf six or seven traits are discerned, it is like gold and stone placed in the courtyard, delighting in refined music, or embroidered robes stored in a chest, a joy to behold. If eight or nine traits are discerned, it is like a black dragon emerging from the sea, its light piercing myriad layers, or the roc’s wings soaring high, its fame resounding through the six directions.\n\nIf one finds such a person, one should incline one’s heart toward them—who would not strive to emulate them? The lofty are drawn near, the lowly are lifted, the bent are straightened, the sunken are raised, the virtuous are followed as teachers, the humble are befriended, the close are cherished, the distant are treated with courtesy. One who can observe oneself thus is said to observe others as well.\n\nTo know the highest is to aspire; to know the lowest is to fear. Cui Ziyu had his *Seat Inscription*, Zhuge Liang had his *Admonition on Self-Examination*—both served to shackle deceit and restrain excess. I dare not presume to imitate the ancients by creating new titles, but wish only to follow them in carving away right and wrong. Thus, I name this *Nine Signs: A Heart’s Admonition*, to serve as a measure for unchanging conduct. What follows is but my humble continuation.\n\n**To Send Them on a Distant Mission and Observe Their Loyalty**\nTo observe their loyalty, one must test them with deception to know their heart. How can the heart be known? Some, when feigned estrangement drives them away, will harbor resentment in their words; some, when feigned suppression bends their will, will speak with bitterness; some, when falsely accused to stifle their virtues, will speak defiantly; some, when feigned rebuke breaks their edge, will speak insolently.\n\nIf one tempts them with profit, their conduct will waver; if one provokes them with subtle words, their heart will stir; if one appeals to their private interests, matters will be easily swayed; if one upholds impartiality, matters will become difficult. These eight are not the marks of loyalty.\n\nThe noble person’s heart is clear and boundless, yet the deceptive use of joy, anger, distance, or closeness may stir it. If one incites them without reason, probing their nature, one must await their words to gauge their depth. It is like tempering a blade on a whetstone or cutting jade with sand—if it remains unsullied by dye or unthinned by grinding, that is the Way of the noble person.\n\nThe petty man is narrow and base, difficult to enlighten. Not knowing that the wise use falsehood to sift truth, or emptiness to lure substance, he instead grows resentful and opens the gates of misfortune. Words are the sprouts of the heart—by observing them, one discerns gain and loss.\n\n**To Assign Them Nearby Tasks and Observe Their Respect**\nTo observe their respect, one must also employ feigned right and wrong, advance and retreat, to assail their heart, and their true nature will stand revealed. If one draws near and they do not lose propriety, distances them and they do not speak amiss, angers them and they do not lose courtesy, delights them and they do not lose composure; if they are neither careless nor contemptuous, neither jesting nor frivolous; if they enter a room with dignity, their countenance composed, and leave as if facing a distinguished guest; if in quietude they remain wary, and in jest they grow more solemn; if they do not rely on favor to act recklessly nor wield authority to indulge desires—this is the height of respect.\n\nBut if they act as though blind before the worthy or deaf to instruction, delighting in frivolity without shame, taking a lost demeanor as beauty—how can this be called respect? If they are flogged in the marketplace and grow lazy when treated with familiarity, arrogant when drawn close, impure when urged, and muddied when mixed; if their conduct lacks any principle and their words are not weighed thrice; if they fail in vigilance—none of this is respect.\n\nThus, when the noble person receives extraordinary favor, they must be wary of petty men; when they receive extraordinary fortune, they must guard against ruin through neglect of courtesy and loss of respect.\n\n**To Overwhelm Them with Tasks and Observe Their Ability**\nPeople are hard to trust, for those who boast of themselves are many. To assess talent, one must first test it. Entrust them with numerous duties, overwhelm their minds, and wait to see if they falter—thus one discerns the capable from the inferior.\n\nThe capable will govern with calm and surely succeed, not sowing discord to hatch schemes. They will be present yet seem absent, abundant yet appear sparse. If they seize opportunities to indulge their will or rely on affairs to impose on others; if their beginning and end conflict, their principles break, and their commands fail; if their grand strategies are complete in inception yet lacking in conclusion, and their certain achievements rise only to fall—such are not the marks of ability.\n\nIn the first year of the Taihe reign, the dingwei year, summer, the fourth month, the eleventh day, respectfully inscribed.",
      "overlap_context": "the wisdom of knowing advance and retreat, life and death. Such a heart remains unresolved.\n\nTo bear a debt is to invite bandits’ pursuit. To wait for others to rescue oneself—how can one then rescue oneself? Now, having cleansed his heart and washed his innards, he bears the weight of these virtuous words. Day and night, he trembles as if standing at a deep ravine. He must curb desires, cast off adornments, dispel emotions, and banish delusions. Until his hair turns white, he dares not slacken.",
      "start_char": 5904,
      "end_char": 7136,
      "start_sentence": 255,
      "end_sentence": 309,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.85930776596069,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\南华真经章句音义余事杂录.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "是非乱启，耳目不知所从，策用交生，方寸不能所守。 既无晓畅，为事所昏烦极成忧，沈迷若醉，不赴程则颠倒心魂，自是疲羸，何以能也。 如救弊若不足，理剧似闲暇，居众美而无衒，茸多陋而非残，功成益谦，政大转谨。 不求虚誉而进已，不惑邪谋以害公，即理烦之要也。 卒问之以观其智 意所不思，卒承顾问，辩说合理，是其智也。 诗云：既明且哲，以保其身。 如辩而不思，何以谓之明； 对而忘礼，何以谓之智。 夫能应卒然之问者，变通也。 且困而能通，穷则思变，亦君子之道也。 所谓观其发而知其人之智，在审慎而言不轻发也。 唯通变之时，能不凭奸饰妄，抱曲持邪，辞切而理明，道直而虑远者，大智也。 如或因言立意，骤成损益之阶，乘便为谋，辄启骄盈之渐，此鄙下也，何足言智。 夫水之於人也，壅之即止，决之即流，其要在固堤防，慎泛溢也。 人言若水，口是堤防，岂得不思溢而成害。 欲言当审之。 急期之以观其信 缓则易从，急则难守，能难，是其信也。 夫信者，为百行之纪纲，作万灵之钤键，苟或差忒，必能为妖。 何者？ 三光运之而无极，四序行之而不言，此天之信也。 顺高卑而育物，随深浅以生成，此地之信也。 表圣功而五色，荷祯瑞以重轮，此是日之信也。 似镜之辉才隐，如钩之魄复圆，此月之信也。 弃兵食而作戒，睹輗軏以存诚，此人之信也。 且天之失信，寒暑违，地之失信，万物衰，两曜失信，光明亏； 人之失信，德无归。 夫君子之言，信而有征，故怨咎远於其身也； 小人之言，僭而无征，故不可信也，宁逃於怨咎哉，夫如是，孰能救欤。 委之以财观其仁 托之厚利，潜观其心，欺诈不生，是其仁也。",
      "translated_text": "When right and wrong arise in chaos, the ears and eyes know not what to follow; strategies multiply in conflict, and the heart cannot hold its ground. Lacking clarity and understanding, one becomes overwhelmed by affairs, sinking into distress as if drunk, unable to meet deadlines without scattering the mind and soul. Thus exhausted and weakened, how can one accomplish anything? The capable, however, remedy flaws as if ever insufficient, manage crises with ease, dwell amidst excellence without ostentation, and mend many flaws without ruin. Their achievements grow, yet they remain humble; their governance expands, yet they grow more cautious. They do not seek empty praise to advance themselves, nor are they swayed by deceitful schemes to harm the public—this is the essence of managing complexity.\n\n**Test them with sudden questions to assess their wisdom.**\nWhen asked unexpectedly about what they have not considered, if their responses are reasoned and coherent, this is wisdom. As the *Book of Songs* says: *\"Both enlightened and wise, they preserve themselves.\"* If one speaks without thought, how can it be called enlightenment? If one responds without propriety, how can it be called wisdom? The ability to answer sudden questions lies in adaptability. Even in distress, one who can adapt and think anew when at an impasse follows the Way of the noble person. As the saying goes: *\"Observe their words to know their wisdom,\"* for caution in speech ensures it is not lightly given. Only in times of change can one avoid relying on deceit or clinging to crookedness; those whose words are incisive yet principles clear, whose path is straight yet foresight far-reaching—these are the truly wise. But if one seizes upon words to form intentions, hastily creating steps for gain or loss; if one exploits opportunities for schemes, planting the seeds of arrogance—this is base and unworthy of being called wisdom.\n\nWater, in relation to man, stops when dammed and flows when released; the key lies in reinforcing the dikes and guarding against overflow. Human speech is like water, and the mouth is its dike—how can one not guard against overflow and harm? One must deliberate before speaking.\n\n**Press them with urgent demands to assess their trustworthiness.**\nWhat is easy in leisure becomes difficult under pressure—those who endure difficulty demonstrate trustworthiness. Trust is the guiding principle of all conduct, the linchpin of all virtues. Should it falter, it will surely invite calamity. Why? The three luminaries move without end, the four seasons proceed without speech—this is the trust of Heaven. Nurturing all things according to their high and low stations, fostering growth according to depth and shallowness—this is the trust of Earth. Manifesting sacred power in five colors, bearing auspicious omens in double rings—this is the trust of the sun. Shining like a mirror when hidden, waxing and waning like a hook—this is the trust of the moon. Discarding weapons and provisions to issue warnings, gazing upon the linchpin to uphold sincerity—this is the trust of man. If Heaven loses trust, cold and heat reverse; if Earth loses trust, all things wither; if the two luminaries lose trust, their light wanes. If man loses trust, virtue finds no home. The words of the noble person are trustworthy and verifiable, so resentment and blame stay far from them. The words of the petty person are false and unverifiable, thus unworthy of trust—would they not rather flee blame? Who, then, could save them?\n\n**Entrust them with wealth to assess their benevolence.**\nPlace great profit before them and observe their hearts in secret. If deceit does not arise, this is benevolence.",
      "overlap_context": " absent, abundant yet appear sparse. If they seize opportunities to indulge their will or rely on affairs to impose on others; if their beginning and end conflict, their principles break, and their commands fail; if their grand strategies are complete in inception yet lacking in conclusion, and their certain achievements rise only to fall—such are not the marks of ability.\n\nIn the first year of the Taihe reign, the dingwei year, summer, the fourth month, the eleventh day, respectfully inscribed.",
      "start_char": 7136,
      "end_char": 7792,
      "start_sentence": 310,
      "end_sentence": 341,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.385878562927246,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\南华真经章句音义余事杂录.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "夫鉴明者，尘垢之不污； 神清者，嗜欲之不误。 如贵德尚义，其鉴必明，好礼亲贤，其尘不杂，自然贞白似玉，光洁如冰，何垢染之能侵，岂贪嗜之见黩，立我墙仞，物莫之伦，此君子也。 夫事有随时从容之说，不可胶柱而御之，但以止足为心，取必有义，且有义之取，人不兽之。 小人溪壑为心，取必无义，且无义之取，人必讟之。 语曰：克己复礼为仁。 盖检束於心也。 夫临财不夺其志，可近於克己； 见利不易於行，可近於复礼。 夫美色者隳端士之操，美利者坏正人之心。 戒哉。 告之以危观其节 陈之急切，告以忧危，执中且坚持正不拔者节也。 君子临难无苟免，以美其节义也。 若无义之生而易於死，败节之存而易其亡，所以杀人以自生，亡人以自活，君子不为也。 夫仁者有勇，义在其中； 小人有勇，祸在其中。 君子困不忘礼，危不变节； 小人困则易性，危则败正。 且正之一败，如顺险之投暴浪，临巅之跃飞丸。 同已震之迅雷，类绝弦之激矢，往不可复，救之亦难。 慎虑精思，则免终身之恨； 喜居悲后，能全大节之名。 语曰：临大节而不可夺，君子人也。 小人无远略，惧祸迫己而苟全其身，乃不能保其节也。 醉之以酒观其则 狂药虽多词转谨敬於未醉，是其则也。 所以三爵知止； 百拜酬宾，自无侧弁之乖，绝有倒载之恨，盖所以逃酒祸也。 夫酒之於人也，少则气和，多则神乱，张涩滞之口，摅端静之心，丑言发而声气弥高，戾行彰而风威转大，是非蜂起，奋袂攘襟，从恶如流，不知所执，争蹈水火，宁思醉后之惭，力赴猖狂，莫救醒前之患，此狂瞽之人，甘为所陷。 自贻伊戚，不足伤也。 如樽俎罗列，杯盂乱飞，德度俨然清规肃物，有敬色而自检，无怠颜以触人者，省分而就欢，量器而接宴，惧失则也。 语曰：唯酒无量不及乱。 圣人犹深戒之。 杂之以处观其色 不检妇人，诈为参杂，观其笑语，知好色也。 夫修眉艳质，婵娟丽姿，脸夺芙蕖之红，颜侵冰雪之白。 顶垂金雀，腰佩琅玕，动巫峡之明眸，启洛神之皓齿。 啼堪驻马，笑可倾城。 节夫为之动容，贞士见之回顾。 香风引媚，心敞恍以不安； 日照铅华，思盘桓而失所。 况流俗之人乎。 其有能轻滓秽，屏是妖妍怀器不造心灵，尘性莫能强诱，耻读桑中之咏，悲看行露之诗，夜秉烛以避嫌，昼低声而入户。 动不累於己，处无污其心，阃阈清闲，德范冲粹，听言同其骨肉，目进类其仇雠，能以好色之心好贤即善。 时人当戒哉。 后序 古者言之不出，耻躬之不逮也。 嗣复浅钝极矣，亦喜挹此说。 今者谬为纂释，倍感於心，虽有是言，实无斯行。 日省其说，读而改之，其达者恐我行不及言必忧，迷者喜我行不及言必笑。 丈夫既有言也，岂敢中道而废，当不使相笑者笑，相忧者忧，必有年矣。 知余者表余心矣，不知余者曷敢言志。 当自省惕而行之。 南华真经干事杂录下竟",
      "translated_text": "A mirror of clarity is unstained by dust or grime;\nA spirit serene is unled astray by craving or desire.\nThose who esteem virtue and uphold righteousness—\ntheir mirror is surely bright;\nThose who honor ritual and draw near the worthy—\ntheir dust remains unmingled.\nNaturally pure and white as jade,\nradiant and clear as ice,\nwhat filth could ever taint them?\nWhat greed or lust could ever defile?\nThey stand towering like a wall of fathoms,\nunmatched by any thing—\nsuch is the noble person.\n\nAffairs may call for ease and adaptability,\nyet one must not cling rigidly to a single course.\nLet contentment be the heart’s measure,\nand all taking be guided by rightness.\nFor taking with rightness,\npeople will not deem one a beast.\nThe petty person’s heart is a bottomless ravine;\ntheir taking knows no rightness.\nFor taking without rightness,\npeople will surely revile them.\n\nAs the saying goes:\n*To master oneself and return to ritual is benevolence.*\nThis is restraint of the heart.\nFacing wealth yet not losing one’s resolve—\nthis approaches mastery of self;\nSeeing gain yet not altering one’s conduct—\nthis approaches return to ritual.\nFair forms undermine the resolve of upright scholars;\ngreat profit corrupts the hearts of the upright.\nBeware!\n\n**Warn them of peril to assess their integrity.**\nConfront them with urgency,\nwarn them of danger and distress—\nthose who hold fast to the center,\nwho firmly uphold what is right without wavering,\nshow integrity.\nThe noble person faces hardship without seeking escape,\nthus ennobling their integrity and righteousness.\nTo cling to life without rightness rather than embrace death,\nto preserve oneself by betraying integrity rather than perish—\nthis is to kill others to live,\nto destroy others to survive.\nThe noble person does not act thus.\n\nThe benevolent possess courage,\nfor righteousness lies within;\nThe petty possess courage,\nbut calamity lies within.\nThe noble person, though beset, does not forget ritual;\nthough imperiled, does not abandon integrity.\nThe petty person, when beset, alters their nature;\nwhen imperiled, betrays what is right.\nOnce rightness is betrayed,\nit is like plunging down a precipice into raging waves,\nor leaping from a cliff after a flying pellet—\nswift as thunder after the lightning’s flash,\nor an arrow loosed from a snapped bowstring.\nWhat is gone cannot be reclaimed;\nwhat is lost cannot be saved.\nWith careful thought and earnest reflection,\none avoids lifelong regret.\nTo dwell in sorrow after joy\nis to preserve the renown of great integrity.\n\nAs the saying goes:\n*Facing great trials yet unshaken—\nsuch is the noble person.*\nThe petty person lacks foresight;\nfearing calamity that presses near,\nthey seek only to preserve themselves,\nyet cannot safeguard their integrity.\n\n**Intoxicate them with wine to observe their restraint.**\nThough the mad draft loosens the tongue,\none who remains reverent before drunkenness\nshows restraint.\nThus three cups suffice to know when to stop;\na hundred bows honor the guest—\nno slanted cap betrays disorder,\nno overturned carriage brings regret,\nfor this is how one escapes the woes of wine.\nAs for wine’s effect on people:\nin moderation, it harmonizes the qi;\nin excess, it disorders the spirit.\nIt loosens the tongue’s restraint,\ndisturbs the tranquil heart.\nFoul words arise, voices grow louder;\nperverse deeds appear, and demeanor turns fierce.\nRight and wrong swarm like bees,\nsleeves are rolled, collars grasped—\nevil is followed like a current,\nand one knows not what they grasp.\nThey rush into fire and water,\nheedless of shame after drunkenness,\nplunging headlong into madness,\nunable to avert disaster before sobriety.\nSuch blind fools willingly fall into ruin,\nbringing sorrow upon themselves—\nyet what pity do they deserve?\n\nBut when goblets and platters are arrayed,\ncups fly in disarray,\nand one’s demeanor remains solemn,\ntheir conduct measured and dignified,\ntheir expression respectful and self-controlled,\ntheir face never slackening to offend—\nwhen they gauge their portion to share in joy,\ntheir capacity to meet the feast,\nfearing the loss of restraint—\nthis is the way of the wise.\n\nAs the saying goes:\n*Only with wine is there no limit—\nyet one must not descend into chaos.*\nEven the sage deeply warned against it.\n\n**Mix them with others to observe their demeanor.**\nDo not restrain women,\nbut mingle them among the company,\nand watch their laughter and speech—\nthus one knows their fondness for beauty.\nThose with arched brows and radiant charm,\ngraceful forms and lovely bearing—\ntheir cheeks outshine the lotus’s blush,\ntheir complexions rival ice and snow.\nGolden sparrows dangle from their hairpins,\njade pendants hang at their waists.\nTheir bright eyes stir the Wu Gorge’s depths,\ntheir gleaming teeth part like the Luo Goddess’s.\nTheir weeping could halt a galloping horse,\ntheir smile could topple a city.\nEven steadfast men are moved by them,\neven the resolute turn to look.\nFragrant winds draw forth their allure,\nand the heart grows restless, ill at ease;\nsunlight glints on their powdered faces,\nand the mind lingers, lost in thought.\nHow much more so for the common crowd?\n\nYet some can scorn such filth,\nbanish such enchanting beauty.\nTheir minds remain untouched,\ntheir natures untainted by strong temptation.\nThey feel shame at the songs of *Sangzhong*,\ngrief at the poems of *Xinglu*.\nBy night, they hold candles to avoid suspicion;\nby day, they lower their voices to enter a room.\nTheir actions do not burden themselves,\ntheir conduct does not defile their hearts.\nWithin the inner chambers, all is pure and tranquil;\ntheir virtue is refined and unadulterated.\nThey hear words as if from kin,\nyet regard such beauty as they would a foe.\nTo turn the heart that loves beauty\ntoward loving the worthy—\nthis is goodness.\nLet all people take heed!\n\n**Postscript**\nThe ancients did not speak lightly,\nfor they were ashamed if their conduct fell short.\nThough my understanding is shallow and dull,\nI have delighted in these teachings.\nNow, in my flawed compilation and explanation,\nI feel twice the weight upon my heart.\nThough these words exist,\nmy conduct does not match them.\nI daily reflect on these sayings,\nreading and amending them.\nThe discerning may fear that my actions fall short of my words—\nthey will worry for me.\nThe deluded may rejoice that my actions fall short of my words—\nthey will mock me.\nYet since a true person has spoken,\nhow could I abandon the Way mid-course?\nI must ensure that those who would mock me do not mock,\nthat those who would worry for me do not worry—\nthis will take time.\nThose who know me will see my heart;\nthose who do not know me—\nhow dare I speak of my aspirations?\nI must examine myself with vigilance and act accordingly.\n\n*Concluding the Miscellaneous Records of the Southern Florescence Scripture.*",
      "overlap_context": "aries lose trust, their light wanes. If man loses trust, virtue finds no home. The words of the noble person are trustworthy and verifiable, so resentment and blame stay far from them. The words of the petty person are false and unverifiable, thus unworthy of trust—would they not rather flee blame? Who, then, could save them?\n\n**Entrust them with wealth to assess their benevolence.**\nPlace great profit before them and observe their hearts in secret. If deceit does not arise, this is benevolence.",
      "start_char": 7792,
      "end_char": 8898,
      "start_sentence": 342,
      "end_sentence": 396,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.755221128463745,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\玉诀类\\南华真经章句音义余事杂录.txt",
        "category": "玉诀类"
      }
    }
  ]
}