{
  "source_id": "南斗延寿灯仪",
  "source_file": "chunked_daozang\\南斗延寿灯仪.json",
  "total_chunks": 4,
  "total_original_chars": 2134,
  "total_translated_chars": 14392,
  "total_translation_time": 69.76561117172241,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\威仪类\\南斗延寿灯仪.txt",
    "category": "威仪类"
  },
  "full_translation": "*The Rite of the Southern Dipper Lamp for Prolonging Life*\n**Text Title:** *The Rite of the Southern Dipper Lamp for Prolonging Life*. One fascicle.\n**Source:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Weiyi* Category.\n\nThe Rite of the Southern Dipper Lamp for Prolonging Life proceeds according to the prescribed form.\n\n[Officiant’s name], with reverent awe and trepidation, bows deeply, prostrates, burns incense, and bows again, respectfully memorializing:\n\nThe Three Clarities and August Sages,\nThe Ten Poles and Lofty Perfected,\nThe Purple Tenuity Great Emperor, Lord of the Central Heavenly Stars,\nThe Imperial Lord of the Sun Palace of Great Yang,\nThe August Sovereign of the Moon Mansion of Great Yin,\nThe Star Lords of the Five Planets and Four Luminaries,\nThe Six Bureau Star Lords of the Southern Dipper for Prolonging Life,\nThe Nine August Star Lords of the Northern Dipper for Bestowing Birth,\nThe Star Lords of the Eastern, Western, and Central Dippers,\nThe Star Lords of the Twenty-Eight Constellations,\nThe Host of Perfected of All Heavenly Degrees,\nThe Star Lord of One’s Original Destiny,\nThe Three Primordials and Three Officials, Great Emperors,\nThe Four Sagely Lords of the Northern Culmen,\nThe Five Masters and Three Ministries, Perfected Lords,\nThe Four Bureaus of the Three Realms,\nAnd the Boundless Assembly of Sages.\n\nAt the assembly of the Lamp Altar, the myriad sages and thousand perfected gather.\nMay the sagely compassion turn and illumine with radiant clarity.\n\nI have heard that of the powers of Heaven and Earth, none is greater than life; of the categories of the *Hong Fan*, none is more complete than fortune. Thus there exists the office of governance, through which one may extend the heart’s prayers for exorcism and blessing.\n\nLooking up to the Three Realms, the Southern Dipper is the palace of longevity; within the Six Bureaus, the Perfected Lords hold the authority of governance. All those with transient forms submit to their rule. Therefore, in accordance with the ranks of the *River Chart* and the rituals of the *Lingbao* scriptures, we solemnly arrange the star lamps and reverently present the offerings of the jiao rites, that we may communicate with the Upper Realm and summon the descent of the lofty perfected.\n\nNow, your disciple [Name] humbly transmits his sincerity through the fragrant incense, trusting in the manifestation of all things. Gazing up to the Southern Culmen, he models himself upon the Dipper’s governance. Thus the radiance of the precious torches shines forth to reveal the divine likeness; chanting the true scriptures and intoning the hymns, may we be deemed worthy of their advent.\n\nWe pray that Heaven’s scrutiny will not reject us, and that the divine heart will respond with kindness. With jade chariots and feathered canopies, your majestic presence is near; with golden steeds and jade carriages, your numinous array fills the void. May the extension of life and the fixing of destiny bring the advent of auspicious qi; may the illumination of the obscure and the scrutiny of the subtle manifest the power of your illuminating presence.\n\nHumbly offering the tokens of the Dharma, we exalt the divine luminaries. Bowing our heads in reverence, we take refuge and devoutly praise. We, your assembled servants, with sincere hearts take refuge in the Great Sage of the Palace of Illustrious Virtue, the Lord of Destiny and Prime Minister of the Southern Dipper’s Celestial Bureau, the Perfected Lord Who Mirrors the State, and all the numinous officials.\n\nI have heard that Heaven endows all living beings with their natural destinies, and that all who embrace the great root return to the midst of the August Culmen. Those who nurture it find fortune ever-increasing; those who corrupt it see calamity arise of itself. The power of governance and control truly resides in the office that oversees all. If there are prayers or exorcisms to be made, one must cultivate utmost sincerity.\n\nThis day, I, [Name], purify my heart and cleanse my thoughts, nurture my qi and preserve my spirit. Long have I cherished a heart that yearns for the Dao, revering the celestial images above. In strict accordance with ritual protocol, I establish the stellar altar, preparing the rites of incense, flowers, lamps, and candles. I take refuge in the Great Sage of the Palace of Illustrious Virtue, the Lord of Destiny and Prime Minister of the Southern Dipper’s Celestial Bureau, the Perfected Lord Who Mirrors the State.\n\nMay Heaven guide their hearts, that all may follow the enduring Dao; may all things receive their blessings, that none suffer the misfortune of premature demise. Bowing my head in reverence, I take refuge and chant in accordance with the rites:\n\n*Southern Dipper, Lord of Destiny, exalted Perfected of the Highest Rank,*\n*Encompassing the myriad phenomena, mighty and numinous Guardian of the State.*\n*Celestial Bureau of Heaven, minister to the Emperor on left and right.*\n*The host of immortals receive their commands, the ten thousand qi arise and flourish.*\n*Prime Minister of the Golden Portal, august deity of the Jade Purity.*\n*Mysterious and wondrous Dao, dare there be any who disobey?*\n*May all spirits remain in tranquil vigil, safeguarding the imperial court.*\n\nWe, your assembled servants, with sincere hearts take refuge in the Great Sage of the Palace of Cavernous Script, the Celestial Minister of the Southern Dipper Who Records Destiny, the Perfected Lord Who Mirrors the Sacred Peaks, and all the numinous officials.\n\nI have heard: In the beginning of the Supreme Ultimate, the Dao had no fixed form. After my birth, all things acquired their proper names. Fortune and misfortune lie in virtue, where noble and base are not mistaken; good and ill depend on the person, where worthy and foolish are not confused. Regarding those who preside over these matters, they are entrusted with the natural order. If one offers sincere devotion, one shall surely receive abundant recompense.\n\nThis day, I, [Name], focus my heart and rectify my intentions, turning toward the Dao to cultivate perfection. Gazing upward, I contemplate the luminous celestial images, devoutly relying on the aid and favor of High Heaven. In strict accordance with ritual protocol, I establish the stellar altar, preparing the rites of incense, flowers, lamps, and candles. I take refuge in the Great Sage of the Palace of Cavernous Script, the Celestial Minister of the Southern Dipper Who Records Destiny, the Perfected Lord Who Mirrors the Sacred Peaks.\n\nMay the supreme Dao be magnified, its awe-inspiring power silently gathering and overseeing all; may all living beings be universally saved, their virtuous deeds duly ordered and perfected. Bowing my head in reverence, I devoutly chant:\n\n*Southern Dipper, Recorder of Destiny, august Celestial Minister.*\n*Determining life, bestowing emoluments, preserving fate, and prolonging life.*\n*Peak deities receive their mandate, overseeing the host of spirits.*\n*Resplendent and wondrous Dao, dispelling demonic vapors.*\n*Cleansing away evil obstructions, safeguarding the body’s form.*\n*The host of immortals look up in reverence, all mysteries made manifest.*\n*By the natural workings of creation, ascend to the Supreme Purity.*\n\nWe, your assembled servants, with sincere hearts take refuge in the Great Sage of the Palace of Gentle Virtue, the Celestial Beam of the Southern Dipper Who Prolongs Life and Preserves Destiny, the Perfected Lord, and all the numinous officials.\n\nI have heard: Long life and enduring vision are the constant essence of the great Dao; prayers for longevity and prolonged life are the desires of all people. In Heaven, it remains eternally unchanging; in humanity, it ensures destiny is distant and unharmed. To prolong life, nothing precedes prayer; to invoke the blessings of the numinous office, one must cultivate sincerity toward all things.\n\nThis day, I, [Name], direct my intentions with clarity, gazing upward to observe the celestial images. May the perfected and divine descend to witness my devotion, and may my longevity be increased and exalted. In strict accordance with ritual protocol, I establish the stellar altar, preparing the rites of incense, flowers, lamps, and candles. I take refuge in the Great Sage of the Palace of Gentle Virtue, the Celestial Beam of the Southern Dipper Who Prolongs Life and Preserves Destiny.\n\nMay boundless benevolence be bestowed, that all may follow the blessings of enduring life; may the power of life be spread and expanded, that there be no fear of premature demise.\n\nWith bowed head, I take refuge and devoutly intone in praise:\nThe Southern Dipper Prolongs Life, as the Celestial Beam.\nUniversally delivering all beings, may they all flourish and prosper.\nLongevity and felicity, boundless as the ages.\nEternally preserving Heaven’s mandate, dispelling all misfortune.\nLife unceasing, steadfast as hills and ridges.\nBenevolence universally bestowed, the glory of the Winnowing Basket and Wings renewed.\nIn virtue united with the divine, enduring through ancient ages.\n\nWe, your servants, with single-minded devotion take refuge in the Great Sage of the Palace of Preserved Brilliance, the Southern Dipper Celestial Peer Who Increases Lifespan and Preserves Life, and all spirit officials.\n\nI have heard: when numbers are divided, their abundance or scarcity becomes manifest—abundance is deemed excellence. When destiny descends, its length or brevity is distinguished—longevity is its auspicious sign. Only with an un-deceiving heart may the years be extended, for the perfected transcendents govern this, and pure intention is what they seek.\n\nToday, I, [Name], seek to augment my years of venerable age, reverently gazing upon the radiant celestial images. In the realm of the indistinct, response comes through form and sound. Strictly adhering to ritual protocol, I establish the stellar altar, preparing the rites of incense, flowers, lamps, and candles. I take refuge in the Great Sage of the Palace of Preserved Brilliance, the Southern Dipper Celestial Peer Who Increases Lifespan and Preserves Life.\n\nMay boundless compassion descend, ever-growing like the spring sun; may distant years greatly increase, as steadfast as Mount Song’s foundation.\n\nWith bowed head, I take refuge and devoutly intone in praise:\nThe Southern Dipper Increases Lifespan, peer to Heaven.\nLofty, luminous, and enduring, its power of life knows no end.\nPreserving this primordial mandate, that it never lose its center.\nLongevity and tranquility, forever in accord with the true wind.\nThe supreme number flows and spreads, blessings and prosperity ascend.\nFor a hundred million years, may it guard my person.\nThe pure upper realms, where cloud-dragon chariots ascend.\n\nWe, your servants, with single-minded devotion take refuge in the Great Sage of the Palace of Celestial Nodes, the Southern Dipper Celestial Pivot Who Delivers from Calamity and Refines the Soul of Wenchang, and all spirit officials.\n\nI have heard: the two qi subtly shift, bearing the principle of flourishing and decline; the Five Phases alternate in motion, yet never lack the mechanism of ebb and flow. Considering the toils of mortal life, how could there be no encounters with calamity? Since the true sages govern deliverance, the common people should devote themselves wholeheartedly.\n\nToday, I, [Name], in awe and trepidation, rectify my conduct, reverently gazing upon the celestial image with faith and devotion. I vow to take refuge in the Great Dao and seek deliverance through divine grace. Strictly adhering to ritual protocol, I establish the altar, preparing the rites of incense, flowers, lamps, and candles. I take refuge in the Great Sage of the Palace of Celestial Nodes, the Southern Dipper Celestial Pivot Who Delivers from Calamity and Refines the Soul of Wenchang.\n\nMay you ever excel in saving humanity, silently dissolving disasters and misfortunes; ever cherishing the salvation of the world, manifesting subtle warnings of auspicious omens.\n\nWith bowed head, I take refuge and devoutly intone in praise:\nThe Southern Dipper Delivers from Calamity, as Heaven’s Pivot.\nIn stillness, it governs transformation, all things flourish and wither.\nWenchang shines resplendent, repository of charts and books.\nTurning misfortune into fortune, crafting my cinnabar chariot.\nRefining the po and guarding the shen, protecting the hun and preserving the body.\nHeaven’s light settled in peace, calamities swept away.\nThe Dao’s qi endures, dwelling with the sacred and true.\n\nWe, your servants, with single-minded devotion take refuge in the Great Sage of the Palace of Great Sanctity, the Southern Dipper Celestial Mechanism Who Oversees Life and the Great Judge, and all spirit officials.\n\nI have heard: true immortals enact virtue, ashamed to be ignorant of even a single thing; the sagely Dao responds to the times, serving as the wondrous function of all hearts. Bestowing the center and establishing destiny, receiving qi and endowing form, they oversee the work of generation and completion—how dare I not approach with reverence and offer my prayers?\n\nToday, I, [Name], purify my heart and turn toward the Dao, with focused intention gazing upon Heaven. Reflecting upon the grace of nurturing and growth, I venture to perform the rites of prayer and exorcism. Strictly adhering to ritual protocol, I establish the stellar altar, preparing the rites of incense, flowers, lamps, and candles. With single-minded devotion, I take refuge in the Great Sage of the Palace of Great Sanctity, the Southern Dipper Celestial Mechanism Who Oversees Life and the Great Judge.\n\nMay you embody the generative power of Heaven and Earth to govern transformation; may the harmony of nature and destiny all return to the Dao.\n\nWith bowed head, I take refuge and devoutly intone in praise:\nThe Southern Dipper Oversees Life, as Heaven’s Beam.\nDirecting the workings of creation, moving in and out in timely response.\nCharged with the registers of destiny, even spirits dare not pry.\nThe vastness of the Great Void, the office of the Great Judge.\nFrom root to origin, compliant and without deficiency.\nThrough ten thousand kalpas enduring, ever-watchful and unchanging.\nThe universal overseer of destiny, ascending to the Supreme Subtlety.\nThe Rites of the Southern Dipper Longevity Lamp are now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "南斗延寿灯仪 经名：南斗延寿灯仪。 一卷。 底本出处：《正统道藏》洞真部威仪类。 南斗延寿灯仪 法事如式 具位某诚惶诚恐，稽首顿首，焚香再拜，上奏：三清上圣，十极高真，中天星主紫微大帝，日宫太阳帝君，月府太阴皇君，五星四曜星君，南斗六司延寿星君，北斗九皇延生星君，东西中斗星君，二十八宿星君，普天宿度群真，本命元辰星君，三元三官大帝，北极四圣真君，五师三省真君，三界四府，无鞅圣众。 灯坛会上，万圣千真。 恭望圣慈，洞回昭鉴。",
      "translated_text": "*The Rite of the Southern Dipper Lamp for Prolonging Life*\n**Text Title:** *The Rite of the Southern Dipper Lamp for Prolonging Life*. One fascicle.\n**Source:** *Daoist Canon of the Zhengtong Era*, *Dongzhen* Section, *Weiyi* Category.\n\nThe Rite of the Southern Dipper Lamp for Prolonging Life proceeds according to the prescribed form.\n\n[Officiant’s name], with reverent awe and trepidation, bows deeply, prostrates, burns incense, and bows again, respectfully memorializing:\n\nThe Three Clarities and August Sages,\nThe Ten Poles and Lofty Perfected,\nThe Purple Tenuity Great Emperor, Lord of the Central Heavenly Stars,\nThe Imperial Lord of the Sun Palace of Great Yang,\nThe August Sovereign of the Moon Mansion of Great Yin,\nThe Star Lords of the Five Planets and Four Luminaries,\nThe Six Bureau Star Lords of the Southern Dipper for Prolonging Life,\nThe Nine August Star Lords of the Northern Dipper for Bestowing Birth,\nThe Star Lords of the Eastern, Western, and Central Dippers,\nThe Star Lords of the Twenty-Eight Constellations,\nThe Host of Perfected of All Heavenly Degrees,\nThe Star Lord of One’s Original Destiny,\nThe Three Primordials and Three Officials, Great Emperors,\nThe Four Sagely Lords of the Northern Culmen,\nThe Five Masters and Three Ministries, Perfected Lords,\nThe Four Bureaus of the Three Realms,\nAnd the Boundless Assembly of Sages.\n\nAt the assembly of the Lamp Altar, the myriad sages and thousand perfected gather.\nMay the sagely compassion turn and illumine with radiant clarity.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 217,
      "start_sentence": 0,
      "end_sentence": 8,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.89001178741455,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\南斗延寿灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "臣闻：天地之德，莫大於生； 洪范之畴，莫全於福。 爰有主司之职，可伸禳祝之心。 仰惟三境之中，南斗为长生之府； 六司之内，真君持掌握之权。 凡彼流形，归於所宰。 是以按河图之品格，披灵宝之科仪，严设星灯，恭陈醮礼，宜通上境，延降高真。 今弟子某心假香传，诚惟物显，仰瞻南极，上法斗司。 然宝炬之光明，以昭垂像； 诵真科而吟咏，庶获来临。 状愿天鉴不违，神心善应。 琼舆羽盖，咫尺威灵，金马瑶车，森罗空际。 延生定命，克臻瑞气之来； 烛幽察微，丕示照临之德。 恭持法信，上赞神明，稽首皈依，虔诚赞咏。 臣众等志心皈命，明德宫大圣、南斗天府司命上相镇国真君，诸灵官。 臣闻：天赋群灵，均有自然之命； 人怀大本，咸归皇极之中。 养之者，福谢尤生； 败之者，祸因自起。 永惟宰制，实在司存，倘有祈禳，宜修诚恳。",
      "translated_text": "I have heard that of the powers of Heaven and Earth, none is greater than life; of the categories of the *Hong Fan*, none is more complete than fortune. Thus there exists the office of governance, through which one may extend the heart’s prayers for exorcism and blessing.\n\nLooking up to the Three Realms, the Southern Dipper is the palace of longevity; within the Six Bureaus, the Perfected Lords hold the authority of governance. All those with transient forms submit to their rule. Therefore, in accordance with the ranks of the *River Chart* and the rituals of the *Lingbao* scriptures, we solemnly arrange the star lamps and reverently present the offerings of the jiao rites, that we may communicate with the Upper Realm and summon the descent of the lofty perfected.\n\nNow, your disciple [Name] humbly transmits his sincerity through the fragrant incense, trusting in the manifestation of all things. Gazing up to the Southern Culmen, he models himself upon the Dipper’s governance. Thus the radiance of the precious torches shines forth to reveal the divine likeness; chanting the true scriptures and intoning the hymns, may we be deemed worthy of their advent.\n\nWe pray that Heaven’s scrutiny will not reject us, and that the divine heart will respond with kindness. With jade chariots and feathered canopies, your majestic presence is near; with golden steeds and jade carriages, your numinous array fills the void. May the extension of life and the fixing of destiny bring the advent of auspicious qi; may the illumination of the obscure and the scrutiny of the subtle manifest the power of your illuminating presence.\n\nHumbly offering the tokens of the Dharma, we exalt the divine luminaries. Bowing our heads in reverence, we take refuge and devoutly praise. We, your assembled servants, with sincere hearts take refuge in the Great Sage of the Palace of Illustrious Virtue, the Lord of Destiny and Prime Minister of the Southern Dipper’s Celestial Bureau, the Perfected Lord Who Mirrors the State, and all the numinous officials.\n\nI have heard that Heaven endows all living beings with their natural destinies, and that all who embrace the great root return to the midst of the August Culmen. Those who nurture it find fortune ever-increasing; those who corrupt it see calamity arise of itself. The power of governance and control truly resides in the office that oversees all. If there are prayers or exorcisms to be made, one must cultivate utmost sincerity.",
      "overlap_context": "enty-Eight Constellations,\nThe Host of Perfected of All Heavenly Degrees,\nThe Star Lord of One’s Original Destiny,\nThe Three Primordials and Three Officials, Great Emperors,\nThe Four Sagely Lords of the Northern Culmen,\nThe Five Masters and Three Ministries, Perfected Lords,\nThe Four Bureaus of the Three Realms,\nAnd the Boundless Assembly of Sages.\n\nAt the assembly of the Lamp Altar, the myriad sages and thousand perfected gather.\nMay the sagely compassion turn and illumine with radiant clarity.",
      "start_char": 218,
      "end_char": 557,
      "start_sentence": 9,
      "end_sentence": 29,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.693681240081787,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\南斗延寿灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "今辰某洗心涤虑，养气存神，夙怀慕道之心，仰畏在天之像，谨依科式，建立星坛，备香花灯烛之仪，归命明德宫大圣、南斗天府司命上相镇国真君。 伏愿天诱其衷，咸迪绵长之道； 物蒙其泽，悉无短折之凶。 稽首归依，如仪赞咏： 南斗司命、上相高真。 包罗万象，镇国威灵。 为天之府，左右帝臣。 群仙受令，万气来生。 金阙上宰，玉清尊神。 玄元妙道，敢有不遵。 万神安镇，卫护帝庭。 臣众等志心皈命，洞文宫大圣、南斗天相司录上柑镇岳真君，诸灵官。 臣闻：太极之初，道无常体。 我生之后，物有定名。 灾祥在德，而贵贱罔差； 吉凶在人，而贤愚靡间。 眷兹主者，付之自然，倘施丹恳之诚，必获洪休之报。 今辰某专心正意，向道修真，仰惟成象之着明，虔仗上天之助顺。 谨依科式，建立星坛，备香花灯烛之仪，归命洞文宫大圣、南斗司录上相镇岳真君。 伏愿恢弘上道，默收紏察之威； 普济群生，式序修为之善。 稽首归依，虔诚赞咏： 南斗司录，天相尊神。 定生注禄，保命延生。 岳神受命，总监众灵。 赫然妙道，荡涤妖氛。 蠲除恶障，保卫身形。 群仙归仰，众妙咸明。 造化自然，飞升上清。 臣众等志心皈命，柔德宫大圣、南斗天梁延寿保命真君，诸灵官。 臣闻：长生久视，乃大道之体常； 祝寿延生，实庶民之所欲。 在天，则常存而不易； 在人，则命远而不伤。 欲其寿延，莫先所祷，将叩灵司之祝，宜修庶物之诚。 今某专意致明，仰天观象，冀神真之降鉴，祈寿考之增崇，谨依科式，建立星坛，备香花灯烛之仪，归命柔德宫大圣，南斗天梁延寿保命真君。 伏愿诞布至仁，咸迪绵长之庆； 铺张生德，永无夭阏之虞。",
      "translated_text": "This day, I, [Name], purify my heart and cleanse my thoughts, nurture my qi and preserve my spirit. Long have I cherished a heart that yearns for the Dao, revering the celestial images above. In strict accordance with ritual protocol, I establish the stellar altar, preparing the rites of incense, flowers, lamps, and candles. I take refuge in the Great Sage of the Palace of Illustrious Virtue, the Lord of Destiny and Prime Minister of the Southern Dipper’s Celestial Bureau, the Perfected Lord Who Mirrors the State.\n\nMay Heaven guide their hearts, that all may follow the enduring Dao; may all things receive their blessings, that none suffer the misfortune of premature demise. Bowing my head in reverence, I take refuge and chant in accordance with the rites:\n\n*Southern Dipper, Lord of Destiny, exalted Perfected of the Highest Rank,*\n*Encompassing the myriad phenomena, mighty and numinous Guardian of the State.*\n*Celestial Bureau of Heaven, minister to the Emperor on left and right.*\n*The host of immortals receive their commands, the ten thousand qi arise and flourish.*\n*Prime Minister of the Golden Portal, august deity of the Jade Purity.*\n*Mysterious and wondrous Dao, dare there be any who disobey?*\n*May all spirits remain in tranquil vigil, safeguarding the imperial court.*\n\nWe, your assembled servants, with sincere hearts take refuge in the Great Sage of the Palace of Cavernous Script, the Celestial Minister of the Southern Dipper Who Records Destiny, the Perfected Lord Who Mirrors the Sacred Peaks, and all the numinous officials.\n\nI have heard: In the beginning of the Supreme Ultimate, the Dao had no fixed form. After my birth, all things acquired their proper names. Fortune and misfortune lie in virtue, where noble and base are not mistaken; good and ill depend on the person, where worthy and foolish are not confused. Regarding those who preside over these matters, they are entrusted with the natural order. If one offers sincere devotion, one shall surely receive abundant recompense.\n\nThis day, I, [Name], focus my heart and rectify my intentions, turning toward the Dao to cultivate perfection. Gazing upward, I contemplate the luminous celestial images, devoutly relying on the aid and favor of High Heaven. In strict accordance with ritual protocol, I establish the stellar altar, preparing the rites of incense, flowers, lamps, and candles. I take refuge in the Great Sage of the Palace of Cavernous Script, the Celestial Minister of the Southern Dipper Who Records Destiny, the Perfected Lord Who Mirrors the Sacred Peaks.\n\nMay the supreme Dao be magnified, its awe-inspiring power silently gathering and overseeing all; may all living beings be universally saved, their virtuous deeds duly ordered and perfected. Bowing my head in reverence, I devoutly chant:\n\n*Southern Dipper, Recorder of Destiny, august Celestial Minister.*\n*Determining life, bestowing emoluments, preserving fate, and prolonging life.*\n*Peak deities receive their mandate, overseeing the host of spirits.*\n*Resplendent and wondrous Dao, dispelling demonic vapors.*\n*Cleansing away evil obstructions, safeguarding the body’s form.*\n*The host of immortals look up in reverence, all mysteries made manifest.*\n*By the natural workings of creation, ascend to the Supreme Purity.*\n\nWe, your assembled servants, with sincere hearts take refuge in the Great Sage of the Palace of Gentle Virtue, the Celestial Beam of the Southern Dipper Who Prolongs Life and Preserves Destiny, the Perfected Lord, and all the numinous officials.\n\nI have heard: Long life and enduring vision are the constant essence of the great Dao; prayers for longevity and prolonged life are the desires of all people. In Heaven, it remains eternally unchanging; in humanity, it ensures destiny is distant and unharmed. To prolong life, nothing precedes prayer; to invoke the blessings of the numinous office, one must cultivate sincerity toward all things.\n\nThis day, I, [Name], direct my intentions with clarity, gazing upward to observe the celestial images. May the perfected and divine descend to witness my devotion, and may my longevity be increased and exalted. In strict accordance with ritual protocol, I establish the stellar altar, preparing the rites of incense, flowers, lamps, and candles. I take refuge in the Great Sage of the Palace of Gentle Virtue, the Celestial Beam of the Southern Dipper Who Prolongs Life and Preserves Destiny.\n\nMay boundless benevolence be bestowed, that all may follow the blessings of enduring life; may the power of life be spread and expanded, that there be no fear of premature demise.",
      "overlap_context": "Perfected Lord Who Mirrors the State, and all the numinous officials.\n\nI have heard that Heaven endows all living beings with their natural destinies, and that all who embrace the great root return to the midst of the August Culmen. Those who nurture it find fortune ever-increasing; those who corrupt it see calamity arise of itself. The power of governance and control truly resides in the office that oversees all. If there are prayers or exorcisms to be made, one must cultivate utmost sincerity.",
      "start_char": 557,
      "end_char": 1208,
      "start_sentence": 30,
      "end_sentence": 67,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.054736137390137,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\南斗延寿灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "稽首归依，虔诚赞咏： 南斗延寿，为天之梁。 普度万类，咸其浸昌。 寿考惟祺，亿载无疆。 永保天命，以除不祥。 生生不灭，如陵如冈。 仁爱普施，箕翼重光。 与神合德，亘古绵长。 臣众等志心皈命，保光宫大圣、南斗天同益算保生真君，诸灵官。 臣闻：数分而多寡，殊多则为美； 命降而长短，辨长乃其祥。 惟方寸之不欺，庶年龄之可益，上真所掌，精意是求。 今某欲增耆艾之年，钦若昭回之像，交於恍惚，应以形声，谨依科式，建立星坛，备香花灯烛之仪，归命保光宫大圣、南斗天同益算保生真君。 伏愿大慈下际，长如春日之生； 遐算巨增，盛若嵩山之固。 稽首归依，虔诚赞咏： 南斗益算，与天为同。 高明悠久，生德无穷。 保兹元命，使不失中。 寿考且宁，永契真风。 至数流衍，福禄来崇。 亿万斯年，以卫我躬。 洞清上境，命驾云龙。 臣众等志心皈命，天节宫大圣、南斗天枢度厄文昌炼魂真君，诸灵官。 臣闻：二气密移，亦有盛衰之理； 五行迭运，曾无消息之机。 念彼劳生，岂无厄会。 真圣既司於救度，黔黎宜竭於忱恂。 今某恐惧以饬躬，敬信而瞻像。 誓归依於大道，愿受度於神休。 谨依科式，建立坛场，备香花灯烛之仪，归命天节宫大圣、南斗天枢度厄文昌炼魂真君。 伏愿常善救人，庶潜消於灾咎； 永怀济世，示阴惊以休祥。 稽首归依，虔诚赞咏： 南斗度厄，为天之枢。 静以运化，品汇荣枯。 文昌炳焕，以府图书。 转祸为福，作我丹车。 炼魄守神，护魂保躯。 天光泰定，灾厄扫除。 道炁长存，圣真与居。 臣众等志心皈命，大圣宫南斗天机上生监簿大理真君，诸灵官。 臣闻：真仙作德，耻一物而不知； 圣道应时，为群心之妙用。 降衷立命，受气赋形，眷掌握於生成，敢恭虔而请祷。 今某斋心向道，精意瞻天，仰思长育之恩，敢僭祈禳之礼。 谨依科式，建立星坛，备香花灯烛之仪，志心皈命大圣宫南斗天机上生监簿大理真君。 伏愿体乾坤之生德，以运化权； 使性命之委和，咸归有道。 稽首归依，虔诚赞咏： 南斗上生，为天之梁。 斡运造化，出入应时。 职在文籍，鬼神莫窥。 大虚寥廓，大理之司。 自根自本，委顺无亏。 －万劫长存，久视不移。 普天司命，上升太微。 南斗延寿灯仪竟",
      "translated_text": "With bowed head, I take refuge and devoutly intone in praise:\nThe Southern Dipper Prolongs Life, as the Celestial Beam.\nUniversally delivering all beings, may they all flourish and prosper.\nLongevity and felicity, boundless as the ages.\nEternally preserving Heaven’s mandate, dispelling all misfortune.\nLife unceasing, steadfast as hills and ridges.\nBenevolence universally bestowed, the glory of the Winnowing Basket and Wings renewed.\nIn virtue united with the divine, enduring through ancient ages.\n\nWe, your servants, with single-minded devotion take refuge in the Great Sage of the Palace of Preserved Brilliance, the Southern Dipper Celestial Peer Who Increases Lifespan and Preserves Life, and all spirit officials.\n\nI have heard: when numbers are divided, their abundance or scarcity becomes manifest—abundance is deemed excellence. When destiny descends, its length or brevity is distinguished—longevity is its auspicious sign. Only with an un-deceiving heart may the years be extended, for the perfected transcendents govern this, and pure intention is what they seek.\n\nToday, I, [Name], seek to augment my years of venerable age, reverently gazing upon the radiant celestial images. In the realm of the indistinct, response comes through form and sound. Strictly adhering to ritual protocol, I establish the stellar altar, preparing the rites of incense, flowers, lamps, and candles. I take refuge in the Great Sage of the Palace of Preserved Brilliance, the Southern Dipper Celestial Peer Who Increases Lifespan and Preserves Life.\n\nMay boundless compassion descend, ever-growing like the spring sun; may distant years greatly increase, as steadfast as Mount Song’s foundation.\n\nWith bowed head, I take refuge and devoutly intone in praise:\nThe Southern Dipper Increases Lifespan, peer to Heaven.\nLofty, luminous, and enduring, its power of life knows no end.\nPreserving this primordial mandate, that it never lose its center.\nLongevity and tranquility, forever in accord with the true wind.\nThe supreme number flows and spreads, blessings and prosperity ascend.\nFor a hundred million years, may it guard my person.\nThe pure upper realms, where cloud-dragon chariots ascend.\n\nWe, your servants, with single-minded devotion take refuge in the Great Sage of the Palace of Celestial Nodes, the Southern Dipper Celestial Pivot Who Delivers from Calamity and Refines the Soul of Wenchang, and all spirit officials.\n\nI have heard: the two qi subtly shift, bearing the principle of flourishing and decline; the Five Phases alternate in motion, yet never lack the mechanism of ebb and flow. Considering the toils of mortal life, how could there be no encounters with calamity? Since the true sages govern deliverance, the common people should devote themselves wholeheartedly.\n\nToday, I, [Name], in awe and trepidation, rectify my conduct, reverently gazing upon the celestial image with faith and devotion. I vow to take refuge in the Great Dao and seek deliverance through divine grace. Strictly adhering to ritual protocol, I establish the altar, preparing the rites of incense, flowers, lamps, and candles. I take refuge in the Great Sage of the Palace of Celestial Nodes, the Southern Dipper Celestial Pivot Who Delivers from Calamity and Refines the Soul of Wenchang.\n\nMay you ever excel in saving humanity, silently dissolving disasters and misfortunes; ever cherishing the salvation of the world, manifesting subtle warnings of auspicious omens.\n\nWith bowed head, I take refuge and devoutly intone in praise:\nThe Southern Dipper Delivers from Calamity, as Heaven’s Pivot.\nIn stillness, it governs transformation, all things flourish and wither.\nWenchang shines resplendent, repository of charts and books.\nTurning misfortune into fortune, crafting my cinnabar chariot.\nRefining the po and guarding the shen, protecting the hun and preserving the body.\nHeaven’s light settled in peace, calamities swept away.\nThe Dao’s qi endures, dwelling with the sacred and true.\n\nWe, your servants, with single-minded devotion take refuge in the Great Sage of the Palace of Great Sanctity, the Southern Dipper Celestial Mechanism Who Oversees Life and the Great Judge, and all spirit officials.\n\nI have heard: true immortals enact virtue, ashamed to be ignorant of even a single thing; the sagely Dao responds to the times, serving as the wondrous function of all hearts. Bestowing the center and establishing destiny, receiving qi and endowing form, they oversee the work of generation and completion—how dare I not approach with reverence and offer my prayers?\n\nToday, I, [Name], purify my heart and turn toward the Dao, with focused intention gazing upon Heaven. Reflecting upon the grace of nurturing and growth, I venture to perform the rites of prayer and exorcism. Strictly adhering to ritual protocol, I establish the stellar altar, preparing the rites of incense, flowers, lamps, and candles. With single-minded devotion, I take refuge in the Great Sage of the Palace of Great Sanctity, the Southern Dipper Celestial Mechanism Who Oversees Life and the Great Judge.\n\nMay you embody the generative power of Heaven and Earth to govern transformation; may the harmony of nature and destiny all return to the Dao.\n\nWith bowed head, I take refuge and devoutly intone in praise:\nThe Southern Dipper Oversees Life, as Heaven’s Beam.\nDirecting the workings of creation, moving in and out in timely response.\nCharged with the registers of destiny, even spirits dare not pry.\nThe vastness of the Great Void, the office of the Great Judge.\nFrom root to origin, compliant and without deficiency.\nThrough ten thousand kalpas enduring, ever-watchful and unchanging.\nThe universal overseer of destiny, ascending to the Supreme Subtlety.\nThe Rites of the Southern Dipper Longevity Lamp are now complete.",
      "overlap_context": "y longevity be increased and exalted. In strict accordance with ritual protocol, I establish the stellar altar, preparing the rites of incense, flowers, lamps, and candles. I take refuge in the Great Sage of the Palace of Gentle Virtue, the Celestial Beam of the Southern Dipper Who Prolongs Life and Preserves Destiny.\n\nMay boundless benevolence be bestowed, that all may follow the blessings of enduring life; may the power of life be spread and expanded, that there be no fear of premature demise.",
      "start_char": 1208,
      "end_char": 2085,
      "start_sentence": 68,
      "end_sentence": 125,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.127182006835938,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\南斗延寿灯仪.txt",
        "category": "威仪类"
      }
    }
  ]
}