{
  "source_id": "南统大君内丹九章经",
  "source_file": "chunked_daozang\\南统大君内丹九章经.json",
  "total_chunks": 2,
  "total_original_chars": 1897,
  "total_translated_chars": 12538,
  "total_translation_time": 63.77326726913452,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\南统大君内丹九章经.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**The Nine-Chapters Scripture of Internal Alchemy of the Southern Unification Perfected Lord**\n\n**Title:** *The Nine-Chapters Scripture of Internal Alchemy of the Southern Unification Perfected Lord*. Also known as *The Nine-Chapters Scripture of Internal Alchemy*. Author unknown. According to the preface, it is suspected to be the work of Wu Jun of the Tang dynasty. One scroll. Source text: *Daoist Canon of the Zhengtong Era*, *Great Mystery Section*.\n\n---\n\n**Preface to The Nine-Chapters Scripture of Internal Alchemy of the Southern Unification Perfected Lord**\n\nDuring the Kaiyuan era, I composed *The Treatise on the Mysterious Principle* and *The Treatise on Nurturing Form*, which circulated in the world. I was summoned to serve as Prefect of Jiangzhou but declined the appointment. Retreating into obscurity, I concealed myself at Mount Li, cultivating fetal breathing. By the Yuanhe era, I traveled to Huaixi, where I encountered the imperial army suppressing the rebellion of Wu Yuanji, the traitor of Cai. To evade the chaos, I fled to the mountains, where I met Li the Banished Immortal. He bestowed upon me this method of defense, saying: \"This is the Gate of Life of the Southern Unification Perfected Lord. Entering this gate, your life rests in your own hands.\"\n\nThe nine chapters correspond to the number of yang lines in the hexagrams. Though the text is concise and its matters brief, it is truly the gradual steps of the Daoist path and the true way to seek life. He further said: \"Internal alchemy is precisely this.\" Today, I transmit it to you, but beware—do not reveal it to those without the vessel or capacity to harmonize the numinous spirits, lest you incur disaster.\n\nThe essence of the nine chapters is to be passed down to later generations, but it is not to be taught to those of middling or lesser talent. Thus, I record this preface.\n\nWritten by Wu Jun in the *wuxu* year of the Yuanhe era of the Tang.\n\n---\n\n**The Nine-Chapters Scripture of Internal Alchemy of the Southern Unification Perfected Lord**\n\n**Chapter One: The Wise and the Foolish Differ in Substance**\n\nTo humble oneself and seek the Dao, with aspirations soaring beyond the Milky Way—this is the superior person. To squander longevity and harm one’s nature, content to dwell in the dark earth below—this is the foolish and benighted.\n\nThe Perfected Lord said: Humans originally emerged with Heaven and Earth from the Void. Why then can Heaven and Earth attain their full span of years, while humans cannot preserve their forms? It is not that the Dao betrays humanity, but that humanity betrays the Dao. The wise and the foolish differ in substance; the pure and the turbid follow separate paths.\n\nThus, my Dao is not the path of ascending to Heaven. It is the path of gathering the spirit to form the Dao. When the spirit gathers, internal alchemy is accomplished, and one preserves their form.\n\n---\n\n**Chapter Two: The Radiance of the Spirit**\n\nOrdinary people also use this to divine fortune and misfortune: yellow is auspicious, white is inauspicious, green portends worry, and black signifies death. Other omens are not permitted to be known.\n\nAvoid chaotic sounds, sever licentious desires, refrain from excessive drunkenness, and observe the moment between night’s end and dawn’s first light. Face left and right to perceive it. If it flashes like lightning and its radiance is vast and round, it is the sign of attaining longevity. With time, the round brilliance will envelop the body, like a shooting star scattering its rays—such is the omen of the Dao’s flourishing.\n\nThe Perfected Lord said: First, strike the Heavenly Drum, rest your head on the pillow, and gather the light. Calm the heart and close the eyes, visualizing the sun. The sun resides above the Gate of the Palace, and the moon lies outside the Cinnabar Field. In deep sleep, the spirit is tranquil, and the qi is upright.\n\n---\n\n**Chapter Three: Audience with the Dipper**\n\nThe year has three origins, and the month has three sevens. Purify the heart, sit upright, clasp the hands firmly, and meditate with closed eyes. Imagine arriving at the Golden Palace, as if beholding the imperial countenance. Bow in reverence, prostrate, and pay homage, just as one would in an audience with the Son of Heaven. When finished, withdraw with trembling awe, shoulders hunched, and swiftly depart. Wash away worldly cares, cease all distractions, and purify the heart. Then, the audience with the origin may occur at any time. In the deep of night, within a secluded chamber, face the Northern Asterism and perform this method—ease of spiritual communion will follow.\n\n---\n\n**Chapter Four: The Gengshen Night**\n\nOrdinary people who keep vigil on this night without sleeping do not follow the original method. On the Gengshen night, prepare incense and fire in the oratory. Sit upright, clasp the hands firmly, and first strike the Heavenly Drum thirty-six times. When the spirit is gathered, next visualize the hundred spirits within the body emerging, all dressed in caps and swords with solemn dignity, standing guard before, behind, left, and right. Then, lead them to pay homage to the Supreme Dao Lord, just as in the method of audience with the Dipper.\n\nPracticing this for three years, neither weapons nor tigers can harm you. The Three Corpses dare not linger, and in dreams, tall and beautiful maidens will bestow rare flowers and exotic fruits—these are the responses of spiritual communion and the auspicious omens of extended longevity.\n\n---\n\n**Chapter Five: Cultivating Yang Virtue**\n\nNo good deed is too small, for all are tied to yang; no evil deed is too small, for all belong to yin. Accumulating good deeds and magnifying them, yang qi flourishes and brings forth auspiciousness. Accumulating evil deeds and deepening them, yin qi arises and brings forth calamity.\n\nThus, those who seek longevity first rely on yin virtue and later welcome yang retribution—such is the way to distant years.\n\nThe Perfected Lord said: Those who follow this path all enter the register of immortals. Ingesting numinous herbs, their countenance remains robust and ageless. Medicinal wealth serves as the lining, while the art serves as the outer garment. The hundred spirits gather easily, and the form may be preserved for long.\n\n---\n\n**Chapter Six: Guiding and Drawing Forth Original Yang**\n\nWhen the hundred joints are opened and unobstructed, the five viscera are all regulated. When the six palaces are all massaged, perverse qi cannot enter. The Heavenly Drum resounds, and nightmares and impurities are all dispelled. Original qi flows through the pathways of fluids, and wherever the qi and fluids reach, the bones and marrow become like metal, and the spirit must be unimpeded.\n\nAfter guiding and drawing forth, stabilize the breath and sound the Heavenly Drum to gather the spirit. Then, exhale with the sounds *xu*, *he*, *hu*, *xi*, *yan*, and *chui*, ensuring they are not heard by the ears. With time, pure qi accumulates within, and turbid, impure qi dissipates.\n\nThe Perfected Lord said: Though the elixir may not yet be complete, the spirit is already empty and luminous. When original yang qi is balanced, one attains long life.\n\n---\n\n**Chapter Seven: The Taboos of Yin**\n\nThunder, lightning, torrential rain, and great winds that uproot trees—these are manifestations of great anger, and even ghosts and spirits are terrified. Therefore, stand with hands clasped, bow in reverence, and tremble with awe. Rest in the forest, and do not engage in conjugal relations. Those who violate this will have their life spans stolen by ghosts and spirits, and their illnesses will be difficult to cure.\n\nThe Perfected Lord said: When Heaven’s majesty is enraged, yin spirits all tremble in fear. With time, yin demons flee, the register of death is erased, and the hundred spirits assist—this is called ascending the chariot of fortune and shattering the vehicle of misfortune.\n\n---\n\n**Chapter Eight: Habituation to the Near Brings Life**\n\nCold demeanor is the step to premature death; lewd sounds are the axe that severs nature; fine delicacies and goblets of wine are the drugs that disorder the spirit; carriages, caps, sashes, and official robes are the adornments that burden the form. Though these four perils are widely known, none can abandon them. Those who cannot abandon them are called \"walking corpses.\"\n\nThe path to ascending to Heaven is distant, but the path to preserving life is near. Thus, it is better to habituate oneself to the near.\n\nThe Perfected Lord said: When the spirit gathers, it becomes numinous; when qi is pure, it becomes light.\n\nWhen spirit gathers and qi is pure, this is called guarding the form, this is called preserving life.\n\n**Chapter Nine: Resonance with the Seven Luminaries**\n\nWith the heart revering the radiance of the Seven Stars and the feet treading their steps, the tracks must not overlap. Tread the number forty-nine, turn to look back while grasping firmly, and strike the celestial drum. With eyes closed, visualize the Azure Dragon to the left and the White Tiger to the right.\n\nThus it is said: If I do not seek the Real, the Real will surely follow me. When the spirit attains the Real qi, the hundred spirits all protect it.\n\nTo receive the Real qi, one must encounter a Perfected Person—perhaps in a dream journeying through seas and mountains, seeing dragons and beasts all clad in white, or the palaces and gardens of the Son of Heaven. This is the spirit uniting with the form, and life’s defense is thus established.\n\nThereafter, report to the Original Spirit and pay homage to the Star of Longevity; the Celestial Pass will then be unimpeded.\n\n**Postscript**\n\nThe two stars *Jiao* and *Kang* of the Eastern Palace, the elders of the constellations, are thus called the Stars of Longevity. Between these two stars lies the Gate of Heaven, also called the Celestial Pass. All who attain the Dao and ascend to the Origin must enter through this gate. Those who obtain this Way report to the Original Spirit and resonate with the Star of Longevity, whereupon their names are recorded at the Celestial Pass. When merit is complete and they ascend to Heaven, the Original Hour escorts them through the gate, and thus there is no hindrance.\n\nI toiled for forty years before achieving even a single degree, and knowing my fate to be meager, I then turned to seeking the Real. I studied the immortals’ scriptures but found no principle of life. Traveling south, I visited the traces of Lord Mao’s cultivation, ascending Mao Peak and entering the stone chamber, where I first obtained the *Original Dao True Scripture*—the principle of the Most High Lord of the Dao returning to the root and restoring the origin, a teaching that does not wane.\n\nI held to this principle for over a decade, focusing solely on embryonic breathing. Though I persisted, alas, it was not the eyelash before my eyes. Later, on another journey, I met an old man who asked: \"Do you wish to learn immortality?\" He said: \"To learn immortality is to move from the dust into the Real, like refining ore to smelt gold. Why not first seek the art of destiny to prolong life, then cultivate hidden virtue, and ascend its gradual steps? As for Heavenly Immortals, their merit moves Heaven, which then bestows a mandate, enabling them to lightly ascend and become immortals. Even after reaching the immortal realm, they still refine Real qi, for qi and spirit must merge—hence the term *spirit-immortal*. Spirit-immortals embody emptiness, thus they can ride simurghs and cranes, mount clouds and qi to soar through the Great Void, their longevity matching Heaven and Earth. The *Original Dao True Scripture* you obtained is but the snare and trap for seeking immortality—vast and boundless, like searching for fish and rabbits.\n\nLong ago, Lord Mao ascended, leaving the *Great Lord’s Life Defense* hidden in the stone chamber atop the mountain, entrusting me to guard it, intending to transmit it to one of predestined affinity. You, with your solitary qi pure and clear, must possess immortal bones.\" Thereupon, he produced these nine chapters and bestowed them upon me before departing, charging me: \"This is the very fish and rabbit you seek. The Dao is not outside the self—treasure it! Treasure it!\"\n\nI then recorded its teachings in this postscript to commemorate it, entitling it *The Inner Elixir Divine Formula*.\n\n—Preface by Wu Jun\n\n*Thus concludes the* Nine-Chapter Scripture of the Inner Elixir *of the Southern Orthodox Lord.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "南统大君内丹九章经 经名：南统大君内丹九章经。 又名《内丹九章经》。 不着撰人。 据复序疑为唐代吴筠所作。 一卷。 底本出处：《正统道藏》太玄部。 南统大君内丹九章经序 予於开元中着《玄纲论》及《养形论》行於世，诏授江州刺史，辞而不受，晦迩隐於骊山，养胎息。 至元和中游淮西，遇王师讨蔡贼昊元济，避乱束之於岳，遇李谪仙以斯卫授予曰：此南统大君之生门也，入其门则我命在我。 九章象阳之爻数也，其文略尸其事简，实学道之渐阶，为求生之真路也。 又曰：内丹者，即此也。 吾今授汝，慎勿泄无器识调神灵之徒，否则罹灾矣。 九章之旨，许度后人，但不授中下之才者尔。 故录为之序引。 唐元和戊戌昊筠序。 南统大君内丹九章经 贤愚异实章第一 屈身问道，志腾云汉之外，上士也。 伐寿损性，甘心於幽壤之下，愚蒙也。 大君曰：人本与天地同生於虚无，何天地则能齐其寿，而人不能存其形？ 是道不负人，人负於道也。 贤愚异实，清浊殊途。 故吾之道，非升天之道，集神以为道，神集则内丹成，存其形。 神光章第二 常人亦以此候吉凶，黄吉白凶，青忧黑死，余候则不令知之。 去乱声，绝淫志，无大醉，候夜绝明，左右取之。 若电烁而光圆大，而享寿之征也。 久则圆明被体，如流星迸芒，其道必昌。 大君曰：先扣天鼓，伏枕收光，澄心瞑目，想见太阳。 太阳在阙门上，太阴在丹田外，熟寝神静，神集气正。 朝斗章第三 岁有三元，月有三七，斋心端居，握固暝想，如到金阙，如睹宸容，稽首伏拜，一如朝天子之仪礼。 毕，战惧拱耸趋出，洗涤烦虑，止绝烦虑，为斋心，然则朝元无时，夜阑於密室对北辰象行此法，易感通也。 庚申章第四常 人守此法，夜不寐，非本法。 如庚申夜於序室具香火，端居握固，先扣天鼓三十六通，集神毕，次想身中百神皆出，具冠剑威仪，侍卫於前后左右，讫乃引朝太上道君，一如朝斗之法。 行之三年，兵虎不能害，三尸不敢守，梦长材美人遗奇花异果，感通之应，送寿之祥也。 修阳德章第五 为善无小大，皆系於阳； 为恶无小大，皆属於阴。 积善滋大，则阳气发而为祥； 积恶滋深，则阴气作而为祸。 故希寿之士，先凭阴德后迎阳报者，即遐龄也。 大君曰：如此之流，皆入仙格。 服饵灵草，容壮难老。 药财为裹，术则为表。 百神易集，形可长保。 导引元阳章第六 百关开通则五藏皆理，六府俱摩则邪气不入。 天鼓呜魇秽皆去，元气行津路流通，气液所及，骨髓如金，神必亨畅。 导引毕，定息呜天鼓，集神，乃嘘呵呼嘻咽吹之声无令耳闻，久则清气积於内，浊秽之气消亡矣。 大君曰：丹虽未成，神已虚明。 元阳气平，乃人长生。 阴忌章第七 雷电震雨，大风拔树，此乃大怒，鬼神皆怖。 是故，拱立稽首，凛而兢惧，宴息於林，无行夫妇，如否者，鬼神夺算，病则难愈。 大君曰：故天威怒，阴灵皆怖，久则阴贼遁，死籍除，百神扶，此之谓登福举，碎祸车。 习近则生章第八 冷容，夭寿之阶也； 淫声，伐性之斧也； 珍肴卮酒，乱神之药也； 轩冕缙绅，贲形之具也。 此四患靡不知之，无能舍之，舍之不得，谓之行尸。 升天道远，全生道近，故不如习近。 大君曰：神集则灵，气清则轻。",
      "translated_text": "**The Nine-Chapters Scripture of Internal Alchemy of the Southern Unification Perfected Lord**\n\n**Title:** *The Nine-Chapters Scripture of Internal Alchemy of the Southern Unification Perfected Lord*. Also known as *The Nine-Chapters Scripture of Internal Alchemy*. Author unknown. According to the preface, it is suspected to be the work of Wu Jun of the Tang dynasty. One scroll. Source text: *Daoist Canon of the Zhengtong Era*, *Great Mystery Section*.\n\n---\n\n**Preface to The Nine-Chapters Scripture of Internal Alchemy of the Southern Unification Perfected Lord**\n\nDuring the Kaiyuan era, I composed *The Treatise on the Mysterious Principle* and *The Treatise on Nurturing Form*, which circulated in the world. I was summoned to serve as Prefect of Jiangzhou but declined the appointment. Retreating into obscurity, I concealed myself at Mount Li, cultivating fetal breathing. By the Yuanhe era, I traveled to Huaixi, where I encountered the imperial army suppressing the rebellion of Wu Yuanji, the traitor of Cai. To evade the chaos, I fled to the mountains, where I met Li the Banished Immortal. He bestowed upon me this method of defense, saying: \"This is the Gate of Life of the Southern Unification Perfected Lord. Entering this gate, your life rests in your own hands.\"\n\nThe nine chapters correspond to the number of yang lines in the hexagrams. Though the text is concise and its matters brief, it is truly the gradual steps of the Daoist path and the true way to seek life. He further said: \"Internal alchemy is precisely this.\" Today, I transmit it to you, but beware—do not reveal it to those without the vessel or capacity to harmonize the numinous spirits, lest you incur disaster.\n\nThe essence of the nine chapters is to be passed down to later generations, but it is not to be taught to those of middling or lesser talent. Thus, I record this preface.\n\nWritten by Wu Jun in the *wuxu* year of the Yuanhe era of the Tang.\n\n---\n\n**The Nine-Chapters Scripture of Internal Alchemy of the Southern Unification Perfected Lord**\n\n**Chapter One: The Wise and the Foolish Differ in Substance**\n\nTo humble oneself and seek the Dao, with aspirations soaring beyond the Milky Way—this is the superior person. To squander longevity and harm one’s nature, content to dwell in the dark earth below—this is the foolish and benighted.\n\nThe Perfected Lord said: Humans originally emerged with Heaven and Earth from the Void. Why then can Heaven and Earth attain their full span of years, while humans cannot preserve their forms? It is not that the Dao betrays humanity, but that humanity betrays the Dao. The wise and the foolish differ in substance; the pure and the turbid follow separate paths.\n\nThus, my Dao is not the path of ascending to Heaven. It is the path of gathering the spirit to form the Dao. When the spirit gathers, internal alchemy is accomplished, and one preserves their form.\n\n---\n\n**Chapter Two: The Radiance of the Spirit**\n\nOrdinary people also use this to divine fortune and misfortune: yellow is auspicious, white is inauspicious, green portends worry, and black signifies death. Other omens are not permitted to be known.\n\nAvoid chaotic sounds, sever licentious desires, refrain from excessive drunkenness, and observe the moment between night’s end and dawn’s first light. Face left and right to perceive it. If it flashes like lightning and its radiance is vast and round, it is the sign of attaining longevity. With time, the round brilliance will envelop the body, like a shooting star scattering its rays—such is the omen of the Dao’s flourishing.\n\nThe Perfected Lord said: First, strike the Heavenly Drum, rest your head on the pillow, and gather the light. Calm the heart and close the eyes, visualizing the sun. The sun resides above the Gate of the Palace, and the moon lies outside the Cinnabar Field. In deep sleep, the spirit is tranquil, and the qi is upright.\n\n---\n\n**Chapter Three: Audience with the Dipper**\n\nThe year has three origins, and the month has three sevens. Purify the heart, sit upright, clasp the hands firmly, and meditate with closed eyes. Imagine arriving at the Golden Palace, as if beholding the imperial countenance. Bow in reverence, prostrate, and pay homage, just as one would in an audience with the Son of Heaven. When finished, withdraw with trembling awe, shoulders hunched, and swiftly depart. Wash away worldly cares, cease all distractions, and purify the heart. Then, the audience with the origin may occur at any time. In the deep of night, within a secluded chamber, face the Northern Asterism and perform this method—ease of spiritual communion will follow.\n\n---\n\n**Chapter Four: The Gengshen Night**\n\nOrdinary people who keep vigil on this night without sleeping do not follow the original method. On the Gengshen night, prepare incense and fire in the oratory. Sit upright, clasp the hands firmly, and first strike the Heavenly Drum thirty-six times. When the spirit is gathered, next visualize the hundred spirits within the body emerging, all dressed in caps and swords with solemn dignity, standing guard before, behind, left, and right. Then, lead them to pay homage to the Supreme Dao Lord, just as in the method of audience with the Dipper.\n\nPracticing this for three years, neither weapons nor tigers can harm you. The Three Corpses dare not linger, and in dreams, tall and beautiful maidens will bestow rare flowers and exotic fruits—these are the responses of spiritual communion and the auspicious omens of extended longevity.\n\n---\n\n**Chapter Five: Cultivating Yang Virtue**\n\nNo good deed is too small, for all are tied to yang; no evil deed is too small, for all belong to yin. Accumulating good deeds and magnifying them, yang qi flourishes and brings forth auspiciousness. Accumulating evil deeds and deepening them, yin qi arises and brings forth calamity.\n\nThus, those who seek longevity first rely on yin virtue and later welcome yang retribution—such is the way to distant years.\n\nThe Perfected Lord said: Those who follow this path all enter the register of immortals. Ingesting numinous herbs, their countenance remains robust and ageless. Medicinal wealth serves as the lining, while the art serves as the outer garment. The hundred spirits gather easily, and the form may be preserved for long.\n\n---\n\n**Chapter Six: Guiding and Drawing Forth Original Yang**\n\nWhen the hundred joints are opened and unobstructed, the five viscera are all regulated. When the six palaces are all massaged, perverse qi cannot enter. The Heavenly Drum resounds, and nightmares and impurities are all dispelled. Original qi flows through the pathways of fluids, and wherever the qi and fluids reach, the bones and marrow become like metal, and the spirit must be unimpeded.\n\nAfter guiding and drawing forth, stabilize the breath and sound the Heavenly Drum to gather the spirit. Then, exhale with the sounds *xu*, *he*, *hu*, *xi*, *yan*, and *chui*, ensuring they are not heard by the ears. With time, pure qi accumulates within, and turbid, impure qi dissipates.\n\nThe Perfected Lord said: Though the elixir may not yet be complete, the spirit is already empty and luminous. When original yang qi is balanced, one attains long life.\n\n---\n\n**Chapter Seven: The Taboos of Yin**\n\nThunder, lightning, torrential rain, and great winds that uproot trees—these are manifestations of great anger, and even ghosts and spirits are terrified. Therefore, stand with hands clasped, bow in reverence, and tremble with awe. Rest in the forest, and do not engage in conjugal relations. Those who violate this will have their life spans stolen by ghosts and spirits, and their illnesses will be difficult to cure.\n\nThe Perfected Lord said: When Heaven’s majesty is enraged, yin spirits all tremble in fear. With time, yin demons flee, the register of death is erased, and the hundred spirits assist—this is called ascending the chariot of fortune and shattering the vehicle of misfortune.\n\n---\n\n**Chapter Eight: Habituation to the Near Brings Life**\n\nCold demeanor is the step to premature death; lewd sounds are the axe that severs nature; fine delicacies and goblets of wine are the drugs that disorder the spirit; carriages, caps, sashes, and official robes are the adornments that burden the form. Though these four perils are widely known, none can abandon them. Those who cannot abandon them are called \"walking corpses.\"\n\nThe path to ascending to Heaven is distant, but the path to preserving life is near. Thus, it is better to habituate oneself to the near.\n\nThe Perfected Lord said: When the spirit gathers, it becomes numinous; when qi is pure, it becomes light.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1278,
      "start_sentence": 0,
      "end_sentence": 65,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.146029472351074,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\南统大君内丹九章经.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "神集气清，是谓守形，是谓全生。 七曜感通章第九 心仰七星之光，足履七星之步，迹勿重，履四十九数，回视握固，扣呜天鼓，瞑目存想左龙右虎。 故曰：我不寻真，真必相随，神得真气，百灵皆护。 授真气必遇至人，或梦游海山，见龙兽皆白衣，天子宫楼御苑，是神合形，命卫成矣。 然后告元神，享寿星，天关无碍。 后序 束方角亢二星，列宿之长，故日寿也。 二星之问，则天门也，亦日天关。 凡得道朝元，皆由此门而入。 得此道者，告元神则感通享寿星，则关奏录系於天门矣。 功满升天，元辰接引入门，则无碍。 一予四十年方遂一第，既知命寡，遂慕寻真，讨究仙经，莫得生理，因南访茅君修真之迹，登茅巅，入石室，先得《元道真经》，即太上道君归根复本号而不嘎之理也。 乃执其理十余年，惟攻胎息，续用既劳，嗟乎非眼前之睫也。 后再游，逢老叟日：汝欲学仙乎？ 学仙者从尘入真，如炼矿而镕金也，何不先求命术，以延其生，后修阴德，登其渐阶乎？ 天仙也者，功感上天，韶授锡命，乃遂轻举而为仙人也。 虽达仙境，犹炼真气，气与神并，故曰神仙。 神仙体虚，故能跨鸾驭鹤，乘云气飞腾太虚，寿齐天地。 汝得《元道真经》，求仙之荃蹄也。 其莽荡，鱼兔难寻。 昔茅君上升，留《大君命卫》藏於山巅石室，俾吾守之，盖欲传於夙分者也。 汝格孤气清，必有仙骨，乃出此九·章，授予而去。 嘱曰：此即所求之鱼兔也，道非身外，宝之！ 宝之！ 乃录其育为序以纪之，仍目之曰内丹神诀矣。 昊筠序。 南统大君内丹九章经竟",
      "translated_text": "When spirit gathers and qi is pure, this is called guarding the form, this is called preserving life.\n\n**Chapter Nine: Resonance with the Seven Luminaries**\n\nWith the heart revering the radiance of the Seven Stars and the feet treading their steps, the tracks must not overlap. Tread the number forty-nine, turn to look back while grasping firmly, and strike the celestial drum. With eyes closed, visualize the Azure Dragon to the left and the White Tiger to the right.\n\nThus it is said: If I do not seek the Real, the Real will surely follow me. When the spirit attains the Real qi, the hundred spirits all protect it.\n\nTo receive the Real qi, one must encounter a Perfected Person—perhaps in a dream journeying through seas and mountains, seeing dragons and beasts all clad in white, or the palaces and gardens of the Son of Heaven. This is the spirit uniting with the form, and life’s defense is thus established.\n\nThereafter, report to the Original Spirit and pay homage to the Star of Longevity; the Celestial Pass will then be unimpeded.\n\n**Postscript**\n\nThe two stars *Jiao* and *Kang* of the Eastern Palace, the elders of the constellations, are thus called the Stars of Longevity. Between these two stars lies the Gate of Heaven, also called the Celestial Pass. All who attain the Dao and ascend to the Origin must enter through this gate. Those who obtain this Way report to the Original Spirit and resonate with the Star of Longevity, whereupon their names are recorded at the Celestial Pass. When merit is complete and they ascend to Heaven, the Original Hour escorts them through the gate, and thus there is no hindrance.\n\nI toiled for forty years before achieving even a single degree, and knowing my fate to be meager, I then turned to seeking the Real. I studied the immortals’ scriptures but found no principle of life. Traveling south, I visited the traces of Lord Mao’s cultivation, ascending Mao Peak and entering the stone chamber, where I first obtained the *Original Dao True Scripture*—the principle of the Most High Lord of the Dao returning to the root and restoring the origin, a teaching that does not wane.\n\nI held to this principle for over a decade, focusing solely on embryonic breathing. Though I persisted, alas, it was not the eyelash before my eyes. Later, on another journey, I met an old man who asked: \"Do you wish to learn immortality?\" He said: \"To learn immortality is to move from the dust into the Real, like refining ore to smelt gold. Why not first seek the art of destiny to prolong life, then cultivate hidden virtue, and ascend its gradual steps? As for Heavenly Immortals, their merit moves Heaven, which then bestows a mandate, enabling them to lightly ascend and become immortals. Even after reaching the immortal realm, they still refine Real qi, for qi and spirit must merge—hence the term *spirit-immortal*. Spirit-immortals embody emptiness, thus they can ride simurghs and cranes, mount clouds and qi to soar through the Great Void, their longevity matching Heaven and Earth. The *Original Dao True Scripture* you obtained is but the snare and trap for seeking immortality—vast and boundless, like searching for fish and rabbits.\n\nLong ago, Lord Mao ascended, leaving the *Great Lord’s Life Defense* hidden in the stone chamber atop the mountain, entrusting me to guard it, intending to transmit it to one of predestined affinity. You, with your solitary qi pure and clear, must possess immortal bones.\" Thereupon, he produced these nine chapters and bestowed them upon me before departing, charging me: \"This is the very fish and rabbit you seek. The Dao is not outside the self—treasure it! Treasure it!\"\n\nI then recorded its teachings in this postscript to commemorate it, entitling it *The Inner Elixir Divine Formula*.\n\n—Preface by Wu Jun\n\n*Thus concludes the* Nine-Chapter Scripture of the Inner Elixir *of the Southern Orthodox Lord.*",
      "overlap_context": "ine are the drugs that disorder the spirit; carriages, caps, sashes, and official robes are the adornments that burden the form. Though these four perils are widely known, none can abandon them. Those who cannot abandon them are called \"walking corpses.\"\n\nThe path to ascending to Heaven is distant, but the path to preserving life is near. Thus, it is better to habituate oneself to the near.\n\nThe Perfected Lord said: When the spirit gathers, it becomes numinous; when qi is pure, it becomes light.",
      "start_char": 1278,
      "end_char": 1888,
      "start_sentence": 66,
      "end_sentence": 93,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.627237796783447,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\南统大君内丹九章经.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}