{
  "source_id": "历代崇道记",
  "source_file": "chunked_daozang\\历代崇道记.json",
  "total_chunks": 13,
  "total_original_chars": 8057,
  "total_translated_chars": 51500,
  "total_translation_time": 255.77868676185608,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\记传类\\历代崇道记.txt",
    "category": "记传类"
  },
  "full_translation": "**Records of the Veneration of the Dao Through the Ages**\n\n**Scripture Title:** *Records of the Veneration of the Dao Through the Ages*. One fascicle. Compiled by Du Guangting of the late Tang and Five Dynasties period. Base text from the *Daoist Canon of the Zhengtong Era*, Dongxuan Section, Records and Biographies Category.\n\n**Records of the Veneration of the Dao Through the Ages**\n\nKing Mu of Zhou venerated the Queen Mother of the West at Kunlun Mountain, Wangwu Mountain, Mount Song, Mount Hua, Mount Tai, Mount Heng, Mount Heng (in Shanxi), Zhongnan Mountain, Mount Kuaiji, Mount Qingcheng, Mount Tiantai, Mount Luofu, and Mount Kongtong, ordaining over five thousand Daoist priests in total.\n\nEmperor Shi Huang of Qin, having unified the Six Kingdoms, summoned masters of esoteric arts and favored the techniques of longevity. He dispatched envoys to Penglai to seek the elixir of immortality, constructed over one hundred palaces and temples, and ordained more than seventeen hundred Daoist priests.\n\nEmperor Wen of Han and Empress Dowager Dou both favored the teachings of the Yellow Emperor and Laozi. They built seventy-two palaces and temples, decreeing that those who did not master the scriptures of the Yellow Emperor and Laozi could not hold official positions. The emperor personally visited the River Earl to inquire into the essentials of the *Dao* and *virtue*, bringing great order to the realm. In total, over one thousand Daoist priests were ordained.\n\nEmperor Wu of Han venerated the Dao with even greater devotion. Moved by his sincerity, the Queen Mother descended into his palace and bestowed upon him five silver statues, declaring them to be the true forms of the Most High Lord Lao. The emperor had three separate halls constructed to enshrine them. Later, the statues were moved to the Bailiang Terrace, and subsequently to the Gansui Palace, where they were arranged in a single hall, facing south—a practice that began from this time. He also ordained several princesses and approximately five thousand Daoist priests, constructing over three hundred temples. Among these, the Wansui Temple on Mount Song, the Dengfeng Temple on Mount Tai, the Jixian Temple on Mount Hua, the Wangling Temple on Zhongnan Mountain, and the Tongtian Temple on Wangwu Mountain were forbidden to commoners, serving as models of reverence. The Wansui Temple originated when the emperor, during an imperial progress, heard the mountain’s acclamation and converted his temporary palace into a temple.\n\nDuring the reign of Emperor Xuan of Han, Li Tan, a clerk of Shangdang Commandery, entered Baodu Mountain to gather herbs. In a stone chamber, he discovered over forty volumes of celestial scriptures, along with a jade box and jade staff, which he presented to Zhang Chun, the governor of Hedong Commandery. Zhang promptly dispatched envoys to submit them to the emperor. Upon viewing them, the emperor was so astonished that he wept, ordering their display to all court officials. At the time, Ran Kui, the Chief Clerk of the Palace Secretariat, wept upon seeing them and said, “These are the posthumous instructions Emperor Wu left to be buried with him in his coffin. How have they come to this?” Upon examining the scrolls, the names of officials who had collated them were found, some of whom were still alive. The emperor then sent envoys to inspect Maoling, where all was found intact as before. He subsequently built two temples for Emperor Wu—one within Chang’an and another below Maoling—to honor his predecessor. He also ordained twenty Daoist priests to tend the incense and lamps.\n\nDuring the Red Eyebrows Rebellion, Maoling was raided by rebels. Within the emperor’s coffin, only a single sword was found. As they attempted to take it, the sword suddenly roared and soared into the sky.\n\nAfter Emperor Guangwu of the Later Han pacified Wang Mang and stabilized the realm, he performed the Feng and Shan sacrifices to the east. He then established temples to offer sacrifices for the eleven emperors of his dynasty, as well as at Nanyang, Chongling, famous mountains, great rivers, Chang’an, and Luoyang, constructing a total of one hundred and twenty temples and ordaining one thousand eight hundred Daoist priests.\n\nEmperor Ming of Wei built thirteen temples in the five capitals to honor Emperor Wu and his late empress dowager, ordaining one hundred and nine Daoist priests. He also decreed that Daoist scriptures be adorned in the same manner as imperial edicts.\n\nSun Quan, the ruler of Wu, built the Tongbai Temple on Mount Tiantai and appointed Ge Xuan to reside there. At Fuchun, he constructed the Chongfu Temple to honor his parents. In Jianye, he built the Xingguo Temple, and on Mount Mao, the Jingyang Temple. In total, he built thirty-nine temples and ordained eight hundred Daoist priests.\n\nEmperor Wu of Jin constructed the Tongtian, Dongtian, Lingxian, and Lingbao Temples in Luoyang, along with two hundred temples across various commanderies. Toward the end of the Wei dynasty, in Lin Tao Commandery of Longyou, a divine being over three *zhang* tall, clad in white robes, with flowing silver hair and a golden crown, appeared in Xiangwu County. He addressed the county resident Wang Shi, saying, “Soon, you shall witness the advent of great peace.” When Emperor Wu received the Mandate of Heaven and unified the realm, the prophecy was fulfilled. The emperor then ordered the construction of the Gaoping Temple at the site of the apparition, which was the former residence of the Li clan. He ordained seven Daoist priests, bringing the total number of ordained priests to four hundred and seventy-two.\n\nAt the time, the bank of Linping Lake in Wu Commandery collapsed, revealing a stone drum. It was sent to the emperor, who asked the Minister of Works, Zhang Hua, its purpose. Zhang replied, “Carve a whale from paulownia wood and strike it—it will resonate for miles.” During the reign of Emperor Hui, the drum suddenly sounded in the palace at night without cease. Disturbed, the emperor sent it to the Wansui Temple on Mount Song, where it was struck to assemble the masses—a practice that began from this time.\n\nEmperor Daowu of Northern Wei built fifty temples in Yunzhong, Taiyuan, and the regions north of the Yellow River, ordaining over six hundred Daoist priests. Emperor Taiwu decreed the construction of two hundred and seventy-five Taiping Temples across the realm, ordaining eleven thousand three hundred Daoist priests. He received the talismans and changed the era name to Taiping Zhenjun, further commanding that all memorials from within and without the empire address him as “August Emperor Taiping Zhenjun.” Subsequent emperors all received the registers of ordination.\n\nEmperor Wu of Northern Zhou built the Tongxuan Abbey in Chang’an to welcome Daoist adepts.\n\nEmperor Wen of Sui, having relocated the capital to Longshou Plain and named it Daxing City, built thirty-six temples within the capital and its environs, naming them Xuantan, and ordained two thousand Daoist priests.\n\nEmperor Yang of Sui moved the capital to Luoyang and built twenty-four temples within the city and its environs, ordaining one thousand one hundred Daoist priests.\n\nThe August Founder of the Imperial Dynasty, the Divine Yao, the Great Sage, the Great Illustrious Filial Emperor, in the thirteenth year of the Daye era of the Sui, was moved by the spirit of Mount Huo, who declared by the command of the Most High Lord Lao: \"You, Tang Gong, shall surely come to possess the realm.\" In the first year of the Wude era, on Sheep’s Horn Mountain in Fushan County of Jinzhou, a figure clad in white robes, wearing a golden crown, and riding a white horse with a red mane appeared. This was Ji Shanxing, who conveyed the message of the Most High to the Divine Yao: \"Now that you have attained sagely governance, you must establish an Anhua Abbey in the eastern part of Chang’an to enshrine the Daoist images. Thus shall the altars of state endure, and the realm be greatly pacified.\" Shanxing asked, \"By what token shall I appear before the Son of Heaven?\" The Most High replied, \"Go forth, and one who presents a stone tortoise shall serve as your sign.\" Shanxing then informed He Junxiaoyi, the prefect of Jinzhou, who brought him before the Prince of Qin. There, he recounted the divine manifestation in full. The assembled officials bowed in celebration, and the Prince of Qin dispatched Du Ang, commander of the Left Imperial Guards, along with Shanxing to the site of the apparition to perform sacrifices. The Most High appeared again, just as Shanxing had described. Pointing his whip at Ang, he asked, \"Who are you?\" Ang replied, \"I am the Prince of Qin’s emissary.\" The Most High said, \"I neither drink nor eat—why offer sacrifices? All matters shall be made known to men.\" Ang returned and reported the divine manifestation. The Prince of Qin rejoiced greatly and ordered Ang to escort Shanxing to the capital to memorialize the throne. Upon their arrival in the capital, before the matter was settled, Zhang Da, the administrator of Qizhou, presented a stone tortoise inscribed with the words: \"The realm at peace, descendants flourishing, for ten thousand years, for ten thousand generations.\" The memorial was presented in audience, and the High Ancestor rejoiced greatly. He issued an edict appointing Shanxing as Gentleman for Court Discussion and bestowed upon him one hundred bolts of silk. He then commanded the Gentleman for Communications, Liu Xian, to establish a temple on Sheep’s Horn Mountain, renamed Fushan County as Shenshan County, and Sheep’s Horn Mountain as Dragon’s Horn Mountain. The Most High appeared once more to Shanxing, asking, \"Is the Son of Heaven pleased?\" Shanxing replied, \"Greatly pleased.\"\n\nThe Most High asked again, \"What doubts linger in your mind?\" Shanxing replied, \"Only that I do not know the sage’s name.\" The Most High said, \"I am the Supreme Divine Immortal, surnamed Li, styled Lord Lao—it is I. I am the ancestor of the Emperor. The *Records of the Grand Historian* contains my biography, and at the original temple in Guyang County of Bozhou, a withered juniper revived as proof. I have already commanded the Duke of Zhou, Dan, to lead divine troops in aid of the state to strike down Liu Heichang. By the fourth-month festival, he shall be crushed.\"\n\nFilial Piety again ordered Shanxing to present this in audience. The High Ancestor then urgently dispatched Shanxing by post-horse to the Luoyang military headquarters to proclaim and announce the divine decree. When the time came, Liu Heichang was indeed pacified, the Four Seas were wholly settled, and the withered juniper flourished anew. The temple was then renamed the Qingtang Abbey. To this day, within the abbey stand the stele inscribed by Emperor Minghuang and the true visages of successive sages.\n\nIn the third year of Wude, an edict appointed Wang Yuanzhi, a Daoist of Jinyang, as Gentleman for Court Discussion and bestowed upon him a gold-threaded coronet and a purple silk cloud-patterned robe, in recognition of his prophecy of the High Ancestor’s mandate. Taizong later promoted Yuanzhi to Grand Master for Splendid Happiness with Silver and Blue, again in acknowledgment of his prophetic words. The granting of purple robes to Daoist priests began from this time.\n\nIn the second year of Longshuo under Gaozong, an imperial decree ordered Xu Lishi, the Duke of Qiao and Chief Administrator of Luozhou, to build the Upper Clarity Palace on Yushan to suppress the grotto of demonic immortals. Excavations uncovered an ancient stone tablet, the former foundation of the immortal Bo Zhongli. Upon completion of the work, the Emperor commanded a grand jiao offering, and the Most High appeared once more. The hundred officials presented memorials of congratulation, and the Emperor rejoiced greatly.\n\nIn the early years of Qianfeng, after the Emperor completed the feng sacrifice, he returned to Bozhou on his imperial progress and personally paid homage to the Most High. He reverently bestowed the august title of *Hunyuan Emperor* upon the Most High and *Primordial Celestial Empress* upon the Sacred Mother. He also renamed Guyang County as Zhenyuan County. Furthermore, he had the *Eastern Brightness Abbey* constructed in the capital for Taizong and Empress Wende. He decreed that Daoist priests should be registered under the Court of the Imperial Clan, their rank placed immediately after that of the imperial princes.\n\nIn the first year of Wenming, Empress Wu sought to ennoble the Wu clan. The Most High then manifested at Huangtianyuan in Fangxing Village, Longtai Township, Quexiang County of Haozhou. He dispatched Hao Xuanchong to convey this message to the Empress: \"The imperial house shall enjoy eternal prosperity and great peace; it is not fitting to overstep one’s bounds.\" The Empress thereupon desisted and converted the Quexiang temporary palace into the *Abbey of Venerating the Immortals*. Later, Qing Mountain emerged in the territory of Xinfeng County, rising three hundred feet high. Above it, five-colored clouds of qi gathered, while below lay a divine pool spanning several hundred acres, wherein white cranes, simurghs, and phoenixes dwelled. On all sides appeared qilin and lions. The Empress ordered the establishment of Qingshan County. All these auspicious omens were recorded in the *Veritable Records of Empress Wu*, signifying the resurgence of the earthly virtue of the imperial house.\n\nShe also converted the *Abbey of Heaven-Veneration* on Central Peak into the *Abbey of Mount Song’s Radiance* to offer prayers for the late Emperor Gaozong. Eventually, she abdicated the throne in favor of Emperor Zhongzong, the *Reverent and Harmonious Emperor*.\n\nIn the first year of Jinglong, an edict commanded that every prefecture and commandery in the empire establish a *Jinglong Abbey*. In the second year, it was renamed the *Abbey of Revival*. In the third year, it was again renamed the *Abbey of Dragon Ascendancy*. The ordination of Daoist priests followed the precedents of former dynasties.\n\nEmperor Ruizong converted his residence in the Eastern Capital into the *Abbey of Auspicious Clouds* and his residence in Taiyuan into the *Abbey of Tang’s Ascendancy* to offer prayers for the late Celestial Emperor and Celestial Empress.\n\nDuring the Kaiyuan era of Emperor Ming, an edict ordered that every circuit establish a *Kaiyuan Abbey*. He also composed the *Eulogy of the Hunyuan*, which he personally inscribed on stone. Furthermore, he decreed the establishment of *True Lord Temples* on the Five Peaks. He also ordered the construction of the *Supreme Clarity Palace* in the Upper Capital and the *Supreme Subtlety Palace* in the Eastern Capital. The former residence of the Divine Martial Emperor in Taiyuan was converted into the *Purple Tenuity Palace*, and the former residence of the Hidden Dragon in Qizhou was made the *Abbey of Initiating Sagacity*. All were furnished with imperial robes, crimson gauze, curtains, and crossed-dragon halberds, following the regulations of the imperial palaces.\n\nThe Emperor also annotated the *Daoist Classic of the Dao and Its Power* and composed a preface and introduction. He decreed that all scholars and commoners throughout the empire keep a copy in their homes. The Daoist communities of the Two Streets then paraded with banners, parasols, and musical performances, escorting the text from the palace to the *Supreme Clarity Palace*. The profusion of incense and flowers was unmatched in recent memory. He further decreed the establishment of the *Daoist Examination*, modeled after the system of the Ministry of Rites. The Emperor personally presided over the examination, and many candidates passed with distinction.\n\nLater, the Prefecture of Puzhou reported that during renovations of the Purple Ultimate Palace, workers unearthed a jade stone shaped like a crescent moon. It bore the likeness of an immortal grinding medicine with a pestle, and when struck, emitted a sound both clear and distant. The Emperor ordered it hung in the courtyard of the Primordial Lord Temple in Taiyuan, naming it the *Recumbent Moon Chime*. The East Capital’s military governor, Zhang Qi, reported that during repairs to the Ancient Immortal Abode in Ruzhou’s Lushan County, a jade chime was discovered, its sound carrying for miles. The Emperor commanded it be hung in the courtyard of the Sacred Ancestor Temple at the Supreme Clarity Palace. In Quzhou, while constructing an abbey, workers digging the earth uncovered a fish’s head, three feet long, resembling iron yet faintly shimmering with purple and azure hues, as if embedded in blue-green stone with a lustrous sheen—its carving seemingly beyond human craft. When struck, it resounded deeply. No one could name the fish. The object was presented to court, where the Emperor displayed it to his officials, yet none could identify it. The Emperor thus called it the *Auspicious Fish* and ordered it hung in the Grand Ultimate Palace, decreeing it be struck only during scripture lectures or vegetarian feasts. Thereafter, Daoist abbeys competed to replicate it in wood or stone to summon assemblies.\n\nThe Emperor further instructed that all abbeys be overseen by chief ministers and regional military governors as a permanent regulation. He also composed the *Rainbow Skirt and Feathered Robe Melody* and the *Purple Ultimate Eight Trigrams Dance*, offering them at the Supreme Clarity Palace with greater reverence than at the Nine Temples. During his eastern imperial progress, he obtained three-ribbed thatch from the Jianghuai region and ordered the construction of the *Divine Thatch Abbey* at the site of its discovery. After completing the rites, he returned to pay homage to the Sacred Ancestor at the original abbey in Bozhou, personally inscribing the *Classic of the Dao and Its Power* on stone. He erected a grand banner and an octagonal tower, covering them before the Void Origin Hall. He also visited the Kaiyuan Abbey in Huaizhou and the Offering Immortal Abbey in Quexiang at the request of nobles and commoners, personally inscribing scriptures on towering stone steles, mirroring the design at the Supreme Clarity Palace.\n\nHe then decreed the appointment of Hao Xuanchong as prefect of Haozhou. In the summer of the seventeenth year of the Kaiyuan era, on the fifth day of the fourth month, Zhang Jingzhong, Chief Administrator of the Yi Prefecture Grand Protectorate, reported that the Great Sacred Ancestor, the Primordial August Emperor, had manifested in the Xinxin Convent of Xinjin County, Shu Prefecture, where the wooden grain of a pillar in the Buddha Hall naturally formed the image of the Most High Lord Lao. Atop the image was a floral canopy, and beneath it, thirteen instances of cloud leaves and celestial blossoms appeared before and behind his feet. The report was verified by Vice-Administrator Wang Dazhong, Prefect Li Zhongxun, Deputy Governor Lu Fang, County Magistrate Li Shao, and 130 Daoists, monks, and nuns before being submitted. On the twenty-fourth day of the fifth month, the Emperor dispatched the eunuch Lin Zhaoyin to convey the pillar to the capital, where it was enshrined in the Great Harmony Hall. He further ordered all abbeys of the Two Streets to hold seven days of offerings before returning the pillar to the imperial palace, where it remains to this day.\n\nThe auspicious omens were too numerous to record in full. On the seventh day of the first month in the twenty-ninth year, Field Marshal Tian Tongxiu of the Prince of Chen’s residence suddenly beheld purple clouds rising from the northwest watchtower outside Vermilion Phoenix Gate. He then saw the Primordial One riding a white horse, attended by two youths. The youths addressed Tongxiu, saying: “When Master Yin Xi and I entered the Flowing Sands long ago, we concealed a casket of sacred talismans in the old residence of Yin Xi at Peach Grove’s former Pass. You must petition the Emperor to retrieve them.” Tongxiu reported the matter in full.\n\nThe Emperor dispatched the eunuch Li Zhizhong to supervise Tongxiu’s journey to the ruins of the former Hangu Pass, twelve *li* south of Taolin County in Shanzhou. Suddenly, purple clouds and a white hare appeared beneath a withered mulberry tree. They dug there until they reached the water’s edge, where they uncovered a stone casket containing a golden coffer and jade tablets inscribed in vermilion seal script. The Emperor, upon receiving the report, rejoiced greatly. He ordered the capital’s ten musical ensembles to perform, with singing, dancing, and wind instruments, as the talismanic script was carried in a treasure palanquin through Tonghua Gate. Five-colored light radiated from it, illuminating heaven and earth. The Emperor, clad in dragon robes and holding a golden censer, stood atop Vermilion Phoenix Tower, while the ladies of the six palaces competed to burn incense and scatter flowers, bowing from afar. He further commanded that gold coins be scattered below the tower for the common people to gather in celebration. In an instant, the cheers of the multitude shook the capital.\n\nThe Emperor ordered the sacred talisman enshrined in Lingchang Hall. That night, divine lamps appeared upon the towers, pavilions, and trees. On the first day of the first month, the thirty-first year of Kaiyuan was renamed the first year of Tianbao, and Taolin County was renamed Lingbao County. Three years later, the Emperor noticed the characters “Tianbao, a thousand years” on the talisman. As “Tianbao” had already been adopted as the reign title, he changed the year-count to *zai* (载). At the site of the discovery, he established Changle Pavilion as Tianbao Abbey, personally composing and inscribing the *Stele of the Sacred Talisman* at the place of its retrieval. He also erected Lingfu Hall within the palace and appointed Tongxiu to a fifth-rank regular post. The chief ministers requested the addition of the honorific title “Divine Martialty of Kaiyuan and Tianbao,” which the Emperor approved. A general amnesty was declared throughout the realm.\n\nIn the intercalary fourth month of that year, the Emperor dreamed that the Primordial One said to him: “I have long resided in the southwest of the city. I shall meet you at Xingqing Palace—make haste to welcome me.” The Emperor told his chief ministers Li Linfu and Niu Xianke: “In my thirty years of ruling the realm, I have never failed to rise before dawn, don my court robes, and pay reverence to the true image, praying for the welfare of all beings. Recently, in a brief slumber, I saw the Primordial One, who spoke of this matter.” He then dispatched eunuchs and the Daoist master of ceremonies Xiao Xuanyu to search the southwest of the city for several days. Suddenly, in a valley of Louguan Mountain, they beheld purple clouds and a white radiance connecting heaven and earth. They dug at the site and indeed recovered a jade statue of Lord Lao, over three *chi* in height, which they presented to the Emperor.\n\nThat day, the Emperor personally welcomed the statue at Datong Hall in Xingqing Palace, fulfilling the prophecy of the dream. He enshrined it in the inner palace for veneration and ordered its likeness copied and distributed to all abbeys throughout the realm. A general amnesty was again declared. In the fifth year, the Emperor dreamed that the Primordial One said: “I possess a numinous talisman, which shall soon appear of its own accord.” Soon after, a sacred talisman and jade register were recovered from Mount Taibai. Upon its arrival in the capital, it was enshrined in Lingfu Hall, where the Emperor personally venerated it. He enfeoffed the mountain spirit of Mount Taibai as Duke of Numinous Response, renamed the cave of its discovery Auspicious Grotto, and established Zhenfu County at the mountain’s foot. He further ordered the establishment of Zhenfu Abbeys in all circuits and had the events recorded in the official histories.\n\nIn the twelfth month of that year, the Emperor visited Huaqing Palace. On the fourth day of the month, before sunrise, he suddenly saw strange clouds gathering atop Mount Li. In an instant, the clouds dispersed, revealing the Primordial Sage Ancestor upon Chaoyuan Pavilion. The Emperor and his attendants gazed upon him for a long while before he vanished. By edict, Huichang County was renamed Zhaoying County, and Xinfeng County was incorporated into Zhaoying. Mount Huichang was renamed Mount Zhaoying, its spirit enfeoffed as Duke of Mysterious Virtue, and Chaoyuan Pavilion renamed Descending Sage Pavilion. An illustrated account was issued throughout the realm and entrusted to the official historians.\n\nIn the eighth year, the Emperor recovered twenty-seven jade statues of immortals in Luochuan County, Ningzhou. He ordered their conveyance to the capital, following the same ceremonial protocols as the initial welcoming of the Lingbao talisman. The Emperor personally composed a eulogy, and Luochuan County was renamed Zhenning County. At the site of the discovery, Tongsheng Abbey was established. The Emperor composed an inscription for the stele, which still stands today.\n\nIn the sixth month of that year, a single stalk of jade fungus emerged in the Great Hall of Unity. The Emperor then established the Gold Immortal Abbey and Jade Fungus Abbey, and two princesses were ordained as Daoist priestesses. Furthermore, Li Hun, a recluse of Mount Taibai, reported an apparition of the Primordial One, who revealed that within the Golden Star Grotto lay a jade tablet inscribed with auspicious signs of the Sagely Emperor’s fortune and longevity. The Emperor dispatched Palace Censor Wang Pi to investigate. After traversing over four hundred li through valleys, he obtained the tablet. The extraordinary omen was proclaimed throughout the realm, and the site was consecrated as the Abbey of Numinous Signs.\n\nOn the bingyin day of the intercalary sixth month, the Emperor visited the Supreme Clarity Palace, bestowed honorific titles upon the Five Sacred Ones, and had statues of Confucius’s four disciples installed to stand in attendance before the Primordial One. He also decreed that grand prefectures in the ten circuits establish Jade Fungus Abbeys and issued a general amnesty for the empire.\n\nIn the ninth year, Wang Xuan-yi, another recluse of Mount Taibai, reported that the Primordial August Emperor had manifested, declaring that within the Grotto of Treasure Immortals lay a wondrous treasure—a true talisman—commanding the Emperor to retrieve it. The Emperor dispatched Minister of Justice Zhang Jun and Minister of Works Wang Chui to fetch it, and they succeeded. The site was then consecrated as the Abbey of True Numinosity.\n\nIn the first month of the thirteenth year, the Emperor again visited the Supreme Clarity Palace, where he elevated the honorific title of the Primordial One to *Great Sagely Ancestor, Most High and Supreme Dao, Golden Portal, Primordial Heavenly August Emperor*. Each of the Five Sacred Ones received additional honorifics, while the Emperor’s own title was expanded to *Kaiyuan Heaven-and-Earth Great Treasure Sagely Cultured Divine Martial Verifying-the-Dao Filial Virtue Emperor*. A general amnesty was declared for the realm.\n\nIn the fifteenth year, while the Emperor was in Shu, the Primordial One appeared beside the Blackwater River in Sanquan County, Hanzhong Prefecture. The Emperor personally paid homage, and a stone likeness of the true visage was carved at the site of the apparition. Later, in Yichang County, Lizhou, the Emperor witnessed the Primordial One riding a white beast across a mountain ridge—an omen of the suppression of An Lushan. The mountain was enfeoffed as White Beast Ridge, and the site of the manifestation was consecrated as the Abbey of Spontaneous Generation. Additionally, the Abbey of Flourishing Tang was established on Mount Song, and the Abbey of Blessed Tang in Chengdu.\n\nOn the eighteenth day of the third month in the second year of the Zhide era of Emperor Suzong, the Primordial One manifested upon Cloud Dragon Crag in Tonghua Prefecture. Earlier, the local populace had held a grand fast to pray for the state’s welfare. On the eighteenth day, a fragrant mist arose, lingering without dissipation. By the hour of *chen*, it gradually cleared, revealing a divine radiance illuminating the sky. The true image of the Primordial One stood before the mountain, stretching from earth to heaven, clad in white robes, the left hand hanging down and the right holding a five-rayed fan. The august countenance shone resplendently, and all present gazed in reverence. Though the mountain was lofty, it barely reached the figure’s elbow. After a long while, the vision vanished.\n\nThereupon, a memorial was duly submitted to the throne, and an illustrated scroll was presented from the inner palace. The Supreme August Emperor composed a eulogy with a preface, the text of which, being lengthy, is not recorded here. The account was compiled into the historical annals and disseminated throughout the realm.\n\nIn the second year of the Qianyuan era, the Emperor dreamed one night that two azure youths led him to a palace, where he was granted an audience with the Primordial One. The Primordial One wore robes of cloud and mist and a crown adorned with nine phoenixes. Seated upon a square mat, beneath a jeweled canopy, he leaned upon a jade table, holding a white whisk. Arrayed about him were attendants, perfected beings, jade maidens, divine immortals, and youths, along with warriors from the five celestial realms—an assembly of boundless multitude. The Emperor, clad in crimson robes and bearing the jade tablet of office, stood in attendance behind the Primordial One. Together they traversed mountains and seas, journeying vast distances, each step vividly etched in the Emperor’s memory. He also beheld the Primordial One’s beard and hair, both black as ink.\n\nAt dawn, the Emperor summoned officials from both thoroughfares and inquired after auspicious images at the Hall of the Sacred Ancestor in the Guangtian Abbey of Wuben Ward. There, they indeed discovered an image of the Elder Lord with a black beard. A likeness was painted and presented to the Emperor, who, upon seeing it, rejoiced greatly, for it matched precisely what he had witnessed in his dream. He then had his own true portrait brought forth and ordered it placed in attendance behind the Primordial One. This was proclaimed throughout the empire, with instructions for universal veneration.\n\nEarly in his reign, Emperor Daizong obtained eight treasures in Anyi County of Chuzhou, whereupon the county was renamed Baoying. A Baoying Abbey was erected at the site of the discovery, and the era name was changed to the first year of Baoying, with a general amnesty declared across the land.\n\nIn the tenth year of the Zhenyuan era of Emperor Dezong, the Primordial One secretly dispatched the Queen Mother of the West to descend repeatedly upon Jinquan Mountain in Guozhou. There, she transmitted the arts of refining black *qi* to the female perfected one Xie Ziran. After completing her cultivation, on the sixteenth day of the tenth month of that year, she ascended to heaven in broad daylight. Three months later, she returned and said to Prefect Li Jian: “In the heavens stands the loftiest Jade Hall, where the Elder Lord resides. The walls are inscribed with the names of divine immortals, with annotations beneath recording their earthly incarnations—some as emperors, others as chief ministers. When immortals pay homage to the Elder Lord, all bow four times.” Having spoken, Xie Ziran once more ascended to heaven.\n\nIn the second year of the Baoli era of Emperor Jingzong, on the first month’s *?* day, the Emperor performed rites at the southern suburban altar and presented offerings at the Grand Clarity Palace.\n\nAs the imperial carriage approached, Zheng Weng, the chief clerk of Chang’an County, suddenly saw the Elder Lord clad in white robes, his appearance extraordinary. He addressed Wan, saying: “There is a well along this path—seal it swiftly, or calamity shall befall beyond measure.” Wan, alarmed, turned to see the ground already subtly subsiding and thus joined forces to fill it. Thereupon, the Elder Lord vanished from sight. When the imperial carriage arrived, the matter was reported in full, and the hundred officials offered their congratulations. An edict was issued to the Vice Minister of War, Wei Chuhou, to compose an inscription, while the Recorder of Imperial Deeds, Liu Gongquan, was tasked with calligraphy. The stele was erected beside the sealed well and subsequently recorded by the court historians.\n\nOn the eighteenth day of the twelfth month of that year, as Liu Gongquan inscribed the stele, a sudden gust of fierce wind arose, swirling without cease. Then appeared the Primordial One, robed in purple, crowned in gold, and shod in golden slippers, standing upon a white lotus. In his right hand he held a Fivefold Radiance Fan, while his left hung down, the air around him luminous as golden light. Gongquan and the stonecutters gazed upon him for a long while, then traced his form upon the ground. As the drawing neared completion, the Primordial One suddenly pointed his fan toward the sky, scattering streams of light in all directions before soaring aloft. The crowd turned to watch, their bodies angled upward as he receded, growing ever smaller until he vanished into the clouds. The event was then reported to the throne.\n\nA decree was issued to incorporate these events into the stele’s inscription. Furthermore, the court ordered the construction of the Yan-Tang Abbey in both capitals.\n\nIn the fifth month of the second year of Kaicheng during Emperor Wenzong’s reign, the Drafter of the Imperial Chancellery, Gao Yuanyu, was serving as Prefect of Bazhou. Eight or nine *li* north of the prefectural seat, before a small hill along the Jialing River, he suddenly noticed an unusual radiance upon the cliff face. Drawing nearer, he saw that the stone bore a natural inscription forming the true image of the Venerable Lord: his brows and hair, robes and sash, headscarf and slippers—all were perfectly complete. Beside him stood one figure, clad in flowing robes with wide sleeves, holding an incense burner to offer fragrance. Behind was another, a youth with twin topknots bound high, reverent as though awaiting command. None of these could have been achieved by human craft, whether through painting, casting, or carving. Whenever Yuanyu made prayers, purple-black vapors would rise above the image. A sacred spring also welled forth spontaneously, and when the gentry and common folk sought blessings, none failed to receive immediate efficacy. Thus, the stone was carved, and a hall erected to mark this auspicious sign. Yuanyu then had the image painted and submitted to the throne, petitioning that it be recorded in the histories. The imperial assent was granted.\n\nIn the first year of Huichang during Emperor Wuzong’s reign, on the fifteenth day of the second month—the birthday of the Great Sage Ancestor—it was decreed that the day be established as the *Jiang-Sheng* Festival. The court further commanded that in both capitals and all prefectures and commanderies throughout the realm, vegetarian feasts be held, the Dao be practiced, and music performed. Three days of grand intoxication were granted, with no exception even for urgent military campaigns. This was to be observed as a permanent institution.\n\nIn the ninth month of the tenth year of Xiantong during Emperor Yizong’s reign, on the tenth day, the rebel Pang Xun of Xuzhou led over three thousand followers to the Taiqing Abbey in Bozhou. That day, more than three hundred commoners north of the abbey witnessed the Venerable Lord ascend into the sky from within the abbey, heading south. In an instant, black mist blanketed the southern plains. The rebel horde lost their way and turned upon one another in slaughter, while Pang Xun drowned in the waters. The band of villains was thus utterly annihilated. Li Wei, the Pacification Commissioner of Bianzhou and Supervisor of the Taiqing Abbey, reported the matter to the throne.\n\nThe imperial edict proclaimed: Our imperial house traces its lineage to the Primordial One, upholding the teachings of purity and tranquility. In the ancient village of Ku County lies the sacred homeland of the Sage Lord, where palaces stand in solemn grandeur and temple halls are duly established. Yet recently, remnant rebels charged forth and set fires, seeking to burn and destroy. Suddenly, dark mist enveloped the clear skies, and the frenzied bandits lost their way upon the roads, scattering across the plains only to meet annihilation. In reverence of this mysterious power, we offer our deepest gratitude. An inner decree issued a *qingci* prayer, and Li Wei was entrusted with the solemn duty of reporting and giving thanks. The matter was made known throughout the realm and recorded by the court historians.\n\nIn the third month of the thirteenth year, Prefect Yao Que of Taizhou memorialized that while renovating the Hall of the Venerable Lord on Mount Tiantai, a stone casket containing inscribed tablets was unearthed at the site. He requested that these be submitted to the Historiography Institute and proclaimed across the land. The imperial decree approved this.\n\nIn the third month of the second year of Guangming, Military Commissioner Wang Chongrong of Hezhong reported that, according to a memorial from Jinzhou, at the Qingtang Abbey on Dragon Horn Mountain, beside the Hall of the Venerable Lord, a withered vine on the twin trees had miraculously revived. Previously, during the Wude era, after the Primordial One’s manifestation, a hall was erected between the two trees. Over a year later, a vine spontaneously grew upon them, stretching over ten *zhang* in length, its luxuriance surpassing the ordinary. Later, when Prince Qi usurped the heirship, the vine withered and died. Yet within days, fresh green shoots regrew from its tips, and soon after, Prince Qi met his downfall. During Emperor Zhongzong’s restoration, the An Lushan rebellion, and Zhu Ci’s treason, the vine withered each time, only to revive again. In the first year of Guangming, when Huang Chao threatened the capital, the vine withered that autumn. By the following spring, its branches and leaves flourished anew. Moreover, a new vine sprouted from a neighboring tree, growing over fifty *chi* in ten days, its paired vines thriving in extraordinary splendor. The memorial was met with imperial praise, and the event was recorded by the court historians. Thereafter, all such auspicious omens were duly reported by decree—a testament to the boundless virtue of the vine, celebrating the wisdom of ancestral counsel, and foretelling the enduring prosperity of the imperial line, as the Dao’s flow continues unbroken through generations without end.\n\nEmperor Xizong, having taken refuge in western Shu, received the report on the ninth day of the eighth month of the second year of Zhonghe. He ordered it proclaimed throughout the court and realm. On the eleventh day of the third month of the third year, Prefect Pan Zhou of Bozhou dispatched the Daoists Ma Hanzhang and Sun Qiwu to memorialize that since the fourth year of Qianning, the Taiqing Abbey in Zhenyuan had repeatedly suffered incursions by rebel forces, numbering from over a thousand to as many as ten thousand. All sought to plunder the abbey, some attacking cities, others raiding county towns. Yet each time, the Venerable Lord secretly manifested his divine power: dense clouds would suddenly arise, or yin winds would drive them back, or hail and thunder would strike, causing the rebels to stumble and scatter, soon meeting their doom. As his numinous efficacy grew ever more manifest, his divine works remained unfathomable. A decree was issued elevating Zhenyuan County to the status of a capital district, and a *qingci* prayer was composed to honor and give thanks. The Emperor bowed in reverence.\n\nOn the twelfth day of the eighth month, it was proclaimed: The Taiqing Abbey in Bozhou is the sacred birthplace of the Primordial One’s descent, its name exalted as the ancestral home of the Dao. Its blessings have nurtured the imperial foundation, its nine-palace auspices welling from the heavens, and the immortal traces of the single deer lingering upon the trees. Auspicious signs through successive dynasties are worthy of record, and in recent years, divine responses have been especially evident. How fitting it is to adorn this hallowed sanctuary with splendor, rather than allow its sacred halls to fall into neglect. Prefect Pan Zhou has governed with benevolence, long steeped in upright principles. He has generously donated his salary to restore the abbey, ensuring that its walls, eaves, beams, and rafters are all meticulously renewed, while the painted images and decorations shine with even greater brilliance. Upon reviewing the plans and records, his merits are truly commendable. The abbey’s presiding Daoist, Wu Chongxuan, shall be granted the purple robe and titled Master of Serene Mystery. The Daoists Ma Hanzhang and Sun Qiwu shall also be granted the purple robe. Pan Zhou shall be promoted to Grand Master for Splendid Happiness with Silver and Gold, and concurrently serve as Minister of Works, retaining his other titles.\n\nOn the night of the twenty-ninth day of the eighth month of that year, Emperor Zhaozong, along with the imperial clansman Li Teli and the Daoist Li Yuan, conducted a *jiao* ritual at the Xianyang Fair’s Xuanzhong Abbey in Chengdu—the very site of the Primordial One’s descent—praying for the presence of the True One. Suddenly, a rainbow-hued light, no larger than a pellet, appeared, gradually brightening and expanding. It emerged from the bamboo grove southeast of the hall’s foundation, leapt and bounded toward the plum tree in the southwest, then vanished into the earth, sinking three *chi* deep. There, a treasure casket was unearthed, measuring one *chi*, one *cun*, and five *fen* in length, seven *cun* and four *fen* in width. One side was one *cun* and three *fen* thick, adorned with floral patterns; the other side was one *cun* and eight *fen* thick, weighing twelve *jin*. Six ancient seal-script characters, each two *cun* square and three *fen* deep, were inscribed upon it, their carving so lustrous it seemed beyond human craft. The inscription read: *The Supreme One pacifies the calamities of the Middle Harmony.*\n\nOn the first day of the ninth month, Military Commissioner Chen Jingxuan of Xichuan, the Grand Preceptor, memorialized: Your Imperial Majesty, in emulating antiquity and aligning with Heaven, has received the mandate and governed the realm, cherishing the supreme Dao and yearning for great harmony. Thus, you have toured the provinces to reflect upon your faults, extending benevolence to the land below, while your perfect virtue ascends to the celestial realms. Prophecies and omens have duly arrived, and auspicious signs have emerged in succession. The Supreme One has bestowed the mandate to uphold and sustain, purging the calamities of banditry and rebellion in this era of Middle Harmony. Now, through these ancient seal-script characters, the divine decree is made manifest, foretelling the swift eradication of evil vapors, the boundless longevity of the sacred reign, and the imminent arrival of the day of recovery and peace.\n\nOn the twelfth day, the Emperor ordered the proclamation to be shown to all officials. The Minister of the Secretariat and concurrent Grand Councilor Wei Zhaodu, the Minister of Revenue and concurrent Grand Councilor Xiao Gou, the Minister of the Chancellery and concurrent Grand Councilor Zheng Tian, the Censor-in-Chief Zhang Du, and the Minister of the Imperial Clan, Prince Gui of Cao, presented a memorial of congratulation: We humbly note that when bandits howl and rebels gather, the imperial carriage tours the provinces; when natural disasters strike, they have occurred in every age. Your Majesty has issued a decree of self-reproach like that of Cheng Tang, and dispatched the punitive forces of a true king. The wicked rebels shall soon be annihilated, and the signs of peace and prosperity are already evident. Now, the hidden aid of the divine is revealed through these secret characters.\n\nThe vermilion sparrow bearing the scripture—how could this be equated with the Supreme Lord’s manifestations? The black *qi* bearing the hexagrams—how could such blessings be compared to mere disaster’s end? Moreover, on the very day when the imperial clan performed their rites of purification and offering, auspicious radiance leapt and danced as a wondrous sign. Such responsive revelation may well be called most clear and certain.\n\nThe Bureau of Military Affairs Commissioner Li Shunrong and the Commander-in-Chief of the Twelve Armies and Twelve Guards Tian Lingzi presented a memorial of congratulation: Now, once again, the imperial kinsmen have come to the immortal’s abode. No sooner had their utmost sincerity arisen than propitious omens appeared. The crimson glow now manifest upon the earth is none other than the purple *qi* that once passed beyond the pass. Upon excavating the accumulated soil, ancient script was indeed uncovered. The untrammeled force of dragons and serpents was confirmed, and the pacification of the rebel realm was thereby known. In the profound and abstruse principles of governance, this is most luminously revealed.\n\nSince the Supreme Lord now bestows blessings equal to the end of calamity, we know that harmony shall endure forever. The manifestation of this imperial destiny arises entirely from the sacred ancestor’s discovery. Moreover, as the imperial scion now bears this numinous trace, the will of Heaven is made clear. The Primordial Supreme Ancestor, whenever great trials arose, always displayed extraordinary portents. These luminous proofs are fully recorded in the standard histories. Formerly, at the Vermilion Phoenix Gate, he revealed to Tian Tongxiu the time of restoration for the Tianbao era; now, at the Green Ram Market, he has shown Li Teli the joy of Your Majesty’s return to the palace. Truly, the realm is most fortunate. We humbly request that this be entrusted to the historiographers.\n\nThe Emperor approved all these memorials.\n\nOn the fifteenth day, Li Teli was appointed Collator of the Eastern Palace, and Li Yuan was granted the purple robe, each additionally bestowed with three hundred bolts of fine silk.\n\nOn the twenty-first day, another edict was issued: The Supreme Lord of the Dao, the Most High and Primordial Emperor, once discoursed on the true scriptures with his disciple, Master Wen Shi, upon the terrace of the Louguan Abbey, and they agreed to meet again at the Green Ram Market before ascending together upon cloud chariots into the Flowing Sands. This account is preserved in oral tradition and marked upon geographical maps. From the time of King Zhao of Zhou until this day, some two thousand years have passed, during which the numinous traces have remained silent and the foundations desolate. Now, through the imperial progress, the divine has become manifestly clear: extraordinary light leapt and danced before the courtyard, and sacred script was elucidated beneath the trees.\n\nRich with ancient hues, its characters bear auspicious omens. As the calamities of the Zhonghe era neared their end, propitious signs emerged from the depths of the earth. This fully revealed the favor bestowed by the Mysterious Heavens and the blessings conferred by the Sacred Ancestor, who would annihilate the weapons of great bandits and forever illuminate the enterprise of the Middle Revival. These events must be recorded in annals and proclaimed throughout the realm.\n\nThey were already entrusted to the court historians for compilation and transcription, with the text to be carved and disseminated to all circuits and military fronts. The abbey was to be renamed the Green Ram Palace, and halls and chambers were to be constructed. The adjacent lands belonging to the abbey, approximately two *qing* in area, had recently been scattered among the common folk, who planted onions and garlic there. Such a pure and empty site could not endure such profane vapors, so two hundred strings of cash were granted to redeem the land, with official deeds issued to ensure its perpetual归属 to the House of Tranquility.\n\nZongzi Teli had already been appointed to office, and the Daoist Li Yuan had been bestowed the purple robe. Their promotions and rewards were fitting tributes to the numinous blessings. Reverently occupying the highest ranks of the public sphere, their influence spread across commanderies and states. They served with devotion in an era of extended prosperity and cultivated their minds in the homeland of Dao and virtue. Thus, they caused the land to be purged of war and treasures to emerge from the earth—such excellence is doubly worthy of praise and acclaim.\n\nOn the seventh day of the tenth month, the high-ranking official Guo Xuntai was appointed to supervise the construction of the Green Ram Palace, with funds drawn from the imperial treasury. From the time the numinous omens first appeared until the *guichou* day of that month, bandits near the Shu commandery were successively captured and executed, and within ten days, the land was pacified. The imperial carriage visited the Green Ram Palace, and gifts were bestowed accordingly. Li Teli was granted a ceremonial cap and appointed Recorder of Longzhou. Another edict was issued:\n\n\"The Supreme Lord has conferred blessings, and the Green Ram has manifested in response. It is fitting to honor and adorn this site to reciprocate such extraordinary favor. The Purple Culmen Palaces in all circuits, prefectures, and commanderies shall be entrusted to local officials for proper renovation, and Daoists skilled in ritual shall be selected to perform offerings and sacrifices.\"\n\nOn the *yimao* day of that month, it was reported that the capital had been recovered, demonstrating that the Great Dao bestows favor, the Sacred Ancestor grants protection, the grand design endures forever, and the Tang’s mandate knows no bounds. The Hanlin Academician, Chief Minister, Minister of War, and Drafter of Edicts, Yue Penggui, was ordered to compose and erect a stele. It is humbly requested that this be proclaimed throughout the realm to manifest that the imperial house descends from the lineage of immortals and has been moved by the numinous efficacy of the Supreme Lord—truly an endless blessing for ten thousand generations.\n\nUpon review, since the founding of the dynasty, approximately 1,900 palaces and abbeys have been constructed, with over 15,000 Daoists ordained. The palaces and abbeys donated by imperial kinsmen, noble consorts, high officials, and commoners are not included in this count. Such is the grandeur of the imperial enterprise—from ancient times to our present dynasty, none can be fully recounted.\n\nOn the fifteenth day of the twelfth month of the fourth year of Zhonghe, this record was respectfully submitted by Du Guangting, Daoist of the Purple Robe, Grand Master for the Propagation of Teaching, and Drafter of Literary Works at the Supreme Clarity Palace in the Upper Capital.\n\n*Record of the Veneration of the Dao Through the Ages* — Concluded.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "历代崇道记 经名：历代崇道记。 一卷。 唐末五代杜光庭撰。 底本出处：《正统道藏》洞玄部记传类。 历代崇道记 穆王於昆仑山、王屋山、嵩山、华山、泰山、衡山、恒山、终南山、会稽山、青城山、天台山、罗浮山、崆峒山致王母观，前后度道士五千余人。 秦始皇帝并吞六国，招方士，好长生之术，遣使往蓬莱，采不死药，造官观一百余所，度道士一千七百余人。 汉文帝、窦太后并好黄老之术，造宫观七十二所，劲天下：如不通黄老经者，不得注官。 又亲访河上公，问道德之要，天下大治。 计度道士一千余人。 孝武帝奉道弥笃，感王母降於宫中，遗帝白银像五躯，日是太上老君之真形也。 帝别营三殿而供养之。 后移像於柏梁台上。 后又移於甘泉宫内，以一殿而并列之。 南向设座，自兹始也。 又度公主数人，及度道士约五千余人，并造观三百余所。 其嵩岳万岁观、泰山登封观、华山集仙观、终南望灵观、王屋通天观，并不得令庶姓居之，以为但式。 其万岁观因帝巡幸而闻山呼，遂舍行宫而为观焉。 至孝宣帝时，有上党郡功曹李惮，因入抱犊山采药，於石室内获天书四十余卷，并玉箱、玉杖，献於河东郡太守张纯。 纯立遣使上进，帝视之大惊，不觉流涕，乃令宣示内外臣僚。 时冉癸为主书中郎将，见之泣曰：此是武帝临崩时遗制，令葬於梓宫之内，何由至此？ 及披之卷后，所有臣僚校勘姓名，于今见有存者。 帝乃遣使检校茂陵，即又安完如故。 帝乃为武帝造观二所，一在长安城内，一在茂陵之下，以奉先帝也。 复度道士二十人，以奉香火也。 后赤眉之乱，茂陵为贼所发，於梓宫之中，但见有剑一口。 方欲取之，其剑忽然哮吼腾空而去。 世祖光武皇帝既平王莽，天下大定，东封礼毕，乃为本朝十一帝追荐。 及南阳、舂陵、名山大川、长安洛阳，计造观一百二十所，度道士一千八百人。 魏明帝为武帝及先太后造观於五都，计一十三所，度道士一百九人，仍韶道书同御史装饰。 昊主孙权於天台山造桐柏观，命葛玄居之。 於富春造崇福观，以奉亲也。 建业造兴国观，茅山造景阳观，都造观三十九所，度道士八百人。 晋武帝於洛阳造通天、洞天、灵仙、灵宝四观，及诸州共二百所。 先魏末，陇右临洮郡有神人长三丈，着白衣，垂素发，戴金冠，现於襄武县，告县人王始曰：不久当见太平。 及武帝受禅，果天下一统。 帝乃令於所现处造告平观，即李宗之故居也。 别度道士七人，并前后所度道士，共计四百七十二人。 时昊郡临平湖岸崩，获石鼓一枚，遣使上进，帝问司空张华：此物何用？ 曰：但以桐木刻作鲸鱼形，扣之必有声，闻於数里。 至惠帝时，於宫中忽夜呜不已，帝甚恶之，乃遣嵩山万岁观，击之集众，自兹始也。 后魏道武帝於云中、太原及河朔造观计五十所，度道士六百余人。 太武勃令天下造太平观共二百七十五所，度道十一千三百人。 帝受条，改太平真君元年，仍令四方内外上书，言太平真君皇帝陛下。 自后帝嗣位，并皆受录。 后周武帝於长安造通玄绾，以延羽客。 隋高祖文皇帝迁都於龙首原，号大兴城，乃於都下畿内造观三十六所，名日玄坛，度道士二千人。 炀帝迁都洛阳，复於城内及畿何造观二十四所，度道士一千一百人。",
      "translated_text": "**Records of the Veneration of the Dao Through the Ages**\n\n**Scripture Title:** *Records of the Veneration of the Dao Through the Ages*. One fascicle. Compiled by Du Guangting of the late Tang and Five Dynasties period. Base text from the *Daoist Canon of the Zhengtong Era*, Dongxuan Section, Records and Biographies Category.\n\n**Records of the Veneration of the Dao Through the Ages**\n\nKing Mu of Zhou venerated the Queen Mother of the West at Kunlun Mountain, Wangwu Mountain, Mount Song, Mount Hua, Mount Tai, Mount Heng, Mount Heng (in Shanxi), Zhongnan Mountain, Mount Kuaiji, Mount Qingcheng, Mount Tiantai, Mount Luofu, and Mount Kongtong, ordaining over five thousand Daoist priests in total.\n\nEmperor Shi Huang of Qin, having unified the Six Kingdoms, summoned masters of esoteric arts and favored the techniques of longevity. He dispatched envoys to Penglai to seek the elixir of immortality, constructed over one hundred palaces and temples, and ordained more than seventeen hundred Daoist priests.\n\nEmperor Wen of Han and Empress Dowager Dou both favored the teachings of the Yellow Emperor and Laozi. They built seventy-two palaces and temples, decreeing that those who did not master the scriptures of the Yellow Emperor and Laozi could not hold official positions. The emperor personally visited the River Earl to inquire into the essentials of the *Dao* and *virtue*, bringing great order to the realm. In total, over one thousand Daoist priests were ordained.\n\nEmperor Wu of Han venerated the Dao with even greater devotion. Moved by his sincerity, the Queen Mother descended into his palace and bestowed upon him five silver statues, declaring them to be the true forms of the Most High Lord Lao. The emperor had three separate halls constructed to enshrine them. Later, the statues were moved to the Bailiang Terrace, and subsequently to the Gansui Palace, where they were arranged in a single hall, facing south—a practice that began from this time. He also ordained several princesses and approximately five thousand Daoist priests, constructing over three hundred temples. Among these, the Wansui Temple on Mount Song, the Dengfeng Temple on Mount Tai, the Jixian Temple on Mount Hua, the Wangling Temple on Zhongnan Mountain, and the Tongtian Temple on Wangwu Mountain were forbidden to commoners, serving as models of reverence. The Wansui Temple originated when the emperor, during an imperial progress, heard the mountain’s acclamation and converted his temporary palace into a temple.\n\nDuring the reign of Emperor Xuan of Han, Li Tan, a clerk of Shangdang Commandery, entered Baodu Mountain to gather herbs. In a stone chamber, he discovered over forty volumes of celestial scriptures, along with a jade box and jade staff, which he presented to Zhang Chun, the governor of Hedong Commandery. Zhang promptly dispatched envoys to submit them to the emperor. Upon viewing them, the emperor was so astonished that he wept, ordering their display to all court officials. At the time, Ran Kui, the Chief Clerk of the Palace Secretariat, wept upon seeing them and said, “These are the posthumous instructions Emperor Wu left to be buried with him in his coffin. How have they come to this?” Upon examining the scrolls, the names of officials who had collated them were found, some of whom were still alive. The emperor then sent envoys to inspect Maoling, where all was found intact as before. He subsequently built two temples for Emperor Wu—one within Chang’an and another below Maoling—to honor his predecessor. He also ordained twenty Daoist priests to tend the incense and lamps.\n\nDuring the Red Eyebrows Rebellion, Maoling was raided by rebels. Within the emperor’s coffin, only a single sword was found. As they attempted to take it, the sword suddenly roared and soared into the sky.\n\nAfter Emperor Guangwu of the Later Han pacified Wang Mang and stabilized the realm, he performed the Feng and Shan sacrifices to the east. He then established temples to offer sacrifices for the eleven emperors of his dynasty, as well as at Nanyang, Chongling, famous mountains, great rivers, Chang’an, and Luoyang, constructing a total of one hundred and twenty temples and ordaining one thousand eight hundred Daoist priests.\n\nEmperor Ming of Wei built thirteen temples in the five capitals to honor Emperor Wu and his late empress dowager, ordaining one hundred and nine Daoist priests. He also decreed that Daoist scriptures be adorned in the same manner as imperial edicts.\n\nSun Quan, the ruler of Wu, built the Tongbai Temple on Mount Tiantai and appointed Ge Xuan to reside there. At Fuchun, he constructed the Chongfu Temple to honor his parents. In Jianye, he built the Xingguo Temple, and on Mount Mao, the Jingyang Temple. In total, he built thirty-nine temples and ordained eight hundred Daoist priests.\n\nEmperor Wu of Jin constructed the Tongtian, Dongtian, Lingxian, and Lingbao Temples in Luoyang, along with two hundred temples across various commanderies. Toward the end of the Wei dynasty, in Lin Tao Commandery of Longyou, a divine being over three *zhang* tall, clad in white robes, with flowing silver hair and a golden crown, appeared in Xiangwu County. He addressed the county resident Wang Shi, saying, “Soon, you shall witness the advent of great peace.” When Emperor Wu received the Mandate of Heaven and unified the realm, the prophecy was fulfilled. The emperor then ordered the construction of the Gaoping Temple at the site of the apparition, which was the former residence of the Li clan. He ordained seven Daoist priests, bringing the total number of ordained priests to four hundred and seventy-two.\n\nAt the time, the bank of Linping Lake in Wu Commandery collapsed, revealing a stone drum. It was sent to the emperor, who asked the Minister of Works, Zhang Hua, its purpose. Zhang replied, “Carve a whale from paulownia wood and strike it—it will resonate for miles.” During the reign of Emperor Hui, the drum suddenly sounded in the palace at night without cease. Disturbed, the emperor sent it to the Wansui Temple on Mount Song, where it was struck to assemble the masses—a practice that began from this time.\n\nEmperor Daowu of Northern Wei built fifty temples in Yunzhong, Taiyuan, and the regions north of the Yellow River, ordaining over six hundred Daoist priests. Emperor Taiwu decreed the construction of two hundred and seventy-five Taiping Temples across the realm, ordaining eleven thousand three hundred Daoist priests. He received the talismans and changed the era name to Taiping Zhenjun, further commanding that all memorials from within and without the empire address him as “August Emperor Taiping Zhenjun.” Subsequent emperors all received the registers of ordination.\n\nEmperor Wu of Northern Zhou built the Tongxuan Abbey in Chang’an to welcome Daoist adepts.\n\nEmperor Wen of Sui, having relocated the capital to Longshou Plain and named it Daxing City, built thirty-six temples within the capital and its environs, naming them Xuantan, and ordained two thousand Daoist priests.\n\nEmperor Yang of Sui moved the capital to Luoyang and built twenty-four temples within the city and its environs, ordaining one thousand one hundred Daoist priests.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1230,
      "start_sentence": 0,
      "end_sentence": 48,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.72176432609558,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\历代崇道记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "皇朝高祖神尧大圣大光孝皇帝於隋末大业十三年感霍山神，称奉太上老君命，告唐公：汝当来必得天下。 至武德元年，晋州浮山县羊角山着素衣，戴金冠，乘朱鬃白马，令吉善行告神尧：汝今得圣理，可於长安城束致一安化宫而安道像，则社稷延长，天下大定。 善行辞：见天子何以为据？ 太上曰：但去，有献石龟者，可以为信。 善行乃告晋州刺史贺君孝义，孝义遂将善行见秦王，具育神人现事。 群官拜庆，遂差左亲卫帅－杜昂与善行於所现处设祭，太上又现，一如善行所言。 以鞭指昂曰：汝是何人？ 昂曰：是秦王使者。 太上曰：我不饮不食，何用祭乎，所有委曲，令人具知。 昂还，乃言神人复现。 秦王大悦，乃令昂将善行入京上奏。 至京，立未定，果有邱州治中张达献石龟，上有文曰：天下安，子孙兴，千万岁，千万叶。 遂入面奏，高祖大悦，诏授善行为朝散大夫，赐物一百段。 乃令通事舍人柳宪於羊角山立庙，复改浮山县为神山县，羊角山为龙角山。 太上又现，为善行曰：天子喜欢否？ 对曰：大喜。",
      "translated_text": "The August Founder of the Imperial Dynasty, the Divine Yao, the Great Sage, the Great Illustrious Filial Emperor, in the thirteenth year of the Daye era of the Sui, was moved by the spirit of Mount Huo, who declared by the command of the Most High Lord Lao: \"You, Tang Gong, shall surely come to possess the realm.\" In the first year of the Wude era, on Sheep’s Horn Mountain in Fushan County of Jinzhou, a figure clad in white robes, wearing a golden crown, and riding a white horse with a red mane appeared. This was Ji Shanxing, who conveyed the message of the Most High to the Divine Yao: \"Now that you have attained sagely governance, you must establish an Anhua Abbey in the eastern part of Chang’an to enshrine the Daoist images. Thus shall the altars of state endure, and the realm be greatly pacified.\" Shanxing asked, \"By what token shall I appear before the Son of Heaven?\" The Most High replied, \"Go forth, and one who presents a stone tortoise shall serve as your sign.\" Shanxing then informed He Junxiaoyi, the prefect of Jinzhou, who brought him before the Prince of Qin. There, he recounted the divine manifestation in full. The assembled officials bowed in celebration, and the Prince of Qin dispatched Du Ang, commander of the Left Imperial Guards, along with Shanxing to the site of the apparition to perform sacrifices. The Most High appeared again, just as Shanxing had described. Pointing his whip at Ang, he asked, \"Who are you?\" Ang replied, \"I am the Prince of Qin’s emissary.\" The Most High said, \"I neither drink nor eat—why offer sacrifices? All matters shall be made known to men.\" Ang returned and reported the divine manifestation. The Prince of Qin rejoiced greatly and ordered Ang to escort Shanxing to the capital to memorialize the throne. Upon their arrival in the capital, before the matter was settled, Zhang Da, the administrator of Qizhou, presented a stone tortoise inscribed with the words: \"The realm at peace, descendants flourishing, for ten thousand years, for ten thousand generations.\" The memorial was presented in audience, and the High Ancestor rejoiced greatly. He issued an edict appointing Shanxing as Gentleman for Court Discussion and bestowed upon him one hundred bolts of silk. He then commanded the Gentleman for Communications, Liu Xian, to establish a temple on Sheep’s Horn Mountain, renamed Fushan County as Shenshan County, and Sheep’s Horn Mountain as Dragon’s Horn Mountain. The Most High appeared once more to Shanxing, asking, \"Is the Son of Heaven pleased?\" Shanxing replied, \"Greatly pleased.\"",
      "overlap_context": "registers of ordination.\n\nEmperor Wu of Northern Zhou built the Tongxuan Abbey in Chang’an to welcome Daoist adepts.\n\nEmperor Wen of Sui, having relocated the capital to Longshou Plain and named it Daxing City, built thirty-six temples within the capital and its environs, naming them Xuantan, and ordained two thousand Daoist priests.\n\nEmperor Yang of Sui moved the capital to Luoyang and built twenty-four temples within the city and its environs, ordaining one thousand one hundred Daoist priests.",
      "start_char": 1230,
      "end_char": 1633,
      "start_sentence": 49,
      "end_sentence": 64,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.010931253433228,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\历代崇道记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "又曰：疑惑何事？ 复对曰：为不知圣者姓名耳。 太上曰：我是无上神仙，姓李氏，号老君，即我也。 我即帝之祖也。 《史记》中有传，亳州谷阳县本庙有枯桧再生为验。 我已令周公旦领神兵助国家打刘黑闯，得四月节，却破矣。 孝义又令善行入奏，高祖乃勃善行驰驿往洛阳军所宣动示谕。 至时果平黑阎，四海大定，枯桧亦重生·焉。 乃改庙为庆唐观。 今观内有明皇御制书碑及列圣真容并在。 武德三年，诏晋阳道士王远知授朝散大夫，并赐缕金冠子，紫丝霞被，以预言高祖受命之征也。 太宗又加远知银青光禄大夫，并远知预言之故也。 珊衣人赐紫衣，自兹始也。 高宗龙朔二年，韶洛州长史谯国公许力士於郁山建上清宫，以镇鬼仙洞。 掘得古石按，即仙人帛仲理之故基也。 及功毕，帝令设醮，太上又现。 百官进表称贺，帝大悦。",
      "translated_text": "The Most High asked again, \"What doubts linger in your mind?\" Shanxing replied, \"Only that I do not know the sage’s name.\" The Most High said, \"I am the Supreme Divine Immortal, surnamed Li, styled Lord Lao—it is I. I am the ancestor of the Emperor. The *Records of the Grand Historian* contains my biography, and at the original temple in Guyang County of Bozhou, a withered juniper revived as proof. I have already commanded the Duke of Zhou, Dan, to lead divine troops in aid of the state to strike down Liu Heichang. By the fourth-month festival, he shall be crushed.\"\n\nFilial Piety again ordered Shanxing to present this in audience. The High Ancestor then urgently dispatched Shanxing by post-horse to the Luoyang military headquarters to proclaim and announce the divine decree. When the time came, Liu Heichang was indeed pacified, the Four Seas were wholly settled, and the withered juniper flourished anew. The temple was then renamed the Qingtang Abbey. To this day, within the abbey stand the stele inscribed by Emperor Minghuang and the true visages of successive sages.\n\nIn the third year of Wude, an edict appointed Wang Yuanzhi, a Daoist of Jinyang, as Gentleman for Court Discussion and bestowed upon him a gold-threaded coronet and a purple silk cloud-patterned robe, in recognition of his prophecy of the High Ancestor’s mandate. Taizong later promoted Yuanzhi to Grand Master for Splendid Happiness with Silver and Blue, again in acknowledgment of his prophetic words. The granting of purple robes to Daoist priests began from this time.\n\nIn the second year of Longshuo under Gaozong, an imperial decree ordered Xu Lishi, the Duke of Qiao and Chief Administrator of Luozhou, to build the Upper Clarity Palace on Yushan to suppress the grotto of demonic immortals. Excavations uncovered an ancient stone tablet, the former foundation of the immortal Bo Zhongli. Upon completion of the work, the Emperor commanded a grand jiao offering, and the Most High appeared once more. The hundred officials presented memorials of congratulation, and the Emperor rejoiced greatly.",
      "overlap_context": " audience, and the High Ancestor rejoiced greatly. He issued an edict appointing Shanxing as Gentleman for Court Discussion and bestowed upon him one hundred bolts of silk. He then commanded the Gentleman for Communications, Liu Xian, to establish a temple on Sheep’s Horn Mountain, renamed Fushan County as Shenshan County, and Sheep’s Horn Mountain as Dragon’s Horn Mountain. The Most High appeared once more to Shanxing, asking, \"Is the Son of Heaven pleased?\" Shanxing replied, \"Greatly pleased.\"",
      "start_char": 1633,
      "end_char": 1956,
      "start_sentence": 65,
      "end_sentence": 81,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.626975297927856,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\历代崇道记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "乾封初，帝束封礼毕，回銮亳州，亲谒太上，谨上尊号为混元皇帝，圣母为先天太后。 仍改谷阳县为真源县。 又为太宗及文德皇后造束明观於京师。 又动道士宜隶宗正寺，仍立位在亲王之次。 文明元年＃１天后欲王诸武，太上乃现于号州阕乡县龙台乡方兴里皇天原，遣鄗玄崇，令传言於天后云：国家祚永而享太平，不宜有所僭也。 天后遂寝，乃舍阕乡行宫为奉仙观。 后庆山涌出於新丰县界，高三百尺，上有五色云气，下有神池数顷，中有白鹤鸾凤，四面复有麒麟狮子，天后令置庆山县。 其诸祥瑞具载天后实录，以表国家土德中兴之兆也。 又舍中岳奉天宫为嵩阳观，以追荐高宗大帝也。 竟传位於中宗拳和皇帝。 景龙元年，勃天下州郡并令置景龙观。 二年政为中兴观。 三年改为龙兴观。 其度人一依前代故事。 睿宗舍东京宅为景云观，又舍太原宅为唐隆观。 为资荐天皇、天后也。 明皇开元中，劲诸道并令置开元观。 又制混元赞，帝亲书，勒之于石。 又动五岳置真君庙。 又动上都置太清宫，东都置太微宫，以太原神尧旧宅为紫微宫，涤州潜龙故宅为启圣宫，并给衮冕、绛纱、帷帐、交龙门戟，一如宫阙之制。 帝又注《道德经》，及制序引，诏天下士庶，并令家藏一本。 两街道众，乃以幢婶技乐，自禁中迎引归于太清宫。 香花之盛，近古未有。 又动置道举，一如礼部之制。 帝亲自策之，达者甚众。",
      "translated_text": "In the early years of Qianfeng, after the Emperor completed the feng sacrifice, he returned to Bozhou on his imperial progress and personally paid homage to the Most High. He reverently bestowed the august title of *Hunyuan Emperor* upon the Most High and *Primordial Celestial Empress* upon the Sacred Mother. He also renamed Guyang County as Zhenyuan County. Furthermore, he had the *Eastern Brightness Abbey* constructed in the capital for Taizong and Empress Wende. He decreed that Daoist priests should be registered under the Court of the Imperial Clan, their rank placed immediately after that of the imperial princes.\n\nIn the first year of Wenming, Empress Wu sought to ennoble the Wu clan. The Most High then manifested at Huangtianyuan in Fangxing Village, Longtai Township, Quexiang County of Haozhou. He dispatched Hao Xuanchong to convey this message to the Empress: \"The imperial house shall enjoy eternal prosperity and great peace; it is not fitting to overstep one’s bounds.\" The Empress thereupon desisted and converted the Quexiang temporary palace into the *Abbey of Venerating the Immortals*. Later, Qing Mountain emerged in the territory of Xinfeng County, rising three hundred feet high. Above it, five-colored clouds of qi gathered, while below lay a divine pool spanning several hundred acres, wherein white cranes, simurghs, and phoenixes dwelled. On all sides appeared qilin and lions. The Empress ordered the establishment of Qingshan County. All these auspicious omens were recorded in the *Veritable Records of Empress Wu*, signifying the resurgence of the earthly virtue of the imperial house.\n\nShe also converted the *Abbey of Heaven-Veneration* on Central Peak into the *Abbey of Mount Song’s Radiance* to offer prayers for the late Emperor Gaozong. Eventually, she abdicated the throne in favor of Emperor Zhongzong, the *Reverent and Harmonious Emperor*.\n\nIn the first year of Jinglong, an edict commanded that every prefecture and commandery in the empire establish a *Jinglong Abbey*. In the second year, it was renamed the *Abbey of Revival*. In the third year, it was again renamed the *Abbey of Dragon Ascendancy*. The ordination of Daoist priests followed the precedents of former dynasties.\n\nEmperor Ruizong converted his residence in the Eastern Capital into the *Abbey of Auspicious Clouds* and his residence in Taiyuan into the *Abbey of Tang’s Ascendancy* to offer prayers for the late Celestial Emperor and Celestial Empress.\n\nDuring the Kaiyuan era of Emperor Ming, an edict ordered that every circuit establish a *Kaiyuan Abbey*. He also composed the *Eulogy of the Hunyuan*, which he personally inscribed on stone. Furthermore, he decreed the establishment of *True Lord Temples* on the Five Peaks. He also ordered the construction of the *Supreme Clarity Palace* in the Upper Capital and the *Supreme Subtlety Palace* in the Eastern Capital. The former residence of the Divine Martial Emperor in Taiyuan was converted into the *Purple Tenuity Palace*, and the former residence of the Hidden Dragon in Qizhou was made the *Abbey of Initiating Sagacity*. All were furnished with imperial robes, crimson gauze, curtains, and crossed-dragon halberds, following the regulations of the imperial palaces.\n\nThe Emperor also annotated the *Daoist Classic of the Dao and Its Power* and composed a preface and introduction. He decreed that all scholars and commoners throughout the empire keep a copy in their homes. The Daoist communities of the Two Streets then paraded with banners, parasols, and musical performances, escorting the text from the palace to the *Supreme Clarity Palace*. The profusion of incense and flowers was unmatched in recent memory. He further decreed the establishment of the *Daoist Examination*, modeled after the system of the Ministry of Rites. The Emperor personally presided over the examination, and many candidates passed with distinction.",
      "overlap_context": "uo under Gaozong, an imperial decree ordered Xu Lishi, the Duke of Qiao and Chief Administrator of Luozhou, to build the Upper Clarity Palace on Yushan to suppress the grotto of demonic immortals. Excavations uncovered an ancient stone tablet, the former foundation of the immortal Bo Zhongli. Upon completion of the work, the Emperor commanded a grand jiao offering, and the Most High appeared once more. The hundred officials presented memorials of congratulation, and the Emperor rejoiced greatly.",
      "start_char": 1956,
      "end_char": 2487,
      "start_sentence": 82,
      "end_sentence": 106,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.538174867630005,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\历代崇道记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "后蒲州奏因修紫极宫，掘地获玉石，状如半月，复有仙人杵药之像，扣之有声，颇甚清远。 帝令悬於太原玄元庙庭，号之为偃月磬。 东都留守张琦奏汝州鲁山县因修仙居古观，获玉瑛，扣之声闻数里。 帝令悬於太清宫圣祖庙庭。 衢州为建观宇，穿地得鱼」头，长三尺，其状似铁，微微带紫碧之色，又如入青石光莹，雕镌殆非人功所成也。 扣.之甚响。 其鱼亦不能名。 遣使来献，帝令宣示百僚，亦不能辨。 帝乃呼瑞鱼，磬仍命悬於太微宫，非讲经设斋，不得击之。 由是诸观竞以木石模之，以代集众。 又语诸官悉以宰臣及本道节度使领之，永为常式。 帝又制霓裳羽衣曲、紫微八卦舞以荐献於太清宫，贵有异於九庙也。 帝东封‘，获江淮间三脊茅，乃令於所获之地，置灵茅观，乃礼毕，回谒圣祖於亳州本宫，亲札《道德经》於石，作大幢，造八角楼，覆之於虚元殿之前。 又幸怀州开元观及阕乡奉仙观，为王公万民所请，亦亲札丰经，以大石对峙立之，一如太清之制。 乃诏授鄗玄崇为号州刺史。 开元十七年夏四月五日，益州大都督府长史张敬忠奏大圣祖混元皇帝应现於当管蜀州新津县津兴尼寺，佛殿柱上自然隐起木文，为太上老君圣像，当顶上有华盖，足下前后各有云叶、天花共一十三处，谨差判官益州功曹参军王大钟检覆得状，与本州刺史李忠徇、别驾卢防、县令李韶、道士僧尼一百三十人状同，方敢上奏。 至五月二十四日，勃差内侍林昭隐宣取像柱入京，於大同殿供养。 又令两街宫观各赐供养七日，却令进入大内，于今见在。",
      "translated_text": "Later, the Prefecture of Puzhou reported that during renovations of the Purple Ultimate Palace, workers unearthed a jade stone shaped like a crescent moon. It bore the likeness of an immortal grinding medicine with a pestle, and when struck, emitted a sound both clear and distant. The Emperor ordered it hung in the courtyard of the Primordial Lord Temple in Taiyuan, naming it the *Recumbent Moon Chime*. The East Capital’s military governor, Zhang Qi, reported that during repairs to the Ancient Immortal Abode in Ruzhou’s Lushan County, a jade chime was discovered, its sound carrying for miles. The Emperor commanded it be hung in the courtyard of the Sacred Ancestor Temple at the Supreme Clarity Palace. In Quzhou, while constructing an abbey, workers digging the earth uncovered a fish’s head, three feet long, resembling iron yet faintly shimmering with purple and azure hues, as if embedded in blue-green stone with a lustrous sheen—its carving seemingly beyond human craft. When struck, it resounded deeply. No one could name the fish. The object was presented to court, where the Emperor displayed it to his officials, yet none could identify it. The Emperor thus called it the *Auspicious Fish* and ordered it hung in the Grand Ultimate Palace, decreeing it be struck only during scripture lectures or vegetarian feasts. Thereafter, Daoist abbeys competed to replicate it in wood or stone to summon assemblies.\n\nThe Emperor further instructed that all abbeys be overseen by chief ministers and regional military governors as a permanent regulation. He also composed the *Rainbow Skirt and Feathered Robe Melody* and the *Purple Ultimate Eight Trigrams Dance*, offering them at the Supreme Clarity Palace with greater reverence than at the Nine Temples. During his eastern imperial progress, he obtained three-ribbed thatch from the Jianghuai region and ordered the construction of the *Divine Thatch Abbey* at the site of its discovery. After completing the rites, he returned to pay homage to the Sacred Ancestor at the original abbey in Bozhou, personally inscribing the *Classic of the Dao and Its Power* on stone. He erected a grand banner and an octagonal tower, covering them before the Void Origin Hall. He also visited the Kaiyuan Abbey in Huaizhou and the Offering Immortal Abbey in Quexiang at the request of nobles and commoners, personally inscribing scriptures on towering stone steles, mirroring the design at the Supreme Clarity Palace.\n\nHe then decreed the appointment of Hao Xuanchong as prefect of Haozhou. In the summer of the seventeenth year of the Kaiyuan era, on the fifth day of the fourth month, Zhang Jingzhong, Chief Administrator of the Yi Prefecture Grand Protectorate, reported that the Great Sacred Ancestor, the Primordial August Emperor, had manifested in the Xinxin Convent of Xinjin County, Shu Prefecture, where the wooden grain of a pillar in the Buddha Hall naturally formed the image of the Most High Lord Lao. Atop the image was a floral canopy, and beneath it, thirteen instances of cloud leaves and celestial blossoms appeared before and behind his feet. The report was verified by Vice-Administrator Wang Dazhong, Prefect Li Zhongxun, Deputy Governor Lu Fang, County Magistrate Li Shao, and 130 Daoists, monks, and nuns before being submitted. On the twenty-fourth day of the fifth month, the Emperor dispatched the eunuch Lin Zhaoyin to convey the pillar to the capital, where it was enshrined in the Great Harmony Hall. He further ordered all abbeys of the Two Streets to hold seven days of offerings before returning the pillar to the imperial palace, where it remains to this day.",
      "overlap_context": "out the empire keep a copy in their homes. The Daoist communities of the Two Streets then paraded with banners, parasols, and musical performances, escorting the text from the palace to the *Supreme Clarity Palace*. The profusion of incense and flowers was unmatched in recent memory. He further decreed the establishment of the *Daoist Examination*, modeled after the system of the Ministry of Rites. The Emperor personally presided over the examination, and many candidates passed with distinction.",
      "start_char": 2487,
      "end_char": 3079,
      "start_sentence": 107,
      "end_sentence": 124,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.724294185638428,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\历代崇道记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "前后瑞应极多，难以具录。 二十九年正月七日，陈王府参军田同秀於丹凤门外忽见紫云自西北吱楼，又见混元乘白马，侍从二童子，二童子谓同秀曰：我昔与尹喜将入流沙之日，藏一匮灵符在桃林故关尹喜旧宅，汝可请帝取之。 同秀具事闻奏。 勃差内使李志忠监同秀往陕州桃林县南十二里故函谷关墟求访之。 俄有紫云白兔现於枯桑之下，便乃穿掘，下至水际，得石函金匮玉板，朱书细篆。 帝闻奏大悦，即令京师列十部乐，歌舞鼓吹，自通化门入其文於宝舆中。 五色放光，洞照天地。 帝於丹凤楼上身披龙衰，手执金炉，六宫嫔采，竞於楼上焚香散花，遥自作礼。 帝又令乱撒金钱於楼下，纵令士庶分取，以为欢乐。 斯须山呼之声震动京邑。 帝令置宝符於灵昌殿。 是夜楼阁林树之上，皆有神灯。 乃於正月一日改开元三十年为天宝元年，改桃林县为灵宝县。 其后三年，帝见灵符有天宝千载之字。 天宝已应改元之号，遂改年为载。 乃於其地长乐亭置天宝观，御制并书灵符，铭立於所获之处。 又於大内置灵符殿，赐同秀五品正员官。 宰相请加尊号为开元天宝神武之字，制可之。 乃大赦天下。 其年闰四月，帝梦混元谓帝曰：我在城之西南久矣，当与汝於兴庆相见，可速迎我。 帝谓宰相李林甫、牛仙客曰：朕临御海内，向三十年未尝不五更而起，具朝服，礼谒真容，为苍生祈福。 近因假寐，见混元具言上事。 遂差内使与道门威仪萧玄裕於城西南寻访数日，忽於楼观山谷问，见有紫云现，白光属天，於其下穿之，果得玉像老君，高三尺余，以进。 其日帝在兴庆宫大同殿亲自迎谒，果符兴庆之言。 置於内殿供养，仍令所司写真容，分送天下诸道宫观。 遂大赦天下。 五载，帝梦见混元言：我有灵应，寻当自至。 遂於太白山获灵符玉册，及迎到京，置于灵符殿，亲自供养。 。 仍封太白山神为灵应公，改获符洞为嘉祥洞，於山下置真符县。 乃令诸道置真符观。 仍编入史。 其年十二月，帝幸华清宫。 其月四日，日未出时，忽见骊山顶云物积异，须臾云散，见混元圣祖现於朝元阁上。 帝与内人瞻谒良久，乃隐。 诏改会昌县为昭应县，其新丰县隶入诏应。 又封会昌山为昭应山，封山神为玄德公，改朝元阁为降圣阁。 内出图本，颁示天下，宣付史官。 八载，帝获二十七仙玉像於宁州罗川县，勃令迎像入京，一如天宝初迎灵宝符仪注故事。 帝亲自制赞，寻改罗川县为真宁县。 於所获处造通圣观。 帝制碑文立之，于今并在。",
      "translated_text": "The auspicious omens were too numerous to record in full. On the seventh day of the first month in the twenty-ninth year, Field Marshal Tian Tongxiu of the Prince of Chen’s residence suddenly beheld purple clouds rising from the northwest watchtower outside Vermilion Phoenix Gate. He then saw the Primordial One riding a white horse, attended by two youths. The youths addressed Tongxiu, saying: “When Master Yin Xi and I entered the Flowing Sands long ago, we concealed a casket of sacred talismans in the old residence of Yin Xi at Peach Grove’s former Pass. You must petition the Emperor to retrieve them.” Tongxiu reported the matter in full.\n\nThe Emperor dispatched the eunuch Li Zhizhong to supervise Tongxiu’s journey to the ruins of the former Hangu Pass, twelve *li* south of Taolin County in Shanzhou. Suddenly, purple clouds and a white hare appeared beneath a withered mulberry tree. They dug there until they reached the water’s edge, where they uncovered a stone casket containing a golden coffer and jade tablets inscribed in vermilion seal script. The Emperor, upon receiving the report, rejoiced greatly. He ordered the capital’s ten musical ensembles to perform, with singing, dancing, and wind instruments, as the talismanic script was carried in a treasure palanquin through Tonghua Gate. Five-colored light radiated from it, illuminating heaven and earth. The Emperor, clad in dragon robes and holding a golden censer, stood atop Vermilion Phoenix Tower, while the ladies of the six palaces competed to burn incense and scatter flowers, bowing from afar. He further commanded that gold coins be scattered below the tower for the common people to gather in celebration. In an instant, the cheers of the multitude shook the capital.\n\nThe Emperor ordered the sacred talisman enshrined in Lingchang Hall. That night, divine lamps appeared upon the towers, pavilions, and trees. On the first day of the first month, the thirty-first year of Kaiyuan was renamed the first year of Tianbao, and Taolin County was renamed Lingbao County. Three years later, the Emperor noticed the characters “Tianbao, a thousand years” on the talisman. As “Tianbao” had already been adopted as the reign title, he changed the year-count to *zai* (载). At the site of the discovery, he established Changle Pavilion as Tianbao Abbey, personally composing and inscribing the *Stele of the Sacred Talisman* at the place of its retrieval. He also erected Lingfu Hall within the palace and appointed Tongxiu to a fifth-rank regular post. The chief ministers requested the addition of the honorific title “Divine Martialty of Kaiyuan and Tianbao,” which the Emperor approved. A general amnesty was declared throughout the realm.\n\nIn the intercalary fourth month of that year, the Emperor dreamed that the Primordial One said to him: “I have long resided in the southwest of the city. I shall meet you at Xingqing Palace—make haste to welcome me.” The Emperor told his chief ministers Li Linfu and Niu Xianke: “In my thirty years of ruling the realm, I have never failed to rise before dawn, don my court robes, and pay reverence to the true image, praying for the welfare of all beings. Recently, in a brief slumber, I saw the Primordial One, who spoke of this matter.” He then dispatched eunuchs and the Daoist master of ceremonies Xiao Xuanyu to search the southwest of the city for several days. Suddenly, in a valley of Louguan Mountain, they beheld purple clouds and a white radiance connecting heaven and earth. They dug at the site and indeed recovered a jade statue of Lord Lao, over three *chi* in height, which they presented to the Emperor.\n\nThat day, the Emperor personally welcomed the statue at Datong Hall in Xingqing Palace, fulfilling the prophecy of the dream. He enshrined it in the inner palace for veneration and ordered its likeness copied and distributed to all abbeys throughout the realm. A general amnesty was again declared. In the fifth year, the Emperor dreamed that the Primordial One said: “I possess a numinous talisman, which shall soon appear of its own accord.” Soon after, a sacred talisman and jade register were recovered from Mount Taibai. Upon its arrival in the capital, it was enshrined in Lingfu Hall, where the Emperor personally venerated it. He enfeoffed the mountain spirit of Mount Taibai as Duke of Numinous Response, renamed the cave of its discovery Auspicious Grotto, and established Zhenfu County at the mountain’s foot. He further ordered the establishment of Zhenfu Abbeys in all circuits and had the events recorded in the official histories.\n\nIn the twelfth month of that year, the Emperor visited Huaqing Palace. On the fourth day of the month, before sunrise, he suddenly saw strange clouds gathering atop Mount Li. In an instant, the clouds dispersed, revealing the Primordial Sage Ancestor upon Chaoyuan Pavilion. The Emperor and his attendants gazed upon him for a long while before he vanished. By edict, Huichang County was renamed Zhaoying County, and Xinfeng County was incorporated into Zhaoying. Mount Huichang was renamed Mount Zhaoying, its spirit enfeoffed as Duke of Mysterious Virtue, and Chaoyuan Pavilion renamed Descending Sage Pavilion. An illustrated account was issued throughout the realm and entrusted to the official historians.\n\nIn the eighth year, the Emperor recovered twenty-seven jade statues of immortals in Luochuan County, Ningzhou. He ordered their conveyance to the capital, following the same ceremonial protocols as the initial welcoming of the Lingbao talisman. The Emperor personally composed a eulogy, and Luochuan County was renamed Zhenning County. At the site of the discovery, Tongsheng Abbey was established. The Emperor composed an inscription for the stele, which still stands today.",
      "overlap_context": "e-Administrator Wang Dazhong, Prefect Li Zhongxun, Deputy Governor Lu Fang, County Magistrate Li Shao, and 130 Daoists, monks, and nuns before being submitted. On the twenty-fourth day of the fifth month, the Emperor dispatched the eunuch Lin Zhaoyin to convey the pillar to the capital, where it was enshrined in the Great Harmony Hall. He further ordered all abbeys of the Two Streets to hold seven days of offerings before returning the pillar to the imperial palace, where it remains to this day.",
      "start_char": 3079,
      "end_char": 4013,
      "start_sentence": 125,
      "end_sentence": 166,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.68038773536682,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\历代崇道记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "其年六月，大同殿产玉芝一茎，又造金仙、玉芝二观，复度公主二人为道士。 又太白山人李浑上言见混元，言金星洞内有玉版石，记圣皇福寿之符。 动御史中丞王鉼入游，谷行四百余里，求而得之。 勃以殊祥颁示中外，乃於其地造灵符观。 闰六月丙寅，帝谒太清宫，加五圣尊号，作仲尼四子像侍立於混元之前。 又勃十道大郡置玉芝观，大赦天下。 九载，太白山人王玄翼上言混元大帝降现，言宝仙洞中有妙宝真符，谓帝取之。 动刑部尚书张均、工部尚书王捶往取，获之。 乃造真灵观。 十三载正月，帝谒太清宫，又上混元尊号为大圣祖高上大道金阙混元天皇大帝，五圣各加谧号，帝加开元天地大宝圣文神武证道孝德皇帝，大赦天下。 十五载，帝幸蜀，混元现於汉中郡三泉县黑水之侧； 帝亲礼谒，遂命刻石像真容於所现之处。 又於利州益昌县山岭上见混元骑白卫而过，示收禄山之兆。 诏封其山为白卫岭，於所现之处置自然观。 又於嵩山置兴唐观，成都置福唐观。 肃宗至德二载三月十八日，混元现於通化郡云龙岩。 初因郡人为国祈福，建大斋会，十八日忽烟雾异香氤氲不散，至辰时渐惭开霁，神光照天，因见混元真像立於山前，自地接天，通身白衣，左手垂下，右手执五明之扇，仪相炳然，众尽瞻礼。 其山虽高，亦不及肘。 良久乃隐。",
      "translated_text": "In the sixth month of that year, a single stalk of jade fungus emerged in the Great Hall of Unity. The Emperor then established the Gold Immortal Abbey and Jade Fungus Abbey, and two princesses were ordained as Daoist priestesses. Furthermore, Li Hun, a recluse of Mount Taibai, reported an apparition of the Primordial One, who revealed that within the Golden Star Grotto lay a jade tablet inscribed with auspicious signs of the Sagely Emperor’s fortune and longevity. The Emperor dispatched Palace Censor Wang Pi to investigate. After traversing over four hundred li through valleys, he obtained the tablet. The extraordinary omen was proclaimed throughout the realm, and the site was consecrated as the Abbey of Numinous Signs.\n\nOn the bingyin day of the intercalary sixth month, the Emperor visited the Supreme Clarity Palace, bestowed honorific titles upon the Five Sacred Ones, and had statues of Confucius’s four disciples installed to stand in attendance before the Primordial One. He also decreed that grand prefectures in the ten circuits establish Jade Fungus Abbeys and issued a general amnesty for the empire.\n\nIn the ninth year, Wang Xuan-yi, another recluse of Mount Taibai, reported that the Primordial August Emperor had manifested, declaring that within the Grotto of Treasure Immortals lay a wondrous treasure—a true talisman—commanding the Emperor to retrieve it. The Emperor dispatched Minister of Justice Zhang Jun and Minister of Works Wang Chui to fetch it, and they succeeded. The site was then consecrated as the Abbey of True Numinosity.\n\nIn the first month of the thirteenth year, the Emperor again visited the Supreme Clarity Palace, where he elevated the honorific title of the Primordial One to *Great Sagely Ancestor, Most High and Supreme Dao, Golden Portal, Primordial Heavenly August Emperor*. Each of the Five Sacred Ones received additional honorifics, while the Emperor’s own title was expanded to *Kaiyuan Heaven-and-Earth Great Treasure Sagely Cultured Divine Martial Verifying-the-Dao Filial Virtue Emperor*. A general amnesty was declared for the realm.\n\nIn the fifteenth year, while the Emperor was in Shu, the Primordial One appeared beside the Blackwater River in Sanquan County, Hanzhong Prefecture. The Emperor personally paid homage, and a stone likeness of the true visage was carved at the site of the apparition. Later, in Yichang County, Lizhou, the Emperor witnessed the Primordial One riding a white beast across a mountain ridge—an omen of the suppression of An Lushan. The mountain was enfeoffed as White Beast Ridge, and the site of the manifestation was consecrated as the Abbey of Spontaneous Generation. Additionally, the Abbey of Flourishing Tang was established on Mount Song, and the Abbey of Blessed Tang in Chengdu.\n\nOn the eighteenth day of the third month in the second year of the Zhide era of Emperor Suzong, the Primordial One manifested upon Cloud Dragon Crag in Tonghua Prefecture. Earlier, the local populace had held a grand fast to pray for the state’s welfare. On the eighteenth day, a fragrant mist arose, lingering without dissipation. By the hour of *chen*, it gradually cleared, revealing a divine radiance illuminating the sky. The true image of the Primordial One stood before the mountain, stretching from earth to heaven, clad in white robes, the left hand hanging down and the right holding a five-rayed fan. The august countenance shone resplendently, and all present gazed in reverence. Though the mountain was lofty, it barely reached the figure’s elbow. After a long while, the vision vanished.",
      "overlap_context": "he official historians.\n\nIn the eighth year, the Emperor recovered twenty-seven jade statues of immortals in Luochuan County, Ningzhou. He ordered their conveyance to the capital, following the same ceremonial protocols as the initial welcoming of the Lingbao talisman. The Emperor personally composed a eulogy, and Luochuan County was renamed Zhenning County. At the site of the discovery, Tongsheng Abbey was established. The Emperor composed an inscription for the stele, which still stands today.",
      "start_char": 4013,
      "end_char": 4517,
      "start_sentence": 167,
      "end_sentence": 185,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.30502676963806,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\历代崇道记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "遂具上奏，内出图本，太上皇制赞并序，文繁不录。 具编史册，仍示天下。 乾元二年，帝夜梦二青童导从至一宫阙，谒见混元。 混元衣云霞之衣，冠九凤之冠，坐方席，垂宝盖，凭玉几，执白拂，左右侍卫、真人玉女、神仙童子、五天力士罗列极众。 帝着绛衣，秉圭立侍於混元之后，游涉山海，经历甚远。 帝一一港记。 又见混元须发皆黑。 及明，宣下两街，访诸瑞像於务本坊光天观圣祖院，果获黑髭老君之像。 图写以进，帝见大悦，一如梦中所睹。 乃出帝真容，令侍立於混元之后。 仍颁示於天下，普令供养。 代宗初於楚州安宜县获八宝，因改安宜县为宝应县，勃於所获处造宝应观。 遂改元为宝应元年，大赦天下。 德宗贞元十年，混元潜使金母累降於果州金泉山，授炼黑之卫，付女真谢自然，修习功成，以其年十月十六日白日上升。 后三月乃归，谓刺史李坚曰：天上有玉堂最高，老君居焉。 壁上皆题神仙之名，时注脚下，云在人间，或为帝王，或为宰辅。 神仙入谒老君，皆四拜焉。 自然言讫，遂却升天。 敬宗宝历二年正月？ 帝有事于南郊，朝献太清官。",
      "translated_text": "Thereupon, a memorial was duly submitted to the throne, and an illustrated scroll was presented from the inner palace. The Supreme August Emperor composed a eulogy with a preface, the text of which, being lengthy, is not recorded here. The account was compiled into the historical annals and disseminated throughout the realm.\n\nIn the second year of the Qianyuan era, the Emperor dreamed one night that two azure youths led him to a palace, where he was granted an audience with the Primordial One. The Primordial One wore robes of cloud and mist and a crown adorned with nine phoenixes. Seated upon a square mat, beneath a jeweled canopy, he leaned upon a jade table, holding a white whisk. Arrayed about him were attendants, perfected beings, jade maidens, divine immortals, and youths, along with warriors from the five celestial realms—an assembly of boundless multitude. The Emperor, clad in crimson robes and bearing the jade tablet of office, stood in attendance behind the Primordial One. Together they traversed mountains and seas, journeying vast distances, each step vividly etched in the Emperor’s memory. He also beheld the Primordial One’s beard and hair, both black as ink.\n\nAt dawn, the Emperor summoned officials from both thoroughfares and inquired after auspicious images at the Hall of the Sacred Ancestor in the Guangtian Abbey of Wuben Ward. There, they indeed discovered an image of the Elder Lord with a black beard. A likeness was painted and presented to the Emperor, who, upon seeing it, rejoiced greatly, for it matched precisely what he had witnessed in his dream. He then had his own true portrait brought forth and ordered it placed in attendance behind the Primordial One. This was proclaimed throughout the empire, with instructions for universal veneration.\n\nEarly in his reign, Emperor Daizong obtained eight treasures in Anyi County of Chuzhou, whereupon the county was renamed Baoying. A Baoying Abbey was erected at the site of the discovery, and the era name was changed to the first year of Baoying, with a general amnesty declared across the land.\n\nIn the tenth year of the Zhenyuan era of Emperor Dezong, the Primordial One secretly dispatched the Queen Mother of the West to descend repeatedly upon Jinquan Mountain in Guozhou. There, she transmitted the arts of refining black *qi* to the female perfected one Xie Ziran. After completing her cultivation, on the sixteenth day of the tenth month of that year, she ascended to heaven in broad daylight. Three months later, she returned and said to Prefect Li Jian: “In the heavens stands the loftiest Jade Hall, where the Elder Lord resides. The walls are inscribed with the names of divine immortals, with annotations beneath recording their earthly incarnations—some as emperors, others as chief ministers. When immortals pay homage to the Elder Lord, all bow four times.” Having spoken, Xie Ziran once more ascended to heaven.\n\nIn the second year of the Baoli era of Emperor Jingzong, on the first month’s *?* day, the Emperor performed rites at the southern suburban altar and presented offerings at the Grand Clarity Palace.",
      "overlap_context": "lingering without dissipation. By the hour of *chen*, it gradually cleared, revealing a divine radiance illuminating the sky. The true image of the Primordial One stood before the mountain, stretching from earth to heaven, clad in white robes, the left hand hanging down and the right holding a five-rayed fan. The august countenance shone resplendently, and all present gazed in reverence. Though the mountain was lofty, it barely reached the figure’s elbow. After a long while, the vision vanished.",
      "start_char": 4517,
      "end_char": 4942,
      "start_sentence": 186,
      "end_sentence": 205,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.102536916732788,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\历代崇道记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "御驾将至，长安县主簿郑蓊忽见老君衣白衣，容状异常，谓万曰：当此路有井，可速实之，不然祸在不测。 万惊惶，顾其地已微陷，遂并力实之。 因失老君所在。 驾至，具以上闻，百官称贺，韶兵部侍郎韦处厚为碑，起居郎柳公权书，立于实井之侧，乃编付史官。 其年十二月十八日，公权书碑之际，忽有劲风飒然而起，旋枫不已，乃见混元着紫衣，金冠金履，立於白连花之上，右手执五明扇，左手垂下，空中光明如金色。 公权与镌碑人瞻睹良久，因以物画地记形像。 及画毕，混元忽以扇指空中，流光四散，乃腾空而去。 众皆侧身仰视，渐远渐小，没於云中。 遂以事上闻。",
      "translated_text": "As the imperial carriage approached, Zheng Weng, the chief clerk of Chang’an County, suddenly saw the Elder Lord clad in white robes, his appearance extraordinary. He addressed Wan, saying: “There is a well along this path—seal it swiftly, or calamity shall befall beyond measure.” Wan, alarmed, turned to see the ground already subtly subsiding and thus joined forces to fill it. Thereupon, the Elder Lord vanished from sight. When the imperial carriage arrived, the matter was reported in full, and the hundred officials offered their congratulations. An edict was issued to the Vice Minister of War, Wei Chuhou, to compose an inscription, while the Recorder of Imperial Deeds, Liu Gongquan, was tasked with calligraphy. The stele was erected beside the sealed well and subsequently recorded by the court historians.\n\nOn the eighteenth day of the twelfth month of that year, as Liu Gongquan inscribed the stele, a sudden gust of fierce wind arose, swirling without cease. Then appeared the Primordial One, robed in purple, crowned in gold, and shod in golden slippers, standing upon a white lotus. In his right hand he held a Fivefold Radiance Fan, while his left hung down, the air around him luminous as golden light. Gongquan and the stonecutters gazed upon him for a long while, then traced his form upon the ground. As the drawing neared completion, the Primordial One suddenly pointed his fan toward the sky, scattering streams of light in all directions before soaring aloft. The crowd turned to watch, their bodies angled upward as he receded, growing ever smaller until he vanished into the clouds. The event was then reported to the throne.",
      "overlap_context": "ord resides. The walls are inscribed with the names of divine immortals, with annotations beneath recording their earthly incarnations—some as emperors, others as chief ministers. When immortals pay homage to the Elder Lord, all bow four times.” Having spoken, Xie Ziran once more ascended to heaven.\n\nIn the second year of the Baoli era of Emperor Jingzong, on the first month’s *?* day, the Emperor performed rites at the southern suburban altar and presented offerings at the Grand Clarity Palace.",
      "start_char": 4942,
      "end_char": 5196,
      "start_sentence": 206,
      "end_sentence": 214,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.44718885421753,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\历代崇道记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "诏编事迹入碑之中。 又劲於两京造延唐观。 文宗开成二年五月，中书舍人高元裕为板州刺史，於州北八九里嘉陵江上小山之前，忽见崖壁问光彩有异，近而观之，石上自然石文成老君真像，眉发衣章，巾履服饰，无不周备。 傍有一人，宽衣大袖，持炉荐香，后一人童子，双髻高束，谨若听命，皆非人力图绘铸刻所及。 元裕每有祈梼，即紫黑上浮。 又有灵泉自涌，士民请福，无不立效。 遂刻石建宇，用旌其瑞。 乃画图呈进，乞编入史。 韶从之。 武宗会昌元年，勃以二月十五日大圣祖降诞之日为降、圣节，仍令两京及天下诸州府设斋行道作乐，赐大醉三日，军期急速，亦不在此限，永为常式。 懿宗咸通十年九月十日，徐州逆寇庞勋领从党三千余人来亳州太清宫，其日宫北百姓三百余人，见老君自宫中乘空而南，须臾黑雾遍南川中，群贼迷路，自相杀戮，庞勋溺水而死。 群凶自此珍灭。 汴州节度使太清宫使李蔚具事上闻。",
      "translated_text": "A decree was issued to incorporate these events into the stele’s inscription. Furthermore, the court ordered the construction of the Yan-Tang Abbey in both capitals.\n\nIn the fifth month of the second year of Kaicheng during Emperor Wenzong’s reign, the Drafter of the Imperial Chancellery, Gao Yuanyu, was serving as Prefect of Bazhou. Eight or nine *li* north of the prefectural seat, before a small hill along the Jialing River, he suddenly noticed an unusual radiance upon the cliff face. Drawing nearer, he saw that the stone bore a natural inscription forming the true image of the Venerable Lord: his brows and hair, robes and sash, headscarf and slippers—all were perfectly complete. Beside him stood one figure, clad in flowing robes with wide sleeves, holding an incense burner to offer fragrance. Behind was another, a youth with twin topknots bound high, reverent as though awaiting command. None of these could have been achieved by human craft, whether through painting, casting, or carving. Whenever Yuanyu made prayers, purple-black vapors would rise above the image. A sacred spring also welled forth spontaneously, and when the gentry and common folk sought blessings, none failed to receive immediate efficacy. Thus, the stone was carved, and a hall erected to mark this auspicious sign. Yuanyu then had the image painted and submitted to the throne, petitioning that it be recorded in the histories. The imperial assent was granted.\n\nIn the first year of Huichang during Emperor Wuzong’s reign, on the fifteenth day of the second month—the birthday of the Great Sage Ancestor—it was decreed that the day be established as the *Jiang-Sheng* Festival. The court further commanded that in both capitals and all prefectures and commanderies throughout the realm, vegetarian feasts be held, the Dao be practiced, and music performed. Three days of grand intoxication were granted, with no exception even for urgent military campaigns. This was to be observed as a permanent institution.\n\nIn the ninth month of the tenth year of Xiantong during Emperor Yizong’s reign, on the tenth day, the rebel Pang Xun of Xuzhou led over three thousand followers to the Taiqing Abbey in Bozhou. That day, more than three hundred commoners north of the abbey witnessed the Venerable Lord ascend into the sky from within the abbey, heading south. In an instant, black mist blanketed the southern plains. The rebel horde lost their way and turned upon one another in slaughter, while Pang Xun drowned in the waters. The band of villains was thus utterly annihilated. Li Wei, the Pacification Commissioner of Bianzhou and Supervisor of the Taiqing Abbey, reported the matter to the throne.",
      "overlap_context": "hile his left hung down, the air around him luminous as golden light. Gongquan and the stonecutters gazed upon him for a long while, then traced his form upon the ground. As the drawing neared completion, the Primordial One suddenly pointed his fan toward the sky, scattering streams of light in all directions before soaring aloft. The crowd turned to watch, their bodies angled upward as he receded, growing ever smaller until he vanished into the clouds. The event was then reported to the throne.",
      "start_char": 5196,
      "end_char": 5560,
      "start_sentence": 215,
      "end_sentence": 227,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.925295114517212,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\历代崇道记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "韶曰：我国家系承混元，教遵清诤，苦县旧里，圣相故乡，官宇具严，庙貌斯设，昨者余妖奔突纵火，将欲焚烧，阴雾覆闭於晴空，狂寇颠迷於道路，散逸原野，遂至诛夷。 缅惟玄功，申兹灵肌。 内出青词，又委李蔚虔‘申告谢，布示中外，仍付史官。 十三年三月，台州刺史姚鹊奏於天台山修老君殿，於其地穿获得石函册文以进，乞付史馆，颁示四方。 诏从之。 广明二年三月，河中节度使王重荣奏据晋州申龙角山庆唐观老君殿侧相树上瑞葛枯死重生。 先是，武德中，混元应现后，於二树问立殿宇，逾年之后，相树上忽自生葛蔓，长十余丈，荣茂於常。 其后齐王夺嫡，此蔓枯死。 旬月之后，自其末青翠再生，齐王遂败。 至中宗复位，安史叛逆，朱沘谋乱，皆忽枯落，久而复生。 广明元年，黄巢犯阙，其年秋葛蔓枯死。 二年春，，枝叶重茂。 又於傍树上别生一枝，旬日之中，长五十余尺，相对繁茂，有异於常。 奏诏褒美，编付史官。 其后祥异，皆有诏动，一盖美乎葛万，庆其孙谋，瓜艇昭其远一祚，混元流既，奕叶无穷者也。 皇帝驻跸西蜀，中和二年八月九日进到，帝令宣示内外。 三年三月十一日，亳州刺史潘稠差道士马含章、孙栖梧等奏太清宫自乾宁四年已后，累有逆寇侵犯真源，少或逾千，多或至万，皆窥伺是宫，欲为焚劫。 或来攻城邑，或旁犯县城，老君皆密垂神化，忽起浓云，或驱以阴风，或击以雷雹，率皆颠沛，寻至败亡。 灵既益彰，神功罔测o寻诏升真源县为畿县，仍内出青词，修崇告谢。 帝即稽首束拜。 八月十二日，勃亳州太清宫是混元降圣之里，名高道祖，福荫皇基，九宫之瑞井涵空，一鹿之仙踪在树，累代之祯祥可纪，近年之感应尤彰，所宜严盛於福庭，安可荒冻於静宇。 潘稠能施善政，久染直风，广出俸钱，备修宫观，垣塘楝桶，无不精新，像设丹青，弥加焕丽，观图考事，探可慰嘉。 其住宫威仪道士昊重玄可赐紫，仍号凝玄先生。 道士马含章、孙栖梧并赐紫。 潘稠加金紫光禄大夫，检校工部尚书，余并如故。 其年八月二十九日夜，诏帝房宗室李特立与道士李元为於成都府青羊肆玄中观混元降生旧地设醮祈真，忽见虹光如弹丸许，渐渐明大，出於殿基束南竹林中，跳踯入西南梅树下，．没於没处，穿地三尺。 已来得宝博一口，长一尺一寸五分，阔七寸四分，一边厚一寸三分，并有花文，一边厚一寸八分，重一十二斤，有古篆六字，各方二寸，深三分，镌刻莹洁，迨非人工。 文曰：太上平中和灾。 九月一日，西川节度使侍中陈敬谊奏曰：皇帝陛下稽古顺天，膺图抚运，凝怀至道，属想大同，是用省方以明罪己，探仁旁达於下土，至德升闻於上玄，符谶允臻，祯祥问出，降太上匡持之命，清中和寇孽之灾，乃示明文，爰形古篆，足表妖氛即珍，圣祚无疆，克知收复之期，便是清宁之日。 至十二日，帝令宣示百官，中书侍郎平章事韦昭度、户部侍郎平章事萧遘、门下侍郎平章事郑畋、御史中丞张渎、宗正卿嗣曹王龟年，表贺曰：伏以崔蒲啸聚，车驾省方，天灾流行，国家代有。 陛下降成汤罪己之诏，征王者有征之师，顾彼凶妖，即当珍灭，清平既彰於嘉兆，幽赞爰睹其秘文。",
      "translated_text": "The imperial edict proclaimed: Our imperial house traces its lineage to the Primordial One, upholding the teachings of purity and tranquility. In the ancient village of Ku County lies the sacred homeland of the Sage Lord, where palaces stand in solemn grandeur and temple halls are duly established. Yet recently, remnant rebels charged forth and set fires, seeking to burn and destroy. Suddenly, dark mist enveloped the clear skies, and the frenzied bandits lost their way upon the roads, scattering across the plains only to meet annihilation. In reverence of this mysterious power, we offer our deepest gratitude. An inner decree issued a *qingci* prayer, and Li Wei was entrusted with the solemn duty of reporting and giving thanks. The matter was made known throughout the realm and recorded by the court historians.\n\nIn the third month of the thirteenth year, Prefect Yao Que of Taizhou memorialized that while renovating the Hall of the Venerable Lord on Mount Tiantai, a stone casket containing inscribed tablets was unearthed at the site. He requested that these be submitted to the Historiography Institute and proclaimed across the land. The imperial decree approved this.\n\nIn the third month of the second year of Guangming, Military Commissioner Wang Chongrong of Hezhong reported that, according to a memorial from Jinzhou, at the Qingtang Abbey on Dragon Horn Mountain, beside the Hall of the Venerable Lord, a withered vine on the twin trees had miraculously revived. Previously, during the Wude era, after the Primordial One’s manifestation, a hall was erected between the two trees. Over a year later, a vine spontaneously grew upon them, stretching over ten *zhang* in length, its luxuriance surpassing the ordinary. Later, when Prince Qi usurped the heirship, the vine withered and died. Yet within days, fresh green shoots regrew from its tips, and soon after, Prince Qi met his downfall. During Emperor Zhongzong’s restoration, the An Lushan rebellion, and Zhu Ci’s treason, the vine withered each time, only to revive again. In the first year of Guangming, when Huang Chao threatened the capital, the vine withered that autumn. By the following spring, its branches and leaves flourished anew. Moreover, a new vine sprouted from a neighboring tree, growing over fifty *chi* in ten days, its paired vines thriving in extraordinary splendor. The memorial was met with imperial praise, and the event was recorded by the court historians. Thereafter, all such auspicious omens were duly reported by decree—a testament to the boundless virtue of the vine, celebrating the wisdom of ancestral counsel, and foretelling the enduring prosperity of the imperial line, as the Dao’s flow continues unbroken through generations without end.\n\nEmperor Xizong, having taken refuge in western Shu, received the report on the ninth day of the eighth month of the second year of Zhonghe. He ordered it proclaimed throughout the court and realm. On the eleventh day of the third month of the third year, Prefect Pan Zhou of Bozhou dispatched the Daoists Ma Hanzhang and Sun Qiwu to memorialize that since the fourth year of Qianning, the Taiqing Abbey in Zhenyuan had repeatedly suffered incursions by rebel forces, numbering from over a thousand to as many as ten thousand. All sought to plunder the abbey, some attacking cities, others raiding county towns. Yet each time, the Venerable Lord secretly manifested his divine power: dense clouds would suddenly arise, or yin winds would drive them back, or hail and thunder would strike, causing the rebels to stumble and scatter, soon meeting their doom. As his numinous efficacy grew ever more manifest, his divine works remained unfathomable. A decree was issued elevating Zhenyuan County to the status of a capital district, and a *qingci* prayer was composed to honor and give thanks. The Emperor bowed in reverence.\n\nOn the twelfth day of the eighth month, it was proclaimed: The Taiqing Abbey in Bozhou is the sacred birthplace of the Primordial One’s descent, its name exalted as the ancestral home of the Dao. Its blessings have nurtured the imperial foundation, its nine-palace auspices welling from the heavens, and the immortal traces of the single deer lingering upon the trees. Auspicious signs through successive dynasties are worthy of record, and in recent years, divine responses have been especially evident. How fitting it is to adorn this hallowed sanctuary with splendor, rather than allow its sacred halls to fall into neglect. Prefect Pan Zhou has governed with benevolence, long steeped in upright principles. He has generously donated his salary to restore the abbey, ensuring that its walls, eaves, beams, and rafters are all meticulously renewed, while the painted images and decorations shine with even greater brilliance. Upon reviewing the plans and records, his merits are truly commendable. The abbey’s presiding Daoist, Wu Chongxuan, shall be granted the purple robe and titled Master of Serene Mystery. The Daoists Ma Hanzhang and Sun Qiwu shall also be granted the purple robe. Pan Zhou shall be promoted to Grand Master for Splendid Happiness with Silver and Gold, and concurrently serve as Minister of Works, retaining his other titles.\n\nOn the night of the twenty-ninth day of the eighth month of that year, Emperor Zhaozong, along with the imperial clansman Li Teli and the Daoist Li Yuan, conducted a *jiao* ritual at the Xianyang Fair’s Xuanzhong Abbey in Chengdu—the very site of the Primordial One’s descent—praying for the presence of the True One. Suddenly, a rainbow-hued light, no larger than a pellet, appeared, gradually brightening and expanding. It emerged from the bamboo grove southeast of the hall’s foundation, leapt and bounded toward the plum tree in the southwest, then vanished into the earth, sinking three *chi* deep. There, a treasure casket was unearthed, measuring one *chi*, one *cun*, and five *fen* in length, seven *cun* and four *fen* in width. One side was one *cun* and three *fen* thick, adorned with floral patterns; the other side was one *cun* and eight *fen* thick, weighing twelve *jin*. Six ancient seal-script characters, each two *cun* square and three *fen* deep, were inscribed upon it, their carving so lustrous it seemed beyond human craft. The inscription read: *The Supreme One pacifies the calamities of the Middle Harmony.*\n\nOn the first day of the ninth month, Military Commissioner Chen Jingxuan of Xichuan, the Grand Preceptor, memorialized: Your Imperial Majesty, in emulating antiquity and aligning with Heaven, has received the mandate and governed the realm, cherishing the supreme Dao and yearning for great harmony. Thus, you have toured the provinces to reflect upon your faults, extending benevolence to the land below, while your perfect virtue ascends to the celestial realms. Prophecies and omens have duly arrived, and auspicious signs have emerged in succession. The Supreme One has bestowed the mandate to uphold and sustain, purging the calamities of banditry and rebellion in this era of Middle Harmony. Now, through these ancient seal-script characters, the divine decree is made manifest, foretelling the swift eradication of evil vapors, the boundless longevity of the sacred reign, and the imminent arrival of the day of recovery and peace.\n\nOn the twelfth day, the Emperor ordered the proclamation to be shown to all officials. The Minister of the Secretariat and concurrent Grand Councilor Wei Zhaodu, the Minister of Revenue and concurrent Grand Councilor Xiao Gou, the Minister of the Chancellery and concurrent Grand Councilor Zheng Tian, the Censor-in-Chief Zhang Du, and the Minister of the Imperial Clan, Prince Gui of Cao, presented a memorial of congratulation: We humbly note that when bandits howl and rebels gather, the imperial carriage tours the provinces; when natural disasters strike, they have occurred in every age. Your Majesty has issued a decree of self-reproach like that of Cheng Tang, and dispatched the punitive forces of a true king. The wicked rebels shall soon be annihilated, and the signs of peace and prosperity are already evident. Now, the hidden aid of the divine is revealed through these secret characters.",
      "overlap_context": "n Bozhou. That day, more than three hundred commoners north of the abbey witnessed the Venerable Lord ascend into the sky from within the abbey, heading south. In an instant, black mist blanketed the southern plains. The rebel horde lost their way and turned upon one another in slaughter, while Pang Xun drowned in the waters. The band of villains was thus utterly annihilated. Li Wei, the Pacification Commissioner of Bianzhou and Supervisor of the Taiqing Abbey, reported the matter to the throne.",
      "start_char": 5560,
      "end_char": 6766,
      "start_sentence": 228,
      "end_sentence": 258,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.00909686088562,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\历代崇道记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "赤雀衔书，既岂同於太上，玄氟负卦，庆难比於平灾。 况因宗室斋醮之辰，仍有祥光跳踯之瑞，其为感现，可谓丁宁。 枢密使李顺融、十浑十二卫都指挥使田令孜表贺曰：今者又有维城来於仙观，至诚才发、嘉兆俄呈，现此时在地之赤光，是昔日度关之紫气。 及穿积土，果获古文，验逸势於龙蛇，即知平於枭境，於冲邃理，颇甚昭开。 既太上今与平灾，知中和永昌，厥祚所现，全因圣祖掘得。 又自皇枝捧此灵踪，可明天意。 且混元圣祖，每逢多难，皆有殊祥，唯彼明征，备书正史。 昔於丹凤门上告田同秀与天宝复国之期，今又青羊肆中示李特立以陛下还宫之庆，莫不天下幸甚，乞付史绾。 帝并俞之。 十五日，李特立授太子校书，李元为赐紫，仍各赐缣帛三百匹。 二十一日，又诏曰：太上玄元大帝与弟子文始先生讲真经於楼观之台，约后会於青羊之肆，便乘云驾，俱入流沙。 狗记传闻，地图标载，自周昭至于此日，历数约二千余年，景象寂寥，基踪牢落。 今因巡幸，灵既昭彰，殊光跳跃於庭前，灵篆申明於树下。",
      "translated_text": "The vermilion sparrow bearing the scripture—how could this be equated with the Supreme Lord’s manifestations? The black *qi* bearing the hexagrams—how could such blessings be compared to mere disaster’s end? Moreover, on the very day when the imperial clan performed their rites of purification and offering, auspicious radiance leapt and danced as a wondrous sign. Such responsive revelation may well be called most clear and certain.\n\nThe Bureau of Military Affairs Commissioner Li Shunrong and the Commander-in-Chief of the Twelve Armies and Twelve Guards Tian Lingzi presented a memorial of congratulation: Now, once again, the imperial kinsmen have come to the immortal’s abode. No sooner had their utmost sincerity arisen than propitious omens appeared. The crimson glow now manifest upon the earth is none other than the purple *qi* that once passed beyond the pass. Upon excavating the accumulated soil, ancient script was indeed uncovered. The untrammeled force of dragons and serpents was confirmed, and the pacification of the rebel realm was thereby known. In the profound and abstruse principles of governance, this is most luminously revealed.\n\nSince the Supreme Lord now bestows blessings equal to the end of calamity, we know that harmony shall endure forever. The manifestation of this imperial destiny arises entirely from the sacred ancestor’s discovery. Moreover, as the imperial scion now bears this numinous trace, the will of Heaven is made clear. The Primordial Supreme Ancestor, whenever great trials arose, always displayed extraordinary portents. These luminous proofs are fully recorded in the standard histories. Formerly, at the Vermilion Phoenix Gate, he revealed to Tian Tongxiu the time of restoration for the Tianbao era; now, at the Green Ram Market, he has shown Li Teli the joy of Your Majesty’s return to the palace. Truly, the realm is most fortunate. We humbly request that this be entrusted to the historiographers.\n\nThe Emperor approved all these memorials.\n\nOn the fifteenth day, Li Teli was appointed Collator of the Eastern Palace, and Li Yuan was granted the purple robe, each additionally bestowed with three hundred bolts of fine silk.\n\nOn the twenty-first day, another edict was issued: The Supreme Lord of the Dao, the Most High and Primordial Emperor, once discoursed on the true scriptures with his disciple, Master Wen Shi, upon the terrace of the Louguan Abbey, and they agreed to meet again at the Green Ram Market before ascending together upon cloud chariots into the Flowing Sands. This account is preserved in oral tradition and marked upon geographical maps. From the time of King Zhao of Zhou until this day, some two thousand years have passed, during which the numinous traces have remained silent and the foundations desolate. Now, through the imperial progress, the divine has become manifestly clear: extraordinary light leapt and danced before the courtyard, and sacred script was elucidated beneath the trees.",
      "overlap_context": "memorial of congratulation: We humbly note that when bandits howl and rebels gather, the imperial carriage tours the provinces; when natural disasters strike, they have occurred in every age. Your Majesty has issued a decree of self-reproach like that of Cheng Tang, and dispatched the punitive forces of a true king. The wicked rebels shall soon be annihilated, and the signs of peace and prosperity are already evident. Now, the hidden aid of the divine is revealed through these secret characters.",
      "start_char": 6766,
      "end_char": 7173,
      "start_sentence": 259,
      "end_sentence": 271,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.00116729736328,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\历代崇道记.txt",
        "category": "记传类"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "博含古色，字验休祯。 中和之灾害欲平，厚地之祯符乃现。 足表玄穹降佑，圣祖垂祥，将歼大盗之兵戈，永耀中兴之事业。 须传简册，兼示寰区。 已付史官，备令编录，仍模勒文字，告示诸道及军前。 其观可改号为青羊宫，仍置殿堂屋宇。 侧近属观田地，约有两顷，近来散属黎陀，多植葱蒜，清虚之地，难使熏蒸，已赐钱二百贯，便令收赎，仍给公验，永归靖庐。 宗子特立已除官，道士李元为已赐紫，所宜升奖，用荷庆灵。 敬谊位冠公台，风行郡国，效节於延洪之代，修心於道德之乡，遂令境内消兵，地中呈宝，其为休美，倍可嘉称。 至十月七日，动高品郭遵泰监建青羊宫土木之工，并用内库宣赐。 自获灵瑞之后，至是月癸丑，近蜀郡寇相次擒戮，旬月之内遂致清平。 驾幸青羊宫，颁赐有差。 李特立赐绊，授龙州录事参军。 又下诏曰：太上垂祥，青羊应现，礼宜崇饰，用答殊休。 诸道州府紫极宫，宜委长吏如法修饰，仍选有科仪道士祭醮。 是月乙卯，奏收复京城，有以见大道垂休，圣祖昭佑，洪图延永，唐祚无疆者也。 又勃翰林学士、承旨尚书、兵部侍郎、知制诰乐朋龟撰碑立之。 伏乞颁示天下，以表皇家承神仙之苗裔，感太上之灵既，实万代之无穷也。 臣今检会，从国初已来，所造宫观约一千九百余所，度道士计一万五千余人，其亲王贵主及公卿士庶，或舍宅舍庄为观，并不在其数，则帝王之盛业，自古至于我朝，莫得而述也。 中和四年十二月十五日，上都太清官文章应制、弘教大师、赐紫道士臣杜光庭上进谨记。 历代崇道记竟 ＃１『年』原为『帝』，据文义改。",
      "translated_text": "Rich with ancient hues, its characters bear auspicious omens. As the calamities of the Zhonghe era neared their end, propitious signs emerged from the depths of the earth. This fully revealed the favor bestowed by the Mysterious Heavens and the blessings conferred by the Sacred Ancestor, who would annihilate the weapons of great bandits and forever illuminate the enterprise of the Middle Revival. These events must be recorded in annals and proclaimed throughout the realm.\n\nThey were already entrusted to the court historians for compilation and transcription, with the text to be carved and disseminated to all circuits and military fronts. The abbey was to be renamed the Green Ram Palace, and halls and chambers were to be constructed. The adjacent lands belonging to the abbey, approximately two *qing* in area, had recently been scattered among the common folk, who planted onions and garlic there. Such a pure and empty site could not endure such profane vapors, so two hundred strings of cash were granted to redeem the land, with official deeds issued to ensure its perpetual归属 to the House of Tranquility.\n\nZongzi Teli had already been appointed to office, and the Daoist Li Yuan had been bestowed the purple robe. Their promotions and rewards were fitting tributes to the numinous blessings. Reverently occupying the highest ranks of the public sphere, their influence spread across commanderies and states. They served with devotion in an era of extended prosperity and cultivated their minds in the homeland of Dao and virtue. Thus, they caused the land to be purged of war and treasures to emerge from the earth—such excellence is doubly worthy of praise and acclaim.\n\nOn the seventh day of the tenth month, the high-ranking official Guo Xuntai was appointed to supervise the construction of the Green Ram Palace, with funds drawn from the imperial treasury. From the time the numinous omens first appeared until the *guichou* day of that month, bandits near the Shu commandery were successively captured and executed, and within ten days, the land was pacified. The imperial carriage visited the Green Ram Palace, and gifts were bestowed accordingly. Li Teli was granted a ceremonial cap and appointed Recorder of Longzhou. Another edict was issued:\n\n\"The Supreme Lord has conferred blessings, and the Green Ram has manifested in response. It is fitting to honor and adorn this site to reciprocate such extraordinary favor. The Purple Culmen Palaces in all circuits, prefectures, and commanderies shall be entrusted to local officials for proper renovation, and Daoists skilled in ritual shall be selected to perform offerings and sacrifices.\"\n\nOn the *yimao* day of that month, it was reported that the capital had been recovered, demonstrating that the Great Dao bestows favor, the Sacred Ancestor grants protection, the grand design endures forever, and the Tang’s mandate knows no bounds. The Hanlin Academician, Chief Minister, Minister of War, and Drafter of Edicts, Yue Penggui, was ordered to compose and erect a stele. It is humbly requested that this be proclaimed throughout the realm to manifest that the imperial house descends from the lineage of immortals and has been moved by the numinous efficacy of the Supreme Lord—truly an endless blessing for ten thousand generations.\n\nUpon review, since the founding of the dynasty, approximately 1,900 palaces and abbeys have been constructed, with over 15,000 Daoists ordained. The palaces and abbeys donated by imperial kinsmen, noble consorts, high officials, and commoners are not included in this count. Such is the grandeur of the imperial enterprise—from ancient times to our present dynasty, none can be fully recounted.\n\nOn the fifteenth day of the twelfth month of the fourth year of Zhonghe, this record was respectfully submitted by Du Guangting, Daoist of the Purple Robe, Grand Master for the Propagation of Teaching, and Drafter of Literary Works at the Supreme Clarity Palace in the Upper Capital.\n\n*Record of the Veneration of the Dao Through the Ages* — Concluded.",
      "overlap_context": "ascending together upon cloud chariots into the Flowing Sands. This account is preserved in oral tradition and marked upon geographical maps. From the time of King Zhao of Zhou until this day, some two thousand years have passed, during which the numinous traces have remained silent and the foundations desolate. Now, through the imperial progress, the divine has become manifestly clear: extraordinary light leapt and danced before the courtyard, and sacred script was elucidated beneath the trees.",
      "start_char": 7173,
      "end_char": 7791,
      "start_sentence": 272,
      "end_sentence": 293,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.685847282409668,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\记传类\\历代崇道记.txt",
        "category": "记传类"
      }
    }
  ]
}