{
  "source_id": "原阳子法语",
  "source_file": "chunked_daozang\\原阳子法语.json",
  "total_chunks": 9,
  "total_original_chars": 10105,
  "total_translated_chars": 59906,
  "total_translation_time": 312.74620151519775,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太玄部\\原阳子法语.txt",
    "category": "正统道藏太玄部"
  },
  "full_translation": "**The Teachings of Master Yuanyang**\n\n**Title:** *The Teachings of Master Yuanyang*\n*Compiled by Zhao Yizhen of the Ming Dynasty, edited by Liu Yuanran. Two scrolls.*\n*Source text from:* *Daoist Canon of the Zhengtong Era, Supreme Mystery Section*\n\n**Scroll One of *The Teachings of Master Yuanyang***\n*Composed by Zhao Yizhen of Junyi, compiled by his disciple Liu Yuanran of Zhanggang*\n\n**Song of the Returned Elixir and Golden Liquor, with Preface**\n\nThe Dao gathers in emptiness, fundamentally without duality. Yet in cultivation, there are distinctions between internal elixir (neidan) and external elixir (waidan), arising from differing encounters and slight variations in function, though the attainment of the Dao remains one.\n\nWhat is called \"internal\" refers to the inherent completeness of the Dharma-body of self-nature, not reliant on externals, the natural truth. The work of advancement lies in gathering emotions into nature and returning nature to the origin. The doing of doing arises from non-doing; the realization of non-realization is true realization. When the embryo is perfected and spirit transforms, the body is shed, and one ascends to transcendence.\n\nThe oral instruction states:\n*A single numinous nature is called the Golden Elixir,\nThe four illusions serve as the furnace to refine it into a pill.*\nThis is the True One, the Mysterious One—also named the internal elixir.\n\nWhat is called \"external\" pertains to the illusory, impermanent body, inevitably subject to decay, which must rely on external medicine to be transmuted into truth. The work of ingestion and refinement involves capturing the essence of sun and moon, seizing the creative power of Heaven and Earth. When the medicinal spoon enters the mouth, passions and desires instantly dissolve; bones and flesh wholly fuse. Form and spirit become wondrous, and one ascends in broad daylight to join the Jade Clarity.\n\nThe oral instruction states:\n*The Wood Fluid originally issues from cinnabar,\nRefining the Wood Fluid returns it to the elixir’s body.*\nThe elixir reverts to gold, and gold is liquified—this is the Returned Elixir, the Golden Liquor, also named the external elixir.\n\nWhether termed internal or external, each further contains internal and external aspects. Gathering emotions into nature originates externally; returning nature to the origin originates internally. When nature is quiescent and emotions are empty, there is neither movement nor stillness, and no longer any internal or external—this is the internal and external of the internal elixir.\n\nInternally, the Wood Fluid is preserved as the ancestor; externally, true lead is borrowed to restrain it. Once the internal medicine is subdued, the external medicine is discarded, and there is likewise no internal or external—this is the internal and external of the external elixir.\n\nYet the internal landscape is subtle and wondrous, formless and nameless. The sagely teacher, out of necessity, borrows the names and images of the external elixir to illustrate its principles, making them easier to comprehend, hence also calling it the Golden Liquor Returned Elixir. Who would have known that later learners would cling to names and images, only to generate doubt? Some, upon hearing of the internal and external divisions in elixir arts, assume multiplicity and confusion, uncertain of what is correct.\n\nThis Dao is like a great city. Those who approach from the four directions, taking winding side paths, endure long journeys and may even lose their way. But if one takes the main road, whether entering from the east, south, west, or north gate, upon reaching the city, all are one. What then remains of the four directional paths?\n\nIn Buddhism, some enter through recitation of the Buddha’s name, others through Chan meditation. After exhausting the eighteen hundred koans, upon awakening, both recitation and meditation vanish. In Daoism, some advance through internal elixir cultivation, others through external elixir refinement. After traversing the three thousand six hundred dharma gates, upon realizing the Dao, both cultivation and refinement dissolve. Koans and dharma gates are no longer needed—like forgetting the trap once the fish is caught, or the snare once the rabbit is trapped. How can one then argue over right and wrong?\n\nIn ancient times, the Heavenly Worthy expounded eighteen thousand scriptures; the World-Honored One preached over five thousand sutras—perhaps too abundant. Later, when Donghua revealed the Complete Perfection teachings, or Bodhidharma came from the West without establishing texts, it may have seemed too sparse. Yet in awakening, every phenomenon is the Dao—neither sparse nor abundant. In delusion, every path is dark, and the more one seeks, the further one strays. How can one judge based on abundance or sparsity?\n\nSome, lacking proper learning, misinterpret elixir scriptures, citing the *Book of Changes*: \"The alternation of yin and yang is called the Dao,\" and \"The way of Qian becomes male; the way of Kun becomes female.\" They take human male and female as symbols of Heaven and Earth, using them as the crucible and furnace, extracting yin and yang as medicinal substances. They do not realize that the Great Dao fundamentally has no male or female imagery. When immortals employ symbols as metaphors, they refer to the principle of primordial interdependence, not the forms of the posterior heaven.\n\nThe oral instruction states:\n*What is visible cannot be used;\nWhat can be used is not visible.*\nThis is the essence of the internal elixir’s medicinal substances.\n\nA poem by an earlier master says:\n*One thing originally has one truth,\nOne body also contains a Heaven and Earth.\nKnow that the myriad things are complete within me—\nHow could the Three Powers establish separate roots?*\n\nImmortal masters also say:\n*Within one’s own body, there is husband and wife,*\n*One man and one woman raise six children.*\nAll refer to the creative power inherent within the body, not derived from without.\n\nLet us cite one or two examples of those who attained the Dao through internal elixir. Lord You Sheng, at seven years old, entered Mount Taihe to cultivate and ascend. Master Xu Jing also at seven entered the Upper Clarity Palace to cultivate and achieve liberation from the corpse. From where did they obtain their medicinal substances? Clearly, they were self-sufficient, not seeking from others.\n\nThose who cling to perverse views are far from the Dao. Texts like the *Yellow Register* and *Red Writings* were originally composed for householders to practice restraint and nurture life, yet later generations misused them to indulge desires and harm life—how can one not be warned?\n\nAs for the great medicine of the external elixir, it is also not obtained from another’s body. Though the five metals and eight minerals of the world are posterior heaven’s substantial things, they are not used. The medicine is fundamentally non-existent, extracted as qi and fluid from the insubstantial within the substantial—this is the arising of something from nothing.\n\nThe oral instruction states:\n*What has form cannot be a companion;\nWhat generates form from formlessness is called the Returned Elixir.*\n\nThe common crowd, ignorant of this, may regard it as alchemical trickery, slandering the true Dao. Such people hasten their own guilt and will fall into the uninterrupted hell.\n\nSome may claim the mind is the Dao itself, yet the Dao is formless and imageless, while the external elixir generates form from formlessness—how could they intersect? Moreover, clinging to artificial effort risks falling into emptiness.\n\nLet us consider the analogy of medicine. When one is struck by wind-evil or bitten by a rabid dog, the injury lies in the physical *qi*, yet the symptoms may induce heart pain, mental confusion, delirium, or loss of consciousness. Conversely, when one is afflicted by shock, sorrow, or excessive thought, leading to palpitations or madness, the injury and symptoms both reside in the heart. Yet by administering external medicine to regulate the physical *qi*, the heart and spirit may be calmed—how could this occur without mutual influence?\n\nBefore the Supreme Ultimate divided, the Three were enfolded in One. At the first movement, Yin and Yang separated, and the myriad things took form, each possessing its own Supreme Ultimate. Principle and *qi* depend on one another, rooted in the Dao; existence and non-existence restrain each other—this is the reason.\n\nThough the refining of the external elixir involves artificial effort, once obtained and ingested, it requires no further action. No cultivation is needed: the physical form returns to primordial nothingness, the spirit attains great stillness, and one reverts to the undifferentiated state of the Supreme Ultimate, merging with the true Dao.\n\nOriginally, in receiving life, one is endowed with Yin and Yang, shaped by Heaven and Earth, confined within the two *qi* and five phases. Yet in realizing the Dao, one grasps Yin and Yang, wields Heaven and Earth, and transcends the two *qi* and five phases—form cannot decay, spirit cannot depart. Like smelting gold from ore, once refined, it cannot return to its original state. How then could one fall into emptiness?\n\nOthers may doubt whether the physical body can ascend and transform. To judge wondrous matters by common perception is indeed cause for skepticism. Yet dragons transform into tigers, and one may tread upon empty space; water chestnuts and turtles, red herbs and men, may divide their spirits, disperse their *qi*, and scatter their forms. An old maple becomes a feathered immortal; rotten wheat becomes a butterfly—these are transformations from the insentient to the sentient. A virtuous woman turns to stone; a mountain earthworm becomes a lily—these are transformations from the sentient to the insentient. Thus, earth, wood, metal, and stone all possess sentience, essence, and spirit, and like insects, beasts, grasses, and trees, they may undergo change without hindrance.\n\nHumans alone are the most spiritually endowed of all things, their forms mirroring the Two Modes, their Dao encompassing the Three Ultimates—already half-immortal. The elixir seizes the ingenuity of creation, steals the harmony of Heaven and Earth. When humans ingest it, their impurities dissolve like melting ice and snow; the form transforms into *qi*, *qi* into spirit, spirit returns to emptiness, and one suddenly ascends to the sacred realm. Is this not the foundation of the supreme vehicle?\n\nIn ancient times, the Most High Lord Lao studied under the Supreme Primordial Sovereign, who first declared: *\"Those who wish to become immortals yet do not ingest the Returned Elixir and Golden Liquid merely torment themselves in vain. Struck by cold, heat, wind, dampness, or demonic *qi*, even the Controller of Destiny cannot save them. Refine the divine elixir early to guard against harm. A moment’s labor yields eternal joy—once perfected, one becomes an immortal.\"*\n\nFrom the Zhou, Qin, Han, Jin, Tang, and Song dynasties onward, all great immortals who realized the Dao and ascended to emptiness did so by this means. The sites of their transformations—cinnabar cliffs, elixir chambers, alchemical wells, sacred springs, crucibles, and mortar stones—remain visible to this day. Their writings, such as the *Great Clarity Scripture of the Elixir*, the *Embracing Simplicity Record of Fire*, and the *Songs of the Grass-Clad*, can still be examined.\n\nTo dismiss this as mere common sorcery is like a mayfly in vinegar, unaware of the vastness of Heaven and Earth. Alas, how the Dao has become obscured and unfulfilled! Some, lacking discernment, cling to stubborn emptiness or drift into reckless abandon; the ignorant, bound by prejudice, stray onto side paths.\n\nSome, newly entered into the mysterious gate, fail to seek instruction and instead sit in rigid stillness. Others stand for long hours, practice *qi*-circulation, or engage in visualization, forcibly suppressing the mind until madness ensues. Some, ignorant and deluded, boast and contend; others master only empty rhetoric, flaunting their eloquence. A few, with half-baked insights, boast of their abilities and scorn the world; lacking true realization, they establish sects and demand veneration. Some steal sacred texts, assume false identities, and pose as masters, deceiving the blind and deaf.\n\nOthers obsess over fasting and abstinence, practice grain avoidance, adopt bizarre appearances, or wear strange attire. Though the world may revere them, they have no connection to the Dao. Ancient immortals managed property and wealth, yet suddenly ascended; some drank wine and ate meat, yet swiftly attained transcendence. Their minds dwelled beyond the material, blending with the world while cultivating in secret—beyond the comprehension of ordinary people. How can one judge them by outward appearances?\n\nAlas, the Dao’s obscurity and failure to flourish have never been worse. Some, failing to examine the truth, remark: *\"So-and-so fell ill from pursuing the Dao; so-and-so gained nothing from cultivation; so-and-so perished from ingesting elixirs.\"* They conclude the Dao is unlearnable and shameful to discuss. Yet they do not know that from ancient times to the present, those who attained truth and realized the Dao are beyond counting. To generalize from the misguided, the unsuccessful, and the ignorant is like choking and abandoning food altogether.\n\nThose who know *that* it is so, yet do not know *why* it is so, must understand the four difficulties of seeking instruction and the ten challenges of advancing in the Dao.\n\nWhat are they?\nFirst, the paths are perilous: rivers and lakes are treacherous, the sea of humanity vast—whom can one ask as a teacher?\nSecond, cold and heat press upon the body, daily hardships oppress—before learning anything, unforeseen disasters may strike.\nThird, the ignorant feign lofty attainment, while the wise remain silent and blend with the dust. Seekers, unable to discern true teachers, often pay homage to the wrong ones.\n\nFourth, even if one encounters a true teacher, if one’s aspirations and conduct are not yet worthy of trust, it is difficult to advance together. Or though one may advance, the teachings imparted may be incomplete. Should one, by good fortune, receive the full transmission, one’s years will have already advanced. Such are the difficulties of seeking instruction.\n\nThe ten challenges of advancing in the Dao are these:\nFirst, to meet a true teacher early and have the correct Way revealed.\nSecond, to possess virtue and conduct that align with the heart of Heaven.\nThird, to make a great vow to universally deliver living beings.\nFourth, to rely on the power of great merit to avoid demonic obstacles.\nFifth, to have the foundational capacity and encounter the right conditions.\nSixth, to form bonds with immortal companions whose aspirations and conduct are mutually trustworthy.\nSeventh, to withdraw from worldly distractions and dwell in purity and stillness.\nEighth, to regulate diet and maintain regular daily rhythms.\nNinth, to guard one’s speech and act with diligence, avoiding slander and criticism.\nTenth, to reverently serve the divine immortals with unwavering sincerity.\n\nThese are the foundations of advancing in the Dao, and they are exceedingly difficult to fulfill. Should even one of these ten be lacking, it is hard to achieve complete success. As Tao Hongjing’s *Dengzhen Yinjue* meticulously sets forth the precepts and prohibitions of cultivation, and works like the *Tiantai Zhiguan* and *Guifeng Xiuzheng Yi* clearly explain demonic obstacles and prepare for the unforeseen, so too must the practitioner be vigilant. Yet today, many are deficient in seeking instruction but hasty in seeking results, often failing to recognize their own limitations.\n\nNevertheless, there are those who fully dedicate themselves to the Way yet still cannot escape misfortune. For instance, Śākyamuni Buddha endured the severing of his limbs; the ancient Buddha Dingguang was exiled to Nan’an; Yan Hui died young; Zilu was made into mincemeat; Gongye was imprisoned; Boniu suffered illness; Zhang Guo was struck by King Zhou; Guo Pu was executed by Dun; Master Ziyang endured three banishments; and Qing’an met his end over tea. Though none of these calamities could sway their resolve, and life and death were not theirs to control, it remains true that flesh and bone are bound by karmic destiny. As the scriptures say: *\"One who walks on land does not avoid rhinoceroses and tigers; one who enters battle does not shun armor and weapons.\"* Such is the way of those who have attained the Dao—how could it be easily achieved by mere students?\n\nI have heard that the Perfected One Bai Ziqing of Purple Clarity wandered for nine years, enduring countless hardships, before finally encountering a true teacher. Another twenty years passed before he found refuge in the household of Prime Minister Jin of Hongdu, where he practiced in seclusion for a decade before achieving immortality and ascending. If even the sages, buddhas, and worthies of antiquity faced such varied demonic trials, how much more so must students? Yet one must not falter in difficulty or waver in resolve.\n\nFor those who pursue the Dao and seek to become immortals or buddhas, it is much like the Confucian scholar’s aspiration to become a sage. One must simply steadfastly commit to the path and practice diligently. As for success, that is a matter of Heaven—how can one insist upon it? Yet once this wondrous Dao enters the ear, it becomes an eternal seed of sagehood. Thus, the Perfected One Guan Yin said: *\"To hear the Dao in the morning is to be ready to die by evening.\"* Though the student may not yet attain the ultimate fruition of embodying the Dao, compared to those mired in worldly learning or those who have never heard the Way at all, the difference is as vast as heaven and earth.\n\nHaving received the esteemed teachings of Master Fanghu and the handwritten instructions of the Perfected One, which expound the secret language of the Great Return—referring to the teachings of the external elixir—I recall that Master Yi of Zhenyi once studied under the Daoist Li of Taiqing and received these teachings thirty years ago, yet rarely spoke of them. Now, having the opportunity to read them again, I am reminded of Ge Zichuan’s words: *\"Since receiving Master Zheng’s scriptures on the Golden Elixir of the Returned Cinnabar, twenty years have passed. My family has not even a peck of grain in store, and in my poverty, I lack the means to purchase the ingredients. Though I know the method, it is no different from ignorance.\"* Such words are truly sigh-worthy.\n\nMoved by these reflections, I write this preface to record my sense of warning and to dispel doubts for those who hold faith. In response, I compose the *\"Song of the Golden Elixir of the Returned Cinnabar\"* to return to the messenger:\n\nWithin the Palace of Square Pot, an aged immortal elder,\nSeated on a thin mat, the room suffused with white light.\nThe great thousandfold world contained within a hair’s tip,\nMysteriously aligned with the One, abiding in profound silence.\n\nOnce in Nanchang, I met a perfected one,\nWho revealed the elixir’s secrets, unlocking the true.\nRolling and unfolding creation, returning to the primordial vastness,\nMatching yin and yang in a fleeting moment.\n\nThe crucible is not a crucible, the furnace not a furnace—\nHeaven and Earth’s opening and closing share the same pattern.\nFire is the medicine, the medicine is fire—\nSun and moon’s rising and setting know no self or other.\n\nThe azure-clad maid and the white-robed youth,\nIn the bridal chamber, their union consummates the appointed time.\nFrom nothing, something arises—this is the elixir’s ancestor,\nThe true lead, the mother of Heaven and Earth.\n\nRefining mercury into cinnabar, then discarding the lead,\nLike a child grown, the mother returns to dust.\nThe elixir complete, it transforms into gold—the golden liquid,\nTaken into the mouth, one ascends to the celestial steps in broad daylight.\n\nWhy, with white hair, do you still linger in the dusty world?\nThe great medicine lacks resources, the place of practice hard to choose.\nWhen the time comes, enter the chamber and regulate the fire talisman,\nThe work complete, ride the crane to follow Master Fanghu.\n\n**Verse in Return to the True Dao**\nIn response to the Feathered Guest of the Golden Gate, the Perfected One Zhi Xu, Zhen Bai Wei Yi, and the esteemed teachings of Master Fanghu.\n\nThe true of the supreme Dao begins with form and qi,\nEstablishing the Three Powers to nourish the ten thousand kinds.\nSubtle, it returns to the traceless; vast, it knows no bounds.\nAhead, no beginning; behind, no end.\n\nPervading and embodying all things—who can fathom it?\nThe solitary peak stands bare, without obstruction.\nIt engages eyes, ears, nose, and tongue in ceaseless toil—\nHow could there be decay, emptiness, arising, or abiding?\n\nWith a casual gesture, the three bodies are revealed;\nIdle words, though a thousand, contain not a single character.\nFu Xi’s wondrous alignment opened the primordial chaos,\nEstablishing the ultimate for the people, clarifying Heaven’s mandate.\n\nBefore the trigrams, the *Yi* was originally formless;\nBeyond the circle, the Ultimate is not mere emptiness.\nLooking up and down, the patterns are dense—\nKites soaring, fish leaping, all manifest the same brilliance.\n\nNeither forgetting nor forcing, guard your solitude;\nBe only precise, only one, hold to the center.\nUnceasing sincerity finds its resting place—\nHeaven and Earth unite in virtue to complete the supreme work.\n\nThe Perfected One, knowing destiny, values partaking of the mother;\nAttaining emptiness, observing return—this is the elixir’s ancestor.\nTaming and subduing like tigers and dragons,\nHarmonizing concentration and wisdom like Wen and Wu.\n\nGathering emotions to return to nature, merging into the One Origin,\nThe One Origin forgotten, even forgetting is cast aside.\n\nThe three realms gathered into emptiness,\nEmptiness shattered, transcending all peers.\nLet kalpas dissolve like Ganges’ sands—\nUnflickering spirit-light illumines past and present.\n\nMonks have not fathomed virtue’s fullness,\nRaising the koan: “Does a dog have Buddha-nature?”\nDoubt knots tightly, seamless as a sphere,\nLike one who dies utterly before reviving.\n\nSuddenly grasping the intent from the West,\nI trust that he and I are now the same.\nThe mud ox transforms into a lion’s roar,\nNo longer companion to the ten thousand dharmas.\n\nIn every circumstance, all is complete—\nWho dares claim this is the mark of a true man?\nSages, immortals, Buddhas divide their gates,\nYet ultimately arrive home by the same path.\n\nBeyond body and mind, no mystery remains—\nBest to seek true inquiry and real awakening.\nIn boundless vastness, where to find a true teacher?\nWho knows when the profound scriptures are misread?\nSide paths and crooked trails lead many astray,\nClinging to emptiness or delusion breeds folly.\n\nDoubt not yet dispelled, one mistakes awakening;\nOld texts drilled endlessly become mere talk.\nSharp tongues display their wit,\nYet who recognizes the truth of the flower’s silent transmission?\n\nPitiful are the many wild-fox Chan,\nTheir words pure but conduct foul, deluded in true teaching.\nThe immortal’s bond lies in manifesting virtue;\nHeaven’s Dao is impartial—it must favor the worthy.\n\nOur ancestor, the wild old hermit of Pengtou,\nSought the hidden on Wuyi Peak.\nAt times he drew fresh currents from the sacred well,\nNurturing the profound Dao with enriching moisture.\n\nThe feathered guest of Golden Gate, Lord Fanghu,\nOnce sat in our ancestor’s spring breeze.\nThe ancestor said: “Seeing nature is distinct—\nNo need for transmission, wondrous awakening arises on its own.”\n\nLord Fanghu, though advanced in the Dao, still probed its depths.\nOne morning he asked me for the strategy to see nature.\nA long whistle split heaven and earth with spring—\nThe golden crow flew forth as the eastern sky turned white.\n\n---\n\n**Mixed Learning**\n\nBefore the primal beginning, a thing already formed and complete,\nMyriad forms spread forth, all emotions flourish.\nAlone it comes, alone it goes, accomplishing transformations,\nNeither increasing nor decreasing, following every shape.\n\nThrough endless kalpas it endures,\nEncompassing the primordial transformations, latent in the void.\nIn my youth, I wore the scholar’s robe,\nBurning oil through the night, diligently studying the *Yi*.\nA three-foot sword’s radiance once lit the sky,\nThe two demons’ calamities swiftly vanished.\n\nWeary of the turbid world’s six dusts in darkness,\nI awoke from the dream of millet—all illusions stilled.\nThe immortal Shouchang, Iron-Xuan the Elder,\nOnce studied under Master Jin at the sacred well.\nReturning to Qinghua, he opened a realm of peace,\nFeeding me the Dharma-milk to revive my exhaustion.\n\nLater, I followed Master Li,\nAnd heard of Pu Yi and Feng the Recluse.\nThey too studied under Ancestor Jin, continuing the immortal lineage,\nAbiding by Crane Dragon Sands to clarify the supreme principle.\nLightly shod, I went to question them—\n“All dharmas return to the One, but where does the One return?”\n\nAt that time, the Recluse was in silent sitting;\nThunderous force shattered the empty sky.\nHe asked whence I came—\nA pure wind pierced through, dispelling the clouds of delusion.\nVast and clear, I saw the moon in every home,\nIlluminating the original—no words to speak.\n\n---\n\n**Inscription on the *High Wind in the Grove* Portrait**\n\nThe true and constant wondrous essence is originally formless;\nBeyond form, one must bear the burden with strength.\nHolding fast to sun and moon depends on mastery;\nOpening and closing yin and yang, one freely gathers and releases.\n\nThe old immortal of Kongtong, with an icy, snowy demeanor,\nReceived the mind-to-mind transmission and could recall the past.\nOn a clear autumn night, the bright moon hung over the jade terrace,\nWith a staff of goosefoot and cloud-like robes, he wore a crane’s [plume].\n\nMy home is in Junyi, north of the Yuan River—\nA single breath revives the spring light of ten thousand things.\nOnce I stirred wind and thunder to ward off demons,\nLong keeping the star-like radiance of my sword sheathed.\n\nYesterday I visited old friends on Kongtong,\nHoping to halt the sun’s progress and gaze to the eight directions.\nGathering golden essence to refine the Wood’s fluid,\nI sat in the Dipper’s sway, congealing the mysterious frost.\n\nIn this, the wondrous union blends like fish and water;\nAll else is not worth mentioning.\nThe Daoist Dongguo of the Mysterious Capital,\nVainly mimics appearances, laboring the painter’s craft.\n\nFacing this, who says one sees by form?\nOne must seek the original face beyond all images.\nAsking where my original self resides—\nWith a flick of my whisk, I laugh and ride the wind away.\n\n---\n\n**Inscription on the *Transmission* Portrait**\n\nThe supreme Dao is not transmitted by words,\nYet words aid wondrous awakening.\nThus the *Pass of the Celestial Ford* text\nPoints directly to the path of the true origin.\n\nZhong and Lü passed it down to later worthies,\nBranching into northern and southern lineages for a thousand years.\nThe cosmos in hand, they stepped through the mysterious records,\nHalting the sun and moon, opening golden lotuses.\n\nI once followed their fragrant traces, sword at my waist,\nFeasting on tiger’s marrow and dragon’s flesh in a jade pavilion.\nThe Three Flowers faintly suffused with flowing radiance,\nThe four seas vast, I trusted my solitary journey.\n\nYesterday, a lone crane rode the heavenly wind,\nRoaming Mount Song and Hua, surpassing Kongtong.\nThe flute’s notes cut through the green of mountains and waters—\nWho shares my lofty aspirations beyond the world?\n\nThe peach-planting Daoist, profound and serene,\nConduct pure, spirit clear, will noble and refined.\nGathering firewood, boiling stones, he served with diligence,\nStanding in snow, forgetting the body, scorning illusions.\n\nReceiving my *Register of Ascension and Transformation*,\nAt times he entered the sea to seek the dragon’s pearl.\nWhipping thunder, riding qi, he ascended the purple pole,\nGuiding the Dipper’s handle, he returned to the Great Void.\n\nOn the day of reunion in Kongtong after ten years,\nHe had already seen the portrait and recalled the past.\nHow much better to embody the body beyond the body—\nThe subtle, empty, and primordial leaves no trace.\n\n---\n\n**Exhortation to Advance in the Dao**\n\nLeaving home is to transcend the mundane,\nCutting off worldly ties to avoid entanglement.\nCarrying a bowl and gourd, journeying far to find a bright teacher,\nServing with labor, striving for loyal admonition.\n\nAccumulate essence, nourish qi, preserve primal harmony,\nRefine nature, subdue the mind, brighten wisdom’s torch.\nThe inner work’s subtlety values hidden cultivation;\nOutward conduct’s diligence must be fully prepared.\n\nDepart form, abandon craft, dismiss cleverness,\nConceal your light, blend with the world, guard solitude.\nGather the deviant to return to the correct, praising the divine,\nAid beings, benefit life, widely cultivate blessed affinity.\n\nPut others first, cast aside pride and arrogance,\nEndure anger, swallow shame, forget favor and disgrace.\nCoarse clothes, plain food, forsake glory,\nOvercome hardships, dissolve transgressions, erase the ghostly ledger.\n\nWhen blessed affinity and wisdom’s power are both complete,\nYour name is inscribed on the cinnabar terrace, ranked among immortals.\nRiding the void, roaming the spirit, gazing into the boundless,\nLooking down, the vast seas seem like a snail’s trail.\n\nFor kalpas, all kin receive blessings—\nHow could it be only for one’s lord, teacher, or parents?\nEven if past karma generates demonic obstacles,\nWhen retribution ends, the Dao-fruit will still ripen.\n\nWhy do those in this degenerate age, wearing the starry cap,\nFail to awaken and leave their families to seek the profound?\nWillingly drowning in the river of love and sea of desire,\nBound by the shackles of profit and the fetters of fame.\n\nHaving dimmed our original face within,\nWe scheme for external things to pass to other clans.\nWhen the body perishes and all is cast aside,\nKarmic destinies follow—who then shows compassion?\n\nNow I reveal this truth to all fellow learners:\nWealth and poverty, noble and base—each has its measure.\nWho claims cunning schemes bring wealth alone?\nHow many schemers lack even clothes to wear.\nIs there no fool whose halls hang empty?\nYet fools too may have fields near the city walls.\nAll stems from causes planted in past lives,\nOur lot in this one fixed as if by contract.\nFlourishing and decline are ordained by creation—\nWhy toil so tirelessly in grasping greed?\n\nEven householders should study the Chan of forgetting home,\nTurn toward goodness, turn from dust, and seek awakening.\nHow much more those who dwell beyond the world,\nWho ought to seek true joy beyond the mundane.\nTurn back swiftly—do not waste time,\nFor the teachings of immortals and Buddhas are never wrong.\n\nHave you not seen Dan Yang, who taxed half a province,\nThen cast it off like worn-out shoes, never to reclaim?\nA deerskin robe, alms-rice from a hundred homes,\nHusband and wife parted for a thousand miles.\n\nHave you not seen Master Pang, wealthy yet debt-free,\nGold left forever in the sands of Deer Gate Shoal?\nJoyful gatherings, speaking of the unborn,\nDaughter selling fish-traps, son tending oxen.\nThe two elders’ noble ways cut free from profit and desire,\nHonoring the Dao, prizing virtue, scorning worldly currents.\nDo not say such lofty ones are beyond comparison—\nEach person has the share to seek it.\n\nFollowing their example, one naturally looks to the mysterious bond,\nWhy bind the waist and rush to Yangzhou?\nThe prophecy of Hua Lin has stood for a thousand years,\nThe eight-hundred-year cycle now matches its measure.\n\nRecalling when Master Li bestowed the Way of Primordial Unity:\nAt Prince Teng’s lofty pavilion, mid-autumn,\nI bowed again to the immortal mat to receive the Great Return.\nAt midnight, wind and thunder crossed the sea,\nClouds and rain arrived together at the Mysterious Pass.\nSpring’s light entered the earth, golden sprouts grew,\nThe Dipper’s handle circled the heavens, the jade clepsydra ran dry.\nThe moon filled the great void, still he rode the crane,\nSoaring lightly up to Jade Capital Mountain.\n\nThe Dao-Sword\nPure Yang personally transmitted the Dao-Sword’s method—\nNo need for Ou Ye to forge unyielding steel.\nBorn with the body, endowed with life, it moves with subtle skill,\nTaking form at will, its killing qi surges forth.\nSharpened in the ravine, lightning flashes,\nHewing the cassia in the moon, it gathers celestial fragrance.\nSometimes hung beneath South Mountain,\nIt frightens yin-demons into distant hiding.\n\nIn Reply to Master Li\nI had hoped to go to Purple Mystery Abbey at Dragon Gate to refine the divine elixir,\nBut before I arrived, you came—sending this instead.\nYou are the same venerable one of old,\nThough Dragon Gate’s old hermitage has stood a thousand years.\nThe Dao merges with the Emperor of Images at the nameless beginning,\nLearning delves into Fu Xi’s time before the first diagrams.\nGolden qi responds to the season, still advancing the fire,\nMercury’s essence congeals, gradually drawing forth lead.\nWith a single spoonful from the divine crucible, it can divide me,\nThen I shall follow the soaring simurgh to meet the highest immortals.\n\nTang Immortal Luo Gongyuan\nEntering and leaving the imperial chambers at will,\nPlaying with divine powers.\nAt the time, Emperor Ming Huang grew jealous,\nSummoned him to the palace hall, had soldiers lie in ambush and shoot him dead,\nOrdered his burial.\nThe coffin was very light; when opened, he was gone—\nOnly two sandals remained.\n\nOne day, a tribute of oranges arrived. When Emperor Ming Huang cut one open, each segment split into two. He questioned the envoy about this, who replied: \"On the road, I encountered a one-eyed Daoist who asked for an orange but was refused. He merely borrowed it to smell before leaving, and instructed me: 'When you see the Emperor, please bow and convey my regards to Wei Siyuan.'\"\nThe Emperor laughed and said: \"This was Luo Gongyuan.\"\nHis place of cultivation lay in Taihe County at Longmen’s Tai Xuan Abbey. Nearby stood Sanhua Mountain, where the summit served as his ascension site, and halfway up the mountain stood Zixuan Abbey, where he was venerated.\n\n[Responding to Fu’s Letter]\nStaying at Yunyin Mountain, one day I spoke of the three teachings as one family. At that moment, Fu, the Chronicler of Qingyuan Mountain, raised doubts. A month later, we met again, and when I revisited the same topic, he suddenly gained insight. The next day, he arrived in formal robes, bearing incense, to pay respects at the mountain and express gratitude. He then presented eight verses, hinting at his intent to remain in the mountains. I responded in kind:\n\nAbandoning evil, still nurture the sprouts of lasting goodness,\nThe rootless tree bears empty blossoms.\nTurning your head, you are already the Buddha of the Three Bodies—\nWhy seek face-to-face instruction over a hundred yards of tea?\nSaints and mortals observe equally, without self or other,\nSpirit’s clarity and silent illumination pervade the Ganges’ sands.\nSpring brings beauty everywhere—\nWhy retreat to the mountains to escape the world’s splendor?\n\nAfter parting, the Chronicler Fu sent another poem in the same rhyme, and I answered again:\n\nWhere in the primordial chaos can one seek the root or sprout?\nAll is perfectly clear through the Lotus Sutra’s turning.\nWhen shall we share a cup of the Old Man of the East’s wine,\nAnd I brew for you once more the tea of Master Zhao?\nSitting here, moments stretch into a thousand years,\nSeeing through heaven and earth as but a grain of sand.\nAlas, the multitudes never turn their heads—\nIn vain, fleeting life ages through its fleeting springs.\n\nThree Verses in Response to Alchemist Zhibai’s Discourse on Daoist Teachings\nWho recognizes the Great Dharma King of Qingwei?\nHe unfolds the Three Powers and the myriad things.\nFrom the beginning, all dharmas arise from me—\nInverting or grasping them sideways poses no obstacle.\n\nPeople know this Dao as mere emptiness,\nYet who awakens to true emptiness as not empty?\nA single moon suffuses a thousand valleys’ waters,\nIts pure light leaves no trace behind.\n\nWhen the heart-field of the square inch is perfectly clear,\nResponding and transforming everywhere, it remains without action.\nThe deluded see only a thousand-mile journey—\nYet how have the two feet ever moved half a step?\n\n*Song in Response to Hu Zhiguan’s \"Millstone\"*\nA single aperture at the crown admits a pearl,\nTransforming the whole body into flying white snow.\nHere, the iron heart knows no retreat—\nLeft or right, it moves as it wills.\n\nFive Verses in Response to Magistrate Zheng of Baling’s Inscriptions at Yueyang’s Pure Yang Flying Chant Pavilion\nHaving traveled Yueyang, I recognize no one,\nCrossing the vast lake alone, chanting in flight.\nTurning back, the three emergences lie veiled in mist—\nIn an instant, the blue sea becomes mulberry groves.\n\nThe coquettish flower-maidens pity the infant,\nJust as autumn’s midpoint arrives at midnight.\nInverting yin and yang, they conceive a numinous essence—\nAcross the boundless four seas, who can be their teacher?\n\nKnow the season for harvesting herbs, old or young,\nWith the knife and spoon, self-sufficiency is assured.\nWhen all yin dissolves and the dry body is complete,\nConceive the child—trust there will be a son.\n\nFrom the azure vault, a song gathers ten thousand immortals,\nA five-zhang pearl hangs, expounding the profound mystery.\nThe Dao embraces the Supreme Ultimate, returning to the primordial mandate,\nIts wondrous accord with the numinous terrace transcends words.\n\nWho can share the mystery of mysteries?\nWith a laugh, we forget each other beyond the heavens.\nWaving hands, I sing beneath the bright moon,\nDancing the embryo immortal’s triple ascent on the wind.\n\n*Master Yuanyang’s Dharma Discourses, Volume One Concludes*\n*Master Yuanyang’s Dharma Discourses, Volume Two*\n\n**Sixteen Admonitory Gāthās by Zhao Yizhen of Junyi, Compiled by Disciple Liu Yuanran of Zhang-Gan**\n\nThe immortals and sages ever pity the deluded scholar,\nAs a loving mother cherishes her infant child.\nThe heart of the Dao is like a child seeking its mother—\nWhy fear the immortals will not ferry him across?\n\nThe Yellow Emperor once studied under seventy masters,\nYet not all were perfected immortals.\nOnly upon meeting Guangcheng did he fathom the profound mechanism,\nThen realized all prior teachings were not truly intimate.\n\nBefore the cyclical signs took form, there was no image;\nOnce the bodily frame appears, directions arise.\nOur Dao forcibly names those beyond form—\nOne must forget appearances to fathom the eternal truth.\n\nThe Daoist takes the Dao itself as body,\nThe illusory, borrowed frame is not truly intimate.\nSeeking me through form and sound is futile—\nTo speak of years and signs only deepens delusion.\n\nWhen Luo He heard the Dao at ninety,\nHis teacher was but sixteen, a mere youth.\nLearning the dance, he honored those who came before—\nThus he grasped the subtle workings of above and below.\n\nDo not follow the perverse demons of heterodox paths,\nWho parrot teachings to command their rabble.\nEnvious of the worthy, deceiving the common folk,\nThey vie for fame and profit, their self and others like mountains and rivers.\n\nDo not imitate the deluded who lose the true transmission,\nFailing to penetrate the profound mysteries yet slandering the sages.\nFor a time, they play the carefree guest in the world—\nIn heaven, there are no such muddled immortals.\n\nDo not mimic the fox-like Chan of reckless emptiness,\nWho dismiss karma and fortune to flaunt their wit.\nThey merely drum their tongues to startle the deaf and blind,\nHeedless of their future plight in the bitter sea.\n\nDo not follow false masters who mislead later worthies,\nAbsurdly dividing male and female into qian and kun.\nTaking others’ essence and blood as the elixir’s origin—\nHow can swallows and sparrows give birth to hawks?\n\nThe heart’s heart—profound Dao—is hard to transmit;\nThrough borrowed images and written words, it enlightens later worthies.\nAlas for the blind who lack true vision,\nWho twist right teachings with perverse interpretations.\n\nExhausting gold to fill the earth,\nAdding fire to quench a blaze, or springs to cool the cold.\nNothing harms life more than bedroom arts—\nHow many youths of the floating world have they slain?\n\nThe true mercury and lead of pre-heaven and pre-earth,\nFormless and imageless, wondrously penetrate the profound.\nIf you grasp the true message within the formless,\nTimely union will confirm you as an immortal above.\n\nEmbrace the origin, guard the One to establish the root—\nShattering the void is the moment of completion.\nLater learners, scattered, lose the central Dao,\nBewildered by action, stagnant in non-action.\n\nBarely grasping the mechanism yet lacking integration,\nThey insist on pursuing attainment at every moment.\nUnattached when encountering things and circumstances—\nOnly then may you arrive home.\n\nFirst to reach the shore of awakening, no boat is needed;\nWhen wood rots and nails rust, what use is repair?\nMost pitiful are those who later seek the ford,\nLeaning on others’ oars and rudders, gazing at midstream.\n\nAncient sincerity does not lie in fame,\nChasing novelty to please the crowd wins fleeting praise.\nFortune and misfortune, life and death—all are transient lodgings;\nWhy trouble to establish a household?\n\n**To Preceptor Yi and Scribe Qiao, Dear Friends of the Heart,**\nAfter long separation, moved to compose:\n\nThe three teachings open the gate of the Dao’s meaning,\nHeart to heart, with whom can this be discussed?\nHow is it that drifting dust obscures us,\nBefore we trust the heaven-encompassing mirror has dimmed?\n\n**To an Old Friend**\nBrewing tea at the crossroads to bind karmic ties,\nWhen will the blessed fruit of humans and gods ripen?\nBetter to seize the spring wind early,\nAnd take up the golden hoe to till your inch of field.\n\n**Inscribed on the Immortal’s Chessboard**\nBlack and white arrayed, sitting in strategic thought—\nWho knows how many springs and autumns pass in the world?\nYet no one grasps the crucial move within—\nIt lies solely in the immortal elder’s fingertip.\n\n**Viewing the Luxuriant Tea Blossoms on the Trellis, While the Crabapple Alone Remains Unbloomed—**\n**A Reflection Over Wine**\n\nThe trellis teems with seductive crimson, piled like brocade,\nThe reclusive crabapple, shy, refuses to open.\nAs evening comes, facing the wine, gazing upon it—\nFor your sake, I grieve the spring, never draining my cup.\n\n**Two Gāthās in Response to Yuanyang Magistrate Wang’s Inquiry on the Essence of Nature and Destiny**\n\nThere is being, yet it is not being;\nThere is non-being, yet it is not non-being.\nThe autumn moon on the emerald pond,\nScattered stars, a solitary wheel.\n\nThe moon in water can be grasped,\nThe clouds at the sky’s edge can be bound.\nGather them into the gourd—\nThis is the elixir of eternal life.\n\n**Self-Eulogy**\n\nEssence of primordial yang,\nPillar of the Dao’s practice.\nUnconcerned with ostentation,\nIndifferent to praise or blame.\nStanding alone in the vast,\nLike floating clouds and flowing water.\n\n**For the Disciples’ Tonsure and Robing**\n\nI bestow upon you the starry crown,\nFor your head, the primal garb.\nTen thousand hairs enclose,\nThe two modes illumined.\nEmerge with one head raised—\nMajestic, uniquely revealed.\n\nI bestow upon you the crimson robe,\nAs the adornment of your body.\nCloud-skirts refined, rosy pendants soaring—\nEvery limb is covered,\nDare not be unsolemn.\n\nI bestow upon you the jade tablet,\nTo rectify your dignity.\nLet your gaze be unswerving,\nReverent and self-possessed.\nWith concentrated heart, face the divine—\nAs if holding the great scepter.\n\nI bestow upon you the yellow altar,\nTo govern your movements.\nCircling the eight trigrams, pacing the nine palaces,\nStanding like a crane at the court of the origin,\nBowing like a tiger, thus entrusted.\n\n**Preface to the Daily Record**\n\nIn my youth, I sought the Dao from Master Li,\nWho first bestowed upon me a daily record,\nInstructing me to inscribe within it every intention, utterance,\nEncounter, and response to affairs.\nWhat could not be written should not be done;\nOnce done, regardless of success or failure, it must be recorded.\nIf it accords with principle, it aligns with the heart of heaven;\nIf it contravenes principle, it deceives the heart of heaven.\nShould one act rashly without understanding the principle,\nUnwittingly erring—this is a mistake, and the fault is forgivable.\nBut to knowingly act against principle and persist—\nThis is deliberate transgression, a grave sin.\nWorse still, to fabricate falsehoods to conceal one’s faults,\nAnd omit them from the record—this compounds the offense.\n\nFor my master’s intent was this:\nThe human heart is the heart of heaven;\nTo deceive the heart is to deceive heaven.\nThus he titled the record *The Heart of Heaven*,\nAnd further admonished with this gāthā:\n\nThe heart of heaven is one with my heart;\nIf I deceive my heart, I obscure the workings of transformation.\nWhen lifting the brush, I must reflect deeply—\nThe divine and the hidden do not tolerate deception.\n\nSince receiving this teaching, I have upheld it without fail,\nRestraining my conduct from the outset in all dealings.\nDaily, I engage with the realm of the heart,\nSeeking to grasp principle—though it seems impossibly difficult.\nOver time, I gradually penetrated it,\nResponding to things as they arose.\nThough I have not fully aligned with the heart of heaven,\nI have approached the realm of the noble,\nPerhaps by one part in ten thousand,\nAnd avoided the fate of the petty—this is great fortune indeed.\n\nHere the fellow Daoists, steadfast in their resolve and set apart from the common crowd, have formed a karmic bond and found affinity, seeming ready to advance upon the Way. Yet in matters of principle, they have not yet attained thorough clarity, and may still be unwittingly burdened by habitual defilements. At times, they may fail to act when action is called for, or act when restraint is needed—such moments demand careful discernment. Thus, I transmit the teaching of the *Heart of Heaven* as received from my father and master, passing it on in turn.\n\nAh! A nine-tiered terrace begins with heaped earth; a thousand-mile journey starts with a single step. The gateway to the Dao and the foundation of virtue must likewise begin here—this is my hope for those of shared aspiration. The Dao is supreme; only through long and sincere accumulation of effort will one suddenly awaken, the heart fusing with principle, heaven and humanity united in virtue—then one truly knows that cultivating the heart *is* cultivating the Dao.\n\nAt the end of each daily record, how could this suffice to reflect the celestial heart’s seal of approval? The scripture states: “Heavenly nature is human; the human heart is mechanism.” This responds to that, as shadow follows form—nothing is hidden in darkness, nothing concealed in subtlety. Can one not be cautious?\n\nIn the *Discourse on Blessing, Wisdom, and Karma* presented to the Upper Clarity Daoist fraternity, it is said: the ancients taught that on the path between humanity and heaven, cultivating blessing comes first; in the ocean of birth and death, cultivating wisdom is fundamental. Those who focus solely on wisdom gather their nature and illuminate the heart, uphold precepts and stabilize concentration to strengthen wisdom and realize the Dao—thus they may transcend the suffering wheel of birth and death, ascending to immortal rank. Without planting the seeds of blessing, the path remains arduous; how can body and mind attain purity? Those who focus solely on cultivating blessing relieve the world and deliver others, widely practicing expedient means to build a foundation of blessing—thus in future lives they may be reborn among humans or gods, enjoying manifold pleasures. Yet without realizing the Dao, when their postmortem retribution is exhausted, they must return again.\n\nTherefore, the essential path of advancement requires both blessing and wisdom, neither to be neglected. To enrich oneself alone is insufficient; self-benefit and benefiting others ensure mutual fulfillment. In ancient times, the Celestial Worthy of Original Beginning expounded the scriptures, and an entire nation’s men and women received protection and deliverance. Lord Lao cultivated himself, and his virtue became authentic; when he extended cultivation to the world, his virtue became universal. Confucius’ mastery of the self and return to ritual led all under heaven to embrace humaneness—from sincerity of intention and rectification of the heart to governance of the state and peace under heaven, all serve to perfect oneself and others. The Buddha is called the Honored One of Two Perfections because he possessed both blessing and wisdom.\n\nLater, the Sixth Chan Patriarch worked as a pestle-hand, and Chan Master Lingji as a cook—both attained the Dao and subdued karmic dragons. Chan Master Sizhou attained the Dao and subdued the water mother. Patriarch Heavenly Master said: “My elixir is complete; consuming it, I would surely ascend. Yet now I must benefit the nation and the people, eliminating harm and promoting welfare, so that in the future, when I serve the Three Clarities, I may do so without shame.” Thus he entered Shu to subdue demons, distinguishing between humans and ghosts, reviving the salt trade, and bringing prosperity to the state. Master Ge the Immortal often used talismanic water to heal the sick, and through ritual refinement delivered eighty thousand ghostly souls. Immortal Xu of the Capital likewise used talismans and medicine to cure illness; after attaining the Dao, he slew a vicious flood dragon, his merit equaling that of the divine Yu. All endured hardship and spurred themselves to action, cultivating both blessing and wisdom before realizing the Dao.\n\nImmortal Huan Kai practiced the High Leaping Way of the Sun and Moon. Hearing that Master Tao the Recluse had many disciples, he first sought employment as a garden laborer—thus attaining the Dao before cultivating blessing. Perfected Purple Clarity heard of the Great Return of Golden Liquid and traveled widely to perform rituals, relieving the world and delivering others. Only then did he succeed in refinement under the patronage of Minister Jin—thus cultivating blessing before attaining the Dao. From this, we know that while the teachings of immortals, Buddhas, and sages may differ, in their cultivation of self and others, they are one. Yet the cultivation of wisdom and blessing by immortals and Buddhas aims at delivering the world; the retribution of good and evil is verified across three lifetimes. The self-perfection and world-perfecting of sages aim at governing the world; the retribution of good and evil is verified in the present life—this is but a minor difference.\n\nThe scripture states: “Ghosts and spirits bring disaster to the licentious and bless the humble. Those who do good receive a hundred blessings; those who do evil receive a hundred calamities.” This principle of ghostly and spiritual karma, as expounded by sages, is certainly grounded in reason. In my youth, reading books, I understood it to be so. Yet after experiencing worldly affairs and observing past events, some cases defy facile explanation. The great sages Yao and Shun—could they not have ordered heaven and earth and nurtured the myriad things? Yet there came the nine-year flood that drowned the people. Knowing others is wisdom; appointing the capable is governance—yet in managing the flood, they mistakenly employed Gun. King Tang was also a sage, yet suffered seven years of drought; only after self-reproach for six faults did rain come—why did he not act sooner?\n\nAs for the worthy Yan who died young, the bandit Zhi who lived long, and Bo Dao who left no descendants—such cases from ancient times to the present are too numerous to record. Since the outbreak of war, I have observed in villages and hamlets those who for generations were virtuous scholars and cultivated gentlemen, well-versed in the classics and practicing self-cultivation—many remained impoverished, their blessings not manifesting in their own lives but in their descendants. Yet now their lines are extinguished without remnant; were they all unfilial? Meanwhile, those who were treacherous and violent now prosper and flourish. If we test this against the doctrine of present-life retribution for good and evil, it clearly fails. Yet if we apply the doctrine of three-lifetime karma, it is evidently trustworthy. Thus both doctrines should be upheld together to avoid oversight.\n\nIn ancient times, those who perished in floods were buried in fish bellies; in later ages, those who fill ditches and gullies, or suffer in the flames and mire of barbarian lands—how are they different? All are the fixed karma of past lives, meeting their moment to repay karmic debts. Observe today: the intelligent often suffer poverty and early death, while the dull-witted often enjoy longevity and wealth. Why? The intelligent focus solely on literature and disbelieve in karma; when they return again, their intelligence increases, but their poverty deepens.\n\nThe dull-witted, though they do not pursue literature, believe in and venerate good fortune; when they return again, their wealth and longevity increase, while their dullness remains unchanged. A common saying goes: *\"Those who cannot speak rise to high office; those who cannot read amass gold in heaps.\"* There must be a reason for this. If one possesses both intelligence and literary cultivation while also cultivating good fortune, then in the life to come, wealth, nobility, intelligence, and wisdom should all be attained together.\n\nGenerally, all that a person does in life serves as the mold for their next existence. How could the Creator indulge them, merely shaping and pouring through borrowed hands? Some argue that after death, the spirit does not persist, and thus deny the cycles of karma and rebirth, dismissing the Way of Immortals as mere fantasy. This is to obscure one’s own true nature, inviting only the scorn of those beyond the world. When the spirit attaches to form, it becomes human; when a person dies and the spirit does not perish, it is called a ghost. *\"Essence and qi become things\"*—this is form. *\"The wandering soul undergoes transformation\"*—this is the ghost. The ancient sages knew that spirits have emotions and forms, that they can bring fortune or misfortune, blessings or calamities. When villagers perform the *nuo* exorcism, they don their court robes and stand upon the steps, believing this gives the ancestral spirits a place to rest, preventing them from being startled. Yet later scholars still dismiss the affairs of the unseen world and spirits as nonexistent.\n\nThe Qin army did not destroy Confucius’s residence because they heard the sounds of metal, stone, silk, and bamboo music within. If there were no spirits to preside over it, would it truly resound on its own? Master Shao’s poem says:\n*\"The body comes after Heaven and Earth,\nThe mind exists before them.\nHeaven and Earth emerge from me—\nWhat else is there to say?\"*\nHow then can one claim the spirit can be extinguished?\n\nThe Yellow Emperor attained the Dao and rode a dragon into the heavens, as recorded in the annals. Master Zhu’s poem reads:\n*\"The golden tripod coils with dragon and tiger,\nThree years to nurture the elixir of spirit.\nWith a single dose of the knife’s measure,\nWhite daylight births wings and feathers.\"*\nCan one still call the Way of Immortals mere fantasy?\n\nIn the past, there were those who debated against immortals yet later encountered them, those who slandered the Buddha yet ultimately followed him, and those who denied ghosts yet ultimately saw them. Their words reached their limit. These are all biased views of self and others, not worth debating. When some in this world question the affairs of immortals and spirits or the retribution of good and evil, their doubts may lead to neglect of moral exhortation and restraint. Thus, I have broadly cited earlier teachings to enlighten them.\n\nMoreover, a person lives in this world with limited time, chasing endless things. When they close their eyes, it is like a dream, yet the six paths of rebirth are distinct. The common folk, ignorant of this, indulge their desires, mistaking suffering for joy, as if drunk and never awakening. For those of us who have heard this Way, it is fitting to strive diligently. To act without attachment to action—this is the true work of a great person. How can one follow worldly customs, chasing illusory conditions, and waste this life? It is truly lamentable. Therefore, I first present the teaching of cultivating both fortune and wisdom, hoping to encourage like-minded companions.\n\nI have written this to seek the opinion of my friend, Master Wu Ziyu, the Daoist alchemist, and to record the insights of those who have attained the Dao and the lofty immortals. Do you agree or not?\n\n**Preface to the Reprinting of the *Daodejing* and *Wenshi Jing* by the Scholars of Wudang Palace in Huguang**\n\nThe scriptures of the Daoist Canon all serve to transform the people toward goodness and ultimately toward the Dao. Having been transmitted for generations, many recite them. Yet among the works of the Most High Lord Lao, the *Daodejing*, and the Perfected Lord Guan Yin, the *Wenshi Jing*—both of which delve into the origins of nature and destiny, the workings of creation, and the mysteries of spirits—few recite them. Is this because their profound principles are too subtle to fathom? Or is it due to the scarcity of texts after the ravages of war?\n\nRecently, Master Zhen Yi traveled from Qionglin to the sacred peaks of Song and Hua, gathering lost scriptures, and was moved to this lament. The Daoist scriptures passed through Jiangxia, and so he came to Wudang Palace, where he led the scholars to join efforts in carving and printing them, aiming to widely circulate these texts. Thus, I have written this preface.\n\nThe *Daodejing*, with its five thousand words, encompasses the great transformation; the *Guan Yinzi*, with its one hundred and eighty chapters, further expounds the subtle principles. These two books have been transmitted together, serving as the model for all sages. The mind is awakened through the classics—without the classics, the mind cannot be seen. The Dao is not transmitted through words—yet through words, the Dao is revealed. If one penetrates their depths, one can grasp what lies beyond words, spiritually transforming the people and establishing the imperial order.\n\nToday, the Son of Heaven has already annotated these texts to broaden the sagely teachings and further their circulation in this enlightened age. Now, as we seek to renew their printing, collective effort is needed to bring this to completion. We have also included the lost writings from the Guanlou Temple, like the teachings emerging from the azure heavens and the floating paradise. May all who encounter these scriptures revere the Dao and honor virtue, all entering the gate of myriad mysteries. And may the virtuous scholars know how to wield the ancient to govern the present—this is the teaching without words.\n\n**Eulogy in Sitting Transformation**\n\nWithdrawing from the world yet harmonizing with its light, illusions end when conditions fade—alone, one transcends.\nA pure wind pervades all realms, unbounded;\nThe radiant sun hangs in the sky, illuminating the great thousand worlds.\n\n**End of the Lower Scroll of *Fayu* by Master Yuanyang**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "原阳子法语 经名：原阳予法语。 明赵宜真撰，刘渊然编集。 二卷。 底本出处：《正统道藏》太玄部。 原阳子法语卷上 浚仪赵宜真撰 门人章贡刘渊然编集 还丹金液歌并叙 唯道集虚，本无二致。 而修炼有内丹外丹之分者，缘遇不同，功用少异，而造道则一也。 所谓内者，自性法身本来具足，不假於外，自然之真。 其进修之功，则摄情归性，摄性还元。 有为之为，出於无为，无证之证，所以实证，胎圆神化，脱体登真。 诀曰：一灵真性号金丹，四假为炉炼作丸。 是为真一、为玄一，又名内丹也。 所谓外者，幻假色身未免败坏，必资外药，点化成真。 其服炼之功，则取日月之精华，夺乾坤之造化。 刀圭入口，情欲顿消，骨肉都融，形神俱妙，白日冲举，上宾玉清。 诀曰：木液本自丹砂出，金炼木液还丹体。 丹复化金，金而液之，是为还丹、为金液，又名外丹也。 曰内曰外，又各有内外之说焉。 摄情归性，本之於外； 摄性还元，本之於内。 性寂情空，则非动非静，更无内外矣。 此内丹之所谓内外也。 内存木液以为祖，外假真铅以制之。 内药既伏，则外药委弃，亦无内外矣。 此外丹之所谓内外也。 但内景微妙，无形无名，圣师不得已，而假外丹之名象以譬之，发明其理，使人易悟，故亦谓之金液还丹。 孰知末学泥於名象，而返致疑。 或者以丹道有内外之说，似乎多岐，未知孰是。 夫此道如一大城，四方来者如就傍蹊曲径，则多涉程期，甚至迷而他适。 若由正路坦途，有从东门入者，有从南西北门入者，及到城中则一也。 四方门路，复何有哉。 释有念佛而入者，有参禅而入者，积一千八百公案，及到悟处，参念俱无。 道有修内丹而进者，有炼外丹而进者，演三千六百法门，及其证道，修炼俱无。 公案法门皆非所有，如得鱼忘筌，得兔忘蹄，乌可以彼此而是非之。 昔天尊说法万八千篇，世尊说经五千余卷，有若太繁。 至东华开化，独显全真，达磨西来，不立文字，有若太简。 然悟则头头是道，无简亦无繁，迷则处处暗途，愈求而愈远矣。 又乌可以繁简而去取之。 或者学非其道，妄释丹经，引证《易》曰一阴一阳之谓道，乾道成男，坤道成女。 而以人之男女象天地，为鼎炉，取其阴阳以为药物。 不知大道本无男女之象，仙师托象为喻者，盖指先天对待之理，非后天形质之谓。 诀曰：可见者不可用，可用者不可见。 正内丹药物之旨也。 先达诗云：一物元来有一真，一身还有一乾坤，须知万物备於我，肯使三才别立根。 仙师亦云：自家身裹有夫妻。 又云：一夫一妇将六儿。 皆谓一身之中，具此造化，不自外来。 请举一二内丹之成道者证之。 佑圣真君，七岁入太和山修行冲举。 虚靖天师亦七岁，入上清宫修行尸解。 当时何从而得药物乎？ 其为自足於己，非求之於他人者，灼然可知。 若执邪见，去道远矣。 如黄界赤书等文，本为有家者节欲养生而设，后人因之返以纵欲戕生，可不戒之。 至於外丹大药，亦不自彼我人身而得，虽世间五金八石，皆天地后生有质之物，尤非所用，绿此药本无，乃自有质之中取其气液，无中生有者是也。 诀曰：有象不堪为伴侣，无质生质号还丹。 流俗罔知，或以为勾点左术，而谤议正道，是乃自速厥辜，当堕无间矣。",
      "translated_text": "**The Teachings of Master Yuanyang**\n\n**Title:** *The Teachings of Master Yuanyang*\n*Compiled by Zhao Yizhen of the Ming Dynasty, edited by Liu Yuanran. Two scrolls.*\n*Source text from:* *Daoist Canon of the Zhengtong Era, Supreme Mystery Section*\n\n**Scroll One of *The Teachings of Master Yuanyang***\n*Composed by Zhao Yizhen of Junyi, compiled by his disciple Liu Yuanran of Zhanggang*\n\n**Song of the Returned Elixir and Golden Liquor, with Preface**\n\nThe Dao gathers in emptiness, fundamentally without duality. Yet in cultivation, there are distinctions between internal elixir (neidan) and external elixir (waidan), arising from differing encounters and slight variations in function, though the attainment of the Dao remains one.\n\nWhat is called \"internal\" refers to the inherent completeness of the Dharma-body of self-nature, not reliant on externals, the natural truth. The work of advancement lies in gathering emotions into nature and returning nature to the origin. The doing of doing arises from non-doing; the realization of non-realization is true realization. When the embryo is perfected and spirit transforms, the body is shed, and one ascends to transcendence.\n\nThe oral instruction states:\n*A single numinous nature is called the Golden Elixir,\nThe four illusions serve as the furnace to refine it into a pill.*\nThis is the True One, the Mysterious One—also named the internal elixir.\n\nWhat is called \"external\" pertains to the illusory, impermanent body, inevitably subject to decay, which must rely on external medicine to be transmuted into truth. The work of ingestion and refinement involves capturing the essence of sun and moon, seizing the creative power of Heaven and Earth. When the medicinal spoon enters the mouth, passions and desires instantly dissolve; bones and flesh wholly fuse. Form and spirit become wondrous, and one ascends in broad daylight to join the Jade Clarity.\n\nThe oral instruction states:\n*The Wood Fluid originally issues from cinnabar,\nRefining the Wood Fluid returns it to the elixir’s body.*\nThe elixir reverts to gold, and gold is liquified—this is the Returned Elixir, the Golden Liquor, also named the external elixir.\n\nWhether termed internal or external, each further contains internal and external aspects. Gathering emotions into nature originates externally; returning nature to the origin originates internally. When nature is quiescent and emotions are empty, there is neither movement nor stillness, and no longer any internal or external—this is the internal and external of the internal elixir.\n\nInternally, the Wood Fluid is preserved as the ancestor; externally, true lead is borrowed to restrain it. Once the internal medicine is subdued, the external medicine is discarded, and there is likewise no internal or external—this is the internal and external of the external elixir.\n\nYet the internal landscape is subtle and wondrous, formless and nameless. The sagely teacher, out of necessity, borrows the names and images of the external elixir to illustrate its principles, making them easier to comprehend, hence also calling it the Golden Liquor Returned Elixir. Who would have known that later learners would cling to names and images, only to generate doubt? Some, upon hearing of the internal and external divisions in elixir arts, assume multiplicity and confusion, uncertain of what is correct.\n\nThis Dao is like a great city. Those who approach from the four directions, taking winding side paths, endure long journeys and may even lose their way. But if one takes the main road, whether entering from the east, south, west, or north gate, upon reaching the city, all are one. What then remains of the four directional paths?\n\nIn Buddhism, some enter through recitation of the Buddha’s name, others through Chan meditation. After exhausting the eighteen hundred koans, upon awakening, both recitation and meditation vanish. In Daoism, some advance through internal elixir cultivation, others through external elixir refinement. After traversing the three thousand six hundred dharma gates, upon realizing the Dao, both cultivation and refinement dissolve. Koans and dharma gates are no longer needed—like forgetting the trap once the fish is caught, or the snare once the rabbit is trapped. How can one then argue over right and wrong?\n\nIn ancient times, the Heavenly Worthy expounded eighteen thousand scriptures; the World-Honored One preached over five thousand sutras—perhaps too abundant. Later, when Donghua revealed the Complete Perfection teachings, or Bodhidharma came from the West without establishing texts, it may have seemed too sparse. Yet in awakening, every phenomenon is the Dao—neither sparse nor abundant. In delusion, every path is dark, and the more one seeks, the further one strays. How can one judge based on abundance or sparsity?\n\nSome, lacking proper learning, misinterpret elixir scriptures, citing the *Book of Changes*: \"The alternation of yin and yang is called the Dao,\" and \"The way of Qian becomes male; the way of Kun becomes female.\" They take human male and female as symbols of Heaven and Earth, using them as the crucible and furnace, extracting yin and yang as medicinal substances. They do not realize that the Great Dao fundamentally has no male or female imagery. When immortals employ symbols as metaphors, they refer to the principle of primordial interdependence, not the forms of the posterior heaven.\n\nThe oral instruction states:\n*What is visible cannot be used;\nWhat can be used is not visible.*\nThis is the essence of the internal elixir’s medicinal substances.\n\nA poem by an earlier master says:\n*One thing originally has one truth,\nOne body also contains a Heaven and Earth.\nKnow that the myriad things are complete within me—\nHow could the Three Powers establish separate roots?*\n\nImmortal masters also say:\n*Within one’s own body, there is husband and wife,*\n*One man and one woman raise six children.*\nAll refer to the creative power inherent within the body, not derived from without.\n\nLet us cite one or two examples of those who attained the Dao through internal elixir. Lord You Sheng, at seven years old, entered Mount Taihe to cultivate and ascend. Master Xu Jing also at seven entered the Upper Clarity Palace to cultivate and achieve liberation from the corpse. From where did they obtain their medicinal substances? Clearly, they were self-sufficient, not seeking from others.\n\nThose who cling to perverse views are far from the Dao. Texts like the *Yellow Register* and *Red Writings* were originally composed for householders to practice restraint and nurture life, yet later generations misused them to indulge desires and harm life—how can one not be warned?\n\nAs for the great medicine of the external elixir, it is also not obtained from another’s body. Though the five metals and eight minerals of the world are posterior heaven’s substantial things, they are not used. The medicine is fundamentally non-existent, extracted as qi and fluid from the insubstantial within the substantial—this is the arising of something from nothing.\n\nThe oral instruction states:\n*What has form cannot be a companion;\nWhat generates form from formlessness is called the Returned Elixir.*\n\nThe common crowd, ignorant of this, may regard it as alchemical trickery, slandering the true Dao. Such people hasten their own guilt and will fall into the uninterrupted hell.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1237,
      "start_sentence": 0,
      "end_sentence": 60,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.469266414642334,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\原阳子法语.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "或者以心即道也，道则无形无象，而外丹无质生质，似无交涉，且执於有作，宁免落空。 试以医术论之。 人有为风邪所中，或为划犬所啮者，其伤在於形气，而其证乃能使心痛神迷，颠狂谵妄，不记人事。 又有为惊忧思虑所恼，致怔忡颠狂者，其伤与证皆在於心，及服外药理其形气，而能使心神安静，非有交涉之理，焉能至是。 盖太极未判，函三为一，才有动静，便分阴阳，品物流形，而各具太极，理气相须，一本乎道，有无相制，所以然也。 治炼外丹，虽属有作，得而服之，全无所为，不须修习，即形返太无，神归大定，复还太极混然之初，而与道合真矣。 原其受生，则赋命阴阳，陶形天地，囿乎二气五行之中。 及其证道，则把握阴阳，挈持天地，而超乎二气五行之外，形不可得而毙，神不可得而逝。 如以火炼金，金既出矿，复令入矿，不可得也。 宁兔落空？ 或者又疑肉身，未信其可腾化。 夫以神异之事，质之寻常之见，诚不能无疑。 且如龙化虎变，尚可以蹈虚空； 苋菹部鳖，朱草剖人，亦可以分神，浮气散形。 老枫化为羽人，朽麦化为蝴蝶，自无情而之有情也。 贤女化为贞石，山蚯化为百合，自有情之无情也。 是故土木金石，皆有情性精魄，比之虫兽草木，皆能变化无妨。 人独灵於万物，形肖两仪，道参三极，已是半仙。 丹则夺造化之巧，盗天地之和，人又得以饵之，宜其滓秽消融，如冰雪之释，即形化气，气化神，神还虚，而顿超圣地，岂非最上一乘之基乎。 昔太上老君学於无上元君，首云：学者审欲成仙，不服还丹金液，徒自苦耳，为寒温风湿鬼气所击，虽司命弗能救也。 合作神丹，早自防卫，劳苦须臾，一成便仙，乐可央乎。 粤自周秦汉晋唐宋以前，诸大仙之证道宾空者，莫不由之。 其过化之处，则有丹岩、丹室、丹井、丹泉、丹炉、药臼，皆迨今可见。 其着述之书，则有《太清丹经》、《抱朴火记》、《草衣歌颂》，迨今可考。 若以寻常方术议之，而未信其道，是犹酰鸡不知有天地之大也。 柰何智者滞於顽空，或流豁达，昧者执於偏见，误入傍蹊。 或有乍入玄门，罔知参学，便尔枯坐。 或事久立，或学搬运，或为观想，未能制心而强抑之，久则发为颠狂。 或无知妄诞，厮挺争强。 或专学口鼓，驰逞辩辞。 或略有半见一知，便尔夸能傲俗。 或未能真参实悟，便立门风，致人尊奉。 或盗窃灵文，冒名顶振，好为师范，鼓眩盲聋。 又有或专斋戒，或学辟谷，或尚怪形，或为异服。 在俗多所推重，於道了不相干。 古人有资生治产者，俄而冲举； 有饮酒饵荤者，倏而仙去。 盖其存心物外，混俗潜修，盖非常人所能测，乌可以形迹求之哉。 噫，道之不明不行也，未有甚於此。 或不知察，乃相与议曰：某以进道而病，某以修炼无成，某以服食而毙，从而以道为不可学，并耻於谈。 而不知古今之登真成道者，不可胜纪。 若以误者、无成者、无知者一槩而论，是犹因咽而废食。 知其然者，而不知其所以然者。 大抵参学之难有四，进道之难有十，不可不知也。 何则？ 一曰道路修阻，江湖风波，人海茫茫，孰可师问。 二曰寒暑切身，朝夕所窘，学未有闻，灾患不测。 三曰昧者诈装高道，知者缄默混尘，学者未能知人，多误参礼。",
      "translated_text": "Some may claim the mind is the Dao itself, yet the Dao is formless and imageless, while the external elixir generates form from formlessness—how could they intersect? Moreover, clinging to artificial effort risks falling into emptiness.\n\nLet us consider the analogy of medicine. When one is struck by wind-evil or bitten by a rabid dog, the injury lies in the physical *qi*, yet the symptoms may induce heart pain, mental confusion, delirium, or loss of consciousness. Conversely, when one is afflicted by shock, sorrow, or excessive thought, leading to palpitations or madness, the injury and symptoms both reside in the heart. Yet by administering external medicine to regulate the physical *qi*, the heart and spirit may be calmed—how could this occur without mutual influence?\n\nBefore the Supreme Ultimate divided, the Three were enfolded in One. At the first movement, Yin and Yang separated, and the myriad things took form, each possessing its own Supreme Ultimate. Principle and *qi* depend on one another, rooted in the Dao; existence and non-existence restrain each other—this is the reason.\n\nThough the refining of the external elixir involves artificial effort, once obtained and ingested, it requires no further action. No cultivation is needed: the physical form returns to primordial nothingness, the spirit attains great stillness, and one reverts to the undifferentiated state of the Supreme Ultimate, merging with the true Dao.\n\nOriginally, in receiving life, one is endowed with Yin and Yang, shaped by Heaven and Earth, confined within the two *qi* and five phases. Yet in realizing the Dao, one grasps Yin and Yang, wields Heaven and Earth, and transcends the two *qi* and five phases—form cannot decay, spirit cannot depart. Like smelting gold from ore, once refined, it cannot return to its original state. How then could one fall into emptiness?\n\nOthers may doubt whether the physical body can ascend and transform. To judge wondrous matters by common perception is indeed cause for skepticism. Yet dragons transform into tigers, and one may tread upon empty space; water chestnuts and turtles, red herbs and men, may divide their spirits, disperse their *qi*, and scatter their forms. An old maple becomes a feathered immortal; rotten wheat becomes a butterfly—these are transformations from the insentient to the sentient. A virtuous woman turns to stone; a mountain earthworm becomes a lily—these are transformations from the sentient to the insentient. Thus, earth, wood, metal, and stone all possess sentience, essence, and spirit, and like insects, beasts, grasses, and trees, they may undergo change without hindrance.\n\nHumans alone are the most spiritually endowed of all things, their forms mirroring the Two Modes, their Dao encompassing the Three Ultimates—already half-immortal. The elixir seizes the ingenuity of creation, steals the harmony of Heaven and Earth. When humans ingest it, their impurities dissolve like melting ice and snow; the form transforms into *qi*, *qi* into spirit, spirit returns to emptiness, and one suddenly ascends to the sacred realm. Is this not the foundation of the supreme vehicle?\n\nIn ancient times, the Most High Lord Lao studied under the Supreme Primordial Sovereign, who first declared: *\"Those who wish to become immortals yet do not ingest the Returned Elixir and Golden Liquid merely torment themselves in vain. Struck by cold, heat, wind, dampness, or demonic *qi*, even the Controller of Destiny cannot save them. Refine the divine elixir early to guard against harm. A moment’s labor yields eternal joy—once perfected, one becomes an immortal.\"*\n\nFrom the Zhou, Qin, Han, Jin, Tang, and Song dynasties onward, all great immortals who realized the Dao and ascended to emptiness did so by this means. The sites of their transformations—cinnabar cliffs, elixir chambers, alchemical wells, sacred springs, crucibles, and mortar stones—remain visible to this day. Their writings, such as the *Great Clarity Scripture of the Elixir*, the *Embracing Simplicity Record of Fire*, and the *Songs of the Grass-Clad*, can still be examined.\n\nTo dismiss this as mere common sorcery is like a mayfly in vinegar, unaware of the vastness of Heaven and Earth. Alas, how the Dao has become obscured and unfulfilled! Some, lacking discernment, cling to stubborn emptiness or drift into reckless abandon; the ignorant, bound by prejudice, stray onto side paths.\n\nSome, newly entered into the mysterious gate, fail to seek instruction and instead sit in rigid stillness. Others stand for long hours, practice *qi*-circulation, or engage in visualization, forcibly suppressing the mind until madness ensues. Some, ignorant and deluded, boast and contend; others master only empty rhetoric, flaunting their eloquence. A few, with half-baked insights, boast of their abilities and scorn the world; lacking true realization, they establish sects and demand veneration. Some steal sacred texts, assume false identities, and pose as masters, deceiving the blind and deaf.\n\nOthers obsess over fasting and abstinence, practice grain avoidance, adopt bizarre appearances, or wear strange attire. Though the world may revere them, they have no connection to the Dao. Ancient immortals managed property and wealth, yet suddenly ascended; some drank wine and ate meat, yet swiftly attained transcendence. Their minds dwelled beyond the material, blending with the world while cultivating in secret—beyond the comprehension of ordinary people. How can one judge them by outward appearances?\n\nAlas, the Dao’s obscurity and failure to flourish have never been worse. Some, failing to examine the truth, remark: *\"So-and-so fell ill from pursuing the Dao; so-and-so gained nothing from cultivation; so-and-so perished from ingesting elixirs.\"* They conclude the Dao is unlearnable and shameful to discuss. Yet they do not know that from ancient times to the present, those who attained truth and realized the Dao are beyond counting. To generalize from the misguided, the unsuccessful, and the ignorant is like choking and abandoning food altogether.\n\nThose who know *that* it is so, yet do not know *why* it is so, must understand the four difficulties of seeking instruction and the ten challenges of advancing in the Dao.\n\nWhat are they?\nFirst, the paths are perilous: rivers and lakes are treacherous, the sea of humanity vast—whom can one ask as a teacher?\nSecond, cold and heat press upon the body, daily hardships oppress—before learning anything, unforeseen disasters may strike.\nThird, the ignorant feign lofty attainment, while the wise remain silent and blend with the dust. Seekers, unable to discern true teachers, often pay homage to the wrong ones.",
      "overlap_context": "s, they are not used. The medicine is fundamentally non-existent, extracted as qi and fluid from the insubstantial within the substantial—this is the arising of something from nothing.\n\nThe oral instruction states:\n*What has form cannot be a companion;\nWhat generates form from formlessness is called the Returned Elixir.*\n\nThe common crowd, ignorant of this, may regard it as alchemical trickery, slandering the true Dao. Such people hasten their own guilt and will fall into the uninterrupted hell.",
      "start_char": 1237,
      "end_char": 2463,
      "start_sentence": 61,
      "end_sentence": 108,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.96832251548767,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\原阳子法语.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "四曰真师虽遇，志行未孚，难以与进，或虽与进而授学未备，幸而学备，年齿迈矣。 此其为参学之难也。 一者早遇真师，开明正道。 二者果有德行，上合天心。 三者发弘誓愿，普济生灵。 四者依大福力，方免障魔。 五者有其镃基，际其缘会。 六者结交仙友，志行相孚。 七者屏绝尘纷，栖身清静。 八者饮食有节，起居有常。 九者谨口力行，不招谤议。 十者寅奉神真，精诚弗怠。 此为进道之基，尤难能也。 二难之中，苟亏其一，难获全功。 如陶忆居《登真隐诀》，备陈修炼禁戒之事，《天台止观》，《圭峰修证仪》，亦具明魔事，预备不虞。 今人劣於参学，速於求成，多见其不知量也。 然或有能尽其道，而犹不免於祸害者，如释迦文佛割切肢体，定光古佛刺配南安，颜回短命，子路为醢，公冶缧绁，伯牛有疾，张果为纣所击，郭璞为敦所刑，紫阳三遭徒刺，清庵卒梗於茶。 虽皆患难不能移，死生非所有，要知骨肉永融，难逃定业。 经曰：陆行不避兕虎，入军不避甲兵。 盖为道成者云耳，岂学道者所遽能哉。 且尝闻紫清白真人云游九年，辛苦万状，方遇真师。 又二十年，方得寄食洪都金丞相府，潜修十年，功成仙去。 顾前代仙佛圣贤，尚尔魔难不一，况学者乎，而又不可病其难而易其志。 凡为道者之学仙佛，亦犹儒者之希圣贤，只合坚心一志，勤而行之，若夫成功则天也，亦奚容固必哉。 然此妙道一历耳根，永为圣种。 故关尹真人曰：闻道於朝，可死於夕。 盖谓学者虽未、能造夫体道之极功，而校之俗学与未学者，亦大有径庭矣。 伏蒙方壶赞教，真人赐以手书，举似玄迪秘语，乃大还外丹之说也。 宜真亦尝师太清道士李先生，得之已三十年，鲜有谈及者。 兹又得以披诵，因记稚川葛真人曰：自承郑君还丹金液之经，今二十年，家无担石之储，贫苦无用买药，徒知其方，与不知者正同。 可为长叹之语。 有感而序，于以识警策之意，释信向之疑。 仍赋还丹金液歌，以复将命者。 惟真人积学老成，酖酣道妙，幸一采览而有以教之，实所愿闻也。 其歌曰： 方壶宫中老仙伯，燕坐薄团室生白。 大千沙界纳毫端，妙契一元守渊默。 我昔南昌遇至人，曾闻丹诀能通真。 卷舒造化还溟涬，匹配阴阳在时顷。 鼎非鼎，炉非炉，乾坤阖辟同规模。 火即药，药即火，日月升沈无彼我。 青衣蕊女素练儿，洞房媒合成烟期。 无中生有为丹祖，便是真铅天地母。 制汞成丹还弃铅，绝似儿成母归土。 丹成化金金液之，到口白日登天墀。 胡为皓首犹尘世，大药无资难择地。 会当入室调火符，功成驾鹤从方壶。 真道归一偈 奉答金门羽客致虚贞白惟一真人方壶赞教方尊师。 至道之真肇形气，建立三才资万类。 细归无朕大无垠，前瞻无首后无际。 周行体物孰能达，独露孤峰没遮蔽。 会教眼耳鼻舌忙，宁有坏空成住累。 等闲一指见三身，谩说千言无一字。 羲皇妙契开鸿蒙，因民立极明降衷。 画前有易本无象，圈外无极原非空。 仰观俯察文理密，鸢飞鱼跃昭着同。 勿忘勿助慎其独，惟精惟一执厥中。 至诚不息安所止，天载合德成极功。 真人知命贵食母，致虚观复为丹祖。 狞威制伏如虎龙，定慧燮调比文武。 摄情还性归一元，元一并忘忘亦去。",
      "translated_text": "Fourth, even if one encounters a true teacher, if one’s aspirations and conduct are not yet worthy of trust, it is difficult to advance together. Or though one may advance, the teachings imparted may be incomplete. Should one, by good fortune, receive the full transmission, one’s years will have already advanced. Such are the difficulties of seeking instruction.\n\nThe ten challenges of advancing in the Dao are these:\nFirst, to meet a true teacher early and have the correct Way revealed.\nSecond, to possess virtue and conduct that align with the heart of Heaven.\nThird, to make a great vow to universally deliver living beings.\nFourth, to rely on the power of great merit to avoid demonic obstacles.\nFifth, to have the foundational capacity and encounter the right conditions.\nSixth, to form bonds with immortal companions whose aspirations and conduct are mutually trustworthy.\nSeventh, to withdraw from worldly distractions and dwell in purity and stillness.\nEighth, to regulate diet and maintain regular daily rhythms.\nNinth, to guard one’s speech and act with diligence, avoiding slander and criticism.\nTenth, to reverently serve the divine immortals with unwavering sincerity.\n\nThese are the foundations of advancing in the Dao, and they are exceedingly difficult to fulfill. Should even one of these ten be lacking, it is hard to achieve complete success. As Tao Hongjing’s *Dengzhen Yinjue* meticulously sets forth the precepts and prohibitions of cultivation, and works like the *Tiantai Zhiguan* and *Guifeng Xiuzheng Yi* clearly explain demonic obstacles and prepare for the unforeseen, so too must the practitioner be vigilant. Yet today, many are deficient in seeking instruction but hasty in seeking results, often failing to recognize their own limitations.\n\nNevertheless, there are those who fully dedicate themselves to the Way yet still cannot escape misfortune. For instance, Śākyamuni Buddha endured the severing of his limbs; the ancient Buddha Dingguang was exiled to Nan’an; Yan Hui died young; Zilu was made into mincemeat; Gongye was imprisoned; Boniu suffered illness; Zhang Guo was struck by King Zhou; Guo Pu was executed by Dun; Master Ziyang endured three banishments; and Qing’an met his end over tea. Though none of these calamities could sway their resolve, and life and death were not theirs to control, it remains true that flesh and bone are bound by karmic destiny. As the scriptures say: *\"One who walks on land does not avoid rhinoceroses and tigers; one who enters battle does not shun armor and weapons.\"* Such is the way of those who have attained the Dao—how could it be easily achieved by mere students?\n\nI have heard that the Perfected One Bai Ziqing of Purple Clarity wandered for nine years, enduring countless hardships, before finally encountering a true teacher. Another twenty years passed before he found refuge in the household of Prime Minister Jin of Hongdu, where he practiced in seclusion for a decade before achieving immortality and ascending. If even the sages, buddhas, and worthies of antiquity faced such varied demonic trials, how much more so must students? Yet one must not falter in difficulty or waver in resolve.\n\nFor those who pursue the Dao and seek to become immortals or buddhas, it is much like the Confucian scholar’s aspiration to become a sage. One must simply steadfastly commit to the path and practice diligently. As for success, that is a matter of Heaven—how can one insist upon it? Yet once this wondrous Dao enters the ear, it becomes an eternal seed of sagehood. Thus, the Perfected One Guan Yin said: *\"To hear the Dao in the morning is to be ready to die by evening.\"* Though the student may not yet attain the ultimate fruition of embodying the Dao, compared to those mired in worldly learning or those who have never heard the Way at all, the difference is as vast as heaven and earth.\n\nHaving received the esteemed teachings of Master Fanghu and the handwritten instructions of the Perfected One, which expound the secret language of the Great Return—referring to the teachings of the external elixir—I recall that Master Yi of Zhenyi once studied under the Daoist Li of Taiqing and received these teachings thirty years ago, yet rarely spoke of them. Now, having the opportunity to read them again, I am reminded of Ge Zichuan’s words: *\"Since receiving Master Zheng’s scriptures on the Golden Elixir of the Returned Cinnabar, twenty years have passed. My family has not even a peck of grain in store, and in my poverty, I lack the means to purchase the ingredients. Though I know the method, it is no different from ignorance.\"* Such words are truly sigh-worthy.\n\nMoved by these reflections, I write this preface to record my sense of warning and to dispel doubts for those who hold faith. In response, I compose the *\"Song of the Golden Elixir of the Returned Cinnabar\"* to return to the messenger:\n\nWithin the Palace of Square Pot, an aged immortal elder,\nSeated on a thin mat, the room suffused with white light.\nThe great thousandfold world contained within a hair’s tip,\nMysteriously aligned with the One, abiding in profound silence.\n\nOnce in Nanchang, I met a perfected one,\nWho revealed the elixir’s secrets, unlocking the true.\nRolling and unfolding creation, returning to the primordial vastness,\nMatching yin and yang in a fleeting moment.\n\nThe crucible is not a crucible, the furnace not a furnace—\nHeaven and Earth’s opening and closing share the same pattern.\nFire is the medicine, the medicine is fire—\nSun and moon’s rising and setting know no self or other.\n\nThe azure-clad maid and the white-robed youth,\nIn the bridal chamber, their union consummates the appointed time.\nFrom nothing, something arises—this is the elixir’s ancestor,\nThe true lead, the mother of Heaven and Earth.\n\nRefining mercury into cinnabar, then discarding the lead,\nLike a child grown, the mother returns to dust.\nThe elixir complete, it transforms into gold—the golden liquid,\nTaken into the mouth, one ascends to the celestial steps in broad daylight.\n\nWhy, with white hair, do you still linger in the dusty world?\nThe great medicine lacks resources, the place of practice hard to choose.\nWhen the time comes, enter the chamber and regulate the fire talisman,\nThe work complete, ride the crane to follow Master Fanghu.\n\n**Verse in Return to the True Dao**\nIn response to the Feathered Guest of the Golden Gate, the Perfected One Zhi Xu, Zhen Bai Wei Yi, and the esteemed teachings of Master Fanghu.\n\nThe true of the supreme Dao begins with form and qi,\nEstablishing the Three Powers to nourish the ten thousand kinds.\nSubtle, it returns to the traceless; vast, it knows no bounds.\nAhead, no beginning; behind, no end.\n\nPervading and embodying all things—who can fathom it?\nThe solitary peak stands bare, without obstruction.\nIt engages eyes, ears, nose, and tongue in ceaseless toil—\nHow could there be decay, emptiness, arising, or abiding?\n\nWith a casual gesture, the three bodies are revealed;\nIdle words, though a thousand, contain not a single character.\nFu Xi’s wondrous alignment opened the primordial chaos,\nEstablishing the ultimate for the people, clarifying Heaven’s mandate.\n\nBefore the trigrams, the *Yi* was originally formless;\nBeyond the circle, the Ultimate is not mere emptiness.\nLooking up and down, the patterns are dense—\nKites soaring, fish leaping, all manifest the same brilliance.\n\nNeither forgetting nor forcing, guard your solitude;\nBe only precise, only one, hold to the center.\nUnceasing sincerity finds its resting place—\nHeaven and Earth unite in virtue to complete the supreme work.\n\nThe Perfected One, knowing destiny, values partaking of the mother;\nAttaining emptiness, observing return—this is the elixir’s ancestor.\nTaming and subduing like tigers and dragons,\nHarmonizing concentration and wisdom like Wen and Wu.\n\nGathering emotions to return to nature, merging into the One Origin,\nThe One Origin forgotten, even forgetting is cast aside.",
      "overlap_context": "g instruction and the ten challenges of advancing in the Dao.\n\nWhat are they?\nFirst, the paths are perilous: rivers and lakes are treacherous, the sea of humanity vast—whom can one ask as a teacher?\nSecond, cold and heat press upon the body, daily hardships oppress—before learning anything, unforeseen disasters may strike.\nThird, the ignorant feign lofty attainment, while the wise remain silent and blend with the dust. Seekers, unable to discern true teachers, often pay homage to the wrong ones.",
      "start_char": 2463,
      "end_char": 3688,
      "start_sentence": 109,
      "end_sentence": 170,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.089967489242554,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\原阳子法语.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "囊括三界入虚空，粉碎虚空绝伦伍。 从教劫尽等河沙，耿耿灵明照今古。 沙门未究德充符，单提狗子佛性无。 疑团结就无缝隙，犹如大死方还苏。 蓦然悟得西来意，自信渠今即是吾。 泥牛变作狮子吼，不与万法为侣徒。 於一切处皆具足，俦敢承当是丈夫。 圣贤仙佛分门户，毕竟到家同一路。 身心了外更无玄，早合真参求实悟。 苍茫何处觅真师，玄经误读谁能知。 傍蹊侧径纷趋向，滞无惑有成愚痴。 疑团未启云悟性，故纸频钻为话柄。 只将辩舌逞机锋，岂识拈花真究竟。 最怜多少野狐禅，言清行浊迷真诠。 仙缘有分在明德，天道无亲必与贤。 吾祖蓬头野庵老，武夷峰头事幽讨。 时於圣井引新潮，丽泽涵濡弘至道。 金门羽客方壶公，曾从吾祖坐春风。 祖云见性语自别，不待师传妙悟通。 壶公造道仍探赜，朝来问我见性策。 一声长啸天地春，金乌飞出东方白。 纪学 混成有物超太初，万品由布群情敷。 独来独往成变化，不增不减随形模。 历经浩劫靡终极，总摄元化潜虚无。 我昔少年衣缝掖，继晷焚膏勤读易。 三尺星芒已烛天，二坚流殃旋晦迹。 厌看浊世六尘昏，梦熟黄粱诸幻息。 寿昌仙伯铁玄翁，曾於圣井师金公。 归向青华开泰宇，食我法乳苏疲癃。 继后从游李夫子，闻有蒲衣冯外史。 亦师金祖绍仙宗，驻鹤龙沙明至理。 翩然蹑屩往问之，万法归一一何归。 外史于时方燕坐，雷霆迅厉虚空破。 请我问从甚处来，清风拶透迷云开。 廓然溥见家家月，了照本来无所说 题林下高风图 真常妙体本无象，象外承当须力量。 撢持日月由主张，阖辟阴阳任收放。 崆峒老仙冰雪姿，一唯心传能记往。 清秋皓月挂琼台，藜杖云裾披鹤□。 我家浚仪原之阳，一嘘万物回春光。 曾鼓风霆捍魑魅，长教匣剑藏星芒。 昨来访旧崆峒上，相期驻景望八荒。 金精揽结制木液，招摇坐运凝玄霜。 个中妙契混鱼水，余外纷纷何足齿。 玄都道士东郭子，徒貌丹青劳画史。 对此孰云以色见，定求象外本来面。 问我本来在何处，挥尘一笑乘风去。 题授受图 至道匪言传，因言资妙悟。 所以函谷篇，直指真元路。 锺吕相承启后贤，派分南北垂千年。 宇宙在手步玄纪，日月停景开金莲。 我曾剑佩追芳躅，腊虎脍龙宴瑶屋。 三华隐隐泛流霞，四海茫茫信行独。 昨来孤鹤乘天风，游观嵩华超崆峒。 洞箫吹断山水绿，世外襟期谁与同。 种桃道士渊然者，行洁神清志闲雅。 供薪煮石服勤劳，立雪忘躯轻幻假。 受我登真赞化书，有时入海探骊珠。 鞭霆驭气凌紫极，按节回杓归太无。 崆峒十载重逢日，已见图形记畴昔。 何如体取身外身，微妙冲虚本无迹。 勉进道偈 出家所以超尘俗，割断恩情免牵逐。 箪瓢涉远投明师，服劳尽力期忠告。 积精养气保元和，炼性降心明智烛。 内功微妙贵潜修，外行辛勤须备足。 离形绝巧黜总明，晦迹和光守穷独。 摄邪归正赞神明，济物利生广缘福。 先人后己摧贵高，忍忿含羞忘宠辱。 粗衣淡饭舍荣华，折难消愆除鬼录。 福缘慧力既两全，名署丹台位列仙。 策空游神览无际，俯视溟渤如蜗涎。 亿劫种亲皆受庆，岂但君师父母前。 纵然宿业生魔障，报尽还当道果圆。 云胡季世簪星者，不悟辞亲为究玄。 爱河欲海甘沦溺，利锁名缰长绊缠。",
      "translated_text": "The three realms gathered into emptiness,\nEmptiness shattered, transcending all peers.\nLet kalpas dissolve like Ganges’ sands—\nUnflickering spirit-light illumines past and present.\n\nMonks have not fathomed virtue’s fullness,\nRaising the koan: “Does a dog have Buddha-nature?”\nDoubt knots tightly, seamless as a sphere,\nLike one who dies utterly before reviving.\n\nSuddenly grasping the intent from the West,\nI trust that he and I are now the same.\nThe mud ox transforms into a lion’s roar,\nNo longer companion to the ten thousand dharmas.\n\nIn every circumstance, all is complete—\nWho dares claim this is the mark of a true man?\nSages, immortals, Buddhas divide their gates,\nYet ultimately arrive home by the same path.\n\nBeyond body and mind, no mystery remains—\nBest to seek true inquiry and real awakening.\nIn boundless vastness, where to find a true teacher?\nWho knows when the profound scriptures are misread?\nSide paths and crooked trails lead many astray,\nClinging to emptiness or delusion breeds folly.\n\nDoubt not yet dispelled, one mistakes awakening;\nOld texts drilled endlessly become mere talk.\nSharp tongues display their wit,\nYet who recognizes the truth of the flower’s silent transmission?\n\nPitiful are the many wild-fox Chan,\nTheir words pure but conduct foul, deluded in true teaching.\nThe immortal’s bond lies in manifesting virtue;\nHeaven’s Dao is impartial—it must favor the worthy.\n\nOur ancestor, the wild old hermit of Pengtou,\nSought the hidden on Wuyi Peak.\nAt times he drew fresh currents from the sacred well,\nNurturing the profound Dao with enriching moisture.\n\nThe feathered guest of Golden Gate, Lord Fanghu,\nOnce sat in our ancestor’s spring breeze.\nThe ancestor said: “Seeing nature is distinct—\nNo need for transmission, wondrous awakening arises on its own.”\n\nLord Fanghu, though advanced in the Dao, still probed its depths.\nOne morning he asked me for the strategy to see nature.\nA long whistle split heaven and earth with spring—\nThe golden crow flew forth as the eastern sky turned white.\n\n---\n\n**Mixed Learning**\n\nBefore the primal beginning, a thing already formed and complete,\nMyriad forms spread forth, all emotions flourish.\nAlone it comes, alone it goes, accomplishing transformations,\nNeither increasing nor decreasing, following every shape.\n\nThrough endless kalpas it endures,\nEncompassing the primordial transformations, latent in the void.\nIn my youth, I wore the scholar’s robe,\nBurning oil through the night, diligently studying the *Yi*.\nA three-foot sword’s radiance once lit the sky,\nThe two demons’ calamities swiftly vanished.\n\nWeary of the turbid world’s six dusts in darkness,\nI awoke from the dream of millet—all illusions stilled.\nThe immortal Shouchang, Iron-Xuan the Elder,\nOnce studied under Master Jin at the sacred well.\nReturning to Qinghua, he opened a realm of peace,\nFeeding me the Dharma-milk to revive my exhaustion.\n\nLater, I followed Master Li,\nAnd heard of Pu Yi and Feng the Recluse.\nThey too studied under Ancestor Jin, continuing the immortal lineage,\nAbiding by Crane Dragon Sands to clarify the supreme principle.\nLightly shod, I went to question them—\n“All dharmas return to the One, but where does the One return?”\n\nAt that time, the Recluse was in silent sitting;\nThunderous force shattered the empty sky.\nHe asked whence I came—\nA pure wind pierced through, dispelling the clouds of delusion.\nVast and clear, I saw the moon in every home,\nIlluminating the original—no words to speak.\n\n---\n\n**Inscription on the *High Wind in the Grove* Portrait**\n\nThe true and constant wondrous essence is originally formless;\nBeyond form, one must bear the burden with strength.\nHolding fast to sun and moon depends on mastery;\nOpening and closing yin and yang, one freely gathers and releases.\n\nThe old immortal of Kongtong, with an icy, snowy demeanor,\nReceived the mind-to-mind transmission and could recall the past.\nOn a clear autumn night, the bright moon hung over the jade terrace,\nWith a staff of goosefoot and cloud-like robes, he wore a crane’s [plume].\n\nMy home is in Junyi, north of the Yuan River—\nA single breath revives the spring light of ten thousand things.\nOnce I stirred wind and thunder to ward off demons,\nLong keeping the star-like radiance of my sword sheathed.\n\nYesterday I visited old friends on Kongtong,\nHoping to halt the sun’s progress and gaze to the eight directions.\nGathering golden essence to refine the Wood’s fluid,\nI sat in the Dipper’s sway, congealing the mysterious frost.\n\nIn this, the wondrous union blends like fish and water;\nAll else is not worth mentioning.\nThe Daoist Dongguo of the Mysterious Capital,\nVainly mimics appearances, laboring the painter’s craft.\n\nFacing this, who says one sees by form?\nOne must seek the original face beyond all images.\nAsking where my original self resides—\nWith a flick of my whisk, I laugh and ride the wind away.\n\n---\n\n**Inscription on the *Transmission* Portrait**\n\nThe supreme Dao is not transmitted by words,\nYet words aid wondrous awakening.\nThus the *Pass of the Celestial Ford* text\nPoints directly to the path of the true origin.\n\nZhong and Lü passed it down to later worthies,\nBranching into northern and southern lineages for a thousand years.\nThe cosmos in hand, they stepped through the mysterious records,\nHalting the sun and moon, opening golden lotuses.\n\nI once followed their fragrant traces, sword at my waist,\nFeasting on tiger’s marrow and dragon’s flesh in a jade pavilion.\nThe Three Flowers faintly suffused with flowing radiance,\nThe four seas vast, I trusted my solitary journey.\n\nYesterday, a lone crane rode the heavenly wind,\nRoaming Mount Song and Hua, surpassing Kongtong.\nThe flute’s notes cut through the green of mountains and waters—\nWho shares my lofty aspirations beyond the world?\n\nThe peach-planting Daoist, profound and serene,\nConduct pure, spirit clear, will noble and refined.\nGathering firewood, boiling stones, he served with diligence,\nStanding in snow, forgetting the body, scorning illusions.\n\nReceiving my *Register of Ascension and Transformation*,\nAt times he entered the sea to seek the dragon’s pearl.\nWhipping thunder, riding qi, he ascended the purple pole,\nGuiding the Dipper’s handle, he returned to the Great Void.\n\nOn the day of reunion in Kongtong after ten years,\nHe had already seen the portrait and recalled the past.\nHow much better to embody the body beyond the body—\nThe subtle, empty, and primordial leaves no trace.\n\n---\n\n**Exhortation to Advance in the Dao**\n\nLeaving home is to transcend the mundane,\nCutting off worldly ties to avoid entanglement.\nCarrying a bowl and gourd, journeying far to find a bright teacher,\nServing with labor, striving for loyal admonition.\n\nAccumulate essence, nourish qi, preserve primal harmony,\nRefine nature, subdue the mind, brighten wisdom’s torch.\nThe inner work’s subtlety values hidden cultivation;\nOutward conduct’s diligence must be fully prepared.\n\nDepart form, abandon craft, dismiss cleverness,\nConceal your light, blend with the world, guard solitude.\nGather the deviant to return to the correct, praising the divine,\nAid beings, benefit life, widely cultivate blessed affinity.\n\nPut others first, cast aside pride and arrogance,\nEndure anger, swallow shame, forget favor and disgrace.\nCoarse clothes, plain food, forsake glory,\nOvercome hardships, dissolve transgressions, erase the ghostly ledger.\n\nWhen blessed affinity and wisdom’s power are both complete,\nYour name is inscribed on the cinnabar terrace, ranked among immortals.\nRiding the void, roaming the spirit, gazing into the boundless,\nLooking down, the vast seas seem like a snail’s trail.\n\nFor kalpas, all kin receive blessings—\nHow could it be only for one’s lord, teacher, or parents?\nEven if past karma generates demonic obstacles,\nWhen retribution ends, the Dao-fruit will still ripen.\n\nWhy do those in this degenerate age, wearing the starry cap,\nFail to awaken and leave their families to seek the profound?\nWillingly drowning in the river of love and sea of desire,\nBound by the shackles of profit and the fetters of fame.",
      "overlap_context": "nly one, hold to the center.\nUnceasing sincerity finds its resting place—\nHeaven and Earth unite in virtue to complete the supreme work.\n\nThe Perfected One, knowing destiny, values partaking of the mother;\nAttaining emptiness, observing return—this is the elixir’s ancestor.\nTaming and subduing like tigers and dragons,\nHarmonizing concentration and wisdom like Wen and Wu.\n\nGathering emotions to return to nature, merging into the One Origin,\nThe One Origin forgotten, even forgetting is cast aside.",
      "start_char": 3688,
      "end_char": 4919,
      "start_sentence": 171,
      "end_sentence": 249,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 45.537519454956055,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\原阳子法语.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "自家昧却本来面，外物图为异姓传。 一朝身谢都抛下，业趣相随畴见怜。 我今晓示诸同学，富贵贱贫分厚薄。 孰云计巧财偏多，几多计巧衣无着。 岂无谋疏室磬悬，亦有谋疏田负郭。 要皆前世积因由，受分今生如契约。 盛衰造物已安排，何用孜孜苦贪着。 在家尚学忘家禅，念善背尘思合觉。 况是无家物外人，当於方外寻真乐。 回头疾早莫蹉跎，仙佛教人应不错。 君不见丹阳税庄赛半州，弃如弊屣何曾收。 鹿皮盖衲百家饭，夫妇千里相离休。 又不见庞公家富债不取，鹿门滩裹金长留。 团乐共说无生话，女卖罩篱男饭牛。 二翁高谊绝利欲，尊道贵德轻时流。 休论上士难比拟，有分人人皆可求。 景行自合仰玄契，缠腰何用趋扬州。 华林记谶已千载，八百之中期与侔。 记畴昔李尊师授玄一之道 滕王高阁仲秋间，重拜仙蒲受大还。 半夜风雷度沧海，一时云雨到玄关。 春光入地金芽长，斗柄周天玉漏残。 月满太虚仍跨鹤，翩翩飞上玉京山。 道剑 亲授纯阳道剑方，不须欧冶铸坚钢。 同身禀命生机巧，随意成形杀气张。 涧底磨锋飞电影，月中斫桂染天香。 有时挂在南山下，吓得阴魔远遁藏。 奉和李尊师 期往龙门紫玄观制神药，不至见至寄。 公是重来维ㄙ袁，龙门旧隐已千年。 道参象帝无名始，学究羲皇未画前。 金气应时仍进火，汞华凝处渐抽铅。 神楼一匕能分我，便逐翔鸾谒上仙。 唐仙人罗公远出入禁闼，游戏神通。 当时明皇忌之，召至殿前，伏兵射死，敕殡之。 举棺甚轻，启而视之，竟失所在，止存二屦。",
      "translated_text": "Having dimmed our original face within,\nWe scheme for external things to pass to other clans.\nWhen the body perishes and all is cast aside,\nKarmic destinies follow—who then shows compassion?\n\nNow I reveal this truth to all fellow learners:\nWealth and poverty, noble and base—each has its measure.\nWho claims cunning schemes bring wealth alone?\nHow many schemers lack even clothes to wear.\nIs there no fool whose halls hang empty?\nYet fools too may have fields near the city walls.\nAll stems from causes planted in past lives,\nOur lot in this one fixed as if by contract.\nFlourishing and decline are ordained by creation—\nWhy toil so tirelessly in grasping greed?\n\nEven householders should study the Chan of forgetting home,\nTurn toward goodness, turn from dust, and seek awakening.\nHow much more those who dwell beyond the world,\nWho ought to seek true joy beyond the mundane.\nTurn back swiftly—do not waste time,\nFor the teachings of immortals and Buddhas are never wrong.\n\nHave you not seen Dan Yang, who taxed half a province,\nThen cast it off like worn-out shoes, never to reclaim?\nA deerskin robe, alms-rice from a hundred homes,\nHusband and wife parted for a thousand miles.\n\nHave you not seen Master Pang, wealthy yet debt-free,\nGold left forever in the sands of Deer Gate Shoal?\nJoyful gatherings, speaking of the unborn,\nDaughter selling fish-traps, son tending oxen.\nThe two elders’ noble ways cut free from profit and desire,\nHonoring the Dao, prizing virtue, scorning worldly currents.\nDo not say such lofty ones are beyond comparison—\nEach person has the share to seek it.\n\nFollowing their example, one naturally looks to the mysterious bond,\nWhy bind the waist and rush to Yangzhou?\nThe prophecy of Hua Lin has stood for a thousand years,\nThe eight-hundred-year cycle now matches its measure.\n\nRecalling when Master Li bestowed the Way of Primordial Unity:\nAt Prince Teng’s lofty pavilion, mid-autumn,\nI bowed again to the immortal mat to receive the Great Return.\nAt midnight, wind and thunder crossed the sea,\nClouds and rain arrived together at the Mysterious Pass.\nSpring’s light entered the earth, golden sprouts grew,\nThe Dipper’s handle circled the heavens, the jade clepsydra ran dry.\nThe moon filled the great void, still he rode the crane,\nSoaring lightly up to Jade Capital Mountain.\n\nThe Dao-Sword\nPure Yang personally transmitted the Dao-Sword’s method—\nNo need for Ou Ye to forge unyielding steel.\nBorn with the body, endowed with life, it moves with subtle skill,\nTaking form at will, its killing qi surges forth.\nSharpened in the ravine, lightning flashes,\nHewing the cassia in the moon, it gathers celestial fragrance.\nSometimes hung beneath South Mountain,\nIt frightens yin-demons into distant hiding.\n\nIn Reply to Master Li\nI had hoped to go to Purple Mystery Abbey at Dragon Gate to refine the divine elixir,\nBut before I arrived, you came—sending this instead.\nYou are the same venerable one of old,\nThough Dragon Gate’s old hermitage has stood a thousand years.\nThe Dao merges with the Emperor of Images at the nameless beginning,\nLearning delves into Fu Xi’s time before the first diagrams.\nGolden qi responds to the season, still advancing the fire,\nMercury’s essence congeals, gradually drawing forth lead.\nWith a single spoonful from the divine crucible, it can divide me,\nThen I shall follow the soaring simurgh to meet the highest immortals.\n\nTang Immortal Luo Gongyuan\nEntering and leaving the imperial chambers at will,\nPlaying with divine powers.\nAt the time, Emperor Ming Huang grew jealous,\nSummoned him to the palace hall, had soldiers lie in ambush and shoot him dead,\nOrdered his burial.\nThe coffin was very light; when opened, he was gone—\nOnly two sandals remained.",
      "overlap_context": "ess,\nLooking down, the vast seas seem like a snail’s trail.\n\nFor kalpas, all kin receive blessings—\nHow could it be only for one’s lord, teacher, or parents?\nEven if past karma generates demonic obstacles,\nWhen retribution ends, the Dao-fruit will still ripen.\n\nWhy do those in this degenerate age, wearing the starry cap,\nFail to awaken and leave their families to seek the profound?\nWillingly drowning in the river of love and sea of desire,\nBound by the shackles of profit and the fetters of fame.",
      "start_char": 4919,
      "end_char": 5530,
      "start_sentence": 250,
      "end_sentence": 286,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.294949531555176,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\原阳子法语.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "一日，有贡橘至者，明皇剖之，每一橘中拆一办，因诘问来使。 使对曰：路逢一眇道士，索橘不与，只借一嗅而去，且嘱曰：见上位时，请为道维ㄙ袁稽首。 上笑曰：此罗公远也。 其修炼之所，在太和县龙门太玄观。 观近即三华山，山上为飞升之所，半山有紫玄观祠之。 〔和答福书记〕 留寓云隐山，一日举三教一家话，时 清源山福书记於言下致疑。 经月余再会，复举前话，顿有省悟。 次日袖香具方服，诣山礼谢，仍示偈八句，有宿山之意。 就和答。 弃恶仍图长善芽，无根树子结空花。 回头自是三身佛，觌面何须百丈茶。 凡圣等观无彼此，灵明寂照徧河沙。 春来处处风光好，何必山中远世华。 福书记别后，再用前韵见寄，又和答。 混沦甚处觅根芽，了了由渠转法华。 何日共斟东老酒，为君重点赵州茶。 坐来时刻成千载，觑破乾坤眇一沙。 可惜林林不回首，浮生空老几韶华。 答知白炼师议论道法偈三首 谁识清微大法王，三才万物此开张。 从来法法皆由我，倒用横拈总不妨。 人知此道只虚空，岂悟真空却不空。 一月徧涵千涧水，清光元自不留踪。 方寸心田了了时，随方应化总无为。 迷人但见行千里，两脚何曾半步移。 磨子颂答胡知观 顶门一窍纳珠玑，化作通身白雪飞。 这裹铁心无退转，左来右去任推移。 和巴陵郑宰题岳阳纯阳飞吟亭偈句五首 岳阳行徧识无人，飞度平湖独朗吟。 回首三出烟雾隔，剎那沧海又桑林。 娇痴蕊女惜婴儿，正是秋中半夜时。 颠倒阴阳孕灵质，茫茫四海与谁师。 药材老嫩要知时，采饵刀圭自可支。 消尽群阴乾体就，怀胎应信有男儿。 碧落空歌集万仙，悬珠五丈说重玄。 道包太极归元命，妙契灵台不在言。 阿谁能共窍玄玄，一笑相忘天外天。 挥手长歌弄明月，凌风三迭舞胎仙。 原阳子法语卷上竟 原阳子法语卷下",
      "translated_text": "One day, a tribute of oranges arrived. When Emperor Ming Huang cut one open, each segment split into two. He questioned the envoy about this, who replied: \"On the road, I encountered a one-eyed Daoist who asked for an orange but was refused. He merely borrowed it to smell before leaving, and instructed me: 'When you see the Emperor, please bow and convey my regards to Wei Siyuan.'\"\nThe Emperor laughed and said: \"This was Luo Gongyuan.\"\nHis place of cultivation lay in Taihe County at Longmen’s Tai Xuan Abbey. Nearby stood Sanhua Mountain, where the summit served as his ascension site, and halfway up the mountain stood Zixuan Abbey, where he was venerated.\n\n[Responding to Fu’s Letter]\nStaying at Yunyin Mountain, one day I spoke of the three teachings as one family. At that moment, Fu, the Chronicler of Qingyuan Mountain, raised doubts. A month later, we met again, and when I revisited the same topic, he suddenly gained insight. The next day, he arrived in formal robes, bearing incense, to pay respects at the mountain and express gratitude. He then presented eight verses, hinting at his intent to remain in the mountains. I responded in kind:\n\nAbandoning evil, still nurture the sprouts of lasting goodness,\nThe rootless tree bears empty blossoms.\nTurning your head, you are already the Buddha of the Three Bodies—\nWhy seek face-to-face instruction over a hundred yards of tea?\nSaints and mortals observe equally, without self or other,\nSpirit’s clarity and silent illumination pervade the Ganges’ sands.\nSpring brings beauty everywhere—\nWhy retreat to the mountains to escape the world’s splendor?\n\nAfter parting, the Chronicler Fu sent another poem in the same rhyme, and I answered again:\n\nWhere in the primordial chaos can one seek the root or sprout?\nAll is perfectly clear through the Lotus Sutra’s turning.\nWhen shall we share a cup of the Old Man of the East’s wine,\nAnd I brew for you once more the tea of Master Zhao?\nSitting here, moments stretch into a thousand years,\nSeeing through heaven and earth as but a grain of sand.\nAlas, the multitudes never turn their heads—\nIn vain, fleeting life ages through its fleeting springs.\n\nThree Verses in Response to Alchemist Zhibai’s Discourse on Daoist Teachings\nWho recognizes the Great Dharma King of Qingwei?\nHe unfolds the Three Powers and the myriad things.\nFrom the beginning, all dharmas arise from me—\nInverting or grasping them sideways poses no obstacle.\n\nPeople know this Dao as mere emptiness,\nYet who awakens to true emptiness as not empty?\nA single moon suffuses a thousand valleys’ waters,\nIts pure light leaves no trace behind.\n\nWhen the heart-field of the square inch is perfectly clear,\nResponding and transforming everywhere, it remains without action.\nThe deluded see only a thousand-mile journey—\nYet how have the two feet ever moved half a step?\n\n*Song in Response to Hu Zhiguan’s \"Millstone\"*\nA single aperture at the crown admits a pearl,\nTransforming the whole body into flying white snow.\nHere, the iron heart knows no retreat—\nLeft or right, it moves as it wills.\n\nFive Verses in Response to Magistrate Zheng of Baling’s Inscriptions at Yueyang’s Pure Yang Flying Chant Pavilion\nHaving traveled Yueyang, I recognize no one,\nCrossing the vast lake alone, chanting in flight.\nTurning back, the three emergences lie veiled in mist—\nIn an instant, the blue sea becomes mulberry groves.\n\nThe coquettish flower-maidens pity the infant,\nJust as autumn’s midpoint arrives at midnight.\nInverting yin and yang, they conceive a numinous essence—\nAcross the boundless four seas, who can be their teacher?\n\nKnow the season for harvesting herbs, old or young,\nWith the knife and spoon, self-sufficiency is assured.\nWhen all yin dissolves and the dry body is complete,\nConceive the child—trust there will be a son.\n\nFrom the azure vault, a song gathers ten thousand immortals,\nA five-zhang pearl hangs, expounding the profound mystery.\nThe Dao embraces the Supreme Ultimate, returning to the primordial mandate,\nIts wondrous accord with the numinous terrace transcends words.\n\nWho can share the mystery of mysteries?\nWith a laugh, we forget each other beyond the heavens.\nWaving hands, I sing beneath the bright moon,\nDancing the embryo immortal’s triple ascent on the wind.\n\n*Master Yuanyang’s Dharma Discourses, Volume One Concludes*\n*Master Yuanyang’s Dharma Discourses, Volume Two*",
      "overlap_context": "radually drawing forth lead.\nWith a single spoonful from the divine crucible, it can divide me,\nThen I shall follow the soaring simurgh to meet the highest immortals.\n\nTang Immortal Luo Gongyuan\nEntering and leaving the imperial chambers at will,\nPlaying with divine powers.\nAt the time, Emperor Ming Huang grew jealous,\nSummoned him to the palace hall, had soldiers lie in ambush and shoot him dead,\nOrdered his burial.\nThe coffin was very light; when opened, he was gone—\nOnly two sandals remained.",
      "start_char": 5530,
      "end_char": 6280,
      "start_sentence": 287,
      "end_sentence": 329,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.494508266448975,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\原阳子法语.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "浚仪赵宜真撰 门人章贡刘渊然编集 警学偈十六首 仙圣常怜下士迷，甚如慈母惜婴儿。 道心亦似儿寻母，何患神仙不度伊。 黄帝曾师七十人，人人岂必尽仙真。 广成一见玄机透，始觉从前未是亲。 未分甲子初无象，才着形骸便有方。 吾道强名方外士，须忘形象究真常。 道人唯道即为身，幻假形骸未是亲。 色见声求难觅我，更论年甲愈迷真。 闻道罗和九十时，师年一六正童儿。 学舞前后尊先达，所以能明上下机。 莫学横行外道魔，口头学得逞喽啰。 妬贤诳俗争名利，人我如山欲似河。 莫学迷夫失正传，不通玄蕴骂先贤。 人间暂作清闲客，天上元无蒙懂仙。 莫学狐禅豁达空，拨除罪福逞机锋。 只将口鼓惊聋瞶，不顾他时苦海中。 莫学邪师误后贤，妄分男女作坤乾。 取他精血为丹祖，燕雀如何产得鹯。 心心至道妙难传，假象垂文启后贤。 可惜盲人无正眼，尽将邪议乱真诠。 用尽黄金觅土填，救焚加火冷加泉。 戕生莫甚房中术，误杀间浮几少年。 先地先天真汞铅，无形无象妙通玄。 无中会得真消息，交姤依时证上仙。 抱元守一立根基，打破虚空是了时。 后学纷纷失中道，惑於有作滞无为。 才通机甩未圆融，直要时时究竟功。 触物遇缘无挂得，恁时方许到家中。 先登觉岸不须舟，木烂钉枯岂用收。 最惜后来问津者，倚他樯檝望中流。 调古情真不在名，趋新谐众起佳声。 吉凶生死一逆旅，何用区区立户庭。 镒首座与桥书记心友，久阔之余，有感而作。 三教同开道义门，心心相契共谁论。 如何则被游尘隔，未信涵天宝鉴昏。 简故人 要路烹茶结众缘，人天福果几时圆。 何如早趁春风裹，自把金锄种寸田。 题仙弈图 黑白纵横坐运筹，不知人世几春秋。 就中一着无人会，只在仙翁手指头。 观架上荼(廿十縻)盛开，而海棠独不花。 酒边有感。 满架妖红锦作堆，名花幽独自羞开。 晚来对酒相看处，为尔伤春不尽杯。 雩阳王广文问性命之旨答颂二首 有有有非有，无无无不无。 碧潭秋夜月，星散一轮孤。 水裹月可捉，天边云可缚。 收拾入葫芦，便是长生药。 自赞 体原之阳，任道之纪。 不事标持，从他誉毁。 独立苍茫，浮云流水。 为徒属给冠褐 授汝星冠，为首元服。 万发包藏，两仪洞烛。 出一头来，堂堂露独。 授汝绛服，为身之章。 云裾济楚，霞佩颉颃。 百体是覆，罔敢弗庄。 授汝碧简，正其威仪。 视瞻母侧，敬恭自持。 潜心对越。 如秉大圭。 授汝黄坛，谨其动履。 八卦周旋，九宫步驻。 鹄立朝元，虎拜斯委。 日记题辞 予少从李尊师问道，首蒙授以日记一帐，令每日但有举意发言、接人应事，皆书于帙中。 其不可书者，即不可为，既为之，不问得失，必当书之。 合於理则为合天心，背於理则为欺天心。 或未明其理，率尔之为，不觉谬戾，是乃误作，其过可恕。 知其背理而忍为之，是乃故作，遂成大罪。 甚至诬罔以掩其非，从而不书，重其罪矣。 盖吾师之意，谓人心即天心，欺心即欺天，故以《天心》标其帐，而又警以偈云： 天心本与我心同，我若欺心昧化工。 拈起笔时须猛省，神明暗室不相容。 余受教以来，佩奉无斁，检束身始焉与接为构，日与心国，觊达於理，若极其难。 久而渐通，随物而应，虽未能尽合天心，而造夫君子之域，庶几乎万一，免为小人之归，寔大幸也。",
      "translated_text": "**Sixteen Admonitory Gāthās by Zhao Yizhen of Junyi, Compiled by Disciple Liu Yuanran of Zhang-Gan**\n\nThe immortals and sages ever pity the deluded scholar,\nAs a loving mother cherishes her infant child.\nThe heart of the Dao is like a child seeking its mother—\nWhy fear the immortals will not ferry him across?\n\nThe Yellow Emperor once studied under seventy masters,\nYet not all were perfected immortals.\nOnly upon meeting Guangcheng did he fathom the profound mechanism,\nThen realized all prior teachings were not truly intimate.\n\nBefore the cyclical signs took form, there was no image;\nOnce the bodily frame appears, directions arise.\nOur Dao forcibly names those beyond form—\nOne must forget appearances to fathom the eternal truth.\n\nThe Daoist takes the Dao itself as body,\nThe illusory, borrowed frame is not truly intimate.\nSeeking me through form and sound is futile—\nTo speak of years and signs only deepens delusion.\n\nWhen Luo He heard the Dao at ninety,\nHis teacher was but sixteen, a mere youth.\nLearning the dance, he honored those who came before—\nThus he grasped the subtle workings of above and below.\n\nDo not follow the perverse demons of heterodox paths,\nWho parrot teachings to command their rabble.\nEnvious of the worthy, deceiving the common folk,\nThey vie for fame and profit, their self and others like mountains and rivers.\n\nDo not imitate the deluded who lose the true transmission,\nFailing to penetrate the profound mysteries yet slandering the sages.\nFor a time, they play the carefree guest in the world—\nIn heaven, there are no such muddled immortals.\n\nDo not mimic the fox-like Chan of reckless emptiness,\nWho dismiss karma and fortune to flaunt their wit.\nThey merely drum their tongues to startle the deaf and blind,\nHeedless of their future plight in the bitter sea.\n\nDo not follow false masters who mislead later worthies,\nAbsurdly dividing male and female into qian and kun.\nTaking others’ essence and blood as the elixir’s origin—\nHow can swallows and sparrows give birth to hawks?\n\nThe heart’s heart—profound Dao—is hard to transmit;\nThrough borrowed images and written words, it enlightens later worthies.\nAlas for the blind who lack true vision,\nWho twist right teachings with perverse interpretations.\n\nExhausting gold to fill the earth,\nAdding fire to quench a blaze, or springs to cool the cold.\nNothing harms life more than bedroom arts—\nHow many youths of the floating world have they slain?\n\nThe true mercury and lead of pre-heaven and pre-earth,\nFormless and imageless, wondrously penetrate the profound.\nIf you grasp the true message within the formless,\nTimely union will confirm you as an immortal above.\n\nEmbrace the origin, guard the One to establish the root—\nShattering the void is the moment of completion.\nLater learners, scattered, lose the central Dao,\nBewildered by action, stagnant in non-action.\n\nBarely grasping the mechanism yet lacking integration,\nThey insist on pursuing attainment at every moment.\nUnattached when encountering things and circumstances—\nOnly then may you arrive home.\n\nFirst to reach the shore of awakening, no boat is needed;\nWhen wood rots and nails rust, what use is repair?\nMost pitiful are those who later seek the ford,\nLeaning on others’ oars and rudders, gazing at midstream.\n\nAncient sincerity does not lie in fame,\nChasing novelty to please the crowd wins fleeting praise.\nFortune and misfortune, life and death—all are transient lodgings;\nWhy trouble to establish a household?\n\n**To Preceptor Yi and Scribe Qiao, Dear Friends of the Heart,**\nAfter long separation, moved to compose:\n\nThe three teachings open the gate of the Dao’s meaning,\nHeart to heart, with whom can this be discussed?\nHow is it that drifting dust obscures us,\nBefore we trust the heaven-encompassing mirror has dimmed?\n\n**To an Old Friend**\nBrewing tea at the crossroads to bind karmic ties,\nWhen will the blessed fruit of humans and gods ripen?\nBetter to seize the spring wind early,\nAnd take up the golden hoe to till your inch of field.\n\n**Inscribed on the Immortal’s Chessboard**\nBlack and white arrayed, sitting in strategic thought—\nWho knows how many springs and autumns pass in the world?\nYet no one grasps the crucial move within—\nIt lies solely in the immortal elder’s fingertip.\n\n**Viewing the Luxuriant Tea Blossoms on the Trellis, While the Crabapple Alone Remains Unbloomed—**\n**A Reflection Over Wine**\n\nThe trellis teems with seductive crimson, piled like brocade,\nThe reclusive crabapple, shy, refuses to open.\nAs evening comes, facing the wine, gazing upon it—\nFor your sake, I grieve the spring, never draining my cup.\n\n**Two Gāthās in Response to Yuanyang Magistrate Wang’s Inquiry on the Essence of Nature and Destiny**\n\nThere is being, yet it is not being;\nThere is non-being, yet it is not non-being.\nThe autumn moon on the emerald pond,\nScattered stars, a solitary wheel.\n\nThe moon in water can be grasped,\nThe clouds at the sky’s edge can be bound.\nGather them into the gourd—\nThis is the elixir of eternal life.\n\n**Self-Eulogy**\n\nEssence of primordial yang,\nPillar of the Dao’s practice.\nUnconcerned with ostentation,\nIndifferent to praise or blame.\nStanding alone in the vast,\nLike floating clouds and flowing water.\n\n**For the Disciples’ Tonsure and Robing**\n\nI bestow upon you the starry crown,\nFor your head, the primal garb.\nTen thousand hairs enclose,\nThe two modes illumined.\nEmerge with one head raised—\nMajestic, uniquely revealed.\n\nI bestow upon you the crimson robe,\nAs the adornment of your body.\nCloud-skirts refined, rosy pendants soaring—\nEvery limb is covered,\nDare not be unsolemn.\n\nI bestow upon you the jade tablet,\nTo rectify your dignity.\nLet your gaze be unswerving,\nReverent and self-possessed.\nWith concentrated heart, face the divine—\nAs if holding the great scepter.\n\nI bestow upon you the yellow altar,\nTo govern your movements.\nCircling the eight trigrams, pacing the nine palaces,\nStanding like a crane at the court of the origin,\nBowing like a tiger, thus entrusted.\n\n**Preface to the Daily Record**\n\nIn my youth, I sought the Dao from Master Li,\nWho first bestowed upon me a daily record,\nInstructing me to inscribe within it every intention, utterance,\nEncounter, and response to affairs.\nWhat could not be written should not be done;\nOnce done, regardless of success or failure, it must be recorded.\nIf it accords with principle, it aligns with the heart of heaven;\nIf it contravenes principle, it deceives the heart of heaven.\nShould one act rashly without understanding the principle,\nUnwittingly erring—this is a mistake, and the fault is forgivable.\nBut to knowingly act against principle and persist—\nThis is deliberate transgression, a grave sin.\nWorse still, to fabricate falsehoods to conceal one’s faults,\nAnd omit them from the record—this compounds the offense.\n\nFor my master’s intent was this:\nThe human heart is the heart of heaven;\nTo deceive the heart is to deceive heaven.\nThus he titled the record *The Heart of Heaven*,\nAnd further admonished with this gāthā:\n\nThe heart of heaven is one with my heart;\nIf I deceive my heart, I obscure the workings of transformation.\nWhen lifting the brush, I must reflect deeply—\nThe divine and the hidden do not tolerate deception.\n\nSince receiving this teaching, I have upheld it without fail,\nRestraining my conduct from the outset in all dealings.\nDaily, I engage with the realm of the heart,\nSeeking to grasp principle—though it seems impossibly difficult.\nOver time, I gradually penetrated it,\nResponding to things as they arose.\nThough I have not fully aligned with the heart of heaven,\nI have approached the realm of the noble,\nPerhaps by one part in ten thousand,\nAnd avoided the fate of the petty—this is great fortune indeed.",
      "overlap_context": "hang pearl hangs, expounding the profound mystery.\nThe Dao embraces the Supreme Ultimate, returning to the primordial mandate,\nIts wondrous accord with the numinous terrace transcends words.\n\nWho can share the mystery of mysteries?\nWith a laugh, we forget each other beyond the heavens.\nWaving hands, I sing beneath the bright moon,\nDancing the embryo immortal’s triple ascent on the wind.\n\n*Master Yuanyang’s Dharma Discourses, Volume One Concludes*\n*Master Yuanyang’s Dharma Discourses, Volume Two*",
      "start_char": 6280,
      "end_char": 7632,
      "start_sentence": 330,
      "end_sentence": 412,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.238852977752686,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\原阳子法语.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "今同门道者，立志不群，有缘相契，似可进道，尚恕於事物之理，未尽通彻，宁免为染习之累，而不自觉。 或得为而不为，或不得为而为之者，尤当审择。 余因以父师所授天心之说，转相付嘱。 噫，九层之台起於累土，千里之行始於足下。 入道之门，积德之基，亦必由此始，所以期望於同志。 道者至矣，当见真积力久，一旦豁然，心与理融，天人合德，方知所谓修心即修道也。 日记之末，奚足以见天心印可乎？ 经曰：天性人也，人心机也。 此感彼应，如影随形，莫见乎隐，莫见乎微，可不慎哉。 福慧因果说示上清诸道契尝闻先达谓：人天路上作福为先，生死海中修慧为本。 盖专於修慧者，摄性明心，坚持戒定，以资慧力，而证夫道，则可以度脱生死苦轮，超跻仙祚矣。 未种缘福，不免艰难，岂得身心清静。 专於作福者，济世度人，广行方便，以培福基，则当来托生人天，受诸快乐矣。 未证夫道，不免身后报尽还来。 故进道之要，须福慧相须，不可偏废，独饶一己未足为奇，自利利他则彼此皆济。 昔元始天尊说经，一国男女皆受护度。 老君财修之於身，其德乃真，至修之於天下，其德乃普。 孔子之克己复礼，天下归仁，自意诚心正而至国治天下平，皆所以成己成物也。 佛之称两足尊正，以其福慧俱备也。 后来六祖禅师为碓头，灵济禅师为饭头，既成道又伏孽龙。 泗洲禅师成道而降水母。 祖天师曰：吾丹已成，服之必冲举，今当为国为民兴利除害，庶几他日臣事三境无愧焉。 乃入蜀降魔，区分人鬼，兴复盐利，惠及邦家。 葛仙公常行符水救病，祭炼鬼魂八十万众。 许都仙亦以符药救病，既成道又斩除恶蛟，功齐神禹。 皆苦身励行，福慧并修，而后证道。 桓凯真人修日月高奔之道，闻陶隐居门下生徒众多，方投佣做园头，是先证道后修福。 紫清真人闻金液大还之道，又云游行法，济世度人，方依金丞相府修炼成功，是先修福后证道。 以此知仙佛圣贤，为教若有不同，而揆之修己及人，则一也。 但仙佛之修慧修福，则志在於度世； 善恶之报，则取验於三生。 圣贤之成己成物，则志在於治世； 善恶之报，则取验於见世，为小异耳。 经曰：鬼神祸淫而福谦，作善降之百祥，作不善降之百殃。 此圣贤论鬼神因果之事，固当於理。 予少时读书亦知其然矣。 及历经世故，观已然之迹，或有不可盘而论者。 如尧舜大圣人，岂不能位天地育万物，而有九年滔天之水，致下民昏垫。 知人则哲，能官人已，而治水误甩鲧。 成汤亦圣人，而有七年大旱，及以六事自责而后雨，何不早图。 至於颜贤而夭，跖盗而寿，伯道无儿，古今凡如此者，不可胜纪。 近自兵兴以来，观里闬间有累世为善士贤儒，明经修行者，多固穷，其福庆不在其身，当在其子孙。 今乃绝灭无遗类，岂皆不孝人乎。 有奸究暴横者，今皆富庶益昌。 若以见世善恶之说验之，固已爽矣。 若以三生因果之说推之，则灼然可信。 是宜两说并行，斯无遗矣。 昔圣，代昏垫者，皆葬鱼腹，与季世填沟壑、蛮颠崖涂炭者又何异，是皆前生所作定业，际会一时，偿其业债。 试观夫今之聪明者或多贫夭，而愚钝者或多寿富，何也？ 盖总明者专尚文学，不信因果，及其再来，则聪明有加，贫困甚矣。",
      "translated_text": "Here the fellow Daoists, steadfast in their resolve and set apart from the common crowd, have formed a karmic bond and found affinity, seeming ready to advance upon the Way. Yet in matters of principle, they have not yet attained thorough clarity, and may still be unwittingly burdened by habitual defilements. At times, they may fail to act when action is called for, or act when restraint is needed—such moments demand careful discernment. Thus, I transmit the teaching of the *Heart of Heaven* as received from my father and master, passing it on in turn.\n\nAh! A nine-tiered terrace begins with heaped earth; a thousand-mile journey starts with a single step. The gateway to the Dao and the foundation of virtue must likewise begin here—this is my hope for those of shared aspiration. The Dao is supreme; only through long and sincere accumulation of effort will one suddenly awaken, the heart fusing with principle, heaven and humanity united in virtue—then one truly knows that cultivating the heart *is* cultivating the Dao.\n\nAt the end of each daily record, how could this suffice to reflect the celestial heart’s seal of approval? The scripture states: “Heavenly nature is human; the human heart is mechanism.” This responds to that, as shadow follows form—nothing is hidden in darkness, nothing concealed in subtlety. Can one not be cautious?\n\nIn the *Discourse on Blessing, Wisdom, and Karma* presented to the Upper Clarity Daoist fraternity, it is said: the ancients taught that on the path between humanity and heaven, cultivating blessing comes first; in the ocean of birth and death, cultivating wisdom is fundamental. Those who focus solely on wisdom gather their nature and illuminate the heart, uphold precepts and stabilize concentration to strengthen wisdom and realize the Dao—thus they may transcend the suffering wheel of birth and death, ascending to immortal rank. Without planting the seeds of blessing, the path remains arduous; how can body and mind attain purity? Those who focus solely on cultivating blessing relieve the world and deliver others, widely practicing expedient means to build a foundation of blessing—thus in future lives they may be reborn among humans or gods, enjoying manifold pleasures. Yet without realizing the Dao, when their postmortem retribution is exhausted, they must return again.\n\nTherefore, the essential path of advancement requires both blessing and wisdom, neither to be neglected. To enrich oneself alone is insufficient; self-benefit and benefiting others ensure mutual fulfillment. In ancient times, the Celestial Worthy of Original Beginning expounded the scriptures, and an entire nation’s men and women received protection and deliverance. Lord Lao cultivated himself, and his virtue became authentic; when he extended cultivation to the world, his virtue became universal. Confucius’ mastery of the self and return to ritual led all under heaven to embrace humaneness—from sincerity of intention and rectification of the heart to governance of the state and peace under heaven, all serve to perfect oneself and others. The Buddha is called the Honored One of Two Perfections because he possessed both blessing and wisdom.\n\nLater, the Sixth Chan Patriarch worked as a pestle-hand, and Chan Master Lingji as a cook—both attained the Dao and subdued karmic dragons. Chan Master Sizhou attained the Dao and subdued the water mother. Patriarch Heavenly Master said: “My elixir is complete; consuming it, I would surely ascend. Yet now I must benefit the nation and the people, eliminating harm and promoting welfare, so that in the future, when I serve the Three Clarities, I may do so without shame.” Thus he entered Shu to subdue demons, distinguishing between humans and ghosts, reviving the salt trade, and bringing prosperity to the state. Master Ge the Immortal often used talismanic water to heal the sick, and through ritual refinement delivered eighty thousand ghostly souls. Immortal Xu of the Capital likewise used talismans and medicine to cure illness; after attaining the Dao, he slew a vicious flood dragon, his merit equaling that of the divine Yu. All endured hardship and spurred themselves to action, cultivating both blessing and wisdom before realizing the Dao.\n\nImmortal Huan Kai practiced the High Leaping Way of the Sun and Moon. Hearing that Master Tao the Recluse had many disciples, he first sought employment as a garden laborer—thus attaining the Dao before cultivating blessing. Perfected Purple Clarity heard of the Great Return of Golden Liquid and traveled widely to perform rituals, relieving the world and delivering others. Only then did he succeed in refinement under the patronage of Minister Jin—thus cultivating blessing before attaining the Dao. From this, we know that while the teachings of immortals, Buddhas, and sages may differ, in their cultivation of self and others, they are one. Yet the cultivation of wisdom and blessing by immortals and Buddhas aims at delivering the world; the retribution of good and evil is verified across three lifetimes. The self-perfection and world-perfecting of sages aim at governing the world; the retribution of good and evil is verified in the present life—this is but a minor difference.\n\nThe scripture states: “Ghosts and spirits bring disaster to the licentious and bless the humble. Those who do good receive a hundred blessings; those who do evil receive a hundred calamities.” This principle of ghostly and spiritual karma, as expounded by sages, is certainly grounded in reason. In my youth, reading books, I understood it to be so. Yet after experiencing worldly affairs and observing past events, some cases defy facile explanation. The great sages Yao and Shun—could they not have ordered heaven and earth and nurtured the myriad things? Yet there came the nine-year flood that drowned the people. Knowing others is wisdom; appointing the capable is governance—yet in managing the flood, they mistakenly employed Gun. King Tang was also a sage, yet suffered seven years of drought; only after self-reproach for six faults did rain come—why did he not act sooner?\n\nAs for the worthy Yan who died young, the bandit Zhi who lived long, and Bo Dao who left no descendants—such cases from ancient times to the present are too numerous to record. Since the outbreak of war, I have observed in villages and hamlets those who for generations were virtuous scholars and cultivated gentlemen, well-versed in the classics and practicing self-cultivation—many remained impoverished, their blessings not manifesting in their own lives but in their descendants. Yet now their lines are extinguished without remnant; were they all unfilial? Meanwhile, those who were treacherous and violent now prosper and flourish. If we test this against the doctrine of present-life retribution for good and evil, it clearly fails. Yet if we apply the doctrine of three-lifetime karma, it is evidently trustworthy. Thus both doctrines should be upheld together to avoid oversight.\n\nIn ancient times, those who perished in floods were buried in fish bellies; in later ages, those who fill ditches and gullies, or suffer in the flames and mire of barbarian lands—how are they different? All are the fixed karma of past lives, meeting their moment to repay karmic debts. Observe today: the intelligent often suffer poverty and early death, while the dull-witted often enjoy longevity and wealth. Why? The intelligent focus solely on literature and disbelieve in karma; when they return again, their intelligence increases, but their poverty deepens.",
      "overlap_context": "nce receiving this teaching, I have upheld it without fail,\nRestraining my conduct from the outset in all dealings.\nDaily, I engage with the realm of the heart,\nSeeking to grasp principle—though it seems impossibly difficult.\nOver time, I gradually penetrated it,\nResponding to things as they arose.\nThough I have not fully aligned with the heart of heaven,\nI have approached the realm of the noble,\nPerhaps by one part in ten thousand,\nAnd avoided the fate of the petty—this is great fortune indeed.",
      "start_char": 7632,
      "end_char": 8853,
      "start_sentence": 413,
      "end_sentence": 462,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.02269411087036,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\原阳子法语.txt",
        "category": "正统道藏太玄部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "愚钝者虽不事文学，信尚福缘，及其再来，则富寿有加，愚钝不易矣。 俗谚云：不能言者青云上，不识字者黄金多。 是必有其故矣。 若既有聪明文学，又能修种福缘，则当来富贵聪明兼之宜也。 大抵人生所为，皆是自己做下来生模子，造物岂容心哉，持假手为之陶泻尔。 或谓人既死，未信其神不灭，有因果转轮，从而并以神仙为渺茫，是自昧其本真也。 徒为世外高人所嗤。 夫神附形则为人，人死神不灭，则谓之鬼。 精气为物，是即形也。 游魂为变，是即鬼也。 先圣既知其有情有状，又知其能为祸福，能降祥殃。 乡人傩则朝服立於昨阶，谓使祖先魂气有所依凭，不至惊怖。 而后学犹以幽冥鬼神事为无乎。 秦兵不坏孔子宅，为闻有金石丝竹之音。 若无鬼神以司之，果自响乎？ 邵子诗云：身在天地后，心在天地先，天地自我出，其余何足言。 而敢谓神可灭亡乎？ 黄帝成道，骑龙上天，载於青史。 朱子诗曰：金鼎蟠龙虎，三年养神丹，刀圭一入口，白日生羽翰。 犹谓神仙之道为渺茫乎。 昔有议仙而竟遇仙，诋佛而竟从佛，论无鬼而卒见鬼者，辞有时而穷矣。 是皆人我偏见，未暇与辩，适有议神仙鬼神之事，与夫善恶之报，或有爽於斯世者，似无以劝惩，遂广引前说以谕之。 且夫人生世间，以有限之光阴，逐无穷之事物，合眼成梦，六趣分明，凡俗罔知，恣纵情欲，认苦为乐，如醉弗醒。 吾党之士，既闻斯道，正好力行。 行无所行，方了大丈夫能事，何可因循世故，随逐幻缘，虚负此生，良可惜也。 故首举福慧双修之说，期与同志者共勉。 因并书以质之，吾友子玙吴炼师，而次诸道契列仙高明之见，以为然乎，否乎。 率湖广武当宫诸学者刊道德经文始经题辞 道藏经典，皆所以化民为善，而至於道也。 传世既远，诵习者多。 唯太上老君所着《道德经》，关尹真人所着《文始经》，皆研穷性命道德之源，造化鬼神之故，而诵习者独鲜见，岂至理幽微，未易探赜欤。 抑兵燹之后，典籍罕存欤。 宜真昨来，由琼林望嵩华，采摭遗经，正兴此叹。 道经江夏，因就武当宫，率诸学者并力绣梓，以广流通，故为之题辞。 右伏以五千余言《道德经》，实弥纶於大化； 百八十章《关尹子》，复流演於玄纲。 二书相传，万圣攸则。 盖心由经悟，非经无以见心； 道匪言传，因言所以显道。 若向个中参透，便能言外贯通，神化宜民，皇建有极。 方今天子已训注於斯文，用广圣谟，益流通於昭代。 兹欲再新传刻，是须众力圆成。 复函关楼观之遗编，如碧落浮黎之出教。 使闻是经者，莫不尊道而贵德，咸归众妙之门。 而善为士者，能知执古以御今，是谓不言之教。 坐化颂 遁世和光了幻缘，缘消幻灭独超然。 清风遍界无遮得，赫日当空照大千。 原阳子法语卷下竟",
      "translated_text": "The dull-witted, though they do not pursue literature, believe in and venerate good fortune; when they return again, their wealth and longevity increase, while their dullness remains unchanged. A common saying goes: *\"Those who cannot speak rise to high office; those who cannot read amass gold in heaps.\"* There must be a reason for this. If one possesses both intelligence and literary cultivation while also cultivating good fortune, then in the life to come, wealth, nobility, intelligence, and wisdom should all be attained together.\n\nGenerally, all that a person does in life serves as the mold for their next existence. How could the Creator indulge them, merely shaping and pouring through borrowed hands? Some argue that after death, the spirit does not persist, and thus deny the cycles of karma and rebirth, dismissing the Way of Immortals as mere fantasy. This is to obscure one’s own true nature, inviting only the scorn of those beyond the world. When the spirit attaches to form, it becomes human; when a person dies and the spirit does not perish, it is called a ghost. *\"Essence and qi become things\"*—this is form. *\"The wandering soul undergoes transformation\"*—this is the ghost. The ancient sages knew that spirits have emotions and forms, that they can bring fortune or misfortune, blessings or calamities. When villagers perform the *nuo* exorcism, they don their court robes and stand upon the steps, believing this gives the ancestral spirits a place to rest, preventing them from being startled. Yet later scholars still dismiss the affairs of the unseen world and spirits as nonexistent.\n\nThe Qin army did not destroy Confucius’s residence because they heard the sounds of metal, stone, silk, and bamboo music within. If there were no spirits to preside over it, would it truly resound on its own? Master Shao’s poem says:\n*\"The body comes after Heaven and Earth,\nThe mind exists before them.\nHeaven and Earth emerge from me—\nWhat else is there to say?\"*\nHow then can one claim the spirit can be extinguished?\n\nThe Yellow Emperor attained the Dao and rode a dragon into the heavens, as recorded in the annals. Master Zhu’s poem reads:\n*\"The golden tripod coils with dragon and tiger,\nThree years to nurture the elixir of spirit.\nWith a single dose of the knife’s measure,\nWhite daylight births wings and feathers.\"*\nCan one still call the Way of Immortals mere fantasy?\n\nIn the past, there were those who debated against immortals yet later encountered them, those who slandered the Buddha yet ultimately followed him, and those who denied ghosts yet ultimately saw them. Their words reached their limit. These are all biased views of self and others, not worth debating. When some in this world question the affairs of immortals and spirits or the retribution of good and evil, their doubts may lead to neglect of moral exhortation and restraint. Thus, I have broadly cited earlier teachings to enlighten them.\n\nMoreover, a person lives in this world with limited time, chasing endless things. When they close their eyes, it is like a dream, yet the six paths of rebirth are distinct. The common folk, ignorant of this, indulge their desires, mistaking suffering for joy, as if drunk and never awakening. For those of us who have heard this Way, it is fitting to strive diligently. To act without attachment to action—this is the true work of a great person. How can one follow worldly customs, chasing illusory conditions, and waste this life? It is truly lamentable. Therefore, I first present the teaching of cultivating both fortune and wisdom, hoping to encourage like-minded companions.\n\nI have written this to seek the opinion of my friend, Master Wu Ziyu, the Daoist alchemist, and to record the insights of those who have attained the Dao and the lofty immortals. Do you agree or not?\n\n**Preface to the Reprinting of the *Daodejing* and *Wenshi Jing* by the Scholars of Wudang Palace in Huguang**\n\nThe scriptures of the Daoist Canon all serve to transform the people toward goodness and ultimately toward the Dao. Having been transmitted for generations, many recite them. Yet among the works of the Most High Lord Lao, the *Daodejing*, and the Perfected Lord Guan Yin, the *Wenshi Jing*—both of which delve into the origins of nature and destiny, the workings of creation, and the mysteries of spirits—few recite them. Is this because their profound principles are too subtle to fathom? Or is it due to the scarcity of texts after the ravages of war?\n\nRecently, Master Zhen Yi traveled from Qionglin to the sacred peaks of Song and Hua, gathering lost scriptures, and was moved to this lament. The Daoist scriptures passed through Jiangxia, and so he came to Wudang Palace, where he led the scholars to join efforts in carving and printing them, aiming to widely circulate these texts. Thus, I have written this preface.\n\nThe *Daodejing*, with its five thousand words, encompasses the great transformation; the *Guan Yinzi*, with its one hundred and eighty chapters, further expounds the subtle principles. These two books have been transmitted together, serving as the model for all sages. The mind is awakened through the classics—without the classics, the mind cannot be seen. The Dao is not transmitted through words—yet through words, the Dao is revealed. If one penetrates their depths, one can grasp what lies beyond words, spiritually transforming the people and establishing the imperial order.\n\nToday, the Son of Heaven has already annotated these texts to broaden the sagely teachings and further their circulation in this enlightened age. Now, as we seek to renew their printing, collective effort is needed to bring this to completion. We have also included the lost writings from the Guanlou Temple, like the teachings emerging from the azure heavens and the floating paradise. May all who encounter these scriptures revere the Dao and honor virtue, all entering the gate of myriad mysteries. And may the virtuous scholars know how to wield the ancient to govern the present—this is the teaching without words.\n\n**Eulogy in Sitting Transformation**\n\nWithdrawing from the world yet harmonizing with its light, illusions end when conditions fade—alone, one transcends.\nA pure wind pervades all realms, unbounded;\nThe radiant sun hangs in the sky, illuminating the great thousand worlds.\n\n**End of the Lower Scroll of *Fayu* by Master Yuanyang**",
      "overlap_context": "sh bellies; in later ages, those who fill ditches and gullies, or suffer in the flames and mire of barbarian lands—how are they different? All are the fixed karma of past lives, meeting their moment to repay karmic debts. Observe today: the intelligent often suffer poverty and early death, while the dull-witted often enjoy longevity and wealth. Why? The intelligent focus solely on literature and disbelieve in karma; when they return again, their intelligence increases, but their poverty deepens.",
      "start_char": 8853,
      "end_char": 9915,
      "start_sentence": 463,
      "end_sentence": 511,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.63012075424194,
      "metadata": {
        "source_file": "dao\\正统道藏太玄部\\原阳子法语.txt",
        "category": "正统道藏太玄部"
      }
    }
  ]
}