{
  "source_id": "参同契五相类秘要",
  "source_file": "chunked_daozang\\参同契五相类秘要.json",
  "total_chunks": 5,
  "total_original_chars": 3549,
  "total_translated_chars": 19672,
  "total_translation_time": 101.75880074501038,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\参同契五相类秘要.txt",
    "category": "众术类"
  },
  "full_translation": "*The Esoteric Essentials of the Five Correspondences of the Cantong qi*\n\n**Title:** *The Esoteric Essentials of the Five Correspondences of the Cantong qi*\nBy Lu Tianji of the Northern Song. One fascicle.\nSource of the base text: *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, *Zhongshu* Category.\n\n*The Esoteric Essentials of the Five Correspondences of the Cantong qi*\nPresented by the Imperial Academy Supervisor of Huainan West Circuit, Gentleman for Manifesting Virtue, Bearer of the Silver Fish-Tally, Your Servant Lu Tianji, on behalf of the Perfected of Great Simplicity, Wei Boyang.\n\nYang: one, two, three, four, five.\nWater, fire, wood, metal, earth.\nYin: six, seven, eight, nine, ten.\n\nFormerly, the Perfected Wei Boyang, together with Chunyu Shutong, transmitted the *Cantong qi* and ancient songs to Xu, the Attendant Officer of Qingzhou. After Master Wei attained the elixir, he composed these *Five Correspondences*. Later, he ascended on clouds and departed, commanding his disciple to inscribe them in large seal script. No other versions exist; all claim this to be the middle fascicle of the *Cantong qi*, though such views are shallow indeed.\n\nNow, the *Five Correspondences* discusses the mutual resonance of all things, the subjugation of the Three Yellows and Two Treasures—hence the name \"Five.\" The treatise states:\n\nWhat Heaven engenders as the Primordial Maiden is mercury.\nWhat Earth engenders as the Yellow Lad is gold.\nBoth receive the nature of the Great Harmony’s subtle reversal: left as yang, right as yin, taking their positions to interpenetrate. Thus, mercury and gold are the true essence of Heaven and Earth’s harmonious union, born from the primal darkness.\n\nInitially, it is cinnabar, belonging to the left and dwelling in the East. Later, it transforms into mercury, dwelling in the West as the right—this is the borrowing of position. *Zhang* and *Yi* soar to *Xu* and *Wei*: this is the first transformation. *Zhang* and *Yi* are the southern constellations, cinnabar; *Xu* and *Wei* are the northern lodgings, mercury. Emerging from cinnabar, it flies from south to north—this is the first transformation.\n\nBy the nature of its received life, it undergoes one transmutation into the elixir. Reversing cinnabar into mercury, reversing mercury into the elixir—thus the elixir is once transformed. Once stabilized, it ascends to the Upper Palace. The Palace is the Vermilion Palace of the South, where mercury’s transformations are fixed. Then, it is no longer subject to the myriad things, for mercury governs the transformations of the ten thousand beings.\n\nThe Great Yang’s white mercury—mercury is quicksilver, the essence of yin. It originally contains the Crimson Waters, for mercury is born from cinnabar, hence it is said to contain the Crimson Waters. \"Returning my elixir-fluid\": reversing mercury into cinnabar is the union of husband and wife, for mercury is originally cinnabar. Its pure black essence contains the Azure.\n\nBlack lead is mercury’s azure hue, its position belonging to the East as vermilion—this is the essence of wood, hence it is called azure. Now, the Four Images establish their roots, each with its own explanation, then follow their natures to harmonize them. For the awakened, it is easy; for the deluded, it is difficult.\n\nFor the awakened, it is exceedingly easy; for the deluded, exceedingly difficult.\n\nThe primordial essence follows the Dipper’s handle in spring—this primordial essence is the Zi-mercury. In the eleventh month, when Zi is established, the spring yang’s blackness arises. Thus, in the eleventh month, it receives the yang by the inch, for the eleventh month is when the Dipper’s handle begins at Zi. Moreover, east and west mutually devour one another: the east is vermilion, the west is silver, and these two substances consume each other. Yin’s encroachment resides in You, coming and going through the Central Palace. The Central Palace is realgar. Yin-mercury, the You-metal, and the eleven substances contend, initially subduing the realgar’s blackness to dominate the mercury. The two natures harmonize, using metal to harmonize mercury—some say using mercury to harmonize cinnabar. It serves as wife and child, as mother and lord, as minister and assistant. When mercury employs lead as its wife, it is like the relationship of child and mother, lord and minister. Now, by obtaining the nodal tally to govern and restrain it, it is like water extinguishing fire, and the fire must submit. If one follows the seasonal nodes and the timing of the fire’s advance and retreat, the Five Phases transform and restrain, and metal and mercury will naturally submit. With the tally upright and the task direct, ascent and descent are determined, and success is assured.\n\nNow, the *Cantong Qi* aligns with the Five Phases, the inner and outer Six Pitches, all establishing their weights and measures to discern their kind. If the Great Elixir does not follow the yin-yang and Five Phases, precisely determining its kind, it will certainly not succeed. The Five Phases spoken of here are of the same marrow and kind. The Great Yang’s mercury is the Great Yang’s red marrow—cinnabar-mercury. It is also called Great Yang mercury. Great Yang is the alternate name for cinnabar. Great Yang realgar contains the essence it receives; Great Yin orpiment congeals its fluids with its kind—this is the great Way of the Returned Elixir. The essence is realgar, the yin-fluid is orpiment; these are alternate names for the Great Returned Elixir.\n\nMoreover, the male kind pertains to roasted cinnabar: when the male obtains roasted cinnabar and enters the crucible, it swiftly becomes a water like blood. Day and night, the fire burns, sealing it until it submits—thus, one knows it is not in error. If the male does not obtain roasted cinnabar, its color will not manifest. The female kind pertains to honey-water and fritillaria: when placed in a small crucible, the orpiment is dissolved and killed with fritillaria powder, then rapidly stirred and poured into honey-water. Neither loses its original nature. Other methods are difficult to align with their kind and should not be trusted.\n\nWhen yellow arsenic obtains halloysite, it immediately congeals and does not fly. When ground into a ceramic powder and packed into a tube, fired for twenty days, it submits without losing its original form. When sulfur enters magnetite, it is simmered with brine to become of the same kind. *Shu* is bittern. Simmer it in a ceramic vessel, ensuring no flame or fire that does not boil. Do not use the sulfur of Emperor Wu of Wei, which flows through the Five Transformations and Five Metals. After a hundred days of simmering, it is complete.\n\nMercury resembles rouge: when it obtains fire, it swiftly becomes water. The rouge is sulfur. Retrieve it quickly, for if delayed, fire will emerge and burn it spontaneously. After seven cycles, it becomes the Returned Elixir within the crucible. Ingesting it grants longevity and the power of transmutation. The rouge is sulfur, which transforms mercury into cinnabar. When mercury obtains sulfur, it no longer moves, for it is restrained by earth. Sulfur belongs to earth, and mercury, thus restrained, becomes like mud. When placed in the furnace and fired, it becomes cinnabar.\n\nThe Great Yin’s mountain soul resembles cinnabar and immediately becomes white mud. The cinnabar is mercury; the mountain soul is orpiment. Harmonize it with silver and nurture it for fifteen days. Xin-You is the position of metal. The Great Yang’s cinnabar-soul resembles unstrained wine. *Niang* is strong spring wine. From the third month, it enters the floating vessel, and by the fifth month’s longest day, it is placed in the sun. Naturally, it returns to frost—how can this not be trusted? This is the spontaneous transformation of yin and yang into the Returned Elixir, differing from the common, for it is the natural principle of heaven and earth. How can one claim that human effort can refine and transform it to achieve success?\n\nLead resembles the dead soul of mulberry ash. After nine cycles of refining in the ash, it enters the frost of the Red Crow’s foot, becoming the nine-cycle immortal elixir. It governs the Eight Stones and Five Metals, and those who ingest it attain longevity. Tin resembles litharge combined with the five-colored mountain soul. The mountain soul is the five kinds of halloysite. It becomes five-colored frost, which is then placed in the mercury-ox ford, applied to the elixir cauldron. Cover it with a wooden basin and fly it from Yin to Xu. The frost in the basin submits after twenty days of martial fire, burning day and night. The golden crucible and Five Metals do not begrudge this great secret, and the frost’s five colors are unparalleled.\n\nCopper resembles the essence of heavy cinnabar. The essence is coagulated cinnabar. When cinnabar enters the leaking furnace and undergoes fifty cycles, copper in three to five measures becomes white metal, which can immediately relieve poverty. Persian *shesu* (five catties) enters plain white frost to become of the same kind. The five catties of Persian *shesu* stone and the white frost are silver mixed in an earthen crucible. Cover it with *daoxing* divine bone to a thickness of five inches. Perform one cycle per hour, and add yin-beast juice to drip and collect the solidified substance. Gradually apply fire over three seasons to form the *shesu* powder’s beast juice. The black ox’s urine and *daoxing* divine bone are the salt of the Rong. Kunlun resembles sheep: Kunlun is azurite, like sheep’s fluid, which is sheep’s fat. When azurite is refined into a powdery fluid and mixed with sheep’s fat, then steamed with cinnabar rice for fifteen cycles, it submits within a small chamber. Regardless of the Five Metals, all can follow this method of submission. Do not let the essence’s blackness escape. After ten cycles of flying, it becomes the Green Dragon, standing erect to restrain vermilion.\n\nThe primordial essence is mercury. Mercury can also restrain cinnabar-red copper. Void resembles *daidan*: the void is malachite, and *daidan* is hematite. Grind them together in a bowl until powdery. Mix them with the primordial essence, steam them with cinnabar rice, then place them in a yellow earth crucible and seal it tightly. Burn it with Zi charcoal for twenty days, and it will immediately transform the Five Metals. Dry mercury swiftly becomes white metal.\n\nThis, too, is a method to save the world. The primordial essence is brine, also called the primordial yin essence. When yin subdues the Metal Duke, it swiftly becomes flying frost; when yang governs, it immediately requires pavilion fat. Pavilion fat is sulfur. The Metal Duke’s flying frost—mercury—momentarily turns to black mud. Placed in a Fengcheng porcelain vessel, it yields crimson frost and returns to essence: a great secret indeed. The child receives the mother, clad in coarse cloth to retain it. The child is mercury; the mother is silver. When the mother transforms the child, there is *geng* and the cycle is fixed. *Geng* is metal. Mercury, the child, is fixed by the cinnabar of silver. Thus transformed into a substance, it may be used. The root and subtle are fully subdued; the green vigor does not allow flight or coagulation, truly relying on the Great Yang, for yang unites with mercury. They contend as equals, mutually transforming and employing one another. Mercury and silver contend equally, each restraining the other. They can also hollow out and penetrate the eternal, ascending and descending with metal as their sign. This is the void of great hardness. If one wishes to fly the soul, to the ninth it returns to life; the seven talismans do not revert—nine is cinnabar, seven is mercury. Returning to metal to form the elixir, consuming it grants the spirit and soul longevity, equal to the sun, moon, heaven, and earth. Reverted, it becomes the five phases’ parents, sovereign and ministers—how could one set aside the great elixir? Mercury, belonging to one of the five phases, as parent, sovereign, or minister, can restrain and revert to become the great elixir. I have seen many schools’ teachings, all claiming their own ability without discerning yin and yang, ignorant of kindred types. Some great sages conceal their secrets in hidden sayings, yet fail to comprehend them upon reading, applying their own interpretations and straying far from the sages’ intent. To know the furnace and fire, to restrain and govern mineral medicines, one must seek prescriptions and commentaries, cultivate a tranquil mind in the classics, thoroughly understand the ancients’ texts, and devote careful thought—this is the great Dao. Now, the famous caves of various mountains yield different teachings from masters. Most alchemical schools discuss meanings and interpretations, each capable of practical work. All claim one must examine prescriptions and subtle principles, infer the ultimate truths of yin and yang, and thus know what is akin. The dragon and horse receive the harness—the dragon is *qian*, the horse is *kun*; these are vessels. Dragon and tiger devour each other—dragon is mercury, tiger is silver; the two substances harmonize, mutually consuming one another. Male and female unite—male and female conjoin, the male as yang, the female as yin; the two yellows harmonize their metal and mercury. Father and son share reverence—the father is cinnabar, the son is mercury. The mother transforms and contains the kind—the mother, metal, contains the mercury child. White and red float together—white alum and red salt. Black and green are both restrained—black silver and malachite. The six spirits revolve leftward, from *zi* to *si*, passing through my palace. This means starting with mercury as cinnabar, from *zi* (mercury) to *si* and *wu*, reverting mercury to red cinnabar. From the beginning, a brief rightward turn accords with heaven and earth—mercury turns left to right, forming the body of metal. Circulating through the eight nodes, fixing the four seasons, alternating captives contend for precedence, relying on the two solstices to determine days and hours, nurturing the fire. This verifies the position of the five—five is earth, referring to the union of yang and yin in blackness.\n\nIn praise:\nThe utmost sages and great worthies inscribed these three transformations.\n\nCinnabar resides in the south, yet also pertains to the east’s mercury, and likewise to the north. Each knows its position—dragon and tiger contend for precedence. Red marrow gradually turns purple; the tiger is silver, the dragon mercury. Red is cinnabar, and cinnabar is the name for that crimson hue. White alum connects to the primordial. Specifically born of alumstone, within lies bright alum, capable of restraining mercury. Bearing my eight stones—three yellows and five metals—these are called the eight stones. All settle in *qianqian*. In the north, mercury becomes gold.\n\nArranging the five directions: the five directions mean cinnabar is set forth among the five phases to enable their union. Miscellaneous categories are hard to speak of. Fix upon the Red Emperor—the Red Emperor is another name for mercury. Throughout the land, the five are relinquished. The principle of discarding the mother is that the child alone enacts it. Remove the stone, employing one to restrain nine—one part silver to nine parts mercury. Gold restrains mercury, thereby subduing it.\n\nEstablish the five and determine the seven. Seven is metal; five is orpiment. One black spans three nodes—one black for fifteen days, one node every five days. Seven and eight combine. The Way of seven and eight: seven parts mercury, seven taels; eight parts silver, eight taels. Another saying: seven and eight form an image in fifteen days. Here the reverted elixir appears.\n\nUse alumstone—namely, the three envoy medicines: the three envoys are chalcanthite, yellow alum, and white alum. Employ the two greens—*zeng* and *kong*. Yet one must not use *taiyin* primordial water stone, which is brine. Male and female unite with yellow—the three *bian* frosts, that is, sulfur. Refine with fire. Treat with water stone and salt, boiling for a month to subdue the fire. This is the preparation of the four yellows, where the five alums and the like are not used.\n\nThe two alums hold firm: the method of using fire—long with civil, short with martial—ensures the restraint is not lost. The great elixir medicine must not be placed upon raw charcoal; it requires matured fire.\n\nIn verse:\nDepth and length unite to grasp yin and yang.\nThe crucible’s form resembles an upturned moon,\nor like a sphere, its lower edges meeting the upper,\nrequiring careful crafting to avoid the slightest discrepancy.\nA thick base preserves the medicine forever—\nmeaning to fashion it from lead or silver,\nlike the form of *hundun*,\nnurturing the divine medicine to attain everlasting prosperity.\nThe sun’s flowing pearl enters the flower pond—\nthe flowing pearl is mercury.\nThe black pond’s left flavor:\nuse it to boil mercury and silver,\nthen bind the cinnabar grains,\ngrind them together, and place them in the vessel.\nRed salt and white snow form male and female—\nalum and brine are conjoined and refined\nto produce the crimson hue, hence called red salt.\nUse it to fly and create the elixir’s frost and snow.\nWhite snow and the two snows, male and female,\nare all names for these.\nThe Way is not distant, yet people do not know—\nthe method lies before their eyes, yet they remain unaware.\n\nRed dragon transforms into powder, mercury turns to red powder.\nWhite tiger sharp as frost.\nLead and mercury together transform all at once,\nlike frost and snow.\nWithin it, cast the stone liquid—\nstone liquid refers to sulfur.\nThen use the imperial flowing broth.\nTo subdue and refine the stone liquid,\none must employ the Dark Emperor’s flowing broth,\nwhich is the liquid of magnet mother.\n\nHarmonize the spirits of the five viscera to clarity,\nregulating and sustaining the fire’s movement,\nnurturing the five phases’ black spirits within the elixir chamber,\nas one preserves the five viscera in purity and solemnity.\n\nTo refine the Three Yellows:\nlead and mercury must be subdued by the Three Yellows’ fire\nto return to pure yang essence.\nThe Three Yellows belong to earth,\nand earth generates metal, hence their use.\nTheir nature is excessively hot,\nfor they are the essence of the Great Yang—\nmercury and lead thus employ them.\nThe Three Yellows are: one realgar, one orpiment, and one sulfur.\n\nAzurite can communicate with the divine luminants,\nbeing the sprout of metal and its messenger—\nrealgar, orpiment, sulfur, and gold thus become its blossoms.\n\nIn the Great Return Elixir,\nlead serves as the host,\nquicksilver as the sovereign,\nsulfur as the minister,\nrealgar as the general,\norpiment as the assistant,\nand azurite as the envoy.\nThus sovereign and minister pair,\nhost and general bind and subdue,\nassistant and envoy circulate and convey.\nThough initially borrowed as auxiliary aids,\nover time they become subdued fire ashes.\n\nNot yet discerning firm nature—\nraw mercury and hardened silver—\nrefers to the undifferentiated nature of mother and child.\nHow to employ yin and yang?\nYin and yang are Qian and Kun.\nThis means first determining the two medicines,\nthe crucible’s subjugation,\nthe fire’s cyclical application,\nand the mutual restraint of Qian and Kun’s two trigrams.\n\nFrom *zi* to *chen-si* is the direct tally,\nfrom *wu* to *xu-hai* is the direct affair—\nmodeling the hexagrams’ forms to fix the fire’s numbers.\n\n*Can Tong Qi’s* Five Categories of Secret Essentials concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "参同契五相类秘要 经名：参同契五相类秘要。 北宋卢天骥撰。 一卷。 底本出处：《正统道藏》洞神部众街类。 参同契五相类秘要 太素真人魏伯阳演宣德郎权发遣提举淮南西路学事赐徘鱼袋臣卢天骥上进 阳一二三四五 水火木金土 阴六七八九十 昔真人魏伯阳与淳于叔通，授青州徐从事《参同契》及古歌。 魏君丹成，撰此《五相类》。 后升云而去，令弟子大篆。 诸本并无，皆云《参同契》中卷是也，深属浅见矣。 且《五相类》者，论诸相类，伏制三黄二宝也，故云五也。 篇曰 天生元女者，水银也。 地生黄男者，黄金也。 皆禀性太和微妙之反，左阳右阴，即位而相通，谓水银与金，是天地冲和之正黑而生。 初为朱砂，属左，居束方。 后化为水银，居西方，为右，是借位也。 张翼飞虚危，此乃一变也。 张翼南方，朱砂也。 虚危北方宿，是汞。 从朱砂中所化出，乃从南飞向北方，即是一变也。 受生之性，一化为丹。 反砂为汞，反汞为丹，是丹一化矣。 既定升腾上宫，宫，南方朱宫，定汞变化也。 即无任万物矣。 为汞任化万物也。 太阳白汞，汞，水银也，阴之精者也。 本含赤水。 汞本是生出朱砂，故云含赤水者也。 返我丹液，返汞为朱砂，是夫妇也，汞本是朱砂也。 纯黑精元含青是也。 黑铅者，汞色青也，位属束方为朱，是木精，故云青也。 今四象定本，各有解者，则从性而和之。 悟者易，迷者难。",
      "translated_text": "*The Esoteric Essentials of the Five Correspondences of the Cantong qi*\n\n**Title:** *The Esoteric Essentials of the Five Correspondences of the Cantong qi*\nBy Lu Tianji of the Northern Song. One fascicle.\nSource of the base text: *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, *Zhongshu* Category.\n\n*The Esoteric Essentials of the Five Correspondences of the Cantong qi*\nPresented by the Imperial Academy Supervisor of Huainan West Circuit, Gentleman for Manifesting Virtue, Bearer of the Silver Fish-Tally, Your Servant Lu Tianji, on behalf of the Perfected of Great Simplicity, Wei Boyang.\n\nYang: one, two, three, four, five.\nWater, fire, wood, metal, earth.\nYin: six, seven, eight, nine, ten.\n\nFormerly, the Perfected Wei Boyang, together with Chunyu Shutong, transmitted the *Cantong qi* and ancient songs to Xu, the Attendant Officer of Qingzhou. After Master Wei attained the elixir, he composed these *Five Correspondences*. Later, he ascended on clouds and departed, commanding his disciple to inscribe them in large seal script. No other versions exist; all claim this to be the middle fascicle of the *Cantong qi*, though such views are shallow indeed.\n\nNow, the *Five Correspondences* discusses the mutual resonance of all things, the subjugation of the Three Yellows and Two Treasures—hence the name \"Five.\" The treatise states:\n\nWhat Heaven engenders as the Primordial Maiden is mercury.\nWhat Earth engenders as the Yellow Lad is gold.\nBoth receive the nature of the Great Harmony’s subtle reversal: left as yang, right as yin, taking their positions to interpenetrate. Thus, mercury and gold are the true essence of Heaven and Earth’s harmonious union, born from the primal darkness.\n\nInitially, it is cinnabar, belonging to the left and dwelling in the East. Later, it transforms into mercury, dwelling in the West as the right—this is the borrowing of position. *Zhang* and *Yi* soar to *Xu* and *Wei*: this is the first transformation. *Zhang* and *Yi* are the southern constellations, cinnabar; *Xu* and *Wei* are the northern lodgings, mercury. Emerging from cinnabar, it flies from south to north—this is the first transformation.\n\nBy the nature of its received life, it undergoes one transmutation into the elixir. Reversing cinnabar into mercury, reversing mercury into the elixir—thus the elixir is once transformed. Once stabilized, it ascends to the Upper Palace. The Palace is the Vermilion Palace of the South, where mercury’s transformations are fixed. Then, it is no longer subject to the myriad things, for mercury governs the transformations of the ten thousand beings.\n\nThe Great Yang’s white mercury—mercury is quicksilver, the essence of yin. It originally contains the Crimson Waters, for mercury is born from cinnabar, hence it is said to contain the Crimson Waters. \"Returning my elixir-fluid\": reversing mercury into cinnabar is the union of husband and wife, for mercury is originally cinnabar. Its pure black essence contains the Azure.\n\nBlack lead is mercury’s azure hue, its position belonging to the East as vermilion—this is the essence of wood, hence it is called azure. Now, the Four Images establish their roots, each with its own explanation, then follow their natures to harmonize them. For the awakened, it is easy; for the deluded, it is difficult.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 560,
      "start_sentence": 0,
      "end_sentence": 37,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.60452103614807,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\参同契五相类秘要.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "悟者甚易，迷者甚难。 元精春随斗柄，元精，子汞也，十一月建子，春阳黑生。 故十一月受阳分寸，言十一月斗建子起首也。 且束西互相吞也。 束方朱，西方银，以二物相吞之也。 阴凌据在酉，来往中宫。 中宫，雄黄也。 阴汞酉金，11物相据，初伏雄黑凌汞也。 二姓合和以金和汞也。 一云以汞和砂也。 为妻为子，为母为君，为臣为佐。 水银用铅为妻，亦如子母君臣也。 今得节符而制御之，如水灭火，火必伏矣。 若依时节火候进退，五行转制，金汞自伏矣。 直符直事，定升降而必成。 今参同以五行，内外六律，皆定分两而知同类。 夫大丹若不依阴阳五行，刻定同类，必不得成之矣。 今所说五行，赤髓同类。 太阳水银，是太阳赤髓，朱砂汞也。 又名太阳汞。 太阳是朱砂之slJ名也。 太阳雄黄，雄精含受，太阴雌黄，凝津同类，是还丹之大道也。 雄精雄黄也，阴津雌黄也，此是大还丹别名也。 且雄类於炮砂，雄得炮砂，入锅子内，须臾成水如血汁，日夕火烧，闭塞已伏，故知不谬矣。 夫雄不得炮砂色不行。 雌黄类於蜜水贝母，入小锅子，消雌煞以贝母末，急搅之后，泻出蜜水中，各不损本性，自余方法甚难同类，勿可信之也。 毗黄得石脂，立凝而不飞。 入磁末，筑入筒中，火之二十日而伏，将此伏不失本体。 石硫黄入磁石，殊汁煎而同类。 殊，卤殊也。 将入磁器中煎，不得令有焰，及有火不沸火，亦不得用武成帝硫流五化五金，百日而煎，毕之矣。 汞类亭脂，得火倏忽成水。 亭脂，硫黄也。 成水急取之，迟即有火出自烧。 至七褊作中还丹，饵之长生，堪点化也。 亭脂是石硫黄，化汞为朱砂，汞得石硫黄，更不动为被土制也。 硫黄属土，汞被制如泥，入炉烧成丹砂。 太阴山魂，类同砂子，立成白泥。 砂子，汞也。 山魂，雌黄。 和银下养之十五日。 辛酉，金之位也。 太阳丹魂朱砂，同类於醇酝。 酦，大春酒也。 从三月入浮，至五月盛日中安浮之，自然返为霜，岂不信乎。 此阴阳自化为还丹，与俗之异，皆天地自然之理。 何言人能制造，化而得成也。 铅同类於桑灰死魂。 入灰坏炼九褊后，入赤乌脚脂霜，成九褊神仙丹，理八石五金，人饵者长生也。 锡类蜜陀僧加五色山魂。 山魂者，五种石脂也。 成霜五色，将以入砂牛津中，涂丹釜上，木盆子合头飞之，从寅至戌，伏盆霜，二十日武火，昼夜不止，金鼎五金不爱大秘，其霜五色无比也。 襁同类於重砂子魂精。 精者，结砂。 言砂入漏炉药五十褊后，襁三五数成白金，可以立救贫乏矣。 波斯折输五斤，入素白霜而同类。 波斯输石五斤，白霜是银和土锅，上以到行神骨覆之，厚五寸，一时一褊，入阴兽汁淋取实坚渐渐与火三季，是成输屑之兽汁者。 黑牛尿到行神骨，是戎食盐也。 昆仑同类羯羊。 昆仑，曾青也。 似羊津，是羊脂也。 曾青治之如粉津，拌羊脂，入砂饭蒸十五褊，后於小室中伏。 不问五金，总可为依伏法。 勿使精华黑出。 飞可十周，成青龙，翘立制朱。 元精，汞也。 汞素亦可制丹阳赤铜也。 空类於代丹。 空即空青也，代丹代赭也。 同於钵中，研如粉。 以元精拌之，入砂饭中蒸之，后入黄土埚中固济，子东炭烧之二十日，立化五金，乾汞须臾成白金。",
      "translated_text": "For the awakened, it is exceedingly easy; for the deluded, exceedingly difficult.\n\nThe primordial essence follows the Dipper’s handle in spring—this primordial essence is the Zi-mercury. In the eleventh month, when Zi is established, the spring yang’s blackness arises. Thus, in the eleventh month, it receives the yang by the inch, for the eleventh month is when the Dipper’s handle begins at Zi. Moreover, east and west mutually devour one another: the east is vermilion, the west is silver, and these two substances consume each other. Yin’s encroachment resides in You, coming and going through the Central Palace. The Central Palace is realgar. Yin-mercury, the You-metal, and the eleven substances contend, initially subduing the realgar’s blackness to dominate the mercury. The two natures harmonize, using metal to harmonize mercury—some say using mercury to harmonize cinnabar. It serves as wife and child, as mother and lord, as minister and assistant. When mercury employs lead as its wife, it is like the relationship of child and mother, lord and minister. Now, by obtaining the nodal tally to govern and restrain it, it is like water extinguishing fire, and the fire must submit. If one follows the seasonal nodes and the timing of the fire’s advance and retreat, the Five Phases transform and restrain, and metal and mercury will naturally submit. With the tally upright and the task direct, ascent and descent are determined, and success is assured.\n\nNow, the *Cantong Qi* aligns with the Five Phases, the inner and outer Six Pitches, all establishing their weights and measures to discern their kind. If the Great Elixir does not follow the yin-yang and Five Phases, precisely determining its kind, it will certainly not succeed. The Five Phases spoken of here are of the same marrow and kind. The Great Yang’s mercury is the Great Yang’s red marrow—cinnabar-mercury. It is also called Great Yang mercury. Great Yang is the alternate name for cinnabar. Great Yang realgar contains the essence it receives; Great Yin orpiment congeals its fluids with its kind—this is the great Way of the Returned Elixir. The essence is realgar, the yin-fluid is orpiment; these are alternate names for the Great Returned Elixir.\n\nMoreover, the male kind pertains to roasted cinnabar: when the male obtains roasted cinnabar and enters the crucible, it swiftly becomes a water like blood. Day and night, the fire burns, sealing it until it submits—thus, one knows it is not in error. If the male does not obtain roasted cinnabar, its color will not manifest. The female kind pertains to honey-water and fritillaria: when placed in a small crucible, the orpiment is dissolved and killed with fritillaria powder, then rapidly stirred and poured into honey-water. Neither loses its original nature. Other methods are difficult to align with their kind and should not be trusted.\n\nWhen yellow arsenic obtains halloysite, it immediately congeals and does not fly. When ground into a ceramic powder and packed into a tube, fired for twenty days, it submits without losing its original form. When sulfur enters magnetite, it is simmered with brine to become of the same kind. *Shu* is bittern. Simmer it in a ceramic vessel, ensuring no flame or fire that does not boil. Do not use the sulfur of Emperor Wu of Wei, which flows through the Five Transformations and Five Metals. After a hundred days of simmering, it is complete.\n\nMercury resembles rouge: when it obtains fire, it swiftly becomes water. The rouge is sulfur. Retrieve it quickly, for if delayed, fire will emerge and burn it spontaneously. After seven cycles, it becomes the Returned Elixir within the crucible. Ingesting it grants longevity and the power of transmutation. The rouge is sulfur, which transforms mercury into cinnabar. When mercury obtains sulfur, it no longer moves, for it is restrained by earth. Sulfur belongs to earth, and mercury, thus restrained, becomes like mud. When placed in the furnace and fired, it becomes cinnabar.\n\nThe Great Yin’s mountain soul resembles cinnabar and immediately becomes white mud. The cinnabar is mercury; the mountain soul is orpiment. Harmonize it with silver and nurture it for fifteen days. Xin-You is the position of metal. The Great Yang’s cinnabar-soul resembles unstrained wine. *Niang* is strong spring wine. From the third month, it enters the floating vessel, and by the fifth month’s longest day, it is placed in the sun. Naturally, it returns to frost—how can this not be trusted? This is the spontaneous transformation of yin and yang into the Returned Elixir, differing from the common, for it is the natural principle of heaven and earth. How can one claim that human effort can refine and transform it to achieve success?\n\nLead resembles the dead soul of mulberry ash. After nine cycles of refining in the ash, it enters the frost of the Red Crow’s foot, becoming the nine-cycle immortal elixir. It governs the Eight Stones and Five Metals, and those who ingest it attain longevity. Tin resembles litharge combined with the five-colored mountain soul. The mountain soul is the five kinds of halloysite. It becomes five-colored frost, which is then placed in the mercury-ox ford, applied to the elixir cauldron. Cover it with a wooden basin and fly it from Yin to Xu. The frost in the basin submits after twenty days of martial fire, burning day and night. The golden crucible and Five Metals do not begrudge this great secret, and the frost’s five colors are unparalleled.\n\nCopper resembles the essence of heavy cinnabar. The essence is coagulated cinnabar. When cinnabar enters the leaking furnace and undergoes fifty cycles, copper in three to five measures becomes white metal, which can immediately relieve poverty. Persian *shesu* (five catties) enters plain white frost to become of the same kind. The five catties of Persian *shesu* stone and the white frost are silver mixed in an earthen crucible. Cover it with *daoxing* divine bone to a thickness of five inches. Perform one cycle per hour, and add yin-beast juice to drip and collect the solidified substance. Gradually apply fire over three seasons to form the *shesu* powder’s beast juice. The black ox’s urine and *daoxing* divine bone are the salt of the Rong. Kunlun resembles sheep: Kunlun is azurite, like sheep’s fluid, which is sheep’s fat. When azurite is refined into a powdery fluid and mixed with sheep’s fat, then steamed with cinnabar rice for fifteen cycles, it submits within a small chamber. Regardless of the Five Metals, all can follow this method of submission. Do not let the essence’s blackness escape. After ten cycles of flying, it becomes the Green Dragon, standing erect to restrain vermilion.\n\nThe primordial essence is mercury. Mercury can also restrain cinnabar-red copper. Void resembles *daidan*: the void is malachite, and *daidan* is hematite. Grind them together in a bowl until powdery. Mix them with the primordial essence, steam them with cinnabar rice, then place them in a yellow earth crucible and seal it tightly. Burn it with Zi charcoal for twenty days, and it will immediately transform the Five Metals. Dry mercury swiftly becomes white metal.",
      "overlap_context": "rs. \"Returning my elixir-fluid\": reversing mercury into cinnabar is the union of husband and wife, for mercury is originally cinnabar. Its pure black essence contains the Azure.\n\nBlack lead is mercury’s azure hue, its position belonging to the East as vermilion—this is the essence of wood, hence it is called azure. Now, the Four Images establish their roots, each with its own explanation, then follow their natures to harmonize them. For the awakened, it is easy; for the deluded, it is difficult.",
      "start_char": 560,
      "end_char": 1772,
      "start_sentence": 38,
      "end_sentence": 108,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.49429368972778,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\参同契五相类秘要.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "亦救世之法。 元津是卤殊汁亦号太阴元精也。 阴伏金公，倏忽於飞霜，阳制立要亭脂。 亭脂，硫黄也。 金公飞霜以水银，须臾成黑泥，入丰城磁器中，得绛霜还精，大秘矣。 子受母，即被褐而留之。 子，水银也。 母，银是也。 母变子，即有庚而句定。 庚，金也。 子汞被银丹句定也。 因转成物，即用之。 根微毕伏之，绿挚不使飞凝，实赖太阳，阳合汞也。 而相俱敌，互为化用。 汞银同敌，互相制伏也。 亦能空同洞长，以金为号升降。 是空大刚。 若欲飞魂，至九归命，七符不还，九是朱，七是汞也。 归金成丹，饵之即神魂长生，与日月天地齐毕矣。 返成五行父母君臣，如何可置大丹，次也。 汞属五行之一，为父母君臣能制御之返为大丹者也。 吾见诸家所说，皆自谓我能不辨阴阳，不知同类，或大圣隐说其诀，又不解看，用意自裁，殊失圣旨。 夫欲知炉火，制御石药，须寻方疏，志闲经术，必洞晓古人之文，更致意思，即是大道也。 今诸山名洞，遂寻师旨，各各不同。 但多经方诸家，尽说义解商量，亦自能下手。 皆称云须诸方疏细义，推阴阳至理，而知同者矣。 龙马受驾，龙，乾也。 马，坤也。 器物是也。 龙虎相吞。 龙汞虎银，二物相和，交互相吞食也。 男女交媾，男女交媾，男雄女雌，二黄和其金汞者也。 父子善钦。 父朱子汞。 母变含类，母金含汞子也。 白赤相浮。 白矾赤盐。 黑青俱拘，黑银曾青。 左旋六神，从子至巳。 已历我宫。 谓从汞为朱砂，从子是汞，转到於巳午，返汞为赤砂矣。 从来右转暂过，故符天地。 谓汞自左至于右，成金之体也。 周巡八节，而定四时，迭虏争先，依二至，定日时，养火矣。 以验五之位也。 五土也，谓雄雌合黑也。 赞曰 至圣大贤，着在三变。",
      "translated_text": "This, too, is a method to save the world. The primordial essence is brine, also called the primordial yin essence. When yin subdues the Metal Duke, it swiftly becomes flying frost; when yang governs, it immediately requires pavilion fat. Pavilion fat is sulfur. The Metal Duke’s flying frost—mercury—momentarily turns to black mud. Placed in a Fengcheng porcelain vessel, it yields crimson frost and returns to essence: a great secret indeed. The child receives the mother, clad in coarse cloth to retain it. The child is mercury; the mother is silver. When the mother transforms the child, there is *geng* and the cycle is fixed. *Geng* is metal. Mercury, the child, is fixed by the cinnabar of silver. Thus transformed into a substance, it may be used. The root and subtle are fully subdued; the green vigor does not allow flight or coagulation, truly relying on the Great Yang, for yang unites with mercury. They contend as equals, mutually transforming and employing one another. Mercury and silver contend equally, each restraining the other. They can also hollow out and penetrate the eternal, ascending and descending with metal as their sign. This is the void of great hardness. If one wishes to fly the soul, to the ninth it returns to life; the seven talismans do not revert—nine is cinnabar, seven is mercury. Returning to metal to form the elixir, consuming it grants the spirit and soul longevity, equal to the sun, moon, heaven, and earth. Reverted, it becomes the five phases’ parents, sovereign and ministers—how could one set aside the great elixir? Mercury, belonging to one of the five phases, as parent, sovereign, or minister, can restrain and revert to become the great elixir. I have seen many schools’ teachings, all claiming their own ability without discerning yin and yang, ignorant of kindred types. Some great sages conceal their secrets in hidden sayings, yet fail to comprehend them upon reading, applying their own interpretations and straying far from the sages’ intent. To know the furnace and fire, to restrain and govern mineral medicines, one must seek prescriptions and commentaries, cultivate a tranquil mind in the classics, thoroughly understand the ancients’ texts, and devote careful thought—this is the great Dao. Now, the famous caves of various mountains yield different teachings from masters. Most alchemical schools discuss meanings and interpretations, each capable of practical work. All claim one must examine prescriptions and subtle principles, infer the ultimate truths of yin and yang, and thus know what is akin. The dragon and horse receive the harness—the dragon is *qian*, the horse is *kun*; these are vessels. Dragon and tiger devour each other—dragon is mercury, tiger is silver; the two substances harmonize, mutually consuming one another. Male and female unite—male and female conjoin, the male as yang, the female as yin; the two yellows harmonize their metal and mercury. Father and son share reverence—the father is cinnabar, the son is mercury. The mother transforms and contains the kind—the mother, metal, contains the mercury child. White and red float together—white alum and red salt. Black and green are both restrained—black silver and malachite. The six spirits revolve leftward, from *zi* to *si*, passing through my palace. This means starting with mercury as cinnabar, from *zi* (mercury) to *si* and *wu*, reverting mercury to red cinnabar. From the beginning, a brief rightward turn accords with heaven and earth—mercury turns left to right, forming the body of metal. Circulating through the eight nodes, fixing the four seasons, alternating captives contend for precedence, relying on the two solstices to determine days and hours, nurturing the fire. This verifies the position of the five—five is earth, referring to the union of yang and yin in blackness.\n\nIn praise:\nThe utmost sages and great worthies inscribed these three transformations.",
      "overlap_context": "ng erect to restrain vermilion.\n\nThe primordial essence is mercury. Mercury can also restrain cinnabar-red copper. Void resembles *daidan*: the void is malachite, and *daidan* is hematite. Grind them together in a bowl until powdery. Mix them with the primordial essence, steam them with cinnabar rice, then place them in a yellow earth crucible and seal it tightly. Burn it with Zi charcoal for twenty days, and it will immediately transform the Five Metals. Dry mercury swiftly becomes white metal.",
      "start_char": 1772,
      "end_char": 2439,
      "start_sentence": 109,
      "end_sentence": 156,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.286970376968384,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\参同契五相类秘要.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "朱在南方，又属束方水银，又属北方也。 各知部位，龙虎争先。 赤髓渐紫，虎银龙汞，赤是丹砂，丹砂者，为赤色之名也。 白矾通元。 特生矾石，内有明矾，能制汞也。 载我八石，三黄五金，是日八石。 俱定乾乾。 北方汞为金也。 设陈五方，五方者，朱砂当於五行陈设，令相合。 杂类难言。 定取赤帝，赤帝，汞别名也。 率土五捐。 批母之义，子特行之。 去石也，用一拘九，一银九汞也。 金拘汞，而相制伏也。 将五定七。 七金也，五雌黄也。 一黑三节，一黑十五日，五日一节也。 七八合成。 七八之道，七汞七两，八银八两。 一云七八，乃十五日而成象也。 即还丹之见焉。 使矾石，即用三使药，三使，石胆黄白二矾。 用二青，曾空谓也。 而不得用太阴元水石，卤盥是也。 雄雌毗黄，三褊霜也。 石硫黄。 以火溜过。 用水石盐煮之一月，令伏火。 此四黄煎制。 即不用五矾之类也。 二矾苍持，用火之诀，长先文，短用武，即不失制也。 大丹药不得下着生炭，须熟火也。 歌曰 棱深长合取阴阳，鼎器状如仰月，亦如球子，两头以下棱合着上棱，须着意作之，不令小有参差。 底厚能存药永昌。 谓以铅银为之，如混沌之形，存养神药，以获昌隆也。 太阳流珠入华池，流珠，汞也。 黑池左味，用煮汞银，用结了砂子，和研之入器用矣。 赤盐白雪成雄雌，矾盥合炼，以成赤色，故号曰赤盐。 用以飞造丹之霜雪也。 白雪并雌雄二雪，皆其名矣。 去道非远人不知。 言法目前，而人不知。",
      "translated_text": "Cinnabar resides in the south, yet also pertains to the east’s mercury, and likewise to the north. Each knows its position—dragon and tiger contend for precedence. Red marrow gradually turns purple; the tiger is silver, the dragon mercury. Red is cinnabar, and cinnabar is the name for that crimson hue. White alum connects to the primordial. Specifically born of alumstone, within lies bright alum, capable of restraining mercury. Bearing my eight stones—three yellows and five metals—these are called the eight stones. All settle in *qianqian*. In the north, mercury becomes gold.\n\nArranging the five directions: the five directions mean cinnabar is set forth among the five phases to enable their union. Miscellaneous categories are hard to speak of. Fix upon the Red Emperor—the Red Emperor is another name for mercury. Throughout the land, the five are relinquished. The principle of discarding the mother is that the child alone enacts it. Remove the stone, employing one to restrain nine—one part silver to nine parts mercury. Gold restrains mercury, thereby subduing it.\n\nEstablish the five and determine the seven. Seven is metal; five is orpiment. One black spans three nodes—one black for fifteen days, one node every five days. Seven and eight combine. The Way of seven and eight: seven parts mercury, seven taels; eight parts silver, eight taels. Another saying: seven and eight form an image in fifteen days. Here the reverted elixir appears.\n\nUse alumstone—namely, the three envoy medicines: the three envoys are chalcanthite, yellow alum, and white alum. Employ the two greens—*zeng* and *kong*. Yet one must not use *taiyin* primordial water stone, which is brine. Male and female unite with yellow—the three *bian* frosts, that is, sulfur. Refine with fire. Treat with water stone and salt, boiling for a month to subdue the fire. This is the preparation of the four yellows, where the five alums and the like are not used.\n\nThe two alums hold firm: the method of using fire—long with civil, short with martial—ensures the restraint is not lost. The great elixir medicine must not be placed upon raw charcoal; it requires matured fire.\n\nIn verse:\nDepth and length unite to grasp yin and yang.\nThe crucible’s form resembles an upturned moon,\nor like a sphere, its lower edges meeting the upper,\nrequiring careful crafting to avoid the slightest discrepancy.\nA thick base preserves the medicine forever—\nmeaning to fashion it from lead or silver,\nlike the form of *hundun*,\nnurturing the divine medicine to attain everlasting prosperity.\nThe sun’s flowing pearl enters the flower pond—\nthe flowing pearl is mercury.\nThe black pond’s left flavor:\nuse it to boil mercury and silver,\nthen bind the cinnabar grains,\ngrind them together, and place them in the vessel.\nRed salt and white snow form male and female—\nalum and brine are conjoined and refined\nto produce the crimson hue, hence called red salt.\nUse it to fly and create the elixir’s frost and snow.\nWhite snow and the two snows, male and female,\nare all names for these.\nThe Way is not distant, yet people do not know—\nthe method lies before their eyes, yet they remain unaware.",
      "overlap_context": "e beginning, a brief rightward turn accords with heaven and earth—mercury turns left to right, forming the body of metal. Circulating through the eight nodes, fixing the four seasons, alternating captives contend for precedence, relying on the two solstices to determine days and hours, nurturing the fire. This verifies the position of the five—five is earth, referring to the union of yang and yin in blackness.\n\nIn praise:\nThe utmost sages and great worthies inscribed these three transformations.",
      "start_char": 2439,
      "end_char": 3008,
      "start_sentence": 157,
      "end_sentence": 200,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.739327907562256,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\参同契五相类秘要.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "赤龙化为粉，汞化为赤粉。 白虎利如霜。 铅和汞一时总变，如霜雪也。 其中投石液，石液谓硫黄也。 还用帝流浆。 伏制石液，当用玄帝流浆，玄帝流浆者，磁母之液也。 调神五藏清，调持运火，存养五行神黑，於丹室之中，如人能保五藏於清肃也。 欲得炼三黄。 铅汞须得伏火三黄，以返纯阳之质，三黄属土，土能生金，故用之矣。 兼性太热，并是太阳之精，汞玲故用之。 三黄，一雄一雌一硫是也。 曾青能通神明，是金之苗，为金之使，雄雌硫金乃为之华也。 夫大还丹，用铅为主，用水银为君，硫黄为臣，雄黄为将，雌为佐，曾青为使。 故君臣配合，主将拘伏，使佐宣通，虽用借为傍助，久久为伏火灰矣。 未审坚性，素汞坚银也，未审分辨之性也。 谓子母如未分。 如何使阴阳，阴阳乾坤是矣。 谓先定二药，及鼎器伏制，火记运用，乾坤二卦，递相承制也。 从子到辰巳为直符，从午到戌亥为直事，体法卦象，定火数也。 参同契五相类秘要竟",
      "translated_text": "Red dragon transforms into powder, mercury turns to red powder.\nWhite tiger sharp as frost.\nLead and mercury together transform all at once,\nlike frost and snow.\nWithin it, cast the stone liquid—\nstone liquid refers to sulfur.\nThen use the imperial flowing broth.\nTo subdue and refine the stone liquid,\none must employ the Dark Emperor’s flowing broth,\nwhich is the liquid of magnet mother.\n\nHarmonize the spirits of the five viscera to clarity,\nregulating and sustaining the fire’s movement,\nnurturing the five phases’ black spirits within the elixir chamber,\nas one preserves the five viscera in purity and solemnity.\n\nTo refine the Three Yellows:\nlead and mercury must be subdued by the Three Yellows’ fire\nto return to pure yang essence.\nThe Three Yellows belong to earth,\nand earth generates metal, hence their use.\nTheir nature is excessively hot,\nfor they are the essence of the Great Yang—\nmercury and lead thus employ them.\nThe Three Yellows are: one realgar, one orpiment, and one sulfur.\n\nAzurite can communicate with the divine luminants,\nbeing the sprout of metal and its messenger—\nrealgar, orpiment, sulfur, and gold thus become its blossoms.\n\nIn the Great Return Elixir,\nlead serves as the host,\nquicksilver as the sovereign,\nsulfur as the minister,\nrealgar as the general,\norpiment as the assistant,\nand azurite as the envoy.\nThus sovereign and minister pair,\nhost and general bind and subdue,\nassistant and envoy circulate and convey.\nThough initially borrowed as auxiliary aids,\nover time they become subdued fire ashes.\n\nNot yet discerning firm nature—\nraw mercury and hardened silver—\nrefers to the undifferentiated nature of mother and child.\nHow to employ yin and yang?\nYin and yang are Qian and Kun.\nThis means first determining the two medicines,\nthe crucible’s subjugation,\nthe fire’s cyclical application,\nand the mutual restraint of Qian and Kun’s two trigrams.\n\nFrom *zi* to *chen-si* is the direct tally,\nfrom *wu* to *xu-hai* is the direct affair—\nmodeling the hexagrams’ forms to fix the fire’s numbers.\n\n*Can Tong Qi’s* Five Categories of Secret Essentials concludes.",
      "overlap_context": "eft flavor:\nuse it to boil mercury and silver,\nthen bind the cinnabar grains,\ngrind them together, and place them in the vessel.\nRed salt and white snow form male and female—\nalum and brine are conjoined and refined\nto produce the crimson hue, hence called red salt.\nUse it to fly and create the elixir’s frost and snow.\nWhite snow and the two snows, male and female,\nare all names for these.\nThe Way is not distant, yet people do not know—\nthe method lies before their eyes, yet they remain unaware.",
      "start_char": 3008,
      "end_char": 3385,
      "start_sentence": 201,
      "end_sentence": 220,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.633687734603882,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\参同契五相类秘要.txt",
        "category": "众术类"
      }
    }
  ]
}