{
  "source_id": "吕祖指玄篇诗注",
  "source_file": "chunked_daozang\\吕祖指玄篇诗注.json",
  "total_chunks": 10,
  "total_original_chars": 6795,
  "total_translated_chars": 38955,
  "total_translation_time": 211.85789918899536,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\吕祖指玄篇诗注.txt",
    "category": "藏外"
  },
  "full_translation": "**Preface by Patriarch Lü Himself**\n\nI once devoted myself to Confucian scholarship and sat for examinations, but on the road I encountered the Immortal Elder of True Yang, who took pity on my ignorance and pointed me toward the Great Dao. Thereupon, I abandoned worldly rank and fame. At first, I harbored doubts, but later, through his guidance, I came to awakening. I sought the sagely master again, traversing mountains and rivers until I reached Zhongnan, where I bowed my head and inquired into the root of things. Without reproaching my past transgressions, he bestowed upon me the *Supreme Most Wondrous Scripture of Limitless Salvation* and the *Secret Formulas of the Alchemical Chamber*, repeatedly exhorting me with earnest warnings. He commanded me to treasure them, cultivate the Great Dao in secret, gather and refine the Reverted Elixir, escape birth and death, enter the Gate of the Inaudible and Invisible, and wander in the realm of longevity.\n\nHaving received these teachings, I rejoiced and revered them, kowtowing in gratitude. I took leave of the sagely master and wandered the dusty world, vowing to guide a hundred souls to Daoist attainment and uphold the true wind. Yet to my dismay, the deluded of this world know only to fear death but not to seek life; they fail to awaken to the mysterious mechanism, remain blind to the wondrous principle, and instead slander and defame. Some cling stubbornly to perverse delusions, while others consume minerals and herbs—all manner of foolishness leading them into deeper confusion. Even unto old age and death, they remain unrepentant. How deeply lamentable!\n\nThough I pity them, I am powerless to save them. Thus, I composed this *Pointers to the Mysterious* and left it in a stone chamber on Mount Qingcheng. I bowed to heaven, brushed my sleeves, and departed. Should a noble person of later times encounter this book, it shall be by karmic affinity of three lifetimes. Receive my secret formulas, but first ensure your robes and cap are properly arranged, prepare incense, fire, lamps, and water, and on a quiet night face the Northern Dipper to offer thanks to the lofty immortals. Day by day, cultivate sincerity, and the immortals and sages will be moved to respond. A luminous master will then reveal the subtlest intricacies—the advance and retreat of water and fire, the weights and measures of medicinal substances. Once enlightened, you may begin the concealed practice, forging the Great Elixir of Dragon and Tiger, refining the embryo to transcend the mortal form, extending life and prolonging years. Dispel demons and sever monstrosities, fulfill the three thousand meritorious deeds, and in an instant receive the celestial summons to ascend, roaming carefree beyond the mundane, your years equal to heaven’s, no different from mine.\n\nThis is my preface.\n\n---\n\n**Pointers to the Mysterious: Three Brilliances, First Section**\n\n**1.**\nThe worldly, lost in emptiness, do not awaken;\nEnsnared by flowers and wine, heroes fade away.\nSpring nights stretch long, yet joy is fleeting;\nTime presses on, death’s limit ever near.\nCrafty as a cat stalking a mouse,\nSwift as an arrow loosed from the bow.\nUnknowing, they exhaust their spirit,\nWishing only to bury their corpse in the earth.\n\n**Bai Yuchan’s Commentary:**\nThe merciful Patriarch Pure Yang opened wide the path of deliverance. Thus, he laments the perilous crookedness and delusion of worldly folk, who bring ruin upon themselves. Those who read this later should recognize the truth in the immortal elder’s words—now is the time to turn back and awaken to the Dao. Do not squander this fleeting time. Were it not for boundless compassion, who would trouble themselves to admonish others so earnestly?\n\n**2.**\nIn years past, I too entered the examination hall,\nWhen by chance I met an immortal elder by the ancient road.\nA gust of fragrant wind stirred his feathered sleeves,\nA thousand ribbons of cloud swirled around his rainbow robes.\nHis words, each one, expounded the mysterious principle;\nHis voice, each note, chanted the cavern’s hymns.\nI coveted neither rank nor glory,\nBut was taught again and again to refine the Yellow Chamber.\n\n**Bai Yuchan’s Commentary:**\nThis poem laments the author’s encounter with the Ancestral Master Zhongli, who expounded the Dao and exhorted him to transform. Feathered sleeves and cloud-woven robes are the attire of immortals; the mysterious principle and cavern hymns are their practice. The *Yellow Chamber* is not the worldly Yellow Chamber, but the central position of Earth, the abode of the Yellow Emperor.\n\n**3.**\nThe mysterious verses speak endlessly of yin and yang,\nTwo words that reign as kings of all methods.\nA single grain of millet holds a world within;\nHalf a pint’s cauldron boils mountains and rivers.\nThe Azure Dragon drives fire through the lotus chamber;\nThe White Tiger stirs waves from the cavern’s depths.\nThis art is truly wondrous—\nMaster it, and you shall ascend to heaven in a single step.\n\n**Bai Yuchan’s Commentary:**\nThe two words *yin* and *yang* contain the most wondrous principle. If you wish to perceive their form, look to the Dragon and Tiger. The *single grain* is the primordial qi of the undifferentiated beginning, which encompasses heaven and earth and nurtures all living things. The *half-pint cauldron* is the vessel for refining the medicine—not an iron cauldron. The Azure Dragon resides in the East, where Wood generates Fire, hence it is said to *drive fire*. This is no ordinary fire or water. If you seek the Great Medicine, you will find it is a living thing, capable of movement.\n\nThe lotus chamber is the place of the cinnabar chamber.\nThe White Tiger resides in the West, where Metal generates Water, hence it is said to *stir waves*.\nThese waves are not ocean waves, nor is this Metal ordinary metal. If you seek Metal and Water, they have hands that can grasp—also living things.\nIn recent times, many cling to mundane fire and water, forging metals, minerals, herbs, and trees to cultivate the body—how deeply lamentable.\nThe cavern chamber is where the elixir emerges.\n\nAlas!\nThose who study this text should know why immortals praise the Great Elixir.\nIf you attain it, ascending to heaven or descending to earth becomes unfathomable.\n\n**Fourth Stanza:**\nSeek heaven and dig earth to behold the celestial light;\nPlant the golden flower—truly mighty is its fruit.\nFear not the hungry ghosts of this world,\nNor dread the underworld’s King Yama.\nWith upright heart, gather the Yellow Dragon’s marrow;\nOpen your mouth to seize and swallow the White Tiger’s nectar.\nWere it not for the sacred master’s teachings of that day,\nWho could compose such verses?\n\n**Bai Yuchan’s Commentary:**\nLaozi said: *\"It is born before heaven and earth.\"*\nIf you wish to perceive it, you must seek heaven and dig earth.\nOnce found and grasped, what fear remains of ghosts and spirits?\n\nThe Yellow Dragon’s marrow and White Tiger’s nectar are but names for the medicine.\nPure Yang received the transmission from Zhongli, mastered the mysteries, and composed these verses on the Great Elixir to leave for the world.\nLet readers ponder and embrace these profound words.\n\n**Fifth Stanza:**\nOne, three, five—all numbers are spring;\nAfter earth, before heaven, the Old Lord appears.\nFlowers bloom in the western river, brocade unfurled;\nThe moon shines bright o’er the northern sea, winds and clouds rejoice.\nCast aside worldly pursuits to seek it here,\nAnd cease chasing vain splendor in external things.\nWith every thought, forget the dust-bound realm—\nIn stillness, another heaven and earth arise.\n\nBai Yuchan’s Commentary:\nOne, three, five are yang numbers;\nTwo, four, eight are yin numbers.\nThose who cultivate immortality must understand that one generates two, two generates three, and three generates the myriad things—then they may obtain the supreme treasure of the Returned Elixir, and must not let it slip away.\n\"After earth, before heaven\" means receiving the earth’s solitary yang qi, which ascends to heaven; heaven’s solitary yin qi descends to earth. When the two qi intersect, the myriad things arise—this is the *Tai* hexagram. When they do not intersect, it is the *Pi* hexagram.\nTrue yin and true yang lie hidden within heaven and earth, formless and traceless, invisible and inaudible. If one can seize them, it is like flowers blooming and the moon shining bright—all is one intent.\nFlowers bloom in spring; the moon is full on the fifteenth. In refining the elixir, one must recognize the proper time.\nWithout a true master, even written words are hard to grasp.\nIf one receives the master’s guidance, cast aside worldly affairs, seize the moment, and cultivate urgently—delay not.\nFor if you delay, the medicine will pass, and all will be in vain.\nWhen refining the medicine, let every thought be unwavering, the Dao-heart firm as iron. Do not be led astray by the dust-bound realm, nor blinded by sensual desires. In movement, attain stillness—this is the subtle mystery.\nThere is work in movement, and work in stillness.\nAlas!\n\nWonderful, this intent!\nThe study of the Dao has no before or after—\nnew shoots grow as tall as old bamboo.\n\nSixth:\nNothing in the world can open the heart;\nI urge all people: do not bury yourselves.\nSeize the true meeting of wind and cloud,\nand seek the hidden harmony of phoenix and simurgh.\n\nWho can match the twofold heaven and earth?\nI alone arrange the fourfold yin and yang.\nIf you grasp this most subtle inner matter,\nyou need not fear wolves and jackals blocking the way.\n\nMaster Jade Toad says:\nWorldly glory, wealth, and honor\nare but nets cast across the sky.\nAll beings are ensnared by them,\nand thus their hearts remain closed.\nOnly the loftiest sages and perfected ones,\npossessing great wisdom,\nsweep away superficial splendor,\nrefine the returning elixir,\nand transcend the Three Realms—forever free from care.\nThus do true immortals urge the world:\ndo not bury yourselves in darkness.\n\nAlas!\nWithout meeting a true master,\nwho can comprehend heaven and earth’s yin and yang?\nIts meaning is profound and subtle—\nonly the divine immortals\ncan fathom the root,\nattain the principle of return,\nand what fear have they of tigers and wolves blocking the path,\nor snakes and vipers covering the ground?\nAt ease and carefree,\nthey share the lifespan of heaven.\n\nAlas!\n\nImmortals are but mortals made—\nonly mortals lack the faith.\n\nSeventh:\nBetween the prior string and the string to come,\namid waxing and waning, the qi’s fullness appears.\nSwiftly seize the tiger and dragon in battlefield strife,\nhastily refine water and fire within the crucible’s heat.\nFollow the time, and behold the Golden Buddha.\nMiss the moment, and the Jade Immortal eludes you.\nGrasp the true oral instructions of the sagely master,\nand you shall see the azure sky beneath your roof.\n\nMaster Jade Toad says:\nThose who cultivate the elixir,\nheed not whether before or after the crescent—\nonly observe the moon’s waxing and waning.\nWhen the moon waxes full, the jade pistil blooms;\nwhen the moon wanes, the golden flower sheds.\nBlooming is the time to work diligently—\nshedding renders it useless.\nThe dragon lies east, the tiger west,\nseparated by vast distance.\nScholars must seize the moment of waxing and waning,\ncapturing them to engage in battle.\nWater and fire are the primordial qi within dragon and tiger.\nGathered in the golden crucible, they must be carefully refined:\nwhen water cools, add fire;\nwhen water boils, withdraw fire.\nMastery of advance and retreat alone ensures success.\nThe immortal master repeatedly emphasizes the phrase \"follow the time,\"\nurging those who later aspire to the Dao—\nseizing the full moon’s moment is the proper time to act,\nnothing ordinary about it.\nThe Golden Buddha is the Mahāyāna’s awakened Golden Immortal,\nhis true form sixteen feet tall—\none with the great elixir’s principle.\n\nAs for the numerology of the *Zhouyi*, it holds profound subtleties. The immortal Wei Boyang, after attaining the elixir, composed the *Cantong Qi*, which has been transmitted to the world. Though its words seem to explicate the *Zhouyi*, in truth they conceal the secrets of the great elixir. Treasure lies hidden within unyielding stone—yet men’s eyes remain unseeing. If Bian He had once beheld it, how could he not have cherished it? What comes after is hard to encounter: the time of the waning moon, of what use is it? That \"heaven lies beneath the roof\" is no empty or frivolous matter—it is an analogy drawn from worldly principles. Heaven abides in heaven; how could it be concealed beneath a roof? The Dao of immortals is replete with inversions: planting lotuses in fire, seizing tigers in water, finding life in death—thus is the numinous ladder to ascension fashioned.\n\n**Eighth Stanza (three rhymes combined):**\nDevoted cultivators, be not deluded—\nhere you must early perceive the moment.\nWhen flowers bloom, pluck them with care;\nwhen the moon is full, admire it without delay.\nOnce obtained, seal your lips and refine diligently;\nonce achieved, cease work and guard in silence.\nFrom this point, cast aside all vexation—\nyou shall surely stride at ease to the Jasper Pool.\n\nThe Jade Toad says: The blooming of flowers and the brightness of the moon—this has already been revealed. The flower is not on the mountain; the moon is not in the sky. Know this in truth: it exists in every household, and every person may cultivate it. When water and fire are unaligned, the hexagrams remain \"not yet forded\"; when water and fire unite, the Dao attains \"already forded.\" Cease work and guard in silence, then refine to restore the primordial state. When the sun is full and the work complete, you shall join the host of immortals, roaming and feasting in the sacred realm of the Jasper Pool—this is no empty claim.\n\nAlas!\nAfter Dongbin obtained true lead,\nhe cast aside his gourd and shattered his zither.\nPassing this to later students, he urged them to hold fast:\nthe six roots may have ears, yet hear no sound.\n\n**Ninth Stanza:**\nTo know the great medicine’s wondrous, divine efficacy,\nknow it is not common cinnabar or mercury.\nAll medicinal substances in the world are false;\nthe fire and water men burn are not true.\nWhy refine what has form and substance?\nWhat is without image or name may be embraced.\nOnce attained, you transcend the Three Realms,\nriding phoenix and crane to pay homage at the Vermilion Court.\n\nThe Jade Toad says: The wondrous medicine of the great elixir is most numinous and divine—it is not the gold, minerals, herbs, or trees of the world, nor black lead or mercury, nor the furnace, crucible, water, or fire, all of which are visible things with form and substance. The numinous elixir is the primordial qi that generates heaven and earth, without form or shadow, difficult to grasp or perceive, concealed within the mysterious and profound *xuanpin*. Only when immortals fathom the transformations of yin and yang, revolve the Dipper and traverse the Winnowing Basket, subtly aligning with celestial measures, gathering the Five Agents and harmonizing the Four Images, with the dragon’s roar and the tiger’s howl, the movement and stillness of heaven and earth—only then do they obtain the primordial ancestral qi, which transforms into a grain of millet, descending to appear in the void. When gathered and ingested, it restores the origin and extends life, making one an eternal guest, ascending into the formless. Thus, boundless transformations arise, and one attains unfettered freedom. Later students must not heed the deceptions of false teachers, risking their very lives. They must carefully seek and discern, embracing the bright and forsaking the dark.\n\nAlas!\n\nThose lost remain lost—each must exhaustively investigate principle, like hatching a chicken from an egg.\n\n**Tenth:**\nThe celestial mechanism is not revealed, and the world scarcely knows it;\nLeaking the celestial mechanism, one writes it in verse.\nOf the same kind, forging a demon-expelling sword,\nTogether in bed, constructing a ladder to heaven—\nPeople must be delivered by people to transcend the dusty world,\nDragons must mate with dragons to emerge from the mire.\nDo not blame me for speaking the truth in full,\nOnly because I wish to deliver the deluded masses.\n\nMaster Jade Toad says: \"Of the same kind\"—heaven takes earth as its kind, the sun takes the moon as its kind, woman takes man as its kind, yang takes yin as its kind.\nAs the *Knot* says: \"The Curved Array and the Soaring Serpent.\"\nGreen Dragon and White Tiger call to each other, support each other, dance with each other;\nInverting the practice, one extracts from *Li* to replenish *Kan*.\nThis verse by Pure Yang truly leaks the celestial mechanism.\nThe Toad further explains: May the millions of later learners strive for the realm of long life;\nEach must cultivate early—do not let this life slip by.\n\n**Eleventh:**\nReturning to the origin and restoring the source, one reaches *Qian*;\nAble to ascend and descend, one becomes a flying immortal.\nThe arising of the first yang is the day to commence work;\nNine revolutions complete the year of attaining the Dao.\nIn refining the elixir, seek mercury within cinnabar;\nIn establishing the furnace, first erect heaven within earth.\nHere lies the principle of the returning elixir—\nLet it not be rashly transmitted by those who are not true adepts.\n\nMaster Jade Toad says: To return to the origin and restore the source,\nOne must have heaven and earth unite, dragon and tiger mate,\nSo that wood and fire descend, metal and water ascend.\nTo recognize the time when the first yang arises,\nEstablish the furnace and set up the tripod,\nDig earth to seek heaven,\nAnd gather the elixir to extend life.\nThose who know must not transmit it carelessly.\nIf one’s resolve in the Dao is not steadfast,\nEven amid piles of gold and jade, one regards them as floating clouds.\nEven if it be father and son, flesh and blood,\nIf the resolve in the Dao is not firm,\nDare one lightly transmit it in vain—\nHeaven will surely bring calamity,\nAnd nine generations will sink into perdition.\nThe *Scripture for Delivering Humanity* on the secret treasure of the returning elixir says:\n\"Forty thousand movements for a single transmission.\"\nThus Pure Yang issues this warning.\n\n**Twelfth:**\nHeaven generates one thing, transforming the Three Powers;\nThe intercourse of yin and yang forms the sacred embryo.\nDragon and tiger proceed in order, and the yin ghost departs;\nTortoise and serpent move in reverse, and the fire spirit arrives.\nThe infant daily consumes the marrow of the Yellow Dame;\nThe maiden of mystery often dines from the white jade cup.\nWhen merit is complete, one naturally dwells beyond things,\nWhile the cold and heat of the human world turn in their cycles.\n\nMaster Jade Toad says: \"One thing\" is true lead.\nNow, true lead arises before heaven and earth,\nCalled the primordial ancestral qi,\nAble to generate heaven, earth, and the myriad things.\nToday, seeking it in reverse,\nOne must use the intercourse of yin and yang,\nInverting the workings of creation—\nOnly then can one become an immortal or a buddha.\nThe sages of old knew that mercury’s nature loves to fly,\nAnd only when it meets lead does it congeal.\nRefining true lead to subdue true mercury,\nLike a mother taming her child,\nPrevents its escape and loss,\nThus forming the sacred embryo,\nTo become a long-lived, ageless divine immortal.\n\n**Thirteenth:**\nThe primordial qi is called Emptiness and Nothingness,\nIts circulation keeps the bones from withering.\nTo know the root of mercury, seek the stem;\nTo find the origin of lead, ask the immortal maiden.\nEveryone can drink the wine of long life,\nEach can become an undying husband.\nForm is emptiness, emptiness is form—\nBrightly, one flies across Dongting Lake.\n\nMaster Jade Toad says: The primordial qi is lead,\nFormless yet able to subdue mercury.\n*Li* is empty, *Kan* is full—\nExtract and replenish them,\nSo that the essence of mercury does not fly away,\nAnd the embryo can be spiritually transformed.\nThe wonder lies in the heart like the great void,\nForgetting both form and realm,\nForgetting even the act of forgetting—\nOnly then can one seek it.\nIf human desire overflows,\nOne will never succeed.\n\n**Fourteenth:**\nThe profound mechanism of the Great Dao is inversion upon inversion;\nOverturning the earthly prison, one must seek heaven.\nWho can see the tortoise and fly sharing a cave?\nWho dares speak of dragon and tiger dwelling in the same palace?\nIn the ninth summer, white snow grows on high mountains;\nIn the third winter, flames blaze to cultivate golden lotuses.\nI urge you, gentlemen who study the Dao,\nTo skillfully rein in the hairless fierce tiger.\n\nMaster Jade Toad says: The mechanism of inversion\nHas already been revealed in the previous verses.\nPure Yang writes this poem again,\nOnly fearing that later learners lack steadfast faith.\nTo know how to rein in the hairless fierce tiger—\nThe Dao is not far off!\n\n**Fifteenth:**\nThe numinous fungus on earth is placed in heaven;\nGathered in due season, it forms pure *Qian*.\nRootless, yet the vernal yang arrives on its own;\nWith a foundation, it often entwines with the qi channels.\nWhen the maiden of mystery plays, her spiritual power is strong;\nWhen the infant dances, his resolve in the Dao is firm.\nPity the ignorant in the world—\nI alone attain long life and live ten thousand years.\n\nMaster Jade Toad says: The flower and fruit are not in heaven and earth,\nYet they do not depart from the human body.\nInfant and maiden of mystery—without a matchmaker, they do not unite.\nIf one has the karmic affinity to awaken,\nOne can attain immortality.\nAlas!\nOnly wait for the day when the earth mother’s flower blooms—\nThat is when the Yellow River will run clear to the bottom.\n\n**Sixteenth:**\nI urge you to cherish every fraction of yin;\nAwaken to this immortal mechanism through the mind.\nIt is only the constant circulation within the human body—\nWhy laboriously search beyond things?\nHastily seek the first tidewater of the Northern Sea\nTo irrigate the roots of the old tree on Eastern Mountain.\nThis profound mechanism is heavily leaked—\nOne must play the zither only for a knowing audience.\n\nMaster Jade Toad says: The above sixteen poems\nMake up the weight of two eights and one catty.\nThe ancient immortals cherished every fraction of yin,\nYet people today, in contrast, rest and idle,\nBringing themselves to death without remorse.\nOne must cherish essence and qi,\nNot heed the deceptions of false teachers,\nFor consuming and refining herbs, minerals, and stones are all delusions,\nFar removed from the Dao.\nThere are foolish and vulgar people\nWho know nothing of the Dharma beyond the world,\nNothing of the supreme principle of the returning elixir,\nAnd idly speculate—\nClaiming that cultivating the Dao and refining the elixir\nRequires dwelling in deep mountains and remote valleys,\nNecessitates abandoning wife and children.\nSuch people are truly pitiable!\n\nMaster Jade Toad now points directly—each should diligently investigate and contemplate.\n\nWhat dwells in deep mountains—grasses, trees, birds, and beasts—are all of the wrong kind; how could they refine the returning elixir? As the *Awakening to Reality* says:\n*\"Before refining the returning elixir, do not enter the mountains—*\n*Within and without those peaks, there is no true lead.\"*\nSuch supreme treasures are found in every household,\nYet only fools fail to recognize them in full.\n\nIt further states:\n*\"Mercury is what my family originally possesses;*\n*Lead is the deathless method of another household.\"*\nIf one recklessly speculates with gold, stone, herbs, or wood,\nAll guesswork is in vain—one must inevitably enter the wheel of rebirth.\n\nNow, Pure Yang says:\n*\"The first tide of the Northern Sea*\n*Is the newly drawn sweet spring from the elixir well—*\n*Truly a rare and precious treasure.\"*\nFor the phrase *\"first tide\"* signifies the primordial qi,\nThe true qi of lead—hence it is called the supreme treasure,\nA priceless gem that serves as the mother of the great elixir.\nWhen the withered tree of the eastern mountain\nIs infused with the northern spring,\nIts branches and leaves flourish anew,\nAnd its roots stand firm forever.\n\nA song says:\n*\"The upright qi of the north becomes the river chariot;*\n*The wood-metal of the east becomes cinnabar.*\n*When the two natures are nurtured as one,*\n*The Vermilion Bird stirs and births the golden flower.\"*\n\nThe *Cantong Qi* states:\n*\"Cinnabar is the essence of wood,*\n*Only when it meets metal does it congeal.*\n*The sun’s flowing pearl ever seeks to depart—*\n*Only when it obtains the golden flower does it turn and remain.\"*\nThis is the very meaning.\n\nThough the elixir classics number ten thousand volumes,\nTheir celestial mechanisms remain unspoken—\nYet now I, Jade Toad, once more annotate them.\nThe lute’s notes beneath my fingers\nAre known to none in this world.\nWherever this book resides,\nDivine guardians shall shield it.\nThose who study immortality, if destined to encounter it,\nAnd believe, receive, and practice its teachings,\nShall swiftly ascend as celestial immortals.\n\n---\n\n**Three Radiant Pointers to the Mysterious (Lower Scroll)**\n**First (three rhymes combined):**\nThe world favors the false over the true,\nMaking the supreme scripture of long life hard to traverse.\nYet I cannot help but reveal this celestial secret anew—\nThe numinous elixir is merely qi and essence conjoined.\n\n**Harmonized Response:**\nThe perfected sage Pure Yang attained wholeness,\nCompassionately proclaiming the supreme scripture again.\nLater learners should reverently cherish and honor it—\nSimply cultivate and refine qi and essence.\n\n**Second:**\nThe Dao resides in human conduct, daily and constant;\nCultivating in reverse, it enters the mouth and perfumes the body.\nThen one must silently nurture the celestial embryo to completion,\nSteadily riding a soaring simurgh to meet the Jade Emperor.\n\n**Harmonized Response:**\nFrom nothing, something arises—uncommon indeed!\nThe gold of the Western Sea blooms with the fragrance of Lishui.\nBring it back and boil it in the crucible—\nWait until the elixir matures to pay homage to the August Void.\n\n**Third:**\nWest, north, east, and south lie in the two flanks,\nYet Master Chang’s earth-shrinking gathers them at the center.\nLater learners who favor the arts of immortality—\nUse the same cinnabar to mend the ruined stage.\n\n**Harmonized Response:**\nThe male tiger and female dragon each occupy a flank,\nDrawn together by a matchmaker to the center.\nWhen refining, do not slight the paired essences—\nIn an instant, the great Dao’s arena is complete.\n\n**Fourth (second line borrows rhyme):**\nThis method is true within the true, yet wondrously truer still;\nWithout head or tail, without form.\nIn the profound and dim, if you can perceive it,\nYou are one who transcends the mundane and leaves the world.\n\n**Harmonized Response:**\nWithin the true, no false; within the false, the true.\nInaudible in sound, invisible in form.\nIf a Dao learner knows the mechanism and applies effort,\nThey shall transform mortal bones into an immortal’s.\n\n**Fifth:**\nThe old immortal of Eastern Flower, surnamed Wood,\nSat alone in Master Chang’s chamber, yet achieved nothing.\nSuddenly he met the Golden Sage Mother of the West—\nWith a single grain of numinous elixir, he soared into the void.\n\n**Harmonized Response:**\nEvery household has its master,\nYet for greed and delusion, they neglect the sage’s work.\nIf one understands how to reverse and invert the process,\nGuarding the true intent, all returns to emptiness.\n\n**Sixth:**\nWhen one method is mastered, all methods are mastered;\nNo need to divide north, south, east, or west.\nDay after day, it lies within your own dwelling—\nTo see it, you must know to dig within the earth.\n\n**Harmonized Response:**\nIf you comprehend the Gate of the Mysterious Female,\nAll rivers and myriad streams return to the east.\nIf people today grasp the true message,\nAt midnight the yang arises, at mid-month the moon is full.\n\n**Seventh:**\nWhen the flute played in Yellow Crane Tower,\nWhite duckweed and red smartweed filled the river’s edge.\nThe heart’s feelings longed to be told, yet none understood—\nOnly the clear wind and bright moon knew.\n\n**Harmonized Response:**\nThe iron flute plays at the stroke of midnight,\nA bright moon wheel appears above the river’s edge.\nHere lies the true and certain truth—\nI ask you, gentlemen, do you know it or not?\n\n**Eighth (two rhymes combined):**\nThe method is the primordial point of qi;\nRefine it to become the original spirit.\nThe ritual master visualizes and commands the thunder spirits—\nOnly by refining this can one ascend to the Jade Capital.\n\n**Harmonized Response:**\nThe Great Monad contains the primordial qi,\nThe numinous yang is securely stored to nurture the spirit.\nIf the two can harmonize and unite,\nOne shall ascend to the Jade Capital in days.\n\n**Ninth:**\nThe beauty of sixteen, her body like softened lard,\nWields a sword at her waist to slay foolish men.\nThough no severed heads are seen,\nIn secret, she drains their marrow and bones.\n\n**Harmonized Response:**\nThe passionless fear not a body like lard;\nTo forget both form and emptiness is the true man.\nIf you recognize the method of balancing hardness and softness,\nThe spring qi of yang will not wither in vain.\n\n**Tenth:**\nI have read ten thousand scrolls of immortal scriptures,\nEach teaching only how to move the Yellow River.\nWithin this lies a cup of wine for long life—\nI ask those of this world: can you drink it?\n\n**Harmonized Response:**\nA single phrase penetrates the mysterious—no need for many.\nAll must strive together to pull the Silver River.\nWhen the Three Flowers irrigate Kunlun’s peak,\nWhat else could you be if not an immortal?\n\n**Eleventh:**\nAt dawn I roam the Northern Sea (or Northern Yue, or Hundred Yue, or Yue’e),\nAt dusk I reach Cangwu,\nA green snake in my sleeve, my gall bold.\nThrice drunk at Yueyang, none recognize me—\nBrightly I fly across Dongting Lake.\n\n**Harmonized Response:**\nA pair of simurghs play by the verdant parasol tree,\nTheir natures in harmony, refined and coarse alike.\nIf one grasps the principle within the mysterious,\nWhy climb mountains or sail lakes?\n\n**Twelfth:**\nMy fate has always been natural,\nTruly dependent on me, not on heaven.\nWith a single dose of golden elixir, the body becomes sacred—\nI may become an immortal of Penglai or the Jasper Pool.\n\n**Harmonized Response:**\nThe Dao is originally wordless, only natural.\nThe true lead must be recognized as heaven within earth.\n\n**Thirteenth:**\nCultivating immortality asks not of man or woman,\nRefining the elixir knows no bounds of wealth or poverty.\nA single thought without error—all may achieve it,\nI know I am no longer a mortal of this world.\n\n**Harmonized Response:**\nThe Queen Mother was once a mortal woman,\nGe Hong’s family was utterly impoverished.\nBoth immortals set examples to follow—\nBitter words of truth need not fear reproach.\n\n**Fourteenth:**\nThe immortal’s song and verse reveal heaven’s mechanism,\nWith compassion and expedience, they guide the lost.\nLet none who see them fall into delusion—\nAll should feign foolishness and learn.\n\n**Harmonized Response:**\nEvery line and character holds true mechanism,\nThose who awaken must turn back and not cling to delusion.\nThe great elixir’s formula is rarely encountered—\nTo meet it and not refine it is sheer folly.\n\n**Fifteenth:**\nThe deathless golden elixir is sown in earth and sand,\nThose who grasp it should leave home early.\nWith a heart set only on the path of longevity,\nNever cling like bees to flowers in vain.\n\n**Harmonized Response:**\nIt is neither metal nor wood nor sand,\nFor this originally dwells within the home.\nWhen Śākyamuni first emerged, the secret was fully revealed—\nWhy then, at the end, did he hold up a flower?\n\n**Sixteenth:**\nTrue lead and the great elixir are formless,\nExisting only in the mind’s darkness or clarity.\nLaozi gestated for ten months,\nWhen merit and practice were complete, he attained spiritual communion.\n\n**Harmonized Response:**\nA mute dreams of forms upon waking,\nThough speechless, the truth is self-evident.\nPrecious treasure lies wrapped in thick blood and skin—\nIf one grasps it, spiritual communion is achieved.\n\n**Seventeenth:**\nThe crucible and furnace are established to guard the heart,\nEight ounces of cinnabar, eight ounces of gold.\nOnce the celestial balance is harmonized and measured,\nCarefully discern what floats and what sinks.\n\n**Harmonized Response:**\nLast night, the heart was urged to steadfastness,\nTempering stubborn copper into crimson gold.\nResplendent radiance pierces the azure peaks—\nWhen the elixir is complete, the secret determines floating and sinking.\n\n**Eighteenth:**\nDevoted to truth, cultivating the Dao, uphold harmony,\nLike iron pestles forged into needles, refine ceaselessly.\nThis matter is inherently without great artifice—\nOnly the daily accumulation of effort makes the difference.\n\n**Harmonized Response:**\nEach person is endowed with this primordial harmony,\nTake the eternal and polish it diligently.\nImmortals of past and present who attained the Dao\nAll delved deep to gather lead in abundance.\n\n**Nineteenth:**\nWhen the first yang qi arises, apply effort,\nThe essence of sun and moon illuminates the jade crucible.\nAt this critical juncture, do not act recklessly,\nLest you fall into Dongting Lake.\n\n**Harmonized Response:**\nBodhidharma once applied effort,\nSitting alone on a long reed, holding a wine flask.\nHaving received a cup, he poured it over his crown—\nPlucking the reed, he stepped across the eastern lake.\n\n**Twentieth:**\nThe moon over Qujiang appears as the waters grow clear,\nBathing requires discerning host and guest.\nWhen the water warms and the body grows warm,\nSecure your path forward with resolve.\n\n**Harmonized Response:**\nGathering the elixir requires knowing turbidity and clarity,\nThough others speak, I remain the guest.\nWithout the fierce fire and boiling cauldron,\nSit firmly and advance no further.\n\n**Twenty-First:**\nDragon and tiger meet upon the battlefield,\nIn an instant, victory or defeat is decided.\nWhen you encounter evil, practice goodness—\nContention will only bring harm.\n\n**Harmonized Response:**\nThe five qi converge at the origin to form the Dao’s field,\nThe three flowers gather at the crown, banishing all evil.\nWhen indulging in beauty, be cautious—\nBeware of danger and avoid injury.\n\n**Twenty-Second:**\nThe Dao is originally wordless, the Dharma inherently empty,\nForcibly named as tiger and dragon.\nThe one true primordial essence\nHides among beings of the same kind in Jambudvīpa.\n\n**Harmonized Response:**\nTrust that the golden elixir is not empty,\nIts success requires tiger and dragon.\nAt the hour of *zi*, it ascends Kunlun’s peak,\nAt *wu*, it circulates within the vast sea.\n\n**Twenty-Third:**\nPeople say my Dao is hollow and fleeting,\nI laugh at the world’s lack of foresight.\nA single grain of golden elixir, the medicine of longevity—\nLost in darkness, they know not their sorrow.\n\n**Harmonized Response:**\nRefining the elixir requires discerning floating and sinking,\nBefore returning the elixir, apply careful intent.\nGuide later generations to mastery—\nNo need for ceaseless, anxious toil.\n\n**Twenty-Fourth:**\nThe dragon-tiger golden elixir wondrously aligns with heaven,\nWind and clouds converge, revealing sweet springs.\nIf the white-haired elder grasps this,\nHe will reverse aging and live ten thousand years.\n\n**Harmonized Response:**\nThe wondrous Dao of the golden elixir is of primordial heaven,\nHidden in the southwest, transforming into jade springs.\nPines and cypresses thrive by its nourishment,\nEnduring frost, they last without end.\n\n**Twenty-Fifth:**\nWhen two mouths meet, it is Lü Yan,\nThose who recognize this must not speak recklessly.\nThe power within *li* is unmatched,\nCapable of shouldering heaven and earth.\n\n**Harmonized Response:**\nTo subdue the tiger, enter its den,\nSwallowing pride, restraining speech.\nOnce the tiger’s cub is firmly seized,\nPair it with a dragon to bear the burden.\n\n**Twenty-Sixth:**\nTo subdue the dragon, one’s will must be as vast as heaven,\nTo tame the tiger, the heart must be fierce, the qi like smoke.\nIf even the foolish and dull can grasp this,\nThey will instantly become immortals.\n\n**Harmonized Response:**\nTo act against conscience and reason is to deceive heaven,\nFour things obscure it, dark as smoke.\nSuch people are no better than beasts—\nHow could they ever meet the Jade Celestial?\n\n**Twenty-Seventh:**\nA single plum blossom blooms in the tenth month,\nAnticipating the early arrival of spring.\nEven the frailest wood knows the seasons—\nThose who do not turn back remain fools.\n\n**Harmonized Response:**\nWithered wood blooms again in spring,\nAll because heaven and earth’s first yang arrives.\nThough people age, they cannot regain youth—\nAll for clinging to greed and folly, growing ever more foolish.\n\n**Twenty-Eighth:**\nTraveling everywhere, I sing immortal songs,\nYet the people of this age mock me as a demon.\nThey mistake true gold for dung,\nOld dragons take it for venomous snakes.\n\n**Harmonized Response:**\nInverting cultivation, I sing the Dao’s songs,\nEach verse cuts through demons and exorcises evil.\nAll wish to ascend Penglai’s path—\nApply effort, and let not the heart falter.\n\n**Twenty-Ninth:**\nLong ago, I wandered at Yueyang Tower,\nA fine place—Oriole Flower and Parrot Isle.\nToday, I return to buy fine wine,\nYet most of my old friends lie in barren mounds.\n\n**Harmonized Response:**\nA thatched hut, quiet sitting—better than lofty towers,\nWith patience and completed merit, ascend the ten isles.\nHow lamentable the scholars of the jade halls—\nTheir embroidered words now buried in desolate graves.\n\n**Thirtieth:**\nFor over a decade, I roamed the vast earth,\nExhorting the people of this age—none would cultivate.\nI leave this one true, wondrous scripture,\nAnd ascend lightly to Phoenix-Unicorn Isle.\n\n**Harmonized Response:**\nHeat departs, cold arrives, spring returns in autumn’s wake,\nLife is but a dream—best to cultivate early.\nThe immortals speak no empty words—\nPenetrate the mystic wind and ascend the ten isles.\n\n**Thirty-First:**\nI urged them bitterly to cultivate, yet they refused,\nTurning kindness into enmity instead.\nNow I turn my gaze toward heaven and depart,\nLeaving the mortal realm to its own freedom.\n\n**Harmonized Response:**\nThe world should awaken early to cultivation,\nFor even the deepest bonds of husband and wife are but enmity.\nIf you doubt my words, reflect upon yourself—\nWhy do eyes grow dim and backs bend with age?\n\n**Thirty-Second:**\nFleeting fame, fleeting profit—like the wind,\nDrifting here and there, what merit is gained?\nLet each of you examine yourselves thrice,\nAnd not dismiss the immortal’s path as mere illusion.\n\n**Harmonized Response:**\nPurity Yang’s sleeves stir the spring breeze,\nReturning home—what great merit lies therein!\nHe left behind priceless mystic treasures,\nYet the Jade Toad still debates emptiness.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "吕祖指玄篇诗注 白玉蟾注 吕祖自序 余精儒业，应试，路逢正阳仙翁，悯岩，指修大道，遂弃功名。 始生疑惑，后蒙指出，余方省悟。 再访圣师，登山涉水，游至终南，稽首讯问根由。 不责前愆，授余《太上无量度人妙经》，及《丹房秘诀》，反复丁宁告诫，命余珍藏，密修大道，采炼还丹，以逃生死，入希夷门，游长生境。 余既得闻，喜而敬之，叩头谢恩，别圣师，云游尘境，誓度百人成道，皈奉真风。 不料世之迷徒，只知恶死，不肯求生； 不悟玄机，殊昧妙理，反生谤毁。 或有执着而怀邪妄者，或服金石草者，种种痴愚，入于迷境，及至老死，犹不知悔，深可惜也。 吾固怜之，无能拔济，特作《指玄篇》一册，留于青城石室之中，稽首告天，拂袖而去。 倘后之君子，得遇此书，乃三生有缘。 收吾秘诀，务必严整衣冠，具香火灯水，于静夜面朝北斗，致谢高真； 日逐虔诚，感格仙圣。 自有明师剖决简奥细微、水火进退、药物斤两，明后，下手隐身、锻炼龙虎大丹，脱胎入口，接命延年。 驱魔剪怪，修得三千行满，倏诏飞升，逍遥物外，与天齐年，与吾无异也。 是为序。 指玄三灿上篇 其一：叹世凡夫不悟空，迷花恋酒送英雄。 春宵漏永欢娱促，岁月长时死限攻。 弄巧常如猫捕鼠，光阴犹似箭离弓。 不知使得精神尽，愿把身尸葬土中。 玉蟾曰：纯阳仙师慈悲，大开接引。 故叹世人险曲迷昧，自丧其身。 后览书者，当见仙翁之言，的无虚也。 正好回头悟道，切莫错过光阴。 非大慈悲，谁肯苦口劝人？ 其二：昔年我亦赴科场，偶遇仙师古道旁。 一阵香风飘羽袖，千条云带绕霓裳。 开言句句谈玄理，劝世声声唱洞章。 我贵我荣都不羡，重重再教炼黄房。 玉蟾曰：此诗自叹遇钟离老祖，讲道劝化之意也。 羽袖云裳，乃仙家所穿之服； 玄理洞章，乃仙家所修之业。 黄房者，非世之黄房，乃中央属土，黄帝所居之位也。 其三：玄篇种种说阴阳，二字名为万法王。 一粒粟中藏世界，半升铛里煮山江。 青龙驾火游莲室，白虎兴波出洞房。 此个功夫真是巧，得来平步上天堂。 玉蟾曰：阴阳二字，极有妙理。 若欲见形，龙虎是也。 一粒者，乃混沌之初，先天之气。 故能包罗天地，养育群生。 半升铛者，乃是炼药鼎器，非铁鼎之铛也。 青龙在东，东方属木，木能生火，故谓之驾火。 非凡之水火也。 若求大药，有足能行，是个活物。",
      "translated_text": "**Preface by Patriarch Lü Himself**\n\nI once devoted myself to Confucian scholarship and sat for examinations, but on the road I encountered the Immortal Elder of True Yang, who took pity on my ignorance and pointed me toward the Great Dao. Thereupon, I abandoned worldly rank and fame. At first, I harbored doubts, but later, through his guidance, I came to awakening. I sought the sagely master again, traversing mountains and rivers until I reached Zhongnan, where I bowed my head and inquired into the root of things. Without reproaching my past transgressions, he bestowed upon me the *Supreme Most Wondrous Scripture of Limitless Salvation* and the *Secret Formulas of the Alchemical Chamber*, repeatedly exhorting me with earnest warnings. He commanded me to treasure them, cultivate the Great Dao in secret, gather and refine the Reverted Elixir, escape birth and death, enter the Gate of the Inaudible and Invisible, and wander in the realm of longevity.\n\nHaving received these teachings, I rejoiced and revered them, kowtowing in gratitude. I took leave of the sagely master and wandered the dusty world, vowing to guide a hundred souls to Daoist attainment and uphold the true wind. Yet to my dismay, the deluded of this world know only to fear death but not to seek life; they fail to awaken to the mysterious mechanism, remain blind to the wondrous principle, and instead slander and defame. Some cling stubbornly to perverse delusions, while others consume minerals and herbs—all manner of foolishness leading them into deeper confusion. Even unto old age and death, they remain unrepentant. How deeply lamentable!\n\nThough I pity them, I am powerless to save them. Thus, I composed this *Pointers to the Mysterious* and left it in a stone chamber on Mount Qingcheng. I bowed to heaven, brushed my sleeves, and departed. Should a noble person of later times encounter this book, it shall be by karmic affinity of three lifetimes. Receive my secret formulas, but first ensure your robes and cap are properly arranged, prepare incense, fire, lamps, and water, and on a quiet night face the Northern Dipper to offer thanks to the lofty immortals. Day by day, cultivate sincerity, and the immortals and sages will be moved to respond. A luminous master will then reveal the subtlest intricacies—the advance and retreat of water and fire, the weights and measures of medicinal substances. Once enlightened, you may begin the concealed practice, forging the Great Elixir of Dragon and Tiger, refining the embryo to transcend the mortal form, extending life and prolonging years. Dispel demons and sever monstrosities, fulfill the three thousand meritorious deeds, and in an instant receive the celestial summons to ascend, roaming carefree beyond the mundane, your years equal to heaven’s, no different from mine.\n\nThis is my preface.\n\n---\n\n**Pointers to the Mysterious: Three Brilliances, First Section**\n\n**1.**\nThe worldly, lost in emptiness, do not awaken;\nEnsnared by flowers and wine, heroes fade away.\nSpring nights stretch long, yet joy is fleeting;\nTime presses on, death’s limit ever near.\nCrafty as a cat stalking a mouse,\nSwift as an arrow loosed from the bow.\nUnknowing, they exhaust their spirit,\nWishing only to bury their corpse in the earth.\n\n**Bai Yuchan’s Commentary:**\nThe merciful Patriarch Pure Yang opened wide the path of deliverance. Thus, he laments the perilous crookedness and delusion of worldly folk, who bring ruin upon themselves. Those who read this later should recognize the truth in the immortal elder’s words—now is the time to turn back and awaken to the Dao. Do not squander this fleeting time. Were it not for boundless compassion, who would trouble themselves to admonish others so earnestly?\n\n**2.**\nIn years past, I too entered the examination hall,\nWhen by chance I met an immortal elder by the ancient road.\nA gust of fragrant wind stirred his feathered sleeves,\nA thousand ribbons of cloud swirled around his rainbow robes.\nHis words, each one, expounded the mysterious principle;\nHis voice, each note, chanted the cavern’s hymns.\nI coveted neither rank nor glory,\nBut was taught again and again to refine the Yellow Chamber.\n\n**Bai Yuchan’s Commentary:**\nThis poem laments the author’s encounter with the Ancestral Master Zhongli, who expounded the Dao and exhorted him to transform. Feathered sleeves and cloud-woven robes are the attire of immortals; the mysterious principle and cavern hymns are their practice. The *Yellow Chamber* is not the worldly Yellow Chamber, but the central position of Earth, the abode of the Yellow Emperor.\n\n**3.**\nThe mysterious verses speak endlessly of yin and yang,\nTwo words that reign as kings of all methods.\nA single grain of millet holds a world within;\nHalf a pint’s cauldron boils mountains and rivers.\nThe Azure Dragon drives fire through the lotus chamber;\nThe White Tiger stirs waves from the cavern’s depths.\nThis art is truly wondrous—\nMaster it, and you shall ascend to heaven in a single step.\n\n**Bai Yuchan’s Commentary:**\nThe two words *yin* and *yang* contain the most wondrous principle. If you wish to perceive their form, look to the Dragon and Tiger. The *single grain* is the primordial qi of the undifferentiated beginning, which encompasses heaven and earth and nurtures all living things. The *half-pint cauldron* is the vessel for refining the medicine—not an iron cauldron. The Azure Dragon resides in the East, where Wood generates Fire, hence it is said to *drive fire*. This is no ordinary fire or water. If you seek the Great Medicine, you will find it is a living thing, capable of movement.",
      "overlap_context": "",
      "start_char": 1,
      "end_char": 938,
      "start_sentence": 0,
      "end_sentence": 47,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.37023401260376,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖指玄篇诗注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "莲室乃丹房之所。 白虎在西，西方属金，金能生水，故曰兴波。 波非海水，金非凡金，若求金水，有手能拈，亦是活物。 近世多执凡水火，锻炼金石草木，以修诸身者，深可惜也。 洞房者，乃出丹之所。 噫！ 观此书者，当知神仙称赞大丹。 若能得之，升天入地，不可测也。 其四：寻天撅地见天光，种得金花果是强。 那怕世间诸饿鬼，何愁地下老阎王。 正心收住黄龙髓，张口擒吞白虎浆。 不是圣师当日诀，谁人做得者文章。 玉蟾曰：老子云：先天地生。 若欲见之，必寻天掘地。 寻之得手，何畏鬼神？",
      "translated_text": "The lotus chamber is the place of the cinnabar chamber.\nThe White Tiger resides in the West, where Metal generates Water, hence it is said to *stir waves*.\nThese waves are not ocean waves, nor is this Metal ordinary metal. If you seek Metal and Water, they have hands that can grasp—also living things.\nIn recent times, many cling to mundane fire and water, forging metals, minerals, herbs, and trees to cultivate the body—how deeply lamentable.\nThe cavern chamber is where the elixir emerges.\n\nAlas!\nThose who study this text should know why immortals praise the Great Elixir.\nIf you attain it, ascending to heaven or descending to earth becomes unfathomable.\n\n**Fourth Stanza:**\nSeek heaven and dig earth to behold the celestial light;\nPlant the golden flower—truly mighty is its fruit.\nFear not the hungry ghosts of this world,\nNor dread the underworld’s King Yama.\nWith upright heart, gather the Yellow Dragon’s marrow;\nOpen your mouth to seize and swallow the White Tiger’s nectar.\nWere it not for the sacred master’s teachings of that day,\nWho could compose such verses?\n\n**Bai Yuchan’s Commentary:**\nLaozi said: *\"It is born before heaven and earth.\"*\nIf you wish to perceive it, you must seek heaven and dig earth.\nOnce found and grasped, what fear remains of ghosts and spirits?",
      "overlap_context": "rceive their form, look to the Dragon and Tiger. The *single grain* is the primordial qi of the undifferentiated beginning, which encompasses heaven and earth and nurtures all living things. The *half-pint cauldron* is the vessel for refining the medicine—not an iron cauldron. The Azure Dragon resides in the East, where Wood generates Fire, hence it is said to *drive fire*. This is no ordinary fire or water. If you seek the Great Medicine, you will find it is a living thing, capable of movement.",
      "start_char": 938,
      "end_char": 1167,
      "start_sentence": 48,
      "end_sentence": 62,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.04345965385437,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖指玄篇诗注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "龙髓虎浆，乃是药名。 纯阳得钟离之传，能知玄妙，方作大丹诗歌，以留于世。 读者参究，信受玄言。 其五：一三五数总皆春，后地先天见老君。 花发西川铺锦绣，月明北海庆风云。 好抛生计于斯觅，莫逞浮华向外营。 念念不忘尘境灭，静中更有别乾坤。 玉蟾曰：一三五，乃阳数； 二四八，乃阴数。 修仙之士，能知一生二，二生三，三生万物，便有还丹至宝，不可错过。 后地先天者，得地中一阳之气，上升于天； 天有一阴之气，下降于地； 二气相交，发生万物，则为泰卦； 二气不交，则为否卦。 真阴真阳，隐于天地之中无影无形，视之不见，听之不闻； 若能擒得，便是花发月明，总一意也。 花发于春，月明十五，修丹炼药，要识其时。 不遇真师，纸上难得。 若得师指，将家业抛去，趁其时而急修，不可迟延。 苟或迟延，药物过矣，即无用也。 炼药之时，念念不忘，道心如铁，莫被尘境所牵、色欲所蔽，动中得静，便是幽微。 所谓有动工，有静工。 噫！",
      "translated_text": "The Yellow Dragon’s marrow and White Tiger’s nectar are but names for the medicine.\nPure Yang received the transmission from Zhongli, mastered the mysteries, and composed these verses on the Great Elixir to leave for the world.\nLet readers ponder and embrace these profound words.\n\n**Fifth Stanza:**\nOne, three, five—all numbers are spring;\nAfter earth, before heaven, the Old Lord appears.\nFlowers bloom in the western river, brocade unfurled;\nThe moon shines bright o’er the northern sea, winds and clouds rejoice.\nCast aside worldly pursuits to seek it here,\nAnd cease chasing vain splendor in external things.\nWith every thought, forget the dust-bound realm—\nIn stillness, another heaven and earth arise.\n\nBai Yuchan’s Commentary:\nOne, three, five are yang numbers;\nTwo, four, eight are yin numbers.\nThose who cultivate immortality must understand that one generates two, two generates three, and three generates the myriad things—then they may obtain the supreme treasure of the Returned Elixir, and must not let it slip away.\n\"After earth, before heaven\" means receiving the earth’s solitary yang qi, which ascends to heaven; heaven’s solitary yin qi descends to earth. When the two qi intersect, the myriad things arise—this is the *Tai* hexagram. When they do not intersect, it is the *Pi* hexagram.\nTrue yin and true yang lie hidden within heaven and earth, formless and traceless, invisible and inaudible. If one can seize them, it is like flowers blooming and the moon shining bright—all is one intent.\nFlowers bloom in spring; the moon is full on the fifteenth. In refining the elixir, one must recognize the proper time.\nWithout a true master, even written words are hard to grasp.\nIf one receives the master’s guidance, cast aside worldly affairs, seize the moment, and cultivate urgently—delay not.\nFor if you delay, the medicine will pass, and all will be in vain.\nWhen refining the medicine, let every thought be unwavering, the Dao-heart firm as iron. Do not be led astray by the dust-bound realm, nor blinded by sensual desires. In movement, attain stillness—this is the subtle mystery.\nThere is work in movement, and work in stillness.\nAlas!",
      "overlap_context": ".\nFear not the hungry ghosts of this world,\nNor dread the underworld’s King Yama.\nWith upright heart, gather the Yellow Dragon’s marrow;\nOpen your mouth to seize and swallow the White Tiger’s nectar.\nWere it not for the sacred master’s teachings of that day,\nWho could compose such verses?\n\n**Bai Yuchan’s Commentary:**\nLaozi said: *\"It is born before heaven and earth.\"*\nIf you wish to perceive it, you must seek heaven and dig earth.\nOnce found and grasped, what fear remains of ghosts and spirits?",
      "start_char": 1167,
      "end_char": 1555,
      "start_sentence": 63,
      "end_sentence": 85,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.30697512626648,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖指玄篇诗注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "妙哉，意也！ 学道本无先与后，新笋生同旧竹高。 其六：世间无物可开怀，奉劝世人莫自埋，好趁风云真际会，须求鸾凤暗和谐。 两重天地谁能配，四个阴阳我会排。 会得此玄玄内事，不愁当道有狼豺。 玉蟾曰：世间荣华富贵，都是漫天之网。 众生被他罩住，故不开怀。 只有上圣高真，有大智慧，将浮华扫退，炼就还丹，以超三界永无忧矣。 故真仙劝世，莫自沉埋。 噫！ 未遇真师。 何人识得天地阴阳？ 其意玄微，惟有神仙，能穷本，得返还之理，何愁虎狼当道。 蛇虫遍地？ 自在逍遥，与天间寿。 噫！",
      "translated_text": "Wonderful, this intent!\nThe study of the Dao has no before or after—\nnew shoots grow as tall as old bamboo.\n\nSixth:\nNothing in the world can open the heart;\nI urge all people: do not bury yourselves.\nSeize the true meeting of wind and cloud,\nand seek the hidden harmony of phoenix and simurgh.\n\nWho can match the twofold heaven and earth?\nI alone arrange the fourfold yin and yang.\nIf you grasp this most subtle inner matter,\nyou need not fear wolves and jackals blocking the way.\n\nMaster Jade Toad says:\nWorldly glory, wealth, and honor\nare but nets cast across the sky.\nAll beings are ensnared by them,\nand thus their hearts remain closed.\nOnly the loftiest sages and perfected ones,\npossessing great wisdom,\nsweep away superficial splendor,\nrefine the returning elixir,\nand transcend the Three Realms—forever free from care.\nThus do true immortals urge the world:\ndo not bury yourselves in darkness.\n\nAlas!\nWithout meeting a true master,\nwho can comprehend heaven and earth’s yin and yang?\nIts meaning is profound and subtle—\nonly the divine immortals\ncan fathom the root,\nattain the principle of return,\nand what fear have they of tigers and wolves blocking the path,\nor snakes and vipers covering the ground?\nAt ease and carefree,\nthey share the lifespan of heaven.\n\nAlas!",
      "overlap_context": " written words are hard to grasp.\nIf one receives the master’s guidance, cast aside worldly affairs, seize the moment, and cultivate urgently—delay not.\nFor if you delay, the medicine will pass, and all will be in vain.\nWhen refining the medicine, let every thought be unwavering, the Dao-heart firm as iron. Do not be led astray by the dust-bound realm, nor blinded by sensual desires. In movement, attain stillness—this is the subtle mystery.\nThere is work in movement, and work in stillness.\nAlas!",
      "start_char": 1555,
      "end_char": 1785,
      "start_sentence": 86,
      "end_sentence": 101,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.547143936157227,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖指玄篇诗注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "神仙都是凡夫做，只是凡夫不信心。 其七：前弦之后后弦前，圆缺中间气象全。 急捉虎龙场上战，忙将水火鼎中煎。 依时便见黄金佛。 过后难逢碧玉仙。 悟得圣师真口诀，解教屋下有青天。 玉蟾曰：修丹之士，莫问弦前弦后，止看月缺月圆。 月圆玉蕊生，月缺金花卸。 生时好用工。 卸即无用也。 龙东虎西，间隔甚远。 学者趁圆缺之时，捉之相战。 水火，盖龙虎中之元气。 取于金鼎，仔细烹煎。 水冷须进火，水滚须抽火。 进退之理，方保成也。 仙师再说依时二字，反复丁宁，指示后来慕道贤士，能趁月圆之时，正好行工，非寻常也。 黄金佛者，乃释氏之大觉金仙。 真身丈六。 同大丹理。",
      "translated_text": "Immortals are but mortals made—\nonly mortals lack the faith.\n\nSeventh:\nBetween the prior string and the string to come,\namid waxing and waning, the qi’s fullness appears.\nSwiftly seize the tiger and dragon in battlefield strife,\nhastily refine water and fire within the crucible’s heat.\nFollow the time, and behold the Golden Buddha.\nMiss the moment, and the Jade Immortal eludes you.\nGrasp the true oral instructions of the sagely master,\nand you shall see the azure sky beneath your roof.\n\nMaster Jade Toad says:\nThose who cultivate the elixir,\nheed not whether before or after the crescent—\nonly observe the moon’s waxing and waning.\nWhen the moon waxes full, the jade pistil blooms;\nwhen the moon wanes, the golden flower sheds.\nBlooming is the time to work diligently—\nshedding renders it useless.\nThe dragon lies east, the tiger west,\nseparated by vast distance.\nScholars must seize the moment of waxing and waning,\ncapturing them to engage in battle.\nWater and fire are the primordial qi within dragon and tiger.\nGathered in the golden crucible, they must be carefully refined:\nwhen water cools, add fire;\nwhen water boils, withdraw fire.\nMastery of advance and retreat alone ensures success.\nThe immortal master repeatedly emphasizes the phrase \"follow the time,\"\nurging those who later aspire to the Dao—\nseizing the full moon’s moment is the proper time to act,\nnothing ordinary about it.\nThe Golden Buddha is the Mahāyāna’s awakened Golden Immortal,\nhis true form sixteen feet tall—\none with the great elixir’s principle.",
      "overlap_context": "transcend the Three Realms—forever free from care.\nThus do true immortals urge the world:\ndo not bury yourselves in darkness.\n\nAlas!\nWithout meeting a true master,\nwho can comprehend heaven and earth’s yin and yang?\nIts meaning is profound and subtle—\nonly the divine immortals\ncan fathom the root,\nattain the principle of return,\nand what fear have they of tigers and wolves blocking the path,\nor snakes and vipers covering the ground?\nAt ease and carefree,\nthey share the lifespan of heaven.\n\nAlas!",
      "start_char": 1785,
      "end_char": 2053,
      "start_sentence": 102,
      "end_sentence": 121,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.59268069267273,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖指玄篇诗注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "至于《周易》数，深有幽微。 魏伯阳老仙，得丹之后作《参同契》，流传于世。 其言似解《周易》，其实大丹之诀。 顽石中藏宝，时人眼未明。 卞和若一见，怎肯不相亲。 过后难逢者，乃月缺之时，有何用也。 屋下有天者，非虚浮之事，以世理譬喻。 天之在天，屋下岂能藏之？ 神仙之道，多般颠倒。 火里栽莲，水中捉虎，死处逢生，故有登天之灵梯。 其八：（三韵并用）修仙善士莫痴迷，于此宜当早见机。 花发拈花须仔细，月圆赏月莫延迟。 得来合口勤烹炼，既济休工默守持。 从此不须心懊恼，管教平步宴瑶池。 玉蟾曰：花发月明，前已漏泄。 花不在山，月不在天。 要知着（音着）实，家家有之，人人可修。 水火不合，卦爻未济； 水火一合，道得既济。 休工默守，然后修炼，以复其初也。 日满工完，皆同众仙，游宴瑶池圣境，其实不虚也。 噫！ 洞宾一得真铅后，弃却瓢囊碎却琴； 传与后学牢把念，六根有耳不闻音。 其九：要知大药妙通神，不是凡砂及水银。 世间药材俱是假，人烧水火总非真。 有形有质何须炼？ 无象无名自可亲。 一得便超三界外，乘鸾跨鹤谒枫宸。 玉蟾曰：大丹妙药，至灵至神，非世间金石草木，黑铅水银，亦非炉釜水火，俱是有形有质可见之物。 盖灵丹妙药，乃是生天生地之祖炁，无形无影，难执难见，隐于空洞玄牝之中。 唯有神仙参透阴阳造化，旋斗历箕，暗合天度，攒簇五行，和合四象，龙吟虎啸，天地动静，方得元始祖炁，化为黍米，降见浮空，采而服之，还元接命，以作长生之客，升入无形，故有无穷变化，自在逍遥。 后之学者，切莫听信邪师惑误性命，必仔细参求，投明弃暗。 噫！",
      "translated_text": "As for the numerology of the *Zhouyi*, it holds profound subtleties. The immortal Wei Boyang, after attaining the elixir, composed the *Cantong Qi*, which has been transmitted to the world. Though its words seem to explicate the *Zhouyi*, in truth they conceal the secrets of the great elixir. Treasure lies hidden within unyielding stone—yet men’s eyes remain unseeing. If Bian He had once beheld it, how could he not have cherished it? What comes after is hard to encounter: the time of the waning moon, of what use is it? That \"heaven lies beneath the roof\" is no empty or frivolous matter—it is an analogy drawn from worldly principles. Heaven abides in heaven; how could it be concealed beneath a roof? The Dao of immortals is replete with inversions: planting lotuses in fire, seizing tigers in water, finding life in death—thus is the numinous ladder to ascension fashioned.\n\n**Eighth Stanza (three rhymes combined):**\nDevoted cultivators, be not deluded—\nhere you must early perceive the moment.\nWhen flowers bloom, pluck them with care;\nwhen the moon is full, admire it without delay.\nOnce obtained, seal your lips and refine diligently;\nonce achieved, cease work and guard in silence.\nFrom this point, cast aside all vexation—\nyou shall surely stride at ease to the Jasper Pool.\n\nThe Jade Toad says: The blooming of flowers and the brightness of the moon—this has already been revealed. The flower is not on the mountain; the moon is not in the sky. Know this in truth: it exists in every household, and every person may cultivate it. When water and fire are unaligned, the hexagrams remain \"not yet forded\"; when water and fire unite, the Dao attains \"already forded.\" Cease work and guard in silence, then refine to restore the primordial state. When the sun is full and the work complete, you shall join the host of immortals, roaming and feasting in the sacred realm of the Jasper Pool—this is no empty claim.\n\nAlas!\nAfter Dongbin obtained true lead,\nhe cast aside his gourd and shattered his zither.\nPassing this to later students, he urged them to hold fast:\nthe six roots may have ears, yet hear no sound.\n\n**Ninth Stanza:**\nTo know the great medicine’s wondrous, divine efficacy,\nknow it is not common cinnabar or mercury.\nAll medicinal substances in the world are false;\nthe fire and water men burn are not true.\nWhy refine what has form and substance?\nWhat is without image or name may be embraced.\nOnce attained, you transcend the Three Realms,\nriding phoenix and crane to pay homage at the Vermilion Court.\n\nThe Jade Toad says: The wondrous medicine of the great elixir is most numinous and divine—it is not the gold, minerals, herbs, or trees of the world, nor black lead or mercury, nor the furnace, crucible, water, or fire, all of which are visible things with form and substance. The numinous elixir is the primordial qi that generates heaven and earth, without form or shadow, difficult to grasp or perceive, concealed within the mysterious and profound *xuanpin*. Only when immortals fathom the transformations of yin and yang, revolve the Dipper and traverse the Winnowing Basket, subtly aligning with celestial measures, gathering the Five Agents and harmonizing the Four Images, with the dragon’s roar and the tiger’s howl, the movement and stillness of heaven and earth—only then do they obtain the primordial ancestral qi, which transforms into a grain of millet, descending to appear in the void. When gathered and ingested, it restores the origin and extends life, making one an eternal guest, ascending into the formless. Thus, boundless transformations arise, and one attains unfettered freedom. Later students must not heed the deceptions of false teachers, risking their very lives. They must carefully seek and discern, embracing the bright and forsaking the dark.\n\nAlas!",
      "overlap_context": "the golden crucible, they must be carefully refined:\nwhen water cools, add fire;\nwhen water boils, withdraw fire.\nMastery of advance and retreat alone ensures success.\nThe immortal master repeatedly emphasizes the phrase \"follow the time,\"\nurging those who later aspire to the Dao—\nseizing the full moon’s moment is the proper time to act,\nnothing ordinary about it.\nThe Golden Buddha is the Mahāyāna’s awakened Golden Immortal,\nhis true form sixteen feet tall—\none with the great elixir’s principle.",
      "start_char": 2053,
      "end_char": 2701,
      "start_sentence": 122,
      "end_sentence": 155,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.362333059310913,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖指玄篇诗注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "迷者自迷，各宜穷理，覆鸡用卵。 其十：天机不泄世难知，漏泄天机写作诗，同类铸成驱鬼剑，共床作起上天梯，人须人度超尘世，龙要龙交出污泥。 莫怪真情都实说，只缘要度众群迷。 玉蟾曰：同类者，天以地为类，日以月为类，女以男为类，阳以阴为类。 契云：勾陈腾蛇。 青龙白虎相呼相唤，相扶相舞，颠倒修之，离取坎补。 纯阳此诗，真实泄露天机。 蟾复解此，惟愿后来万万人，学同长生之域，各当及早修持，莫待今生错过。 十一：返本还源已到乾，能升能降作（一作“号”）飞仙。 一阳发（一作“生”）是兴工日，九转周为得道年。 炼药但寻朱里汞（一作“金里水”），安炉先立地中天。 此中就（一作“便”）是还丹理，不是真（一作“奇”）人莫浪（一作“誓莫”）传。 玉蟾曰：返本还源，须要天地相合，龙虎相交，方得木火下降，金水上升。 要识一阳生时，安炉立鼎，掘地寻天，采丹接命。 知之者，切莫乱传。 若非道心坚固者，虽金玉丛中，视若浮云； 任是父子骨肉，道心不坚，敢轻亡传，天必殃报，九祖沉沦。 还丹秘宝《度人经》云：四万动一传。 故纯阳告戒。 十二：天生一物变三才，交感阴阳结圣胎。 龙虎顺行阴鬼出（一作“去”），龟蛇逆往火神（一作“龙”）来。 婴儿日食（一作“吃”）黄婆髓，姹女时餐白玉杯。 功满自然居物外，人间寒暑任轮回。 玉蟾曰：一物，是真铅也。 盖真铅生于天地之先，号为元始一炁，能生天生地生万物。 今者返而求之，须用阴阳交感，逆施造化，故能成仙成佛。 上圣已知汞性好飞，遇铅乃结。 炼真铅伏制真汞，如母伏子，不致逃失，方结圣胎，以为长生不老神仙。 十三：先天一炁号虚无，运转能教骨不枯。 要识汞根寻蒂子，方求铅本问仙姑。 人人会饮长生洒，个个能成不死夫。 色即是空空即色，朗然飞过洞庭湖。 玉蟾曰：先天炁为铅，无形而能制汞。 离虚坎实，采而补之，汞精不致飞走，故能结胎神化。 妙在心如太虚，色境两忘，忘无可忘，方可求之。 若人欲横流，终不能成。 十四：大道玄机颠倒颠，掀翻地府要寻天。 龟蝇共穴谁能见，龙虎同宫孰敢言？ 九夏高山生白雪，三冬奋火种金莲。 丁宁学道诸君子，好把无毛猛虎牵。 玉蟾曰：颠倒之机，前篇已露。 纯阳复作此诗，惟恐后人信心不坚。 知牵无毛猛虎，道不远矣！ 十五：地上灵芝天上安，时中采得结纯乾。 无根自有阳春至，有本多因气脉缠。 姹女戏时神力壮，婴儿舞处道心坚。 可怜世上无知识，我得长生寿万年。 玉蟾曰：花果非在天地，不离人身，婴儿姹女，无媒不合。 有缘能悟，便可得仙。 噫！ 只待地母花开日，便是黄河彻底清。 十六：劝君保重一分阴，悟此仙机在用心。 只是人身常运转，何劳物外苦搜寻。 忙求北海初潮水，灌济东山老树根。 此玄机重漏泄，弹琴须要遇知音。 玉蟾曰：以上诗十六首，以为二八一斤之数。 古仙尝惜分阴，今人反有休息，将身至死犹不知悔，须将精气顾惜，莫听邪师妄惑，服炼草木药石皆是胡为，去道远矣。 有等愚夫俗子，又不知出世间法，不知还丹至理，妄生议论； 皆言修道炼丹，必居深山穷谷，必须抛妻弃子。 此辈真可惜也！",
      "translated_text": "Those lost remain lost—each must exhaustively investigate principle, like hatching a chicken from an egg.\n\n**Tenth:**\nThe celestial mechanism is not revealed, and the world scarcely knows it;\nLeaking the celestial mechanism, one writes it in verse.\nOf the same kind, forging a demon-expelling sword,\nTogether in bed, constructing a ladder to heaven—\nPeople must be delivered by people to transcend the dusty world,\nDragons must mate with dragons to emerge from the mire.\nDo not blame me for speaking the truth in full,\nOnly because I wish to deliver the deluded masses.\n\nMaster Jade Toad says: \"Of the same kind\"—heaven takes earth as its kind, the sun takes the moon as its kind, woman takes man as its kind, yang takes yin as its kind.\nAs the *Knot* says: \"The Curved Array and the Soaring Serpent.\"\nGreen Dragon and White Tiger call to each other, support each other, dance with each other;\nInverting the practice, one extracts from *Li* to replenish *Kan*.\nThis verse by Pure Yang truly leaks the celestial mechanism.\nThe Toad further explains: May the millions of later learners strive for the realm of long life;\nEach must cultivate early—do not let this life slip by.\n\n**Eleventh:**\nReturning to the origin and restoring the source, one reaches *Qian*;\nAble to ascend and descend, one becomes a flying immortal.\nThe arising of the first yang is the day to commence work;\nNine revolutions complete the year of attaining the Dao.\nIn refining the elixir, seek mercury within cinnabar;\nIn establishing the furnace, first erect heaven within earth.\nHere lies the principle of the returning elixir—\nLet it not be rashly transmitted by those who are not true adepts.\n\nMaster Jade Toad says: To return to the origin and restore the source,\nOne must have heaven and earth unite, dragon and tiger mate,\nSo that wood and fire descend, metal and water ascend.\nTo recognize the time when the first yang arises,\nEstablish the furnace and set up the tripod,\nDig earth to seek heaven,\nAnd gather the elixir to extend life.\nThose who know must not transmit it carelessly.\nIf one’s resolve in the Dao is not steadfast,\nEven amid piles of gold and jade, one regards them as floating clouds.\nEven if it be father and son, flesh and blood,\nIf the resolve in the Dao is not firm,\nDare one lightly transmit it in vain—\nHeaven will surely bring calamity,\nAnd nine generations will sink into perdition.\nThe *Scripture for Delivering Humanity* on the secret treasure of the returning elixir says:\n\"Forty thousand movements for a single transmission.\"\nThus Pure Yang issues this warning.\n\n**Twelfth:**\nHeaven generates one thing, transforming the Three Powers;\nThe intercourse of yin and yang forms the sacred embryo.\nDragon and tiger proceed in order, and the yin ghost departs;\nTortoise and serpent move in reverse, and the fire spirit arrives.\nThe infant daily consumes the marrow of the Yellow Dame;\nThe maiden of mystery often dines from the white jade cup.\nWhen merit is complete, one naturally dwells beyond things,\nWhile the cold and heat of the human world turn in their cycles.\n\nMaster Jade Toad says: \"One thing\" is true lead.\nNow, true lead arises before heaven and earth,\nCalled the primordial ancestral qi,\nAble to generate heaven, earth, and the myriad things.\nToday, seeking it in reverse,\nOne must use the intercourse of yin and yang,\nInverting the workings of creation—\nOnly then can one become an immortal or a buddha.\nThe sages of old knew that mercury’s nature loves to fly,\nAnd only when it meets lead does it congeal.\nRefining true lead to subdue true mercury,\nLike a mother taming her child,\nPrevents its escape and loss,\nThus forming the sacred embryo,\nTo become a long-lived, ageless divine immortal.\n\n**Thirteenth:**\nThe primordial qi is called Emptiness and Nothingness,\nIts circulation keeps the bones from withering.\nTo know the root of mercury, seek the stem;\nTo find the origin of lead, ask the immortal maiden.\nEveryone can drink the wine of long life,\nEach can become an undying husband.\nForm is emptiness, emptiness is form—\nBrightly, one flies across Dongting Lake.\n\nMaster Jade Toad says: The primordial qi is lead,\nFormless yet able to subdue mercury.\n*Li* is empty, *Kan* is full—\nExtract and replenish them,\nSo that the essence of mercury does not fly away,\nAnd the embryo can be spiritually transformed.\nThe wonder lies in the heart like the great void,\nForgetting both form and realm,\nForgetting even the act of forgetting—\nOnly then can one seek it.\nIf human desire overflows,\nOne will never succeed.\n\n**Fourteenth:**\nThe profound mechanism of the Great Dao is inversion upon inversion;\nOverturning the earthly prison, one must seek heaven.\nWho can see the tortoise and fly sharing a cave?\nWho dares speak of dragon and tiger dwelling in the same palace?\nIn the ninth summer, white snow grows on high mountains;\nIn the third winter, flames blaze to cultivate golden lotuses.\nI urge you, gentlemen who study the Dao,\nTo skillfully rein in the hairless fierce tiger.\n\nMaster Jade Toad says: The mechanism of inversion\nHas already been revealed in the previous verses.\nPure Yang writes this poem again,\nOnly fearing that later learners lack steadfast faith.\nTo know how to rein in the hairless fierce tiger—\nThe Dao is not far off!\n\n**Fifteenth:**\nThe numinous fungus on earth is placed in heaven;\nGathered in due season, it forms pure *Qian*.\nRootless, yet the vernal yang arrives on its own;\nWith a foundation, it often entwines with the qi channels.\nWhen the maiden of mystery plays, her spiritual power is strong;\nWhen the infant dances, his resolve in the Dao is firm.\nPity the ignorant in the world—\nI alone attain long life and live ten thousand years.\n\nMaster Jade Toad says: The flower and fruit are not in heaven and earth,\nYet they do not depart from the human body.\nInfant and maiden of mystery—without a matchmaker, they do not unite.\nIf one has the karmic affinity to awaken,\nOne can attain immortality.\nAlas!\nOnly wait for the day when the earth mother’s flower blooms—\nThat is when the Yellow River will run clear to the bottom.\n\n**Sixteenth:**\nI urge you to cherish every fraction of yin;\nAwaken to this immortal mechanism through the mind.\nIt is only the constant circulation within the human body—\nWhy laboriously search beyond things?\nHastily seek the first tidewater of the Northern Sea\nTo irrigate the roots of the old tree on Eastern Mountain.\nThis profound mechanism is heavily leaked—\nOne must play the zither only for a knowing audience.\n\nMaster Jade Toad says: The above sixteen poems\nMake up the weight of two eights and one catty.\nThe ancient immortals cherished every fraction of yin,\nYet people today, in contrast, rest and idle,\nBringing themselves to death without remorse.\nOne must cherish essence and qi,\nNot heed the deceptions of false teachers,\nFor consuming and refining herbs, minerals, and stones are all delusions,\nFar removed from the Dao.\nThere are foolish and vulgar people\nWho know nothing of the Dharma beyond the world,\nNothing of the supreme principle of the returning elixir,\nAnd idly speculate—\nClaiming that cultivating the Dao and refining the elixir\nRequires dwelling in deep mountains and remote valleys,\nNecessitates abandoning wife and children.\nSuch people are truly pitiable!",
      "overlap_context": " do they obtain the primordial ancestral qi, which transforms into a grain of millet, descending to appear in the void. When gathered and ingested, it restores the origin and extends life, making one an eternal guest, ascending into the formless. Thus, boundless transformations arise, and one attains unfettered freedom. Later students must not heed the deceptions of false teachers, risking their very lives. They must carefully seek and discern, embracing the bright and forsaking the dark.\n\nAlas!",
      "start_char": 2701,
      "end_char": 3957,
      "start_sentence": 156,
      "end_sentence": 215,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.86675834655762,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖指玄篇诗注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "蟾今直指，各宜究参。 深山所有者，草木禽兽，皆是非类，岂能修炼还丹？ 《悟真》云：未炼还丹莫入山，山中内外尽非铅。 此般至宝家家有，只有愚夫识不全。 又云：汞是我家原有物，铅是他家不死方。 若将金石草木任猜量，到底枉猜量，必入轮回去。 今纯阳云：北海初潮，即是丹井中新出之甘泉，实为难得之宝耳。 盖初潮二字，便是先天一炁，真铅之炁，故谓之至宝。 无价之宝，可为大丹之母。 东山枯木，北泉注之，枝叶重荣，根本永固。 歌云：北方正气为河车，东方甲乙为丹砂。 两情合养为一体，朱雀调运生金花。 《契》云：丹砂木精，得金乃。 太阳流珠，常欲去人。 卒得金花，转而相因。 盖此意也。 以上丹经万卷，天机不泄，蟾今又注释之。 指下琴音，世无知者。 此书在处，当有神祗拥护。 学仙者有缘得遇，信受奉行，立跻天仙也。 指玄三灿下篇 其一：（三韵并用）世人宜假不宜真，难度长生上品经。 不免天机重漏泄，灵丹只是气和精。 和曰：纯阳仙圣得全真，慈度重宣上品经。 后学殷勤加爱敬，只宜修炼气和精。 其二：道在人为日用常，逆修入口遍身香。 便须默养天胎就，稳跨翔鸾谒玉皇。 和曰：无中生有得非常，西海金生丽水香。 取得归来铛内煮。 待炉丹熟礼虚皇。 其三：西北东南在两厢，长房缩地合中央。 后人好学神仙法，一样丹砂补败场。 和曰：雄虎雌龙各一厢。 凭媒牵引入中央。 炼时匹休轻视，顷刻终成大道场。 其四：（第二句借韵）此法真中妙更真，无头无尾又无形。 窈冥恍惚能相见，便是超凡出世人。 和曰：真中无假假中真，听不闻声视没形。 学道知机能着力，得之凡骨变仙人。 其五：东华姓木老仙翁，独坐长房未有功； 忽遇西王金圣母，灵丹一粒便腾空。 和曰：家家有过主人翁，只为贪迷昧圣功。 若解转头颠倒做，守真志总归空。 其六：一法通时万法通，休分南北与西东。 朝朝只在君家舍，要见须知掘土中。 和曰：玄牝之门若会通，百川万派总归东。 时人若识真消息，子正阳生月正中。 其七：黄鹤楼中吹笛时，白苹红蓼满江湄。 衷情欲诉无人识，只有清风明月知。 和曰：铁笛横吹正子时，一轮明月见江湄。 此中便是真端的，试问诸君知不知？ 其八：（二韵并用）法是先天一点（气），将来锻炼作元神。 法官存想驱雷使，炼此方能上玉京。 和曰：太乙含住先天（气），灵阳藏固养精神。 两般若得相和合，指日飞升朝玉京。 其九：二八佳人体似酥，腰间仗剑斩愚夫。 分明不见人头落，暗里教君骨髓枯。 和曰：无情何怕体如酥，空色两忘是丈夫。 识得刚柔相济法。 一阳春气为虚枯。 其十：曾读仙经万卷多，篇篇只教运黄河。 此中有盏长生酒，问道时人能吃么？ 和曰：一句通玄不用多，大家着力挽银河。 三花灌上昆仑顶，不是神仙是什么？ 十一：朝游北海（一作北越，又作百越，又作岳鄂。 ）暮苍梧，袖里青蛇胆气粗。 三醉岳阳人不识，朗然（一作吟）飞过洞庭湖。 和曰：一对鸾凤戏碧梧，性情相契要精粗。 有人识得玄中理，何必登山及泛湖。 十二：我命从来本自然，果然由我不由天。 金丹一服身通圣，可作蓬莱阆苑仙。 和曰：道本无言只自然，真铅要识地中天。",
      "translated_text": "Master Jade Toad now points directly—each should diligently investigate and contemplate.\n\nWhat dwells in deep mountains—grasses, trees, birds, and beasts—are all of the wrong kind; how could they refine the returning elixir? As the *Awakening to Reality* says:\n*\"Before refining the returning elixir, do not enter the mountains—*\n*Within and without those peaks, there is no true lead.\"*\nSuch supreme treasures are found in every household,\nYet only fools fail to recognize them in full.\n\nIt further states:\n*\"Mercury is what my family originally possesses;*\n*Lead is the deathless method of another household.\"*\nIf one recklessly speculates with gold, stone, herbs, or wood,\nAll guesswork is in vain—one must inevitably enter the wheel of rebirth.\n\nNow, Pure Yang says:\n*\"The first tide of the Northern Sea*\n*Is the newly drawn sweet spring from the elixir well—*\n*Truly a rare and precious treasure.\"*\nFor the phrase *\"first tide\"* signifies the primordial qi,\nThe true qi of lead—hence it is called the supreme treasure,\nA priceless gem that serves as the mother of the great elixir.\nWhen the withered tree of the eastern mountain\nIs infused with the northern spring,\nIts branches and leaves flourish anew,\nAnd its roots stand firm forever.\n\nA song says:\n*\"The upright qi of the north becomes the river chariot;*\n*The wood-metal of the east becomes cinnabar.*\n*When the two natures are nurtured as one,*\n*The Vermilion Bird stirs and births the golden flower.\"*\n\nThe *Cantong Qi* states:\n*\"Cinnabar is the essence of wood,*\n*Only when it meets metal does it congeal.*\n*The sun’s flowing pearl ever seeks to depart—*\n*Only when it obtains the golden flower does it turn and remain.\"*\nThis is the very meaning.\n\nThough the elixir classics number ten thousand volumes,\nTheir celestial mechanisms remain unspoken—\nYet now I, Jade Toad, once more annotate them.\nThe lute’s notes beneath my fingers\nAre known to none in this world.\nWherever this book resides,\nDivine guardians shall shield it.\nThose who study immortality, if destined to encounter it,\nAnd believe, receive, and practice its teachings,\nShall swiftly ascend as celestial immortals.\n\n---\n\n**Three Radiant Pointers to the Mysterious (Lower Scroll)**\n**First (three rhymes combined):**\nThe world favors the false over the true,\nMaking the supreme scripture of long life hard to traverse.\nYet I cannot help but reveal this celestial secret anew—\nThe numinous elixir is merely qi and essence conjoined.\n\n**Harmonized Response:**\nThe perfected sage Pure Yang attained wholeness,\nCompassionately proclaiming the supreme scripture again.\nLater learners should reverently cherish and honor it—\nSimply cultivate and refine qi and essence.\n\n**Second:**\nThe Dao resides in human conduct, daily and constant;\nCultivating in reverse, it enters the mouth and perfumes the body.\nThen one must silently nurture the celestial embryo to completion,\nSteadily riding a soaring simurgh to meet the Jade Emperor.\n\n**Harmonized Response:**\nFrom nothing, something arises—uncommon indeed!\nThe gold of the Western Sea blooms with the fragrance of Lishui.\nBring it back and boil it in the crucible—\nWait until the elixir matures to pay homage to the August Void.\n\n**Third:**\nWest, north, east, and south lie in the two flanks,\nYet Master Chang’s earth-shrinking gathers them at the center.\nLater learners who favor the arts of immortality—\nUse the same cinnabar to mend the ruined stage.\n\n**Harmonized Response:**\nThe male tiger and female dragon each occupy a flank,\nDrawn together by a matchmaker to the center.\nWhen refining, do not slight the paired essences—\nIn an instant, the great Dao’s arena is complete.\n\n**Fourth (second line borrows rhyme):**\nThis method is true within the true, yet wondrously truer still;\nWithout head or tail, without form.\nIn the profound and dim, if you can perceive it,\nYou are one who transcends the mundane and leaves the world.\n\n**Harmonized Response:**\nWithin the true, no false; within the false, the true.\nInaudible in sound, invisible in form.\nIf a Dao learner knows the mechanism and applies effort,\nThey shall transform mortal bones into an immortal’s.\n\n**Fifth:**\nThe old immortal of Eastern Flower, surnamed Wood,\nSat alone in Master Chang’s chamber, yet achieved nothing.\nSuddenly he met the Golden Sage Mother of the West—\nWith a single grain of numinous elixir, he soared into the void.\n\n**Harmonized Response:**\nEvery household has its master,\nYet for greed and delusion, they neglect the sage’s work.\nIf one understands how to reverse and invert the process,\nGuarding the true intent, all returns to emptiness.\n\n**Sixth:**\nWhen one method is mastered, all methods are mastered;\nNo need to divide north, south, east, or west.\nDay after day, it lies within your own dwelling—\nTo see it, you must know to dig within the earth.\n\n**Harmonized Response:**\nIf you comprehend the Gate of the Mysterious Female,\nAll rivers and myriad streams return to the east.\nIf people today grasp the true message,\nAt midnight the yang arises, at mid-month the moon is full.\n\n**Seventh:**\nWhen the flute played in Yellow Crane Tower,\nWhite duckweed and red smartweed filled the river’s edge.\nThe heart’s feelings longed to be told, yet none understood—\nOnly the clear wind and bright moon knew.\n\n**Harmonized Response:**\nThe iron flute plays at the stroke of midnight,\nA bright moon wheel appears above the river’s edge.\nHere lies the true and certain truth—\nI ask you, gentlemen, do you know it or not?\n\n**Eighth (two rhymes combined):**\nThe method is the primordial point of qi;\nRefine it to become the original spirit.\nThe ritual master visualizes and commands the thunder spirits—\nOnly by refining this can one ascend to the Jade Capital.\n\n**Harmonized Response:**\nThe Great Monad contains the primordial qi,\nThe numinous yang is securely stored to nurture the spirit.\nIf the two can harmonize and unite,\nOne shall ascend to the Jade Capital in days.\n\n**Ninth:**\nThe beauty of sixteen, her body like softened lard,\nWields a sword at her waist to slay foolish men.\nThough no severed heads are seen,\nIn secret, she drains their marrow and bones.\n\n**Harmonized Response:**\nThe passionless fear not a body like lard;\nTo forget both form and emptiness is the true man.\nIf you recognize the method of balancing hardness and softness,\nThe spring qi of yang will not wither in vain.\n\n**Tenth:**\nI have read ten thousand scrolls of immortal scriptures,\nEach teaching only how to move the Yellow River.\nWithin this lies a cup of wine for long life—\nI ask those of this world: can you drink it?\n\n**Harmonized Response:**\nA single phrase penetrates the mysterious—no need for many.\nAll must strive together to pull the Silver River.\nWhen the Three Flowers irrigate Kunlun’s peak,\nWhat else could you be if not an immortal?\n\n**Eleventh:**\nAt dawn I roam the Northern Sea (or Northern Yue, or Hundred Yue, or Yue’e),\nAt dusk I reach Cangwu,\nA green snake in my sleeve, my gall bold.\nThrice drunk at Yueyang, none recognize me—\nBrightly I fly across Dongting Lake.\n\n**Harmonized Response:**\nA pair of simurghs play by the verdant parasol tree,\nTheir natures in harmony, refined and coarse alike.\nIf one grasps the principle within the mysterious,\nWhy climb mountains or sail lakes?\n\n**Twelfth:**\nMy fate has always been natural,\nTruly dependent on me, not on heaven.\nWith a single dose of golden elixir, the body becomes sacred—\nI may become an immortal of Penglai or the Jasper Pool.\n\n**Harmonized Response:**\nThe Dao is originally wordless, only natural.\nThe true lead must be recognized as heaven within earth.",
      "overlap_context": "d qi,\nNot heed the deceptions of false teachers,\nFor consuming and refining herbs, minerals, and stones are all delusions,\nFar removed from the Dao.\nThere are foolish and vulgar people\nWho know nothing of the Dharma beyond the world,\nNothing of the supreme principle of the returning elixir,\nAnd idly speculate—\nClaiming that cultivating the Dao and refining the elixir\nRequires dwelling in deep mountains and remote valleys,\nNecessitates abandoning wife and children.\nSuch people are truly pitiable!",
      "start_char": 3957,
      "end_char": 5261,
      "start_sentence": 216,
      "end_sentence": 287,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.80150628089905,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖指玄篇诗注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "河车运上昆仑顶，作圣超凡便是仙。 十三：修仙不问男和女，炼药无拘富与贫。 一念不差皆可作，我知不是世间人。 和曰：王母本是凡人女，葛洪家道十分贫。 二仙有样皆当学，苦口良言不惧人。 十四：神仙歌诀泄天机，方便慈悲指世迷。 见者莫生颠倒见，大家都好学妆痴。 和曰：篇篇字字有真机，悟者回头莫执迷。 大药丹方难得遇，遇之不炼是愚痴。 十五：不死金丹种土砂，诸人会得早离家。 一心只望长生路，切莫如蜂苦恋花。 和曰； 非金非木亦非砂，此个原来本在家。 释氏初生全漏泄，因何末后又拈花。 十六：真铅大药本无形，只在人心暗与明。 老子怀胎十个月，功行圆满自通灵。 和曰：哑子得梦醒无形，有口难言只自明。 浓血皮包无价宝，若还人得便通灵。 十七：鼎炉安立守其心，八两朱砂八两金。 和合天平兑定了，便须仔细定浮沉。 和曰：昨夜进心要坚心，煅炼顽铜化赤金。 赫赫光明侵碧嶂，丹成妙诀定浮沉。 十八：奉真修道守中和，铁杵成针要琢磨。 此事本然无大巧，只争日逐用功多。 和曰：人人天赋此元和，好把真常各打磨。 今古上仙成道者，皆缘掘地采铅多。 十九：一阳气发用功夫，日月精华照玉壶。 到此紧关休妄动，恐防堕落洞庭湖。 和曰：达摩当日用功夫，独坐长芦用酒壶。 得了一杯倾灌顶，摘芦脚踏过东湖。 二十：曲江月现水澄清，沐浴须当定主宾。 若得水温身暖处，便当牢固办前程。 和曰：采药须知浊与清，饶他为说我为宾。 若非猛火汤烹处，端坐休教再进程。 二一：龙虎相逢上战场，霎时半刻定兴亡。 诸君逄恶当行善，若要争强必损伤。 和曰：五炁朝元作道场，三华聚顶万邪亡。 嗜美景时须谨慎，切防危险莫被伤。 二二：道本无言法本空，强名指作虎和龙。 天然一物真元始，隐在阎浮同类中。 和曰：须信金丹本不空，成功须用虎和龙。 子时运入昆仑顶，午循环沧海中。 二三：人言我道是虚浮，我笑世人太没谋。 一粒金丹长命药，暗中失了不知愁。 和曰：炼丹须要识沉浮，未炼还丹用意谋。 指教后人能得手，不须日夜用心愁。 二四：龙虎金丹妙合天，风云际会泄甘泉。 白头老子能知此，返老还童寿万年。 和曰：金丹妙道本先天，隐在坤维化玉泉。 松柏因他滋本固，经霜耐没穷年。 二五：两口相逄是吕岩，诸人识得莫胡谭。 离中力量人难敌，能把乾坤一担担。 和曰：伏虎须教入虎岩，吞声忍气绝言谭。 得李虎子牢擒捉，配个龙儿一担担。 二六：降龙须要志如天，伏虎心雄气似烟。 痴蠢愚人能会得，管教立地作神仙。 和曰：亏心亏理即欺天，四物相遮黑似烟。 此辈即同禽兽类，如何见得玉天仙。 二七：一本梅花十月开，预先待得早春来。 木微尚且知时景，人不回头只得呆。 和曰：枯木逢春花再开，皆因天地一阳来。 诸人年老难重少，只是贪痴呆上呆。 二八：方方游化唱仙歌，反被时人笑是魔。 不识真金如粪土，老龙把作毒蛇蹉。 和曰：颠倒修行唱道歌，篇篇剪怪又驱魔。 人人要上蓬莱路，会用工夫心莫蹉。 二九：昔年游戏岳阳楼，好个莺花鹦鹉洲。 今日重来沽美酒，故人多半丧荒丘。 和曰：茅庵静坐胜高楼，耐守功完上十洲。 堪叹玉堂诸学士，文章绵绣葬荒丘。",
      "translated_text": "**Thirteenth:**\nCultivating immortality asks not of man or woman,\nRefining the elixir knows no bounds of wealth or poverty.\nA single thought without error—all may achieve it,\nI know I am no longer a mortal of this world.\n\n**Harmonized Response:**\nThe Queen Mother was once a mortal woman,\nGe Hong’s family was utterly impoverished.\nBoth immortals set examples to follow—\nBitter words of truth need not fear reproach.\n\n**Fourteenth:**\nThe immortal’s song and verse reveal heaven’s mechanism,\nWith compassion and expedience, they guide the lost.\nLet none who see them fall into delusion—\nAll should feign foolishness and learn.\n\n**Harmonized Response:**\nEvery line and character holds true mechanism,\nThose who awaken must turn back and not cling to delusion.\nThe great elixir’s formula is rarely encountered—\nTo meet it and not refine it is sheer folly.\n\n**Fifteenth:**\nThe deathless golden elixir is sown in earth and sand,\nThose who grasp it should leave home early.\nWith a heart set only on the path of longevity,\nNever cling like bees to flowers in vain.\n\n**Harmonized Response:**\nIt is neither metal nor wood nor sand,\nFor this originally dwells within the home.\nWhen Śākyamuni first emerged, the secret was fully revealed—\nWhy then, at the end, did he hold up a flower?\n\n**Sixteenth:**\nTrue lead and the great elixir are formless,\nExisting only in the mind’s darkness or clarity.\nLaozi gestated for ten months,\nWhen merit and practice were complete, he attained spiritual communion.\n\n**Harmonized Response:**\nA mute dreams of forms upon waking,\nThough speechless, the truth is self-evident.\nPrecious treasure lies wrapped in thick blood and skin—\nIf one grasps it, spiritual communion is achieved.\n\n**Seventeenth:**\nThe crucible and furnace are established to guard the heart,\nEight ounces of cinnabar, eight ounces of gold.\nOnce the celestial balance is harmonized and measured,\nCarefully discern what floats and what sinks.\n\n**Harmonized Response:**\nLast night, the heart was urged to steadfastness,\nTempering stubborn copper into crimson gold.\nResplendent radiance pierces the azure peaks—\nWhen the elixir is complete, the secret determines floating and sinking.\n\n**Eighteenth:**\nDevoted to truth, cultivating the Dao, uphold harmony,\nLike iron pestles forged into needles, refine ceaselessly.\nThis matter is inherently without great artifice—\nOnly the daily accumulation of effort makes the difference.\n\n**Harmonized Response:**\nEach person is endowed with this primordial harmony,\nTake the eternal and polish it diligently.\nImmortals of past and present who attained the Dao\nAll delved deep to gather lead in abundance.\n\n**Nineteenth:**\nWhen the first yang qi arises, apply effort,\nThe essence of sun and moon illuminates the jade crucible.\nAt this critical juncture, do not act recklessly,\nLest you fall into Dongting Lake.\n\n**Harmonized Response:**\nBodhidharma once applied effort,\nSitting alone on a long reed, holding a wine flask.\nHaving received a cup, he poured it over his crown—\nPlucking the reed, he stepped across the eastern lake.\n\n**Twentieth:**\nThe moon over Qujiang appears as the waters grow clear,\nBathing requires discerning host and guest.\nWhen the water warms and the body grows warm,\nSecure your path forward with resolve.\n\n**Harmonized Response:**\nGathering the elixir requires knowing turbidity and clarity,\nThough others speak, I remain the guest.\nWithout the fierce fire and boiling cauldron,\nSit firmly and advance no further.\n\n**Twenty-First:**\nDragon and tiger meet upon the battlefield,\nIn an instant, victory or defeat is decided.\nWhen you encounter evil, practice goodness—\nContention will only bring harm.\n\n**Harmonized Response:**\nThe five qi converge at the origin to form the Dao’s field,\nThe three flowers gather at the crown, banishing all evil.\nWhen indulging in beauty, be cautious—\nBeware of danger and avoid injury.\n\n**Twenty-Second:**\nThe Dao is originally wordless, the Dharma inherently empty,\nForcibly named as tiger and dragon.\nThe one true primordial essence\nHides among beings of the same kind in Jambudvīpa.\n\n**Harmonized Response:**\nTrust that the golden elixir is not empty,\nIts success requires tiger and dragon.\nAt the hour of *zi*, it ascends Kunlun’s peak,\nAt *wu*, it circulates within the vast sea.\n\n**Twenty-Third:**\nPeople say my Dao is hollow and fleeting,\nI laugh at the world’s lack of foresight.\nA single grain of golden elixir, the medicine of longevity—\nLost in darkness, they know not their sorrow.\n\n**Harmonized Response:**\nRefining the elixir requires discerning floating and sinking,\nBefore returning the elixir, apply careful intent.\nGuide later generations to mastery—\nNo need for ceaseless, anxious toil.\n\n**Twenty-Fourth:**\nThe dragon-tiger golden elixir wondrously aligns with heaven,\nWind and clouds converge, revealing sweet springs.\nIf the white-haired elder grasps this,\nHe will reverse aging and live ten thousand years.\n\n**Harmonized Response:**\nThe wondrous Dao of the golden elixir is of primordial heaven,\nHidden in the southwest, transforming into jade springs.\nPines and cypresses thrive by its nourishment,\nEnduring frost, they last without end.\n\n**Twenty-Fifth:**\nWhen two mouths meet, it is Lü Yan,\nThose who recognize this must not speak recklessly.\nThe power within *li* is unmatched,\nCapable of shouldering heaven and earth.\n\n**Harmonized Response:**\nTo subdue the tiger, enter its den,\nSwallowing pride, restraining speech.\nOnce the tiger’s cub is firmly seized,\nPair it with a dragon to bear the burden.\n\n**Twenty-Sixth:**\nTo subdue the dragon, one’s will must be as vast as heaven,\nTo tame the tiger, the heart must be fierce, the qi like smoke.\nIf even the foolish and dull can grasp this,\nThey will instantly become immortals.\n\n**Harmonized Response:**\nTo act against conscience and reason is to deceive heaven,\nFour things obscure it, dark as smoke.\nSuch people are no better than beasts—\nHow could they ever meet the Jade Celestial?\n\n**Twenty-Seventh:**\nA single plum blossom blooms in the tenth month,\nAnticipating the early arrival of spring.\nEven the frailest wood knows the seasons—\nThose who do not turn back remain fools.\n\n**Harmonized Response:**\nWithered wood blooms again in spring,\nAll because heaven and earth’s first yang arrives.\nThough people age, they cannot regain youth—\nAll for clinging to greed and folly, growing ever more foolish.\n\n**Twenty-Eighth:**\nTraveling everywhere, I sing immortal songs,\nYet the people of this age mock me as a demon.\nThey mistake true gold for dung,\nOld dragons take it for venomous snakes.\n\n**Harmonized Response:**\nInverting cultivation, I sing the Dao’s songs,\nEach verse cuts through demons and exorcises evil.\nAll wish to ascend Penglai’s path—\nApply effort, and let not the heart falter.\n\n**Twenty-Ninth:**\nLong ago, I wandered at Yueyang Tower,\nA fine place—Oriole Flower and Parrot Isle.\nToday, I return to buy fine wine,\nYet most of my old friends lie in barren mounds.\n\n**Harmonized Response:**\nA thatched hut, quiet sitting—better than lofty towers,\nWith patience and completed merit, ascend the ten isles.\nHow lamentable the scholars of the jade halls—\nTheir embroidered words now buried in desolate graves.",
      "overlap_context": "y by the verdant parasol tree,\nTheir natures in harmony, refined and coarse alike.\nIf one grasps the principle within the mysterious,\nWhy climb mountains or sail lakes?\n\n**Twelfth:**\nMy fate has always been natural,\nTruly dependent on me, not on heaven.\nWith a single dose of golden elixir, the body becomes sacred—\nI may become an immortal of Penglai or the Jasper Pool.\n\n**Harmonized Response:**\nThe Dao is originally wordless, only natural.\nThe true lead must be recognized as heaven within earth.",
      "start_char": 5261,
      "end_char": 6601,
      "start_sentence": 288,
      "end_sentence": 357,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.52281045913696,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖指玄篇诗注.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "三十：遨游大地十余秋，劝化时人不肯修。 留此一篇真奥妙，飘然直上凤麟洲。 和曰：暑往寒来春复秋，人生如梦早宜修。 仙家岂有浮空语，悟透玄风上十洲。 三一：苦劝人修不肯修，却将恩德反为仇（音求）。 如今回首朝天去，不管人间得自由。 和曰：世人宜早发心修，夫妇恩深总是仇。 不信吾言当自省，眼昏背曲为何由。 三二：浮名浮利事如风，飘来飘去有何功？ 诸人各自宜三省，莫把仙方当脱空。 和曰：纯阳袖大惹春风，归去来兮甚有功。 留下玄机无价宝，玉蟾解和亦谈空。",
      "translated_text": "**Thirtieth:**\nFor over a decade, I roamed the vast earth,\nExhorting the people of this age—none would cultivate.\nI leave this one true, wondrous scripture,\nAnd ascend lightly to Phoenix-Unicorn Isle.\n\n**Harmonized Response:**\nHeat departs, cold arrives, spring returns in autumn’s wake,\nLife is but a dream—best to cultivate early.\nThe immortals speak no empty words—\nPenetrate the mystic wind and ascend the ten isles.\n\n**Thirty-First:**\nI urged them bitterly to cultivate, yet they refused,\nTurning kindness into enmity instead.\nNow I turn my gaze toward heaven and depart,\nLeaving the mortal realm to its own freedom.\n\n**Harmonized Response:**\nThe world should awaken early to cultivation,\nFor even the deepest bonds of husband and wife are but enmity.\nIf you doubt my words, reflect upon yourself—\nWhy do eyes grow dim and backs bend with age?\n\n**Thirty-Second:**\nFleeting fame, fleeting profit—like the wind,\nDrifting here and there, what merit is gained?\nLet each of you examine yourselves thrice,\nAnd not dismiss the immortal’s path as mere illusion.\n\n**Harmonized Response:**\nPurity Yang’s sleeves stir the spring breeze,\nReturning home—what great merit lies therein!\nHe left behind priceless mystic treasures,\nYet the Jade Toad still debates emptiness.",
      "overlap_context": "wish to ascend Penglai’s path—\nApply effort, and let not the heart falter.\n\n**Twenty-Ninth:**\nLong ago, I wandered at Yueyang Tower,\nA fine place—Oriole Flower and Parrot Isle.\nToday, I return to buy fine wine,\nYet most of my old friends lie in barren mounds.\n\n**Harmonized Response:**\nA thatched hut, quiet sitting—better than lofty towers,\nWith patience and completed merit, ascend the ten isles.\nHow lamentable the scholars of the jade halls—\nTheir embroidered words now buried in desolate graves.",
      "start_char": 6603,
      "end_char": 6839,
      "start_sentence": 358,
      "end_sentence": 369,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.443997621536255,
      "metadata": {
        "source_file": "dao\\藏外\\吕祖指玄篇诗注.txt",
        "category": "藏外"
      }
    }
  ]
}