{
  "source_id": "土司灯仪",
  "source_file": "chunked_daozang\\土司灯仪.json",
  "total_chunks": 5,
  "total_original_chars": 3037,
  "total_translated_chars": 19693,
  "total_translation_time": 94.70908451080322,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\威仪类\\土司灯仪.txt",
    "category": "威仪类"
  },
  "full_translation": "**The Tusi Lantern Rites**\n*Sutra Title:* The Tusi Lantern Rites. One fascicle.\n*Source Text:* *Daoist Canon of the Zhengtong Era*, Dongzhen Section, Category of Dignified Observances.\n\n---\n\nThe Tusi Lantern Rites proceed according to ritual form.\n\nWe have heard that when the Primordial Unity first divided and the Two Qi were apportioned, the Four Seasons were set in motion to achieve completion, and the Eight Directions were established to fix their positions. Above, the celestial mansions were arrayed in their courses; below, the terrestrial divisions were evenly distributed. All living beings depend upon the Great Potter’s Wheel, and no creature fails to draw upon the bounty of the Great Creation. Of all beings, humans are the most noble, for they occupy the central position. In all their dwellings and movements, they receive the gifts of Heaven and Earth.\n\nYet how grievous is our ignorance, for we constantly accumulate transgressions! Since abandoning cave-dwelling for nest-like abodes, constructing upper beams and lower eaves, we have dug wells and moved earth, recklessly violating the boundaries of the cardinal directions. We have raised brackets and soaring beams, repeatedly trespassing against taboos—sometimes choosing inauspicious days or months, or acting when the year is unpropitious. Our plans are not guided by tortoise-shell divination or milfoil, nor do we employ the words of shamans or mediums. Whether in the hidden or manifest realms, all such acts are fraught with error.\n\nHow much more so when it comes to the august deities of the Great Year and the Tusi prohibitions! They govern fortune and misfortune, regulate the boundaries of the directions, shift with the Six Jia cycles, and are governed by the revolutions of the Seven Stars. For all construction and dwelling, if one violates the boundaries of the directions, one relies upon the golden statutes of their teachings and the jade scrolls of their scriptures. Those who disregard them invite disaster and scatter blessings; those who observe them dissolve calamity and engender fortune.\n\nNow, so-and-so, in constructing a dwelling, has acted untimely. In breaking ground and mobilizing labor, they have surely transgressed against the prohibitions; in raising foundations and clearing sites, they have surely offended the celestial stars. We have therefore chosen an auspicious day and reverently prepared pure offerings. The scriptures are unsealed, their cloud-seal characters recited to silently dissolve accumulated offenses; the ritual codes are chanted from their jade cases to summon the host of perfected beings. We humbly pray that they bring auspicious omens and assemble a hundred blessings at the gate; that they avert harm and disaster, eradicating a thousand misfortunes from the household. May bandits and thieves be dispelled, and all fire calamities extinguished.\n\nWith bowed heads, we take refuge and reverently offer praise.\n\nWe, your servants, wholeheartedly take refuge and submit to the Great Sage of the Eastern Zhen Palace and the Three Green Star Lords.\n\nWe have heard that Zhen is the chief of the Three Yangs, occupying the first position among the Four Seasons. In the Eight Trigrams, it takes precedence; among the Six Jia, it is the eldest.\n\nCapable of initiating and unfolding, it commands the flourishing freshness of all things; through awe and vigilance, it urges the myriad people to cultivate introspection. It aids the workings of creation, manifesting the signs of generation. In all undertakings of construction or renovation, one must fear transgression.\n\nToday, so-and-so, having prepared the solemn offerings of the jiao ritual, first offers gratitude to the perfected spirits. Carefully following the ritual codes, a star altar is established, complete with the rites of incense and floral offerings. With utmost sincerity, we take refuge and submit to the Great Sage of the Eastern Zhen Palace and the Three Green Star Lords.\n\nWe humbly pray that the perfected immortals descend with their blessings, and the host of sages extend their compassion, absolving and dissolving the faults of our transgressions, and graciously bestowing the blessings of auspicious omens. May the household be solemn and harmonious, with elders and youth in accord; may we pray for longevity to flourish ever more, and the foundation of fortune to be eternally secure.\n\nWith bowed heads, we take refuge and reverently offer praise:\n\nThe Great Dao shines brightly, profound and silent in its mysterious perfection.\nThe Five Dipper governs the central motion, the Five Phases give rise to all things.\nThe Northern Capital of myriad ghosts curtails human lifespan.\nYet we possess divine scriptures to transcend the world and endure forever.\nWe offer reverent worship, and the master’s spirit is invigorated.\nMysterious beyond mystery, towering is the Jade Capital.\nDisasters and obstacles are dispelled, and the Dao’s qi endures forever.\n\nWe, your servants, wholeheartedly take refuge and submit to the Great Sage of the Southeastern Xun Palace and the Four Green Star Lords.\n\nWe have heard that Xun governs the issuing of commands, with Taiyi presiding over the spirits. Its position lies in the southeast, its palace in the fourth green. It oversees the seasonal order of all sprouting life, bringing purity and order to the myriad things. In all undertakings of construction or renovation, how could one avoid offense?\n\nNow, so-and-so prepares the solemn jiao rites, first offering gratitude to the true spirits. Diligently following the liturgical forms, we establish the star altar and arrange the rites of incense, flowers, and offerings.\n\nWith wholehearted devotion, we take refuge and submit to the Southeastern Xun Palace and the Four Green Star Lords. We humbly pray that the divine radiance may illumine the obscure, and the torch of grace extend its brightness, beholding the sincerity of this day’s supplication and cleansing the transgressions of past constructions. May the harms of banditry and plunder forever cease within the household; may the anxieties of fire and conflagration never arise at door or window. May all kin within the gates universally receive pure blessings. In all undertakings, may there be unbroken auspiciousness.\n\nWe bow our heads in reverence and offer devout praise:\nGreat Sage of the Xun Palace, true sovereign of all offices,\nCelestial Pivot and Taiyi, thunder and lightning spirits,\nWho blow away calamities and suppress demonic forces,\nWho enact the transformations of creation and nourish all living things.\nMay boundless blessings be bestowed, ever drawing near.\nWithout limit or peer, in the Golden Towers and Jade Capital,\nMay all disasters and obstacles be dispelled, and long life be attained.\n\nWe, your servants, wholeheartedly take refuge and submit to the Southern Li Palace and the Nine Purple Star Lords.\n\nWe humbly consider that in the transformation and completion of the world, there is no achievement unowed to the power of central rectitude. Raising its luminous beacon to illumine all directions, it fittingly inherits the image of enduring brightness. Enabling the mutual perception of the myriad things, it takes its position in the south. Corresponding to the center of the Two Modes, all are encompassed by its illuminating virtue. For all who dwell in houses, transgressions are manifold.\n\nThis day’s lamp-offering rite, disciple so-and-so, having prepared the solemn jiao sacrifice, first gives thanks to the Perfected Spirits. Reverently following the liturgical forms, we establish the altar precinct and prepare the incense, flowers, and offerings.\n\nWith wholehearted devotion we take refuge and submit to the Southern Li Palace and the Nine Purple Star Lords. We humbly pray that You deign to regard our sincere devotion, specially descend with Your numinous presence, dispel unforeseen calamities, and bestow boundless blessings. May the Nine Transverse Misfortunes never befall our kin, and may a thousand auspicious signs flourish at our gates. Fire and theft shall vanish in secret, while wealth and property increase. Bowing in reverence, we take refuge and devoutly intone:\n\nO Radiant Brilliance, Great Sage, Nine Purple Star Lords,\nWhose fiery light scatters through the world, whose talismanic spells universally arrive.\nThe Willow Star governs, the Wings and Chariot constellations preside.\nThe bing-ding registers pivot, the Fire virtue courses in secret.\nBestow grace, descend with fortune—may good blessings converge.\nSupreme beyond all, in the Mystic Capital and Jade Metropolis,\nMay all disasters and obstacles be dispelled, and long life be attained.\n\nWe, your servants, wholeheartedly take refuge and submit to the Southwest Kun Palace and the Two Qi Star Lords. We humbly consider that in revolving the Kun Palace, the Earth’s Dao is magnified. Bearing Heaven’s model, it embraces all things and transforms them with light. Holding the Empress’s virtue, it bears all beings without limit; embodying the four seasons, it ceaselessly engenders life. Its palace corresponds to the Two Black Stars, its position lies in the southwest. In all construction and dwelling, how could there be no offenses?\n\nThis day, disciple so-and-so, having prepared the solemn jiao sacrifice, first gives thanks to the Perfected Spirits. Reverently following the liturgical forms, we establish the altar precinct and prepare the incense, flowers, and offerings. With wholehearted devotion we take refuge and submit to the Southwest Kun Palace and the Two Black Star Lords. We humbly pray that Your vast kindness and compassion universally extend as hidden virtue. May transgressions be erased from the Black Register, and blessings and longevity inscribed in the Vermilion Record. May all rough misfortunes be forever dispelled, and constant peace and prosperity be our lot. May a thousand Perfected Ones protect us, and ten thousand Sages sustain us.\n\nBowing in reverence, we take refuge and devoutly intone:\nO Kun’s Primal Empress Virtue, whose vast descent knows no bounds,\nBearing Heaven’s Dao, manifesting virtue to transform and engender.\nNaturally bestowing kindness, nurturing and sustaining the people,\nNothing is left undone, nothing is lost—thus is it beneficial and upright.\nDriving away demonic spirits, granting fortune and peace.\nSupreme beyond all, in the Great Lofty Jade Metropolis,\nMay all disasters and obstacles be dispelled, and long life be attained.\n\nWe, your servants, wholeheartedly take refuge and submit to the Western Dui Palace, Great Sage, and the Seven Red Star Lords. We humbly consider that the Seven Qi White Palace occupies the Metal Heaven’s Dui position. Solemnly governing the myriad things, it benefits the people and responds to the seasons; compassionately pitying all beings, it manifests its virtue and aids their transformation. Yet deluded mortals err in many ways, their offenses and faults abound. They rashly offend the numinous powers, unaware of how to repent and give thanks.\n\nThis day, disciple so-and-so, having prepared the solemn jiao sacrifice, first gives thanks to the Perfected Spirits. Reverently following the liturgical forms, we establish the star altar and prepare the incense, flowers, and offerings. With wholehearted devotion we take refuge and submit to the Western Dui Palace, Great Sage, and the Seven Red Star Lords. We humbly pray that You bestow grace and descend with fortune, repel misfortune and dispel calamities. Pitying beings and cherishing life, may all sins and faults be forever erased; receiving blessings and receiving kindness, may abundant good fortune be conferred. May our kin be wholly at peace, and our gates know celebration.\n\nBowing in reverence, we take refuge and devoutly intone:\nO Void and Luminous Tranquility, whose root is the Dao,\nSupreme beyond all, Purple Tenuity Emperor Lord.\nWithin the true resides the numinous, the Mystic Canon’s Orthodox Spirits.\nThe vast net of the cosmos, each has its allotted part.\nManifesting majestic commands, governing the human body,\nGreat names from beginning to end, Supreme August Perfected Ones.\nSupreme beyond all, in the Great Lofty Jade Metropolis,\nMay all disasters and obstacles be dispelled, and the Dao’s qi long endure.\n\nWe, your servants, wholeheartedly take refuge and submit to the Northwest Qian Palace, Great Sage, and the Six White Star Lords. We humbly consider that Your merit pervades the Four Seas, Your righteousness presides over the Three Bonds. You emerge from the myriad things as their lord, appear among the host of dragons as their chief. It is precisely because You are firm, strong, centered, and upright that You can preserve and harmonize the Great Peace. Enabling all things to fulfill their lives, not a single person fails to receive Your transformation. Yet in dwelling beneath roofs, we fear offending the divine overseers. Without repenting our faults and confessing our transgressions, how could calamities be transformed into blessings?\n\nThis day, disciple so-and-so, having prepared the solemn jiao sacrifice, first gives thanks to the Perfected Spirits. Reverently following the liturgical forms, we establish the star altar and prepare the incense, flowers, and offerings. With wholehearted devotion we take refuge and submit to the Northwest Qian Palace, Great Sage, and the Six White Star Lords. We humbly pray that Heaven’s virtue be vast and magnanimous, and the divine overseers clearly perceive all. May our undertakings be advantageous, our movements free from danger. May disasters and obstacles be wholly dispelled, and fortune and emolument endure together. May descendants flourish, ever partaking of cinnabar cassia’s glory; may our kin be harmonious, jointly preserving the great camphor’s lifespan.\n\nBowing in reverence, we take refuge and devoutly intone:\nO Qian’s ceaseless inception, resplendent and majestic radiance,\nIlluminating all beneath Heaven, nurturing things in timely prosperity.\nOne qi propels the turning, myriad things receive auspicious signs.\nDivine light shakes and subdues, demonic spirits all perish.\nYang essence shines brilliantly, sweeping away calamities.\nThe Most Perfected support and guard, ascending to the Jade Hall.\nMay all disasters and obstacles be dispelled, and the Dao’s qi long endure.\n\nWe, your servants, wholeheartedly take refuge and submit to the Northern Kan Palace, Great Sage, and the One White Star Lord. We humbly consider that Your virtue moistens most broadly, all rivers take You as their source. Your nature contains the Three Powers, Your merit encompasses the Seven Virtues. As a hexagram, You are the destination of the myriad things; as the Dipper, You are the center around which all stars gather. Melting, You become water; congealing, You become ice. You wash away the darkness of the myriad things, cleansing the dust and filth of all beings. Yet in building and dwelling, we offend this direction. Repenting our faults with reverence, we transform calamities into blessings.\n\nToday, so-and-so prepares the solemn jiao rites, first offering gratitude to the true spirits. Reverently following the liturgical forms, we establish the star altar and present the rituals of incense, flowers, and offerings.\n\nWith wholehearted devotion, we take refuge and submit to the Northern Kan Palace Great Sage and the One White Star Lord. Humbly we pray: may Your singular virtue remain profound and limpid, washing away a thousand calamities. May fortune and emolument secure blessings of enduring continuity, and may longevity extend beyond allotted spans. May waters and lands know peace, and all undertakings align with auspiciousness.\n\nWe bow our heads in reverence and chant with sincerity:\nThe Northern Culmen, honored origin of all,\nGreat Sage whose numinous power pervades.\nDeliverance from peril, transcendence of the multitudes—\nWhatever is petitioned, may it be fulfilled in tranquility.\nMay a hundred blessings arise, and ten thousand people be shielded.\nJoy in every life, purity in every generation.\nTrue immortals guide the ascent to the Jade Capital.\nMay all disasters and obstacles be dispelled, and the Dao’s qi long endure.\n\nWith wholehearted devotion, we take refuge and submit to the Northeastern Gen Palace Great Sage and the Eight White Star Lord. Humbly we consider: completing the end and beginning, You subtly enact the work of creation; now halting, now proceeding, You secretly manifest the functions of return and concealment. Governing the alternation of closure and openness, presiding over rise and decline, Your position follows the Three Yangs, and Your palace resides in the Eight White. As construction commences with earth and wood, we fear transgressing this direction. Truly we dread our faults and seek to pray for expiation.\n\nToday, so-and-so prepares the solemn jiao rites, first offering gratitude to the true spirits. Reverently following the liturgical forms, we establish the star altar and present the rituals of incense, flowers, and offerings.\n\nWith wholehearted devotion, we take refuge and submit to the Northeastern Gen Palace Great Sage and the Eight White Star Lord. Humbly we pray: may the Azure Vault’s Most Sage and the Purple Mansion’s Primordial Sovereign widely bestow vast grace upon our gates and courtyards, and extend boundless favor to our clans. May we ever rely upon the shelter of the Dao.\n\nWe bow our heads in reverence and chant with sincerity:\nGreat Sage of the Gen Palace, revered deity of the Azure Emperor,\nFirst to wield authority, from whom the Dao’s qi arises.\nSummoning thunder, summoning rain,\nPreserving goodness, preserving truth.\nUnfolding creation, sweeping away malevolent vapors.\nMay blessings flow ceaselessly, ever accumulating.\nMay the celestial pivot turn without hindrance, ascending to the Jade Capital.\nMay all disasters and obstacles be dispelled, and the Dao’s qi long endure.\n\nWith wholehearted devotion, we take refuge and submit to the Central Palace Great Sage and the Five Yellow Star Lord. Humbly we consider: encompassing and sustaining all beings, Your virtue is fundamentally impartial as the Earth; nurturing and ripening crops, Your benevolence is truly relied upon at the center. Among the Five Affairs, You are kindness; among the Five Constants, You are fidelity. Thus You embrace the myriad forms and foster all life. In all construction and dwelling, how could we avoid offense?\n\nToday, so-and-so prepares the solemn jiao rites, first offering gratitude to the true spirits. Reverently following the liturgical forms, we establish the star altar and present the rituals of incense, flowers, and offerings.\n\nWith wholehearted devotion, we take refuge and submit to the Central Palace Great Sage and the Five Yellow Star Lord. Humbly we pray: may the Most True of the Nine Ramparts, Sovereign of the Central Palace, descend goodness and auspiciousness, turning fortune within the Eight Directions; dispel disasters and hardships, leaving grace throughout the Nine Regions. May fields and silkworms flourish, and fire and theft be averted.\n\nWe bow our heads in reverence and chant with sincerity:\nVirtue resides at the center, governing the Four Quarters,\nUpholding the myriad forms without transgressing the cosmic order.\nRewarding good and punishing evil, Your decrees are inscribed on jade tablets.\nBurying demonic thieves, shattering their blades.\nBoundless deliverance across the ages, Your name resounds in the azure heavens.\nWe offer reverence and honor, sweeping away misfortune.\nMay all disasters and obstacles be dispelled, and the Dao’s qi long endure.\n\nRecitation of scriptures—hitherto—dedication.\nThe Earth Controller’s Lamp Rite is concluded.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "土司灯仪 经名：土司灯仪。 一卷。 底本出处：《正统道藏》洞真部威仪类。 土司灯仪 法事如式 伏闻一元初判、二炁攸分，斡四序以成功，奠八方而定位。 仰布经躔之次，俯均分野之私。 有生咸赖於洪钧，无物不资於大造。 惟人之贵，实位乎中。 凡居起处之间，悉荷乾坤之赐。 重嗟庸昧，动积过愆。 自离穴处以巢居，作於上楝而下宇。 凿泉运土，肆兴作犯於方隅； 架栱飞梁，每有悞干於禁忌，或日时之不利，适年月之未宜。 谋非龟筮之徒，辞用师巫之娇。 较於幽显，尽属愆尤。 而况太岁尊神，土司禁忌，总权祸福，经制方隅，随六甲以迁移，属七星而斡运。 凡居造作，致犯方隅，赖其教有金科，经存玉轴。 昧之者，灾兴吉散； 修之者，祸灭福生。 以今某人爰於住舍，造作不时。 动土役工，实有俟干於禁忌； 培基辟址，宁无冒犯於天星。 谨择良辰，恭修净供。 经开云篆，祈积衅以潜消； 科演琅函，迎众真之来格。 伏望为祥为瑞，集百福於门阑； 无害无灾，殄千殃於眷属。 祛除寇盗，悉灭火殃。 稽首归依，虔诚赞咏。 臣众等志心归命，东方震宫大圣、三绿星君。 伏闻震乃三阳之首，位居四序之端。 在八卦，以为先； 处六甲，而为长。",
      "translated_text": "**The Tusi Lantern Rites**\n*Sutra Title:* The Tusi Lantern Rites. One fascicle.\n*Source Text:* *Daoist Canon of the Zhengtong Era*, Dongzhen Section, Category of Dignified Observances.\n\n---\n\nThe Tusi Lantern Rites proceed according to ritual form.\n\nWe have heard that when the Primordial Unity first divided and the Two Qi were apportioned, the Four Seasons were set in motion to achieve completion, and the Eight Directions were established to fix their positions. Above, the celestial mansions were arrayed in their courses; below, the terrestrial divisions were evenly distributed. All living beings depend upon the Great Potter’s Wheel, and no creature fails to draw upon the bounty of the Great Creation. Of all beings, humans are the most noble, for they occupy the central position. In all their dwellings and movements, they receive the gifts of Heaven and Earth.\n\nYet how grievous is our ignorance, for we constantly accumulate transgressions! Since abandoning cave-dwelling for nest-like abodes, constructing upper beams and lower eaves, we have dug wells and moved earth, recklessly violating the boundaries of the cardinal directions. We have raised brackets and soaring beams, repeatedly trespassing against taboos—sometimes choosing inauspicious days or months, or acting when the year is unpropitious. Our plans are not guided by tortoise-shell divination or milfoil, nor do we employ the words of shamans or mediums. Whether in the hidden or manifest realms, all such acts are fraught with error.\n\nHow much more so when it comes to the august deities of the Great Year and the Tusi prohibitions! They govern fortune and misfortune, regulate the boundaries of the directions, shift with the Six Jia cycles, and are governed by the revolutions of the Seven Stars. For all construction and dwelling, if one violates the boundaries of the directions, one relies upon the golden statutes of their teachings and the jade scrolls of their scriptures. Those who disregard them invite disaster and scatter blessings; those who observe them dissolve calamity and engender fortune.\n\nNow, so-and-so, in constructing a dwelling, has acted untimely. In breaking ground and mobilizing labor, they have surely transgressed against the prohibitions; in raising foundations and clearing sites, they have surely offended the celestial stars. We have therefore chosen an auspicious day and reverently prepared pure offerings. The scriptures are unsealed, their cloud-seal characters recited to silently dissolve accumulated offenses; the ritual codes are chanted from their jade cases to summon the host of perfected beings. We humbly pray that they bring auspicious omens and assemble a hundred blessings at the gate; that they avert harm and disaster, eradicating a thousand misfortunes from the household. May bandits and thieves be dispelled, and all fire calamities extinguished.\n\nWith bowed heads, we take refuge and reverently offer praise.\n\nWe, your servants, wholeheartedly take refuge and submit to the Great Sage of the Eastern Zhen Palace and the Three Green Star Lords.\n\nWe have heard that Zhen is the chief of the Three Yangs, occupying the first position among the Four Seasons. In the Eight Trigrams, it takes precedence; among the Six Jia, it is the eldest.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 478,
      "start_sentence": 0,
      "end_sentence": 34,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.91381025314331,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\土司灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "能甲能拆，令庶物之蕃鲜； 以惧以兢，使兆民而修省。 资兴造化，垂象发生。 凡有修营，虑多触犯。 以今某人备严醮典，首谢真灵，谨依科式，建立星坛，备香花供养之仪。 至心归命，东方震宫大圣、三绿星君。 伏愿真仙降佑，众圣垂慈，蠲消作犯之愆尤，曲赐休祥之庆瑞。 门庭肃穆，长幼谐和，祈寿算以弥昌，增福基而永固。 稽首归依，虔诚赞咏： 大道着明，寂默玄真。 五斗中运，五行生成。 北都万鬼，遏人年龄。 我有神章，度世长存。 供养尊礼，主人精神。 玄之又玄，嵯峨玉京。 消除灾障，道炁长存。 臣众等志心归命，束南方巽宫、四碧星君。 伏以巽为申命，太乙司神，位处东南，宫居四碧。 主群萌之节序，致万物之洁齐。 凡有修营，岂无干犯。",
      "translated_text": "Capable of initiating and unfolding, it commands the flourishing freshness of all things; through awe and vigilance, it urges the myriad people to cultivate introspection. It aids the workings of creation, manifesting the signs of generation. In all undertakings of construction or renovation, one must fear transgression.\n\nToday, so-and-so, having prepared the solemn offerings of the jiao ritual, first offers gratitude to the perfected spirits. Carefully following the ritual codes, a star altar is established, complete with the rites of incense and floral offerings. With utmost sincerity, we take refuge and submit to the Great Sage of the Eastern Zhen Palace and the Three Green Star Lords.\n\nWe humbly pray that the perfected immortals descend with their blessings, and the host of sages extend their compassion, absolving and dissolving the faults of our transgressions, and graciously bestowing the blessings of auspicious omens. May the household be solemn and harmonious, with elders and youth in accord; may we pray for longevity to flourish ever more, and the foundation of fortune to be eternally secure.\n\nWith bowed heads, we take refuge and reverently offer praise:\n\nThe Great Dao shines brightly, profound and silent in its mysterious perfection.\nThe Five Dipper governs the central motion, the Five Phases give rise to all things.\nThe Northern Capital of myriad ghosts curtails human lifespan.\nYet we possess divine scriptures to transcend the world and endure forever.\nWe offer reverent worship, and the master’s spirit is invigorated.\nMysterious beyond mystery, towering is the Jade Capital.\nDisasters and obstacles are dispelled, and the Dao’s qi endures forever.\n\nWe, your servants, wholeheartedly take refuge and submit to the Great Sage of the Southeastern Xun Palace and the Four Green Star Lords.\n\nWe have heard that Xun governs the issuing of commands, with Taiyi presiding over the spirits. Its position lies in the southeast, its palace in the fourth green. It oversees the seasonal order of all sprouting life, bringing purity and order to the myriad things. In all undertakings of construction or renovation, how could one avoid offense?",
      "overlap_context": "nd misfortunes from the household. May bandits and thieves be dispelled, and all fire calamities extinguished.\n\nWith bowed heads, we take refuge and reverently offer praise.\n\nWe, your servants, wholeheartedly take refuge and submit to the Great Sage of the Eastern Zhen Palace and the Three Green Star Lords.\n\nWe have heard that Zhen is the chief of the Three Yangs, occupying the first position among the Four Seasons. In the Eight Trigrams, it takes precedence; among the Six Jia, it is the eldest.",
      "start_char": 478,
      "end_char": 777,
      "start_sentence": 35,
      "end_sentence": 54,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.663352727890015,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\土司灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "以今某人备严醮典，首谢真灵，谨依科式，建立星坛，备香花供养之仪。 志心归命，东南方巽宫、四碧星君。 伏愿神光烛昧，惠炬舒明，鉴今辰祈祷之诚，涤往日修营之过。 寇攘之害，永息於家庭； 焚燎之忧，不生於户牖。 门中眷属，普锡纯禧。 凡所施为，吉无不利。 稽首归依，虔诚赞咏： 巽宫大圣，真宰诸司。 天罡太一，雷电百神。 吹飙厄祸，镇灭妖精。 施行造化，滋育含生。 绵绵锡祉，永永来臻。 无极无上，金阙玉京。 消诸灾障，愿得长生。 臣众等志心归命，南方离宫、九紫星君。 伏以化成天下，罔非中正之功； 揭照多方，固得继明之象。 使万物之相见，以位处於南方。 应在两仪之中，俱被照临之德。 凡居住舍，违犯过多。",
      "translated_text": "Now, so-and-so prepares the solemn jiao rites, first offering gratitude to the true spirits. Diligently following the liturgical forms, we establish the star altar and arrange the rites of incense, flowers, and offerings.\n\nWith wholehearted devotion, we take refuge and submit to the Southeastern Xun Palace and the Four Green Star Lords. We humbly pray that the divine radiance may illumine the obscure, and the torch of grace extend its brightness, beholding the sincerity of this day’s supplication and cleansing the transgressions of past constructions. May the harms of banditry and plunder forever cease within the household; may the anxieties of fire and conflagration never arise at door or window. May all kin within the gates universally receive pure blessings. In all undertakings, may there be unbroken auspiciousness.\n\nWe bow our heads in reverence and offer devout praise:\nGreat Sage of the Xun Palace, true sovereign of all offices,\nCelestial Pivot and Taiyi, thunder and lightning spirits,\nWho blow away calamities and suppress demonic forces,\nWho enact the transformations of creation and nourish all living things.\nMay boundless blessings be bestowed, ever drawing near.\nWithout limit or peer, in the Golden Towers and Jade Capital,\nMay all disasters and obstacles be dispelled, and long life be attained.\n\nWe, your servants, wholeheartedly take refuge and submit to the Southern Li Palace and the Nine Purple Star Lords.\n\nWe humbly consider that in the transformation and completion of the world, there is no achievement unowed to the power of central rectitude. Raising its luminous beacon to illumine all directions, it fittingly inherits the image of enduring brightness. Enabling the mutual perception of the myriad things, it takes its position in the south. Corresponding to the center of the Two Modes, all are encompassed by its illuminating virtue. For all who dwell in houses, transgressions are manifold.",
      "overlap_context": "endures forever.\n\nWe, your servants, wholeheartedly take refuge and submit to the Great Sage of the Southeastern Xun Palace and the Four Green Star Lords.\n\nWe have heard that Xun governs the issuing of commands, with Taiyi presiding over the spirits. Its position lies in the southeast, its palace in the fourth green. It oversees the seasonal order of all sprouting life, bringing purity and order to the myriad things. In all undertakings of construction or renovation, how could one avoid offense?",
      "start_char": 777,
      "end_char": 1066,
      "start_sentence": 55,
      "end_sentence": 75,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.215088367462158,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\土司灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "今辰祝灯，弟子某人备严醮典，首谢真灵，谨依科式，建立坛场，备香花供养之仪。 志心归命，南方离宫、九紫星君。 伏愿鉴兹丹悃，特降仙仪，消除不测之灾，赐以无穷之祉。 九横不临於眷属，千祥茂集於门阑。 火盗潜消，货财增益。 稽首归依，虔诚赞咏： 荧惑大圣，九紫星君。 炎光散世，符咒普臻。 柳星经制，翼轸司存。 丙丁枢籍，火德潜奔。 留恩降福，善庆来并。 上极无上，玄都玉京。 消除灾障，愿得长生。 臣众等志心归命，西南方坤宫、二炁星君。 伏以斡运坤宫，恢弘地道，承天效法，含物化光。 秉后德，而载物无疆； 体四时，而孳生不已。 宫当二黑，位次西南。 凡有修营，岂无干犯。 以今某人备严醮典，首谢真灵，谨依科式，建立坛场，备香花供养之仪。 志心归命，西南方坤宫、二黑星君。 伏愿广惠仁慈，普施阴德。 削愆尤於黑簿，注福寿於丹书。 永消坎坷之灾，常履平康之庆。 千真护佑，万圣扶持。 稽首归依，虔诚赞咏： 坤元后德，弘降无垠。 承天行道，显德化生。 自然恩惠，育养人民。 无遗无坠，乃利乃贞。 驱除妖魅，赐福安宁。 上极无上，大罗玉京。 消除灾障，愿得长生。 臣众等志心归命，西方兑宫大圣、七赤星君。 伏以七炁素宫，金天兑位。 肃严万物，利其民而应其时； 悲愍群生，显其德而助其化。 凡夫迷谬，过咎惟多。 冒犯威灵，岂知忏谢。 以今某人备严醮典，首谢真灵，谨依科式，建立星坛，备香花供养之仪。 志心归命，西方兑宫大圣、七赤星君。 伏愿留恩降福，却祸除灾。 悯物好生，冀永消於罪咎； 承休蒙惠，锡蕃衍於祺祥。 眷属咸宁，门阑有庆。 稽首归依，虔诚赞咏： 虚明冲寂，以道为根。 上极无上，紫微帝君。 真中有灵，玄经正神。 森罗大纬，各有紏分。 昭明威令，总领人身。 巨名终始，太皇高真。 无上之上，大罗玉京。 消除灾障，道炁长存。 臣众等志心归命，西北方乾宫大圣、六白星君。 伏以功全四海，义主三纲。 出庶物以为君，见群龙而为首。 盖以刚健中正，故能保合太和。 使万物各遂其生，无一夫不被其化。 爰居住宇，虑犯神司，非悔过以陈愆，曷变灾而为福。 以今某人备严醮典，首谢真灵，谨依科式，建立星坛，备香花供养之仪。 志心归命，西北方乾宫大圣、六白星君。 伏愿天德宽洪，神司洞照。 行藏有利，动止无危。 灾与障而俱消，福与禄而共永。 子孙蕃衍，常沾丹桂之荣； 眷属雍和，同保大椿之算。 稽首归依，虔诚赞咏： 乾乾始兆，赫赫威光。 洞照天下，育物时康。 一炁推运，万物祯祥。 神光震摄，妖孽俱亡。 阳精明曜，扫荡灾殃。 至真扶卫，上升玉堂。 消除灾障，道炁长存。 臣众等志心归命，北方坎宫大圣、一白星君。 伏以德润至广，百川所宗。 性蕴三能，功涵七善。 其为卦也，万物之所归； 其为斗也，众星之所拱。 泮而为水，疑而为冰，濯万物之昏蒙，涤群生之尘垢。 凡兴住宇，冒犯斯方。 悔过虔恭，变灾为福。",
      "translated_text": "This day’s lamp-offering rite, disciple so-and-so, having prepared the solemn jiao sacrifice, first gives thanks to the Perfected Spirits. Reverently following the liturgical forms, we establish the altar precinct and prepare the incense, flowers, and offerings.\n\nWith wholehearted devotion we take refuge and submit to the Southern Li Palace and the Nine Purple Star Lords. We humbly pray that You deign to regard our sincere devotion, specially descend with Your numinous presence, dispel unforeseen calamities, and bestow boundless blessings. May the Nine Transverse Misfortunes never befall our kin, and may a thousand auspicious signs flourish at our gates. Fire and theft shall vanish in secret, while wealth and property increase. Bowing in reverence, we take refuge and devoutly intone:\n\nO Radiant Brilliance, Great Sage, Nine Purple Star Lords,\nWhose fiery light scatters through the world, whose talismanic spells universally arrive.\nThe Willow Star governs, the Wings and Chariot constellations preside.\nThe bing-ding registers pivot, the Fire virtue courses in secret.\nBestow grace, descend with fortune—may good blessings converge.\nSupreme beyond all, in the Mystic Capital and Jade Metropolis,\nMay all disasters and obstacles be dispelled, and long life be attained.\n\nWe, your servants, wholeheartedly take refuge and submit to the Southwest Kun Palace and the Two Qi Star Lords. We humbly consider that in revolving the Kun Palace, the Earth’s Dao is magnified. Bearing Heaven’s model, it embraces all things and transforms them with light. Holding the Empress’s virtue, it bears all beings without limit; embodying the four seasons, it ceaselessly engenders life. Its palace corresponds to the Two Black Stars, its position lies in the southwest. In all construction and dwelling, how could there be no offenses?\n\nThis day, disciple so-and-so, having prepared the solemn jiao sacrifice, first gives thanks to the Perfected Spirits. Reverently following the liturgical forms, we establish the altar precinct and prepare the incense, flowers, and offerings. With wholehearted devotion we take refuge and submit to the Southwest Kun Palace and the Two Black Star Lords. We humbly pray that Your vast kindness and compassion universally extend as hidden virtue. May transgressions be erased from the Black Register, and blessings and longevity inscribed in the Vermilion Record. May all rough misfortunes be forever dispelled, and constant peace and prosperity be our lot. May a thousand Perfected Ones protect us, and ten thousand Sages sustain us.\n\nBowing in reverence, we take refuge and devoutly intone:\nO Kun’s Primal Empress Virtue, whose vast descent knows no bounds,\nBearing Heaven’s Dao, manifesting virtue to transform and engender.\nNaturally bestowing kindness, nurturing and sustaining the people,\nNothing is left undone, nothing is lost—thus is it beneficial and upright.\nDriving away demonic spirits, granting fortune and peace.\nSupreme beyond all, in the Great Lofty Jade Metropolis,\nMay all disasters and obstacles be dispelled, and long life be attained.\n\nWe, your servants, wholeheartedly take refuge and submit to the Western Dui Palace, Great Sage, and the Seven Red Star Lords. We humbly consider that the Seven Qi White Palace occupies the Metal Heaven’s Dui position. Solemnly governing the myriad things, it benefits the people and responds to the seasons; compassionately pitying all beings, it manifests its virtue and aids their transformation. Yet deluded mortals err in many ways, their offenses and faults abound. They rashly offend the numinous powers, unaware of how to repent and give thanks.\n\nThis day, disciple so-and-so, having prepared the solemn jiao sacrifice, first gives thanks to the Perfected Spirits. Reverently following the liturgical forms, we establish the star altar and prepare the incense, flowers, and offerings. With wholehearted devotion we take refuge and submit to the Western Dui Palace, Great Sage, and the Seven Red Star Lords. We humbly pray that You bestow grace and descend with fortune, repel misfortune and dispel calamities. Pitying beings and cherishing life, may all sins and faults be forever erased; receiving blessings and receiving kindness, may abundant good fortune be conferred. May our kin be wholly at peace, and our gates know celebration.\n\nBowing in reverence, we take refuge and devoutly intone:\nO Void and Luminous Tranquility, whose root is the Dao,\nSupreme beyond all, Purple Tenuity Emperor Lord.\nWithin the true resides the numinous, the Mystic Canon’s Orthodox Spirits.\nThe vast net of the cosmos, each has its allotted part.\nManifesting majestic commands, governing the human body,\nGreat names from beginning to end, Supreme August Perfected Ones.\nSupreme beyond all, in the Great Lofty Jade Metropolis,\nMay all disasters and obstacles be dispelled, and the Dao’s qi long endure.\n\nWe, your servants, wholeheartedly take refuge and submit to the Northwest Qian Palace, Great Sage, and the Six White Star Lords. We humbly consider that Your merit pervades the Four Seas, Your righteousness presides over the Three Bonds. You emerge from the myriad things as their lord, appear among the host of dragons as their chief. It is precisely because You are firm, strong, centered, and upright that You can preserve and harmonize the Great Peace. Enabling all things to fulfill their lives, not a single person fails to receive Your transformation. Yet in dwelling beneath roofs, we fear offending the divine overseers. Without repenting our faults and confessing our transgressions, how could calamities be transformed into blessings?\n\nThis day, disciple so-and-so, having prepared the solemn jiao sacrifice, first gives thanks to the Perfected Spirits. Reverently following the liturgical forms, we establish the star altar and prepare the incense, flowers, and offerings. With wholehearted devotion we take refuge and submit to the Northwest Qian Palace, Great Sage, and the Six White Star Lords. We humbly pray that Heaven’s virtue be vast and magnanimous, and the divine overseers clearly perceive all. May our undertakings be advantageous, our movements free from danger. May disasters and obstacles be wholly dispelled, and fortune and emolument endure together. May descendants flourish, ever partaking of cinnabar cassia’s glory; may our kin be harmonious, jointly preserving the great camphor’s lifespan.\n\nBowing in reverence, we take refuge and devoutly intone:\nO Qian’s ceaseless inception, resplendent and majestic radiance,\nIlluminating all beneath Heaven, nurturing things in timely prosperity.\nOne qi propels the turning, myriad things receive auspicious signs.\nDivine light shakes and subdues, demonic spirits all perish.\nYang essence shines brilliantly, sweeping away calamities.\nThe Most Perfected support and guard, ascending to the Jade Hall.\nMay all disasters and obstacles be dispelled, and the Dao’s qi long endure.\n\nWe, your servants, wholeheartedly take refuge and submit to the Northern Kan Palace, Great Sage, and the One White Star Lord. We humbly consider that Your virtue moistens most broadly, all rivers take You as their source. Your nature contains the Three Powers, Your merit encompasses the Seven Virtues. As a hexagram, You are the destination of the myriad things; as the Dipper, You are the center around which all stars gather. Melting, You become water; congealing, You become ice. You wash away the darkness of the myriad things, cleansing the dust and filth of all beings. Yet in building and dwelling, we offend this direction. Repenting our faults with reverence, we transform calamities into blessings.",
      "overlap_context": "ords.\n\nWe humbly consider that in the transformation and completion of the world, there is no achievement unowed to the power of central rectitude. Raising its luminous beacon to illumine all directions, it fittingly inherits the image of enduring brightness. Enabling the mutual perception of the myriad things, it takes its position in the south. Corresponding to the center of the Two Modes, all are encompassed by its illuminating virtue. For all who dwell in houses, transgressions are manifold.",
      "start_char": 1066,
      "end_char": 2207,
      "start_sentence": 76,
      "end_sentence": 158,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.53850078582764,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\土司灯仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "以今某人备严醮典，首谢真灵，谨依科式，建立星坛，备香花供养之仪。 志心归命，北方坎宫大圣、一白星君。 伏愿一德渊澄，千殃洗荡。 福禄保绵长之祉，寿龄增延永之期。 水陆安宁，行藏叶吉。 稽首归依，虔诚赞咏： 北辰宗极，大圣通灵。 济度厄难，超出群生。 若有所告，修奉安宁。 咸生百福，卫护万民。 生生快乐，世世心清。 真仙保举，上升玉京。 消除灾障，道炁长存。 臣众等志心归命，东北方艮宫大圣、八白星君。 伏以成终成始，潜施造化之功； 时止时行，密显归藏之用。 司权否泰，主掌兴衰，位次三阳，宫居八白。 工既兴於土木，咎恐犯於方隅。 实虑过愆，用祈禳谢。 以今某人备严醮典，首谢真灵，谨依科式，建立星坛，备香花供养之仪。 志心归命，东北方艮宫大圣、八白星君。 伏愿碧穹至圣，紫府元君，洪恩广布於门庭，巨泽遍施於宗族。 更承道荫，永赖帡幪。 稽首归依，虔诚赞咏： 艮宫大圣，青帝尊神。 首权威柄，道炁发生。 兴雷兴雨，存善存真。 舒扬造化，涤荡妖氛。 绵绵景福，永永骈臻。 璇玑无碍，上升玉京。 消除灾障，道炁长存。 臣众等志心归命，中宫大圣、五黄星君。 伏以覆载含灵，德素冲於后土； 生成稼穑，仁实仰於中央。 在五事，则为恩； 於五常，则为信。 故能包含万象，长育群生，凡有修营，岂无干犯。 以今某人备严醮典，首谢真灵，谨依科式，建立星坛，备香花供养之仪。 志心归命，中官大圣、五黄星君。 伏愿九垒至真，中宫主宰。 降善降祥，回吉於八方之内； 消灾消难，留恩於九域之中。 茂育田蚕，祛除火盗。 稽首归依，虔诚赞咏： 惟德中央，总领四方。 提摄万象，罔越纪纲。 赏善罚恶，琅函玉章。 埋藏鬼贼，摧斩锋芒。 度世无量，名昭彼苍。 供养尊礼，扫除不祥。 消除灾障，道炁长存。 讽经　向来　回向 土司灯仪竟",
      "translated_text": "Today, so-and-so prepares the solemn jiao rites, first offering gratitude to the true spirits. Reverently following the liturgical forms, we establish the star altar and present the rituals of incense, flowers, and offerings.\n\nWith wholehearted devotion, we take refuge and submit to the Northern Kan Palace Great Sage and the One White Star Lord. Humbly we pray: may Your singular virtue remain profound and limpid, washing away a thousand calamities. May fortune and emolument secure blessings of enduring continuity, and may longevity extend beyond allotted spans. May waters and lands know peace, and all undertakings align with auspiciousness.\n\nWe bow our heads in reverence and chant with sincerity:\nThe Northern Culmen, honored origin of all,\nGreat Sage whose numinous power pervades.\nDeliverance from peril, transcendence of the multitudes—\nWhatever is petitioned, may it be fulfilled in tranquility.\nMay a hundred blessings arise, and ten thousand people be shielded.\nJoy in every life, purity in every generation.\nTrue immortals guide the ascent to the Jade Capital.\nMay all disasters and obstacles be dispelled, and the Dao’s qi long endure.\n\nWith wholehearted devotion, we take refuge and submit to the Northeastern Gen Palace Great Sage and the Eight White Star Lord. Humbly we consider: completing the end and beginning, You subtly enact the work of creation; now halting, now proceeding, You secretly manifest the functions of return and concealment. Governing the alternation of closure and openness, presiding over rise and decline, Your position follows the Three Yangs, and Your palace resides in the Eight White. As construction commences with earth and wood, we fear transgressing this direction. Truly we dread our faults and seek to pray for expiation.\n\nToday, so-and-so prepares the solemn jiao rites, first offering gratitude to the true spirits. Reverently following the liturgical forms, we establish the star altar and present the rituals of incense, flowers, and offerings.\n\nWith wholehearted devotion, we take refuge and submit to the Northeastern Gen Palace Great Sage and the Eight White Star Lord. Humbly we pray: may the Azure Vault’s Most Sage and the Purple Mansion’s Primordial Sovereign widely bestow vast grace upon our gates and courtyards, and extend boundless favor to our clans. May we ever rely upon the shelter of the Dao.\n\nWe bow our heads in reverence and chant with sincerity:\nGreat Sage of the Gen Palace, revered deity of the Azure Emperor,\nFirst to wield authority, from whom the Dao’s qi arises.\nSummoning thunder, summoning rain,\nPreserving goodness, preserving truth.\nUnfolding creation, sweeping away malevolent vapors.\nMay blessings flow ceaselessly, ever accumulating.\nMay the celestial pivot turn without hindrance, ascending to the Jade Capital.\nMay all disasters and obstacles be dispelled, and the Dao’s qi long endure.\n\nWith wholehearted devotion, we take refuge and submit to the Central Palace Great Sage and the Five Yellow Star Lord. Humbly we consider: encompassing and sustaining all beings, Your virtue is fundamentally impartial as the Earth; nurturing and ripening crops, Your benevolence is truly relied upon at the center. Among the Five Affairs, You are kindness; among the Five Constants, You are fidelity. Thus You embrace the myriad forms and foster all life. In all construction and dwelling, how could we avoid offense?\n\nToday, so-and-so prepares the solemn jiao rites, first offering gratitude to the true spirits. Reverently following the liturgical forms, we establish the star altar and present the rituals of incense, flowers, and offerings.\n\nWith wholehearted devotion, we take refuge and submit to the Central Palace Great Sage and the Five Yellow Star Lord. Humbly we pray: may the Most True of the Nine Ramparts, Sovereign of the Central Palace, descend goodness and auspiciousness, turning fortune within the Eight Directions; dispel disasters and hardships, leaving grace throughout the Nine Regions. May fields and silkworms flourish, and fire and theft be averted.\n\nWe bow our heads in reverence and chant with sincerity:\nVirtue resides at the center, governing the Four Quarters,\nUpholding the myriad forms without transgressing the cosmic order.\nRewarding good and punishing evil, Your decrees are inscribed on jade tablets.\nBurying demonic thieves, shattering their blades.\nBoundless deliverance across the ages, Your name resounds in the azure heavens.\nWe offer reverence and honor, sweeping away misfortune.\nMay all disasters and obstacles be dispelled, and the Dao’s qi long endure.\n\nRecitation of scriptures—hitherto—dedication.\nThe Earth Controller’s Lamp Rite is concluded.",
      "overlap_context": "heir source. Your nature contains the Three Powers, Your merit encompasses the Seven Virtues. As a hexagram, You are the destination of the myriad things; as the Dipper, You are the center around which all stars gather. Melting, You become water; congealing, You become ice. You wash away the darkness of the myriad things, cleansing the dust and filth of all beings. Yet in building and dwelling, we offend this direction. Repenting our faults with reverence, we transform calamities into blessings.",
      "start_char": 2207,
      "end_char": 2931,
      "start_sentence": 159,
      "end_sentence": 211,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.378332376480103,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\土司灯仪.txt",
        "category": "威仪类"
      }
    }
  ]
}