{
  "source_id": "地府十王拔度仪",
  "source_file": "chunked_daozang\\地府十王拔度仪.json",
  "total_chunks": 4,
  "total_original_chars": 3900,
  "total_translated_chars": 23879,
  "total_translation_time": 113.75098538398743,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\威仪类\\地府十王拔度仪.txt",
    "category": "威仪类"
  },
  "full_translation": "*The Rite of the Ten Kings of Earth Prison for Deliverance*\n*Sutra Title:* *The Rite of the Ten Kings of Earth Prison for Deliverance*. One fascicle.\n*Source Text:* *Zhengtong Daoist Canon*, *Dongzhen* Section, *Weiyi* Category.\n\n**The Rite of the Ten Kings of Earth Prison for Deliverance**\n**Dharma Service**\n\nTo all boundless sages we make universal offering,\nIncense smoke ascends to the Great Web of Heaven.\nTo all immeasurable sages of the heavens,\nTo sun, moon, Dipper, and stars,\nTo the ancestral masters of scriptures and registers,\nTo the high perfected of the Celestial Courts—\nMay you bestow the power of great compassion,\nTo deliver this departed spirit.\n*And inconceivable merit and virtue.*\n\nTo all boundless sages we make universal offering,\nIncense smoke pierces the gates of darkness.\nTo the Fengdu and Mount Tai bureaus,\nTo the offices that examine and judge sinful souls,\nTo the dark prisons filling every hell,\nTo the mighty spirits of Earth Prison—\nMay you bestow the power of great compassion,\nTo deliver this departed spirit.\n*And inconceivable merit and virtue.*\n\nTo all boundless sages we make universal offering,\nIncense smoke pervades Fusang.\nTo the rivers, Yangtze, Huai, and seas,\nTo thunder, lightning, rain, and dragon deities,\nTo the valleys of the Ten Continents and Three Isles,\nTo the immortals of the Water Palaces—\nMay you bestow the power of great compassion,\nTo deliver this departed spirit.\n*And inconceivable merit and virtue.*\n\n**Invocation of the Sages**\n**Proceeding to the Ritual Procedures**\n\nProstrate, we observe: Heaven towers above, Earth lies below, arraying all beings in manifest clarity; sun departs, moon arrives, completing the cyclic succession of the four seasons. What is born must perish, what has no beginning knows no end. Beholding how mountains and marshes cannot conceal, we know the form’s fate cannot be escaped. August Heaven watches, Creation is impartial. Though in life there be distinctions of noble and base, in death there is no disparity of high or low.\n\nA human lifetime is but an illusion, unsubstantial; the bodily frame is a temporary convergence, forcibly assembled into four limbs. It resembles a spring dream upon the pillow, a spark within the stone; like a fierce wind extinguishing the candle, a bubble floating upon the water. Transformation and dissolution occur in the space of a moment, formation and decay in the blink of an instant. The form returns to Earth, the po-soul retreats to the hidden realms.\n\nOnly the Perfected One transcends the wondrous beyond, walking above the myriad multitudes, seated amidst the throngs of ancients. Though a thousand years pass, upon return he sighs that the city walls remain the same; in a single instant of sudden awakening, even the cosmos cannot contain him. Yet without self-realization, the same fate is inescapable—all alike return to dust.\n\nNow, the officiant [Name] prostrates on behalf of the deceased [Name], fearing that during their time in the world, their body bore boundless transgressions. They take refuge in the true teaching, grandly opening the jade scriptures. Reverently facing the Perfected Ones, they extol the sacred names:\n\n**Great Sage Three Treasures Heavenly Worthy**\n\nAt that time, the Heavenly Worthy of Primordial Beginning was in the Jade Capital of the Western Na Country, upon the secluded Mount Yu-jue, within the Golden Hall of the Palace of Eternal Joy. Together with the Most High Dao Lord, he expounded the *Scripture of the Worlds of the Living and the Dead*, detailing the ten great hells, the karmic conditions of sin and merit, the ceaseless retributions. The Wondrous Practice Perfected One, receiving this radiant illumination, descended into the Nine Dark Realms to universally deliver the departed spirits, enabling all to attain transcendence.\n\nThrough this repentance, we proclaim this virtuous affinity. Each awakens sincere devotion, joining voices in praise and recitation:\n\n**We sincerely venerate the Most High Great Luo Heaven, the Three Clarities, the Three Realms, the Three Treasures Heavenly Worthy.**\n\nThe sacred names of the Three Worthies possess boundless merit and virtue, capable of delivering the departed, capable of protecting those presently living. For the deceased [Name], we now perform posthumous rites for the path of darkness, that they may swiftly achieve transcendence.\n\nFirst, we invite the Fivefold Dark Fragrance to offer to the Three Clarities and Supreme Saints, that they descend into the ritual arena. Next, we invite the Great Virtue Dharma Master to conduct the ritual proceedings, relying upon the assembly of the Dharma to join in unison, extolling the inconceivable:\n\n**Dao incense, virtue incense, non-action incense, liberation incense, the naturally subtle incense of rebirth.**\n\nThe incense wafts gently, tinkling like jade pendants; only the Dharma Master’s voice of praise is heard. As the treasure repository opens, Heaven and Earth grow still—soon, wondrous light arises. One stick of dark incense is kindled to summon the soul’s return, offered aloft to the Jade Morning Worthy. May you bestow the power of great compassion without hindrance, enabling the departed to swiftly attain transcendence.\n*And inconceivable merit and virtue.*\n\nBurning incense, we reverently invoke the King within the Dharma, the Sage Lord of the Qingwei Heaven:\n**Who generates Heaven, Earth, and all beings—**\n**The Most High Jade Clarity, Primordial Beginning Worthy.**\n*And inconceivable merit and virtue.*\n\nBurning incense, we reverently invoke the King within the Dharma, the Teaching Lord of the Yuyu Heaven:\n**Who transmits scriptures, teachings, and the myriad Dharmas—**\n**The Most High Jade Morning, Great Dao Lord.**\n*And inconceivable merit and virtue.*\n\nBurning incense, we reverently invoke the King within the Dharma, the Transformation Lord of the Taichi Heaven:\n**Who fashions the Three Powers and moves the Five Phases—**\n**The Most High Five Spirits, Mysterious Elder Lord.**\n*And inconceivable merit and virtue.*\n\nAt that time, the Heavenly Worthy of Primordial Beginning addressed the Wondrous Practice Perfected One, saying: Beyond the Northern Dark Sea, a hundred thousand *li* distant, there is a world called Dongyin. Within the country of Shuodan Yujue, there is an Imperial Lord named Five Spirits Mysterious Elder Black Emperor Heavenly Lord, who governs the boundless host of sages of the Northern Realm.\n\nThere is a great mountain called Fengdu, which reaches upward to the Terrace of Langfeng, spanning over fifty thousand *li* in circumference. Below, there are six caverns known as the Dark Scenery Heavenly Palaces, which are the domains of the Great Dark Water Emperor, the Northern Dark Heavenly Lord, and the Fengdu Great Emperor. The Direct Envoys of the Heavens, the Spirit Lords of the Five Dippers—Eastern Dipper Lord of Life Qi, Southern Dipper Controller of Prohibitions, Western Dipper Lord of Life Forms, Northern Dipper Controller of Destiny, Central Dipper General Recorder—along with the Earth Masters of the Nine Harmonies and the Great Gods of the Five Peaks serve as their subordinates, assisting in the governance of the Ten Perfected Lords.\n\nThe various great hells examine and weigh good and evil, interrogating and tormenting the souls. All the deceased must pass through them.\n\nAt that moment, among the assembly was a Perfected One named Wondrous Practice, who gazed upon the Heavenly Worthy and composed these verses to deliver the departed. Today, we proclaim and expound them to perform this repentance and invocation:\n\n**Great Unity Savior from Suffering Heavenly Worthy**\n\nBurning incense to offer to the Lord of the First Palace of the Dark Realms, the True Lord of Supreme Simplicity and Vast Brilliance—whom the world calls the Great King of Qin Guang. Within its hells, long serpents spew flames, iron dogs exhale smoke. On the seventh day after death, the departed first arrive at this palace.\n\nThe Heavenly Worthy, moved by compassion, delivers the departed souls, guiding them to depart the dark paths. Thus, we recite the gatha in praise:\n\n**Jade Treasure August Heavenly Worthy**\n\nVast and desolate, the sea of suffering is truly lamentable;\nEvil karma clings to the body, sown by one’s own hands.\nSoul and po-soul have returned to the Bureau of Destiny,\nThe dark gates are locked—when will they open?\nLong serpents spew flames, blazing like fire,\nIron dogs exhale smoke, advancing in waves.\nBowing in reverence, we listen to the Three Treasures’ hymns,\nUniversally enabling deliverance from the Yellow Springs.\n*And inconceivable merit and virtue.*\n\nUpon hearing this gatha, the Perfected One rejoiced and leapt for joy, gazing up to thank the Heavenly Worthy, and again recited a gatha in praise:\n\n**Nine Dark Realms Deliverance from Sin Heavenly Worthy**\n\nThe boundless sacred power is inconceivable,\nCompletely releasing the dark prisons’ interrogations.\nA single path of auspicious light comes to receive and guide,\nThe departed spirit follows, ascending to the cinnabar steps.\n*May we dedicate this merit to the departed, that they be reborn in the Land of Ultimate Bliss.*\n\nBurning incense to offer to the Lord of the Second Palace of the Dark Realms, the True Lord of Dark Virtue and Settled Rest—whom the world calls the Great King of Chu Jiang. Within its hells are knife mountains and sword trees, fiery screens and freezing ice. On the fourteenth day after death, the departed must proceed to this palace.\n\nThe Heavenly Worthy, moved by compassion, delivers and guides the departed souls to depart from the dark paths, and so recites a gatha in praise:\n\n**Mystic Truth and Myriad Blessings Heavenly Worthy**\n\nAll beings create the causes of evil,\nWho among them turns their heart to behold the field of blessings?\nSword trees and knife mountains flay the body whole,\nBoiling broth follows searing flames, freely stewing and searing.\nCountless delusions deceive the heart,\nA single thought’s reflection yields only transgressions.\nYou who take refuge in the supreme Dao,\nShall swiftly attain rebirth in the heavens to come.\n\n*May the inconceivable merit be dedicated.*\n\nThereupon, the Perfected One, having heard this gatha, rejoiced greatly, bowed his head to the Heavenly Worthy, and again recited a gatha in praise:\n\n**Ten Directions Salvation from Suffering Heavenly Worthy**\n\nThe long, long night is pitiable and sorrowful,\nAll beings endure unbearable suffering.\nRelying on the compassionate Honored One’s deliverance,\nIn an instant, scorching afflictions transform into cool clarity.\n\n*May we dedicate this merit to the departed, that they be reborn in the Land of Ultimate Bliss.*\n\nBurning incense to offer to the Lord of the Third Palace of the Dark Realms, the True Lord of Pervasive Clarity and Universal Stillness—whom the world calls the Great King of Song Di. Within its hells, souls swallow fire and consume poison, their bodies flayed and dismembered. On the twenty-first day after death, the departed must proceed to this palace.\n\nThe Heavenly Worthy, in great compassion, lest they endure such trials, recites a gatha:\n\n**Supremely Wondrous and Utmost Heavenly Worthy**\n\nIn the ninefold depths of the dark prisons’ roots,\nThrough the long night, only the sounds of bitter suffering are heard.\nThe jailers force you to swallow burning coals,\nWhile ox-headed demons flay and dismember your form.\nThe fruits of past deeds accumulate heavily,\nAfter death, each sorrow and pain is endured in turn.\nToday, hearing the proclamation of the supreme Dao,\nThis body swiftly departs the vast, cold courts.\n\n*May the inconceivable merit be dedicated.*\n\nThereupon, the Perfected One, having heard this gatha, filled with great compassion, extolled the Heavenly Worthy and recited a gatha:\n\n**Cinnabar Mound Life-Delivering Heavenly Worthy**\n\nThe Heavenly Worthy’s teachings are of great compassion,\nAll beings of evil karma are fully liberated.\nFive-colored auspicious light opens the path,\nFrom this day forth, all assemble in the realm of non-action.\n\n*May we dedicate this merit to the departed, that they be reborn in the Land of Ultimate Bliss.*\n\nBurning incense to offer to the Lord of the Fourth Palace, the True Lord of Mystic Virtue and Fivefold Numinosity—whom the world calls the Great King of Wu Guan. Within its hells, souls bear sand and transport stones without rest. On the twenty-eighth day after death, the departed must proceed to this palace.\n\nThe Heavenly Worthy, in boundless compassion, moved to pity, delivers all beings and recites a gatha:\n\n**Mystic Supreme Jade Dawn Heavenly Worthy**\n\nIn the six caves of Fengdu’s vast dark land,\nThe lost and wandering souls are truly pitiable.\nSouls sunk in evil karma descend to the earthly prisons,\nWhile those who perfect virtuous deeds ascend to heaven.\nBearing sand and transporting stones without rest,\nThe surging long river seems like boiling broth.\nAttend to the compassionate words of the supreme teaching,\nNow they enter the hungry belly like sweet dew.\n\n*May the inconceivable merit be dedicated.*\n\nThereupon, the Perfected One, having heard this gatha, bowed his head to the Heavenly Worthy, extolling without end, and again recited a gatha:\n\n**Dharma Bridge Great Deliverance Heavenly Worthy**\n\nThe Heavenly Worthy, in boundless salvation of beings,\nWith white writs and cinnabar records, welcomes them from the hells.\nAll transgressions and faults are completely absolved,\nFrom this day forth, their trials and torments instantly transcend.\n\n*May the inconceivable merit be dedicated.*\n\nBurning incense to offer to the Lord of the Fifth Palace of the Dark Realms, the Most Sacred and Radiant Numinous True Lord—whom the world calls the Great King Yanluo. He is the chief minister of the Northern Darkness Heavenly Lord, the overseer of all great hells, his authority equal to the Nine Dark Realms, his rank aligned with the Five Celestial Ladles. On the thirty-fifth day after death, the departed must proceed to this palace. Here, the Mirror of Karma reveals their form, and retribution follows their deeds.\n\nThe Heavenly Worthy, moved by compassion, universally delivers all beings, and recites a gatha for the deliverance of the departed souls:\n\n**Transcendent Immortal and Supreme Sage Heavenly Worthy**\n\nBeings, deluded, obscure their original cause,\nIn the vast sea of desire, their hearts err and stray.\nGold and jade, though piled like mountains, cannot aid in death,\nAt the final hour, only karma follows the body.\nThe three paths stretch endlessly, without deliverance,\nThrough the long night of darkness, souls are interrogated.\nYet in an instant, all hells are liberated,\nWith a single heart, revere the Great Compassionate Honored One.\n\n*May the inconceivable merit be dedicated.*\n\nThereupon, the Perfected One, having heard this compassion, bowed his head in reverence, addressed the Heavenly Worthy, and again recited a gatha:\n\n**Fire-Refined Cinnabar Realm Heavenly Worthy**\n\nThe obstructions of beings’ karma arise from the heart,\nLiberation depends on boundless causes.\nBowing to the Supreme Dao of the Void Sovereign,\nA single precious gatha surpasses a thousand pieces of gold.\n\n*May we dedicate this merit to the departed, that they be reborn in the Land of Ultimate Bliss.*\n\nBurning incense to offer to the Lord of the Sixth Palace, the True Lord of Precious Solemnity and Illustrious Accomplishment—whom the world calls the Great King of Bian Cheng. Within its hells, tongues are pierced with golden nails, and chests are split open with iron axes. On the forty-second day after death, the departed must proceed to this palace. Day and night, their souls are interrogated, enduring all manner of suffering.\n\nThe Heavenly Worthy, moved by compassion, recites a gatha for all the destitute souls:\n\n**Life-Cherishing Life-Delivering Heavenly Worthy**\n\nKnife mountains and sword trees form forests of iron,\nBeings of evil karma now wail in suffering.\nThe fleeting pleasures of the floating world are like lightning,\nYet in the dark paths, they sink for a thousand kalpas.\nThe retributions of the nether courts allow no concealment,\nTongues torn out and chests split open—pain beyond endurance.\nFor you, I extinguish boundless karma,\nIn the future, bow in gratitude to the Three Clarities.\n\n*May the inconceivable merit be dedicated.*\n\nThereupon, the Perfected One, having heard this gatha, bowed in reverence, addressed the Heavenly Worthy, and again recited a gatha:\n\n**Golden Portal Transformation-Body Heavenly Worthy**\n\nThe Compassionate Honored One, in benevolent deliverance, expounds the causes,\nGuiding beings to board the Dharma boat.\nRefining and transforming this form into a wondrous essence,\nKnow now the sacred power is boundlessly great.\n\n*May we dedicate this merit to the departed, that they be reborn in the Land of Ultimate Bliss.*\n\nBurning incense to offer to the Lord of the Seventh Palace, the True Lord of Mount Tai’s Mystic Wonders—whom the world calls the Great King of Mount Tai. By the Emperor’s decree, he assists in governing the Northern Darkness, residing on the Eastern Peak by day and entering the nether courts by night. On the forty-ninth day after death, the departed must proceed to this palace. Here, the causes of their deeds are examined, and the weight of their sins and virtues is measured.\n\nThe Heavenly Worthy, in deliverance, universally enables their transcendence, and recites a gatha for all beings:\n\n**Supreme Numinous Void Sovereign Heavenly Worthy**\n\nIn the human realm, fortune and misfortune have no fixed gate,\nYou yourselves have planted the roots of good and evil.\n\nWithin the heart, one knows only to harbor filth and defilement,\nA hundred years pass, and one becomes a lonely shade.\nWhere the karmic wind blows, life turns to death,\nTen thousand kalpas of sorrow and bitterness—unbearable to hear.\n\nFor you, I extinguish boundless karmic deeds,\nThat you may come to revere the Great Primordial Lord.\nAnd [perform] inconceivable merits.\n\nThereupon, the Perfected One, hearing this wondrous sound,\nAroused the unsurpassed Dao-mind,\nBowed to the Heavenly Worthy,\nAnd chanted another gatha:\n\n**Heavenly Worthy of Carefree Bliss**\n\nEndless are the prisoners of the Five Sufferings,\nYet the Most High Compassionate Lord lifts them all.\nIn an instant, they are bathed in sweet dew,\nCountless souls emerge from the mire of the dark gates.\n\nAnd [we] pray to deliver this departed spirit to the Land of Ultimate Bliss.\nBurning incense to offer to the Lord of the Eighth Palace, the Supreme Right Deliverance Perfected Lord—\nWhom the world calls the Great King of Equality.\nHere, sinners embrace bronze pillars and lie upon iron beds.\nOnly after a hundred days of death do they arrive at this palace.\nThose with grave karmic offenses are detained in this hell.\n\nThe Heavenly Worthy, in great compassion,\nPities all beings and delivers the sinful souls,\nAnd recites a gatha:\n\n**Heavenly Worthy of Boundless Great Flower**\n\nThe underworld officials wield their brushes in wrathful might,\nTheir interrogations and torments—unbearable to hear.\nA hundred years in the world without a shred of goodness,\nThe departed spirit’s transgressions are like grains of sand.\n\nThe yin barrier does not block the yang realm’s light,\nYet for whom do kin intercede to save them?\nOnly by escaping the dark shackles\nMay one be born to revere the Great Compassionate Lord.\n\nAnd [perform] inconceivable merits.\n\nThereupon, the Perfected One, having heard this gatha,\nBowed in gratitude to the Heavenly Worthy\nAnd chanted another gatha:\n\n**Heavenly Worthy of Wish-Fulfilled Rebirth**\n\nThe Sovereign of the Void turns a single thought toward all beings,\nEven hell hears the sound of the Great Dharma.\nIn an instant, they transcend the Three Realms’ dust,\nForever leaving the dark night’s forest of swords.\n\nAnd [we] pray to deliver this departed spirit to the Land of Ultimate Bliss.\nBurning incense to offer to the Lord of the Ninth Palace, the Flying Demons’ Transformative Perfected Lord—\nWhom the world calls the Great King of the Capital.\nHere, hells abound with saws, cauldrons, and boiling oil,\nA thousand deaths and ten thousand rebirths—unceasing.\n\nOnly after a full year of death do they arrive at this palace.\nThe Heavenly Worthy, in transformation, universally aids all beings,\nGreatly awakening compassion to save and deliver from suffering,\nAnd recites a gatha:\n\n**Heavenly Worthy of Jade Void Luminous Sovereign**\n\nOnce the yin gates close, light is forever lost,\nThe dark and boundless path stretches long.\nHow can word reach the floating world?\nThe Fengdu realm divides yin and yang.\n\nCrimson-clad officials in towering hats preside over the execution grounds,\nOx-headed jailers tend the cauldrons of boiling oil.\nBowing to the Compassionate Lord who comes to save from suffering,\nMay we ride the deliverance to the immortal realm.\n\nAnd [perform] inconceivable merits.\n\nThereupon, the Perfected One, having heard this gatha,\nTrembled with awe and joy, praising without end.\nBowing to the Heavenly Worthy,\nHe chanted another gatha:\n\n**Heavenly Worthy of Merit-Borne Transformation**\n\nThe Heavenly Worthy’s power is inconceivable,\nAll heavenly spirits rely upon it.\nWhite talismans and true decrees descend to hell,\nTheir majestic light guides the souls along the path.\n\nAnd [we] pray to deliver this departed spirit to the Land of Ultimate Bliss.\nBurning incense to offer to the Lord of the Tenth Palace, the Five Spirits’ Majestic Virtue Perfected Lord—\nWhom the world calls the Great King of the Turning Wheel.\nAll sinful souls, after the Great Mourning,\nArrive at this palace.\n\nThe Heavenly Worthy, in compassion, delivers the departed spirits,\nAnd recites a gatha:\n\n**Heavenly Worthy of True Sovereign and Cavern Spirit**\n\nThe Sovereign of the Void expounds the teachings, revealing the true essence,\nUniversally delivering all beings with karmic affinity.\nThose who fulfill their practice ascend to the formless realm,\nThose with deep karmic roots sink into the underworld springs.\n\nCarefree, they feast in the Golden Flower Palace,\nKnowing through kalpas the sight of the field of blessings.\nAll dark souls are liberated,\nShedding the heavy mist to behold the blue sky.\n\nAnd [perform] inconceivable merits.\n\nThereupon, the Perfected One, having heard this gatha,\nPraised without end,\nAnd chanted another gatha:\n\n**Heavenly Worthy of Jeweled Flower Perfection**\n\nThe Heavenly Worthy, in pity, saves the deluded masses,\nThe dark souls of nine nights all emerge.\nDirectly ascending to the Southern Palace, all receive deliverance,\nUniversally gathering to enter the realm of non-action.\n\nAnd [we] pray to deliver this departed spirit to the Land of Ultimate Bliss.\n\nThe Heavenly Worthy declared:\nAll beings, after death, pass through hell,\nTheir souls bound to Fengdu, enduring every torment—\nConstant interrogations, knife mountains, slicing blades,\nBronze pillars, iron beds, scorching flames, and freezing ice,\nUnending suffering and affliction.\n\nNow, for you, I chant the precious gatha,\nRaising boundless sounds that resound through the ten directions,\nTheir voices reaching the nine earths,\nAll interrogations dissolve, and all are liberated.\nThe souls, refined, ascend directly to the Southern Palace,\nKalpa after kalpa, life after life, dwelling forever in bliss.\n\nThe Heavenly Worthy’s gathas and the names of the Ten Kings have been recited,\nThe merit is complete,\nDelivering the departed [Name],\nTo be reborn in the heavenly realm.\n\nWe pray that by this wondrous fruit,\nAll transgressions be absolved,\nSwiftly leaving the dark land,\nDirectly reaching the path of rebirth.\nMay blessings flow to the present,\nBringing joy to the household.\nMay all sentient beings\nTogether ascend the shore of the Dao.\n\nRecitation of sutras, proclamation of petitions, as before—dedicated.\nThe Rite for Deliverance by the Ten Kings of Hell is now complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "地府十王拔度仪 经名：地府十王拔度仪。 一卷。 底本出处：《正统道藏》洞真部威仪类。 地府十王拔度仪 法事 普献无边圣，香烟散大罗。 诸天无量圣，日月斗星辰。 玄师经箓祖，天府众高真。 愿垂大慈力，超度此亡灵。 和不可思议功德。 普献无边圣，香烟透冥关。 酆都岱岳府，考校罪魂司。 幽牢遍诸狱，地府众威灵。 愿垂大慈力，超度此亡灵。 和不可思议功德。 普献无边圣，香烟遍榑桑。 江河淮海济，雷电雨龙神。 十洲三岛谷，水府众仙真。 愿垂大慈力，超度此亡灵。 和不可思议功德。 启圣　入科",
      "translated_text": "*The Rite of the Ten Kings of Earth Prison for Deliverance*\n*Sutra Title:* *The Rite of the Ten Kings of Earth Prison for Deliverance*. One fascicle.\n*Source Text:* *Zhengtong Daoist Canon*, *Dongzhen* Section, *Weiyi* Category.\n\n**The Rite of the Ten Kings of Earth Prison for Deliverance**\n**Dharma Service**\n\nTo all boundless sages we make universal offering,\nIncense smoke ascends to the Great Web of Heaven.\nTo all immeasurable sages of the heavens,\nTo sun, moon, Dipper, and stars,\nTo the ancestral masters of scriptures and registers,\nTo the high perfected of the Celestial Courts—\nMay you bestow the power of great compassion,\nTo deliver this departed spirit.\n*And inconceivable merit and virtue.*\n\nTo all boundless sages we make universal offering,\nIncense smoke pierces the gates of darkness.\nTo the Fengdu and Mount Tai bureaus,\nTo the offices that examine and judge sinful souls,\nTo the dark prisons filling every hell,\nTo the mighty spirits of Earth Prison—\nMay you bestow the power of great compassion,\nTo deliver this departed spirit.\n*And inconceivable merit and virtue.*\n\nTo all boundless sages we make universal offering,\nIncense smoke pervades Fusang.\nTo the rivers, Yangtze, Huai, and seas,\nTo thunder, lightning, rain, and dragon deities,\nTo the valleys of the Ten Continents and Three Isles,\nTo the immortals of the Water Palaces—\nMay you bestow the power of great compassion,\nTo deliver this departed spirit.\n*And inconceivable merit and virtue.*\n\n**Invocation of the Sages**\n**Proceeding to the Ritual Procedures**",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 243,
      "start_sentence": 0,
      "end_sentence": 21,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.722502708435059,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\地府十王拔度仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "伏以天高地下，布品汇以昭彰； 日往月来，成四时之代谢。 有生必尽，无始不终。 睹山泽之难藏，知形数之不免。 皇天有监，造物无私。 生虽贵贱之殊，死无高下之间。 人生一世，幻化非坚，假合形躯，强成四体。 似枕前之春梦，如石中之火光； 似猛风之彻烛，如水上之浮沤。 变灭须臾之间，成坏俄顷之际。 形归於地，魄返诸幽。 惟彼至人，超於妙外。 行乎万人之上，坐阅古人之徒。 千载归来，叹城郭之犹是； 一朝顿悟，虽宇宙之难笼。 苟非自得，其方难免，同归於土。 今斋官某伏为亡过某恐缘在世之时，身有无边之罪，归依真教，大启琅函。 恭对高真，称扬圣号。 大圣三宝天尊 尔时，元始天尊在西那玉国郁绝之山，长乐宫中黄金殿内，与太上道君演教世界众生死经十大地狱，因缘罪福，报对无休，救妙行真人，承此光明，下入九幽，普拔亡灵，悉令超度。 以今忏悔，说此善缘。 各启虔诚，同声赞咏。 信礼无上大罗天三清三境三宝天尊 三尊圣号，功德无边，可以超度亡灵，可以保扶见在。 今亡过某追修冥路，早遂超升。 先请五分冥香，供养三清上圣，降临道场。 次请大德法师，行持法事，仰凭法众，齐声赞叹大不可思议，道香、德香、无为香、解脱香、自然微妙返生香。 香冉冉，佩玲玲，唯闻法师赞叹声。 宝蕴一开天地静，逡巡早见异光生。 一炷冥香爇返魂，望空供养玉晨尊。 愿降大慈无碍力，使令亡者早超升。 和不可思议功德。 焚香仰启法中王，清微天中为圣主。 生天生地生人物，高上玉清元始尊。 和不可思议功德。 焚香仰启法中王，禹余天中为教主。 传经传教传万法，高上玉晨大道君。 和不可思议功德。 焚香仰启法中王，太赤天中为化主。 造化三才运五行，高上五灵玄老君。 和不可思议功德。 尔时，元始天尊告妙行真人曰：北方溟海之外，十万余里，有一世界，名曰洞阴。 朔单郁绝之国中，有一帝君，号曰五灵玄老黑帝天君，统领北乡无鞅圣众。 有一大山，号日酆都山，上接阆风之台，周回五万余里； 下有六洞，谓之曰阴景天宫，即太溟水帝、北阴天君、酆都大帝之所治也。 诸天直使、五斗灵君、东斗生炁君、南斗司禁君、西斗生形君、北斗司命君、中斗总录君，九合土主五岳大神，以为僚属，分司佐治十位真君。 诸大地狱，校量善恶，拷掠魂神。 应是亡殁之人，遍须经诣。 是时，坐中有一真人，名曰妙行，瞻依天尊，作诸是颂，拔度亡人。 今日敷扬，用伸忏念。 太一救苦天尊 焚香供养，冥府第一宫、泰素妙广真君。 世人所谓，秦广大王。 其中地狱，长蛇吐焰，铁狗喷烟。 亡人一七，先到此宫。 天尊哀悯，救度亡魂，出离冥涂，乃称偈赞。 玉宝皇上天尊 茫茫苦海实堪哀，恶业於身手自栽。 魂魄已归司命府，幽关锁闭几时开。 长蛇吐焰炎如火，铁狗喷烟阵阵来。 稽首谛听三宝颂，普令超度出泉台。 和不可思议功德。 尔时，真人闻是颂已，欢喜踊跃，仰谢天尊，再称偈赞。 九幽拔罪天尊 无边圣力不思议，尽释幽牢拷对词。 一道祥光来接引，亡灵随逐上丹墀。 和愿荐此亡灵，往生极乐国。 焚香供养，冥府第二宫、阴德定休真君。 见世名曰，初江大王。 其中地狱，刀山剑树，火翳寒冰，亡人二七，须诣此宫。",
      "translated_text": "Prostrate, we observe: Heaven towers above, Earth lies below, arraying all beings in manifest clarity; sun departs, moon arrives, completing the cyclic succession of the four seasons. What is born must perish, what has no beginning knows no end. Beholding how mountains and marshes cannot conceal, we know the form’s fate cannot be escaped. August Heaven watches, Creation is impartial. Though in life there be distinctions of noble and base, in death there is no disparity of high or low.\n\nA human lifetime is but an illusion, unsubstantial; the bodily frame is a temporary convergence, forcibly assembled into four limbs. It resembles a spring dream upon the pillow, a spark within the stone; like a fierce wind extinguishing the candle, a bubble floating upon the water. Transformation and dissolution occur in the space of a moment, formation and decay in the blink of an instant. The form returns to Earth, the po-soul retreats to the hidden realms.\n\nOnly the Perfected One transcends the wondrous beyond, walking above the myriad multitudes, seated amidst the throngs of ancients. Though a thousand years pass, upon return he sighs that the city walls remain the same; in a single instant of sudden awakening, even the cosmos cannot contain him. Yet without self-realization, the same fate is inescapable—all alike return to dust.\n\nNow, the officiant [Name] prostrates on behalf of the deceased [Name], fearing that during their time in the world, their body bore boundless transgressions. They take refuge in the true teaching, grandly opening the jade scriptures. Reverently facing the Perfected Ones, they extol the sacred names:\n\n**Great Sage Three Treasures Heavenly Worthy**\n\nAt that time, the Heavenly Worthy of Primordial Beginning was in the Jade Capital of the Western Na Country, upon the secluded Mount Yu-jue, within the Golden Hall of the Palace of Eternal Joy. Together with the Most High Dao Lord, he expounded the *Scripture of the Worlds of the Living and the Dead*, detailing the ten great hells, the karmic conditions of sin and merit, the ceaseless retributions. The Wondrous Practice Perfected One, receiving this radiant illumination, descended into the Nine Dark Realms to universally deliver the departed spirits, enabling all to attain transcendence.\n\nThrough this repentance, we proclaim this virtuous affinity. Each awakens sincere devotion, joining voices in praise and recitation:\n\n**We sincerely venerate the Most High Great Luo Heaven, the Three Clarities, the Three Realms, the Three Treasures Heavenly Worthy.**\n\nThe sacred names of the Three Worthies possess boundless merit and virtue, capable of delivering the departed, capable of protecting those presently living. For the deceased [Name], we now perform posthumous rites for the path of darkness, that they may swiftly achieve transcendence.\n\nFirst, we invite the Fivefold Dark Fragrance to offer to the Three Clarities and Supreme Saints, that they descend into the ritual arena. Next, we invite the Great Virtue Dharma Master to conduct the ritual proceedings, relying upon the assembly of the Dharma to join in unison, extolling the inconceivable:\n\n**Dao incense, virtue incense, non-action incense, liberation incense, the naturally subtle incense of rebirth.**\n\nThe incense wafts gently, tinkling like jade pendants; only the Dharma Master’s voice of praise is heard. As the treasure repository opens, Heaven and Earth grow still—soon, wondrous light arises. One stick of dark incense is kindled to summon the soul’s return, offered aloft to the Jade Morning Worthy. May you bestow the power of great compassion without hindrance, enabling the departed to swiftly attain transcendence.\n*And inconceivable merit and virtue.*\n\nBurning incense, we reverently invoke the King within the Dharma, the Sage Lord of the Qingwei Heaven:\n**Who generates Heaven, Earth, and all beings—**\n**The Most High Jade Clarity, Primordial Beginning Worthy.**\n*And inconceivable merit and virtue.*\n\nBurning incense, we reverently invoke the King within the Dharma, the Teaching Lord of the Yuyu Heaven:\n**Who transmits scriptures, teachings, and the myriad Dharmas—**\n**The Most High Jade Morning, Great Dao Lord.**\n*And inconceivable merit and virtue.*\n\nBurning incense, we reverently invoke the King within the Dharma, the Transformation Lord of the Taichi Heaven:\n**Who fashions the Three Powers and moves the Five Phases—**\n**The Most High Five Spirits, Mysterious Elder Lord.**\n*And inconceivable merit and virtue.*\n\nAt that time, the Heavenly Worthy of Primordial Beginning addressed the Wondrous Practice Perfected One, saying: Beyond the Northern Dark Sea, a hundred thousand *li* distant, there is a world called Dongyin. Within the country of Shuodan Yujue, there is an Imperial Lord named Five Spirits Mysterious Elder Black Emperor Heavenly Lord, who governs the boundless host of sages of the Northern Realm.\n\nThere is a great mountain called Fengdu, which reaches upward to the Terrace of Langfeng, spanning over fifty thousand *li* in circumference. Below, there are six caverns known as the Dark Scenery Heavenly Palaces, which are the domains of the Great Dark Water Emperor, the Northern Dark Heavenly Lord, and the Fengdu Great Emperor. The Direct Envoys of the Heavens, the Spirit Lords of the Five Dippers—Eastern Dipper Lord of Life Qi, Southern Dipper Controller of Prohibitions, Western Dipper Lord of Life Forms, Northern Dipper Controller of Destiny, Central Dipper General Recorder—along with the Earth Masters of the Nine Harmonies and the Great Gods of the Five Peaks serve as their subordinates, assisting in the governance of the Ten Perfected Lords.\n\nThe various great hells examine and weigh good and evil, interrogating and tormenting the souls. All the deceased must pass through them.\n\nAt that moment, among the assembly was a Perfected One named Wondrous Practice, who gazed upon the Heavenly Worthy and composed these verses to deliver the departed. Today, we proclaim and expound them to perform this repentance and invocation:\n\n**Great Unity Savior from Suffering Heavenly Worthy**\n\nBurning incense to offer to the Lord of the First Palace of the Dark Realms, the True Lord of Supreme Simplicity and Vast Brilliance—whom the world calls the Great King of Qin Guang. Within its hells, long serpents spew flames, iron dogs exhale smoke. On the seventh day after death, the departed first arrive at this palace.\n\nThe Heavenly Worthy, moved by compassion, delivers the departed souls, guiding them to depart the dark paths. Thus, we recite the gatha in praise:\n\n**Jade Treasure August Heavenly Worthy**\n\nVast and desolate, the sea of suffering is truly lamentable;\nEvil karma clings to the body, sown by one’s own hands.\nSoul and po-soul have returned to the Bureau of Destiny,\nThe dark gates are locked—when will they open?\nLong serpents spew flames, blazing like fire,\nIron dogs exhale smoke, advancing in waves.\nBowing in reverence, we listen to the Three Treasures’ hymns,\nUniversally enabling deliverance from the Yellow Springs.\n*And inconceivable merit and virtue.*\n\nUpon hearing this gatha, the Perfected One rejoiced and leapt for joy, gazing up to thank the Heavenly Worthy, and again recited a gatha in praise:\n\n**Nine Dark Realms Deliverance from Sin Heavenly Worthy**\n\nThe boundless sacred power is inconceivable,\nCompletely releasing the dark prisons’ interrogations.\nA single path of auspicious light comes to receive and guide,\nThe departed spirit follows, ascending to the cinnabar steps.\n*May we dedicate this merit to the departed, that they be reborn in the Land of Ultimate Bliss.*\n\nBurning incense to offer to the Lord of the Second Palace of the Dark Realms, the True Lord of Dark Virtue and Settled Rest—whom the world calls the Great King of Chu Jiang. Within its hells are knife mountains and sword trees, fiery screens and freezing ice. On the fourteenth day after death, the departed must proceed to this palace.",
      "overlap_context": "ted spirit.\n*And inconceivable merit and virtue.*\n\nTo all boundless sages we make universal offering,\nIncense smoke pervades Fusang.\nTo the rivers, Yangtze, Huai, and seas,\nTo thunder, lightning, rain, and dragon deities,\nTo the valleys of the Ten Continents and Three Isles,\nTo the immortals of the Water Palaces—\nMay you bestow the power of great compassion,\nTo deliver this departed spirit.\n*And inconceivable merit and virtue.*\n\n**Invocation of the Sages**\n**Proceeding to the Ritual Procedures**",
      "start_char": 243,
      "end_char": 1543,
      "start_sentence": 22,
      "end_sentence": 91,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.39499759674072,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\地府十王拔度仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "天尊哀悯，拔度亡魂，出离冥涂，乃称偈赞。 玄真万福天尊 众生成造恶因缘，孰为回心见福田。 剑树刀山屠一体，汤随烈火恣烹煎。 无明种种欺方寸，一念思惟秪罪愆。 汝等归依无上道，当来速得往生天。 和不可思议功德。 尔时，真人闻是颂已，心大欢喜，稽首天尊，再吟偈赞。 十方救苦天尊 悠悠长夜可悲伤，一切众生苦莫当。 仰赖慈尊垂救度，须臾热恼化清凉。 和愿荐此亡灵，往生极乐国。 焚香供养，冥府第三宫、洞明普静真君。 世人所谓，宋帝大王。 其中地狱，吞火食毒，屠割身形。 亡人三七，须诣此宫。 天尊大慈，不令经涉，乃作偈颂。 太妙至极天尊 冥冥幽府九重根，长夜唯闻苦毒声。 狱卒强教吞毒炭，牛头屠割汝形身。 前生业果重重积，殁后悲酸一一经。 今日听宣无上道，此身速离广寒庭。 和不可思议功德。 尔时，真人闻是颂已，说大慈心，赞叹天尊，而作偈颂。 朱陵度命天尊 天尊说教大慈悲，恶业众生尽得离。 五色祥光开道路，从今同会入无为。 和愿荐此亡灵，往生极乐国。 焚香供养，第四宫，玄德五灵真君。 世人所谓，仵官大王。 其中地狱，负沙运石，无有休息。 亡人四七，须诣此宫。 天尊大慈，广垂哀悯，救度众生，而作偈颂。 玄上玉晨天尊 酆都六洞大冥乡，窈窕穷魂实可伤。 恶业沉魂归地府，善功圆满上天堂。 负沙运石无休息，滚滚长河似沸汤。 谛听慈悲无上语，今为甘露入饥肠。 和不可思议功德。 尔时，真人闻是颂已，稽首天尊，赞叹无量，再吟偈颂。 法桥大度天尊 天尊无量救众生，白简丹书地狱迎。 一切愆尤俱解释，从今拷掠顿超升。 和不可思议功德。 焚香供养，冥府第五宫、最圣耀灵真君。 世人所谓，阎罗大王，乃北阴天君之上佐，诸大地狱之总司，号同九幽，位齐五斗。 亡人五七，当至此宫。 业镜现形，随缘报对。 天尊慈悯，普为众生。 拔度亡魂，而作偈颂。 度仙上圣天尊 众生颠倒昧元因，欲海茫茫错用心。 金玉如山难济死，临行惟有业随身。 三涂渺渺无超度，长夜冥冥正拷魂。 地狱须臾皆解脱，一心恭敬大慈尊。 和不可思议功德。 尔时，真人闻是慈悲，稽首作礼，上白天尊，再吟偈颂。 火炼丹界天尊 众生业障本由心，解脱须凭无量因。 稽首虚皇无上道，一言宝偈胜千金。 和愿荐此亡灵，往生极乐国。 焚香供养，冥府第六宫、宝肃昭成真君。 世人所谓，变成大王。 其中地狱，金钉拔舌，铁斧刳胸。 亡人六七，当诣此宫。 昼夜拷魂，被受诸苦。 天尊慈悯，奉为一切穷魂，而作偈颂。 好生度命天尊 刀山剑树铁成林，恶业众生正苦吟。 浮世电光来快乐，冥涂千劫永湮沉。 阴司报对无容隐，拔舌刳胸痛莫禁。 为汝灭除无量业，当来稽首谢三清。 和不可思议功德。 尔时，真人闻是颂已，顶礼恭敬，上白天尊，再吟偈颂。 金阙化身天尊 慈尊惠度说因缘，接引众生上法船。 炼度此形成妙质，当知圣力大无边。 和愿荐此亡灵，往生极乐国。 焚香供养，冥府第七宫、泰山玄妙真君，见世名曰，泰山大王。 受上帝敕命，佐理北阴，昼居东岳，夜入冥府。 亡人终七，须诣此宫。 拷定因缘，校量罪福。 天尊救度，普使超升，为诸众生，而作偈颂。 太灵虚皇天尊 人间祸福本无门，汝等亲栽善恶根。",
      "translated_text": "The Heavenly Worthy, moved by compassion, delivers and guides the departed souls to depart from the dark paths, and so recites a gatha in praise:\n\n**Mystic Truth and Myriad Blessings Heavenly Worthy**\n\nAll beings create the causes of evil,\nWho among them turns their heart to behold the field of blessings?\nSword trees and knife mountains flay the body whole,\nBoiling broth follows searing flames, freely stewing and searing.\nCountless delusions deceive the heart,\nA single thought’s reflection yields only transgressions.\nYou who take refuge in the supreme Dao,\nShall swiftly attain rebirth in the heavens to come.\n\n*May the inconceivable merit be dedicated.*\n\nThereupon, the Perfected One, having heard this gatha, rejoiced greatly, bowed his head to the Heavenly Worthy, and again recited a gatha in praise:\n\n**Ten Directions Salvation from Suffering Heavenly Worthy**\n\nThe long, long night is pitiable and sorrowful,\nAll beings endure unbearable suffering.\nRelying on the compassionate Honored One’s deliverance,\nIn an instant, scorching afflictions transform into cool clarity.\n\n*May we dedicate this merit to the departed, that they be reborn in the Land of Ultimate Bliss.*\n\nBurning incense to offer to the Lord of the Third Palace of the Dark Realms, the True Lord of Pervasive Clarity and Universal Stillness—whom the world calls the Great King of Song Di. Within its hells, souls swallow fire and consume poison, their bodies flayed and dismembered. On the twenty-first day after death, the departed must proceed to this palace.\n\nThe Heavenly Worthy, in great compassion, lest they endure such trials, recites a gatha:\n\n**Supremely Wondrous and Utmost Heavenly Worthy**\n\nIn the ninefold depths of the dark prisons’ roots,\nThrough the long night, only the sounds of bitter suffering are heard.\nThe jailers force you to swallow burning coals,\nWhile ox-headed demons flay and dismember your form.\nThe fruits of past deeds accumulate heavily,\nAfter death, each sorrow and pain is endured in turn.\nToday, hearing the proclamation of the supreme Dao,\nThis body swiftly departs the vast, cold courts.\n\n*May the inconceivable merit be dedicated.*\n\nThereupon, the Perfected One, having heard this gatha, filled with great compassion, extolled the Heavenly Worthy and recited a gatha:\n\n**Cinnabar Mound Life-Delivering Heavenly Worthy**\n\nThe Heavenly Worthy’s teachings are of great compassion,\nAll beings of evil karma are fully liberated.\nFive-colored auspicious light opens the path,\nFrom this day forth, all assemble in the realm of non-action.\n\n*May we dedicate this merit to the departed, that they be reborn in the Land of Ultimate Bliss.*\n\nBurning incense to offer to the Lord of the Fourth Palace, the True Lord of Mystic Virtue and Fivefold Numinosity—whom the world calls the Great King of Wu Guan. Within its hells, souls bear sand and transport stones without rest. On the twenty-eighth day after death, the departed must proceed to this palace.\n\nThe Heavenly Worthy, in boundless compassion, moved to pity, delivers all beings and recites a gatha:\n\n**Mystic Supreme Jade Dawn Heavenly Worthy**\n\nIn the six caves of Fengdu’s vast dark land,\nThe lost and wandering souls are truly pitiable.\nSouls sunk in evil karma descend to the earthly prisons,\nWhile those who perfect virtuous deeds ascend to heaven.\nBearing sand and transporting stones without rest,\nThe surging long river seems like boiling broth.\nAttend to the compassionate words of the supreme teaching,\nNow they enter the hungry belly like sweet dew.\n\n*May the inconceivable merit be dedicated.*\n\nThereupon, the Perfected One, having heard this gatha, bowed his head to the Heavenly Worthy, extolling without end, and again recited a gatha:\n\n**Dharma Bridge Great Deliverance Heavenly Worthy**\n\nThe Heavenly Worthy, in boundless salvation of beings,\nWith white writs and cinnabar records, welcomes them from the hells.\nAll transgressions and faults are completely absolved,\nFrom this day forth, their trials and torments instantly transcend.\n\n*May the inconceivable merit be dedicated.*\n\nBurning incense to offer to the Lord of the Fifth Palace of the Dark Realms, the Most Sacred and Radiant Numinous True Lord—whom the world calls the Great King Yanluo. He is the chief minister of the Northern Darkness Heavenly Lord, the overseer of all great hells, his authority equal to the Nine Dark Realms, his rank aligned with the Five Celestial Ladles. On the thirty-fifth day after death, the departed must proceed to this palace. Here, the Mirror of Karma reveals their form, and retribution follows their deeds.\n\nThe Heavenly Worthy, moved by compassion, universally delivers all beings, and recites a gatha for the deliverance of the departed souls:\n\n**Transcendent Immortal and Supreme Sage Heavenly Worthy**\n\nBeings, deluded, obscure their original cause,\nIn the vast sea of desire, their hearts err and stray.\nGold and jade, though piled like mountains, cannot aid in death,\nAt the final hour, only karma follows the body.\nThe three paths stretch endlessly, without deliverance,\nThrough the long night of darkness, souls are interrogated.\nYet in an instant, all hells are liberated,\nWith a single heart, revere the Great Compassionate Honored One.\n\n*May the inconceivable merit be dedicated.*\n\nThereupon, the Perfected One, having heard this compassion, bowed his head in reverence, addressed the Heavenly Worthy, and again recited a gatha:\n\n**Fire-Refined Cinnabar Realm Heavenly Worthy**\n\nThe obstructions of beings’ karma arise from the heart,\nLiberation depends on boundless causes.\nBowing to the Supreme Dao of the Void Sovereign,\nA single precious gatha surpasses a thousand pieces of gold.\n\n*May we dedicate this merit to the departed, that they be reborn in the Land of Ultimate Bliss.*\n\nBurning incense to offer to the Lord of the Sixth Palace, the True Lord of Precious Solemnity and Illustrious Accomplishment—whom the world calls the Great King of Bian Cheng. Within its hells, tongues are pierced with golden nails, and chests are split open with iron axes. On the forty-second day after death, the departed must proceed to this palace. Day and night, their souls are interrogated, enduring all manner of suffering.\n\nThe Heavenly Worthy, moved by compassion, recites a gatha for all the destitute souls:\n\n**Life-Cherishing Life-Delivering Heavenly Worthy**\n\nKnife mountains and sword trees form forests of iron,\nBeings of evil karma now wail in suffering.\nThe fleeting pleasures of the floating world are like lightning,\nYet in the dark paths, they sink for a thousand kalpas.\nThe retributions of the nether courts allow no concealment,\nTongues torn out and chests split open—pain beyond endurance.\nFor you, I extinguish boundless karma,\nIn the future, bow in gratitude to the Three Clarities.\n\n*May the inconceivable merit be dedicated.*\n\nThereupon, the Perfected One, having heard this gatha, bowed in reverence, addressed the Heavenly Worthy, and again recited a gatha:\n\n**Golden Portal Transformation-Body Heavenly Worthy**\n\nThe Compassionate Honored One, in benevolent deliverance, expounds the causes,\nGuiding beings to board the Dharma boat.\nRefining and transforming this form into a wondrous essence,\nKnow now the sacred power is boundlessly great.\n\n*May we dedicate this merit to the departed, that they be reborn in the Land of Ultimate Bliss.*\n\nBurning incense to offer to the Lord of the Seventh Palace, the True Lord of Mount Tai’s Mystic Wonders—whom the world calls the Great King of Mount Tai. By the Emperor’s decree, he assists in governing the Northern Darkness, residing on the Eastern Peak by day and entering the nether courts by night. On the forty-ninth day after death, the departed must proceed to this palace. Here, the causes of their deeds are examined, and the weight of their sins and virtues is measured.\n\nThe Heavenly Worthy, in deliverance, universally enables their transcendence, and recites a gatha for all beings:\n\n**Supreme Numinous Void Sovereign Heavenly Worthy**\n\nIn the human realm, fortune and misfortune have no fixed gate,\nYou yourselves have planted the roots of good and evil.",
      "overlap_context": "de,\nThe departed spirit follows, ascending to the cinnabar steps.\n*May we dedicate this merit to the departed, that they be reborn in the Land of Ultimate Bliss.*\n\nBurning incense to offer to the Lord of the Second Palace of the Dark Realms, the True Lord of Dark Virtue and Settled Rest—whom the world calls the Great King of Chu Jiang. Within its hells are knife mountains and sword trees, fiery screens and freezing ice. On the fourteenth day after death, the departed must proceed to this palace.",
      "start_char": 1543,
      "end_char": 2939,
      "start_sentence": 92,
      "end_sentence": 176,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.12441325187683,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\地府十王拔度仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "方寸但知藏垢秽，百年数尽作孤魂。 业风吹处生还死，万劫悲辛不忍闻。 为汝灭除无量业，当来来敬大元君。 和不可思议功德。 尔时，真人闻是妙音，发无上道心，稽首天尊，再吟偈颂。 逍遥快乐天尊 悠悠五苦报囚徒，高上慈尊尽拔扶。 倏忽遍蒙甘露洒，幽关无数出泥涂。 和愿荐此亡灵，往生极乐国。 焚香供养，冥府第八宫、无上正度真君。 世人所谓，平等大王。 其中罪人，手抱铜柱，身卧铁床。 死经百日，方到此宫。 罪业大深，拘留此狱。 天尊大慈，哀悯众生，济度罪魂，而作偈颂。 无量大华天尊 冥官鼓笔怒威惊，拷掠悲辛不忍闻。 人世百年无片善，亡灵过恶似沙尘。 阴关未隔阳光界，骨肉为谁救拔人。 惟愿脱离幽锁去，得生恭敬大慈尊。 和不可思议功德。 尔时，真人闻是颂已，礼谢天尊，再吟偈颂。 随愿往生天尊 虚皇一念向众生，地狱咸听大法音。 倏忽超升三界土，永离幽夜剑林中。 和愿荐此亡灵，往生极乐国。 焚香供养，冥府第九宫、飞魔演化真君。 世人所谓，都市大王。 其中地狱，锯解镬汤，万死千生，无有休息。 死经周岁，方诣此宫。 天尊布化，普为众生，大启慈悲，救苦度厄，而作偈颂。 玉虚明皇天尊 冥关一闭永无光，溟漠幽昏去路长。 浮世何由通信息，酆都境界隔阴阳。 危冠朱吏司刑剎，狱卒牛头掌镬汤。 稽首慈尊来救苦，愿乘超度入仙乡。 和不可思议功德。 尔时，真人闻是颂已，惧喜赞叹，功德无边。 稽首天尊，再吟偈颂。 乘功托化天尊 天尊法力不思议，一切天神愿赖依。 白简真符来地狱，威光前路引魂仪。 和愿荐此亡灵，往生极乐国。 焚香供养，冥府第十官、五灵威德真君。 见世名曰，转轮大王。 应诸罪魂，死经大祥，方至此宫。 天尊悯济，救拔亡灵，而为偈颂。 真皇洞神天尊 虚皇演教说真诠，普为众生度有缘。 行满登高无色界，罪根深重入冥泉。 逍遥宴处金华馆，累劫应知见福田。 一切幽魂咸解脱，尽披重雾睹青天。 和不可思议功德。 尔时，真人闻是颂已，赞叹无量，再吟偈颂。 宝华圆满天尊 天尊哀悯救群迷，九夜幽魂尽出离。 径上南宫咸受度，普皆同会入无为。 和愿荐此亡灵，往生极乐国。 天尊言，一切众生，死经地狱，魂系酆都，备受诸苦，时时拷掠，刀山屠割，铜柱铁床，火翳寒他，无边苦恼。 吾今为汝称吟宝偈，举无量音，响彻十方，声闻九地，拷对悉皆解脱。 魂神受炼，径上南宫，劫劫生生，长居快乐。 向来演说天尊偈颂，十王真君名号，功德圆成，超度亡过某人，往生天界。 伏愿承兹妙果，尽释愆尤。 速离幽暗之乡，径达往生之路。 然冀福流见在，庆及家门。 一切有情，同登道岸。 讽经　宣疏　向来　回向 地府十王拔度仪竟",
      "translated_text": "Within the heart, one knows only to harbor filth and defilement,\nA hundred years pass, and one becomes a lonely shade.\nWhere the karmic wind blows, life turns to death,\nTen thousand kalpas of sorrow and bitterness—unbearable to hear.\n\nFor you, I extinguish boundless karmic deeds,\nThat you may come to revere the Great Primordial Lord.\nAnd [perform] inconceivable merits.\n\nThereupon, the Perfected One, hearing this wondrous sound,\nAroused the unsurpassed Dao-mind,\nBowed to the Heavenly Worthy,\nAnd chanted another gatha:\n\n**Heavenly Worthy of Carefree Bliss**\n\nEndless are the prisoners of the Five Sufferings,\nYet the Most High Compassionate Lord lifts them all.\nIn an instant, they are bathed in sweet dew,\nCountless souls emerge from the mire of the dark gates.\n\nAnd [we] pray to deliver this departed spirit to the Land of Ultimate Bliss.\nBurning incense to offer to the Lord of the Eighth Palace, the Supreme Right Deliverance Perfected Lord—\nWhom the world calls the Great King of Equality.\nHere, sinners embrace bronze pillars and lie upon iron beds.\nOnly after a hundred days of death do they arrive at this palace.\nThose with grave karmic offenses are detained in this hell.\n\nThe Heavenly Worthy, in great compassion,\nPities all beings and delivers the sinful souls,\nAnd recites a gatha:\n\n**Heavenly Worthy of Boundless Great Flower**\n\nThe underworld officials wield their brushes in wrathful might,\nTheir interrogations and torments—unbearable to hear.\nA hundred years in the world without a shred of goodness,\nThe departed spirit’s transgressions are like grains of sand.\n\nThe yin barrier does not block the yang realm’s light,\nYet for whom do kin intercede to save them?\nOnly by escaping the dark shackles\nMay one be born to revere the Great Compassionate Lord.\n\nAnd [perform] inconceivable merits.\n\nThereupon, the Perfected One, having heard this gatha,\nBowed in gratitude to the Heavenly Worthy\nAnd chanted another gatha:\n\n**Heavenly Worthy of Wish-Fulfilled Rebirth**\n\nThe Sovereign of the Void turns a single thought toward all beings,\nEven hell hears the sound of the Great Dharma.\nIn an instant, they transcend the Three Realms’ dust,\nForever leaving the dark night’s forest of swords.\n\nAnd [we] pray to deliver this departed spirit to the Land of Ultimate Bliss.\nBurning incense to offer to the Lord of the Ninth Palace, the Flying Demons’ Transformative Perfected Lord—\nWhom the world calls the Great King of the Capital.\nHere, hells abound with saws, cauldrons, and boiling oil,\nA thousand deaths and ten thousand rebirths—unceasing.\n\nOnly after a full year of death do they arrive at this palace.\nThe Heavenly Worthy, in transformation, universally aids all beings,\nGreatly awakening compassion to save and deliver from suffering,\nAnd recites a gatha:\n\n**Heavenly Worthy of Jade Void Luminous Sovereign**\n\nOnce the yin gates close, light is forever lost,\nThe dark and boundless path stretches long.\nHow can word reach the floating world?\nThe Fengdu realm divides yin and yang.\n\nCrimson-clad officials in towering hats preside over the execution grounds,\nOx-headed jailers tend the cauldrons of boiling oil.\nBowing to the Compassionate Lord who comes to save from suffering,\nMay we ride the deliverance to the immortal realm.\n\nAnd [perform] inconceivable merits.\n\nThereupon, the Perfected One, having heard this gatha,\nTrembled with awe and joy, praising without end.\nBowing to the Heavenly Worthy,\nHe chanted another gatha:\n\n**Heavenly Worthy of Merit-Borne Transformation**\n\nThe Heavenly Worthy’s power is inconceivable,\nAll heavenly spirits rely upon it.\nWhite talismans and true decrees descend to hell,\nTheir majestic light guides the souls along the path.\n\nAnd [we] pray to deliver this departed spirit to the Land of Ultimate Bliss.\nBurning incense to offer to the Lord of the Tenth Palace, the Five Spirits’ Majestic Virtue Perfected Lord—\nWhom the world calls the Great King of the Turning Wheel.\nAll sinful souls, after the Great Mourning,\nArrive at this palace.\n\nThe Heavenly Worthy, in compassion, delivers the departed spirits,\nAnd recites a gatha:\n\n**Heavenly Worthy of True Sovereign and Cavern Spirit**\n\nThe Sovereign of the Void expounds the teachings, revealing the true essence,\nUniversally delivering all beings with karmic affinity.\nThose who fulfill their practice ascend to the formless realm,\nThose with deep karmic roots sink into the underworld springs.\n\nCarefree, they feast in the Golden Flower Palace,\nKnowing through kalpas the sight of the field of blessings.\nAll dark souls are liberated,\nShedding the heavy mist to behold the blue sky.\n\nAnd [perform] inconceivable merits.\n\nThereupon, the Perfected One, having heard this gatha,\nPraised without end,\nAnd chanted another gatha:\n\n**Heavenly Worthy of Jeweled Flower Perfection**\n\nThe Heavenly Worthy, in pity, saves the deluded masses,\nThe dark souls of nine nights all emerge.\nDirectly ascending to the Southern Palace, all receive deliverance,\nUniversally gathering to enter the realm of non-action.\n\nAnd [we] pray to deliver this departed spirit to the Land of Ultimate Bliss.\n\nThe Heavenly Worthy declared:\nAll beings, after death, pass through hell,\nTheir souls bound to Fengdu, enduring every torment—\nConstant interrogations, knife mountains, slicing blades,\nBronze pillars, iron beds, scorching flames, and freezing ice,\nUnending suffering and affliction.\n\nNow, for you, I chant the precious gatha,\nRaising boundless sounds that resound through the ten directions,\nTheir voices reaching the nine earths,\nAll interrogations dissolve, and all are liberated.\nThe souls, refined, ascend directly to the Southern Palace,\nKalpa after kalpa, life after life, dwelling forever in bliss.\n\nThe Heavenly Worthy’s gathas and the names of the Ten Kings have been recited,\nThe merit is complete,\nDelivering the departed [Name],\nTo be reborn in the heavenly realm.\n\nWe pray that by this wondrous fruit,\nAll transgressions be absolved,\nSwiftly leaving the dark land,\nDirectly reaching the path of rebirth.\nMay blessings flow to the present,\nBringing joy to the household.\nMay all sentient beings\nTogether ascend the shore of the Dao.\n\nRecitation of sutras, proclamation of petitions, as before—dedicated.\nThe Rite for Deliverance by the Ten Kings of Hell is now complete.",
      "overlap_context": "tering the nether courts by night. On the forty-ninth day after death, the departed must proceed to this palace. Here, the causes of their deeds are examined, and the weight of their sins and virtues is measured.\n\nThe Heavenly Worthy, in deliverance, universally enables their transcendence, and recites a gatha for all beings:\n\n**Supreme Numinous Void Sovereign Heavenly Worthy**\n\nIn the human realm, fortune and misfortune have no fixed gate,\nYou yourselves have planted the roots of good and evil.",
      "start_char": 2940,
      "end_char": 4101,
      "start_sentence": 177,
      "end_sentence": 244,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.509071826934814,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\威仪类\\地府十王拔度仪.txt",
        "category": "威仪类"
      }
    }
  ]
}