{
  "source_id": "大洞炼真宝经修伏灵砂妙诀",
  "source_file": "chunked_daozang\\大洞炼真宝经修伏灵砂妙诀.json",
  "total_chunks": 9,
  "total_original_chars": 9935,
  "total_translated_chars": 53857,
  "total_translation_time": 257.0704185962677,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\大洞炼真宝经修伏灵砂妙诀.txt",
    "category": "众术类"
  },
  "full_translation": "**The Wondrous Secrets of the *Great Cavern Scripture of Refining the True* – Preface and Treatise on the Sevenfold Reversion of Divine Cinnabar**\n\n**Title:** *The Wondrous Secrets of the Great Cavern Scripture of Refining the True*\nComposed by Chen Shaowei, a Daoist of Mount Heng during the reign of Emperor Xuanzong of Tang. Recorded in the *New Tang Book · Treatise on Arts and Letters*. The author claims to have encountered a perfected being in the Yellow Dragon Grotto, who transmitted to him the essential secrets of divine cinnabar. He thus set forth the *Sevenfold Reversion Secrets of Divine Cinnabar* in seven chapters and the *Supreme Secrets of the Golden Elixir* in two sections, along with a preface and treatise. Later disciples divided this work into two parts, nearly two scrolls in total. Here, they are combined into one. Source of the base text: *Daoist Canon of the Zhengtong Era*, *Section of the Cavernous Spirit*, *Category of Various Arts*. For reference, see *Seven Lots from the Cloudy Satchel*, Scrolls 68 and 69.\n\n---\n\n**Preface to the Wondrous Secrets of Refining and Subduing Divine Cinnabar**\n\nSince the beginning of the Tianyuan era, I have wandered Mount Heng and sojourned in the Yellow Dragon’s abode. Suddenly, within a rocky cavern, I encountered a perfected and true being, who bestowed upon me the essential secrets of divine cinnabar.\n\nThe perfected one said: \"I received this from Master Xu Juankun, who was taught by the Heavenly Master Wu. The Heavenly Master originally received it from the Realized One Ding of the same prefecture. The fundamental secrets of cinnabar elixirs are profound and abstruse in their mystery and principle, truly difficult to fathom. Thus, those who seek the Dao and aspire to the divine arts of the immortals, failing to penetrate their true origin, remain long mired in the dust of the world. Since ancient times, the transmitted scriptures have been veiled in obscurity, their words concealed, never disseminated among the world. I have long been moved by this. Now, I set forth the *Sevenfold Reversion of Divine Cinnabar* in seven chapters, along with the *Supreme Secrets of the Golden Elixir* in two sections, and compose this preface and treatise, to be shown to those of like aspiration in later generations.\"\n\n---\n\n**Treatise on the Sevenfold Reversion of Divine Cinnabar**\n\nCinnabar is the supreme essence of the Great Yang, the true embodiment of metal and fire. It harmonizes with the eight minerals and corresponds to the twenty-four qi. That which is called \"cinnabar\" is metal, transformed by fire, and thus named \"cinnabar.\" That which is called \"mercury\" is fire, separated from metal, and thus named \"mercury.\" Cinnabar receives the essence of Yang and awaits its fulfillment, while mercury departs from its original substance and its body is incomplete. Thus, cinnabar is the essence of metal and fire, coalescing into form, containing the true qi of the mysterious and primordial, the upright and pure. This is the foundation of the returning elixir, the root origin of the great medicine. When its virtue is contained, the myriad images arise; when its body departs, it becomes obscure and unfathomable.\n\nThe scripture says: \"The radiant essence of Yang—obtaining it, one may restore the hun-soul and return the po-soul.\" Thus, it is known that consuming the essence of Yang grants longevity, while ingesting the yin po leads to death as a ghost. Cinnabar is the lord of the true Yang, the sovereign of the Red Emperor, enthroned in the south, the rightful position of fire.\n\nNow, the forms of cinnabar are manifold, each receiving qi differently. Only three kinds are fit for the supreme medicine: the finest is luminous cinnabar; the middle grade is white horse-tooth cinnabar; and the lowest is purple divine cinnabar. Other varieties, such as river cinnabar and earthen cinnabar, are unfit for the supreme medicine or for ingestion.\n\nOne tael of luminous cinnabar is equal in potency to four taels of white horse-tooth cinnabar. One tael of white horse-tooth cinnabar is equal in potency to eight taels of purple divine cinnabar. The potency of river cinnabar and earthen cinnabar cannot be compared.\n\nSome may ask: \"If all cinnabar receives the essence of the Great Yang, why do river and earthen cinnabars differ in potency?\" Luminous cinnabar receives the pure, clear, and luminous essence of the Great Yang, descending to coalesce into a radiant red glow—hence its name. White horse-tooth cinnabar receives the balanced and gentle essence of the Great Yang, descending to form a sparkling white luster like mica—hence its name. Purple divine cinnabar is half-formed by the numinous qi of mountains and marshes, its color a reddish-purple—hence its name. River and earthen cinnabars, however, receive turbid and impure qi, coalescing into a muddled, dull form devoid of essence—thus unfit for the supreme medicine.\n\nFor instance, refining one catty of luminous cinnabar yields fourteen taels, and through fire refinement, seven taels of the supreme treasure are obtained. Refining one catty of white horse-tooth cinnabar yields twelve taels, and through fire refinement, six taels of the supreme treasure are obtained. Refining one catty of purple divine cinnabar yields ten taels, and through fire refinement, four taels of the supreme treasure are obtained. Refining one catty of river or earthen cinnabar yields six or seven taels, and through fire refinement, only one or two taels of the supreme treasure are obtained. From this, it is clear that river and earthen cinnabars receive impure qi, mingled with turbidity. The wise and discerning first select the cinnabar, then regulate the fire, carefully attending to the process to achieve the seven reversions and nine returns.\n\nAmong metals and stones, none are as numinous, sagely, divine, or luminous as cinnabar. Carrying even one tael in one’s sleeve repels demons and evil spirits—how much more so when refined and ingested, entering the five viscera!\n\nNow, the seven reversions and nine returns are different names for the same body. \"Reversion\" is cinnabar transformed into metal; \"return\" is metal restored to cinnabar. The scripture says: \"Return to my homeland, restore my constancy—ingesting it, one ascends in broad daylight to the Jade Emperor.\"\n\nSome may ask: \"Is the sevenfold reversion cinnabar, belonging to fire, refined into metal, and thus called the sevenfold reversion?\" The treatise states: The completion number of fire is seven. Seven transformations correspond to the ultimate embodiment of Yang. The seven transformations proceed as follows:\n\nAfter refining cinnabar to obtain the subdued fire, it is smelted into white silver—this is the first reversion. The white silver is transformed to extract cinnabar, which is smelted with subdued fire into yellow-flowered silver—this is the second reversion. The yellow-flowered silver is transformed to extract cinnabar, which is smelted with subdued fire into azure gold—this is the third reversion. The azure gold is transformed to extract cinnabar, which is smelted with subdued fire into yellow gold—this is the fourth reversion. [...]\n\nThe yellow gold is transformed to extract red cinnabar, which is smelted with subdued fire into red gold—this is the fifth reversion. The red gold is reverted to extract cinnabar, which is smelted with subdued fire into crimson gold—this is the sixth reversion. The crimson gold is once more transformed into cinnabar, which is smelted with subdued fire into purple gold. Upon reaching purple gold, it becomes the seventh-reversion numinous-cinnabar gold, replete with accumulated Yang and suffused with the essence of true primordial qi.\n\nWhen purple gold is transformed back into cinnabar and refined with fire through one full cycle, it becomes radiantly translucent and luminous, called *Purple Gold Reverted Elixir*. Those who ingest it achieve the union of form and spirit, ascending lightly on the very same day.\n\nYet many in the world mistakenly take mineral sulfur, calling it the supreme essence of Grand Yang, and combine it with mercury to refine the seven reversions. Sulfur, however, bears the solitary Yang of mineral and stone, while mercury has departed from its original harmony—both substances are partial and imbalanced. How then can they yield a true and perfect treasure? I have observed that while many attempt refinement, none succeed in the end, for they blindly follow inherited errors down to later generations. I grieve deeply for this.\n\nConsider, for instance, the first-reversion subdued-fire cinnabar: ingesting one *liang* dispels ten thousand illnesses; two *liang* turns hair and beard black; three *liang* brings a rosy complexion; four *liang* extends years and augments longevity. The second-reversion medicine, when taken in one *liang*, harmonizes the body and clarifies the spirit, reversing age to return to youth. The third-reversion medicine, in one *liang*, induces emptiness and detachment, uniting the heart with ultimate essence. The fourth-reversion medicine, in one *liang*, renders the body translucent, penetrating both exterior and interior. The fifth-reversion medicine, in one *liang*, enables one to enter water without drowning or fire without burning. The sixth-reversion medicine, in one *liang*, renders one unshaken by transformation and unknown to spirits. The seventh-reversion medicine, in one *liang*, elevates one beyond the Nine Heavens, roaming freely between heaven and earth. Further ingestion of the *Crimson Floret Ninefold Elixir* allows one to dwell in the Golden Towers, attaining the rank of Perfected.\n\nThus, the power of cinnabar is manifest and observable. Having grasped its true principle, I have long wished to aid others as an act of merit, illuminating the great Dao so that all may together return to the mysterious realm. Therefore, I composed the *Seven Chapters on Numinous Cinnabar* and the *Two Chapters on the Golden Elixir*, along with detailed accounts of fire phases, the sequence of medicinal substances, the hierarchy of chapters, and their respective categories—all arranged in subsequent sections to be bestowed upon the worthy and sincere.\n\nThose of virtue who obtain these teachings must treasure them, for they bring boundless fortune and longevity. Those who recklessly divulge them shall bring calamity upon nine generations of ancestors. One must not deceive with false words nor obscure the Dao; take care not to transcribe and show them to the unworthy. Test the wise and the foolish, and only after discernment bestow these chapters.\n\n*The Precious Scripture of Great Pervasion on Refining the True and Subduing Numinous Cinnabar: Wondrous Instructions*\n*Composed by Chen Shaowei, styled Ziming, the Perfected of Mount Heng*\n\n*Seven Reversions of Numinous Cinnabar*\n*First Reversion: Cinnabar*\n\nThe Scripture states: Cinnabar is the lord of all numinous beings, the root of creation and transformation, the foundation of spirit and illumination. Dwelling in the Ninefold Purity, it governs and commands all through the Mysterious Pervasion. When moved, it ascends in its lofty form; when stabilized, it achieves the perfection of Qian. Capable of transformation, it is thus named the Crimson Dragon. When soaring, it is called the Vermilion Bird.\n\nThe finest grade is born in the stone caves of Chen and Jin, appearing in several colors. The middle grade grows in Jiaozhou and Guizhou, also in several varieties. The lowest grade originates in Hengzhou and Shaozhou, with numerous types and classes. All differ in purity and turbidity, their true or spurious nature distinct, their descending qi and refined essence resonating with metals and stones. Those that receive the upright qi, when ingested, harmonize with the profound and unite with the true, becoming the highest attainment. Those that receive partial qi, when ingested, also attain longevity and remain in the world.\n\nMoreover, the finest luminous cinnabar emerges from the mountains and stones of Chen and Jin, atop the white Jiaoshi lungs, twelve pieces forming a seat, their color like an unopened red lotus, radiant and sunlike. There are also seats of nine, seven, five, three, or one piece. Those of twelve or nine pieces are most potent; those of seven or five pieces are next in efficacy. Within each seat, there is one large pearl weighing over ten taels, serving as the sovereign. Surrounding it are smaller ones, also weighing eight or nine taels, or even six or seven taels, acting as ministers in attendance, paying homage to the central sovereign. On the four sides of the seat, there are one or two *dou* of miscellaneous cinnabar, encircling the jade seat and the cinnabar lungs. From this miscellaneous cinnabar, one may select pieces shaped like hibiscus buds, fully formed; when placed on red silk at night, their luminosity penetrates through—these also belong to the finest grade.\n\nThere is also a type resembling horse teeth, with a white exterior and floating radiance—this is the finest white horse-tooth cinnabar. Another, like mica flakes with white light, is the middle-grade white horse-tooth cinnabar. Those round and elongated, resembling laughter, with a red-purple hue, are the finest purple numinous cinnabar. If they resemble stone flakes with angular edges and emit a greenish light, they are the lowest-grade purple numinous cinnabar, such as those from Jiao and Gui. However, if found in seats or within stones, shaped like hibiscus buds and luminous, they also belong to the finest grade. If formed in clusters of three or more pieces, weighing a *jin* and translucent, they are of the middle grade. Those in fragments, clear and bright, are of the lowest grade, like those from Heng and Shao. All purple cinnabar, or that extracted from stones with a red glow, are also of the lowest grade. River cinnabar, formed in granules and translucent, when refined and ingested, also grants longevity and permanence in the world, though it does not elevate one to the rank of highest immortality.\n\nCinnabar born in earthen caves and river cinnabar nurtured in the soil and water of streams, mixed with earth and stone, are unsuitable for use in superior medicinal preparations. The seat-born cinnabar is the finest of all. Obtaining one sovereign piece from the center of the seat, refining it, and incorporating it into the five viscera brings immediate merit, elevating one to the Upper Terrace of Cinnabar. With upright qi ever abiding, one transcends all entanglements. Further ingestion through the seven reversions and nine refinements naturally dissolves the corporeal soul, annihilates the mortal form, purifies the spirit-body, and entirely dispels yin qi. Thus, one embraces form yet ascends lightly, forever becoming a flying immortal of the highest truth.\n\nThus, it is known that the true essence of yang descends as qi, its round radiance complete and without partiality or deviation. Any refined cinnabar shaped like a hibiscus bud, with round and penetrating luminosity, is of the finest grade—the elixir ingested by divine immortals.\n\nThe Scripture states: Cinnabar is the natural reverted elixir. The world cannot fathom its origin. Even the cinnabar of the jade seat is known to all, such as the gold seat and the celestial seat. These are the cinnabar of the Supreme Purple Dragon and Mysterious Flower, not to be seen or known by common folk or ordinary men. The jade seat is for scholars and aspirants who accumulate merit and refine themselves through practice; its ingestion leads to immortality. The gold seat is for those with innate immortal bones, who cultivate emptiness and refine the spirit, dwelling in mountain caves. When immortals gather and consume it, they ascend and transform on the very same day. The celestial seat is reserved for the true officials of the Supreme Heavenly Immortals; its collection and ingestion are not the province of lesser immortals.\n\nThe cinnabar of the jade seat, having received the pure essence of six thousand years of yang numinosity, transforms into the gold seat. The gold seat is golden, with five pieces growing in layers at its center, surrounded by forty or fifty small pearls. After sixteen thousand years, it transforms into the celestial seat. The celestial seat is jade-green, with nine pieces growing in layers at its center, encircled by seventy-two pieces. It resides in the boundless void, perpetually guarded by the spirit of the Great One. On the day of the Upper Prime, true officials descend to gather it. The mountain suddenly opens, its radiance illuminating all, the entire mountain aflame. The cinnabar of the celestial seat is collected by true officials; later generations cannot obtain or gather it.\n\nThus, the origin of cinnabar is profound and remote. For those of lofty aspiration who yearn for light ascent, it is essential to discern the grades of the elixir, then regulate the fire phases, harmonize yin and yang, and refine it naturally to unite with the highest truth.\n\n**On the Refinement of Yin and Yang and the Secrets of Fire Phases**\n\nThe Scripture states: Yang essence is fire; yin essence is water. The refinement of yin and yang entails the mutual restraint of water and fire. Thus, it is known that ice and charcoal cannot coexist, and decline and flourishing ultimately find their resolution. Moreover, cinnabar is yang essence and requires yin to restrain it; the restraining agent is water. One should use azurite, malachite, *shicheng*, *mayaxiao*, *xuanjing*, and *huashi*. For one *jin* of luminous jade-seat cinnabar, refine it with four *liang* of azurite, six *liang* of *shicheng*, six *liang* of *mayaxiao*, and two *liang* each of *huangjing* and *huashi*.\n\nFor one *jin* of externally luminous cinnabar, refine it with five *liang* of azurite, four *liang* each of halite and *mayaxiao*, and one *liang* each of *huangjing* and *huashi*. For one *jin* of white horse-tooth cinnabar, use three *liang* each of *shicheng* and *mayaxiao*, and three *fen* each of *huangjing* and *huashi*. For one *jin* of purple spirit cinnabar, refine it with four *liang* of malachite, two *liang* each of *shicheng* and *mayaxiao*, and two *fen* each of *huangjing* and *huashi*. For cinnabar of inferior quality from riverbeds and mixed soils, refine each *jin* with four *liang* of azurite and two *liang* each of *shacheng* and *mayaxiao*.\n\nGrind *shicheng* together with *huangjing* and *huashi* into fine powder, place it in a cauldron, and nurture it with gentle fire for one day until it melts into liquid. After it has liquefied, mix in *mayaxiao* and heat intensely until it turns red. Then, use *shacheng*: first melt it three times into liquid before employing it.\n\nFor larger pieces of luminous cinnabar, crush them to the size of sesame seeds, then place them in an earthen crucible. Add malachite, *shicheng*, and *mayaxiao* with water, and boil vigorously day and night for thirty days without extinguishing the fire. Once the time is complete, wash and settle the cinnabar. Place it in a crucible, refining it with yin and yang fire phases; the crucible should hold one *sheng*.\n\nThere are five types of crucibles: the first is the golden crucible, the second the silver crucible, the third the bronze crucible, the fourth the iron crucible, and the fifth the earthen crucible. Place the cinnabar in the crucible and refine it with yin and yang fire phases.\n\n**Method of Refining with Fire Phases**\nThe formula states: five days make one phase, three phases make one qi, and eight qi—twenty-four phases—complete in one hundred twenty days, at which point the cinnabar is fully refined by fire. For each refinement phase, deduct five days: four days use the *kan* trigram, and one day uses the *gao* trigram. The *kan* trigram entails boiling with water for four days, while the *gao* trigram entails refining with yang fire for one day.\n\nBegin with yang fire, using seven *liang* of charcoal arranged vertically beneath the crucible, keeping the base of the crucible heated. Use exactly seven *liang* of charcoal, neither increasing nor decreasing. After each cycle, add one *liang* of charcoal for the next refinement. After five cycles, black vapor and mercuric frost may emerge; collect the frost and mix it with half a *qian* of melted *shicheng*, grinding it lightly in a mortar with a jade pestle until the mercury is fully absorbed. Then, return it to the crucible and refine it again with *kan* and *gao* fire phases.\n\nAfter twelve cycles, add two *liang* of charcoal for each subsequent cycle. Add one *fen* of melted halite as powder on the surface, with about two *liang* of mercuric frost. When the frost flies out, the crucible will appear empty and luminous, and the elixir’s color will gradually turn yellowish-purple. Collect the frost and mercury, mix them with one *qian* of halite, and grind thoroughly in a mortar. Return it to the crucible and refine it again with the previous fire phases.\n\nAfter eighteen cycles, add three *liang* of charcoal; the elixir’s color will turn red. After twenty cycles, add four *liang* of charcoal for each subsequent cycle. When only half a *liang* or less of mercuric frost remains, it will fly out as hard as blue-gold flakes, radiant with yellow and white luster. Mix it with *shicheng*, grind in a mortar, and return it to the crucible for further refinement. After twenty-four cycles, the cinnabar is fully refined, its color a brilliant red, resplendent to behold.\n\nOnce the cinnabar is refined, wrap it in salt flowers, seal it tightly with yellow clay, and place it in a yang furnace. Heat it vigorously for thirty days, then remove the cinnabar and place it in a bamboo tube. Seal the opening, submerge it in cold spring water, and bury it for thirty days before washing and grinding. The lighter portion may be separated for ingestion, while the heavier portion is melted into golden liquid.\n\nWhen superior luminous cinnabar is refined, its color becomes a vivid red, and after washing and settling, six *liang* of golden-star cinnabar remain, gleaming brilliantly. When medium-grade white horse-tooth cinnabar is refined, its color turns a bright red, yielding four *liang* of golden-star cinnabar. When inferior purple spirit cinnabar is refined, its color becomes a reddish-purple, yielding three *liang* of golden-star cinnabar. For cinnabar of mixed riverbed soils, though its color may turn reddish-purple after refinement, it lacks luster and yields no golden-star cinnabar.\n\nSince ancient times, immortals have refined and ingested true cinnabar to attain the Dao. The finest luminous cinnabar is indeed the true cinnabar. Those of wisdom must carefully select its essence to successfully compound the divine elixir.\n\nAfter refining cinnabar in cold spring water, proceed to melt and forge it to reveal its true treasure.\n\n**Method of Melting and Forging**\nThe formula states: for each *liang* of refined cinnabar, use half a *liang* of salt flowers. First place the salt flowers at the bottom of the cauldron, then add the refined cinnabar. Once the cauldron and cinnabar are uniformly red-hot, forge it a thousand times until golden liquid flows out, called \"white silver,\" while the surface displays a moist, lustrous yellow bloom, radiant beyond description. This is the most authentic treasure of heaven and earth.\n\nFor ingestion, divide one *liang* into three hundred sixty pills, mixing them with jujube pulp. Take one pill daily, consuming one *liang* over a year. Before ingesting these cinnabar pills, one must purify and fast for seven days. At dawn, face east with reverence, sincerely invoking the Three Pure Ones, the Perfected Lord of Purple Tenuity, the True Person of Grand Unity, the immortal officials of former masters, and the spirits of water and fire. Request that this divine cinnabar elixir enter the five viscera, eternally preserving form and spirit to unite with the highest truth.\n\nAfter the invocation, perform seven bows, then ingest the pill. After taking this cinnabar elixir, one must not consume putrid, stale, or accumulated foods, nor any raw or bloody pork, nor witness the impurities of life and death.\n\nThus the scripture states: \"Yang essence delights in purity, while the yin corpse delights in filth.\" One must constantly empty and harmonize the will, purify and cleanse the form, to assist the true qi of the numinous yang. Naturally, the spirit will rejoice and the body will be clear, and the attainment of immortality may then be realized.\n\n**Second Reversion: Precious Cinnabar**\nThe scripture states: \"Those who refine the true unite with the utmost subtlety; those who refine cinnabar unite with the utmost numinosity; those who refine the numinous unite with the utmost spirit; and those who unite with the utmost spirit unite with the Dao. When the Dao is united, one ascends to Jade Clarity and becomes a lofty immortal. Now, refining cinnabar to obtain the precious is the medicine of utmost truth; transforming the precious to generate cinnabar is the wondrous elixir of profound resonance.\"\n\n**Method for Transforming the Precious to Generate Cinnabar:**\nTake four *liang* of white silver from the cinnabar and fashion it into a crucible, placing it within a glazed oil jar that holds one *sheng*. The precious crucible should match the size of the jar’s base. First, take one *liang* of Beiting cinnabar, one *liang* of *shi jian*, and one *fen* of *qilin jie*, grind these three ingredients together, and mix them with bitter wine into a paste. Coat the crucible on all sides, ensuring the medicine is fully applied, then let it dry. Encase it in yellow clay mud to a thickness of one *cun* and two *fen*. Heat it in a husk fire for three seven-day periods, then with white charcoal and a martial fire for two seven-day periods. Remove the mud to retrieve the precious crucible, place it in the jar, and add four *liang* of true mercury—mercury extracted from cinnabar of the same origin, called \"the method of kindred resonance that transforms and generates cinnabar.\" The reason the scriptures of the perfected immortals keep this secret is due to this mother-and-child method, lest the hearts of the vulgar and foolish come to know it.\n\nAfter adding the true mercury to the jar, pour in five *ge* of water, ensuring the jar always contains five *ge* of water without fluctuation. Nurture it with a civil fire for two seven-day periods, until it boils like fish eyes. After the days are complete, add another four *liang* of mercury, and continue nurturing with a civil fire for one seven-day period, then let it dry. Seal the mouth tightly and apply a martial fire to press it for three days. Red and yellow cinnabar will surge forth upon the precious crucible. Collect the cinnabar and replenish the mercury as before. Always maintain eight *liang* of mercury in the jar, neither increasing nor decreasing, and continue using civil and martial fires to nurture and press, generating cinnabar. Collect the cinnabar as it emerges. For every four *liang* of the precious, one *jin* of cinnabar is obtained. The precious will then wither, become brittle, and its essence will be entirely transformed into cinnabar. Only two *liang* of bluish-black ash will remain in the jar.\n\nTake the cinnabar and, following the previous method, boil it with medicinal ingredients for thirty days. Then wash and retrieve the cinnabar, place it in the tripod, and refine it with yin-yang fire cycles—five days per cycle, twenty cycles in total, completing one hundred days. The cinnabar will then be subdued by fire. The amount of charcoal used in the fire cycles should follow the previous method. Once the cinnabar is subdued, do not use it directly; instead, wrap it in salt and heat it to melt and forge. The forging method also follows the previous section. Use salt as the agent to guide the flow of golden liquid. From one *jin* of this precious cinnabar, fifteen *liang* are obtained through refinement. When subdued by fire and forged, thirteen *liang* of yellow-flower silver are produced, its color gradually turning golden with a lustrous sheen, white within and yellow without—this is called yellow-flower silver.\n\nIf this cinnabar is to be ingested, it must first have its fire toxin drawn out by cold springs. The cold spring method involves burying it deep in the earth for thirty days, then retrieving, washing, and grinding it. Mix it with jujube pulp to form pills, making three hundred sixty pills per *liang*. Each day at dawn, face east with reverence and sincerely ingest one pill. After taking this precious cinnabar elixir, one’s thoughts will naturally become tranquil and the spirit clear; turbid qi will not enter, and the will shall not be disturbed. Thus, one gradually ascends the steps toward immortality.\n\n**Third Reversion: Florid Cinnabar**\nThe scripture states: \"When yang’s primordial energy accumulates through practice, the florid qi naturally converges with true essence. When true essence resonates and transforms, the divine elixir may be attained.\" Thus it is said: \"Refining the true to attain the true, the true essence responds universally, transforming into the mysterious cinnabar of golden floridity.\"\n\n**Method for Transforming Precious Cinnabar into Florid Cinnabar:**\nTake four *liang* of yellow-flower silver from the precious cinnabar and fashion it into a crucible, following the previous method to match the size of the jar’s base. Use one *liang* of Pu Prefecture chalcanthite, one *liang* of *shi jian*, and one *liang* of processed cinnabar. Grind these with bitter wine into a paste and coat the crucible on all sides, ensuring the medicine is fully applied. Let it dry, then wrap it in yellow clay mud and heat it in a husk fire for two seven-day periods. Afterward, use white charcoal and a martial fire to heat it for one seven-day period. Remove the mud and retrieve the crucible. Following the previous method, place it in a glazed oil jar, add four *liang* of true mercury and five *ge* of clear water, and nurture it with a civil fire for two seven-day periods. Then add another four *liang* of mercury and nurture it with a civil fire for one seven-day period. Once dry, seal it tightly and apply a martial fire to press it for one day. The cinnabar will surge forth upon the precious crucible, radiant in red and yellow, its brilliance indescribable. Collect the cinnabar and replenish the mercury. When one *jin* of cinnabar is obtained, the quantity is sufficient.\n\nPlace the cinnabar in the tripod and refine it with fire cycles as before—five days per cycle. For the first three days, use the *kan* trigram, boiling with water for three days. For the next two days, use the *qian* trigram, flying with yang fire for two days. Initially, use seven *liang* of charcoal for the yang fire. After each cycle, increase the charcoal by two *liang*. After seven cycles, two *liang* of mercury frost will fly out, its color a radiant yellow, clustered with purple light, adhering to the underside of the tripod’s lid. Collect the frost in a bowl, add one *qian* of Pu Prefecture chalcanthite, mix it with bitter wine and cinnabar, and grind it thoroughly with a jade pestle until fully incorporated. Then return it to the tripod for further refinement.\n\nAfter the sublimation process completes eighteen phases over ninety days, the refined cinnabar will have fully undergone fire-taming without the slightest loss. It may then be smelted and cast. Following the previous method, use saltpetre as a flux to stir the melt, and the precious essence will flow forth—lustrous with azure brilliance, called \"Azure Gold.\" Azure Gold arises as yang essence gradually coalesces, emerging from *dui* to manifest in *zhen*, then cycling through *kun* to return to *li*, marking the full circuit of yang essence’s transformation.\n\nIf this refined cinnabar is to be ingested, first take half a *liang* of elm seeds and two *liang* of raw licorice, decoct them to extract the juice, and boil the cinnabar in a silver vessel for fourteen days. Afterward, strain the cinnabar, place it in a pale green bamboo tube, and bury it deep in the earth for thirty days. Upon retrieval, mix it with jujube pulp to form pills, dividing each *liang* into three hundred sixty. Each morning at dawn, face east, invoke the Three Pure Ones and the Immortal Officials, and then consume the pills. By ingesting this refined cinnabar elixir, one’s cravings and desires will fade, meat and blood will no longer pass the lips, and dwelling in quietude, the spirit will harmonize while the body grows light—gradually attaining fellowship with the Perfected.\n\n**Fourth Return Elixir: Wondrous Transmuted Cinnabar**\nThe scripture states: The *qian* body radiates yang brilliance, its pure essence gradually clarifying. *Gen*’s snow is light and fresh, dissolving the yin spirit. Thus, the Azure Gold’s essence interacts with mercury to generate cinnabar, their vital energies intertwining to form the wondrous—called \"Wondrous Transmuted Cinnabar.\"\n\n**Method for Wondrous Transmuted Cinnabar:**\nTake four *liang* of Azure Gold and forge it into a crucible capable of holding four *ge*. Mix half a *liang* each of red salt, sulfur, *da peng* cinnabar, and one *liang* each of *Bei Ting* cinnabar and Pu Prefecture chalcanthite with bitter wine, grinding them into a paste. Coat the Azure Gold crucible inside and out, then heat it gradually until the medicine is fully absorbed. Once dry, encase it in yellow clay as before, sealing it in a ball. Fire it with chaff for fourteen days, then with white charcoal under strong fire for another seven. Upon completion, remove the clay, extract the crucible, and place it in a flask with four *liang* of pure mercury and five *ge* of water—no more, no less. Nurture it for fourteen days, then add another four *liang* of mercury. Continue with gentle fire for seven more days until dry, seal it tightly, and apply strong fire for one day. The wondrous cinnabar will surge forth, yielding four *liang*. Collect it, add another four *liang* of mercury, and repeat the gentle-fire nurturing until cinnabar forms. Once a total of one *jin* is gathered, the quantity is sufficient.\n\nPlace the cinnabar in the tripod and refine it with fire cycles as before—five days per cycle. For the first two days, use the *kan* trigram, boiling with water for two days. For the next three days, use the *qian* trigram, flying with yang fire for three days. Follow the fire regimen and charcoal increments as described in the refined cinnabar section. After sixteen phases over eighty days, the wondrous cinnabar will have fully undergone fire-taming, its golden stars gleaming with radiant red brilliance—truly the most refined and wondrous cinnabar.\n\nFor smelting and casting, use saltpetre as a flux to induce the golden liquid to flow, forming yellow gold. As the gold solidifies, its hue deepens, lustrous and luminous, its pure essence gradually manifesting. Thus, the scripture states: \"From yin, it returns to yang; from turbidity, it returns to clarity.\" This is the transformation of yang’s primordial essence, merging with the truly wondrous to attain immortality.\n\nIf ingesting, first take half a *liang* of elm seeds, one *liang* of raw licorice, and one *liang* of purple fluorite, decoct them to extract the juice, and boil the cinnabar in a precious vessel for fourteen days. Then place it in a pale green bamboo tube and bury it in a cold spring for thirty days. Upon retrieval, mix it with jujube pulp to form pills, dividing each *liang* into three hundred sixty. Each morning at dawn, consume one pill. Daily ingestion of this wondrous cinnabar will gradually sharpen the mind, dispel turbid qi, and refine the body and spirit to purity, merging with the Perfected and transcending the mortal realm. For those of resolve who grasp the secrets of primordial essence refinement, the Dao of immortality is within reach.\n\n**Fifth Return Elixir: Spirit Cinnabar**\nThe scripture states: Yang virtue spreads its merit and radiates light, moving its primordial essence. Primordial essence flows and transforms into refined cinnabar, which in turn enters the wondrous. The wondrous qi refines further to generate myriad spirits. Thus, the profound and wondrous attainments of the sages grow ever more luminous, resonating with true essence to naturally manifest spiritual transformation.\n\nSpirit Cinnabar arises from the yellow gold within the wondrous cinnabar, interacting with mercury to generate its essence—flaming red with dazzling golden stars, its crimson hue pure and ethereal.\n\n**Method for Spirit Cinnabar:**\nTake eight *liang* of yellow gold from the wondrous cinnabar and forge it into a round tripod capable of holding four *ge*. Use two *liang* of gold for the lid. Inside the tripod, place half a *liang* each of sulfur, red salt, *Bei Ting* cinnabar, and Pu Prefecture chalcanthite. Mix them with bitter wine and grind into a paste, coating the interior of the tripod and lid evenly until the medicine is fully applied. Once dry, encase it in yellow clay, forming a one-*cun*-thick layer. Nurture it with gentle fire on all sides for fourteen days, ensuring it is too hot to touch. After fourteen days, gradually increase to strong fire with white charcoal for another seven, maintaining the flame day and night. After seven days, let it cool, remove the clay, and re-coat the tripod’s exterior with sweet clay to a thickness of two *fen*. Suspend it in a furnace, ensuring the base is open for fire access. Add four *liang* of pure mercury and two *ge* of water to the golden tripod, then seal it with the lid.\n\nMaintain gentle fire for seven days, ensuring five *liang* of glowing charcoal remains beneath the tripod at all times—neither increasing nor decreasing. Continuously replenish water in the tripod, always maintaining two *ge* without allowing it to dry. Attend carefully to the process, lest the moment be lost. After seven days, add another four *liang* of pure mercury, then nurture with gentle fire for another seven days as before. Once dry, tightly seal the opening and apply strong fire for one day. This will produce *ling sha* (red radiant cinnabar), yielding five *liang* of red cinnabar.\n\nThen add five *liang* of pure mercury to the tripod, ensuring the vessel always contains eight *liang* of mercury—neither more nor less. Nurture with gentle fire for seven days, then dry it and seal tightly. Apply strong fire for one day to generate cinnabar. Once formed, collect the cinnabar. Add more pure mercury to the tripod and alternate gentle and strong fire to cultivate further cinnabar. When the cinnabar appears, gather it. From this single tripod, collect a total of thirty *liang* of cinnabar before ceasing, for the quantity is now sufficient.\n\nAfter the gold has yielded its cinnabar, its essence is exhausted, leaving it brittle and dull, weighing only about four *liang*—its vital essence having interacted with the mercury to fully transform into *ling sha*. Thus, the texts speak of \"true mercury,\" which is drawn from its original cinnabar form for use. If refining luminous cinnabar as the medicinal base, extract mercury from it and replenish accordingly. If using *bai ma ya sha* (white horse-tooth cinnabar) as the base, extract mercury from it in turn. If employing *zi ling sha* (purple radiant cinnabar), take mercury from it for the process. Mercury derived from riverbank cinnabar is of mixed type and will not harmonize in *qi*.\n\nFrom one *jin* of luminous cinnabar, fourteen *liang* of mercury may be extracted, flowing bright and white—this is the finest grade, containing only two *liang* of *shi hei* (stone residue). From one *jin* of *bai ma ya sha*, twelve *liang* of mercury may be drawn, containing four *liang* of *shi hei*. From one *jin* of *zi ling sha*, ten *liang* of mercury may be obtained, with six *liang* of *shi hei*. From one *jin* of high-grade transparent cinnabar, only eight and a half *liang* of mercury may be extracted, containing seven and a half *liang* of *shi hei*. *Shi hei* refers to the hollow, blackened residue of fire-stone. After mercury is extracted, about one *liang* of *shi tai* (stone embryo) remains, a pale gray ash.\n\nThe method for extracting mercury from cinnabar was briefly outlined in the previous chapter on precious cinnabar but not exhaustively detailed, hence its reiteration here. The extraction of mercury from cinnabar is enumerated among the superior methods in the preceding chapter on the Golden Elixir. Once thirty *liang* of *ling sha* is collected in the golden tripod, the quantity is sufficient, and no further yin-nurturing is needed. Proceed as in the earlier section, employing the yin-yang fire cycle, with five days as one phase. On the first day, use the *kan* trigram (water) to steam for one day. For the next four days, use the *gao* trigram (yang fire) to refine. Begin the yang fire with nine *liang* of charcoal, increasing by two *liang* with each subsequent cycle. After five cycles, increase by three *liang* per cycle, yielding three *liang* of five-colored *jin hui shuang* (golden radiant frost). Collect the frost and mix it with the cinnabar in a mortar, adding half a *fen* of *Pu Prefecture* chalcanthite and one *fen* of sulfur, grinding thoroughly with bitter wine for half a day. Return the mixture to the tripod and refine using the *kan* and *gao* trigram fire cycles. After fourteen phases—seventy days in total—the frost and cinnabar will be fully refined by fire.\n\nOnce refined, the cinnabar will glow with golden radiance, its hue like pomegranate blossoms, luminous as the sun and moon. All poisonous dragons, serpents, evil spirits, and demons will cower at its sight, unable to raise their eyes. Can anything be more divine? This cinnabar is potent yet difficult to cast. To melt it, first prepare a clean vessel of purified earth, free from impurities. Mix salt flowers with the *ling sha* and grind for two thousand revolutions before melting. Upon melting, the golden liquid will congeal into a vibrant red, called *hong jin* (red gold). *Hong jin* is the blackness of yin’s essence, refined away to reveal the pure yang’s radiance—this is the true gold of yang’s spirit.\n\nFor ingestion, follow the earlier method: boil with *yu gan zi* (elm sweet fruit), raw licorice, and *zi shi ying* (purple fluorite), extracting the juice in a precious vessel for fourteen days. The fire cycle and medicinal quantities should adhere to the previous instructions. Once boiled, place it in a sealed tube, secure the opening, and bury it in a cold spring or underground for twenty days. Then retrieve it, mix with jujube pulp, and form into pills—360 pills per *liang*, each the size of a hemp seed. The *ling sha*’s body will gradually grow heavier.\n\nEach morning, after purifying oneself and facing east, invoke the Three Pure Ones and the True Officials, then pay homage to the ancestral master before ingesting. After consuming this *ling sha* elixir, the heart and spirit will become luminous, perception will penetrate inner and outer realms, the body will emanate red light, and one will merge with the utmost truth.\n\n**Sixth Reversion Elixir: Divine Cinnabar**\nThe scripture states: When subtlety reaches its peak, spirit communicates; when spirit communicates, it attains divinity; when divinity unites, the Dao is complete; when the Dao is complete, the mysterious and true descend, allowing ascent to the Jade Clarity and attainment of high immortality.\n\n*Shen sha* (divine cinnabar) is the congealed essence of the Nine Spirits, the condensed breath of the Treasure Wind, the crystallized radiance of the Mysterious Flower—transformed into divine cinnabar, resplendent in dark and yellow hues, its brilliance dazzling. Thus it is named *shen sha*.\n\n**Method for Refining Divine Cinnabar:**\nTake nine *liang* of the red, radiant gold from the previous *ling sha* and cast it into a precious tripod, capable of holding five *ge*. Use three *liang* of the same gold for the lid. First, place one *liang* each of sulfur, luminous cinnabar, red salt, and *Bei Ting* cinnabar inside the tripod, grinding them with bitter wine into a paste. Coat the interior of the tripod and lid evenly, ensuring the medicine is fully applied.\n\nOnce dry, seal the lid and encase the vessel in yellow clay mud, applying a thickness of two *fen* as the standard. Follow the previous method, nurturing it with gentle fire for two seven-day periods. Then, apply fierce fire to heat it for seven days until it matches the color of the flame. Once cooled, remove the yellow mud and re-coat the exterior of the tripod with sweet clay mud to a thickness of three *fen*. Place the tripod in the furnace, add six *liang* of true mercury into the vessel, and pour in three *ge* of water, replenishing gradually to prevent dryness. Nurture with gentle fire for seven days, then add another three *liang* of mercury. Continue with gentle fire for three more days, then allow it to dry. Seal tightly and secure the closure. Apply fierce fire for two nights, and it will fully transform into divine cinnabar of radiant red light. Collect the cinnabar, then add eight *liang* of mercury, nurturing with gentle fire for seven days before applying fierce fire for two days to produce more cinnabar. Collect the cinnabar, add seven *liang* of mercury, nurture with gentle fire, then apply fierce fire to generate cinnabar. Once the cinnabar forms, collect it, add five *liang* of mercury, and alternate between gentle and fierce fire. Continue until cinnabar is produced. Collect it, then add three *liang* of mercury, following the previous method of alternating gentle and fierce fire. In total, you will have gathered two *jin* and thirty-two *liang* of divine cinnabar—this is sufficient.\n\nPlace the cinnabar into a mortar with four *liang* of sulfur and two *liang* of *Pu Zhou* chalcanthite, grinding them thoroughly for half a day. Then transfer the mixture into a precious gold tripod and refine it with *yang* fire. *Yang* fire refers to the pure fire of the *Li* trigram. Refine it for five days as one cycle. Begin with nine *liang* of charcoal; after each cycle, add two *liang* of charcoal. After each cycle, remove the cinnabar, grind it thoroughly in the mortar, then return it to the tripod for further refinement. After five cycles, add three *liang* of charcoal per cycle. When *jiang jin shuang* (crimson gold frost) emerges, its red brilliance will dazzle the eyes. Collect the frost, mix it with the cinnabar in the mortar, add one *fen* of *Pu Zhou* chalcanthite, and grind thoroughly with bitter wine for half a day. Then return it to the tripod, seal tightly, and refine with fire for twelve cycles over sixty days. The divine cinnabar will have completed its refinement, its color resplendent and radiant, its purple glow penetrating—indescribable in words. If you wish to cast it, follow the method described in the previous *ling sha* section. When combined with *ling hua* (spirit flower) and stirred, it will flow like precious liquid, congealing into red gold, its essence glowing like fire—hence it is called the \"gold of exalted attainment.\"\n\nThe divine cinnabar elixir may now be consumed. Divide each *liang* into 360 pills, forming them with jujube pulp. The method of ingestion follows the previous section. After consuming this divine treasure of divine cinnabar, one will naturally become spiritually attuned, bones lightened, the body luminous, and step into the true realm, ascending as a supreme immortal.\n\n---\n\n**Seventh Return Elixir: Mysterious True Crimson Radiance Cinnabar**\n\nThe scripture states: When the divine treasure is ordained by fate, resonance occurs and the spirit dwells within. By returning to the true and accumulating essence, naturally *xuan shuang* (mysterious frost) and *jiang xue* (crimson snow) arise, surging and circulating. Through circulation, one eternally becomes a transcendent spirit-immortal.\n\nThis *xuan zhen jiang xia sha* (mysterious true crimson radiance cinnabar) is the cinnabar born from nurturing mercury with the red gold of divine cinnabar in a precious tripod. Its cinnabar shimmers with purple radiance and red splendor, its five hues dazzling—thus it is named the cinnabar of mysterious true crimson radiance.\n\n**Method for Refining Treasure-Born Cinnabar:**\nTake one *jin* of the precious gold from the previous divine cinnabar and cast it into a round tripod, capable of holding seven *ge*. Use five *liang* of the same gold for the lid. First, place four *liang* of sulfur, two *liang* of red salt, two *liang* of *Bei Ting* cinnabar, and one *liang* of *da peng* cinnabar inside the tripod, grinding them with bitter wine into a paste. Coat the interior of the tripod evenly, ensuring the medicine is fully applied.\n\nOnce dry, seal the lid and encase the vessel in yellow clay mud to a thickness of one *cun*. Follow the method in the divine cinnabar section, nurturing it with gentle fire for two seven-day periods, then heating it with white charcoal and fierce fire for seven days. Once cooled, remove the mud and re-coat the exterior of the tripod with sweet clay mud to a thickness of two and a half *fen*. Suspend the tripod in the furnace, add twelve *liang* of true mercury into the vessel, and pour in three *ge* of water, ensuring it does not dry out by replenishing gradually. Seal the lid. Nurture with gentle fire for seven days, keeping the top of the tripod comfortably warm to the touch. After seven days, allow it to dry. Seal the opening tightly, then gradually apply fierce fire for three days. Upon opening, the mercury will have fully transformed into *jiang xia* (crimson radiance) mysterious cinnabar. Do not collect the cinnabar yet; instead, add nine *liang* of mercury and follow the previous method of alternating gentle and fierce fire to transform it into cinnabar. When the time is complete, open it—all will have turned to cinnabar. Add another six *liang* of mercury, seal tightly, and apply alternating gentle and fierce fire until the time is fulfilled. Upon opening, it will again have transformed into cinnabar. Add five *liang* of mercury, nurture with gentle fire for seven days, then apply fierce fire for one day to produce the cinnabar. Its red and purple hues, five radiant colors, and misty glow will fill the tripod—thirty-two *liang* in total, precise to the last grain.\n\nCollect the cinnabar and place it in a mortar with seven *liang* of sulfur, grinding it finely with a jade pestle for one day. Then return it to the precious gold tripod of divine cinnabar, seal the opening tightly, and refine it with red *yang* fire for seven days as one cycle. Open it, remove the cinnabar, mix it with one *ge* of bitter wine, and grind thoroughly before returning it to the tripod for further refinement. Each seven-day period constitutes one cycle. Begin with thirteen *liang* of charcoal; after each cycle, add one *liang* of charcoal. By the third cycle, add two *liang* of charcoal per cycle. One to two *liang* of five-colored, light, and fresh *jiang xia shuang* (crimson radiance frost) will fly onto the lid of the tripod, resembling wheat grains in succession—collect it.\n\nCombine the cinnabar in a mortar with half a *liang* of Pu Prefecture chalcanthite and two *ge* of bitter wine, grinding thoroughly before returning it to the tripod for refinement. Each cycle requires inspection; add chalcanthite and bitter wine, grind again, then return it to the tripod for further refinement. After seven cycles—forty-nine days in total—the cinnabar will have fully submitted to the fire. Then apply *wu* fire for one day, using twenty *jin* of charcoal divided into four heaps to burn intensely. Allow it to cool for one day before opening the tripod to behold the darkly true crimson radiance cinnabar. Once the fire-submission is complete, its patterns and hues blaze resplendently, intermingling with radiant light that illuminates sun and moon—truly the most numinous of substances, the cinnabar elixir of ultimate *yang* and primal mystery.\n\nTo smelt this darkly true cinnabar, follow the previous method for divine cinnabar and numinous cinnabar. Use numinous blossoms to harmonize and guide, allowing the precious liquid to flow forth and congeal into a purple glow—this is called \"crimson radiance purple gold.\" If taken as a medicinal elixir, mix it with jujube pulp and form into pills, dividing each *liang* into three hundred and sixty. Each morning at dawn, face east and consume one pill. After ingesting this purple radiance wondrous cinnabar elixir, one will suddenly feel the body lighten and ascend, riding a flying dragon to roam beyond the ten heavens and eight limits—how could this not be the height of carefree joy?\n\nA single pill of this darkly true cinnabar elixir can transmute a *jin* of mercury, lead, tin, copper, or iron into purple-lustered yellow gold, its brilliance and luster beyond description. I, having established this divine teaching, received it from the Mysterious Lord, moved by the worthy and enlightened among the worldly, and thus composed it into seven chapters and two sections. This text originates from the *Great Cavern Treasure Scripture*, specifically the \"Nine Grades of Hidden Writings on Refining the True Wondrous Methods\" revealed by the Immortal Lords. The prohibitions on its transmission are severe; it must not be passed to the unworthy. How could it be shown to the stubborn, violent, perverse, or doubtful—those who are but walking corpses with defiled natures? Such exposure must be deeply avoided, lest the true wonders of the ancient immortals and sages be divulged.\n\nHere ends the *Great Cavern Refining the True Wondrous Methods for Subduing Numinous Cinnabar*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "大洞炼真宝经妙诀 经名：大洞炼真宝经妙诀。 唐玄宗时衡岳道士陈少微撰。 《新唐书·艺文志》着录。 作者自称矜黄龙岩穴中遇至人授以灵砂要诀，因述为灵砂七返诀七篇、金丹至诀二章，并为序论。 徒人分此书为二种，几二卷。 今合并为一。 底本出处：《正统道藏》洞神部众街类。 参考：《云笈七签》卷六八、六九。 大洞炼真宝经修伏灵砂妙诀序 余自天元之初，从衡岳游於黄龙，止于宾府，忽於岩穴之中，遇至真之人，授余灵砂要诀。 至人日：吾自得於许倦君之后，倦君受诀於昊天师，天师本受於同郡丁真人所出也。 假如丹砂之本诀，玄、理深奥，固难思寻。 遂求好道之流，志慕神倦之倡，不究竟其真原，长沉沦於尘俗，自上古传经文，皆幽密隐蔽藏言，不流传於世。 余常愍然。 今述为灵砂七返七篇，及金丹至诀二章，并为序论，以示后人同志之士者也。 灵砂七返论曰：丹砂者，太阳之至精，金火之正体也。 通於八石，应二十四气。 丹者是金，感於火，名之为丹。 汞者是火，去於金，而名之为汞。 丹者受阳精而候足，汞即离本质而体不全。 故丹砂是金火之精，而结成形，含玄元澄正之真气也，此是还丹之基本，大药之根原。 德含则万象生焉，体离而杳冥难测。 经曰：阳精赫赫，得之可以还魂反魄。 故知饵阳精者，所以长生。 服阴魄者，而为死鬼。 丹砂是正阳之主，赤帝之君，据於南方，火之正位也。 只如丹砂之体数种，受气不同，唯三种堪为至药。 上者光明砂，中者白马牙砂，下者紫灵砂，余有溪土杂类之砂，不中入至药，服饵所用。 且光明砂一两，服之力敌白马牙砂四两。 白马牙砂一两，服之力敌紫灵砂八两。 如溪砂土砂之力，不可比量也。 或日．．一等是丹砂，俱受太阳之精气，因何有溪土杂类之砂，力有大小者。 言光明砂者，受太阳清通澄朗正真之精气降结，而红光曜曜，名日光明砂。 白马牙砂者，受太阳平和柔顺之精气降结，而白光璨璨，如云母色者，名曰白马牙砂。 紫灵砂者，半受山泽之灵气结，而色红紫，名曰紫灵砂。 如溪土杂类之砂，俱受浊滞不真之气，结而成砂，即混沌无精光，故不中入至药所用。 且如光明砂一斤，伏炼而得十四两，伏火鼓得至宝七两。 白马牙砂一斤，伏炼而得十二两，伏火鼓得至宝六两。 紫灵砂一斤，伏炼而得十两，伏火鼓得至宝四两。 溪砂土砂杂色之砂一斤，伏炼可得六七两，伏火鼓下得至宝一二两。 以来明知溪土之砂，受气不清，澄浊参杂。 高上贤明之士，先拣其砂，次调火候，在意消息，而成七返九还。 且金石之中，至灵至圣，至神至明，而无过於丹砂者，也。 怀袖致之一两，尚自辟去邪魔，况乎伏炼，入於五脏者哉。 且如七返九还，异名而同体。 返者是砂化为金，还者是金归於丹。 经曰：返我乡，归我常，服之白日朝玉皇。 或日：七返者，是丹砂，属火变炼成金，便名为七返者乎。 论日：火之成数是七，七度变转，以应阳元之极体也。 且七度变转者，将丹砂伏炼得伏火后，鼓成白银，即是一返。 将白银化出砂，令伏火鼓成黄花银，即是二返。 将黄花银化出砂，伏火鼓成青金，即是三返。 将青金变化出砂，伏火鼓成黄金，即是四返。",
      "translated_text": "**The Wondrous Secrets of the *Great Cavern Scripture of Refining the True* – Preface and Treatise on the Sevenfold Reversion of Divine Cinnabar**\n\n**Title:** *The Wondrous Secrets of the Great Cavern Scripture of Refining the True*\nComposed by Chen Shaowei, a Daoist of Mount Heng during the reign of Emperor Xuanzong of Tang. Recorded in the *New Tang Book · Treatise on Arts and Letters*. The author claims to have encountered a perfected being in the Yellow Dragon Grotto, who transmitted to him the essential secrets of divine cinnabar. He thus set forth the *Sevenfold Reversion Secrets of Divine Cinnabar* in seven chapters and the *Supreme Secrets of the Golden Elixir* in two sections, along with a preface and treatise. Later disciples divided this work into two parts, nearly two scrolls in total. Here, they are combined into one. Source of the base text: *Daoist Canon of the Zhengtong Era*, *Section of the Cavernous Spirit*, *Category of Various Arts*. For reference, see *Seven Lots from the Cloudy Satchel*, Scrolls 68 and 69.\n\n---\n\n**Preface to the Wondrous Secrets of Refining and Subduing Divine Cinnabar**\n\nSince the beginning of the Tianyuan era, I have wandered Mount Heng and sojourned in the Yellow Dragon’s abode. Suddenly, within a rocky cavern, I encountered a perfected and true being, who bestowed upon me the essential secrets of divine cinnabar.\n\nThe perfected one said: \"I received this from Master Xu Juankun, who was taught by the Heavenly Master Wu. The Heavenly Master originally received it from the Realized One Ding of the same prefecture. The fundamental secrets of cinnabar elixirs are profound and abstruse in their mystery and principle, truly difficult to fathom. Thus, those who seek the Dao and aspire to the divine arts of the immortals, failing to penetrate their true origin, remain long mired in the dust of the world. Since ancient times, the transmitted scriptures have been veiled in obscurity, their words concealed, never disseminated among the world. I have long been moved by this. Now, I set forth the *Sevenfold Reversion of Divine Cinnabar* in seven chapters, along with the *Supreme Secrets of the Golden Elixir* in two sections, and compose this preface and treatise, to be shown to those of like aspiration in later generations.\"\n\n---\n\n**Treatise on the Sevenfold Reversion of Divine Cinnabar**\n\nCinnabar is the supreme essence of the Great Yang, the true embodiment of metal and fire. It harmonizes with the eight minerals and corresponds to the twenty-four qi. That which is called \"cinnabar\" is metal, transformed by fire, and thus named \"cinnabar.\" That which is called \"mercury\" is fire, separated from metal, and thus named \"mercury.\" Cinnabar receives the essence of Yang and awaits its fulfillment, while mercury departs from its original substance and its body is incomplete. Thus, cinnabar is the essence of metal and fire, coalescing into form, containing the true qi of the mysterious and primordial, the upright and pure. This is the foundation of the returning elixir, the root origin of the great medicine. When its virtue is contained, the myriad images arise; when its body departs, it becomes obscure and unfathomable.\n\nThe scripture says: \"The radiant essence of Yang—obtaining it, one may restore the hun-soul and return the po-soul.\" Thus, it is known that consuming the essence of Yang grants longevity, while ingesting the yin po leads to death as a ghost. Cinnabar is the lord of the true Yang, the sovereign of the Red Emperor, enthroned in the south, the rightful position of fire.\n\nNow, the forms of cinnabar are manifold, each receiving qi differently. Only three kinds are fit for the supreme medicine: the finest is luminous cinnabar; the middle grade is white horse-tooth cinnabar; and the lowest is purple divine cinnabar. Other varieties, such as river cinnabar and earthen cinnabar, are unfit for the supreme medicine or for ingestion.\n\nOne tael of luminous cinnabar is equal in potency to four taels of white horse-tooth cinnabar. One tael of white horse-tooth cinnabar is equal in potency to eight taels of purple divine cinnabar. The potency of river cinnabar and earthen cinnabar cannot be compared.\n\nSome may ask: \"If all cinnabar receives the essence of the Great Yang, why do river and earthen cinnabars differ in potency?\" Luminous cinnabar receives the pure, clear, and luminous essence of the Great Yang, descending to coalesce into a radiant red glow—hence its name. White horse-tooth cinnabar receives the balanced and gentle essence of the Great Yang, descending to form a sparkling white luster like mica—hence its name. Purple divine cinnabar is half-formed by the numinous qi of mountains and marshes, its color a reddish-purple—hence its name. River and earthen cinnabars, however, receive turbid and impure qi, coalescing into a muddled, dull form devoid of essence—thus unfit for the supreme medicine.\n\nFor instance, refining one catty of luminous cinnabar yields fourteen taels, and through fire refinement, seven taels of the supreme treasure are obtained. Refining one catty of white horse-tooth cinnabar yields twelve taels, and through fire refinement, six taels of the supreme treasure are obtained. Refining one catty of purple divine cinnabar yields ten taels, and through fire refinement, four taels of the supreme treasure are obtained. Refining one catty of river or earthen cinnabar yields six or seven taels, and through fire refinement, only one or two taels of the supreme treasure are obtained. From this, it is clear that river and earthen cinnabars receive impure qi, mingled with turbidity. The wise and discerning first select the cinnabar, then regulate the fire, carefully attending to the process to achieve the seven reversions and nine returns.\n\nAmong metals and stones, none are as numinous, sagely, divine, or luminous as cinnabar. Carrying even one tael in one’s sleeve repels demons and evil spirits—how much more so when refined and ingested, entering the five viscera!\n\nNow, the seven reversions and nine returns are different names for the same body. \"Reversion\" is cinnabar transformed into metal; \"return\" is metal restored to cinnabar. The scripture says: \"Return to my homeland, restore my constancy—ingesting it, one ascends in broad daylight to the Jade Emperor.\"\n\nSome may ask: \"Is the sevenfold reversion cinnabar, belonging to fire, refined into metal, and thus called the sevenfold reversion?\" The treatise states: The completion number of fire is seven. Seven transformations correspond to the ultimate embodiment of Yang. The seven transformations proceed as follows:\n\nAfter refining cinnabar to obtain the subdued fire, it is smelted into white silver—this is the first reversion. The white silver is transformed to extract cinnabar, which is smelted with subdued fire into yellow-flowered silver—this is the second reversion. The yellow-flowered silver is transformed to extract cinnabar, which is smelted with subdued fire into azure gold—this is the third reversion. The azure gold is transformed to extract cinnabar, which is smelted with subdued fire into yellow gold—this is the fourth reversion. [...]",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1218,
      "start_sentence": 0,
      "end_sentence": 53,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.6580023765564,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大洞炼真宝经修伏灵砂妙诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "将黄金化出红砂，伏火鼓成红金，即是五返。 将红金还化出砂，伏火鼓成赤金，即是六返。 将赤金复化为砂，伏火鼓成紫金，至紫金，即是七返灵砂之金，而含积阳，真元之精气足矣。 而将紫金变化为砂，运火烧之一周，迥然通彻洞耀，名曰紫金还丹。 得服之者，形神俱合，当日轻举。 且世人多误取石硫黄，呼为太阳之至精，和汞而烧七返。 且硫黄受孤阳偏石之气，汞又离於元和，二物俱偏，如何得成正真之宝。 切见世人伏炼众多，终无成者，盖绿迷迷相传，至於后世。 余甚哀之。 只如第一返伏火丹砂，服饵一两，即去万病。 服之二两，即须发青绿。 服之三两，即颜悦色红。 服之四两，即延年益寿。 第二返药，服之一两，即体和神清，返老归童。 第三返药，服之一两，即虚夷忘情，心合至精。 第四返药，服之一两，即身体明彻，通於表裹。 第五返药，服之一两，入水不能溺，入火不能焦。 第六返药，服之一两，即造化不能移，鬼神不能知。 第七返药，服之一两，即超然於九天之上，逍遥乎宇宙之问。 更服至红英九丹，便居金阙，功位真人。 故知丹砂之力，昭然而可观乎。 自余得其真旨。 常欲周济为功，大道垂明，咸愿同归玄境。 遂作灵砂七篇，金丹二章，并述火候次第，药物品次，篇数高下，列之於后章别品，以授贤明至诚。 君子得之宝之，即福寿无疆。 轻泄之人，殃其九祖。 亦不可诬言而蔽道，慎莫写示於凡情。 用测贤愚，可鉴而后授之此篇章矣。 大洞炼真宝经修伏灵砂妙诀 衡岳真人陈少微字子明撰 灵砂七返篇 第一返丹砂",
      "translated_text": "The yellow gold is transformed to extract red cinnabar, which is smelted with subdued fire into red gold—this is the fifth reversion. The red gold is reverted to extract cinnabar, which is smelted with subdued fire into crimson gold—this is the sixth reversion. The crimson gold is once more transformed into cinnabar, which is smelted with subdued fire into purple gold. Upon reaching purple gold, it becomes the seventh-reversion numinous-cinnabar gold, replete with accumulated Yang and suffused with the essence of true primordial qi.\n\nWhen purple gold is transformed back into cinnabar and refined with fire through one full cycle, it becomes radiantly translucent and luminous, called *Purple Gold Reverted Elixir*. Those who ingest it achieve the union of form and spirit, ascending lightly on the very same day.\n\nYet many in the world mistakenly take mineral sulfur, calling it the supreme essence of Grand Yang, and combine it with mercury to refine the seven reversions. Sulfur, however, bears the solitary Yang of mineral and stone, while mercury has departed from its original harmony—both substances are partial and imbalanced. How then can they yield a true and perfect treasure? I have observed that while many attempt refinement, none succeed in the end, for they blindly follow inherited errors down to later generations. I grieve deeply for this.\n\nConsider, for instance, the first-reversion subdued-fire cinnabar: ingesting one *liang* dispels ten thousand illnesses; two *liang* turns hair and beard black; three *liang* brings a rosy complexion; four *liang* extends years and augments longevity. The second-reversion medicine, when taken in one *liang*, harmonizes the body and clarifies the spirit, reversing age to return to youth. The third-reversion medicine, in one *liang*, induces emptiness and detachment, uniting the heart with ultimate essence. The fourth-reversion medicine, in one *liang*, renders the body translucent, penetrating both exterior and interior. The fifth-reversion medicine, in one *liang*, enables one to enter water without drowning or fire without burning. The sixth-reversion medicine, in one *liang*, renders one unshaken by transformation and unknown to spirits. The seventh-reversion medicine, in one *liang*, elevates one beyond the Nine Heavens, roaming freely between heaven and earth. Further ingestion of the *Crimson Floret Ninefold Elixir* allows one to dwell in the Golden Towers, attaining the rank of Perfected.\n\nThus, the power of cinnabar is manifest and observable. Having grasped its true principle, I have long wished to aid others as an act of merit, illuminating the great Dao so that all may together return to the mysterious realm. Therefore, I composed the *Seven Chapters on Numinous Cinnabar* and the *Two Chapters on the Golden Elixir*, along with detailed accounts of fire phases, the sequence of medicinal substances, the hierarchy of chapters, and their respective categories—all arranged in subsequent sections to be bestowed upon the worthy and sincere.\n\nThose of virtue who obtain these teachings must treasure them, for they bring boundless fortune and longevity. Those who recklessly divulge them shall bring calamity upon nine generations of ancestors. One must not deceive with false words nor obscure the Dao; take care not to transcribe and show them to the unworthy. Test the wise and the foolish, and only after discernment bestow these chapters.\n\n*The Precious Scripture of Great Pervasion on Refining the True and Subduing Numinous Cinnabar: Wondrous Instructions*\n*Composed by Chen Shaowei, styled Ziming, the Perfected of Mount Heng*\n\n*Seven Reversions of Numinous Cinnabar*\n*First Reversion: Cinnabar*",
      "overlap_context": "bdued fire, it is smelted into white silver—this is the first reversion. The white silver is transformed to extract cinnabar, which is smelted with subdued fire into yellow-flowered silver—this is the second reversion. The yellow-flowered silver is transformed to extract cinnabar, which is smelted with subdued fire into azure gold—this is the third reversion. The azure gold is transformed to extract cinnabar, which is smelted with subdued fire into yellow gold—this is the fourth reversion. [...]",
      "start_char": 1218,
      "end_char": 1824,
      "start_sentence": 54,
      "end_sentence": 85,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.359726905822754,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大洞炼真宝经修伏灵砂妙诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "经曰：丹砂者，万灵之主，造化之根，神明之本。 而居九清，玄播总御，动之以高体，定之则乾成，能变化者，故号日赤龙。 若翱翔而名为朱乌。 上品者生於辰锦石穴之中，而有数色。 中品者生於交桂，亦有数类。 下品者生於衡邵，数种品类。 皆绿清浊体别，真邪不同，降气分精，感通金石。 受正气者，服之而通玄契真，为上倦矣。 受偏气者，服之亦得长生留世。 且上品光明砂者，出於辰、锦山石之中，白交石肺之上，十二枚为一座，生色如未开红莲花，光明曜日。 亦有九枚、七枚、五枚、三枚、一枚为座者。 十二枚、九枚最灵，七枚、五枚生者其次。 每一座中有一大珠，可重十余两，为主君，四面小者，亦重八九两，亦有六七两已下者，为臣周绕，朝揖中心大者，於座四面，又有杂砂一二斗，回抱其玉座朱肺，於其座外。 杂砂中拣得芙蓉头成就，夜安红绢上，光明通彻者，亦入上品。 又有如马牙，外白浮光明者，是上品白马牙砂。 有如云母片白光者，是中品白马牙砂。 圆长似笑生，而红紫色者，即上品紫灵砂。 若如石片棱角生青光者，是下品紫灵砂，如交、桂所出。 但是座生及打石中得者，形如芙蓉头成，而光明者，亦入上品。 如颗粒成三数枚，重一斤通明者，为中品。 片段成明彻者，为下品，如衡、邵所出。 总是紫砂，及打石中得而红光者，亦是下品之砂。 如溪砂有颗粒成而通明者，伏炼饵之，亦得长生留世，未得为上仙矣。 如砂生於土穴之中，溪砂养於溪水土之内，而土石相杂，故不中入上药服食所用。 如座生者，是最上品之砂。 得其座中心主君砂一枚，伏炼入於五藏，则功勋便着，名上丹台，正气长存，超然绝累。 更服至七返九还，自然魄化尸灭，神夷体清，阴气都销，则含形而轻举，永为上真之飞仙也。 故知阳之真精，降气而圆光周满，无有偏邪。 但是伏炼之砂，作芙蓉头成，而圆光通明者，即是上品，神仙服饵之药。 经日：丹砂者，自然之还丹也。 世俗莫测其原，只如玉座之砂。 世人总知之，如金座天座。 是太上紫龙玄华之丹，非俗人凡夫之所见知也。 其玉座则俗流志士，积功修炼，服之致仙。 其金座则宿有仙骨，清虚炼神，隐之岩穴，则其神仙，采与食之，便当日羽化升腾。 其天座则太上天仙真官，而所收采服饵，非下仙之药也。 其玉座砂，受得六千年阳灵之清精，则化为金座。 金座则座黄，当中有五枚层层生，四面四十、五十小珠，周绕金座。 受一万六千年，则化为天座。 天座则座碧，当中有九枚层层而生，四面七十二枚周抱。 在於飘飘太虚之中，常有太一之神护持。 上元之日，真官下采，其山忽开，光明照曜，一山如火。 其天座砂，真官所收，后世人不可得取采之也。 故丹砂之元邈，若高山上贤明士志慕轻举者，切须辨其药品高下，然后调其火候，合其阴阳，伏制自然，而契於高真矣。 阴阳伏制及火候飞伏诀 经曰：阳精火也，阴精水也。 阴阳伏制，水火相持。 故知冰炭不同处，衰盛终有归。 且丹砂是阳精，而须阴制，阴制者水也。 当用曾青、空青、石盛、马牙硝、玄英、化石各是也。 如玉座光明砂一斤，制之用曾青四两，石盥六两，马牙硝六两，黄英、化石各二两。",
      "translated_text": "The Scripture states: Cinnabar is the lord of all numinous beings, the root of creation and transformation, the foundation of spirit and illumination. Dwelling in the Ninefold Purity, it governs and commands all through the Mysterious Pervasion. When moved, it ascends in its lofty form; when stabilized, it achieves the perfection of Qian. Capable of transformation, it is thus named the Crimson Dragon. When soaring, it is called the Vermilion Bird.\n\nThe finest grade is born in the stone caves of Chen and Jin, appearing in several colors. The middle grade grows in Jiaozhou and Guizhou, also in several varieties. The lowest grade originates in Hengzhou and Shaozhou, with numerous types and classes. All differ in purity and turbidity, their true or spurious nature distinct, their descending qi and refined essence resonating with metals and stones. Those that receive the upright qi, when ingested, harmonize with the profound and unite with the true, becoming the highest attainment. Those that receive partial qi, when ingested, also attain longevity and remain in the world.\n\nMoreover, the finest luminous cinnabar emerges from the mountains and stones of Chen and Jin, atop the white Jiaoshi lungs, twelve pieces forming a seat, their color like an unopened red lotus, radiant and sunlike. There are also seats of nine, seven, five, three, or one piece. Those of twelve or nine pieces are most potent; those of seven or five pieces are next in efficacy. Within each seat, there is one large pearl weighing over ten taels, serving as the sovereign. Surrounding it are smaller ones, also weighing eight or nine taels, or even six or seven taels, acting as ministers in attendance, paying homage to the central sovereign. On the four sides of the seat, there are one or two *dou* of miscellaneous cinnabar, encircling the jade seat and the cinnabar lungs. From this miscellaneous cinnabar, one may select pieces shaped like hibiscus buds, fully formed; when placed on red silk at night, their luminosity penetrates through—these also belong to the finest grade.\n\nThere is also a type resembling horse teeth, with a white exterior and floating radiance—this is the finest white horse-tooth cinnabar. Another, like mica flakes with white light, is the middle-grade white horse-tooth cinnabar. Those round and elongated, resembling laughter, with a red-purple hue, are the finest purple numinous cinnabar. If they resemble stone flakes with angular edges and emit a greenish light, they are the lowest-grade purple numinous cinnabar, such as those from Jiao and Gui. However, if found in seats or within stones, shaped like hibiscus buds and luminous, they also belong to the finest grade. If formed in clusters of three or more pieces, weighing a *jin* and translucent, they are of the middle grade. Those in fragments, clear and bright, are of the lowest grade, like those from Heng and Shao. All purple cinnabar, or that extracted from stones with a red glow, are also of the lowest grade. River cinnabar, formed in granules and translucent, when refined and ingested, also grants longevity and permanence in the world, though it does not elevate one to the rank of highest immortality.\n\nCinnabar born in earthen caves and river cinnabar nurtured in the soil and water of streams, mixed with earth and stone, are unsuitable for use in superior medicinal preparations. The seat-born cinnabar is the finest of all. Obtaining one sovereign piece from the center of the seat, refining it, and incorporating it into the five viscera brings immediate merit, elevating one to the Upper Terrace of Cinnabar. With upright qi ever abiding, one transcends all entanglements. Further ingestion through the seven reversions and nine refinements naturally dissolves the corporeal soul, annihilates the mortal form, purifies the spirit-body, and entirely dispels yin qi. Thus, one embraces form yet ascends lightly, forever becoming a flying immortal of the highest truth.\n\nThus, it is known that the true essence of yang descends as qi, its round radiance complete and without partiality or deviation. Any refined cinnabar shaped like a hibiscus bud, with round and penetrating luminosity, is of the finest grade—the elixir ingested by divine immortals.\n\nThe Scripture states: Cinnabar is the natural reverted elixir. The world cannot fathom its origin. Even the cinnabar of the jade seat is known to all, such as the gold seat and the celestial seat. These are the cinnabar of the Supreme Purple Dragon and Mysterious Flower, not to be seen or known by common folk or ordinary men. The jade seat is for scholars and aspirants who accumulate merit and refine themselves through practice; its ingestion leads to immortality. The gold seat is for those with innate immortal bones, who cultivate emptiness and refine the spirit, dwelling in mountain caves. When immortals gather and consume it, they ascend and transform on the very same day. The celestial seat is reserved for the true officials of the Supreme Heavenly Immortals; its collection and ingestion are not the province of lesser immortals.\n\nThe cinnabar of the jade seat, having received the pure essence of six thousand years of yang numinosity, transforms into the gold seat. The gold seat is golden, with five pieces growing in layers at its center, surrounded by forty or fifty small pearls. After sixteen thousand years, it transforms into the celestial seat. The celestial seat is jade-green, with nine pieces growing in layers at its center, encircled by seventy-two pieces. It resides in the boundless void, perpetually guarded by the spirit of the Great One. On the day of the Upper Prime, true officials descend to gather it. The mountain suddenly opens, its radiance illuminating all, the entire mountain aflame. The cinnabar of the celestial seat is collected by true officials; later generations cannot obtain or gather it.\n\nThus, the origin of cinnabar is profound and remote. For those of lofty aspiration who yearn for light ascent, it is essential to discern the grades of the elixir, then regulate the fire phases, harmonize yin and yang, and refine it naturally to unite with the highest truth.\n\n**On the Refinement of Yin and Yang and the Secrets of Fire Phases**\n\nThe Scripture states: Yang essence is fire; yin essence is water. The refinement of yin and yang entails the mutual restraint of water and fire. Thus, it is known that ice and charcoal cannot coexist, and decline and flourishing ultimately find their resolution. Moreover, cinnabar is yang essence and requires yin to restrain it; the restraining agent is water. One should use azurite, malachite, *shicheng*, *mayaxiao*, *xuanjing*, and *huashi*. For one *jin* of luminous jade-seat cinnabar, refine it with four *liang* of azurite, six *liang* of *shicheng*, six *liang* of *mayaxiao*, and two *liang* each of *huangjing* and *huashi*.",
      "overlap_context": "amity upon nine generations of ancestors. One must not deceive with false words nor obscure the Dao; take care not to transcribe and show them to the unworthy. Test the wise and the foolish, and only after discernment bestow these chapters.\n\n*The Precious Scripture of Great Pervasion on Refining the True and Subduing Numinous Cinnabar: Wondrous Instructions*\n*Composed by Chen Shaowei, styled Ziming, the Perfected of Mount Heng*\n\n*Seven Reversions of Numinous Cinnabar*\n*First Reversion: Cinnabar*",
      "start_char": 1824,
      "end_char": 3041,
      "start_sentence": 86,
      "end_sentence": 136,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.817718744277954,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大洞炼真宝经修伏灵砂妙诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "座外生光明砂一斤，可用曾青五两，石盐及马牙硝各四两，黄英、化石各一两。 白马牙砂一斤，用石盥、马牙硝各三两，黄英、化石各三分。 紫灵砂一斤，可用空青四两，石盥、马牙硝各二两，黄英、化石各二分。 如溪土杂类之砂力小，每斤可用曾青四两，沙盥及马牙硝各二两，制之而得。 其石盥和黄英、化石，细研为粉，入锅中，文火养一日，即鼓成汁。 成汁后和马牙硝，重烧令赤。 然可以用沙盛，先须三鼓成汁，后方可入用之。 其光明砂大者，须打碎如麻颗许，然后入於土釜中，下曾空、石盥、马牙硝，和水，武火昼夜煮三十日，不得火绝。 日满淘澄取砂。 入於鼎中，用阴阳火候飞伏，其鼎可受一升。 且鼎者有五，一曰金鼎，二曰银鼎，三曰铜鼎，四曰铁鼎，五日土鼎，入砂於鼎中，用阴阳火候飞伏。 飞伏法。 诀曰：五日为一候，三候为一气，用八气二十四候，一百二十日而砂伏火毕矣。 每一飞伏，去五日，内四日用坎卦，一日用高卦。 坎卦者，水煮四日是。 高卦者，阳火飞之一日。 初起阳火，用炭七两，竖安鼎下，常令鼎下熟。 炭七两，不得增少。 每一转后，即增炭一两飞之。 增炭至五转后，忽有黑气，和汞霜飞出。 即收霜，和鼓了石盥半钱重，於钵中，以玉槌轻手研之，令汞入尽。 即依前，却安鼎中，用坎高火候飞伏之。 至十二转后，每转加炭二两。 使入鼓了石盐一分，作粉铺安面上，合有汞霜，可二两，候飞出其霜，虚光鼎中，药色渐欲黄紫。 收其霜及汞，和石盐一钱重，於钵中熟研了。 入鼎，依前火候飞伏。 伏至十八转，加炭三两，其药色欲赤。 至二十转后，每转增炭四两，只有半两已下，汞霜飞出，坚硬如青金片，黄白光明。 亦和石盥，於钵中研之，入鼎飞伏。 伏至二十四转，其砂候足，伏火毕矣。 而色红赫，光明可观。 其砂伏了，更须用盐花包之，重以黄土为泥，曩紧固济。 入阳炉，武火白烧之三十日，后出砂，安淡竹筒中，封闭其口，入寒泉中，深埋三十日，然后淘研。 轻飞者可以分抽服饵，沈重者即鼓成金汁。 且上光明砂伏火了，其色红赫，淘澄下可有金星砂六两，光明璀璨。 中品白马牙砂伏火了，色赤红鲜，淘澄下有金星砂四两。 下品紫灵砂伏火了，色稍紫赤，淘澄下亦有金星砂三两。 如溪土杂色之砂伏火了，而色虽紫赤，亦无光彩，不可见金星砂一粒耳。 自上古高仙，皆炼服其真丹砂，而成道也。 其上品光明砂者，即是真丹砂也。 贤明之者，须在意采索其真精，然可得合於灵丹耳。 且如伏火丹砂，出寒泉了，可便镕鼓，令见真宝。 镕鼓。 诀日：每一两伏火丹砂，可用盥花半两。 先致盐花於锅底，次入伏火砂於锅中，候锅及砂匀火同赤，然后鼓之千下，而金汁流下，名曰白银，而面上黄花漠漠润泽，光芒可言。 此是天地之中至真之宝也。 如将服饵，分抽取一两，作三百六十丸，用枣肉和之为丸。 每日服一丸，一年服一两。 欲服此丹砂丸，先须洁斋七日，然以晨朝束向，虔心扣请。 告三清、紫微真君，太一真人，先师仙官，水火之灵。 得服此灵砂丹於五内，永保形神，合其至真。 呎毕，礼七拜，然后服之。 自服此砂丹。 不得吃臭秽陈积之物，及诸生血豕属之肉，生死之秽，尤不可观。",
      "translated_text": "For one *jin* of externally luminous cinnabar, refine it with five *liang* of azurite, four *liang* each of halite and *mayaxiao*, and one *liang* each of *huangjing* and *huashi*. For one *jin* of white horse-tooth cinnabar, use three *liang* each of *shicheng* and *mayaxiao*, and three *fen* each of *huangjing* and *huashi*. For one *jin* of purple spirit cinnabar, refine it with four *liang* of malachite, two *liang* each of *shicheng* and *mayaxiao*, and two *fen* each of *huangjing* and *huashi*. For cinnabar of inferior quality from riverbeds and mixed soils, refine each *jin* with four *liang* of azurite and two *liang* each of *shacheng* and *mayaxiao*.\n\nGrind *shicheng* together with *huangjing* and *huashi* into fine powder, place it in a cauldron, and nurture it with gentle fire for one day until it melts into liquid. After it has liquefied, mix in *mayaxiao* and heat intensely until it turns red. Then, use *shacheng*: first melt it three times into liquid before employing it.\n\nFor larger pieces of luminous cinnabar, crush them to the size of sesame seeds, then place them in an earthen crucible. Add malachite, *shicheng*, and *mayaxiao* with water, and boil vigorously day and night for thirty days without extinguishing the fire. Once the time is complete, wash and settle the cinnabar. Place it in a crucible, refining it with yin and yang fire phases; the crucible should hold one *sheng*.\n\nThere are five types of crucibles: the first is the golden crucible, the second the silver crucible, the third the bronze crucible, the fourth the iron crucible, and the fifth the earthen crucible. Place the cinnabar in the crucible and refine it with yin and yang fire phases.\n\n**Method of Refining with Fire Phases**\nThe formula states: five days make one phase, three phases make one qi, and eight qi—twenty-four phases—complete in one hundred twenty days, at which point the cinnabar is fully refined by fire. For each refinement phase, deduct five days: four days use the *kan* trigram, and one day uses the *gao* trigram. The *kan* trigram entails boiling with water for four days, while the *gao* trigram entails refining with yang fire for one day.\n\nBegin with yang fire, using seven *liang* of charcoal arranged vertically beneath the crucible, keeping the base of the crucible heated. Use exactly seven *liang* of charcoal, neither increasing nor decreasing. After each cycle, add one *liang* of charcoal for the next refinement. After five cycles, black vapor and mercuric frost may emerge; collect the frost and mix it with half a *qian* of melted *shicheng*, grinding it lightly in a mortar with a jade pestle until the mercury is fully absorbed. Then, return it to the crucible and refine it again with *kan* and *gao* fire phases.\n\nAfter twelve cycles, add two *liang* of charcoal for each subsequent cycle. Add one *fen* of melted halite as powder on the surface, with about two *liang* of mercuric frost. When the frost flies out, the crucible will appear empty and luminous, and the elixir’s color will gradually turn yellowish-purple. Collect the frost and mercury, mix them with one *qian* of halite, and grind thoroughly in a mortar. Return it to the crucible and refine it again with the previous fire phases.\n\nAfter eighteen cycles, add three *liang* of charcoal; the elixir’s color will turn red. After twenty cycles, add four *liang* of charcoal for each subsequent cycle. When only half a *liang* or less of mercuric frost remains, it will fly out as hard as blue-gold flakes, radiant with yellow and white luster. Mix it with *shicheng*, grind in a mortar, and return it to the crucible for further refinement. After twenty-four cycles, the cinnabar is fully refined, its color a brilliant red, resplendent to behold.\n\nOnce the cinnabar is refined, wrap it in salt flowers, seal it tightly with yellow clay, and place it in a yang furnace. Heat it vigorously for thirty days, then remove the cinnabar and place it in a bamboo tube. Seal the opening, submerge it in cold spring water, and bury it for thirty days before washing and grinding. The lighter portion may be separated for ingestion, while the heavier portion is melted into golden liquid.\n\nWhen superior luminous cinnabar is refined, its color becomes a vivid red, and after washing and settling, six *liang* of golden-star cinnabar remain, gleaming brilliantly. When medium-grade white horse-tooth cinnabar is refined, its color turns a bright red, yielding four *liang* of golden-star cinnabar. When inferior purple spirit cinnabar is refined, its color becomes a reddish-purple, yielding three *liang* of golden-star cinnabar. For cinnabar of mixed riverbed soils, though its color may turn reddish-purple after refinement, it lacks luster and yields no golden-star cinnabar.\n\nSince ancient times, immortals have refined and ingested true cinnabar to attain the Dao. The finest luminous cinnabar is indeed the true cinnabar. Those of wisdom must carefully select its essence to successfully compound the divine elixir.\n\nAfter refining cinnabar in cold spring water, proceed to melt and forge it to reveal its true treasure.\n\n**Method of Melting and Forging**\nThe formula states: for each *liang* of refined cinnabar, use half a *liang* of salt flowers. First place the salt flowers at the bottom of the cauldron, then add the refined cinnabar. Once the cauldron and cinnabar are uniformly red-hot, forge it a thousand times until golden liquid flows out, called \"white silver,\" while the surface displays a moist, lustrous yellow bloom, radiant beyond description. This is the most authentic treasure of heaven and earth.\n\nFor ingestion, divide one *liang* into three hundred sixty pills, mixing them with jujube pulp. Take one pill daily, consuming one *liang* over a year. Before ingesting these cinnabar pills, one must purify and fast for seven days. At dawn, face east with reverence, sincerely invoking the Three Pure Ones, the Perfected Lord of Purple Tenuity, the True Person of Grand Unity, the immortal officials of former masters, and the spirits of water and fire. Request that this divine cinnabar elixir enter the five viscera, eternally preserving form and spirit to unite with the highest truth.\n\nAfter the invocation, perform seven bows, then ingest the pill. After taking this cinnabar elixir, one must not consume putrid, stale, or accumulated foods, nor any raw or bloody pork, nor witness the impurities of life and death.",
      "overlap_context": "d fire. Thus, it is known that ice and charcoal cannot coexist, and decline and flourishing ultimately find their resolution. Moreover, cinnabar is yang essence and requires yin to restrain it; the restraining agent is water. One should use azurite, malachite, *shicheng*, *mayaxiao*, *xuanjing*, and *huashi*. For one *jin* of luminous jade-seat cinnabar, refine it with four *liang* of azurite, six *liang* of *shicheng*, six *liang* of *mayaxiao*, and two *liang* each of *huangjing* and *huashi*.",
      "start_char": 3041,
      "end_char": 4262,
      "start_sentence": 137,
      "end_sentence": 190,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.620721340179443,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大洞炼真宝经修伏灵砂妙诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "故经云：阳精好洁，阴尸好秽。 常须虚和其志，洗雪其形，以助阳灵之真气也。 自然神悦体清，而神仙殆可得耳。 第二返宝砂 本经曰：炼真者合於至妙，炼砂者合於至灵，炼灵者合於至神，至神者合於至道，道合则升腾玉清，而为高仙矣。 且炼砂而得宝者，是至真之药，化宝而生砂者，即成玄感之灵丹也。 化宝生砂。 诀日：将其丹砂中白银四两，打作锅子，安一通油瓷瓶子中，其瓶子可受一升。 其宝锅子，可瓶子底大小。 先将此银锅子，着北庭砂一两，石盥一两，麒麟竭一分，三物药和研，以苦酒调如膏，涂於锅子四面，令药尽候乾，以黄土为泥包曩之，可厚一寸二分。 便於糠火中，烧三七日。 然后白炭武火，烧二七日。 去泥取宝，其锅子安瓶子中，入真汞四两，其汞须是本色丹砂中抽得者，名曰同类感真气而转生丹砂。 故上仙真经，秘而不泄者，为此子母之法，恐凡愚之心见知也。 然入真汞於瓶子中后，即着水五合，常须添瓶子中水，至五合，莫令增臧。 文火养二七日，似鱼目沸为则。 日满更添汞四两，依前文火，养一七日后，令乾。 固济其口，便武火迫之三日。 而红黄砂涌出於宝锅子之上。 收其砂，又依前添汞。 常令有汞八两在其瓶子中，不得增少，亦依前用文武火候养迫，令生砂。 砂出即收之。 每四两宝计收砂一斤，其宝即枯槁焦脆，而精尽化而为砂。 其瓶子中母，只余二两青黑灰耳。 将其砂依前篇入药，煮三十日后，淘取砂入鼎中，还以阴阳火候飞伏，五日为一候，用二十候，一百日足，其砂伏火矣。 火候加增炭两多少，一依前篇飞伏。 其砂伏了，不用，着盐包曩烧之，便可镕鼓。 鼓诀亦依前篇。 以盐为使，引令金汁流出。 此宝砂一斤，修炼而得十五两。 伏火鼓得黄花银十三两，色渐黄光，浮彩润泽，而内白外黄，名曰黄花银也。 如将此砂服饵，须入寒泉抽火毒。 寒泉法，入土深埋三十日，取出淘研，用枣肉和为丸，每两亦作三百六十丸。 每日清晨束向，虔心服之一丸。 自服此宝砂丹后，自然虑静神清，浊气不入，而志不扰，则渐证於神仙之阶也。 第三返丹英砂 经曰：阳元积习，而英气自会於真精。 真精感化，而神丹可得耳。 故曰：炼真致真，真华通应，而化为金英之玄砂也。 化宝砂中白金而生英砂。 诀曰：将其宝砂中黄花银四两，打作锅子，还依前篇，可瓶子底大小为之。 用蒲州石胆一两，石盥一两，炮砂一两，和苦酒研调如膏，涂其锅子四面，令药尽为候。 候乾，以黄泥为球包袅，於糠火中烧、二七日，后用白炭武火烧一七日，去泥出锅子。 依前篇入安通油瓶子中，入真汞四两，清水五合，文火养之二七日。 后更添汞四两，又文火养一七日。 候乾，紧固济，便用武火迫促之一日，其砂涌出，於宝锅之上，而红黄映彻，光耀难言。 便收砂添汞，计收砂可得一斤，则数足矣。 便将其砂，入於鼎中，依前篇用火候飞伏，亦五日为一转，内三日用坎卦，即水煮三日。 用高卦二日，即阳火飞之二日。 初起阳火，用炭七两。 每一转后，即增炭二两。 至七转后，有汞霜飞出，可二两来，其色黄赫，紫光簇族，飞在鼎盖之下。 收其霜於钵中，着蒲州石胆一钱，重和苦酒及砂，以玉槌轻手熟研之，令相入后，却入鼎中飞伏。",
      "translated_text": "Thus the scripture states: \"Yang essence delights in purity, while the yin corpse delights in filth.\" One must constantly empty and harmonize the will, purify and cleanse the form, to assist the true qi of the numinous yang. Naturally, the spirit will rejoice and the body will be clear, and the attainment of immortality may then be realized.\n\n**Second Reversion: Precious Cinnabar**\nThe scripture states: \"Those who refine the true unite with the utmost subtlety; those who refine cinnabar unite with the utmost numinosity; those who refine the numinous unite with the utmost spirit; and those who unite with the utmost spirit unite with the Dao. When the Dao is united, one ascends to Jade Clarity and becomes a lofty immortal. Now, refining cinnabar to obtain the precious is the medicine of utmost truth; transforming the precious to generate cinnabar is the wondrous elixir of profound resonance.\"\n\n**Method for Transforming the Precious to Generate Cinnabar:**\nTake four *liang* of white silver from the cinnabar and fashion it into a crucible, placing it within a glazed oil jar that holds one *sheng*. The precious crucible should match the size of the jar’s base. First, take one *liang* of Beiting cinnabar, one *liang* of *shi jian*, and one *fen* of *qilin jie*, grind these three ingredients together, and mix them with bitter wine into a paste. Coat the crucible on all sides, ensuring the medicine is fully applied, then let it dry. Encase it in yellow clay mud to a thickness of one *cun* and two *fen*. Heat it in a husk fire for three seven-day periods, then with white charcoal and a martial fire for two seven-day periods. Remove the mud to retrieve the precious crucible, place it in the jar, and add four *liang* of true mercury—mercury extracted from cinnabar of the same origin, called \"the method of kindred resonance that transforms and generates cinnabar.\" The reason the scriptures of the perfected immortals keep this secret is due to this mother-and-child method, lest the hearts of the vulgar and foolish come to know it.\n\nAfter adding the true mercury to the jar, pour in five *ge* of water, ensuring the jar always contains five *ge* of water without fluctuation. Nurture it with a civil fire for two seven-day periods, until it boils like fish eyes. After the days are complete, add another four *liang* of mercury, and continue nurturing with a civil fire for one seven-day period, then let it dry. Seal the mouth tightly and apply a martial fire to press it for three days. Red and yellow cinnabar will surge forth upon the precious crucible. Collect the cinnabar and replenish the mercury as before. Always maintain eight *liang* of mercury in the jar, neither increasing nor decreasing, and continue using civil and martial fires to nurture and press, generating cinnabar. Collect the cinnabar as it emerges. For every four *liang* of the precious, one *jin* of cinnabar is obtained. The precious will then wither, become brittle, and its essence will be entirely transformed into cinnabar. Only two *liang* of bluish-black ash will remain in the jar.\n\nTake the cinnabar and, following the previous method, boil it with medicinal ingredients for thirty days. Then wash and retrieve the cinnabar, place it in the tripod, and refine it with yin-yang fire cycles—five days per cycle, twenty cycles in total, completing one hundred days. The cinnabar will then be subdued by fire. The amount of charcoal used in the fire cycles should follow the previous method. Once the cinnabar is subdued, do not use it directly; instead, wrap it in salt and heat it to melt and forge. The forging method also follows the previous section. Use salt as the agent to guide the flow of golden liquid. From one *jin* of this precious cinnabar, fifteen *liang* are obtained through refinement. When subdued by fire and forged, thirteen *liang* of yellow-flower silver are produced, its color gradually turning golden with a lustrous sheen, white within and yellow without—this is called yellow-flower silver.\n\nIf this cinnabar is to be ingested, it must first have its fire toxin drawn out by cold springs. The cold spring method involves burying it deep in the earth for thirty days, then retrieving, washing, and grinding it. Mix it with jujube pulp to form pills, making three hundred sixty pills per *liang*. Each day at dawn, face east with reverence and sincerely ingest one pill. After taking this precious cinnabar elixir, one’s thoughts will naturally become tranquil and the spirit clear; turbid qi will not enter, and the will shall not be disturbed. Thus, one gradually ascends the steps toward immortality.\n\n**Third Reversion: Florid Cinnabar**\nThe scripture states: \"When yang’s primordial energy accumulates through practice, the florid qi naturally converges with true essence. When true essence resonates and transforms, the divine elixir may be attained.\" Thus it is said: \"Refining the true to attain the true, the true essence responds universally, transforming into the mysterious cinnabar of golden floridity.\"\n\n**Method for Transforming Precious Cinnabar into Florid Cinnabar:**\nTake four *liang* of yellow-flower silver from the precious cinnabar and fashion it into a crucible, following the previous method to match the size of the jar’s base. Use one *liang* of Pu Prefecture chalcanthite, one *liang* of *shi jian*, and one *liang* of processed cinnabar. Grind these with bitter wine into a paste and coat the crucible on all sides, ensuring the medicine is fully applied. Let it dry, then wrap it in yellow clay mud and heat it in a husk fire for two seven-day periods. Afterward, use white charcoal and a martial fire to heat it for one seven-day period. Remove the mud and retrieve the crucible. Following the previous method, place it in a glazed oil jar, add four *liang* of true mercury and five *ge* of clear water, and nurture it with a civil fire for two seven-day periods. Then add another four *liang* of mercury and nurture it with a civil fire for one seven-day period. Once dry, seal it tightly and apply a martial fire to press it for one day. The cinnabar will surge forth upon the precious crucible, radiant in red and yellow, its brilliance indescribable. Collect the cinnabar and replenish the mercury. When one *jin* of cinnabar is obtained, the quantity is sufficient.\n\nPlace the cinnabar in the tripod and refine it with fire cycles as before—five days per cycle. For the first three days, use the *kan* trigram, boiling with water for three days. For the next two days, use the *qian* trigram, flying with yang fire for two days. Initially, use seven *liang* of charcoal for the yang fire. After each cycle, increase the charcoal by two *liang*. After seven cycles, two *liang* of mercury frost will fly out, its color a radiant yellow, clustered with purple light, adhering to the underside of the tripod’s lid. Collect the frost in a bowl, add one *qian* of Pu Prefecture chalcanthite, mix it with bitter wine and cinnabar, and grind it thoroughly with a jade pestle until fully incorporated. Then return it to the tripod for further refinement.",
      "overlap_context": " Lord of Purple Tenuity, the True Person of Grand Unity, the immortal officials of former masters, and the spirits of water and fire. Request that this divine cinnabar elixir enter the five viscera, eternally preserving form and spirit to unite with the highest truth.\n\nAfter the invocation, perform seven bows, then ingest the pill. After taking this cinnabar elixir, one must not consume putrid, stale, or accumulated foods, nor any raw or bloody pork, nor witness the impurities of life and death.",
      "start_char": 4262,
      "end_char": 5506,
      "start_sentence": 191,
      "end_sentence": 243,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.22483253479004,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大洞炼真宝经修伏灵砂妙诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "伏经十八候九十日足，其英砂伏火毕，无分毫少折，便可镕铸。 亦依前篇，用盥花引鼓之，即宝流下，而青英光润，名曰青金。 青金者，是阳精渐着，从兑见震，然至坤归离，此是阳精变转巡历之终始也。 如将此英砂服食，每两先用榆甘子半两，生甘草二两，煎取汁，於白银器中煮二七日，后澄取砂，入安淡青竹筒中，入土深埋之，三十日然后出，以枣肉和为丸，每两还分为三百六十丸。 每日清晨束向，扣告三清上帝仙官，然后服饵。 服至此英砂丹，乃自嗜欲无婴，荤血不入，端居诤室，而神和体轻，渐得真人为俦矣。 第四返丹妙化砂 经日：乾体阳曜，高精渐明。 艮雪轻鲜，阴魄消化。 乃是青金精液，感汞而生砂，英气相因，集而为妙，名曰妙化砂。 妙化砂。 诀日：将青金四两，还打为锅子，用赤盐半两，石硫黄半两，大鹏砂半两，北庭砂一两、蒲州石胆一两，和苦酒研如泥，涂其青金锅子四面，以火炙渐渐涂，令药尽为候。 候乾，一依前篇，用黄上泥为球包曩之，以糠火中烧二七日，后即白炭武火烧一七日。 毕，去泥出锅子，依前篇，安瓶子中，入真汞四两，清水五合，不得增少。 养之二七日后，更添汞四两。 又文火养，经七日后，令乾，固济之，以武火迫之一日，而妙砂涌出，可有四两。 即收之，更添汞四两，亦依前文火养之，令生砂砂出，即收取计收砂一斤，即数足矣。 将其砂入鼎中，依前篇用火候飞伏，亦五日为一转。 内二日用坎卦，是水煮二日。 三日用高卦，则阳火飞之三日。 飞火候一依英砂篇中，用火加增，炭数多少。 经十六候八十日，而妙砂伏火毕，则金星光灿，映彻红耀，可言为至英至妙之丹砂也。 如将镕铸，亦须用盐花为使，引令金汁流出，乃成黄金。 其金凝黄，皎润精彩光耀，既至坤形，高精渐见。 故经曰：从阴而反归阳，自浊而反归清。 此则是阳元变炼，合於真妙而自然，位为神仙也。 若将服饵，每两先须用榆甘子半两，生甘草一两，紫石英一两，煎取汁，於宝器中煮二七日，后亦入淡青竹筒中，入寒泉埋之三旬，然后取出，以枣肉和为丸，每两分为三百六十丸。 每日晨朝束向，服之一丸。 日服此妙砂，后渐而精思通彻，浊滞之气消革，则形神虚白，洞合於至真，自然超其玉章，而永离尘浊也。 若志士得其含元炼真之诀，如神仙之道，岂可远哉。 第五返丹灵砂 经曰：阳德播功而垂光，运动其元精，元精流化而为英砂，英砂转而入妙，妙气变炼而生万灵。 故知玄妙玄圣，转转而增光，感激真精，自然灵化。 且灵砂者，是前妙砂中黄金，转感化汞，而生其砂。 则红光焕赫，璀璨金星，而绛色清虚，乃号为灵砂者也。 化灵砂。 诀日：取妙砂中黄金八两，打作圆鼎，可受四合。 又将二两金为鼎盖。 其鼎内先着石硫黄半两，赤盥半两，北庭砂半两，蒲州石．胆半两，四种药和苦酒研如泥，涂其鼎内及盖内，令调匀药尽。 候乾，即以黄土为泥包曩之，可厚一寸，文火四面，养之二七日，以不通手为候。 二七日后，渐武火白烧一七日，昼夜不得绝火。 七日满，寒之，去泥，重以甘土泥泥其鼎外，可厚二分。 即悬安炉中，其鼎下周回令通安火处，便入真汞四两，於金鼎中，着水二合，以盖合之。",
      "translated_text": "After the sublimation process completes eighteen phases over ninety days, the refined cinnabar will have fully undergone fire-taming without the slightest loss. It may then be smelted and cast. Following the previous method, use saltpetre as a flux to stir the melt, and the precious essence will flow forth—lustrous with azure brilliance, called \"Azure Gold.\" Azure Gold arises as yang essence gradually coalesces, emerging from *dui* to manifest in *zhen*, then cycling through *kun* to return to *li*, marking the full circuit of yang essence’s transformation.\n\nIf this refined cinnabar is to be ingested, first take half a *liang* of elm seeds and two *liang* of raw licorice, decoct them to extract the juice, and boil the cinnabar in a silver vessel for fourteen days. Afterward, strain the cinnabar, place it in a pale green bamboo tube, and bury it deep in the earth for thirty days. Upon retrieval, mix it with jujube pulp to form pills, dividing each *liang* into three hundred sixty. Each morning at dawn, face east, invoke the Three Pure Ones and the Immortal Officials, and then consume the pills. By ingesting this refined cinnabar elixir, one’s cravings and desires will fade, meat and blood will no longer pass the lips, and dwelling in quietude, the spirit will harmonize while the body grows light—gradually attaining fellowship with the Perfected.\n\n**Fourth Return Elixir: Wondrous Transmuted Cinnabar**\nThe scripture states: The *qian* body radiates yang brilliance, its pure essence gradually clarifying. *Gen*’s snow is light and fresh, dissolving the yin spirit. Thus, the Azure Gold’s essence interacts with mercury to generate cinnabar, their vital energies intertwining to form the wondrous—called \"Wondrous Transmuted Cinnabar.\"\n\n**Method for Wondrous Transmuted Cinnabar:**\nTake four *liang* of Azure Gold and forge it into a crucible capable of holding four *ge*. Mix half a *liang* each of red salt, sulfur, *da peng* cinnabar, and one *liang* each of *Bei Ting* cinnabar and Pu Prefecture chalcanthite with bitter wine, grinding them into a paste. Coat the Azure Gold crucible inside and out, then heat it gradually until the medicine is fully absorbed. Once dry, encase it in yellow clay as before, sealing it in a ball. Fire it with chaff for fourteen days, then with white charcoal under strong fire for another seven. Upon completion, remove the clay, extract the crucible, and place it in a flask with four *liang* of pure mercury and five *ge* of water—no more, no less. Nurture it for fourteen days, then add another four *liang* of mercury. Continue with gentle fire for seven more days until dry, seal it tightly, and apply strong fire for one day. The wondrous cinnabar will surge forth, yielding four *liang*. Collect it, add another four *liang* of mercury, and repeat the gentle-fire nurturing until cinnabar forms. Once a total of one *jin* is gathered, the quantity is sufficient.\n\nPlace the cinnabar in the tripod and refine it with fire cycles as before—five days per cycle. For the first two days, use the *kan* trigram, boiling with water for two days. For the next three days, use the *qian* trigram, flying with yang fire for three days. Follow the fire regimen and charcoal increments as described in the refined cinnabar section. After sixteen phases over eighty days, the wondrous cinnabar will have fully undergone fire-taming, its golden stars gleaming with radiant red brilliance—truly the most refined and wondrous cinnabar.\n\nFor smelting and casting, use saltpetre as a flux to induce the golden liquid to flow, forming yellow gold. As the gold solidifies, its hue deepens, lustrous and luminous, its pure essence gradually manifesting. Thus, the scripture states: \"From yin, it returns to yang; from turbidity, it returns to clarity.\" This is the transformation of yang’s primordial essence, merging with the truly wondrous to attain immortality.\n\nIf ingesting, first take half a *liang* of elm seeds, one *liang* of raw licorice, and one *liang* of purple fluorite, decoct them to extract the juice, and boil the cinnabar in a precious vessel for fourteen days. Then place it in a pale green bamboo tube and bury it in a cold spring for thirty days. Upon retrieval, mix it with jujube pulp to form pills, dividing each *liang* into three hundred sixty. Each morning at dawn, consume one pill. Daily ingestion of this wondrous cinnabar will gradually sharpen the mind, dispel turbid qi, and refine the body and spirit to purity, merging with the Perfected and transcending the mortal realm. For those of resolve who grasp the secrets of primordial essence refinement, the Dao of immortality is within reach.\n\n**Fifth Return Elixir: Spirit Cinnabar**\nThe scripture states: Yang virtue spreads its merit and radiates light, moving its primordial essence. Primordial essence flows and transforms into refined cinnabar, which in turn enters the wondrous. The wondrous qi refines further to generate myriad spirits. Thus, the profound and wondrous attainments of the sages grow ever more luminous, resonating with true essence to naturally manifest spiritual transformation.\n\nSpirit Cinnabar arises from the yellow gold within the wondrous cinnabar, interacting with mercury to generate its essence—flaming red with dazzling golden stars, its crimson hue pure and ethereal.\n\n**Method for Spirit Cinnabar:**\nTake eight *liang* of yellow gold from the wondrous cinnabar and forge it into a round tripod capable of holding four *ge*. Use two *liang* of gold for the lid. Inside the tripod, place half a *liang* each of sulfur, red salt, *Bei Ting* cinnabar, and Pu Prefecture chalcanthite. Mix them with bitter wine and grind into a paste, coating the interior of the tripod and lid evenly until the medicine is fully applied. Once dry, encase it in yellow clay, forming a one-*cun*-thick layer. Nurture it with gentle fire on all sides for fourteen days, ensuring it is too hot to touch. After fourteen days, gradually increase to strong fire with white charcoal for another seven, maintaining the flame day and night. After seven days, let it cool, remove the clay, and re-coat the tripod’s exterior with sweet clay to a thickness of two *fen*. Suspend it in a furnace, ensuring the base is open for fire access. Add four *liang* of pure mercury and two *ge* of water to the golden tripod, then seal it with the lid.",
      "overlap_context": "ven *liang* of charcoal for the yang fire. After each cycle, increase the charcoal by two *liang*. After seven cycles, two *liang* of mercury frost will fly out, its color a radiant yellow, clustered with purple light, adhering to the underside of the tripod’s lid. Collect the frost in a bowl, add one *qian* of Pu Prefecture chalcanthite, mix it with bitter wine and cinnabar, and grind it thoroughly with a jade pestle until fully incorporated. Then return it to the tripod for further refinement.",
      "start_char": 5506,
      "end_char": 6737,
      "start_sentence": 244,
      "end_sentence": 286,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.09903621673584,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大洞炼真宝经修伏灵砂妙诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "文火养经七日，其鼎下常令有熟炭火五两，不得增少。 其鼎中续续添水，长须应二合数，不得令乾。 在意消息，莫遣失候。 七日后更添汞四两，又依前文火养七日后，令乾，紧固济其口，即武火迫之一日。 便生红光灵砂，可收得五两红砂。 便须更入真汞五两於鼎中，其鼎中常须有汞八两，不得增少。 亦文火养七日后，令乾，即固济之。 便用武火迫之一日，而生砂。 砂出则收其砂。 更添真汞於鼎中，又文武火养迫，令生砂。 唱砂出收之。 此一鼎中，计收砂得三十两便休，则数足矣。 其金出砂后，精竭而枯脆，无光润之色，秤只可重四两以来耳，其精华匀汞相感结，尽化为灵砂也。 故经言真汞者，皆是其本色丹砂中，抽得汞添用。 若伏炼光明砂为药头者，即取光明砂中汞，转转添用。 如用白马牙砂为药头者，即转转取白马牙砂中汞添变。 如将紫灵砂为药头者，即取紫灵砂中汞添合。 如溪土砂中所出汞者，名为杂类，气终不相感。 且光明砂一斤，抽汞可得十四两，而光白流利，此上品光明砂，只含石黑二两。 白马牙砂一斤，抽出汞得十二两，而含石黑四两。 紫灵砂一斤，抽汞可得十两，而含石黑六两。 上色通明砂一斤，抽出汞只可得八两半，而含石黑七两半。 石黑者，火石之空黑也。 如汞出后，可有石胎一两，青白灰耳。 亦于前宝砂篇中，略述真汞之诀，而未周细，故郑重言之。 所是抽砂出汞，具列于金丹前章之上品也。 其黄金鼎中，收得灵砂，计三十两，数足讫不用阴煮。 便依前篇，用阴阳火候飞伏，还五日为一候。 内一日用坎卦，是水煮一日。 用四日高卦，即阳火飞之四日。 初起阳火，用炭九两，每转后增炭二两，至五转后，每转增炭三两，便有五彩金辉霜三两飞出。 收其霜，和砂于钵，钵中着蒲州石胆半分，黄炮一分，和苦酒熟研之半日。 依前安鼎中，用坎高二卦火候飞伏，伏经十四候七十日足，其霜砂伏火毕矣。 其砂伏火了，金彩红辉，色如石榴花，光精璨璨，辉曜日月，一切毒龙蛇恶鬼神，见之潜伏。 目不敢举，可得言至灵者哉。 其砂灵而难鼓铸。 若欲镕之，先于洁净之处，取净土为锅炉，绝秽杂，以盐花和灵砂等入锅，鼓之二千轮，便得镕之。 镕出即金汁流凝，而红鲜焕焕，名曰红金。 红金者，是阴魄之黑。 变炼而尽，正阳之精，挺立而垂光，此是阳灵之真金也。 如将服食，一依前篇，着榆甘子、生甘草、紫石英，煎取汁，于宝器中煮二七日，火候药数多少，亦依前篇。 煮了，入安筒中，固济其口，入寒泉并於土中，深埋二十日，然后出。 以枣肉和为丸，每两还为三百六十丸，其丸如大麻子大。 此灵砂体渐重矣。 每日清晨洁白，束向，启告三清上帝真官，然后扣先师而服之。 服此灵砂丹后，而便心神精明，彻达视通於表内，身生红光，而洞合於至真也。 第六返丹神砂 经日：妙极则灵通，灵通而致神，神合则道全，道全而玄真降，便升玉清，而为高仙矣。 且神砂者，是九灵构精，宝风凝集，玄华标结，而化为神砂，则焕灿玄黄，光辉照灼，而名为神砂者也。 化神砂。 诀日：取前灵砂中红鲜金九两，铸为宝鼎，可受五合。 又将三两宝金为盖。 其鼎内亦先着石硫黄一两，大明砂一两，赤盥一两，北庭砂一两，和苦酒熟研如泥，涂其鼎内及盖周回，令药匀尽为候。",
      "translated_text": "Maintain gentle fire for seven days, ensuring five *liang* of glowing charcoal remains beneath the tripod at all times—neither increasing nor decreasing. Continuously replenish water in the tripod, always maintaining two *ge* without allowing it to dry. Attend carefully to the process, lest the moment be lost. After seven days, add another four *liang* of pure mercury, then nurture with gentle fire for another seven days as before. Once dry, tightly seal the opening and apply strong fire for one day. This will produce *ling sha* (red radiant cinnabar), yielding five *liang* of red cinnabar.\n\nThen add five *liang* of pure mercury to the tripod, ensuring the vessel always contains eight *liang* of mercury—neither more nor less. Nurture with gentle fire for seven days, then dry it and seal tightly. Apply strong fire for one day to generate cinnabar. Once formed, collect the cinnabar. Add more pure mercury to the tripod and alternate gentle and strong fire to cultivate further cinnabar. When the cinnabar appears, gather it. From this single tripod, collect a total of thirty *liang* of cinnabar before ceasing, for the quantity is now sufficient.\n\nAfter the gold has yielded its cinnabar, its essence is exhausted, leaving it brittle and dull, weighing only about four *liang*—its vital essence having interacted with the mercury to fully transform into *ling sha*. Thus, the texts speak of \"true mercury,\" which is drawn from its original cinnabar form for use. If refining luminous cinnabar as the medicinal base, extract mercury from it and replenish accordingly. If using *bai ma ya sha* (white horse-tooth cinnabar) as the base, extract mercury from it in turn. If employing *zi ling sha* (purple radiant cinnabar), take mercury from it for the process. Mercury derived from riverbank cinnabar is of mixed type and will not harmonize in *qi*.\n\nFrom one *jin* of luminous cinnabar, fourteen *liang* of mercury may be extracted, flowing bright and white—this is the finest grade, containing only two *liang* of *shi hei* (stone residue). From one *jin* of *bai ma ya sha*, twelve *liang* of mercury may be drawn, containing four *liang* of *shi hei*. From one *jin* of *zi ling sha*, ten *liang* of mercury may be obtained, with six *liang* of *shi hei*. From one *jin* of high-grade transparent cinnabar, only eight and a half *liang* of mercury may be extracted, containing seven and a half *liang* of *shi hei*. *Shi hei* refers to the hollow, blackened residue of fire-stone. After mercury is extracted, about one *liang* of *shi tai* (stone embryo) remains, a pale gray ash.\n\nThe method for extracting mercury from cinnabar was briefly outlined in the previous chapter on precious cinnabar but not exhaustively detailed, hence its reiteration here. The extraction of mercury from cinnabar is enumerated among the superior methods in the preceding chapter on the Golden Elixir. Once thirty *liang* of *ling sha* is collected in the golden tripod, the quantity is sufficient, and no further yin-nurturing is needed. Proceed as in the earlier section, employing the yin-yang fire cycle, with five days as one phase. On the first day, use the *kan* trigram (water) to steam for one day. For the next four days, use the *gao* trigram (yang fire) to refine. Begin the yang fire with nine *liang* of charcoal, increasing by two *liang* with each subsequent cycle. After five cycles, increase by three *liang* per cycle, yielding three *liang* of five-colored *jin hui shuang* (golden radiant frost). Collect the frost and mix it with the cinnabar in a mortar, adding half a *fen* of *Pu Prefecture* chalcanthite and one *fen* of sulfur, grinding thoroughly with bitter wine for half a day. Return the mixture to the tripod and refine using the *kan* and *gao* trigram fire cycles. After fourteen phases—seventy days in total—the frost and cinnabar will be fully refined by fire.\n\nOnce refined, the cinnabar will glow with golden radiance, its hue like pomegranate blossoms, luminous as the sun and moon. All poisonous dragons, serpents, evil spirits, and demons will cower at its sight, unable to raise their eyes. Can anything be more divine? This cinnabar is potent yet difficult to cast. To melt it, first prepare a clean vessel of purified earth, free from impurities. Mix salt flowers with the *ling sha* and grind for two thousand revolutions before melting. Upon melting, the golden liquid will congeal into a vibrant red, called *hong jin* (red gold). *Hong jin* is the blackness of yin’s essence, refined away to reveal the pure yang’s radiance—this is the true gold of yang’s spirit.\n\nFor ingestion, follow the earlier method: boil with *yu gan zi* (elm sweet fruit), raw licorice, and *zi shi ying* (purple fluorite), extracting the juice in a precious vessel for fourteen days. The fire cycle and medicinal quantities should adhere to the previous instructions. Once boiled, place it in a sealed tube, secure the opening, and bury it in a cold spring or underground for twenty days. Then retrieve it, mix with jujube pulp, and form into pills—360 pills per *liang*, each the size of a hemp seed. The *ling sha*’s body will gradually grow heavier.\n\nEach morning, after purifying oneself and facing east, invoke the Three Pure Ones and the True Officials, then pay homage to the ancestral master before ingesting. After consuming this *ling sha* elixir, the heart and spirit will become luminous, perception will penetrate inner and outer realms, the body will emanate red light, and one will merge with the utmost truth.\n\n**Sixth Reversion Elixir: Divine Cinnabar**\nThe scripture states: When subtlety reaches its peak, spirit communicates; when spirit communicates, it attains divinity; when divinity unites, the Dao is complete; when the Dao is complete, the mysterious and true descend, allowing ascent to the Jade Clarity and attainment of high immortality.\n\n*Shen sha* (divine cinnabar) is the congealed essence of the Nine Spirits, the condensed breath of the Treasure Wind, the crystallized radiance of the Mysterious Flower—transformed into divine cinnabar, resplendent in dark and yellow hues, its brilliance dazzling. Thus it is named *shen sha*.\n\n**Method for Refining Divine Cinnabar:**\nTake nine *liang* of the red, radiant gold from the previous *ling sha* and cast it into a precious tripod, capable of holding five *ge*. Use three *liang* of the same gold for the lid. First, place one *liang* each of sulfur, luminous cinnabar, red salt, and *Bei Ting* cinnabar inside the tripod, grinding them with bitter wine into a paste. Coat the interior of the tripod and lid evenly, ensuring the medicine is fully applied.",
      "overlap_context": " fire on all sides for fourteen days, ensuring it is too hot to touch. After fourteen days, gradually increase to strong fire with white charcoal for another seven, maintaining the flame day and night. After seven days, let it cool, remove the clay, and re-coat the tripod’s exterior with sweet clay to a thickness of two *fen*. Suspend it in a furnace, ensuring the base is open for fire access. Add four *liang* of pure mercury and two *ge* of water to the golden tripod, then seal it with the lid.",
      "start_char": 6737,
      "end_char": 7986,
      "start_sentence": 287,
      "end_sentence": 339,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.195411920547485,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大洞炼真宝经修伏灵砂妙诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "候乾，以盖合之，着黄土泥包曩，可厚二分为则，一依前篇，文火养之二七日。 后即武火迫烧七日，令与火同色。 候玲，去其黄泥，重以甘土为泥，泥其鼎外，可厚三分。 即置其鼎於炉中，入真汞六两安鼎中，着水三合，逐旋添之，不得令乾。 文火养七日，后更入汞三两。 文火更养三日，后令乾，固济封闭，令紧密。 即武火迫经二宿，即尽化为红光之神砂。 收砂，又添汞八两，依前｀文火养七日，后便武火迫之二日，亦化为砂。 收砂，又添汞七两，亦文火养，即武火迫之，令生砂。 砂出即收，又添汞五两，还文武火养。 迫令出砂。 收之，又添汞三两，一依前文武火候养迫之，计前后收得神砂，可二斤三十二两，足即乃已也。 将其砂入石硫黄四两，蒲州石胆子二两，和於钵中，熟研半日。 便入安宝金鼎中，阳火飞伏。 其阳火者，纯高卦火候。 伏之，还五日为一候。 初起火用炭九两，每一转后则加炭二两，每转转出砂，於钵中熟研之。 却入鼎飞伏，伏至五转后，每转加炭三两。 如有绛金霜飞出，其霜红赫照耀，光彩射目。 收其霜，於钵中和砂，着蒲州石胆一分，和苦酒熟研之半日，然后入安鼎中，用火候飞伏，伏经十二转六十日足，其神砂伏火毕矣。 而色赫奕含辉，紫光洞彻，不可言尔。 若将镕铸，其诀一依前灵砂篇法度。 和灵花鼓之，即宝汁流出，凝成赤金，精光如火，故号曰高己之金者也。 其神砂丹，便可以服饵。 每两亦分为三百六十丸，以枣肉和之为丸。 服饵诀一依前篇。 且服此灵宝神砂丹后，自然精灵骨轻，身有光明，足蹈真境，而为上仙也。 第七返丹玄真绛霞砂 经日：灵宝禀运，则感应而神栖。 归真积精，则自然玄霜绛雪，腾跃流通，流通则永为高真之灵仙也。 且玄真绛霞砂者，是神砂中赤金，宝鼎养汞而生砂，其砂则紫霞红英，五彩辉灼，乃号为玄真绛霞之砂。 化宝生砂。 诀曰：取前神砂中宝金一斤，铸作圆鼎。 可受七合。 又将宝金五两，为鼎盖。 其鼎内先须着石硫黄四两，赤盐二两，北庭砂二两，大鹏砂一两，以苦酒和研如泥，涂其鼎内，以药尽为候。 候乾则盖合之，用黄土为泥包曩，可厚一寸。 依前神砂篇，文火养之二七日后，即白炭武火烧七日。 寒之，去其泥，重以甘土为泥，泥其鼎外周回，可厚二分半。 即悬安炉中，入真汞十二两於鼎中，着水三合，不得遣乾，逐旋添水。 则以盖合其鼎。 文火养七日，其鼎上常令通手为候。 七日养后，遣乾。 紧固济其口，即渐渐武火，迫之三日。 开看之，其汞即尽化为绛霞之玄砂也。 其砂不得收之，便更添汞九两，亦依前文武火候养迫，遣化为砂。 日满开看，又尽化为砂。 又添汞六两於鼎中，固济，文武火候迫促之，日数足，又开看，亦化为砂矣。 更添汞五两，还七日文火养，即武火迫之一日，而成其砂，红紫五彩，霞光辉耀，在其鼎中，可三十二两，分毫不欠。 出其砂，於钵中，着石硫黄七两，以玉槌细研之一日。 然后却入此神砂赤金宝鼎中，固济其口令紧，用红阳火候，伏之七日为一转。 即开之出砂，和苦酒一合，熟研而后，入鼎飞伏，每七日为一候。 初起火用炭十三两，每转加炭一两，至三转每转加炭二两。 便有五色轻鲜绛霞霜一二两，飞出於鼎盖之上，连连如麦颗，即收之。",
      "translated_text": "Once dry, seal the lid and encase the vessel in yellow clay mud, applying a thickness of two *fen* as the standard. Follow the previous method, nurturing it with gentle fire for two seven-day periods. Then, apply fierce fire to heat it for seven days until it matches the color of the flame. Once cooled, remove the yellow mud and re-coat the exterior of the tripod with sweet clay mud to a thickness of three *fen*. Place the tripod in the furnace, add six *liang* of true mercury into the vessel, and pour in three *ge* of water, replenishing gradually to prevent dryness. Nurture with gentle fire for seven days, then add another three *liang* of mercury. Continue with gentle fire for three more days, then allow it to dry. Seal tightly and secure the closure. Apply fierce fire for two nights, and it will fully transform into divine cinnabar of radiant red light. Collect the cinnabar, then add eight *liang* of mercury, nurturing with gentle fire for seven days before applying fierce fire for two days to produce more cinnabar. Collect the cinnabar, add seven *liang* of mercury, nurture with gentle fire, then apply fierce fire to generate cinnabar. Once the cinnabar forms, collect it, add five *liang* of mercury, and alternate between gentle and fierce fire. Continue until cinnabar is produced. Collect it, then add three *liang* of mercury, following the previous method of alternating gentle and fierce fire. In total, you will have gathered two *jin* and thirty-two *liang* of divine cinnabar—this is sufficient.\n\nPlace the cinnabar into a mortar with four *liang* of sulfur and two *liang* of *Pu Zhou* chalcanthite, grinding them thoroughly for half a day. Then transfer the mixture into a precious gold tripod and refine it with *yang* fire. *Yang* fire refers to the pure fire of the *Li* trigram. Refine it for five days as one cycle. Begin with nine *liang* of charcoal; after each cycle, add two *liang* of charcoal. After each cycle, remove the cinnabar, grind it thoroughly in the mortar, then return it to the tripod for further refinement. After five cycles, add three *liang* of charcoal per cycle. When *jiang jin shuang* (crimson gold frost) emerges, its red brilliance will dazzle the eyes. Collect the frost, mix it with the cinnabar in the mortar, add one *fen* of *Pu Zhou* chalcanthite, and grind thoroughly with bitter wine for half a day. Then return it to the tripod, seal tightly, and refine with fire for twelve cycles over sixty days. The divine cinnabar will have completed its refinement, its color resplendent and radiant, its purple glow penetrating—indescribable in words. If you wish to cast it, follow the method described in the previous *ling sha* section. When combined with *ling hua* (spirit flower) and stirred, it will flow like precious liquid, congealing into red gold, its essence glowing like fire—hence it is called the \"gold of exalted attainment.\"\n\nThe divine cinnabar elixir may now be consumed. Divide each *liang* into 360 pills, forming them with jujube pulp. The method of ingestion follows the previous section. After consuming this divine treasure of divine cinnabar, one will naturally become spiritually attuned, bones lightened, the body luminous, and step into the true realm, ascending as a supreme immortal.\n\n---\n\n**Seventh Return Elixir: Mysterious True Crimson Radiance Cinnabar**\n\nThe scripture states: When the divine treasure is ordained by fate, resonance occurs and the spirit dwells within. By returning to the true and accumulating essence, naturally *xuan shuang* (mysterious frost) and *jiang xue* (crimson snow) arise, surging and circulating. Through circulation, one eternally becomes a transcendent spirit-immortal.\n\nThis *xuan zhen jiang xia sha* (mysterious true crimson radiance cinnabar) is the cinnabar born from nurturing mercury with the red gold of divine cinnabar in a precious tripod. Its cinnabar shimmers with purple radiance and red splendor, its five hues dazzling—thus it is named the cinnabar of mysterious true crimson radiance.\n\n**Method for Refining Treasure-Born Cinnabar:**\nTake one *jin* of the precious gold from the previous divine cinnabar and cast it into a round tripod, capable of holding seven *ge*. Use five *liang* of the same gold for the lid. First, place four *liang* of sulfur, two *liang* of red salt, two *liang* of *Bei Ting* cinnabar, and one *liang* of *da peng* cinnabar inside the tripod, grinding them with bitter wine into a paste. Coat the interior of the tripod evenly, ensuring the medicine is fully applied.\n\nOnce dry, seal the lid and encase the vessel in yellow clay mud to a thickness of one *cun*. Follow the method in the divine cinnabar section, nurturing it with gentle fire for two seven-day periods, then heating it with white charcoal and fierce fire for seven days. Once cooled, remove the mud and re-coat the exterior of the tripod with sweet clay mud to a thickness of two and a half *fen*. Suspend the tripod in the furnace, add twelve *liang* of true mercury into the vessel, and pour in three *ge* of water, ensuring it does not dry out by replenishing gradually. Seal the lid. Nurture with gentle fire for seven days, keeping the top of the tripod comfortably warm to the touch. After seven days, allow it to dry. Seal the opening tightly, then gradually apply fierce fire for three days. Upon opening, the mercury will have fully transformed into *jiang xia* (crimson radiance) mysterious cinnabar. Do not collect the cinnabar yet; instead, add nine *liang* of mercury and follow the previous method of alternating gentle and fierce fire to transform it into cinnabar. When the time is complete, open it—all will have turned to cinnabar. Add another six *liang* of mercury, seal tightly, and apply alternating gentle and fierce fire until the time is fulfilled. Upon opening, it will again have transformed into cinnabar. Add five *liang* of mercury, nurture with gentle fire for seven days, then apply fierce fire for one day to produce the cinnabar. Its red and purple hues, five radiant colors, and misty glow will fill the tripod—thirty-two *liang* in total, precise to the last grain.\n\nCollect the cinnabar and place it in a mortar with seven *liang* of sulfur, grinding it finely with a jade pestle for one day. Then return it to the precious gold tripod of divine cinnabar, seal the opening tightly, and refine it with red *yang* fire for seven days as one cycle. Open it, remove the cinnabar, mix it with one *ge* of bitter wine, and grind thoroughly before returning it to the tripod for further refinement. Each seven-day period constitutes one cycle. Begin with thirteen *liang* of charcoal; after each cycle, add one *liang* of charcoal. By the third cycle, add two *liang* of charcoal per cycle. One to two *liang* of five-colored, light, and fresh *jiang xia shuang* (crimson radiance frost) will fly onto the lid of the tripod, resembling wheat grains in succession—collect it.",
      "overlap_context": "us it is named *shen sha*.\n\n**Method for Refining Divine Cinnabar:**\nTake nine *liang* of the red, radiant gold from the previous *ling sha* and cast it into a precious tripod, capable of holding five *ge*. Use three *liang* of the same gold for the lid. First, place one *liang* each of sulfur, luminous cinnabar, red salt, and *Bei Ting* cinnabar inside the tripod, grinding them with bitter wine into a paste. Coat the interior of the tripod and lid evenly, ensuring the medicine is fully applied.",
      "start_char": 7986,
      "end_char": 9223,
      "start_sentence": 340,
      "end_sentence": 393,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.03532886505127,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大洞炼真宝经修伏灵砂妙诀.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "和砂於钵中，着蒲州石胆半两，苦酒二合，熟研，却入於鼎中飞伏。 每转转须开看。 即入石胆苦酒和研，方可入鼎伏之。 伏经七转四十九日足，其砂伏火毕矣。 便以武火烧之一日，可用炭二十斤，分为四座，迫烧之。 然后寒一日，开鼎看其玄真绛霞之砂。 伏火了，而文彩辉赫，杂错霞光，洞耀於日月，可言至灵者哉，极阳玄元之砂丹也。 如镕铸其玄真砂，一依前神砂灵砂诀。 用灵花和鼓引，令宝汁流见而凝紫光耀，名曰绛霞之紫金也。 若将服饵，便以枣肉和为丸，每两亦分为三百六十丸。 每日清晨束向，服一丸。 服至此紫霞妙砂丹后，倏忽则含形而轻举，驾飞龙游於十天八极之外，岂不优游之哉。 此玄真砂丹一丸，点汞及铅锡铜铁一斤，立化成紫磨黄金，光凝润泽，不可言尔。 余自设教神道，启於玄君，愍在俗之贤明，而述为七篇二章。 此篇本从《大洞宝经》中，仙君九品幽章隐文炼真妙诀所出，禁文甚重，非贤莫传，岂教顽凶悖戾、邪疑行尸秽质之徒见闻耳，深可忌之哉。 恐泄上古仙圣之真妙也。 大洞炼真宝经修伏灵砂妙诀竟",
      "translated_text": "Combine the cinnabar in a mortar with half a *liang* of Pu Prefecture chalcanthite and two *ge* of bitter wine, grinding thoroughly before returning it to the tripod for refinement. Each cycle requires inspection; add chalcanthite and bitter wine, grind again, then return it to the tripod for further refinement. After seven cycles—forty-nine days in total—the cinnabar will have fully submitted to the fire. Then apply *wu* fire for one day, using twenty *jin* of charcoal divided into four heaps to burn intensely. Allow it to cool for one day before opening the tripod to behold the darkly true crimson radiance cinnabar. Once the fire-submission is complete, its patterns and hues blaze resplendently, intermingling with radiant light that illuminates sun and moon—truly the most numinous of substances, the cinnabar elixir of ultimate *yang* and primal mystery.\n\nTo smelt this darkly true cinnabar, follow the previous method for divine cinnabar and numinous cinnabar. Use numinous blossoms to harmonize and guide, allowing the precious liquid to flow forth and congeal into a purple glow—this is called \"crimson radiance purple gold.\" If taken as a medicinal elixir, mix it with jujube pulp and form into pills, dividing each *liang* into three hundred and sixty. Each morning at dawn, face east and consume one pill. After ingesting this purple radiance wondrous cinnabar elixir, one will suddenly feel the body lighten and ascend, riding a flying dragon to roam beyond the ten heavens and eight limits—how could this not be the height of carefree joy?\n\nA single pill of this darkly true cinnabar elixir can transmute a *jin* of mercury, lead, tin, copper, or iron into purple-lustered yellow gold, its brilliance and luster beyond description. I, having established this divine teaching, received it from the Mysterious Lord, moved by the worthy and enlightened among the worldly, and thus composed it into seven chapters and two sections. This text originates from the *Great Cavern Treasure Scripture*, specifically the \"Nine Grades of Hidden Writings on Refining the True Wondrous Methods\" revealed by the Immortal Lords. The prohibitions on its transmission are severe; it must not be passed to the unworthy. How could it be shown to the stubborn, violent, perverse, or doubtful—those who are but walking corpses with defiled natures? Such exposure must be deeply avoided, lest the true wonders of the ancient immortals and sages be divulged.\n\nHere ends the *Great Cavern Refining the True Wondrous Methods for Subduing Numinous Cinnabar*.",
      "overlap_context": "innabar, mix it with one *ge* of bitter wine, and grind thoroughly before returning it to the tripod for further refinement. Each seven-day period constitutes one cycle. Begin with thirteen *liang* of charcoal; after each cycle, add one *liang* of charcoal. By the third cycle, add two *liang* of charcoal per cycle. One to two *liang* of five-colored, light, and fresh *jiang xia shuang* (crimson radiance frost) will fly onto the lid of the tripod, resembling wheat grains in succession—collect it.",
      "start_char": 9223,
      "end_char": 9645,
      "start_sentence": 394,
      "end_sentence": 410,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 14.059639692306519,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大洞炼真宝经修伏灵砂妙诀.txt",
        "category": "众术类"
      }
    }
  ]
}