{
  "source_id": "大洞金华玉经",
  "source_file": "chunked_daozang\\大洞金华玉经.json",
  "total_chunks": 3,
  "total_original_chars": 3471,
  "total_translated_chars": 22635,
  "total_translation_time": 106.68050956726074,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞真部\\方法类\\大洞金华玉经.txt",
    "category": "方法类"
  },
  "full_translation": "*The Great Cavern Scripture of Golden Flower and Jade*\n\nThis scripture is titled *The Great Cavern Scripture of Golden Flower and Jade*. Its author is unknown, though it likely emerged during the Northern and Southern Dynasties, having been adapted from *The Feminine One Jade-Inscribed Precious Scripture of the Five Venerables*. It comprises one scroll. The base text is drawn from the *Daoist Canon of the Zhengtong Era*, under the \"Methods\" category of the *Dongzhen* section.\n\nTo receive the esoteric transmission of the Great Cavern, wherein the Cavern-One and the Supreme Dao merge with the Feminine One in transformation, one must first recite the *Supreme Vows of the Celestial Lord* and the *Hidden Writ of the Golden Flower in Eight Stanzas by the Mysterious Mother*. These are the forbidden texts cherished within the embrace of the Nine Heavens’ Celestial Lord.\n\nWhen transmitting this to a disciple, one must first announce a fast, observing purity for one day before and after, followed by a hundred-day purification. Only then may the scripture be conferred. For the intermediate fast, seventy days; for the lesser, thirty-nine—facing the fast with ascetic rigor to ensure proper transmission. If one carelessly transmits it to an unworthy recipient without the required fast, the master of the scripture shall perish, and the receiver shall lose both luminous visions. If the fast lacks sincerity, the master shall fall ill, and the receiver shall lose speech. The weight of responsibility rests upon the master, lest the scripture be treated lightly; calamity befalls the disciple, who must guard both mouth and eyes. Transgressions bring grave misfortune across seven generations, and suffering binds the soul in the unseen trials of the afterlife.\n\nUpon receiving this scripture, one must immediately put it into practice, without negligence or violation of its covenants, adhering strictly to the prescribed methods. Serve the master of the scripture during the three fasts as one would serve a sovereign or father. Conduct the rituals in a secluded chamber within a tranquil grove, as if in perfect solitude. Cultivate the Five Spirits within the Purple Chamber as though the true numina were present.\n\nThis transmission is not to be given to those outside the bonds of sovereign and master, father and son, or elder and younger brother—thus demonstrating the true and subtle nature of its use and the difficulty of upholding its prohibitions. Do not enter a chamber that is not that of sovereign, master, father, son, or brother—thus showing restraint in one’s reach and the embrace of reclusion in unity. Do not don the robes of one who is not sovereign, master, father, son, or brother—thus limiting worldly attachments and exercising self-restraint in abundance.\n\nRefine the wondrous awareness of celestial essence, severing all worldly attachments and fleeting thoughts. Let one’s conduct be marked by perseverance through hardship, leaving no trace like a shadow vanishing in light. Let three meals suffice from mountain streams, and let one’s hidden sincerity be revealed in secluded retreat. Then shall one’s voice resound in the chambers of the Five Venerables, and one’s virtue ascend above the Three Clarities. Preserve inner concentration within luminous jade, keeping garments and headcoverings fresh and unstained. Meditate upon the Three Origins within the Mud-Pill Palace, and guard the Nine Perfected within the dwelling of form. Exhale and inhale the Five Flowers, drawing in Jade Fluid. Morning and evening, seek transcendence in the Empty Union; in sleep and waking, awaken the spirit in the Great Vast. Be diligent without weariness, earnest without cessation. Only such a person may be deemed worthy to speak of the gateways of the Great Cavern and partake in the wondrous contemplations of the Dao.\n\nThose who uphold this teaching shall ascend the Three Mornings and wander the Great Empyrean; those who violate it shall sink into the Three Springs and enter the Great Obscurity.\n\nWhen transmitting this scripture, the master must ensure the esoteric instructions are conveyed in stages, not all at once. First, impart the method and instructions so that the disciple may practice visualization, refine the Five Forms, and focus the mind upon the Purple Chamber, purging defilements and purifying the emotions. By maintaining steadfast integrity and embracing unity day and night, one awaits the presence of the numinous.\n\nThus, the hidden mystery of the Great Elixir is called *The Scripture of the Golden Flower*, and the Jade Morning of the Three Origins is known as the essence of the Feminine One. After three years of cultivating the Feminine One, one may then recite *The Thirty-Nine Chapters of the True Scripture of the Great Cavern*. Yet even now, upon receiving these instructions, one may put them into practice. By practicing these methods, one is certain to attain immortality, without needing to recite *The True Scripture of the Great Cavern* in its entirety.\n\nWhen sincerity in cultivation is profound, aligning with the true and facing the vision, the Three Origins shall manifest. From the moment one obtains this scripture, the Mysterious Void bestows its transmission, the Yellow and the Old reveal their talismans, the numinous is activated, and the Five Venerables scatter flowers. Receiving the text from the void, one ascends to the Great Non-Being.\n\nThe *Twelve Vows of the Celestial Lord* are as follows: Vow to Heaven, Vow to Earth, Vow to Wind, Vow to Cloud, Vow to Yin, Vow to Yang, Vow to the Great Void, Vow to the Great Non-Being, Vow to the Great Emptiness, Vow to the Great Possession, Vow to Self-Generation, and Vow to the Generation of Spirits.\n\nThe *Eight Gates of the Mysterious Mother in the Stanzas of Practice* are as follows: May the Mysterious Mother be born with me in the space of generative qi; may she abide with me between the sun and moon; may she protect me within the Nine Heavens; may she nourish me with the food of spontaneity; may she drink with me from the Gourd River; may she rest with me in the Jade Perfection; may she sleep with me in the Immortal Hall; may she wander with me among the Three Mysteries.\n\nWhen in a separate chamber, one must constantly recite this scripture, not forgetting it even for a moment—this is the inner vow to the Celestial Lord, opening the Eight Gates of Goodness.\n\nEven now, the immortals of the Five Peaks and the transcendents of the divine lands still partake of nectar and savor rare fruits, reciting the Great Vows, expounding the Eight Gates, aspiring to the Primal Simplicity, honoring the Three Origins, setting their minds upon the Empyrean Morning, becoming Jade Perfected, liberating seven generations, and entering the Broad Cold. How much more should this be so for the mediocre and base of the world, the lowly among the Five Defilements? Should one abandon such practice upon hearing of it?\n\nThough one may refine form and spirit through arduous effort in the cycle of rebirth, if the sins of seven generations remain unresolved, one shall have no hope of immortality. Therefore, one must invoke the Great Vows and expound the Eight Gates to dissolve these accumulated knots. Once the trials of the seven examinations are blessed, one may attain deathlessness. Deathlessness is the fundamental principle of attaining the Dao and the root origin of becoming an immortal. Those who dedicate themselves to this endeavor—how can they not strive for eternal existence?\n\nThe *Twelve Supreme Vows of the Nine Heavens’ Celestial Lord* and the *Eight Divine Gates of the Nine Numinous Mysterious Mother* enable the return to the Five Penetrations, dispel worldly calamities, bestow blessings upon the seven ancestors, and allow the practitioner to attain immortality.\n\nIn the stillness of a secluded chamber, with incense lit and smoke rising straight, recite *The Great Cavern Scripture of Golden Flower and Jade*, saying:\n\nNorthern Culmen Heavenly Sovereign,\nSupreme One Celestial Lord,\nJade Clarity and Purple Void,\nDual Radiance of Bright Perfection,\nUnsurpassed Great Dao,\nThree Origins of Primal Simplicity,\nFour Directions and Five Venerables,\nSix Canopies and Seven Mornings,\nEight Ascents and Nine Numinous,\nHidden Dao and Returning Origin,\nMysterious Mother and Five Penetrations,\nGolden Flower and Lofty Immortals,\nLife-Commanding Celestial Master,\nGreat Spirit of Generation,\nQi of the Supreme Tenuity,\nI offer this libation for the sake of the cause.\n\nMay the Nine Mysteries of the Upper Vow guard the po and support the hun, illuminating the true primal qi to converge within this body. Looking upward, I summon the supreme Five Penetrations Great Immortals; gazing downward, I invoke the Hidden Dao and Returning Origin. The accumulated sins of seven generations are now dissolved and dispersed. Receiving blessings in the Southern Palace, I sprinkle fragrant offerings at the Eight Gates.\n\nMay the Vow of Heaven, the Vow of Earth, the Vow of Wind, and the Vow of Clouds—four vows united as one—settle the register of longevity. The heavenly canopy nurtures the root of the embryo; the earth assists the radiance of the luminaries. The divine wind fans with eightfold wings; the effulgent clouds flow and fill. With the Celestial Lord, I soar together to the Upper Clarity, gazing upon the Northern Mystery, loosening my sash in the Jade Court. Blessings extend to the seven ancestors; the mysterious examination confirms the true register. The Upper Vow reaches in four directions, and longevity rivals the sun’s span.\n\nThe Middle Vow, also fourfold, governs the Celestial Lord’s scriptures. May the Vow of Yin, the Vow of Yang, the Vow of the Great Void, and the Vow of the Great Nothingness—along with the Three-Five Luminous Spirits and the dwellers of the Seven-Nine—be fulfilled. The Celestial Lord’s Primal Father, at the inception of destined life, the Jade Emperor’s congealed chariot, ever abides within my dwelling.\n\nI visualize the Purple Chamber, the Mud-Pill Palace of Peach Vigor, consolidating yin to secure the blood, while the hun is born in the Great Yang. The numinous void shines with radiance; the Great Nothingness treads the eternal. The Nine Qi of the Empty Void become my yellow robes. After seven examinations, I receive blessings and ascend as an immortal in the Southern Palace.\n\nThe Lower Vow, also fourfold, seeks the immortal courts of longevity. Thus, I vow to the Great Void, and further vow to the Great Possession. The spirit abides in the Nine Heavens; the form roams the true realms. The Celestial Lord merges and harmonizes, wandering through the Seven-Nine. Calamities depart from my chamber; blessings come to be claimed. Malicious words vanish; compliant speech flourishes.\n\nAgain, I vow for self-generation: Heaven and Earth as father. Again, I vow for spirit-generation: harmonious qi as mother. The Five Penetrations of the Returning Origin eradicate transgressions and filth. Blessings crown seven generations; transcendence endures everlastingly.\n\nMay my words ascend to the August Emperor, the Celestial Lord in harmonious chant. The chant’s melody soars beyond the clouds; eight echoes resound ten thousandfold. The numinous brush reverses its ascent; a thousand truths converge in recompense. From kalpa to kalpa, we shall forever convene in the Twelve Celebrations.\n\nGreat is the Celestial Lord’s grace—ten thousand blessings return to the Origin.\n\nFurther, I vow to the Eight Gates Mysterious Mother, who crafts the divine chant of the Eight Gates, her gaze profound in the Nine Numinous Cavern. In the Upper Vow to the Mysterious Mother, may she be born with me amid the qi of generation, enabling the Purple Effulgence to merge with the void, uniting heaven and humanity in accord. Soaring as an immortal on feathered wings, may I join her in flight. Heavenly music delights the heart; a hundred sorrows are cast aside. The Seven Mysteries rejoice; the Upper Numinous lends its support.\n\nIn the Second Vow to the Mysterious Mother, may she abide with me amid the sun and moon, at the juncture of the Three Lights. The Great Emperor’s paired chariots, azure banners and emerald canopies, flowered chariots and embroidered robes, brocade garments and jade belts—together we escort the Five Venerables, joining the four great assemblies. Entering the feast of the Flowery Cold, we gaze beyond the Eight Extremities.\n\nIn the Third Vow to the Mysterious Mother, may she safeguard me amid the Nine Heavens, where true radiance congeals in perfection. With a heart made level through inner refinement, qi overflows the numinous hall, summoning myriad spirits. My body ascends to the Nine Firmaments; the examination of blessings delves into the profound mystery. Loosening my sash in the Empty Sameness, I grasp the wheel and ascend the layered heavens. Blessings extend through seven generations; I am reborn as a human. I safeguard the Great Perfected, sharing the sun’s lifespan.\n\nIn the Fourth Vow to the Mysterious Mother, may she dine with me amid the spontaneity of nature, forever departing the Three Paths to eternally join the natural order. Seven-jeweled jade grains, golden elixirs with purple auras, hidden mushrooms plucked from the right, luminous night-pearls gathered from the left—phoenix embryos and tiger froth, cloud jades and jasper frosts. With a single taste of these wondrous flavors, my body brushes the Great Void.\n\nIn the Fifth Vow to the Mysterious Mother, may she drink with me amid the Gourd River’s currents, where the flowing springs of ten thousand cliffs are both clear and sweet. The returning waters of jade essence, numinous moisture of azure indigo, ascend to the remotest heavens, streaming into the divine hall. Waves surge and swell, stirring the Great Void. Floating and roaming in the vast clarity, drinking and rinsing at the Eastern Mound, I bow to the rosy dawn. Wondrous joy in the azure waves—after seven examinations, I attain immortality. Blessings overflow; my body pledges the Nine Rivers, and wherever I turn, all becomes well.\n\nIn the Sixth Vow to the Mysterious Mother, may she rest with me amid the Jade Perfected’s precincts. Vast is the upper seat; the ravines stretch into the limpid heavens. The Five Venerables array their chambers; the Jade Effulgence announces its numinosity. The Queen Mother of the West’s flying chariot, feathered banners streaming, arrives with me to repose in the Nine Mysteries’ court. Blessings accumulate for seven examinations; I receive the embryo and am reborn. My body coils within the jeweled palace; my spirit nests in the perfect clarity.\n\nIn the Seventh Vow to the Mysterious Mother, may she sleep with me amid the immortal halls. In the secluded and wondrous numinous chamber, the mysterious effulgence is arrayed on all sides. Vermilion structures with phoenix frameworks, radiance reflecting the eaves, golden beds and jade couches, purple curtains and dragon gates—above sits the Mysterious Emperor; in the center, the Heavenly Perfected. I occupy the right, adorned with sashes and brocade. Great blessings extend through seven examinations; I receive the scripture and am reborn.\n\nIn the Eighth Vow to the Mysterious Mother, may she wander with me amid the Three Mysteries. Thus, I rein in the vast desert; my chariot turns through the Three Mysteries. The Five Venerables lend their support; the Queen Mother stands shoulder to shoulder. Dancing wheels on the divine mounds, halting the chariot in the Nine Heavens, I settle the scripture of the Supreme and receive the rank of Perfected. The feminine and masculine unite in the Ninefold Harmony, from billions to thousands. The Eight Echoes of the Cavern Scripture resound; seven ancestors attain immortality. From kalpa to kalpa, we shall forever convene in the Eight Gates.\n\nWhere do the Eight Gates abide? Forever within my cause. The Five Venerables descend blessings; the Dao and virtue flourish abundantly. Ten thousand qi ascend and generate; the Mud-Pill Palace is firmly secured.\n\nWhen the vows are complete, may my years equal the sun and moon. Great is the emptiness of life; the Mysterious Mother moves and rests within the Eight Gates’ progression.\n\nThe Way of the Great Unity in the Cyclical Fusion of the Emperor—cultivate the Nine Diagrams. After reciting this scripture and visualizing the invocation of the capital’s names, close both eyes and visualize the hundred spirits transforming into white qi, resembling the smoke of burning incense, emerging from the mysterious void to enter the mouth. Dense and billowing for a long while, the white qi descends, exiting through the lower orifices and the Jade Stem aperture. Then, the white qi emerges from the soles of the feet and the palms, enveloping the entire body—head, limbs, hands, and feet—merging into one. Together with the white qi, like smoke ascending and descending, they become indistinguishable.\n\nAfter a long while, the white qi suddenly changes color, transforming into a dense purple cloud. It re-enters through the mouth into the head, filling the Five Viscera and permeating the abdomen.\n\nAfter a long while, the purple cloud again emerges from the soles of the feet, the palms, the major apertures, and the Jade Stem aperture, encircling and enveloping the entire body. For a long while, it billows and rises, merging with the purple cloud in form, becoming indistinguishable.\n\nIn an instant, visualize the qi of the purple cloud filling the left and right sides and the entire chamber. Then, visualize a fan of wind and qi emerging from the mouth, causing the smoke of the purple cloud to swirl and intertwine, coiling and binding together. Suddenly, it transforms into a perfected person, male in form, appearing as a newborn, four *fen* in height, named the Venerable Lord of the Great Cavern, Imperial Unity. His name is Father Ningzai, his style is Union of Mother’s Essence. He is the host of the multitude of spirits guarding the Gate of Death, the convergence of the revolving wind, together forming the Venerable Lord of Imperial Unity.\n\nNext, visualize this Venerable Lord entering through your mouth beneath the tongue, then ascending directly to the Purple Chamber of the Six Harmonies Palace, where he sits facing outward. In his left hand, he holds your Five Registers; in his right, your Five Talismans. To the left of the Venerable Lord’s mouth shines the light of the sun, nine *fen* in diameter; to the right, the light of the moon, one *cun* in diameter. From the Venerable Lord’s mouth and tongue issues the qi of the revolving wind, blowing upon the lights of the sun and moon, causing them to billow—now white, now red. Their radiant qi descends into your Five Viscera, Six Bowels, hundred joints, and the entirety of your body, illuminating it so that inside and out, it becomes as bright as daylight. After a long while, you forget your own form, and suddenly, the practice is complete.\n\nThis diagram sketches the image between the brows; visualize it as in the eighth diagram, with the great presence in the Purple Chamber of the Six Harmonies Palace—this is the Mud Pill Palace of the Six Harmonies. Then, recite the prayer:\n\n*\"Great Cavern Imperial Unity, venerable spirit of the Grand Simplicity,\nFather Ning and Mother Essence, dual union in perfect pair,\nHundred perfected in grand convergence, revolving wind’s first birth,\nBody woven of eightfold mist, transforming the primordial womb’s infant,\nJewels of sun and moon’s light, illuminating my form,\nGrand Unity above, merging with the Imperial One,\nMud Pill preserves jade, Five Viscera bloom in splendor,\nEternally conjoined with sun and moon, holding the Cavern Scripture,\nAscending as an immortal elder, spirit rising to the Upper Clarity,\nThirty-nine chapters, golden talismans of the Feathered Court.\"*\n\nThis is the Dao of the revolving wind’s grand convergence with Imperial Unity, complete in itself. Myriad transformations and hundredfold changes, the methods of the Cavern Perfected and Grand Unity, reach their utmost here.\n\nAt night, constantly visualize the Venerable Lord of the Great Cavern, Imperial Unity, at the center of your philtrum beneath the nose. By day, constantly visualize him outside the upper teeth within the mouth, inside the upper lip above the philtrum. The Venerable Lord’s form should always face outward, whether sitting, standing, or moving—hold him in mind. Visualize the Venerable Lord’s mouth holding the light of the sun, nine *fen* in diameter, shining with boundless brilliance, equally illuminating your body.\n\nThe One is the true unity of the Imperial Lord. The transformations of the One return to the One. When reciting the *True Scripture of the Great Cavern*, also visualize the Venerable Lord Imperial Unity before you, with the divine lord’s mouth facing your own, listening to the sound of your recitation of the Cavern Scripture, thereby dissolving the knots of seven generations.\n\nThe Venerable Lord Imperial Unity, whose taboo name is Father Ningzai and style is Union of Mother’s Essence, must be constantly remembered day and night without forgetfulness. He averts ten thousand trials, extinguishes a thousand afflictions, dispels evil demons, and brings about immortality. If there is any pain or discomfort in your body, swiftly visualize the Venerable Lord Imperial Unity, commanding him to exhale the white qi of the sun’s light to fumigate the afflicted area—the pain will immediately be cured.\n\nThe Venerable Lord Imperial Unity appears as a newborn male, unclothed, four *fen* in body length. This is the true form of the grand convergence returning to the womb, the primal shape of inception.\n\n**Thirteen Diagrams of the Inner Methods of the Great Cavern for Cultivating Yin-Yang Perfected Unity**\nArranged according to the Nine Palaces, front and back, facing and turned away, shadows overlapping, they cannot be seen directly, making it difficult to depict them in frontal diagrams. Now, following the sequence, they are placed to the right, drawn in frontal view to avoid obscurity. If drawn in profile, the visualization would be incorrect. Please visualize the true spirits of each palace all facing forward in proper seated posture. Among them, the Three Perfected should face one another, as if in secluded retreat. The first *cun* with the Hall of Light together make one *cun*; though drawn correctly, they are still positioned to the right.\n\nRefine the visualization with precision, and after nine years of practice, you will ascend to heaven in broad daylight.\n\n**The Scripture of the Golden Flower and Jade Cavern concludes.**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "大洞金华玉经 经名：大洞金华玉经。 撰人不详，约出於南北期。 系改编《雌一玉检五老宝经》而成。 一卷。 底本出处：《正统道藏》洞真部方法类。 大洞金华玉经 夫得受大洞之诀，洞一上道雌一合变，当先诵帝君上愿、玄母八间金华隐书。 斯乃九天帝君怀中禁书也。 若传授弟子，当先告斋，前后各一日，又清斋一百日，乃得付之。 中斋七十日、下斋三十九日，对斋苦行，而相传授焉。 不审其人，无斋而传付者，经师当死，受者失两明焉。 斋不苦切，经师当病，受者失口焉。 施重於经师，防轻览也。 灾加於弟子，慎口目矣。 愆重祸於七世，患结生於冥考。 若得此经，受便施行，不得愆犯懈替，宣泄之约，一如上法。 馔经师於三斋，如奉君父焉。 考幽室於闲林，如寂无人焉。 存五神於紫房，如真灵之在焉。 非君师、父子、兄弟之施者，必勿受矣，示虚真之物用，明守禁之难犯也。 非君师、父子、兄弟之室者，必勿履矣。 示止足之勿广，明隐逸之抱一也。 非君师、父子、兄弟之服者，必勿服矣，示天亲之勿多，明盈溢以自裁也。 研天精之妙觉，绝万累之近想，而至行彰於辛苦，绝迹同於无景，三餐足於山涧，密诚着於遂往。 尔乃声驰於五老之室，德举於三清之上，保内凝於明玉，使衣巾鲜而不秽，念三元於泥丸，守九真於形宅，吐纳五华，呼吸玉液，朝暮求仙於空同，寝息启神於太漠，孜孜不倦，勤勤不释。 如此之人，始可与言大洞之门户，预求道之妙想矣。 奉之者登三晨，游太霄，违之者没三泉，入太幽。 夫传授之者，当令经诀再出，勿顿授者也。 先授法诀者，欲令其施行存思，精炼五形，感念紫房，流秽荡情，专贞抱一，旦夕期灵。 故大丹隐玄，号曰《金华经》，三元玉晨，是曰雌一精也。 按存修雌一三年之后，乃又得诵《大洞真经三十九章》耳。 今受此诀，亦得施行，施行诀事，必获神仙，不必俱持《大洞真经》 而一通之也。 夫存感笃诚，合真对景，三元见矣。 自获此经，玄虚降授，黄老告符，运灵引曜，五老散华，空中受文，即登太无。 帝君十二愿篇目曰：愿天、愿地、愿风、愿云、愿阴、愿阳、愿太空、愿太无、愿太虚、愿大有、愿自生、愿生神也。 玄母八门行间篇目曰：愿玄母与我俱生於生气之间，与我俱存於日月之间，与我俱保於九天之间，与我俱食於自然之间，与我俱饮於匏河之间，与我俱息於玉真之间，与我俱寝於仙堂之间，与我俱游於三玄之间。 兆在别室，常当读是经，不忘须臾，此为内愿帝君，开善八间者矣。 今五岳诸仙，及神州仙女，犹酌琼浆而按珍果，说大愿，陈八间，期太素，奉三元，志霄晨，为玉真，拔七世，入广寒，岂况世中之庸猥，五浊之微贱者哉。 当可替而修，闻而不为耶？ 夫形神虽精苦於生生，而七世有罪，而不解者，己亦必无仙冀也。 是以须启大愿，陈八间，以释其积结耳。 七考既福，兆乃可不死，不死者乃得道之宗本，为仙之根始，志行是业者，可不勉励於长存哉。 九天帝君十二上愿、九灵玄母八间神门文，回元五通，禳除世殃，上福七祖，身致神仙。 静於密室，散香正烟，而读《大洞金华经》曰： 北极天皇，太一帝君，玉清紫虚，二景明圆，无上大道，太素三元，四方五老，六盖七晨，八上九灵，隐道回元，玄母五通，金华高仙，司命天师、主生大神，太微天炁，以醮因绿。",
      "translated_text": "*The Great Cavern Scripture of Golden Flower and Jade*\n\nThis scripture is titled *The Great Cavern Scripture of Golden Flower and Jade*. Its author is unknown, though it likely emerged during the Northern and Southern Dynasties, having been adapted from *The Feminine One Jade-Inscribed Precious Scripture of the Five Venerables*. It comprises one scroll. The base text is drawn from the *Daoist Canon of the Zhengtong Era*, under the \"Methods\" category of the *Dongzhen* section.\n\nTo receive the esoteric transmission of the Great Cavern, wherein the Cavern-One and the Supreme Dao merge with the Feminine One in transformation, one must first recite the *Supreme Vows of the Celestial Lord* and the *Hidden Writ of the Golden Flower in Eight Stanzas by the Mysterious Mother*. These are the forbidden texts cherished within the embrace of the Nine Heavens’ Celestial Lord.\n\nWhen transmitting this to a disciple, one must first announce a fast, observing purity for one day before and after, followed by a hundred-day purification. Only then may the scripture be conferred. For the intermediate fast, seventy days; for the lesser, thirty-nine—facing the fast with ascetic rigor to ensure proper transmission. If one carelessly transmits it to an unworthy recipient without the required fast, the master of the scripture shall perish, and the receiver shall lose both luminous visions. If the fast lacks sincerity, the master shall fall ill, and the receiver shall lose speech. The weight of responsibility rests upon the master, lest the scripture be treated lightly; calamity befalls the disciple, who must guard both mouth and eyes. Transgressions bring grave misfortune across seven generations, and suffering binds the soul in the unseen trials of the afterlife.\n\nUpon receiving this scripture, one must immediately put it into practice, without negligence or violation of its covenants, adhering strictly to the prescribed methods. Serve the master of the scripture during the three fasts as one would serve a sovereign or father. Conduct the rituals in a secluded chamber within a tranquil grove, as if in perfect solitude. Cultivate the Five Spirits within the Purple Chamber as though the true numina were present.\n\nThis transmission is not to be given to those outside the bonds of sovereign and master, father and son, or elder and younger brother—thus demonstrating the true and subtle nature of its use and the difficulty of upholding its prohibitions. Do not enter a chamber that is not that of sovereign, master, father, son, or brother—thus showing restraint in one’s reach and the embrace of reclusion in unity. Do not don the robes of one who is not sovereign, master, father, son, or brother—thus limiting worldly attachments and exercising self-restraint in abundance.\n\nRefine the wondrous awareness of celestial essence, severing all worldly attachments and fleeting thoughts. Let one’s conduct be marked by perseverance through hardship, leaving no trace like a shadow vanishing in light. Let three meals suffice from mountain streams, and let one’s hidden sincerity be revealed in secluded retreat. Then shall one’s voice resound in the chambers of the Five Venerables, and one’s virtue ascend above the Three Clarities. Preserve inner concentration within luminous jade, keeping garments and headcoverings fresh and unstained. Meditate upon the Three Origins within the Mud-Pill Palace, and guard the Nine Perfected within the dwelling of form. Exhale and inhale the Five Flowers, drawing in Jade Fluid. Morning and evening, seek transcendence in the Empty Union; in sleep and waking, awaken the spirit in the Great Vast. Be diligent without weariness, earnest without cessation. Only such a person may be deemed worthy to speak of the gateways of the Great Cavern and partake in the wondrous contemplations of the Dao.\n\nThose who uphold this teaching shall ascend the Three Mornings and wander the Great Empyrean; those who violate it shall sink into the Three Springs and enter the Great Obscurity.\n\nWhen transmitting this scripture, the master must ensure the esoteric instructions are conveyed in stages, not all at once. First, impart the method and instructions so that the disciple may practice visualization, refine the Five Forms, and focus the mind upon the Purple Chamber, purging defilements and purifying the emotions. By maintaining steadfast integrity and embracing unity day and night, one awaits the presence of the numinous.\n\nThus, the hidden mystery of the Great Elixir is called *The Scripture of the Golden Flower*, and the Jade Morning of the Three Origins is known as the essence of the Feminine One. After three years of cultivating the Feminine One, one may then recite *The Thirty-Nine Chapters of the True Scripture of the Great Cavern*. Yet even now, upon receiving these instructions, one may put them into practice. By practicing these methods, one is certain to attain immortality, without needing to recite *The True Scripture of the Great Cavern* in its entirety.\n\nWhen sincerity in cultivation is profound, aligning with the true and facing the vision, the Three Origins shall manifest. From the moment one obtains this scripture, the Mysterious Void bestows its transmission, the Yellow and the Old reveal their talismans, the numinous is activated, and the Five Venerables scatter flowers. Receiving the text from the void, one ascends to the Great Non-Being.\n\nThe *Twelve Vows of the Celestial Lord* are as follows: Vow to Heaven, Vow to Earth, Vow to Wind, Vow to Cloud, Vow to Yin, Vow to Yang, Vow to the Great Void, Vow to the Great Non-Being, Vow to the Great Emptiness, Vow to the Great Possession, Vow to Self-Generation, and Vow to the Generation of Spirits.\n\nThe *Eight Gates of the Mysterious Mother in the Stanzas of Practice* are as follows: May the Mysterious Mother be born with me in the space of generative qi; may she abide with me between the sun and moon; may she protect me within the Nine Heavens; may she nourish me with the food of spontaneity; may she drink with me from the Gourd River; may she rest with me in the Jade Perfection; may she sleep with me in the Immortal Hall; may she wander with me among the Three Mysteries.\n\nWhen in a separate chamber, one must constantly recite this scripture, not forgetting it even for a moment—this is the inner vow to the Celestial Lord, opening the Eight Gates of Goodness.\n\nEven now, the immortals of the Five Peaks and the transcendents of the divine lands still partake of nectar and savor rare fruits, reciting the Great Vows, expounding the Eight Gates, aspiring to the Primal Simplicity, honoring the Three Origins, setting their minds upon the Empyrean Morning, becoming Jade Perfected, liberating seven generations, and entering the Broad Cold. How much more should this be so for the mediocre and base of the world, the lowly among the Five Defilements? Should one abandon such practice upon hearing of it?\n\nThough one may refine form and spirit through arduous effort in the cycle of rebirth, if the sins of seven generations remain unresolved, one shall have no hope of immortality. Therefore, one must invoke the Great Vows and expound the Eight Gates to dissolve these accumulated knots. Once the trials of the seven examinations are blessed, one may attain deathlessness. Deathlessness is the fundamental principle of attaining the Dao and the root origin of becoming an immortal. Those who dedicate themselves to this endeavor—how can they not strive for eternal existence?\n\nThe *Twelve Supreme Vows of the Nine Heavens’ Celestial Lord* and the *Eight Divine Gates of the Nine Numinous Mysterious Mother* enable the return to the Five Penetrations, dispel worldly calamities, bestow blessings upon the seven ancestors, and allow the practitioner to attain immortality.\n\nIn the stillness of a secluded chamber, with incense lit and smoke rising straight, recite *The Great Cavern Scripture of Golden Flower and Jade*, saying:\n\nNorthern Culmen Heavenly Sovereign,\nSupreme One Celestial Lord,\nJade Clarity and Purple Void,\nDual Radiance of Bright Perfection,\nUnsurpassed Great Dao,\nThree Origins of Primal Simplicity,\nFour Directions and Five Venerables,\nSix Canopies and Seven Mornings,\nEight Ascents and Nine Numinous,\nHidden Dao and Returning Origin,\nMysterious Mother and Five Penetrations,\nGolden Flower and Lofty Immortals,\nLife-Commanding Celestial Master,\nGreat Spirit of Generation,\nQi of the Supreme Tenuity,\nI offer this libation for the sake of the cause.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1293,
      "start_sentence": 0,
      "end_sentence": 45,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.70351696014404,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\大洞金华玉经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "上愿九玄，护魄扶魂，明真元炁，并来在身，仰招无上，五通大仙，俯逮无下，隐道回元，七世积罪，今为结散，受福南宫，洒香八门。 愿天、愿地、愿风、愿云、四愿一合，定籍长生，天盖胎根，地助曜灵，神风八扇，景云流盈，我与帝君，同飙上清，观眄北玄，解带玉庭，庆加七祖，玄考科真，上愿四达，寿与日倾。 中愿亦四，领理帝君书，愿阴、愿阳，愿太空，愿太无、三五明神，七九所居，帝君元父，定生之初，玉皇凝驾，常在我庐。 我存紫房，泥丸桃康，凝阴固血，魂生太阳，灵空＠晖，太无履长，空无九炁，与我黄裳，七考介福，受仙南宫。 下愿亦四，长生仙府，乃愿太虚，又愿大有，神存九天，形游真宇，帝君混合，徊游七九，祸去我室，福来我取，恶言消亡，顺言善愈。 复愿自生，天地为父，复愿神生，和气为母，回元五通，有除罪垢，福冠七叶，超生弥久。 愿言高皇，帝君合唱，唱音逸霄，八响万畅，灵翰逆冲，千真同偿，从劫至劫，常会十二庆。 大哉帝君恩，万福回元。 又愿八间玄母，造神八间之唱，九灵洞眄。 上愿玄母，与我俱生於生气之间，得使紫景＠虚，天人合符，飞真凌羽，而我与之俱，天乐娱心，离脱百忧，七玄称庆，上灵所扶。 次愿玄母，与我俱存於日月之间，三光之际，大帝并軿，青旄绿盖，华軿绣帔，锦服玉带，携提五老，同宾四大，入晏华寒，出眄八外。 三愿玄母，与我俱保於九天之间，乃凝真圆曜，夷心内炼，炁溢灵堂，感神万千，身升九霄，考福重玄，散带空同，抚轮累天，吉享七世，更生为人，我保太真，与日同年。 四愿玄母，与我俱食於自然之间，永离三徒，长会自然，七宝玉粒，金丹紫芒，隐芝右掇，左拾夜光，凤胎虎沫，云琅琼霜，奇味一御，则身拂太空。 五愿玄母，与我俱饮於匏河之间，而流津万崖，既清且甘，回水玉精，灵润碧蓝，上注绝霄，流源神堂，横波郁踊，鼓扇太空，浮游浩清，饮嗽东蒙，高揖霞晨，奇乐沧浪，七考得仙，介福洋洋，体誓九河，所向成康。 六愿玄母，与我俱息於玉真之间，浩哉上座，涧邈霄清，五老罗室，玉华告灵，西王飞轩，策羽流軿，与我俱息，九玄之庭，庆锺七考，受胎更生，身盘琼宇，神栖圆明。 七愿玄母，与我俱寝於仙堂之间，幽妙灵房，玄华四陈，朱宇凤构，光明映轩，金床玉榻，紫帷龙门，上坐玄皇，中席天真，我处其右，携带缠锦，大福七考，受书更生。 八愿玄母，与我俱游於三玄之间，乃逸辔太漠，回軿三玄，五老扶胥，王母比肩，舞轮神丘，停驾九天，定书太上，受位为真，雌一九混，从亿至千，洞经八响，七祖获仙，从劫至劫，常会八间。 八间在何，永我因绿，五老降福，道德诜诜，万气上生，固保泥丸。 愿言既毕，日月同年，大哉虚生，玄母动静，八门行间。 徊风大混合帝一之道存修九图 修本经，存祝名都毕，更闭两目，存此百神变成白气，如耳烟之状，从玄虚中来入口中，郁郁良久，觉白气下，从下部孔中出，又从玉茎孔一中出。 又觉白气从两脚底、两手心中出，并冠缠一躯，上下手足， 混合一身。 与白气同烟上下，不相见也。 良久，白气忽复变色，成紫云郁郁，又从我口中入头中，及至五藏间，充满腹内。",
      "translated_text": "May the Nine Mysteries of the Upper Vow guard the po and support the hun, illuminating the true primal qi to converge within this body. Looking upward, I summon the supreme Five Penetrations Great Immortals; gazing downward, I invoke the Hidden Dao and Returning Origin. The accumulated sins of seven generations are now dissolved and dispersed. Receiving blessings in the Southern Palace, I sprinkle fragrant offerings at the Eight Gates.\n\nMay the Vow of Heaven, the Vow of Earth, the Vow of Wind, and the Vow of Clouds—four vows united as one—settle the register of longevity. The heavenly canopy nurtures the root of the embryo; the earth assists the radiance of the luminaries. The divine wind fans with eightfold wings; the effulgent clouds flow and fill. With the Celestial Lord, I soar together to the Upper Clarity, gazing upon the Northern Mystery, loosening my sash in the Jade Court. Blessings extend to the seven ancestors; the mysterious examination confirms the true register. The Upper Vow reaches in four directions, and longevity rivals the sun’s span.\n\nThe Middle Vow, also fourfold, governs the Celestial Lord’s scriptures. May the Vow of Yin, the Vow of Yang, the Vow of the Great Void, and the Vow of the Great Nothingness—along with the Three-Five Luminous Spirits and the dwellers of the Seven-Nine—be fulfilled. The Celestial Lord’s Primal Father, at the inception of destined life, the Jade Emperor’s congealed chariot, ever abides within my dwelling.\n\nI visualize the Purple Chamber, the Mud-Pill Palace of Peach Vigor, consolidating yin to secure the blood, while the hun is born in the Great Yang. The numinous void shines with radiance; the Great Nothingness treads the eternal. The Nine Qi of the Empty Void become my yellow robes. After seven examinations, I receive blessings and ascend as an immortal in the Southern Palace.\n\nThe Lower Vow, also fourfold, seeks the immortal courts of longevity. Thus, I vow to the Great Void, and further vow to the Great Possession. The spirit abides in the Nine Heavens; the form roams the true realms. The Celestial Lord merges and harmonizes, wandering through the Seven-Nine. Calamities depart from my chamber; blessings come to be claimed. Malicious words vanish; compliant speech flourishes.\n\nAgain, I vow for self-generation: Heaven and Earth as father. Again, I vow for spirit-generation: harmonious qi as mother. The Five Penetrations of the Returning Origin eradicate transgressions and filth. Blessings crown seven generations; transcendence endures everlastingly.\n\nMay my words ascend to the August Emperor, the Celestial Lord in harmonious chant. The chant’s melody soars beyond the clouds; eight echoes resound ten thousandfold. The numinous brush reverses its ascent; a thousand truths converge in recompense. From kalpa to kalpa, we shall forever convene in the Twelve Celebrations.\n\nGreat is the Celestial Lord’s grace—ten thousand blessings return to the Origin.\n\nFurther, I vow to the Eight Gates Mysterious Mother, who crafts the divine chant of the Eight Gates, her gaze profound in the Nine Numinous Cavern. In the Upper Vow to the Mysterious Mother, may she be born with me amid the qi of generation, enabling the Purple Effulgence to merge with the void, uniting heaven and humanity in accord. Soaring as an immortal on feathered wings, may I join her in flight. Heavenly music delights the heart; a hundred sorrows are cast aside. The Seven Mysteries rejoice; the Upper Numinous lends its support.\n\nIn the Second Vow to the Mysterious Mother, may she abide with me amid the sun and moon, at the juncture of the Three Lights. The Great Emperor’s paired chariots, azure banners and emerald canopies, flowered chariots and embroidered robes, brocade garments and jade belts—together we escort the Five Venerables, joining the four great assemblies. Entering the feast of the Flowery Cold, we gaze beyond the Eight Extremities.\n\nIn the Third Vow to the Mysterious Mother, may she safeguard me amid the Nine Heavens, where true radiance congeals in perfection. With a heart made level through inner refinement, qi overflows the numinous hall, summoning myriad spirits. My body ascends to the Nine Firmaments; the examination of blessings delves into the profound mystery. Loosening my sash in the Empty Sameness, I grasp the wheel and ascend the layered heavens. Blessings extend through seven generations; I am reborn as a human. I safeguard the Great Perfected, sharing the sun’s lifespan.\n\nIn the Fourth Vow to the Mysterious Mother, may she dine with me amid the spontaneity of nature, forever departing the Three Paths to eternally join the natural order. Seven-jeweled jade grains, golden elixirs with purple auras, hidden mushrooms plucked from the right, luminous night-pearls gathered from the left—phoenix embryos and tiger froth, cloud jades and jasper frosts. With a single taste of these wondrous flavors, my body brushes the Great Void.\n\nIn the Fifth Vow to the Mysterious Mother, may she drink with me amid the Gourd River’s currents, where the flowing springs of ten thousand cliffs are both clear and sweet. The returning waters of jade essence, numinous moisture of azure indigo, ascend to the remotest heavens, streaming into the divine hall. Waves surge and swell, stirring the Great Void. Floating and roaming in the vast clarity, drinking and rinsing at the Eastern Mound, I bow to the rosy dawn. Wondrous joy in the azure waves—after seven examinations, I attain immortality. Blessings overflow; my body pledges the Nine Rivers, and wherever I turn, all becomes well.\n\nIn the Sixth Vow to the Mysterious Mother, may she rest with me amid the Jade Perfected’s precincts. Vast is the upper seat; the ravines stretch into the limpid heavens. The Five Venerables array their chambers; the Jade Effulgence announces its numinosity. The Queen Mother of the West’s flying chariot, feathered banners streaming, arrives with me to repose in the Nine Mysteries’ court. Blessings accumulate for seven examinations; I receive the embryo and am reborn. My body coils within the jeweled palace; my spirit nests in the perfect clarity.\n\nIn the Seventh Vow to the Mysterious Mother, may she sleep with me amid the immortal halls. In the secluded and wondrous numinous chamber, the mysterious effulgence is arrayed on all sides. Vermilion structures with phoenix frameworks, radiance reflecting the eaves, golden beds and jade couches, purple curtains and dragon gates—above sits the Mysterious Emperor; in the center, the Heavenly Perfected. I occupy the right, adorned with sashes and brocade. Great blessings extend through seven examinations; I receive the scripture and am reborn.\n\nIn the Eighth Vow to the Mysterious Mother, may she wander with me amid the Three Mysteries. Thus, I rein in the vast desert; my chariot turns through the Three Mysteries. The Five Venerables lend their support; the Queen Mother stands shoulder to shoulder. Dancing wheels on the divine mounds, halting the chariot in the Nine Heavens, I settle the scripture of the Supreme and receive the rank of Perfected. The feminine and masculine unite in the Ninefold Harmony, from billions to thousands. The Eight Echoes of the Cavern Scripture resound; seven ancestors attain immortality. From kalpa to kalpa, we shall forever convene in the Eight Gates.\n\nWhere do the Eight Gates abide? Forever within my cause. The Five Venerables descend blessings; the Dao and virtue flourish abundantly. Ten thousand qi ascend and generate; the Mud-Pill Palace is firmly secured.\n\nWhen the vows are complete, may my years equal the sun and moon. Great is the emptiness of life; the Mysterious Mother moves and rests within the Eight Gates’ progression.\n\nThe Way of the Great Unity in the Cyclical Fusion of the Emperor—cultivate the Nine Diagrams. After reciting this scripture and visualizing the invocation of the capital’s names, close both eyes and visualize the hundred spirits transforming into white qi, resembling the smoke of burning incense, emerging from the mysterious void to enter the mouth. Dense and billowing for a long while, the white qi descends, exiting through the lower orifices and the Jade Stem aperture. Then, the white qi emerges from the soles of the feet and the palms, enveloping the entire body—head, limbs, hands, and feet—merging into one. Together with the white qi, like smoke ascending and descending, they become indistinguishable.\n\nAfter a long while, the white qi suddenly changes color, transforming into a dense purple cloud. It re-enters through the mouth into the head, filling the Five Viscera and permeating the abdomen.",
      "overlap_context": "preme One Celestial Lord,\nJade Clarity and Purple Void,\nDual Radiance of Bright Perfection,\nUnsurpassed Great Dao,\nThree Origins of Primal Simplicity,\nFour Directions and Five Venerables,\nSix Canopies and Seven Mornings,\nEight Ascents and Nine Numinous,\nHidden Dao and Returning Origin,\nMysterious Mother and Five Penetrations,\nGolden Flower and Lofty Immortals,\nLife-Commanding Celestial Master,\nGreat Spirit of Generation,\nQi of the Supreme Tenuity,\nI offer this libation for the sake of the cause.",
      "start_char": 1293,
      "end_char": 2558,
      "start_sentence": 46,
      "end_sentence": 70,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.99195909500122,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\大洞金华玉经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "良久，紫云又从两足底、两掌心、大孔、玉茎孔中出，冠绕一体。 良久，郁然上下，与紫云合形，不相见也。 须臾，存紫云之气，充满左右及一室之内，又存见口中出风气之扇，紫云之烟乃回转，更相缠绕结。 忽成一真人，男形也，始生之状，长四分，号曰大洞帝一尊君，名父宁在，字合母精，是守死关之众神，回风混合，共成帝一之尊君也。 又存此尊君，来入我口中舌下，复从舌下径上升紫房六合宫，平坐，外向尊君，左手把兆五籍，右手把兆五符，尊君口之左边有日光，径九分，尊君口之右边有月光，径一寸，尊君口舌吐徊风之气，吹此日月之光，皆郁郁，或白色，或赤色，令光气下入兆五藏、六府、百节，一身之内，洞彻朗然，内外如白日之状。 良久忘身，忽然事讫。 此图眉间略画形像，即存如第八图，大在紫房六合宫，即泥丸宫是六合。 乃心祝曰： 大洞帝一，太素尊灵，父宁母精，二合双成，百真大混，一徊始生，身结八烟，变胎元婴，日月宝光，洞我躯形，太一在上，与帝合并，泥丸保玉，五藏华明，长合日月，手执洞经，位为仙翁，神升上清，三十九章，金符羽庭。 此是徊风大混合帝一之道，毕也。 万变百化，洞真太一之法，极尽於此矣。 夕夕常存大洞帝一尊君，在兆鼻下人中中央，白日常存在口内上齿之外，鼻下人中上唇之裹也。 尊君形皆当向外，坐立起居在意存之。 存尊君口中衔日光，径九分，昭明万丈，同朗兆身。 夫一者，帝之真一也。 一之所变，归一者也。 读〔大〕洞真经时，亦存帝一尊君，在兆面前，以尊神口对兆之口间，令相向，听我读洞经之音，以散七世之结焉。 帝一尊君，讳父宁在，字合母精，日夕怛忆之勿忘，辟万试，灭千患，除恶魔，致神仙也。 若兆体中有疾痛不宁处，急存帝一尊君，令口吐日光白气，熏我痛疾处，痛疾即愈也。 帝一尊君，形如始生之男，不着衣服，身长四分耳。 所谓大混反胎，始形之真也。 大洞内法存修雌雄真一十三图 按九宫前后，逐宫相杳，向背遮影，不能对见，难以正面图画。 今据排次第，即在右侧，作正面画却沉，若侧身画，即又存想不正。 请存各宫真神，并面向前正坐，其中三真者，即二真相对，令如隐居注。 首寸与明堂，共得一寸，虽正画成，亦系在右边也。 精详存用，如经九年，白日升天。 大洞金华玉经竟",
      "translated_text": "After a long while, the purple cloud again emerges from the soles of the feet, the palms, the major apertures, and the Jade Stem aperture, encircling and enveloping the entire body. For a long while, it billows and rises, merging with the purple cloud in form, becoming indistinguishable.\n\nIn an instant, visualize the qi of the purple cloud filling the left and right sides and the entire chamber. Then, visualize a fan of wind and qi emerging from the mouth, causing the smoke of the purple cloud to swirl and intertwine, coiling and binding together. Suddenly, it transforms into a perfected person, male in form, appearing as a newborn, four *fen* in height, named the Venerable Lord of the Great Cavern, Imperial Unity. His name is Father Ningzai, his style is Union of Mother’s Essence. He is the host of the multitude of spirits guarding the Gate of Death, the convergence of the revolving wind, together forming the Venerable Lord of Imperial Unity.\n\nNext, visualize this Venerable Lord entering through your mouth beneath the tongue, then ascending directly to the Purple Chamber of the Six Harmonies Palace, where he sits facing outward. In his left hand, he holds your Five Registers; in his right, your Five Talismans. To the left of the Venerable Lord’s mouth shines the light of the sun, nine *fen* in diameter; to the right, the light of the moon, one *cun* in diameter. From the Venerable Lord’s mouth and tongue issues the qi of the revolving wind, blowing upon the lights of the sun and moon, causing them to billow—now white, now red. Their radiant qi descends into your Five Viscera, Six Bowels, hundred joints, and the entirety of your body, illuminating it so that inside and out, it becomes as bright as daylight. After a long while, you forget your own form, and suddenly, the practice is complete.\n\nThis diagram sketches the image between the brows; visualize it as in the eighth diagram, with the great presence in the Purple Chamber of the Six Harmonies Palace—this is the Mud Pill Palace of the Six Harmonies. Then, recite the prayer:\n\n*\"Great Cavern Imperial Unity, venerable spirit of the Grand Simplicity,\nFather Ning and Mother Essence, dual union in perfect pair,\nHundred perfected in grand convergence, revolving wind’s first birth,\nBody woven of eightfold mist, transforming the primordial womb’s infant,\nJewels of sun and moon’s light, illuminating my form,\nGrand Unity above, merging with the Imperial One,\nMud Pill preserves jade, Five Viscera bloom in splendor,\nEternally conjoined with sun and moon, holding the Cavern Scripture,\nAscending as an immortal elder, spirit rising to the Upper Clarity,\nThirty-nine chapters, golden talismans of the Feathered Court.\"*\n\nThis is the Dao of the revolving wind’s grand convergence with Imperial Unity, complete in itself. Myriad transformations and hundredfold changes, the methods of the Cavern Perfected and Grand Unity, reach their utmost here.\n\nAt night, constantly visualize the Venerable Lord of the Great Cavern, Imperial Unity, at the center of your philtrum beneath the nose. By day, constantly visualize him outside the upper teeth within the mouth, inside the upper lip above the philtrum. The Venerable Lord’s form should always face outward, whether sitting, standing, or moving—hold him in mind. Visualize the Venerable Lord’s mouth holding the light of the sun, nine *fen* in diameter, shining with boundless brilliance, equally illuminating your body.\n\nThe One is the true unity of the Imperial Lord. The transformations of the One return to the One. When reciting the *True Scripture of the Great Cavern*, also visualize the Venerable Lord Imperial Unity before you, with the divine lord’s mouth facing your own, listening to the sound of your recitation of the Cavern Scripture, thereby dissolving the knots of seven generations.\n\nThe Venerable Lord Imperial Unity, whose taboo name is Father Ningzai and style is Union of Mother’s Essence, must be constantly remembered day and night without forgetfulness. He averts ten thousand trials, extinguishes a thousand afflictions, dispels evil demons, and brings about immortality. If there is any pain or discomfort in your body, swiftly visualize the Venerable Lord Imperial Unity, commanding him to exhale the white qi of the sun’s light to fumigate the afflicted area—the pain will immediately be cured.\n\nThe Venerable Lord Imperial Unity appears as a newborn male, unclothed, four *fen* in body length. This is the true form of the grand convergence returning to the womb, the primal shape of inception.\n\n**Thirteen Diagrams of the Inner Methods of the Great Cavern for Cultivating Yin-Yang Perfected Unity**\nArranged according to the Nine Palaces, front and back, facing and turned away, shadows overlapping, they cannot be seen directly, making it difficult to depict them in frontal diagrams. Now, following the sequence, they are placed to the right, drawn in frontal view to avoid obscurity. If drawn in profile, the visualization would be incorrect. Please visualize the true spirits of each palace all facing forward in proper seated posture. Among them, the Three Perfected should face one another, as if in secluded retreat. The first *cun* with the Hall of Light together make one *cun*; though drawn correctly, they are still positioned to the right.\n\nRefine the visualization with precision, and after nine years of practice, you will ascend to heaven in broad daylight.\n\n**The Scripture of the Golden Flower and Jade Cavern concludes.**",
      "overlap_context": ", exiting through the lower orifices and the Jade Stem aperture. Then, the white qi emerges from the soles of the feet and the palms, enveloping the entire body—head, limbs, hands, and feet—merging into one. Together with the white qi, like smoke ascending and descending, they become indistinguishable.\n\nAfter a long while, the white qi suddenly changes color, transforming into a dense purple cloud. It re-enters through the mouth into the head, filling the Five Viscera and permeating the abdomen.",
      "start_char": 2559,
      "end_char": 3490,
      "start_sentence": 71,
      "end_sentence": 98,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.98503351211548,
      "metadata": {
        "source_file": "dao\\正统道藏洞真部\\方法类\\大洞金华玉经.txt",
        "category": "方法类"
      }
    }
  ]
}