{
  "source_id": "大还丹金虎白龙论",
  "source_file": "chunked_daozang\\大还丹金虎白龙论.json",
  "total_chunks": 3,
  "total_original_chars": 1936,
  "total_translated_chars": 11888,
  "total_translation_time": 65.43367624282837,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\大还丹金虎白龙论.txt",
    "category": "众术类"
  },
  "full_translation": "**The Great Return Elixir: On the Golden Tiger and White Dragon**\n*Composed by the Recluse of Mount Sumen, Master Huanyang*\n\nTo refine the elixir and concoct the medicine, one must stew the yin and yang of the dragon and tiger;\nTo preserve life and sustain form, one relies on nurturing the spirit-qi’s hun and po.\n\nWhen the dragon congeals and the tiger thickens, yin reverses to become yang;\nWhen the tiger dims and the dragon glows, yang transforms into treasure.\nWhen spirit fuses and qi is mastered, po reverts to hun;\nWhen qi flourishes and spirit harmonizes, hun unites to become sacred.\n\nDragon and tiger mutually congeal into liquid; spirit and qi intermingle to become the true.\nThe divine water is none other than the Flowery Pond; forgetting the heart is called embracing the One.\nTo ascend heaven riding a crane, one must swallow the numinous elixir of the true po;\nTo transcend the world and attain longevity, one relies on nurturing the essence-hun’s numen.\n\nBy this means, the secret of the golden elixir and the wondrous gate of immortality\ncan alter the spirit, transform the sinews and bones,\nwithdraw and enfold the body, so that one may enter and exit as if existing or not,\nmanifest the true numen, coming and going while able to abide or vanish.\nFields of mulberry shift and change; heaven and earth overturn in emptiness.\nOne ascends to the Purple Court, roaming the Jade Clarity through the azure heavens and golden palaces.\n\nThis is the verification of the divine elixir, the efficacy of return and reversion.\nYet世人 vainly smelt the five metals, blend the eight minerals,\ncall lead the tiger, name mercury the dragon,\nrecklessly pair yin and yang, misalign water and fire.\nThey boast of the Three Yellows as sacred, gallop the Five Alums as divine,\ndeviating from the Dao, losing all sagely intent.\nStudying scriptures and probing meanings, seeking origins and delving into mysteries,\nthey chaotically establish rules, passing down methods in succession.\nWithout receiving transmission from a master, they forcefully claim their own ability,\nmeasuring drug names, calculating fire times,\nfurnaces plastered on eight sides, altars built in three tiers,\ninvoking deities, offering sacrifices to heaven and earth—\nall is groundless fabrication, not principled cultivation.\nUnawares, the body decays and form withers, the complexion fades and temples whiten.\nWasting years in vain toil, squandering the heart’s spirit,\nthey yet hope for the returning elixir—ten thousand times, not one succeeds.\n\nI have long indulged in cloud and water, early abandoning worldly vanities,\ndwelling in mountains and forests, exhaustively investigating the phenomena of things.\nCultivating spirit and refining qi, returning to the root and reverting to the origin,\ncalming thoughts and clarifying the true, forgetting thoughts and stilling the One,\nI examined the orifices of lead and mercury, wove the warp and weft of elixir scriptures,\npenetrated the golden writings of the Mysterious Cavern,\nand awakened to the jade formulas of the Three Clarities.\nThus, I dared to grasp the dragon and tiger, master yin and yang,\npair metal and wood to bind east and west, fix Kan and Li to north and south,\nsmelt and refine sun and moon, tempering the five-colored mysterious frost,\ngestate and nurture heaven and earth, transforming the flowing light of pristine snow.\nThe immortal method is not false; the sagely principle is manifestly clear.\nHaving glimpsed the subtle mystery and understood its wondrous purport,\nI therefore composed this preface, dividing it into two chapters,\nentitled *On the Golden Tiger and White Dragon*,\nto display my humble insights and share them with like-minded seekers.\nShould there be gentlemen beyond the mundane, may they kindly attend to this!\n\n---\n\n**Chapter One: Identifying the Yellow Sprout**\n\nThe Yellow Sprout arises from the union of Qian and Kun, formed by the workings of creation.\nYang embraces the yin-po; yin cradles the yang-hun.\nYang’s numen shines with blood’s radiant clarity; yin’s truth gleams with jade’s luminous transparency.\nCompared to the moon, its pristine light vies in brilliance;\nfacing the sun, rosy clouds scatter in profusion.\nIts whole body heals the mane; its entire form bristles with scales.\nIt grows in the yang position, secretly intimate with yin.\nIt presides over the five metals, rules the eight minerals as sovereign.\nThose who understand it swiftly soar to the empyrean;\nthose who ignore it remain long in the dust of the world.\nUsed daily yet unknown to people, they rush about until their hair turns white without achievement.\n\n*Qian and Kun unite to first form its shape,*\n*Creation’s origin dwells in the northern chamber’s birth.*\n*Sun and moon cycle, hun and po fill;*\n*Yin and yang copulate, dragon and tiger take form.*\n*Clearly it grows from metal—*\n*Who realizes it can also merge with water?*\n*Countless are those confined within the dust of the world,*\n*Daily using it yet unaware of its name.*\n\n---\n\n**Chapter Two: Identifying Lead and Mercury**\n\nIn cultivating the great medicine, first clarify the true source of lead and mercury;\nIn compounding the divine elixir, one must grasp the correct principle of Kan and Li.\n\nLead encloses yin marrow and is called the tiger, occupying the Kan position;\nMercury arises from yang essence and is named the dragon, residing in the Li position.\nMoon and sun meet, serving as the ladder and mediator of coming and going;\nLi maiden and Kan youth are the warp and weft of reunion and return.\nLead receives the pungent and nurtures, thus clad in coarse cloth yet harboring gold;\nMercury bears the wood-born, naturally adorned in splendor yet containing wood.\nLead is not common tin; mercury is not ordinary silver.\nLead is the root and foundation of heaven and earth; mercury is the numinous qi of yin and yang.\nLead contains the sun’s po; mercury drinks the moon’s hun.\nLead is true lead; mercury is no common mercury.\nDrawing the marrow from the five phases, they bind to form gold;\nCombining the essence of the two images, they clarify and congeal into liquid.\n\nWhen the sun wanes and the moon waxes, hun sinks and yin-hun perishes;\nWhen the moon wanes and the sun waxes, hun dissipates and yang-po ends.\nYin and yang unite, pairing as the husband and wife of dragon and tiger;\nWater and fire reverse their intercourse, forging the elixir of Qian and Kun.\nYang can restrain po, circulating to naturally form a golden body;\nYin has become yang, reversing to begin the divine substance.\nWhen yin and yang are full, one obtains the cinnabar of transcendence;\nWhen the numbers of water and fire are complete, one attains the liquid of cloud-soaring.\nOn the red-frosted tripod, morning clouds exhale in dazzling brilliance;\nWithin the white-powdered furnace, auspicious snow sprays in glowing radiance.\nBlood-red clarity—dawn’s sun rises over Fusang;\nIce-like splendor—autumn’s moon immerses in the cold shore.\nA lone crane perches on the fragrant osmanthus of a clear peak;\nA rainbow arcs across the bright river, clustering the emerald beauty of lotuses.\nAt the moment of grinding, fragrant aromas scatter;\nUpon pulverizing, luminous brilliance flows through.\nRefined into treasure, ingested to ascend heaven—\na single dose instantly enables soaring flight, feathered transformation to roam the Phoenix Tower.\n\nWorldly affairs rush endlessly, without conclusion;\nA hundred years pass like a fleeting dream’s glory.\nNot knowing there are cloud-path travelers,\nthey merely vie for fame in the dust of the world.\n\nSeeking to halt the fleeting years and drift upon the Great Clarity,\nknow that the numinous elixir alone ensures everlasting life.\nRefine purely the marrow of Heaven and Earth’s yin and yang,\nforge wholly the essence of Qian and Kun’s sun and moon.\n\nMarriage of yin and yang forms the union,\nas dragon and tiger mutually consume each other.\nSubduing the Crimson Emperor’s essence from the Li Palace,\none draws the White Dragon’s fluid from the Kan Gate.\n\nThe Yellow Sprout is rooted in this very source—\nall else is vain toil, wasted effort.\nIf one has not met a true perfected being,\nhow can one attain the profound and mysterious art?\n\nThe firing must complete nine revolutions,\nthe elixir’s completion awaits a full thousand days.\nAbove the furnace, smoke rises in five-colored radiance;\nwithin the crucible, the medicine stirs as the Vast Red Lord.\n\nA single grain of the knife’s measure soars to the celestial Han,\nfreely treading the Three Clarities in an instant.\nRiding cranes and mounting dragons, commanding ghosts and spirits,\none laughs in return at the mulberry fields’ many transformations.\n\nHenceforth dwelling forever in the Azure Vault Palace,\neternally feasting with the immortals in the Golden Hall.\nSun’s brilliance and moon’s essence,\nWu and Ji serve as the sovereign.\n\nMetal and wood, east and west conjoined,\nyin and yang, above and below divided.\nStorage and addition follow in sequence,\nadvance and retreat accord with ancient texts.\nAfter ten months, the gestation is complete—\nlightly, lightly one drifts upon white clouds.\n\nSeeking the master, together we aspire to endure for ten thousand ages in the cinnabar clouds;\nthe heart’s resolve beyond the dust has long been our earnest discourse.\nNow, do not weary of frequent visits—\nalready it seems a solitary cloud-crane has arrived at the gate.\n\nThe master exhorts:\nEarly, amidst busyness, recognize what is leisure;\ndo not expend heart and strength in the service of schemes.\nFlowers, by their season, may bloom again,\nbut water, once eastward gone, never returns.\n\nSpring’s hues stealthily steal the black from temples,\nthe wind’s splendor silently exchanges youth for age.\nKnow that worldly affairs are ever lamentable—\nall lies within Zhuang Zhou’s single dream.\n\nThe master bestows:\nI now reveal each true gate of the mystery;\nall ancient sages emerged thereby.\nYesterday, within the Penglai immortal assembly,\nthe register of long life has gained yet another name.\n\nThe master instructs and sees him off:\nThe pine stands firm and steadfast,\nthe ravine’s waters flow clear again.\nDo not linger long in the world of dust,\nwhere right and wrong sully the ear’s hearing.\n\nIn the mid-decade of winter’s beginning, the second year of the Shiguang era, there was the Seventh Transverse Peak Master, Yongyangzi Du Xidun, styled Wangji. In an autumn of many affairs, he evaded calamity in the outskirts of Wen, and whenever he reached Yan, he only met with great recluses. Among them was the Duke of Nanyang, who deeply revered the Dao, immersed in profound mysteries, and nurtured his heart in tranquil elegance. As for making one’s mark and spreading fame, he awaited only a true confidant.\n\nIn friendship, there is that which seeks fame, and that which seeks profit—\nmy bond with the Duke is neither for fame nor gain.\nWith each meeting, we spoke of the Dao from dawn till dusk;\nbeyond the mystery upon mystery of the profound, I had nothing to say.\nThus, I inscribe the alchemical formulas of my late master and present them to you.\nI earnestly hope you will treasure them a thousandfold, ten thousandfold—\ndo not transmit them to the unworthy.\n\nHow could matters beyond the mundane be made known to ordinary men?\nIf ordinary men knew of them, they would only bring upon themselves condemnation.\n\nThe Immortal Master said: Those who reverently receive these teachings shall have their names recorded in the Registers of the Mysterious; those who leak or treat them with negligence shall be punished, their souls condemned to become lowly ghosts.\n\nHe further said: Misfortune or blessing extends to nine generations; ascent or descent rests within this single form.\n\nNow, I swear by the green mountains and white clouds—do not betray these words, a thousandfold, ten thousandfold!\n\nHere ends the *Discourse on the Great Return Elixir, the Golden Tiger, and the White Dragon*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "原题苏门山隐士还阳子迷，出朴唐代。 一卷。 底本出处：《正统道藏》洞神部众衍类。 大还丹金虎白龙论 苏门山隐士还阳子述 夫烧丹炼药，须烹龙虎之阴阳； 驻命存形，藉养神气之魂魄。 龙痴凝虎，阴反成阳； 虎暗晞龙，阳化成宝。 神融驭气，魄反成魂； 气泰神和，魂合而圣。 龙虎相凝成液，神气交驭为真，神水便是华池，忘心即名抱一。 朝天控鹤，须吞真魄之灵丹，出世长生，藉养精魂之灵。 气此则金丹秘诀，神仙妙门，能以改换精神，变化筋骨，收卷形体，出入而可有可无，变现真灵，来去而能存能没。 桑田变易，天地虚翻，升腾而紫府，玉清游历而碧霄金阙。 此即神丹凭验，还返功灵，世人枉炼五金，调和八石，呼铅作虎，唤汞为龙，妄配阴阳，错排水火。 夸三黄是圣，骋五矾为神，道理既乖，圣意全失，看经究义，寻本穷玄，乱立规绳，递生法则，不从师受，强说己能，斟酌药名，团量火候，炉泥八面，坛筑三层，呎祝神祇，祭醮天地，总是凭空造作，非理修持，不觉体败形枯，颜凋鬓白，虚劳岁月，枉役心神，而望还丹，万无成耳。 余久耽云水，早弃浮华，栖止山林，精穷物象，修神炼气，反本还元，息虑澄真，忘思静一，考窍铅汞，杼轴丹经，彻视玄洞之金书，悟达三清之玉诀。 然敢对持龙虎，驾驭阴阳，配金木以束西，定坎离而南北，陶镕日月，炼成五色之玄霜，孕育乾坤，化出流光之素雪，仙方岂谬，圣理昭然。 一睹玄微，明其妙旨，遂着斯序，分列两篇，名《 金虎白龙论》 ，用彰鄙识，将表同人，傥有物外君子，幸留意焉！ 识黄芽第－ 夫黄芽者，乾坤感合，造化而成。 阳含阴魄，阴抱阳魂，阳灵而血辉莹彻，阴真而玉彩通明。 比月而素光争发，对日而红霞乱生，全身医鬣，遍体鳞铍，长於阳位，暗与阴亲。 与五金之作主，统八石而为君，明之者顿冲於霄汉，昧之者长在於风尘，日用之而人不知，奔波而皓首无成。 乾坤感合始成形，造化元居北户生，日月循环魂魄满，阴阳交媾龙虎成。 分明本自从金长，谁悟偏能与水并？ 无限褊於尘世裹，时人日用不知名。 识铅汞第二 凡修大药，先明铅汞之真源； 合炼神丹，须达坎离之正理。 铅包阴髓是名虎，而坎方； 汞产阳精故称龙，而离位坎。 月离日会，来往之梯媒，离女坎男，合还返之纲纪。 铅受辛育，故被褐而怀金，汞禀甲胎，自着诽而含木。 铅非世锡，汞岂凡银？ 铅是天地之根基，汞是阴阳之灵气，铅含日魄，汞饮月魂，铅是真铅，汞非常汞，抽五行之筋髓，相结成金； 合两象之精华，清凝成液。 日亏月满，魂沉而自丧阴魂； 月缺日盈，魂消而却终阳魄。 阴阳感合，配成龙虎之夫妻； 水火反交，锻出乾坤之丹药。 阳能制魄，运行而自作金形； 阴已成阳，反转而始成神质。 阴阳满足，得为出世之砂； 水火数终，便是腾云之液。 红霜鼎上，吐吓吓之朝霞； 素粉炉中，喷荧荧之瑞雪。 澄澄血彩，晓日出於扶桑； 湛湛冰辉，秋月浸於寒浦。 晴峰俊鹤，孤栖桂树之芳华； 明汉横霓，迥簇芙蓉之翠艳。 梼研之际，散芬馥之馨香； 到碾之时，流光辉之洞彻。 变炼成宝，服食冲天，刀圭而顿便升腾，羽化而翱游凤阙。 世事忙忙无了程，百年如梦瞥然荣，不知道有云衢客，刚自争邀尘裹名。",
      "translated_text": "**The Great Return Elixir: On the Golden Tiger and White Dragon**\n*Composed by the Recluse of Mount Sumen, Master Huanyang*\n\nTo refine the elixir and concoct the medicine, one must stew the yin and yang of the dragon and tiger;\nTo preserve life and sustain form, one relies on nurturing the spirit-qi’s hun and po.\n\nWhen the dragon congeals and the tiger thickens, yin reverses to become yang;\nWhen the tiger dims and the dragon glows, yang transforms into treasure.\nWhen spirit fuses and qi is mastered, po reverts to hun;\nWhen qi flourishes and spirit harmonizes, hun unites to become sacred.\n\nDragon and tiger mutually congeal into liquid; spirit and qi intermingle to become the true.\nThe divine water is none other than the Flowery Pond; forgetting the heart is called embracing the One.\nTo ascend heaven riding a crane, one must swallow the numinous elixir of the true po;\nTo transcend the world and attain longevity, one relies on nurturing the essence-hun’s numen.\n\nBy this means, the secret of the golden elixir and the wondrous gate of immortality\ncan alter the spirit, transform the sinews and bones,\nwithdraw and enfold the body, so that one may enter and exit as if existing or not,\nmanifest the true numen, coming and going while able to abide or vanish.\nFields of mulberry shift and change; heaven and earth overturn in emptiness.\nOne ascends to the Purple Court, roaming the Jade Clarity through the azure heavens and golden palaces.\n\nThis is the verification of the divine elixir, the efficacy of return and reversion.\nYet世人 vainly smelt the five metals, blend the eight minerals,\ncall lead the tiger, name mercury the dragon,\nrecklessly pair yin and yang, misalign water and fire.\nThey boast of the Three Yellows as sacred, gallop the Five Alums as divine,\ndeviating from the Dao, losing all sagely intent.\nStudying scriptures and probing meanings, seeking origins and delving into mysteries,\nthey chaotically establish rules, passing down methods in succession.\nWithout receiving transmission from a master, they forcefully claim their own ability,\nmeasuring drug names, calculating fire times,\nfurnaces plastered on eight sides, altars built in three tiers,\ninvoking deities, offering sacrifices to heaven and earth—\nall is groundless fabrication, not principled cultivation.\nUnawares, the body decays and form withers, the complexion fades and temples whiten.\nWasting years in vain toil, squandering the heart’s spirit,\nthey yet hope for the returning elixir—ten thousand times, not one succeeds.\n\nI have long indulged in cloud and water, early abandoning worldly vanities,\ndwelling in mountains and forests, exhaustively investigating the phenomena of things.\nCultivating spirit and refining qi, returning to the root and reverting to the origin,\ncalming thoughts and clarifying the true, forgetting thoughts and stilling the One,\nI examined the orifices of lead and mercury, wove the warp and weft of elixir scriptures,\npenetrated the golden writings of the Mysterious Cavern,\nand awakened to the jade formulas of the Three Clarities.\nThus, I dared to grasp the dragon and tiger, master yin and yang,\npair metal and wood to bind east and west, fix Kan and Li to north and south,\nsmelt and refine sun and moon, tempering the five-colored mysterious frost,\ngestate and nurture heaven and earth, transforming the flowing light of pristine snow.\nThe immortal method is not false; the sagely principle is manifestly clear.\nHaving glimpsed the subtle mystery and understood its wondrous purport,\nI therefore composed this preface, dividing it into two chapters,\nentitled *On the Golden Tiger and White Dragon*,\nto display my humble insights and share them with like-minded seekers.\nShould there be gentlemen beyond the mundane, may they kindly attend to this!\n\n---\n\n**Chapter One: Identifying the Yellow Sprout**\n\nThe Yellow Sprout arises from the union of Qian and Kun, formed by the workings of creation.\nYang embraces the yin-po; yin cradles the yang-hun.\nYang’s numen shines with blood’s radiant clarity; yin’s truth gleams with jade’s luminous transparency.\nCompared to the moon, its pristine light vies in brilliance;\nfacing the sun, rosy clouds scatter in profusion.\nIts whole body heals the mane; its entire form bristles with scales.\nIt grows in the yang position, secretly intimate with yin.\nIt presides over the five metals, rules the eight minerals as sovereign.\nThose who understand it swiftly soar to the empyrean;\nthose who ignore it remain long in the dust of the world.\nUsed daily yet unknown to people, they rush about until their hair turns white without achievement.\n\n*Qian and Kun unite to first form its shape,*\n*Creation’s origin dwells in the northern chamber’s birth.*\n*Sun and moon cycle, hun and po fill;*\n*Yin and yang copulate, dragon and tiger take form.*\n*Clearly it grows from metal—*\n*Who realizes it can also merge with water?*\n*Countless are those confined within the dust of the world,*\n*Daily using it yet unaware of its name.*\n\n---\n\n**Chapter Two: Identifying Lead and Mercury**\n\nIn cultivating the great medicine, first clarify the true source of lead and mercury;\nIn compounding the divine elixir, one must grasp the correct principle of Kan and Li.\n\nLead encloses yin marrow and is called the tiger, occupying the Kan position;\nMercury arises from yang essence and is named the dragon, residing in the Li position.\nMoon and sun meet, serving as the ladder and mediator of coming and going;\nLi maiden and Kan youth are the warp and weft of reunion and return.\nLead receives the pungent and nurtures, thus clad in coarse cloth yet harboring gold;\nMercury bears the wood-born, naturally adorned in splendor yet containing wood.\nLead is not common tin; mercury is not ordinary silver.\nLead is the root and foundation of heaven and earth; mercury is the numinous qi of yin and yang.\nLead contains the sun’s po; mercury drinks the moon’s hun.\nLead is true lead; mercury is no common mercury.\nDrawing the marrow from the five phases, they bind to form gold;\nCombining the essence of the two images, they clarify and congeal into liquid.\n\nWhen the sun wanes and the moon waxes, hun sinks and yin-hun perishes;\nWhen the moon wanes and the sun waxes, hun dissipates and yang-po ends.\nYin and yang unite, pairing as the husband and wife of dragon and tiger;\nWater and fire reverse their intercourse, forging the elixir of Qian and Kun.\nYang can restrain po, circulating to naturally form a golden body;\nYin has become yang, reversing to begin the divine substance.\nWhen yin and yang are full, one obtains the cinnabar of transcendence;\nWhen the numbers of water and fire are complete, one attains the liquid of cloud-soaring.\nOn the red-frosted tripod, morning clouds exhale in dazzling brilliance;\nWithin the white-powdered furnace, auspicious snow sprays in glowing radiance.\nBlood-red clarity—dawn’s sun rises over Fusang;\nIce-like splendor—autumn’s moon immerses in the cold shore.\nA lone crane perches on the fragrant osmanthus of a clear peak;\nA rainbow arcs across the bright river, clustering the emerald beauty of lotuses.\nAt the moment of grinding, fragrant aromas scatter;\nUpon pulverizing, luminous brilliance flows through.\nRefined into treasure, ingested to ascend heaven—\na single dose instantly enables soaring flight, feathered transformation to roam the Phoenix Tower.\n\nWorldly affairs rush endlessly, without conclusion;\nA hundred years pass like a fleeting dream’s glory.\nNot knowing there are cloud-path travelers,\nthey merely vie for fame in the dust of the world.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1253,
      "start_sentence": 0,
      "end_sentence": 55,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 41.69140124320984,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大还丹金虎白龙论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "欲驻流年泛太清，须知灵药必长生，纯烧天地阴阳髓，全炼乾坤日月精。 嫁娶阴阳成匹配，对持龙虎自相吞，伏得离宫赤帝精，感他坎户白龙液。 黄芽柢此是根源，自外徒劳虚费力，若不曾逢真至人，如何得到幽玄术。 火候须教终九转，丹成直待周千日，炉上烟生五彩光，鼎中药奋弘红君尘间颜还关殿换畔色。 刀圭一粒冲天汉，逍遥顿蹑三清，驾鹤乘龙役鬼神，反笑桑田数回。 自此长居碧落宫，永共群仙醉金殿。 日华兼月魄，戊己本为君，金木束西并，阴阳上下分。 臧添依次序，进退合先文，十月怀胎满，翩翩泛白云。 师访 共拟丹霄万古存，出尘心事苦曾论，於今莫倦频相访，已似孤云鹤到门。 师勉 早向忙中认取闲，休将心力役机，花依时节重开得，水去束流定不。 春色潜偷青鬓发，风光暗换少年。 须知世事堪悲叹，尽在庄周一梦间。 师贻 我今一一诀真门，古圣皆因此出，昨日蓬莱仙会裹，长生籍上又添君。 师诲而饯之 松相坚且贞，涧水流复清，勿久尘寰问，是非污耳聆。 时光启二年冬首中旬，有七横峰先生永阳子杜希遁，字忘机，多事之秋，避祸汶郊，每抵郾中，只接大隐，南阳公公，颇奉道耽玄悟真，栖心闲雅，若夫发迹扬名，俟之知已。 夫为交者，有名焉，有利焉，余与公交，非名与利，每一接，未尝不话道永日，除玄之又玄外，余无所云，故书先师药诀相赠，切希千万保惜，勿传下士。 大几方外之事，岂使常人知之？ 常人知之，则自遭谴谪。",
      "translated_text": "Seeking to halt the fleeting years and drift upon the Great Clarity,\nknow that the numinous elixir alone ensures everlasting life.\nRefine purely the marrow of Heaven and Earth’s yin and yang,\nforge wholly the essence of Qian and Kun’s sun and moon.\n\nMarriage of yin and yang forms the union,\nas dragon and tiger mutually consume each other.\nSubduing the Crimson Emperor’s essence from the Li Palace,\none draws the White Dragon’s fluid from the Kan Gate.\n\nThe Yellow Sprout is rooted in this very source—\nall else is vain toil, wasted effort.\nIf one has not met a true perfected being,\nhow can one attain the profound and mysterious art?\n\nThe firing must complete nine revolutions,\nthe elixir’s completion awaits a full thousand days.\nAbove the furnace, smoke rises in five-colored radiance;\nwithin the crucible, the medicine stirs as the Vast Red Lord.\n\nA single grain of the knife’s measure soars to the celestial Han,\nfreely treading the Three Clarities in an instant.\nRiding cranes and mounting dragons, commanding ghosts and spirits,\none laughs in return at the mulberry fields’ many transformations.\n\nHenceforth dwelling forever in the Azure Vault Palace,\neternally feasting with the immortals in the Golden Hall.\nSun’s brilliance and moon’s essence,\nWu and Ji serve as the sovereign.\n\nMetal and wood, east and west conjoined,\nyin and yang, above and below divided.\nStorage and addition follow in sequence,\nadvance and retreat accord with ancient texts.\nAfter ten months, the gestation is complete—\nlightly, lightly one drifts upon white clouds.\n\nSeeking the master, together we aspire to endure for ten thousand ages in the cinnabar clouds;\nthe heart’s resolve beyond the dust has long been our earnest discourse.\nNow, do not weary of frequent visits—\nalready it seems a solitary cloud-crane has arrived at the gate.\n\nThe master exhorts:\nEarly, amidst busyness, recognize what is leisure;\ndo not expend heart and strength in the service of schemes.\nFlowers, by their season, may bloom again,\nbut water, once eastward gone, never returns.\n\nSpring’s hues stealthily steal the black from temples,\nthe wind’s splendor silently exchanges youth for age.\nKnow that worldly affairs are ever lamentable—\nall lies within Zhuang Zhou’s single dream.\n\nThe master bestows:\nI now reveal each true gate of the mystery;\nall ancient sages emerged thereby.\nYesterday, within the Penglai immortal assembly,\nthe register of long life has gained yet another name.\n\nThe master instructs and sees him off:\nThe pine stands firm and steadfast,\nthe ravine’s waters flow clear again.\nDo not linger long in the world of dust,\nwhere right and wrong sully the ear’s hearing.\n\nIn the mid-decade of winter’s beginning, the second year of the Shiguang era, there was the Seventh Transverse Peak Master, Yongyangzi Du Xidun, styled Wangji. In an autumn of many affairs, he evaded calamity in the outskirts of Wen, and whenever he reached Yan, he only met with great recluses. Among them was the Duke of Nanyang, who deeply revered the Dao, immersed in profound mysteries, and nurtured his heart in tranquil elegance. As for making one’s mark and spreading fame, he awaited only a true confidant.\n\nIn friendship, there is that which seeks fame, and that which seeks profit—\nmy bond with the Duke is neither for fame nor gain.\nWith each meeting, we spoke of the Dao from dawn till dusk;\nbeyond the mystery upon mystery of the profound, I had nothing to say.\nThus, I inscribe the alchemical formulas of my late master and present them to you.\nI earnestly hope you will treasure them a thousandfold, ten thousandfold—\ndo not transmit them to the unworthy.\n\nHow could matters beyond the mundane be made known to ordinary men?\nIf ordinary men knew of them, they would only bring upon themselves condemnation.",
      "overlap_context": "er, clustering the emerald beauty of lotuses.\nAt the moment of grinding, fragrant aromas scatter;\nUpon pulverizing, luminous brilliance flows through.\nRefined into treasure, ingested to ascend heaven—\na single dose instantly enables soaring flight, feathered transformation to roam the Phoenix Tower.\n\nWorldly affairs rush endlessly, without conclusion;\nA hundred years pass like a fleeting dream’s glory.\nNot knowing there are cloud-path travelers,\nthey merely vie for fame in the dust of the world.",
      "start_char": 1253,
      "end_char": 1843,
      "start_sentence": 56,
      "end_sentence": 77,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.53267216682434,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大还丹金虎白龙论.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "仙师日：钦承者，纪名於玄录泄慢者，责身为下鬼。 又日：殃庆逮於九祖，升沈止於一形。 今以青山白云为誓，勿负斯言，千万千万！ 大还丹金虎白龙论竟",
      "translated_text": "The Immortal Master said: Those who reverently receive these teachings shall have their names recorded in the Registers of the Mysterious; those who leak or treat them with negligence shall be punished, their souls condemned to become lowly ghosts.\n\nHe further said: Misfortune or blessing extends to nine generations; ascent or descent rests within this single form.\n\nNow, I swear by the green mountains and white clouds—do not betray these words, a thousandfold, ten thousandfold!\n\nHere ends the *Discourse on the Great Return Elixir, the Golden Tiger, and the White Dragon*.",
      "overlap_context": "her for fame nor gain.\nWith each meeting, we spoke of the Dao from dawn till dusk;\nbeyond the mystery upon mystery of the profound, I had nothing to say.\nThus, I inscribe the alchemical formulas of my late master and present them to you.\nI earnestly hope you will treasure them a thousandfold, ten thousandfold—\ndo not transmit them to the unworthy.\n\nHow could matters beyond the mundane be made known to ordinary men?\nIf ordinary men knew of them, they would only bring upon themselves condemnation.",
      "start_char": 1843,
      "end_char": 1916,
      "start_sentence": 78,
      "end_sentence": 81,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.2096028327941895,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大还丹金虎白龙论.txt",
        "category": "众术类"
      }
    }
  ]
}