{
  "source_id": "大还丹照鉴",
  "source_file": "chunked_daozang\\大还丹照鉴.json",
  "total_chunks": 9,
  "total_original_chars": 8269,
  "total_translated_chars": 48425,
  "total_translation_time": 266.60893273353577,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\众术类\\大还丹照鉴.txt",
    "category": "众术类"
  },
  "full_translation": "**The Illuminating Mirror of the Great Return Elixir**\n\n*Scripture Title:* *The Illuminating Mirror of the Great Return Elixir*. One scroll, originating from the Five Dynasties and early Song period. Base text from *Daoist Canon of the Zhengtong Era*, category of Miscellaneous Arts in the *Dongshen* section.\n\n**The Illuminating Mirror of the Great Return Elixir**\n\nThe Great Return Elixir is bound to the realm of emptiness and nothingness, encompassing the transformations of creation with primordial qi as its foundation. It splits the Two Modes to manifest images, through which Heaven displays its auspicious signs and all beings receive their numinous endowment. It unites the Four Symbols to form shapes and distinguishes the Five Phases to determine bodies. Within the profound and obscure, this Dao cannot be fathomed; amid the indistinct and vague, only sentiment fails to comprehend it.\n\nFrom remote antiquity to the present, its teachings have proliferated in elaborate texts and intricate discourses, leaving later learners bewildered as to its essence. Yet the mechanisms by which former sages attained mastery remain concealed in arcane words—how then can one delve into its secret methods?\n\nI was born in Zizhou, my family originally from the imperial capital. From childhood, I yearned for the Dao of divine transcendents. My heart was set on abandoning officialdom, scorning glory and fame. Recognizing that death is the inevitable end, I sought to prolong life. Among all things in the world, humans alone are most endowed with spirit; the myriad methods for attaining truth all depend on oneself. Thus, I wandered through sublime realms, sometimes treading the dust of the mundane, seeking like-minded companions for discussion and hoping to meet an enlightened master for transmission.\n\nBy Heaven’s grace, my wish was not in vain—I encountered an extraordinary person who revealed the forms of the Dragon and Tiger, clarifying the great principles of the Tortoise and Serpent. Thereafter, I diligently sought immortal formulas and extensively studied elixir scriptures, aiming to illuminate the eternal origin and verify the principle of returning to purity. To transcend the mortal and become sagely is no easy feat without accumulating merit; to transform the corporeal soul and return to yang depends on sincerity and natural resonance.\n\nMoreover, the Great Elixir gleams like the sun and moon, its radiance suffusing clouds and mist. It refines the essence of the Moon’s Toad and blends the flowing reflections of the Dragon’s Embryo. Its numinous traces rarely appear, and its dust-borne marks are seldom known. Those who pursue it may wander in vain, while those who dismiss it hasten toward death.\n\nSome covet wealth and chase profit, enriching themselves while impoverishing others. They fill their halls with wives and concubines—yet who can die in their stead? Even if gold and jade fill their houses, can these prolong life? The myriad things of the world, piled like earth in the wilderness—how many endure a hundred years? Only indulgence and dissipation prevail.\n\nThose who uphold the Dao do so not out of greed, yet some learners boast of deep understanding. By the time their temples gray and their complexions fade, they only then lament how fleeting time slips away, sighing that the rushing waves never return. Such people—how pitiful they are!\n\nThere are also those among recent learners who cling rigidly to their teachers’ works. When discussing the Return Elixir, they fail to grasp yin and yang; when speaking of destiny, they harm their spirit through restless exertion. They misidentify mercury and lead, vainly seeking red and white transformations. Some claim the Five Viscera undergo internal alchemy while the Five Metals transform externally, insisting that transmuting gold requires *geng* (庚) and refining silver requires *gen* (艮). Others say, “Gold becomes gold, silver becomes silver—there are no other divine or sagely methods beyond this.” This is a grave error! They mistake the words of celestial transcendents, recklessly using herbs and minerals to forge gold and silver—truly a vast divergence from Heaven and Earth, a profound delusion!\n\nI have long lamented such ignorance, unaware that within yang there is yin and within yin there is yang. Hidden mercury is mercury that congeals the River Chariot; the one that attracts iron must recognize the lodestone. Only by harmonizing the Way of husband and wife and naturally following the cyclic patterns, clarifying nature and emotion, can all be accomplished. If the world possessed some other marvel of yellow and white (gold and silver), then the Dao of divine transcendence would be entirely false. From ancient times to the present, it has been one path—there is no second doctrine.\n\nDuring moments of leisure, I gathered and compiled the scriptures of immortals, carefully editing the maxims of former sages to serve as a model for later generations, entitling it *Illuminated Mirror: Anthology of Ascension to Immortality*. Comprising a single scroll, it is divided into thirty-three chapters, truly intended to reflect flaws and blemishes, thereby earning its name *Ascension to Immortality*—so that beauty and ugliness may be readily distinguished, and subtle mysteries easily grasped. All within are sacred texts and esoteric instructions, alchemical secrets and profound mechanisms. May they be fully revealed to past worthies and broadly illuminated for future learners.\n\nI humbly pray that the perfected immortals may grant their protection, that the August Emperor may bestow his mercy, that the enlightened transformation may awaken a heart of correction and safeguarding, and that the Great Clarity may provide the Way of deliverance and ascent. Thus shared with like-minded seekers, it may cleanse and expand the vastness of their aspirations. Those who glance upon it may treat it as a treasure of pearls; those who obtain a copy may cherish it as a rare jewel. Should one follow its precepts and formulas, one will surely attain transcendence beyond the mundane. But if one practices according to personal whim, one will surely squander wealth and exhaust one’s estate. Do not show this to the unworthy; reckless disclosure invites heavenly retribution.\n\nComposed in the first month of the first full moon of the twenty-fifth year of Guangzheng, the renxu year.\n\nA northern song says:\n\nThe Northern Song says:\n\nThe Dark Warrior of the North is black in form,\nHis homeland rests within the Kunlun realm.\nWith steadfast will he seeks eternal life,\nIn any shape or way he may be born.\nAdrift upon the currents, fate’s guest he roams,\nWho knows his nature bears no trace of white?\nNot only does he hold the essence of the Five Phases,\nBut within him, yin and yang’s souls deeply stir.\nHarmonized, Dui and Zhen become husband and wife,\nThe Four Symbols arrayed on high.\nClearly I point this out to later generations—\nLest they stray, bewildered, from the celestial path.\n\nTrue Water’s alternate names:\nWhite Gold, Spirit Pearl,\nTrue Body’s Śarīra, Flowing Mercury, Flowing Sand,\nMysterious Pearl, All Beings,\nLiving Treasure, Nine-Turn Golden Elixir, Maṇi Pearl,\nCinnabar, Night-Shining Pearl,\nGreat Yin’s True Water, Dark and Mysterious Flower Pool,\nBlack Gold Alum, Kunlun Alum,\nBlack Gold, Sacred Stone,\nMetal Lord, Dark Warrior’s Black Donkey Milk, Persian Alum.\n\nThe Western Song says:\nThe White Tiger of the West is yin by nature,\nMale or female, it is also Metal.\nLong standing in the Zi Palace, born at Wu,\nIts form complete in Dui, its heart one with Kan.\nFair as jade, its beauty surpasses ice and snow,\nIts pure essence holds light, scattering pale radiance.\nThough called White Langgan,\nWho knows my true self is the Bright Moon?\nWithout a matchmaker, it weds the Yellow Sprout,\nIn life and death, it must return to Wu and Ji’s home.\nWhen scorching heat descends, cold realms rise,\nYin and yang urge on, all becomes cinnabar.\nIf one grasps the meaning of these words,\nThe path to the Three Clarities lies before your eyes.\nRiding a crane to soar heavenward will come in time—\nThen you shall surely cast off the dust of endless kalpas.\n\nTrue Gold’s alternate names:\nWhite Tiger, White Gold,\nGreat White, Great Mystery,\nGreat Perfected, Great Simplicity, True Mercury,\nWater Essence, Autumn Stone,\nStone Liquid, Jade Liquid, True Lead, Qian’s Essence,\nFair Gold Flower,\nMale Gold, River Chariot,\nSoft Silver, True Gold, Kan’s Male, Mysterious Liquid,\nGold in Water,\nDivine Talisman White Snow, Sacred Ignorance,\nTin Fat, White Horse’s Tooth, Fine Cinnabar.\n\nThe Southern Song says:\nThe Vermilion Bird of the South,\nIts body fierce and red,\nMighty and unyielding, hard to rival,\nIts nature one with Heaven and Earth,\nIts transformations equal to Creation,\nEven yin and yang cannot fathom its workings.\nWater is its wife, Earth its mother, Wood its child,\nThe White Emperor’s Metal form receives this womb.\nThe Four Symbols arise from my qi,\nAll things live or die by my qi’s command.\nIts nature linked to Jia and Yi, its qi flows freely,\nIt fans the union of Metal Maiden and Wood Elder.\nReturning to Wu and Ji in the Central Palace,\nWatch as all turns red in transformation.\nIf you fail to grasp this song’s earnest words,\nPonder each line carefully to dispel confusion.\nDo not say learning alone suffices—only through hidden merit\nCan you begin to fathom my intent and secrets.\n\nTrue Fire’s alternate names:\nGreat Yang, Vast and Elusive,\nRed Stone, Red Basin,\nVermilion Bird, Vermilion Child,\nRed Lead, Fire Lead, True Fire, Red Quartz.\n\nThe Eastern Song says:\nIn the East there is a Wood, originally named Sand,\nMale or female, it is also a sprout.\nReceiving qi at Wu, it must stand at Zi,\nNurturing essence, fostering substance, growing in Metal’s house.\nSince its growth over many years and months,\nEach dawn it faces the ends of the earth.\nDo not scorn its blackened, wrinkled form—\nIts entire body is the sun’s radiant essence.\nIf by chance it meets a child of yin’s house,\nWithout need of a matchmaker, they pledge themselves.\nWelcomed into the treasure chamber of the Central Palace,\nYin and yang’s qi unite, their hearts in accord.\nFor this purpose, the womb is remade,\nKan and Li move through the Eight Trigrams.\nAfter ten months’ gestation, mother and child part—\nThen you shall know the soaring phoenix and simurgh’s chariot.\n\nTrue Wood’s alternate names:\nGreen Dragon, Malachite,\nWood Essence, Fire Essence,\nMysterious Maiden, Golden Liquid,\nOld Woman, Flowing Mercury,\nFlowing Pearl, Bright Vessel,\nGolden Fluid, Red Marrow,\nLi’s Maiden, Female Gold,\nKun’s Essence.\n\nThe Central Song says:\nThe Central Palace’s Wu and Ji belong to the Black Tortoise,\nIts body aligned with emptiness and the Dao’s neighbor.\nPurely embracing primordial harmony and refined qi,\nThrough ten thousand refinements, the body is wholly perfected.\nWood is its wife, Fire its child, Water its ghost,\nWater and Earth restrain it, preventing its rise.\nYet it causes the birth of Western Metal,\nPassing on its strength and essence in succession.\nThough my form lacks a fixed shape,\nMy will and affairs depend on the Four Symbols’ life.\nWithout the Four Symbols’ connection to my qi,\nHow could Water, Metal, Wood, and Fire take form?\nIntimately familiar with Metal and Wood’s bonds,\nIt remains to nurture them tenderly in the womb.\nWhen the two substances harmonize and their qi merges,\nOne must rely on Bing Fire to refine and compress.\nBing Fire is originally my life,\nIts seasons and cycles arranged by the law’s decree.\nNaturally aligning with heaven and humanity’s workings,\nWho has seen the immortals’ true path?\n\nTrue Earth’s alternate names:\nYellow Earth, True Earth,\nPurple Earth, Chrysanthemum Flower,\nGreat Simplicity, True Yellow Sprout,\nTrue Dragon and Tiger, Dual Qi Spirit Sand,\nGreat Return Elixir.\n\nOn the First Production of the Yellow Sprout from the Two Qi:\nThe Yellow Sprout arises when Qian and Kun unite in resonance,\nCreation shapes its form.\nYin embraces yang’s soul,\nYang embraces yin’s spirit.\nYang’s numen shines with blood’s radiant clarity,\nYin’s truth gleams with jade’s luminous glow.\nSeizing the moon, its pure light bursts forth,\nContending with the sun, red clouds scatter in chaos.\nIts golden body heals all ailments,\nIts skin grows on the yang’s position,\nSecretly sharing yin’s essence.\nIt acts as matchmaker for the Five Metals,\nGoverning all stones as their master.\nThose who understand it swiftly ascend to the celestial realms,\nThose who remain ignorant dwell long in the dust.\nIn daily use, none recognize it,\nWandering blindly until their hair turns white.\n\nSong says:\nQian and Kun’s resonance begins the form,\nCreation’s origin lies in the Northern Gate’s completion.\nSun and moon revolve, souls and spirits unite,\nYin and yang mate, congealing as essence.\nClearly, a single qi grows from Metal,\nRecognize the Yellow Sprout born from Water.\nCountless are the fools in the world of dust,\nWho use it daily yet know not its name.\n\n**Discerning Lead and Mercury (Chapter Two)**\n\nTo refine the Great Elixir, first clarify the true origin of lead and mercury;\nTo conjoin and smelt the cinnabar, one must grasp the proper principle of Kan and Li.\nLead enfolds the marrow of yin—this is the Tiger, the Kan direction;\nMercury engenders the essence of yang—thus called the Dragon, the Li position.\nKan’s moon and Li’s sun serve as the ladder and mediator for their meeting;\nLi’s maiden and Kan’s youth respond to the guiding principle of return and restoration.\nLead, nurtured by the pungent (辛), enables the Great Return Elixir to illumine even the coarse-clad who yet harbor gold within;\nMercury, gestating in the wood (甲), naturally dons its hue while containing the essence of wood.\nIs lead mere worldly tin? Is mercury common silver?\nLead is the root and foundation of Heaven and Earth; mercury is the numinous qi of yin and yang.\nLead contains the solar essence (魄), mercury drinks the lunar spirit (魂).\nLead is true lead; mercury is no ordinary mercury.\nExtracting the marrow of the Five Phases, they coalesce into gold;\nUniting the essence of the Two Images, they transform and congeal into liquid.\nAs the sun wanes and the moon waxes, the essence (魄) sinks and perishes;\nAs the yang spirit (魂) wanes and the moon’s fullness recedes, the yin essence (魄) ultimately dissipates.\nYin and yang unite in resonance, forming the Dragon and Tiger as husband and wife;\nWater and fire reverse their intercourse, forging the Elixir of Qian and Kun.\nYang can restrain the essence (魄), circulating to spontaneously become gold;\nYin in form draws forth yang, revolving to begin as divine substance.\nWhen yin and yang reach fulfillment, await the cinnabar that transcends the world;\nWhen the cycles of water and fire conclude, behold the flowing liquid that ascends in rosy clouds.\nUpon the crimson frost of the crucible, suddenly blazes the radiance of dawn’s glow;\nWithin the alabaster powder of the furnace, dazzles the luminous brilliance of auspicious snow.\nLimpid as blood-red hues, the morning sun spills from Fusang;\nSerene as water’s gleam, the autumn moon bathes the cold isle.\nSwift as the crane of emerald peaks, solitary as the osmanthus of the jade tower’s bloom;\nFragrant as the Milky Way’s traverse, resplendent as the lotus’s verdant splendor in the distant sky.\nAt the moment of grinding, it scatters a fragrance of rich perfume;\nAt the ninth twist, its subtle radiance begins to shimmer.\nRefined into treasure, ingested to restore youth,\nA mere grain transforms one to soar in emptiness, feathered and roaming Heaven and Earth.\n\n**Oral Instructions of Master Guangcheng (Chapter Three)**\n\nThe world bustles in vain, its course unending,\nA hundred years pass like a fleeting dream’s glory.\nUnknowing of the cloud-lane’s traveler,\nThey strive only to vie for fame in the dust.\nIf you wish to preserve your years, follow the Great One,\nSwallow the numinous medicine to attain longevity.\nPurely refine the marrow of Heaven and Earth’s yin and yang,\nSmelt the essence of Qian and Kun’s sun and moon.\n\n**Transmitting the Two Flavors**\n\nTo subdue the Li Palace is effortless,\nSeek and refine the essence from the Kan Gate.\nOnly when husband and wife unite in resonance\nWill the Yellow Sprout be conceived, revealing its origin.\nWithout direct transmission from a master’s guidance,\nAll else is futile labor, wasted coin.\nThe fire-tending must persist through nine nines,\nThe Elixir’s completion awaits three years.\n\n**Oral Instructions of Master Yang the Perfected (Chapter Four)**\n\nThe King of Huai refined autumn stone,\nThe Yellow Emperor prized golden flowers.\nLet not the world’s people sigh in ignorance—\nThe immortals’ medicine pervades the Middle Kingdom.\nNo need for lead, no need for cinnabar,\nYet the deluded are as numerous as hemp.\nRefine lead, smelt cinnabar,\nAnd in an instant, the Yellow Sprout appears.\nOnce you obtain the Yellow Sprout, boast not,\nMatch this Yellow Sprout with the maiden’s house.\nHusband and wife harmonize over years,\nClad in purple robes, riding clouds and rosy mists.\nTest it with the grain—it is the River Chariot.\n\n**Another Song**\n\nWithin yin lies yang, within yang lies yin.\nHaving recognized mercury within cinnabar,\nOne must seek gold within lead.\nThese two flavors are Heaven and Earth’s great treasure,\nThe utmost essence of sun and moon.\nWhoever refines this shall not be deceived by lesser spirits.\n\n**Oral Instructions of Master Liangqiu (Chapter Five)**\n\nLead in water, lead in fire—\nThe two leads of water and fire share a single origin.\nUnknowing that the immortal lies within a foot’s reach,\nOne reverently simmers cinnabar in wine and vinegar,\nOnly for thousands upon thousands to vanish as smoke.\nIf, when subduing fire, it merely hardens,\nAnd you wish to become an earthbound immortal,\nRefine the Five Phases and complete the Four Images,\nCultivate virtue to aid the world, and truly ascend to Heaven.\n\n**Oral Instructions of Perfected Lord Peng (Chapter Six)**\n\nThe creation of yin and yang needs no transmission—\nUse only mercury as black lead.\nNeither harming mercury nor lead,\nThis substance in the Dao is profound beyond profundity.\nIf the world recognizes the true Dragon and Tiger,\nAttaining the Way lies but a moment away.\n\n**Oral Instructions of Master Cheng (Chapter Seven)**\n\nThe White Tiger is the essence within lead;\nThe Green Dragon is the primordial qi within cinnabar.\nEssence and qi unite to transform into the Yellow Sprout.\nLead, receiving mercury, becomes intimate,\nPassing from nonbeing into being;\nMercury, receiving lead, transmutes its form,\nPassing from being into nonbeing.\nThe two qi generate one another,\nReturning to the True One.\nTransforming the Four Images without losing the Five Phases,\nInternally and externally, Kan and Li,\nYin and yang emerge and submerge.\nRefining wu and ji, their radiant brilliance shines forth,\nGathering into azure peaks,\nDispersing back to the Purple Palace.\nMetal and Water pair, numbers align with hexagrams,\nHeaven and Earth open to merge in primordial chaos,\nSun and moon conjoin to complete the Three Powers.\nThe crucible is no different,\nThe fetal breath indistinguishable.\nThe heart resides in the abdomen, giving rise to a thousand wisdoms;\nThe medicine dwells in the vessel, transmuting myriad forms.\nFrom *Zhun*’s inception at the zi hour,\nTo *Meng*’s cultivation at the wu hour,\nUpon the furnace, rosy clouds ascend,\nTheir radiance outshining the sun.\nIngesting it prolongs life,\nRendering one immune to cold and heat.\nTransmuting the Five Metals,\nIt becomes an eternal treasure for the world.\n\n**Oral Instructions of Master Luofu (Chapter Eight)**\n\nThe world clamors with carriages and horses,\nYouthful faces and raven locks do not endure.\nAlchemical arts have been transmitted for ten thousand ages,\nYet seekers wander in confusion, unable to find the truth.\nFinding no truth, harbor no regrets—\nIt is because the Yellow Sprout is not genuine.\nLead is lead, mercury is mercury,\nYet the world’s people all misuse them.\nHerbal Yellow Sprouts, wooden Yellow Sprouts,\nThe world hears of them and vainly boasts.\nSince ancient times, oral transmission leaves no trace on paper,\nThose who burn them labor in vain, ruining their households.\nWorthy of transmission, pass it on in succession,\nSecure the original gate of this Dao.\nFalsely transmitting to the unworthy invites calamity.\nFather and son, Pang and Shu, must not speak of it—\nBlack-robed sulfur that does not smoke,\nIngesting it grants a lifespan of several thousand years.\nFurther, within the golden chamber of Heaven and Earth,\nOne sheds the mortal world, floating in emptiness to become a flying immortal.\n\n**Oral Instructions of Yin Changsheng, Ninth**\n\nGold forms the bones, lead forms the body,\nYin and Yang unite as Dragon and Tiger in kinship.\nAt sixteen, the Three Powers harmonize,\nThe Eight Trigrams spread wide as the Dipper points to *yin*.\n\nFrom *zi* to *wu*, no need to shift,\nThe seventy-two seasonal nodes must not err.\nThe old woman, through matchmaking, returns to the Great One,\nWithin the Purple Tenuity Palace, male and female arise.\n\nThe treasure within lead, the rarity within cinnabar,\nThis substance embraces the five spirits in its vastness.\nSeven months of gestation, divided by the six *jia*,\nA full year’s turning refines it into truth.\n\nThe Huainan method refines autumn stone,\nThe Yellow Emperor’s golden flower burns amber.\nA cup of white wine, infused with ninefold fragrance,\nIts crystalline radiance, sweet and pure, is called Dragon’s Nectar.\n\nOne may have it, another may not,\nThree families under one roof, yet two sons share it.\nFoxes and hares do not herd with horses to nurse,\nDifferent kinds by nature bear distinct essences.\n\nDarkness upon darkness, mystery upon mystery,\nThis method must not be passed to the unworthy.\nThe world knows not the medicine of the world,\nYet he who knows me returns life beyond Heaven’s decree.\n\n**Oral Instructions of Chunyu Shutong, Tenth**\n\nNow, the essence of the Great Yang\nIs called the Azure Dragon.\nThe Azure Dragon belongs to Wood,\nAnd Wood’s color is azure.\n\nWithin azure, fire is again concealed,\nFire’s color is red, returning to the south as cinnabar.\nWood is the mother of Fire, paired in the east,\nThus earning the name Azure Dragon—\nNot the common wood of mortal inquiry!\n\nThe Azure Dragon is mercury, the maiden.\nThe scripture says: *\"The maid by the river, numinous and most divine,\nWhen fire is applied, she takes flight, unstained by dust or filth.\nGhosts hide, dragons vanish—none know where she dwells.\nTo master her, the Yellow Sprout is the root.\"*\n\nThe instruction states: The Yellow Sprout is lead, black,\nIts color drawn from the north, the essence of the Great Yin.\nIt delights in stillness, excelling at restraining Yang.\nYang’s nature loves to fly, yet can be subdued by Yin.\n\nMoreover, cinnabar belongs to Fire, Yang,\nHarboring wondrous spirit within.\nLead belongs to Water, Yin,\nIts nature restrains spirit—\nWater extinguishes Fire, is this not clear?\n\nThe discourse says: Wood’s nature is upright, yet harmed by Metal;\nWater’s nature is yielding, yet overcome by Earth.\nEarth’s virtue is deep, yet harmed by Wood;\nMetal’s nature is firm, yet melted by Fire.\nThis is the mutual conquest of the Five Phases,\nThe eternal principle of the Great Dao.\n\nThus, when people fail to grasp Yin and Yang,\nThe depths of lead and mercury remain obscure.\nMistaking their harmony for elixir,\nThey ingest it, and poison surges through the five viscera—\nFor they have not fathomed the floating and sinking.\n\nThose who consume such things,\nHow can they meet a good end or long life?\nMost die young—truly pitiable.\nThe world lacks discernment, drowning in confusion,\nAnd thus brings ruin upon itself!\n\n**Oral Instructions of Xuanhuangzi, Eleventh**\n\nSeek immortality and the Yellow Sprout,\nYet first obtain the True Lead’s Flower—\nOnly that which forms of itself\nMay be wrought into Golden Sand.\nRefine it once more, ingest a single grain,\nAnd soar through space into the azure clouds,\nRoaming beyond heaven and earth,\nWhere every place is home to immortals.\n\n**Oral Instructions of Master Yinxizhen, Twelfth**\n\nThe supreme medicine must employ lead,\nGathered in a cup toward the dark.\nIf you would know the Yellow Sprout,\nFirst inquire of the Yin Earth.\nTrue Lead matches the Kan Man,\nWith Wu and Ji attending—\nThis alone is called Yellow Alum,\nThe very ancestor of Returned Elixir.\n\n**Oral Instructions of Master Taozhizhen, Thirteenth**\n\nTrue Mercury is not quicksilver,\nYet from this it is obtained.\nIf you seek true quicksilver,\nFirst seek the power within Kan.\nAnother instruction says:\nWithin the errant, one true Yang resides,\nThe child of Water, belonging to the West.\n\n**Oral Instructions of Master Xuanguang, Fourteenth**\n\nThe art of nurturing life\nIs neither difficult nor easy.\nThe world uses lead,\nYet fails to cultivate the will of lead.\nScarcely has it shed its black robe\nWhen its pure essence is revealed.\nUpon the ash pool’s blazing fire,\nThe knife’s edge follows the law.\nLead’s hundredfold return is the same—\nWhen drawn, take care not to lose it.\nHold it through the Crimson Gate,\nAnd at the touch, it hardens like stone.\nThe medicine employs True Water Essence,\nEight as the foremost number.\nWondrous essence, too, is eight ounces,\nIssuing from the Yang person’s body.\nWhen the two blend in harmony,\nThe Rice Mountain must be kept secret.\nUpon the Black Dragon’s curve,\nWhen the count reaches one ounce of True Dragon Brain,\nIt must be rich and unctuous.\nWhite is the True Dragon Brain,\nGray is not.\nUsed at the appointed time,\nThe two substances unite as one.\nThe Great Returned Elixir’s reflection\nRequires discernment in its preparation—\nTake care to use a vessel of true gold.\nShould one grasp these words,\nEarthly immortality is but this.\nIf misapplied,\nCalamity will descend in an instant.\nTen years of obscured sunlight,\nFive years without seeing light—\nYet if a single grain is transmuted,\nIn an instant, one attains sagehood.\n\n**Song:**\n*The Cantong Qi* and *Jinbi* conceal their secrets,\nYet the Yin Lord’s preface clarifies the steps.\nShould the adept encounter the Pure Clouds’ instructions,\nFrom this, Dragon and Tiger recognize their true form.\n\nHeaven’s primordial qi arises from emptiness,\nThe rosy-cheeked elder’s body like suet.\nWithin fire, the body transforms—still within fire,\nThe immortal, content, is called the Mystic Pearl.\n\nThe world knows softness but not hardness,\nClaiming the Yellow Sprout bears a yellow hue.\nOnly when one reaches the realm of Cup and Lead\nDo they realize the Yellow Sprout is not yellow.\n\n**Oral Instructions of Master Erzhu Ao, Fifteenth**\n\nHeaven set, earth established, the primordial chaos divided,\nCreation’s blossoms burn everywhere.\nOne Yin, one Yang—thus the Dao is formed,\nAutumn Stone, pale, begets descendants.\nXuanwu and Zhuque illuminate the path ahead,\nThe True Mercury of Yongquan guards the cosmos.\nIn the crucible, lead is refined into treasure,\nThe Old Woman hides her head and refuses to emerge.\nWithin the twelve gourds, the Purple River Cart,\nThe forty-two breaths blaze in the immortal’s cave.\nComplexion like jade, visage like frost,\nThe date leaf’s crimson, polished to perfection.\nSeizing sun and moon, they enter the furnace,\nFlaming, radiant—yet the soul remains unlost.\nIf not to relieve the world’s hunger, cold, and sickness,\nBetter to hasten and depart to study the Dao.\n\nBoil the White Tiger’s form in dark waters,\nThe Beast’s furnace, above and below, unfathomable.\nThe Great Image does not wander in the rabbit’s burrow,\nGreat awakening is not bound by petty details.\nThe deluded, their hearts astray, all lose the way—\nNot passed down to the blind of the lower realm,\nLest they bring ruin to clan and self.\n\nSix praises, six laments—\nErzhu Ao has departed for Penglai,\nAscending as an immortal in broad daylight, an ancient secret.\nThe crane calls ahead at Dongting Lake,\nI pay homage to my sacred ancestor, who preserved the art.\nDeparting, the primal sound sweet as honey,\nOne seven, two sevens, seventy thousand complete.\nOpening the furnace, suddenly a ball of fire appears,\nRadiant, blazing, resplendent.\nThough not to relieve the world’s hunger, cold, and sickness,\nBetter to seek the Dao and dwell in the Golden Chamber.\n\n**Oral Instructions of Master Chongxu, Sixteenth**\n\nI sigh in envy of the mighty river’s moonlit shadow,\nThe lord of gold arises, revealing the heart of lead.\nOne must strive to seek the immortal’s formula,\nLest the years and months slip by in vain.\n\n**Another Song:**\nNinefold refinement of lead’s essence completes the Great Dao,\nWhy should my family fear not attaining long life?\nAt dawn, I seek Nongyu to pass through the immortal’s palace,\nAt dusk, I visit Magu to enter the Great Clarity.\nThe divine illumination originally stems from the numinous qi,\nYet Emperor Wu of Han knew only worldly passions.\nAll things now are but emptiness and silence,\nA lifetime adrift, leaving only a floating name.\n\n**Oral Instructions of Master Dong the Immortal, Seventeenth**\n\nThe sun’s soul and moon’s spirit, formless,\nGathered in their natural, pristine state.\nTheir union with immortals is truly beyond discourse,\nRising to the clouds above the Yellow Sprout.\nDragon soars, Tiger leaps—transforming the Golden Field,\nFrom beginning to end, one must obtain the lead of transcendence.\nTo build a home, to dwell naturally,\nAt the moment of pairing, it is instantly known.\nRecognizing the parting from the womb, one longs to speak,\nYet it lies not in written texts or oral instructions.\n\n**Oral Instructions of Master Yuanyang, Eighteenth**\n\n*The Returned Elixir Chapter*, *The Returned Elixir Chapter*—\nTo obtain the Yellow Sprout, first ignite the lead.\nYang Ren does not flee in fire,\nHow can Yin Bing be wrought?\nThe hen incubates the egg until the days are complete,\nThe mother bears the child after ten months.\nIf only Kun comes to serve as dwelling,\nWhy fear Kun will not act?\nMy method lies before your eyes—\nDefy it, and you’ll wander for ten thousand kalpas.\nThe Eight Stones must flee in fire,\nDo not play with water and waste your efforts.\nThe Returned Elixir is not difficult for the world to learn,\nIt is only that people of this age lack the will.\nShould you understand Master Wei’s ten laments,\nA thousand turns of seawater will transform into mulberry fields.\n\n**Oral Instructions of Master Luo Gongyuan, Nineteenth**\n\nThe world does not know the elixir possesses spirit,\nYet if one tests wolfsbane, it will surely harm.\nKnowing the world holds both good and evil,\nWhy not draw near to good neighbors?\nNüwa refined the Five Constants’ qi,\nTransforming and shaping it to mend heaven and earth.\nThirty-six strategies the world knows,\nSeventy-two stones arrayed in their places.\nHeaven attains the One and thus endures,\nEarth attains the One and thus abides.\nMetal, refined by fire, becomes essence,\nWood, turned to charcoal, does not decay.\n\nThus know: only through refinement and essence,\nHow could the Great Return not be attained?\nCondense my spirit, settle my heart,\nWith focused intent, one may transmute to gold.\nThe River Chariot is drawn from lead,\nThe Crone’s Daughter must be sought within mercury.\n\nAdjunct substances circulate widely,\nThe Great One emerges from water into the public measure.\nHuainan stirred the cauldron, Pengzu’s mountain market altered the nature of sacrificial beasts,\nRecords of departed fragrance and secret-tasted salt.\nAttaining the Dao, they converge in the land of no death.\n\nCivil and martial arts must not be neglected,\nBeneath the crucible, only spread the green sea,\nWithin the furnace, use less of the mulberry’s sun.\n\nResplendent as fish scales piercing the eye’s light,\nOne must follow Wei Bo in the clouds,\nNot learn from Chang’e’s concealment in the moon.\n\nDengdu’s name falls to the celestial treasury, the earthly underworld’s yin officials greatly fear,\nBlades, water, and fire cannot harm,\nHow much less insects, snakes, tigers, and rhinos?\nTowering, the golden bones all harden,\nLush, the green body with its verdant fur.\nOnce observed the Eastern Sea’s many turns,\nSeveral times stolen the Queen Mother’s peaches,\nCommanding the Thunder Duke, dispatching spirits and ghosts,\nA thousand years but a brief parting from Liaodong’s waters.\n\nFirmly seal and refine, must bind with purple smoke and jade-green flames that spout upon men.\n\nRiding dragons, mounting cranes, captivating cities,\nIn seven days, one should return to the Way of the Viscount of Wei.\nThis is easy yet profoundly difficult.\nGreen Dragon and White Tiger coil of themselves,\nThe yin chariot is damp, the yang chariot dry.\nHusband and wife face each other, settled within the hexagram,\nThe four directions’ ends stain with color,\nFive kings and marquises all resign their offices.\n\n**Oral Instructions of Master Baopuzi, Twentieth**\n\nCinnabar and mercury enter the Flowery Pool,\nThe Yellow Sprout is gathered, yet none know.\nThis is the oral instruction left by immortals,\nThe world clamors with confused words.\nFor seventy years, entrusted to one person,\nBestowed only upon those with immortal bones.\nEach matter must be transmitted hand to eye,\nGathering occurs in but a moment’s time.\nThe River Chariot rests within the Cinnabar Field,\nSubdued only at the Yellow Sprout’s side.\n\n**Oral Instructions of Master Zhiguzi, Twenty-First**\n\nIf lead is true,\nIt does not lose its household minister.\nIf lead is not true,\nIts mercury will be hard to approach.\n\n**Oral Instructions of Master Yang Xuan, Twenty-Second**\n\nIn the world, everyone seeks the medicine,\nYet each originally fails to find it.\nSome say use lead, some say do not,\nBut when it comes to using lead, it is still wrong.\nUse lead, do not use lead,\nNot using it grants long years.\nUse lead, must use lead,\nUsing lead, reside in the Cinnabar Field.\nWithout lead, the elixir does not form,\nThe Returned Elixir is born in lead.\nThe Metal Duke can restrain water.\nBlack lead contains the Yellow Sprout,\nThe Yellow Sprout enters mercury’s house,\nCovered and borne by the River Chariot.\n\n**Song:**\nLead emerges from within lead,\nLead of the same color yet not the same.\nIf one can distinguish black and white,\nEach day is a celestial elder.\n\n**Oral Instructions of Monk Ruonè, Twenty-Third**\n\nThe Yellow Sprout, cinnabar, and mercury concoct,\nThe yin husk contains the yang flower.\nWithout grasping the Yellow Sprout’s principle,\nThe Returned Elixir’s path remains distant.\nPeople of the world refine the medicine to its utmost,\nAll recognize lead’s yellow flower.\nThe yellow flower is a dead thing,\nHow can it reach the immortals’ realm?\nThe Yellow Sprout is not an external medicine,\nThe inner image extracts its essence.\nWhen reaching the Yellow Sprout’s ground,\nGold and silver are but vain boasts.\n\n**Song:**\nIf the sprout is lead,\nDepart from lead by ten thousand miles.\nIf the sprout is not lead,\nBegin from lead.\nLead is the sprout’s mother,\nThe sprout is lead’s child.\nHaving obtained the golden flower,\nAbandon lead and do not employ it.\n\n**Zhang Hua the Perfected’s Song of Lead and Mercury, Twenty-Fourth**\n\nThe Red Dragon transforms into powder,\nThe White Tiger sharp as frost.\nWithin, cast the stone’s liquid,\nStill requiring the Emperor’s Flowing Sauce.\nRegulate the spirit, purify the five viscera,\nDesiring to refine the Three Lights.\nFirmly guard the nature of solid ice,\nHow can yin employ yang?\n\n**Oral Instructions on the Two Flavors**\n\nThe tiger crouches, the dragon also hides,\nThe dragon first lurks, then subdues the tiger.\nSimply complete the River Chariot’s work,\nNo need for embankments or defensive concerns.\nThe Yellow Elder studied flying immortality,\nMadly deluded, unable to find the path.\nTurning back, he pointed to the female phoenix,\nUnfathomable are yin and yang’s numbers.\nYet sitting in the Great One’s palace,\nOnly then do Shen and Shang meet.\nLeft and right, drawing near the spirits,\nThe four phases all support and protect.\nHeaven and earth’s model is complete,\nNaturally, immortals will attend.\n\n**Oral Instructions of the Prefectural Judge of Jianzhou, Twenty-Fifth**\n\nWithin the nine nines, the Qian body opens,\nThe Flowery Pool’s golden liquid naturally lingers.\nUpon the yin-yang crucible, first appears radiance,\nWithin the lead-flower furnace, the Three Powers are tested.\nThen know creation lies in human hands,\nWith proper technique and true medicine, spirits come of themselves.\nAt this stage of cultivation, one should transcend the world,\nThe four seasons need not bitterly urge.\n\n**Critique:**\nIts color shines brilliantly, illuminating sun and moon,\nEndless transformations, beyond thought.\nBut once lead and cinnabar become treasure,\nCease the firing, freely let bing and ding blow.\n\n**Laozi’s Song of Lead and Mercury from Hangu Pass, Twenty-Sixth**\n\nRed lead, black lead, the Great Elixir’s head,\nRed lead, black lead, their bodies the same.\nBlack metal extracts essence, red extracts marrow,\nUnderstanding the use of red and black: medicine without red enters black to preserve long life,\nUsing black to enter red, celestial immortals achieve the Great Returned Elixir, its reflection clear.\nThe two inverted methods are both called lead,\nBlack can transform into red celestial immortals.\nThose of the utmost Dao must not be careless,\nGreed for wealth and lust for beauty need not be transmitted.\nAt the head of Hangu Pass, Liangshi Mountain,\nLaozi carved these words into stone.\n\n**Oral Instructions of Master Cen Zhenren, Twenty-Seventh**\n\nHeaven generates the Great Simplicity,\nEarth produces numinous essence.\nAble to subdue, able to fly,\nTransforming like spirits.\nYin and yang’s ancestral founder,\nThe Dao accords with ruler and minister.\nThe sage’s secret treasure,\nNot heard by the unworthy.\nMoreover, the Great Simplicity is the ruler,\nNuminous essence the minister.\nHarmonizing the two natures,\nInhaling and exhaling, they swallow each other.\nAs husband and wife,\nMale and female in marital kinship,\nTransforming, hooking, and pulling,\nLove transmits the truth.\n\n**Song:**\nEastern Green Dragon,\nBing, ding, jia, yi.\nWestern White Tiger,\nRen and gui congeal the liquid.\nThe two qi contain the true,\nHard for the world to find.\nGrasping this treasure,\nOne water, one stone.\nThe ash pool’s flames blaze,\nRemoving names from death’s register.\n\n**Transmitted Heart Instructions, Another Song**\n\nThe water spirit casts into golden jade,\nHeaven and earth’s sun and moon essence.\nKan and Li achieve completion,\nThe Three Powers display their names.\nYang numbers reside in yin’s execution,\nYin numbers return to yang’s punishment.\nDesiring to know the inverted technique,\nMutual overcoming is mutual generation.\n\nIf one refines the various Eight Minerals,\nA thousand, ten thousand—none will succeed.\nThose who seek the true Dao\nMust seek *geng* upon *ren* and *gui*.\n\n**Cui Xuanzhen’s Minshanzi Oral Instructions, Twenty-Eighth**\n\nThe Minshan treasure-chamber, abode of the Nine Immortals,\nSun and moon coil within its hollow depths.\nFor true persons ever guard this place,\nJade remains coiled, *qi* endlessly at ease.\n\nOnce a traveler to Haijiao and Kunqiu,\nFar controlling dragon teams, he traced their tracks.\nRefining, he achieved the Ninefold Transformation of *hua*,\nWithin, white silver amassed in recompense.\n\nThe jade hare of the moon, the yang within *kan*,\nOutwardly yielding in form, inwardly firm.\nThe two images—male and female—share one body,\nJust as gold hides within water.\n\nGold and water unite as *hun* and *po*,\nThe Three Powers transform, truly unfathomable.\nSuddenly, dragon and tiger intertwine,\nGiving birth to the dragon-child in the unseen.\n\nIts form resembles congealed butter, the yellow sprout of snow,\nOr the jade blossoms of Xuanpu.\nNot born of worldly scheming,\nBut the secret instructions left by true persons.\n\nLeave no flaw in these secret instructions,\nFor in the crystal mountain’s stone chamber lies cinnabar.\nThose who attain the supreme Dao follow this method,\nAnd fly to take the Green Dragon as their kin.\n\n*Ji-hun* completes the celestial circuit, forming *qi*-substance,\nOnce more conjoined with mercury, firmly sealed.\nLike a son returning to wed the young maiden,\nOr Su Qin and Zhang Yi’s persuasions—love cannot be lost.\n\nThis thing passed down is the yellow sprout,\nLayer upon layer, the golden crucible holds golden blossoms.\nRefined into realgar, the reclining elixir-sand,\nSealed with the Six-One method, it must be kept secret.\nLet no flaw mar the divine chamber.\n\nThe fire-timing begins with the first yang,\n*Qian* and *kun* form its beginning and end.\nCivil warp and martial weft awaken the numinous mechanism,\nOne method—the secret decree of the former kings.\n\nHeavenly toads and spiders all revive,\nWhen the elixir crucible opens, the Dao’s nature is revealed.\nEach cycle brings wondrous transformations, new forms arise,\nTheir radiance—crimson, purple—defies description.\n\nThen take the golden vessel, use mercury as the repository,\nWhen the world’s light is exhausted, the Red Dragon flies.\nBurning gold, the Minshan adept learns the Dao,\nReceiving the true person’s mysterious decree.\n\nThe mysterious decree speaks only of mercury and lead,\nRefining the yellow sprout, the body does not die.\nRefine the elixir, refine the will, refine the spirit,\nDo not pursue fame or profit—manifest pure fragrance.\n\nFlee fame, withdraw beyond the dust,\nDwell in quietude, attune to the highest.\nDo not imitate the world’s clamorous, shallow men,\nWho toil their whole lives for renown.\nThough they yearn for long life,\nThey cannot escape the marketplace.\n\n**Dou Zhenjun’s \"Seven-Returned Sand\" Song, Twenty-Ninth**\n\nThe Metal Duke is sixty,\nAt sixty, the Metal Duke is old.\nThe Maiden is sixty,\nAt sixty, the young maiden is young.\n\nThe Metal Duke is thirty,\nThe Maiden grows ever younger.\nThe old man gains a young wife,\nThe withered willow sprouts fresh shoots.\n\nHusband and wife in one place,\nComplete the Dao in harmonious union.\n\nThe root is the yellow sprout,\nThe Metal Duke’s primal family.\nThe Maiden enters the lead chamber,\nIn an instant, the earth transforms to cinnabar.\n\nThe inverted moon joins the upright moon,\nThe upright moon must be swiftly secured.\nSeal firmly, seal again,\nSealing like the elixir family.\n\n*Bing* and *ding* spread below,\nChaos itself turns sweet and fragrant.\nSeven and eight—yang numbers reach their peak,\nNine and six must be added again.\n\nThe four shells—yang now full,\nFive colors like the dawn’s glow.\nRemove the yang, discard the inverted moon,\nAbove, the finest yellow sprout.\nYellow is the color of gold,\nWhite is the white horse’s tooth.\nTransforming, it becomes the conveyance,\nThus called the River Chariot.\n\nMysterious brightness and hidden submission,\nHusband and wife share one home.\nThis is the King Yang’s technique,\nThe Yellow Emperor’s golden blossom.\n\nThe wise conceal it,\nFools boast of it to others.\nThose who grasp this Dao\nRide cranes to the white clouds’ edge.\n\n**Han Zu’s Celestial Master Oral Instructions, Thirtieth**\n\nLead draws out marrow, marrow draws out essence,\nEssence and marrow unite—the elixir must form.\nOne catty of mercury, seventeen taels,\nOne tael transforms into lead’s essence.\n\nUse this lead-essence to make the great elixir,\nLaozi’s Ninefold Refinement enters life’s mortar.\nOne tael of mercury has an ox’s strength,\nConsuming it, one’s appearance becomes immortal.\n\nAn immortal’s appearance—sinews and bones firm,\nSinews and bones strong, reversing withering.\nCut out the tongue if asked—no need to speak,\nUnable to conceal or reveal, appear or hide.\n\nGuard your words, do not act madly,\nLest the celestial gods above grow angry,\nAnd bring misfortune or the blade’s gleam.\n\n**Guo Zixian of Guozhou’s Oral Instructions, Thirty-First**\n\nThe White Maiden, just sixteen,\nBoasts a delicate frame, a jade-like face.\nEver sighing at the months without a good matchmaker,\nDay and night alone, she sleeps by herself.\n\nHer parents do not understand her heart,\nCasually speaking of Zhang San or Li Si.\nSeveral times the talks come to nothing,\nMaking her ashamed to heaven, ashamed to earth.\n\nSuddenly, the Yellow Crone comes knocking,\nSaying the Metal Duke’s nature is gentle.\nShe takes their two fates to consult Junping,\nJunping declares this a fine match.\n\nNeither biased nor crooked, it accords with heaven and earth,\nExamining the cause, it is most fitting.\nTo this day, their descendants fill the imperial realm.\nWere it not for the Yellow Crone’s efforts,\nHow could yin and yang have united?\n\n**Cao Zhenren’s Oral Instructions, Thirty-Second**\n\nSeize the Eastern Green Dragon,\nPair it with the Western White Tiger.\nThen take the Southern Vermilion Bird,\nMatch it with the Northern Dark Warrior.\n\nTrace these four to their root,\nOriginally of the same ancestral clan.\nYet people do not know to explore this,\nMistaking many stones for the marquis.\nThey do not understand how to unfold yin and yang,\nTo pair them as husband and wife.\n\nYin and yang’s *qi* are inherently dual,\nOnly then can they unite.\nOf these, the most wondrous\nIs the Central Earth.\n\nThe clay furnace needs no artifice,\nBut the fire’s management requires diligence.\nEach day, two hexagrams’ timing,\nAdvance and retreat follow the measure.\nExhaustively study the moon’s waxing,\nLest wind and rain be lost.\n\nAfter ten months, the returned elixir is complete,\nThe body freed from poverty and suffering.\nWhen the blue sea turns mulberry fields,\nYou will witness the change.\n\nWhoever obtains my Dao,\nMust not lightly pass it on.\nTo casually reveal heaven’s mechanism\nBrings calamity upon seven generations.\n\n**Han Yunzhong, Recluse of Mount Taibai, Oral Instructions, Thirty-Third**\n\nThe great Dao is vast and distant,\nYin and yang are hard to fathom.\nCreation and transformation arise,\nYet people cannot comprehend them.\n\nVainly discussing emptiness, they white their hair by the thousands,\nWasting wealth to prolong life,\nYet preserving their complexion brings injury and ruin, shortening their years.\n\nThose of past and present who pursue this Way have met ruin in droves, their eyes straying from true teaching, their minds unclear on the essential aim. They call mercury yin and the Four Yellows yang, cast crude lead into the mix, and gather flowers as earth—herbs and trees they name dragon and tiger. Common gold and silver they pair as mother and child, refining elixirs and consuming them, only to court impermanence. Such errors fill the world, gross and deluded.\n\nIn my own past inquiries, I too traversed this path, yet how could I have known the subtle art holds a wondrous method, uniquely revealing the utmost truth? Water is lead, it is mercury—the male within Kan, its virtue residing in Ren and Gui. Refine yin to dissolve and subdue; after nine cycles of sinking and rising, the count is complete and Qian is formed, matched with metal in the western position. Though the world also employs these, they fail to grasp their origin.\n\nDragon and tiger possess form, hardness and softness distinguish themselves. The Metal Lord extinguishes fire; true white snow is required. The Five Movements transform and generate; fire is naturally subdued—this alone is real.\n\nMercury dwells within Li, obtaining the female; Li is fire, cinnabar. Attaining Ren, Gui, Bing, and Ding, it returns qi to the eastern blue yang. White concealment emerges from the center, present before one’s eyes yet difficult to perceive, obscure and indistinct, truly veiled in mist.\n\n**Oral Instructions of Yan Junping, Thirty-Fourth**\n\nLead is lead, mercury is mercury—only these two are lead and mercury.\nDragon is dragon, tiger is tiger—only these two share a common ancestor.\nIf you can recognize this Kan and Li palace,\nBeneath the Li palace, yellow earth emerges.\nYellow earth yields the yellow sprout,\nBeneath the yellow sprout, golden flowers form.\nWhen golden flowers form,\nBeneath the golden flowers, purple essence congeals.\nWhen purple essence congeals,\nBeneath the purple essence, white gold appears.\nWhite gold sinks while yellow gold floats;\nThe world gathers the sinking as the elixir’s head,\nSeeking the red marrow to blend and sow.\nThere is a time for sowing, a day for harvesting,\nExchanging sinew and bone to extend lifespan—\nCelestial immortals and earthly immortals beyond imagination,\nTransmuting lead, iron, even tiles and shards.\n\nOne, two, three, four, five—\nWater, fire, wood, metal, earth.\nSimply understand this secret,\nAnd you tread the path of longevity.\n\nThe Great Returned Elixir shines in the mirror, complete.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "大还丹照鉴 经名：大还丹照鉴。 一卷，出於五代宋初。 底本出处：《正统道藏》 洞神部众术类。 大还丹照鉴 夫大还丹者，虚无之系，造化之包一气以为先，辟二仪以垂象，则所谓天兹显瑞，物禀含灵； 总四象以成形，区五行以定体！ 窈冥之内，斯道莫可穷； 恍惚之中，唯情不能度。 适自厦古，迄至於今，广演繁文，细敷舆论，致后学罔明其旨，顾前贤毕了之机，俱隐玄言，曷探秘法？ 余生居梓郡，世本皇都，只自童稚之年，便慕神仙之道。 心专弃官，不务荣名，知死事之毕期，遂求生之延驻，想世间多种，唯人最灵，万法登真，莫不由己。 遂游胜境，或步嚣尘，访志友以讨论，冀明师以传授。 洎乎天不辜愿，果值奇人，指示龙虎之形，方明龟蛇大体，乃更褊寻仙诀，广阅丹书，将明可久之元，用证返淳之理。 迁凡易圣，非积行以难俦，转魄归阳，在虔诚而自偶。 何况大丹者，光凝日月，玲浸云霞，澄兔窟之精辉，混龙胎之流影。 灵踪罕露，尘迹宁谙，究此者悠哉，信死者倍矣· 。 其有贪财逐利，厚己薄人，纵妻妾以满堂，谁能代死？ 假使金玉以盈屋，岂续长生？ 万种千般，荒郊堆土，何曾百岁？ 唯恣既娌。 奉道者无非欲贪，苟学者刚言深会，以至鬓销党色，容臧童颜，始叹隙影难留，仍嗟逝波不返。 如此流辈，岂不伤哉！ ．或有近学之徒，恨执先师之作，论还丹则阴阳莫晓，言赋命则动息伤神。 错认汞铅，妄求赤白，或云内化五脏，外化五金，点金须得庚，化银须用艮。 或云金化金兮银化银，自此更无别神圣。 此大谬，认上仙之说焉，得妄将草石，欲造金银，实为天地悬殊，可谓谬矣！ 予尝念愚昧，不知阳中有阴，阴中有阳，伏汞即汞结河车，吸铁者须明磁石，乃合夫妇之道，自然法度周旋，但明性情，克无不就。 若世别有黄白之妙，则神仙之道全非。 古今一门，更无二议。",
      "translated_text": "**The Illuminating Mirror of the Great Return Elixir**\n\n*Scripture Title:* *The Illuminating Mirror of the Great Return Elixir*. One scroll, originating from the Five Dynasties and early Song period. Base text from *Daoist Canon of the Zhengtong Era*, category of Miscellaneous Arts in the *Dongshen* section.\n\n**The Illuminating Mirror of the Great Return Elixir**\n\nThe Great Return Elixir is bound to the realm of emptiness and nothingness, encompassing the transformations of creation with primordial qi as its foundation. It splits the Two Modes to manifest images, through which Heaven displays its auspicious signs and all beings receive their numinous endowment. It unites the Four Symbols to form shapes and distinguishes the Five Phases to determine bodies. Within the profound and obscure, this Dao cannot be fathomed; amid the indistinct and vague, only sentiment fails to comprehend it.\n\nFrom remote antiquity to the present, its teachings have proliferated in elaborate texts and intricate discourses, leaving later learners bewildered as to its essence. Yet the mechanisms by which former sages attained mastery remain concealed in arcane words—how then can one delve into its secret methods?\n\nI was born in Zizhou, my family originally from the imperial capital. From childhood, I yearned for the Dao of divine transcendents. My heart was set on abandoning officialdom, scorning glory and fame. Recognizing that death is the inevitable end, I sought to prolong life. Among all things in the world, humans alone are most endowed with spirit; the myriad methods for attaining truth all depend on oneself. Thus, I wandered through sublime realms, sometimes treading the dust of the mundane, seeking like-minded companions for discussion and hoping to meet an enlightened master for transmission.\n\nBy Heaven’s grace, my wish was not in vain—I encountered an extraordinary person who revealed the forms of the Dragon and Tiger, clarifying the great principles of the Tortoise and Serpent. Thereafter, I diligently sought immortal formulas and extensively studied elixir scriptures, aiming to illuminate the eternal origin and verify the principle of returning to purity. To transcend the mortal and become sagely is no easy feat without accumulating merit; to transform the corporeal soul and return to yang depends on sincerity and natural resonance.\n\nMoreover, the Great Elixir gleams like the sun and moon, its radiance suffusing clouds and mist. It refines the essence of the Moon’s Toad and blends the flowing reflections of the Dragon’s Embryo. Its numinous traces rarely appear, and its dust-borne marks are seldom known. Those who pursue it may wander in vain, while those who dismiss it hasten toward death.\n\nSome covet wealth and chase profit, enriching themselves while impoverishing others. They fill their halls with wives and concubines—yet who can die in their stead? Even if gold and jade fill their houses, can these prolong life? The myriad things of the world, piled like earth in the wilderness—how many endure a hundred years? Only indulgence and dissipation prevail.\n\nThose who uphold the Dao do so not out of greed, yet some learners boast of deep understanding. By the time their temples gray and their complexions fade, they only then lament how fleeting time slips away, sighing that the rushing waves never return. Such people—how pitiful they are!\n\nThere are also those among recent learners who cling rigidly to their teachers’ works. When discussing the Return Elixir, they fail to grasp yin and yang; when speaking of destiny, they harm their spirit through restless exertion. They misidentify mercury and lead, vainly seeking red and white transformations. Some claim the Five Viscera undergo internal alchemy while the Five Metals transform externally, insisting that transmuting gold requires *geng* (庚) and refining silver requires *gen* (艮). Others say, “Gold becomes gold, silver becomes silver—there are no other divine or sagely methods beyond this.” This is a grave error! They mistake the words of celestial transcendents, recklessly using herbs and minerals to forge gold and silver—truly a vast divergence from Heaven and Earth, a profound delusion!\n\nI have long lamented such ignorance, unaware that within yang there is yin and within yin there is yang. Hidden mercury is mercury that congeals the River Chariot; the one that attracts iron must recognize the lodestone. Only by harmonizing the Way of husband and wife and naturally following the cyclic patterns, clarifying nature and emotion, can all be accomplished. If the world possessed some other marvel of yellow and white (gold and silver), then the Dao of divine transcendence would be entirely false. From ancient times to the present, it has been one path—there is no second doctrine.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 717,
      "start_sentence": 0,
      "end_sentence": 29,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.728228092193604,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大还丹照鉴.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "偶因闲暇，采摭仙经，重删先圣格言，留为后人轨范，名曰《照鉴登仙集》 。 总成一卷，分作三十三篇，实谓鉴彼痕疵，厥号登仙，令妍丑便分，遣精微易会，悉是灵文秘旨，丹诀玄机。 俾尽显於前贤，庶普明於后学。 伏愿仙真鉴佑，上帝垂慈，洞化回匡护之心，太清资拔升之道，以贻同志，用涤弘襟。 略览者似玩珠珍，得卷者如怀异宝，傥依经诀，必契超凡。 若以自意修治，定是耗财罄产，非人勿示，轻泄阴诛。 时广政壬戌二十五年寅月上元集序。 北方歌曰",
      "translated_text": "During moments of leisure, I gathered and compiled the scriptures of immortals, carefully editing the maxims of former sages to serve as a model for later generations, entitling it *Illuminated Mirror: Anthology of Ascension to Immortality*. Comprising a single scroll, it is divided into thirty-three chapters, truly intended to reflect flaws and blemishes, thereby earning its name *Ascension to Immortality*—so that beauty and ugliness may be readily distinguished, and subtle mysteries easily grasped. All within are sacred texts and esoteric instructions, alchemical secrets and profound mechanisms. May they be fully revealed to past worthies and broadly illuminated for future learners.\n\nI humbly pray that the perfected immortals may grant their protection, that the August Emperor may bestow his mercy, that the enlightened transformation may awaken a heart of correction and safeguarding, and that the Great Clarity may provide the Way of deliverance and ascent. Thus shared with like-minded seekers, it may cleanse and expand the vastness of their aspirations. Those who glance upon it may treat it as a treasure of pearls; those who obtain a copy may cherish it as a rare jewel. Should one follow its precepts and formulas, one will surely attain transcendence beyond the mundane. But if one practices according to personal whim, one will surely squander wealth and exhaust one’s estate. Do not show this to the unworthy; reckless disclosure invites heavenly retribution.\n\nComposed in the first month of the first full moon of the twenty-fifth year of Guangzheng, the renxu year.\n\nA northern song says:",
      "overlap_context": "is yang. Hidden mercury is mercury that congeals the River Chariot; the one that attracts iron must recognize the lodestone. Only by harmonizing the Way of husband and wife and naturally following the cyclic patterns, clarifying nature and emotion, can all be accomplished. If the world possessed some other marvel of yellow and white (gold and silver), then the Dao of divine transcendence would be entirely false. From ancient times to the present, it has been one path—there is no second doctrine.",
      "start_char": 717,
      "end_char": 926,
      "start_sentence": 30,
      "end_sentence": 37,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.689534664154053,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大还丹照鉴.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "北方玄武身本黑，家乡体住昆仑国，寻常定志有长生，方圆任性可生得。 随流信运长为客，谁识我身性无白？ 不独含着五行精，就中偏感阴阳魄，调和兑震为夫妇，四象排来在高处。 分明指似后人言，莫使昏迷错天路。 真水异号 曰白金曰灵珠，曰真身舍利，曰流汞曰流砂。 曰玄珠曰众生，曰活宝，曰九转金丹，曰摩尼珠。 曰丹砂曰夜光珠，曰太阴真水，曰窈冥华池。 曰乌金矾曰昆仑矾，曰黑金曰圣石。 曰金公，曰玄武乌驴乳，曰波斯矾。 西方歌曰 西方白虎本属阴，为男为女亦为金，长立子宫胎产午，成形兑体坎同心。 娇姿玉貌欺冰雪，素质含光洒轻血，则知唤作白琅讦，怎识我身是明月。 无媒自嫁得黄芽，生死须归戊己家，炎烈下时寒国上，阴阳催促总成砂。 若人会得吾此语，目前便是三清路，驾鹤冲天日有期，定知永劫抛尘土。 真金异号 曰白虎曰白金，曰太白曰太玄，曰太真曰太素，曰真水银。 曰水精曰秋石，曰石液曰玉液，曰真铅曰乾精，曰美金花。 曰雄金曰河车，曰柔银曰真金，曰坎男曰玄液，曰水中金。 曰神符白雪，曰圣无知，曰锡怯脂，曰白马牙，曰好丹砂。 南方歌曰 南方朱雀，其身赤猛烈，雄强势难敌，性共乾坤，造化齐体，并阴阳难消息。 水妻土母木家子，白帝金形胎受此。 四象皆因我气生，万类须由我气死，性连甲乙气偏通，媾扇金娘嫁木翁，归投戊己到中宫，看看变转总交红。 此歌不悟殷勤说，句句从头细分雪，莫言积学但阴功，始解消详吾志诀。 真火异号 曰太阳曰恍惚，曰赤石曰赤盥，曰朱雀曰朱儿，曰红铅曰火铅，曰真火曰红石英。 东方歌曰 东方有木本名砂，为男为女亦为芽，受气午成须立子，含精育质长金家。 自从成长多年月，朝朝各自向天涯，莫欺形貌黑皴皱，浑身总是日精华。 忽若遇着阴家子，不假良媒自相曰许，迎归宝帐到中宫，阴阳气合情意与。 特地为胎重造化，运动坎离巡八卦，十月怀胎母子分，定知霄汉胶鸾驾。 真木异号 曰青龙曰曾青，曰木精曰火精，曰玄女曰金液，曰姥女曰流汞。 曰流珠曰明当，曰金津曰赤髓，曰离女曰雌金，曰坤精。 中方歌曰 中央戊己属句陈，体合虚无与道邻，纯抱元和精粹气，陶身万炼总成真。 木妻火子水家鬼，水土相镇不能起，还教却产西方金，递代相承壮精髓。 虽然我身无正形，志事限凭四象生，四象不因连我气，水金木火岂能成？ 褊通金木恩情熟，留向胎中亲养育，两物相和气总并，须凭丙火来煎蹙。 丙火元来是我命，节候轮排依法令，自合天人造功机，谁见仙家真径路？ 真土异号 曰黄土曰真土，曰紫土曰菊花，曰太易曰真黄芽，曰真龙虎，曰二气灵砂，曰大还丹。 论二气产黄芽第一 夫黄芽者，乾坤感合，造化成形，阴抱阳魂，阳抱阴魄。 阳灵而血辉莹彻，阴真而玉彩通明，夺月而素光争发，斗日而红霞乱起。 金身医鬣遍，体生皮，长於阳位，暗共阴精。 与五金之作媒，统一石而为主，明之者顿冲於霄汉，昧之者长处於风尘。 日用而皆不识，波波而成皓首。 歌曰 乾坤感应始为形，造化元因北户成，日月周旋魂魄合，阴阳交媾结为精。 分明一气从金长，认取黄芽自水生，无限虚於尘世裹，时人日用不知名。",
      "translated_text": "The Northern Song says:\n\nThe Dark Warrior of the North is black in form,\nHis homeland rests within the Kunlun realm.\nWith steadfast will he seeks eternal life,\nIn any shape or way he may be born.\nAdrift upon the currents, fate’s guest he roams,\nWho knows his nature bears no trace of white?\nNot only does he hold the essence of the Five Phases,\nBut within him, yin and yang’s souls deeply stir.\nHarmonized, Dui and Zhen become husband and wife,\nThe Four Symbols arrayed on high.\nClearly I point this out to later generations—\nLest they stray, bewildered, from the celestial path.\n\nTrue Water’s alternate names:\nWhite Gold, Spirit Pearl,\nTrue Body’s Śarīra, Flowing Mercury, Flowing Sand,\nMysterious Pearl, All Beings,\nLiving Treasure, Nine-Turn Golden Elixir, Maṇi Pearl,\nCinnabar, Night-Shining Pearl,\nGreat Yin’s True Water, Dark and Mysterious Flower Pool,\nBlack Gold Alum, Kunlun Alum,\nBlack Gold, Sacred Stone,\nMetal Lord, Dark Warrior’s Black Donkey Milk, Persian Alum.\n\nThe Western Song says:\nThe White Tiger of the West is yin by nature,\nMale or female, it is also Metal.\nLong standing in the Zi Palace, born at Wu,\nIts form complete in Dui, its heart one with Kan.\nFair as jade, its beauty surpasses ice and snow,\nIts pure essence holds light, scattering pale radiance.\nThough called White Langgan,\nWho knows my true self is the Bright Moon?\nWithout a matchmaker, it weds the Yellow Sprout,\nIn life and death, it must return to Wu and Ji’s home.\nWhen scorching heat descends, cold realms rise,\nYin and yang urge on, all becomes cinnabar.\nIf one grasps the meaning of these words,\nThe path to the Three Clarities lies before your eyes.\nRiding a crane to soar heavenward will come in time—\nThen you shall surely cast off the dust of endless kalpas.\n\nTrue Gold’s alternate names:\nWhite Tiger, White Gold,\nGreat White, Great Mystery,\nGreat Perfected, Great Simplicity, True Mercury,\nWater Essence, Autumn Stone,\nStone Liquid, Jade Liquid, True Lead, Qian’s Essence,\nFair Gold Flower,\nMale Gold, River Chariot,\nSoft Silver, True Gold, Kan’s Male, Mysterious Liquid,\nGold in Water,\nDivine Talisman White Snow, Sacred Ignorance,\nTin Fat, White Horse’s Tooth, Fine Cinnabar.\n\nThe Southern Song says:\nThe Vermilion Bird of the South,\nIts body fierce and red,\nMighty and unyielding, hard to rival,\nIts nature one with Heaven and Earth,\nIts transformations equal to Creation,\nEven yin and yang cannot fathom its workings.\nWater is its wife, Earth its mother, Wood its child,\nThe White Emperor’s Metal form receives this womb.\nThe Four Symbols arise from my qi,\nAll things live or die by my qi’s command.\nIts nature linked to Jia and Yi, its qi flows freely,\nIt fans the union of Metal Maiden and Wood Elder.\nReturning to Wu and Ji in the Central Palace,\nWatch as all turns red in transformation.\nIf you fail to grasp this song’s earnest words,\nPonder each line carefully to dispel confusion.\nDo not say learning alone suffices—only through hidden merit\nCan you begin to fathom my intent and secrets.\n\nTrue Fire’s alternate names:\nGreat Yang, Vast and Elusive,\nRed Stone, Red Basin,\nVermilion Bird, Vermilion Child,\nRed Lead, Fire Lead, True Fire, Red Quartz.\n\nThe Eastern Song says:\nIn the East there is a Wood, originally named Sand,\nMale or female, it is also a sprout.\nReceiving qi at Wu, it must stand at Zi,\nNurturing essence, fostering substance, growing in Metal’s house.\nSince its growth over many years and months,\nEach dawn it faces the ends of the earth.\nDo not scorn its blackened, wrinkled form—\nIts entire body is the sun’s radiant essence.\nIf by chance it meets a child of yin’s house,\nWithout need of a matchmaker, they pledge themselves.\nWelcomed into the treasure chamber of the Central Palace,\nYin and yang’s qi unite, their hearts in accord.\nFor this purpose, the womb is remade,\nKan and Li move through the Eight Trigrams.\nAfter ten months’ gestation, mother and child part—\nThen you shall know the soaring phoenix and simurgh’s chariot.\n\nTrue Wood’s alternate names:\nGreen Dragon, Malachite,\nWood Essence, Fire Essence,\nMysterious Maiden, Golden Liquid,\nOld Woman, Flowing Mercury,\nFlowing Pearl, Bright Vessel,\nGolden Fluid, Red Marrow,\nLi’s Maiden, Female Gold,\nKun’s Essence.\n\nThe Central Song says:\nThe Central Palace’s Wu and Ji belong to the Black Tortoise,\nIts body aligned with emptiness and the Dao’s neighbor.\nPurely embracing primordial harmony and refined qi,\nThrough ten thousand refinements, the body is wholly perfected.\nWood is its wife, Fire its child, Water its ghost,\nWater and Earth restrain it, preventing its rise.\nYet it causes the birth of Western Metal,\nPassing on its strength and essence in succession.\nThough my form lacks a fixed shape,\nMy will and affairs depend on the Four Symbols’ life.\nWithout the Four Symbols’ connection to my qi,\nHow could Water, Metal, Wood, and Fire take form?\nIntimately familiar with Metal and Wood’s bonds,\nIt remains to nurture them tenderly in the womb.\nWhen the two substances harmonize and their qi merges,\nOne must rely on Bing Fire to refine and compress.\nBing Fire is originally my life,\nIts seasons and cycles arranged by the law’s decree.\nNaturally aligning with heaven and humanity’s workings,\nWho has seen the immortals’ true path?\n\nTrue Earth’s alternate names:\nYellow Earth, True Earth,\nPurple Earth, Chrysanthemum Flower,\nGreat Simplicity, True Yellow Sprout,\nTrue Dragon and Tiger, Dual Qi Spirit Sand,\nGreat Return Elixir.\n\nOn the First Production of the Yellow Sprout from the Two Qi:\nThe Yellow Sprout arises when Qian and Kun unite in resonance,\nCreation shapes its form.\nYin embraces yang’s soul,\nYang embraces yin’s spirit.\nYang’s numen shines with blood’s radiant clarity,\nYin’s truth gleams with jade’s luminous glow.\nSeizing the moon, its pure light bursts forth,\nContending with the sun, red clouds scatter in chaos.\nIts golden body heals all ailments,\nIts skin grows on the yang’s position,\nSecretly sharing yin’s essence.\nIt acts as matchmaker for the Five Metals,\nGoverning all stones as their master.\nThose who understand it swiftly ascend to the celestial realms,\nThose who remain ignorant dwell long in the dust.\nIn daily use, none recognize it,\nWandering blindly until their hair turns white.\n\nSong says:\nQian and Kun’s resonance begins the form,\nCreation’s origin lies in the Northern Gate’s completion.\nSun and moon revolve, souls and spirits unite,\nYin and yang mate, congealing as essence.\nClearly, a single qi grows from Metal,\nRecognize the Yellow Sprout born from Water.\nCountless are the fools in the world of dust,\nWho use it daily yet know not its name.",
      "overlap_context": " treasure of pearls; those who obtain a copy may cherish it as a rare jewel. Should one follow its precepts and formulas, one will surely attain transcendence beyond the mundane. But if one practices according to personal whim, one will surely squander wealth and exhaust one’s estate. Do not show this to the unworthy; reckless disclosure invites heavenly retribution.\n\nComposed in the first month of the first full moon of the twenty-fifth year of Guangzheng, the renxu year.\n\nA northern song says:",
      "start_char": 926,
      "end_char": 2195,
      "start_sentence": 38,
      "end_sentence": 89,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.50709009170532,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大还丹照鉴.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "识铅汞第二 夫修大药，先明铅汞之真元； 合炼成丹，须达坎离之正理。 铅包阴髓，是为虎而坎方； 汞产阳精，故称龙而离位。 坎月离日，会来往之梯媒； 离女坎男，应返还之纲纪。 铅受辛育，故大还丹照鉴被褐而怀金； 汞察甲胎，自着诽而含木。 铅非世锡，汞岂凡银？ 铅是天地之根基，汞是阴阳之灵气。 铅含曰魄，汞饮月魂，铅是真铅，汞非常汞。 抽五行之筋髓，相结成金； 合两象之精华，变凝成液。 日亏月满，魄沉而自丧； 阳魂月缺，日。 盈魂消，而却终阴魄。 阴阳感合，配成龙虎之夫妻； 水火返交，断出乾坤之丹药。 阳能制魄，运行而自作金； 形阴以拔阳，返转而始为神质。 阴阳满足，待成出世之丹砂； 水火数终，便是腾霞之流液。 红霜鼎上，忽赫赫之朝霞； 素粉炉中，夺荧荧之瑞雪。 澄澄血彩，晓日吐於扶桑； 湛湛水辉，秋月浸於寒渚。 青峰迅鹤，孤楼桂树之花； 芳霄汉横，霓迥族芙蓉之翠艳。 捣研之际，散芬馥之馨香； 九捻之时，流光辉之微动。 变炼成宝，服食回颜，刀圭而顿得冲虚，羽化而翱翔天地。 广成子口诀第三 世上忙忙没了程，百年如梦瞥然荣，不知道有云衢客，刚自争超尘裹名。 若欲留年从太一，须吞灵药便长生，纯烧天地阴阳髓，炼取乾坤日月精。 传付二味 要伏离宫亦等闲，搜求坎户取精研，但比夫妇成交感，孕出黄芽见本源。 若不亲传师指受，此外徒劳虚费钱，火候仍修终九九，丹成直待是三年。 杨真人口诀第四 淮王炼秋石，黄帝美金花，世人不悟莫咨嗟，神仙之药遍中华。 不用铅不用砂，迷愚之者亦如麻，修取铅炼取砂，顷刻之问见黄芽。 得黄芽，莫馒夸，将此黄芽配女家，夫妻和合岁月赊，身披紫服驾云霞，验之刀圭是河车。 再歌 阴中有阳，阳中有阴，既识砂中汞，须求铅裹金。 二味实天地之大宝，日月之至精，炼得此者，下鬼不欺。 梁丘子口诀第五 水中铅，火裹铅，水火二铅同一原，不知咫尺是神仙，敬将朱砂酒醋煎，千千万万化为烟。 假如伏火只成顽，欲得人问作地仙，炼取五行四象全，阴功济世真上天。 彭真君口诀第六 阴阳造化不须传，只用水银是黑铅，不伤汞不伤铅，此物道中玄复玄。 世人识得真龙虎，成道只在片时问。 程先生口诀第七 白虎者，是铅中之精华，青龙者，是砂中之元气，精气交媾而变黄芽，铅得汞而相亲，从无而入有； 汞得铅而轮体，从有而入无。 二气相生，得归真一，变转四象，不失五行，内外坎离，阴阳出没，精研戊己，秀光迫然，聚为碧峰，散还紫府。 金水相配，数立卦爻，天地开而混沌交，日月合而三才足。 鼎器非异，胎息难分，心在腹而千智生，药居鼎而万种化。 屯从子数，蒙至午修，炉上霞飞，辉光夺日，饵之延寿，寒暑不侵，点化五金，永为世宝。 罗浮先生口诀第八 世上喧喧车马人，红颜绿鬓不长春，药术相传万甲子，学者茫茫寻不真。 寻不真，莫生慎，盖为黄芽不得真。 铅是铅，汞是汞，世上之人总错用。 草黄芽，木黄芽，世上闻说也乱夸，自古口传不形纸，烧者徒劳尽破家。 堪分付，递相传，固济元来此道门，妄传非人遭殃祸。 父子庞疏不合言，黑服硫黄烧不烟，饵之中寿几千年，更加金室乾坤内，脱世浮空得飞仙。",
      "translated_text": "**Discerning Lead and Mercury (Chapter Two)**\n\nTo refine the Great Elixir, first clarify the true origin of lead and mercury;\nTo conjoin and smelt the cinnabar, one must grasp the proper principle of Kan and Li.\nLead enfolds the marrow of yin—this is the Tiger, the Kan direction;\nMercury engenders the essence of yang—thus called the Dragon, the Li position.\nKan’s moon and Li’s sun serve as the ladder and mediator for their meeting;\nLi’s maiden and Kan’s youth respond to the guiding principle of return and restoration.\nLead, nurtured by the pungent (辛), enables the Great Return Elixir to illumine even the coarse-clad who yet harbor gold within;\nMercury, gestating in the wood (甲), naturally dons its hue while containing the essence of wood.\nIs lead mere worldly tin? Is mercury common silver?\nLead is the root and foundation of Heaven and Earth; mercury is the numinous qi of yin and yang.\nLead contains the solar essence (魄), mercury drinks the lunar spirit (魂).\nLead is true lead; mercury is no ordinary mercury.\nExtracting the marrow of the Five Phases, they coalesce into gold;\nUniting the essence of the Two Images, they transform and congeal into liquid.\nAs the sun wanes and the moon waxes, the essence (魄) sinks and perishes;\nAs the yang spirit (魂) wanes and the moon’s fullness recedes, the yin essence (魄) ultimately dissipates.\nYin and yang unite in resonance, forming the Dragon and Tiger as husband and wife;\nWater and fire reverse their intercourse, forging the Elixir of Qian and Kun.\nYang can restrain the essence (魄), circulating to spontaneously become gold;\nYin in form draws forth yang, revolving to begin as divine substance.\nWhen yin and yang reach fulfillment, await the cinnabar that transcends the world;\nWhen the cycles of water and fire conclude, behold the flowing liquid that ascends in rosy clouds.\nUpon the crimson frost of the crucible, suddenly blazes the radiance of dawn’s glow;\nWithin the alabaster powder of the furnace, dazzles the luminous brilliance of auspicious snow.\nLimpid as blood-red hues, the morning sun spills from Fusang;\nSerene as water’s gleam, the autumn moon bathes the cold isle.\nSwift as the crane of emerald peaks, solitary as the osmanthus of the jade tower’s bloom;\nFragrant as the Milky Way’s traverse, resplendent as the lotus’s verdant splendor in the distant sky.\nAt the moment of grinding, it scatters a fragrance of rich perfume;\nAt the ninth twist, its subtle radiance begins to shimmer.\nRefined into treasure, ingested to restore youth,\nA mere grain transforms one to soar in emptiness, feathered and roaming Heaven and Earth.\n\n**Oral Instructions of Master Guangcheng (Chapter Three)**\n\nThe world bustles in vain, its course unending,\nA hundred years pass like a fleeting dream’s glory.\nUnknowing of the cloud-lane’s traveler,\nThey strive only to vie for fame in the dust.\nIf you wish to preserve your years, follow the Great One,\nSwallow the numinous medicine to attain longevity.\nPurely refine the marrow of Heaven and Earth’s yin and yang,\nSmelt the essence of Qian and Kun’s sun and moon.\n\n**Transmitting the Two Flavors**\n\nTo subdue the Li Palace is effortless,\nSeek and refine the essence from the Kan Gate.\nOnly when husband and wife unite in resonance\nWill the Yellow Sprout be conceived, revealing its origin.\nWithout direct transmission from a master’s guidance,\nAll else is futile labor, wasted coin.\nThe fire-tending must persist through nine nines,\nThe Elixir’s completion awaits three years.\n\n**Oral Instructions of Master Yang the Perfected (Chapter Four)**\n\nThe King of Huai refined autumn stone,\nThe Yellow Emperor prized golden flowers.\nLet not the world’s people sigh in ignorance—\nThe immortals’ medicine pervades the Middle Kingdom.\nNo need for lead, no need for cinnabar,\nYet the deluded are as numerous as hemp.\nRefine lead, smelt cinnabar,\nAnd in an instant, the Yellow Sprout appears.\nOnce you obtain the Yellow Sprout, boast not,\nMatch this Yellow Sprout with the maiden’s house.\nHusband and wife harmonize over years,\nClad in purple robes, riding clouds and rosy mists.\nTest it with the grain—it is the River Chariot.\n\n**Another Song**\n\nWithin yin lies yang, within yang lies yin.\nHaving recognized mercury within cinnabar,\nOne must seek gold within lead.\nThese two flavors are Heaven and Earth’s great treasure,\nThe utmost essence of sun and moon.\nWhoever refines this shall not be deceived by lesser spirits.\n\n**Oral Instructions of Master Liangqiu (Chapter Five)**\n\nLead in water, lead in fire—\nThe two leads of water and fire share a single origin.\nUnknowing that the immortal lies within a foot’s reach,\nOne reverently simmers cinnabar in wine and vinegar,\nOnly for thousands upon thousands to vanish as smoke.\nIf, when subduing fire, it merely hardens,\nAnd you wish to become an earthbound immortal,\nRefine the Five Phases and complete the Four Images,\nCultivate virtue to aid the world, and truly ascend to Heaven.\n\n**Oral Instructions of Perfected Lord Peng (Chapter Six)**\n\nThe creation of yin and yang needs no transmission—\nUse only mercury as black lead.\nNeither harming mercury nor lead,\nThis substance in the Dao is profound beyond profundity.\nIf the world recognizes the true Dragon and Tiger,\nAttaining the Way lies but a moment away.\n\n**Oral Instructions of Master Cheng (Chapter Seven)**\n\nThe White Tiger is the essence within lead;\nThe Green Dragon is the primordial qi within cinnabar.\nEssence and qi unite to transform into the Yellow Sprout.\nLead, receiving mercury, becomes intimate,\nPassing from nonbeing into being;\nMercury, receiving lead, transmutes its form,\nPassing from being into nonbeing.\nThe two qi generate one another,\nReturning to the True One.\nTransforming the Four Images without losing the Five Phases,\nInternally and externally, Kan and Li,\nYin and yang emerge and submerge.\nRefining wu and ji, their radiant brilliance shines forth,\nGathering into azure peaks,\nDispersing back to the Purple Palace.\nMetal and Water pair, numbers align with hexagrams,\nHeaven and Earth open to merge in primordial chaos,\nSun and moon conjoin to complete the Three Powers.\nThe crucible is no different,\nThe fetal breath indistinguishable.\nThe heart resides in the abdomen, giving rise to a thousand wisdoms;\nThe medicine dwells in the vessel, transmuting myriad forms.\nFrom *Zhun*’s inception at the zi hour,\nTo *Meng*’s cultivation at the wu hour,\nUpon the furnace, rosy clouds ascend,\nTheir radiance outshining the sun.\nIngesting it prolongs life,\nRendering one immune to cold and heat.\nTransmuting the Five Metals,\nIt becomes an eternal treasure for the world.\n\n**Oral Instructions of Master Luofu (Chapter Eight)**\n\nThe world clamors with carriages and horses,\nYouthful faces and raven locks do not endure.\nAlchemical arts have been transmitted for ten thousand ages,\nYet seekers wander in confusion, unable to find the truth.\nFinding no truth, harbor no regrets—\nIt is because the Yellow Sprout is not genuine.\nLead is lead, mercury is mercury,\nYet the world’s people all misuse them.\nHerbal Yellow Sprouts, wooden Yellow Sprouts,\nThe world hears of them and vainly boasts.\nSince ancient times, oral transmission leaves no trace on paper,\nThose who burn them labor in vain, ruining their households.\nWorthy of transmission, pass it on in succession,\nSecure the original gate of this Dao.\nFalsely transmitting to the unworthy invites calamity.\nFather and son, Pang and Shu, must not speak of it—\nBlack-robed sulfur that does not smoke,\nIngesting it grants a lifespan of several thousand years.\nFurther, within the golden chamber of Heaven and Earth,\nOne sheds the mortal world, floating in emptiness to become a flying immortal.",
      "overlap_context": "hose who remain ignorant dwell long in the dust.\nIn daily use, none recognize it,\nWandering blindly until their hair turns white.\n\nSong says:\nQian and Kun’s resonance begins the form,\nCreation’s origin lies in the Northern Gate’s completion.\nSun and moon revolve, souls and spirits unite,\nYin and yang mate, congealing as essence.\nClearly, a single qi grows from Metal,\nRecognize the Yellow Sprout born from Water.\nCountless are the fools in the world of dust,\nWho use it daily yet know not its name.",
      "start_char": 2196,
      "end_char": 3457,
      "start_sentence": 90,
      "end_sentence": 154,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.982853412628174,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大还丹照鉴.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "阴长生口诀第九 金作骨兮铅作身，阴阳定配龙虎亲，红颜二八三才合，八卦分张斗建寅。 从子午不须移，七十二候莫参差，姥女因媒归太一，紫微宫内生雄雌。 铅中宝砂中珍，此物含弘象五神，七月怀胎分六甲，终岁人转乃成真。 淮南法炼秋石，黄帝金花烧琥珀，白酒杯添九酝香，晶辉甘甜号龙液。 一人有一人无，三姓同家二子俱，狐兔非群不乳马，异类天然种性殊。 冥复冥玄复玄，此法非人不可传，世人不知世上药，知我还命不由天。 淳于叔通口诀第十 夫太阳之精，名曰青龙，青龙属木，木色乃青。 青中又返藏其火，火色赤，归南方则丹砂也。 木是火母，配居东方，所得青龙之号，非人问凡木矣！ 青龙即汞也，妮女也，经云：河上诧女，灵而最神，得火则飞，不染垢尘。 鬼隐龙匿，莫知所存，将欲制之，黄芽为根。 诀曰：黄芽即铅也，黑也，色禀北方，是太阴之精，好伏不动，善能制阳，阳性好飞，能被阴伏。 且砂属火，阳也，内怀奇灵； 铅属水，阴也，以性制灵，水能灭火，岂不明矣！ 论曰：木性能直而被金之所伤，水性能柔而被土之所克，土德虽厚而被木之所害，金性坚刚而被火之所镕，此五行之相克，大道之常义也。 故世人阴阳不晓，铅汞幽深，误用相和，而为丹药，服之则毒冲五脏，盖为未测浮沉。 如斯饵者之人，岂见善终夭寿？ 皆至少死，实可愍伤。 世人少其所识，多其所惑，而自误矣！ 玄黄子口诀第十一",
      "translated_text": "**Oral Instructions of Yin Changsheng, Ninth**\n\nGold forms the bones, lead forms the body,\nYin and Yang unite as Dragon and Tiger in kinship.\nAt sixteen, the Three Powers harmonize,\nThe Eight Trigrams spread wide as the Dipper points to *yin*.\n\nFrom *zi* to *wu*, no need to shift,\nThe seventy-two seasonal nodes must not err.\nThe old woman, through matchmaking, returns to the Great One,\nWithin the Purple Tenuity Palace, male and female arise.\n\nThe treasure within lead, the rarity within cinnabar,\nThis substance embraces the five spirits in its vastness.\nSeven months of gestation, divided by the six *jia*,\nA full year’s turning refines it into truth.\n\nThe Huainan method refines autumn stone,\nThe Yellow Emperor’s golden flower burns amber.\nA cup of white wine, infused with ninefold fragrance,\nIts crystalline radiance, sweet and pure, is called Dragon’s Nectar.\n\nOne may have it, another may not,\nThree families under one roof, yet two sons share it.\nFoxes and hares do not herd with horses to nurse,\nDifferent kinds by nature bear distinct essences.\n\nDarkness upon darkness, mystery upon mystery,\nThis method must not be passed to the unworthy.\nThe world knows not the medicine of the world,\nYet he who knows me returns life beyond Heaven’s decree.\n\n**Oral Instructions of Chunyu Shutong, Tenth**\n\nNow, the essence of the Great Yang\nIs called the Azure Dragon.\nThe Azure Dragon belongs to Wood,\nAnd Wood’s color is azure.\n\nWithin azure, fire is again concealed,\nFire’s color is red, returning to the south as cinnabar.\nWood is the mother of Fire, paired in the east,\nThus earning the name Azure Dragon—\nNot the common wood of mortal inquiry!\n\nThe Azure Dragon is mercury, the maiden.\nThe scripture says: *\"The maid by the river, numinous and most divine,\nWhen fire is applied, she takes flight, unstained by dust or filth.\nGhosts hide, dragons vanish—none know where she dwells.\nTo master her, the Yellow Sprout is the root.\"*\n\nThe instruction states: The Yellow Sprout is lead, black,\nIts color drawn from the north, the essence of the Great Yin.\nIt delights in stillness, excelling at restraining Yang.\nYang’s nature loves to fly, yet can be subdued by Yin.\n\nMoreover, cinnabar belongs to Fire, Yang,\nHarboring wondrous spirit within.\nLead belongs to Water, Yin,\nIts nature restrains spirit—\nWater extinguishes Fire, is this not clear?\n\nThe discourse says: Wood’s nature is upright, yet harmed by Metal;\nWater’s nature is yielding, yet overcome by Earth.\nEarth’s virtue is deep, yet harmed by Wood;\nMetal’s nature is firm, yet melted by Fire.\nThis is the mutual conquest of the Five Phases,\nThe eternal principle of the Great Dao.\n\nThus, when people fail to grasp Yin and Yang,\nThe depths of lead and mercury remain obscure.\nMistaking their harmony for elixir,\nThey ingest it, and poison surges through the five viscera—\nFor they have not fathomed the floating and sinking.\n\nThose who consume such things,\nHow can they meet a good end or long life?\nMost die young—truly pitiable.\nThe world lacks discernment, drowning in confusion,\nAnd thus brings ruin upon itself!\n\n**Oral Instructions of Xuanhuangzi, Eleventh**",
      "overlap_context": "e on paper,\nThose who burn them labor in vain, ruining their households.\nWorthy of transmission, pass it on in succession,\nSecure the original gate of this Dao.\nFalsely transmitting to the unworthy invites calamity.\nFather and son, Pang and Shu, must not speak of it—\nBlack-robed sulfur that does not smoke,\nIngesting it grants a lifespan of several thousand years.\nFurther, within the golden chamber of Heaven and Earth,\nOne sheds the mortal world, floating in emptiness to become a flying immortal.",
      "start_char": 3458,
      "end_char": 4019,
      "start_sentence": 155,
      "end_sentence": 176,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.67465591430664,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大还丹照鉴.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "求仙觅黄芽，须得真铅花，并是自成者，乃可作金砂。 重飞服一粒，腾空入碧霞，周游天地外，处处是仙家。 尹喜真人口诀第十二 至药须用铅j 杯向黑中聚，若欲识黄芽，先应问阴土。 真铅配坎男，戊己来相顾，只此号黄矾，便是还丹祖。 陶植真人口诀第十三 真汞非水银，还向此中得，若要真水银，须求坎裹力。 又诀曰舛一中有一真为阳，是水之子，属在西方。 玄光先生口诀第十四 夫养生之术，非难亦非易，世人也用铅，不得修铅志。 才与脱黑衫，便即露素质，灰池炎火上，刀圭依法律。 铅百还同此，抽时莫教失，持入赤色门，点时坚如石○ 药用真水精，八数为第一，妙精亦八两，阳人身上出。 两般相合和，饭山须秘密，凡曲乌龙上，数满经一两真龙脑，还要肥苏腻，白色真龙脑，苍色亦不是。 用在临时，二物合为体，大还丹照鉴别有方法制，取须使真金器。 世人会此语，地仙只这是，若将非处用，映祸一肩立至。 十年暗障日，五载不见明，若点一粟粒，须臾即抵圣。 歌曰，《 参同》 、《 金碧》 尽藏情，赖有阴君序节明，学人更遇清霞诀，龙虎从兹识本形。 天生元气本虚无，红颜长者体如酥，火裹变身还火裹，仙人得意号玄珠O 世人识柔不识刚，便道黄芽色带黄，学来若到杯铅境，始信黄芽色不黄。 尔朱翱真人口诀第十五 置天立地混沌分，造化含花处处焚，一阴一阳乃成道，秋石苍苍浪子孙。 玄武朱雀明前路，涌泉真汞守乾坤，鼎鼎制铅成宝物，姥女藏头不肯出。 十二葫中紫河车，四十二气烈仙窟。 颜如玉貌如霜，，枣叶雄朱修修毕，手搏日月入炉中，炎炎赫赫魂不失。 非济凡问饥冻疾，不如学道急须出。 水煮冥冥白虎身，兽炉上下两莫测，大象不游於兔穴，大悟不拘於小节。 迷者心差皆总失，非传下界盲瞽人，灭族亡身不可出。 六评六讶，尔翱己去往蓬莱，白日霞仙今古密。 鹤叫前程洞庭湖，礼我圣祖为留术。 去元声甘如蜜，一七二七七万毕，开炉忽见火一团，光彩炎炎赫赫奕，虽济凡问饥冻疾，不如访道栖金室。 冲虚子口诀第十六 叹羡巨江月影沈，金之主起见铅心，须当努力求仙诀，莫使蹉跎岁月深。 又歌曰 九炼铅精大道成，我家何虑不长生，朝寻弄玉过仙府，暮谒麻姑入太清？ 神照本来自灵气，汉武荣知有俗情，万事只今空寂寞，一生飘荡落浮名。 董大仙口诀第十七 日魂月魄无形状，采得天然太新样，契合神仙实难论，云霄起在黄芽上。 龙腾虎状变金田，始末须得出世铅，为家为屋自然居，配俪之时顷刻问。 认得离胎争欲言，不在文书口诀传。 元阳子口诀第十八 《 还丹篇》 、《 还丹篇》 ，欲得黄芽先炬铅，阳壬不去火中走，阴丙如何得作？ 鸡抱卵兮日数足，母生子兮十月，但得坤来为屋宅，坤至何愁不作？ 伏吾此法在目前，违吾此法饶万。 八石须向火中走，莫弄水饱费君，还丹不是世难学，自是时人志不。 若明魏君讶十首，千回海水变桑。 罗公远真人口诀第十九 世人不知丹有神，试吃狼毒必害人，将知世上有善恶，何不将身近善邻。 女娲炼得五常气，变化成形补天地，三十六筹世问知，七十二石列具位。 天得一而能长，地得一而方久，金得火而转精，木成炭而不朽。",
      "translated_text": "Seek immortality and the Yellow Sprout,\nYet first obtain the True Lead’s Flower—\nOnly that which forms of itself\nMay be wrought into Golden Sand.\nRefine it once more, ingest a single grain,\nAnd soar through space into the azure clouds,\nRoaming beyond heaven and earth,\nWhere every place is home to immortals.\n\n**Oral Instructions of Master Yinxizhen, Twelfth**\n\nThe supreme medicine must employ lead,\nGathered in a cup toward the dark.\nIf you would know the Yellow Sprout,\nFirst inquire of the Yin Earth.\nTrue Lead matches the Kan Man,\nWith Wu and Ji attending—\nThis alone is called Yellow Alum,\nThe very ancestor of Returned Elixir.\n\n**Oral Instructions of Master Taozhizhen, Thirteenth**\n\nTrue Mercury is not quicksilver,\nYet from this it is obtained.\nIf you seek true quicksilver,\nFirst seek the power within Kan.\nAnother instruction says:\nWithin the errant, one true Yang resides,\nThe child of Water, belonging to the West.\n\n**Oral Instructions of Master Xuanguang, Fourteenth**\n\nThe art of nurturing life\nIs neither difficult nor easy.\nThe world uses lead,\nYet fails to cultivate the will of lead.\nScarcely has it shed its black robe\nWhen its pure essence is revealed.\nUpon the ash pool’s blazing fire,\nThe knife’s edge follows the law.\nLead’s hundredfold return is the same—\nWhen drawn, take care not to lose it.\nHold it through the Crimson Gate,\nAnd at the touch, it hardens like stone.\nThe medicine employs True Water Essence,\nEight as the foremost number.\nWondrous essence, too, is eight ounces,\nIssuing from the Yang person’s body.\nWhen the two blend in harmony,\nThe Rice Mountain must be kept secret.\nUpon the Black Dragon’s curve,\nWhen the count reaches one ounce of True Dragon Brain,\nIt must be rich and unctuous.\nWhite is the True Dragon Brain,\nGray is not.\nUsed at the appointed time,\nThe two substances unite as one.\nThe Great Returned Elixir’s reflection\nRequires discernment in its preparation—\nTake care to use a vessel of true gold.\nShould one grasp these words,\nEarthly immortality is but this.\nIf misapplied,\nCalamity will descend in an instant.\nTen years of obscured sunlight,\nFive years without seeing light—\nYet if a single grain is transmuted,\nIn an instant, one attains sagehood.\n\n**Song:**\n*The Cantong Qi* and *Jinbi* conceal their secrets,\nYet the Yin Lord’s preface clarifies the steps.\nShould the adept encounter the Pure Clouds’ instructions,\nFrom this, Dragon and Tiger recognize their true form.\n\nHeaven’s primordial qi arises from emptiness,\nThe rosy-cheeked elder’s body like suet.\nWithin fire, the body transforms—still within fire,\nThe immortal, content, is called the Mystic Pearl.\n\nThe world knows softness but not hardness,\nClaiming the Yellow Sprout bears a yellow hue.\nOnly when one reaches the realm of Cup and Lead\nDo they realize the Yellow Sprout is not yellow.\n\n**Oral Instructions of Master Erzhu Ao, Fifteenth**\n\nHeaven set, earth established, the primordial chaos divided,\nCreation’s blossoms burn everywhere.\nOne Yin, one Yang—thus the Dao is formed,\nAutumn Stone, pale, begets descendants.\nXuanwu and Zhuque illuminate the path ahead,\nThe True Mercury of Yongquan guards the cosmos.\nIn the crucible, lead is refined into treasure,\nThe Old Woman hides her head and refuses to emerge.\nWithin the twelve gourds, the Purple River Cart,\nThe forty-two breaths blaze in the immortal’s cave.\nComplexion like jade, visage like frost,\nThe date leaf’s crimson, polished to perfection.\nSeizing sun and moon, they enter the furnace,\nFlaming, radiant—yet the soul remains unlost.\nIf not to relieve the world’s hunger, cold, and sickness,\nBetter to hasten and depart to study the Dao.\n\nBoil the White Tiger’s form in dark waters,\nThe Beast’s furnace, above and below, unfathomable.\nThe Great Image does not wander in the rabbit’s burrow,\nGreat awakening is not bound by petty details.\nThe deluded, their hearts astray, all lose the way—\nNot passed down to the blind of the lower realm,\nLest they bring ruin to clan and self.\n\nSix praises, six laments—\nErzhu Ao has departed for Penglai,\nAscending as an immortal in broad daylight, an ancient secret.\nThe crane calls ahead at Dongting Lake,\nI pay homage to my sacred ancestor, who preserved the art.\nDeparting, the primal sound sweet as honey,\nOne seven, two sevens, seventy thousand complete.\nOpening the furnace, suddenly a ball of fire appears,\nRadiant, blazing, resplendent.\nThough not to relieve the world’s hunger, cold, and sickness,\nBetter to seek the Dao and dwell in the Golden Chamber.\n\n**Oral Instructions of Master Chongxu, Sixteenth**\n\nI sigh in envy of the mighty river’s moonlit shadow,\nThe lord of gold arises, revealing the heart of lead.\nOne must strive to seek the immortal’s formula,\nLest the years and months slip by in vain.\n\n**Another Song:**\nNinefold refinement of lead’s essence completes the Great Dao,\nWhy should my family fear not attaining long life?\nAt dawn, I seek Nongyu to pass through the immortal’s palace,\nAt dusk, I visit Magu to enter the Great Clarity.\nThe divine illumination originally stems from the numinous qi,\nYet Emperor Wu of Han knew only worldly passions.\nAll things now are but emptiness and silence,\nA lifetime adrift, leaving only a floating name.\n\n**Oral Instructions of Master Dong the Immortal, Seventeenth**\n\nThe sun’s soul and moon’s spirit, formless,\nGathered in their natural, pristine state.\nTheir union with immortals is truly beyond discourse,\nRising to the clouds above the Yellow Sprout.\nDragon soars, Tiger leaps—transforming the Golden Field,\nFrom beginning to end, one must obtain the lead of transcendence.\nTo build a home, to dwell naturally,\nAt the moment of pairing, it is instantly known.\nRecognizing the parting from the womb, one longs to speak,\nYet it lies not in written texts or oral instructions.\n\n**Oral Instructions of Master Yuanyang, Eighteenth**\n\n*The Returned Elixir Chapter*, *The Returned Elixir Chapter*—\nTo obtain the Yellow Sprout, first ignite the lead.\nYang Ren does not flee in fire,\nHow can Yin Bing be wrought?\nThe hen incubates the egg until the days are complete,\nThe mother bears the child after ten months.\nIf only Kun comes to serve as dwelling,\nWhy fear Kun will not act?\nMy method lies before your eyes—\nDefy it, and you’ll wander for ten thousand kalpas.\nThe Eight Stones must flee in fire,\nDo not play with water and waste your efforts.\nThe Returned Elixir is not difficult for the world to learn,\nIt is only that people of this age lack the will.\nShould you understand Master Wei’s ten laments,\nA thousand turns of seawater will transform into mulberry fields.\n\n**Oral Instructions of Master Luo Gongyuan, Nineteenth**\n\nThe world does not know the elixir possesses spirit,\nYet if one tests wolfsbane, it will surely harm.\nKnowing the world holds both good and evil,\nWhy not draw near to good neighbors?\nNüwa refined the Five Constants’ qi,\nTransforming and shaping it to mend heaven and earth.\nThirty-six strategies the world knows,\nSeventy-two stones arrayed in their places.\nHeaven attains the One and thus endures,\nEarth attains the One and thus abides.\nMetal, refined by fire, becomes essence,\nWood, turned to charcoal, does not decay.",
      "overlap_context": "of the Great Dao.\n\nThus, when people fail to grasp Yin and Yang,\nThe depths of lead and mercury remain obscure.\nMistaking their harmony for elixir,\nThey ingest it, and poison surges through the five viscera—\nFor they have not fathomed the floating and sinking.\n\nThose who consume such things,\nHow can they meet a good end or long life?\nMost die young—truly pitiable.\nThe world lacks discernment, drowning in confusion,\nAnd thus brings ruin upon itself!\n\n**Oral Instructions of Xuanhuangzi, Eleventh**",
      "start_char": 4019,
      "end_char": 5293,
      "start_sentence": 177,
      "end_sentence": 224,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.59922766685486,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大还丹照鉴.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "故知唯炼唯精，大还如何不有？ 凝我神定我心，志精可以成黄金，河车本向铅中取，姥女还须汞裹寻。 傍思之物馒周彰，太一出水入公量，淮南调鼎彭祖山市变牢性记去香盐密尝，得道同归不死乡。 文一武莫疏失，釜下唯铺绿海，炉中少用搏桑日。 赫奕鱼鳞透目光，须同魏伯云中莫学姐娥月裹藏。 邓都落名天府地下阴官大怖畏，兵刃水火不能，何但虫蛇兼虎兕。 亭亭金骨皆坚，郁郁绿身褊绿毛，曾观东海几回，数度曾偷王母桃，驱策雷公使神鬼千年少别辽东水。 固济精研须缄紫烟碧焰喷人。 乘龙驾鹤倾城，七日应归维氏道是易亦大难，青龙白虎自相盘，阴车湿阳车乾，夫妻相对卦中安，四方末住沾颜色，五个王侯尽罢官。 抱朴子口诀第二十 朱砂水银入华池，收得黄芽人不知，本是仙人留口诀，世上喧喧乱言说。 七十年中付一人，分付还须有仙骨，一一事须手眼传，采取只在片时问。 河车覆在丹田裹，制伏只在黄芽边。 质毂子口诀第二十－ 铅若是真，不失家臣，铅若不真，其汞难亲。 杨玄－口诀第二十二 世上人人尽好药，个个元来寻不着，也道用铅不用铅，及至用铅还是错。 用铅不用铅，不用得长年，用铅须用铅，用铅住丹田。 无铅不成丹，还丹生在铅。 金公能住水。 黑铅有黄芽，黄芽入汞家，覆载以河车。 歌曰 铅向铅中出，铅同色不同，若能分皂白，日日是仙翁。 僧若讷口诀第二十三 黄芽砂汞造，阴壳含阳花，不得黄芽理，还丹应路赊。 世人炼至药，尽认铅黄花，黄花是死物，那得到仙家。 黄芽非外药，内象取精华，若到黄芽地，金银徒尔夸。 歌曰 芽若是铅，去铅万里，芽若非铅，从铅而始。 铅为芽母，芽为铅子，既得金花，舍铅不使。 张华真人歌铅汞第二十四 赤龙化为粉，白虎利如霜，其中投石液，还要帝流浆。 调神清五脏，欲得炼三光，专守坚冰性，如何阴使阳。 二味口诀 虎伏龙亦藏，龙潜先伏虎，但毕河车功，不用堤防虑。 黄老学飞仙，狂迷不得路，回首指牝鹦，不测阴阳数。 却坐太一宫，参商方始遇，左右得近神，四相皆扶护。 乾坤法象成，自有仙人顾。 剑州张司马口诀第二十五 九九之中乾体开，华池金液自徘徊，阴阳鼎上先光彩，铅花炉裹考三才。 即知造化由人手，术正药真神自来，到此修时应出世，四时不用苦相催。 评曰 其色光辉耀日月，无穷改变不思议，但住铅砂成宝后，歇头一任丙丁吹。 函谷关老君铅汞歌第二十六 红铅黑铅大丹头，红铅黑铅体同，黑金取精赤取髓，解用赤黑药无用赤入黑保长生，用黑入赤天仙大还丹照鉴矣。 颠倒两法总称铅，黑能变化赤天仙。 至道之人莫容易，贪财好色不须传，函谷关头梁石山，老君镌石留此言。 岑真人口诀第二十七 天生太素，地产灵津，能伏能飞，变化如神。 阴阳宗祖，道契君臣，圣人秘宝，非者不闻。 且太素为君，灵津为臣，合和两性，呼吸相吞。 为夫为妇，男女姻亲，变化钩牵，恩爱传真。 歌曰 东方青龙，丙丁甲乙，西方白虎，壬癸凝液。 二气含真，世人难觅，机持此宝，一水一石。 灰池焰烁，名除死籍。 传付心诀再歌 水神投金碧，乾坤日月精，坎离为既济，三才显其名。 阳数居阴杀，阴数归阳刑，欲知颠倒术，相克是相生。",
      "translated_text": "Thus know: only through refinement and essence,\nHow could the Great Return not be attained?\nCondense my spirit, settle my heart,\nWith focused intent, one may transmute to gold.\nThe River Chariot is drawn from lead,\nThe Crone’s Daughter must be sought within mercury.\n\nAdjunct substances circulate widely,\nThe Great One emerges from water into the public measure.\nHuainan stirred the cauldron, Pengzu’s mountain market altered the nature of sacrificial beasts,\nRecords of departed fragrance and secret-tasted salt.\nAttaining the Dao, they converge in the land of no death.\n\nCivil and martial arts must not be neglected,\nBeneath the crucible, only spread the green sea,\nWithin the furnace, use less of the mulberry’s sun.\n\nResplendent as fish scales piercing the eye’s light,\nOne must follow Wei Bo in the clouds,\nNot learn from Chang’e’s concealment in the moon.\n\nDengdu’s name falls to the celestial treasury, the earthly underworld’s yin officials greatly fear,\nBlades, water, and fire cannot harm,\nHow much less insects, snakes, tigers, and rhinos?\nTowering, the golden bones all harden,\nLush, the green body with its verdant fur.\nOnce observed the Eastern Sea’s many turns,\nSeveral times stolen the Queen Mother’s peaches,\nCommanding the Thunder Duke, dispatching spirits and ghosts,\nA thousand years but a brief parting from Liaodong’s waters.\n\nFirmly seal and refine, must bind with purple smoke and jade-green flames that spout upon men.\n\nRiding dragons, mounting cranes, captivating cities,\nIn seven days, one should return to the Way of the Viscount of Wei.\nThis is easy yet profoundly difficult.\nGreen Dragon and White Tiger coil of themselves,\nThe yin chariot is damp, the yang chariot dry.\nHusband and wife face each other, settled within the hexagram,\nThe four directions’ ends stain with color,\nFive kings and marquises all resign their offices.\n\n**Oral Instructions of Master Baopuzi, Twentieth**\n\nCinnabar and mercury enter the Flowery Pool,\nThe Yellow Sprout is gathered, yet none know.\nThis is the oral instruction left by immortals,\nThe world clamors with confused words.\nFor seventy years, entrusted to one person,\nBestowed only upon those with immortal bones.\nEach matter must be transmitted hand to eye,\nGathering occurs in but a moment’s time.\nThe River Chariot rests within the Cinnabar Field,\nSubdued only at the Yellow Sprout’s side.\n\n**Oral Instructions of Master Zhiguzi, Twenty-First**\n\nIf lead is true,\nIt does not lose its household minister.\nIf lead is not true,\nIts mercury will be hard to approach.\n\n**Oral Instructions of Master Yang Xuan, Twenty-Second**\n\nIn the world, everyone seeks the medicine,\nYet each originally fails to find it.\nSome say use lead, some say do not,\nBut when it comes to using lead, it is still wrong.\nUse lead, do not use lead,\nNot using it grants long years.\nUse lead, must use lead,\nUsing lead, reside in the Cinnabar Field.\nWithout lead, the elixir does not form,\nThe Returned Elixir is born in lead.\nThe Metal Duke can restrain water.\nBlack lead contains the Yellow Sprout,\nThe Yellow Sprout enters mercury’s house,\nCovered and borne by the River Chariot.\n\n**Song:**\nLead emerges from within lead,\nLead of the same color yet not the same.\nIf one can distinguish black and white,\nEach day is a celestial elder.\n\n**Oral Instructions of Monk Ruonè, Twenty-Third**\n\nThe Yellow Sprout, cinnabar, and mercury concoct,\nThe yin husk contains the yang flower.\nWithout grasping the Yellow Sprout’s principle,\nThe Returned Elixir’s path remains distant.\nPeople of the world refine the medicine to its utmost,\nAll recognize lead’s yellow flower.\nThe yellow flower is a dead thing,\nHow can it reach the immortals’ realm?\nThe Yellow Sprout is not an external medicine,\nThe inner image extracts its essence.\nWhen reaching the Yellow Sprout’s ground,\nGold and silver are but vain boasts.\n\n**Song:**\nIf the sprout is lead,\nDepart from lead by ten thousand miles.\nIf the sprout is not lead,\nBegin from lead.\nLead is the sprout’s mother,\nThe sprout is lead’s child.\nHaving obtained the golden flower,\nAbandon lead and do not employ it.\n\n**Zhang Hua the Perfected’s Song of Lead and Mercury, Twenty-Fourth**\n\nThe Red Dragon transforms into powder,\nThe White Tiger sharp as frost.\nWithin, cast the stone’s liquid,\nStill requiring the Emperor’s Flowing Sauce.\nRegulate the spirit, purify the five viscera,\nDesiring to refine the Three Lights.\nFirmly guard the nature of solid ice,\nHow can yin employ yang?\n\n**Oral Instructions on the Two Flavors**\n\nThe tiger crouches, the dragon also hides,\nThe dragon first lurks, then subdues the tiger.\nSimply complete the River Chariot’s work,\nNo need for embankments or defensive concerns.\nThe Yellow Elder studied flying immortality,\nMadly deluded, unable to find the path.\nTurning back, he pointed to the female phoenix,\nUnfathomable are yin and yang’s numbers.\nYet sitting in the Great One’s palace,\nOnly then do Shen and Shang meet.\nLeft and right, drawing near the spirits,\nThe four phases all support and protect.\nHeaven and earth’s model is complete,\nNaturally, immortals will attend.\n\n**Oral Instructions of the Prefectural Judge of Jianzhou, Twenty-Fifth**\n\nWithin the nine nines, the Qian body opens,\nThe Flowery Pool’s golden liquid naturally lingers.\nUpon the yin-yang crucible, first appears radiance,\nWithin the lead-flower furnace, the Three Powers are tested.\nThen know creation lies in human hands,\nWith proper technique and true medicine, spirits come of themselves.\nAt this stage of cultivation, one should transcend the world,\nThe four seasons need not bitterly urge.\n\n**Critique:**\nIts color shines brilliantly, illuminating sun and moon,\nEndless transformations, beyond thought.\nBut once lead and cinnabar become treasure,\nCease the firing, freely let bing and ding blow.\n\n**Laozi’s Song of Lead and Mercury from Hangu Pass, Twenty-Sixth**\n\nRed lead, black lead, the Great Elixir’s head,\nRed lead, black lead, their bodies the same.\nBlack metal extracts essence, red extracts marrow,\nUnderstanding the use of red and black: medicine without red enters black to preserve long life,\nUsing black to enter red, celestial immortals achieve the Great Returned Elixir, its reflection clear.\nThe two inverted methods are both called lead,\nBlack can transform into red celestial immortals.\nThose of the utmost Dao must not be careless,\nGreed for wealth and lust for beauty need not be transmitted.\nAt the head of Hangu Pass, Liangshi Mountain,\nLaozi carved these words into stone.\n\n**Oral Instructions of Master Cen Zhenren, Twenty-Seventh**\n\nHeaven generates the Great Simplicity,\nEarth produces numinous essence.\nAble to subdue, able to fly,\nTransforming like spirits.\nYin and yang’s ancestral founder,\nThe Dao accords with ruler and minister.\nThe sage’s secret treasure,\nNot heard by the unworthy.\nMoreover, the Great Simplicity is the ruler,\nNuminous essence the minister.\nHarmonizing the two natures,\nInhaling and exhaling, they swallow each other.\nAs husband and wife,\nMale and female in marital kinship,\nTransforming, hooking, and pulling,\nLove transmits the truth.\n\n**Song:**\nEastern Green Dragon,\nBing, ding, jia, yi.\nWestern White Tiger,\nRen and gui congeal the liquid.\nThe two qi contain the true,\nHard for the world to find.\nGrasping this treasure,\nOne water, one stone.\nThe ash pool’s flames blaze,\nRemoving names from death’s register.\n\n**Transmitted Heart Instructions, Another Song**\n\nThe water spirit casts into golden jade,\nHeaven and earth’s sun and moon essence.\nKan and Li achieve completion,\nThe Three Powers display their names.\nYang numbers reside in yin’s execution,\nYin numbers return to yang’s punishment.\nDesiring to know the inverted technique,\nMutual overcoming is mutual generation.",
      "overlap_context": "know the elixir possesses spirit,\nYet if one tests wolfsbane, it will surely harm.\nKnowing the world holds both good and evil,\nWhy not draw near to good neighbors?\nNüwa refined the Five Constants’ qi,\nTransforming and shaping it to mend heaven and earth.\nThirty-six strategies the world knows,\nSeventy-two stones arrayed in their places.\nHeaven attains the One and thus endures,\nEarth attains the One and thus abides.\nMetal, refined by fire, becomes essence,\nWood, turned to charcoal, does not decay.",
      "start_char": 5293,
      "end_char": 6583,
      "start_sentence": 225,
      "end_sentence": 283,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.08295273780823,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大还丹照鉴.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "若修诸八石，千万无一成，欲觅真道者，壬癸上寻庚。 崔玄真岷山子口诀第二十八 岷山宝室九仙居，日月萦回洞底虚，为有真人常镇此，玉留盘结气长舒。 曾游海娇昆丘客，远控龙骈亦探迹，炼得华九转成，中有白银相报积。 月中玉兔坎中阳，外柔形容内有刚，二象雄雌同一体，还如金向水中藏。 金水相合是魂魄，三才变异诚难测，倏然龙虎两交并，化得龙儿在杳冥。 状似凝酥黄芽雪，亦如玄圃玉华结，本非世上起机心，元是真人留秘诀。 留秘诀不参差，晃山石室有丹砂，至道之人依此法，飞取青龙作一家。 季魂周天成气质，重与水银相固密，似子还婚小女儿，苏张下说情难失。 相传此物是黄芽，重重金鼎贮金华，制成雄黄偃药砂，六一缄封须秘密，莫教神室有纤瑕。 火候初从一阳起，乾坤两卦成终始，文经武纬启灵机，一法先王传秘旨。 蟾蛛天上尽还生，丹鼎开时见道情，每度恢奇别起象，璘编红紫状难名。 却取金合雄作匮，世光流尽赤龙飞，烧金学道岷山子，亲得真人受玄旨。 玄旨唯论汞与铅，修得黄芽身不死，炼丹炼志兼炼神，不营名利显清芬。 逃名远去尘埃外，栖托空闲契上。 莫学人寰嚣薄士，役役终身爱名，虽然有意慕桩年，未免将身在朝市。 窦真君七返砂歌第二十九 金公年六十，六十金公老，妮女年六十，六十姥女少。 金公年三十，姥女还渐少，老翁得少妻，枯杨自生筱。 夫妻同一处，成道和合了。 根本是黄芽，金公元一家，姥女入铅室，须臾地变荼。 覆月合仰月，仰月急须赊，固济重固济，固济似丹家。 丙丁张下诐，混沌自甜葩，七八阳数极，九六更须加。 四壳阳既满，五色似朝霞。 去阳除覆月，上上好黄芽，黄即黄金色，白即白马牙，变化成运载，故号曰河车。 玄明与滨伏，夫妇同一家，本是王阳术，黄帝美金花。 智者．能隐秘，愚者向人夸，若达此道者，鹤控白云涯。 汉祖天师口诀第三十 铅抽髓髓抽精，精髓相合丹必成，一斤水银十七两，一两变化是铅精。 将此铅精作大丹，老子九转入生研，一两水银特牛力，服之令人貌若仙。 貌若仙兮筋骨坚，筋骨坚强返枯槁，截舌人问不须道，未能隐显出没藏。 切须慎口莫颠狂，若教上界天神怒，恐遭非横及刀光。 果州谢自然口诀第三十－ 白女正当年十六，自夸弱质颜如玉，常嗟岁月无良媒，昼夜孤单唯独宿。 爷娘不审他心意，馒说张三并李四，几度为话总不成，教人羞天复愧地。 忽遇黄婆来扣门，说道金公体性温，遂将二命问君平，君平断言此好婚。 不偏不曲合乾坤，审此因绿甚宜良，至今子孙满帝乡。 昔时不因黄婆力，如何得契合阴阳。 曹真人口诀第三十二 捉取东青龙，配与西白虎，更将南朱雀，会偶北玄武。 四者穷其根，本来同宗祖。 世人不知探，众石多错侯，不解演阴阳，配合为夫妇。 阴阳气本双，始得俱相聚，就中最妙者，须得中央土。 泥炉不假法，运火心须苦，一日两卦候，进退依节度，细穷日月盈，莫遣失风雨。 十月还丹成，身除贫病苦，沧海与桑田，变时君始睹。 谁人得吾道，不得轻取与，容易泄天机，谪罚殃七祖。 太白山隐士韩蕴中口诀第三十三 夫大道弘远，阴阳难穷，造化发生，世人莫测。 妄谈虚而白首千万，耗财比延命，而驻颜返伤残而短寿。",
      "translated_text": "If one refines the various Eight Minerals,\nA thousand, ten thousand—none will succeed.\nThose who seek the true Dao\nMust seek *geng* upon *ren* and *gui*.\n\n**Cui Xuanzhen’s Minshanzi Oral Instructions, Twenty-Eighth**\n\nThe Minshan treasure-chamber, abode of the Nine Immortals,\nSun and moon coil within its hollow depths.\nFor true persons ever guard this place,\nJade remains coiled, *qi* endlessly at ease.\n\nOnce a traveler to Haijiao and Kunqiu,\nFar controlling dragon teams, he traced their tracks.\nRefining, he achieved the Ninefold Transformation of *hua*,\nWithin, white silver amassed in recompense.\n\nThe jade hare of the moon, the yang within *kan*,\nOutwardly yielding in form, inwardly firm.\nThe two images—male and female—share one body,\nJust as gold hides within water.\n\nGold and water unite as *hun* and *po*,\nThe Three Powers transform, truly unfathomable.\nSuddenly, dragon and tiger intertwine,\nGiving birth to the dragon-child in the unseen.\n\nIts form resembles congealed butter, the yellow sprout of snow,\nOr the jade blossoms of Xuanpu.\nNot born of worldly scheming,\nBut the secret instructions left by true persons.\n\nLeave no flaw in these secret instructions,\nFor in the crystal mountain’s stone chamber lies cinnabar.\nThose who attain the supreme Dao follow this method,\nAnd fly to take the Green Dragon as their kin.\n\n*Ji-hun* completes the celestial circuit, forming *qi*-substance,\nOnce more conjoined with mercury, firmly sealed.\nLike a son returning to wed the young maiden,\nOr Su Qin and Zhang Yi’s persuasions—love cannot be lost.\n\nThis thing passed down is the yellow sprout,\nLayer upon layer, the golden crucible holds golden blossoms.\nRefined into realgar, the reclining elixir-sand,\nSealed with the Six-One method, it must be kept secret.\nLet no flaw mar the divine chamber.\n\nThe fire-timing begins with the first yang,\n*Qian* and *kun* form its beginning and end.\nCivil warp and martial weft awaken the numinous mechanism,\nOne method—the secret decree of the former kings.\n\nHeavenly toads and spiders all revive,\nWhen the elixir crucible opens, the Dao’s nature is revealed.\nEach cycle brings wondrous transformations, new forms arise,\nTheir radiance—crimson, purple—defies description.\n\nThen take the golden vessel, use mercury as the repository,\nWhen the world’s light is exhausted, the Red Dragon flies.\nBurning gold, the Minshan adept learns the Dao,\nReceiving the true person’s mysterious decree.\n\nThe mysterious decree speaks only of mercury and lead,\nRefining the yellow sprout, the body does not die.\nRefine the elixir, refine the will, refine the spirit,\nDo not pursue fame or profit—manifest pure fragrance.\n\nFlee fame, withdraw beyond the dust,\nDwell in quietude, attune to the highest.\nDo not imitate the world’s clamorous, shallow men,\nWho toil their whole lives for renown.\nThough they yearn for long life,\nThey cannot escape the marketplace.\n\n**Dou Zhenjun’s \"Seven-Returned Sand\" Song, Twenty-Ninth**\n\nThe Metal Duke is sixty,\nAt sixty, the Metal Duke is old.\nThe Maiden is sixty,\nAt sixty, the young maiden is young.\n\nThe Metal Duke is thirty,\nThe Maiden grows ever younger.\nThe old man gains a young wife,\nThe withered willow sprouts fresh shoots.\n\nHusband and wife in one place,\nComplete the Dao in harmonious union.\n\nThe root is the yellow sprout,\nThe Metal Duke’s primal family.\nThe Maiden enters the lead chamber,\nIn an instant, the earth transforms to cinnabar.\n\nThe inverted moon joins the upright moon,\nThe upright moon must be swiftly secured.\nSeal firmly, seal again,\nSealing like the elixir family.\n\n*Bing* and *ding* spread below,\nChaos itself turns sweet and fragrant.\nSeven and eight—yang numbers reach their peak,\nNine and six must be added again.\n\nThe four shells—yang now full,\nFive colors like the dawn’s glow.\nRemove the yang, discard the inverted moon,\nAbove, the finest yellow sprout.\nYellow is the color of gold,\nWhite is the white horse’s tooth.\nTransforming, it becomes the conveyance,\nThus called the River Chariot.\n\nMysterious brightness and hidden submission,\nHusband and wife share one home.\nThis is the King Yang’s technique,\nThe Yellow Emperor’s golden blossom.\n\nThe wise conceal it,\nFools boast of it to others.\nThose who grasp this Dao\nRide cranes to the white clouds’ edge.\n\n**Han Zu’s Celestial Master Oral Instructions, Thirtieth**\n\nLead draws out marrow, marrow draws out essence,\nEssence and marrow unite—the elixir must form.\nOne catty of mercury, seventeen taels,\nOne tael transforms into lead’s essence.\n\nUse this lead-essence to make the great elixir,\nLaozi’s Ninefold Refinement enters life’s mortar.\nOne tael of mercury has an ox’s strength,\nConsuming it, one’s appearance becomes immortal.\n\nAn immortal’s appearance—sinews and bones firm,\nSinews and bones strong, reversing withering.\nCut out the tongue if asked—no need to speak,\nUnable to conceal or reveal, appear or hide.\n\nGuard your words, do not act madly,\nLest the celestial gods above grow angry,\nAnd bring misfortune or the blade’s gleam.\n\n**Guo Zixian of Guozhou’s Oral Instructions, Thirty-First**\n\nThe White Maiden, just sixteen,\nBoasts a delicate frame, a jade-like face.\nEver sighing at the months without a good matchmaker,\nDay and night alone, she sleeps by herself.\n\nHer parents do not understand her heart,\nCasually speaking of Zhang San or Li Si.\nSeveral times the talks come to nothing,\nMaking her ashamed to heaven, ashamed to earth.\n\nSuddenly, the Yellow Crone comes knocking,\nSaying the Metal Duke’s nature is gentle.\nShe takes their two fates to consult Junping,\nJunping declares this a fine match.\n\nNeither biased nor crooked, it accords with heaven and earth,\nExamining the cause, it is most fitting.\nTo this day, their descendants fill the imperial realm.\nWere it not for the Yellow Crone’s efforts,\nHow could yin and yang have united?\n\n**Cao Zhenren’s Oral Instructions, Thirty-Second**\n\nSeize the Eastern Green Dragon,\nPair it with the Western White Tiger.\nThen take the Southern Vermilion Bird,\nMatch it with the Northern Dark Warrior.\n\nTrace these four to their root,\nOriginally of the same ancestral clan.\nYet people do not know to explore this,\nMistaking many stones for the marquis.\nThey do not understand how to unfold yin and yang,\nTo pair them as husband and wife.\n\nYin and yang’s *qi* are inherently dual,\nOnly then can they unite.\nOf these, the most wondrous\nIs the Central Earth.\n\nThe clay furnace needs no artifice,\nBut the fire’s management requires diligence.\nEach day, two hexagrams’ timing,\nAdvance and retreat follow the measure.\nExhaustively study the moon’s waxing,\nLest wind and rain be lost.\n\nAfter ten months, the returned elixir is complete,\nThe body freed from poverty and suffering.\nWhen the blue sea turns mulberry fields,\nYou will witness the change.\n\nWhoever obtains my Dao,\nMust not lightly pass it on.\nTo casually reveal heaven’s mechanism\nBrings calamity upon seven generations.\n\n**Han Yunzhong, Recluse of Mount Taibai, Oral Instructions, Thirty-Third**\n\nThe great Dao is vast and distant,\nYin and yang are hard to fathom.\nCreation and transformation arise,\nYet people cannot comprehend them.\n\nVainly discussing emptiness, they white their hair by the thousands,\nWasting wealth to prolong life,\nYet preserving their complexion brings injury and ruin, shortening their years.",
      "overlap_context": " for the world to find.\nGrasping this treasure,\nOne water, one stone.\nThe ash pool’s flames blaze,\nRemoving names from death’s register.\n\n**Transmitted Heart Instructions, Another Song**\n\nThe water spirit casts into golden jade,\nHeaven and earth’s sun and moon essence.\nKan and Li achieve completion,\nThe Three Powers display their names.\nYang numbers reside in yin’s execution,\nYin numbers return to yang’s punishment.\nDesiring to know the inverted technique,\nMutual overcoming is mutual generation.",
      "start_char": 6583,
      "end_char": 7843,
      "start_sentence": 284,
      "end_sentence": 332,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.0657114982605,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大还丹照鉴.txt",
        "category": "众术类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "古今好者，计丧如麻，盖目乖师，不明宗旨。 水银称阴，阳是四黄，顽铅相投，采花为土，草木立号，为虎为龙，凡世金银，配在子母，修丹服饵，自取无常。 满目如斯，妖讹大谬。 余往昔究，皆历如然，岂知精术有妙法，特显至真。 夫水即铅也，汞也，坎中之男，德居壬癸，炼阴销铄，九转沉浮，数足成乾，配金西位，世人亦用，不得其元。 龙虎有形，刚柔自别，金公灭火，白雪须真，五运化生，自然伏火，此为真也。 夫汞即居离中，得女离即火也，朱砂也，得壬癸丙丁，还气东方青阳，白藏出於中央，只在目前，难睹其容，窈冥恍惚，实谓朦胧。 严君平口诀第三十四 铅是铅汞是汞，只这两般是铅汞，龙是龙虎是虎，只这两个同宗祖。 若能识此坎离宫，离官之下出黄土。 黄土出黄芽，黄芽之下金花成，金花成，金花之下结紫精，紫精成，紫精之下出白金。 白金沉黄金浮，世人采沉作丹头，搜取赤髓相和种。 种有时采有日，换筋骨添寿历，天仙地仙不思议，点铅铁兼瓦砾。 一二三四五，水火木金土。 但知明此诀，便是长生路。 大还丹照鉴竟",
      "translated_text": "Those of past and present who pursue this Way have met ruin in droves, their eyes straying from true teaching, their minds unclear on the essential aim. They call mercury yin and the Four Yellows yang, cast crude lead into the mix, and gather flowers as earth—herbs and trees they name dragon and tiger. Common gold and silver they pair as mother and child, refining elixirs and consuming them, only to court impermanence. Such errors fill the world, gross and deluded.\n\nIn my own past inquiries, I too traversed this path, yet how could I have known the subtle art holds a wondrous method, uniquely revealing the utmost truth? Water is lead, it is mercury—the male within Kan, its virtue residing in Ren and Gui. Refine yin to dissolve and subdue; after nine cycles of sinking and rising, the count is complete and Qian is formed, matched with metal in the western position. Though the world also employs these, they fail to grasp their origin.\n\nDragon and tiger possess form, hardness and softness distinguish themselves. The Metal Lord extinguishes fire; true white snow is required. The Five Movements transform and generate; fire is naturally subdued—this alone is real.\n\nMercury dwells within Li, obtaining the female; Li is fire, cinnabar. Attaining Ren, Gui, Bing, and Ding, it returns qi to the eastern blue yang. White concealment emerges from the center, present before one’s eyes yet difficult to perceive, obscure and indistinct, truly veiled in mist.\n\n**Oral Instructions of Yan Junping, Thirty-Fourth**\n\nLead is lead, mercury is mercury—only these two are lead and mercury.\nDragon is dragon, tiger is tiger—only these two share a common ancestor.\nIf you can recognize this Kan and Li palace,\nBeneath the Li palace, yellow earth emerges.\nYellow earth yields the yellow sprout,\nBeneath the yellow sprout, golden flowers form.\nWhen golden flowers form,\nBeneath the golden flowers, purple essence congeals.\nWhen purple essence congeals,\nBeneath the purple essence, white gold appears.\nWhite gold sinks while yellow gold floats;\nThe world gathers the sinking as the elixir’s head,\nSeeking the red marrow to blend and sow.\nThere is a time for sowing, a day for harvesting,\nExchanging sinew and bone to extend lifespan—\nCelestial immortals and earthly immortals beyond imagination,\nTransmuting lead, iron, even tiles and shards.\n\nOne, two, three, four, five—\nWater, fire, wood, metal, earth.\nSimply understand this secret,\nAnd you tread the path of longevity.\n\nThe Great Returned Elixir shines in the mirror, complete.",
      "overlap_context": "t not lightly pass it on.\nTo casually reveal heaven’s mechanism\nBrings calamity upon seven generations.\n\n**Han Yunzhong, Recluse of Mount Taibai, Oral Instructions, Thirty-Third**\n\nThe great Dao is vast and distant,\nYin and yang are hard to fathom.\nCreation and transformation arise,\nYet people cannot comprehend them.\n\nVainly discussing emptiness, they white their hair by the thousands,\nWasting wealth to prolong life,\nYet preserving their complexion brings injury and ruin, shortening their years.",
      "start_char": 7843,
      "end_char": 8273,
      "start_sentence": 333,
      "end_sentence": 348,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.27867865562439,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\众术类\\大还丹照鉴.txt",
        "category": "众术类"
      }
    }
  ]
}