{
  "source_id": "大道真传",
  "source_file": "chunked_daozang\\大道真传.json",
  "total_chunks": 23,
  "total_original_chars": 23863,
  "total_translated_chars": 119882,
  "total_translation_time": 710.2223224639893,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\大道真传.txt",
    "category": "藏外"
  },
  "full_translation": "**The Authentic Transmission of the Great Dao**\n\n*Oral teachings of Wei Yaoze of Western Shu, recorded by Chen Weigong Meng of Eastern Zhe*\n\nThe Dao is sought within the heart; when the heart is empty, the Dao may be cultivated.\nIf one seeks merely the fruits of fortune, one remains as distant as a boat across the river.\n\nThose who have attained the Dao must let go of attachment to self and others.\nOnly by releasing body and mind can one break through the Dragon and Tiger.\n\nCultivate and examine yourself; restrain thoughts and reflections.\nLet greed and anger not arise; maintain single-minded sincerity.\nThe gate of Dao and virtue is none other than the Mysterious Female.\n\nOnce the medicine is obtained, spring fills the body.\nThen virtue becomes fragrant as osmanthus, sweet as honey—\none knows its goodness at last.\n\nExert utmost sincerity and effort; do not falter or idle.\nTake heed! Take heed!\n\nThe kalpa’s movement has begun, and the Dao’s fortune is awakening.\nDo not delay yourself or squander Heaven’s grace!\n\nProceed with caution!\nRefine yourself with care!\nTake heed! Take heed!\n\n---\n\n**First Lecture on the Authentic Transmission of the Great Dao: The Fire Times of the Microcosmic Orbit**\n\nWhat are the *fire times* of the Microcosmic Orbit?\n\n*Times* refers to the moment.\nUsing the *living zi* and *living wu* hours, one awaits the proper time to ignite the fire—hence *fire times*.\nFire is *li* (☲), the spirit within the heart.\nThe use of fire is the wondrous function of the heart-spirit, and its wonder lies in awareness.\n\nWith natural spiritual awareness, one refines the celestial fire times to concoct the Great Medicine,\nfollowing a fixed rule.\nThe alchemical classics describe these rules, yet in truth, it is naturally so—\none need not force effort, for it is *wuwei* (non-doing) that accomplishes all.\n\nThe fire times arise in accordance with the natural order of cultivation and can be verified.\nYet one must cultivate naturally to attain spiritual awareness;\nif even slightly unnatural, the spirit loses its efficacy,\nfor attachment and discursive thought cause errors in the fire times.\nThus, I name it the \"Four Characters of Natural Spiritual Awareness,\"\nwhich the alchemical classics call the *Yellow Dame*.\n\nYellow is the color of the Dame.\nThe Dame embodies the pure *kun* (☷) trigram, symbolizing her gentle and yielding nature.\n\nIn *Journey to the West*, Tang Sanzang’s eighty-one tribulations are all errors in the fire times.\nThe causes of encountering demons—failing to fast or seeking lodging—\nstem from concerns over clothing, food, and shelter, which give rise to craving.\n\nFor the human heart possesses the nature of food and desire, innate from birth:\nhalf inherited from parents, half imprinted during the *bardo*.\nParents’ food and desire are transmitted to us—one source;\nthe *bardo*, with its karmic roots of food and desire, imprints our mind-ground—another.\nFrom these two arise greed, anger, delusion, and attachment, ceaselessly.\nA moment’s carelessness, a stirring thought, and the fire times err.\n\nZhu Bajie’s talk of disbanding the group is the scattering of fire.\nThe fire times of the Microcosmic Orbit are most critical;\nin the Macrocosmic Orbit, natural spiritual awareness is complete, so errors are fewer.\nIn the Microcosmic Orbit, awareness may or may not arise, requiring vigilance at every step—\nhence the alchemical classics provide detailed explanations.\n\nAs *Awakening to Reality* states:\n*\"A hair’s deviation prevents the elixir from forming.\"*\nThus, the fire times must not be mistaken.\n\nYet due to these detailed descriptions, scholars stray onto side paths.\nFor instance, theories of \"nine and six,\" *qian* and *kun* strategies—\nthese are not facts but symbols representing principles.\nTo follow texts rigidly is to cling to form.\n\nIn *The Secret Teachings of the Dragon Gate*, Ancestor Qiu’s *Song of the Microcosmic Orbit*—\nif one practices according to its verses, it is still misguided.\nMaster Liu Huayang’s *Wind and Fire Classic* also elaborates on fire times,\nusing the physical body as analogy.\nYet clinging to its phrases in practice is akin to the *Song of the Microcosmic Orbit*.\n\nWhat is fire?\nIt is natural spiritual awareness.\nWhat is medicine?\nIt is the primordial *qi*.\n\nThis is spoken from the perspective of *medicine and fire*.\nFrom the perspective of *refinement*:\n*qi* is the furnace;\nspirit is the fire within the furnace;\nthe empty aperture is the cauldron;\nthe union of spirit and *qi* to attract primordial *qi* is the medicine within the cauldron.\n\nAs Bai Yuchan said:\n*\"Refining medicine with fire to form the elixir is using spirit to guide qi to attain the Dao.\"*\nLi Qing’an said:\n*\"To become Buddha or immortal requires no strenuous effort—only concentrating spirit into the qi cavity.\"*\nIn these words, medicine, fire, cauldron, and furnace are all encompassed.\n\nDuring elixir refinement, gathering is most crucial, and sealing must not be neglected.\nOnce true yang is gathered, fearing leakage, one must apply the work of sealing—\nachieved through *stabilization* and *forgetting*.\n*Stabilization* ensures true yang, when it arrives, is fully nurtured;\n*forgetting* is the unforced gathering, the effortless attainment.\n\nSealing is ceasing the fire.\nAfter gathering true yang, if the fire continues unchecked, excess becomes as harmful as deficiency,\nrisking leakage—thus, the fire must be ceased and sealed, which is most essential.\n\nThe *Song of the Microcosmic Orbit* describes verifications and methods, not the practice itself.\nFor how to practice, one must employ the three characters: *stabilize, forget, cease*.\n\nWhen yang arises and awareness dawns, the *living zi* and *living wu* are present.\n*Wu* is *li* (☲); *zi* is *kan* (☵).\nOnce aware, *zi* and *wu* unite; after their union, it is the time to refine the medicine.\nIn the Macrocosmic Orbit, *qian* (☰) and *kun* (☷) unite—\nthe proper time for the fire times.\n\nThough the *living zi* and *living wu* may already be present,\none may fail to be sensitive to the *living wu* and remain unaware;\nor, though aware, may not apply the fire according to method;\nor, in applying the fire, may cling to form or intention—\nall these render the water source impure.\n*The Wuzhen Pian* states:\n*\"To know where the fire times commune with the numinous,\none must consult the immortals in careful discourse.\"*\nWhat texts leave unexplained lies precisely here—\nhence the three characters *stabilize, forget, cease* must be discussed with the immortals.\nLü Zu said:\n*\"Simply settle the spirit and rest the breath, letting nature take its course.\"*\nThe word *\"settle\"* is most essential:\nwhen settled, the fire times of numinous awareness arise naturally.\nOne need only follow nature, and no error will occur.\n\nWhen the Microcosmic Orbit is practiced to utmost proficiency,\na single cycle may be completed in as little as one minute.\nWere one to follow the texts, which prescribe 360 breaths for *qian* and *kun*,\nseveral minutes would be required—\nimpossible to finish in one.\nThus, the numbers are concealed within the principle,\nand while the theory and method remain thus,\nin practice it is never so.\nOne must not, on this account, entertain doubts.\n\nBelow follows a detailed explication of Qiu Zu’s *Song of the Microcosmic Orbit*:\n\n*\"When stillness reaches its utmost, movement arises—\na single yang returns.\"*\n\nThe work of the Microcosmic Orbit begins when yang is born,\nand yang is born only when stillness reaches its utmost.\nThe yang born at the height of stillness is of the purest water source—\nthus, the phrase *\"stillness reaches its utmost\"* demands utmost attention.\nThe yang born in stillness is true yang.\nThe yang aroused by ordinary thoughts and sensations is lewd essence.\nOnly when movement arises from the utmost stillness\ndoes true primordial yang-essence come into being.\n\nZhang Ziyang the Perfected said:\n*\"The medicine is born in the mysterious aperture.\"*\nFrom the medicine arises the mysterious pass;\nthe medicine emerges from emptiness.\nAt first, it rises from the yin heel vessel into the Gate of Life.\nThe Gate of Life is the inner kidney.\nWhen the Gate of Life stirs, the outer kidney naturally rises;\nas it ascends, it stirs the Heart Mansion,\nand one becomes aware of the outer kidney’s rising—\nthis is the time of the *living wu*,\nwhen the true fire within *kan*-water ascends to unite with *li*.\n\n*\"A single yang returns\"* is the hexagram *Fu* (☳, Return), Earth Thunder.\nThe seven-day return is the creative transformation of Heaven and Earth.\nThe true yang beneath the earth is born once every seven days.\nThe *Book of Changes* states:\n*\"In Return, do we not see the heart of Heaven and Earth?\"*\nDaoists abbreviate this as *\"Heaven’s Heart.\"*\nWhen a single yang returns and the outer kidney stirs and rises,\nthis is the moment when Heaven’s Heart is revealed.\nThe rising of the outer kidney is caused by the surge of yang-qi.\nThis yang-qi is the principle-qi of the Great Ultimate,\nidentical to that which, in the primordial Great Ultimate, generates Heaven and Earth.\nWhen this qi arrives in the body, the outer kidney rises—\njust as, at the winter solstice, a single yang is born beneath the heavy yin,\nbursting forth from the earth in a *zhen*-thrust to restore Heaven’s Heart.\nThe rising of yang in the human body likewise ascends from below,\nmirroring this process—\nits rising is the return of a single yang, the hexagram *Fu*.\nWhen stillness reaches pure yin,\na single yang line is born beneath five yin lines—\nhence *\"returns.\"*\n\nAt this time, though the medicine is already present,\nit is tender and cannot yet be gathered—\none can only begin from this point.\nWhen one’s practice reaches the state of profound obscurity,\nall phenomena dissolve into silence,\nand a single yang returns—\nin that fleeting, indistinct moment,\nthe outer kidney suddenly rises:\nHeaven and human unite in spontaneous arising.\nThe primordial yang first stirs in the body,\nbut its rising is not yet firm,\nfor only a single yang is present.\nThe *Daode Jing* states:\n*\"Indistinct, yet within it there is an image;\nvague, yet within it there is a thing;\nobscure, yet within it there is an essence;\nits essence is utterly real—\nwithin it there is sincerity.\"*\nHere, the *\"image\"* is the sign of yang’s return.\nWhy does yang rise?\nBecause of the presence of essence—\nthis is the primordial essence of emptiness.\nWhen yang is born and felt in the body,\nit is the arrival of primordial essence,\nthe appearance of the primordial, undifferentiated supreme essence—\nthus, essence is born.\nIn ordinary intercourse, yang also rises and essence is born,\nbut it differs from this primordial essence—\nhence the distinction *\"utterly real.\"*\n*\"Sincerity\"* refers to reliability:\nHeaven’s Heart returns every seven days,\nunchanged through the ages—\nhence *\"sincerity.\"*\nThe rising of yang is the sign of Heaven’s Heart’s revelation,\nand the adept relies on this sign to perform the work of gathering.\n\nWhen one reaches the state of utmost emptiness and profound stillness,\na single yang will invariably return—\nwhether at twenty or a hundred years of age, it is the same.\nWhat reliability is this!\nYet only in the state of profound obscurity and indistinctness\ncan this sincerity be found.\n\nConfucius said, *\"Since ancient times, all must die; without trust, the people cannot stand.\"* Only with trust can one transcend death, establish destiny, and attain the treasure of life. Zhu Xi did not understand this, hence his commentary misses the mark. For only by knowing this can one avoid death, yet also not be hindered by death—life and death lie within one’s own grasp, not Heaven’s. One holds the reins oneself.\n\nWhen both heart and body attain stillness, a single yang will invariably return, enabling one to move freely in and out of life and death, unbound by the constraints of creation. In utmost stillness, movement arises, returning to the Supreme Ultimate; the Supreme Ultimate returns to the Ultimateless, and from this, a single yang comes back. If one can sit in stillness to generate yang, that is well; if not, one may instead practice sleeping meditation, naturally attaining stillness and generating yang. As the saying goes: *\"At dusk, one retires to rest\"*—this is the time of greatest repose, when both body and heart are still. Yet most people are obscured by the seven emotions and six desires, even in sleep failing to achieve true stillness, their dreams disturbed by craving and lust, never finding rest. If one truly stills both body and heart, sleep becomes dreamless; in profound stillness, yang rises, and a single yang returns—heart and spirit naturally awaken. For when spirit and qi unite, as qi stirs, spirit stirs with it and perceives.\n\n*\"When the medicine is born, the spirit knows—ah, the wondrous secret connects to the numinous.\"* \"Knowing\" here means *\"knowing the white, guarding the black, so that spirit and brightness come of themselves.\"* The single yang is the medicine; its return is the medicine’s birth; the return of a single yang is the *living midnight hour*. The spirit’s knowing is the *living noon hour*—when the primordial qi arrives, one knows it. For true yang advances from the yin heel vessel, stirring the true fire of the Gate of Life, causing the outer kidneys to rise and surge upward to the heart, where the spirit awakens and perceives. At the extreme of yin, yang is born and the medicine appears; within yang, yin is born and the spirit knows. The living midnight and living noon connect—qi stirs, and spirit follows its movement. As the *Canticle* says: *\"In sleep, spirit embraces spirit; upon waking, one awaits the moment of presence or absence.\"* Within this lies a wondrous secret, through which one may connect to the numinous.\n\nConnecting to the numinous means uniting with the numinous qi of Heaven and Earth and one’s own numinous nature. The wondrous secret is the method of *\"the medicine’s birth and the spirit’s knowing\"*—the method of the living midnight and living noon. When we should begin the work of gathering, if one knows and cultivates this, one naturally achieves *\"Heaven and man unite in manifestation, the foundation of the myriad transformations is set\"*—hence *\"connecting to the numinous.\"*\n\n*\"When the tender yang first arises—ah, it is young and must not be gathered.\"* Once this secret is understood, one must proceed to gather. If the medicine is too young, it cannot be gathered; if too old, it also cannot be gathered. Confucius said: *\"The Dao cannot be put into practice, and I know why: the wise go beyond it, the foolish do not reach it. The Dao cannot be made clear, and I know why: the worthy go beyond it, the unworthy do not reach it.\"* Whether too old or too young, both are unusable—excess and deficiency are the same. Only when there is neither excess nor deficiency, when it accords with the mean of the moment, is it proper. Confucius called this the *\"timely sage\"*—precisely the *\"mean\"* before joy, anger, sorrow, and happiness arise. The work of gathering is active and intentional, the *\"harmony\"* when these emotions are expressed with perfect moderation. When sealed and secured, this becomes the harmonious fusion and coagulation.\n\nThe tender yang is the moment of its initial arising. When the faint yang first stirs, though it rises, it is not yet firm—too young to be used, it cannot be gathered. The single yang of *Fu* (Return) cannot be gathered; the two yangs of *Lin* (Approach) also cannot be gathered. Only when the hexagram *Tai* (Peace) is reached—three yins above and three yangs below, perfectly balanced—when true lead weighs eight ounces and true mercury half a catty, when yin and yang attain equilibrium, can one proceed to gather. At its initial arising, it is too tender to gather; one must stabilize it in the empty space beyond the nose, using fire to drive the metal into motion, allowing yang to fully generate. For true gold must be accumulated drop by drop.\n\n*\"When the medicine is firm and full—ah, the fifteenth day’s radiance is complete; the time has come to gather urgently—ah, do not let it slip away.\"* When the medicine is firm and full, it is ready to be gathered. The fifteenth day’s radiance is complete—this is the time of the full moon. Firmness means the moment when yang rises and solidifies. At this time, there is neither excess nor deficiency; it is the perfect full moon, and one must not miss it—one must immediately begin the work of gathering.\n\nWhat is meant by gathering? It is to employ the work of *\"forgetting.\"* At this moment, one must hold fast and not lose it, practicing a gathering that is no-gathering, a taking that is no-taking. Each day, yang arises, yet most people let it slip by, failing to gather it because they do not know the secret. When the medicine is firm and full, this is the true midnight hour. When one first senses its movement, this is the living noon hour. The *\"time\"* in *\"the time has come to gather urgently\"* is the true noon hour. The outer kidneys first rise lightly, then rise higher, and finally become firm—this is because the medicine is full and surges upward to the heart, so that upon sensing it again, one knows it is firm. This is the true noon hour—the very crux of the oral secret. Scholars must take this to heart!\n\n*\"If one waits too long—ah, gathering will yield no result.\"* This is as the *Awakening to Reality* says: *\"When gold meets the distant full moon, it is no longer fit to taste.\"* The word *\"long\"* demands special attention: if it has already been firm for too long and the moment is past, this is *\"long\"*—by the seventeenth, eighteenth, or nineteenth day, the moon has waned too far, grown too old to be used, and cannot form the elixir. In these few lines, the youth and maturity of the medicine in the microcosmic orbit and its firing times have been fully explained. What follows concerns the principle of spirit and qi depending on each other, the living midnight and living noon connecting—when qi stirs, spirit follows its movement. As the *Canticle* says: *\"In sleep, spirit embraces spirit; upon waking, one awaits the moment of presence or absence.\"* Within this lies the wondrous secret.\n\nWhen *\"qi races outward, spirit too races outward; when spirit returns to the root, qi too returns to the root,\"* the first line speaks of movement—where one moves, the other follows; the second, of stillness—where one rests, the other abides. The first line describes the medicine’s arising and spirit’s awareness; the second, the gathering of spirit into the qi-cavern. The first line shows qi stirring and spirit following; the second, spirit settling and qi likewise abiding. The first line concerns the linking of living midnight and living noon—when qi stirs, awareness arises, and spirit follows—this is the teaching on the external. True yang comes from without, so qi arrives from outside, and spirit emerges to meet it, which is what is meant by *\"lead arrives, mercury welcomes.\"*\n\nThe second line speaks of the moment of gathering and sealing. At first, one employs stillness—this is the work of the external medicine. Once yang’s arising is settled, one must gather it, applying the work of *\"forgetting.\"* Qi returns, and spirit follows, entering together into the crucible. Qi is the medicine, and spirit is the fire; spirit returns to the root, and qi restores life. As the *Daodejing* says: *\"To return to the root is called stillness; stillness is called the restoration of life.\"* Nurturing qi is the work of establishing life. When stillness reaches the point of forgetting the external, one returns to the root. In gathering, one employs forgetting, so that qi returns to the root and spirit likewise returns to the root.\n\nWith fire, the medicine is refined: spirit returns to the root, and true yang arises externally. One then draws this yang back into the crucible—not gathering as gathering, not taking as taking—until gathering is complete, the root is returned to, and the body is forgotten. Qi too returns to the root. When spirit and qi return to the root, qi nears fullness, and the external kidneys descend. Gathering is one phase; sealing is another—these are the two phases of gathering the *muni*.\n\nWhen *\"qi returns and nears fullness, the phases of gathering and sealing are complete; at midnight, the fire is kindled—this must be clearly distinguished,\"* once the descent occurs and the phases of gathering and sealing are complete, one should cease firing and halt the work. If one does not know when to stop, the medicine will leak away. What follows describes the verification of the work, not the work itself. As Ancestor Lü said: *\"There is a natural firing sequence.\"* The firing sequence has its own natural order. What follows concerns the principles of advancing yang-fire and retreating yin-tally within the firing process.\n\nWhen a person moves from extreme stillness to movement, the first yang revives. Through the work of stillness, true yang arrives in the body, and when it is full, one proceeds to gather. Once gathered, spirit and qi have returned to the root, and one must cease firing—this is one cycle of the work. Practicing thus daily and persistently, when yang is fully gathered, the accumulation of gold fills the abdomen, reaching the point of true gold filling the belly. This gives rise to the refining process, enabling the three hundred and sixty celestial revolutions to swiftly complete. Metal, wood, water, and fire arrive simultaneously to interact and gather the external medicine. At this stage of practice, advancing yang and retreating yin proceed in unison. Once the phases of gathering and sealing are complete, one naturally kindles the fire and retreats the yin from the body.\n\nWhen asked *\"What is fire?\"*—it is the postnatal breath. *\"How is fire moved?\"*—by exhaling downward and inhaling upward. Fire is the qi of postnatal breathing. This is natural work: at this stage, original spirit becomes numinous, and natural spiritual awareness arises. Exhaling is the preceding descent; inhaling is the subsequent ascent.\n\nWhen *\"the subtlety of using fire is like nothing yet something,\"* this means that nothing is established—its breathing’s ascent and descent, its exit and entry, seem present yet remain as if absent. This is what is meant by *\"simply settle the spirit and rest the breath, following nature,\"* employing the work of forgetting without clinging to appearances.\n\nWhen *\"refining fire within the crucible imitates the true person’s breath,\"* this means gathering postnatal qi into the crucible, emulating the true person’s breathing. *\"The true person’s breath reaches the heels\"*—*\"heels\"* signifies depth, referring to true breathing. At this time, the breath reaches the heels.\n\nWhen *\"fire must have its phases, counting the breaths’ exit and entry; called the water-clock, it fixes the time,\"* the work of counting breaths is the martial fire of the water-clock. One must silently count, which is the water-clock. The water-clock fixes the time, and this is also used to mark the hours. By employing the water-clock’s martial fire and listening to the breath’s exit and entry, one achieves solidity and attains the true midnight hour, at which point one may gather and refine the medicine.\n\nFrom midnight to dawn, the six yang lines use nine—thirty-six breaths—this is the time for advancing yang-fire. At the true midnight hour, one must employ forgetting. Naturally, there are thirty-six breaths—these thirty-six breaths are the advancing fire.\n\nFrom noon to midnight, the six yin lines use six—twenty-four breaths—this retreats the yin within the body. Cool fluid descends, passing from the crown through the *heavy tower* into the abdomen—this is the retreating yin-tally. The twenty-four breaths remain natural; one must not cling to the appearance of counting. One’s spiritual awareness naturally governs the firing sequence to refine the medicine.\n\nAt dawn’s yang bathing, yang-fire should be extinguished; at dusk’s yin bathing, yin-tally should be halted. Neither descending nor ascending—this is the scene of bathing. Compared to the great celestial revolution, it bears only a faint resemblance. At dawn and dusk, bathing requires cessation and forgetting. Cessation means neither exhaling nor inhaling, halting the breath without ascent or descent—this is the bathing of dawn and dusk.\n\nIn summary, when *zi* stirs and *wu* awakens, the medicine is produced and the spirit knows—one must then proceed to stabilize it. Stabilization is the martial fire of the water clock. Stabilization resides in the empty space beyond the nose, where one listens with the ears to the breath, counting its ingress and egress. Only thus can the medicine be solidified, and the true *zi* and true *wu* moments arrive. At this time, one should gather it, employing the work of \"forgetting,\" which is also the moment of *mao* and *you* bathing.\n\nAt the moment of the great cross-merging, once the true *zi* hour arrives, advance the yang-fire. As awareness arises at the true *wu* hour, retreat the yin-tally. *Zi* and *wu* arrive simultaneously. The thirty-six and twenty-four are the measures of the firing sequence. Yet the *Du* is long while the *Ren* is short: the long has thirty-six breaths, the short only twenty-four, and they precisely correspond. Their point of intersection lies between *mao* and *you*, where internally water and fire merge, and externally metal and wood converge. Metal, wood, water, and fire all meet in the Central Palace—this is the \"taking from *Kan* to fill *Li*,\" where the two earths form the *gui*.\n\nYet all this work unfolds within the state of forgetting. The six yang and six yin are but proportional measures of the method. The *Du* has thirty-six breaths, the *Ren* twenty-four—a long and a short, their work completed entirely in forgetting. Naturally, spontaneously, without a single thought, body and mind in non-doing, yet the spirit and qi act of themselves. Above and below merge as water and fire; left and right converge as metal and wood. The two pairs unite in the Central Palace, the nine returns and seven reversions arriving simultaneously, without precedence or sequence, differing slightly from the great celestial revolution. (See Figure 1)\n\n*\"Three hundred cycles of the celestial revolution,\nExcluding the count of *mao* and *you*;\nThree hundred sixty,\nIncluding *mao* and *you* in the name.\nAdd five degrees more,\nA quarter’s division,\nTo mirror the intercalary surplus,\nA full circuit of the celestial revolution.\nReturning once more to stillness,\nBathe as before;\nSpirit congealed in the qi-cavern,\nAwait the next arising of yang.\"*\n\nAt this stage, performing the work once completes a single circuit of the celestial revolution. After one circuit, cease the firing and bathe, congealing the qi in its cavern to await the next arising of yang. After three hundred sixty circuits, the work of the minor celestial revolution is complete.\n\nFrom *zi* to *wu*, from *wu* to *hai*, when the external kidneys descend, this marks one circuit of the celestial revolution.\n\n*\"With prolonged practice,\nEssence returns as qi;\nThe revolving wind ascends straight,\nA hundred days yield efficacy.\"*\n\nThe revolving wind ascending straight refers to circulating the celestial revolution daily. As the work continues, the body’s essence transforms entirely into qi. The minor celestial revolution’s work is accomplished in roughly a hundred days. After these hundred days, the foundation is laid, giving birth to the fetal immortal—hence the efficacy of a hundred days.\n\n*\"Six kinds of tremors,\nSeven-day oral instructions;\nThe great revolution’s work begins,\nSeek again the ford of delusion.\"*\n\nFrom here to the six kinds of tremors, there remains a year of nurturing work. After a year of nurturing, one should proceed to the work of the great celestial revolution, seeking the seven-day oral instructions for practice to traverse this great celestial revolution—thus, \"the great revolution’s work begins, seek again the ford of delusion.\"\n\nIn essence, the minor celestial revolution’s practice hinges on three words: \"stabilize, forget, cease.\" Yet the actual work unfolds entirely within the arising of yang—arising to practice, descending to conclude. What one feels in the body is but a pervasive tingling. When the practice becomes proficient, the tingling moves from back to front, and atop the crown, cool fluid descends—this is the sign of advancing yang and retreating yin. When yang descends and the tingling vanishes, one cycle of work is complete, with no other method. The practitioner should attend carefully to these two matters.\n\nThe second lecture on the true oral transmission of the Great Dao completes the explanation of the firing sequence and phenomena in Qiu Zu’s *Song of the Minor Celestial Revolution*. The minor celestial revolution begins at the arising of yang; the moment yang arises is the time to start the fire, and when yang descends, the time to cease it.\n\nThere is another account, Wu Zhenren’s *Nine Chapters on the Dao of Elixir*, which describes the \"three appearances of yang-light\"—also a phenomenon of the minor celestial revolution. At the outset of practice, this sign cannot be fully perceived, for one remains in a state of vagueness, practicing the \"gathering without gathering, taking without taking.\" The work must proceed in utter chaos—if clarity arises, the water source is impure—thus, without clarity, even if the sign appears, it cannot be recognized.\n\nBy the final stage, when the yang-light appears three times, the foundation is laid, and one must cease the fire. The appearance of yang-light is the \"brightness born in an empty room,\" a white light radiating between the brows, flashing like lightning. The *Sutra* speaks of the Tathāgata emitting white light from between the brows—this is it. At its first appearance, the moment of yang’s arising, it is not easily noticed. Only after the living *zi* arrives does the living *wu* follow, and the spirit becomes aware. The yang-light flashes and vanishes in an instant—this is the first appearance of yang-light, as detailed in *The Orthodox Theory of Celestial Immortals*.\n\nWhen yang is full and ready for gathering, the medicine solidifies. After gathering, the yang-light flashes again—this is the second appearance. During our practice, we remain detached from phenomena, body and mind utterly still, and thus do not clearly perceive this sign; even the second appearance may not be distinctly noticed.\n\nAs previously mentioned, when the external kidneys descend, this is the time to cease the fire. The \"three appearances of yang-light\" also occur at this juncture.\n\nWhen the external kidneys retract, this is called the third appearance of yang-light, and the fire must be ceased. At this point, one may faintly perceive the sensation, yet the yang-light is exceedingly swift—formerly, Adept Wu could not stop the fire at this moment but only at the fourth appearance, by which time the fire had already passed its mark. Ceasing the fire at the third appearance of yang-light is precisely the right moment.\n\nNowadays, one does not rely on the appearance of yang-light to cease the fire but instead depends on the expansion and contraction of the external kidneys. When they retract and a wave of tingling numbness courses through the body, the fire must be stopped at once, lest the appearance of yang-light go unrecognized and the fire not be withdrawn in time, leading to error. However, when the accumulation of gold is complete, the original spirit becomes keenly aware, and natural spiritual perception arises, enabling clear recognition.\n\nThis yang-light is the radiance of lead-flower. At its first appearance, lead first arrives in the body; at the second, lead is fully abundant; and at the third, lead is sufficient and enters the cauldron. With the heart fasting and sitting in forgetfulness, the empty chamber generates brightness—this is it. The so-called \"empty chamber\" is what lies before one’s eyes, not something that emerges from the body but rather from beyond it.\n\nThe work of the minor celestial orbit is that of refinement. The so-called \"civil refinement and martial tempering\" is the process of refining the medicine, the primordial undifferentiated essence. This single drop of essence, refined within the body, transforms all the body’s yin essence into qi—this is called \"refining essence into qi.\" Initially, this practice is time-consuming, but with mastery, the duration shortens, hence the saying of \"gathering and assembling.\" It begins with one hour, then reduces to a quarter-hour, then a minute, and finally a second—the more one practices, the swifter it becomes. Once mastery is achieved, true yang accumulates to fullness, and the foundation is established.\n\nAccumulating yang is the return to emptiness and the refinement of the self. When the refinement of the self is perfected, the foundation becomes firm, and at this point, phenomena arise: breath enters and exits through the entire body, the eighty-four thousand pores all open, and yang retracts like a tortoise. The work of the minor celestial orbit is then complete, and the foundation is laid. Yet there remains the work of gentle nurturing, which must be undergone. For after yang arises, it must be gathered and sealed.\n\nOnce the inner elixir is obtained and sealed within the cinnabar field, it must still be gently nurtured to ensure it remains perpetually retracted like a tortoise, manifesting the *Hidden-Yin-Like-a-Stallion* phase. Without such nurturing, even if the elixir is attained, it cannot be preserved—thus, this phase of gentle cultivation is most essential. The nurturing period spans one year, comprising twelve months, though excluding the months of *mao* (卯) and *you* (酉), which are times for \"bathing,\" leaving ten months for the work of nurturing the Dao-embryo. As the *Yellow Court Classic* states: *\"The zither-heart in triple harmony dances with the embryonic immortal.\"*\n\nThe minor celestial orbit concludes with the initial formation of the embryo; after completing the major celestial orbit, the embryo matures, allowing the spirit to depart. The term \"embryo formation\" is metaphorical—it refers to obtaining the medicine and coalescing the inner elixir. The one-year nurturing period is but a rough estimate; it may extend beyond or fall short of a year, varying by individual. Only after this year does one truly manifest the *Hidden-Yin-Like-a-Stallion* phase, perpetually embodying the body of primordial innocence, becoming a *human immortal*—an embryonic immortal, or *earthly immortal*, a terrestrial transcendent capable of preserving life without death.\n\nThe minor and major celestial orbits are not continuous; between them lies a year of nurturing. The minor orbit generates and then gathers, producing yang from emptiness, which is then collected upon its arrival in the body. The major orbit, however, gathers first and then generates, requiring prior accumulation to enable generation through gathering. The qi amassed during this year of nurturing prepares for the gathering in the major orbit. Only after this year may one undertake the seven-day transmission of celestial secrets to gather the great medicine and practice the major celestial orbit.\n\nAncient perfected ones obscured this sequence, placing the nurturing phase *after* the major orbit, inverting the order to avoid disclosure. In truth, the nurturing precedes it, for they wished to keep it secret. After the major orbit, there follows a three-year \"nursing\" phase—this is the work of returning to emptiness. Upon completing the year of nurturing, one may proceed to the major orbit and spirit departure. Only after achieving the major orbit does the three-year nursing phase begin. Finally, there is the nine-year \"wall-facing\" phase, which is the pulverization of emptiness. This stage is optional.\n\nThe wall-facing practice pertains entirely to the cultivation of *xing* (nature). Those who cultivate the supreme vehicle begin with returning to emptiness, grounding all subsequent work in *xing* cultivation, rendering the nine-year phase unnecessary. For those who do not initially cultivate the primordial Dao but pursue other elixir methods, these nine years are indispensable, as they serve to sweep away all residual obstructions.\n\nAfter the seven-day spirit departure in the major orbit, if one wishes to relinquish the physical form, the three-year nursing phase may be omitted. If not, the three years may still be undertaken. However, the most critical and necessary topic here is the one-year nurturing phase, not the nine-year wall-facing practice.\n\nThis nurturing work differs from contemporary methods; it requires seclusion in the mountains. If remaining in the world, one must secure a secluded chamber, shielded from external sounds, to practice. Only by residing in stillness and dedicating oneself wholeheartedly can the year’s work be completed. Without mountain seclusion or a suitable quiet space, one cannot focus entirely, and the modern concurrent cultivation method must suffice—though a year may then prove insufficient, extending to three. For those practicing amidst worldly affairs, the period may stretch to four or five years, yet this poses no ultimate hindrance, for the goal will still be attained.\n\nThis work is not inherently difficult; the key lies in genuine stillness. As the *Awakening to Reality* states: *\"Before refining the returning elixir, do not enter the mountains—all before and after in the hills is not true lead.\"* Lead exists in the world, born from profound emptiness and stillness within the practitioner, not as a mountain product. Now that the inner elixir is obtained, mountain seclusion is necessary. The minor orbit’s active, willed practice can be performed unseen, even upon the bed at dawn and dusk, but the later effortless phase reveals it—thus, seclusion is required for undivided focus, unlike earlier stages.\n\nThe essence of this work is perpetual *entering samadhi*. Samadhi is a Buddhist term, but here it involves both *ding* (stabilization) and *wang* (forgetting). With a secluded chamber, one may set fixed hours for practice: of the twelve daily hours, excluding four for nightly sleep, eight remain. Deducting two for rest leaves six for cultivation. For non-exclusive practice, four to six hours may suffice, without rigid scheduling—this is the work of purifying the heart and clarifying the mind, intimately tied to effortless alignment of body and spirit.\n\nThe first priority is *ding*, the stabilization described in the *Great Learning* as the foundation for stillness, tranquility, and clarity. The second is *wang*, the forgetting in *Daodejing* where form is forgotten yet preserved. The difference from ordinary practice lies in balancing *ding* and *wang* equally: for every two hours of practice, one hour is for *ding*, one for *wang*. They must be evenly matched—neither *ding* in excess nor *wang* deficient, nor intermingled. This is the work of the *Tun* (屯) and *Meng* (蒙) hexagrams, the \"morning *Tun*, evening *Meng*\" practice.\n\nAt *Tun* in the morning—when the sun rises—one fears the elixir may be harmed by the yang fire, and so must withdraw the fire; withdrawing fire requires *wang* (forgetting). By evening, when the sun sets and yang light is gone, one fears the cold *qi* may harm the elixir, and so must advance the fire; advancing fire requires *ding* (stabilization). In practice, this is simply balancing water and fire. In the morning, one fears dryness, so water is used to temper the lead—this is the work of morning *Tun*, the work of *wang*. In the evening, one fears cold, so fire is used to temper the mercury (drawing lead to replenish mercury)—this is the work of evening *Meng*, the work of *ding*. Morning requires *wang*, evening requires *ding*; in truth, *ding* and *wang* are water and fire, and must be kept even. For every hour of *ding*, there must be an hour of *wang*; for every two hours of *ding*, two of *wang*—imbalance must be avoided.\n\nIn practice, morning *Tun* and evening *Meng* are undertaken simultaneously, with time divided equally: half for *ding*, half for *wang*. At this stage, the work of *ding* and *wang* becomes effortless. Initially, one may have spiritual awareness yet lack naturalness; with long practice, one attains ease and spontaneity, where spiritual awareness naturally regulates all, and deliberate *ding* or *wang* is no longer needed. The six senses are purified, myriad distractions cease, and one sits in natural *ding*, natural *wang*. We need only adjust to maintain balance—otherwise, one risks either dryness or cold. Even in sessions as brief as ten or twenty minutes, this principle holds: where there is *wang*, there must be *ding*; where there is *ding*, there must be *wang*, with equal time allotted to both. This is how we regulate the firing process.\n\nDaily practice of six hours suffices for a year. If unable, or if reduced to one or two hours, the duration must be extended proportionally. The essence of the two methods lies in *ding* generating mercury and *wang* generating lead, for once the inner elixir is formed, it comprises both lead and mercury. In the practice of refining the golden elixir, maintaining balance at every stage ensures that lead and mercury remain equal—like half a catty and eight taels. When lead and mercury are full, the firing process for the great celestial circuit is reached.\n\nWhat we now obtain is the prenatal within the postnatal. The yang born of emptiness is prenatal. Once it enters the body, it transforms into the postnatal, though its essence remains prenatal—hence it is called the prenatal within the postnatal. From this, another substance may be generated: the prenatal of the prenatal. This year of nurturing practice prepares for the prenatal within the prenatal.\n\nThe *Mirror for Ingredient Entry* states: *\"Water fears drying, fire fears cold,\"* and *\"When gathering the medicine, regulate the fire; when the firing is sufficient, do not harm the elixir.\"* This is the principle here.\n\nThe hexagrams of the *Yijing* are always presented in pairs: *Kan* (Water) opposes *Li* (Fire); *Water-Fire Ji Ji* (Already Across) opposes *Fire-Water Wei Ji* (Not Yet Across); *Heaven-Earth Pi* (Stagnation) opposes *Earth-Heaven Tai* (Peace). Paired hexagrams stand in opposition. Apart from the four hexagrams *Qian*, *Kun*, *Kan*, and *Li*, the firing process uses the remaining sixty hexagrams as its standard, aligning with the facts of alchemical yin-yang pairing and the correspondence of two and eight. Each day, one *ding* and one *wang*, one water and one fire, stand in opposition yet complement each other. Thus, the firing process corresponds to the hexagrams: *Qian*, *Kun*, *Kan*, and *Li* serve as the body, while the other sixty serve as function. Each day uses two hexagrams—morning *Tun* and evening *Meng*—interconnected and harmonious. If *ding* is *Earth-Heaven Tai*, then *wang* is *Heaven-Earth Pi*; the correspondence is perfect.\n\nHexagrams have auspicious and inauspicious omens, and these arise from movement. Balance ensures no fault; imbalance breeds misfortune. The *Mirror for Ingredient Entry* says: *\"Receiving qi is auspicious; guard against becoming inauspicious.\"* At the outset of receiving qi, auspiciousness comes easily; in nurturing the firing process, one must guard against danger—this is what is meant by \"guarding against danger and considering risk.\"\n\nThe *Great Learning* states: *\"Only after stability can one deliberate.\"* Even after the small celestial circuit, one must remain vigilant, exercising utmost care to avoid imbalance—whether cold or dryness—for balance is paramount. The earlier requirement for a secluded chamber serves this purpose. During practice, one must use a quiet room and have an attendant to guard against disturbances. Any startling disturbance disrupts balance.\n\nSince ancient times, accomplished practitioners have always had companions, for this very reason. In our practice, we must set fixed times—morning and evening—and ensure someone outside the room oversees and attends to us, preventing human disturbances from disrupting the firing process. This is the work of \"non-doing that accomplishes everything,\" unknown to outsiders. It differs from the small celestial circuit, which can be practiced on a bed to gather and refine without others knowing. Here, with a quiet room and attendant, all will be aware.\n\nThrough this nurturing, the inner elixir transforms into golden liquid. Only when the golden liquid is full can the great elixir be born. The \"inner\" and \"outer\" refer to the small and great emptiness. The small celestial circuit gathers from the external to form the internal, producing the inner elixir—thus, external medicine forms the inner elixir. The great celestial circuit gathers from the internal to form the external, producing the outer elixir—thus, internal medicine forms the outer elixir.\n\nThis marks their distinct difference—what is called the Dao of uniting inner and outer is precisely this.\n\n**Third Lecture on the True Oral Transmission of the Great Dao**\nThe ten-month nurturing practice has always been left undetailed by alchemical schools, for it is the secret formula of the Dao of elixir cultivation. To summarize its essentials: it is the state of settled forgetfulness and perfect equilibrium. At this stage, one has attained the true, natural spiritual awareness, where settled forgetfulness and equilibrium arise spontaneously—any deviation would be an error. As *Awakening to Reality* states: “A hair’s breadth of difference, and the elixir will not form.” “Regulating” means precisely this: achieving equilibrium. Now that the inner elixir has formed, only by nurturing it with the method of settled forgetfulness and equilibrium can the outer elixir be generated and the yang spirit completed. For the inner elixir merely transforms the yin within the body, elevating one to the rank of human immortal. As for the host of yin spirits, the karmic roots accumulated over kalpas, and the intermediate yin of the womb—these the inner elixir cannot transform. Only the great elixir can do so. Therefore, after forming the inner elixir, one must nurture it to generate the outer elixir, thereby completing the work and attaining the rank of the Golden Immortal of Great Awakening.\n\nBeyond the *Song of the Small Celestial Circuit*, Ancestor Qiu also composed a *Song of the Great Dao*, which serves as the guiding principle for all the songs in *The Secret Essentials of the Dragon Gate*. Here, we shall present and explicate it as follows:\n\n*“The Great Dao, profound and subtle, appears before the eyes.”*\nThe opening line immediately points to the crux. The Great Dao is deep and unfathomable, yet its manifestation lies right before us.\n\n*“Since ancient times, those who have attained it have relied solely on transmission from a teacher.”*\nThe source of the Great Dao is not fully expounded in texts; it depends entirely on the oral transmission of a true master.\n\n*“Vague and metaphorical, all teachings ultimately fall short.”*\nEven what is written in texts consists of metaphors, too nebulous to be taken as reality, and all are one-sided. From ancient times, those who wrote books did so in response to the ills of their age, seeking remedies for the world’s afflictions. Thus, the writings of the Song and Yuan dynasties emphasized “active practice,” for their era had sunk into passivity and solitude, requiring the spur of active cultivation. By the Ming and Qing dynasties, writings leaned toward “non-doing,” for the age had degenerated into the debauchery of “female crucible” and sexual arts, necessitating the remedy of non-doing. Since the true oral formulas could not be fully disclosed, texts often resorted to analogies and metaphors—vague and one-sided in the end.\n\n*“A single phrase encompasses ten thousand volumes: the work begins in the prenatal.”*\nThis means that the oral formulas for cultivating the Dao are all contained within the phrase “the work begins in the prenatal.”\n\n*“Named yet formless, the primordial qi is fundamentally empty.”*\nThe primordial qi is something named yet formless, its essence fundamentally empty. Cultivation must begin from this emptiness; what is gathered and obtained is precisely this.\n\n*“When yang arrives subtly, the external form stirs in an instant.”*\nThe prenatal qi emerges from the formless. Its arrival is exceedingly subtle, accumulating bit by bit—hence “subtly.” How can one verify its arrival? It is seen in the “stirring of the external form in an instant.” When the yang organ stirs, one knows the true prenatal yang has arrived. “External form stirs in an instant” refers to the moment of initial arousal. The instant it rises, it is present; the moment one thinks, it is gone—hence “instant.” This word is of utmost importance. The work of gathering the prenatal begins at the moment of arousal, before thought arises. Once the instant passes and stray thoughts intrude, the source of water is no longer pure.\n\n*“In the hazy state between dream and waking, it shifts into the elixir field.”*\nWhen does the yang stir? Precisely in the hazy state between sleep and dream, at the moment of arousal from slumber. Why can one be hazy between dream and waking? Because the spirit has entered the elixir field, embracing the qi, so that when yang stirs, one becomes aware of it.\n\n*“Stir the wind of Xun to regulate the medicine before gathering it.”*\nBefore gathering, one must stir the wind of Xun to regulate it, ensuring it is neither too raw nor too ripe. The wind of Xun is the martial fire of the water clock. Without this, thoughts arise, and the source of water is no longer pure. Stirring the wind of Xun serves two purposes: to still thoughts, and to regulate the medicine. With these two, upon awakening, one must immediately settle in the empty space outside the nose, listening to the breath with the ears. Only after stirring the wind of Xun and properly regulating the medicine can one gather it. Otherwise, one errs either by absence or by excess. Absence means there is nothing to gather; excess means thoughts intrude and the source is impure, making gathering impossible. Therefore, one must first use wind and fire to regulate the medicine—this is most crucial. Only with the martial fire of the water clock can the medicine fully mature, avoiding the pitfalls of absence or excess.\n\n*“From nothing, something arises, and the celestial mechanism appears before the eyes.”*\nThis medicine arises from nothing, and once born, the celestial mechanism manifests before the eyes—this is the phenomenon before one’s gaze, the appearance of the mysterious pass. A white circle appears before the eyes, hazy as a full moon, combining the waxing and waning phases into the fifteenth-day moon—the precise moment for gathering. When this phenomenon appears before the eyes, the true midnight hour arrives. For when regulated with martial fire, the true midnight and true noon hours are born.\n\n*“The tiger inhales the dragon’s soul—timing comes naturally.”*\nWhen yang arises from the formless, it comes from without to within, traveling from the yin heel vessel to the Gate of Life, stirring the outer kidneys. As it surges upward to the heart, one becomes aware of its movement.\n\nWhen martial fire is applied, the fire compels the metal to move, and the outer kidneys become firm and solid. Simultaneously, the heart perceives this firmness—this is the arrival of the true noon hour. By fanning the wind to regulate the fire, it remains fixed externally, and yang, born without ceasing, comes from without to within, gradually filling the body, all felt upon the flesh. Thus, the outer kidneys grow firm. Once firm, yang qi ascends, stirring the heart-spirit; the heart-spirit descends—this is the union of water and fire, the merging of spirit and qi, hence called “the tiger inhales the dragon’s soul.” Only when water and fire have united do the true midnight and true noon hours arise, thus it is said, *“Timing comes naturally.”*\n\n*“Body and mind in reverie, the four limbs like softened silk”*—at this moment, body and mind seem neither awake nor asleep, the whole body both melting and soft, the limbs utterly at ease. This is the true midnight hour; for me, it is the true noon hour when I perceive it.\n\n*“The medicine arises, the spirit knows—this is the moment to gather the clear source.”* At this time, the water source is most pure, and gathering may begin. The medicine arises, the spirit knows—firmness is already felt. Only in this state is the water source clear enough for gathering.\n\n*“Fire compels metal to move, the bellows turns by the power of wind; the river chariot revolves, advancing fire to refine true lead.”* Once the water source is clear, it must be preserved, never again lost to turbidity. Continue the work of fire compelling metal to move, stirring the bellows, relying on the wind of Xun to revolve. Use natural breathing to compel it, practicing natural gathering—gathering without gathering, taking without taking. The breath follows its own nature, without martial fire. Letting it be natural, the river chariot turns of itself, advancing yang fire and retreating yin tally. Advancing fire to refine true lead is the act of gathering. This river chariot’s ebb and flow is entirely spontaneous, requiring no intentional effort.\n\n*“The celestial cycle of breaths—four divisions mark the timely shift.”* The celestial cycle of 360 degrees, divided by four, yields ninety. Here, there are truly only ninety breaths, all natural, flowing with the passage of time—no need to count them.\n\n*“Bathing at Mao and You, concealed within Zi and Wu.”* The celestial cycle of 360 degrees, divided into four parts of ninety breaths, includes bathing at Mao and You, and the withdrawal and addition at Zi and Wu. Mao and You are concealed within Zi and Wu; Zi and Wu are Mao and You. The four phases of ninety breaths are Zi, Wu, Mao, and You, yet Mao and You are hidden within Zi and Wu—thus even ninety breaths are absent, for Zi, Wu, Mao, and You are but relative terms.\n\n*“Returning to the root to restore life—intercalary days complete the celestial cycle; the count reaches three hundred—signs appear before the brows.”* At the time of returning to the root to restore life, a full celestial cycle is complete. What is returning to the root to restore life? When the work of gathering is done, the yang substance retracts—this is returning to the root to restore life. When yang rises, spirit and qi rush outward; when it retracts, they return. Three hundred sixty degrees make a celestial cycle; when the count is complete, cease the fire immediately, for the sign to stop appears before the eyes. Between the brows, in the empty chamber, a flash like lightning—this is it. At this moment, proceed to seal and secure it.\n\n*“The mechanism to cease fire is perfected—the light awaits three pulls.”* At this time, cease the fire and rest, hence it is said, *“The mechanism to cease fire is perfected, the light awaits three pulls,”* which is what Master Wu meant by *“When the yang light appears three times, it is the sign to cease fire.”* The above describes the work of gathering in the minor celestial cycle, which first requires yang to be full and water clear before gathering can begin. Once gathered and sealed, when the yang light appears three times, descend and conclude the practice.\n\nThe following describes the work of sealing and nurturing within the process of refinement. After three hundred celestial cycles, the inner elixir forms, and the elixir’s origin appears—a substance the size of a soybean, leaping up and down. At this time, employ the work of gathering the medicine and returning it to the furnace. When the medicine reaches the abdomen, it must be returned to the furnace, which other texts call *“moving the furnace and changing the cauldron,”* as in the *Yin Fu Jing*: *“The mechanism lies in the eyes.”*\n\n*“The secret of the twin eyes—focus on the central field.”* When the inner elixir has formed and leaps up and down, use both eyes to gaze at the navel. This is a secret practice, not to be observed by others. After focusing for several days, the leaping changes. Previously, it leapt up to the heart and down to the Gate of Life; now it circles the navel, forming a single mass—this is the attainment of the inner elixir. Thereafter, employ the nurturing work described above. At this time, the elixir’s origin revolves around the navel, and one is no longer aware of it in daily life. Nurture it for a year to produce the great medicine.\n\n*“The great medicine is hard to gather—seven days of unbroken continuity.”* One must enter profound stillness for seven consecutive days, applying seven days’ effort. Each day requires stillness for six double-hours—this stillness is of great duration. The following describes the methods of descending work in the major celestial cycle.\n\n*“Beware the perilous path—the mechanism is most profound.”* The path refers to the upper and lower magpie bridges; one must guard against danger and peril. The mechanism also refers to the upper and lower magpie bridges, most subtle and mysterious, for there is the risk of the elixir escaping—one must be vigilant.\n\n*“Seek earnestly, with sorrow—find the true transmission early; choose the right person to teach—vows sworn like the sea; when the moment comes to ingest, virtue must come first.”*\n\nThe great elixir is difficult to gather, the magpie bridges perilous—one must receive the true transmission before attempting the work. And the master, in teaching disciples, must also exercise utmost care, requiring solemn vows like mountains and seas before imparting the teachings. Moreover, the moment for ingesting the great elixir depends entirely on virtue; if one’s virtue is shallow and blessings meager, demonic obstructions will surely arise during practice. As the *Wuzhen Pian* states: *“The great Dao is easy or difficult to cultivate—know that it depends on both self and Heaven. Without accumulating merit and refining virtue, at every turn hordes of demons will obstruct the path.”* This is precisely the case.\n\n*“Ten months of silent illumination—unobscured awakened meditation.”* For ten months, one maintains single-minded stillness, forgetting all else—this is the work of “increasing forgetfulness and diminishing fixation,” practiced after the major celestial cycle.\n\n*“The two qi at rest—nature stabilized, the embryo perfected; yin exhausted, yang pure—snowflakes drift and scatter.”* At this stage, the major celestial cycle has passed, and one may attain the six penetrations, transcending form to enter transformation. With yin fully spent and yang pure, snowflakes appear to drift before the eyes.\n\n*“Transcending the three realms—nourishment in the upper field.”* Having transcended the three realms, one may project spirit outward, thus the elixir is moved to the upper field. Initially, the elixir resided in the lower field; during the major celestial cycle, it ascended to the middle field. Now, the elixir has entered the upper field—the middle field being above the navel.\n\n*“No coming, no going—unfettered, a carefree immortal; karmic conditions fortuitously met—cultivate early, delay not the years. Do not wait until old age arrives—withered bones hold no resources, only vain suffering.”* At this stage, one is unbound, free and at ease. If fortunate karmic conditions arise, practice early—do not procrastinate. For to wait until old age is to face withered bones and empty torment.\n\nThese closing lines convey the essential truth that one must cultivate the immortal’s method early—never waiting until old age. Here we see the true adept’s earnest compassion in guiding others toward liberation. This song encompasses the entirety of elixir arts, with particular detail on the minor celestial cycle; as for the major celestial cycle, it merely outlines its broad contours.\n\nAmong the chapters of *The Secret Teachings of the Dragon Gate*, only *The Song of the Minor Celestial Cycle* and this *Song of the Great Way* are confirmed as works of Patriarch Qiu. Though the principles in the remaining chapters are sound, they likely do not stem from his direct hand—this is evident in their differing diction and phrasing.\n\nThe year-long *wēnyǎng* (warm-nurturing) practice described above demands balanced *dìng* (stabilization) and *wàng* (forgetting). If one stabilizes for ten minutes, one must forget for ten minutes; if one stabilizes for an hour, one must forget for an hour; if two hours, then two hours of forgetting. For excessive forgetting chills the elixir, leaving it tender, while excessive stabilization dries it, rendering it overripe—only a state neither cold nor dry will suffice. At the outset, one must carefully maintain this balance; with prolonged practice, it becomes effortless, and spirit and qi will naturally sustain equilibrium throughout the day.\n\nThis year of warm-nurturing is specifically designed for the major celestial cycle, allowing the inner elixir’s generative medicine to circulate through the celestial orbit. Thus, upon completing foundational work, one must immediately undertake a year of warm-nurturing. Through unwavering devotion, the medicine accumulates bit by bit, gradually filling the body until it generates the *xiāntiān zhī xiāntiān* (prior Heaven of prior Heaven)—only then is one ready for the major celestial cycle.\n\nWhen warm-nurturing is complete and the medicine fully matured, a vision appears before the eyes: a black sphere with a white center, initially level with the navel, then gradually ascending to the space between the brows. With further nurturing, it transforms into a red sphere—this is the medicine employed in the major celestial cycle.\n\nAs the *Yellow Court Classic* states: *“Accumulate essence, amass qi to become true.”* Daily accumulation of generative medicine is precisely this “accumulation of essence and amassing of qi to become true.” Yet only with balanced stabilization and forgetting will there be tangible results. If this year of warm-nurturing is executed well, the major celestial cycle will proceed without peril. When natural spiritual awareness arises, stabilization and forgetting occur spontaneously and flawlessly. The success of the major celestial cycle hinges entirely on the quality of this year’s warm-nurturing—practitioners must take heed.\n\n**Fourth Lecture on the Oral Transmission of the Great Way**\nThe previous two sessions addressed warm-nurturing.\n\nWarm-nurturing the inner elixir aims to fill the entire body with it, transmuting it into golden liquid—this is called the *jīnyè huándān* (golden liquid returned elixir). Only when the golden liquid saturates the body can it generate the *wàiyào* (external medicine), known as the *dàyào* (great medicine). Most texts gloss over the details of this warm-nurturing and fire-regulation process, proceeding directly to the major celestial cycle after a hundred days of practice. In truth, though the inner elixir may form, it remains merely a *dānyuán* (elixir origin) and is not yet full—only after warm-nurturing and transformation can the major celestial cycle begin.\n\nAfter a hundred days, the elixir origin takes root in the lower field, called the *jīnggēn* (essence root). Only after warm-nurturing can it fill the entire body and transmute into golden liquid, becoming the *hùnyuán zhìjīng* (primordial perfect essence). All processes—gathering, sealing, refining—pertain to this primordial perfect essence. Once transmuted into golden liquid, the great elixir is born. The great elixir is the medicine of the major celestial cycle, possessing form and appearance—hence it is termed the external medicine or great elixir.\n\nBut to what degree must warm-nurturing progress before the major celestial cycle can commence? This must be understood. Through daily stabilization and forgetting, natural spiritual awareness arises, and the fire-regimen is thereby governed. Without relying on the *shíshén* (discriminating mind) for nurturing, water and fire naturally balance. Secure in this, one contemplates; through contemplation, one attains—once attained, it is eternally held.\n\nWith balanced stabilization and forgetting throughout the day, true breathing opens and closes imperceptibly. The inner elixir gradually transmutes into golden liquid, unbeknownst to the practitioner, who only senses the cessation of the six pulses, the return of qi to its root, the thinning of the pulse until it nearly vanishes, the halting of respiration, and the transmutation of red blood into white. Once the golden liquid is full, breathing shifts to the pores, and gradually, being arises from non-being.\n\nWhen the inner elixir is formed, the abdomen holds a treasure—like the *niúhuáng* (ox bezoar) in cattle. A person with inner treasure will manifest external signs: during warm-nurturing, a black circle (〇) appears in the space before the eyes, initially level with the navel, then gradually ascending and expanding. At first, it is visible only by lamplight, not in daylight, but later, it becomes visible even in sunlight. The object is white within and black without.\n\nAs the *Awakening to Reality* states: *“Within blackness lies white—the elixir’s mother; within the male, the female harbors the precious treasure.”* This “elixir mother” is the progenitor of the great elixir. Its form is spherical and hollow—hence it is called “female,” for it is empty within. This is the body’s treasure, both elixir and golden elixir, circulating along the path of the Yellow Court.\n\nAt this stage, one continues balanced stabilization and forgetting, neither clinging to nor rejecting the vision. When stabilization is due, stabilize; when forgetting is due, forget. After some time, the black sphere transforms into a red one. Initially, it is but a speck; with prolonged accumulation, it grows to the size of a tangerine—this is called the *zhūjú* (vermilion tangerine).\n\nOnce the transformation into the *zhūjú* (vermilion tangerine) is complete, this is the external elixir, the Great Medicine. The work of the Great Celestial Cycle should now commence. The elixir is originally the foundation of the internal elixir, nurtured and expanded through gentle cultivation until it gradually coalesces into a pearl, then into the vermilion tangerine. If one proceeds to gather and refine it at this stage, this is the practice of the Great Celestial Cycle.\n\nThe Great Celestial Cycle differs from the Small Celestial Cycle. For seven days, one remains in primordial chaos—this is what is meant by *“seven days of chaos, death and rebirth.”* Without this, the external elixir cannot form. After the seven-day death of the Great Celestial Cycle, one is reborn. During these seven days, one is no different from the dead, immersed in the state of chaos. Only through this seven-day death can one attain immortality for ten thousand years.\n\nThose who attain the internal elixir have merely returned the lost true yang to their bodies. From this point onward, gold is generated daily, and over time, one reaches the primordial before the primordial. Only with this substance can one dispel the yin qi of kalpas past, transform the hun and po of the entire body, and arrive at the realm of non-arising. The Dharma-body is established, and from it, the spirit emerges—thus, this practice is of utmost importance and must not be neglected.\n\nThis work is exceedingly difficult. In merely seven days, one must expel the discriminating mind, sever the hun and po of the intermediate state, and dissolve the karmic roots of past lives inherited from parents and accumulated through one’s own temperament, diet, and desires. It is only natural that various demonic obstructions arise. These demons are none other than the discriminating mind itself; the hun and po are the karmic roots left from kalpas past, ever-present obstacles to one’s entry onto the Dao.\n\nOnly after seven days of refinement are they transmuted. Thus, all events from one’s life surge into the mind, and all persons connected to oneself appear before the eyes—not only from this life but also from the beginningless kalpas of the past. Passing the Great Celestial Cycle is like crossing the Flaming Mountains in *Journey to the West*; one must use the Plantain Fan to quell the flames before the passage is possible. The fan, made of wood, belongs to Princess Iron Fan. She is the wife of the Bull Demon King, who represents *kūn* earth, while she embodies *duì* metal. One must employ the pure yin practice of returning to emptiness. The six lines of the *kūn* hexagram all represent empty states; everything must be voided—all dharmas and non-dharmas—equated with the Great Void before this perilous threshold can be crossed. If one cannot empty oneself, it is like adding fire to fire, and danger arises. Thus, one must proceed with the utmost caution.\n\nYet by this time, one has already undergone a year of gentle cultivation, and the practice of emptying has been long established. If one remains steadfast, naturally empty and hollow, perceiving forms without attachment, the passage will be secure. If not, and thoughts or attachments arise at this critical moment, danger lurks at every turn. Therefore, the year of gentle cultivation is of paramount importance.\n\nThe method lies in balancing stabilization and forgetting during gentle cultivation to harmonize water and fire. Once equilibrium is achieved, a black circle gradually forms. One continues the practice of balanced stabilization and forgetting. As it grows larger and black gives way to white within, the preparatory work for the Great Celestial Cycle begins.\n\nDuring the practice of stabilization and forgetting, if a white sphere suddenly appears within the black, visible even in broad daylight, one must increase forgetting and decrease stabilization—more time in forgetting, less in stabilization. For example, if one previously balanced two hours of stabilization with two of forgetting, now one should stabilize for an hour and a half and forget for two and a half, gradually increasing and decreasing accordingly.\n\nForgetting means emptying all thoughts. Stabilization still involves intention, retaining a trace of true intent, whereas forgetting eradicates everything, leaving nothing behind. Increasing forgetting and decreasing stabilization is the practice of *“reducing again and again, first reducing to benefit later.”* At this stage, forgetting must predominate while stabilization diminishes. For instance, if stabilization and forgetting were previously equal at two hours each, now one should stabilize for an hour and a half and forget for two and a half, progressively adjusting the ratio.\n\nAs the vermilion tangerine forms, the external elixir becomes ever more abundant, and the external circle grows larger. Stabilization still retains a dharma-form, though it arises from natural spirit-awareness; the primordial spirit must still exert effort. Forgetting leaves nothing behind, even the dharma-form is emptied. Stabilization involves subtle intent, the body of the Supreme Ultimate; forgetting is pure emptiness, the body of the Ultimateless. Stabilization employs natural spirit-awareness, while forgetting even this awareness is forgotten. Stabilization requires greater mental effort; forgetting arrives at the state of no-mind.\n\nThe more one practices forgetting, the more the external elixir flourishes. When forgetting reaches its peak and stabilization nearly vanishes, the vermilion tangerine radiates brilliant light, moving up and down before the eyes. At the time of the Great Celestial Cycle, one abandons stabilization and employs forgetting entirely, eradicating all things, knowing nothing, all phenomena stilled, utterly empty—merged with the Great Void. This is *“reducing again and again, until non-doing is attained.”* Reducing again and again means increasing forgetting and decreasing stabilization; non-doing is the time of great forgetting.\n\nThe *zhūjú* is also called the Fire Pearl, the Mysterious Pearl, the Mysterious Pearl at the Water’s Bottom, or the Fire Sphere in the alchemical classics. Now, the phenomena of the Great Celestial Cycle manifest. The signs are manifold, beginning with the Six Shocks: the six senses (eyes, ears, nose, tongue, body, and mind) tremble—this is the first.\n\nA breeze arises behind the brain—this is the second. Golden light appears in the eyes—this is the third. The nose twitches with qi, blocked and impassable—this is the fourth. The two kidneys boil like soup, the bladder burns with fire, and the inner kidneys feel scorched as if simmered in broth—this is the fifth. Externally, the Fire Sphere darts up and down—this is the sixth. These six phenomena all pertain to the body. The greatest danger lies in failing to forget the body and instead stirring thoughts; thus, forgetting is of utmost importance. One must remain utterly unaware, entirely forgotten, to proceed. If one cannot achieve great forgetting, the medicine will not ascend, and the elixir will not form. Only when completely forgotten, when the heart merges with the Great Void, does one refine the elixir within fire—hence the saying, *\"crossing the Fiery Mountain.\"* Yet even then, not a single form is grasped, not a single thought scattered; the body abides within the Great Void.\n\nThough this practice may seem difficult, it is not truly so. If one first masters the work of *wēnyǎng* (nurturing), forgetting will come naturally, and there need be no cause for concern. With *wēnyǎng* cultivated over time, one enters forgetting spontaneously, where the spirit remains aware yet still forgets and acts without doing. Once the Mysterious Pearl takes form, one forgets day by day, returning to the Great Void. At this stage, the practice becomes effortless—one forgets profoundly, merging with the Great Emptiness.\n\nThese six phenomena are called the Six Shocks in Buddhism. At this time, true yang is full within and without, expelling the yin qi accumulated over countless kalpas, giving rise to these various signs, like the body ablaze with *samādhi* fire. Beyond these six, there is another phenomenon: itching in the pores. The eighty-four thousand pores across the body itch like roasting beans, as the Golden Fluid flows outward throughout. This occurs during the moment of *cǎiqǔ* (gathering the medicine), when the generative essence arises.\n\nHere follows the *\"Rhapsody on Gathering the Great Medicine\"* from the *Secret Teachings of the Dragon Gate*, with detailed explanations below:\n\n“When the qi is full after a hundred days, the cessation of fire arrives; await the Three Arrivals to gather the primordial essence.” The Three Arrivals refer to the three manifestations of yang light. At this moment, one must cease the fire and gather the medicine, for the Great Medicine arises only when the qi is full after a hundred days.\n\n“When true earth seizes lead, it returns to the original cavity.” This is the qi returning to its root, and the hundred spirits likewise returning to their root.\n\n“When the dragon arrives from the east, the qi is full and spirit congeals.” This marks the appointed time. The preceding line speaks of lead; here, the Elixir is formed in the minor celestial cycle.\n\n“When Qian resides in Kun’s palace, form and spirit unite.” This is the work of regulating the firing times, the practice of settling into equanimity and forgetting. Qian is being; Kun is non-being. To return being to non-being is to abide in stillness and forgetfulness—this is the work of gentle nurturing. The alchemical texts all address this, and no further explanation is needed; this chapter contains only this one line.\n\n“After seven days, the celestial mechanism operates without intention.” The major celestial cycle is a fire without intention, unlike the minor cycle. In the minor cycle, there are sensations of yang stirring and rising—all these are intentional. Here, there is no intention.\n\n“Forgetting form and image, the true intention does not scatter.” This true intention arises naturally of itself, within the emptiness. Only by forgetting both form and image can the single point of true intention remain undispersed.\n\n“The Dao abides in non-action; to ask of it is to find no words.” This Dao resides entirely in non-action; it cannot be spoken, nor can any method be described. There is not a single thing, not the slightest effort.\n\n“In stillness, after one watch, the seven-day return comes.” Proceeding with utmost emptiness and profound stillness, the Great Medicine of the major celestial cycle is born, and the phenomenon of the seven-day cycle appears.\n\n“When the moon is full and its essence complete, the Great Medicine’s Dao is efficacious.” The full moon and complete essence are the Great Medicine—hence, “the Great Medicine’s Dao is efficacious.” At this time, before one’s eyes appears a bright moon shining at the window, and a red sun rises to meet it—this is the union of sun and moon. All these are external, illusory visions.\n\n“When gui arises within yang, the image of the fire pearl appears.” The fire pearl is a fireball. When the Elixir forms externally, the image of a fireball appears before the eyes, now rising, now falling, much like the fox’s alchemical refinement. The fireball’s ascent and descent are the rising and falling, the celestial cycle.\n\n“It ascends to Li’s position and returns to Kun’s origin.” The fireball ascends to the top of Li’s position and returns to Kun’s origin below the abdomen. Its rising and falling are visible to all, yet I am utterly forgetful, knowing nothing of any thing. At this time, externally, it ascends and descends, while internally, the true breath opens and closes.\n\n“Driven by the lower abdomen, it surges through the tailbone.” This ball also rises from the back and descends in front, rising and falling. When the qi is full, it ascends from behind and descends in front. At this time, the yang qi in the lower abdomen also surges upward from the tailbone toward the heart. When it reaches the tailbone, one may fear the Elixir will escape—this escape is like passing gas—so one must tightly contract the anus. Yet, having utterly forgotten both form and things, knowing nothing, one cannot perform this contraction. Thus, a method is needed to prevent this: use a wooden plug wrapped in cotton to seal the perineum. Since the qi surges downward, if the perineum is not closed, the Elixir may escape. This is the danger of the lower Magpie Bridge, requiring the sealing of the perineum. The danger of the upper Magpie Bridge likewise requires tightly sealing the nostrils.\n\n“All these are the power of the medicine, the natural celestial mechanism.” All the aforementioned surging through the tailbone arises from the medicine’s power and is the natural celestial mechanism. At this time, the true intention is one with emptiness, unaware and unknowing—it cannot be guided by intention. Those who claim it can be guided by intention merely understand the circumstances of this moment; all is the natural celestial mechanism.\n\n“The three cavities of the tailbone are filled with essence and marrow; to cross the Magpie Bridge, one must consult a true immortal.” The tailbone has three apertures, all filled with essence and marrow. An illustration clarifies this: (see Figure 2). When the three cavities of the tailbone are full, crossing this aperture requires consulting a true immortal. If one can surge through this cavity and ascend, the Great Medicine is obtained. Yet, even if the lower Magpie Bridge is crossed, failing to pass the upper Magpie Bridge’s danger results in gaining and then losing it. This qi crosses the lower Magpie Bridge and ascends, then passes the Gate of Life and the Jiaji Pass—together, these are the Three Passes, comprising nine apertures, known as “one arrow piercing nine layers of iron drums.” These nine apertures are all filled with essence and marrow; without the primordial true qi, they cannot be opened. Thus, the Three Passes and nine apertures can only be opened by the primordial true qi—nothing else can open them.\n\nTo traverse the major celestial cycle, there are four secrets: *absorb*, *close*, *contract*, and *lick*. *Absorb*: when the qi ascends and threatens to escape, if it does not proceed, use this method. When the force is weak and the qi pauses at the Gate of Life or other points, use gentle breathing to facilitate passage. When the pass cannot be crossed, one must gently apply stillness. This arises from insufficient yang; once the nurturing is complete and yang is full, this flaw disappears, and the method is no longer needed. Among the three hundred celestial cycles, only the first two require this; the rest do not.\n\n*Close*: this refers to closing the lower gate (anus). *Contract*: when ascending the Magpie Bridge, one must block the nostrils. *Lick*: this means licking the upper palate. Some interpret *absorb* as internal breathing, *close* as sealing the six gates, and *contract* as contracting the lower gate. If examined literally, however, *absorb* and *close* are merely illusory appearances, and these techniques need not be physically performed. Others take *close* to mean tightly sealing the gates—where the six sense gates may all be called \"mouths,\" aligning with the aforementioned sealing of the six gates.\n\nThe major celestial cycle must be completed three hundred times, finished within seven days. The great stabilization is achieved in seven days, culminating in the work. At this stage, one undergoes a great death, seeking life within death, reviving after death—all pertains to the major celestial cycle. When the cinnabar orange arrives, it may be gathered; this is self-generation and self-gathering, distinct from the minor celestial cycle’s gathering.\n\n**Fifth Lecture on the True Oral Transmission of the Great Dao**\nThe chapters following *Ode on Gathering the Great Elixir* in *Secret Essentials of the Dragon Gate*, which intermingle the practices of the major and minor celestial cycles and present them in unclear sequence, must be carefully distinguished. Here, *Ode on Obtaining the Great Elixir* is explained as follows:\n\n*\"The coccyx lies below, where the zi and chen hours wax.\"* The coccyx is at the end of the zi hour. Zi is the time when the elixir is born. \"The coccyx lies below, where the zi and chen hours end\" means the coccyx is behind the yinqiao aperture. From zi to si are six hours; from *Fu* to *Qian* are six hexagrams. The coccyx lies between chou and lin, the Gate of Life between yin and tai, and the crown of the head at si and *Qian*. This is clarified by the accompanying diagram.\n\n*\"The twenty-four vertebrae mark the beginning of the bone joints.\"* From the coccyx to the base of the skull are twenty-four vertebrae. The first joint, the coccyx, corresponds to the end of the zi hour—also the first of the bone joints. (See Diagram Three)\n\n*\"The scorched land of the nine apertures, the crossroads of the three forks.\"*\n\nThe three-forked crossroads are the single aperture of the yinqiao vessel. The nine apertures arise because each of the three barriers has three openings, thus three times three makes nine. The Buddha said, “An arrow pierces nine layers of iron drums”—this is the meaning. These nine apertures are all filled with marrow, and only the primordial qi can pass through them.\n\nWhy does each barrier have three openings? In the transmission of the middle and lower-grade elixir methods, there are three rivers named: the River of Spirit, the River of Essence, and the River of Qi. The elixir is the great medicine formed by the coalescence of essence, qi, and spirit—these three. When the great medicine ascends, the River of Spirit flows in the center, while the River of Essence and the River of Qi flank it on either side. The three proceed separately, each through its own aperture, hence the names. Yet when they move, they move as one; when they rest, they rest as one.\n\n*“The central three apertures, where spirit, essence, and qi flow”*—this refers to the three central apertures, where spirit, essence, and qi are distinguished. These are metaphorical expressions; in reality, one cannot perceive three separate openings nor discern how they traverse, only that a warm current ascends.\n\n*“The postnatal blood vessels course below”*—the primordial qi, which opens the barriers, is formless; one can only sense the warmth ascending, without shape or appearance. Once the primordial qi has opened the barriers, the postnatal blood vessels also traverse them. In those of postnatal constitution whose barriers remain closed, after the great celestial circuit opens the barriers, the blood vessels course through them. Through this refinement, red blood is transformed into white.\n\n*“This realm is most solid, impervious to true essence”*—it is sealed and impenetrable, and only the primordial qi can pass through. The three barriers and nine apertures are inherently blocked.\n\n*“To cross the yin barrier, one must know the Mysterious Emperor”*—to open this barrier, one must know the Mysterious Emperor, the True Martial Sovereign of the Dark Heavens of the North—this is the yang within Kan, the true yang within the Gate of Life. “Must know” means uniting the external medicine with the true yang in the Gate of Life; only when the two, being of the same kind, resonate can the barrier be opened. This is also called the Five Dragons.\n\n*“Cast the body into the ravine, where the Five Dragons manifest their efficacy”*—the body here is the dharmakāya. When qi penetrates the lower abdomen, a natural spiritual awareness arises, and the image of “the Five Dragons bearing the Sage” appears—this is the efficacy of the Five Dragons. That is, the great medicine of the primordial five-phase true qi has reached the coccyx, where the five are refined into three, and the three into one, gathering into a single qi. Only then can it ascend and open each barrier, hence “the Five Dragons manifest their efficacy.”\n\nBut where precisely is this practice applied? The five belong to earth, the center; the center is emptiness. It is complete emptiness—true emptiness. This corresponds to the stillness of both body and mind, where natural spiritual awareness merges with the great void, enabling ascent. If not utterly empty—if there is intention or attachment—it cannot ascend. One must forget all and empty the self to be in accord with the method. The dragon is a creature of unfathomable transformation; if true intent reaches the state of true emptiness, qi will naturally ascend, and the Five Dragons will emerge.\n\n*“Bearing the supreme body, it rises gently”*—the supreme body is the great elixir, the great medicine. Rising gently, it ascends from the coccyx.\n\n*“With harmonious breath and empty intent, it naturally ascends”*—only here is it explained how ascent is achieved: through the union of true breath and the primordial intent of true emptiness, it naturally rises. One must utterly forget, merging with the great void, to ascend spontaneously—this is “the Five Dragons manifest their efficacy,” also “the Five Dragons bear the Sage.”\n\nBreath here is empty breath, true breath.\n\n*“The six gates are sealed externally, while a single qi revolves within”*—at this stage, the ears hear nothing, the eyes see nothing, the mind is devoid of objects, and only in complete return to emptiness can the true yang qi ascend. If the six senses attach to phenomena, the celestial circuit cannot revolve. Hence it is said: seven days like death, in a state of undifferentiated chaos, the six gates sealed. “Revolves within” means ascending.\n\n*“The three barriers and nine apertures are distinctly clear”*—in the minor celestial circuit, qi ascends and descends, yet one remains unaware, and the three barriers and nine apertures are indistinct. Here, they become distinctly clear. The fire pearl, obtained from the Mysterious Emperor of the North, is called the Mysterious Pearl or Fire Pearl. Externally, it appears as a spherical form; internally, it radiates warmth. As the fire pearl ascends, it is distinctly perceived—this is natural spiritual awareness. One knows where the medicine has reached, yet remains unaware of all else.\n\n*“Yang essence returns upward to the pulse barrier”*—having passed the three barriers and nine apertures, the yang qi reaches the crown of the head—this is arriving above the pulse barrier. As the *Awakening to Reality* says: “Planted in Qian’s palace of mutual resonance.”\n\nUpon reaching Qian’s palace, the medicine is obtained. From Qian’s palace, it descends—this is the action of reducing the fire, passing through the Flame Mountain where the fire is extinguished.\n\n*“The silent Mysterious Pearl rolls past Kunlun”*—the crown is Kunlun Mountain. Ascending along the spine to the crown and then descending is rolling past Kunlun.\n\n*“Bearing the azure sky on its back, it then turns southward”*—this alludes to the first chapter of *Zhuangzi*, “Free and Easy Wandering,” whose essence lies in “taking from Kan to fill Li.” It says: “In the northern darkness there is a fish, its name is Kun.”\n\nThe Kun is so vast that none knows its measure in thousands of *li*. It transforms into a bird, whose name is Peng. The Peng’s back is so broad that none knows its measure in thousands of *li*. When it rouses itself to flight, its wings resemble clouds hanging from the sky. This bird, when the sea surges, will migrate to the Southern Darkness. The Southern Darkness is the Celestial Pond.\n\n*The Qi Xie* is a record of marvels. It says: When the Peng migrates to the Southern Darkness, it strikes the water for three thousand *li*, then spirals upward on the whirlwind to ninety thousand *li*, departing with the winds of the sixth month. It also says: If the accumulation of wind is not thick, then it has no strength to bear great wings. Thus, only at ninety thousand *li* does the wind lie beneath it, and only then can it ride the wind. Bearing the azure sky on its back, with nothing to obstruct or hinder it, only then does it turn southward.\n\nThe dark and vast Kun is none other than the Mysterious Pearl. Ascending is reaching the crown and then turning south—this is the \"turning southward.\" The \"winds of the sixth month\" signify passing through the six trigrams and the six periods. Those who understand the Dao recognize this chapter of *Zhuangzi* as describing the workings of fire-phase cultivation; those who do not remain ignorant of its meaning.\n\n\"Turning southward\" means descending after reaching the south—this is one ascent and one descent, rising from the back and descending from the front, which is also yang ascending and yin descending.\n\n*“Stretching and bending, it models the cyclic rounds of Heaven”*—stretching and bending are yin and yang. Modeling Heaven is the celestial orbit.\n\nWhen the Mysterious Pearl rolls past Kunlun, it encounters the peril of the upper Magpie Bridge, located between the Hall of Light and the root of the nose. Thus, upon reaching the Hall of Light, one must guard against danger. The perils of the upper and lower Magpie Bridges are the same, both consisting of one solid aperture and one hollow aperture alternating. The upper root of the nose is the solid aperture; the nostrils are the hollow apertures. The lower coccyx is the solid aperture; the anus is the hollow aperture. The hollow has a gate, while the solid contains marrow. The solid cannot be traversed, and if one fears leakage through the hollow, then below it is the loss of the elixir, and above it is the leakage of the elixir—both are unacceptable.\n\nAt this stage, there is no cessation of breath, and with no external respiration through mouth or nose, it may seem harmless. Yet this is a well-trodden path, and the slightest inattention may still lead to leakage. To prevent this danger, there is a method: one may use cotton to block it. In truth, whether blocked or not matters little; what is essential is that the mind merge with the Great Void and follow nature, allowing the descent to proceed without peril.\n\n*“Upon reaching the Hall of Light, one must guard against danger”*—at this moment, one must not initiate any physical breathing, for with breath comes leakage. Hence, it is said one must guard against danger.\n\n*“Swiftly gather the golden elixir and ascend to secure the Cinnabar Field”*—having reached the upper Cinnabar Field, the elixir is obtained, and one must ingest and consume it within the abdomen. In truth, it is not eaten but flows downward naturally from the upper Cinnabar Field—this is the “sweet dew sprinkling Mount Sumeru.” This sweet dew is a watery fluid. As in *Journey to the West*, when passing Flame Mountain, forty-nine sweeps of the plantain fan first bring a fine rain, followed by a great downpour.\n\n*“From here it descends, flowing naturally into the mysterious viscera”*—following the current downward, it naturally reaches the organs.\n\n*“Gently tilting the face upward, the tongue licks to welcome it”*—to guard against the peril of the upper Magpie Bridge, the tongue must press against the upper palate, the face slightly raised, allowing the sweet dew to descend. Some say this dew is born from the mysterious larynx.\n\n*“The medicine pierces the tip of the tongue and descends through the Tower of Nine Stories”*—this medicine follows the tip of the tongue, passing through the Tower of Nine Stories and entering the abdomen. The Tower of Nine Stories is the throat. In truth, the elixir descends on its own, but as it passes through the throat, it is also called “ingestion.”\n\n*“Called ingestion, it ascends the steps gradually”*—this practice must proceed step by step, stage by stage.\n\n*“Meeting in the Crimson Palace, water and fire achieve harmony”*—the Crimson Palace is the small void within the Mud Pill Palace. Reaching the Crimson Palace is the harmony of water and fire, at which point true yin merges and ascends, transforming into sweet dew. Only upon reaching the Crimson Palace does one obtain primordial true yin; hence, it is called “meeting.” True yang and true yin meeting is the harmony of water and fire.\n\n*“Returning to the Imperial Homeland, one attains unity and returns to the root”*—after ingestion comes the returning elixir, which is attaining unity and returning to the root.\n\n*“The spirit and essence contain movement, gold resides within; only then is the elixir obtained and the foundation of the spiritual embryo laid. The hundreds of channels and vessels return to their original positions; externally shielded, internally purified, the Supreme Ultimate is perfected and true.”*\n\nThe four lines above describe the effects after the first completion of the great celestial orbit and the attainment of the elixir. The great celestial orbit practice rises from the back and descends from the front, circling three hundred times over seven days, with no fixed count per day. What is discussed here pertains to the first cycle of practice; if the first cycle proceeds smoothly, then naturally and steadily, without difficulty, it culminates in great forgetfulness, the spiritual embryo forms, and one may achieve spirit departure.\n\nAfter completing the great celestial orbit, the hundreds of channels and vessels return to their positions, the six senses are extinguished externally, and the seven emotions are eliminated internally. From this point, emotions and perceptions vanish, returning to the truth of the Supreme Ultimate. The practice is completed in seven days, though some achieve it in five. With refined cultivation, the process naturally accelerates.\n\nThe following passage states:\n\n*“The six roots extinguish perception, the six kinds of shaking arise; the eyes emit golden light, the vulture cries behind the brain; the two kidneys seethe like boiling water, the Cinnabar Field blazes with fire; the body surges, the nose twitches, the ears generate wind; true qi becomes breath, all manifest signs; spirit and essence unite at the center, eternally attesting to longevity; transcending the realm of essence, one verifies true non-leakage; no longer transforming essence, the central qi is heaven-perfected; this forms the divine substance, the voice first emitted; the great celestial orbit begins, refining qi to transform spirit.”*\n\nThe above ten lines describe the visions preceding the Great Celestial Orbit. Once the foundation is firmly established and the nurturing phase is complete, one attains permanent \"non-leakage.\" Thereafter, one must refine *qi* to transform spirit, experiencing the six kinds of shaking, thus entering the practice of the Great Celestial Orbit.\n\nThe perils of the Great Celestial Orbit lie in the surging of yin demons and the dangers of the upper and lower Magpie Bridges. The upper and lower Magpie Bridges need only be cautiously avoided during the first attempt, after which they pose no further threat. The Great Celestial Orbit also spans three hundred cycles; once the practice becomes proficient, demonic obstacles arise before the eyes. For this Great Celestial Orbit is the refinement of the body with the fire of samadhi, expelling all yin *qi* from the heart. Yin *qi* is the demon—all karmic roots from past lives, the inherited *qi* and temperament from parents, and the influences of food and desire—all are demons. When the practice is mastered, the greatest difficulties often arise on the second day of the seven-day cycle. At this time, the fireball surges up and down; when it rises, the heart’s blood stirs, and all past actions manifest before one’s eyes. Matters of sound and form, wealth and profit, greed, anger, delusion, and attachment—all that is sorrowful, joyful, lovable, or fearful—appear in myriad forms, without exception. Not only events of this life but also those from past kalpas arise vividly. Thus, in cultivating the great samadhi, one must remain unmoved by whatever arises.\n\nHeavenly and earthly demons may also test one’s steadfastness: if the heart clings to feminine beauty, celestial maidens of divine loveliness may appear; if it covets silver and gold, mountains of treasure may be offered for the taking. All such external manifestations are called heavenly demons. Earthly demons, though externally induced, are also stirred by one’s own heart. Other apparitions may include lifelong friends or deceased relatives and companions. Yet these are not real people or ghosts—they are but demons of the heart. During the seven-day Great Celestial Orbit, the wailing of spirits and the howling of demons reach their peak by the fifth or sixth day; by the sixth day, they begin to subside, and by the seventh, all is calm.\n\nThe so-called three disasters and eight difficulties must be overcome by illuminating the mind and seeing one’s true nature—this requires the true intent to return to emptiness. If one can abide in emptiness, all obstacles vanish. First, through nurturing, one gradually forgets and diminishes attachment until complete emptiness is attained. If one can reach the state of undistracted focus and thought-free stillness—what the Confucians call \"utmost sincerity\"—only then is the heart sufficiently refined to undertake the Great Celestial Orbit.\n\nThe cultivation of the Dao depends entirely on virtue, which resides in not being stained by the six dusts or attached to the four appearances. Thus, the *Vajracchedikā Sūtra* states: *\"If one can refrain from abiding in appearances, their merit is immense.\"* To reach the state of emptiness beyond emptiness—without heart, without things, without self, without others, unattached to any appearance—is to attain the greatest merit. *Laozi* says: *\"By forgetting the self, the self is perfected; by forgetting the form, the form endures.\"* Within the act of forgetting lies three thousand eight hundred virtues. To achieve great forgetting is to accomplish the Great Celestial Orbit, allowing the spirit to depart, and the task is complete.\n\nThe subsequent practice of returning to emptiness may or may not be undertaken. After seven days of the Great Celestial Orbit, the external red orb transforms into a purplish-golden light that envelops the entire body. There is also a secret formula for the departure of the spirit. The purpose of the Great Celestial Orbit is to refine and dissolve emotional consciousness, transmuting it into the yang spirit. Once this is achieved, no karmic roots of emotional consciousness remain, and thus no yin *qi* persists.\n\nThis practice should not be feared as excessively difficult; by following the method step by step, success is assured. At this stage, the four prerequisites—method, wealth, companions, and place—are indispensable. The place must be a secluded mountain forest, its feng shui examined to avoid inauspicious influences, ensuring a tranquil and serene environment. Companions must number at least three to take turns in attendance, as one alone is insufficient.\n\nThe method refers to the oral instructions for the Great Celestial Orbit. Wealth pertains to provisions for clothing and sustenance, which must be prepared in advance. If, after undertaking the Great Celestial Orbit, the great elixir does not manifest, or if the red orb appears but *qi* fails to arrive, Daoists attribute this to insufficient virtue and advocate charitable giving to accumulate merit. For the elixir is a heavenly treasure, while wealth is a worldly treasure—one must offer wealth to the heavens, vowing to resume practice. Confucians attribute it to inadequate self-cultivation, hence the lack of response. Buddhists attribute it to past karmic obstructions, which must be repented and expiated. The Buddhist explanation is somewhat vulgar; the Daoist explanation, though profound, is overly abstract.\n\nOnly the Confucian explanation is most apt. After receiving his master’s transmission, Bai Yuchan believed this Dao could surely be attained and immortality surely achieved. Yet when the moment came, he faced the peril of \"midnight wind and thunder\" and privately resolved to abandon his practice. The Perfected Zhang Ziyang, learning of this, sent from Tiantai a scroll of *Four Hundred Words on the Golden Elixir*. Upon receiving and reading it, Bai grasped the subtleties of the firing process, resumed his practice, and succeeded. His initial slight negligence had led to this peril. Even Lü Dongbin, in performing the Great Celestial Orbit, failed three times before studying the *Mirror for Ingredient Entry*, resuming his practice, and succeeding. This was because the transmission from Ancestor Zhong had not been fully embodied by Ancestor Pure Yang. For the most minute details, if not attended to, will prevent success. The *Awakening to Reality* states: \"A hair’s breadth of deviation, and the elixir will not form.\" Scholars must ponder this deeply!\n\nSixth Lecture on the Oral Instructions of the Authentic Transmission of the Great Dao\n\nAfter the ascent and descent of the Great Celestial Orbit, one refines *qi* to transform spirit. In the Lesser Celestial Orbit, refining essence transforms it into *qi*—gathering the primordial supreme essence, accumulating and congealing it to transmute into the *qi* of Grand Unity containing true reality, whereby the generative essence is likewise transformed. Once generative essence is transformed, one remains unmoved by desire. Refining essence into *qi* forms the inner elixir, which, through the alchemy of golden fluid, attracts and coalesces into the true *qi* of yang. Combined with the yang essence already attained, it is forged by spirit into the Great Elixir. The Lesser Orbit yields the inner elixir; the Great Orbit yields the outer elixir. The inner is the yin elixir; the outer, the yang elixir. The yang elixir can forge the consciousness-spirit, returning it to the storehouse of consciousness, merging with the Great Void, and severing the roots of karmic action.\n\nWhat the Lesser Celestial Orbit attains is the \"prior-to-heaven within the posterior-to-heaven\"—this is primordial *qi*, and primordial *qi* congeals into the inner elixir. Passing through the Great Celestial Orbit, it is transmuted into golden fluid, producing the Great Medicine. Before ingestion, it is medicine; after ingestion, it is elixir—this is the \"prior-to-heaven within the prior-to-heaven,\" the transformation of spirit. The \"prior-to-heaven within the posterior-to-heaven,\" when steamed and refined, generates a red orb—this red orb is the outer elixir. Tempered by the fire of samadhi into a crimson hue, it is the fire of *qi*. Thus it is said: refining *qi* transforms spirit, and through this *qi*, spirit is transformed. Expanding and filling it, one may exteriorize spirit; expanding further, one returns to emptiness.\n\nSpirit is one; *qi* is two; essence is three. From three to two, from two to one—attaining the One, one attains spirit. This One is nature; empty nature is numinous emptiness. Those who cultivate the Dao thereby attain the six penetrations. Divided into three, it is not numinous; united as one, it is numinous. The true yang *qi* within the void of heaven and earth is the principle-*qi* of the Supreme Ultimate—most numinous indeed. Transformed into spirit, it transcends the Two Modes, Four Images, Five Phases, and so forth—hence, it is spirit. The *Doctrine of the Mean* states: \"As a thing, it is without duality, and thus its generation of things is unfathomable.\" Standing alone without counterpart, it is therefore boundlessly transformative and numinous.\n\nSpirit is that which transforms the myriad things. To be greatly transformed is to become a sage; to be a sage yet beyond knowing is to be spirit. The sage may still be spoken of, but spirit is difficult to know. Reaching vastness, exhausting subtlety, attaining utmost clarity, embracing profundity and enduring without limit—Daoists call this immortality, Buddhists name it bodhisattvahood, both connoting eternal omnipotence. After completing the Great Celestial Orbit, it is called the spirit elixir—this elixir is the yang spirit.\n\nWhen the fire orb is external, yang remains outside; after seven days, yin is exhausted and yang is pure, uniting with spirit in virtue. The various demonic obstacles that arise externally are the roots of karmic actions accumulated through kalpas past. Now they all manifest, for the mind-spirit is most numinous, and the consciousness-spirit is likewise numinous. Due to experiences from kalpas past, impressions linger within consciousness; now, as they are to be transformed, they must appear once more. The ancients spoke of the seven days of the Great Orbit as refining yin demons. When the impressions of the consciousness-spirit are transformed, they unite with the external yang spirit to accomplish the Dao—this is what is meant by \"both form and spirit are transformed.\"\n\nOnce the yin of the consciousness-spirit is fully dispelled and the roots of karma are severed, consciousness becomes utterly empty, merging with the empty substance of primordial spirit. Thus form and spirit are both transformed—gathered, they form a body; dispersed, they become *qi*. After the Great Celestial Orbit, the essence and blood within the body transmute into white paste, while the bones and flesh become exceedingly firm, enduring without decay. Yet ultimately, they remain heavy and turbid, unable to ascend. That which forms images in heaven is the exteriorization of primordial spirit; that which forms a body on earth is the relinquishment of the physical husk to the earth.\n\nOnly when the physical form is perfected does it become an indestructible vajra body, which perishes only when heaven and earth collapse—nothing else can destroy it. When spirit departs and the husk remains on earth, it endures without decay. The nails, hair, and eyebrows—appendages of the bones and flesh—are sustained by the numinous *qi* within the bones and flesh, allowing them to continue growing. To illustrate: at the Supreme Clarity Palace on Mount Lao in Qingdao, Shandong, there resides a Daoist cultivator, said to be from the Ming dynasty. To this day, he sits upright within, neither eating, sleeping, nor speaking.\n\nEach time a local official was replaced, another seal was added to the door. Though the chamber had fallen into disrepair, the Daoist remained seated motionless within. All who saw him beheld his nails, grown so long they coiled three times around his waist. Such cases exist in every province. After hundreds of years, the fleshly body remains as if alive, and the nails and hair continue to grow.\n\nDuring the late Qing dynasty, Jin Fu, the River Conservancy Director of Shandong Province, was overseeing dike construction along the Yellow River when an ancient coffin was unearthed. The coffin crumbled upon exposure to wind and sun, yet the body inside remained intact, its hair exceedingly long and its nails coiled several times around the corpse. As it was an unidentified ancient remains, some proposed cremation. Just as the fire was about to be lit, a great thunderstorm erupted, halting the proceedings. That night, as Jin Fu worked in his office, a man in ancient robes and cap appeared before him, saying: “I am one who attained the Dao. My body remains imperishable. Since you are building a dike, I ask that you rebury me elsewhere—any place will do—but do not burn me, for fire would bring misfortune upon you.”\n\nIn the Song dynasty, an official overseeing construction unearthed an ancient tomb. When the coffin was opened, the corpse appeared as if alive, resembling a person from the Han era. As the onlookers watched, the corpse suddenly sat up. Those who lingered nearby saw it open its eyes, gaze heavenward, and say: “Why has the sky grown so low, much lower than in my time?” Having spoken, it lay back down and did not rise again. Upon consulting historical records, they learned it was a certain Daoist cultivator from the Eastern Han dynasty and reburied him as before. All such cases occur because, through refinement, the yin within the body is exhausted, allowing the flesh to remain imperishable for eternity.\n\nThe ascent and descent follow this pattern: rising from behind and descending in front. When ascending, the heat resembles a ball of fire, rising along the Governing Vessel to the crown, where it lingers briefly before descending via Kunlun to the Hall of Brightness and entering the mouth—this is called “ingesting the returned elixir,” or “white clouds ascending to the summit.” The descent is “sweet dew sprinkling Mount Sumeru.” When the elixir reaches the mouth, it is but a few drops, and later only a single drop, descending past the Celestial Ladder. Though the substance is scant, its effect is profound, producing a sound like thunder.\n\nWhen the great medicine enters the abdomen, it is called “obtaining the elixir.” Occurring several times a day, after accumulating three hundred such instances, the fireball before the eyes transforms into a red-purple light that envelops the body. Initially, it covers only half the body, gradually extending to the whole. The person becomes dazed and ethereal, as if amid clouds and mist, the light a deep red. This process involves methodical effort and sequential stages.\n\nAfter seven days, the red light suffuses the entire body—this light is the yang spirit of the practitioner, marking the initial step. One must then apply the work of nurturing, which in elixir methods is called “bathing” and “nursing.” The great celestial cycle has no fixed pattern and is purely a matter of forgetting. At this stage, one must employ even greater forgetfulness.\n\nOnce the yang elixir is obtained, the spirit shifts to the upper field, merging one’s emptiness with the emptiness of heaven and earth. When released, it pervades the six directions. At this time, the body and mind still require profound forgetting, while one subtly employs spiritual awareness to sense one’s own small emptiness merging with the vast emptiness of heaven and earth. When the emptiness of heaven and earth becomes one’s own emptiness, and one’s own emptiness becomes that of heaven and earth, then one’s spirit dwells within heaven and earth, while one’s *qi* envelops them beyond. This is the work of nurturing practiced after refining *qi* into spirit and before returning to emptiness.\n\nAfter completing the minor celestial cycle, essence becomes full and desire for sensuality ceases. After the great celestial cycle, *qi* becomes full and the desire for food vanishes; spirit becomes full and the desire for sleep disappears. One abides in great stillness throughout the day, neither eating nor breathing. Within one’s own emptiness, merged with the emptiness of heaven and earth, this state lasts at least a hundred days, at most three hundred. For those of keen spiritual roots, it may be instantly realized. The purple-red light suffusing the body gradually transforms into a purple-gold light, then into a golden light that envelops the body. As *The Understanding Reality* says: “Lately, a golden light manifests throughout the body; I do not speak of this method to others.”\n\nWhen the red light envelops the body, immortals and buddhas become visible. Upon transforming into golden light, one may commune with divine beings. The oral instructions for refining spirit and returning to emptiness, for magnifying the yang spirit, lie entirely in the two phrases: “with one’s own emptiness, merge with the emptiness of heaven and earth.”\n\nAfter the golden light envelops the body, several or even dozens of days later, the golden radiance suffuses the entire body and rises to cover the crown. Initially small, it gradually expands until it becomes as large as a cartwheel—this is the moment of spirit departure. When the yang spirit is fully capable of exiting, the guardian companion, seeing the golden light grow as large as a cartwheel, should announce: “Depart!” to rouse the practitioner to exit swiftly. If still unresponsive, the companion should announce it again. At the slightest stirring, the spirit will depart.\n\nThere is an ancient account of one who severed his arm to exit the spirit. Lan Yangsu, for instance, was in the midst of a spirit-departure vision yet remained unaware. As time passed and his spirit did not emerge, even after Master Zhong’s guidance, it still did not depart. He then forcefully severed his arm, and the shock caused his spirit to exit at once. Had a companion been present to startle and alert him earlier, the stirring would have allowed the spirit to depart with the golden light.\n\nAt this stage, one has already entered profound forgetting, and awareness does not respond without external stimulus—someone must announce it. Lan’s spirit did not depart because, though the vision had arrived, he remained unaware, causing the spirit to stagnate within. With true intent unmoved, severing his arm startled him into sudden awareness.\n\nWhen the spirit first departs, the yang spirit is still immature, its courage feeble—it must not venture far, and upon exiting, must be drawn back at once. It emerges with awareness stirring and returns with awareness stirring. Initially, it may travel only five or ten paces, or thirty or forty, gradually extending farther, to five *li* or ten *li*. With constant practice, when mastery is achieved, the spirit may go wherever intent directs. Only when it can reach five hundred *li* or a thousand *li* may it be put to use. At first, upon arriving at a place, the spirit may linger for a time—whether a quarter-hour or half an hour—before being recalled. If it can travel a thousand *li* and remain for an hour, then traveling ten thousand *li* is no different. At this stage, the spirit’s efficacy in performing various acts grows with the distance it can travel and the duration it can remain—greater range and longer stay make the spirit more potent. When the spirit can be sent forth and recalled at will, the practice is complete, and the yang spirit may then penetrate earth and ascend to heaven. Gathered, it takes form; scattered, it becomes qi. When gathered, it appears as a person; when scattered, it dissolves into qi, able to transform at will. Yet at this stage, it remains a single spirit and cannot yet manifest multiple bodies. With further progress, it may divide into many.\n\nThe departure of the spirit is the refinement of spirit into emptiness; the manifestation of multiple bodies is the refinement of emptiness to merge with the Dao. The Dao is fundamentally empty, nameless, and formless—refining emptiness to unite with it is called by Daoists “shattering the void,” by Buddhists “a thousand hundred million transformed bodies,” and by Confucians “when released, it pervades the six directions; when withdrawn, it retreats into secrecy.” At this point, one may act as one wishes: if seeking liberation, one may shed the physical shell and depart; if choosing to remain in form to save the world, one may continue refining with the body intact.\n\nRefining emptiness to merge with the Dao means returning one’s yang spirit to the void, dissolving within it. Practicing with the body retained is what Buddhists call the “nine years of wall-facing” discipline. The “nine years” is a figurative term—duration is not fixed by years. With long cultivation, the number of transformed bodies increases: from one to three, from three to nine, from nine to eighty-one. After nine years of practice, one may manifest countless bodies. The time required depends entirely on the sharpness of one’s faculties. Those with keen faculties may achieve this in a single day, or even attain instantaneous mastery—progress is swift. Those with dull faculties require more time. Yet this practice has no limit: the longer one applies effort, the greater the spiritual powers. Even celestial immortals cultivate this way.\n\nManifesting a thousand hundred million dharma bodies to fill the cosmos is the state of the Great Awakened Golden Immortal—this is the Buddha. In cultivation, one becomes utterly empty, merging completely with the void. Ultimately, one may fill the three-thousandfold great-thousandfold world with the countless transformed bodies of the Ganges’ sands—what spiritual powers would then be unattainable?\n\nIn Daoist practice, few retain the physical body after the spirit departs, for most regard the shell as a burdensome growth and prefer to discard it. Buddhists, however, often retain the body to advance toward complete mastery. In truth, whether one keeps the body or not matters little to oneself; the difference lies in the convenience it affords when performing deeds to benefit others. The methods of salvation differ between Buddhists and Daoists. Yet once the Dao is attained, both must use it to benefit the world.\n\nDaoists typically shed the physical shell, entering the world with the yang spirit to save others while continuing to refine the yang spirit to merge with the Dao. When the Perfected Zhang Sanfeng appeared before the Ming Emperor Chengzu, he flew into the court as a yang spirit and declared, “I am not Zhang Sanfeng—I am Zhang Sanfeng’s yang spirit.” By the time the Perfected One was in Yangzhou, he had already transformed his body, entering Mount Wudang with his yang spirit to refine the practice of merging with the Dao while performing salvific deeds. Later, he traveled the world—all as a yang spirit. Buddhists, however, do not consider traveling the world a means of salvation; they remain where they are to save others, often retaining the body. If one wishes to travel the world to save others, it is more convenient to do so without the body.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "大道真传   西蜀魏尧则之口述　浙东陈威公孟笔记 道自心中求，心空道可修。 若为希福果，尚隔一江舟。 诸生于道已得，执着人我即非，务要放下身心，乃能冲开龙虎。 自修自检，克念克思，贪嗔不起，一意存诚，道义之门，便是玄牝。 一朝得药，遍体生春，那时德馨，香如桂花，津甜如蜂蜜，乃知其好处。 务竭诚努力，勿误勿怠，切切勉之！ 劫运已兴，道运亦启，切勿自己耽延、负天恩也！ 慎行之！ 审修之！ 切切！ 切切！ 大道真传口诀第一讲 何谓小周天之火候？ 夫候者，时也。 以活子时、活午时之候，候其时到而起火，故曰火候。 火，离也，心中之神也。 用火皆心神之妙用，妙在于觉。 以自然神觉，修天然之火候以炼大药，其中有一定之规矩。 丹经中皆照规矩说法，其实自自然然，不必有意去用功，自然无为而无不为。 此中火候，皆修天然之次序而出，可以证验者也。 然必修自然，乃有神觉，若稍不自然，则神不灵，因着相动念之故，而火候亦时生错误，故吾以“自然神觉”四字名之，丹经谓为黄婆。 黄，婆之色。 婆者，纯坤之象，又取其婆心柔顺也。 《西游记》唐僧九九八十一难，皆火候之错误也。 其间遇魔之因，不为斋，即因借宿，皆缘衣食住之故，人因此生贪求之心。 盖人心中有食色之性，与生俱来，此性半禀诸父母，半受于中阴。 父母食色之遗传于我，一也； 中阴乃历劫食色之业根据于我之心地，二也。 有此二者，因而生贪、嗔、痴、爱之心，无时或已，稍一不慎，生心动念，火候即错误矣。 猪八戒动言散伙，即火分散也。 火候唯小周天最要，至大周天则自然神觉已全，故错误较少。 在小周天则或灵、或不灵，故须步步照管，丹经皆详为解说，职是故也。 《悟真》曰：“毫发差殊不结丹”，可知火候断不可误也。 然因详述之故，学者转入岐途，譬如用九、用六、乾策、坤策之说，事实并非如此，不过有此理而设此象耳。 若照书死做，即着相矣。 《龙门秘旨》中，邱祖有《小周天歌诀》，若照歌诀下工，亦不合也。 柳华阳真人《风火经》亦详讲火候，皆以色身比相，行火之时，其不能执句下工，亦与《小周天歌》同也。 何者为火？ 自然神觉是也。 何者为药？ 先天之一炁是也。 此从“药火”上说。 若从“炼”字上说，则气是炉也； 神是炉中之火也； 虚空一窍是鼎也，神气合而招摄之先天炁即鼎中药物也。 白玉蟾曰：“以火炼药而成丹，即以神驭气而成道。 ”李清庵曰：“为佛为仙不劳力，只在凝神入气穴。 ”即此语，药火鼎炉皆备言之矣。 炼丹时采取最要，封固亦不可忽。 采取得到真阳，恐再有遗漏，须用封固之功，要在定忘二字。 定者，在真阳到身之时，用之使之长足； 至用忘之一字，则不采之采，不取之取也。 封固即止火也。 已采取真阳而尚行火不止，则过犹不及，反易漏失，故必须止火而封固之，此亦最要者也。 《小周天歌诀》所说，皆证验也，法度也，而非行功之法。 至应如何行功，仍须用定、忘、止之三字。 阳生而能知觉，已有活子、活午矣。 午，离也； 子，坎也。 既觉则子午已相交，既交以后，正是炼药之时。 在大周天则为乾坤相交，正为行火候之时。",
      "translated_text": "**The Authentic Transmission of the Great Dao**\n\n*Oral teachings of Wei Yaoze of Western Shu, recorded by Chen Weigong Meng of Eastern Zhe*\n\nThe Dao is sought within the heart; when the heart is empty, the Dao may be cultivated.\nIf one seeks merely the fruits of fortune, one remains as distant as a boat across the river.\n\nThose who have attained the Dao must let go of attachment to self and others.\nOnly by releasing body and mind can one break through the Dragon and Tiger.\n\nCultivate and examine yourself; restrain thoughts and reflections.\nLet greed and anger not arise; maintain single-minded sincerity.\nThe gate of Dao and virtue is none other than the Mysterious Female.\n\nOnce the medicine is obtained, spring fills the body.\nThen virtue becomes fragrant as osmanthus, sweet as honey—\none knows its goodness at last.\n\nExert utmost sincerity and effort; do not falter or idle.\nTake heed! Take heed!\n\nThe kalpa’s movement has begun, and the Dao’s fortune is awakening.\nDo not delay yourself or squander Heaven’s grace!\n\nProceed with caution!\nRefine yourself with care!\nTake heed! Take heed!\n\n---\n\n**First Lecture on the Authentic Transmission of the Great Dao: The Fire Times of the Microcosmic Orbit**\n\nWhat are the *fire times* of the Microcosmic Orbit?\n\n*Times* refers to the moment.\nUsing the *living zi* and *living wu* hours, one awaits the proper time to ignite the fire—hence *fire times*.\nFire is *li* (☲), the spirit within the heart.\nThe use of fire is the wondrous function of the heart-spirit, and its wonder lies in awareness.\n\nWith natural spiritual awareness, one refines the celestial fire times to concoct the Great Medicine,\nfollowing a fixed rule.\nThe alchemical classics describe these rules, yet in truth, it is naturally so—\none need not force effort, for it is *wuwei* (non-doing) that accomplishes all.\n\nThe fire times arise in accordance with the natural order of cultivation and can be verified.\nYet one must cultivate naturally to attain spiritual awareness;\nif even slightly unnatural, the spirit loses its efficacy,\nfor attachment and discursive thought cause errors in the fire times.\nThus, I name it the \"Four Characters of Natural Spiritual Awareness,\"\nwhich the alchemical classics call the *Yellow Dame*.\n\nYellow is the color of the Dame.\nThe Dame embodies the pure *kun* (☷) trigram, symbolizing her gentle and yielding nature.\n\nIn *Journey to the West*, Tang Sanzang’s eighty-one tribulations are all errors in the fire times.\nThe causes of encountering demons—failing to fast or seeking lodging—\nstem from concerns over clothing, food, and shelter, which give rise to craving.\n\nFor the human heart possesses the nature of food and desire, innate from birth:\nhalf inherited from parents, half imprinted during the *bardo*.\nParents’ food and desire are transmitted to us—one source;\nthe *bardo*, with its karmic roots of food and desire, imprints our mind-ground—another.\nFrom these two arise greed, anger, delusion, and attachment, ceaselessly.\nA moment’s carelessness, a stirring thought, and the fire times err.\n\nZhu Bajie’s talk of disbanding the group is the scattering of fire.\nThe fire times of the Microcosmic Orbit are most critical;\nin the Macrocosmic Orbit, natural spiritual awareness is complete, so errors are fewer.\nIn the Microcosmic Orbit, awareness may or may not arise, requiring vigilance at every step—\nhence the alchemical classics provide detailed explanations.\n\nAs *Awakening to Reality* states:\n*\"A hair’s deviation prevents the elixir from forming.\"*\nThus, the fire times must not be mistaken.\n\nYet due to these detailed descriptions, scholars stray onto side paths.\nFor instance, theories of \"nine and six,\" *qian* and *kun* strategies—\nthese are not facts but symbols representing principles.\nTo follow texts rigidly is to cling to form.\n\nIn *The Secret Teachings of the Dragon Gate*, Ancestor Qiu’s *Song of the Microcosmic Orbit*—\nif one practices according to its verses, it is still misguided.\nMaster Liu Huayang’s *Wind and Fire Classic* also elaborates on fire times,\nusing the physical body as analogy.\nYet clinging to its phrases in practice is akin to the *Song of the Microcosmic Orbit*.\n\nWhat is fire?\nIt is natural spiritual awareness.\nWhat is medicine?\nIt is the primordial *qi*.\n\nThis is spoken from the perspective of *medicine and fire*.\nFrom the perspective of *refinement*:\n*qi* is the furnace;\nspirit is the fire within the furnace;\nthe empty aperture is the cauldron;\nthe union of spirit and *qi* to attract primordial *qi* is the medicine within the cauldron.\n\nAs Bai Yuchan said:\n*\"Refining medicine with fire to form the elixir is using spirit to guide qi to attain the Dao.\"*\nLi Qing’an said:\n*\"To become Buddha or immortal requires no strenuous effort—only concentrating spirit into the qi cavity.\"*\nIn these words, medicine, fire, cauldron, and furnace are all encompassed.\n\nDuring elixir refinement, gathering is most crucial, and sealing must not be neglected.\nOnce true yang is gathered, fearing leakage, one must apply the work of sealing—\nachieved through *stabilization* and *forgetting*.\n*Stabilization* ensures true yang, when it arrives, is fully nurtured;\n*forgetting* is the unforced gathering, the effortless attainment.\n\nSealing is ceasing the fire.\nAfter gathering true yang, if the fire continues unchecked, excess becomes as harmful as deficiency,\nrisking leakage—thus, the fire must be ceased and sealed, which is most essential.\n\nThe *Song of the Microcosmic Orbit* describes verifications and methods, not the practice itself.\nFor how to practice, one must employ the three characters: *stabilize, forget, cease*.\n\nWhen yang arises and awareness dawns, the *living zi* and *living wu* are present.\n*Wu* is *li* (☲); *zi* is *kan* (☵).\nOnce aware, *zi* and *wu* unite; after their union, it is the time to refine the medicine.\nIn the Macrocosmic Orbit, *qian* (☰) and *kun* (☷) unite—\nthe proper time for the fire times.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1241,
      "start_sentence": 0,
      "end_sentence": 61,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.355173587799072,
      "metadata": {
        "source_file": "dao\\藏外\\大道真传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "在上已有活子、活午，而或不能灵于活午而不自觉知； 或虽觉而不照法用火； 或用火而着相、着意，皆为水源不清。 《悟真篇》曰：“要知火候通灵处，须供神仙仔细论。 ”书上所不详者在此，定、忘、止之三字，故须与神仙论之也。 吕祖曰：“但安神息任天然。 ”“安”字最要，能安则有自然神觉火候，但须顺其自然，即无错误矣。 小周天做到工夫极熟时，可快至一分钟行一周天。 倘照书上所说，须乾坤用三百六十度数之息，则必须若干分钟，必不能一分钟毕事。 可知数隐于其中，不过其理与法度如是而已，事实上决不如是，不可因此而生疑义也。 兹将邱祖《小周天歌诀》详释如下： “静极而动兮，一阳来复”者。 小周天功夫，应从阳生时下手，而阳须静极而生。 静极时所生之阳，水源极清，故“静极”二字，最须注意。 静时所生者为真阳。 平常因意念感动而生阳，是为淫精。 唯静极而动时，方生真正之阳精也。 张紫阳真人曰：“药物生玄窍。 ”由药物而生玄关，药从虚空中产生。 初生时由阴蹻入命门。 命门，内肾也。 命门冲动而外肾自举，一面而上行冲动心府，而知外肾之举，是为活午时，坎水中真火上交于离也。 一阳来复，是地雷复卦。 七日来复，为天地之造化。 地下真阳之生，七日一次。 《易》曰：“复其见天地之心乎！ ”道家简称曰天心。 一阳来复，外肾勃举，即是天心发现之时也。 外肾之举，因为阳气所冲动。 此项阳气，即太极之理气，与先天太极所具生天地者相同。 此气一到吾身，外肾即举，譬如时逢冬至，一阳生于重阴之下，由地下震冲而出，以复天心。 人身之阳举，亦由下而上，正与之同，其举即一阳来复也，亦即复卦也。 静极纯阴之时，一阳爻生于五阴爻之下，故曰“来复”。 此时药虽已有，嫩而不可采取，不过即从此下手而已。 吾人做功到杳冥之时，万象俱寂，一阳来复，恍惚之间，而外肾忽举，是天人合发。 先天之阳初感于身，但举而未坚，以其只有一阳故也。 《道德经》曰：“惚兮恍兮，其中有象； 恍兮惚兮，其中有物； 窍兮冥兮，其中有精； 其精甚真，其中有信。 ”此所曰象，即阳生复之相也。 阳何以举？ 因有精之故，此为虚无元精； 阳生，感至身上为元精到身，亦为混元至精有相，即生精矣。 在交感之时，亦阳举而生精，而与此所生之元精不同，故以“甚真”二字别之。 “信”为信用之信，天心七日来复，千古而不稍差异，故谓之信。 而阳举即天心发现之信，修士凭此信而行采取之功也。 人能到虚极静笃之际，则一阳必然来复，无论二十岁，乃至百岁，一也。 其信何如焉？ 然必须杳冥恍惚，方能有信。",
      "translated_text": "Though the *living zi* and *living wu* may already be present,\none may fail to be sensitive to the *living wu* and remain unaware;\nor, though aware, may not apply the fire according to method;\nor, in applying the fire, may cling to form or intention—\nall these render the water source impure.\n*The Wuzhen Pian* states:\n*\"To know where the fire times commune with the numinous,\none must consult the immortals in careful discourse.\"*\nWhat texts leave unexplained lies precisely here—\nhence the three characters *stabilize, forget, cease* must be discussed with the immortals.\nLü Zu said:\n*\"Simply settle the spirit and rest the breath, letting nature take its course.\"*\nThe word *\"settle\"* is most essential:\nwhen settled, the fire times of numinous awareness arise naturally.\nOne need only follow nature, and no error will occur.\n\nWhen the Microcosmic Orbit is practiced to utmost proficiency,\na single cycle may be completed in as little as one minute.\nWere one to follow the texts, which prescribe 360 breaths for *qian* and *kun*,\nseveral minutes would be required—\nimpossible to finish in one.\nThus, the numbers are concealed within the principle,\nand while the theory and method remain thus,\nin practice it is never so.\nOne must not, on this account, entertain doubts.\n\nBelow follows a detailed explication of Qiu Zu’s *Song of the Microcosmic Orbit*:\n\n*\"When stillness reaches its utmost, movement arises—\na single yang returns.\"*\n\nThe work of the Microcosmic Orbit begins when yang is born,\nand yang is born only when stillness reaches its utmost.\nThe yang born at the height of stillness is of the purest water source—\nthus, the phrase *\"stillness reaches its utmost\"* demands utmost attention.\nThe yang born in stillness is true yang.\nThe yang aroused by ordinary thoughts and sensations is lewd essence.\nOnly when movement arises from the utmost stillness\ndoes true primordial yang-essence come into being.\n\nZhang Ziyang the Perfected said:\n*\"The medicine is born in the mysterious aperture.\"*\nFrom the medicine arises the mysterious pass;\nthe medicine emerges from emptiness.\nAt first, it rises from the yin heel vessel into the Gate of Life.\nThe Gate of Life is the inner kidney.\nWhen the Gate of Life stirs, the outer kidney naturally rises;\nas it ascends, it stirs the Heart Mansion,\nand one becomes aware of the outer kidney’s rising—\nthis is the time of the *living wu*,\nwhen the true fire within *kan*-water ascends to unite with *li*.\n\n*\"A single yang returns\"* is the hexagram *Fu* (☳, Return), Earth Thunder.\nThe seven-day return is the creative transformation of Heaven and Earth.\nThe true yang beneath the earth is born once every seven days.\nThe *Book of Changes* states:\n*\"In Return, do we not see the heart of Heaven and Earth?\"*\nDaoists abbreviate this as *\"Heaven’s Heart.\"*\nWhen a single yang returns and the outer kidney stirs and rises,\nthis is the moment when Heaven’s Heart is revealed.\nThe rising of the outer kidney is caused by the surge of yang-qi.\nThis yang-qi is the principle-qi of the Great Ultimate,\nidentical to that which, in the primordial Great Ultimate, generates Heaven and Earth.\nWhen this qi arrives in the body, the outer kidney rises—\njust as, at the winter solstice, a single yang is born beneath the heavy yin,\nbursting forth from the earth in a *zhen*-thrust to restore Heaven’s Heart.\nThe rising of yang in the human body likewise ascends from below,\nmirroring this process—\nits rising is the return of a single yang, the hexagram *Fu*.\nWhen stillness reaches pure yin,\na single yang line is born beneath five yin lines—\nhence *\"returns.\"*\n\nAt this time, though the medicine is already present,\nit is tender and cannot yet be gathered—\none can only begin from this point.\nWhen one’s practice reaches the state of profound obscurity,\nall phenomena dissolve into silence,\nand a single yang returns—\nin that fleeting, indistinct moment,\nthe outer kidney suddenly rises:\nHeaven and human unite in spontaneous arising.\nThe primordial yang first stirs in the body,\nbut its rising is not yet firm,\nfor only a single yang is present.\nThe *Daode Jing* states:\n*\"Indistinct, yet within it there is an image;\nvague, yet within it there is a thing;\nobscure, yet within it there is an essence;\nits essence is utterly real—\nwithin it there is sincerity.\"*\nHere, the *\"image\"* is the sign of yang’s return.\nWhy does yang rise?\nBecause of the presence of essence—\nthis is the primordial essence of emptiness.\nWhen yang is born and felt in the body,\nit is the arrival of primordial essence,\nthe appearance of the primordial, undifferentiated supreme essence—\nthus, essence is born.\nIn ordinary intercourse, yang also rises and essence is born,\nbut it differs from this primordial essence—\nhence the distinction *\"utterly real.\"*\n*\"Sincerity\"* refers to reliability:\nHeaven’s Heart returns every seven days,\nunchanged through the ages—\nhence *\"sincerity.\"*\nThe rising of yang is the sign of Heaven’s Heart’s revelation,\nand the adept relies on this sign to perform the work of gathering.\n\nWhen one reaches the state of utmost emptiness and profound stillness,\na single yang will invariably return—\nwhether at twenty or a hundred years of age, it is the same.\nWhat reliability is this!\nYet only in the state of profound obscurity and indistinctness\ncan this sincerity be found.",
      "overlap_context": "sential.\n\nThe *Song of the Microcosmic Orbit* describes verifications and methods, not the practice itself.\nFor how to practice, one must employ the three characters: *stabilize, forget, cease*.\n\nWhen yang arises and awareness dawns, the *living zi* and *living wu* are present.\n*Wu* is *li* (☲); *zi* is *kan* (☵).\nOnce aware, *zi* and *wu* unite; after their union, it is the time to refine the medicine.\nIn the Macrocosmic Orbit, *qian* (☰) and *kun* (☷) unite—\nthe proper time for the fire times.",
      "start_char": 1241,
      "end_char": 2253,
      "start_sentence": 62,
      "end_sentence": 111,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.0667884349823,
      "metadata": {
        "source_file": "dao\\藏外\\大道真传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "孔子曰：“自古皆有死，民无信不立。 ”有信方可免死以立命而得命宝，朱子不知，故所注不合。 盖唯知此，乃可不死，而亦不妨于死，生死由己而不由天，自己自有把握。 能心身两静，一阳来复，自能出入生死，自由自在，而不受造物之拘束也。 静极而动，则返于太极，太极返无极，从此而一阳来复。 若能静坐生阳固好，倘其不能，则改用睡功，自能静极而生阳矣。 语曰：向晦入息睡，为大休息之时，身心两静时也。 然人多为七情六欲所蔽，睡亦不能真静而梦扰之，梦中仍贪欲好色，不得休息。 倘真身心两静，则睡而无梦，静极阳举，一阳来复，心神自能觉知。 因神气相合，气一动，神自能动而知之故也。 “药产神知兮，妙诀通灵”者。 “知”即“知白守黑，神明自来”也。 一阳，即药也； 来复，即药产也； 一阳来复，即活子时也。 神知，即活午时也，先天之一炁，来即知之。 因真阳由阴蹻而进，冲动命门真火而外肾举，上冲心脏而神觉知。 阴极生阳而药产，阳里生阴而神知，活子、活午相连，气动而神随之动故也。 《契》曰：“寝寐神相抱，觉悟候存亡”是也。 其中有妙诀，自可通灵。 通灵为通天地之灵气，自己之灵性。 妙诀即药产神知之诀，活子活午之诀也。 吾人应下手采取之时候，倘能知而修之，自能“天人合发，万化定基”，故曰“通灵”也。 “微阳初生兮，嫩而勿采”者。 既通此诀，即须采取。 药嫩不可采，老亦不可采。 孔子曰：“道之不行也，我知之矣，知者过之，愚者不及也； 道之不明也，我知之矣，贤者过之，不肖者不及也。 ”老嫩皆不可用，过与不及，一也。 必其无过不及，而合乎时中，方为合法。 孔子称为“时圣”，正是“喜、怒、哀、乐未发”之“中”。 采取工夫，系有作有为，即“发而皆中节”之“和”。 至封固，则为和合凝结矣。 嫩阳，刚生之时也。 微阳初生，虽举未坚，嫩而不能用，不可以采取。 一阳为地雷复，不可采； 二阳地泽临，亦不可采； 必至地天泰卦，上三阴而下三阳，彼此平衡，真铅八两，真汞半斤，阴阳得其平衡，方可采取也。 初生时嫩不可采，须定于鼻外虚空之中，火逼金行，使阳生足。 盖真金必须一点一滴积渐而成也。 “药物坚实兮，十五光盈； 时当急采兮，莫教错过”者。 时则药物坚实，则已可采取矣。 十五光盈，即金满之时。 坚实，即阳举而坚实之时也。 此时已无过不及，正是圆月，不可错过，即须下手采取矣。 所谓采取，即用“忘”字工夫，此时应拳拳服膺勿失，以为不采之采、不取之取。 夫人每日有阳生之时，而多当面错过，因不能知诀而采取之故也。 药物坚实，即正子时也。 初觉其动时，活午时也。 “时当急采”之“时”字，正午时也。 外肾初轻举，继高举，后坚实，缘药足而冲动心脏，故再觉而知其坚实，此为正午时也。 是为口诀之口诀，学者须切志之！ “久而望远兮，采之无成”者。 即《悟真篇》“金逢望远不堪尝”是也。 “久”字最须注意，已坚久而过时为久，是则去十五日已远为十七、八、九日之月，老而不能用，不能成丹矣。 即此数语，已将小周天药物之老嫩及其火候完全讲毕矣。 下文所讲，为神气相依，活子、活午相连之理也。",
      "translated_text": "Confucius said, *\"Since ancient times, all must die; without trust, the people cannot stand.\"* Only with trust can one transcend death, establish destiny, and attain the treasure of life. Zhu Xi did not understand this, hence his commentary misses the mark. For only by knowing this can one avoid death, yet also not be hindered by death—life and death lie within one’s own grasp, not Heaven’s. One holds the reins oneself.\n\nWhen both heart and body attain stillness, a single yang will invariably return, enabling one to move freely in and out of life and death, unbound by the constraints of creation. In utmost stillness, movement arises, returning to the Supreme Ultimate; the Supreme Ultimate returns to the Ultimateless, and from this, a single yang comes back. If one can sit in stillness to generate yang, that is well; if not, one may instead practice sleeping meditation, naturally attaining stillness and generating yang. As the saying goes: *\"At dusk, one retires to rest\"*—this is the time of greatest repose, when both body and heart are still. Yet most people are obscured by the seven emotions and six desires, even in sleep failing to achieve true stillness, their dreams disturbed by craving and lust, never finding rest. If one truly stills both body and heart, sleep becomes dreamless; in profound stillness, yang rises, and a single yang returns—heart and spirit naturally awaken. For when spirit and qi unite, as qi stirs, spirit stirs with it and perceives.\n\n*\"When the medicine is born, the spirit knows—ah, the wondrous secret connects to the numinous.\"* \"Knowing\" here means *\"knowing the white, guarding the black, so that spirit and brightness come of themselves.\"* The single yang is the medicine; its return is the medicine’s birth; the return of a single yang is the *living midnight hour*. The spirit’s knowing is the *living noon hour*—when the primordial qi arrives, one knows it. For true yang advances from the yin heel vessel, stirring the true fire of the Gate of Life, causing the outer kidneys to rise and surge upward to the heart, where the spirit awakens and perceives. At the extreme of yin, yang is born and the medicine appears; within yang, yin is born and the spirit knows. The living midnight and living noon connect—qi stirs, and spirit follows its movement. As the *Canticle* says: *\"In sleep, spirit embraces spirit; upon waking, one awaits the moment of presence or absence.\"* Within this lies a wondrous secret, through which one may connect to the numinous.\n\nConnecting to the numinous means uniting with the numinous qi of Heaven and Earth and one’s own numinous nature. The wondrous secret is the method of *\"the medicine’s birth and the spirit’s knowing\"*—the method of the living midnight and living noon. When we should begin the work of gathering, if one knows and cultivates this, one naturally achieves *\"Heaven and man unite in manifestation, the foundation of the myriad transformations is set\"*—hence *\"connecting to the numinous.\"*\n\n*\"When the tender yang first arises—ah, it is young and must not be gathered.\"* Once this secret is understood, one must proceed to gather. If the medicine is too young, it cannot be gathered; if too old, it also cannot be gathered. Confucius said: *\"The Dao cannot be put into practice, and I know why: the wise go beyond it, the foolish do not reach it. The Dao cannot be made clear, and I know why: the worthy go beyond it, the unworthy do not reach it.\"* Whether too old or too young, both are unusable—excess and deficiency are the same. Only when there is neither excess nor deficiency, when it accords with the mean of the moment, is it proper. Confucius called this the *\"timely sage\"*—precisely the *\"mean\"* before joy, anger, sorrow, and happiness arise. The work of gathering is active and intentional, the *\"harmony\"* when these emotions are expressed with perfect moderation. When sealed and secured, this becomes the harmonious fusion and coagulation.\n\nThe tender yang is the moment of its initial arising. When the faint yang first stirs, though it rises, it is not yet firm—too young to be used, it cannot be gathered. The single yang of *Fu* (Return) cannot be gathered; the two yangs of *Lin* (Approach) also cannot be gathered. Only when the hexagram *Tai* (Peace) is reached—three yins above and three yangs below, perfectly balanced—when true lead weighs eight ounces and true mercury half a catty, when yin and yang attain equilibrium, can one proceed to gather. At its initial arising, it is too tender to gather; one must stabilize it in the empty space beyond the nose, using fire to drive the metal into motion, allowing yang to fully generate. For true gold must be accumulated drop by drop.\n\n*\"When the medicine is firm and full—ah, the fifteenth day’s radiance is complete; the time has come to gather urgently—ah, do not let it slip away.\"* When the medicine is firm and full, it is ready to be gathered. The fifteenth day’s radiance is complete—this is the time of the full moon. Firmness means the moment when yang rises and solidifies. At this time, there is neither excess nor deficiency; it is the perfect full moon, and one must not miss it—one must immediately begin the work of gathering.\n\nWhat is meant by gathering? It is to employ the work of *\"forgetting.\"* At this moment, one must hold fast and not lose it, practicing a gathering that is no-gathering, a taking that is no-taking. Each day, yang arises, yet most people let it slip by, failing to gather it because they do not know the secret. When the medicine is firm and full, this is the true midnight hour. When one first senses its movement, this is the living noon hour. The *\"time\"* in *\"the time has come to gather urgently\"* is the true noon hour. The outer kidneys first rise lightly, then rise higher, and finally become firm—this is because the medicine is full and surges upward to the heart, so that upon sensing it again, one knows it is firm. This is the true noon hour—the very crux of the oral secret. Scholars must take this to heart!\n\n*\"If one waits too long—ah, gathering will yield no result.\"* This is as the *Awakening to Reality* says: *\"When gold meets the distant full moon, it is no longer fit to taste.\"* The word *\"long\"* demands special attention: if it has already been firm for too long and the moment is past, this is *\"long\"*—by the seventeenth, eighteenth, or nineteenth day, the moon has waned too far, grown too old to be used, and cannot form the elixir. In these few lines, the youth and maturity of the medicine in the microcosmic orbit and its firing times have been fully explained. What follows concerns the principle of spirit and qi depending on each other, the living midnight and living noon connecting—when qi stirs, spirit follows its movement. As the *Canticle* says: *\"In sleep, spirit embraces spirit; upon waking, one awaits the moment of presence or absence.\"* Within this lies the wondrous secret.",
      "overlap_context": "Heart returns every seven days,\nunchanged through the ages—\nhence *\"sincerity.\"*\nThe rising of yang is the sign of Heaven’s Heart’s revelation,\nand the adept relies on this sign to perform the work of gathering.\n\nWhen one reaches the state of utmost emptiness and profound stillness,\na single yang will invariably return—\nwhether at twenty or a hundred years of age, it is the same.\nWhat reliability is this!\nYet only in the state of profound obscurity and indistinctness\ncan this sincerity be found.",
      "start_char": 2253,
      "end_char": 3487,
      "start_sentence": 112,
      "end_sentence": 169,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.581719636917114,
      "metadata": {
        "source_file": "dao\\藏外\\大道真传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "“气驰于外兮，神亦驰外； 神返于根兮，气亦回根”者。 上句为行则同行，下句则住则同住； 上句药产神知，下句则凝神入气穴； 上句气动而神随之，下句即神住而气亦同住； 上句活子、活午相连，气动即觉，而神随之，对外之说也。 真阳自外来，故气由外至，神即出而相迎，所谓“铅至汞迎”是也。 下句说采取封固之时，初时用定，外药之作用也。 阳生已定，即须采取，应用“忘”字工夫。 气归而神相随，神亦入于鼎炉之中。 气为药，而神为火，神归根而气复命是也。 《道德经》曰：“归根曰静，静曰复命。 ”养气为立命工夫，定而在外至忘则归根矣。 采取用忘，气归根而神亦归根也。 以火炼药，神归根而真阳外生，即将此阳收归于鼎炉之中，不采之采，不取之取，采取足而归根忘身，气亦归于根矣。 神气归根之时，气将盈而外肾落下矣。 采取为一候，封固为一候，是为二候采牟尼也。 “气回将盈兮，采封候足； 子时起火兮，须要分明”者。 即已落下而采封候足，即应止火而停工不做，不可再用火候。 倘不知止，药则又泄矣。 下文所说者，乃工夫之证验，而非工夫也。 吕祖曰：“自有天然真火候。 ”火候有天然之次序。 下文所说，皆火候中进阳火、退阴符之理也。 人自静极而动，一阳来复，用定功而真阳到身，以至充足，即须从事采取。 既采取矣，神气已归于根，即须止火，此为一度功夫。 日日如此，行持久久，采到阳足之时，即积金实腹已到真金满腹之时也，因而生此烹炼之作用，使三百六十周天能即速毕工，金木水火同时来而相交以采取外药。 盖行功到此程度，则进阳、退阴同时并举。 既已采封候足，自能起火而退去身上之阴也。 “如何是火兮，后天呼吸； 如何运火兮，呼降吸升”者。 火即后天呼吸之气。 此为自然工夫，到此则元神能灵，而有自然神觉矣。 呼即前降，吸即后升也。 “用火玄妙兮，如无似有”者。 即有无不立，其呼吸之升降，出入似有而仍如无，所谓“但安神息任天然”，用忘字工夫，而不着相也。 “行火鼎内兮，息效真人”者。 即将后天之气收归鼎内，而效法真人之息。 “真人之息以踵”，踵即深深之义，此即真息也，此时呼吸之气，能及足之后跟也。 “火须有候兮，数息出入； 名为刻漏兮，用定时辰”者。 数息工夫，即刻漏之武火也，须以默听为数，亦即刻漏。 刻漏以定时辰，此亦以之记时刻也。 因用刻漏之武火，听息之出入，方能坚实，而得正子时，方可采取炼药也。 “自子至巳兮，六阳用九； 三十六息兮，采取进升”者。 自子到巳为六阳爻，乾卦用九，计三十六息，即进阳火之时也。 即到正子时，须用忘，其中自自然然，有三十六个呼吸，此三十六息即进火也。 “自午至亥兮，六阴用六； 二十四息兮，退降炼烹”者。 自午至亥为六阴爻，坤卦用六，计二十四息，以之退身中之阴气。 即有凉液下降，自顶过重楼入腹，是即退阴符也。 所谓二十四息，仍是自然，不可着数之相，而吾之神觉自能主持火候以烹炼之也。 “卯阳沐浴兮，阳火宜熄； 酉阴沐浴兮，阴符宜停。 不降不升兮，沐浴景象； 较之大周兮，略有微形”者。 卯酉沐浴宜停息用忘，停息即不呼不吸，停止呼吸而不升降，是即卯酉之沐浴也。",
      "translated_text": "When *\"qi races outward, spirit too races outward; when spirit returns to the root, qi too returns to the root,\"* the first line speaks of movement—where one moves, the other follows; the second, of stillness—where one rests, the other abides. The first line describes the medicine’s arising and spirit’s awareness; the second, the gathering of spirit into the qi-cavern. The first line shows qi stirring and spirit following; the second, spirit settling and qi likewise abiding. The first line concerns the linking of living midnight and living noon—when qi stirs, awareness arises, and spirit follows—this is the teaching on the external. True yang comes from without, so qi arrives from outside, and spirit emerges to meet it, which is what is meant by *\"lead arrives, mercury welcomes.\"*\n\nThe second line speaks of the moment of gathering and sealing. At first, one employs stillness—this is the work of the external medicine. Once yang’s arising is settled, one must gather it, applying the work of *\"forgetting.\"* Qi returns, and spirit follows, entering together into the crucible. Qi is the medicine, and spirit is the fire; spirit returns to the root, and qi restores life. As the *Daodejing* says: *\"To return to the root is called stillness; stillness is called the restoration of life.\"* Nurturing qi is the work of establishing life. When stillness reaches the point of forgetting the external, one returns to the root. In gathering, one employs forgetting, so that qi returns to the root and spirit likewise returns to the root.\n\nWith fire, the medicine is refined: spirit returns to the root, and true yang arises externally. One then draws this yang back into the crucible—not gathering as gathering, not taking as taking—until gathering is complete, the root is returned to, and the body is forgotten. Qi too returns to the root. When spirit and qi return to the root, qi nears fullness, and the external kidneys descend. Gathering is one phase; sealing is another—these are the two phases of gathering the *muni*.\n\nWhen *\"qi returns and nears fullness, the phases of gathering and sealing are complete; at midnight, the fire is kindled—this must be clearly distinguished,\"* once the descent occurs and the phases of gathering and sealing are complete, one should cease firing and halt the work. If one does not know when to stop, the medicine will leak away. What follows describes the verification of the work, not the work itself. As Ancestor Lü said: *\"There is a natural firing sequence.\"* The firing sequence has its own natural order. What follows concerns the principles of advancing yang-fire and retreating yin-tally within the firing process.\n\nWhen a person moves from extreme stillness to movement, the first yang revives. Through the work of stillness, true yang arrives in the body, and when it is full, one proceeds to gather. Once gathered, spirit and qi have returned to the root, and one must cease firing—this is one cycle of the work. Practicing thus daily and persistently, when yang is fully gathered, the accumulation of gold fills the abdomen, reaching the point of true gold filling the belly. This gives rise to the refining process, enabling the three hundred and sixty celestial revolutions to swiftly complete. Metal, wood, water, and fire arrive simultaneously to interact and gather the external medicine. At this stage of practice, advancing yang and retreating yin proceed in unison. Once the phases of gathering and sealing are complete, one naturally kindles the fire and retreats the yin from the body.\n\nWhen asked *\"What is fire?\"*—it is the postnatal breath. *\"How is fire moved?\"*—by exhaling downward and inhaling upward. Fire is the qi of postnatal breathing. This is natural work: at this stage, original spirit becomes numinous, and natural spiritual awareness arises. Exhaling is the preceding descent; inhaling is the subsequent ascent.\n\nWhen *\"the subtlety of using fire is like nothing yet something,\"* this means that nothing is established—its breathing’s ascent and descent, its exit and entry, seem present yet remain as if absent. This is what is meant by *\"simply settle the spirit and rest the breath, following nature,\"* employing the work of forgetting without clinging to appearances.\n\nWhen *\"refining fire within the crucible imitates the true person’s breath,\"* this means gathering postnatal qi into the crucible, emulating the true person’s breathing. *\"The true person’s breath reaches the heels\"*—*\"heels\"* signifies depth, referring to true breathing. At this time, the breath reaches the heels.\n\nWhen *\"fire must have its phases, counting the breaths’ exit and entry; called the water-clock, it fixes the time,\"* the work of counting breaths is the martial fire of the water-clock. One must silently count, which is the water-clock. The water-clock fixes the time, and this is also used to mark the hours. By employing the water-clock’s martial fire and listening to the breath’s exit and entry, one achieves solidity and attains the true midnight hour, at which point one may gather and refine the medicine.\n\nFrom midnight to dawn, the six yang lines use nine—thirty-six breaths—this is the time for advancing yang-fire. At the true midnight hour, one must employ forgetting. Naturally, there are thirty-six breaths—these thirty-six breaths are the advancing fire.\n\nFrom noon to midnight, the six yin lines use six—twenty-four breaths—this retreats the yin within the body. Cool fluid descends, passing from the crown through the *heavy tower* into the abdomen—this is the retreating yin-tally. The twenty-four breaths remain natural; one must not cling to the appearance of counting. One’s spiritual awareness naturally governs the firing sequence to refine the medicine.\n\nAt dawn’s yang bathing, yang-fire should be extinguished; at dusk’s yin bathing, yin-tally should be halted. Neither descending nor ascending—this is the scene of bathing. Compared to the great celestial revolution, it bears only a faint resemblance. At dawn and dusk, bathing requires cessation and forgetting. Cessation means neither exhaling nor inhaling, halting the breath without ascent or descent—this is the bathing of dawn and dusk.",
      "overlap_context": " to be used, and cannot form the elixir. In these few lines, the youth and maturity of the medicine in the microcosmic orbit and its firing times have been fully explained. What follows concerns the principle of spirit and qi depending on each other, the living midnight and living noon connecting—when qi stirs, spirit follows its movement. As the *Canticle* says: *\"In sleep, spirit embraces spirit; upon waking, one awaits the moment of presence or absence.\"* Within this lies the wondrous secret.",
      "start_char": 3490,
      "end_char": 4757,
      "start_sentence": 170,
      "end_sentence": 228,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.927473306655884,
      "metadata": {
        "source_file": "dao\\藏外\\大道真传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "总而言之，子动午觉，药产神知，即应下手而定。 定，即刻漏之武火也。 定在鼻外虚空，而以耳听息，即是数息之出入，有此方能坚实其药物，而正子、正午时刻到矣，此时即应采取，宜用“忘”字工夫，亦即卯酉沐浴之时。 十字大交之时，既知正子时到，即进阳火。 一面觉而正午时，即退阴符。 子午本同时而来。 所谓三十六、二十四，乃火候之法度也。 然督长任短，长有三十六息，短仅二十四息，彼此正相当。 相交之点，在卯酉之间，内而水火交，外而金木交。 金木水火同交于中宫，此即取坎填离，二土成圭是也。 然此工夫，皆在忘字之中。 六阳六阴，皆为法度之比相。 督有三十六息，任有二十四息，一长一短，其工夫皆在忘中做完，自己自自然然，一物不知，身心无为，而神气自然有所为也。 上下为水火交，左右为金木交。 两两会作于中宫，九还七返，同时而来，无所先后，比之于大周天，略有不同也。 （见图一） “周天三百兮，除卯酉数； 三百六十兮，连卯酉名。 再加五度兮，四分之一； 以象闰余兮，周天一巡。 复归于静兮，依然沐浴； 神凝气穴兮，再候阳生”者。 此时行工一度，为周天一巡。 一巡既毕，应止火不做，而沐浴凝气穴，候阳生再做，至三百六十周天做完，而小周天之工夫毕矣。 从子到午，由午至亥，而外肾落下，即是周天一巡也。 “行之日久兮，精返为气； 回风直上兮，百日功灵”者。 回风直上，即运行周天，日日做工，身上精皆化为气矣。 小周天功夫告成，约须百日，经此百日，而筑基已完成，为胎仙，故百日功灵也。 “六种震动兮，七日口诀； 大周功起兮，再问迷津”者。 由此到六种震动，其中尚有一年温养功夫。 经一年温养后，应再行大周天之功，当求七日行功口诀，以过此大周天，故曰“大周功起，再问迷津”也。 小周天行功，举要言之，只有“定、忘、止”之三字，而实行工夫，全在阳举之中，举而行工，落而毕工。 身上所觉者，只酥麻一片而已。 到行功纯熟时，其酥麻由后到前，及顶有凉液下降，此即进阳、退阴之证也。 迨至阳落而酥麻消失，是为一度工夫，并无他方法。 学者于此二事，加意可耳。 大道真传口诀第二讲 邱祖《小周天歌诀》所说景象火候，已完备矣。 小周天起点在阳生，阳生之时即起火之候，阳落之时即止火之候。 尚有一种，即伍真人《丹道九篇》所述“阳光三现”之说，是亦小周天之景象也。 此景初下工之时，不能完全知觉，因其时恍恍惚惚，行不采之采、不取之取，工夫务在混混沌沌，（若起明觉，则为水源不清，）故无明觉，有景亦不能认清也。 到末后阳光三现，筑基已成之时，即须止火。 阳光发现，即是虚室生白，两眉中间放白光，来如掣电，《经》称如来眉间放白豪光，即此是也。 此光初现，即阳生之时，不易觉知。 活子到后，活午即至，而神方觉知。 阳光之来，一闪即逝，此为阳光一现，《天仙正理直论》详言之。 至阳足采取之时，此时药物坚实，下手采取后，阳光又一闪，此为阳光二现。 吾侪做工时，对境忘情，身心两静之故，亦不明了此景，盖二现亦不能明觉也。 前讲外肾落下，即止火之时。 所谓阳光三现，亦即在此。",
      "translated_text": "In summary, when *zi* stirs and *wu* awakens, the medicine is produced and the spirit knows—one must then proceed to stabilize it. Stabilization is the martial fire of the water clock. Stabilization resides in the empty space beyond the nose, where one listens with the ears to the breath, counting its ingress and egress. Only thus can the medicine be solidified, and the true *zi* and true *wu* moments arrive. At this time, one should gather it, employing the work of \"forgetting,\" which is also the moment of *mao* and *you* bathing.\n\nAt the moment of the great cross-merging, once the true *zi* hour arrives, advance the yang-fire. As awareness arises at the true *wu* hour, retreat the yin-tally. *Zi* and *wu* arrive simultaneously. The thirty-six and twenty-four are the measures of the firing sequence. Yet the *Du* is long while the *Ren* is short: the long has thirty-six breaths, the short only twenty-four, and they precisely correspond. Their point of intersection lies between *mao* and *you*, where internally water and fire merge, and externally metal and wood converge. Metal, wood, water, and fire all meet in the Central Palace—this is the \"taking from *Kan* to fill *Li*,\" where the two earths form the *gui*.\n\nYet all this work unfolds within the state of forgetting. The six yang and six yin are but proportional measures of the method. The *Du* has thirty-six breaths, the *Ren* twenty-four—a long and a short, their work completed entirely in forgetting. Naturally, spontaneously, without a single thought, body and mind in non-doing, yet the spirit and qi act of themselves. Above and below merge as water and fire; left and right converge as metal and wood. The two pairs unite in the Central Palace, the nine returns and seven reversions arriving simultaneously, without precedence or sequence, differing slightly from the great celestial revolution. (See Figure 1)\n\n*\"Three hundred cycles of the celestial revolution,\nExcluding the count of *mao* and *you*;\nThree hundred sixty,\nIncluding *mao* and *you* in the name.\nAdd five degrees more,\nA quarter’s division,\nTo mirror the intercalary surplus,\nA full circuit of the celestial revolution.\nReturning once more to stillness,\nBathe as before;\nSpirit congealed in the qi-cavern,\nAwait the next arising of yang.\"*\n\nAt this stage, performing the work once completes a single circuit of the celestial revolution. After one circuit, cease the firing and bathe, congealing the qi in its cavern to await the next arising of yang. After three hundred sixty circuits, the work of the minor celestial revolution is complete.\n\nFrom *zi* to *wu*, from *wu* to *hai*, when the external kidneys descend, this marks one circuit of the celestial revolution.\n\n*\"With prolonged practice,\nEssence returns as qi;\nThe revolving wind ascends straight,\nA hundred days yield efficacy.\"*\n\nThe revolving wind ascending straight refers to circulating the celestial revolution daily. As the work continues, the body’s essence transforms entirely into qi. The minor celestial revolution’s work is accomplished in roughly a hundred days. After these hundred days, the foundation is laid, giving birth to the fetal immortal—hence the efficacy of a hundred days.\n\n*\"Six kinds of tremors,\nSeven-day oral instructions;\nThe great revolution’s work begins,\nSeek again the ford of delusion.\"*\n\nFrom here to the six kinds of tremors, there remains a year of nurturing work. After a year of nurturing, one should proceed to the work of the great celestial revolution, seeking the seven-day oral instructions for practice to traverse this great celestial revolution—thus, \"the great revolution’s work begins, seek again the ford of delusion.\"\n\nIn essence, the minor celestial revolution’s practice hinges on three words: \"stabilize, forget, cease.\" Yet the actual work unfolds entirely within the arising of yang—arising to practice, descending to conclude. What one feels in the body is but a pervasive tingling. When the practice becomes proficient, the tingling moves from back to front, and atop the crown, cool fluid descends—this is the sign of advancing yang and retreating yin. When yang descends and the tingling vanishes, one cycle of work is complete, with no other method. The practitioner should attend carefully to these two matters.\n\nThe second lecture on the true oral transmission of the Great Dao completes the explanation of the firing sequence and phenomena in Qiu Zu’s *Song of the Minor Celestial Revolution*. The minor celestial revolution begins at the arising of yang; the moment yang arises is the time to start the fire, and when yang descends, the time to cease it.\n\nThere is another account, Wu Zhenren’s *Nine Chapters on the Dao of Elixir*, which describes the \"three appearances of yang-light\"—also a phenomenon of the minor celestial revolution. At the outset of practice, this sign cannot be fully perceived, for one remains in a state of vagueness, practicing the \"gathering without gathering, taking without taking.\" The work must proceed in utter chaos—if clarity arises, the water source is impure—thus, without clarity, even if the sign appears, it cannot be recognized.\n\nBy the final stage, when the yang-light appears three times, the foundation is laid, and one must cease the fire. The appearance of yang-light is the \"brightness born in an empty room,\" a white light radiating between the brows, flashing like lightning. The *Sutra* speaks of the Tathāgata emitting white light from between the brows—this is it. At its first appearance, the moment of yang’s arising, it is not easily noticed. Only after the living *zi* arrives does the living *wu* follow, and the spirit becomes aware. The yang-light flashes and vanishes in an instant—this is the first appearance of yang-light, as detailed in *The Orthodox Theory of Celestial Immortals*.\n\nWhen yang is full and ready for gathering, the medicine solidifies. After gathering, the yang-light flashes again—this is the second appearance. During our practice, we remain detached from phenomena, body and mind utterly still, and thus do not clearly perceive this sign; even the second appearance may not be distinctly noticed.\n\nAs previously mentioned, when the external kidneys descend, this is the time to cease the fire. The \"three appearances of yang-light\" also occur at this juncture.",
      "overlap_context": "rally governs the firing sequence to refine the medicine.\n\nAt dawn’s yang bathing, yang-fire should be extinguished; at dusk’s yin bathing, yin-tally should be halted. Neither descending nor ascending—this is the scene of bathing. Compared to the great celestial revolution, it bears only a faint resemblance. At dawn and dusk, bathing requires cessation and forgetting. Cessation means neither exhaling nor inhaling, halting the breath without ascent or descent—this is the bathing of dawn and dusk.",
      "start_char": 4757,
      "end_char": 5997,
      "start_sentence": 229,
      "end_sentence": 280,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.458707571029663,
      "metadata": {
        "source_file": "dao\\藏外\\大道真传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "外肾缩回之时，故曰阳光三现，须止火也。 此觉已能微觉，唯阳光极速，昔伍真人此时不能止火，到四现方止火，而火已过矣。 阳光三现之时止火，则恰到好处也。 现在不因阳光之现而止火，惟凭外肾之伸缩，外肾缩回，身上一阵酥麻之时，即须止火，因恐阳光之现认不清楚，倘不退火及生错误故也。 然到积金已满之时，元神能灵，发生自然神觉，自能觉知之矣。 此阳光即铅花之光也。 初现时，铅初到身，二现时铅已满足，三现时铅足入鼎，心斋坐忘，虚室生白，即此是也。 所谓虚室，即是目前，不从身上出，而来自身外者也。 小周天之工夫，即是烹炼。 所谓文烹武炼，即是炼药，炼先天混元至精。 此一点精炼在身中，身中阴精，皆化而为气，谓之曰炼精化气。 初做时甚费时间，及至纯熟，则时可减少，故有攒簇之说。 自一时始，继而一刻，后而一分钟，一秒钟，愈做则愈速也。 迨至纯熟以后，则真阳积满而筑基成矣。 积阳即还虚炼已也。 炼已纯熟，则筑基坚固，到此发生景象，呼吸由周身出入，八万四千毛孔皆开，阳缩如龟矣。 小周天功夫完全完了，筑基告毕。 其中尚有温养工夫，必须经过。 盖阳生后，采取封固。",
      "translated_text": "When the external kidneys retract, this is called the third appearance of yang-light, and the fire must be ceased. At this point, one may faintly perceive the sensation, yet the yang-light is exceedingly swift—formerly, Adept Wu could not stop the fire at this moment but only at the fourth appearance, by which time the fire had already passed its mark. Ceasing the fire at the third appearance of yang-light is precisely the right moment.\n\nNowadays, one does not rely on the appearance of yang-light to cease the fire but instead depends on the expansion and contraction of the external kidneys. When they retract and a wave of tingling numbness courses through the body, the fire must be stopped at once, lest the appearance of yang-light go unrecognized and the fire not be withdrawn in time, leading to error. However, when the accumulation of gold is complete, the original spirit becomes keenly aware, and natural spiritual perception arises, enabling clear recognition.\n\nThis yang-light is the radiance of lead-flower. At its first appearance, lead first arrives in the body; at the second, lead is fully abundant; and at the third, lead is sufficient and enters the cauldron. With the heart fasting and sitting in forgetfulness, the empty chamber generates brightness—this is it. The so-called \"empty chamber\" is what lies before one’s eyes, not something that emerges from the body but rather from beyond it.\n\nThe work of the minor celestial orbit is that of refinement. The so-called \"civil refinement and martial tempering\" is the process of refining the medicine, the primordial undifferentiated essence. This single drop of essence, refined within the body, transforms all the body’s yin essence into qi—this is called \"refining essence into qi.\" Initially, this practice is time-consuming, but with mastery, the duration shortens, hence the saying of \"gathering and assembling.\" It begins with one hour, then reduces to a quarter-hour, then a minute, and finally a second—the more one practices, the swifter it becomes. Once mastery is achieved, true yang accumulates to fullness, and the foundation is established.\n\nAccumulating yang is the return to emptiness and the refinement of the self. When the refinement of the self is perfected, the foundation becomes firm, and at this point, phenomena arise: breath enters and exits through the entire body, the eighty-four thousand pores all open, and yang retracts like a tortoise. The work of the minor celestial orbit is then complete, and the foundation is laid. Yet there remains the work of gentle nurturing, which must be undergone. For after yang arises, it must be gathered and sealed.",
      "overlap_context": "s*.\n\nWhen yang is full and ready for gathering, the medicine solidifies. After gathering, the yang-light flashes again—this is the second appearance. During our practice, we remain detached from phenomena, body and mind utterly still, and thus do not clearly perceive this sign; even the second appearance may not be distinctly noticed.\n\nAs previously mentioned, when the external kidneys descend, this is the time to cease the fire. The \"three appearances of yang-light\" also occur at this juncture.",
      "start_char": 5997,
      "end_char": 6462,
      "start_sentence": 281,
      "end_sentence": 299,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.93134593963623,
      "metadata": {
        "source_file": "dao\\藏外\\大道真传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "内丹得而封固于丹田之中，尚须有以温养之，方能永久缩如龟，现如马阴藏相。 苟其不然，则虽得，亦不能保守，故此项温养功夫为最要也。 温养计时须一年，为十二月，内中除卯酉二月，是为沐浴之时，故曰十个月，此为温养道胎工夫。 《黄庭经》曰：“琴心三叠舞胎仙。 ”小周天毕而初结胎，过大周天则胎成而可出神矣。 所谓结胎，乃比象之词，实即得药而结内丹是也。 温养须一年者，不过举其略数，或不止一年，或不及一年，因人而异，不能一定也。 经过此一年，方算真正现马阴藏相，永为童真之体，而成为人仙，亦结胎仙，又为地仙，是即陆地神仙也，可以保命而不死矣。 小周天与大周天工夫，不相连续，中间有一年温养也。 小周天生而后采，从虚空中生，阳到身而采取之。 大周天则采而后生，必须有所积蓄，方可采而能生。 此一年中温养所积者，即以预备大周天之采取也。 过此一年后，方可行七日口授天机而采大药，行大周天之工夫。 从古上真于此一年工夫，皆不提明而颠倒其时序，谓为大周天后有此温养工夫。 其实不然，皆缘不愿泄漏而秘密之之故也。 大周天后，有哺乳三年工夫，此即还虚工夫也。 经此一年温养后，可以行大周天而出神。 得大周天后，方行三年哺乳工夫。 末后有九年面壁工夫，即为粉碎虚空是也。 此则可做可不做。 此项面壁工夫，全系性功。 我辈修最上一乘者，最初即从还虚下手，以后处处以性功为根底，此时熟习，故不必有此九年也。 若下手非修先天大道而为其余丹法，则此九年功夫，实不可缺，盖可籍此以打扫一切故也。 再大周天七日出神后，若愿放下躯壳，则可不必做此三年哺乳之功； 若不欲放下，再用三年之功，亦可也。 现所最要而须讲者，为一年温养功夫，不在九年面壁之功也。 此项温养功夫，与现在所用者不同，应入山静修； 仍处尘世，应备幽深屋宇，使不闻外声，方可做功。 能居静室，专心一志从事，方许一年毕事。 如不能入山，又无适当静室，则不能专心为此，只能照现在兼修时之法用功，则一年不足，必须三年。 我人现在皆系兼修，处世事而修出世法，或竟须延长至四五年，然亦无甚关系，因终究必能得之故也。 此项工夫亦非甚难，要在真实能静而已。 《悟真篇》曰：“未炼还丹莫入山，山中前后尽非铅”。 铅为尘世上所有，由人能虚极静笃而生，非山中之产。 今已得内丹，必须入山。 以小周天有作有为之工夫，无人能见，朝晚在床上所做，及至无为而家始知之，故须入山专一为之，非其先有作为可比也。 盖其功在终日入定。 入定为佛家之说。 其间工夫，有定有忘。 能有幽深屋宇，每日划定做工夫时刻，能专一修持者，则一日十二时，除夜睡四时之外，尚有八时，其中以二时休息，六时用功，可矣！ 若不专修，亦须限定时刻，以四时或六时用功，但可不克定钟点，此为洗心涤虑功夫，紧切于身心无为之事也。 第一在定，即《大学》定能静安虑之定也； 第二在忘，即《老子》忘其形而形存之忘也。 其与平时不同者，在必须定、忘平均，如以二时做功，则必以一时定，以一时忘。 定忘相平，不能定多忘少，或忘多定少，亦不能定中夹忘，忘中夹定，此实即“朝屯暮蒙”二卦之工夫也。",
      "translated_text": "Once the inner elixir is obtained and sealed within the cinnabar field, it must still be gently nurtured to ensure it remains perpetually retracted like a tortoise, manifesting the *Hidden-Yin-Like-a-Stallion* phase. Without such nurturing, even if the elixir is attained, it cannot be preserved—thus, this phase of gentle cultivation is most essential. The nurturing period spans one year, comprising twelve months, though excluding the months of *mao* (卯) and *you* (酉), which are times for \"bathing,\" leaving ten months for the work of nurturing the Dao-embryo. As the *Yellow Court Classic* states: *\"The zither-heart in triple harmony dances with the embryonic immortal.\"*\n\nThe minor celestial orbit concludes with the initial formation of the embryo; after completing the major celestial orbit, the embryo matures, allowing the spirit to depart. The term \"embryo formation\" is metaphorical—it refers to obtaining the medicine and coalescing the inner elixir. The one-year nurturing period is but a rough estimate; it may extend beyond or fall short of a year, varying by individual. Only after this year does one truly manifest the *Hidden-Yin-Like-a-Stallion* phase, perpetually embodying the body of primordial innocence, becoming a *human immortal*—an embryonic immortal, or *earthly immortal*, a terrestrial transcendent capable of preserving life without death.\n\nThe minor and major celestial orbits are not continuous; between them lies a year of nurturing. The minor orbit generates and then gathers, producing yang from emptiness, which is then collected upon its arrival in the body. The major orbit, however, gathers first and then generates, requiring prior accumulation to enable generation through gathering. The qi amassed during this year of nurturing prepares for the gathering in the major orbit. Only after this year may one undertake the seven-day transmission of celestial secrets to gather the great medicine and practice the major celestial orbit.\n\nAncient perfected ones obscured this sequence, placing the nurturing phase *after* the major orbit, inverting the order to avoid disclosure. In truth, the nurturing precedes it, for they wished to keep it secret. After the major orbit, there follows a three-year \"nursing\" phase—this is the work of returning to emptiness. Upon completing the year of nurturing, one may proceed to the major orbit and spirit departure. Only after achieving the major orbit does the three-year nursing phase begin. Finally, there is the nine-year \"wall-facing\" phase, which is the pulverization of emptiness. This stage is optional.\n\nThe wall-facing practice pertains entirely to the cultivation of *xing* (nature). Those who cultivate the supreme vehicle begin with returning to emptiness, grounding all subsequent work in *xing* cultivation, rendering the nine-year phase unnecessary. For those who do not initially cultivate the primordial Dao but pursue other elixir methods, these nine years are indispensable, as they serve to sweep away all residual obstructions.\n\nAfter the seven-day spirit departure in the major orbit, if one wishes to relinquish the physical form, the three-year nursing phase may be omitted. If not, the three years may still be undertaken. However, the most critical and necessary topic here is the one-year nurturing phase, not the nine-year wall-facing practice.\n\nThis nurturing work differs from contemporary methods; it requires seclusion in the mountains. If remaining in the world, one must secure a secluded chamber, shielded from external sounds, to practice. Only by residing in stillness and dedicating oneself wholeheartedly can the year’s work be completed. Without mountain seclusion or a suitable quiet space, one cannot focus entirely, and the modern concurrent cultivation method must suffice—though a year may then prove insufficient, extending to three. For those practicing amidst worldly affairs, the period may stretch to four or five years, yet this poses no ultimate hindrance, for the goal will still be attained.\n\nThis work is not inherently difficult; the key lies in genuine stillness. As the *Awakening to Reality* states: *\"Before refining the returning elixir, do not enter the mountains—all before and after in the hills is not true lead.\"* Lead exists in the world, born from profound emptiness and stillness within the practitioner, not as a mountain product. Now that the inner elixir is obtained, mountain seclusion is necessary. The minor orbit’s active, willed practice can be performed unseen, even upon the bed at dawn and dusk, but the later effortless phase reveals it—thus, seclusion is required for undivided focus, unlike earlier stages.\n\nThe essence of this work is perpetual *entering samadhi*. Samadhi is a Buddhist term, but here it involves both *ding* (stabilization) and *wang* (forgetting). With a secluded chamber, one may set fixed hours for practice: of the twelve daily hours, excluding four for nightly sleep, eight remain. Deducting two for rest leaves six for cultivation. For non-exclusive practice, four to six hours may suffice, without rigid scheduling—this is the work of purifying the heart and clarifying the mind, intimately tied to effortless alignment of body and spirit.\n\nThe first priority is *ding*, the stabilization described in the *Great Learning* as the foundation for stillness, tranquility, and clarity. The second is *wang*, the forgetting in *Daodejing* where form is forgotten yet preserved. The difference from ordinary practice lies in balancing *ding* and *wang* equally: for every two hours of practice, one hour is for *ding*, one for *wang*. They must be evenly matched—neither *ding* in excess nor *wang* deficient, nor intermingled. This is the work of the *Tun* (屯) and *Meng* (蒙) hexagrams, the \"morning *Tun*, evening *Meng*\" practice.",
      "overlap_context": " return to emptiness and the refinement of the self. When the refinement of the self is perfected, the foundation becomes firm, and at this point, phenomena arise: breath enters and exits through the entire body, the eighty-four thousand pores all open, and yang retracts like a tortoise. The work of the minor celestial orbit is then complete, and the foundation is laid. Yet there remains the work of gentle nurturing, which must be undergone. For after yang arises, it must be gathered and sealed.",
      "start_char": 6462,
      "end_char": 7703,
      "start_sentence": 300,
      "end_sentence": 344,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.414179801940918,
      "metadata": {
        "source_file": "dao\\藏外\\大道真传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "朝屯者，晨间日出之时，恐丹为阳火所伤，即须退火，退火须忘也； 至暮日入，阳光已无，恐寒气伤丹，即须进火，进火须定也。 实际上，使水火两平而已，朝恐其燥，用水以盖其铅，即朝屯之工夫也，忘字工夫也； 暮恐其寒，用火以盖其汞（抽铅添汞），即暮蒙之工夫也，定字工夫也。 朝须忘而暮须定，实则定忘即水火，必取其均匀，有一时定，必有一时忘； 有二时定，必有二时忘，不可偏枯者也。 在实际，朝屯暮蒙亦同时而并举，必须分其时间，以一半为定，一半为忘。 此时之定忘功夫，要甚易为也。 做工之初有神觉而不能自然，积久则做到安然自然，神觉自能调度一切，不必作意定忘，此时六根清静，万感不生，一坐而自然定、自然忘也。 吾人但须调停使之平均而已，不然则不偏于燥，即偏于寒矣，故必使之两两平衡。 即短至一二十分钟功夫，亦须如此，有忘即有定，有定即有忘，而用两者相等之时间也。 吾人调停火候，即在于此。 每日能用功到六时，则一年足矣。 倘其不能，或竟短至一二时，则须时加长，可依此比例而定之也。 观上举二语之理解，即在使定生汞，而忘生铅，因已有内丹，即是铅汞二物故也。 修炼金丹功夫，能处处使之平均，则铅汞二物，自然平均，为半斤八两。 铅汞既满，即到行大周天之火候矣。 我人现所得者为后天中之先天。 空中所生之阳，先天也。 既到吾身上，则化为后天，故其本体为先天，而实际上已变为后天，故谓为后天中之先天。 既得此后，再由此生出一物，则为先天之先天。 此一年温养功夫，即得先天中先天之预备也。 《入药镜》曰：“水怕干，火怕寒。 ”又曰：“采药时，调火功，火候足，莫伤丹。 ”即此是也。 《易》卦皆两卦对举，如坎为水，对离为火； 水火既济，对火水未济； 天地否，对地天泰。 两卦相对，两卦相反也。 火候除乾坤坎离四卦外，用六十卦以为准则，正与炼丹阴阳对举、二八相当事实相合。 如日一定一忘，一水一火，两两对举而相反相成，故火候配卦，象以乾坤坎离四卦为体，其余六十卦为用，一日用两卦，如朝用屯而暮用蒙，贯通相合而甚妙； 如以定为地天泰，忘为天地否，正无不合也。 卦有吉凶悔吝，而吉凶悔吝生乎动，盖能平均则无咎，偏枯则生凶吝矣。 《入药镜》曰：“受气吉，防成凶。 ”受气之初，容易得吉； 温养火候，即须防危，所谓防危虑险，即此是也。 《大学》曰：“安而后能虑。 ”小周天后仍须顾虑，务在小心谨慎，不可使有偏枯而或寒或燥，盖唯以平均为要也。 上谓须幽深之屋宇，亦为此故。 用功时须静室，更须有人看守伴静，恐有惊扰。 一有惊忧，即不平均矣。 自古高真修炼，皆有伴侣，亦因是故也。 吾人修持须定时间，或朝晚两次，必须室外有人，看管照顾，不使有人事之惊动，差其火候。 故此为无为无不为之功夫，为外人所不能知之者也，与小周天行功不同，彼可在床上行功采取，不使人知； 此时行功既须静室伴侣，则人皆知之矣。 经此温养，内丹化生金液。 金液满足，方能生出大丹。 所谓内外，即大小虚空是也。 小周天采自外而得在内，所结为内丹，是以外药结内丹。 大周天采在内而得在外，所结为外丹，是以内药结外丹。",
      "translated_text": "At *Tun* in the morning—when the sun rises—one fears the elixir may be harmed by the yang fire, and so must withdraw the fire; withdrawing fire requires *wang* (forgetting). By evening, when the sun sets and yang light is gone, one fears the cold *qi* may harm the elixir, and so must advance the fire; advancing fire requires *ding* (stabilization). In practice, this is simply balancing water and fire. In the morning, one fears dryness, so water is used to temper the lead—this is the work of morning *Tun*, the work of *wang*. In the evening, one fears cold, so fire is used to temper the mercury (drawing lead to replenish mercury)—this is the work of evening *Meng*, the work of *ding*. Morning requires *wang*, evening requires *ding*; in truth, *ding* and *wang* are water and fire, and must be kept even. For every hour of *ding*, there must be an hour of *wang*; for every two hours of *ding*, two of *wang*—imbalance must be avoided.\n\nIn practice, morning *Tun* and evening *Meng* are undertaken simultaneously, with time divided equally: half for *ding*, half for *wang*. At this stage, the work of *ding* and *wang* becomes effortless. Initially, one may have spiritual awareness yet lack naturalness; with long practice, one attains ease and spontaneity, where spiritual awareness naturally regulates all, and deliberate *ding* or *wang* is no longer needed. The six senses are purified, myriad distractions cease, and one sits in natural *ding*, natural *wang*. We need only adjust to maintain balance—otherwise, one risks either dryness or cold. Even in sessions as brief as ten or twenty minutes, this principle holds: where there is *wang*, there must be *ding*; where there is *ding*, there must be *wang*, with equal time allotted to both. This is how we regulate the firing process.\n\nDaily practice of six hours suffices for a year. If unable, or if reduced to one or two hours, the duration must be extended proportionally. The essence of the two methods lies in *ding* generating mercury and *wang* generating lead, for once the inner elixir is formed, it comprises both lead and mercury. In the practice of refining the golden elixir, maintaining balance at every stage ensures that lead and mercury remain equal—like half a catty and eight taels. When lead and mercury are full, the firing process for the great celestial circuit is reached.\n\nWhat we now obtain is the prenatal within the postnatal. The yang born of emptiness is prenatal. Once it enters the body, it transforms into the postnatal, though its essence remains prenatal—hence it is called the prenatal within the postnatal. From this, another substance may be generated: the prenatal of the prenatal. This year of nurturing practice prepares for the prenatal within the prenatal.\n\nThe *Mirror for Ingredient Entry* states: *\"Water fears drying, fire fears cold,\"* and *\"When gathering the medicine, regulate the fire; when the firing is sufficient, do not harm the elixir.\"* This is the principle here.\n\nThe hexagrams of the *Yijing* are always presented in pairs: *Kan* (Water) opposes *Li* (Fire); *Water-Fire Ji Ji* (Already Across) opposes *Fire-Water Wei Ji* (Not Yet Across); *Heaven-Earth Pi* (Stagnation) opposes *Earth-Heaven Tai* (Peace). Paired hexagrams stand in opposition. Apart from the four hexagrams *Qian*, *Kun*, *Kan*, and *Li*, the firing process uses the remaining sixty hexagrams as its standard, aligning with the facts of alchemical yin-yang pairing and the correspondence of two and eight. Each day, one *ding* and one *wang*, one water and one fire, stand in opposition yet complement each other. Thus, the firing process corresponds to the hexagrams: *Qian*, *Kun*, *Kan*, and *Li* serve as the body, while the other sixty serve as function. Each day uses two hexagrams—morning *Tun* and evening *Meng*—interconnected and harmonious. If *ding* is *Earth-Heaven Tai*, then *wang* is *Heaven-Earth Pi*; the correspondence is perfect.\n\nHexagrams have auspicious and inauspicious omens, and these arise from movement. Balance ensures no fault; imbalance breeds misfortune. The *Mirror for Ingredient Entry* says: *\"Receiving qi is auspicious; guard against becoming inauspicious.\"* At the outset of receiving qi, auspiciousness comes easily; in nurturing the firing process, one must guard against danger—this is what is meant by \"guarding against danger and considering risk.\"\n\nThe *Great Learning* states: *\"Only after stability can one deliberate.\"* Even after the small celestial circuit, one must remain vigilant, exercising utmost care to avoid imbalance—whether cold or dryness—for balance is paramount. The earlier requirement for a secluded chamber serves this purpose. During practice, one must use a quiet room and have an attendant to guard against disturbances. Any startling disturbance disrupts balance.\n\nSince ancient times, accomplished practitioners have always had companions, for this very reason. In our practice, we must set fixed times—morning and evening—and ensure someone outside the room oversees and attends to us, preventing human disturbances from disrupting the firing process. This is the work of \"non-doing that accomplishes everything,\" unknown to outsiders. It differs from the small celestial circuit, which can be practiced on a bed to gather and refine without others knowing. Here, with a quiet room and attendant, all will be aware.\n\nThrough this nurturing, the inner elixir transforms into golden liquid. Only when the golden liquid is full can the great elixir be born. The \"inner\" and \"outer\" refer to the small and great emptiness. The small celestial circuit gathers from the external to form the internal, producing the inner elixir—thus, external medicine forms the inner elixir. The great celestial circuit gathers from the internal to form the external, producing the outer elixir—thus, internal medicine forms the outer elixir.",
      "overlap_context": "he foundation for stillness, tranquility, and clarity. The second is *wang*, the forgetting in *Daodejing* where form is forgotten yet preserved. The difference from ordinary practice lies in balancing *ding* and *wang* equally: for every two hours of practice, one hour is for *ding*, one for *wang*. They must be evenly matched—neither *ding* in excess nor *wang* deficient, nor intermingled. This is the work of the *Tun* (屯) and *Meng* (蒙) hexagrams, the \"morning *Tun*, evening *Meng*\" practice.",
      "start_char": 7703,
      "end_char": 8933,
      "start_sentence": 345,
      "end_sentence": 394,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.335257291793823,
      "metadata": {
        "source_file": "dao\\藏外\\大道真传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "此其不同之点也，所谓合内外之道，即此是也。 大道真传口诀第三讲 十月温养工夫，历来丹家皆不详言，而为丹道之秘诀。 举要言之，即定忘平均是也。 此时已得真自然神觉，定忘自然平均，不然则为差误。 《悟真篇》曰：“毫发差殊不结丹”是也。 调停者，即使之平均之谓。 此时内丹已结，能以定忘平均之法温养之，方可生外丹而成阳神。 盖内丹不过能化身上之阴，成为人仙而已。 至阴神之群阴，历劫来之业根，入胎之中阴，内丹所不能化，唯大丹方可化之。 故结内丹后，必温养之，使生外丹，方可毕事，而成为大觉金仙也。 邱祖《小周天歌》外，尚有《大道歌》一章，为《龙门秘旨》各歌之纲领，今试举而解之如下： “大道渊微兮现在目前”者。 开口即点窍。 大道幽深，而不可测，其发现要即在目前也。 “自古上达兮莫非师传”者。 大道之源，书中语焉不详，全赖真师口口相传焉。 “渺漠多喻兮究竟都是偏”者。 且书中即有所说，皆为喻言，渺漠而不可认为实在，又皆偏于一边者也。 古来着书立说，皆对时弊而言，因世人之弊，而思有以救之，故宋元间之着书，皆主张有为。 因其时陷于清净，落于孤寂，故以有为之说进之； 及至明清间之着书，多主张无为。 因其时流于女鼎采战，故以无为之说药之。 亦因真诀不能全漏，故各书多为比喻比象之言，渺漠多喻，究竟是偏也。 “片言万卷兮下手在先天”者。 此谓修道口诀，皆包罗于“下手在先天”一言之内也。 “有名无象兮元气本虚然”者。 元气，有名无象之物，体本虚空。 修道须从此虚里下手，所采所得者，皆此物也。 “阳来微微兮物举外形旋”者。 先天一炁，从虚无中来。 其来焉甚微，一点一点积渐而成，故曰微微也。 其来也于何证之？ 即“物举外形旋”是也。 阳物举时，即可知先天真阳已来。 外形旋者，刚举之时也。 举头便是，转念即非，故谓之曰旋。 旋字最为重要。 下手采取先天，在刚发动而不转念之时； 旋举以后，一有杂念，则水源不清矣。 “恍惚梦觉兮移入丹田”者。 问阳举在于何时？ 曰：即在恍恍惚惚，在睡梦中时也，亦即梦觉刚动之时也。 何以能恍恍惚惚梦觉？ 因神已入丹田，与气相抱，所以阳动而觉知之也。 “鼓动巽风兮调药未采先”者。 在未采之先，应鼓动巽风以调停之，使之不老不嫩。 巽风即刻漏之武火也。 不然，即生念而水源不清矣。 鼓动巽风者，以此止念，一也； 以此调药，二也。 有此二者，故一觉即须定在鼻外虚空，以耳听息。 鼓动巽风，药调既好，方能采取。 不然，则不失之无，即失之有。 失之无即无物，亦不采； 失之有即念杂而源不清，欲采而不可以采。 故必先以风火调药，此为最要。 最要有刻漏之武火，方能使药生足而不失之于有无也。 “无中生有兮天机现目前”者。 此药从无中生有，既生即天机现于目前，是即眼前之相也，亦是玄关之相。 眼前现一白圈，恍如圆月，合上弦下弦，而成为十五之月，正可采取之时也。 此相既现于目前，即正子时到。 盖以武火调之，即生正子、正午时矣。 “虎吸龙魂兮时至本自然”者。 从虚无中生阳，自外到身，由阴蹻至命门而外肾动，一面上冲心脏，即觉知其动。",
      "translated_text": "This marks their distinct difference—what is called the Dao of uniting inner and outer is precisely this.\n\n**Third Lecture on the True Oral Transmission of the Great Dao**\nThe ten-month nurturing practice has always been left undetailed by alchemical schools, for it is the secret formula of the Dao of elixir cultivation. To summarize its essentials: it is the state of settled forgetfulness and perfect equilibrium. At this stage, one has attained the true, natural spiritual awareness, where settled forgetfulness and equilibrium arise spontaneously—any deviation would be an error. As *Awakening to Reality* states: “A hair’s breadth of difference, and the elixir will not form.” “Regulating” means precisely this: achieving equilibrium. Now that the inner elixir has formed, only by nurturing it with the method of settled forgetfulness and equilibrium can the outer elixir be generated and the yang spirit completed. For the inner elixir merely transforms the yin within the body, elevating one to the rank of human immortal. As for the host of yin spirits, the karmic roots accumulated over kalpas, and the intermediate yin of the womb—these the inner elixir cannot transform. Only the great elixir can do so. Therefore, after forming the inner elixir, one must nurture it to generate the outer elixir, thereby completing the work and attaining the rank of the Golden Immortal of Great Awakening.\n\nBeyond the *Song of the Small Celestial Circuit*, Ancestor Qiu also composed a *Song of the Great Dao*, which serves as the guiding principle for all the songs in *The Secret Essentials of the Dragon Gate*. Here, we shall present and explicate it as follows:\n\n*“The Great Dao, profound and subtle, appears before the eyes.”*\nThe opening line immediately points to the crux. The Great Dao is deep and unfathomable, yet its manifestation lies right before us.\n\n*“Since ancient times, those who have attained it have relied solely on transmission from a teacher.”*\nThe source of the Great Dao is not fully expounded in texts; it depends entirely on the oral transmission of a true master.\n\n*“Vague and metaphorical, all teachings ultimately fall short.”*\nEven what is written in texts consists of metaphors, too nebulous to be taken as reality, and all are one-sided. From ancient times, those who wrote books did so in response to the ills of their age, seeking remedies for the world’s afflictions. Thus, the writings of the Song and Yuan dynasties emphasized “active practice,” for their era had sunk into passivity and solitude, requiring the spur of active cultivation. By the Ming and Qing dynasties, writings leaned toward “non-doing,” for the age had degenerated into the debauchery of “female crucible” and sexual arts, necessitating the remedy of non-doing. Since the true oral formulas could not be fully disclosed, texts often resorted to analogies and metaphors—vague and one-sided in the end.\n\n*“A single phrase encompasses ten thousand volumes: the work begins in the prenatal.”*\nThis means that the oral formulas for cultivating the Dao are all contained within the phrase “the work begins in the prenatal.”\n\n*“Named yet formless, the primordial qi is fundamentally empty.”*\nThe primordial qi is something named yet formless, its essence fundamentally empty. Cultivation must begin from this emptiness; what is gathered and obtained is precisely this.\n\n*“When yang arrives subtly, the external form stirs in an instant.”*\nThe prenatal qi emerges from the formless. Its arrival is exceedingly subtle, accumulating bit by bit—hence “subtly.” How can one verify its arrival? It is seen in the “stirring of the external form in an instant.” When the yang organ stirs, one knows the true prenatal yang has arrived. “External form stirs in an instant” refers to the moment of initial arousal. The instant it rises, it is present; the moment one thinks, it is gone—hence “instant.” This word is of utmost importance. The work of gathering the prenatal begins at the moment of arousal, before thought arises. Once the instant passes and stray thoughts intrude, the source of water is no longer pure.\n\n*“In the hazy state between dream and waking, it shifts into the elixir field.”*\nWhen does the yang stir? Precisely in the hazy state between sleep and dream, at the moment of arousal from slumber. Why can one be hazy between dream and waking? Because the spirit has entered the elixir field, embracing the qi, so that when yang stirs, one becomes aware of it.\n\n*“Stir the wind of Xun to regulate the medicine before gathering it.”*\nBefore gathering, one must stir the wind of Xun to regulate it, ensuring it is neither too raw nor too ripe. The wind of Xun is the martial fire of the water clock. Without this, thoughts arise, and the source of water is no longer pure. Stirring the wind of Xun serves two purposes: to still thoughts, and to regulate the medicine. With these two, upon awakening, one must immediately settle in the empty space outside the nose, listening to the breath with the ears. Only after stirring the wind of Xun and properly regulating the medicine can one gather it. Otherwise, one errs either by absence or by excess. Absence means there is nothing to gather; excess means thoughts intrude and the source is impure, making gathering impossible. Therefore, one must first use wind and fire to regulate the medicine—this is most crucial. Only with the martial fire of the water clock can the medicine fully mature, avoiding the pitfalls of absence or excess.\n\n*“From nothing, something arises, and the celestial mechanism appears before the eyes.”*\nThis medicine arises from nothing, and once born, the celestial mechanism manifests before the eyes—this is the phenomenon before one’s gaze, the appearance of the mysterious pass. A white circle appears before the eyes, hazy as a full moon, combining the waxing and waning phases into the fifteenth-day moon—the precise moment for gathering. When this phenomenon appears before the eyes, the true midnight hour arrives. For when regulated with martial fire, the true midnight and true noon hours are born.\n\n*“The tiger inhales the dragon’s soul—timing comes naturally.”*\nWhen yang arises from the formless, it comes from without to within, traveling from the yin heel vessel to the Gate of Life, stirring the outer kidneys. As it surges upward to the heart, one becomes aware of its movement.",
      "overlap_context": "ough this nurturing, the inner elixir transforms into golden liquid. Only when the golden liquid is full can the great elixir be born. The \"inner\" and \"outer\" refer to the small and great emptiness. The small celestial circuit gathers from the external to form the internal, producing the inner elixir—thus, external medicine forms the inner elixir. The great celestial circuit gathers from the internal to form the external, producing the outer elixir—thus, internal medicine forms the outer elixir.",
      "start_char": 8933,
      "end_char": 10194,
      "start_sentence": 395,
      "end_sentence": 459,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.478098392486572,
      "metadata": {
        "source_file": "dao\\藏外\\大道真传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "因用武火，火逼金行，则外肾坚实； 一面心仍觉其坚实，是即正午时到也。 因鼓风调火，仍定在外边，阳生不断，自外而来，渐渐满足，皆感到身上，故外肾能坚实也。 既已坚实，而阳气上行，冲动心神，心神下行，是为水火已交，神气已合，所以谓之虎吸龙魂。 又水火既交，方有正子时、正午时，故曰“时至本自然”也。 “身心恍惚兮四肢如酥绵”者。 以其时身心似觉非觉，一身又酥又软，四肢舒适已极，是为正子时，在我则已到正午时而觉知之矣。 “药产神知兮正是候清源”者。 此时水源甚清，即可采取也。 药产神知，已觉坚实。 盖唯此景，水源方清，而可采取也。 “火逼金行兮橐钥凭巽旋，河车运转兮进火提真铅”者。 水源既已甚清，须保持之，不可再失之于浊。 仍用火逼金行之功，鼓动橐钥，凭巽风以回旋。 用自然呼吸以逼之，以行自然之采取，即不采之采、不取之取也。 其呼吸听诸自然，不用武火。 既任其自然，所以有河车自然之运转，即进阳火、退阴符也。 进火提真铅，即采取也。 此项河车进退，全系自然转动，毋容以意去作用之。 “周天数息兮四揲逢时迁”者。 周天三百六十，以四分之，为九十。 此时实只九十息，全为自然之息，因时迁流，可不必去数之也。 “卯酉沐浴兮子午中潜”者。 周天三百六十，用四分为九十息，即其中有卯酉沐浴，子午抽添。 卯酉即藏在子午之中，子午即卯酉也。 四候九十息，为子午卯酉，而卯酉藏于子午，所以即九十息亦无也，子午卯酉皆为比相而言也。 “归根复命兮闰馀周天，数足三百兮景兆眉前”者。 到归根复命之时，即为一周天。 何以为归根复命？ 因采取功毕，阳物缩回，是即归根复命也。 阳举之时，神气皆向外驰，一到缩回，则归复矣。 三百六十度为一周天，此时其数既足，应即止火，目前即有止火之景。 两眉中间虚室生白，如电光之一闪，即此是也。 此时须进而封固之矣。 “止火机成兮光候三牵”者。 此时应即止火而休息，故曰“止火机成，光候三牵”，即伍真人所说，“阳光三现，止火之景”是也。 上文所说小周天采取之工也，先须阳足水清，而后可采取。 既已采取封固，而三现阳光，即须下来止功毕事。 以下所说，即温养中之封固工夫也。 经过三百周天，内丹已结，即有丹原，有物大如黄豆，而上下跳动，此时宜用采药归炉之功夫。 药到腹中，须归入炉中，他书又谓之曰“移炉换鼎”，即《阴符经》所谓“机在目”是也。 “双眸秘密兮专视中田”者。 到内丹已结，上下跳动时，应用两目看着脐眼，此为秘密工夫，不可对人而看视也。 专视数日后，其跳动更变矣。 前者跳动，上到心脏，下到命门； 此时则循脐眼而跳动，成一团形，此为已得内丹。 以后应用上讲所述之温养工夫。 此时丹原绕脐转动，平时已不觉知之矣。 应用一年温养，使生大药也。 “大药难采兮七日绵绵”者。 须接连大定七日，用七日之功夫。 一日须定到六时之时间，其定时盖甚长也。 下文皆说大周天下功夫之法也。 “蹊路防危兮机关最玄”者。 蹊路即上下鹊桥之路，应防危虑险。 机关亦指上下鹊桥而言，最为幽玄，恐有走丹之险，急须谨慎也。 “深求哀哀兮早觅真传，择人而授兮海誓盟言，遇机服食兮全凭德先”者。",
      "translated_text": "When martial fire is applied, the fire compels the metal to move, and the outer kidneys become firm and solid. Simultaneously, the heart perceives this firmness—this is the arrival of the true noon hour. By fanning the wind to regulate the fire, it remains fixed externally, and yang, born without ceasing, comes from without to within, gradually filling the body, all felt upon the flesh. Thus, the outer kidneys grow firm. Once firm, yang qi ascends, stirring the heart-spirit; the heart-spirit descends—this is the union of water and fire, the merging of spirit and qi, hence called “the tiger inhales the dragon’s soul.” Only when water and fire have united do the true midnight and true noon hours arise, thus it is said, *“Timing comes naturally.”*\n\n*“Body and mind in reverie, the four limbs like softened silk”*—at this moment, body and mind seem neither awake nor asleep, the whole body both melting and soft, the limbs utterly at ease. This is the true midnight hour; for me, it is the true noon hour when I perceive it.\n\n*“The medicine arises, the spirit knows—this is the moment to gather the clear source.”* At this time, the water source is most pure, and gathering may begin. The medicine arises, the spirit knows—firmness is already felt. Only in this state is the water source clear enough for gathering.\n\n*“Fire compels metal to move, the bellows turns by the power of wind; the river chariot revolves, advancing fire to refine true lead.”* Once the water source is clear, it must be preserved, never again lost to turbidity. Continue the work of fire compelling metal to move, stirring the bellows, relying on the wind of Xun to revolve. Use natural breathing to compel it, practicing natural gathering—gathering without gathering, taking without taking. The breath follows its own nature, without martial fire. Letting it be natural, the river chariot turns of itself, advancing yang fire and retreating yin tally. Advancing fire to refine true lead is the act of gathering. This river chariot’s ebb and flow is entirely spontaneous, requiring no intentional effort.\n\n*“The celestial cycle of breaths—four divisions mark the timely shift.”* The celestial cycle of 360 degrees, divided by four, yields ninety. Here, there are truly only ninety breaths, all natural, flowing with the passage of time—no need to count them.\n\n*“Bathing at Mao and You, concealed within Zi and Wu.”* The celestial cycle of 360 degrees, divided into four parts of ninety breaths, includes bathing at Mao and You, and the withdrawal and addition at Zi and Wu. Mao and You are concealed within Zi and Wu; Zi and Wu are Mao and You. The four phases of ninety breaths are Zi, Wu, Mao, and You, yet Mao and You are hidden within Zi and Wu—thus even ninety breaths are absent, for Zi, Wu, Mao, and You are but relative terms.\n\n*“Returning to the root to restore life—intercalary days complete the celestial cycle; the count reaches three hundred—signs appear before the brows.”* At the time of returning to the root to restore life, a full celestial cycle is complete. What is returning to the root to restore life? When the work of gathering is done, the yang substance retracts—this is returning to the root to restore life. When yang rises, spirit and qi rush outward; when it retracts, they return. Three hundred sixty degrees make a celestial cycle; when the count is complete, cease the fire immediately, for the sign to stop appears before the eyes. Between the brows, in the empty chamber, a flash like lightning—this is it. At this moment, proceed to seal and secure it.\n\n*“The mechanism to cease fire is perfected—the light awaits three pulls.”* At this time, cease the fire and rest, hence it is said, *“The mechanism to cease fire is perfected, the light awaits three pulls,”* which is what Master Wu meant by *“When the yang light appears three times, it is the sign to cease fire.”* The above describes the work of gathering in the minor celestial cycle, which first requires yang to be full and water clear before gathering can begin. Once gathered and sealed, when the yang light appears three times, descend and conclude the practice.\n\nThe following describes the work of sealing and nurturing within the process of refinement. After three hundred celestial cycles, the inner elixir forms, and the elixir’s origin appears—a substance the size of a soybean, leaping up and down. At this time, employ the work of gathering the medicine and returning it to the furnace. When the medicine reaches the abdomen, it must be returned to the furnace, which other texts call *“moving the furnace and changing the cauldron,”* as in the *Yin Fu Jing*: *“The mechanism lies in the eyes.”*\n\n*“The secret of the twin eyes—focus on the central field.”* When the inner elixir has formed and leaps up and down, use both eyes to gaze at the navel. This is a secret practice, not to be observed by others. After focusing for several days, the leaping changes. Previously, it leapt up to the heart and down to the Gate of Life; now it circles the navel, forming a single mass—this is the attainment of the inner elixir. Thereafter, employ the nurturing work described above. At this time, the elixir’s origin revolves around the navel, and one is no longer aware of it in daily life. Nurture it for a year to produce the great medicine.\n\n*“The great medicine is hard to gather—seven days of unbroken continuity.”* One must enter profound stillness for seven consecutive days, applying seven days’ effort. Each day requires stillness for six double-hours—this stillness is of great duration. The following describes the methods of descending work in the major celestial cycle.\n\n*“Beware the perilous path—the mechanism is most profound.”* The path refers to the upper and lower magpie bridges; one must guard against danger and peril. The mechanism also refers to the upper and lower magpie bridges, most subtle and mysterious, for there is the risk of the elixir escaping—one must be vigilant.\n\n*“Seek earnestly, with sorrow—find the true transmission early; choose the right person to teach—vows sworn like the sea; when the moment comes to ingest, virtue must come first.”*",
      "overlap_context": "teenth-day moon—the precise moment for gathering. When this phenomenon appears before the eyes, the true midnight hour arrives. For when regulated with martial fire, the true midnight and true noon hours are born.\n\n*“The tiger inhales the dragon’s soul—timing comes naturally.”*\nWhen yang arises from the formless, it comes from without to within, traveling from the yin heel vessel to the Gate of Life, stirring the outer kidneys. As it surges upward to the heart, one becomes aware of its movement.",
      "start_char": 10194,
      "end_char": 11479,
      "start_sentence": 460,
      "end_sentence": 516,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.94926142692566,
      "metadata": {
        "source_file": "dao\\藏外\\大道真传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "大药难采，鹊桥甚险，必须得传后，方可下手做功。 而为师者，授徒亦须谨慎，必经海誓山盟，方可传授。 且大药之遇机关服食，全凭德性，若德薄福浅，行功必有魔障。 《悟真篇》曰：“大道修之有易难，也知由我亦由天。 若非积行修功德，动有群魔作障缘。 ”即此是也。 “寂照十月兮不昧觉禅”者。 十月中一意定忘，所谓“增忘减定”之功，行大周天以后事也。 “二气休休兮性定胎圆，阳纯阴尽兮雪花飘迁”者。 此时大周天已过，可以得六通而出神入化。 既已阴尽阳纯，眼前见有雪花飘飘之景也。 “超出三界兮乳哺在上田”者。 此时超出三界，可以出神，故移在上田也。 初时丹在下田，至大周天时，丹在中田。 此时之丹，则移入上田矣。 中田即脐上也。 “无去无来兮坦荡逍遥仙，夙缘偶逢兮早修莫挨年，休待老来临头兮枯骨无资空熬煎”者。 此时无拘无束，逍遥自在矣。",
      "translated_text": "The great elixir is difficult to gather, the magpie bridges perilous—one must receive the true transmission before attempting the work. And the master, in teaching disciples, must also exercise utmost care, requiring solemn vows like mountains and seas before imparting the teachings. Moreover, the moment for ingesting the great elixir depends entirely on virtue; if one’s virtue is shallow and blessings meager, demonic obstructions will surely arise during practice. As the *Wuzhen Pian* states: *“The great Dao is easy or difficult to cultivate—know that it depends on both self and Heaven. Without accumulating merit and refining virtue, at every turn hordes of demons will obstruct the path.”* This is precisely the case.\n\n*“Ten months of silent illumination—unobscured awakened meditation.”* For ten months, one maintains single-minded stillness, forgetting all else—this is the work of “increasing forgetfulness and diminishing fixation,” practiced after the major celestial cycle.\n\n*“The two qi at rest—nature stabilized, the embryo perfected; yin exhausted, yang pure—snowflakes drift and scatter.”* At this stage, the major celestial cycle has passed, and one may attain the six penetrations, transcending form to enter transformation. With yin fully spent and yang pure, snowflakes appear to drift before the eyes.\n\n*“Transcending the three realms—nourishment in the upper field.”* Having transcended the three realms, one may project spirit outward, thus the elixir is moved to the upper field. Initially, the elixir resided in the lower field; during the major celestial cycle, it ascended to the middle field. Now, the elixir has entered the upper field—the middle field being above the navel.\n\n*“No coming, no going—unfettered, a carefree immortal; karmic conditions fortuitously met—cultivate early, delay not the years. Do not wait until old age arrives—withered bones hold no resources, only vain suffering.”* At this stage, one is unbound, free and at ease. If fortunate karmic conditions arise, practice early—do not procrastinate. For to wait until old age is to face withered bones and empty torment.",
      "overlap_context": "\n\n*“Beware the perilous path—the mechanism is most profound.”* The path refers to the upper and lower magpie bridges; one must guard against danger and peril. The mechanism also refers to the upper and lower magpie bridges, most subtle and mysterious, for there is the risk of the elixir escaping—one must be vigilant.\n\n*“Seek earnestly, with sorrow—find the true transmission early; choose the right person to teach—vows sworn like the sea; when the moment comes to ingest, virtue must come first.”*",
      "start_char": 11479,
      "end_char": 11842,
      "start_sentence": 517,
      "end_sentence": 534,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 138.06672835350037,
      "metadata": {
        "source_file": "dao\\藏外\\大道真传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "结尾数语，即神仙得诀须早修，不要老来再做之意也。 真人劝世度人之苦心，于此可见矣。 此歌于全部丹法，皆已涉及，而详于小周天； 至大周天功夫，不过举其大略而已。 《龙门秘旨》各章中，惟《小周天歌》与此《大道歌》二章，确系为邱祖所作，其余理虽无差，恐非邱祖嫡笔，观其文辞即可明白，因落笔措辞皆有不同故也。 上述所讲一年温养功夫，必须定忘平均。 如定十分钟，忘亦十分钟； 定一点钟，忘也须一点钟； 定两点钟，忘亦须两点钟。 盖忘多即寒而丹嫩； 定多即燥而丹老，必须不寒不燥方可也。 初下手时，须注意令其平均，久之纯熟，则任其自然，神气自能终日行之而得其平均也。 一年温养，实为大周天而设，使内丹生药，方可行天周天功夫。 故筑基毕后，即须从事一年温养。 必其专一行持，使一点一点积聚起来，身中渐积渐多，方生先天之先天，方是行大周天之时也。 到得温养已足，得药已满之时，则眼前有相，即见一黑球，内中有白，初与脐平，渐则上升到眉间； 再加温养，即变为红球，此即行大周天时所用者也。 《黄庭经》曰：“积精累气以成真。 ”每日积累生药，即“积精累气以成真”也。 然必须定忘平均，方有效验。 此项温养一年功夫，若做得良好，即过大周天无险难。 做到自然神觉，即能按时自然定忘无误。 大周天之能否做成，全视一年温养功夫是否良好以为准则，学者必须加意也。 大道真传口诀第四讲 前两回讲至温养。 所谓温养内丹者，在使内丹充满于一身，化为金液，谓之金液还丹。 盖金液充满于身，然后能生外药，谓之大药。 诸书对于此项温养调停火候之功，多不详说，皆于百日行功后，紧接说大周天。 其实内丹虽结，只有丹原而不满足，不能化为金液，必须温养变化之后，方可行大周天。 百日后生丹原，定于下田，谓之精根。 精根温养后，方能充满于一身，而化为金液，是即混元至精。 所谓采取、封固、烹炼，皆此混元至精也。 既化金液，方生大丹。 大丹为大周天之丹，有色、有相者也。 唯其有色有相，因而谓为外药，为大丹也。 然温养到若何程度，方可行大周天？ 此不可不知也。 夫日日定忘，自然生神觉，而火候由之主持，不用识神温养，自然水火平均，安而后虑，虑而后得，一得永得矣。 终日定忘平均，真息开阖，无形之中，内丹渐渐化为金液，而我不自知之，唯觉六脉已停，气皆归根，脉细而几至于无，呼吸已停，赤血皆化为白血。 迨至金液已满，改由毛孔呼吸，而渐渐无中生有矣。 吾人已结内丹，则腹中有宝，譬如牛之有黄。 人之有宝，内有宝则外必有相，即在温养之时，显现于眼前空中，有一个黑圈〇 , 初见时与脐相平，渐渐上升而渐大。 初唯灯下可见，而日中不见，继而日中亦可见之矣。 其物内白外黑。 《悟真篇》曰：“黑中有白为丹母，雄里怀雌见宝珍”是也。 所谓丹母者，大丹之母也，其形如球而中空，谓为雌者，以其中空故也。 此为人身之宝，是丹亦是金丹，周流在黄庭一路。 此时仍用定忘平均，见相不着，应定时仍定，应忘时仍忘，则过若干时后，黑球变成一红球矣。 初形仅一点，积久而其大如桔，谓之朱桔。",
      "translated_text": "These closing lines convey the essential truth that one must cultivate the immortal’s method early—never waiting until old age. Here we see the true adept’s earnest compassion in guiding others toward liberation. This song encompasses the entirety of elixir arts, with particular detail on the minor celestial cycle; as for the major celestial cycle, it merely outlines its broad contours.\n\nAmong the chapters of *The Secret Teachings of the Dragon Gate*, only *The Song of the Minor Celestial Cycle* and this *Song of the Great Way* are confirmed as works of Patriarch Qiu. Though the principles in the remaining chapters are sound, they likely do not stem from his direct hand—this is evident in their differing diction and phrasing.\n\nThe year-long *wēnyǎng* (warm-nurturing) practice described above demands balanced *dìng* (stabilization) and *wàng* (forgetting). If one stabilizes for ten minutes, one must forget for ten minutes; if one stabilizes for an hour, one must forget for an hour; if two hours, then two hours of forgetting. For excessive forgetting chills the elixir, leaving it tender, while excessive stabilization dries it, rendering it overripe—only a state neither cold nor dry will suffice. At the outset, one must carefully maintain this balance; with prolonged practice, it becomes effortless, and spirit and qi will naturally sustain equilibrium throughout the day.\n\nThis year of warm-nurturing is specifically designed for the major celestial cycle, allowing the inner elixir’s generative medicine to circulate through the celestial orbit. Thus, upon completing foundational work, one must immediately undertake a year of warm-nurturing. Through unwavering devotion, the medicine accumulates bit by bit, gradually filling the body until it generates the *xiāntiān zhī xiāntiān* (prior Heaven of prior Heaven)—only then is one ready for the major celestial cycle.\n\nWhen warm-nurturing is complete and the medicine fully matured, a vision appears before the eyes: a black sphere with a white center, initially level with the navel, then gradually ascending to the space between the brows. With further nurturing, it transforms into a red sphere—this is the medicine employed in the major celestial cycle.\n\nAs the *Yellow Court Classic* states: *“Accumulate essence, amass qi to become true.”* Daily accumulation of generative medicine is precisely this “accumulation of essence and amassing of qi to become true.” Yet only with balanced stabilization and forgetting will there be tangible results. If this year of warm-nurturing is executed well, the major celestial cycle will proceed without peril. When natural spiritual awareness arises, stabilization and forgetting occur spontaneously and flawlessly. The success of the major celestial cycle hinges entirely on the quality of this year’s warm-nurturing—practitioners must take heed.\n\n**Fourth Lecture on the Oral Transmission of the Great Way**\nThe previous two sessions addressed warm-nurturing.\n\nWarm-nurturing the inner elixir aims to fill the entire body with it, transmuting it into golden liquid—this is called the *jīnyè huándān* (golden liquid returned elixir). Only when the golden liquid saturates the body can it generate the *wàiyào* (external medicine), known as the *dàyào* (great medicine). Most texts gloss over the details of this warm-nurturing and fire-regulation process, proceeding directly to the major celestial cycle after a hundred days of practice. In truth, though the inner elixir may form, it remains merely a *dānyuán* (elixir origin) and is not yet full—only after warm-nurturing and transformation can the major celestial cycle begin.\n\nAfter a hundred days, the elixir origin takes root in the lower field, called the *jīnggēn* (essence root). Only after warm-nurturing can it fill the entire body and transmute into golden liquid, becoming the *hùnyuán zhìjīng* (primordial perfect essence). All processes—gathering, sealing, refining—pertain to this primordial perfect essence. Once transmuted into golden liquid, the great elixir is born. The great elixir is the medicine of the major celestial cycle, possessing form and appearance—hence it is termed the external medicine or great elixir.\n\nBut to what degree must warm-nurturing progress before the major celestial cycle can commence? This must be understood. Through daily stabilization and forgetting, natural spiritual awareness arises, and the fire-regimen is thereby governed. Without relying on the *shíshén* (discriminating mind) for nurturing, water and fire naturally balance. Secure in this, one contemplates; through contemplation, one attains—once attained, it is eternally held.\n\nWith balanced stabilization and forgetting throughout the day, true breathing opens and closes imperceptibly. The inner elixir gradually transmutes into golden liquid, unbeknownst to the practitioner, who only senses the cessation of the six pulses, the return of qi to its root, the thinning of the pulse until it nearly vanishes, the halting of respiration, and the transmutation of red blood into white. Once the golden liquid is full, breathing shifts to the pores, and gradually, being arises from non-being.\n\nWhen the inner elixir is formed, the abdomen holds a treasure—like the *niúhuáng* (ox bezoar) in cattle. A person with inner treasure will manifest external signs: during warm-nurturing, a black circle (〇) appears in the space before the eyes, initially level with the navel, then gradually ascending and expanding. At first, it is visible only by lamplight, not in daylight, but later, it becomes visible even in sunlight. The object is white within and black without.\n\nAs the *Awakening to Reality* states: *“Within blackness lies white—the elixir’s mother; within the male, the female harbors the precious treasure.”* This “elixir mother” is the progenitor of the great elixir. Its form is spherical and hollow—hence it is called “female,” for it is empty within. This is the body’s treasure, both elixir and golden elixir, circulating along the path of the Yellow Court.\n\nAt this stage, one continues balanced stabilization and forgetting, neither clinging to nor rejecting the vision. When stabilization is due, stabilize; when forgetting is due, forget. After some time, the black sphere transforms into a red one. Initially, it is but a speck; with prolonged accumulation, it grows to the size of a tangerine—this is called the *zhūjú* (vermilion tangerine).",
      "overlap_context": ". Now, the elixir has entered the upper field—the middle field being above the navel.\n\n*“No coming, no going—unfettered, a carefree immortal; karmic conditions fortuitously met—cultivate early, delay not the years. Do not wait until old age arrives—withered bones hold no resources, only vain suffering.”* At this stage, one is unbound, free and at ease. If fortunate karmic conditions arise, practice early—do not procrastinate. For to wait until old age is to face withered bones and empty torment.",
      "start_char": 11842,
      "end_char": 13074,
      "start_sentence": 535,
      "end_sentence": 584,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 51.7452073097229,
      "metadata": {
        "source_file": "dao\\藏外\\大道真传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "既变成为朱桔之时，是即外丹也，是即大药也。 所谓大周天之功，即应在此时行之矣。 丹原即内丹之基也，用温养以光大之，渐积而成珠，成朱桔。 若就此采取烹炼，是即行大周天之功也。 大周天与小周天不同，七日之间，终日混沌，所谓“七日混沌，死而复生”是也。 否则外丹不成。 大周天七日死后复生，此七日中，无异于死，即是混沌之景象也。 混混沌沌，死而复生，有此七日之死，方可以经万年而不死。 夫得内丹者，不过已失去之真阳仍返于吾身而已。 至此则日日金生，积久而得先天之先天。 既得此物，方能去历劫之阴气，化一身之魂魄，达到无生之境。 法身成立，从而出神，故此功实为最要，最要而不可或忽者也。 夫此工甚为难能，仅仅经七日之久，而逐识神，绝中阴之魂魄，化历劫以来父母遗传，及己身所带有气质食色之宿业根性，因而有种种之魔障，亦固其所。 盖此魔非他物，实即识神也； 魂魄者，历劫以来遗留之业根也，在在皆可为吾人入道之障碍。 必经过七日之锻炼，即行化去。 故生平经历各事，皆潮上心来，与我有关系之人物，亦皆于目前出现，不但本生，更追溯而至于无始劫来所经历之事及人。 盖过大周天，即《西游记》之过火焰山也，须用芭蕉扇以息火，方可过山。 扇系木质而为罗刹女之物。 罗刹女即牛魔王之妻，牛魔王即坤土，罗刹女是兑金，须用纯阴之功，即还虚是也。 坤卦六爻，皆为虚境，必须一切皆空，所谓法相非法相，皆须空尽而等于太虚，方可过此难关。 倘不能空，譬如火上加火，而有危险矣，故应慎之又慎也。 然此时已经过一年温养之功，平日炼虚已久，若能得力自然，空空洞洞，见相不着，而安稳过去矣。 苟或不然，则临时仍有动念着相之事，即处处有危险也。 所以一年温养工夫为最要也。 其法当温养中之定忘平均，以之调停水火也。 既已平均，渐积而生一黑圈，仍然用定忘平均工夫。 待到渐大，黑中有白之时，即应用过大周天之预备功夫也。 在用功定忘之时，而忽黑中有白之球，白天亦能显现于眼前，此时即应增忘减定，忘时须多而定时须少，如以一时忘，即以半时定是也。 忘者，万念皆空是也。 定尚着意，此中尚有真意，忘则完全去尽，一物不留矣。 用增忘减定功夫，即损之又损，先损后有益是也。 此时必须忘时多而定时少，例如前此定忘平均，为定忘各两时，此时应定一时半而忘二时半。 又从此渐增而渐减。 朱桔生则外丹足而又足，外相之圈亦愈积愈大矣。 定字尚有法相，虽系自然神觉，而元神尚须用力。 忘则一物不存，法相亦空矣。 定尚有微意，太极之体也； 忘纯为虚空，无极之体也。 定用自然神觉，忘则并自然神觉亦忘之矣。 定时用心尚重，忘则到无心之境矣。 忘功多则外丹愈足，迨至忘最多而定几乎无时，朱桔即大放光明矣，在眼前忽上忽下。 到过大周天之时，则去定用忘，完全忘去，一物不知，万象皆寂，完全太空，与太虚同体矣。 此即“损之又损，以至于无为”是也。 损之又损，即增忘减定； 无为即大忘之时也。 朱桔，丹经又曰火珠，又曰玄珠，又曰水底玄珠，亦曰火球，此时行大周天之景象到矣。 其证验不一种，即六种震动是：六根（眼耳鼻舌身意）震动，一也；",
      "translated_text": "Once the transformation into the *zhūjú* (vermilion tangerine) is complete, this is the external elixir, the Great Medicine. The work of the Great Celestial Cycle should now commence. The elixir is originally the foundation of the internal elixir, nurtured and expanded through gentle cultivation until it gradually coalesces into a pearl, then into the vermilion tangerine. If one proceeds to gather and refine it at this stage, this is the practice of the Great Celestial Cycle.\n\nThe Great Celestial Cycle differs from the Small Celestial Cycle. For seven days, one remains in primordial chaos—this is what is meant by *“seven days of chaos, death and rebirth.”* Without this, the external elixir cannot form. After the seven-day death of the Great Celestial Cycle, one is reborn. During these seven days, one is no different from the dead, immersed in the state of chaos. Only through this seven-day death can one attain immortality for ten thousand years.\n\nThose who attain the internal elixir have merely returned the lost true yang to their bodies. From this point onward, gold is generated daily, and over time, one reaches the primordial before the primordial. Only with this substance can one dispel the yin qi of kalpas past, transform the hun and po of the entire body, and arrive at the realm of non-arising. The Dharma-body is established, and from it, the spirit emerges—thus, this practice is of utmost importance and must not be neglected.\n\nThis work is exceedingly difficult. In merely seven days, one must expel the discriminating mind, sever the hun and po of the intermediate state, and dissolve the karmic roots of past lives inherited from parents and accumulated through one’s own temperament, diet, and desires. It is only natural that various demonic obstructions arise. These demons are none other than the discriminating mind itself; the hun and po are the karmic roots left from kalpas past, ever-present obstacles to one’s entry onto the Dao.\n\nOnly after seven days of refinement are they transmuted. Thus, all events from one’s life surge into the mind, and all persons connected to oneself appear before the eyes—not only from this life but also from the beginningless kalpas of the past. Passing the Great Celestial Cycle is like crossing the Flaming Mountains in *Journey to the West*; one must use the Plantain Fan to quell the flames before the passage is possible. The fan, made of wood, belongs to Princess Iron Fan. She is the wife of the Bull Demon King, who represents *kūn* earth, while she embodies *duì* metal. One must employ the pure yin practice of returning to emptiness. The six lines of the *kūn* hexagram all represent empty states; everything must be voided—all dharmas and non-dharmas—equated with the Great Void before this perilous threshold can be crossed. If one cannot empty oneself, it is like adding fire to fire, and danger arises. Thus, one must proceed with the utmost caution.\n\nYet by this time, one has already undergone a year of gentle cultivation, and the practice of emptying has been long established. If one remains steadfast, naturally empty and hollow, perceiving forms without attachment, the passage will be secure. If not, and thoughts or attachments arise at this critical moment, danger lurks at every turn. Therefore, the year of gentle cultivation is of paramount importance.\n\nThe method lies in balancing stabilization and forgetting during gentle cultivation to harmonize water and fire. Once equilibrium is achieved, a black circle gradually forms. One continues the practice of balanced stabilization and forgetting. As it grows larger and black gives way to white within, the preparatory work for the Great Celestial Cycle begins.\n\nDuring the practice of stabilization and forgetting, if a white sphere suddenly appears within the black, visible even in broad daylight, one must increase forgetting and decrease stabilization—more time in forgetting, less in stabilization. For example, if one previously balanced two hours of stabilization with two of forgetting, now one should stabilize for an hour and a half and forget for two and a half, gradually increasing and decreasing accordingly.\n\nForgetting means emptying all thoughts. Stabilization still involves intention, retaining a trace of true intent, whereas forgetting eradicates everything, leaving nothing behind. Increasing forgetting and decreasing stabilization is the practice of *“reducing again and again, first reducing to benefit later.”* At this stage, forgetting must predominate while stabilization diminishes. For instance, if stabilization and forgetting were previously equal at two hours each, now one should stabilize for an hour and a half and forget for two and a half, progressively adjusting the ratio.\n\nAs the vermilion tangerine forms, the external elixir becomes ever more abundant, and the external circle grows larger. Stabilization still retains a dharma-form, though it arises from natural spirit-awareness; the primordial spirit must still exert effort. Forgetting leaves nothing behind, even the dharma-form is emptied. Stabilization involves subtle intent, the body of the Supreme Ultimate; forgetting is pure emptiness, the body of the Ultimateless. Stabilization employs natural spirit-awareness, while forgetting even this awareness is forgotten. Stabilization requires greater mental effort; forgetting arrives at the state of no-mind.\n\nThe more one practices forgetting, the more the external elixir flourishes. When forgetting reaches its peak and stabilization nearly vanishes, the vermilion tangerine radiates brilliant light, moving up and down before the eyes. At the time of the Great Celestial Cycle, one abandons stabilization and employs forgetting entirely, eradicating all things, knowing nothing, all phenomena stilled, utterly empty—merged with the Great Void. This is *“reducing again and again, until non-doing is attained.”* Reducing again and again means increasing forgetting and decreasing stabilization; non-doing is the time of great forgetting.\n\nThe *zhūjú* is also called the Fire Pearl, the Mysterious Pearl, the Mysterious Pearl at the Water’s Bottom, or the Fire Sphere in the alchemical classics. Now, the phenomena of the Great Celestial Cycle manifest. The signs are manifold, beginning with the Six Shocks: the six senses (eyes, ears, nose, tongue, body, and mind) tremble—this is the first.",
      "overlap_context": ". This is the body’s treasure, both elixir and golden elixir, circulating along the path of the Yellow Court.\n\nAt this stage, one continues balanced stabilization and forgetting, neither clinging to nor rejecting the vision. When stabilization is due, stabilize; when forgetting is due, forget. After some time, the black sphere transforms into a red one. Initially, it is but a speck; with prolonged accumulation, it grows to the size of a tangerine—this is called the *zhūjú* (vermilion tangerine).",
      "start_char": 13074,
      "end_char": 14318,
      "start_sentence": 585,
      "end_sentence": 632,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.729545831680298,
      "metadata": {
        "source_file": "dao\\藏外\\大道真传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "脑后生风，二也； 眼有金光，三也； 鼻有搐气，塞而不通，四也； 两肾汤煎，膀胱火热，内肾如在汤中煎熬，五也； 外面火球忽上忽下，六也。 此项六种景象，皆属于身，最怕不能忘身而动念，所以忘为最要也。 必须不识不知，完全忘去方可。 倘不能大忘，则药不能上行，丹不能成矣。 是在完全忘了，心与太虚同体，此即火里炼丹，故曰过火焰山也。 然仍是一相不着，而一意不散，身在太虚之中也。 此功虽难，而实非难，先能将温养功夫做好，自然能忘，可以毋容忧虑也。 温养已久，到此自入于忘，自然神能觉知，而仍忘而无为也。 一到玄珠有象时，即日日忘而归于太虚。 到此行功已熟，能自自然然，大忘特忘，而同于太空也。 此六项，佛家名为六种震动。 因此时内外真阳满足，将历劫以来阴气逐出，故有此种种景象，如三昧火烧身一样。 除此六种外，尚有一种景象，即痒生毛窍是也。 周身八万四千毛孔发痒，如炒豆然，即周身金液往外流注之故。 此在采取之时，当即生物之时也。 兹将《龙门秘旨》中《采大药赋》述之，并详为解释如下：",
      "translated_text": "A breeze arises behind the brain—this is the second. Golden light appears in the eyes—this is the third. The nose twitches with qi, blocked and impassable—this is the fourth. The two kidneys boil like soup, the bladder burns with fire, and the inner kidneys feel scorched as if simmered in broth—this is the fifth. Externally, the Fire Sphere darts up and down—this is the sixth. These six phenomena all pertain to the body. The greatest danger lies in failing to forget the body and instead stirring thoughts; thus, forgetting is of utmost importance. One must remain utterly unaware, entirely forgotten, to proceed. If one cannot achieve great forgetting, the medicine will not ascend, and the elixir will not form. Only when completely forgotten, when the heart merges with the Great Void, does one refine the elixir within fire—hence the saying, *\"crossing the Fiery Mountain.\"* Yet even then, not a single form is grasped, not a single thought scattered; the body abides within the Great Void.\n\nThough this practice may seem difficult, it is not truly so. If one first masters the work of *wēnyǎng* (nurturing), forgetting will come naturally, and there need be no cause for concern. With *wēnyǎng* cultivated over time, one enters forgetting spontaneously, where the spirit remains aware yet still forgets and acts without doing. Once the Mysterious Pearl takes form, one forgets day by day, returning to the Great Void. At this stage, the practice becomes effortless—one forgets profoundly, merging with the Great Emptiness.\n\nThese six phenomena are called the Six Shocks in Buddhism. At this time, true yang is full within and without, expelling the yin qi accumulated over countless kalpas, giving rise to these various signs, like the body ablaze with *samādhi* fire. Beyond these six, there is another phenomenon: itching in the pores. The eighty-four thousand pores across the body itch like roasting beans, as the Golden Fluid flows outward throughout. This occurs during the moment of *cǎiqǔ* (gathering the medicine), when the generative essence arises.\n\nHere follows the *\"Rhapsody on Gathering the Great Medicine\"* from the *Secret Teachings of the Dragon Gate*, with detailed explanations below:",
      "overlap_context": "oing is attained.”* Reducing again and again means increasing forgetting and decreasing stabilization; non-doing is the time of great forgetting.\n\nThe *zhūjú* is also called the Fire Pearl, the Mysterious Pearl, the Mysterious Pearl at the Water’s Bottom, or the Fire Sphere in the alchemical classics. Now, the phenomena of the Great Celestial Cycle manifest. The signs are manifold, beginning with the Six Shocks: the six senses (eyes, ears, nose, tongue, body, and mind) tremble—this is the first.",
      "start_char": 14318,
      "end_char": 14745,
      "start_sentence": 633,
      "end_sentence": 652,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.921718835830688,
      "metadata": {
        "source_file": "dao\\藏外\\大道真传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "“百日气足兮止火景到，待至三至兮采元精”者。 待至三至，即阳光三现时也，即须止火，而采封之，大药因百日气足而生也。 “真土擒铅兮归于本穴”者。 即气归根，百神亦归根也。 “龙从东至兮炁足神凝”者。 此即表到时也。 上句为铅，到此为小周天之结丹也。 “乾住坤宫兮形神相合”者。 即调停火候，定忘平均之工夫也。 乾，有也； 坤，无也。 以有归无，即定忘在外，是为温养功夫。 丹书俱在，不另详说，此章仅此一句而已。 “七日天机兮火候无心”者。 大周天为无心之火，与小周天不同。 小周天有阳动阳举而觉等等，皆为有心，此则无心也。 “忘形罔象兮真意不散”者。 此项真意，自自然然，在虚空中，而忘既形罔象，方能一点真意不散也。 “道在无为兮问之无云”者。 此道全在无为，而不能说出来，无法可说，一物不有，毫无功夫也。 “静合一候兮七日来复”者。 照此虚极静笃做去，大周天大药方生，方有七日周天之景象也。 “月圆魄足兮大药道灵”者。 月圆精足，即是大药，故曰“大药道灵”。 此时眼前有一轮明月照于窗前，复有一轮红日上来与之相并，是为日月合璧。 此等皆外向之虚景也。 “阳内癸生兮火珠之象”者。 火珠即火球。 丹结外间，即见火球之象，近在眼前，忽而上升，忽而下落，与狐狸之炼丹相同也。 火球一上一下，即是升降，亦即周天也。 “上朝离位兮复归坤原”者。 此火球上朝于离位之顶上，而复归于腹下之坤原。 其上下若干度，人皆见之，而我则大忘特忘，一物不知。 其时外面一升一降，腹内真息一开一阖也。 “因驰小腹兮转冲尾闾”者。 此球亦由背后上去，到前面下来，忽上忽下，气足则由后上而前下矣。 此时身上小腹中之阳气，亦从尾闾上冲心脏。 到尾闾时，或恐走丹，走丹即为放屁，即须紧撮肛门。 然已大忘特忘，忘形忘物，一物不知，无法行此紧撮之功，故必须有法以防之。 即用一木塞，上裹以棉，塞住谷道。 因气往下冲，若不闭谷道，恐有走丹之事也。 此为下鹊桥之危险，须塞谷道。 至上鹊桥之危险，亦同须紧塞鼻孔也。 “此皆药力兮天机自然”者。 凡上所说冲尾闾之事，皆因药力，皆为自然天机。 此时真意与虚空同体，不识不知，不能以意引之也。 或谓可以意引之者，是知此时情形之故，要皆为自然天机耳。 “尾闾三穴兮精髓充满，鹊桥须度兮要问真仙”者。 尾闾有三窍，皆为精髓所充塞者，兹以图明之：（见图二） 尾闾三穴皆充满，欲度此窍须问真仙方知。 倘能冲过此穴，而往上行，则大药已得之矣。 然若已过下鹊桥，而不能过上鹊桥之危险，亦会得而复失也。 此气度下鹊桥而上行，再过命门、夹脊两关，共为三关，三关计九窍，是为“一箭射穿九重铁鼓”。 此等九窍，皆有精髓充塞，非先天真炁，不能冲开，故谓三关九窍，皆须先天真炁方开，其余无论何物不能开之也。 过大周天有吸、闭、撮、舐四诀。 吸者，气上行而走，不行过去之时用之，有时力薄，到命门等处，开窍稍停不行时，须用微微呼吸以通之。 盖不能过关之时，即须微微用定也。 此为阳不足而生，温养已熟，阳已足时，则无此弊，可不必用之也。 三百周天中亦唯首二次有之，其余则无此也。",
      "translated_text": "“When the qi is full after a hundred days, the cessation of fire arrives; await the Three Arrivals to gather the primordial essence.” The Three Arrivals refer to the three manifestations of yang light. At this moment, one must cease the fire and gather the medicine, for the Great Medicine arises only when the qi is full after a hundred days.\n\n“When true earth seizes lead, it returns to the original cavity.” This is the qi returning to its root, and the hundred spirits likewise returning to their root.\n\n“When the dragon arrives from the east, the qi is full and spirit congeals.” This marks the appointed time. The preceding line speaks of lead; here, the Elixir is formed in the minor celestial cycle.\n\n“When Qian resides in Kun’s palace, form and spirit unite.” This is the work of regulating the firing times, the practice of settling into equanimity and forgetting. Qian is being; Kun is non-being. To return being to non-being is to abide in stillness and forgetfulness—this is the work of gentle nurturing. The alchemical texts all address this, and no further explanation is needed; this chapter contains only this one line.\n\n“After seven days, the celestial mechanism operates without intention.” The major celestial cycle is a fire without intention, unlike the minor cycle. In the minor cycle, there are sensations of yang stirring and rising—all these are intentional. Here, there is no intention.\n\n“Forgetting form and image, the true intention does not scatter.” This true intention arises naturally of itself, within the emptiness. Only by forgetting both form and image can the single point of true intention remain undispersed.\n\n“The Dao abides in non-action; to ask of it is to find no words.” This Dao resides entirely in non-action; it cannot be spoken, nor can any method be described. There is not a single thing, not the slightest effort.\n\n“In stillness, after one watch, the seven-day return comes.” Proceeding with utmost emptiness and profound stillness, the Great Medicine of the major celestial cycle is born, and the phenomenon of the seven-day cycle appears.\n\n“When the moon is full and its essence complete, the Great Medicine’s Dao is efficacious.” The full moon and complete essence are the Great Medicine—hence, “the Great Medicine’s Dao is efficacious.” At this time, before one’s eyes appears a bright moon shining at the window, and a red sun rises to meet it—this is the union of sun and moon. All these are external, illusory visions.\n\n“When gui arises within yang, the image of the fire pearl appears.” The fire pearl is a fireball. When the Elixir forms externally, the image of a fireball appears before the eyes, now rising, now falling, much like the fox’s alchemical refinement. The fireball’s ascent and descent are the rising and falling, the celestial cycle.\n\n“It ascends to Li’s position and returns to Kun’s origin.” The fireball ascends to the top of Li’s position and returns to Kun’s origin below the abdomen. Its rising and falling are visible to all, yet I am utterly forgetful, knowing nothing of any thing. At this time, externally, it ascends and descends, while internally, the true breath opens and closes.\n\n“Driven by the lower abdomen, it surges through the tailbone.” This ball also rises from the back and descends in front, rising and falling. When the qi is full, it ascends from behind and descends in front. At this time, the yang qi in the lower abdomen also surges upward from the tailbone toward the heart. When it reaches the tailbone, one may fear the Elixir will escape—this escape is like passing gas—so one must tightly contract the anus. Yet, having utterly forgotten both form and things, knowing nothing, one cannot perform this contraction. Thus, a method is needed to prevent this: use a wooden plug wrapped in cotton to seal the perineum. Since the qi surges downward, if the perineum is not closed, the Elixir may escape. This is the danger of the lower Magpie Bridge, requiring the sealing of the perineum. The danger of the upper Magpie Bridge likewise requires tightly sealing the nostrils.\n\n“All these are the power of the medicine, the natural celestial mechanism.” All the aforementioned surging through the tailbone arises from the medicine’s power and is the natural celestial mechanism. At this time, the true intention is one with emptiness, unaware and unknowing—it cannot be guided by intention. Those who claim it can be guided by intention merely understand the circumstances of this moment; all is the natural celestial mechanism.\n\n“The three cavities of the tailbone are filled with essence and marrow; to cross the Magpie Bridge, one must consult a true immortal.” The tailbone has three apertures, all filled with essence and marrow. An illustration clarifies this: (see Figure 2). When the three cavities of the tailbone are full, crossing this aperture requires consulting a true immortal. If one can surge through this cavity and ascend, the Great Medicine is obtained. Yet, even if the lower Magpie Bridge is crossed, failing to pass the upper Magpie Bridge’s danger results in gaining and then losing it. This qi crosses the lower Magpie Bridge and ascends, then passes the Gate of Life and the Jiaji Pass—together, these are the Three Passes, comprising nine apertures, known as “one arrow piercing nine layers of iron drums.” These nine apertures are all filled with essence and marrow; without the primordial true qi, they cannot be opened. Thus, the Three Passes and nine apertures can only be opened by the primordial true qi—nothing else can open them.\n\nTo traverse the major celestial cycle, there are four secrets: *absorb*, *close*, *contract*, and *lick*. *Absorb*: when the qi ascends and threatens to escape, if it does not proceed, use this method. When the force is weak and the qi pauses at the Gate of Life or other points, use gentle breathing to facilitate passage. When the pass cannot be crossed, one must gently apply stillness. This arises from insufficient yang; once the nurturing is complete and yang is full, this flaw disappears, and the method is no longer needed. Among the three hundred celestial cycles, only the first two require this; the rest do not.",
      "overlap_context": "o these various signs, like the body ablaze with *samādhi* fire. Beyond these six, there is another phenomenon: itching in the pores. The eighty-four thousand pores across the body itch like roasting beans, as the Golden Fluid flows outward throughout. This occurs during the moment of *cǎiqǔ* (gathering the medicine), when the generative essence arises.\n\nHere follows the *\"Rhapsody on Gathering the Great Medicine\"* from the *Secret Teachings of the Dragon Gate*, with detailed explanations below:",
      "start_char": 14745,
      "end_char": 16027,
      "start_sentence": 653,
      "end_sentence": 711,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 28.49053168296814,
      "metadata": {
        "source_file": "dao\\藏外\\大道真传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "闭者，闭谷道也。 撮者，上鹊桥须塞鼻孔也。 舐者，舐上颚也。 亦有以吸为内呼吸，闭为闭六门，撮为撮谷道者。 若照而讲，则吸闭皆为虚相，而不必实有此功矣。 亦有以闭为紧闭其门者，六根门头，皆可名为口，与上述闭六门之意同也。 大周天亦共须行三百次，于七日之内行毕。 大定七日而毕功。 此时如大死一番，死里求生，死后复生，皆此大周天之事也。 朱桔到而即可采取，此为自生自采，与小周天之采取不同也。 大道真传口诀第五讲 《龙门秘旨》所载《采大药赋》以下各章，大小周天功夫混杂，次序亦不清楚，须分晰观之。 兹更将《得大药赋》解释之如下： “尾闾在下兮子辰之盈 [1] ”者。 尾闾在子时之尽处。 子为药生之时。 尾闾在下兮子辰之尽者，尾闾在阴跷一窍之后也。 由子到巳有六时，由复到乾共六卦，而尾闾在丑临之间，命门在寅泰之间，到顶心则为巳与乾。 兹以图解之自明也。 “二十四椎兮骨节之初”者。 从尾闾起到顶下，共二十四节。 初节尾闾，即在子时尽之候，亦即骨节之第一节也。 （见图三） “沃焦九孔兮三岔之路”者。",
      "translated_text": "*Close*: this refers to closing the lower gate (anus). *Contract*: when ascending the Magpie Bridge, one must block the nostrils. *Lick*: this means licking the upper palate. Some interpret *absorb* as internal breathing, *close* as sealing the six gates, and *contract* as contracting the lower gate. If examined literally, however, *absorb* and *close* are merely illusory appearances, and these techniques need not be physically performed. Others take *close* to mean tightly sealing the gates—where the six sense gates may all be called \"mouths,\" aligning with the aforementioned sealing of the six gates.\n\nThe major celestial cycle must be completed three hundred times, finished within seven days. The great stabilization is achieved in seven days, culminating in the work. At this stage, one undergoes a great death, seeking life within death, reviving after death—all pertains to the major celestial cycle. When the cinnabar orange arrives, it may be gathered; this is self-generation and self-gathering, distinct from the minor celestial cycle’s gathering.\n\n**Fifth Lecture on the True Oral Transmission of the Great Dao**\nThe chapters following *Ode on Gathering the Great Elixir* in *Secret Essentials of the Dragon Gate*, which intermingle the practices of the major and minor celestial cycles and present them in unclear sequence, must be carefully distinguished. Here, *Ode on Obtaining the Great Elixir* is explained as follows:\n\n*\"The coccyx lies below, where the zi and chen hours wax.\"* The coccyx is at the end of the zi hour. Zi is the time when the elixir is born. \"The coccyx lies below, where the zi and chen hours end\" means the coccyx is behind the yinqiao aperture. From zi to si are six hours; from *Fu* to *Qian* are six hexagrams. The coccyx lies between chou and lin, the Gate of Life between yin and tai, and the crown of the head at si and *Qian*. This is clarified by the accompanying diagram.\n\n*\"The twenty-four vertebrae mark the beginning of the bone joints.\"* From the coccyx to the base of the skull are twenty-four vertebrae. The first joint, the coccyx, corresponds to the end of the zi hour—also the first of the bone joints. (See Diagram Three)\n\n*\"The scorched land of the nine apertures, the crossroads of the three forks.\"*",
      "overlap_context": " qi ascends and threatens to escape, if it does not proceed, use this method. When the force is weak and the qi pauses at the Gate of Life or other points, use gentle breathing to facilitate passage. When the pass cannot be crossed, one must gently apply stillness. This arises from insufficient yang; once the nurturing is complete and yang is full, this flaw disappears, and the method is no longer needed. Among the three hundred celestial cycles, only the first two require this; the rest do not.",
      "start_char": 16027,
      "end_char": 16482,
      "start_sentence": 712,
      "end_sentence": 736,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.219678401947021,
      "metadata": {
        "source_file": "dao\\藏外\\大道真传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "三岔路，即阴跷一窍也。 九孔即三关皆有三孔，故三三成为九孔。 佛曰：“一箭射穿九重铁鼓”是也。 此九孔皆为骨髓所充满，唯先天炁可以通之。 何以每关皆有三孔？ 修中下品丹法者，其传说中有三河之名，曰神河、精河、气河。 丹为精炁神所结成之大药，原为此精炁神之三者。 当大药上行之时，神河在中，而两边为一精一炁，三者分行而各走一孔，故有此名。 不过行则同行，住则同住而已。 “中正三窍兮行精神炁”者。 即指中间三窍，内有精神炁之分是也。 皆为象言，在此实际上，不能知有三孔，亦不能知若何行走，不过知有热气往上行而已。 “后天血脉兮贯行其下”者。 先天炁，开关无形者也，仅能觉有热气上行，而无形无相。 有此先天炁开关，而后天血脉亦从此行走矣。 后天破体之人，各关窍闭而不开，经过大周天开关，血脉亦于中行走，经此锻炼，能化赤血为白血也。 “此中甚实兮不透真精”者。 此中闭塞不透，唯先天炁可透之也，三关九窍本不通透也。 “欲度阴关兮须知玄帝”者。 欲打开此关，须知玄帝，即北方真武玄天大帝，是即坎中之阳，命门中之真阳也。 须知者，即以外药合于命门中之真阳，两者同类相感，方能打开，是亦名为五龙也。 “投身入壑兮五龙效灵”者。 身，即法身也。 我以炁透入小腹，即有自然神觉，自有“五龙捧圣”之象，亦为五龙效灵。 即先天五行真炁之大药已到尾闾，即化五归三，化三为一，攒簇于一炁，方能上达而打通各关，故曰“五龙效灵”也。 然此功究用在何处？ 夫五本中央之土，五即中也，中即空也。 完全是空，而为真空，此应身心两静，以自然神觉与太虚同体，方能上行。 倘不十分空，或有意，或着相，即不能上行也。 必须皆忘而空之，方为合法。 龙为变化不测之物，如真意能到真空境界，炁自上行，必有五龙出来也。 “捧其至体兮冉冉而上”者。 至体，即大丹、大药也。 冉冉而升，由尾闾而上行也。 “息和空意兮自致升腾”者。 到此方说明如何方能升腾，即在真息与真空元意和合，自能升而上达。 必须大忘，与太虚同体，方能自然上升，此即“五龙效灵”，亦即“五龙捧圣”也。 息者，空息、真息也。 “六门外闭兮一炁内转”者。 此时耳不闻，目不见，心无物，完全返空，真阳之炁方能上行也。 六根若一着相，周天不能运行，故曰七日如死，混混沌沌，六门皆闭。 内转者，上行也。 “三关九窍兮历历分明”者。 小周天亦有气上下，而自己不能觉知，三关九窍不分明也。 此则历历分明矣。 火珠得由北方玄帝，故曰玄珠，亦曰火珠，在外有球之相，在内有热气熏蒸。 随火球上行，历历分明，此即自然神觉，药到何处，能自觉知，此外则一物不知也。 “阳精上返兮脉关之上”者。 过了三关九窍，阳气直到顶上，是即到脉关之上也。 《悟真篇》曰：“种在乾家交感宫”是也。 到乾宫则已得药，由乾宫下行，是为减火之作用，过火焰山而火灭也。 “默默玄珠兮滚过昆仑”者。 顶为昆仑山。 由背到顶而下，是即滚过昆仑也。 “背负青天兮更图南下”者。 此为《庄子》第一篇《逍遥游》中所说，主旨在取坎填离。 其言曰：“北溟有鱼，其名为鲲。",
      "translated_text": "The three-forked crossroads are the single aperture of the yinqiao vessel. The nine apertures arise because each of the three barriers has three openings, thus three times three makes nine. The Buddha said, “An arrow pierces nine layers of iron drums”—this is the meaning. These nine apertures are all filled with marrow, and only the primordial qi can pass through them.\n\nWhy does each barrier have three openings? In the transmission of the middle and lower-grade elixir methods, there are three rivers named: the River of Spirit, the River of Essence, and the River of Qi. The elixir is the great medicine formed by the coalescence of essence, qi, and spirit—these three. When the great medicine ascends, the River of Spirit flows in the center, while the River of Essence and the River of Qi flank it on either side. The three proceed separately, each through its own aperture, hence the names. Yet when they move, they move as one; when they rest, they rest as one.\n\n*“The central three apertures, where spirit, essence, and qi flow”*—this refers to the three central apertures, where spirit, essence, and qi are distinguished. These are metaphorical expressions; in reality, one cannot perceive three separate openings nor discern how they traverse, only that a warm current ascends.\n\n*“The postnatal blood vessels course below”*—the primordial qi, which opens the barriers, is formless; one can only sense the warmth ascending, without shape or appearance. Once the primordial qi has opened the barriers, the postnatal blood vessels also traverse them. In those of postnatal constitution whose barriers remain closed, after the great celestial circuit opens the barriers, the blood vessels course through them. Through this refinement, red blood is transformed into white.\n\n*“This realm is most solid, impervious to true essence”*—it is sealed and impenetrable, and only the primordial qi can pass through. The three barriers and nine apertures are inherently blocked.\n\n*“To cross the yin barrier, one must know the Mysterious Emperor”*—to open this barrier, one must know the Mysterious Emperor, the True Martial Sovereign of the Dark Heavens of the North—this is the yang within Kan, the true yang within the Gate of Life. “Must know” means uniting the external medicine with the true yang in the Gate of Life; only when the two, being of the same kind, resonate can the barrier be opened. This is also called the Five Dragons.\n\n*“Cast the body into the ravine, where the Five Dragons manifest their efficacy”*—the body here is the dharmakāya. When qi penetrates the lower abdomen, a natural spiritual awareness arises, and the image of “the Five Dragons bearing the Sage” appears—this is the efficacy of the Five Dragons. That is, the great medicine of the primordial five-phase true qi has reached the coccyx, where the five are refined into three, and the three into one, gathering into a single qi. Only then can it ascend and open each barrier, hence “the Five Dragons manifest their efficacy.”\n\nBut where precisely is this practice applied? The five belong to earth, the center; the center is emptiness. It is complete emptiness—true emptiness. This corresponds to the stillness of both body and mind, where natural spiritual awareness merges with the great void, enabling ascent. If not utterly empty—if there is intention or attachment—it cannot ascend. One must forget all and empty the self to be in accord with the method. The dragon is a creature of unfathomable transformation; if true intent reaches the state of true emptiness, qi will naturally ascend, and the Five Dragons will emerge.\n\n*“Bearing the supreme body, it rises gently”*—the supreme body is the great elixir, the great medicine. Rising gently, it ascends from the coccyx.\n\n*“With harmonious breath and empty intent, it naturally ascends”*—only here is it explained how ascent is achieved: through the union of true breath and the primordial intent of true emptiness, it naturally rises. One must utterly forget, merging with the great void, to ascend spontaneously—this is “the Five Dragons manifest their efficacy,” also “the Five Dragons bear the Sage.”\n\nBreath here is empty breath, true breath.\n\n*“The six gates are sealed externally, while a single qi revolves within”*—at this stage, the ears hear nothing, the eyes see nothing, the mind is devoid of objects, and only in complete return to emptiness can the true yang qi ascend. If the six senses attach to phenomena, the celestial circuit cannot revolve. Hence it is said: seven days like death, in a state of undifferentiated chaos, the six gates sealed. “Revolves within” means ascending.\n\n*“The three barriers and nine apertures are distinctly clear”*—in the minor celestial circuit, qi ascends and descends, yet one remains unaware, and the three barriers and nine apertures are indistinct. Here, they become distinctly clear. The fire pearl, obtained from the Mysterious Emperor of the North, is called the Mysterious Pearl or Fire Pearl. Externally, it appears as a spherical form; internally, it radiates warmth. As the fire pearl ascends, it is distinctly perceived—this is natural spiritual awareness. One knows where the medicine has reached, yet remains unaware of all else.\n\n*“Yang essence returns upward to the pulse barrier”*—having passed the three barriers and nine apertures, the yang qi reaches the crown of the head—this is arriving above the pulse barrier. As the *Awakening to Reality* says: “Planted in Qian’s palace of mutual resonance.”\n\nUpon reaching Qian’s palace, the medicine is obtained. From Qian’s palace, it descends—this is the action of reducing the fire, passing through the Flame Mountain where the fire is extinguished.\n\n*“The silent Mysterious Pearl rolls past Kunlun”*—the crown is Kunlun Mountain. Ascending along the spine to the crown and then descending is rolling past Kunlun.\n\n*“Bearing the azure sky on its back, it then turns southward”*—this alludes to the first chapter of *Zhuangzi*, “Free and Easy Wandering,” whose essence lies in “taking from Kan to fill Li.” It says: “In the northern darkness there is a fish, its name is Kun.”",
      "overlap_context": "cyx lies between chou and lin, the Gate of Life between yin and tai, and the crown of the head at si and *Qian*. This is clarified by the accompanying diagram.\n\n*\"The twenty-four vertebrae mark the beginning of the bone joints.\"* From the coccyx to the base of the skull are twenty-four vertebrae. The first joint, the coccyx, corresponds to the end of the zi hour—also the first of the bone joints. (See Diagram Three)\n\n*\"The scorched land of the nine apertures, the crossroads of the three forks.\"*",
      "start_char": 16482,
      "end_char": 17743,
      "start_sentence": 737,
      "end_sentence": 793,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.589768409729004,
      "metadata": {
        "source_file": "dao\\藏外\\大道真传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "鲲之大，不知其几千里也。 化而为鸟，其名为鹏。 鹏之背，不知其几千里也。 怒而飞，其翼若垂天之云。 是鸟也，海运则将徙于南冥。 南冥者，天池也。 《齐谐》者，志怪者也。 《谐》之言曰：鹏之徙于南冥也，水击三千里，抟扶摇而上者九万里，去以六月息者也。 ”又曰：“风之积也不厚，则其负大翼也无力。 故九万里，则风斯在下矣，而后乃今培风。 背负青天而莫之夭阏者，而后乃今图南。 ”所谓玄漠之鲲，即玄珠也。 上行，即到顶而至南，是为图南。 六月息，即须经过六卦也、六时也。 《庄子》此篇，知道者始知其为说火候工夫，昧者则不知所云为何矣。 更图南，即到南方而下，是为一升一降，从后升而从前降，亦即为阳升阴降也。 “伸而复屈兮法天循环”者。 伸屈即阴阳也。 法天即周天也。 玄珠滚过昆仑，有上鹊桥之危险，是在明堂山根间，故到明堂，须防危险也。 上下鹊桥之险相同，皆为一实窍、一虚窍相间。 上山根，实窍也； 鼻孔，虚窍也。 下尾闾，实窍也； 肛门，虚窍也。 虚者有门，而实者有髓。 实不能通过，恐其由虚漏出，则在下者为走丹，在上者为漏丹，皆不可也。 此时已是不息，不息则无口鼻之外息，似若无妨，不知此为熟路，稍不注意，仍恐漏泄也。 为防此危险，亦自有法，须用木棉以塞之。 其实，塞否无甚关系，要在心合太虚，任其自然，即能下行而无危险矣。 “至于明堂兮须防危险”者。 此时万不可起有形之呼吸，有息即随之而漏出矣，故曰须防危险也。 “急采金丹兮上安丹田”者。 已到上丹田，即为采得，即须服食而吃于腹中。 其实非是吃下，由上丹田自行流下，即是“甘露洒须弥”也。 此甘露为水液。 《西游记》过火焰山，以芭蕉扇四十九扇，先下细细雨，而后下大雨是也。 “由斯而下兮自流玄腑”者。 顺流而下，自然到乎脏腑也。 “微微仰面兮舌舐而迎”者。 为防止上鹊桥之险，舌须仰舐上腭，面应稍仰而甘露自下。 或曰：此露即由玄膺所生者也。 “药贯舌端兮重楼而下”者。 此药随舌尖经重楼而下，入于腹。 重楼，即喉管也。 其实丹自下行，因通过喉管，故亦曰“服食”也。 “名为服食兮阶梯渐行”者。 此功应一步一步历级而行也。 “绛宫相见兮水火既济”者。 绛宫为泥丸宫之小虚空。 到绛宫即为水火既济，此时合真阴而上行，化为甘露。 既到绛宫方有先天真阴，故曰相见。 真阳与真阴相见，即是水火既济也。 “返于帝乡兮得一归宗”者。 服食之后是还丹，即得一归根也。 “精神含运兮金居于内，始名得丹兮神胎基成，诸经百脉兮归复本位，外屏内除兮太极完真”。 上列四句，为大周天初过得丹后之效验。 大周天功夫，由后升而前降，周天三百次，七日而毕，一日不计行若干次。 现所讲者，皆为首次行功而说，能首次顺利，则自然而然，安稳无难。 始终归于大忘，神胎自成，而可以出神矣。 既过大周天，诸经百脉归位，外绝六识，内除七情，从此情识消灭，归于太极之真矣。 到七日而完功，亦有仅五日而完功者。 炼已纯熟，自然致速也。 下文一段曰：“六根灭识兮六般震动，眼吐金光兮脑后鹫鸣，两肾汤煎兮丹田火炽，身涌鼻搐兮耳内生风，真炁为息兮皆有景象，精神合中兮永证长生，超脱精境兮证真无漏，更不化精兮中炁天成，斯成神质兮声先所发，大周天起兮炼炁化神。",
      "translated_text": "The Kun is so vast that none knows its measure in thousands of *li*. It transforms into a bird, whose name is Peng. The Peng’s back is so broad that none knows its measure in thousands of *li*. When it rouses itself to flight, its wings resemble clouds hanging from the sky. This bird, when the sea surges, will migrate to the Southern Darkness. The Southern Darkness is the Celestial Pond.\n\n*The Qi Xie* is a record of marvels. It says: When the Peng migrates to the Southern Darkness, it strikes the water for three thousand *li*, then spirals upward on the whirlwind to ninety thousand *li*, departing with the winds of the sixth month. It also says: If the accumulation of wind is not thick, then it has no strength to bear great wings. Thus, only at ninety thousand *li* does the wind lie beneath it, and only then can it ride the wind. Bearing the azure sky on its back, with nothing to obstruct or hinder it, only then does it turn southward.\n\nThe dark and vast Kun is none other than the Mysterious Pearl. Ascending is reaching the crown and then turning south—this is the \"turning southward.\" The \"winds of the sixth month\" signify passing through the six trigrams and the six periods. Those who understand the Dao recognize this chapter of *Zhuangzi* as describing the workings of fire-phase cultivation; those who do not remain ignorant of its meaning.\n\n\"Turning southward\" means descending after reaching the south—this is one ascent and one descent, rising from the back and descending from the front, which is also yang ascending and yin descending.\n\n*“Stretching and bending, it models the cyclic rounds of Heaven”*—stretching and bending are yin and yang. Modeling Heaven is the celestial orbit.\n\nWhen the Mysterious Pearl rolls past Kunlun, it encounters the peril of the upper Magpie Bridge, located between the Hall of Light and the root of the nose. Thus, upon reaching the Hall of Light, one must guard against danger. The perils of the upper and lower Magpie Bridges are the same, both consisting of one solid aperture and one hollow aperture alternating. The upper root of the nose is the solid aperture; the nostrils are the hollow apertures. The lower coccyx is the solid aperture; the anus is the hollow aperture. The hollow has a gate, while the solid contains marrow. The solid cannot be traversed, and if one fears leakage through the hollow, then below it is the loss of the elixir, and above it is the leakage of the elixir—both are unacceptable.\n\nAt this stage, there is no cessation of breath, and with no external respiration through mouth or nose, it may seem harmless. Yet this is a well-trodden path, and the slightest inattention may still lead to leakage. To prevent this danger, there is a method: one may use cotton to block it. In truth, whether blocked or not matters little; what is essential is that the mind merge with the Great Void and follow nature, allowing the descent to proceed without peril.\n\n*“Upon reaching the Hall of Light, one must guard against danger”*—at this moment, one must not initiate any physical breathing, for with breath comes leakage. Hence, it is said one must guard against danger.\n\n*“Swiftly gather the golden elixir and ascend to secure the Cinnabar Field”*—having reached the upper Cinnabar Field, the elixir is obtained, and one must ingest and consume it within the abdomen. In truth, it is not eaten but flows downward naturally from the upper Cinnabar Field—this is the “sweet dew sprinkling Mount Sumeru.” This sweet dew is a watery fluid. As in *Journey to the West*, when passing Flame Mountain, forty-nine sweeps of the plantain fan first bring a fine rain, followed by a great downpour.\n\n*“From here it descends, flowing naturally into the mysterious viscera”*—following the current downward, it naturally reaches the organs.\n\n*“Gently tilting the face upward, the tongue licks to welcome it”*—to guard against the peril of the upper Magpie Bridge, the tongue must press against the upper palate, the face slightly raised, allowing the sweet dew to descend. Some say this dew is born from the mysterious larynx.\n\n*“The medicine pierces the tip of the tongue and descends through the Tower of Nine Stories”*—this medicine follows the tip of the tongue, passing through the Tower of Nine Stories and entering the abdomen. The Tower of Nine Stories is the throat. In truth, the elixir descends on its own, but as it passes through the throat, it is also called “ingestion.”\n\n*“Called ingestion, it ascends the steps gradually”*—this practice must proceed step by step, stage by stage.\n\n*“Meeting in the Crimson Palace, water and fire achieve harmony”*—the Crimson Palace is the small void within the Mud Pill Palace. Reaching the Crimson Palace is the harmony of water and fire, at which point true yin merges and ascends, transforming into sweet dew. Only upon reaching the Crimson Palace does one obtain primordial true yin; hence, it is called “meeting.” True yang and true yin meeting is the harmony of water and fire.\n\n*“Returning to the Imperial Homeland, one attains unity and returns to the root”*—after ingestion comes the returning elixir, which is attaining unity and returning to the root.\n\n*“The spirit and essence contain movement, gold resides within; only then is the elixir obtained and the foundation of the spiritual embryo laid. The hundreds of channels and vessels return to their original positions; externally shielded, internally purified, the Supreme Ultimate is perfected and true.”*\n\nThe four lines above describe the effects after the first completion of the great celestial orbit and the attainment of the elixir. The great celestial orbit practice rises from the back and descends from the front, circling three hundred times over seven days, with no fixed count per day. What is discussed here pertains to the first cycle of practice; if the first cycle proceeds smoothly, then naturally and steadily, without difficulty, it culminates in great forgetfulness, the spiritual embryo forms, and one may achieve spirit departure.\n\nAfter completing the great celestial orbit, the hundreds of channels and vessels return to their positions, the six senses are extinguished externally, and the seven emotions are eliminated internally. From this point, emotions and perceptions vanish, returning to the truth of the Supreme Ultimate. The practice is completed in seven days, though some achieve it in five. With refined cultivation, the process naturally accelerates.\n\nThe following passage states:\n\n*“The six roots extinguish perception, the six kinds of shaking arise; the eyes emit golden light, the vulture cries behind the brain; the two kidneys seethe like boiling water, the Cinnabar Field blazes with fire; the body surges, the nose twitches, the ears generate wind; true qi becomes breath, all manifest signs; spirit and essence unite at the center, eternally attesting to longevity; transcending the realm of essence, one verifies true non-leakage; no longer transforming essence, the central qi is heaven-perfected; this forms the divine substance, the voice first emitted; the great celestial orbit begins, refining qi to transform spirit.”*",
      "overlap_context": "e fire, passing through the Flame Mountain where the fire is extinguished.\n\n*“The silent Mysterious Pearl rolls past Kunlun”*—the crown is Kunlun Mountain. Ascending along the spine to the crown and then descending is rolling past Kunlun.\n\n*“Bearing the azure sky on its back, it then turns southward”*—this alludes to the first chapter of *Zhuangzi*, “Free and Easy Wandering,” whose essence lies in “taking from Kan to fill Li.” It says: “In the northern darkness there is a fish, its name is Kun.”",
      "start_char": 17743,
      "end_char": 19055,
      "start_sentence": 794,
      "end_sentence": 857,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.8223237991333,
      "metadata": {
        "source_file": "dao\\藏外\\大道真传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "”上列十句，为大周天以前之景。 筑基已毕，温养已足，则永永不“漏”，此后应炼炁化神，得六种震动之景，而炼大周天也。 再大周天之险，即阴魔潮涌与上下鹊桥之险也。 上下鹊桥，只要首次慎防避免，则以后自可无妨。 大周天亦有三百周天，做功既熟，眼前即发生魔难。 盖此大周天，即是以三昧火炼身，心中之阴气，使之尽去。 阴气即魔，凡历劫以来中阴之业根，父母遗传之气质食色等等，皆是魔也。 功夫熟而难做，多在于七日之第二天发生。 此时火球忽上忽下，一上即心血来潮，平日所作所为者，皆现于目前。 如声色货利、贪嗔痴爱，种种可悲、可喜、可爱、可惧之事，形形色色，无所不有，不特此世，即历劫以来所经历者，亦无不现前。 所以炼大定功夫，无论来者若何，一切不管。 尚有天魔、地魔亦来试我定力，如心爱女色，即有如天仙之美女现于当前； 心爱银钱，即有银山金穴任我携取。 凡此等等，由外来者，曰天魔。 地魔虽由外来，亦吾心中之所感也。 其他如平生所交之友人，及已故之亲属、友朋，亦皆出现。 非真有此人、此鬼，实皆我心之魔也。 七日大周天，烧得神号鬼哭，到第五六日为最甚，第六天稍静，至第七天，则安然无事矣。 所谓三灾八难，即须明心见性，是即须真意归空也，能归空即无事矣。 先是温养中增忘减定，完全空矣。 此时若能达到一意不散，一念不生之境，儒家谓之至诚，炼心到此，方可行大周天也。 修道者，全凭德性，而德性仍在不染六尘、不着四相之中。 故《金刚经》谓：“有人能不住于相，其福甚大。 ”能到空无所空，无心、无物、无我、无人，不着一相之境，其功德最大也。 《老子》曰：“外其身而身修，忘其形而形存。 ”忘字之中，有三千八百之功德也。 能大忘，是能得大周天，可以出神而事毕矣。 至末后还虚之功夫，可做可不做也。 大周天炼过七日后，外面红球化为紫金色之光而笼罩于一身。 尚有一口诀，即出神之诀也。 大周天所炼，即在炼去情识而使之化去，炼成即为阳神，不留情识业根，即无阴气矣。 此功夫亦不可视为甚难而畏之，苟能照法步步做去，自可成功也。 此时，法、财、侣、地皆不可少。 地者，因炼大周天时须择清静山林，或须看过地势风水，不遇凶煞，择一清幽之所。 同伴者，须有三人轮流照顾，一人则不敷分布也。 法，即大周天之口诀也。 财，即衣食之资也，皆须先行备具。 又已做大周天之功夫，而大药不来，或已见红球，行功而炁不至，道家指为德性不足，须舍财以积德，盖丹为天宝，而财为世宝故也，应舍财祀天，发誓再做功夫； 儒家指为炼己不熟，故感而不应； 佛家指为有宿业，须忏悔以禳之。 佛家之言近俗； 道家之言虽有至理，而嫌太空；",
      "translated_text": "The above ten lines describe the visions preceding the Great Celestial Orbit. Once the foundation is firmly established and the nurturing phase is complete, one attains permanent \"non-leakage.\" Thereafter, one must refine *qi* to transform spirit, experiencing the six kinds of shaking, thus entering the practice of the Great Celestial Orbit.\n\nThe perils of the Great Celestial Orbit lie in the surging of yin demons and the dangers of the upper and lower Magpie Bridges. The upper and lower Magpie Bridges need only be cautiously avoided during the first attempt, after which they pose no further threat. The Great Celestial Orbit also spans three hundred cycles; once the practice becomes proficient, demonic obstacles arise before the eyes. For this Great Celestial Orbit is the refinement of the body with the fire of samadhi, expelling all yin *qi* from the heart. Yin *qi* is the demon—all karmic roots from past lives, the inherited *qi* and temperament from parents, and the influences of food and desire—all are demons. When the practice is mastered, the greatest difficulties often arise on the second day of the seven-day cycle. At this time, the fireball surges up and down; when it rises, the heart’s blood stirs, and all past actions manifest before one’s eyes. Matters of sound and form, wealth and profit, greed, anger, delusion, and attachment—all that is sorrowful, joyful, lovable, or fearful—appear in myriad forms, without exception. Not only events of this life but also those from past kalpas arise vividly. Thus, in cultivating the great samadhi, one must remain unmoved by whatever arises.\n\nHeavenly and earthly demons may also test one’s steadfastness: if the heart clings to feminine beauty, celestial maidens of divine loveliness may appear; if it covets silver and gold, mountains of treasure may be offered for the taking. All such external manifestations are called heavenly demons. Earthly demons, though externally induced, are also stirred by one’s own heart. Other apparitions may include lifelong friends or deceased relatives and companions. Yet these are not real people or ghosts—they are but demons of the heart. During the seven-day Great Celestial Orbit, the wailing of spirits and the howling of demons reach their peak by the fifth or sixth day; by the sixth day, they begin to subside, and by the seventh, all is calm.\n\nThe so-called three disasters and eight difficulties must be overcome by illuminating the mind and seeing one’s true nature—this requires the true intent to return to emptiness. If one can abide in emptiness, all obstacles vanish. First, through nurturing, one gradually forgets and diminishes attachment until complete emptiness is attained. If one can reach the state of undistracted focus and thought-free stillness—what the Confucians call \"utmost sincerity\"—only then is the heart sufficiently refined to undertake the Great Celestial Orbit.\n\nThe cultivation of the Dao depends entirely on virtue, which resides in not being stained by the six dusts or attached to the four appearances. Thus, the *Vajracchedikā Sūtra* states: *\"If one can refrain from abiding in appearances, their merit is immense.\"* To reach the state of emptiness beyond emptiness—without heart, without things, without self, without others, unattached to any appearance—is to attain the greatest merit. *Laozi* says: *\"By forgetting the self, the self is perfected; by forgetting the form, the form endures.\"* Within the act of forgetting lies three thousand eight hundred virtues. To achieve great forgetting is to accomplish the Great Celestial Orbit, allowing the spirit to depart, and the task is complete.\n\nThe subsequent practice of returning to emptiness may or may not be undertaken. After seven days of the Great Celestial Orbit, the external red orb transforms into a purplish-golden light that envelops the entire body. There is also a secret formula for the departure of the spirit. The purpose of the Great Celestial Orbit is to refine and dissolve emotional consciousness, transmuting it into the yang spirit. Once this is achieved, no karmic roots of emotional consciousness remain, and thus no yin *qi* persists.\n\nThis practice should not be feared as excessively difficult; by following the method step by step, success is assured. At this stage, the four prerequisites—method, wealth, companions, and place—are indispensable. The place must be a secluded mountain forest, its feng shui examined to avoid inauspicious influences, ensuring a tranquil and serene environment. Companions must number at least three to take turns in attendance, as one alone is insufficient.\n\nThe method refers to the oral instructions for the Great Celestial Orbit. Wealth pertains to provisions for clothing and sustenance, which must be prepared in advance. If, after undertaking the Great Celestial Orbit, the great elixir does not manifest, or if the red orb appears but *qi* fails to arrive, Daoists attribute this to insufficient virtue and advocate charitable giving to accumulate merit. For the elixir is a heavenly treasure, while wealth is a worldly treasure—one must offer wealth to the heavens, vowing to resume practice. Confucians attribute it to inadequate self-cultivation, hence the lack of response. Buddhists attribute it to past karmic obstructions, which must be repented and expiated. The Buddhist explanation is somewhat vulgar; the Daoist explanation, though profound, is overly abstract.",
      "overlap_context": "ethe like boiling water, the Cinnabar Field blazes with fire; the body surges, the nose twitches, the ears generate wind; true qi becomes breath, all manifest signs; spirit and essence unite at the center, eternally attesting to longevity; transcending the realm of essence, one verifies true non-leakage; no longer transforming essence, the central qi is heaven-perfected; this forms the divine substance, the voice first emitted; the great celestial orbit begins, refining qi to transform spirit.”*",
      "start_char": 19055,
      "end_char": 20106,
      "start_sentence": 858,
      "end_sentence": 899,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.265807390213013,
      "metadata": {
        "source_file": "dao\\藏外\\大道真传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 19,
      "original_text": "惟儒家所说，为最当也。 白玉蟾自得师传以后，自谓此道可必得，神仙可必成，临时有“夜半风雷”之患，私意拟不再炼。 张紫阳真人知之，由天台送《金丹四百字》文一卷，白受而读之，始明火候细微，由此再炼而成功； 其初稍有轻忽之意，故致此患也。 吕帝行大周天，亦三次不得，因看《入药镜》，再炼而成。 此因钟祖所传，纯阳祖未尽体会之故耳。 盖微细之节目，若不注意，亦不能得。 《悟真篇》曰：“毫发差殊不作丹。 ”学者须细味也！ 大道真传口诀第六讲",
      "translated_text": "Only the Confucian explanation is most apt. After receiving his master’s transmission, Bai Yuchan believed this Dao could surely be attained and immortality surely achieved. Yet when the moment came, he faced the peril of \"midnight wind and thunder\" and privately resolved to abandon his practice. The Perfected Zhang Ziyang, learning of this, sent from Tiantai a scroll of *Four Hundred Words on the Golden Elixir*. Upon receiving and reading it, Bai grasped the subtleties of the firing process, resumed his practice, and succeeded. His initial slight negligence had led to this peril. Even Lü Dongbin, in performing the Great Celestial Orbit, failed three times before studying the *Mirror for Ingredient Entry*, resuming his practice, and succeeding. This was because the transmission from Ancestor Zhong had not been fully embodied by Ancestor Pure Yang. For the most minute details, if not attended to, will prevent success. The *Awakening to Reality* states: \"A hair’s breadth of deviation, and the elixir will not form.\" Scholars must ponder this deeply!\n\nSixth Lecture on the Oral Instructions of the Authentic Transmission of the Great Dao",
      "overlap_context": "te this to insufficient virtue and advocate charitable giving to accumulate merit. For the elixir is a heavenly treasure, while wealth is a worldly treasure—one must offer wealth to the heavens, vowing to resume practice. Confucians attribute it to inadequate self-cultivation, hence the lack of response. Buddhists attribute it to past karmic obstructions, which must be repented and expiated. The Buddhist explanation is somewhat vulgar; the Daoist explanation, though profound, is overly abstract.",
      "start_char": 20106,
      "end_char": 20321,
      "start_sentence": 900,
      "end_sentence": 909,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.526050567626953,
      "metadata": {
        "source_file": "dao\\藏外\\大道真传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 20,
      "original_text": "大周天之后升前降，即是炼炁化神也。 在小周天炼精化炁，即采混元至精，积累凝结，以化太乙含真之炁，而交感精亦随之而化焉。 交感精既化，故能不动情欲。 炼精化炁结成内丹，化金液感摄成真阳之正炁，合之已得之阳精，以神锻炼之而成大丹焉。 小周得内丹，大周得外丹。 内为阴丹，外为阳丹。 阳丹可以锻炼识神，便归藏识，合于太虚，而业根断绝矣。 小周天所得者，为后天之先天，是为元炁，元炁结成内丹。 经过大周天，化为金液，产生大药，未服食以前为药，既服食以后为丹，是为先天之先天，是化神也。 后天之先天，经烹蒸而生红球，此红球即外丹也。 经三昧火锻炼为红色，即火气也。 所以曰炼炁化神，得此炁而化神矣。 扩而充之，可以出神； 再扩充即还虚也。 神，一也； 炁，二也； 精，三也。 由三化二，由二化一，得一而神矣。 此一即性，空性即空灵。 修道者，因此灵而得六通。 分为三则不灵，合而一即灵也。 天地间虚空中真阳之一炁，本太极之理气，最灵者也。 化而为神，无两仪、四象、五行等等，故而神也。 《中庸》曰：“其为物不二，则其生物不测。 ”一如独立而无对者，所以变化无穷而灵也。 神也者，化万物而为言者也。 大而化之之为圣，圣而不可知之之为神。 圣尚可道，神则难知。 致广大，尽精微，极高明，博厚而悠久无疆，道家指为神仙，佛家名为菩萨，皆有永久万能之意。 经过大周天后，谓为神丹，此丹即是阳神也。 火球在外之时，阳尚在外，经过七日之后，而阴尽阳纯，与神合德矣。 外来之种种魔难，即历劫以来宿业之根也。 今皆显现，以心神最灵，识神亦灵，因历劫以来之经验留有影像于识里，今将化去，须出现一次，古谓大周七日即以炼阴魔。 待将识神之影像化去，与外来阳神合而成道，所谓“形神俱化”是也。 识神元阴退尽，业根尽绝，其识全空，与元神之空体合一，所以形神俱化，聚则成形，散则成气也。 至身中精血，过大周天后，变为白膏； 至其骨肉则至坚强，可经久远不坏，唯究为重浊之物，不能飞升。 在天成象者，元神出神也； 在地成形者，即将躯壳委之于地也。 唯形身已成，为金刚不坏之体，天地坏时方坏，其余则无物能坏之也。 神去而躯壳在地，历久不坏，色身之指爪发眉等物附属于骨肉者，骨肉有灵气能长育之，故指爪发眉等仍能生长也。 试举例以明之。 山东青岛崂山上清宫中有修道者居焉，相传为明代时人，至今仍端坐于中，不食不睡亦不语。",
      "translated_text": "After the ascent and descent of the Great Celestial Orbit, one refines *qi* to transform spirit. In the Lesser Celestial Orbit, refining essence transforms it into *qi*—gathering the primordial supreme essence, accumulating and congealing it to transmute into the *qi* of Grand Unity containing true reality, whereby the generative essence is likewise transformed. Once generative essence is transformed, one remains unmoved by desire. Refining essence into *qi* forms the inner elixir, which, through the alchemy of golden fluid, attracts and coalesces into the true *qi* of yang. Combined with the yang essence already attained, it is forged by spirit into the Great Elixir. The Lesser Orbit yields the inner elixir; the Great Orbit yields the outer elixir. The inner is the yin elixir; the outer, the yang elixir. The yang elixir can forge the consciousness-spirit, returning it to the storehouse of consciousness, merging with the Great Void, and severing the roots of karmic action.\n\nWhat the Lesser Celestial Orbit attains is the \"prior-to-heaven within the posterior-to-heaven\"—this is primordial *qi*, and primordial *qi* congeals into the inner elixir. Passing through the Great Celestial Orbit, it is transmuted into golden fluid, producing the Great Medicine. Before ingestion, it is medicine; after ingestion, it is elixir—this is the \"prior-to-heaven within the prior-to-heaven,\" the transformation of spirit. The \"prior-to-heaven within the posterior-to-heaven,\" when steamed and refined, generates a red orb—this red orb is the outer elixir. Tempered by the fire of samadhi into a crimson hue, it is the fire of *qi*. Thus it is said: refining *qi* transforms spirit, and through this *qi*, spirit is transformed. Expanding and filling it, one may exteriorize spirit; expanding further, one returns to emptiness.\n\nSpirit is one; *qi* is two; essence is three. From three to two, from two to one—attaining the One, one attains spirit. This One is nature; empty nature is numinous emptiness. Those who cultivate the Dao thereby attain the six penetrations. Divided into three, it is not numinous; united as one, it is numinous. The true yang *qi* within the void of heaven and earth is the principle-*qi* of the Supreme Ultimate—most numinous indeed. Transformed into spirit, it transcends the Two Modes, Four Images, Five Phases, and so forth—hence, it is spirit. The *Doctrine of the Mean* states: \"As a thing, it is without duality, and thus its generation of things is unfathomable.\" Standing alone without counterpart, it is therefore boundlessly transformative and numinous.\n\nSpirit is that which transforms the myriad things. To be greatly transformed is to become a sage; to be a sage yet beyond knowing is to be spirit. The sage may still be spoken of, but spirit is difficult to know. Reaching vastness, exhausting subtlety, attaining utmost clarity, embracing profundity and enduring without limit—Daoists call this immortality, Buddhists name it bodhisattvahood, both connoting eternal omnipotence. After completing the Great Celestial Orbit, it is called the spirit elixir—this elixir is the yang spirit.\n\nWhen the fire orb is external, yang remains outside; after seven days, yin is exhausted and yang is pure, uniting with spirit in virtue. The various demonic obstacles that arise externally are the roots of karmic actions accumulated through kalpas past. Now they all manifest, for the mind-spirit is most numinous, and the consciousness-spirit is likewise numinous. Due to experiences from kalpas past, impressions linger within consciousness; now, as they are to be transformed, they must appear once more. The ancients spoke of the seven days of the Great Orbit as refining yin demons. When the impressions of the consciousness-spirit are transformed, they unite with the external yang spirit to accomplish the Dao—this is what is meant by \"both form and spirit are transformed.\"\n\nOnce the yin of the consciousness-spirit is fully dispelled and the roots of karma are severed, consciousness becomes utterly empty, merging with the empty substance of primordial spirit. Thus form and spirit are both transformed—gathered, they form a body; dispersed, they become *qi*. After the Great Celestial Orbit, the essence and blood within the body transmute into white paste, while the bones and flesh become exceedingly firm, enduring without decay. Yet ultimately, they remain heavy and turbid, unable to ascend. That which forms images in heaven is the exteriorization of primordial spirit; that which forms a body on earth is the relinquishment of the physical husk to the earth.\n\nOnly when the physical form is perfected does it become an indestructible vajra body, which perishes only when heaven and earth collapse—nothing else can destroy it. When spirit departs and the husk remains on earth, it endures without decay. The nails, hair, and eyebrows—appendages of the bones and flesh—are sustained by the numinous *qi* within the bones and flesh, allowing them to continue growing. To illustrate: at the Supreme Clarity Palace on Mount Lao in Qingdao, Shandong, there resides a Daoist cultivator, said to be from the Ming dynasty. To this day, he sits upright within, neither eating, sleeping, nor speaking.",
      "overlap_context": "led three times before studying the *Mirror for Ingredient Entry*, resuming his practice, and succeeding. This was because the transmission from Ancestor Zhong had not been fully embodied by Ancestor Pure Yang. For the most minute details, if not attended to, will prevent success. The *Awakening to Reality* states: \"A hair’s breadth of deviation, and the elixir will not form.\" Scholars must ponder this deeply!\n\nSixth Lecture on the Oral Instructions of the Authentic Transmission of the Great Dao",
      "start_char": 20321,
      "end_char": 21281,
      "start_sentence": 910,
      "end_sentence": 952,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.0859215259552,
      "metadata": {
        "source_file": "dao\\藏外\\大道真传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 21,
      "original_text": "地方官交替一人，加一封条于其上。 此屋虽已破败，道者仍端坐不移，人皆见之，其爪极长，绕腰三匝。 类乎此者，各省皆有之。 肉身经几百年如生，其指爪等仍能长也。 前清山东省河道总督靳辅在山东黄河修堤，掘得一古棺，其棺见风日即化，中有尸体在焉，历久不坏，发甚长，而指爪绕身数周。 以其为无名古尸，有人主张付之火化，正欲付火，天大雷雨而止。 其夜靳正从事办公，见有古衣冠丈夫过而告之曰：我为得道之人，肉体能永久不坏，既欲筑堤，请改地以葬，随地皆可，不可付火，火之则不利于公也。 又宋时修某官，掘得古墓，棺开见尸如生，似汉时之人，共观之时，尸忽坐起，好事者仍从傍注视，见尸开眼望天而言曰：天何以如是垂垂，比我时低之多矣。 言毕仍睡下不起。 考之志历，知为东汉时修道之某君，仍为葬之如故。 凡此皆因经过锻炼，身上阴尽，肉体能永久不坏也。 前后升降，从后升而由前降。 升上之时，其热有似火球，从督脉而上，到顶稍住，仍由昆仑而下明堂入口，谓之曰服食还丹，即“白云朝顶上”也。 前降即“甘露洒须弥”也。 服食到口之时，仅仅三数滴，少时仅一滴而已，由重楼而下，物少而其效甚着，有声如雷。 大药到腹中，谓之得丹。 一日数次，积累到三百次之满足，眼前之火球化为红紫之光而罩身。 初时只能罩至半身，渐渐罩尽全身。 其人迷离恍惚，似在云烟之中，其光红色。 此中盖有工夫，有次第也。 初经七日之后，红光遍体，此光即我人之阳神，是其初步也。 我人应用温养之工，丹法谓之沐浴之工、乳哺之工也。 大周天无定而纯忘，此时更宜用忘也。 阳丹既得，神移上田，即以我之虚空通天地之虚空，放之则弥六合也。 此时身心仍用大忘，而微微用我神觉，觉我之小虚空，通入于天地之大虚空中。 将天地之虚空，为我之虚空； 而我之虚空亦为天地之虚空，则我神居天地之中，炁包天地之外矣。 此实炼炁化神后、还虚前之温养工夫也。 经过小周天后，则精满不思色。 又经大周天，则炁满不思食，神满不思睡，终日大定，不食不息。 以我虚空之中，合于天地虚空之中，少则百日，多则三百日，如慧根之人，亦可顿即贯通，而身上照体之紫红光，渐渐变为紫金光，由紫金光再变金光罩身。 《悟真篇》曰：“近来遍体金光现，不与旁人话此规”是也。 到红光罩身之时，仙佛皆可目见，至变金光之时，即可与神佛往还矣。 炼神还虚，光大阳神之口诀，全在“以我之虚空，通天地之虚空”二语也。 金光罩身之后，再过数日，或数十日，遍身金光，照而覆于顶上。 初小渐大，竟至大如车轮，即出神之时刻。 到阳神完全可以出神，守护伴侣见金光大如车轮之时，应告之曰出神，使之觉而速出。 若仍不觉，应再告之，觉一动而神即出矣。 古有断臂出神者，如蓝养素，因出神景到，而己不觉，时过已久而不出神，钟祖虽点化之，而神仍不出，因用力断臂，神一惊而出矣。 若有伴侣在旁，能早惊觉而告之，则觉动即能随金光而神出。 盖此时早已归于大忘，正觉非感不通，必有人为之告。 蓝仙之神不出，即景到未觉，致神滞于彀中，真意不动，故以断臂惊之，乃忽然而觉耳。",
      "translated_text": "Each time a local official was replaced, another seal was added to the door. Though the chamber had fallen into disrepair, the Daoist remained seated motionless within. All who saw him beheld his nails, grown so long they coiled three times around his waist. Such cases exist in every province. After hundreds of years, the fleshly body remains as if alive, and the nails and hair continue to grow.\n\nDuring the late Qing dynasty, Jin Fu, the River Conservancy Director of Shandong Province, was overseeing dike construction along the Yellow River when an ancient coffin was unearthed. The coffin crumbled upon exposure to wind and sun, yet the body inside remained intact, its hair exceedingly long and its nails coiled several times around the corpse. As it was an unidentified ancient remains, some proposed cremation. Just as the fire was about to be lit, a great thunderstorm erupted, halting the proceedings. That night, as Jin Fu worked in his office, a man in ancient robes and cap appeared before him, saying: “I am one who attained the Dao. My body remains imperishable. Since you are building a dike, I ask that you rebury me elsewhere—any place will do—but do not burn me, for fire would bring misfortune upon you.”\n\nIn the Song dynasty, an official overseeing construction unearthed an ancient tomb. When the coffin was opened, the corpse appeared as if alive, resembling a person from the Han era. As the onlookers watched, the corpse suddenly sat up. Those who lingered nearby saw it open its eyes, gaze heavenward, and say: “Why has the sky grown so low, much lower than in my time?” Having spoken, it lay back down and did not rise again. Upon consulting historical records, they learned it was a certain Daoist cultivator from the Eastern Han dynasty and reburied him as before. All such cases occur because, through refinement, the yin within the body is exhausted, allowing the flesh to remain imperishable for eternity.\n\nThe ascent and descent follow this pattern: rising from behind and descending in front. When ascending, the heat resembles a ball of fire, rising along the Governing Vessel to the crown, where it lingers briefly before descending via Kunlun to the Hall of Brightness and entering the mouth—this is called “ingesting the returned elixir,” or “white clouds ascending to the summit.” The descent is “sweet dew sprinkling Mount Sumeru.” When the elixir reaches the mouth, it is but a few drops, and later only a single drop, descending past the Celestial Ladder. Though the substance is scant, its effect is profound, producing a sound like thunder.\n\nWhen the great medicine enters the abdomen, it is called “obtaining the elixir.” Occurring several times a day, after accumulating three hundred such instances, the fireball before the eyes transforms into a red-purple light that envelops the body. Initially, it covers only half the body, gradually extending to the whole. The person becomes dazed and ethereal, as if amid clouds and mist, the light a deep red. This process involves methodical effort and sequential stages.\n\nAfter seven days, the red light suffuses the entire body—this light is the yang spirit of the practitioner, marking the initial step. One must then apply the work of nurturing, which in elixir methods is called “bathing” and “nursing.” The great celestial cycle has no fixed pattern and is purely a matter of forgetting. At this stage, one must employ even greater forgetfulness.\n\nOnce the yang elixir is obtained, the spirit shifts to the upper field, merging one’s emptiness with the emptiness of heaven and earth. When released, it pervades the six directions. At this time, the body and mind still require profound forgetting, while one subtly employs spiritual awareness to sense one’s own small emptiness merging with the vast emptiness of heaven and earth. When the emptiness of heaven and earth becomes one’s own emptiness, and one’s own emptiness becomes that of heaven and earth, then one’s spirit dwells within heaven and earth, while one’s *qi* envelops them beyond. This is the work of nurturing practiced after refining *qi* into spirit and before returning to emptiness.\n\nAfter completing the minor celestial cycle, essence becomes full and desire for sensuality ceases. After the great celestial cycle, *qi* becomes full and the desire for food vanishes; spirit becomes full and the desire for sleep disappears. One abides in great stillness throughout the day, neither eating nor breathing. Within one’s own emptiness, merged with the emptiness of heaven and earth, this state lasts at least a hundred days, at most three hundred. For those of keen spiritual roots, it may be instantly realized. The purple-red light suffusing the body gradually transforms into a purple-gold light, then into a golden light that envelops the body. As *The Understanding Reality* says: “Lately, a golden light manifests throughout the body; I do not speak of this method to others.”\n\nWhen the red light envelops the body, immortals and buddhas become visible. Upon transforming into golden light, one may commune with divine beings. The oral instructions for refining spirit and returning to emptiness, for magnifying the yang spirit, lie entirely in the two phrases: “with one’s own emptiness, merge with the emptiness of heaven and earth.”\n\nAfter the golden light envelops the body, several or even dozens of days later, the golden radiance suffuses the entire body and rises to cover the crown. Initially small, it gradually expands until it becomes as large as a cartwheel—this is the moment of spirit departure. When the yang spirit is fully capable of exiting, the guardian companion, seeing the golden light grow as large as a cartwheel, should announce: “Depart!” to rouse the practitioner to exit swiftly. If still unresponsive, the companion should announce it again. At the slightest stirring, the spirit will depart.\n\nThere is an ancient account of one who severed his arm to exit the spirit. Lan Yangsu, for instance, was in the midst of a spirit-departure vision yet remained unaware. As time passed and his spirit did not emerge, even after Master Zhong’s guidance, it still did not depart. He then forcefully severed his arm, and the shock caused his spirit to exit at once. Had a companion been present to startle and alert him earlier, the stirring would have allowed the spirit to depart with the golden light.\n\nAt this stage, one has already entered profound forgetting, and awareness does not respond without external stimulus—someone must announce it. Lan’s spirit did not depart because, though the vision had arrived, he remained unaware, causing the spirit to stagnate within. With true intent unmoved, severing his arm startled him into sudden awareness.",
      "overlap_context": "llapse—nothing else can destroy it. When spirit departs and the husk remains on earth, it endures without decay. The nails, hair, and eyebrows—appendages of the bones and flesh—are sustained by the numinous *qi* within the bones and flesh, allowing them to continue growing. To illustrate: at the Supreme Clarity Palace on Mount Lao in Qingdao, Shandong, there resides a Daoist cultivator, said to be from the Ming dynasty. To this day, he sits upright within, neither eating, sleeping, nor speaking.",
      "start_char": 21281,
      "end_char": 22505,
      "start_sentence": 953,
      "end_sentence": 994,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.25665092468262,
      "metadata": {
        "source_file": "dao\\藏外\\大道真传.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 22,
      "original_text": "初出神时，阳神幼稚，其胆甚小，不可远出，一出即须收回。 觉动而出，亦觉动而回。 初时仅可五步十步，或三四十步，渐放渐远，至五里十里。 时时炼习，到纯熟之时，意欲出到何处，即至何处。 及至放到五百里、一千里方可用之。 用神之初，到其地若住若干时或一刻钟或半点钟，而再收回之也。 能放到千里以上，住一点钟之久，则到万里亦同之矣。 此时用其灵而作种种之举动，能放之愈远，住时愈久，而神愈灵也。 炼到随时放而随时收时，方为完全，此时入地通天，阳神皆能之矣。 聚而成形，散则成气。 聚时俨然人也，散时则化而为气，可以随心所欲而为之矣。 然此时尚为一神，而不能化多身，再进则可化多身矣。 出神之时，为炼神还虚； 化身之时，为炼虚合道。 道本空，无名无相，而炼虚以合之，道家谓之“粉碎虚空”； 佛家谓之“千百亿万化身”； 儒家谓之“放之则弥六合，卷之则退藏于密”也。 此时已能随心所欲，若欲解脱，可以脱离躯壳而去； 若欲留形度世，亦可带躯壳而修炼。 炼虚合道，即以我之阳神，归于虚空，化于虚空之中是也。 带躯壳做功，佛家谓之曰“九年面壁”之功。 九年二字，亦假言之，实不在乎年月也。 修炼年久，则化身愈多，由一而三，由三而九，由九而八十一。 修到九年，则可化到无数之化身也。 此中久暂，全视根器之利钝而别。 根器利者，一日亦可，甚至立刻圆通，亦可成功，固甚速也。 若根器钝者，固须时日也。 然此功无止境，用力愈久者，神通愈大，在天上之神仙，亦用此功也。 化之千百亿万法身，充满于宇宙，是为大觉金仙，亦即佛也。 炼时空空洞洞，完全与虚空同体，其究也，可以三千大千世界，恒河沙数之化身，充塞虚空，其神通为何如也！ 炼虚合道之功，在道家带躯壳而修者甚少，以已出神之后，多视躯壳如赘瘤，不愿留之也。 至佛家则多带躯壳而修，以达于完全成功之域。 其实留否，于已无甚关系，所关系在济人利物行功之时，有便利与否之分而已。 利济之功，佛道两家不同。 道成之后，应以道利济天下，两家所同也。 而道家多脱去躯壳，以阳神入世度人。 一面仍以阳神炼虚合道，如张三丰真人见明成祖时，以阳神飞入朝中，且曰：我不是张三丰，是张三丰之阳神。 当真人在扬州时，即已化去，而以阳神入武当山修炼虚合道工夫，且行利济之事，其后周行天下，皆阳神也。 佛家则不以周行天下为利济之事，其间住在何处，即于何处度人，故多带躯壳行之。 若欲周行天下度人，自以不带躯壳为便也。",
      "translated_text": "When the spirit first departs, the yang spirit is still immature, its courage feeble—it must not venture far, and upon exiting, must be drawn back at once. It emerges with awareness stirring and returns with awareness stirring. Initially, it may travel only five or ten paces, or thirty or forty, gradually extending farther, to five *li* or ten *li*. With constant practice, when mastery is achieved, the spirit may go wherever intent directs. Only when it can reach five hundred *li* or a thousand *li* may it be put to use. At first, upon arriving at a place, the spirit may linger for a time—whether a quarter-hour or half an hour—before being recalled. If it can travel a thousand *li* and remain for an hour, then traveling ten thousand *li* is no different. At this stage, the spirit’s efficacy in performing various acts grows with the distance it can travel and the duration it can remain—greater range and longer stay make the spirit more potent. When the spirit can be sent forth and recalled at will, the practice is complete, and the yang spirit may then penetrate earth and ascend to heaven. Gathered, it takes form; scattered, it becomes qi. When gathered, it appears as a person; when scattered, it dissolves into qi, able to transform at will. Yet at this stage, it remains a single spirit and cannot yet manifest multiple bodies. With further progress, it may divide into many.\n\nThe departure of the spirit is the refinement of spirit into emptiness; the manifestation of multiple bodies is the refinement of emptiness to merge with the Dao. The Dao is fundamentally empty, nameless, and formless—refining emptiness to unite with it is called by Daoists “shattering the void,” by Buddhists “a thousand hundred million transformed bodies,” and by Confucians “when released, it pervades the six directions; when withdrawn, it retreats into secrecy.” At this point, one may act as one wishes: if seeking liberation, one may shed the physical shell and depart; if choosing to remain in form to save the world, one may continue refining with the body intact.\n\nRefining emptiness to merge with the Dao means returning one’s yang spirit to the void, dissolving within it. Practicing with the body retained is what Buddhists call the “nine years of wall-facing” discipline. The “nine years” is a figurative term—duration is not fixed by years. With long cultivation, the number of transformed bodies increases: from one to three, from three to nine, from nine to eighty-one. After nine years of practice, one may manifest countless bodies. The time required depends entirely on the sharpness of one’s faculties. Those with keen faculties may achieve this in a single day, or even attain instantaneous mastery—progress is swift. Those with dull faculties require more time. Yet this practice has no limit: the longer one applies effort, the greater the spiritual powers. Even celestial immortals cultivate this way.\n\nManifesting a thousand hundred million dharma bodies to fill the cosmos is the state of the Great Awakened Golden Immortal—this is the Buddha. In cultivation, one becomes utterly empty, merging completely with the void. Ultimately, one may fill the three-thousandfold great-thousandfold world with the countless transformed bodies of the Ganges’ sands—what spiritual powers would then be unattainable?\n\nIn Daoist practice, few retain the physical body after the spirit departs, for most regard the shell as a burdensome growth and prefer to discard it. Buddhists, however, often retain the body to advance toward complete mastery. In truth, whether one keeps the body or not matters little to oneself; the difference lies in the convenience it affords when performing deeds to benefit others. The methods of salvation differ between Buddhists and Daoists. Yet once the Dao is attained, both must use it to benefit the world.\n\nDaoists typically shed the physical shell, entering the world with the yang spirit to save others while continuing to refine the yang spirit to merge with the Dao. When the Perfected Zhang Sanfeng appeared before the Ming Emperor Chengzu, he flew into the court as a yang spirit and declared, “I am not Zhang Sanfeng—I am Zhang Sanfeng’s yang spirit.” By the time the Perfected One was in Yangzhou, he had already transformed his body, entering Mount Wudang with his yang spirit to refine the practice of merging with the Dao while performing salvific deeds. Later, he traveled the world—all as a yang spirit. Buddhists, however, do not consider traveling the world a means of salvation; they remain where they are to save others, often retaining the body. If one wishes to travel the world to save others, it is more convenient to do so without the body.",
      "overlap_context": "t at once. Had a companion been present to startle and alert him earlier, the stirring would have allowed the spirit to depart with the golden light.\n\nAt this stage, one has already entered profound forgetting, and awareness does not respond without external stimulus—someone must announce it. Lan’s spirit did not depart because, though the vision had arrived, he remained unaware, causing the spirit to stagnate within. With true intent unmoved, severing his arm startled him into sudden awareness.",
      "start_char": 22508,
      "end_char": 23485,
      "start_sentence": 995,
      "end_sentence": 1034,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.00438404083252,
      "metadata": {
        "source_file": "dao\\藏外\\大道真传.txt",
        "category": "藏外"
      }
    }
  ]
}