{
  "source_id": "天仙道戒忌须知",
  "source_file": "chunked_daozang\\天仙道戒忌须知.json",
  "total_chunks": 16,
  "total_original_chars": 10296,
  "total_translated_chars": 57799,
  "total_translation_time": 415.85369396209717,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\天仙道戒忌须知.txt",
    "category": "藏外"
  },
  "full_translation": "**The Heavenly Immortal’s Dao: Essential Prohibitions and Cautions**\n\n**First: On Knowing When to Cease**\n\nThe Master of Niwan states: *\"Without knowing when to cease, the will has no foundation, and one’s direction becomes confused and wavering.\"* The Elder of Great Emptiness says: *\"To learn immortality, one must learn the way of the Heavenly Immortal, for the Heavenly Immortal is the ultimate destination of the immortal’s Dao. Knowing when to cease prevents one from being misled by the methods of Earthly or Water Immortals, ensuring that one’s efforts remain pure. The study of the Heavenly Immortal is the study of the heart. To focus solely on cultivating the heart is to know when to cease. The heart of the Heavenly Immortal is wondrously luminous, perfectly awakened, truly constant, and silently generative—vast beyond all bounds, yet minute beyond all interiors. Whether in movement or stillness, sitting or lying down, if one loses this essence, one must immediately turn inward in reflection. Even a slight delay in this awareness and illumination is called ‘delusion in cessation,’ which is a prohibited transgression on the path of the Dao.*\n\n*One must understand that this body is not truly one’s own—nothing exists that does not arise from the wondrous presence of this heart, emerging from its wondrous absence. If I gather each and every thing back to its origin, then this body becomes whole and firm, and this heart becomes complete. This is what the Confucian tradition calls ‘complete reception, complete return.’ To cultivate and restore in this way is what the ancients called ‘lesser knowledge of cessation.’ For those who know this, their awareness and movement arise purely from the Heaven of Principle, yet they still rely on awareness and illumination to maintain unity, and thus retain the dualistic perception of self and dharma. If one can forget both self and dharma, emerging from non-being into being, abiding in serene constancy and attaining cessation, the ancients called this the path of ‘self-liberation’—the people of the Heavenly Immortal’s realm. Yet this cannot yet be called the cessation of the Heavenly Immortal.*\n\n*The heart of the Heavenly Immortal perceives this body as a world, or the world as this body; it sees a single body and lifetime as a speck of dust, or encompasses within a speck of dust countless worlds as numerous as the sands of the Ganges, while the body itself becomes as vast as those countless worlds. In every world, before every sentient being, it may erect the great banner of the Dharma, or conceal and reveal itself, teaching and guiding all beings—human and non-human alike—to reach the shore of the Dao, without the heart being attached to merit. Its words and actions arise as if not from itself, as if emerging from the worlds it encompasses. In every world, before every being, each one’s heart speaks and acts of its own accord, with no involvement from the self. Only then is the heart truly realized. Through such cultivation, diligent and unceasing, one returns ever more clearly, ever more purely and refined. Such is the heart and realm of the Great Luo Heavenly Immortal. To establish one’s will in this knowledge is called ‘supreme, great knowledge of cessation.’ What has been described above pertains to the School of Nature, which aids in the cultivation of destiny. Destiny cannot stand without Nature, and thus this has been explained in detail.\"*\n\n*\"As for the principles of refining destiny, the ultimate goal is the exhaustion of yin and the purity of yang. Spiritual powers and flight are not the aim. The objects of refinement are essence, qi, and spirit. My teacher spoke of primordial essence and postcelestial essence, and likewise of primordial and postcelestial spirit and qi. The methods of refining them each have their own definitive point of cessation.*\n\n*Examining postcelestial essence—tangible and substantial—it resembles essence but is not true essence, being derived from food and drink. Before it is transformed into blood in the Crimson Palace, it disperses through the four limbs and the organs. If it is not refined at the Sea of Qi, it cannot be transformed into ordinary qi, rising to the brain and descending to the heart to become fluid and blood, reaching the kidneys. Then, ascending to the navel for harmonization, it follows the qi back to the Sea of Qi for a great refinement. If it fails to become qi, how can it rise to the brain and transform into Jade Fluid? Refining tangible essence without following this sequence is called ‘delusion in not knowing when to cease.’ If one stops before it is fully transformed into Jade Fluid, this also cannot be called ‘knowing when to cease.’*\n\n*As for primordial essence, it is true essence. Yet its nature is yin, transformed from the lung qi of the body. The method of refining it involves passing through the kidneys and navel, descending to the Sea of Qi for refinement, then ascending to the navel to harmonize with earth. Descending through the Tailbone Gate, it rises to the summit for gathering. When the qi of the Celestial Stem illuminates it, it immediately transforms into Golden Fluid, descending smoothly into the Crimson Palace. At first, it is extremely cool, refreshing the organs, but in an instant, it transforms into hot qi, warming the entire body. When this warm qi pervades and harmonizes with the Mysterious Pass, one feels a sense of inhalation and exhalation within—this is the clear sign of nursing the infant. Those who refine true essence without following this method are deluded in not knowing when to cease. Even if one follows the method but stops before harmonizing with the Mysterious Pass, this cannot be called ‘knowing when to cease.’*\n\n*As for primordial qi, it is the fire of yang, yet its true nature is yin. Postcelestial qi is the fire of yin, yet its substance and nature are yang. Primordial qi requires no refinement—knowing the method of nurturing it, one connects with the true qi of creation and draws upon it endlessly. Primordial qi arises from the Kun Palace; when Qian responds to Kun’s qi, it is formed, and thus its true nature is yin. Postcelestial qi arises from the Dui direction; Dui exhausts the qi of Zhen to enact its movement, and thus its nature and substance are yang. What is the method of nurturing it? Purify my marrow, still my heart, and refrain from exerting hidden abilities. What is the method of refining it? Apply the method of nurturing with focused spirit and settled thoughts, using the light of the eyes to constantly survey the Sea of Qi. Then, the lower extreme naturally becomes hot and boiling. Not only is ordinary qi transformed into true qi, but ordinary fluid is also transformed into ordinary qi. It becomes like clouds or mist, protecting the Mysterious Pass below and ascending the Spine Ridge above. Following the pervasion of true qi, it rises to the brain. When the grace of the Celestial Stem adds its qi-illumination, it too can directly transform into Jade Fluid. Is this not fortunate?\"*\n\nThis Jade Fluid, when drawn to irrigate my Crimson Palace, brings unparalleled coolness and revives the springtime of the viscera. When used to moisten the Earth Cauldron, the Cinnabar Field becomes warm and moist, descending to penetrate the Mysterious Pass. The Infant is nourished, and harmony suffuses the entire body—this marks the culmination of the first stage in refining qi. Persisting in this practice, its secrets lie in nothing beyond this.\n\nThose who refine qi by following this method and these principles may be said to have attained the wisdom of knowing when to pause. Yet during the ascent and descent of its circulation, obstructions or stagnations may arise—binding like a cord or constricting like a net—causing pain or numbness. For these, there exists another method of cessation.\n\n**Second: Essential Prohibitions and Precautions**\nThe Master of Mud-Pill Palace states: \"The meaning of these passages differs from the intent of *On Dispelling Doubts in Immortal Cultivation*. Here, the emphasis lies in prohibitions and precautions, rather than profound operative principles. It concerns the thoroughness of learning versus the precision of focus. Should there be any interruption or lack of dedication, even with true transmission, it is as if one had never heard it—spirits and deities despise this. Not only is it of no benefit, but the luminous laws of the Mysterious remain in force, and one cannot escape karmic retribution in the unseen realms. How can one not fear this? How can one not be vigilant?\"\n\nMaster Tai Xu says: \"Those who cultivate the Dao are as numerous as ox hairs, but those who achieve it are as rare as rabbit horns—this refers precisely to such learners. Otherwise, from ancient times to the present, those who have attained the Dao, even within my own knowledge, would fill volumes. How could the metaphor of 'rabbit horns' apply? The harm of interruptions and lack of focus stems entirely from unclear understanding of inherent nature and principle, and the obstruction of desires. Or it may arise from clinging to fixed views...\"\n\nOr it may stem from deluded perceptions leading to erroneous awakenings; or from impatience with hardship; or from regarding the Dao as loftily profound; or from doubting its simplicity; or from fearing that the master’s transmission is incomplete, or that one’s companions are unworthy; or from the sudden onset of chronic illness; or the emergence of new ailments; or from witnessing the untimely death of a revered figure; or from hearing of the fame of external teachings; or from advancing prematurely and inviting illness; or from reckless actions that breed disaster; or from family obstructions; or from waiting for the right time and missing the opportunity. The demonic obstacles are manifold, yet the failure in cultivation is the same—how lamentable indeed!\n\n**Third Caution: Never Deem Insufficiency Sufficient**\nMaster Ni Wan says: \"To deem insufficiency sufficient is the common affliction of Dao cultivators across the ages. Its root lies in ignorance, stemming from the lack of sagely teachers and virtuous companions.\"\nMaster Tai Xu says: \"For this very reason, in the principle of *knowing when to stop*, I have already hinted at the boundary one should not transgress—a wake-up call for such practitioners.\"\n\n**Fourth Caution: Disbelief in Cause and Effect**\nMaster Ni Wan says: \"Disbelief in cause and effect is the malady of the enlightened, and it is most pernicious. Even if one attains the supreme Dao, without comprehension of inherent nature and principle—due to shallow reflection—one remains confined to emptiness and quiescence, ultimately becoming a follower of the Lesser Vehicle. For the ignorant and those mired in habit, the calamities are boundless—how can one not fear this?\"\nMaster Tai Xu says: \"Cause and effect are like shadow following form. Those who deny this principle not only sever their own path forward but also cut off their path of return. Even if one steadfastly upholds emptiness and quiescence without violating other precepts, I know that upon the exhaustion of their karmic blessings at life’s end, they will surely dissolve into motes of dust, scattered into the void.\"\n\nThe Mountain of Self and Others Looms High.\n\nMaster Ni Wan says: \"When the mountain of self and others looms high, private desires run rampant. Even with diligent cultivation, one inevitably attaches to demonic paths.\" Master Tai Xu says: \"If the sense of self and others is not eradicated, the four marks of existence remain intact. Afflictions and disputes will never cease; this is an inevitable consequence. Anger and resentment will multiply. Even if one knows how to refine qi to perfection, one merely becomes a member of the demonic household—just as my teacher foretold.\"\n\n**Sixth Admonition: Lustful Thoughts Must Be Severed.**\n\nMaster Ni Wan says: \"If lustful thoughts are not severed, even with diligent cultivation, it is like steaming sand to make rice—utterly without principle.\" Master Tai Xu says: \"The arising of lustful thoughts stems from the river of desire. Failing to sever the precept of lust, the fire of human desire burns fiercely, scorching the true path. One falls into the realm of aquatic beings, and the calamity is no small matter. Moreover, in the Dao of elixir refinement, preserving essence is the foremost gate. If essence is depleted, qi is depleted; if qi is depleted, spirit wanes; if spirit wanes, the true fire weakens. The furnace and stove will grow cold, and the host of yin forces will run amok, leading to illness and certain death.\n\nIf certain scholars, constrained by conventional views, argue that of the three forms of unfilial conduct, having no descendants is the gravest, and that we, born into the Confucian tradition, cannot simply abandon this path—then we may petition the Emperor of Heaven to open a living path. For those determined cultivators, when spirit is complete and essence is full, if they wish to first extend their lineage, this may persuade obstinate Confucians. They are permitted to seek offspring once or twice, and it is certain that the child born will be male. However, upon the first conception, they must immediately sever and uphold the precept. They must not linger or violate the precept; those who do will be demoted into the realm of birth, flowing into the pit of desire, and will suffer all manner of retribution.\n\nMy teacher deemed this correct, and upon reporting it to Ancestor Lü, Ancestor Lü approved it. It has been recorded in the archives of the Three Heavens and proclaimed to the Nine Realms. Yet this is a secret teaching; those who know of it must not recklessly disclose its origins, lest they invite slander.\"\n\n*(Xie’s Note: In today’s world, with its even greater complexities, once one enters the confines of marriage, this method of the ancient sages cannot adequately resolve the aftermath. One must understand that the variables after marriage are far greater than before. Either do not marry, or marry a like-minded cultivator. Otherwise, it is very difficult to escape. Life is filled with endless tasks; if one waits to pursue immortality only after all worldly affairs are settled, I fear this will become nothing but an excuse for procrastination. Years and days pass swiftly, intentions and form race with time, and before one knows it, hair turns white, complexion fades, and a lifetime yields no achievement.)*\n\nAlas! Heaven and earth are but illusions; the myriad existences are not real. All forms arise and continue due to the causes and conditions of habitual karma—this is truly suffering. Yet people’s failure to sever lustful affairs stems from deep attachment. Those who speak of lineage and succession do so merely as an excuse. Otherwise, medical texts confirm that those with few desires often have more sons. What they call \"sensuality\" is not true sensuality but rather the unchecked blazing of desire.\n\nThe method to sever it lies in a single word: *fear*. This may bring benefit. Through diligent effort, one reaches purity. After three hundred days, this fire will no longer blaze. Thus, the ancients would hang a skull, contemplate a rotting corpse, display sacred images, recite scriptures and mantras, perform prostrations, or form companionships—all to restrain this single thought. Yet nothing surpasses placing oneself in emptiness and gathering the mind in nothingness, leaving the six senses and six dusts with no foothold. Simply employ the first secret of our Master Laozi, \"roaming the mind in the primordial\"—how effortless and simple!\n\nI urge the determined scholars of this world to diligently apply this teaching. The Dao of elixir refinement will then swiftly come to fruition—what greater benefit could there be?\" The Master said: \"Indeed, what you have spoken is correct.\"\n\n**Seventh Admonition: Stinginess and Boastfulness Must Be Eradicated.**\n\nMaster Ni Wan says: \"If stinginess and boastfulness are not eradicated, the sense of self and others grows vast. This is the source of karmic cause and effect, where accounts are recorded in abundance, retributions remain unbalanced, cases are difficult to settle, and liberation is endlessly delayed. One may even transform into karmic obstacles—such examples abound in ancient and modern times.\"\n\nMaster Tai Xu says: \"One must understand that almsgiving and salvation are inherent duties. A lifetime of stinginess causes one to miss good affinities. If one gives but retains the thought of regret, this is called backsliding, and merit diminishes—is this not lamentable? If one harbors boastful thoughts, arrogance and dominance run wild. Not only is merit erased, but the roots of karma are planted—how can one not fear this? This is why my teacher spoke these painful words above.\n\nTo cultivate the Dao, one must accumulate merit. To accumulate merit, how can one do so without almsgiving and ascetic practice? Moreover, good affinities are easily lost and difficult to obtain. Encountering them and acting is benevolence; acting without boasting is righteousness; enduring insults and slander without regret is virtue; bestowing kindness and planting virtue without attachment is the Dao.\n\nAlas! Heaven grants me strength and bestows upon me the opportunity—how can I then allow stinginess and boastfulness to arise? The determined scholars of old heard and believed, and what they believed, they practiced without fail. The determined scholars of today consider skepticism wisdom and scrutiny clarity. Thus, they may devise plans to establish merit and virtue, yet ultimately, no merit or virtue is accumulated. They are ignorant of what merit and virtue truly are—nothing more than the perfection of the mind’s inherent nature and celestial goodness.\n\nTherefore, the determined scholars of old simply exhausted their hearts and strength. Upon hearing, they acted, never calculating the truth or falsity of others. Thus, their merit and virtue accumulated and perfected easily. If one insists on doubt, there is nothing in this world that cannot be doubted. To wait for certainty before acting is to never act at all. Moreover, one fears that those awaiting aid may perish before help arrives—some die, some fail—is this not lamentable? Those who are stingy and boastful are unworthy of discussing the Great Dao.\"\n\nThough they may cultivate with great diligence, I firmly declare that they remain ultimately confined within the pit of birth and death, transformed into seeds of karmic debt—how can one not be wary of this!\n\n*(Xie’s note: The reason the wealthy possess wealth is that the natural workings of creation borrow their hands to relieve the impoverished, not to mock or deride them. The reason the strong possess strength is that the natural workings of creation borrow their hands to aid the weak, not to bully or toy with them. Power, wealth, knowledge, and experience all arise from the differing karmic conditions of each person. Yet when one examines their essence, all lives are equal—there is fundamentally no high or low, noble or base. To humiliate others is to humiliate the human nature of life itself, and since one is also human, it is to humiliate one’s own dignity. Those who make no progress in cultivation should reflect deeply upon this.)*\n\n**Eighth Caution: The Arising of Thoughts of Gain and Loss**\nMaster Niwan said: “Those who entertain thoughts of gain and loss have never been able to follow the ancient resolve without recklessly imposing their own contrivances. The harms they bring about are beyond counting.”\n\nMaster Taixu said: “One must understand that human nature is fundamentally good, and the heavenly principle is fully present. ‘Gain’ and ‘loss’ are terms spoken only in reference to human affairs. What we cultivate is the Dao. The Dao is called ‘cultivation’ because delusion obscures our minds, illusion obstructs our nature, the Three Corpses and Nine Worms, the Seven Emotions and Six Desires, conspire together to harm our bodies—thus, we must engage in cultivation to secure peace. Cultivation means nothing more than removing these delusions and obstructions. When delusion is gone, truth remains; when obstruction is gone, clarity emerges. Truth and clarity are complete and inherent—there has never been any loss, so where could gain come from? Once this principle is thoroughly understood, how can there be any gain or loss? If there is not even existence, how can the mind be moved by delusion? The inner turmoil of conflict is but one’s own self-inflicted sorrow.\n\nI hold that for every part of desire removed, the mind gains a part of clarity; for every ten parts of desire eradicated, the mind gains ten parts of clarity. I urge scholars to diligently eliminate desire and dispel delusion, to clarify their mind and nature, and thereby attain the wondrous clarity of perfect enlightenment. If one does not believe this and remains trapped between the anxieties of gain and loss, I know not what their ultimate fate shall be. I can only leave it to them. How can one not be wary of this?”\n\n**Ninth Caution: The Interval Between Movement and Stillness**\nMaster Niwan said: “The human body inherently encompasses both movement and stillness. Movement pertains to spirit; stillness pertains to essence. The movement and stillness of qi are governed by spirit. Thus, when the body moves, spirit commands qi, qi follows spirit, and together they guide essence in motion. When the body is still, spirit directs essence through qi, leading qi to rest within the qi cavern.\n\nOur wondrous, clear, and perfectly awakened mind-nature is originally without movement or stillness—how could there be any coming or going? Alas, why should the body’s movement and stillness create a gap in the cultivation of our minds? This is merely a failure to reflect deeply.”\n\nElder Taixu said: “Profound indeed are the Master’s words, revealing what none before have revealed, and mercifully guiding those who come after. How dare I, a humble disciple, not follow and expound upon them in detail?\n\nI have heard from the Master that the dedicated practitioners of old never neglected their cultivation, whether in walking, standing, sitting, or lying down, each with its own method of practice. Thus, they achieved seamless continuity between movement and stillness, attaining the verifiable results of a hundred days of foundation-building, ten months of fetal perfection, and three years of nurturing refinement.\n\nExamining movement, we speak of walking and standing. Standing is to stand firm; walking is to step forward. Examining stillness, we speak only of sitting and lying down. Though the method of refinement is singular, there are four loci for its application.\n\nWhat is the one method? It is simply the gathering of spirit. (This single phrase encompasses the myriad methods of refinement and alchemical transformation described in countless texts.)\n\nWhat are the four loci? When walking, gather spirit at the Yongquan acupoints of both feet; when standing, gather spirit at the Sea Bottom; when sitting, gather spirit at the Crimson Palace; when lying down, gather spirit at the Earthly Abdomen.\n\nHowever, when sitting while conversing or standing while responding to others, the practice differs from solitary sitting or standing. When sitting, first gather spirit from the Sea Bottom, drawing it upward along the back, like the flame of a Buddha statue. This ensures composure during conversation. (In my humble opinion, one should also direct qi toward the guest’s front, enveloping their back from below the ground, then drawing it back.) Speech will then flow with measured clarity. (This enveloping must be executed with swift spiritual agility: upon seeing the guest, direct spirit behind them, enveloping from below the ground so that the qi mechanism ascends behind you, then envelop the guest again, as if encasing them in an egg, with both of you within. Thus, the wondrous application lies in the harmonious gathering of spirit throughout the body.)\n\nWhen standing, first gather spirit at the soles of both feet, pressing down gently with force while responding orally. (This may also be done as in sitting practice.) The spirit will then remain settled and not scatter.\n\nLying-down practice has two methods: the Sleep of Xiyi and the Sleep of Huanyang. Xiyi was the honorific bestowed upon Ancestral Master Chen Tuan. Huanyang was the title of the Elder Lord Li of Mount Mao—this being the Elder Lord of the Cypress Tree, not the Elder Lord transformed by the Supreme. Each sleeping method possesses its own marvels.\n\nFor the Sleep of Xiyi, if lying on the left side: bend the left arm, using the palm to support the face, parting the thumb and forefinger so that the left ear rests in the gap between them, leaving the ear’s orifice unobstructed. Straighten the waist and back, bend the left thigh, and extend it to the Earthly Abdomen, resting comfortably upon the bedding. (In my humble opinion, the waist, abdomen, and right thigh should incline slightly toward the supine side, allowing the qi of the Elixir Field to flow freely.) Extend the right thigh alongside the left foot. (In my humble view, the right thigh should be slightly elevated and parted to avoid pressing against the kidneys, ensuring proper comfort.) Place the right palm over the navel, gathering spirit behind it. Envision the body’s luminous clarity, as if floating upon still water with an abyssal void below. The bedding and body transform into a white qi, like an egg, within which one sleeps. This is the method for lying on the left side; the same applies when lying on the right.\n\nFor the Sleep of Huanyang, one does not lie on the side but elevates the upper body with padding, approximately half a foot or three inches higher than the lower body. Lie supine, clench the fists, extend the arms straight, and part them in an open posture, as with the thighs, keeping them one or two inches from the scrotum. Seal the mouth, close the eyes, and still the mind. After about ten breaths, envision a misty vapor, like clouds or fog, enveloping the body inside and out. With intention, gather and retain this vapor at the Crimson Palace. (This gathering should be done with a state of near-forgetfulness. One may feel the chest becoming stiff or overheated, even unbearably so—this is the vapor, warmed by the heart’s fire, about to transform into blood. Only then should the following method be applied, allowing the blood to return to the kidneys.)\n\nWith the eyes inwardly gazing at the chest, back, and bedding below, perceive an abyssal void. (Thus, the heated blood flows from behind the heart and before the spine, dividing into two paths along the left and right, circulating into the waist and kidneys—a sign of blood transforming into essence.) Do not exert too much effort; remain relaxed yet attentive. (This “attentiveness” is the same as the “observing and guarding” described in *Discerning Delusions in Immortal Cultivation*.)\n\nThe subtleties within are too numerous to recount in full. (They are akin to those described in my annotations above.)”\n\nThe essential principles herein lie in eight methods for generating blood and two for transforming it into essence. As for the nine techniques pertaining to sleeping alongside another—lest they mislead later learners into heterodox paths—I dare not expound upon them.\n\n*(Xie’s note: When man and woman sleep together, they should face one another; when persons of the same sex share a bed, they must turn their backs. The core secrets therein are not to be recklessly disclosed. Yet those who have acquired and perused this book are surely of proper lineage or enlightened and discerning scholars; thus, they may inquire of their own masters. I shall not presume to describe these methods here.)*\n\nIn the first *bingwu* year of the cycle, on the first day of the tenth month, Lazy Cloud attended upon the Elder of Great Emptiness, who recounted the *Precious Principles of the Celestial Immortal’s Dao Path* and the *Essential Prohibitions of the Celestial Immortal’s Dao*. When the discourse reached the section on \"Intervals of Movement and Stillness,\" Lazy Cloud’s heart stirred. The Elder of Great Emptiness was a divine being, an emanation of the Southern Marchmount, with a mark on his left hand reading *Sovereign of Great Emptiness* (the script resembled seal characters yet was animated, with a soaring, coiling vitality; its hue was pure vermilion, visible only when he washed his hands at the moment of his passing)—hence his name. Lazy Cloud, moved in heart, entreated to transcribe the Elder’s words into this book, to transmit them to those in the world with karmic affinity.\n\nThe Elder of Great Emptiness said: “If you are willing to record them, why should I withhold? Soon they shall circulate widely throughout the lands north and south of the Great River. Though the time is not yet ripe.” He rose and chanted:\n\n*“In the imperial year three six,\nThen two three more pass by.\nNorth of the Divine River’s shore,\nSouth of Lou and Gong’s abode.\nA humble rustic, barefoot son of heaven,\nThere the transmission began.\nFrom him the secrets first were spread.”*\n\nWhen the chant ended, he continued: “Though the attainment is not difficult, and many have heard of it, each must gauge their own nature and capacity, for their cultivation will differ, and so too their realization. All who read this book are of our fellowship—take care not to abandon yourselves.”\n\nAfter a pause, he added: “My master arrived yesterday and said I shall soon answer the Emperor’s summons; my departure is near.” He rose again and chanted:\n\n*“Seventy-nine years in the world,\nTime not to be idly spent.\nGlad to complete my true countenance,\nSpiritually attaining the Heaven of Great Emptiness.”*\n\nWhen the chant concluded, he smiled, took out paper, and said: “Copy it down.” Thus, beginning with the *Precious Principles of the Dao Path*, Lazy Cloud transcribed each section in order. By the time he reached \"Intervals of Movement and Stillness,\" it was already the full moon.\n\nThe Elder of Great Emptiness said: “Why not compile the verses chanted on the first day into a complete text and append them to this section, as a testament for future initiates, a token of karmic connection?” Lazy Cloud rose and compiled them, then presented the work.\n\nThe Elder of Great Emptiness said: “Well done.” Then he added: “Continue the transcription for me.” He dictated:\n\n*“What I have set forth is not fully recorded in other texts. Those who obtain it must not treat it lightly. To receive and not practice, to practice without diligence, to be diligent yet inconsistent—all are forms of disdain. Failing to achieve the Dao in life, on such-and-such a day (the original text reads: the full moon of the tenth month in the *bingwu* year of the Qianlong reign), the Master of Indifference (Indifference being the name of his studio, the *Indifferent Realm* of Kaihua Monastery in She Village, Gui’an County, where the Elder of Great Emptiness ascended) charged this upon me. Recorded by Lazy Cloud.”*\n\nAlas!\n\nEleven days later, the Elder of Great Emptiness indeed departed this world.\n\nThis year, the *wuyin* year, Lazy Cloud, wandering as a guest, found himself at the Lougong work site. Awakened, he transcribed these records to bestow upon those of karmic affinity. He appended a few more lines at the end of the passage, saying:\n\n**Tenth: Prohibitions and Taboos One Must Know**\n*To act without following others.*\n\nThe Master of the Mud-Pill Palace said: “To act without following others is not the resolve of one content with their lot, but the conduct of those who delight in novelty and pursue the strange. Though they may escape the calamities of kings by chance, the laws of Heaven will surely not tolerate them. Thus, the statutes decree: even a single transgression incurs a three-year penalty of stagnation. This is because their nature delights in seclusion and perversity, refusing the middle path, and the disasters they bring are most severe. Hence, the punishment is heavy and no leniency is granted. How can one not take heed?”\n\nThe Elder of Great Emptiness said: “What my teacher has spoken is true and not false. The recluses of antiquity lived in the world yet forgot the years; their names are recorded in the annals, shining brightly for all to see—over a thousand of them. Yet today, they mingle unseen among the dusty world, some as monks sustained by desolate temples, others as companions to tattered beggars. The most exalted hide their traces on Mount Emei, Cock’s Foot Peak, Mount Taihua, or the most remote corners of the Zhongnan Mountains, where jackals and wolves are their only company. They sit in meditation for hundreds of springs and autumns, their bodies buried beneath fallen leaves, thorny brambles choking the paths, fearing nothing so much as being known. These are the great adepts of the Han, Wei, Six Dynasties, Tang, Song, Yuan, and Ming.\n\nThose who once displayed many wondrous signs—how boundless were their years of stagnation and penalty! I know this to be true, I have seen it with my own eyes. Yet I cannot bear to reveal their names.”\n\nI fear that those in the world with aspirations may become deluded and misuse these arts, bringing no small harm upon themselves—thus I do not hesitate to speak at length for their sake. Let the determined take heed: be cautious, and never act against the natural course of things.”\n\nAt that moment, the Elder of Sea Remnant interjected, “Divine powers and magical arts are what perfected beings of this world rely upon to accumulate merit and cultivate conduct—this is recorded in detail in the annals. Master, do you caution against them because the written records are not entirely trustworthy, or is there a deeper meaning in your extreme admonition?”\n\nThe Elder of Great Emptiness replied, “You are too confused to grasp this, yet if I do not explain, I risk misleading those who come after. Have you seen an egg hatch into a chick?”\n\n“Yes,” he answered.\n\n“Have you seen one whose form is incomplete yet prematurely breaks free from its shell?”\n\n“I have not.”\n\n“The transformation of an egg follows its own Dao; the completion of its form follows its own principle; the breaking of the shell comes at its proper time. If the time is not yet ripe and one forces change, or if the time for change has not come and one forces formation, or if the form is not yet firm and one forces the breaking of the shell—those not yet transformed will die, those not yet fully formed will wither, and those whose time has not come will fall ill. What I spoke of earlier concerns those whose forms are already complete and firm, yet whose time has not yet arrived—thus their suffering is no more than this. Yet even so, their affliction is already grave! Alas!”\n\nThe chick, like all things, transforms from non-being into being, nurtured until its form is complete—its task already fulfilled. Yet whether broken by heaven or by man, the harm or benefit remains as such.\n\nNow, our Dao is the Dao of immortality. From being it transforms into non-being, refining the solid to return to the void, dispelling delusion to revert to truth, gathering the nature to return to its source, transmuting yin to become yang. Through myriad practices and secrets, one neither abandons nor clings to the physical form, living freely and purely, serene and undisturbed, neither fully present nor entirely absent, utterly refined and unadulterated. One no longer regards the five viscera and six bowels as mere viscera and bowels, nor the four limbs and hundred bones as mere limbs and bones. In vision, only a perfect, radiant sphere remains—first forming the realm of water and moon, then the world of golden sands, and finally the realm of crimson and violet purity.\n\nSuddenly, the manifested realm contracts, shrinking to the size of a grain of rice or millet. I then gather it with true intent, drawing it into the Mysterious Pass as a magnet draws iron, penetrating the Mysterious Womb. This is the wondrous function of settling the spirit and entering sagehood, allowing not a trace of impure qi or the slightest mingling of unrefined ordinary essence, qi, or spirit from my body.\n\nWhen the Mysterious Pass first opens, a single impure practice reveals the esoteric and arcane. My immortal embryo is not yet formed, true qi is still faint, and though the true spirit is complete, the defilements of the mundane remain stubborn, with little radiance to be found. This esoteric and arcane practice is when the true spirit commands the consciousness, marshaling my ordinary qi to externally align with the celestial and terrestrial *killing qi* of the Big Dipper to perform deeds. Its numinous efficacy lies in borrowing the authority of the Celestial Emperor, so that the qi of heaven and earth cannot but converge. Yet those who come to converge are none other than the Six Heavenly Demon Kings, who, obeying the Emperor’s decree, dispatch their demonic qi to assemble. Within me, the spirits that feign obedience while fearing righteousness—whose hearts are not yet rectified—heed the summons and inevitably comply. Thus, their actions are invariably efficacious and verified.\n\nIt must be understood that those who practice such methods have not yet attained profound cultivation, their true qi is insufficient, their true spirit still faint, their mind and nature not yet perfected, and their deluded thoughts still ablaze. Thus, this reckless refinement arises from nothing more than vain desires for superiority, fame, marvels, and wonders, or the foolish impatience to test and taste. Those demonic spirits know this all too well, and so they entice the inner demons to band together and seize control of my body. The practitioners, unaware, have already fallen prey to demonic possession. From then on, they act without restraint, and the more their methods grow in numinous efficacy, the more they believe their past cultivation was mistaken. Thus, they deceive themselves and others—an inevitable outcome.\n\nIf, however, their Dao-root is deep and robust, and they encounter a perfected one who awakens them with a shout, returning to the true Dao and cultivating with vigor, they may yet achieve the formation and emergence of the immortal embryo. Yet the final step of pulverizing and completing all—this single stroke—may remain unattainable for hundreds or thousands of years. Why is this so?\n\nThe karmic delusions of the past, accumulated like mountains and seas, must dissolve and sins be absolved before the celestial decree descends. Only then is this barrier broken—how can one not take heed!\n\nHailiu, you must understand: when inner cultivation reaches completion, merit and conduct become naturally sufficient. You breathe as one with the Creator, thoughts move and spirits respond, spirit congeals and qi guards—like the mind commanding the fingers, the fingers obey without fail. Could such numinous power not be vast? What need is there for methods? What need for techniques?\n\nThose who remain obscured and fail to attain the spirit’s clarity, who have yet to penetrate the Way, are but ordinary emotions and thoughts. Purify these ordinary emotions and thoughts, then direct them with singular resolve to return to the true—thus does numinous power arise of itself.\n\nThe Elder Hailiu rejoiced. Master Lanyun thereupon inscribed these words.\n\n(Afterword by Xie: This passage contains many inner visions beyond the reach of brush and ink, beyond the grasp of conjecture—realms such as the Moon-in-Water, the World of Golden Sand, the Crimson-Purple Realm of Purity. The profound principles and states unfold in perfect order, serving as the true seal of the celestial immortals. This must not be overlooked.)\n\n**Cautions and Prohibitions, Chapter Eleven**\n\nIndulgence in idleness.\n\nMaster Niwan said: \"Those who indulge in idleness are no true aspirants, nor can they be compared to those who seek self-cultivation. How lamentable! Even if the sages were to return, they could scarcely guide such men toward the Dao. Their bodies are purely yin, for their refinement is ever outstripped by their indolence. Alas, what more can I say?\"\n\nElder Taixu said: \"How compassionate! That my master disdains to instruct them is itself the deepest teaching. Those of a placid nature suffer from sloth—they seem enlightened yet remain unenlightened, appear content yet know no true contentment. Such mediocrities, with their meager talents, mingle among the gates of the mysterious. Their efforts are truly pitiable.\" (Xie’s note: Reading this, I cannot help but break into a cold sweat.)\n\n\"My master pities them deeply, hence his sharp admonitions. Those who immure themselves in withered trees and empty halls are legion. I say such men merely fail to grasp the secrets of practice! To knowingly place oneself amid the arena of afflictions while clinging to idle ease, yet still scrutinize gains and losses with care—this is the mark of a great spiritual friend. Over time, as others recognize their cultivation, they may yet be moved from ignorance to wisdom. By examining the merits and flaws of this disposition, refining the inner self through diligent effort, who is to say this is not the grand thoroughfare to celestial immortality?\n\nWhy is this so? Once you have entered the gates of the mysterious, take care not to squander your days in vain. If you wish to spend your years in tranquil repose, my judgment is that you will fritter away hundreds and thousands of lifetimes. As for this idle ease, it is never truly attainable—this is precisely the intent behind my master’s sharp rebuke!\n\nAlas! Lacking both talent and strength, yet straining to be diligent, illness will surely follow. Better to work within one’s capacity and mold it into a vessel of accomplishment. Just as birds and swans differ in nature, each possesses its own secret path of refinement. No one is born in vain—all may attain the Dao. Do not abandon yourselves to fate!\"\n\n**Cautions and Prohibitions, Chapter Twelve**\n\nTo achieve results within a set timeframe—Niwanshi said: \"That one may achieve results within a fixed period is but the claim of a single school, not a universal principle. For endowments vary, and the dull and the wise differ. To insist on achieving results by a deadline is to invite harm without exception.\"\n\nTaixu the Elder said: \"The master’s words strike the mark. Whether one drinks water or broth, one knows its warmth or chill for oneself—the master cannot dictate it to the disciple, nor the father to the son. Endowments differ, and the wise and dull are not the same. Proceed as is fitting, and even if the time is not yet come, it is enough. If the way is not fitting, though the time has passed, the practice does not cease. The numbers seven and nine are but labels for the old and young, not deadlines for achievement. Thirty-six turns to the left, thirty-six to the right—this is the same as saying six of one and half a dozen of the other. Extending this logic, one need not be rigidly bound. It is like traveling a road: one measures distance by paces and strides, and the method is thus established. For those who take this path, they simply walk it, with arrival as the ultimate aim. Why must one scrutinize the steps of those who tread the mud? Steps vary in size, and their counts differ—is it not delusion to calculate distance by counting steps?\n\nThe Way of Celestial Immortality is alive and fluid—it cannot be discussed by those who cling to rigid forms and fixed texts.\"\n\n**Chapter Thirteen: Essential Prohibitions and Taboos**\n*Self-Imposed Boundaries of Purity and Defilement*\n\nMaster Niwan states: “Purity and defilement reside in the heart; external circumstances have no part in them. Yet among those of this world who aspire to the Dao, many falter and fail due to such delusion—how laughable indeed.”\n\nMaster Taixu remarks: “Profound are these words! ‘Purity and defilement reside in the heart; external circumstances have no part in them’—this is an immutable truth. To fixate on external conditions and draw boundaries is but the folly of those who consume antiquity without digesting it. Know this: all acts of purifying, expelling defilement, and the like—whether washing the face to cleanse the heart or burning incense to refine the nature—are of this principle.\n\nYet how absurd are those who, abandoning rites of mourning, go out of their way to avoid graves! They claim that scriptures warn that seeing a corpse within forty-nine days bars one from attaining the Dao. Little do they realize this teaching originates from the school of *li song*—a veiled critique of those who traffic in yin and yang, making a livelihood of funerals and burials, dwelling day and night amid such affairs, their entire lives steeped in the stench of death. Truly, such people lack the capacity to achieve the Dao.\n\nHowever, if practitioners of yin-yang arts were to sincerely recite the *Tai Xuan Jade Classic*, and further, to daily contemplate the mind’s essence, not only would their own bodies become pure, but all they encounter would transform, and what they preserve would become spirit. What greater merit could surpass this? This is what is meant by ‘forging ghostly affinities below’—it too yields a measure of attainment.\n\nMoreover, if the heart transcends the cycle of birth and death, what place remains for purity or defilement? Alas, since birth and death are no more, how can purity or defilement exist?\n\nNow, the school of *li song* rightly demands inner and outer refinement; the slightest laxity undermines reverence. Hence the rites of burning incense and offering sacrifices, the practices of bathing and changing garments. But for those who cultivate the Dao, who abide in undivided integrity, who tread the path of Celestial Immortality—vast and boundless as the void—what fear is there of inauspicious defilement? What taboo could possibly apply?\n\nYet if one lacks the Dao and feels affected by such things, there is a method: recite the *Tai Xuan Jade Classic* while holding the secret, and visualize the radiance of compassion—like the sun or moon—illuminating the Golden Court. Even if affected, no harm shall come.\n\nNever should one, out of self-imposed restrictions, wait until the seven-week mourning period concludes before paying respects, thereby neglecting great rites. Nor should external factors obstruct one’s progress in cultivation.\n\nThis is the merciful teaching our master has revealed to guide others.”\n\n**Cautionary Precepts to Know, Fourteenth: Clinging to the Ancient While Binding the Present**\n\nMaster Niwan said: “As times shift and the world changes, so too does the qi’s movement compel it. Those who cling to the ancient while binding the present know only how to cherish antiquity but fail to digest its essence. This must be guarded against.”\n\nMaster Taixu said: “Indeed, the ways of old have long ceased to function in the world. Take, for instance, the transmission of the Dao—there are circumstances where ancient methods cannot be applied, yet few understand this. Once, in a certain place, a certain master transmitted a certain Dao to a disciple. The rites and ceremonies were not fully observed, yet the transmission was completed. Another arose to reproach them, saying: ‘This Dao was passed down from such-and-such an ancestor, received from such-and-such a teacher. The rites were thus, the ceremonies so—how weighty they were! Yet now, this master transmits to this disciple in such a simplified, even irreverent manner. How can this be?’ The master wished to explain but could not, and to this day, the matter remains a subject of gossip.\n\nAlas! The reproach was not without reason. Yet how could the critic know that the circumstances of past and present differ? The Classic says: ‘Rites, rites—are jade and silk all there is to them?’ The ancient sages valued ritual forms precisely to gauge the sincerity of the recipient’s devotion. Today, however, it is otherwise. If one calculates the rites to determine the transmission, one will only summon contention and stagnation. Moreover, one may even slander the Dao because of the rites.\n\nAlas! It should be known that the master’s disregard for ritual in transmission was an act of revering the Dao, not disrespecting it. Applying this principle to the matter of clinging to the ancient while binding the present, there is indeed much that must be guarded against.\n\nAlas! The world rushes on—those who cling to antiquity do not truly understand it. Examining closely, most who invoke the past to bind the present do so falsely. Their hearts and conduct are even more unworthy of inquiry.”\n\n*(Xie’s Note: Though we now live in an era where science and technology flourish, when transmitting methods or imparting cultivation techniques, there are still many who rigidly adhere to ancient forms, demanding that disciples ascend altars and swear oaths. This only breeds resentment among learners, failing to inspire reverence for the Dao and instead provoking slander. Many practitioners have written to me, vehemently condemning such practices. Thus, I deeply understand the harm of clinging to the ancient while binding the present and urge fellow cultivators to reflect.)*\n\n---\n\n**Cautionary Precepts to Know, Fifteenth: The Body, Mind, and Intent**\n\nMaster Niwan said: “Those who master the three through reversal attain immortality; those who submit the three to pursuit remain bound to the human realm. Thus, one must guard against letting the body, mind, and intent follow their own course.”\n\nMaster Taixu said: “Profound are the master’s words! The body, mind, and intent may be called qi, spirit, and essence—or Heaven, Earth, and Water—for they contain this principle within. Thus, essence arises from the mind, spirit is possessed by intent, and qi is borne by the body, yet in truth, the mind governs all.\n\nTo master the three through reversal means to use the mind to govern intent, intent to govern the body, the body to stabilize resolve, resolve to stabilize spirit, and spirit to stabilize qi. Through mutual governance and stabilization, desires are purified, principles are refined, and unity is achieved—this is the Dao of immortality.\n\nTo submit the three to pursuit means only to let the mind follow intent, the body submit to intent, and intent submit to the mind. Through mutual submission and pursuit, desires flare while principles perish, giving rise to a thousand postures and ten thousand forms—this is the way of the human realm.\n\nAlas! One must understand that the Dao of Celestial Immortality employs reversal as its function, just as Heaven and Earth take their positions—only then is there harmony. Even Water and Fire, Wood and Metal possess the marvel of mutual union, while Water and Earth share the merit of harmony. Extending this principle, all things employ reversal as their function. This is why our master so earnestly admonishes us.”\n\n---\n\n**Cautionary Precepts to Know, Sixteenth: Neglect of Ritual and Etiquette**\n\nMaster Niwan said: “This can be seen outwardly as proof of inner cultivation—it is precisely the manifestation of reverence, sincerity, and devotion in both inner and outer realms. How can one afford to neglect it? A determined cultivator who violates this will surely fall into demonic paths. Must one not be guarded against it? This is not the same as the misguided notion of ‘excessive deference.’”\n\nMaster Taixu said: “Those who violate this precept are mostly of the sort who appear enlightened but are not. Such individuals have cultivated little merit in past lives and possess only meager talent and intelligence. Having met with misfortune and failed to find their place, they are rarely understood. When they offer reverence and respect, others do not reciprocate; some even mock them. Gradually, they reverse their conduct entirely. Then, meddlesome admirers praise them, saying: ‘So-and-so is truly talented—even the ancient recluses and eccentrics could not surpass them!’ The ignorant of the world echo this praise, bestowing upon them the fine names of ‘liberation,’ ‘serene detachment,’ and ‘aloof nobility,’ mutually reinforcing one another. Word of this reaches the ears of unworldly cultivators, who then imitate them from afar. This is how, in this degenerate age, the neglect of ritual and etiquette has become a pretext for preserving one’s ‘true nature.’\n\nLearners must indeed guard against this! Otherwise, they will surely fall into the demonic path of arrogant self-indulgence. One must be consistent in both inner and outer conduct, yet also know when to stop according to one’s station.\n\nThus, when occupying a position of honor, one should observe the rites of forgetting rank; when in a humble or junior position, one should fulfill the duties of a disciple. In interactions with peers, one should ensure that ritual propriety is not lacking—this is sufficient.\n\nOur Dao is the great Dao of Celestial Immortality. It does not shun people nor flee the world, so social interactions cannot be neglected. When bells and drums resound within the palace, their echoes reach beyond. Take care that the noble gentlemen of the four directions, upon hearing and seeing, do not depart with unfavorable impressions.\n\nMoreover, the Celestial Immortal’s practice is to embed the firing times within one’s movements, whether sitting, standing, or walking—how can one be careless? When one should sit while conversing, there are methods for sitting while talking. When walking while conversing, there are methods for walking while talking. When standing while conversing, there are methods for standing while talking. If others sit, one sits; if they rise, one rises; if they stand, one stands; if they walk, one walks.”\n\nIn all the circling and bowing of ritual exchanges, subtle and wondrous secrets reside within. One may practice the oral formulas of one’s art and refine one’s essence and qi at any place and time, while also carefully examining whether one’s practice is relaxed or strained. How could one carelessly perform the outward forms of social courtesy while neglecting the inner cultivation of divine skill? Thus, the precepts of the Celestial Immortal number as many as three thousand eight hundred, each a fine and detailed injunction.\n\nFor the more still the mind becomes, the more perfectly round it grows, attaining the marvel of effortlessly conforming to every rule without need for conscious attention. Yet one must, in ordinary times, minutely observe and embody these principles, so that when the moment of social engagement arrives, one will not find the rituals burdensome. Therefore, the determined scholars of old never neglected the forms of rising, standing, sitting, and walking in their households at all times, precisely to refine the oral formulas of rising, standing, sitting, and walking. When they emerged to engage with others—whether serving superiors, interacting as equals, or facing subordinates—they naturally achieved perfect harmony with the proper measures and secrets.\n\nThis is what is meant by “the great hermit in the marketplace.” Today, however, people assume that the household has no fixed norms and thus grow lax in their limbs and posture. They do not realize that the saying “the household has no fixed norms” does not refer merely to morning and evening duties. Rather, every great and small ritual must be made consistent within and without, free from any imbalance, hence the term “no fixed ritual.” Confucius’ appearance—calm and joyful—was precisely the subtle application of this embodied awareness in moments of leisure and repose. It can be grasped in the mind but not conveyed in words. Take care not to mistake leisure and repose as an excuse to neglect the essential work of natural reverence.\n\nAs the Record says: “At all times, think of fulfilling loyalty; in retreat, think of correcting faults.” This does not refer solely to matters of governance. Know that the success or failure of governance arises from the single mind. In all actions—moving, stopping, sitting, rising—if one knows the secret of settling the spirit, then the spirit will abide in the body and not fly off elsewhere. When one stands in court, matters will be naturally clear, decisions sound, responses harmonious, and conduct upright. In all exchanges and courtesies, humility will be fittingly modest, reverence fittingly composed, deference fittingly proper, eloquence fittingly lucid, discourse fittingly fluent, conduct fittingly correct, and integrity fittingly genuine.\n\nFor the Dao of the Celestial Immortal is this: in obscurity, one perfects oneself alone; in prominence, one benefits all under heaven. In stillness, one becomes a sage; in transformation, one becomes an immortal or buddha. All this begins and ends with the single work of the mind, culminating in a great transformation that does not cling even to itself—this is the learning of the Celestial Immortal. Who could say that ritual propriety may be neglected?\n\nIf ritual is performed merely as ritual, it becomes empty form. Outward reverence with inner laxity is still negligence—this must be taken as a strict warning, my disciples, take heed.\n\n*(Xie’s note: In movement, stillness, sitting, and rising, the aim is to settle the spirit within, for what is within naturally manifests without. Thus, inner calm produces outward reverence, inner harmony produces outward respect, and ritual propriety is achieved. But how does one settle the spirit within? Fellow practitioners may refer to the passage on “intervals between movement and stillness,” where they will surely grasp the meaning without need for further elaboration.)*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "天仙道戒忌须知 戒忌须知第一 迷不知止。 泥丸氏曰：“不知止，则志无所立而趋向惑摇矣。 ”太虚翁曰：“学仙须得学天仙，天仙由为仙道之止。 知止则不为地仙水仙等则法迷惑，而功用纯矣。 天仙之学，心学也。 专一修心乃为知止。 天仙之心，妙明圆觉，真常寂生，其大无外，其小无内者。 行止坐卧，或失此趣，应即反照。 觉照稍迟，便名迷止。 道程之所戒忌也。 要知我身非我身也，无一非此心之妙有而出自妙无者。 我则一一摄之复所自，则我身完固而此心始全。 儒门所云全受全归。 知此修复，古人谓之小知止。 以彼学者知觉运行，纯出理天，犹藉觉照而纯一者，尚有分别人法之见也。 如能人法双忘，出无入有，湛然常寂而告止者，古人谓惟自度一流，天仙之民人是也，未可谓之天仙之止。 夫我天仙之心，有视我身如世界者，有视世界如我身者，有一身世如微尘者，有纳微尘中藏亿亿恒河沙世界，而身如亿亿恒河沙世界，界界在在无量众生前。 或竖大法幢，或隐或显，教策济度人非人等咸登道岸，心不为功。 其出种种言行，若不出自我言，出自我行，一若出自纳现世界。 界界在在各各众生，一一自心之所自言自行，我无与焉者，厥心斯真。 由是修养，精勤无住，愈返愈明，愈纯愈精，是乃大罗天仙之心境如此。 知此立志，谓之无上大知止。 上所言辅命之性宗也。 命无性不立，故先详示云。 ” “若夫炼命之旨，总以阴尽阳纯为止。 神通飞腾不与焉。 其受炼也，曰精、曰气、曰神。 我闻之师，有先天之精焉，有后天之精焉，神与气亦各有二焉者。 炼之之法，亦自有一定之止诀焉。 研夫后天之精，有形有质者，似精而非精，饮食之所化，未经绛宫化血，而散游于四肢脏腑。 若不经彼海底一炼，不得化为凡气，随炁升脑降心，而化液化血以达肾。 复又升脐一和，随气抵海，大炼一番，势有不能成气，焉能升脑而化玉液乎？ 凡炼形质之精，不依此序而加功，谓之迷不知止。 炼之未及化成玉液而中止者，亦不得谓之知所止也。 若彼先天之精，真精也。 然其性属阴，我身肺气之所化。 炼之之法，经肾经脐，而下海一烹，复自升脐，与土一和，降穿尾闾，升巅一聚，天罡顶炁照之，立化金液，油然而降，滴入绛宫，始极清凉，脏腑为之一爽，转眼便化热炁，烘然下行，遍体为之一暖，觉此暖气氤氲，和入玄关，觉其中有吞吐之趣，此即乳哺婴儿之明证也。 世之炼真精者，炼不依此炼之，谓之迷不知止。 循诀而炼，不到和入玄关，亦不得谓之知止也。 至夫先天之气，阳火也，其真性属阴。 后天之气，阴火也，其体性属阳。 先天之气，无劳炼者，知所养诀，则与造物之真气通，而取之无尽矣。 先天之气来自坤宫，乾感坤气而成者，故其真性属阴。 后天之气来自兑方，兑悉震气而施行者，故其性体属阳。 养之之诀惟何？ 洗我髓，净我心，潜能勿用是也。 炼之之诀惟何？ 从事上养之诀加以凝神定虑，用我目光，时巡海底，则下极自得热腾如沸。 非惟凡气化为真气，而凡液亦得化为凡气。 得成如云如雾，下护玄关，上腾夹脊，随其真气氤氲升脑，时得天罡恩加炁照，亦得与真炁径化玉液焉，不亦幸乎。",
      "translated_text": "**The Heavenly Immortal’s Dao: Essential Prohibitions and Cautions**\n\n**First: On Knowing When to Cease**\n\nThe Master of Niwan states: *\"Without knowing when to cease, the will has no foundation, and one’s direction becomes confused and wavering.\"* The Elder of Great Emptiness says: *\"To learn immortality, one must learn the way of the Heavenly Immortal, for the Heavenly Immortal is the ultimate destination of the immortal’s Dao. Knowing when to cease prevents one from being misled by the methods of Earthly or Water Immortals, ensuring that one’s efforts remain pure. The study of the Heavenly Immortal is the study of the heart. To focus solely on cultivating the heart is to know when to cease. The heart of the Heavenly Immortal is wondrously luminous, perfectly awakened, truly constant, and silently generative—vast beyond all bounds, yet minute beyond all interiors. Whether in movement or stillness, sitting or lying down, if one loses this essence, one must immediately turn inward in reflection. Even a slight delay in this awareness and illumination is called ‘delusion in cessation,’ which is a prohibited transgression on the path of the Dao.*\n\n*One must understand that this body is not truly one’s own—nothing exists that does not arise from the wondrous presence of this heart, emerging from its wondrous absence. If I gather each and every thing back to its origin, then this body becomes whole and firm, and this heart becomes complete. This is what the Confucian tradition calls ‘complete reception, complete return.’ To cultivate and restore in this way is what the ancients called ‘lesser knowledge of cessation.’ For those who know this, their awareness and movement arise purely from the Heaven of Principle, yet they still rely on awareness and illumination to maintain unity, and thus retain the dualistic perception of self and dharma. If one can forget both self and dharma, emerging from non-being into being, abiding in serene constancy and attaining cessation, the ancients called this the path of ‘self-liberation’—the people of the Heavenly Immortal’s realm. Yet this cannot yet be called the cessation of the Heavenly Immortal.*\n\n*The heart of the Heavenly Immortal perceives this body as a world, or the world as this body; it sees a single body and lifetime as a speck of dust, or encompasses within a speck of dust countless worlds as numerous as the sands of the Ganges, while the body itself becomes as vast as those countless worlds. In every world, before every sentient being, it may erect the great banner of the Dharma, or conceal and reveal itself, teaching and guiding all beings—human and non-human alike—to reach the shore of the Dao, without the heart being attached to merit. Its words and actions arise as if not from itself, as if emerging from the worlds it encompasses. In every world, before every being, each one’s heart speaks and acts of its own accord, with no involvement from the self. Only then is the heart truly realized. Through such cultivation, diligent and unceasing, one returns ever more clearly, ever more purely and refined. Such is the heart and realm of the Great Luo Heavenly Immortal. To establish one’s will in this knowledge is called ‘supreme, great knowledge of cessation.’ What has been described above pertains to the School of Nature, which aids in the cultivation of destiny. Destiny cannot stand without Nature, and thus this has been explained in detail.\"*\n\n*\"As for the principles of refining destiny, the ultimate goal is the exhaustion of yin and the purity of yang. Spiritual powers and flight are not the aim. The objects of refinement are essence, qi, and spirit. My teacher spoke of primordial essence and postcelestial essence, and likewise of primordial and postcelestial spirit and qi. The methods of refining them each have their own definitive point of cessation.*\n\n*Examining postcelestial essence—tangible and substantial—it resembles essence but is not true essence, being derived from food and drink. Before it is transformed into blood in the Crimson Palace, it disperses through the four limbs and the organs. If it is not refined at the Sea of Qi, it cannot be transformed into ordinary qi, rising to the brain and descending to the heart to become fluid and blood, reaching the kidneys. Then, ascending to the navel for harmonization, it follows the qi back to the Sea of Qi for a great refinement. If it fails to become qi, how can it rise to the brain and transform into Jade Fluid? Refining tangible essence without following this sequence is called ‘delusion in not knowing when to cease.’ If one stops before it is fully transformed into Jade Fluid, this also cannot be called ‘knowing when to cease.’*\n\n*As for primordial essence, it is true essence. Yet its nature is yin, transformed from the lung qi of the body. The method of refining it involves passing through the kidneys and navel, descending to the Sea of Qi for refinement, then ascending to the navel to harmonize with earth. Descending through the Tailbone Gate, it rises to the summit for gathering. When the qi of the Celestial Stem illuminates it, it immediately transforms into Golden Fluid, descending smoothly into the Crimson Palace. At first, it is extremely cool, refreshing the organs, but in an instant, it transforms into hot qi, warming the entire body. When this warm qi pervades and harmonizes with the Mysterious Pass, one feels a sense of inhalation and exhalation within—this is the clear sign of nursing the infant. Those who refine true essence without following this method are deluded in not knowing when to cease. Even if one follows the method but stops before harmonizing with the Mysterious Pass, this cannot be called ‘knowing when to cease.’*\n\n*As for primordial qi, it is the fire of yang, yet its true nature is yin. Postcelestial qi is the fire of yin, yet its substance and nature are yang. Primordial qi requires no refinement—knowing the method of nurturing it, one connects with the true qi of creation and draws upon it endlessly. Primordial qi arises from the Kun Palace; when Qian responds to Kun’s qi, it is formed, and thus its true nature is yin. Postcelestial qi arises from the Dui direction; Dui exhausts the qi of Zhen to enact its movement, and thus its nature and substance are yang. What is the method of nurturing it? Purify my marrow, still my heart, and refrain from exerting hidden abilities. What is the method of refining it? Apply the method of nurturing with focused spirit and settled thoughts, using the light of the eyes to constantly survey the Sea of Qi. Then, the lower extreme naturally becomes hot and boiling. Not only is ordinary qi transformed into true qi, but ordinary fluid is also transformed into ordinary qi. It becomes like clouds or mist, protecting the Mysterious Pass below and ascending the Spine Ridge above. Following the pervasion of true qi, it rises to the brain. When the grace of the Celestial Stem adds its qi-illumination, it too can directly transform into Jade Fluid. Is this not fortunate?\"*",
      "overlap_context": "",
      "start_char": 1,
      "end_char": 1214,
      "start_sentence": 0,
      "end_sentence": 52,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.209073543548584,
      "metadata": {
        "source_file": "dao\\藏外\\天仙道戒忌须知.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "是玉液也，引以灌我绛宫，则清凉无比，脏腑生春； 以滋土釜，丹田温润，降透玄关，婴儿得食，遍体充和，是乃炼气初关之止境。 循而行之，其秘亦不外乎此者。 世之炼气者，则此法诀以行，亦可谓之能知止。 第其间升降运行时，有阻有滞，如束如兜，或痛或庠，则另有止诀存焉”。 戒忌须知第二 继续不专。 泥丸氏曰：“此则句义，《修仙辨惑论》语意不同。 此则句义偏在戒忌边，非有作用深义存焉，盖学贯绵密与专精耳。 若一断续，一不专，虽得真传，与无闻等，鬼神恶之。 非惟无益，玄律炳存，难逃冥罚，可不惧哉，可不戒哉。 ” 太虚翁曰：“修道如牛毛，成道如免角，盖指此辈之学道耳。 不然，古今道成者，即我闻见，亦成卷贴，何至有免角之喻乎。 其断续不专之弊，总惟性理不明，嗜欲碍败。 或因狃于成见；",
      "translated_text": "This Jade Fluid, when drawn to irrigate my Crimson Palace, brings unparalleled coolness and revives the springtime of the viscera. When used to moisten the Earth Cauldron, the Cinnabar Field becomes warm and moist, descending to penetrate the Mysterious Pass. The Infant is nourished, and harmony suffuses the entire body—this marks the culmination of the first stage in refining qi. Persisting in this practice, its secrets lie in nothing beyond this.\n\nThose who refine qi by following this method and these principles may be said to have attained the wisdom of knowing when to pause. Yet during the ascent and descent of its circulation, obstructions or stagnations may arise—binding like a cord or constricting like a net—causing pain or numbness. For these, there exists another method of cessation.\n\n**Second: Essential Prohibitions and Precautions**\nThe Master of Mud-Pill Palace states: \"The meaning of these passages differs from the intent of *On Dispelling Doubts in Immortal Cultivation*. Here, the emphasis lies in prohibitions and precautions, rather than profound operative principles. It concerns the thoroughness of learning versus the precision of focus. Should there be any interruption or lack of dedication, even with true transmission, it is as if one had never heard it—spirits and deities despise this. Not only is it of no benefit, but the luminous laws of the Mysterious remain in force, and one cannot escape karmic retribution in the unseen realms. How can one not fear this? How can one not be vigilant?\"\n\nMaster Tai Xu says: \"Those who cultivate the Dao are as numerous as ox hairs, but those who achieve it are as rare as rabbit horns—this refers precisely to such learners. Otherwise, from ancient times to the present, those who have attained the Dao, even within my own knowledge, would fill volumes. How could the metaphor of 'rabbit horns' apply? The harm of interruptions and lack of focus stems entirely from unclear understanding of inherent nature and principle, and the obstruction of desires. Or it may arise from clinging to fixed views...\"",
      "overlap_context": "o constantly survey the Sea of Qi. Then, the lower extreme naturally becomes hot and boiling. Not only is ordinary qi transformed into true qi, but ordinary fluid is also transformed into ordinary qi. It becomes like clouds or mist, protecting the Mysterious Pass below and ascending the Spine Ridge above. Following the pervasion of true qi, it rises to the brain. When the grace of the Celestial Stem adds its qi-illumination, it too can directly transform into Jade Fluid. Is this not fortunate?\"*",
      "start_char": 1214,
      "end_char": 1547,
      "start_sentence": 53,
      "end_sentence": 68,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.629584789276123,
      "metadata": {
        "source_file": "dao\\藏外\\天仙道戒忌须知.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "或缘妄识悟岐； 或不耐辛苦； 或视为高妙； 或疑其简易； 或虑师传未全，以与侣伴非士； 或有宿疾顿发； 或值新病适生； 或见所尊暴殒； 或闻外道名扬； 或躐等致疾； 或妄作滋灾； 或眷属阻； 或待时而误。 其魔不一，而失修惟同。 可胜叹哉”！ 戒忌须知第三 未足为足。 泥丸氏曰：“未足为足，古今修道人之通病，其根由于无闻，缘乏圣师友辅之故。 ”太虚翁曰：“我以是故，故于知止一则中，已逗所止境，为若辈当头棒喝也。 ” 戒忌须知第四 不信因果。 泥丸氏曰：“不信因果，达者之病，其病至恶。 虽得至道，性理不通，以未思深之故。 但知空寂，总成小乘。 愚昧沈习，祸无底止，可不惧哉。 ”太虚翁曰：“因之与果，如影随形，创不信说者，非惟自绝去径，亦且截其归路也。 纵或坚持空寂，不犯他戒，我知其命终之后，福报尽日，定化微尘，散之空境而已。 ” 戒忌须知第五",
      "translated_text": "Or it may stem from deluded perceptions leading to erroneous awakenings; or from impatience with hardship; or from regarding the Dao as loftily profound; or from doubting its simplicity; or from fearing that the master’s transmission is incomplete, or that one’s companions are unworthy; or from the sudden onset of chronic illness; or the emergence of new ailments; or from witnessing the untimely death of a revered figure; or from hearing of the fame of external teachings; or from advancing prematurely and inviting illness; or from reckless actions that breed disaster; or from family obstructions; or from waiting for the right time and missing the opportunity. The demonic obstacles are manifold, yet the failure in cultivation is the same—how lamentable indeed!\n\n**Third Caution: Never Deem Insufficiency Sufficient**\nMaster Ni Wan says: \"To deem insufficiency sufficient is the common affliction of Dao cultivators across the ages. Its root lies in ignorance, stemming from the lack of sagely teachers and virtuous companions.\"\nMaster Tai Xu says: \"For this very reason, in the principle of *knowing when to stop*, I have already hinted at the boundary one should not transgress—a wake-up call for such practitioners.\"\n\n**Fourth Caution: Disbelief in Cause and Effect**\nMaster Ni Wan says: \"Disbelief in cause and effect is the malady of the enlightened, and it is most pernicious. Even if one attains the supreme Dao, without comprehension of inherent nature and principle—due to shallow reflection—one remains confined to emptiness and quiescence, ultimately becoming a follower of the Lesser Vehicle. For the ignorant and those mired in habit, the calamities are boundless—how can one not fear this?\"\nMaster Tai Xu says: \"Cause and effect are like shadow following form. Those who deny this principle not only sever their own path forward but also cut off their path of return. Even if one steadfastly upholds emptiness and quiescence without violating other precepts, I know that upon the exhaustion of their karmic blessings at life’s end, they will surely dissolve into motes of dust, scattered into the void.\"",
      "overlap_context": " are as numerous as ox hairs, but those who achieve it are as rare as rabbit horns—this refers precisely to such learners. Otherwise, from ancient times to the present, those who have attained the Dao, even within my own knowledge, would fill volumes. How could the metaphor of 'rabbit horns' apply? The harm of interruptions and lack of focus stems entirely from unclear understanding of inherent nature and principle, and the obstruction of desires. Or it may arise from clinging to fixed views...\"",
      "start_char": 1547,
      "end_char": 1914,
      "start_sentence": 69,
      "end_sentence": 98,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.762150764465332,
      "metadata": {
        "source_file": "dao\\藏外\\天仙道戒忌须知.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "人我山高。 泥丸氏曰：“人我山高，私心肆矣。 纵能精进，必附魔道”。 太虚翁曰：“人我不除，四相具矣，烦恼是非，刻无得静，势有必然，嗔念必多，纵知炼气精圆，适成魔家眷属，我师所言知也”。 戒忌须知第六 淫心不断。 泥丸氏曰：“淫心不断，纵能精修，譬如蒸砂作饭，万无成理”。 太虚翁曰：“淫心之生，出自爱河。 不断淫戒，人根火炽，烧断真路，附落水族，为祸非细。 况丹道以保精为第一关，精亏则气亏，气亏则神衰，神衰则真火微，炉灶必冷，而群阴肆，病发必死。 若彼志土，或囿于成见，以为不孝有三，无后为大，我辈生有儒门，岂容迳辟。 亦惟为奏帝天，开一活径，倘有志士，于神完精足之际，愿为其先延种子，以劝度执见过儒者。 许其一索再索，理无不中生必是男。 第一已孕即须断戒，不得流连，有违戒者，贬入生道，流充爱坑，受种种报。 我师以为然，为达吕祖，吕祖许之，已有存案存行三天，下诰九原矣。 然此乃秘密之说，知之者毋得妄泄诰行之原，恐招人谤耳。 （谢氏按：今日今世，世情更加繁杂，一旦进入婚姻围城之内，绝非古哲此法能善后者也，须知结婚后之变数甚大，更过于未结婚时。 要么，不结婚，要么所娶所嫁者，乃同好志士也。 否则，很难摆脱。 人生有做不完的事，若想人事皆尽后，再事仙学，吾恐其终成推拖之词。 年与日去，意与形时驰，白发青颜，一生无成矣）呜呼,　天地且幻,　万有非真，形形如续，习业因缘之所造，正是苦事。 世人之不断淫事也，好之深。 谓曰嗣续计者，乃词也。 不然，寡欲多男，医书可证。 彼所谓色者，并非色也，特欲火炽而莫判耳。 断之之法，惟一惧字，庶几利焉。 由勉至淳，三百日，斯易不炽矣。 是以古人悬一骷髅，存如腐尸，或悬圣像，或特经咒，或行礼拜，或结侣伴，皆以制斯一念耳。 然莫若置身于虚，摄心于无，使彼六根六尘，无处着脚。 惟用我老子游心于初一诀，何等简易！ 我愿世之志士，刻从事斯句，则丹道亦因速成，何利如之。 ”师曰：“然，是汝所说”。 戒忌须知第七 吝伐不除。 泥丸氏曰：“吝伐不除，人我相大，因果感应之源，注记帐繁，消报不平，公案难了，超脱无期，或变业障，古今比比也。 ” 太虚翁曰：“要知舍施济拔分内事也。 一生吝念，善缘错过，舍而念存，谓之退悔，功转微矣，岂不惜哉。 一存伐念，骄胜气肆，非惟功除，业根载矣，可不惧哉。 我师所以出此痛言于上。 盖欲修道，必欲积功，积功一层，舍布施苦行，何以而积？ 且彼善缘，易失难得。 遇而即行遇之仁，行而不伐之谓之义，受侮招谤不之悔谓之德，施恩种德莫之念谓之道。 噫，天与我力，又赐我缘，是以得行，奈何从而吝生伐乎？ 古之志士，闻见必信，信无不行。 今之志士，以能疑为智，以察审为明，是以有立功立德之谋，而终无德功得积也，是昧夫所谓德与功，一心性天良圆而已。 故古之志士，但尽我心我力，闻见斯行，终不计夫彼之虚实也，故其德功积易圆。 若云可疑，天下事无不可疑者。 待信而后行，万无行理。 亦恐待济者已早不及待，死者死，败者败焉已，可不惜哉。 若吝与伐者，不足与言大道也。",
      "translated_text": "The Mountain of Self and Others Looms High.\n\nMaster Ni Wan says: \"When the mountain of self and others looms high, private desires run rampant. Even with diligent cultivation, one inevitably attaches to demonic paths.\" Master Tai Xu says: \"If the sense of self and others is not eradicated, the four marks of existence remain intact. Afflictions and disputes will never cease; this is an inevitable consequence. Anger and resentment will multiply. Even if one knows how to refine qi to perfection, one merely becomes a member of the demonic household—just as my teacher foretold.\"\n\n**Sixth Admonition: Lustful Thoughts Must Be Severed.**\n\nMaster Ni Wan says: \"If lustful thoughts are not severed, even with diligent cultivation, it is like steaming sand to make rice—utterly without principle.\" Master Tai Xu says: \"The arising of lustful thoughts stems from the river of desire. Failing to sever the precept of lust, the fire of human desire burns fiercely, scorching the true path. One falls into the realm of aquatic beings, and the calamity is no small matter. Moreover, in the Dao of elixir refinement, preserving essence is the foremost gate. If essence is depleted, qi is depleted; if qi is depleted, spirit wanes; if spirit wanes, the true fire weakens. The furnace and stove will grow cold, and the host of yin forces will run amok, leading to illness and certain death.\n\nIf certain scholars, constrained by conventional views, argue that of the three forms of unfilial conduct, having no descendants is the gravest, and that we, born into the Confucian tradition, cannot simply abandon this path—then we may petition the Emperor of Heaven to open a living path. For those determined cultivators, when spirit is complete and essence is full, if they wish to first extend their lineage, this may persuade obstinate Confucians. They are permitted to seek offspring once or twice, and it is certain that the child born will be male. However, upon the first conception, they must immediately sever and uphold the precept. They must not linger or violate the precept; those who do will be demoted into the realm of birth, flowing into the pit of desire, and will suffer all manner of retribution.\n\nMy teacher deemed this correct, and upon reporting it to Ancestor Lü, Ancestor Lü approved it. It has been recorded in the archives of the Three Heavens and proclaimed to the Nine Realms. Yet this is a secret teaching; those who know of it must not recklessly disclose its origins, lest they invite slander.\"\n\n*(Xie’s Note: In today’s world, with its even greater complexities, once one enters the confines of marriage, this method of the ancient sages cannot adequately resolve the aftermath. One must understand that the variables after marriage are far greater than before. Either do not marry, or marry a like-minded cultivator. Otherwise, it is very difficult to escape. Life is filled with endless tasks; if one waits to pursue immortality only after all worldly affairs are settled, I fear this will become nothing but an excuse for procrastination. Years and days pass swiftly, intentions and form race with time, and before one knows it, hair turns white, complexion fades, and a lifetime yields no achievement.)*\n\nAlas! Heaven and earth are but illusions; the myriad existences are not real. All forms arise and continue due to the causes and conditions of habitual karma—this is truly suffering. Yet people’s failure to sever lustful affairs stems from deep attachment. Those who speak of lineage and succession do so merely as an excuse. Otherwise, medical texts confirm that those with few desires often have more sons. What they call \"sensuality\" is not true sensuality but rather the unchecked blazing of desire.\n\nThe method to sever it lies in a single word: *fear*. This may bring benefit. Through diligent effort, one reaches purity. After three hundred days, this fire will no longer blaze. Thus, the ancients would hang a skull, contemplate a rotting corpse, display sacred images, recite scriptures and mantras, perform prostrations, or form companionships—all to restrain this single thought. Yet nothing surpasses placing oneself in emptiness and gathering the mind in nothingness, leaving the six senses and six dusts with no foothold. Simply employ the first secret of our Master Laozi, \"roaming the mind in the primordial\"—how effortless and simple!\n\nI urge the determined scholars of this world to diligently apply this teaching. The Dao of elixir refinement will then swiftly come to fruition—what greater benefit could there be?\" The Master said: \"Indeed, what you have spoken is correct.\"\n\n**Seventh Admonition: Stinginess and Boastfulness Must Be Eradicated.**\n\nMaster Ni Wan says: \"If stinginess and boastfulness are not eradicated, the sense of self and others grows vast. This is the source of karmic cause and effect, where accounts are recorded in abundance, retributions remain unbalanced, cases are difficult to settle, and liberation is endlessly delayed. One may even transform into karmic obstacles—such examples abound in ancient and modern times.\"\n\nMaster Tai Xu says: \"One must understand that almsgiving and salvation are inherent duties. A lifetime of stinginess causes one to miss good affinities. If one gives but retains the thought of regret, this is called backsliding, and merit diminishes—is this not lamentable? If one harbors boastful thoughts, arrogance and dominance run wild. Not only is merit erased, but the roots of karma are planted—how can one not fear this? This is why my teacher spoke these painful words above.\n\nTo cultivate the Dao, one must accumulate merit. To accumulate merit, how can one do so without almsgiving and ascetic practice? Moreover, good affinities are easily lost and difficult to obtain. Encountering them and acting is benevolence; acting without boasting is righteousness; enduring insults and slander without regret is virtue; bestowing kindness and planting virtue without attachment is the Dao.\n\nAlas! Heaven grants me strength and bestows upon me the opportunity—how can I then allow stinginess and boastfulness to arise? The determined scholars of old heard and believed, and what they believed, they practiced without fail. The determined scholars of today consider skepticism wisdom and scrutiny clarity. Thus, they may devise plans to establish merit and virtue, yet ultimately, no merit or virtue is accumulated. They are ignorant of what merit and virtue truly are—nothing more than the perfection of the mind’s inherent nature and celestial goodness.\n\nTherefore, the determined scholars of old simply exhausted their hearts and strength. Upon hearing, they acted, never calculating the truth or falsity of others. Thus, their merit and virtue accumulated and perfected easily. If one insists on doubt, there is nothing in this world that cannot be doubted. To wait for certainty before acting is to never act at all. Moreover, one fears that those awaiting aid may perish before help arrives—some die, some fail—is this not lamentable? Those who are stingy and boastful are unworthy of discussing the Great Dao.\"",
      "overlap_context": "rant and those mired in habit, the calamities are boundless—how can one not fear this?\"\nMaster Tai Xu says: \"Cause and effect are like shadow following form. Those who deny this principle not only sever their own path forward but also cut off their path of return. Even if one steadfastly upholds emptiness and quiescence without violating other precepts, I know that upon the exhaustion of their karmic blessings at life’s end, they will surely dissolve into motes of dust, scattered into the void.\"",
      "start_char": 1915,
      "end_char": 3143,
      "start_sentence": 99,
      "end_sentence": 149,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 34.38869261741638,
      "metadata": {
        "source_file": "dao\\藏外\\天仙道戒忌须知.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "彼虽精修，我决其终囿生死窟，而化为冤债种子之云，可不戒哉！ （谢氏按：有钱者之所以有钱，在于自然造化借彼之手救济无钱之人，而非讥笑嘲讽无钱者也； 有力者所以有力，在于自然造化借彼手帮助无力者，而非欺侮玩弄无力者。 权势钱财，学识见闻皆缘于每人机缘造化之所不同。 穷其本质，生命皆是平等，本无高下贵贱，侮辱他人即侮辱人性生命，而自己亦是人，故亦侮辱了自己之人格。 凡修炼无进者，当省之又省矣。 ） 戒忌须知第八 得失念生。 泥丸氏曰：“得失念生者，未有能循古志而不妄加作用者也，其造流弊，有不可胜数矣。 ”太虚翁曰：“要知人性本善，天理备存，曰得曰失，据彼人事而言也。 我辈所修者道。 道曰修者，以为妄蔽我心，妄障我性，三尸九虫，七情六欲，朋比为奸，以克我身，是必加修而身始安。 修也者，修而去其妄蔽焉而已。 妄去则真，障去则明。 真与明也，完然而具，未尝有失，得从何来？ 戡破斯理，何得失之可有？ 有且无有，心何妄动？ 憧憧内战，是其自伊戚耳。 我以为除得一分欲，明得一分心； 去得十分欲，明得十分心。 我愿学者务除其欲而去其妄，明其心性，自得妙明圆觉矣。 苟或不信，而住于患得患失之间，我不知其究竟矣。 我亦惟有听之焉而已矣。 可不戒哉”。 戒忌须知第九 动静有间。 泥丸氏曰：“人之一身，自该动静。 动者其神，静者其精。 气之动静，一听之神。 故其身之动也，神使夫气，气承夫神，御精而行也。 及其静也，神驭精于气，率气以休于气穴而已。 吾之妙明圆觉心性本无动静，焉有去来。 奈何因身之动静，而有间我心学乎。 吁，未之思耳。 ”",
      "translated_text": "Though they may cultivate with great diligence, I firmly declare that they remain ultimately confined within the pit of birth and death, transformed into seeds of karmic debt—how can one not be wary of this!\n\n*(Xie’s note: The reason the wealthy possess wealth is that the natural workings of creation borrow their hands to relieve the impoverished, not to mock or deride them. The reason the strong possess strength is that the natural workings of creation borrow their hands to aid the weak, not to bully or toy with them. Power, wealth, knowledge, and experience all arise from the differing karmic conditions of each person. Yet when one examines their essence, all lives are equal—there is fundamentally no high or low, noble or base. To humiliate others is to humiliate the human nature of life itself, and since one is also human, it is to humiliate one’s own dignity. Those who make no progress in cultivation should reflect deeply upon this.)*\n\n**Eighth Caution: The Arising of Thoughts of Gain and Loss**\nMaster Niwan said: “Those who entertain thoughts of gain and loss have never been able to follow the ancient resolve without recklessly imposing their own contrivances. The harms they bring about are beyond counting.”\n\nMaster Taixu said: “One must understand that human nature is fundamentally good, and the heavenly principle is fully present. ‘Gain’ and ‘loss’ are terms spoken only in reference to human affairs. What we cultivate is the Dao. The Dao is called ‘cultivation’ because delusion obscures our minds, illusion obstructs our nature, the Three Corpses and Nine Worms, the Seven Emotions and Six Desires, conspire together to harm our bodies—thus, we must engage in cultivation to secure peace. Cultivation means nothing more than removing these delusions and obstructions. When delusion is gone, truth remains; when obstruction is gone, clarity emerges. Truth and clarity are complete and inherent—there has never been any loss, so where could gain come from? Once this principle is thoroughly understood, how can there be any gain or loss? If there is not even existence, how can the mind be moved by delusion? The inner turmoil of conflict is but one’s own self-inflicted sorrow.\n\nI hold that for every part of desire removed, the mind gains a part of clarity; for every ten parts of desire eradicated, the mind gains ten parts of clarity. I urge scholars to diligently eliminate desire and dispel delusion, to clarify their mind and nature, and thereby attain the wondrous clarity of perfect enlightenment. If one does not believe this and remains trapped between the anxieties of gain and loss, I know not what their ultimate fate shall be. I can only leave it to them. How can one not be wary of this?”\n\n**Ninth Caution: The Interval Between Movement and Stillness**\nMaster Niwan said: “The human body inherently encompasses both movement and stillness. Movement pertains to spirit; stillness pertains to essence. The movement and stillness of qi are governed by spirit. Thus, when the body moves, spirit commands qi, qi follows spirit, and together they guide essence in motion. When the body is still, spirit directs essence through qi, leading qi to rest within the qi cavern.\n\nOur wondrous, clear, and perfectly awakened mind-nature is originally without movement or stillness—how could there be any coming or going? Alas, why should the body’s movement and stillness create a gap in the cultivation of our minds? This is merely a failure to reflect deeply.”",
      "overlap_context": "heir hearts and strength. Upon hearing, they acted, never calculating the truth or falsity of others. Thus, their merit and virtue accumulated and perfected easily. If one insists on doubt, there is nothing in this world that cannot be doubted. To wait for certainty before acting is to never act at all. Moreover, one fears that those awaiting aid may perish before help arrives—some die, some fail—is this not lamentable? Those who are stingy and boastful are unworthy of discussing the Great Dao.\"",
      "start_char": 3143,
      "end_char": 3790,
      "start_sentence": 150,
      "end_sentence": 185,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.499858617782593,
      "metadata": {
        "source_file": "dao\\藏外\\天仙道戒忌须知.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "太虚翁曰：“旨哉师言，发前人所未发，慈未后人，余小子敢不从而详述哉。 闻之师，古之志人，行止坐卧，不废其功，而各有行之之诀，故能动静无间。 而有百日筑基，十月胎圆，三年乳哺之功之验。 今研其动，曰行曰止。 止者，立也； 行者，步也。 研其静，曰坐曰卧而已。 其炼诀惟一，而存炼之所则有四。 一者何？ 凝神而已（此一句包括汗牛充栋所言炼法烹法诸书）。 四者何？ 行则凝神于涌泉两穴； 立则凝神于海底； 坐则凝神于绛宫； 卧则凝神于坤腹。 若夫坐而应对，立而酬应，则异于独坐独立焉。 坐则先存，自海底兜后达背。 有如佛像之火焰然，则应对神静（据鄙见，还宜加用炁向客那前一边，在客背后一包，从地底收回），而语言调达（此一包要用得神速，只须看见客时，以神向其背后，从地下包过来，则此炁机已在我后升上，又复向客一包，如一鸡卵然，而我与客在其中，如是则我但用遍体神凝一段充和功用为妙）。 立则先存神于两足底板，微微用力踏住，而口酬应（即如坐功之亦可如此），则神安而不飞焉。 其卧功亦有两法，名希夷睡，名环阳睡。 希夷者，陈抟祖师御赐之征号。 环阳者，茅山李老君之号，是柏子老君，非太上所化之老君也。 其睡法各有妙处。 如用希夷睡，侧左者曲其左肱，以手心垫面，开其大指、食指，以左耳 安在大指、食指开空之处，则耳 窍留其空矣 ，直其腰背，曲其左股，达其坤腹，泰然安帖于褥际〈鄙见谓腰腹及右股须各偏乎 仰一边，则丹田气舒也 矣 〉，直安右股于左足脚侧（鄙见谓右股宜略带平势而开，则与肾处不帖着，方为安当），以右手心，安帖脐轮，而凝其神于脐后，存我一身，威如晶之明，而如睡于乎 波水面，下空无底，而一身被褥，存化白气如鸡卵然，而我睡其中，此侧左之法，如侧右亦然，若用环阳睡，睡不侧睡，而于上半身垫物，须高厚于下半身所垫，约高半尺或三寸，仰而睡，两手握固，直其两臂，八字安开，两股亦然，而于开处各离肾囊一二寸许，缄口闭目而冥其心，时约十几息，存见氤氲然，如云中雾，绕我一身内外，以意凝留绛宫（凝留此氤氲气也 ），有若存若忘之诀（如是存当必觉此胸际或板木或烦热几有不可忍之气象，是氤氲之气得我心火一烘，气将化血，方用下所说诀，则血可归肾焉 ），我之两目，冥照于胸背褥下，有若无底然（如是则血有热气，从心后脊前分作两路，左右流注腰肾，乃血化为精之验），亦勿太作意，而松松如顾而已（此顾字，即修仙辨惑论中操持照顾之顾也 ）。 其中妙义，有不可胜述者（盖即我注中所述之类）。",
      "translated_text": "Elder Taixu said: “Profound indeed are the Master’s words, revealing what none before have revealed, and mercifully guiding those who come after. How dare I, a humble disciple, not follow and expound upon them in detail?\n\nI have heard from the Master that the dedicated practitioners of old never neglected their cultivation, whether in walking, standing, sitting, or lying down, each with its own method of practice. Thus, they achieved seamless continuity between movement and stillness, attaining the verifiable results of a hundred days of foundation-building, ten months of fetal perfection, and three years of nurturing refinement.\n\nExamining movement, we speak of walking and standing. Standing is to stand firm; walking is to step forward. Examining stillness, we speak only of sitting and lying down. Though the method of refinement is singular, there are four loci for its application.\n\nWhat is the one method? It is simply the gathering of spirit. (This single phrase encompasses the myriad methods of refinement and alchemical transformation described in countless texts.)\n\nWhat are the four loci? When walking, gather spirit at the Yongquan acupoints of both feet; when standing, gather spirit at the Sea Bottom; when sitting, gather spirit at the Crimson Palace; when lying down, gather spirit at the Earthly Abdomen.\n\nHowever, when sitting while conversing or standing while responding to others, the practice differs from solitary sitting or standing. When sitting, first gather spirit from the Sea Bottom, drawing it upward along the back, like the flame of a Buddha statue. This ensures composure during conversation. (In my humble opinion, one should also direct qi toward the guest’s front, enveloping their back from below the ground, then drawing it back.) Speech will then flow with measured clarity. (This enveloping must be executed with swift spiritual agility: upon seeing the guest, direct spirit behind them, enveloping from below the ground so that the qi mechanism ascends behind you, then envelop the guest again, as if encasing them in an egg, with both of you within. Thus, the wondrous application lies in the harmonious gathering of spirit throughout the body.)\n\nWhen standing, first gather spirit at the soles of both feet, pressing down gently with force while responding orally. (This may also be done as in sitting practice.) The spirit will then remain settled and not scatter.\n\nLying-down practice has two methods: the Sleep of Xiyi and the Sleep of Huanyang. Xiyi was the honorific bestowed upon Ancestral Master Chen Tuan. Huanyang was the title of the Elder Lord Li of Mount Mao—this being the Elder Lord of the Cypress Tree, not the Elder Lord transformed by the Supreme. Each sleeping method possesses its own marvels.\n\nFor the Sleep of Xiyi, if lying on the left side: bend the left arm, using the palm to support the face, parting the thumb and forefinger so that the left ear rests in the gap between them, leaving the ear’s orifice unobstructed. Straighten the waist and back, bend the left thigh, and extend it to the Earthly Abdomen, resting comfortably upon the bedding. (In my humble opinion, the waist, abdomen, and right thigh should incline slightly toward the supine side, allowing the qi of the Elixir Field to flow freely.) Extend the right thigh alongside the left foot. (In my humble view, the right thigh should be slightly elevated and parted to avoid pressing against the kidneys, ensuring proper comfort.) Place the right palm over the navel, gathering spirit behind it. Envision the body’s luminous clarity, as if floating upon still water with an abyssal void below. The bedding and body transform into a white qi, like an egg, within which one sleeps. This is the method for lying on the left side; the same applies when lying on the right.\n\nFor the Sleep of Huanyang, one does not lie on the side but elevates the upper body with padding, approximately half a foot or three inches higher than the lower body. Lie supine, clench the fists, extend the arms straight, and part them in an open posture, as with the thighs, keeping them one or two inches from the scrotum. Seal the mouth, close the eyes, and still the mind. After about ten breaths, envision a misty vapor, like clouds or fog, enveloping the body inside and out. With intention, gather and retain this vapor at the Crimson Palace. (This gathering should be done with a state of near-forgetfulness. One may feel the chest becoming stiff or overheated, even unbearably so—this is the vapor, warmed by the heart’s fire, about to transform into blood. Only then should the following method be applied, allowing the blood to return to the kidneys.)\n\nWith the eyes inwardly gazing at the chest, back, and bedding below, perceive an abyssal void. (Thus, the heated blood flows from behind the heart and before the spine, dividing into two paths along the left and right, circulating into the waist and kidneys—a sign of blood transforming into essence.) Do not exert too much effort; remain relaxed yet attentive. (This “attentiveness” is the same as the “observing and guarding” described in *Discerning Delusions in Immortal Cultivation*.)\n\nThe subtleties within are too numerous to recount in full. (They are akin to those described in my annotations above.)”",
      "overlap_context": " spirit. Thus, when the body moves, spirit commands qi, qi follows spirit, and together they guide essence in motion. When the body is still, spirit directs essence through qi, leading qi to rest within the qi cavern.\n\nOur wondrous, clear, and perfectly awakened mind-nature is originally without movement or stillness—how could there be any coming or going? Alas, why should the body’s movement and stillness create a gap in the cultivation of our minds? This is merely a failure to reflect deeply.”",
      "start_char": 3791,
      "end_char": 4782,
      "start_sentence": 186,
      "end_sentence": 220,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.291651964187622,
      "metadata": {
        "source_file": "dao\\藏外\\天仙道戒忌须知.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "其中大旨在生血之功有八，而化精之功有二焉。 若夫与人同睡，其诀有九，恐误后学，流入旁门，不敢述也。 ”（谢氏按：男女同睡宜相向，同性相眠须背向，其中心诀，有不可妄说者，想必能购此书、阅此书者，皆有师承来历，或为高明通达之士，故不妨请教其本师可矣。 在下不便述其法诀也。 ） 初丙午岁十月朔，懒云氏侍太虚翁，为述泥丸氏天仙道程宝则，天仙道戒忌须知。 述至动静有间一则，懒云氏心动，太虚翁神人也，为南岳分神，左手有文曰主宰太虚（其文似篆而灵活有飞蟠之势，其色纯朱，于其殁际，沐手乃见），故号太虚。 懒云氏盖心请笔所述于书，以度世之有缘者。 太虚翁曰：“可得汝而笔之，我何吝焉，大江南北，将遍流诸，虽然，时尚有待。 ”乃起而吟，吟曰：“皇岁三六，越又二三。 神河滨北，娄工舍南。 琐琐野人，赤脚帝男。 伊焉授受，诀始流传。 ”吟毕，复曰：“得之不难，闻之亦众，第其中各视其质地何如，而所修自异，即所证亦不同焉，览是书者，皆我个中人，幸毋自弃。 ”已而又曰：“我师昨至，谓我将应帝召，行有期矣。 ”起而吟曰：“住世七十九，光阴非等闲，喜完真面目，神证太虚天。 ”吟毕，授笑出纸，曰：“录”。 遂自道程宝则起，次第端书，录至动静有间，则已值月之望日矣。 太虚翁曰：“盍将朔日吟句，会录成则，附于是则述后，以为将来首授道侣，作一证缘乎。 ”懒云氏起而纂之，纂毕以呈。 太虚翁曰：“善”。 又曰：“为我续书之。 ”续曰：“我所述，诸书未悉载，得之者慎毋轻视，得而不行，行而不勤，勤而不恒，皆名轻视，生不成道，某月日（原本乃乾隆丙午十月望日），澹泊主人（澹泊，斋名，即归安县射村开化院之澹泊境，太虚翁羽化处。 ）太虚翁嘱，懒云氏识”。 吁！",
      "translated_text": "The essential principles herein lie in eight methods for generating blood and two for transforming it into essence. As for the nine techniques pertaining to sleeping alongside another—lest they mislead later learners into heterodox paths—I dare not expound upon them.\n\n*(Xie’s note: When man and woman sleep together, they should face one another; when persons of the same sex share a bed, they must turn their backs. The core secrets therein are not to be recklessly disclosed. Yet those who have acquired and perused this book are surely of proper lineage or enlightened and discerning scholars; thus, they may inquire of their own masters. I shall not presume to describe these methods here.)*\n\nIn the first *bingwu* year of the cycle, on the first day of the tenth month, Lazy Cloud attended upon the Elder of Great Emptiness, who recounted the *Precious Principles of the Celestial Immortal’s Dao Path* and the *Essential Prohibitions of the Celestial Immortal’s Dao*. When the discourse reached the section on \"Intervals of Movement and Stillness,\" Lazy Cloud’s heart stirred. The Elder of Great Emptiness was a divine being, an emanation of the Southern Marchmount, with a mark on his left hand reading *Sovereign of Great Emptiness* (the script resembled seal characters yet was animated, with a soaring, coiling vitality; its hue was pure vermilion, visible only when he washed his hands at the moment of his passing)—hence his name. Lazy Cloud, moved in heart, entreated to transcribe the Elder’s words into this book, to transmit them to those in the world with karmic affinity.\n\nThe Elder of Great Emptiness said: “If you are willing to record them, why should I withhold? Soon they shall circulate widely throughout the lands north and south of the Great River. Though the time is not yet ripe.” He rose and chanted:\n\n*“In the imperial year three six,\nThen two three more pass by.\nNorth of the Divine River’s shore,\nSouth of Lou and Gong’s abode.\nA humble rustic, barefoot son of heaven,\nThere the transmission began.\nFrom him the secrets first were spread.”*\n\nWhen the chant ended, he continued: “Though the attainment is not difficult, and many have heard of it, each must gauge their own nature and capacity, for their cultivation will differ, and so too their realization. All who read this book are of our fellowship—take care not to abandon yourselves.”\n\nAfter a pause, he added: “My master arrived yesterday and said I shall soon answer the Emperor’s summons; my departure is near.” He rose again and chanted:\n\n*“Seventy-nine years in the world,\nTime not to be idly spent.\nGlad to complete my true countenance,\nSpiritually attaining the Heaven of Great Emptiness.”*\n\nWhen the chant concluded, he smiled, took out paper, and said: “Copy it down.” Thus, beginning with the *Precious Principles of the Dao Path*, Lazy Cloud transcribed each section in order. By the time he reached \"Intervals of Movement and Stillness,\" it was already the full moon.\n\nThe Elder of Great Emptiness said: “Why not compile the verses chanted on the first day into a complete text and append them to this section, as a testament for future initiates, a token of karmic connection?” Lazy Cloud rose and compiled them, then presented the work.\n\nThe Elder of Great Emptiness said: “Well done.” Then he added: “Continue the transcription for me.” He dictated:\n\n*“What I have set forth is not fully recorded in other texts. Those who obtain it must not treat it lightly. To receive and not practice, to practice without diligence, to be diligent yet inconsistent—all are forms of disdain. Failing to achieve the Dao in life, on such-and-such a day (the original text reads: the full moon of the tenth month in the *bingwu* year of the Qianlong reign), the Master of Indifference (Indifference being the name of his studio, the *Indifferent Realm* of Kaihua Monastery in She Village, Gui’an County, where the Elder of Great Emptiness ascended) charged this upon me. Recorded by Lazy Cloud.”*\n\nAlas!",
      "overlap_context": "ed blood flows from behind the heart and before the spine, dividing into two paths along the left and right, circulating into the waist and kidneys—a sign of blood transforming into essence.) Do not exert too much effort; remain relaxed yet attentive. (This “attentiveness” is the same as the “observing and guarding” described in *Discerning Delusions in Immortal Cultivation*.)\n\nThe subtleties within are too numerous to recount in full. (They are akin to those described in my annotations above.)”",
      "start_char": 4782,
      "end_char": 5474,
      "start_sentence": 221,
      "end_sentence": 245,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.867766857147217,
      "metadata": {
        "source_file": "dao\\藏外\\天仙道戒忌须知.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "时越十一日，而太虚翁果辞世矣。 今岁戊寅，懒云氏游寓娄工工次，悟而出录，以待赠夫有缘者。 爰复续识数语于段末云。 戒忌须知第十 行不由人。 泥丸氏曰：“行不由人者，非安分之志，乃好奇务异之徒，王难或幸免，天律必难容，故律有之，偶而一犯，罚滞三载，恶其性喜隐僻，不由中道流祸至烈，故重罚不稍宥焉，可不戒哉。 ” 太虚翁曰：“我师所言，真实不虚者。 古之隐士，住世忘年，载之册籍，炳炳可考者千有余人。 今反混迹尘环，或为荒寺收供僧，或与褴褛乞丐伍。 最上者，匿迹峨嵋，鸡足太华，劳黄诸山至僻处，豺狼为侣，趺坐数百春秋，叶落没躯，荆榛塞径，惟恐人知，是皆汉魏六朝唐宋元明之大术士也。 昔日显异迹多者，其罚滞也无岁月。 我实知之，我实见之，不忍白其名姓焉而已。",
      "translated_text": "Eleven days later, the Elder of Great Emptiness indeed departed this world.\n\nThis year, the *wuyin* year, Lazy Cloud, wandering as a guest, found himself at the Lougong work site. Awakened, he transcribed these records to bestow upon those of karmic affinity. He appended a few more lines at the end of the passage, saying:\n\n**Tenth: Prohibitions and Taboos One Must Know**\n*To act without following others.*\n\nThe Master of the Mud-Pill Palace said: “To act without following others is not the resolve of one content with their lot, but the conduct of those who delight in novelty and pursue the strange. Though they may escape the calamities of kings by chance, the laws of Heaven will surely not tolerate them. Thus, the statutes decree: even a single transgression incurs a three-year penalty of stagnation. This is because their nature delights in seclusion and perversity, refusing the middle path, and the disasters they bring are most severe. Hence, the punishment is heavy and no leniency is granted. How can one not take heed?”\n\nThe Elder of Great Emptiness said: “What my teacher has spoken is true and not false. The recluses of antiquity lived in the world yet forgot the years; their names are recorded in the annals, shining brightly for all to see—over a thousand of them. Yet today, they mingle unseen among the dusty world, some as monks sustained by desolate temples, others as companions to tattered beggars. The most exalted hide their traces on Mount Emei, Cock’s Foot Peak, Mount Taihua, or the most remote corners of the Zhongnan Mountains, where jackals and wolves are their only company. They sit in meditation for hundreds of springs and autumns, their bodies buried beneath fallen leaves, thorny brambles choking the paths, fearing nothing so much as being known. These are the great adepts of the Han, Wei, Six Dynasties, Tang, Song, Yuan, and Ming.\n\nThose who once displayed many wondrous signs—how boundless were their years of stagnation and penalty! I know this to be true, I have seen it with my own eyes. Yet I cannot bear to reveal their names.”",
      "overlap_context": "e, to practice without diligence, to be diligent yet inconsistent—all are forms of disdain. Failing to achieve the Dao in life, on such-and-such a day (the original text reads: the full moon of the tenth month in the *bingwu* year of the Qianlong reign), the Master of Indifference (Indifference being the name of his studio, the *Indifferent Realm* of Kaihua Monastery in She Village, Gui’an County, where the Elder of Great Emptiness ascended) charged this upon me. Recorded by Lazy Cloud.”*\n\nAlas!",
      "start_char": 5474,
      "end_char": 5800,
      "start_sentence": 246,
      "end_sentence": 258,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.781074523925781,
      "metadata": {
        "source_file": "dao\\藏外\\天仙道戒忌须知.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "我恐世之有志者，迷而悮用，其自害也不浅，故不吝为人一饶舌。 志士切戒之也可，慎毋行不由人是嘱。 ” 尔时，海留翁侍曰：“神通法术，乃驻世真人藉以积功累行者，册籍载之详矣。 夫子戒之，岂以书载不足尽信欤，抑寓有深意而故辟之极欤”？ 太虚翁曰：“汝迷不足以语此，虽然，不为汝说，贻误后人。 汝见翼卵而成雏者否？ 曰见。 曰见形未全而预有出彀者否？ 曰未之见。 曰卵之变化有其道，变化成形有其理，形成破彀有其时，未有时未至而得变化，时未变化而得形成，时未形坚而得破壳者。 强而致之出，未化未形者死，形成未坚者萎，形坚时未至者病。 我昔所言，盖已形成而坚如者，特时未至一流，故其患也仅如此。 然已病甚矣！ 吁！",
      "translated_text": "I fear that those in the world with aspirations may become deluded and misuse these arts, bringing no small harm upon themselves—thus I do not hesitate to speak at length for their sake. Let the determined take heed: be cautious, and never act against the natural course of things.”\n\nAt that moment, the Elder of Sea Remnant interjected, “Divine powers and magical arts are what perfected beings of this world rely upon to accumulate merit and cultivate conduct—this is recorded in detail in the annals. Master, do you caution against them because the written records are not entirely trustworthy, or is there a deeper meaning in your extreme admonition?”\n\nThe Elder of Great Emptiness replied, “You are too confused to grasp this, yet if I do not explain, I risk misleading those who come after. Have you seen an egg hatch into a chick?”\n\n“Yes,” he answered.\n\n“Have you seen one whose form is incomplete yet prematurely breaks free from its shell?”\n\n“I have not.”\n\n“The transformation of an egg follows its own Dao; the completion of its form follows its own principle; the breaking of the shell comes at its proper time. If the time is not yet ripe and one forces change, or if the time for change has not come and one forces formation, or if the form is not yet firm and one forces the breaking of the shell—those not yet transformed will die, those not yet fully formed will wither, and those whose time has not come will fall ill. What I spoke of earlier concerns those whose forms are already complete and firm, yet whose time has not yet arrived—thus their suffering is no more than this. Yet even so, their affliction is already grave! Alas!”",
      "overlap_context": "d wolves are their only company. They sit in meditation for hundreds of springs and autumns, their bodies buried beneath fallen leaves, thorny brambles choking the paths, fearing nothing so much as being known. These are the great adepts of the Han, Wei, Six Dynasties, Tang, Song, Yuan, and Ming.\n\nThose who once displayed many wondrous signs—how boundless were their years of stagnation and penalty! I know this to be true, I have seen it with my own eyes. Yet I cannot bear to reveal their names.”",
      "start_char": 5800,
      "end_char": 6091,
      "start_sentence": 259,
      "end_sentence": 273,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.453679323196411,
      "metadata": {
        "source_file": "dao\\藏外\\天仙道戒忌须知.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "雏之一物，凡物也，自无而化有者，养至形成，其功已竣，而天破人破，其损其益犹如此。 若夫吾道，仙道也。 自有化无，炼实还虚，拨妄返真，摄性归性，炼阴成阳。 种种修诀，不舍色身，不着色身，活活泼泼，混混穆穆，若存若亡，精精纯纯。 不以五脏六腑为五脏六腑，不以四肢百骸为四肢百骸。 视惟存有圆陀陀，光烁烁。 始成水月境界，次成黄金沙世，终成红紫净境。 卒忽现境缩小，如米如粟，我则以真意摄入玄关，如磁吸铁，透入玄胎，乃为安灵入圣之妙用，不假丝毫杂气，与我身中未经历炼之凡精凡气凡神半缕混入者也。 方其玄关初辟，一杂用显异秘宗，我胎未结，真炁甚微，真灵虽备，而尘敝尤坚，光明无几。 显异秘宗，乃是真灵率彼识神，统我凡气外合地天罡杀生气以行事者。 其灵异在假天帝之号令。 是以地天之气，莫不来合。 然其来合者，莫非六天魔王，上遵帝令，敕其魔气，会合而来。 中我畏正佯驯之神，其心未正，既遵号召而致，自必如令而承行者。 故其行也，必灵必验。 要知行法之士，功夫未淳，真炁未足，真灵尚微，心性未圆，妄念犹炽，是以有此妄炼，无非妄有好胜好名，贪灵希异，与夫欲速尝试之痴心也。 彼诸魔神，鉴之熟矣，因而诱我内魔，朋比纂踞我躯，彼诸学者，亦不自觉，心已着魔，从此肆行无忌，而法益灵异，反谓昔修咸错，因而自误误人，必然之势。 倘渠道根深厚，待遇至人从而喝醒，复反真道，勇猛修持，亦得胎圆胎出。 而于粉粹了当一着，百千年久，有不得而行者。 何以故？",
      "translated_text": "The chick, like all things, transforms from non-being into being, nurtured until its form is complete—its task already fulfilled. Yet whether broken by heaven or by man, the harm or benefit remains as such.\n\nNow, our Dao is the Dao of immortality. From being it transforms into non-being, refining the solid to return to the void, dispelling delusion to revert to truth, gathering the nature to return to its source, transmuting yin to become yang. Through myriad practices and secrets, one neither abandons nor clings to the physical form, living freely and purely, serene and undisturbed, neither fully present nor entirely absent, utterly refined and unadulterated. One no longer regards the five viscera and six bowels as mere viscera and bowels, nor the four limbs and hundred bones as mere limbs and bones. In vision, only a perfect, radiant sphere remains—first forming the realm of water and moon, then the world of golden sands, and finally the realm of crimson and violet purity.\n\nSuddenly, the manifested realm contracts, shrinking to the size of a grain of rice or millet. I then gather it with true intent, drawing it into the Mysterious Pass as a magnet draws iron, penetrating the Mysterious Womb. This is the wondrous function of settling the spirit and entering sagehood, allowing not a trace of impure qi or the slightest mingling of unrefined ordinary essence, qi, or spirit from my body.\n\nWhen the Mysterious Pass first opens, a single impure practice reveals the esoteric and arcane. My immortal embryo is not yet formed, true qi is still faint, and though the true spirit is complete, the defilements of the mundane remain stubborn, with little radiance to be found. This esoteric and arcane practice is when the true spirit commands the consciousness, marshaling my ordinary qi to externally align with the celestial and terrestrial *killing qi* of the Big Dipper to perform deeds. Its numinous efficacy lies in borrowing the authority of the Celestial Emperor, so that the qi of heaven and earth cannot but converge. Yet those who come to converge are none other than the Six Heavenly Demon Kings, who, obeying the Emperor’s decree, dispatch their demonic qi to assemble. Within me, the spirits that feign obedience while fearing righteousness—whose hearts are not yet rectified—heed the summons and inevitably comply. Thus, their actions are invariably efficacious and verified.\n\nIt must be understood that those who practice such methods have not yet attained profound cultivation, their true qi is insufficient, their true spirit still faint, their mind and nature not yet perfected, and their deluded thoughts still ablaze. Thus, this reckless refinement arises from nothing more than vain desires for superiority, fame, marvels, and wonders, or the foolish impatience to test and taste. Those demonic spirits know this all too well, and so they entice the inner demons to band together and seize control of my body. The practitioners, unaware, have already fallen prey to demonic possession. From then on, they act without restraint, and the more their methods grow in numinous efficacy, the more they believe their past cultivation was mistaken. Thus, they deceive themselves and others—an inevitable outcome.\n\nIf, however, their Dao-root is deep and robust, and they encounter a perfected one who awakens them with a shout, returning to the true Dao and cultivating with vigor, they may yet achieve the formation and emergence of the immortal embryo. Yet the final step of pulverizing and completing all—this single stroke—may remain unattainable for hundreds or thousands of years. Why is this so?",
      "overlap_context": " and one forces change, or if the time for change has not come and one forces formation, or if the form is not yet firm and one forces the breaking of the shell—those not yet transformed will die, those not yet fully formed will wither, and those whose time has not come will fall ill. What I spoke of earlier concerns those whose forms are already complete and firm, yet whose time has not yet arrived—thus their suffering is no more than this. Yet even so, their affliction is already grave! Alas!”",
      "start_char": 6091,
      "end_char": 6684,
      "start_sentence": 274,
      "end_sentence": 293,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 17.658477067947388,
      "metadata": {
        "source_file": "dao\\藏外\\天仙道戒忌须知.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "昔之妄业，积如山海，业消罪赦，天诏乃临，斯关始破，可不戒哉！ 海留要知内养一圆，功行自足，与造物者，一鼻呼吸，念动神应，神凝气护，如心使指，指无不应，而谓神通不巨乎？ 何藉乎法，何藉乎术哉？ 蔽而不之神蔽，而未之通者，凡情凡念耳！ 净其凡情凡念，而一策之，复之真，斯自神通矣。 ”海留翁悦。 懒云氏乃为笔之于书云。 （谢氏按：此篇中有多少内景，非笔墨可宣达，亦非拟议而可得者，如水月境界、黄金沙世、红紫净境等，玄理玄境次第井然，正天仙家之正印，不可忽视。 ） 戒忌须知第十一",
      "translated_text": "The karmic delusions of the past, accumulated like mountains and seas, must dissolve and sins be absolved before the celestial decree descends. Only then is this barrier broken—how can one not take heed!\n\nHailiu, you must understand: when inner cultivation reaches completion, merit and conduct become naturally sufficient. You breathe as one with the Creator, thoughts move and spirits respond, spirit congeals and qi guards—like the mind commanding the fingers, the fingers obey without fail. Could such numinous power not be vast? What need is there for methods? What need for techniques?\n\nThose who remain obscured and fail to attain the spirit’s clarity, who have yet to penetrate the Way, are but ordinary emotions and thoughts. Purify these ordinary emotions and thoughts, then direct them with singular resolve to return to the true—thus does numinous power arise of itself.\n\nThe Elder Hailiu rejoiced. Master Lanyun thereupon inscribed these words.\n\n(Afterword by Xie: This passage contains many inner visions beyond the reach of brush and ink, beyond the grasp of conjecture—realms such as the Moon-in-Water, the World of Golden Sand, the Crimson-Purple Realm of Purity. The profound principles and states unfold in perfect order, serving as the true seal of the celestial immortals. This must not be overlooked.)\n\n**Cautions and Prohibitions, Chapter Eleven**",
      "overlap_context": "y believe their past cultivation was mistaken. Thus, they deceive themselves and others—an inevitable outcome.\n\nIf, however, their Dao-root is deep and robust, and they encounter a perfected one who awakens them with a shout, returning to the true Dao and cultivating with vigor, they may yet achieve the formation and emergence of the immortal embryo. Yet the final step of pulverizing and completing all—this single stroke—may remain unattainable for hundreds or thousands of years. Why is this so?",
      "start_char": 6684,
      "end_char": 6917,
      "start_sentence": 294,
      "end_sentence": 303,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.69971489906311,
      "metadata": {
        "source_file": "dao\\藏外\\天仙道戒忌须知.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "耽于闲逸。 泥丸氏曰：“耽于闲逸者，非志士，并非自度者可比，大可哀也，圣人复起，亦难策而致道，其身纯阴，盖炼有不胜其炼者，呜呼，余复何言。 ” 太虚翁曰：“慈哉，我师不屑教诲者，正以深诲之也。 若辈性静者，其病在懒，似达非达，似知足而不知足。 乃才短一流，混迹于玄门中，其用心也苦矣〈谢氏按：读书致此，不禁汗颜〉。 我师心甚怜之，故加棒喝。 世之纳身于枯木环堂者，此辈比比云。 我谓此辈特昧夫修诀耳！ 知置身于烦恼场而一守其闲逸之趣，兼能刻省得失，便是大善知识，久而群知其养，则又移置无知之地。 以考此趣之得失，内悉克养于中，以间安勉，孰谓非得天仙之大蹊径乎。 何以故？ 既皈玄门，慎毋虚过光阴。 若欲于恬静处终其天年，我诀其终此百千生。 而此闲逸之趣，万无定得者，此正我师棒喝之旨夫。 噫！ 既无其才，又无其力，勉欲精勤，病必随之，不如就其才料而纳之造就之窠。 此即鸟鹄异质，各有受炼之秘存乎其中。 人不虚生，是人总可得道，幸自弃自嘱。 ” 戒忌须知十二",
      "translated_text": "Indulgence in idleness.\n\nMaster Niwan said: \"Those who indulge in idleness are no true aspirants, nor can they be compared to those who seek self-cultivation. How lamentable! Even if the sages were to return, they could scarcely guide such men toward the Dao. Their bodies are purely yin, for their refinement is ever outstripped by their indolence. Alas, what more can I say?\"\n\nElder Taixu said: \"How compassionate! That my master disdains to instruct them is itself the deepest teaching. Those of a placid nature suffer from sloth—they seem enlightened yet remain unenlightened, appear content yet know no true contentment. Such mediocrities, with their meager talents, mingle among the gates of the mysterious. Their efforts are truly pitiable.\" (Xie’s note: Reading this, I cannot help but break into a cold sweat.)\n\n\"My master pities them deeply, hence his sharp admonitions. Those who immure themselves in withered trees and empty halls are legion. I say such men merely fail to grasp the secrets of practice! To knowingly place oneself amid the arena of afflictions while clinging to idle ease, yet still scrutinize gains and losses with care—this is the mark of a great spiritual friend. Over time, as others recognize their cultivation, they may yet be moved from ignorance to wisdom. By examining the merits and flaws of this disposition, refining the inner self through diligent effort, who is to say this is not the grand thoroughfare to celestial immortality?\n\nWhy is this so? Once you have entered the gates of the mysterious, take care not to squander your days in vain. If you wish to spend your years in tranquil repose, my judgment is that you will fritter away hundreds and thousands of lifetimes. As for this idle ease, it is never truly attainable—this is precisely the intent behind my master’s sharp rebuke!\n\nAlas! Lacking both talent and strength, yet straining to be diligent, illness will surely follow. Better to work within one’s capacity and mold it into a vessel of accomplishment. Just as birds and swans differ in nature, each possesses its own secret path of refinement. No one is born in vain—all may attain the Dao. Do not abandon yourselves to fate!\"\n\n**Cautions and Prohibitions, Chapter Twelve**",
      "overlap_context": "e of itself.\n\nThe Elder Hailiu rejoiced. Master Lanyun thereupon inscribed these words.\n\n(Afterword by Xie: This passage contains many inner visions beyond the reach of brush and ink, beyond the grasp of conjecture—realms such as the Moon-in-Water, the World of Golden Sand, the Crimson-Purple Realm of Purity. The profound principles and states unfold in perfect order, serving as the true seal of the celestial immortals. This must not be overlooked.)\n\n**Cautions and Prohibitions, Chapter Eleven**",
      "start_char": 6918,
      "end_char": 7337,
      "start_sentence": 304,
      "end_sentence": 324,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.686583042144775,
      "metadata": {
        "source_file": "dao\\藏外\\天仙道戒忌须知.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "致功克期。 泥丸氏曰：“致功可以克期者，一人之说，非通论也。 盖禀受不一，而愚智有殊。 克期而可致功，未有不因而致弊者。 ”太虚翁曰：“师言破的，饮水饮汤，冷暖自觉，师不得定之于弟，父不得定之于子，禀受有殊，智愚不一耳。 行适其当，不及其期而已足。 不得其当，虽过其期，行不中止。 曰七曰九者，老少之名目，并非致功之期克也。 左转三十六，右转三十六，是即半斤八两之说。 类此而推，无庸泥滞也。 譬如行路然，计弓准步而定里，成法则如此，由斯路者，行之而已，总以得到为宗。 奚必垫涂人而考其步数乎？ 步有大小，其数自殊，考步以计里，不亦惑乎！ 天仙之道，活泼泼者是，固非泥象执文者可与议斯道。 ”",
      "translated_text": "To achieve results within a set timeframe—Niwanshi said: \"That one may achieve results within a fixed period is but the claim of a single school, not a universal principle. For endowments vary, and the dull and the wise differ. To insist on achieving results by a deadline is to invite harm without exception.\"\n\nTaixu the Elder said: \"The master’s words strike the mark. Whether one drinks water or broth, one knows its warmth or chill for oneself—the master cannot dictate it to the disciple, nor the father to the son. Endowments differ, and the wise and dull are not the same. Proceed as is fitting, and even if the time is not yet come, it is enough. If the way is not fitting, though the time has passed, the practice does not cease. The numbers seven and nine are but labels for the old and young, not deadlines for achievement. Thirty-six turns to the left, thirty-six to the right—this is the same as saying six of one and half a dozen of the other. Extending this logic, one need not be rigidly bound. It is like traveling a road: one measures distance by paces and strides, and the method is thus established. For those who take this path, they simply walk it, with arrival as the ultimate aim. Why must one scrutinize the steps of those who tread the mud? Steps vary in size, and their counts differ—is it not delusion to calculate distance by counting steps?\n\nThe Way of Celestial Immortality is alive and fluid—it cannot be discussed by those who cling to rigid forms and fixed texts.\"",
      "overlap_context": " ease, it is never truly attainable—this is precisely the intent behind my master’s sharp rebuke!\n\nAlas! Lacking both talent and strength, yet straining to be diligent, illness will surely follow. Better to work within one’s capacity and mold it into a vessel of accomplishment. Just as birds and swans differ in nature, each possesses its own secret path of refinement. No one is born in vain—all may attain the Dao. Do not abandon yourselves to fate!\"\n\n**Cautions and Prohibitions, Chapter Twelve**",
      "start_char": 7338,
      "end_char": 7623,
      "start_sentence": 325,
      "end_sentence": 339,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.8546552658081055,
      "metadata": {
        "source_file": "dao\\藏外\\天仙道戒忌须知.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "戒忌须知第十三 净秽自画。 泥丸氏曰：“净秽在心，境不与焉，世之志士，迷而功阻者比比，大可笑也”。 太虚翁曰：“旨哉斯言，净秽在心，境不与焉，不易之论也。 滞境而画，食古不化之故。 要知净秽辟秽种种作用，盖即净面连心洗，焚香带性烧之义。 奈何有礼废吊而行避坟冢者！ 以为书载见尸四十九，终身不得道。 不知此说出于礼诵之门，而隐讽夫阴阳流，专以送死领葬为生计者，梦寐寝食于其间，穷其一身内外，无非死气焉，是诚乃无道成之量者。 然世之阴阳家，果能诚诵太玄玉经，且更能日诵心维，不惟此身清净，所过者化，所存者神，累行积功，孰有胜于此者？ 此之谓下结鬼缘，亦证得一助。 况心无生死轮回乎！ 吁，生死且无，何有净秽？ 惟礼诵一门，理宜内外精洁，稍懈非所以致我敬，是以有焚香设供之仪，沐浴更衣之事。 若夫修养一宗，纯存贞一，天仙一道，寂浩无涯，均无凶秽得触之虞，庸何忌焉。 然苟无其道，而心有感之，则诀有退持太玄玉经，存放慈光，若月若日，照耀金庭，虽有感触，亦无弊焉。 万无有因而自画，必待七终，乃始往吊，致废大礼。 亦万物因往而自画进修之功。 此我师揭此一则以示人慈旨云。 ”",
      "translated_text": "**Chapter Thirteen: Essential Prohibitions and Taboos**\n*Self-Imposed Boundaries of Purity and Defilement*\n\nMaster Niwan states: “Purity and defilement reside in the heart; external circumstances have no part in them. Yet among those of this world who aspire to the Dao, many falter and fail due to such delusion—how laughable indeed.”\n\nMaster Taixu remarks: “Profound are these words! ‘Purity and defilement reside in the heart; external circumstances have no part in them’—this is an immutable truth. To fixate on external conditions and draw boundaries is but the folly of those who consume antiquity without digesting it. Know this: all acts of purifying, expelling defilement, and the like—whether washing the face to cleanse the heart or burning incense to refine the nature—are of this principle.\n\nYet how absurd are those who, abandoning rites of mourning, go out of their way to avoid graves! They claim that scriptures warn that seeing a corpse within forty-nine days bars one from attaining the Dao. Little do they realize this teaching originates from the school of *li song*—a veiled critique of those who traffic in yin and yang, making a livelihood of funerals and burials, dwelling day and night amid such affairs, their entire lives steeped in the stench of death. Truly, such people lack the capacity to achieve the Dao.\n\nHowever, if practitioners of yin-yang arts were to sincerely recite the *Tai Xuan Jade Classic*, and further, to daily contemplate the mind’s essence, not only would their own bodies become pure, but all they encounter would transform, and what they preserve would become spirit. What greater merit could surpass this? This is what is meant by ‘forging ghostly affinities below’—it too yields a measure of attainment.\n\nMoreover, if the heart transcends the cycle of birth and death, what place remains for purity or defilement? Alas, since birth and death are no more, how can purity or defilement exist?\n\nNow, the school of *li song* rightly demands inner and outer refinement; the slightest laxity undermines reverence. Hence the rites of burning incense and offering sacrifices, the practices of bathing and changing garments. But for those who cultivate the Dao, who abide in undivided integrity, who tread the path of Celestial Immortality—vast and boundless as the void—what fear is there of inauspicious defilement? What taboo could possibly apply?\n\nYet if one lacks the Dao and feels affected by such things, there is a method: recite the *Tai Xuan Jade Classic* while holding the secret, and visualize the radiance of compassion—like the sun or moon—illuminating the Golden Court. Even if affected, no harm shall come.\n\nNever should one, out of self-imposed restrictions, wait until the seven-week mourning period concludes before paying respects, thereby neglecting great rites. Nor should external factors obstruct one’s progress in cultivation.\n\nThis is the merciful teaching our master has revealed to guide others.”",
      "overlap_context": "gidly bound. It is like traveling a road: one measures distance by paces and strides, and the method is thus established. For those who take this path, they simply walk it, with arrival as the ultimate aim. Why must one scrutinize the steps of those who tread the mud? Steps vary in size, and their counts differ—is it not delusion to calculate distance by counting steps?\n\nThe Way of Celestial Immortality is alive and fluid—it cannot be discussed by those who cling to rigid forms and fixed texts.\"",
      "start_char": 7624,
      "end_char": 8099,
      "start_sentence": 340,
      "end_sentence": 359,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 145.2359082698822,
      "metadata": {
        "source_file": "dao\\藏外\\天仙道戒忌须知.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "戒忌须知第十四 泥古律今。 泥丸氏曰：“时移世变，气运使然，泥古律今者，徒知好古，食而不化者也。 不可以不戒”。 太虚翁曰：“然古法不行于世也久矣。 即如传道一种，情有不可得而古法者，然而知之者鲜矣。 昔于某地，传某以某道，仪礼均未具，而受授竣。 有某者起而责曰：‘某道传自某祖，得自某师，仪若彼，礼若此何其重也，今某传某，若此简，若此亵。 可乎？ ’某欲辨而未得，迄今传为话柄。 呜呼，彼之责者，亦是也。 然彼也者，乌知夫今昔情殊也哉。 经曰：礼云礼云，玉帛去乎哉。 古哲之重夫仪文者，正以下受之诚与否耳。 今则不然，计仪以受授，将以召彼，而群凝哉，且将因仪而谤道焉。 呜呼，可知某之不计仪而受授，是崇道，非慢道也。 即此以律泥古今，殆有不可不戒者矣。 吁！ 天下滔滔，泥古且未真，洞而审之，类皆假古以律今者，其心其行，更有不可问焉者矣。 〈谢氏按：愚知今时虽值科技倡明时代，但授法传功时，泥古律今，要人登坛盟誓者大有人在，反使学人徒生反感，未能崇道，反而谤生。 很多学人致函鄙处，痛斥其非，故鄙深知泥古律今之害，愿同仁共省〉。 戒忌须知第十五 身心意任。 泥丸氏曰：“以三逆任者仙，以三殉任者人，故以身心意任为戒”。 太虚翁曰：“玄哉师说！ 身心意者，谓之气精神也可，谓之天地水也可，盖其内蕴有是理。 故精乃心之所出，神乃意之所有，气乃身之所载，其实心以主之。 以三逆任者，盖能以心制意，以意制身，以身定志，以志定神，以神定气，相制相定，欲净理纯，纯一不二，则仙之道也。 以三殉任者，盖但心任意，以身殉意，以意殉心，相殉相任，欲炽理灭，千态万状，则人之道也。 噫！ 要知天仙一道，以逆为用者，天地定位也，地天乃泰。 他若水火木金，有相媾相交之妙，而水土亦有和洽之功。 类而推之，无不以逆为用者，以我师之所以谆谆告诫也欤”。 戒忌须知第十六 礼仪荒忽。 泥丸氏曰：“是可即外以证内，正是止敬存诚一功之现于内外者也，何可荒忽。 志士犯此，必坠魔道，可不戒哉！ 是昧夫足恭之一说耳”。 太虚翁曰：“犯此戒者，大都似达非达一流。 盖此辈夙修乏福，而薄有才智，沧落不偶，识者鲜焉。 致恭致敬，人之不答，更有从而笑之者，遂渐大反其行止。 又遇好事者从而推奖之，曰：‘某也材，’古之狂狷无以为过之。 世之无知者从而附和之，因美其名曰解脱，能恬淡，能狐高，相赞相成。 风闻夫无闻志士之耳，遂亦遥遥应染焉。 此末世群以礼仪荒忽为存本色之因也。 夫学者诚宜戒之！ 否则必坠流我慢魔道，可不戒哉。 第当内外如一，又当如分而止。 故凡身处尊贵之阶，礼宜持夫忘分之礼； 身处卑幼之序，则但尽夫弟子之仪。 若于同僚酬应之际，礼文无失，当而已矣。 夫我道，天仙之大道，不避人，不逃世者，酬酢不得而缺。 鼓钟于宫，声闻如外，慎毋使彼四方君子，闻所闻来，见所见去。 况天仙家，乃寓火候于行止坐卧间者，何可忽忽诸。 若遇当坐而谈者，则有载谈载坐之行诀。 步而谈者，又有载谈载步之行诀。 立而谈者，又有载谈载立之行诀。 人坐亦坐，人起亦起，人立亦立，人步亦步。",
      "translated_text": "**Cautionary Precepts to Know, Fourteenth: Clinging to the Ancient While Binding the Present**\n\nMaster Niwan said: “As times shift and the world changes, so too does the qi’s movement compel it. Those who cling to the ancient while binding the present know only how to cherish antiquity but fail to digest its essence. This must be guarded against.”\n\nMaster Taixu said: “Indeed, the ways of old have long ceased to function in the world. Take, for instance, the transmission of the Dao—there are circumstances where ancient methods cannot be applied, yet few understand this. Once, in a certain place, a certain master transmitted a certain Dao to a disciple. The rites and ceremonies were not fully observed, yet the transmission was completed. Another arose to reproach them, saying: ‘This Dao was passed down from such-and-such an ancestor, received from such-and-such a teacher. The rites were thus, the ceremonies so—how weighty they were! Yet now, this master transmits to this disciple in such a simplified, even irreverent manner. How can this be?’ The master wished to explain but could not, and to this day, the matter remains a subject of gossip.\n\nAlas! The reproach was not without reason. Yet how could the critic know that the circumstances of past and present differ? The Classic says: ‘Rites, rites—are jade and silk all there is to them?’ The ancient sages valued ritual forms precisely to gauge the sincerity of the recipient’s devotion. Today, however, it is otherwise. If one calculates the rites to determine the transmission, one will only summon contention and stagnation. Moreover, one may even slander the Dao because of the rites.\n\nAlas! It should be known that the master’s disregard for ritual in transmission was an act of revering the Dao, not disrespecting it. Applying this principle to the matter of clinging to the ancient while binding the present, there is indeed much that must be guarded against.\n\nAlas! The world rushes on—those who cling to antiquity do not truly understand it. Examining closely, most who invoke the past to bind the present do so falsely. Their hearts and conduct are even more unworthy of inquiry.”\n\n*(Xie’s Note: Though we now live in an era where science and technology flourish, when transmitting methods or imparting cultivation techniques, there are still many who rigidly adhere to ancient forms, demanding that disciples ascend altars and swear oaths. This only breeds resentment among learners, failing to inspire reverence for the Dao and instead provoking slander. Many practitioners have written to me, vehemently condemning such practices. Thus, I deeply understand the harm of clinging to the ancient while binding the present and urge fellow cultivators to reflect.)*\n\n---\n\n**Cautionary Precepts to Know, Fifteenth: The Body, Mind, and Intent**\n\nMaster Niwan said: “Those who master the three through reversal attain immortality; those who submit the three to pursuit remain bound to the human realm. Thus, one must guard against letting the body, mind, and intent follow their own course.”\n\nMaster Taixu said: “Profound are the master’s words! The body, mind, and intent may be called qi, spirit, and essence—or Heaven, Earth, and Water—for they contain this principle within. Thus, essence arises from the mind, spirit is possessed by intent, and qi is borne by the body, yet in truth, the mind governs all.\n\nTo master the three through reversal means to use the mind to govern intent, intent to govern the body, the body to stabilize resolve, resolve to stabilize spirit, and spirit to stabilize qi. Through mutual governance and stabilization, desires are purified, principles are refined, and unity is achieved—this is the Dao of immortality.\n\nTo submit the three to pursuit means only to let the mind follow intent, the body submit to intent, and intent submit to the mind. Through mutual submission and pursuit, desires flare while principles perish, giving rise to a thousand postures and ten thousand forms—this is the way of the human realm.\n\nAlas! One must understand that the Dao of Celestial Immortality employs reversal as its function, just as Heaven and Earth take their positions—only then is there harmony. Even Water and Fire, Wood and Metal possess the marvel of mutual union, while Water and Earth share the merit of harmony. Extending this principle, all things employ reversal as their function. This is why our master so earnestly admonishes us.”\n\n---\n\n**Cautionary Precepts to Know, Sixteenth: Neglect of Ritual and Etiquette**\n\nMaster Niwan said: “This can be seen outwardly as proof of inner cultivation—it is precisely the manifestation of reverence, sincerity, and devotion in both inner and outer realms. How can one afford to neglect it? A determined cultivator who violates this will surely fall into demonic paths. Must one not be guarded against it? This is not the same as the misguided notion of ‘excessive deference.’”\n\nMaster Taixu said: “Those who violate this precept are mostly of the sort who appear enlightened but are not. Such individuals have cultivated little merit in past lives and possess only meager talent and intelligence. Having met with misfortune and failed to find their place, they are rarely understood. When they offer reverence and respect, others do not reciprocate; some even mock them. Gradually, they reverse their conduct entirely. Then, meddlesome admirers praise them, saying: ‘So-and-so is truly talented—even the ancient recluses and eccentrics could not surpass them!’ The ignorant of the world echo this praise, bestowing upon them the fine names of ‘liberation,’ ‘serene detachment,’ and ‘aloof nobility,’ mutually reinforcing one another. Word of this reaches the ears of unworldly cultivators, who then imitate them from afar. This is how, in this degenerate age, the neglect of ritual and etiquette has become a pretext for preserving one’s ‘true nature.’\n\nLearners must indeed guard against this! Otherwise, they will surely fall into the demonic path of arrogant self-indulgence. One must be consistent in both inner and outer conduct, yet also know when to stop according to one’s station.\n\nThus, when occupying a position of honor, one should observe the rites of forgetting rank; when in a humble or junior position, one should fulfill the duties of a disciple. In interactions with peers, one should ensure that ritual propriety is not lacking—this is sufficient.\n\nOur Dao is the great Dao of Celestial Immortality. It does not shun people nor flee the world, so social interactions cannot be neglected. When bells and drums resound within the palace, their echoes reach beyond. Take care that the noble gentlemen of the four directions, upon hearing and seeing, do not depart with unfavorable impressions.\n\nMoreover, the Celestial Immortal’s practice is to embed the firing times within one’s movements, whether sitting, standing, or walking—how can one be careless? When one should sit while conversing, there are methods for sitting while talking. When walking while conversing, there are methods for walking while talking. When standing while conversing, there are methods for standing while talking. If others sit, one sits; if they rise, one rises; if they stand, one stands; if they walk, one walks.”",
      "overlap_context": "ethod: recite the *Tai Xuan Jade Classic* while holding the secret, and visualize the radiance of compassion—like the sun or moon—illuminating the Golden Court. Even if affected, no harm shall come.\n\nNever should one, out of self-imposed restrictions, wait until the seven-week mourning period concludes before paying respects, thereby neglecting great rites. Nor should external factors obstruct one’s progress in cultivation.\n\nThis is the merciful teaching our master has revealed to guide others.”",
      "start_char": 8100,
      "end_char": 9328,
      "start_sentence": 360,
      "end_sentence": 417,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.91684865951538,
      "metadata": {
        "source_file": "dao\\藏外\\天仙道戒忌须知.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "周旋拜礼，莫不有微细妙诀存乎其中。 大可随地随时，行我功诀，炼我炁精。 更可详验我行功之安勉。 岂慢行酬酢之仪文于外，而无我内治之神功哉。 是以天仙一戒律有三千八百之多之微细条目也。 盖心愈静而愈而圆，有不待存注而无不中规中矩之妙。 然须于平时细微体认而体行之，则当场酬应之际，自不厌其礼文之繁索矣。 故古之志士必于家庭间，随时随处不废其起起立立坐坐步步之仪文者，正以炼其起起坐坐行行立立之功诀也。 一旦应对而出，或事上，或接平，或临下，自然周致而合度合诀焉。 大隐朝市，此说何谓乎。 今则不然，以为家无常体，而惰其百骸四肢焉。 不知家无常体之说，言不惟晨昏定省而已。 凡彼巨细仪文，一一必使其内外如一，而无偏胜之弊，故曰无常礼焉。 夫子申申如，夭夭如，正是于闲居燕处，时而行其体认之妙用。 第可以意会不可言传。 慎毋误以为闲居燕处而稍忽其自然止敬之功为要。 记有之，时思尽忠，退思补过，岂仅专指夫政事焉而已哉。 要知政事之得失，不出乎一心。 行止坐起，知有安驻其神之诀，则神驻于身，而不飞焉他注矣。 出面立朝，则理事自明，决政有当，应对自和，进退自正。 一切周旋酬酢，谦适于谨，恭适于安，让适于宜，辨适于达，论适于畅，行适于正，操适于真。 盖我天仙之道，穷则独善其身，达则兼善天下； 存则圣贤，化则仙佛。 无非终始于心一功，而造夫大而化，犹不自住焉，乃为天仙之学。 孰谓可以礼仪荒忽也哉！ 彼此礼仪为礼仪，则具文矣。 外恭敬而内怠，慢犹荒忽也，不可不以为切戒者，二三子识之。 〈谢氏按：行住坐起，旨在内安其神，所谓诸于内而形于外。 自然，内安而外恭，内和而外敬，仪礼得矣。 然内安其神之诀如何？ 诸同志不妨参阅动静有间一则，必心领神会矣，何须在下赘言乎！ >",
      "translated_text": "In all the circling and bowing of ritual exchanges, subtle and wondrous secrets reside within. One may practice the oral formulas of one’s art and refine one’s essence and qi at any place and time, while also carefully examining whether one’s practice is relaxed or strained. How could one carelessly perform the outward forms of social courtesy while neglecting the inner cultivation of divine skill? Thus, the precepts of the Celestial Immortal number as many as three thousand eight hundred, each a fine and detailed injunction.\n\nFor the more still the mind becomes, the more perfectly round it grows, attaining the marvel of effortlessly conforming to every rule without need for conscious attention. Yet one must, in ordinary times, minutely observe and embody these principles, so that when the moment of social engagement arrives, one will not find the rituals burdensome. Therefore, the determined scholars of old never neglected the forms of rising, standing, sitting, and walking in their households at all times, precisely to refine the oral formulas of rising, standing, sitting, and walking. When they emerged to engage with others—whether serving superiors, interacting as equals, or facing subordinates—they naturally achieved perfect harmony with the proper measures and secrets.\n\nThis is what is meant by “the great hermit in the marketplace.” Today, however, people assume that the household has no fixed norms and thus grow lax in their limbs and posture. They do not realize that the saying “the household has no fixed norms” does not refer merely to morning and evening duties. Rather, every great and small ritual must be made consistent within and without, free from any imbalance, hence the term “no fixed ritual.” Confucius’ appearance—calm and joyful—was precisely the subtle application of this embodied awareness in moments of leisure and repose. It can be grasped in the mind but not conveyed in words. Take care not to mistake leisure and repose as an excuse to neglect the essential work of natural reverence.\n\nAs the Record says: “At all times, think of fulfilling loyalty; in retreat, think of correcting faults.” This does not refer solely to matters of governance. Know that the success or failure of governance arises from the single mind. In all actions—moving, stopping, sitting, rising—if one knows the secret of settling the spirit, then the spirit will abide in the body and not fly off elsewhere. When one stands in court, matters will be naturally clear, decisions sound, responses harmonious, and conduct upright. In all exchanges and courtesies, humility will be fittingly modest, reverence fittingly composed, deference fittingly proper, eloquence fittingly lucid, discourse fittingly fluent, conduct fittingly correct, and integrity fittingly genuine.\n\nFor the Dao of the Celestial Immortal is this: in obscurity, one perfects oneself alone; in prominence, one benefits all under heaven. In stillness, one becomes a sage; in transformation, one becomes an immortal or buddha. All this begins and ends with the single work of the mind, culminating in a great transformation that does not cling even to itself—this is the learning of the Celestial Immortal. Who could say that ritual propriety may be neglected?\n\nIf ritual is performed merely as ritual, it becomes empty form. Outward reverence with inner laxity is still negligence—this must be taken as a strict warning, my disciples, take heed.\n\n*(Xie’s note: In movement, stillness, sitting, and rising, the aim is to settle the spirit within, for what is within naturally manifests without. Thus, inner calm produces outward reverence, inner harmony produces outward respect, and ritual propriety is achieved. But how does one settle the spirit within? Fellow practitioners may refer to the passage on “intervals between movement and stillness,” where they will surely grasp the meaning without need for further elaboration.)*",
      "overlap_context": "\nMoreover, the Celestial Immortal’s practice is to embed the firing times within one’s movements, whether sitting, standing, or walking—how can one be careless? When one should sit while conversing, there are methods for sitting while talking. When walking while conversing, there are methods for walking while talking. When standing while conversing, there are methods for standing while talking. If others sit, one sits; if they rise, one rises; if they stand, one stands; if they walk, one walks.”",
      "start_char": 9328,
      "end_char": 10028,
      "start_sentence": 418,
      "end_sentence": 449,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 18.91797375679016,
      "metadata": {
        "source_file": "dao\\藏外\\天仙道戒忌须知.txt",
        "category": "藏外"
      }
    }
  ]
}