{
  "source_id": "天仙道程宝则",
  "source_file": "chunked_daozang\\天仙道程宝则.json",
  "total_chunks": 4,
  "total_original_chars": 3137,
  "total_translated_chars": 16850,
  "total_translation_time": 85.24538588523865,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\天仙道程宝则.txt",
    "category": "藏外"
  },
  "full_translation": "**The Heavenly Immortal’s Precious Daoist Principles**\n\n**First Precious Principle:**\nIt is said: \"The naturally perfect and complete is the nature of my wondrous, luminous, and all-encompassing awakened heart. This single heart—Confucians embody it as the *Mean*, Buddhists as *Emptiness*, and our Dao as *Vacuity*. Li Boyang and Chen Cuixu embodied it through refining the body to attain the Dao. Vast without exterior, minute without interior, it encompasses the Three Realms with room to spare and contains a mustard seed without constraint. In a glance, it manifests instantly; even the hardest metal and stone cannot obstruct it. How much less can this mere clump of blood and flesh, which is fundamentally without barriers? The trouble lies only in people’s failure to cultivate and reflect.\n\nThus, the method lies solely in *all-encompassing awakening*. The practice of all-encompassing awakening begins with *washing the marrow*. When the marrow is cleansed, the heart becomes clear, and clarity naturally leads to awakening. The marrow is the heart of the Heavenly Heart—*shui* (water) is its essence, and its seat is in the brain. That which washes it is water, whose seat is in the kidneys. The *Cantong Qi* says: *'The true person abides in the deep abyss.'* The *Book of Changes* says: *'The hidden dragon does not act.'* The *Treatise on Dispelling Doubts in Immortal Cultivation* says: *'No thought within thought.'* These are all secrets of *han-shui* (containing water) and washing the marrow.\n\nAs for the seven emotions and six desires, the Three Corpses and Nine Worms, they arise from delusion and become delusion, born of delusive causes. Humans, transformed by postnatal qi, have no root, no foundation, no techniques, no divine powers. What are called techniques and divine powers are merely doubts, slander, and usurpations of authority—nothing more. Yet when confronted with the wondrous, luminous, all-encompassing *shui* of awakening, they vanish like shadows before light, retreating without a trace.\n\nThus, the method is to merge this illusory form and return it to the realm of *wu-he-you* (nothingness). Illuminate it, attend to it, empty it, still it, refine and temper it—then its essence becomes true. Alternatively, one may remain still like an army at rest, cultivating one’s civil virtue: nourishing with food and drink, instructing and guiding. Authority does not descend, and commands emerge naturally from *shui*. This is *concentrating spirit and gathering qi*, ensuring thoughts do not move recklessly, abiding in harmony, and illuminating even the subtlest. Over time, the host of yin forces are transformed, the nation prospers, the people are at peace, and the body is governed. Thus, in the cultivation of the body, the first precious principle is the perfect clarity of heart and nature.\"\n\n**Second Precious Principle: Upholding Precepts with Perfect Purity**\nNiyuan Shi says: \"When precepts are upheld with perfect purity, habitual karma dissolves, and the Four Great Elements become pure.\" Taixu Weng says: \"Know that the cycle of birth and death arises from habitual karma. If habitual karma is impure, seeking the supreme Dao is like trying to cook sand into rice—utterly impossible. Not only must one avoid defilements of lust, anger, greed, and delusion, but all things that obstruct the principles of body, mind, nature, and life must be preceptually avoided and kept unstained. Only then can it be called *upholding precepts with perfect purity*.\"\n\n**Third Precious Principle: Uninterrupted Diligence**\nNiyuan Shi says: \"With uninterrupted diligence, the field of nature is thoroughly cultivated, and there is no fear of leakage.\" Taixu Weng says: \"Know that the Three Fields lie long fallow, their brambles only recently cleared. The slightest negligence leads to interruption, and sprouts will grow uncontrollably. Within the body, inner demons lurk; outside, external demons entice. They lie in wait for gaps—this is inevitable.\n\nGenerally, human emotions may slacken after sudden gains or losses, or grow careless in moments of attainment before action. Without self-reflection, the harm is not small. Moreover, cultivating goodness is like climbing a mountain, while ingrained habits are deeply forged in the passions and desires. My master’s warning of *leakage* is all-encompassing—it does not refer merely to the leakage of essence.\n\nIf the eyes are not guarded, spirit leaks through the eyes; if the ears are not guarded, spirit leaks through the ears; if the mouth is not guarded, spirit leaks through the mouth; if the nose is not guarded, spirit leaks through the nose. As for the scattering of the heart, the agitation of essence, the chaos of intent, the dullness of spirit, the turbidity of qi, and the confusion of will—these are leakages bordering on *seepage*. Seepage occurs in states of unawareness, where defense is too late, like a leaking paddy field. Its harm seems slow but is swift, seems minor but is great. The wise guard against it; the foolish neglect it.\n\nThis principle, I note, corresponds to the *Treatise on Dispelling Doubts in Immortal Cultivation*’s warning against *discontinuity and lack of focus*. Though it appears to address the nature, it is in truth the daily sustenance of those who cultivate life. Thus, my master establishes this as the third precious principle of immortal cultivation.\"\n\n**Fourth Precious Principle: Following the Common Path**\nNiyuan Shi says: \"Following the common path, inner demons do not arise, outer demons are powerless, and the elixir path becomes smooth.\" Taixu Weng says: \"Know that this Dao—what Dao is it? It is the great Dao of returning to the root and restoring the source. Though vast, it is supremely ordinary, without contrivance, without strangeness. This is the Dao of Heavenly Immortals, possessed by all, perfected by each. Utterly firm, utterly empty, utterly numinous, utterly undifferentiated—seen yet invisible, heard yet inaudible. It embodies the myriad things without omission and contains the tiniest speck without constraint. If scholars cultivate it with such precision, their practice advances daily without the peril of competitive spirit or reckless flight, and they avoid the dangers of seeing and hearing.\n\nThus, my master says the elixir path is smooth. Alas, it is not that there is no seeing or hearing... Therefore, this is the fourth precious principle of immortal cultivation.\"\n\n**Fifth Precious Principle: Concentrating Qi to Attain Softness**\nNiyuan Shi says: \"Concentrating qi to attain softness ensures no confusion between prior and posterior, and the elixir path becomes pure.\" Taixu Weng says: \"Know that the qi of Heavenly Immortals is qi yet not qi—utterly empty, utterly pure, utterly refined, utterly numinous. Thus, it only ascends and does not abide in the sun.\"\n\n\"To concentrate qi means that if qi is not concentrated, spirit does not congeal and the fire does not flourish. If the fire does not flourish, essence and qi do not transform, and the postnatal remains coarse and turbid, unfit for the elixir’s rank. When the time comes to refine it, prior and posterior become intermixed, giving rise to the harm of meditative qi surging.\n\nI observe that scholars of this world often worry about the fire flourishing too much. I have cried out loudly and urgently, yet few awaken—is this not lamentable? The fault lies in their ignorance of the work of stabilization and quiescence, mistakenly employing the mundane fire of the postnatal. During the moment of union, the entire body feels unobstructed, vaguely resembling the act of conjugal union, and they misconstrue it as no different from ordinary coupling. In an instant, they experience whole-body numbness, trembling, and panting—ten times the sensation of ordinary union—and believe they have attained achievement. Little do they know they have stirred the ministerial fire, fanning it into a blaze that consumes their true essence and true qi, reducing them to mere objects of respiratory exchange. Those who practice this method invariably develop the complexion of a child—plump and lustrous. Yet when their fate is exhausted, they either perish with the inner flames of the elixir fire scorching their five viscera or contract the three wasting diseases, or even discharge several *hu* of essence before dying. In my few years, I have witnessed twenty-three such cases. Among them were those who severed desire, those who did not, those who kept many concubines, and those who borrowed the yang crucible—all able to derive pleasure without emission and boast of their success, never considering it a fault. Yet in the end, only one who severed desire met a good end, though he too ultimately died of the three wasting diseases. Is this not cause for fear?\n\nWhat our Dao calls union is the utmost harmony, so thoroughly unobstructed that one forgets the distinction between heaven, earth, self, and others, perceiving only the misty vapors of qi. There is not even the slightest sound or breath, let alone trembling. Should such sensations arise, the remedy lies solely in clarifying one’s resolve and placing this body in the realm of nothingness—no need to dwell on it. This too is a crucial admonition. Otherwise, what was meant to transform the postnatal will remain merely postnatal—how lamentable!\n\nMy master compiled *Concentrating Qi to Attain Softness* as the fifth precious principle of immortal cultivation for good reason.\n\n**Sixth Precious Principle: Unstained by a Single Speck of Dust**\nNiyuan Shi says: \"Unstained by a single speck of dust, breath and qi vanish, and the mysterious pass opens.\" Taixu Weng says: \"Know that if the qi of breathing is not absent, true qi does not appear. Only when true qi appears does the mysterious pass begin to open. Its opening may be real or illusory: that which opens from within is real; that which opens from without is illusory. There is also the case where it seems to open from without but actually opens from within—this too requires careful discernment. The key lies in the practice of forgetting and forgetting again; the pass will open of itself, and all will be genuine. As it is said, *unstained by a single speck of dust*, so too is the absence of stray thoughts evident. Only when thoughts are absent does the breath settle; only when the breath settles does the pass open—this is an immutable principle. Yet there are those who, through utter emptiness and stillness, attain opening at once. This is the qi cavity, not the cavity of qi. The qi cavity is where the ancestral qi naturally arises, and within it lies the qi cavity. When the qi cavity opens, the mysterious pass unfolds—this is one explanation, though few understand it. Alas, is this not why earthbound immortals outnumber celestial immortals? A hair’s breadth of error leads to a thousand miles of deviation.\"\n\nAs the saying goes: *\"To know the path beneath the mountain, ask one who has traversed it.\"* Without a teacher’s guidance, one may toil until old age and remain but a relic—how fortunate I am! Did not the master say: *If the qi cavity does not open, there is no gate for the fire to enter. If the qi cavity does not open, the sacred embryo cannot take form.* Forget and forget again, and the mysterious pass will unfold.\n\nThis is two yet not two, one yet not one—like a hen brooding over her eggs, unspeaking yet speaking. My master further said: *The method begins with unstained by a single speck of dust*, which is why cultivators of the Dao have enshrined this phrase as the Sixth Treasure. The Seventh Treasure states: *\"Concentrate the spirit and enter the cavity.\"*\n\nThe Master of the Mud Pill Palace said: *What is meant by concentration? First, direct the gaze to the point of focus, gently gather the true qi with intent, letting it coil and revolve. Then, lodge the harmonious qi within, and once forgetting is complete, withdraw the mechanism of the mind.* When the spirit is concentrated and enters the cavity, the qi cavity warms and the true fire blazes. With the true fire blazing, the pass opens, no demonic fluids can seep in, and the sacred embryo finds its chamber—thus the infant suffers no lack of nourishment.\n\nYet few comprehend this; it must not be spoken of to outsiders. The Elder of Great Emptiness said: *How compassionate is my master! Without the qi cavity, the elixir grows cold; without the yin essence, the embryo lacks its milk (this is true essence, not ordinary fluid. Ordinary fluid is transformed from mundane qi, and its seepage is to be avoided. True essence is transformed from true qi—this is jade fluid, though not yet golden fluid).*\n\n...As for Laozi’s *\"roaming the mind in the primal unity of things,\"* this is the secret of nurturing the embryo and settling the spirit—it is not the moment for stoking the fire. Bear this in mind, for my master designated *\"concentrate the spirit and enter the cavity\"* as the Seventh Treasure of Daoist cultivation, its subtlety profound indeed.\n\nThe Eighth Treasure states:\n\nThe Master of Mud-Pill Palace said: *\"Sitting upright to practice stabilization—this secret of gathering and refining was transmitted by the Elder of Emerald Emptiness. Alas, how the world reads it carelessly! If one chews and savors it, the essentials of Daoist cultivation, the knack of practice, the meaning of gathering, and the secret of reception are all fully contained within these four characters. How compassionate was the Elder of Emerald Emptiness! Even if the world reads it carelessly, a single phrase strikes the mark; follow it, and one may still attain the Dao.\"*\n\nThe Elder of Great Emptiness said: *\"Indeed. 'Upright' (端) harbors the meaning of aligning the six periods into oneness—does this not embody the essentials of the Dao? 'Sitting' (坐) harbors the meaning of both eyes adhering to the earth—does this not embody the knack of practice? 'Practice' (习) harbors the meaning of feathered movement and concealed yang—does this not embody the Way of gathering? 'Stabilization' (定) means stillness and immobility—does this not truly point to the secret of refinement?*\n\n*The Dao takes diligent cultivation as its essence; aligning the six periods into oneness embodies diligence. Cultivation takes single-mindedness as its knack; both eyes adhering to the earth harbors single-mindedness. The function of practice lies solely in this: 'feathered movement' and 'concealed yang' are the marvelous principles of nature, as well as its natural effects, requiring no forced effort. Without yang, yin stagnates; without yin, yang scatters. Yin and yang rely on each other—this is the marvelous Dao of nature. When emotions are purified, yang submerges at the sea-bottom, and the host of yin naturally gathers from all directions—this is the natural effect. Yin is called 'feathered movement,' so yin is free from stagnation. Yang is called 'concealed yang,' so yang is subdued by yin. With yang submerged and yin attached, refinement is not in vain, and gathering is not reckless.*\n\n*Alas! Know that the single practice of gathering and refining is most simple and easy; its knack lies solely in the meaning of 'practice.' The alchemical texts esteem this practice above all, for yang awaits yin’s nurturance, and yin requires yang’s transformation. If I fully concentrate my spirit on the lower extremity, then concealed yang flourishes, and the effect of yin’s attachment and immediate transformation arises, while the host of yin’s feathered movement comes without being summoned. If I empty my qi mechanism, then the meridians and collaterals naturally have no fear of blockage. Within, there may be itching or pain, numbness or twitching, coolness or warmth, scorching heat or icy cold, sensations like threads or ribbons, or like mist or clouds—all manner of differences appearing among the four limbs. Yet I merely empty my qi mechanism, darken my perceptions, keep my mind at the sea-bottom, refrain from a single thought, and focus solely on the lower extremity. As the White Ancestor said: 'Open Qian, close Xun, retain Kun, and block Gen.'*\n\n*Qian is the crown of the head; the head is Qian. Kun is the abdomen; the lower extremity and soles of the feet both belong to Kun. Xun is the nose, the gate of breath’s ingress and egress. 'Closing' means no breath enters or exits; the breath halts within. Gen is the earthly gate; the human anus is Gen. 'Blocking' is like restraining a bowel movement. 'Opening' refers to the vision of ascending heaven above and descending abyss below. 'Retaining' means to preserve it—here referring to the host of yin’s feathered movement, the single yin essence, yin qi, and yin spirit of concealed yang. The White Ancestor’s eight-character alchemical classic is precisely applied within this method, hence its transmission to others for gathering.\"*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "天仙道程宝则 第一宝则 曰：“自然善圆者，我之妙明圆觉之心之性也。 夫此一心，儒家体之曰中，佛家体之曰空，我道体之曰虚，李伯阳、陈翠虚体以炼身而成道者。 其大无外，其小无内，包三界而有余，纳芥子而不窄，盼则立现，金石至坚，犹不膜隔，矧此血肉之团，本无关隔者，人患不修省耳。 故其法惟有圆觉。 圆觉之功，始自洗髓，髓洗则心明，心明觉自圆也。 髓也者，天心之心，谁是也其位在脑。 洗之者水也，水位在肾。 《参同契》曰：真人潜深渊。 《易》曰：潜龙勿用。 《修仙辨惑论》曰：念中无念。 是皆涵谁洗髓之诀。 若夫七情六欲，三尸九虫，缘妄成妄，生自妄因。 人自后天感气而化，无所为根，无所为本，绝无技俩，一无神通。 其所谓技俩神通者，一疑惑，一谗耸，窃权纵肆焉而已，一经夫妙明圆觉之谁，一如明耀，其权顿失，避匿无踪。 故法惟并此幻质，而一返置于无何有之乡，照之顾之，虚之寂之，烹之炼之，厥质斯真。 次亦惟有按兵不动，修我文德，饮之食之，教之诲之，权不下移，令自谁出，是即凝神聚气，念不妄动，一守冲和，无微不烛，久而久之，群阴咸化，国泰民安而身治矣。 是于修身家必以心性圆明为第一宝则云。 ” 第二宝则 持戒圆净，泥丸氏曰：持戒圆净，则习业消而四大净矣。 太虚翁曰：要知生死轮回，缘于习业，习业不净，欲修至道，譬如蒸砂作饭，万无成理。 非惟染淫染瞋染贪染妄，凡夫有碍于身心性命之理者，咸当戒而勿之染也，斯得谓之持戒圆净矣。 第三宝则 曰：“精进无间，泥丸氏曰：精进无间，则性田耕熟，而无渗漏之虞矣。 太虚翁曰：要知三田久芜，荆棘初除，稍一怠忽，自必间断，而萌芽滋长，殆有不可问也矣。 盖人一身内魔伏于内，外魔诱于外，内外伺隙，其理必然。 而大凡人情或生怠于乍得乍失之后，而每忽于已得未行之际，一不自省，为害非细。 况从善如登，而积习隐铸于情关欲壑之奥。 我师所言渗漏，其包甚广，非仅指夫精漏也。 眼不谨则神从眼漏，耳不谨则神从耳漏，口不谨则神从口漏，鼻不谨则神从鼻漏。 若夫心之飞，精之摇，意之乱，神之昏，气之浊，志之迷，是漏也，而邻于渗矣。 渗也者，有漏于不觉不知之境，而失于防不及防，如漏水田然。 其为害也，似缓而速，似微而巨，智者戒之，昧者忽焉。 我按是则，盖即《修仙惑论》中‘断续不专’之对照也。 是说虽似贴性分上说，而实是修命家日乘之津粱。 故我师以是则为修真第三宝程。 第四宝则 曰：“庸其蹊径，泥丸氏曰：庸其蹊径。 则内魔不生，外魔束手，而丹道坦矣。 太虚翁曰：要知斯道也，何道也返本还源之大道也。 其道虽大，至中至庸，一无作为，一无奇异，斯为天仙之道，人人具有，个个圆成，至坚至虚，至灵至混，视之不见，听之不闻，体万物而不遗，纳微尘而勿窄者也，学者如是精体而修之，则功日进而无好胜神飞之患，自无见见闻闻之险。 故我师曰丹道坦矣，噫非无见见闻闻也。 ……故此则为修真家第四宝则乎。 第五宝则，专气致柔 泥丸氏曰：专气致柔，则后先不杂，而丹道淳矣。 太虚翁曰：要知天仙之气，气而非气，至虚至清，至纯至灵，故但上升而无住日。",
      "translated_text": "**The Heavenly Immortal’s Precious Daoist Principles**\n\n**First Precious Principle:**\nIt is said: \"The naturally perfect and complete is the nature of my wondrous, luminous, and all-encompassing awakened heart. This single heart—Confucians embody it as the *Mean*, Buddhists as *Emptiness*, and our Dao as *Vacuity*. Li Boyang and Chen Cuixu embodied it through refining the body to attain the Dao. Vast without exterior, minute without interior, it encompasses the Three Realms with room to spare and contains a mustard seed without constraint. In a glance, it manifests instantly; even the hardest metal and stone cannot obstruct it. How much less can this mere clump of blood and flesh, which is fundamentally without barriers? The trouble lies only in people’s failure to cultivate and reflect.\n\nThus, the method lies solely in *all-encompassing awakening*. The practice of all-encompassing awakening begins with *washing the marrow*. When the marrow is cleansed, the heart becomes clear, and clarity naturally leads to awakening. The marrow is the heart of the Heavenly Heart—*shui* (water) is its essence, and its seat is in the brain. That which washes it is water, whose seat is in the kidneys. The *Cantong Qi* says: *'The true person abides in the deep abyss.'* The *Book of Changes* says: *'The hidden dragon does not act.'* The *Treatise on Dispelling Doubts in Immortal Cultivation* says: *'No thought within thought.'* These are all secrets of *han-shui* (containing water) and washing the marrow.\n\nAs for the seven emotions and six desires, the Three Corpses and Nine Worms, they arise from delusion and become delusion, born of delusive causes. Humans, transformed by postnatal qi, have no root, no foundation, no techniques, no divine powers. What are called techniques and divine powers are merely doubts, slander, and usurpations of authority—nothing more. Yet when confronted with the wondrous, luminous, all-encompassing *shui* of awakening, they vanish like shadows before light, retreating without a trace.\n\nThus, the method is to merge this illusory form and return it to the realm of *wu-he-you* (nothingness). Illuminate it, attend to it, empty it, still it, refine and temper it—then its essence becomes true. Alternatively, one may remain still like an army at rest, cultivating one’s civil virtue: nourishing with food and drink, instructing and guiding. Authority does not descend, and commands emerge naturally from *shui*. This is *concentrating spirit and gathering qi*, ensuring thoughts do not move recklessly, abiding in harmony, and illuminating even the subtlest. Over time, the host of yin forces are transformed, the nation prospers, the people are at peace, and the body is governed. Thus, in the cultivation of the body, the first precious principle is the perfect clarity of heart and nature.\"\n\n**Second Precious Principle: Upholding Precepts with Perfect Purity**\nNiyuan Shi says: \"When precepts are upheld with perfect purity, habitual karma dissolves, and the Four Great Elements become pure.\" Taixu Weng says: \"Know that the cycle of birth and death arises from habitual karma. If habitual karma is impure, seeking the supreme Dao is like trying to cook sand into rice—utterly impossible. Not only must one avoid defilements of lust, anger, greed, and delusion, but all things that obstruct the principles of body, mind, nature, and life must be preceptually avoided and kept unstained. Only then can it be called *upholding precepts with perfect purity*.\"\n\n**Third Precious Principle: Uninterrupted Diligence**\nNiyuan Shi says: \"With uninterrupted diligence, the field of nature is thoroughly cultivated, and there is no fear of leakage.\" Taixu Weng says: \"Know that the Three Fields lie long fallow, their brambles only recently cleared. The slightest negligence leads to interruption, and sprouts will grow uncontrollably. Within the body, inner demons lurk; outside, external demons entice. They lie in wait for gaps—this is inevitable.\n\nGenerally, human emotions may slacken after sudden gains or losses, or grow careless in moments of attainment before action. Without self-reflection, the harm is not small. Moreover, cultivating goodness is like climbing a mountain, while ingrained habits are deeply forged in the passions and desires. My master’s warning of *leakage* is all-encompassing—it does not refer merely to the leakage of essence.\n\nIf the eyes are not guarded, spirit leaks through the eyes; if the ears are not guarded, spirit leaks through the ears; if the mouth is not guarded, spirit leaks through the mouth; if the nose is not guarded, spirit leaks through the nose. As for the scattering of the heart, the agitation of essence, the chaos of intent, the dullness of spirit, the turbidity of qi, and the confusion of will—these are leakages bordering on *seepage*. Seepage occurs in states of unawareness, where defense is too late, like a leaking paddy field. Its harm seems slow but is swift, seems minor but is great. The wise guard against it; the foolish neglect it.\n\nThis principle, I note, corresponds to the *Treatise on Dispelling Doubts in Immortal Cultivation*’s warning against *discontinuity and lack of focus*. Though it appears to address the nature, it is in truth the daily sustenance of those who cultivate life. Thus, my master establishes this as the third precious principle of immortal cultivation.\"\n\n**Fourth Precious Principle: Following the Common Path**\nNiyuan Shi says: \"Following the common path, inner demons do not arise, outer demons are powerless, and the elixir path becomes smooth.\" Taixu Weng says: \"Know that this Dao—what Dao is it? It is the great Dao of returning to the root and restoring the source. Though vast, it is supremely ordinary, without contrivance, without strangeness. This is the Dao of Heavenly Immortals, possessed by all, perfected by each. Utterly firm, utterly empty, utterly numinous, utterly undifferentiated—seen yet invisible, heard yet inaudible. It embodies the myriad things without omission and contains the tiniest speck without constraint. If scholars cultivate it with such precision, their practice advances daily without the peril of competitive spirit or reckless flight, and they avoid the dangers of seeing and hearing.\n\nThus, my master says the elixir path is smooth. Alas, it is not that there is no seeing or hearing... Therefore, this is the fourth precious principle of immortal cultivation.\"\n\n**Fifth Precious Principle: Concentrating Qi to Attain Softness**\nNiyuan Shi says: \"Concentrating qi to attain softness ensures no confusion between prior and posterior, and the elixir path becomes pure.\" Taixu Weng says: \"Know that the qi of Heavenly Immortals is qi yet not qi—utterly empty, utterly pure, utterly refined, utterly numinous. Thus, it only ascends and does not abide in the sun.\"",
      "overlap_context": "",
      "start_char": 1,
      "end_char": 1255,
      "start_sentence": 0,
      "end_sentence": 47,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.71939539909363,
      "metadata": {
        "source_file": "dao\\藏外\\天仙道程宝则.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "专气者，气不专则神不凝而火不旺，火不旺则精气不化，后天者依然粗浊，不入丹品，时至取之，则后先混纳，斯有坐静气冲之弊。 ”“我见世之学者，每以火旺为虑，我常大声而疾呼之，醒之者甚少，不亦哀哉。 无他昧夫不识定静之功，错使后天凡火，每于交媾之际，周身通畅，略似夫妇行房，而错会竟同凡媾。 转瞬间竟致有周身麻颤身震气喘之状，十倍受用于凡媾，以为得功得计，岂知勾动相火，从而煽炽我身真精真气化为交感呼吸之物。 其则斯法而行者，无不面如童子，又肥又润。 岂知一朝命尽，不有丹火内焰五脏焦裂而死，即染三消之症，或有精泄数斛而卒者，余年未多而历历见有二十三人矣。 其中有断欲者，有不断欲者，有多蓄姬妾者，有借用阳鼎者，皆能以不泄而取乐，以为得所助，而津津向人道不以为过者也。 而能善终者卒惟断欲一人，然亦终染三消之症而死可不惧哉。 我道之所谓交媾者，通畅之极，盖和之至，有不知天地人我中，惟见氤氲气象而已，声息尚未之有，而况震颤也哉。 倘或有之，诀惟加澄我心志，而置此身于无何有之乡，亦无须住乎。 此亦要嘱，不然则所化后天，竟后天矣，岂不惜哉。 我师以专气至柔，纂为修真家第五宝则，有以夫。 第六宝则 曰：“一尘不染。 泥丸氏曰：一尘不染，则呼吸气无，而玄关开矣。 太虚翁曰：要知呼吸之气不无则真气不现，真气现而玄关始开。 其开也有真有幻，自内而开出者真，自外而开入者幻。 又有似自外开而实自内开者，此又不可不自审。 其诀总从事于忘忘一功，厥关自开，而万无不真也矣，其曰一尘不染。 则其无杂念也可知，念无而后息住，息住而后关开，此—定之理，然亦有一虚一寂而便开焉者，此乃气穴，非穴气也。 气穴者，祖气之所自出，而气穴在其中，气穴开而玄关辟矣，此一说也，知者鲜矣。 噫，此地仙之所以多夫天仙者欤。 失之毫厘，谬之千里。",
      "translated_text": "\"To concentrate qi means that if qi is not concentrated, spirit does not congeal and the fire does not flourish. If the fire does not flourish, essence and qi do not transform, and the postnatal remains coarse and turbid, unfit for the elixir’s rank. When the time comes to refine it, prior and posterior become intermixed, giving rise to the harm of meditative qi surging.\n\nI observe that scholars of this world often worry about the fire flourishing too much. I have cried out loudly and urgently, yet few awaken—is this not lamentable? The fault lies in their ignorance of the work of stabilization and quiescence, mistakenly employing the mundane fire of the postnatal. During the moment of union, the entire body feels unobstructed, vaguely resembling the act of conjugal union, and they misconstrue it as no different from ordinary coupling. In an instant, they experience whole-body numbness, trembling, and panting—ten times the sensation of ordinary union—and believe they have attained achievement. Little do they know they have stirred the ministerial fire, fanning it into a blaze that consumes their true essence and true qi, reducing them to mere objects of respiratory exchange. Those who practice this method invariably develop the complexion of a child—plump and lustrous. Yet when their fate is exhausted, they either perish with the inner flames of the elixir fire scorching their five viscera or contract the three wasting diseases, or even discharge several *hu* of essence before dying. In my few years, I have witnessed twenty-three such cases. Among them were those who severed desire, those who did not, those who kept many concubines, and those who borrowed the yang crucible—all able to derive pleasure without emission and boast of their success, never considering it a fault. Yet in the end, only one who severed desire met a good end, though he too ultimately died of the three wasting diseases. Is this not cause for fear?\n\nWhat our Dao calls union is the utmost harmony, so thoroughly unobstructed that one forgets the distinction between heaven, earth, self, and others, perceiving only the misty vapors of qi. There is not even the slightest sound or breath, let alone trembling. Should such sensations arise, the remedy lies solely in clarifying one’s resolve and placing this body in the realm of nothingness—no need to dwell on it. This too is a crucial admonition. Otherwise, what was meant to transform the postnatal will remain merely postnatal—how lamentable!\n\nMy master compiled *Concentrating Qi to Attain Softness* as the fifth precious principle of immortal cultivation for good reason.\n\n**Sixth Precious Principle: Unstained by a Single Speck of Dust**\nNiyuan Shi says: \"Unstained by a single speck of dust, breath and qi vanish, and the mysterious pass opens.\" Taixu Weng says: \"Know that if the qi of breathing is not absent, true qi does not appear. Only when true qi appears does the mysterious pass begin to open. Its opening may be real or illusory: that which opens from within is real; that which opens from without is illusory. There is also the case where it seems to open from without but actually opens from within—this too requires careful discernment. The key lies in the practice of forgetting and forgetting again; the pass will open of itself, and all will be genuine. As it is said, *unstained by a single speck of dust*, so too is the absence of stray thoughts evident. Only when thoughts are absent does the breath settle; only when the breath settles does the pass open—this is an immutable principle. Yet there are those who, through utter emptiness and stillness, attain opening at once. This is the qi cavity, not the cavity of qi. The qi cavity is where the ancestral qi naturally arises, and within it lies the qi cavity. When the qi cavity opens, the mysterious pass unfolds—this is one explanation, though few understand it. Alas, is this not why earthbound immortals outnumber celestial immortals? A hair’s breadth of error leads to a thousand miles of deviation.\"",
      "overlap_context": " is no seeing or hearing... Therefore, this is the fourth precious principle of immortal cultivation.\"\n\n**Fifth Precious Principle: Concentrating Qi to Attain Softness**\nNiyuan Shi says: \"Concentrating qi to attain softness ensures no confusion between prior and posterior, and the elixir path becomes pure.\" Taixu Weng says: \"Know that the qi of Heavenly Immortals is qi yet not qi—utterly empty, utterly pure, utterly refined, utterly numinous. Thus, it only ascends and does not abide in the sun.\"",
      "start_char": 1255,
      "end_char": 1992,
      "start_sentence": 48,
      "end_sentence": 70,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.21404004096985,
      "metadata": {
        "source_file": "dao\\藏外\\天仙道程宝则.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "语曰：欲知山下路，须问过来人。 不蒙师示，到老还成骨董，是某之幸也夫，师不云乎，气穴不开，进火无门。 气穴不开，圣胎不结，忘而又忘，玄关斯阅。 是二非二，是一非一，如鸡抱卵，不说而说。 我师又曰：其诀且从一尘不染上始，是以修真家纂以此句为第六宝则云。 第七宝则 曰； “凝神入穴。 泥丸氏曰：所谓凝也，先以目光注所凝处，微以意敛真气，氤氲回转，方以和气寄于其间，待已忘忘则撤其机心。 凝神入穴，则气穴暖而真火旺矣。 真火旺而关辟，无魔液不渗入而圣胎有室，婴儿斯无失乳之护焉。 然而知之者鲜矣，是不可为外人道也。 太虚翁曰：慈哉我师也欤，关无气穴则丹冷，胎乏阴精则乳失（此乃真精，非凡液也。 凡液乃凡气所化，故忌渗入也。 真精乃真气所化，玉液是也，尚非金液耳）。 ……若夫老子之游心于物初一句，乃是结胎安灵之秘奥，此非进火之候也。 汝其识之，故我师以凝神入穴为修真第七宝则，其指趣也玄矣夫。 第八宝则 曰；",
      "translated_text": "As the saying goes: *\"To know the path beneath the mountain, ask one who has traversed it.\"* Without a teacher’s guidance, one may toil until old age and remain but a relic—how fortunate I am! Did not the master say: *If the qi cavity does not open, there is no gate for the fire to enter. If the qi cavity does not open, the sacred embryo cannot take form.* Forget and forget again, and the mysterious pass will unfold.\n\nThis is two yet not two, one yet not one—like a hen brooding over her eggs, unspeaking yet speaking. My master further said: *The method begins with unstained by a single speck of dust*, which is why cultivators of the Dao have enshrined this phrase as the Sixth Treasure. The Seventh Treasure states: *\"Concentrate the spirit and enter the cavity.\"*\n\nThe Master of the Mud Pill Palace said: *What is meant by concentration? First, direct the gaze to the point of focus, gently gather the true qi with intent, letting it coil and revolve. Then, lodge the harmonious qi within, and once forgetting is complete, withdraw the mechanism of the mind.* When the spirit is concentrated and enters the cavity, the qi cavity warms and the true fire blazes. With the true fire blazing, the pass opens, no demonic fluids can seep in, and the sacred embryo finds its chamber—thus the infant suffers no lack of nourishment.\n\nYet few comprehend this; it must not be spoken of to outsiders. The Elder of Great Emptiness said: *How compassionate is my master! Without the qi cavity, the elixir grows cold; without the yin essence, the embryo lacks its milk (this is true essence, not ordinary fluid. Ordinary fluid is transformed from mundane qi, and its seepage is to be avoided. True essence is transformed from true qi—this is jade fluid, though not yet golden fluid).*\n\n...As for Laozi’s *\"roaming the mind in the primal unity of things,\"* this is the secret of nurturing the embryo and settling the spirit—it is not the moment for stoking the fire. Bear this in mind, for my master designated *\"concentrate the spirit and enter the cavity\"* as the Seventh Treasure of Daoist cultivation, its subtlety profound indeed.\n\nThe Eighth Treasure states:",
      "overlap_context": "is is an immutable principle. Yet there are those who, through utter emptiness and stillness, attain opening at once. This is the qi cavity, not the cavity of qi. The qi cavity is where the ancestral qi naturally arises, and within it lies the qi cavity. When the qi cavity opens, the mysterious pass unfolds—this is one explanation, though few understand it. Alas, is this not why earthbound immortals outnumber celestial immortals? A hair’s breadth of error leads to a thousand miles of deviation.\"",
      "start_char": 1992,
      "end_char": 2392,
      "start_sentence": 71,
      "end_sentence": 89,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.290633201599121,
      "metadata": {
        "source_file": "dao\\藏外\\天仙道程宝则.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "“泥丸氏曰：端坐习定，采取之秘诀，传自翠虚翁，惜乎世人囫囵读之耳，咀而味之，修道之要，行功之诀，得采之义，承受之秘，已尽备于四宇中矣。 慈哉翠虚翁，世即囫囵读之，亦可谓一句破的，循而行之，亦自成道。 太虚翁曰：然。 端也者，寓有六时端一之义，非寓道要乎？ 坐也者，寓有两目附土之义，非寓功诀乎？ 习也者，寓有羽趋潜阳之义，非寓得采之道乎？ 定也者，寂然不动之谓，非真指夫受炼之秘乎。 盖道以勤修为要，六时端一，勤义有焉。 修以一意为诀，两目附土，一意寓焉。 修功之作用止此，曰羽趋，曰潜阳，自然之妙理，亦自然之功效。 不待作用者也。 阴无阳则滞，阳无阴则飞，阴阳相须，自然之妙道，情净则阳伏于海底，而群阴自四趋附，此自然之功效。 阴曰羽趋，阴无滞弊矣。 阳曰潜阳，阳得阴伏矣。 阳伏阴附，炼不虚炼，而采非妄采矣。 噫，要知采取一功，至简至易，厥诀惟一习字义云，丹书至重于采取一功者，阳待阴养，阴须阳化。 我惟全神专注下极，则潜阳旺，斯有阴附立化之功，而群阴羽趋之效，有不待致而来者，我惟虚其气机，则脉络自无阻塞之虞。 而中有或痒或痛，或麻或跳，或凉或温，或火烫或冰冷，或如丝如带，或如雾如云，种种不同，现于四肢之间。 而我只行虚我气机，冥其闻见，心存海底，不起一念，专守下极。 白祖所谓开乾闭巽，留坤塞艮而已。 乾者顶际也，首是也，坤者腹也，下极足心俱属坤也，巽者鼻也，呼吸出入之门也。 言闭也者，无有呼吸之气出入也，呼吸之气停于内也。 艮者地户也，人之粪门是也。 塞也者，如忍大便然是也。 开也者，有上冲之天，下达之渊之景象也。 留也者，存之之义也。 盖指群阴羽趋，潜阳一种之阴精阴气阴神也。 白祖之八字丹经，正当于此则中参用之，故采以示人也。",
      "translated_text": "The Master of Mud-Pill Palace said: *\"Sitting upright to practice stabilization—this secret of gathering and refining was transmitted by the Elder of Emerald Emptiness. Alas, how the world reads it carelessly! If one chews and savors it, the essentials of Daoist cultivation, the knack of practice, the meaning of gathering, and the secret of reception are all fully contained within these four characters. How compassionate was the Elder of Emerald Emptiness! Even if the world reads it carelessly, a single phrase strikes the mark; follow it, and one may still attain the Dao.\"*\n\nThe Elder of Great Emptiness said: *\"Indeed. 'Upright' (端) harbors the meaning of aligning the six periods into oneness—does this not embody the essentials of the Dao? 'Sitting' (坐) harbors the meaning of both eyes adhering to the earth—does this not embody the knack of practice? 'Practice' (习) harbors the meaning of feathered movement and concealed yang—does this not embody the Way of gathering? 'Stabilization' (定) means stillness and immobility—does this not truly point to the secret of refinement?*\n\n*The Dao takes diligent cultivation as its essence; aligning the six periods into oneness embodies diligence. Cultivation takes single-mindedness as its knack; both eyes adhering to the earth harbors single-mindedness. The function of practice lies solely in this: 'feathered movement' and 'concealed yang' are the marvelous principles of nature, as well as its natural effects, requiring no forced effort. Without yang, yin stagnates; without yin, yang scatters. Yin and yang rely on each other—this is the marvelous Dao of nature. When emotions are purified, yang submerges at the sea-bottom, and the host of yin naturally gathers from all directions—this is the natural effect. Yin is called 'feathered movement,' so yin is free from stagnation. Yang is called 'concealed yang,' so yang is subdued by yin. With yang submerged and yin attached, refinement is not in vain, and gathering is not reckless.*\n\n*Alas! Know that the single practice of gathering and refining is most simple and easy; its knack lies solely in the meaning of 'practice.' The alchemical texts esteem this practice above all, for yang awaits yin’s nurturance, and yin requires yang’s transformation. If I fully concentrate my spirit on the lower extremity, then concealed yang flourishes, and the effect of yin’s attachment and immediate transformation arises, while the host of yin’s feathered movement comes without being summoned. If I empty my qi mechanism, then the meridians and collaterals naturally have no fear of blockage. Within, there may be itching or pain, numbness or twitching, coolness or warmth, scorching heat or icy cold, sensations like threads or ribbons, or like mist or clouds—all manner of differences appearing among the four limbs. Yet I merely empty my qi mechanism, darken my perceptions, keep my mind at the sea-bottom, refrain from a single thought, and focus solely on the lower extremity. As the White Ancestor said: 'Open Qian, close Xun, retain Kun, and block Gen.'*\n\n*Qian is the crown of the head; the head is Qian. Kun is the abdomen; the lower extremity and soles of the feet both belong to Kun. Xun is the nose, the gate of breath’s ingress and egress. 'Closing' means no breath enters or exits; the breath halts within. Gen is the earthly gate; the human anus is Gen. 'Blocking' is like restraining a bowel movement. 'Opening' refers to the vision of ascending heaven above and descending abyss below. 'Retaining' means to preserve it—here referring to the host of yin’s feathered movement, the single yin essence, yin qi, and yin spirit of concealed yang. The White Ancestor’s eight-character alchemical classic is precisely applied within this method, hence its transmission to others for gathering.\"*",
      "overlap_context": "its seepage is to be avoided. True essence is transformed from true qi—this is jade fluid, though not yet golden fluid).*\n\n...As for Laozi’s *\"roaming the mind in the primal unity of things,\"* this is the secret of nurturing the embryo and settling the spirit—it is not the moment for stoking the fire. Bear this in mind, for my master designated *\"concentrate the spirit and enter the cavity\"* as the Seventh Treasure of Daoist cultivation, its subtlety profound indeed.\n\nThe Eighth Treasure states:",
      "start_char": 2392,
      "end_char": 3088,
      "start_sentence": 90,
      "end_sentence": 117,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.02131724357605,
      "metadata": {
        "source_file": "dao\\藏外\\天仙道程宝则.txt",
        "category": "藏外"
      }
    }
  ]
}