{
  "source_id": "天机经",
  "source_file": "chunked_daozang\\天机经.json",
  "total_chunks": 3,
  "total_original_chars": 2744,
  "total_translated_chars": 15872,
  "total_translation_time": 78.80683612823486,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏太清部\\天机经.txt",
    "category": "正统道藏太清部"
  },
  "full_translation": "Composed circa the Tang-Song interregnum, *Yinfu Tianji Jing* (*Classic of Heaven’s Mechanism in the Yin Talisman*) is recorded in the *Tongzhi Yiwen Lue* as a single fascicle. The present edition derives from the *Zhengtong Daozang*, Taiqing Section, and also appears in *Yunji Qiqian*, juan fifteen.\n\n**Preface** states: To possess the mechanism without the person is to fail; to possess the person without the Way is likewise to fail. Thus the *Yijing* says: “Pursuing the deer without a forester, one enters the forest alone—even a gentleman of discernment would do better to abandon the chase, lest he meet with regret.” Therefore the sage observes the season and employs his talisman, responds to the mechanism and regulates affairs, thereby wielding life and death within his palm and accomplishing great enterprises under heaven. The *Yijing* says: “The noble person conceals his instruments within, awaiting the proper moment to act.” Thus the sage preserves them in the numinous terrace, observing the shifts of mechanism. When rolled up, they enable self-mastery; when unfurled, they overcome others. When scrutinized, they have no form; when employed, they are inexhaustible. The *Yijing* says: “That which is unfathomable in yin and yang is called the numinous.” And the *Yin Talisman* embodies this. Thus the sage’s unfathomable talisman harmonizes all under heaven without incurring resentment.\n\nHeaven presides over earth, the Dao reigns over virtue; therefore the sage serves earth and models himself on heaven, establishes virtue and practices the Way. He elevates the Way of heaven as the foremost principle and clarifies earth to uphold it. The *Yijing* says: “Thus he follows heaven and awaits the proper moment to act.” Therefore, when the sage intends to act, he must first observe the waxing and waning of heaven’s Way, then grasp and enact it. When action accords with the mechanism, no strategy is left unfulfilled. The *Yijing* says: “He follows heaven’s timing after heaven.”\n\nProsperity! The sage models himself on earth and serves heaven, establishes virtue and practices the Way. Dwelling between heaven and earth, virtue and the Dao, none who build great achievements do not rely on the *Five Thieves* to accomplish them. The *Five Thieves* are: the first steals fate, the second steals things, the third steals time, the fourth steals merit, the fifth steals the numinous—these are the arts of emperors, kings, hegemons, and the shifts of power. Thus the sage observes the mechanism and responds to it, measures the season and employs it. Was it not by following the season and responding to the mechanism, driving the *Five Thieves*, that the Grand Duke established the hegemonic canons to overthrow the Yin court and implemented the *Three Winds* to govern the Zhou house?\n\nTherefore the sage establishes his foundation amid the principles of emperors and kings, responds to the mechanism within the shifts of hegemonic power, ordering the state and cultivating the self—here the *Five Thieves* are complete. Then all under heaven follow at the mere rustling of the wind, exhausting their natures and lives without harboring resentment or gratitude. This is called the *thief of the Way*, the *army without form*—alas, what bandit could be greater? When the *Five Thieves* reside in the heart and capture and release lie in the hand, nothing surpasses this for cultivating the self and aiding the world. The *Classic* says: “Those who perceive it prosper”—is this not fitting?\n\n**The Self**\nThe human heart is the master of the body, the palace of the hun-soul, the repository of the po-soul. When one intends to employ the *Five Thieves*, nothing surpasses the heart. In all undertakings, one must align with the Way of heaven. Thus, though the cosmos is vast, one surveys it as if in the palm of the hand; though the myriad things are numerous, life and death do not depart from the art. Then one realizes that heaven and earth are not to be prized for their remoteness or depth—how much less what lies before the ears and eyes?\n\n**The Mechanism**\nThe mechanism of killing is the sprout of the rise and fall of two dynasties, the omen of the life and death of ten thousand people. It arises in days when cloud and thunder are not yet harmonious, in times when the dark and yellow flow with blood. When heaven undergoes transformation, dragons emerge in the fields and serpents slither on the roads—this is the mechanism of battle, hence it is said: “Dragons and serpents rise from the land.” When humans undergo transformation, spring enforces autumn’s decrees, rewards the rebellious and punishes the loyal—this is the mechanism of collapse, hence it is said: “Heaven and earth are overturned.” The mechanisms of heaven and humanity arise simultaneously; though they undergo a thousand changes and ten thousand transformations, the mechanism of success or failure is already determined.\n\n**Concealment**\nThe benevolent must be courageous, but the courageous need not be benevolent; the wise can feign foolishness, but the foolish cannot feign wisdom. Thus, when the sage’s time is favorable, he displays his skill and builds his merit; when his time is unfavorable, he appears clumsy and obscures his traces. Thus Zhuge Liang’s preface says: “The Grand Duke at eighty did not lack opportunity—he was merely discerning about his lord.” Alas! The seasons of life’s skill and clumsiness, the circumstances of insight and concealment—these enable one to observe changes, perceive mechanisms, and wield the *Five Thieves*. The reason is this: the sage’s profound insight and far-reaching vision ensure that his actions never miss the mechanism. He observes heaven, assesses people, and acts in accord with the season. Thus the *Yijing* says: “He who knows advance and retreat, survival and demise, and does not lose his correctness—is this not the sage?”\n\n**Stillness**\nThe nine orifices: in heaven they are the nine stars, on earth the nine provinces, in humans the nine orifices. When the qi of the nine orifices is not upright, it is said to receive evil. Receiving evil, perception becomes biased; with biased perception, one cannot issue mechanisms or observe changes. Thus the urgency of the nine orifices lies in the *Three Essentials*. The Grand Duke said: “The ears, eyes, and mouth.” The ears, eyes, and mouth are the heart’s assistants, the gates and doors of the spirit, the pivot and trigger of wisdom, the fortune and misfortune of humans. Thus, ears without acuity cannot distinguish sounds; eyes without clarity cannot perceive mechanisms; mouths without measure cannot issue commands. If the *Three Essentials* are not refined, one cannot govern the state above or manage the household below—how much less command armies? Suspending human lives, determining the survival or demise of the state, in the space between stillness and motion, one cannot be without affairs—how could one employ them lightly?\n\n**Humanity**\nFire is born from wood; when fire erupts, it burns the wood. States are born from treachery; when treachery deepens, the state falls into chaos. It is like the silkworm that spins its cocoon—when the cocoon is complete, it kills itself. Humans create affairs; when affairs multiply, they harm their lives. None but the utmost sage can cultivate the self and refine conduct, preventing disorder before it sprouts and governing it before it descends into chaos. A tree of ten spans begins with a handful...\n\nA terrace of a hundred *ren* begins with the ground beneath one’s feet; if one does not fear small evils, they will surely grow into great calamities. Alas! When wood does not rub against wood, fire has no way to emerge; when a state has no chaotic governance, treachery has no way to arise. That which has a beginning and an end remains unshaken in right or wrong. Who but the sage can truly know this?\n\n**Peace**\nAll things steal the essence of Heaven and Earth to take form and grow; humans steal the shapes of all things to use them; all things steal human strength to be cultivated. Each steals from the other, each gains what is fitting, yet none knows it as the transformation of the myriad things. Thus, those who wield the mechanism emulate these three affairs, employing the Dao’s theft to plunder things, while things, too, know the Dao of theft. That which is so arises from valuing the right time and seizing the right moment. Therefore, it is said: eating in accord with the season, the hundred bones are ordered; moving in response to the moment, the ten thousand transformations are at peace. To go against the time or lose the moment is to invite disaster and chaos.\n\n**Spirit**\nThe Old Master said: \"Having accomplished the work, one does not claim possession; acting, one does not rely on it.\" This is the root of preserving life and establishing virtue. As for the petty person, coveting wealth, they sacrifice themselves for profit; loving fame, they contend with force for merit. They boast of divine signs to seek a name as a spirit, and all things grow jealous of them—thus they surely lose their lives. Seeking gain, they invite loss; this is not spirit. The noble person builds great merit yet does not rely on it, guards against small disasters before they sprout, withdraws the self and advances others, defers to ability and yields to things—all things bear them up, and thus their advantage is not taken. They give rise to spirit and wisdom yet do not contend with things; all things yield to them, and they do not fall behind. Seeking loss, they invite gain—thus they attain the utmost spirit. Therefore, the Old Master said: \"Those who act fail; those who grasp lose.\" Truly, these are his words.\n\n**Sage**\n\nShould a sage appear once in a thousand years, a worthy once in five hundred—such is the measure of their arising by the reckoning of sun and moon, and thus the great and small among men are determined. When a great person emerges in the world, they respond to luminous virtue and establish sagely merit; when a petty person holds sway in their time, they abandon the proper norms and give rise to calamity and disorder. Thus, the Grand Duke spoke to the Earl of the West, knowing the people’s hopes and returning to him; Zhou’s Liu Kun addressed the court from Langye, discerning the signs of the times yet not departing; the mother of Jinling took her own life, foreseeing that a bright lord would surely rise; the mother of Gua did not seek execution, seeing that the Zhao army would surely fail. Thus, the Way of Heaven and the affairs of men may be foreknown by the worthy. If one assists an unfit ruler, one is destroyed along with the nine clans. Therefore, the *Book of Changes* says: “The eldest son leads the army and founds a state to sustain the family; do not employ petty men, for they will surely throw the realm into chaos.”\n\nBefore the course of success or failure takes shape, before the pivot of life and death is set in motion, the petty man may see it, while the noble person may know it—thus, seeing is easy and knowing is difficult; seeing concerns the near, while knowing extends to the far. Those who see the pivot act swiftly to seize the moment and gain advantage, yet none preserve their allotted years. Those who know the pivot trace beginnings to their ends and thus surely preserve their nature and life.\n\nThe blind excel in hearing, for their spirit does not stray from the ear; the deaf excel in sight, for their heart does not stray from the eye. In hearing, their spirit concentrates on the ear; in seeing, their heart concentrates on the eye. Ear and eye alternate as masters in their use, and when one is employed, its advantage eclipses the other. What the heart governs, no task fails to perfect—this yields a tenfold advantage, how much more so when applied in alternation? Employing this threefold reflection, with single-minded sincerity and a plan attuned to the times, one conceals or reveals, acts or withdraws in response to the pivot. Using this to command an army ensures victory a myriad times over.\n\nThe human heart does not stir without cause: life and death arise in response to things. When things move, the heart stirs; when things are still, the heart is stilled. Is not the form of life and death found in things alone?\n\nThe eye is the gate of spirit, and spirit is the lord of the heart. Spirit’s comings and goings all roam through the eye. Thus, those who see the pivot all esteem the eye; those who know the pivot all esteem the heart.\n\nThe Dao does not bring forth spring for the sake of the myriad things—things feel spring’s *qi* and arise of themselves. Autumn does not bring death for the sake of the myriad things—things feel autumn’s *qi* and perish of themselves. In giving life, it does not rely on its grace nor seek repayment—thus its grace is great. In bringing death, it does not rely on its might nor seek fear—thus its might is great. What is taken and obtained is small; what is not taken yet obtained is great. Therefore, the sage does not take.\n\nWhether a lord of men possesses the Dao or lacks it is the pivot of wealth, the people, order, and disorder. Whether songs and ballads are joyful or mournful is the omen of years of plenty or scarcity. When people fail to examine and perceive, Heaven and Earth send down portents: now five-colored clouds rise, now the seven luminaries alter their courses—all in response to the winds of the state, and thus it is so. When the lord of Song lost virtue, Mars lingered at the Heart; when he repented his faults, it retreated three lodges. Applying the present to the past is as clear as before one’s eyes; using that to illustrate this—does it tax one’s thoughts? Thus, the wise awaken to the beginnings of human affairs, while fools remain benighted until after celestial signs appear.\n\nThe Old Master took non-being as the mother of being, stillness as the lord of restlessness. Stillness is the state before primal *qi* divides, its form within primal *qi*—thus it gives birth to Heaven, Earth, and the myriad things. It is like a person of vast stillness whose heart is unperturbed, and thus can give birth to the myriad things under Heaven.\n\nVictory is gradual growth. The Way of Heaven and Earth each grows gradually: Heaven grows the yang, Earth grows the yin. Yin and yang summon one another, alternating day and night as lord and minister, each overcoming the other in turn—thus it is said that yin and yang overcome one another. When founding a state or deploying an army, one must encroach upon the Way of Heaven, just as metal and fire contend, and without contention, neither is subdued. If even Heaven does not oppose this, how much less should men?\n\nThe *Book of Changes* says: “The firm and yielding grind against each other and give rise to change.” Since change is not perverse, it is called “following.” In nurturing the body and cultivating one’s nature, one must not act against the times—how much less should the heroes who order the state and assist the age?\n\nThe Way of the utmost sage is profound and without action. Without action, there is no pivot; without pivot, there is utmost stillness. The subtlety of pitch pipes and calendars lies in their movement, yet when their substance is emptiness and nothingness, no instrument can be applied. It is like warfare: one does not miss the pivot nor reveal the breach, so that even the wise have no means to control it.\n\nExtraordinary devices belong to yin and yang, thus they give birth to the myriad things—just as the human heart can create the myriad affairs, it is their image. Advancing forward is the image’s form. The eight trigrams, the six jia, the secrets of ghosts and spirits, the arts of firm and yielding restraining one another—all are arrayed clearly before us in their forms.\n\n*The Scripture of Heaven’s Mechanism and the Yin Talismans* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "约出於唐宋间。 《通志艺文略》着录。 一卷。 底本出处：《正统道藏》太清部。 又见於《云笈七签》卷十五。 阴符天机经 叙曰：有机而无其人者败，有其人而无其道者败。 故《易》曰：即鹿无虞，惟入子林，中君子几，不如舍往吝。 故圣人观其时而用其符，应其机而制其事，故能运生杀於掌内，成功业於天下者也。 《易》曰：君子藏器于身，待时而动。 是以圣人保之於灵台，以观机变。 卷之则自胜，舒之则胜人，察之则无形，用之则不极。 《易》曰：阴阳不测之谓神。 而阴符象之矣。 故圣人不测之符，陶均天下而元所归怨矣。 夫天为地主，道为德君，故圣人奉地而法天，立德而行道，举天道而为经首，明地以奉之。 《易》曰：乃顺承天，待时而动。 是故圣人将欲施为，必先观天道之盈虚，后执而行之。 举事应机，则无遗策。 《易》曰：后天而奉天时。 昌 夫圣人法地而奉天，立德而行道。 居天地道德之间，建莫大之功者，未有不因五贼而成也。 五贼者，其一贼命，其二贼物，其三贼时，其四贼功，其五贼神，皇帝王霸权变之道也。 是以圣人观其机而应之，度其时而用也。 故太公立霸典而灭殷朝，行三风而理周室，岂不随时应机，驱驰五贼者也？ 故圣人立本於皇王之中，应机於权霸之内，经邦治身，五贼者备矣。 则天下望风而从之，竭其性命而无所归其恩怨也。 乃谓之曰有道之盗，无形之兵，呜呼，寇莫大焉。 五贼在心，擒纵在手，治身佐世，莫尚於斯。 《经》云：见之者昌，不亦宜乎？ 身 夫人心，身之主，魂之宫，魄之府。 将欲施行五贼者，莫尚乎心。 事有所图，必合天道。 此则宇宙虽广，览之只在於掌中； 万物虽多，生杀不离於术内。 则明天地不足贵以远以厚，而况耳目之前乎？ 机 夫杀机者，两朝终始之萌，万人生死之兆，处云雷未泰之日，玄黄流血之时。 故天之为变也，则龙出于田，蛇游乎路，此为交战之机，故曰龙蛇起陆。 人之为变也，则春行秋令，赏逆罚忠，此为颠堕之机，故曰天地反覆。 天人之机，同时而发，虽千变万化，成败之机定矣。 藏 夫仁者必有勇，勇者不必有仁； 智者能愚，愚者不必能智。 故圣人时通则见其巧而建其功，时否则见其拙而昧其迹。 故孔明序曰：太公八十非不遇也，盖审其主焉。 呜呼，性命巧拙之时，识达行藏之势，可以观变察机，运用五贼。 所以然者，夫圣人所以深衷远照，动不失机，观天料人，应时而作。 故《易》曰：知进退存亡而不失其正者，其惟圣人乎？ 静 夫九窍者，在天为九星，在地为九州，在人为九窍。 九窍之炁不正，故曰受邪。 受邪则识用偏，识用偏则不可发机观变。 故九窍之急在乎三要，太公曰：耳、目、口也。 夫耳目口者，心之佐助也，神之门户也，智之枢机也，人之祸福也。 故耳无聪不能别其音，目无明不能见其机，口无度不能施其令。 夫三要不精，上不能治国，下不能治家，况兵者乎？ 悬人之性命，为国之存亡，静动之间，不得无事，岂可轻而用之？ 人 夫火生於木，火发而木焚； 国生於奸，奸深则国乱。 亦犹蚕能作茧，茧成则杀其身，人能生事，事烦则害其命。 非至圣不能修身炼行，防之於未萌，治之於未乱。 夫十围之木，起於拱把；",
      "translated_text": "Composed circa the Tang-Song interregnum, *Yinfu Tianji Jing* (*Classic of Heaven’s Mechanism in the Yin Talisman*) is recorded in the *Tongzhi Yiwen Lue* as a single fascicle. The present edition derives from the *Zhengtong Daozang*, Taiqing Section, and also appears in *Yunji Qiqian*, juan fifteen.\n\n**Preface** states: To possess the mechanism without the person is to fail; to possess the person without the Way is likewise to fail. Thus the *Yijing* says: “Pursuing the deer without a forester, one enters the forest alone—even a gentleman of discernment would do better to abandon the chase, lest he meet with regret.” Therefore the sage observes the season and employs his talisman, responds to the mechanism and regulates affairs, thereby wielding life and death within his palm and accomplishing great enterprises under heaven. The *Yijing* says: “The noble person conceals his instruments within, awaiting the proper moment to act.” Thus the sage preserves them in the numinous terrace, observing the shifts of mechanism. When rolled up, they enable self-mastery; when unfurled, they overcome others. When scrutinized, they have no form; when employed, they are inexhaustible. The *Yijing* says: “That which is unfathomable in yin and yang is called the numinous.” And the *Yin Talisman* embodies this. Thus the sage’s unfathomable talisman harmonizes all under heaven without incurring resentment.\n\nHeaven presides over earth, the Dao reigns over virtue; therefore the sage serves earth and models himself on heaven, establishes virtue and practices the Way. He elevates the Way of heaven as the foremost principle and clarifies earth to uphold it. The *Yijing* says: “Thus he follows heaven and awaits the proper moment to act.” Therefore, when the sage intends to act, he must first observe the waxing and waning of heaven’s Way, then grasp and enact it. When action accords with the mechanism, no strategy is left unfulfilled. The *Yijing* says: “He follows heaven’s timing after heaven.”\n\nProsperity! The sage models himself on earth and serves heaven, establishes virtue and practices the Way. Dwelling between heaven and earth, virtue and the Dao, none who build great achievements do not rely on the *Five Thieves* to accomplish them. The *Five Thieves* are: the first steals fate, the second steals things, the third steals time, the fourth steals merit, the fifth steals the numinous—these are the arts of emperors, kings, hegemons, and the shifts of power. Thus the sage observes the mechanism and responds to it, measures the season and employs it. Was it not by following the season and responding to the mechanism, driving the *Five Thieves*, that the Grand Duke established the hegemonic canons to overthrow the Yin court and implemented the *Three Winds* to govern the Zhou house?\n\nTherefore the sage establishes his foundation amid the principles of emperors and kings, responds to the mechanism within the shifts of hegemonic power, ordering the state and cultivating the self—here the *Five Thieves* are complete. Then all under heaven follow at the mere rustling of the wind, exhausting their natures and lives without harboring resentment or gratitude. This is called the *thief of the Way*, the *army without form*—alas, what bandit could be greater? When the *Five Thieves* reside in the heart and capture and release lie in the hand, nothing surpasses this for cultivating the self and aiding the world. The *Classic* says: “Those who perceive it prosper”—is this not fitting?\n\n**The Self**\nThe human heart is the master of the body, the palace of the hun-soul, the repository of the po-soul. When one intends to employ the *Five Thieves*, nothing surpasses the heart. In all undertakings, one must align with the Way of heaven. Thus, though the cosmos is vast, one surveys it as if in the palm of the hand; though the myriad things are numerous, life and death do not depart from the art. Then one realizes that heaven and earth are not to be prized for their remoteness or depth—how much less what lies before the ears and eyes?\n\n**The Mechanism**\nThe mechanism of killing is the sprout of the rise and fall of two dynasties, the omen of the life and death of ten thousand people. It arises in days when cloud and thunder are not yet harmonious, in times when the dark and yellow flow with blood. When heaven undergoes transformation, dragons emerge in the fields and serpents slither on the roads—this is the mechanism of battle, hence it is said: “Dragons and serpents rise from the land.” When humans undergo transformation, spring enforces autumn’s decrees, rewards the rebellious and punishes the loyal—this is the mechanism of collapse, hence it is said: “Heaven and earth are overturned.” The mechanisms of heaven and humanity arise simultaneously; though they undergo a thousand changes and ten thousand transformations, the mechanism of success or failure is already determined.\n\n**Concealment**\nThe benevolent must be courageous, but the courageous need not be benevolent; the wise can feign foolishness, but the foolish cannot feign wisdom. Thus, when the sage’s time is favorable, he displays his skill and builds his merit; when his time is unfavorable, he appears clumsy and obscures his traces. Thus Zhuge Liang’s preface says: “The Grand Duke at eighty did not lack opportunity—he was merely discerning about his lord.” Alas! The seasons of life’s skill and clumsiness, the circumstances of insight and concealment—these enable one to observe changes, perceive mechanisms, and wield the *Five Thieves*. The reason is this: the sage’s profound insight and far-reaching vision ensure that his actions never miss the mechanism. He observes heaven, assesses people, and acts in accord with the season. Thus the *Yijing* says: “He who knows advance and retreat, survival and demise, and does not lose his correctness—is this not the sage?”\n\n**Stillness**\nThe nine orifices: in heaven they are the nine stars, on earth the nine provinces, in humans the nine orifices. When the qi of the nine orifices is not upright, it is said to receive evil. Receiving evil, perception becomes biased; with biased perception, one cannot issue mechanisms or observe changes. Thus the urgency of the nine orifices lies in the *Three Essentials*. The Grand Duke said: “The ears, eyes, and mouth.” The ears, eyes, and mouth are the heart’s assistants, the gates and doors of the spirit, the pivot and trigger of wisdom, the fortune and misfortune of humans. Thus, ears without acuity cannot distinguish sounds; eyes without clarity cannot perceive mechanisms; mouths without measure cannot issue commands. If the *Three Essentials* are not refined, one cannot govern the state above or manage the household below—how much less command armies? Suspending human lives, determining the survival or demise of the state, in the space between stillness and motion, one cannot be without affairs—how could one employ them lightly?\n\n**Humanity**\nFire is born from wood; when fire erupts, it burns the wood. States are born from treachery; when treachery deepens, the state falls into chaos. It is like the silkworm that spins its cocoon—when the cocoon is complete, it kills itself. Humans create affairs; when affairs multiply, they harm their lives. None but the utmost sage can cultivate the self and refine conduct, preventing disorder before it sprouts and governing it before it descends into chaos. A tree of ten spans begins with a handful...",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1250,
      "start_sentence": 0,
      "end_sentence": 65,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.18899607658386,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\天机经.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "百仞之台，起於足下； 治小恶不惧，必成大祸。 呜呼，木不相摩，火无由出； 国无乱政，奸无由生。 有始有终，是非不动。 能知之，其惟圣人乎？ 安 万物盗天地之精以生成，人盗万物之形以御用，万物盗人之力以种植。 彼此相盗，各获其宜，俱不知为万物化。 故能用机者，法此三事，以道之盗而贼於物，物亦知为盗之道。 听以然者，贵得其时也，贵得其机也，故曰合其时而食，则百骸治，应其机而动则万化安。 乖时失机，则祸乱生也。 神 老君曰：功成不有，为而不恃。 此全生立德之本也。 夫小人者，贪其财则以身徇利，爱其名则以力争功，矜衒神迹而求神名，物共嫉之，必丧其命。 欲益招损，是不神矣。 夫君子建大功而不恃，防小祸於未萌，退己进人，推能让物，物共戴之； 故不夺其利。 自发神智，不能争物，物共让之，不居其后。 为损招益，是以至神矣。 故老君曰：为者败之，执者失之。 诚哉言也。 圣",
      "translated_text": "A terrace of a hundred *ren* begins with the ground beneath one’s feet; if one does not fear small evils, they will surely grow into great calamities. Alas! When wood does not rub against wood, fire has no way to emerge; when a state has no chaotic governance, treachery has no way to arise. That which has a beginning and an end remains unshaken in right or wrong. Who but the sage can truly know this?\n\n**Peace**\nAll things steal the essence of Heaven and Earth to take form and grow; humans steal the shapes of all things to use them; all things steal human strength to be cultivated. Each steals from the other, each gains what is fitting, yet none knows it as the transformation of the myriad things. Thus, those who wield the mechanism emulate these three affairs, employing the Dao’s theft to plunder things, while things, too, know the Dao of theft. That which is so arises from valuing the right time and seizing the right moment. Therefore, it is said: eating in accord with the season, the hundred bones are ordered; moving in response to the moment, the ten thousand transformations are at peace. To go against the time or lose the moment is to invite disaster and chaos.\n\n**Spirit**\nThe Old Master said: \"Having accomplished the work, one does not claim possession; acting, one does not rely on it.\" This is the root of preserving life and establishing virtue. As for the petty person, coveting wealth, they sacrifice themselves for profit; loving fame, they contend with force for merit. They boast of divine signs to seek a name as a spirit, and all things grow jealous of them—thus they surely lose their lives. Seeking gain, they invite loss; this is not spirit. The noble person builds great merit yet does not rely on it, guards against small disasters before they sprout, withdraws the self and advances others, defers to ability and yields to things—all things bear them up, and thus their advantage is not taken. They give rise to spirit and wisdom yet do not contend with things; all things yield to them, and they do not fall behind. Seeking loss, they invite gain—thus they attain the utmost spirit. Therefore, the Old Master said: \"Those who act fail; those who grasp lose.\" Truly, these are his words.\n\n**Sage**",
      "overlap_context": " is born from wood; when fire erupts, it burns the wood. States are born from treachery; when treachery deepens, the state falls into chaos. It is like the silkworm that spins its cocoon—when the cocoon is complete, it kills itself. Humans create affairs; when affairs multiply, they harm their lives. None but the utmost sage can cultivate the self and refine conduct, preventing disorder before it sprouts and governing it before it descends into chaos. A tree of ten spans begins with a handful...",
      "start_char": 1250,
      "end_char": 1625,
      "start_sentence": 66,
      "end_sentence": 89,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.951148509979248,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\天机经.txt",
        "category": "正统道藏太清部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "假如千年一圣，五百年一贤，应日月之数所生，而大小之人定矣。 夫大人出世，应明德而建圣功； 小人当时，则废正纲而生祸乱。 故太公说於西伯，知人望而己归； 周刘琨表於琅琊，识天时而未离； 晋陵母自死，知明主之必兴； 括母不诛，见赵军之必败。 故天道人事，贤者可以预知，佐非其人，夷於九族。 故《易》曰：长子帅师，开国承家； 小人勿用，必乱邦也。 命 夫成败之道未形，死生之机未发，小人能见，君子能知，则易见而难知，见近而知远也。 夫见机者则趋时而就利，皆不保其天年。 知机者则原始而要终，固必全其性命。 倍 瞽者善听，神不离於耳； 聋者善视，心不离於目。 其为听也，神则专耳； 其为视也，心则专目。 耳之与目， 递为用师，当用之时，利绝其一。 心之所主，则无事不精，犹有十倍之利，何况反覆？ 以此用之三思，精诚一计，顺时隐显，应机行藏。 以此用师，固万倍之胜利。 物 夫人之心无故不动，生之与死，缘物而然。 物动则心生，物静则心死。 生死之状，其惟物乎？ 目 目者神之门，神者心之主，神之出入，莫不游乎目。 故见机者，莫不尚乎目； 能知机者，莫不尚乎心。 蠢然 夫道不为万物而生春，万物感春炁而自生； 秋不为万物而杀，万物感秋炁而自杀。 其为生也、不恃其恩，不求其报？ 故其恩大矣； 其为杀也，不恃其威，不求其惧，其威大矣。 凡物取而得之者小，不取而得之者大，故圣人不取。 夫君王有道无道，财人民治乱之机； 歌谣或乐或哀，则时年丰俭之兆。 时人不能省察，天地乃降征祥，或五云腾起，七曜变行，皆因国风，是以然矣。 且宋君失德，荧惑守心； 及乎谢愆，退之三舍。 用今俦古，皎在目前； 以彼喻斯，岂劳心术？ 故智者悟於人事之初，而愚者晦於星象之后矣。 生 老君以无为有母，静为躁君。 夫静者，元炁未分之初，形於元炁之中，故能生天地万物。 亦犹人弘静，其心不挠，则能生天下万物也。 胜 胜，浸长也。 天地之道，各自浸长，天则长阳也，地则长阴也。 阴阳相招，一昼一夜，递为君臣，更相制胜，故曰阴阳相胜。 夫开国用师，必侵天道，亦犹金火相交，而非交不伏也。 天且弗违，而况於人乎？ 顺 《易》曰：刚柔相摩而生变化。 变化不慝，故曰顺也。 夫人之育身治性，尚不可逆时为之，而况经邦佐世之雄哉？ 契 至圣之道，窈然无为。 无为则无机，无机则至静。 夫律历之妙，动则能知，体既虚无，，莫得施其管。 术亦犹兵者，不失其机，不露其衅，虽有智士，从何制焉？ 象 奇器者，阴阳之，故能生万物，亦犹人心，能造万事，象矣。 进前，象状也。 八卦、六甲，鬼神机密之事，刚柔相制之术，昭昭乎前列其状矣。 阴符天机经竟",
      "translated_text": "Should a sage appear once in a thousand years, a worthy once in five hundred—such is the measure of their arising by the reckoning of sun and moon, and thus the great and small among men are determined. When a great person emerges in the world, they respond to luminous virtue and establish sagely merit; when a petty person holds sway in their time, they abandon the proper norms and give rise to calamity and disorder. Thus, the Grand Duke spoke to the Earl of the West, knowing the people’s hopes and returning to him; Zhou’s Liu Kun addressed the court from Langye, discerning the signs of the times yet not departing; the mother of Jinling took her own life, foreseeing that a bright lord would surely rise; the mother of Gua did not seek execution, seeing that the Zhao army would surely fail. Thus, the Way of Heaven and the affairs of men may be foreknown by the worthy. If one assists an unfit ruler, one is destroyed along with the nine clans. Therefore, the *Book of Changes* says: “The eldest son leads the army and founds a state to sustain the family; do not employ petty men, for they will surely throw the realm into chaos.”\n\nBefore the course of success or failure takes shape, before the pivot of life and death is set in motion, the petty man may see it, while the noble person may know it—thus, seeing is easy and knowing is difficult; seeing concerns the near, while knowing extends to the far. Those who see the pivot act swiftly to seize the moment and gain advantage, yet none preserve their allotted years. Those who know the pivot trace beginnings to their ends and thus surely preserve their nature and life.\n\nThe blind excel in hearing, for their spirit does not stray from the ear; the deaf excel in sight, for their heart does not stray from the eye. In hearing, their spirit concentrates on the ear; in seeing, their heart concentrates on the eye. Ear and eye alternate as masters in their use, and when one is employed, its advantage eclipses the other. What the heart governs, no task fails to perfect—this yields a tenfold advantage, how much more so when applied in alternation? Employing this threefold reflection, with single-minded sincerity and a plan attuned to the times, one conceals or reveals, acts or withdraws in response to the pivot. Using this to command an army ensures victory a myriad times over.\n\nThe human heart does not stir without cause: life and death arise in response to things. When things move, the heart stirs; when things are still, the heart is stilled. Is not the form of life and death found in things alone?\n\nThe eye is the gate of spirit, and spirit is the lord of the heart. Spirit’s comings and goings all roam through the eye. Thus, those who see the pivot all esteem the eye; those who know the pivot all esteem the heart.\n\nThe Dao does not bring forth spring for the sake of the myriad things—things feel spring’s *qi* and arise of themselves. Autumn does not bring death for the sake of the myriad things—things feel autumn’s *qi* and perish of themselves. In giving life, it does not rely on its grace nor seek repayment—thus its grace is great. In bringing death, it does not rely on its might nor seek fear—thus its might is great. What is taken and obtained is small; what is not taken yet obtained is great. Therefore, the sage does not take.\n\nWhether a lord of men possesses the Dao or lacks it is the pivot of wealth, the people, order, and disorder. Whether songs and ballads are joyful or mournful is the omen of years of plenty or scarcity. When people fail to examine and perceive, Heaven and Earth send down portents: now five-colored clouds rise, now the seven luminaries alter their courses—all in response to the winds of the state, and thus it is so. When the lord of Song lost virtue, Mars lingered at the Heart; when he repented his faults, it retreated three lodges. Applying the present to the past is as clear as before one’s eyes; using that to illustrate this—does it tax one’s thoughts? Thus, the wise awaken to the beginnings of human affairs, while fools remain benighted until after celestial signs appear.\n\nThe Old Master took non-being as the mother of being, stillness as the lord of restlessness. Stillness is the state before primal *qi* divides, its form within primal *qi*—thus it gives birth to Heaven, Earth, and the myriad things. It is like a person of vast stillness whose heart is unperturbed, and thus can give birth to the myriad things under Heaven.\n\nVictory is gradual growth. The Way of Heaven and Earth each grows gradually: Heaven grows the yang, Earth grows the yin. Yin and yang summon one another, alternating day and night as lord and minister, each overcoming the other in turn—thus it is said that yin and yang overcome one another. When founding a state or deploying an army, one must encroach upon the Way of Heaven, just as metal and fire contend, and without contention, neither is subdued. If even Heaven does not oppose this, how much less should men?\n\nThe *Book of Changes* says: “The firm and yielding grind against each other and give rise to change.” Since change is not perverse, it is called “following.” In nurturing the body and cultivating one’s nature, one must not act against the times—how much less should the heroes who order the state and assist the age?\n\nThe Way of the utmost sage is profound and without action. Without action, there is no pivot; without pivot, there is utmost stillness. The subtlety of pitch pipes and calendars lies in their movement, yet when their substance is emptiness and nothingness, no instrument can be applied. It is like warfare: one does not miss the pivot nor reveal the breach, so that even the wise have no means to control it.\n\nExtraordinary devices belong to yin and yang, thus they give birth to the myriad things—just as the human heart can create the myriad affairs, it is their image. Advancing forward is the image’s form. The eight trigrams, the six jia, the secrets of ghosts and spirits, the arts of firm and yielding restraining one another—all are arrayed clearly before us in their forms.\n\n*The Scripture of Heaven’s Mechanism and the Yin Talismans* concludes.",
      "overlap_context": "t, guards against small disasters before they sprout, withdraws the self and advances others, defers to ability and yields to things—all things bear them up, and thus their advantage is not taken. They give rise to spirit and wisdom yet do not contend with things; all things yield to them, and they do not fall behind. Seeking loss, they invite gain—thus they attain the utmost spirit. Therefore, the Old Master said: \"Those who act fail; those who grasp lose.\" Truly, these are his words.\n\n**Sage**",
      "start_char": 1625,
      "end_char": 2713,
      "start_sentence": 90,
      "end_sentence": 160,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 29.666691541671753,
      "metadata": {
        "source_file": "dao\\正统道藏太清部\\天机经.txt",
        "category": "正统道藏太清部"
      }
    }
  ]
}