{
  "source_id": "天老神光经",
  "source_file": "chunked_daozang\\天老神光经.json",
  "total_chunks": 8,
  "total_original_chars": 4659,
  "total_translated_chars": 28010,
  "total_translation_time": 125.55971145629883,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\方法类\\天老神光经.txt",
    "category": "方法类"
  },
  "full_translation": "*The Celestial Elder’s Divine Radiance Scripture*\n\n**Scripture Title:** *The Celestial Elder’s Divine Radiance Scripture*. Composed by Su Deng of the Song Dynasty. One fascicle. Source text: *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, Methods Category.\n\n**Memorial on the Celestial Elder’s Divine Radiance Scripture**\n\nYour subject has heard that when man cannot perceive form, he relies on water as a mirror. When affairs cannot be foreseen, their omens are made clear. Though divination by milfoil and fire is insubstantial, it still requires concentrated intent. Though a water mirror is limpid, it depends on the eye to take form. Thus, form is discerned through the eye to perceive the subtle, and omens are observed through understanding to behold the wondrous. When such matters are fully grasped, what can be imitated? If even one aspect is lacking, it becomes difficult to rely upon.\n\nYour subject’s nature is dull, his skills meager, and his arts shallow. Yet, having cursorily perused extraordinary texts, he has gleaned their essentials. For instance, in matters before one’s eyes—determining distance, discerning right and wrong, distinguishing blue from yellow, knowing good from evil, observing the celestial patterns above, measuring human sentiments in the middle, and examining the earthly configurations below—all these depend on the radiance within the eye. If one can perceive it, when marching to battle, departing with troops, or traversing land and water, the *qi* beneath the eyes turns dark. If the radiance departs from the eyes, calamity arrives at once. Then, above, one cannot see the auxiliary stars; in the middle, one cannot distinguish kin from stranger; below, one cannot observe the myriad things. This is the departure of divine radiance, and one will fail to perceive these wonders. In the face of disaster, how could one not err?\n\nThere is a saying: amid darkness and obscurity, if one can preserve the divine radiance in the corners of the eyes and observe the auxiliary stars at *Wuqu*, then there is no need for divination by milfoil or fire. Fortune and misfortune are foreknown; before weapons clash, victory or defeat is already clear. Its text is concise and easy to teach; its principles are refined and easy to comprehend. Thus, one may avoid peril and attain safety, transform misfortune into blessing.\n\nIt is known that when Emperor Gaozu’s heart stirred, he swiftly evaded the pursuer’s plot. When Zhao Xiang’s horse startled, he instantly recognized the assassin’s guise. Since ancient times, the wise and sagacious have all revered Master Kuang. Jin Ping and Zhang Liang received the essentials of the Yellow Stone. This transmission has circulated through the ages, its history long and deep. Yet, the text may contain errors, and its language may be prolix.\n\nYour humble servant, in his presumption, has arranged and compiled this into a single scroll, entitled *The Celestial Elder’s Divine Radiance*, which he respectfully presents to the imperial court. Your servant is well aware that Your Majesty’s sagely mind is luminous and penetrating, mastering the subtlest principles. Yet, I now dare to submit this, though it may burden Your Majesty’s ears with its prolixity. I fear Your Majesty may deem these trifling matters unworthy of acceptance. Yet, if Your Majesty’s august heart might indulge this humble servant’s foolish candor, I truly believe it offers protection. In times of peril and hardship, none should be without this Way. It ensures self-preservation and, when facing matters, reveals fortune or misfortune in advance. Thus, I have examined it in detail, not disdaining the humble offering of a rustic. With unwavering loyalty and devotion, I risk death to present this memorial, humbly submitting it for Your Majesty’s consideration.\n\nYour servant is filled with awe and trepidation, guilty of transgression, guilty of transgression. Respectfully submitted.\n\nOn a day in the seventh year of the Zhenguan era, your servant Li Jing, Right Vice Director of the Imperial Secretariat and Duke of Weiguo, presents this memorial.\n\n---\n\n*The Scripture of the Celestial Elder’s Divine Radiance*\nCompiled by Li Jing, Right Vice Director of the Imperial Secretariat and Duke of Weiguo\n\nDuke Jinping asked Master Kuang: \"When a man sets out on a journey or leads troops into battle, are victory or defeat, life or death, truly foreknowable?\"\nMaster Kuang replied: \"One must observe the auxiliary stars beside the Northern Dipper. If, when preparing for battle, these stars are not visible at dusk, the expedition must not proceed—it is greatly inauspicious. If they are absent due to illness, the appointed time of death draws near.\"\n\nDuke Jinping asked: \"When the sky is overcast and the stars are unseen, how can one discern fortune or misfortune?\"\nMaster Kuang replied: \"If the stars are not visible, one must observe the divine radiance. Without this radiance, no reckless action should be taken.\"\n\nDuke Jinping asked: \"What is this divine radiance?\"\nMaster Kuang replied: \"It constantly resides within the eye. In dark places, press a finger into the corner of the eye and shake the head—if the auxiliary stars appear, they may be seen. If, when many look together, one alone cannot see them, the auxiliary star has departed, and great misfortune is certain. If a person’s illness prevents them from seeing it, death will come within seven days. This Way is subtle and profound, a vision of unique clarity.\"\n\nDuke Jinping said: \"Excellent!\"\n\nHaving inscribed these words upon jade tablets and sealed them in a case, he would often unroll and peruse them.\n\nThe Yellow Emperor said: \"When the heart stirs and the eyes flicker, one may foreknow the fortune or misfortune of life and fate. The brightness of Heaven is discerned through the sun, moon, and Dipper. The brightness of man is discerned through the eyes, with the heart as its master. If one can comprehend this, one may preserve the body and safeguard life. The spirit of the nose and eyes converges in the heart, and thus one must first observe and examine it. When the heart stirs, the eyes flicker, and the nose grows sour—if the divine radiance departs, great misfortune follows.\n\nShould one wish to detect thieves or traitors, one must attend to the divine radiance. If the radiance is greenish-white, the person is a traitor. If it is black, the person is a thief.\n\nIn all travels, when the heart stirs, the eyes flicker, and the nose grows sour, one must immediately attend to the divine radiance. If the radiance departs, there is a thief ahead. With each flicker of the eye, a *li* ahead there is surely a thief—one must prepare accordingly.\n\nWhen journeying to another town and wishing to lodge, first attend to the divine radiance. If there is no radiance, do not enter the dwelling, for there will surely be sorrow.\n\nMaster Kuang said: \"If the radiance is yellow or red and round, there is virtue and joy. If it is white, there are hidden soldiers and mourning among the people. If it is green and incomplete, there is sorrow. If it is a single *li* in size, there are thieves, illness, or soldiers.\n\nIf, while dwelling there, one sits or lies uneasy, attend to the divine radiance at once. If it does not appear, depart swiftly.\n\nWhen sleeping at night and wishing to know good or ill fortune, one may attend to the divine radiance.\n\nFor those about to wage war, first observe the celestial signs above, then distinguish the divine radiance within. If one wishes to cross water, one should attend to it—if it does not appear, one must not cross. If one sets out on a journey and it does not appear, one must not proceed. If it does not appear when approaching food, one must not eat.\n\nWhen about to eat or drink, if the heart stirs, the nose grows sour, the eyes flicker, and the radiance departs—one’s companions intend harm; beware. If the tongue stirs, the lips flicker, and the radiance departs, a son intends to kill his father, or a servant to kill his master. If the heart stirs, the navel flickers, and the radiance departs, a son intends to harm his father. If the heart stirs, the radiance departs, and the elbow flickers, a concubine is the thief. If the heart stirs, the palm flickers, and the radiance departs, the thief is a relative. If the heart stirs with alarm and the radiance departs, a younger brother intends to harm his elder. If the heart stirs and the right foot flickers, the journey will be profitable. If the left foot flickers, there is trouble in the public sphere. If the heart stirs, the cheek flickers, and the radiance departs, the thief is a friend. If the heart stirs, the eyes flicker, and the radiance departs, a wife or concubine is having an affair and intends harm. If the heart stirs and the radiance departs, leave the dwelling at once.\n\nAgain, attend to the divine radiance: if the left eye has radiance, the left path is open. If the right eye has radiance, the right path is open. If both eyes have radiance, one may proceed. If the heart stirs with disquiet, avoid conflict above and below, for there will be strife.\n\nIf the eyes have no radiance and the ears ring without cause, one sitting must rise swiftly, one walking must flee—someone intends harm. This is the spirit and soul concealed in the ears.\n\nIf the left eye flickers, it concerns one’s own affairs. If the right eye flickers, it concerns another’s affairs. If the nose grows sour and the ears ring, strange sorrows will soon arrive.\n\nFor the noble scholar, five days before death, the radiance departs, and the *po* soul also departs. For ordinary people, the *hun* soul is stored in the nose, the *po* soul in the mouth, and thus they unite with the body. The divine radiance emerges from the eyes, and essence and *qi* unite with the spirit. Wherever it departs, one must carefully divine its meaning.\n\nIn ancient times, when the Yellow Emperor was about to pass, his radiance departed ten days prior. For the Zhou and Confucius, it was five days. For recent martyrs, it was but three. The radiance is stored in the eyes, the voice in the ears, and the essence in the yin. When the appointed time draws near, how can one not be present?\"\n\nIf the ears hear no sound, the eyes emit no radiance, and the yin does not stir, the malevolent master approaches—follow the light to evade it, and great fortune shall be yours.\n\nQibo said: In a dimly lit place, cover your eyes with your hands and visualize the divine radiance. If it appears green, there is cause for concern; white, it portends warfare; red, virtue; yellow, joy; and if it bears a dark hue, misfortune follows.\n\nLiu Gen said: A white radiance may also signify virtue.\n\nOn *jia-yi* days, the eyes govern; on *bing-ding* days, the heart; on *wu-ji* days, the abdomen; on *geng-xin* days, the back; and on *ren-gui* days, the heels. On these days, if the heart stirs, the eyes flicker, or the radiance manifests, take heed. If none appear, an assailant may be plotting against you—prepare your defenses.\n\nOn *jia-yi* days, if the heart stirs, the assailant will be small and slender, with a sallow complexion and a fondness for speech. On *bing-ding* days, if the heart stirs, the assailant will be robust, ruddy-faced, with disheveled hair and broad cheeks. On *wu-ji* days, if the heart stirs, the assailant will be plump like a rat, with a large belly, silent, and yellow-haired. On *geng-xin* days, if the heart stirs, the assailant will have broad brows and a large nose, and be garrulous. On *ren-gui* days, if the heart stirs, the assailant will be tall with a small head, of a dark hue, and fond of hunting and fishing. If you prepare accordingly, all affairs will succeed, you will evade warfare and harm, and Heaven itself will grant you favor.\n\nStore the radiance between the brows once every five days to prolong life. If you hear a solitary voice, it will cause ringing in the ears. When the spirit and essence are unsettled, the infant soul is greatly startled, sorrow and melancholy arise, and the desire to return to Heaven grows. Strike your ears with your hands, and the infant soul will return. When the ears ring, immediately visualize the divine radiance.\n\nThe Yellow Emperor’s essential secret ensures the preservation of life and body. Whenever one hears ringing in the ears—whether cries, wails, shouts, thunder, or drumming—or detects a foul, fishy odor in the nose, all portend misfortune. One should purify oneself with fasting and bathing, then at dusk face the natal star and perform the *Yu Step* three times, calling out: *\"Jumen Shenzi, Qingmen Shenzi, Lucunzi, Hucuozi, Hengbuyunzi, Bazhizi, Daguizi.\"* By reciting this method, no calamity shall befall you. If danger arises, call upon the name of your governing star, saying, *\"Come to my aid,\"* three times and stop.\n\nThe first, at *wu*, belongs to *Pojun*; the second, at *si* and *wei*, to *Wuqu*; the third, at *shen* and *chen*, to *Lianzhen*; the fourth, at *mao* and *you*, to *Wenqu*; the fifth, at *yin* and *xu*, to *Lucun*; the sixth, at *chou* and *hai*, to *Jumen*; and the seventh, at *zi*, to *Tanlang.*\n\n**The Yu Step Method**\nLaozi said: Wherever one resides, one should visualize the radiance and observe the *Fuxing* star—the small star beside *Wuqu*. Seeing it brings good fortune; failing to see it brings misfortune, though one may still secure a hundred days of safety. If seen, there will be no official disasters, slander, illness, or death within a hundred days—hence it is called *preserving a hundred days*. If the sky is overcast and the *Fuxing* star is not visible, visualize the radiance in darkness. If still unseen, carefully search the four directions for it. By regularly visualizing it at dawn and night, one attains longevity.\n\n**The Heavenly Deity’s Covering Dipper Spirit Incantation** safeguards the body and protects life, granting a century of honor and longevity. Do not transmit it to the unworthy.\n\nThe incantation reads:\n*\"Round and round, I report to the four directions, Heaven and Earth, the sun and moon. On this path I traverse, swiftly seize the Ghost King. Bind and restrain every person, capture the fierce and perverse. Before I awaken, they shall not disperse. With a myriad of qilin troops, scatter them to the five directions. I respectfully invoke the twenty-eight stellar officials and the thirty-five star chiefs—descend swiftly and stand beside your servant for years. Reverse the talismans of rebellious ghosts, intercept and suppress all omens. The stellar officials, covering the Dipper, bind the traitors in reverse. Speak swiftly, swiftly, swiftly, swiftly—then cover the Dipper. One step, one star: *Qianyuan, Hengli, Zhen.* □□□□□□□. Proclaim to the Mysterious Diagram.\"*\n\nGreat is the Dao of Heaven, its patterns manifest yet beyond the grasp of mere wisdom. Since ancient times, those who understood it flourished in the Way, while those who did not perished—how much more so for ordinary mortals. Yet I, undeterred by my limited strength, have measured my virtue and inscribed it upon my heart, forsaking form to delve into the profound and subtle. I have compiled these into diagrams and records, as if arrayed upon my palm. Follow this path, and utmost sincerity will surely evoke response.\n\nPositions and seating are meticulously arranged, each detail duly recorded. Future noble ones, treasure and safeguard this, passing it to later generations, but never reveal it to the foolish or unworthy. What is attained here does not come from external seeking, nor does cultivation depend on others. As the *Yin Fu Jing* states: *\"The cosmos lies within the hand; the myriad transformations arise from the body.\"*\n\nIn all, there are eighty-three thousand one hundred stars by day and three thousand one hundred stars by night, with eighty thousand stars visible in the night sky. Among the four Dipper stellar officials, three are on duty each night beneath the Northern Dipper.\n\nTo petition the Celestial Star (Qian Star) for an audience with the Most Exalted, the second day of the lunar month under the *Ya* constellation is most auspicious. Prepare one sheet of paper money, seven sheets of petition paper, three platters of dried venison, three cups of wine, seven lamps, one stick of incense, and arrange them in a single row facing north.\n\nHerein, I respectfully invoke the Celestial Star Official to descend and receive these humble offerings, in answer to my sincere devotion. Respectfully submitted.\n\nTo petition the Li Star for deliverance from peril and support in crisis, the *Cheng* day’s *Hai* hour is most auspicious. Prepare nine lamps, one stick of incense, five bowls of *botuo*, and five cups of milk. Arrange them in three rows.\n\nHerein, I respectfully invoke the Li Star Official to descend and graciously accept this sincere offering, that peril may be averted and distress relieved. Respectfully submitted.\n\nTo petition the Bing Star for blessings, the *You* day’s *Shen* hour is most auspicious. Prepare two bowls of rice with spoons and chopsticks, two cups of wine, two platters of assorted meats, five sheets of petition paper, one brush, and one lamp.\n\nHerein, I respectfully invoke the Bing Star Official to descend and receive this humble offering, that blessings and favor be bestowed. Respectfully submitted.\n\nTo petition the Ping Star for the suppression of enemies, the *Wei* day’s *Chou* hour is most auspicious. Prepare seven cups of wine, one stick of incense, three sheets of paper money, two lamps, and seven bowls of rice.\n\nHerein, I respectfully invoke the Ping Star Official to descend and receive these offerings, that enemies be pacified and peril turned to safety. Respectfully submitted.\n\nTo petition the Yin Star Official for victory in attack or battle, the *Ding* day’s *Zi* hour is most auspicious. Prepare three cups of wine, three sticks of incense, one sheet of paper money, three platters of mutton, and nine lamps.\n\nHerein, I respectfully invoke the Ming Star Official to descend and graciously accept these offerings, that attacks be certain of success and strikes assured of swift victory. Respectfully submitted.\n\nTo petition the Chu Star for unobstructed journeys, the *Ding* day’s *Chen* hour is most auspicious. Prepare two cups of wine, two portions of meat and rice, three sheets of petition paper, one sheet of paper money, two lamps, and one stick of incense.\n\nHerein, I respectfully invoke the Chu Star Official to descend and take seat, that all paths be free of hindrance and journeys unimpeded. Respectfully submitted.\n\nTo petition the Ding Star for household peace and protection, the *Ping* day’s *Xu* hour is most auspicious. Prepare five skewers of roasted mutton, five cups of wine, five sheets of petition paper, one sheet of paper money, one lamp, and one stick of incense.\n\nHerein, I respectfully invoke the Ding Star Official to descend and receive these offerings, that the household be secure, blessings abundant, and life prolonged. Respectfully submitted.\n\nTo petition the Rui Star for dream revelations, the *Tian She* day’s *Hai* hour is most auspicious. Prepare seven cups of wine, seven platters of dried venison, seven sheets of petition paper, two feet of red silk, seven sheets of paper money, two lamps, and one stick of incense.\n\nHerein, I respectfully invoke the Rui Star Official to respond to dreams of the worthy and sagely, that fortune and rank be granted. Respectfully submitted.\n\nTo petition the Yuan Star for high office, the *Ji Si* day’s *Si* hour is most auspicious. Prepare three platters of milk, small amounts of assorted silks, one sheet of paper money, three sheets of paper, three brushes, one stick of incense, and two lamps.\n\nHerein, I respectfully invoke the Yuan Star Official to descend and receive these offerings, that official service be pure and auspicious, and every word spoken be efficacious. Respectfully submitted.\n\nTo petition the Zheng Star for contentment of the heart’s desires, the *Ren Wu* day’s *Chou* hour is most auspicious. Prepare four bowls of milk porridge, four platters of assorted fruits, four cups of wine, and four each of incense and lamps.\n\nHerein, I respectfully invoke the Zheng Star Official to descend and receive these offerings, that all aspirations be fulfilled. Respectfully submitted.\n\nTo petition the Xian Star Official for official appointment and fame, the *Bing Zi* day’s *Hai* hour is most auspicious. Prepare one portion of rice, one bundle of paper money, one sheet of petition paper, one each of incense and lamp, and one brush.\n\nHerein, I respectfully invoke the Xian Star Official to descend and receive these offerings, that petitions for office be answered and quests for fame be realized. Respectfully submitted.\n\nTo petition the Yue Star for hidden virtue, the *Yin* day’s *Zi* hour is most auspicious. Prepare three cups of wine, four sheets of petition paper, three feet of white silk, three portions of plain rice, one stick of incense, fifteen sheets of paper money, and one lamp.\n\nHerein, I respectfully invoke the Yue Star Official to descend and receive these offerings, that all prayers be answered. Respectfully submitted.\n\nTo petition the Fu Star for the well-being of the lowly, the *Chen* day’s *Xu* hour is most auspicious. Prepare seven cups of milk, one lamp, thirteen sheets of paper money, and one stick of incense.\n\nHerein, I respectfully invoke the Fu Star Official to descend and receive these offerings, that the humble be granted fortune and longevity. Respectfully submitted.\n\nTo petition the Tai Bai Star for regional governorship, any day may be used, though *Shen* and *You* days are most efficacious. Prepare one sleeveless undershirt, one robe, one pair of trousers without a waistband, one pair of socks, and one pair of shoes—all to be made in the size of a three-year-old child.\n\nHerein, I respectfully invoke the Tai Bai Star Official to descend and receive the aforementioned items along with food, wine, and milk, that petitions for official rank be certain of fulfillment. Respectfully submitted.\n\nA full bowl of wine and a full bowl of milk, a bowl of lamp-oil porridge and a bowl of rice, a coin’s worth of lamp-oil cakes (additional offerings at one’s discretion), twenty sheets of petition paper, and three sticks of incense.\n\nArrange the above items according to the diagram, placing each offering precisely where the characters are drawn. Ensure utmost cleanliness; do not allow swine, dogs, or any foul-smelling substances to be present. The arrangement must be meticulous—thus shall all petitions be fulfilled.\n\nFor those unfamiliar with the rites, a ready-made petition text is provided below as a model.\n\nInvocation to the Ten Directions and all enlightened, responsive deities:\n\nOn the [day] of [month] in the year [year], your disciple [name], of [prefecture, county, village], respectfully presents this offering of paper money to the [Star Official’s name] at [location], beseeching [specific blessing].\n\nNow, as incense is kindled, I humbly invoke the divine presence to descend. May my petition ascend before the [Star Official’s name]. Taking up the blade, I declare the purification:\n\nI reverently summon the true qi of the Azure Dragon of the East into my water.\nI reverently summon the true qi of the Vermilion Dragon of the South into my water.\nI reverently summon the true qi of the White Dragon of the West into my water.\nI reverently summon the true qi of the Black Dragon of the North into my water.\nI reverently summon the true qi of the Yellow Dragon of the Center into my water.\n\nI reverently summon the nine Wood Officials of the East to dispel impurity.\nI reverently summon the three Fire Officials of the South to dispel impurity.\nI reverently summon the seven Metal Officials of the West to dispel impurity.\nI reverently summon the five Water Officials of the North to dispel impurity.\nI reverently summon the twelve Earth Officials of the Center to dispel impurity.\nI reverently summon the twelve Heavenly and twelve Earthly Officials to dispel impurity.\n\nI reverently summon the Jade Lads of Purification, the Jade Maidens of Cleansing, and the Fragrant Water Messengers to dispel all impurities—those of heaven, earth, humanity, ghosts, sunken corpses, and bleached bones. Whatever the eye sees or the ear hears, let great impurities return to the sea and minor impurities to the rivers, without delay. Delay shall bring death to those who resist my divine qi; defiance shall bring destruction. Any impurity that remains shall be severed and delivered to the Kui and Wang spirits.\n\nSwiftly, swiftly, in accordance with the law!\n\nKnead the incense three times.\n\nUpon completing the incense offering, declare:\nFirst incense offering to the Southern Dipper Star Official.\nSecond incense offering to the Northern Dipper Star Official.\nThird incense offering to all enlightened beings of the Ten Directions.\n\nI humbly invoke the [Star Official’s name] to descend in compassion, receive these humble offerings, and accept this incense and wine. Bow twice.\n\nI have heard that in the profound mysteries of the unseen, petitions must evoke a response. With this written petition, I now submit my plea. Read the petition aloud three times, then burn the paper money and scatter the fruits. Bow twice and pray:\n\nMay all attending officials partake in this grace and share in this joy.\n\nThough I am lowly and my offerings meager, I am honored by your descent. Overwhelmed with reverence and awe, I beseech you to accept my plea and record my sincerity.\n\nIn my ignorance, I am unversed in proper rites. My words may be disorderly, offending your divine majesty. I beg your forgiveness and grant my wishes as requested. Bow twice and bid farewell.\n\nPrayer to the deities:\n\nFirst incense offering to the Southern Dipper Star Official.\nSecond incense offering to the Northern Dipper Star Official.\nThird incense offering to all enlightened beings.\n\nJade radiance scatters light; golden censers rise with smoke.\nFragrant clouds weave densely, ascending to the Nine Heavens.\nThe Jade Maiden of Incense attends, bearing word to the Celestial Emperor.\nGrant me long life, that I may forever be a true immortal.\nAll petitions and pleas, I beseech you to fulfill as spoken.\n\nAlternatively:\n\nThough I dwell in humble obscurity, I seek the Dao and yearn for the divine.\nEver beholding your august presence, I pray for eternal life.\nOne hundred and twenty years, free from all disasters and pestilence.\nFrom failure, grant success; from peril, safety; from death, life.\nMay my dwelling be auspicious, my family peaceful.\nOn the day my wishes are fulfilled, I shall prostrate in boundless devotion and joy.\n\nNext, read the petition three times.\nRecite the Northern Dipper Mantra seven times.\n\nI humbly invoke the [Star Official’s name] to descend in compassion and receive these humble offerings.\n\nI have heard that in the profound mysteries of the unseen, petitions must evoke a response. With this written petition, I now submit my plea. Burn the paper money and petition, pour the wine, and scatter the fruits.\n\nMay all attending officials partake in this grace and share in this joy.\n\nThough I am lowly and my offerings meager, I dare to present them. Honored by your descent, I am filled with awe. I beseech you to accept my plea and record my sincerity.\n\nIn my ignorance, I am unversed in proper rites. My words may be disorderly, offending your divine majesty. I beg your forgiveness and grant my wishes as requested. Bow twice and bid farewell.\n\nPosition the altar with the *jian* day at the back and the *po* day at the front, facing the Dipper.\n\nIn a major-month, place the thumb upon the front of the waist, then advance the left foot first, stepping to activate the mound’s power. In a minor-month, place the little finger upon the front of the waist, then advance the right foot first, stepping to activate the mound’s power. In a major-month, the Yu Step begins with the left—*Tianlao Shen Guang Jing* concludes.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "天老神光经 经名：天老神光经。 宋苏登撰。 一卷。 底本出处：《正统道藏》洞神部方法类。 天老神光经表 臣闻人不见形，凭诸水鉴。 事不可预，明其箝兆。 蓍灼是虚，尚假精意。 水鉴虽彻，资其目成。 故形以目窥而见微，兆以识察而观妙。 斯事毕举，孰可仿之。 如有一阙，则难依据。 臣性识愚，劣艺术浅。 薄览於异书，颇知至要。 只如目前者，定近远，察是非，辩青黄，知善恶。 上观乾象，中测人情，下鉴坤维。 斯等，莫不皆由目中光也。 若能见之，战斗出军涉水陆，即目下炁黑。 若光去目，患难立至。 则上不能见辅星，中不能辩亲疏，下不能观万物。 此神光去矣，其不睹斯妙。 临患之时，夫何悮哉。 颇有云：为兼以昏晦，若能存神光於目眦，察辅星於武曲，则不劳蓍灼。 休咎预分，未接兵戈，前知胜负。 其文省而易教，其理精而易通。 固可以去危就安，转祸为福。 是知高祖心动，卒兔迫人之谋。 赵襄马惊，悬知刺客之状。 古来贤哲，皆宗师旷。 晋平张良，受黄石之要。 此乃传行世代，历载既深。 文字或谬，语有其繁。",
      "translated_text": "*The Celestial Elder’s Divine Radiance Scripture*\n\n**Scripture Title:** *The Celestial Elder’s Divine Radiance Scripture*. Composed by Su Deng of the Song Dynasty. One fascicle. Source text: *Daoist Canon of the Zhengtong Era*, *Dongshen* Section, Methods Category.\n\n**Memorial on the Celestial Elder’s Divine Radiance Scripture**\n\nYour subject has heard that when man cannot perceive form, he relies on water as a mirror. When affairs cannot be foreseen, their omens are made clear. Though divination by milfoil and fire is insubstantial, it still requires concentrated intent. Though a water mirror is limpid, it depends on the eye to take form. Thus, form is discerned through the eye to perceive the subtle, and omens are observed through understanding to behold the wondrous. When such matters are fully grasped, what can be imitated? If even one aspect is lacking, it becomes difficult to rely upon.\n\nYour subject’s nature is dull, his skills meager, and his arts shallow. Yet, having cursorily perused extraordinary texts, he has gleaned their essentials. For instance, in matters before one’s eyes—determining distance, discerning right and wrong, distinguishing blue from yellow, knowing good from evil, observing the celestial patterns above, measuring human sentiments in the middle, and examining the earthly configurations below—all these depend on the radiance within the eye. If one can perceive it, when marching to battle, departing with troops, or traversing land and water, the *qi* beneath the eyes turns dark. If the radiance departs from the eyes, calamity arrives at once. Then, above, one cannot see the auxiliary stars; in the middle, one cannot distinguish kin from stranger; below, one cannot observe the myriad things. This is the departure of divine radiance, and one will fail to perceive these wonders. In the face of disaster, how could one not err?\n\nThere is a saying: amid darkness and obscurity, if one can preserve the divine radiance in the corners of the eyes and observe the auxiliary stars at *Wuqu*, then there is no need for divination by milfoil or fire. Fortune and misfortune are foreknown; before weapons clash, victory or defeat is already clear. Its text is concise and easy to teach; its principles are refined and easy to comprehend. Thus, one may avoid peril and attain safety, transform misfortune into blessing.\n\nIt is known that when Emperor Gaozu’s heart stirred, he swiftly evaded the pursuer’s plot. When Zhao Xiang’s horse startled, he instantly recognized the assassin’s guise. Since ancient times, the wise and sagacious have all revered Master Kuang. Jin Ping and Zhang Liang received the essentials of the Yellow Stone. This transmission has circulated through the ages, its history long and deep. Yet, the text may contain errors, and its language may be prolix.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 420,
      "start_sentence": 0,
      "end_sentence": 32,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 13.241748809814453,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\天老神光经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "臣窃不自揆，辄次之，以此成一轴，号曰《天老神光》，谨进於阙庭。 臣熟知陛下圣虑明畅，妙理精通。 然臣今敢闻，以繁听览。 臣恐陛下，以此微细不纳。 宸衷臣之愚直，实以为保护。 圣躬莫不至斯，道危难之代。 实以保身，临事便知吉凶。 固详察不鄙刍荛无任忠懃之诚，谨冒死奉表，谨献以闻。 臣诚惶诚恐，死罪，死罪，谨言。 贞观七年月日，右仆射卫国公臣李靖上表。 天老神光经 右仆射卫国公李靖修 晋平公问师旷曰：凡人出行，将兵攻击，胜负命之，存亡可预知乎？ 对曰：须察北斗之星傍辅也。 若欲克战将兵，暮不见此辅星，不可行也，大凶。 若有疾不见，限期将至。 平公曰：天阴不见，将何以明休咎？ 对曰：不见当视神光，不见神光，不可妄动。 平公曰：神光若何？ 对曰：常居目中，於阴暗处以指刺之目眦，头摇指可见其辅星者。 众共视之，独不见者，是辅已去，必大凶。 夫人身疾病目不见者，只在七日内死。 此道微密，可谓独见之明。 平公曰：善哉。",
      "translated_text": "Your humble servant, in his presumption, has arranged and compiled this into a single scroll, entitled *The Celestial Elder’s Divine Radiance*, which he respectfully presents to the imperial court. Your servant is well aware that Your Majesty’s sagely mind is luminous and penetrating, mastering the subtlest principles. Yet, I now dare to submit this, though it may burden Your Majesty’s ears with its prolixity. I fear Your Majesty may deem these trifling matters unworthy of acceptance. Yet, if Your Majesty’s august heart might indulge this humble servant’s foolish candor, I truly believe it offers protection. In times of peril and hardship, none should be without this Way. It ensures self-preservation and, when facing matters, reveals fortune or misfortune in advance. Thus, I have examined it in detail, not disdaining the humble offering of a rustic. With unwavering loyalty and devotion, I risk death to present this memorial, humbly submitting it for Your Majesty’s consideration.\n\nYour servant is filled with awe and trepidation, guilty of transgression, guilty of transgression. Respectfully submitted.\n\nOn a day in the seventh year of the Zhenguan era, your servant Li Jing, Right Vice Director of the Imperial Secretariat and Duke of Weiguo, presents this memorial.\n\n---\n\n*The Scripture of the Celestial Elder’s Divine Radiance*\nCompiled by Li Jing, Right Vice Director of the Imperial Secretariat and Duke of Weiguo\n\nDuke Jinping asked Master Kuang: \"When a man sets out on a journey or leads troops into battle, are victory or defeat, life or death, truly foreknowable?\"\nMaster Kuang replied: \"One must observe the auxiliary stars beside the Northern Dipper. If, when preparing for battle, these stars are not visible at dusk, the expedition must not proceed—it is greatly inauspicious. If they are absent due to illness, the appointed time of death draws near.\"\n\nDuke Jinping asked: \"When the sky is overcast and the stars are unseen, how can one discern fortune or misfortune?\"\nMaster Kuang replied: \"If the stars are not visible, one must observe the divine radiance. Without this radiance, no reckless action should be taken.\"\n\nDuke Jinping asked: \"What is this divine radiance?\"\nMaster Kuang replied: \"It constantly resides within the eye. In dark places, press a finger into the corner of the eye and shake the head—if the auxiliary stars appear, they may be seen. If, when many look together, one alone cannot see them, the auxiliary star has departed, and great misfortune is certain. If a person’s illness prevents them from seeing it, death will come within seven days. This Way is subtle and profound, a vision of unique clarity.\"\n\nDuke Jinping said: \"Excellent!\"",
      "overlap_context": "ty, transform misfortune into blessing.\n\nIt is known that when Emperor Gaozu’s heart stirred, he swiftly evaded the pursuer’s plot. When Zhao Xiang’s horse startled, he instantly recognized the assassin’s guise. Since ancient times, the wise and sagacious have all revered Master Kuang. Jin Ping and Zhang Liang received the essentials of the Yellow Stone. This transmission has circulated through the ages, its history long and deep. Yet, the text may contain errors, and its language may be prolix.",
      "start_char": 420,
      "end_char": 817,
      "start_sentence": 33,
      "end_sentence": 56,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.70302438735962,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\天老神光经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "乃刻玉版，藏之於函，常披览之。 黄帝曰：心动目瞬，悬知性命吉凶。 天之明，以日、月、斗为候。 人之明，以目为候，以心为主。 若能知之，全身保命。 夫鼻目神合於心，故先知察之。 心动目瞬鼻酸，神光去者大凶。 或要知贼人、奸人，须存神光。 光青白者，奸人。 黑者，贼人。 凡行，心动目瞬鼻酸者，即存神光。 神光去者，有贼在前。 一瞬一里，前必有贼，可备之。 凡行至他邑，欲止住者，先存神光。 无光者，勿入其舍，必有忧伤。 师旷曰：光黄及赤而圆，有德有喜。 白者，有伏兵，於人有丧。 青缺者，有忧。 里一者，有贼及病、兵矣。 若居，坐卧不安，且存神光，不见须急去。 凡夜卧，要知吉凶，可存神光。 将欲征伐者，上观星象，中别神光矣。 若欲渡水，宜可存之，不见者，不可渡也。 若出行不见者，不可行也。 若临食不见，不可食。 若欲饮食时，心动鼻酸目瞬光去，同伴欲害己，慎之。 若舌动唇瞬光去，子欲杀父，奴婢杀主。 心动脐瞬光去，子欲害父。 心动光去肘瞬，妾人为贼。 心动掌瞬光去者，贼是亲戚。 心动惕然光去，弟欲害兄。 心动右足下瞬，利行。 左足下瞬，公中有事。 心动颊瞬光去，贼是交友。 心动目瞬光去，妻妾与外人私通，欲来相害。 心动光去，急离住处。 又存神光，左目有光，左路通。 右目有光，右路通。 两目皆有，可往。 心动不乐，避上下兵，有相争事。 若目无光，耳无故鸣，坐者急起，行者急走，有人欲来相害，是为精魄藏耳。 左目瞬，己身事。 右目瞬，他人事。 鼻酸耳鸣，怪忧立至。 夫上士死前五日，光去魄亦去。 凡人，魂藏於鼻，魄藏於口，故合於身。 神光出於目，精气合於神。 所去之处，须谨占之。 昔轩辕欲崩，光去十日。 周孔，皆先五日。 近代烈士，三日而已。 光藏於目，声藏於耳，精藏於阴者。 而限期将至，何为不在？",
      "translated_text": "Having inscribed these words upon jade tablets and sealed them in a case, he would often unroll and peruse them.\n\nThe Yellow Emperor said: \"When the heart stirs and the eyes flicker, one may foreknow the fortune or misfortune of life and fate. The brightness of Heaven is discerned through the sun, moon, and Dipper. The brightness of man is discerned through the eyes, with the heart as its master. If one can comprehend this, one may preserve the body and safeguard life. The spirit of the nose and eyes converges in the heart, and thus one must first observe and examine it. When the heart stirs, the eyes flicker, and the nose grows sour—if the divine radiance departs, great misfortune follows.\n\nShould one wish to detect thieves or traitors, one must attend to the divine radiance. If the radiance is greenish-white, the person is a traitor. If it is black, the person is a thief.\n\nIn all travels, when the heart stirs, the eyes flicker, and the nose grows sour, one must immediately attend to the divine radiance. If the radiance departs, there is a thief ahead. With each flicker of the eye, a *li* ahead there is surely a thief—one must prepare accordingly.\n\nWhen journeying to another town and wishing to lodge, first attend to the divine radiance. If there is no radiance, do not enter the dwelling, for there will surely be sorrow.\n\nMaster Kuang said: \"If the radiance is yellow or red and round, there is virtue and joy. If it is white, there are hidden soldiers and mourning among the people. If it is green and incomplete, there is sorrow. If it is a single *li* in size, there are thieves, illness, or soldiers.\n\nIf, while dwelling there, one sits or lies uneasy, attend to the divine radiance at once. If it does not appear, depart swiftly.\n\nWhen sleeping at night and wishing to know good or ill fortune, one may attend to the divine radiance.\n\nFor those about to wage war, first observe the celestial signs above, then distinguish the divine radiance within. If one wishes to cross water, one should attend to it—if it does not appear, one must not cross. If one sets out on a journey and it does not appear, one must not proceed. If it does not appear when approaching food, one must not eat.\n\nWhen about to eat or drink, if the heart stirs, the nose grows sour, the eyes flicker, and the radiance departs—one’s companions intend harm; beware. If the tongue stirs, the lips flicker, and the radiance departs, a son intends to kill his father, or a servant to kill his master. If the heart stirs, the navel flickers, and the radiance departs, a son intends to harm his father. If the heart stirs, the radiance departs, and the elbow flickers, a concubine is the thief. If the heart stirs, the palm flickers, and the radiance departs, the thief is a relative. If the heart stirs with alarm and the radiance departs, a younger brother intends to harm his elder. If the heart stirs and the right foot flickers, the journey will be profitable. If the left foot flickers, there is trouble in the public sphere. If the heart stirs, the cheek flickers, and the radiance departs, the thief is a friend. If the heart stirs, the eyes flicker, and the radiance departs, a wife or concubine is having an affair and intends harm. If the heart stirs and the radiance departs, leave the dwelling at once.\n\nAgain, attend to the divine radiance: if the left eye has radiance, the left path is open. If the right eye has radiance, the right path is open. If both eyes have radiance, one may proceed. If the heart stirs with disquiet, avoid conflict above and below, for there will be strife.\n\nIf the eyes have no radiance and the ears ring without cause, one sitting must rise swiftly, one walking must flee—someone intends harm. This is the spirit and soul concealed in the ears.\n\nIf the left eye flickers, it concerns one’s own affairs. If the right eye flickers, it concerns another’s affairs. If the nose grows sour and the ears ring, strange sorrows will soon arrive.\n\nFor the noble scholar, five days before death, the radiance departs, and the *po* soul also departs. For ordinary people, the *hun* soul is stored in the nose, the *po* soul in the mouth, and thus they unite with the body. The divine radiance emerges from the eyes, and essence and *qi* unite with the spirit. Wherever it departs, one must carefully divine its meaning.\n\nIn ancient times, when the Yellow Emperor was about to pass, his radiance departed ten days prior. For the Zhou and Confucius, it was five days. For recent martyrs, it was but three. The radiance is stored in the eyes, the voice in the ears, and the essence in the yin. When the appointed time draws near, how can one not be present?\"",
      "overlap_context": "adiance?\"\nMaster Kuang replied: \"It constantly resides within the eye. In dark places, press a finger into the corner of the eye and shake the head—if the auxiliary stars appear, they may be seen. If, when many look together, one alone cannot see them, the auxiliary star has departed, and great misfortune is certain. If a person’s illness prevents them from seeing it, death will come within seven days. This Way is subtle and profound, a vision of unique clarity.\"\n\nDuke Jinping said: \"Excellent!\"",
      "start_char": 817,
      "end_char": 1521,
      "start_sentence": 57,
      "end_sentence": 109,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.72301149368286,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\天老神光经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "耳无声，目无光，阴不起，其贼主来，随明避之，大吉。 岐伯曰：於阴暗处，以手掩目，存神光青者。 忧白者兵，赤者德，黄者喜，里一者凶。 刘根曰：光白者，亦有德。 甲乙日主目，丙丁日主心，戊己日主腹，庚辛日主背，壬癸日主踵。 以此日，其有心动目瞬存光。 无者，贼欲谋人，可备御之。 甲乙日心动者，贼为人身小而长，苍色，好言语。 丙丁日心动者，贼为人壮，赤色，蓬头广颊。 戊己日心动者，贼为人鼠肥肚大，不言语，发黄。 庚辛日心动者，贼为人广眉大鼻，能喜言语。 壬癸日心动者，贼为人身长头小，里一色，好渔猎。 若能备之，则万事必成，避兵除害，天自与之利矣。 光眉间五日一存，命之长远，独闻之声，为之耳鸣。 精神不调，赤子大惊，悲思不乐，欲归於天。 以手搏耳，赤子还返，耳鸣之时，即存神光。 黄帝要秘，专行全身保命。 凡人耳鸣，闻叫唤啼呼及雷鼓声，若鼻中闻臭气，腥而并凶，可斋诫沐浴，暮向本星禹步三，呼曰：巨门神子，轻门神子，禄存子，户错子，衡不云子，霸治子，大柜子。 常以此法言，无殃矣。 若有难，便呼其所属星名，云来救我，三呼止。 第一午属破军，二巳未属武曲，三申辰属廉贞，四卯酉属文曲，五寅戌属禄存，六丑亥属巨门，七子属贪狼。 禹步法 老氏云：凡人住处，宜存光察辅星，武曲傍小星也。 见之则吉，不见则凶，亦内保百日。 见之则百日内无官灾、口舌、患疾、死亡，故曰保百日。 若天阴不见辅星者，於暗处存光。 若不见，细推求四方寻之。 每辰及夜，常能存之，长生矣。 天神覆斗神咒，用保身护命，百年之荣寿，非人勿传。 咒曰：团团告报四方、天地、日月，此处行冈，火急捉取鬼王。 人人缚勒，摄取强邪。 吾今未觉，不得分张。 麒鳞万队，尽散五方。 谨请二十八宿星官、三十五星头，上立速速下来，在臣傍年。 逆人符鬼，专在此拦，截作妖祥。 星官唯覆斗，反缚叛逆人形，口云急急急急，便覆斗。 一步一星，乾元亨利贞。 □□□□□□□。 告玄图",
      "translated_text": "If the ears hear no sound, the eyes emit no radiance, and the yin does not stir, the malevolent master approaches—follow the light to evade it, and great fortune shall be yours.\n\nQibo said: In a dimly lit place, cover your eyes with your hands and visualize the divine radiance. If it appears green, there is cause for concern; white, it portends warfare; red, virtue; yellow, joy; and if it bears a dark hue, misfortune follows.\n\nLiu Gen said: A white radiance may also signify virtue.\n\nOn *jia-yi* days, the eyes govern; on *bing-ding* days, the heart; on *wu-ji* days, the abdomen; on *geng-xin* days, the back; and on *ren-gui* days, the heels. On these days, if the heart stirs, the eyes flicker, or the radiance manifests, take heed. If none appear, an assailant may be plotting against you—prepare your defenses.\n\nOn *jia-yi* days, if the heart stirs, the assailant will be small and slender, with a sallow complexion and a fondness for speech. On *bing-ding* days, if the heart stirs, the assailant will be robust, ruddy-faced, with disheveled hair and broad cheeks. On *wu-ji* days, if the heart stirs, the assailant will be plump like a rat, with a large belly, silent, and yellow-haired. On *geng-xin* days, if the heart stirs, the assailant will have broad brows and a large nose, and be garrulous. On *ren-gui* days, if the heart stirs, the assailant will be tall with a small head, of a dark hue, and fond of hunting and fishing. If you prepare accordingly, all affairs will succeed, you will evade warfare and harm, and Heaven itself will grant you favor.\n\nStore the radiance between the brows once every five days to prolong life. If you hear a solitary voice, it will cause ringing in the ears. When the spirit and essence are unsettled, the infant soul is greatly startled, sorrow and melancholy arise, and the desire to return to Heaven grows. Strike your ears with your hands, and the infant soul will return. When the ears ring, immediately visualize the divine radiance.\n\nThe Yellow Emperor’s essential secret ensures the preservation of life and body. Whenever one hears ringing in the ears—whether cries, wails, shouts, thunder, or drumming—or detects a foul, fishy odor in the nose, all portend misfortune. One should purify oneself with fasting and bathing, then at dusk face the natal star and perform the *Yu Step* three times, calling out: *\"Jumen Shenzi, Qingmen Shenzi, Lucunzi, Hucuozi, Hengbuyunzi, Bazhizi, Daguizi.\"* By reciting this method, no calamity shall befall you. If danger arises, call upon the name of your governing star, saying, *\"Come to my aid,\"* three times and stop.\n\nThe first, at *wu*, belongs to *Pojun*; the second, at *si* and *wei*, to *Wuqu*; the third, at *shen* and *chen*, to *Lianzhen*; the fourth, at *mao* and *you*, to *Wenqu*; the fifth, at *yin* and *xu*, to *Lucun*; the sixth, at *chou* and *hai*, to *Jumen*; and the seventh, at *zi*, to *Tanlang.*\n\n**The Yu Step Method**\nLaozi said: Wherever one resides, one should visualize the radiance and observe the *Fuxing* star—the small star beside *Wuqu*. Seeing it brings good fortune; failing to see it brings misfortune, though one may still secure a hundred days of safety. If seen, there will be no official disasters, slander, illness, or death within a hundred days—hence it is called *preserving a hundred days*. If the sky is overcast and the *Fuxing* star is not visible, visualize the radiance in darkness. If still unseen, carefully search the four directions for it. By regularly visualizing it at dawn and night, one attains longevity.\n\n**The Heavenly Deity’s Covering Dipper Spirit Incantation** safeguards the body and protects life, granting a century of honor and longevity. Do not transmit it to the unworthy.\n\nThe incantation reads:\n*\"Round and round, I report to the four directions, Heaven and Earth, the sun and moon. On this path I traverse, swiftly seize the Ghost King. Bind and restrain every person, capture the fierce and perverse. Before I awaken, they shall not disperse. With a myriad of qilin troops, scatter them to the five directions. I respectfully invoke the twenty-eight stellar officials and the thirty-five star chiefs—descend swiftly and stand beside your servant for years. Reverse the talismans of rebellious ghosts, intercept and suppress all omens. The stellar officials, covering the Dipper, bind the traitors in reverse. Speak swiftly, swiftly, swiftly, swiftly—then cover the Dipper. One step, one star: *Qianyuan, Hengli, Zhen.* □□□□□□□. Proclaim to the Mysterious Diagram.\"*",
      "overlap_context": "te with the body. The divine radiance emerges from the eyes, and essence and *qi* unite with the spirit. Wherever it departs, one must carefully divine its meaning.\n\nIn ancient times, when the Yellow Emperor was about to pass, his radiance departed ten days prior. For the Zhou and Confucius, it was five days. For recent martyrs, it was but three. The radiance is stored in the eyes, the voice in the ears, and the essence in the yin. When the appointed time draws near, how can one not be present?\"",
      "start_char": 1521,
      "end_char": 2311,
      "start_sentence": 110,
      "end_sentence": 148,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.571871757507324,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\天老神光经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "丕哉天道，垂范显乎，然不可智知。 自古人知者其道昌，不知者其道亡，而况於常伦。 而己敢不量力，度德铭心，忘形穷索幽微，编为图籍，如列诸掌。 依此行之，至诚必应。 分位置席，一一备载。 将来君子，宝而秘之，以贻后代，勿示凡愚之人。 得之者固不在於外求，修之者亦不在於他人。 《阴符》云：宇宙在乎手，万化生乎身。 凡八万三千一百昼，三千一百星，夜八万星见。 以四斗星官，每夜抽三斗，在北斗下当直。 乾星求谒至尊，宜用月初二日衙宿。 纸钱一贴，状纸七张，鹿脯三楪，酒三盏，灯七盏，香一炷，面北方一行排。 右奉请乾星官降赴，领受薄礼，以应虔诚。 谨状。",
      "translated_text": "Great is the Dao of Heaven, its patterns manifest yet beyond the grasp of mere wisdom. Since ancient times, those who understood it flourished in the Way, while those who did not perished—how much more so for ordinary mortals. Yet I, undeterred by my limited strength, have measured my virtue and inscribed it upon my heart, forsaking form to delve into the profound and subtle. I have compiled these into diagrams and records, as if arrayed upon my palm. Follow this path, and utmost sincerity will surely evoke response.\n\nPositions and seating are meticulously arranged, each detail duly recorded. Future noble ones, treasure and safeguard this, passing it to later generations, but never reveal it to the foolish or unworthy. What is attained here does not come from external seeking, nor does cultivation depend on others. As the *Yin Fu Jing* states: *\"The cosmos lies within the hand; the myriad transformations arise from the body.\"*\n\nIn all, there are eighty-three thousand one hundred stars by day and three thousand one hundred stars by night, with eighty thousand stars visible in the night sky. Among the four Dipper stellar officials, three are on duty each night beneath the Northern Dipper.\n\nTo petition the Celestial Star (Qian Star) for an audience with the Most Exalted, the second day of the lunar month under the *Ya* constellation is most auspicious. Prepare one sheet of paper money, seven sheets of petition paper, three platters of dried venison, three cups of wine, seven lamps, one stick of incense, and arrange them in a single row facing north.\n\nHerein, I respectfully invoke the Celestial Star Official to descend and receive these humble offerings, in answer to my sincere devotion. Respectfully submitted.",
      "overlap_context": " troops, scatter them to the five directions. I respectfully invoke the twenty-eight stellar officials and the thirty-five star chiefs—descend swiftly and stand beside your servant for years. Reverse the talismans of rebellious ghosts, intercept and suppress all omens. The stellar officials, covering the Dipper, bind the traitors in reverse. Speak swiftly, swiftly, swiftly, swiftly—then cover the Dipper. One step, one star: *Qianyuan, Hengli, Zhen.* □□□□□□□. Proclaim to the Mysterious Diagram.\"*",
      "start_char": 2311,
      "end_char": 2581,
      "start_sentence": 149,
      "end_sentence": 162,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.955700874328613,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\天老神光经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "离星救危扶倾； 宜用成日亥时。 灯九盏，香一炷，馎饦五椀，乳五盏。 三行排。 右奉请离星官降临，俯纳丹诚，以救颠踬。 谨状。 丙星祈福，宜用酉日申时。 饭两椀并匙筋， 酒两盏，杂肉两楪，状纸五张，笔一管，灯一盏。 右奉请丙星官降临，受纳单献，特施福佑。 谨状。 平星夷敌，宜用危日丑时。 酒七盏，香一炷，纸钱三贴，灯两盏，饭七椀。 右奉请平星官降止，领受奠礼，令遇敌必平，逢危返安。 谨状。 寅星官攻击胜负，宜用定日子时。 酒三盏，香三炷，纸钱一贴。 羊肉三楪，灯九盏。 右奉请冥星官降赴，俯赐领纳，使攻必克，击必胜捷。 谨状。 出星道途通达，宜用定日辰时。 酒二盏，肉饭食二分，状纸三张，钱财一贴，灯两盏，香一炷。 右奉请出星官，降临就座，伏愿无所滞碍，道途通达。 谨状。 定星安家保宅，宜用平日戌时。 羊肉炙五串，酒五盏，状纸五张，纸钱一贴，灯一盏，香一炷。 右奉请定星官，降临受纳，伏愿宅舍安宁，禄佑延生。 谨状。 瑞星应梦，用天赦日亥时。 酒七盏，鹿脯七楪，状纸七张，红彩二尺，纸钱七贴，灯二盏，香一炷。 右奉请瑞星官，应梦贤圣，以将福禄。 谨状。 元星求大官，宜用己巳日巳时。 乳三楪，杂彩，各少许。 纸钱一贴，纸三张，笔三枝，香一炷，灯两盏。 右奉请元星官，降临领纳，伏愿仕宦清吉，言发皆中。 谨状。 正星摄心惬意，用壬午日丑时。 乳粥四椀，杂果子四楪，酒四盏，香灯各四。 右奉请正星官，降临领受，伏愿所求称意。 谨状。 显星官祈官求名，宜用丙子日亥时。 内饭一分，纸钱一束，状纸一张，香灯各一，笔一枝。 右奉请显星官，降临领受，伏愿祈官必应，求名必遂。 谨状。 七月星祈阴德，宜用寅日子时。 酒三盏，状纸四张，白练素三尺，素饭三分，香一炷，钱财十五贴，灯一盏。 右奉请月星官，降赴领受，伏愿所祈必应。 谨状。 辅星安贱口，宜用辰日戌时。 乳七盏，灯一盏，纸钱十三贴，香一炷。 右奉请辅星官，降赴领受，伏愿贱类福寿。 谨状。 大白星祈方面主，不拣日，大凡申酉日为妙。 汗衫半臂一，衫一，袴不魅肚一，袜一，一。 已上，并须三岁孩子样造。 右奉请大白星官降临，领受前件物并食酒乳等，伏乞令祈官职，必克所请。 谨状。 灯席灯灯灯",
      "translated_text": "To petition the Li Star for deliverance from peril and support in crisis, the *Cheng* day’s *Hai* hour is most auspicious. Prepare nine lamps, one stick of incense, five bowls of *botuo*, and five cups of milk. Arrange them in three rows.\n\nHerein, I respectfully invoke the Li Star Official to descend and graciously accept this sincere offering, that peril may be averted and distress relieved. Respectfully submitted.\n\nTo petition the Bing Star for blessings, the *You* day’s *Shen* hour is most auspicious. Prepare two bowls of rice with spoons and chopsticks, two cups of wine, two platters of assorted meats, five sheets of petition paper, one brush, and one lamp.\n\nHerein, I respectfully invoke the Bing Star Official to descend and receive this humble offering, that blessings and favor be bestowed. Respectfully submitted.\n\nTo petition the Ping Star for the suppression of enemies, the *Wei* day’s *Chou* hour is most auspicious. Prepare seven cups of wine, one stick of incense, three sheets of paper money, two lamps, and seven bowls of rice.\n\nHerein, I respectfully invoke the Ping Star Official to descend and receive these offerings, that enemies be pacified and peril turned to safety. Respectfully submitted.\n\nTo petition the Yin Star Official for victory in attack or battle, the *Ding* day’s *Zi* hour is most auspicious. Prepare three cups of wine, three sticks of incense, one sheet of paper money, three platters of mutton, and nine lamps.\n\nHerein, I respectfully invoke the Ming Star Official to descend and graciously accept these offerings, that attacks be certain of success and strikes assured of swift victory. Respectfully submitted.\n\nTo petition the Chu Star for unobstructed journeys, the *Ding* day’s *Chen* hour is most auspicious. Prepare two cups of wine, two portions of meat and rice, three sheets of petition paper, one sheet of paper money, two lamps, and one stick of incense.\n\nHerein, I respectfully invoke the Chu Star Official to descend and take seat, that all paths be free of hindrance and journeys unimpeded. Respectfully submitted.\n\nTo petition the Ding Star for household peace and protection, the *Ping* day’s *Xu* hour is most auspicious. Prepare five skewers of roasted mutton, five cups of wine, five sheets of petition paper, one sheet of paper money, one lamp, and one stick of incense.\n\nHerein, I respectfully invoke the Ding Star Official to descend and receive these offerings, that the household be secure, blessings abundant, and life prolonged. Respectfully submitted.\n\nTo petition the Rui Star for dream revelations, the *Tian She* day’s *Hai* hour is most auspicious. Prepare seven cups of wine, seven platters of dried venison, seven sheets of petition paper, two feet of red silk, seven sheets of paper money, two lamps, and one stick of incense.\n\nHerein, I respectfully invoke the Rui Star Official to respond to dreams of the worthy and sagely, that fortune and rank be granted. Respectfully submitted.\n\nTo petition the Yuan Star for high office, the *Ji Si* day’s *Si* hour is most auspicious. Prepare three platters of milk, small amounts of assorted silks, one sheet of paper money, three sheets of paper, three brushes, one stick of incense, and two lamps.\n\nHerein, I respectfully invoke the Yuan Star Official to descend and receive these offerings, that official service be pure and auspicious, and every word spoken be efficacious. Respectfully submitted.\n\nTo petition the Zheng Star for contentment of the heart’s desires, the *Ren Wu* day’s *Chou* hour is most auspicious. Prepare four bowls of milk porridge, four platters of assorted fruits, four cups of wine, and four each of incense and lamps.\n\nHerein, I respectfully invoke the Zheng Star Official to descend and receive these offerings, that all aspirations be fulfilled. Respectfully submitted.\n\nTo petition the Xian Star Official for official appointment and fame, the *Bing Zi* day’s *Hai* hour is most auspicious. Prepare one portion of rice, one bundle of paper money, one sheet of petition paper, one each of incense and lamp, and one brush.\n\nHerein, I respectfully invoke the Xian Star Official to descend and receive these offerings, that petitions for office be answered and quests for fame be realized. Respectfully submitted.\n\nTo petition the Yue Star for hidden virtue, the *Yin* day’s *Zi* hour is most auspicious. Prepare three cups of wine, four sheets of petition paper, three feet of white silk, three portions of plain rice, one stick of incense, fifteen sheets of paper money, and one lamp.\n\nHerein, I respectfully invoke the Yue Star Official to descend and receive these offerings, that all prayers be answered. Respectfully submitted.\n\nTo petition the Fu Star for the well-being of the lowly, the *Chen* day’s *Xu* hour is most auspicious. Prepare seven cups of milk, one lamp, thirteen sheets of paper money, and one stick of incense.\n\nHerein, I respectfully invoke the Fu Star Official to descend and receive these offerings, that the humble be granted fortune and longevity. Respectfully submitted.\n\nTo petition the Tai Bai Star for regional governorship, any day may be used, though *Shen* and *You* days are most efficacious. Prepare one sleeveless undershirt, one robe, one pair of trousers without a waistband, one pair of socks, and one pair of shoes—all to be made in the size of a three-year-old child.\n\nHerein, I respectfully invoke the Tai Bai Star Official to descend and receive the aforementioned items along with food, wine, and milk, that petitions for official rank be certain of fulfillment. Respectfully submitted.",
      "overlap_context": "r (Qian Star) for an audience with the Most Exalted, the second day of the lunar month under the *Ya* constellation is most auspicious. Prepare one sheet of paper money, seven sheets of petition paper, three platters of dried venison, three cups of wine, seven lamps, one stick of incense, and arrange them in a single row facing north.\n\nHerein, I respectfully invoke the Celestial Star Official to descend and receive these humble offerings, in answer to my sincere devotion. Respectfully submitted.",
      "start_char": 2582,
      "end_char": 3566,
      "start_sentence": 163,
      "end_sentence": 221,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.501994848251343,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\天老神光经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "灯酒一满椀乳一椀 灯乳粥一椀饭一椀 灯乳饼一钱财随意 灯状纸二十张香三炷 灯席灯灯灯 以前件铺设，但依所画字处着祭物。 直须严洁，勿令前有猪狗及腥等物。 所排比尤宜在意，所求必克。 伏虑未惯者，更备录立成奏状，仪范如后。 召启十方一切得道应感神明：某年某月某曰，州县乡里弟子某甲，就某处奏纳某星官君钱，求某福。 今正尔烧香启告，愿灵圣降下。 令臣所启，上达某星官前，便执刀解秽云。 谨请东方青龙真气入吾水中。 谨请南方赤龙真气入吾水中。 谨请西方白龙真气入吾水中。 谨请北方黑龙真气入吾水中。 谨请中央黄龙真气入吾水中。 谨请东方木官解秽吏九人。 谨请南方火官解秽吏三人。 谨请西方金官解秽吏七人。 谨请北方水官解秽吏五人。 谨请中央土官解秽吏十二人。 谨请天上地下解秽吏各十二人。 谨请解秽玉童、洗浣玉女、香汤使者，请解天秽、地秽、人秽、鬼秽、沉尸白骨等秽。 但眼之所视，耳之所闻，速令大秽归海，小秽归江，不得迟。 迟当吾神气者死，背吾神气者亡。 一秽不去者，斩付魁魍。 急急如律令。 捻香三遍。 上香讫云。 第一上香供养南斗星官，第二上香供养北斗星官，第三上香供养十方一切得道。 奉请某星官，慈悲降临，领受微礼，上香上酒再拜。 臣闻至理幽冥，启必应感。 谨有文状，理宜申奏，宣读文状。 如此三遍讫，烧钱及杂果子撒了，再拜祝。 右随官并请沾赖，以同欢悦。 某以卑微菲薄，仰蒙降临，不胜忻悚。 臣向来所请情状，伏愿采纳，记录词诚。 臣以愚昧，不闲仪范。 启言烦杂，忓忤威灵。 并乞矜恕，克如所愿。 再拜奉送。 诸神祝文。 第一上香供养南斗星官，第二上香供养北斗星官，第三上香供养一切得道。 玉华散景，金炉起烟。 香云密罗，上冲九天。 侍香玉女，上闻帝前。 令臣长生，永为真仙。 所启所请，咸乞如言。 又云：隔居小人，好道求灵。 常见尊仪，愿赐长生。 百二十年，无诸灾瘴。 败中得成，危中得安，死中得生。 应住宅吉，家眷安平。 如愿之日，即不胜虔恳之至，稽首欢喜。 次宣状三通。 次念北斗咒七遍。 奉请某星官，慈悲降临，领受微礼。 臣闻至理幽冥，启必应感。 谨有文状，理宜申奏。 次烧钱及状，洒酒撒果。 右随官并请沾赖，以同欢悦。 臣以卑微，辄申菲薄，仰蒙降临，不胜忤悚。 臣某向来所请情状，伏愿采纳，记录词诚。 臣愚昧，不闲仪范。 启言烦杂，忓忤威灵。 并乞矜恕，克如所愿。 再拜送。 背建向破覆斗。",
      "translated_text": "A full bowl of wine and a full bowl of milk, a bowl of lamp-oil porridge and a bowl of rice, a coin’s worth of lamp-oil cakes (additional offerings at one’s discretion), twenty sheets of petition paper, and three sticks of incense.\n\nArrange the above items according to the diagram, placing each offering precisely where the characters are drawn. Ensure utmost cleanliness; do not allow swine, dogs, or any foul-smelling substances to be present. The arrangement must be meticulous—thus shall all petitions be fulfilled.\n\nFor those unfamiliar with the rites, a ready-made petition text is provided below as a model.\n\nInvocation to the Ten Directions and all enlightened, responsive deities:\n\nOn the [day] of [month] in the year [year], your disciple [name], of [prefecture, county, village], respectfully presents this offering of paper money to the [Star Official’s name] at [location], beseeching [specific blessing].\n\nNow, as incense is kindled, I humbly invoke the divine presence to descend. May my petition ascend before the [Star Official’s name]. Taking up the blade, I declare the purification:\n\nI reverently summon the true qi of the Azure Dragon of the East into my water.\nI reverently summon the true qi of the Vermilion Dragon of the South into my water.\nI reverently summon the true qi of the White Dragon of the West into my water.\nI reverently summon the true qi of the Black Dragon of the North into my water.\nI reverently summon the true qi of the Yellow Dragon of the Center into my water.\n\nI reverently summon the nine Wood Officials of the East to dispel impurity.\nI reverently summon the three Fire Officials of the South to dispel impurity.\nI reverently summon the seven Metal Officials of the West to dispel impurity.\nI reverently summon the five Water Officials of the North to dispel impurity.\nI reverently summon the twelve Earth Officials of the Center to dispel impurity.\nI reverently summon the twelve Heavenly and twelve Earthly Officials to dispel impurity.\n\nI reverently summon the Jade Lads of Purification, the Jade Maidens of Cleansing, and the Fragrant Water Messengers to dispel all impurities—those of heaven, earth, humanity, ghosts, sunken corpses, and bleached bones. Whatever the eye sees or the ear hears, let great impurities return to the sea and minor impurities to the rivers, without delay. Delay shall bring death to those who resist my divine qi; defiance shall bring destruction. Any impurity that remains shall be severed and delivered to the Kui and Wang spirits.\n\nSwiftly, swiftly, in accordance with the law!\n\nKnead the incense three times.\n\nUpon completing the incense offering, declare:\nFirst incense offering to the Southern Dipper Star Official.\nSecond incense offering to the Northern Dipper Star Official.\nThird incense offering to all enlightened beings of the Ten Directions.\n\nI humbly invoke the [Star Official’s name] to descend in compassion, receive these humble offerings, and accept this incense and wine. Bow twice.\n\nI have heard that in the profound mysteries of the unseen, petitions must evoke a response. With this written petition, I now submit my plea. Read the petition aloud three times, then burn the paper money and scatter the fruits. Bow twice and pray:\n\nMay all attending officials partake in this grace and share in this joy.\n\nThough I am lowly and my offerings meager, I am honored by your descent. Overwhelmed with reverence and awe, I beseech you to accept my plea and record my sincerity.\n\nIn my ignorance, I am unversed in proper rites. My words may be disorderly, offending your divine majesty. I beg your forgiveness and grant my wishes as requested. Bow twice and bid farewell.\n\nPrayer to the deities:\n\nFirst incense offering to the Southern Dipper Star Official.\nSecond incense offering to the Northern Dipper Star Official.\nThird incense offering to all enlightened beings.\n\nJade radiance scatters light; golden censers rise with smoke.\nFragrant clouds weave densely, ascending to the Nine Heavens.\nThe Jade Maiden of Incense attends, bearing word to the Celestial Emperor.\nGrant me long life, that I may forever be a true immortal.\nAll petitions and pleas, I beseech you to fulfill as spoken.\n\nAlternatively:\n\nThough I dwell in humble obscurity, I seek the Dao and yearn for the divine.\nEver beholding your august presence, I pray for eternal life.\nOne hundred and twenty years, free from all disasters and pestilence.\nFrom failure, grant success; from peril, safety; from death, life.\nMay my dwelling be auspicious, my family peaceful.\nOn the day my wishes are fulfilled, I shall prostrate in boundless devotion and joy.\n\nNext, read the petition three times.\nRecite the Northern Dipper Mantra seven times.\n\nI humbly invoke the [Star Official’s name] to descend in compassion and receive these humble offerings.\n\nI have heard that in the profound mysteries of the unseen, petitions must evoke a response. With this written petition, I now submit my plea. Burn the paper money and petition, pour the wine, and scatter the fruits.\n\nMay all attending officials partake in this grace and share in this joy.\n\nThough I am lowly and my offerings meager, I dare to present them. Honored by your descent, I am filled with awe. I beseech you to accept my plea and record my sincerity.\n\nIn my ignorance, I am unversed in proper rites. My words may be disorderly, offending your divine majesty. I beg your forgiveness and grant my wishes as requested. Bow twice and bid farewell.\n\nPosition the altar with the *jian* day at the back and the *po* day at the front, facing the Dipper.",
      "overlap_context": "r regional governorship, any day may be used, though *Shen* and *You* days are most efficacious. Prepare one sleeveless undershirt, one robe, one pair of trousers without a waistband, one pair of socks, and one pair of shoes—all to be made in the size of a three-year-old child.\n\nHerein, I respectfully invoke the Tai Bai Star Official to descend and receive the aforementioned items along with food, wine, and milk, that petitions for official rank be certain of fulfillment. Respectfully submitted.",
      "start_char": 3566,
      "end_char": 4554,
      "start_sentence": 222,
      "end_sentence": 290,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 23.862707376480103,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\天老神光经.txt",
        "category": "方法类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "大月，拇大指在前腰上，及先进左足，步之动冈。 小月，拇小指在前腰上，及先进右足，步之动冈。 大月禹步先左 天老神光经竟",
      "translated_text": "In a major-month, place the thumb upon the front of the waist, then advance the left foot first, stepping to activate the mound’s power. In a minor-month, place the little finger upon the front of the waist, then advance the right foot first, stepping to activate the mound’s power. In a major-month, the Yu Step begins with the left—*Tianlao Shen Guang Jing* concludes.",
      "overlap_context": "this grace and share in this joy.\n\nThough I am lowly and my offerings meager, I dare to present them. Honored by your descent, I am filled with awe. I beseech you to accept my plea and record my sincerity.\n\nIn my ignorance, I am unversed in proper rites. My words may be disorderly, offending your divine majesty. I beg your forgiveness and grant my wishes as requested. Bow twice and bid farewell.\n\nPosition the altar with the *jian* day at the back and the *po* day at the front, facing the Dipper.",
      "start_char": 4555,
      "end_char": 4623,
      "start_sentence": 291,
      "end_sentence": 294,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.9996519088745117,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\方法类\\天老神光经.txt",
        "category": "方法类"
      }
    }
  ]
}