{
  "source_id": "天隐子",
  "source_file": "chunked_daozang\\天隐子.json",
  "total_chunks": 3,
  "total_original_chars": 2884,
  "total_translated_chars": 15280,
  "total_translation_time": 68.96761178970337,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\藏外\\天隐子.txt",
    "category": "藏外"
  },
  "full_translation": "**Preface by Sima Chengzhen of the Tang Dynasty**\n\nThe Dao of immortals takes longevity as its foundation; the essence of longevity lies in nurturing qi as its root. Qi is received from Heaven and Earth and harmonized through yin and yang. The numinous spirit of yin and yang is called the heart’s governance; waking and sleeping are called the hun and po. Thus, the human body is, in most respects, not far from the Dao of immortals.\n\n*Tianyinzi*—I know not from whence this person came—composed eight chapters, encompassing profound mysteries, which are scarcely within the capacity of worldly scholars. Observing his refinement of form and qi, cultivation of harmonious spirit, return to the root in accord with Boyang (Laozi), and abandonment of illumination equal to Zhuangzi, one finds no text surpassing this for attaining long life and enduring vision. Having devoted myself to the practice of the Dao, I lament that worldly people, their true lifespans cut short, might yet transmit this to like-minded seekers, that they may follow its simplicity and trust its truth. Since Boyang, only *Tianyinzi* stands thus.\n\n**Respectfully inscribed by Sima Chengzhen of the Tang**\n\n---\n\n**Chapter on Immortals**\n\nAt birth, humans receive numinous qi, their essence bright and perception unobstructed. When learning encounters no blockage, this is called *shen* (spirit). Dwelling spirit within and casting illumination without, one naturally differs from the vulgar—this is called *shenxian* (immortal). Thus, immortals are also human; it lies in refining one’s numinous qi, not allowing it to be defiled by worldly customs, and following one’s nature, not being hindered by perverse views—then success is achieved.\n\nJoy, anger, sorrow, happiness, love, aversion, and desire—these seven are the deviations of emotion. Wind, cold, heat, dampness, hunger, satiety, fatigue, and indolence—these eight are the deviations of qi. Remove these deviations, and the Dao of immortality draws near.\n\n---\n\n**Chapter on Simplicity**\n\nThe *Yijing* states, “The Dao of Heaven and Earth is simple.” Why? *Tianyinzi* says: Heaven and Earth lie above my head and beneath my feet; with eyes open, all is seen without reliance on elaborate contrivance—hence, it is called *simple*. Simplicity is the designation of the immortal’s Dao (as the scripture says: “The supreme Dao is not cumbersome; the perfected person does nothing”).\n\nThen by what Dao is it sought? It is said: Without seeking, one cannot know; without the Dao, one cannot achieve. In learning immortality, one must first understand simplicity. If words touch upon the strange or deceptive, they only lead people to cling in delusion without returning to the root—this is not my teaching. (There are those in the world who study immortality yet are deluded by it; those who study qi yet are harmed by it.)\n\n---\n\n**Chapter on Gradual Entry**\n\nThe *Yijing* has the *Gradual* hexagram; the Dao (or, in one version: *Laozi*) has the *Gradual Gate*. In cultivating truth and realizing nature, one cannot attain sudden enlightenment but must advance gradually, proceeding with ease. Thus, the *Gradual Gate* is established.\n\nObserve where I enter, and the Dao becomes visible. The *Gradual Gate* has five stages: first, fasting and abstinence; second, tranquil dwelling; third, concentrated contemplation; fourth, sitting in forgetfulness; fifth, spiritual liberation.\n\nWhat is fasting and abstinence? It is purifying the body and emptying the mind.\nWhat is tranquil dwelling? It is residing in a quiet chamber.\nWhat is concentrated contemplation? It is gathering the mind and returning to one’s nature.\nWhat is sitting in forgetfulness? It is abandoning form and forgetting the self.\nWhat is spiritual liberation? It is penetrating all dharmas with spirit.\n\nThus, practicing these five gradual gates (or, in one version: these five are called the *Five Gradual Gates*), mastering the first leads gradually to the second; mastering the second leads gradually to the third; mastering the third leads gradually to the fourth; mastering the fourth leads gradually to the fifth—then immortality is achieved.\n\n---\n\n**Chapter on Fasting and Abstinence**\n\nFasting and abstinence are not merely about vegetarian diet and food; purifying the body is not merely about bathing to remove filth. Their method lies in moderating food to regulate the center and in rubbing to smooth the exterior.\n\nHumans receive the qi of the Five Phases and consume the substances of the Five Phases, a reality present from the moment of forming in the womb. How can one abandon food and seek longevity? Yet worldly people do not know that abstaining from grains and ingesting qi is a provisional measure of Daoists—it is not a matter of permanently ceasing to eat. Thus (or, in one version: omitted), the fasting and abstinence in eating: fasting is the practice of purity and cleanliness; abstinence is the term for moderation (or, in one version: of the body).\n\nEat when hungry, but do not eat to satiety—this is called *regulating the center*. Do not eat foods that are not fully cooked, flavors that are too strong, or things that are spoiled and obstruct qi—these are all to be abstained from. Frequently rub the skin until it is warm, dispelling cold qi—this is called *smoothing the exterior*. Prolonged sitting, prolonged standing, prolonged labor, and prolonged exertion are all to be abstained from. Frequently rub the skin until it is warm, pressing out cold qi—this is called *smoothing the exterior*. Prolonged sitting, prolonged standing, prolonged labor, and prolonged toil are all to be abstained from. These are the methods for regulating the body; when the form is firm, qi is preserved. Thus, fasting and abstinence are the first of the gradual gates.\n\n---\n\n**Chapter on Tranquil Dwelling**\n\nWhat is tranquil dwelling?\n\nWhat is tranquil dwelling?\n\nIt is not the grandeur of ornate halls, deep chambers, layered cushions, or broad couches. Rather, it is to sit facing south and sleep with the head to the east, balancing yin and yang, with light and darkness in equal measure. The house should not be too high, for excessive height makes yang dominant and light overabundant; nor should it be too low, for excessive lowness makes yin dominant and darkness overabundant. Too much light harms the *po*, and too much darkness harms the *hun*. The *hun* belongs to yang, and the *po* to yin—if harmed by excess light or darkness, illness arises. If even the dwelling place must be thus regulated, how much more must one guard against the assault of scorching yang on the flesh or the encroachment of excessive yin on the body! Without such caution, how can one avoid harm? The gradual path of self-cultivation must follow this principle; otherwise, it is not the Way of tranquil dwelling.\n\nThus, I arrange my dwelling so that windows surround it on all sides: when the wind blows, I close them; when the wind subsides, I open them. My seat is set before a curtain and behind a screen: if the light is too bright, I lower the curtain to soften the inner glow; if too dark, I roll up the curtain to admit the outer radiance. Within, I calm the heart; without, I ease the eyes. When heart and eyes are at peace, the body is at peace. If even light and darkness must be so regulated, how much less can one find tranquility amid excessive cares and desires! Thus, in the study of the Dao, tranquil dwelling comes next.\n\n---\n\n**Chapter on Visualization**\n\n\"Visualization\" means preserving one’s spirit (*cun* my spirit) and contemplating one’s body (*xiang* my form). When the eyes close, one sees one’s own eyes; when the heart is gathered in, one sees one’s own heart. Heart and eyes remain inseparable from the body, unharmed in spirit—this is the beginning of visualization. Yet people’s eyes spend all day gazing at others, so the heart follows outward; the heart engages with external affairs all day, so the eyes look outward as well. Chasing fleeting appearances, they never turn inward—how can they avoid illness and premature death? Thus, returning to the root is called stillness; stillness is called the restoration of life. Preserving the inherent nature, abiding in it—this is the gateway to all wonders. This is the beginning of visualization, and half the work of studying the Dao.\n\n---\n\n**Chapter on Sitting in Forgetfulness**\n\nSitting in forgetfulness arises from visualization and culminates in forgetting. To practice the Dao without perceiving one’s practice—is this not the meaning of \"sitting\"? To perceive without acting on what is perceived—is this not the meaning of \"forgetting\"? What is \"not acting\"? It is the heart not moving. What is \"not perceiving\"? It is the form completely dissolved.\n\nSomeone asked, \"How can the heart be made unmoving?\"\n*Tianyinzi* remained silent and did not answer.\nAgain, they asked, \"How can the form be completely dissolved?\"\n*Tianyinzi* closed his eyes and did not look.\nThe questioner attained enlightenment and withdrew, saying, \"The Dao is truly within me! What am I, after all? What is *Tianyinzi*, after all?\" Thus, self and other were both forgotten, and nothing remained to be perceived.\n\n---\n\n**Chapter on Spiritual Understanding**\n\nFasting and abstinence are called *faithful understanding* (for without a faithful heart, one cannot understand). Tranquil dwelling is called *leisurely understanding* (for without a leisurely heart, one cannot understand). Visualization is called *wise understanding* (for without a wise heart, one cannot understand). Sitting in forgetfulness is called *stable understanding* (for without a stable heart, one cannot understand). Faith, leisure, stability, and wisdom—these four gates lead to spiritual understanding.\n\nThe meaning of *spirit* is this: it arrives without traveling, swift without haste; it transforms yin and yang, enduring as heaven and earth. Speaking of the Three Powers (heaven, earth, and humanity), it is called *Change* (as the *Xici* says: \"Exhaustion leads to change, change leads to penetration, penetration leads to endurance\"). Speaking of the myriad things as one, it is called *Dao and virtue* (as in the *Daodejing*). Speaking of the fundamental nature, it is called *Suchness* (as in the *Lotus Sutra*, *Śūraṅgama Sūtra*, and *Nirvāṇa Sūtra*—all refer to one nature). Entering into Suchness, returning to non-action (as the *Round Revelation Sūtra* says: \"The Buddha’s body is conditioned, but attains the unconditioned; the Buddha’s transformation body does not fall into any numerical category—all is one nature\").\n\nThus, *Tianyinzi* is born within the *Change*, dies within the *Change*, moves in response to the myriad things, and is still in response to the myriad things. Deviance and integrity both arise from one nature. Therefore, life and death, movement and stillness, deviance and integrity—I understand them all through spirit. In humanity, it is called *human immortal*; in heaven, *heavenly immortal*; on earth, *earthly immortal*; in water, *aquatic immortal*. Those who master transformation are called *spirit immortals*. Thus, the Way of immortals has five paths, but the gateway to gradual study is one (for the five gradual stages ultimately converge in immortality).\n\n*Chengzhen* recited *Tianyinzi*’s book for three years and suddenly attained insight. Following these five gates, he gradually advanced in practice. After another three years, he felt his body and heart at ease, and his attachment to fame and profit faded. After another three years, *Tianyinzi* appeared and transmitted oral instructions to him. The essential teaching lay in the visualization chapter: \"Return to the root, restore life; preserve the inherent nature, gateway to all wonders.\"\n\nThe root of a person arises from the *dantian*; restoring it brings long life—hence, \"return to the root, restore life.\" A person’s spiritual consciousness is rooted in inherent nature; when nature is unobstructed, it wondrously transforms the myriad things without exhaustion—hence, \"preserve the inherent nature, gateway to all wonders.\" Yet breath sustains life through qi, so I have the art of exhalation and inhalation; fluids arise from the water organs, so I have the art of rinsing and swallowing; thoughts arise from the heart’s discernment, so I have the art of visualization.\n\nThe body’s *ying* and *wei*, blood and vessels—when awake, they circulate externally; when asleep, they circulate internally. Waking and sleeping, internal and external, nourish each other in harmony. Then, each day from midnight (*zi* hour) to noon (*wu* hour), first lie flat and stretch the limbs, then rise to practice *daoyin* and regulate the breath until it is even.\n\nFirst, strike the front teeth lightly, producing a soft sound; then strike the molars forcefully, producing a loud sound. Rub the face and eyes with both hands until the body feels warm and comfortable. Then sit upright with legs crossed, stir the Flower Pool with the tongue, and wait for the fluids to arise before rinsing. Silently count the number, and after three hundred rinses, swallow once. When swallowing the fluids, wait until the exhalation settles before swallowing, then inhale afterward—thus the inhaled qi descends with the fluids to the lower cinnabar field. However, from midnight to noon, when food is digested and the heart is empty, rinse and swallow repeatedly, stopping only when the intention is fulfilled, regardless of the count.\n\nEvery five days marks one *hou*. At each *hou*, burn incense in a quiet chamber and visualize one’s body from head to feet, then from feet to the cinnabar field, ascending along the spinal marrow channel into the Mud Pill Palace. Envision a yellow qi swirling like clouds, directly piercing the Mud Pill Palace. After visualization, rinse and swallow again. Then cover the ears with both hands, tapping the head as if drumming, twenty-one times. Extend the legs, sit upright, bow the head, stretch the neck with full force, clench the fists, and place them beneath the ribs at the sides of the waist. Raise the shoulders alternately, hold the breath for a moment until the face reddens with qi, then stop. Perform this seven times, allowing the qi to ascend through the spinal marrow into the Mud Pill Palace—this is the great outline of Daoist cultivation.\n\nYet there is a further subtlety: to merge and move in unison with the true qi of Heaven and Earth. One must recognize the moment when qi arrives and discern where it departs. Thus, one may attain the same longevity as Heaven and Earth, becoming an immortal. The method begins at the *zi* hour on the night of the Winter Solstice, when the first yang qi arises. Whether early or late, one must first discern the signs of qi’s arrival; upon sensing its coming, circulate one’s own qi to harmonize with the qi of Heaven and Earth. The next day, await this qi again and regulate it accordingly. This is the most wondrous and refined technique of immortals, rarely grasped by others. If, within three hundred and sixty days, one’s own qi aligns with the true qi of Heaven and Earth two or three times, the body will naturally feel clear and harmonious, unlike ordinary days. With long practice and accumulated resonance, the Way of immortality is not difficult to attain.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "天隐子　　[唐]司马承祯 序 神仙之道，以长生为本； 长生之要，以养气为根。 夫气受之于天地，和之于阴阳。 阴阳神灵，谓之心主； 昼夜寤寐，谓之魂魄。 是故人之身，大率不远乎神仙之道矣。 天隐子，吾不知其何许人，着书八篇，包括秘妙，殆非人间所能力学者也。 观夫修炼形气，养和心灵，归根契于伯阳，遗照齐于庄叟，长生久视，无出是书。 承祯服习道风，惜乎世人，夭促真寿，思欲传之同志，使简易而行信哉。 自伯阳以来，惟天隐子而已。 唐司马承祯谨序 神仙章 人生时禀得灵气，精明通悟，学无滞塞，则谓之神。 宅神于内，遗照于外，自然异于俗人，则谓之神仙。 故神仙亦人也，在于修我灵气，勿为世俗所沦污； 遂我自然，勿为邪见所凝滞，则成功矣。 喜、怒、哀、乐、爱、恶、欲七者，情之邪也； 风、寒、暑、湿、饥、饱、劳、佚八者，气之邪也，去此邪，仙道近矣。 易简章 《易》曰“天地之道易简”者，何也？ 天隐子曰：天地在我首之上、足之下，开目尽见，无假繁巧而言，故曰易简。 易简者，神仙之谓也（经曰：至道不繁，至人无为）。 然则以何道求之？ 曰：无求不能知，无道不能成。 凡学神仙，先知易简。 苟言涉奇诡，适足使人执迷无所归本，此非吾学也（世人学仙反为仙所迷者，有矣； 学气反为气所病者，有矣）。 渐门章 《易》有渐卦，道〖一本作：老氏〗有渐门，人之修真达性，不能顿悟，必须渐而进之，安而行之，故设渐门。 观我所入，则道可见矣。 渐有五门，一曰斋戒，二曰安处，三曰存想，四曰坐忘，五曰神解。 何谓斋戒？ 曰：澡身虚心。 何谓安处？ 曰：深居静室。 何谓存想？ 曰：收心复性。 何谓坐忘？ 曰：遗形忘我。 何谓神解？ 曰：万法通神。 故习此五渐之门者〖一本作：故习此五者，曰五渐之门〗。 〖一本此处有“先”〗了一，则渐次至二； 了二，则渐次至三； 了三，则渐次至四； 了四，则渐次至五，神仙成矣。 斋戒章 斋戒者，非蔬茹饮食而已； 澡身者，非汤浴去垢而已。 盖其法在节食调中，磨擦畅外者也。 夫人禀五行之气，而食五行之物，实自胞胎有形已〖一本作“也”〗。 呼吸精血，岂可去食而求〖一本此处有“其”〗长生！ 但世人不知休粮服气，是〖一本无“是”〗道家之〖一本无“之”〗权宜，非永绝粒食之谓也。 故〖一本无“故”〗食之有斋戒者，斋乃洁净之务，戒乃节约〖一本作“身”〗之称。 有饥即食，食勿令饱，此所谓调中也。 百味未成熟勿食，五味太多勿食，腐败闭气之物勿食，此皆宜戒也。 手常磨擦皮肤温热，去冷气，此所谓畅外也。 久坐、久立、久劳役，皆宜戒也。 手常摩擦皮肤温热，熨去冷气，此所谓畅外也。 久坐、久立、久劳、久役皆宜戒，此是调理形骸之法，形坚则气全，是以斋戒为渐门之首矣。 安处章 何谓安处？",
      "translated_text": "**Preface by Sima Chengzhen of the Tang Dynasty**\n\nThe Dao of immortals takes longevity as its foundation; the essence of longevity lies in nurturing qi as its root. Qi is received from Heaven and Earth and harmonized through yin and yang. The numinous spirit of yin and yang is called the heart’s governance; waking and sleeping are called the hun and po. Thus, the human body is, in most respects, not far from the Dao of immortals.\n\n*Tianyinzi*—I know not from whence this person came—composed eight chapters, encompassing profound mysteries, which are scarcely within the capacity of worldly scholars. Observing his refinement of form and qi, cultivation of harmonious spirit, return to the root in accord with Boyang (Laozi), and abandonment of illumination equal to Zhuangzi, one finds no text surpassing this for attaining long life and enduring vision. Having devoted myself to the practice of the Dao, I lament that worldly people, their true lifespans cut short, might yet transmit this to like-minded seekers, that they may follow its simplicity and trust its truth. Since Boyang, only *Tianyinzi* stands thus.\n\n**Respectfully inscribed by Sima Chengzhen of the Tang**\n\n---\n\n**Chapter on Immortals**\n\nAt birth, humans receive numinous qi, their essence bright and perception unobstructed. When learning encounters no blockage, this is called *shen* (spirit). Dwelling spirit within and casting illumination without, one naturally differs from the vulgar—this is called *shenxian* (immortal). Thus, immortals are also human; it lies in refining one’s numinous qi, not allowing it to be defiled by worldly customs, and following one’s nature, not being hindered by perverse views—then success is achieved.\n\nJoy, anger, sorrow, happiness, love, aversion, and desire—these seven are the deviations of emotion. Wind, cold, heat, dampness, hunger, satiety, fatigue, and indolence—these eight are the deviations of qi. Remove these deviations, and the Dao of immortality draws near.\n\n---\n\n**Chapter on Simplicity**\n\nThe *Yijing* states, “The Dao of Heaven and Earth is simple.” Why? *Tianyinzi* says: Heaven and Earth lie above my head and beneath my feet; with eyes open, all is seen without reliance on elaborate contrivance—hence, it is called *simple*. Simplicity is the designation of the immortal’s Dao (as the scripture says: “The supreme Dao is not cumbersome; the perfected person does nothing”).\n\nThen by what Dao is it sought? It is said: Without seeking, one cannot know; without the Dao, one cannot achieve. In learning immortality, one must first understand simplicity. If words touch upon the strange or deceptive, they only lead people to cling in delusion without returning to the root—this is not my teaching. (There are those in the world who study immortality yet are deluded by it; those who study qi yet are harmed by it.)\n\n---\n\n**Chapter on Gradual Entry**\n\nThe *Yijing* has the *Gradual* hexagram; the Dao (or, in one version: *Laozi*) has the *Gradual Gate*. In cultivating truth and realizing nature, one cannot attain sudden enlightenment but must advance gradually, proceeding with ease. Thus, the *Gradual Gate* is established.\n\nObserve where I enter, and the Dao becomes visible. The *Gradual Gate* has five stages: first, fasting and abstinence; second, tranquil dwelling; third, concentrated contemplation; fourth, sitting in forgetfulness; fifth, spiritual liberation.\n\nWhat is fasting and abstinence? It is purifying the body and emptying the mind.\nWhat is tranquil dwelling? It is residing in a quiet chamber.\nWhat is concentrated contemplation? It is gathering the mind and returning to one’s nature.\nWhat is sitting in forgetfulness? It is abandoning form and forgetting the self.\nWhat is spiritual liberation? It is penetrating all dharmas with spirit.\n\nThus, practicing these five gradual gates (or, in one version: these five are called the *Five Gradual Gates*), mastering the first leads gradually to the second; mastering the second leads gradually to the third; mastering the third leads gradually to the fourth; mastering the fourth leads gradually to the fifth—then immortality is achieved.\n\n---\n\n**Chapter on Fasting and Abstinence**\n\nFasting and abstinence are not merely about vegetarian diet and food; purifying the body is not merely about bathing to remove filth. Their method lies in moderating food to regulate the center and in rubbing to smooth the exterior.\n\nHumans receive the qi of the Five Phases and consume the substances of the Five Phases, a reality present from the moment of forming in the womb. How can one abandon food and seek longevity? Yet worldly people do not know that abstaining from grains and ingesting qi is a provisional measure of Daoists—it is not a matter of permanently ceasing to eat. Thus (or, in one version: omitted), the fasting and abstinence in eating: fasting is the practice of purity and cleanliness; abstinence is the term for moderation (or, in one version: of the body).\n\nEat when hungry, but do not eat to satiety—this is called *regulating the center*. Do not eat foods that are not fully cooked, flavors that are too strong, or things that are spoiled and obstruct qi—these are all to be abstained from. Frequently rub the skin until it is warm, dispelling cold qi—this is called *smoothing the exterior*. Prolonged sitting, prolonged standing, prolonged labor, and prolonged exertion are all to be abstained from. Frequently rub the skin until it is warm, pressing out cold qi—this is called *smoothing the exterior*. Prolonged sitting, prolonged standing, prolonged labor, and prolonged toil are all to be abstained from. These are the methods for regulating the body; when the form is firm, qi is preserved. Thus, fasting and abstinence are the first of the gradual gates.\n\n---\n\n**Chapter on Tranquil Dwelling**\n\nWhat is tranquil dwelling?",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1111,
      "start_sentence": 0,
      "end_sentence": 63,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.669185161590576,
      "metadata": {
        "source_file": "dao\\藏外\\天隐子.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "曰：非华堂邃宇、重裀广榻之谓也。 在乎南向而坐，东首而寝，阴阳适中，明暗相半。 屋无高，高则阳盛而明多； 屋无卑，卑则阴盛而暗多。 故明多则伤魄，暗多则伤魂。 人之魂阳而魄阴，苟伤明暗〖一本作：伤于明暗〗，则病疾生焉。 此所谓居处之室，尚使之然，况天地之气〖一本作：此所以居处之室，必使之能向天地之气〗，有〖一本作：若〗亢阳之攻肌，淫阴之侵体，岂可不防慎哉〖一本作：岂不伤哉〗！ 修养之渐，倘不法此，非安处之道。 术〖一本作：故〗曰吾所居室，四边皆窗户，遇风即阖，风息即开； 吾所居座，前帘后屏，太明则下帘以和其内映，太暗则卷帘以通其外曜。 内以安其心，外以安其目，心目皆安，则身安矣。 明暗尚然，况太多事虑，太多情欲，岂能安其内外哉！ 故学道以安处为次。 存想章 存谓存我之神，想谓想我之身。 闭目即见自己之目，收心即见自己之心。 心与目皆不离成身，不伤我神，则存想之渐也。 凡人目终日视他人。 故心亦逐外走； 心终日接他事，故目亦逐外瞻〖一本作：视〗。 营营浮光，未尝复照，奈何不病且夭耶？ 是以归根曰静，静曰复命，成性存存，众妙之门。 此存想之渐，学道之功半矣。 坐忘章 坐忘者，因存想而得，因存想而忘也。 行道而不见其行，非坐之义乎？ 有见而不行其见，非忘之义乎？ 何谓不行？ 曰：心不动故。 何谓不见？ 曰：形都泯故。 或问曰：何由得心不动？ 天隐子默而不答。 又问：何由得形都泯？ 天隐子瞑而不视。 或者悟道，乃退曰：道果在我矣！ 我果何人哉？ 天隐子果何人哉？ 于是彼我两忘，了无所照。 神解章 斋戒谓之信解（言无信心则不能解），安处谓之闲解（言无闲心则不能解），存想谓之慧解（言无慧心则不能解），坐忘谓之定解（言无定心则不能解），信、闲、定、慧四门通神，谓之神解。 夫神之为义，不行而至，不疾而速，阴阳变通，天地长久，兼三才而言谓之易（系辞云：穷则变，变则通，通则久），齐万物而言谓之道德（老子《道德经》是也），本一性而言谓之真如（释氏《法华》、《楞严》、《涅盘》皆一性）。 入于真如，归于无为（《圆觉经》云：佛身有为，至于无为，佛化身不堕诸数皆一性）。 故天隐子生乎易中，死乎易中，动因万物，静因万物，邪由一性，贞由一性，是以生死动静邪贞，吾皆以神而解之。 在人谓之人仙，在天曰天仙，在地曰地仙，在水曰水仙，能通变化之曰神仙。 故神仙之道有五，其渐学之门则一焉（谓五渐终同归于仙矣）〖一本作：故神仙之道，同归一门〗。 承祯诵天隐子之书三年，恍然有所悟，乃依此五门渐渐进习。 又三年，觉身心之闲，而名利之趣淡矣。 又三年，天隐子出焉，授之以口诀。 其要在存想篇“归根复命、成性众妙”者是也。 夫人之根本由丹田而生，能复则长命，故曰归根复命。 夫人之灵识，本乎理性，性通则妙万物而不穷，故曰成性众妙。 然而呼吸由气而活，故我有吐纳之诀； 津液由水藏而生，故我有漱咽之诀； 思虑由心识而动，故我有存想之诀。 人身荣卫血脉，寤即行于外，寐即行于内，寤寐内外，相养和平。 然后每日自夜半子时至日中午时，先平卧，舒展四肢，次起身导引，喘息均定。",
      "translated_text": "What is tranquil dwelling?\n\nIt is not the grandeur of ornate halls, deep chambers, layered cushions, or broad couches. Rather, it is to sit facing south and sleep with the head to the east, balancing yin and yang, with light and darkness in equal measure. The house should not be too high, for excessive height makes yang dominant and light overabundant; nor should it be too low, for excessive lowness makes yin dominant and darkness overabundant. Too much light harms the *po*, and too much darkness harms the *hun*. The *hun* belongs to yang, and the *po* to yin—if harmed by excess light or darkness, illness arises. If even the dwelling place must be thus regulated, how much more must one guard against the assault of scorching yang on the flesh or the encroachment of excessive yin on the body! Without such caution, how can one avoid harm? The gradual path of self-cultivation must follow this principle; otherwise, it is not the Way of tranquil dwelling.\n\nThus, I arrange my dwelling so that windows surround it on all sides: when the wind blows, I close them; when the wind subsides, I open them. My seat is set before a curtain and behind a screen: if the light is too bright, I lower the curtain to soften the inner glow; if too dark, I roll up the curtain to admit the outer radiance. Within, I calm the heart; without, I ease the eyes. When heart and eyes are at peace, the body is at peace. If even light and darkness must be so regulated, how much less can one find tranquility amid excessive cares and desires! Thus, in the study of the Dao, tranquil dwelling comes next.\n\n---\n\n**Chapter on Visualization**\n\n\"Visualization\" means preserving one’s spirit (*cun* my spirit) and contemplating one’s body (*xiang* my form). When the eyes close, one sees one’s own eyes; when the heart is gathered in, one sees one’s own heart. Heart and eyes remain inseparable from the body, unharmed in spirit—this is the beginning of visualization. Yet people’s eyes spend all day gazing at others, so the heart follows outward; the heart engages with external affairs all day, so the eyes look outward as well. Chasing fleeting appearances, they never turn inward—how can they avoid illness and premature death? Thus, returning to the root is called stillness; stillness is called the restoration of life. Preserving the inherent nature, abiding in it—this is the gateway to all wonders. This is the beginning of visualization, and half the work of studying the Dao.\n\n---\n\n**Chapter on Sitting in Forgetfulness**\n\nSitting in forgetfulness arises from visualization and culminates in forgetting. To practice the Dao without perceiving one’s practice—is this not the meaning of \"sitting\"? To perceive without acting on what is perceived—is this not the meaning of \"forgetting\"? What is \"not acting\"? It is the heart not moving. What is \"not perceiving\"? It is the form completely dissolved.\n\nSomeone asked, \"How can the heart be made unmoving?\"\n*Tianyinzi* remained silent and did not answer.\nAgain, they asked, \"How can the form be completely dissolved?\"\n*Tianyinzi* closed his eyes and did not look.\nThe questioner attained enlightenment and withdrew, saying, \"The Dao is truly within me! What am I, after all? What is *Tianyinzi*, after all?\" Thus, self and other were both forgotten, and nothing remained to be perceived.\n\n---\n\n**Chapter on Spiritual Understanding**\n\nFasting and abstinence are called *faithful understanding* (for without a faithful heart, one cannot understand). Tranquil dwelling is called *leisurely understanding* (for without a leisurely heart, one cannot understand). Visualization is called *wise understanding* (for without a wise heart, one cannot understand). Sitting in forgetfulness is called *stable understanding* (for without a stable heart, one cannot understand). Faith, leisure, stability, and wisdom—these four gates lead to spiritual understanding.\n\nThe meaning of *spirit* is this: it arrives without traveling, swift without haste; it transforms yin and yang, enduring as heaven and earth. Speaking of the Three Powers (heaven, earth, and humanity), it is called *Change* (as the *Xici* says: \"Exhaustion leads to change, change leads to penetration, penetration leads to endurance\"). Speaking of the myriad things as one, it is called *Dao and virtue* (as in the *Daodejing*). Speaking of the fundamental nature, it is called *Suchness* (as in the *Lotus Sutra*, *Śūraṅgama Sūtra*, and *Nirvāṇa Sūtra*—all refer to one nature). Entering into Suchness, returning to non-action (as the *Round Revelation Sūtra* says: \"The Buddha’s body is conditioned, but attains the unconditioned; the Buddha’s transformation body does not fall into any numerical category—all is one nature\").\n\nThus, *Tianyinzi* is born within the *Change*, dies within the *Change*, moves in response to the myriad things, and is still in response to the myriad things. Deviance and integrity both arise from one nature. Therefore, life and death, movement and stillness, deviance and integrity—I understand them all through spirit. In humanity, it is called *human immortal*; in heaven, *heavenly immortal*; on earth, *earthly immortal*; in water, *aquatic immortal*. Those who master transformation are called *spirit immortals*. Thus, the Way of immortals has five paths, but the gateway to gradual study is one (for the five gradual stages ultimately converge in immortality).\n\n*Chengzhen* recited *Tianyinzi*’s book for three years and suddenly attained insight. Following these five gates, he gradually advanced in practice. After another three years, he felt his body and heart at ease, and his attachment to fame and profit faded. After another three years, *Tianyinzi* appeared and transmitted oral instructions to him. The essential teaching lay in the visualization chapter: \"Return to the root, restore life; preserve the inherent nature, gateway to all wonders.\"\n\nThe root of a person arises from the *dantian*; restoring it brings long life—hence, \"return to the root, restore life.\" A person’s spiritual consciousness is rooted in inherent nature; when nature is unobstructed, it wondrously transforms the myriad things without exhaustion—hence, \"preserve the inherent nature, gateway to all wonders.\" Yet breath sustains life through qi, so I have the art of exhalation and inhalation; fluids arise from the water organs, so I have the art of rinsing and swallowing; thoughts arise from the heart’s discernment, so I have the art of visualization.\n\nThe body’s *ying* and *wei*, blood and vessels—when awake, they circulate externally; when asleep, they circulate internally. Waking and sleeping, internal and external, nourish each other in harmony. Then, each day from midnight (*zi* hour) to noon (*wu* hour), first lie flat and stretch the limbs, then rise to practice *daoyin* and regulate the breath until it is even.",
      "overlap_context": "g, prolonged labor, and prolonged exertion are all to be abstained from. Frequently rub the skin until it is warm, pressing out cold qi—this is called *smoothing the exterior*. Prolonged sitting, prolonged standing, prolonged labor, and prolonged toil are all to be abstained from. These are the methods for regulating the body; when the form is firm, qi is preserved. Thus, fasting and abstinence are the first of the gradual gates.\n\n---\n\n**Chapter on Tranquil Dwelling**\n\nWhat is tranquil dwelling?",
      "start_char": 1111,
      "end_char": 2355,
      "start_sentence": 64,
      "end_sentence": 120,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 31.079890251159668,
      "metadata": {
        "source_file": "dao\\藏外\\天隐子.txt",
        "category": "藏外"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "乃先叩当门齿，小鸣； 后叩大齿，大鸣。 以两手摩面及眼，身觉暖畅。 复端坐盘足，以舌搅华池，候津液生而漱之，默记其数，数及三百而一咽之。 凡咽津，候呼定而咽，咽毕而吸，如此则吸气与津顺下丹田也。 但子后午前食消心空之时，频频漱咽，无论遍数，意尽则止。 凡五日为一候，每候当焚香于静室中，存想自身，从首至足，又自足至丹田，泝上脊膂脉，入于泥丸。 所想其黄气纷纷然，如云直贯泥丸，想毕复漱咽。 乃以两手掩两耳，搭其脑，如鼓鸣，三七下，伸两足端坐俛首，极力直颈，两手握固，叉于两胁下，接腰胁骨傍。 乃左右耸两肩甲，闭息顷刻，气盈面赤则止，凡行七遍，气从脊膂上彻泥丸，此修道之大纲也。 然更有要妙，在乎与天地真气冥契同运，能识气来之时，又辨气往之所，若是则与天地齐其长久，谓之神仙矣。 法起于冬至夜子时，一阳气始来，或迟或早，先须辨气来形候，才觉气来，则运自己之气适与天地之气偕作。 次日复候此气而消息之。 此是神仙至妙至精之术，人罕达之。 倘三百六十日内，运自己之气适合天地之真气三两次，则自觉身体清和，异于常时矣。 况久久习之，积累冥契，则神仙之道不难至矣。",
      "translated_text": "First, strike the front teeth lightly, producing a soft sound; then strike the molars forcefully, producing a loud sound. Rub the face and eyes with both hands until the body feels warm and comfortable. Then sit upright with legs crossed, stir the Flower Pool with the tongue, and wait for the fluids to arise before rinsing. Silently count the number, and after three hundred rinses, swallow once. When swallowing the fluids, wait until the exhalation settles before swallowing, then inhale afterward—thus the inhaled qi descends with the fluids to the lower cinnabar field. However, from midnight to noon, when food is digested and the heart is empty, rinse and swallow repeatedly, stopping only when the intention is fulfilled, regardless of the count.\n\nEvery five days marks one *hou*. At each *hou*, burn incense in a quiet chamber and visualize one’s body from head to feet, then from feet to the cinnabar field, ascending along the spinal marrow channel into the Mud Pill Palace. Envision a yellow qi swirling like clouds, directly piercing the Mud Pill Palace. After visualization, rinse and swallow again. Then cover the ears with both hands, tapping the head as if drumming, twenty-one times. Extend the legs, sit upright, bow the head, stretch the neck with full force, clench the fists, and place them beneath the ribs at the sides of the waist. Raise the shoulders alternately, hold the breath for a moment until the face reddens with qi, then stop. Perform this seven times, allowing the qi to ascend through the spinal marrow into the Mud Pill Palace—this is the great outline of Daoist cultivation.\n\nYet there is a further subtlety: to merge and move in unison with the true qi of Heaven and Earth. One must recognize the moment when qi arrives and discern where it departs. Thus, one may attain the same longevity as Heaven and Earth, becoming an immortal. The method begins at the *zi* hour on the night of the Winter Solstice, when the first yang qi arises. Whether early or late, one must first discern the signs of qi’s arrival; upon sensing its coming, circulate one’s own qi to harmonize with the qi of Heaven and Earth. The next day, await this qi again and regulate it accordingly. This is the most wondrous and refined technique of immortals, rarely grasped by others. If, within three hundred and sixty days, one’s own qi aligns with the true qi of Heaven and Earth two or three times, the body will naturally feel clear and harmonious, unlike ordinary days. With long practice and accumulated resonance, the Way of immortality is not difficult to attain.",
      "overlap_context": "so I have the art of rinsing and swallowing; thoughts arise from the heart’s discernment, so I have the art of visualization.\n\nThe body’s *ying* and *wei*, blood and vessels—when awake, they circulate externally; when asleep, they circulate internally. Waking and sleeping, internal and external, nourish each other in harmony. Then, each day from midnight (*zi* hour) to noon (*wu* hour), first lie flat and stretch the limbs, then rise to practice *daoyin* and regulate the breath until it is even.",
      "start_char": 2355,
      "end_char": 2817,
      "start_sentence": 121,
      "end_sentence": 136,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.218536376953125,
      "metadata": {
        "source_file": "dao\\藏外\\天隐子.txt",
        "category": "藏外"
      }
    }
  ]
}