{
  "source_id": "太上正一延生保命箓",
  "source_file": "chunked_daozang\\太上正一延生保命箓.json",
  "total_chunks": 4,
  "total_original_chars": 2325,
  "total_translated_chars": 16974,
  "total_translation_time": 81.3197124004364,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\太上正一延生保命箓.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Orthodox Unity Register for Prolonging Life and Preserving Destiny**\n\n**Title:** *The Supreme Orthodox Unity Register for Prolonging Life and Preserving Destiny*. The original text does not specify an author; it emerged in the early Ming dynasty. One fascicle. Source text: *Zhengtong Daoist Canon*, Orthodox Unity Section, First Subsection.\n\n---\n\nThe *Supreme Orthodox Unity Register for Prolonging Life and Preserving Destiny*\n\nAccording to the native place and official position of the faithful Daoist devotee [Name], born in the year, month, day, and hour of [Birth Details], under the celestial governance of the Star Lord of the Northern Dipper [Specific Star], it is humbly stated:\n\nHaving long borne within myself the divine *qi* of the Supreme High Emperor Wang, yet unable to discern its workings, I now sincerely confess before the Dao: summoned by the Three *Qi* Lords, I today reverently present ritual offerings and, with bowed head, approach the gate of the Heavenly Master of Dragon-Tiger Mountain, successor of the Han, to receive the *Supreme Orthodox Unity Register for Prolonging Life and Preserving Destiny* of the first rank. Through cultivating the body and refining the self, I seek to preserve my destiny and shield my person, transcend a thousand calamities, dispel ten thousand evils, prolong my years, and augment my allotted span. Should I violate the precepts and covenants, may I suffer immediate harm. I humbly pray that the primordial grace of the Great Dao bestow its aid, augment my spiritual vitality, and circulate the true *qi*, bringing blessings to all beings. May my seven ancestors and nine generations alike be delivered and uplifted. By inscribing talismans and consecrating water, I shall heal the sick and succor the perilous, placing others before myself, bestowing without expectation of reward, and accomplishing without self-aggrandizement. Through such conduct, the Dao shall swiftly manifest.\n\nSwiftly, swiftly, in accordance with the statutes and decrees descended from the Supreme Orthodox Unity!\n\n---\n\nThe Most High Lord Lao, upon the Three Heavens of Primordial Origin, together with the perfected and sagely deities of the ten directions, the Celestial Worthies of Longevity, Life-Preservation, and Body-Protection, and the host of attained immortals—true immortals, flying immortals, merciful deliverers from distress, those who respond to cries for aid, those who rescue the living and ferry the dead, and the myriad-fortune guardians of the body—surveyed the world and beheld men and women, each beset by the three disasters and nine calamities, the ten sufferings and eight hardships, encountering misfortune and meeting with woe, without means to expiate or avert them. Sinking into the three lower realms, adrift among the six destinies, they were forever consigned to hell.\n\nThe Celestial Worthy, witnessing this, took pity on all beings and taught the method of expiating transgressions, rescuing the living and ferrying the dead, that they might escape the torments of sin. Should any man or woman be afflicted by the pestilential poisons of the Six Heavens, by water or fire, bandits or thieves, serpents or tigers, demons or malevolent spirits, by the curses of wicked persons, or by the cumulative misfortunes of karmic retribution, or the illnesses wrought by the five earthly influences, let their household unite in heart to perform the fast, establish an altar, and array incense, flowers, lamps, and candles. Let them invite a Daoist priest of the Three Caverns to burn incense, perform the Dao, recite scriptures, and wear the register, cultivating in accordance with the proper method. Thereby, all disasters and misfortunes shall be forever dissolved.\n\nOn the ten auspicious days, the eight solar terms, the Three Primordials, one’s own natal day, and the birthdays of one’s parents, let them perform the fast and wear the register to safeguard their household. Thus shall they receive the descent of great divine power, preserving their destiny and protecting their person. Should one’s original destiny be afflicted by the six harms or ten evils, let them perform the fast and wear the register, and they shall dispel calamities and eradicate misfortune, preserving their destiny and protecting their person. Should one’s parents, spouse, or partner have passed away, let them perform the fast and wear the register with the aspiration that their departed kin ascend to heaven. Thus shall they deliver the deceased from distress and protect the living. Should one’s original destiny be afflicted by the six harms or the baleful *qi* of death, let them perform the fast and wear the register, and they shall dissolve harm, extinguish demonic influences, and remain free from disaster, hardship, and unexpiated sins, preserving their destiny and protecting their person, forever attaining purity.\n\nIn the East, the Azure-Riding Celestial Officials and their armies, nine hundred million strong,\nIn the East, the Diamond Warriors for Life-Preservation and Body-Protection, nine hundred million strong,\n\nIn the South, the Vermilion-Riding Celestial Officials and their armies, three hundred million strong,\nIn the South, the Diamond Warriors for Life-Preservation and Body-Protection, three hundred million strong,\nIn the West, the White-Riding Celestial Officials and their armies, seven hundred million strong,\nIn the West, the Diamond Warriors for Life-Preservation and Body-Protection, seven hundred million strong,\nIn the North, the Black-Riding Celestial Officials and their armies, five hundred million strong,\nIn the North, the Diamond Warriors for Life-Preservation and Body-Protection, five hundred million strong,\nIn the Center, the Yellow-Riding Celestial Officials and their armies, twelve hundred million strong,\nIn the Center, the Heavenly Chariot Armored Soldiers for Life-Preservation and Body-Protection, twelve hundred million strong,\nThe Ten Directions’ Life-Preserving Soldiers, one thousand billion strong,\nThe Ten Directions’ Body-Protecting Soldiers, one thousand billion strong,\nThe Ten Directions’ Harm-Dissolving Soldiers, one thousand billion strong,\nThe Ten Directions’ Disease-Expelling Soldiers, one thousand billion strong,\nThe Ten Directions’ Disaster-Dispelling Soldiers, one thousand billion strong,\nThe Ten Directions’ Life-Protecting Soldiers, one thousand billion strong,\nThe Ten Directions’ Deceased-Ancestor-Releasing Soldiers, one thousand billion strong,\nThe Ten Directions’ Pestilence-Severing Soldiers, one thousand billion strong,\nThe Ten Directions’ Poison-Eradicating Soldiers, one thousand billion strong,\nThe Ten Directions’ Oath-Dissolving Soldiers, one thousand billion strong,\nThe Ten Directions’ Pain-Healing Soldiers, one thousand billion strong,\nThe Ten Directions’ Demon-Severing Soldiers, one thousand billion strong,\nThe Ten Directions’ Dharma-Assisting Soldiers, one thousand billion strong,\nThe Ten Directions’ Scripture-Protecting Warriors, one thousand billion strong,\nThe Heavenly Numinous Officials’ Life-Monitoring Envoys, three in number,\nThe Heavenly Numinous Officials’ Life-Protecting Envoys, three in number,\nThe Heavenly Numinous Officials’ Longevity-Ensuring Envoys, three in number,\nThe Heavenly Numinous Officials’ Bian Que Grand Physicians, three in number,\nThe Heavenly Numinous Officials’ Black Register-Erasing Clerks, three in number,\nThe Heavenly Numinous Officials’ Dipper-Binding Fate-Recording Lords, nine in number,\nThe Heavenly Numinous Officials’ Southern Dipper Life-Registering Lords, three in number,\nThe Heavenly Numinous Officials’ Western Dipper Name-Recording Lords, seven in number,\nThe Heavenly Numinous Officials’ Northern Dipper Death-Registering Lords, five in number,\nThe Heavenly Numinous Officials’ Central Dipper Great Chief Lords, twelve in number.\n\nThe above talismans and cinnabar-script registers are thus inscribed.\n\nThe Orthodox Unity Perfected Person states: In the world, good men and faithful women who receive and wear the *Tai Shang Zheng Yi Yan Sheng Bao Ming Lu* (Register of the Supreme Orthodox Unity for Extending Life and Preserving Destiny), reverently uphold and honor it. The immortals and true clerks shall guard and protect their persons, their names inscribed upon golden tablets, enabling them to attain longevity. Their seven generations of ancestors shall ascend, their positions elevated among the heavenly beings. Let them diligently observe and uphold this.\n\nThe disciple [Name] hereby presents sincerity and faith, respectfully approaching the gate of the Heavenly Master, to receive the *Tai Shang Zheng Yi Yan Sheng Bao Ming Lu* of the first rank. I vow to cultivate and uphold it, never daring to treat the sacred script lightly. Should I violate this, I willingly accept the judgments of the unseen realm, never blaming the Dao or faulting my master, in accordance with the mysterious statutes and ordinances.\n\n**The *Tai Shang Zheng Yi Yan Sheng Bao Ming Lu* (Register of the Supreme Orthodox Unity for Extending Life and Preserving Destiny)**\n\n**Method for Requesting the Register**\n\n**Prayer for Requesting the *Tai Shang Zheng Yi Yan Sheng Bao Ming Lu*:**\n\nOn this day, month, and year of [Date], I, [Name], a Daoist believer residing in [Place], humbly state: Born on [Birth Date and Hour], my life is governed by the oversight of the [Specific] Star Lord of the Northern Dipper. Today, I respectfully present ritual offerings and bow my head, reverently approaching the gate of the Heavenly Master of Dragon-Tiger Mountain, Successor to the Han, to receive the *Tai Shang Zheng Yi Yan Sheng Bao Ming Lu* of the first rank.\n\nI reflect that the Dao bestows form, and the hundred spirits silently attend within the *niwan* (mud-pellet palace). Heaven endows the body, and the myriad *qi* collectively sustain the jade chamber. Cultivating correctness, the numinous and the hidden mutually assist; succumbing to delusion, calamities and harms assail from all sides. The majesty of the body’s radiance ensures that destiny does not await protection to protect itself. Receiving the celestial register and its methods, the spirits, though not consciously preserved, are silently preserved. Extending blessings and prolonging years, the self-inflicted demonic afflictions are dispelled. Abiding in constant purity and stillness, one safeguards the auspiciousness of ultimate cessation. Having beheld the compassionate light, I reverently adhere to the solemn precepts. I am utterly sincere in my supplication. Respectfully, this prayer.\n\nAt the gate of the Heavenly Master, the disciple [Name] presents sincerity and faith, approaching the Dao to declare the request for the *Tai Shang Zheng Yi Yan Sheng Bao Ming Lu* of the first rank, and to seek the sacred name of the true master for lifelong reverence. Today, based on the submitted prayer, I swear an oath before Heaven and Earth, pledge before the Three Officials, break the contract and divide the ring, and transmit and confer the register in accordance with the statutes. As follows:\n\n**Register of the First Rank**\n*The Tai Shang Zheng Yi Yan Sheng Bao Ming Lu*\n\n**Ritual Outline: Essential Points for Cultivating Perfection in the Orthodox Unity Tradition**\n\n**Sacred Names of the Three Ancestral and Mysterious Masters**\n- **Ancestral Master**: The Three Heavens’ Upholder of the Dao, Augmenter of Primordial Qi, Grand Master of Orthodox Unity, Impelling Mystery and Divine Transformation, Serene Resonance and Manifest Protection, Perfected Lord Zhang Daoling.\n- **Mysterious Master**: Successor Master, Perfected Lord Zhang Heng of Supreme Clarity, Expounder of the Wondrous Dao.\n- **Perfected Master**: Lineage Master, Perfected Lord Zhang Lu of Supreme Clarity, Radiant Transformation and Vast Virtue.\n\n**Sacred Names of the Three Masters of Scriptures, Registers, and Transmission**\n- **Scripture Master**: Supreme Clarity’s Three Caverns Scripture Register, Perfected Noble of the Southern Bureau, Minister of the Jade Treasury, Chief of All-Heaven Great Dharma, Forty-Second Celestial Master of the Han Succession, Zhang Zhengchang.\n- **Register Master**: Supreme Clarity’s Three Caverns Scripture Register, True Sovereign of the Great Ultimate, Enforcer of the Numinous Treasure, Leader of the Daoist Teachings, Perfected Person of All-Heaven Great Dharma, Forty-Third Celestial Master of the Han Succession, Zhang Yuchu.\n- **Transmission Master**: Supreme Clarity’s Three Caverns Treasure Register, Numinous Treasure Leader of the Mysterious Transformation, Enforcer of the Southern Bureau, Divine Sovereign of All-Heaven Great Dharma, Forty-Fourth Celestial Master of the Succession, Zhang Yuqing.\n\n**Officiating Master’s Dharma Name**\n**Witnessing Master**\n**Oath-Swearing Master**\n\n**Supervising Transmission Master**  \n**Recommending Master**\n\nThe Orthodox Master of the Celestial Masters, Zhengying, declares: The profound words of the Mystic Sages and the secret writs of the Heavenly Perfected serve to sustain the declining and deliver the distressed. One must recognize the numinous power of the Three Primes’ Flowery Canopy, which preserves life and prolongs existence—this is what is meant by the Register of the Five Dipper’s Concealing the Body. Its resonance is effortlessly efficacious, its blessings and benefits boundless. Thus did the Most High establish the teachings, transmitting them as a worldly learning. Thereupon, successive generations of Perfected Masters upheld and proclaimed the precious instructions, drawing in those with karmic affinity, their lineage unbroken through the ages.\n\nBy virtue of my ancestral blessings, I have borne the grace of the state through the generations, inheriting the transmission of the Orthodox Unity lineage and reviving the ancestral thread of the Heavenly Eye. Yet as the transmission of the Dharma Registers and the succession of generations grow ever more distant, I have selected skilled artisans to carve wood into books, ensuring the perpetuation of their legacy.\n\nAs for the observance of precepts and the cultivation of compassion, from ancient times to the present, all perfected beings have acted thus. Those who ascend the altar as devout believers must purify their inner vision, accumulate merit through virtuous deeds, and thereby fulfill their vows, transcending the mundane to enter the wondrous. The covenant thus illuminated—how could one not be vigilant?\n\nThe Celestial Master, Guangwei Zi, declares: For over fifteen hundred years, my family has employed the talismans and registers of the Most High to deliver beings across heaven and earth, safeguarding the nation’s destiny. The ancestral teachings are resplendently clear—what need is there for superfluous praise?\n\nWhen my predecessor, the Perfected Lord, encountered the sagely dynasty’s unification of the realm, he was first to receive veneration. The cap-and-robe-clad of Jiangnan were all placed under his jurisdiction. Since I inherited the teaching, the imperial courts of three reigns have bestowed their radiant favor upon me. At the ascension of the dragon-throne, I was honored with a special edict of exalted titles, my reverence likened to that of Xu Jing, my solemnity compared to the harmony of Chonghe. Official ranks were conferred following the precedents of the Tang, while enfeoffment and advancement of territory followed the model of the Liu state.\n\nIn performing good deeds and transmitting talismans and registers, I carry forward the ancestral legacy. In praying for blessings and averting calamities for the people, I reverently uphold the sagely instructions. In beseeching heaven for enduring mandate, how dare I not exert myself with utmost diligence? In transmitting registers and bestowing talismans, I further manifest the transformative power of the teachings—above, to requite the august mandate of the Son of Heaven’s illustrious decree; below, to extend the imperial favor of the Supreme Polaris to the common people. May I ever fulfill my timely devotion, thereby securing abundant fortune.\n\nThe Recommending Master of the Orthodox Unity Mystic Altar, holder of the Supreme Clarity Three Caverns Scripture Register, [Name], hereby recommends the devout believer [Name], who has received and vowed to wear the *Most High Orthodox Unity Register for Prolonging Life and Preserving Destiny*. Apart from the matters of the register already recorded at this altar, and the personal request made to the Orthodox Unity Succession Celestial Master Perfected Person to report to the Ancestral Celestial Master, the Orthodox Unity Perfected Person, for transmission according to the ritual statutes, this certificate is hereby issued as proof, that the recipient may adhere to the teachings and put them into practice. Should one violate this covenantal oath, one will incur the divine judgment of the Mystic Tribunal.\n\n*Here ends the Most High Orthodox Unity Register for Prolonging Life and Preserving Destiny.*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上正一延生保命箓 经名：太上正一延生保命箓。 原不题撰人，出於明初。 一卷。 底本出处：《正统道藏》正一部。 太上正一延生保命箓 据某乡贯，居位奉道信士某，词称本命某年月日时建生，上属北斗某星君注照言念，某素以太上高皇帝王神气在身，不能自分别，诣道自实，言被三炁君召，即日谨赍法信，叩头恭诣龙虎山嗣汉天师真人门下，拜受太上正一延生保命秘箓一阶，修身炼己，保命护身，过度千灾，驱除万恶，延年益算，学道成真，有违科约，坐见中伤，伏愿大道元恩锡垂佑助，添神益算，真炁流通，庆及群生，七祖九曾俱蒙开度，行符勑水，救病扶危，先人后己，施无望报，成功不宰，如此之行，道将立见，急急依遵太上正一元降律令。 太上老君於元上三天，与十方大圣至真尊神，长生保命护身天尊，领诸得道神仙真仙飞仙及慈悲度厄真人，寻声救苦真人，济生度死真人，万福护身真人，历观世界，见诸男女，各遭三灾九厄，十苦八难，遇殃值祸，无方解谢，沈坠三涂，漂诸六趣，永没地狱。 天尊观见，悯念群生，教以谢愆之法，济生度死，得离罪苦，若有男女，横被六天疫毒，水火盗贼，蛇虎魑魅，恶人咒诅，复连殃注，五土克病，皆当阖家齐心修斋，安置坛场，香花灯烛，请三洞道士焚香行道，诵经佩箓，如法修行，诸灾横难，永得解脱，十直八节，三元本命，父母降生之日，修斋佩箓，保安家眷，即得降大神力，保命护身，若元辰六害十恶，修斋佩箓，即得除灾灭厄，保命护身，若父母夫妻亡殁，修斋佩箓，心愿生天，即得拔亡度厄，保护人身，若元辰六害死气之厄，修齐佩箓，即得解害灭妖，无灾无难，无罪不禳，保命护身，永得清净。 东方青骑天官兵马九亿万人， 东方保命护身金刚力士九亿万人，",
      "translated_text": "**The Supreme Orthodox Unity Register for Prolonging Life and Preserving Destiny**\n\n**Title:** *The Supreme Orthodox Unity Register for Prolonging Life and Preserving Destiny*. The original text does not specify an author; it emerged in the early Ming dynasty. One fascicle. Source text: *Zhengtong Daoist Canon*, Orthodox Unity Section, First Subsection.\n\n---\n\nThe *Supreme Orthodox Unity Register for Prolonging Life and Preserving Destiny*\n\nAccording to the native place and official position of the faithful Daoist devotee [Name], born in the year, month, day, and hour of [Birth Details], under the celestial governance of the Star Lord of the Northern Dipper [Specific Star], it is humbly stated:\n\nHaving long borne within myself the divine *qi* of the Supreme High Emperor Wang, yet unable to discern its workings, I now sincerely confess before the Dao: summoned by the Three *Qi* Lords, I today reverently present ritual offerings and, with bowed head, approach the gate of the Heavenly Master of Dragon-Tiger Mountain, successor of the Han, to receive the *Supreme Orthodox Unity Register for Prolonging Life and Preserving Destiny* of the first rank. Through cultivating the body and refining the self, I seek to preserve my destiny and shield my person, transcend a thousand calamities, dispel ten thousand evils, prolong my years, and augment my allotted span. Should I violate the precepts and covenants, may I suffer immediate harm. I humbly pray that the primordial grace of the Great Dao bestow its aid, augment my spiritual vitality, and circulate the true *qi*, bringing blessings to all beings. May my seven ancestors and nine generations alike be delivered and uplifted. By inscribing talismans and consecrating water, I shall heal the sick and succor the perilous, placing others before myself, bestowing without expectation of reward, and accomplishing without self-aggrandizement. Through such conduct, the Dao shall swiftly manifest.\n\nSwiftly, swiftly, in accordance with the statutes and decrees descended from the Supreme Orthodox Unity!\n\n---\n\nThe Most High Lord Lao, upon the Three Heavens of Primordial Origin, together with the perfected and sagely deities of the ten directions, the Celestial Worthies of Longevity, Life-Preservation, and Body-Protection, and the host of attained immortals—true immortals, flying immortals, merciful deliverers from distress, those who respond to cries for aid, those who rescue the living and ferry the dead, and the myriad-fortune guardians of the body—surveyed the world and beheld men and women, each beset by the three disasters and nine calamities, the ten sufferings and eight hardships, encountering misfortune and meeting with woe, without means to expiate or avert them. Sinking into the three lower realms, adrift among the six destinies, they were forever consigned to hell.\n\nThe Celestial Worthy, witnessing this, took pity on all beings and taught the method of expiating transgressions, rescuing the living and ferrying the dead, that they might escape the torments of sin. Should any man or woman be afflicted by the pestilential poisons of the Six Heavens, by water or fire, bandits or thieves, serpents or tigers, demons or malevolent spirits, by the curses of wicked persons, or by the cumulative misfortunes of karmic retribution, or the illnesses wrought by the five earthly influences, let their household unite in heart to perform the fast, establish an altar, and array incense, flowers, lamps, and candles. Let them invite a Daoist priest of the Three Caverns to burn incense, perform the Dao, recite scriptures, and wear the register, cultivating in accordance with the proper method. Thereby, all disasters and misfortunes shall be forever dissolved.\n\nOn the ten auspicious days, the eight solar terms, the Three Primordials, one’s own natal day, and the birthdays of one’s parents, let them perform the fast and wear the register to safeguard their household. Thus shall they receive the descent of great divine power, preserving their destiny and protecting their person. Should one’s original destiny be afflicted by the six harms or ten evils, let them perform the fast and wear the register, and they shall dispel calamities and eradicate misfortune, preserving their destiny and protecting their person. Should one’s parents, spouse, or partner have passed away, let them perform the fast and wear the register with the aspiration that their departed kin ascend to heaven. Thus shall they deliver the deceased from distress and protect the living. Should one’s original destiny be afflicted by the six harms or the baleful *qi* of death, let them perform the fast and wear the register, and they shall dissolve harm, extinguish demonic influences, and remain free from disaster, hardship, and unexpiated sins, preserving their destiny and protecting their person, forever attaining purity.\n\nIn the East, the Azure-Riding Celestial Officials and their armies, nine hundred million strong,\nIn the East, the Diamond Warriors for Life-Preservation and Body-Protection, nine hundred million strong,",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 701,
      "start_sentence": 0,
      "end_sentence": 10,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.425764083862305,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一延生保命箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "南方赤骑天官兵马三亿万人， 南方保命护身金刚力士三亿万人， 西方白骑天官兵马七亿万人， 西方保命护身金刚力士七亿万人， 北方黑骑天官兵马五亿万人， 北方保命护身金刚力士五亿万人， 中央黄骑天官兵马十二亿万人， 中央保命护身天驺甲卒十二亿万人， 十方保命兵士千亿万人， 十方护身兵士千亿万人， 十方解害兵士千亿万人， 十方除病兵士千亿万人， 十方消灾兵士千亿万人， 十方护命兵士千亿万人， 十方灭考兵士千亿万人， 十方斩瘟兵士千亿万人， 十方灭毒兵士千亿万人， 十方解誓兵士千亿万人， 十方治痛兵士千亿万人， 十方斩妖兵士千亿万人， 十方助法兵士千亿万人， 十方护经力士千亿万人， 天灵官监生使者三人， 天灵官保命使者三人， 天灵官长生使者三人， 天灵官扁鹊太医三人， 天灵官除黑簿吏三人， 天灵官束斗注算君吏九人， 天灵官南斗上生君吏三人， 天灵官西斗记名君吏七人， 天灵官北斗落死君吏五人， 天灵官中斗大魁君吏十二人。 以上符篆并丹书 正一真人曰：世间善男信女，佩受太上正一延生保命箓，尊奉敬礼，仙曹真吏营卫兆身，名标金简，克作长生，七祖超升，位登天人，子其遵奉焉。 弟子某即日赍持质信，恭诣天师门下，拜受太上正一延生保命箓一阶，誓愿修奉，罔敢轻慢灵文，倘或有违，甘当冥宪，不敢怨道咎师，一如玄科律令。 太上正一延生保命箓 请箓法词 太上正一延生保命箓请法词： 维某年月日某辰，具贯隶某处居住，奉道信士某词称，本命某年月日时建生，上属北斗某星君注照，即日谨赍法信叩头，恭诣龙虎山嗣汉天师真人门下，拜受太上正一延生保命箓一阶。 伏以道与之貌，百神默拱於泥丸，天赋之形，万炁齐资於玉户，养正则神明阴相，惑邪则灾害旁加，度身威光，命不待护而自护，受天法箓，神未尝存而默存，延福延龄，消自戕之妖孽，常清常静，保惟止之吉祥，既睹慈光，恭遵严戒，某无任恳祷之至，谨词。 天师门下，据弟子某赍持质信，诣道自陈，求受太上正一延生保命箓一阶，及请真师宝讳，终身敬奉，今来所据投词，即日告盟天地，立誓三官，破券分环，依科传授给付，如后。 箓一阶 太上正一延生保命箓",
      "translated_text": "In the South, the Vermilion-Riding Celestial Officials and their armies, three hundred million strong,\nIn the South, the Diamond Warriors for Life-Preservation and Body-Protection, three hundred million strong,\nIn the West, the White-Riding Celestial Officials and their armies, seven hundred million strong,\nIn the West, the Diamond Warriors for Life-Preservation and Body-Protection, seven hundred million strong,\nIn the North, the Black-Riding Celestial Officials and their armies, five hundred million strong,\nIn the North, the Diamond Warriors for Life-Preservation and Body-Protection, five hundred million strong,\nIn the Center, the Yellow-Riding Celestial Officials and their armies, twelve hundred million strong,\nIn the Center, the Heavenly Chariot Armored Soldiers for Life-Preservation and Body-Protection, twelve hundred million strong,\nThe Ten Directions’ Life-Preserving Soldiers, one thousand billion strong,\nThe Ten Directions’ Body-Protecting Soldiers, one thousand billion strong,\nThe Ten Directions’ Harm-Dissolving Soldiers, one thousand billion strong,\nThe Ten Directions’ Disease-Expelling Soldiers, one thousand billion strong,\nThe Ten Directions’ Disaster-Dispelling Soldiers, one thousand billion strong,\nThe Ten Directions’ Life-Protecting Soldiers, one thousand billion strong,\nThe Ten Directions’ Deceased-Ancestor-Releasing Soldiers, one thousand billion strong,\nThe Ten Directions’ Pestilence-Severing Soldiers, one thousand billion strong,\nThe Ten Directions’ Poison-Eradicating Soldiers, one thousand billion strong,\nThe Ten Directions’ Oath-Dissolving Soldiers, one thousand billion strong,\nThe Ten Directions’ Pain-Healing Soldiers, one thousand billion strong,\nThe Ten Directions’ Demon-Severing Soldiers, one thousand billion strong,\nThe Ten Directions’ Dharma-Assisting Soldiers, one thousand billion strong,\nThe Ten Directions’ Scripture-Protecting Warriors, one thousand billion strong,\nThe Heavenly Numinous Officials’ Life-Monitoring Envoys, three in number,\nThe Heavenly Numinous Officials’ Life-Protecting Envoys, three in number,\nThe Heavenly Numinous Officials’ Longevity-Ensuring Envoys, three in number,\nThe Heavenly Numinous Officials’ Bian Que Grand Physicians, three in number,\nThe Heavenly Numinous Officials’ Black Register-Erasing Clerks, three in number,\nThe Heavenly Numinous Officials’ Dipper-Binding Fate-Recording Lords, nine in number,\nThe Heavenly Numinous Officials’ Southern Dipper Life-Registering Lords, three in number,\nThe Heavenly Numinous Officials’ Western Dipper Name-Recording Lords, seven in number,\nThe Heavenly Numinous Officials’ Northern Dipper Death-Registering Lords, five in number,\nThe Heavenly Numinous Officials’ Central Dipper Great Chief Lords, twelve in number.\n\nThe above talismans and cinnabar-script registers are thus inscribed.\n\nThe Orthodox Unity Perfected Person states: In the world, good men and faithful women who receive and wear the *Tai Shang Zheng Yi Yan Sheng Bao Ming Lu* (Register of the Supreme Orthodox Unity for Extending Life and Preserving Destiny), reverently uphold and honor it. The immortals and true clerks shall guard and protect their persons, their names inscribed upon golden tablets, enabling them to attain longevity. Their seven generations of ancestors shall ascend, their positions elevated among the heavenly beings. Let them diligently observe and uphold this.\n\nThe disciple [Name] hereby presents sincerity and faith, respectfully approaching the gate of the Heavenly Master, to receive the *Tai Shang Zheng Yi Yan Sheng Bao Ming Lu* of the first rank. I vow to cultivate and uphold it, never daring to treat the sacred script lightly. Should I violate this, I willingly accept the judgments of the unseen realm, never blaming the Dao or faulting my master, in accordance with the mysterious statutes and ordinances.\n\n**The *Tai Shang Zheng Yi Yan Sheng Bao Ming Lu* (Register of the Supreme Orthodox Unity for Extending Life and Preserving Destiny)**\n\n**Method for Requesting the Register**\n\n**Prayer for Requesting the *Tai Shang Zheng Yi Yan Sheng Bao Ming Lu*:**\n\nOn this day, month, and year of [Date], I, [Name], a Daoist believer residing in [Place], humbly state: Born on [Birth Date and Hour], my life is governed by the oversight of the [Specific] Star Lord of the Northern Dipper. Today, I respectfully present ritual offerings and bow my head, reverently approaching the gate of the Heavenly Master of Dragon-Tiger Mountain, Successor to the Han, to receive the *Tai Shang Zheng Yi Yan Sheng Bao Ming Lu* of the first rank.\n\nI reflect that the Dao bestows form, and the hundred spirits silently attend within the *niwan* (mud-pellet palace). Heaven endows the body, and the myriad *qi* collectively sustain the jade chamber. Cultivating correctness, the numinous and the hidden mutually assist; succumbing to delusion, calamities and harms assail from all sides. The majesty of the body’s radiance ensures that destiny does not await protection to protect itself. Receiving the celestial register and its methods, the spirits, though not consciously preserved, are silently preserved. Extending blessings and prolonging years, the self-inflicted demonic afflictions are dispelled. Abiding in constant purity and stillness, one safeguards the auspiciousness of ultimate cessation. Having beheld the compassionate light, I reverently adhere to the solemn precepts. I am utterly sincere in my supplication. Respectfully, this prayer.\n\nAt the gate of the Heavenly Master, the disciple [Name] presents sincerity and faith, approaching the Dao to declare the request for the *Tai Shang Zheng Yi Yan Sheng Bao Ming Lu* of the first rank, and to seek the sacred name of the true master for lifelong reverence. Today, based on the submitted prayer, I swear an oath before Heaven and Earth, pledge before the Three Officials, break the contract and divide the ring, and transmit and confer the register in accordance with the statutes. As follows:\n\n**Register of the First Rank**\n*The Tai Shang Zheng Yi Yan Sheng Bao Ming Lu*",
      "overlap_context": " the six harms or the baleful *qi* of death, let them perform the fast and wear the register, and they shall dissolve harm, extinguish demonic influences, and remain free from disaster, hardship, and unexpiated sins, preserving their destiny and protecting their person, forever attaining purity.\n\nIn the East, the Azure-Riding Celestial Officials and their armies, nine hundred million strong,\nIn the East, the Diamond Warriors for Life-Preservation and Body-Protection, nine hundred million strong,",
      "start_char": 701,
      "end_char": 1652,
      "start_sentence": 11,
      "end_sentence": 53,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 25.747877836227417,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一延生保命箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "仪式 正一修真旨要节目 祖玄真三师玉讳 祖师三天扶教辅元大法师正一冲玄神化静应显佑真君张道陵。 玄师嗣师太清演教妙道真君张衡。 真师系师太清昭化广德真君张鲁。 经籍度三师法讳 经师上清三洞经箓南曹真士玉府上卿 都天大法主嗣汉四十二代天师张正常。 籍师上清三洞经箓太极执法真宰灵宝 领教真人都天大法主嗣汉四十三代天师张宇初。 度师上清三洞宝箓灵宝领教玄化真人 南曹执法仙宰都天大法主嗣教四十四代天师张宇清。 临坛师法名 证　盟　师",
      "translated_text": "**Ritual Outline: Essential Points for Cultivating Perfection in the Orthodox Unity Tradition**\n\n**Sacred Names of the Three Ancestral and Mysterious Masters**\n- **Ancestral Master**: The Three Heavens’ Upholder of the Dao, Augmenter of Primordial Qi, Grand Master of Orthodox Unity, Impelling Mystery and Divine Transformation, Serene Resonance and Manifest Protection, Perfected Lord Zhang Daoling.\n- **Mysterious Master**: Successor Master, Perfected Lord Zhang Heng of Supreme Clarity, Expounder of the Wondrous Dao.\n- **Perfected Master**: Lineage Master, Perfected Lord Zhang Lu of Supreme Clarity, Radiant Transformation and Vast Virtue.\n\n**Sacred Names of the Three Masters of Scriptures, Registers, and Transmission**\n- **Scripture Master**: Supreme Clarity’s Three Caverns Scripture Register, Perfected Noble of the Southern Bureau, Minister of the Jade Treasury, Chief of All-Heaven Great Dharma, Forty-Second Celestial Master of the Han Succession, Zhang Zhengchang.\n- **Register Master**: Supreme Clarity’s Three Caverns Scripture Register, True Sovereign of the Great Ultimate, Enforcer of the Numinous Treasure, Leader of the Daoist Teachings, Perfected Person of All-Heaven Great Dharma, Forty-Third Celestial Master of the Han Succession, Zhang Yuchu.\n- **Transmission Master**: Supreme Clarity’s Three Caverns Treasure Register, Numinous Treasure Leader of the Mysterious Transformation, Enforcer of the Southern Bureau, Divine Sovereign of All-Heaven Great Dharma, Forty-Fourth Celestial Master of the Succession, Zhang Yuqing.\n\n**Officiating Master’s Dharma Name**\n**Witnessing Master**\n**Oath-Swearing Master**",
      "overlap_context": ", approaching the Dao to declare the request for the *Tai Shang Zheng Yi Yan Sheng Bao Ming Lu* of the first rank, and to seek the sacred name of the true master for lifelong reverence. Today, based on the submitted prayer, I swear an oath before Heaven and Earth, pledge before the Three Officials, break the contract and divide the ring, and transmit and confer the register in accordance with the statutes. As follows:\n\n**Register of the First Rank**\n*The Tai Shang Zheng Yi Yan Sheng Bao Ming Lu*",
      "start_char": 1652,
      "end_char": 1897,
      "start_sentence": 54,
      "end_sentence": 68,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.695358037948608,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一延生保命箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "监　度　师 保　举　师 天师正应先生曰：玄圣格言，天真秘检，扶衰度厄。 当知三元华盖之灵，保命延生，此谓五斗藏身之箓，感孚孔易，福利无边。 故我太上设教，流传世学，由是历代真师对扬宝训，汲引有缘，绳绳不绝。 我以夙庆，世戴国恩，绍正一之师传，振天目之宗绪。 第法箓传世麦远，乃选良匠，锓木成书，以久其传。 若夫禁戒守持，恻隐慈悲，从古至人，莫不如是。 登坛善信，各宜涤除玄览，积行累功，庶几有愿皆符，自此超凡入妙。 昭然盟载，可不慎欤。 天师广微子曰：我家以太上符镰济度人天，保镇国祚，千有五百余岁矣。 祖训孔昭，奚庸赘赞。 惟我先真君，际遇圣朝混一区宇，首见尊崇，江南冠褐咸隶管领。 予袭教以来，三朝帝阙迭被恩光，恭遇龙飞，特颁涣号，以精严比虚靖，谓只肃似冲和，加官征例於唐朝，胙土进封於留国。 做好事，传符箓，俾绍先猷； 祈福贶，御民灾，钦承圣训。 祈天永命，敢不只勤，度箓传符，益彰开化，上以对歇天子丕显之命，下以敷锡庶民皇极之休。 尚克时忱，以介景福。 正一玄坛保举师，上清三洞经箓，某保举到奉道信士某，参受太上正一延生保命箓，皈身佩奉。 本坛除已具箓事由，躬请正一嗣教天师真人，申闻祖天师正一真人，依科传度外，爰给词以为证，俾遵教以奉行。 倘负盟言，自贻玄宪。 太上正一延生保命箓竟",
      "translated_text": "**Supervising Transmission Master**  \n**Recommending Master**\n\nThe Orthodox Master of the Celestial Masters, Zhengying, declares: The profound words of the Mystic Sages and the secret writs of the Heavenly Perfected serve to sustain the declining and deliver the distressed. One must recognize the numinous power of the Three Primes’ Flowery Canopy, which preserves life and prolongs existence—this is what is meant by the Register of the Five Dipper’s Concealing the Body. Its resonance is effortlessly efficacious, its blessings and benefits boundless. Thus did the Most High establish the teachings, transmitting them as a worldly learning. Thereupon, successive generations of Perfected Masters upheld and proclaimed the precious instructions, drawing in those with karmic affinity, their lineage unbroken through the ages.\n\nBy virtue of my ancestral blessings, I have borne the grace of the state through the generations, inheriting the transmission of the Orthodox Unity lineage and reviving the ancestral thread of the Heavenly Eye. Yet as the transmission of the Dharma Registers and the succession of generations grow ever more distant, I have selected skilled artisans to carve wood into books, ensuring the perpetuation of their legacy.\n\nAs for the observance of precepts and the cultivation of compassion, from ancient times to the present, all perfected beings have acted thus. Those who ascend the altar as devout believers must purify their inner vision, accumulate merit through virtuous deeds, and thereby fulfill their vows, transcending the mundane to enter the wondrous. The covenant thus illuminated—how could one not be vigilant?\n\nThe Celestial Master, Guangwei Zi, declares: For over fifteen hundred years, my family has employed the talismans and registers of the Most High to deliver beings across heaven and earth, safeguarding the nation’s destiny. The ancestral teachings are resplendently clear—what need is there for superfluous praise?\n\nWhen my predecessor, the Perfected Lord, encountered the sagely dynasty’s unification of the realm, he was first to receive veneration. The cap-and-robe-clad of Jiangnan were all placed under his jurisdiction. Since I inherited the teaching, the imperial courts of three reigns have bestowed their radiant favor upon me. At the ascension of the dragon-throne, I was honored with a special edict of exalted titles, my reverence likened to that of Xu Jing, my solemnity compared to the harmony of Chonghe. Official ranks were conferred following the precedents of the Tang, while enfeoffment and advancement of territory followed the model of the Liu state.\n\nIn performing good deeds and transmitting talismans and registers, I carry forward the ancestral legacy. In praying for blessings and averting calamities for the people, I reverently uphold the sagely instructions. In beseeching heaven for enduring mandate, how dare I not exert myself with utmost diligence? In transmitting registers and bestowing talismans, I further manifest the transformative power of the teachings—above, to requite the august mandate of the Son of Heaven’s illustrious decree; below, to extend the imperial favor of the Supreme Polaris to the common people. May I ever fulfill my timely devotion, thereby securing abundant fortune.\n\nThe Recommending Master of the Orthodox Unity Mystic Altar, holder of the Supreme Clarity Three Caverns Scripture Register, [Name], hereby recommends the devout believer [Name], who has received and vowed to wear the *Most High Orthodox Unity Register for Prolonging Life and Preserving Destiny*. Apart from the matters of the register already recorded at this altar, and the personal request made to the Orthodox Unity Succession Celestial Master Perfected Person to report to the Ancestral Celestial Master, the Orthodox Unity Perfected Person, for transmission according to the ritual statutes, this certificate is hereby issued as proof, that the recipient may adhere to the teachings and put them into practice. Should one violate this covenantal oath, one will incur the divine judgment of the Mystic Tribunal.\n\n*Here ends the Most High Orthodox Unity Register for Prolonging Life and Preserving Destiny.*",
      "overlap_context": "er of the Daoist Teachings, Perfected Person of All-Heaven Great Dharma, Forty-Third Celestial Master of the Han Succession, Zhang Yuchu.\n- **Transmission Master**: Supreme Clarity’s Three Caverns Treasure Register, Numinous Treasure Leader of the Mysterious Transformation, Enforcer of the Southern Bureau, Divine Sovereign of All-Heaven Great Dharma, Forty-Fourth Celestial Master of the Succession, Zhang Yuqing.\n\n**Officiating Master’s Dharma Name**\n**Witnessing Master**\n**Oath-Swearing Master**",
      "start_char": 1897,
      "end_char": 2440,
      "start_sentence": 69,
      "end_sentence": 90,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.45071244239807,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一延生保命箓.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}