{
  "source_id": "太上正一盟威法箓",
  "source_file": "chunked_daozang\\太上正一盟威法箓.json",
  "total_chunks": 19,
  "total_original_chars": 8418,
  "total_translated_chars": 52752,
  "total_translation_time": 249.26238012313843,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\太上正一盟威法箓.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Orthodox Unity Alliance of Might Registers**\n\n**Title:** *The Supreme Orthodox Unity Alliance of Might Registers*\nAuthor unknown, approximately dating to the Northern and Southern Dynasties, belonging to the early Celestial Master Dao registers. One scroll.\nSource of base text: *Zhengtong Daoist Canon*, Orthodox Unity Section, First Subsection.\n\n---\n\n**The Supreme Orthodox Unity Alliance of Might Registers**\n\nThe Register of the Supreme One Office Divine Lads,\nThe Register of the Supreme Ten Office Divine Lads,\nThe Register of the Supreme Seventy-Five Office Divine Lads,\nThe Register of the Supreme Three-Five Red Officials for Slaying Demons,\nThe Register of the Great Unity Protector-General of the Body,\nThe Register of the Supreme Twenty-Four Governances’ Qi,\nThe Register of the Supreme Protection of the Body, Prolonging Life, and Resolving All Calamities,\nThe Register of the Supreme Preservation of Life and Longevity,\nThe Supreme Phoenix Register for Dispelling Defilement,\nThe Supreme Three-Five Precious Register for Resolving Harm,\nThe Register of Lord Lao Bestowing upon Xu Jia for Prolonging Life and Preserving Destiny,\nThe Supreme Register for Summoning Wealth and Securing Treasures,\nThe Supreme Nine-One River Chart Precious Register,\nThe Supreme Register of One Hundred Fifty Generals and Male Immortals.\n\n---\n\n**The Register of the Supreme One Office Divine Lads**\n\nOn such-and-such a year, month, and day, in such-and-such a prefecture, county, village, and abbey, so-and-so of such-and-such a register, having long borne the divine qi of the Most High Lord Lao, the Supreme August Emperor Wang, within their person yet unable to distinguish it themselves, now presents their sincerity to the Master of the Three Caverns, your subject so-and-so, to receive the *Register of the Supreme One Office Divine Lads*. They truthfully declare: having been summoned by the Lord, from this day forth, upon receiving their appointment, they must assist the Celestial Master in healing the illnesses of the people. They shall not lightly divulge secrets, commit licentiousness or theft, harbor resentment, deceit, or jealousy, nor engage in improper conduct. Should they act independently or slander their master, they shall incur the envy of demonic spirits. They must only cultivate kindness, nurture filial piety, respect the elderly, cherish the young, and mutually support their parents and siblings. On the five auspicious days of the year and the sacred days of the five seasonal festivals, they shall offer prayers in the hall for their nine generations of ancestors. On the same day in the second and eighth months, they shall sacrifice to the earth god and the stove god. They shall not privately worship other spirits or gods. Should they violate these precepts even once, they shall suffer harm and injury, bearing no grudge against the Dao or blame toward their master. All shall be as the statutes command.\n\nTwo Merit Officers of the Northern First Upper Office,\nOne Hundred Twenty Tiger-Rushing Clerks of the Northern First Upper Office.\n\nTwo Merit Officers of the Northern First Upper Office, Orthodox Unity Division,\nOne Hundred Twenty Investigating Deceivers and Hook-Riding Clerks of the Northern First Upper Office,\nTwo Healing Officers of the Northern First Upper Office,\nOne Hundred Twenty Directors of the Three Offices of the Northern First Upper Office,\nTwo Left Office Envoys of the Northern First Upper Office,\nOne Hundred Twenty Celestial Couriers and Armored Soldiers of the Northern First Upper Office,\nTwo Right Office Envoys of the Northern First Upper Office,\nOne Hundred Twenty Celestial Ding Warriors of the Northern First Upper Office,\nTwo Yin-Yang Spirit Officers of the Northern First Upper Office,\nOne Hundred Twenty Qi-Gathering and Qi-Nourishing Clerks of the Northern First Upper Office,\nOne Hundred Twenty Crimson Celestial Banner and Strong Wind Generals,\nOne Hundred Twenty Crimson Celestial Banner Left and Right Generals.\n\n**Recommendation, Supervision, and Ordination:**\nRegister of the Ten Offices Divine Lads of the Most High\nOn the _day/month/year_, at the _Palace/Abbey_ of _prefecture/county/township_, the disciple of _surname_, having received the register of the _Dharma Register_, declares:\nImbued with the divine qi of the newly manifested Lord Lao, the Most High August Emperor-King, yet unable to discern it myself, I now present this token of faith to the Three Caverns Dharma Master, your servant, to humbly request the register of the Ten Offices Divine Lads of the Most High.\nI truly affirm and declare that, upon being summoned and enrolled henceforth, I shall cultivate kindness, nurture filial piety, respect the elderly, cherish the young, and mutually support my parents and siblings. On the five auspicious days of the year and the sacred days of the five seasonal festivals, I shall offer prayers in the hall for my nine generations of ancestors. On the same day in the second and eighth months, I shall sacrifice to the earth god and the stove god. I shall not privately worship other spirits or gods. Should I violate these precepts even once, I shall suffer harm and injury, bearing no grudge against the Dao or blame toward my master. All shall be as the statutes of the Most High Lord Lao command.\n\nTwo Merit Officers of the Upper Immortal Capital,\nTwo Hundred Forty Tiger-Rushing Clerks of the Upper Immortal Capital.\n\nTwo Regular Rectifying Clerks of the Upper Immortal Capital,\nTwo Hundred Forty Investigating Lictors of the Upper Immortal Capital,\nTwo Healing Clerks of the Upper Immortal Capital,\nTwo Hundred Forty Archers of the Three Officials of the Upper Immortal Capital,\nTwo Left Envoys of the Upper Immortal Capital,\nTwo Hundred Forty Celestial Couriers of the Upper Immortal Capital,\nTwo Right Envoys of the Upper Immortal Capital,\nTwo Hundred Forty Celestial Ding Warriors of the Upper Immortal Capital,\nTwo Yin-Yang Divination Clerks of the Upper Immortal Capital,\nTwo Hundred Forty Qi-Absorbing Clerks of the Upper Immortal Capital,\nTwo Yin-Yang Physician Clerks of the Upper Immortal Capital,\nTwo Hundred Forty Swift Wind Courier Clerks of the Upper Immortal Capital,\nTwo Crimson Heaven Banner Swift Wind Courier Generals,\nTwo Crimson Heaven Banner Swift Wind Left Courier Generals,\nTwo Crimson Heaven Banner Swift Wind Right Courier Generals,\nTwo Crimson Heaven Banner Swift Wind Left Generals,\nTwo Crimson Heaven Banner Swift Wind Right Generals.\nRecommending and Supervising Ordination.\n\nOrdination Master of the Register of the Seventy-Five Offices of the Celestial Youths\n\nOn the _day_ of the _month_ of the _year_, [name], of [prefecture], [county], [township], and [village], from [Daoist abbey/temple], having received the Register of the [specific] Daoist Ordination, bearing the divine qi of the Most High Lord Lao, the Supreme August Emperor Wang, newly infused within the body, yet unable to distinguish it clearly, now presents credentials and approaches the Three Caverns’ Dharma Master, your servant [name], to receive the *Register of the Seventy-Five Offices of the Celestial Youths*. All statements herein are true and complete. Upon being summoned by the Lord, [the recipient] shall, from this day forward, be assigned duties in accordance with the following precepts:\n\nTo cultivate compassion and filial piety, to revere the aged and cherish the young, and to ensure mutual care among parents and siblings. On the five auspicious days of the Five La Festivals, offerings shall be made in the hall to the nine generations of ancestral parents. On the same day in the second and eighth months, sacrifices shall be made to the Earth God and the Hearth God. No private worship of other spirits or deities is permitted. Should any violation occur, harm shall befall the transgressor, who shall not blame the Dao or fault the master. All is in accordance with the statutes and decrees of the Most High Lord Lao.\n\nTwo Direct Envoys of the Upper Numinous Office,\nTwo Hundred Forty Tiger-Rushing Couriers of the Upper Numinous Office,\n\nTwo Direct Envoys of the Orthodox Unity Office of the Upper Numinous Bureau,\nTwo Hundred Forty Hook-Riding Inspectors of the Upper Numinous Bureau,\n\nTwo Direct Envoys for Healing of the Upper Numinous Bureau,\nTwo Hundred Forty Archers of the Three Officials of the Upper Numinous Bureau,\n\nTwo Left Bureau Envoys of the Upper Numinous Bureau,\nTwo Hundred Forty Celestial Ding Warriors of the Upper Numinous Bureau,\n\nTwo Right Bureau Envoys of the Upper Numinous Bureau,\nTwo Hundred Forty Qi-Absorbing and Qi-Consuming Officers of the Upper Numinous Bureau,\n\nTwo Yang Spirit Judgment Officers of the Upper Numinous Bureau,\nTwo Hundred Forty Ghost-Seizing and Ghost-Consuming Officers of the Upper Numinous Bureau,\n\nTwo Yin Spirit Judgment Officers of the Upper Numinous Bureau,\nTwo Hundred Forty Scarlet Talisman Chariot Officers of the Upper Numinous Bureau,\n\nTwo Yang Bureau Grand Physicians of the Upper Numinous Bureau,\nTwo Hundred Forty Gale-Riding Couriers of the Upper Numinous Bureau,\n\nTwo Yin Bureau Grand Physicians of the Upper Numinous Bureau,\nTwo Hundred Forty Post-Horse Memorial Officers of the Upper Numinous Bureau,\n\nTwo Spirit-Waiting Generals of the Upper Numinous Bureau,\nTwo Capital Spirit-Waiting Generals of the Upper Numinous Bureau,\n\nTwo Left Capital Spirit-Waiting Generals of the Upper Numinous Bureau,\nTwo Right Capital Spirit-Waiting Generals of the Upper Numinous Bureau,\n\nTwo Attendant-Waiting Generals of the Upper Numinous Bureau.\n\nGuarantors and Supervisors of Ordination.\n\nOrdination Master of the *Tai Shang San Wu Chi Guan Zhan Xie Lu*:\n\nOn the [day] of [month] in the [year], [name], of [prefecture], [county], [township], and [village], a Daoist of [temple/monastery], having received the precepts of [specific method], bearing the surname [name], has long been infused with the divine qi of the Most High Lord Lao, the Supreme August Emperor Wang. Unable to distinguish it himself, he now presents his credentials to the Three Caverns Master, your servant [name], to receive the *San Wu Chi Guan Zhan Xie Zhi Bing*, to stabilize the Three Hun and settle the Seven Po. Following above and below, accompanying all movements in and out, they repel and expel all malevolent forces, capture and extinguish spirits and anomalies—be they river turtles, alligators, tortoises, soft-shelled turtles, foxes, ancient specters, thousand-year-old demons, dominant or recessive malign influences, or any hostile residual qi—preventing them from rashly violating the disciple’s person. All is done in accordance with the statutes and commands of the Most High Lord Lao.\n\nTwo Celestial Numinous Red Official Direct Envoys of Merit Officers,\nTwo Celestial Numinous Red Official Orthodox Unity Merit Officers,\nTwo Celestial Numinous Red Official Disease-Treating Merit Officers,\nTwo Celestial Numinous Red Official Left Official Envoys,\nTwo Celestial Numinous Red Official Right Official Envoys,\nTwo Celestial Numinous Red Official Yang Spirit Judgment Officers,\nTwo Celestial Numinous Red Official Yin Spirit Judgment Officers,\nTwo Celestial Numinous Red Official Yang Bureau Grand Physicians,\nTwo Celestial Numinous Red Official Yin Bureau Grand Physicians,\nTwo Celestial Numinous Red Official Supervising Malevolence Generals,\nTwo Celestial Numinous Red Official Seizing Malevolence Generals,\nTwo Celestial Numinous Red Official Punishing Malevolence Generals,\nTwo Celestial Numinous Red Official Subduing Malevolence Generals,\nTwo Celestial Numinous Red Official Beheading Malevolence Left Generals,\nTwo Celestial Numinous Red Official Beheading Malevolence Right Generals,\nTwo Celestial Numinous Red Official Yang Bureau Generals,\nTwo Celestial Numinous Red Official Yin Bureau Generals,\nTwo Celestial Numinous Red Official Body-Protecting Generals,\nTwo Celestial Numinous Red Official Capturing Anomalies Generals,\nTwo Celestial Numinous Red Official Yin Spirit Grand Physicians,\nTwo Celestial Numinous Red Official Yang Spirit Grand Physicians,\nTwo Celestial Numinous Red Official Supervising Malevolence Direct Talisman Officers,\nTwo Celestial Numinous Red Official Beheading Malevolence Envoys,\nTwo Celestial Numinous Red Official Orthodox Unity Envoys,\nTwo Celestial Numinous Red Official Beheading Malevolence and Piercing Treachery Officers,\nTwo Celestial Numinous Red Official Beheading Malevolence Censors,\nTwo Celestial Numinous Red Official Beheading Malevolence Protectors,\nTwo Celestial Numinous Red Official Beheading Malevolence Generals,\nTwo Celestial Numinous Red Official Beheading Malevolence and Capturing Anomalies Officers,\nTwenty-Four Celestial Numinous Red Official Beheading Malevolence Jade Maidens,\nTwo Celestial Numinous Red Official Bian Que Medical Officers,\nThirty-Six Celestial Numinous Red Official Beheading Malevolence Azure Dragons,\nThirty-Six Celestial Numinous Red Official Beheading Malevolence White Tigers,\nThirty-Six Celestial Numinous Red Official Beheading Malevolence Vermilion Birds,\nThirty-Six Celestial Numinous Red Official Beheading Malevolence Dark Warriors.\n\nGuarantors and Supervisors of Ordination.\n\nOrdination Master of the Supreme Lord’s Body-Protecting General Register:\n\nOn the ___ day of the ___ month of the ___ year, at ___ Palace/Abbey in ___ Prefecture, ___ County, ___ Township, the disciple of the ___ Register, surnamed ___, whose body has long been infused with the divine qi of the newly manifested Lord Lao, the Supreme High Emperor Wang, yet unable to distinguish it, now presents this token of faith to the Three Caverns’ Dharma Master, your servant ___, to receive the Divine Talisman and Register of the Grand One’s Body-Protecting General. Upon investiture, the true spirits of the Grand One, the Five Thearchs’ direct talismans, and a thousand chariots with ten thousand cavalry shall follow the disciple’s person, warding off calamities and ensuring enduring existence.\n\nHenceforth, the disciple must diligently revere the Dharma and uphold the Great Dao, never lightly divulging the sacred writ. All shall be as decreed by the Most High Lord Lao.\n\nMajestic is the August Heaven, sheltering the disciple’s body;\nProfound is the August Earth, bearing the disciple without obstruction.\nUnassisted, the disciple walks; unguided, the path unfolds.\nSun and moon alike illuminate, dispelling the Five Misfortunes.\nHoly spirits nurture, granting sweet nectar to partake.\nThe King Father remembers, bestowing immortal recipes;\nThe Queen Mother remembers, prolonging life and adding years.\nThe Jade Maidens remember, burning the Five Fragrances;\nThe Perfected remember, greeting with laughter and speech.\nUpon meeting the Warrior Spirits, blades are blunted and points broken;\nUpon meeting the Valiant Guardians, no treacherous one dares stand.\nBridges are crossed instantly; waters cease to flow.\nIn mountains and forests, all paths are cleared and obstacles repelled.\nThe Five Weapons, ghostly thieves, flee and hide their heads.\nWherever the disciple travels, all is unimpeded;\nWherever the disciple rests, all is at peace.\nAbiding by the precepts and receiving this register,\nascension to immortality is swiftly attained.\n\nHasten! All as decreed by the Most High Lord Lao.\n\nGuarantors and Supervisors of Ordination.\n\n**Ordination Master**\n\nThe *Tai Shang Ershi Si Zhi Qi Lu* (Register of the Twenty-Four Qi Governances of the Most High) is overseen by the Celestial Master’s Yangping and other governances. The Central Qi of the Most High, along with the Four Quarters—East, West, South, and North—dispatchs inspectors to supervise the Twenty-Four Governances, commanding the Twenty-Four Qi. The Supervisor of Celestial Merit, Steward of the Nine Provinces’ Village Altars, and minor servant of the Celestial Master’s gate, now selects and appoints to the Twenty-Four Qi a disciple who has been summoned and is prepared to assume ritual office.\n\n**Yangping Governance**\nOne *Da Pin* General of the Central Qi’s Merit Officers and Balanced Qi\n\n**Lutang Governance**\nOne *Da Pin* General of the Central Qi’s Grand Merit\n\n**Guming Governance**\nOne *Da Pin* General of the Central Qi’s Right Vanguard\n\n**Liyuan Governance**\nOne *Da Pin* General of the Central Qi’s Balanced Five Qi\n\n**Ge Gui Governance**\nOne *Da Pin* General of the Central Qi’s Left Merit Officer\n\n**Gengchu Governance**\nOne *Da Pin* General of the Central Qi’s Left Qi Overseer\n\n**Qinzhong Governance**\nOne *Da Pin* General of the Central Qi’s Right True Qi Vanguard\n\n**Zhenduo Governance**\nOne *Da Pin* General of the Central Qi’s Right Qi Overseer\n\n**Changli Governance**\nOne *Da Pin* General of the Central Qi’s Left Circulating Qi Vanguard\n\n**Lishang Governance**\nOne *Da Pin* General of the Central Qi’s Left White Qi Overseer\n\n**Yongquan Governance**\nOne *Da Pin* General of the Central Qi’s Right Divine Qi Overseer\n\n**Chougeng Governance**\nOne *Da Pin* General of the Central Qi’s Right Qi Inspector\n\n**Beiping Governance**\nOne *Da Pin* General of the Eastern Quarter’s Circulating Qi\n\n**Benzhu Governance**\nOne *Da Pin* General of the Southern Quarter’s Circulating Qi\n\n**Mengqin Governance**\nOne *Da Pin* General of the Central Qi’s Left Decision Officer\n\n**Pinggai Governance**\nOne *Da Pin* General of the Central Qi’s Assistant to the Four Quarters’ Qi\n\n**Yuntai Governance**\nOne *Da Pin* General of the Central Qi’s Right Decision Officer\n\n**Jinkou Governance**\nOne *Da Pin* General of the Western Quarter’s Circulating Qi\n\n**Houcheng Governance**\nOne *Da Pin* General of the Central Qi’s Right Circulating Qi Vanguard\n\n**Gongmu Governance**\nOne *Da Pin* General of the Central Qi’s Qi Executor\n\n**Pinggang Governance**\nOne *Da Pin* General of the Central Qi’s Left Divine Vanguard\n\n**Zhubu Governance**\nOne *Da Pin* General of the Central Qi’s Left Qi Inspector\n\n**Yuju Governance**\nOne *Da Pin* General of the Central Qi’s Right Qi Inspector\n\n**Beimang Governance**\nOne *Da Pin* General of the Central Qi’s Right Divine Vanguard\n\nOn the ___ day of the ___ month in the ___ year, [disciple] of ___ Prefecture, ___ County, ___ Village, ___ Abbey/Temple, having received the ___ Register of Ritual Methods, bearing the surname ___, has long been infused with the divine qi of the Most High Lord Lao, the Supreme August Emperor-King, yet remains unable to distinguish it. Now, presenting credentials, [the disciple] approaches the Three Caverns’ Dharma Master, your servant ___, to receive the *Tai Shang Ershi Si Zhi Lu*, cultivate its practice, and offer reverence, preserving it forever as a treasure of the body.\n\nHasten! All as decreed by the statutes.\n\n**Guarantors**\n**Supervisors of Ordination**\n\n**Preceptor of Transmission**\n*Tai Shang Register for Protecting the Body, Prolonging Life, and Dissolving All Calamities*\n\nOn the ___ day of the ___ month in the ___ year, [disciple] of ___ Prefecture, ___ County, ___ Village, ___ Abbey/Temple, having received the ___ Register of Ritual Methods, bearing the surname ___, has long been infused with the divine qi of the Most High Lord Lao, the Supreme August Emperor-King, yet remains unable to distinguish it. Now, presenting credentials, [the disciple] approaches the Three Caverns’ Dharma Master, your servant ___, to receive the *Tai Shang Register for Protecting the Body, Prolonging Life, and Dissolving All Calamities*, cultivating its practice and preserving it forever as a treasure of the body. All the thousand disasters and ten thousand calamities shall never again assail them. If one can uphold this, one may attain longevity.\n\nHasten! All as decreed by the statutes of the Most High Lord Lao.\n\n**Celestial Officials and Attendants for Dissolving Calamities**\nTwelve Divine Lads for Dissolving Yearly Calamities,\nTwelve Divine Lads for Dissolving Constellation-Linked Calamities,\nTwelve Divine Lads for Dissolving Fate-Exhaustion Calamities,\nTwelve Divine Lads for Dissolving Deathly Calamities,\nTwelve Divine Lads for Dissolving Official Calamities,\nTwelve Divine Lads for Dissolving Illness Calamities,\nTwelve Divine Lads for Dissolving Wealth-Loss Calamities,\nTwelve Divine Lads for Dissolving Repeated Calamities,\nTwelve Divine Lads for Dissolving Tiger and Wolf Calamities,\nTwelve Divine Lads for Dissolving Insect and Serpent Calamities,\nTwelve Divine Lads for Dissolving Heavenly Net Calamities,\nTwelve Divine Lads for Dissolving Earthly Snare Calamities,\nTwelve Divine Lads for Dissolving Original Destiny Calamities,\nTwelve Divine Lads for Dissolving Sudden Disasters,\nTwelve Divine Lads for Dissolving Water and Fire Calamities,\nTwelve Divine Lads for Dissolving Robbery and Banditry Calamities,\nTwelve Divine Lads for Dissolving Blade and Warfare Calamities,\nTwelve Divine Lads for Dissolving Penal and Imprisonment Calamities.\n\n**Guarantors**\n**Supervisors of Ordination**\n\n**Ordination Master**\n\n*Tai Shang Bao Ming Chang Sheng Lu* (Register of the Supreme Lord for Protecting Life and Longevity)\n\nOn the ___ day of the ___ month of the ___ year, at ___ Palace/Abbey in ___ prefecture, ___ county, ___ township, the disciple of the register, ___ (surname), having long borne the divine qi of the newly manifested Lord Lao, the Supreme August Emperor Wang, within his body, yet unable to distinguish it himself, now presents his pledge and approaches the Three Caverns Master, your servant ___ (name), to receive the *Bao Ming Chang Sheng Lu* (Register for Protecting Life and Longevity). Upon receiving this charge, he must assist the Celestial Master in healing the people. He shall not consume wine or meat. Should he violate this once, he will suffer immediate harm, and may not blame the Dao or fault his master. This is in accordance with the statutes and ordinances of the Supreme Lord Lao.\n\n*Tai Shang Bao Ming* divine talisman protects the disciple’s body for longevity. *Hasten, hasten, in accordance with the statutes and ordinances!*\n\n**Attendants:**\n- Two *Tian Ling* Officials, Envoys of Life-Preservation\n- Nine Clerks of the Eastern Dipper, *Zhu Suan* (Life-Recording) Lords, *Tian Ling* Officials\n- Two *Bao Ming* (Life-Protecting) Envoys, *Tian Ling* Officials\n- Three Clerks of the Southern Dipper, *Shang Sheng* (Life-Granting) Lords, *Tian Ling* Officials\n- Two *Chang Sheng* (Longevity) Envoys, *Tian Ling* Officials\n- Seven Clerks of the Western Dipper, *Ji Ming* (Name-Recording) Lords, *Tian Ling* Officials\n- Two *Bian Que* Supreme Physicians, *Tian Ling* Officials\n- Five Clerks of the Northern Dipper, *Luo Si* (Death-Registering) Lords, *Tian Ling* Officials\n- Two Clerks of the *Chu Qi* (Qi-Removing) Register, *Tian Ling* Officials\n- Twelve Clerks of the Central Dipper, *Da Kui* (Great Chief) Lords, *Tian Ling* Officials\n\n**Guarantors**\n**Supervisors of Ordination**\n\n**Ordination Master**\n*Tai Shang Feng Huang* (Supreme Phoenix) *Miao Lu* (Wondrous Register for Dissolving Impurities)\n\nOn the ___ day of the ___ month in the ___ year, at ___ Palace/Abbey in ___ prefecture, ___ county, ___ township, the disciple of ___ surname, having received the ___ Register of the Dao, bears within the divine qi of the Most High Lord Lao, the Supreme August Emperor-King. Unable to distinguish these influences alone, they now present their pledge and approach the Three Caverns’ Dharma Master, your servant ____, to receive the *Tai Shang* (Most High) Register for Dissolving Calamities and Prolonging Years, dispelling the Three Disasters and averting the Nine Perils. May their ears and eyes be keen, their hun-soul stabilized and po-soul settled, their decline and misfortune safeguarded, and the hundred impurities dissolved. Swiftly, swiftly, in accordance with the statutes and commands of the Most High Lord Lao.\n\n**Officials for Dissolving Impurities**\n- Nine Clerks of the Eastern Azure Emperor, Wood Office, *Jie Hui* (Impurity-Dissolving) Lords\n- Three Clerks of the Southern Vermilion Emperor, Fire Office, *Jie Hui* Lords\n- Seven Clerks of the Western White Emperor, Metal Office, *Jie Hui* Lords\n- Five Clerks of the Northern Black Emperor, Water Office, *Jie Hui* Lords\n- Twelve Clerks of the Central Yellow Emperor, Earth Office, *Jie Hui* Lords\n- One hundred twenty *Jie Hui* Lords of Heaven and Earth\n- One hundred twenty *Jie Hui* Jade Maidens\n- One hundred twenty *Jiang* (Commander) Officers and Soldiers of the Nine Phoenixes for Breaking Impurities\n\n**Impurities Dissolved**\nAzure impurities of the East, vermilion impurities of the South, yellow impurities of the Center, white impurities of the West, black impurities of the North—impurities of the Five Directions and Five Colors. Impurities of Heaven, impurities of Earth, impurities of humans, impurities of ghosts, impurities of oxen, horses, and the six livestock. From turbid, repent to clarity; from death, hinder not life. From this day forth, dissolve all impurities, that I may attain long life.\n\n**Guarantors**\n**Supervisors of Ordination**\n\n**Ordination Masters**\n*Tai Shang San Wu* Precious Talismanic Register for Dissolving Obstructions, *Tai Xuan Zhong Yi* Golden Gate Precious Talismanic Register of the True Standard—these were the profound inner teachings of the Queen Mother of the West, bestowed by the August Jade Emperor in the Purple Tenuity Palace. They contain the salvific ordinances, descending to transform the world in each age, to deliver and liberate living beings, to dissolve and dispel obstructions to life and destiny.\n\nFor those afflicted by the Three Punishments or Four Executions, solitary hours or widowed constellations, celestial slayings or terrestrial slayings, the yearly star of Heaven’s span, the Primordial Hour’s Six Harms; for those whose children, parents, or kin have perished utterly, entering the tomb’s embrace, and who thereby suffer mutual obstruction—today, they receive the Great Register for Dissolving Obstructions, to guard the body and protect life, to extend years and augment longevity, to harmonize fate and destiny. All that is fated to be overcome shall be wholly dispersed; harmony shall prevail among the six relations, and compassion nurture the nine kinships. Parents, siblings, and the ancestral lineage shall receive this transmission in the body, forever preserving long life, in perfect accordance with the statutes and ordinances of the Most High Lord Lao.\n\n**Celestial Bureaus and Attending Officers**\nFive Divine Officers of Merit of the Upper Immortal Capital’s Direct Envoys\nFifteen Divine Officers of Merit of the Supreme Merit Bureau of the Upper Immortal Capital\n\nThe Five Divine Officers of Merit of the Orthodox Unity Bureau of the Upper Immortal Capital,\nFifteen Divine Officers of Merit of the Void-and-Nothingness Bureau of the Upper Immortal Capital,\nThe Five Divine Officers of Merit of the Five Thearchs Bureau of the Upper Immortal Capital,\nFifteen Divine Officers of Merit of the Non-Action Bureau of the Upper Immortal Capital,\nThe Five Divine Officers of Merit of the Three Heavens Bureau of the Upper Immortal Capital,\nFifteen Divine Officers of Merit of the Red Heaven Bureau for Dissolving Obstructions of the Upper Immortal Capital,\nThe Five Divine Officers of Merit of the Left Bureau Envoys of the Upper Immortal Capital,\nFifteen Divine Officers of Merit of the Red Heaven Bureau for Dissolving Calamities of the Upper Immortal Capital,\nThe Five Divine Officers of Merit of the Right Bureau Envoys of the Upper Immortal Capital,\nFifteen Divine Officers of Merit of the Yin-Yang Bureau for Dissolving the Six Harms of the Original Destiny of the Upper Immortal Capital,\nThe Five Divine Officers of Merit of the Yin-Yang Envoys of the Upper Immortal Capital,\nFifteen Divine Officers of Merit of the Yin-Yang Bureau for Dissolving Solitary Conjunctions, Widowed Constellations, Three Punishments, and Four Executions of the Upper Immortal Capital.\n\nOn the day of [day] in the month of [month] of the year [year], at [prefecture], [county], [township], [village], in the [Palace/Abbey] of [name], the disciple of the register [name], bearing the divine qi of the Most High Lord Lao, the Supreme August Emperor Wang, newly infused within the body, yet unable to distinguish it for oneself, now presents offerings of sincerity to the Three Caverns Master, your servant [name], to receive the Most High’s Precious Talisman and Wondrous Register for Dissolving Obstructions, to release and dispel all transgressions of the six harms, solitary conjunctions, extinguished hearth-fires, entangling nooses, the five ghosts, eight difficulties, three punishments, four executions, and all that is inauspicious for parents, or that which men and women are fated to overcome. May all be wholly dissolved and auspicious protection granted, that fortune and emolument be secured, mutual understanding and joy prevail, and no slander or mockery of the Perfected be permitted, in perfect accordance with the statutes and ordinances of the Most High Lord Lao.\n\n**Endorsement**\n**Supervision**\n\n**Initiation Master**\nThe Most High Lord Lao bestows upon Xu Jia the *Register for Extending Life and Preserving Destiny*. This is the sacred writ of the Supreme Primordial Qi of the Jade Sovereign, the August Highest Lord, the True Lord who determines lifespan, extends years, and grants enduring vision, safeguarding the body and protecting life. It is a numinous text of profound mystery, not to be handled by the common. Formerly, Master Yin Xi, Magistrate of the Hangu Pass, personally received its transmission and bequeathed it to later worthies. Only the true disciples of immortals—those whose bones and destiny align with the Dao—may reverently bear this writ.\n\nIn the first year of the Yuanshou era, Dongfang Shuo, the transcendent son of the Eastern August Void Sovereign, journeyed to the Queen Mother of the West with a thousand days’ pure offering to beseech this method. Upon wearing it, he attained the true Dao, as Xu Jia had before him, gaining a thousand additional years. Zhang Daoling wore it and ascended to heaven in broad daylight. Zhao Sheng, through cultivation, swiftly realized perfection. Should the disciple of the Correct and True be able to follow its statutes and receive it with devotion, they too shall extend their years, prolong their vision, lengthen their lifespan, and augment their allotted time. The body shall be safeguarded, life preserved, a thousand calamities averted, and ten thousand harms dissolved. The jade lads and jade maidens of the Dharma, the celestial officials, generals, and clerks, the Heavenly Ding warriors, the lifespan-determining forces, the talisman-empowered Generals of Extended Lifespan, and their myriad hosts—each in their millions—shall ever attend the bearer, never parting from their person.\n\nShould one uphold and cultivate this method, they shall attain long life, enduring vision, transcendence of life and death, and realization of the Dao. This method is secret and wondrous; it must not be transmitted to the unworthy. Should transmission violate its statutes, misfortune shall extend to the seven ancestors and afflict the recipient’s own body. Let none blame the master or fault the Dao.\n\n**By the Statutes and Ordinances of the Most High Lord Lao:**\nThe Primordial Qi of the Mysterious Origin determines lifespan, extends years, grants enduring vision, safeguards the body, and protects life. Through transformation, one ascends as an immortal. The precious talisman and register summon the Generals of Allotted Lifespan, the clerks and warriors of fixed destiny, the transcendent lads of extended years, and the jade maidens of preserved lifespan—each in their millions—to encircle the bearer’s bones, shield their person, and guard their movements, whether walking, standing, sitting, or reclining, near or far, never parting. Should one receive, wear, and cultivate it, they may ascend as an immortal.\n\n**On the Zi day at the Zi hour (11 PM–1 AM),** the *Register for Extending Life and Preserving Destiny* summons the Determining Lads and Jade Maidens, each ninety million strong.\n**On the Chou day at the Chou hour (1–3 AM),** it summons the Lifespan-Fixing Transcendent Officials, each ninety million strong.\n**On the Yin day at the Yin hour (3–5 AM),** it summons the Earth Officials of Fixed Form, each ninety million strong.\n**On the Mao day at the Mao hour (5–7 AM),** it summons the Water Officials of Death’s Dissolution, each ninety million strong.\n**On the Chen day at the Chen hour (7–9 AM),** it summons the Eastern Dipper Lords of Recorded Lifespan, each ninety million strong.\n**On the Si day at the Si hour (9–11 AM),** it summons the Southern Dipper Lords of Ascendant Life, each ninety million strong.\n**On the Wu day at the Wu hour (11 AM–1 PM),** it summons the Western Dipper Lords of Recorded Names, each ninety million strong.\n**On the Wei day at the Wei hour (1–3 PM),** it summons the Northern Dipper Lords of Fallen Death, each ninety million strong.\n**On the Shen day at the Shen hour (3–5 PM),** it summons the Central Dipper Lords of the Great Culmen, each ninety million strong.\n**On the You day at the You hour (5–7 PM),** it summons the Three Terraces Lords of Long Life, each ninety million strong.\n**On the Xu day at the Xu hour (7–9 PM),** it summons the Twenty-Eight Constellations Lords of Disaster’s Dissolution, each ninety million strong.\n**On the Hai day at the Hai hour (9–11 PM),** it summons the Thirty-Five Stars Lords of Sin’s Eradication, each ninety million strong.\n\n**By the Supreme Primordial, the Most High, the Three Heavens, the Boundless Great Dao, the Most High Lord Lao:**\nYour servant, though born of mortal flesh with dull senses and clouded perception, now presents offerings of sincerity to the Three Caverns Master, your servant [name], to receive the *Register of Lord Lao for Determining Lifespan, Extending Years, and Preserving Destiny*, to be cherished as a lifelong treasure. May the immortals and sages respond in kind. After receiving and wearing it, one must not treat the scriptures with disdain, mock Daoist priests, envy the worthy, resent the capable, bully the weak, or seize what is not rightfully theirs. Should one uphold it without transgression, it may be transmitted after ten years.\n\n**Endorsement**\n**Supervision**\n\n**Initiation Master: The Supreme Wondrous Register for Summoning Wealth and Securing Treasure**\n\nLord Lao declares: The *Register of the Purple Tenuity Jade Emperor Dao Lord for Summoning Wealth and Securing Treasure* is the esoteric script of the Azure Youth Lord of the Eastern Sea. Its numinous writ was once hidden, unseen by mortals, until the Yellow Emperor, on Mount Tai Bai, personally received it from the Queen Mother of the West and the Mysterious Woman. Thereby he attained wealth and nobility and ascended as an immortal. The Jade Cauldron Immortal transmitted it to the world, yet those without predestined fortune may neither hear nor behold this text. This precious register summons gold and calls forth silver, multiplying coin and silk daily. The five grains overflow, servants and maidservants thrive, fields and silkworms yield double harvests, merchants profit, and trade returns manifold. Wealth departs but returns again, safeguarding the household. Bandits and raiders inflict no harm; wicked villains and evil schemers turn toward compassion. Those who receive and cultivate it shall see their household prosper, their sons loyal and daughters chaste, their years prolonged and lives extended, their blessings shading descendants. Official emoluments increase daily, service to the sovereign brings fulfillment, and all hold them in love and reverence. Journeys near and far meet no obstruction; public and private affairs command respect. Ten thousand evils do not approach. Dragons, snakes, tigers, and beasts retreat and hide. The five pestilences and plague demons flee a thousand *li* away. This register is a treasure of secrecy—do not transmit it to the unworthy. If you can uphold it, guard it well.\n\nLord Lao declares: The *Purple Tenuity Central Harmony Wealth-Summoning Spirit Talisman*—regularly inscribed in cinnabar on the days of *bingzi*, *dingsi*, *renyin*, *guimao*, *wushen*, and *wuwu* (when the moon is full, waning, or waxing)—when worn, summons wealth from the five directions, bestowing riches and nobility. Trade flourishes a myriadfold, and commerce yields manifold returns. The talisman’s spirit hosts—nine thousand nine hundred and ninety-nine in number—attend and guard the bearer.\n\nLord Lao declares: The *Purple Tenuity Central Harmony Treasure-Securing Spirit Talisman*, inscribed in cinnabar on the aforementioned six prosperous days and worn—men on the left, women on the right—grants all desires as the heart wishes. Wealth and coin abound, livestock multiply, fields and silkworms thrive, and both public and private affairs command respect. Ten thousand calamities do not befall. The talisman’s spirit officers and soldiers—nine thousand nine hundred in number—attend and guard the disciple’s body.\n\nLord Lao declares: The *Purple Tenuity Central Harmony Prosperity-Bestowing Spirit Talisman*, inscribed on the six prosperous days and worn, brings prosperity and seeks profit, fulfilling all desires as the heart wishes. Ever pure and upright, the bearer of this spirit talisman remains untouched by the ten thousand illnesses, and wealth multiplies manifold. The talisman’s spirit officers and soldiers—three thousand nine hundred and ninety in number—protect the recipient’s body.\n\n**The Supreme Clarity summons:**\nThe celestial treasury’s gold, silver, coin, and silk—its spirit officers, direct talisman envoys, and soldiers: one million.\nThe terrestrial treasury’s gold, silver, coin, and silk—its spirit officers, direct talisman envoys, and soldiers: one million.\nThe eastern treasury of the *Jiao* surname’s gold, silver, coin, and silk—its spirit officers, direct talisman envoys, and soldiers: one million.\nThe southern treasury of the *Zheng* surname’s gold, silver, coin, and silk—its spirit officers, direct talisman envoys, and soldiers: one million.\nThe western treasury of the *Shang* surname’s gold, silver, coin, and silk—its spirit officers, direct talisman envoys, and soldiers: one million.\nThe northern treasury of the *Yu* surname’s gold, silver, coin, and silk—its spirit officers, direct talisman envoys, and soldiers: one million.\nThe central treasury of the *Gong* surname’s gold, silver, coin, and silk—its spirit officers, direct talisman envoys, and soldiers: one million.\nThe great wealthy elders of the one hundred twenty commanderies of the nine provinces—gold, silver, coin, and silk—its spirit officers, direct talisman envoys, and soldiers: one million.\n\nOn the [day] of [month] in the [year], in the [prefecture], [county], [village], and [hamlet], at the [abbey/temple], the disciple [name], bearing the newly manifested divine qi of Lord Lao, the Supreme High Emperor King, unable to discern for themselves, now presents offerings of sincerity to the Three Caverns Master, your servant [name], to receive the *Supreme Lord Lao’s Wondrous Register for Summoning Wealth and Securing Treasure*, to cultivate and venerate as a lifelong treasure. After receiving the register, one must not defy Heaven above, betray Earth below, or slight one’s master in between. One must not disdain the Dharma, bully the orphaned or weak, despise the elderly, or favor the young. Should one violate these precepts even once, their lifespan shall be reduced by nine years. If upheld without transgression, it may be transmitted after ten years. All is in accordance with the covenant and statutes of the Supreme Lord Lao.\n\n**Endorsement**\n**Supervision**\n\n**Initiation Master**\n*The Precious Register of the Nine-One River Chart*\n\nOn the [day] of [month] in the [year], [name], of [prefecture, county, village], having received the [name] Register at [name] Abbey, bearing the newly manifested divine qi of the Supreme High Emperor King Lord Lao within, yet unable to discern its mysteries, now presents offerings of sincerity to the Three Caverns Master, your servant [name], to receive the *Supreme Lord’s Nine-One River Chart: Primal Record of the Nine Sovereigns’ Hidden Names and the Formula for Eternal Life*. May the Nine Palaces’ numinous officials descend to guard the disciple’s body, repelling evil and embracing rectitude, to assemble together before the Jade Emperor. All is in accordance with the statutes of the Supreme Lord Lao.\n\n**First:** The Yang Brightness Star, Jade Emperor of the Nine Celestial Lords, the hun-soul of the Celestial Pivot Star, paired with the Perfected August Consort of the Western Gate.\n**Second:** The Yin Essence Star, Jade Emperor of the Flowery Celestial Lord, the hun-soul of the Celestial Rotation Star, paired with the Transcendent August Consort of the Northwest Gate.\n**Third:** The Perfected Person Star, Jade Emperor of the Transcendent Celestial Lord, the hun-soul of the Celestial Mechanism Star, paired with the Radiant August Consort of the Eastern Gate.\n**Fourth:** The Profound Darkness Star, Jade Emperor of the Soaring Canopy Lord, the hun-soul of the Celestial Balance Star, paired with the Flourishing August Consort of the Southern Gate.\n**Fifth:** The Cinnabar Prime Lord, Jade Emperor of the Golden Spirit Seven Celestial Lords, the numinous essence of the Celestial Judgment Star, paired with the Central August Consort of the Northern Gate.\n**Sixth:** The Northern Culmen Star, Jade Emperor of the Northern Culmen Flowery Lord, the hun-soul of the Northern Culmen Star, paired with the Primal August Consort of the Northern Culmen Gate.\n**Seventh:** The Celestial Pass Star, Jade Emperor of the Compassionate Numinous Northern Canopy Lord, the hun-soul of the Twinkling Brilliance Star, paired with the Void August Consort beneath the Two Gates of Great Brilliance at the Northern Gate.\n**Eighth:** The Left Auxiliary Star, Jade Emperor of the August Nine Celestial Lords, the hun-soul of the Luminous Cavern Star, paired with the Imperial August Consort of the Essence Yang Brightness at the Western Gate.\n**Ninth:** The Right Assistant Star, Jade Emperor of the August Primal Celestial Lord, the essence-soul of the Hidden Prime Star, paired with the August Consort of the Southeastern Gate.\n\n**Nine Palaces’ Appropriate Arrangements**\n**Yang Brightness Grand Commandery:** Nine hundred twenty ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robe messengers, jade lads and jade maidens, each numbering nine hundred million myriad.\n**Yin Essence Supreme Ministry:** Five hundred fifty ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robe messengers, jade lads and jade maidens, each numbering nine hundred million myriad.\n**Perfected Person Minister of Works:** Seven hundred seventy ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robe messengers, jade lads and jade maidens, each numbering nine hundred million myriad.\n**Profound Darkness Mobile Strike Commandery:** Eight hundred eighty ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robe messengers, jade lads and jade maidens, each numbering nine hundred million myriad.\n**Cinnabar Prime Dipper Lord’s Palace:** Seven hundred twenty ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robe messengers, jade lads and jade maidens, each numbering nine hundred million myriad.\n**Northern Culmen Grand Constancy Palace:** Seven hundred seventy ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robe messengers, jade lads and jade maidens, each numbering nine hundred million myriad.\n**Celestial Pass Supreme Emperor’s Palace:** Seven hundred seventy ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robe messengers, jade lads and jade maidens, each numbering nine hundred million myriad.\n**Auxiliary Heavenly August Jade Emperor’s Palace:** Nine hundred twenty ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robe messengers, jade lads and jade maidens, each numbering nine hundred million myriad.\n**Assistant Great Emperor’s Perfected Palace:** Nine hundred ninety ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robe messengers, jade lads and jade maidens, each numbering nine hundred million myriad.\n\n**Endorsement**\n**Supervision**\n\n**Initiation Master**\n**One Hundred Fifty Generals of the Male Immortals’ Numinous Register:**\nIn the such-and-such year, such-and-such month, such-and-such day, [disciple] of such-and-such prefecture, county, village, and hamlet, having received the such-and-such Dharma Register at such-and-such abbey or oratory, bearing the surname so-and-so, has long been infused with the divine qi of the Most High Lord Lao, the August High Emperor Wang. Unable to distinguish this for himself, he now presents his credentials to the Three Caverns’ Dharma Master, your servant so-and-so, to request the *Numinous Register of the One Hundred Fifty Generals of the Male Immortals*. He truthfully declares in full: once summoned by the Lord and appointed from this day forth, he must assist the Celestial Master in healing the people. He shall not drink wine, eat meat, indulge in licentiousness, steal, harbor resentment, or bear malice. He shall not engage in improper conduct, establish his own methods, or mock his master. Such are the deeds that demons and ghosts abhor. Instead, he shall cultivate kindness and nurture filial piety, respect the elderly and cherish the young, and ensure mutual support among parents and siblings. On the five auspicious days of the year and the five seasonal festivals, he shall worship his ancestral kin and the Great Ancestor in the hall. On the same days of the second and eighth months, he shall offer sacrifices to the earth gods and the hearth. He shall not privately worship other spirits or ghosts. Should he violate these precepts even once, he will suffer immediate harm, bearing no grudge against the Dao or faulting his master. All is in accordance with the statutes and ordinances of the Most High Lord Lao.\n\n**Direct Envoys of the Upper Immortal Capital:** Fifteen Merit Officers.\n**Orthodox Unity Merit Officers of the Upper Immortal Capital:** Fifteen.\n\n**Healing Merit Officers of the Upper Immortal Capital:** Fifteen.\n**Left Envoys of the Upper Immortal Capital:** Fifteen.\n**Right Envoys of the Upper Immortal Capital:** Fifteen.\n**Yin Spirit Judgment Clerks of the Upper Immortal Capital:** Fifteen.\n**Yang Spirit Judgment Clerks of the Upper Immortal Capital:** Fifteen.\n**Yin Palace Grand Physician Clerks of the Upper Immortal Capital:** Fifteen.\n**Yang Palace Grand Physician Clerks of the Upper Immortal Capital:** Fifteen.\n**Yin Palace Merit Officers of the Upper Immortal Capital:** Fifteen.\n**Yang Palace Merit Officers of the Upper Immortal Capital:** Fifteen.\n**Great Generals of the Crimson Heaven’s Banner of the Strong Wind:** Five.\n**Left Generals of the Crimson Heaven’s Banner of the Strong Wind:** Five.\n**Right Generals of the Crimson Heaven’s Banner of the Strong Wind:** Five.\n**Central Palace Great Generals of the Crimson Heaven’s Banner of the Strong Wind:** Five.\n**Left Generals of the Central Palace of the Crimson Heaven’s Banner of the Strong Wind:** Five.\n**Right Generals of the Central Palace of the Crimson Heaven’s Banner of the Strong Wind:** Five.\n**Great Generals of the Central Palace of the Crimson Heaven’s Banner:** Five.\n**Left Generals of the Central Palace of the Crimson Heaven’s Banner:** Five.\n**Right Generals of the Central Palace of the Crimson Heaven’s Banner:** Five.\n**Great Generals of the Strong Wind Bureau of the Crimson Heaven’s Banner:** Five.\n**Left Generals of the Strong Wind Bureau of the Crimson Heaven’s Banner:** Five.\n**Right Generals of the Strong Wind Bureau of the Crimson Heaven’s Banner:** Five.\n**Great Generals of the Strong Wind Cavalry of the Crimson Heaven’s Banner:** Five.\n**Left Generals of the Strong Wind Cavalry of the Crimson Heaven’s Banner:** Five.\n**Right Generals of the Strong Wind Cavalry of the Crimson Heaven’s Banner:** Five.\n**Tiger-Rushing Attendants of the Upper Immortal Capital:** One thousand two hundred.\n**Hook-Riding Inspectors of the Upper Immortal Capital:** One thousand two hundred.\n**Archers of the Three Offices of the Upper Immortal Capital:** One thousand two hundred.\n**Celestial Ding Warriors of the Upper Immortal Capital:** One thousand two hundred.\n**Celestial Courier Armored Soldiers of the Upper Immortal Capital:** One thousand two hundred.\n**Qi-Seizing Qi-Consuming Clerks of the Upper Immortal Capital:** Sixty.\n**Spirit-Seizing Spirit-Consuming Clerks of the Upper Immortal Capital:** Sixty.\n**Ghost-Seizing Ghost-Consuming Clerks of the Upper Immortal Capital:** Sixty.\n**Evil-Seizing Evil-Consuming Clerks of the Upper Immortal Capital:** Sixty.\n**Toxin-Seizing Toxin-Consuming Clerks of the Upper Immortal Capital:** Sixty.\n**Red Talisman Chariot Clerks of the Upper Immortal Capital:** Sixty.\n**Strong Wind Cavalry Post Clerks of the Upper Immortal Capital:** Sixty.\n**Post-Horse Memorial-Submitting Clerks of the Upper Immortal Capital:** Sixty.\n\n**Direct Envoys of the Upper Numinous Bureau:** Fifteen Merit Officers.\n**Orthodox Unity Merit Officers of the Upper Numinous Bureau:** Fifteen.\n**Healing Merit Officers of the Upper Numinous Bureau:** Fifteen.\n**Left Envoys of the Upper Numinous Bureau:** Fifteen.\n**Right Envoys of the Upper Numinous Bureau:** Fifteen.\n**Yin Spirit Judgment Clerks of the Upper Numinous Bureau:** Fifteen.\n**Yang Spirit Judgment Clerks of the Upper Numinous Bureau:** Fifteen.\n**Yin Palace Merit Officers of the Upper Numinous Bureau:** Fifteen.\n**Yang Palace Merit Officers of the Upper Numinous Bureau:** Fifteen.\n**Grand Physician Clerks of the Yin Palace of the Upper Numinous Bureau:** Fifteen.\n**Grand Physician Clerks of the Yang Palace of the Upper Numinous Bureau:** Fifteen.\n**Great Generals of the Post Cavalry of the Upper Numinous Bureau:** Five.\n**Left Generals of the Post Cavalry of the Upper Numinous Bureau:** Five.\n**Right Generals of the Post Cavalry of the Upper Numinous Bureau:** Five.\n**Great Generals of the Post Cavalry Bureau of the Upper Numinous Bureau:** Five.\n**Left Generals of the Post Cavalry Bureau of the Upper Numinous Bureau:** Five.\n**Right Generals of the Post Cavalry Bureau of the Upper Numinous Bureau:** Five.\n**Great Generals of the Upper Numinous Bureau:** Five.\n**Left Generals of the Upper Numinous Bureau:** Five.\n**Right Generals of the Upper Numinous Bureau:** Five.\n**Great Generals of the Supervisory Cavalry of the Upper Numinous Bureau:** Five.\n**Left Generals of the Supervisory Cavalry of the Upper Numinous Bureau:** Five.\n**Right Generals of the Supervisory Cavalry of the Upper Numinous Bureau:** Five.\n**Great Generals of the Central Supervisory Cavalry of the Upper Numinous Bureau:** Five.\n**Left Generals of the Central Supervisory Cavalry of the Upper Numinous Bureau:** Five.\n**Right Generals of the Central Supervisory Cavalry of the Upper Numinous Bureau:** Five.\n**Tiger-Rushing Attendants of the Upper Numinous Bureau:** One thousand two hundred.\n**Hook-Riding Inspectors of the Upper Numinous Bureau:** One thousand two hundred.\n**Archers of the Three Offices of the Upper Numinous Bureau:** One thousand two hundred.\n**Celestial Courier Armored Soldiers of the Upper Numinous Bureau:** One thousand two hundred.\n**Celestial Ding Warriors of the Upper Numinous Bureau:** One thousand two hundred.\n**Qi-Seizing Qi-Consuming Clerks of the Upper Numinous Bureau:** Sixty.\n**Spirit-Seizing Spirit-Consuming Clerks of the Upper Numinous Bureau:** Sixty.\n**Ghost-Seizing Ghost-Consuming Clerks of the Upper Numinous Bureau:** Sixty.\n**Evil-Seizing Evil-Consuming Clerks of the Upper Numinous Bureau:** Sixty.\n**Toxin-Seizing Toxin-Consuming Clerks of the Upper Numinous Bureau:** Sixty.\n**Red Talisman Chariot Clerks of the Upper Numinous Bureau:** Sixty.\n**Strong Wind Cavalry Post Clerks of the Upper Numinous Bureau:** Sixty.\n**Post-Horse Memorial-Submitting Clerks of the Upper Numinous Bureau:** Sixty.\n\nFirst: Refrain from killing; contemplate the lives of all beings.\nSecond: Refrain from lustful conduct or illicit relations.\n\nThird: Refrain from theft; do not take wealth that is unjust.\nFourth: Refrain from deceit; do not reverse right and wrong in argument.\nFifth: Refrain from intoxication; always contemplate pure conduct.\n\n**End of the Register of the Supreme Orthodox Unity Alliance-Wei Rites, as attested by the Sponsor, the Supervising Ordainer, and the Ordination Master.**",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上正一盟威法箓 经名：太上正一盟威法箓。 撰人不详，约出於南北朝，系早期天师道法箓。 一卷。 底本出处：《正统道藏》正一部。 太上正一盟威法箓 太上一官童子箓， 太上十官童子箓， 太上七十五官童子箓， 太上三五赤官斩邪箓， 太一护身将军箓， 太上二十四治气箓， 太上护身延年解一切灾厄箓， 太上保命长生箓， 太上凤凰解秽妙箓， 太上三五解妨害宝符妙箓， 太上老君授徐甲延生保命箓， 太上招财镇宝妙箓， 太上九一河图宝箓， 太上百五十将军男仙灵箓。 太上一官童子箓 维某年某月某日，某州县乡里，某宫观受某法箓姓某，素被新出老君太上高皇帝王神气在身，不能自分别，今赍信诣三洞法师臣某，请受太上一官童子箓，自实悉言，被君召，即日听署之后，要当扶助天师医治百姓疾病，不得轻泄淫盗，鬲戾妬，行不正之事，自作一法，诽笑师主者，此魔鬼所嫉，但当慈仁育孝，敬老爱少，父母兄弟，更相承奉，常以五腊吉日於堂上祝家亲九祖，二月八月同日祀社灶，其余不得私祀他鬼神，一旦违犯，坐见中伤，不得怨道咎师，一如律令。 北一上官直使功曹二人， 北一上官郎吏虎贲百二十人，",
      "translated_text": "**The Supreme Orthodox Unity Alliance of Might Registers**\n\n**Title:** *The Supreme Orthodox Unity Alliance of Might Registers*\nAuthor unknown, approximately dating to the Northern and Southern Dynasties, belonging to the early Celestial Master Dao registers. One scroll.\nSource of base text: *Zhengtong Daoist Canon*, Orthodox Unity Section, First Subsection.\n\n---\n\n**The Supreme Orthodox Unity Alliance of Might Registers**\n\nThe Register of the Supreme One Office Divine Lads,\nThe Register of the Supreme Ten Office Divine Lads,\nThe Register of the Supreme Seventy-Five Office Divine Lads,\nThe Register of the Supreme Three-Five Red Officials for Slaying Demons,\nThe Register of the Great Unity Protector-General of the Body,\nThe Register of the Supreme Twenty-Four Governances’ Qi,\nThe Register of the Supreme Protection of the Body, Prolonging Life, and Resolving All Calamities,\nThe Register of the Supreme Preservation of Life and Longevity,\nThe Supreme Phoenix Register for Dispelling Defilement,\nThe Supreme Three-Five Precious Register for Resolving Harm,\nThe Register of Lord Lao Bestowing upon Xu Jia for Prolonging Life and Preserving Destiny,\nThe Supreme Register for Summoning Wealth and Securing Treasures,\nThe Supreme Nine-One River Chart Precious Register,\nThe Supreme Register of One Hundred Fifty Generals and Male Immortals.\n\n---\n\n**The Register of the Supreme One Office Divine Lads**\n\nOn such-and-such a year, month, and day, in such-and-such a prefecture, county, village, and abbey, so-and-so of such-and-such a register, having long borne the divine qi of the Most High Lord Lao, the Supreme August Emperor Wang, within their person yet unable to distinguish it themselves, now presents their sincerity to the Master of the Three Caverns, your subject so-and-so, to receive the *Register of the Supreme One Office Divine Lads*. They truthfully declare: having been summoned by the Lord, from this day forth, upon receiving their appointment, they must assist the Celestial Master in healing the illnesses of the people. They shall not lightly divulge secrets, commit licentiousness or theft, harbor resentment, deceit, or jealousy, nor engage in improper conduct. Should they act independently or slander their master, they shall incur the envy of demonic spirits. They must only cultivate kindness, nurture filial piety, respect the elderly, cherish the young, and mutually support their parents and siblings. On the five auspicious days of the year and the sacred days of the five seasonal festivals, they shall offer prayers in the hall for their nine generations of ancestors. On the same day in the second and eighth months, they shall sacrifice to the earth god and the stove god. They shall not privately worship other spirits or gods. Should they violate these precepts even once, they shall suffer harm and injury, bearing no grudge against the Dao or blame toward their master. All shall be as the statutes command.\n\nTwo Merit Officers of the Northern First Upper Office,\nOne Hundred Twenty Tiger-Rushing Clerks of the Northern First Upper Office.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 508,
      "start_sentence": 0,
      "end_sentence": 23,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.509466171264648,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一盟威法箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "北一上官正一功曹二人， 北一上官察奸钩骑百二十人， 北一上官治病功曹二人， 北一上官三官仆射百二十人， 北一上官左官使者二人， 北一上官天驺甲卒百二十人， 北一上官右官使者二人， 北一上官天丁力士百二十人， 北一上官阴阳神央吏二人， 北一上官收气食气吏百二十人， 赤天历旗刚风将军百二十人， 赤天历旗左右将军百二十人。 保举 监度 度师 太上十官童子箓 维某年某月某日，某州县乡里，某宫观受某法箓姓某，素被新出老君太上高皇帝王神气在身，不能自分别，今赍信诣三洞法师臣其请受太上十官童子箓，自实悉言，被君召，即日听署之后，约当慈仁育孝，敬老爱少，父母兄弟更相承奉，常以五腊吉日，於堂上杞家亲九祖，二月八月同日祀社灶，其余不得私祀他鬼神，一旦违犯，坐见中伤，不得怨道咎师，一如太上老君律令。 上仙都直使功曹二人， 上仙都郎吏虎贲二百四十人，",
      "translated_text": "Two Merit Officers of the Northern First Upper Office, Orthodox Unity Division,\nOne Hundred Twenty Investigating Deceivers and Hook-Riding Clerks of the Northern First Upper Office,\nTwo Healing Officers of the Northern First Upper Office,\nOne Hundred Twenty Directors of the Three Offices of the Northern First Upper Office,\nTwo Left Office Envoys of the Northern First Upper Office,\nOne Hundred Twenty Celestial Couriers and Armored Soldiers of the Northern First Upper Office,\nTwo Right Office Envoys of the Northern First Upper Office,\nOne Hundred Twenty Celestial Ding Warriors of the Northern First Upper Office,\nTwo Yin-Yang Spirit Officers of the Northern First Upper Office,\nOne Hundred Twenty Qi-Gathering and Qi-Nourishing Clerks of the Northern First Upper Office,\nOne Hundred Twenty Crimson Celestial Banner and Strong Wind Generals,\nOne Hundred Twenty Crimson Celestial Banner Left and Right Generals.\n\n**Recommendation, Supervision, and Ordination:**\nRegister of the Ten Offices Divine Lads of the Most High\nOn the _day/month/year_, at the _Palace/Abbey_ of _prefecture/county/township_, the disciple of _surname_, having received the register of the _Dharma Register_, declares:\nImbued with the divine qi of the newly manifested Lord Lao, the Most High August Emperor-King, yet unable to discern it myself, I now present this token of faith to the Three Caverns Dharma Master, your servant, to humbly request the register of the Ten Offices Divine Lads of the Most High.\nI truly affirm and declare that, upon being summoned and enrolled henceforth, I shall cultivate kindness, nurture filial piety, respect the elderly, cherish the young, and mutually support my parents and siblings. On the five auspicious days of the year and the sacred days of the five seasonal festivals, I shall offer prayers in the hall for my nine generations of ancestors. On the same day in the second and eighth months, I shall sacrifice to the earth god and the stove god. I shall not privately worship other spirits or gods. Should I violate these precepts even once, I shall suffer harm and injury, bearing no grudge against the Dao or blame toward my master. All shall be as the statutes of the Most High Lord Lao command.\n\nTwo Merit Officers of the Upper Immortal Capital,\nTwo Hundred Forty Tiger-Rushing Clerks of the Upper Immortal Capital.",
      "overlap_context": "nerations of ancestors. On the same day in the second and eighth months, they shall sacrifice to the earth god and the stove god. They shall not privately worship other spirits or gods. Should they violate these precepts even once, they shall suffer harm and injury, bearing no grudge against the Dao or blame toward their master. All shall be as the statutes command.\n\nTwo Merit Officers of the Northern First Upper Office,\nOne Hundred Twenty Tiger-Rushing Clerks of the Northern First Upper Office.",
      "start_char": 508,
      "end_char": 915,
      "start_sentence": 24,
      "end_sentence": 42,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.361051321029663,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一盟威法箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "上仙都正一功曹二人， 上仙都察奸钩骑二百四十人， 上仙都治病功曹二人， 上仙都三官仆射二百四十人， 上仙都左官使者二人， 上仙都天驺甲卒二百四十人， 上仙都右官使者二人， 上仙都天丁力士二百四十人， 上仙都阴阳神决吏二人， 上仙都收气食气吏二百四十人， 上仙都阴阳官太医吏二人， 上仙都刚风骑置驿马上章吏二百四十人， 赤天历旗刚风官驿将军二人， 赤天历旗刚风左官驿将军二人， 赤天历旗刚风右官驿将军二人， 赤天历旗刚风左将军二人， 赤天历旗刚风右将军二人。 保举 监度",
      "translated_text": "Two Regular Rectifying Clerks of the Upper Immortal Capital,\nTwo Hundred Forty Investigating Lictors of the Upper Immortal Capital,\nTwo Healing Clerks of the Upper Immortal Capital,\nTwo Hundred Forty Archers of the Three Officials of the Upper Immortal Capital,\nTwo Left Envoys of the Upper Immortal Capital,\nTwo Hundred Forty Celestial Couriers of the Upper Immortal Capital,\nTwo Right Envoys of the Upper Immortal Capital,\nTwo Hundred Forty Celestial Ding Warriors of the Upper Immortal Capital,\nTwo Yin-Yang Divination Clerks of the Upper Immortal Capital,\nTwo Hundred Forty Qi-Absorbing Clerks of the Upper Immortal Capital,\nTwo Yin-Yang Physician Clerks of the Upper Immortal Capital,\nTwo Hundred Forty Swift Wind Courier Clerks of the Upper Immortal Capital,\nTwo Crimson Heaven Banner Swift Wind Courier Generals,\nTwo Crimson Heaven Banner Swift Wind Left Courier Generals,\nTwo Crimson Heaven Banner Swift Wind Right Courier Generals,\nTwo Crimson Heaven Banner Swift Wind Left Generals,\nTwo Crimson Heaven Banner Swift Wind Right Generals.\nRecommending and Supervising Ordination.",
      "overlap_context": "nerations of ancestors. On the same day in the second and eighth months, I shall sacrifice to the earth god and the stove god. I shall not privately worship other spirits or gods. Should I violate these precepts even once, I shall suffer harm and injury, bearing no grudge against the Dao or blame toward my master. All shall be as the statutes of the Most High Lord Lao command.\n\nTwo Merit Officers of the Upper Immortal Capital,\nTwo Hundred Forty Tiger-Rushing Clerks of the Upper Immortal Capital.",
      "start_char": 915,
      "end_char": 1188,
      "start_sentence": 43,
      "end_sentence": 61,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 4.650915622711182,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一盟威法箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "度师 太上七十五官童子箓 维某年某月某日，某州县乡里，某宫观受某法箓姓某，素被新出老君太上高皇帝王神气在身，不能自分别，今赍信诣三洞法师臣某，请受太上七十五官童子箓，自实悉言，被君召即日听署之后，约当慈仁育孝，敬老爱少，父母兄弟更相承奉，常以五腊吉日於堂上祀家亲九祖父母，二月八月同日祀社灶，其余不得私祀他鬼神，一旦违犯，坐见中伤，不得怨道咎师，一如太上老君律令。 上灵官直使功曹二人， 上灵官郎吏虎贲二百四十人，",
      "translated_text": "Ordination Master of the Register of the Seventy-Five Offices of the Celestial Youths\n\nOn the _day_ of the _month_ of the _year_, [name], of [prefecture], [county], [township], and [village], from [Daoist abbey/temple], having received the Register of the [specific] Daoist Ordination, bearing the divine qi of the Most High Lord Lao, the Supreme August Emperor Wang, newly infused within the body, yet unable to distinguish it clearly, now presents credentials and approaches the Three Caverns’ Dharma Master, your servant [name], to receive the *Register of the Seventy-Five Offices of the Celestial Youths*. All statements herein are true and complete. Upon being summoned by the Lord, [the recipient] shall, from this day forward, be assigned duties in accordance with the following precepts:\n\nTo cultivate compassion and filial piety, to revere the aged and cherish the young, and to ensure mutual care among parents and siblings. On the five auspicious days of the Five La Festivals, offerings shall be made in the hall to the nine generations of ancestral parents. On the same day in the second and eighth months, sacrifices shall be made to the Earth God and the Hearth God. No private worship of other spirits or deities is permitted. Should any violation occur, harm shall befall the transgressor, who shall not blame the Dao or fault the master. All is in accordance with the statutes and decrees of the Most High Lord Lao.\n\nTwo Direct Envoys of the Upper Numinous Office,\nTwo Hundred Forty Tiger-Rushing Couriers of the Upper Numinous Office,",
      "overlap_context": "bing Clerks of the Upper Immortal Capital,\nTwo Yin-Yang Physician Clerks of the Upper Immortal Capital,\nTwo Hundred Forty Swift Wind Courier Clerks of the Upper Immortal Capital,\nTwo Crimson Heaven Banner Swift Wind Courier Generals,\nTwo Crimson Heaven Banner Swift Wind Left Courier Generals,\nTwo Crimson Heaven Banner Swift Wind Right Courier Generals,\nTwo Crimson Heaven Banner Swift Wind Left Generals,\nTwo Crimson Heaven Banner Swift Wind Right Generals.\nRecommending and Supervising Ordination.",
      "start_char": 1188,
      "end_char": 1406,
      "start_sentence": 62,
      "end_sentence": 66,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 8.121872425079346,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一盟威法箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "上灵官正一功曹二人， 上灵官察奸钩骑二百四十人， 上灵官治病功曹二人， 上灵官三官仆射二百四十人， 上灵官左官使者二人， 上灵官天丁力士二百四十人， 上灵官右官使者二人， 上灵官收气食气吏二百四十人， 上灵官阳神决吏二人， 上灵官收鬼食鬼吏二百四十人， 上灵官阴神决吏二人， 上灵官科车赤符吏二百四十人， 上灵官阳官太医吏二人， 上灵官刚风骑置吏二百四十人， 上灵官阴官太医吏二人， 上灵官驿马上章吏二百四十人， 上灵官候神将军二人， 上灵官候都神将军二人， 上灵官候左都神将军二人， 上灵官候右都神将军二人， 上灵官候仕将军二人。 保举 监度",
      "translated_text": "Two Direct Envoys of the Orthodox Unity Office of the Upper Numinous Bureau,\nTwo Hundred Forty Hook-Riding Inspectors of the Upper Numinous Bureau,\n\nTwo Direct Envoys for Healing of the Upper Numinous Bureau,\nTwo Hundred Forty Archers of the Three Officials of the Upper Numinous Bureau,\n\nTwo Left Bureau Envoys of the Upper Numinous Bureau,\nTwo Hundred Forty Celestial Ding Warriors of the Upper Numinous Bureau,\n\nTwo Right Bureau Envoys of the Upper Numinous Bureau,\nTwo Hundred Forty Qi-Absorbing and Qi-Consuming Officers of the Upper Numinous Bureau,\n\nTwo Yang Spirit Judgment Officers of the Upper Numinous Bureau,\nTwo Hundred Forty Ghost-Seizing and Ghost-Consuming Officers of the Upper Numinous Bureau,\n\nTwo Yin Spirit Judgment Officers of the Upper Numinous Bureau,\nTwo Hundred Forty Scarlet Talisman Chariot Officers of the Upper Numinous Bureau,\n\nTwo Yang Bureau Grand Physicians of the Upper Numinous Bureau,\nTwo Hundred Forty Gale-Riding Couriers of the Upper Numinous Bureau,\n\nTwo Yin Bureau Grand Physicians of the Upper Numinous Bureau,\nTwo Hundred Forty Post-Horse Memorial Officers of the Upper Numinous Bureau,\n\nTwo Spirit-Waiting Generals of the Upper Numinous Bureau,\nTwo Capital Spirit-Waiting Generals of the Upper Numinous Bureau,\n\nTwo Left Capital Spirit-Waiting Generals of the Upper Numinous Bureau,\nTwo Right Capital Spirit-Waiting Generals of the Upper Numinous Bureau,\n\nTwo Attendant-Waiting Generals of the Upper Numinous Bureau.\n\nGuarantors and Supervisors of Ordination.",
      "overlap_context": "ncestral parents. On the same day in the second and eighth months, sacrifices shall be made to the Earth God and the Hearth God. No private worship of other spirits or deities is permitted. Should any violation occur, harm shall befall the transgressor, who shall not blame the Dao or fault the master. All is in accordance with the statutes and decrees of the Most High Lord Lao.\n\nTwo Direct Envoys of the Upper Numinous Office,\nTwo Hundred Forty Tiger-Rushing Couriers of the Upper Numinous Office,",
      "start_char": 1406,
      "end_char": 1725,
      "start_sentence": 67,
      "end_sentence": 89,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 6.500905275344849,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一盟威法箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "度师 太上三五赤官斩邪箓 维某年某月某日，某州县乡里，某官观受某法条姓某，素被新出老君太上高皇帝王神气在身，不能自分别，今赍信诣三洞法师臣某，请受三五赤官斩邪支兵，定三魂，安七魄； 随逐上下，行来出入，辟斥众邪，收灭精怪，鼋鼉龟龞狐狸老精，千岁妖孽，王相刚柔，群凶故气，不得妄犯弟子之身，一如太上老君律令。 天灵赤官直使功曹二人， 天灵赤官正一功曹二人， 天灵赤官治病功曹二人， 天灵赤官左官使者二人， 天灵赤官右官使者二人， 天灵赤官阳神决吏二人， 天灵赤官阴神决吏二人， 天灵赤官阳官太医吏二人， 天灵赤官阴官太医吏二人， 天灵赤官监邪将军二人， 天灵赤官摄邪将军二人， 天灵赤官诛邪将军二人， 天灵赤官伐邪将军二人， 天灵赤官斩邪左将军二人， 天灵赤官斩邪右将军二人， 天灵赤官阳官将军二人， 天灵赤官阴官将军二人， 天灵赤官护身将军二人， 天灵赤官禽奇将军二人， 天灵赤官阴神太医吏二人， 天灵赤官阳神太医吏二人， 天灵赤官监邪直符二人， 天灵赤官斩邪使者二人， 天灵赤官正一使者二人， 天灵赤官斩邪刺奸二人， 天灵赤官斩邪御史二人， 天灵赤官斩邪都护二人， 天灵赤官斩邪将军二人， 天灵赤官斩邪禽奇二人， 天灵赤官斩邪玉女二十四人， 天灵赤官扁鹊医吏二人， 天灵赤官斩邪青龙白虎朱雀玄武各三十六人。 保举 监度",
      "translated_text": "Ordination Master of the *Tai Shang San Wu Chi Guan Zhan Xie Lu*:\n\nOn the [day] of [month] in the [year], [name], of [prefecture], [county], [township], and [village], a Daoist of [temple/monastery], having received the precepts of [specific method], bearing the surname [name], has long been infused with the divine qi of the Most High Lord Lao, the Supreme August Emperor Wang. Unable to distinguish it himself, he now presents his credentials to the Three Caverns Master, your servant [name], to receive the *San Wu Chi Guan Zhan Xie Zhi Bing*, to stabilize the Three Hun and settle the Seven Po. Following above and below, accompanying all movements in and out, they repel and expel all malevolent forces, capture and extinguish spirits and anomalies—be they river turtles, alligators, tortoises, soft-shelled turtles, foxes, ancient specters, thousand-year-old demons, dominant or recessive malign influences, or any hostile residual qi—preventing them from rashly violating the disciple’s person. All is done in accordance with the statutes and commands of the Most High Lord Lao.\n\nTwo Celestial Numinous Red Official Direct Envoys of Merit Officers,\nTwo Celestial Numinous Red Official Orthodox Unity Merit Officers,\nTwo Celestial Numinous Red Official Disease-Treating Merit Officers,\nTwo Celestial Numinous Red Official Left Official Envoys,\nTwo Celestial Numinous Red Official Right Official Envoys,\nTwo Celestial Numinous Red Official Yang Spirit Judgment Officers,\nTwo Celestial Numinous Red Official Yin Spirit Judgment Officers,\nTwo Celestial Numinous Red Official Yang Bureau Grand Physicians,\nTwo Celestial Numinous Red Official Yin Bureau Grand Physicians,\nTwo Celestial Numinous Red Official Supervising Malevolence Generals,\nTwo Celestial Numinous Red Official Seizing Malevolence Generals,\nTwo Celestial Numinous Red Official Punishing Malevolence Generals,\nTwo Celestial Numinous Red Official Subduing Malevolence Generals,\nTwo Celestial Numinous Red Official Beheading Malevolence Left Generals,\nTwo Celestial Numinous Red Official Beheading Malevolence Right Generals,\nTwo Celestial Numinous Red Official Yang Bureau Generals,\nTwo Celestial Numinous Red Official Yin Bureau Generals,\nTwo Celestial Numinous Red Official Body-Protecting Generals,\nTwo Celestial Numinous Red Official Capturing Anomalies Generals,\nTwo Celestial Numinous Red Official Yin Spirit Grand Physicians,\nTwo Celestial Numinous Red Official Yang Spirit Grand Physicians,\nTwo Celestial Numinous Red Official Supervising Malevolence Direct Talisman Officers,\nTwo Celestial Numinous Red Official Beheading Malevolence Envoys,\nTwo Celestial Numinous Red Official Orthodox Unity Envoys,\nTwo Celestial Numinous Red Official Beheading Malevolence and Piercing Treachery Officers,\nTwo Celestial Numinous Red Official Beheading Malevolence Censors,\nTwo Celestial Numinous Red Official Beheading Malevolence Protectors,\nTwo Celestial Numinous Red Official Beheading Malevolence Generals,\nTwo Celestial Numinous Red Official Beheading Malevolence and Capturing Anomalies Officers,\nTwenty-Four Celestial Numinous Red Official Beheading Malevolence Jade Maidens,\nTwo Celestial Numinous Red Official Bian Que Medical Officers,\nThirty-Six Celestial Numinous Red Official Beheading Malevolence Azure Dragons,\nThirty-Six Celestial Numinous Red Official Beheading Malevolence White Tigers,\nThirty-Six Celestial Numinous Red Official Beheading Malevolence Vermilion Birds,\nThirty-Six Celestial Numinous Red Official Beheading Malevolence Dark Warriors.\n\nGuarantors and Supervisors of Ordination.",
      "overlap_context": "au Grand Physicians of the Upper Numinous Bureau,\nTwo Hundred Forty Post-Horse Memorial Officers of the Upper Numinous Bureau,\n\nTwo Spirit-Waiting Generals of the Upper Numinous Bureau,\nTwo Capital Spirit-Waiting Generals of the Upper Numinous Bureau,\n\nTwo Left Capital Spirit-Waiting Generals of the Upper Numinous Bureau,\nTwo Right Capital Spirit-Waiting Generals of the Upper Numinous Bureau,\n\nTwo Attendant-Waiting Generals of the Upper Numinous Bureau.\n\nGuarantors and Supervisors of Ordination.",
      "start_char": 1725,
      "end_char": 2359,
      "start_sentence": 90,
      "end_sentence": 127,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 15.285668134689331,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一盟威法箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "度师 太上护身将军箓 维某年某月某日，某州县乡里，某宫观受某法箓姓某，素被新出老君太上高皇帝王神气在身，不能自分别，今赍信诣三洞法师臣某，请受太一护身将军神符箓，受任之后，太一真神五帝直符千乘万骑随逐弟子之身，度厄长存，当勤心敬法，尊崇大道，不得轻泄神文，一如太上老君律令。 皇天堂堂，覆弟子身，皇地厚载，弟子不开自通，不扶自行，日月同照，辟除五殃，圣神养育，坐食甘浆，王父相念，奉致仙方，王母相念，延年益寿，玉女相念，焚烧五香，真人相念，语笑相迎，兵人相见，摧折锋铓，力士相见，奸人敢当，桥梁即渡，水为不流，山林进止，辟斥道途，五兵鬼贼，逃避要头，行无不通，止无不休，依科奉受，立得仙度，急急一如太上老君律令。 保举 监度",
      "translated_text": "Ordination Master of the Supreme Lord’s Body-Protecting General Register:\n\nOn the ___ day of the ___ month of the ___ year, at ___ Palace/Abbey in ___ Prefecture, ___ County, ___ Township, the disciple of the ___ Register, surnamed ___, whose body has long been infused with the divine qi of the newly manifested Lord Lao, the Supreme High Emperor Wang, yet unable to distinguish it, now presents this token of faith to the Three Caverns’ Dharma Master, your servant ___, to receive the Divine Talisman and Register of the Grand One’s Body-Protecting General. Upon investiture, the true spirits of the Grand One, the Five Thearchs’ direct talismans, and a thousand chariots with ten thousand cavalry shall follow the disciple’s person, warding off calamities and ensuring enduring existence.\n\nHenceforth, the disciple must diligently revere the Dharma and uphold the Great Dao, never lightly divulging the sacred writ. All shall be as decreed by the Most High Lord Lao.\n\nMajestic is the August Heaven, sheltering the disciple’s body;\nProfound is the August Earth, bearing the disciple without obstruction.\nUnassisted, the disciple walks; unguided, the path unfolds.\nSun and moon alike illuminate, dispelling the Five Misfortunes.\nHoly spirits nurture, granting sweet nectar to partake.\nThe King Father remembers, bestowing immortal recipes;\nThe Queen Mother remembers, prolonging life and adding years.\nThe Jade Maidens remember, burning the Five Fragrances;\nThe Perfected remember, greeting with laughter and speech.\nUpon meeting the Warrior Spirits, blades are blunted and points broken;\nUpon meeting the Valiant Guardians, no treacherous one dares stand.\nBridges are crossed instantly; waters cease to flow.\nIn mountains and forests, all paths are cleared and obstacles repelled.\nThe Five Weapons, ghostly thieves, flee and hide their heads.\nWherever the disciple travels, all is unimpeded;\nWherever the disciple rests, all is at peace.\nAbiding by the precepts and receiving this register,\nascension to immortality is swiftly attained.\n\nHasten! All as decreed by the Most High Lord Lao.\n\nGuarantors and Supervisors of Ordination.",
      "overlap_context": "-Four Celestial Numinous Red Official Beheading Malevolence Jade Maidens,\nTwo Celestial Numinous Red Official Bian Que Medical Officers,\nThirty-Six Celestial Numinous Red Official Beheading Malevolence Azure Dragons,\nThirty-Six Celestial Numinous Red Official Beheading Malevolence White Tigers,\nThirty-Six Celestial Numinous Red Official Beheading Malevolence Vermilion Birds,\nThirty-Six Celestial Numinous Red Official Beheading Malevolence Dark Warriors.\n\nGuarantors and Supervisors of Ordination.",
      "start_char": 2359,
      "end_char": 2684,
      "start_sentence": 128,
      "end_sentence": 133,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.740510702133179,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一盟威法箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "度师 太上二十四治气箓 系天师阳平等治，太上中气，东西南北四部，将行督察二十四治，领二十四气，监天都功统九州里社天师门下小臣，今有弟子应被逮召，应备法职，今辄选补二十四气。 阳平治 太上中气功曹平气大品将军一人， 鹿堂治 太上中气大都功大品将军一人， 鹄鸣治 太上中气右领兵大品将军一人， 漓沅治 太上中气平五气大品将军一人， 葛瑰治 太上中气左领功曹大品将军一人， 庚除治 太上中气左监神气大品将军一人， 秦中治 太上中气右领真气大品将军一人， 真多治 太上中气右领监气大品将军一人， 昌利治 太上中气左领行气大品将军一人， 隶上治 太上中气左监白气大品将军一人， 涌泉治 太上中气右监神气大品将军一人， 稠粳治 太上中气右察气大品将军一人， 北平治 太上中气东部行气大品将军一人， 本竹治 太上中气南部行气大品将军一人， 蒙秦治 太上中气左领决职大品将军一人， 平盖治 太上中气佐四部气大品将军一人， 云台治 太上中气右领决职大品将军一人， 浕口治 太上中气西部行气大品将军一人， 后城治 太上中气右领行气大品将军一人， 公慕治 太上中气执气大品将军一人， 平岗治 太上中气左领神大品将军一人， 主簿治 太上中气左察气大品将军一人， 玉局治 太上中气右察气大品将军一人， 北邙治 太上中气右领神大品将军一人， 维某年某月某日，某州县乡里，某宫观受某法箓姓某，素被新出老君太上高皇帝王神气在身，不能自分别，今赍信诣三洞法师臣某，请受太上二十四治箓，修行供养，永为身宝，急急一如律令。 保举 监度",
      "translated_text": "**Ordination Master**\n\nThe *Tai Shang Ershi Si Zhi Qi Lu* (Register of the Twenty-Four Qi Governances of the Most High) is overseen by the Celestial Master’s Yangping and other governances. The Central Qi of the Most High, along with the Four Quarters—East, West, South, and North—dispatchs inspectors to supervise the Twenty-Four Governances, commanding the Twenty-Four Qi. The Supervisor of Celestial Merit, Steward of the Nine Provinces’ Village Altars, and minor servant of the Celestial Master’s gate, now selects and appoints to the Twenty-Four Qi a disciple who has been summoned and is prepared to assume ritual office.\n\n**Yangping Governance**\nOne *Da Pin* General of the Central Qi’s Merit Officers and Balanced Qi\n\n**Lutang Governance**\nOne *Da Pin* General of the Central Qi’s Grand Merit\n\n**Guming Governance**\nOne *Da Pin* General of the Central Qi’s Right Vanguard\n\n**Liyuan Governance**\nOne *Da Pin* General of the Central Qi’s Balanced Five Qi\n\n**Ge Gui Governance**\nOne *Da Pin* General of the Central Qi’s Left Merit Officer\n\n**Gengchu Governance**\nOne *Da Pin* General of the Central Qi’s Left Qi Overseer\n\n**Qinzhong Governance**\nOne *Da Pin* General of the Central Qi’s Right True Qi Vanguard\n\n**Zhenduo Governance**\nOne *Da Pin* General of the Central Qi’s Right Qi Overseer\n\n**Changli Governance**\nOne *Da Pin* General of the Central Qi’s Left Circulating Qi Vanguard\n\n**Lishang Governance**\nOne *Da Pin* General of the Central Qi’s Left White Qi Overseer\n\n**Yongquan Governance**\nOne *Da Pin* General of the Central Qi’s Right Divine Qi Overseer\n\n**Chougeng Governance**\nOne *Da Pin* General of the Central Qi’s Right Qi Inspector\n\n**Beiping Governance**\nOne *Da Pin* General of the Eastern Quarter’s Circulating Qi\n\n**Benzhu Governance**\nOne *Da Pin* General of the Southern Quarter’s Circulating Qi\n\n**Mengqin Governance**\nOne *Da Pin* General of the Central Qi’s Left Decision Officer\n\n**Pinggai Governance**\nOne *Da Pin* General of the Central Qi’s Assistant to the Four Quarters’ Qi\n\n**Yuntai Governance**\nOne *Da Pin* General of the Central Qi’s Right Decision Officer\n\n**Jinkou Governance**\nOne *Da Pin* General of the Western Quarter’s Circulating Qi\n\n**Houcheng Governance**\nOne *Da Pin* General of the Central Qi’s Right Circulating Qi Vanguard\n\n**Gongmu Governance**\nOne *Da Pin* General of the Central Qi’s Qi Executor\n\n**Pinggang Governance**\nOne *Da Pin* General of the Central Qi’s Left Divine Vanguard\n\n**Zhubu Governance**\nOne *Da Pin* General of the Central Qi’s Left Qi Inspector\n\n**Yuju Governance**\nOne *Da Pin* General of the Central Qi’s Right Qi Inspector\n\n**Beimang Governance**\nOne *Da Pin* General of the Central Qi’s Right Divine Vanguard\n\nOn the ___ day of the ___ month in the ___ year, [disciple] of ___ Prefecture, ___ County, ___ Village, ___ Abbey/Temple, having received the ___ Register of Ritual Methods, bearing the surname ___, has long been infused with the divine qi of the Most High Lord Lao, the Supreme August Emperor-King, yet remains unable to distinguish it. Now, presenting credentials, [the disciple] approaches the Three Caverns’ Dharma Master, your servant ___, to receive the *Tai Shang Ershi Si Zhi Lu*, cultivate its practice, and offer reverence, preserving it forever as a treasure of the body.\n\nHasten! All as decreed by the statutes.\n\n**Guarantors**\n**Supervisors of Ordination**",
      "overlap_context": "acherous one dares stand.\nBridges are crossed instantly; waters cease to flow.\nIn mountains and forests, all paths are cleared and obstacles repelled.\nThe Five Weapons, ghostly thieves, flee and hide their heads.\nWherever the disciple travels, all is unimpeded;\nWherever the disciple rests, all is at peace.\nAbiding by the precepts and receiving this register,\nascension to immortality is swiftly attained.\n\nHasten! All as decreed by the Most High Lord Lao.\n\nGuarantors and Supervisors of Ordination.",
      "start_char": 2684,
      "end_char": 3393,
      "start_sentence": 134,
      "end_sentence": 163,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 16.669195652008057,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一盟威法箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "度师 太上护身延年解一切灾厄箓 维某年某月某日，某州县乡里，某宫观受某法箓姓某，素被新出老君太上高皇帝王神气在身，不能自分别，今赍信诣三洞法师臣某，请受太上护身延年解一切灾厄箓，永为身宝，所有千灾万厄，永不相侵，子能持之，可以长生矣，急急如太上老君律令。 上仙官解年灾厄童子十二人， 上仙官解连星厄童子十二人， 上仙官解算尽厄童子十二人， 上仙官解死灾厄童子十二人， 上仙官解官灾厄童子十二人， 上仙官解疾病厄童子十二人， 上仙官解破财厄童子十二人， 上仙官解复连厄童子十二人， 上仙官解虎狼厄童子十二人， 上仙官解虫蛇厄童子十二人， 上仙官解天罗厄童子十二人， 上仙官解地纲厄童子十二人， 上仙官解元辰厄童子十二人， 上仙官解横祸厄童子十二人， 上仙官解水火厄童子十二人， 上仙官解劫贼厄童子十二人， 上仙官解刀兵厄童子十二人， 上仙官解刑狱厄童子十二人。 保举 监度",
      "translated_text": "**Preceptor of Transmission**\n*Tai Shang Register for Protecting the Body, Prolonging Life, and Dissolving All Calamities*\n\nOn the ___ day of the ___ month in the ___ year, [disciple] of ___ Prefecture, ___ County, ___ Village, ___ Abbey/Temple, having received the ___ Register of Ritual Methods, bearing the surname ___, has long been infused with the divine qi of the Most High Lord Lao, the Supreme August Emperor-King, yet remains unable to distinguish it. Now, presenting credentials, [the disciple] approaches the Three Caverns’ Dharma Master, your servant ___, to receive the *Tai Shang Register for Protecting the Body, Prolonging Life, and Dissolving All Calamities*, cultivating its practice and preserving it forever as a treasure of the body. All the thousand disasters and ten thousand calamities shall never again assail them. If one can uphold this, one may attain longevity.\n\nHasten! All as decreed by the statutes of the Most High Lord Lao.\n\n**Celestial Officials and Attendants for Dissolving Calamities**\nTwelve Divine Lads for Dissolving Yearly Calamities,\nTwelve Divine Lads for Dissolving Constellation-Linked Calamities,\nTwelve Divine Lads for Dissolving Fate-Exhaustion Calamities,\nTwelve Divine Lads for Dissolving Deathly Calamities,\nTwelve Divine Lads for Dissolving Official Calamities,\nTwelve Divine Lads for Dissolving Illness Calamities,\nTwelve Divine Lads for Dissolving Wealth-Loss Calamities,\nTwelve Divine Lads for Dissolving Repeated Calamities,\nTwelve Divine Lads for Dissolving Tiger and Wolf Calamities,\nTwelve Divine Lads for Dissolving Insect and Serpent Calamities,\nTwelve Divine Lads for Dissolving Heavenly Net Calamities,\nTwelve Divine Lads for Dissolving Earthly Snare Calamities,\nTwelve Divine Lads for Dissolving Original Destiny Calamities,\nTwelve Divine Lads for Dissolving Sudden Disasters,\nTwelve Divine Lads for Dissolving Water and Fire Calamities,\nTwelve Divine Lads for Dissolving Robbery and Banditry Calamities,\nTwelve Divine Lads for Dissolving Blade and Warfare Calamities,\nTwelve Divine Lads for Dissolving Penal and Imprisonment Calamities.\n\n**Guarantors**\n**Supervisors of Ordination**",
      "overlap_context": "ods, bearing the surname ___, has long been infused with the divine qi of the Most High Lord Lao, the Supreme August Emperor-King, yet remains unable to distinguish it. Now, presenting credentials, [the disciple] approaches the Three Caverns’ Dharma Master, your servant ___, to receive the *Tai Shang Ershi Si Zhi Lu*, cultivate its practice, and offer reverence, preserving it forever as a treasure of the body.\n\nHasten! All as decreed by the statutes.\n\n**Guarantors**\n**Supervisors of Ordination**",
      "start_char": 3393,
      "end_char": 3825,
      "start_sentence": 164,
      "end_sentence": 186,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.358036279678345,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一盟威法箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "度师 太上保命长生箓 维某年某月某日，某州县乡里，某宫观受某法箓姓某，素被新出老君太上高皇帝王神气在身，不能自分别，今赍信诣三洞法师臣某，请受保命长生箓，受任之后，要当扶助天师，医治百姓，不得饮酒食肉，一旦违犯，坐见中伤，不得怨道咎师，一如太上老君律令。 太上保命神符护弟子之身长生，急急如律令。 云鹊浅绿帔黄服青缘朱履 天灵官好生使者二人， 天灵官东斗注算君吏九人， 天灵官保命使者二人， 天灵官南斗上生君吏三人， 天灵官长生使者二人， 天灵官西斗记名君吏七人， 天灵官扁鹊太医二人， 天灵官北斗落死君吏五人， 天灵官除炁簿吏二人， 天灵官中斗大魁君吏十二人。 保举 监度",
      "translated_text": "**Ordination Master**\n\n*Tai Shang Bao Ming Chang Sheng Lu* (Register of the Supreme Lord for Protecting Life and Longevity)\n\nOn the ___ day of the ___ month of the ___ year, at ___ Palace/Abbey in ___ prefecture, ___ county, ___ township, the disciple of the register, ___ (surname), having long borne the divine qi of the newly manifested Lord Lao, the Supreme August Emperor Wang, within his body, yet unable to distinguish it himself, now presents his pledge and approaches the Three Caverns Master, your servant ___ (name), to receive the *Bao Ming Chang Sheng Lu* (Register for Protecting Life and Longevity). Upon receiving this charge, he must assist the Celestial Master in healing the people. He shall not consume wine or meat. Should he violate this once, he will suffer immediate harm, and may not blame the Dao or fault his master. This is in accordance with the statutes and ordinances of the Supreme Lord Lao.\n\n*Tai Shang Bao Ming* divine talisman protects the disciple’s body for longevity. *Hasten, hasten, in accordance with the statutes and ordinances!*\n\n**Attendants:**\n- Two *Tian Ling* Officials, Envoys of Life-Preservation\n- Nine Clerks of the Eastern Dipper, *Zhu Suan* (Life-Recording) Lords, *Tian Ling* Officials\n- Two *Bao Ming* (Life-Protecting) Envoys, *Tian Ling* Officials\n- Three Clerks of the Southern Dipper, *Shang Sheng* (Life-Granting) Lords, *Tian Ling* Officials\n- Two *Chang Sheng* (Longevity) Envoys, *Tian Ling* Officials\n- Seven Clerks of the Western Dipper, *Ji Ming* (Name-Recording) Lords, *Tian Ling* Officials\n- Two *Bian Que* Supreme Physicians, *Tian Ling* Officials\n- Five Clerks of the Northern Dipper, *Luo Si* (Death-Registering) Lords, *Tian Ling* Officials\n- Two Clerks of the *Chu Qi* (Qi-Removing) Register, *Tian Ling* Officials\n- Twelve Clerks of the Central Dipper, *Da Kui* (Great Chief) Lords, *Tian Ling* Officials\n\n**Guarantors**\n**Supervisors of Ordination**",
      "overlap_context": "ly Net Calamities,\nTwelve Divine Lads for Dissolving Earthly Snare Calamities,\nTwelve Divine Lads for Dissolving Original Destiny Calamities,\nTwelve Divine Lads for Dissolving Sudden Disasters,\nTwelve Divine Lads for Dissolving Water and Fire Calamities,\nTwelve Divine Lads for Dissolving Robbery and Banditry Calamities,\nTwelve Divine Lads for Dissolving Blade and Warfare Calamities,\nTwelve Divine Lads for Dissolving Penal and Imprisonment Calamities.\n\n**Guarantors**\n**Supervisors of Ordination**",
      "start_char": 3825,
      "end_char": 4147,
      "start_sentence": 187,
      "end_sentence": 203,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.464700937271118,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一盟威法箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "度师 太上凤凰解秽妙箓 维某年某月某日，某州县乡里，某宫观受某法箓姓某，素被新出老君太上高皇帝王神气在身，不能自分别，今赍信诣三洞法师臣某，请受太上解厄延年，除三灾辟九厄，令耳目聪明，安魂定魄，保度衰厄，解除百秽，急急一如太上老君律令。 东方青帝木官解秽君吏九人， 南方赤帝火官解秽君吏三人， 西方白帝金官解秽君吏七人， 北方黑帝水官解秽君吏五人， 中央黄帝土官解秽君吏十二人， 天上地下解秽君吏百二十人， 解秽玉女百二十人， 九凤破秽君将吏兵百二十人。 东方青秽，南方赤秽，中央黄秽，西方白秽，北方黑秽，五方五色之秽，天秽地秽，人秽鬼秽，牛马六畜之秽，浊不忏清死不妨生，从今解秽，令我长生。 保举 监度",
      "translated_text": "**Ordination Master**\n*Tai Shang Feng Huang* (Supreme Phoenix) *Miao Lu* (Wondrous Register for Dissolving Impurities)\n\nOn the ___ day of the ___ month in the ___ year, at ___ Palace/Abbey in ___ prefecture, ___ county, ___ township, the disciple of ___ surname, having received the ___ Register of the Dao, bears within the divine qi of the Most High Lord Lao, the Supreme August Emperor-King. Unable to distinguish these influences alone, they now present their pledge and approach the Three Caverns’ Dharma Master, your servant ____, to receive the *Tai Shang* (Most High) Register for Dissolving Calamities and Prolonging Years, dispelling the Three Disasters and averting the Nine Perils. May their ears and eyes be keen, their hun-soul stabilized and po-soul settled, their decline and misfortune safeguarded, and the hundred impurities dissolved. Swiftly, swiftly, in accordance with the statutes and commands of the Most High Lord Lao.\n\n**Officials for Dissolving Impurities**\n- Nine Clerks of the Eastern Azure Emperor, Wood Office, *Jie Hui* (Impurity-Dissolving) Lords\n- Three Clerks of the Southern Vermilion Emperor, Fire Office, *Jie Hui* Lords\n- Seven Clerks of the Western White Emperor, Metal Office, *Jie Hui* Lords\n- Five Clerks of the Northern Black Emperor, Water Office, *Jie Hui* Lords\n- Twelve Clerks of the Central Yellow Emperor, Earth Office, *Jie Hui* Lords\n- One hundred twenty *Jie Hui* Lords of Heaven and Earth\n- One hundred twenty *Jie Hui* Jade Maidens\n- One hundred twenty *Jiang* (Commander) Officers and Soldiers of the Nine Phoenixes for Breaking Impurities\n\n**Impurities Dissolved**\nAzure impurities of the East, vermilion impurities of the South, yellow impurities of the Center, white impurities of the West, black impurities of the North—impurities of the Five Directions and Five Colors. Impurities of Heaven, impurities of Earth, impurities of humans, impurities of ghosts, impurities of oxen, horses, and the six livestock. From turbid, repent to clarity; from death, hinder not life. From this day forth, dissolve all impurities, that I may attain long life.\n\n**Guarantors**\n**Supervisors of Ordination**",
      "overlap_context": "ongevity) Envoys, *Tian Ling* Officials\n- Seven Clerks of the Western Dipper, *Ji Ming* (Name-Recording) Lords, *Tian Ling* Officials\n- Two *Bian Que* Supreme Physicians, *Tian Ling* Officials\n- Five Clerks of the Northern Dipper, *Luo Si* (Death-Registering) Lords, *Tian Ling* Officials\n- Two Clerks of the *Chu Qi* (Qi-Removing) Register, *Tian Ling* Officials\n- Twelve Clerks of the Central Dipper, *Da Kui* (Great Chief) Lords, *Tian Ling* Officials\n\n**Guarantors**\n**Supervisors of Ordination**",
      "start_char": 4147,
      "end_char": 4479,
      "start_sentence": 204,
      "end_sentence": 217,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.93552303314209,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一盟威法箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "度师 太上三五解妨害宝符妙箓 太玄中一金阙宝符真格妙箓，高皇玉帝於紫微宫请西王母内篇之奥，有济拔之科，随世下化，救度生灵，解除妨害生属，或犯三刑四杀，孤辰寡宿，天杀地杀，天年岁星，元辰六害，儿子父母死绝入墓中，生致得相妨，今请受解除大妨害箓，保身护命，延年益寿，和合年命，所克悉乞消散，和睦六亲，慈育九眷，父母兄弟宗族，基系受之於身，永保长生，一如太上老君律令。 上仙都直使功曹和神吏五人， 上仙都无上功曹合神吏十五人，",
      "translated_text": "**Ordination Masters**\n*Tai Shang San Wu* Precious Talismanic Register for Dissolving Obstructions, *Tai Xuan Zhong Yi* Golden Gate Precious Talismanic Register of the True Standard—these were the profound inner teachings of the Queen Mother of the West, bestowed by the August Jade Emperor in the Purple Tenuity Palace. They contain the salvific ordinances, descending to transform the world in each age, to deliver and liberate living beings, to dissolve and dispel obstructions to life and destiny.\n\nFor those afflicted by the Three Punishments or Four Executions, solitary hours or widowed constellations, celestial slayings or terrestrial slayings, the yearly star of Heaven’s span, the Primordial Hour’s Six Harms; for those whose children, parents, or kin have perished utterly, entering the tomb’s embrace, and who thereby suffer mutual obstruction—today, they receive the Great Register for Dissolving Obstructions, to guard the body and protect life, to extend years and augment longevity, to harmonize fate and destiny. All that is fated to be overcome shall be wholly dispersed; harmony shall prevail among the six relations, and compassion nurture the nine kinships. Parents, siblings, and the ancestral lineage shall receive this transmission in the body, forever preserving long life, in perfect accordance with the statutes and ordinances of the Most High Lord Lao.\n\n**Celestial Bureaus and Attending Officers**\nFive Divine Officers of Merit of the Upper Immortal Capital’s Direct Envoys\nFifteen Divine Officers of Merit of the Supreme Merit Bureau of the Upper Immortal Capital",
      "overlap_context": ", vermilion impurities of the South, yellow impurities of the Center, white impurities of the West, black impurities of the North—impurities of the Five Directions and Five Colors. Impurities of Heaven, impurities of Earth, impurities of humans, impurities of ghosts, impurities of oxen, horses, and the six livestock. From turbid, repent to clarity; from death, hinder not life. From this day forth, dissolve all impurities, that I may attain long life.\n\n**Guarantors**\n**Supervisors of Ordination**",
      "start_char": 4479,
      "end_char": 4700,
      "start_sentence": 218,
      "end_sentence": 222,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.090697288513184,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一盟威法箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 12,
      "original_text": "上仙都正一功曹和神吏五人， 上仙都虚无功曹合神吏十五人， 上仙都五帝功曹和神吏五人， 上仙都无为功曹合神吏十五人， 上仙都三天功曹和神吏五人， 上仙都赤天解妨合神吏十五人， 上仙都左官使者和神吏五人， 上仙都赤天解害合神吏十五人， 上仙都右官使者和神吏五人， 上仙都阴阳解元辰六害合神吏十五人， 上仙都阴阳使者和神吏五人， 上仙都阴阳解孤辰寡宿三刑四杀合神吏十五人。 维某年某月某日，某州县乡里，某宫观受某法箓姓某，素被新出老君太上高皇帝王神气在身，不能自分别，今赍信诣三洞法师臣某，请受太上解妨害宝符妙箓，释除所犯六害孤辰烟火绝灭，冲破（纟＋勾）绞，五鬼八难，三刑四杀，父母不宜，男女所克，并乞消除保宜福禄，更相悦喻，不得诽笑真人，一如太上老君律令。 保举 监度",
      "translated_text": "The Five Divine Officers of Merit of the Orthodox Unity Bureau of the Upper Immortal Capital,\nFifteen Divine Officers of Merit of the Void-and-Nothingness Bureau of the Upper Immortal Capital,\nThe Five Divine Officers of Merit of the Five Thearchs Bureau of the Upper Immortal Capital,\nFifteen Divine Officers of Merit of the Non-Action Bureau of the Upper Immortal Capital,\nThe Five Divine Officers of Merit of the Three Heavens Bureau of the Upper Immortal Capital,\nFifteen Divine Officers of Merit of the Red Heaven Bureau for Dissolving Obstructions of the Upper Immortal Capital,\nThe Five Divine Officers of Merit of the Left Bureau Envoys of the Upper Immortal Capital,\nFifteen Divine Officers of Merit of the Red Heaven Bureau for Dissolving Calamities of the Upper Immortal Capital,\nThe Five Divine Officers of Merit of the Right Bureau Envoys of the Upper Immortal Capital,\nFifteen Divine Officers of Merit of the Yin-Yang Bureau for Dissolving the Six Harms of the Original Destiny of the Upper Immortal Capital,\nThe Five Divine Officers of Merit of the Yin-Yang Envoys of the Upper Immortal Capital,\nFifteen Divine Officers of Merit of the Yin-Yang Bureau for Dissolving Solitary Conjunctions, Widowed Constellations, Three Punishments, and Four Executions of the Upper Immortal Capital.\n\nOn the day of [day] in the month of [month] of the year [year], at [prefecture], [county], [township], [village], in the [Palace/Abbey] of [name], the disciple of the register [name], bearing the divine qi of the Most High Lord Lao, the Supreme August Emperor Wang, newly infused within the body, yet unable to distinguish it for oneself, now presents offerings of sincerity to the Three Caverns Master, your servant [name], to receive the Most High’s Precious Talisman and Wondrous Register for Dissolving Obstructions, to release and dispel all transgressions of the six harms, solitary conjunctions, extinguished hearth-fires, entangling nooses, the five ghosts, eight difficulties, three punishments, four executions, and all that is inauspicious for parents, or that which men and women are fated to overcome. May all be wholly dissolved and auspicious protection granted, that fortune and emolument be secured, mutual understanding and joy prevail, and no slander or mockery of the Perfected be permitted, in perfect accordance with the statutes and ordinances of the Most High Lord Lao.\n\n**Endorsement**\n**Supervision**",
      "overlap_context": "mony shall prevail among the six relations, and compassion nurture the nine kinships. Parents, siblings, and the ancestral lineage shall receive this transmission in the body, forever preserving long life, in perfect accordance with the statutes and ordinances of the Most High Lord Lao.\n\n**Celestial Bureaus and Attending Officers**\nFive Divine Officers of Merit of the Upper Immortal Capital’s Direct Envoys\nFifteen Divine Officers of Merit of the Supreme Merit Bureau of the Upper Immortal Capital",
      "start_char": 4700,
      "end_char": 5063,
      "start_sentence": 223,
      "end_sentence": 237,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 10.753737926483154,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一盟威法箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 13,
      "original_text": "度师 太上老君授徐甲延生保命箓 无上玄元始气玉皇高尊上帝真君生算定寿，延年久视，保身护命，要圣灵文也 ，且玄科秘隐非凡所行，昔函谷关令尹喜先生，亲承旨授传流下世，宣於后贤，其有真仙之子，骨命合道者，可得奉佩此文，昔元狩元年，有东陵虚皇之子东方朔，亲诣西王母清赍千日，祈请此法持佩在身，得获真道徐甲授之，增算千年，张道陵佩之，白日升天，赵升修行便证，正真子能依科奉受修持，即得延年久视，长生增算益年，保身护命，辟除千灾，消灭万害，护法玉童玉女，天官君将吏兵，天丁力士定算，直符益算将军等，各千万众，随逐佩法者，身永不相离，子能奉持长生久视，生死获道，斯法秘妙，非真勿传，传授不依科限，殃及七祖，逮兆生身，不得怨师咎道，一如太上老君律令。 老君曰：玄元始气，生算定寿，延年久视保身护命，长生升仙变化，宝符摄录，生算将军，定算吏兵，益算仙童，保算玉女等，各千万众，随逐佩箓者，身行住坐卧，出入远近，缠身绕骨，防护营卫，永不相离，子能奉受，持佩修行，可以登仙。 · 太清子日子时，生算延年久视，保身护命，定童王女各九千万人。 太清丑日丑时，生算延年久视，保身护命，定寿仙官各九千万人。 太清寅日寅时，生算延年久视，保身护命，定体地官九千万人。 太清卯日卯时，生算延年久视，保身护命，除死水官九千万人。 太清辰日辰时，生算延年久视，保身护命，东斗注算君九千万人。 太清巳日巳时，生算延年久视，保身护命，南斗上生君九千万人。 太清午日午时，生算延年久视，保身护命，西斗记名君九千万人。 太清未日未时，生算延年久视，保身护命，北斗落死君九千万人。 太清申日申时，生算延年久视，保身护命，中斗大魁君九千万人。 太清酉日酉时，生筹延年久视，保身护命，三台长生君九千万人。 太清戌日戌时，生算延年久视，保身护命，二十八宿消灾君九千万人。 太清亥日亥时，生筹延年久视，保身护命，三十五星除罪君九千万人。 太清玄元无上三天无极大道太上老君门下，臣胎生凡短，耳目不明，昔以云云。 维某年某月某日，某州县乡里，某宫观受某法箓姓某，素被新出老君太上高皇帝王神气在身，不能自分别，今赍信诣三洞法师臣某，请受老君生算定寿，久视保身护命，永为身宝，仙圣感应，奉佩之后，不得轻慢经文，诽笑道士，妬贤嫉能，欺凌寡弱，抑夺不平，行之不犯，十年可传。 保举 监度",
      "translated_text": "**Initiation Master**\nThe Most High Lord Lao bestows upon Xu Jia the *Register for Extending Life and Preserving Destiny*. This is the sacred writ of the Supreme Primordial Qi of the Jade Sovereign, the August Highest Lord, the True Lord who determines lifespan, extends years, and grants enduring vision, safeguarding the body and protecting life. It is a numinous text of profound mystery, not to be handled by the common. Formerly, Master Yin Xi, Magistrate of the Hangu Pass, personally received its transmission and bequeathed it to later worthies. Only the true disciples of immortals—those whose bones and destiny align with the Dao—may reverently bear this writ.\n\nIn the first year of the Yuanshou era, Dongfang Shuo, the transcendent son of the Eastern August Void Sovereign, journeyed to the Queen Mother of the West with a thousand days’ pure offering to beseech this method. Upon wearing it, he attained the true Dao, as Xu Jia had before him, gaining a thousand additional years. Zhang Daoling wore it and ascended to heaven in broad daylight. Zhao Sheng, through cultivation, swiftly realized perfection. Should the disciple of the Correct and True be able to follow its statutes and receive it with devotion, they too shall extend their years, prolong their vision, lengthen their lifespan, and augment their allotted time. The body shall be safeguarded, life preserved, a thousand calamities averted, and ten thousand harms dissolved. The jade lads and jade maidens of the Dharma, the celestial officials, generals, and clerks, the Heavenly Ding warriors, the lifespan-determining forces, the talisman-empowered Generals of Extended Lifespan, and their myriad hosts—each in their millions—shall ever attend the bearer, never parting from their person.\n\nShould one uphold and cultivate this method, they shall attain long life, enduring vision, transcendence of life and death, and realization of the Dao. This method is secret and wondrous; it must not be transmitted to the unworthy. Should transmission violate its statutes, misfortune shall extend to the seven ancestors and afflict the recipient’s own body. Let none blame the master or fault the Dao.\n\n**By the Statutes and Ordinances of the Most High Lord Lao:**\nThe Primordial Qi of the Mysterious Origin determines lifespan, extends years, grants enduring vision, safeguards the body, and protects life. Through transformation, one ascends as an immortal. The precious talisman and register summon the Generals of Allotted Lifespan, the clerks and warriors of fixed destiny, the transcendent lads of extended years, and the jade maidens of preserved lifespan—each in their millions—to encircle the bearer’s bones, shield their person, and guard their movements, whether walking, standing, sitting, or reclining, near or far, never parting. Should one receive, wear, and cultivate it, they may ascend as an immortal.\n\n**On the Zi day at the Zi hour (11 PM–1 AM),** the *Register for Extending Life and Preserving Destiny* summons the Determining Lads and Jade Maidens, each ninety million strong.\n**On the Chou day at the Chou hour (1–3 AM),** it summons the Lifespan-Fixing Transcendent Officials, each ninety million strong.\n**On the Yin day at the Yin hour (3–5 AM),** it summons the Earth Officials of Fixed Form, each ninety million strong.\n**On the Mao day at the Mao hour (5–7 AM),** it summons the Water Officials of Death’s Dissolution, each ninety million strong.\n**On the Chen day at the Chen hour (7–9 AM),** it summons the Eastern Dipper Lords of Recorded Lifespan, each ninety million strong.\n**On the Si day at the Si hour (9–11 AM),** it summons the Southern Dipper Lords of Ascendant Life, each ninety million strong.\n**On the Wu day at the Wu hour (11 AM–1 PM),** it summons the Western Dipper Lords of Recorded Names, each ninety million strong.\n**On the Wei day at the Wei hour (1–3 PM),** it summons the Northern Dipper Lords of Fallen Death, each ninety million strong.\n**On the Shen day at the Shen hour (3–5 PM),** it summons the Central Dipper Lords of the Great Culmen, each ninety million strong.\n**On the You day at the You hour (5–7 PM),** it summons the Three Terraces Lords of Long Life, each ninety million strong.\n**On the Xu day at the Xu hour (7–9 PM),** it summons the Twenty-Eight Constellations Lords of Disaster’s Dissolution, each ninety million strong.\n**On the Hai day at the Hai hour (9–11 PM),** it summons the Thirty-Five Stars Lords of Sin’s Eradication, each ninety million strong.\n\n**By the Supreme Primordial, the Most High, the Three Heavens, the Boundless Great Dao, the Most High Lord Lao:**\nYour servant, though born of mortal flesh with dull senses and clouded perception, now presents offerings of sincerity to the Three Caverns Master, your servant [name], to receive the *Register of Lord Lao for Determining Lifespan, Extending Years, and Preserving Destiny*, to be cherished as a lifelong treasure. May the immortals and sages respond in kind. After receiving and wearing it, one must not treat the scriptures with disdain, mock Daoist priests, envy the worthy, resent the capable, bully the weak, or seize what is not rightfully theirs. Should one uphold it without transgression, it may be transmitted after ten years.\n\n**Endorsement**\n**Supervision**",
      "overlap_context": "es, entangling nooses, the five ghosts, eight difficulties, three punishments, four executions, and all that is inauspicious for parents, or that which men and women are fated to overcome. May all be wholly dissolved and auspicious protection granted, that fortune and emolument be secured, mutual understanding and joy prevail, and no slander or mockery of the Perfected be permitted, in perfect accordance with the statutes and ordinances of the Most High Lord Lao.\n\n**Endorsement**\n**Supervision**",
      "start_char": 5063,
      "end_char": 6062,
      "start_sentence": 238,
      "end_sentence": 259,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 26.75193762779236,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一盟威法箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 14,
      "original_text": "度师 太上招财镇宝妙箓 老君曰：紫微玉皇道君招财镇宝者，盖东海青童君之秘诀也 ，灵文隐秘，凡无所观，昔黄帝於太白山亲承西王母玄女奉受，乃获富贵而登仙，有玉釜仙人传流於世，自无宿福不可闻见斯文，宝箓招金召银，钱帛日增，五谷充盈，奴婢保宜，田蚕倍收，商估有利，买卖倍还，财去复来，保护家门，贼寇无伤，凶徒恶倡，慈心相向，奉受修行，家门富贵，男忠女贞，年长命远，福荫后偷，官禄日增，仕君得意，人所爱敬，出入远近，四路开通，官私敬仰，万恶不仟，龙蛇虎兽，永自潜伏，五瘟疫鬼，远进千里，斯箓宝秘，非真勿传，子能持之，深宜慎焉 。 老君曰：紫微中合招财神符，常以丙子丁丑壬寅癸卯戊申戊午满成收开，日朱书带之，招五方钱财，令人富贵，兴估万倍，买卖返还，符神九千九百九十九人侍卫人身。 老君曰：紫微中合镇宝神符，用前六富日朱书带之，男左女右，所求如意，万愿从心，钱财充足，六畜蕃息，保宜田蚕，官私敬仰，万厄不临，符神吏兵九千九百人侍卫弟子之身。 老君曰：紫微中合兴佑神符，依以六富日书而带之，兴佑觅利，所求皆得，万愿从心，常能清诤，带此神符万病不侵，钱财倍益，符神吏兵三千九百九十人保护受者之身。 太清招天库藏金银钱帛吏兵直符使者百万人， 太清招地库藏金银钱帛吏兵直符使者百万人， 太清招东方角姓金银钱帛吏兵直符使者百万人， 太清招南方征姓金银钱帛吏兵直符使者百万人， 太清招西方商姓金银钱帛吏兵直符使者百万人， 太清招北方羽姓金银钱帛吏兵直符使者百万人， 太清招中央宫姓金银钱帛吏兵直符使者百万人， 太清招九州百二十郡大富长者金银钱帛吏兵直符使者百万人。 维某年某月某日，某州县乡里，某宫观受某法箓姓某，素被新出老君太上高皇帝王神气在身，不能自分别，今赍信诣三洞法师臣某，请受太上老君招财镇宝妙箓，修行供养，以为身宝，受法之后，上不违天，下不负地，中不轻师，慢法欺孤贱寡憎老爱少，一旦违科，臧算九年，受之不犯，十年可传，一如太上老君盟科律令。 保举 监度",
      "translated_text": "**Initiation Master: The Supreme Wondrous Register for Summoning Wealth and Securing Treasure**\n\nLord Lao declares: The *Register of the Purple Tenuity Jade Emperor Dao Lord for Summoning Wealth and Securing Treasure* is the esoteric script of the Azure Youth Lord of the Eastern Sea. Its numinous writ was once hidden, unseen by mortals, until the Yellow Emperor, on Mount Tai Bai, personally received it from the Queen Mother of the West and the Mysterious Woman. Thereby he attained wealth and nobility and ascended as an immortal. The Jade Cauldron Immortal transmitted it to the world, yet those without predestined fortune may neither hear nor behold this text. This precious register summons gold and calls forth silver, multiplying coin and silk daily. The five grains overflow, servants and maidservants thrive, fields and silkworms yield double harvests, merchants profit, and trade returns manifold. Wealth departs but returns again, safeguarding the household. Bandits and raiders inflict no harm; wicked villains and evil schemers turn toward compassion. Those who receive and cultivate it shall see their household prosper, their sons loyal and daughters chaste, their years prolonged and lives extended, their blessings shading descendants. Official emoluments increase daily, service to the sovereign brings fulfillment, and all hold them in love and reverence. Journeys near and far meet no obstruction; public and private affairs command respect. Ten thousand evils do not approach. Dragons, snakes, tigers, and beasts retreat and hide. The five pestilences and plague demons flee a thousand *li* away. This register is a treasure of secrecy—do not transmit it to the unworthy. If you can uphold it, guard it well.\n\nLord Lao declares: The *Purple Tenuity Central Harmony Wealth-Summoning Spirit Talisman*—regularly inscribed in cinnabar on the days of *bingzi*, *dingsi*, *renyin*, *guimao*, *wushen*, and *wuwu* (when the moon is full, waning, or waxing)—when worn, summons wealth from the five directions, bestowing riches and nobility. Trade flourishes a myriadfold, and commerce yields manifold returns. The talisman’s spirit hosts—nine thousand nine hundred and ninety-nine in number—attend and guard the bearer.\n\nLord Lao declares: The *Purple Tenuity Central Harmony Treasure-Securing Spirit Talisman*, inscribed in cinnabar on the aforementioned six prosperous days and worn—men on the left, women on the right—grants all desires as the heart wishes. Wealth and coin abound, livestock multiply, fields and silkworms thrive, and both public and private affairs command respect. Ten thousand calamities do not befall. The talisman’s spirit officers and soldiers—nine thousand nine hundred in number—attend and guard the disciple’s body.\n\nLord Lao declares: The *Purple Tenuity Central Harmony Prosperity-Bestowing Spirit Talisman*, inscribed on the six prosperous days and worn, brings prosperity and seeks profit, fulfilling all desires as the heart wishes. Ever pure and upright, the bearer of this spirit talisman remains untouched by the ten thousand illnesses, and wealth multiplies manifold. The talisman’s spirit officers and soldiers—three thousand nine hundred and ninety in number—protect the recipient’s body.\n\n**The Supreme Clarity summons:**\nThe celestial treasury’s gold, silver, coin, and silk—its spirit officers, direct talisman envoys, and soldiers: one million.\nThe terrestrial treasury’s gold, silver, coin, and silk—its spirit officers, direct talisman envoys, and soldiers: one million.\nThe eastern treasury of the *Jiao* surname’s gold, silver, coin, and silk—its spirit officers, direct talisman envoys, and soldiers: one million.\nThe southern treasury of the *Zheng* surname’s gold, silver, coin, and silk—its spirit officers, direct talisman envoys, and soldiers: one million.\nThe western treasury of the *Shang* surname’s gold, silver, coin, and silk—its spirit officers, direct talisman envoys, and soldiers: one million.\nThe northern treasury of the *Yu* surname’s gold, silver, coin, and silk—its spirit officers, direct talisman envoys, and soldiers: one million.\nThe central treasury of the *Gong* surname’s gold, silver, coin, and silk—its spirit officers, direct talisman envoys, and soldiers: one million.\nThe great wealthy elders of the one hundred twenty commanderies of the nine provinces—gold, silver, coin, and silk—its spirit officers, direct talisman envoys, and soldiers: one million.\n\nOn the [day] of [month] in the [year], in the [prefecture], [county], [village], and [hamlet], at the [abbey/temple], the disciple [name], bearing the newly manifested divine qi of Lord Lao, the Supreme High Emperor King, unable to discern for themselves, now presents offerings of sincerity to the Three Caverns Master, your servant [name], to receive the *Supreme Lord Lao’s Wondrous Register for Summoning Wealth and Securing Treasure*, to cultivate and venerate as a lifelong treasure. After receiving the register, one must not defy Heaven above, betray Earth below, or slight one’s master in between. One must not disdain the Dharma, bully the orphaned or weak, despise the elderly, or favor the young. Should one violate these precepts even once, their lifespan shall be reduced by nine years. If upheld without transgression, it may be transmitted after ten years. All is in accordance with the covenant and statutes of the Supreme Lord Lao.\n\n**Endorsement**\n**Supervision**",
      "overlap_context": " to receive the *Register of Lord Lao for Determining Lifespan, Extending Years, and Preserving Destiny*, to be cherished as a lifelong treasure. May the immortals and sages respond in kind. After receiving and wearing it, one must not treat the scriptures with disdain, mock Daoist priests, envy the worthy, resent the capable, bully the weak, or seize what is not rightfully theirs. Should one uphold it without transgression, it may be transmitted after ten years.\n\n**Endorsement**\n**Supervision**",
      "start_char": 6062,
      "end_char": 6915,
      "start_sentence": 260,
      "end_sentence": 278,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 24.91909623146057,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一盟威法箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 15,
      "original_text": "度师 太上九一河图宝箓 维某年某月某日，某州县乡里，某宫观受某法箓姓某，素被新出老君太上高皇帝王神气在身，不能自分别，今赍信诣三洞法师臣某，请受太上九一河图元纪九皇隐讳长生不死之诀，九府灵官下卫弟子之身，却邪纳正，同会玉帝之前，一如太上老君律令。 第一阳明星玉皇九辰君，天枢星阳明之魂也，对西门上真皇夫人。 第二阴精星玉皇主华辰君，天旋星阴精之魂也，西北门上仙皇夫人。 第三真人星玉皇主仙辰君，天机星真人之魂也，对东门明皇夫人。 第四玄冥星玉皇主上飞盖君，天权星玄冥之魂也，对南门华皇夫人。 第五丹元君玉皇金魅七辰君，天断星丹元星灵也，对北门中皇夫人。 第六北极星玉皇北辰华君，北极星北极魂灵也，北极门元皇夫人。 第七天关星玉皇悲灵北盖君，摇光星天关魂，大明两门下北门虚皇夫人。 第八左辅星玉皇帝尊九辰君，洞明星辅星魂，精阳明西门帝皇夫人。 第九右弼星玉皇帝真元辰君，隐元星弼星魂精也，东南门上皇夫人。 九官取宜装 阳明大尉府九百二十品，九亿万诸灵官，飞龙骑吏绣衣使者，玉童玉女各九亿万人。 阴精上宰府五百五十品，九亿万诸灵官飞龙骑吏绣衣使者，玉童玉女各九亿万人。 真人司空府七百七十品，九亿万诸灵官飞龙骑吏绣衣使者，玉童玉女各九亿万人。 玄冥游击府八百八十品，九亿万诸灵官飞龙骑吏绣衣使者，玉童玉女各九亿万人。 丹元斗君府七百二十品，九亿万诸灵官飞龙骑吏绣衣使者，玉童玉女各九亿万人。 北极太常府七百七十品，九亿万诸灵官飞龙骑吏绣衣使者，玉童玉女各九亿万人。 天关上帝府七百七十品，九亿万诸灵官飞龙骑吏绣衣使者，玉童玉女各九亿万人。 辅天尊玉帝府九百二十品，九亿万诸灵官飞龙骑吏绣衣使者，玉童玉女各九亿万人。 弼大帝真府九百九十品，九亿万诸灵官飞龙骑吏绣衣使者，玉童玉女各九亿万人。 保举 监度",
      "translated_text": "**Initiation Master**\n*The Precious Register of the Nine-One River Chart*\n\nOn the [day] of [month] in the [year], [name], of [prefecture, county, village], having received the [name] Register at [name] Abbey, bearing the newly manifested divine qi of the Supreme High Emperor King Lord Lao within, yet unable to discern its mysteries, now presents offerings of sincerity to the Three Caverns Master, your servant [name], to receive the *Supreme Lord’s Nine-One River Chart: Primal Record of the Nine Sovereigns’ Hidden Names and the Formula for Eternal Life*. May the Nine Palaces’ numinous officials descend to guard the disciple’s body, repelling evil and embracing rectitude, to assemble together before the Jade Emperor. All is in accordance with the statutes of the Supreme Lord Lao.\n\n**First:** The Yang Brightness Star, Jade Emperor of the Nine Celestial Lords, the hun-soul of the Celestial Pivot Star, paired with the Perfected August Consort of the Western Gate.\n**Second:** The Yin Essence Star, Jade Emperor of the Flowery Celestial Lord, the hun-soul of the Celestial Rotation Star, paired with the Transcendent August Consort of the Northwest Gate.\n**Third:** The Perfected Person Star, Jade Emperor of the Transcendent Celestial Lord, the hun-soul of the Celestial Mechanism Star, paired with the Radiant August Consort of the Eastern Gate.\n**Fourth:** The Profound Darkness Star, Jade Emperor of the Soaring Canopy Lord, the hun-soul of the Celestial Balance Star, paired with the Flourishing August Consort of the Southern Gate.\n**Fifth:** The Cinnabar Prime Lord, Jade Emperor of the Golden Spirit Seven Celestial Lords, the numinous essence of the Celestial Judgment Star, paired with the Central August Consort of the Northern Gate.\n**Sixth:** The Northern Culmen Star, Jade Emperor of the Northern Culmen Flowery Lord, the hun-soul of the Northern Culmen Star, paired with the Primal August Consort of the Northern Culmen Gate.\n**Seventh:** The Celestial Pass Star, Jade Emperor of the Compassionate Numinous Northern Canopy Lord, the hun-soul of the Twinkling Brilliance Star, paired with the Void August Consort beneath the Two Gates of Great Brilliance at the Northern Gate.\n**Eighth:** The Left Auxiliary Star, Jade Emperor of the August Nine Celestial Lords, the hun-soul of the Luminous Cavern Star, paired with the Imperial August Consort of the Essence Yang Brightness at the Western Gate.\n**Ninth:** The Right Assistant Star, Jade Emperor of the August Primal Celestial Lord, the essence-soul of the Hidden Prime Star, paired with the August Consort of the Southeastern Gate.\n\n**Nine Palaces’ Appropriate Arrangements**\n**Yang Brightness Grand Commandery:** Nine hundred twenty ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robe messengers, jade lads and jade maidens, each numbering nine hundred million myriad.\n**Yin Essence Supreme Ministry:** Five hundred fifty ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robe messengers, jade lads and jade maidens, each numbering nine hundred million myriad.\n**Perfected Person Minister of Works:** Seven hundred seventy ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robe messengers, jade lads and jade maidens, each numbering nine hundred million myriad.\n**Profound Darkness Mobile Strike Commandery:** Eight hundred eighty ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robe messengers, jade lads and jade maidens, each numbering nine hundred million myriad.\n**Cinnabar Prime Dipper Lord’s Palace:** Seven hundred twenty ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robe messengers, jade lads and jade maidens, each numbering nine hundred million myriad.\n**Northern Culmen Grand Constancy Palace:** Seven hundred seventy ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robe messengers, jade lads and jade maidens, each numbering nine hundred million myriad.\n**Celestial Pass Supreme Emperor’s Palace:** Seven hundred seventy ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robe messengers, jade lads and jade maidens, each numbering nine hundred million myriad.\n**Auxiliary Heavenly August Jade Emperor’s Palace:** Nine hundred twenty ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robe messengers, jade lads and jade maidens, each numbering nine hundred million myriad.\n**Assistant Great Emperor’s Perfected Palace:** Nine hundred ninety ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robe messengers, jade lads and jade maidens, each numbering nine hundred million myriad.\n\n**Endorsement**\n**Supervision**",
      "overlap_context": "easure. After receiving the register, one must not defy Heaven above, betray Earth below, or slight one’s master in between. One must not disdain the Dharma, bully the orphaned or weak, despise the elderly, or favor the young. Should one violate these precepts even once, their lifespan shall be reduced by nine years. If upheld without transgression, it may be transmitted after ten years. All is in accordance with the covenant and statutes of the Supreme Lord Lao.\n\n**Endorsement**\n**Supervision**",
      "start_char": 6915,
      "end_char": 7712,
      "start_sentence": 279,
      "end_sentence": 302,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.738722562789917,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一盟威法箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 16,
      "original_text": "度师 太上百五十将军男仙灵箓 维某年某月某日，某州县乡里，某宫观受某法箓姓某，素被新出老君太上高皇帝王神气在身，不能自分别，今赍信诣三洞法师臣某，请受太上百五十将军男仙灵箓，自实悉言，被君召即日听署之后，要当扶助天师医治百姓，不得饮酒食肉，轻淫盗取，鬲戾妬。 行不正之事，自作一法，诽笑师主，此魔鬼所嫉，但当慈仁育孝，敬老爱少，父母兄弟更相承奉，常以五腊吉日於堂上祀家亲太祖，二月八月同日祠社灶，其余不得私祀他鬼神，一旦违犯，坐见中伤，不得怨道咎师，一如太上老君律令。 上仙都直使功曹十五人， 上仙都正一功曹十五人，",
      "translated_text": "**Initiation Master**\n**One Hundred Fifty Generals of the Male Immortals’ Numinous Register:**\nIn the such-and-such year, such-and-such month, such-and-such day, [disciple] of such-and-such prefecture, county, village, and hamlet, having received the such-and-such Dharma Register at such-and-such abbey or oratory, bearing the surname so-and-so, has long been infused with the divine qi of the Most High Lord Lao, the August High Emperor Wang. Unable to distinguish this for himself, he now presents his credentials to the Three Caverns’ Dharma Master, your servant so-and-so, to request the *Numinous Register of the One Hundred Fifty Generals of the Male Immortals*. He truthfully declares in full: once summoned by the Lord and appointed from this day forth, he must assist the Celestial Master in healing the people. He shall not drink wine, eat meat, indulge in licentiousness, steal, harbor resentment, or bear malice. He shall not engage in improper conduct, establish his own methods, or mock his master. Such are the deeds that demons and ghosts abhor. Instead, he shall cultivate kindness and nurture filial piety, respect the elderly and cherish the young, and ensure mutual support among parents and siblings. On the five auspicious days of the year and the five seasonal festivals, he shall worship his ancestral kin and the Great Ancestor in the hall. On the same days of the second and eighth months, he shall offer sacrifices to the earth gods and the hearth. He shall not privately worship other spirits or ghosts. Should he violate these precepts even once, he will suffer immediate harm, bearing no grudge against the Dao or faulting his master. All is in accordance with the statutes and ordinances of the Most High Lord Lao.\n\n**Direct Envoys of the Upper Immortal Capital:** Fifteen Merit Officers.\n**Orthodox Unity Merit Officers of the Upper Immortal Capital:** Fifteen.",
      "overlap_context": "ade Emperor’s Palace:** Nine hundred twenty ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robe messengers, jade lads and jade maidens, each numbering nine hundred million myriad.\n**Assistant Great Emperor’s Perfected Palace:** Nine hundred ninety ranks, nine hundred million myriad numinous officials, flying dragon riders, embroidered-robe messengers, jade lads and jade maidens, each numbering nine hundred million myriad.\n\n**Endorsement**\n**Supervision**",
      "start_char": 7712,
      "end_char": 7981,
      "start_sentence": 303,
      "end_sentence": 308,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 9.173187971115112,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一盟威法箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 17,
      "original_text": "上仙都治病功曹十五人， 上仙都左官使者十五人， 上仙都右官使者十五人， 上仙都阴神决吏十五人， 上仙都阳神决吏十五人， 上仙都阴官太医吏十五人， 上仙都阳官太医吏十五人， 上仙都阴官功曹十五人， 上仙都阳官功曹十五人， 赤天历旗刚风大将军五人， 赤天历旗刚风左将军五人， 赤天历旗刚风右将军五人， 赤天历旗中官刚风大将军五人， 赤天历旗中官刚风左将军五人， 赤天历旗中官刚风右将军五人， 赤天历旗中官大将军五人， 赤天历旗左中官将军五人， 赤天历旗右中官将军五人， 赤天历旗刚风官大将军五人， 赤天历旗刚风左官将军五人， 赤天历旗刚风右官将军五人， 赤天历旗刚风骑大将军五人， 赤天历旗刚风左骑将军五人， 赤天历旗刚风右骑将军五人， 上仙都郎吏虎贲千二百人， 上仙都察奸钩骑千二百人， 上仙都三官仆射千二百人， 上仙都天丁力士千二百人， 上仙都天驺甲卒千二百人， 上仙都收气食气吏六十人， 上仙都收神食神吏六十人， 上仙都收鬼食鬼吏六十人， 上仙都收邪食邪吏六十人， 上仙都收毒食毒吏六十人， 上仙都科车赤符吏六十人， 上仙都刚风骑置吏六十人， 上仙都驿马上章吏六十人。 上灵官直使功曹十五人， 上灵官正一功曹十五人， 上灵官治病功曹十五人， 上灵官左官使者十五人， 上灵官右官使者十五人， 上灵官阴神决吏十五人， 上灵官阳神决吏十五人， 上灵官阴官功曹十五人， 上灵官阳官功曹十五人， 上灵官阴官太医吏十五人， 上灵官阳官太医吏十五人， 上灵官驿骑大将军五人， 上灵官左驿骑将军五人， 上灵官右驿骑将军五人， 上灵官都驿骑大将军五人， 上灵官左都驿骑将军五人， 上灵官右都驿骑将军五人， 上灵官都官大将军五人， 上灵官左都官将军五人， 上灵官右都官将军五人， 上灵官都督骑大将军五人， 上灵官都督左骑将军五人， 上灵官都督右骑将军五人， 上灵官中都骑大将军五人， 上灵官中都左骑将军五人， 上灵官中都右骑将军五人， 上灵官郎吏虎贲千二百人， 上灵官察奸钩骑千二百人， 上灵官三官仆射千二百人， 上灵官天驺甲卒千二百人， 上灵官天丁力士千二百人， 上灵官收气食气吏六十人， 上灵官收神食神吏六十人， 上灵官收鬼食鬼吏六十人， 上灵官收邪食邪吏六十人， 上灵官收毒食毒吏六十人， 上灵官科车赤符吏六十人， 上灵官刚风骑置吏六十人， 上灵官驿马上章吏六十人。 一者不杀当念众生， 二者不色淫犯非法，",
      "translated_text": "**Healing Merit Officers of the Upper Immortal Capital:** Fifteen.\n**Left Envoys of the Upper Immortal Capital:** Fifteen.\n**Right Envoys of the Upper Immortal Capital:** Fifteen.\n**Yin Spirit Judgment Clerks of the Upper Immortal Capital:** Fifteen.\n**Yang Spirit Judgment Clerks of the Upper Immortal Capital:** Fifteen.\n**Yin Palace Grand Physician Clerks of the Upper Immortal Capital:** Fifteen.\n**Yang Palace Grand Physician Clerks of the Upper Immortal Capital:** Fifteen.\n**Yin Palace Merit Officers of the Upper Immortal Capital:** Fifteen.\n**Yang Palace Merit Officers of the Upper Immortal Capital:** Fifteen.\n**Great Generals of the Crimson Heaven’s Banner of the Strong Wind:** Five.\n**Left Generals of the Crimson Heaven’s Banner of the Strong Wind:** Five.\n**Right Generals of the Crimson Heaven’s Banner of the Strong Wind:** Five.\n**Central Palace Great Generals of the Crimson Heaven’s Banner of the Strong Wind:** Five.\n**Left Generals of the Central Palace of the Crimson Heaven’s Banner of the Strong Wind:** Five.\n**Right Generals of the Central Palace of the Crimson Heaven’s Banner of the Strong Wind:** Five.\n**Great Generals of the Central Palace of the Crimson Heaven’s Banner:** Five.\n**Left Generals of the Central Palace of the Crimson Heaven’s Banner:** Five.\n**Right Generals of the Central Palace of the Crimson Heaven’s Banner:** Five.\n**Great Generals of the Strong Wind Bureau of the Crimson Heaven’s Banner:** Five.\n**Left Generals of the Strong Wind Bureau of the Crimson Heaven’s Banner:** Five.\n**Right Generals of the Strong Wind Bureau of the Crimson Heaven’s Banner:** Five.\n**Great Generals of the Strong Wind Cavalry of the Crimson Heaven’s Banner:** Five.\n**Left Generals of the Strong Wind Cavalry of the Crimson Heaven’s Banner:** Five.\n**Right Generals of the Strong Wind Cavalry of the Crimson Heaven’s Banner:** Five.\n**Tiger-Rushing Attendants of the Upper Immortal Capital:** One thousand two hundred.\n**Hook-Riding Inspectors of the Upper Immortal Capital:** One thousand two hundred.\n**Archers of the Three Offices of the Upper Immortal Capital:** One thousand two hundred.\n**Celestial Ding Warriors of the Upper Immortal Capital:** One thousand two hundred.\n**Celestial Courier Armored Soldiers of the Upper Immortal Capital:** One thousand two hundred.\n**Qi-Seizing Qi-Consuming Clerks of the Upper Immortal Capital:** Sixty.\n**Spirit-Seizing Spirit-Consuming Clerks of the Upper Immortal Capital:** Sixty.\n**Ghost-Seizing Ghost-Consuming Clerks of the Upper Immortal Capital:** Sixty.\n**Evil-Seizing Evil-Consuming Clerks of the Upper Immortal Capital:** Sixty.\n**Toxin-Seizing Toxin-Consuming Clerks of the Upper Immortal Capital:** Sixty.\n**Red Talisman Chariot Clerks of the Upper Immortal Capital:** Sixty.\n**Strong Wind Cavalry Post Clerks of the Upper Immortal Capital:** Sixty.\n**Post-Horse Memorial-Submitting Clerks of the Upper Immortal Capital:** Sixty.\n\n**Direct Envoys of the Upper Numinous Bureau:** Fifteen Merit Officers.\n**Orthodox Unity Merit Officers of the Upper Numinous Bureau:** Fifteen.\n**Healing Merit Officers of the Upper Numinous Bureau:** Fifteen.\n**Left Envoys of the Upper Numinous Bureau:** Fifteen.\n**Right Envoys of the Upper Numinous Bureau:** Fifteen.\n**Yin Spirit Judgment Clerks of the Upper Numinous Bureau:** Fifteen.\n**Yang Spirit Judgment Clerks of the Upper Numinous Bureau:** Fifteen.\n**Yin Palace Merit Officers of the Upper Numinous Bureau:** Fifteen.\n**Yang Palace Merit Officers of the Upper Numinous Bureau:** Fifteen.\n**Grand Physician Clerks of the Yin Palace of the Upper Numinous Bureau:** Fifteen.\n**Grand Physician Clerks of the Yang Palace of the Upper Numinous Bureau:** Fifteen.\n**Great Generals of the Post Cavalry of the Upper Numinous Bureau:** Five.\n**Left Generals of the Post Cavalry of the Upper Numinous Bureau:** Five.\n**Right Generals of the Post Cavalry of the Upper Numinous Bureau:** Five.\n**Great Generals of the Post Cavalry Bureau of the Upper Numinous Bureau:** Five.\n**Left Generals of the Post Cavalry Bureau of the Upper Numinous Bureau:** Five.\n**Right Generals of the Post Cavalry Bureau of the Upper Numinous Bureau:** Five.\n**Great Generals of the Upper Numinous Bureau:** Five.\n**Left Generals of the Upper Numinous Bureau:** Five.\n**Right Generals of the Upper Numinous Bureau:** Five.\n**Great Generals of the Supervisory Cavalry of the Upper Numinous Bureau:** Five.\n**Left Generals of the Supervisory Cavalry of the Upper Numinous Bureau:** Five.\n**Right Generals of the Supervisory Cavalry of the Upper Numinous Bureau:** Five.\n**Great Generals of the Central Supervisory Cavalry of the Upper Numinous Bureau:** Five.\n**Left Generals of the Central Supervisory Cavalry of the Upper Numinous Bureau:** Five.\n**Right Generals of the Central Supervisory Cavalry of the Upper Numinous Bureau:** Five.\n**Tiger-Rushing Attendants of the Upper Numinous Bureau:** One thousand two hundred.\n**Hook-Riding Inspectors of the Upper Numinous Bureau:** One thousand two hundred.\n**Archers of the Three Offices of the Upper Numinous Bureau:** One thousand two hundred.\n**Celestial Courier Armored Soldiers of the Upper Numinous Bureau:** One thousand two hundred.\n**Celestial Ding Warriors of the Upper Numinous Bureau:** One thousand two hundred.\n**Qi-Seizing Qi-Consuming Clerks of the Upper Numinous Bureau:** Sixty.\n**Spirit-Seizing Spirit-Consuming Clerks of the Upper Numinous Bureau:** Sixty.\n**Ghost-Seizing Ghost-Consuming Clerks of the Upper Numinous Bureau:** Sixty.\n**Evil-Seizing Evil-Consuming Clerks of the Upper Numinous Bureau:** Sixty.\n**Toxin-Seizing Toxin-Consuming Clerks of the Upper Numinous Bureau:** Sixty.\n**Red Talisman Chariot Clerks of the Upper Numinous Bureau:** Sixty.\n**Strong Wind Cavalry Post Clerks of the Upper Numinous Bureau:** Sixty.\n**Post-Horse Memorial-Submitting Clerks of the Upper Numinous Bureau:** Sixty.\n\nFirst: Refrain from killing; contemplate the lives of all beings.\nSecond: Refrain from lustful conduct or illicit relations.",
      "overlap_context": "ond and eighth months, he shall offer sacrifices to the earth gods and the hearth. He shall not privately worship other spirits or ghosts. Should he violate these precepts even once, he will suffer immediate harm, bearing no grudge against the Dao or faulting his master. All is in accordance with the statutes and ordinances of the Most High Lord Lao.\n\n**Direct Envoys of the Upper Immortal Capital:** Fifteen Merit Officers.\n**Orthodox Unity Merit Officers of the Upper Immortal Capital:** Fifteen.",
      "start_char": 7981,
      "end_char": 9135,
      "start_sentence": 309,
      "end_sentence": 386,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.131648302078247,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一盟威法箓.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 18,
      "original_text": "三者不盗取非义财， 四者不欺善恶反论， 五者不醉常思净行。 保举 监度 度师 太上正一盟威法箓竟",
      "translated_text": "Third: Refrain from theft; do not take wealth that is unjust.\nFourth: Refrain from deceit; do not reverse right and wrong in argument.\nFifth: Refrain from intoxication; always contemplate pure conduct.\n\n**End of the Register of the Supreme Orthodox Unity Alliance-Wei Rites, as attested by the Sponsor, the Supervising Ordainer, and the Ordination Master.**",
      "overlap_context": "**Evil-Seizing Evil-Consuming Clerks of the Upper Numinous Bureau:** Sixty.\n**Toxin-Seizing Toxin-Consuming Clerks of the Upper Numinous Bureau:** Sixty.\n**Red Talisman Chariot Clerks of the Upper Numinous Bureau:** Sixty.\n**Strong Wind Cavalry Post Clerks of the Upper Numinous Bureau:** Sixty.\n**Post-Horse Memorial-Submitting Clerks of the Upper Numinous Bureau:** Sixty.\n\nFirst: Refrain from killing; contemplate the lives of all beings.\nSecond: Refrain from lustful conduct or illicit relations.",
      "start_char": 9135,
      "end_char": 9198,
      "start_sentence": 387,
      "end_sentence": 393,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 2.105506658554077,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上正一盟威法箓.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}