{
  "source_id": "太上元阳上帝无始天尊说火车王灵官真经",
  "source_file": "chunked_daozang\\太上元阳上帝无始天尊说火车王灵官真经.json",
  "total_chunks": 3,
  "total_original_chars": 3819,
  "total_translated_chars": 22921,
  "total_translation_time": 117.1142189502716,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏续道藏\\太上元阳上帝无始天尊说火车王灵官真经.txt",
    "category": "正统道藏续道藏"
  },
  "full_translation": "**The Most High Primordial Yang Emperor’s Wuzhi Heavenly Worthy’s Scripture of the Fire Chariot King Divine Marshal**\n\n**Scripture Title:** *The Most High Primordial Yang Emperor’s Wuzhi Heavenly Worthy’s Scripture of the Fire Chariot King Divine Marshal*. Author unknown. One fascicle. Source: *Ming Dynasty Wanli Continuation of the Daoist Canon*.\n\n---\n\nAt that time, the Wuzhi Heavenly Worthy, dwelling in the Floating Black Heavens, assembled an innumerable host of celestial immortals. He expounded the supreme, most true, and wondrous Dao, broadly unfolding the subtle mysteries of virtue and the Way. As he unrolled the sacred texts, he beheld the beings of the lower realms, all afflicted by the demonic hordes of the Six Heavens and the nine hideous specters. Mortals widely suffered calamities—deaths outnumbered births, and they were oppressed by malevolent spirits, drowned in floods, consumed by fire, robbed by bandits, slain by blades, and beset by every manner of misfortune.\n\nThen, the great assembly arranged themselves in ranks and listened attentively to his decisive words.\n\n\"In the primordial beginning, when I first opened heaven and earth, yin and yang were undivided, and the cosmos unformed. I separated the pure from the turbid, establishing the firmament and the earth. I divided the Two Modes of yin and yang, the Four Symbols and Eight Trigrams, the Five Phases, mountains and rivers, altars of soil and grain, and fixed the positions of the stars, sun, and moon. I ordained the four cardinal directions, the four corners, above and below, and the celestial divisions of the heavens. Only then did the world see the rise of rulers and ministers. Fu Xi, Shen Nong, the Yellow Emperor, and the Flame Emperor—all used herbs as medicine and grains to nourish the people, distinguishing male and female.\n\nFrom the time of Yao and Shun onward, civil and martial governance brought order to the world. The people were simple and virtuous, transformed by Daoism and Confucianism. Mortals became immortals, enjoying peace and happiness.\n\nYet now, the people below disrespect the Three Luminaries, defy the principles of the gods, commit the Ten Evils, and act with disloyalty, unkindness, cruelty, malice, injustice, and unfiliality. They destroy living things and slaughter sentient beings. When their fortune is exhausted and their lifespan ends, they shall endure these sufferings.\"\n\nThen, the celestial immortals, earthly immortals, and divine immortals stepped forward and petitioned: \"The mortals of the lower world endure hardship and sorrow. By what means may they be delivered? We humbly beseech the Heavenly Worthy, in his great compassion, to open his golden mouth and expound a method to aid and liberate them.\"\n\nAll present heard and listened reverently to his teachings.\n\n\"You, all the assembled immortals, have heard my words. If you wish to free the lower realms from demonic afflictions and suffering, there is none but the Valiant Fire Chariot King Divine Marshal. This spirit is loyal and true, unyielding to evil, and capable of vanquishing demons and ghosts.\"\n\nThe immortals petitioned: \"We have not heard of this deity’s cultivation of virtue or deeds. How does he hold rank in the Thunder Bureau with such great might? We wish to hear of his compassion.\"\n\nThe Heavenly Worthy said: \"This deity is the Fire Star of the Southern Dipper, the chief of Yu’s stellar fire. He commands flames across ten thousand *li* and hurls a thousand layers of fire chariots. He soars through the cosmos, his merit unmatched. By the Jade Emperor’s decree, he whips dragons to bring rain, fulfilling his mandate to bestow blessings. When dragons resist, he flays their sinews and binds their waists. For his valor, he was granted a temple in Xiangtan to guard the region and receive offerings.\n\nIn the Tang Dynasty, when Master Sa traveled past his shrine, the temple was struck by thunder and burned. The deity petitioned the Jade Emperor, who bestowed upon him a golden whip to follow the master and observe his transgressions. For twelve years, the Perfected One’s Dao penetrated the primordial mysteries. When the dragon rose in the Western River, his merit complete and rank established, the divine marshal emerged from the waters, leading his deputy generals to pay homage to the master. He renounced evil and embraced goodness, vowing to protect the teachings. Before the master, he swore an oath to heaven, cutting his flesh and spilling blood as a pledge of loyalty. He vowed to assist the Emperor in safeguarding the nation and was enfeoffed as the *Primordial Thunder Marshal Before the Celestial Court, the Three-Five Fire Chariot Punisher, the Iron-Faced Impartial Valiant Thunder Deity*. His duty is to eradicate wickedness, especially those who are disloyal, unfilial, or defy rulers, parents, teachers, and friends.\n\nEntrusted with this authority, the divine marshal descended to the world to deliver beings, swearing to sever demonic influences, sweep away evil, and restore rectitude, thereby bringing clarity and peace.\"\n\nThe immortals asked: \"How may this divine marshal be summoned to descend and deliver the world, sparing the people from suffering and bringing peace to the land?\"\n\nThen, the Heavenly Worthy commanded the Golden Youth to bear a talisman directly to the Primordial Realm to summon the Divine Marshal. Upon receiving the summons, the Marshal, together with his master, led three thousand silver-fanged generals and a million yaksha soldiers. They hastened to the Heavenly Worthy, prostrating before him, and petitioned: \"I, as the Valiant Guardian of the Primordial Realm, have received your summons. For what purpose?\"\n\n\"I now decree that you descend to the lower realms to eradicate demons and deliver sentient beings.\"\n\nThe Divine Marshal bowed before the Heavenly Countenance and said: \"My master, Master Sa the Perfected One, has vowed as steadfastly as a mountain to descend with me to rescue the people of the world.\"\n\nThe Heavenly Worthy said: \"You shall descend to the world and universally aid the suffering in the nether realms.\"\n\nThe Perfected One and the Heavenly Marshal bowed again, received the decree, and proclaimed the secret incantations and oaths:\n\n*\"Nine Heavens’ Valiant Marshal, mighty in the celestial courts,\nBeyond the Three Realms he moves, a loyal minister aiding the Emperor.\nHis armored form gleams golden, his wrathful mien seizes fire spirits.\nHis crimson robe flashes like lightning, his green boots tread the earth.\nA dragon-tied thunderfire sash binds him, winds and clouds swirl about his form.\nHe commands valiant generals and mighty yaksha spirits.\nLeft and right, they uphold heaven’s mandate; I serve the Purple Tenuity Lord.\nThe Jade Emperor bestows his decree; I wield the golden whip in hand.\nThe fire chariot spins like the wind, covering ten thousand *li* in a turn.\nHe seeks all acts of defiance; the golden whip manifests instantly.\nWhen sent to the celestial realms, he petitions the Jade Emperor.\nWhen sent to the watery palaces, the four seas churn with waves.\nWhen sent to the mortal world, he instantly delivers all beings.\nWhen sent to the underworld, he penetrates the darkest halls.\nWhen sent to command his generals, they respond with divine efficacy.\nWhen sent to heal the sick, the afflicted find peace.\nWhen sent to seize ghosts, he shatters their demonic strongholds.\"*\n\nWhen sent to capture demons and monsters, I pierce mountains and shatter rocks in search.\nWhen sent to relieve great droughts, thunderous rains pour down in an instant.\nWhen sent to pray for rain, sweet rains fall in abundance.\nWhen sent to halt wind and rain, wind and rain cease at once.\nWhen sent to request clear skies, heaven and earth brighten immediately.\nWhen sent to burn demonic temples, the temples crumble into fine dust.\nWhen sent to ease childbirth, the fetus turns smoothly in the womb.\nWhen sent to execute judgment, wrathful fury stirs the altar court.\nWhen sent to summon thunder, the thunder drums resound with terrifying force.\nWhen sent to raise wind and clouds, wind and rain arise without delay.\nWhen sent to reprimand corrupt officials, the golden whip appears before them.\nWhen sent to rouse the earth, the Earth Sovereign trembles in fear.\nWhen sent to cure plagues, the Plague Controller acts at once.\nWhen sent to petition the Emperor, the Jade Emperor grants my words.\n\nShould you remain with me from beginning to end, you shall become a minister of the Jade Emperor.\nTogether we make this vow: to save all living beings.\nIf you violate this oath, the golden blade will shatter your form.\nYou shall suffer cruel punishments forever, never again beholding the light.\nIf you betray this vow, you shall lose your human form for ten thousand kalpas.\nIf I betray this vow, I shall be bound to demonic hordes for all time.\nIf you serve me, my spirit inclines its ear to listen.\nThose who serve me with devotion shall see my true form appear swiftly.\nIf you do not call my name, I shall never attend your altar.\nBut if you call my name, my true form shall manifest upon the earth.\n\nOn the *ren* and *gui* days of my descent, you must be diligent in your observance.\nOffer pure tea and jujube broth, and burn peachwood incense.\nI shall appear at your side—remain calm and do not be afraid.\n\nTogether we make this vow: to save all living beings.\nWhen your merit is complete, we shall ascend together into the Primordial Heaven.\n\nHasten, hasten in accordance with the statutes of the Supreme Yang Emperor!\n\nThe Oath of Marshal Sa says:\nSa Shoujian of the Western River, wielding the authority of the Nine Heavens,\nCommands the Thunder Lord Fenglong, dispatching the spirits of mountains and rivers.\nThe Five Phases obey his inversion; he parts earth and heaven.\nThe Three Flowers gather atop his crown; the Seven Qi irrigate his spiritual root.\nHe summons thunder and absorbs its might, bowing to the divine above and below.\nAll things replenish his body; the One Qi is called the Primordial Heaven.\nHe severs demonic essences and destroys ghostly strongholds.\nMarshal Wang, fierce as a qilin, returns his gaze to the Mysterious True.\nI petition the Golden Portal; I command you to strike with thunder.\nI inscribe your name and summon you—you shall arrive at once.\nI command you to display your might, toppling the Five Peaks.\nI command you to slay demonic essences—let no ghost or specter escape.\nI command you to reprimand corrupt officials, the golden whip driving the fire wheel.\nI command you to save all beings, bringing peace to people and creatures.\nI command you to aid childbirth, ensuring mother and child part safely.\nI command you to oversee the celestial soldiers, their banners arrayed in the central camp.\nI command you to summon the officers and troops, dividing them into left and right encampments.\nI command you to possess the living child, delivering clear and immediate retribution.\nI command you to withdraw your awe-inspiring voice, standing with hands clasped at the altar.\n\nIf I do not betray your oath, you shall manifest swiftly.\nIf you do not betray my oath, I shall reward your abilities.\nIf I betray our covenant, I shall forever fall into the Northern Nether City,\nWhere the wind’s chill endures through the long night, and I shall lose my human form for ten thousand kalpas.\nIf you betray our covenant, lightning shall shatter your form.\nYour true nature shall be bound to demonic hordes, falling into darkness for kalpa after kalpa.\nIf you uphold our covenant, you shall accumulate merit and ascend to the celestial court.\n\nThe Divine Officials obey the master’s incantation, for such commands have long been decreed.\nEstablishing the law to deliver humanity, we swear an oath in blood.\nWe universally save the imperial subjects, subduing the strong and the wicked.\nSwiftly destroy their forms—morning and night, invoke my name.\nBy this vow, my true form shall appear. If you do not call my name,\nI shall never answer your summons, nor shall I aid the Mysterious Teachings.\nThose who receive the celestial might—hasten, hasten in accordance with the statutes!\n\nMarshal Sa’s Further Oath:\nSa Shoujian of the Western River, established in the Primordial Heaven,\nAttained the Dao during the Tang dynasty, his teachings flourishing and prospering.\nHe subdued all demons and monsters, obliterating their forms.\nCity Gods and Earth Deities, the Five Peaks and Four Waterways—\nAll bow at the sound of his teeth. Should any refuse,\nA flying memorial shall ascend to the Supreme Clarity, and the Supreme Ultimate shall descend.\nI traverse the Primordial Heaven; Marshal Wang and his fierce officers,\nThe golden whip driving the fire wheel, point to heaven and swear an oath,\nPoint to earth and pledge an alliance. The seal rests in my palm.\nI subdue all demonic essences—should any defy me,\nThey shall be shattered into dust. Those who obey me,\nI shall petition the Emperor on their behalf. Hasten, hasten in accordance with the statutes!\n\nThe master and marshals, having completed the ritual, descend to the lower realms,\nSubduing demonic hordes, severing evil ghosts, adjudicating the paths of humanity,\nDispersing karmic grievances, harmonizing the qi of wishes, purifying the virtue of heaven,\nPacifying the virtue of earth. At this time, the Dao is revered,\nThe Six Harmonies share benevolence, the Nine Qi are balanced,\nEvil is expelled and righteousness upheld, the land prospers,\nThe people sing, all under heaven flourishes, the imperial foundation endures,\nAnd the frontier regions know no strife.\n\nHaving subdued all, they ascend to the celestial court to behold the August Countenance and prostrate in gratitude.\nThe Heavenly Worthy declares: “Your merit as master and marshals is great, and the people enjoy peace under your rule. Karmic demons are dispelled.”\nThe assembled immortals kneel and bow, saying: “Since you, master and marshals, have subdued the demonic hordes below, the world is now pure. No merit is greater. The benefit to humanity and heaven is profound, and the light of the Dao is revealed. We beseech your celestial compassion to proclaim the precious incantation, extolling the master and praising the celestial generals, that their glory may spread through the mortal world.”\n\nThe Heavenly Worthy then recites the precious chapter and offers this hymn:\n\n*The Precious Invocation of Marshal Sa*\nWith sincere devotion, we take refuge in the lineage of the Western Lands, whose traces shine in flourishing glory.\nDispensing wealth and medicine to save all beings, accumulating deeds and merits to cultivate the supreme Dao.\nReceiving the teachings of the Iron Master, wielding the thunderous decrees of the Royal Palace.\nClad in a patchwork robe to subdue demons, wielding the Five Luminances fan to expel ghosts,\nProclaiming the Dao on heaven’s behalf, inscribing talismans with jujube wood and incantations.\nLinking wind and thunder within a hand’s span, severing demons beneath the Dipper’s might.\n\nThe Dao aligns with the Great Ultimate, its position inscribed before Heaven.\nLike pines and bamboos, wild cranes—roaming freely near and far, lone clouds ever at ease.\nIn every direction, he expounds the teachings as the master of all methods;\nIn every place, he establishes altars as a model for later generations.\nSupreme Ancestor of the Capital of Heaven, the peerless and unsurpassed Perfected Lord Sa.\n\n*The Precious Invocation of Marshal Wang, the Divine Official*\nWith sincere devotion, we take refuge in the Master and Chief Marshal,\nThe qi-endowed Divine Lord, the Great Divine Official of the Capital of Heaven who metes out punishment,\nThe impartial and fierce marshal of the Three Realms.\nWith golden eyes and crimson hair, he is called the Thunder Duke of the Three-Five Fire Chariot;\nWith a phoenix beak and silver fangs, he commands a million *pixiu* spirit-generals.\nSoaring through clouds and mist, he issues the commands of thunder,\nBrings rain and clears skies, drives away evil and cures illness, observing transgressions.\nFor twelve years, he received the mandate of the Jade Emperor,\nAccumulating merit in a hundred thousand myriad vows.\nAiding the Patriarch, most steadfast and brave,\nHe saves the dying and revives the living.\nIn every direction, he expounds the teachings;\nIn every place, he establishes altars.\nThe magnanimous and fierce marshal, the Great Divine Official of the Three-Five Fire Chariot, Heavenly Lord Wang.\n\n*The Invocation of Summons*\nWe reverently invoke the Great Master of the Azure Clouds,\nThe peerless and unsurpassed Perfected Lord Sa.\nThe Grand Secretary of the Precelestial Thunder Department,\nWho received the wondrous decrees from the Iron Master.\nWielding the Five Luminances fan to expel ghosts,\nClad in a patchwork robe to subdue demons.\nEver holding the iron bowl for empowering food,\nUniversally saving all sentient beings.\nIncantations, jujube-written talismans—all respond;\nOn heaven’s behalf, he proclaims the Dao without partiality.\nRoaming the world to the Dragon’s Rise,\nThe Iron-Faced General appears from the depths of the pool.\nFor twelve years, he observes transgressions,\nAccumulating merit in a hundred thousand myriad vows.\nHaving rashly pledged his oath before the Supreme Emperor,\nHe universally leads the Three Realms to take refuge.\nCuring illness and reviving the dead as easily as turning a hand,\nHe bestows radiance and attaches spirits to manifest numinous power.\nWe now invoke and await your arrival,\nHumbly beseeching the master’s grace for protection.\n\n*The Incantation to Summon the Divine Official*\nWe reverently invoke the magnanimous and mighty marshal,\nThe Great Divine Official of the Capital of Heaven who metes out punishment.\nThe Thunder Duke of the Three-Five Fire Chariot,\nWho received the mandate of the Three Heavens to descend and subdue demonic afflictions.\nWielding a golden whip to traverse the world,\nClad in golden armor to display his numinous power.\nGreen boots and wind-sashed robes protect his form;\nHis fiery eyes blaze to illuminate heaven and earth.\nIn an instant, he ascends the Three Heavens to pay homage to the Three Emperors;\nIn a moment, he descends to the Nine Lands to save the people.\nWith silver fangs and a phoenix beak, he commands three thousand generals;\nWith a tiger’s head, he leads a million *pixiu* soldiers.\nRiding fire and wind as vanguard and rear guard,\nPiercing mountains and shattering rocks to seize demons.\nPraying for clear skies and beseeching rain to aid the world,\nAttaching spirits and manifesting radiant light to convey intentions.\nCuring illness and driving away evil like lightning,\nQuelling plagues and capturing poisons to subdue all demons.\nSoaring through clouds and mist across the void,\nIssuing the commands of thunder with roaring might.\nThe great demons of the Three Realms all bow their heads;\nThe heretics of the Ten Directions all take refuge.\nWe now invoke and await your arrival,\nHumbly beseeching the great thunderous might for protection.\n\n*The Urgent Incantation of Summons*\nWielding a golden whip, riding the fire wheel,\nA dragon-tied sash girds his waist, his eyes blazing with fury.\nYellow turban and crimson hair, linked armor,\nWind-sashed blue robes arrayed to protect his form.\nWhy trouble skilled hands to depict my image?\nOnly wish that your heart aligns with mine.\nDirecting the Five Thunders to transmit commands,\nDemons and malevolent spirits are reduced to dust.\nWe now invoke and await your arrival,\nHumbly beseeching the great thunderous might for protection.\n\nThe Heavenly Worthy declares the oath and chapter complete, along with these scriptures and incantations.\nThis scripture is most venerable—its virtues cannot be fully expressed.\nAbove, it dispels celestial disasters;\nBelow, it averts terrestrial calamities.\nIt safeguards and stabilizes the emperor,\nProtects the nation and pacifies the people,\nDrives away plagues and eliminates demonic afflictions,\nEradicates fire spirits.\nIt disperses official troubles,\nPacifies private matters.\nThis scripture can repel vicious beasts,\nDispel misfortunes and adversities.\nIt can destroy evil people,\nBenefit all beings.\nAll desires are fulfilled,\nAll wishes are granted for the household.\nWith this scripture, dwellings are illuminated.\nWearing this scripture, it guards the body,\nDispels calamities,\nPreserves life and extends years.\nReciting this scripture, misfortunes depart and blessings arrive.\nReciting it by day brings peace and tranquility.\nReciting it by night prevents demonic dreams.\nReciting it in the heart prevents slander and gossip.\nReciting it constantly preserves life and extends longevity.\nReciting it at the proper times prevents all disasters.\nWhen a nation recites this scripture, its borders know no strife.\nWhen a lord recites this scripture, prosperity and peace are secured.\nReciting it a thousand times, one’s body shines with glory.\nReciting it ten thousand times, one ascends upon purple clouds.\nCopying and bestowing it upon others increases blessings and prosperity.\nPrinting and distributing a thousand copies brings flourishing to the household.\nDisseminating it in the Ten Directions multiplies good fortune.\nWidely exhorting the world ensures boundless merit in the unseen realm.\nOne thereby attains the Southern Dipper,\nIs inscribed in the Northern Dipper’s register of the living,\nAnd erases the name of death.\nAncestors are transformed,\nThe gates of hell are sealed.\nAll who reverently bow,\nAccording to their devotion, attain numinous response.\nEvery prayer is answered,\nNo wish remains unfulfilled.\nThose who follow the scripture’s decrees\nWill find blessings naturally drawn to them.\nThis scripture is rarely encountered;\nThose who encounter it are destined.\nAs the scripture’s recitation concludes,\nDragons and cranes come to welcome.\nAt that time, the great assembly, having heard this scripture,\nAll rejoiced greatly, believing and upholding it.\nThe Heavenly Worthy returned to the Jade Capital,\nWhile the Perfected Ones, marshals, and generals bowed in gratitude and withdrew,\nKowtowing to take refuge in the Boundless Great Dao,\nReverently paying homage to the Supreme and Perfect Three Treasures.\n\nThe Perfected One again intoned this incantation:\nA lineage flowing from Western Shu,\nWisdom directed toward compounding medicines.\nSaving and aiding sentient beings,\nIncanting jujube-written talismans.\nProclaiming the Dao on heaven’s behalf,\nRoaming the world.\nEstablishing laws to deliver people,\nMaster of salvation from suffering.\nPeerless and unsurpassed,\nSavior from suffering of the Western River.\nPerfected Lord Sa,\nLone clouds and wild cranes.\nWild cranes and lone clouds.\nLone clouds and wild cranes roam freely,\nWild cranes and lone clouds ever at ease.\nWith wholehearted devotion, we take refuge, recite, and uphold.\n\n*The Authentic Scripture of the Fire Chariot King, the Divine Official, Spoken by the Primordial Supreme Yang Emperor of the Beginningless Heaven*",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上元阳上帝无始天尊说火车王灵官真经 经名：太上元阳上帝无始天尊说火车王灵官真经。 撰人不详。 一卷。 底本出处：明《万历续道藏》。 太上元阳上帝无始天尊说火车王灵官真经 尔时，无始天尊、昔在浮黎天中，集诸天仙无鞅数众，说无上至真妙法，广演道德玄微敷歇妙道，展板灵文，观见下界众生，俱被六天魔鬼，九丑妖精侵害，生人广遭涂炭，死亡胜多，鬼怪侵凌，或被水火，劫贼刀兵，诸般若厄，致使种种不一。 尔诸大众，各序分班，谛听决言。 吾昔开辟天地之初，阴阳难分，乾坤来立。 吾乃分判清浊，置立乾坤，始分阴阳两仪，四像八卦，五行，山河社稷，安定星辰日月，东西南北，四维上下，周天分野方定，天下立有君臣，伏羲、神农、轩辕、黄帝，食草为药，百谷养民，才分男女。 尧舜以来，有文武治世，以此人民淳善，化释化儒，生人生仙，得受安乐。 今时，下民不敬三光，欺负神理，十恶忤逆，不忠不仁，不慈不善，不义不孝，毁伤物命，杀害众生，福尽寿终，当受斯苦。 时天仙、地仙、神仙，出班奏曰：下界世民，受事苦楚，作诸方便，如何救度，伏望天尊大慈敷扬，金口大开，利济度，设法要。 是时咸使闻知，是时拱听法言。 汝诸众仙闻告所说，要得下方妖魔免诸苦楚，除非豁落火车王灵官，此神赤心忠良，不顺妖邪，方断魔鬼。 诸仙奏曰：未闻此神修何德行，位居雷府，有大威力，愿闻此悯。 天尊言：此神是南斗，禹星火之首，燮火万里，掷千重火车，豁落飞走乾坤，功莫大焉。 玉帝勑召：鞭龙行雨，奉命布泽，龙抽筋，缠缚身腰，以此勇猛赐湘潭立庙，镇方境域供祭。 如在唐朝，萨公忽游庙祠，乃以雷火焚祠。 其神奏帝勅，赐金鞭，随公察过，一十二年，真人道贯先天法显，龙兴西河，功满位立，登天神於水中，部领副将出现河中，投礼师真，改恶从善，随侍护教，对师盟天，发誓立愿忠心，滴血分明，愿随护侍，誓当辅助帝君护国安邦，奏封为先天御前雷霆猛吏三五火车紏罚铁面无私豁落雷公职任先天剪除凶恶，专治不忠不孝，违背君亲师友诸事。 掌管得此，神将下世救度，誓断妖魔，扫邪皈正，方得清盒。 众仙告曰：如何得此神将，下世救度，免诸苦楚，人民安泰，国土清平。 是时，天尊即命金童持符径往先天所召之，将灵官闻召，同师部领三千银牙将，百万夜叉兵，随即朝天尊，长跪道前，奏曰：吾为豁落位镇先天，蒙召何缘？ 吾今勑汝下方，收除魔鬼，救度众生。 灵官奏於天颜，吾师萨公真人，誓重如山，亦同下界，救拔世人。 天尊言：汝当下界，普济幽冥。 真人、天将，再拜奉勑而宣秘咒誓章。 九天猛吏神，威镇九天庭。 出入三界外，忠臣助帝君。 勇身金甲现，怒容收火精。 红袍如电闪，绿靴匝地行。 龙索雷火带，风云绕定身。 统豁诸帅将，大力夜叉神。 左右承天命，吾奉紫微君。 玉帝赐吾旨，金鞭手内擎。 火车如风转，一转万里程。 专寻忤逆事，金鞭立现形。 遣吾上天界，朝奏玉皇尊。 遣吾入水府，四海波涛番。 遣吾到阳间，立便救众生。 遣吾入地府，直至阴境宫。 遣吾命帅将，帅将即通灵。 遣吾救病者，病者即安宁。 遣吾捉鬼者，摧破诸鬼营。",
      "translated_text": "**The Most High Primordial Yang Emperor’s Wuzhi Heavenly Worthy’s Scripture of the Fire Chariot King Divine Marshal**\n\n**Scripture Title:** *The Most High Primordial Yang Emperor’s Wuzhi Heavenly Worthy’s Scripture of the Fire Chariot King Divine Marshal*. Author unknown. One fascicle. Source: *Ming Dynasty Wanli Continuation of the Daoist Canon*.\n\n---\n\nAt that time, the Wuzhi Heavenly Worthy, dwelling in the Floating Black Heavens, assembled an innumerable host of celestial immortals. He expounded the supreme, most true, and wondrous Dao, broadly unfolding the subtle mysteries of virtue and the Way. As he unrolled the sacred texts, he beheld the beings of the lower realms, all afflicted by the demonic hordes of the Six Heavens and the nine hideous specters. Mortals widely suffered calamities—deaths outnumbered births, and they were oppressed by malevolent spirits, drowned in floods, consumed by fire, robbed by bandits, slain by blades, and beset by every manner of misfortune.\n\nThen, the great assembly arranged themselves in ranks and listened attentively to his decisive words.\n\n\"In the primordial beginning, when I first opened heaven and earth, yin and yang were undivided, and the cosmos unformed. I separated the pure from the turbid, establishing the firmament and the earth. I divided the Two Modes of yin and yang, the Four Symbols and Eight Trigrams, the Five Phases, mountains and rivers, altars of soil and grain, and fixed the positions of the stars, sun, and moon. I ordained the four cardinal directions, the four corners, above and below, and the celestial divisions of the heavens. Only then did the world see the rise of rulers and ministers. Fu Xi, Shen Nong, the Yellow Emperor, and the Flame Emperor—all used herbs as medicine and grains to nourish the people, distinguishing male and female.\n\nFrom the time of Yao and Shun onward, civil and martial governance brought order to the world. The people were simple and virtuous, transformed by Daoism and Confucianism. Mortals became immortals, enjoying peace and happiness.\n\nYet now, the people below disrespect the Three Luminaries, defy the principles of the gods, commit the Ten Evils, and act with disloyalty, unkindness, cruelty, malice, injustice, and unfiliality. They destroy living things and slaughter sentient beings. When their fortune is exhausted and their lifespan ends, they shall endure these sufferings.\"\n\nThen, the celestial immortals, earthly immortals, and divine immortals stepped forward and petitioned: \"The mortals of the lower world endure hardship and sorrow. By what means may they be delivered? We humbly beseech the Heavenly Worthy, in his great compassion, to open his golden mouth and expound a method to aid and liberate them.\"\n\nAll present heard and listened reverently to his teachings.\n\n\"You, all the assembled immortals, have heard my words. If you wish to free the lower realms from demonic afflictions and suffering, there is none but the Valiant Fire Chariot King Divine Marshal. This spirit is loyal and true, unyielding to evil, and capable of vanquishing demons and ghosts.\"\n\nThe immortals petitioned: \"We have not heard of this deity’s cultivation of virtue or deeds. How does he hold rank in the Thunder Bureau with such great might? We wish to hear of his compassion.\"\n\nThe Heavenly Worthy said: \"This deity is the Fire Star of the Southern Dipper, the chief of Yu’s stellar fire. He commands flames across ten thousand *li* and hurls a thousand layers of fire chariots. He soars through the cosmos, his merit unmatched. By the Jade Emperor’s decree, he whips dragons to bring rain, fulfilling his mandate to bestow blessings. When dragons resist, he flays their sinews and binds their waists. For his valor, he was granted a temple in Xiangtan to guard the region and receive offerings.\n\nIn the Tang Dynasty, when Master Sa traveled past his shrine, the temple was struck by thunder and burned. The deity petitioned the Jade Emperor, who bestowed upon him a golden whip to follow the master and observe his transgressions. For twelve years, the Perfected One’s Dao penetrated the primordial mysteries. When the dragon rose in the Western River, his merit complete and rank established, the divine marshal emerged from the waters, leading his deputy generals to pay homage to the master. He renounced evil and embraced goodness, vowing to protect the teachings. Before the master, he swore an oath to heaven, cutting his flesh and spilling blood as a pledge of loyalty. He vowed to assist the Emperor in safeguarding the nation and was enfeoffed as the *Primordial Thunder Marshal Before the Celestial Court, the Three-Five Fire Chariot Punisher, the Iron-Faced Impartial Valiant Thunder Deity*. His duty is to eradicate wickedness, especially those who are disloyal, unfilial, or defy rulers, parents, teachers, and friends.\n\nEntrusted with this authority, the divine marshal descended to the world to deliver beings, swearing to sever demonic influences, sweep away evil, and restore rectitude, thereby bringing clarity and peace.\"\n\nThe immortals asked: \"How may this divine marshal be summoned to descend and deliver the world, sparing the people from suffering and bringing peace to the land?\"\n\nThen, the Heavenly Worthy commanded the Golden Youth to bear a talisman directly to the Primordial Realm to summon the Divine Marshal. Upon receiving the summons, the Marshal, together with his master, led three thousand silver-fanged generals and a million yaksha soldiers. They hastened to the Heavenly Worthy, prostrating before him, and petitioned: \"I, as the Valiant Guardian of the Primordial Realm, have received your summons. For what purpose?\"\n\n\"I now decree that you descend to the lower realms to eradicate demons and deliver sentient beings.\"\n\nThe Divine Marshal bowed before the Heavenly Countenance and said: \"My master, Master Sa the Perfected One, has vowed as steadfastly as a mountain to descend with me to rescue the people of the world.\"\n\nThe Heavenly Worthy said: \"You shall descend to the world and universally aid the suffering in the nether realms.\"\n\nThe Perfected One and the Heavenly Marshal bowed again, received the decree, and proclaimed the secret incantations and oaths:\n\n*\"Nine Heavens’ Valiant Marshal, mighty in the celestial courts,\nBeyond the Three Realms he moves, a loyal minister aiding the Emperor.\nHis armored form gleams golden, his wrathful mien seizes fire spirits.\nHis crimson robe flashes like lightning, his green boots tread the earth.\nA dragon-tied thunderfire sash binds him, winds and clouds swirl about his form.\nHe commands valiant generals and mighty yaksha spirits.\nLeft and right, they uphold heaven’s mandate; I serve the Purple Tenuity Lord.\nThe Jade Emperor bestows his decree; I wield the golden whip in hand.\nThe fire chariot spins like the wind, covering ten thousand *li* in a turn.\nHe seeks all acts of defiance; the golden whip manifests instantly.\nWhen sent to the celestial realms, he petitions the Jade Emperor.\nWhen sent to the watery palaces, the four seas churn with waves.\nWhen sent to the mortal world, he instantly delivers all beings.\nWhen sent to the underworld, he penetrates the darkest halls.\nWhen sent to command his generals, they respond with divine efficacy.\nWhen sent to heal the sick, the afflicted find peace.\nWhen sent to seize ghosts, he shatters their demonic strongholds.\"*",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1227,
      "start_sentence": 0,
      "end_sentence": 43,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.167280197143555,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\太上元阳上帝无始天尊说火车王灵官真经.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "遣吾捉妖怪，穿山破石寻。 遣吾救大旱，一时雷雨倾。 遣吾祈雨者，雨霖霖。 遣吾止风雨，风雨即时停。 遣吾要晴者，天地即时晴。 遣吾焚怪庙，怪庙化微尘。 遣吾摧生者，胎孕顺转轮。 遣吾煞伐者，啖怒动坛庭。 遣吾要雷者，雷鼓响惊人。 遣吾起风云，风雨即便兴。 遣吾紏真官，金鞭立面陈。 遣吾起土者，土皇心胆惊。 遣吾治瘟者，瘟司即便行。 遣吾奏帝者，玉帝准吾言。 与吾同终始，便为玉帝臣。 共汝发誓愿，誓愿救众生。 汝若有犯者，金刀碎斩形。 永受毒刑险，无复睹光明。 汝若自负誓，万劫失人身。 我若自负誓，永世配魔群。 汝若奉吾者，吾神侧耳听。 懃心奉吾者，吾当速现形。 不是呼吾号，决不赴坛庭。 若是呼吾号，平地现真形。 壬癸吾降日，受持当要勤。 净茶枣汤献，桃木香上焚。 吾在左右现，安心不得惊。 共汝发誓愿，誓愿救众生。 与汝功满日，同汝入先天。 急急如元阳上帝律令。 萨公誓咒曰 西河萨守坚，掌握九天权。 叱咤丰隆君，策役岳渎泉。 五行任颠倒，揭开坤与乾。 三华朝顶上，七炁灌灵根。 呼雷吸雷霆，仰汝俯祇灵。 万物补吾身，一炁曰先天。 普断妖魔精，杀伐诸鬼营。 王帅猛麒麟，返望归玄真。 吾奏金阙庭，命汝点雷霆。 吾押汝姓名，到即随召临。 命汝逞威灵，五岳俱摧倾。 命汝诛妖精，鬼魅母过形。 命汝紏真官，金鞭驾火轮。 命汝救众生，民物以安宁。 命汝救生产，胎孕母子分。 命汝督天丁，旌旗族中军。 命汝召吏兵，分营左右屯。 命汝附生童，报应直分明。 命汝收威声，拱手立坛庭。 吾不负汝誓，汝当速现形。 汝不负吾誓，吾当劳汝能。 吾若负汝盟，永堕北罗城。 长夜风力冷，万劫失人身。 汝若负吾盟，霹雳碎分形。 真性配魔群，劫劫堕幽冥。 汝遵吾盟誓，积功升天庭。 灵官遵师咒，直人曾有令。 立法以度人，滴血以为誓。 普救诸皇民，强邪并颂崇。 疾速灭其形，早晚持吾号。 凭誓现真形，不是呼吾号。 决不赴汝名，吾不助玄教。 其受天威形，急急如律令。 萨公又誓咒 西河萨守坚，本位立先天。 唐朝方得道，道法阐兴隆。 降伏诸妖魔，鬼怪灭其形。 城隍并社令，五岳四渎者。 叩齿总伏降，若有不伏者。 飞文奏上清，太极降下降。 吾在先天行，王帅猛吏将。 金鞭驾火轮，指天天为誓。 指地地为盟，印令吾手掌。 降伏诸魔精，敢有逆吾者。 碎斩化为尘，若有顺吾者。 吾当奏帝君，急急如律令。 师帅奉礼咒毕，辞往下方，收摄群魔，断除邪鬼，判分人道，冤业消散，愿炁和平，天德以清，地德以宁。 时逢道恭，六合同仁，九炁均平，除邪辅正，国土丰盈，兆民歌唱，普天兴隆，帝基攸久，边域不争。 收摄已尽，俱赴天阙朝睹尊颜，伏旨礼谢。 天尊言：汝乃师帅功大有劳，民得安主，冤魔消释。 众仙长跪，面礼白言：既汝师帅收摄，下界群魔俱已清净，功莫大焉，人天利益，得观光明，伏望天慈宣说宝诰，赞咏其师，敷扬天将，已旌凡世。 天尊即说宝章，而作颂曰。 萨君宝诰 志心皈命，派流西地，迹显隆兴。 施财合药济群生，积行累功修至道。 授铁师之教旨，掌王府之雷书。 身披百衲伏魔衣，手执五明降鬼扇，代天宣化咒枣书符。 连风雷於咫尺之间，剪妖魔於斗罡之下。",
      "translated_text": "When sent to capture demons and monsters, I pierce mountains and shatter rocks in search.\nWhen sent to relieve great droughts, thunderous rains pour down in an instant.\nWhen sent to pray for rain, sweet rains fall in abundance.\nWhen sent to halt wind and rain, wind and rain cease at once.\nWhen sent to request clear skies, heaven and earth brighten immediately.\nWhen sent to burn demonic temples, the temples crumble into fine dust.\nWhen sent to ease childbirth, the fetus turns smoothly in the womb.\nWhen sent to execute judgment, wrathful fury stirs the altar court.\nWhen sent to summon thunder, the thunder drums resound with terrifying force.\nWhen sent to raise wind and clouds, wind and rain arise without delay.\nWhen sent to reprimand corrupt officials, the golden whip appears before them.\nWhen sent to rouse the earth, the Earth Sovereign trembles in fear.\nWhen sent to cure plagues, the Plague Controller acts at once.\nWhen sent to petition the Emperor, the Jade Emperor grants my words.\n\nShould you remain with me from beginning to end, you shall become a minister of the Jade Emperor.\nTogether we make this vow: to save all living beings.\nIf you violate this oath, the golden blade will shatter your form.\nYou shall suffer cruel punishments forever, never again beholding the light.\nIf you betray this vow, you shall lose your human form for ten thousand kalpas.\nIf I betray this vow, I shall be bound to demonic hordes for all time.\nIf you serve me, my spirit inclines its ear to listen.\nThose who serve me with devotion shall see my true form appear swiftly.\nIf you do not call my name, I shall never attend your altar.\nBut if you call my name, my true form shall manifest upon the earth.\n\nOn the *ren* and *gui* days of my descent, you must be diligent in your observance.\nOffer pure tea and jujube broth, and burn peachwood incense.\nI shall appear at your side—remain calm and do not be afraid.\n\nTogether we make this vow: to save all living beings.\nWhen your merit is complete, we shall ascend together into the Primordial Heaven.\n\nHasten, hasten in accordance with the statutes of the Supreme Yang Emperor!\n\nThe Oath of Marshal Sa says:\nSa Shoujian of the Western River, wielding the authority of the Nine Heavens,\nCommands the Thunder Lord Fenglong, dispatching the spirits of mountains and rivers.\nThe Five Phases obey his inversion; he parts earth and heaven.\nThe Three Flowers gather atop his crown; the Seven Qi irrigate his spiritual root.\nHe summons thunder and absorbs its might, bowing to the divine above and below.\nAll things replenish his body; the One Qi is called the Primordial Heaven.\nHe severs demonic essences and destroys ghostly strongholds.\nMarshal Wang, fierce as a qilin, returns his gaze to the Mysterious True.\nI petition the Golden Portal; I command you to strike with thunder.\nI inscribe your name and summon you—you shall arrive at once.\nI command you to display your might, toppling the Five Peaks.\nI command you to slay demonic essences—let no ghost or specter escape.\nI command you to reprimand corrupt officials, the golden whip driving the fire wheel.\nI command you to save all beings, bringing peace to people and creatures.\nI command you to aid childbirth, ensuring mother and child part safely.\nI command you to oversee the celestial soldiers, their banners arrayed in the central camp.\nI command you to summon the officers and troops, dividing them into left and right encampments.\nI command you to possess the living child, delivering clear and immediate retribution.\nI command you to withdraw your awe-inspiring voice, standing with hands clasped at the altar.\n\nIf I do not betray your oath, you shall manifest swiftly.\nIf you do not betray my oath, I shall reward your abilities.\nIf I betray our covenant, I shall forever fall into the Northern Nether City,\nWhere the wind’s chill endures through the long night, and I shall lose my human form for ten thousand kalpas.\nIf you betray our covenant, lightning shall shatter your form.\nYour true nature shall be bound to demonic hordes, falling into darkness for kalpa after kalpa.\nIf you uphold our covenant, you shall accumulate merit and ascend to the celestial court.\n\nThe Divine Officials obey the master’s incantation, for such commands have long been decreed.\nEstablishing the law to deliver humanity, we swear an oath in blood.\nWe universally save the imperial subjects, subduing the strong and the wicked.\nSwiftly destroy their forms—morning and night, invoke my name.\nBy this vow, my true form shall appear. If you do not call my name,\nI shall never answer your summons, nor shall I aid the Mysterious Teachings.\nThose who receive the celestial might—hasten, hasten in accordance with the statutes!\n\nMarshal Sa’s Further Oath:\nSa Shoujian of the Western River, established in the Primordial Heaven,\nAttained the Dao during the Tang dynasty, his teachings flourishing and prospering.\nHe subdued all demons and monsters, obliterating their forms.\nCity Gods and Earth Deities, the Five Peaks and Four Waterways—\nAll bow at the sound of his teeth. Should any refuse,\nA flying memorial shall ascend to the Supreme Clarity, and the Supreme Ultimate shall descend.\nI traverse the Primordial Heaven; Marshal Wang and his fierce officers,\nThe golden whip driving the fire wheel, point to heaven and swear an oath,\nPoint to earth and pledge an alliance. The seal rests in my palm.\nI subdue all demonic essences—should any defy me,\nThey shall be shattered into dust. Those who obey me,\nI shall petition the Emperor on their behalf. Hasten, hasten in accordance with the statutes!\n\nThe master and marshals, having completed the ritual, descend to the lower realms,\nSubduing demonic hordes, severing evil ghosts, adjudicating the paths of humanity,\nDispersing karmic grievances, harmonizing the qi of wishes, purifying the virtue of heaven,\nPacifying the virtue of earth. At this time, the Dao is revered,\nThe Six Harmonies share benevolence, the Nine Qi are balanced,\nEvil is expelled and righteousness upheld, the land prospers,\nThe people sing, all under heaven flourishes, the imperial foundation endures,\nAnd the frontier regions know no strife.\n\nHaving subdued all, they ascend to the celestial court to behold the August Countenance and prostrate in gratitude.\nThe Heavenly Worthy declares: “Your merit as master and marshals is great, and the people enjoy peace under your rule. Karmic demons are dispelled.”\nThe assembled immortals kneel and bow, saying: “Since you, master and marshals, have subdued the demonic hordes below, the world is now pure. No merit is greater. The benefit to humanity and heaven is profound, and the light of the Dao is revealed. We beseech your celestial compassion to proclaim the precious incantation, extolling the master and praising the celestial generals, that their glory may spread through the mortal world.”\n\nThe Heavenly Worthy then recites the precious chapter and offers this hymn:\n\n*The Precious Invocation of Marshal Sa*\nWith sincere devotion, we take refuge in the lineage of the Western Lands, whose traces shine in flourishing glory.\nDispensing wealth and medicine to save all beings, accumulating deeds and merits to cultivate the supreme Dao.\nReceiving the teachings of the Iron Master, wielding the thunderous decrees of the Royal Palace.\nClad in a patchwork robe to subdue demons, wielding the Five Luminances fan to expel ghosts,\nProclaiming the Dao on heaven’s behalf, inscribing talismans with jujube wood and incantations.\nLinking wind and thunder within a hand’s span, severing demons beneath the Dipper’s might.",
      "overlap_context": " of defiance; the golden whip manifests instantly.\nWhen sent to the celestial realms, he petitions the Jade Emperor.\nWhen sent to the watery palaces, the four seas churn with waves.\nWhen sent to the mortal world, he instantly delivers all beings.\nWhen sent to the underworld, he penetrates the darkest halls.\nWhen sent to command his generals, they respond with divine efficacy.\nWhen sent to heal the sick, the afflicted find peace.\nWhen sent to seize ghosts, he shatters their demonic strongholds.\"*",
      "start_char": 1227,
      "end_char": 2465,
      "start_sentence": 44,
      "end_sentence": 132,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.014283418655396,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\太上元阳上帝无始天尊说火车王灵官真经.txt",
        "category": "正统道藏续道藏"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "道参太极，位刊先天。 松筠野鹤，任纵横遐迩，孤云常自在。 方方阐教为万法之宗师，处处开坛作后人之模范。 都天宗祖一元无上萨公真君。 王灵官宝诰 志心皈命先生主将，一炁神君都天紏罚大灵官，三界无私猛吏将，金睛#1朱发，号三五火车雷公，凤嘴银牙，统百万貔貅神将，飞胜云雾，号令雷霆，降雨开晴，驱邪治病，观错过。 於一十二年，授命玉帝，积功勋於百千万种誓。 佐祖师，至刚至勇，济死济生，方方阐教，处处开坛，豁落猛吏三五火车大灵官王天君。 启请誓咒 仰启碧云大教主，一元无上萨仙爷。 先天雷部大尚书，亲授铁师传妙旨。 手执五明降鬼扇，身披百衲伏魔衣。 常将铁鑵食加持，普济含灵皆得度。 咒枣书符皆有应，代天宣化总无私。 云游天下至龙兴，铁面将军潭底现。 一十二年观过错，百千万种积功勋。 妄把誓盟朝上帝，普令三界悉皈依。 治病回生如返掌，开光附体阐威灵。 我今启请望来临，伏望师恩加拥护。 灵官启请咒 仰启神威豁落将，都天紏罚大灵官。 火车三五大雷公，受命三天降鬼祟。 手执金鞭寻世界，身披金甲显威灵。 绿靴风带护身形，双目火睛耀天地。 顷刻三天朝三帝，须臾九地救生民。 银牙凤嘴将三千，虎首貔貅兵百万。 走火行风前后卫，穿山破石捉妖精。 祈晴祷雨济世间，附体圆光通事意。 治病驱邪如电闪，收瘟摄毒伏群魔。 飞腾云雾遍虚空，号令雷霆轰霹雳。 三界大魔皆拱首，十方外道悉皈依。 我今启请望来临，大赐雷威加拥护。 急启请咒 手执金鞭驾火轮，腰缠龙索怒双睛。 黄巾朱发连环甲，风带蓝袍列护身。 何劳妙手图吾像，但愿君心合我心。 指挥五雷传号令，妖邪鬼魅化微尘。 我今启请望来临，大赐雷威加拥护。 天尊言誓章已毕，如斯经咒。 此经尊重，莫可难言。 上消天灾，下禳地祸，保镇帝王，护国安民，驱瘟灭祟，殄除火精，官司消散，私事和平。 此经能离恶兽，消散灾迍。 能灭恶人，利益众生。 所求遂意，所愿者成家。 有此经，宅舍光明。 佩带此经，护卫身形，消除厄难，保命延生。 看诵此经，祸去福临。 日诵此经，保佑安志宁。 夜诵此经，梦魅不侵。 心诵此经，口舌不生。 常诵此经，保命延龄。 时诵此经，诸灾不侵。 国诵此经，边域不争。 主诵此经，隆昌保宁。 诵之千遍，身有光荣。 诵之万遍，升腾紫云。 抄写施人，福禄增荣。 印施千本，家眷昌隆。 散施十方，善福加增。 广劝世人，阴隙无穷。 即得南斗，上生北斗书名注上生籍，勾落死名。 祖宗生化，地狱无门。 凡在顶礼，随感通灵。 一切有叩，无愿不成。 若遵经旨，福自来臻。 此经难遇，遇者缘人。 说经将毕，龙鹤来迎。 是时，大众闻说此经，皆大欢喜，信受奉行。 天尊还於玉京，真人帅将拜谢而退，稽首皈依无极大道，志心礼谢无上至真三宝。 真人复赞咒曰 派流西蜀，哲向在合药。 救济生灵，咒枣书符。 代天宣化，云游天下。 立法度人，救苦宗师。 一元无上，西河救苦。 萨公真人，孤云野鹤。 野鹤孤云。 孤云野鹤任纵横，野鹤孤云常自在，一心皈命持诵奉行。 太上元阳上帝无始天专说火车王灵官真经 #1『睛』原作『晴』，据上下文义改。",
      "translated_text": "The Dao aligns with the Great Ultimate, its position inscribed before Heaven.\nLike pines and bamboos, wild cranes—roaming freely near and far, lone clouds ever at ease.\nIn every direction, he expounds the teachings as the master of all methods;\nIn every place, he establishes altars as a model for later generations.\nSupreme Ancestor of the Capital of Heaven, the peerless and unsurpassed Perfected Lord Sa.\n\n*The Precious Invocation of Marshal Wang, the Divine Official*\nWith sincere devotion, we take refuge in the Master and Chief Marshal,\nThe qi-endowed Divine Lord, the Great Divine Official of the Capital of Heaven who metes out punishment,\nThe impartial and fierce marshal of the Three Realms.\nWith golden eyes and crimson hair, he is called the Thunder Duke of the Three-Five Fire Chariot;\nWith a phoenix beak and silver fangs, he commands a million *pixiu* spirit-generals.\nSoaring through clouds and mist, he issues the commands of thunder,\nBrings rain and clears skies, drives away evil and cures illness, observing transgressions.\nFor twelve years, he received the mandate of the Jade Emperor,\nAccumulating merit in a hundred thousand myriad vows.\nAiding the Patriarch, most steadfast and brave,\nHe saves the dying and revives the living.\nIn every direction, he expounds the teachings;\nIn every place, he establishes altars.\nThe magnanimous and fierce marshal, the Great Divine Official of the Three-Five Fire Chariot, Heavenly Lord Wang.\n\n*The Invocation of Summons*\nWe reverently invoke the Great Master of the Azure Clouds,\nThe peerless and unsurpassed Perfected Lord Sa.\nThe Grand Secretary of the Precelestial Thunder Department,\nWho received the wondrous decrees from the Iron Master.\nWielding the Five Luminances fan to expel ghosts,\nClad in a patchwork robe to subdue demons.\nEver holding the iron bowl for empowering food,\nUniversally saving all sentient beings.\nIncantations, jujube-written talismans—all respond;\nOn heaven’s behalf, he proclaims the Dao without partiality.\nRoaming the world to the Dragon’s Rise,\nThe Iron-Faced General appears from the depths of the pool.\nFor twelve years, he observes transgressions,\nAccumulating merit in a hundred thousand myriad vows.\nHaving rashly pledged his oath before the Supreme Emperor,\nHe universally leads the Three Realms to take refuge.\nCuring illness and reviving the dead as easily as turning a hand,\nHe bestows radiance and attaches spirits to manifest numinous power.\nWe now invoke and await your arrival,\nHumbly beseeching the master’s grace for protection.\n\n*The Incantation to Summon the Divine Official*\nWe reverently invoke the magnanimous and mighty marshal,\nThe Great Divine Official of the Capital of Heaven who metes out punishment.\nThe Thunder Duke of the Three-Five Fire Chariot,\nWho received the mandate of the Three Heavens to descend and subdue demonic afflictions.\nWielding a golden whip to traverse the world,\nClad in golden armor to display his numinous power.\nGreen boots and wind-sashed robes protect his form;\nHis fiery eyes blaze to illuminate heaven and earth.\nIn an instant, he ascends the Three Heavens to pay homage to the Three Emperors;\nIn a moment, he descends to the Nine Lands to save the people.\nWith silver fangs and a phoenix beak, he commands three thousand generals;\nWith a tiger’s head, he leads a million *pixiu* soldiers.\nRiding fire and wind as vanguard and rear guard,\nPiercing mountains and shattering rocks to seize demons.\nPraying for clear skies and beseeching rain to aid the world,\nAttaching spirits and manifesting radiant light to convey intentions.\nCuring illness and driving away evil like lightning,\nQuelling plagues and capturing poisons to subdue all demons.\nSoaring through clouds and mist across the void,\nIssuing the commands of thunder with roaring might.\nThe great demons of the Three Realms all bow their heads;\nThe heretics of the Ten Directions all take refuge.\nWe now invoke and await your arrival,\nHumbly beseeching the great thunderous might for protection.\n\n*The Urgent Incantation of Summons*\nWielding a golden whip, riding the fire wheel,\nA dragon-tied sash girds his waist, his eyes blazing with fury.\nYellow turban and crimson hair, linked armor,\nWind-sashed blue robes arrayed to protect his form.\nWhy trouble skilled hands to depict my image?\nOnly wish that your heart aligns with mine.\nDirecting the Five Thunders to transmit commands,\nDemons and malevolent spirits are reduced to dust.\nWe now invoke and await your arrival,\nHumbly beseeching the great thunderous might for protection.\n\nThe Heavenly Worthy declares the oath and chapter complete, along with these scriptures and incantations.\nThis scripture is most venerable—its virtues cannot be fully expressed.\nAbove, it dispels celestial disasters;\nBelow, it averts terrestrial calamities.\nIt safeguards and stabilizes the emperor,\nProtects the nation and pacifies the people,\nDrives away plagues and eliminates demonic afflictions,\nEradicates fire spirits.\nIt disperses official troubles,\nPacifies private matters.\nThis scripture can repel vicious beasts,\nDispel misfortunes and adversities.\nIt can destroy evil people,\nBenefit all beings.\nAll desires are fulfilled,\nAll wishes are granted for the household.\nWith this scripture, dwellings are illuminated.\nWearing this scripture, it guards the body,\nDispels calamities,\nPreserves life and extends years.\nReciting this scripture, misfortunes depart and blessings arrive.\nReciting it by day brings peace and tranquility.\nReciting it by night prevents demonic dreams.\nReciting it in the heart prevents slander and gossip.\nReciting it constantly preserves life and extends longevity.\nReciting it at the proper times prevents all disasters.\nWhen a nation recites this scripture, its borders know no strife.\nWhen a lord recites this scripture, prosperity and peace are secured.\nReciting it a thousand times, one’s body shines with glory.\nReciting it ten thousand times, one ascends upon purple clouds.\nCopying and bestowing it upon others increases blessings and prosperity.\nPrinting and distributing a thousand copies brings flourishing to the household.\nDisseminating it in the Ten Directions multiplies good fortune.\nWidely exhorting the world ensures boundless merit in the unseen realm.\nOne thereby attains the Southern Dipper,\nIs inscribed in the Northern Dipper’s register of the living,\nAnd erases the name of death.\nAncestors are transformed,\nThe gates of hell are sealed.\nAll who reverently bow,\nAccording to their devotion, attain numinous response.\nEvery prayer is answered,\nNo wish remains unfulfilled.\nThose who follow the scripture’s decrees\nWill find blessings naturally drawn to them.\nThis scripture is rarely encountered;\nThose who encounter it are destined.\nAs the scripture’s recitation concludes,\nDragons and cranes come to welcome.\nAt that time, the great assembly, having heard this scripture,\nAll rejoiced greatly, believing and upholding it.\nThe Heavenly Worthy returned to the Jade Capital,\nWhile the Perfected Ones, marshals, and generals bowed in gratitude and withdrew,\nKowtowing to take refuge in the Boundless Great Dao,\nReverently paying homage to the Supreme and Perfect Three Treasures.\n\nThe Perfected One again intoned this incantation:\nA lineage flowing from Western Shu,\nWisdom directed toward compounding medicines.\nSaving and aiding sentient beings,\nIncanting jujube-written talismans.\nProclaiming the Dao on heaven’s behalf,\nRoaming the world.\nEstablishing laws to deliver people,\nMaster of salvation from suffering.\nPeerless and unsurpassed,\nSavior from suffering of the Western River.\nPerfected Lord Sa,\nLone clouds and wild cranes.\nWild cranes and lone clouds.\nLone clouds and wild cranes roam freely,\nWild cranes and lone clouds ever at ease.\nWith wholehearted devotion, we take refuge, recite, and uphold.\n\n*The Authentic Scripture of the Fire Chariot King, the Divine Official, Spoken by the Primordial Supreme Yang Emperor of the Beginningless Heaven*",
      "overlap_context": "shing glory.\nDispensing wealth and medicine to save all beings, accumulating deeds and merits to cultivate the supreme Dao.\nReceiving the teachings of the Iron Master, wielding the thunderous decrees of the Royal Palace.\nClad in a patchwork robe to subdue demons, wielding the Five Luminances fan to expel ghosts,\nProclaiming the Dao on heaven’s behalf, inscribing talismans with jujube wood and incantations.\nLinking wind and thunder within a hand’s span, severing demons beneath the Dipper’s might.",
      "start_char": 2465,
      "end_char": 3723,
      "start_sentence": 133,
      "end_sentence": 212,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.932655334472656,
      "metadata": {
        "source_file": "dao\\正统道藏续道藏\\太上元阳上帝无始天尊说火车王灵官真经.txt",
        "category": "正统道藏续道藏"
      }
    }
  ]
}