{
  "source_id": "太上洞玄灵宝五帝醮祭招真玉诀",
  "source_file": "chunked_daozang\\太上洞玄灵宝五帝醮祭招真玉诀.json",
  "total_chunks": 3,
  "total_original_chars": 2624,
  "total_translated_chars": 16524,
  "total_translation_time": 84.2533369064331,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上洞玄灵宝五帝醮祭招真玉诀.txt",
    "category": "玉诀类"
  },
  "full_translation": "*The Supreme Cavern Mystery Numinous Treasure Jade Instructions for the Five Emperors’ Offering Rite to Summon Perfected Beings*\n\n**Text Title:** *The Supreme Cavern Mystery Numinous Treasure Jade Instructions for the Five Emperors’ Offering Rite to Summon Perfected Beings*\nCompiled by the Northern Song Daoist Zhang Yongxian. This text expounds the methods for Daoists to perform offering rites and summon Perfected Beings after receiving the *Numinous Treasure Red Writ of the True Script*. One scroll.\n**Source:** *Daoist Canon of the Zhengtong Era*, Cavern Mystery Section, Jade Instructions Category.\n\n---\n\nThe Dao speaks: The *Numinous Treasure Red Writ* comprises five scrolls of True Script, each governing one direction, all being the spontaneous writings of the Primordial Beginning. The Five Elders and Five Emperors stand in attendance, while the Numinous Officials of the Five Directions record and regulate them. The prohibitions are lifted thrice a year, allowing the host of immortals to deliver the Perfected.\n\nAccording to the ancient statutes of the Mysterious Regulations, the Perfected of the Upper Offices and the divine immortals of the Five Marchmounts, once every three years, present offerings to the Numinous Officials of the Five Emperors of the Numinous Treasure: scattering flowers, kindling lamps, fragrant waters, and sweet fruits, to reverently offer to the Heavenly Perfected and preserve the numinous qi. Those later disciples who can consistently uphold this will move the Five Emperors of the Numinous Treasure with their sincerity, and the Numinous Officials of the Five Directions will rejoice in response.\n\nIn all rites, there is no distinction of lavishness or simplicity; what matters is the intention arising from within. If one possesses utmost sincerity, humans and spirits will be moved. Thus, these precepts and prohibitions are recorded for secret cultivation.\n\nThe ancient statutes prescribe the method for summoning the Numinous Officials of the Five Emperors of the Numinous Treasure:\n- For spring, use the days of *jiǎyín* and *yǐmǎo*;\n- For summer, use *dīngsì* and *bǐngwǔ*;\n- For the four transitional periods, use *wùchén*, *wùxū*, *jǐwèi*, and *jǐchǒu*;\n- For autumn, use *gēngshēn* and *xīnyǒu*;\n- For winter, use *guǐhài* and *rénzǐ*.\n\nOn the *jiànwáng* day, construct a high altar upon the numinous marchmount, enclosing it with railings on four sides. At the eastern, western, southern, and northern cardinal points, set up five gates and place five placards. The inscriptions on the placards follow separate texts found in the *Great Covenant Rites*.\n\nAfter installing the five gates, erect screens on all four sides to prevent wind from disrupting the firelight and qi. Ensure the fire’s qi remains dense, avoiding excessive illumination that would scatter the numinous qi. Spread a clean mat, five feet in size, and arrange it according to the season—facing east in spring.\n\nUse fine incense, pure tea, jujube broth, and fresh fruits to purify the ritual seat, offering them according to abundance. Prepare eleven clean cups and new, fine ladles. Arrange three trays: two holding five cups each, and one holding a single cup. Place the single-cup tray below the five-cup tray. Arrange the five incense burners in sequence before the trays, and likewise prepare three trays of fruits. Place the remaining broth in a separate vessel before them.\n\nOn the table, lay out five feet of crimson-patterned silk, the *Nán Hé Dān Zēng*. Upon it, place the five scrolls of the *True Script of the Upper Clarity Numinous Treasure* and the five talismans. Cut five feet of azure-patterned silk from the *Bì Lín* fabric to cover the True Script and talismans, placing them behind the seat. Position the talismans within the crimson and azure silks to symbolize the covenant of cutting hair and drawing blood. The azure silk substitutes for hair, and the crimson for the blood oath. The Perfected do not harm their spirit or diminish their virtue, hence these substitutes.\n\nUse five types of incense, blended together. Ensure each incense burner is new and fine, arranging them in sequence. Kneel with girded sash to invoke, speaking slowly and softly to subtly attract the descent of the Heavenly Perfected.\n\nInscribe six slips of white silver with cinnabar characters. Next, invoke the host of immortals and Numinous Officials of the Five Emperors, placing them below the five incense burners.\n\n**For the East:**\nThe Nine Qi Azure Heaven, Peaceful Treasure Florescence Grove, Azure Numinous Primordial Elder Lord; the Azure Emperor; the Nine Qi Heavenly Lord; the Supreme Perfected King; the Azure Waist Jade Maiden; and the Numinous Officials of the Eastern Realm.\nThis Perfected of the Emperor, [Name], twice bows to the five incenses and prostrates to reverently invite you. Descend through the Azure Florescence Primordial Yang Gate.\n\n**For the South:**\nThe Three Qi Vermilion Heaven, Brahma Treasure Prosperous Yang, Vermilion Numinous True Elder Lord; the Red Emperor; the Vermilion Three Qi Heavenly Lord; the Primordial Qi Elder; the Vermilion Palace Supreme Vermilion Jade Maiden; and the Numinous Officials of the Southern Realm.\nThis Perfected of the Emperor, [Name], twice bows to the five incenses and prostrates to reverently invite you. Descend through the Cavern Yang Supreme Radiance Gate.\n\n**For the Center:**\nThe Primordial Cavern Supreme Emperor’s Heaven, Jade Treasure Primordial Numinous Primordial Elder Lord; the Yellow Emperor; the Supreme Emperor Perfected; the Purple Cinnabar Yellow Court of *Wù-Jǐ*; the Heavenly Granary Jade Maiden; and the Numinous Officials of the Central Yellow Supreme Emperor.\nThis Perfected of the Emperor, [Name], twice bows to the five incenses and prostrates to reverently invite you. Descend through the Primordial Yellow Lofty Dawn Gate.\n\n**For the West:**\nThe Seven Qi Heaven of the Seven Treasures Golden Gate, Luminous Numinous August Elder Lord; the White Emperor; the Bright Stone Seven Qi Heavenly Lord; the Supreme White Plain Jade Maiden; and the Numinous Officials of the Western Realm.\nThis Perfected of the Emperor, [Name], twice bows to the five incenses and prostrates to reverently invite you. Descend through the Pervading Yin Complete Barrier Gate.\n\n**For the North:**\nThe Five Qi Mysterious Heaven of the Cavern Yin, Solitary and Profound Five Numinous Mysterious Elder Lord; the Black Emperor; the Mysterious Nourishing Five Qi Heavenly Lord; the Supreme Perfected; at the first crow of the cock at dawn, face east, knock the teeth nine times, rub the palms until warm, and wipe the face nine times with the hands. Recite the prayer while imbibing the Azure Molar Qi.\n\nFace south and perform the same ritual, knocking the teeth three times. Face west and knock seven times, as above. For the center, knock twelve times and wipe the face. For the north, knock five times, following the same method.\n\nAt the first crow of the cock, compose the body and settle the spirit. Proceed in order, first imbibing the Azure Molar Qi of the East, then the South, Center, West, and North, as described. After completing the Five Emperors, knock the teeth thirty-six times and swallow the qi twenty-five times to conclude.\n\nThen recite the collective incantation:\n*\"White rocks towering, proceed in order,\nFountains gush through caverns as jade nectar.\nDrink and attain long life,\nLifespan ever extended.\"*\n\nConclude by circling the tongue around the upper and lower mouth, gathering the jade spring until the mouth is full, and swallow thrice. Then draw the qi twenty-five times, swallowing it completely. The Dao is thus fulfilled.\n\nThe method for imbibing the Five Cloud Molar Qi is recorded in a separate scroll.\n\nThe Heavenly Perfected August One states: Those who cultivate the Dao of flying immortality, the methods of deliverance, corpse liberation, and concealed transformation—who cycle through life and death, roaming freely with the turning of fate, unbound by the Great Yin—must inscribe in cinnabar the limitless inner sounds of the Jade Characters of the Various Heavens, wear white silk upon the body, and consume them according to the script. With a heart untainted by impurity, the five viscera harmonize, the six palaces become tranquil, and the empty azure attains non-action. After eight years, one penetrates the various heavens, sits and perceives the ten directions, with myriad spirits descending in communion. The body generates jade radiance, and one rides the dragon chariot to ascend at dawn.\n\nThe Jade Chapters’ Supreme Dao is transmitted but once in forty thousand kalpas. The methods of cultivation must follow the cinnabar-inscriptions above, aligning with the seasons’ nodes.\n\nIn the first, second, and third months of spring, inscribe the text in cinnabar, face the sovereign, and knock the teeth nine times. Recite the prayer:\n*\"Great Brahmā of Flying Heaven, Vairāja of the Eight Directions,\nNine Qi of the Azure Sky, all gathered as Divine Kings.\nFive Unions and Eight Assemblies, streaming and radiant through the Great Void,\nAbove opening the Dragon Han, ancestral lineage of divine immortals,\nBelow parting the Long Night, chambers of the Nine Dark Realms.\nDelivering suffering souls, decayed bones kindled with light,\nThe body transforms into feathered raiment, garments of five hues.\nAzure dragons and jade chariots, soaring steps through empty space—\nToday I make this supplication to the Azure Sky’s first yang.\nMay ten thousand vows unite, merging with qi as one,\nAscending into formlessness, eternally preserved without end.\"*\nUpon completion, ingest the text and, facing upward, swallow eight breaths to conclude.\n\nIn the fourth, fifth, and sixth months of summer, inscribe the text in cinnabar, face the sovereign, and knock the teeth eight times. Recite the prayer:\n*\"Heavenly Script unfolds in the Brahmā-net, crimson clarity of the Dao’s practice,\nAbove opening the Eight Paths, Five Unions connecting the numinous.\nThe Great Cycle commences its term, the Cavern Yang refines essence,\nJade texts gleam resplendent, the Three Luminaries self-illumined.\nBelow delivering life and death, all who receive form—\nToday is most auspicious, the Great Sage descends to the court.\nNine nights open the windows, dark chambers bright and clear,\nThe Three Evils cease, my Dao naturally fulfills.\nThe Five Emperors safeguard and deliver, ascending to the Flowery Capital,\nWithin the Seven Jeweled Grove, eternally enjoying kalpas’ longevity.\"*\nUpon completion, ingest the text and, facing upward, swallow eight breaths to conclude.\n\nIn the seventh, eighth, and ninth months of autumn, inscribe the text in cinnabar, face the sovereign, and knock the teeth seven times. Recite the prayer:\n*\"Flying Mystery of the Eight Assemblies, coalescing qi to form the True,\nSixty-four characters, root of the Numinous Sky,\nOpening deliverance from life and death, decayed bones restored to humanity,\nDark souls unbound, receiving qi to ascend the Supreme Mystery—\nToday the time is propitious, ten thousand vows laid bare,\nAll spirits gather in communion, my wish for immortality,\nRadiance merging with the Dao, my wish for divinity.\nTo ride the plain clouds, ascending to the Emperor’s dawn,\nRejoicing among the Seven Treasures, befriending perfected beings.\"*\nUpon completion, ingest the text and, facing upward, swallow eight breaths to conclude.\n\nIn the tenth, eleventh, and twelfth months of winter, inscribe the text in cinnabar, face the sovereign, and knock the teeth five times. Recite the prayer:\n*\"Jade characters open the dark, streaming radiance to the upper gate,\nEight qi coalesce the True, Brahmā-practice of luminous clouds,\nDivine Kings kindle light, the Three Images cleave asunder,\nFive hues swirl and linger, illuminating my numinous soul—\nToday the convergence is met, I gaze upward to the Imperial Lord,\nOpening and pardoning to bestow the script, granting me the True Text,\nJade moisture intermingles and irrigates, the five palaces suffused with fragrance,\nFeathers and plumage transform, mounting radiance to ride the dawn,\nExiting darkness to enter the formless, immortal deliverance naturally attained,\nSeven ancestors together return, rejoicing in the Upper Prime.\"*\nUpon completion, ingest the text and, facing upward, swallow eight breaths to conclude.\n\nThe Heavenly Perfected August One states: These invocatory words are the qi of the Four Assemblies, the sounds of the Eight Harmonies, the natural chapters of spontaneity. Those who practice them gather herbs without concealment, mountain spirits submit and hide, demonic trials do not intrude, tigers and wolves with venomous stings cannot assail the body. Jade maidens and divine youths attend and serve in all directions, the numinous qi of the Five Emperors descend into one’s form, pacifying and stabilizing the five viscera, brightening inner and outer senses, the heart opened and intent penetrating, foreknowing fortune and misfortune. The Three Corpses vanish, the Nine Worms do not arise. The body grows wondrous fur, swiftly attaining divine immortality. Only by the grace of the Most August Supreme Emperor, who deigns to bestow merciful kindness, flowing down to the multitudes, granting as petitioned—unable to bear such vast beneficence, I humbly offer my diligent service. Your servant [Name], with reverence and awe, prostrates and bows twice. Again, three times offer warmed wine, prostrating upon the ground. If there are private petitions, present them as one’s heart desires. Upon concluding the supplications, first honor the Eastern Azure Emperor of Numinous Might, the Nine Qi Azure Sprout Heavenly Lord, the Supreme Perfected King, the Jade Maiden of the Azure Waist, and the various spirit officials of the Eastern Quarter, each returning to their divine chambers, then scatter incense and bow twice. Next honor the Southern Vermilion Emperor of Blazing Might, the Three Qi Vermilion Heavenly Lord, the Elder of Primordial Qi, the Great Vermilion Jade Maiden of the Vermilion Palace, and the various spirit officials of the Southern Quarter, each returning to their divine chambers, then scatter incense and bow twice. Next honor the Central Yellow Emperor of the Encompassing Pivot, the Supreme Emperor Perfected One, the Zi Dan of the Yellow Court’s Wu Ji, the Jade Maiden of the Heavenly Granary, and the various spirit officials of the Central Yellow Supreme Emperor’s Palace, each returning to their divine chambers, then scatter incense and bow twice. Next honor the Western White Emperor of Radiant Soul, the Seven Qi Bright Stone Heavenly Lord, the Supreme White Plain Jade Maiden, and the various spirit officials of the Western Quarter, each returning to their divine chambers, then scatter incense and bow twice. Next honor the Northern Black Emperor of Hidden Might, the Five Qi Mysterious Nourishment Heavenly Lord, the Supreme Numinous Lord, the Night Radiance Jade Maiden, and the various spirit officials of the Northern Quarter, each returning to their divine chambers, then scatter incense and bow twice. Next honor the multitude of spirits of the Nine Heavens, the perfected ones of the Five Marchmounts’ numinous mountains, the various spirit officials of the Three Offices and Nine Bureaus of the rivers and four watercourses, the Jade Maidens of Earthly Immortals, and the various spirit officials of the flying immortals and divine immortals of the Five Marchmounts, each returning to their divine chambers, then scatter incense and bow twice. The rites of offering and libation are complete. Take the tablets and bury them beneath the five gates, burying the multitude of perfected ones’ tablets beneath the central gate. This is performed once every three years, thrice in nine years, and then ceases.\n\nDaoist Zhang Chengxian states: On the day of receiving the Two Registers of the Five Elders’ Vermilion Script of the Numinous Treasure, one should immediately perform the libation rites according to the method to summon the Heavenly Perfected. Their hidden radiance will respond and descend through the power of sincerity. Thereafter, supplicate once every three years, and prayers will surely be answered.\n\nHere is the translation:\n\n---\n\nNow, I have compiled and presented this ready-made ritual as a standard observance. Those who pursue the highest learning must not neglect it. Thus concludes *The Jade Instructions on the Daoist Rites of the Five Emperors for Summoning the Perfected from the Supreme Cavern Mystery Numinous Treasure*.\n\n---",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞玄灵宝五帝醮祭招真玉诀 经名：太上洞玄灵宝五帝醮祭招真玉诀。 北宋道士账永先编撰。 言道士受《灵宝赤书真文》后醮祭招真之法。 一卷。 底本出处：《正统道藏》洞玄部玉诀类。 太上洞玄灵宝五帝醮祭招真玉诀 道言：灵宝赤书五篇真文，篇镇一方，皆元始自然之书。 五老与五帝侍卫，五方灵官纪录，禁限一年三开，众仙度真。 玄科旧典，上官诸真人，及五岳神仙，三年一奉灵宝五帝灵官，散花燃灯，香汤甘果，上献天真，以存灵气。 后学常能尔者，则灵宝五帝，感乎精诚，五方灵官当之喜欣。 凡礼无浓薄，意从中来，苟有至情，人神感焉。 故书其品戒，秘而修行。 旧典降致灵宝五帝灵官法。 以用甲寅、乙卯； 夏用丁巳、丙午； 四用戊辰、戊戌、己未、己丑； 秋用庚申、辛酉； 冬用癸亥、壬子。 建王之日，於灵岳作高坛，四方栏纂，束西南北王上，用五门，安五榜也。 榜依别文，在大盟仪中。 安五门毕，当四面安障，勿令当风，使火光气乱。 每令火气密，勿令广照，使灵气散也。 敷一五尺净席，随节安之。 春则向东方也。 每以名香浄茶，枣汤鲜果，洁净法座，随丰珍之。 宜用浄杯十一枚，杓令新好。 拌三枚，皆令精洁。 二柈各盛五杯，其一柈盛一杯。 一柈在五杯柈者下流。 比五香火，相次於拌前。 果亦三拌如之。 余汤即别器，请着前。 列南和丹缯五尺绛纹缯也。 於案，上清灵宝五篇真文五符。 割碧林之帛五尺，青纹缯也。 覆真文符上，安着座后。 令符处丹青中，以为落发噏血之盟也。 青以代发，丹代噏血之盟誓。 真人不伤神损德，故以代之也。 香用五种，杂和之。 香炉每令新好，相连安之。 束带跪请，每令徐声下气，天真密感而降。 当朱书白银刺上六枚。 次请五帝众仙灵官，安五香火之下。 东方九气青天安宝华林青灵始老君、苍帝君、九气天君、太上真王、青腰玉女、东乡诸灵官。 某帝真人某甲，再拜五香，稽首奉请。 降青华元阳门。 南方三气丹天梵宝昌阳丹灵真老君、赤帝君、朱丹三气天君、元气丈人、朱宫太丹玉女、南乡诸灵官。 某帝真人某甲，再拜五香，稽首奉请。 降洞阳太光门。 中央元洞太帝之天玉宝元灵元老君、黄帝君、太帝真人、子丹黄庭戊己、天仓玉女、中黄太帝官君。 某帝真人某甲再拜五香，稽首奉请。 降元黄高晨门。 西方七气之天七宝金门皓灵皇老君、白帝君、明石七气天君、太上白素玉女、西乡诸灵官。 某帝真人某甲，再拜五香，稽首奉请。 降通阴全关门。 北方五气玄天洞阴朔单郁绝五灵玄老君、黑帝君、玄滋五气天君、太上常以鸡鸣阳光始分，东向叩齿九通，摩两掌令热，以手掌拭面目九过，仰祝服青牙。 南方南向，亦如上法，叩齿三通。 西方西向七通，如上法。 中央十二通叩齿，拭面目。 北方五通，一如上法。 常以鸡鸣，安身定神，以次行事，先服东方青牙气，次南方，次中央，次西方，次北方，如上法。 五帝毕，便叩齿三十六通，咽气二十五过止。 又都咒曰： 白石岩岩以次行，源泉涌洞以玉浆，饮之长生，寿命益长。 毕，以舌料口上下中央，令玉泉满口而三咽，又引气二十五过，极气而咽之，其道都毕。 服五云牙之法，别卷写之。 天真皇人曰：凡修飞仙之道，及灭度之法，尸解隐化，轮转生死，随运逍遥，无拘太阴，当朱书诸天玉字无量内音，白素佩身，随文服御，心不受秽，五内清和，六府恬寂，空碧无为，八年洞达诸天，坐见十方，万神交降，体生玉光，驰骋龙驾，白日登晨。",
      "translated_text": "*The Supreme Cavern Mystery Numinous Treasure Jade Instructions for the Five Emperors’ Offering Rite to Summon Perfected Beings*\n\n**Text Title:** *The Supreme Cavern Mystery Numinous Treasure Jade Instructions for the Five Emperors’ Offering Rite to Summon Perfected Beings*\nCompiled by the Northern Song Daoist Zhang Yongxian. This text expounds the methods for Daoists to perform offering rites and summon Perfected Beings after receiving the *Numinous Treasure Red Writ of the True Script*. One scroll.\n**Source:** *Daoist Canon of the Zhengtong Era*, Cavern Mystery Section, Jade Instructions Category.\n\n---\n\nThe Dao speaks: The *Numinous Treasure Red Writ* comprises five scrolls of True Script, each governing one direction, all being the spontaneous writings of the Primordial Beginning. The Five Elders and Five Emperors stand in attendance, while the Numinous Officials of the Five Directions record and regulate them. The prohibitions are lifted thrice a year, allowing the host of immortals to deliver the Perfected.\n\nAccording to the ancient statutes of the Mysterious Regulations, the Perfected of the Upper Offices and the divine immortals of the Five Marchmounts, once every three years, present offerings to the Numinous Officials of the Five Emperors of the Numinous Treasure: scattering flowers, kindling lamps, fragrant waters, and sweet fruits, to reverently offer to the Heavenly Perfected and preserve the numinous qi. Those later disciples who can consistently uphold this will move the Five Emperors of the Numinous Treasure with their sincerity, and the Numinous Officials of the Five Directions will rejoice in response.\n\nIn all rites, there is no distinction of lavishness or simplicity; what matters is the intention arising from within. If one possesses utmost sincerity, humans and spirits will be moved. Thus, these precepts and prohibitions are recorded for secret cultivation.\n\nThe ancient statutes prescribe the method for summoning the Numinous Officials of the Five Emperors of the Numinous Treasure:\n- For spring, use the days of *jiǎyín* and *yǐmǎo*;\n- For summer, use *dīngsì* and *bǐngwǔ*;\n- For the four transitional periods, use *wùchén*, *wùxū*, *jǐwèi*, and *jǐchǒu*;\n- For autumn, use *gēngshēn* and *xīnyǒu*;\n- For winter, use *guǐhài* and *rénzǐ*.\n\nOn the *jiànwáng* day, construct a high altar upon the numinous marchmount, enclosing it with railings on four sides. At the eastern, western, southern, and northern cardinal points, set up five gates and place five placards. The inscriptions on the placards follow separate texts found in the *Great Covenant Rites*.\n\nAfter installing the five gates, erect screens on all four sides to prevent wind from disrupting the firelight and qi. Ensure the fire’s qi remains dense, avoiding excessive illumination that would scatter the numinous qi. Spread a clean mat, five feet in size, and arrange it according to the season—facing east in spring.\n\nUse fine incense, pure tea, jujube broth, and fresh fruits to purify the ritual seat, offering them according to abundance. Prepare eleven clean cups and new, fine ladles. Arrange three trays: two holding five cups each, and one holding a single cup. Place the single-cup tray below the five-cup tray. Arrange the five incense burners in sequence before the trays, and likewise prepare three trays of fruits. Place the remaining broth in a separate vessel before them.\n\nOn the table, lay out five feet of crimson-patterned silk, the *Nán Hé Dān Zēng*. Upon it, place the five scrolls of the *True Script of the Upper Clarity Numinous Treasure* and the five talismans. Cut five feet of azure-patterned silk from the *Bì Lín* fabric to cover the True Script and talismans, placing them behind the seat. Position the talismans within the crimson and azure silks to symbolize the covenant of cutting hair and drawing blood. The azure silk substitutes for hair, and the crimson for the blood oath. The Perfected do not harm their spirit or diminish their virtue, hence these substitutes.\n\nUse five types of incense, blended together. Ensure each incense burner is new and fine, arranging them in sequence. Kneel with girded sash to invoke, speaking slowly and softly to subtly attract the descent of the Heavenly Perfected.\n\nInscribe six slips of white silver with cinnabar characters. Next, invoke the host of immortals and Numinous Officials of the Five Emperors, placing them below the five incense burners.\n\n**For the East:**\nThe Nine Qi Azure Heaven, Peaceful Treasure Florescence Grove, Azure Numinous Primordial Elder Lord; the Azure Emperor; the Nine Qi Heavenly Lord; the Supreme Perfected King; the Azure Waist Jade Maiden; and the Numinous Officials of the Eastern Realm.\nThis Perfected of the Emperor, [Name], twice bows to the five incenses and prostrates to reverently invite you. Descend through the Azure Florescence Primordial Yang Gate.\n\n**For the South:**\nThe Three Qi Vermilion Heaven, Brahma Treasure Prosperous Yang, Vermilion Numinous True Elder Lord; the Red Emperor; the Vermilion Three Qi Heavenly Lord; the Primordial Qi Elder; the Vermilion Palace Supreme Vermilion Jade Maiden; and the Numinous Officials of the Southern Realm.\nThis Perfected of the Emperor, [Name], twice bows to the five incenses and prostrates to reverently invite you. Descend through the Cavern Yang Supreme Radiance Gate.\n\n**For the Center:**\nThe Primordial Cavern Supreme Emperor’s Heaven, Jade Treasure Primordial Numinous Primordial Elder Lord; the Yellow Emperor; the Supreme Emperor Perfected; the Purple Cinnabar Yellow Court of *Wù-Jǐ*; the Heavenly Granary Jade Maiden; and the Numinous Officials of the Central Yellow Supreme Emperor.\nThis Perfected of the Emperor, [Name], twice bows to the five incenses and prostrates to reverently invite you. Descend through the Primordial Yellow Lofty Dawn Gate.\n\n**For the West:**\nThe Seven Qi Heaven of the Seven Treasures Golden Gate, Luminous Numinous August Elder Lord; the White Emperor; the Bright Stone Seven Qi Heavenly Lord; the Supreme White Plain Jade Maiden; and the Numinous Officials of the Western Realm.\nThis Perfected of the Emperor, [Name], twice bows to the five incenses and prostrates to reverently invite you. Descend through the Pervading Yin Complete Barrier Gate.\n\n**For the North:**\nThe Five Qi Mysterious Heaven of the Cavern Yin, Solitary and Profound Five Numinous Mysterious Elder Lord; the Black Emperor; the Mysterious Nourishing Five Qi Heavenly Lord; the Supreme Perfected; at the first crow of the cock at dawn, face east, knock the teeth nine times, rub the palms until warm, and wipe the face nine times with the hands. Recite the prayer while imbibing the Azure Molar Qi.\n\nFace south and perform the same ritual, knocking the teeth three times. Face west and knock seven times, as above. For the center, knock twelve times and wipe the face. For the north, knock five times, following the same method.\n\nAt the first crow of the cock, compose the body and settle the spirit. Proceed in order, first imbibing the Azure Molar Qi of the East, then the South, Center, West, and North, as described. After completing the Five Emperors, knock the teeth thirty-six times and swallow the qi twenty-five times to conclude.\n\nThen recite the collective incantation:\n*\"White rocks towering, proceed in order,\nFountains gush through caverns as jade nectar.\nDrink and attain long life,\nLifespan ever extended.\"*\n\nConclude by circling the tongue around the upper and lower mouth, gathering the jade spring until the mouth is full, and swallow thrice. Then draw the qi twenty-five times, swallowing it completely. The Dao is thus fulfilled.\n\nThe method for imbibing the Five Cloud Molar Qi is recorded in a separate scroll.\n\nThe Heavenly Perfected August One states: Those who cultivate the Dao of flying immortality, the methods of deliverance, corpse liberation, and concealed transformation—who cycle through life and death, roaming freely with the turning of fate, unbound by the Great Yin—must inscribe in cinnabar the limitless inner sounds of the Jade Characters of the Various Heavens, wear white silk upon the body, and consume them according to the script. With a heart untainted by impurity, the five viscera harmonize, the six palaces become tranquil, and the empty azure attains non-action. After eight years, one penetrates the various heavens, sits and perceives the ten directions, with myriad spirits descending in communion. The body generates jade radiance, and one rides the dragon chariot to ascend at dawn.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1358,
      "start_sentence": 0,
      "end_sentence": 68,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 43.771220207214355,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上洞玄灵宝五帝醮祭招真玉诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "玉章上道，四万劫一传，修行之法，当依上朱书，随四时之节。 春正月、二月、三月，朱书文，向王叩齿九通，祝曰： 飞天大梵，维罗八方。 九气青天，总为神王。 五合八会，流焕太空。 上开龙汉，神仙之宗。 下披长夜，九幽之房。 拔度苦魂，朽骸生光。 身变毛羽，五色衣裳。 苍龙碧辇，飞步空行。 今日上告，青天始阳。 万愿皆合，与气齐同。 升入无形，永保无穷。 毕，服文，仰咽八气止。 夏四月、五月、六月，朱书文，向王叩齿八通，祝曰： 天书敷罗，梵行赤明。 上开八道，五合通灵。 大运启期，洞阳炼精。 玉文焕朗，三景自明。 下度生死，一切受形。 今日良吉，大圣临庭。 九夜开牖，幽房朗清。 三恶休息，我道自成。 五帝保度，上登华京。 七宝林中，长享劫龄。 毕，服文，仰咽八气止。 秋七月、八月、九月，朱书文，向王叩齿七通，祝曰： 飞玄八会，结气成真。 六十四字，总灵天根。 开度生死，朽骨还人。 幽魂披散，受气上玄。 今日时庆，万愿开陈。 众灵交会，我愿我仙。 景与道合，我愿我神。 得乘素云，上升帝晨。 七宝欢乐，交友真人。 毕，服文，仰咽八气止。 冬十月、十一月、十二月，朱书文，向王叩齿五通，祝曰： 玉字开冥，流焕上门。 八气结真，梵行景云。 神王启光，三象洞分。 五色徘徊，照我灵魂。 今日值合，仰希帝君。 开宥出书，授我真文。 玉泽交灌，五府生熏，毛羽变化，驾景乘晨。 出幽入无，仙度自然。 七祖同归，欢乐上元。 毕，服文，仰咽八气止。 天真皇人曰：此祝说之辞，皆四会之气，八和之音，自然之章，行之者 采药，不得隐藏，山精伏匿，邪试不干，虎狼毒螫，令不加身。 玉女神童，给使东西，五帝灵气，降入其形，安镇五腑，内外聪明，心开意通，逆知吉凶。 三尸消灭，九虫不生。 身有奇毛，早得神仙。 惟蒙至尊大帝，直垂慈恩，下流众庶，赐如所陈，不胜洪泽，辄自效勤。 臣某诚惶诚恐，稽首再拜。 又三过上汤上酒，伏地。 若私有所陈，自适意启乙。 启愿毕，上劳东方灵威仰苍帝君、青芽九气天君、太上真王、青腰玉女、东乡诸灵官，各还神房，便散香再拜。 次上劳南方赤熛弩赤帝君、朱丹三气天君、元气丈人、朱宫太丹玉女、南乡诸灵官，各还神房，便散香再拜。 次上劳中央含枢纽黄帝君、太帝真人、子丹黄庭戊己、天仓玉女、中黄太帝官君，各还神房，便散香再拜。 次上劳西方曜魄宝白帝君、明石七气天君、太上白素玉女、西乡诸灵官，各还神房，便散香再拜。 次上劳北方隐侯局黑帝君、玄滋五气天君、太上灵君、夜光玉女、北乡诸灵官，各还神房，便散香再拜。 次上劳九天众灵、五岳灵山真人、江河四渎三官九府诸灵官、地仙玉女、五岳飞仙神仙诸仙官君，各还神房，便散香再拜。 奉礼醮祭法事都毕，取简随方埋着五门下，众真简埋中央门下。 右三年一醮，九年三醮，都止。 道士张承先曰：受灵宝五老赤书二箓，杖策之日，宜即依法祭醮，以招天真。 幽映感降，在乎精诚。 后则三年一请，祈于必通。",
      "translated_text": "The Jade Chapters’ Supreme Dao is transmitted but once in forty thousand kalpas. The methods of cultivation must follow the cinnabar-inscriptions above, aligning with the seasons’ nodes.\n\nIn the first, second, and third months of spring, inscribe the text in cinnabar, face the sovereign, and knock the teeth nine times. Recite the prayer:\n*\"Great Brahmā of Flying Heaven, Vairāja of the Eight Directions,\nNine Qi of the Azure Sky, all gathered as Divine Kings.\nFive Unions and Eight Assemblies, streaming and radiant through the Great Void,\nAbove opening the Dragon Han, ancestral lineage of divine immortals,\nBelow parting the Long Night, chambers of the Nine Dark Realms.\nDelivering suffering souls, decayed bones kindled with light,\nThe body transforms into feathered raiment, garments of five hues.\nAzure dragons and jade chariots, soaring steps through empty space—\nToday I make this supplication to the Azure Sky’s first yang.\nMay ten thousand vows unite, merging with qi as one,\nAscending into formlessness, eternally preserved without end.\"*\nUpon completion, ingest the text and, facing upward, swallow eight breaths to conclude.\n\nIn the fourth, fifth, and sixth months of summer, inscribe the text in cinnabar, face the sovereign, and knock the teeth eight times. Recite the prayer:\n*\"Heavenly Script unfolds in the Brahmā-net, crimson clarity of the Dao’s practice,\nAbove opening the Eight Paths, Five Unions connecting the numinous.\nThe Great Cycle commences its term, the Cavern Yang refines essence,\nJade texts gleam resplendent, the Three Luminaries self-illumined.\nBelow delivering life and death, all who receive form—\nToday is most auspicious, the Great Sage descends to the court.\nNine nights open the windows, dark chambers bright and clear,\nThe Three Evils cease, my Dao naturally fulfills.\nThe Five Emperors safeguard and deliver, ascending to the Flowery Capital,\nWithin the Seven Jeweled Grove, eternally enjoying kalpas’ longevity.\"*\nUpon completion, ingest the text and, facing upward, swallow eight breaths to conclude.\n\nIn the seventh, eighth, and ninth months of autumn, inscribe the text in cinnabar, face the sovereign, and knock the teeth seven times. Recite the prayer:\n*\"Flying Mystery of the Eight Assemblies, coalescing qi to form the True,\nSixty-four characters, root of the Numinous Sky,\nOpening deliverance from life and death, decayed bones restored to humanity,\nDark souls unbound, receiving qi to ascend the Supreme Mystery—\nToday the time is propitious, ten thousand vows laid bare,\nAll spirits gather in communion, my wish for immortality,\nRadiance merging with the Dao, my wish for divinity.\nTo ride the plain clouds, ascending to the Emperor’s dawn,\nRejoicing among the Seven Treasures, befriending perfected beings.\"*\nUpon completion, ingest the text and, facing upward, swallow eight breaths to conclude.\n\nIn the tenth, eleventh, and twelfth months of winter, inscribe the text in cinnabar, face the sovereign, and knock the teeth five times. Recite the prayer:\n*\"Jade characters open the dark, streaming radiance to the upper gate,\nEight qi coalesce the True, Brahmā-practice of luminous clouds,\nDivine Kings kindle light, the Three Images cleave asunder,\nFive hues swirl and linger, illuminating my numinous soul—\nToday the convergence is met, I gaze upward to the Imperial Lord,\nOpening and pardoning to bestow the script, granting me the True Text,\nJade moisture intermingles and irrigates, the five palaces suffused with fragrance,\nFeathers and plumage transform, mounting radiance to ride the dawn,\nExiting darkness to enter the formless, immortal deliverance naturally attained,\nSeven ancestors together return, rejoicing in the Upper Prime.\"*\nUpon completion, ingest the text and, facing upward, swallow eight breaths to conclude.\n\nThe Heavenly Perfected August One states: These invocatory words are the qi of the Four Assemblies, the sounds of the Eight Harmonies, the natural chapters of spontaneity. Those who practice them gather herbs without concealment, mountain spirits submit and hide, demonic trials do not intrude, tigers and wolves with venomous stings cannot assail the body. Jade maidens and divine youths attend and serve in all directions, the numinous qi of the Five Emperors descend into one’s form, pacifying and stabilizing the five viscera, brightening inner and outer senses, the heart opened and intent penetrating, foreknowing fortune and misfortune. The Three Corpses vanish, the Nine Worms do not arise. The body grows wondrous fur, swiftly attaining divine immortality. Only by the grace of the Most August Supreme Emperor, who deigns to bestow merciful kindness, flowing down to the multitudes, granting as petitioned—unable to bear such vast beneficence, I humbly offer my diligent service. Your servant [Name], with reverence and awe, prostrates and bows twice. Again, three times offer warmed wine, prostrating upon the ground. If there are private petitions, present them as one’s heart desires. Upon concluding the supplications, first honor the Eastern Azure Emperor of Numinous Might, the Nine Qi Azure Sprout Heavenly Lord, the Supreme Perfected King, the Jade Maiden of the Azure Waist, and the various spirit officials of the Eastern Quarter, each returning to their divine chambers, then scatter incense and bow twice. Next honor the Southern Vermilion Emperor of Blazing Might, the Three Qi Vermilion Heavenly Lord, the Elder of Primordial Qi, the Great Vermilion Jade Maiden of the Vermilion Palace, and the various spirit officials of the Southern Quarter, each returning to their divine chambers, then scatter incense and bow twice. Next honor the Central Yellow Emperor of the Encompassing Pivot, the Supreme Emperor Perfected One, the Zi Dan of the Yellow Court’s Wu Ji, the Jade Maiden of the Heavenly Granary, and the various spirit officials of the Central Yellow Supreme Emperor’s Palace, each returning to their divine chambers, then scatter incense and bow twice. Next honor the Western White Emperor of Radiant Soul, the Seven Qi Bright Stone Heavenly Lord, the Supreme White Plain Jade Maiden, and the various spirit officials of the Western Quarter, each returning to their divine chambers, then scatter incense and bow twice. Next honor the Northern Black Emperor of Hidden Might, the Five Qi Mysterious Nourishment Heavenly Lord, the Supreme Numinous Lord, the Night Radiance Jade Maiden, and the various spirit officials of the Northern Quarter, each returning to their divine chambers, then scatter incense and bow twice. Next honor the multitude of spirits of the Nine Heavens, the perfected ones of the Five Marchmounts’ numinous mountains, the various spirit officials of the Three Offices and Nine Bureaus of the rivers and four watercourses, the Jade Maidens of Earthly Immortals, and the various spirit officials of the flying immortals and divine immortals of the Five Marchmounts, each returning to their divine chambers, then scatter incense and bow twice. The rites of offering and libation are complete. Take the tablets and bury them beneath the five gates, burying the multitude of perfected ones’ tablets beneath the central gate. This is performed once every three years, thrice in nine years, and then ceases.\n\nDaoist Zhang Chengxian states: On the day of receiving the Two Registers of the Five Elders’ Vermilion Script of the Numinous Treasure, one should immediately perform the libation rites according to the method to summon the Heavenly Perfected. Their hidden radiance will respond and descend through the power of sincerity. Thereafter, supplicate once every three years, and prayers will surely be answered.",
      "overlap_context": "tless inner sounds of the Jade Characters of the Various Heavens, wear white silk upon the body, and consume them according to the script. With a heart untainted by impurity, the five viscera harmonize, the six palaces become tranquil, and the empty azure attains non-action. After eight years, one penetrates the various heavens, sits and perceives the ten directions, with myriad spirits descending in communion. The body generates jade radiance, and one rides the dragon chariot to ascend at dawn.",
      "start_char": 1358,
      "end_char": 2556,
      "start_sentence": 69,
      "end_sentence": 136,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.02233076095581,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上洞玄灵宝五帝醮祭招真玉诀.txt",
        "category": "玉诀类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "今撰出立成，以为常仪，至学之士，勿亏之矣。 太上洞玄灵宝五帝醮祭招真玉诀竟",
      "translated_text": "Here is the translation:\n\n---\n\nNow, I have compiled and presented this ready-made ritual as a standard observance. Those who pursue the highest learning must not neglect it. Thus concludes *The Jade Instructions on the Daoist Rites of the Five Emperors for Summoning the Perfected from the Supreme Cavern Mystery Numinous Treasure*.\n\n---",
      "overlap_context": "ntral gate. This is performed once every three years, thrice in nine years, and then ceases.\n\nDaoist Zhang Chengxian states: On the day of receiving the Two Registers of the Five Elders’ Vermilion Script of the Numinous Treasure, one should immediately perform the libation rites according to the method to summon the Heavenly Perfected. Their hidden radiance will respond and descend through the power of sincerity. Thereafter, supplicate once every three years, and prayers will surely be answered.",
      "start_char": 2556,
      "end_char": 2596,
      "start_sentence": 137,
      "end_sentence": 138,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 2.4597859382629395,
      "metadata": {
        "source_file": "dao\\正统道藏洞玄部\\玉诀类\\太上洞玄灵宝五帝醮祭招真玉诀.txt",
        "category": "玉诀类"
      }
    }
  ]
}