{
  "source_id": "太上九赤班符五帝内真经",
  "source_file": "chunked_daozang\\太上九赤班符五帝内真经.json",
  "total_chunks": 10,
  "total_original_chars": 11702,
  "total_translated_chars": 74044,
  "total_translation_time": 356.85099482536316,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏正一部\\太上九赤班符五帝内真经.txt",
    "category": "正统道藏正一部"
  },
  "full_translation": "**The Supreme Cavern-Real Scripture of the Nine Crimson Talismans and the Five Emperors’ Inner Realms**\n\n**Scripture Title:** *The Supreme Cavern-Real Scripture of the Nine Crimson Talismans and the Five Emperors’ Inner Realms* (abbreviated as *The Nine Crimson Talismans*). Author unknown, approximately composed during the Eastern Jin dynasty. A foundational scripture of the early Shangqing tradition. One fascicle. Base text from *The Orthodox Daoist Canon*, Zhengyi Section, First Division.\n\n---\n\n**The Supreme Cavern-Real Scripture of the Nine Crimson Talismans and the Five Emperors’ Inner Realms**\n\nThe Nine Crimson Talismans, also called the *Nine Aerial Talismans of the Feathered Central Grove*, were concealed by the Celestial Worthy of Primordial Beginning within the Golden Chamber and Jade Abode of the Jasper Terrace of Supreme Clarity. Their divine radiance blazes forth, streaming light that illumines the void; the Four Poles oversee their trial, and the Five Emperors guard their authenticity.\n\nThe Supreme Lord appointed three hundred Jade Lads of the Cloud Palace, while the Upper Prime further assigned seven hundred Jade Maidens of the Western Florescence to attend and preserve this numinous writ. Its divine standard marks Supreme Clarity, its majesty commands the Nine Heavens; it subdues demons and dispels defilement, beheads legions of malevolence, seals and governs the sacred mountains, summons and commands the spirits of waters. It oversees boundless multitudes, encompasses the myriad immortals, and with the Five Peaks, the Four Abysses, and the bodies of later disciples, it deploys divine soldiers to punish transgressions and reward merit.\n\nEvery nine thousand years, the Nine Heavens open once; when the Nine Heavens open, this scripture illuminates the chambers of the Five Peaks, mysteriously bestowed upon those who attain the Dao. Without immortal bones or jade names inscribed for future lives, none may behold its passages. Those who obtain its text become masters and patriarchs of the Five Peaks, sovereigns of the Four Seas. Those who uphold it bring blessings to the souls of seven generations of ancestors and spread fortune to nine kinds of kin. Those who cultivate it ascend to become lofty immortals of Supreme Clarity.\n\nThe Nine Crimson Talismans are the flying, mysterious feathered chapters of the *qi* of the Nine Primes, coalesced into jade script. The primordial text was transmitted by the human realm to the Supreme Lord of the Great Dao; the Celestial Worthy of Primordial Beginning transmitted it to the Upper Prime Lord of the Southern Culmen; the Supreme Lord transmitted it to the Great Emperor of Fusang; the Great Emperor transmitted it to the Celestial Emperor of the Supreme Tenuity; the Celestial Emperor of the Supreme Tenuity transmitted it to the Later Sage Emperor of the Golden Portals; and thence to the Prime Minister, the Azure Lad. The Upper Prime Lord of the Southern Culmen transmitted it to Master Hongya and the Four Perfected of the Great Ultimate.\n\nTransmission of *qi* follows in succession, each inscribed on golden tablets, bound with purple cords, encased in cloud-brocade satchels, sealed with the seals of the Three Primes, stored in dark and verdant caskets, and concealed within the chambers of the Nine Bends. Jade immortals offer incense, Mount Taihua holds the towels; the Four Directors oversee its radiance, the Five Emperors guard its carriage. The Three Primes observe the rites, the myriad immortals pay homage to the Perfected. Its Dao is most wondrous; according to the regulations, it is transmitted once every seven thousand years. To lightly divulge or expose it, or transmit it to the unworthy, brings the seven generations of ancestors to trial and causes the disciple’s body to perish in the river’s source.\n\nLater disciples who diligently concentrate their minds, seek immortality with utmost sincerity, and resonate with the dark virtue of the Great Void, aligning with the mysterious emergence of the Three Primes, will naturally encounter and obtain this text. Only upon receiving and wearing the true talismans may one traverse the mysterious peaks, entrust one’s body to the secluded mountains, command the Nine Crimson to seal the mounds, summon the Five Agents to invoke spirits, dispatch the Water Emperor to erase transgressions, and gather the numina of the seas to open the sources. Thus, the ledgers of sins are obliterated in the Nine Treasuries, and the records of life are inscribed in the Three Clarities. *Qi* shakes the dark waves, majesty subdues the myriad spirits; demonic hosts are vanquished in trial, immortal officials descend in form. Wielding the tally of the Six Jia, one commands the celestial soldiers; penetrating the obscure and fathoming the subtle, one perceives the yet-unborn. Thus may one attain divine transcendence and soar through Supreme Clarity.\n\nThose who study without encountering the *Nine Aerial Talismans of the Feathered Central Grove* will not receive the mysterious names of the Five Peaks, nor will the water spirits of the Four Seas erase their ledgers of sins or inscribe their names in the Three Clarities. When wandering through rivers and marshes or dwelling in secluded mountains without wearing this text, mountain spirits and celestial demons will test and thwart their aspirations, myriad harms will arise of themselves, and they will never attain immortality. The Water Emperor will compile their transgressions and present them to the Emperor of Judgment.\n\n---\n\n**The Five Peaks’ Five Emperors’ Inner Method of Transforming True Forms to Seek Immortality**\n\nWhen entering the Eastern Peak, visualize the Azure Emperor of the East. If upon closing the eyes one immediately perceives his true form, that person’s five palaces will coalesce *qi*, the six viscera will generate the Perfected, the nine treasuries will become luminously clear, and internally, no obstructions will remain. Harmonious tones will resound, and wondrous principles will become lucid and penetrating—such a person possesses the talent of a superior immortal. Thus, the Dao will descend at once, and divine luminaries will respond in resonance; such a one will attain immortality without delay.\n\nIf one sees azure *qi* flourishing and dense, it is the *qi* of the upright spirit of that direction, reflecting in emptiness—this indicates gradual progress on the Dao. If one sees black *qi*, it is the office of the Perfected of one’s original life reflecting in emptiness, overseeing the trial of one’s body. If one sees red *qi*, it is the *qi* of the office of cavernous generation reflecting in emptiness, coming to guard one’s body. If one sees yellow *qi*, it is the *qi* of the office dispatched by the Peak reflecting in emptiness, coming to assist one in communicating with the Perfected. None of these should be feared; proceed according to the original method, and in time, the Dao will naturally respond and descend.\n\nIf one sees white *qi*, it is the essence of celestial demons in the void, coming to test one’s body. One should strike the left teeth thirty-six times and recite the *Golden Mystery Chapter* once; then the demonic essence will vanish of itself, and the Perfected will naturally descend.\n\nWhen entering the Southern Peak, visualize the Vermilion Emperor of the South. If upon closing the eyes one immediately perceives his true form, that person’s bones will coalesce jade frost, *qi* will interpenetrate the divine palace, the cinnabar terrace will inscribe the tablets, and the purple chapters will be bound into records. Profoundly awakened to the dark path, one roams freely in the empty courtyard, encounters all things without obstruction, and through tranquil contemplation, resonates with the Perfected—such a person possesses the talent of a superior immortal. Thus, the Dao will descend at once, and divine luminaries will respond in resonance; such a one will attain immortality without delay.\n\nIf one sees red *qi*, it is the *qi* of the upright spirit of that direction reflecting in emptiness—this indicates gradual progress on the Dao. If one sees azure *qi*, it is the office of the Perfected of one’s original life reflecting in emptiness, coming to oversee the trial of one’s body. If one sees yellow *qi*, it is the office of cavernous generation reflecting in emptiness, coming to guard one’s body. If one sees white *qi*, it is the *qi* of the office dispatched by the Southern Peak reflecting in emptiness, coming to assist one’s body in communicating with the Perfected.\n\nThere is nothing strange in this—proceed according to the fundamental practice, and in time the Dao will naturally respond and descend.\n\nIf one sees black *qi*, it is the essence of the Great Demon of the Void coming to test the authenticity of the adept’s truth. The adept should strike the left teeth thirty-six times and recite the Mystic Chapter’s demon-quelling incantation once, whereupon the demonic essence will vanish of itself and the true form will descend.\n\nWhen entering the Western Marchmount, meditate upon the White Thearch of the West; if upon closing the eyes one immediately perceives the true form, such a person possesses a golden palace within the chest, where the Six Palaces receive the Perfected. They penetrate the obscure and commune with the numinous, revolving and releasing the Mystic Origin. Within, there is no obstruction; without, no dust of desire. Thus their name is inscribed in the Golden Register and recorded in the Upper Clarity—such a one possesses the talent of a superior immortal. Therefore, the Dao will descend at once, and divine luminaries will respond in resonance; such a one will attain immortality without delay.\n\nIf one sees white *qi*, it is the *qi* of the upright spirit of that direction reflecting in emptiness—this indicates gradual progress on the Dao. If one sees yellow *qi*, it is the office of the Perfected of one’s original life reflecting in emptiness, coming to oversee the trial of one’s body. If one sees black *qi*, it is the *qi* of the office of cavernous generation reflecting in emptiness, coming to guard one’s body. If one sees azure *qi*, it is the *qi* of the office dispatched by the Western Marchmount reflecting in emptiness, coming to assist one’s body in communicating with the Perfected. There is nothing strange in this—proceed according to the fundamental practice, and in time the Perfected will naturally respond and descend.\n\nIf one sees red *qi*, it is the essence of the Great Demon of the Void coming to test the authenticity of the adept’s truth. The adept should strike the left teeth thirty-six times and recite the Golden Mystic Chapter’s demon-quelling incantation once, whereupon the demonic essence will vanish of itself and the true form will descend.\n\nWhen entering the Northern Marchmount, meditate upon the Black Thearch of the North; if upon closing the eyes one immediately perceives the true form, such a person possesses a mysterious stem rising at dawn, with the five centers interlinked. Their *qi* ascends to the Purple Heaven, their name is inscribed in the Northern Mysteries, and their tally is carved in the Azure Palace. They illumine the obscure chamber, penetrate the numinous, and reach the subtle—such a one possesses the talent of a superior immortal. Therefore, the Dao will descend at once, and divine luminaries will respond in resonance; such a one will attain immortality without delay.\n\nIf one sees black *qi*, it is the *qi* of the upright spirit of that direction reflecting in emptiness—this indicates gradual progress on the Dao. If one sees white *qi*, it is the office of the Perfected of one’s original life reflecting in emptiness, coming to oversee the trial of one’s body. If one sees azure *qi*, it is the *qi* of the office of cavernous generation reflecting in emptiness, coming to guard one’s body. If one sees red *qi*, it is the *qi* of the office dispatched by the Northern Marchmount reflecting in emptiness, coming to assist one’s body in communicating with the Perfected. There is nothing strange in this—proceed according to the fundamental practice, and in time the Perfected will naturally respond and descend.\n\nIf one sees yellow *qi*, it is the essence of the Great Demon of the Void coming to test the authenticity of the adept’s truth. The adept should strike the left teeth thirty-six times and recite the Golden Mystic Chapter’s demon-quelling incantation once, whereupon the demonic essence will vanish of itself and the true form will descend.\n\nWhen entering the Central Marchmount, meditate upon the Yellow Thearch of the Center; if upon closing the eyes one immediately perceives the true form, such a person possesses a cinnabar palace generating radiance, where the Red Child receives the immortal. They govern the obscure and resolve obstructions, savoring the luminous clarity of the empyrean. Their name is inscribed in the Thearch’s chamber, and their image is charted in the Three Origins—such a one possesses the talent of a superior immortal. Therefore, the Dao will descend at once, and divine luminaries will respond in resonance; such a one will attain immortality without delay.\n\nIf one sees yellow *qi*, it is the *qi* of the upright spirit of that direction reflecting in emptiness—this indicates gradual progress on the Dao. If one sees red *qi*, it is the office of the Perfected of one’s original life reflecting in emptiness, coming to oversee the trial of one’s body. If one sees white *qi*, it is the *qi* of the office of cavernous generation reflecting in emptiness, coming to guard one’s body. If one sees black *qi*, it is the *qi* of the office dispatched by the Central Marchmount reflecting in emptiness, coming to assist one’s body in communicating with the Perfected. There is nothing strange in this—proceed according to the fundamental practice, and in time the Perfected will naturally respond and descend.\n\nIf one sees azure *qi*, it is the essence of the Great Demon of the Void coming to test the authenticity of the adept’s truth. The adept should strike the left teeth thirty-six times and recite the Golden Mystic Chapter’s demon-quelling incantation once, whereupon the demonic essence will vanish of itself and the true form will descend.\n\n**The Supreme Method of Inscribing Names in the Five Marchmounts to Determine Immortal Rank**\n*The Nine Vermilion Talismans for Pacifying the Marchmounts and Seeking Immortal Rank*\n\n**The Nine Qi Rank Talisman of the Azure Emperor of the Eastern Marchmount, with Inner Visualization of Jia-Yi Entering Wood**\n\nThe Azure Emperor Lord of the East, surnamed Chang, personal name Jingmeng, wears the Nine Origins Heaven-Penetrating Crown upon his head. His robe is of azure brocade with jade-green flying skirts, and he bears the Supreme Nine Qi Life-Spirit Seal. His sash is woven of kingfisher plumes and interlaced with numinous cords.\n\nOn the day of *Lichun* (Beginning of Spring), he rides a cloud-chariot drawn by nine azure dragons, accompanied by twelve Jade Maidens of the Azure Waist, each holding a nine-colored staff and banner of the Azure Grove. He traverses the Eastern Marchmount, Mount Tai, reviewing the registers of Perfected Ones and Immortal Officials. At times, he visits the Water Emperor of the Eastern Sea to audit the merits, transgressions, and sins of those who study the Dao. Upon his return, he descends to bestow talismans upon the adept’s body.\n\nThe practitioner ingests this talisman to summon his presence, visualizes his *qi* to induce the descent of his Perfected form, and seeks to have their name expunged from the Water Emperor’s ledgers and inscribed in the Jade Registers.\n\nOn the day of *Lichun* at dawn, bathe, purify, and enter the chamber to burn incense. Ingest the *Nine Qi Rank Talisman of Jia-Yi Entering Wood*, strike the teeth nine times, and visualize the Azure Emperor Lord of the East: surnamed Chang, personal name Jingmeng, clad in his robes and colors, descending in his azure-cloud chariot into the adept’s chamber. Azure *qi* billows densely, filling the room and encircling the adept’s form.\n\nWithin the Azure Emperor’s *qi*, visualize a crimson radiance transforming, like the essence of Jupiter, blazing and luminous. It descends from the crown of the head into the adept’s body, its brilliance illuminating the liver. Draw in the *qi* and swallow nine times, sensing warmth suffusing the body. Soon, the crimson light scatters within and emerges from the nine orifices, coalescing above the adept’s head into azure clouds. The adept feels their body within the clouds, ascending with them.\n\nAfter a long while, the perception stabilizes, as if treading empty space. Then recite the incantation while looking upward:\n\n*\"Supreme Cinnabar, myriad purifications,\nRevolving to seal the nine gates.\nMysterious Void uplifts the Perfected,\nCrimson ranks swiftly divide.\nBearing Jia to enter Wood,\nRiding Yi to command clouds.\nAbove, govern the Five Marchmounts,\nSeal mounds and summon mountains.\nBelow, proclaim to the Nine Rivers,\nTwelve water sources.\nErase the old ledgers,\nInscribe in the Jade Chapters.\nRecord my Perfected form,\nAzure Emperor Lord,\nDescend with me in azure radiance,\nFlying azure feathered skirts,\nMerge with the Emperor’s light,\nPetition the Jade Dawn.\"*\n\nConclude by striking the teeth twelve times and swallowing saliva twenty-four times.\n\nPracticing this for nine years enables one to inscribe talismans and cast them into mountains, summoning clouds and rain, obscuring the sky in darkness. Casting talismans into water causes dragons to rise from the depths. Among people, inscribing talismans on wood renders the script indelible, its characters growing ever brighter. Carrying the talisman while embracing a tree transforms the body into a mountain forest, guarded by twelve Immortal Officials of the Eastern Marchmount.\n\nAfter eighteen years, one can ascend to the Upper Clarity in flight.\n\nRevealing this method carelessly invokes ghostly soldiers as punishment, extending calamity to seven generations, and the body will perish in the river’s source.\n\n**The Nine Qi Rank Talisman of Jia-Yi Entering Wood**\nInscribe in vermilion. On the day of *Lichun* at dawn, face east to ingest it, reciting the incantation as above.\n\nAdditionally, on the days of *Jia-yin* and *Yi-mao* in the first and second months, write in azure ink on paulownia wood, nine inches wide and twelve inches long. Bury it nine feet deep at the Eastern Marchmount of one’s dwelling. *Jia* and *Yi* occur only once a year; thus, perform this ritual once every three years, not annually. However, the visualization and ingestion should follow the seasonal nodes, and after nine years, the response will invariably descend.\n\nThis is also called the *White Feather Central Grove Flying Heaven Nine Talismans*, or the *Nine Transformations, Three Unions, Becoming One*. Those who behold its scripture attain the same Perfection as the Five Emperors.\n\nOn the day of burying the talisman, face east and strike the teeth thirty-six times. Visualize azure *qi* clouds crowning a mountain, filling the space above and below in dense obscurity.\n\nThe Lord of the Eastern Marchmount, Mount Tai, rides a nine-colored dragon, wielding a jade-green feathered banner, accompanied by twelve Immortal Officials of Mount Tai. Within the azure *qi*, they oversee and reflect upon the adept’s body. Recite while looking upward:\n\n*\"Heaven communicates with earthly principles,\nThe two *qi* merge with the Perfected.\nNine crimson yang luminaries,\nFour seasons unfold in order.\nAbove, the Five Emperors open,\nThe Eastern Marchmount, Mount Tai.\nBelow, proclaim to the myriad spirits,\nThe boundless deities.\nExpunge my past transgressions,\nRecord this chapter of mine.\nEradicate demonic trials,\nEnable my ascension as an Immortal.\nBestow honors upon the numinous Marchmount,\nMerge with *qi* in mist.\nSummon clouds and descend rain,\nFly through azure skies in a chariot.\nAscend into the Mysterious Void,\nBefore the August Emperor.\"*\n\nConclude by burying the talisman as prescribed, then draw in and swallow the azure *qi* thirty-six times.\n\nThe Lord of the Eastern Marchmount, Mount Tai, regularly on the day of *Chunfen* (Spring Equinox), presents the registers of Perfected Immortals who have attained the Dao and those newly studying it, reporting to the August Emperor Lord on High to review the Mysterious Names.\n\nTo cultivate the Dao of Flying Immortals, on that day at the hour of *Chen* (7–9 AM), bathe, fast, burn incense, and enter the chamber. Face east and visualize the Lord of the Eastern Marchmount, Mount Tai: surnamed Xuanqiu, personal name Mulu, wearing the Three Treasures Nine Radiance Night Crown, clad in azure feathered skirts and a nine-colored patterned robe, bearing the Supreme August Life-Spirit Seal. He rides a flying chariot of azure clouds drawn by nine azure dragons, accompanied by twelve Immortal Officials, each holding the Five Sacred Fungi. They circle northeast, ascending to the boundless heights of the Jade Clarity Heaven, wandering within the azure clouds of the Mysterious Void.\n\nRecite while striking the teeth nine times:\n\n*\"Today, at the supreme seasonal node,\nEight vows unfold anew.\nMay the divine melody revolve,\nDescend to my realm.\nReceive my supplications,\nPresent my petitions.\nInscribe my name in the Jade Registers,\nRank me in the Purple Chapters.\nMay the Dao Lord reflect upon me,\nThat I attain Upper Immortality.\"*\n\nConclude the visualization as the Lord of Mount Tai descends in his chariot, azure *qi* billowing densely to fill the chamber. He stands within the azure *qi*, holding a green bamboo slip, inscribing the adept’s name upon it. Softly recite:\n\n*\"Jade Perfected wandering,\nRadiant in the East.\nRiding dragons, driving chariots,\nFlying through the Great Void.\nRevolving numinous melodies,\nDescend to my chamber.\nAzure yang proclaims the beginning,\nSupreme vows unfold.\nReceive my petitions,\nExpunge transgressions, record merits.\nInscribe my name on the green bamboo slip,\nPresent it to the August Emperor.\nThe Western Tortoise binds the records,\nThe Eastern Flower engraves the directions.\nFive Numinous Ones assist,\nEight Emperors shine together.\nBearing Jia, riding Yi,\nExiting Wood to enter emptiness.\nSix Ding spirits attend,\nJade maidens support.\nCommand mountains, summon seas,\nGovern dragons.\nWhistle to summon wind, raise clouds,\nAll obeys instantly.\nHeavenly demons submit to trials,\nMyriad spirits revere and follow.\nTransform the luminous body,\nAscend to the Jade Palace.\nYearly offerings at Mount Tai,\nEternal preservation without end.\"*\n\nWhen finished, raise the head and swallow the nine qi to conclude.\n\nAfter nine years of cultivation, the Lord of Mount Tai will manifest before the practitioner, descending upon clouds of azure qi, bestowing nine divine youths and naturally occurring spirit-mushrooms, enabling knowledge of affairs ten thousand *li* to the east. After eighteen years, one attains a dragon chariot, riding the void to ascend to the Jade Pure Palace.\n\n**Southern Marchmount’s Red Emperor: Internal Contemplation of Bing-Ding Entering Fire, Three Qi Mottled Talisman**\nThe Red Emperor of the South, surnamed Yan, personal name Dongdan, wears a precious crown of three qi and dark beams, a crimson cloud-brocade robe with cinnabar-patterned skirts, bears the Southern Culmen’s talisman for restraining yang, and girds the Eight Radiance Sword of the Vermilion Palace. On the day of *Lixia* (Beginning of Summer), he rides a chariot of scarlet mist-wheels, accompanied by twelve Jade Maidens of Great Cinnabar, each mounted on nine-colored phoenixes and holding the three qi blossoms of solar essence. They roam Mount Heng of the Southern Marchmount, reviewing the registers of perfected ones and immortals, as well as the names of learners, then proceed to the Water Emperor and Divine King of the Southern Sea to audit the merits, transgressions, and faults of those who study the Dao. Upon returning, they descend to the bodies of those who bear the talisman.\n\nLearners who ingest this talisman summon its spirit, visualize its qi to draw down its authenticity, erase their names from the Water Emperor’s records, and inscribe them in the jade registers. At high noon on *Lixia*, bathe, purify, and fast, then enter the chamber to burn incense. Ingest the Bing-Ding Entering Fire Three Qi Mottled Talisman, knock the teeth thrice, and visualize the Red Emperor’s personal name and attire, his scarlet mist-wheel chariot descending into one’s chamber. Scarlet qi blazes, filling the room and encircling one’s form. Visualize the Emperor within the scarlet qi transforming into the Radiant Deluder Star, its brilliance illuminating as it descends from the crown of the head into the body, its light pervading the heart’s palace. Draw in qi and swallow thrice, feeling the body suffused with warmth. Soon, the Radiant Deluder Star disperses from the heart into scarlet qi, exiting through the nine orifices and reuniting above the crown to form a scarlet cloud. Sense the body within this cloud, ascending with it. After a long while, the perception stabilizes, as if treading emptiness. Raise the head and pray:\n\n*\"Three qi return to the origin,\nSoaring to the Nine Purities of Heaven.\nWhite feathers in the central grove,\nEntering the subtle and numinous.\nGirded with Bing’s radiance,\nRiding fire to enter Ding.\nCentral perfection merges as one,\nTransforming into the luminous star above.\nCommanding the ten thousand qi,\nSealing mountains and summoning spirits.\nTalismans bind the nine rivers,\nTwelve water spirits.\nErasing the nine yin,\nNames from the old registers.\nRaising clouds, descending dragons,\nCrimson chariots of the cinnabar heavens.\nEight effulgences swiftly traverse the void,\nFlowing fire darkens the gloom.\nFlying wheels and purple canopies,\nConvey my form,\nTreading the void, stepping the floating.\nAscending to the Jade Court,\nReceiving refinement in the Cavern Yang.\nFive spirits shine brightly,\nEternally enjoying celestial longevity,\nMerging with the Emperor.\"*\n\nWhen finished, knock the teeth nine times and swallow saliva twelve times to conclude.\n\nAfter nine years of practice, one can inscribe talismans and cast them into forests, which spontaneously ignite; cast them into water, and dragons surface; cast them into mountains, and clouds and rain descend. Bearing the talisman, one enters fire unscathed. Burying it at the Southern Marchmount secures immortal officials to attend and guard the body. After eighteen years, one can fly and ascend to the Jade Pure Palace.\n\nRevealing this Dao lightly brings calamity upon seven generations, consigning the body to the offices of ghosts, eternally confined in earth prisons, barred from attaining immortality.\n\n**The Supreme Bing-Ding Entering Fire Three Qi Mottled Talisman** is written in vermilion. Ingest it at high noon on *Lixia*, facing south, with prayers as above. Additionally, on *Bingwu* or *Dingwei* days in the fourth or fifth month, write it in vermilion on paulownia wood, eight *cun* wide and one *chi* two *cun* long, and bury it eight *chi* deep at the Southern Marchmount of one’s dwelling. *Bing* and *Ding* share a single day; perform this burial once every three years, not annually. Merely visualizing, ingesting, and practicing according to the seasons for nine years will ensure the Red Emperor and the Lord of Mount Heng manifest before the practitioner.\n\nThis is called the **Threefold Union Attaining Dao Nine Perfected Middle Talisman**, also known as the **Ninefold Union Entering Subtle Dark Void Seven Transformations**. Those who behold its script attain the perfection of the Five Emperors and ascend as immortals.\n\nWhen burying the talisman, face south, knock the teeth twenty-four times, and visualize scarlet qi clouds crowning a mountain. The Lord of Mount Heng of the Southern Marchmount rides a cloud chariot drawn by scarlet dragons, holding a vermilion feathered tally, accompanied by twelve immortals of Mount Heng within the scarlet qi, overseeing the practitioner’s body. Raise the head and pray:\n\n*\"Cinnabar numen, Cavern Yang,\nAbove governing Heaven’s Conjunction.\nNine transformations, three unions,\nThus forming the Dao’s palace.\nScarlet effulgent talisman,\nMight ruling the ten thousand directions.\nToday, the supreme tally,\nThree qi open the passage.\nConnecting the Five Emperors above,\nAnnouncing the script to the numinous peak.\nErasing my past debts,\nInscribing my name in the August Emperor’s registers.\nMay my Dao be accomplished,\nTransforming the mysterious void.\nSealing the numinous marchmounts,\nSummoning the sea and commanding dragons.\nRaising clouds, descending rain,\nAll directions instantly obey.\nFlying through the heavens in scarlet wheels,\nAscending to the Emperor’s chamber.\nEight qi merge with effulgences,\nThree origins shine together.\"*\n\nWhen finished, bury the talisman as prescribed, then raise the head and swallow scarlet qi twenty-four times to conclude.\n\nThe Lord of Mount Heng of the Southern Marchmount, on the summer festival day, presents the registers of perfected immortals, those who have attained the Dao, and beginners to the Supreme Emperor, reviewing the mysterious names and distinguishing merits from faults.\n\nTo cultivate the Dao of flying immortality, at noon on that day, bathe, purify, and fast, then enter the chamber to burn incense. Face south and visualize the Lord of Mount Heng, surnamed Yan, personal name Yangguang, wearing an Eight Brilliances Precious Radiance Jade Crown, a crimson brocade flying skirt, and a divine radiance crimson-patterned robe, bearing the talisman for sealing spirits and restraining demons. He rides a scarlet mist flying wheel, accompanied by twelve immortals of the Southern Marchmount, each mounted on flying phoenixes and holding spirit-mushrooms. They circle the southeast, ascending to the boundless heights of the Jade Pure Heaven, roaming the void within scarlet clouds.\n\nAt this moment, strike the teeth three times and silently recite: \"Today is most auspicious, the perfect hour for perfected beings. May the mysterious vow descend universally, renewing all beneath heaven. I beseech the Dao Lord to turn and send down the flying immortals, their feathered canopies descending upon my body. As the Dao Lord descends, I become an imperial minister, my name inscribed in the Upper Clarity, my destiny bound to the Eastern Flower.\"\n\nWhen finished, visualize the Lord of Mount Heng riding his scarlet mist flying wheel, descending into your chamber. Crimson qi billows densely, filling the room. The Lord stands amidst the crimson qi, holding a vermilion tablet, inscribing your name upon its register. He softly intones:\n\n\"Vermilion guts ride the dawn, circling the Nine Heavens.\nCinnabar chariot and flying canopy, radiant through the rosy void.\nCurving downward to illuminate, overseeing my heart’s devotion.\nAll vows I present shall move the unseen.\nUnfurl the numinous guard, body and spirit in communion.\nInscribe my name on the Cinnabar Terrace, bind my script to Southern Jade.\nSix Bing days escort the perfected, riding Ding to enter the whirlwind.\nCommand mountains and seal seas, restrain the myriad calamities.\nA thousand spirits cower, all demons disperse.\nAs the Southern Marchmount is grasped, the Three Origins summon me.\nDescend with the vermilion carriage, ascend into the imperial court.\nThe Three Luminaries unite in power, outlasting heaven’s decay.\"\n\nWhen finished, raise your head and swallow the qi three times to conclude.\n\nPractice this for nine years, and the Lord of Mount Heng will bestow upon you a treasure script, along with eight immortal officials, and grant rare spirit-mushrooms and wondrous objects, enabling you to know all affairs within ten thousand *li* of the south.\n\nPractice for eighteen years, and you will attain the scarlet cloud wheel, soaring through the great void to ascend to the Jade Pure Palace.\n\n---\n\n**Western Marchmount White Emperor: Ingesting Metal Qi of Geng and Xin, the Seven Qi Talisman**\n\nThe Western White Emperor, surnamed Hun, personal name Rugui, wears a Seven Qi Bright Radiance Precious Crown, a white brocade cloud-light robe and plain silk flying skirt, and bears a jade-white divine sash and a dragon-tide-drooling sword.\n\nOn the day of the Beginning of Autumn, he rides a plain cloud flying chariot, accompanied by twelve Jade Maidens of Great Simplicity. Each holds a seven-colored flower banner, and they roam the Western Marchmount Mount Hua, reviewing the registers of perfected beings and immortal officials, as well as the names of disciples. At times, they visit the Water Emperor and Divine King of the Western Sea to examine the merits, faults, and transgressions of those who cultivate the Dao. They then descend to bestow talismans upon the practitioners.\n\nDisciples who ingest this talisman to summon the deity should visualize the qi to attract the true essence, erasing their names from the Water Emperor’s tablets and inscribing them upon the jade registers.\n\nOn the day of the Beginning of Autumn at dusk, bathe, purify, and fast, then enter the chamber to burn incense. Ingest the *Geng-Xin Entering Metal Seven Qi Talisman*, strike the teeth three times, and visualize the Western White Emperor’s name and attire, his form and colors. See him riding a purple cloud flying chariot, descending into your chamber. White qi shimmers brilliantly, filling the room and encircling your body.\n\nVisualize the Emperor within the white qi transforming into the Great White Star, blazing with radiance. It descends from the crown of your head into your body, its light illuminating the space between your lungs. Then draw in the qi and swallow it seven times, feeling your body grow warm. Soon, the Great White Star within your lungs scatters into white qi, emerging from the nine orifices and reuniting above your head, forming a white cloud. Feel your body within the cloud, ascending with it. After a long while, the sensation stabilizes, as if treading empty space. Raise your head and intone:\n\n\"Seven qi fly as essence, Western Flower’s metal spirit.\nDragon transforms the nine paths, all things arise of themselves.\nSun and moon pass in measure, flying feathers traverse the dark.\nMysterious void and profound truth, three unite and seven complete.\nTransformation enters the luminous, Xin turns the radiant star.\nThe Emperor’s name and talisman merge, transforming my form.\nI uphold the imperial might, commanding divine soldiers.\nRestrain mountains and inspect seas, seal peaks and command spirits.\nAll perfected beings come, receiving duties at my court.\nSummon clouds and raise rain, descend with the plain carriage.\nNine dragons and seven tigers, driving the Six Ding.\nHasten my flying tiger, exiting the mysterious and entering the azure.\nAscend to the vermilion moon, gold refines and brightens.\nRoam the Flowery Hall, eternally preserving the celestial scriptures.\"\n\nWhen finished, strike the teeth seven times and swallow saliva thirty-two times to conclude.\n\nPractice this for nine years, and you will be able to inscribe your name upon stone, refine stone into gold, and cast talismans into stone to conceal your form. Cast talismans into mountains, and they will send down plain clouds; cast them into water, and dragons will rise from the depths. Bury talismans in the Western Marchmount, and immortal officials will be granted, bestowing natural and wondrous objects.\n\nAfter eighteen years of practice, you will be able to ride the void and ascend to the Jade Pure Heaven.\n\nRevealing this Dao lightly will incur punishment by divine soldiers. Your seven generations of ancestors will suffer torment, bound to serve as ghost officials. Guard this secret in your cultivation, and you shall attain the rank of highest immortal.\n\n---\n\n**The Supreme Geng-Xin Entering Metal Seven Qi Talisman**\nWrite in vermilion. On the day of the Beginning of Autumn at dusk, face west and ingest it, reciting the incantation as above.\n\nAlso, on the days of Gengshen and Xinyou in the seventh and eighth months, write in vermilion on paulownia wood, six *cun* wide and one *chi* two *cun* long. Bury it six *chi* deep in the Western Marchmount where you reside. Geng and Xin occur only once a day; bury it once every three years, not annually. Simply visualize, ingest, and practice according to the proper times. After nine years, the White Emperor and the Lord of Mount Hua will descend without fail to appear before you.\n\nThis is also called *Nine Subtleties Entering the Spirit and Sealing the Numinous*, or *Red and White Self-Generating Seven Transformations Golden Gate*. Those who obtain this Dao will have the Queen Mother of the West descend in truth, myriad transformations instantly accomplished, and ascend to the ranks of imperial spirits.\n\nWhen burying the talisman, face west and strike the teeth twelve times. Visualize white qi clouds crowning a mountain, and the Lord of Mount Hua riding a white dragon cloud chariot, holding a seven-colored flying feathered staff. Accompanied by twelve immortal officials of Mount Hua, they stand within the white qi, overseeing and illuminating your body. Raise your head and intone:\n\n\"Six qi circle in spirit, three unite as one.\nFive clouds transform, turning nine and seven.\nThe Emperor’s honor merges, spirit born in the golden chamber.\nAt this time, what time is it? The day of my highest vow.\nAll I seek shall be most auspicious.\nCommand spirits and summon deities, all demons follow in destruction.\nEight paths scatter in brightness, my true self serene.\nThe Five Marchmounts bow in reverence, completing the audience with the Emperor.\"\n\nWhen finished, bury the talisman as prescribed, then look upward and swallow white qi twenty-four times to conclude.\n\nOn the autumn equinox, the Lord of Mount Hua presents to the Supreme High Emperor a register of perfected immortals who have attained the Dao, along with the names of those newly embarked on the path. He examines their mystical names and distinguishes their merits and transgressions.\n\nTo cultivate the way of flying immortality, on that day at dusk, bathe, purify, and enter the chamber to burn incense. Face west and visualize the Lord of Mount Hua, whose surname is Haoqiu and whose given name is Yuancang. He wears a six-fold spirit-communing flying crown, a white brocade flying skirt, and a plain silk robe, girded with an intertwined spirit-silk sash. Riding a cloud-borne flying wheel, accompanied by the twelve immortal officials of Mount Hua—each mounted on a white tiger and holding a seven-colored floral banner—they circle to the southwest, ascending to the boundless Jade Purity Heaven, drifting amidst the void within white clouds.\n\nStrike the teeth seven times and silently intone: \"I vow to become a flying immortal, to ascend to Jade Purity, to soar into Mount Hua, and to share the numinous power of the Emperor. I beseech the Dao Lord to descend my true form, to grant me immortality, and to inscribe my mystical name.\"\n\nWhen done, visualize the Lord of Mount Hua descending to your chamber in a white-cloud flying wheel, white qi resplendent, filling the room. He stands within the white qi, holding a white tablet, and inscribes your name upon its surface. Softly intone:\n\n\"Golden gates gleam bright, white clouds tower high.\nFour gatherings merge in truth, eight qi weave their net.\nAuspicious dawn is proclaimed, the Emperor’s spirit ascends in mist.\nTurn and descend in spirit, graciously regard my home.\nInscribe my name upon the white tablet, record it in the Western Hua.\nThe Seven Perfected and host of immortals command and restrain demons,\nUphold the August Might, govern mountains and rivers,\nSummon clouds and send down rain, dragon wheels swiftly pass.\nConvey me through the void, ascending to the Numinous Mound.\nWhat I desire is instantly achieved, what I sever is at once undone.\nA thousand transformations, ten thousand changes, penetrating the radiance of the mystical mist.\"\n\nWhen finished, look upward and swallow qi seven times to conclude. After nine years of practice, the Lord of Mount Hua will bestow upon you the elixir of immortality and assign seven immortal youths. In nine years, you will comprehend affairs a myriad miles to the west and discern the omens of fortune and misfortune. After eighteen years, a white-cloud wheel will descend, enabling you to soar through the great void and ascend to the Jade Purity Palace.\n\n**Northern Marchmount Black Emperor: Ingesting Ren-Gui Water Qi and the Five Qi Talisman**\n\nThe Black Emperor of the North, whose surname is Xuan and whose given name is Shuomeng, wears a five-qi dark-morning crown, a black brocade robe with a five-colored flying skirt, a seven-fold flowing bell, and a spirit-communing sword inscribed with talismanic patterns.\n\nOn the day of the beginning of winter, he rides a dark-cloud flying chariot, accompanied by the twelve Jade Maidens of Great Mystery, each mounted on a flying turtle and holding a five-colored floral banner. They traverse the Northern Marchmount Mount Heng, reviewing the registers of perfected immortals and immortal officials, as well as the names of learners. At that time, they visit the Water Emperor and Spirit King of the Northern Sea to assess the merits, transgressions, and faults of those cultivating the Dao, then descend to the practitioner’s body.\n\nLearners ingest the talisman to summon the deity, visualize the qi to attract the true essence, and erase their names from the Water Emperor’s tablet, inscribing them instead upon the jade register.\n\nOn the night of the beginning of winter at midnight, bathe, purify, and enter the chamber to burn incense. Ingest the *Ren-Gui Water Qi Five Qi Talisman*, strike the teeth five times, and visualize the Black Emperor’s given name and style, his attire and form. See him riding a dark-cloud flying chariot descending to your chamber, black qi surging, filling the room and encircling your form.\n\nVisualize the Emperor within the black qi transforming into the Chen Star, radiant and luminous, descending from your crown into your body, its brilliance illuminating the region of the kidneys. Then draw in qi and swallow five times, sensing your body suffused with warmth. After a moment, the Chen Star within the kidneys scatters into black qi, exiting through the nine orifices and reuniting above your crown to form a black cloud. Feel your body within the black qi, ascending with the cloud. After a long while, the sensation stabilizes, as if treading empty space. Look upward and intone:\n\n\"Five spirits commune with truth, transforming qi into vast yang.\nSeven origins revolve in spirit, shining in the north.\nThe August Emperor proclaims his decree, the eight nodes govern radiance.\nAbove, he oversees the myriad immortals; below, he commands the boundless.\nRiding qi through the void, descending to my chamber,\nHe bestows upon me the dark talisman, its transformations flowing freely.\nBearing *ren* to enter the cavern, carrying *gui* to ascend the sky,\nSealing and commanding the Five Marchmounts, governing the nine rivers,\nSummoning mountains and invoking rain, talismanic waters ascend the dragon.\nFlying chariots and purple canopies ascend to the Emperor’s palace.\"\n\nWhen finished, strike the teeth five more times and swallow saliva eighteen times to conclude. After nine years of practice, you will be able to inscribe talismans and cast them into water, causing dragons to halt their flow and waves to still. Entering water will be like traversing empty space. Burying talismans in the Northern Marchmount will summon immortal officials to descend and bestow the elixir of immortality. After eighteen years, you will be able to sit in disappearance, ride the void in flight, and ascend to Jade Purity. This Dao is lofty and wondrous; it is not transmitted to the untrue. Those who lightly divulge its sacred texts will cause their seven ancestors to bear suffering, their bodies to be consigned to the offices of ghosts, and themselves to remain eternally as prisoners of the dark. They will never again attain immortality.\n\nThe *Supreme Ren-Gui Water Qi Five Qi Talisman* is written in cinnabar. On the night of the beginning of winter at midnight, face north to ingest it, reciting the incantation as above. Additionally, on *renzi* and *guihai* days in the tenth and eleventh months, write in cinnabar on paulownia wood, five inches wide and twelve inches long, and bury it five feet deep in the Northern Marchmount where you reside. *Ren* and *gui* occur only once a day; thus, perform this rite once every three years, not annually. Simply visualize, ingest, and practice in accordance with the seasonal nodes. After nine years, the Black Emperor and the Lord of Mount Heng will descend and appear before you. This is also called *Intersecting Ascension Cloud Gate Seven Transformations Five Unions* and *Five Spirits Dark Yin Central Dao of the Myriad Completions*. Those who obtain this text will swiftly achieve the Dao of immortality. Practicing it transforms one’s luminous form, enabling flight and ascent to the Purple Purity.\n\nWhen burying the talisman, face north and strike the left teeth twenty-four times. Visualize clouds of black *qi* crowning a mountain peak, with the Lord of Mount Heng of the Northern Marchmount riding a cloud chariot drawn by a black dragon, holding a five-colored feathered staff of flying immortals. Accompanied by twelve immortal officials of Mount Heng, they oversee and illuminate your form within the black *qi*. Look up and pray:\n\n*\"Dark Warrior intersects and ascends,\nFive transformations complete the spirit,\nThree unions and nine departures\nConverge at the Jade Gate.\nEight vows fulfill the upper nodes,\nI partake of their immortality.\nPacify *qi* and stabilize the numinous,\nThe Five Marchmounts protect and command.\nRiding the void and summoning emptiness,\nMyriad demons come to my body.\nDescend with cloud chariots,\nDark carriages and purple chariots,\nSoaring through the great void,\nAscending to the Imperial Dawn,\nForever with the Northern Lord,\nPreserving life and celestial perfection.\"*\n\nConclude, then bury the talisman as prescribed. Inhale and swallow the black *qi* twenty-four times to finish.\n\nThe Lord of Mount Heng of the Northern Marchmount regularly presents, on the Winter Solstice, a register of perfected immortals and those newly embarking on the Dao to the Supreme Emperor, reviewing their celestial names and distinguishing merits from transgressions.\n\nTo practice the Dao of flying immortals, on that day at midnight, bathe, purify, and enter the chamber to burn incense. Face north and visualize the Lord of Mount Heng, surnamed Fu, named Tongmeng, wearing a five-*qi* treasure dawn jade crown, clad in a black brocade flying skirt and a dark patterned luminous robe, girded with an intertwining numinous purple sash. Riding a dark rosy-cloud flying wheel, with twelve officials of the Northern Marchmount each mounted on flying turtles and holding five-colored floral banners, they circle the northwest, ascending to the boundless Jade Purity of Heaven, wandering amidst the emptiness within the dark clouds.\n\nStrike the teeth five times and silently recite: *\"Today is most auspicious,\nThe eight nodes return in cycle,\nThe Dao Lord descends in turn,\nGazing upon my form,\nOverseeing the register of life,\nForever preserving celestial years.\"*\n\nConclude, then visualize the Lord of Mount Heng descending to your chamber in a black rosy-cloud flying wheel, black *qi* surging and filling the room. Within the black *qi*, the Lord holds a purple tablet, inscribing your name upon its pages. Softly pray:\n\n*\"Dark Yin returns the numinous,\nRiding the sun and governing the dawn,\nFive *qi* gather the perfected,\nUniversally governing the host of immortals.\nPacify the luminous upper palace,\nWandering amidst the cloud array,\nDescend in turn to oversee and illuminate,\nEntering my chamber.\nInscribe my name on the dark tablet,\nRecord it in the jade register above,\nGrant me penetrating clarity,\nThoroughly entering perfection.\nCommand the Five Numinous,\nSeal rivers and summon mountains,\nDescend dragons and summon rain,\nGuide clouds and raise mist,\nRide the light wheel through the clouds,\nAscending into the Imperial Dawn.\"*\n\nConclude, then inhale and swallow the *qi* five times to finish.\n\nPractice this for nine years, and the Lord of Mount Heng will descend to you with a dark dragon cloud chariot, assigning five immortal officials to summon the divine medicines of the Northern Perfected. You will clearly perceive future events in the north, discerning auspicious and inauspicious omens. After eighteen years of practice, you will soar to the Upper Clarity, jointly preserving jade perfection with the Emperor of the Northern Marchmount.\n\n**Central Marchmount Yellow Emperor’s Internal Visualization of Earth *Qi* and the Talisman of the Cyclic Branches Wu and Ji**\n\nThe Yellow Emperor of the Central Marchmount, surnamed Ma, named Zhongshen, wears a yellow dawn jade crown piercing the heavens, a yellow brocade robe with a dark yellow flying-cloud brocade skirt, carries the Yellow Emperor’s Yueyuan tally, and is girded with a numinous flying purple sash.\n\nOn the day of the Great Year Star, he rides a yellow-cloud flying chariot, accompanied by twelve Yellow Essence Jade Maidens, each mounted on twelve flying scaled creatures and holding five-colored imperial floral banners. They traverse the Central Marchmount, Mount Song, reviewing the registers of perfected immortals and celestial officials, as well as the names of learners. They visit the spirit kings of the Three Rivers, Four Seas, and Twelve Waters to assess the merits, transgressions, and faults of Dao practitioners, then descend to the bodies of those wearing the talisman.\n\nLearners ingest the talisman to summon its spirit, visualize its *qi* to descend its perfected essence, and inscribe their names on the water emperors’ tablets, recording them in the jade registers.\n\nOn the day of the Great Year Star at midday, bathe, purify, enter the chamber, and burn incense. Ingest the talisman of the Earth *qi* of Wu and Ji, strike the teeth twelve times, and visualize the Yellow Emperor of the Central Marchmount—his name and taboo, attire, and appearance. See him riding a yellow-cloud flying chariot descending to your chamber, yellow *qi* billowing and filling the room, encircling your form.\n\nVisualize the Emperor within the yellow *qi*, transforming into the Star of Stability, radiant and luminous, descending from your crown into your body, its brilliance illuminating the region of the spleen. Inhale and swallow the *qi* twelve times, feeling your body suffused with warmth. Soon, the Star of Stability within the spleen disperses into yellow *qi*, exiting through the nine orifices, converging and returning above your crown to form a yellow cloud. Feel your body within the yellow cloud, ascending with it. After a long while, the sensation stabilizes, as if treading upon emptiness.\n\nLook up and pray:\n\n*\"Central Numinous Yellow Origin,\nTwelve flying essences,\nFive *qi* blend and transform,\nThe August Emperor thoroughly illuminates.\nToday is most auspicious,\nGathering and governing the myriad numinous,\nReviewing registers and tallying records,\nErasing sins and dissolving karmic bonds.\nReturning the perfected and flowing gaze,\nDescend in turn to my court,\nSever my death,\nInscribe my name on the purple tablet,\nAssist my great perfection,\nGrant me divine soldiers,\nRectify and command the Five Marchmounts,\nSeal mountains and summon spirits,\nAnnihilate the host of demons,\nPurify my Dao.\nRiding Wu and bearing Ji,\nThoroughly entering formlessness,\nRaising clouds and descending rain,\nSoaring through the clouds in a purple chariot,\nAttaining tranquility with the Five Marchmounts,\nMerging with the Emperor.\"*\n\nConclude, then strike the teeth twelve times and swallow the *qi* twelve times to finish.\n\nPractice this for nine years, and you will understand the languages of the thirty-six nations and perceive the forms and colors of the thirty-six Earth Emperors beneath the ten thousand abysses. Write talismans and grasp jade, your form merging with earth. Bury the talisman in the Central Marchmount, and the twelve Yellow Essence Jade Maidens will bring the natural kitchen and the elixir of immortality.\n\nAfter eighteen years, you will be able to fly through the dark void and ascend to the Jade Purity.\n\nGuard this as a divine immortal secret. Revealing it lightly will bring nine generations of ancestors to trial, and you will bear the three faults, condemned to the nether darkness.\n\n**The Supreme Talisman of Earth *Qi* of Wu and Ji**\nWrite in cinnabar. On the day of the Great Year Star at midday, face the four seasons and ingest it, praying as prescribed above.\n\nMoreover, on the days of *wuchen*, *wuxu*, *jichou*, and *jiwei* in the third, sixth, ninth, and twelfth months, write in cinnabar upon paulownia wood, making the talisman three *cun* wide and one *chi* and two *cun* long. Bury it at the center of your dwelling, one *chi* and two *cun* deep. Perform this once on a single day of each season, repeating the rite every three years—not annually. Simply maintain visualization and ingestion, following the prescribed days. After nine years, the Lord of Mount Song Gao of the Yellow Emperor will descend without fail to manifest before you.\n\nThis is called *Xuan Zhen Zong Hui Zi Sheng Wan Du* (\"Mystic Perfection’s Radiance, Self-Generating Myriad Transformations\"), also named *Shen Fei Jiu Dao Ling Bian Zi Ran* (\"Divine Flight through the Nine Paths, Wondrous Transformation by Nature\"). Those who attain this Dao will immediately ascend to the Cloud Palace.\n\nWhen burying the talisman, face the four seasons, knock the teeth twelve times, and visualize a cloud of yellow *qi* descending like a mountain to crown your head. The Lord of the Central Marchmount rides a cloud chariot drawn by a yellow dragon, wielding a twelve-jointed banner of dark and yellow, accompanied by twelve immortals of Mount Song Gao. They stand within the yellow *qi*, overseeing your form. Raise your gaze and pray:\n\n*\"Three Pure Ones, streaming gales,\nFive-fold coils of yellow cloud,\nDao harmonizes myriad changes,\nMystic void uplifts the true.\nSpirits settle on the sacred peak,\nDao descends into my body.\nYellow and white divide early,\nMy name inscribed in the Purple Register.\nSeal the mountains, summon the rivers,\nCommand the host of immortals.\nSummon clouds, descend rain,\nYellow auroras, flying wheels.\nStride the void, tread the mystic,\nAscend to the lofty morn.\"*\n\nWhen finished, bury the talisman as prescribed and swallow twelve breaths of yellow *qi*.\n\nThe Lord of the Central Marchmount and Mount Song Gao, on the days of *wuchen*, *wuxu*, *jichou*, and *jiwei* in the third, sixth, ninth, and twelfth months, presents the names of perfected immortals and those newly embarked on the path to the Supreme Emperor on High. He examines the records of the mystic names, distinguishing merit from transgression. To cultivate the Dao of flying immortality, on these days at midday, bathe, purify yourself, and enter your chamber to burn incense. Face the four seasons and visualize the Lord of the Central Marchmount, surnamed Jiao, named Pusheng, wearing a Jade Crown of the Yellow Dawn of the Middle Prime, clad in a yellow brocade flying skirt and a dark-yellow patterned robe, bearing the seal of the Yellow Divine Central August. He rides a flying wheel of yellow aurora, accompanied by twelve immortals of the Central Marchmount, all mounted on flying *lin* beasts, wielding twelve-jointed banners of dark and yellow. They circle to the southwest, ascending to the Jade Purity Palace upon the boundless heights, drifting through the empty void within the yellow clouds.\n\nKnock your teeth twelve times and silently intone:\n\n*\"Heaven suspends its highest vow,\nI receive its grace.\nYearning for the void, descending spirits,\nThoughts subtle, attaining immortality.\nLord of the Central Marchmount,\nBind me to your chariot.\nLet me fly and ascend,\nReach the Gate of Gold.\"*\n\nWhen finished, visualize the Lord of Mount Song Gao descending in his flying wheel of yellow aurora to your chamber. Yellow *qi* surges forth, filling the room. The Lord stands within the yellow *qi*, holding a yellow tablet, inscribing your name upon it. Softly pray:\n\n*\"Yellow numen, central mystery,\nDao veils the purple heavens.\nThree unite as one,\nBinding the void to become immortal.\nGrasp the register, preserve the record,\nSecure destiny, extend the years.\nInscribe my name in Eastern Florescence,\nRecord the immortal in the Central Qin.\nFive numina oversee and reflect,\nRefining my Dao to brilliance.\nEmerge from the void, enter the subtle,\nPierce the nine mysteries.\nBody born of water and fire,\nTransforming scenes by the myriad thousands.\nStride the void, tread the empty,\nFly without hindrance.\"*\n\nWhen finished, swallow twelve breaths of *qi* and cease.\n\nAfter nine years of cultivation, you will converse face-to-face with the Lord of the Central Marchmount, who will descend to bestow upon you a flying chariot drawn by a yellow dragon and appoint you as an immortal official, granting you natural treasures for your body. After eighteen years, the Dao will be perfected, and you will ascend as a flying immortal to the Jade Purity.\n\n**Method for Erasing Sins and Removing Names from the Registers by Meditating on the Water Emperors of the Four Seas**\n**The Supreme Nine Red Talismans for Sealing the Seas and Communicating with the True**\n**Talisman of the Nine Sources of Green *Qi* of the East Sea Water Emperor**\n**The Supreme Nine Primordial Green *Qi* Talismans**\n\nOn the days of *Lichun* and the Spring Equinox, at dawn, write in cinnabar upon green paper and ingest it facing east. After performing the rite, write the talisman in cinnabar upon paulownia wood, inscribing beneath it: *\"On such-and-such a year, month, and day, so-and-so, a master of the sacred peaks from such-and-such a prefecture, county, village, and hamlet, aged so many years, born in such-and-such a month.\"* Bind nine *liang* of green stone with green silk and place it beneath the talisman, then cast it into the eastward-flowing waters.\n\nOn these days, maintain purity and fast, enter your chamber to burn incense, face east, knock your teeth twelve times, and visualize the Divine King of the East Sea Water Emperor, surnamed Wang, named Duyuan. He wears a Precious Bright Crown of the Great Dawn, a flying skirt of green patterned kingfisher feathers, and a belt with a seven-colored lion-headed pouch. He rides a flying dragon-drawn jade carriage, accompanied by twelve immortal attendants of the East Sea Water Emperor, each mounted on a green dragon. They ascend to the High Emperor of the Jade Sovereign, drifting through the green clouds, then descend to your body. Green *qi* billows, darkening the inner and outer.\n\nThe Divine King sits before you, erases your death register, and inscribes your name in the immortal records. Softly pray:\n\n*\"Abyssal depths of nine sources,\nAscend to join the Jade Purity.\nDividing the two *qi*, flowing streams,\nMerging and harmonizing, born as one.\nAbove, govern the perfected,\nBelow, oversee the names of disciples.\nThis day is most auspicious,\nEight vows unite as one.\nThe Water Emperor erases sins,\nRecords merit to the highest spirits.\nThe Great Unity secures the years,\nPreserves life in yellow tranquility.\nForm joins the Nine Capitals,\n*Qi* responds to the divine essence.\nLeft, command the Heavenly Armor,\nRight, dispatch the Six Dings.\nSummon mountains, call forth seas,\nDescend chariots and dragon carriages.\nConvey me in flight,\nAscend to pay homage to the Three Purities.\nFeathered regalia, resplendent,\nGolden pendants, tinkling.\nDrifting, striding the void,\nRoaming the Purple Court.\nBelow, gaze upon the water palace,\nWaters receive my form.\nLet me endure forever,\nEqual in age to the kalpa.\"*\n\nWhen finished, ingest the talisman and swallow nine breaths of fluid. Then cast the talisman into the eastward-flowing abyss as prescribed.\n\nAfter eighteen years of cultivation, the Water Emperor will erase your sin register and report to the Jade Purity, descending a dragon carriage to traverse the great void. Your body will enter the ten-thousand-fathom abyss, where you will converse with the Water Emperor.\n\nThe Mysterious and Wondrous Dao must not be recklessly proclaimed.\n\n**Talisman of the Vermilion Qi from the Southern Sea Water Emperor’s Cavern Source**\nThe *Supreme Cavern Source Vermilion Qi Talisman* is to be inscribed in cinnabar on blue-green paper at noon on the days of *Lixia* (Beginning of Summer) or *Xiazhi* (Summer Solstice), then ingested while facing south. Upon completing the ritual, inscribe the talisman in cinnabar on paulownia wood, recording beneath it: *\"On the day of [year], [month], [day], [name], Master of the Sacred Peaks of [prefecture], [county], [village], aged [years], born in [month],\"* then affix the talisman. Bind eight ounces of red stone with red silk, attach the talisman, and cast it into southward-flowing waters.\n\nTo practice this Dao, on the appointed day, maintain a pure fast, enter the chamber, burn incense, face south, and knock the teeth twelve times. Visualize the Divine King of the Southern Sea Water Emperor, surnamed Kai, personal name Naling, crowned with the *Tai Chen Precious Radiance Diadem*, clad in a vermilion brocade flying skirt, girded with the *Intertwined Spirit Purple Sash* and nine-colored *Pan* pouch. He rides a scaled dragon, soaring upon cloud chariots, accompanied by the twelve immortal attendants of the Southern Sea Water Emperor, each mounted on twelve flying dragons. Ascending to the High August Jade Emperor, they drift amidst azure clouds before descending to my presence, where verdant qi swirls in darkness.\n\nThe Divine King sits before me, erases my sin register, and inscribes my name in the immortal ledger. Then recite the subtle invocation:\n*\"Vermilion Abyss of Nanyang, cavern springs of ten thousand valleys,\nThe Emperor pacifies and guards, governing all water immortals.\nExamining sin registers, recording merits in the Purple Dawn,\nAuspicious day, clear hour—guiding dragons and wielding mist.\nDrifting through the mysterious void, descending to my hall,\nMerging with qi, the Dao arises naturally.\nSubduing demons, dispelling spirits, sealing seas and mountains,\nThe Six Masters open the path, connecting me to water’s source.\nSummoning clouds, descending rain, whistling commands at my behest—\nAll wishes and petitions shall be fulfilled as spoken.\nSoaring to the Upper Clarity, paying homage to the Jade Dawn.\"*\n\nConclude by swallowing eight breaths of qi, then cast the talisman into the southward-flowing abyss as prescribed. After eighteen years of practice, the Water Palace will no longer hold a sin register in my name. The Divine King will present my name to the Jade Emperor, who will dispatch a cloud-dragon cinnabar carriage to traverse the great void. I shall ascend mountains, cross seas, with ten thousand spirits guarding my passage, penetrating the subtle and entering the mysterious, uniting with the Emperor in true essence. Those who recklessly divulge this sacred text shall be punished by the divine armies of the Five Emperors; those who keep it secret shall attain immortality.\n\n**Talisman of the White Qi from the Western Sea Water Emperor’s Cavern Abyss**\nThe *Supreme Cavern Abyss White Qi Talisman* is to be inscribed in cinnabar on blue-green paper at dusk on the days of *Liqiu* (Beginning of Autumn) or *Qiufen* (Autumn Equinox), then ingested while facing west. Upon completing the ritual, inscribe the talisman in cinnabar on paulownia wood, recording beneath it: *\"On the day of [year], [month], [day], [name], Master of the Sacred Peaks of [prefecture], [county], [village], aged [years], born in [month],\"* then affix the talisman. Bind six ounces of white stone with white silk, attach the talisman, and cast it into westward-flowing waters.\n\nTo practice this Dao, on the appointed day, maintain a pure fast, enter the chamber, burn incense, face west, and knock the teeth twelve times. Visualize the Divine King of the Western Sea Water Emperor, surnamed Dao, personal name Dongqing, crowned with the *Tai Chen Precious Radiance Diadem*, clad in a plain brocade flying skirt, girded with the *Plain Spirit Life Divine Seal* and nine-colored *Tiger-Head Pan* pouch. He rides a flying carriage, accompanied by the twelve immortal attendants of the Western Sea Water Emperor, each mounted on twelve white tigers, soaring through the mysterious void. Ascending to the High August Jade Emperor, they drift amidst the azure clouds of the mysterious emptiness before descending in true essence to my presence. The Divine King erases my sin register, inscribes my name in the immortal ledger, and presents it before the Jade Emperor.\n\nThen recite the subtle invocation:\n*\"Yang Valley ten thousand fathoms deep, cavern abyss of nine streams,\nTwelve imperial palaces, nine river lords,\nAbove governing the Jade Void, below presiding over the divine continent.\nOn this most auspicious day, the Divine King sets forth,\nHolding my life’s register, guarding my mysterious talisman.\nReturning true essence, bending light to descend to my dwelling,\nErasing my sin register, engraving it in celestial script.\nThe Dao arises naturally, ascending in the whirlwind’s cloud chariot,\nMerging with primordial auspiciousness, my body one with the Emperor.\"*\n\nConclude by swallowing six breaths of qi, then cast the talisman into the westward-flowing abyss as prescribed. After eighteen years of practice, I shall traverse the Western Sea, tread the ten-thousand-fathom abyss, with sea spirits guarding my passage, unbound by water’s constraints. A dragon carriage shall descend, soaring through the great void, while the water officials erase my sins and present my name to the Emperor. This Dao is lofty and wondrous, not practiced in the mundane world. Those who encounter this text shall attain immortality without study.\n\n**Talisman of the Black Qi from the Northern Sea Water Emperor’s River Cavern**\nThe *Supreme River Cavern Black Qi Talisman* is to be inscribed in cinnabar on blue-green paper at midnight on the days of *Lidong* (Beginning of Winter) or *Dongzhi* (Winter Solstice), then ingested while facing north. Upon completing the ritual, inscribe the talisman in cinnabar on paulownia wood, recording beneath it: *\"On the day of [year], [month], [day], [name], Master of the Sacred Peaks of [prefecture], [county], [village], aged [years], born in [month],\"* then affix the talisman. Bind five ounces of black stone with black silk, attach the talisman, and cast it into northward-flowing waters.\n\nTo practice this Dao, on the appointed day, maintain a pure fast, enter the chamber, burn incense, face north, and knock the teeth twelve times. Visualize the Divine King of the Northern Sea Water Emperor, surnamed Xi, personal name Yuanyuan, crowned with the *Tai Chen Precious Radiance Diadem*, clad in a dark brocade flying skirt, girded with the *Huo Luo Seven Primes* and five-colored *Tiger-Head Pan* pouch. He rides a black auroral flying carriage, accompanied by the twelve immortal attendants of the Northern Sea Water Emperor, each mounted on twelve flying turtles, roaming the mysterious void. Ascending to the High August Jade Emperor, they drift above the mysterious numinous, amidst swirling verdant qi, before descending in true essence to my presence. The Divine King erases my sin register, inscribes my name in the jade ledger, and presents it before the Jade Emperor of the Upper Clarity.\n\nThen recite the subtle invocation:\n*\"Heaven and earth divide their streams, the four rivers govern clarity,\nThree river water palaces, nine river imperial spirits.\nExamining registers, binding sins to the Four Luminaries—\nThose with Dao earn merit; those with transgressions face punishment.\nOn this most auspicious day, the Emperor’s light illumines my court.\nFlowing true essence returns, descending—my immortality is achieved.\nThree rivers and four seas guard my form,\nA thousand transformations, ten thousand changes—spoken, they arise at once.\nSoaring through the mysterious void, ascending to the Eight Darknesses,\nEternally preserving the Three Luminaries, heaven and earth in harmony.\"*\n\nConclude by swallowing breaths of qi, then cast the talisman into the northward-flowing abyss as prescribed. After eighteen years of practice, I shall ascend through the great void, traverse mountains and seas, with ten thousand spirits guarding my passage, attaining the subtle and entering the mysterious, uniting with the Emperor in true essence.\n\nUpon completion, raise your head and swallow the eight breaths of qi to stillness, then cast the talisman into the northern abyss of the North Sea as prescribed. After eighteen years of practice, summon the twelve Water Lords and Jiao-Dragons to command the waters and raise clouds, darkening the bright day. Soaring through the void, ascend to the Jade Purity.\n\nThis method is most profound—only the true may practice it. To violate its prohibitions or recklessly transmit it brings calamity and annihilation to one’s person, extending punishment through the Seven Mysteries. It is the secret of immortals alone.\n\nThe Supreme Nine Crimson-Striped Talisman is formed by weaving the soaring, mysterious purple qi into its script. The Supreme Perfected Lord seals the mountains and summons the peaks, governing the rivers and commanding the spirits. Its script penetrates the subtle, resplendent in the Highest Clarity.\n\nThe Primordial Heavenly King concealed it within the Jade Terrace’s Golden Chamber of the Jade Void. By ancient decree, it is transmitted once every seven thousand years. Without a name inscribed in gold or jade, or the vermilion script of the Mystic Terrace, one may not partake of its teachings. Those who behold its script and perfect its practice attain the rank of Highest Immortal.\n\nFollow the method: on the eight solar terms, ingest the talisman, perform the rites, and offer prayers, then bury it upon a mountain or cast it into the sea. Within nine years, the immortal officials of the Five Peaks will attend and guard your person, the Water Emperor and water spirits will await your command from all directions, and the Five Emperors will report your name to the Mystic Palace. The water officials will erase your records of transgression, dragons will descend amidst clouds, and transformations will arise without limit.\n\nYou must also habitually inscribe the talisman in colored pigments and wear it upon your person. Ascend mountains and traverse rivers—then the myriad spirits will guard your form, vanquish demons and trials, subdue all spirits with your might, and five-colored clouds will descend to your chamber while purple mist arises of itself. A halo will encircle your head, illuminating within and without, the Eight Effulgences will unite in perfection, and the Three Primes will descend in chariots. Soaring through the mysterious void, you will ascend to the Jade Purity.\n\nThose whose names are inscribed in gold and whose bones are of jade, bearing the precious script of the Highest Clarity, who obtain this talisman and wear it for three years, shall become Perfected Ones of the Five Peaks. Treading rivers and crossing seas, they shall become Lords of the Four Seas, assisted by the Five Emperors, revered by the myriad spirits. After nine years of practice, they shall traverse ten thousand fathoms of water, command and restrain the Jiao-Dragons, and if they retreat to the mountains to cultivate in seclusion, the Five Emperors and Five Peaks will manifest and converse with them. They shall summon clouds and raise rain, instantly call forth dragon mists, and achieve a thousand transformations and ten thousand changes, their responses instantaneous.\n\nAfter eighteen years of practice, they shall soar to the Highest Clarity. This Dao is most profound and not to be revealed in the world. To lightly disclose its sacred script brings punishment upon the seven generations of ancestors, while one’s own life is forfeit, bound eternally to the offices of the dead.\n\nThe recipient must fast with their master for thirty days—or seven days—offering three taels of refined gold, fifty feet each of five-colored patterned silk, forty feet of brocade, and one catty of finest incense. They shall proceed to the cliffs of the Five Peaks, announce themselves to the Five Emperors, and register with the Five Spirits, the celestial, terrestrial, and water officials of the Three Rivers and Four Seas, in accordance with the oath of the Four Poles, before transmission may occur.\n\nIf the recipient fails to register with the Celestial Spirits, the jade lads and jade maidens who attend the script will report to the Most High, and the recipient shall be punished by the divine soldiers of the Five Emperors. Those who lightly disclose it shall be punished across nine generations of ancestors, their own person extinguished. Those who receive it without swearing the oath shall bring calamity upon seven generations of ancestors, their own body afflicted by wind and fire, and the script shall naturally be lost.\n\nThus did the Supreme Primordial Lady declare to the Five Emperors: a script not sworn to shall not be transmitted; one who receives without registration loses the true. Both parties bear the responsibility of life and death. Scholars must adhere to the text and uphold it.\n\nThe Dao descends without fail; immortality is achieved without exception. Life and death share in its blessings, and fortune flows to one’s kin. The sacred script is most weighty—this is the ultimate truth of the Dao.\n\nHere ends the *Wondrous Perfected Supreme Nine Crimson-Striped Talisman: The Five Emperors’ Scripture of Inner Perfection*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "洞真太上九赤班符五帝内真经 经名：洞真太上九赤班符五帝内真经。 简称《九赤班符》。 撰人不详，约出於东晋。 系早期上清派重要经典。 一卷。 底本出处：《正统道藏》正一部。 洞真太上九赤班符五帝内真经 九赤班符，一名羽中林飞天九符。 元始天王藏之於上清瑶台金房玉室之中，神真焕明，流光曜空，四极监试，五帝卫真。 太上以云宫玉童三百人、上元又以西华玉女七百人，侍典灵文。 神标上清，威严九天，制魔灭祓，馘斩群凶，封掌名山，摄召水神，总统亿亿，领括万仙，五岳四渍及后学者身，部以神兵，罚过赏功。 九千年则九天一开，九天开，其文则明五岳之室，玄授得道之人。 自无仙骨玉名，刻书来生，不得见其篇目。 有得其文，便为五岳之师宗，四海之君王。 奉之者庆延七祖之魂，福流九种之亲，修之者刻成上清高仙真人。 九赤者，乃九元之炁飞玄羽章，结成玉文。 元文人以传太上大道君，元始天王以传南极上元君，太上以传扶桑大帝，太帝以传太微天帝君，太微天帝君以传后圣金阙帝君，以传上相青童君，南极上元君以传洪崖先生、太极四真人。 炁炁相传，皆刻书金简，结以紫篇，盛以云锦之囊，封以三元之章，藏以郁森之笈，秘於九曲之房。 玉仙典香，太华执巾，四司监映，五帝卫轩，三元晏礼，万仙朝真，其道至妙，依科七千年一传。 轻泄宣露，传非其人，七祖获考，身没河源。 后学勤心苦思，求仙精诚，感於太虚冥德，合於三元玄挺，应会自得此文，得佩真符，始可涉历於玄岳，托身於幽山，役九赤以封丘，命五行以招神，俾水帝以削罪，摄海灵以通源，则罪籍灭落於九府，生录刻注於三清，炁震溟波，威摄万灵，群魔灭试，仙官降形，运策六甲，制御天丁，通幽彻微，逆睹未生，故能神仙，飞行上清。 夫学不见九赤白羽中林飞天九符，则五岳不领玄名，四海水神不为兆削灭罪简，勒注三清也。 游行川泽，隐居幽山，不佩此文，则山灵天魔试败其旨，万害自生，终不成仙，水帝结书，列罪帝君也。 五岳五帝内思变化真形求仙上法 凡入东岳，思东方青帝神，闭眼即见真形者，其人则五宫结气，六藏生真，九府洞朗，内无滞根，和音震响，妙理明通，此人皆上仙之才也。 故道为之即降，神明为之感会，则仙不移年而成也。 若见青炁郁郁，亦其方正神虚映之炁也，则道有渐也。 若见黑气，则上真本生之号虚映之官，监试於兆身。 若见赤气，则洞生之官虚映之炁，来卫兆身也。 若见黄炁，则岳所使之官虚映之炁，来给兆通真也。 此悉无怪，依本而行事，久久道自感而降焉。 若见白炁，则天魔空中之精，来干试兆身，当叩左齿三十六通，而诵金玄章之祝一遍，则魔精自灭，真自来降也。 凡入南岳，思南方赤帝神，闭眼即见真形者，其人则骨结玉霜，炁参神宫，丹台刻简，结录紫篇，幽悟冥涂，逸浪虚庭，触类无滞，静思感真，此人皆上仙之才。 故道为之即降，神明为之感会也。 如此则仙不移年而成。 若见赤炁，亦其方正神虚映之炁也，则道有渐也。 若见青炁，则上真本生之号虚映之官，来监试於兆身。 若见黄炁，则洞生之号虚映之官，来卫兆身。 若见白炁，则南岳所使之官虚映之炁，来结兆身通真也。",
      "translated_text": "**The Supreme Cavern-Real Scripture of the Nine Crimson Talismans and the Five Emperors’ Inner Realms**\n\n**Scripture Title:** *The Supreme Cavern-Real Scripture of the Nine Crimson Talismans and the Five Emperors’ Inner Realms* (abbreviated as *The Nine Crimson Talismans*). Author unknown, approximately composed during the Eastern Jin dynasty. A foundational scripture of the early Shangqing tradition. One fascicle. Base text from *The Orthodox Daoist Canon*, Zhengyi Section, First Division.\n\n---\n\n**The Supreme Cavern-Real Scripture of the Nine Crimson Talismans and the Five Emperors’ Inner Realms**\n\nThe Nine Crimson Talismans, also called the *Nine Aerial Talismans of the Feathered Central Grove*, were concealed by the Celestial Worthy of Primordial Beginning within the Golden Chamber and Jade Abode of the Jasper Terrace of Supreme Clarity. Their divine radiance blazes forth, streaming light that illumines the void; the Four Poles oversee their trial, and the Five Emperors guard their authenticity.\n\nThe Supreme Lord appointed three hundred Jade Lads of the Cloud Palace, while the Upper Prime further assigned seven hundred Jade Maidens of the Western Florescence to attend and preserve this numinous writ. Its divine standard marks Supreme Clarity, its majesty commands the Nine Heavens; it subdues demons and dispels defilement, beheads legions of malevolence, seals and governs the sacred mountains, summons and commands the spirits of waters. It oversees boundless multitudes, encompasses the myriad immortals, and with the Five Peaks, the Four Abysses, and the bodies of later disciples, it deploys divine soldiers to punish transgressions and reward merit.\n\nEvery nine thousand years, the Nine Heavens open once; when the Nine Heavens open, this scripture illuminates the chambers of the Five Peaks, mysteriously bestowed upon those who attain the Dao. Without immortal bones or jade names inscribed for future lives, none may behold its passages. Those who obtain its text become masters and patriarchs of the Five Peaks, sovereigns of the Four Seas. Those who uphold it bring blessings to the souls of seven generations of ancestors and spread fortune to nine kinds of kin. Those who cultivate it ascend to become lofty immortals of Supreme Clarity.\n\nThe Nine Crimson Talismans are the flying, mysterious feathered chapters of the *qi* of the Nine Primes, coalesced into jade script. The primordial text was transmitted by the human realm to the Supreme Lord of the Great Dao; the Celestial Worthy of Primordial Beginning transmitted it to the Upper Prime Lord of the Southern Culmen; the Supreme Lord transmitted it to the Great Emperor of Fusang; the Great Emperor transmitted it to the Celestial Emperor of the Supreme Tenuity; the Celestial Emperor of the Supreme Tenuity transmitted it to the Later Sage Emperor of the Golden Portals; and thence to the Prime Minister, the Azure Lad. The Upper Prime Lord of the Southern Culmen transmitted it to Master Hongya and the Four Perfected of the Great Ultimate.\n\nTransmission of *qi* follows in succession, each inscribed on golden tablets, bound with purple cords, encased in cloud-brocade satchels, sealed with the seals of the Three Primes, stored in dark and verdant caskets, and concealed within the chambers of the Nine Bends. Jade immortals offer incense, Mount Taihua holds the towels; the Four Directors oversee its radiance, the Five Emperors guard its carriage. The Three Primes observe the rites, the myriad immortals pay homage to the Perfected. Its Dao is most wondrous; according to the regulations, it is transmitted once every seven thousand years. To lightly divulge or expose it, or transmit it to the unworthy, brings the seven generations of ancestors to trial and causes the disciple’s body to perish in the river’s source.\n\nLater disciples who diligently concentrate their minds, seek immortality with utmost sincerity, and resonate with the dark virtue of the Great Void, aligning with the mysterious emergence of the Three Primes, will naturally encounter and obtain this text. Only upon receiving and wearing the true talismans may one traverse the mysterious peaks, entrust one’s body to the secluded mountains, command the Nine Crimson to seal the mounds, summon the Five Agents to invoke spirits, dispatch the Water Emperor to erase transgressions, and gather the numina of the seas to open the sources. Thus, the ledgers of sins are obliterated in the Nine Treasuries, and the records of life are inscribed in the Three Clarities. *Qi* shakes the dark waves, majesty subdues the myriad spirits; demonic hosts are vanquished in trial, immortal officials descend in form. Wielding the tally of the Six Jia, one commands the celestial soldiers; penetrating the obscure and fathoming the subtle, one perceives the yet-unborn. Thus may one attain divine transcendence and soar through Supreme Clarity.\n\nThose who study without encountering the *Nine Aerial Talismans of the Feathered Central Grove* will not receive the mysterious names of the Five Peaks, nor will the water spirits of the Four Seas erase their ledgers of sins or inscribe their names in the Three Clarities. When wandering through rivers and marshes or dwelling in secluded mountains without wearing this text, mountain spirits and celestial demons will test and thwart their aspirations, myriad harms will arise of themselves, and they will never attain immortality. The Water Emperor will compile their transgressions and present them to the Emperor of Judgment.\n\n---\n\n**The Five Peaks’ Five Emperors’ Inner Method of Transforming True Forms to Seek Immortality**\n\nWhen entering the Eastern Peak, visualize the Azure Emperor of the East. If upon closing the eyes one immediately perceives his true form, that person’s five palaces will coalesce *qi*, the six viscera will generate the Perfected, the nine treasuries will become luminously clear, and internally, no obstructions will remain. Harmonious tones will resound, and wondrous principles will become lucid and penetrating—such a person possesses the talent of a superior immortal. Thus, the Dao will descend at once, and divine luminaries will respond in resonance; such a one will attain immortality without delay.\n\nIf one sees azure *qi* flourishing and dense, it is the *qi* of the upright spirit of that direction, reflecting in emptiness—this indicates gradual progress on the Dao. If one sees black *qi*, it is the office of the Perfected of one’s original life reflecting in emptiness, overseeing the trial of one’s body. If one sees red *qi*, it is the *qi* of the office of cavernous generation reflecting in emptiness, coming to guard one’s body. If one sees yellow *qi*, it is the *qi* of the office dispatched by the Peak reflecting in emptiness, coming to assist one in communicating with the Perfected. None of these should be feared; proceed according to the original method, and in time, the Dao will naturally respond and descend.\n\nIf one sees white *qi*, it is the essence of celestial demons in the void, coming to test one’s body. One should strike the left teeth thirty-six times and recite the *Golden Mystery Chapter* once; then the demonic essence will vanish of itself, and the Perfected will naturally descend.\n\nWhen entering the Southern Peak, visualize the Vermilion Emperor of the South. If upon closing the eyes one immediately perceives his true form, that person’s bones will coalesce jade frost, *qi* will interpenetrate the divine palace, the cinnabar terrace will inscribe the tablets, and the purple chapters will be bound into records. Profoundly awakened to the dark path, one roams freely in the empty courtyard, encounters all things without obstruction, and through tranquil contemplation, resonates with the Perfected—such a person possesses the talent of a superior immortal. Thus, the Dao will descend at once, and divine luminaries will respond in resonance; such a one will attain immortality without delay.\n\nIf one sees red *qi*, it is the *qi* of the upright spirit of that direction reflecting in emptiness—this indicates gradual progress on the Dao. If one sees azure *qi*, it is the office of the Perfected of one’s original life reflecting in emptiness, coming to oversee the trial of one’s body. If one sees yellow *qi*, it is the office of cavernous generation reflecting in emptiness, coming to guard one’s body. If one sees white *qi*, it is the *qi* of the office dispatched by the Southern Peak reflecting in emptiness, coming to assist one’s body in communicating with the Perfected.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1242,
      "start_sentence": 0,
      "end_sentence": 39,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.332515716552734,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上九赤班符五帝内真经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "此悉无怪，依本行事，久久道自感而降也。 若见黑炁，则空中太魔之精，来干试兆真也。 兆当叩左齿三十六通，诵玄章灭魔之祝一遍，则魔精自灭，真自降也。 凡入西岳，思西方白帝神，闭眼即见真形者，其人则胇有金阙，六宫纳真，通幽达灵，回释玄元，内无碍滞，外无欲尘，故名书金格，录字上清，此人皆上仙之才也。 故道为之即降，神明为之感会，则仙不移年而成也。 若见白炁，亦其正神虚映之炁也，则道有渐也。 若见黄炁，则上真本生之号虚映之官，监试於兆身。 若见黑炁，则洞生之官虚映之炁，来卫兆身也。 若见青炁，则西岳所使之官虚映之炁，来结兆身通真也。 此悉无怪，依本而行事，久久自当感真而降焉。 若见赤炁，则空中大魔之精，来干试兆真也。 兆当叩左齿三十六通，诵金玄章灭魔之祝一遍，则魔精自灭、真形自降也。 凡入北岳，思北方黑帝神，闭眼即见真形者，其人则玄挺标晨，五心结络，炁参紫天，玄书北元，刻简青宫，朗照幽室，通神达微，此人皆上仙之才也。 故道为之则降，神明为之感会，则仙不移年而成也。 若见黑炁，亦其正神虚映之炁也，则道有渐也。 若见白炁，则上真本生之号虚映之官，监试於兆身。 若见青炁，则洞生之官虚映之炁，来卫兆身也。 若见赤炁，则北岳所使之官虚映之炁，来给兆通真也。 此悉无怪，依本而行事，久久自当感真而降焉。 若见黄炁，则空中大魔之精，来干试兆真也。 兆当叩左齿三十六通，诵金玄灭魔之祝一遍，则魔精自灭，真形自降也。 凡入中岳，思中央黄帝神，闭眼即见真形者，其人则绛府生华，赤子纳仙，理幽综滞，味景霄清，名书帝室，图影三元，此人皆上仙之才也。 故道为之即降，神明为之感会，则仙不移年而成也。 若见黄炁，亦其正神虚映之炁也，则道有渐也。 若见赤炁，则上真本生之号虚映之官，监试於兆身。 若见白炁，则洞生之官虚映之炁，来卫兆身也。 若见黑炁，则中岳所使之官虚映之炁，来给兆通真也，此悉无怪，依本而行事，久久自当感真而降焉。 若见青炁，则空中大魔之精，来干试兆真也。 兆当叩左齿三十六通，诵金玄之章灭魔之祝一遍，则魔精自灭，真形自降也。 五岳内思刻名定仙上法 太上九赤镇岳求仙班符",
      "translated_text": "There is nothing strange in this—proceed according to the fundamental practice, and in time the Dao will naturally respond and descend.\n\nIf one sees black *qi*, it is the essence of the Great Demon of the Void coming to test the authenticity of the adept’s truth. The adept should strike the left teeth thirty-six times and recite the Mystic Chapter’s demon-quelling incantation once, whereupon the demonic essence will vanish of itself and the true form will descend.\n\nWhen entering the Western Marchmount, meditate upon the White Thearch of the West; if upon closing the eyes one immediately perceives the true form, such a person possesses a golden palace within the chest, where the Six Palaces receive the Perfected. They penetrate the obscure and commune with the numinous, revolving and releasing the Mystic Origin. Within, there is no obstruction; without, no dust of desire. Thus their name is inscribed in the Golden Register and recorded in the Upper Clarity—such a one possesses the talent of a superior immortal. Therefore, the Dao will descend at once, and divine luminaries will respond in resonance; such a one will attain immortality without delay.\n\nIf one sees white *qi*, it is the *qi* of the upright spirit of that direction reflecting in emptiness—this indicates gradual progress on the Dao. If one sees yellow *qi*, it is the office of the Perfected of one’s original life reflecting in emptiness, coming to oversee the trial of one’s body. If one sees black *qi*, it is the *qi* of the office of cavernous generation reflecting in emptiness, coming to guard one’s body. If one sees azure *qi*, it is the *qi* of the office dispatched by the Western Marchmount reflecting in emptiness, coming to assist one’s body in communicating with the Perfected. There is nothing strange in this—proceed according to the fundamental practice, and in time the Perfected will naturally respond and descend.\n\nIf one sees red *qi*, it is the essence of the Great Demon of the Void coming to test the authenticity of the adept’s truth. The adept should strike the left teeth thirty-six times and recite the Golden Mystic Chapter’s demon-quelling incantation once, whereupon the demonic essence will vanish of itself and the true form will descend.\n\nWhen entering the Northern Marchmount, meditate upon the Black Thearch of the North; if upon closing the eyes one immediately perceives the true form, such a person possesses a mysterious stem rising at dawn, with the five centers interlinked. Their *qi* ascends to the Purple Heaven, their name is inscribed in the Northern Mysteries, and their tally is carved in the Azure Palace. They illumine the obscure chamber, penetrate the numinous, and reach the subtle—such a one possesses the talent of a superior immortal. Therefore, the Dao will descend at once, and divine luminaries will respond in resonance; such a one will attain immortality without delay.\n\nIf one sees black *qi*, it is the *qi* of the upright spirit of that direction reflecting in emptiness—this indicates gradual progress on the Dao. If one sees white *qi*, it is the office of the Perfected of one’s original life reflecting in emptiness, coming to oversee the trial of one’s body. If one sees azure *qi*, it is the *qi* of the office of cavernous generation reflecting in emptiness, coming to guard one’s body. If one sees red *qi*, it is the *qi* of the office dispatched by the Northern Marchmount reflecting in emptiness, coming to assist one’s body in communicating with the Perfected. There is nothing strange in this—proceed according to the fundamental practice, and in time the Perfected will naturally respond and descend.\n\nIf one sees yellow *qi*, it is the essence of the Great Demon of the Void coming to test the authenticity of the adept’s truth. The adept should strike the left teeth thirty-six times and recite the Golden Mystic Chapter’s demon-quelling incantation once, whereupon the demonic essence will vanish of itself and the true form will descend.\n\nWhen entering the Central Marchmount, meditate upon the Yellow Thearch of the Center; if upon closing the eyes one immediately perceives the true form, such a person possesses a cinnabar palace generating radiance, where the Red Child receives the immortal. They govern the obscure and resolve obstructions, savoring the luminous clarity of the empyrean. Their name is inscribed in the Thearch’s chamber, and their image is charted in the Three Origins—such a one possesses the talent of a superior immortal. Therefore, the Dao will descend at once, and divine luminaries will respond in resonance; such a one will attain immortality without delay.\n\nIf one sees yellow *qi*, it is the *qi* of the upright spirit of that direction reflecting in emptiness—this indicates gradual progress on the Dao. If one sees red *qi*, it is the office of the Perfected of one’s original life reflecting in emptiness, coming to oversee the trial of one’s body. If one sees white *qi*, it is the *qi* of the office of cavernous generation reflecting in emptiness, coming to guard one’s body. If one sees black *qi*, it is the *qi* of the office dispatched by the Central Marchmount reflecting in emptiness, coming to assist one’s body in communicating with the Perfected. There is nothing strange in this—proceed according to the fundamental practice, and in time the Perfected will naturally respond and descend.\n\nIf one sees azure *qi*, it is the essence of the Great Demon of the Void coming to test the authenticity of the adept’s truth. The adept should strike the left teeth thirty-six times and recite the Golden Mystic Chapter’s demon-quelling incantation once, whereupon the demonic essence will vanish of itself and the true form will descend.\n\n**The Supreme Method of Inscribing Names in the Five Marchmounts to Determine Immortal Rank**\n*The Nine Vermilion Talismans for Pacifying the Marchmounts and Seeking Immortal Rank*",
      "overlap_context": " in emptiness—this indicates gradual progress on the Dao. If one sees azure *qi*, it is the office of the Perfected of one’s original life reflecting in emptiness, coming to oversee the trial of one’s body. If one sees yellow *qi*, it is the office of cavernous generation reflecting in emptiness, coming to guard one’s body. If one sees white *qi*, it is the *qi* of the office dispatched by the Southern Peak reflecting in emptiness, coming to assist one’s body in communicating with the Perfected.",
      "start_char": 1242,
      "end_char": 2109,
      "start_sentence": 40,
      "end_sentence": 70,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.19340491294861,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上九赤班符五帝内真经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "东岳青帝内思甲乙入木九炁班符 东方青帝君，姓常，讳精萌，头建九元通天冠，衣青锦帔碧饰飞裙，佩太上九炁命灵之章，带翠羽交灵之绶。 常以立春之日，乘碧霞九龙云舆，从青腰玉女十二人，手把青林之华九色杖幡，游行东岳太山，校定真人仙官录札，时诣东海水帝，考算学道功过罪目，回降佩符者身。 学者服其符以招其人，存其炁以降其真，求削水帝之简，上名玉札之篇。 当以立春之日平旦，沐浴斋静，入室烧香，服甲乙入木九炁班符，叩齿九通，思东方青帝君，姓常，讳精萌，衣服形色，乘碧霞云舆，下降兆房，青炁郁郁，覆满一室，冠匝己形。 存见帝君青炁之中化为赤光，如岁星之精，赫赫照明，从头顶而下，入兆身中，光明洞映肝部之间。 便引炁九咽，觉身中熏热，须臾，赤光於内散，从九孔中出，回合还兆头顶之上，化成青云，觉兆身在青云之中，随云而升。 良久觉定，豁如蹈空，便仰咒曰： 太丹亿斋，回合九门，玄虚举真，赤班早分，带甲入木，乘乙御云，上制五岳，封丘召山，下告九河，十二水源，落除宿简，列奏玉篇，掌录我真，青帝之君，降我碧霞，飞青羽裙，与帝合景，奏谒玉晨。 毕，又叩齿十二通，咽液二十四遍止。 行之九年，则能书符投山，山降云雨，鲦欻晻冥，书符投水，水上蛟龙，能入万丈之渊。 如行人中，书符於木，削之不灭，其文转明，带符抱木，身成山林，东岳卫以仙官十二人。 一十八年，则能飞行上清。 轻泄此道，罚以鬼兵，殃延七祖，身没河源。 太上甲乙入木九炁班符，朱书，立春之日平旦，东向服之，祝如上法。 又以正月、二月甲寅、乙卯之日，青书桐板之上，令广九寸，长一尺二寸，埋之所住东岳，令深九尺。 甲乙唯一日也，如此法三年一埋，不必年年也。 但存思服御，依节行之，亦九年无不感降也。 此一名白羽中林飞天九符，一名九变三合成一，得见其文，与五帝同真。 埋符之日，当东向叩齿三十六通，存思青炁之云，覆冠一山，上下郁冥。 东岳太山君，乘九色之龙，手执青羽之麾，从太山仙官十二人，在青炁之内监映兆身，仰祝曰： 天通地理，二炁交真，九赤阳明，四度开陈，上开五帝，东岳泰山，下告万灵，无鞅之神，削我宿对，记我此篇，灭消魔试，使我成仙，封赏灵岳，与炁同烟，兴云降雨，飞霄碧轩，升入玄虚，高皇帝前。 毕，埋符如式，仰引青炁三十六咽止。 东岳泰山君，常以春分之日，列奏真仙已得道及始学之人名录，上言高上帝君，检校玄名。 修飞仙之道，当以其日日之时，沐浴斋戒，烧香入室，东向思东岳泰山君，姓玄丘，讳目陆，头建三宝九光夜冠，衣青羽章裙，披九色班裘，带上皇命神之篆，乘青云飞舆九色苍龙，从十二仙官，手把五芝，东北而回，上登无崖之上玉清之天，徘徊玄虚之内青云之中。 当叩齿九通，心言：今日上节，八愿开新，愿回神曲，来降我间，纳我所求，奏我所陈，得上玉札，位系紫篇，道君回映，我获上仙。 毕，思泰山君乘舆下降，青炁郁郁，覆满一室，君处青炁之中，手执青简，注上我名於青简之篇，微祝曰： 玉真徘徊，焕明东方，乘龙驾舆，飞行太空，回灵曲映，下降我房，青阳告始，上愿开通，纳我所陈，削过记功，刻名青简，列奏高皇，西龟结录，东华勒方，五灵辅翼，八帝齐光，来甲御乙，出木入空，六丁侍卫，玉女扶将，摄山召海，命制蛟龙，啸风兴云，靡不立躬，天魔伏试，万灵敬从，变景化形，上升玉宫，年享泰山，永保无穷。",
      "translated_text": "**The Nine Qi Rank Talisman of the Azure Emperor of the Eastern Marchmount, with Inner Visualization of Jia-Yi Entering Wood**\n\nThe Azure Emperor Lord of the East, surnamed Chang, personal name Jingmeng, wears the Nine Origins Heaven-Penetrating Crown upon his head. His robe is of azure brocade with jade-green flying skirts, and he bears the Supreme Nine Qi Life-Spirit Seal. His sash is woven of kingfisher plumes and interlaced with numinous cords.\n\nOn the day of *Lichun* (Beginning of Spring), he rides a cloud-chariot drawn by nine azure dragons, accompanied by twelve Jade Maidens of the Azure Waist, each holding a nine-colored staff and banner of the Azure Grove. He traverses the Eastern Marchmount, Mount Tai, reviewing the registers of Perfected Ones and Immortal Officials. At times, he visits the Water Emperor of the Eastern Sea to audit the merits, transgressions, and sins of those who study the Dao. Upon his return, he descends to bestow talismans upon the adept’s body.\n\nThe practitioner ingests this talisman to summon his presence, visualizes his *qi* to induce the descent of his Perfected form, and seeks to have their name expunged from the Water Emperor’s ledgers and inscribed in the Jade Registers.\n\nOn the day of *Lichun* at dawn, bathe, purify, and enter the chamber to burn incense. Ingest the *Nine Qi Rank Talisman of Jia-Yi Entering Wood*, strike the teeth nine times, and visualize the Azure Emperor Lord of the East: surnamed Chang, personal name Jingmeng, clad in his robes and colors, descending in his azure-cloud chariot into the adept’s chamber. Azure *qi* billows densely, filling the room and encircling the adept’s form.\n\nWithin the Azure Emperor’s *qi*, visualize a crimson radiance transforming, like the essence of Jupiter, blazing and luminous. It descends from the crown of the head into the adept’s body, its brilliance illuminating the liver. Draw in the *qi* and swallow nine times, sensing warmth suffusing the body. Soon, the crimson light scatters within and emerges from the nine orifices, coalescing above the adept’s head into azure clouds. The adept feels their body within the clouds, ascending with them.\n\nAfter a long while, the perception stabilizes, as if treading empty space. Then recite the incantation while looking upward:\n\n*\"Supreme Cinnabar, myriad purifications,\nRevolving to seal the nine gates.\nMysterious Void uplifts the Perfected,\nCrimson ranks swiftly divide.\nBearing Jia to enter Wood,\nRiding Yi to command clouds.\nAbove, govern the Five Marchmounts,\nSeal mounds and summon mountains.\nBelow, proclaim to the Nine Rivers,\nTwelve water sources.\nErase the old ledgers,\nInscribe in the Jade Chapters.\nRecord my Perfected form,\nAzure Emperor Lord,\nDescend with me in azure radiance,\nFlying azure feathered skirts,\nMerge with the Emperor’s light,\nPetition the Jade Dawn.\"*\n\nConclude by striking the teeth twelve times and swallowing saliva twenty-four times.\n\nPracticing this for nine years enables one to inscribe talismans and cast them into mountains, summoning clouds and rain, obscuring the sky in darkness. Casting talismans into water causes dragons to rise from the depths. Among people, inscribing talismans on wood renders the script indelible, its characters growing ever brighter. Carrying the talisman while embracing a tree transforms the body into a mountain forest, guarded by twelve Immortal Officials of the Eastern Marchmount.\n\nAfter eighteen years, one can ascend to the Upper Clarity in flight.\n\nRevealing this method carelessly invokes ghostly soldiers as punishment, extending calamity to seven generations, and the body will perish in the river’s source.\n\n**The Nine Qi Rank Talisman of Jia-Yi Entering Wood**\nInscribe in vermilion. On the day of *Lichun* at dawn, face east to ingest it, reciting the incantation as above.\n\nAdditionally, on the days of *Jia-yin* and *Yi-mao* in the first and second months, write in azure ink on paulownia wood, nine inches wide and twelve inches long. Bury it nine feet deep at the Eastern Marchmount of one’s dwelling. *Jia* and *Yi* occur only once a year; thus, perform this ritual once every three years, not annually. However, the visualization and ingestion should follow the seasonal nodes, and after nine years, the response will invariably descend.\n\nThis is also called the *White Feather Central Grove Flying Heaven Nine Talismans*, or the *Nine Transformations, Three Unions, Becoming One*. Those who behold its scripture attain the same Perfection as the Five Emperors.\n\nOn the day of burying the talisman, face east and strike the teeth thirty-six times. Visualize azure *qi* clouds crowning a mountain, filling the space above and below in dense obscurity.\n\nThe Lord of the Eastern Marchmount, Mount Tai, rides a nine-colored dragon, wielding a jade-green feathered banner, accompanied by twelve Immortal Officials of Mount Tai. Within the azure *qi*, they oversee and reflect upon the adept’s body. Recite while looking upward:\n\n*\"Heaven communicates with earthly principles,\nThe two *qi* merge with the Perfected.\nNine crimson yang luminaries,\nFour seasons unfold in order.\nAbove, the Five Emperors open,\nThe Eastern Marchmount, Mount Tai.\nBelow, proclaim to the myriad spirits,\nThe boundless deities.\nExpunge my past transgressions,\nRecord this chapter of mine.\nEradicate demonic trials,\nEnable my ascension as an Immortal.\nBestow honors upon the numinous Marchmount,\nMerge with *qi* in mist.\nSummon clouds and descend rain,\nFly through azure skies in a chariot.\nAscend into the Mysterious Void,\nBefore the August Emperor.\"*\n\nConclude by burying the talisman as prescribed, then draw in and swallow the azure *qi* thirty-six times.\n\nThe Lord of the Eastern Marchmount, Mount Tai, regularly on the day of *Chunfen* (Spring Equinox), presents the registers of Perfected Immortals who have attained the Dao and those newly studying it, reporting to the August Emperor Lord on High to review the Mysterious Names.\n\nTo cultivate the Dao of Flying Immortals, on that day at the hour of *Chen* (7–9 AM), bathe, fast, burn incense, and enter the chamber. Face east and visualize the Lord of the Eastern Marchmount, Mount Tai: surnamed Xuanqiu, personal name Mulu, wearing the Three Treasures Nine Radiance Night Crown, clad in azure feathered skirts and a nine-colored patterned robe, bearing the Supreme August Life-Spirit Seal. He rides a flying chariot of azure clouds drawn by nine azure dragons, accompanied by twelve Immortal Officials, each holding the Five Sacred Fungi. They circle northeast, ascending to the boundless heights of the Jade Clarity Heaven, wandering within the azure clouds of the Mysterious Void.\n\nRecite while striking the teeth nine times:\n\n*\"Today, at the supreme seasonal node,\nEight vows unfold anew.\nMay the divine melody revolve,\nDescend to my realm.\nReceive my supplications,\nPresent my petitions.\nInscribe my name in the Jade Registers,\nRank me in the Purple Chapters.\nMay the Dao Lord reflect upon me,\nThat I attain Upper Immortality.\"*\n\nConclude the visualization as the Lord of Mount Tai descends in his chariot, azure *qi* billowing densely to fill the chamber. He stands within the azure *qi*, holding a green bamboo slip, inscribing the adept’s name upon it. Softly recite:\n\n*\"Jade Perfected wandering,\nRadiant in the East.\nRiding dragons, driving chariots,\nFlying through the Great Void.\nRevolving numinous melodies,\nDescend to my chamber.\nAzure yang proclaims the beginning,\nSupreme vows unfold.\nReceive my petitions,\nExpunge transgressions, record merits.\nInscribe my name on the green bamboo slip,\nPresent it to the August Emperor.\nThe Western Tortoise binds the records,\nThe Eastern Flower engraves the directions.\nFive Numinous Ones assist,\nEight Emperors shine together.\nBearing Jia, riding Yi,\nExiting Wood to enter emptiness.\nSix Ding spirits attend,\nJade maidens support.\nCommand mountains, summon seas,\nGovern dragons.\nWhistle to summon wind, raise clouds,\nAll obeys instantly.\nHeavenly demons submit to trials,\nMyriad spirits revere and follow.\nTransform the luminous body,\nAscend to the Jade Palace.\nYearly offerings at Mount Tai,\nEternal preservation without end.\"*",
      "overlap_context": "i*, it is the essence of the Great Demon of the Void coming to test the authenticity of the adept’s truth. The adept should strike the left teeth thirty-six times and recite the Golden Mystic Chapter’s demon-quelling incantation once, whereupon the demonic essence will vanish of itself and the true form will descend.\n\n**The Supreme Method of Inscribing Names in the Five Marchmounts to Determine Immortal Rank**\n*The Nine Vermilion Talismans for Pacifying the Marchmounts and Seeking Immortal Rank*",
      "start_char": 2109,
      "end_char": 3455,
      "start_sentence": 71,
      "end_sentence": 98,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 40.81981182098389,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上九赤班符五帝内真经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "毕，仰咽九炁止。 修之九年，则泰山君见形於兆前，降於青炁之云，给神童九人，致自然神芝，能知东方万里之事。 一十八年，则致龙舆，乘空飞行，上升玉清宫。 南岳赤帝内思丙丁入火三炁斑符 南方赤帝君，姓炎，讳洞丹，头建三炁玄梁宝冠，衣绯云锦袍丹文之裙，佩南极制阳之符，带朱宫八光之剑。 常以立夏之日，乘赤霞飙轮，从太丹玉女十二人，乘九色之凤，手把日精三炁之华，游行南岳衡山，校定真人仙官录札，及学者之名，时诣南海水帝神王，考算学道功过罪目，回降佩符者身。 学者服其符以招其神，存其炁以降其真，削除水帝之简，上名玉札之篇。 当以立夏之日正中，沐浴斋戒，入室烧香，服丙丁入火三炁班符，叩齿三通，思南方赤帝君讳字，衣服形色，乘赤霞飙轮，下降兆房，赤炁赫赫，覆满一室，冠匝己形。 存见帝君在赤炁之中化为荧惑星，赫赫照明，从头顶而下，入兆身中，光明洞映心宫之间，便引炁三咽，觉身熏热，须臾，荧惑星於心散为赤炁，从九孔中出，回合还兆头顶之上，化成赤云。 觉兆身在赤云之中，随云而升，良久觉定，豁如蹈空，仰祝曰： 三炁回元，飞天九清，白羽中林，入微洞灵，带丙耀光，乘火入丁，中真混合，上化景星，制御万炁，封山召灵，符摄九河，十二水精，削灭九阴，宿简之名，兴云降龙，丹霄朱軿，八景迅虚，流火郁冥，飞轮紫盖，来运我形，乘虚蹑浮，上造玉庭，受炼洞阳，五神鲜明，永享天眉，与帝合并。 毕，又叩齿九通，咽液十二过止。 行之九年，则能书符投林，林自生火，书符投水，水上蛟龙，书符投山，山降云雨，带符入火，身则不然，埋符南岳，则得仙官侍卫兆身。 十八年，则能飞行，上升玉清。 轻泄此道，殃延七祖，身没鬼官，长闭地狱，不得成仙。 太上丙丁入火三炁班符，朱书，立夏之日正中，南向服之，祝如上法。 又以四月、五月丙午、丁已之日，朱书桐板之上，令广八寸、长一尺二寸，埋之所住南岳，令深八尺。 丙丁唯一日也，如此法三年一埋，不年年也。 但存思服御，依节行之，亦九年，赤帝君衡山君无不降见於兆形也。 此一名三合成道九真中符，一名九合入微幽虚七变。 得见其文，五帝齐真，刻成上仙。 埋符之时，当南向叩齿二十四通，存思赤炁之云，覆冠一山之上，南岳衡山君乘赤龙云车，手执赤羽之节，从衡山仙官十二人，在赤炁之中监映兆身，仰咒曰： 丹灵洞阳，上总天逢，九变三合，乃成道宫，赤景班符，威御万方，今日上节，三炁开通，上关五帝，告文灵峰，削我宿负，列名高皇，使我道成，变化玄空，封掌灵岳，召海策龙，兴云降雨，万向立从，飞霄赤轮，升入帝房，八炁并景，三元齐光。 毕，埋符如式，仰引赤炁二十四咽止。 南岳衡山君，常以夏节之日，列凑真仙已得道及始学之人名录，上言高上帝君，检校玄名，区别功过。 修飞仙之道，当以其日日中之时，沐浴斋戒，入室烧香，南向思南岳衡山君，姓爓，讳洋光，头建八朗宝光玉冠，衣赤锦飞裙，披神光绯文之表，带封灵制魔之章，乘赤霞飞轮，从南岳仙官十二人，悉乘飞凤，手把神芝，东南而回，上登无崖之上玉清之天，徘徊空虚之内赤云之中。",
      "translated_text": "When finished, raise the head and swallow the nine qi to conclude.\n\nAfter nine years of cultivation, the Lord of Mount Tai will manifest before the practitioner, descending upon clouds of azure qi, bestowing nine divine youths and naturally occurring spirit-mushrooms, enabling knowledge of affairs ten thousand *li* to the east. After eighteen years, one attains a dragon chariot, riding the void to ascend to the Jade Pure Palace.\n\n**Southern Marchmount’s Red Emperor: Internal Contemplation of Bing-Ding Entering Fire, Three Qi Mottled Talisman**\nThe Red Emperor of the South, surnamed Yan, personal name Dongdan, wears a precious crown of three qi and dark beams, a crimson cloud-brocade robe with cinnabar-patterned skirts, bears the Southern Culmen’s talisman for restraining yang, and girds the Eight Radiance Sword of the Vermilion Palace. On the day of *Lixia* (Beginning of Summer), he rides a chariot of scarlet mist-wheels, accompanied by twelve Jade Maidens of Great Cinnabar, each mounted on nine-colored phoenixes and holding the three qi blossoms of solar essence. They roam Mount Heng of the Southern Marchmount, reviewing the registers of perfected ones and immortals, as well as the names of learners, then proceed to the Water Emperor and Divine King of the Southern Sea to audit the merits, transgressions, and faults of those who study the Dao. Upon returning, they descend to the bodies of those who bear the talisman.\n\nLearners who ingest this talisman summon its spirit, visualize its qi to draw down its authenticity, erase their names from the Water Emperor’s records, and inscribe them in the jade registers. At high noon on *Lixia*, bathe, purify, and fast, then enter the chamber to burn incense. Ingest the Bing-Ding Entering Fire Three Qi Mottled Talisman, knock the teeth thrice, and visualize the Red Emperor’s personal name and attire, his scarlet mist-wheel chariot descending into one’s chamber. Scarlet qi blazes, filling the room and encircling one’s form. Visualize the Emperor within the scarlet qi transforming into the Radiant Deluder Star, its brilliance illuminating as it descends from the crown of the head into the body, its light pervading the heart’s palace. Draw in qi and swallow thrice, feeling the body suffused with warmth. Soon, the Radiant Deluder Star disperses from the heart into scarlet qi, exiting through the nine orifices and reuniting above the crown to form a scarlet cloud. Sense the body within this cloud, ascending with it. After a long while, the perception stabilizes, as if treading emptiness. Raise the head and pray:\n\n*\"Three qi return to the origin,\nSoaring to the Nine Purities of Heaven.\nWhite feathers in the central grove,\nEntering the subtle and numinous.\nGirded with Bing’s radiance,\nRiding fire to enter Ding.\nCentral perfection merges as one,\nTransforming into the luminous star above.\nCommanding the ten thousand qi,\nSealing mountains and summoning spirits.\nTalismans bind the nine rivers,\nTwelve water spirits.\nErasing the nine yin,\nNames from the old registers.\nRaising clouds, descending dragons,\nCrimson chariots of the cinnabar heavens.\nEight effulgences swiftly traverse the void,\nFlowing fire darkens the gloom.\nFlying wheels and purple canopies,\nConvey my form,\nTreading the void, stepping the floating.\nAscending to the Jade Court,\nReceiving refinement in the Cavern Yang.\nFive spirits shine brightly,\nEternally enjoying celestial longevity,\nMerging with the Emperor.\"*\n\nWhen finished, knock the teeth nine times and swallow saliva twelve times to conclude.\n\nAfter nine years of practice, one can inscribe talismans and cast them into forests, which spontaneously ignite; cast them into water, and dragons surface; cast them into mountains, and clouds and rain descend. Bearing the talisman, one enters fire unscathed. Burying it at the Southern Marchmount secures immortal officials to attend and guard the body. After eighteen years, one can fly and ascend to the Jade Pure Palace.\n\nRevealing this Dao lightly brings calamity upon seven generations, consigning the body to the offices of ghosts, eternally confined in earth prisons, barred from attaining immortality.\n\n**The Supreme Bing-Ding Entering Fire Three Qi Mottled Talisman** is written in vermilion. Ingest it at high noon on *Lixia*, facing south, with prayers as above. Additionally, on *Bingwu* or *Dingwei* days in the fourth or fifth month, write it in vermilion on paulownia wood, eight *cun* wide and one *chi* two *cun* long, and bury it eight *chi* deep at the Southern Marchmount of one’s dwelling. *Bing* and *Ding* share a single day; perform this burial once every three years, not annually. Merely visualizing, ingesting, and practicing according to the seasons for nine years will ensure the Red Emperor and the Lord of Mount Heng manifest before the practitioner.\n\nThis is called the **Threefold Union Attaining Dao Nine Perfected Middle Talisman**, also known as the **Ninefold Union Entering Subtle Dark Void Seven Transformations**. Those who behold its script attain the perfection of the Five Emperors and ascend as immortals.\n\nWhen burying the talisman, face south, knock the teeth twenty-four times, and visualize scarlet qi clouds crowning a mountain. The Lord of Mount Heng of the Southern Marchmount rides a cloud chariot drawn by scarlet dragons, holding a vermilion feathered tally, accompanied by twelve immortals of Mount Heng within the scarlet qi, overseeing the practitioner’s body. Raise the head and pray:\n\n*\"Cinnabar numen, Cavern Yang,\nAbove governing Heaven’s Conjunction.\nNine transformations, three unions,\nThus forming the Dao’s palace.\nScarlet effulgent talisman,\nMight ruling the ten thousand directions.\nToday, the supreme tally,\nThree qi open the passage.\nConnecting the Five Emperors above,\nAnnouncing the script to the numinous peak.\nErasing my past debts,\nInscribing my name in the August Emperor’s registers.\nMay my Dao be accomplished,\nTransforming the mysterious void.\nSealing the numinous marchmounts,\nSummoning the sea and commanding dragons.\nRaising clouds, descending rain,\nAll directions instantly obey.\nFlying through the heavens in scarlet wheels,\nAscending to the Emperor’s chamber.\nEight qi merge with effulgences,\nThree origins shine together.\"*\n\nWhen finished, bury the talisman as prescribed, then raise the head and swallow scarlet qi twenty-four times to conclude.\n\nThe Lord of Mount Heng of the Southern Marchmount, on the summer festival day, presents the registers of perfected immortals, those who have attained the Dao, and beginners to the Supreme Emperor, reviewing the mysterious names and distinguishing merits from faults.\n\nTo cultivate the Dao of flying immortality, at noon on that day, bathe, purify, and fast, then enter the chamber to burn incense. Face south and visualize the Lord of Mount Heng, surnamed Yan, personal name Yangguang, wearing an Eight Brilliances Precious Radiance Jade Crown, a crimson brocade flying skirt, and a divine radiance crimson-patterned robe, bearing the talisman for sealing spirits and restraining demons. He rides a scarlet mist flying wheel, accompanied by twelve immortals of the Southern Marchmount, each mounted on flying phoenixes and holding spirit-mushrooms. They circle the southeast, ascending to the boundless heights of the Jade Pure Heaven, roaming the void within scarlet clouds.",
      "overlap_context": " Eastern Flower engraves the directions.\nFive Numinous Ones assist,\nEight Emperors shine together.\nBearing Jia, riding Yi,\nExiting Wood to enter emptiness.\nSix Ding spirits attend,\nJade maidens support.\nCommand mountains, summon seas,\nGovern dragons.\nWhistle to summon wind, raise clouds,\nAll obeys instantly.\nHeavenly demons submit to trials,\nMyriad spirits revere and follow.\nTransform the luminous body,\nAscend to the Jade Palace.\nYearly offerings at Mount Tai,\nEternal preservation without end.\"*",
      "start_char": 3455,
      "end_char": 4684,
      "start_sentence": 99,
      "end_sentence": 124,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.818047523498535,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上九赤班符五帝内真经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "当叩齿三通，心言：今日上吉，良辰应真，玄愿普降，竟天纳新，愿乞道君，值回上仙，飞轮羽盖，下降我身，道君回降，我成帝臣，名言上清，东华结篇。 毕，思衡山君乘赤霞飞轮，下降兆房，赤炁郁郁，覆满一室，君在赤炁之中，手执赤简，注上我名於赤简之篇，微祝曰： 朱肠乘晨，徘徊九霄，丹舆飞盖，洞焕霞寥，曲回下映，监我心翘，上愿所陈，莫不感幽，抑披灵卫，形与神交，书名丹台，结字南瑶，六丙翼真，乘丁入飙，摄山封海，命制万祆，千精伏窜，群魔皆消，南岳既掌，三元来招，降致朱軿，升入皇朝，三景齐灵，后天而凋。 毕，仰咽三炁止。 修之九年，则衡山君授兆宝书，给仙官八人，降致神芝奇异之物，能知南方万里之事。 行之十八年，则致赤云之轮，飞行太空，上升玉清之宫。 西岳白帝内思庚辛入金七炁班符 西方白帝，姓混，讳辱归，头建七炁明光宝冠，衣白锦云光之袍素锦飞裙，佩素灵之绶，龙潮漫诞之剑。 常以立秋之日，乘素云飞舆，从太素玉女十二人，白虎手把七色华旛，游行西岳华山，校定真人仙官录札，及学者之名，时诣西海水帝神王，考算学道功过罪目，回降佩符者身。 学者服其符以招其人，存其炁以降其真，削除水帝之简，上名玉札之篇。 当以立秋之日晡时，沐浴斋静，入室烧香，服庚辛入金七炁班符，叩齿三通，思西方白帝君讳字，衣服形色，乘紫云飞舆，下降兆房，白炁奕奕，覆满一室，冠匝己形。 存见帝君在白炁之中化为太白星，赫赫照明，从头顶而下，入兆身中，光明洞映肺部之间。 便引炁七咽，觉身熏热，须臾，太白星於肺中散为白炁，从九孔中出，回合还兆头顶之上，化成白云，觉兆身在白云之中，随云而升，良久觉定，豁如蹈空，仰祝曰： 七炁飞精，西华金灵，龙变九道，万物自生，日月过度，飞羽陆冥，幽虚玄真，三合七成，变化入景，辛回景星，帝讳符合，变化我形，上承皇威，部御神兵，制山检海，封岳命精，真不咸来，受事我庭，兴云起雨，降致素軿，九龙七虎，策御六丁，迅我飞虎，出玄入青，上造朱月，金治炼明，逍遥华堂，长保天经。 毕，又叩齿七通、咽液三十二过止。 行之九年，则能书名於石，炼石成金，书符投石，石隐兆形，书符投山，山降素云，书符投水，水上龙精，埋符西岳，则给仙官，降致自然神奇异物。 一十八年修行，则能乘空飞升玉清。 轻泄此道，罚以神兵，七祖负考，长役鬼官，慎秘修行，克获上仙。 太上庚辛入金七炁班符，朱书，立秋之日晡时，西向服之，祝如上法。 又以七月、八月庚申、辛酉之日，朱书桐板之上，令广六寸，长一尺二寸，埋之所住西岳，令深六尺。 庚辛唯一日也，如法三年一埋，不年年也。 但存思服御，依节行之尔，九年，白帝君及华山君无不降见於兆形也。 此一名九微入神封灵玄，一名赤白自生七变金门。 得见此道，西母降真，万变立成，飞升帝神。 埋符之时，当西向叩齿十二通，存思白炁之云，覆冠一山之上，西岳华山君，乘白龙云车，手执七色飞行羽节，从华山仙官十二人，在白炁之中监映兆身，仰祝曰： 六炁徊灵，三合成一，五云变化，转九会七，帝尊混合，神生金室，是时何时，上愿之日，所向所求，靡不良吉，命灵召神，群魔随灭，八道散明，我真穆穆，五岳齐眉，与帝相毕。",
      "translated_text": "At this moment, strike the teeth three times and silently recite: \"Today is most auspicious, the perfect hour for perfected beings. May the mysterious vow descend universally, renewing all beneath heaven. I beseech the Dao Lord to turn and send down the flying immortals, their feathered canopies descending upon my body. As the Dao Lord descends, I become an imperial minister, my name inscribed in the Upper Clarity, my destiny bound to the Eastern Flower.\"\n\nWhen finished, visualize the Lord of Mount Heng riding his scarlet mist flying wheel, descending into your chamber. Crimson qi billows densely, filling the room. The Lord stands amidst the crimson qi, holding a vermilion tablet, inscribing your name upon its register. He softly intones:\n\n\"Vermilion guts ride the dawn, circling the Nine Heavens.\nCinnabar chariot and flying canopy, radiant through the rosy void.\nCurving downward to illuminate, overseeing my heart’s devotion.\nAll vows I present shall move the unseen.\nUnfurl the numinous guard, body and spirit in communion.\nInscribe my name on the Cinnabar Terrace, bind my script to Southern Jade.\nSix Bing days escort the perfected, riding Ding to enter the whirlwind.\nCommand mountains and seal seas, restrain the myriad calamities.\nA thousand spirits cower, all demons disperse.\nAs the Southern Marchmount is grasped, the Three Origins summon me.\nDescend with the vermilion carriage, ascend into the imperial court.\nThe Three Luminaries unite in power, outlasting heaven’s decay.\"\n\nWhen finished, raise your head and swallow the qi three times to conclude.\n\nPractice this for nine years, and the Lord of Mount Heng will bestow upon you a treasure script, along with eight immortal officials, and grant rare spirit-mushrooms and wondrous objects, enabling you to know all affairs within ten thousand *li* of the south.\n\nPractice for eighteen years, and you will attain the scarlet cloud wheel, soaring through the great void to ascend to the Jade Pure Palace.\n\n---\n\n**Western Marchmount White Emperor: Ingesting Metal Qi of Geng and Xin, the Seven Qi Talisman**\n\nThe Western White Emperor, surnamed Hun, personal name Rugui, wears a Seven Qi Bright Radiance Precious Crown, a white brocade cloud-light robe and plain silk flying skirt, and bears a jade-white divine sash and a dragon-tide-drooling sword.\n\nOn the day of the Beginning of Autumn, he rides a plain cloud flying chariot, accompanied by twelve Jade Maidens of Great Simplicity. Each holds a seven-colored flower banner, and they roam the Western Marchmount Mount Hua, reviewing the registers of perfected beings and immortal officials, as well as the names of disciples. At times, they visit the Water Emperor and Divine King of the Western Sea to examine the merits, faults, and transgressions of those who cultivate the Dao. They then descend to bestow talismans upon the practitioners.\n\nDisciples who ingest this talisman to summon the deity should visualize the qi to attract the true essence, erasing their names from the Water Emperor’s tablets and inscribing them upon the jade registers.\n\nOn the day of the Beginning of Autumn at dusk, bathe, purify, and fast, then enter the chamber to burn incense. Ingest the *Geng-Xin Entering Metal Seven Qi Talisman*, strike the teeth three times, and visualize the Western White Emperor’s name and attire, his form and colors. See him riding a purple cloud flying chariot, descending into your chamber. White qi shimmers brilliantly, filling the room and encircling your body.\n\nVisualize the Emperor within the white qi transforming into the Great White Star, blazing with radiance. It descends from the crown of your head into your body, its light illuminating the space between your lungs. Then draw in the qi and swallow it seven times, feeling your body grow warm. Soon, the Great White Star within your lungs scatters into white qi, emerging from the nine orifices and reuniting above your head, forming a white cloud. Feel your body within the cloud, ascending with it. After a long while, the sensation stabilizes, as if treading empty space. Raise your head and intone:\n\n\"Seven qi fly as essence, Western Flower’s metal spirit.\nDragon transforms the nine paths, all things arise of themselves.\nSun and moon pass in measure, flying feathers traverse the dark.\nMysterious void and profound truth, three unite and seven complete.\nTransformation enters the luminous, Xin turns the radiant star.\nThe Emperor’s name and talisman merge, transforming my form.\nI uphold the imperial might, commanding divine soldiers.\nRestrain mountains and inspect seas, seal peaks and command spirits.\nAll perfected beings come, receiving duties at my court.\nSummon clouds and raise rain, descend with the plain carriage.\nNine dragons and seven tigers, driving the Six Ding.\nHasten my flying tiger, exiting the mysterious and entering the azure.\nAscend to the vermilion moon, gold refines and brightens.\nRoam the Flowery Hall, eternally preserving the celestial scriptures.\"\n\nWhen finished, strike the teeth seven times and swallow saliva thirty-two times to conclude.\n\nPractice this for nine years, and you will be able to inscribe your name upon stone, refine stone into gold, and cast talismans into stone to conceal your form. Cast talismans into mountains, and they will send down plain clouds; cast them into water, and dragons will rise from the depths. Bury talismans in the Western Marchmount, and immortal officials will be granted, bestowing natural and wondrous objects.\n\nAfter eighteen years of practice, you will be able to ride the void and ascend to the Jade Pure Heaven.\n\nRevealing this Dao lightly will incur punishment by divine soldiers. Your seven generations of ancestors will suffer torment, bound to serve as ghost officials. Guard this secret in your cultivation, and you shall attain the rank of highest immortal.\n\n---\n\n**The Supreme Geng-Xin Entering Metal Seven Qi Talisman**\nWrite in vermilion. On the day of the Beginning of Autumn at dusk, face west and ingest it, reciting the incantation as above.\n\nAlso, on the days of Gengshen and Xinyou in the seventh and eighth months, write in vermilion on paulownia wood, six *cun* wide and one *chi* two *cun* long. Bury it six *chi* deep in the Western Marchmount where you reside. Geng and Xin occur only once a day; bury it once every three years, not annually. Simply visualize, ingest, and practice according to the proper times. After nine years, the White Emperor and the Lord of Mount Hua will descend without fail to appear before you.\n\nThis is also called *Nine Subtleties Entering the Spirit and Sealing the Numinous*, or *Red and White Self-Generating Seven Transformations Golden Gate*. Those who obtain this Dao will have the Queen Mother of the West descend in truth, myriad transformations instantly accomplished, and ascend to the ranks of imperial spirits.\n\nWhen burying the talisman, face west and strike the teeth twelve times. Visualize white qi clouds crowning a mountain, and the Lord of Mount Hua riding a white dragon cloud chariot, holding a seven-colored flying feathered staff. Accompanied by twelve immortal officials of Mount Hua, they stand within the white qi, overseeing and illuminating your body. Raise your head and intone:\n\n\"Six qi circle in spirit, three unite as one.\nFive clouds transform, turning nine and seven.\nThe Emperor’s honor merges, spirit born in the golden chamber.\nAt this time, what time is it? The day of my highest vow.\nAll I seek shall be most auspicious.\nCommand spirits and summon deities, all demons follow in destruction.\nEight paths scatter in brightness, my true self serene.\nThe Five Marchmounts bow in reverence, completing the audience with the Emperor.\"",
      "overlap_context": "Yangguang, wearing an Eight Brilliances Precious Radiance Jade Crown, a crimson brocade flying skirt, and a divine radiance crimson-patterned robe, bearing the talisman for sealing spirits and restraining demons. He rides a scarlet mist flying wheel, accompanied by twelve immortals of the Southern Marchmount, each mounted on flying phoenixes and holding spirit-mushrooms. They circle the southeast, ascending to the boundless heights of the Jade Pure Heaven, roaming the void within scarlet clouds.",
      "start_char": 4684,
      "end_char": 5960,
      "start_sentence": 125,
      "end_sentence": 150,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 39.97192859649658,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上九赤班符五帝内真经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "毕，埋符如式，仰白炁二十四咽止。 西岳华山君，常以秋分之日，列奏真仙已得道及始学之人名录，上言高上帝君，检校玄名，区别功过。 修飞仙之道，当以其日晡时，沐浴斋静，入室烧香，西向思华山君，姓浩丘，讳元仓，头建六元通神飞冠，衣白锦飞裙，披素锦之裘，带交灵素绶，乘霞飞轮，从西岳仙官十二人，悉乘十二白虎，手把七色华幡，西南而回，上登无崖之上玉清之天，徘徊空虚之内白云之中。 当叩齿七通，心言：我愿飞仙，上升玉清，飞入华岳，与帝同灵，乞丐道君，降我真形，为我致仙，书我玄名。 毕，思华山君乘白霞飞轮，下降兆房，白炁奕奕，覆满一室，君在白炁之中，手执白简，注上我名於白简之篇，微祝曰： 金门焕明，白云巍峨，四会交真，八炁结罗，上吉告晨，帝灵升霞，回神下降，曲盻我家，谓我白简，书名西华，七真部仙，制御掌魔，上承皇威，摄山命河，兴云降雨，龙轮立过，运我飞虚，上造灵阿，所愿立致，所剪立嵯，千变万化，洞明玄霞。 毕，仰咽七炁止。 修之九年，则华山君为兆致神仙之药，给仙童七人，九年能明西方万里之事，吉凶之兆。 行之十八年，降致白云之轮，飞行太空，上升玉清之宫。 北岳黑帝内思壬癸入水五炁班符 北方黑帝君，姓玄，讳朔萌，头建五炁玄晨之冠，衣玄锦之袍五色飞裙，佩七元流铃，带文身通神之剑。 常以立冬之日，乘玄云飞舆，从太玄玉女十二人，乘十二飞龟，手把五色华旛，游行北岳恒山，校定真人仙官录札，及学者之名，时诣北海水帝神王，考算学道功过罪目，回降佩者身。 学者服其符以招其神，存其炁以降其真，削水帝之简，上名玉札之篇。 当以立冬之日夜半，沐浴斋静，入室烧香，服壬癸入水五炁班符，叩齿五通，思北方黑帝君讳字，衣服色形象，乘玄云飞舆，下降兆房，黑炁勃勃，覆满一室，冠匝己形。 存见帝君在黑炁之中化为辰星，赫赫照明，从头顶而下，入兆身中，光明洞映肾部之间。 便引炁五咽，觉身熏热，须臾，辰星於肾中散为黑炁，从九孔中出，回合还兆头顶之上，化成黑云，觉兆身在黑炁之中，随云而升，良久觉定，豁如蹈空，仰祝曰： 五神通真，化炁广阳，七元回灵，焕落北方，帝尊告令，八节御光，上总万仙，下统无穷，乘炁迅虚，回降我房，授我玄符，变化流通，带壬入洞，负癸升空，封掌五岳，制命九江，召山兴雨，符水上龙，飞軿紫盖，升入帝宫。 毕，又叩齿五通，咽液十八过止。 行之九年，则能书符投水，水上蛟龙，停流止波，入水如空，埋符北岳，则给仙官，降致神药不死之方。 一十八年，坐在立亡，乘虚飞行，上升玉清。 其道高妙，不传非真，轻泄灵文，七祖负考，身没鬼官，长充幽徒，不得又仙。 太上壬癸入水五炁班符，朱书，立冬之日夜半，北向服之，祝如上法。 又以十月、十一月壬子、癸亥之日，朱书桐板之上，令广五寸，长一尺二寸，埋之所住北岳，令深五尺。 壬癸唯一日也，如此法三年一埋，不年年也。 但存思服御，依节行之尔，九年，黑帝君及恒山君降见於兆形也。 此一名交升云门七变五合，一名五灵玄阴中道万毕。 有得此文，仙道立成，行之变景，飞升紫清。",
      "translated_text": "When finished, bury the talisman as prescribed, then look upward and swallow white qi twenty-four times to conclude.\n\nOn the autumn equinox, the Lord of Mount Hua presents to the Supreme High Emperor a register of perfected immortals who have attained the Dao, along with the names of those newly embarked on the path. He examines their mystical names and distinguishes their merits and transgressions.\n\nTo cultivate the way of flying immortality, on that day at dusk, bathe, purify, and enter the chamber to burn incense. Face west and visualize the Lord of Mount Hua, whose surname is Haoqiu and whose given name is Yuancang. He wears a six-fold spirit-communing flying crown, a white brocade flying skirt, and a plain silk robe, girded with an intertwined spirit-silk sash. Riding a cloud-borne flying wheel, accompanied by the twelve immortal officials of Mount Hua—each mounted on a white tiger and holding a seven-colored floral banner—they circle to the southwest, ascending to the boundless Jade Purity Heaven, drifting amidst the void within white clouds.\n\nStrike the teeth seven times and silently intone: \"I vow to become a flying immortal, to ascend to Jade Purity, to soar into Mount Hua, and to share the numinous power of the Emperor. I beseech the Dao Lord to descend my true form, to grant me immortality, and to inscribe my mystical name.\"\n\nWhen done, visualize the Lord of Mount Hua descending to your chamber in a white-cloud flying wheel, white qi resplendent, filling the room. He stands within the white qi, holding a white tablet, and inscribes your name upon its surface. Softly intone:\n\n\"Golden gates gleam bright, white clouds tower high.\nFour gatherings merge in truth, eight qi weave their net.\nAuspicious dawn is proclaimed, the Emperor’s spirit ascends in mist.\nTurn and descend in spirit, graciously regard my home.\nInscribe my name upon the white tablet, record it in the Western Hua.\nThe Seven Perfected and host of immortals command and restrain demons,\nUphold the August Might, govern mountains and rivers,\nSummon clouds and send down rain, dragon wheels swiftly pass.\nConvey me through the void, ascending to the Numinous Mound.\nWhat I desire is instantly achieved, what I sever is at once undone.\nA thousand transformations, ten thousand changes, penetrating the radiance of the mystical mist.\"\n\nWhen finished, look upward and swallow qi seven times to conclude. After nine years of practice, the Lord of Mount Hua will bestow upon you the elixir of immortality and assign seven immortal youths. In nine years, you will comprehend affairs a myriad miles to the west and discern the omens of fortune and misfortune. After eighteen years, a white-cloud wheel will descend, enabling you to soar through the great void and ascend to the Jade Purity Palace.\n\n**Northern Marchmount Black Emperor: Ingesting Ren-Gui Water Qi and the Five Qi Talisman**\n\nThe Black Emperor of the North, whose surname is Xuan and whose given name is Shuomeng, wears a five-qi dark-morning crown, a black brocade robe with a five-colored flying skirt, a seven-fold flowing bell, and a spirit-communing sword inscribed with talismanic patterns.\n\nOn the day of the beginning of winter, he rides a dark-cloud flying chariot, accompanied by the twelve Jade Maidens of Great Mystery, each mounted on a flying turtle and holding a five-colored floral banner. They traverse the Northern Marchmount Mount Heng, reviewing the registers of perfected immortals and immortal officials, as well as the names of learners. At that time, they visit the Water Emperor and Spirit King of the Northern Sea to assess the merits, transgressions, and faults of those cultivating the Dao, then descend to the practitioner’s body.\n\nLearners ingest the talisman to summon the deity, visualize the qi to attract the true essence, and erase their names from the Water Emperor’s tablet, inscribing them instead upon the jade register.\n\nOn the night of the beginning of winter at midnight, bathe, purify, and enter the chamber to burn incense. Ingest the *Ren-Gui Water Qi Five Qi Talisman*, strike the teeth five times, and visualize the Black Emperor’s given name and style, his attire and form. See him riding a dark-cloud flying chariot descending to your chamber, black qi surging, filling the room and encircling your form.\n\nVisualize the Emperor within the black qi transforming into the Chen Star, radiant and luminous, descending from your crown into your body, its brilliance illuminating the region of the kidneys. Then draw in qi and swallow five times, sensing your body suffused with warmth. After a moment, the Chen Star within the kidneys scatters into black qi, exiting through the nine orifices and reuniting above your crown to form a black cloud. Feel your body within the black qi, ascending with the cloud. After a long while, the sensation stabilizes, as if treading empty space. Look upward and intone:\n\n\"Five spirits commune with truth, transforming qi into vast yang.\nSeven origins revolve in spirit, shining in the north.\nThe August Emperor proclaims his decree, the eight nodes govern radiance.\nAbove, he oversees the myriad immortals; below, he commands the boundless.\nRiding qi through the void, descending to my chamber,\nHe bestows upon me the dark talisman, its transformations flowing freely.\nBearing *ren* to enter the cavern, carrying *gui* to ascend the sky,\nSealing and commanding the Five Marchmounts, governing the nine rivers,\nSummoning mountains and invoking rain, talismanic waters ascend the dragon.\nFlying chariots and purple canopies ascend to the Emperor’s palace.\"\n\nWhen finished, strike the teeth five more times and swallow saliva eighteen times to conclude. After nine years of practice, you will be able to inscribe talismans and cast them into water, causing dragons to halt their flow and waves to still. Entering water will be like traversing empty space. Burying talismans in the Northern Marchmount will summon immortal officials to descend and bestow the elixir of immortality. After eighteen years, you will be able to sit in disappearance, ride the void in flight, and ascend to Jade Purity. This Dao is lofty and wondrous; it is not transmitted to the untrue. Those who lightly divulge its sacred texts will cause their seven ancestors to bear suffering, their bodies to be consigned to the offices of ghosts, and themselves to remain eternally as prisoners of the dark. They will never again attain immortality.\n\nThe *Supreme Ren-Gui Water Qi Five Qi Talisman* is written in cinnabar. On the night of the beginning of winter at midnight, face north to ingest it, reciting the incantation as above. Additionally, on *renzi* and *guihai* days in the tenth and eleventh months, write in cinnabar on paulownia wood, five inches wide and twelve inches long, and bury it five feet deep in the Northern Marchmount where you reside. *Ren* and *gui* occur only once a day; thus, perform this rite once every three years, not annually. Simply visualize, ingest, and practice in accordance with the seasonal nodes. After nine years, the Black Emperor and the Lord of Mount Heng will descend and appear before you. This is also called *Intersecting Ascension Cloud Gate Seven Transformations Five Unions* and *Five Spirits Dark Yin Central Dao of the Myriad Completions*. Those who obtain this text will swiftly achieve the Dao of immortality. Practicing it transforms one’s luminous form, enabling flight and ascent to the Purple Purity.",
      "overlap_context": "g your body. Raise your head and intone:\n\n\"Six qi circle in spirit, three unite as one.\nFive clouds transform, turning nine and seven.\nThe Emperor’s honor merges, spirit born in the golden chamber.\nAt this time, what time is it? The day of my highest vow.\nAll I seek shall be most auspicious.\nCommand spirits and summon deities, all demons follow in destruction.\nEight paths scatter in brightness, my true self serene.\nThe Five Marchmounts bow in reverence, completing the audience with the Emperor.\"",
      "start_char": 5960,
      "end_char": 7186,
      "start_sentence": 151,
      "end_sentence": 177,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.955410957336426,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上九赤班符五帝内真经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "埋符之时，当北向叩左齿二十四通，存思黑炁之云，覆冠一山之上，北岳恒山君乘黑龙云车，手执五色飞仙羽节，从恒山仙官十二人，在黑炁之中监映兆身，仰祝曰： 玄武交升，五变成神，三合九离，乃会玉门，上节八愿，我享其仙，安炁镇灵，五岳保令，乘空命虚，万魔来身，降致云舆，玄辇紫轩，飞行太空，上升帝晨，长与北君，保命天真。 毕，埋符如式，仰引黑炁二十四咽止。 北岳恒山君，常以冬至之日，列奏真仙已得道及始学之人名录，上言高上帝君，检校玄名，区别功过。 修飞仙之道，当以其日夜半，沐浴斋静，入室烧香，北向思怛山君，姓伏，讳通萌，头建五炁宝晨玉冠，衣黑锦飞裙，披玄文明光之裘，带交灵紫绶，乘玄霞飞轮，北岳仙官十二人，悉乘飞龟，手把五色华幡，西北而回，上登无崖之上玉清之天，徘徊空虚之内玄云之中。 当叩齿五通，心言：今日上吉，八节回还，道君回降，曲盻我身，领掌命录，长保天年。 毕，思恒山君乘黑霞飞轮，下降兆房，黑炁勃勃，覆满一室，君在黑炁之中，手执紫简，注上我名於紫简之篇，微祝曰： 玄阴回灵，乘日御晨，五炁总真，普统群仙，安景上宫，徘徊云陈，曲降监映，来我房轩，书名玄简，记上玉篇，使我通明，洞彻入真，制命五灵，封河召山，降龙起雨，导云兴烟，飞霄轻轮，升入帝晨。 毕，仰咽五炁止。 修之九年，则恒山君为兆降致玄龙云舆，给以仙官五人，招北方神真灵药，洞明北方未然之事，吉凶之兆。 行之十八年，飞行上清，与北岳帝君齐保玉真也。 中岳黄帝内思戊己入土一炁班符 中央黄帝君，姓麻，讳忠慎，头建黄晨通天玉冠，衣黄锦之袍玄黄飞云锦裙，佩黄帝越元之策，带灵飞紫绶。 常以太岁之日，乘黄云飞舆，从黄素玉女十二人，乘十二飞鳞，手把五帝华幡，游行中岳嵩山，校定真人仙官录札，及学者之名，时诣三河四海十二水帝神王，考算学道功过罪目，回降佩符者身。 学者服其符以招其神，存其炁以降其真，削字水帝之简，上名玉札之篇。 当以太岁之日中后，沐浴斋静，入室烧香，服戊己入土一炁班符，叩齿十二通，思中央黄帝君讳字，衣服形色，乘黄云飞舆下降兆房，黄炁郁郁，覆满一室，冠匝己形。 存见帝君在黄炁之中化为镇星，赫赫照明，从头顶而下，入兆身中，光明洞映脾部之间。 便引炁十二咽，觉身熏热，须臾，镇星於脾中散为黄炁，从九孔中出，回合还兆头顶之上，化成黄云，觉兆身在黄云之中，随云而升，良久觉定，豁如蹈空。 仰祝曰： 中灵黄元，十二飞精，五炁混化，高皇洞明，是日上吉，总摄万灵，检录校札，除罪结生，回真流盻，曲降我庭，为我落死，刻简紫名，辅我太真，给我神兵，匡制五岳，封山召灵，群魔灭试，我道肃清，乘戊负己，洞入无形，兴云降雨，飞霄紫軿，造晏五岳，与帝合并。 毕，又叩齿十二通，咽炁十二过止。 行之九年，则知三十六国之音，知万渊之下三十六土皇形色，书符把玉，形与土合，埋符中岳，则使黄素玉女十二人，致自然之厨不死之药。 行之十八年，则能飞行玄虚，上升玉清。 秘之神仙，轻泄九祖获考，身负三徒，充责幽冥。 太上戊己入土一炁班符，朱书，太日日中后，向四季服之，祝如上法。",
      "translated_text": "When burying the talisman, face north and strike the left teeth twenty-four times. Visualize clouds of black *qi* crowning a mountain peak, with the Lord of Mount Heng of the Northern Marchmount riding a cloud chariot drawn by a black dragon, holding a five-colored feathered staff of flying immortals. Accompanied by twelve immortal officials of Mount Heng, they oversee and illuminate your form within the black *qi*. Look up and pray:\n\n*\"Dark Warrior intersects and ascends,\nFive transformations complete the spirit,\nThree unions and nine departures\nConverge at the Jade Gate.\nEight vows fulfill the upper nodes,\nI partake of their immortality.\nPacify *qi* and stabilize the numinous,\nThe Five Marchmounts protect and command.\nRiding the void and summoning emptiness,\nMyriad demons come to my body.\nDescend with cloud chariots,\nDark carriages and purple chariots,\nSoaring through the great void,\nAscending to the Imperial Dawn,\nForever with the Northern Lord,\nPreserving life and celestial perfection.\"*\n\nConclude, then bury the talisman as prescribed. Inhale and swallow the black *qi* twenty-four times to finish.\n\nThe Lord of Mount Heng of the Northern Marchmount regularly presents, on the Winter Solstice, a register of perfected immortals and those newly embarking on the Dao to the Supreme Emperor, reviewing their celestial names and distinguishing merits from transgressions.\n\nTo practice the Dao of flying immortals, on that day at midnight, bathe, purify, and enter the chamber to burn incense. Face north and visualize the Lord of Mount Heng, surnamed Fu, named Tongmeng, wearing a five-*qi* treasure dawn jade crown, clad in a black brocade flying skirt and a dark patterned luminous robe, girded with an intertwining numinous purple sash. Riding a dark rosy-cloud flying wheel, with twelve officials of the Northern Marchmount each mounted on flying turtles and holding five-colored floral banners, they circle the northwest, ascending to the boundless Jade Purity of Heaven, wandering amidst the emptiness within the dark clouds.\n\nStrike the teeth five times and silently recite: *\"Today is most auspicious,\nThe eight nodes return in cycle,\nThe Dao Lord descends in turn,\nGazing upon my form,\nOverseeing the register of life,\nForever preserving celestial years.\"*\n\nConclude, then visualize the Lord of Mount Heng descending to your chamber in a black rosy-cloud flying wheel, black *qi* surging and filling the room. Within the black *qi*, the Lord holds a purple tablet, inscribing your name upon its pages. Softly pray:\n\n*\"Dark Yin returns the numinous,\nRiding the sun and governing the dawn,\nFive *qi* gather the perfected,\nUniversally governing the host of immortals.\nPacify the luminous upper palace,\nWandering amidst the cloud array,\nDescend in turn to oversee and illuminate,\nEntering my chamber.\nInscribe my name on the dark tablet,\nRecord it in the jade register above,\nGrant me penetrating clarity,\nThoroughly entering perfection.\nCommand the Five Numinous,\nSeal rivers and summon mountains,\nDescend dragons and summon rain,\nGuide clouds and raise mist,\nRide the light wheel through the clouds,\nAscending into the Imperial Dawn.\"*\n\nConclude, then inhale and swallow the *qi* five times to finish.\n\nPractice this for nine years, and the Lord of Mount Heng will descend to you with a dark dragon cloud chariot, assigning five immortal officials to summon the divine medicines of the Northern Perfected. You will clearly perceive future events in the north, discerning auspicious and inauspicious omens. After eighteen years of practice, you will soar to the Upper Clarity, jointly preserving jade perfection with the Emperor of the Northern Marchmount.\n\n**Central Marchmount Yellow Emperor’s Internal Visualization of Earth *Qi* and the Talisman of the Cyclic Branches Wu and Ji**\n\nThe Yellow Emperor of the Central Marchmount, surnamed Ma, named Zhongshen, wears a yellow dawn jade crown piercing the heavens, a yellow brocade robe with a dark yellow flying-cloud brocade skirt, carries the Yellow Emperor’s Yueyuan tally, and is girded with a numinous flying purple sash.\n\nOn the day of the Great Year Star, he rides a yellow-cloud flying chariot, accompanied by twelve Yellow Essence Jade Maidens, each mounted on twelve flying scaled creatures and holding five-colored imperial floral banners. They traverse the Central Marchmount, Mount Song, reviewing the registers of perfected immortals and celestial officials, as well as the names of learners. They visit the spirit kings of the Three Rivers, Four Seas, and Twelve Waters to assess the merits, transgressions, and faults of Dao practitioners, then descend to the bodies of those wearing the talisman.\n\nLearners ingest the talisman to summon its spirit, visualize its *qi* to descend its perfected essence, and inscribe their names on the water emperors’ tablets, recording them in the jade registers.\n\nOn the day of the Great Year Star at midday, bathe, purify, enter the chamber, and burn incense. Ingest the talisman of the Earth *qi* of Wu and Ji, strike the teeth twelve times, and visualize the Yellow Emperor of the Central Marchmount—his name and taboo, attire, and appearance. See him riding a yellow-cloud flying chariot descending to your chamber, yellow *qi* billowing and filling the room, encircling your form.\n\nVisualize the Emperor within the yellow *qi*, transforming into the Star of Stability, radiant and luminous, descending from your crown into your body, its brilliance illuminating the region of the spleen. Inhale and swallow the *qi* twelve times, feeling your body suffused with warmth. Soon, the Star of Stability within the spleen disperses into yellow *qi*, exiting through the nine orifices, converging and returning above your crown to form a yellow cloud. Feel your body within the yellow cloud, ascending with it. After a long while, the sensation stabilizes, as if treading upon emptiness.\n\nLook up and pray:\n\n*\"Central Numinous Yellow Origin,\nTwelve flying essences,\nFive *qi* blend and transform,\nThe August Emperor thoroughly illuminates.\nToday is most auspicious,\nGathering and governing the myriad numinous,\nReviewing registers and tallying records,\nErasing sins and dissolving karmic bonds.\nReturning the perfected and flowing gaze,\nDescend in turn to my court,\nSever my death,\nInscribe my name on the purple tablet,\nAssist my great perfection,\nGrant me divine soldiers,\nRectify and command the Five Marchmounts,\nSeal mountains and summon spirits,\nAnnihilate the host of demons,\nPurify my Dao.\nRiding Wu and bearing Ji,\nThoroughly entering formlessness,\nRaising clouds and descending rain,\nSoaring through the clouds in a purple chariot,\nAttaining tranquility with the Five Marchmounts,\nMerging with the Emperor.\"*\n\nConclude, then strike the teeth twelve times and swallow the *qi* twelve times to finish.\n\nPractice this for nine years, and you will understand the languages of the thirty-six nations and perceive the forms and colors of the thirty-six Earth Emperors beneath the ten thousand abysses. Write talismans and grasp jade, your form merging with earth. Bury the talisman in the Central Marchmount, and the twelve Yellow Essence Jade Maidens will bring the natural kitchen and the elixir of immortality.\n\nAfter eighteen years, you will be able to fly through the dark void and ascend to the Jade Purity.\n\nGuard this as a divine immortal secret. Revealing it lightly will bring nine generations of ancestors to trial, and you will bear the three faults, condemned to the nether darkness.\n\n**The Supreme Talisman of Earth *Qi* of Wu and Ji**\nWrite in cinnabar. On the day of the Great Year Star at midday, face the four seasons and ingest it, praying as prescribed above.",
      "overlap_context": "Simply visualize, ingest, and practice in accordance with the seasonal nodes. After nine years, the Black Emperor and the Lord of Mount Heng will descend and appear before you. This is also called *Intersecting Ascension Cloud Gate Seven Transformations Five Unions* and *Five Spirits Dark Yin Central Dao of the Myriad Completions*. Those who obtain this text will swiftly achieve the Dao of immortality. Practicing it transforms one’s luminous form, enabling flight and ascent to the Purple Purity.",
      "start_char": 7186,
      "end_char": 8435,
      "start_sentence": 178,
      "end_sentence": 202,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.8279972076416,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上九赤班符五帝内真经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "又以三月、六月、九月、十二月，戊辰、戊戌、己丑、己未之日，朱书桐板之上，令广三寸，长一尺二寸，一埋之所住中央，令深一尺二寸。 四季唯一日，如此法三年一埋，不年年也。 但存思服御，依日而行之，九年，黄帝嵩高山君，无不降见於兆形也。 此一名玄真总晖自生万度，一名神飞九道灵变自然。 有得此道，立升云宫。 埋符之时，当向四季叩齿十二通，存思黄炁之云，覆冠一山之上，中岳山君乘黄龙云车； 手执玄黄十二节麾，从嵩高山仙官十二人，在黄炁之中监映兆身，仰祝曰： 三素流飙，黄云五缠，道合万变，玄虚举真，神安灵岳，道降我身，黄白早分，记名紫篇，封山召河，制御群仙，兴云降雨，黄霄飞轮，乘空步玄，上升高晨。 毕，埋符如式，仰行黄炁十二咽止。 中岳嵩高山君，以三月、六月、九月、十二月，戊辰、戊戌、己丑、己未之日，列奏真仙已得道及始学之人名录，上言高上帝君，检校玄名，区别功过，修飞仙之道，当以其日日中后，沐浴斋静，入室烧香，向四季思中岳君，姓角，讳普生，头建中元黄晨玉冠，衣黄锦飞裙，披玄黄文裘，带黄神中皇之章，乘黄霞飞轮，从中岳仙官十二人，悉乘飞驎，手把玄黄十二节麾，西南而回，上登无崖之上玉清宫，徘徊空虚之中黄云之内。 叩齿十二通，心言：天垂上愿，我享其恩，念虚降灵，思微致仙，中岳之君，结我同轩，使我飞行，升到金门。 毕，思嵩高山君乘黄霞飞轮，下降兆房，黄炁勃勃，覆满一室，君在黄炁之中，手执黄简，注上我名於黄简之上，微祝曰： 黄灵中玄，道翳紫天，三合成一，结虚而仙，掌录保篇，固命度年，列名东华，记仙中秦，五灵监映，使我道鲜，出虚入微，洞彻九玄，身生水火，变景亿千，乘空步虚，飞行无间。 毕，仰咽十二炁止。 修之九年，则与中岳君对面共言，为兆降致黄龙飞舆； 给以仙官，取自然之物以与兆身。 行之十八年，道成飞仙，上升玉清。 四海水帝内思除罪削简上法 太上九赤封海通真班符 东海水帝九源青炁班符 太上九元青炁班符，常以立春、春分之日分、平旦，朱书青纸上，东向服之。 行事讫，朱书符桐板，上记：某年某月某日子，某郡县某乡里某岳先生某，年若干岁，某月生，於符下。 以青石九两，青丝缠之，着符下，投之东流之水。 常以其日清斋，入室烧香，东向叩齿十二通，思东海水帝神王，姓王，讳度源，头建太晨宝明之冠，衣青文翠羽飞裙，带七色师子虎头鞶囊，乘碧辇飞龙，从东海水帝十二仙掾，乘十二苍龙，飞行上诣高皇玉帝，徘徊青云，回降我身，青炁郁郁，内外晻冥。 神王对坐我前，削我死简，注我仙录，微祝曰： 洞渊九源，上参玉清，分流二炁，混合同生，上总上真，下典兆名，是日良吉，八愿齐并，水帝削罪，记功上灵，太一固年，保命黄宁，形交九都，炁应神精，左役天甲，右运六丁，命山召海，降舆龙軿，运我飞升，上朝三清，羽仪翼翼，金珰玲玲，徘徊步空，游宴紫庭，下观水宫，水受我形，使我长存，与劫同龄。 毕，服符，仰咽液九过止，便依法投符东流之渊。 行之十八年，水帝削兆罪简，言玉清降致龙軿，飞行太空，身入万丈之渊，与水帝对言。",
      "translated_text": "Moreover, on the days of *wuchen*, *wuxu*, *jichou*, and *jiwei* in the third, sixth, ninth, and twelfth months, write in cinnabar upon paulownia wood, making the talisman three *cun* wide and one *chi* and two *cun* long. Bury it at the center of your dwelling, one *chi* and two *cun* deep. Perform this once on a single day of each season, repeating the rite every three years—not annually. Simply maintain visualization and ingestion, following the prescribed days. After nine years, the Lord of Mount Song Gao of the Yellow Emperor will descend without fail to manifest before you.\n\nThis is called *Xuan Zhen Zong Hui Zi Sheng Wan Du* (\"Mystic Perfection’s Radiance, Self-Generating Myriad Transformations\"), also named *Shen Fei Jiu Dao Ling Bian Zi Ran* (\"Divine Flight through the Nine Paths, Wondrous Transformation by Nature\"). Those who attain this Dao will immediately ascend to the Cloud Palace.\n\nWhen burying the talisman, face the four seasons, knock the teeth twelve times, and visualize a cloud of yellow *qi* descending like a mountain to crown your head. The Lord of the Central Marchmount rides a cloud chariot drawn by a yellow dragon, wielding a twelve-jointed banner of dark and yellow, accompanied by twelve immortals of Mount Song Gao. They stand within the yellow *qi*, overseeing your form. Raise your gaze and pray:\n\n*\"Three Pure Ones, streaming gales,\nFive-fold coils of yellow cloud,\nDao harmonizes myriad changes,\nMystic void uplifts the true.\nSpirits settle on the sacred peak,\nDao descends into my body.\nYellow and white divide early,\nMy name inscribed in the Purple Register.\nSeal the mountains, summon the rivers,\nCommand the host of immortals.\nSummon clouds, descend rain,\nYellow auroras, flying wheels.\nStride the void, tread the mystic,\nAscend to the lofty morn.\"*\n\nWhen finished, bury the talisman as prescribed and swallow twelve breaths of yellow *qi*.\n\nThe Lord of the Central Marchmount and Mount Song Gao, on the days of *wuchen*, *wuxu*, *jichou*, and *jiwei* in the third, sixth, ninth, and twelfth months, presents the names of perfected immortals and those newly embarked on the path to the Supreme Emperor on High. He examines the records of the mystic names, distinguishing merit from transgression. To cultivate the Dao of flying immortality, on these days at midday, bathe, purify yourself, and enter your chamber to burn incense. Face the four seasons and visualize the Lord of the Central Marchmount, surnamed Jiao, named Pusheng, wearing a Jade Crown of the Yellow Dawn of the Middle Prime, clad in a yellow brocade flying skirt and a dark-yellow patterned robe, bearing the seal of the Yellow Divine Central August. He rides a flying wheel of yellow aurora, accompanied by twelve immortals of the Central Marchmount, all mounted on flying *lin* beasts, wielding twelve-jointed banners of dark and yellow. They circle to the southwest, ascending to the Jade Purity Palace upon the boundless heights, drifting through the empty void within the yellow clouds.\n\nKnock your teeth twelve times and silently intone:\n\n*\"Heaven suspends its highest vow,\nI receive its grace.\nYearning for the void, descending spirits,\nThoughts subtle, attaining immortality.\nLord of the Central Marchmount,\nBind me to your chariot.\nLet me fly and ascend,\nReach the Gate of Gold.\"*\n\nWhen finished, visualize the Lord of Mount Song Gao descending in his flying wheel of yellow aurora to your chamber. Yellow *qi* surges forth, filling the room. The Lord stands within the yellow *qi*, holding a yellow tablet, inscribing your name upon it. Softly pray:\n\n*\"Yellow numen, central mystery,\nDao veils the purple heavens.\nThree unite as one,\nBinding the void to become immortal.\nGrasp the register, preserve the record,\nSecure destiny, extend the years.\nInscribe my name in Eastern Florescence,\nRecord the immortal in the Central Qin.\nFive numina oversee and reflect,\nRefining my Dao to brilliance.\nEmerge from the void, enter the subtle,\nPierce the nine mysteries.\nBody born of water and fire,\nTransforming scenes by the myriad thousands.\nStride the void, tread the empty,\nFly without hindrance.\"*\n\nWhen finished, swallow twelve breaths of *qi* and cease.\n\nAfter nine years of cultivation, you will converse face-to-face with the Lord of the Central Marchmount, who will descend to bestow upon you a flying chariot drawn by a yellow dragon and appoint you as an immortal official, granting you natural treasures for your body. After eighteen years, the Dao will be perfected, and you will ascend as a flying immortal to the Jade Purity.\n\n**Method for Erasing Sins and Removing Names from the Registers by Meditating on the Water Emperors of the Four Seas**\n**The Supreme Nine Red Talismans for Sealing the Seas and Communicating with the True**\n**Talisman of the Nine Sources of Green *Qi* of the East Sea Water Emperor**\n**The Supreme Nine Primordial Green *Qi* Talismans**\n\nOn the days of *Lichun* and the Spring Equinox, at dawn, write in cinnabar upon green paper and ingest it facing east. After performing the rite, write the talisman in cinnabar upon paulownia wood, inscribing beneath it: *\"On such-and-such a year, month, and day, so-and-so, a master of the sacred peaks from such-and-such a prefecture, county, village, and hamlet, aged so many years, born in such-and-such a month.\"* Bind nine *liang* of green stone with green silk and place it beneath the talisman, then cast it into the eastward-flowing waters.\n\nOn these days, maintain purity and fast, enter your chamber to burn incense, face east, knock your teeth twelve times, and visualize the Divine King of the East Sea Water Emperor, surnamed Wang, named Duyuan. He wears a Precious Bright Crown of the Great Dawn, a flying skirt of green patterned kingfisher feathers, and a belt with a seven-colored lion-headed pouch. He rides a flying dragon-drawn jade carriage, accompanied by twelve immortal attendants of the East Sea Water Emperor, each mounted on a green dragon. They ascend to the High Emperor of the Jade Sovereign, drifting through the green clouds, then descend to your body. Green *qi* billows, darkening the inner and outer.\n\nThe Divine King sits before you, erases your death register, and inscribes your name in the immortal records. Softly pray:\n\n*\"Abyssal depths of nine sources,\nAscend to join the Jade Purity.\nDividing the two *qi*, flowing streams,\nMerging and harmonizing, born as one.\nAbove, govern the perfected,\nBelow, oversee the names of disciples.\nThis day is most auspicious,\nEight vows unite as one.\nThe Water Emperor erases sins,\nRecords merit to the highest spirits.\nThe Great Unity secures the years,\nPreserves life in yellow tranquility.\nForm joins the Nine Capitals,\n*Qi* responds to the divine essence.\nLeft, command the Heavenly Armor,\nRight, dispatch the Six Dings.\nSummon mountains, call forth seas,\nDescend chariots and dragon carriages.\nConvey me in flight,\nAscend to pay homage to the Three Purities.\nFeathered regalia, resplendent,\nGolden pendants, tinkling.\nDrifting, striding the void,\nRoaming the Purple Court.\nBelow, gaze upon the water palace,\nWaters receive my form.\nLet me endure forever,\nEqual in age to the kalpa.\"*\n\nWhen finished, ingest the talisman and swallow nine breaths of fluid. Then cast the talisman into the eastward-flowing abyss as prescribed.\n\nAfter eighteen years of cultivation, the Water Emperor will erase your sin register and report to the Jade Purity, descending a dragon carriage to traverse the great void. Your body will enter the ten-thousand-fathom abyss, where you will converse with the Water Emperor.",
      "overlap_context": "hen and the elixir of immortality.\n\nAfter eighteen years, you will be able to fly through the dark void and ascend to the Jade Purity.\n\nGuard this as a divine immortal secret. Revealing it lightly will bring nine generations of ancestors to trial, and you will bear the three faults, condemned to the nether darkness.\n\n**The Supreme Talisman of Earth *Qi* of Wu and Ji**\nWrite in cinnabar. On the day of the Great Year Star at midday, face the four seasons and ingest it, praying as prescribed above.",
      "start_char": 8435,
      "end_char": 9668,
      "start_sentence": 203,
      "end_sentence": 230,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.16649889945984,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上九赤班符五帝内真经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "玄妙之道，不得妄宣也。 南海水帝洞源赤炁班符 太上洞源赤炁班符，常以立夏、夏至之日正中，朱书青纸上，南向服之。 行事讫，朱书符桐板，上记：某年某月某日子，某郡县某乡里某岳先生某，年若干岁，某月生，於符下。 以赤石八两，赤丝缠之，着符，投於南流之水。 行其道，常以其日清斋，入室烧香，南向叩齿十二通，思南海水帝神王，姓开，讳纳灵，头建太晨宝明之冠，衣赤锦文裙，带交灵紫绶九色鞶囊，乘蛟龙飞行云轮，从南海水帝十二仙掾，乘十二飞龙，上诣高皇玉帝，徘徊青云，回降我身，青炁郁冥。 神王对坐我前，削我罪简，注我仙录，微祝曰： 南阳赤渊，万谷洞泉，帝君安镇，总领水仙，校定罪简，记功紫晨，日吉时清，匡龙策烟，徘徊玄虚，来降我轩，与炁混合，道成自然，制魔灭精，摄海封山，六师启道，通我水源，兴云降雨，啸命立前，所愿所启，靡不如言，飞行上清，朝谒玉晨。 毕，仰咽炁八过止，便依法投符南流之渊。 行之十八年，水宫无复罪目之简，神王列名於玉皇，降致云龙丹舆，飞行太空，登山涉海，万神卫迎，洞微入玄，与帝合真。 轻泄灵文，罚以五帝神兵，秘之者仙。 西海水帝洞渊白炁班符 太上洞渊白炁斑符，常以立秋、秋分之日晡时，朱书青纸上，西向服之。 行事讫，朱书符桐板，上记：某年某月某日，某郡县某乡里某岳先生某，年若干岁，某日生，於符下。 以白石六两，白丝缠之，着符，投於西流之水。 行其道，当以其日清斋，入室烧香，西向叩齿十二通，思西海水帝神王，姓道，讳洞清，头建太晨宝明之冠，衣素锦飞裙，带素灵命神之章，九色师虎头鞶囊，乘飞舆，从西海水帝十二仙掾，乘十二白虎，飞行玄虚，上诣高皇玉帝，徘徊玄空青云之中，回真下降，对在我前，削我罪简，注我仙录，列奏玉帝之前。 微祝曰： 旸谷万丈，洞渊九流，十二帝府，九江水侯，上统玉虚，下领神州，是日上吉，神王出游，掌我命籍，保我玄符，回真曲映，来降我庐，削我罪简，勒上天书，道发自然，飙升云舆，混合元吉，与帝并躯。 毕，仰咽六炁止，便依法投符西流之渊。 行之十八年，则能洞行西海，履万丈之渊，海神卫迎，不拘水契，降致龙舆，飞行太虚，水官削罪，言名帝皇。 其道高妙，不行於世，有见其文，不学自仙。 北海水帝洞川黑炁班符 太上洞川黑炁班符，以立冬、冬至之日夜半时，朱书青纸上，北向服之。 行事讫，朱书符於桐板，上记：某年某月某日，某郡县某乡里某岳先生姓某，年若干岁，某月生，於符下。 以黑石五两，黑丝缠之，着符，投於北流之水。 行其道，当以其日清斋，入室烧香，北向叩齿十二通，思北海水帝神王，姓噏，讳渊元，头建太晨宝明之冠，衣玄锦飞裙，带豁落七元五色虎头鞶囊，乘玄霞飞舆，从北海水帝十二仙掾，乘十二飞龟，游行玄虚，上诣高皇玉帝，徘徊玄灵之上，郁郁青炁之中，回真下降，对在我前，削我罪简，注我玉篇，列言上清玉皇帝前。 便微祝曰： 天地分流，四渎御清，三河水府，九江帝灵，检定简录，结罪四明，有道者功，有过者刑，今日上吉，帝映我庭，流真回降，我仙自成，三河四海，来卫我形，千变万化，应口立生，飞行玄虚，上升八冥，长保三光，天地齐停。",
      "translated_text": "The Mysterious and Wondrous Dao must not be recklessly proclaimed.\n\n**Talisman of the Vermilion Qi from the Southern Sea Water Emperor’s Cavern Source**\nThe *Supreme Cavern Source Vermilion Qi Talisman* is to be inscribed in cinnabar on blue-green paper at noon on the days of *Lixia* (Beginning of Summer) or *Xiazhi* (Summer Solstice), then ingested while facing south. Upon completing the ritual, inscribe the talisman in cinnabar on paulownia wood, recording beneath it: *\"On the day of [year], [month], [day], [name], Master of the Sacred Peaks of [prefecture], [county], [village], aged [years], born in [month],\"* then affix the talisman. Bind eight ounces of red stone with red silk, attach the talisman, and cast it into southward-flowing waters.\n\nTo practice this Dao, on the appointed day, maintain a pure fast, enter the chamber, burn incense, face south, and knock the teeth twelve times. Visualize the Divine King of the Southern Sea Water Emperor, surnamed Kai, personal name Naling, crowned with the *Tai Chen Precious Radiance Diadem*, clad in a vermilion brocade flying skirt, girded with the *Intertwined Spirit Purple Sash* and nine-colored *Pan* pouch. He rides a scaled dragon, soaring upon cloud chariots, accompanied by the twelve immortal attendants of the Southern Sea Water Emperor, each mounted on twelve flying dragons. Ascending to the High August Jade Emperor, they drift amidst azure clouds before descending to my presence, where verdant qi swirls in darkness.\n\nThe Divine King sits before me, erases my sin register, and inscribes my name in the immortal ledger. Then recite the subtle invocation:\n*\"Vermilion Abyss of Nanyang, cavern springs of ten thousand valleys,\nThe Emperor pacifies and guards, governing all water immortals.\nExamining sin registers, recording merits in the Purple Dawn,\nAuspicious day, clear hour—guiding dragons and wielding mist.\nDrifting through the mysterious void, descending to my hall,\nMerging with qi, the Dao arises naturally.\nSubduing demons, dispelling spirits, sealing seas and mountains,\nThe Six Masters open the path, connecting me to water’s source.\nSummoning clouds, descending rain, whistling commands at my behest—\nAll wishes and petitions shall be fulfilled as spoken.\nSoaring to the Upper Clarity, paying homage to the Jade Dawn.\"*\n\nConclude by swallowing eight breaths of qi, then cast the talisman into the southward-flowing abyss as prescribed. After eighteen years of practice, the Water Palace will no longer hold a sin register in my name. The Divine King will present my name to the Jade Emperor, who will dispatch a cloud-dragon cinnabar carriage to traverse the great void. I shall ascend mountains, cross seas, with ten thousand spirits guarding my passage, penetrating the subtle and entering the mysterious, uniting with the Emperor in true essence. Those who recklessly divulge this sacred text shall be punished by the divine armies of the Five Emperors; those who keep it secret shall attain immortality.\n\n**Talisman of the White Qi from the Western Sea Water Emperor’s Cavern Abyss**\nThe *Supreme Cavern Abyss White Qi Talisman* is to be inscribed in cinnabar on blue-green paper at dusk on the days of *Liqiu* (Beginning of Autumn) or *Qiufen* (Autumn Equinox), then ingested while facing west. Upon completing the ritual, inscribe the talisman in cinnabar on paulownia wood, recording beneath it: *\"On the day of [year], [month], [day], [name], Master of the Sacred Peaks of [prefecture], [county], [village], aged [years], born in [month],\"* then affix the talisman. Bind six ounces of white stone with white silk, attach the talisman, and cast it into westward-flowing waters.\n\nTo practice this Dao, on the appointed day, maintain a pure fast, enter the chamber, burn incense, face west, and knock the teeth twelve times. Visualize the Divine King of the Western Sea Water Emperor, surnamed Dao, personal name Dongqing, crowned with the *Tai Chen Precious Radiance Diadem*, clad in a plain brocade flying skirt, girded with the *Plain Spirit Life Divine Seal* and nine-colored *Tiger-Head Pan* pouch. He rides a flying carriage, accompanied by the twelve immortal attendants of the Western Sea Water Emperor, each mounted on twelve white tigers, soaring through the mysterious void. Ascending to the High August Jade Emperor, they drift amidst the azure clouds of the mysterious emptiness before descending in true essence to my presence. The Divine King erases my sin register, inscribes my name in the immortal ledger, and presents it before the Jade Emperor.\n\nThen recite the subtle invocation:\n*\"Yang Valley ten thousand fathoms deep, cavern abyss of nine streams,\nTwelve imperial palaces, nine river lords,\nAbove governing the Jade Void, below presiding over the divine continent.\nOn this most auspicious day, the Divine King sets forth,\nHolding my life’s register, guarding my mysterious talisman.\nReturning true essence, bending light to descend to my dwelling,\nErasing my sin register, engraving it in celestial script.\nThe Dao arises naturally, ascending in the whirlwind’s cloud chariot,\nMerging with primordial auspiciousness, my body one with the Emperor.\"*\n\nConclude by swallowing six breaths of qi, then cast the talisman into the westward-flowing abyss as prescribed. After eighteen years of practice, I shall traverse the Western Sea, tread the ten-thousand-fathom abyss, with sea spirits guarding my passage, unbound by water’s constraints. A dragon carriage shall descend, soaring through the great void, while the water officials erase my sins and present my name to the Emperor. This Dao is lofty and wondrous, not practiced in the mundane world. Those who encounter this text shall attain immortality without study.\n\n**Talisman of the Black Qi from the Northern Sea Water Emperor’s River Cavern**\nThe *Supreme River Cavern Black Qi Talisman* is to be inscribed in cinnabar on blue-green paper at midnight on the days of *Lidong* (Beginning of Winter) or *Dongzhi* (Winter Solstice), then ingested while facing north. Upon completing the ritual, inscribe the talisman in cinnabar on paulownia wood, recording beneath it: *\"On the day of [year], [month], [day], [name], Master of the Sacred Peaks of [prefecture], [county], [village], aged [years], born in [month],\"* then affix the talisman. Bind five ounces of black stone with black silk, attach the talisman, and cast it into northward-flowing waters.\n\nTo practice this Dao, on the appointed day, maintain a pure fast, enter the chamber, burn incense, face north, and knock the teeth twelve times. Visualize the Divine King of the Northern Sea Water Emperor, surnamed Xi, personal name Yuanyuan, crowned with the *Tai Chen Precious Radiance Diadem*, clad in a dark brocade flying skirt, girded with the *Huo Luo Seven Primes* and five-colored *Tiger-Head Pan* pouch. He rides a black auroral flying carriage, accompanied by the twelve immortal attendants of the Northern Sea Water Emperor, each mounted on twelve flying turtles, roaming the mysterious void. Ascending to the High August Jade Emperor, they drift above the mysterious numinous, amidst swirling verdant qi, before descending in true essence to my presence. The Divine King erases my sin register, inscribes my name in the jade ledger, and presents it before the Jade Emperor of the Upper Clarity.\n\nThen recite the subtle invocation:\n*\"Heaven and earth divide their streams, the four rivers govern clarity,\nThree river water palaces, nine river imperial spirits.\nExamining registers, binding sins to the Four Luminaries—\nThose with Dao earn merit; those with transgressions face punishment.\nOn this most auspicious day, the Emperor’s light illumines my court.\nFlowing true essence returns, descending—my immortality is achieved.\nThree rivers and four seas guard my form,\nA thousand transformations, ten thousand changes—spoken, they arise at once.\nSoaring through the mysterious void, ascending to the Eight Darknesses,\nEternally preserving the Three Luminaries, heaven and earth in harmony.\"*\n\nConclude by swallowing breaths of qi, then cast the talisman into the northward-flowing abyss as prescribed. After eighteen years of practice, I shall ascend through the great void, traverse mountains and seas, with ten thousand spirits guarding my passage, attaining the subtle and entering the mysterious, uniting with the Emperor in true essence.",
      "overlap_context": "er palace,\nWaters receive my form.\nLet me endure forever,\nEqual in age to the kalpa.\"*\n\nWhen finished, ingest the talisman and swallow nine breaths of fluid. Then cast the talisman into the eastward-flowing abyss as prescribed.\n\nAfter eighteen years of cultivation, the Water Emperor will erase your sin register and report to the Jade Purity, descending a dragon carriage to traverse the great void. Your body will enter the ten-thousand-fathom abyss, where you will converse with the Water Emperor.",
      "start_char": 9668,
      "end_char": 10932,
      "start_sentence": 231,
      "end_sentence": 258,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.92664551734924,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上九赤班符五帝内真经.txt",
        "category": "正统道藏正一部"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "毕，仰咽八炁止，便依法投符北海之渊。 行之十八年，命召水侯十二蛟龙，运水兴云，使白日暗冥，飞行虚空，上升玉清。 其法高妙，非真勿行，违禁妄传，殃灭兆身，考延七玄，唯秘神仙。 太上九赤班符，结飞玄紫炁以成其文。 上真帝君以封岳召山，摄江制灵。 其文洞微，焕落上清。 元始天王藏之於瑶台金房玉虚之中。 旧科七千年一传，自无金名玉字，丹文玄台，不得参闻。 有见其文，克成上仙。 当依法，八节之日，服符礼祝，并埋山投海。 九年之中，则五岳仙官侍卫兆身，水帝水灵随方伺迎，五帝奏名玄宫，水官落灭罪书，龙降云覆，变化无方。 又当依常彩色书符佩身，登山履川，万神卫形，灭魔消试，威制群精，五云降室，紫烟自生，项负圆光，内外洞明，八景齐真，三元降軿，飞行玄虚，上升玉清。 有金名玉骨，宝字上清，得有此符，佩之三年，便得为五岳真人，履川涉海，便为四海君王，五帝辅翼，万神敬迎。 修行其事九年，则能水行万丈，制御蛟龙，入山隐学，则五帝五岳见形共言，兴云起雨，立召龙烟，千变万化，应响已成。 修之十八年，飞行上清。 其道高妙，不行於世，轻泄灵文，七祖充责，己身亡命，长保鬼官。 受者弟子师对斋三十日，或七日，赍上金三两，五色文缯各五十尺，锦四十尺，上香一斤，诣五岳之岩，告五帝，关五灵，三河四海天官地官水官，依四极之盟，然后而传。 受者不关天灵，侍经玉童玉女，列奏高上，罚以五帝神兵。 轻泄者罚於九祖，考灭己身。 受而不盟，殃延七祖，身被风火，自然失经。 故上元君告於五帝：经非盟而不告，受不关而失真，彼此皆有生死之责。 学者宜依文而奉焉。 道无不降，仙无不成，生死享其庆，福流於种亲，灵文至重，斯道之极真也。 洞真太上九赤班符五帝内真经竟",
      "translated_text": "Upon completion, raise your head and swallow the eight breaths of qi to stillness, then cast the talisman into the northern abyss of the North Sea as prescribed. After eighteen years of practice, summon the twelve Water Lords and Jiao-Dragons to command the waters and raise clouds, darkening the bright day. Soaring through the void, ascend to the Jade Purity.\n\nThis method is most profound—only the true may practice it. To violate its prohibitions or recklessly transmit it brings calamity and annihilation to one’s person, extending punishment through the Seven Mysteries. It is the secret of immortals alone.\n\nThe Supreme Nine Crimson-Striped Talisman is formed by weaving the soaring, mysterious purple qi into its script. The Supreme Perfected Lord seals the mountains and summons the peaks, governing the rivers and commanding the spirits. Its script penetrates the subtle, resplendent in the Highest Clarity.\n\nThe Primordial Heavenly King concealed it within the Jade Terrace’s Golden Chamber of the Jade Void. By ancient decree, it is transmitted once every seven thousand years. Without a name inscribed in gold or jade, or the vermilion script of the Mystic Terrace, one may not partake of its teachings. Those who behold its script and perfect its practice attain the rank of Highest Immortal.\n\nFollow the method: on the eight solar terms, ingest the talisman, perform the rites, and offer prayers, then bury it upon a mountain or cast it into the sea. Within nine years, the immortal officials of the Five Peaks will attend and guard your person, the Water Emperor and water spirits will await your command from all directions, and the Five Emperors will report your name to the Mystic Palace. The water officials will erase your records of transgression, dragons will descend amidst clouds, and transformations will arise without limit.\n\nYou must also habitually inscribe the talisman in colored pigments and wear it upon your person. Ascend mountains and traverse rivers—then the myriad spirits will guard your form, vanquish demons and trials, subdue all spirits with your might, and five-colored clouds will descend to your chamber while purple mist arises of itself. A halo will encircle your head, illuminating within and without, the Eight Effulgences will unite in perfection, and the Three Primes will descend in chariots. Soaring through the mysterious void, you will ascend to the Jade Purity.\n\nThose whose names are inscribed in gold and whose bones are of jade, bearing the precious script of the Highest Clarity, who obtain this talisman and wear it for three years, shall become Perfected Ones of the Five Peaks. Treading rivers and crossing seas, they shall become Lords of the Four Seas, assisted by the Five Emperors, revered by the myriad spirits. After nine years of practice, they shall traverse ten thousand fathoms of water, command and restrain the Jiao-Dragons, and if they retreat to the mountains to cultivate in seclusion, the Five Emperors and Five Peaks will manifest and converse with them. They shall summon clouds and raise rain, instantly call forth dragon mists, and achieve a thousand transformations and ten thousand changes, their responses instantaneous.\n\nAfter eighteen years of practice, they shall soar to the Highest Clarity. This Dao is most profound and not to be revealed in the world. To lightly disclose its sacred script brings punishment upon the seven generations of ancestors, while one’s own life is forfeit, bound eternally to the offices of the dead.\n\nThe recipient must fast with their master for thirty days—or seven days—offering three taels of refined gold, fifty feet each of five-colored patterned silk, forty feet of brocade, and one catty of finest incense. They shall proceed to the cliffs of the Five Peaks, announce themselves to the Five Emperors, and register with the Five Spirits, the celestial, terrestrial, and water officials of the Three Rivers and Four Seas, in accordance with the oath of the Four Poles, before transmission may occur.\n\nIf the recipient fails to register with the Celestial Spirits, the jade lads and jade maidens who attend the script will report to the Most High, and the recipient shall be punished by the divine soldiers of the Five Emperors. Those who lightly disclose it shall be punished across nine generations of ancestors, their own person extinguished. Those who receive it without swearing the oath shall bring calamity upon seven generations of ancestors, their own body afflicted by wind and fire, and the script shall naturally be lost.\n\nThus did the Supreme Primordial Lady declare to the Five Emperors: a script not sworn to shall not be transmitted; one who receives without registration loses the true. Both parties bear the responsibility of life and death. Scholars must adhere to the text and uphold it.\n\nThe Dao descends without fail; immortality is achieved without exception. Life and death share in its blessings, and fortune flows to one’s kin. The sacred script is most weighty—this is the ultimate truth of the Dao.\n\nHere ends the *Wondrous Perfected Supreme Nine Crimson-Striped Talisman: The Five Emperors’ Scripture of Inner Perfection*.",
      "overlap_context": "ce.\nSoaring through the mysterious void, ascending to the Eight Darknesses,\nEternally preserving the Three Luminaries, heaven and earth in harmony.\"*\n\nConclude by swallowing breaths of qi, then cast the talisman into the northward-flowing abyss as prescribed. After eighteen years of practice, I shall ascend through the great void, traverse mountains and seas, with ten thousand spirits guarding my passage, attaining the subtle and entering the mysterious, uniting with the Emperor in true essence.",
      "start_char": 10932,
      "end_char": 11628,
      "start_sentence": 259,
      "end_sentence": 282,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 27.838733673095703,
      "metadata": {
        "source_file": "dao\\正统道藏正一部\\太上九赤班符五帝内真经.txt",
        "category": "正统道藏正一部"
      }
    }
  ]
}