{
  "source_id": "太上三五傍救醮五帝断殟仪",
  "source_file": "chunked_daozang\\太上三五傍救醮五帝断殟仪.json",
  "total_chunks": 5,
  "total_original_chars": 4285,
  "total_translated_chars": 24531,
  "total_translation_time": 122.54865598678589,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\威仪类\\太上三五傍救醮五帝断殟仪.txt",
    "category": "威仪类"
  },
  "full_translation": "*The Supreme Rites of the Three and Five Auxiliary Salvation Offerings to the Five Thearchs for Severing Pestilential Afflictions*\n*Sutra Title:* *The Supreme Rites of the Three and Five Auxiliary Salvation Offerings to the Five Thearchs for Severing Pestilential Afflictions*\n*One fascicle.*\n*Source text:* *Zhengtong Daoist Canon*, *Dongshen* Section, *Weiyi* Category.\n\nWhen a household suddenly encounters celestial disasters or dire calamities, and its members suffer from swellings and sores lasting one to five days, this arises because the Five Thearchs’ divine attendants fail to protect the residents, or because neighbors from the four directions have been afflicted by contagion. All such cases stem from the epidemic demons of the heavens—Li Ziao of the Clouds, Zhang Yuanbo, Liu Yuanda, the Wuhuan ghosts, and the like—who bring sickness to the household. If a family is stricken by celestial seasonal epidemics, the affliction will recur once within three years.\n\nOn the appointed day of the offering, select an auspicious date and invite a Daoist priest to perform the rites at the residence. If possible, conduct a divine incantation retreat for one day and two nights, or three days and three nights. If this cannot be arranged, simply invite one priest to perform the Five Thearchs’ Offering. The required items, listed in detail below, are as follows:\n\n- Genuine frankincense (with \"nipples\"): one tael and a half, for six censers.\n- Six-sided altar table, five brushes, five ink sticks, five segments of five-directional silk (each in its corresponding color).\n- Five hand towels, each four feet and two inches long.\n- Five trays of life-and-fortune rice, each holding one *dou* and two *sheng*.\n- One *dou* of wine, forty cups.\n- Five portions of offering money, each portion one hundred and twenty *wen*.\n- One bundle of paper: five sheets for spirit money, five sheets for stabilizing the altar.\n- Forty portions of offering cakes, walnuts, dried jujubes, dried fish, venison jerky, and seasonal fresh fruits.\n- One bowl of *maoxiang* infusion.\n- Twelve lamps.\n- Six peachwood tablets, each one foot one inch long and two inches wide.\n\nThe master’s position is in the north. After knocking the teeth thirty-six times, enter the altar and perform the purification rite.\nNext, seal the demon gate.\nNext, recite the *Guardian Spirit Incantation*.\n\nNext, the *Incense Burner Activation Rite*—the disciples, properly adorned in ritual vestments and sashes, stand before the purification altar with reverent devotion. They make obeisance, offer incense, and await communion.\n\nOn this day, the [X]th year of the [Era], the [X]th month, the [X]th day of the lunar cycle, we, your humble disciples of the *Dongyuan* tradition, [Name] and others, respectfully address the following on behalf of disciple [Name]:\n\nWe invoke and beseech:\nThe Azure Emperor of the East, *Lingwei Yang*, Lord *Gou Mang*, and the Azure Empress—descend.\nThe Vermilion Emperor of the South, *Biaonu*, Lord *Zhurong*, and the Vermilion Empress—descend.\nThe White Emperor of the West, *Zhaoju*, Lord *Shaohao*, and the White Empress—descend.\nThe Black Emperor of the North, *Yeguang Ji*, Lord *Xuanming*, and the Black Empress—descend.\nThe Yellow Emperor of the Center, *Han Shuniu*, Lord *Xuanyuan*, and the Yellow Empress—descend.\n\nWe further invoke:\nThe sons and grandsons of the Five Emperors,\nThe *Dianji* and *Gongcao* officials,\nThe *Siming* and *Silü* deities,\nThe *Haosheng Sima*,\nThe great spirits who purify defilement,\nThe Left and Right *Shangshu*,\nThe Front and Rear *Pushe*,\nThe *Yanshou* Jade Maidens,\nThe *Zhangli* and *Sikong* officers,\nThe *Zhunian* scholars,\nThe upper and lower *Dafu*,\nThe ethereal minor officials,\nThe Lords of *Xue Si Ding Sheng*,\nThe Lords of *Jie Shui Tuo E*,\nThe Lords of *Bao Ming Yi Suan*,\nThe Lords of *Zhi Bing Xia Yao*,\nThe *Fuyun* Messengers,\nThe Lords of Thunder and Lightning,\nThe Lords of the Four Continents and Nine Valleys,\nThe immortals of the riverbanks,\nThe *Jianghu* Jade Maidens,\nThe Lords who devour demons and consume ghosts,\nThe Lords who seize and consume ghosts,\nThe Lords who behead and shatter ghosts,\nThe Lords who sweep away misfortune and pacify the six viscera,\nThe Lords who transfer names and fix registers—\nall your exalted seats, accept this humble offering and heed the talismanic decree above and below.\n\nWe summon and address:\nThe great deities of Heaven and Earth,\nThe immortal officials of the Five Emperors,\nThe local earth deities and true officials of this place,\nThe water emperors of the Nine Rivers,\nThe twelve stream maidens,\nThe river lords and water officials,\nThe seven deities of the underworld,\nThe lords of the earth and the Five Marchmounts,\nThe Four Watercourses,\nThe protective officers of humanity,\nThe masters of added years,\nThe left and right transmitting officials,\nThe Lords of absolved transgressions,\nand all spirits—\neach holding jade tablets, attend to the words from our mouths.\n\nFor years, your disciple [Name]’s household has suffered misfortune in dwelling, with family members afflicted by sores and swellings, deaths uncounted, enterprises thwarted, official rank stagnant, desires unfulfilled, and calamities arising without cause. Divination reveals omens of ill fortune, all due to malevolent *qi* from the eight directions and four quarters, along with epidemic ghosts, demonic soldiers, and the eight classes of demonic forces violently harming the good. At every door, only the wails of the dead are heard, never the strains of refined music. Grief and lamentation abound, with many wrongfully stricken. What we see and hear is far from auspicious. Day and night, we are filled with dread, with nowhere to turn.\n\nWe have heard that the Most High Lord Lao established the teachings, bestowing them upon the immortals, who in turn transmitted to the mortal realm the great and wondrous Dharma for slaying demons and reviving the living. Today, we have erected an altar here, presenting offerings of wine and dried meats, the full array for the Five Emperors, and cast the Nine Divinations. This day is most auspicious, the celestial granary is full. Bright as the sun and moon, equal to the Three Luminaries. A hundred delicacies are arrayed, yet we dare not taste them first. The clear wine and pure meats are sweet and fragrant beyond measure. May the imperial lords accept these offerings and bestow boundless blessings. May our seven generations of ancestors ascend to heaven, their misfortunes dissolved, enjoying refined music and ranks equal to the immortals. May the living prosper in wealth and nobility, their halls filled with descendants for thirty-six generations. May the departed and the long-deceased ascend to the Southern Palace, abiding in the land of eternal joy and fortune, escaping the Three Wretched Paths and avoiding the cauldrons of boiling liquid. May they forever leave behind the sword trees, frozen beds, and iron couches, never to see the copper pillars, ox-headed or horse-faced guardians. May epidemics and illnesses vanish for ten thousand generations. May the hundred ghosts be gathered and cast into the sun. May disasters disperse and eternal prosperity be secured.\n\nO rulers of the Five Emperors, kings of the myriad spirits, eradicate evil karma and discern the yielding and the firm. Let radiance revive the withered, let words manifest as frost and snow. You can dissolve official misfortunes and banish illness from the sickbed; you can govern the seasons of spring, autumn, winter, and summer, the celestial round and the earthly square; you can harmonize the *qi* of the four seasons, the five colors and the mysterious yellow, the Three Clarities and the Six Pitches, the seven yielding and eight firm. You shape human form, illuminating all that is dark, shining upon all that is dim.\n\nThe Seven Stars of the Northern Dipper arrange the constellations:\n*Jiao, Kang, Di, Fang, Xin, Wei, Ji*—aligned with the East;\n*Jing, Gui, Liu, Xing, Zhang, Yi, Zhen*—aligned with the South;\n*Kui, Lou, Wei, Mao, Bi, Zi, Shen*—aligned with the West;\n*Dou, Niu, Nü, Xu, Wei, Shi, Bi*—aligned with the North;\n[...] aligned with the Center and the Five Phases.\n\nYou regulate the cycles of cold, heat, warmth, and coolness, causing:\nMetal to overcome Wood, and Wood to break;\nWood to overcome Earth, and Earth to conceal;\nEarth to overcome Water, and Water to cease flowing;\nWater to overcome Fire, and Fire to lose its light;\nFire to overcome Metal, and Metal to melt away.\nYou strike and punish ghosts, driving them far away. You heal illnesses, restoring health at once. You seek official rank, aligning with the just and the royal. You pacify the household spirits, making the home steadfast as metal; you direct talismans at ghosts, and they perish; you command spirits to slay demons, and they shatter; you order spirits to cure illness, and the sick rise from their beds; you charge spirits to guard travelers, ensuring their safe passage; you command spirits to protect graves, filling halls with descendants; you instruct spirits to tend fields, filling granaries with the five grains; you dispatch spirits to sever illness, preventing its return.\n\nLet the Nine Heavens be your witness: humanity bears evil karma. Cast it to the eight wastelands, sweeping it from streets, villages, and crossroads, and from within the home of your disciple [Name], where epidemics and jaundice rage. All but our own kin, depart swiftly to distant lands! Command the generals of the hundred ghostly battalions to seize and cast them into the cauldrons. Devour their essence and specters, dissolving their five bodies. By the decree of Lord Lao’s mouth, execute and slay all misfortune—what spirit could remain, what ghost dare resist?\n\nMay the imperial lords descend, and ten thousand years of prosperity ensue. In all our comings and goings, may the five spirits lend their aid.\n\nMay official calamities disperse and ghostly bandits retreat into hiding—your disciple bows twice in reverence.\n\nNext, offer incense, tea, and wine.\nWith utmost devotion, we invoke the Five Thearchs: if any perverse spirits, the Five Pestilences, or ghostly *qi* linger—whether concealing their forms, lurking in shadows, transforming endlessly, or refusing to depart—we humbly beseech the Five Devouring Generals to descend. Unleash your mighty power, exhale divine fire to shatter ghostly heads and burn their bodies, extinguishing their very roots. Swiftly, as decreed by the *Nüqing* Ordinance!\n\nFor the transgressions of your disciple [Name]—from seven generations past to the present life—innumerable grave offenses have been committed. We implore forgiveness for the sins of your disciple’s ancestors and living kin: the Ten Evils and Five Heinous Crimes of the East, which remain unresolved.\nWe invoke the Lords of Horn, Neck, Root, Chamber, Heart, Tail, Winnowing Basket, and the Celestial Stems *jiǎ-yǐ*, *yín-mǎo*, *chén*—masters of the East—to absolve and pardon these offenses.\n\nFor the Ten Evils and Five Heinous Crimes of the South, unresolved in this life, we invoke the Lords of Well, Ghost, Willow, Star, Spread, Wing, Chariot, and the Celestial Stems *sì-wǔ*, *wèi*, *bǐng-dīng*—masters of the South—to absolve and pardon these offenses.\n\nFor the Ten Evils and Five Heinous Crimes of the West, unresolved in this life, we invoke the Lords of Straddler, Harvester, Stomach, Pleiades, Net, Turtle Beak, Orion, and the Celestial Stems *shēn-yǒu*, *xū*, *gēng-xīn*—masters of the West—to absolve and pardon these offenses.\n\nFor the Ten Evils and Five Heinous Crimes of the North, unresolved in this life, we invoke the Lords of Dipper, Ox, Girl, Void, Danger, House, Wall, and the Celestial Stems *hài-zǐ*, *chǒu*, *rén-guǐ*—masters of the North—to absolve and pardon these offenses.\n\nFor the Ten Evils and Five Heinous Crimes of the Center, unresolved in this life, we invoke the Lords of the Central Dipper’s Seven Stars [text corrupt]—masters of the Center—to absolve and pardon these offenses.\n\nIn the third month of spring, when the Green Pestilence and Green Epidemic spirits emerge—seizing upon the ascendant Wood to spread their poisons and harm the innocent—we invoke the White Thearch of the West to strike them down, preventing their wanton destruction.\n\nIn the third month of summer, when the Red Pestilence and Red Epidemic spirits emerge—seizing upon the ascendant Fire to spread their poisons and harm the innocent—we invoke the Black Thearch of the North to strike them down, preventing their wanton destruction.\n\nIn the third month of autumn, when the White Pestilence and White Epidemic spirits emerge—seizing upon the ascendant Metal to spread their poisons and harm the innocent—we invoke the Red Thearch of the South to strike them down, preventing their wanton destruction.\n\nIn the third month of winter, when the Black Pestilence and Black Epidemic spirits emerge—seizing upon the ascendant Water to spread their poisons and harm the innocent—we invoke the Yellow Thearch of the Center to strike them down, preventing their wanton destruction.\n\nIn the intercalary months, when the Yellow Pestilence and Yellow Epidemic spirits emerge—seizing upon the ascendant Earth to spread their poisons and harm the innocent—we invoke the Green Thearch of the East to strike them down, preventing their defiance.\n\nMay all manner of perverse spirits be subdued and concealed. Thus shall the world know great peace: ghosts and spirits shall not rise, winds shall be harmonious, rains timely, and the myriad people at ease. Overwhelmed by such boundless grace, your disciple bows twice in reverence.\n\nNext, offer incense and wine.\nWe humbly invoke the Five Thearchs once more: your disciple prostrates himself, kowtowing in supplication. Grant us life upon life, deliverance upon deliverance—lifting the weight of profound calamities. For the sake of your disciple [Name], we beseech you to dispel disasters, pacify wandering souls, secure life and destiny, and heal all afflictions.\n\nMay your disciple’s household—young and old alike—be spared from the misfortune of exhausted lifespans or untimely fates. Should their allotted years be cut short by karmic reckoning, we implore you to dissolve these bonds, restore their years, and extend their lives.\n\nIf the snares of Heaven’s Net and Earth’s Web entangle their bodies, yet remain unresolved, we beseech the Thearchs to swiftly sever them. May all perverse spirits be annihilated.\n\nShould a hundred ghosts arise wantonly, seizing and tormenting the souls of your disciple’s household—men and women, young and old—causing their spirits to wander restless, we earnestly invoke the Lords of Extended Life, Peaceful Birth, Averting Death, and Future Rebirth from the Five Directions’ Dipper Stars. Gather their wandering souls, restore their *po* spirits, and reunite them with their bodies. Harmonize the Six Palaces.\n\nFrom the Eastern Dipper, we request extended years.\nFrom the Western Dipper, we request recorded names.\nFrom the Northern Dipper, we request the removal of death.\nFrom the Southern Dipper, we request rebirth.\nMay the Lord of Souls and the Controller of Destiny pacify their spirits and grant them increased longevity. We invoke the Star Official of Extended Life to erase their names from the ledger of death and inscribe them in the register of life.\n\nShould any inauspicious or rebellious ghosts—whether from Heaven above or Earth below—lurk in your disciple’s home, village lanes, doorways, or thresholds, seeking blood offerings to perpetrate harm, we invoke the Three-Five Generals and their ten thousand officers to descend, subdue demons, and devour ghosts.\n\nWe invoke the Three-Five Generals of Pestilence-Devouring, their ten thousand officers descending.\nWe invoke the Three-Five Generals of Epidemic-Devouring, their ten thousand officers descending.\nWe invoke the Three-Five Generals of Affliction-Devouring, their ten thousand officers descending.\nWe invoke the Three-Five Generals of Essence-Devouring, their ten thousand officers descending.\nWe invoke the Three-Five Generals of Perverse-Devouring, their ten thousand officers descending.\nWe invoke the Three-Five Generals of Poison-Devouring, their ten thousand officers descending.\nWe invoke the Three-Five Generals of Bewitchment-Devouring, their ten thousand officers descending.\nWe invoke the Three-Five Generals of Malevolence-Devouring, their ten thousand officers descending.\nWe invoke the Five Directions’ Five Thearchs’ Ghost-Slaying Generals, their ten thousand officers descending.\n\nFor your disciple’s household, may they unite in purpose and strength to seize and capture:\n—The *wǎngliǎng* ghosts lurking in village lanes and household dwellings, the lingering dead from executions and violent ends;\n—The ghosts of doorways, wells, and hearths;\n—The ghosts of Five Deficiencies and Six Wastages, of ominous winds and perverse breaths;\n—The ghosts of boys and girls;\n—The ghosts of calamitous [text corrupt] and earthbound growths;\n—The ghosts who sing alone, dance in solitude, or laugh without cause;\n—The ghosts of sorcery, wild paths, and poisonous arts;\n—The mountain spirits, cliff demons, and hundred *mei* specters;\n—The Eight Divisions’ plague-bearing ghosts;\n—The ghosts who call out to human souls;\n—The ghosts with various names;\n—The ghosts of *Minggong* and stone anchors;\n—The nameless, unregistered ghosts;\n—The ghosts of puppies beneath trees;\n—The ghosts of night-wandering malevolence;\n—The ghosts of mountain forests, earth altars, and perverse shrines;\n—The ghosts of the Four Guardian Deities’ slain generals;\n—The ghosts of blades, warfare, and headless, handless soldiers;\n—The ghost of Wu King Zixu;\n—The ghosts of the Red Eyebrows and bandits;\n—The ghosts of the Three Kings, Five Hegemons, and defeated armies’ slain generals;\n—The ghosts of dysentery and swelling;\n—The ghosts of *Lǔ Dīng*’s jaundice, cramps, coughs, and vomiting;\n—The ghost of *Lǐ Zǐ’áo* of the clouds, and the thousand spirits and ten thousand *mei*;\n—The ghosts who shake bells, blow horns, and call out;\n—The ghosts of hanging;\n—The drowned ghosts;\n—The ghosts of Qiang and Liao tribes;\n—The ghosts of the Six Barbarians;\n—The ghosts of Hu, Di, Man, and Rong tribes;\n—The Green Affliction ghosts of the East;\n—The Red Affliction ghosts of the South;\n—The White Affliction ghosts of the West;\n—The Black Affliction ghosts of the North;\n—The Yellow Affliction ghosts of the Center;\n—The ghosts of extinguished households;\n—The ghosts of sudden, strange illnesses and deaths;\n—The ghosts of white baldness and leprosy;\n—The ghosts of festering sores and foul decay;\n—The ghosts of market executions, beheadings, and hangings;\n—The ghosts of crows and magpies’ chaotic, ominous cries;\n—The ghosts of starvation, cold, and freezing deaths;\n—The ghosts who conceal their forms and hide their shadows;\n—The ghosts of reckless speech and false words;\n—The ghosts of the Six Domestic Animals;\n—The ghosts who suppress human souls;\n—The ghosts of unburied white bones;\n—The newly dead who shoot arrows to claim lives;\n—The ghosts with rat heads and human bodies;\n—The ghosts with ox heads and human bodies;\n—The ghosts with tiger heads and human bodies;\n—The ghosts with rabbit heads and human bodies;\n—The ghosts with dragon heads and human bodies;\n—The ghosts with snake heads and human bodies;\n—The ghosts with horse heads and human bodies;\n—The ghosts with sheep heads and human bodies;\n—The ghosts with monkey heads and human bodies;\n—The ghosts with dog heads and human bodies;\n—The ghosts with pig heads and human bodies.\n\nMay all these be seized and bound. May the world know great peace, ghosts and spirits cease their rise, winds and rains harmonize, and the myriad people live in joy. Overwhelmed by such boundless grace, your disciple bows once more.\n\nThese ghosts, refusing the commands of the Great Dao’s covenant and the prohibitions of its majestic laws, dwell solely in the human realm, perpetrating their malevolence—causing people to face official calamities, encounter misfortune, fall ill, or meet death, all against reason and principle.\n\nNot being the Celestial Officers of the Five Thearchs, they are each to be seized and bound by their authority. The rebellious and traitorous ghosts shall be delivered to the execution grounds of the cities, their roots and lineages extinguished.\n\nMay the world attain purity and tranquility, all people live in peace and joy, the five grains flourish abundantly, and every household—young and old—find their hun and po souls no longer imprisoned in the prisons of the Three Officials (Heaven, Earth, and Water) or the hundred ghosts’ dungeons, nor bound by the fetters of the hundred ghosts. We invoke the Lords of the Five Directions and Five Thearchs, the Lords of the Seven Stars, the Lord of Lifespan, the Lord of Longevity, the Lord of Deliverance from Misfortune and Healing, the Lord of Reversing Death and Restoring Life, and the Lord of Protection and Guardianship. May they secure and stabilize the hun and po of so-and-so, extend their life mandate, augment their years under the Seven Stars, and erase their names from the registers of death.\n\nFor the eastern direction’s green afflictions: from this day forth, may the green pestilence be eradicated, and the ghostly qi severed at once.\nFor the southern direction’s red afflictions: from this day forth, may the red pestilence be eradicated, and the ghostly qi severed at once.\nFor the western direction’s white afflictions: from this day forth, may the white pestilence be eradicated, and the ghostly qi severed at once.\nFor the northern direction’s black afflictions: from this day forth, may the black pestilence be eradicated, and the ghostly qi severed at once.\nFor the central direction’s yellow afflictions: from this day forth, may the yellow pestilence be eradicated, and the ghostly qi severed at once.\n\nToday, as the cyclical sign aligns with our prayers, may blessings tower like mountains, leaving no regrets.\nToday, as misfortunes are dispelled and blessings invoked, may disasters vanish, ghostly bandits be annihilated, and felicity overflow.\nToday, as the fullness of merit befriends the Thearchs, may all move freely, all affairs bring joy.\nToday, as peace and surplus blessings arrive, may the gods descend in majesty, and all wishes be fulfilled.\nToday, as heaven and earth join in celebration, may the spirits be sated, and every household free of illness.\nToday, as a hundred blessings converge, may wealth and nobility bring delight, with no taboos or hindrances.\nToday, as transgressions are shattered and absolved, may the gods descend with fortune, dispelling calamity and misfortune, while the numinous ones arrive in splendor, multiplying blessings and prosperity.\nToday, as peril is forever averted, may all prayers after this entreaty be granted.\nToday, as sons and daughters attain longevity, may wealth gather, and the five grains flourish.\nToday, as every household is freed from sorrow, may gold enter the home, enduring through generations.\nToday, as the immortal officials descend together, may true qi overshadow, shielding from disaster.\nToday, as the hundred ghosts are sealed and destroyed, may the dwelling be pure and tranquil, ghosts and spirits subdued and stilled.\n\nNext, offer wine and burn incense.\nWe again invoke the Lords of the Five Thearchs and Seven Stars, along with the immortal officials and their attendants who are to be seated. May all universally partake in the feast.\nMay blessings descend heavier than Mount Tai, and disasters vanish swifter than lightning.\nAs fortune follows the gods’ arrival, may the celestial spirits descend in majesty.\nHaving felt this response in an instant, and completed our reverent thanks, the libations now concluded, we shall not repeat our words nor belabor our speech.\n\nThe dragon chariots prepare their reins, the divine steeds hasten to readiness—arriving like clouds in flight, departing like wind and rain.\nWe welcome the gods from a thousand leagues, yet do not rise to send them off.\nFrom east or west, may each return to their palaces.\nShould there be future prayers, may they deign to descend again.\n\nYour disciple, in awe and reverence, bows twice in farewell.\nNext, the Hymn of Sending Off the Gods.\nNext, the Twelve Vows.\n\nNext, the Hymn of Studying Immortality, dispersed according to the usual rites.\nThe Most High’s Three-and-Five [Perfected] assist in the salvation rite, the Five Emperors conclude the rite of severing misfortune.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上三五傍救醮五帝断殟仪 经名：太上三五傍救醮五帝断殟仪。 一卷。 底本出处：《正统道藏》洞神部威仪类。 太上三五傍救醮五帝断殟仪 夫人家忽逢天灾厄难，家口瘿疔，经一日五日者，此是宅舍前后，五帝神只不卫於人，及有四方邻里，忽被染剔，皆是天行疫鬼，云中李子遨、张元伯、刘元达、乌丸鬼等病患人家。 但是人家若患天行时疫，三年内，皆再发一度。 可於醮历，检定良日，求一道士，延请就宅。 若办得修神咒斋一日两夜、三日三夜。 若不办，只请一人醮五帝。 所须色目，具列如后： 真乳头香一两半六炉。 案六面，笔五管，墨五锭，五方彩各一段随方色。 手巾五条各长四尺二寸，命禄米五盘每盘一斗二升，酒一斗盏子四十只，信钱五分每分一百二十文，纸一束五帖作钱财，五帖镇座。 醮盘四十分饼、胡桃、乾枣、乾鱼、鹿脯、时新果子，茅香汤一碗，灯十二盏，桃牌六枚各长一尺一寸阔二寸。 师位居北，叩齿三十六通了，入坛解秽 次禁鬼门 次卫灵咒",
      "translated_text": "*The Supreme Rites of the Three and Five Auxiliary Salvation Offerings to the Five Thearchs for Severing Pestilential Afflictions*\n*Sutra Title:* *The Supreme Rites of the Three and Five Auxiliary Salvation Offerings to the Five Thearchs for Severing Pestilential Afflictions*\n*One fascicle.*\n*Source text:* *Zhengtong Daoist Canon*, *Dongshen* Section, *Weiyi* Category.\n\nWhen a household suddenly encounters celestial disasters or dire calamities, and its members suffer from swellings and sores lasting one to five days, this arises because the Five Thearchs’ divine attendants fail to protect the residents, or because neighbors from the four directions have been afflicted by contagion. All such cases stem from the epidemic demons of the heavens—Li Ziao of the Clouds, Zhang Yuanbo, Liu Yuanda, the Wuhuan ghosts, and the like—who bring sickness to the household. If a family is stricken by celestial seasonal epidemics, the affliction will recur once within three years.\n\nOn the appointed day of the offering, select an auspicious date and invite a Daoist priest to perform the rites at the residence. If possible, conduct a divine incantation retreat for one day and two nights, or three days and three nights. If this cannot be arranged, simply invite one priest to perform the Five Thearchs’ Offering. The required items, listed in detail below, are as follows:\n\n- Genuine frankincense (with \"nipples\"): one tael and a half, for six censers.\n- Six-sided altar table, five brushes, five ink sticks, five segments of five-directional silk (each in its corresponding color).\n- Five hand towels, each four feet and two inches long.\n- Five trays of life-and-fortune rice, each holding one *dou* and two *sheng*.\n- One *dou* of wine, forty cups.\n- Five portions of offering money, each portion one hundred and twenty *wen*.\n- One bundle of paper: five sheets for spirit money, five sheets for stabilizing the altar.\n- Forty portions of offering cakes, walnuts, dried jujubes, dried fish, venison jerky, and seasonal fresh fruits.\n- One bowl of *maoxiang* infusion.\n- Twelve lamps.\n- Six peachwood tablets, each one foot one inch long and two inches wide.\n\nThe master’s position is in the north. After knocking the teeth thirty-six times, enter the altar and perform the purification rite.\nNext, seal the demon gate.\nNext, recite the *Guardian Spirit Incantation*.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 408,
      "start_sentence": 0,
      "end_sentence": 17,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.833565950393677,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上三五傍救醮五帝断殟仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "次发炉 弟子装束冠带如法，於斋坛前，虔诚告祝，设拜捻香，以俟通感 维某年某月某朔某日洞渊弟子臣某等，谨为弟子某甲上启： 上请东方青帝灵威仰勾芒君青帝夫人降下， 上请南方赤帝熛弩祝融君赤帝夫人降下， 上请西方白帝招矩少昊君白帝夫人降下， 上请北方黑帝叶光纪玄冥君黑帝夫人降下， 上请中央黄帝含枢纽轩辕君黄帝夫人降下。 上请五帝之子、五帝之孙、典籍功曹、司命司录、好生司马、大神解秽主者，左右尚书、前后仆射、延寿玉女、长吏司空、注年博士、上下大夫、虚无小吏、削死定生君、解衰脱厄君、保命益算君、治病下药君、浮云使者君、雷师电师君、四州九谷君、河上仙官、江湖玉女君、吞魔食鬼君、收殟食鬼君、斩鬼破鬼君、扫荡不祥安隐六腑君、移名定籍君、各各诸座，故飨微礼，符告上下。 关启天地大神、五帝仙官、并及此间土地真官、九江水帝、十二溪女、河伯水官、地下七神、土地之主五岳四渎护人长吏、加算主者、左右传吏、解罪之君、一切神灵，各各执持玉板，听臣口中词语。 今有弟子某家累年已来，居止不利，人口瘿疔，死亡非一，经营不遂，官职不迁，所愿不从，灾厄妄生，卜决忧忌，皆见八方四面、并有下官故炁，疫疠鬼兵，八部魔邪，暴害良善。 门门唯闻哭尸之响，不闻雅乐之音。 大小哀哉，枉遭者众。 耳闻目见，非是吉祥。 某等日夜惊惶，无方投趣。 伏闻老君设教，授与仙真，下传凡俗，大解妙法，杀鬼生人。 今於当处结坛，奉献酒脯，祠五帝之具，占得九章。 今日吉良，宿得天仓。 明如日月，比於三光。 百味杂馔，不敢先尝。 清酒净脯，甘美甚香。 帝君受飨，赐福无量。 七祖生天，解释祸殃，逍遥雅乐，位等仙王。 生人富贵，子孙满堂，三十六代，及以先亡，升入南宫，长乐福乡，去离三涂，免堕镬汤。 长辞剑树寒冰铁床，不见铜柱牛头阿傍。 瘟疫疾病，万代消亡。 收摄百鬼，施於太阳。 灾害解散，永保吉昌。 五帝之主，万神之王，消灭恶业，知其柔刚。 晖生枯荣，言成雪霜。 能使官灾消散，疾病去床； 能使春秋冬夏，上下玄黄； 能使四时节炁，天圆地方。 动作自然，五色玄黄，三明六律，七柔八刚，造作人形，无暗不照，无明不光。 北斗七星，布置诸宿。 角亢氐房心尾箕，配属东方； 井鬼柳星张翼轸，配属南方； 奎娄胄昴毕觜参，配属西方； 斗牛女虚危室璧，配属北方； □□□□□□□，配属中央五行。 推节寒热温凉，使金克木，木自折伤； 使木克土，土自潜藏； 使土克水，水不流行； 使水克火，火自无光； 使火克金，金自消亡。 打考戮鬼，鬼走远方。 疗治疾病，立即自康。 规觅求官，宜奉公王。 使神安宅，宅如金刚； 使符指鬼，鬼即灭亡； 使神斩邪，邪自破伤； 使神治病，病人去床； 使神防卫，行者吉昌； 使神安墓，子孙满堂； 使神耕种，五谷满仓； 使神断病，来者不当。 天有九章，人有恶业，弃与八荒，荡除街巷村陌，并及弟子某宅内，瘟疫斑黄。 自家亲之外，速去远方，屯营百鬼之帅，捉溺付与镬汤。 吞啖精魅，五体消亡。 老君口勑，诛斩不祥，何神能住，何鬼敢当。 帝君降下，万岁吉昌。 行来出入，五神扶匡。",
      "translated_text": "Next, the *Incense Burner Activation Rite*—the disciples, properly adorned in ritual vestments and sashes, stand before the purification altar with reverent devotion. They make obeisance, offer incense, and await communion.\n\nOn this day, the [X]th year of the [Era], the [X]th month, the [X]th day of the lunar cycle, we, your humble disciples of the *Dongyuan* tradition, [Name] and others, respectfully address the following on behalf of disciple [Name]:\n\nWe invoke and beseech:\nThe Azure Emperor of the East, *Lingwei Yang*, Lord *Gou Mang*, and the Azure Empress—descend.\nThe Vermilion Emperor of the South, *Biaonu*, Lord *Zhurong*, and the Vermilion Empress—descend.\nThe White Emperor of the West, *Zhaoju*, Lord *Shaohao*, and the White Empress—descend.\nThe Black Emperor of the North, *Yeguang Ji*, Lord *Xuanming*, and the Black Empress—descend.\nThe Yellow Emperor of the Center, *Han Shuniu*, Lord *Xuanyuan*, and the Yellow Empress—descend.\n\nWe further invoke:\nThe sons and grandsons of the Five Emperors,\nThe *Dianji* and *Gongcao* officials,\nThe *Siming* and *Silü* deities,\nThe *Haosheng Sima*,\nThe great spirits who purify defilement,\nThe Left and Right *Shangshu*,\nThe Front and Rear *Pushe*,\nThe *Yanshou* Jade Maidens,\nThe *Zhangli* and *Sikong* officers,\nThe *Zhunian* scholars,\nThe upper and lower *Dafu*,\nThe ethereal minor officials,\nThe Lords of *Xue Si Ding Sheng*,\nThe Lords of *Jie Shui Tuo E*,\nThe Lords of *Bao Ming Yi Suan*,\nThe Lords of *Zhi Bing Xia Yao*,\nThe *Fuyun* Messengers,\nThe Lords of Thunder and Lightning,\nThe Lords of the Four Continents and Nine Valleys,\nThe immortals of the riverbanks,\nThe *Jianghu* Jade Maidens,\nThe Lords who devour demons and consume ghosts,\nThe Lords who seize and consume ghosts,\nThe Lords who behead and shatter ghosts,\nThe Lords who sweep away misfortune and pacify the six viscera,\nThe Lords who transfer names and fix registers—\nall your exalted seats, accept this humble offering and heed the talismanic decree above and below.\n\nWe summon and address:\nThe great deities of Heaven and Earth,\nThe immortal officials of the Five Emperors,\nThe local earth deities and true officials of this place,\nThe water emperors of the Nine Rivers,\nThe twelve stream maidens,\nThe river lords and water officials,\nThe seven deities of the underworld,\nThe lords of the earth and the Five Marchmounts,\nThe Four Watercourses,\nThe protective officers of humanity,\nThe masters of added years,\nThe left and right transmitting officials,\nThe Lords of absolved transgressions,\nand all spirits—\neach holding jade tablets, attend to the words from our mouths.\n\nFor years, your disciple [Name]’s household has suffered misfortune in dwelling, with family members afflicted by sores and swellings, deaths uncounted, enterprises thwarted, official rank stagnant, desires unfulfilled, and calamities arising without cause. Divination reveals omens of ill fortune, all due to malevolent *qi* from the eight directions and four quarters, along with epidemic ghosts, demonic soldiers, and the eight classes of demonic forces violently harming the good. At every door, only the wails of the dead are heard, never the strains of refined music. Grief and lamentation abound, with many wrongfully stricken. What we see and hear is far from auspicious. Day and night, we are filled with dread, with nowhere to turn.\n\nWe have heard that the Most High Lord Lao established the teachings, bestowing them upon the immortals, who in turn transmitted to the mortal realm the great and wondrous Dharma for slaying demons and reviving the living. Today, we have erected an altar here, presenting offerings of wine and dried meats, the full array for the Five Emperors, and cast the Nine Divinations. This day is most auspicious, the celestial granary is full. Bright as the sun and moon, equal to the Three Luminaries. A hundred delicacies are arrayed, yet we dare not taste them first. The clear wine and pure meats are sweet and fragrant beyond measure. May the imperial lords accept these offerings and bestow boundless blessings. May our seven generations of ancestors ascend to heaven, their misfortunes dissolved, enjoying refined music and ranks equal to the immortals. May the living prosper in wealth and nobility, their halls filled with descendants for thirty-six generations. May the departed and the long-deceased ascend to the Southern Palace, abiding in the land of eternal joy and fortune, escaping the Three Wretched Paths and avoiding the cauldrons of boiling liquid. May they forever leave behind the sword trees, frozen beds, and iron couches, never to see the copper pillars, ox-headed or horse-faced guardians. May epidemics and illnesses vanish for ten thousand generations. May the hundred ghosts be gathered and cast into the sun. May disasters disperse and eternal prosperity be secured.\n\nO rulers of the Five Emperors, kings of the myriad spirits, eradicate evil karma and discern the yielding and the firm. Let radiance revive the withered, let words manifest as frost and snow. You can dissolve official misfortunes and banish illness from the sickbed; you can govern the seasons of spring, autumn, winter, and summer, the celestial round and the earthly square; you can harmonize the *qi* of the four seasons, the five colors and the mysterious yellow, the Three Clarities and the Six Pitches, the seven yielding and eight firm. You shape human form, illuminating all that is dark, shining upon all that is dim.\n\nThe Seven Stars of the Northern Dipper arrange the constellations:\n*Jiao, Kang, Di, Fang, Xin, Wei, Ji*—aligned with the East;\n*Jing, Gui, Liu, Xing, Zhang, Yi, Zhen*—aligned with the South;\n*Kui, Lou, Wei, Mao, Bi, Zi, Shen*—aligned with the West;\n*Dou, Niu, Nü, Xu, Wei, Shi, Bi*—aligned with the North;\n[...] aligned with the Center and the Five Phases.\n\nYou regulate the cycles of cold, heat, warmth, and coolness, causing:\nMetal to overcome Wood, and Wood to break;\nWood to overcome Earth, and Earth to conceal;\nEarth to overcome Water, and Water to cease flowing;\nWater to overcome Fire, and Fire to lose its light;\nFire to overcome Metal, and Metal to melt away.\nYou strike and punish ghosts, driving them far away. You heal illnesses, restoring health at once. You seek official rank, aligning with the just and the royal. You pacify the household spirits, making the home steadfast as metal; you direct talismans at ghosts, and they perish; you command spirits to slay demons, and they shatter; you order spirits to cure illness, and the sick rise from their beds; you charge spirits to guard travelers, ensuring their safe passage; you command spirits to protect graves, filling halls with descendants; you instruct spirits to tend fields, filling granaries with the five grains; you dispatch spirits to sever illness, preventing its return.\n\nLet the Nine Heavens be your witness: humanity bears evil karma. Cast it to the eight wastelands, sweeping it from streets, villages, and crossroads, and from within the home of your disciple [Name], where epidemics and jaundice rage. All but our own kin, depart swiftly to distant lands! Command the generals of the hundred ghostly battalions to seize and cast them into the cauldrons. Devour their essence and specters, dissolving their five bodies. By the decree of Lord Lao’s mouth, execute and slay all misfortune—what spirit could remain, what ghost dare resist?\n\nMay the imperial lords descend, and ten thousand years of prosperity ensue. In all our comings and goings, may the five spirits lend their aid.",
      "overlap_context": "spirit money, five sheets for stabilizing the altar.\n- Forty portions of offering cakes, walnuts, dried jujubes, dried fish, venison jerky, and seasonal fresh fruits.\n- One bowl of *maoxiang* infusion.\n- Twelve lamps.\n- Six peachwood tablets, each one foot one inch long and two inches wide.\n\nThe master’s position is in the north. After knocking the teeth thirty-six times, enter the altar and perform the purification rite.\nNext, seal the demon gate.\nNext, recite the *Guardian Spirit Incantation*.",
      "start_char": 408,
      "end_char": 1634,
      "start_sentence": 18,
      "end_sentence": 79,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.964099407196045,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上三五傍救醮五帝断殟仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "官灾解散，鬼贼潜藏，弟子再拜。 次上香，上茶，上酒 谨启五帝君等，若有邪精、五殟、鬼炁，或复藏形隐影、变化百端、盘停不去者。 上请五啖大将军降下，放大威力，口吐神火，烧鬼头破，然鬼身形，灭其根种，急急一如女青诏书律令。 某七代已来，逮及今身，所造故违，无数重罪，赐乞原除某上祖父母，生存所犯，东方十恶、五逆之罪、不蒙解释者。 上请角亢氐房心尾箕甲乙寅卯辰君，主为某甲解释，悉令原除某生存所犯，南方十恶、五逆重罪、不蒙解释者。 上请井鬼柳星张翼轸巳午未丙丁君，主为某甲解释，悉令原除某生存所犯，西方十恶、五逆重罪、不蒙解#1释者。 上请奎娄胃昴毕觜参申酉戌庚辛君，主为某甲解释，悉令原赦某生存所犯，北方十恶、五逆重罪、不蒙解释者。 上请斗牛女虚危室璧亥子丑壬癸君，主为某甲解释，悉令原除某生存所犯，中央十恶、五逆重罪、不蒙解释者。 上请中斗七星□□□□□□□，主为弟子某甲解释，悉令原赦，若春之三月、有青殟青疫行病之鬼，因木王相欲行毒药、伤害良善者。 上请西方白帝君，主为弟子斩杀之不得，妄行毒害。 若夏之三月，有赤殟赤疫行病之鬼，因火王相欲行毒药，伤害良善者。 上请北方黑帝君，斩杀之不得，妄行毒害。 若秋之三月，有白殟白疫行病之鬼，因金王相欲行毒药、伤害良善者。 上请南方赤帝君，斩杀之不得，妄行毒害。 若冬之三月，有黑殟黑疫行病之鬼，因水王相欲行毒药、伤害良善者。 上请中央黄帝君，斩杀之不得，妄行毒害。 若四季之月，有黄殟黄疫行病之鬼，因土王相欲行毒药、伤害良善者。 上请东方青帝君，斩杀之不得，妄行忤犯。 断除一切群邪，悉令伏匿。 方得天下太平，鬼神不起，风调雨顺，万民安乐。 仰被重恩，弟子再拜。 次上香，上酒 上启五帝君等，弟#1子叩头稽颡，赐乞一生一活、一度一脱，所有深重灾厄。 至于某甲边愿为度灾，安魂定魄，防卫性命，救治疾病。 唯愿肉人阖家、大小等身，或受年穷算尽之厄，横因上计，愿为解除，转更注年，延生保命。 若有天罗地网，缠绕躯体，未蒙解脱。 各请帝君，速为斩截。 一切邪精，愿令消灭。 若有百鬼妄生，拘录肉人，家口男女，魂神不安者，重请五方斗中延命君、安生君、去死君、来生君，迎魂附魄，悉为扶拔，魂神将附身体之中，调和六府。 东斗请为延算，西斗请为记名，北斗请为落死，南斗请为上生。 主为安魂司命，更赐益算。 延寿星官，请为消除死簿，定上生名。 若有天上地下凶逆之鬼，滞在某家，村中巷陌、门前户后，窥求血食，欲行凶伤。 上请三五大将军，官吏将十万人收魔，食鬼，唯愿降下。 上请三五收殟食殟大将军，官将十万人降下。 上请三五收疫大将军，官将十万人具官降下。 上请三五收注大将军，官将十万人具官降下。 上请收精食精大将军，官将十万人具官降下。 上请收邪食邪大将军，官将十万人具官降下。 上请收毒食毒大将军，官将十万人具官降下。 上请收魅食魅大将军，官将十万人具官降下。 上请收凶食凶大将军，官将十万人具官降下。 上请五方五帝斩鬼大将军，官将十万人降下。 主为某甲家，同心并力，收摄村中巷陌、家中宅内，行客魍魉之鬼、伏尸刑杀之鬼，次收门户井灶之鬼，次收五虚六耗、凶吹恶逆之鬼，次收童男童女之鬼，次收殃□土长之鬼，次收独歌自舞喜笑之鬼，次收蛊毒野道之鬼，次收山精崖石、百魅之鬼，次收八部行病之鬼，次收唤人魂魄之鬼，次收各有名字之鬼，次收明公石碇之鬼，次收无名脱籍之鬼，次收树下犬子之鬼，次收夜行凶逆之鬼，次收山林社稷、恶逆淫祠之鬼，次收天下四镇死将之鬼，次收刀兵军阵、无头无手之鬼，次收吴王子胥之鬼，次收赤眉盗贼之鬼，次收三王五霸、败军死将之鬼，次收下痢肿之鬼，次收鲁丁斑黄、转筋、謦咳、吐逆之鬼，次收云中李子遨、千精万魅之鬼，次收摇铃吹角呼唤之鬼，次收缢死之鬼，次收落水之鬼，次收羌獠之鬼，次收六夷之鬼，次收胡狄蛮戎之鬼，次收东方青注之鬼，次收南方赤注之鬼，次收西方白注之鬼，次收北方黑注之鬼，次收中央黄注之鬼，次收绝户之鬼，次收异病卒死之鬼，次收白秃癞病之鬼，次收疮脓臭秽之鬼，次收市死斩头绞刑之鬼，次收乌鹊乱鸣恶音之鬼，次收饥寒冻死之鬼，次收藏形隐影之鬼，次收口舌妄语之鬼，次收六畜之鬼，次收厌人魂魄之鬼，次收白骨不葬之鬼，次收新死破射取人之鬼，次收鼠头人身之鬼，次收牛头人身之鬼，次收虎头人身之鬼，次收兔头人身之鬼，次收龙头人身之鬼，次收蛇头人身之鬼，次收马头人身之鬼，次收羊头人身之鬼，次收猴头人身之鬼，次收狗头人身之鬼，次收堵头人身之鬼。",
      "translated_text": "May official calamities disperse and ghostly bandits retreat into hiding—your disciple bows twice in reverence.\n\nNext, offer incense, tea, and wine.\nWith utmost devotion, we invoke the Five Thearchs: if any perverse spirits, the Five Pestilences, or ghostly *qi* linger—whether concealing their forms, lurking in shadows, transforming endlessly, or refusing to depart—we humbly beseech the Five Devouring Generals to descend. Unleash your mighty power, exhale divine fire to shatter ghostly heads and burn their bodies, extinguishing their very roots. Swiftly, as decreed by the *Nüqing* Ordinance!\n\nFor the transgressions of your disciple [Name]—from seven generations past to the present life—innumerable grave offenses have been committed. We implore forgiveness for the sins of your disciple’s ancestors and living kin: the Ten Evils and Five Heinous Crimes of the East, which remain unresolved.\nWe invoke the Lords of Horn, Neck, Root, Chamber, Heart, Tail, Winnowing Basket, and the Celestial Stems *jiǎ-yǐ*, *yín-mǎo*, *chén*—masters of the East—to absolve and pardon these offenses.\n\nFor the Ten Evils and Five Heinous Crimes of the South, unresolved in this life, we invoke the Lords of Well, Ghost, Willow, Star, Spread, Wing, Chariot, and the Celestial Stems *sì-wǔ*, *wèi*, *bǐng-dīng*—masters of the South—to absolve and pardon these offenses.\n\nFor the Ten Evils and Five Heinous Crimes of the West, unresolved in this life, we invoke the Lords of Straddler, Harvester, Stomach, Pleiades, Net, Turtle Beak, Orion, and the Celestial Stems *shēn-yǒu*, *xū*, *gēng-xīn*—masters of the West—to absolve and pardon these offenses.\n\nFor the Ten Evils and Five Heinous Crimes of the North, unresolved in this life, we invoke the Lords of Dipper, Ox, Girl, Void, Danger, House, Wall, and the Celestial Stems *hài-zǐ*, *chǒu*, *rén-guǐ*—masters of the North—to absolve and pardon these offenses.\n\nFor the Ten Evils and Five Heinous Crimes of the Center, unresolved in this life, we invoke the Lords of the Central Dipper’s Seven Stars [text corrupt]—masters of the Center—to absolve and pardon these offenses.\n\nIn the third month of spring, when the Green Pestilence and Green Epidemic spirits emerge—seizing upon the ascendant Wood to spread their poisons and harm the innocent—we invoke the White Thearch of the West to strike them down, preventing their wanton destruction.\n\nIn the third month of summer, when the Red Pestilence and Red Epidemic spirits emerge—seizing upon the ascendant Fire to spread their poisons and harm the innocent—we invoke the Black Thearch of the North to strike them down, preventing their wanton destruction.\n\nIn the third month of autumn, when the White Pestilence and White Epidemic spirits emerge—seizing upon the ascendant Metal to spread their poisons and harm the innocent—we invoke the Red Thearch of the South to strike them down, preventing their wanton destruction.\n\nIn the third month of winter, when the Black Pestilence and Black Epidemic spirits emerge—seizing upon the ascendant Water to spread their poisons and harm the innocent—we invoke the Yellow Thearch of the Center to strike them down, preventing their wanton destruction.\n\nIn the intercalary months, when the Yellow Pestilence and Yellow Epidemic spirits emerge—seizing upon the ascendant Earth to spread their poisons and harm the innocent—we invoke the Green Thearch of the East to strike them down, preventing their defiance.\n\nMay all manner of perverse spirits be subdued and concealed. Thus shall the world know great peace: ghosts and spirits shall not rise, winds shall be harmonious, rains timely, and the myriad people at ease. Overwhelmed by such boundless grace, your disciple bows twice in reverence.\n\nNext, offer incense and wine.\nWe humbly invoke the Five Thearchs once more: your disciple prostrates himself, kowtowing in supplication. Grant us life upon life, deliverance upon deliverance—lifting the weight of profound calamities. For the sake of your disciple [Name], we beseech you to dispel disasters, pacify wandering souls, secure life and destiny, and heal all afflictions.\n\nMay your disciple’s household—young and old alike—be spared from the misfortune of exhausted lifespans or untimely fates. Should their allotted years be cut short by karmic reckoning, we implore you to dissolve these bonds, restore their years, and extend their lives.\n\nIf the snares of Heaven’s Net and Earth’s Web entangle their bodies, yet remain unresolved, we beseech the Thearchs to swiftly sever them. May all perverse spirits be annihilated.\n\nShould a hundred ghosts arise wantonly, seizing and tormenting the souls of your disciple’s household—men and women, young and old—causing their spirits to wander restless, we earnestly invoke the Lords of Extended Life, Peaceful Birth, Averting Death, and Future Rebirth from the Five Directions’ Dipper Stars. Gather their wandering souls, restore their *po* spirits, and reunite them with their bodies. Harmonize the Six Palaces.\n\nFrom the Eastern Dipper, we request extended years.\nFrom the Western Dipper, we request recorded names.\nFrom the Northern Dipper, we request the removal of death.\nFrom the Southern Dipper, we request rebirth.\nMay the Lord of Souls and the Controller of Destiny pacify their spirits and grant them increased longevity. We invoke the Star Official of Extended Life to erase their names from the ledger of death and inscribe them in the register of life.\n\nShould any inauspicious or rebellious ghosts—whether from Heaven above or Earth below—lurk in your disciple’s home, village lanes, doorways, or thresholds, seeking blood offerings to perpetrate harm, we invoke the Three-Five Generals and their ten thousand officers to descend, subdue demons, and devour ghosts.\n\nWe invoke the Three-Five Generals of Pestilence-Devouring, their ten thousand officers descending.\nWe invoke the Three-Five Generals of Epidemic-Devouring, their ten thousand officers descending.\nWe invoke the Three-Five Generals of Affliction-Devouring, their ten thousand officers descending.\nWe invoke the Three-Five Generals of Essence-Devouring, their ten thousand officers descending.\nWe invoke the Three-Five Generals of Perverse-Devouring, their ten thousand officers descending.\nWe invoke the Three-Five Generals of Poison-Devouring, their ten thousand officers descending.\nWe invoke the Three-Five Generals of Bewitchment-Devouring, their ten thousand officers descending.\nWe invoke the Three-Five Generals of Malevolence-Devouring, their ten thousand officers descending.\nWe invoke the Five Directions’ Five Thearchs’ Ghost-Slaying Generals, their ten thousand officers descending.\n\nFor your disciple’s household, may they unite in purpose and strength to seize and capture:\n—The *wǎngliǎng* ghosts lurking in village lanes and household dwellings, the lingering dead from executions and violent ends;\n—The ghosts of doorways, wells, and hearths;\n—The ghosts of Five Deficiencies and Six Wastages, of ominous winds and perverse breaths;\n—The ghosts of boys and girls;\n—The ghosts of calamitous [text corrupt] and earthbound growths;\n—The ghosts who sing alone, dance in solitude, or laugh without cause;\n—The ghosts of sorcery, wild paths, and poisonous arts;\n—The mountain spirits, cliff demons, and hundred *mei* specters;\n—The Eight Divisions’ plague-bearing ghosts;\n—The ghosts who call out to human souls;\n—The ghosts with various names;\n—The ghosts of *Minggong* and stone anchors;\n—The nameless, unregistered ghosts;\n—The ghosts of puppies beneath trees;\n—The ghosts of night-wandering malevolence;\n—The ghosts of mountain forests, earth altars, and perverse shrines;\n—The ghosts of the Four Guardian Deities’ slain generals;\n—The ghosts of blades, warfare, and headless, handless soldiers;\n—The ghost of Wu King Zixu;\n—The ghosts of the Red Eyebrows and bandits;\n—The ghosts of the Three Kings, Five Hegemons, and defeated armies’ slain generals;\n—The ghosts of dysentery and swelling;\n—The ghosts of *Lǔ Dīng*’s jaundice, cramps, coughs, and vomiting;\n—The ghost of *Lǐ Zǐ’áo* of the clouds, and the thousand spirits and ten thousand *mei*;\n—The ghosts who shake bells, blow horns, and call out;\n—The ghosts of hanging;\n—The drowned ghosts;\n—The ghosts of Qiang and Liao tribes;\n—The ghosts of the Six Barbarians;\n—The ghosts of Hu, Di, Man, and Rong tribes;\n—The Green Affliction ghosts of the East;\n—The Red Affliction ghosts of the South;\n—The White Affliction ghosts of the West;\n—The Black Affliction ghosts of the North;\n—The Yellow Affliction ghosts of the Center;\n—The ghosts of extinguished households;\n—The ghosts of sudden, strange illnesses and deaths;\n—The ghosts of white baldness and leprosy;\n—The ghosts of festering sores and foul decay;\n—The ghosts of market executions, beheadings, and hangings;\n—The ghosts of crows and magpies’ chaotic, ominous cries;\n—The ghosts of starvation, cold, and freezing deaths;\n—The ghosts who conceal their forms and hide their shadows;\n—The ghosts of reckless speech and false words;\n—The ghosts of the Six Domestic Animals;\n—The ghosts who suppress human souls;\n—The ghosts of unburied white bones;\n—The newly dead who shoot arrows to claim lives;\n—The ghosts with rat heads and human bodies;\n—The ghosts with ox heads and human bodies;\n—The ghosts with tiger heads and human bodies;\n—The ghosts with rabbit heads and human bodies;\n—The ghosts with dragon heads and human bodies;\n—The ghosts with snake heads and human bodies;\n—The ghosts with horse heads and human bodies;\n—The ghosts with sheep heads and human bodies;\n—The ghosts with monkey heads and human bodies;\n—The ghosts with dog heads and human bodies;\n—The ghosts with pig heads and human bodies.\n\nMay all these be seized and bound. May the world know great peace, ghosts and spirits cease their rise, winds and rains harmonize, and the myriad people live in joy. Overwhelmed by such boundless grace, your disciple bows once more.",
      "overlap_context": "cs and jaundice rage. All but our own kin, depart swiftly to distant lands! Command the generals of the hundred ghostly battalions to seize and cast them into the cauldrons. Devour their essence and specters, dissolving their five bodies. By the decree of Lord Lao’s mouth, execute and slay all misfortune—what spirit could remain, what ghost dare resist?\n\nMay the imperial lords descend, and ten thousand years of prosperity ensue. In all our comings and goings, may the five spirits lend their aid.",
      "start_char": 1634,
      "end_char": 3499,
      "start_sentence": 80,
      "end_sentence": 124,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 47.10098385810852,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上三五傍救醮五帝断殟仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "右此鬼不承大道盟威禁律之命，专在人间，行其恶毒，令人遭官遇祸、疾病死亡，非所道理。 非五帝之君天官，一一仰凭，次收讨反缚逆鬼，付与都市一切绞刑，灭其根种。 愿令天下清宁，万民安乐，五谷滋盛，阖家大小，魂魄或闭在天地水三官百鬼牢狱之中、不蒙解脱者。 或为百鬼絷系者，请五方五帝七星之君、寿命君、延命君、解厄治病君、却死来生君、保命卫护君，主为某甲安魂定魄，司命延年，益算七星，消除死籍。 东方青色衰厄，从今消灭青殟，鬼炁应时断绝。 南方赤色衰厄，从今消灭赤殟，鬼炁应时断绝。 西方白色衰厄，从今消灭白殟，鬼炁应时断绝。 北方黑色衰厄，从今消灭炁殟，鬼炁应时断绝。 中央黄色衰厄，从今消灭黄殟，鬼炁应时断绝。 今日值建所请依愿，福庆巍巍，更无所恨。 今日值除请福之后，灾祸消除，鬼贼殄灭，福庆有余。 今日值满与帝为伴，任意从容，万事欣喜。 今日值平福有余庆，神来降驾，所愿皆成。 今日值定天地同庆，神灵饱满，合家无病。 今日值执百福臻集，富贵听欢，无有忌。 今日值破却除罪过，神来降福，消灾却祸，灵祇降驾，福禄更多。 今日值危永保无为，祈恩已后，所愿皆遂。 今日值成男女长生，钱财聚集，五谷丰盈。 今日值收户户无忧，黄金入宅，代代不休。 今日值开仙官并来，真炁覆荫，不见祸灾。 今日值闭百鬼消灭，住宅清宁，鬼神伏歇。 次上酒，行香 重启五帝七星君等，臣所请仙官及同侍从，当预坐者，普愿饮飨。 降福重於太山，消灾迅如电散。 福逐神来，天神降重。 应感斯须，拜谢既周，行觞已毕，词不再陈，言无所重。 龙车整辔，神马急备，来如云奔，去如风雨。 迎神千里，送神不起。 自东自西，各还宫府。 后有祈请，别赐垂临。 臣及弟子诚惶诚恐，稽首再礼奉辞。 次送神赞 次十二愿",
      "translated_text": "These ghosts, refusing the commands of the Great Dao’s covenant and the prohibitions of its majestic laws, dwell solely in the human realm, perpetrating their malevolence—causing people to face official calamities, encounter misfortune, fall ill, or meet death, all against reason and principle.\n\nNot being the Celestial Officers of the Five Thearchs, they are each to be seized and bound by their authority. The rebellious and traitorous ghosts shall be delivered to the execution grounds of the cities, their roots and lineages extinguished.\n\nMay the world attain purity and tranquility, all people live in peace and joy, the five grains flourish abundantly, and every household—young and old—find their hun and po souls no longer imprisoned in the prisons of the Three Officials (Heaven, Earth, and Water) or the hundred ghosts’ dungeons, nor bound by the fetters of the hundred ghosts. We invoke the Lords of the Five Directions and Five Thearchs, the Lords of the Seven Stars, the Lord of Lifespan, the Lord of Longevity, the Lord of Deliverance from Misfortune and Healing, the Lord of Reversing Death and Restoring Life, and the Lord of Protection and Guardianship. May they secure and stabilize the hun and po of so-and-so, extend their life mandate, augment their years under the Seven Stars, and erase their names from the registers of death.\n\nFor the eastern direction’s green afflictions: from this day forth, may the green pestilence be eradicated, and the ghostly qi severed at once.\nFor the southern direction’s red afflictions: from this day forth, may the red pestilence be eradicated, and the ghostly qi severed at once.\nFor the western direction’s white afflictions: from this day forth, may the white pestilence be eradicated, and the ghostly qi severed at once.\nFor the northern direction’s black afflictions: from this day forth, may the black pestilence be eradicated, and the ghostly qi severed at once.\nFor the central direction’s yellow afflictions: from this day forth, may the yellow pestilence be eradicated, and the ghostly qi severed at once.\n\nToday, as the cyclical sign aligns with our prayers, may blessings tower like mountains, leaving no regrets.\nToday, as misfortunes are dispelled and blessings invoked, may disasters vanish, ghostly bandits be annihilated, and felicity overflow.\nToday, as the fullness of merit befriends the Thearchs, may all move freely, all affairs bring joy.\nToday, as peace and surplus blessings arrive, may the gods descend in majesty, and all wishes be fulfilled.\nToday, as heaven and earth join in celebration, may the spirits be sated, and every household free of illness.\nToday, as a hundred blessings converge, may wealth and nobility bring delight, with no taboos or hindrances.\nToday, as transgressions are shattered and absolved, may the gods descend with fortune, dispelling calamity and misfortune, while the numinous ones arrive in splendor, multiplying blessings and prosperity.\nToday, as peril is forever averted, may all prayers after this entreaty be granted.\nToday, as sons and daughters attain longevity, may wealth gather, and the five grains flourish.\nToday, as every household is freed from sorrow, may gold enter the home, enduring through generations.\nToday, as the immortal officials descend together, may true qi overshadow, shielding from disaster.\nToday, as the hundred ghosts are sealed and destroyed, may the dwelling be pure and tranquil, ghosts and spirits subdued and stilled.\n\nNext, offer wine and burn incense.\nWe again invoke the Lords of the Five Thearchs and Seven Stars, along with the immortal officials and their attendants who are to be seated. May all universally partake in the feast.\nMay blessings descend heavier than Mount Tai, and disasters vanish swifter than lightning.\nAs fortune follows the gods’ arrival, may the celestial spirits descend in majesty.\nHaving felt this response in an instant, and completed our reverent thanks, the libations now concluded, we shall not repeat our words nor belabor our speech.\n\nThe dragon chariots prepare their reins, the divine steeds hasten to readiness—arriving like clouds in flight, departing like wind and rain.\nWe welcome the gods from a thousand leagues, yet do not rise to send them off.\nFrom east or west, may each return to their palaces.\nShould there be future prayers, may they deign to descend again.\n\nYour disciple, in awe and reverence, bows twice in farewell.\nNext, the Hymn of Sending Off the Gods.\nNext, the Twelve Vows.",
      "overlap_context": "with snake heads and human bodies;\n—The ghosts with horse heads and human bodies;\n—The ghosts with sheep heads and human bodies;\n—The ghosts with monkey heads and human bodies;\n—The ghosts with dog heads and human bodies;\n—The ghosts with pig heads and human bodies.\n\nMay all these be seized and bound. May the world know great peace, ghosts and spirits cease their rise, winds and rains harmonize, and the myriad people live in joy. Overwhelmed by such boundless grace, your disciple bows once more.",
      "start_char": 3500,
      "end_char": 4261,
      "start_sentence": 125,
      "end_sentence": 157,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 21.954812049865723,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上三五傍救醮五帝断殟仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "次学仙赞，散如常仪 太上三五傍救醮五帝断殟仪竟 #1『解』原作『解解』，重文，删一字。 #2『弟』原作『第』，据文义改。",
      "translated_text": "Next, the Hymn of Studying Immortality, dispersed according to the usual rites.\nThe Most High’s Three-and-Five [Perfected] assist in the salvation rite, the Five Emperors conclude the rite of severing misfortune.",
      "overlap_context": "at our words nor belabor our speech.\n\nThe dragon chariots prepare their reins, the divine steeds hasten to readiness—arriving like clouds in flight, departing like wind and rain.\nWe welcome the gods from a thousand leagues, yet do not rise to send them off.\nFrom east or west, may each return to their palaces.\nShould there be future prayers, may they deign to descend again.\n\nYour disciple, in awe and reverence, bows twice in farewell.\nNext, the Hymn of Sending Off the Gods.\nNext, the Twelve Vows.",
      "start_char": 4261,
      "end_char": 4329,
      "start_sentence": 158,
      "end_sentence": 161,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 1.6951947212219238,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上三五傍救醮五帝断殟仪.txt",
        "category": "威仪类"
      }
    }
  ]
}