{
  "source_id": "太上戒经",
  "source_file": "chunked_daozang\\太上戒经.json",
  "total_chunks": 6,
  "total_original_chars": 7025,
  "total_translated_chars": 41929,
  "total_translation_time": 194.8451852798462,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\戒律类\\太上戒经.txt",
    "category": "戒律类"
  },
  "full_translation": "**The Supreme Scripture of Precepts**\n\n**Scripture Title:** *The Supreme Scripture of Precepts*. Author unknown, approximately composed during the Northern and Southern Dynasties. A compilation of six precept texts from the Shangqing, Lingbao, and Celestial Master traditions. One fascicle. Base text from *Zhengtong Daoist Canon*, Dongshen Section, Precepts Category. Collated with *Seven Lots from the Cloudy Satchel*, fascicle 38.\n\n### **The Ten Precepts**\n\nThe *Origin Chapter of the Jade Purity Scripture* states: The Dao spoke, saying that in ancient times, the Primordial Celestial Worthy, together with countless sages and holy ones, traversed myriad realms. Finally, descending to observe the world of Abandoned Worthies, there was a king named Upright Virtue, sharp of root and discerning of wisdom, who served as a guide for all beings. He proclaimed throughout his kingdom to all ministers, subjects, men, and women: \"Now we have attained great peace, the realm is at rest, fires and disasters have ceased, weapons are stilled, and the hundred grains ripen—all by the grace of the Dao, not by nature alone. How shall we repay this boundless kindness? Only by wholeheartedly revering and serving, erecting palaces and oratories, offering incense, flowers, lamps, and candles, performing morning and evening rites, observing fasts, and repenting transgressions to seek blessings and protection.\"\n\nThereupon, the Celestial Worthy commanded the Immortal of Vast Spirit to address the king: \"You are the ruler of a nation, esteemed by all under heaven, the noblest in the mortal realm. Yet if you govern with upright Dharma and do not oppress the people, this alone suffices to move heaven with merit—why seek esoteric mysteries? The Way of esoteric mysteries is difficult to attain at once, but its threshold lies in nothing other than compassion. The method of compassion does not transgress the precepts and prohibitions. Precepts vary in kind, as do people in their capacities.\n\nThe highest grade of persons commit no transgressions in body and thus have no need to uphold precepts. The middle grade of persons waver in mind, shifting with circumstances; they restrain themselves with precepts to prevent dissipation. Such persons may receive the Ten Precepts or the Five Precepts for self-protection. The lowest grade of persons harbor myriad evil intentions, difficult to restrain. Among them, there are two further grades: the higher of these, though desiring to uphold precepts, may receive the One Hundred Ninety-Nine Precepts, the Three Hundred Great Precepts of Observing the Body, or the One Thousand Two Hundred Precepts of Dignified Conduct to guard themselves and prevent transgressions. The lowest of these are like beasts in body, possessing human form but lacking human hearts. Even if they receive precepts, it will be of no benefit.\n\nNow, receive the second, middle-grade precepts: ten prohibitions. At the gateway to the Dao, all who heard this teaching rejoiced, clapping and prostrating themselves to receive the precepts.\n\nThe Celestial Worthy declared:\n\n1. **First Precept:** Do not defy or disobey parents or teachers; do not commit rebellion or filial impiety.\n2. **Second Precept:** Do not kill or slaughter beings, nor sever the lives of creatures.\n3. **Third Precept:** Do not betray the sovereign or plot harm against family and state.\n4. **Fourth Precept:** Do not commit incest with kin, aunts, sisters, or other women.\n5. **Fifth Precept:** Do not slander the Dao and its teachings or recklessly divulge scriptures.\n6. **Sixth Precept:** Do not defile pure altars or expose the body while wearing single garments.\n7. **Seventh Precept:** Do not bully the orphaned and poor or seize others’ property.\n8. **Eighth Precept:** Do not expose the Three Luminaries (sun, moon, stars) or despise the aged and infirm.\n9. **Ninth Precept:** Do not indulge in wine or follow reckless impulses, nor engage in double-tongued or malicious speech.\n10. **Tenth Precept:** Do not act with violence or arrogance, nor presume authority and power for oneself.\n\nThese Ten Precepts are to be upheld throughout one’s life.\n\n### **The Great Precepts of the Highest Grade, with Preface**\n\nThe *Scripture of the Highest Grade* states: The Supreme Perfected of the Great Ultimate, while in secluded cultivation on Mount Tiantai, bowed his head in reverence and inquired of the Great Ultimate Dharma Master Xu Laile: \"Your disciple is fortunate to attend the Celestial Worthy and, since hearing these subtle words, has encompassed kalpas without end, penetrating the source of the Dao. The joy of surpassing abundance cannot be expressed. I have long cherished the divine immortals and the Way of ascending in broad daylight, ever yearning for the highest sages. Yet the great scriptures are profound and distant, their mysteries difficult to fathom. I wish to receive oral instructions to dispel my dark ignorance, thoroughly illuminating the empty and vast, where being and non-being are entirely exhausted.\n\nRecently, I have not yet fully understood the karmic causes of past lives or the origins of one’s original conduct. Now, I beseech the Celestial Worthy to enlighten what I have not yet awakened to.\"\n\nAt that time, the Supreme Mysterious and Lofty Perfected, chanting the *Void-Penetrating Hymn* and pacing the void, joyfully radiant, spoke with a countenance like golden splendor: \"You, through kalpas of devotion to the Dao, have attained the jade name of the Great Ultimate, dwelling among the wise. You shall ascend alone to the Jade Capital, transcending the Three Realms—how majestic is the task of the Supreme Perfected! Thus, you extend compassion to heaven and humanity, mindful of guiding later learners. Constantly using your own body to aid others, you possess virtue yet do not claim it. What is expounded in the Mysterious Metropolis is surely not in vain.\"\n\nThen he addressed the Great Ultimate Perfected: \"You have received the teachings of the Supreme Void Sovereign Dao Lord and serve as his preceptor. You must fully impart the profound and abstruse mysteries of the Highest Great Cavern—why wait for further elaboration? I, unworthy, have been entrusted as the Dharma Master of the Teaching Assembly, and the handling of the scriptures now rests with you.\"\n\nThe Great Ultimate Perfected replied: \"This youthful perfected one, whose name is inscribed on the golden tablets, possesses a nature pure and distant, his spirit luminous and refined. The Supreme Mysterious and Subtle Void-Penetrating [Dao] has destined him for the role of Supreme Perfected, a great propagator of the Dao. Though I, unworthy, have received the mandate to teach, I am ashamed to be his master. Yet since the Supreme One has commanded, how dare I not fully respond?\"\n\nThe governance of all mysteries now depends upon you, Dharma Master.\n\nThe Great Ultimate Perfected further said: \"The Dao is Non-Being. It pervades the boundless, yet should you seek it, it lies near within your own body—thus it is also Being. Through Being one enters Non-Being; through accumulated thought one attains the wondrous. The myriad things, teeming like illusions, must all return to emptiness, and the human body is no exception. When the body dies, the spirit departs—compare it to a house: when the house collapses, the person cannot stand; when the body decays, the spirit cannot dwell. One must restrain thoughts to stabilize the will, calm the body to settle the spirit, treasure qi to preserve essence, and forget both deliberation and care. Through inner vision in profound meditation, body and spirit become one. When body and spirit become one, one approaches the true body. This truly arises from the fundamental conduct of past lives, from accumulated thought and repeated resonance, from merit that aids all beings, and from virtue that responds to the myriad things.\n\nYet through the turning of karmic conditions, sin and blessing stand in opposition, life and death alternate, noble and base employ one another, worthy and foolish vie, poor and rich deceive, good and evil manifest—suffering is measureless. All these are the results of one’s own actions and vows, not of the Dao, nor of heaven, nor of earth, nor of other people, but of the myriad things themselves. It is precisely the heart that brings them forth. Once such karmic oppositions are forged, they are difficult to escape. Among the weak and lost, few believe in the Dao; most are bound by past karma. Without accumulating goodness and stabilizing thought, without cultivating virtue and ordering the body, one who would rashly abandon virtue and forget the body, forcibly seeking external things—how could such a one succeed? Having already failed, none escape harm to the body.\n\nThus the man of the Dao draws from his own being and seeks nothing from others. The Dao speaks of cultivating the body so that one’s virtue becomes true—this is what it means. One who studies the Dao yet does not receive the Great Wisdom, the Primordial Vow, and the Upper Grade Precepts of the Dao Conduct will have no cause to ascend as an Upper Immortal. You possess past-life karmic affinity, which is why you behold this scripture. Its words are recondite and esoteric; first establish faith and verify the heart, then transmit it. Do not recklessly display it. Those who disbelieve will generate aberrant thoughts, and once such thoughts arise, both parties incur transgression. Therefore, conceal it in the realm of the Unconditioned. Only when one is destined to become a Perfected King of Immortals should it be revealed.\"\n\nAt that moment, clouds and dragons leapt and danced, the heavens scattered blossoms, flying incense and curling smoke filled the air, mountains and seas stilled their waves, all creatures fell silent, ghosts and demons vanished, spirits and demons submitted, the Five Sufferings were all dissolved, and those long bound in hell were forever freed. The wicked turned to goodness, and the faithful and obedient received blessings. Then the Great Ultimate commanded the Scripture-Attending Immortal Liu Wenzheng to unroll the cloud-scroll and bestow the scripture.\n\nThe Great Ultimate Perfected said: \"In past lives, one reverently served scripture masters, recited with the mouth and practiced with the body, gave alms to those in distress, took joy in the Three Treasures, was loyal to ruler and filial to parents, retreated to mountains and rivers, lodged with the worthy and learned, maintained an empty heart and followed the Dao, burned incense and scattered blossoms, protected and delivered all beings, cultivated the Dao and amended faults, believed in and submitted to past karma, and calmly contemplated while restraining the passions. Such conduct, in its highest expression, can ascend as an immortal and deliver the world; in its lowest, it can bring about wealth and nobility, birth as a person of honor, a majestic and refined appearance, and a nature of clear and distant wisdom. In the Way of being human, nothing will be lacking.\n\nThose who in the world enjoyed wealth and nobility while mocking the poor and lowly are now repaid with poverty and lowliness. Those who in the world delighted in killing are now repaid with injury and death. Those who in the world treated others with contempt and mocked the ugly are now repaid with ugliness. Those who in the world were clever yet did not teach others are now repaid with dullness and obstruction. Those who in the world were always healthy and mocked the sick and afflicted are now repaid with chronic illness. Those who in the world did not believe in spiritual communication and mocked the scriptures and teachings are now repaid with utter stupidity, forever cut off from the Dao.\n\nWomen who in the world stole others’ husbands are now repaid with early widowhood. Men who in the world seduced others’ wives are now repaid with lifelong solitude. Those who in the world pledged their hearts to become husband and wife yet in later lives do not both attain human birth, dying as ghosts and demons, are now repaid according to their original intentions, falling into perverse illnesses. Without the Great Dharma, none can untangle their karmic bonds and dispel these perverse illnesses.\n\nFor parents, siblings, sisters, husbands and wives, rulers and ministers, teachers and guardians, friends—all are bound by the vows and thoughts of past lives, arising through karmic conditions in endless cycles. Is there none who does not have such karmic oppositions? Thus it is said: 'Dependence and latency are inexhaustible.' Only the student of the Dao of Immortality should utterly forget karmic conditions, extinguish life and death, and together return to the Mysterious, entering the wondrous gate. One who knows this may begin to speak of the foundation of studying the Dao.\n\nWhen you see those with families and children, wish that all may swiftly transcend love and desire, gathering their minds to uphold the precepts. When you see those drinking wine, wish that all may restrain themselves at the Gate of Life, avoiding calamity and disorder. When you see beauties, wish that all may guard their passions and endure desire, aspiring to worthy chastity. When you see the licentious, wish that all may cast aside impure thoughts, lifting their hearts to strict observance. When you see women, wish that all may endure the severing of frivolous adornments, delighting in the Dao and finding joy in themselves. When you see the chaste, wish that all may tread the path of faith and right transformation, daily entering the Dharma gate. When you see multitudes, wish that all may extend benevolence without contention, embracing the Dao and bringing peace to the world. When you see the good, wish that all may at every moment hold to mindfulness, looking up to follow their Way. When you see the wicked, wish that all may abandon evil and turn to good, not transgressing the laws of the king. When you see the poor, wish that all may diminish their own bodies to bestow kindness, later receiving great blessings. When you see the rich, wish that all may save and aid the myriad things, receiving emoluments for generations. When you see the noble, wish that all may receive their teachings and decrees, all becoming models of instruction. When you see the lowly, wish that all may diligently cultivate without negligence, each attaining their aspirations. When you see the emperor, wish that all may revere and look up to the kingly Way, being as filial as to parents. When you see ministers and chancellors, wish that all may receive their teachings and governance, so that the four directions return to benevolence. When you see soldiers and armor, wish that all may each hold to a heart of benevolence, and the world yield to the worthy.\"\n\nWhen you see princes, wish that all may daily sing of great peace, sustaining the state and upholding their households. When you see the worthy, wish that all may practice their virtue, the Dao/Way becoming the model for the world. When you see Dharma masters, wish that all may clearly understand the Dharma and precepts, attaining the Dao/Way in non-action. When you see Daoist recluses in the mountains, wish that all may fully perceive the Dharma gates, swiftly ascending as immortals. When you see teachings and transformations, wish that all may personally receive the sagely teachings, all becoming profound and erudite. When you see sages, wish that all may revere, serve, and behold them, every kingdom gazing upon them. When you see immortals, wish that all may perfect the true Dao/Way, ascending to heaven on high.\n\nWhen you see city walls, wish that all may be strictly ordered and adorned, with the Dao/Way as their foundation. When you see great states, wish that all may return to the ancestral and admire virtue, like waters flowing to the sea. When you see small states, wish that all may know restraint and emptiness, content in their abodes. When you see markets and courts, wish that all the multitudes of worthies may gather like clouds, all propagating the true Dao/Way. When you see quiet contemplation, wish that all may accumulate towering merit and virtue, celestial and human attaining the Dao/Way. When you see fasting, precepts, and incense offerings, wish that all may daily renew their virtue and power, with schools and academies refined and upright.\n\nWhen you see sutra recitation, wish that all may ascend to the high seat, universally hearing the sagely voice. When you see scriptural teachings, wish that all may each receive, read, venerate, and practice them, universally propagating transformation. When you see towers and observatories, wish that all may penetrate and observe the ten directions, with nothing concealed. When you see lofty mountains, wish that all may possess boundless wisdom and thought, aiding in the completion of families and states. When you see resting beneath flourishing trees, wish that all may dwell in peace and ease, sheltering all sentient beings.\n\nWhen you see the diligent in study, wish that all may become masters and models, nurturing disciples and disseminating teachings. When you see clean hands, wish that all may constantly hold scriptures, never ceasing for a moment. When you see eloquent speech, wish that all may delight in savoring the profound sutras, daily renewed without weariness. When you see moving feet, wish that all may transcend the Three Realms in a single step, soaring to the Upper Clarity. When you see stillness, wish that all may extinguish their shadows and halt their essence, abiding in tranquil emptiness.\n\nWhen you see food and drink, wish that all may cast off burdens and enter purity, preserving the flavor of the Dao/Way. When you see great storehouses, wish that all may eliminate calamities and disasters, becoming fields of blessing. When you see illness, wish that all may stabilize themselves with the Dao/Way, escaping this suffering and peril. When you see death and mourning, wish that all may study the Dao/Way and abide eternally, delivering the three kinds of disciples.\n\nWhen you see hunting, wish that all may never begin nor end it, entering without transgression. When you see barbarians, wish that all may be born in the Central Kingdom, not in borderlands. When you see the young, wish that all may study diligently in their time, ultimately achieving scholarly renown. When you see the aged and infirm, wish that all may nurture life with the Dao/Way, never again declining or aging.\n\nWhen you see the Three Luminaries, wish that all may universally illuminate with numinous radiance, dispelling darkness instantly. When you see clouds and rain, wish that all may overflow with beneficent moisture, suiting every need. When you see pristine snow, wish that all may constantly dwell in purity, carefree and at ease. When you see divine winds, wish that all may unfold their hidden treasures, virtue flowing far and near. When you see contending for water, wish that all may wash away filth and attain clarity, equalizing their hearts.\n\nWhen you see fine incense, wish that all may receive its compassionate fragrance, all impurities solemnly stilled. When you see beautiful flowers, wish that all may delight in scattering them before the sages, their marks of excellence complete. When you see carriages and horses, wish that all may attain the Dao/Way in non-action, riding phoenixes and driving dragons. When you see stringed music and song, wish that all may chant sutras and praise the Dharma, delighting in the Dao/Way.\n\nWhen you see blessed meals, wish that all may be universally satiated, enjoying the celestial kitchens of the world, their virtue flowing to posterity like waters returning to the sea, ancestral temples receiving longevity, constantly dwelling in nobility and prosperity, with the four classes of disciples all born in royal houses.\n\nWhen you see almsgiving, wish that all may extinguish the ninefold yin calamities, blessings arising in the ten directions, their virtue like mountains and seas, universally flourishing, seven generations of ancestors ascending to heaven, descendants worthy and loyal, rich and noble beyond measure, all desires fulfilled, studying the Dao/Way and ascending as immortals, riding clouds and driving dragons.\n\nIn the sitting and reclining of Daoists, may we always wish that our four great elements harmonize with virtue, our bodies united with the true Dao/Way, eternally abiding in the Mysterious Capital, with masters and friends naturally present, delivering the ten directions, the world receiving grace, carefree in non-action, penetrating the wondrous gates.\n\n**Three Invocations for Venerating the Scriptures**\n\nThe oral instructions of perfected persons say: When the jade maidens and immortal youths who attend the scriptures hear these invocations, they rejoice and protect the practitioner’s body. All great scriptures employ these invocations in worship. Those who venerate the scriptures in profound contemplation should also silently recite these words—this is the secret invocation of the highest immortals.\n\n**First Invocation**\nDelighting in the Dharma as one’s wife,\nCherishing the scriptures like pearls and jade.\nUpholding precepts to restrain the six emotions,\nContemplating the Dao/Way to dispel desires.\nSerene and unadorned, the upright qi abides,\nDetached, the spirit still and silent.\nHeavenly demons all revere and protect,\nLifetimes of great blessings received.\n\n**Second Invocation**\nFlourishing are families and states,\nProsperous are the scriptures and Dao/Way.\nCelestials and humans share this aspiration,\nSubtly entering the Great Vehicle.\nEstablishing fields of blessing through the mind,\nGradually ascending through the Dharma.\nSeven generations of ancestors born in heaven,\nMy body ascending in broad daylight.\n\n**Third Invocation**\nThe Great Dao/Way pervades the mysterious void,\nWith mindfulness, nothing fails to accord.\nRefining the body to enter the immortal true,\nThus attaining a vajra body.\nTranscending the Three Realms’ difficulties,\nThe five hells’ sufferings dissolved.\nAll return to the Supreme Scriptures,\nIn tranquil contemplation, bowing in reverence.\n\nThe Perfected of the Great Ultimate says: To study the Dao/Way of ascending as immortals, one must establish one thousand two hundred acts of goodness, never receiving retribution. Establishing three thousand acts of merit results in ascending to heaven in broad daylight—all involve delivering people from mortal perils. Bestowing kindness upon others is especially virtuous! In studying the Dao/Way, one should align all actions with the Dharma, broadly establishing fields of blessing, arousing a heart of great compassion, and constantly awakening the intention of the Dao/Way in movement and stillness.\n\nIf one can thus practice—refining breath through ingestion and exhalation, consuming elixirs, wearing talismans, reciting scriptures with diligence, and never growing weary throughout life—how could one fail to attain immortality? Those devoid of such virtue, though they consume elixirs, wear talismans, recite scriptures, and observe fasts, will ultimately meet their destined end without verification.\n\nScholars, ponder these essential words.\n\nThe Perfected of the Great Ultimate says: Establishing three hundred acts of goodness grants one the attainment of earthbound immortality. Should even one act remain incomplete, one must begin anew, and all prior merit is forfeit. Only when such resolve is steadfast in mind and marrow does it hold true. Guiding others to perform good deeds likewise constitutes virtuous merit.\n\nThe Perfected of the Great Ultimate says: Constantly chanting the *Dongjing* in recitation, cultivating great compassion, placing others before oneself, extolling goodness and transforming evil, severing all karmic entanglements, extinguishing thoughts and guarding emptiness—when the heart mirrors the Supreme Mystery and the Dao/Way is sought therein, only then may one be called capable of discoursing on the path of divine transcendence.\n\nThe Perfected of the Great Ultimate says: I received from the Highest Great Dao of the Primordial Void the *Ten Virtues of Exhortation and Merit* of the Supreme Wisdom of the Great Ultimate, a teaching revered and practiced across lifetimes. Delivering others is effortless—this is the natural blessing of the Dao/Way. The Supreme Venerable One universally instructs heaven and humanity, allowing each to fulfill their original vow, first entering the Dharma gate to abide in non-action, free from the ten sufferings, eight adversities, and karmic retribution. Hell is dissolved, the Three Bureaus pacified, daily tranquility secured, and lifetimes of glory and joy attained. All escape the snares of fate, future rebirths are serene, and the celestial nature remains undisturbed. Desires follow their course, and those who uphold these precepts as above may transmit them to the worthy and faithful.\n\nThe *Ten Exhortations of Virtue* state:\n1. Exhort and assist in revering the Three Treasures, making offerings to Dharma masters, so that in this life one becomes a noble person—virtuous, filial, and of lofty talent, honored and esteemed, respected by all, with a flourishing lineage.\n   The Three Treasures are the Dao, the scriptures, and the masters. Those who nurture life, teach goodness, and serve as models for others are called Dharma masters.\n\n2. Exhort and assist in transcribing scriptures, so that in future lives one becomes wise and learned, with profound insight, ever encountering sagely eras, witnessing all scriptural teachings, and reciting their verses.\n\n3. Exhort and assist in establishing fasts and rituals, so that in future lives one’s family attains high nobility, the body ascends to heaven, sustenance is natural, and one dwells perpetually in non-action.\n\n4. Exhort and assist in offering incense, oil, and various supplies, so that in future lives one’s fragrance endures, purity and radiance abound, and one’s countenance is peerless, with celestial grace and lofty refinement.\n\n5. Exhort and assist in providing Dharma masters with robes, so that in future lives one becomes refined and at ease, dwelling in the Central Kingdom, never falling to borderlands or barbaric realms, with sons and daughters of upright bearing, adorned in crowns, jade pendants, and fitting attire.\n\n6. Exhort and assist kings, parents, and the people in loyalty and filial piety, so that in future lives one has many descendants, sons and daughters of wisdom and virtue, free from all suffering.\n\n7. Exhort and assist in fasting, purification, and scripture recitation, so that in future lives one avoids hell and ascends to heaven, paying homage to all sages, swiftly regaining a transformed body and rebirth in a royal household, with every desire fulfilled, pleasures in abundance, and seven generations of ancestors rejoicing together. All karmic conditions are perfected, and from beginning to end, glory and joy in the Dao/Way persist, ultimately leading to the attainment of immortality.\n\n8. Exhort and assist others in studying scriptures, so that in future lives one’s wisdom and intelligence are penetrating, conduct and demeanor dignified, and one constantly serves as a teacher to others.\n\n9. Exhort and assist in all acts of generosity, admonishing and encouraging good deeds, so that in future lives one enjoys longevity, wealth, and happiness, free from resentment and vexation.\n\n10. Exhort and assist all people in relinquishing jealousy and desire, practicing myriad virtues, so that in future lives one abides in peace and joy, free from calamity and disorder. The sick recover, officials rise in rank, and all look up to one with reverence. Every endeavor is auspicious, the household pure and noble, cherished by heaven and humanity, protected by spirits and demons, and one is forever born in blessed realms.\n\nThe Perfected of the Great Ultimate says: Of all human evils, none surpass jealousy, killing, greed, extravagance, arrogance, and licentiousness. If even one of these resides in the heart, it severs one’s lifespan. To cling to such while seeking divine transcendence—is this not lamentable?\n\nFrom the *Tai Xiao Lang Shu*: When the ten virtues are practiced, the ten evils naturally cease. Ceasing evil and practicing goodness perfects the virtue of great compassion. Thus, the highest precepts state: Relieve the dead and deliver the living, heal the sick and cure diseases, bestow kindness upon the destitute, sacrifice oneself to aid others, serve one’s masters with devotion, construct tranquil abodes, transcribe and collate scriptures, cultivate fasts and recite the Dao/Way, yield to others and relinquish righteousness, avoid contending for merit and fame, enlighten the ignorant, admonish and dissolve evil, dig wells along roadsides, plant orchards and groves, educate the young, exhort others to perform good deeds, ensure one’s conduct is exemplary, movements and stillness are admirable, teachings and systems are sound, and actions are consistently thus. Practicing the ten virtues universally is called a Daoist. Without cultivating virtuous merit, one labors in vain in the mountains and forests. Those who trust these principles should diligently seek all precepts. The precept sections are vast, and one should follow what is accessible. Countless precepts and boundless regulations all assist the singular spirit, governing the three karmas.\n\nThe three karmas are body, mouth, and mind. All actions and creations—good and evil—are measureless. Of the measureless good and evil, ten are the roots of evil:\n1. False speech.\n2. Frivolous speech.\n3. Divisive speech.\n4. Abusive speech.\n   These four are evils of the mouth; reversing them yields goodness.\n5. Covetousness.\n6. Theft.\n7. Licentiousness.\n   These three pertain to the body.\n8. Jealousy.\n9. Resentment.\n10. Delusion.\n   These three pertain to the mind. The karma of the mind is the heaviest, serving as the root of the ten evils. Sever the ten evils and cultivate the roots of the ten virtues: speak truthfully and directly, communicate harmoniously, recite with clarity, yield and relinquish wealth, maintain inner and outer chastity, rejoice in praise, fear and delight in reverence, and honor the Three Honored Ones. With these ten virtues complete, the ten evils are forever eradicated.\n\nFrom the *Sutra on Stabilizing the Mind and Resolving Will*, the Ten Precepts:\n1. Do not kill; contemplate the lives of all beings.\n2. Do not commit adultery or violate the wives of others.\n\n3. Do not steal; take no wealth that is not rightfully yours.\n4. Do not deceive; do not reverse discussions of good and evil.\n5. Do not become intoxicated; constantly contemplate pure conduct.\n6. Maintain harmony among clan and kin, with no distinction between close and distant.\n7. Upon seeing others do good deeds, rejoice in your heart and assist them.\n8. Upon seeing others in distress, aid them in performing meritorious acts.\n9. When others harm you, resolve not to seek repayment.\n10. For all who have not yet attained the Dao, do not hold expectations toward them.\n\nThe sutra states: There were once twelve youths in the world who delighted in pleasure. Daily, they gathered together to prepare fine food, drinking to intoxication and playing games, or else discussing the difficulty of upholding the precepts. The Heavenly Worthy, with the Dao-eye, saw from afar that in their past lives they had been teachers who, though hoarding scriptures and instructing disciples, remained hesitant in their commitment to the Dao. For this slight reason, they were still salvageable. Thus, the Heavenly Worthy transformed into an ordinary person and passed through their gathering, pretending to beg for food. Engaging them in conversation, he resumed the earlier discussion.\n\nOne of them said: “I have often followed my elder brother to Mount Anle, where I saw many Daoists strictly observing the Ten Precepts. Their demeanor was most solemn and admirable. Even at death, their souls and spirits would not be in vain. Yet, though the Ten Precepts exist, it is difficult for people to fully uphold them.”\n\nThe transformed one replied: “Upholding them is quite easy; violating them is exceedingly difficult.”\n\nThe youths asked: “How is upholding the precepts easy, while not upholding them is difficult?”\n\nThe transformed one said: “To establish oneself in accordance with the precepts is to fear neither the Son of Heaven nor ghosts and spirits—how can this be called difficult? Those who violate the precepts fear all things—this is truly difficult.”\n\nOne of them said: “I could uphold the other precepts, but abstaining from alcohol is hard. Why? I previously took elixir powders, and on the day their effects manifest, only wine can relieve them. That is why it is difficult.”\n\nThe transformed one said: “The effects of elixir powders require this—it is medicine. To nurture the four great elements, medicine may be taken, but do not exceed the proper measure.”\n\nAnother said: “I could manage other matters, but false speech is difficult. Why? If there is a private matter before one’s elders, it should be concealed out of respect. Yet if questioned, one cannot lie, for lying violates the precepts. This is why it is difficult.”\n\nThe transformed one said: “There are matters that should be concealed, and principles that allow for flexibility. This too can be managed, but do not reverse discussions of good and evil or speak of others’ faults.”\n\nAnother said: “I could uphold the other precepts, but the prohibition against theft is difficult. Even in minor matters, one may inadvertently transgress.”\n\nThe transformed one said: “Great theft is indeed difficult, but even in minor matters, one must be cautious.” Then he spoke a verse:\n\n*Why not receive the precept against theft?*\n*Not receiving it is also difficult.*\n*Who says in darkness there is no record?*\n*There stands the official who records theft.*\n*Take one, and it doubles year by year,*\n*Each doubling brings no leniency.*\n*With hands you hold molten bronze,*\n*Burning your mouth, scorching heart and liver.*\n*Once you speak of this suffering,*\n*For years your heart will still ache.*\n*Why not receive this precept,*\n*And preserve it whole and complete?*\n*I trust, and so do they,*\n*Everywhere, all is secure.*\n*Sit in peace and summon the immortal,*\n*Forever enjoying boundless joy.*\n\nAnother said: “I could uphold the other precepts, but abstaining from licentiousness is most difficult. Why? I have experienced this myself. Often, when dining with my elder brother, he would say during the meal that he was practicing strict asceticism, never transgressing reason, and that after death, he would gain the blessings of these precepts and fasts. Yet that very night, the object of my desire would come, cunning and enticing. Though I struggled to restrain myself, I would unknowingly succumb. This happened repeatedly—thus I know it is most difficult.”\n\nThe transformed one said: “Desire is but a delusion; all delusions are empty. Where is there true desire? First observe your own body and know that it has no abiding place. Then you will understand there is no desire—how can you not endure? Moreover, indulgence in lust is like drinking saltwater: the more you drink, the thirstier you become, until only death remains. Where is there satisfaction?” Then he spoke a verse:\n\n*Desire is more severe than thirst.*\n*With a little restraint, how can you not cross over?*\n*Why drink saltwater,*\n*Which only increases thirst?*\n*If you can truly quench thirst,*\n*Drink the sweet dew of heaven.*\n*Sweet dew is fragrant and rich,*\n*Flowing through your entire body.*\n*Heavenly beings follow the scent and descend,*\n*And you will naturally awaken to the profound.*\n*Joyful and free, forever without striving,*\n*You will long preserve the blessings of the Nine Heavens.*\n\nAnother said: “I could uphold the rest, but abstaining from killing is difficult. Why? I enjoy eating chicken. A meal without chicken is utterly tasteless, and after several days, I grow thin.”\n\nThe transformed one said: “Wise one, fatness is a burden to the body, while thinness lightens it. What use is fatness?” Then he spoke a verse:\n\n*Wise one, abstain from killing,*\n*And harbor no thought of killing.*\n*Though beings are small,*\n*All delight in living and growing.*\n*How can you harm their lives*\n*To nourish yourself?*\n*This nourishment lasts but a moment,*\n*Yet it burdens you with natural clarity.*\n*You will long sink in the Three Realms,*\n*Enduring suffering again and again.*\n*Good and evil each have their causes,*\n*Like an echo following a call.*\n*Why not change this conduct*\n*And reward yourself with a compassionate heart?*\n*True persons will take your hand*\n*And wander carefree above the clouds.*\n\nAfter speaking this verse, the transformed one revealed his majestic form, assuming the full appearance of the Dao. His attendants and retinue, the grand music of the heavens—indescribable to the eye—returned to the upper realms. The youths all witnessed this, their joy and awe mingling. Having heard the essential teachings, their minds opened in awakening, and together they ascended to the fruition of the Dao.\n\nFrom the *Sutra of the Wondrous Grove*, the Twenty-Seven Precepts:\nThe Primordial Heavenly Worthy addressed the four assemblies: “All sentient beings cling to conditioned existence, rejoicing in life and fearing death. Though they seek life, they create the karma of death. Not upholding the precepts, even if they live long, they are like old trees—what difference is there? If they uphold the precepts, at death they will fill the heavenly offices and ascend as immortals, free and at ease.”\n\nThough one may hold the rank of duke or minister, or even ascend to the throne as emperor, at death all bear grave transgressions. This brings no benefit to the soul, and the suffering endured is unbearable. Good sons, reflect deeply: uphold the precepts with clarity and walk the Dao with a straight heart. I shall tell you—among all things under heaven, none endure forever. There is death and life, success and failure; the sun rises and sets, the moon waxes and wanes. From ancient times to the present, who can defy this turning? Only those who embody the Dao are beyond birth and extinction.\n\nThose who cultivate goodness are good this month, good this day, good this very moment. As goodness and virtue accumulate, all practices reach fulfillment, and wholesome thoughts are upheld, guiding one into the treasury of the Dharma.\n\nThe Precepts state:\nDo not steal others’ property.\nDo not wrongfully take others’ wealth.\nDo not engage in deceitful or frivolous speech.\nDo not kill out of hatred.\nDo not indulge in greed, anger, delusion, or cruelty.\nDo not disrespect the elderly or deceive others.\nDo not harbor curses or poisonous intentions.\nDo not shout or hurl abusive language.\nDo not slander or defame others.\nDo not sow discord with duplicitous or flattering words.\nDo not criticize others’ faults.\nDo not delight in speaking ill of others.\nDo not denigrate goodness or praise yourself.\nDo not be arrogant or self-conceited.\nDo not keep venomous creatures or poison others.\nDo not falsely attribute good deeds to others.\nDo not disdain or neglect the scriptures.\nDo not slander sacred texts.\nDo not rely on power to oppress others.\nDo not indulge in sensual pleasures or lust.\nDo not take pleasure in killing living beings.\nDo not become intoxicated with wine or lose your senses.\nDo not kill for licentious sacrifices.\nDo not burn wild forests or mountains.\nDo not criticize or debate your teachers and elders.\nDo not be greedy or hoard wealth.\nDo not reveal others’ private affairs.\n\nThe Twenty-Seven Precepts of Lord Lao:\nPractice non-action, practice gentleness, practice yielding—do not act first.\nThese are the three highest practices.\nPractice namelessness, practice purity without contention, practice all goodness.\nThese are the three middle practices.\nPractice loyalty and filial piety, practice contentment, practice deference.\nThese are the three lowest practices.\nThese nine practices, comprising two sections and eighty-one chapters, form the dwelling of the Dao, binding high and low alike.\nThose who fulfill all nine become immortals;\nthose who fulfill six attain longevity;\nthose who fulfill three gain extended years.\n\nPrecepts:\nDo not waste your spirit and energy.\nDo not consume beings that contain blood, delighting in their beauty.\nDo not harm the royal qi.\nDo not covet treasures or goods.\nDo not forget the Dao.\nDo not act recklessly.\nDo not distort the Dao with superficial forms.\nDo not kill living beings.\nDo not crave fame and merit.\nThese are the nine highest precepts.\n\nDo not be ensnared by the pleasures of the ears, eyes, nose, or mouth.\nAlways practice humility and deference.\nIn all matters, be deliberate and avoid carelessness.\nDo not study heterodox texts.\nDo not adorn the body with fine clothes or rich food.\nDo not seek fame or reputation.\nDo not greedily pursue high rank or power.\nDo not be rash or impetuous.\nDo not be excessive or overbearing.\nThese are the nine middle precepts.\n\nDo not contend with others over right and wrong; avoid gain and loss.\nDo not commit any evil.\nDo not despise poverty and low status while striving for wealth and nobility.\nDo not be overly superstitious.\nDo not invoke the great names of sages.\nDo not be aggressive or domineering.\nDo not pray to or worship ghosts and spirits.\nDo not be self-righteous.\nDo not delight in warfare.\nThese are the nine lowest precepts.\n\nThese twenty-seven precepts, comprising two sections, form the profound depths of the Dao, binding high and low alike.\nThose who fulfill all become immortals;\nthose who uphold eighteen attain longevity;\nthose who uphold nine gain extended years and avoid untimely death.\n\nThus concludes the *Scripture of the Most High’s Precepts*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上经戒 经名：太上经戒。 撰人不详，约出朴南北朝。 慕集上清、灵宝及天师道戒律六种。 一卷。 底本出处：《正统道藏》洞神部戒律类。 参校本：《云笈七签》卷三十八。 太上经戒 十戒 《玉清经本起品》云：道言，昔元始天尊与诸贤圣，亿亿万众，处处周旋，最后下观弃贤世界，有一国王名曰德正直，利根辩慧，为众生故，而为导首。 遍告国内臣民男女言：今得太平，天下无事，火灾消灭，兵刃不起，百谷成熟，皆由道恩，非自然也。 何以报道？ 罔极之恩，唯当倾心尽意，恭敬供养，造立宫观，香花灯烛，晨夕礼诵，斋戒悔过，以求福佑。 於是天尊命巨灵仙人而告王曰：子为一国之主，天下所推，凡间之贵，不先於此，但以正法治化，不枉人民，亦足功感上天，何烦秘要？ 秘要之道，卒难可闻，然秘要之阶，不过慈善，慈善之法，不违科戒。 戒有多种，人亦多品。 上品之人，身先无犯，亦无所持。 中品之人，心有上下，观境即变，以戒自制，不令放逸。 如此之人，或受十戒、五戒，以自防护。 下品之人，恶心万般，难可禁制。 下品之中，复有二品：上品者，身欲奉戒，或受一百九十九戒，或受观身三百大戒，或受千二百威仪之戒，以自防保，令无越逸。 下品者，身同禽兽，虽有人形，而无人心，纵受其戒，终无所益。 今且受第二中戒，十种科禁。 入道初门，诸人闻说，欢喜抃蹈，悉皆俯伏而奉戒言。 天尊告曰： 第一戒者，不得违戾父母、师长，反逆不孝。 第二戒者，不得杀生屠害，割截物命。 第三戒者，不得叛逆君王，谋害家国。 第四戒者，不得淫乱骨肉，姑姨姊妹及他妇女。 第五戒者，不得毁谤道法，轻泄经文。 第六戒者，不得污漫静坛，单衣裸露。 第七戒者，不得欺凌孤贫，夺人财物。 第八戒者，不得裸露三光，厌弃老病。 第九戒者，不得耽酒任性，两舌恶口。 第十戒者，不得凶豪，自任自作威利。 右此十戒当终身奉持。 大戒上品并序 《上品经》云：太极仙公於天台山静斋念道，稽首礼拜，请问太极法师徐来勒曰：弟子有幸，得侍对天尊，自闻微言，弥纶万劫，洞观道源，过泰之欢，莫有谕也。 顾玄少好神仙，白日飞腾之道，必想上圣，恒以髻鬣，大经微远，妙赜难通，将禀口诀，释我冥津，洞畅虚漠，有无都尽矣。 近而未究人生宿世因缘，本行之由，今愿天尊觉所未悟。 是时太上玄高真人啸味步虚洞章，欢然含豫辉金颜而言曰：子以累劫念道，致太极玉名，寄慧人中，将独步玉京，超逸三界，巍巍乎太上仙公之任矣，故慈心於天人，念度於后学也。 常以外身济物，有德而弗名，玄都所诠，谅不虚矣。 而谓大极真人曰：卿受太上虚皇道君之教，为其师保，亦必尽教以高上大洞之渊赜也，岂俟彼多陈乎！ 吾受任忝为都教之法师，至於执卷由子矣。 太极真人答曰：此童真之人，名刊金简，才质清远景秀，太上玄微洞虚，故当为仙公之任，弘道大度者也。 吾忝受教化，愧不足为彼宗匠。 太上有命，何敢不倾报哉！",
      "translated_text": "**The Supreme Scripture of Precepts**\n\n**Scripture Title:** *The Supreme Scripture of Precepts*. Author unknown, approximately composed during the Northern and Southern Dynasties. A compilation of six precept texts from the Shangqing, Lingbao, and Celestial Master traditions. One fascicle. Base text from *Zhengtong Daoist Canon*, Dongshen Section, Precepts Category. Collated with *Seven Lots from the Cloudy Satchel*, fascicle 38.\n\n### **The Ten Precepts**\n\nThe *Origin Chapter of the Jade Purity Scripture* states: The Dao spoke, saying that in ancient times, the Primordial Celestial Worthy, together with countless sages and holy ones, traversed myriad realms. Finally, descending to observe the world of Abandoned Worthies, there was a king named Upright Virtue, sharp of root and discerning of wisdom, who served as a guide for all beings. He proclaimed throughout his kingdom to all ministers, subjects, men, and women: \"Now we have attained great peace, the realm is at rest, fires and disasters have ceased, weapons are stilled, and the hundred grains ripen—all by the grace of the Dao, not by nature alone. How shall we repay this boundless kindness? Only by wholeheartedly revering and serving, erecting palaces and oratories, offering incense, flowers, lamps, and candles, performing morning and evening rites, observing fasts, and repenting transgressions to seek blessings and protection.\"\n\nThereupon, the Celestial Worthy commanded the Immortal of Vast Spirit to address the king: \"You are the ruler of a nation, esteemed by all under heaven, the noblest in the mortal realm. Yet if you govern with upright Dharma and do not oppress the people, this alone suffices to move heaven with merit—why seek esoteric mysteries? The Way of esoteric mysteries is difficult to attain at once, but its threshold lies in nothing other than compassion. The method of compassion does not transgress the precepts and prohibitions. Precepts vary in kind, as do people in their capacities.\n\nThe highest grade of persons commit no transgressions in body and thus have no need to uphold precepts. The middle grade of persons waver in mind, shifting with circumstances; they restrain themselves with precepts to prevent dissipation. Such persons may receive the Ten Precepts or the Five Precepts for self-protection. The lowest grade of persons harbor myriad evil intentions, difficult to restrain. Among them, there are two further grades: the higher of these, though desiring to uphold precepts, may receive the One Hundred Ninety-Nine Precepts, the Three Hundred Great Precepts of Observing the Body, or the One Thousand Two Hundred Precepts of Dignified Conduct to guard themselves and prevent transgressions. The lowest of these are like beasts in body, possessing human form but lacking human hearts. Even if they receive precepts, it will be of no benefit.\n\nNow, receive the second, middle-grade precepts: ten prohibitions. At the gateway to the Dao, all who heard this teaching rejoiced, clapping and prostrating themselves to receive the precepts.\n\nThe Celestial Worthy declared:\n\n1. **First Precept:** Do not defy or disobey parents or teachers; do not commit rebellion or filial impiety.\n2. **Second Precept:** Do not kill or slaughter beings, nor sever the lives of creatures.\n3. **Third Precept:** Do not betray the sovereign or plot harm against family and state.\n4. **Fourth Precept:** Do not commit incest with kin, aunts, sisters, or other women.\n5. **Fifth Precept:** Do not slander the Dao and its teachings or recklessly divulge scriptures.\n6. **Sixth Precept:** Do not defile pure altars or expose the body while wearing single garments.\n7. **Seventh Precept:** Do not bully the orphaned and poor or seize others’ property.\n8. **Eighth Precept:** Do not expose the Three Luminaries (sun, moon, stars) or despise the aged and infirm.\n9. **Ninth Precept:** Do not indulge in wine or follow reckless impulses, nor engage in double-tongued or malicious speech.\n10. **Tenth Precept:** Do not act with violence or arrogance, nor presume authority and power for oneself.\n\nThese Ten Precepts are to be upheld throughout one’s life.\n\n### **The Great Precepts of the Highest Grade, with Preface**\n\nThe *Scripture of the Highest Grade* states: The Supreme Perfected of the Great Ultimate, while in secluded cultivation on Mount Tiantai, bowed his head in reverence and inquired of the Great Ultimate Dharma Master Xu Laile: \"Your disciple is fortunate to attend the Celestial Worthy and, since hearing these subtle words, has encompassed kalpas without end, penetrating the source of the Dao. The joy of surpassing abundance cannot be expressed. I have long cherished the divine immortals and the Way of ascending in broad daylight, ever yearning for the highest sages. Yet the great scriptures are profound and distant, their mysteries difficult to fathom. I wish to receive oral instructions to dispel my dark ignorance, thoroughly illuminating the empty and vast, where being and non-being are entirely exhausted.\n\nRecently, I have not yet fully understood the karmic causes of past lives or the origins of one’s original conduct. Now, I beseech the Celestial Worthy to enlighten what I have not yet awakened to.\"\n\nAt that time, the Supreme Mysterious and Lofty Perfected, chanting the *Void-Penetrating Hymn* and pacing the void, joyfully radiant, spoke with a countenance like golden splendor: \"You, through kalpas of devotion to the Dao, have attained the jade name of the Great Ultimate, dwelling among the wise. You shall ascend alone to the Jade Capital, transcending the Three Realms—how majestic is the task of the Supreme Perfected! Thus, you extend compassion to heaven and humanity, mindful of guiding later learners. Constantly using your own body to aid others, you possess virtue yet do not claim it. What is expounded in the Mysterious Metropolis is surely not in vain.\"\n\nThen he addressed the Great Ultimate Perfected: \"You have received the teachings of the Supreme Void Sovereign Dao Lord and serve as his preceptor. You must fully impart the profound and abstruse mysteries of the Highest Great Cavern—why wait for further elaboration? I, unworthy, have been entrusted as the Dharma Master of the Teaching Assembly, and the handling of the scriptures now rests with you.\"\n\nThe Great Ultimate Perfected replied: \"This youthful perfected one, whose name is inscribed on the golden tablets, possesses a nature pure and distant, his spirit luminous and refined. The Supreme Mysterious and Subtle Void-Penetrating [Dao] has destined him for the role of Supreme Perfected, a great propagator of the Dao. Though I, unworthy, have received the mandate to teach, I am ashamed to be his master. Yet since the Supreme One has commanded, how dare I not fully respond?\"",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 1182,
      "start_sentence": 0,
      "end_sentence": 46,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 33.90533995628357,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\太上戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "众妙之统，仰赖於法师矣。 太极真人又曰：夫道，无也。 弥纶无穷，子欲寻之，近在我身，乃复有也，因有以入无，积念以得妙。 万物芸芸，譬於幻耳，皆当归空，人身亦然。 身死神逝，喻之如屋，屋坏则人不立，身败则神不居。 当制念以定志，静身以安神，宝气以存精，思虑兼忘，冥想内视，则身神并一，身神并一，近为真身也。 此实由宿世本行，积念累感，功济一切，德应万物。 因绿轮转，罪福相对，生死相灭，贵贱相使，贤愚相倾，贫富相欺，善恶相显，其苦无量，皆人行愿所得也，非道、非天、非地、非人，万物所为矣，正由心耳。 此对既锺，亦难脱也。 弱丧之徒，信道者少，宿命者多。 不积善定念，修德理身，而欲忽德忘身，强求外物，其可得哉！ 既已不克，莫不伤身矣。 故有道之士，取诸我身，无求乎人。 道言修身，其德乃真，斯之谓也。 夫学道不受大智慧道行本愿上品大戒，无绿上仙也。 子有宿命，是以见此经。 其文隐秘，立信效心，然后而传，不可妄示，不信必发异念，异念既生，彼此获罪，是故藏之於无待，有应为仙王者，乃告焉。 是时云龙踊跃，诸天散华，飞香奏烟，山海静波，触类窜默，鬼魅消亡，神魔降伏，五苦俱解，长离地狱，恶者返善，信顺受福尔。 乃命太极侍经仙人刘文静，披云辊而授经也。 太极真人曰：宿世礼奉经师，口诵身行，布施厄困，愿乐三宝，君亲忠孝，远纂山水，柄憩贤儒，虚心有道，烧香散华，护度一切，修道补过，信顺宿命，静思忍情。 其行也，上可升仙度世，下可输转富贵，生为人尊，容貌伟秀，才智清远，为人之道，莫不具足。 夫居世富贵，笑於贫贱，今报以贫贱。 居世好杀，今报以伤杀。 居世轻易笑於丑陋，今报以丑陋。 居世聪明不教於人，今报以顽塞。 居世常康笑於困病，今报以滞疾。 居世不信通，笑於经教，今报以下愚，长与道隔。 女人居世，夺人婿者，今报以少寡。 男子居世，诱人妇女，今报以鳏独。 居世发心为夫妻，而后世不得俱生人道，死为鬼魅，今报以本念，成於邪病。 自非大法，莫有解其宿缠而消此邪病矣。 夫为父母、兄弟、姊妹、夫妻、君臣、师保、朋友，皆先世所念愿，为因绿展转相生，莫不有对者哉，故曰倚伏难穷矣！ 唯学仙道士，当兼忘因绿，绝灭生死，同归乎玄，以入妙门。 能知是者，始可与言学道之本也。 若见居家妻子，当愿一切早出爱欲，摄意奉戒。 若见饮酒，当愿一切制於命门，以远祸乱。 若见彩女，当愿一切守情忍色，志慕贤贞。 若见淫人，当愿一切除弃邪念，翘心禁戒。 若见妇人，当愿一切忍割浮华，乐道自娱。 若见贞人，当愿一切履信正化，日入法门。 若见众人，当愿一切推仁无争，怀道安世。 若见善人，当愿一切时刻存念，仰轨其道。 若见恶人，当愿一切弃凶即吉，不犯王法。 若见贫人，当愿一切损身施惠，后受大福。 若见富人，当愿一切救济万物，世世受禄。 若见贵人，当愿一切承其教旨，悉令典训。 若见贱人，当愿一切勤修匪懈，各得所为。 若见帝王，当愿一切奉仰王道，孝如父母。 若见主相，当愿一切受其教制，四方归仁。 若见兵甲，当愿一切各念仁心，天下让贤。",
      "translated_text": "The governance of all mysteries now depends upon you, Dharma Master.\n\nThe Great Ultimate Perfected further said: \"The Dao is Non-Being. It pervades the boundless, yet should you seek it, it lies near within your own body—thus it is also Being. Through Being one enters Non-Being; through accumulated thought one attains the wondrous. The myriad things, teeming like illusions, must all return to emptiness, and the human body is no exception. When the body dies, the spirit departs—compare it to a house: when the house collapses, the person cannot stand; when the body decays, the spirit cannot dwell. One must restrain thoughts to stabilize the will, calm the body to settle the spirit, treasure qi to preserve essence, and forget both deliberation and care. Through inner vision in profound meditation, body and spirit become one. When body and spirit become one, one approaches the true body. This truly arises from the fundamental conduct of past lives, from accumulated thought and repeated resonance, from merit that aids all beings, and from virtue that responds to the myriad things.\n\nYet through the turning of karmic conditions, sin and blessing stand in opposition, life and death alternate, noble and base employ one another, worthy and foolish vie, poor and rich deceive, good and evil manifest—suffering is measureless. All these are the results of one’s own actions and vows, not of the Dao, nor of heaven, nor of earth, nor of other people, but of the myriad things themselves. It is precisely the heart that brings them forth. Once such karmic oppositions are forged, they are difficult to escape. Among the weak and lost, few believe in the Dao; most are bound by past karma. Without accumulating goodness and stabilizing thought, without cultivating virtue and ordering the body, one who would rashly abandon virtue and forget the body, forcibly seeking external things—how could such a one succeed? Having already failed, none escape harm to the body.\n\nThus the man of the Dao draws from his own being and seeks nothing from others. The Dao speaks of cultivating the body so that one’s virtue becomes true—this is what it means. One who studies the Dao yet does not receive the Great Wisdom, the Primordial Vow, and the Upper Grade Precepts of the Dao Conduct will have no cause to ascend as an Upper Immortal. You possess past-life karmic affinity, which is why you behold this scripture. Its words are recondite and esoteric; first establish faith and verify the heart, then transmit it. Do not recklessly display it. Those who disbelieve will generate aberrant thoughts, and once such thoughts arise, both parties incur transgression. Therefore, conceal it in the realm of the Unconditioned. Only when one is destined to become a Perfected King of Immortals should it be revealed.\"\n\nAt that moment, clouds and dragons leapt and danced, the heavens scattered blossoms, flying incense and curling smoke filled the air, mountains and seas stilled their waves, all creatures fell silent, ghosts and demons vanished, spirits and demons submitted, the Five Sufferings were all dissolved, and those long bound in hell were forever freed. The wicked turned to goodness, and the faithful and obedient received blessings. Then the Great Ultimate commanded the Scripture-Attending Immortal Liu Wenzheng to unroll the cloud-scroll and bestow the scripture.\n\nThe Great Ultimate Perfected said: \"In past lives, one reverently served scripture masters, recited with the mouth and practiced with the body, gave alms to those in distress, took joy in the Three Treasures, was loyal to ruler and filial to parents, retreated to mountains and rivers, lodged with the worthy and learned, maintained an empty heart and followed the Dao, burned incense and scattered blossoms, protected and delivered all beings, cultivated the Dao and amended faults, believed in and submitted to past karma, and calmly contemplated while restraining the passions. Such conduct, in its highest expression, can ascend as an immortal and deliver the world; in its lowest, it can bring about wealth and nobility, birth as a person of honor, a majestic and refined appearance, and a nature of clear and distant wisdom. In the Way of being human, nothing will be lacking.\n\nThose who in the world enjoyed wealth and nobility while mocking the poor and lowly are now repaid with poverty and lowliness. Those who in the world delighted in killing are now repaid with injury and death. Those who in the world treated others with contempt and mocked the ugly are now repaid with ugliness. Those who in the world were clever yet did not teach others are now repaid with dullness and obstruction. Those who in the world were always healthy and mocked the sick and afflicted are now repaid with chronic illness. Those who in the world did not believe in spiritual communication and mocked the scriptures and teachings are now repaid with utter stupidity, forever cut off from the Dao.\n\nWomen who in the world stole others’ husbands are now repaid with early widowhood. Men who in the world seduced others’ wives are now repaid with lifelong solitude. Those who in the world pledged their hearts to become husband and wife yet in later lives do not both attain human birth, dying as ghosts and demons, are now repaid according to their original intentions, falling into perverse illnesses. Without the Great Dharma, none can untangle their karmic bonds and dispel these perverse illnesses.\n\nFor parents, siblings, sisters, husbands and wives, rulers and ministers, teachers and guardians, friends—all are bound by the vows and thoughts of past lives, arising through karmic conditions in endless cycles. Is there none who does not have such karmic oppositions? Thus it is said: 'Dependence and latency are inexhaustible.' Only the student of the Dao of Immortality should utterly forget karmic conditions, extinguish life and death, and together return to the Mysterious, entering the wondrous gate. One who knows this may begin to speak of the foundation of studying the Dao.\n\nWhen you see those with families and children, wish that all may swiftly transcend love and desire, gathering their minds to uphold the precepts. When you see those drinking wine, wish that all may restrain themselves at the Gate of Life, avoiding calamity and disorder. When you see beauties, wish that all may guard their passions and endure desire, aspiring to worthy chastity. When you see the licentious, wish that all may cast aside impure thoughts, lifting their hearts to strict observance. When you see women, wish that all may endure the severing of frivolous adornments, delighting in the Dao and finding joy in themselves. When you see the chaste, wish that all may tread the path of faith and right transformation, daily entering the Dharma gate. When you see multitudes, wish that all may extend benevolence without contention, embracing the Dao and bringing peace to the world. When you see the good, wish that all may at every moment hold to mindfulness, looking up to follow their Way. When you see the wicked, wish that all may abandon evil and turn to good, not transgressing the laws of the king. When you see the poor, wish that all may diminish their own bodies to bestow kindness, later receiving great blessings. When you see the rich, wish that all may save and aid the myriad things, receiving emoluments for generations. When you see the noble, wish that all may receive their teachings and decrees, all becoming models of instruction. When you see the lowly, wish that all may diligently cultivate without negligence, each attaining their aspirations. When you see the emperor, wish that all may revere and look up to the kingly Way, being as filial as to parents. When you see ministers and chancellors, wish that all may receive their teachings and governance, so that the four directions return to benevolence. When you see soldiers and armor, wish that all may each hold to a heart of benevolence, and the world yield to the worthy.\"",
      "overlap_context": "ests with you.\"\n\nThe Great Ultimate Perfected replied: \"This youthful perfected one, whose name is inscribed on the golden tablets, possesses a nature pure and distant, his spirit luminous and refined. The Supreme Mysterious and Subtle Void-Penetrating [Dao] has destined him for the role of Supreme Perfected, a great propagator of the Dao. Though I, unworthy, have received the mandate to teach, I am ashamed to be his master. Yet since the Supreme One has commanded, how dare I not fully respond?\"",
      "start_char": 1182,
      "end_char": 2436,
      "start_sentence": 47,
      "end_sentence": 96,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 35.41525745391846,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\太上戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "若见王子，当愿一切日歌太平，系国承家。 若见贤人，当愿一切履行其德，道为世宗。 若见法师，当愿一切明解法度，得道无为。 若见栖山道士，当愿一切悉见法门，速得升仙。 若见教化，当愿一切亲受圣教，皆为渊博。 若见圣人，当愿一切尊礼侍见，诸国并瞻。 若见仙人，当愿一切真道悉成，飞升天堂。 若见城郭，当愿一切严整修饰，以道为基。 若见大国，当愿一切归宗慕德，若水注海。 若见小国，当愿一切知止虚冲，安其所居。 若见市朝，当愿一切群贤云萃，悉弘正道。 若见静观，当愿一切功德巍巍，天人得道。 若见斋戒行香，当愿一切道德日新，庠序雅正。 若见诵经，当愿一切尽上高座，咸闻圣音。 若见经教，当愿一切各各受读礼习，普行教化。 若见楼观，当愿一切洞观十方，无所隐藏。 若见高山，当愿一切智思无量，辅成家国。 若见柄憩茂林，当愿一切安居自在，应庇含识。 若见好学，当愿一切得成师宗，养徒敷教。 若见净手，当愿一切常执经书，无时暂辍。 若见善口，当愿一切耽味洞经，日新不厌。 若见动足，当愿一切超步三界，飞行上清。 若见静止，当愿一切灭景停真，安闲空寂。 若见饮食，当愿一切弃累入净，存得道味。 若见大藏，当愿一切除其灾害，施为福田。 若见疾病，当愿一切以道自安，免此苦厄。 若见死丧，当愿一切学道常存，济度三徒。 若见畋猎，当愿一切不为始终，入为无罪。 若见夷狄，当愿一切得生中国，不生边地。 若见少年，当愿一切及时学问，遂成学名。 若见老病，当愿一切以道摄生，不更衰老。 若见三光，当愿一切普明灵曜，间冥即消。 若见云雨，当愿一切惠泽盈溢，无所不宜。 若见素雪，当愿一切常居洁白，逍遥自在。 若见灵风，当愿一切韫怀披散，德流遐迩。 若见争水，当愿一切洗垢清虚，平等其心。 若见名香，当愿一切受慈芳今，众秽肃然。 若见好华，当愿一切乐散诸圣，相好具足。 若见车马，当愿一切得道无为，乘凤驾龙。 若见弦歌，当愿一切骯经叹法，以道娱乐。 若见福食，当愿一切无不饱满，世享天厨，德流后人，如水归海，宗庙禀长，常居贵盛，世与四辈，俱生王家。 若见散施，当愿一切祸灭九阴，福起十方，德如山海，莫不兴隆，七祖生天，子孙贤忠，富贵巍巍，所欲皆从，学道飞仙，驾云乘龙。 道士坐卧，常愿我等，四大合德，同体道真，长存玄都，师友自然，济度十方，天下受恩，逍遥无为，洞观妙门。 礼经祝三首 真人口诀云：侍经仙童玉女，闻此祝皆欢喜而佑兆身也。 是大经悉用此祝而礼拜矣。 若冥心礼经者，亦心祝其文，乃上仙之秘祝也。 第一首 乐法以为妻，爱经如珠玉。 持戒制六情，念道遣所欲。 淡泊正气停，萧然神静嘿。 天魔并敬护，世世受大福。 第二首 郁郁家国盛，济济经道兴。 天人同其愿，缥缈入大乘。 因心立福田，靡靡法输升。 七祖生天堂，我身白日腾。 第三首 大道洞玄虚，有念无不契。 炼质入仙真，遂成金刚体。 超度三界难，地狱五苦解。 悉归太上经，静念稽首礼。 太极真人曰：学升仙之道，当立千二百善功，终不受报。 立功三千，白日登天，皆济人应死之难也。 施惠其人尤善矣！ 学道当令众行合法，广建福田，发大慈之心，动静常起道意。",
      "translated_text": "When you see princes, wish that all may daily sing of great peace, sustaining the state and upholding their households. When you see the worthy, wish that all may practice their virtue, the Dao/Way becoming the model for the world. When you see Dharma masters, wish that all may clearly understand the Dharma and precepts, attaining the Dao/Way in non-action. When you see Daoist recluses in the mountains, wish that all may fully perceive the Dharma gates, swiftly ascending as immortals. When you see teachings and transformations, wish that all may personally receive the sagely teachings, all becoming profound and erudite. When you see sages, wish that all may revere, serve, and behold them, every kingdom gazing upon them. When you see immortals, wish that all may perfect the true Dao/Way, ascending to heaven on high.\n\nWhen you see city walls, wish that all may be strictly ordered and adorned, with the Dao/Way as their foundation. When you see great states, wish that all may return to the ancestral and admire virtue, like waters flowing to the sea. When you see small states, wish that all may know restraint and emptiness, content in their abodes. When you see markets and courts, wish that all the multitudes of worthies may gather like clouds, all propagating the true Dao/Way. When you see quiet contemplation, wish that all may accumulate towering merit and virtue, celestial and human attaining the Dao/Way. When you see fasting, precepts, and incense offerings, wish that all may daily renew their virtue and power, with schools and academies refined and upright.\n\nWhen you see sutra recitation, wish that all may ascend to the high seat, universally hearing the sagely voice. When you see scriptural teachings, wish that all may each receive, read, venerate, and practice them, universally propagating transformation. When you see towers and observatories, wish that all may penetrate and observe the ten directions, with nothing concealed. When you see lofty mountains, wish that all may possess boundless wisdom and thought, aiding in the completion of families and states. When you see resting beneath flourishing trees, wish that all may dwell in peace and ease, sheltering all sentient beings.\n\nWhen you see the diligent in study, wish that all may become masters and models, nurturing disciples and disseminating teachings. When you see clean hands, wish that all may constantly hold scriptures, never ceasing for a moment. When you see eloquent speech, wish that all may delight in savoring the profound sutras, daily renewed without weariness. When you see moving feet, wish that all may transcend the Three Realms in a single step, soaring to the Upper Clarity. When you see stillness, wish that all may extinguish their shadows and halt their essence, abiding in tranquil emptiness.\n\nWhen you see food and drink, wish that all may cast off burdens and enter purity, preserving the flavor of the Dao/Way. When you see great storehouses, wish that all may eliminate calamities and disasters, becoming fields of blessing. When you see illness, wish that all may stabilize themselves with the Dao/Way, escaping this suffering and peril. When you see death and mourning, wish that all may study the Dao/Way and abide eternally, delivering the three kinds of disciples.\n\nWhen you see hunting, wish that all may never begin nor end it, entering without transgression. When you see barbarians, wish that all may be born in the Central Kingdom, not in borderlands. When you see the young, wish that all may study diligently in their time, ultimately achieving scholarly renown. When you see the aged and infirm, wish that all may nurture life with the Dao/Way, never again declining or aging.\n\nWhen you see the Three Luminaries, wish that all may universally illuminate with numinous radiance, dispelling darkness instantly. When you see clouds and rain, wish that all may overflow with beneficent moisture, suiting every need. When you see pristine snow, wish that all may constantly dwell in purity, carefree and at ease. When you see divine winds, wish that all may unfold their hidden treasures, virtue flowing far and near. When you see contending for water, wish that all may wash away filth and attain clarity, equalizing their hearts.\n\nWhen you see fine incense, wish that all may receive its compassionate fragrance, all impurities solemnly stilled. When you see beautiful flowers, wish that all may delight in scattering them before the sages, their marks of excellence complete. When you see carriages and horses, wish that all may attain the Dao/Way in non-action, riding phoenixes and driving dragons. When you see stringed music and song, wish that all may chant sutras and praise the Dharma, delighting in the Dao/Way.\n\nWhen you see blessed meals, wish that all may be universally satiated, enjoying the celestial kitchens of the world, their virtue flowing to posterity like waters returning to the sea, ancestral temples receiving longevity, constantly dwelling in nobility and prosperity, with the four classes of disciples all born in royal houses.\n\nWhen you see almsgiving, wish that all may extinguish the ninefold yin calamities, blessings arising in the ten directions, their virtue like mountains and seas, universally flourishing, seven generations of ancestors ascending to heaven, descendants worthy and loyal, rich and noble beyond measure, all desires fulfilled, studying the Dao/Way and ascending as immortals, riding clouds and driving dragons.\n\nIn the sitting and reclining of Daoists, may we always wish that our four great elements harmonize with virtue, our bodies united with the true Dao/Way, eternally abiding in the Mysterious Capital, with masters and friends naturally present, delivering the ten directions, the world receiving grace, carefree in non-action, penetrating the wondrous gates.\n\n**Three Invocations for Venerating the Scriptures**\n\nThe oral instructions of perfected persons say: When the jade maidens and immortal youths who attend the scriptures hear these invocations, they rejoice and protect the practitioner’s body. All great scriptures employ these invocations in worship. Those who venerate the scriptures in profound contemplation should also silently recite these words—this is the secret invocation of the highest immortals.\n\n**First Invocation**\nDelighting in the Dharma as one’s wife,\nCherishing the scriptures like pearls and jade.\nUpholding precepts to restrain the six emotions,\nContemplating the Dao/Way to dispel desires.\nSerene and unadorned, the upright qi abides,\nDetached, the spirit still and silent.\nHeavenly demons all revere and protect,\nLifetimes of great blessings received.\n\n**Second Invocation**\nFlourishing are families and states,\nProsperous are the scriptures and Dao/Way.\nCelestials and humans share this aspiration,\nSubtly entering the Great Vehicle.\nEstablishing fields of blessing through the mind,\nGradually ascending through the Dharma.\nSeven generations of ancestors born in heaven,\nMy body ascending in broad daylight.\n\n**Third Invocation**\nThe Great Dao/Way pervades the mysterious void,\nWith mindfulness, nothing fails to accord.\nRefining the body to enter the immortal true,\nThus attaining a vajra body.\nTranscending the Three Realms’ difficulties,\nThe five hells’ sufferings dissolved.\nAll return to the Supreme Scriptures,\nIn tranquil contemplation, bowing in reverence.\n\nThe Perfected of the Great Ultimate says: To study the Dao/Way of ascending as immortals, one must establish one thousand two hundred acts of goodness, never receiving retribution. Establishing three thousand acts of merit results in ascending to heaven in broad daylight—all involve delivering people from mortal perils. Bestowing kindness upon others is especially virtuous! In studying the Dao/Way, one should align all actions with the Dharma, broadly establishing fields of blessing, arousing a heart of great compassion, and constantly awakening the intention of the Dao/Way in movement and stillness.",
      "overlap_context": "en you see the lowly, wish that all may diligently cultivate without negligence, each attaining their aspirations. When you see the emperor, wish that all may revere and look up to the kingly Way, being as filial as to parents. When you see ministers and chancellors, wish that all may receive their teachings and governance, so that the four directions return to benevolence. When you see soldiers and armor, wish that all may each hold to a heart of benevolence, and the world yield to the worthy.\"",
      "start_char": 2437,
      "end_char": 3813,
      "start_sentence": 97,
      "end_sentence": 162,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 36.07885217666626,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\太上戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "能如是也，吐纳、服药、佩符，读经精进，终身不倦，岂有不得仙乎？ 人无此德，虽服药、佩符、读经斋戒，故终命而不验矣。 学士明思要言。 太极真人曰：立三百善功，可得长存地仙。 若一功不全，则更从一始，而都失前功矣。 常有其念在於心膂者，则是也。 若导人作善，即为善功也。 太极真人曰：常念啸咏洞经，修行大慈，先人后身，扬善化恶，断绝众绿，灭念守虚，心如太玄，为道是求，始谓能言神仙之道也。 太极真人曰：吾受昔太极智慧十善劝助德戒於高上大道虚皇，世世宗奉修行大法，度人甚易，此自然之福也。 太上以普教天人，令各得本愿，始入法门，长存无为，不受十苦八难罪对，罢散地狱，休息三官，日日宁闭，世世荣乐，咸脱罗网，后生安泰，天性恬然，所愿随其，得戒如上，以传贤信。 十善劝戒曰：劝助礼敬三宝，供养法师，令人世为君子，贤孝高才，荣贵巍巍，生为人尊，门族昌炽。 三宝者，谓道经师也。 能养生，教善行，为人范，是名法师也。 戒曰：劝助治写经书，令人世世聪明，博闻妙迹，恒值圣世，见诸经教，能诵章句。 戒曰：劝助建斋争治，令人世世门户高贵，身登天堂，饮食自然，常居无为。 戒曰：劝助香油众供，令人世世芳盛，香洁光明，容貌绝伟，天姿高秀。 戒曰：劝助法师法服，令人世世闲雅，逍遥中国，不堕边夷，男女端正，冠冕玉佩，称诸身饰。 戒曰：劝助国王父母，子民忠孝，令人世世多嗣，男女贤儒，不受诸苦。 戒曰：劝助斋靖读经，令人世世不堕地狱，即升天堂，礼见众圣，速得返形化生王家，在意所欲，玩好备足，七祖同欢，善绿悉备，终始荣乐道法，转至将得仙道。 戒曰：劝助众人学经，令人世世才智洞达，动静威仪，常为人师。 戒曰：劝助一切布施，谏诤善事，令人世世寿考富乐，常无怨恼。 戒曰：劝助一切民人，除嫉去欲，履行众善，令人世世安乐，祸乱不生，病者自愈，仕官高迁，为众所仰，莫不吉佑，门户清贵，天人爱育，神魔恒护，常生福地。 太极真人曰：人之行恶，莫大於嫉杀、贪奢、骄淫也，若此一在心，伐尔年命矣。 挟之以学神仙者，不亦悲乎！ 太霄琅书十善十恶 十善既行，十恶自息。 息恶行善，大慈德成。 是以上品戒云：恤死度生，救疾治病，施惠穷困，割己济物，奉侍师主，营建静舍，书经校定，修斋念道，退身让义，不争功名，宣化愚俗，谏诤解恶，边道立井，植种果林，教化童蒙，劝人作善，施为可法，动静可观，教制可轨，行常使然。 十善遍行，谓之道士。 不修善功，徒劳山林。 能信斯旨，勤寻诸戒。 戒部甚多，随绿所得，无数诸戒，无央科律，皆辅一神，摄於三业。 三业者，口身心也。 运动造作，善恶无量。 无量善恶，十为恶端：一者妄言。 二者绮语。 三者两舌。 四者骂詈。 此四口恶，返之则善。 五者贪爱。 六者窃盗。 七者奸淫。 此三者，属身。 八者嫉拓。 九者患瞋。 十者邪痴。 此三者，属心。 心业最重，为十恶根。 断绝十恶，修十善本。 实言直语，通和讲诵，谦让舍财，内外贞洁，庆赞惧喜，敬信三尊。 备此十善，十恶永除。 思微定志经十戒 一者不杀，当念众生。 二者不淫，犯人妇女。",
      "translated_text": "If one can thus practice—refining breath through ingestion and exhalation, consuming elixirs, wearing talismans, reciting scriptures with diligence, and never growing weary throughout life—how could one fail to attain immortality? Those devoid of such virtue, though they consume elixirs, wear talismans, recite scriptures, and observe fasts, will ultimately meet their destined end without verification.\n\nScholars, ponder these essential words.\n\nThe Perfected of the Great Ultimate says: Establishing three hundred acts of goodness grants one the attainment of earthbound immortality. Should even one act remain incomplete, one must begin anew, and all prior merit is forfeit. Only when such resolve is steadfast in mind and marrow does it hold true. Guiding others to perform good deeds likewise constitutes virtuous merit.\n\nThe Perfected of the Great Ultimate says: Constantly chanting the *Dongjing* in recitation, cultivating great compassion, placing others before oneself, extolling goodness and transforming evil, severing all karmic entanglements, extinguishing thoughts and guarding emptiness—when the heart mirrors the Supreme Mystery and the Dao/Way is sought therein, only then may one be called capable of discoursing on the path of divine transcendence.\n\nThe Perfected of the Great Ultimate says: I received from the Highest Great Dao of the Primordial Void the *Ten Virtues of Exhortation and Merit* of the Supreme Wisdom of the Great Ultimate, a teaching revered and practiced across lifetimes. Delivering others is effortless—this is the natural blessing of the Dao/Way. The Supreme Venerable One universally instructs heaven and humanity, allowing each to fulfill their original vow, first entering the Dharma gate to abide in non-action, free from the ten sufferings, eight adversities, and karmic retribution. Hell is dissolved, the Three Bureaus pacified, daily tranquility secured, and lifetimes of glory and joy attained. All escape the snares of fate, future rebirths are serene, and the celestial nature remains undisturbed. Desires follow their course, and those who uphold these precepts as above may transmit them to the worthy and faithful.\n\nThe *Ten Exhortations of Virtue* state:\n1. Exhort and assist in revering the Three Treasures, making offerings to Dharma masters, so that in this life one becomes a noble person—virtuous, filial, and of lofty talent, honored and esteemed, respected by all, with a flourishing lineage.\n   The Three Treasures are the Dao, the scriptures, and the masters. Those who nurture life, teach goodness, and serve as models for others are called Dharma masters.\n\n2. Exhort and assist in transcribing scriptures, so that in future lives one becomes wise and learned, with profound insight, ever encountering sagely eras, witnessing all scriptural teachings, and reciting their verses.\n\n3. Exhort and assist in establishing fasts and rituals, so that in future lives one’s family attains high nobility, the body ascends to heaven, sustenance is natural, and one dwells perpetually in non-action.\n\n4. Exhort and assist in offering incense, oil, and various supplies, so that in future lives one’s fragrance endures, purity and radiance abound, and one’s countenance is peerless, with celestial grace and lofty refinement.\n\n5. Exhort and assist in providing Dharma masters with robes, so that in future lives one becomes refined and at ease, dwelling in the Central Kingdom, never falling to borderlands or barbaric realms, with sons and daughters of upright bearing, adorned in crowns, jade pendants, and fitting attire.\n\n6. Exhort and assist kings, parents, and the people in loyalty and filial piety, so that in future lives one has many descendants, sons and daughters of wisdom and virtue, free from all suffering.\n\n7. Exhort and assist in fasting, purification, and scripture recitation, so that in future lives one avoids hell and ascends to heaven, paying homage to all sages, swiftly regaining a transformed body and rebirth in a royal household, with every desire fulfilled, pleasures in abundance, and seven generations of ancestors rejoicing together. All karmic conditions are perfected, and from beginning to end, glory and joy in the Dao/Way persist, ultimately leading to the attainment of immortality.\n\n8. Exhort and assist others in studying scriptures, so that in future lives one’s wisdom and intelligence are penetrating, conduct and demeanor dignified, and one constantly serves as a teacher to others.\n\n9. Exhort and assist in all acts of generosity, admonishing and encouraging good deeds, so that in future lives one enjoys longevity, wealth, and happiness, free from resentment and vexation.\n\n10. Exhort and assist all people in relinquishing jealousy and desire, practicing myriad virtues, so that in future lives one abides in peace and joy, free from calamity and disorder. The sick recover, officials rise in rank, and all look up to one with reverence. Every endeavor is auspicious, the household pure and noble, cherished by heaven and humanity, protected by spirits and demons, and one is forever born in blessed realms.\n\nThe Perfected of the Great Ultimate says: Of all human evils, none surpass jealousy, killing, greed, extravagance, arrogance, and licentiousness. If even one of these resides in the heart, it severs one’s lifespan. To cling to such while seeking divine transcendence—is this not lamentable?\n\nFrom the *Tai Xiao Lang Shu*: When the ten virtues are practiced, the ten evils naturally cease. Ceasing evil and practicing goodness perfects the virtue of great compassion. Thus, the highest precepts state: Relieve the dead and deliver the living, heal the sick and cure diseases, bestow kindness upon the destitute, sacrifice oneself to aid others, serve one’s masters with devotion, construct tranquil abodes, transcribe and collate scriptures, cultivate fasts and recite the Dao/Way, yield to others and relinquish righteousness, avoid contending for merit and fame, enlighten the ignorant, admonish and dissolve evil, dig wells along roadsides, plant orchards and groves, educate the young, exhort others to perform good deeds, ensure one’s conduct is exemplary, movements and stillness are admirable, teachings and systems are sound, and actions are consistently thus. Practicing the ten virtues universally is called a Daoist. Without cultivating virtuous merit, one labors in vain in the mountains and forests. Those who trust these principles should diligently seek all precepts. The precept sections are vast, and one should follow what is accessible. Countless precepts and boundless regulations all assist the singular spirit, governing the three karmas.\n\nThe three karmas are body, mouth, and mind. All actions and creations—good and evil—are measureless. Of the measureless good and evil, ten are the roots of evil:\n1. False speech.\n2. Frivolous speech.\n3. Divisive speech.\n4. Abusive speech.\n   These four are evils of the mouth; reversing them yields goodness.\n5. Covetousness.\n6. Theft.\n7. Licentiousness.\n   These three pertain to the body.\n8. Jealousy.\n9. Resentment.\n10. Delusion.\n   These three pertain to the mind. The karma of the mind is the heaviest, serving as the root of the ten evils. Sever the ten evils and cultivate the roots of the ten virtues: speak truthfully and directly, communicate harmoniously, recite with clarity, yield and relinquish wealth, maintain inner and outer chastity, rejoice in praise, fear and delight in reverence, and honor the Three Honored Ones. With these ten virtues complete, the ten evils are forever eradicated.\n\nFrom the *Sutra on Stabilizing the Mind and Resolving Will*, the Ten Precepts:\n1. Do not kill; contemplate the lives of all beings.\n2. Do not commit adultery or violate the wives of others.",
      "overlap_context": "h one thousand two hundred acts of goodness, never receiving retribution. Establishing three thousand acts of merit results in ascending to heaven in broad daylight—all involve delivering people from mortal perils. Bestowing kindness upon others is especially virtuous! In studying the Dao/Way, one should align all actions with the Dharma, broadly establishing fields of blessing, arousing a heart of great compassion, and constantly awakening the intention of the Dao/Way in movement and stillness.",
      "start_char": 3813,
      "end_char": 5070,
      "start_sentence": 163,
      "end_sentence": 216,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.056912422180176,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\太上戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "三者不盗，取非义财。 四者不欺，善恶反论。 五者不醉，常思净行。 六者宗亲和睦，无有非亲。 七者见人善事，心助欢喜。 八者见人有忧，助为作福。 九者彼来加我，志在不报。 十者一切未得道，我有不望。 经云：时有十二年少，处世间乐，日日相就，共作好食，酣饮嬉戏，或复论议持戒之难易。 天尊以道眼，遥见此人前世曾为人师，而秘吝经典，逮诸弟子，於道之心亦复犹豫，因此微绿，犹可度耳。 於是天尊化作凡人，从会中过，托之乞食，因悉共语诸年少辈，复论如初。 中一人曰：我数随兄至安乐山，见诸道士，悉持十戒，肃肃甚佳，洎至於死，魂神所在，亦当不虚。 但其十戒，人持难悉从耳。 化人曰：持此甚易，违此甚难。 诸人问化人曰：云何持戒则易，不持返难？ 化人曰：立身如戒，上不畏天子，亦不畏鬼神，何谓之难？ 违戒之者，悉畏之是难也。 其中一人曰：余戒可持，惟酒难断，所以者何？ 我先服散，散者发之日，非酒不解，是故难耳。 化人曰：散发所须，此乃是药，将养四大，药通可通，但勿过量耳。 一人曰：余事即可，妄语其难，所以者何？ 若有密事，在尊长前，应为隐讳，而人见问不得欺，欺即犯戒，是故为难。 化人曰：事有隐讳，而人见问不得欺，欺即犯戒，是故为难。 化人曰：事有隐讳，理有方便，此亦可通，但勿善恶返论，说其长短耳。 一人曰：余戒即可，唯盗戒难，小小之间，以挂犯目。 化人曰：大事实难，小小之间，益可慎之。 而说愒曰： 何不受盗戒，不受盗亦难。 孰云暗昧中，中有记盗官。 取一年年倍，倍倍殊不宽。 以手捧镕铜，烧口煮心肝。 一朝言此苦，终年犹心酸。 何不受此戒，保持必令完。 我信彼亦信，在在无不安。 安坐招灵人，永享长年欢。 一人曰：余戒悉易，淫最难断。 所以尔者，我曾履斯事，数随兄中食，当中食时，自云一日精进，无不过理，亦谓身后当得此斋戒之福。 至是夕夜，是我所愍，辄来狡脍，虽苦加抑迮，不觉已尔，每每如此，是知最难。 化人日：色者是想尔，想悉是空，何有色耶？ 但先自观身，知身无寄，便知无色，何可不忍？ 且淫欲颇恣，如饮咸水，饮多渴多，唯死而已，何有厌足？ 而说偈曰： 色欲剧於渴，小忍差何度，何为进咸水，水咸益渴故。 子能善解渴，当饮天甘露，甘露香且熏，通体皆流布。 天人寻香降，玄趣自然悟，熙熙永无为，长保九天祚。 一人曰：余悉可从，唯煞难戒，所以者何？ 我好啖鸡，一食无鸡，了自无味，数日便瘦。 化人曰：贤者，肥为人患，瘦即体轻，用肥何为？ 即说偈曰： 贤贤戒其煞，亦无怀煞想，众生虽微微，亦悉乐生长。 如何害彼命，而用以自养？ 自养今一时，累汝自然爽，长沦三涂中，辛苦还复往。 善恶各有绿，譬如呼有响。 何不改此行，慈心以自奖？ 真人携手游，逍遥云景上。 说此偈已，化人见大威，变极道之姿，侍从僚属，钧天大乐，非可目名，返於上方。 诸人悉见，喜惧交集，并闻要说，意解开悟，俱登道果。 妙林经二十七戒 元始天尊告诸四众：一切众生，贪着有为，欣生恶死，意虽求生，由造死业，不持戒行，假使长寿，犹如老树，有何殊别？ 若持戒行，死补天官，升仙自在。",
      "translated_text": "3. Do not steal; take no wealth that is not rightfully yours.\n4. Do not deceive; do not reverse discussions of good and evil.\n5. Do not become intoxicated; constantly contemplate pure conduct.\n6. Maintain harmony among clan and kin, with no distinction between close and distant.\n7. Upon seeing others do good deeds, rejoice in your heart and assist them.\n8. Upon seeing others in distress, aid them in performing meritorious acts.\n9. When others harm you, resolve not to seek repayment.\n10. For all who have not yet attained the Dao, do not hold expectations toward them.\n\nThe sutra states: There were once twelve youths in the world who delighted in pleasure. Daily, they gathered together to prepare fine food, drinking to intoxication and playing games, or else discussing the difficulty of upholding the precepts. The Heavenly Worthy, with the Dao-eye, saw from afar that in their past lives they had been teachers who, though hoarding scriptures and instructing disciples, remained hesitant in their commitment to the Dao. For this slight reason, they were still salvageable. Thus, the Heavenly Worthy transformed into an ordinary person and passed through their gathering, pretending to beg for food. Engaging them in conversation, he resumed the earlier discussion.\n\nOne of them said: “I have often followed my elder brother to Mount Anle, where I saw many Daoists strictly observing the Ten Precepts. Their demeanor was most solemn and admirable. Even at death, their souls and spirits would not be in vain. Yet, though the Ten Precepts exist, it is difficult for people to fully uphold them.”\n\nThe transformed one replied: “Upholding them is quite easy; violating them is exceedingly difficult.”\n\nThe youths asked: “How is upholding the precepts easy, while not upholding them is difficult?”\n\nThe transformed one said: “To establish oneself in accordance with the precepts is to fear neither the Son of Heaven nor ghosts and spirits—how can this be called difficult? Those who violate the precepts fear all things—this is truly difficult.”\n\nOne of them said: “I could uphold the other precepts, but abstaining from alcohol is hard. Why? I previously took elixir powders, and on the day their effects manifest, only wine can relieve them. That is why it is difficult.”\n\nThe transformed one said: “The effects of elixir powders require this—it is medicine. To nurture the four great elements, medicine may be taken, but do not exceed the proper measure.”\n\nAnother said: “I could manage other matters, but false speech is difficult. Why? If there is a private matter before one’s elders, it should be concealed out of respect. Yet if questioned, one cannot lie, for lying violates the precepts. This is why it is difficult.”\n\nThe transformed one said: “There are matters that should be concealed, and principles that allow for flexibility. This too can be managed, but do not reverse discussions of good and evil or speak of others’ faults.”\n\nAnother said: “I could uphold the other precepts, but the prohibition against theft is difficult. Even in minor matters, one may inadvertently transgress.”\n\nThe transformed one said: “Great theft is indeed difficult, but even in minor matters, one must be cautious.” Then he spoke a verse:\n\n*Why not receive the precept against theft?*\n*Not receiving it is also difficult.*\n*Who says in darkness there is no record?*\n*There stands the official who records theft.*\n*Take one, and it doubles year by year,*\n*Each doubling brings no leniency.*\n*With hands you hold molten bronze,*\n*Burning your mouth, scorching heart and liver.*\n*Once you speak of this suffering,*\n*For years your heart will still ache.*\n*Why not receive this precept,*\n*And preserve it whole and complete?*\n*I trust, and so do they,*\n*Everywhere, all is secure.*\n*Sit in peace and summon the immortal,*\n*Forever enjoying boundless joy.*\n\nAnother said: “I could uphold the other precepts, but abstaining from licentiousness is most difficult. Why? I have experienced this myself. Often, when dining with my elder brother, he would say during the meal that he was practicing strict asceticism, never transgressing reason, and that after death, he would gain the blessings of these precepts and fasts. Yet that very night, the object of my desire would come, cunning and enticing. Though I struggled to restrain myself, I would unknowingly succumb. This happened repeatedly—thus I know it is most difficult.”\n\nThe transformed one said: “Desire is but a delusion; all delusions are empty. Where is there true desire? First observe your own body and know that it has no abiding place. Then you will understand there is no desire—how can you not endure? Moreover, indulgence in lust is like drinking saltwater: the more you drink, the thirstier you become, until only death remains. Where is there satisfaction?” Then he spoke a verse:\n\n*Desire is more severe than thirst.*\n*With a little restraint, how can you not cross over?*\n*Why drink saltwater,*\n*Which only increases thirst?*\n*If you can truly quench thirst,*\n*Drink the sweet dew of heaven.*\n*Sweet dew is fragrant and rich,*\n*Flowing through your entire body.*\n*Heavenly beings follow the scent and descend,*\n*And you will naturally awaken to the profound.*\n*Joyful and free, forever without striving,*\n*You will long preserve the blessings of the Nine Heavens.*\n\nAnother said: “I could uphold the rest, but abstaining from killing is difficult. Why? I enjoy eating chicken. A meal without chicken is utterly tasteless, and after several days, I grow thin.”\n\nThe transformed one said: “Wise one, fatness is a burden to the body, while thinness lightens it. What use is fatness?” Then he spoke a verse:\n\n*Wise one, abstain from killing,*\n*And harbor no thought of killing.*\n*Though beings are small,*\n*All delight in living and growing.*\n*How can you harm their lives*\n*To nourish yourself?*\n*This nourishment lasts but a moment,*\n*Yet it burdens you with natural clarity.*\n*You will long sink in the Three Realms,*\n*Enduring suffering again and again.*\n*Good and evil each have their causes,*\n*Like an echo following a call.*\n*Why not change this conduct*\n*And reward yourself with a compassionate heart?*\n*True persons will take your hand*\n*And wander carefree above the clouds.*\n\nAfter speaking this verse, the transformed one revealed his majestic form, assuming the full appearance of the Dao. His attendants and retinue, the grand music of the heavens—indescribable to the eye—returned to the upper realms. The youths all witnessed this, their joy and awe mingling. Having heard the essential teachings, their minds opened in awakening, and together they ascended to the fruition of the Dao.\n\nFrom the *Sutra of the Wondrous Grove*, the Twenty-Seven Precepts:\nThe Primordial Heavenly Worthy addressed the four assemblies: “All sentient beings cling to conditioned existence, rejoicing in life and fearing death. Though they seek life, they create the karma of death. Not upholding the precepts, even if they live long, they are like old trees—what difference is there? If they uphold the precepts, at death they will fill the heavenly offices and ascend as immortals, free and at ease.”",
      "overlap_context": "ten virtues: speak truthfully and directly, communicate harmoniously, recite with clarity, yield and relinquish wealth, maintain inner and outer chastity, rejoice in praise, fear and delight in reverence, and honor the Three Honored Ones. With these ten virtues complete, the ten evils are forever eradicated.\n\nFrom the *Sutra on Stabilizing the Mind and Resolving Will*, the Ten Precepts:\n1. Do not kill; contemplate the lives of all beings.\n2. Do not commit adultery or violate the wives of others.",
      "start_char": 5070,
      "end_char": 6302,
      "start_sentence": 217,
      "end_sentence": 276,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.200196981430054,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\太上戒经.txt",
        "category": "戒律类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "人虽有王公之位，上至帝王，死皆重罪，无益魂神，受苦不可堪忍。 善男子，汝等思惟，明奉戒行，直心行道。 吾为汝说，天下万物，无有长存，有死有生，有成有败，日出则没，月满则亏，从古至今，谁能违返#1？ 若有道德，不生不灭。 修善者，今月亦善，今日亦善，今时亦善，善善积德，诸行修足，善念护持，令入法宝。 戒曰： 不得盗窃人物。 不得妄取人财。 不得妄言绮语。 不得因恨杀人。 不得贪嗔痴狠。 不得慢老欺人。 不得咒诅毒心。 不得骂詈高声。 不得訾毁谤人。 不得两舌邪佞。 不得评人长短。 不得好言人恶。 不得毁善自誉。 不得自骄我慢。 不得毒畜药人。 不是投书谱善。 不得轻慢经教。 不得毁谤圣文。 不得侍威凌物。 不得贪娱好色。 不得好杀物命。 不得耽酒迷狂。 不得杀生淫祀。 不得烧野山林。 不得评论师长。 不得贪惜财贿。 不得言人阴事。 老君二十七戒 行无为，行柔弱，行守雌勿先动。 右上最三行。 行无名，行清争，行诸善。 右中最三行。 行忠孝，行知足，行推让。 右下最三行。 此九行，二篇八十一章，集合为道舍，尊卑同科。 九行备者，神仙； 六行备者，寿； 三行备者，增年。 戒勿费用精神。 戒勿食含血之物，乐其美色。 戒勿伤王气。 戒勿贪宝货。 戒勿忘道。 戒勿为妄动。 戒勿枝形名道。 · 戒勿杀生。 戒勿贪功名。 右上九戒。 戒勿为耳目鼻口所娱。 戒常当谦让。 戒举百事详心勿惚恫。 戒勿学邪文。 戒勿资身，好衣美食。 戒勿求名誉。 戒勿贪高荣强求。 戒勿轻躁。 戒勿盈溢。 右中九戒。 戒勿与人诤曲直，得失避之。 戒勿为诸恶。 戒勿厌贫贱强求富贵。 戒勿多忌讳。 戒勿称圣人大名。 戒勿强梁。 戒勿祷祠鬼神。 戒勿自是。 戒勿乐兵。 右下九戒。 此二十七戒，二篇共合为道渊，尊卑同行。 上备者，神仙； 持十八戒备者，寿； 持九戒备者，增年不横夭矣。 太上经戒竟 #1『返』即为『反』。",
      "translated_text": "Though one may hold the rank of duke or minister, or even ascend to the throne as emperor, at death all bear grave transgressions. This brings no benefit to the soul, and the suffering endured is unbearable. Good sons, reflect deeply: uphold the precepts with clarity and walk the Dao with a straight heart. I shall tell you—among all things under heaven, none endure forever. There is death and life, success and failure; the sun rises and sets, the moon waxes and wanes. From ancient times to the present, who can defy this turning? Only those who embody the Dao are beyond birth and extinction.\n\nThose who cultivate goodness are good this month, good this day, good this very moment. As goodness and virtue accumulate, all practices reach fulfillment, and wholesome thoughts are upheld, guiding one into the treasury of the Dharma.\n\nThe Precepts state:\nDo not steal others’ property.\nDo not wrongfully take others’ wealth.\nDo not engage in deceitful or frivolous speech.\nDo not kill out of hatred.\nDo not indulge in greed, anger, delusion, or cruelty.\nDo not disrespect the elderly or deceive others.\nDo not harbor curses or poisonous intentions.\nDo not shout or hurl abusive language.\nDo not slander or defame others.\nDo not sow discord with duplicitous or flattering words.\nDo not criticize others’ faults.\nDo not delight in speaking ill of others.\nDo not denigrate goodness or praise yourself.\nDo not be arrogant or self-conceited.\nDo not keep venomous creatures or poison others.\nDo not falsely attribute good deeds to others.\nDo not disdain or neglect the scriptures.\nDo not slander sacred texts.\nDo not rely on power to oppress others.\nDo not indulge in sensual pleasures or lust.\nDo not take pleasure in killing living beings.\nDo not become intoxicated with wine or lose your senses.\nDo not kill for licentious sacrifices.\nDo not burn wild forests or mountains.\nDo not criticize or debate your teachers and elders.\nDo not be greedy or hoard wealth.\nDo not reveal others’ private affairs.\n\nThe Twenty-Seven Precepts of Lord Lao:\nPractice non-action, practice gentleness, practice yielding—do not act first.\nThese are the three highest practices.\nPractice namelessness, practice purity without contention, practice all goodness.\nThese are the three middle practices.\nPractice loyalty and filial piety, practice contentment, practice deference.\nThese are the three lowest practices.\nThese nine practices, comprising two sections and eighty-one chapters, form the dwelling of the Dao, binding high and low alike.\nThose who fulfill all nine become immortals;\nthose who fulfill six attain longevity;\nthose who fulfill three gain extended years.\n\nPrecepts:\nDo not waste your spirit and energy.\nDo not consume beings that contain blood, delighting in their beauty.\nDo not harm the royal qi.\nDo not covet treasures or goods.\nDo not forget the Dao.\nDo not act recklessly.\nDo not distort the Dao with superficial forms.\nDo not kill living beings.\nDo not crave fame and merit.\nThese are the nine highest precepts.\n\nDo not be ensnared by the pleasures of the ears, eyes, nose, or mouth.\nAlways practice humility and deference.\nIn all matters, be deliberate and avoid carelessness.\nDo not study heterodox texts.\nDo not adorn the body with fine clothes or rich food.\nDo not seek fame or reputation.\nDo not greedily pursue high rank or power.\nDo not be rash or impetuous.\nDo not be excessive or overbearing.\nThese are the nine middle precepts.\n\nDo not contend with others over right and wrong; avoid gain and loss.\nDo not commit any evil.\nDo not despise poverty and low status while striving for wealth and nobility.\nDo not be overly superstitious.\nDo not invoke the great names of sages.\nDo not be aggressive or domineering.\nDo not pray to or worship ghosts and spirits.\nDo not be self-righteous.\nDo not delight in warfare.\nThese are the nine lowest precepts.\n\nThese twenty-seven precepts, comprising two sections, form the profound depths of the Dao, binding high and low alike.\nThose who fulfill all become immortals;\nthose who uphold eighteen attain longevity;\nthose who uphold nine gain extended years and avoid untimely death.\n\nThus concludes the *Scripture of the Most High’s Precepts*.",
      "overlap_context": " Dao.\n\nFrom the *Sutra of the Wondrous Grove*, the Twenty-Seven Precepts:\nThe Primordial Heavenly Worthy addressed the four assemblies: “All sentient beings cling to conditioned existence, rejoicing in life and fearing death. Though they seek life, they create the karma of death. Not upholding the precepts, even if they live long, they are like old trees—what difference is there? If they uphold the precepts, at death they will fill the heavenly offices and ascend as immortals, free and at ease.”",
      "start_char": 6302,
      "end_char": 7113,
      "start_sentence": 277,
      "end_sentence": 356,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 20.188626289367676,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\戒律类\\太上戒经.txt",
        "category": "戒律类"
      }
    }
  ]
}