{
  "source_id": "太上洞神太元河图三元仰谢仪",
  "source_file": "chunked_daozang\\太上洞神太元河图三元仰谢仪.json",
  "total_chunks": 12,
  "total_original_chars": 9686,
  "total_translated_chars": 59969,
  "total_translation_time": 302.86930108070374,
  "model_used": "mistralai/mistral-large-2512",
  "metadata": {
    "source_file": "dao\\正统道藏洞神部\\威仪类\\太上洞神太元河图三元仰谢仪.txt",
    "category": "威仪类"
  },
  "full_translation": "*The Supreme Cavernous Divine Great Primeval River Chart Triple Origin Reverent Thanksgiving Rites*\n**Text Title:** *The Supreme Cavernous Divine Great Primeval River Chart Triple Origin Reverent Thanksgiving Rites*\nCompiled by Daoist Du Guangting of the late Tang dynasty. One fascicle.\nSource text: *Daoist Canon of the Zhengtong Era*, Cavernous Divine Department, *Weiyi* (Ritual Propriety) category.\n\n**Preface to *The Supreme Cavernous Divine Great Primeval River Chart Triple Origin Reverent Thanksgiving Rites***\nRevised by Master Guangcheng, Du Guangting\n\nThe scripture states: The method of reverent thanksgiving according to the *River Chart* is a practice that those who study the Dao should constantly perform, for it enables them to transcend the calamity of the great flood and ascend as the *Seed People*. When faced with warfare, fire, floods, droughts, locust plagues, celestial omens and anomalies, the unnatural shifting of heaven and earth, the collapse of mountains and the drying of rivers, the eclipses of sun and moon, untimely winds and frosts, destructive thunder and lightning, malevolent qi stirring disorder, ghosts and demons misleading the masses, the four borders in turmoil, or the ravages of fierce beasts—when the Son of Heaven or lords of states are unsettled, or when illness, adversity, and inauspicious signs arise, even to the point of peril among the common people—one must petition and give thanks to heaven and earth, moving the profound and boundless firmament, only then can deliverance be attained.\n\nThe Dao of heaven pities all beings, and the mysterious sages extend their compassion. The Most High revealed the scriptures of the *River Chart* and *Luo Writing*—the texts of the tortoise and dragon, the azure script on green carapaces—to bestow upon the emperors. This is the method by which the people may invoke blessings, atone for transgressions, transcend adversity, and resolve calamities. When practiced, it aligns above with the Dao of heaven, and every invocation receives response.\n\nThe Three Primordials’ Reverent Petition Rite is conducted on *ren-chen* and *gui-si* days, during the *xu-hai* hours. *Xu* and *hai* are the Celestial Gate, where the serpent faces the pivot; when one understands change, it becomes a dragon, and when the dragon seizes the moment, one who discerns transformation enters the Dao. *Xu-hai* is the ford of the Celestial Gate, while *chen-si* is the pivot and mechanism of dragon and serpent. To awaken and seek the true, one must follow these days—thus the use of *chen-si* days. *Ren* is where yang qi is born, the station of the Great One. Therefore, the *xu-hai* hours are chosen to ascend the altar and offer thanks.\n\nThe *zi* hour marks the inception of yang qi’s flow. Daoist methods grasp images to guide beings, subdue ghosts, command spirits, govern heaven, and order humanity—employing the twelve earthly branches for their purpose. Virtue is established in *zi*, completion is displayed in *chou*, caution against decline in *yin*, vigilance against failure in *mao*, strategic thought unfolds in *chen*, ebb and flow are applied in *si*, rescue from collapse in *wu*, stabilization in *wei*, prevention of chaos in *shen*, great expansion in *you*, return to the root in *xu*, and great peace in *hai*. Returning to the root exhausts yin qi, while great peace elevates yang qi. When the Dao operates, yang ascends; when water is gentle, it harmonizes with the Dao—thus *ren* and *gui* prevail, for they align with yang and accord with the Dao.\n\nIn urgent cases of prayer or thanksgiving where the *ren-chen* day has not yet arrived, the *yin* hour may be used to guard against decline, *wu* to rescue from collapse, and *xu* to return to the root. These three earthly branches, in their respective days and hours, may also be employed in haste, for they harmonize with the Dao of heaven. If one’s cinnabar sincerity moves the divine, all days become efficacious without strict adherence to these times.\n\nThree days prior to the rite, sweep and purify the inner and outer spaces, abstain from all mundane affairs, and admonish attendants and companions to maintain utmost solemnity. The mind must be fully prepared, with no lapse in reverence and care.\n\n*The Most High’s Cavern-Spirit Great Primordial River Chart: Rites of the Three Primordials’ Reverent Petition*\n**Altar Hall, First Section**\nThe altar hall should be situated nearby to facilitate the ritual proceedings.\n\nThe dimensions—whether spacious or modest, ample or restrained—should be determined by the available space. The quarters for guests and hosts must not encroach upon the altar hall or its courtyard. The kitchen and bathing chamber should be kept far from the latrine. Inner and outer areas must be distinctly separated, with care taken to prevent any exposure. If the dwelling is cramped, reinforce the partitions with diligence, using fresh and clean curtains, reed mats, and woven screens. Ensure complete separation, allowing no mingling of smoke or odors.\n\nWithin the oratory hall, the central position facing forward is reserved for the Most High. To the left and right, arrange the scriptures and treasures, the master’s seat, and the space for recitation and discourse. Screens, curtains, tables, and stands—along with incense, lamps, censers, and containers—should be arranged neatly around the hall, all kept immaculate.\n\n**Hall Positions**\nFor the detailed layout of the altar diagram and pillar inscriptions, refer to the *Huanglu Licheng Yi*.\n\n**Altar Positions**\nTai Sui | Ben Ming | Xing Nian | Yuan Chen | Sheng Yue | Tai Yue\nYou Nian | San Qiu | Wu Mu | Jiu You\nPalace | Residence | Gate | Door | Window | Bed\nHall | Chamber | Well | Hearth | Latrine | Drain\nGranary | Storehouse | Garden\n\nTo the right, arrange forty lamps according to their positions, each marked with a placard.\n\n**Second: Arrangement of the Deity Positions**\nFor the deity positions within the hall, create a level altar (*shan*) in the courtyard, measuring three *zhang* and nine *chi* on each side, corresponding to the Three Realms and Nine Ramparts. Beyond the altar, maintain an eight-*chi* purification boundary, marked with a cord. At the four corners, place eight lamps, totaling thirty-two lamps. Each lamp stands nine *chi* high, corresponding to the Nine Mysteries and Thirty-Two Heavens.\n\nNext, construct a second altar measuring two *zhang* and four *chi* on each side, corresponding to the twenty-four *qi*. At its four corners, place seven lamps, totaling twenty-eight lamps. Each lamp stands five *chi* high, corresponding to the Five Stars and Twenty-Eight Constellations. Between the twenty-eight constellations, at the four cardinal directions, place one lamp each, and at the exact center, place one lamp, with two additional lamps flanking them. These stand seven *chi* high, corresponding to the Seven Luminaries.\n\nSeven *chi* beyond this lies the Heavenly Center (*Tianxin*), a square measuring one *zhang* on each side. At its exact center, place ten lamps, with two additional lamps beside them. Each stands seven *chi* high, corresponding to the Dipper. Before the Heavenly Center, set a table where no incense is burned, reserved for the *Da Luo* talisman. To the left of the talisman, place another table with one incense burner. To its right, place a table with four incense burners. At the four directions around the talisman, place one table each with a single incense burner.\n\nBeyond the altar, arrange ninety-one lamps for the principal deities, each five *chi* high. These include:\n- Tai Yi, the Twelve Earthly Branches, and the Twenty-Four *Qi*;\n- Tai Sui, Ben Ming, Xing Nian, Yuan Chen, Sheng Yue, Tai Yue, You Nian, San Qiu, Wu Mu, and Jiu You (sixty-one lamps in total);\n- Two lamps each for the Palace, Residence, Gate, Door, Window, Bed, Hall, Chamber, Well, Hearth, Latrine, Drain, Granary, Storehouse, and Garden (thirty lamps in total).\nIn all, one hundred seventy lamps are used.\n\nThe talismans (*ce*) are made of cypress, fragrant wood, or bamboo, measuring one *chi* and two *cun* in length, four *cun* and four *fen* in width, and three *fen* in thickness. The talisman boards follow the same dimensions, each nine *cun* long, one *cun* and eight *fen* wide, and two *fen* thick, with a hole at the top for threading silk cords. They may be hung or placed as needed. There are sixty-four talisman boards and two hundred three lamp placards, each seven *cun* long, one *cun* wide, and two *fen* thick, to be suspended. One talisman governs sixty deities, and the boards follow the same principle.\n\nLamps dispel darkness and augment light, forsaking yin to embrace yang. Three layers of mats are laid out, and beyond them, screens and barriers are set up, all of the finest quality. Every required item must be prepared to the fullest extent possible. To possess the means yet fail to do so incurs the sin of miserliness and disrespect for the Dao, as well as the punishment of laziness—no transgression, however minor, will be pardoned. In cultivating merit and virtue, fervor is paramount. Furthermore, one must not seize what does not belong to them, nor forcibly beg or coerce loans, lest they offend the divine and incur irredeemable blame. Those who prepare with care and precision will receive boundless blessings. Ascending from low to high, transforming humble to noble, accumulating the subtle to achieve the manifest, refining the false into the true—this dissolves the twenty-eight knots of karmic roots within the body and resolves the nine hundred and six disasters of yang. It penetrates the mysteries of the highest realm, ensuring the joy of long life. If emperors and kings practice this, they may commune with the divine, harmonize yin and yang, secure national peace and popular harmony, and avert the three disasters of flood, fire, and warfare, as well as epidemics. How can one not strive with diligence?\n\nFor the gates, use eight long placards and four eave placards, affixed with nails and loops for hanging signs. Between the gates, place twenty short placards, with sixty-four *chi* of red cord made of ramie fiber. The gate signs measure six *cun* in width and five *cun* in length, with overlapping wings for symmetry.\n\n- **Northwest (Hai) Heavenly Gate**: Black characters on white.\n- **Southeast (Si) Earthly Door**: Yellow characters on red.\n- **Southwest (Shen) Lunar Gate**: White characters on red.\n- **Northeast (Yin) Solar Gate**: Red characters on black.\n\n**Twelve Deities of the North** (arranged from *Hai* to *Chou*):\nJiazi: Wang Wenqing; Yichou: Long Jiqing; Bingyin: Zhang Zhongqing; Dingmao: Sima Qing; Wuchen: Ji Chuqing; Jisi: He Wenchang; Gengwu: Feng Zhongqing; Xinwei: Wang Wenzhang; Renshen: Hou Boqing; Guiyou: Sun Zhongfang; Jiaxu: Zhan Zijiang; Yihai: Pang Minggong.\n\n**Twelve Deities of the East** (arranged from *Yin* to *Chen*):\nBingzi: Xing Sunqing; Dingchou: Zhao Ziyu; Wu Yin: Yu Ziqing; Jimao: Shi Wenyang; Gengchen: Yin Jiaqing; Xinsi: Yang Zhonggong; Renwu: Ma Ziming; Guiwei: Lü Weiming; Jiashen: Hu Wenchang; Yiyou: Kong Ligong; Bingxu: Che Yuansheng; Dinghai: Zhang Wentong.\n\n**Twelve Deities of the South** (arranged from *Si* to *Wei*):\nWuzi: Yue Shiyang; Jichou: Fan Heqing; Gengyin: Chu Jinqing; Xinmao: Guo Ziliang; Renchen: Wu Yaqing; Guisi: Shi Gonglai; Jiawu: Wei Shangqing; Yiwei: Du Zhongyang; Bingshen: Zhu Bozhong; Dingyou: Zang Wengong; Wuxu: Fan Shaoqing; Jihai: Deng Duqing.\n\n**Twelve Deities of the West** (arranged from *Shen* to *Xu*):\nGengzi: Yang Zhongshu; Xinchou: Lin Weigong; Renyin: Qiu Mengqing; Guimao: Su Tajia; Jiachen: Meng Feiqing; Yisi: Tang Wenqing; Bingwu: Wei Wengong; Dingwei: Shi Shutong; Wushen: Fan Boyang; Jiyou: Cheng Wenchang; Gengxu: Shi Ziren; Xinhai: Zuo Zixing.\n\n**Twelve Deities of the Center** (arranged around the perimeter of the one-*zhang* square, three on each side, from *Shen* to *Wei*):\nRenzi: Su Shangqing; Guichou: Jiang Hanqing; Jiayin: Ming Wenzhang; Yimao: Dai Gongyang; Bingchen: Huo Shuying; Dingsi: Cui Juqing; Wuwu: Cong Yuanguang; Jiwei: Shi Tongqing; Gengshen: Hua Wenyang; Xinyou: Bing Yuanyu; Renxu: Yue Jinqing; Guihai: Zuo Shisong.\n\nThe names of the Six Jia Direct Attendants are inscribed, each suspended upon their respective lamps, with written tablets and talismans arranged in sequence. The celestial titles are recorded as follows:\n\n**Great August Yellow-Bright Heaven** – Attendant officials: ninety million myriad persons\n**Great Brilliance Jade-Perfect Heaven** – Attendant officials: ninety million myriad persons\n**Luminous Clarity River-Lad Heaven** – Attendant officials: ninety million myriad persons\n**Mysterious Womb Level-Nurturing Heaven** – Attendant officials: ninety million myriad persons\n**Primal Brilliance Literary-Raised Heaven** – Attendant officials: ninety million myriad persons\n**Upper Brilliance Seven Luminaries Majestic-Barrier Heaven** – Attendant officials: ninety million myriad persons\n**Void Transcending Balance Heaven** – Attendant officials: ninety million myriad persons\n**Grand Ultimate Veiled-Obscurity Heaven** – Attendant officials: ninety million myriad persons\n\nThe above eight heavens pertain to the eight talismans of the East. Inscribed in vermilion with azure qi-generated script; the other talismans follow this pattern, while the eight Direct Attendant talismans are written in black.\n\n**Vermilion Brilliance Harmonious-Yang Heaven** – Attendant officials: ninety million myriad persons\n**Mysterious Brilliance Reverent-Florescence Heaven** – Attendant officials: fifty million myriad persons\n**Radiant Brilliance Ancestral-Fluttering Heaven** – Attendant officials: fifty million myriad persons\n**Bamboo-Falling August-Reed Heaven** – Attendant officials: one hundred fifty million myriad persons\n**Void Brilliance Hall-Shining Heaven** – Attendant officials: ninety million myriad persons\n**Contemplative Brilliance Upright-Tranquil Heaven** – Attendant officials: one hundred twenty million myriad persons\n**Mysterious Brilliance Reverent-Jubilee Heaven** – Attendant officials: one hundred seventy million myriad persons\n**Grand Resplendence Ultimate-Jasper Heaven** – Attendant officials: one hundred eighty million myriad persons\n\nThe above eight heavens pertain to the eight talismans of the South. Inscribed in yellow with vermilion script; the eight Direct Attendant talismans are written in black.\n\n**Primal Capacity Aperture-Ascending Heaven** – Attendant officials: one hundred eighty million myriad persons\n**Grand Peace August-Cliff Heaven** – Attendant officials: seventy million myriad persons\n**Manifest Stability Ultimate-Wind Heaven** – Attendant officials: one hundred fifty million myriad persons\n**Inaugural August Filial-Vigor Heaven** – Attendant officials: forty million myriad persons\n**Grand August Aged-Heavy Floating-Containment Heaven** – Attendant officials: seventy million myriad persons\n**Non-Contemplation River-Flowing Heaven** – Attendant officials: seventy million myriad persons\n**Upper Divination Joyous Heaven** – Attendant officials: seventy million myriad persons\n**Non-Ultimate Cloud-Oath Heaven** – Attendant officials: seventy million myriad persons\n\nThe above eight heavens pertain to the eight talismans of the West. Inscribed on black ground with white script; the eight Direct Attendant talismans are written in black.\n\n**Luminous Court Rosy-Transcendence Heaven** – Attendant officials: fifty million myriad persons\n**Abyssal Penetration Primal-Cavern Heaven** – Attendant officials: fifty million myriad persons\n**Grand Literary Flourishing Wondrous-Accomplishment Heaven** – Attendant officials: fifty million myriad persons\n**Grand Simplicity Elegant-Joy Forbidden-Above Heaven** – Attendant officials: fifty million myriad persons\n**Grand Void Non-Ultimate Constant-Fusion Heaven** – Attendant officials: fifty million myriad persons\n**Grand Release Jade-Elevation Soaring-Victory Heaven** – Attendant officials: fifty million myriad persons\n**Dragon-Transformation Brahman-Transcendence Heaven** – Attendant officials: fifty million myriad persons\n**Grand Ultimate Level-Nurturing Jia-Yi Heaven** – Attendant officials: fifty million myriad persons\n\nThe above eight heavens pertain to the eight talismans of the North. Inscribed on azure ground with black script; the eight Direct Attendant talismans are written in black.\n\n**Great Luo Talismanic Text**\n*The Supreme Non-Ultimate, Utmost Real, Non-Ultimate Non-Action Great Dao Responsive-Inspiration True Essence, Great Luo Brahman-Qi, Void Sovereign Jade Numinosity, One Hundred Eighty Dao Lords, Non-Ultimate World Celestial Master, Most Honored Virtue-Power Host of Perfected Ones, Already Attained the Dao, Immeasurable Great Sages Host.*\n\nThe above forty-nine characters are inscribed in purple. This single talismanic tablet, made of bamboo, is placed facing south at the appropriate time, its head oriented north at the center, on a separate stand with incense. This is called the *Mirrorm Talisman*; the script should be finely rendered to fit. The method for inscribing the bamboo tablets and talismans requires vermilion script; in urgent circumstances where vermilion is unavailable, ink may be used. The *Mirrorm Talisman* is inscribed in purple to communicate with the Imperial Ultimate of the Non-Image. When seen, it brings auspicious prosperity, mutual generation and restraint, inner and outer harmony, each with its proper function. Take care not to misplace or exchange it.\n\n**Inscribing the Celestial Talismans and Drawing the Charts**\n\nNext, the lamps are inscribed as follows:\n\n**Horn**: two; **Neck**: four; **Root**: four; **Chamber**: four; **Heart**: three; **Tail**: nine; **Winnowing Basket**: four.\nThe above are the seven lodges of the East, beginning with *Chen* and ending with *Yin*.\n\n**Dipper**: six; **Ox**: six; **Girl**: four; **Void**: three; **Danger**: three; **House**: two; **Wall**: two.\nThe above are the seven lodges of the North, beginning with *Chou* and ending with *Hai*.\n\n**Straddler**: six; **Harvester**: three; **Stomach**: three; **Horn**: seven; **Net**: eight; **Turtle Beak**: three; **Triaster**: ten.\nThe above are the seven lodges of the West, beginning with *Xu* and ending with *Shen*.\n\n**Well**: eight; **Ghost**: five; **Willow**: eight; **Star**: seven; **Spread**: six; **Wings**: twenty-two; **Chariot Platform**: four.\nThe above are the seven lodges of the South, beginning with *Wei* and ending with *Si*.\n\nThe twenty-eight lodges each have lamps suspended according to their affiliation.\n\n**Sun**: between *Yin* and *Mao*.\n**Moon**: between *You* and *Xu*.\n**Jupiter**: *Mao*.\n**Mars**: *Wu*.\n**Venus**: *You*.\n**Mercury**: *Zi*.\n**Saturn**: center.\nThe seven luminaries each have lamps suspended according to their affiliation.\n\n**Yang Brilliance**: one; **Yin Essence**: two; **Perfected Person**: three; **Mysterious Darkness**: four; **Cinnabar Prime**: five; **North Culmen**: six; **Celestial Pass**: seven; **Assistant Star**: eight; **Aiding Star**: nine.\nThe nine stars of the Northern Dipper, each with lamps suspended according to their names.\n\n**Upper Terrace**: Void Essence; **Middle Terrace**: Sixfold Purity; **Lower Terrace**: Curved Life. The nine stars of the Northern Dipper, along with these two terraces’ twelve lamps, are arranged at the center. The *Mirrorm Talisman* is suspended at the midpoint, its cord firmly tied, with Saturn affixed to it.\n\n**Grand One Altar**: at the north center.\n**Twelve Earthly Branches Purification Sites**: at the four directions.\n**Twenty-Four Black Grand Ones**: to the north of the Grand One.\n**Great Year**: follows its annual position.\n**Original Destiny**: the master of the household, one person.\n**Flowing Year**: same as above.\n**Original Celestial Stem**, **Birth Month**, **Gestational Month**, **Wandering Year**: all based on the master of the household’s year and destiny.\n\n**Three Mounds**: at *Chou*.\n**Five Graves**: at the family’s burial site.\n**Nine Dark Realms**: combined with sixty-one lamps.\n**Official Residence**: at the center.\n**Dwelling**: at the center of the residence.\n**Gate**, **Door**, **Window**: where paper money is hung.\n**Bed Frame**: at the center.\n**Hall**: inside, front, and outer front.\n**Chamber Sides**: inside and outside the wings.\n**Well**, **Hearth**, **Latrine**, **Ditch**, **Granary**: six lamps in the east.\n**Storehouse**: in the north.\n**Garden**: combined with thirty lamps, totaling ninety-one lamps with the previous. Garden lamps are placed according to location; none should be distant, and if necessary, placed outside the gate to the east.\n\nFifteen names in total, each with two lamps; if absent, do not seal.\nThe lamp talismans listed to the right are to be visualized facing east for invocation and prayer rituals.\n\n*Jia-yin, Bing-yin, Wu-yin, Geng-yin, Ren-yin*—all positioned in the north of the eastern direction.\n*Yi-mao, Ding-mao, Ji-mao, Xin-mao, Gui-mao*—all positioned in the center of the eastern direction.\n*Bing-chen, Wu-chen, Geng-chen, Ren-chen, Jia-chen*—all positioned in the south of the eastern direction.\n*Ding-si, Ji-si, Xin-si, Gui-si, Yi-si*—all positioned in the east of the southern direction.\n*Wu-wu, Geng-wu, Ren-wu, Jia-wu, Bing-wu*—all positioned in the center of the southern direction.\n*Ji-wei, Xin-wei, Gui-wei, Yi-wei, Ding-wei*—all positioned in the west of the southern direction.\n*Geng-shen, Ren-shen, Jia-shen, Bing-shen, Wu-shen*—all positioned in the south of the western direction.\n*Xin-you, Gui-you, Yi-you, Ding-you, Ji-you*—all positioned in the center of the western direction.\n*Ren-xu, Jia-xu, Bing-xu, Geng-zi, Geng-xu*—all positioned in the north of the western direction.\n*Gui-hai, Yi-hai, Ding-hai, Ji-hai, Xin-hai*—all positioned in the west of the northern direction.\n*Jia-zi, Bing-zi, Wu-zi, Geng-zi, Ren-zi*—all positioned in the center of the northern direction.\n*Yi-chou, Ding-chou, Ji-chou, Xin-chou, Gui-chou*—all positioned in the east of the northern direction.\n\nThe six *jia* positions, each with five stations, must be clearly recognized to repel evil; do not seek correctness recklessly. Record names as before, inscribing them on slips.\nThis is the method for visualization and invocation facing north.\n\nAll lamp tablets, talismans, and inscribed slips should be adorned with colors and paintings, firmly glued so that even wind and rain cannot displace them until the ritual’s completion. If damaged or soiled, repair them while invoking the true spirits. Strict cleanliness is essential to attract blessings. If violent wind or rain arrives, move the lamps accordingly.\n\n**South:**\n1. Supreme Yellow Emperor’s *Zeng* Heaven—attended by 900 million officials.\n2. Supreme Bright Jade *Wan* Heaven—attended by 1.6 billion officials.\n3. Clear Bright *He Tong* Heaven—attended by 1.7 billion officials.\n4. Mysterious Womb Nurturing Heaven—attended by 1 billion officials.\n5. Primordial Bright *Wen Ju* Heaven—attended by 1.1 billion officials.\n6. Supreme Bright Seven Luminaries *Mo Yi* Heaven—attended by 800 million officials.\n7. Void Transcending *Heng* Heaven—attended by 2.6 billion officials.\n\nThe seven constellations of the northern direction: talismans inscribed in white on black ground, drawing upon *sheng qi* (vital qi); others follow this pattern. Heaven and prophecies inscribed in cinnabar.\n\n**West:**\n1. Supreme Ultimate Veiled Heaven—attended by 1 billion officials.\n2. Crimson Bright Harmonious Yang Heaven—attended by 1.8 billion officials.\n3. Mysterious Bright Reverent Splendor Heaven—attended by 500 million officials.\n4. Radiant Bright Ancestral *Piao* Heaven—attended by 500 million officials.\n5. *Zhu Luo* August *Jia* Heaven—attended by 1.5 billion officials.\n6. Void Bright Hall Radiant Heaven—attended by 900 million officials.\n7. Observing Bright Upright Serene Heaven—attended by 1.2 billion officials.\n\nThe seven constellations of the eastern direction: talismans inscribed in black on green ground. Heaven and prophecies inscribed in cinnabar.\n\n**North:**\n1. Mysterious Bright Reverent Celebration Heaven—attended by 1.7 billion officials.\n2. Supreme Radiant Ultimate Jade Heaven—attended by 1.8 billion officials.\n3. Primordial Bearing *Kong Sheng* Heaven—attended by 1.8 billion officials.\n4. Supreme Peace August *Ya* Heaven—attended by 700 million officials.\n5. Manifest Fixed Ultimate Wind Heaven—attended by 1.5 billion officials.\n6. Originating August Filial *Mang* Heaven—attended by 4.3 billion officials.\n7. Supreme August *Zhu Chong Fu Rong* Heaven—attended by 4.3 billion officials.\n\nThe seven constellations of the southern direction: talismans inscribed in green on red ground. Heaven and prophecies inscribed in cinnabar.\n\n**East:**\n1. No-Thought *Jiang You* Heaven—attended by 900 million officials.\n2. Supreme *Die Ruan* Joy Heaven—attended by 300 million officials.\n3. Limitless *Tan Shi* Heaven—attended by 1.6 billion officials.\n4. Luminous Court Night Crossing Heaven—attended by 1.6 billion officials.\n5. Abyssal Penetrating Primordial Cavern Heaven—attended by 1.4 billion officials.\n6. Supreme Literary Flourishing Wondrous Completion Heaven—attended by 1.2 billion officials.\n7. Supreme Purple Elegant Joyful Forbidden Upper Heaven—attended by 1.6 billion officials.\n\nThe seven constellations of the western direction: talismans inscribed in yellow on white ground. Heaven and prophecies inscribed in cinnabar.\n\n**Southwest:**\nSupreme Void Supreme Constant Fusion Heaven—attended by 8 billion officials.\nTalismans inscribed in vermilion on yellow ground. Heaven and prophecies inscribed in cinnabar.\n\n**Northeast:**\nSupreme Release Jade Ascending Triumph Heaven—attended by 8 billion officials.\nTalismans inscribed in green on red ground. Heaven and prophecies inscribed in cinnabar.\n\n**Southeast:**\nDragon Transformation Brahman Crossing Heaven—attended by 8 billion officials.\nTalismans inscribed in white on yellow ground. Heaven and prophecies inscribed in cinnabar.\n\n**Northwest:**\nSupreme Ultimate Nurturing *Jia Yi* Heaven—attended by 8 billion officials.\nTalismans inscribed in yellow on black ground. Heaven and prophecies inscribed in cinnabar.\n\nThe qi of all heavens congeals into stars and coalesces into mountains. Celestial stars correspond to human affairs, governing the order of humanity. Thus, the *He Tu*’s dragon patterns unfold to reveal this to the world. Those who know and cultivate it may dissolve calamities and attract blessings.\n\nThe beginning lies in the north: bowing to the constellations as the starting point, the mind focuses on the celestial path, retracing the stellar officials in reverse order, following their degrees in circular return, awaiting the encounter with mysterious blessings.\n\nFor the Four Cardinal Directions, perform twelve bows each. The *Da Luo* talismanic writs, inscribed tablets, lamp slips, and titles of the celestial ranks follow the same method as the east-facing rite. The slips and talismans inscribed must face east in spring, south in summer, west in autumn, and north in winter, oriented toward the Sovereign in purity. After burning incense and completing the inscriptions, suspend them before the talismanic writs.\n\nThe master washes and rinses, facing the Sovereign, closes his eyes, clenches his fists, and visualizes the spirits. He arranges the talismans and slips upon the altar table, taps his teeth thirty-two times, swallows saliva thirty-two times, and recites the talisman incantation:\n\n*\"Descend and ascend, the Nine Mysterious Blessings;\nThe Yellow Radiance first connects the divine qi—\nthe rite is complete.\"*\n\nHe then gathers the talismans and writs, visualizing the spirits as before, and recites another incantation:\n\n*\"Should wind and thunder transform, or public and private matters press,\ntemporarily gather the talismans and writs—no need for incantation.\nCultivate goodness, guard the Mysterious, rectify hun and po;\nthe Three Heavens bestow blessings, the Nine Lords command.\"*\n\nThe number of attending officials in the writs changes with the seasons: ten in spring, a hundred in summer, a thousand in autumn, ten thousand in winter, and a hundred million in all four seasons, with the Five Transformations circulating throughout. From the Son of Heaven to the common people, all may employ the hundred-million number for superiority.\n\nThe numerical correspondences are: nine in the east, three in the south, seven in the west, and five in the north—these are the qi numbers. *Zi* and *Geng*, *Chou* and *Xin* align with seven as Metal; *Yin* and *Wu*, *Mao* and *Ji* align with three as Fire—these are the qi numbers of the Five Phases. Thus, the east’s nine qi form the Azure Heaven.\n\nFor those who perform this retreat, the scripture states: first, visualization to stabilize the mind’s karma; second, prayer and vows to cultivate the mouth’s karma; third, bowing and rites to transform the body’s karma. Replacing evil with good depends solely on utmost sincerity. Once the Three Karmas are reformed, a hundred blessings will arrive—how can one not strive for this?\n\nThe square altar or ritual space should measure fifty-five feet on each outer side, corresponding to the *Da Luo* Heaven’s *Dayan* number. The altar’s height is one *zhang* and two *chi*, with gates five *chi* wide. The scattered altars are nine *chi* wide, and the gate plaques are inscribed in a space three *cun* and three *fen* square. In the four directions and the center, place sixty lamps, each six *chi* tall. Generally, around two hundred thirty lamps may be used; if the space is narrow or resources limited, reduce them to no fewer than thirty-two.\n\nChoose an auspicious time, prepare the ritual implements, gather Daoist companions, and invite esteemed masters. All must bathe, wear fresh and clean garments, and arrive at the retreat site beforehand. For three days, abstain from meat and impurities, sever worldly affairs, and maintain a single-minded purity to await the rites.\n\nThose assisting in miscellaneous tasks should not be numerous—too many cause disturbance. Select only those who are reverent, cautious, and respectful to fulfill their duties. Rotate shifts for rest, ensuring no one sleeps simultaneously. The incense attendants must keep the fragrance rich, day and night unbroken. The lamp attendants must ensure brightness, their radiance extending until dawn.\n\nAt dawn, the retreat officers offer congee; at midday, vegetarian meals—all must be pure, fresh, and sweet, free from blood, meat, or impure ingredients. Only naturally ripened fruits may be used; do not consume vegetables facing the Sovereign. Hosts and guests alike must be diligent and earnest, with humility as the highest virtue.\n\nThis retreat has no official positions; petitions are made only at the two court audiences of dawn and dusk. As in the *Lingbao* rites, bow to the directions and make announcements; by evening, offer grand thanks.\n\nBefore entering the chamber, recite the incantation:\n\n*\"The Primordial Qi of the Three Origins enters my body,\ncommunicating all petitions to be heard above.\"*\n\nAfter completion, proceed with the *Huaxia* hymn. Lead the procession with praises, and arrange the banners and staffs before the altar. The exit follows the same procedure.\n\n**Entering the Altar (Third Rite)**\nEnter the altar after the *Hai* hour. The assembled officers proceed from the retreat hall in orderly ranks, chanting and leading the way to the Celestial Gate at the *Hai* hour. After the master recites the incantation, he enters the altar enclosure, circumambulates the outer heaven once to the left, reaching *Xu*, then circles the Three Luminaries once. The master stands at his position, while the officers circumambulate the Three Luminaries to the south, facing north and standing upright. The cantor intones, and each bows to the master, visualizing as prescribed.\n\n**Visualizing the Spirits (Fourth Rite)**\nThe master strikes the ritual drum thirty-two times, closes his eyes, and inwardly visualizes: first the Three Treasures, then the Three Masters who transmitted the rites, then the Three Ones, then the thirty-six thousand spirits, arrayed within and without, guarding body and mind. He clearly envisions the thirty-three heavens, the seventy-four directions, and beholds the boundless divine qi, clouds swirling in harmony, along with the celestial officials, earthly administrators, the Nine Palaces, Seven Luminaries, Five Phases, Six *Jia*, Earth Sovereign, Cavern Spirits, all perfected immortals, generals, officers, soldiers, functionaries, and attendants—all simultaneously gathering in the void, encircling the altar in solemn order.\n\nHe prays: *\"Today, we submit to the Heavenly Worthy; may hosts and guests receive grace, and all, living and deceased, be blessed with fortune.\"*\n\nNext, the cantor intones and strikes the ritual drum thirty-two times. The master, having finished striking the drum, swallows saliva thirty-two times and kneels to offer incense.\n\n**Offering Incense (Fifth Rite)**\nThe master offers incense at the four burners beside the writ table, thirty-three times in total: six pinches in one burner, sixteen in another, eight in another, and three in the last. Upon completion, he rises.\n\nTwo officers serve as incense attendants, entering through the Earth Gate to retrieve the four incense burners. One exits through the Celestial Gate, offering incense before the assembled officers. Each offers three pinches. After the incense offering, the attendants re-enter through the Celestial Gate, return the burners to their original places, exit through the Earth Gate, and resume their positions.\n\nNext, the cantor intones, and each states their name and position, then recites the incense-burner incantation:\n\n**Kindling the Burner (Sixth Rite)**\n*\"The Supreme Clarity, Mysterious Capital, Great Cavern, Three Radiance disciple, the Most High Three Caverns Master, performing the Great Mystery *He Tu* Grand Thanksgiving Rites, the Perfected of [specific] Mountain and [specific] Emperor, the Lesser Servant of the Realized, [Name], humbly invokes:\nthe Supreme Venerable, Primordial Lord of the Limitless, the Most High and Unconditioned, the Great Dao’s Responsive Essence of Truth;\nthe Great *Luo*’s Void and Spontaneous, Purple Void’s Wondrous Existence, the Unconditioned and Unobstructed, Primordial Azure and Primordial Yellow, the White Ancestral Qi;\nthe Highest Great Possession, Jade Clarity, Highest Clarity, Mysterious Capital, Jade Capital, Seven Treasures, Purple Tenuity, Grand Clarity, Supreme Ultimate, Cavern Obscurity, Lesser Possession, Three Origins, Four Beginnings, Five Layers, Nine Ultimates, Purple Yang Perfected Spirits;\nthe Divine Qi, leading the Sacred Officers and Lords, governing the Perfected Spirits and Officers, presiding over the Immortal Administrations, recording the Registers, the Left and Right Dragon-Tiger Riders, the Jade Lads Attending Incense and Flying Dragons, the Jade Maidens in Embroidered Robes Transmitting Words, the Three Realms’ Attendants, the Celestial and Earthly Officers, the Dark Ministers of the Waters, the Earth Sovereigns’ Functionaries, the Cavern Palaces’ Couriers, the Sun, Moon, and Stars, the Mountains, Valleys, Streams, and Gorges, the Pools, Marshes, Rivers, and Seas, the Vast and Boundless Waters, the Nine Palaces, Six *Jia*, and Envoys of All Directions;\nthe conditioned and unconditioned, the world-transcending and worldly, the boundless and immeasurable realms;\nand the local earthly domain’s Perfected Officials and True Spirits—\nall arrayed in solemn attire.\"*\n\nWe further invoke the ninety thousand troops of the Great Xia from the Eastern Ultimate, the thirty thousand bronze-headed, iron-browed warriors from the Southern Ultimate, the seventy thousand Vajra Valiant Warriors of the Western Ultimate, the fifty thousand great-necked, great-armored divine soldiers of the Northern Ultimate, and the one hundred twenty thousand iron-faced ghost-devouring troops of the Central Ultimate. We also invoke the nine billion myriad cavalry of the Nine Sages, Nine Perfected, and Nine Immortals, all to assemble at once and stand guard around the altar precinct.\n\nOn this most auspicious night of [specific date], we, your ministers, reverently receive the Emperor’s devout command, prostrating ourselves in earnest sincerity. We burn incense, establish the fast, perform rites of gratitude, repentance, and supplication, and humbly present this petition. May malevolent vapors be swept away, true *qi* descend, and mysterious blessings flow and permeate the Emperor’s person and our own. May the prayers we raise be fulfilled, the state and household receive grace, and this petition ascend before the August Jade Emperor of the Supreme Void, the Most High and Perfectly Real.\n\n**Rite of the Thirty-Two Heavens, Seventh Recitation**\nThe Precentor intones:\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Great Yellow *Huangzeng* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Great Bright *Yuwang* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Clear Bright *Hetong* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Mysterious Womb *Pingyu* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Primordial Bright *Wenju* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Upper Bright *Qiyao Moye* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Void Transcending *Yueheng* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Supreme Ultimate *Mengyi* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Vermilion Bright *Heyang* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Mysterious Bright *Gonghua* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Radiant Bright *Zongpiao* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Bamboo Grove *Huangjia* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Void Bright *Tangyao* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Contemplative Bright *Duanjing* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Mysterious Bright *Gongqing* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Great Resplendent *Jiyao* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Primordial Ascent *Kongsheng* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Great Peace *Huangya* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Manifest Fixed *Jifeng* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Primordial Filial *Xiaomang* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Great August *Wengchong* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Thought-Free *Jiangyou* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Upper *Die* *Ruanle* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Limitless *Tanshi* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Luminous Court *Xiaodu* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Abyssal Penetrating *Yuandong* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Great Literary *Hanmiao* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Supreme Refined *Xiule* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Great Void *Changrong* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Great Release *Yulong* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Dragon-Transforming *Fandu* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Supreme Ultimate *Jiayi* Heaven.\n\nShould grace be granted, those who begin from the eastern direction shall follow the stellar lodges and degrees, while those who commence from the east shall align with the directional *qi* and numerology, each abiding in their place.\n\nWe, with utmost sincerity, take refuge in the Supreme Limitless and Perfectly Real, the Unsurpassed and Non-Acting Dao, the Responsive and True Essence, the Great Brahma *qi* of the Jade Clarity of the Boundless Heaven, the Heavenly Master of the Limitless Realm, the Perfected of the Dao and Virtue, the Immeasurable Great Saints who have attained the Way, and all the Orthodox and True Lords and Sages.\n\nOne bow.\n**Eighth Repentance**\n\nKneeling prostrate, knocking our heads to the ground, we focus our essence and will, without donning rabbit crowns or loosening our hair.\n\nDisciples of the Three Luminaries of the Great Cavern of the Mysterious Capital of Supreme Clarity, Supreme Masters of the Three Caverns, we, who perform the rites of repentance and audience according to the *Tai Xuan He Tu*, the Mountain Lord of [such-and-such] Peak, the Emperor Lord of [such-and-such] Realm, and the Lesser Omen Perfected, your humble servants [Name] and others, with utmost sincerity jointly address and supplicate the Unsurpassed, Unprioritized, Non-Acting, and Limitless Great Brahma *qi* of the Void and Tranquil Mysterious Essence, the Supreme Limitless Dao, the Divine Lord of the Dao within the Dao, the Jade Emperor, the Thirty-Two Heavenly Lords, the Thirty-Nine Supreme Perfected, the Ten Directions and Five Offices, the Kings and Chancellors, the High Ministers and Assistants, the Barrier-Heaven and Rampart-Earth, all mountains, all waters, all suns, moons, and stellar lodges, the Heavenly Masters of all grotto-heavens and palaces, the host of Perfected and Saints who have attained the Dao, the Responsive and Venerable Saints, the immeasurable and orthodox Perfected of the past, present, and future across boundless worlds and innumerable multitudes, and all divine immortals and spirit officials.\n\nWe, dust-bound and base, dull in wisdom and perception, have by karmic fortune encountered the transformative power of the Dao, early embraced the true teachings, and been granted the sacred scriptures. Overwhelmed by the grace bestowed upon us, our joy and gratitude know no bounds. Yet, as the luminous statutes reward goodness and permit merit-making as a priority, we are called to assist the state and deliver the people, to offer our sincerity and devotion. However, we have failed to firmly uphold the resolve of mountain-dwelling reclusion or to elevate the merit of withdrawing from the world. Constantly fearing the end of our allotted span and the reproach of the dark night, we have betrayed the teachings of the Heavenly Perfected and the grace of the Great Dao. Time slips away, and our meager contributions remain unfulfilled. Relying on the compassionate mercy of forgiveness, we pledge our utmost sincerity and, together with like-minded companions, purify body and spirit, binding ourselves in devotion and submission.\n\nWe humbly beseech the host of Perfected and Saints to bestow their merciful indulgence, allowing us to renew ourselves and fulfill our repentance. Moreover, as we adhere to the edicts, we dare not withhold our words: if there are words, we shall recite them; if there are none, we shall declare our hearts’ redirection, praying for compassion upon our supplications.\n\nThe Emperor, who bears the profound blessings of the Mysterious and aligns with the celestial mandate, shoulders the weight of the Four Great [Elements] and holds the pivot of the myriad transformations. With reverent caution, he remains vigilant day and night, yet privately fears that his governance may fall short, failing to harmonize with the divine, leaving remote frontiers and destitute lands bereft of grace and trust. Wars, floods, fires, droughts, locusts, plagues, and poisons; malevolent *qi*, fierce beasts, and violent calamities still afflict the people. His heart trembles with dread, as though treading upon ice and embers, and he yearns to pour out his sincerest devotion, supplicating the Mysterious Heavens.\n\nWe officials, endowed with accumulated goodness and favored by the true blessings, yet dwell in the filth of the mundane world, our traces mingling with the dust and defilement. We have strayed from the rites of cultivating the Five Constants and reflecting upon ourselves, and neglected the subtle harmony of preserving the Four Seasons. Our actions have bred regrets and transgressions, layering faults and errors. Unaware and unheeding, we have never performed repentance and purification. We fear that in past lives, we may have accrued faults and transgressions, or, yielding to the whims of the heart, brought about misfortune and strife. Mortal sentiments are inscrutable, and the ways of the divine are unfathomable. Our sins, like threads strung together, have amassed without cease. We have shown no reverence for the Heavenly Dao, no faith in ghosts and spirits, defied the principles of *yin* and *yang*, and disrupted the divine order. Past transgressions remain unrepented, and new wrongs are added, our karmic debt as deep as the sea, as towering as mountains. Moreover, the Five Phases alternate, and fortune and misfortune are inconstant; the Three Destinies cycle, and good and ill fortune intertwine. The stars and constellations follow their courses, with appointed times of influence; day and night, darkness and light, hold the reckoning of ascent and descent. We may have inherited enmity from past lives or this existence, or encountered karmic debts in the interplay of light and shadow. We may have incurred faults ourselves, or inherited the calamities of distant ancestors—boundless and immeasurable, beyond recall or reckoning.\n\nWe, your servants, endowed with the essence of the Great Yang, dwelling within the course of the Dao, though tainted by the dust of the world, have been permitted to partake in the mysteries of the Cavern Realms. The Golden Scriptures of the Three Caverns, the Jade Tablets of the Nine Heavens, the wondrous arts of refining the luminous embryo and the primordial origin, the disciplines of congealing spirit and embracing the One, the Dragon and Phoenix Charts that reverse aging and arrest time, the practices of audience with the origin and restoration of destiny, the attainment of sagehood and transcendence of the mundane—all these, transmitted through generations and treasured for ten thousand years, have been revealed to us through the guidance of masters, and we have been granted glimpses of their profundities. Though our ears are dull and our hearts unworthy, we have encountered the hidden marvels of the celestial canon; though ephemeral as mayflies and morning mushrooms, we have glimpsed the vast longevity of the *chun* tree.\n\nAmidst the feast of flavors and the harmony of the purest tones, we leap and dance, forgetting all weariness. We once believed that in the Nine Purities and Three Realms, an audience with the celestial would come to pass, and that at the gates of the sun and the fords of the stars, ascension would be ours to hope for. Yet our benighted folly, ingrained through long habit, has led our discerning nature astray. We have drowned in the river of transgressions, drifted in the sea of filth, indulged in the clamor of fame and profit, lingered in the snares of splendor, forsaken the upright for the perverse, and woven webs of manifold evils.\n\nSome have scorned the sacred scriptures, casting doubt upon the true numina. Others have stolen divine texts, transmitting them to those unworthy of the Dao. Still others, in pursuit of wealth and sensuality, have coveted fleeting glory, cloaking themselves in false purity while inwardly forsaking true rectitude. Some have exploited the Three Treasures to serve their own ends, accepting offerings from the devout yet failing to cultivate merit, embezzling from the perpetual endowments, and slandering the divine. Others, feigning mastery of celestial patterns, have presumed to foretell fortune and misfortune, inventing their own doctrines in defiance of canonical norms, their errors compounding day by day, never once awakening to their folly.\n\nSome, inwardly neglecting the work of inner visualization while outwardly abandoning the disciplines of cultivation, have profaned the Three Palaces and clouded the Eight Luminaries. The Red Child suffers the agony of sinking and drowning; the Cinnabar Field endures the sorrow of obstruction and blockage. The Six Qi fall out of harmony, and the hundred passages grow congested. Thus do transgressions summon calamity, while virtue dispels disaster—yet we, unmoved by the Dao’s compassion, remain unconvinced of the gods’ protection.\n\nForsaking the root for the branch, we have never truly repented, and now, as the faintest of life’s currents slip away, how can we hope to reclaim what is lost? Some have erected palaces and dug moats, traversed official posts and chosen dwellings by divination, raising earth and timber in construction, unwittingly offending the unseen and the manifest. They have encroached upon the earthly treasuries, desecrated mounds and tombs, ravaged sacred precincts, and defiled numinous sites, carving into blessed lands, draining springs, polluting rivers, and defying the will of heaven and earth.\n\nSome, through countless rebirths across eons, have wandered without end. Others, having once held exalted rank, ruled without Dao or mercy. Still others, as ministers or children, were neither loyal nor filial, slaughtering living beings to sustain their own lives, committing wanton or accidental killings, indulging in crimes without restraint. Some, in the name of conquest, wielded public authority for private gain, destroying jade and stone alike without pity, felling the wise and foolish together, showing no compassion.\n\nThus have the lowly been left without refuge, and both the living and the dead known only sorrow. These past transgressions now flow down to afflict this present life. Some bear the debts of nine generations and seven lineages, their departed kin burdened in the netherworld, their woes entangling their descendants. Others find their ancestral tombs restless, their spirits grieving and resentful, their grievances recorded in the courts of the unseen, bringing misfortune and decline.\n\nMoreover, heaven and earth are served by gods of punishment and virtue, by officials who scrutinize all deeds, by the eyes of yin and yang that measure transgression, and by the bureaus that record faults. Good and evil are inscribed without the slightest omission. A single misstep may bar one from the realm of longevity, casting one forever into the courts of sin, never to return for ten thousand kalpas—a fate truly pitiable.\n\nYet in the common course of things, the deluded are many. When those who do good meet with disaster, they claim that virtue brings no benefit, unaware that the lingering misfortunes of past lives have yet to be exhausted—once they are, fortune will come. When they see the wicked at ease, they claim that evil brings no harm, unaware that the residual blessings of past lives have yet to be spent—once they are, calamity will follow. Thus emboldened, they give free rein to their desires, plunging recklessly into the long night, where every suffering awaits.\n\nWere it not for the radiant light of the Great Dao, we would forever stray from the path of life. Yet we have heard that the mysterious scriptures, in their sagely teachings, open the gate of repentance. A decade of earnest cultivation may turn back a moment of time in the Grand Purity. Two hours of unwavering practice may earn the Upper Purity’s record of merit. Three years of devoted supplication may lead the Jade Purity to absolve all sins. The myriad heavens pity the world, and the ten thousand sages extend their grace, patiently guiding the lost across the ford of delusion, earnestly warning of the perils of drowning.\n\nThe leaping dragon and fish bear charts of green and vermilion; the tortoise and horse reveal dark tallies and azure texts. Books of repentance and reform are revealed, and the secrets of transcending the world and cultivating life are set forth. To witness these is to know eternal joy; to embody them is to become true. The bounty of goodness is magnified, and boundless blessings are bestowed. Through diligent practice and mindful devotion, safety and security are assured.\n\nThe Emperor, revering the patterns of the River and Luo, the sacred decrees of the Mysterious Origin, bows in submission and repentance, seeking grace. He offers sincere prayers across the Three Realms, repenting and giving thanks to all the heavens. Lamps scatter their radiance like distant stars beyond the celestial gates; incense mists rise in fragrant clouds, awaiting passage along the celestial roads. The precious texts of true repentance are arrayed, the jade pivots and pearl axes of the heavens aligned. With hearts laid bare, we hope to turn the gaze of the true mirror.\n\nMay the Two Modes know peace and tranquility, the Three Luminaries shine in harmony, the seasons follow their course, wind and rain come in due season. May the ancestral temples and former sages, the altars of soil and grain and the numinous spirits, receive boundless protection, enduring as long as heaven itself. May the cycles of heaven and earth proceed without the disasters of eclipses or comets, may the mountains and seas, the frontiers and borders, know no calamities of flood, drought, war, or locusts. May the three frontiers be stilled, the myriad people rejoice in well-being, traitors and treacherous ministers reform their hearts, and the barbarians of the four directions come bearing tribute across seas and mountains.\n\nMay the Emperor’s longevity be extended, his years prolonged without end. May sagely and worthy ministers assist in governance, loyalty and filial piety flourish, martial might be stilled and civil arts rise, heaven be clear and earth at peace.\n\nWe, your disciples, officials of such-and-such rank, now offer our sincerity upward, praying for resonance and communion. May heaven bestow auspicious blessings, may the gods grant their support and favor. May old enmities dissolve, debts and grievances be settled in peace, ten thousand evils vanish like clouds, a thousand disasters melt like ice.\n\nMay the unseen realms receive fortune, our distant ancestors ascend to heaven, ever dwelling within the Dao, forever meeting with blessings, never encountering demonic harm, never falling among the border tribes. May fire and water not assail us, blades and weapons not harm us. May we ever do good to save all beings, establish merit to aid the times, and see the world attain great peace, all returning to the transformation of the Dao.\n\nMay our minds and spirits grow bright and wise, our lifespans be extended. May the Five Emperors and Four Controllers, the Three Officials and Nine Treasuries, the Celestial Passes and Earthly Gates, the courts of the water and land, the nether realms, Mount Tai and Fengdu, the Nine Dark Springs and their winding depths—may all these remove our names from the registers of sin and inscribe them in the rolls of the living. May the obstacles of the Three Actions be dispelled, the roots of the Ten Evils purified. May the living and the dead receive blessings, the seen and unseen worlds know grace.\n\nNow, therefore, we burn incense, surrendering body, spirit, and life to the Great Dao, prostrating ourselves to repent all sins and transgressions. We humbly pray that the Great Lofty Jade Emperor of the Primordial Void, the Limitless Supreme Saints, the Three Honored Ones and Three Treasures, the Most Revered of Dao and Virtue, the Thirty-Nine Perfected, the Thirty-Two Emperors, the sun, moon, and stellar lodges, the True Officials of the Dipper and Terrace, the Six Jia and Five Agents, all heavens and earths, every revered sage and attained immortal—may they issue decrees to the inner and outer bureaus of the seen and unseen, the celestial overseers of transgressions, the High Perfected who govern fate, to inspect the sincerity of our emperor and ministers in amending past wrongs, and to reward the resolve of our emperor and ministers in self-renewal. May all boundless offenses be wholly dissolved. May the divine soldiers of the dharma registers, the direct talismanic spirits, and assisting deities examine, record, and memorialize our plea, swiftly bringing about resonance. At this hour of fulfillment, may we look up to receive the vast compassion of the Heavenly Worthies, matching the sincerity of our emperor and ministers in surrendering to the Dao.\n\nWe respectfully submit this petition for your hearing.\n\n**The Ten Great Aspirations**\nWe, your servants, aspire:\nFirst, that heaven and earth unite in harmony;\nSecond, that sun and moon shine with equal brightness;\nThird, that yin and yang follow their proper order;\nFourth, that the realm enjoy peace and tranquility;\nFifth, that the imperial reign flourish in splendor;\nSixth, that ministers and counselors remain loyal and steadfast;\nSeventh, that all people rejoice in happiness;\nEighth, that the nine grains yield abundant harvests;\nNinth, that the dark paths be freed from suffering;\nTenth, that the Great Dao flourish and prevail.\n\n**Ninth Offering at the Incense Burner**\nMay the Incense Officials, the attending Perfected, the Direct Talismans of the Five Emperors, and the celestial overseers—we, your servants, on behalf of the emperor, having completed the offering of incense and thanksgiving—now pray that the Heavenly Emperors of the Thirty-Two Heavens of Great Lofty, the One Hundred Eighty Dao Lords of the Direct Talismans, the Thirty-Nine Perfected Envoys of Direct Service, the One Hundred Twenty Bureaus of the Three Primes, along with the officers of this year, month, day, and hour, the Seven Luminaries and Five Agents, the local earth gods of the four directions and center, and all spiritual authorities within and beyond the Three Realms, together record the vows of self-renewal made by our emperor and ministers, and solemnly accept the sincerity of our prayers. May auspicious qi and radiant light illumine the altar grounds of the divine continent, may the Three Primes and Five Emperors manifest portents within the tranquil halls of the palace, may dragon-horses bear the charts and tortoises and fish display blessings, may the vermilion graphs reappear and the green characters renew.\n\nMay the emperor’s virtue and power shine forth, his mysterious merit extend far and wide, his reign endure long, and the land know great peace. May we, your servants, and all disciples have our sins eradicated, all virtues amassed, the whole world receive blessings, the seen and unseen realms be graced with favor. May the nine generations of ancestors and the three masters attain the fruit of Perfection. May the jade lads and jade maidens who attend incense and lamps, the officials of the Three Realms, and all responsive spirits memorialize our petition and present it directly before the Jade Emperor of the Great Lofty Primordial Void.\n\n**Next: The Immortal’s Procession**\n**Next: Circumambulating the Central Lamp**\nExiting the Earth Gate, encircling the Three Lights, circumambulating heaven once, returning to the Earth Gate.\n\nNext, upon exiting the gate, the incantation is recited:\n*\"May the Perfected descend from the six directions, may the Nine Heavens bestow their protection, may benevolent spirits draw near, and merits be accomplished.\"*\nWhen finished, strike the teeth and swallow the saliva thirty-two times each.\nNext, return to the ritual chamber.\n\nThus concludes *The Rite of Reverent Thanksgiving to the Three Primordials of the Great Cavern Spirit and the Supreme Mystery of the River Chart*.",
  "chunks": [
    {
      "chunk_index": 0,
      "original_text": "太上洞神太元河图三元仰谢仪 经名：太上洞神太元河图三元仰谢仪。 唐末道士杜光庭编修。 一卷。 底本出处：《正统道藏》洞神部威仪类。 太上洞神太元河图三元仰谢仪序 广成先生杜光庭修 经曰：河图仰谢之法，学道之士常能行之，度洪灾之劫，升为种民。 若兵戈水火，旱潦螟蝗，星辰变怪，天地易常，山摧川涸，日月薄蚀，风霜不时，雷电害物，妖气作沴，鬼邪惑众，四境不宁，猛鸷为暴。 若帝王国主不安，及疾厄灾异，至於民间危急，当告谢天地，玄感穹旻，乃可解度耳。 天道悯物，玄圣流慈。 太上出河洛龟龙之书，青文绿甲之字，以授帝王。 此盖教民致福谢过，度厄解灾之法也。 行之则上合天道，举无不应矣。",
      "translated_text": "*The Supreme Cavernous Divine Great Primeval River Chart Triple Origin Reverent Thanksgiving Rites*\n**Text Title:** *The Supreme Cavernous Divine Great Primeval River Chart Triple Origin Reverent Thanksgiving Rites*\nCompiled by Daoist Du Guangting of the late Tang dynasty. One fascicle.\nSource text: *Daoist Canon of the Zhengtong Era*, Cavernous Divine Department, *Weiyi* (Ritual Propriety) category.\n\n**Preface to *The Supreme Cavernous Divine Great Primeval River Chart Triple Origin Reverent Thanksgiving Rites***\nRevised by Master Guangcheng, Du Guangting\n\nThe scripture states: The method of reverent thanksgiving according to the *River Chart* is a practice that those who study the Dao should constantly perform, for it enables them to transcend the calamity of the great flood and ascend as the *Seed People*. When faced with warfare, fire, floods, droughts, locust plagues, celestial omens and anomalies, the unnatural shifting of heaven and earth, the collapse of mountains and the drying of rivers, the eclipses of sun and moon, untimely winds and frosts, destructive thunder and lightning, malevolent qi stirring disorder, ghosts and demons misleading the masses, the four borders in turmoil, or the ravages of fierce beasts—when the Son of Heaven or lords of states are unsettled, or when illness, adversity, and inauspicious signs arise, even to the point of peril among the common people—one must petition and give thanks to heaven and earth, moving the profound and boundless firmament, only then can deliverance be attained.\n\nThe Dao of heaven pities all beings, and the mysterious sages extend their compassion. The Most High revealed the scriptures of the *River Chart* and *Luo Writing*—the texts of the tortoise and dragon, the azure script on green carapaces—to bestow upon the emperors. This is the method by which the people may invoke blessings, atone for transgressions, transcend adversity, and resolve calamities. When practiced, it aligns above with the Dao of heaven, and every invocation receives response.",
      "overlap_context": "",
      "start_char": 0,
      "end_char": 290,
      "start_sentence": 0,
      "end_sentence": 13,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 11.273083448410034,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上洞神太元河图三元仰谢仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 1,
      "original_text": "三元仰谢斋，用壬辰、癸巳之日，戌亥之时。 戌亥为天门，蛇对於枢，知变即成龙，龙当其机，识化即入道。 戌亥者，天门之津涂。 辰巳者，龙蛇之枢机也。 感悟求真，必由斯日，故用辰巳日也。 壬者，阳气所生，太一之位也。 故戌亥时升坛告谢。 子时，阳气通生之首也。 道法执象导物，伏鬼制神，御天统人，以十二辰为用。 立德於子，表成於丑，慎衰於寅，戒败於卯，运智虑於辰，用消息於巳，救倾於午，即安於未，防乱於申，开大於酉，归根於戌，太平於亥。 归根则阴气尽，太平则阳气升。 道运则阳升，水柔则道合，故壬癸为胜，顺阳合道故也。 急有祈谢，未及壬辰日者，寅以慎衰，午以救倾，戌以归根。 此三辰日时，急亦可用，合天道矣。 苟能丹苦感彻，必契神明者，余日无爽，不拘於此矣。 未斋三日，扫洒内外，禁绝庶事，约饬僚友，惟务精严，心营备，无忘谨敬也。 太上洞神太元河图三元仰谢仪 坛堂第一 坛堂相近，以便法事。",
      "translated_text": "The Three Primordials’ Reverent Petition Rite is conducted on *ren-chen* and *gui-si* days, during the *xu-hai* hours. *Xu* and *hai* are the Celestial Gate, where the serpent faces the pivot; when one understands change, it becomes a dragon, and when the dragon seizes the moment, one who discerns transformation enters the Dao. *Xu-hai* is the ford of the Celestial Gate, while *chen-si* is the pivot and mechanism of dragon and serpent. To awaken and seek the true, one must follow these days—thus the use of *chen-si* days. *Ren* is where yang qi is born, the station of the Great One. Therefore, the *xu-hai* hours are chosen to ascend the altar and offer thanks.\n\nThe *zi* hour marks the inception of yang qi’s flow. Daoist methods grasp images to guide beings, subdue ghosts, command spirits, govern heaven, and order humanity—employing the twelve earthly branches for their purpose. Virtue is established in *zi*, completion is displayed in *chou*, caution against decline in *yin*, vigilance against failure in *mao*, strategic thought unfolds in *chen*, ebb and flow are applied in *si*, rescue from collapse in *wu*, stabilization in *wei*, prevention of chaos in *shen*, great expansion in *you*, return to the root in *xu*, and great peace in *hai*. Returning to the root exhausts yin qi, while great peace elevates yang qi. When the Dao operates, yang ascends; when water is gentle, it harmonizes with the Dao—thus *ren* and *gui* prevail, for they align with yang and accord with the Dao.\n\nIn urgent cases of prayer or thanksgiving where the *ren-chen* day has not yet arrived, the *yin* hour may be used to guard against decline, *wu* to rescue from collapse, and *xu* to return to the root. These three earthly branches, in their respective days and hours, may also be employed in haste, for they harmonize with the Dao of heaven. If one’s cinnabar sincerity moves the divine, all days become efficacious without strict adherence to these times.\n\nThree days prior to the rite, sweep and purify the inner and outer spaces, abstain from all mundane affairs, and admonish attendants and companions to maintain utmost solemnity. The mind must be fully prepared, with no lapse in reverence and care.\n\n*The Most High’s Cavern-Spirit Great Primordial River Chart: Rites of the Three Primordials’ Reverent Petition*\n**Altar Hall, First Section**\nThe altar hall should be situated nearby to facilitate the ritual proceedings.",
      "overlap_context": "ned.\n\nThe Dao of heaven pities all beings, and the mysterious sages extend their compassion. The Most High revealed the scriptures of the *River Chart* and *Luo Writing*—the texts of the tortoise and dragon, the azure script on green carapaces—to bestow upon the emperors. This is the method by which the people may invoke blessings, atone for transgressions, transcend adversity, and resolve calamities. When practiced, it aligns above with the Dao of heaven, and every invocation receives response.",
      "start_char": 290,
      "end_char": 673,
      "start_sentence": 14,
      "end_sentence": 32,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 12.921243906021118,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上洞神太元河图三元仰谢仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 2,
      "original_text": "阔狭丰俭，随处取足。 宾主房室，勿逼堂墠，食屋沐室，与圊相远。 内外区分，慎无敞露。 若住止迫迮，严加障理，新浄帷幔，苇荐籧蒢。 断隔牢密，勿使烟臭相参也。 斋堂中正面设太上位，左右经宝、师尊及讲诵之所，屏帏案几，香灯炉奁，四周舒陈，皆令整洁也。 堂　位 坛图柱纂，详见黄箓立成仪。 坛　位 太岁　本命　行年　元辰　生月　胎月 游年　三丘　五墓　九幽 宫　　宅　　门　　户　　窗　　床 堂　　房　　井　　灶　　圊　　沟 仓　　库　　园",
      "translated_text": "The dimensions—whether spacious or modest, ample or restrained—should be determined by the available space. The quarters for guests and hosts must not encroach upon the altar hall or its courtyard. The kitchen and bathing chamber should be kept far from the latrine. Inner and outer areas must be distinctly separated, with care taken to prevent any exposure. If the dwelling is cramped, reinforce the partitions with diligence, using fresh and clean curtains, reed mats, and woven screens. Ensure complete separation, allowing no mingling of smoke or odors.\n\nWithin the oratory hall, the central position facing forward is reserved for the Most High. To the left and right, arrange the scriptures and treasures, the master’s seat, and the space for recitation and discourse. Screens, curtains, tables, and stands—along with incense, lamps, censers, and containers—should be arranged neatly around the hall, all kept immaculate.\n\n**Hall Positions**\nFor the detailed layout of the altar diagram and pillar inscriptions, refer to the *Huanglu Licheng Yi*.\n\n**Altar Positions**\nTai Sui | Ben Ming | Xing Nian | Yuan Chen | Sheng Yue | Tai Yue\nYou Nian | San Qiu | Wu Mu | Jiu You\nPalace | Residence | Gate | Door | Window | Bed\nHall | Chamber | Well | Hearth | Latrine | Drain\nGranary | Storehouse | Garden",
      "overlap_context": "ict adherence to these times.\n\nThree days prior to the rite, sweep and purify the inner and outer spaces, abstain from all mundane affairs, and admonish attendants and companions to maintain utmost solemnity. The mind must be fully prepared, with no lapse in reverence and care.\n\n*The Most High’s Cavern-Spirit Great Primordial River Chart: Rites of the Three Primordials’ Reverent Petition*\n**Altar Hall, First Section**\nThe altar hall should be situated nearby to facilitate the ritual proceedings.",
      "start_char": 673,
      "end_char": 902,
      "start_sentence": 33,
      "end_sentence": 46,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 7.912558078765869,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上洞神太元河图三元仰谢仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 3,
      "original_text": "右四十灯，随位安之，各列牌榜。 神位第二 神位之设堂，於庭中平地作墠，方三丈九尺。 应三界九垒。 墠外护净八尺，以绳约之。 四方方然八灯，合三十二灯。 灯高九尺，应九玄三十二天。 次第二墠，方二丈四尺，应二＋四炁。 四方方然七灯，合二十八灯。 灯高五尺，应五星二十八宿。 二十八宿中间，正四方方然一灯，正中央然一灯，又夹二灯。 并高七尺，以应七曜。 又隔七尺，即为天心。 天心方一丈，正中央然十灯，又安二灯。 各高七尺，应台斗。 天心前施一案，不然香，以置大罗之策。 策左又一案，然一香。 策右又一案，然四香。 策之四方各一案，然一香。 墠外正神九十一灯，各高五尺。 太一、十二辰、二十四炁，太岁、本命、行年、元辰、生月、胎月、游年、三丘、五墓、九幽，合六十一灯。 宫宅门户窗床堂房井灶圊沟仓库园，各二灯，合三十灯。 凡一百七十灯。 策用仅柏香材竹等，长一尺二寸，广四寸四分，厚三分。 符板亦然。 皆长九寸，阔一寸八分，厚二分，窍其上端，丝绳穿之； 或悬或阁，随便而用。 符板六十四枚，灯牌二百三枚。 各长七寸，阔一寸，厚二分，悬之。 策一枚六十神，板亦如之。 夫灯以释暗增明，舍阴就阳。 凡用荐席三周，其外步障禁隔，悉取精足也。 所用之物，力可堪者，悉须置之。 堪而不置，是获吝财慢法之罪，怠惰之谪，虽小不原。 立功务德，勇猛为上。 又不得牵引非己之物，及强乞逼借，有忤神明，其咎不赦。 谨而精备者，福降无涯。 自下升高，阶贱成贵，积微至着，炼伪入真，解身中宿根二十八结，度阳九百六之灾。 通究上玄，保长生之乐。 帝王修之，可以神明通感，阴阳交泰，国安民和，无三灾水火兵疫之忧矣。 得不勉哉。 门用长纂八枚，门檐四枚，钉钮悬榜。 门间短纂二十枚，朱绳六十四尺。 纻芒为之。 门榜四枚，广六寸，长五寸，覆翼相称。 西北亥天门，玄书白上。 东南巳地户，黄书朱上。 西南申月门，白书朱上。 东北寅日门。 朱书黑上。 甲子王文卿，乙丑龙季卿，丙寅张仲卿，丁卯司马卿，戊辰季楚卿，己巳何文昌，庚午冯仲卿，辛未王文章，壬申侯博卿，癸酉孙仲房，甲戌展子江，乙亥庞明公。 已上十二神列於北方，始於亥，讫於丑。 丙子邢孙卿，丁丑赵子玉，戊寅虞子卿，己卯石文阳，庚辰尹佳卿，辛巳阳仲公，壬午马子明，癸未吕威明，甲申扈文长，乙酉孔利公，丙戌车元升，丁亥张文通。 已上十二神列於东方，始於寅，讫於辰。 戊子乐石阳，己丑范和卿，庚寅褚进卿，辛卯郭子良，壬辰武雅卿，癸巳史公来，甲午卫上卿，乙未杜仲阳，丙申朱伯众，丁酉臧文公，戊戌范少卿，己亥邓都卿。 已上十二神列於南方，始於巳，讫於未。 庚子阳仲叔，辛丑林卫公，壬寅丘孟卿，癸卯苏他家，甲辰孟非卿，乙巳唐文卿，丙午魏文公，丁未石叔通，戊申范伯阳，己酉成文长，庚戌史子仁，辛亥左子行。 已上十二神列於西方，始於申，讫於戌。 壬子宿上卿，癸丑江汉卿，甲寅明文章，乙卯戴公阳，丙辰霍叔英，丁巳崔巨卿，戊午从元光，己未时通卿，庚申华文阳，辛酉邴元玉，壬戌乐进卿，癸亥左石松。 已上十二神列於中央，绕方丈之外四边各三，始於申，讫於未。",
      "translated_text": "To the right, arrange forty lamps according to their positions, each marked with a placard.\n\n**Second: Arrangement of the Deity Positions**\nFor the deity positions within the hall, create a level altar (*shan*) in the courtyard, measuring three *zhang* and nine *chi* on each side, corresponding to the Three Realms and Nine Ramparts. Beyond the altar, maintain an eight-*chi* purification boundary, marked with a cord. At the four corners, place eight lamps, totaling thirty-two lamps. Each lamp stands nine *chi* high, corresponding to the Nine Mysteries and Thirty-Two Heavens.\n\nNext, construct a second altar measuring two *zhang* and four *chi* on each side, corresponding to the twenty-four *qi*. At its four corners, place seven lamps, totaling twenty-eight lamps. Each lamp stands five *chi* high, corresponding to the Five Stars and Twenty-Eight Constellations. Between the twenty-eight constellations, at the four cardinal directions, place one lamp each, and at the exact center, place one lamp, with two additional lamps flanking them. These stand seven *chi* high, corresponding to the Seven Luminaries.\n\nSeven *chi* beyond this lies the Heavenly Center (*Tianxin*), a square measuring one *zhang* on each side. At its exact center, place ten lamps, with two additional lamps beside them. Each stands seven *chi* high, corresponding to the Dipper. Before the Heavenly Center, set a table where no incense is burned, reserved for the *Da Luo* talisman. To the left of the talisman, place another table with one incense burner. To its right, place a table with four incense burners. At the four directions around the talisman, place one table each with a single incense burner.\n\nBeyond the altar, arrange ninety-one lamps for the principal deities, each five *chi* high. These include:\n- Tai Yi, the Twelve Earthly Branches, and the Twenty-Four *Qi*;\n- Tai Sui, Ben Ming, Xing Nian, Yuan Chen, Sheng Yue, Tai Yue, You Nian, San Qiu, Wu Mu, and Jiu You (sixty-one lamps in total);\n- Two lamps each for the Palace, Residence, Gate, Door, Window, Bed, Hall, Chamber, Well, Hearth, Latrine, Drain, Granary, Storehouse, and Garden (thirty lamps in total).\nIn all, one hundred seventy lamps are used.\n\nThe talismans (*ce*) are made of cypress, fragrant wood, or bamboo, measuring one *chi* and two *cun* in length, four *cun* and four *fen* in width, and three *fen* in thickness. The talisman boards follow the same dimensions, each nine *cun* long, one *cun* and eight *fen* wide, and two *fen* thick, with a hole at the top for threading silk cords. They may be hung or placed as needed. There are sixty-four talisman boards and two hundred three lamp placards, each seven *cun* long, one *cun* wide, and two *fen* thick, to be suspended. One talisman governs sixty deities, and the boards follow the same principle.\n\nLamps dispel darkness and augment light, forsaking yin to embrace yang. Three layers of mats are laid out, and beyond them, screens and barriers are set up, all of the finest quality. Every required item must be prepared to the fullest extent possible. To possess the means yet fail to do so incurs the sin of miserliness and disrespect for the Dao, as well as the punishment of laziness—no transgression, however minor, will be pardoned. In cultivating merit and virtue, fervor is paramount. Furthermore, one must not seize what does not belong to them, nor forcibly beg or coerce loans, lest they offend the divine and incur irredeemable blame. Those who prepare with care and precision will receive boundless blessings. Ascending from low to high, transforming humble to noble, accumulating the subtle to achieve the manifest, refining the false into the true—this dissolves the twenty-eight knots of karmic roots within the body and resolves the nine hundred and six disasters of yang. It penetrates the mysteries of the highest realm, ensuring the joy of long life. If emperors and kings practice this, they may commune with the divine, harmonize yin and yang, secure national peace and popular harmony, and avert the three disasters of flood, fire, and warfare, as well as epidemics. How can one not strive with diligence?\n\nFor the gates, use eight long placards and four eave placards, affixed with nails and loops for hanging signs. Between the gates, place twenty short placards, with sixty-four *chi* of red cord made of ramie fiber. The gate signs measure six *cun* in width and five *cun* in length, with overlapping wings for symmetry.\n\n- **Northwest (Hai) Heavenly Gate**: Black characters on white.\n- **Southeast (Si) Earthly Door**: Yellow characters on red.\n- **Southwest (Shen) Lunar Gate**: White characters on red.\n- **Northeast (Yin) Solar Gate**: Red characters on black.\n\n**Twelve Deities of the North** (arranged from *Hai* to *Chou*):\nJiazi: Wang Wenqing; Yichou: Long Jiqing; Bingyin: Zhang Zhongqing; Dingmao: Sima Qing; Wuchen: Ji Chuqing; Jisi: He Wenchang; Gengwu: Feng Zhongqing; Xinwei: Wang Wenzhang; Renshen: Hou Boqing; Guiyou: Sun Zhongfang; Jiaxu: Zhan Zijiang; Yihai: Pang Minggong.\n\n**Twelve Deities of the East** (arranged from *Yin* to *Chen*):\nBingzi: Xing Sunqing; Dingchou: Zhao Ziyu; Wu Yin: Yu Ziqing; Jimao: Shi Wenyang; Gengchen: Yin Jiaqing; Xinsi: Yang Zhonggong; Renwu: Ma Ziming; Guiwei: Lü Weiming; Jiashen: Hu Wenchang; Yiyou: Kong Ligong; Bingxu: Che Yuansheng; Dinghai: Zhang Wentong.\n\n**Twelve Deities of the South** (arranged from *Si* to *Wei*):\nWuzi: Yue Shiyang; Jichou: Fan Heqing; Gengyin: Chu Jinqing; Xinmao: Guo Ziliang; Renchen: Wu Yaqing; Guisi: Shi Gonglai; Jiawu: Wei Shangqing; Yiwei: Du Zhongyang; Bingshen: Zhu Bozhong; Dingyou: Zang Wengong; Wuxu: Fan Shaoqing; Jihai: Deng Duqing.\n\n**Twelve Deities of the West** (arranged from *Shen* to *Xu*):\nGengzi: Yang Zhongshu; Xinchou: Lin Weigong; Renyin: Qiu Mengqing; Guimao: Su Tajia; Jiachen: Meng Feiqing; Yisi: Tang Wenqing; Bingwu: Wei Wengong; Dingwei: Shi Shutong; Wushen: Fan Boyang; Jiyou: Cheng Wenchang; Gengxu: Shi Ziren; Xinhai: Zuo Zixing.\n\n**Twelve Deities of the Center** (arranged around the perimeter of the one-*zhang* square, three on each side, from *Shen* to *Wei*):\nRenzi: Su Shangqing; Guichou: Jiang Hanqing; Jiayin: Ming Wenzhang; Yimao: Dai Gongyang; Bingchen: Huo Shuying; Dingsi: Cui Juqing; Wuwu: Cong Yuanguang; Jiwei: Shi Tongqing; Gengshen: Hua Wenyang; Xinyou: Bing Yuanyu; Renxu: Yue Jinqing; Guihai: Zuo Shisong.",
      "overlap_context": "and stands—along with incense, lamps, censers, and containers—should be arranged neatly around the hall, all kept immaculate.\n\n**Hall Positions**\nFor the detailed layout of the altar diagram and pillar inscriptions, refer to the *Huanglu Licheng Yi*.\n\n**Altar Positions**\nTai Sui | Ben Ming | Xing Nian | Yuan Chen | Sheng Yue | Tai Yue\nYou Nian | San Qiu | Wu Mu | Jiu You\nPalace | Residence | Gate | Door | Window | Bed\nHall | Chamber | Well | Hearth | Latrine | Drain\nGranary | Storehouse | Garden",
      "start_char": 902,
      "end_char": 2168,
      "start_sentence": 47,
      "end_sentence": 106,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 38.149893045425415,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上洞神太元河图三元仰谢仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 4,
      "original_text": "右六甲直符姓名，各悬所属之灯，书版策，依次书符，题天如左。 太皇黄曾天　 　从官九亿万人 太明玉完天　 　从官九亿万人 清明河童天　 　从官九亿万人 玄胎平育天　 　从官九亿万人 元明文举天　 　从官九亿万人 上明七曜摩夷天　 　从官九亿万人 虚无越衡天　 　从官九亿万人 太极蒙翳天　 　从官九亿万人 右八天位属东方八符。 朱书青气生文，他仿此，八直符黑书。 赤明和阳天　 　从官九亿万人 玄明恭华天　 　从官五亿万人 耀明宗飘天　 　从官五亿万人 竺落皇笳天　 　从官十五亿万人 虚明堂曜天　 　从官九亿万人 观明端静天　 　从官十二亿万人 玄明恭庆天　 　从官十七亿万人 太焕极瑶天　 　从官十八亿万人 右八天位属南方八符。 黄素朱书，八直符黑书。 元载孔升天　 　从官十八亿万人 太安皇崖天　 　从官七亿万人 显定极风天　 　从官十五亿万人 始皇孝芒天　 　从官四亿万人 太皇翁重浮容天　 　从官七亿万人 无思江由天　 　从官七亿万人 上揲阮乐天　 　从官七亿万人 无极昙誓天　 　从官七亿万人 右八天位属西方八符。 黑地白书，八直符黑书。 皓庭霄度天　 　从官五亿万人 渊通元洞天　 　从官五亿万人 太文翰宠妙成天　 　从官五亿万人 太素秀乐禁上天　 　从官五亿万人 太虚无上常融天　 　从官五亿万人 太释玉隆腾胜天　 　从官五亿万人 龙变梵度天　 　从官五亿万人 太极平育贾奕天　 　从官五亿万人 右八天位属北方八符。 青地黑书，八直符黑书。 大罗策文 太上无极至真无上无为大道应感真精大罗梵气虚皇玉灵百八十道君无极世界天师至尊道德众真已得道无量大圣众此四十九字紫书 右一策版竹随时安南方，首北正中，别案檠及香。 此名镇策，细书取容。 题简策法，皆应朱书，忽急促无朱，用墨。 镇策紫书，取通皇极无象，见则吉昌，相生制用，内外和同，各有其趣，慎勿悮换之。 书天画符章。 次题灯如左： 角二，亢四，氏四，房四，心三，尾九，箕四。 已上东方七宿，始辰讫寅。 斗六，牛六，女四，虚三，危三，室二，璧二。 已上北方七宿，始丑讫亥。 奎六，娄三，胃三，勖七，毕八，赀三，参十。 已上西方七宿，始戌讫申。 井八，鬼五，柳八，星七，张六，翼二十二，斡四。 已上南方七宿，始未讫巳。 右二十八宿各悬所属之灯。 日寅卯之间。 月酉戌之间。 岁星卯。 荧惑星午。 太白星酉。 辰星子。 镇星中。 右七曜，各悬所属之灯。 阳明一，阴精二，真人三，玄冥四，丹元五，北极六，天关七，辅星八，弼星九。 右北斗九星名，各悬所属之灯。 上台虚精，中台六淳，下台曲生北斗九星，与些二台十二灯，列於正中，县策居纂之半，钻绳令坚，镇星附之。 太一坛北正中。 十二辰斋所四方。 二十四黑太一之北。 太岁随岁所在。 本命家主一人。 行年同上。 元辰，生月，胎月，游年皆以家主一人年命。 三丘丑上。 五墓姓墓。 九幽合六十一灯。 官屋之正中。 宅所居正中。 门，户，窗有纱钱者。 床荡关正中。 堂内前外前。 房侧厢内外。 井，灶，圊，沟，仓六灯在东。 库北方。 园合三十灯，并前九十一灯。 园灯随所在，无或远者，置门外之东。",
      "translated_text": "The names of the Six Jia Direct Attendants are inscribed, each suspended upon their respective lamps, with written tablets and talismans arranged in sequence. The celestial titles are recorded as follows:\n\n**Great August Yellow-Bright Heaven** – Attendant officials: ninety million myriad persons\n**Great Brilliance Jade-Perfect Heaven** – Attendant officials: ninety million myriad persons\n**Luminous Clarity River-Lad Heaven** – Attendant officials: ninety million myriad persons\n**Mysterious Womb Level-Nurturing Heaven** – Attendant officials: ninety million myriad persons\n**Primal Brilliance Literary-Raised Heaven** – Attendant officials: ninety million myriad persons\n**Upper Brilliance Seven Luminaries Majestic-Barrier Heaven** – Attendant officials: ninety million myriad persons\n**Void Transcending Balance Heaven** – Attendant officials: ninety million myriad persons\n**Grand Ultimate Veiled-Obscurity Heaven** – Attendant officials: ninety million myriad persons\n\nThe above eight heavens pertain to the eight talismans of the East. Inscribed in vermilion with azure qi-generated script; the other talismans follow this pattern, while the eight Direct Attendant talismans are written in black.\n\n**Vermilion Brilliance Harmonious-Yang Heaven** – Attendant officials: ninety million myriad persons\n**Mysterious Brilliance Reverent-Florescence Heaven** – Attendant officials: fifty million myriad persons\n**Radiant Brilliance Ancestral-Fluttering Heaven** – Attendant officials: fifty million myriad persons\n**Bamboo-Falling August-Reed Heaven** – Attendant officials: one hundred fifty million myriad persons\n**Void Brilliance Hall-Shining Heaven** – Attendant officials: ninety million myriad persons\n**Contemplative Brilliance Upright-Tranquil Heaven** – Attendant officials: one hundred twenty million myriad persons\n**Mysterious Brilliance Reverent-Jubilee Heaven** – Attendant officials: one hundred seventy million myriad persons\n**Grand Resplendence Ultimate-Jasper Heaven** – Attendant officials: one hundred eighty million myriad persons\n\nThe above eight heavens pertain to the eight talismans of the South. Inscribed in yellow with vermilion script; the eight Direct Attendant talismans are written in black.\n\n**Primal Capacity Aperture-Ascending Heaven** – Attendant officials: one hundred eighty million myriad persons\n**Grand Peace August-Cliff Heaven** – Attendant officials: seventy million myriad persons\n**Manifest Stability Ultimate-Wind Heaven** – Attendant officials: one hundred fifty million myriad persons\n**Inaugural August Filial-Vigor Heaven** – Attendant officials: forty million myriad persons\n**Grand August Aged-Heavy Floating-Containment Heaven** – Attendant officials: seventy million myriad persons\n**Non-Contemplation River-Flowing Heaven** – Attendant officials: seventy million myriad persons\n**Upper Divination Joyous Heaven** – Attendant officials: seventy million myriad persons\n**Non-Ultimate Cloud-Oath Heaven** – Attendant officials: seventy million myriad persons\n\nThe above eight heavens pertain to the eight talismans of the West. Inscribed on black ground with white script; the eight Direct Attendant talismans are written in black.\n\n**Luminous Court Rosy-Transcendence Heaven** – Attendant officials: fifty million myriad persons\n**Abyssal Penetration Primal-Cavern Heaven** – Attendant officials: fifty million myriad persons\n**Grand Literary Flourishing Wondrous-Accomplishment Heaven** – Attendant officials: fifty million myriad persons\n**Grand Simplicity Elegant-Joy Forbidden-Above Heaven** – Attendant officials: fifty million myriad persons\n**Grand Void Non-Ultimate Constant-Fusion Heaven** – Attendant officials: fifty million myriad persons\n**Grand Release Jade-Elevation Soaring-Victory Heaven** – Attendant officials: fifty million myriad persons\n**Dragon-Transformation Brahman-Transcendence Heaven** – Attendant officials: fifty million myriad persons\n**Grand Ultimate Level-Nurturing Jia-Yi Heaven** – Attendant officials: fifty million myriad persons\n\nThe above eight heavens pertain to the eight talismans of the North. Inscribed on azure ground with black script; the eight Direct Attendant talismans are written in black.\n\n**Great Luo Talismanic Text**\n*The Supreme Non-Ultimate, Utmost Real, Non-Ultimate Non-Action Great Dao Responsive-Inspiration True Essence, Great Luo Brahman-Qi, Void Sovereign Jade Numinosity, One Hundred Eighty Dao Lords, Non-Ultimate World Celestial Master, Most Honored Virtue-Power Host of Perfected Ones, Already Attained the Dao, Immeasurable Great Sages Host.*\n\nThe above forty-nine characters are inscribed in purple. This single talismanic tablet, made of bamboo, is placed facing south at the appropriate time, its head oriented north at the center, on a separate stand with incense. This is called the *Mirrorm Talisman*; the script should be finely rendered to fit. The method for inscribing the bamboo tablets and talismans requires vermilion script; in urgent circumstances where vermilion is unavailable, ink may be used. The *Mirrorm Talisman* is inscribed in purple to communicate with the Imperial Ultimate of the Non-Image. When seen, it brings auspicious prosperity, mutual generation and restraint, inner and outer harmony, each with its proper function. Take care not to misplace or exchange it.\n\n**Inscribing the Celestial Talismans and Drawing the Charts**\n\nNext, the lamps are inscribed as follows:\n\n**Horn**: two; **Neck**: four; **Root**: four; **Chamber**: four; **Heart**: three; **Tail**: nine; **Winnowing Basket**: four.\nThe above are the seven lodges of the East, beginning with *Chen* and ending with *Yin*.\n\n**Dipper**: six; **Ox**: six; **Girl**: four; **Void**: three; **Danger**: three; **House**: two; **Wall**: two.\nThe above are the seven lodges of the North, beginning with *Chou* and ending with *Hai*.\n\n**Straddler**: six; **Harvester**: three; **Stomach**: three; **Horn**: seven; **Net**: eight; **Turtle Beak**: three; **Triaster**: ten.\nThe above are the seven lodges of the West, beginning with *Xu* and ending with *Shen*.\n\n**Well**: eight; **Ghost**: five; **Willow**: eight; **Star**: seven; **Spread**: six; **Wings**: twenty-two; **Chariot Platform**: four.\nThe above are the seven lodges of the South, beginning with *Wei* and ending with *Si*.\n\nThe twenty-eight lodges each have lamps suspended according to their affiliation.\n\n**Sun**: between *Yin* and *Mao*.\n**Moon**: between *You* and *Xu*.\n**Jupiter**: *Mao*.\n**Mars**: *Wu*.\n**Venus**: *You*.\n**Mercury**: *Zi*.\n**Saturn**: center.\nThe seven luminaries each have lamps suspended according to their affiliation.\n\n**Yang Brilliance**: one; **Yin Essence**: two; **Perfected Person**: three; **Mysterious Darkness**: four; **Cinnabar Prime**: five; **North Culmen**: six; **Celestial Pass**: seven; **Assistant Star**: eight; **Aiding Star**: nine.\nThe nine stars of the Northern Dipper, each with lamps suspended according to their names.\n\n**Upper Terrace**: Void Essence; **Middle Terrace**: Sixfold Purity; **Lower Terrace**: Curved Life. The nine stars of the Northern Dipper, along with these two terraces’ twelve lamps, are arranged at the center. The *Mirrorm Talisman* is suspended at the midpoint, its cord firmly tied, with Saturn affixed to it.\n\n**Grand One Altar**: at the north center.\n**Twelve Earthly Branches Purification Sites**: at the four directions.\n**Twenty-Four Black Grand Ones**: to the north of the Grand One.\n**Great Year**: follows its annual position.\n**Original Destiny**: the master of the household, one person.\n**Flowing Year**: same as above.\n**Original Celestial Stem**, **Birth Month**, **Gestational Month**, **Wandering Year**: all based on the master of the household’s year and destiny.\n\n**Three Mounds**: at *Chou*.\n**Five Graves**: at the family’s burial site.\n**Nine Dark Realms**: combined with sixty-one lamps.\n**Official Residence**: at the center.\n**Dwelling**: at the center of the residence.\n**Gate**, **Door**, **Window**: where paper money is hung.\n**Bed Frame**: at the center.\n**Hall**: inside, front, and outer front.\n**Chamber Sides**: inside and outside the wings.\n**Well**, **Hearth**, **Latrine**, **Ditch**, **Granary**: six lamps in the east.\n**Storehouse**: in the north.\n**Garden**: combined with thirty lamps, totaling ninety-one lamps with the previous. Garden lamps are placed according to location; none should be distant, and if necessary, placed outside the gate to the east.",
      "overlap_context": "; Dingwei: Shi Shutong; Wushen: Fan Boyang; Jiyou: Cheng Wenchang; Gengxu: Shi Ziren; Xinhai: Zuo Zixing.\n\n**Twelve Deities of the Center** (arranged around the perimeter of the one-*zhang* square, three on each side, from *Shen* to *Wei*):\nRenzi: Su Shangqing; Guichou: Jiang Hanqing; Jiayin: Ming Wenzhang; Yimao: Dai Gongyang; Bingchen: Huo Shuying; Dingsi: Cui Juqing; Wuwu: Cong Yuanguang; Jiwei: Shi Tongqing; Gengshen: Hua Wenyang; Xinyou: Bing Yuanyu; Renxu: Yue Jinqing; Guihai: Zuo Shisong.",
      "start_char": 2169,
      "end_char": 3540,
      "start_sentence": 107,
      "end_sentence": 195,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 37.93723750114441,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上洞神太元河图三元仰谢仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 5,
      "original_text": "凡十五名，各二灯，无亦勿关。 右列灯符，东向存思，请愿等法。 甲寅，丙寅，戊寅，庚寅，壬寅。 已上列东方之北。 乙卯，丁卯，己卯，辛卯，癸卯。 已上列束方之中。 丙辰，戊辰，庚辰，壬辰，甲辰。 已上列束方之南。 丁巳，己巳，辛巳，癸巳，乙巳。 已上列南方之东。 戊午，庚午，壬午，甲午，丙午。 已上列南方之中。 己未，辛未，癸未，乙未，丁未。 已上列南方之西。 庚申，壬申，甲申，丙申，戊申。 已上列西方之南。 辛酉，癸酉，乙酉，丁酉，己酉。 已上列西方之中。 壬戌，甲戌，丙戌，庚子，庚戌。 已上列西方之北。 癸亥，乙亥，丁亥，己亥，辛亥。 已上列北方之西。 甲子，丙子，戊子，庚子，壬子。 已上列北方之中。 乙丑，丁丑，己丑，辛丑，癸丑。 已上列北方之东。 右六甲各五位同所，谛识却邪，勿妄求正，姓名如前，简书之。 此为北向存请之法。 凡灯版符简采色装画，每令胶固，虽风雨亦不可收，以至竟事。 或有损污，告真而修之，切在严浄，可以致福。 风雨暴至迁灯卮。 南第一太黄皇曾天　 　从官九亿万人 南第二太明玉完天　 　从官十六亿万人 南第三清明何童天　 　从官十七亿万人 南第四玄胎平育天　 　从官十亿万人 南第五元明文举天　 　从官十一亿万人 南第六上明七曜摩夷天　 　从官八亿万人 南第七虚无越衡天　 　从官二十六亿万人 右北方七宿，黑地白书符，取生气，他仿此。 天及谶丹书。 西第一太极蒙翳天　 　从官十亿万人 西第二赤明和阳天　 　从官十八亿万人 西第三玄明恭华天　 　从官五亿万人 西第四曜明宗飘天　 　从官五亿万人 西第五竺落皇笳天　 　从官十五亿万人 西第六虚明堂曜天　 　从官九亿万人 西第七观明端静天　 　从官十二亿万人 右东方七宿，青地黑书符，天及谶丹书。 北第一玄明恭庆天　 　从官十七亿万人 北第二太焕极瑶天　 　从官十八亿万人 北第三元载孔升天　 　从官十八亿万人 北第四太安皇崖天　 　从官七亿万人 北第五显定极风天　 　从官十五亿万人 北第六始皇孝芒天　 　从官四三亿万人 北第七太皇筑重浮容天　 　从官四十三亿万人 右南方七宿，赤地青书符，天及谶丹书。 东第一无思江由天　 　从官九亿万人 东第二上揲阮乐天　 　从官三亿万人 东第三无极昙誓天　 　从官十六亿万人 东第四皓庭宵度天　 　从官十六亿万人 东第五渊通元洞天　 　从官十四亿万人 东第六太文翰宠妙成天　 　从官十二亿万人 东第七太紫秀乐禁上天　 　从官十六亿万人 右西方七宿，白地黄书符，天及谶丹书。 太虚无上常融天　 　从官八十亿万人 右西南方，黄地朱书符，天及谶丹书。 太释玉隆腾胜天　 　从官八十亿万人 右东北方，朱地青书符，天及谶丹书。 龙变梵度天　 　从官八十亿万人 右东南方，黄地白书符，天及谶丹书。 太极平育贾奕天　 　从官八十亿万人 右西北书。 玄地黄书符，天及谶丹书。 诸天之气，凝为星辰，结为山岳，天星通应，以掌人伦。 故河图龙文，演之以示於世。 世人知而修之，可以解灾致福耳。 始乎北者，拜宿为端，心注天路，逆历星官，依度环回，期逢玄佑。",
      "translated_text": "Fifteen names in total, each with two lamps; if absent, do not seal.\nThe lamp talismans listed to the right are to be visualized facing east for invocation and prayer rituals.\n\n*Jia-yin, Bing-yin, Wu-yin, Geng-yin, Ren-yin*—all positioned in the north of the eastern direction.\n*Yi-mao, Ding-mao, Ji-mao, Xin-mao, Gui-mao*—all positioned in the center of the eastern direction.\n*Bing-chen, Wu-chen, Geng-chen, Ren-chen, Jia-chen*—all positioned in the south of the eastern direction.\n*Ding-si, Ji-si, Xin-si, Gui-si, Yi-si*—all positioned in the east of the southern direction.\n*Wu-wu, Geng-wu, Ren-wu, Jia-wu, Bing-wu*—all positioned in the center of the southern direction.\n*Ji-wei, Xin-wei, Gui-wei, Yi-wei, Ding-wei*—all positioned in the west of the southern direction.\n*Geng-shen, Ren-shen, Jia-shen, Bing-shen, Wu-shen*—all positioned in the south of the western direction.\n*Xin-you, Gui-you, Yi-you, Ding-you, Ji-you*—all positioned in the center of the western direction.\n*Ren-xu, Jia-xu, Bing-xu, Geng-zi, Geng-xu*—all positioned in the north of the western direction.\n*Gui-hai, Yi-hai, Ding-hai, Ji-hai, Xin-hai*—all positioned in the west of the northern direction.\n*Jia-zi, Bing-zi, Wu-zi, Geng-zi, Ren-zi*—all positioned in the center of the northern direction.\n*Yi-chou, Ding-chou, Ji-chou, Xin-chou, Gui-chou*—all positioned in the east of the northern direction.\n\nThe six *jia* positions, each with five stations, must be clearly recognized to repel evil; do not seek correctness recklessly. Record names as before, inscribing them on slips.\nThis is the method for visualization and invocation facing north.\n\nAll lamp tablets, talismans, and inscribed slips should be adorned with colors and paintings, firmly glued so that even wind and rain cannot displace them until the ritual’s completion. If damaged or soiled, repair them while invoking the true spirits. Strict cleanliness is essential to attract blessings. If violent wind or rain arrives, move the lamps accordingly.\n\n**South:**\n1. Supreme Yellow Emperor’s *Zeng* Heaven—attended by 900 million officials.\n2. Supreme Bright Jade *Wan* Heaven—attended by 1.6 billion officials.\n3. Clear Bright *He Tong* Heaven—attended by 1.7 billion officials.\n4. Mysterious Womb Nurturing Heaven—attended by 1 billion officials.\n5. Primordial Bright *Wen Ju* Heaven—attended by 1.1 billion officials.\n6. Supreme Bright Seven Luminaries *Mo Yi* Heaven—attended by 800 million officials.\n7. Void Transcending *Heng* Heaven—attended by 2.6 billion officials.\n\nThe seven constellations of the northern direction: talismans inscribed in white on black ground, drawing upon *sheng qi* (vital qi); others follow this pattern. Heaven and prophecies inscribed in cinnabar.\n\n**West:**\n1. Supreme Ultimate Veiled Heaven—attended by 1 billion officials.\n2. Crimson Bright Harmonious Yang Heaven—attended by 1.8 billion officials.\n3. Mysterious Bright Reverent Splendor Heaven—attended by 500 million officials.\n4. Radiant Bright Ancestral *Piao* Heaven—attended by 500 million officials.\n5. *Zhu Luo* August *Jia* Heaven—attended by 1.5 billion officials.\n6. Void Bright Hall Radiant Heaven—attended by 900 million officials.\n7. Observing Bright Upright Serene Heaven—attended by 1.2 billion officials.\n\nThe seven constellations of the eastern direction: talismans inscribed in black on green ground. Heaven and prophecies inscribed in cinnabar.\n\n**North:**\n1. Mysterious Bright Reverent Celebration Heaven—attended by 1.7 billion officials.\n2. Supreme Radiant Ultimate Jade Heaven—attended by 1.8 billion officials.\n3. Primordial Bearing *Kong Sheng* Heaven—attended by 1.8 billion officials.\n4. Supreme Peace August *Ya* Heaven—attended by 700 million officials.\n5. Manifest Fixed Ultimate Wind Heaven—attended by 1.5 billion officials.\n6. Originating August Filial *Mang* Heaven—attended by 4.3 billion officials.\n7. Supreme August *Zhu Chong Fu Rong* Heaven—attended by 4.3 billion officials.\n\nThe seven constellations of the southern direction: talismans inscribed in green on red ground. Heaven and prophecies inscribed in cinnabar.\n\n**East:**\n1. No-Thought *Jiang You* Heaven—attended by 900 million officials.\n2. Supreme *Die Ruan* Joy Heaven—attended by 300 million officials.\n3. Limitless *Tan Shi* Heaven—attended by 1.6 billion officials.\n4. Luminous Court Night Crossing Heaven—attended by 1.6 billion officials.\n5. Abyssal Penetrating Primordial Cavern Heaven—attended by 1.4 billion officials.\n6. Supreme Literary Flourishing Wondrous Completion Heaven—attended by 1.2 billion officials.\n7. Supreme Purple Elegant Joyful Forbidden Upper Heaven—attended by 1.6 billion officials.\n\nThe seven constellations of the western direction: talismans inscribed in yellow on white ground. Heaven and prophecies inscribed in cinnabar.\n\n**Southwest:**\nSupreme Void Supreme Constant Fusion Heaven—attended by 8 billion officials.\nTalismans inscribed in vermilion on yellow ground. Heaven and prophecies inscribed in cinnabar.\n\n**Northeast:**\nSupreme Release Jade Ascending Triumph Heaven—attended by 8 billion officials.\nTalismans inscribed in green on red ground. Heaven and prophecies inscribed in cinnabar.\n\n**Southeast:**\nDragon Transformation Brahman Crossing Heaven—attended by 8 billion officials.\nTalismans inscribed in white on yellow ground. Heaven and prophecies inscribed in cinnabar.\n\n**Northwest:**\nSupreme Ultimate Nurturing *Jia Yi* Heaven—attended by 8 billion officials.\nTalismans inscribed in yellow on black ground. Heaven and prophecies inscribed in cinnabar.\n\nThe qi of all heavens congeals into stars and coalesces into mountains. Celestial stars correspond to human affairs, governing the order of humanity. Thus, the *He Tu*’s dragon patterns unfold to reveal this to the world. Those who know and cultivate it may dissolve calamities and attract blessings.\n\nThe beginning lies in the north: bowing to the constellations as the starting point, the mind focuses on the celestial path, retracing the stellar officials in reverse order, following their degrees in circular return, awaiting the encounter with mysterious blessings.",
      "overlap_context": "Gate**, **Door**, **Window**: where paper money is hung.\n**Bed Frame**: at the center.\n**Hall**: inside, front, and outer front.\n**Chamber Sides**: inside and outside the wings.\n**Well**, **Hearth**, **Latrine**, **Ditch**, **Granary**: six lamps in the east.\n**Storehouse**: in the north.\n**Garden**: combined with thirty lamps, totaling ninety-one lamps with the previous. Garden lamps are placed according to location; none should be distant, and if necessary, placed outside the gate to the east.",
      "start_char": 3540,
      "end_char": 4943,
      "start_sentence": 196,
      "end_sentence": 272,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 32.22472882270813,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上洞神太元河图三元仰谢仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 6,
      "original_text": "凡拜四维，各十二拜。 大罗策及符版灯简，诸天位号，与东向法并同。 所书简画符，悉当春东、夏南、秋西、冬北，向王洁净，烧香书书讫，当悬策之前。 师盥漱向王，临目握固存神，列符简於案上，叩齿三十二通，咽液三十二过，敕符咒曰： 下游上升九玄佑，黄奕始通神气事竟，收符策，存神如前，又咒曰：若风雷之变，公私之急，暂收符策，不须敕咒。 行善守玄魂魄正，三天降福九君令。 策中从官人数，变化随时，春十夏百，秋千冬万，四季同亿，五化周徧。 自天子至于庶人，可通用亿数为胜。 其数东九、南三、西七、北五，此为气数。 子庚丑辛，值七为金，寅戊卯己，得三为火，此五行之气数也。 故东方九气青天矣。 修此斋者，经云：一者存思定心业也，二者祝愿习口业也，三者拜礼改身业也。 以善易恶，惟在至诚，三业既悛，百福斯至，可不务哉。 方坛或墠，使外方五十五尺，应罗天大衍之数。 纂高丈二，门广五尺，散纂九尺，门榜书处，地方三寸三分。 四方及中，施六十灯，各高六尺。 大约灯可用二百三十，若地狭力贫，促令至少，亦须三十二枚，不可减矣。 详择吉辰，肃备法物，招结道友，延请高流。 皆须澡浴，鲜洁衣裳，至斋所前。 三日却荤污，断外事，一心清净，以俟修奉。 杂役之者不得多，人多则谊聒，必择修谨敬慎者，周事而已。 更直更息，不得俱卧。 侍香芬馥，使昼夜不绝。 侍灯明彻，令达旦扬辉。 斋官平旦供糜粥，正中蔬食，必令素浄甘鲜，不得用血腥荤杂之物，可甘自熟之果，勿啖向王之菜。 宾主相率，在於翘勤，谦恳为上。 此斋无署职，宿启只以朝中二时。 如灵宝法，礼方启告，至夕即大谢。 先入户咒曰： 三元正气，入我身中，通达所启，皆得上闻。 毕，次华夏赞，引入赞颂，旛节列止坛前，出亦如之。 入坛第三 入坛以亥后。 众官自斋堂依位庠序，赞咏导引，至亥上天门。 法师咒讫，入纂内，左巡天外一周，至戌，入环三光一周。 法师於本位立，众官绕三光至南面，对北正立。 都讲唱，各礼师，存念如法。 思神第四 法师鸣法鼓三十二通，临目内观，先存三宝，次存受法三师，次存三一，次存三万六千神，罗列内外，备卫身心，谛念三十三天，七十四方，想见无极神气、云彩絪缊，与天官地司，九府七曜、五行六甲、土皇洞灵、一切真仙、将吏兵士、职宰典者、直符直事，一时云集，满於空中。 周绕坛墠，齐整肃然。 愿今归命天尊，宾主蒙恩，一切存亡，咸荷福佑。 次都讲唱，鸣法鼓三十二通。 法师鸣鼓讫，咽液三十二过，跪上香。 上香第五 法师於策案侧一案四炉中上香，三十三过。 一炉六捻，一炉十六捻，一炉八捻，一炉三捻。 毕，起立。 众官二人为侍香，从地户入，取四香炉。 一仍出天门，於众官前行香。 人各三捻，上香竟，侍香从天门入，置炉本处，出地户，还本位。 次都讲唱，各称名位，次发炉咒曰。 发炉第六 上清玄都大洞三景弟子无上三洞法师，奉行太玄河图大谢法事，某岳某帝先生，小兆真人臣某等，谨上请太上玄元太上无极至真、无上无为大道应感真精、大罗虚无自然紫虚妙有无为无碍玄青元黄始白祖气、高上大有玉清上清玄都玉京七宝紫微太清太极洞冥小有三元四始五重九极紫阳至真玄精神气、领圣官君、统真神吏、主仙灵司、总录典者、左右龙虎骑、侍香飞龙玉童、传言绣衣玉女、三界直符、诸天直事、诸地幽僚、诸水玄职、诸土皇执事、诸洞府邮驿、诸日月星宿山岳溪谷池泽河海溟汉川济江淮泗渎九宫六甲诸方使者、有漏无漏出世在世无量无边无鞅境界，及此间土地里域真官正神，并出严装。",
      "translated_text": "For the Four Cardinal Directions, perform twelve bows each. The *Da Luo* talismanic writs, inscribed tablets, lamp slips, and titles of the celestial ranks follow the same method as the east-facing rite. The slips and talismans inscribed must face east in spring, south in summer, west in autumn, and north in winter, oriented toward the Sovereign in purity. After burning incense and completing the inscriptions, suspend them before the talismanic writs.\n\nThe master washes and rinses, facing the Sovereign, closes his eyes, clenches his fists, and visualizes the spirits. He arranges the talismans and slips upon the altar table, taps his teeth thirty-two times, swallows saliva thirty-two times, and recites the talisman incantation:\n\n*\"Descend and ascend, the Nine Mysterious Blessings;\nThe Yellow Radiance first connects the divine qi—\nthe rite is complete.\"*\n\nHe then gathers the talismans and writs, visualizing the spirits as before, and recites another incantation:\n\n*\"Should wind and thunder transform, or public and private matters press,\ntemporarily gather the talismans and writs—no need for incantation.\nCultivate goodness, guard the Mysterious, rectify hun and po;\nthe Three Heavens bestow blessings, the Nine Lords command.\"*\n\nThe number of attending officials in the writs changes with the seasons: ten in spring, a hundred in summer, a thousand in autumn, ten thousand in winter, and a hundred million in all four seasons, with the Five Transformations circulating throughout. From the Son of Heaven to the common people, all may employ the hundred-million number for superiority.\n\nThe numerical correspondences are: nine in the east, three in the south, seven in the west, and five in the north—these are the qi numbers. *Zi* and *Geng*, *Chou* and *Xin* align with seven as Metal; *Yin* and *Wu*, *Mao* and *Ji* align with three as Fire—these are the qi numbers of the Five Phases. Thus, the east’s nine qi form the Azure Heaven.\n\nFor those who perform this retreat, the scripture states: first, visualization to stabilize the mind’s karma; second, prayer and vows to cultivate the mouth’s karma; third, bowing and rites to transform the body’s karma. Replacing evil with good depends solely on utmost sincerity. Once the Three Karmas are reformed, a hundred blessings will arrive—how can one not strive for this?\n\nThe square altar or ritual space should measure fifty-five feet on each outer side, corresponding to the *Da Luo* Heaven’s *Dayan* number. The altar’s height is one *zhang* and two *chi*, with gates five *chi* wide. The scattered altars are nine *chi* wide, and the gate plaques are inscribed in a space three *cun* and three *fen* square. In the four directions and the center, place sixty lamps, each six *chi* tall. Generally, around two hundred thirty lamps may be used; if the space is narrow or resources limited, reduce them to no fewer than thirty-two.\n\nChoose an auspicious time, prepare the ritual implements, gather Daoist companions, and invite esteemed masters. All must bathe, wear fresh and clean garments, and arrive at the retreat site beforehand. For three days, abstain from meat and impurities, sever worldly affairs, and maintain a single-minded purity to await the rites.\n\nThose assisting in miscellaneous tasks should not be numerous—too many cause disturbance. Select only those who are reverent, cautious, and respectful to fulfill their duties. Rotate shifts for rest, ensuring no one sleeps simultaneously. The incense attendants must keep the fragrance rich, day and night unbroken. The lamp attendants must ensure brightness, their radiance extending until dawn.\n\nAt dawn, the retreat officers offer congee; at midday, vegetarian meals—all must be pure, fresh, and sweet, free from blood, meat, or impure ingredients. Only naturally ripened fruits may be used; do not consume vegetables facing the Sovereign. Hosts and guests alike must be diligent and earnest, with humility as the highest virtue.\n\nThis retreat has no official positions; petitions are made only at the two court audiences of dawn and dusk. As in the *Lingbao* rites, bow to the directions and make announcements; by evening, offer grand thanks.\n\nBefore entering the chamber, recite the incantation:\n\n*\"The Primordial Qi of the Three Origins enters my body,\ncommunicating all petitions to be heard above.\"*\n\nAfter completion, proceed with the *Huaxia* hymn. Lead the procession with praises, and arrange the banners and staffs before the altar. The exit follows the same procedure.\n\n**Entering the Altar (Third Rite)**\nEnter the altar after the *Hai* hour. The assembled officers proceed from the retreat hall in orderly ranks, chanting and leading the way to the Celestial Gate at the *Hai* hour. After the master recites the incantation, he enters the altar enclosure, circumambulates the outer heaven once to the left, reaching *Xu*, then circles the Three Luminaries once. The master stands at his position, while the officers circumambulate the Three Luminaries to the south, facing north and standing upright. The cantor intones, and each bows to the master, visualizing as prescribed.\n\n**Visualizing the Spirits (Fourth Rite)**\nThe master strikes the ritual drum thirty-two times, closes his eyes, and inwardly visualizes: first the Three Treasures, then the Three Masters who transmitted the rites, then the Three Ones, then the thirty-six thousand spirits, arrayed within and without, guarding body and mind. He clearly envisions the thirty-three heavens, the seventy-four directions, and beholds the boundless divine qi, clouds swirling in harmony, along with the celestial officials, earthly administrators, the Nine Palaces, Seven Luminaries, Five Phases, Six *Jia*, Earth Sovereign, Cavern Spirits, all perfected immortals, generals, officers, soldiers, functionaries, and attendants—all simultaneously gathering in the void, encircling the altar in solemn order.\n\nHe prays: *\"Today, we submit to the Heavenly Worthy; may hosts and guests receive grace, and all, living and deceased, be blessed with fortune.\"*\n\nNext, the cantor intones and strikes the ritual drum thirty-two times. The master, having finished striking the drum, swallows saliva thirty-two times and kneels to offer incense.\n\n**Offering Incense (Fifth Rite)**\nThe master offers incense at the four burners beside the writ table, thirty-three times in total: six pinches in one burner, sixteen in another, eight in another, and three in the last. Upon completion, he rises.\n\nTwo officers serve as incense attendants, entering through the Earth Gate to retrieve the four incense burners. One exits through the Celestial Gate, offering incense before the assembled officers. Each offers three pinches. After the incense offering, the attendants re-enter through the Celestial Gate, return the burners to their original places, exit through the Earth Gate, and resume their positions.\n\nNext, the cantor intones, and each states their name and position, then recites the incense-burner incantation:\n\n**Kindling the Burner (Sixth Rite)**\n*\"The Supreme Clarity, Mysterious Capital, Great Cavern, Three Radiance disciple, the Most High Three Caverns Master, performing the Great Mystery *He Tu* Grand Thanksgiving Rites, the Perfected of [specific] Mountain and [specific] Emperor, the Lesser Servant of the Realized, [Name], humbly invokes:\nthe Supreme Venerable, Primordial Lord of the Limitless, the Most High and Unconditioned, the Great Dao’s Responsive Essence of Truth;\nthe Great *Luo*’s Void and Spontaneous, Purple Void’s Wondrous Existence, the Unconditioned and Unobstructed, Primordial Azure and Primordial Yellow, the White Ancestral Qi;\nthe Highest Great Possession, Jade Clarity, Highest Clarity, Mysterious Capital, Jade Capital, Seven Treasures, Purple Tenuity, Grand Clarity, Supreme Ultimate, Cavern Obscurity, Lesser Possession, Three Origins, Four Beginnings, Five Layers, Nine Ultimates, Purple Yang Perfected Spirits;\nthe Divine Qi, leading the Sacred Officers and Lords, governing the Perfected Spirits and Officers, presiding over the Immortal Administrations, recording the Registers, the Left and Right Dragon-Tiger Riders, the Jade Lads Attending Incense and Flying Dragons, the Jade Maidens in Embroidered Robes Transmitting Words, the Three Realms’ Attendants, the Celestial and Earthly Officers, the Dark Ministers of the Waters, the Earth Sovereigns’ Functionaries, the Cavern Palaces’ Couriers, the Sun, Moon, and Stars, the Mountains, Valleys, Streams, and Gorges, the Pools, Marshes, Rivers, and Seas, the Vast and Boundless Waters, the Nine Palaces, Six *Jia*, and Envoys of All Directions;\nthe conditioned and unconditioned, the world-transcending and worldly, the boundless and immeasurable realms;\nand the local earthly domain’s Perfected Officials and True Spirits—\nall arrayed in solemn attire.\"*",
      "overlap_context": ". Celestial stars correspond to human affairs, governing the order of humanity. Thus, the *He Tu*’s dragon patterns unfold to reveal this to the world. Those who know and cultivate it may dissolve calamities and attract blessings.\n\nThe beginning lies in the north: bowing to the constellations as the starting point, the mind focuses on the celestial path, retracing the stellar officials in reverse order, following their degrees in circular return, awaiting the encounter with mysterious blessings.",
      "start_char": 4943,
      "end_char": 6349,
      "start_sentence": 273,
      "end_sentence": 325,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 44.27559947967529,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上洞神太元河图三元仰谢仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 7,
      "original_text": "又请东极大夏兵九万人，南极铜头铁额兵三万人，西极金刚敢武力士七万人，北极大项大甲神兵五万人，中央食鬼铁面兵十二万人。 又请九圣九真九仙兵马各九亿万骑，一时齐集，侍卫坛墠。 臣等克以某元吉之夜，钦奉皇帝词忱，沥捆励诚，烧香立斋，礼谢忏祈，谨以启闻。 愿荡涤妖氛，请降真气，流洒玄泽，浃降皇帝及臣等身中。 腾臣所启，众愿允遂，家国蒙恩，即得上御太上至真虚皇玉帝御前。 礼三十二天第七 次都讲唱曰： 臣等至心归命太黄皇曾天帝君， 臣等至心归命太明玉完天帝君， 臣等至心归命清明何童天帝君， 臣等至心归命玄胎平育天帝君， 臣等至心归命元明文举天帝君， 臣等至心归命上明七曜摩夷天帝君， 臣等至心归命虚无越衡天帝君， 臣等至心归命太极蒙翳天帝君， 臣等至心归命赤明和阳天帝君， 臣等至心归命玄明恭华天帝君， 臣等至心归命耀明宗飘天帝君， 臣等至心归命竺落皇笳天帝君， 臣等至心归命虚明堂耀天帝君， 臣等至心归命观明端静天帝君， 臣等至心归命玄明恭庆天帝君， 臣等至心归命太焕极瑶天帝君， 臣等至心归命元载孔升天帝君， 臣等至心归命太安皇崖天帝君， 臣等至心归命显定极风天帝君， 臣等至心归命始皇孝芒天帝君， 臣等至心归命太皇翁重浮容天帝君， 臣等至心归命无思江由天帝君， 臣等至心归命上揲阮乐天帝君， 臣等至心归命无极昙誓天帝君， 臣等至心归命皓庭霄度天帝君， 臣等至心归命渊通元洞天帝君， 臣等至心归命太文翰宠妙成天帝君， 臣等至心归命太素秀乐禁上天帝君， 臣等至心归命太虚无上常融天帝君， 臣等至心归命太释玉隆腾胜天帝君， 臣等至心归命龙变梵度天帝君， 臣等至心归命太极平育贾奕天帝君，若请恩，从方始者，随宿依度，向东始者依方气数，各住之。 臣等至心归命太上无极至真、无上无为大道应感真精、大罗梵气虚皇玉灵百八十道君、无极世界天师至尊、道德众真、已得道无量大圣众，一切正真诸君圣人。 一拜。 忏告第八",
      "translated_text": "We further invoke the ninety thousand troops of the Great Xia from the Eastern Ultimate, the thirty thousand bronze-headed, iron-browed warriors from the Southern Ultimate, the seventy thousand Vajra Valiant Warriors of the Western Ultimate, the fifty thousand great-necked, great-armored divine soldiers of the Northern Ultimate, and the one hundred twenty thousand iron-faced ghost-devouring troops of the Central Ultimate. We also invoke the nine billion myriad cavalry of the Nine Sages, Nine Perfected, and Nine Immortals, all to assemble at once and stand guard around the altar precinct.\n\nOn this most auspicious night of [specific date], we, your ministers, reverently receive the Emperor’s devout command, prostrating ourselves in earnest sincerity. We burn incense, establish the fast, perform rites of gratitude, repentance, and supplication, and humbly present this petition. May malevolent vapors be swept away, true *qi* descend, and mysterious blessings flow and permeate the Emperor’s person and our own. May the prayers we raise be fulfilled, the state and household receive grace, and this petition ascend before the August Jade Emperor of the Supreme Void, the Most High and Perfectly Real.\n\n**Rite of the Thirty-Two Heavens, Seventh Recitation**\nThe Precentor intones:\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Great Yellow *Huangzeng* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Great Bright *Yuwang* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Clear Bright *Hetong* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Mysterious Womb *Pingyu* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Primordial Bright *Wenju* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Upper Bright *Qiyao Moye* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Void Transcending *Yueheng* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Supreme Ultimate *Mengyi* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Vermilion Bright *Heyang* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Mysterious Bright *Gonghua* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Radiant Bright *Zongpiao* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Bamboo Grove *Huangjia* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Void Bright *Tangyao* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Contemplative Bright *Duanjing* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Mysterious Bright *Gongqing* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Great Resplendent *Jiyao* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Primordial Ascent *Kongsheng* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Great Peace *Huangya* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Manifest Fixed *Jifeng* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Primordial Filial *Xiaomang* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Great August *Wengchong* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Thought-Free *Jiangyou* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Upper *Die* *Ruanle* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Limitless *Tanshi* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Luminous Court *Xiaodu* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Abyssal Penetrating *Yuandong* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Great Literary *Hanmiao* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Supreme Refined *Xiule* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Great Void *Changrong* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Great Release *Yulong* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Dragon-Transforming *Fandu* Heaven.\nWe, with utmost sincerity, take refuge in the Lord Emperor of the Supreme Ultimate *Jiayi* Heaven.\n\nShould grace be granted, those who begin from the eastern direction shall follow the stellar lodges and degrees, while those who commence from the east shall align with the directional *qi* and numerology, each abiding in their place.\n\nWe, with utmost sincerity, take refuge in the Supreme Limitless and Perfectly Real, the Unsurpassed and Non-Acting Dao, the Responsive and True Essence, the Great Brahma *qi* of the Jade Clarity of the Boundless Heaven, the Heavenly Master of the Limitless Realm, the Perfected of the Dao and Virtue, the Immeasurable Great Saints who have attained the Way, and all the Orthodox and True Lords and Sages.\n\nOne bow.\n**Eighth Repentance**",
      "overlap_context": "inisters of the Waters, the Earth Sovereigns’ Functionaries, the Cavern Palaces’ Couriers, the Sun, Moon, and Stars, the Mountains, Valleys, Streams, and Gorges, the Pools, Marshes, Rivers, and Seas, the Vast and Boundless Waters, the Nine Palaces, Six *Jia*, and Envoys of All Directions;\nthe conditioned and unconditioned, the world-transcending and worldly, the boundless and immeasurable realms;\nand the local earthly domain’s Perfected Officials and True Spirits—\nall arrayed in solemn attire.\"*",
      "start_char": 6349,
      "end_char": 7214,
      "start_sentence": 326,
      "end_sentence": 367,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 22.317851066589355,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上洞神太元河图三元仰谢仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 8,
      "original_text": "跪伏叩头，唯在精志，不用兔冠散发。 上清玄都大洞三景弟子，无上三洞法师，奉行太玄河图朝忏法事，某岳某帝先生，小兆真人臣某等，谨同诚上启无上无先无为无极大罗梵气虚寂玄精至真、太上无极大道、道中之道神明君、玉皇上帝、三十二天帝君、三十九上真、十方五司、王公丞相、上宰辅弼疑丞、罗天垒地诸山．诸水诸日月星宿、诸土皇洞府天师至尊、得道众圣、应感尊圣、过去当来见在得道无量正真，巨亿世界无鞅数众、一切神仙诸灵官。 某等尘凡贱陋，智识昏蒙，叨荷宿因，躬逢道化，早参真教，获奉玄经。 灵贶所覃，欢感罔极。 但以明科奖善，听许立功为先，佐国度人，俾效诚节，未能固栖山之操，隆隐世之功。 常惧运终受责幽夜，负天真之训违，大道之恩，晷景易迁，寸效难立，敢缘慈贷之泽，誓竭丹心，谨与同志等，沐炼形神，束身归命。 伏愿至真众圣，垂哀宥之慈，许以自新，遂其忏请。 况奉辞旨，敢不上闻有辞即读，无辞即云秉心回向，愿悯所陈。 皇帝，以只荷玄休，仰应皇运，居四大之重，握万化之机。 业业兢兢，昼乾夕惕，窃虑功亏抚御，未洽神明，绝塞穷荒，莫孚恩信。 兵戈水火，旱蝗疫毒，妖气鸷暴，犹困烝黎，震悼之怀，若履冰炭，思倾丹嫌，上告玄穹。 某官以积善所钟，预蒙真佑，而处身浊俗，混迹尘秽，乖五常修省之仪，爽四序保和之妙。 动贻悔吝，累结尤违，不自觉知，未尝忏涤。 虑积生往世，或构罪瑕，肆意任心，或成殃衅，凡情罔测，神道难知，罪目贯盈，而兴造不息。 上不敬天道，下不信鬼神，违戾阴阳，悖乱神理。 前愆未忏，后恶又加，轮转海深，重沓山积。 又五行代谢，灾福不常，三命循环，吉凶相倚，星辰躔纬，有临照之期，昼夜晦明，有升沦之数。 或前生今世，宿有冤仇，或阳景阴关，犹逢债讼，或己身所犯，或先远殃流，无量无边，不可忆识。 臣等擢质太阳，处身道运，得以尘秽，参奉洞真，三洞金书，九天玉笈，炼景胎元之妙，凝神抱一之规，凤气龙图，回年驻景，朝元复命，证圣超凡，历代所传，万年所宝，师资开悟，咸得窥临。 地耳庸襟，值天章之宛奥； 蜉蝣朝菌，识椿寿之延洪。",
      "translated_text": "Kneeling prostrate, knocking our heads to the ground, we focus our essence and will, without donning rabbit crowns or loosening our hair.\n\nDisciples of the Three Luminaries of the Great Cavern of the Mysterious Capital of Supreme Clarity, Supreme Masters of the Three Caverns, we, who perform the rites of repentance and audience according to the *Tai Xuan He Tu*, the Mountain Lord of [such-and-such] Peak, the Emperor Lord of [such-and-such] Realm, and the Lesser Omen Perfected, your humble servants [Name] and others, with utmost sincerity jointly address and supplicate the Unsurpassed, Unprioritized, Non-Acting, and Limitless Great Brahma *qi* of the Void and Tranquil Mysterious Essence, the Supreme Limitless Dao, the Divine Lord of the Dao within the Dao, the Jade Emperor, the Thirty-Two Heavenly Lords, the Thirty-Nine Supreme Perfected, the Ten Directions and Five Offices, the Kings and Chancellors, the High Ministers and Assistants, the Barrier-Heaven and Rampart-Earth, all mountains, all waters, all suns, moons, and stellar lodges, the Heavenly Masters of all grotto-heavens and palaces, the host of Perfected and Saints who have attained the Dao, the Responsive and Venerable Saints, the immeasurable and orthodox Perfected of the past, present, and future across boundless worlds and innumerable multitudes, and all divine immortals and spirit officials.\n\nWe, dust-bound and base, dull in wisdom and perception, have by karmic fortune encountered the transformative power of the Dao, early embraced the true teachings, and been granted the sacred scriptures. Overwhelmed by the grace bestowed upon us, our joy and gratitude know no bounds. Yet, as the luminous statutes reward goodness and permit merit-making as a priority, we are called to assist the state and deliver the people, to offer our sincerity and devotion. However, we have failed to firmly uphold the resolve of mountain-dwelling reclusion or to elevate the merit of withdrawing from the world. Constantly fearing the end of our allotted span and the reproach of the dark night, we have betrayed the teachings of the Heavenly Perfected and the grace of the Great Dao. Time slips away, and our meager contributions remain unfulfilled. Relying on the compassionate mercy of forgiveness, we pledge our utmost sincerity and, together with like-minded companions, purify body and spirit, binding ourselves in devotion and submission.\n\nWe humbly beseech the host of Perfected and Saints to bestow their merciful indulgence, allowing us to renew ourselves and fulfill our repentance. Moreover, as we adhere to the edicts, we dare not withhold our words: if there are words, we shall recite them; if there are none, we shall declare our hearts’ redirection, praying for compassion upon our supplications.\n\nThe Emperor, who bears the profound blessings of the Mysterious and aligns with the celestial mandate, shoulders the weight of the Four Great [Elements] and holds the pivot of the myriad transformations. With reverent caution, he remains vigilant day and night, yet privately fears that his governance may fall short, failing to harmonize with the divine, leaving remote frontiers and destitute lands bereft of grace and trust. Wars, floods, fires, droughts, locusts, plagues, and poisons; malevolent *qi*, fierce beasts, and violent calamities still afflict the people. His heart trembles with dread, as though treading upon ice and embers, and he yearns to pour out his sincerest devotion, supplicating the Mysterious Heavens.\n\nWe officials, endowed with accumulated goodness and favored by the true blessings, yet dwell in the filth of the mundane world, our traces mingling with the dust and defilement. We have strayed from the rites of cultivating the Five Constants and reflecting upon ourselves, and neglected the subtle harmony of preserving the Four Seasons. Our actions have bred regrets and transgressions, layering faults and errors. Unaware and unheeding, we have never performed repentance and purification. We fear that in past lives, we may have accrued faults and transgressions, or, yielding to the whims of the heart, brought about misfortune and strife. Mortal sentiments are inscrutable, and the ways of the divine are unfathomable. Our sins, like threads strung together, have amassed without cease. We have shown no reverence for the Heavenly Dao, no faith in ghosts and spirits, defied the principles of *yin* and *yang*, and disrupted the divine order. Past transgressions remain unrepented, and new wrongs are added, our karmic debt as deep as the sea, as towering as mountains. Moreover, the Five Phases alternate, and fortune and misfortune are inconstant; the Three Destinies cycle, and good and ill fortune intertwine. The stars and constellations follow their courses, with appointed times of influence; day and night, darkness and light, hold the reckoning of ascent and descent. We may have inherited enmity from past lives or this existence, or encountered karmic debts in the interplay of light and shadow. We may have incurred faults ourselves, or inherited the calamities of distant ancestors—boundless and immeasurable, beyond recall or reckoning.\n\nWe, your servants, endowed with the essence of the Great Yang, dwelling within the course of the Dao, though tainted by the dust of the world, have been permitted to partake in the mysteries of the Cavern Realms. The Golden Scriptures of the Three Caverns, the Jade Tablets of the Nine Heavens, the wondrous arts of refining the luminous embryo and the primordial origin, the disciplines of congealing spirit and embracing the One, the Dragon and Phoenix Charts that reverse aging and arrest time, the practices of audience with the origin and restoration of destiny, the attainment of sagehood and transcendence of the mundane—all these, transmitted through generations and treasured for ten thousand years, have been revealed to us through the guidance of masters, and we have been granted glimpses of their profundities. Though our ears are dull and our hearts unworthy, we have encountered the hidden marvels of the celestial canon; though ephemeral as mayflies and morning mushrooms, we have glimpsed the vast longevity of the *chun* tree.",
      "overlap_context": " directional *qi* and numerology, each abiding in their place.\n\nWe, with utmost sincerity, take refuge in the Supreme Limitless and Perfectly Real, the Unsurpassed and Non-Acting Dao, the Responsive and True Essence, the Great Brahma *qi* of the Jade Clarity of the Boundless Heaven, the Heavenly Master of the Limitless Realm, the Perfected of the Dao and Virtue, the Immeasurable Great Saints who have attained the Way, and all the Orthodox and True Lords and Sages.\n\nOne bow.\n**Eighth Repentance**",
      "start_char": 7214,
      "end_char": 8048,
      "start_sentence": 368,
      "end_sentence": 388,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 30.607556104660034,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上洞神太元河图三元仰谢仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 9,
      "original_text": "餐味至音，踊跃忘倦。 必谓九清三境，有朝拜之期，日阙星津，有超腾之望。 而昏愚积习，识性易迷，沦溺罪河，漂沈秽海，耽染声利，留滞繁华，舍正徇邪，构造诸恶。 或轻侮圣典，疑毁真灵。 或窃盗神书，传授非道。 或规逐财色，贪冒浮荣，外假清虚，内亏真正。 或依托三宝，营己奉私，受人崇施，不修功德，侵欺常住，诬调神明。 或诈识星文，干知凶吉，自作一法，隳背典常，日积月深，永不知觉。 或内乖存注，外阙秉修，渎乱三宫，昏翳八景。 赤子有沦胥之痛，丹田有蒙塞之悲。 六气失和，百关或壅。 是以愆能招祸，德可消灾，而怨道不慈，疑神不佑。 舍本逐末，曾未忏除，渺渺生津，追望何及。 至有崇修城阙，制创池隍，经行官任，卜宅相居，土木兴工，幽明触犯。 或侵伤土府，或摧坏丘坟。 或残毁神墟，暴害灵迹，穿凿福地，涸竭泉源，秽污江河，反违天地。 或前生累世轮转受身，亿劫以来，莫知终始。 或曾居尊位，无道无慈。 或为人臣子，不忠不孝。 或残害物命，以养己身。 或故杀误伤，恣为罪犯。 或因行讨伐，凭公挟私，玉石俱焚，曾无恻隐。 贤愚齐陨，岂有矜嗟。 致使蠢类无依，人鬼咸痛，以兹前过，流逮此身。 或九祖七玄先亡眷属，幽冥负责，延累子孙。 或坟垄不宁，魂神悲怨，因为注讼，亦致凶衰。 况乾坤有刑德之神，天地有司察之吏，阴阳有绳非之目，曹僚有主过之官。 善恶必书，纤毫不漏，一失寿域，永陷罪庭，万劫不还，良可悲念。 又常情之内，暗惑者多见，为善者致灾，即谓修善无益。 不知前世之余殃未尽，殃尽则福来。 见为恶者安宁，即谓为恶无损，不知前世之余福未尽，福尽即祸随。 遂得逞肆，胸襟纵横，任意沈於冥夜，众苦备婴。 自非大道流光，永乖生路，伏闻玄经垂训，开首悔之门，一旬精修，则太清却其一刻。 二时不懈，则上清录其善功。 三年启叩，则玉清除其众罪。 诸天悯世，万圣延恩。 委曲诱其迷津，丁宁示其溺丧。 跃龙鱼以绿图朱字，现龟马以玄检青文。 出谢灾迁善之书，着度世修生之诀。 证之则常乐，体之则成真。 隆善贷之仁，弘无尽之祚，勤行克念，必果安全。 皇帝仰缘河洛品文，玄元圣旨，归依稽首，忏罪希恩，普三界以虔祈，徧诸天而悔谢。 华灯散景，遐象星关，香雾腾芬，伫通云路。 敷真文宝忏，列璇极瑶枢，布款披心，冀回真鉴，上愿二仪宁晏，三景昭融，纬候循常，风雨时顺，宗祧先圣，社稷尊灵，承佑无涯，与天共永，玄黄分次，无乘凌孛蚀之灾，海岳封疆，无水旱兵蝗之变，三边澄静，兆庶欢康，贼子奸臣，悛心革面，夷蛮戎狄，航海梯山，帝寿延长，卜年悠久，圣贤佐理，忠孝推诚，武偃文兴，天清地静。 臣弟子某官等，明诚上达，祈向感通，天锡休祥，神资桢贶，宿冤荡释，债讼和平，万恶云收，千灾冰泮。 幽阴受福，玄祖生天，恒居道中，常与福会，不逢魔恶，不堕边夷，水火无侵，刀兵不害。 常善救物，立功佐时，举世太平，咸归道化。 心神朗慧，寿命延长，五帝四司、三官九府、天关地域，水陆冥曹、泰山酆都、九幽泉曲，落除罪简，着上生名，三业障消，十恶根净，死生受贶，幽显蒙恩。",
      "translated_text": "Amidst the feast of flavors and the harmony of the purest tones, we leap and dance, forgetting all weariness. We once believed that in the Nine Purities and Three Realms, an audience with the celestial would come to pass, and that at the gates of the sun and the fords of the stars, ascension would be ours to hope for. Yet our benighted folly, ingrained through long habit, has led our discerning nature astray. We have drowned in the river of transgressions, drifted in the sea of filth, indulged in the clamor of fame and profit, lingered in the snares of splendor, forsaken the upright for the perverse, and woven webs of manifold evils.\n\nSome have scorned the sacred scriptures, casting doubt upon the true numina. Others have stolen divine texts, transmitting them to those unworthy of the Dao. Still others, in pursuit of wealth and sensuality, have coveted fleeting glory, cloaking themselves in false purity while inwardly forsaking true rectitude. Some have exploited the Three Treasures to serve their own ends, accepting offerings from the devout yet failing to cultivate merit, embezzling from the perpetual endowments, and slandering the divine. Others, feigning mastery of celestial patterns, have presumed to foretell fortune and misfortune, inventing their own doctrines in defiance of canonical norms, their errors compounding day by day, never once awakening to their folly.\n\nSome, inwardly neglecting the work of inner visualization while outwardly abandoning the disciplines of cultivation, have profaned the Three Palaces and clouded the Eight Luminaries. The Red Child suffers the agony of sinking and drowning; the Cinnabar Field endures the sorrow of obstruction and blockage. The Six Qi fall out of harmony, and the hundred passages grow congested. Thus do transgressions summon calamity, while virtue dispels disaster—yet we, unmoved by the Dao’s compassion, remain unconvinced of the gods’ protection.\n\nForsaking the root for the branch, we have never truly repented, and now, as the faintest of life’s currents slip away, how can we hope to reclaim what is lost? Some have erected palaces and dug moats, traversed official posts and chosen dwellings by divination, raising earth and timber in construction, unwittingly offending the unseen and the manifest. They have encroached upon the earthly treasuries, desecrated mounds and tombs, ravaged sacred precincts, and defiled numinous sites, carving into blessed lands, draining springs, polluting rivers, and defying the will of heaven and earth.\n\nSome, through countless rebirths across eons, have wandered without end. Others, having once held exalted rank, ruled without Dao or mercy. Still others, as ministers or children, were neither loyal nor filial, slaughtering living beings to sustain their own lives, committing wanton or accidental killings, indulging in crimes without restraint. Some, in the name of conquest, wielded public authority for private gain, destroying jade and stone alike without pity, felling the wise and foolish together, showing no compassion.\n\nThus have the lowly been left without refuge, and both the living and the dead known only sorrow. These past transgressions now flow down to afflict this present life. Some bear the debts of nine generations and seven lineages, their departed kin burdened in the netherworld, their woes entangling their descendants. Others find their ancestral tombs restless, their spirits grieving and resentful, their grievances recorded in the courts of the unseen, bringing misfortune and decline.\n\nMoreover, heaven and earth are served by gods of punishment and virtue, by officials who scrutinize all deeds, by the eyes of yin and yang that measure transgression, and by the bureaus that record faults. Good and evil are inscribed without the slightest omission. A single misstep may bar one from the realm of longevity, casting one forever into the courts of sin, never to return for ten thousand kalpas—a fate truly pitiable.\n\nYet in the common course of things, the deluded are many. When those who do good meet with disaster, they claim that virtue brings no benefit, unaware that the lingering misfortunes of past lives have yet to be exhausted—once they are, fortune will come. When they see the wicked at ease, they claim that evil brings no harm, unaware that the residual blessings of past lives have yet to be spent—once they are, calamity will follow. Thus emboldened, they give free rein to their desires, plunging recklessly into the long night, where every suffering awaits.\n\nWere it not for the radiant light of the Great Dao, we would forever stray from the path of life. Yet we have heard that the mysterious scriptures, in their sagely teachings, open the gate of repentance. A decade of earnest cultivation may turn back a moment of time in the Grand Purity. Two hours of unwavering practice may earn the Upper Purity’s record of merit. Three years of devoted supplication may lead the Jade Purity to absolve all sins. The myriad heavens pity the world, and the ten thousand sages extend their grace, patiently guiding the lost across the ford of delusion, earnestly warning of the perils of drowning.\n\nThe leaping dragon and fish bear charts of green and vermilion; the tortoise and horse reveal dark tallies and azure texts. Books of repentance and reform are revealed, and the secrets of transcending the world and cultivating life are set forth. To witness these is to know eternal joy; to embody them is to become true. The bounty of goodness is magnified, and boundless blessings are bestowed. Through diligent practice and mindful devotion, safety and security are assured.\n\nThe Emperor, revering the patterns of the River and Luo, the sacred decrees of the Mysterious Origin, bows in submission and repentance, seeking grace. He offers sincere prayers across the Three Realms, repenting and giving thanks to all the heavens. Lamps scatter their radiance like distant stars beyond the celestial gates; incense mists rise in fragrant clouds, awaiting passage along the celestial roads. The precious texts of true repentance are arrayed, the jade pivots and pearl axes of the heavens aligned. With hearts laid bare, we hope to turn the gaze of the true mirror.\n\nMay the Two Modes know peace and tranquility, the Three Luminaries shine in harmony, the seasons follow their course, wind and rain come in due season. May the ancestral temples and former sages, the altars of soil and grain and the numinous spirits, receive boundless protection, enduring as long as heaven itself. May the cycles of heaven and earth proceed without the disasters of eclipses or comets, may the mountains and seas, the frontiers and borders, know no calamities of flood, drought, war, or locusts. May the three frontiers be stilled, the myriad people rejoice in well-being, traitors and treacherous ministers reform their hearts, and the barbarians of the four directions come bearing tribute across seas and mountains.\n\nMay the Emperor’s longevity be extended, his years prolonged without end. May sagely and worthy ministers assist in governance, loyalty and filial piety flourish, martial might be stilled and civil arts rise, heaven be clear and earth at peace.\n\nWe, your disciples, officials of such-and-such rank, now offer our sincerity upward, praying for resonance and communion. May heaven bestow auspicious blessings, may the gods grant their support and favor. May old enmities dissolve, debts and grievances be settled in peace, ten thousand evils vanish like clouds, a thousand disasters melt like ice.\n\nMay the unseen realms receive fortune, our distant ancestors ascend to heaven, ever dwelling within the Dao, forever meeting with blessings, never encountering demonic harm, never falling among the border tribes. May fire and water not assail us, blades and weapons not harm us. May we ever do good to save all beings, establish merit to aid the times, and see the world attain great peace, all returning to the transformation of the Dao.\n\nMay our minds and spirits grow bright and wise, our lifespans be extended. May the Five Emperors and Four Controllers, the Three Officials and Nine Treasuries, the Celestial Passes and Earthly Gates, the courts of the water and land, the nether realms, Mount Tai and Fengdu, the Nine Dark Springs and their winding depths—may all these remove our names from the registers of sin and inscribe them in the rolls of the living. May the obstacles of the Three Actions be dispelled, the roots of the Ten Evils purified. May the living and the dead receive blessings, the seen and unseen worlds know grace.",
      "overlap_context": "restoration of destiny, the attainment of sagehood and transcendence of the mundane—all these, transmitted through generations and treasured for ten thousand years, have been revealed to us through the guidance of masters, and we have been granted glimpses of their profundities. Though our ears are dull and our hearts unworthy, we have encountered the hidden marvels of the celestial canon; though ephemeral as mayflies and morning mushrooms, we have glimpsed the vast longevity of the *chun* tree.",
      "start_char": 8048,
      "end_char": 9248,
      "start_sentence": 389,
      "end_sentence": 436,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 42.74561405181885,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上洞神太元河图三元仰谢仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 10,
      "original_text": "今故烧香，归身归神归命大道，伏地首悔一切罪尤。 伏愿大罗虚皇、无极上圣、三尊三宝、道德至尊、三十九真，三十二帝、日月星宿、台斗真官，六甲五行，诸天诸地，一切尊圣、得道神仙，赐敕告幽明内外寮属，监天司过司命高真，察皇帝臣等改往之诚，奖皇帝臣等自新之志，无边之衅，并赐荡除。 法箓吏兵，直符神佐，鉴领誊奏，立冀感通，如愿之辰，仰荷天尊弘慈之泽，副皇帝臣等归命之诚。 谨启以闻。 次十大念 臣等 一念天地交泰，二念日月齐明，三念阴阳顺序，四念国土安宁， 五念帝王景祚，六念宰辅忠贞，七念万姓欢乐，八念九谷丰盈， 九念幽途离苦，十念大道兴行。 复炉第九 香官使者、侍直众真、五帝直符、诸天司察，臣等奉为皇帝烧香，朝谢事讫，上愿大罗三十二天天帝、直符百八十道君、直事三十九真使者、三元百二十曹职司，与今岁月日时将吏、七曜五行、上下中央四面土地里域真官正神，三界内外一切灵司，同记皇帝臣等自新之誓，谛纳请愿之诚，使嘉气荣光，照耀神州坛场之内，三元五帝，呈瑞宫阙斋静之中，龙马负图，龟鱼表贶朱锑再出，绿字重新。 皇帝道德昭彰，玄功遐被，祚历延永，率土太平，臣及弟子等众罪蠲消，万善臻集，普天受福，幽显沾恩，九祖三师，克升真果，侍香侍灯玉童玉女，三界官属，应感神明，奏臣所启，径御大罗虚皇玉帝御前。 次学仙引出 次巡中灯，出地户，绕三光，巡天一周，至地户",
      "translated_text": "Now, therefore, we burn incense, surrendering body, spirit, and life to the Great Dao, prostrating ourselves to repent all sins and transgressions. We humbly pray that the Great Lofty Jade Emperor of the Primordial Void, the Limitless Supreme Saints, the Three Honored Ones and Three Treasures, the Most Revered of Dao and Virtue, the Thirty-Nine Perfected, the Thirty-Two Emperors, the sun, moon, and stellar lodges, the True Officials of the Dipper and Terrace, the Six Jia and Five Agents, all heavens and earths, every revered sage and attained immortal—may they issue decrees to the inner and outer bureaus of the seen and unseen, the celestial overseers of transgressions, the High Perfected who govern fate, to inspect the sincerity of our emperor and ministers in amending past wrongs, and to reward the resolve of our emperor and ministers in self-renewal. May all boundless offenses be wholly dissolved. May the divine soldiers of the dharma registers, the direct talismanic spirits, and assisting deities examine, record, and memorialize our plea, swiftly bringing about resonance. At this hour of fulfillment, may we look up to receive the vast compassion of the Heavenly Worthies, matching the sincerity of our emperor and ministers in surrendering to the Dao.\n\nWe respectfully submit this petition for your hearing.\n\n**The Ten Great Aspirations**\nWe, your servants, aspire:\nFirst, that heaven and earth unite in harmony;\nSecond, that sun and moon shine with equal brightness;\nThird, that yin and yang follow their proper order;\nFourth, that the realm enjoy peace and tranquility;\nFifth, that the imperial reign flourish in splendor;\nSixth, that ministers and counselors remain loyal and steadfast;\nSeventh, that all people rejoice in happiness;\nEighth, that the nine grains yield abundant harvests;\nNinth, that the dark paths be freed from suffering;\nTenth, that the Great Dao flourish and prevail.\n\n**Ninth Offering at the Incense Burner**\nMay the Incense Officials, the attending Perfected, the Direct Talismans of the Five Emperors, and the celestial overseers—we, your servants, on behalf of the emperor, having completed the offering of incense and thanksgiving—now pray that the Heavenly Emperors of the Thirty-Two Heavens of Great Lofty, the One Hundred Eighty Dao Lords of the Direct Talismans, the Thirty-Nine Perfected Envoys of Direct Service, the One Hundred Twenty Bureaus of the Three Primes, along with the officers of this year, month, day, and hour, the Seven Luminaries and Five Agents, the local earth gods of the four directions and center, and all spiritual authorities within and beyond the Three Realms, together record the vows of self-renewal made by our emperor and ministers, and solemnly accept the sincerity of our prayers. May auspicious qi and radiant light illumine the altar grounds of the divine continent, may the Three Primes and Five Emperors manifest portents within the tranquil halls of the palace, may dragon-horses bear the charts and tortoises and fish display blessings, may the vermilion graphs reappear and the green characters renew.\n\nMay the emperor’s virtue and power shine forth, his mysterious merit extend far and wide, his reign endure long, and the land know great peace. May we, your servants, and all disciples have our sins eradicated, all virtues amassed, the whole world receive blessings, the seen and unseen realms be graced with favor. May the nine generations of ancestors and the three masters attain the fruit of Perfection. May the jade lads and jade maidens who attend incense and lamps, the officials of the Three Realms, and all responsive spirits memorialize our petition and present it directly before the Jade Emperor of the Great Lofty Primordial Void.\n\n**Next: The Immortal’s Procession**\n**Next: Circumambulating the Central Lamp**\nExiting the Earth Gate, encircling the Three Lights, circumambulating heaven once, returning to the Earth Gate.",
      "overlap_context": " Four Controllers, the Three Officials and Nine Treasuries, the Celestial Passes and Earthly Gates, the courts of the water and land, the nether realms, Mount Tai and Fengdu, the Nine Dark Springs and their winding depths—may all these remove our names from the registers of sin and inscribe them in the rolls of the living. May the obstacles of the Three Actions be dispelled, the roots of the Ten Evils purified. May the living and the dead receive blessings, the seen and unseen worlds know grace.",
      "start_char": 9248,
      "end_char": 9832,
      "start_sentence": 437,
      "end_sentence": 450,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 19.480668783187866,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上洞神太元河图三元仰谢仪.txt",
        "category": "威仪类"
      }
    },
    {
      "chunk_index": 11,
      "original_text": "次出户咒曰： 六方降真，九天垂佑，善神相亲，功德成就。 毕，叩齿咽液各三十二徧。 次出还斋所。 太上洞神太元河图三元仰谢仪竟",
      "translated_text": "Next, upon exiting the gate, the incantation is recited:\n*\"May the Perfected descend from the six directions, may the Nine Heavens bestow their protection, may benevolent spirits draw near, and merits be accomplished.\"*\nWhen finished, strike the teeth and swallow the saliva thirty-two times each.\nNext, return to the ritual chamber.\n\nThus concludes *The Rite of Reverent Thanksgiving to the Three Primordials of the Great Cavern Spirit and the Supreme Mystery of the River Chart*.",
      "overlap_context": "ions of ancestors and the three masters attain the fruit of Perfection. May the jade lads and jade maidens who attend incense and lamps, the officials of the Three Realms, and all responsive spirits memorialize our petition and present it directly before the Jade Emperor of the Great Lofty Primordial Void.\n\n**Next: The Immortal’s Procession**\n**Next: Circumambulating the Central Lamp**\nExiting the Earth Gate, encircling the Three Lights, circumambulating heaven once, returning to the Earth Gate.",
      "start_char": 9832,
      "end_char": 9902,
      "start_sentence": 451,
      "end_sentence": 455,
      "model_used": "mistralai/mistral-large-2512",
      "translation_time": 3.0232667922973633,
      "metadata": {
        "source_file": "dao\\正统道藏洞神部\\威仪类\\太上洞神太元河图三元仰谢仪.txt",
        "category": "威仪类"
      }
    }
  ]
}